{
  "surah": "At-Takaathur",
  "surah_number": 102,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "ابو مُطرّف رضی اللہ عنہ فرماتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، آپ {’’ اَلْهٰىكُمُ التَّكَاثُرُ ‘‘} تلاوت فرما رہے تھے۔ آپ نے فرمایا : [ يَقُوْلُ ابْنُ آدَمَ مَالِيْ، مَالِيْ، قَالَ وَهَلْ لَكَ يَا ابْنَ آدَمَ! مِنْ مَّالِكَ إِلَّا مَا أَكَلْتَ فَأَفْنَيْتَ أَوْ لَبِسْتَ فَأَبْلَيْتَ أَوْ تَصَدَّقْتَ فَأَمْضَيْتَ؟ ] [ مسلم، الزھد والرقائق، باب الدنیا سجن للمؤمن : ۲۹۵۸ ] ’’ابن آدم کہتا ہے میرا مال، میرا مال، حالانکہ اے آدم کے بیٹے! تیرے مال میں سے تیرا مال تو صرف وہی ہے جو تونے کھایا اور فنا کر دیا، یا پہنا اور پرانا کر دیا، یا صدقہ کیا اور آگے بھیج دیا۔‘‘ ¤ (آیت 1) ➊ {اَلْهٰىكُمُ التَّكَاثُرُ: ’’أَلْهٰي يُلْهِيْ‘‘ ’’ لَهْوٌ‘‘} سے ہے، جس کا معنی ہے ’’کسی چیز کے ساتھ اتنا لگاؤ اور دلچسپی جو اسے اہم چیزوں سے غافل کر دے۔‘‘ {’’ التَّكَاثُرُ ‘‘ ’’ كَثْرَةٌ ‘‘} سے باب تفاعل کا مصدر ہے، جس میں تشارک کا معنی پایا جاتا ہے، یعنی ایک دوسرے سے زیادہ حاصل کرنے کی کوشش۔ مال و اولاد اور جاہ و شرف، الغرض دنیا کی ہر چیز دوسرے تمام لوگوں سے زیادہ حاصل کرنے کی حرص اور پھر حاصل ہو جانے پر دوسروں پر فخر کرنا۔ ¤ ➋ اس حرص کی حد کیا ہے؟ ابن عباس رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَوْ كَانَ لاِبْنِ آدَمَ وَادِيَانِ مِنْ مَّالٍ لاَبْتَغٰي ثَالِثًا، وَلاَ يَمْلَأُ جَوْفَ ابْنِ آدَمَ إِلاَّ التُّرَابُ، وَيَتُوْبُ اللّٰهُ عَلٰي مَنْ تَابَ ] [ بخاري، الرقاق، باب ما یتقی من فتنۃۃ المال: ۶۴۳۶ ] ’’اگر ابن آدم کے پاس مال کی بھری ہوئی دو وادیاں ہوں تو وہ تیسری وادی تلاش کرے گا اور آدم کے بیٹے کے پیٹ کو مٹی کے علاوہ کوئی چیز نہیں بھرتی اور اللہ اس کی طرف پلٹ آتا ہے جو واپس پلٹ آئے۔‘‘ سب سے زیادہ نقصان دہ حرص دو چیزوں کی ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [مَا ذِئْبَانِ جَائِعَانِ أُرْسِلاَ فِيْ غَنَمٍ بِأَفْسَدَ لَهَا مِنْ حِرْصِ الْمَرْءِ عَلَی الْمَالِ وَالشَّررَفِ لِدِيْنِهِ ] [ ترمذي، الزھد، باب حدیث ما ذئبان جائعان… : ۲۳۷۶، وصححہ الألباني ] ’’دو بھوکے بھیڑیے جو بھیڑ بکریوں میں چھوڑ دیے جائیں، وہ انھیں اتنا خراب نہیں کرتے جتنا آدمی کے مال اور شرف ( اونچا ہونے) کی حرص اس کے دین کو خراب کرتی ہے۔‘‘ ¤ ➌ کس چیز سے غافل کر دیا؟ اللہ کے احکام سے، اس کے دین سے اور آخرت سے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {حَتّٰى زُرْتُمُ الْمَقَابِرَ: ’’ زُرْتُمْ‘‘ ’’زَارَ يَزُوْرُ زِيَارَةً‘‘} (ن) (ملنے کے لیے جانا) سے ماضی معلوم ہے۔ {’’ الْمَقَابِرَ ‘‘ ’’مَقْبَرَةٌ‘‘} کی جمع ہے جو {’’قَبَرَ يَقْبُرُ قَبْرًا‘‘} (ن) (دفن کرنا) سے اسم ظرف ہے، دفن کی جگہیں، قبرستان۔ {’’ زُرْتُمُ الْمَقَابِرَ ‘‘} (قبرستان جا دیکھے) کا مطلب یہ ہے کہ تمھاری موت آگئی، یعنی موت آنے تک یہ غفلت طاری رہی، بلکہ جیسے جیسے موت قریب آتی گئی غفلت کا یہ نشہ بڑھتا گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَكْبَرُ ابْنُ آدَمَ، وَ يَكْبَرُ مَعَهُ اثْنَتَانِ حُبُّ الْمَالِ، وَطُوْلُ الْعُمُرِ ] [ بخاري، الرقاق، باب من بلغ ستین سنۃ… : ۶۴۲۱ ] ’’آدمی بڑا ہوتا جاتا ہے اور اس کے ساتھ دو چیزیں بڑی ہوتی جاتی ہیں، مال کی محبت اور لمبی عمر کی محبت۔‘‘"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 4،3) {كَلَّا سَوْفَ تَعْلَمُوْنَ …:} یعنی اپنی غفلت کا انجام جان لوگے۔ تاکید کے لیے بات دہرائی ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4،3) {كَلَّا سَوْفَ تَعْلَمُوْنَ …:} یعنی اپنی غفلت کا انجام جان لوگے۔ تاکید کے لیے بات دہرائی ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5تا7) { كَلَّا لَوْ تَعْلَمُوْنَ عِلْمَ الْيَقِيْنِ …:’’ لَتَرَوُنَّ ‘‘ ’’رَاٰي يَرٰي رُؤْيَةً‘‘} (ف) (دیکھنا) سے جمع حاضر فعل مضارع معلوم بانون تاکید ثقیلہ ہے، تم ضرور بالضرور دیکھو گے۔ ان آیات کی تفسیر کے لیے دیکھیے سورۂ حاقہ کی آیت (۵۱) کی تفسیر۔ مسلمان اور کافر سبھی جہنم کو دیکھیں گے، جیساکہ فرمایا : « وَ اِنْ مِّنْكُمْ اِلَّا وَارِدُهَا» [ مریم : ۷۱ ] ’’تم میں سے ہر کوئی اس پر وارد ہوگا۔‘‘ پھر اسے یقین کی آنکھ سے دیکھ لیں گے، کوئی شک و شبہ نہیں رہے گا۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 5تا7) { كَلَّا لَوْ تَعْلَمُوْنَ عِلْمَ الْيَقِيْنِ …:’’ لَتَرَوُنَّ ‘‘ ’’رَاٰي يَرٰي رُؤْيَةً‘‘} (ف) (دیکھنا) سے جمع حاضر فعل مضارع معلوم بانون تاکید ثقیلہ ہے، تم ضرور بالضرور دیکھو گے۔ ان آیات کی تفسیر کے لیے دیکھیے سورۂ حاقہ کی آیت (۵۱) کی تفسیر۔ مسلمان اور کافر سبھی جہنم کو دیکھیں گے، جیساکہ فرمایا : « وَ اِنْ مِّنْكُمْ اِلَّا وَارِدُهَا» [ مریم : ۷۱ ] ’’تم میں سے ہر کوئی اس پر وارد ہوگا۔‘‘ پھر اسے یقین کی آنکھ سے دیکھ لیں گے، کوئی شک و شبہ نہیں رہے گا۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 5تا7) { كَلَّا لَوْ تَعْلَمُوْنَ عِلْمَ الْيَقِيْنِ …:’’ لَتَرَوُنَّ ‘‘ ’’رَاٰي يَرٰي رُؤْيَةً‘‘} (ف) (دیکھنا) سے جمع حاضر فعل مضارع معلوم بانون تاکید ثقیلہ ہے، تم ضرور بالضرور دیکھو گے۔ ان آیات کی تفسیر کے لیے دیکھیے سورۂ حاقہ کی آیت (۵۱) کی تفسیر۔ مسلمان اور کافر سبھی جہنم کو دیکھیں گے، جیساکہ فرمایا : « وَ اِنْ مِّنْكُمْ اِلَّا وَارِدُهَا» [ مریم : ۷۱ ] ’’تم میں سے ہر کوئی اس پر وارد ہوگا۔‘‘ پھر اسے یقین کی آنکھ سے دیکھ لیں گے، کوئی شک و شبہ نہیں رہے گا۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { ثُمَّ لَتُسْـَٔلُنَّ يَوْمَىِٕذٍ عَنِ النَّعِيْمِ:} یعنی صحت و عافیت، کھانے پینے اور دوسری تمام نعمتوں کے بارے میں سوال ہوگا کہ ان کا کہاں تک شکر ادا کیا؟ احادیث سے معلوم ہوتا ہے کہ کوئی چھوٹی سے چھوٹی لذت اور معمولی سے معمولی عافیت ایسی نہیں جس کے بارے میں سوال نہ ہو۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک دن نبی صلی اللہ علیہ وسلم اور ابوبکر و عمر رضی اللہ عنھما بھوک کی وجہ سے گھر سے نکلے اور ایک انصاری کے گھر آئے، اس نے مہمانی میں کھجوریں اور بکری کا گوشت پیش کیا۔ آپ نے گوشت اور کھجوریں کھائیں اور اوپر سے شیریں پانی پیا۔ جب خوب سیر ہوچکے تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ وَالَّذِيْ نَفْسِيْ بِيَدِهِ! لَتُسْأَلُنَّ عَنْ هٰذَا النَّعِيْمِ يَوْمَ الْقِيَامَةِ ] [ مسلم، الأشربۃ، باب جواز استتباعہ غیرہ… : ۲۰۳۸ ] ’’اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! تم سے قیامت کے دن اس نعمت کے بارے میں ( بھی) سوال ہوگا۔‘‘"
    }
  ]
}