{
  "surah": "Al-Kawthar",
  "surah_number": 108,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "مکہ میں رسول اللہ صلی اللہ علیہ وسلم کے دعوتِ اسلام دینے کے بعد آپ پر بہت مشکل حالات گزرے، سب لوگ دشمن بن گئے، ہر طرف مخالفت، مالی پریشانیاں الگ، ایمان لانے والے بالکل تھوڑے سے، مزید یہ کہ نرینہ اولاد جو ہوئی وہ فوت ہو گئی، اس پر دشمن کا خوش ہونا اور آپ کا غمگین اور پریشان ہونا ایک فطری امر تھا۔ اللہ تعالیٰ نے جس طرح سورۂ ضحی میں آپ صلی اللہ علیہ وسلم کو تسلی دیتے ہوئے فرمایا : « وَ لَلْاٰخِرَةُ خَيْرٌ لَّكَ مِنَ الْاُوْلٰى (4) وَ لَسَوْفَ يُعْطِيْكَ رَبُّكَ فَتَرْضٰى» [ الضحی : ۴، ۵ ] (اور یقینا پیچھے آنے والی حالت تیرے لیے پہلی سے بہتر ہے اور عنقریب تیرا رب تجھے ضرور اتنا عطا کرے گا کہ تو خوش ہو جائے گا) اور سورۂ انشراح میں فرمایا : « وَ رَفَعْنَا لَكَ ذِكْرَكَ» [ الانشراح : ۴ ] (اور ہم نے تیرے لیے تیرا ذکر بلند کر دیا) اسی طرح اس سورت میں بھی اللہ تعالیٰ نے اپنے انعامات کا تذکرہ فرما کر آپ کو تسلی دی ہے۔ ¤ (آیت 1) ➊ { اِنَّاۤ اَعْطَيْنٰكَ الْكَوْثَرَ: ’’ الْكَوْثَرَ ‘‘ ’’ كَثْرَةٌ ‘‘} سے {’’فَوْعَلٌ‘‘} کا وزن ہے جو مبالغے کا معنی دے رہا ہے، بے انتہا کثرت۔ یعنی دشمن تو یہ سمجھ رہے ہیں کہ آپ کے پاس کچھ نہیں، مگر حقیقت یہ ہے کہ ہم نے آپ کو بے انتہا دیا ہے۔ {’’ الْكَوْثَرَ ‘‘} میں وہ ساری خیر کثیر شامل ہے جو اللہ تعالیٰ نے آپ کو عطا فرمائی، مثلاً اسلام، نبوت، اخلاق حسنہ، بہترین تابع دار امت، جنت اور دوسری نعمتیں جو شمار نہیں ہو سکتیں۔ لغت کے لحاظ سے {’’ الْكَوْثَرَ ‘‘} کا معنی یہی ہے، البتہ بہت سی صحیح احادیث میں آیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کوثر جنت میں ایک نہر ہے جو اللہ نے مجھے عطا فرمائی ہے۔ اسی طرح اللہ تعالیٰ محشر میں آپ صلی اللہ علیہ وسلم کو جو حوض عطا کرے گا اس کا نام بھی آپ صلی اللہ علیہ وسلم نے کوثر بتایا۔ اس لحاظ سے یہ تفسیر مقدم ہے، مگر ترجیح کی ضرورت تب ہے جب دونوں تفسیروں میں تعارض ہو، جو یہاں ہے ہی نہیں۔ چنانچہ صحیح بخاری میں ہے کہ سعید بن جبیر رحمہ اللہ نے ابن عباس رضی اللہ عنھما سے روایت کی کہ انھوں نے {’’ الْكَوْثَرَ ‘‘} کے متعلق فرمایا: ’’اس سے مراد وہ خیر ہے جو اللہ نے آپ صلی اللہ علیہ وسلم کو عطا فرمائی۔‘‘ راوی کہتا ہے کہ میں نے سعید بن جبیر رحمہ اللہ سے پوچھا کہ لوگ کہتے ہیں کہ وہ جنت میں ایک نہر ہے؟ تو سعید رحمہ اللہ نے کہا : ’’جنت میں جو نہر ہے وہ بھی اس خیر میں شامل ہے جو اللہ نے آپ کو عطا فرمائی۔‘‘ [ بخاري، التفسیر، سورۃ : «إنا أعطیناک الکوثر» : ۴۹۶۶ ] ¤ ➋ نہر کوثر جنت میں ہے اور حوض کوثر محشر کے میدان میں ہوگا، بعض اوقات اس پر بھی نہر کوثر کا لفظ آتا ہے، کیونکہ اس حوض میں بھی جنت کے دوپرنالوں سے پانی گر رہا ہوگا۔ گویا حوض کا اصل بھی جنت والی نہر کوثر ہے۔ (فتح الباری) انس رضی اللہ عنہ فرماتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ بَيْنَمَا أَنَا أَسِيْرُ فِي الْجَنَّةِ إِذَا أَنَا بِنَهَرٍ حَافَتَاهُ قِبَابُ الدُّرِّ الْمُجَوَّفِ، قُلْتُ مَا هٰذَا يَا جِبْرِيْلُ !؟ قَالَ هٰذَا الْكَوْثَرُ الَّذِيْ أَعْطَاكَ رَبُّكَ فَإِذَا طِيْبُهُ أَوْ طِيْنُهُ مِسْكٌ أَذْفَرُ ] [ بخاري، الرقاق، باب في الحوض : ۶۵۸۱ ] ’’میں جنت میں چلا جا رہا تھا تو اچانک ایک نہر آگئی جس کے کنارے کھوکھلے موتیوں کے قبے تھے۔ میں نے کہا : ’’اے جبریل! یہ کیا ہے؟‘‘ تو انھوں نے فرمایا : ’’یہ کوثر ہے جو اللہ نے آپ کو عطا فرمائی ہے۔‘‘ پھر دیکھا تو اس کی خوشبو یا مٹی مہکنے والی کستوری کی طرح تھی۔‘‘ ¤ ➌ حوض کوثر میدان محشر میں ہے، جہاں رسول اللہ صلی اللہ علیہ وسلم اپنی امت کا استقبال کریں گے اور انھیں پانی پلائیں گے۔ حافظ ابن حجر رحمہ اللہ فتح الباری میں فرماتے ہیں کہ حوضِ کوثر کی روایات تیس(۳۰) سے زیادہ صحابہ سے آئی ہیں، جن میں سے بیس (۲۰) صحابہ کی احادیث صحیحین میں ہیں، باقی دوسری کتابوں میں ہیں۔ ان کی نقل صحیح ہے اور ان کے راوی مشہور ہیں۔ [ دیکھیے فتح الباري، کتاب الرقاق، باب الحوض ] ¤ ➍ ابو ذر رضی اللہ عنہ حوضِ کوثر میں جنت کے پرنالوں کا گرنا اور حوض کی تفصیل بیان کرتے ہوئے فرماتے ہیں کہ میں نے عرض کیا : ’’اے اللہ کے رسول! حوض کے برتن کیسے ہوں گے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ وَالَّذِيْ نَفْسُ مُحَمَّدٍ بِيَدِهِ! لَآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ نُجُوْمِ السَّمَاءِ وَكَوَاكِبِهَا، أَلَا فِي اللَّيْلَةِ الْمُظْلِمَةِ الْمُصْحِيَةِ، آنِيَةُ الْجَنَّةِ مَنْ شَرِبَ مِنْهَا لَمْ يَظْمَأْ آخِرَ مَا عَلَيْهِ، يَشْخَبُ فِيْهِ مِيْزَابَانِ مِّنَ الْجَنَّةِ مَنْ شَرِبَ مِنْهُ لَمْ يَظْمَأْ عَرْضُهُ مِثْلُ طُوْلِهِ مَا بَيْنَ عَمَّانَ إِلٰی أَيْلَةَ مَاؤُهُ أَشَدُّ بَيَاضًا مِّنَ اللَّبَنِ وَ أَحْلٰی مِنَ الْعَسَلِ ] [ مسلم، الفضائل، باب إثبات حوض نبینا صلی اللہ علیہ وسلم وصفاتہ : ۲۳۰۰ ] ’’اس ذات کی قسم جس کے ہاتھ میں محمد( صلی اللہ علیہ وسلم ) کی جان ہے! اس کے برتن آسمان کے تاروں سے زیادہ ہیں، یاد رکھو ! تارے بھی اس رات کے جو تاریک ہو اور بادل کے بغیر ہو۔ جنت کے برتن ایسے ہیں کہ جو ان سے پئے گا کبھی پیاسا نہ ہوگا، اس وقت کے آخر تک جو اس پر گزرے گا۔ اس حوض میں جنت سے دو پرنالے گرتے ہیں، جو اس سے پئے گا کبھی پیاسا نہ ہوگا، اس کا عرض اس کے طول کے برابر ہے، جتنا عمان سے ایلہ تک فاصلہ ہے۔ اس کا پانی دودھ سے زیادہ سفید اور شہد سے زیادہ میٹھا ہے۔‘‘ ¤ ➎ کوثر کا ایک اور معنی بھی کیا گیا ہے، مشہور امامِ فقہ ابن جنی نے آیت : « اِنَّ شَانِئَكَ هُوَ الْاَبْتَرُ » کی مناسبت سے {’’ الْكَوْثَرَ ‘‘} کا معنی{ ’’ ذُرِّيَّةٌ كَثِيْرَةٌ ‘‘} (کثیر اولاد) کیا ہے۔ کفارِ قریش اور آپ سے دشمنی رکھنے والے کہتے تھے کہ آپ ’’ابتر‘‘ (بے اولاد) ہیں، فوت ہوگئے تو ہماری جان چھوٹ جائے گی۔ اللہ تعالیٰ نے فرمایا، ہم نے آپ کو کوثر یعنی اولاد کثیر عطا فرمائی۔ مراد اولاد فاطمہ ہے، کیونکہ بیٹی کی اولاد بھی قرآن کی رو سے اولاد ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «وَ مِنْ ذُرِّيَّتِهٖ دَاوٗدَ وَ سُلَيْمٰنَ » [الأنعام : ۸۴] ’’ اور اس (ابراہیم) کی اولاد میں سے داؤد اور سلیمان کو (ہدایت دی)۔‘‘اس کے بعد کئی پیغمبروں کا نام لے کر فرمایا : « وَ زَكَرِيَّا وَ يَحْيٰى وَ عِيْسٰى وَ اِلْيَاسَ» [الأنعام :۸۵] ’’یعنی اس (ابراہیم) کی اولاد میں سے زکریا ، یحییٰ ، عیسیٰ اور الیاس کو بھی ہدایت دی۔‘‘ معلوم ہوا عیسیٰ علیہ السلام بھی ابراہیم علیہ السلام کی اولاد ہیں، حالانکہ ان کا باپ بالاتفاق تھا ہی نہیں، بلکہ وہ ابراہیم علیہ السلام کی بیٹی مریم کی اولاد ہیں۔ معلوم ہوا کہ آدمی کی بیٹی کی اولاد بھی اس کی اولاد ہوتی ہے۔ (قاسمی) یہ معنی یعنی اولاد کثیر بھی {’’ الْكَوْثَرَ ‘‘} کے اس معنی میں شامل ہے جو ابن عباس رضی اللہ عنھما نے کیا ہے، یعنی خیر کثیر اور اس کی {’’ الْاَبْتَرُ ‘‘ } کے ساتھ مناسبت بھی ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت2 ) ➊ { فَصَلِّ لِرَبِّكَ وَ انْحَرْ:} عام طور پر سمجھا جاتا ہے کہ اس آیت میں نماز پڑھنے اور قربانی کرنے کا حکم دیا گیا ہے، حالانکہ یہاں اصل مفہوم یہ ہے کہ نماز پڑھو تو صرف اپنے رب کے لیے اور قربانی کرو تو وہ بھی اسی کے لیے، کسی غیر کے لیے نہیں۔ یہ ایسے ہی ہے جیسے کسی سے کہا جائے، کھڑے ہو کر نماز پڑھو، تو اس سے مراد نماز پڑھنے کا حکم دینا نہیں ہوتا بلکہ مراد یہ حکم ہوتا ہے کہ نماز کھڑے ہو کر پڑھو، بیٹھ کر نہ پڑھو۔ یہی مفہوم سورۂ انعام میں بھی ادا ہوا ہے، فرمایا : «قُلْ اِنَّ صَلَاتِيْ وَ نُسُكِيْ وَ مَحْيَايَ وَ مَمَاتِيْ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ (162) لَا شَرِيْكَ لَهٗ وَ بِذٰلِكَ اُمِرْتُ وَ اَنَا اَوَّلُ الْمُسْلِمِيْنَ » [ الأنعام : ۱۶۲، ۱۶۳ ] ’’کہہ دے بلاشبہ میری نماز، میری قربانی، میری زندگی اور میری موت اللہ رب العالمین کے لیے ہے، جس کا کوئی شریک نہیں اور مجھے اسی کا حکم دیا گیا ہے اور میں سب سے پہلا فرماں بردار ہوں۔‘‘ ¤ ➋ اللہ تعالیٰ نے کوثر عطا فرمانے کا احسان ذکر کرکے صرف رب تعالیٰ ہی کے لیے نماز اور قربانی کا حکم دیا۔ {’’ الْكَوْثَرَ ‘‘} (خیر کثیر) کے لفظ میں وہ سب کچھ آگیا جو اللہ نے آپ کو عطا فرمایا، کوئی چیز ایسی نہیں جو اس میں شامل نہ ہو۔{’’ فَصَلِّ ‘‘} کی فاء کا مطلب یہ ہے کہ ہم نے آپ کو خیر کثیر عطا فرمائی ہے تو اس کے شکر کا طریقہ یہ ہے کہ آپ کی ہر عبادت (بدنی ہو یا مالی) صرف اسی کے لیے ہونی چاہیے، کسی غیر کے لیے نہیں۔ یہ انتہائی ناشکری ہے کہ ہر نعمت اللہ نے دی ہو اور بدنی یا مالی بندگی کسی اور کی ہو۔ ¤ ➌ بظاہر کہنا تو یہ چاہیے تھا کہ ہم نے تجھے کوثر عطا کی، پس تو ہمارے ہی لیے نماز پڑھ اور قربانی کر، مگر فرمایا: ’’ تو اپنے رب ہی کے لیے نماز پڑھ اور قربانی کر۔‘‘ اسے {’’اِلْتِفَاتٌ مِّنَ الْمُتَكَلِّمِ إِلَي الْغَائِبِ‘‘} کہتتے ہیں۔ مقصد توجہ دلانا ہے کہ رب ہونے کی وجہ سے ہمارا حق ہے کہ ہماری ہی عبادت کرو، کسی اور کی نہیں۔ ¤ ➍ بعض روایات میں علی رضی اللہ عنہ سے مروی ہے کہ{’’ وَ انْحَرْ ‘‘} کا معنی نماز میں سینے پر ہاتھ باندھنا ہے، مگر وہ روایات صحیح نہیں۔ البتہ سینے پر ہاتھ باندھنے کا مسئلہ دوسری صحیح احادیث سے ثابت ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { اِنَّ شَانِئَكَ هُوَ الْاَبْتَرُ: ’’شَانِئٌ‘‘ ’’ شَنِئَهٗ شَنْئًا ‘‘} (س، ف) (بروزن {فَلْسٌ} ) {’’وَشَنَئَانًا‘‘} (نون کے فتحہ اور سکون کے ساتھ) سے اسم فاعل ہے، اس کا معنی ’’دشمنی رکھنے والا‘‘ ہے۔ {’’ الْاَبْتَرُ ‘‘} جس کی اولاد نہ ہو۔ اصل میں یہ {’’ بَتَرَهٗ ‘‘} سے مشتق ہے، جس کا معنی ہے {’’ قَطَعَهٗ ‘‘} اس نے اسے کاٹ دیا۔ {’’حِمَارٌ أَبْتَرُ ‘‘} وہ گدھا جس کی دم کٹی ہوئی ہو۔ دم کٹے سانپ کو بھی ’’ابتر ‘‘ کہتے ہیں۔ ¤ ➋ {’’ هُوَ ‘‘} ضمیر لانے کے علاوہ {’’ الْاَبْتَرُ ‘‘} پر الف لام لانے سے کلام میں مزید حصر پیدا ہوگیا، یعنی دشمن ہی لاولد ہے، تم نہیں۔ رسول اللہ صلی اللہ علیہ وسلم کے دشمن کہتے تھے کہ محمد( صلی اللہ علیہ وسلم ) اکیلے ہیں، ان کی اولاد نہیں، مر گئے تو کوئی نام لینے والا نہ ہوگا۔ اللہ تعالیٰ نے فرمایا، آپ کے نام لینے والے بے شمار ہوں گے اور قیامت تک رہیں گے۔ کلمہ پڑھتے وقت، اذان میں، اقامت میں، نماز میں، درود میں، غرض آپ کا ذکر ہمیشہ رہے گا۔ آپ کی نسبت پر لوگ فخر کریں گے۔ اولاد بھی بہت ہوگی، مگر آپ کے دشمن کا کوئی نام لیوا نہیں ہوگا۔ اگر ان کی نسل چلی بھی تو اسے اپنے کافر باپ کی طرف منسوب ہونے پر کوئی فخر نہیں ہو گا۔"
    }
  ]
}