{
  "surah": "Hud",
  "surah_number": 11,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "اس سورت میں توحید کی دعوت، انبیاء کی اس دعوت کے دوران میں عزیمت اور ان پر گزرنے والے حالات و واقعات، انھیں جھٹلانے والوں کا بدترین انجام اور ان پر آنے والے عذابوں کے تذکرے اور اہل ایمان کی نجات اور ان پر اللہ تعالیٰ کے انعامات کا ذکر ہے۔ چونکہ اس میں انذار (ڈرانے)کا پہلو غالب ہے اس لیے رسول اللہ صلی اللہ علیہ وسلم پر اس کا بہت اثر ہوا، چنانچہ عبد اللہ بن عباس رضی اللہ عنھما بیان کرتے ہیں کہ ابوبکر رضی اللہ عنہ نے عرض کیا : [ يَا رَسُوْلَ اللّٰهِ! قَدْ شِبْتَ، قَالَ شَيَّبَتْنِيْ هُوْدٌ وَالْوَاقِعَةُ وَالْمُرْسَلاَتُ وَ { عَمَّ يَتَسَآءَلُوْنَ۠} وَ { اِذَا الشَّمْسُ كُوِّرَتْ } ] [ ترمذی،ی، التفسیر، باب ومن سورۃ الواقعۃ : ۳۲۹۷۔ السلسلۃ الصحیحۃ : ۹۵۵ ] ’’یا رسول اللہ! آپ بوڑھے ہو گئے۔‘‘ فرمایا : ’’مجھے ہود، واقعہ، مرسلات، عم یتساء لون اور تکویر نے بوڑھا کر دیا۔‘‘ ¤ (آیت 1) ➊ {الٓرٰ:} دیکھیے سورۂ بقرہ کی پہلی آیت۔ ¤ ➋ {كِتٰبٌ اُحْكِمَتْ اٰيٰتُهٗ :} یہاں قرآن کریم کی چار صفات بیان ہوئی ہیں، پہلی یہ کہ یہ قرآن (پڑھا جانے والا مجموعہ) کتاب (لکھا ہوا مجموعہ) بھی ہے، دوسری یہ کہ اس کی آیات محکم یعنی خوب پختہ، مضبوط اور اٹل نازل کی گئی ہیں، جن میں کوئی عیب یا کمی نہیں اور نہ وہ (مجموعی اعتبار سے) منسوخ ہیں، نہ منسوخ ہوں گی اور نہ اس کے مقابلے میں کوئی کتاب لائی جا سکتی ہے، خواہ ساری مخلوق جمع ہو جائے، ایسی محکم آیات والی کتاب صرف یہ ہے۔ ¤ ➌ { ثُمَّ فُصِّلَتْ:} تیسری یہ کہ اس کی آیات ایسی واضح ہیں اور کھول کر بیان کی گئی ہیں کہ کسی آیت کے مفہوم میں ابہام یا پیچیدگی نہیں ہے، پھر ساری کتاب مختلف سورتوں اور آیتوں میں تقسیم ہے۔ ہر آیت جدا جدا ہے، اپنی جگہ مستقل، ایک بے حد خوبصورت ہار کی طرح جو رنگا رنگ مضامین توحید، آخرت، نبوت، قصص کے موتیوں سے پرویا ہوا ہے اور وہ نہایت مناسب فاصلے، ترتیب اور حسن سے اپنی اپنی جگہ جگمگا رہے ہیں، پھر نزول میں بھی آیات اور سورتیں ضرورت کے مطابق الگ الگ نازل کی گئی ہیں۔ {’’ فُصِّلَتْ ‘‘} میں یہ سب باتیں آ جاتی ہیں۔ ¤ ➍ { مِنْ لَّدُنْ حَكِيْمٍ خَبِيْرٍ :} چوتھی یہ کہ یہ کسی انسان، فرشتے، جن یا کسی بھی مخلوق کی تصنیف نہیں، بلکہ اس ذات پاک کا کلام ہے جو حکیم ہے۔ حکیم کا ایک معنی پختہ و محکم بنانے والا ہے، جس کی بنائی ہوئی ہر چیز نہایت محکم، پختہ اور مضبوط ہے، فرمایا : «{ صُنْعَ اللّٰهِ الَّذِيْۤ اَتْقَنَ كُلَّ شَيْءٍ }» [ النمل : ۸۸ ] ’’اس اللہ کی کاری گری سے جس نے ہر چیز کو مضبوط بنایا۔‘‘ یعنی پہاڑ اور ان کا قیامت کو بادلوں کی طرح چلنا اس اللہ کی کاری گری ہے جس نے ہر چیز کو مضبوط بنایا۔ جب اس کی مخلوق کا یہ حال ہے تو اس کے کلام کے محکم ہونے کی کوئی حد ہو گی؟ حکیم کا دوسرا معنی حکمت، یعنی دانائی والا ہے، یعنی اس کی تمام آیات کمال حکمت اور دانائی سے پُر ہیں، خبیر یعنی ان کو اتارنے والا ہر چیز سے پوری طرح باخبر ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { اَلَّا تَعْبُدُوْۤا اِلَّا اللّٰهَ:} یعنی یہ قرآن اس لیے نازل کیا گیا ہے کہ اللہ کے سوا کسی کی عبادت نہ کرو، بلکہ ہر رسول کو اللہ تعالیٰ نے اسی لیے بھیجا، فرمایا : «{ وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ }» [ الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔‘‘ سورۂ نحل (۳۶) میں بھی ہر رسول کے بھیجنے کا مقصد ایک اللہ کی عبادت کا حکم اور طاغوت سے اجتناب کی تاکید بیان فرمایا ہے۔ ¤ ➋ {اِنَّنِيْ لَكُمْ مِّنْهُ نَذِيْرٌ وَّ بَشِيْرٌ : } چنانچہ آپ صلی اللہ علیہ وسلم نے سب سے پہلے اپنے گھر والوں ام المومنین خدیجہ، زید، علی اور اپنے خاص دوست ابوبکر رضی اللہ عنھم کے سامنے اللہ کا حکم پیش کیا، وہ ایمان لے آئے، پھر جب یہ آیت اتری : «{وَ اَنْذِرْ عَشِيْرَتَكَ الْاَقْرَبِيْنَ }» [ الشعراء : ۲۱۴ ] ’’اور اپنے سب سے قریب رشتہ داروں کو ڈرا‘‘ تو آپ نے کوہ صفا پر چڑھ کر قریش کے قبائل کو آواز دے کر جمع کیا اور ان تک اللہ کا پیغام پہنچایا۔ [ بخاری : ۴۷۷۰ ] پھر اللہ تعالیٰ کے اس حکم کے تحت : «{وَ مَاۤ اَرْسَلْنٰكَ اِلَّا كَآفَّةً لِّلنَّاسِ بَشِيْرًا وَّ نَذِيْرًا }» [ سبا : ۲۸ ] تمام دنیا کے لوگوں کو اللہ کے عذاب سے ڈرانے اور اس کے ثواب کی خوش خبری کا پیغام پہنچانے کا کام شروع کیا۔ چنانچہ دوسرے ملکوں سے پہلے جزیرۂ عرب کے لوگوں تک نرمی اور محبت کے ساتھ اور پھر جہاد فی سبیل اللہ کے ذریعے سے یہ پیغام پہنچایا اور ان سب کو اسلام کے جھنڈے تلے جمع کیا، پھر تمام دنیا کے بادشاہوں کو خطوط لکھے، جن میں بشارت بھی تھی اور نذارت بھی۔ چنانچہ روم کے فرماں روان ہرقل کو خوش خبری دی کہ تم مسلمان ہو جاؤ تو سلامت بھی رہو گے اور اللہ تعالیٰ تمھیں دوہرا اجر دے گا اور ڈرایا بھی کہ اگر تم نے اسلام سے منہ موڑا تو تمھاری رعایا کے کفر کا بوجھ بھی تمھاری گردن پر ہو گا۔[بخاری : ۷] دوسرے تمام حکمرانوں تک بھی یہ پیغام پہنچایا، پھر آپ کے خلفاء نے مشرق سے مغرب تک یہ پیغام پہنچا دیا۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {وَ اَنِ اسْتَغْفِرُوْا رَبَّكُمْ ثُمَّ تُوْبُوْۤا اِلَيْهِ:} پچھلی آیت میں {’’ اَلَّا تَعْبُدُوْۤا اِلَّا اللّٰهَ ‘‘} سے معلوم ہوتا ہے کہ یہاں اں استغفار اور توبہ سے مراد غیر اللہ کی عبادت سے استغفار اور توبہ ہے، یعنی تم اللہ کے ساتھ جو بھی شرک اور اس کی نافرمانیاں کر چکے ہو ان کی معافی اور بخشش مانگو، مگر اس استغفار کا فائدہ تب ہے کہ ان گناہوں سے واپس پلٹ آؤ اور آئندہ کے لیے نہ کرنے کا خلوصِ دل سے عزم کرو، پھر اگر انسانی کمزوری سے کوئی گناہ ہو جائے تو پھر معافی مانگو اور ساتھ ہی آئندہ کے لیے خلوص دل سے پھر توبہ کرو اور یہ سلسلہ ساری زندگی ہر لغزش پر، خواہ کتنی بار بھی ہو جائے جاری رکھو۔ نہ گناہ کے بعد معافی مانگنے میں دیر کرو اور نہ معافی مانگنے کے ساتھ توبہ میں۔ تب استغفار اور توبہ کا فائدہ ہے۔ دیکھیے سورۂ نساء ( ۱۷، ۱۸)۔ ¤ ➋ { يُمَتِّعْكُمْ مَّتَاعًا حَسَنًا اِلٰۤى اَجَلٍ مُّسَمًّى :} اس میں استغفار اور توبہ کا کمال فائدہ بیان فرمایا ہے۔ یہ دنیا جسے اللہ تعالیٰ نے متاع غرور بتایا ہے، اسے اللہ تعالیٰ استغفار اور توبہ کرنے والے مومن کے لیے موت تک متاع حسن بنا دے گا۔ وہ دنیا کی نعمتوں سے سرفراز ہو کر بھی متاع غرور کے بجائے متاع حسن سے فائدہ اٹھائے گا۔ وہ استغفار اور توبہ کے ساتھ اپنی زندگی اللہ تعالیٰ کی اطاعت میں بسر کرے گا، تو اس کی نفسانی لذتیں بھی اس کے لیے ثواب بن جائیں گی۔ رسول اللہ صلی اللہ علیہ وسلم نے سعد بن ابی وقاص رضی اللہ عنہ سے فرمایا : [ وَلَسْتَ تُنْفِقَ نَفَقَةً تَبْتَغِيْ بِهَا وَجْهَ اللّٰهِ إِلاَّ أُجِرْتَ بِهَا وَ فِيْ رِوَايَةِ الْبُخَارِيِّ : فَإِنَّهَهَا صَدَقَةٌ حَتَّي اللُّقْمَةَ تَجْعَلُهَا فِيْ فِيْ امْرَأَتِكَ ] [ مسلم، الوصیۃ، باب الوصیۃ بالثلث : ۱۶۲۸۔ بخاری : ۲۷۴۲ ] ’’تم جو بھی خرچ کرو گے، جس کے ساتھ اللہ تعالیٰ کی رضا چاہو گے، اس پر تمھیں اجر دیا جائے گا (بخاری کے الفاظ ہیں کہ وہی صصدقہ بن جائے گا) یہاں تک کہ وہ لقمہ بھی جو تم اپنی بیوی کے منہ میں ڈالو گے۔‘‘ ایسے مومن کو دنیا میں حیات طیبہ عطا ہوتی ہے (خواہ بظاہر وہ مصیبت میں گرفتار ہو) اور آخرت کا بہترین اجر عطا ہو گا۔ دیکھیے سورۂ نحل (۹۷) عمل صالح اور استغفار کی بے شمار برکات اور فوائد ہیں، چند فوائد کے لیے دیکھیے سورۂ ہود (۵۲، ۶۱، ۹۰)۔ ¤ ➌ { وَ يُؤْتِ كُلَّ ذِيْ فَضْلٍ فَضْلَهٗ : ”فَضْلٍ“ }کا معنی زائد ہے، یعنی جو اطاعت اور نیک اعمال میں جتنا زیادہ ہو گا اسے اللہ تعالیٰ دنیا یا آخرت یا دونوں میں زیادہ اجر دے گا۔ اللہ کے ہاں کسی چیز کی کمی نہیں ہے، اس کا قاعدہ ہے کہ جو کوئی برائی کرتا ہے اس کے لیے ایک ہی برائی لکھی جاتی ہے اور جو نیکی کرتا ہے اس کے لیے کم از کم دس(۱۰)نیکیاں لکھی جاتی ہیں اور زیادہ سے زیادہ کا کوئی حساب نہیں، فرمایا : «{ وَ اللّٰهُ يَرْزُقُ مَنْ يَّشَآءُ بِغَيْرِ حِسَابٍ }» [ النور : ۳۸ ] ’’اور اللہ جسے چاہتا ہے بے حساب دیتا ہے۔‘‘ ایک مطلب یہ بھی ہے کہ صدقہ عموماً اپنی ضرورت سے زائد چیز ہی کا کیا جاتا ہے، تو ہر شخص جو اپنی ضرورت سے زائد چیز اللہ کی راہ میں خرچ کر دے، تو اللہ تعالیٰ اسے ہر گز کمی نہیں ہونے دے گا، بلکہ اس کی زائد چیز ضرور اسے دے گا، پھر جو اپنی ضرورت کے باوجود صدقہ کرلے تو اللہ تعالیٰ اس پر کس قدر فضل فرمائے گا؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا نَقَصَتْ صَدَقَةٌ مِّنْ مَّالٍ ] [ مسلم، کتاب البر والصلۃ، باب استحباب العفو والتواضع : ۲۵۸۸، عن أبی ھریرۃ رضی اللہ عنہ ] ’’کوئی صدقہ کسی مال میں کمی نہیں کرتا۔‘‘ ¤ ➍ {وَ اِنْ تَوَلَّوْا فَاِنِّيْۤ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَبِيْرٍ:} بہت بڑے دن کے عذاب سے، یعنی میں تم پر دنیا کے عذاب کے علاوہ آخرت کے دن کے عذاب سے بھی ڈرتا ہوں، جو بہت بڑا، یعنی پچاس ہزار سال کا دن ہے اور جس کے بعد پھر کفار کے لیے ہمیشہ کا عذاب ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {اِلَى اللّٰهِ مَرْجِعُكُمْ …: ’’ اِلَى اللّٰهِ ‘‘ } کے پہلے آنے سے حصر پیدا ہوگیا، یعنی اگر تمھیں آخرت کے عذاب کا اس لیے خوف نہیں کہ تم اس دن کے منکر ہو تو یاد رکھو کہ اللہ کے سوا تم کہیں جا ہی نہیں سکتے اور وہ ہر چیز پر پوری طرح قدرت رکھنے والا ہے۔ جب اس نے پہلی دفعہ تمھیں پیدا کیا تو دوبارہ اپنے پاس حاضر کیوں نہیں کر سکتا۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5){ اَلَاۤ اِنَّهُمْ يَثْنُوْنَ صُدُوْرَهُمْ …: ’’ يَثْنُوْنَ ‘‘ ’’ ثَنَي يَثْنِيْ‘‘} (ض) سے فعل مضارع جمع مذکر غائب ہے۔ اس کا معنی ہے دوہرا کرنا، موڑنا۔ دوسرے عدد کو ثانی اسی لیے کہتے ہیں کہ وہ واحد کو دو بنا دیتا ہے۔{ ’’ لِيَسْتَخْفُوْا مِنْهُ ‘‘ ’’اِخْتَفَي يَخْتَفِيْ‘‘} کا معنی چھپنا اور استفعال کی سین اور تاء کے اضافے سے معنی میں اضافہ ہو گیا۔ اسی طرح {’’ يَسْتَغْشُوْنَ ‘‘} میں بھی سین اور تاء کے اضافے نے معنی میں اضافہ کر دیا ہے۔ اس میں اللہ تعالیٰ کے متعلق مشرکین کے جہل اور لاعلمی کی انتہا بیان ہوئی ہے، جیسا کہ دوسری جگہ اللہ تعالیٰ نے ان کا حال بیان فرمایا : «{ وَ مَا كُنْتُمْ تَسْتَتِرُوْنَ اَنْ يَّشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَ لَاۤ اَبْصَارُكُمْ وَ لَا جُلُوْدُكُمْ وَ لٰكِنْ ظَنَنْتُمْ اَنَّ اللّٰهَ لَا يَعْلَمُ كَثِيْرًا مِّمَّا تَعْممَلُوْنَ }» [ حٰمٓ السجدۃ : ۲۲ ] ’’اور تم اس سے پردہ نہیں کرتے تھے کہ تمھارے خلاف تمھارے کان گواہی دیں گے اور نہ تمھاری آنکھیں اور نہ تمھارے چمڑے اور لیکن تم نے گمان کیا کہ بے شک اللہ بہت سے کام جو تم کرتے ہو، نہیں جانتا۔‘‘ گویا ان کے خیال میں اللہ تعالیٰ سے چھپ کر بھی کچھ کام ہو سکتے ہیں جن کا اسے پتا نہ چلے۔ عبد اللہ بن مسعود رضی اللہ عنہ نے بیان فرمایا : [ اِجْتَمَعَ عِنْدَ الْبَيْتِ ثَقَفِيَّانِ وَ قُرَشِيٌّ، أَوْ قُرشِيَّانِ وَ ثَقِفِيٌّ، كَثِيْرَةٌ شَحْمُ بُطُوْنِهِمْ قَلِيْلَةٌ فِقْهُ قُلُوْبِهِمْ، فَققَالَ أَحَدُهُمْ: أَتَرَونَ أنَّ اللّٰهَ يَسْمَعُ مَا نَقُوْلُ ؟ قَالَ الْاَخَرُ : يَسْمَعُ إِنْ جَهَرْنَا وَلاَ يَسْمَعُ إِنْ أَخْفَيْنَا، وَ قَالَ الْآخَرُ : إِنْ كَانَ يَسْمَعُ إِذْا جَهَرْنَا فَإِنَّهٗ يَسْمَعُ إِذْا أَخْفَيْنَا، فَأَنْزَلَ اللّٰهُ تَعَالٰی: « وَ مَا كُنْتُمْ تَسْتَتِرُوْنَ اَنْ يَّشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَ لَاۤ اَبْصَارُكُمْ وَ لَا جُلُوْدُكُمْ » ] ’’کعبہ کے پاس دو قرییشی اور ایک ثقفی یا دو ثقفی اور ایک قریشی جمع ہوئے، جن کے پیٹوں کی چربی بہت تھی اور دلوں کی سمجھ بہت کم تھی، تو ان میں سے ایک نے کہا : ’’کیا تم سمجھتے ہو کہ ہم جو کچھ کہہ رہے ہیں اللہ تعالیٰ اسے سن رہا ہے؟‘‘ دوسرے نے کہا : ’’اگر ہم بلند آواز سے بات کریں تو سنتا ہے، اگر آہستہ کریں تو نہیں۔‘‘ تو اگلے نے کہا : ’’اگر وہ اس وقت سنتا ہے جب ہم بلند آواز سے بولتے ہیں تو یقینا وہ اس وقت بھی سنتا ہے جب ہم آہستہ بات کرتے ہیں۔‘‘ اس پر یہ آیت نازل ہوئی : «{ وَ مَا كُنْتُمْ تَسْتَتِرُوْنَ اَنْ يَّشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَ لَاۤ اَبْصَارُكُمْ وَ لَا جُلُوْدُكُمْ }» [حٰمٓ السجدۃ : ۲۲] [ بخاری، التوحید، باب قول اللہ عزوجل : « وما کنتم تستترون …» : ۷۵۲۱ ] اس سے معلوم ہوا کہ کئی جاہل مشرکین یہ بھی سمجھتے تھے کہ آہستہ بات کریں تو اللہ تعالیٰ کو پتا نہیں چلتا۔ ¤ تو معلوم ہوا کہ وہ اللہ تعالیٰ کو مانتے تھے، البتہ جب بھی اللہ کی ناراضگی والا کوئی کام کرتے تو خوب چھپ کر تاکہ اللہ تعالیٰ سے چھپے رہیں، اسے پتا نہ چل جائے، کبھی کپڑوں اور دیواروں کے پردے کے پیچھے، کبھی سینہ دوہرا کرکے حاصل ہونے والی پوشیدگی کے ذریعے سے، مثلاً ملاوٹ کرنے کے لیے، دھوکا دینے کے لیے یا کوئی اور شنیع فعل کرنے کے لیے سینہ دوہرا کرکے اپنے خیال میں اپنے آپ کو اللہ تعالیٰ سے چھپا لیتے۔ اللہ تعالیٰ نے فرمایا کہ یاد رکھو! خوب اچھی طرح کپڑے لپیٹ کر بھی تم جو کچھ کرتے ہو اسے بھی وہ جانتا ہے، بلکہ اس سے بھی کہیں آگے جو کچھ سینوں کے حصار میں محفوظ دل کے اندر باتیں ہیں وہ انھیں بھی خوب جانتا ہے، اس لیے تمھارے یہ خیال اور یہ حرکات لغو اور باطل ہیں، ان کا تمھیں کچھ فائدہ نہیں۔ ¤ ایک تفسیر یہ ہے کہ اوپر جو فرمایا تھا : «{ وَ اِنْ تَوَلَّوْا فَاِنِّيْۤ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَبِيْرٍ }» (اور اگر تم پھر جاؤ تو یقینا میں تم پر ایک بڑے دن کے عذاب سے ڈرتا ہوں) وہاں ظاہری اور جسمانی طور پر منہ پھیرنا مراد تھا اور یہاں دل سے اعراض مراد ہے، کیونکہ سینے سے مراد دل ہوتا ہے، جیسا کہ {’’ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ ‘‘} سے بھی ظاہر ہے۔ {’’ يَثْنُوْنَ صُدُوْرَهُمْ ‘‘} گویا سینے کو موڑنا محاورہ ہے، مراد دل کو موڑنا، اعراض کرنا، غلط سوچنا، بے اصل شبہات سے اپنے دل کو تسلی دینا، عقائد حقہ سے اعراض کرنا وغیرہ ہے، کیونکہ یہاں صدور سے مراد علوم صدر ہیں۔ (فتح الرحمان از شاہ ولی اللہ) مطلب یہ ہے کہ وہ اپنے سینوں میں جو کفر و عناد رکھتے ہیں اسے چھپا کر رکھنے کی کوشش کرتے ہیں، تاکہ اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کو ان کے چھپے ہوئے رازوں کی اطلاع نہ ہونے پائے۔ (شوکانی) یہ دونوں حوالے ہمارے استاذ مرحوم نے اشرف الحواشی میں نقل کیے ہیں۔ صحیح بخاری میں عبد اللہ بن عباس رضی اللہ عنھما سے ایک اور ہی مطلب منقول ہے کہ ایک صاحب نے ان سے اس آیت کا مطلب پوچھا تو انھوں نے فرمایا : ’’کچھ لوگ اس سے حیا کرتے تھے کہ قضائے حاجت کے وقت اپنی شرم گاہوں کو آسمان کے سامنے ننگا کریں اور اپنی بیویوں سے جماع کریں تو شرم گاہوں کو آسمان کے سامنے ظاہر کریں، تو یہ آیت ان کے بارے میں اتری۔‘‘ [ بخاری، التفسیر، باب : { ألا إنہم یثنون صدورھم… } : ۴۶۸۱، ۴۶۸۲ ] ¤ اس شان نزول سے معلوم ہوتا ہے کہ یہ آیت ان مسلمانوں کے بارے میں نازل ہوئی ہے جو غلبۂ حیا کی وجہ سے قضائے حاجت اور ہم بستری کے وقت ننگا ہونے سے پرہیز کرتے تھے کہ اللہ تعالیٰ ہمیں دیکھ رہا ہے۔ اس لیے وہ ایسے موقعوں پر شرم گاہ کو چھپانے کے لیے اپنے سینے کو دہرا کر لیتے۔ اللہ تعالیٰ نے فرمایا کہ رات کے اندھیرے میں جب وہ بستروں میں اپنے آپ کو ڈھانپ لیتے ہیں تو اس وقت بھی وہ ان کو دیکھتا اور ان کی چھپی اور علانیہ باتوں کو جانتا ہے۔ مطلب یہ ہے کہ شرم و حیا کا جذبہ اپنی جگہ بہت اچھا ہے، لیکن اس میں اتنا غلو اور زیادتی بھی صحیح نہیں، اس لیے کہ جس ذات کی خاطر وہ ایسا کرتے ہیں اس سے تو وہ پھر بھی چھپ نہیں سکتے تو پھر اس طرح کے تکلف کا کیا فائدہ؟ اگرچہ یہ تفسیرحبر الامہ سے حدیث کی صحیح ترین کتاب صحیح بخاری میں آئی ہے اور بلاشبہ درست ہے، مگر اکثر مفسرین نے فرمایا کہ آیات کے سیاق کے مطابق یہ آیت کفار کے رویے ہی سے تعلق رکھتی ہے، کیونکہ پہلے اور بعد میں مسلسل انھی کا ذکر ہو رہا ہے۔ ابن عباس رضی اللہ عنھما کی تفسیر کا مطلب یہ ہے کہ یہ آیت ان مسلمانوں پر بھی صادق آتی ہے جو حیا کے جذبے سے ایسا کرتے تھے۔ اصول تفسیر میں اہل علم نے یہ بات واضح فرمائی ہے کہ صحابہ و تابعین کسی آیت کے متعلق جہاں بھی وہ منطبق ہوتی اور صادق آتی ہو کہہ دیتے ہیں{ ’’نَزَلَتْ فِيْ كَذَا‘‘} کہ یہ آیت فلاں چیز کے بارے میں اتری، اس لیے ایک ہی آیت کے کئی شان نزول صحابہ و تابعین سے مروی ہوتے ہیں اور ان میں کوئی تضاد نہیں ہوتا بلکہ سبھی مراد ہو سکتے ہیں۔ البتہ یہ عین ممکن ہے کہ آیت کے نزول کے وقت یا اس کے قریب ان میں سے کوئی ایک واقعہ یا چند واقعات ہی ظہور پذیر ہوئے ہوں اور دوسرے واقعات انطباق کی وجہ سے شان نزول قرار دے دیے گئے ہوں۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {وَ مَا مِنْ دَآبَّةٍ فِي الْاَرْضِ …:’’ دَآبَّةٍ ‘‘ ’’ دَبَّ يَدِبُّ دَبِيْبًا ‘‘} سے اسم فاعل ہے، جس کا معنی آہستہ چلنا ہے۔ ہر جان دار خواہ مذکر ہو یا مؤنث، عاقل ہو یا غیر عاقل، سب پر {’’ دَآبَّةٍ ‘‘ } کا لفظ استعمال ہوتا ہے، جیسا کہ فرمایا : «{ وَ اللّٰهُ خَلَقَ كُلَّ دَآبَّةٍ مِّنْ مَّآءٍ فَمِنْهُمْ مَّنْ يَّمْشِيْ عَلٰى بَطْنِهٖ وَ مِنْهُمْ مَّنْ يَّمْشِيْ عَلٰى رِجْلَيْنِ وَ مِنْهُمْ مَّنْ يَّمْشِيْ عَلٰۤى اَرْبَعٍ }» [ النور:۴۵] ’’اور اللہ نے ہر چلنے والا (جان دار) ایک قسم کے پانی سے پیدا کیا، پھر ان میں سے کوئی وہ ہے جو اپنے پیٹ پر چلتا ہے اور ان میں سے کوئی وہ ہے جو دو پاؤں پر چلتا ہے اور ان میں سے کوئی وہ ہے جو چار پر چلتا ہے۔‘‘ اللہ تعالیٰ نے پیٹ پر یا دو یا چار ٹانگوں پر چلنے والے تمام جانداروں کو {’’ دَآبَّةٍ ‘‘} فرمایا۔ ¤ ➋ پچھلی آیت میں اللہ تعالیٰ کے علم کی وسعت اور احاطے کا بیان تھا کہ انسان کے ظاہر اور پوشیدہ احوال ہی نہیں، وہ تو دلوں کے خیالات تک سے واقف ہے۔ اس آیت میں اسی پر دلیل پیش کی ہے کہ ہر جان دار کو اللہ تعالیٰ کے ہاں سے روزی پہنچ رہی ہے، پھر اگر اللہ تعالیٰ کا علم وسیع نہ ہوتا تو روزی کا یہ بندوبست کیسے ممکن تھا؟ مگر اس آیت کا یہ مطلب نہیں کہ رزق اللہ کے ذمے ہے تو انسان اس کی کمائی اور تلاش کے لیے محنت نہ کرے، بلکہ رزق کے تمام خزانے اگرچہ اللہ تعالیٰ کے ہاتھ میں ہیں، مگر انسان کو محنت کا حکم ہے اور اسے وہ اسباب اختیار کرنا لازم ہے جن سے رزق حاصل ہوتا ہے، لیکن اس محنت اور ان اسباب پر بھروسا جائز نہیں، تمام اسباب مہیا کرنے کے بعد بھی بھروسا اور توکل صرف اللہ پر لازم ہے، کیونکہ وہ نہ چاہے تو تمام اسباب کے باوجود بندہ رزق سے محروم رہتا ہے اور اگر وہ چاہے تو بندہ کوئی سبب بھی مہیا نہ کر سکے تو وہ اسباب کے بغیر بھی روزی دے سکتا ہے۔ مگر حکم یہی ہے کہ رزق کی تلاش میں نکلو۔ عمر بن خطاب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَوْ اَنَّكُمْ كُنْتُمْ تَوَكَّلُوْنَ عَلَی اللّٰهِ حَقَّ تَوَكُّلِهٖ لَرُزِقْتُمْ كَمَا تُرْزَقُ الطَّييْرُ تَغْدُوْ خِمَاصًا وَتَرُوْحُ بِطَانًا ] [ ترمذی، الزہد، باب فی التوکل علی اللّٰہ : ۲۳۴۴ ] ’’اگر تم اللہ پر توکل (بھروسا) کرو جیسا اس پر توکل کا حق ہے تو یقینا تمھیں اسی طرح رزق دیا جائے جیسے پرندوں کو دیا جاتا ہے، وہ صبح نکلتے ہیں تو خالی پیٹ ہوتے ہیں، شام کو آتے ہیں تو ان کے پیٹ بھرے ہوئے ہوتے ہیں۔‘‘ اس حدیث میں صبح نکلنا کسب ہے اور یہ فکر نہ کرنا کہ کل کو کیا کھائیں گے توکل ہے۔ بہرحال اسباب اختیار کرنا توکل کے منافی نہیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اِعْقِلْهَا وَ تَوَكَّلْ ] [ ترمذی، صفۃ القیامۃ، باب حدیث اعقلھا و توکل…: ۲۵۱۷، عن أنس رضی اللہ عنہ ]’’اونٹنی کا گھٹنا باندھ اور توکل کر۔‘‘ ابو امامہ باہلی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ رُوْحَ الْقُدْسِ نَفَثَ فِيْ رَوْعِيْ أَنَّ نَفْسًا لَنْ تَمُوْتَ حَتَّى تَسْتَكْمِلَ أَجَلَهَا وَتَسْتَوْعِبَ رِزْقَهَا فَاتَّقُوا اللّٰهَ وَأَجْمِلُوْا فِي الطَّلَبِ وَلَا يَحْمِلَنَّ أَحَدَكُمُ اسْتِبْطَاءُ الرِّزْقِ أَنْ يَّطْلُبَههُ بِمَعْصِيَةِ اللّٰهِ فَإِنَّ اللّٰهَ تَعَالٰی لَا يُنَالُ مَا عِنْدَهٗ إِلاَّ بِطَاعَتِهٖ ] [ صحیح الجامع : ۲۰۸۵ ] ’’بے شک روح القدس (جبریل علیہ السلام ) نے میرے دل میں وحی کی کہ کوئی جان اس وقت تک فوت نہیں ہو گی جب تک اپنی مقررہ مدت پوری نہ کرلے اور اپنا پورا رزق حاصل نہ کر لے۔ پس تم اللہ سے ڈرو اور (رزق کی) تلاش میں اچھا طریقہ اختیار کرو اور رزق ملنے میں دیر ہو جانا تم میں سے کسی کو اس بات پر آمادہ نہ کر دے کہ وہ اسے اللہ کی نافرمانی کے ذریعے تلاش کرے، کیونکہ اللہ تعالیٰ کے پاس جو کچھ (نعمت اور جنت) ہے وہ اس کی اطاعت کے بغیر حاصل نہیں ہو سکتی۔‘‘ یہ ذہن بھی غلط ہے کہ تلاش اور کوشش کے بغیر رزق نہیں ملتا، کیونکہ اللہ تعالیٰ کی بہت سی مخلوق وہ ہے جسے اسباب اختیار کیے بغیر رزق مل رہا ہے۔ دیکھیے سورۂ عنکبوت (۶۰)۔ ¤ (3) {وَ يَعْلَمُ مُسْتَقَرَّهَا وَ مُسْتَوْدَعَهَا:} یہ بھی اللہ تعالیٰ کے علم ہی کا مزید بیان ہے۔ {’’ مُسْتَقَرٌّ ‘‘} اور{’’ مُسْتَوْدَعٌ ‘‘ } کی تفسیر اگرچہ لوگوں نے مختلف بیان کی ہے، مگر الفاظ کے پیش نظر واضح مطلب یہی نظر آتا ہے کہ اللہ تعالیٰ وہ تمام جگہیں بھی جانتا ہے جہاں انسان نے کچھ مدت کے لیے ٹھہرنا ہے، خواہ باپ کی پشت ہو یا ماں کا رحم، یا زمین کا کوئی حصہ جہاں اس نے زندگی میں ٹھہرنا ہے اور اللہ تعالیٰ وہ جگہیں بھی جانتا ہے جن کے سپرد انسان نے مرنے کے بعد ہونا ہے، خواہ وہ زمین میں کھودی ہوئی جگہ ہو یا کسی جانور کا پیٹ یا جو جگہ بھی اللہ تعالیٰ نے قیامت تک اس کے سپرد ہونے کے لیے لکھی ہے اور وہ سب کچھ اس کے لیے قبر ہی ہے، کیونکہ اللہ تعالیٰ نے ہر انسان کو موت اور قبر دینے کا ذکر فرمایا ہے : « { ثُمَّ اَمَاتَهٗ فَاَقْبَرَهٗ }» [ عبس : ۲۱ ] ’’پھر اسے موت دی، پھر اسے قبر میں رکھوایا۔‘‘ پھر قیامت کو زندہ ہو کر اسے دوزخ کے سپرد ہونا ہے یا جنت کے، یہ سب اس کے لیے {’’مُسْتَوْدَعٌ ‘‘ } (سونپے جانے کی جگہ) ہیں۔ خلاصہ یہ ہے کہ اللہ تعالیٰ ہر جان دار کی زندگی کے ہر حال کو بھی جانتا ہے اور موت کے بعد کے تمام حالات کو بھی۔ {’’ كِتٰبٍ مُّبِيْنٍ ‘‘} سے مراد لوح محفوظ ہے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {وَ هُوَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ فِيْ سِتَّةِ اَيَّامٍ:} اوپر کی آیت میں اللہ تعالیٰ کے کمال علم کو ثابت فرمایا اور اس آیت میں اللہ تعالیٰ کی قدرت کے کمال کا بیان ہے۔ آسمان و زمین کی چھ دنوں میں پیدائش کے متعلق دیکھیے سورۂ اعراف(۵۴) اور حم السجدہ (۹ تا ۱۲)۔ ¤ ➋ {وَ كَانَ عَرْشُهٗ عَلَى الْمَآءِ:} اس آیت سے ثابت ہوتا ہے کہ آسمان و زمین پیدا کرنے سے پہلے اللہ تعالیٰ کا عرش پانی پر تھا، پھر سب سے پہلے کیا پیدا کیا؟ اس کے متعلق مختلف روایات آئی ہیں۔ عمران بن حصین رضی اللہ عنہما بیان کرتے ہیں کہ اہل یمن کے کچھ لوگوں نے آپ صلی اللہ علیہ وسلم سے اس ام امر (کائنات) کی ابتدا کے متعلق پوچھا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَانَ اللّٰهُ وَلَمْ يَكُنْ شَيْءٌ قَبْلَهٗ وَكَانَ عَرْشُهٗ عَلَی الْمَاءِ ثُمَّ خَلَقَ السَّمَوَاتِ وَالْأَرْضَ وَكَتَبَ فِيْ الذِّكْرِ كُلَّ شَيْءٍ] [ بخاری، التوحید، باب : « و کان عرشہ علی الماء » : ۷۴۱۸ ] ’’اللہ تعالیٰ تھا اور اس سے پہلے کوئی چیز نہیں تھی اور اس کا عرش پانی پر تھا، پھر اس نے آسمان و زمین کو پیدا کیا اور ذکر (لوح محفوظ) میں ہر چیز لکھ دی۔‘‘ عبد اللہ بن عمرو رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [كَتَبَ اللّٰهُ مَقَادِيْرَ الْخَلَائِقِ قَبْلَ أَنْ يَّخْلُقَ السَّمَوَاتِ وَالْأَرْضَ بِخَمْسِيْنَ أَلْفَ سَنَةٍ قَالَ وَ ع عَرْشُهٗ عَلَي الْمَاءِ] [ مسلم، القدر، باب حجاج آدم و موسٰی صلی اللہ علیہما وسلم : ۲۶۵۳ ] ’’اللہ تعالیٰ نے مخلوقات کی تقدیریں آسمان و زمین کو پیدا کرنے سے پچاس ہزار سال پہلے لکھ دیں اور اس کا عرش پانی پر تھا۔‘‘ ¤ سنن ترمذی (۳۱۰۹) اور ابن ماجہ (۱۸۲) کی روایات میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا : ’’خلق کی پیدائش سے پہلے ہمارا پروردگار کہاں تھا؟‘‘ اس کے جواب میں آپ صلی اللہ علیہ وسلم نے فرمایا : [ كَانَ فِيْ عَمَاءٍ مَا تَحْتَهُ هَوَاءٌ وَمَا فَوْقَهُ هَوَاءٌ] { ’’عَمَاءٌ‘‘} کا معنی نہایہ میں لکھا ہے، بادل، پتلا سا بادل یا نامعلوم چیز، جس کی حقیقت سے ہم ناواقف گویا اعمیٰ ہیں۔ حدیث کا ترجمہ ہے : ’’اللہ تعالیٰ ایک عماء (نامعلوم چیز) میں تھا، اس کا اوپر خالی تھا اور اس کے نیچے بھی خلا تھا۔‘‘ مگر شیخ ناصر الدین البانی رحمہ اللہ اور ان سے پہلے رازی اور دوسرے اہل علم رحمۃ اللہ علیھم نے اسے ضعیف کہا ہے، جبکہ استدلال خصوصاً عقیدے میں اور اتنے اہم مسئلہ میں صحیح حدیث ہی سے ہو سکتا ہے۔ صحیح حدیث جس سے اس مسئلے پر روشنی پڑتی ہے، یہ ہے کہ عبادہ بن صامت رضی اللہ عنہ فرماتے ہیں، میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : [ إِنَّ أَوَّلَ مَا خَلَقَ اللّٰهُ تَعَالَی الْقَلَمُ فَقَالَ لَهُ اكْتُبْ فَقَالَ رَبِّ وَ مَاذَا أَكْتُبُ؟ قَالَ اكْتُبْ مَقَادِيْرَ كُلِّ  شَيْءٍ حَتّٰی تَقُوْمَ السَّاعَةُ ] [ أبوداوٗد، السنۃ، باب في القدر : ۴۷۰۰۔ ترمذی: ۳۳۱۹ ] ’’بے شک اللہ تعالیٰ نے سب سے پہلے جو پیدا کیا قلم تھا تو اسے فرمایا : ’’لکھ۔‘‘ اس نے کہا : ’’اے میرے رب ! میں کیا لکھوں؟‘‘ فرمایا : ’’ہر چیز کی تقدیریں لکھ، یہاں تک کہ قیامت قائم ہو۔‘‘ یہ حدیث صحیح ہے، شیخ البانی رحمہ اللہ نے بھی اسے صحیح کہا ہے۔ ہمارے شیخ محمد عبدہ رحمہ اللہ نے لکھا ہے کہ یہی (بات) صحیح ہے، البتہ شیخ محمد عبدہ رحمہ اللہ نے قلم کی پیدائش اور تقدیر کا لکھا جانا پانی اور عرش کے بعد لکھا ہے۔ شاید ان کا استدلال اس آیت : «{ وَ كَانَ عَرْشُهٗ عَلَى الْمَآءِ }» سے ہو۔ (واللہ اعلم) حافظ ابن حجر رحمہ اللہ نے بھی قلم سے پہلے عرش اور پانی کے پیدا کیے جانے کا ذکر کیا ہے اور اس کے کچھ دلائل ذکر کیے ہیں۔ دیکھیے فتح الباری میں {’’ كِتَابُ بَدْءِ الْخَلْقِ ‘‘} کا پہلا باب۔ ایک روایت میں ہے کہ سب سے پہلے عقل کو پیدا کیا، مگر وہ روایت ضعیف ہے۔ ابن قیم رحمہ اللہ نے {’’المنار المنيف ‘‘} میں لکھا ہے کہ عقل کے متعلق تمام احادیث باطل ہیں۔ ¤ ➋ {لِيَبْلُوَكُمْ اَيُّكُمْ اَحْسَنُ عَمَلًا:} اللہ تعالیٰ کو جس طرح گزشتہ اور موجودہ ہر بات کا علم ہے، اسے یہ بھی معلوم ہے کہ آئندہ کیا ہو گا، مگر آئندہ ہونے والی چیز کے متعلق یہ علم کہ وہ واقع ہو چکی ہے، اس کے واقع ہونے کے بعد ہی ہو سکتا ہے۔ آزمانے کا مطلب یہی ہے کہ اللہ تعالیٰ کے علم کے مطابق جو کچھ آئندہ ہونا ہے وہ وجود میں آ کر سب کے سامنے آ جائے اور نتیجہ دوسروں کے سامنے بھی ظاہر ہو جائے۔ قرآن مجید میں {’’ لِيَعْلَمَ ‘‘} اور {’’ لِيَبْلُوَكُمْ ‘‘} وغیرہ الفاظ جہاں بھی آئے ہیں ان سے مراد یہی ہے۔ ¤ ➌ {اَحْسَنُ عَمَلًا:} یعنی آزمائش یہی نہیں کہ عمل میں برا کون ہے اور اچھا کون، بلکہ اللہ تعالیٰ ایسا قدر دان ہے کہ عمل میں اچھائی کے درجات کو بھی ملحوظ رکھتا ہے کہ زیادہ اچھا کون ہے، جیسے فرمایا : «{ هُمْ دَرَجٰتٌ عِنْدَ اللّٰهِ وَ اللّٰهُ بَصِيْرٌۢ بِمَا يَعْمَلُوْنَ }» [آل عمران : ۱۶۳ ] ’’وہ لوگ (اللہ کی رضا چاہنے والے) اللہ کے ہاں کئی درجوں والے ہیں اور اللہ خوب دیکھنے والا ہے جو وہ کر رہے ہیں۔‘‘ بلکہ برے عمل میں بھی سب کو ایک جیسا نہیں رکھا، منافقین آگ کے سب سے نچلے درجے میں ہیں، جبکہ ابو طالب صرف آگ کے جوتے پہنے ہوئے ہے۔ رہی یہ بات کہ کیسے پتا چلے گا کہ میں اچھا عمل کر رہا ہوں تو یہ صرف اللہ تعالیٰ کے بتانے ہی سے معلوم ہو سکتا ہے، اس لیے اہل علم کا اس پر اتفاق ہے کہ اچھے عمل کے لیے دو شرطیں ہیں، ایک یہ کہ عمل خالص اللہ تعالیٰ کے لیے ہو، دوسری یہ کہ کتاب و سنت کے مطابق ہو، کیونکہ اس میں جو کچھ ہے اللہ تعالیٰ کا بتایا ہوا ہے۔ ¤ ➍ {وَ لَىِٕنْ قُلْتَ اِنَّكُمْ مَّبْعُوْثُوْنَ …:} اللہ تعالیٰ کے علم، قدرت اور خلق (پیدا کرنے) جیسی صفات کو بادلائل ذکر کرنے کے بعد بھی اگر آپ ان مشرکوں سے کہیں کہ اتنی زبردست قوتوں والے رب نے تمھیں موت کے بعد دوبارہ زندہ کرنا ہے تو وہ اللہ تعالیٰ کے علم، قدرت، زمین و آسمان اور خود ان کو پیدا کرنے اور عرش عظیم کا مالک ہونے کو جاننے اور ماننے کے باوجود دوبارہ زندہ کرنے کی بات کرنے پر عقل و دانش سے مکمل عاری ہو کر کہہ دیں گے کہ یہ تو کھلے جادو کے سوا کچھ نہیں، یعنی دوبارہ زندہ ہونے کی کچھ حقیقت نہیں، جو لوگ اسے مان بیٹھے ہیں ان پر جادو ہو گیا ہے۔ کوئی ان سے پوچھے کہ پھر تم اس جادو کی زد میں آنے سے کیسے بچ گئے ؟"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) {وَ لَىِٕنْ اَخَّرْنَا عَنْهُمُ الْعَذَابَ اِلٰۤى اُمَّةٍ مَّعْدُوْدَةٍ …:’’ اُمَّةٍ ‘‘} کے بہت سے معانی ہیں، مثلاً جماعت، امام، طریقہ، مدت اور راستہ وغیرہ، یہاں مدت مراد ہے اور {’’ مَعْدُوْدَةٍ ‘‘} کا معنی تھوڑی سی ہے، کیونکہ زیادہ چیز کی گنتی نہیں ہوا کرتی اور جو چیز گنی جا سکے وہ آخر ختم ہو جاتی ہے۔ دنیا کے عذاب بدر، احد، خندق، فتح مکہ، قتل، قید، غلامی اور پھر مرنے کے بعد جہنم کے عذاب آنے میں گنتی ہی کے دن ہیں، مگر آ جانے کے بعد پھر وہ عذاب ہٹایا نہیں جا سکے گا اور وہی عذاب جسے وہ مذاق کیا کرتے تھے انھیں چاروں طرف سے گھیر لے گا۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {وَ لَىِٕنْ اَذَقْنَا الْاِنْسَانَ مِنَّا رَحْمَةً … :} یعنی انسان میں یہ کمزوری ہے کہ کوئی رحمت صرف چکھنے کے بعد، یعنی تھوڑی سی نعمت صرف کچھ دیر کے لیے ملنے کے بعد چھن جائے تو اللہ تعالیٰ کی ساری نعمتیں اس طرح بھولتا ہے کہ آئندہ کے لیے اس کی تمام نعمتوں سے نہایت ناامید ہو جاتا ہے اور گزشتہ اور موجودہ کوئی نعمت اسے یاد ہی نہیں رہتی۔ یہی اس کی ناشکری اور نعمت کا انکار ہے۔ شوکانی نے فرمایا کہ {’’ اَذَقْنَا ‘‘} کے لفظ سے ادنیٰ سے ادنیٰ نعمت تھوڑی سی مدت کے لیے ملنا واضح ہو رہا ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {وَ لَىِٕنْ اَذَقْنٰهُ نَعْمَآءَ بَعْدَ ضَرَّآءَ …: ’’ نَعْمَآءَ ‘‘} ایسی نعمت جس کا اثر صاحبِ نعمت پر ظاہر ہو۔ اسی طرح {’’ ضَرَّآءَ ‘‘} ایسی مصیبت جس کا برا اثر انسان پر ظاہر ہو۔ (طنطاوی) {’’ اِنَّهٗ لَفَرِحٌ فَخُوْرٌ ‘‘} یعنی بہت پھولنے اور اترانے لگتا ہے اور سمجھتا ہے کہ اب تمام مصیبتیں اور سختیاں دور ہو گئیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {اِلَّا الَّذِيْنَ صَبَرُوْا وَ عَمِلُوا الصّٰلِحٰتِ:} یعنی صابر مومن کا یہ حال نہیں، وہ نہ راحت میں پھولتا ہے اور نہ مصیبت میں رب کی نعمتوں کو بھولتا ہے۔ یہی بات سورۂ معارج (۱۹ تا ۳۵) میں تفصیل کے ساتھ بیان ہوئی ہے۔ صہیب رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ عَجَبًا لِأَمْرِ الْمُؤْمِنِ، إِنَّ أَمْرَهٗ كُلَّهٗ لَهٗ خَيْرٌ وَلَيْسَ ذٰلِكَ لِأَحَدٍ إِلاَّ لِلْمُؤْمِنِ، إِنْ أَصَابَتْهٗ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَّهٗ، وَ إ إِنْ أَصَابَتْهٗ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَّهٗ ] [ مسلم، الزہد، باب المؤمن أمرہ کلہ خیر : ۲۹۹۹ ] ’’مومن کا معاملہ عجیب ہے، کیونکہ اس کا ہر کام ہی خیر ہے اور یہ چیز مومن کے سوا کسی کو حاصل نہیں، اگر اسے کوئی خوشی پہنچتی ہے تو شکر کرتا ہے، سو وہ اس کے لیے خیر ہے اور اگر اسے کوئی تکلیف اور مصیبت پہنچتی ہے تو صبر کرتا ہے، سو وہ بھی اس کے لیے خیر ہوتی ہے۔‘‘"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {فَلَعَلَّكَ تَارِكٌۢ بَعْضَ مَا يُوْحٰۤى اِلَيْكَ …:} کفار ہر وقت کوئی نہ کوئی معجزہ لانے کی فرمائش کرتے رہتے تھے کہ آپ پر کوئی خزانہ کیوں نہیں اتارا گیا؟ چلیے آپ احد پہاڑ ہی سونے کا بنا دیجیے، یا کوئی فرشتہ ہی ساتھ لے آئیے۔ ان کی عجیب و غریب فرمائشوں کا ذکر سورۂ بنی اسرائیل (۹۰ تا ۹۳) اور سورۂ فرقان (۷،۸) میں کچھ تفصیل کے ساتھ ہے۔ ان آیات میں آپ صلی اللہ علیہ وسلم کو تسلی دی گئی ہے کہ ان کے شبہات، مطالبات اور طعن و تشنیع سے تنگ آ کر آپ پریشان اور غم زدہ نہ ہو جائیں، بلکہ شرک کی مذمت کے لیے اور توحید کے اثبات کے لیے جو بھی وحی آئے آپ کسی بھی کمی بیشی کے بغیر ان تک پہنچاتے رہیں۔ یہ نہ ہو کہ وحی کا وہ حصہ حذف کر دیں جس میں بتوں کی عیب جوئی اور شرک کی مذمت ہے۔ ¤ ➋ { اِنَّمَاۤ اَنْتَ نَذِيْرٌ :} یعنی آپ کو اللہ تعالیٰ نے محض عذاب سے ڈرانے کے لیے بھیجا ہے، لہٰذا کسی ملامت کرنے والے کی ملامت کی پروا کیے بغیر آپ اس فریضہ کو سرانجام دیتے رہیں۔ ¤ ➌ {وَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ وَّكِيْلٌ : } یعنی ان کے مطالبات کو پورا کرنا یا نہ کرنا اللہ کا کام ہے، ہر چیز اسی کے اختیار میں ہے۔ وہ اگر چاہے گا تو آپ کو ایک خزانہ کیا روئے زمین کے تمام خزانے دے دے گا اور ایک فرشتہ کیا آپ پر سیکڑوں فرشتے اتار دے گا۔ بہرحال جیسی اس کی مصلحت اور حکمت ہو گی ویسا ہی کرے گا، آپ کو ان چیزوں سے کیا غرض؟ ہر چیز کا نگران وہ خود ہے۔ آپ تو اللہ تعالیٰ کا جو حکم آئے بے دھڑک ان کو سناتے رہیں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {اَمْ يَقُوْلُوْنَ افْتَرٰىهُ قُلْ فَاْتُوْا بِعَشْرِ سُوَرٍ …:} یعنی اگر تمھیں اس قرآن کے اللہ تعالیٰ کا کلام ہونے میں شک و شبہ ہے تو تم سب جمع ہو کر اس چیلنج کا جواب دینے کی کوشش کرو۔ واضح رہے کہ قرآن میں متعدد مرتبہ اہل عرب کو چیلنج کیا گیا ہے۔ سورۂ بنی اسرائیل (۸۸) اور سورۂ طور (۳۴) میں پورے قرآن کی مثل لانے کا چیلنج کیا گیا ہے۔ اس کے بعد یہاں سورۂ ہود میں دس سورتوں کا چیلنج کیا گیا ہے۔ پھر سورۂ یونس اور بقرہ میں ایک سورت کا۔ لیکن اہل عرب پورا قرآن یا دس سورتیں تو کیا ایک سورت بھی بنا کر پیش نہ کر سکے۔ یہ قرآن کے کلام اللہ ہونے کا ناقابل تردید ثبوت ہے۔ (ابن کثیر) یاد رہے کہ قرآن مجید کا معجز ہونا، یعنی اس جیسی ایک سورت کی تصنیف بھی ناممکن ہونے کی وجہ قرآن مجید کی بے شمار خوبیاں ہیں، جو مخلوق کی بساط سے باہر ہیں۔ مسلم علماء نے اس پر بہت سی کتابیں لکھی ہیں، جن کا عنوان ہی ’’اعجاز القرآن‘‘ (ازباقلانی، صالح بن عبد العزیز وغیرہ) یا اس سے ملتا جلتا ہے۔ ان خوبیوں میں اس کی فصاحت و بلاغت کے ساتھ ساتھ اس کے اندازِ بیان کا اللہ کی شان کے مطابق جلال و جمال، اس کی کسی پیش گوئی یا خبر کا غلط نہ ہونا، اس کی آیات کا ایک دوسرے سے ٹکرانے سے پاک ہونا اور اس کی جامعیت وغیرہ بھی شامل ہیں۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) {فَاِلَّمْ يَسْتَجِيْبُوْا لَكُمْ فَاعْلَمُوْۤا … :} اس کے دو معنی ہو سکتے ہیں، ایک یہ کہ اے مسلمانو! اگر وہ کفار تمھارا یہ چیلنج قبول نہ کریں تو یقین کر لو کہ یہ صرف اللہ کے علم سے اتارا گیا ہے اور یہ کہ اس کے سوا کوئی معبود نہیں، تو کیا تم حکم ماننے والے ہو؟ یعنی اپنی کتاب کی حقانیت اس قدر واضح اور روشن ہونے پر تمھارے ایمان و یقین اور اس پر عمل میں اضافہ ہونا لازم ہے، تو کیا تم ایسا کرو گے؟ یا ایمان لانے کے باوجود حکم ماننے میں کوتاہی کرتے رہو گے؟ دوسرا معنی یہ ہے کہ پچھلی آیت میں مشرکین کو جو فرمایا تھا : «{ وَ ادْعُوْا مَنِ اسْتَطَعْتُمْ مِّنْ دُوْنِ اللّٰهِ }» کہ اللہ کے سو اجسے بلا سکتے ہو بلا لو، اس کے بعد اب فرمایا، اگر وہ تمام لوگ جنھیں تم اس کام کے لیے بلاؤ گے، مثلاً عرب کے بڑے بڑے فصحاء، بلغاء، شعراء، خطباء اور تمھارے تمام داتا اور دستگیر، اگر ان میں سے کوئی بھی تمھاری بات قبول نہ کرے اور {’’ اِنَّاۤ اَعْطَيْنٰكَ الْكَوْثَرَ ‘‘} جیسی تین آیات بھی نہ بنا سکیں تو پھر تمھیں لازم ہے کہ ایک تو اس بات پر یقین کر لو کہ یہ کتاب اللہ کے علم سے نازل کی گئی ہے، اس کی مثل لانا مخلوق کے بس کی بات نہیں۔ دوسرا اس بات پر یقین کر لو کہ اللہ کے سوا کوئی معبود برحق نہیں۔ تو اے جماعت کفار! پھر کیا تم اسلام قبول کرو گے یا اب بھی ضد اور عناد ہی پر اڑے رہو گے ؟"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 16،15) {مَنْ كَانَ يُرِيْدُ الْحَيٰوةَ الدُّنْيَا وَ زِيْنَتَهَا …:} یہ دو آیات کفار اور مشرکین کے بارے میں ہیں، کیونکہ دوسری آیت میں ہے : «{ لَيْسَ لَهُمْ فِي الْاٰخِرَةِ اِلَّا النَّارُ }» ’’ان کے لیے آخرت میں آگ کے سوا کچھ نہیں۔‘‘ مطلب یہ ہے کہ جو کفار یہاں دنیا طلبی کے لیے صدقہ و خیرات وغیرہ اور نیک عمل کرتے ہیں، جن کا تعلق رفاہ عامہ سے ہے، انھیں ان کاموں کا بدلہ دنیا ہی میں پورا پورا دے دیا جاتا ہے، لیکن یہ بدلہ ملنا اللہ تعالیٰ کی مرضی پر موقوف ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ مَنْ كَانَ يُرِيْدُ الْعَاجِلَةَ عَجَّلْنَا لَهٗ فِيْهَا مَا نَشَآءُ لِمَنْ نُّرِيْدُ ثُمَّ جَعَلْنَا لَهٗ جَهَنَّمَ١ۚ يَصْلٰىهَا مَذْمُوْمًا مَّدْحُوْرًا }» [ بنی إسرائیل : ۱۸ ] ’’جو شخص اس جلدی والی (دنیا) کا ارادہ رکھتا ہو ہم اس کو اس میں جلدی دے دیں گے جو چاہیں گے، جس کے لیے چاہیں گے، پھر ہم نے اس کے لیے جہنم بنا رکھی ہے، اس میں داخل ہو گا، مذمت کیا ہوا، دھتکارا ہوا۔‘‘ اسی معنی کی ایک اور آیت سورۂ شوریٰ (۲۰) میں بھی ہے۔ کفار کو دنیا میں کسی نیکی کا فائدہ آخرت میں عذاب کم ہونے کی صورت میں تو ہو سکتا ہے، لیکن ان کا آگ سے نکلنا کسی صورت ممکن نہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کی حمایت اور آپ صلی اللہ علیہ وسلم کی سفارش کی وجہ سے ابوطالب کے عذاب میں تخفیف ہو گی، مگر وہ آگ سے نکل نہیں سکے گا۔ اسی طرح آیات سے معلوم ہوتا ہے کہ کفر میں زیادتی اور کمی کی وجہ سے جہنم میں کفار کے عذاب میں کمی بیشی ہو گی، جیسا کہ فرمایا : «{ اِنَّ الْمُنٰفِقِيْنَ فِي الدَّرْكِ الْاَسْفَلِ مِنَنَ النَّارِ }» [ النساء : ۱۴۵ ] ’’بے شک منافق لوگ آگ کے سب سے نچلے درجے میں ہوں گے۔‘‘ نیکی کی کمی بیشی کی وجہ سے جنت کے درجات اور بدی کی کمی بیشی کی وجہ سے جہنم کے درکات میں فرق ہو گا۔ البتہ کفار کی کوئی نیکی انھیں جہنم سے نہیں نکال سکے گی، کیونکہ آخرت میں نیک عمل کی قبولیت کے لیے ایمان شرط ہے۔ دیکھیے سورۂ حجر کی دوسری آیت کی تفسیر۔ ¤ علمائے تفسیر نے ان دو آیتوں کو عام بھی مانا ہے اور لکھا ہے کہ اس میں منافق اور ریا کار بھی شامل ہیں کہ ان کے عمل بھی آخرت میں اکارت جائیں گے۔ چنانچہ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [رَجُلٌ اسْتُشْهِدَ فَأُتِيَ بِهٖ فَعَرَّفَهٗ نِعْمَتَهٗ فَعَرَفَهَا، قَالَ فَمَا عَمِلْتَ فِيْهَا، قَالَ قَاتَلْتُ فِيْكَ حَتَّى اسْتُشْهِدْتُ قَالَ كَذَبْتَ وَلٰكِنَّكَ قَاتَلْتَ لِأَنْ يُّقَالَ جَرِيْئٌ فَقَدْ قِيْلَ ثُمَّ اُمِرَ بِهٖ فَسُحِبَ عَلٰی وَجْهِهٖ حَتّٰی أُلْقِيَ فِي النَّارِ ] [ مسلم، الإمارۃ، باب من قاتل  للریاء… : ۱۹۰۵ ] ’’قیامت کے دن ایک شہید کو لایا جائے گا، اللہ تعالیٰ اسے اپنی نعمتوں کی پہچان کرائے گا، وہ انھیں پہچان لے گا، تو اللہ تعالیٰ فرمائے گا : ’’تو نے ان کے لیے کیا کیا؟‘‘ وہ کہے گا : ’’یا اللہ! میں نے لڑتے لڑتے تیری راہ میں جان دے دی۔‘‘ اللہ تعالیٰ فرمائیں گے : ’’تو نے جھوٹ کہا، تو نے محض اس لیے جنگ کی تھی کہ لوگ تجھے بہادر کہیں، چنانچہ تجھے یہ داد مل گئی۔‘‘ پھر حکم ہو گا اور اسے چہرے کے بل گھسیٹ کر آگ میں ڈال دیا جائے گا۔‘‘ اس کے بعد آپ صلی اللہ علیہ وسلم نے ریا کار قاری اور ریاکار دولت مند کے متعلق بھی یہی بیان فرمایا۔ واضح رہے کہ اگر اس آیت کو عام رکھا جائے تو {’’ لَيْسَ لَهُمْ فِي الْاٰخِرَةِ اِلَّا النَّارُ ‘‘} (ان کے لیے آخرت میں آگ کے سوا کچھ نہیں) کی تاویل کی جائے گی کہ کفار اور منافقین کے لیے تو دائمی جہنم ہے، مگر مسلمان گناہ گار سزا کے بعد جہنم سے نکل بھی آئیں گے اور بعض کو اللہ تعالیٰ معاف بھی کر دے گا، اہل سنت کا یہی عقیدہ ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16،15) {مَنْ كَانَ يُرِيْدُ الْحَيٰوةَ الدُّنْيَا وَ زِيْنَتَهَا …:} یہ دو آیات کفار اور مشرکین کے بارے میں ہیں، کیونکہ دوسری آیت میں ہے : «{ لَيْسَ لَهُمْ فِي الْاٰخِرَةِ اِلَّا النَّارُ }» ’’ان کے لیے آخرت میں آگ کے سوا کچھ نہیں۔‘‘ مطلب یہ ہے کہ جو کفار یہاں دنیا طلبی کے لیے صدقہ و خیرات وغیرہ اور نیک عمل کرتے ہیں، جن کا تعلق رفاہ عامہ سے ہے، انھیں ان کاموں کا بدلہ دنیا ہی میں پورا پورا دے دیا جاتا ہے، لیکن یہ بدلہ ملنا اللہ تعالیٰ کی مرضی پر موقوف ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ مَنْ كَانَ يُرِيْدُ الْعَاجِلَةَ عَجَّلْنَا لَهٗ فِيْهَا مَا نَشَآءُ لِمَنْ نُّرِيْدُ ثُمَّ جَعَلْنَا لَهٗ جَهَنَّمَ١ۚ يَصْلٰىهَا مَذْمُوْمًا مَّدْحُوْرًا }» [ بنی إسرائیل : ۱۸ ] ’’جو شخص اس جلدی والی (دنیا) کا ارادہ رکھتا ہو ہم اس کو اس میں جلدی دے دیں گے جو چاہیں گے، جس کے لیے چاہیں گے، پھر ہم نے اس کے لیے جہنم بنا رکھی ہے، اس میں داخل ہو گا، مذمت کیا ہوا، دھتکارا ہوا۔‘‘ اسی معنی کی ایک اور آیت سورۂ شوریٰ (۲۰) میں بھی ہے۔ کفار کو دنیا میں کسی نیکی کا فائدہ آخرت میں عذاب کم ہونے کی صورت میں تو ہو سکتا ہے، لیکن ان کا آگ سے نکلنا کسی صورت ممکن نہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کی حمایت اور آپ صلی اللہ علیہ وسلم کی سفارش کی وجہ سے ابوطالب کے عذاب میں تخفیف ہو گی، مگر وہ آگ سے نکل نہیں سکے گا۔ اسی طرح آیات سے معلوم ہوتا ہے کہ کفر میں زیادتی اور کمی کی وجہ سے جہنم میں کفار کے عذاب میں کمی بیشی ہو گی، جیسا کہ فرمایا : «{ اِنَّ الْمُنٰفِقِيْنَ فِي الدَّرْكِ الْاَسْفَلِ مِنَنَ النَّارِ }» [ النساء : ۱۴۵ ] ’’بے شک منافق لوگ آگ کے سب سے نچلے درجے میں ہوں گے۔‘‘ نیکی کی کمی بیشی کی وجہ سے جنت کے درجات اور بدی کی کمی بیشی کی وجہ سے جہنم کے درکات میں فرق ہو گا۔ البتہ کفار کی کوئی نیکی انھیں جہنم سے نہیں نکال سکے گی، کیونکہ آخرت میں نیک عمل کی قبولیت کے لیے ایمان شرط ہے۔ دیکھیے سورۂ حجر کی دوسری آیت کی تفسیر۔ ¤ علمائے تفسیر نے ان دو آیتوں کو عام بھی مانا ہے اور لکھا ہے کہ اس میں منافق اور ریا کار بھی شامل ہیں کہ ان کے عمل بھی آخرت میں اکارت جائیں گے۔ چنانچہ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [رَجُلٌ اسْتُشْهِدَ فَأُتِيَ بِهٖ فَعَرَّفَهٗ نِعْمَتَهٗ فَعَرَفَهَا، قَالَ فَمَا عَمِلْتَ فِيْهَا، قَالَ قَاتَلْتُ فِيْكَ حَتَّى اسْتُشْهِدْتُ قَالَ كَذَبْتَ وَلٰكِنَّكَ قَاتَلْتَ لِأَنْ يُّقَالَ جَرِيْئٌ فَقَدْ قِيْلَ ثُمَّ اُمِرَ بِهٖ فَسُحِبَ عَلٰی وَجْهِهٖ حَتّٰی أُلْقِيَ فِي النَّارِ ] [ مسلم، الإمارۃ، باب من قاتل  للریاء… : ۱۹۰۵ ] ’’قیامت کے دن ایک شہید کو لایا جائے گا، اللہ تعالیٰ اسے اپنی نعمتوں کی پہچان کرائے گا، وہ انھیں پہچان لے گا، تو اللہ تعالیٰ فرمائے گا : ’’تو نے ان کے لیے کیا کیا؟‘‘ وہ کہے گا : ’’یا اللہ! میں نے لڑتے لڑتے تیری راہ میں جان دے دی۔‘‘ اللہ تعالیٰ فرمائیں گے : ’’تو نے جھوٹ کہا، تو نے محض اس لیے جنگ کی تھی کہ لوگ تجھے بہادر کہیں، چنانچہ تجھے یہ داد مل گئی۔‘‘ پھر حکم ہو گا اور اسے چہرے کے بل گھسیٹ کر آگ میں ڈال دیا جائے گا۔‘‘ اس کے بعد آپ صلی اللہ علیہ وسلم نے ریا کار قاری اور ریاکار دولت مند کے متعلق بھی یہی بیان فرمایا۔ واضح رہے کہ اگر اس آیت کو عام رکھا جائے تو {’’ لَيْسَ لَهُمْ فِي الْاٰخِرَةِ اِلَّا النَّارُ ‘‘} (ان کے لیے آخرت میں آگ کے سوا کچھ نہیں) کی تاویل کی جائے گی کہ کفار اور منافقین کے لیے تو دائمی جہنم ہے، مگر مسلمان گناہ گار سزا کے بعد جہنم سے نکل بھی آئیں گے اور بعض کو اللہ تعالیٰ معاف بھی کر دے گا، اہل سنت کا یہی عقیدہ ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {اَفَمَنْ كَانَ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّهٖ … : ’’ يَتْلُوْهُ ‘‘ ’’ تَلاَ يَتْلُوْ ‘‘} کا معنی ہے پیچھے آنا، مراد اس کی تائید کرنا ہے۔ اس آیت کی مفسرین نے کئی تفسیریں کی ہیں، ان میں سے دو تفسیریں زیادہ درست معلوم ہوتی ہیں۔ سب سے واضح اور درست تفسیر تو یہ ہے کہ کیا وہ شخص جو اپنے رب کی طرف سے {’’ بَيِّنَةٍ ‘‘} (واضح دلیل) پر ہے، اس شخص سے مراد رسول اللہ صلی اللہ علیہ وسلم اور آپ کے متبع مومن ہیں۔ {’’ بَيِّنَةٍ ‘‘} سے مراد نبوت کی نشانیاں اور دلائل ہیں اور {’’ يَتْلُوْهُ شَاهِدٌ مِّنْهُ ‘‘} (اس کی طرف سے ایک گواہ اس کی تائید کر رہا ہو) میں {’’ شَاهِدٌ ‘‘} سے مراد قرآن مجید ہے جو آپ کے صدق کا شاہد ہے اور اس سے پہلے موسیٰ علیہ السلام کی کتاب سے مراد تورات ہے جو آپ صلی اللہ علیہ وسلم کی نبوت کی شہادت دے رہی ہے۔ مطلب یہ ہے کہ کیا یہ رسول اور اس کے پیروکار جو اپنے رب کی طرف سے دلیل پر ہیں، ان لوگوں کی طرح ہو سکتے ہیں جن کے پاس نہ رب تعالیٰ کی طرف سے کوئی دلیل ہے، نہ کوئی شاہد اور نہ کوئی اور پہلی آسمانی کتاب جو ان کی تائید کرے۔ یہ مطلب سب سے درست اس لیے کہا گیا ہے کہ اسی سورۂ ہود میں تقریباً ہر نبی نے یہ کہا کہ میں اپنے رب کی طرف سے ایک {’’ بَيِّنَةٍ ‘‘} پر ہوں۔ دیکھیے نوح علیہ السلام نے فرمایا : «{ يٰقَوْمِ اَرَءَيْتُمْ اِنْ كُنْتُ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّيْ وَ اٰتٰىنِيْ رَحْمَةً مِّنْ عِنْدِهٖ فَعُمِّيَتْ عَلَيْكُمْ اَننُلْزِمُكُمُوْهَا وَ اَنْتُمْ لَهَا كٰرِهُوْنَ }» [ ھود : ۲۸ ] ’’اے میری قوم! کیا تم نے دیکھا کہ اگر میں اپنے رب کی طرف سے ایک (بینہ) واضح دلیل پر (قائم) ہوں اور اس نے مجھے اپنے پاس سے بڑی رحمت عطا فرمائی ہو، پھر وہ تم پر مخفی رکھی گئی ہو، تو کیا ہم زبردستی اسے تم پر چپکا دیں گے، جب کہ تم اسے ناپسند کرنے والے ہو۔‘‘ صالح علیہ السلام نے کہا : «{ يٰقَوْمِ اَرَءَيْتُمْ اِنْ كُنْتُ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّيْ }» [ ھود : ۶۳ ] شعیب علیہ السلام نے کہا : «{ يٰقَوْمِ اَرَءَيْتُمْ اِنْ كُنْتُ عَلٰى بَيِّنَةٍ مِّنْ ررَّبِّيْ }» [ ھود : ۸۸ ] غرض ہر پیغمبر یہ کہتا رہا کہ میں اپنے رب کی طرف سے {’’بَيِّنَةٍ ‘‘} پر ہوں، کیونکہ اللہ تعالیٰ ہر پیغمبر کو اس کی نبوت کی واضح نشانی دے کر بھیجتے تھے اور قرآن مجید کا معجزہ، جس کی ایک سورت کی مثال پیش نہ کی جا سکی، وہ اللہ کی طرف سے آپ کا شاہد ہے۔ اسی طرح تورات بھی آپ کے حق ہونے کی شاہد ہے۔ ¤ دوسری تفسیر یہ ہے کہ {’’ بَيِّنَةٍ ‘‘} سے مراد عقل سلیم اور وہ فطرت سلیمہ ہے جس پر انسان کو پیدا کیا گیا ہے اور وہ عہد {’’اَلَسْتُ‘‘} ہے جس کا ہر شخص اپنے آپ پر شاہد بنا یا گیا ہے اور وہ ہے توحید الٰہی اور اپنے رب کی پہچان، فرمایا : «{ اَلَسْتُ بِرَبِّكُمْ }» [الأعراف : ۱۷۲ ] ’’کیا میں واقعی تمھارا رب نہیں ہوں؟‘‘ اور آپ صلی اللہ علیہ وسلم نے فرمایا : [ كُلُّ مَوْلُوْدٍ يُوْلَدُ عَلَی الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُمَجِّسَانِهِ ] [ بخاری، الجنائز، باب ما قیل فی أولاد المشرکین : ۱۳۸۵ ] ’’ہر بچہ فطرت (اسلام) پر پیدا ہوتا ہے، پھر اس کے ماں باپ اسے یہودی بنا دیتے ہیں یا نصرانی یا مجوسی۔‘‘ یعنی کیا وہ لوگ جو فطرت سلیمہ پر قائم ہیں، عقل سلیم سے کام لیتے ہیں اور اس کے ساتھ ان کے پاس اللہ تعالیٰ کی طرف سے ایک گواہ بھی آ چکا ہے، یعنی رسول اللہ صلی اللہ علیہ وسلم یا قرآن اور اس سے پہلے تورات بھی اس کی شہادت دے رہی ہے، جو رہنما بھی تھی اور رحمت بھی، تو کیا یہ لوگ ان کی طرح ہیں جن کے پاس نہ رب کی طرف سے کوئی {’’ بَيِّنَةٍ ‘‘} ہے، نہ کوئی اس کی طرف سے شاہد اور نہ گزشتہ کسی آسمانی کتاب کی شہادت۔ ہر گز نہیں، ایکک مومن دوسرا کافر، دونوں ایک جیسے کبھی نہیں ہو سکتے۔ ¤ ➋ { اُولٰٓىِٕكَ يُؤْمِنُوْنَ بِهٖ :} یعنی یہ {’’ بَيِّنَةٍ ‘‘} پر قائم لوگ اس رسول پر ایمان لاتے ہیں۔ ¤ ➌ { وَ مَنْ يَّكْفُرْ بِهٖ مِنَ الْاَحْزَابِ فَالنَّارُ مَوْعِدُهٗ:} اور جو اس کے ساتھ کفر کرے، خواہ وہ کسی گروہ عیسائی، یہودی، ہندو یا بدھ وغیرہ سے تعلق رکھتا ہو، اس کا ٹھکانا آگ ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَالَّذِيْ نَفْسُ مُحَمَّدٍ بِيَدِهٖ ! لاَ يَسْمَعُ بِيْ أَحَدٌ مِّنْ هٰذِهِ الْأُمَّةةِ يَهُوْدِيٌّ وَلاَ نَصْرَانِيٌّ ثُمَّ يَمُوْتُ وَلَمْ يُؤْمِنْ بِالَّذِيْ اُرْسِلْتُ بِهٖ إِلاَّ كَانَ مِنْ أَصْحَابِ النَّارِ ] [ مسلم، الإیمان، باب وجوب الإیمان برسالۃ نبینا محمد صلی اللہ علیہ وسلم … : ۱۵۳ ، عن أبی ھریرۃ رضی اللہ عنہ ] ’’قسم اس کی جس کے ہاتھ میں محمد ( صلی اللہ علیہ وسلم ) کی جان ہے! میرے بارے میں اس امت (دعوت) میں سے کوئی یہودی یا نصرانی سن لے، پھر وہ فوت ہو اور اس پر ایمان نہ لایا ہو جو مجھے دے کر بھیجا گیا ہے، تو وہ اصحاب النار سے ہو گا۔‘‘ مشرکین اور نام کے مسلمان، جو دل سے آپ کی رسالت کو نہیں مانتے، وہ بھی انھی میں شامل ہیں۔ مزید دیکھیے سورۂ بقرہ (۶۲) اور نساء (۱۵۰ تا ۱۵۲)۔ ¤ ➍ { فَلَا تَكُ فِيْ مِرْيَةٍ مِّنْهُ:} بظاہر خطاب رسول اللہ صلی اللہ علیہ وسلم سے ہے، مگر مراد ہر عاقل ہے۔ ¤ ➎ { وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يُؤْمِنُوْنَ :} اکثر یت کا یہ حال قرآن میں متعدد بار بیان ہوا ہے، مثلاً دیکھیے سورۂ یوسف (۱۰۳)، انعام (۱۱۶) اور سبا (۲۰) دین جمہوریت اور دین اسلام کو ایک قرار دینے والے غور فرمائیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { وَ مَنْ اَظْلَمُ مِمَّنِ افْتَرٰى عَلَى اللّٰهِ كَذِبًا:} یعنی اپنی جان پر ظلم کرنے والے بہت ہیں، مگر اس سے بڑھ کر کوئی نہیں جو جھوٹ گھڑ کر اللہ تعالیٰ کے ذمے لگا دے، مثلاً مخلوق کو خالق کی صفات رکھنے والا قرار دے، بتوں، ولیوں اور دیوتاؤں کو اللہ کے حضور بلا اجازت سفارش کی جرأت رکھنے والے سمجھے، فرشتوں کو اللہ کی بیٹیاں قرار دے اور مسیح علیہ السلام یا کسی اور کو اللہ کی اولاد یا اس کا حصہ یا ٹکڑا قرار دے۔ موضح میں ہے کہ اللہ پر جھوٹ باندھنا کئی طرح سے ہے، مثلاً علم میں غلط نقل کرنا۔ (آل عمران : ۷۸) نبوت یا وحی کا جھوٹا دعویٰ کرنا۔ (انعام : ۹۳) خواب بنا لینا، ابن عمر رضی اللہ عنھما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ مِنْ أَفْرَی الْفِرٰی أَنْ يُّرِيَ عَيْنَيْهٖ مَا لَمْ تَرَ ] [ بخاري، التعبیر، باب من کذب فی حلمہ : ۷۰۴۳ ] ’’سب سے بڑے جھوٹوں میں سے ایک یہ ہے کہ آدمی اپنی آنکھوں کو وہ چیز دکھائے جو انھوں نے نہیں دیکھی (یعنی جھوٹا خواب بیان کرے)۔‘‘ درایت یا عقل کو دین کے معاملات میں درمیان لے آنا۔ (قصص : ۵۰) ¤ ➋ { اُولٰٓىِٕكَ يُعْرَضُوْنَ عَلٰى رَبِّهِمْ:} اللہ تعالیٰ ایسے مفتری اور جھوٹے کفار و مشرکین اور منافقین کو قیامت کے دن سب کے سامنے رسوا کرے گا اور گواہ بھی سب کے سامنے ان کے رب تعالیٰ پر جھوٹ باندھنے کی شہادت دیں گے۔ البتہ مومن گناہ گاروں کا معاملہ اس سے مختلف ہو گا۔ عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : [ إِنَّ اللّٰهَ يُدْنِي الْمُؤْمِنَ فَيَضَعُ عَلَيْهِ كَنَفَهٗ وَيَسْتُرُهٗ فَيَقُوْلُ أَتَعْرِفُ ذَنْبَ كَذَا ؟ أَتَعْرِفُ ذَنْبَ كَذَا؟ فَيَقُوْلُ نَععَمْ أَيْ رَبِّ، حَتَّی قَرَّرَهٗ بِذُنُوْبِهِ وَرَأَی فِيْ نَففْسِهِ أَنَّهٗ هَلَكَ، قَالَ سَتَرْتُهَا عَلَيْكَ فِيْ الدُّنْيَا، وَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ، فَيُعْطَی كِتَابَ حَسَنَاتِهِ، وَأَمَّا الْكَافِرُ وَالْمُنَافِقُوْنَ فَيَقُوْلُ الْأَشْهَادُ: «{ هٰۤؤُلَآءِ الَّذِيْنَ كَذَبُوْا عَلٰى رَبِّهِمْ اَلَا لَعْنَةُ اللّٰهِ عَلَى الظّٰلِمِيْنَ }» [هود:۱۸ ] [ بخاری، المظالم، باب قول اللہ تعالٰی : « ألا لعنۃ اللّٰہ علی الظالمین » : ۲۴۴۱ ] ’’اللہ تعالیٰ مومن کو قریب کرے گا اور اس پر اپنا دامن ڈال کر پردے میں کرے گا، پھر کہے گا کہ تو فلاں گناہ پہچانتا ہے؟ کیا فلاں گناہ پہچانتا ہے؟ وہ کہے گا، ہاں اے میرے رب! یہاں تک کہ جب اس سے اس کے گناہوں کا اقرار کروا لے گا اور وہ اپنے دل میں سمجھ لے گا کہ وہ ہلاک ہو گیا تو (اللہ تعالیٰ) فرمائے گا، میں نے دنیا میں تجھ پر ان گناہوں پر پردہ ڈالا اور آج میں تجھے وہ بخشتا ہوں، تو اسے اس کی نیکیوں کی کتاب دے دی جائے گی۔ رہا کافر اور منافق، تو گواہ کہیں گے : «{ هٰۤؤُلَآءِ الَّذِيْنَ كَذَبُوْا عَلٰى رَبِّهِمْ اَلَا لَعْنَةُ اللّٰهِ عَ عَلَى الظّٰلِمِيْنَ }» ’’یہ وہ لوگ ہیں جنھوں نے اپنے رب پر جھوٹ بولا۔ سن لو ! ظالموں پر اللہ کی لعنت ہے۔‘‘ ¤ ➌ { وَ يَقُوْلُ الْاَشْهَادُ هٰۤؤُلَآءِ الَّذِيْنَ …:} گواہوں سے مراد ان کے پیغمبر یا وہ فرشتے جو عمل لکھتے ہیں اور علماء جنھوں نے اللہ کے احکام کی تبلیغ کی۔ یہ سب گواہ کفار کے متعلق اعلان کریں گے کہ یہی لوگ ہیں جو اپنے پروردگار سے جھوٹی باتیں منسوب کرتے تھے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19){الَّذِيْنَ يَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ …:} یعنی اللہ کی سیدھی راہ (اسلام) میں کجی اور عیب ڈھونڈ کر لوگوں کو اس میں داخل ہونے سے روکتے ہیں۔ {’’ هُمْ ‘‘} کی ضمیر دو بار لانے کا مطلب یہ ہے کہ آخرت کا انکار کرنے میں یہ لوگ اس حد تک پہنچ گئے ہیں کہ گویا آخرت کے اصل منکر یہی ہیں۔ {’’ يَبْغُوْنَهَا عِوَجًا ‘‘} میں لام محذوف ہے، یعنی {’’يَبْغُوْنَ لَهَا عِوَجًا‘‘} جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اَلْحَمْدُ لِلّٰهِ الَّذِيْۤ اَنْزَلَ عَلٰى عَبْدِهِ الْكِتٰبَ وَ لَمْ يَجْعَلْ لَّهٗ عِوَججًا }» [ الکہف:۱ ] یا {’’ يَبْغُوْنَهَا عِوَجًا ‘‘} میں {’’ فِيْ‘‘} محذوف ہے، یعنی {’’ يَبْغُوْنَ فِيْهَا عِوَجًا ‘‘} جیسا کہ اللہ تعالیٰ نے قیامت کے دن زمین کے متعلق فرمایا : «{ لَا تَرٰى فِيْهَا عِوَجًا }» [طٰہٰ : ۱۰۷ ]"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { اُولٰٓىِٕكَ لَمْ يَكُوْنُوْا مُعْجِزِيْنَ …:} یعنی یہ لوگ کبھی بھی اللہ کو عاجز کرکے اس کی گرفت سے بھاگ نہیں سکتے۔ وہ جب پکڑنا چاہے گا، اس زمین پر بھی پکڑ لے گا اور آخرت کا تو کہنا ہی کیا ہے۔ پھر اللہ کے سوا کبھی کوئی ان کا مددگار نہیں ہو گا جو انھیں اللہ کے عذاب اور پکڑ سے چھڑا سکے۔ ¤ ➋ { يُضٰعَفُ لَهُمُ الْعَذَابُ :} ایک اپنے گمراہ ہونے کا عذاب، دوسرا لوگوں کو اللہ کی راہ سے روک کر گمراہ کرنے کا عذاب۔ دیکھیے سورۂ اعراف (۳۷، ۳۸) اور عنکبوت (۱۲، ۱۳)۔ ¤ ➌ { مَا كَانُوْا يَسْتَطِيْعُوْنَ۠ السَّمْعَ وَ مَا كَانُوْا يُبْصِرُوْنَ :} یعنی کان اور آنکھیں رکھنے کے باوجود حق سنتے یا دیکھتے نہیں تھے۔ دیکھیے سورۂ اعراف (۱۷۹) اور ایک معنی یہ ہے کہ انھیں رسول اللہ صلی اللہ علیہ وسلم سے اتنا بغض تھا کہ وہ آپ کی بات سن سکتے تھے نہ وہ آپ کو دیکھنا گوارا کرتے تھے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 22،21){ وَ ضَلَّ عَنْهُمْ مَّا كَانُوْا يَفْتَرُوْنَ … :} یعنی جھوٹے دعوے سب گم ہو گئے، اللہ کی گرفت آنے پر دنیا میں کوئی داتا، کوئی دستگیران کی مدد کو نہیں پہنچا اور اس میں شک نہیں کہ آخرت میں بھی یہی سب سے زیادہ خسارے والے ہوں گے، کیونکہ جن کو یہ سمجھ کر پکارتے تھے کہ وہ ہمیں بچائیں گے انھیں اپنی پڑی ہو گی۔ وہ سب ان سے غائب ہو جائیں گے، اگر سامنے ہوئے بھی تو ان سے بری ہونے کا اعلان کریں گے، بلکہ ان کے دشمن بن جائیں گے۔ دیکھیے سورۂ احقاف (۵، ۶)۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22،21){ وَ ضَلَّ عَنْهُمْ مَّا كَانُوْا يَفْتَرُوْنَ … :} یعنی جھوٹے دعوے سب گم ہو گئے، اللہ کی گرفت آنے پر دنیا میں کوئی داتا، کوئی دستگیران کی مدد کو نہیں پہنچا اور اس میں شک نہیں کہ آخرت میں بھی یہی سب سے زیادہ خسارے والے ہوں گے، کیونکہ جن کو یہ سمجھ کر پکارتے تھے کہ وہ ہمیں بچائیں گے انھیں اپنی پڑی ہو گی۔ وہ سب ان سے غائب ہو جائیں گے، اگر سامنے ہوئے بھی تو ان سے بری ہونے کا اعلان کریں گے، بلکہ ان کے دشمن بن جائیں گے۔ دیکھیے سورۂ احقاف (۵، ۶)۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) {اِنَّ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ … : ’’ اَخْبَتُوْۤا ‘‘ ’’اِخْبَاتٌ‘‘} کا معنی ہے جھکنا، عاجزی کرنا، مطمئن ہونا۔ جمل رحمہ اللہ نے فرمایا :{ ’’اَخْبَتَ لَهُ‘‘ } کا معنی ہے {’’خَشَعَ وَ خَضَعَ لَهُ ‘‘} وہ اس کے سامنے عاجز ہو گیا اور{ ’’ اَخْبَتَ اِلَيْهِ ‘‘ } کا معنی ہے {’’اِطْمَئَنَّ اِلَيْهِ‘‘} کہ وہ اس کی طرف سے مطمئن ہو گیا۔ سب سے بڑے ظالموں، یعنی اللہ پر جھوٹ باندھنے والے کفار و مشرکین کے بعد اب اہل ایمان کا تذکرہ فرمایا کہ جو لوگ ایمان لائے اور انھوں نے اعمال صالحہ کیے اور اپنے رب کے سامنے عاجز اور اس کی تقدیر اور فیصلے پر مطمئن ہو گئے وہ جنت کے مالک ہوں گے۔ ’’اخبات‘‘ والوں کی کچھ صفات سورۂ حج (۳۴، ۳۵، ۵۴) میں آئی ہیں۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) {مَثَلُ الْفَرِيْقَيْنِ كَالْاَعْمٰى وَ الْاَصَمِّ وَ الْبَصِيْرِ وَ السَّمِيْعِ …:} مثال سے کسی چیز کی تصویر سامنے آجاتی ہے اور اس کا سمجھنا آسان ہو جاتا ہے۔ مقصد یہ ہے کہ مومن دیکھنے اور سننے والا ہوتا ہے اور کافر اندھا اور بہرا ہوتا ہے۔ دونوں ایک دوسرے کی ضد اور خلاف ہیں۔ کیا تم سمجھتے نہیں کہ سیدھے راستے پر اندھا بہرا شخص کیسے چل سکتا ہے، جو نہ خود راستہ دیکھے، نہ بتانے سے سنے۔ اسی لیے کفار کہیں گے : «{لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ مَا كُنَّا فِيْۤ اَصْحٰبِ السَّعِيْرِ }» [ الملک : ۱۰ ] ’’اگر ہم سنتے یا سمجھتے ہوتے تو بھڑکتی آگ والوں میں نہ ہوتے۔‘‘"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ {وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖۤ:} جن حالات میں نبی صلی اللہ علیہ وسلم مکہ میں توحید کی دعوت پیش کر رہے تھے، وہ چونکہ ویسے ہی حالات تھے جو آپ صلی اللہ علیہ وسلم سے پہلے دوسرے انبیاء علیھم السلام کو پیش آ چکے تھے، اس لیے حسب موقع یہاں سے گزشتہ انبیاء کا ذکر کیا جا رہا ہے اور باقی سورت تقریباً اسی تذکرے سے بھری ہوئی ہے، تاکہ ایک طرف رسول اللہ صلی اللہ علیہ وسلم کی ہمت بندھے، آپ کو اور مسلمانوں کو تسلی ہو کہ انجام کار اللہ کے رسولوں اور اہل حق کی اللہ تعالیٰ کی طرف سے یقینا مدد ہوتی ہے اور دوسری طرف پہلی قوموں کے اعتراضات اور ان کے انبیاء کے جوابات آپ کے لیے نمونہ بنیں اور آپ کی قوم کو پہلے کفار کے انجام سے ڈرایا جائے۔ ¤ ➋ آدم علیہ السلام اللہ تعالیٰ کے نبی تھے، وہ اور ان کی اولاد سب موحد اور دین حق پر تھے، پھر شیطان کے بہکانے سے بزرگوں کی پوجا بت پرستی کی صورت میں شروع ہوئی۔ اللہ تعالیٰ کی طرف سے زمین پر سب سے پہلے رسول نوح علیہ السلام بھیجے گئے، جیسا کہ حدیث شفاعت میں ہے اور بت پرستی کے آغاز کی تفصیل سورۂ نوح میں آئے گی۔ نوح علیہ السلام کا ذکر قرآن میں ۴۳ بار آیا ہے۔ ¤ ➌ { اِنِّيْ لَكُمْ نَذِيْرٌ مُّبِيْنٌ:} نوح علیہ السلام نے صرف ڈرانے کا ذکر اس لیے فرمایا کہ ان کی قوم نے سمع و طاعت کا اظہار ہی نہیں کیا کہ انھیں خوش خبری دی جاتی۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26){اَنْ لَّا تَعْبُدُوْۤا اِلَّا اللّٰهَ …:} یہی ہر رسول کی دعوت تھی اور یہی سب کی بعثت کا مقصد تھا، فرمایا : «{ وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ }» [ الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔‘‘ ’’میں تم پر دردناک عذاب سے ڈرتا ہوں‘‘ کے بجائے فرمایا : ’’دردناک دن کے عذاب سے ڈرتا ہوں۔‘‘ یہ زیادہ ڈرانے کے لیے فرمایا کہ وہ عذاب اتنا دردناک ہے کہ جس دن وہ آئے گا وہ دن ہی سرا سر الم والا، یعنی نہایت دردناک ہو گا۔ یہی بات اس سورت کی آیت (۳) میں رسول اللہ صلی اللہ علیہ وسلم نے فرمائی۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ {فَقَالَ الْمَلَاُ الَّذِيْنَ كَفَرُوْا مِنْ قَوْمِهٖ: } آلوسی نے فرمایا :{ ’’ الْمَلَاُ ‘‘ } کا لفظ اسم جمع ہے، جیسا کہ {’’رَهْطٌ‘‘ } (گروہ) ہے۔ اس لفظ سے اس کا واحد کوئی نہیں آتا۔ {’’ مَلَأَ يَمْلَأُ ‘‘} کا معنی بھرنا ہے، یعنی ایک رائے پر متفق لوگوں کی جماعت، جس کے رعب و جلال اور ظاہری شکل و صورت سے آنکھیں بھر رہی ہوں۔ (راغب) ¤ ➋ {مَا نَرٰىكَ اِلَّا بَشَرًا مِّثْلَنَا :} نوح علیہ السلام اور دوسرے پیغمبروں کی امتوں کے کافروں کی طرح ممکہ کے کافر بھی ہمارے نبی صلی اللہ علیہ وسلم کے بارے میں یہی بات کہا کرتے تھے کہ جو شخص ہماری طرح کا بشر ہو، جو کھاتا پیتا، بازاروں میں چلتا پھرتا، سوتا جاگتا، بیویاں اور بال بچے رکھتا ہو، آخر وہ اللہ کا رسول کیسے ہو سکتا ہے۔ (دیکھیے فرقان : ۷) مطلب یہ ہے کہ رسالت اور بشریت میں تضاد ہے اور ان دونوں کا ایک شخص میں جمع ہونا ناممکن ہے، حالانکہ تمام انبیاء میں دونوں اوصاف جمع تھے، جیسا کہ فرمایا : «{ قُلْ سُبْحَانَ رَبِّيْ هَلْ كُنْتُ  اِلَّا بَشَرًا رَّسُوْلًا }» [ بنی إسرائیل : ۹۳ ] ’’تو کہہ میرا رب پاک ہے، میں تو ایک بشر کے سو اکچھ نہیں جو رسول ہے۔‘‘ اور دیکھیے سورۂ فرقان (۲۰) اور مومنون (۳۳، ۳۴) کفار آپ کا بشر ہونا جانتے تھے، کیونکہ آپ انھی میں پیدا ہوئے تھے، اس لیے انھوں نے آپ کو رسول ماننے سے انکار کر دیا۔ افسوس کہ کچھ جدی پشتی مسلمان باپ دادا سے سن کر آپ کو رسول مانتے ہیں، مگر آپ کے بشر ہونے سے انکار کرتے ہیں۔ درحقیقت یہ ایک ہی ذہن ہے کہ انسان رسول نہیں ہو سکتا۔ ¤ ➌ {وَ مَا نَرٰىكَ اتَّبَعَكَ … : ’’اَرَاذِلُ‘‘ ’’اَرْذَلُ‘‘} کی جمع ہے، یعنی کم تر درجے کے لوگ۔{ ’’ بَادِيَ ‘‘ ’’ بَدَا يَبْدُوْ ‘‘} (ظاہر ہونا) سے اسم فاعل ہو تو معنی ہو گا ظاہر دیکھنے میں اور {’’بَدَءَ يَبْدَءُ‘‘} (شروع ہونا) سے ہو تو معنی ہو گا پہلی نظر میں، یعنی اس وجہ سے بھی ہم آپ کی پیروی اختیار نہیں کر سکتے کہ کچھ لوگ جو آپ کے متبع ہو گئے ہیں وہ تو دیکھنے ہی سے نظر آتے ہیں کہ ہمارے رذالے یعنی کم تر درجے کے لوگ ہیں۔ گویا ان کی نظر میں اس شخص کے تابع ہونا، جس کے پیروکار معاشرے میں نچلے درجے کے لوگ ہوں، ان کی شان کے منافی ہے۔ (دیکھیے شعراء : ۱۱۱) بعینہٖ یہی بات مکہ کے کھاتے پیتے لوگ نبی صلی اللہ علیہ وسلم کے بارے میں کہا کرتے تھے کہ ان کی پیروی ہماری قوم کے غلام اور نچلے طبقے کے لوگ کرتے ہیں۔ ( دیکھیے انعام : ۵۲ تا ۵۴) حالانکہ حق کی تاریخ سے ثابت ہے کہ اس کے ابتدائی پیروکار دنیوی لحاظ سے کمزور لوگ ہی ہوئے ہیں، جیسا کہ صحیح بخاری میں ہرقل اور ابوسفیان کے سوال و جواب میں مذکور ہے کہ جب ابوسفیان نے بتایا کہ اس کی پیروی ضعفاء نے کی ہے تو ہرقل نے کہا، یہی لوگ تمام رسولوں کے پیروی کرنے والے رہے ہیں۔ [ بخاری، بدء الوحی، باب کیف کان بدء الوحی … : ۷ ] ¤ ➍ { وَ مَا نَرٰى لَكُمْ عَلَيْنَا مِنْ فَضْلٍ:} ’’ہم تمھارے لیے اپنے آپ پر کوئی برتری نہیں دیکھتے‘‘ قوم کا یہ خطاب نوح علیہ السلام اور ان کے پیروکاروں سے ہے کہ کسی بھی چیز میں تم ہم سے بڑھ کر نہیں ہو۔ ¤ ➎ { بَلْ نَظُنُّكُمْ كٰذِبِيْنَ:} یعنی اس بات میں کہ تم کہتے ہو نوح علیہ السلام اللہ کے رسول ہیں۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { قَالَ يٰقَوْمِ اَرَءَيْتُمْ اِنْ كُنْتُ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّيْ …:} نوح علیہ السلام نے ان کے تمام اعتراضات کا جامع جواب دیا، ایک تو یہ کہ میرے پاس میرے رب کی طرف سے اللہ تعالیٰ کی توحید اور اپنی رسالت کے مضبوط دلائل اور پختہ یقین موجود ہے، یعنی {’’ وَ اٰتٰىنِيْ رَحْمَةً مِّنْ عِنْدِهٖ ‘‘} دوسرا یہ کہ یہ نبوت کسی کی محنت کا نتیجہ یا کسی کے آبا و اجداد کی جائداد نہیں، یہ تو محض اللہ تعالیٰ کی اپنے پاس سے خاص عنایت ہے، اس کی تقسیم تمھارے ہاتھ میں نہیں۔ یہ اللہ جسے چاہے دیتا ہے، خواہ وہ غریب ہو یا امیر، جیسا کہ مکہ والوں نے ہمارے نبی کریم صلی اللہ علیہ وسلم پر اعتراض کیا تھا : «وَ قَالُوْا لَوْ لَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيْمٍ» [ الزخرف : ۳۱ ] ’’اور انھوں نے کہا کہ یہ قرآن ان دو بستیوں (مکہ اور طائف) میں سے کسی بڑے آدمی پر کیوں نازل نہ کیا گیا؟‘‘ اللہ تعالیٰ نے ان کا جواب دیا : «{ اَهُمْ يَقْسِمُوْنَ رَحْمَتَ رَبِّكَ نَحْنُ قَسَمْنَا بَيْنَهُمْ مَّعِيْشَتَهُمْ فِي الْحَيٰوةِ الدُّنْيَا }» [ الزخرف : ۳۲ ] ’’کیا وہ تیرے رب کی رحمت تقسیم کرتے ہیں؟ ہم نے خود ان کے درمیان ان کی معیشت دنیا کی زندگی میں تقسیم کی۔‘‘ ¤ ➋ { فَعُمِّيَتْ عَلَيْكُمْ:} اس کا مادہ {’’عَمْيٌ‘‘} ہے، اندھا ہونا، یعنی یہ بتاؤ کہ اگر تمھیں اس دلیل اور رحمت سے اندھا رکھا گیا ہو اور تمھاری بے وقوفی کی وجہ سے وہ تم پر ایسی مخفی رہی ہو کہ تم دیکھ ہی نہ سکے ہو تو اس میں ہمارا کیا قصور ہے ؟ ¤ ➌ {اَنُلْزِمُكُمُوْهَا وَ اَنْتُمْ لَهَا كٰرِهُوْنَ:} یعنی کیا ہم زبردستی تمھیں اس دلیل کا قائل کر لیں اور اس رحمت کے سائے میں دھکے سے داخل کر لیں، جب کہ تم اس سے نفرت کرتے ہو اور دور بھاگتے ہو۔ {’’ اَنُلْزِمُكُمُوْهَا ‘‘} میں ایک لفظ کے اندر تین ضمیروں کو ایسے طریقے سے جمع کیا ہے کہ لفظ انتہائی خوبصورت اور واضح ہو گیا ہے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 30،29) ➊ { وَ يٰقَوْمِ لَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مَالًا …:} اور اے میری قوم! میں اللہ کا یہ پیغام تمھیں پہنچانے پر تم سے کسی اجرت کا مطالبہ نہیں کرتا، مبادا تم سمجھو کہ نوح نے مال کھینچنے کے لیے نبوت کا بہانہ کھڑا کر لیا۔ میری اجرت تو اللہ کے سوا کسی کے ذمے بھی نہیں اور نہ دنیا کی کسی چیز کا تم سے مطالبہ ہے۔ ¤ ➋ { وَ مَاۤ اَنَا بِطَارِدِ الَّذِيْنَ اٰمَنُوْا :} یعنی جس طرح اللہ کی رحمت (اسلام) کے دامن میں آنے سے جب تک تم نفرت اور کراہت کرتے رہو گے، میں تمھیں زبردستی اسلام لانے پر مجبور نہیں کر سکتا، اسی طرح جیسے تم چاہتے ہو کہ جن لوگوں نے میری پیروی اختیار کی ہے، چونکہ وہ نچلے طبقے کے لوگ ہیں، اس لیے میں انھیں دھکے دے کر نکال دوں، یہ کام میں ہر گز نہیں کر سکتا۔ یہ اسی قسم کا مطالبہ تھا جو قریش کے سردار نبی صلی اللہ علیہ وسلم سے کرتے تھے، مگر اللہ تعالیٰ نے اس سے منع فرما دیا۔ دیکھیے سورۂ انعام (۵۲)، کہف (۲۸) اور سورۂ عبس۔ ¤ ➌ { اِنَّهُمْ مُّلٰقُوْا رَبِّهِمْ:} یععنی اگر میں ان کو ستاؤں یا اپنی مجلس سے نکال دوں تو وہ اللہ تعالیٰ سے اپنا انصاف چاہیں گے، اس کا میں کیا جواب دوں گا۔ یا یہ کہ وہ لوگ تو اللہ کے ہاں عزت پا لیں گے اور اس بارگاہِ عالی میں ان کو ایمان و عمل کے باعث مقام و مرتبہ ملے گا، پھر تمھارے ان کو ذلیل سمجھنے سے کیا ہوتا ہے؟ یہ ان کے دوسرے اعتراض کا جواب ہے کہ اے نوح! آپ کے متبع ہمارے رذالے ہیں۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’کافروں نے مسلمانوں کو رذالہ ٹھہرایا اور چاہا کہ ان کو ہانک دو تو ہم تمھارے پاس بیٹھیں اور بات سنیں۔ سو فرمایا کہ دل کی بات اللہ تعالیٰ تحقیق کرے گا جب اسے ملیں گے، میں اگر مسلمانوں کو ہانکوں تو اللہ سے کون چھڑوائے مجھ کو۔ اور رذالہ ٹھہرایا اس پر کہ وہ کسب کرتے تھے۔ کسب سے بہتر کمائی نہیں، اس واسطے فرمایا کہ تم جاہل ہو۔‘‘ (موضح) ¤ ➍ {وَ لٰكِنِّيْۤ اَرٰىكُمْ قَوْمًا تَجْهَلُوْنَ :} یعنی تم کسی بات کو بھی صحیح طرح نہیں سمجھتے، تمھاری نظر صرف ظاہر چیزوں پر ہے اور انجام پر غور نہیں کرتے۔ بھلا یہ بھی کوئی بات ہے کہ فلاں شخص نیچ قوم کا ہے، اس لیے اسے اپنے پاس نہ بیٹھنے دو؟ اللہ کے نزدیک اسی کو عزت ہے جو ایمان دار اور پرہیز گار ہے۔ بے ایمان اور بدکار کتنے ہی اونچے خاندان کا ہو اللہ کے نزدیک چوہڑے اور چمار سے بھی بدتر ہے۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30،29) ➊ { وَ يٰقَوْمِ لَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مَالًا …:} اور اے میری قوم! میں اللہ کا یہ پیغام تمھیں پہنچانے پر تم سے کسی اجرت کا مطالبہ نہیں کرتا، مبادا تم سمجھو کہ نوح نے مال کھینچنے کے لیے نبوت کا بہانہ کھڑا کر لیا۔ میری اجرت تو اللہ کے سوا کسی کے ذمے بھی نہیں اور نہ دنیا کی کسی چیز کا تم سے مطالبہ ہے۔ ¤ ➋ { وَ مَاۤ اَنَا بِطَارِدِ الَّذِيْنَ اٰمَنُوْا :} یعنی جس طرح اللہ کی رحمت (اسلام) کے دامن میں آنے سے جب تک تم نفرت اور کراہت کرتے رہو گے، میں تمھیں زبردستی اسلام لانے پر مجبور نہیں کر سکتا، اسی طرح جیسے تم چاہتے ہو کہ جن لوگوں نے میری پیروی اختیار کی ہے، چونکہ وہ نچلے طبقے کے لوگ ہیں، اس لیے میں انھیں دھکے دے کر نکال دوں، یہ کام میں ہر گز نہیں کر سکتا۔ یہ اسی قسم کا مطالبہ تھا جو قریش کے سردار نبی صلی اللہ علیہ وسلم سے کرتے تھے، مگر اللہ تعالیٰ نے اس سے منع فرما دیا۔ دیکھیے سورۂ انعام (۵۲)، کہف (۲۸) اور سورۂ عبس۔ ¤ ➌ { اِنَّهُمْ مُّلٰقُوْا رَبِّهِمْ:} یععنی اگر میں ان کو ستاؤں یا اپنی مجلس سے نکال دوں تو وہ اللہ تعالیٰ سے اپنا انصاف چاہیں گے، اس کا میں کیا جواب دوں گا۔ یا یہ کہ وہ لوگ تو اللہ کے ہاں عزت پا لیں گے اور اس بارگاہِ عالی میں ان کو ایمان و عمل کے باعث مقام و مرتبہ ملے گا، پھر تمھارے ان کو ذلیل سمجھنے سے کیا ہوتا ہے؟ یہ ان کے دوسرے اعتراض کا جواب ہے کہ اے نوح! آپ کے متبع ہمارے رذالے ہیں۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’کافروں نے مسلمانوں کو رذالہ ٹھہرایا اور چاہا کہ ان کو ہانک دو تو ہم تمھارے پاس بیٹھیں اور بات سنیں۔ سو فرمایا کہ دل کی بات اللہ تعالیٰ تحقیق کرے گا جب اسے ملیں گے، میں اگر مسلمانوں کو ہانکوں تو اللہ سے کون چھڑوائے مجھ کو۔ اور رذالہ ٹھہرایا اس پر کہ وہ کسب کرتے تھے۔ کسب سے بہتر کمائی نہیں، اس واسطے فرمایا کہ تم جاہل ہو۔‘‘ (موضح) ¤ ➍ {وَ لٰكِنِّيْۤ اَرٰىكُمْ قَوْمًا تَجْهَلُوْنَ :} یعنی تم کسی بات کو بھی صحیح طرح نہیں سمجھتے، تمھاری نظر صرف ظاہر چیزوں پر ہے اور انجام پر غور نہیں کرتے۔ بھلا یہ بھی کوئی بات ہے کہ فلاں شخص نیچ قوم کا ہے، اس لیے اسے اپنے پاس نہ بیٹھنے دو؟ اللہ کے نزدیک اسی کو عزت ہے جو ایمان دار اور پرہیز گار ہے۔ بے ایمان اور بدکار کتنے ہی اونچے خاندان کا ہو اللہ کے نزدیک چوہڑے اور چمار سے بھی بدتر ہے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { وَ لَاۤ اَقُوْلُ لَكُمْ عِنْدِيْ خَزَآىِٕنُ اللّٰهِ …: } یہ اس بات کا جواب ہے جو ان لوگوں نے کہی تھی کہ ہمیں تو تم اپنے جیسے ایک انسان نظر آتے ہو اور یہ کہ ہم تم کو کسی بات میں اپنے سے برتر نہیں پاتے۔ اس پر نوح علیہ السلام فرماتے ہیں کہ ہاں میں واقعی تم ہی جیسا ایک بشر ہوں، نہ میرے پاس اللہ تعالیٰ کے خزانے ہیں، نہ میں غیب کی باتیں جانتا ہوں اور نہ میں فرشتہ ہونے کا دعویٰ کرتا ہوں، یعنی اس قسم کی کوئی فوقیت مجھ میں نہیں ہے۔ میرا جو بھی دعویٰ ہے وہ صرف اتنا ہے کہ میں اللہ کا بھیجا ہوا رسول ہوں اور اس نے مجھے سیدھے راستے کی ہدایت بخشی ہے۔ میرا یہ دعویٰ ناقابل تردید ہے، اس کی تم جس طرح چاہو آزمائش کر لو۔ ¤ ➋ {وَ لَاۤ اَقُوْلُ لِلَّذِيْنَ تَزْدَرِيْۤ اَعْيُنُكُمْ …: ’’ تَزْدَرِيْۤ ‘‘} اس کا مادہ {’’ زري‘‘} ہے، {’’ زَرَيْتُ عَلَيْهِ ‘‘} میں نے اس پر عیب لگایا۔ باب افتعال میں جا کر افتعال کی تاء کو دال کے ساتھ بدلنے سے {’’اِزْدَرَي يَزْدَرِيْ اِزْدِرَاءً‘‘} بن گیا، جس کا معنی حقیر جاننا ہے۔ (قاموس) یعنی مجھ سے یہ امید نہ رکھو کہ محض تمھیں خوش کرنے کے لیے ان لوگوں کے بارے میں اس قسم کی جاہلانہ بات کہوں گا۔ مطلب یہ ہے کہ مذکورہ چیزیں (اللہ کے خزانوں کا مالک ہونا، عالم الغیب ہونا، فرشتہ ہونا) نبوت کے ساتھ کوئی تعلق نہیں رکھتیں کہ ان کے بغیر نبوت نہیں مل سکتی اور نہ ان چیزوں کے کسی شخص کے پاس نہ ہونے کا مطلب یہ ہے کہ وہ ہر خیر سے خالی ہے اور جو شخص مال دار نہ ہو اسے اللہ تعالیٰ کی طرف سے کوئی خیر بھی حاصل نہیں ہو سکتی، بلکہ اللہ تعالیٰ قادر ہے کہ ناتوانوں کو عزت دیتا ہے اور عزت والوں کو دم بھر میں ذلیل کر دیتا ہے۔ اس وقت بھی یہ لوگ اپنے رب پر ایمان اور اس کے رسول کی پیروی کی بدولت تم سے زیادہ باعزت اور شریف ہیں۔ (روح المعانی) ¤ ➌ { اَللّٰهُ اَعْلَمُ بِمَا فِيْۤ اَنْفُسِهِمْ :} اگر ان کے دلوں میں ایمان اور اخلاص ہے تو اللہ کے ہاں ضرور اجر پائیں گے، تم اور میں مل کر بھی انھیں اس اجر سے محروم نہیں کر سکتے۔ ¤ ➍ { اِنِّيْۤ اِذًا لَّمِنَ الظّٰلِمِيْنَ :} یعنی اگر میں انھیں خواہ مخواہ ذلیل قرار دوں۔ یہ اشارہ ہے کہ تم انھیں رذالے کہنے میں ظالم ہو، یا یہ کہ اگر میں خزائنِ الٰہی کو جمع کرنے یا غیب کے جاننے اور فرشتہ ہونے کا دعویٰ کروں تو میں ظالموں میں سے ہوں گا۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32){قَالُوْا يٰنُوْحُ قَدْ جٰدَلْتَنَا … :} جب وہ نوح علیہ السلام کے دلائل کے سامنے بے بس ہو گئے اور نوح علیہ السلام ایک مدت دراز تک ( ۹۵۰ سال۔ عنکبوت : ۱۴) دن رات ایک ایک شخص کو اور پوری پوری مجلس کو (دیکھیے سورۂ نوح) اللہ کی توحید سمجھاتے رہے، نہ تھکے اور نہ ہمت ہاری تو بجائے اس کے کہ ان کی قوم ایمان لے آتی یا اللہ سے درخواست کرتی کہ اے اللہ! اگر نوح علیہ السلام کی بات سچ ہے تو اس کے لیے ہمارے سینے کھول دے، الٹا عذاب الٰہی لانے کا مطالبہ کر دیا۔ یہ اس بات کی مثال ہے کہ شرک انسان کو عقل اور فطرتِ الٰہی پر چلنے سے کس حد تکک محروم کر دیتا ہے اور اس کی بھی کہ مشرک پرانے زمانے کا ہو یا آخری پیغمبر صلی اللہ علیہ وسلم کی امت کا، دونوں ایک ہی طرح عقل سے خالی ہو جاتے ہیں۔ دیکھیے ابوجہل اور مشرکین مکہ کی نبی صلی اللہ علیہ وسلم کے سچا ہونے کی صورت میں اللہ تعالیٰ سے دعا جو سورۂ انفال (۳۲) میں مذکور ہے۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 34،33) نوح علیہ السلام نے جواب میں کسی تلخی کا مظاہرہ نہیں کیا، بلکہ اپنی اور اللہ تعالیٰ کی حیثیت واضح فرمائی کہ عذاب لانا یا نہ لانا میرا کام نہیں، یہ تو اللہ کا اختیار ہے۔ وہ اگر چاہے گا تو تم پر عذاب لے آئے گا، پھر تم اللہ تعالیٰ کی گرفت سے نکل نہیں سکو گے اور جس طرح کائنات کا ایک ذرہ بھی اللہ کی مرضی کے بغیر حرکت یا سکون میں نہیں آ سکتا، انسان ہدایت اور گمراہی کی ایک حد تک اختیار رکھنے کے باوجود اللہ تعالیٰ کے ارادے اور اس کی توفیق کے بغیر پیغمبر کی خیر خواہی اور نصیحت سے کچھ فائدہ نہیں اٹھا سکتا۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34،33) نوح علیہ السلام نے جواب میں کسی تلخی کا مظاہرہ نہیں کیا، بلکہ اپنی اور اللہ تعالیٰ کی حیثیت واضح فرمائی کہ عذاب لانا یا نہ لانا میرا کام نہیں، یہ تو اللہ کا اختیار ہے۔ وہ اگر چاہے گا تو تم پر عذاب لے آئے گا، پھر تم اللہ تعالیٰ کی گرفت سے نکل نہیں سکو گے اور جس طرح کائنات کا ایک ذرہ بھی اللہ کی مرضی کے بغیر حرکت یا سکون میں نہیں آ سکتا، انسان ہدایت اور گمراہی کی ایک حد تک اختیار رکھنے کے باوجود اللہ تعالیٰ کے ارادے اور اس کی توفیق کے بغیر پیغمبر کی خیر خواہی اور نصیحت سے کچھ فائدہ نہیں اٹھا سکتا۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35){ اَمْ يَقُوْلُوْنَ افْتَرٰىهُ قُلْ اِنِ افْتَرَيْتُهٗ …:} اس آیت کی مفسرین نے الگ الگ تفسیریں کی ہیں۔ بعض نے اسے نوح علیہ السلام کے قصے ہی سے متعلق سمجھتے ہوئے اس میں خطاب نوح علیہ السلام سے قرار دیا ہے اور بعض نے اسے نوح علیہ السلام کے قصے کے درمیان جملہ معترضہ قرار دیا ہے اور اسے مشرکین مکہ کا قول قرار دے کر رسول اللہ صلی اللہ علیہ وسلم سے خطاب قرار دیا ہے، یعنی کیا (مکہ کے کافر) کہتے ہیں کہ اس (محمد صلی اللہ علیہ وسلم ) نے اس (قرآن) کو اپنے دل سے گھڑ لیا ہے۔ (اے محمد!) کہہ دے اگر میں نے اسے اپنے دل سے گھڑا ہے تو میرے گناہ کا وبال مجھ پر پڑے گا اور تم جو گناہ کرتے ہو میں اس کی ذمہ داری سے بری ہوں۔ علمائے تفسیر میں سے رازی اور ان کی موافقت میں شوکانی نے پہلے قول کو ترجیح دی ہے اور لکھا ہے کہ یہی اکثر مفسرین کا قول ہے۔ حافظ ابن کثیر اور صاحب کشاف نے دوسری تفسیر کو راجح قرار دیا ہے، یہی رائے شاہ عبد القادر رحمہ اللہ کی ہے، امکان دونوں کا ہے۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36){وَ اُوْحِيَ اِلٰى نُوْحٍ اَنَّهٗ لَنْ يُّؤْمِنَ … :} نوح علیہ السلام سے متعلق قرآن مجید کی تمام آیات پر مجموعی نظر ڈالیں تو یہ بات سمجھ میں آتی ہے کہ ان کے بے مثال صبر کے ساتھ مسلسل صدیوں دعوت دینے کے باوجود قوم نے ان کے انکار اور ایذا رسانی میں کوئی کمی نہ کی، بلکہ ہر نسل اپنی اولاد کو وصیت کرکے مرتی رہی کہ دیکھنا اپنے بتوں کو ہر گز نہ چھوڑنا اور نوح علیہ السلام کی بات مت ماننا۔ (سورۂ نوح) اس کے باوجود نوح علیہ السلام پُر امید رہ کر نہایت استقامت کے ساتھ انھیں دعوتِ توحید دیتے رہے، مگر جب اللہ تعالیٰ نے انھیں یہ اطلاع دی کہ اب آئندہ آپپ کی قوم میں سے کوئی ایمان نہیں لائے گا تو انھوں نے ان پر عذاب کے لیے بددعا کی۔ جس کا ذکر سورۂ قمر (۱۰) میں ہے، فرمایا : «{ اَنِّيْ مَغْلُوْبٌ فَانْتَصِرْ }» ’’بے شک میں مغلوب ہوں سو تو بدلہ لے۔‘‘ اور سورۂ نوح میں ان کی دعا کے الفاظ ہیں : «{ رَبِّ لَا تَذَرْ عَلَى الْاَرْضِ مِنَ الْكٰفِرِيْنَ دَيَّارًا }» ’’اے میرے رب! زمین پر ان کافروں میں سے کوئی رہنے والا نہ چھوڑ۔‘‘ آیت (۲۶) سے آخر سورت تک ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ {وَ اصْنَعِ الْفُلْكَ بِاَعْيُنِنَا وَ وَحْيِنَا :} نوح علیہ السلام کی دعا قبول ہوئی اور اللہ تعالیٰ نے کفار پر عذاب کے وعدے کے ساتھ نوح علیہ السلام کو دو باتوں کی تاکید فرمائی، پہلی تو یہ کہ پانی کے طوفان سے بچنے کے لیے ہماری آنکھوں کے سامنے اور ہماری وحی کے مطابق ایک بحری جہاز بناؤ۔ یاد رہے کہ{’’ الْفُلْكَ ‘‘} کا لفظ بڑی کشتی (بحری جہاز) کے لیے استعمال ہوتا ہے اور واحد و جمع اور مذکر و مؤنث سبھی کے لیے ایک ہی لفظ ہے۔ اللہ تعالیٰ کی نگرانی میں اور اس کی ہدایت کے مطابق بننے والی کشتی کتنی شان دار ہو گی، اس کا اندازہ نہیں ہو سکتا۔ بعض لوگوں نے اس کی لمبائی، چوڑائی اور اونچائی بیان کی ہے، مگر ان تمام باتوں کی کوئی پختہ دلیل نہیں ہے۔ دوسری بات یہ کہ جب تم نے خود ہی دعا کی ہے کہ یا اللہ! زمین پر رہنے والا ایک کافر بھی باقی نہ چھوڑ، تو اب عذاب آنے پر ظلم کرنے والوں (مشرکوں) کے بارے میں مجھ سے کوئی بات (سفارش) مت کرنا، کیونکہ ان کے غرق کیے جانے کا فیصلہ ہو چکا ہے۔ ¤ ➋ { بِاَعْيُنِنَا وَ وَحْيِنَا :} معلوم ہوا کہ اللہ تعالیٰ کے لیے آنکھوں کا لفظ استعمال ہو سکتا ہے اور اللہ تعالیٰ کی صفات میں سے اس کی آنکھیں بھی ہیں۔ دوسری جگہ موسیٰ علیہ السلام کے متعلق فرمایا : «{ وَ لِتُصْنَعَ عَلٰى عَيْنِيْ }» [ طٰہٰ : ۳۹ ] ’’اور تاکہ تیری پرورش میری آنکھوں کے سامنے کی جائے۔‘‘ بعض لوگ اللہ تعالیٰ کے لیے آنکھیں ہونے سے انکار کرتے ہیں، ان کے خیال میں اللہ تعالیٰ کی آنکھیں ماننے سے مخلوق کے ساتھ تشبیہ لازم آتی ہے، یعنی وہ ہمارے جیسا بن جاتا ہے، کیونکہ ہماری بھی آنکھیں ہیں، جبکہ اللہ تعالیٰ کی مثل کوئی چیز نہیں۔ ان حضرات نے اسی بہانے سے اللہ تعالیٰ کی بے شمار صفات کا انکار کر دیا اور کئی ایک کی تاویل کر دی، مثلاً اللہ تعالیٰ کے چہرے، ہاتھ، پنڈلی، کان اور آنکھ کا، اس کے اترنے، چڑھنے، سننے، بولنے، دیکھنے، خوش ہونے اور ناراض ہونے کا انکار کر دیا، یا اپنے پاس سے کوئی اور مطلب بیان کر دیا، یا کہا کہ ہمیں معلوم ہی نہیں اس کا معنی کیا ہے۔ ان بے چاروں نے غور نہیں کیا کہ جب آپ قرآن مجید میں اللہ تعالیٰ کے لیے {’’عَيْنٌ‘‘} کا لفظ بول رہے ہیں تو اردو میں آنکھ کہنے سے آپ کو کیا پریشانی ہے۔ بعض حضرات نے اس کا ترجمہ کیا ’’ہماری نگرانی میں کشتی بنا۔‘‘ چلیے یہ بھی درست ہے، مگر اس کے لیے آنکھوں کے انکار کی ضرورت نہیں، بلکہ وہ نگرانی بھی آنکھوں کے ساتھ ہی تھی۔ {’’ بِاَعْيُنِنَا ‘‘} کا ترجمہ نگرانی کریں، پھر بھی مشابہت والا اعتراض ختم نہیں ہوتا، کیونکہ انسان نگرانی بھی کرتا ہے، یہ بھی مشابہت ہو گئی۔ ان کو چاہیے تھا کہ جو کچھ اللہ تعالیٰ نے فرمایا، اس پر ایمان رکھتے اور اس مشکل کا حل جو اللہ تعالیٰ نے خود فرمایا ہے، اس کو تسلیم کرتے۔ چنانچہ اللہ تعالیٰ نے خود فرمایا ہے : «{ لَيْسَ كَمِثْلِهٖ شَيْءٌ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ }» [ الشوریٰ : ۱۱ ] ’’اس کی مثل کوئی چیز نہیں اور وہی سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔‘‘ ’’اس کی مثل کوئی چیز نہیں‘‘ کے باوجود وہ سنتا بھی ہے، دیکھتا بھی، سمع و بصر بھی رکھتا ہے، مگر اس کا سننا، دیکھنا، ہنسنا، غصے ہونا، اترنا، چڑھنا، بولنا، اس کے کان، آنکھیں اور پنڈلی سب کچھ ہونے کے باوجود کوئی چیز مخلوق جیسی نہیں۔ اگر ہم اس حد تک چلے جائیں کہ مخلوق پر بولا جانے والا کوئی لفظ اللہ تعالیٰ پر بولا جا ہی نہیں سکتا، تو پھر ہم اپنے اللہ تعالیٰ ہی کو گم کر بیٹھیں گے۔ کیونکہ ہم زندہ ہیں، موجود ہیں، علم رکھتے ہیں، اب اللہ تعالیٰ کے حق میں اس کا انکار کرکے دیکھو تو نتیجہ یہ نکلے گا کہ اللہ تعالیٰ موجود ہی نہیں۔ ایسے خبیث عقیدے سے اللہ کی پناہ۔ یقینا ہم زندہ و موجود ہیں اور اللہ تعالیٰ بھی زندہ و موجود ہے، مگر ہماری زندگی اور وجود اللہ تعالیٰ کی زندگی اور وجود سے کوئی مشابہت نہیں رکھتے۔ اس کی زندگی اور وجود اس کی شان کے لائق ہے، جو ازلی، ابدی اور لامحدود ہے۔ وہ کسی کا محتاج نہیں اور ہمارا وجود اور زندگی فانی، محدود اور اللہ کے محتاج ہیں۔ ¤ یہ لوگ عجیب باتیں کرتے ہیں، کبھی کہتے ہیں اللہ تعالیٰ نہ اوپر ہے نہ نیچے، نہ عرش پر ہے نہ آسمان دنیا پر اترتا ہے اور نہ قیامت کے دن آئے گا، تو پھر وہ کہاں ہے؟ کہتے ہیں، یہ پوچھنا ہی منع ہے، وہ نہ مکان میں ہے نہ لا مکان میں۔ پھر کبھی کہتے ہیں، وہ ہر جگہ ہے، کبھی کہتے ہیں، کہیں بھی نہیں۔ اللہ کے بندو! جو کچھ تعارف اللہ تعالیٰ نے اپنا خود کروایا ہے وہ ہر صورت مانو، مگر یہ کہو کہ اس کی آنکھیں، کان، چہرہ، اترنا اور چڑھنا وغیرہ سب کچھ ہے مگر مخلوق میں سے کسی کی طرح نہیں، بلکہ وہ اسی طرح ہے جیسے اس کی شان کے لائق ہیں۔ دراصل یہ لوگ اللہ کی صفات پر ایمان لانے سے اس لیے محروم ہوئے کہ انھوں نے اس کے چہرے، آنکھوں، ہاتھوں اور سننے و دیکھنے وغیرہ کو اپنے جیسا سمجھا، اس لیے انکار کر دیا۔ اگر وہ اس حقیقت کو سمجھ لیتے اور اس پر ایمان رکھتے کہ اللہ تعالیٰ نے اپنے متعلق جو جو الفاظ بولے ہیں، سب حق ہیں، مگر مخلوق میں سے کسی کے مشابہ نہیں تو وہ ایمان سے ہاتھ نہ دھوتے۔ ¤ ➌ {وَ لَا تُخَاطِبْنِيْ فِي الَّذِيْنَ ظَلَمُوْا … : ’’ الَّذِيْنَ ظَلَمُوْا ‘‘} سے مراد مشرک ہیں، کیونکہ شرک سے بڑی ناانصافی کوئی نہیں۔ نوح علیہ السلام کی بیوی اور ایک بیٹا مشرک تھے۔ اللہ تعالیٰ نے پہلے ہی ان کے حق میں کسی بھی قسم کی بات کرنے سے منع فرما دیا، کیونکہ مشرک کی نجات کی کوئی صورت نہیں۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ { وَ يَصْنَعُ الْفُلْكَ:} ماضی کے ایک واقعہ کو مضارع کے صیغے سے بیان فرمایا۔ اس سے ان کا مسلسل کئی دنوں تک اس بڑی کشتی کو بناتے رہنا ثابت ہوتا ہے، جیساکہ{’’كَانَ‘‘ } کا صیغہ جو ماضی ہے، مضارع پر آ جائے تو اس سے مراد ماضی میں استمرار ہوتا ہے، اس لیے ترجمہ کیا ہے ’’اور وہ کشتی بناتا رہا۔‘‘ بعض اہل علم نے فرمایا کہ اللہ تعالیٰ نے مضارع کا لفظ حکایت حال، یعنی وہ نقشہ سامنے لانے کے لیے استعمال فرمایا، گویا ہم دیکھ رہے ہیں کہ نوح علیہ السلام کشتی بنا رہے ہیں اور قوم کے لوگ انھیں مذاق کر رہے ہیں، یہ معنی بھی جید ہے۔ ¤ ➋ { وَ كُلَّمَا مَرَّ عَلَيْهِ مَلَاٌ مِّنْ قَوْمِهٖ سَخِرُوْا مِنْهُ …: } وہ اس پر مذاق کرتے کہ بڑے میاں ترکھان کب سے بن گئے اور اب اس حد تک دماغ میں خلل آ گیا کہ خشک زمین پر پانی میں غرق ہونے سے بچاؤ کا بندوبست کر رہے ہیں۔ نوح علیہ السلام اس پر ہنستے کہ یہ لوگ بجائے اس کے کہ ایمان اور اطاعت کے ذریعے سے عذاب الٰہی سے بچاؤ حاصل کریں، الٹا کفر اور نافرمانی پر اصرار کرکے اور اللہ کے نشانات کا مذاق اڑا کر عذاب کو دعوت دے رہے ہیں۔ یہ بھی ہو سکتا ہے کہ نوح علیہ السلام نے فرمایا ہو کہ جیسے تم ہمارا مذاق اڑا رہے ہو، وہ وقت بالکل قریب ہے جب تم غوطے کھا رہے ہو گے اور ہم تمھارا مذاق اڑائیں گے، جیسا کہ تم ہمارا مذاق اڑا رہے ہو۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یہ (نوح علیہ السلام ) ہنستے اس پر کہ موت سر پر کھڑی ہے اور یہ ہنستے ہیں۔‘‘ (موضح)"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39){عَذَابٌ مُّقِيْمٌ :} یعنی آخرت میں جہنم کا عذاب جو ہمیشہ رہنے والا ہے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ {حَتّٰۤى اِذَا جَآءَ اَمْرُنَا وَ فَارَ التَّنُّوْرُ: ’’ فَارَ يَفُوْرُ فَوْرًا ‘‘} جوش مار کر نکلنا۔ فوارہ بھی اسی سے ہے۔ {’’التَّنُّوْرُ‘‘} (بروزن {فَعُّوْلٌ} ) کا معروف معنی تنور ہے، جس میں روٹیاں پکائی جاتی ہیں۔ اللہ تعالیٰ نے نوح علیہ السلام کے گھر میں طوفان کا نشان بتا رکھا تھا کہ جب اس تنور سے پانی ابلے تب کشی میں سوار ہو جاؤ۔ (موضح) اکثر مفسرین نے تنور سے یہی عام تنور مراد لیا ہے، لیکن حسب تفسیر ابن عباس (ابن جریر) {’’ التَّنُّوْرُ ‘‘} سے مراد روئے زمین ہے۔ قاموس میں بھی لکھا ہے : {’’ وَجْهُ الْأَرْضِ وَ كُلُّ مَفْجَرِ مَاءٍ وَ مَحْفَلُ مَاءِ الْوَادِيْ ‘‘} ’’روئے زمین، پانی پھوٹنے کی جگہ اور وادی کے پانی کے جمع ہونے کی جگہ۔‘‘ اس تفسیر کی رو سے مراد یہ ہے کہ ساری زمین پانی کا چشمہ بن گئی اور پانی ابلنے لگا، جیسا کہ دوسرے مقام پر ہے : «{ وَ فَجَّرْنَا الْاَرْضَ عُيُوْنًا }» [القمر : ۱۲ ] ’’اور ہم نے زمین کو چشموں سے پھاڑ دیا۔‘‘ حتیٰ کہ تنور جو آگ کی جگہ ہوتے ہیں، پانی کے فوارے بن گئے۔ ویسے پہلا معنی زیادہ قرین قیاس ہے، کیونکہ علامت ظاہر ہونے کے ساتھ ہی کشتی میں سوار ہونے اور ہر جانور کا جوڑا رکھنے کا زیادہ موقع ہے، لیکن جب ساری زمین سے چشمے پھوٹ نکلیں تو یہ کام مشکل ہے اور تنور روٹیاں پکانے کے لیے عام معروف بھی ہے۔ امام طبری اور رازی نے بھی اسی معنی کو ترجیح دی ہے، کیونکہ معروف معنی چھوڑنے کی کوئی دلیل نہیں۔ ام ہشام بنت حارثہ رضی اللہ عنھا فرماتی ہیں : [ كَانَ تَنُّوْرُنَا وَ تَنُّوْرُ رَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَاحِدًا ] [ مسلم، الجمعۃ، باب تخفیف الصلاۃ والخطبۃ : ۸۷۳ ] ’’ہمارا تنور اور رسول اللہ صلی اللہ علیہ وسلم کا تنور ایک ہی تھا۔‘‘ {’’ اَمْرُنَا ‘‘} سے مراد عذاب کا حکم ہے کہ آسمان سے موسلا دھار پانی برسنے لگا اور زمین سے چشموں کی طرح پانی ابلنا شروع ہو گیا، دونوں طبقے مل گئے اور زمین پانی میں غرق ہو گئی۔ دیکھیے سورۂ قمر (۱۱، ۱۲)۔ ¤ ➋ { قُلْنَا احْمِلْ فِيْهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ …: ’’ مِنْ كُلٍّ ‘‘ } میں {’’ كُلٍّ ‘‘} کی تنوین مضاف الیہ محذوف کا عوض ہے : {’’ اَيْ مِنْ كُلِّ نَوْعٍ تَحْتَاجُ اِلَيْهِ ‘‘} جب عذاب کے آثار شروع ہوئے تو اللہ تعالیٰ نے حکم دیا کہ جانوروں کی ہر قسم میں سے ایک ایک جوڑا کشتی میں سوار کر لو، جن کی نسل باقی رہنا مقدر تھی۔ {’’ وَ اَهْلَكَ اِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ وَ مَنْ اٰمَنَ ‘‘} یعنی اپنی بیوی جس کا ذکر سورۂ تحریم میں ہے اور اس بیٹے جس کا ذکر زیرِ تفسیر آیات میں آ رہا ہے (جن کے کفر کی وجہ سے ان کا ڈوبنا پہلے طے ہو چکا ہے) ان کے سوا اپنے تمام گھر والوں کو اور ان لوگوں کو جو آپ پر ایمان لائے ہیں، کشتی میں سوار کر لو۔ ¤ ➌ {وَ مَاۤ اٰمَنَ مَعَهٗۤ اِلَّا قَلِيْلٌ:} یہ وہی تھے جن کو قوم نے اپنے اراذل کہا تھا۔ اللہ تعالیٰ نے فرمایا کہ ان پر بہت تھوڑے لوگ ہی ایمان لائے۔ ان کی تعداد بہت سے مفسرین (۷۹) یا (۸۰) بیان کرتے ہیں، مثلاً آلوسی وغیرہ، جن میں وہ نوح علیہ السلام کے تین بیٹوں سام، حام اور یافث کا نام لیتے ہیں، کافر بیٹے کا نام کنعان تھا۔ ان چاروں کی بیویاں مسلمان تھیں اور ۷۲ مرد اور عورتیں دوسرے مسلمان تھے۔ بعض نے یہ تعداد چالیس(۴۰) بتائی ہے۔ ہمارے شیخ محمد عبدہ الفلاح رحمہ اللہ لکھتے ہیں : ’’قرآن وحدیث میں ان کی تعداد کا کوئی ذکر نہیں۔‘‘ اور ظاہر ہے کہ ان دونوں چیزوں کے علاوہ کوئی معتبر ذریعہ معلوم کرنے کا ہمارے پاس نہیں ہے۔ [ وَاللّٰہُ اَعْلَمُ بِعَدَدِھِمْ ]"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ {وَ قَالَ ارْكَبُوْا فِيْهَا بِسْمِ اللّٰهِ مَجْرٖىهَا وَ مُرْسٰىهَا : ’’ ارْكَبُوْا فِيْهَا ‘‘} عام طور پر سوار ہونے کے لیے {’’رَكِبَ عَلَيْهِ ‘‘} آتا ہے، یہاں {’’ اِرْكَبُوْا عَلَيْهَا ‘‘} کی جگہ{’’ ارْكَبُوْا فِيْهَا ‘‘} اس لیے فرمایا کہ کشتی میں کمرے کی طرح داخل ہو کر بیٹھا جاتا ہے، جب کہ گھوڑے وغیرہ کے اوپر سوار ہوتے ہیں۔ (ابن عاشور) اس سے یہ بھی معلوم ہوتا ہے کہ وہ کشتی صرف تختے نہیں تھے جن کے اوپر وہ سوار ہوئے تھے، بلکہ اللہ تعالیٰ کی نگرانی میں تیار ہونے والی وہ کشتی بہترین کمروں، آرام دہ سیٹوں اور کئی منزلوں والی تھی، جن میں وہ سوار ہوئے۔ {’’مَجْرَي ‘‘ ’’ جَرَي يَجْرِيْ ‘‘} (ض) سے مصدر میمی ہے، یعنی چلنا۔ بعض قراء نے اس میں امالہ کیا ہے، یعنی الف کو یاء کی طرف اور فتحہ کو کسرہ کی طرف مائل کرکے پڑھتے ہیں۔ {’’ مُرْسَي‘‘} یہ باب افعال {’’اَرْسَي يُرْسِيْ‘‘ } ( {ر س و}) سے مصدر میمی ہے، یعنی اس کا ٹھہرنا۔ کشتی میں سوار ہوتے وقت نوح علیہ السلام نے یہ دعا پڑھی، اس لیے کشتی میں سوار ہوتے وقت یہ دعا قرآن مجید سے ثابت ہے۔ سورۂ مومنون میں وہ دعا بھی مذکور ہے جو کشتی پر سوار ہو کر آرام سے بیٹھ جانے پر پڑھنے کا اللہ تعالیٰ نے حکم دیا تھا : «{ فَقُلِ الْحَمْدُ لِلّٰهِ الَّذِيْ نَجّٰىنَا مِنَ الْقَوْمِ الظّٰلِمِيْنَ }» اور «{ رَبِّ اَنْزِلْنِيْ مُنْزَلًا مُّبٰرَكًا وَّ اَنْتَ خَيْرُ الْمُنْزِلِيْنَ }» [ المؤمنون : ۲۸، ۲۹ ] سورۂ زخرف میں کشتی ہو یا کوئی بھی سواری، اس پر سوار ہوتے وقت اللہ تعالیٰ نے یہ دعا سکھائی ہے : «{ سُبْحٰنَ الَّذِيْ سَخَّرَ لَنَا هٰذَا وَ مَا كُنَّا لَهٗ مُقْرِنِيْنَ (13) وَ اِنَّاۤ اِلٰى رَبِّنَا لَمُنْقَلِبُوْنَ۠ }» [ الزخرف : ۱۳، ۱۴ ] ’’پاک ہے وہ جس نے اسے ہمارے تابع کر دیا، حالانکہ ہم اسے قابو میں لانے والے نہ تھے اور بے شک ہم اپنے رب ہی کی طرف ضرور لوٹ کر جانے والے ہیں۔‘‘ صحیح مسلم میں رسول اللہ صلی اللہ علیہ وسلم سے اونٹ پر سوار ہو کر یہ دعا پڑھنے کی حدیث موجود ہے، اس میں مزید الفاظ بھی ہیں۔ [ دیکھیے مسلم، الحج، باب استحباب الذکر إذا رکب دابتہ متوجھا… : ۱۳۴۲، عن ابن عمر رضی اللہ عنھما] ¤ ➋ {اِنَّ رَبِّيْ لَغَفُوْرٌ رَّحِيْمٌ :} مطلب یہ ہے کہ ہم سب جو کشتی میں سوار ہو کر عذاب سے بچے ہیں، اس لیے نہیں بچے کہ ہم گناہوں سے یکسر پاک ہیں، بلکہ اس کی وجہ یہ ہے کہ میرا رب غفور و رحیم ہے۔ ایمان لانے کی وجہ سے اس نے ہماری لغزشوں سے درگزر فرما کر ہمیں یہ عزت بخشی ہے۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ { وَ هِيَ تَجْرِيْ بِهِمْ فِيْ مَوْجٍ كَالْجِبَالِ :} پہاڑوں جیسی موجوں سے طوفان کے پانی کی وسعت، اس کی طغیانی اور جوش و غضب کے اندازے کے ساتھ کشتی کے مضبوط اور مستحکم ہونے کا بھی اندازہ ہوتا ہے۔ ¤ ➋ { وَ نَادٰى نُوْحُ اِبْنَهٗ … :} باپ کی شفقت دیکھیے کتنے پیار سے {’’يٰبُنَيَّ ‘‘} (اے میرے چھوٹے سے بیٹے! یا اے میرے پیارے بیٹے!) کہہ کر کشتی میں سوار ہونے کی دعوت دے رہے ہیں۔ ¤ ➌ {وَ لَا تَكُنْ مَّعَ الْكٰفِرِيْنَ :} اس سے معلوم ہوا کہ اس بیٹے کی بربادی کا باعث کافروں کی مجلس اور ان کے ساتھ رہنا تھا، اگر وہ نوح علیہ السلام کی صحبت میں رہتا تو کفار کے ہتھے نہ چڑھتا۔ اتنے بڑے سیلاب کے وقت بھی وہ غرق ہو گیا مگر اس نے نوح علیہ السلام کے پاس آنا گوارا نہیں کیا۔ شیخ سعدی لکھتے ہیں: ¤ پسر نوح بابداں بہ نشست ¤ خاندانِ نبوتش گم شدہ ¤ ’’نوح علیہ السلام کا بیٹا بروں کے ساتھ بیٹھا تو اس سے نبوت کا خاندان ہی گم ہو گیا (وہ خاندان نبوت کا فرد ہی نہ رہا)۔‘‘"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ {قَالَ سَاٰوِيْۤ اِلٰى جَبَلٍ يَّعْصِمُنِيْ مِنَ الْمَآءِ :} معلوم ہوا کہ مشرک کی نظر اسباب تک ہی رہتی ہے اور مشکل سے مشکل وقت میں بھی اسباب کے پیدا کرنے والے کی طرف نہیں جاتی۔ ’’مجھے پہاڑ پانی سے بچا لے گا‘‘ کم عقل ایک بے اختیار پہاڑ کو بچانے والا سمجھ رہا ہے۔ ¤ ➋ {قَالَ لَا عَاصِمَ الْيَوْمَ مِنْ اَمْرِ اللّٰهِ اِلَّا مَنْ رَّحِمَ :} اس کا جو ترجمہ لکھا گیا ہے اس میں کچھ الفاظ محذوف شامل کیے جائیں تو مطلب درست ہوتا ہے، یعنی ’’آج اللہ کے فیصلے سے کوئی بچانے والا نہیں مگر جس پر وہ رحم کرے (وہی بچے گا)۔‘‘ بعض حضرات نے فرمایا کہ فاعل کا وزن بعض اوقات نسبت کے معنی میں بھی آتا ہے، جیسا کہ{’’لَابِنٌ‘‘} لبن(دودھ) والا اور {’’ تَامِرٌ ‘‘} تمر(کھجور) والا، اسی طرح یہاں{ ’’ عَاصِمَ ‘‘} نسبت کے معنی میں استعمال ہوا ہے، یعنی آج بچاؤ رکھنے والا کوئی نہیں، مگر جس پر وہ (اللہ) رحم کرے۔ ہمارے استاذ شیخ محمد عبدہ رحمہ اللہ لکھتے ہیں : ’’یا دوسرا ترجمہ یہ ہو سکتا ہے کہ آج اللہ کے عذاب سے کوئی بچانے والا نہیں ہے، مگر جو رحم کرنے والا ہے (یعنی خود اللہ تعالیٰ)۔‘‘ آیت میں یہ ایک وجہ ہے جو محققین نے ذکر کی ہے اور یہی اقویٰ (زیادہ مضبوط) ہے، کیونکہ فاعل کا صیغہ زیادہ تر صفت کے لیے آتا ہے، نسبت کے لیے کم استعمال ہوتا ہے۔ (روح المعانی) ¤ ➌ {وَ حَالَ بَيْنَهُمَا الْمَوْجُ فَكَانَ مِنَ الْمُغْرَقِيْنَ :} نوح علیہ السلام اور ان کے بیٹے کی بات جاری تھی کہ پانی کی موج دونوں کے درمیان حائل ہو گئی اور وہ اپنے ساتھیوں سے جا ملا، جو غرق کیے جا چکے تھے۔ اس سے ایک تو اس موج کی غیرت ایمانی ظاہر ہو رہی ہے کہ وہ موحد باپ کے سامنے مشرک بیٹے کی بک بک کو زیادہ دیر تک برداشت نہ کر سکی، دوسرا یہ کہ آخرت میں آدمی انھی کا ساتھی ہو گا جن کا وہ دنیا میں ساتھی تھا۔ {’’ فَغَرِقَ ‘‘} (پس وہ غرق ہو گیا) اور {’’ فَكَانَ مِنَ الْمُغْرَقِيْنَ ‘‘} (پس وہ غرق کیے گئے لوگوں میں سے ہو گیا) دونوں میں یہی فرق ہے، اس لیے اپنے بچوں کو جس قدر ہو سکے بری صحبت سے محفوظ رکھنا چاہیے۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ {وَ قِيْلَ يٰۤاَرْضُ ابْلَعِيْ مَآءَكِ …: ’’ بَلَعَ يَبْلَعُ ‘‘} (ف) نگلنے کو کہتے ہیں اور انسان یا کوئی بھی جانور عموماً پورا لقمہ اکٹھا ہی نگلتا ہے۔ یہ لفظ استعمال کرنے میں حکمت یہ معلوم ہوتی ہے کہ زمین نے پانی آہستہ آہستہ نہیں بلکہ ایک ہی دفعہ لقمے کی طرح اپنے اندر نگل لیا تھا۔ ادھر آسمان کو حکم ہوا کہ تھم جا، چنانچہ بارش رک گئی۔ سارا پانی زمین کے نیچے اتار دیا گیا اور تمام مشرکوں کو نیست و نابود کرنے کا کام، جس کے لیے طوفان آیا تھا، پورا ہو گیا۔ ¤ ➋ {وَ اسْتَوَتْ عَلَى الْجُوْدِيِّ :} جودی پہاڑ عراق اور ترکی کے درمیانی علاقے میں (جسے کردستان کہتے ہیں) موصل کی جانب واقع ہے۔ تورات میں نوح علیہ السلام کی کشتی ٹھہرنے کی جگہ ’’ارارات‘‘ بتائی گئی ہے، جو ارمینیا کے پہاڑی سلسلے کا نام ہے اور آج بھی اسی نام سے مشہور ہے۔ چند سال ہوئے مغربی سیاحوں نے اس پہاڑ پر ایک بڑی کشتی کے ٹوٹے ہوئے تختے بھی دریافت کیے ہیں، اگرچہ ان کے متعلق قطعی طور پر نہیں کہا جا سکتا کہ آیا یہ نوح علیہ السلام کی کشتی ہی کے تختے ہیں یا کسی اور کشتی کے۔ واضح رہے کہ نوح علیہ السلام کی قوم دجلہ اور فرات کی وادی ہی میں آباد تھی، جو بعد میں عراق کے نام سے مشہور ہوئی۔ ¤ ➌ { وَ قِيْلَ بُعْدًا لِّلْقَوْمِ الظّٰلِمِيْنَ : ’’ بُعْدًا ‘‘} کا لفظ دوری، ہلاکت اور لعنت کے معنی میں آتا ہے، مطلب یہ ہے کہ وہ سب ظالم ہلاک کر دیے گئے۔ بائبل (پیدائش : ۱۸ :۲۴) کے بیان پر عام خیال یہی ہے کہ یہ طوفان روئے زمین میں آیا تھا، مگر بعض علماء کا کہنا ہے کہ طوفان اسی علاقے میں آیا تھا جہاں نوح علیہ السلام کی قوم آباد تھی۔ گو قرآن و حدیث میں اس کی کوئی تصریح نہیں ہے، لیکن یہ عین ممکن ہے کہ طوفان کے زمانے میں دنیا میں دجلہ و فرات کی وادی کے علاوہ کسی اور جگہ آبادی ہی نہ ہو۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45){وَ نَادٰى نُوْحٌ رَّبَّهٗ … : } تمام کفار کے غرق ہونے کے بعد باپ کی شفقت نے جوش مارا تو نوح علیہ السلام نے بیٹے کے بارے میں دعا کی۔ اللہ تعالیٰ کا وعدہ نوح علیہ السلام کے اہل کو بچانے کا تھا، اس وعدے کے حوالے سے درخواست کی۔ وہ اہل سے نسبی اور رشتہ داری کے گھر والے سمجھ بیٹھے، جب کہ کافر اور مومن کے درمیان دوستی کا رشتہ باقی نہیں رہتا۔ ایمان لانے کے بعد سب مومن دوست اور سب کافر دشمن بن جاتے ہیں۔ دیکھیے سورۂ ممتحنہ (۴) بہرحال نوح علیہ السلام نے ادب ملحوظ رکھا اور صریح الفاظ میں بیٹے کو بچانے کی بات نہیں کی۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { قَالَ يٰنُوْحُ اِنَّهٗ لَيْسَ مِنْ اَهْلِكَ:} فرمایا اے نوح! یہ تیرے اہل میں سے نہیں،بلکہ {’’ اِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ ‘‘} کے تحت کفر کی وجہ سے تمھارا اہل ہونے کے شرف سے محروم ہے اور ان لوگوں میں شامل ہو گیا ہے جن کے غرق کیے جانے کا پہلے فیصلہ ہو چکا ہے۔ ¤ ➋ {اِنَّهٗ عَمَلٌ غَيْرُ صَالِحٍ :} عام طور پر اس کا ترجمہ کیا جاتا ہے ’’اس کے عمل اچھے نہیں ہیں۔‘‘ یہ معنی اس صورت میں درست ہو سکتا ہے کہ{ ’’ عَمَلٌ ‘‘} مصدر کو مبالغہ کے لیے اسم فاعل ( {عَامِلٌ} ) کے معنی میں مانا جائے، جیسے :{ ’’ زَيْدٌ عَدْلٌ ‘‘} کو {’’ زَيْدٌ عَادِلٌ ‘‘} کے معنی میں لیا جاتا ہے، یعنی یہ غیر صالح عمل کرنے والا ہے۔ مگر امام المفسرین طبری رحمہ اللہ کے مطابق{ ’’ اِنَّهٗ ‘‘} کی ضمیر نوح علیہ السلام کی دعا کی طر ف جاتی ہے کہ آپ نے اپنے مشرک بیٹے کے حق میں جو سفارش کی ہے، یہ کام اچھا نہیں ہے۔ ¤ ➌ { فَلَا تَسْـَٔلْنِ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ :} یہاں ایک سوال پیدا ہوتا ہے کہ سوال تو اسی چیز کا ہوتا ہے جس کا علم نہ ہو، جس چیز کا علم ہو اس کے سوال کی تو ضرورت ہی نہیں ہوتی۔ اس کے دو جواب ہیں، دراصل عربی میں سوال کا لفظ مانگنے کے معنی میں بھی آتا ہے اور پوچھنے کے بارے میں بھی۔ سو پہلا جو اب یہ ہے کہ صرف وہی چیز مانگنی چاہیے جس کے متعلق اچھی طرح معلوم ہو کہ جس سے مانگ رہے ہیں وہ یہ چیز مانگنے پر ناراض نہیں ہو گا۔ جس کے متعلق یہ علم نہ ہو بلکہ اس کے ناراض ہونے کا بھی خطرہ ہو، وہ ہرگز نہیں مانگنی چاہیے۔ اب نوح علیہ السلام کے سامنے اللہ تعالیٰ کے وہ فرمان موجود تھے : «{ وَ لَا تُخَاطِبْنِيْ فِي الَّذِيْنَ ظَلَمُوْا }» اور «{ وَ اَهْلَكَ اِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ }» پھر بھی انھیں اس کا علم نہیں ہو سکا کہ اس درخواست پر اللہ تعالیٰ کس قدر ناراض ہوں گے۔ دوسرا جواب یہ ہے کہ اللہ تعالیٰ نے نوح علیہ السلام کی درخواست کا جواب تو {’’ اِنَّهٗ لَيْسَ مِنْ اَهْلِكَ ‘‘} کہہ کر دے دیا تھا، اب اس سے آگے امکان تھا کہ نوح علیہ السلام بیٹے کے نجات نہ پانے اور کفر پر مستحکم رہنے کے متعلق سوال کرتے کہ اس میں کیا حکمت ہے؟ تو اللہ تعالیٰ نے پہلے ہی اس سے روک دیا کہ میری حکمتوں تک تمھارے علم کی رسائی نہیں ہو سکتی، اس لیے مجھ سے ایسی بات مت پوچھنا۔ (الوسیط للطنطاوی) یعنی پوچھنی بھی وہی بات چاہیے جس کے متعلق علم ہو کہ جس سے پوچھ رہے ہیں وہ اس سوال پر ناراض نہیں ہو گا۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’آدمی پوچھتا وہی ہے جو معلوم نہ ہو، لیکن مرضی معلوم ہونی چاہیے۔ یہ کام ہے جاہل کا کہ اگلے کی مرضی نہ دیکھے پوچھنے کی، پھر پوچھے۔‘‘ (موضح) ¤ ➍ { اِنِّيْۤ اَعِظُكَ اَنْ تَكُوْنَ مِنَ الْجٰهِلِيْنَ:} مطلب یہ ہے کہ اس حقیقت کو جاننے کے بعد اگر ایسا سوال کرو گے تو جاہل بن کر رہ جاؤ گے۔ (روح المعانی)"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) {قَالَ رَبِّ اِنِّيْۤ اَعُوْذُ بِكَ اَنْ اَسْـَٔلَكَ مَا لَيْسَ لِيْ بِهٖ عِلْمٌ …:} نوح علیہ السلام شاید پدری محبت کی وجہ سے یہ سمجھ بیٹھے کہ بیٹا چاہے کافر ہو، گھر والوں میں شامل ہے اور اس کے لیے دعا کی جا سکتی ہے، لیکن جوں ہی اللہ تعالیٰ نے انھیں تنبیہ کی کہ ایک کافر بیٹے کو نسبی قرابت کی بنا پر اپنا اہل سمجھنا صحیح نہیں ہے تو وہ فوراً متنبہ ہوئے اور اللہ کے حضور اپنی غلطی پر معافی مانگی۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’نوح علیہ السلام نے توبہ کی، لیکن یہ نہ کہا کہ پھر ایسا نہ کروں گا کہ اس میں دعویٰ نکلتا ہے، بندے کو کیا مقدور ہے! اسی کی پناہ مانگے کہ مجھ سے پھریہ نہ ہو۔‘‘ (موضح)"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ { قِيْلَ يٰنُوْحُ اهْبِطْ بِسَلٰمٍ مِّنَّا وَ بَرَكٰتٍ عَلَيْكَ:} یعنی ہماری طرف سے اپنے آپ پر اور اپنے ساتھ والے لوگوں پر سلامتی اور بے شمار برکتیں لے کر کشتی سے زمین پر اترو۔ ¤ ➋ { وَ عَلٰۤى اُمَمٍ مِّمَّنْ مَّعَكَ:} یعنی ان تمام مومنوں پر جو قیامت تک تمھاری اور تمھارے ساتھ والوں کی نسل سے پیدا ہوں گے، لیکن ان ساتھ والوں سے نسل صرف نوح علیہ السلام کے بیٹوں کی چلی، جیسا کہ فرمایا : «{ وَ جَعَلْنَا ذُرِّيَّتَهٗ هُمُ الْبٰقِيْنَ }» [الصافآت : ۷۷ ] ’’اور ہم نے اس کی اولاد ہی کو باقی رہنے والے بنا دیا۔‘‘ ¤ ➌ { وَ اُمَمٌ سَنُمَتِّعُهُمْ ثُمَّ يَمَسُّهُمْ …:} حق تعالیٰ نے تسلی فرما دی کہ اس کے بعد ساری نوع انسانیت پر ہلاکت نہیں آئے گی، ہاں بعض فرقے ہلاک ہوں گے۔ (موضح) ہلاک ہونے والے فرقوں سے مراد وہ تمام کافر ہیں جو نوح علیہ السلام کی نسل سے پیدا ہوئے یا قیامت تک پیدا ہوں گے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { تِلْكَ مِنْ اَنْۢبَآءِ الْغَيْبِ … :} اس آیت سے معلوم ہوا کہ نبی کریم صلی اللہ علیہ وسلم شروع ہی سے سب کچھ نہیں جانتے تھے، نہ آپ غیب دان تھے، ورنہ وحی کی کوئی ضرورت نہ تھی۔ بعض لوگ ان تمام آیات کی تاویل کرتے ہیں جن میں ہے کہ اے نبی! یہ غیب کی خبریں ہیں، ہم آپ کو سنا رہے ہیں، آپ نہ اس وقت وہاں تھے نہ آپ کو یہ باتیں معلوم تھیں، یہ ہم نے آپ کو وحی کے ذریعے بتائی ہیں۔ جو لوگ نبی صلی اللہ علیہ وسلم کو بھی عالم الغیب کہتے ہیں وہ اس قسم کی آیات ’’یہ غیب کی خبریں ہیں، اس سے پہلے آپ ان کو نہیں جانتے تھے‘‘ کی تحریف کرتے ہوئے کہتے ہیں کہ یہ خطاب دراصل امت کے لوگوں کو ہے کہ اے امت محمد کے لوگو! تم یہ باتیں نہیں جانتے تھے، مگر ہماری اس زیر تفسیر آیت نے ان لوگوں کی اس تحریف کو واضح طور پر باطل ثابت کر دیا، کیونکہ اللہ تعالیٰ نے فرمایا : ’’یہ غیب کی خبروں سے ہے جنھیں ہم تیری طرف وحی کرتے ہیں، اس سے پہلے نہ تو انھیں جانتا تھا اور نہ تیری قوم۔‘‘ معلوم ہوا کہ ان تمام آیات سے بھی یہی مراد ہے کہ صرف قوم ہی نہیں خود رسول اللہ صلی اللہ علیہ وسلم بھی غیب دان نہیں تھے۔ اگر غیب دان مانیں تو بار بار وحی کی ضرورت ہی نہیں رہتی۔ اسی طرح نوح علیہ السلام کا سارا واقعہ ان کے غیب دان ہونے کی نفی کرتا ہے، ورنہ اگر انھیں پہلے ہی سب کچھ معلوم تھا تو ساڑھے نو سو سال کی محنت، اس دوران میں قوم کی بدتمیزیوں پر صبر، پھر وحی کے مطابق کشتی بنانا، پھر بیٹے کے حق میں دعا کرنا، اللہ تعالیٰ کا ناراض ہونا اور نوح علیہ السلام کا معافی مانگنا، سب کچھ افسانہ ٹھہرتا ہے۔ اسی طرح اگر ابراہیم علیہ السلام کو معلوم تھا کہ آگ مجھے نہیں جلائے گی، اسماعیل علیہ السلام ذبح نہیں ہوں گے، یا سارہ علیھا السلام کا کچھ نہیں بگڑے گا تو پھر ان کی جان و مال اور اولاد و آبرو اللہ کی راہ میں قربان کر دینے کی بات بے معنی ٹھہرتی ہے۔ بدر کی رات رسول اللہ صلی اللہ علیہ وسلم کی آہ و زاری اور افک یعنی عائشہ رضی اللہ عنھا پر بہتان کے موقع پر پریشانی کا کچھ مطلب نہیں بنتا۔ حقیقت یہ ہے کہ اللہ کے سوا کوئی غیب نہیں جانتا۔ رسولوں کو اتنی بات ہی معلوم ہوتی ہے جو وحی کے ذریعے سے انھیں بتائی جاتی ہے۔ ¤ ➋ { فَاصْبِرْاِنَّ الْعَاقِبَةَ لِلْمُتَّقِيْنَ: ’’ عَاقِبَةٌ ‘‘} ایک حالت کے بعد آنے والی حالت، اس پر الف لام آئے تو عموماً اچھا انجام مراد ہوتا ہے، یعنی جس طرح نوح علیہ السلام اور ان کے ساتھیوں کا انجام بخیر رہا اور ان کے تمام مخالفین ہلاک کر دیے گئے، اسی طرح آپ صلی اللہ علیہ وسلم کا انجام بھی دنیا و آخرت دونوں میں بہتر رہے گا اور آپ کے مخالفین دنیا میں بھی ذلیل و برباد ہوں گے اور آخرت میں بھی انھیں دوزخ کی آگ نصیب ہو گی۔ مسلمانوں کی تعداد کا کم ہونا اور مدت دراز تک اسلام کی دعوت کا کامیاب نہ ہونا اس بات کی دلیل نہیں کہ یہ دعوت ناکام ہے، بلکہ مسلسل صبر اور دعوت کے نتیجے میں آخری کامیابی اہل اسلام ہی کو ملے گی، خواہ کچھ نسلیں گزرنے کے بعد ملے۔ کائنات میں اللہ تعالیٰ کے لاتعداد لشکر ہیں، مثلاً آگ، ہوا، پانی، پہاڑ اور بے شمار مخلوق۔ اللہ تعالیٰ ان میں سے کسی کو بھی اشارہ کر دے تو کافروں کا نام و نشان باقی نہیں رہ سکتا۔ کافر یہ نہ سمجھیں کہ مسلمان ہمیشہ مغلوب و مقہور ہی رہیں گے، بلکہ مسلمان اگر صبر و استقامت سے کام لیں اور اپنی ہر مصیبت اور بے بسی کو صرف اللہ کریم کے سامنے پیش کرتے رہیں، جیسا کہ نوح علیہ السلام نے کہا : «{اَنِّيْ مَغْلُوْبٌ فَانْتَصِرْ}» [ القمر : ۱۰ ] ’’بے شک میں مغلوب ہوں سو تو بدلہ لے۔‘‘ تو خواہ ان کی تعداد کتنی ہی کم ہو، جیسا کہ نوح علیہ السلام کی ساڑھے نو سو سال کی دعوت کا حاصل بہت ہی کم آدمی، بارہ(۱۲) یا چالیس(۴۰) یا اسّی(۸۰) آدمی نکلے، مگر نوح علیہ السلام اورر اہل ایمان کی محنت ناکام نہیں ہوئی، بلکہ اللہ تعالیٰ نے اپنی غیبی قوت کے ساتھ دنیا کو تہ وبالا کرکے ان قلیل لوگوں کو ایسی کامیابی عطا فرمائی کہ ان کے دشمنوں کا نام و نشان مٹ گیا اور یہ پوری زمین کے مالک بن گئے۔ بنی اسرائیل، موسیٰ علیہ السلام اور فرعون کا واقعہ پڑھ لیجیے۔ رسول اللہ صلی اللہ علیہ وسلم کے تین سو تیرہ بے سرو سامان ساتھیوں کی ایک ہزار مسلح کفار کے مقابلے میں غیب سے فرشتے بھیج کر ایسی مدد کی کہ وہ دن فیصلہ کن دن بن گیا کہ آئندہ کسے غالب ہو کر رہنا ہے۔ غرض اللہ کا فیصلہ ہے کہ اچھا انجام متقین ہی کا ہے۔ (الوسیط) ¤ ➌ اس آیت میں {’’ تِلْكَ مِنْ اَنْۢبَآءِ الْغَيْبِ ‘‘} سے{ ’’ وَ لَا قَوْمُكَ مِنْ قَبْلِ هٰذَا ‘‘} تک رسول اللہ صلی اللہ علیہ وسلم اور آپ کی امت پر احسان کا ذکر ہے، {’’ فَاصْبِرْ ‘‘} میں نصیحت ہے اور{ ’’ اِنَّ الْعَاقِبَةَ لِلْمُتَّقِيْنَ ‘‘ } میں تسلی اور خوش خبری ہے۔ ¤ ➍ اس واقعہ سے رسول اللہ صلی اللہ علیہ وسلم کی نبوت کا حق ہونا بھی ثابت ہوتا ہے کہ آپ نے اُمّی ہونے کے باوجود نوح علیہ السلام کا واقعہ پورا پورا صحیح سنا دیا جو وحی الٰہی کے بغیر ممکن نہ تھا۔ ¤ ➎ یہ واقعہ اس بات کی دلیل ہے کہ اپنی پوری کوشش کے باوجود اگر کسی صالح آدمی کا بیٹا صالح نہ بن سکے تو باپ اس میں بے قصور ہے۔ نوح علیہ السلام جیسا مہربان اور کامل مربی بھی اگر بیٹے کو راہ راست پر نہ لا سکا تو ہماری تمھاری کیا حیثیت ہے؟ اب اللہ تعالیٰ کی تقدیر اور مشیت پر صبر و رضا کے سوا کوئی چارہ نہیں۔ (قرطبی) ¤ ➏ قرآن مجید واقعات بیان کرتے وقت ان میں سے انھی حصوں کو نمایاں کرتا ہے جن سے کوئی نصیحت اور فائدہ حاصل ہو رہا ہو۔ ان کے وہ حصے جو اس مقصد سے خاص تعلق نہیں رکھتے انھیں چھوڑ دیتا ہے۔ مثلاً نوح علیہ السلام کی وہ کشتی کتنی مدت میں بنی، اس کا طول و عرض کیا تھا، اس میں سوار ہونے والے جانور کیسے جمع کیے گئے، اس میں کتنے کمرے تھے، کشتی کتنے دن پانی میں رہی، ’’جودی‘‘ پر کشتی سے اترنے کے بعد نوح علیہ السلام نے کہاں اقامت اختیار فرمائی اور طوفان کتنے دن زمین پر برپا رہا۔ رہے وہ قصے کہانیاں جو عام مشہور ہیں، وہ اکثر اسرائیلیات ہیں، جن کی شرع یا عقل سے تائید نہیں ہوتی۔ ¤ ➐ ایک مسئلہ جس پر بہت سے علماء نے بحث کی ہے، یہ بھی ہے کہ طوفان ساری زمین پر آیا تھا یا کچھ حصے پر؟ تفسیر المنار کے مصنف نے اپنے استاد شیخ محمد عبدہ مصری کا فتویٰ نقل کیا ہے، جس کا خلاصہ یہ ہے کہ قرآن کریم اور احادیث کے ظاہر الفاظ سے یہی معلوم ہوتا ہے کہ یہ طوفان نوح علیہ السلام کی پوری قوم پر آیا تھا اور ان کے علاوہ اس وقت پوری زمین پر کوئی اور آباد نہ تھا، اس لیے یہ عقیدہ رکھنا ضروری ہے، مگر اس سے یہ لازم نہیں آتا کہ طوفان پوری زمین پر آیا تھا، کیونکہ اس بات کی کوئی دلیل نہیں کہ پوری زمین قوم نوح سے بھری ہوئی تھی۔ یہ تاریخی مسائل قرآن کے مقاصد میں سے نہیں، اس لیے اللہ تعالیٰ نے صریح الفاظ میں کوئی وضاحت نہیں فرمائی۔ اس لیے ہم کہتے ہیں، قرآن کے ظاہر کا تقاضا یہی ہے جو اوپر بیان ہوا، اب اگر کسی علمی تحقیق سے اس کے خلاف کوئی بات ثابت ہو جائے تو اس سے قرآن و حدیث کی کسی قطعی و صریح بات پر کوئی حرف نہیں آتا۔ (الوسیط)"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ {وَ اِلٰى عَادٍ اَخَاهُمْ هُوْدًا قَالَ يٰقَوْمِ …: ’’ هُوْدًا ‘‘} عطف بیان ہے{’’ اَخَاهُمْ ‘‘} سے۔ تشریح کے لیے دیکھیے سورۂ اعراف (۶۵) اے مشرکو! اے کافرو! کے بجائے {’’ يٰقَوْمِ ‘‘} (اے میری قوم !)سے مخاطب کرنے سے ان کے ساتھ اپنا تعلق اور خیر خواہی ظاہر کرنا مقصود ہے۔ ¤ ➋ {اِنْ اَنْتُمْ اِلَّا مُفْتَرُوْنَ : ’’ مُفْتَرُوْنَ ‘‘ ’’ فَرَي‘‘} سے باب افتعال ({اِفْتِرَاءٌ} ) کا اسم فاعل جمع مذکر کا صیغہ ہے۔ افترا یعنی جان بوجھ کر ایسا جھوٹ بولنا جس کے متعلق بولنے والے کو بھی معلوم ہو کہ یہ صاف جھوٹ ہے، یعنی اللہ کے سوا عبادت کے لائق کوئی ہے ہی نہیں، تمھارا کسی غیر کو معبود بنانا محض افترا ہے۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ {يٰقَوْمِ لَاۤ اَسْـَٔلُكُمْ عَلَيْهِ اَجْرًا …: ’’ فَطَرَ ‘‘ } کا اصل معنی پھاڑنا ہے، جیسا کہ فرمایا : «{ اِذَا السَّمَآءُ انْفَطَرَتْ }» [الانفطار : ۱ ] ’’اور جب آسمان پھٹ جائے گا۔‘‘ {’’ فَطَرَنِيْ ‘‘} سے مراد مجھے کسی گزشتہ نمونے کے بغیر پیدا فرمایا۔ ¤ ➋ { اَفَلَا تَعْقِلُوْنَ:} تو کیا تم سمجھتے نہیں کہ جو شخص سچے دل سے دعوت وتبلیغ اور نصیحت کی مشقت اٹھا رہا ہے اور جسے صرف اپنے رب سے اجر لینا ہے، وہ تم سے کوئی اجرت یا دنیوی فائدہ کیوں چاہے گا؟"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ {وَ يٰقَوْمِ اسْتَغْفِرُوْا رَبَّكُمْ …: ’’ السَّمَآءَ ‘‘} آسمان کے علاوہ ہر بلند چیز کو بھی {’’سَمَاءٌ‘‘} کہہ لیتے ہیں، کیونکہ {’’ سَمَا يَسْمُوْ‘‘ } کا معنی بلند ہونا ہے، یہاں {’’ السَّمَآءَ ‘‘} سے مراد بادل یا بارش ہے۔ {’’ مِدْرَارًا ‘‘} یہ {’’دَرٌّ‘‘ } سے مبالغے کا صیغہ ہے، جس کا معنی دودھ کا بہنا اور زیادہ ہونا ہے، پھر بہت برسنے والی بارش کے لیے بطور استعارہ استعمال ہونے لگا۔ {’’ دَرَّتِ السَّمَاءُ بِالْمَطَرِ دَرًّا، وَ تَدِرُّ دَرًّا ‘‘} جب آسمان سے بارش بہت برسے۔ ان آیات سے اور دوسرے مقامات مثلاً الاحقاف(۲۴) سے معلوم ہوتا ہے کہ ان کے فخر و غرور اور اپنے رسول ہود علیہ السلام کو جھٹلانے کی وجہ سے کافی عرصہ تک ان سے بارش روک لی گئی، جس کے نتیجے میں قحط کی وجہ سے ہر طرف دھول اڑنے لگی اور باوجود زبردست جسمانی ڈیل ڈول اور قوت کے سب لوگوں میں کمزوری نمایاں ہونے لگی تو ہود علیہ السلام نے انھیں سمجھایا کہ سب سے پہلے تو تم نے اللہ تعالیٰ کے ساتھ جو شرک اور اس کی نافرمانی کی ہے، اس کی معافی مانگو۔ بہت سے مفسرین نے یہاں{ ’’ اسْتَغْفِرُوْا رَبَّكُمْ ‘‘ } سے شرک چھوڑ کر ایک اللہ پر ایمان لانا مراد لیا ہے۔ {’’ ثُمَّ تُوْبُوْۤا اِلَيْهِ ‘‘} پھر اس کی طرف پلٹ آؤ، یعنی آئندہ اس کی ہر نافرمانی ترک کرنے اور ہر حکم بجا لانے کا پختہ عزم کرو، تو اس کے نتیجے میں اللہ تعالیٰ تم پر ایسا بادل بھیجے گا جو خوب برسنے والا ہو گا اور تمھاری قوت کی کمی دور کرکے پہلے سے بھی زیادہ قوت عطا فرمائے گا۔ معلوم ہوا کہ استغفار اور توبہ سے قحط دور ہوتا ہے اور جسمانی، ذہنی اور مالی ہر قسم کی قوت میں اضافہ ہوتا ہے۔ مزید فوائد کے لیے دیکھیے سورۂ ہود (۳) اور سورۂ نوح (۱۰ تا ۱۲)۔ ¤ ➋ {وَ لَا تَتَوَلَّوْا مُجْرِمِيْنَ :} یعنی میری اطاعت سے منہ نہ موڑو، ورنہ تم مجرم قرار پاؤ گے۔ ¤ ➌ یہاں تک ہود علیہ السلام نے اپنی قوم کو اللہ تعالیٰ کا پیغام پہنچا دیا اور اس مختصر سی تقریر میں تین دفعہ انھیں ’’اے میری قوم!‘‘ کہہ کر پکارا، تاکہ شاید قرابت کے واسطے ہی سے ان کے دلوں تک رسائی حاصل کر سکیں۔ کیونکہ ہود علیہ السلام اسی قبیلے کے فرد ہو کر انھی کی بدخواہی نہیں کر سکتے تھے۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ {قَالُوْا يٰهُوْدُ مَا جِئْتَنَا بِبَيِّنَةٍ …:} یہ بات یقینی ہے کہ ہر پیغمبر اللہ کی طرف سے ایسے واضح دلائل اور یقینی آیات اور نشانیاں لے کر آتا ہے کہ سننے اور دیکھنے والوں کو اس کے نبی ہونے میں کوئی شک نہیں رہتا، مگر یہ سب کچھ انھی کے لیے کار آمد ہوتا ہے جو دل کے کانوں اور آنکھوں سے سنتے اور دیکھتے ہیں۔ لیکن جب کوئی شخص یا قوم ضد اور عناد کی وجہ سے یہ طے کر لے کہ ہم نے ماننا ہی نہیں تو انھیں لاکھ دلیل سامنے ہونے کے باوجود ایک بھی نظر نہیں آتی اور ان کی حالت وہ ہو جاتی ہے جو اللہ تعالیٰ نے سورۂ بقرہ (۶، ۷) میں بیان فرمائی ہے ۔ ¤ ➋ یہاں چار جملوں میں ہود علیہ السلام کی قوم نے سخت ترین لفظوں میں انھیں جھٹلا کر ان پر ایمان لانے سے صاف انکار کر دیا۔ پہلے جملے میں ان پر نبوت کی ایک بھی دلیل پیش نہ کرنے کا بہتان لگایا۔ دوسرے اور تیسرے جملے میں {’’ مَا ‘‘} نافیہ کی تاکید باء کے ساتھ کرکے کچھ بھی ہو جائے اپنے معبودوں کو چھوڑنے اور ہود علیہ السلام پر ایمان لانے سے انکار کر دیا۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 55،54) ➊ { اِنْ نَّقُوْلُ اِلَّا اعْتَرٰىكَ بَعْضُ اٰلِهَتِنَا بِسُوْٓءٍ: } یہ چوتھی بات ہے جو انھوں نے ہود علیہ السلام کو جھٹلانے کے ساتھ مزید توہین اور مذاق کے لیے کہی۔ {’’عَرَا يَعْرُوْ ‘‘} اور {’’اِعْتَرٰي يَعْتَرِيْ‘‘} پیش آنا، پہنچنا، باء کے ساتھ متعدی ہو کر پہنچانا کے معنی میں ہو گیا، یعنی ہمارے کسی ایک آدھ معبود نے تجھے کوئی آفت پہنچا دی ہے، جو ایسی بہکی بہکی باتیں کر رہا ہے، اگر سب کی مار پڑ جاتی تو معلوم نہیں تیرا کیا بنتا۔ افسوس! یہی کسی بزرگ کی مار کا تصور آج مسلمانوں میں بھی آگیا ہے، حالانکہ مسلمانوں کا عقیدہ یہ ہونا چاہیے کہ اللہ کے سوا کوئی زندہ یا مردہ ہستی کسی کا کچھ نہ بگاڑ سکتی ہے نہ بنا سکتی ہے۔ ¤ ➋ { قَالَ اِنِّيْۤ اُشْهِدُ اللّٰهَ … :} یعنی میرا تمھارے ان بتوں سے اور اللہ کے سوا کسی معبود سے کوئی تعلق نہیں، بلکہ میں ہر آن ان کا انکار اور ان سے اظہار براء ت کرتا ہوں۔ ¤ ➌ {فَكِيْدُوْنِيْ جَمِيْعًا ثُمَّ لَا تُنْظِرُوْنِ :} یعنی یہ جو تم کہتے ہو کہ تم پر ہمارے کسی معبود کی مار پڑ گئی ہے تو ایک آدھ کے بجائے اگر تم اور تمھارے یہ سب معبود مل کر بھی میرا کچھ بگاڑ سکتے ہیں تو بگاڑ لیں اور مجھے ذرا مہلت نہ دیں، ورنہ جان لو کہ تم بھی جھوٹے اور تمھارے یہ معبود بھی غلط۔ ¤ ہود علیہ السلام کا یہ کلام ان کی قوم کی دوسری فضول باتوں کے علاوہ اس بات کا بھی جواب ہے کہ تو ہمارے پاس کوئی واضح دلیل، یعنی معجزہ نہیں لایا۔ معجزہ اور نشانی کیا چیز ہے؟ حقیقت یہ ہے کہ ہر معجزہ کی روح وہ چیلنج ہوتا ہے جو صاحب معجزہ کی طرف سے ہوتا ہے۔ مثلاً صالح علیہ السلام کی اونٹنی، ابراہیم علیہ السلام کا معجزہ ان کے لیے آگ کا گلزار بن جانا، مگر یہ معجزہ بھی کیا کم ہے کہ اکیلا شخص پوری قوم کو للکار رہا ہے کہ میں تم سب کو اور تمھارے خداؤں کو کچھ نہیں سمجھتا۔ تم سب مل کر میرا جو بگاڑ سکتے ہو بگاڑ لو اور اس قوم کو للکار رہا ہے جو نہایت سخت گیر اور رحم سے نا آشنا تھے، جن کے بارے میں آتا ہے : «{وَ اِذَا بَطَشْتُمْ بَطَشْتُمْ جَبَّارِيْنَ }» [ الشعراء:۱۳۰] ’’اور جب تم پکڑتے ہو تو بہت بے رحم ہو کر پکڑتے ہو۔‘‘ خود اللہ تعالیٰ نے فرمایا کہ وہ اتنی قوت والے تھے کہ ان کے بعد ویسی قوم پیدا ہی نہیں کی گئی، فرمایا : «{ الَّتِيْ لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ }» [ الفجر : ۸] ’’وہ کہ ان جیسا کوئی شہروں میں پیدا نہیں کیا گیا۔‘‘ جب طوفان سے ہلاک ہوئے تو : «{ كَاَنَّهُمْ اَعْجَازُ نَخْلٍ خَاوِيَةٍ }» [ الحاقۃ : ۷ ] ’’گویا وہ گری ہوئی کھجوروں کے تنے تھے۔‘‘ صرف ایک شخص پوری قوم کو للکار رہا ہے، جو اس کے خون کی پیاسی ہے، جس کے معبودوں کو اور پوری قوم کو اس نے جاہل قرار دیا ہے اور کہا ہے کہ سب مل کر میرے خلاف جو کچھ کرسکتے ہو کر لو اور پوری قوم باتیں تو بناتی ہے، مگر اس کا کچھ بگاڑ نہ سکی، یہ کھلا معجزہ نہیں تو کیا ہے؟"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55،54) ➊ { اِنْ نَّقُوْلُ اِلَّا اعْتَرٰىكَ بَعْضُ اٰلِهَتِنَا بِسُوْٓءٍ: } یہ چوتھی بات ہے جو انھوں نے ہود علیہ السلام کو جھٹلانے کے ساتھ مزید توہین اور مذاق کے لیے کہی۔ {’’عَرَا يَعْرُوْ ‘‘} اور {’’اِعْتَرٰي يَعْتَرِيْ‘‘} پیش آنا، پہنچنا، باء کے ساتھ متعدی ہو کر پہنچانا کے معنی میں ہو گیا، یعنی ہمارے کسی ایک آدھ معبود نے تجھے کوئی آفت پہنچا دی ہے، جو ایسی بہکی بہکی باتیں کر رہا ہے، اگر سب کی مار پڑ جاتی تو معلوم نہیں تیرا کیا بنتا۔ افسوس! یہی کسی بزرگ کی مار کا تصور آج مسلمانوں میں بھی آگیا ہے، حالانکہ مسلمانوں کا عقیدہ یہ ہونا چاہیے کہ اللہ کے سوا کوئی زندہ یا مردہ ہستی کسی کا کچھ نہ بگاڑ سکتی ہے نہ بنا سکتی ہے۔ ¤ ➋ { قَالَ اِنِّيْۤ اُشْهِدُ اللّٰهَ … :} یعنی میرا تمھارے ان بتوں سے اور اللہ کے سوا کسی معبود سے کوئی تعلق نہیں، بلکہ میں ہر آن ان کا انکار اور ان سے اظہار براء ت کرتا ہوں۔ ¤ ➌ {فَكِيْدُوْنِيْ جَمِيْعًا ثُمَّ لَا تُنْظِرُوْنِ :} یعنی یہ جو تم کہتے ہو کہ تم پر ہمارے کسی معبود کی مار پڑ گئی ہے تو ایک آدھ کے بجائے اگر تم اور تمھارے یہ سب معبود مل کر بھی میرا کچھ بگاڑ سکتے ہیں تو بگاڑ لیں اور مجھے ذرا مہلت نہ دیں، ورنہ جان لو کہ تم بھی جھوٹے اور تمھارے یہ معبود بھی غلط۔ ¤ ہود علیہ السلام کا یہ کلام ان کی قوم کی دوسری فضول باتوں کے علاوہ اس بات کا بھی جواب ہے کہ تو ہمارے پاس کوئی واضح دلیل، یعنی معجزہ نہیں لایا۔ معجزہ اور نشانی کیا چیز ہے؟ حقیقت یہ ہے کہ ہر معجزہ کی روح وہ چیلنج ہوتا ہے جو صاحب معجزہ کی طرف سے ہوتا ہے۔ مثلاً صالح علیہ السلام کی اونٹنی، ابراہیم علیہ السلام کا معجزہ ان کے لیے آگ کا گلزار بن جانا، مگر یہ معجزہ بھی کیا کم ہے کہ اکیلا شخص پوری قوم کو للکار رہا ہے کہ میں تم سب کو اور تمھارے خداؤں کو کچھ نہیں سمجھتا۔ تم سب مل کر میرا جو بگاڑ سکتے ہو بگاڑ لو اور اس قوم کو للکار رہا ہے جو نہایت سخت گیر اور رحم سے نا آشنا تھے، جن کے بارے میں آتا ہے : «{وَ اِذَا بَطَشْتُمْ بَطَشْتُمْ جَبَّارِيْنَ }» [ الشعراء:۱۳۰] ’’اور جب تم پکڑتے ہو تو بہت بے رحم ہو کر پکڑتے ہو۔‘‘ خود اللہ تعالیٰ نے فرمایا کہ وہ اتنی قوت والے تھے کہ ان کے بعد ویسی قوم پیدا ہی نہیں کی گئی، فرمایا : «{ الَّتِيْ لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ }» [ الفجر : ۸] ’’وہ کہ ان جیسا کوئی شہروں میں پیدا نہیں کیا گیا۔‘‘ جب طوفان سے ہلاک ہوئے تو : «{ كَاَنَّهُمْ اَعْجَازُ نَخْلٍ خَاوِيَةٍ }» [ الحاقۃ : ۷ ] ’’گویا وہ گری ہوئی کھجوروں کے تنے تھے۔‘‘ صرف ایک شخص پوری قوم کو للکار رہا ہے، جو اس کے خون کی پیاسی ہے، جس کے معبودوں کو اور پوری قوم کو اس نے جاہل قرار دیا ہے اور کہا ہے کہ سب مل کر میرے خلاف جو کچھ کرسکتے ہو کر لو اور پوری قوم باتیں تو بناتی ہے، مگر اس کا کچھ بگاڑ نہ سکی، یہ کھلا معجزہ نہیں تو کیا ہے؟"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ {اِنِّيْ تَوَكَّلْتُ عَلَى اللّٰهِ رَبِّيْ وَ رَبِّكُمْ :} یہ جرأت ہود علیہ السلام میں کیسے پیدا ہوئی؟ وہ خود فرماتے ہیں کہ میرا بھروسا اللہ پر ہے، جو میرا رب ہے اور تمھارا رب ہے۔ ¤ ➋ {مَا مِنْ دَآبَّةٍ اِلَّا هُوَ اٰخِذٌۢ بِنَاصِيَتِهَا: ’’ نَاصِيَةٌ ‘‘} پیشانی کے بالوں کو کہتے ہیں، اگر کسی کو یہاں سے اچھی طرح پکڑ لیا جائے تو وہ ہل نہیں سکتا، بلکہ پوری طرح پکڑنے والے کی گرفت میں ہوتا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ لَنَسْفَعًۢا بِالنَّاصِيَةِ }» [ العلق : ۱۵ ] ’’تو ہم ضرور اسے پیشانی کے بالوں کے ساتھ گھسیٹیں گے۔‘‘ مجرموں کے متعلق فرمایا کہ وہ اپنی علامت کے ساتھ پہچانے جائیں گے : «{ فَيُؤْخَذُ بِالنَّوَاصِيْ وَ الْاَقْدَامِ }» [ الرحمٰن : ۴۱ ] ’’پھر (ان کو) پیشانی کے بالوں اور قدموں سے پکڑا جائے گا۔‘‘ مقصد یہ ہے کہ اللہ تعالیٰ نے شرعی عقیدے اور شرعی احکام میں تمھیں اختیار دیا ہے کہ مانو گے تو انعام پاؤ گے، نہ مانو گے تو مارے جاؤ گے۔ اس پر تم اکڑ گئے اور اپنے آپ کو ہر طرح مرضی کا مالک سمجھ لیا۔ سب سے پہلے تو شرعی احکام پر عمل میں اختیار دینے والے مالک کی غداری کرکے اس کی مخلوق کو اس کے شریک بنا بیٹھے، پھر اس کے احکام کی کھلم کھلا خلاف ورزی کی، اس کے رسول کو جھٹلایا، یہ نہ سوچا کہ تھوڑا سا اختیار رکھنے کے باوجود صرف تم ہی نہیں بلکہ پوری مخلوق مکمل طور پر اس کی گرفت میں ہے اور اس کی پیشانی کے بال اس نے پکڑ رکھے ہیں، وہ اس کی مرضی کے بغیر ہل بھی نہیں سکتے۔ اب تم جس طرح شرعی احکام میں اپنا اختیار غلط استعمال کرتے ہوئے اکڑ کر کہتے ہو، ہم اللہ کو نہیں مانتے، ہمارا داتا فلاں اور دستگیر فلاں ہے، ہم رسول کو نہیں مانتے، ہمارا سائیں مرشد فلاں ہے، اگر واقعی تم ایسے ہی آزاد ہو تو ان احکام پر بھی اکڑ کر دکھاؤ جن میں وہ {’’كُنْ‘‘} کہتا ہے تو وہ فوراً واقع ہو جاتے ہیں۔ جب بیمار ہوتے ہو تو یہ کہہ کر دکھاؤ کہ کوئی ہمیں بیمار نہیں کر سکتا، کوئی ہمیں بوڑھا نہیں کر سکتا، کوئی ہمارے بال سفید نہیں کر سکتا۔ اگر تم اور تمھارے خدا ایسے ہی زبردست ہیں تو اللہ کے حکم سے دل کی حرکت رکنے پر اسے چالو کر کے دکھاؤ۔ اسی طرح موت کے وقت بھی اکڑ جاؤ کہ جاؤ ہم نہیں مرتے۔ یا تمھارے شریک کہیں ہم اپنے بندے کو مرنے نہیں دیں گے۔ معلوم ہوا کہ تم اس تھوڑے سے اختیار کے باوجود مکمل طور پر میرے رب کے مکمل قبضے میں ہو، پھر جب خود اس نے مجھے بھیجا ہے اور وہ میرا پشت پناہ ہے اور اسی پر میرا بھروسا ہے، تو مجھے تمھارا کیا ڈر ہے، جاؤ جو مرضی کر لو۔ ¤ ➌ {اِنَّ رَبِّيْ عَلٰى صِرَاطٍ مُّسْتَقِيْمٍ:} اس کا ایک معنی تو یہ ہے کہ ’’جو سیدھی راہ پر چلے وہ اس سے ملے۔‘‘ (موضح) سورۂ نحل میں فرمایا : «{ وَ عَلَى اللّٰهِ قَصْدُ السَّبِيْلِ وَ مِنْهَا جَآىِٕرٌ }» [ النحل : ۹ ] ’’اور سیدھا راستہ اللہ ہی پر (جا پہنچتا ہے) اور ان میں سے کچھ (راستے) ٹیڑھے ہیں۔‘‘ دوسرا یہ کہ اگرچہ ہر جاندار پر اس کا قبضہ ہے اور وہ اس کے ساتھ جو سلوک کرنا چاہے کر سکتا ہے، مگر وہ صراط مستقیم پر ہے، کسی پر ظلم نہیں کرتا۔ (ابن کثیر)"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) ➊ {فَاِنْ تَوَلَّوْا فَقَدْ اَبْلَغْتُكُمْ مَّاۤ اُرْسِلْتُ بِهٖۤ اِلَيْكُمْ …: ’’ تَووَلَّوْا ‘‘} اصل میں {’’ تَتَوَلَّوْا ‘‘} تھا، لغت عرب میں کسی فعل کے شروع میں اگر دو ’’تاء‘‘ ہوں تو عموماً ایک کو حذف کر دیتے ہیں۔ یعنی رسولوں کے بھیجنے کا مقصد یہ ہے کہ کوئی یہ نہ کہہ سکے کہ مجھ تک اللہ کا پیغام نہیں پہنچا، اس لیے میں معذور ہوں، اب اگر تم نہ مانو تو بے شک نہ مانو، مگر میرا فریضہ پورا ہو گیا اور تمھارا عذر ختم ہو گیا۔ اب اللہ تعالیٰ کا یہ قاعدہ کہ ’’وہ پیغام پہنچائے بغیر عذاب نہیں دیتا‘‘ تمھارے لیے بہانہ نہیں بن سکتا۔ تمھارے نہ ماننے سے اللہ تعالیٰ کو کوئی فرق نہیں پڑتا۔ وہ تمھیں ختم کرکے تمھاری جگہ اور لوگ لے آئے گا اور تم اس کا کچھ نقصان نہ کر سکو گے۔ آگے اس کی مرضی ہے کہ تمھاری جگہ اچھے لوگ لائے، جیسا کہ فرمایا : «{ وَ اِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُوْنُوْۤا اَمْثَالَكُمْ }» [ محمد : ۳۸ ] ’’اور اگر تم پھر جاؤ گے تو وہ تمھاری جگہ تمھارے سوا اور لوگ لے آئے گا، پھر وہ تمھاری طرح نہیں ہوں گے۔‘‘ اور یہ بھی اس کی مرضی ہے کہ چاہے تو مزید برے لوگ لے آئے، جیسا کہ بنی اسرائیل نے جب ارض مقدس میں فساد شروع کیا تو اللہ تعالیٰ نے انھیں سزا دینے کے لیے ان سے بھی برے بندے ان پر مسلط کر دیے۔ دیکھیے سورۂ بنی اسرائیل (۵ تا ۷)۔ ¤ ➋ { اِنَّ رَبِّيْ عَلٰى كُلِّ شَيْءٍ حَفِيْظٌ: } یعنی جس طرح بعض جاہل فلسفی کہتے ہیں کہ اللہ تعالیٰ نے کائنات کو پیدا کیا اور اس کے قوانین بنا دیے، اب وہ ان قوانین کے مطابق خود بخود چل رہی ہے، یہ بات بالکل غلط ہے۔ میرے رب نے کائنات کو پیدا کیا، پھر ’’رب‘‘ کا معنی ہی یہ ہے کہ تربیت اور پرورش بھی وہی کر رہا ہے۔ پھر حفیظ بھی وہی ہے۔ ہر چیز اس کی نگرانی میں چل رہی ہے۔ اس سے ان مشرکوں اور جاہل صوفیوں کا بھی رد ہو گیا جو کہتے ہیں کہ اللہ تعالیٰ نے مخلوق کو پیدا کرکے اس کا انتظام قطبوں، غوثوں اور اس قسم کے خود ساختہ ناموں والے ولیوں اور بزرگوں کے حوالے کر دیا ہے، جو اس کو چلا رہے ہیں اور اس کی نگرانی کر رہے ہیں۔ اللہ تعالیٰ اب فارغ ہے، اختیار اس نے اپنے پیاروں کو دے دیے ہیں۔ اللہ اکبر! پہلی امتوں کے مشرکوں اور ہماری امت کے مشرکوں میں کس قدر مشابہت اور یک رنگی پائی جاتی ہے۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58){وَ لَمَّا جَآءَ اَمْرُنَا نَجَّيْنَا هُوْدًا …:} ہمارے حکم سے مراد عذاب کا حکم ہے، اس کی تفصیل سورۂ احقاف، سورۂ حاقہ، سورۂ قمر اور دوسری سورتوں میں موجود ہے۔ اللہ تعالیٰ نے ان پر شدید ہوا کی تیز و تند اور سرکش آندھی بھیجی، جو ان پر سات راتیں اور آٹھ دن مسلسل چلی اور اس نے کفار میں سے ایک بھی متنفس کو باقی نہ چھوڑا۔ دیکھیے سورۂ حاقہ (۶ تا ۸) یہ تو دنیا کا عذاب تھا، آخرت میں ان کے لیے اس سے بھی سخت عذاب {’’ عَذَابٍ غَلِيْظٍ ‘‘} تیار ہے۔ مگر اللہ تعالیٰ نے ہود علیہ السلام اور ان کے ہمراہ ایمان لانے والوں کو ان دونوں عذابوں سے بچا لیا۔ ¤ یہاں ایک سوال پیدا ہوتا ہے کہ اتنی خوف ناک آندھی جب چلتی ہے تو وہ مومن و کافر ہر ایک پر گزرتی ہے تو ہود علیہ السلام اور ان کے ساتھی کس طرح بچ گئے؟ اسی طرح ثمود پر آنے والی صیحہ (چیخ) سے کافروں کے کان اور دل تو پھٹ گئے مگر صالح علیہ السلام اور ایمان والوں کا کچھ بھی نہ بگڑا۔ اللہ تعالیٰ نے اس کا جواب دیا کہ ہم نے انھیں اپنی عظیم رحمت کے ساتھ بچا لیا۔ {’’ بِرَحْمَةٍ ‘‘} میں تنوین تعظیم کے لیے ہے، پھر جو رحمت اللہ کی طرف سے ہو اس کی عظمت کا کیا ٹھکانا ہے۔ وہ آندھی اور چیخ اللہ کے امر سے کفار پر آئی تھیں، ان کے ساتھ رہنے والے مسلمانوں پر اثر انداز ہونے کا انھیں حکم ہی نہ تھا۔ ا س لیے وہ اللہ تعالیٰ کی عظیم رحمت کے دامن میں محفوظ تھے۔ گروہ در گروہ پرندوں کی کنکریوں سے ابرہہ اور اس کا لشکر کھائے ہوئے بھس کی طرح ہو گیا، مگر مکہ والوں کا کچھ بھی نہ بگڑا۔ دراصل یہ حکم اس قادر مطلق کا تھا، اگر کسی دنیا والے کا ہوتا تو کافر و مومن دونوں پس جاتے، متنبی نے کہا ہے۔ ¤ {تُسَوِّدُ الشَّمْسُ مِنَّا بِيْضَ اَوْجُهِنَا ¤ وَمَا تُسَوِّدُ بِيْضَ الْعَيْنِ وَاللِّمَمٖ ¤ وَكَانَ حَالُهُمَا فِي الْحُكْمِ وَاحِدَةً ¤ لَوِ احْتَكَمْنَا مِنَ الدُّنْيَا إِلٰي حَكَمٖ} ¤ ’’دھوپ ہمارے چہروں کی سفیدی کو سیاہ کر دیتی ہے، جب کہ آنکھ کی سفیدی اور بالوں کی سفیدی کو سیاہ نہیں کرتی۔ حالانکہ اگر ہم دنیا کے کسی منصف کے پاس جائیں تو فیصلے میں دونوں کا حال ایک ہی ہے۔‘‘ ¤ بیماری کے بعد شفا بھی رحمت ہے، مگر بیماری آنے ہی نہ دینا یہ اس سے بھی عظیم رحمت ہے۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) ➊ { وَ تِلْكَ عَادٌ:} اور یہ تھے عاد، اس سے مراد ان کے علاقے بھی ہو سکتے ہیں اور وہ قوم بھی جن کا واقعہ بیان ہوا۔ ¤ ➋ {جَحَدُوْا بِاٰيٰتِ رَبِّهِمْ:’’ جَحَدُوْا ‘‘} کا معنی ہے دلیل سے ثابت شدہ بات کا انکار کردینا۔ آیات سے مراد کائنات میں رب تعالیٰ کی توحید کی بے شمار نشانیاں، ہود علیہ السلام پر نازل ہونے والی آیات اور ان کا تنہا پوری قوم کے سامنے بے خوف ہو کر ڈٹ جانا وغیرہ ہیں۔ غرض اس بدنصیب قوم نے واضح نشانات، معجزات اور آیات سمجھ میں آ جانے کے باوجود انھیں ماننے سے صاف انکار کر دیا۔ ¤ ➌ { عَصَوْا رُسُلَهٗ :} انھوں نے اگرچہ ہود علیہ السلام ہی کی نافرمانی کی، لیکن چونکہ ایک پیغمبر کی نافرمانی تمام پیغمبروں کی نافرمانی ہے، اس لیے فرمایا : ’’انھوں نے اس کے پیغمبروں کی نافرمانی کی۔‘‘ (شوکانی) ¤ ➍ {وَ اتَّبَعُوْۤا اَمْرَ كُلِّ جَبَّارٍ عَنِيْدٍ: ’’ عَنِيْدٍ ‘‘} سخت عناد والا، ہر وہ شخص جو حق قبول نہ کرے اور اس کے ساتھ شدت کے ساتھ اس کی مخالفت بھی کرے، مراد قوم کے سردار ہیں۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) ➊ { وَ اُتْبِعُوْا فِيْ هٰذِهِ الدُّنْيَا لَعْنَةً وَّ يَوْمَ الْقِيٰمَةِ:} لعنت کا معنی ناراض ہو کر دفع دور کر دینا ہے۔ اللہ تعالیٰ کی لعنت سے مراد آخرت میں عذاب اور دنیا میں اپنی رحمت اور توفیق سے محروم کر دینا ہے اور انسان کی طرف سے لعنت کا مطلب اس کے لیے یہ بددعا کرنا ہے۔ (راغب) یعنی دنیا میں آنے والا ہر پیغمبر اور مومن ان کے کفر کی وجہ سے ان پر لعنت کرتا رہے گا اور آخرت میں وہ سب کے سامنے رسوا اور مبتلائے عذاب ہوں گے۔ ¤ ➋ {اَلَاۤ اِنَّ عَادًا كَفَرُوْا رَبَّهُمْ … : ’’ اَلَاۤ ‘‘} کے ساتھ خبردار اس لیے کیا کہ کوئی یہ نہ کہے کہ ان بے چاروں پر زیادتی ہوئی۔ فرمایا، سن لو! یہ لوگ تمام جرائم سے بڑے جرم رب تعالیٰ کے کفر کے مرتکب تھے۔ پھر دوبارہ فرمایا، سن لو! عاد کے لیے ہر قسم کی خیر اور اللہ کی رحمت سے دوری ہے، جو ہود علیہ السلام کی قوم تھے۔ یاد رہے کہ {’’ كَفَرَ‘‘} کے بعد عام طور پر باء آتی ہے، مثلاً {’’ كَفَرُوْا بِرَبِّهِمْ ‘‘} جس کا مطلب رب کی نعمتوں کی ناشکری اور انکار ہوتا ہے۔ باء کے بغیر{ ’’ كَفَرُوْا رَبَّهُمْ ‘‘} کا مطلب یہ ہے کہ قوم عاد نے سرے ہی سے اپنے رب کا انکار کر دیا، جیسے دہریے رب تعالیٰ کو نہیں مانتے۔ {’’ كَفَرُوْا رَبَّهُمْ ‘‘ ’’ كَفَرُوْا بِرَبِّهِمْ ‘‘} سے بھی بڑا جرم ہے۔ بعض مفسرین کے مطابق {’’ كَفَرُوْا رَبَّهُمْ ‘‘} میں یہ بھی ممکن ہے کہ {’’ كَفَرُوْا بِرَبِّهِمْ‘‘ } میں سے تخفیف کے لیے باء حذف کر دی گئی ہو اور دونوں کا معنی ایک ہی ہو۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) ➊ { وَ اِلٰى ثَمُوْدَ اَخَاهُمْ صٰلِحًا :} قوم ثمود مقام حجر (حاء کے کسرہ کے ساتھ) میں رہتے تھے۔ یہ جگہ حجاز اور شام کے درمیان وادی القریٰ تک پھیلی ہوئی ہے۔ آج کل یہ علاقہ مدینہ اور تبوک کے درمیان ہے، جہاں ابھی تک ان لوگوں کے پہاڑوں کے اندر تراش کر بنائے ہوئے مکانات، جن میں وہ رہتے تھے، موجود ہیں اور یہ علاقہ مدائن صالح کہلاتا ہے۔ صالح علیہ السلام کا قبیلہ عرب قبیلہ تھا۔ رسول اللہ صلی اللہ علیہ وسلم تبوک (شام) کی طرف جاتے ہوئے یہاں سے گزرے تھے۔ عبد اللہ بن عمر رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم (وادی) حجر میں تھے تو فرمایا : [ لاَ تَدْخُلُوْا عَلٰی هٰؤُلاَءِ الْقَوْمِ الْمُعَذَّبِيْنَ أَصْحَابِ الْحِجْرِ إِلاَّ أَنْ تَكُوْنُوْا بَاكِيْنَ ، فَإِنْ لَّمْ تَكُوْنُوْا بَاكِيْنَ فَلاَ تَدْخُلُوْا عَلَيْهِمْ أَنْ يُّصِيْبَكُمْ مَا أَصَابَهُمْ ] ’’ان عذاب دیے ہوئے لوگوں، یعنی اصحاب حجر پر مت داخل ہو، مگر ایسی حالت میں کہ تم رونے والے ہو، اگر تمھیں رونا نہ آئے تو ان پر داخل نہ ہونا، کہیں تمھیں بھی اس جیسا عذاب نہ آ پہنچے جو ان کو پہنچا تھا۔‘‘ [ مسند أحمد : 58/2، ح : ۵۲۲۴، و صححہ شعیب الأرنؤوط و الألبانی ] قوم ثمود کا قصہ سورۂ اعراف، شعراء، نحل اور قمر وغیرہ میں بھی مذکور ہے۔ {’’ اَخَاهُمْ صٰلِحًا ‘‘} کا مطلب یہ ہے کہ وہ اسی قبیلے کے فرد تھے، اس لیے ان کے خیر خواہ، ان کے مزاجوں کو سمجھنے والے اور ان میں مدت تک رہنے والے تھے۔ ¤ ➋ { قَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ …:} ان کی دعوت بھی وہی دعوتِ توحید تھی جو تمام انبیاء کی دعوت تھی۔ ¤ ➌ {هُوَ اَنْشَاَكُمْ مِّنَ الْاَرْضِ …: ’’ اِنْشَاءٌ‘‘ } کا معنی نئی چیز بنانا ہے۔ {’’ اسْتَعْمَرَكُمْ ‘‘ ’’ عَمَرَ يَعْمُرُ ‘‘} کسی جگہ کو آباد کرنا، سورۂ روم میں فرمایا : «{ وَ عَمَرُوْهَاۤ اَكْثَرَ مِمَّا عَمَرُوْهَا }» [ الروم : ۹ ] ’’اور انھوں نے اسے آباد کیا اس سے زیادہ جو انھوں نے اسے آباد کیا۔‘‘ {’’ أَعْمَرَ يُعْمِرُ ‘‘} باب افعال کسی شخص کو کسی جگہ میں آباد کرنا۔ {’’ اِسْتَعْمَرَ ‘‘ } میں حروف زائد ہیں، یعنی کسی کو کسی جگہ میں خوب آباد کرنا۔ صالح علیہ السلام ان الفاظ کے ساتھ انھیں اللہ تعالیٰ کی توحید اور صرف اسی کے معبود برحق ہونے کی دلیل دے رہے ہیں کہ اسی نے تمھیں زمین سے پیدا کیا، زمین کو بھی اسی نے بنایا، تمھاری ضرورت کی ہر چیز زمین سے اسی نے پیدا کی، اپنی زمین پر اس نے تمھیں خوب آباد کیا، پہاڑوں کو تراشنے کی صلاحیت اور عقل عطا فرمائی، نہایت ترقی یافتہ زراعت اور اس کے اسباب، زرخیز زمین اورچشمے عطا فرمائے۔ دیکھیے سورۂ شعراء (۱۴۱ تا ۱۵۰) اب تک اس کی جو ناشکری اور اس کے ساتھ شرک کر چکے ہو اس کی معافی مانگ کر اس پر ایمان لے آؤ اور آئندہ کے لیے اس کے ساتھ کفر و شرک سے توبہ کرو۔ ساتھ ہی ان کے سامنے اللہ تعالیٰ کی رحمت کا دروازہ کھلا ہونے کی امید دلانے کے لیے رب تعالیٰ کی دو صفات بیان کیں کہ وہ {’’قَرِيْبٌ ‘‘} بھی ہے اور {’’ مُجِيْبٌ ‘‘ } بھی۔ کوئی اسے پکارے تو اسے کسی واسطے کی ضرورت نہیں۔ آہستہ پکارے یا بلند آواز سے، اکیلا پکارے یا مجلس میں، میرا رب قریب بھی ہے اور قبول کرنے والا بھی۔ جب اس کے سوا یہ اوصاف کسی میں بھی نہیں تو کسی اور کی عبادت کیوں؟"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) ➊ {قَالُوْا يٰصٰلِحُ قَدْ كُنْتَ …:} یعنی ہم تو تمھاری ذہانت اور عقل مندی سے بڑی بڑی امیدیں وابستہ کیے بیٹھے تھے۔ کیوں نہ کرتے، نبی نبوت ملنے سے پہلے بھی اللہ تعالیٰ کی زیر نگرانی نہایت امین، صادق، عفیف، باوقار، حلیم اور تمام اوصافِ حسنہ سے متصف ہوتا ہے۔ مگر جوں ہی اس شخص نے جس کے اوصافِ حسنہ سب کے نزدیک مانے ہوئے تھے، ان کی خواہشِ نفس اور جاہلی عقائد و رواج کے خلاف بات کی تو ان کی تمام امیدوں پر پانی پھر گیا اور وہی دانا شخص ان کے نزدیک عقل و فکر سے خالی ٹھہرا اور ان کے پاس کفر و شرک کے درست ہونے کی اور صالح علیہ السلام سے امیدیں ٹوٹنے کی دلیل کیا تھی؟ صرف یہ کہ ہمارے آبا و اجداد جن کی عبادت کرتے تھے، یہ ان کی عبادت سے منع کرتا ہے۔ تمام گمراہ اقوام کی دلیل یہی تقلید رہی ہے، کیونکہ یہ بلا نہ کسی کی بات سننے دیتی ہے، خواہ کتنی صحیح ہو اور نہ خود سوچنے سمجھنے کی طرف آنے دیتی ہے۔ دیکھیے سورۂ ملک (۱۰)۔ ¤ ➋ {وَ اِنَّنَا لَفِيْ شَكٍّ مِّمَّا تَدْعُوْنَاۤ اِلَيْهِ مُرِيْبٍ :} ’’شک‘‘ ذہن کی وہ کیفیت ہے جس میں آدمی دو چیزوں میں سے کسی ایک چیز کو ترجیح نہ دے سکے۔ {’’ مُرِيْبٍ ‘‘ ’’ أَرَابَ يُرِيْبُ إِرَابَةً ‘‘} ( {رَيْبٌ} سے باب افعال ) بے چین کر دینا، بے قرار رکھنا۔ {’’ مُرِيْبٍ ‘‘} بے چین رکھنے والا۔ یہاں انھوں نے اپنی حقیقی حالت بیان کی ہے۔ صالح علیہ السلام کی دلیل اور حجت پر مبنی دعوت نے ان کے دل و دماغ میں ہلچل مچا دی تھی اور اگرچہ انھوں نے اسے نہیں مانا مگر اس دعوت نے انھیں اپنے بارے میں ایک بے چین رکھنے والے شک میں مبتلا کر دیا تھا۔ اگر تقلید آباء کی شامت نہ ہوتی تو وہ لوگ چند لمحوں میں ہر طرح کے شک اور بے چینی سے نکل کر ایمان و یقین کی ٹھنڈک اور اطمینان سے سرفراز ہو چکے ہوتے۔ مگر دیکھیے کتنی بڑی حماقت تھی کہ شرک پر نہ تو مطمئن تھے اور نہ ان کے پاس اس کی کوئی عقلی یا نقلی دلیل ہی تھی، مگر پھر بھی آبائی تقلید کی وجہ سے شرک کو چھوڑ کر توحید کی راہ اختیار کرنے کو تیار نہ تھے۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) ➊ { قَالَ يٰقَوْمِ اَرَءَيْتُمْ اِنْ كُنْتُ … :} اس کی تفسیر ان آیات سے پہلے ہود علیہ السلام کے قصے میں دیکھیے۔ {’’مِنْهُ رَحْمَةً ‘‘} سے مراد نبوت ہے۔ ¤ ➋ { اِنْ عَصَيْتُهٗ:} یعنی اگر میں تم تک اس کا پیغام پہنچانے میں کوتاہی کروں تو اس کی گرفت سے مجھے کون چھڑائے گا؟ ¤ ➌ {غَيْرَ تَخْسِيْرٍ:} یعنی اگر میں توحید کی راہ چھوڑ کر شرک کی راہ اختیار کر لوں تو یہی نہیں کہ تم مجھے اللہ کی پکڑ سے نہ بچا سکو گے، بلکہ تمھاری وجہ سے میرا جرم اور بھی بڑھ جائے گا اور اللہ تعالیٰ اس بات پر مجھے دوہری سزا دے گا کہ میں نے تمھارے کہنے پر جان بوجھ کر شرک کا راستہ اختیار کیا۔ {’’خَسِرَ يَخْسَرُ خُسْرَانًا ‘‘} (ع) خسارہ اٹھانا اور{ ’’ خَسَّرَ يُخَسِّرُ تَخْسِيْرًا ‘‘ } (تفعیل) خسارہ پہنچانا۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 65،64) ➊ {وَ يٰقَوْمِ هٰذِهٖ نَاقَةُ اللّٰهِ :} اس اونٹنی کی نسبت اللہ کی طرف اس کی عظمت کے بیان کے لیے ہے، ورنہ ہر اونٹنی اللہ تعالیٰ ہی کی ملکیت ہے۔ قرآن مجید میں اس کے اوصاف یہ آئے ہیں کہ قوم ثمود کے معجزہ طلب کرنے پر صالح علیہ السلام کو یہ اونٹنی ملی۔ اللہ تعالیٰ کی طرف سے اس کے لیے ان کے کنویں کا پانی پینے کی باری مقرر کی گئی کہ ایک دن صرف وہ پیے گی اور ایک دن دوسرے تمام لوگوں کے جانور پانی پییں گے۔ اپنی باری کے دن لوگ جتنا پانی چاہیں نکال کر رکھ لیں، مگر اونٹنی کی باری کے دن صرف وہی پیے گی۔ دیکھیے سورۂ شعراء (۱۵۴ تا ۱۵۶) وہ جہاں چاہے چرے، کوئی شخص اسے اپنے کھیت سے یا کسی بھی جگہ سے چرنے سے نہیں روکے گا اور یہ کہ اگر کسی نے اسے کوئی نقصان پہنچایا تو انھیں قریب ہی عذاب عظیم آپکڑے گا۔ (آیت زیر تفسیر) یہاں {’’ عَذَابٌ قَرِيْبٌ ‘‘} ہے جبکہ سورۂ شعراء (۱۵۶) میں {’’ عَذَابُ يَوْمٍ عَظِيْمٍ ‘‘} ہے۔ ¤ ➋ { لَكُمْ اٰيَةً :} اس میں کوئی شک نہیں کہ وہ اونٹنی ایک معجزہ تھی۔ ایک پورا دن اس کے پینے کے لیے باری مقرر کرنا بھی ظاہر کرتا ہے کہ وہ عام اونٹنی نہ تھی، مگر وہ کیسے وجود میں آئی؟ قرآن وحدیث میں اس کا ذکر مجھے نہیں ملا۔ بہت سی تفاسیر کے مطالعے کے بعد کم ازکم میری تسلی تو شیخ عبد الرحمن بن ناصر بن سعدی رحمہ اللہ کی تفسیر ’’تیسیر الکریم الرحمن فی تفسیر کلام المنان‘‘ کے کلام سے ہوئی، جو انھوں نے سورۂ اعراف میں قوم ثمود کی اونٹنی کے متعلق فرمایا ہے، چنانچہ وہ لکھتے ہیں : ’’جان لو کہ اکثر مفسرین یہ قصہ ذکر کرتے ہیں کہ وہ اونٹنی ایک نہایت سخت اور چکنی چٹان سے نکلی، جس طرح کی اونٹنی نکالنے کا انھوں نے صالح علیہ السلام سے مطالبہ کیا تھا کہ وہ حاملہ ہو اور وہ ان کی آنکھوں کے سامنے حاملہ اونٹنی کی صورت میں نکلی۔ اسے حاملہ اونٹنیوں کی طرح ولادت کا درد ہو رہا تھا۔ ساتھ ہی اس کا ایک بچہ بھی پیدا ہوا۔ جس وقت انھوں نے اونٹنی کو کاٹا تو وہ پہاڑ پر چڑھ گیا اور تین دفعہ اونٹ کی طرح بلبلایا، چنانچہ پہاڑ پھٹا اور وہ اس میں غائب ہو گیا اور یہ کہ صالح علیہ السلام نے ان سے کہا کہ تمھیں جو تین دن ملے ہیں ان میں سے پہلے دن تمھارے چہرے زرد، دوسرے دن سرخ اور تیسرے دن سیاہ ہو جائیں گے۔ چنانچہ ایسا ہی ہوا جیسا کہ انھوں نے فرمایا تھا۔‘‘ شیخ سعدی رحمہ اللہ فرماتے ہیں : ’’یہ تمام باتیں اسرائیلیات سے ہیں، جنھیں اللہ کی کتاب کی تفسیر میں نقل کرنا مناسب نہیں اور قرآن مجید میں کوئی ایسی چیز نہیں جو ان باتوں میں سے کسی ایک پر کسی طرح دلالت کرتی ہو، بلکہ اگر یہ باتیں صحیح ہوتیں تو اللہ تعالیٰ انھیں ضرور ذکر فرماتا، کیونکہ ان میں ایسی عجیب باتیں، عبرتیں اور نشانیاں ہیں جن کا ذکر ساتھ ہی ہونا تھا۔ اب اگر یہ ایسے لوگوں کی طرف سے آئیں جن پر اعتماد ہو ہی نہیں سکتا تو کیسے قبول ہو سکتی ہیں؟ بلکہ ان میں سے بعض تو قرآن مجید کی تصریحات ہی سے درست معلوم نہیں ہوتی ہیں، مثلاً صالح علیہ السلام نے اونٹنی کی ٹانگیں کاٹنے پر ان سے فرمایا : «{ تَمَتَّعُوْا فِيْ دَارِكُمْ ثَلٰثَةَ اَيَّامٍ }» تمتع خوب فائدہ اور لذت اٹھانے کو کہتے ہیں۔ وہ لوگ صالح علیہ السلام کو اور عذاب آنے کو جھٹلا رہے تھے بلکہ بار بار عذاب لانے کا مطالبہ کر رہے تھے، اگر ان کے چہرے ہی زرد، سرخ اور سیاہ ہو گئے ہوں تو انھیں تین دن خوب فائدہ اور لذت اٹھانے کی مہلت کیا خاک ملی۔ یہ قرآن کے صاف خلاف نہیں تو کیا ہے؟ ہدایت کے لیے تو قرآن کافی ہے، ہاں، اگر کوئی بات رسول اللہ صلی اللہ علیہ وسلم سے ثابت ہو، تو وہ کتاب اللہ سے نہیں ٹکرائے گی، وہ سر آنکھوں پر اور اسے ماننے کا قرآن نے حکم دیا ہے : «{ وَ مَاۤ اٰتٰىكُمُ الرَّسُوْلُ فَخُذُوْهُ وَ مَا نَهٰىكُمْ عَنْهُ فَانْتَهُووْا }» [ الحشر : ۷ ] ’’ اور رسول تمھیں جو کچھ دے تو وہ لے لو اور جس سے تمھیں روک دے تو رک جاؤ۔‘‘ اور پہلے گزر چکا ہے کہ قرآن کی تفسیر اسرائیلیات سے جائز نہیں، خواہ ان سے وہ بات نقل کرنا جائز بھی ہو، جس کا جھوٹا ہونا یقینی نہ ہو، مگر اللہ تعالیٰ کی کتاب کے معانی یقینی ہیں، ان کی تفسیر ایسی باتوں سے کرنا جن کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ تُصَدِّقُوْا أَهْلَ الْكِتَابِ وَلَا تُكَذِّبُوْهُمْ ] [بخاری، التفسیر، باب : «قولوا اٰمنا باللہ …» : ۴۴۸۵] ’’نہ انھیں سچا سمجھا جائے نہ جھوٹا۔‘‘ ایسا کام ہے جس سے اتفاق نہیں کیا جا سکتا۔‘‘ تمتع کے بارے میں ایک شعر ملاحظہ فرمائیے: ¤ {تَمَتَّعْ مِنْ شَمِيْمِ عَرَارِ نَجْدٍ ¤ فَمَا بَعْدَ الْعَشِيَّةِ مِنْ عَرَارِ} ¤ ’’نجد کی ’’عرار‘‘ نامی بوٹی کی خوشبو سے خوب فائدہ اٹھا لو، کیونکہ آج سہ پہر کے بعد پھر ’’عرار‘‘ نہیں ملے گی۔‘‘ (کیونکہ شاعر وہاں سے کوچ کر رہا تھا)"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65،64) ➊ {وَ يٰقَوْمِ هٰذِهٖ نَاقَةُ اللّٰهِ :} اس اونٹنی کی نسبت اللہ کی طرف اس کی عظمت کے بیان کے لیے ہے، ورنہ ہر اونٹنی اللہ تعالیٰ ہی کی ملکیت ہے۔ قرآن مجید میں اس کے اوصاف یہ آئے ہیں کہ قوم ثمود کے معجزہ طلب کرنے پر صالح علیہ السلام کو یہ اونٹنی ملی۔ اللہ تعالیٰ کی طرف سے اس کے لیے ان کے کنویں کا پانی پینے کی باری مقرر کی گئی کہ ایک دن صرف وہ پیے گی اور ایک دن دوسرے تمام لوگوں کے جانور پانی پییں گے۔ اپنی باری کے دن لوگ جتنا پانی چاہیں نکال کر رکھ لیں، مگر اونٹنی کی باری کے دن صرف وہی پیے گی۔ دیکھیے سورۂ شعراء (۱۵۴ تا ۱۵۶) وہ جہاں چاہے چرے، کوئی شخص اسے اپنے کھیت سے یا کسی بھی جگہ سے چرنے سے نہیں روکے گا اور یہ کہ اگر کسی نے اسے کوئی نقصان پہنچایا تو انھیں قریب ہی عذاب عظیم آپکڑے گا۔ (آیت زیر تفسیر) یہاں {’’ عَذَابٌ قَرِيْبٌ ‘‘} ہے جبکہ سورۂ شعراء (۱۵۶) میں {’’ عَذَابُ يَوْمٍ عَظِيْمٍ ‘‘} ہے۔ ¤ ➋ { لَكُمْ اٰيَةً :} اس میں کوئی شک نہیں کہ وہ اونٹنی ایک معجزہ تھی۔ ایک پورا دن اس کے پینے کے لیے باری مقرر کرنا بھی ظاہر کرتا ہے کہ وہ عام اونٹنی نہ تھی، مگر وہ کیسے وجود میں آئی؟ قرآن وحدیث میں اس کا ذکر مجھے نہیں ملا۔ بہت سی تفاسیر کے مطالعے کے بعد کم ازکم میری تسلی تو شیخ عبد الرحمن بن ناصر بن سعدی رحمہ اللہ کی تفسیر ’’تیسیر الکریم الرحمن فی تفسیر کلام المنان‘‘ کے کلام سے ہوئی، جو انھوں نے سورۂ اعراف میں قوم ثمود کی اونٹنی کے متعلق فرمایا ہے، چنانچہ وہ لکھتے ہیں : ’’جان لو کہ اکثر مفسرین یہ قصہ ذکر کرتے ہیں کہ وہ اونٹنی ایک نہایت سخت اور چکنی چٹان سے نکلی، جس طرح کی اونٹنی نکالنے کا انھوں نے صالح علیہ السلام سے مطالبہ کیا تھا کہ وہ حاملہ ہو اور وہ ان کی آنکھوں کے سامنے حاملہ اونٹنی کی صورت میں نکلی۔ اسے حاملہ اونٹنیوں کی طرح ولادت کا درد ہو رہا تھا۔ ساتھ ہی اس کا ایک بچہ بھی پیدا ہوا۔ جس وقت انھوں نے اونٹنی کو کاٹا تو وہ پہاڑ پر چڑھ گیا اور تین دفعہ اونٹ کی طرح بلبلایا، چنانچہ پہاڑ پھٹا اور وہ اس میں غائب ہو گیا اور یہ کہ صالح علیہ السلام نے ان سے کہا کہ تمھیں جو تین دن ملے ہیں ان میں سے پہلے دن تمھارے چہرے زرد، دوسرے دن سرخ اور تیسرے دن سیاہ ہو جائیں گے۔ چنانچہ ایسا ہی ہوا جیسا کہ انھوں نے فرمایا تھا۔‘‘ شیخ سعدی رحمہ اللہ فرماتے ہیں : ’’یہ تمام باتیں اسرائیلیات سے ہیں، جنھیں اللہ کی کتاب کی تفسیر میں نقل کرنا مناسب نہیں اور قرآن مجید میں کوئی ایسی چیز نہیں جو ان باتوں میں سے کسی ایک پر کسی طرح دلالت کرتی ہو، بلکہ اگر یہ باتیں صحیح ہوتیں تو اللہ تعالیٰ انھیں ضرور ذکر فرماتا، کیونکہ ان میں ایسی عجیب باتیں، عبرتیں اور نشانیاں ہیں جن کا ذکر ساتھ ہی ہونا تھا۔ اب اگر یہ ایسے لوگوں کی طرف سے آئیں جن پر اعتماد ہو ہی نہیں سکتا تو کیسے قبول ہو سکتی ہیں؟ بلکہ ان میں سے بعض تو قرآن مجید کی تصریحات ہی سے درست معلوم نہیں ہوتی ہیں، مثلاً صالح علیہ السلام نے اونٹنی کی ٹانگیں کاٹنے پر ان سے فرمایا : «{ تَمَتَّعُوْا فِيْ دَارِكُمْ ثَلٰثَةَ اَيَّامٍ }» تمتع خوب فائدہ اور لذت اٹھانے کو کہتے ہیں۔ وہ لوگ صالح علیہ السلام کو اور عذاب آنے کو جھٹلا رہے تھے بلکہ بار بار عذاب لانے کا مطالبہ کر رہے تھے، اگر ان کے چہرے ہی زرد، سرخ اور سیاہ ہو گئے ہوں تو انھیں تین دن خوب فائدہ اور لذت اٹھانے کی مہلت کیا خاک ملی۔ یہ قرآن کے صاف خلاف نہیں تو کیا ہے؟ ہدایت کے لیے تو قرآن کافی ہے، ہاں، اگر کوئی بات رسول اللہ صلی اللہ علیہ وسلم سے ثابت ہو، تو وہ کتاب اللہ سے نہیں ٹکرائے گی، وہ سر آنکھوں پر اور اسے ماننے کا قرآن نے حکم دیا ہے : «{ وَ مَاۤ اٰتٰىكُمُ الرَّسُوْلُ فَخُذُوْهُ وَ مَا نَهٰىكُمْ عَنْهُ فَانْتَهُووْا }» [ الحشر : ۷ ] ’’ اور رسول تمھیں جو کچھ دے تو وہ لے لو اور جس سے تمھیں روک دے تو رک جاؤ۔‘‘ اور پہلے گزر چکا ہے کہ قرآن کی تفسیر اسرائیلیات سے جائز نہیں، خواہ ان سے وہ بات نقل کرنا جائز بھی ہو، جس کا جھوٹا ہونا یقینی نہ ہو، مگر اللہ تعالیٰ کی کتاب کے معانی یقینی ہیں، ان کی تفسیر ایسی باتوں سے کرنا جن کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ تُصَدِّقُوْا أَهْلَ الْكِتَابِ وَلَا تُكَذِّبُوْهُمْ ] [بخاری، التفسیر، باب : «قولوا اٰمنا باللہ …» : ۴۴۸۵] ’’نہ انھیں سچا سمجھا جائے نہ جھوٹا۔‘‘ ایسا کام ہے جس سے اتفاق نہیں کیا جا سکتا۔‘‘ تمتع کے بارے میں ایک شعر ملاحظہ فرمائیے: ¤ {تَمَتَّعْ مِنْ شَمِيْمِ عَرَارِ نَجْدٍ ¤ فَمَا بَعْدَ الْعَشِيَّةِ مِنْ عَرَارِ} ¤ ’’نجد کی ’’عرار‘‘ نامی بوٹی کی خوشبو سے خوب فائدہ اٹھا لو، کیونکہ آج سہ پہر کے بعد پھر ’’عرار‘‘ نہیں ملے گی۔‘‘ (کیونکہ شاعر وہاں سے کوچ کر رہا تھا)"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66تا68) ان آیات کی تفسیر سورۂ اعراف کی آیات (۷۷ تا ۷۹) میں اور سورۂ ہود کے اس سے پچھلے رکوع کے آخر میں ملاحظہ فرمائیں۔ {’’ كَاَنْ لَّمْ يَغْنَوْا فِيْهَا ‘‘ ’’ غَنِيَ يَغْنٰي‘‘} (ع ) {’’ فِيْ ممَكَانٍ كَذَا ‘‘} جب کوئی شخص لمبی مدت کسی جگہ میں یوں رہے کہ وہ اس کے سوا کسی بھی جگہ سے غنی ہو۔{’’مَغْنَي‘‘} مصدر بھی ہے، مکان بھی، یعنی رہنا اور رہنے کی جگہ۔ (مفردات راغب)"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 66تا68) ان آیات کی تفسیر سورۂ اعراف کی آیات (۷۷ تا ۷۹) میں اور سورۂ ہود کے اس سے پچھلے رکوع کے آخر میں ملاحظہ فرمائیں۔ {’’ كَاَنْ لَّمْ يَغْنَوْا فِيْهَا ‘‘ ’’ غَنِيَ يَغْنٰي‘‘} (ع ) {’’ فِيْ ممَكَانٍ كَذَا ‘‘} جب کوئی شخص لمبی مدت کسی جگہ میں یوں رہے کہ وہ اس کے سوا کسی بھی جگہ سے غنی ہو۔{’’مَغْنَي‘‘} مصدر بھی ہے، مکان بھی، یعنی رہنا اور رہنے کی جگہ۔ (مفردات راغب)"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 66تا68) ان آیات کی تفسیر سورۂ اعراف کی آیات (۷۷ تا ۷۹) میں اور سورۂ ہود کے اس سے پچھلے رکوع کے آخر میں ملاحظہ فرمائیں۔ {’’ كَاَنْ لَّمْ يَغْنَوْا فِيْهَا ‘‘ ’’ غَنِيَ يَغْنٰي‘‘} (ع ) {’’ فِيْ ممَكَانٍ كَذَا ‘‘} جب کوئی شخص لمبی مدت کسی جگہ میں یوں رہے کہ وہ اس کے سوا کسی بھی جگہ سے غنی ہو۔{’’مَغْنَي‘‘} مصدر بھی ہے، مکان بھی، یعنی رہنا اور رہنے کی جگہ۔ (مفردات راغب)"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) ➊ {وَ لَقَدْ جَآءَتْ رُسُلُنَاۤ اِبْرٰهِيْمَ بِالْبُشْرٰى : ’’ رُسُلُنَاۤ ‘‘} ہمارے بھیجے ہوئے سے مراد فرشتے ہیں جو انسانی شکل میں ابراہیم علیہ السلام کے پاس بیٹے اور پوتے، اسحاق اور یعقوب کی خوش خبری لے کر آئے تھے۔ ان کی تعداد بعض نے تین بیان کی، جبرائیل، میکائیل اور اسرافیل، بعض نے نو (۹) اور بعض نے تیرہ (۱۳)، مگر قرآن و سنت سے ان کی تعداد کا ذکر ہمیں نہیں ملا۔ سورۂ حجر (۴۹، ۵۰) میں اللہ تعالیٰ نے اپنے غفور و رحیم ہونے اور اپنے عذاب کے عذاب الیم ہونے کی خبر دینے کا حکم دیا ہے۔ اس کے بعد ابراہیم اور لوط علیھما السلام کے یہ واقعات ذکر فرمائے جن سے ظاہر ہوتا ہے کہ فرشتوں کی ایک ہی جماعت ایک کے لیے خوش خبری اور دوسری قوم کے لیے عذاب لے کر آئی تھی۔ چنانچہ ان کے آنے سے اللہ تعالیٰ کی دونوں صفات کا اظہار ہوا تھا۔ یہاں ان فرشتوں کے آنے کو ابراہیم علیہ السلام کے لیے خوش خبری لانے والے فرمایا ہے، کیونکہ اگر ابراہیم علیہ السلام کے لیے بیٹے اور پوتے کی خبر خوش خبری ہے تو لوط علیہ السلام کی ملعون قوم کی بربادی کی خبر بھی ابراہیم اور لوط علیھما السلام دونوں کے لیے خوش خبری ہے، البتہ قوم لوط کے لیے بری خبر ہے۔ ¤ ➋ { قَالُوْا سَلٰمًا قَالَ سَلٰمٌ : } پہلا {’’ سَلٰمًا ‘‘} منصوب ہے، یہ جملہ فعلیہ ہے : {’’ نُسَلِّمُ سَلاَمًا ‘‘} ’’ہم سلام کہتے ہیں۔‘‘ دوسرا {’’سَلٰمٌ‘‘ } مرفوع ہے، یعنی {’’سَلَامٌ عَلَيْكُمْ‘‘} ’’تم پر سلام ہو۔‘‘ معلوم ہوا کہ فرشتوں نے اللہ تعالیٰ کے اس حکم پر عمل کیا جس میں کسی کے گھر میں داخل ہونے سے پہلے سلام کہنے کا حکم ہے۔ دیکھیے سورۂ نور (۲۷) بلکہ ابن عمر رضی اللہ عنھما نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیا ہے : [ اَلسَّلَامُ قَبْلَ السُّؤَالِ فَمَنْ بَدَأَكُمْ بِالسُّؤَالِ قَبْلَ السَّلَامِ فَلَا تُجِيْبُوْهٗ ] [ السلسلۃ الصحیحۃ : 458/1، ح : ۸۱۶ ] ’’سلام سوال سے پہلے ہے، جو تم سے سلام سے پہلے سوال کرے، اسے جواب مت دو۔‘‘ اور ایک روایت میں فرمایا : [ مَنْ بَدَأَ بِالْكَلَامِ قَبْلَ السَّلَامِ فَلَا تُجِيْبُوْهٗ ] [ صحیح الجامع : ۶۱۲۲ ] ’’جو سلام سے پہلے بات کرے اسے جواب مت دو۔‘‘ ابراہیم علیہ السلام نے اللہ تعالیٰ کے اس حکم پر عمل کرتے ہوئے بہتر جواب دیا جو سورۂ نساء (۸۶) میں ہے، کیونکہ جملہ فعلیہ کچھ وقت کے لیے ہوتا ہے جب کہ جملہ اسمیہ میں استمرار یعنی ہمیشگی پائی جاتی ہے، یعنی تم پر ہمیشہ سلامتی ہو۔ {’’ سَلٰمًا ‘‘} کے جواب میں {’’سَلٰمٌ ‘‘ } بہتر جواب ہے۔ ¤ ➌ { فَمَا لَبِثَ اَنْ جَآءَ بِعِجْلٍ حَنِيْذٍ:} اس سے ایک بات تو یہ معلوم ہوئی کہ فرشتے انسانی شکل اختیار کر سکتے ہیں۔ حدیث میں اس کی کئی مثالیں موجود ہیں۔ معروف حدیث جبریل علیہ السلام میں فرشتے کا ایک اعرابی کی شکل میں آنا بخاری و مسلم میں موجود ہے۔ [بخاری: ۴۷۷۷۔ مسلم: ۸] دوسری بات یہ معلوم ہوئی کہ ابراہیم علیہ السلام اولو العزم پیغمبر ہو کر بھی مہمانوں کو پہچان نہ سکے، ورنہ وہ کھانے کا اہتمام نہ کرتے، کیونکہ فرشتے نہ کھاتے ہیں نہ پیتے ہیں۔ معلوم ہوا کہ علم غیب صرف اللہ تعالیٰ کا خاصہ ہے۔ جب ابراہیم علیہ السلام علم غیب نہیں رکھتے تھے تو پھر ان لوگوں کی کیا اوقات ہے جو نہ نبی ہیں اور نہ ان کے اصلی حالات اللہ کے سوا کوئی جانتا ہے کہ اللہ تعالیٰ کے ہاں ان کی کیا حیثیت ہے؟ تیسری بات یہ معلوم ہوئی کہ ابراہیم علیہ السلام بے حد مہمان نواز تھے۔ یہ وصف ہر نبی خصوصاً ابراہیم علیہ السلام اور ہمارے نبی صلی اللہ علیہ وسلم میں بہت پایا جاتا تھا۔ ہماری ماں خدیجہ رضی اللہ عنھا نے آپ صلی اللہ علیہ وسلم کی پہلی وحی کے موقع پر آپ کے اوصاف میں اس وصف کا خصوصی ذکر فرمایا : [ وَتَقْرِي الضَّيْفَ ] [ بخاری : ۳ ] ’’آپ مہمان کی مہمان نوازی کرتے ہیں۔‘‘ آپ صلی اللہ علیہ وسلم کے تربیت یافتہ صحابہ کا یہ حال تھا کہ نافع رحمہ اللہ بیان کرتے ہیں : [ كَانَ ابْنُ عُمْرَ لَا يَأْكُلُ حَتَّی يُؤْتٰی بِمِسْكِيْنٍ يَأْكُلُ مَعَهٗ ] ’’عبد اللہ بن عمر رضی اللہ عنھما اس وقت تک کھانا نہیں کھاتے تھے جب تک کوئی مسکین ان کے ساتھ کھانے کے لیے نہ لایا جاتا۔‘‘ [بخاری، الأطعمۃ، باب المؤمن یأکل في معی واحد : ۵۳۹۳ ] پھر نبی کریم صلی اللہ علیہ وسلم اور ان کے والد ماجد ابراہیم علیہ السلام کی فیاضی کا کیا حال ہو گا۔ چوتھی بات یہ معلوم ہوئی کہ مہمان نوازی میں دیر نہیں کرنی چاہیے، نہ ان سے اس بارے میں پوچھ گچھ کرنی چاہیے۔ سورۂ ذاریات میں ہے کہ ابراہیم علیہ السلام چپکے سے گھر گئے اور کھانا لے آئے۔ وقت کی مناسبت سے جو حاضر ہو پیش کر دیا جائے، مہمان کی خواہش ہے تو کھا لے، ورنہ اس کی مرضی۔ ¤ پانچویں یہ کہ ابراہیم علیہ السلام پر دنیوی لحاظ سے بھی اللہ تعالیٰ کا فضل تھا، ورنہ بھنا ہوا بچھڑا تھوڑی دیر میں لا کر پیش کر دینا ہر شخص کے بس کی بات نہیں۔ چھٹی یہ کہ وہ احادیث جن میں گائے کے گوشت کو بیماری کہا گیا ہے، بظاہر اچھی سند کی بھی ہوں تو شاذ ہیں، کیونکہ قرآن میں گائے کے گوشت کو بطور انعام ذکر کیا گیا ہے۔ اس کی قربانی اور مختلف موقعوں پر ذبح کرنا قرآن مجید اور صحیح احادیث سے ثابت ہے۔ اللہ تعالیٰ یا اس کا رسول صلی اللہ علیہ وسلم بیماری والی چیز کی اجازت کیسے دے سکتے ہیں؟ ¤ ساتویں یہ کہ ابراہیم علیہ السلام ، ہمارے نبی کریم صلی اللہ علیہ وسلم اور تمام انبیاء بشر تھے اور کھانا کھاتے تھے۔ وہ نہ اللہ تعالیٰ یا اس کا کوئی جزو تھے اور نہ فرشتے، بلکہ وہ انسان تھے، کھانا کھاتے اور بازاروں میں چلتے پھرتے تھے۔ (دیکھیے فرقان : ۲۰) اور ان کی بیویاں تھیں اور اولادیں بھی۔ (دیکھیے رعد : ۳۸) جب کہ اللہ تعالیٰ اور فرشتے ان سب سے پاک ہیں۔ آٹھویں یہ کہ صوفیاء جو جان دار یا اس سے نکلنے والی چیزیں اپنے خود ساختہ وظیفوں اور چلّوں کے دوران میں یا ہمیشہ کے لیے کھانا ترک کر دیتے ہیں وہ ملت ابراہیمی کے نہیں بلکہ ہندو مذہب کے پیروکار ہیں۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) ➊ { فَلَمَّا رَاٰ اَيْدِيَهُمْ لَا تَصِلُ اِلَيْهِ نَكِرَهُمْ …:} ابراہیم علیہ السلام نے صرف کھانا پیش ہی نہیں کیا بلکہ انھیں کھانے کے لیے اصرار بھی کیا : «{قَالَ اَلَا تَاْكُلُوْنَ}» [ الذاریات : ۲۷ ] ’’فرمایا کیا تم کھاتے نہیں ہو؟‘‘ پھر بھی جب انھوں نے کھانے کی طرف ہاتھ نہیں بڑھایا تو دل میں ایک قسم کا خوف محسوس کیا۔ {’’ خِيْفَةً ‘‘} کی تنوین کی وجہ سے ’’ایک قسم کا خوف‘‘ ترجمہ کیا گیا ہے۔ خوف کی وجہ یہ تھی کہ ان کے علاقے میں اگر کوئی اجنبی آتا اور وہ مہمانی میں پیش کیا ہوا کھانا قبول نہ کرتا تو اس کے متعلق سمجھا جاتا کہ وہ کسی برے ارادے سے آیا ہے، یا یہ بھی ہو سکتا ہے اور شاید یہی زیادہ موقع کے مناسب ہے کہ ابراہیم علیہ السلام اور ان کی بیوی نے ان کے کھانا تناول نہ کرنے کی وجہ سے ان کے فرشتے ہونے کو بھانپ لیا ہو اور وہ اس بنا پر ڈر گئے ہوں کہ یہ ان کی بستی پر عذاب کے لیے بھیجے گئے ہیں۔ (شوکانی) فرشتوں نے ان کے خوف کو بھانپ لیا، بلکہ سورۂ حجر (۵۲) میں ہے کہ ابراہیم علیہ السلام نے صاف کہہ دیا : «{ اِنَّا مِنْكُمْ وَ جِلُوْنَ }» ’’ہم توتم سے خوف زدہ ہیں۔‘‘ ¤ ➋ { قَالُوْا لَا تَخَفْ اِنَّاۤ اُرْسِلْنَاۤ اِلٰى قَوْمِ لُوْطٍطٍ :} فرشتوں نے کہا، آپ مت ڈریں، ہمیں (آپ کی بستی پر نہیں بلکہ) لوط علیہ السلام کی قوم پر عذاب کے لیے بھیجا گیا ہے۔ اس سے انبیائے کرام علیھم السلام کے عالم الغیب ہونے کی اور ان کے کائنات پر اختیار رکھنے کی صاف نفی ہو رہی ہے۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) ➊ {وَ امْرَاَتُهٗ قَآىِٕمَةٌ فَضَحِكَتْ :} ان کی بیوی سارہ علیھا السلام مہمانوں کی خدمت کے لیے ساتھ ہی کھڑی تھی اور خوف زدہ تھی۔ جب اس نے یہ بات سنی تو ہنس پڑی، یا تو اس لیے کہ ہم انھیں ڈاکو سمجھے تھے یہ تو فرشتے نکلے، یا اس خوشی میں کہ ہم تو خوف زدہ تھے کہ اس طرح فرشتوں کی آمد خطرے سے خالی نہیں ہوتی (دیکھیے حجر : ۸) مگر یہ تو ہم پر عذاب کے بجائے ہمارے عزیز پیغمبر لوط علیہ السلام کی نافرمان قوم پر عذاب کی خوش خبری لے کر آئے ہیں اور دشمن کی ہلاکت کی خبر سے یقینا خوشی ہوتی ہے۔ ¤ ➋ { فَبَشَّرْنٰهَا بِاِسْحٰقَ …:} سارہ علیھا السلام کے لیے ایک خوشی کی خبر وہ تھی جو اوپر گزری، جس پر وہ بے ساختہ ہنس پڑیں۔ فرشتوں نے انھیں مزید دو خوش خبریاں دیں، ایک بیٹا عطا ہونے کی، پھر اس بیٹے سے پوتا یعقوب عطا ہونے کی اور ان کے ضمن میں یہ خوش خبری تھی کہ تم دونوں میاں بیوی ابھی اتنی عمر اور پاؤ گے کہ بیٹا ملے گا، وہ جوان ہو گا، پھر اس کی شادی ہو گی اور اسے یعقوب عطا ہو گا، گویا مسلسل چار خوش خبریاں۔ یہ چاروں خوش خبریاں فرشتوں نے دی تھیں، مگر اللہ تعالیٰ نے فرمایا کہ ہم نے اسے یہ خوش خبریاں دیں، کیونکہ فرشتوں کا کام تو صرف پہنچانا تھا، اصل خوش خبری تو اللہ تعالیٰ کی طرف سے تھی جو کسی صورت غلط نہیں ہو سکتی۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) ➊ { قَالَتْ يٰوَيْلَتٰۤى: } امام طبری رحمہ اللہ نے فرمایا کہ {’’ يَا وَيْلَتَا ‘‘} کا کلمہ عرب کسی چیز پر تعجب اور اسے انوکھا سمجھنے کے وقت بولتے ہیں، چنانچہ تعجب کے وقت کہتے ہیں : {’’ وَيْلُ أُمِّهِ مَا أَرْجَلَهُ ‘‘} ’’اس کی ماں ہلاک ہو، وہ کس قدر مرد ہے۔‘‘ باقی الف کے متعلق طبری کا فیصلہ یہ ہے کہ یہ الف ’’ندبہ‘‘ کا ہے اور تاء کا اضافہ اس لیے کیا گیا ہے کہ {’’وَيْلٌ‘‘} کے بعد والا الف ندبہ اتنا واضح اور لمبا نہیں ہو سکتا جتنا درمیان میں تاء کے اضافے سے ہو سکتا ہے۔ ¤ ➋ { ءَاَلِدُ وَ اَنَا عَجُوْزٌ … :} پہلی خوش خبری کا رد عمل وہ ہنسی تھی جو سارہ علیھا السلام کے چہرے پر نمودار ہوئی، اب ایک ایسی چیز کی خوش خبری ملی جو ساری زندگی کی آرزو کا خلاصہ تھی اور اس وقت ملی جب دنیاوی اسباب کے لحاظ سے اس کی امید ہی نہ تھی تو سارہ علیھا السلام کی ہنسی حیرت اور دہشت میں بدل گئی۔ کہا، کیا ایسا ہو گا کہ میرے ہاں بچہ ہو گا؟ جب کہ میں بڑھیا ہوں اور یہ میرا خاوند بھی بوڑھا ہے، یقینا یہ تو ایک عجیب چیز ہے۔ یہ خوش خبری فرشتوں نے ابراہیم علیہ السلام کو بھی دی تھی، جیسا کہ سورۂ ذاریات میں ہے : «{ وَ بَشَّرُوْهُ بِغُلٰمٍ عَلِيْمٍ }» [ الذاریات : ۲۸ ] ’’اور انھوں نے اسے (ابراہیم علیہ السلام ) کو ایک بہت علم والے لڑکے کی خوش خبری دی۔‘‘ مگر یہاں خصوصاً ان کی بیوی کو خوش خبری دینے اور ان سے گفتگو کا ذکر کیا ہے، کیونکہ ابراہیم علیہ السلام کے ہاں تو ہاجر علیھا السلام سے اسماعیل پیدا ہو چکے تھے، لیکن سارہ علیھا السلام ابھی تک بے اولاد تھیں۔ قدیم مفسرین اور اسرائیلی روایات سے معلوم ہوتا ہے کہ اس وقت ابراہیم علیہ السلام کی عمر سو سال اور سارہ علیھا السلام کی عمر نوے سال تھی، مگر حقیقت یہ ہے کہ ان دونوں کی عمر کے تعین کا کوئی بااعتماد ذریعہ ہمارے پاس نہیں۔ اللہ تعالیٰ کا بیان سارہ علیھا السلام کا {’’ عَجُوْزٌ ‘‘} ہونا اور ان کے خاوند کا {’’ شَيْخًا ‘‘} ہونا ہی{ ’’ لَشَيْءٌ عَجِيْبٌ ‘‘ } سمجھنے کے لیے کافی ہے، ورنہ اللہ تعالیٰ ضرور ان کی عمر بھی بیان فرما دیتا۔ ¤ ➌ یہ آیت دلیل ہے کہ ذبیح اسماعیل علیہ السلام تھے، کیونکہ اسحاق علیہ السلام کی خوش خبری کے ساتھ ہی یعقوب پوتے کی خوش خبری بھی تھی، ان کے ذبح کے حکم کا تو سوال ہی پیدا نہیں ہوتا۔ (قرطبی)"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) ➊ {قَالُوْۤا اَتَعْجَبِيْنَ مِنْ اَمْرِ اللّٰهِ: } یعنی وہ تو ماں باپ کے بغیر بھی پیدا کر سکتا ہے، پھر بوڑھی عورت کو بچہ عطا کرنا اسے کیا مشکل ہے۔ جب اللہ کے امر کے سامنے کوئی چیز ناممکن نہیں تو تعجب کیسا۔ پھر اس گھر میں شروع سے اللہ کی رحمت وبرکت کے جو معجزے ظاہر ہوتے رہے ہیں، مثلاً آگ کا گلزار ہونا، اسماعیل علیہ السلام کا ذبح سے محفوظ رہنا، مصر کے اس ظالم جبار سے سارہ علیھا السلام کی عصمت کا محفوظ رہنا وغیرہ، ان کے بعد تو اللہ کے حکم سے کسی بھی ناممکن کام کے ہو جانے پر تعجب نہیں ہونا چاہیے۔ ¤ ➋ {رَحْمَتُ اللّٰهِ وَ بَرَكٰتُهٗ عَلَيْكُمْ اَهْلَ الْبَيْتِ:’’ اَهْلَ الْبَيْتِ ‘‘} سے پہلے حرف ندا {’’ يَا ‘‘} مقدر ہے، اس لیے یہ منصوب ہے، یعنی ’’اے گھر والو!‘‘ پہلے {’’ سَلٰمًا ‘‘} کہا تھا، اب {’’ رَحْمَتُ اللّٰهِ وَ بَرَكٰتُهٗ عَلَيْكُمْ ‘‘} کے ساتھ وہ مکمل ہو گیا، اس سے زائد الفاظ ثابت نہیں ہیں۔ اس وقت فرشتوں کی مخاطب صرف اکیلی سارہ علیھا السلام تھیں، ان کے لیے فرشتوں نے جو الفاظ استعمال کیے ہیں، ان میں سے دو الفاظ خاص طور پر قابل توجہ ہیں، ایک تو یہ کہ اکیلی عورت کو{ ’’ عَلَيْكُمْ ‘‘} جمع مذکر حاضر کے لفظ سے خطاب کیا ہے، حالانکہ وہ مؤنث تھیں۔ دوسرا انھیں {’’ اَهْلَ الْبَيْتِ ‘‘} کہہ کر خطاب کیا ہے۔ معلوم ہوا کہ آدمی کے اہل ِبیت (گھر والے) اس کی بیوی ہوتی ہے۔ دوسرا یہ کہ سلام اور رحمت وبرکت کہتے وقت عورتوں کو بھی مذکر کے صیغے سے مخاطب کیا جاتا ہے۔ یہ آیت فیصلہ کن ہے کہ سورۂ احزاب کی آیت : «{ اِنَّمَا يُرِيْدُ اللّٰهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ اَهْلَ الْبَيْتِ وَ يُطَهِّرَكُمْ تَطْهِيْرًا }» [ الأحزاب : ۳۳ ] ’’اللہ تو یہی چاہتا ہے کہ تم سے گندگی دور کر دے اے گھر والو! اور تمھیں پاک کر دے خوب پاک کرنا۔‘‘ اس آیت میں اہل ِ بیت کا ذکر کرتے ہوئے پہلے بھی اور بعد میں بھی نبی کریم صلی اللہ علیہ وسلم کی ازواج مطہرات کا ذکر ہے، تو یہاں اس آیت میں بھی{ ’’ عَنْكُمُ ‘‘} اور {’’ اَهْلَ الْبَيْتِ ‘‘} اور {’’ يُطَهِّرَكُمْ ‘‘} تینوں میں رسول اللہ صلی اللہ علیہ وسلم کی بیویاں مراد ہیں۔ اس کی نفی کرنے والے ایک واضح اور ثابت شدہ حقیقت کی نفی کر رہے ہیں، جس کی وجہ نبی صلی اللہ علیہ وسلم کی محبوب ازواج مطہرات سے بغض و عناد کے سوا کچھ نہیں اور جو نبی صلی اللہ علیہ وسلم کے پیاروں سے بغض رکھے وہ نبی صلی اللہ علیہ وسلم کی محبت سے کیسے بہرہ ور ہو سکتا ہے۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) {فَلَمَّا ذَهَبَ عَنْ اِبْرٰهِيْمَ الرَّوْعُ … :} ابراہیم علیہ السلام کی قومِ لوط سے متعلق بحث فرشتوں سے ہوئی تھی، جیسا کہ سورۂ عنکبوت (۳۲) میں صراحت ہے۔ یہاں اللہ تعالیٰ نے اسے اپنے ساتھ جھگڑا فرمایا، کیونکہ فرشتے تو جو کچھ کر رہے تھے اللہ تعالیٰ کے حکم ہی سے کر رہے تھے۔{’’ يُجَادِلُنَا ‘‘} مضارع کا صیغہ حکایت حال یعنی اس وقت کی منظر کشی کے لیے استعمال فرمایا ہے۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75){ اِنَّ اِبْرٰهِيْمَ لَحَلِيْمٌ اَوَّاهٌ مُّنِيْبٌ :} اس لیے اللہ تعالیٰ نے ان کی بحث و تکرار کا برا نہ مانا، بلکہ نہایت پیار سے ان کا ذکر فرمایا۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76) {يٰۤاِبْرٰهِيْمُ اَعْرِضْ عَنْ هٰذَا … :} یہ فرشتوں کی بات ہے جو بالآخر انھوں نے ابراہیم علیہ السلام سے کہی کہ اب بحث و تکرار کا کچھ فائدہ نہیں، کیونکہ اللہ تعالیٰ کی طرف سے حکم آ جانے کے بعد عذاب ٹلنے کی کوئی صورت نہیں۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77) ➊ { وَ لَمَّا جَآءَتْ رُسُلُنَا لُوْطًا سِيْٓءَ بِهِمْ …:} یہاں سے لوط علیہ السلام کا قصہ شروع ہوتا ہے جو کئی سورتوں میں مختلف انداز سے ذکر ہوا ہے، مثلاً سورۂ اعراف، حجر، شعراء، نمل، عنکبوت، صافات، ذاریات اور قمر۔ ان سورتوں میں بھی تفسیر دیکھ لیں۔ لوط علیہ السلام ابراہیم علیہ السلام کے آگ سے صحیح سلامت باہر نکل آنے پر ان پر ایمان لے آئے تھے اور انھوں نے ان کے ساتھ ہی شام کی طرف ہجرت کی تھی۔ اللہ تعالیٰ نے انھیں نبوت سے سسرفراز فرمایا اور وادئ اردن میں ’’سدوم‘‘ نامی بستی اور اس کے گرد و نواح کے لیے مبعوث فرمایا۔ یہ قوم شرک و کفر کے ساتھ ساتھ ایسے فعل بد کی مرتکب تھی جس کا ارتکاب ان سے پہلے دنیا بھر میں کسی نے نہیں کیا تھا۔ یہ لوگ عورتوں کو چھوڑ کر مردوں کے ساتھ بدفعلی کے عادی تھے۔ اپنی مجلسوں میں کھلم کھلا برائی کرنا اور ڈاکے مارنا ان کا عام رویہ تھا۔ دیکھیے سورۂ عنکبوت (۲۹) مزید تفصیل کے لیے دیکھیے سورۂ اعراف (۸۰ تا ۸۳)کی تفسیر۔ ¤ ➋ {سِيْٓءَ بِهِمْ …: ’’ سَائَهُ يَسُوْئُهُ ‘‘} سے ماضی مجہول ہے، غمگین کرنا، برا لگنا۔ یہاں {’’ سِيْٓءَ ‘‘} کا نائب فاعل لوط علیہ السلام کی طرف لوٹنے والی ضمیر ہے اور فاعل محذوف ہے، گویا عبارت یوں ہے کہ{’’سَاءَهُ مَجِيْئُهُمْ‘‘} یعنی ان کے آنے نے اسے مغموم کر دیا۔ فعل مجہول کا معنی ہو گا، وہ ان کی وجہ سے مغموم ہوا۔ {’’ وَ ضَاقَ بِهِمْ ذَرْعًا ‘‘ ’’ذَرْعٌ‘‘} اور {’’ذِرَاعٌ‘‘ } بازو یا جانور کی اگلی ٹانگوں کو کہتے ہیں، اونٹ یا کسی بھی جان دار پر اگر بوجھ نہ ہو تو وہ کھلا قدم اٹھاتا ہے اور اگر اس کی استعداد سے زیادہ بوجھ ہو تو وہ بڑی مشکل سے قدم اٹھاتا ہے اور وہ بھی بالکل تنگ سا، اس لیے {’’ضَاقَ ذَرْعًا‘‘} سے مراد دل تنگ ہونا لیا جاتا ہے۔ لوط علیہ السلام کے ان کے آنے کی وجہ سے مغموم ہونے کی وجہ مہمان نوازی میں بخل نہ تھا، نبی سے بڑھ کر کون فراخ دل اور سخی ہو سکتا ہے، بلکہ انھیں اپنی قوم کی عادتِ بد کا علم تھا۔ ظاہر ہے فرشتے انسانی شکل میں آئے ہوں تو وہ کس قدر خوبصورت ہوں گے۔ لوط علیہ السلام کو معلوم نہ تھا کہ یہ فرشتے ہیں، کیونکہ غیب تو صرف اللہ تعالیٰ جانتا ہے اور لوط علیہ السلام کو یہ بات بتائی نہیں گئی تھی، اس لیے ان کے دل پر جو گزری، اللہ تعالیٰ نے اس کا کمال نقشہ کھینچا ہے۔ پہلے غم ہوا، پھر اپنی بے بسی پر تنگ دل ہوئے، پھر جس طرح کوئی شخص کوئی لفظ کہہ کر دل کو کچھ نہ کچھ تسلی دیتا ہے، یہ کہا کہ یہ دن تو بہت سخت ہے۔ [ التحریر والتنویر]"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) ➊ {وَ جَآءَهٗ قَوْمُهٗ يُهْرَعُوْنَ اِلَيْهِ : ’’هَرَعَ‘‘} (ف) کا معنی کسی کو تیزی سے دھکیلنا ہے۔ فعل مجہول کا مطلب یہ ہے کہ جب اس خبیث قوم کو لوط علیہ السلام کے گھر ایسے حسینوں کے آنے کی خبر ملی تو وہ ان کی طرف تیزی سے اس طرح بے اختیار دوڑتے ہوئے آئے جیسے کوئی انھیں پیچھے سے دھکیل رہا ہے۔ ¤ ➋ {وَ مِنْ قَبْلُ كَانُوْا يَعْمَلُوْنَ السَّيِّاٰتِ :} فعل مضارع پر {’’ كَانَ ‘‘} آئے تو استمرار اور ہمیشگی کا معنی دیتا ہے، الا یہ کہ اس کے خلاف کوئی دلیل ہو۔ اس لیے زمخشری نے اس کا معنی کیا ہے : {’’ وَ مِنْ قَبْلِ ذٰلِكَ الْوَقْتِ كَانُوْا يَعْمَلُوْنَ الْفَوَاحِشَ وَيُكْثِرُوْنَهَا فَضَرَوْا بِهَا وَمَرَنُوْا عَلَيْهَا ‘‘} ’’اس سے پہلے وہ یہ برے کام کثرت سے کرتے تھے، حتیٰ کہ یہ ان کی عادت بن چکی تھی۔‘‘ یعنی کوئی آدمی شروع شروع میں ایسا غلیظ فعل کرنے سے کچھ جھجکتا ہے مگر یہ لوگ بے اختیار تیزی سے اس لیے آئے کہ کثرت سے اس فعل بد کے ارتکاب نے ان کی حیا اور جھجک بالکل ختم کر دی تھی۔ ¤ ➌ { قَالَ يٰقَوْمِ هٰۤؤُلَآءِ بَنَاتِيْ …:} جب وہ گھس آئے اور شدت سے مہمانوں کو اپنے حوالے کرنے کا مطالبہ کرنے لگے تو لوط علیہ السلام نے مہمانوں کی عزت بچانے کے لیے اپنی تواضع کی انتہا کر دی، کہا یہ میری بیٹیاں ہیں، یہ تمھارے لیے بہت پاکیزہ ہیں، اللہ سے ڈرو! مجھے میرے مہمانوں میں رسوا نہ کرو۔ کیا تم میں ایک بھی بھلا آدمی نہیں؟ یہاں مفسرین نے بیٹیاں پیش کرنے کی مختلف توجیہیں کی ہیں۔ اشرف الحواشی میں ہے کہ {’’ بَنَاتِيْ ‘‘} (بیٹیوں) سے مراد ان لوگوں کی اپنی عورتیں ہیں، کیونکہ نبی اپنی قوم کے لیے بمنزلہ باپ کے ہوتا ہے اور قوم کی ساری عورتیں نبی کی بیٹیاں ہوتی ہیں، جیسا کہ نبی صلی اللہ علیہ وسلم کے متعلق ارشاد ہے : «{ اَلنَّبِيُّ اَوْلٰى بِالْمُؤْمِنِيْنَ مِنْ اَاَنْفُسِهِمْ وَ اَزْوَاجُهٗۤ اُمَّهٰتُهُمْ }» [ الأححزاب : ۶ ] ’’یہ نبی مومنوں پر ان کی جانوں سے زیادہ حق رکھنے والا ہے اور اس کی بیویاں ان کی مائیں ہیں۔‘‘ یہی تفسیر راجح ہے، گو بعض نے لوط علیہ السلام کی اپنی بیٹیاں بھی مراد لی ہیں کہ ان سے شادی کر لو۔ (کما فی الموضح) اس تفسیر کے راجح ہونے کی وجہ یہ بیان کی جاتی ہے کہ لوط علیہ السلام کی بیٹیاں معروف قول کے مطابق صرف دو تھیں، اگر کم و بیش بھی ہوں تو پوری قوم سے تو ان کی شادی نہیں ہو سکتی، اس لیے بیٹیوں سے مراد قوم کی بیٹیاں یعنی ان کی بیویاں ہیں۔ ایک قول یہ بھی ہے کہ مراد اپنی ہی بیٹیاں تھیں، مگر نہ انھیں ان کے حوالے کرنا مقصود تھا نہ ان کی ان سے شادی کرنا، بلکہ محض انھیں شرمندہ کرکے اپنے مہمانوں کی عزت بچانا مقصود تھا، کیونکہ وہ بھی جانتے تھے اور قوم بھی کہ اپنی بیٹیاں کوئی کسی کے حوالے نہیں کرتا۔ یہ صرف اپنی عاجزی کے اظہار اور انھیں شرمندہ کرنے کے لیے ہے، جیساکہ سلیمان علیہ السلام نے فیصلہ کیا تھا کہ لاؤ بچے کے دو ٹکڑے کرکے دونوں دعویدار عورتوں کو ایک ایک حصہ دے دیتے ہیں، حالانکہ ان کی مراد ہر گز یہ نہ تھی کہ واقعی بچے کو درمیان سے کاٹ دیاجائے، بلکہ وہ حقیقت اگلوانا چاہتے تھے۔ آیت کے ظاہر الفاظ سے یہ معنی مناسب معلوم ہوتا ہے۔ ¤ ➍ {’’ هُنَّ اَطْهَرُ لَكُمْ ‘‘} کا مطلب یہ نہیں کہ مردوں سے یہ فعل بھی کچھ طہارت رکھتا ہے، مگر عورتیں زیادہ طاہر ہیں، بلکہ یہاں یہ بہت پاکیزہ کے معنوں میں ہے۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79){قَالُوْا لَقَدْ عَلِمْتَ مَا لَنَا فِيْ بَنٰتِكَ …:} یعنی ہمارا تمھاری بیٹیوں میں کوئی حق نہیں(گویا آنے والے مہمان مردوں سے بدفعلی ان کا پورا حق ہے)، یا یہ مطلب ہے کہ ہمیں عورتوں یا بیویوں سے کوئی دلچسپی نہیں، ہم جو چاہتے ہیں وہ تجھے معلوم ہی ہے کہ ہم کس بدفعلی کے عادی ہیں، اس لیے تم ہماری راہ میں رکاوٹ نہ بنو۔ ان کے اس جواب سے ان کی خباثت کا پورا نقشہ سامنے آ جاتا ہے اور صاف معلوم ہوجاتا ہے کہ کیوں ان کو اس عذاب کا مستحق سمجھا گیا جو ان کے علاوہ کسی قوم پر نازل نہیں کیا گیا۔"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80){قَالَ لَوْ اَنَّ لِيْ بِكُمْ قُوَّةً …:} لوط علیہ السلام اس قوم میں ایک طرح سے اجنبی تھے، اللہ تعالیٰ نے انھیں اہل سدوم کی اصلاح کے لیے مقرر فرمایا تھا۔ اس وجہ سے انھوں نے اس تمنا کا اظہار کیا کہ کاش! مجھ میں تمھارے مقابلے کی قوت ہوتی، یا میں کسی مضبوط سہارے کی پناہ لیتا، یعنی میرا خاندان یہاں ہوتا تو میں تم سے نمٹ لیتا۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَرْحَمُ اللّٰهُ لُوْطًا لَقَدْ كَانَ يَأْوِيْ إِلٰی رُكْنٍ شَدِيْدٍ ] [ بخاری، أحادیث الأنبیاء، باب قولہ عزو جل : « و نبئھم عن ضیف إبراہیم » : ۳۳۷۲ ] ’’اللہ تعالیٰ لوط پر رحم کرے، یقینا وہ بہت مضبوط سہارے کی پناہ رکھتے تھے۔‘‘ یعنی وہ اللہ تعالیٰ کا سہارا رکھتے تھے جو سب سے مضبوط ہے اور اس وقت ان کے پاس فرشتوں کی شکل میں بھی مضبوط سہارا موجود تھا، اگرچہ انھیں معلوم نہ تھا۔ حافظ ابن حزم رحمہ اللہ نے {’’ اَلْفِصَلُ فِي الْمِلَلِ‘‘} میں کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے اس فرمان میں لوط علیہ السلام کی شان میں کمی کی کوئی بات نہیں، کیونکہ اسباب کا مہیا کرنا یا ان کی خواہش کرنا اللہ تعالیٰ پر توکل کے خلاف نہیں ہے۔ لوط علیہ السلام یقینا اللہ تعالیٰ کو اپنا سہارا سمجھتے تھے مگر اس وقت وہ ساتھی مہیا ہونے کی صورت میں فوری طور پر اس خبیث قوم کا راستہ قوتِ بازو کے ساتھ روکنے کے خواہش مند تھے۔ خود رسول اللہ صلی اللہ علیہ وسلم نے کئی لوگوں اور قبیلوں سے کہا کہ کون میری مدد کرتا اور مجھے جگہ دیتا ہے کہ میں اپنے رب کا پیغام پہنچاؤں۔ آخر کار انصار مدینہ نے آپ کی دعوت پر لبیک کہا اور اپنی جان و مال اور اولاد کی طرح آپ کی حفاظت اور آپ کا دفاع کیا اور اللہ تعالیٰ نے فرمایا : «{ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا كُوْنُوْۤا اَنْصَارَ اللّٰهِ كَمَا قَالَ عِيْسَى ابْنُ مَرْيَمَ لِلْحَوَارِيّٖنَ مَنْ اَنْصَارِيْۤ اِلَى اللّٰهِ قَالَ الْحَوَارِيُّوْنَ نَحْنُ اَنْصَارُ اللّٰهِ }» [ الصف : ۱۴ ] ’’اے لوگو جو ایمان لائے ہو! اللہ کے مددگار بن جاؤ، جس طرح عیسیٰ ابن مریم نے حواریوں سے کہا اللہ کی طرف میرے مددگار کون ہیں؟ حواریوں نے کہا ہم اللہ کے مددگار ہیں۔‘‘ اس لیے دنیاوی اسباب مہیا ہونے کی کوشش و خواہش جائز بلکہ مستحب ہے۔ ابوہریرہ رضی اللہ عنہ ہی سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فَمَا بَعَثَ اللّٰهُ بَعْدَهُ مِنْ نَبِيٍّ اِلَّا فِيْ ثَرْوَةٍ مِنْ قَوْمِهِ ] [ السلسلۃ الصحیحۃ : 152/4، ح : ۱۶۱۷ ] ’’پھر لوط علیہ السلام کے بعد اللہ نے جو نبی بھی بھیجا وہ اس کی قوم کے کثیر لوگوں میں سے بھیجا۔‘‘"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) ➊ {قَالُوْا يٰلُوْطُ اِنَّا رُسُلُ رَبِّكَ … :} قوم کے بدمعاش جب باز نہ آئے بلکہ دیوااریں پھلانگ کر یا دروازہ توڑ کر اندر آ گئے تو اللہ تعالیٰ نے سب کو اندھا کر دیا اور وہ وہاں سے بھاگ اٹھے۔ سورۂ قمر میں اس کی طرف اشارہ ہے، فرمایا : «{ وَ لَقَدْ رَاوَدُوْهُ عَنْ ضَيْفِهٖ فَطَمَسْنَاۤ اَعْيُنَهُمْ فَذُوْقُوْا عَذَابِيْ وَ نُذُرِ }» [ القمر : ۳۷ ] ’’اور بلاشبہ یقینا انھوں نے اسے اس کے مہمانوں سے بہکانے کی کوشش کی تو ہم نے ان کی آنکھیں مٹا دیں، پس چکھو میرا عذاب اور میرا ڈرانا۔‘‘ آیت کا مطلب یہ ہے کہ جب فرشتوں نے دیکھا کہ لوط علیہ السلام بالکل عاجز آ گئے ہیں اور اپنی قوم کے بدکاروں کو نہ روک سکنے کی وجہ سے سخت رنجیدہ ہیں تو انھوں نے ظاہر کر دیا کہ ہم آپ کے رب کے بھیجے ہوئے فرشتے ہیں، مزید تسلی یہ دی کہ یہ لوگ کبھی آپ کی گرد کو بھی نہیں پا سکتے۔ ¤ ➋ {فَاَسْرِ بِاَهْلِكَ بِقِطْعٍ مِّنَ الَّيْلِ …:} یعنی رات کے کسی حصے میں اپنے گھر والوں کو لے کر یہاں سے نکل جاؤ اور تم میں سے کوئی مڑ کر نہ دیکھے۔ صرف گھر والوں کو لے کر نکلنے کا حکم اس لیے دیا کہ کوئی اور شخص ان کے سوا مسلمان ہی نہیں ہوا تھا۔ دیکھیے سورۂ ذاریات ( ۳۵، ۳۶)۔ ¤ ➌ {اِلَّا امْرَاَتَكَ :} اس کی دو تفسیریں ہو سکتی ہیں، ایک تو یہ کہ {’’ فَاَسْرِ بِاَهْلِكَ ‘‘} سے استثنا ہے، یعنی اپنی بیوی کے سوا دوسرے گھر والوں کو لے کر نکل جاؤ۔ دوسری یہ کہ تم میں سے کوئی مڑ کر نہ دیکھے، مگر تمھاری بیوی مڑ کر دیکھے گی اور اپنے کفر اور قوم کی ہمدردی کی وجہ سے ان پر عذاب دیکھ کر آہ و پکار کرے گی تو اسے بھی وہی عذاب آ پہنچے گا جو ان کو پہنچا۔ پہلا معنی زیادہ قریب ہے۔ (واللہ اعلم) قدرتی بات ہے کہ انسان کو اپنے دشمن کی جلد از جلد بربادی کی خواہش ہوتی ہے، فرشتوں نے بتایا کہ ان پر عذاب صبح کے وقت آئے گا۔ لوط علیہ السلام کے مزید جلدی کے مطالبے پر انھوں نے کہا : «{ اَلَيْسَ الصُّبْحُ بِقَرِيْبٍ }» ’’کیا صبح واقعی قریب نہیں ہے؟‘‘ صبح کا وقت شاید اس لیے مقرر کیا گیا ہو کہ وہ آرام کا وقت ہوتا ہے اور لوگ کچھ کچھ جاگ رہے ہوتے ہیں۔ آرام کے وقت عذاب زیادہ تکلیف دہ ہوتا ہے اور ایسے وقت میں عذاب دیکھنے والوں کے لیے باعث عبرت بھی ہوتا ہے۔ (آلوسی) {’’ اَلَيْسَ الصُّبْحُ بِقَرِيْبٍ ‘‘} پر شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ہمارے نبی صلی اللہ علیہ وسلم کو مکہ فتح ہوا صبح کے وقت، شاید وہی اشارہ ہو۔‘‘ (موضح)"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) ➊ { فَلَمَّا جَآءَ اَمْرُنَا … : } یعنی جب ہمارے عذاب کا حکم آیا تو ہم نے اس بستی کے اوپر کا حصہ اس کا نیچے کا حصہ کر دیا، یعنی پوری بستی الٹ دی۔ یہ عذاب ان کے فعل شنیع سے مناسبت رکھتا تھا کہ انھوں نے بھی فطرت کو بدلا کہ عورتوں کو چھوڑ کر مردوں کو اپنی شہوت رانی کا ذریعہ بنا لیا۔ ¤ ➋ {سِجِّيْلٍ:} سنگ و گِل (پتھر اور مٹی کے ملے ہوئے ڈھیلے) یا سنگِ گِل (مٹی کے پتھر یعنی پختہ اینٹوں کے روڑے یا کھنگر) مزید عذاب کے طور پر بستی الٹنے کے بعد اس پر اینٹوں اور پتھروں کی ایسی مسلسل بارش برسائی کہ ان کی تہیں لگ گئیں۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) ➊ {مُسَوَّمَةً عِنْدَ رَبِّكَ :} ’’نشان لگے ہوئے‘‘ یعنی ان میں سے ہر پتھر پر کوئی علامت بنائی گئی تھی کہ اس سے کس کو ہلا ک کرنا ہے۔ (ابن کثیر) ¤ ➋ { وَ مَا هِيَ مِنَ الظّٰلِمِيْنَ بِبَعِيْدٍ :} اس کے دو معنی ہیں، ایک تو یہ کہ جو لوگ بھی ظلم کی روش پر چلیں گے (مثلاً مغربی اقوام اور ان کے پرستار جو دھڑلے سے اس فعل بد کا ارتکاب اور اس کی اشاعت کر رہے ہیں) ان پر بھی یہ عذاب آنا کچھ دور نہیں، یا الف لام عہد کا ہو تو ان ظالموں (یعنی رسول اللہ صلی اللہ علیہ وسلم کے زمانے کے کافروں) پر بھی نزول عذاب بعید از قیاس نہیں۔ اگر قوم لوط پر عذاب آ سکتا ہے تو ان پر بھی آ سکتا ہے۔ دوسرا معنی یہ ہے کہ وہ الٹی ہوئی بستیاں ان مکہ کے ظالموں سے کچھ دور نہیں، بلکہ ملک شام کو جاتے ہوئے دائمی آباد راستے میں ہیں، جن کی بے مثال بربادی یہ لوگ صبح و شام آتے جاتے دیکھتے ہیں۔ مزید دیکھیے سورۂ حجر (۷۶) اور صافات (۱۳۷، ۱۳۸) کے حواشی۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84) ➊ {وَ اِلٰى مَدْيَنَ اَخَاهُمْ شُعَيْبًاقَالَ يٰقَوْمِ … :} اس کی تفسیر کے لیے دیکھیے سورۂ اعراف (۸۵ تا ۹۳) اور سورۂ شعراء (۱۷۶ تا ۱۹۰) مکیال اور کیل سے مراد کسی مقرر پیمانے کے برتن مثلاً صاع (ٹوپہ وغیرہ) میں ڈال کر غلے وغیرہ کو ماپنا اور میزان اور وزن کا معنی ترازو وغیرہ سے تولنا ہے۔ ¤ ➋ { اِنِّيْۤ اَرٰىكُمْ :} یعنی تم اچھے خاصے خوش حال ہو، پھر اس قسم کی بے ایمانی اور فریب کاری کی کیا ضرورت ہے۔ ¤ ➌ { عَذَابَ يَوْمٍ مُّحِيْطٍ :} یعنی آخرت کا عذاب یا دنیا ہی میں اس دن کا عذاب جس کے گھیرے سے کوئی نکل نہ سکے گا۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 85) ➊ {وَ يٰقَوْمِ اَوْفُوا الْمِكْيَالَ وَ الْمِيْزَانَ بِالْقِسْطِ : } پہلے فرمایا کہ ماپ اور تول میں کمی نہ کرو، اب اس کی مزید تاکید فرمائی کہ ماپ اور تول پورا کرو، نہ دیتے وقت کم دو، نہ لیتے وقت زیادہ لو۔ مزید دیکھیے سورۂ مطففین (۱ تا ۳)۔ ¤ ➋ { وَ لَا تَبْخَسُوا النَّاسَ اَشْيَآءَهُمْ :} پہلے ماپ تول کا خاص طور پر ذکر فرمایا، اب لینے دینے کے ہر طریقے کو ان الفاظ کے ذریعے سے شامل کر لیا، مثلاً کسی بھی طرح کے میٹروں کے ذریعے، یا گننے کے ذریعے، غرض کسی بھی طرح لوگوں کو ان کی چیز کم مت دو، نہ زیادہ لو۔ ¤ ➌ {وَ لَا تَعْثَوْا فِي الْاَرْضِ مُفْسِدِيْنَ : ’’عَثِيَ يَعْثٰي‘‘} بروزن{ ’’رَضِيَ يَرْضٰي‘‘ } حد سے بڑھ کر فساد کرنا، مثلاً ان کی عادت تھی کہ اگر کم ماپ تول کے خلاف کوئی شخص احتجاج کرتا تو سب مل کر اس پر حملہ آور ہو جاتے۔ اسی طرح موقع ملتا تو ڈاکے مارتے اور لوگوں سے چیزیں چھین لیتے۔ خلاصہ یہ کہ شعیب علیہ السلام نے انھیں ہر قسم کے فساد سے منع فرمایا۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86) ➊ {بَقِيَّتُ اللّٰهِ خَيْرٌ لَّكُمْ …: } یعنی بے ایمانی سے جمع کردہ مال سے اتنی بچت اور منافع ہر طرح سے بہتر ہے جو اللہ کے حکم کے مطابق حاصل ہو۔ {’’ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ ‘‘} (بشرطیکہ تم مومن ہو) کیونکہ کافر کے نیک اعمال بھی قیامت کے دن اس کے کسی کام نہیں آئیں گے۔ دیکھیے سورۂ کہف (۱۰۵)۔ ¤ ➋ {وَ مَاۤ اَنَا عَلَيْكُمْ بِحَفِيْظٍ:} یعنی میں تم پر نگران تو نہیں ہوں جو ہر وقت تمھارے ناپ تول کو دیکھتا رہوں اور نہ یہ میرے بس میں ہے۔ ہر ایک کے ایک ایک لمحہ پر نظر تو صرف رب تعالیٰ کی ہے، میرا کام تو تمھیں سمجھا دینا اور اللہ کے عذاب سے ڈرا دینا ہے، ماننا نہ ماننا تمھارا کام ہے۔"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) ➊ {قَالُوْا يٰشُعَيْبُ اَصَلٰوتُكَ …:} یعنی کیا تو اپنی نماز کا دائرۂ عمل اس قدر وسیع سمجھتا ہے کہ دوسروں کے مذہبی اور مالی معاملات میں بھی دخل دینے لگا ہے۔ ہماری مرضی ہے جس کی چاہیں پوجا اور جس کی چاہیں بندگی کریں اور یہ مال جو ہمارے اپنے ہیں، ان میں جس طرح چاہیں تصرف کریں، جائز و ناجائز جیسے چاہیں کمائیں، کوئی ہمیں کیوں ٹوکے! یہ وہی سیکولر سوچ ہے جو آج کل بھی چل رہی ہے کہ نماز اور دین ہر شخص کا ذاتی مسئلہ ہے۔ مملکت اور دنیا کے معاملات میں اللہ تعالیٰ کے احکام کے ہم پابند نہیں۔ بے شک دین سود سے روکتا ہے مگر ساری دنیا کی معیشت اس پر چل رہی ہے، دین کا اس میں کیا دخل؟ پھر کوئی شرک کرے، کفر کرے یا موحد ہو، اللہ تعالیٰ کو مانے یا نہ مانے، کسی کو اس سے کیا غرض۔ بس مملکت کے جو قانون خود لوگوں نے اکثریت سے بنائے ہیں، ان کی پابندی لازم ہے، باقی کسی پر کوئی پابندی نہیں۔ حقیقت یہ ہے کہ یہ اللہ تعالیٰ کی اتنی بڑی بغاوت ہے کہ اگر رسول اللہ صلی اللہ علیہ وسلم کی دعا نہ ہوتی کہ یا اللہ! میری امت (دعوت و اجابت) کو عام عذاب سے ہلاک نہ کرنا تو کب کا عذاب آ چکا ہوتا۔ ¤ ➋ {اِنَّكَ لَاَنْتَ الْحَلِيْمُ الرَّشِيْدُ:} اس کے کئی مطلب ہو سکتے ہیں، ایک یہہ کہ تم تو خاندان میں بڑے بردبار اور نہایت سمجھ دار سمجھے جاتے ہو، تمھیں کیا ہو گیا کہ ایسی اکھڑی اکھڑی باتیں کرنے لگے ہو۔ دوسرا یہ کہ دراصل وہ انھیں ٹھٹھے اور مذاق سے یہ کہہ رہے تھے، مقصد ان کا انھیں نہایت بے حوصلہ اور نادان کہنا تھا۔ صاحب کشاف نے اس کی مثال دی کہ جیسے کوئی شخص کسی سخت بخیل آدمی کو کہے کہ تمھاری سخاوت کا کیا کہنا، اگر تمھیں حاتم طائی دیکھے تو وہ بھی تمھارے آگے سر جھکا دے۔ ایک معنی یہ ہے کہ بس تو ہی ایک عقل مند اور نیک چلن رہ گیا ہے؟ باقی ہم اور ہمارے باپ دادا جاہل اور احمق ہی رہے؟ یہ بھی استہزا اور تمسخر کی ایک صورت تھی۔ (ابن کثیر) شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’جاہلوں کا دستور ہے کہ نیکوں کے کام آپ نہ کر سکیں تو انھی کو لگیں چڑانے، یہی خصلت ہے کفر کی۔‘‘ (موضح)"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) ➊ {قَالَ يٰقَوْمِ اَرَءَيْتُمْ اِنْ كُنْتُ …:’’ بَيِّنَةٍ ‘‘} وہ دلیل جس کے ساتھ حق اور باطل واضح اور الگ الگ ہو جائے۔ {’’ رِزْقًا حَسَنًا ‘‘} یہ لفظ تین چیزوں کے لیے آیا ہے، یعنی اللہ تعالیٰ کی عطا کردہ نبوت، حلال روزی اور صاف ستھری پاکیزہ زندگی۔ یہاں {’’ اَرَءَيْتُمْ ‘‘} کا جواب محذوف ہے، یعنی اے میری قوم! یہ بتاؤ اگر میں اپنے رب کی طرف سے واضح دلیل پر قائم ہوں اور اس نے مجھے رزق حسن دیا ہو تو کیا میں اسے چھوڑ کر تمھاری طرح حرام کھانے لگوں اور تمھیں نیکی کا حکم دینا اور برائی سے منع کرنا چھوڑ دوں؟ {’’ رِزْقًا حَسَنًا ‘‘} سے معلوم ہو رہا ہے کہ شعیب علیہ السلام عطائے نبوت کے ساتھ ساتھ حلال روزی کے ذریعے سے اچھے خاصے مال دار آدمی تھے۔ ¤ ➋ { وَ مَاۤ اُرِيْدُ اَنْ اُخَالِفَكُمْ … :} یعنی میں جو تمھیں اللہ کے ساتھ شرک سے اور ماپ تول میں کمی سے منع کر رہا ہوں، اس کا مقصد ہر گز یہ نہیں ہے کہ تمھیں تو اس سے باز رہنے کی تلقین کروں اور خود اس کا ارتکاب کرتا رہوں، بلکہ میں تم سے جو بات بھی کہتا ہوں، پہلے خود اس پر عمل کرتا ہوں۔ تمام انبیاء علیھم السلام کا اور سلف صالحین کا بھی یہی شیوہ رہا ہے۔ اس کے برعکس کرنے والوں کا انجام حدیث میں یوں ہے، اسامہ بن زید رضی اللہ عنھما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُجَاءُ بِالرَّجُلِ يَوْمَ الْقِيَامَةِ فَيُلْقَی فِي النَّارِ فَتَنْدَلِقُ أَقْتَابُهٗ فِي النَّارِ، فَيَدُوْرُ كَمَا يَدُوْرُ الْحِمَارُ بِرَحَاهٗ فَيَجْتَمِعُ أَهْلُ النَّارِ عَلَيْهِ فَيَقُوْلُوْنَ يَا فُلَانُ! مَاا شَأْنُكَ ؟ أَلَيْسَ كُنْتَ تَأْمُرُ بِالْمَعْرُوْفِ وَتَنْهَاانَا عَنِ الْمُنْكَرِ؟ قَالَ كُنْتُ آمُرُكُمْ بِالْمَعْرُوْفِ وَلاَ آتِيْهِ، وَأَنْهَاكُمْ عَنِ الْمُنْكَرِ وَآتِيْهِ ] [ بخاری، بددء الخلق، باب صفۃ النار و أنھا مخلوقۃ : ۳۲۶۷ ] ’’ایک آدمی کو قیامت کے دن لایا جائے گا اور آگ میں پھینک دیا جائے گا۔ اس کی انتڑیاں تیزی سے باہر نکل پڑیں گی تو وہ اس طرح گھومے گا جیسے گدھا اپنی چکی کے گرد گھومتا ہے، تو جہنمی اس پر اکٹھے ہو جائیں گے اور کہیں گے، اے فلاں! تیرا کیا معاملہ ہے؟ کیا تو ہمیں نیکی کا حکم نہیں دیتا تھا اور ہمیں برائی سے منع نہیں کرتا تھا؟ وہ کہے گا، میں تمھیں نیکی کا حکم دیتا تھا اور خود وہ نیکی نہیں کرتا تھا اور تمھیں برائی سے منع کرتا تھا اور خود اس کا ارتکاب کرتا تھا۔‘‘ ¤ ➌ { اِنْ اُرِيْدُ اِلَّا الْاِصْلَاحَ مَا اسْتَطَعْتُ :} تاکہ تمھارا دنیا و آخرت میں بھلا ہو۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یہ خصلت ہے اللہ کے نیک لوگوں کی کہ چڑانے سے برا نہ مانا اور اپنے مقدور بھر سمجھاتے رہے۔‘‘ ¤ ➍ { وَ مَا تَوْفِيْقِيْۤ اِلَّا بِاللّٰهِ :} یعنی آج میں تمھیں جو نصیحت کر رہا ہوں یا کرنا چاہتا ہوں، اس کو جاری رکھنے اور اس کی کامیابی کا دارو مدار اللہ ہی پر ہے۔"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 89) ➊ {وَ يٰقَوْمِ لَا يَجْرِمَنَّكُمْ شِقَاقِيْۤ …:’’شِقَاقٌ شِقٌّ‘‘} سے باب مفاعلہ کا مصدر ہے، بمعنی جانب، یعنی دونوں ایک دوسرے کے مخالف سمت میں آمنے سامنے ہو جائیں، یعنی صاف مخالفت اور مقابلے پر اتر آنا۔ {’’ لَا يَجْرِمَنَّكُمْ ‘‘ } تمھیں آمادہ نہ کر دے، تمھیں ابھار نہ دے، تمھیں اس بات کا مجرم نہ بنا دے، تمھارے لیے اس کا باعث نہ بن جائے، یہ تمام معانی ہو سکتے ہیں۔ ¤ ➋ { وَ مَا قَوْمُ لُوْطٍ مِّنْكُمْ بِبَعِيْدٍ :} یعنی اگر تمھیں قوم نوح کے غرق ہونے، قوم ہود کے آندھی کے ساتھ ہلاک ہونے اور قوم صالح کے چیخ اور زلزلے سے نیست و نابود ہونے سے عبرت نہیں ہوئی، کیونکہ ان کا علاقہ یا زمانہ تم سے دور تھا، تو لوط علیہ السلام کی قوم تو تم سے کچھ دور نہیں، نہ اسے زیادہ وقت گزرا ہے اور نہ ان کا علاقہ تمھارے علاقے سے کچھ دور ہے۔ واضح رہے کہ جغرافیائی اعتبار سے بھی مدین کا علاقہ اس زمین سے متصل واقع تھا جہاں لوط علیہ السلام کی قوم بستی تھی۔"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت 90) {اِنَّ رَبِّيْ رَحِيْمٌ وَّدُوْدٌ :} یعنی میرا رب اپنے بندوں پر نہایت رحم کرنے والا، بہت محبت کرنے والا ہے، اسی لیے اس نے تمھیں پہلے خبردار کرنے کا انتظام فرمایا کہ تم آئندہ کے لیے باز آ جاؤ اور پچھلے کی معافی مانگو اور اپنے اعمال کے انجام بد سے بچ جاؤ۔"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت 91) ➊ {قَالُوْا يٰشُعَيْبُ مَا نَفْقَهُ … : ’’ فَقِهَ يَفْقَهُ ‘‘} (ع) متکلم کی بات کا مطلب سمجھنا۔ یہ بات انھوں نے استہزا اور تحقیر، یعنی شعیب علیہ السلام اور ان کے کلام کو بے وقعت قرار دینے کے لیے کہی، یا اللہ تعالیٰ کی نافرمانی کرتے کرتے ان کے ذہن اس قدر مسخ ہو چکے تھے کہ شعیب علیہ السلام کی سیدھی باتیں بھی واقعتا ان کے ذہن میں نہیں آتی تھیں، حالانکہ شعیب علیہ السلام نہ کسی غیر زبان میں گفتگو کرتے تھے اور نہ ان کا انداز بیان ہی پیچیدہ اور الجھا ہوا تھا، بلکہ شعیب علیہ السلام کی گفتگو سے صاف پتا چل رہا ہے کہ وہ کتنے بڑے فصیح اللسان خطیب تھے۔ مفسر ابوالسعود کے کلام کا خلاصہ یہ ہے کہ انھوں نے یہ بات کہ ’’ہم تیری بات کا مطلب ہی نہیں سمجھتے‘‘ اس وقت کہی جب وہ بہترین اور بلیغ ترین طریقے سے شعیب علیہ السلام سے حق اور اس کے ایسے واضح دلائل سن چکے جن کا ان کے پاس کوئی جواب نہ تھا۔ اب اس سے آگے ان کے پاس کوئی بات باقی ہی نہ تھی جو وہ کہہ سکتے، تو جس طرح کوئی بندہ لاجواب ہو کر بدزبانی، گالی گلوچ اور دھمکیوں پر اتر آتا ہے، یہی کام انھوں نے کیا۔ ¤ ➋ { وَ اِنَّا لَنَرٰىكَ فِيْنَا ضَعِيْفًا :} یعنی نہ تیرے پاس فوج ہے، نہ حکومت اور نہ کرّو فر۔ ¤ ➌ { وَ لَوْ لَا رَهْطُكَ لَرَجَمْنٰكَ : } جو ہمارے دین پر ہیں، لیکن تیری پشت پناہی کر رہے ہیں۔ ¤ ➍ {وَ مَاۤ اَنْتَ عَلَيْنَا بِعَزِيْزٍ: ’’عَزِيْزٌ‘‘} معزز، ممحبوب اور قوی، یعنی تو ہم پر کسی طرح بھی عزیز نہیں ہے، نہ ہم تمھاری کچھ عزت سمجھتے ہیں، نہ ہمیں تجھ سے کوئی محبت ہے اور نہ تو ہم سے طاقت میں بڑھ کر ہے۔ غرض تجھے سنگسار کرنا ہمیں کچھ بھی مشکل نہیں، اگر تیرے قبیلے کے لوگ جو ہمارے ہی دین پر ہیں، تیری پشت پر نہ ہوتے تو ہم ضرور تجھے سنگسار کر دیتے۔ جس زمانے میں یہ آیات نازل ہوئیں بالکل وہی صورت حال نبی صلی اللہ علیہ وسلم کو مکہ معظمہ میں درپیش تھی۔ قریش آپ صلی اللہ علیہ وسلم کے خون کے پیاسے ہو رہے تھے اور ہر ممکن طریقے سے آپ کی زندگی کا خاتمہ کرنا چاہتے تھے، لیکن چونکہ بنو ہاشم آپ کی پشت پر تھے اور خاص طور پر آپ کے چچا ابوطالب آپ کی پوری طرح حفاظت کر رہے تھے، اس لیے قریش کو آپ پر ہاتھ ڈالنے کی جرأت نہ ہو سکی۔"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت 92) ➊ {قَالَ يٰقَوْمِ اَرَهْطِيْۤ اَعَزُّ عَلَيْكُمْ …:’’ ظِهْرِيًّا ‘‘ ’’ ظَهْرٌ ‘‘} کی ططرف منسوب ہے، نسبت کی وجہ سے ظاء پر کسرہ آگیا ہے۔ یہاں سے شعیب علیہ السلام کا لہجہ کچھ سختی میں بدل جاتا ہے، فرماتے ہیں، کیا میری برادری تمھارے نزدیک اللہ سے بھی زیادہ معزز اور قوی ہے، جس نے مجھے رسول بنا کر بھیجا ہے؟ اس ہر شے کے مالک کو تو تم نے ایسے سمجھ رکھا ہے جیسے کوئی بے وقعت چیز پیٹھ پیچھے پھینک دی گئی ہوتی ہے۔ مقصد یہ کہ اللہ کے بھیجے ہوئے کی پروا نہ کرنا دراصل اللہ تعالیٰ کی بے وقعتی اور بے قدری کرنا ہے۔ ¤ ➋ { اِنَّ رَبِّيْ بِمَا تَعْمَلُوْنَ مُحِيْطٌ :} وہ تمھارے تمام اعمال (جن میں ان کے اقوال، ارادے، سازشیں اور وہ سب کچھ شامل ہے جو وہ شعیب علیہ السلام کے خلاف کر رہے تھے) سے پوری طرح واقف ہے، کوئی چیز اس کے احاطے سے باہر نہیں۔"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت93){وَ يٰقَوْمِ اعْمَلُوْا عَلٰى مَكَانَتِكُمْ …:} اس آیت میں لہجہ پچھلی آیت سے بھی سخت ہے، کیونکہ شعیب علیہ السلام ان کے اللہ تعالیٰ کی سطوت و عزت سے بے بس انسانوں کی عزت و سطوت زیادہ سمجھنے اور ان کے ایمان لانے سے ناامید ہونے پر انھیں اللہ کے عذاب کی دھمکی دے رہے ہیں کہ تم اپنی جگہ عمل کرو، میں بھی اپنے رب کے بتائے ہوئے طریقے پر دعوت کا کام جاری رکھوں گا۔ نتیجہ بہت جلد سامنے آ جائے گا۔ ان دونوں آیات میں کفار کی ان تمام باتوں کا جواب موجود ہے جو پچھلی آیت میں ذکر ہوئی ہیں کہ تمھاری بہت سی باتیں ہماری سمجھ سے باہر ہیں، ہم تجھے اپنے میں کمزور دیکھتے ہیں، صرف اپنی برادری کی وجہ سے تو سنگسار ہونے سے بچا ہوا ہے، ورنہ ہمارے ہاں تیری نہ کوئی عزت ہے نہ طاقت۔ فرمایا، بہت جلد ان تمام باتوں کا فیصلہ ہو جائے گا۔ کس کی قوت زیادہ ہے، کون سنگسار ہوتا ہے، کون سچا ہے اور کون جھوٹا، فیصلہ ہو چکا، اب صرف یہ دیکھنا باقی ہے کہ یہ فیصلہ کس طرح عمل میں آتا ہے۔ سو تم بھی انتظار کرو میں بھی تمھارے ساتھ منتظر ہوں۔"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت95،94) ➊ {وَ لَمَّا جَآءَ اَمْرُنَا نَجَّيْنَا شُعَيْبًا … :} یہ اللہ تعالیٰ کے ہر قوم پر آنے والے عذاب کی عجیب صفت ہے کہ اس نے اہل ایمان کو کچھ نقصان نہیں پہنچایا، نہ آندھی نے، نہ چیخ نے اور نہ زلزلے نے۔ صرف کفار اور ظالم مشرک ہی اس سے برباد ہوئے۔ دیکھیے اسی سورت کی آیت (۵۷) کی تفسیر۔ ¤ ➋ اللہ کے حکم سے آنے والے اس عذاب کو سورۂ اعراف (۹۱) اور عنکبوت (۳۷) میں {’’ الرَّجْفَةُ “} یعنی زلزلہ فرمایا، یہاں {’’الصَّيْحَةُ ‘‘} یعنی چیخ فرمایا اور سورۂ شعراء (۱۸۹) میں {’’ عَذَابُ يَوْمِ الظُّلَّةِ ‘‘} سائبان کے دن والا عذاب فرمایا۔ اس لیے زیادہ واضح بات یہی نظر آتی ہے کہ پہلے {’’ الصَّيْحَةُ ‘‘} چنگھاڑ یا سخت چیخ بلند ہوئی، جب وہ حد سے گزری تو شدید زلزلہ آگیا جس نے پہاڑوں کو بھی ہلا کر رکھ دیا اور اس آواز سے کفار کے دل اور جگر پھٹ گئے اور جو جہاں تھا وہیں پڑا رہ گیا۔ زلزلے نے باقی کسر پوری کر دی اور تمام کفار کا نام و نشان اس طرح مٹا جیسے وہ یہاں کبھی رہے ہی نہ تھے۔ آج بھی مدین کے علاقے میں سیکڑوں میل تک جو پہاڑ پائے جاتے ہیں ان پر زلزلے کے آثار واضح ہیں۔ تمام پہاڑ اس طرح پھٹے ہوئے ہیں جیسے کسی زبردست زلزلے نے انھیں کھیل کھیل کر دیا ہو۔ حافظ ابن کثیر رحمہ اللہ نے فرمایا کہ یہ تمام عذاب ان پر آئے مگر آیات کے سیاق میں ہر مقام کے مطابق جو عذاب تھا اس کا ذکر ہوا۔ سورۂ اعراف (۸۸) میں کفار کا قول ذکر ہوا تھا : «{ لَنُخْرِجَنَّكَ يٰشُعَيْبُ وَ الَّذِيْنَ اٰمَنُوْا مَعَكَ مِنْ قَرْيَتِنَاۤ }» ’’اے شعیب! ہم تجھے اور تجھ پر ایمان لانے والوں کو اپنی بستی سے نکال دیں گے۔‘‘ وہاں {’’الرَّجْفَةُ‘‘} کا ذکر ہے کہ یہ ہے وہ بستی جہاں سے تم نبی کو نکالنا چاہتے تھے۔ یہاں سورۂ ہود میں جب انھوں نے پیغمبر کی گستاخی کی تو اس کی مناسبت سے چیخ کا ذکر فرمایا اور سورۂ شعراء میں ان کا مطالبہ تھا کہ ہم پر آسمان کا ٹکڑا گرا دے تو وہاں سائبان والے عذاب کا ذکر فرمایا۔ ¤ ➌ { اَلَا بُعْدًا لِّمَدْيَنَ كَمَا بَعِدَتْ ثَمُوْدُ :} یعنی قوم شعیب پر ویسی ہی ہلاکت مسلط ہوئی جیسی ثمود پر ہوئی، ان کے علاقے بھی ایک دوسرے کے قریب تھے اور کفر و سرکشی میں بھی دونوں قومیں ایک جیسی تھیں اور دونوں عرب تھے۔"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت95،94) ➊ {وَ لَمَّا جَآءَ اَمْرُنَا نَجَّيْنَا شُعَيْبًا … :} یہ اللہ تعالیٰ کے ہر قوم پر آنے والے عذاب کی عجیب صفت ہے کہ اس نے اہل ایمان کو کچھ نقصان نہیں پہنچایا، نہ آندھی نے، نہ چیخ نے اور نہ زلزلے نے۔ صرف کفار اور ظالم مشرک ہی اس سے برباد ہوئے۔ دیکھیے اسی سورت کی آیت (۵۷) کی تفسیر۔ ¤ ➋ اللہ کے حکم سے آنے والے اس عذاب کو سورۂ اعراف (۹۱) اور عنکبوت (۳۷) میں {’’ الرَّجْفَةُ “} یعنی زلزلہ فرمایا، یہاں {’’الصَّيْحَةُ ‘‘} یعنی چیخ فرمایا اور سورۂ شعراء (۱۸۹) میں {’’ عَذَابُ يَوْمِ الظُّلَّةِ ‘‘} سائبان کے دن والا عذاب فرمایا۔ اس لیے زیادہ واضح بات یہی نظر آتی ہے کہ پہلے {’’ الصَّيْحَةُ ‘‘} چنگھاڑ یا سخت چیخ بلند ہوئی، جب وہ حد سے گزری تو شدید زلزلہ آگیا جس نے پہاڑوں کو بھی ہلا کر رکھ دیا اور اس آواز سے کفار کے دل اور جگر پھٹ گئے اور جو جہاں تھا وہیں پڑا رہ گیا۔ زلزلے نے باقی کسر پوری کر دی اور تمام کفار کا نام و نشان اس طرح مٹا جیسے وہ یہاں کبھی رہے ہی نہ تھے۔ آج بھی مدین کے علاقے میں سیکڑوں میل تک جو پہاڑ پائے جاتے ہیں ان پر زلزلے کے آثار واضح ہیں۔ تمام پہاڑ اس طرح پھٹے ہوئے ہیں جیسے کسی زبردست زلزلے نے انھیں کھیل کھیل کر دیا ہو۔ حافظ ابن کثیر رحمہ اللہ نے فرمایا کہ یہ تمام عذاب ان پر آئے مگر آیات کے سیاق میں ہر مقام کے مطابق جو عذاب تھا اس کا ذکر ہوا۔ سورۂ اعراف (۸۸) میں کفار کا قول ذکر ہوا تھا : «{ لَنُخْرِجَنَّكَ يٰشُعَيْبُ وَ الَّذِيْنَ اٰمَنُوْا مَعَكَ مِنْ قَرْيَتِنَاۤ }» ’’اے شعیب! ہم تجھے اور تجھ پر ایمان لانے والوں کو اپنی بستی سے نکال دیں گے۔‘‘ وہاں {’’الرَّجْفَةُ‘‘} کا ذکر ہے کہ یہ ہے وہ بستی جہاں سے تم نبی کو نکالنا چاہتے تھے۔ یہاں سورۂ ہود میں جب انھوں نے پیغمبر کی گستاخی کی تو اس کی مناسبت سے چیخ کا ذکر فرمایا اور سورۂ شعراء میں ان کا مطالبہ تھا کہ ہم پر آسمان کا ٹکڑا گرا دے تو وہاں سائبان والے عذاب کا ذکر فرمایا۔ ¤ ➌ { اَلَا بُعْدًا لِّمَدْيَنَ كَمَا بَعِدَتْ ثَمُوْدُ :} یعنی قوم شعیب پر ویسی ہی ہلاکت مسلط ہوئی جیسی ثمود پر ہوئی، ان کے علاقے بھی ایک دوسرے کے قریب تھے اور کفر و سرکشی میں بھی دونوں قومیں ایک جیسی تھیں اور دونوں عرب تھے۔"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت 96){وَ لَقَدْ اَرْسَلْنَا مُوْسٰى بِاٰيٰتِنَا وَ سُلْطٰنٍ مُّبِيْنٍ : } اللہ تعالیٰ نے موسیٰ علیہ السلام کو فرعون اور اس کے سرداروں کی طرف اپنی جو آیات اور {’’ سُلْطٰنٍ مُّبِيْنٍ ‘‘} (واضح دلیل) دے کر بھیجا تھا، ان سے کیا مراد ہے؟ اس کا ایک جواب تو یہ ہے کہ موسیٰ علیہ السلام کو اللہ تعالیٰ نے نو آیات بینات دی تھیں (دیکھیے بنی اسرائیل : ۱۰۱) جو وقتاً فوقتاً ظاہر ہوئیں : 1 عصائے موسیٰ 2 یدِ بیضا 3 سنین (قحط سالیاں) 4 نقص من الثمرات 5 طوفان 6 جراد 7 قمل 8 ضفادع 9 دَم انھی کو {’’ سُلْطٰنٍ مُّبِيْنٍ ‘‘} کہا گیا ہے۔ واؤ ہمیشہ مغایرت کے لیے نہیں ہوتی، جیسا کہ سورۂ عصر میں فرمایا : «{ اِلَّا الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ وَ تَوَاصَوْا بِالْحَقِّ وَ تَوَاصَوْا بِالصَّبْرِ } » اس میں ہر بعد والی چیز اپنے سے پہلے والی تمام چیزوں میں داخل اور اس کا حصہ ہے۔ ¤ ایک جواب یہ ہے کہ {’’ سُلْطٰنٍ مُّبِيْنٍ ‘‘} سے مراد عصائے موسیٰ اور ید بیضا ہیں، جو سب سے پہلے موسیٰ علیہ السلام نے فرعون کے سامنے اپنی نبوت کی دلیل کے طور پر پیش کیے۔ ان کی خصوصیت کے پیش نظر انھیں علیحدہ بھی ذکر فرمایا، حالانکہ یہ آیات میں داخل تھے اور ایک جواب یہ کہ{ ’’ سُلْطٰنٍ مُّبِيْنٍ ‘‘ } سے مراد اللہ تعالیٰ کا وہ پیغام ہے جو موسیٰ اور ہارون علیھما السلام فرعون کے پاس لے کر گئے اور وہ عقلی اور فطری دلائل ہیں جو لاٹھی پھینکنے سے پہلے موسیٰ علیہ السلام نے فرعون سے بحث کے دوران پیش فرمائے اور وہ ان دلائل سے لاجواب ہو کر قید کی دھمکی دینے لگا اور معجزے کا مطالبہ کرنے لگا۔ دیکھیے سورۂ طٰہٰ (۴۷ تا ۵۵) اور شعراء (۱۵ تا ۲۹) یہ تینوں تفسیریں صحیح ہیں۔ بعض حضرات نے {’’ بِاٰيٰتِنَا ‘‘} سے مراد نو معجزے اور {’’ سُلْطٰنٍ مُّبِيْنٍ ‘‘} سے مراد تورات بیان کی ہے، مگر تورات تو فرعون کے غرق ہونے کے بعد نازل ہوئی، اس لیے یہ تفسیر صحیح نہیں۔"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت 97) ➊ { اِلٰى فِرْعَوْنَ وَ مَلَاۡىِٕهٖ …:} یہاں فرعون کے ساتھ اس کے سرداروں کا ذکر اس لیے کیا ہے کہ وہی اس کے احکام کو نافذ کرنے والے تھے۔ بقول زمخشری ان کی جہالت کا اندازہ اس سے لگائیے کہ وہ فرعون کے احکام کے پیچھے لگے رہے، حالانکہ وہ احکام عقل کے صریح خلاف تھے، مثلاً اپنے جیسے ایک انسان کے رب اعلیٰ ہونے کا دعویٰ مان لینا جس میں ہر انسانی کمزوری پائی جاتی ہے اور حد سے بڑھ کر ظلم وستم، مثلاً معصوم بچوں کو قتل کرنے وغیرہ کے حکم پر عمل کرنا، مگر فرعون نے انھیں اس قدر ہلکا اور ذلیل کیا ہوا تھا کہ وہ موسیٰ علیہ السلام کے واضح معجزات دیکھنے کے باوجود فرعون ہی کے پیچھے لگے رہے، کیونکہ موسیٰ علیہ السلام پر ایمان لانے میں انھیں اپنا فسق (نافرمانی) چھوڑنا پڑتا تھا، فرمایا : «{ فَاسْتَخَفَّ قَوْمَهٗ فَاَطَاعُوْهُ اِنَّهُمْ كَانُوْا قَوْمًا فٰسِقِيْنَ }» [ الزخرف : ۵۴ ] ’’غرض اس نے اپنی قوم کو ہلکا (اور بے وزن) کر دیا تو انھوں نے اس کی اطاعت کر لی، یقینا وہ نافرمان لوگ تھے۔‘‘ ¤ ➋ {وَ مَاۤ اَمْرُ فِرْعَوْنَ بِرَشِيْدٍ : ’’ رَشَدَ ‘‘} (ن، ف) سے {’’ رَشِيْدٌ ‘‘} وہ شخص جس کی رائے درست اور سوچ اچھی ہو، یہاں فرعون کے حکم کو فرمایا کہ وہ ہرگز کسی طرح درست نہ تھا، بلکہ واضح طور پر گمراہی پر مبنی تھا۔ اتنی تاکید نفی کی باء اور {’’ بِرَشِيْدٍ ‘‘} کی تنوین سے حاصل ہو رہی ہے۔"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت 98) ➊ {يَقْدُمُ قَوْمَهٗ يَوْمَ الْقِيٰمَةِ …:’’ قَدِمَ يَقْدَمُ} (ع) آنا اور {’’ قَدَمَ يَقْدُمُ ‘‘} (ن) آگے ہونا۔{’’ فَاَوْرَدَهُمُ ‘‘ ’’وِرْدٌ‘‘} (واؤ کے کسرہ کے ساتھ) وہ پانی جسے پینے کے لیے لوگ اور جانور آتے ہوں، یعنی گھاٹ۔ {’’ اَوْرَدَ ‘‘} باب افعال سے ماضی معلوم ہے، یعنی جس طرح دنیا میں وہ اپنے لوگوں کا پیشوا تھا، اسی طرح آخرت میں بھی ان کا پیشوا ہو گا اور پینے کے لیے انھیں لے کر پانی کے گھاٹ پر جانے کے بجائے خود آگے ہو کر سب کو آگ میں لے جائے گا۔ یہی حال ان تمام لوگوں کا ہو گا جو کسی قوم کی رہنمائی کفر اور معصیت کی طرف کرتے ہیں کہ وہ انھی کی قیادت میں چل کر جہنم میں داخل ہوں گے۔ {’’ يَقْدُمُ ‘‘} مضارع ہے، آگے ہو گا، اس کے بعد مضارع {’’ يُوْرِدُهُمْ ‘‘} (انھیں آگ پرلے آئے گا) کے بجائے {’’ فَاَوْرَدَهُمُ النَّارَ ‘‘} (وہ انھیں آگ پر لے گیا) ماضی کا لفظ یقین کے لیے استعمال فرمایا۔ ¤ ➋ {وَ بِئْسَ الْوِرْدُ الْمَوْرُوْدُ:} پینے کی جگہ تو لوگ پیاس بجھانے کے لیے جاتے ہیں، مگر وہاں پانی کے بجائے آگ سے ان کی مہمان داری کی جائے گی۔ (والعیاذ باللہ)"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت 99) ➊ {وَ اُتْبِعُوْا فِيْ هٰذِهٖ لَعْنَةً …:} یعنی آگ کے علاوہ انھیں یہ سزا بھی دی گئی کہ رہتی دنیا تک لوگ ان پر پھٹکار بھیجتے رہیں گے اور قیامت کے دن ان پر جو پھٹکار پڑے گی اس کا حال تو معلوم ہی ہے۔ ان آیات میں فرعون کو صریح دوزخی بتایا گیا ہے، مگر بعض لوگوں نے اسلام کو مٹانے کے لیے تصوف کے پردے میں وحدت الوجود کا عقیدہ ایجاد کیا اور کہا کہ ہر چیز ہی درحقیقت اللہ تعالیٰ ہے، سو فرعون{’’ اَنَا رَبُّكُمُ الْاَعْليٰ ‘‘} کہنے میں غلط نہ تھا۔ ان لوگوں کے نزدیک حسین بن منصور حلاج، جسے عام طور پر منصور کہتے ہیں، کامل ولی تھا، کیونکہ وہ کہتا تھا کہ میں خدا ہوں۔ وہ اصل حقیقت کو پا گیا تھا اور صاف کہتا تھا کہ {’’ أَنَا الْحَقُّ ‘‘} مگر اس وقت اسلام کے محافظ خلیفۂ وقت نے اس کفریہ عقیدے کے ثابت ہونے پر اسے سولی پر چڑھا دیا۔ ان وجودی ملحدوں کے کہنے کے مطابق وہ سولی پر چڑھ گیا، مگر حق کہنے سے باز نہ آیا۔ ایسے کفر یہ الفاظ اور عقیدے پر اللہ کی پھٹکار جس کے نتیجے میں خالق و مخلوق کا فرق ختم، جنت و دوزخ کا فرق ختم اور شریعت کا ہر حکم ہی ختم ہو جاتا ہے۔ جب کہا جائے کہ فرعون اپنی سرکشی کی پاداش میں سمندر میں غرق کر دیا گیا تو وہ کہتے ہیں کہ فرعون دراصل بحر توحید میں غرق تھا۔ غرض اس طرح کی صریح کفر کی باتیں جو صاف قرآن کے خلاف ہیں، کہتے ہیں، مگر مسلمانوں میں شامل رہنے اور انھیں گمراہ کرنے کے لیے اسلام کا لبادہ اوڑھے رکھتے ہیں، حالانکہ یہ عقیدہ اس اسلام کے صریح مخالف ہے جو اللہ اور اس کے رسول کی طرف سے آیا اور قرآن و حدیث کی صورت میں ہمارے پاس موجود ہے۔ اس عقیدے کی رو سے نیکی و بدی، شرک و توحید، نکاح و زنا، غرض ہر اطاعت اور نافرمانی کا فرق ہی مٹ جاتا ہے اور انبیاء و رسل اور کتب الٰہیہ سب بے کار ٹھہرتے ہیں۔ [ نَعُوْذُ بِاللّٰہِ مِنْ ھٰذِہِ الْعَقِیْدَۃِ الْمَلْعُوْنَۃِ] قرآن مجید میں صراحت ہے کہ آل فرعون کو مرتے ہی آگ نے گھیر لیا اور قیامت کو وہ سخت ترین عذاب میں داخل ہوں گے۔ دیکھیے سورۂ مومن (۴۵، ۴۶)۔ ¤ ➋ {’’ الرِّفْدُ ‘‘ } کا معنی عطیہ،{’’ الْمَرْفُوْدُ ‘‘} جو انھیں دیا گیا، یعنی دنیا اور آخرت میں لعنت کا عطیہ۔ لعنت کو عطیہ اور انعام بطور مذاق فرمایا ہے، جیسے فرمایا : «{ فَبَشِّرْهُمْ بِعَذَابٍ اَلِيْمٍ }» [ آل عمران :۲۱]’’سو انھیں ایک دردناک عذاب کی خوش خبری سنا دے۔‘‘"
    },
    {
      "ayah": 100,
      "tafsir": "(آیت 100) {ذٰلِكَ مِنْ اَنْبَآءِ الْقُرٰى … : ’’ مِنْ ‘‘} تبعیض کے لیے ہے، یعنی گزشتہ بستیوں کی یہ چند خبریں ہیں جو ہم آپ کو بیان کر رہے ہیں۔ اس سورت میں انبیاء کے حالات زمانے کی ترتیب کے ساتھ بیان ہوئے ہیں، یعنی نوح، ہود، صالح، ابراہیم، لوط، شعیب اور موسیٰ علیھم السلام ۔{ ’’ قَآىِٕمٌ ‘‘} کھڑی (کھیتی)، {’’ حَصِيْدٌ ‘‘ } وہ کھیتی جو کاٹی جا چکی ہو، یعنی ان بستیوں میں سے بعض کے نشانات اب بھی قائم ہیں، مثلاً صالح علیہ السلام کی قوم کے پہاڑوں میں تراشے ہوئے مکانات اور بعض کے نام و نشان تک مٹ چکے ہیں، جیسے کٹی ہوئی کھیتی کا نام و نشان مٹ جاتا ہے۔"
    },
    {
      "ayah": 101,
      "tafsir": "(آیت 101) ➊ {وَ مَا ظَلَمْنٰهُمْ …:} یعنی ہم نے جو ان پر عذاب بھیجے اس میں ہم نے ان پر کوئی ظلم نہیں کیا، بلکہ انھوں نے خود ہی اپنی جانوں پر ظلم کیا۔ اپنی جانوں پر ان کا سب سے بڑا ظلم اللہ کے ساتھ شرک اور پھر رسولوں کو جھٹلانا تھا، جس کی انھیں سزا ملی۔ ¤ ➋ { فَمَاۤ اَغْنَتْ عَنْهُمْ اٰلِهَتُهُمُ الَّتِيْ …:} پھر اللہ کا عذاب آنے پر ان کے معبود، حاجت روا، مشکل کشا، گنج بخش اور دستگیر ان کے کسی کام نہ آ سکے، بلکہ وہ ان کے لیے ہلاک کیے جانے میں اور عذاب میں اضافے ہی کا سبب بنے، کیونکہ انھی کی وجہ سے ان پر تباہی اور بربادی آئی۔ {’’ تَتْبِيْبٍ ‘‘} فعل {’’ تَبَّ ‘‘ } (وہ ہلاک ہوا) سے باب تفعیل ہے، ہلاک کرنا۔"
    },
    {
      "ayah": 102,
      "tafsir": "(آیت 102){وَ كَذٰلِكَ اَخْذُ رَبِّكَ … : ’’اَخَذَ‘‘} کا معنی اچانک جلدی سے پکڑ لینا، جیسا کہ ککہتے ہیں : {’’ فُلَانٌ اَخَذَهُ الْمَوْتُ ‘‘} فلاں کو موت نے آ دبوچا۔ یعنی جس طرح گزشتہ سات انبیاء علیھم السلام کی اقوام پر ظلم کی وجہ سے پکڑ آئی، کسی بھی ظالم بستی (والوں) پر تیرے رب کی پکڑ ایسی ہی ہوتی ہے۔ ابو موسیٰ اشعری رضی اللہ عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ لَيُمْلِيْ لِلظَّالِمِ حَتّٰی إِذَا أَخَذَهٗ لَمْ يُفْلِتْهُ، ثُمَّ قَرَأَ: « وَ كَذٰلِكَ اَخْذُ رَبِّكَ اِذَاۤ اَخَذَ الْقُرٰى وَ هِيَ ظَالِمَةٌ اِنَّ اَخْذَهٗۤ اَلِيْمٌ شَدِيْدٌ » ] [ بخاری، التفسیر، باب : « و کذلک أخذ ربک…» : ۴۶۸۶۔ مسلم : ۲۵۸۳ ] ’’اللہ تعالیٰ ظالم کو ڈھیل دیتا ہے، لیکن آخر کار جب اسے پکڑتا ہے تو ایسا پکڑتا ہے کہ وہ اس سے چھوٹ کر کہیں جا نہیں سکتا۔‘‘ اس کے بعد آپ نے یہ آیت تلاوت فرمائی۔‘‘ یہ آیت ہر زمانے میں ہر ظالم کو شامل ہے۔ سلف میں سے کسی نے کہا ہے : ’’کفر کے ساتھ سلطنت قائم رہ سکتی ہے مگر ظلم کے ساتھ نہیں۔‘‘"
    },
    {
      "ayah": 103,
      "tafsir": "(آیت 103) ➊ {اِنَّ فِيْ ذٰلِكَ لَاٰيَةً لِّمَنْ خَافَ عَذَابَ الْاٰخِرَةِ:} یعنی ان آیات و واقعات سے وہی عبرت حاصل کرے گا جس کا آخرت پر ایمان ہے، مگر جس کا آخرت پر ایمان نہیں وہ ان تمام واقعات کی کوئی نہ کوئی سائنسی توجیہ کرے گا کہ زمین و آسمان کے تغیرات کی وجہ سے ایسا ہوا، ظلم یا عدل سے اس کا کیا تعلق؟ ¤ ➋ { ذٰلِكَ يَوْمٌ مَّجْمُوْعٌ لَّهُ النَّاسُ :} یعنی وہ قیامت کا دن ایسا ہے جس کے لیے تمام لوگ جمع کیے ہوئے ہوں گے۔ زمخشری نے فرمایا کہ فعل مجہول {’’يُجْمَعُ لَهُ‘‘} (جمع کیے جائیں گے) کے بجائے اسم مفعول {’’ مَّجْمُوْعٌ لَّهُ ‘‘} (جمع کیے ہوئے ہوں گے) اس لیے استعمال فرمایا کہ اسم میں دوام اور ہمیشگی پائی جاتی ہے جب کہ فعل میں یہ چیز نہیں ہوتی۔ ¤ ➌ { وَ ذٰلِكَ يَوْمٌ مَّشْهُوْدٌ:} یعنی اس میں سب لوگ حاضر کیے ہوئے ہوں گے، کوئی چھپ سکے گا نہ ادھر ادھر ہو سکے گا۔ ایک معنی یہ ہے کہ اس دن ہر نیکی یا بدی کی شہادت موجود ہو گی اور پیش بھی کی جائے گی۔ یہ بھی مراد ہے کہ اس دن پہلے، پچھلے انسان اور جن سب حاضر ہوں گے، فرشتے بھی اور خود ذات الٰہی بھی فیصلے کے لیے تشریف لائیں گے، فرمایا : «{ وَ جَآءَ رَبُّكَ وَ الْمَلَكُ صَفًّا صَفًّا }» [ الفجر : ۲۲ ] ’’اور تیرا رب آئے گا اور فرشتے جو صف در صف ہوں گے۔‘‘"
    },
    {
      "ayah": 104,
      "tafsir": "(آیت 104) {وَ مَا نُؤَخِّرُهٗۤ اِلَّا لِاَجَلٍ مَّعْدُوْدٍ:’’ مَعْدُوْدٍ ‘‘} کا معنی ہے گنا ہوا۔ گنی ہوئی چیز آخر ختم ہو جاتی ہے، یعنی قیامت کی مہلت گنتی کے چند دن ہیں، جیسے روزوں کے متعلق فرمایا : «{ اَيَّامًا مَّعْدُوْدٰتٍ }» [ البقرۃ : ۱۸۴ ] ’’گنے ہوئے چند دنوں میں۔‘‘ اور وہ گنتی صرف اللہ کے علم میں ہے، قیامت نہ اس سے پہلے آ سکتی ہے، نہ اس سے مؤخر ہو سکتی ہے۔"
    },
    {
      "ayah": 105,
      "tafsir": "(آیت 105) ➊ {يَوْمَ يَاْتِ: } یہاں چند آیات میں اللہ تعالیٰ نے اس دن کا کچھ نقشہ بیان فرمایا ہے۔ {’’ يَاْتِ ‘‘} اصل میں {’’ يَأْتِيْ ‘‘} ہی ہے۔ زمخشری نے لکھا{ ’’ يَوْمَ يَاْتِ ‘‘} کی طرح {’’ لَا أَدْرِ‘‘} بھی کہہ دیتے ہیں۔ سیبویہ اور خلیل نے یہ بیان فرمایا ہے کہ یاء کو حذف کرکے اس کی جگہ کسرہ پر اکتفا کرنا ہذیل کی لغت میں بہت ہے (یعنی دوسری لغات میں بھی ہے مگر کم ہے)۔ {’’ يَاْتِ ‘‘} کا فاعل وہی ہے جو اوپر گزرا {’’ يَوْمٌ مَّجْمُوْعٌ لَّهُ النَّاسُ ‘‘۔ ’’ يَوْمٌ ‘‘} کا لفظ عربی میں وقت کے معنی میں بھی آتا ہے۔ تفصیل کے لیے دیکھیے {’’التحرير والتنوير لابن عاشور‘‘} یعنی جس دن وہ وقت آئے گا، یا جس وقت وہ دن آئے گا۔ زمخشری نے ایک معنی یہ لکھا ہے کہ جس دن اللہ تعالیٰ آئے گا، یعنی {’’ يَاْتِ ‘‘} کا فاعل اللہ تعالیٰ ہے، جیسا کہ فرمایا : «{ وَ جَآءَ رَبُّكَ وَ الْمَلَكُ صَفًّا صَفًّا }» [ الفجر : ۲۲] ’’اور تیرا رب آئے گا اور فرشتے جو صف در صف ہوں گے۔‘‘ ¤ ➋ { لَا تَكَلَّمُ نَفْسٌ اِلَّا بِاِذْنِهٖ:} یہاں سے نصرانیوں کی ااور بعض مسلمانوں کی اس سفارش کا رد ہو گیا جو ان کے خیال میں کچھ ہستیوں کے اختیار میں ہے کہ وہ اللہ کے محبوب ہونے یا بڑے زبردست ہونے کی وجہ سے جسے چاہیں گے چھڑا لیں گے، حالانکہ وہاں اللہ تعالیٰ کی اجازت کے بغیر کسی کو بات کرنے کی جرأت ہی نہیں ہو گی۔ دیکھیے سورۂ نبا (۳۸)۔ ¤ ➌ {فَمِنْهُمْ شَقِيٌّ وَّ سَعِيْدٌ : ’’ شَقِيٌّ ‘‘} بروزن {’’فَعِيْلٌ‘‘} مبالغہ کے لیے ہے ۔ قاموس میں ہے {’’اَلشَّقَا‘‘} کو کبھی {’’اَلشَّقَاءُ‘‘} بھی کہا جاتا ہے، سختی، تنگی۔ {’’شَقِيَ يَشْقٰي‘‘} (ع) یہ {’’رَضِيَ يَرْضٰي‘‘} کی طرح ہے، یعنی ناقص واوی ہے۔ زمخشری نے فرمایا : {’’اَلَّذِيْ وَجَبَتْ لَهُ النَّارُ بِإِسَاءَتِهِ ‘‘} یعنی وہ بدبخت جس کے لیے اس کی بدعملی کی وجہ سے آگ واجب ہو گئی۔ {’’ سَعِيْدٌ ‘‘} وہ خوش قسمت جس کے لیے اس کے نیک اعمال کی وجہ سے جنت واجب ہو گئی۔"
    },
    {
      "ayah": 106,
      "tafsir": "(آیت 106){فَاَمَّا الَّذِيْنَ شَقُوْا …: ’’ زَفِيْرٌ ‘‘} اور {’’ شَهِيْقٌ ‘‘} دونوں گدھے کی آوازیں ہیں۔ {’’ زَفِيْرٌ ‘‘} اس کے شروع کی آواز اور {’’ شَهِيْقٌ ‘‘} اس کے آخر کی آواز، یعنی نہایت بری چیخنے چلانے کی آوازیں نکالیں گے۔"
    },
    {
      "ayah": 107,
      "tafsir": "(آیت 108،107) ➊ {خٰلِدِيْنَ فِيْهَا مَا دَامَتِ السَّمٰوٰتُ وَ الْاَرْضُ:} ’’جب تک سارے آسمان و زمین قائم ہیں‘‘ مراد ہمیشہ کا عذاب ہے، کیونکہ جب کسی چیز کی ہمیشگی ظاہر کرنا مقصود ہوتا ہے تو عرب {’’ مَا دَامَتِ السَّمٰوٰتُ وَ الْاَرْضُ ‘‘} کا محاورہ استعمال کرتے ہیں، ورنہ تعلیق نہیں، یعنی یہ معنی نہیں کہ جب تک آسمان و زمین قائم رہیں گے عذاب رہے گا، پھر نہیں۔ ہاں آسمان و زمین سے مراد آخرت کے آسمان و زمین ہوں تو محاورے کے بغیر ہی ہمیشگی مراد ہے، کیونکہ دنیا کے زمین و آسمان تو اس دن بدل دیے جائیں گے، فرمایا : «{ يَوْمَ تُبَدَّلُ الْاَرْضُ غَيْرَ الْاَرْضِ وَ السَّمٰوٰتُ وَ بَرَزُوْا لِلّٰهِ الْوَاحِدِ الْقَهَّارِ }» [ إبراہیم : ۴۸ ] ’’جس دن یہ زمین اور زمین سے بدل دی جائے گی اور سب آسمان بھی اور لوگ اللہ کے سامنے پیش ہوں گے، جو اکیلا ہے، بڑا زبردست ہے۔‘‘ آخرت کے آسمان و زمین میں جنت واقع ہو گی اور وہ ہمیشہ رہنے والی ہے۔ لہٰذا وہ زمین و آسمان بھی دائمی ہیں، جیسا کہ اللہ تعالیٰ نے جنتیوں کا قول ذکر فرمایا : «{ وَ قَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْ صَدَقَنَا وَعْدَهٗ وَ اَوْرَثَنَا الْاَرْضَ نَتَبَوَّاُ مِنَ الْجَنَّةِ حَيْثُ نَششَآءُ }» [ الزمر : ۷۴ ] ’’اور وہ کہیں گے سب تعریف اللہ کے لیے ہے جس نے ہم سے اپنا وعدہ سچا کیا اور ہمیں اس زمین کا وارث بنا دیا کہ ہم جنت میں جہاں چاہیں جگہ بنا لیں۔‘‘ تو مطلب یہ ہو گا کہ جہنمی جہنم میں اور جنتی جنت میں ہمیشہ رہیں گے۔ (ابن کثیر) ¤ ➋ {اِلَّا مَا شَآءَ رَبُّكَ:} یہ لفظ {’’ شَقِيٌّ ‘‘} اور{ ’’ سَعِيْدٌ ‘‘ } دونوں کے تذکرے میں آئے ہیں، یعنی بدبخت آگ میں ہمیشہ رہیں گے، جب تک آسمان و زمین قائم ہیں، مگر جو تیرا رب چاہے۔ اسی طرح سعادت مندوں کے متعلق بھی فرمایا کہ وہ ہمیشہ جنت میں رہیں گے، جب تک آسمان و زمین قائم ہیں، مگر جو تیرا رب چاہے۔ دونوں آیتوں میں ’’مگر جو تیرا رب چاہے‘‘ کا تعلق اہلِ توحید سے ہے۔ پہلی آیت میں مطلب یہ ہو گا کہ مومن موحد گناہ گار جب اپنی سزا بھگت لیں گے تو انھیں جہنم سے نکال لیا جائے گا، جیسا کہ ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں : [ يَدْخُلُ أَهْلُ الْجَنَّةِ الْجَنَّةَ وَأَهْلُ النَّارِ النَّارَ ثُمَّ يَقُوْلُ اللّٰهُ  تَعَالَی أَخْرِجُوْا مَنْ كَانَ فِيْ قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيْمَانٍ، فَيُخْرَجُوْنَ مِنْهَا قَدِ اسْوَدُّوْا فَيُلْقَوْنَ فِيْ نَهْرِ الْحَيَا أَوِ الْحَيَاةِ، شَكَّ مَالِكٌ فَيَنْبُتُوْنَ كَمَا تَنْبُتُ الْحِبَّةُ فِيْ جَانِبِ السَّيْلِ، أَلَمْ تَرَ أَنَّهَا تَخْرُجُ صَفْرَاءَ مُلْتَوِيَةً ؟ ] [ بخاری، الإیمان، باب تفاضل أہل الإیمان  فی الأعمال : ۲۲۔ مسلم : ۱۸۴ ] ’’اہل جنت، جنت میں اور اہل نار آگ میں داخل ہو جائیں گے، پھراللہ تعالیٰ فرمائے گا : ’’جس شخص کے دل میں ایک رائی کے دانے کے برابر ایمان ہے اسے اس سے نکال لو!‘‘ تو وہ اس سے اس حال میں نکالے جائیں گے کہ سیاہ ہو چکے ہوں گے، پھر انھیں {’’نَهْرُ الْحَيَا‘‘} (بارش کے پانی کی نہر) یا {’’نَهْرُ الْحَيَاةِ‘‘} (زندگی کی نہر) میں ڈال دیا جائے گا (امام مالک کو شک ہے) تو وہ اس طرح اگ آئیں گے جیسے بوٹیوں کا بیج سیلاب کی جانب میں اگ آتا ہے۔ تم نے نہیں دیکھا کہ وہ زرد لپٹا ہوا اگتا ہے؟‘‘ ¤ اس مفہوم کی بہت سی احادیث آئی ہیں کہ سزا پا کر یا شفاعت سے یا محض اللہ تعالیٰ کے فضل سے گناہ گار مسلمان آخر کار جہنم سے نکل کر جنت میں چلے جائیں گے، اس پر اہل سنت کا اتفاق ہے۔ گو بعض نے اس سے دوزخ کے بالآخر فنا ہونے پر استدلال کیا ہے اور اس سلسلے میں ایک ضعیف حدیث اور کچھ غریب اقوال بھی نقل کیے ہیں، مگر یہ مطلب قرآن کی دوسری آیات کے خلاف ہے، جن میں جہنمیوں کے متعلق {’’ خٰلِدِيْنَ ‘‘} اور {’’ اَبَدًا ‘‘} کے الفاظ مذکور ہیں اور ان احادیث کے بھی صریح خلاف ہے، جن میں ہے : [ يُجَاءُ بِالْمَوْتِ يَوْمَ الْقِيَامَةِ كَأَنَّهٗ كَبْشٌ أَمْلَحُ حَتّٰي يُجْعَلَ بَيْنَ الْجَنَّةِ وَالنَّارِ، ثُمَّ يُذْبَحُ، ثُمَّ يُنَادِيْ ممُنَادٍ يَا أَهْلَ الْجَنَّةِ ! لاَ مَوْتَ، يَا أَهْلَ النَّارِ! لاَ مَوْتَ، فَيَزْدَادُ أَهْلُ الْجَنَّةِ فَرَحًا إِلٰى فَرَحِهِمْ، وَيَزْدَادُ أَهْلُ النَّارِ حُزْنًا إِلٰی حُزْنِهِمْ ] [ مسلم، الجنۃ و  نعیمہا، باب النار یدخلہا الجبارون :۲۸۴۹، 2850/43۔ بخاری : ۶۵۴۸ ] ’’موت کو ایک مینڈھے کی شکل میں جنت اور جہنم کے درمیان لا کر ذبح کر دیا جائے گا اور اعلان کرنے والا اعلان کرے گا کہ اے اہل جنت! (اب) موت نہیں اور اے اہل نار! اب موت نہیں! تو جنتیوں کی خوشیوں کے ساتھ مزید خوشی کا اور جہنمیوں کے غم کے ساتھ مزید غم کا اضافہ ہو جائے گا۔‘‘ اور مسلم کی ایک روایت (۴۲؍۲۸۵۰) میں ہے : [ كُلٌّ خَالِدٌ فِيْمَا هُوَ فِيْهِ ] کہ ہر ایک جس جگہ میں ہے اس میں ہمیشہ رہے گا۔ ایسی بہت سی صحیح احادیث موجود ہیں، اس لیے جہنم کے بالآخر فنا ہونے کی کوئی واضح اور پختہ دلیل موجود نہیں۔ ¤ ➌ {اِنَّ رَبَّكَ فَعَّالٌ لِّمَا يُرِيْدُ :} یہ ان لوگوں پر رد ہے جو ہر عمل کی تاثیر ذاتی سمجھتے ہیں، جیسا کہ زہر کھانے کا لازمی نتیجہ موت ہے، چنانچہ معتزلہ اور خارجیوں کا کہنا ہے کہ جو مسلمان کبائر کا مرتکب ہو اور توبہ نہ کی ہو، وہ بھی ابدی جہنمی ہے۔ ایک دفعہ جو آگ میں چلا گیا وہ وہاں سے کبھی نہیں نکلے گا۔ اللہ تعالیٰ نے اہل شقاوت (جو جہنم میں جائیں گے، جن میں کافر اور گناہ گار مسلمان دونوں شامل ہیں) کے متعلق فرمایا کہ وہ ہمیشہ جہنم میں رہیں گے، مگر جو تیرا رب چاہے۔ کیونکہ بلاشبہ تیرا رب جو چاہے کر گزرنے والا ہے۔ اس سے معلوم ہوا کہ کسی بھی چیز کی تاثیر اللہ کے حکم ہی سے ہوتی ہے، وہ چاہے تو آگ جلاتی ہے، پانی غرق کرتا ہے، زہر موت کا باعث بنتا ہے، اگر وہ اس کے برعکس چاہے تو نہ آگ جلاتی ہے، نہ پانی غرق کرتا ہے، نہ زہر کھانا موت کا باعث ہوتا ہے، حالانکہ یہ ان کی اپنی تاثیر کے خلاف ہے۔ اسی طرح اللہ تعالیٰ اہل کبائر مسلمانوں کو جہنم سے نکال لے گا، وہ جو چاہے کر گزرنے والا ہے، کوئی اس کا ہاتھ نہیں پکڑ سکتا۔ ¤ ➍ { وَ اَمَّا الَّذِيْنَ سُعِدُوْا … :} اس دوسری آیت میں اہل سعادت (اہل جنت) کے متعلق بھی ’’مگر جو تیرا رب چاہے‘‘ کے الفاظ فرمائے ہیں۔ یہاں بھی ان سے مراد گناہ گار مسلمان ہی ہیں، یعنی جنتی جنت میں ہمیشہ رہیں گے، تاہم کچھ لوگ اللہ کی مشیت کے تحت جہنم سے نکال کر جنت میں لائے جائیں گے۔ گویا وہ ہمیشہ جنت میں نہ رہے مگر جنت میں داخل ہونے کے بعد چونکہ کوئی بھی اس سے نہیں نکلے گا، اس لیے آخر میں فرمایا : «{ عَطَآءً غَيْرَ مَجْذُوْذٍ }» یعنی جنت ایسا عطیہ ہے جو قطع کیا جانے والا نہیں۔ (روح المعانی) ¤ ➎ شاہ عبد القادر رحمہ اللہ اپنے فوائد میں لکھتے ہیں کہ اس کے یعنی آیت : «{ مَا دَامَتِ السَّمٰوٰتُ وَ الْاَرْضُ اِلَّا مَا شَآءَ رَبُّكَ }» کے دو معنی ہو سکتے ہیں، ایک یہ کہ رہیں گے آگ میں جتنی دیر رہ چکے ہیں آسمان و زمین دنیا میں، مگر جتنا اور چاہے تیرا رب، وہ اسی کو معلوم ہے۔ دوسرے یہ کہ رہیں گے آگ میں جب تک رہے آسمان و زمین اس (آخری) جہان کا، یعنی ہمیشہ مگر جو چاہے رب تو موقوف کر دے، لیکن وہ چاہ چکا کہ موقوف نہ ہو۔ اس کہنے میں فرق نکلا اللہ کے ہمیشہ رہنے میں اور بندے کے کہ بندے کے ہمیشہ رہنے پر ساتھ یہ بات لگی ہے کہ اللہ چاہے تو فنا کر دے۔‘‘ (موضح) گویا شاہ صاحب نے اس مشہور اعتراض کا بھی جواب دے دیا کہ اللہ تعالیٰ کی ذات بھی ہمیشہ رہنے والی ہے، جنتی اور جہنمی بھی ہمیشہ جنت اور جہنم میں رہنے والے ہوئے تو دونوں ایک دوسرے کی مثل ابدی ہو گئے، جب کہ فرمایا : «{ لَيْسَ كَمِثْلِهٖ شَيْءٌ }» [ الشوریٰ : ۱۱ ] ’’اس کی مثل کوئی چیز نہیں۔‘‘ جواب یہ ہے کہ بندے کا جہنم یا جنت میں ہمیشہ رہنا اور ابدی ہونا اللہ تعالیٰ کی مشیت پر موقوف ہے، جبکہ اللہ تعالیٰ کا ابدی ہونا کسی کی مشیت پر موقوف نہیں۔ وہ خود ہی ہمیشہ سے ہے اور ہمیشہ رہے گا، وہ ازلی بھی ہے اور ابدی بھی۔"
    },
    {
      "ayah": 108,
      "tafsir": "(آیت 108،107) ➊ {خٰلِدِيْنَ فِيْهَا مَا دَامَتِ السَّمٰوٰتُ وَ الْاَرْضُ:} ’’جب تک سارے آسمان و زمین قائم ہیں‘‘ مراد ہمیشہ کا عذاب ہے، کیونکہ جب کسی چیز کی ہمیشگی ظاہر کرنا مقصود ہوتا ہے تو عرب {’’ مَا دَامَتِ السَّمٰوٰتُ وَ الْاَرْضُ ‘‘} کا محاورہ استعمال کرتے ہیں، ورنہ تعلیق نہیں، یعنی یہ معنی نہیں کہ جب تک آسمان و زمین قائم رہیں گے عذاب رہے گا، پھر نہیں۔ ہاں آسمان و زمین سے مراد آخرت کے آسمان و زمین ہوں تو محاورے کے بغیر ہی ہمیشگی مراد ہے، کیونکہ دنیا کے زمین و آسمان تو اس دن بدل دیے جائیں گے، فرمایا : «{ يَوْمَ تُبَدَّلُ الْاَرْضُ غَيْرَ الْاَرْضِ وَ السَّمٰوٰتُ وَ بَرَزُوْا لِلّٰهِ الْوَاحِدِ الْقَهَّارِ }» [ إبراہیم : ۴۸ ] ’’جس دن یہ زمین اور زمین سے بدل دی جائے گی اور سب آسمان بھی اور لوگ اللہ کے سامنے پیش ہوں گے، جو اکیلا ہے، بڑا زبردست ہے۔‘‘ آخرت کے آسمان و زمین میں جنت واقع ہو گی اور وہ ہمیشہ رہنے والی ہے۔ لہٰذا وہ زمین و آسمان بھی دائمی ہیں، جیسا کہ اللہ تعالیٰ نے جنتیوں کا قول ذکر فرمایا : «{ وَ قَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْ صَدَقَنَا وَعْدَهٗ وَ اَوْرَثَنَا الْاَرْضَ نَتَبَوَّاُ مِنَ الْجَنَّةِ حَيْثُ نَششَآءُ }» [ الزمر : ۷۴ ] ’’اور وہ کہیں گے سب تعریف اللہ کے لیے ہے جس نے ہم سے اپنا وعدہ سچا کیا اور ہمیں اس زمین کا وارث بنا دیا کہ ہم جنت میں جہاں چاہیں جگہ بنا لیں۔‘‘ تو مطلب یہ ہو گا کہ جہنمی جہنم میں اور جنتی جنت میں ہمیشہ رہیں گے۔ (ابن کثیر) ¤ ➋ {اِلَّا مَا شَآءَ رَبُّكَ:} یہ لفظ {’’ شَقِيٌّ ‘‘} اور{ ’’ سَعِيْدٌ ‘‘ } دونوں کے تذکرے میں آئے ہیں، یعنی بدبخت آگ میں ہمیشہ رہیں گے، جب تک آسمان و زمین قائم ہیں، مگر جو تیرا رب چاہے۔ اسی طرح سعادت مندوں کے متعلق بھی فرمایا کہ وہ ہمیشہ جنت میں رہیں گے، جب تک آسمان و زمین قائم ہیں، مگر جو تیرا رب چاہے۔ دونوں آیتوں میں ’’مگر جو تیرا رب چاہے‘‘ کا تعلق اہلِ توحید سے ہے۔ پہلی آیت میں مطلب یہ ہو گا کہ مومن موحد گناہ گار جب اپنی سزا بھگت لیں گے تو انھیں جہنم سے نکال لیا جائے گا، جیسا کہ ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں : [ يَدْخُلُ أَهْلُ الْجَنَّةِ الْجَنَّةَ وَأَهْلُ النَّارِ النَّارَ ثُمَّ يَقُوْلُ اللّٰهُ  تَعَالَی أَخْرِجُوْا مَنْ كَانَ فِيْ قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيْمَانٍ، فَيُخْرَجُوْنَ مِنْهَا قَدِ اسْوَدُّوْا فَيُلْقَوْنَ فِيْ نَهْرِ الْحَيَا أَوِ الْحَيَاةِ، شَكَّ مَالِكٌ فَيَنْبُتُوْنَ كَمَا تَنْبُتُ الْحِبَّةُ فِيْ جَانِبِ السَّيْلِ، أَلَمْ تَرَ أَنَّهَا تَخْرُجُ صَفْرَاءَ مُلْتَوِيَةً ؟ ] [ بخاری، الإیمان، باب تفاضل أہل الإیمان  فی الأعمال : ۲۲۔ مسلم : ۱۸۴ ] ’’اہل جنت، جنت میں اور اہل نار آگ میں داخل ہو جائیں گے، پھراللہ تعالیٰ فرمائے گا : ’’جس شخص کے دل میں ایک رائی کے دانے کے برابر ایمان ہے اسے اس سے نکال لو!‘‘ تو وہ اس سے اس حال میں نکالے جائیں گے کہ سیاہ ہو چکے ہوں گے، پھر انھیں {’’نَهْرُ الْحَيَا‘‘} (بارش کے پانی کی نہر) یا {’’نَهْرُ الْحَيَاةِ‘‘} (زندگی کی نہر) میں ڈال دیا جائے گا (امام مالک کو شک ہے) تو وہ اس طرح اگ آئیں گے جیسے بوٹیوں کا بیج سیلاب کی جانب میں اگ آتا ہے۔ تم نے نہیں دیکھا کہ وہ زرد لپٹا ہوا اگتا ہے؟‘‘ ¤ اس مفہوم کی بہت سی احادیث آئی ہیں کہ سزا پا کر یا شفاعت سے یا محض اللہ تعالیٰ کے فضل سے گناہ گار مسلمان آخر کار جہنم سے نکل کر جنت میں چلے جائیں گے، اس پر اہل سنت کا اتفاق ہے۔ گو بعض نے اس سے دوزخ کے بالآخر فنا ہونے پر استدلال کیا ہے اور اس سلسلے میں ایک ضعیف حدیث اور کچھ غریب اقوال بھی نقل کیے ہیں، مگر یہ مطلب قرآن کی دوسری آیات کے خلاف ہے، جن میں جہنمیوں کے متعلق {’’ خٰلِدِيْنَ ‘‘} اور {’’ اَبَدًا ‘‘} کے الفاظ مذکور ہیں اور ان احادیث کے بھی صریح خلاف ہے، جن میں ہے : [ يُجَاءُ بِالْمَوْتِ يَوْمَ الْقِيَامَةِ كَأَنَّهٗ كَبْشٌ أَمْلَحُ حَتّٰي يُجْعَلَ بَيْنَ الْجَنَّةِ وَالنَّارِ، ثُمَّ يُذْبَحُ، ثُمَّ يُنَادِيْ ممُنَادٍ يَا أَهْلَ الْجَنَّةِ ! لاَ مَوْتَ، يَا أَهْلَ النَّارِ! لاَ مَوْتَ، فَيَزْدَادُ أَهْلُ الْجَنَّةِ فَرَحًا إِلٰى فَرَحِهِمْ، وَيَزْدَادُ أَهْلُ النَّارِ حُزْنًا إِلٰی حُزْنِهِمْ ] [ مسلم، الجنۃ و  نعیمہا، باب النار یدخلہا الجبارون :۲۸۴۹، 2850/43۔ بخاری : ۶۵۴۸ ] ’’موت کو ایک مینڈھے کی شکل میں جنت اور جہنم کے درمیان لا کر ذبح کر دیا جائے گا اور اعلان کرنے والا اعلان کرے گا کہ اے اہل جنت! (اب) موت نہیں اور اے اہل نار! اب موت نہیں! تو جنتیوں کی خوشیوں کے ساتھ مزید خوشی کا اور جہنمیوں کے غم کے ساتھ مزید غم کا اضافہ ہو جائے گا۔‘‘ اور مسلم کی ایک روایت (۴۲؍۲۸۵۰) میں ہے : [ كُلٌّ خَالِدٌ فِيْمَا هُوَ فِيْهِ ] کہ ہر ایک جس جگہ میں ہے اس میں ہمیشہ رہے گا۔ ایسی بہت سی صحیح احادیث موجود ہیں، اس لیے جہنم کے بالآخر فنا ہونے کی کوئی واضح اور پختہ دلیل موجود نہیں۔ ¤ ➌ {اِنَّ رَبَّكَ فَعَّالٌ لِّمَا يُرِيْدُ :} یہ ان لوگوں پر رد ہے جو ہر عمل کی تاثیر ذاتی سمجھتے ہیں، جیسا کہ زہر کھانے کا لازمی نتیجہ موت ہے، چنانچہ معتزلہ اور خارجیوں کا کہنا ہے کہ جو مسلمان کبائر کا مرتکب ہو اور توبہ نہ کی ہو، وہ بھی ابدی جہنمی ہے۔ ایک دفعہ جو آگ میں چلا گیا وہ وہاں سے کبھی نہیں نکلے گا۔ اللہ تعالیٰ نے اہل شقاوت (جو جہنم میں جائیں گے، جن میں کافر اور گناہ گار مسلمان دونوں شامل ہیں) کے متعلق فرمایا کہ وہ ہمیشہ جہنم میں رہیں گے، مگر جو تیرا رب چاہے۔ کیونکہ بلاشبہ تیرا رب جو چاہے کر گزرنے والا ہے۔ اس سے معلوم ہوا کہ کسی بھی چیز کی تاثیر اللہ کے حکم ہی سے ہوتی ہے، وہ چاہے تو آگ جلاتی ہے، پانی غرق کرتا ہے، زہر موت کا باعث بنتا ہے، اگر وہ اس کے برعکس چاہے تو نہ آگ جلاتی ہے، نہ پانی غرق کرتا ہے، نہ زہر کھانا موت کا باعث ہوتا ہے، حالانکہ یہ ان کی اپنی تاثیر کے خلاف ہے۔ اسی طرح اللہ تعالیٰ اہل کبائر مسلمانوں کو جہنم سے نکال لے گا، وہ جو چاہے کر گزرنے والا ہے، کوئی اس کا ہاتھ نہیں پکڑ سکتا۔ ¤ ➍ { وَ اَمَّا الَّذِيْنَ سُعِدُوْا … :} اس دوسری آیت میں اہل سعادت (اہل جنت) کے متعلق بھی ’’مگر جو تیرا رب چاہے‘‘ کے الفاظ فرمائے ہیں۔ یہاں بھی ان سے مراد گناہ گار مسلمان ہی ہیں، یعنی جنتی جنت میں ہمیشہ رہیں گے، تاہم کچھ لوگ اللہ کی مشیت کے تحت جہنم سے نکال کر جنت میں لائے جائیں گے۔ گویا وہ ہمیشہ جنت میں نہ رہے مگر جنت میں داخل ہونے کے بعد چونکہ کوئی بھی اس سے نہیں نکلے گا، اس لیے آخر میں فرمایا : «{ عَطَآءً غَيْرَ مَجْذُوْذٍ }» یعنی جنت ایسا عطیہ ہے جو قطع کیا جانے والا نہیں۔ (روح المعانی) ¤ ➎ شاہ عبد القادر رحمہ اللہ اپنے فوائد میں لکھتے ہیں کہ اس کے یعنی آیت : «{ مَا دَامَتِ السَّمٰوٰتُ وَ الْاَرْضُ اِلَّا مَا شَآءَ رَبُّكَ }» کے دو معنی ہو سکتے ہیں، ایک یہ کہ رہیں گے آگ میں جتنی دیر رہ چکے ہیں آسمان و زمین دنیا میں، مگر جتنا اور چاہے تیرا رب، وہ اسی کو معلوم ہے۔ دوسرے یہ کہ رہیں گے آگ میں جب تک رہے آسمان و زمین اس (آخری) جہان کا، یعنی ہمیشہ مگر جو چاہے رب تو موقوف کر دے، لیکن وہ چاہ چکا کہ موقوف نہ ہو۔ اس کہنے میں فرق نکلا اللہ کے ہمیشہ رہنے میں اور بندے کے کہ بندے کے ہمیشہ رہنے پر ساتھ یہ بات لگی ہے کہ اللہ چاہے تو فنا کر دے۔‘‘ (موضح) گویا شاہ صاحب نے اس مشہور اعتراض کا بھی جواب دے دیا کہ اللہ تعالیٰ کی ذات بھی ہمیشہ رہنے والی ہے، جنتی اور جہنمی بھی ہمیشہ جنت اور جہنم میں رہنے والے ہوئے تو دونوں ایک دوسرے کی مثل ابدی ہو گئے، جب کہ فرمایا : «{ لَيْسَ كَمِثْلِهٖ شَيْءٌ }» [ الشوریٰ : ۱۱ ] ’’اس کی مثل کوئی چیز نہیں۔‘‘ جواب یہ ہے کہ بندے کا جہنم یا جنت میں ہمیشہ رہنا اور ابدی ہونا اللہ تعالیٰ کی مشیت پر موقوف ہے، جبکہ اللہ تعالیٰ کا ابدی ہونا کسی کی مشیت پر موقوف نہیں۔ وہ خود ہی ہمیشہ سے ہے اور ہمیشہ رہے گا، وہ ازلی بھی ہے اور ابدی بھی۔"
    },
    {
      "ayah": 109,
      "tafsir": "(آیت 109) ➊ {فَلَا تَكُ فِيْ مِرْيَةٍ مِّمَّا يَعْبُدُ هٰۤؤُلَآءِ:} یعنی ان کے معبودوں کے باطل ہونے یا نفع نقصان کا مالک نہ ہونے میں کسی قسم کا شک نہ کر۔ {’’ مِمَّا يَعْبُدُ هٰۤؤُلَآءِ ‘‘} ( جن کی یہ لوگ عبادت کرتے ہیں) میں ’’یہ لوگ‘‘ سے مراد مشرکین قریش ہیں۔ ابن عاشور نے لکھا ہے کہ میں نے قرآن کی اس اصطلاح کی جستجو کی تو تقریباً گیارہ مقامات میں ایسا ہی پایا۔ یہ بات میرے دل میں اللہ کی طرف سے ڈالی گئی ہے اور میں نے آیت : «{ وَ جِئْنَا بِكَ عَلٰى هٰۤؤُلَآءِ شَهِيْدًا}» [ النساء : ۴۱ ] کی تفسیر میں اس کی وضاحت کی ہے۔ [ التحریر و التنویر ] یہاں سوال پیدا ہوتا ہے کہ کیا رسول اللہ صلی اللہ علیہ وسلم کو اس قسم کا کوئی شک تھا جس سے اللہ تعالیٰ منع فرما رہا ہے؟ جو اب اس کا یہ ہے کہ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم سے فرمایا: «{ وَ اَقِمِ الصَّلٰوةَ }» [ ہود: ۱۱۴ ] ’’نماز قائم کر۔‘‘ اسی طرح فرمایا : «{ يٰۤاَيُّهَا النَّبِيُّ اتَّقِ اللّٰهَ وَ لَا تُطِعِ الْكٰفِرِيْنَ وَ الْمُنٰفِقِيْنَ }» [ الأحزاب : ۱ ] ’’اے نبی! اللہ سے ڈر اور کافروں اور منافقوں کی اطاعت نہ کر۔‘‘ تو کیا نبی صلی اللہ علیہ وسلم پہلے نماز قائم نہیں کرتے تھے؟ یا کیا آپ اس سے پہلے اللہ سے نہیں ڈرتے تھے؟ اور کیا آپ کفار و منافقین کی اطاعت کیا کرتے تھے؟ نہیں، ہر گز نہیں، اس قسم کے احکام جن پر نبی صلی اللہ علیہ وسلم اور مخلص اہل ایمان پہلے ہی کار بند ہوں، نازل کرنے سے مراد یہ ہوتی ہے کہ نبی صلی اللہ علیہ وسلم اور پہلے سے عمل کرنے والے ہمیشہ ان پر کاربند رہیں اور استقامت اختیار کریں اور دوسرے تمام انسان بھی نبی صلی اللہ علیہ وسلم کے واسطے سے اپنے آپ کو مخاطب سمجھ کر ان احکام پر عمل کریں کہ جب نبی کو یہ حکم ہے تو ہماری کیا اوقات ہے کہ ہم اس پر عمل نہ کریں۔ ¤ ➋ { مَا يَعْبُدُوْنَ اِلَّا كَمَا يَعْبُدُ اٰبَآؤُهُمْ مِّنْ قَبْلُ:’’ اٰبَآؤُهُمْ ‘‘} سے مراد عادوثمود ہیں، کیونکہ عدنانی عربوں کی ماں بنوجرہم سے تھی جو اسماعیل علیہ السلام کی بیوی تھی۔ بنو جرہم ثمود سے تھے اور قریش کی ماں بنو خزاعہ سے تھی، جو قُصی کی بیوی تھی اور عرب میں بت پرستی عمرو بن لحی نے شروع کی تھی جو خزاعی تھا۔ (ابن عاشور) یعنی ان کی غیر اللہ کی پرستش کی بنیاد سوائے باپ دادا کی اندھی تقلید کے اور کچھ نہیں ہے۔ (ابن کثیر) آبا و اجداد کی غیر اللہ کی عبادت کیا تھی؟ یہی کہ وہ اپنے بزرگوں یا ان کے بتوں یا قبروں کو مصیبت کے وقت پکارتے تھے، انھیں اللہ کا بیٹا یا جز یا عین قرار دیتے تھے۔ اسی طرح عبادت میں ان کے نام کی نذر و نیاز ماننا، اللہ کے حصے کے ساتھ جانوروں اور کھیتیوں میں ان کا حصہ رکھنا، ان کو اللہ کی صفات، مثلاً علم غیب کا مالک، دور سے فریاد سننے اور مدد کرنے والا سمجھنا سبھی شامل ہیں۔ ہر زمانے کے مشرک ایک ہی طرح کے ہوتے ہیں : «{ بَلْ قَالُوْا مِثْلَ مَا قَالَ الْاَوَّلُوْنَ }» [ المؤمنون : ۸۱ ] ’’بلکہ انھوں نے کہا جیسے پہلوں نے کہا تھا۔‘‘ اور ان کے پاس تقلیدِ آباء کے سوا کوئی دلیل نہیں ہوتی اور ان پر وہی محاورہ صادق آتا ہے کہ {’’مَا أَشْبَهَ اللَّيْلَةَ بِالْبَارِحَةِ ‘‘} ’’آج کی رات کل کی رات کے کس قدر مشابہ ہے۔‘‘ ¤ ➌ { وَ اِنَّا لَمُوَفُّوْهُمْ نَصِيْبَهُمْ غَيْرَ مَنْقُوْصٍ :} انھیں ان کا حصہ پورا پورا دینے سے مراد ایک تو یہ ہے کہ کسی شخص کی تقدیر میں دنیا کا جو رزق اور آسائشیں لکھی گئی ہیں، وہ مسلمان ہو یا کافر اسے ملیں گی، کافروں کو بھی ان کا حصہ پورا ملے گا۔ دیکھیے سورۂ بنی اسرائیل (۲۰) دوسری یہ کہ ان کی نیکیاں جو انھوں نے دنیا میں کی ہیں ان کا پورا بدلہ ہم انھیں دنیا ہی میں دے دیں گے۔ دیکھیے سورۂ احقاف (۲۰) اور تیسری یہ کہ ہم ان کی غیر اللہ کی عبادت اور شرک کا پورا پورا بدلہ دنیا میں نہیں بلکہ قیامت کے دن ضرور دینے والے ہیں۔ یہاں یہ آخری معنی زیادہ مناسب ہے، کیونکہ ان لوگوں کو نبی صلی اللہ علیہ وسلم کی برکت سے پہلی قوموں کی طرح دنیا میں آسمانی عذاب نہیں دیا گیا، جس سے ان کا نام و نشان مٹ جاتا۔"
    },
    {
      "ayah": 110,
      "tafsir": "(آیت 110) ➊ { وَ لَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ فَاخْتُلِفَ فِيْهِ:} سورۂ ہود واحد سورت ہے جس میں ایک ہی رسول کا ذکر دو بار ہوا ہے۔ اس سے پہلے یہ ذکر ہوا ہے کہ موسیٰ علیہ السلام کو حکم دیا گیا تھا کہ فرعون اور اس کے سرداروں کے پاس جائیں، آیات اور سلطان مبین پیش کریں اور جیسا کہ سورۂ طٰہٰ میں ذکر ہے، اس سے مطالبہ یہ تھا کہ بنی اسرائیل کو عذاب دینا چھوڑ دے اور انھیں آزادی دے کر میرے ساتھ بھیج دے۔ اگرچہ اس کے ساتھ توحید و رسالت کی دعوت بھی تھی، مگر وہ مسلمان ہی نہیں ہوا کہ اس کے لیے مفصل احکام نازل ہوتے۔ اس وقت تمام احکام زبانی تھے، تورات نازل نہیں ہوئی تھی، اس لیے ساتھ ہی اس کا انجام ذکر کر دیا : «{ يَقْدُمُ قَوْمَهٗ يَوْمَ الْقِيٰمَةِ فَاَوْرَدَهُمُ النَّارَ }» [ ہود : ۹۸ ] یعنی وہ قیامت کے دن اپنی قوم کے آگے چلتا ہوا انھیں جہنم میں لے جائے گا۔ ¤ موسیٰ علیہ السلام کی دوسری بعثت بنی اسرائیل کے لیے تھی۔ چنانچہ آزادی حاصل ہونے اور سمندر سے بخیریت نکل جانے کے بعد اللہ تعالیٰ نے طُور پر چالیس راتوں کا اعتکاف کروایا اور اس کے بعد انھیں تورات عطا فرمائی۔ اب موسیٰ علیہ السلام کے ساتھ فرعون یا اس کے سردار نہیں تھے، ان کے ساتھ بنی اسرائیل تھے یا فرعون کی قوم میں سے مصر سے آنے والے چند نوجوان، چنانچہ اللہ تعالیٰ نے فرمایا : «{ وَ لَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ }» کہ ہم نے موسیٰ علیہ السلام کو کتاب (تورات)  عطا فرمائی، مگر موسیٰ علیہ السلام کی زندگی میں اور اس کے بعد اس میں اختلاف کیا گیا۔ کسی نے تسلیم کیا، کسی نے انکار کر دیا، یا کسی نے کچھ احکام مان لیے کچھ نہیں، حتیٰ کہ بنی اسرائیل کی غالب اکثریت نے موسیٰ علیہ السلام کے حکم پر ارض مقدس (شام) کے حصول کے لیے جہاد پر نکلنے سے بھی صاف انکار کر دیا اور کہہ دیا کہ جا تو اور تیرا رب لڑو، ہم تو یہیں بیٹھے ہیں۔ دیکھیے سورۂ مائدہ (۲۴) پھر موسیٰ علیہ السلام کی وفات کے بعد ان پر بہت سے دور آئے، کبھی غالب  رہے، مثلاً یوشع بن نون علیہ السلام کا دور، داؤدو سلیمان علیھما السلام کا دور، کبھی مغلوب رہے، پھر آہستہ آہستہ انھوں نے اللہ کی کتاب میں ایسا اختلاف کیا کہ رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق بہتر (۷۲) گروہوں میں بٹ گئے۔ انھوں نے اپنی خواہشات کے مطابق کتاب اللہ کے معانی میں تحریف کی، غلط تاویلیں کیں، معانی بدلے، پھر الفاظ میں بھی تحریف کر دی، جیسا کہ فرمایا : «{ يُحَرِّفُوْنَ الْكَلِمَ عَنْ مَّوَاضِعِهٖ }» [ المائدۃ : ۱۳ ] ’’ وہ کلام کو اس کی جگہوں سے پھیر دیتے ہیں۔‘‘ پھر اپنے احبار و رہبان (علماء و درویش) کو اللہ تعالیٰ کی کرسی پر بٹھا دیا۔ ان کی فقہ اور ان کے اقوال و فتاویٰ کو یہ درجہ دیا کہ وہ حرام کو حلال کہتے تو حلال سمجھ لیتے، حلال کو حرام کہہ دیتے تو حرام سمجھ لیتے، فرمایا : «{ اِتَّخَذُوْۤا اَحْبَارَهُمْ وَ رُهْبَانَهُمْ اَرْبَابًا مِّنْ دُوْنِ اللّٰهِ وَ الْمَسِيْحَ ابْنَ مَرْيَمَ}» [ التوبۃ : ۳۱ ] ’’انھوں نے اپنے عالموں اور درویشوں کو اللہ کے سوا رب بنا لیا اور مسیح ابن مریم کو بھی۔‘‘ ان کے دنیا پرست علماء اللہ کی کتاب لوگوں کو سناتے ہوئے زبانوں کو ایسا پیچ دیتے کہ لوگ سمجھیں یہ اللہ ہی کی کتاب سنا رہے ہیں، حالانکہ وہ اللہ کی کتاب نہ ہوتی، پھر صاف دعویٰ کر دیتے کہ یہ اللہ کی طرف سے شرع کا حکم ہے، حالانکہ وہ اللہ کی طرف سے نہ ہوتا، فرمایا : «{ وَ اِنَّ مِنْهُمْ لَفَرِيْقًا يَّلْوٗنَ اَلْسِنَتَهُمْ بِالْكِتٰبِ لِتَحْسَبُوْهُ مِنَ الْكِتٰبِ وَ مَا هُوَ مِنَ الْكِتٰبِ وَ يَقُوْلُوْنَ هُوَ مِنْ عِنْدِ اللّٰهِ وَ مَا هُوَ مِنْ عِنْدِ اللّٰهِ وَ يَقُوْلُوْنَ عَلَى اللّٰهِ الْكَذِبَ وَ هُمْ يَعْلَمُوْنَ }» [ آل عمران : ۷۸ ] ’’اور بے شک ان میں سے یقینا کچھ لوگ ایسے ہیں جو کتاب (پڑھنے) کے ساتھ اپنی زبانیں مروڑتے ہیں، تاکہ تم اسے کتاب میں سے سمجھو، حالانکہ وہ کتاب میں سے نہیں اور کہتے ہیں کہ یہ اللہ کی طرف سے ہے، حالانکہ وہ اللہ کی طرف سے نہیں اور اللہ پر جھوٹ کہتے ہیں، حالانکہ وہ جانتے ہیں۔‘‘ پھر کچھ ایسے بدنصیب تھے جو اپنے ہاتھوں سے فتوے لکھ کر کہتے یہ اللہ کا حکم ہے، حالانکہ وہ سب کچھ انھوں نے اپنی کسی دنیوی خواہش کو پورا کرنے کے لیے لکھا ہوتا، اللہ کا حکم ہر گز نہ ہوتا اور جانتے بوجھتے اللہ پر جھوٹ باندھ دیتے، فرمایا : «{ فَوَيْلٌ لِّلَّذِيْنَ يَكْتُبُوْنَ الْكِتٰبَ بِاَيْدِيْهِمْ ثُمَّ يَقُوْلُوْنَ هٰذَا مِنْ عِنْدِ اللّٰهِ  لِيَشْتَرُوْا بِهٖ ثَمَنًا قَلِيْلًا فَوَيْلٌ لَّهُمْ مِّمَّا كَتَبَتْ اَيْدِيْهِمْ وَ وَيْلٌ لَّهُمْ مِّمَّا يَكْسِبُوْنَ }» [ البقرۃ : ۷۹ ] ’’پس ان لوگوں کے لیے بڑی ہلاکت ہے جو اپنے ہاتھوں سے کتاب لکھتے ہیں، پھر کہتے ہیں کہ یہ اللہ کے پاس سے ہے، تاکہ اس کے ساتھ تھوڑی قیمت حاصل کریں۔ پس ان کے لیے بڑی ہلاکت اس کی وجہ سے ہے جو ان کے ہاتھوں نے لکھا اور ان کے لیے بڑی ہلاکت اس کی وجہ سے ہے جو وہ کماتے ہیں۔‘‘ ¤ ہاں کچھ لوگ صراط مستقیم پر قائم رہے۔ یہ وہ تھے جو موسیٰ علیہ السلام کی کتاب اور سنت پر کسی تبدیلی یا تحریف کے بغیر قائم رہے۔ یہ نجات پانے والے تھے، مگر ان کے بہت سے لوگ اللہ کے احکام کے نافرمان ہو گئے اور اوپر مذکور ہیرا پھیریاں کرنے والے بن گئے، یا ایسی ہیرا پھیریاں کرنے والوں کے پیروکار بن گئے۔ اللہ تعالیٰ نے فرمایا : «{ مِنْهُمْ اُمَّةٌ مُّقْتَصِدَةٌ وَ كَثِيْرٌ مِّنْهُمْ سَآءَ مَا يَعْمَلُوْنَ }» [ المائدۃ : ۶۶ ] ’’ان میں سے ایک جماعت درمیانے راستے والی ہے اور ان میں سے بہت سے لوگ، برا ہے جو کر رہے ہیں۔‘‘ اس وقت یہ سارا نقشہ آنکھوں سے دیکھنا چاہیں تو ہماری امت مسلمہ میں دیکھ سکتے ہیں۔ ¤ ➋ اوپر اہل سعادت اور اہل شقاوت کا حال بیان کرنے کے بعد آخر میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ اگر آج یہ لوگ آپ پر نازل شدہ کتاب قرآن کے بارے میں طرح طرح کی باتیں بنا رہے ہیں تو آپ کبیدہ خاطر نہ ہوں، یہ کوئی نئی بات نہیں ہے، اس سے پہلے تورات کے ساتھ بھی لوگ یہی معاملہ کر چکے ہیں۔ ¤ ➌ {وَ لَوْ لَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ …:} موسیٰ علیہ السلام سے پہلے جہاد کا حکم نہ تھا، اس لیے رسول کی نافرمانی پر آسمان سے عذاب اتر آتا تھا۔ فرعون کے غرق ہونے کے بعد جہاد کا حکم ہوا، اب یا تو کفار کو مسلمانوں کے ہاتھوں عذاب دیا جائے گا، جیسے فرمایا : «{ قَاتِلُوْهُمْ يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ }» [ التوبۃ : ۱۴ ] ’’ان سے لڑو، اللہ انھیں تمھارے ہاتھوں سے عذاب دے گا۔‘‘ چنانچہ یوشع بن نون، طالوت، داؤد اور سلیمان علیھم السلام وغیرہم کے جہاد اس بات کی دلیل ہیں۔ اگر مسلمانوں کے ہاتھوں عذاب نہ ہوا تو پھرآخرت کو ہو گا۔ اگر یہ بات طے نہ ہو چکی ہوتی تو ان پر پہلی قوموں کی طرح عذاب آ چکا ہوتا۔ ہاں محدود پیمانے پر اللہ تعالیٰ کی سزا کا تازیانہ اب بھی برس سکتا ہے، جیسا کہ ’’اصحاب سبت‘‘ پر برسا اور رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق ہماری امت میں بھی ایسے واقعات پیش آئیں گے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اگر یہ بات نہ ہوتی کہ دنیا میں سچ اور جھوٹ صاف نہ ہو۔‘‘ ( موضح) ¤ ➍ {وَ اِنَّهُمْ لَفِيْ شَكٍّ مِّنْهُ مُرِيْبٍ :} بعض مفسرین نے اسس کی تفسیر کی ہے کہ موسیٰ علیہ السلام کی قوم تورات کے بارے میں ایک بے چین رکھنے والے شک میں مبتلا ہے، نہ اسے اس کے سچا ہونے کا یقین ہے نہ جھوٹا ہونے کا اور حق کا انکار کرنے والوں کا یہی حال ہوتا ہے کہ ان کا دل اسے سچا مانتا ہے، مگر دنیاوی خواہشات اسے ماننے کی اجازت نہیں دیتیں، اسی تذبذب میں کفر ہی پر دنیا سے گزر جاتے ہیں۔ بعض نے یہ تفسیر کی کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے کے ایمان نہ لانے والے قرآن کے متعلق بے چین رکھنے والے شک میں مبتلا ہیں۔ مگر پہلی تفسیر زیادہ درست معلوم ہوتی ہے، کیونکہ ذکر موسیٰ علیہ السلام ، تورات اور ان کی قوم کا ہو رہا ہے۔ (واللہ اعلم)"
    },
    {
      "ayah": 111,
      "tafsir": "(آیت 111) ➊ {وَ اِنَّ كُلًّا لَّمَّا لَيُوَفِّيَنَّهُمْ …:’’ كُلًّا ‘‘} میں تنوین عوض کی ہے، یعنی اس کا مضاف الیہ محذوف ہے۔ اصل میں تھا {’’ كُلُّهُمْ‘‘ } یا {’’ كُلُّ هٰؤُلَاءِ‘‘} (یہ سب لوگ) {’’ لَمَّا ‘‘} کا معنی ’’جب‘‘ ہے، یہ حرفِ شرط ہے جس کی شرط محذوف ہے۔ {’’لَيُوَفِّيَنَّهُمْ ‘‘} اس کی جزا ہے۔ وہ محذوف شرط {’’ لَمَّا ‘‘} کے معنی کے مطابق نکالی جائے گی، یعنی {’’ لَمَّا جَاءَ أَجَلُهُمْ‘‘} یعنی بے شک یہ سب لوگ (جب ان کا وقت آئے گا) تو یقینا انھیں ان کا رب ان کے اعمال کا ضرور پورا پورا بدلہ دے گا۔ چونکہ وہ لوگ قیامت کے منکر تھے، اس لیے اس جملے میں کئی طرح سے تاکید آئی ہے۔ {’’ اِنَّ ‘‘} ، لام تاکید اور نون ثقیلہ۔ {’’ لَمَّا ‘‘} کا مابعد حذف کرنے سے بھی ایک ہیبت پیدا ہو رہی ہے، کیونکہ خود لفظ {’’ لَمَّا ‘‘} میں وقت کا مفہوم شامل ہے، یعنی جب وہ وقت آئے گا۔( {’’ اِنَّ كُلًّا لَّمَّا ‘‘} کی یہ سب سے واضح اور آسان توجیہ ہے) دیکھیے تفسیر الشعراوی۔ تفسیر نسفی میں ہے : {’’ قَالَ صَاحِبُ الْإِيْجَازِ ’’لَمَّا‘‘ فِيْهِ مَعْنَي الظَّرْفِ وَقَدْ دَخَلَ فِي الْكَلاَمِ اخْتِصَارٌ كَأَنَّهُ قِيْلَ ’’وَإِنَّ كُلاًّ لَّمَّا بُعِثُوْا لَيُوَفِّيَنَّهُمْ رَبُّكَ‘‘} مطلب وہی ہے جو اوپر گزرا، البتہ انھوں نے {’’ لَمَّا جَاءَ أَجَلُهُمْ ‘‘ } کے بجائے {’’ لَمَّا بُعِثُوْا ‘‘} محذوف نکالا ہے۔ ¤ ➋ {اِنَّهٗ بِمَا يَعْمَلُوْنَ خَبِيْرٌ: } اس میں اعمال کی جزا پوری پوری دینے کی وجہ بیان کی ہے کہ وہ ان کے اعمال سے پوری طرح باخبر ہے، اس لیے عمل نیک ہو یا بد اس کا پورا پورا بدلہ ملے گا۔"
    },
    {
      "ayah": 112,
      "tafsir": "(آیت 112) ➊ {فَاسْتَقِمْ كَمَاۤ اُمِرْتَ وَ مَنْ تَابَ مَعَكَ : ’’ فَاسْتَقِمْ ‘‘} میں سین اور تاء کا اضافہ یا تو طلب کے لیے ہے، معنی یہ ہو گا کہ اللہ تعالیٰ سے اس طرح سیدھا اور قائم رہنے کی درخواست کرتا رہ جس طرح تجھے حکم دیا گیا ہے اور یہ اضافہ مبالغے اور تاکید کے لیے بھی ہو سکتا ہے۔ قرطبی نے فرمایا، استقامت دائیں یا بائیں طرف جائے بغیر ایک طرف کو سیدھے چلتے چلے جانا ہے۔ یہ معنی یہاں زیادہ مناسب ہے۔ پہلا معنی بھی درست ہے اور اس پر عمل کرتے ہوئے ہی ہم ہر رکعت میں صراط مستقیم کی ہدایت کی دعا کرتے ہیں۔ استقامت کا معنی باطل کے دونوں کناروں افراط اور تفریط (زیادتی اور کمی) سے بچ کر ان کے عین درمیان سیدھا رہنا ہے۔ یہ نہایت مشکل کام ہے۔ پہلے تو ہر وقت اس کا خیال رکھنا ہی مشکل ہے کہ عین صحیح راستہ کیا ہے؟ پھر اس پر قائم رہنا اس سے بھی مشکل ہے۔ رازی نے اسے ایک مثال سے سمجھایا ہے کہ دھوپ اور چھاؤں کے درمیان ایک جگہ ہے۔ اس کا معلوم کرنا اور ہر وقت اس کا خیال رکھنا کس قدر مشکل ہو گا۔ اس لیے اہل علم فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے جو فرمایا تھا: [ شَيَّبَتْنِيْ هُوْدٌ ] [ترمذی: ۳۲۹۷] ’’مجھے سورۂ ہود نے بوڑھا کر دیا۔‘‘ اس کا سبب انبیاء علیھم السلام کی قوموں پر عذاب کے واقعات کے بجائے یہ حکم ہے : «{ فَاسْتَقِمْ كَمَاۤ اُمِرْتَ } » ¤ ➋ {’’ فَاسْتَقِمْ كَمَاۤ اُمِرْتَ ‘‘} سے معلوم ہوا کہ سیدھا راستہ جس پر خوب ثابت رہنے کا حکم ہے، صرف وہ ہے جو اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کی طرف وحی فرمایا۔ یہاں استقامت کا حکم نبی صلی اللہ علیہ وسلم اور ان تمام لوگوں کو ہے جو کفر سے توبہ کر کے آپ کے ساتھ اہل ایمان میں داخل ہوئے، مگر سب کو کس چیز پر استقامت کا حکم ہے، صرف اس پر جسے {’’ كَمَاۤ اُمِرْتَ ‘‘} کے الفاظ میں بیان کیا ہے۔ یعنی صرف اس پر جس کا حکم نبی صلی اللہ علیہ وسلم کو دیا گیا ہے، کیونکہ اللہ کی طرف سے امر صرف نبی صلی اللہ علیہ وسلم کو ہوا ہے، آپ کے سوا ابوبکر رضی اللہ عنہ سے لے کر امت کے آخری شخص تک ایک بھی شخص ایسا نہیں جو مامور من اللہ ہو اور جسے وحی کے ذریعے سے حکم ملتا ہو۔ آپ صلی اللہ علیہ وسلم کے سوا ایک شخص بھی ایسا نہیں جس کی رائے اللہ کا حکم یا دین ہو، جس پر امت کو قائم رہنے کا حکم ہو۔ اس سے تمام تقلیدی گروہوں کا استقامت سے ہٹ جانا ثابت ہوا۔ نجات چاہتے ہیں تو تمام لوگوں کی رائے، قیاس اور تقلیدی گروہ بندی چھوڑ کر صرف کتاب و سنت کو لازم پکڑنا ہو گا۔ ¤ ➌ استقامت (اللہ کے حکم پر پوری طرح قائم رہنا) ایک نہایت جامع لفظ ہے، جس میں پوری شریعت آ جاتی ہے۔ عقائد میں اللہ کی صفات پر اس طرح ایمان جس طرح اس نے حکم دیا ہے کہ اللہ تعالیٰ کی نہ کسی صفت کا انکار کرنا (تعطیل)، نہ اسے مخلوق کی صفات جیسا سمجھنا (تشبیہ) بلکہ جیسا اللہ کی شان کے لائق ہے۔ اعمال میں نہ کسی حکم پر عمل چھوڑنا (نافرمانی) اور نہ آپ صلی اللہ علیہ وسلم سے آگے بڑھنا یا آپ سے الگ راستہ نکالنا (رہبانیت اور بدعت)۔ اخلاق میں، مثلاً نہ بخل کرنا نہ بے جا خرچ کرنا۔ غرض ہر چیز میں عین نبی صلی اللہ علیہ وسلم کا صحیح راستہ معلوم کرکے اس پر قدم بہ قدم چلنا استقامت ہے۔ سفیان بن عبد اللہ ثقفی رضی اللہ عنہ کہتے ہیں کہ میں نے کہا، یا رسول اللہ! آپ مجھے اسلام میں کوئی ایسی بات بتلائیں کہ آپ کے بعد مجھے کسی اور سے پوچھنے کی ضرورت نہ رہے؟ فرمایا : [ قُلْ آمَنْتُ بِاللّٰهِ ثُمَّ اسْتَقِمْ ] ’’کہو میں اللہ پر ایمان لایا، پھر اس پر خوب ثابت قدم رہ۔‘‘ [ مسلم، الإیمان، باب جامع أوصاف الإسلام : ۳۸ ] استقامت کے اجر اور فضیلت کے لیے دیکھیے سورۂ حٰم السجدہ (۳۰) اور احقاف ( ۱۳)۔ ¤ ➍ {وَ لَا تَطْغَوْا: ’’ طَغٰي يَطْغَي طُغْيَانًا ‘‘} حد سے بڑھنا، یعنی شریعت کی اطاعت کے لیے اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم نے جو حدیں مقرر کر دی ہیں اپنے آپ کو انھی کے اندر رکھو، ان سے باہر نکلنے کی کوشش نہ کرو۔ زندگی کے کسی معاملے میں بھی ان سے تجاوز حرام ہے۔ انس بن مالک رضی اللہ عنہ فرماتے ہیں کہ تین آدمی نبی صلی اللہ علیہ وسلم کی بیویوں کے گھروں کی طرف آئے۔ وہ نبی صلی اللہ علیہ وسلم کی عبادت کے بارے میں پوچھ رہے تھے، جب انھیں بتایا گیا تو گویا انھوں نے اسے کم سمجھا اور کہنے لگے : [ وَأَيْنَ نَحْنُ مِنَ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ ؟ قَدْ غُفِرَ لَهٗ مَا تَقَدَّمَ مِنْ ذَنْبِهٖ وَمَا تَأَخَّرَ، قَالَ أَحَدُهُمْ أَمَّا أَنَا فَإِنِّيْ اأُصَلِّي اللَّيْلَ أَبَدًا ، وَ قَالَ آخَرُ أَنَا أَصُوْمُ الدَّهْرَ وَلاَ أُفْطِرُ، وَقَالَ آخَرُ أَنَا أَعْتَزِلُ النِّسَاءَ فَلاَ أَتَزَوَّجُ أَبَدًا، فَجَاءَ إِلَيْهِمْ رَسُوْلُ اللّٰهِ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَنْتُمُ الَّذِيْنَ قُلْتُمْ كَذَا وَ كَذَا؟ أَمَا وَاللّٰهِ ! إِنِّيْ لَأَخْشَاكُمْ لِلّٰهِ وَأَتْقَاكُمْ لَهٗ لٰكِنِّيْ أَصُوْمُ وَأُفْطِرُ، وَ أُصَلِّيْ وَأَرْقُدُ، وَ أَتَزَوَّجُ النِّسَاءَ، فَمَنْ رَغِبَ عَنْ سُنَّتِيْ فَلَيْسَ مِنِّيْ ] [ بخاری، النکاح، باب الترغیب في النکاح : ۵۰۶۳ ] ’’ہماری رسول اللہ صلی اللہ علیہ وسلم سے کیا نسبت؟ اللہ تعالیٰ نے تو آپ کے پہلے پچھلے گناہ معاف کر دیے ہیں۔‘‘ ان میں سے ایک نے کہا : ’’میں تو ہمیشہ رات بھر نماز پڑھوں گا۔‘‘ دوسرے نے کہا : ’’میں ہمیشہ روزہ رکھوں گا۔‘‘ تیسرے نے کہا : ’’میں عورتوں سے نکاح نہیں کروں گا۔‘‘ جب رسول اللہ صلی اللہ علیہ وسلم آئے تو آپ نے فرمایا : ’’تم لوگوں نے اس اس طرح کہا ہے؟ یاد رکھو، اللہ کی قسم! میں تم سب سے زیادہ اللہ کی خشیت رکھنے والا اور تم سب سے زیادہ اس سے ڈرنے والا ہوں، لیکن میں تو روزہ رکھتا ہوں اور نہیں بھی رکھتا اور نماز پڑھتا ہوں اور سو بھی جاتا ہوں اور میں عورتوں سے نکاح بھی کرتا ہوں، تو جو شخص میری سنت (میرے طریقے) سے بے رغبتی کرے وہ مجھ سے نہیں۔‘‘ رہے روزانہ ایک ہزار رکعتیں پڑھنے والے، چالیس سال تک عشاء اور فجر ایک وضو سے پڑھنے والے، بارہ سال بھوکے جنگل میں عبادت کرنے والے حضرات، تو یا تو صاف ان پر جھوٹ باندھا گیا ہے، کیونکہ یہ انسان کے بس کی بات ہی نہیں، یا پھر وہ اسی طغیانی کا شکار تھے جس سے اللہ تعالیٰ نے منع کیا ہے۔ (نعوذ باللہ) ¤ ➎ { اِنَّهٗ بِمَا تَعْمَلُوْنَ بَصِيْرٌ :} یعنی استقامت اختیار کرو یا طغیانی، اللہ تعالیٰ تمھارا عمل سب دیکھ رہا ہے۔"
    },
    {
      "ayah": 113,
      "tafsir": "(آیت 113) ➊ {وَ لَا تَرْكَنُوْۤا اِلَى الَّذِيْنَ ظَلَمُوْا:’’رَكِنَ‘‘} (ن، ع، ف) مائل ہونا۔ (1) { ’’ الَّذِيْنَ ظَلَمُوْا ‘‘} اور {’’اَلظَّالِمِيْنَ‘‘} میں فرق ہے۔ {’’ الَّذِيْنَ ظَلَمُوْا ‘‘} وہ لوگ جنھوں نے ظلم کیا، خواہ کبھی کبھار کیا ہو اور {’’اَلظَّالِمِيْنَ‘‘} ظلم کرنے والے، جن کی روش ہی یہ ہے۔ جب پہلی قسم کے لوگوں کی طرف مائل ہونے سے منع فرمایا تو دوسری قسم کی طرف مائل ہونے کا آپ خود اندازہ کر لیں۔ (2) جب ان کی طرف مائل ہونا منع ہے جنھوں نے ظلم کیا تو خود کسی پر ظلم کرنا اللہ تعالیٰ کی نگاہ میں کس قدر قبیح ہو گا۔ حدیث قدسی ہے، اللہ تعالیٰ نے فرمایا : [ يَا عِبَادِيْ ! إِنِّيْ حَرَّمْتُ الظُّلْمَ عَلٰی نَفْسِيْ وَ جَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا، فَلَا تَظَالَمُوْا ] [ مسلم، البر والصلۃ، باب تحریم الظلم : ۲۵۷۷، عن أبي ذر رضی اللہ عنہ ] ’’اے میرے بندو! میں نے کسی پر ظلم کرنا خود اپنے آپ پر حرام کر رکھا ہے اور اسے تمھارے درمیان بھی حرام کر دیا، سو تم ایک دوسرے پر ظلم مت کرو۔‘‘ اور نبی صلی اللہ علیہ وسلم نے فرمایا : [ اِتَّقُوْا الظُّلْمَ فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَّوْمَ الْقِيَامَةِ ] [ مسلم، البر والصلۃ، باب تحریم الظلم : ۲۵۷۸، عن جابر بن عبد اللہ رضی اللہ عنھما ] ’’ظلم سے بچو، کیونکہ ظلم قیامت کے دن کئی اندھیرے ہو گا۔‘‘ (3) ظلم میں شرک اور دوسرے تمام ظلم شامل ہیں، یعنی جو لوگ ظلم کی طرف مائل ہوں ان سے کوئی دوستی اور محبت نہ رکھو، چاہے وہ کافر ہوں یا نام کے مسلمان۔ (شوکانی) (4) ان کی طرف مائل ہونے میں ان کے ساتھ محبت، ان کے ساتھ مجلس آرائی، ان کے پاس بیٹھنا، انھیں ملنے کے لیے جانا، ان کے ظلم پر چپ رہنا، ان کے کاموں پر خوش ہونا، ان جیسا بننا، ان کا فیشن اختیار کرنا، ان کا ذکر عزت اور تعظیم کے ساتھ کرنا، سب کچھ شامل ہے۔ {’’ رُكُوْنٌ ‘‘} (مائل ہونے) کا کم از کم مرتبہ پاس رہ کر چپ رہنا اور آخری مرتبہ ظلم پر ان کی حوصلہ افزائی اور مدد ہے ۔ ¤ ➋ { فَتَمَسَّكُمُ النَّارُ … : ’’ وَ لَا تَرْكَنُوْۤا ‘‘} نہی کے جواب میں فاء نے {’’ تَمَسَّ‘‘} مضارع کو نصب دیا ہے۔ اس آیت سے ظالم حکمرانوں، سرداروں اور چودھریوں سے ربط و تعلق کی ممانعت نکلتی ہے۔ ہاں ان کے شر سے بچنے کے لیے یا مصلحت عامہ یا دعوت دین یا دینی ضرورت کے تقاضے کے پیش نظر ان سے میل جول رکھے تو اس کی اجازت ہے، بشرطیکہ دل میں ان کے ظلم کی وجہ سے نفرت رکھے، جیسا کہ سورۂ آل عمران (۲۸) اور بعض احادیث میں آیا ہے۔ غرض ظلم کرنے والوں سے دلی محبت یا میلان کسی صورت ججائز نہیں، البتہ مجبوری کی وجہ سے ان کے پاس جانا، نصیحت کرنا، ان کے ظلم پر مجبوراً خاموش رہنا یا دین کی مصلحت اور حق کی دعوت و تاکید کے لیے ربط و تعلق رکھنا الگ بات ہے۔ ¤ ➌ {ثُمَّ لَا تُنْصَرُوْنَ:} اس آیت سے ثابت ہوتا ہے کہ حاکم اگر ظالم اور بدکار ہو تو اس کی اطاعت اسی وقت ہے جب وہ ظلم یا شریعت کی نافرمانی کا حکم نہ دے۔ اگر وہ شریعت کے خلاف حکم دے تو اس کی اطاعت جائز نہیں، الا یہ کہ اس کے ضرر سے بچنے کے لیے بظاہر اطاعت کا اظہار کرے اور دل میں برا سمجھے، جیسا کہ اوپر سورۂ آل عمران کے حوالے سے گزرا۔ حاکم کی اطاعت اس وقت فرض ہے : (1) جب وہ مسلمان ہو۔ دیکھیے سورۂ نساء (۵۹)۔ (2) مسلمانوں میں اقامت ِصلوۃ جاری رکھے۔ دیکھیے مسلم (۱۸۵۵)۔ (3) اس سے کھلم کھلا کفر کا ظہور نہ ہو۔ دیکھیے بخاری (۷۰۵۶)۔ (4) اور وہ اللہ کی نافرمانی کا حکم نہ دے۔ دیکھیے بخاری (۷۱۴۴)۔ {’’ وَ مَا لَكُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ اَوْلِيَآءَ ثُمَّ لَا تُنْصَرُوْنَ ‘‘} سے یہ بھی معلوم ہوا کہ ظالم حکمرانوں کی حمایت اور ان کی طرف میلان کا نتیجہ آخرت کے عذاب کے علاوہ اللہ تعالیٰ کی ولایت (دوستی و حمایت) اور اس کی نصرت(مدد) سے محرومی بھی ہے۔ آج یہ حقیقت ہر شخص اپنی آنکھوں سے دیکھ رہا ہے۔"
    },
    {
      "ayah": 114,
      "tafsir": "(آیت 114) ➊ اس آیت اور اس کے بعد والی آیات میں استقامت کا اور طغیانی اور ظالموں کی طرف میلان سے اجتناب کا طریقہ بتایا ہے، وہ ہے اللہ تعالیٰ سے خاص تعلق، جو نماز سے حاصل ہوتا ہے اور صبر کرنا اور برائی اور فساد فی الارض سے منع کرتے رہنا۔ ¤ ➋ {وَ اَقِمِ الصَّلٰوةَ:} اقامت کا معنی سیدھا کرنا، مراد نماز کو اس کے اوقات پر سنت کے مطابق پورے ارکان اور خشوع و اخلاص کے ساتھ ادا کرنا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے مالکک بن حویرث رضی اللہ عنہ سے فرمایا : [ صَلُّوْا كَمَا رَأَيْتُمُوْنِيْ أُصَلِّيْ ] [ بخاری، الأذان، باب الأذان للمسافرین إذا کانوا… : ۶۳۱ ] ’’نماز پڑھو جس طرح تم نے مجھے دیکھا ہے کہ میں نماز پڑھتا ہوں۔‘‘ قرطبی نے فرمایا کہ مفسرین میں سے کسی کا اختلاف نہیں کہ یہاں اس سے مراد فرض نماز ہے۔ ¤ ➌ ایمان کے بعد سب سے زیادہ زور اقامت ِصلاۃ پر دیا گیا ہے اور اسے کفر و ایمان کے درمیان فرق قرار دیا گیا ہے، کیونکہ روزانہ پانچ دفعہ مسجد میں جا کر اللہ کے سامنے حاضری میں ارکانِ اسلام کا کچھ نہ کچھ حصہ آ جاتا ہے۔ کلمہ ٔ اسلام تشہد میں موجود ہے، پوری نماز کے دوران میں کھانے پینے سے بلکہ دنیا کے ہر کام سے پرہیز روزے کا عکس ہے، اپنے کاروبار کو چھوڑ کر آنا اس شخص کے بس کی بات نہیں جو زکوٰۃ نہ دے سکتا ہو اور قبلے کی طرف رخ حج کی یاد دلاتا ہے۔ ¤ ➍ {طَرَفَيِ النَّهَارِ :} دن کے دو کنارے۔ طلوع فجر سے غروب آفتاب تک نہار (دن) ہوتا ہے، اس میں تین نمازیں آجاتی ہیں۔ زوال سے پہلے والے کنارے میں فجر اور زوال کے بعد والے میں ظہر اور عصر۔ {’’ زُلَفًا ‘‘ ’’ زُلْفَةٌ ‘‘} کی جمع ہے، جیسے {’’غُرْفَةٌ ‘‘} کی جمع {’’غُرَفٌ‘‘} ہے، اس سے مراد دن کے آخری حصے کے قریب کے اوقات ہیں، کیونکہ {’’اِزْلَافٌ‘‘} کا معنی قرب ہے، جیسا کہ فرمایا : «{ وَ اُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِيْنَ }» [ الشعراء : ۹۰ ] ’’اور جنت متقی لوگوں کے لیے قریب لائی جائے گی۔‘‘ اور فرمایا : «{ مَا نَعْبُدُهُمْ اِلَّا لِيُقَرِّبُوْنَاۤ اِلَى اللّٰهِ زُلْفٰى }» [ الزمر : ۳ ] ’’ہم ان کی عبادت نہیں کرتے مگر اس لیے کہ یہ ہمیں اللہ سے قریب کر دیں۔‘‘ اس سے مراد مغرب اور عشاء ہیں، کیونکہ وہ دن کے قریب ہوتی ہیں۔ اس طرح اس آیت میں پانچوں نمازیں آ جاتی ہیں۔ علماء نے لکھا ہے کہ اگر ان آیات کا نزول معراج کے بعد ہوا ہو تو اجمالی طور پر ان میں پانچوں نمازیں آ جاتی ہیں، البتہ چونکہ یہ سورت مکی ہے، اس لیے ہو سکتا ہے کہ یہ آیات معراج میں پانچ نمازیں فرض ہونے سے پہلے نازل ہوئی ہوں اور ان آیات سے دن کے دونوں کنارے سورج نکلنے سے پہلے (فجر) اور غروب ہونے سے پہلے (عصر) کی نماز ہی فرض ہو اور رات کی گھڑیوں سے مراد تہجد ہو جو پہلے آپ صلی اللہ علیہ وسلم پر اور تمام امت پر فرض تھی، پھر اس کی فرضیت منسوخ ہو گئی، البتہ اس کی تاکید اور فضیلت باقی رہی۔ اصل یہ ہے کہ تفصیلی طور پر نماز پنج گانہ کے اوقات کی تعیین اور تفصیل حدیث ہی سے ملتی ہے اور قرآن مجید پر عمل حدیث کے بغیر ممکن ہی نہیں۔ منکرین حدیث میں سے پہلے کچھ لوگ قرآن میں تین نمازیں مانتے تھے، پھر دوپر آ گئے، بعد والے ایک پر آ گئے اور پرویز نے رسول اللہ صلی اللہ علیہ وسلم کے زمانہ سے لے کر اب تک متواتر احادیث اور متواتر عمل کے ساتھ آنے والے نماز کے طریقے کا سرے ہی سے انکار کر دیا اور حقیقت یہی ہے کہ صرف قرآن سے نہ نماز کے مکمل اوقات معلوم ہو سکتے ہیں، نہ اس کے ارکان، نہ ارکان کی ترتیب، نہ رکعات کی تعداد اور نہ شروع یا ختم کرنے کا طریقہ، غرض حدیث ترک کرنے کا لازمی نتیجہ یہ ہے کہ قرآن پر عمل سے جان چھوٹ جائے اور یہی ان بد نصیب لوگوں کی دلی خواہش ہے جو ان شاء اللہ کبھی پوری نہیں ہو گی۔ اللہ تعالیٰ سب کو ہدایت دے۔ ¤ ➎ { اِنَّ الْحَسَنٰتِ يُذْهِبْنَ السَّيِّاٰتِ:} پچھلے جملے میں اللہ کے حکم پر استقامت میں اور ظالموں  کی طرف میلان سے محفوظ رہنے میں مدد کرنے والی سب سے مضبوط چیز بتائی تھی کہ فلاں فلاں وقت میں نماز قائم کرو، اب اس کی وجہ بتائی۔ عموماً {’’ اِنَّ ‘‘} تعلیل یعنی وجہ بتانے کے لیے آتا ہے۔ وجہ یہ ہے کہ نیکی گناہ کو مٹا دیتی ہے۔ ابوذر رضی اللہ عنہ راوی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَأَتْبِعِ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا ] [ مسند أحمد : 153/5، ح : ۲۱۴۱۲۔ ترمذی : ۱۹۸۷۔ صحیح الجامع : ۹۷، وحسنہ الألبانی ] ’’برائی کے بعد ساتھ ہی نیکی کر تو یہ اسے مٹا دے گی۔‘‘ نماز بھی ایک ایسی ہی نیکی ہے جس سے گناہ معاف ہو جاتے ہیں۔ ابن مسعود رضی اللہ عنہ فرماتے ہیں کہ ایک آدمی نے کسی اجنبی عورت کا بوسہ لیا، پھر (ازراہ ندامت) نبی صلی اللہ علیہ وسلم کے پاس آ کر سوال کرنے لگا، اس پر یہ آیت نازل ہوئی، «{ اِنَّ الْحَسَنٰتِ يُذْهِبْنَ السَّيِّاٰتِ }» تو اس آدمی نے کہا : ’’یا رسول اللہ! یہ  صرف میرے لیے ہے؟‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا: [ لِجَمِيْعِ أُمَّتِيْ كُلِّهِمْ ] ’’یہ میری ساری امت کے لیے ہے۔‘‘ [ بخاری، مواقیت الصلٰوۃ، باب الصلاۃ کفارۃ : ۵۲۶ ] ¤ شاہ عبد القادر رحمہ اللہ فرماتے ہیں :’’نیکیاں دور کرتی ہیں برائیوں کو تین طرح : (1) جو نیکیاں کرے اس کی برائیاں معاف ہوں۔ (2) اور جو نیکیاں پکڑے اس سے خو برائی کی چھوٹے۔ (3) اور جس ملک میں نیکیوں کا رواج ہو وہاں ہدایت آئے اور گمراہی مٹے، لیکن تینوں جگہ وزن غالب چاہیے، جتنا میل اتنا صابن۔‘‘ (موضح) ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : [ أَرَأَيْتُمْ لَوْ أَنَّ نَهْرًا بِبَابِ أَحَدِكُمْ يَغْتَسِلُ فِيْهِ كُلَّ يَوْمٍ خَمْسًا، مَا تَقُوْلُ ذٰلِكَ يُبْقِيْ مِنْ دَرَنِهِ؟ قَالُوْا لاَ يُبْقِيْ مِنْ دَرَنِهِ شَيْئًا، قَالَ فَذٰلِكَ مَثَلُ الصَّلَوَاتِ الْخَمْسِ يَمْحُو اللّٰهُ بِهِ الْخَطَايَا ] [ بخاری، مواقیت الصلٰوۃ، باب الصلوات الخمس کفارۃ : ۵۲۸ ] ’’اگر تم میں سے کسی کے دروازے پر ایک نہر ہو جس میں وہ روزانہ پانچ دفعہ غسل کرے تو تمھارا کیا کہنا ہے کہ یہ اس کی میل میں سے کچھ باقی چھوڑے گا؟‘‘ انھوں نے کہا : ’’وہ اس کی میل میں سے کچھ باقی نہیں چھوڑے گا۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یہی پانچوں نمازوں کی مثال ہے، اللہ تعالیٰ ان کے ساتھ خطاؤں کو مٹا دیتا ہے۔‘‘"
    },
    {
      "ayah": 115,
      "tafsir": "(آیت 115) {وَ اصْبِرْ فَاِنَّ اللّٰهَ لَا يُضِيْعُ …:} نماز کے ساتھ دوسری چیز جو استقامت علی الحق میں اور ظلم کی طرف میلان سے روکنے میں بے حد مددگار ہے وہ صبر ہے، فرمایا : «{ وَ اسْتَعِيْنُوْا بِالصَّبْرِ وَ الصَّلٰوةِ }» [ البقرۃ : ۴۵ ] ’’اور صبر اور نماز کے ساتھ مدد طلب کرو۔‘‘ مفردات راغب میں ہے : ’’صبر کا معنی کسی کو تنگی میں روک کر رکھنا ہے، کہا جاتا ہے : {’’صَبَرْتُ الدَّابَّةَ‘‘} ’’میں نے جانور کو چارے کے بغیرباندھ رکھا‘‘ اور{ ’’صَبَرْتُ فُلاَنًا‘‘ } ’’میں نے اس کا ایسا پیچھا کیا جس سے وہ کسی طرح نکل نہ سکے۔‘‘ صبر نفس کو اس چیز پر روک کر اور باندھ کر رکھتا ہے جس کا تقاضا عقل اور شرع کرتی ہیں، یا اس چیز سے باندھ کر اور روک کر رکھتا ہے جس سے روکنے کا عقل اور شرع تقاضا کرتی ہیں۔‘‘ اہل علم عموماً صبر کی تین قسمیں بتاتے ہیں : (1) اپنے آپ کو نیکی پر باندھ کر اور ہمیشہ کے لیے اس کا پابند بنا کر رکھنا۔ (2) اپنے آپ کو ہمیشہ اللہ کی نافرمانی سے روک کر رکھنا۔ (3) مصیبت پر جزع فزع کے بجائے اللہ کی تقدیر پر راضی رہنے کا پابند بنانا۔ استقامت کے لیے صبر کی ضرورت واضح ہے۔ اللہ تعالیٰ نے زیر تفسیر آیت کی طرح قرآن میں بہت سی جگہوں پر صبر کا ذکر فرمایا، حتیٰ کہ فرمایا : «{ اِنَّمَا يُوَفَّى الصّٰبِرُوْنَ اَجْرَهُمْ بِغَيْرِ حِسَابٍ }» [ الزمر : ۱۰ ] ’’صرف صبر کرنے والوں ہی کو ان کا اجر بغیر حساب کے دیا جائے گا۔‘‘"
    },
    {
      "ayah": 116,
      "tafsir": "(آیت 116) {فَلَوْ لَا كَانَ مِنَ الْقُرُوْنِ …: ’’ لَوْ لَا ‘‘} کے دو معانی ہیں، پہلا یہ کہ ’’اگر یہ نہ ہوتا‘‘ مثلاً {’’ لَوْ لَا عَلِيٌّ لَهَلَكَ عُمَرُ ‘‘} ’’اگر علی نہ ہوتے تو عمر ہلاک ہو جاتے۔‘‘ دوسرا معنی {’’ هَلاَّ ‘‘} یعنی ’’ایسا کیوں نہ ہوا‘‘ یہ ترغیب کے لیے ہوتا ہے، یعنی ایسا ہونا چاہیے تھا، یہاں یہی معنی مراد ہے۔{ ’’ قَرْنٌ ‘‘} ایک نسل کے لوگ۔ یہ لفظ عموماً ایک صدی پر بولا جاتا ہے۔ {’’ اُولُوْا بَقِيَّةٍ ‘‘} اچھی عادات و خصائل اور عقل والے لوگ۔ اصل میں {’’ بَقِيَّةٍ ‘‘} ان نفیس اور منتخب چیزوں کو کہا جاتا ہے جنھیں انسان اپنے فائدے کے لیے بچا بچا کر باقی رکھتا ہے، جیسے کہتے ہیں : {’’ بَقِيَّةُ السَّلَفِ ‘‘} یعنی پہلے لوگوں میں سے بہترین آدمی۔ ¤ پہلی تمام قوموں کے واقعات کے بعد اب خلاصہ بیان ہو رہا ہے کہ تم سے پہلے ان لوگوں میں ایسے اصحاب خیر کیوں نہ ہوئے جو اہل شر اور اہل فساد کو فساد فی الارض سے روکتے، یعنی ایسے لوگوں کی موجودگی نہایت ضروری تھی۔ پھر فرمایا، ایسے لوگ تھے تو سہی مگر نہایت تھوڑے، جن کی کچھ پیش نہ چلی، چنانچہ جب دوسروں پر عذاب آیا تو ان قلیل لوگوں کو ہم نے عذاب سے بچا لیا۔ اس میں مسلمانوں کو بھی تنبیہ ہے کہ جب تک ان میں ایسے اصحاب خیر موجود رہیں گے جو نیکی کا حکم دیں اور برائی سے منع کریں اور ایسے اصحاب خیر بالکل تھوڑے اور بے اثر نہیں ہوں گے تو اس وقت تک عذاب نہیں آئے گا۔ پھر پہلوں کی ہلاکت کا سبب بیان فرمایا کہ وہ ان نعمتوں اور خوش حالیوں میں پڑ کر اپنی خسیس خواہشات کے پیچھے ایسے لگے کہ وہ عذاب کے قابل مجرم بن گئے۔"
    },
    {
      "ayah": 117,
      "tafsir": "(آیت 117){وَ مَا كَانَ رَبُّكَ لِيُهْلِكَ …:} یعنی اگر وہ لوگ مجرم ہونے کے بجائے مصلح ہوتے، پھر انھیں عذاب کے ساتھ ہلاک کیا جاتا تو یہ صاف ظلم تھا اور اللہ تعالیٰ کبھی ایسا ظلم نہیں کرتا کہ کسی بستی والے لوگ فساد نہ کریں بلکہ اصلاح کریں اور امر بالمعروف اور نہی عن المنکرکرتے ہوں اور پھر بھی اللہ تعالیٰ ان پر عذاب بھیج دے، کیونکہ یہ ظلم ہو گا اور اللہ تعالیٰ کسی صورت بھی ظلم کرنے والا نہیں۔ بعض اہل علم نے ظلم سے مراد شرک لے کر یہ معنی کیا ہے کہ اللہ تعالیٰ دنیا میں کسی بستی کو صرف شرک کی وجہ سے ہلاک نہیں کرتا، جب کہ اس کے رہنے والے زمین میں فساد نہ کرتے ہوں، بلکہ آپس کے تعلقات میں اصلاح رکھتے ہوں۔ ہلاک اسی وقت کرتا ہے جب وہ حد سے بڑھ کر زمین میں فساد پھیلانے لگیں، مگر پہلا معنی زیادہ درست ہے۔"
    },
    {
      "ayah": 118,
      "tafsir": "(آیت 119،118) ➊ {وَ لَوْ شَآءَ رَبُّكَ لَجَعَلَ النَّاسَ اُمَّةً وَّاحِدَةً:} یعنی اے میرے رسوول! تیری خواہش تو یہ ہے کہ سب لوگ مسلمان ہو جائیں، ایک بھی کافر نہ رہے (دیکھیے شعراء : ۳) اور یہ بات تیرے رب پر کچھ مشکل بھی نہیں، جب اس نے جن و انس کے سوا باقی پوری مخلوق کو اپنی اطاعت کا پابند بنا رکھا ہے تو وہ جن و انس کو بھی ایک ہی امت بنا سکتا تھا کہ کوئی کفر کر ہی نہ سکتا، فرمایا : «{وَ لَوْ شَآءَ رَبُّكَ لَاٰمَنَ مَنْ فِي الْاَرْضِ كُلُّهُمْ جَمِيْعًا اَفَاَنْتَ تُكْرِهُ النَّاسَ ححَتّٰى يَكُوْنُوْا مُؤْمِنِيْنَ}» [ یونس :۹۹ ]مگر تیرے رب کی حکمت کا تقاضا کچھ اور تھا، اس لیے اس نے کسی کو ایمان پر مجبور نہیں کیا، سمع و بصر دے کر اور راستہ بتا کر اختیار دے دیا کہ حق و باطل میں سے جو چاہو اختیار کرو۔ اس لیے یہ سب لوگ کبھی ایمان پر متفق نہیں ہو سکتے، بلکہ ان میں ہمیشہ اختلاف رہے گا، کوئی مومن ہے کوئی کافر، کوئی فرماں بردار کوئی نافرمان، فرمایا : «{وَ لِذٰلِكَ خَلَقَهُمْ}» ’’اور اس نے انھیں اسی (آزمائش کے) لیے پیدا فرمایا ہے۔‘‘ مائدہ میں ہے : «{وَ لٰكِنْ لِّيَبْلُوَكُمْ فِيْ مَاۤ اٰتٰىكُمْ}» [ المائدۃ : ۴۸ ] ’’اور لیکن تاکہ وہ تمھیں اس میں آزمائے جو اس نے تمھیں دیا ہے۔‘‘ اور یہ بات اللہ تعالیٰ نے پہلے ہی طے کر دی ہے کہ میں جہنم کو اس آزمائش میں ناکام ہونے والے جن و انس سے بھروں گا اور اس بات کے ذکر کی ضرورت ہی نہیں کہ آزمائش میں کامیاب ہونے والوں کو اپنی جنت سے نوازوں گا۔ ¤ ➋ {وَ لَا يَزَالُوْنَ مُخْتَلِفِيْنَ (118) اِلَّا مَنْ رَّحِمَ رَبُّكَ:} معاویہ بن ابو سفیان رضی اللہ عنھما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہم میں خطبہ دینے کے لیے کھڑے ہوئے تو فرمایا : [ أَلاَ إِنَّ مَنْ قَبْلَكُمْ مِنْ أَهْلِ الْكِتَابِ افْتَرَقُوْا عَلٰی ثِنْتَيْنِ وَ سَبْعِيْنَ مِلَّةً، وَإِنَّ هٰذِهِ الْمِلَّةَ سَتَفْتَرِقُ عَلٰی ثَلاَثٍ وَ سَبْعِيْنَ، ثِنْتَانِ وَسَبْعُوْنَ فِي النَّارِ وَوَاحِدَةةٌ فِي الْجَنَّةِ وَ هِيَ الْجَمَاعَةُ ] [زَادَ ابْنُ يَحْيَی وَعَمْرٌو فِيْ حَدِيْثِهِمَا :] [ وَإِنَّهٗ سَيَخْرُجُ فِيْ أُمَّتِيْ أَقْوَامٌ تَجَارَی بِهِمْ تِلْكَ الْأَهْوَاءُ كَما يَتَجَارَی الْكَلَبُ لِصَاحِبِهِ، وَقَالَ عَمْرٌو: الْكَلَبُ بِصَاحِبِهِ لاَ يَبْقَی مِنْهٗ عِرْقٌ وَلاَ مَفْصِلٌ إِلاَّ دَخَلَهٗ ] [ أبوداوٗد، السنۃ، باب شرح السنۃ : ۴۵۹۷۔ السلسلۃ الصحیحۃ : 404/1، ح ۲۰۴ ] ’’یاد رکھو! تم سے پہلے اہلِ کتاب بہتر (۷۲) ملتوں میں جدا جدا ہو گئے اور یہ ملت تہتر (۷۳) میں جدا جدا ہو جائے گی۔ بہتر (۷۲) آگ میں اور ایک جنت میں ہو گا اور وہ ’’الجماعۃ‘‘ ہے۔‘‘ ابن یحییٰ اور عمرو نے اپنی روایتوں میں مزید کہا: ’’میری امت میں ایسی قومیں نکلیں گی جن میں یہ خواہشات و بدعات اس طرح رگ رگ میں جاری ہو جائیں گی جیسے باؤلے پن کی بیماری، اس بیماری کے مریض کے رگ و ریشے میں جاری ہو جاتی ہے۔‘‘ عمرو نے کہا: ”باؤلے پن کے بیمار کی کوئی رگ اور کوئی جوڑ باقی نہیں رہتا جس میں اس بیماری کا اثر نہ ہو۔“ ¤ ➌ اس آیت سے صاف معلوم ہوا کہ کسی امت کا اتفاق اور اجتماع رحمت ہے، کیونکہ اللہ تعالیٰ نے فرمایا کہ لوگ ہمیشہ مختلف رہیں گے مگر جس پر تیرا رب رحم کرے اور صاف ظاہر ہے کہ امت مسلمہ صرف اسی چیز پر جمع ہو سکتی ہے جو اللہ کی طرف سے نازل ہوئی اور وہ کتاب وسنت ہے۔ یہی طریقِ مستقیم ہے اور اسی پر چلنے والے ’’الجماعۃ‘‘ ہیں، باقی سب فرقے بعد میں اس سیدھے راستے سے ہٹنے کی وجہ سے پیدا ہوئے ۔ ¤ ➍ اس آیت سے یہ بھی معلوم ہوا کہ عام لوگوں میں مشہور روایت {’’ اِخْتَلاَفُ أُمَّتِيْ رَحْمَةٌ ‘‘} یعنی میری امت کا اختلاف رحمت ہے، یہ نبی کریم صلی اللہ علیہ وسلم پر صاف جھوٹ ہے۔ حافظ ابن حزم رحمہ اللہ نے اسے موضوع ثابت کرتے ہوئے ایک دلچسپ بات یہ بھی لکھی کہ اگر اسے صحیح مانا جائے تو پھر امت کا اتفاق زحمت ہو گا، کیونکہ اختلاف رحمت ہے، جب کہ اللہ تعالیٰ نے ان لوگوں پر اپنے رحم کا ذکر کیا ہے جو اختلاف کرنے والے نہیں ہوں گے۔ اس لیے سب فرقے چھوڑ کر کتاب و سنت کو مضبوطی سے تھام لینا ہی راہ نجات ہے۔"
    },
    {
      "ayah": 119,
      "tafsir": "(آیت 119،118) ➊ {وَ لَوْ شَآءَ رَبُّكَ لَجَعَلَ النَّاسَ اُمَّةً وَّاحِدَةً:} یعنی اے میرے رسوول! تیری خواہش تو یہ ہے کہ سب لوگ مسلمان ہو جائیں، ایک بھی کافر نہ رہے (دیکھیے شعراء : ۳) اور یہ بات تیرے رب پر کچھ مشکل بھی نہیں، جب اس نے جن و انس کے سوا باقی پوری مخلوق کو اپنی اطاعت کا پابند بنا رکھا ہے تو وہ جن و انس کو بھی ایک ہی امت بنا سکتا تھا کہ کوئی کفر کر ہی نہ سکتا، فرمایا : «{وَ لَوْ شَآءَ رَبُّكَ لَاٰمَنَ مَنْ فِي الْاَرْضِ كُلُّهُمْ جَمِيْعًا اَفَاَنْتَ تُكْرِهُ النَّاسَ ححَتّٰى يَكُوْنُوْا مُؤْمِنِيْنَ}» [ یونس :۹۹ ]مگر تیرے رب کی حکمت کا تقاضا کچھ اور تھا، اس لیے اس نے کسی کو ایمان پر مجبور نہیں کیا، سمع و بصر دے کر اور راستہ بتا کر اختیار دے دیا کہ حق و باطل میں سے جو چاہو اختیار کرو۔ اس لیے یہ سب لوگ کبھی ایمان پر متفق نہیں ہو سکتے، بلکہ ان میں ہمیشہ اختلاف رہے گا، کوئی مومن ہے کوئی کافر، کوئی فرماں بردار کوئی نافرمان، فرمایا : «{وَ لِذٰلِكَ خَلَقَهُمْ}» ’’اور اس نے انھیں اسی (آزمائش کے) لیے پیدا فرمایا ہے۔‘‘ مائدہ میں ہے : «{وَ لٰكِنْ لِّيَبْلُوَكُمْ فِيْ مَاۤ اٰتٰىكُمْ}» [ المائدۃ : ۴۸ ] ’’اور لیکن تاکہ وہ تمھیں اس میں آزمائے جو اس نے تمھیں دیا ہے۔‘‘ اور یہ بات اللہ تعالیٰ نے پہلے ہی طے کر دی ہے کہ میں جہنم کو اس آزمائش میں ناکام ہونے والے جن و انس سے بھروں گا اور اس بات کے ذکر کی ضرورت ہی نہیں کہ آزمائش میں کامیاب ہونے والوں کو اپنی جنت سے نوازوں گا۔ ¤ ➋ {وَ لَا يَزَالُوْنَ مُخْتَلِفِيْنَ (118) اِلَّا مَنْ رَّحِمَ رَبُّكَ:} معاویہ بن ابو سفیان رضی اللہ عنھما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہم میں خطبہ دینے کے لیے کھڑے ہوئے تو فرمایا : [ أَلاَ إِنَّ مَنْ قَبْلَكُمْ مِنْ أَهْلِ الْكِتَابِ افْتَرَقُوْا عَلٰی ثِنْتَيْنِ وَ سَبْعِيْنَ مِلَّةً، وَإِنَّ هٰذِهِ الْمِلَّةَ سَتَفْتَرِقُ عَلٰی ثَلاَثٍ وَ سَبْعِيْنَ، ثِنْتَانِ وَسَبْعُوْنَ فِي النَّارِ وَوَاحِدَةةٌ فِي الْجَنَّةِ وَ هِيَ الْجَمَاعَةُ ] [زَادَ ابْنُ يَحْيَی وَعَمْرٌو فِيْ حَدِيْثِهِمَا :] [ وَإِنَّهٗ سَيَخْرُجُ فِيْ أُمَّتِيْ أَقْوَامٌ تَجَارَی بِهِمْ تِلْكَ الْأَهْوَاءُ كَما يَتَجَارَی الْكَلَبُ لِصَاحِبِهِ، وَقَالَ عَمْرٌو: الْكَلَبُ بِصَاحِبِهِ لاَ يَبْقَی مِنْهٗ عِرْقٌ وَلاَ مَفْصِلٌ إِلاَّ دَخَلَهٗ ] [ أبوداوٗد، السنۃ، باب شرح السنۃ : ۴۵۹۷۔ السلسلۃ الصحیحۃ : 404/1، ح ۲۰۴ ] ’’یاد رکھو! تم سے پہلے اہلِ کتاب بہتر (۷۲) ملتوں میں جدا جدا ہو گئے اور یہ ملت تہتر (۷۳) میں جدا جدا ہو جائے گی۔ بہتر (۷۲) آگ میں اور ایک جنت میں ہو گا اور وہ ’’الجماعۃ‘‘ ہے۔‘‘ ابن یحییٰ اور عمرو نے اپنی روایتوں میں مزید کہا: ’’میری امت میں ایسی قومیں نکلیں گی جن میں یہ خواہشات و بدعات اس طرح رگ رگ میں جاری ہو جائیں گی جیسے باؤلے پن کی بیماری، اس بیماری کے مریض کے رگ و ریشے میں جاری ہو جاتی ہے۔‘‘ عمرو نے کہا: ”باؤلے پن کے بیمار کی کوئی رگ اور کوئی جوڑ باقی نہیں رہتا جس میں اس بیماری کا اثر نہ ہو۔“ ¤ ➌ اس آیت سے صاف معلوم ہوا کہ کسی امت کا اتفاق اور اجتماع رحمت ہے، کیونکہ اللہ تعالیٰ نے فرمایا کہ لوگ ہمیشہ مختلف رہیں گے مگر جس پر تیرا رب رحم کرے اور صاف ظاہر ہے کہ امت مسلمہ صرف اسی چیز پر جمع ہو سکتی ہے جو اللہ کی طرف سے نازل ہوئی اور وہ کتاب وسنت ہے۔ یہی طریقِ مستقیم ہے اور اسی پر چلنے والے ’’الجماعۃ‘‘ ہیں، باقی سب فرقے بعد میں اس سیدھے راستے سے ہٹنے کی وجہ سے پیدا ہوئے ۔ ¤ ➍ اس آیت سے یہ بھی معلوم ہوا کہ عام لوگوں میں مشہور روایت {’’ اِخْتَلاَفُ أُمَّتِيْ رَحْمَةٌ ‘‘} یعنی میری امت کا اختلاف رحمت ہے، یہ نبی کریم صلی اللہ علیہ وسلم پر صاف جھوٹ ہے۔ حافظ ابن حزم رحمہ اللہ نے اسے موضوع ثابت کرتے ہوئے ایک دلچسپ بات یہ بھی لکھی کہ اگر اسے صحیح مانا جائے تو پھر امت کا اتفاق زحمت ہو گا، کیونکہ اختلاف رحمت ہے، جب کہ اللہ تعالیٰ نے ان لوگوں پر اپنے رحم کا ذکر کیا ہے جو اختلاف کرنے والے نہیں ہوں گے۔ اس لیے سب فرقے چھوڑ کر کتاب و سنت کو مضبوطی سے تھام لینا ہی راہ نجات ہے۔"
    },
    {
      "ayah": 120,
      "tafsir": ""
    },
    {
      "ayah": 121,
      "tafsir": ""
    },
    {
      "ayah": 122,
      "tafsir": "(آیت 122){وَ انْتَظِرُوْا اِنَّا مُنْتَظِرُوْنَ : } یعنی تم بھی اللہ کے حکم کی راہ دیکھتے رہو ہم بھی راہ دیکھ رہے ہیں، یا تم ہمارے انجام کی راہ دیکھتے رہو، ہم تمھارے انجام کی راہ دیکھ رہے ہیں۔"
    },
    {
      "ayah": 123,
      "tafsir": "(آیت 123){وَ اِلَيْهِ يُرْجَعُ الْاَمْرُ كُلُّهٗ :} سب کو اسی کے پاس جانا ہے، پھر وہی ہر ایک کو اس کے عمل کا بدلہ دے گا۔"
    }
  ]
}