{
  "surah": "Al-Masad",
  "surah_number": 111,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "{سورة اللهب} ¤ عبداللہ بن عباس رضی اللہ عنھما فرماتے ہیں کہ جب (سورۂ شعراء کی) آیت: « وَ اَنْذِرْ عَشِيْرَتَكَ الْاَقْرَبِيْنَ » (اے نبی! اپنے سب سے قریبی خاندان والوں کو ڈرا) اتری تو نبی صلی اللہ علیہ وسلم صفا پر چڑھے اور آواز دی : [ يَا بَنِيْ فِهْرٍ! يَا بَنِيْ عَدِيٍّ ! لِبُطُوْنِ قُرَيْشٍ حَتَّی اجْتَمَعُوْا، فَجَعَلَ الرَّجُلُ  إِذَا لَمْ يَسْتَطِعْ أَنْ يَّخْرُجَ أَرْسَلَ رَسُوْلاً لِييَنْظُرَ مَا هُوَ، فَجَاءَ أَبُوْ لَهَبٍ وَقُرَيْشٌ فَقَالَ أَرَأَيْتَكُمْ لَوْ أَخْبَرْتُكُمْ أَنَّ خَيْلاً بِالْوَادِيْ تُرِيْدُ أَنْ تُغِيْرَ عَلَيْكُمْ ، أَكُنْتُمْ مُصَدِّقِيَّ؟ قَالُوْا نَعَمْ، مَا جَرَّبْنَا عَلَيْكَ إِلاَّ صِدْقًا، قَالَ فَإِنِّيْ نَذِيْرٌ لَّكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيْدٍ، فَقَالَ أَبُوْ لَهَبٍ تَبًّا لَكَ سَائِرَ الْيَوْمِ، أَلِهٰذَا جَمَعْتَنَا ؟ فَنَزَلَتْ  : « تَبَّتْ يَدَاۤ اَبِيْ لَهَبٍ وَّ تَبَّ (1) مَاۤ اَغْنٰى عَنْهُ مَالُهٗ وَ مَا كَسَبَ » ] [ بخاري، التفسیر، باب : «وأنذر عشیرتک الأقربین…» : ۴۷۷۰ ] ’’اے بنی فہر! اے بنی عدی!‘‘ اور قریش کے قبیلوں کے نام لے لے کر پکارا، یہاں تک کہ وہ جمع ہو گئے۔ کوئی آدمی خود نہ آسکا تو اس نے کسی کو بھیج دیا تاکہ دیکھے کہ کیا بات ہے۔ ابولہب اور قریش کے دوسرے لوگ آگئے تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ بتاؤ کہ اگر میں تمھیں اطلاع دوں کہ وادی میں ایک لشکر تم پر حملہ کرنا چاہتا ہے تو کیا تم مجھے سچا سمجھو گے؟‘‘ انھوں نے کہا : ’’ہاں! ہم نے آپ سے سچ کے علاوہ کبھی کوئی اور تجربہ نہیں کیا(یعنی آپ کو ہمیشہ سچا ہی پایا)۔‘‘ آپ نے فرمایا : ’’تو پھر میں تمھیں ایک سخت عذاب سے پہلے ڈرانے والا ہوں۔‘‘ ابو لہب کہنے لگا : ’’سارا دن تیرے لیے ہلاکت ہو! تونے ہمیں اسی لیے جمع کیا ہے؟‘‘ تو یہ سورت اتری : « تَبَّتْ يَدَاۤ اَبِيْ لَهَبٍ وَّ تَبَّ (1) مَاۤ اَغْنٰى عَنْهُ مَالُهٗ وَ مَا كَسَبَ » ’’ابو لہب کے دونوں ہاتھ ہلاک ہوگئے اور وہ (خود) ہلاک ہوگیا۔ نہ اس کے کام اس کا مال آیا اور نہ جو کچھ اس نے کمایا۔‘‘ ¤ (آیت 1) ➊ {تَبَّتْ يَدَاۤ اَبِيْ لَهَبٍ وَّ تَبَّ:} ابو لہب رسول اللہ صلی اللہ علیہ وسلم کا چچا تھا، نام عبدالعزیٰ بن عبدالمطلب تھا۔ {’’ لَهَبٍ ‘‘} شعلے کو کہتے ہیں، {’’ اَبِيْ لَهَبٍ ‘‘} شعلے کا باپ یا شعلے والا۔ رخساروں کی خوب صورتی اور سرخی کی وجہ سے یا طبیعت کی تیزی اور جوش کی وجہ سے ابو لہب کے نام سے مشہور ہوا، پھر جہنمی ہونے کی وجہ سے فی الواقع شعلے والا ہی بن گیا۔ اس شخص کو رسول اللہ صلی اللہ علیہ وسلم سے سخت عداوت تھی۔ باوجود اس کے کہ چچا باپ کی طرح ہوتا ہے، یہ ہر موقع پر آپ کی مخالفت کرتا اور ایذا پہنچانے کی کوشش کرتا۔ آپ کے دشمنوں میں سے یہ واحد شخص ہے جس کے نام سے قرآن میں اس کے برے انجام کی پیش گوئی کی گئی ہے۔ اس سے معلوم ہوا کہ اسلام میں نسب اور خاندان کی بنیاد پر نہیں بلکہ ایمان اور کفر کی بنیاد پر اپنے اور غیر کا فیصلہ ہوتا ہے۔ ¤ ➋ رسول اللہ صلی اللہ علیہ وسلم کی سخت مخالفت اور آپ کو ہلاکت کی بد  دعا دینے کی وجہ سے اللہ تعالیٰ نے {’’ تَبَّتْ يَدَاۤ اَبِيْ لَهَبٍ وَّ تَبَّ ‘‘} فرمایا۔ اس کے دو معانی ہو سکتے ہیں، پہلا یہ کہ ابو لہب کے دونوں ہاتھ ہلاک ہو گئے اور وہ خود ہلاک ہوگیا۔ یہ معنی تو ظاہر ہے۔ دوسرا یہ کہ ابو لہب کے دونوں ہاتھ ہلاک ہو جائیں اور وہ ( فی الواقع) ہلاک ہوگیا۔ یہ معنی فراء نے کیا ہے، یعنی اس کی بد دعا کے مقابلے میں اہلِ ایمان کی بد دعا کی جگہ اللہ تعالیٰ نے یہ الفاظ فرما دیے کہ ابولہب کے دونوں ہاتھ ہلاک ہو جائیں، پھر بتایا کہ وہ ہلاک ہو چکا۔ ¤ ➌ ’’ابو لہب کے دونوں ہاتھ ہلاک ہوگئے‘‘ یہاں ہاتھوں کا ذکر خاص طور پر اس لیے کیا گیا کہ ایذا رسانی میں ہاتھوں کا حصہ دوسرے تمام اعضا سے زیادہ مؤثر ہوتا ہے اور ان کے ساتھ زیادہ تکلیف پہنچائی جا سکتی ہے۔ دوسری وجہ یہ ہے کہ ہاتھوں سے مراد اولاد اور ساتھی ہیں، جو مددگار ہوتے ہیں اور دست و بازو بنتے ہیں۔ اللہ تعالیٰ ککے فرمان کے مطابق ایسا ہی ہوا ، اس کے مددگار جنگ بدر میں برباد ہوگئے، وہ خود جنگ میں نہیں گیا، شکست کی خبر آئی تو اسی صدمے سے مر گیا۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {مَاۤ اَغْنٰى عَنْهُ مَالُهٗ وَ مَا كَسَبَ:} ’’نہ اس کے کام اس کا مال آیا اور نہ جو کچھ اس نے کمایا‘‘ کمائی سے مفسرین نے اس کے بیٹے مراد لیے ہیں، علاوہ ازیں اس نے اپنے خیال میں جو اعمال نیکی سمجھ کر کیے تھے وہ اس کے کسی کام نہ آئے۔ صحیح بخاری میں ہے : [ قَالَ عُرْوَةُ : وَ ثُوَيْبَةُ مَوْلَاةٌ لِأَبِيْ لَهَبٍ وَ كَانَ أَبُوْ لَهَبٍ أَعْتَقَهَا فَأَرْضَعَتِ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا مَاتَ أَبُوْ لَهَبٍ أُرِيَهُ بَعْضُ أَهْلِهِ بِشَرِّ حِيْبَةٍ ({بِشَرِّ خَيْبَةٍ}) قَالَ لَهُ مَاذَا لَقِيْتَ، قَالَ أَبُوْ لَهَبٍ لَمْ أَلْقَ بَعْدَكُمْ غَيْرَ لَمْ أَلْقَ بَعْدَكُمْ خَيْرًا غَيْرَ أَنِّيْ سُقِيْتُ فِيْ هٰذِهِ بِعَتَاقَتِيْ ثُوَيْبَةَ ] [بخاري، النکاح، باب: «وأمھاتکم الاتي أرضعنکم» : ۵۱۰۱] ’’عروہ نے کہا کہ ثویبہ ابو لہب کی لونڈی تھی جسے ابو لہب نے آزاد کیا تھا، پھر اس نے نبی صلی اللہ علیہ وسلم کو دودھ پلایا۔ جب ابولہب فوت ہوا تو اس کے گھر والوں میں سے کسی کو خواب میں ابو لہب بہت بری حالت میں دکھایا گیا، اس نے اس سے پوچھا : ’’تم کس چیز کو ملے؟‘‘ ابولہب نے کہا : ’’میں تمھارے بعد (کسی خیر کو) نہیں ملا سوائے اس کے کہ میں اپنی اس(انگلی اور انگوٹھے کی درمیانی جگہ) سے پلایا گیا ہوں، میرے ثویبہ کو آزاد کرنے کی وجہ سے۔‘‘ فتح الباری میں ہے کہ سہیلی نے ذکر کیا کہ عباس رضی اللہ عنہ نے فرمایا : ’’جب ابو لہب فوت ہوا تو میں نے اسے ایک سال بعدخواب میں بہت بری حالت میں دیکھا تو اس نے کہا: ’’میں تمھارے بعد کسی راحت کو نہیں ملا مگر اتنا ہے کہ ہر سوموار کو میرا عذاب ہلکاکردیا جاتا ہے۔‘‘ کہا : ’’اس کی وجہ یہ تھی کہ رسول اللہ صلی اللہ علیہ وسلم سوموار کے دن پیدا ہوئے تھے اور ثویبہ نے ابو لہب کو آپ کے پیدا ہونے کی خوش خبری دی تو اس نے اسے آزاد کر دیا۔‘‘ (فتح الباری) نبی صلی اللہ علیہ وسلم کا میلاد منانے والے حضرات نے اس سے دلیل پکڑی ہے کہ نبی صلی اللہ علیہ وسلم کا یوم میلاد منانا جائز ہے۔ ان حضرات نے خیال نہیں فرمایا کہ یہ عباس رضی اللہ عنہ کا خواب ہے جو اس وقت ابھی کافر تھے، مسلمان نہیں ہوئے تھے۔ اب ایک طرف اللہ تعالیٰ کا فرمان ہے کہ نہ ابو لہب کا مال اس کے کام آیا اور نہ جو اس نے کمایا اور ایک طرف ایک شخص کے زمانۂ کفر کا خواب ہے کہ ثویبہ کا آزاد کرنا اس کے کام آیا۔ یہ بات مسلم ہے کہ نبی صلی اللہ علیہ وسلم کا خواب شریعت میں حجت ہے کیونکہ وہ وحی الٰہی ہے، نبی کے سوا کسی مسلمان کا خواب بھی حجت نہیں، چہ جائے کہ کسی غیر مسلم کا خواب شرعی دلیل بنایا جائے، جب کہ وہ خواب صریح طور پر قرآن مجید کے خلاف ہے، کیونکہ قرآن نے ابو لہب کے ہاتھوں کا نام لے کر ان کے ہلا ک ہونے کی وعید سنائی ہے۔ پھر ان حضرات نے یہ بھی خیال نہیں فرمایا کہ میلاد منانے کی اگر کوئی اصل ہوتی تو اس نیکی سے رسول اللہ صلی اللہ علیہ وسلم ، خلفائے راشدین، صحابہ کرام اور اہل بیت ہر سال محروم نہ رہتے۔ رہی یہ بات کہ بخاری رحمہ اللہ نے اپنی صحیح میں اسے کیوں ذکر فرمایا ہے؟ تو اس کی وجہ یہ ہے کہ انھوں نے اسے {’’كِتَابُ النِّكَاحِ‘‘} میں ذکر فرمایا ہے اور ان کا مقصد اس سے یہ ثابت کرنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو ابو لہب کی لونڈی ثویبہ نے دودھ پلایا تھا اور اسی نے ابو سلمہ رضی اللہ عنہ کو بھی دودھ پلایا تھا،اس لیے ابو سلمہ رضی اللہ عنہ کی بیٹی سے نکاح نبی صلی اللہ علیہ وسلم کے لیے جائز نہ تھا، کیونکہ وہ آپ کی دودھ کی بھتیجی تھی۔ بخاری رحمہ اللہ نے اسے میلاد منانے کے لیے پیش نہیں کیا اور نہ ہی کوئی صاحب عقل کسی غیر مسلم کے خواب سے شریعت اخذ کرتا ہے، خصوصاً جب وہ صاف قرآن مجید کے خلاف بھی ہو۔ قرآن کی اس صریح آیت کی رو سے ابو لہب کو ثوبیہ لونڈی کا آزاد کر دینا کوئی فائدہ نہیں پہنچا سکے گا۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 4،3) ➊ {سَيَصْلٰى نَارًا ذَاتَ لَهَبٍ …: ’’ امْرَاَتُهٗ ‘‘} کا عطف {’’ سَيَصْلٰى ‘‘} میں ابو لہب کی طرف لوٹنے والی ضمیر پر ہے، یعنی وہ اور اس کی بیوی شعلے مارتی ہوئی آگ میں داخل ہوں گے۔ ابو لہب کی بیوی ام جمیل کا نام ارویٰ بنت حرب بن امیہ تھا، یہ قریش میں اونچے نسب والی عورت تھی، ابو سفیان بن حرب رضی اللہ عنہ کی بہن اور معاویہ رضی اللہ عنہ کی پھوپھی تھی اور اپنے خاوند کی طرح رسول اللہ صلی اللہ علیہ وسلم سے سخت عداوت رکھتی تھھی۔ (ابن کثیر) ¤ ➋ { ’’ حَمَّالَةَ الْحَطَبِ ‘‘ ’’ امْرَاَتُهٗ ‘‘} سے حال ہے، یعنی اس کی بیوی ایندھن اٹھائے ہوئے آگ میں داخل ہوگی۔مفسرین نے اس کے تین معانی بیان فرمائے ہیں، ایک یہ کہ وہ گناہوں کا بوجھ اٹھائے ہوئے جہنم میں داخل ہوگی، جو جہنم کو بھڑکانے کے لیے ایندھن ہے، دوسرا یہ کہ وہ لوگوں میں رسول اللہ صلی اللہ علیہ وسلم کے خلاف عداوت کی آگ بھڑکاتی رہتی ہے اور تیسرا یہ کہ اپنی پیٹھ پر ایندھن لا کر آپ کی راہ میں کانٹے بچھاتی رہتی ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4،3) ➊ {سَيَصْلٰى نَارًا ذَاتَ لَهَبٍ …: ’’ امْرَاَتُهٗ ‘‘} کا عطف {’’ سَيَصْلٰى ‘‘} میں ابو لہب کی طرف لوٹنے والی ضمیر پر ہے، یعنی وہ اور اس کی بیوی شعلے مارتی ہوئی آگ میں داخل ہوں گے۔ ابو لہب کی بیوی ام جمیل کا نام ارویٰ بنت حرب بن امیہ تھا، یہ قریش میں اونچے نسب والی عورت تھی، ابو سفیان بن حرب رضی اللہ عنہ کی بہن اور معاویہ رضی اللہ عنہ کی پھوپھی تھی اور اپنے خاوند کی طرح رسول اللہ صلی اللہ علیہ وسلم سے سخت عداوت رکھتی تھھی۔ (ابن کثیر) ¤ ➋ { ’’ حَمَّالَةَ الْحَطَبِ ‘‘ ’’ امْرَاَتُهٗ ‘‘} سے حال ہے، یعنی اس کی بیوی ایندھن اٹھائے ہوئے آگ میں داخل ہوگی۔مفسرین نے اس کے تین معانی بیان فرمائے ہیں، ایک یہ کہ وہ گناہوں کا بوجھ اٹھائے ہوئے جہنم میں داخل ہوگی، جو جہنم کو بھڑکانے کے لیے ایندھن ہے، دوسرا یہ کہ وہ لوگوں میں رسول اللہ صلی اللہ علیہ وسلم کے خلاف عداوت کی آگ بھڑکاتی رہتی ہے اور تیسرا یہ کہ اپنی پیٹھ پر ایندھن لا کر آپ کی راہ میں کانٹے بچھاتی رہتی ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {فِيْ جِيْدِهَا حَبْلٌ مِّنْ مَّسَدٍ: ’’جِيْدٌ‘‘} گردن۔ {’’ مَسَدٍ ‘‘} کھجور کی چھال کی رسی یا گوگل کے درخت کی چھال کی رسی یا کسی بھی چیز کی بنی ہوئی رسی یا خوب مضبوط بٹی ہوئی رسی۔ لوہے کی رسی کو بھی {’’ مَسَدٍ ‘‘} کہتے ہیں، یعنی جہنم میں اس حال میں داخل ہوگی کہ اس کی گردن میں مضبوط بٹی ہوئی رسی ہوگی۔ صحیح بخاری میں مجاہد سے منقول ہے کہ اس سے مراد وہ زنجیر ہے جو آگ میں ہوگی، جس میں مجرم پروئے جائیں گے، جیسا کہ فرمایا : « ثُمَّ فِيْ سِلْسِلَةٍ ذَرْعُهَا سَبْعُوْنَ ذِرَاعًا فَاسْلُكُوْهُ » [ الحآقۃ : ۳۲ ] ’’پھر ایک زنجیر میں جس کی پیمائش ستر ہاتھ ہے، اسے داخل کر دو۔‘‘"
    }
  ]
}