{
  "surah": "Al-Ikhlaas",
  "surah_number": 112,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "اُبی بن کعب رضی اللہ عنہ فرماتے ہیں : ’’مشرکین نے کہا، اے محمد! ہمارے لیے اپنے رب کا نسب بیان کیجیے تو اللہ عزو جل نے {’’ قُلْ هُوَ اللّٰهُ اَحَدٌ ‘‘} نازل فرمائی۔‘‘ [ مستدرک حاکم : 540/2، ح : ۳۹۸۷] اس سورت کے صحیح احادیث میں بہت سے فضائل آئے ہیں، اختصار کی وجہ سے چند حدیثیں درج کی جاتی ہیں : (1) ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ ایک شخص نے ایک آدمی کو ( قیام اللیل میں) {’’ قُلْ هُوَ اللّٰهُ اَحَدٌ ‘‘} بار بار پڑھتے ہوئے سنا ( اس سے زیادہ وہ کچھ نہیں پڑھ رہا تھا)۔ صبح ہوئی تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے اس کا ذکر کیا۔ معلوم ہوتا تھا کہ وہ اسے کم سمجھ رہا ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَالَّذِيْ نَفْسِيْ بِيَدِهِ! إِنَّهَا لَتَعْدِلُ ثُلُثَ الْقُرْآنِ ] [ بخاري، فضائل القرآن، باب فضل : « قل ھو اللہ أحد» : ۵۰۱۳، ۵۰۱۴ ] ’’قسم اس ذات کی جس کے ہاتھ میں میری جان ہے! یہ سورت قرآن کے ایک تہائی حصے کے برابر ہے۔‘‘ (2) عائشہ رضی اللہ عنھا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو ایک لشکر کا امیر بنا کر بھیجا، وہ نماز میں اپنی قراء ت کو {’’ قُلْ هُوَ اللّٰهُ اَحَدٌ ‘‘} کے ساتھ ختم کرتا تھا۔ جب وہ لوگ واپس آئے تو انھوں نے نبی صلی اللہ علیہ وسلم سے اس بات کا ذکر کیا، آپ صلی اللہ علیہ وسلم نے فرمایا : [سَلُوْهُ لِأَيِّ شَيْءٍ يَصْنَعُ ذٰلِكَ؟ ] ’’اس سے پوچھو وہ ایسا کیوں کرتا ہے؟‘‘ لوگوں نے اس سے پوچھا تو اس نے کہا : [لِأَنَّهَا صِفَةُ الرَّحْمٰنِ وَ أَنَا أُحِبُّ أَنْ أَقْرَأَ بِهَا ] ’’اس لیے کہ یہ رحمان کی صفت ہے اور مجھے اس کے پڑھنے سے محبت ہے۔‘‘ تو نبی صلی اللہ علیہ وسلم نے فرمایا : [ أَخْبِرُوْهُ أَنَّ اللّٰهَ يُحِبُّهُ ] [ بخاري، التوحید، باب ما جاء في دعاء النبي صلی اللہ علیہ وسلم أمتہ …: ۷۳۷۵] ’’اسے بتا دو کہ اللہ تعالیٰ اس سے محبت رکھتا ہے۔‘‘ سوتے وقت اور دوسرے اوقات میں معوذتین کے ساتھ ملا کر یہ سورت پڑھنے کی احادیث معوذتین کے شروع میں آئیں گی۔ (ان شاء اللہ) ¤ تنبیہ : بعض روایات میں اس سورت کو روزانہ دوسو مرتبہ یا سو مرتبہ یا پچاس مرتبہ پڑھپڑھنے کی مختلف فضیلتیں آئی ہیں، مگر ان روایات کی سندیں صحیح نہیں ہیں۔ شوکانی نے فتح القدیر میں وہ روایات درج کرکے ان کا ضعف واضح کیا ہے۔ ابن کثیر نے بھی ان روایات پر کلام کیا ہے۔ اس سے معلوم ہوا کہ اس سورت کو تین سے زیادہ کسی عدد میں مسنون سمجھ کر پڑھنا درست نہیں۔ ہاں! اپنی سہولت کے لیے کوئی شخص کوئی عدد مقرر کر لے، اسے مسنون نہ سمجھے تو درست ہے۔ ¤ (آیت 1) ➊ { قُلْ هُوَ اللّٰهُ اَحَدٌ:} اس کی ترکیب کئی طرح سے کی گئی ہے، زیادہ واضح دو ہیں: (1) {’’ هُوَ ‘‘} مبتدا ہے، لفظ {’’ اللّٰهُ ‘‘} پہلی خبر اور{’’ اَحَدٌ ‘‘} دوسری خبر۔ معنی یہ ہوگا : ’’(ہمارے جس رب کا نسب پوچھ رہے ہو) وہ اللہ ہے ( وہ) ایک ہے۔‘‘ (2) {’’ هُوَ ‘‘} مبدل منہ اور لفظ {’’ اللّٰهُ ‘‘} بدل، دونوں مل کر مبتدا اور {’’ اَحَدٌ ‘‘} خبر ہے۔ معنی یہ ہو گا : ’’وہ اللہ (جس کے متعلق تم پوچھ رہے ہو) ایک ہے۔‘‘ ¤ ➋ کائنات کے خالق اور پروردگار کے بے شمار ناموں میں سے لفظ {’’ اللّٰهُ ‘‘} بطور علم یعنی اصل نام کے طور پر استعمال ہوتا ہے، باقی نام اس کی کسی نہ کسی صفت کے طور پر استعمال ہوتے ہیں۔ اس اصل {’’اَلْإِلٰهُ‘‘} ہے، {’’إِلٰهٌ‘‘} کا معنی معبود ہے۔ تو لفظ {’’ اللّٰهُ ‘‘ } کا معنی یہ ٹھہرا کہ وہ خاص ہستی جو عبادت کے لائق ہے، کیونکہ اس میں کمال کی تمام صفات پائی جاتی ہیں۔ {’’ هُوَ اللّٰهُ اَحَدٌ ‘‘} کا معنی یہ ہے کہ وہ رب جس کے متعلق تم پوچھ رہے ہو وہ کوئی نئی یا نامعلوم ہستی نہیں، بلکہ وہ اللہ ہے جسے تم بھی جانتے اور مانتے ہو، وہی جو معبود برحق ہے اور وہ اللہ ایک ہے۔ ¤ ➌ { اللّٰهُ اَحَدٌ:} اللہ تعالیٰ کے ایک ہونے کے تین معانی ہو سکتے ہیں اور تینوں یہاں درست ہیں، پہلا یہ کہ وہ ایک ذات ہے، دو یا تین یا زیادہ نہیں اور اس کی ذات میں تعدد نہیں، دوسرا یہ کہ وہ معبود برحق ہونے میں اکیلا ہے، اس کا کوئی ثانی یا شریک نہیں اور تیسرا یہ کہ وہ ایک ہے، اس کی تقسیم نہیں ہو سکتی اور نہ وہ ٹکڑے ٹکڑے ہو سکتا ہے۔ اس ایک ہی آیت سے اللہ تعالیٰ کے ساتھ کسی بھی قسم کا شریک بنانے والوں کی تردید ہوگئی، خواہ وہ مجوس ( آتش پرست) ہوں جو دو خالق مانتے ہیں، ایک خیر کا خالق (یزداں) اور دوسرا شر کا خالق ( اہرمن)، خواہ تثلیث ( تین خداؤں) کو ماننے والے ہوں، خواہ ہندو ہوں جو کروڑوں دیوتاؤں کو خدائی میں حصے دار مانتے ہیں اور خواہ وہ وحدت الوجود کے قائل ہوں جو ہر چیز ہی کو اللہ مانتے ہیں، کیونکہ اگر ہر چیز ہی اللہ ہے یا ہر چیز میں اللہ ہے تو اللہ ایک تو نہ رہا، جبکہ اللہ تعالیٰ کا تعارف ہی یہ ہے کہ وہ ایک ہے، اس میں تعدد اور کثرت نہیں۔ ¤ اسی طرح ان لوگوں کے عقیدہ کی بھی تردید ہو گئی جو اللہ کے علاوہ کسی کو عالم الغیب یا اختیارات کا مالک سمجھ کر مدد کے لیے پکارتے ہیں اور انھیں خدائی اختیارات میں اللہ کا شریک بناتے ہیں۔ ¤ اسی طرح ان لوگوں کی بھی تردید ہو گئی جو اللہ کی ذات سے ٹکڑوں کے جدا ہونے کے قائل ہیں، کوئی کہتا ہے عیسیٰ علیہ السلام اللہ کے بیٹے ہیں، کوئی کہتا ہے عزیر علیہ السلام اللہ کے بیٹے ہیں، کوئی کہتا ہے محمد صلی اللہ علیہ وسلم اللہ کے نور میں سے پیدا ہوئے ہیں، کیونکہ ان تمام صورتوں میں کوئی نہ کوئی ہستی اللہ کی شریک ٹھہرتی ہے اور وہ ایک نہیں رہتا۔ میں نے ایک صاحب کی تقریر سنی، وہ کہہ رہے تھے : ’’نبی صلی اللہ علیہ وسلم اللہ کے نور میں سے نور ہیں۔ بعض لوگ کہتے ہیں کہ اللہ کے نور میں سے نور کس طرح جدا ہو سکتا ہے؟ میں آپ کو مثال سے سمجھاتا ہوں، دیکھیے! یہ ایک موم بتی جل رہی ہے، اس میں سے ایک اور موم بتی جلا لیں تو کیا پہلی کے نور میں کوئی کمی واقع ہو گی ؟ ہر گز نہیں، اسی طرح نبی صلی اللہ علیہ وسلم اللہ کے نور میں سے نور ہیں اور اللہ کے نور میں بھی کوئی کمی واقع نہیں ہوئی۔‘‘ اس بے چارے نے یہ نہ سمجھا کہ اللہ تعالیٰ نے اپنے لیے مثالیں بیان کرنے سے منع کرتے ہوئے فرمایا ہے : « فَلَا تَضْرِبُوْا لِلّٰهِ الْاَمْثَالَ اِنَّ اللّٰهَ يَعْلَمُ وَ اَاَنْتُمْ لَا تَعْلَمُوْنَ» [ النحل : ۷۴ ] ’’پس تم اللہ کے لیے مثالیں مت بیان کرو، کیونکہ اللہ جانتا ہے اور تم نہیں جانتے۔‘‘ اور نہ یہ سمجھا کہ پہلی موم بتی میں کوئی کمی ہو یا نہ ہو، دو موم بتیاں تو بن گئیں، جب کہ اللہ ایک ہے اور نہ یہ سمجھا کہ اللہ کا نور نہ کسی سے نکلا ہے اور نہ اس سے کوئی نکلتا ہے۔ یہ عقیدہ تو بعینہ وہی عقیدہ ہے جو نصرانیوں نے عیسیٰ علیہ السلام کے متعلق اختیار کیا۔ ¤ اسی طرح {’’ اللّٰهُ اَحَدٌ ‘‘} سے ان لوگوں کی بھی تردید ہو گئی جو کہتے ہیں کہ بندہ جب زیادہ عبادت کرتا ہے تو اللہ تعالیٰ اس میں اتر آتا ہے، پھر وہ اللہ ہی بن جاتا ہے اور دلیل میں صحیح بخاری کی وہ حدیث پیش کرتے ہیں جس میں اللہ تعالیٰ کا فرمان نقل ہوا ہے کہ میں اس کا کان بن جاتا ہوں جس سے وہ سنتا ہے، اس کی آنکھ بن جاتا ہوں جس سے وہ دیکھتا ہے…۔ ان لوگوں نے سورۂ اخلاص پر غور نہ کیا کہ اس صورت میں اللہ ایک تو نہ رہا ،جبکہ اس کا سب سے پہلا تعارف ہی یہ ہے کہ وہ ایک ہے اور نہ اس حدیث کے آخر پر غور کیا جس میں واضح الفاظ ہیں کہ اللہ تعالیٰ فرماتے ہیں کہ میرا وہ بندہ اگر مجھ سے مانگے تو میں اسے دوں گا اور اگر مجھ سے پناہ طلب کرے تو میں اسے پناہ دوں گا۔ اگر ’’من تو شدم تو من شدی‘‘ کے مطابق اللہ اور بندہ ایک ہوگئے تو پھر مانگے گا کون اور دے گا کون؟ پناہ مانگنے والا کون ہوگا اور پناہ دینے والا کون؟ ¤ اسی طرح ان لوگوں کی بھی تردید ہو گئی جو کہتے ہیں کہ بندہ عبادت کرتے کرتے اللہ کے ساتھ اس طرح واصل ہو جاتا ہے کہ وہ وہی بن جاتا ہے، جس طرح لوہا گرم ہوتے ہوتے آگ بن جاتا ہے۔ اس غلطی کی بنیادی وجہ بھی اللہ کے لیے مخلوق کی مثالیں بیان کرنا ہے، جبکہ اللہ نے اس سے منع فرمایا ہے۔ اس کے علاوہ ان بے چاروں نے یہ نہ سوچا کہ آیت «اللّٰهُ اَحَدٌ » ( اللہ ایک ہے) اس کی نفی کر رہی ہے، بندہ تو اللہ سے الگ ایک ذات ہے۔ مخلوق اور خالق دو ہیں ایک نہیں، جبکہ اللہ تعالیٰ ایک ہے، دو ایک کیسے بن گئے؟ یہ تو وہی نصرانیوں والا عقیدہ ہے کہ باپ خدا، بیٹا خدا، روح القدس خدا، مگر تین نہیں بلکہ ایک خدا۔ اللہ کے بندو! دو یا تین ایک کیسے بن گئے؟ الغرض، یہ ایسی مبارک سورت ہے کہ اللہ کی توحید کے خلاف جتنے عقیدے ہیں اور ان کی جتنی بھی توجیہیں کی جاتی ہیں، یہ اکیلی سورت بلکہ اس کی ایک آیت ہی ان کی تردید کے لیے کافی ہے۔ پھر اگر رسول اللہ صلی اللہ علیہ وسلم نے اسے قرآن کا ثلث(ایک تہائی) قرار دیا ہے تو اس میں تعجب کی کیا بات ہے؟"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { اَللّٰهُ الصَّمَدُ: ’’ الصَّمَدُ ‘‘} کی تفسیر میں سلف کے کئی اقوال ہیں، ان کا خلاصہ تین اقوال میں آجاتا ہے : (1) {’’ الصَّمَدُ ‘‘} وہ سردار ہے جس کی طرف لوگ قصد کرکے جائیں، جس سے بڑا کوئی سردار نہ ہو۔ یہ {’’صَمَدَ‘‘} (ف ، ن) (قصد کرنا) سے مشتق ہے۔ گویا {’’ الصَّمَدُ ‘‘} بمعنی {’’مَصْمُوْدٌ ‘‘} ہے۔ اکثر سلف نے یہی معنی کیا ہے۔ (2) جو کھاتا پیتا نہ ہو۔ (3) جس کا پیٹ نہ ہو، جو کھوکھلا نہ ہو، جس سے کچھ نکلتا نہ ہو۔ اللہ پر یہ تتینوں معانی صادق آتے ہیں۔ ¤ ➋ عربی زبان کا قاعدہ ہے کہ جب خبر پر الف لام آجائے تو کلام میں حصر پیدا ہو جاتا ہے۔ اگر {’’اَللّٰهُ صَمَدٌ‘‘} ہوتا تو معنی یہ تھا کہ اللہ صمد ہے۔ اب {’’ اَللّٰهُ الصَّمَدُ ‘‘} فرمایا، تو معنی یہ ہے کہ اللہ ہی ’’صمد‘‘ ہے، کوئی اور صمد نہیں۔ اس سے پہلی آیت میں {’’ اَللّٰهُ الصَّمَدُ ‘‘} فرمایا جس کا معنی ہے اللہ ایک ہے۔ وہاں {’’اَللّٰهُ الْأَحَدُ‘‘} نہیں فرمایا کہ اللہ ہی ایک ہے۔ اس کی وجہ یہ ہے کہ وہاں حصر کی ضرورت ہی نہیں تھی، کیونکہ وہ ہستی جو ایک ہے وہ صرف اللہ تعالیٰ ہے، کسی اور کو اَحد کہہ ہی نہیں سکتے۔ ہر ایک کا ثانی کسی نہ کسی طرح موجود ہے، کسی اور چیز میں اس کا ثانی نہ ہو تو مخلوق ہونے میں اس کے بے شمار ثانی موجود ہیں، اس لیے اس کائنات میں ایک ہستی صرف اللہ کی ہے، اس لیے وہاں حصر کی ضرورت ہی نہیں، جبکہ صمد ہونے کے دعوے دار بے شمار ہیں، جن کے پاس لوگ اپنی ضرورتوں کے لیے جاتے ہیں۔ اس لیے فرمایا اصل صمد صرف وہ ہے، کیونکہ دوسرے لوگ کتنے بھی بڑے سردار ہوں، لوگ ان کے پاس اپنی حاجتوں کے لیے جاتے ہوں، مگر وہ خود کسی نہ کسی کے محتاج ہیں۔ یہ صرف اللہ کی ہستی ہے کہ وہ کسی کا محتاج نہیں، باقی سب اس کے محتاج ہیں، وہ سب کو کھلاتا ہے، خود کھانے کا محتاج نہیں، جیساکہ فرمایا: «وَ هُوَ يُطْعِمُ وَ لَا يُطْعَمُ » [ الأنعام : ۱۴ ] ’’حالانکہ وہ کھلاتا ہے اور اسے نہیں کھلایا جاتا۔‘‘ پھر نہ اس سے کوئی پیدا ہوا اور نہ وہ کسی سے پیدا ہوا۔ {’’ الصَّمَدُ ‘‘} کے اس مفہوم کو ’’ بے نیاز‘‘ کا لفظ کافی حد تک ادا کرتا ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { لَمْ يَلِدْ وَ لَمْ يُوْلَدْ:} ’’نہ اس نے کسی کو جنا اور نہ کسی نے اس کو جنا‘‘ اس آیت میں نصرانیوں کا ردّ ہے جو عیسیٰ علیہ السلام کو اللہ کا بیٹا مانتے ہیں، یہودیوں کا ردّ ہے جو عزیر علیہ السلام کو اللہ کا بیٹا مانتے ہیں، مشرکین عرب کا ردّ ہے جو فرشتوں کو اللہ کی بیٹیاں مانتے ہیں، فلاسفہ کا ردّ ہے جو کہتے ہیں کہ عقول عشرہ اللہ سے نکلی ہیں اور اب کائنات کا نظام وہ چلا رہی ہیں، ہندوؤں کا رد ہے جو کروڑوں کی تعداد میں مخلوق کو خدا مانتے ہیں اور ان مسلمان کہلانے والوں کا بھی ردّ ہے جو کہتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم اور ائمۂ اہلِ بیت اللہ تعالیٰ کے ذاتی نور سے پیدا ہوئے ہیں۔ ¤ ➋ اللہ تعالیٰ نے قرآن مجید میں اپنے لیے اولاد کی نفی کے بہت سے دلائل بیان فرمائے ہیں، ان میں سب سے واضح چار ہیں، پہلی دلیل یہ ہے کہ اولاد لازماً باپ کی جنس سے ہوتی ہے، جب کہ اللہ تعالیٰ کی کوئی جنس ہی نہیں۔ اس آیت میں اسی دلیل کی طرف اشارہ ہے : « مَا الْمَسِيْحُ ابْنُ مَرْيَمَ اِلَّا رَسُوْلٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ وَ اُمُّهٗ  صِدِّيْقَةٌ كَانَا يَاْكُلٰنِ الطَّعَامَ» [ المائدۃ : ۷۵ ] ’’نہیں ہے مسیح ابن مریم مگر ایک رسول، اس سے پہلے کئی رسول گزر گئے اور اس کی ماں صدیقہ ہے۔ وہ دونوں کھانا کھایا کرتے تھے۔‘‘ یعنی مسیح ابن مریم علیھما السلام سے پہلے کئی رسول گزرے، وہ پہلے نہیں تھے، پھر پیدا ہوئے، وہ حادث تھے جب کہ اللہ تعالیٰ ہمیشہ سے ہے۔ باپ اور اولاد کی جنس ایک ہوتی ہے جب کہ اللہ تعالیٰ ہمیشہ سے ہے اور عیسیٰ علیہ السلام حادث ہیں۔ اسی طرح اللہ تعالیٰ کھاتا نہیں اور وہ دونوں کھاتے تھے۔ جنس ایک نہ رہی تو اولاد کیسے بن گئی؟ دوسری دلیل یہ کہ والد اولاد اس لیے حاصل کرتا ہے کہ وہ اس کا محتاج ہوتا ہے اور اللہ کو کسی کی کوئی حاجت نہیں۔ اس آیت میں یہی فرمایا ہے : « قَالُوا اتَّخَذَ اللّٰهُ وَلَدًا سُبْحٰنَهٗ هُوَ الْغَنِيُّ » [ ی » [ یونس : ۶۸ ] ’’ انھوں نے کہا کہ اللہ نے اولاد پکڑی ہے، وہ پاک ہے، وہی تو غنی ہے۔‘‘ یعنی وہی تو ہے جو غنی ہے، جسے کسی کی حاجت نہیں، وہ اولاد کیوں بنائے گا؟ تیسری دلیل یہ کہ تمام مخلوق اللہ کے بندے اور غلام ہیں اور بندہ ہونا بیٹا ہونے کے ساتھ جمع نہیں ہو سکتا ، فرمایا: « وَ مَا يَنْۢبَغِيْ لِلرَّحْمٰنِ اَنْ يَّتَّخِذَ وَلَدًا (92) اِنْ كُلُّ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ اِلَّاۤ اٰتِي الرَّحْمٰنِ عَبْدًا» [ مریم : ۹۲، ۹۳ ] ’’اور رحمان کے لائق ہی نہیں کہ وہ اولاد پکڑے، آسمانوں میں اور زمین میں جو کوئی بھی ہے رحمان کے پاس بندہ (غلام) بن کر آنے والا ہے۔‘‘ یعنی رحمان کی اولاد کس طرح ہو سکتی ہے، جب کہ زمین و آسمان میں جو کوئی بھی ہے وہ رحمان کے پاس غلام اور بندہ بن کر پیش ہونے والا ہے؟ بیٹا ہو اور غلام بھی، ممکن ہی نہیں۔ چوتھی دلیل یہ کہ اولاد اسی کی ہوتی ہے جس کی بیوی ہو اور اللہ تعالیٰ کی بیوی ہی نہیں تو اولاد کیسے ہوگی؟ اللہ تعالیٰ نے فرمایا : « اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَااحِبَةٌ » [ الأنعام : ۱۰۱ ] ’’ اس کی اولاد کیسے ہوگی جب کہ اس کی بیوی ہی نہیں۔‘‘ ¤ ➌ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے فرمایا : [ كَذَّبَنِي ابْنُ آدَمَ وَلَمْ يَكُنْ لَهُ ذٰلِكَ، وَشَتَمَنِيْ وَلَمْ يَكُنْ لَهُ ذٰلِكَ، فَأَمَّا تَكْذِيْبُهُ إِيَّايَ فَقَوْلُهُ لَنْ يُّعِيْدَنِيْ كَمَا بَدَأَنِيْ، وَلَيْسَ أَوَّلُ الْخَلْقِ بِأَهْوَنَ عَلَيَّ مِنْ إِعَادَتِهِ، وَأَمَّا شَتْمُهُ إِيَّايَ فَقَوْلُهُ اتَّخَذَ اللّٰهُ وَلَدًا، وَ أَنَا الْأَحَدُ الصَّمَدُ لَمْ أَلِدْ وَلَمْ أُوْلَدْ وَلَمْ يَكُنْ لِيْ كُفُوًا أَحَدٌ ] [ بخاري، التفسیر، سورۃ « قل ھو اللہ أحد» : ۴۹۷۴ ] ’’ابن آدم نے مجھے جھٹلا دیا حالانکہ یہ اس کا حق نہ تھا اور اس نے مجھے گالی دی حالانکہ یہ اس کا حق نہ تھا۔ اس کا مجھے جھٹلانا تو اس کا یہ کہنا ہے کہ جس طرح اس نے مجھے پہلی مرتبہ پیدا کیا ہے دوبارہ نہیں بنائے گا۔ حالانکہ پہلی دفعہ پیدا کرنا مجھے دوبارہ بنانے سے آسان نہیں ہے اور اس کا مجھے گالی دینا یہ ہے کہ وہ کہتا ہے اللہ نے اولاد بنائی ہے، حالانکہ میں احد ہوں، صمد ہوں۔ میں نے نہ کسی کو جنا، نہ کسی نے مجھے جنا اور نہ ہی کوئی میرے برابر کا ہے۔‘‘ ¤ ➍ { وَ لَمْ يُوْلَدْ:} ’’اور وہ جنا نہیں گیا‘‘ یعنی کسی نے اس کو نہیں جنا، اس کا کوئی باپ نہیں ہے۔ یہ ان لوگوں کے سوال کا جواب ہے جنھوں نے کہا تھا کہ ہمیں اپنے رب کانسب بیان کیجیے، کیونکہ جو پیدا ہو گا وہ حادث ہوگا، ہمیشہ سے نہیں ہوگا اور اللہ تعالیٰ تو ہمیشہ سے ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَانَ اللّٰهُ وَ لَمْ يَكُنْ شَيْءٌ قَبْلَهُ ] [ بخاري، التوحید، باب: «وکان عرشہ علی الماء… » : ۷۴۱۸ ]’’اللہ تعالیٰ تھا اور اس سے پہلے کوئی چیز نہیں تھی۔‘‘ معلوم ہوا کہ جو ولادت کے مرحلے سے گزرا ہو یا خلق کے مرحلے سے گزرا ہو وہ اللہ نہیں ہو سکتا۔ غلط کہتے ہیں جو کہتے ہیں کہ مسیح اللہ کا بیٹا ہے اور ازلی (یعنی ہمیشہ سے) ہے، یا نبی صلی اللہ علیہ وسلم اللہ کے نور سے جدا ہوئے ہیں، مگر درحقیقت وہی ہیں اور ہمیشہ سے ہیں۔ غور کرنا چاہیے کہ جو پیدا ہوا وہ ہمیشہ سے کیسے ہوگیا؟"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {وَ لَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ: ’’ كُفُوًا ‘‘} ہم مثل، جوڑ ، جو برابر کا ہو۔ {’’ قُلْ هُوَ اللّٰهُ اَحَدٌ ‘‘} کہنے سے اولاد اور کفو کی خود بخود نفی ہو جاتی ہے مگر ان کو پھر الگ بھی ذکر فرمایا، جیساکہ سورۂ بقرہ کی آیت (۹۸) : « مَنْ كَانَ عَدُوًّا لِّلّٰهِ وَ مَلٰٓىِٕكَتِهٖ وَ رُسُلِهٖ وَ جِبْرِيْلَ وَ مِيْكٰىلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلْكٰفِرِيْنَ » (جو شخص اللہ اور اس کے فرشتوں اور اس کے رسولوں کا اور جبریل اور میکال کا دشمن ہو تو بلاشبہ اللہ سب کافروں کا دشمن ہے) میں ملائکہ میں شامل ہونے کے باوجود جبریل اور میکائیل کو الگ ذکر فرمایا ہے۔ اس کا پہلا فائدہ یہ ہے کہ دوبارہ ذکر کرکے اس کی طرف خاص توجہ دلانا مقصود ہوتا ہے اور دوسرا یہ کہ اس سے مزید وضاحت اور تفصیل ہو جاتی ہے۔ ممکن ہے ایک شخص کو صرف {’’ قُلْ هُوَ اللّٰهُ اَحَدٌ ‘‘} کہنے سے ان دونوں باتوں کی طرف توجہ ہی نہ ہوتی یا توجہ ہوتی بھی تو وہ اتنی وضاحت سے نہ سمجھ سکتا جتنی وضاحت سے وہ انھیں الگ ذکر کرنے سے سمجھا ہے۔ علم بلاغت میں اسے تجرید کہتے ہیں۔ (التسہیل) ¤ ➋ رسول اللہ صلی اللہ علیہ وسلم نے اس سورت کو قرآن کا ثلث قرار دیا ہے، یہ قرآن کا ثلث کس طرح ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے خود اس کی وضاحت نہیں فرمائی، اہلِ علم نے اپنے اپنے خیال کے مطابق اس کی توجیہ فرمائی ہے بعض نے اس سے مراد ثواب لیا ہے، بعض نے فرمایا قرآن مجید کے تین ثلث ہیں، ایک ثلث احکام، دوسرا وعد و وعید اور تیسرا اسماء و صفات ہے اور اس سورت میں اسماء و صفات بیان ہوئے ہیں۔ بعض نے اللہ کی معرفت، آخرت کی معرفت اور صراطِ مستقیم کو قرآن کے تین ثلث قرار دے کر اللہ کی معرفت کو اس سورت کا موضوع قرار دیا ہے۔ بعض نے توحید، رسالت اور آخرت کو تین حصے قرار دیا اور اس سورت کو توحید کی جامع ہونے کی وجہ سے ثلثِ قرآن قرار دیا۔ یہ اختلاف خود اس بات کی دلیل ہے کہ ہر ایک نے اپنے ذہن سے ایک بات سوچی ہے، رسول اللہ صلی اللہ علیہ وسلم سے اس کی وضاحت نہیں آئی، ورنہ سب اس پر متفق ہو جاتے، اس لیے بہتر یہی ہے کہ اس بات پر ایمان رکھا جائے کہ یہ سورت قرآن کے ثلث کے برابر ہے اور یہ بات اللہ کے سپرد کر دی جائے کہ ثلث کے برابر کس طرح ہے؟ ¤ ➌ رسول اللہ صلی اللہ علیہ وسلم صبح کی سنتوں میں {’’ قُلْ يٰۤاَيُّهَا الْكٰفِرُوْنَ ‘‘} اور {’’ قُلْ هُوَ اللّٰهُ اَحَدٌ ‘‘} پڑھا کرتے تھے۔ [ دیکھیے مسلم، صلاۃ المسافرین، باب استحباب رکعتي سنۃ الفجر… : ۷۲۶ ] سورت « قُلْ يٰۤاَيُّهَا الْكٰفِرُوْنَ » توحید عملی کی جامع ہے کہ میں اللہ کے علاوہ کسی کی عبادت نہ کرتا ہوں، نہ کروں گا اور نہ ہی یہ ممکن ہے کہ میں کسی اور کی عبادت کروں اور سورت « قُلْ هُوَ اللّٰهُ اَحَدٌ » توحید علمی کی جامع ہے کہ اللہ کے متعلق عقیدہ و علم کیا ہونا چاہیے۔ (زاد المعاد)"
    }
  ]
}