{
  "surah": "Al-Hijr",
  "surah_number": 15,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) {الٓرٰتِلْكَ اٰيٰتُ الْكِتٰبِ وَ قُرْاٰنٍ مُّبِيْنٍ:’’ الْكِتٰبِ ‘‘} الف لام کی و جہ سے ’’کامل کتاب‘‘ ترجمہ کیا گیا ہے۔ {’’ الْكِتٰبِ ‘‘} اور {’’ قُرْاٰنٍ ‘‘} دونوں مبالغہ کے لیے مصدر ہیں (جن کا معنی ہے لکھنا اور پڑھنا) جو اسم مفعول کے معنی میں ہیں، یعنی یہ اس کلام کی آیات ہیں جو بے شمار بار لکھا ہوا اور بے حد و حساب پڑھا ہوا ہے، فرمایا : «{ اِنَّهٗ لَقُرْاٰنٌ كَرِيْمٌ (77) فِيْ كِتٰبٍ مَّكْنُوْنٍ }» [ الواقعۃ : ۷۷، ۷۸ ] ’’بلاشبہ یہ یقینا ایک باعزت پڑھی جانے والی چیز ہے، جو ایک ایسی کتاب میں ہے جو چھپا کر رکھی ہوئی ہے۔‘‘ لوحِ محفوظ میں لکھے جانے اور جبریل علیہ السلام اور نبی کریم صلی اللہ علیہ وسلم سے لے کر قیامت تک نہ اس کے لکھنے والوں کا شمار ہے نہ پڑھنے والوں کا۔ پھر خوبی یہ کہ یہ کتاب ہے تو کامل (الف لام کی و جہ سے) اور قرآن ہے تو ہر بات کو کھول کر بیان کرنے والا۔ قیامت تک کوئی اس جیسی ایک سورت بھی بنا کر نہیں لا سکتا۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت2) ➊ {رُبَمَا:’’رُبَّ ‘‘ } حرف جر ہے، {’’مَا‘‘} بمعنی وقت۔ {’’رُبَّ ‘‘} کا لفظ تقلیل کے لیے آتا ہے، یعنی کسی وقت، جیسے : {’’رُبَّ أَخٍ لَمْ تَلِدْهُ اُمُّكَ‘‘} ’’کئی بھائی ہیں جنھیں تیری ماں نے نہیں جنا‘‘ اور تکثیر کے لیے بھی، مثلاً {’’رُبَّمَا يَنْجُو الذَّكِيُّ‘‘} ’’بہت دفعہ ذہین آدمی کامیاب ہو جاتا ہے۔‘‘ فرق موقع کو ملحوظ رکھ کر ہوتا ہے، مثلاً یہی مثال اگر اس طرح ہو کہ{ ’’ رُبَّمَا يَنْجُ الْكَسُوْلُ ‘‘} تو معنی ہو گا ’’کسی وقت سست آدمی بھی کامیاب ہو جاتا ہے۔‘‘ اس آیت میں بعض علماء نے یہ لفظ تقلیل کے لیے قرار دیا ہے، یعنی ’’کسی وقت ‘‘ اور بعض نے تکثیر کے لیے، یعنی بہت بار، صاحب مغنی اللبیب کے بقول یہاں یہی معنی راجح ہے، کیونکہ مرنے کے بعد کفار کا ہر لمحہ اسی حسرت میں گزرے گا۔ {’’ لَوْ ‘‘} تمنی کے لیے ہے۔ ایسی چیز کی خواہش جو ناممکن ہو تمنی کہلاتی ہے، ممکن کی خواہش ’’ترجّی‘‘ کہلاتی ہے۔ ¤ ➋ { يَوَدُّ الَّذِيْنَ كَفَرُوْا:} یہ سورت مکی ہے، جب مسلمان ہر طرح کمزور اور مغلوب تھے تو اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم اور مسلمانوں کو تسلی دی کہ وہ وقت آ رہا ہے جب یہ کافر چاہیں گے کہ کاش! وہ مسلمان ہوتے، مگر وقت نکل جانے کے بعد کسی کام کی خواہش کا کوئی فائدہ نہیں۔ اس وقت سے مراد دنیا میں ایسے مواقع بھی ہیں جب مسلمانوں کو فتح و کامرانی اور کفار کو شکست و رسوائی حاصل ہو گی، جیسے بدر، خیبر اور فتح مکہ وغیرہ اور کفار چاہیں گے کہ اس وقت مسلمان ہوتے تو ہمیں بھی یہ عزت و غنیمت ملتی اور موت کے وقت بھی اس تمنا کا اظہار کریں گے، جیسا کہ فرمایا : «{ حَتّٰۤى اِذَا جَآءَ اَحَدَهُمُ الْمَوْتُ قَالَ رَبِّ ارْجِعُوْنِ (99) لَعَلِّيْۤ اَعْمَلُ صَالِحًا فِيْمَا تَرَكْتُ كَلَّا اِنَّهَا كَلِمَةٌ هُوَ قَآىِٕلُهَا }» [ المؤمنون : ۹۹، ۱۰۰ ] ’’یہاں تک کہ جب ان میں سے کسی کے پاس موت آتی ہے تو کہتا ہے اے میرے رب! مجھے واپس بھیجو، تاکہ میں جو کچھ چھوڑ آیا ہوں اس میں کوئی نیک عمل کر لوں۔ ہر گز نہیں، یہ توایک بات ہے جسے وہ کہنے والاہے۔‘‘ پھر موت کے بعد کی سختیوں میں، خصوصاً جب آگ میں داخل ہونے کو ہوں گے، فرمایا : «{ وَ لَوْ تَرٰۤى اِذْ وُقِفُوْا عَلَى النَّارِ فَقَالُوْا يٰلَيْتَنَا نُرَدُّ وَ لَا نُكَذِّبَ بِاٰيٰتِ رَبِّنَا وَ نَكُوْنَ مِنَ الْمُؤْمِنِيْنَ }» [الأنعام : ۲۷ ] ’’اور کاش! تو دیکھے جب وہ آگ پر کھڑے کیے جائیں گے تو کہیں گے اے کاش! ہم واپس بھیجے جائیں اور اپنے رب کی آیات کو نہ جھٹلائیں اور ایمان والوں میں سے ہو جائیں۔‘‘ اور سب سے زیادہ حسرت کے ساتھ یہ خواہش اس وقت کریں گے جب مسلمانوں میں سے جہنم میں جانے والے سب کے سب جہنم سے نکال لیے جائیں گے۔ ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جب اہل نار آگ میں جمع ہو جائیں گے اور ان کے ساتھ اہلِ قبلہ میں سے بھی وہ لوگ ہوں گے جنھیں اللہ چاہے گا تو کفار مسلمانوں سے کہیں گے : ’’کیا تم مسلم نہیں تھے؟‘‘ وہ کہیں گے : ’’کیوں نہیں؟‘‘ کفار کہیں گے : ’’پھر تمھارے اسلام نے تمھیں کیا فائدہ دیا کہ تم بھی ہمارے ساتھ آگ میں پہنچ گئے؟‘‘ وہ کہیں گے : ’’ہمارے کچھ گناہ تھے جن کی و جہ سے ہم پکڑے گئے۔‘‘ انھوں نے جو کچھ کہا اللہ تعالیٰ اسے سنے گا اور جو اہل قبلہ میں سے ہوں گے ان کے متعلق حکم دے گا اور وہ نکال لیے جائیں گے، تو جب جہنمی یہ دیکھیں گے تو کہیں گے : ’’کاش! ہم بھی مسلم ہوتے اور ہم بھی اسی طرح نکل جاتے جیسے یہ نکلے ہیں۔‘‘ (ابو موسیٰ رضی اللہ عنہ نے) کہا، پھر رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «{ الٓرٰ تِلْكَ اٰيٰتُ الْكِتٰبِ وَ قُرْاٰنٍ مُّبِيْنٍ (1) رُبَمَا يَوَدُّ الَّذِيْنَ كَفَرُوْا لَوْ كَانُوْا مُسْلِمِيْنَ }» [ السنۃ لابن أبي عاصم، باب ذکر من یخرج اللہ بتفضلہ من النار : ۸۴۳۔ مستدرک حاکم : ۲ / ۲۴۲، ح : ۲۹۵۴ ] شیخ البانی رحمہ اللہ نے ’’ظلال السنۃ‘‘ میں اسے صحیح کہا ہے اور اس مفہوم کی کئی احادیث بیان کی ہیں۔ ¤ ➌ {’’ مُسْلِمِيْنَ ‘‘} نکرہ ہے، اس لیے ترجمہ کیا گیا ہے کہ ’’کاش! وہ کسی طرح کے مسلمان ہوتے‘‘ یعنی گناہ گار بھی ہوتے تو آخر جہنم سے نکل ہی جاتے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت3) ➊ {ذَرْهُمْ يَاْكُلُوْا وَ يَتَمَتَّعُوْا: ’’ ذَرْ ‘‘ } مثال واوی سے فعل امر ہے، اس کا صرف امر اور مضارع استعمال ہوتا ہے، اس کے باقی صیغوں کی جگہ {’’تَرَكَ‘‘} کے مشتقات استعمال ہوتے ہیں۔ {’’ يَتَمَتَّعُوْا ‘‘ ’’ لَهْوٌ ‘‘} سے باب افعال کا مضارع {’’ يُلْهِيْ ‘‘ } ہے جو {’’ ذَرْ ‘‘} کا جواب ہونے کی و جہ سے یا لام امر مقدر ہونے کی و جہ سے مجزوم ہے، اس کی ’’یاء‘‘ اور{ ’’ يَاْكُلُوْا ‘‘} اور {’’ يَتَمَتَّعُوْا ‘‘} کا نون بھی اسی و جہ سے گر گئے ہیں۔ یہ سارے امر انھیں ڈانٹنے کے لیے ہیں، یہ نہیں کہ انھیں اجازت دی جا رہی ہے۔ اس معنی کی آیات کے لیے دیکھیے سورۂ مرسلات ( ۴۶)، سورۂ زخرف ( ۸۳) اور سورۂ طور (۴۵) وغیرہ۔{’’ يَاْكُلُوْا وَ يَتَمَتَّعُوْا ‘‘} سے معلوم ہوا کہ کفار کی زندگی کا مقصد ہی بس یہ ہے۔ {’’ الْاَمَلُ ‘‘} امید، کسی چیز کے حصول کی آرزو، عموماً جس کا حصول بعید ہو۔ ¤ ➋ { وَ يُلْهِهِمُ الْاَمَلُ:} ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں : [ أَنَّ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ غَرَزَ بَيْنَ يَدَيْهِ غَرَزًا ثُمَّ غَرَزَ إِلٰی جَنْبِهِ آخَرَ ثُمَّ غَرَزَ الثَّالِثَ فَأَبْعَدَهُ، ثُمَّ قَالَ هَلْ تَدْرُوْنَ مَا هٰذَا؟ قَالُوْا اَللّٰهُ وَرَسُوْلُهُ أَعْلَمُ ، قَالَ هٰذَا الْإِنْسَانُ وَهٰذَا أَجَلُهُ وَهٰذَا أَمَلُهُ يَتَعَاطَى الْأَمَلَ يَخْتَلِجُهُ دُوْنَ ذٰلِكَ ] [ مسند أحمد : 18/3، ح : ۱۱۱۳۸، إسنادہ جید ] ’’رسول اللہ صلی اللہ علیہ وسلم نے اپنے آگے ایک لکڑی گاڑی، پھر ایک اس کے پہلو میں گاڑی، پھر تیسری اس سے دور گاڑی، پھر فرمایا : ’’کیا تم جانتے ہو یہ کیا ہے؟‘‘ لوگوں نے کہا : ’’اللہ اور اس کا رسول زیادہ جانتے ہیں۔‘‘ فرمایا : ’’یہ انسان ہے اور یہ اس کی اجل (موت) ہے اور وہ اس کی آرزو ہے۔ وہ آرزو حاصل کرنے کی کوشش میں لگا رہتا ہے اور اس کے حصول سے پہلے اس کے راستے میں اجل رکاوٹ بن جاتی ہے۔‘‘ عبد اللہ بن عمرو رضی اللہ عنھما رسول اللہ صلی اللہ علیہ وسلم سے بیان کرتے ہیں : [ صَلاَحُ أَوَّلِ هٰذِهِ الْأُمَّةِ بِالزُّهْدِ وَالْيَقِيْنِ وَيَهْلِكُ آخِرُهَا بِالْبُخْلِ وَالْأَمَلِ ] [ سلسلۃ الأحادیث الصحیحۃ : 1263/7،ح : ۳۴۲۷ ]’’اس امت کے اول کی درستگی زہد اور یقین کے ساتھ ہے اور اس کا آخری حصہ بخل اور امل(امید) کے ساتھ ہلاک ہو گا۔‘‘"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت4) { اِلَّا وَ لَهَا كِتَابٌ مَّعْلُوْمٌ :} وہ مقرر لکھا ہوا وقت جب تک باقی رہا اللہ تعالیٰ نے انھیں مہلت دی، لیکن جوں ہی مدت پوری ہوئی فوراً انھیں پکڑ لیا گیا۔ اس سے مقصود کفار مکہ کو متنبہ کرنا ہے کہ تم نے ہمارے رسول صلی اللہ علیہ وسلم کے جھٹلانے اور ٹھٹھا اڑانے کی جو روش اختیار کر رکھی ہے اور اس پر ابھی تک ہم نے گرفت نہیں کی تو اس سے تم نے یہ کیوں سمجھ لیا کہ تمھاری گرفت ہو گی ہی نہیں؟"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت5) {وَ مَا يَسْتَاْخِرُوْنَ :} یعنی نہ وہ وقت مقرر سے پہلے ہلاک ہو سکتی ہے اور نہ وقت مقرر پر ہلاک ہونے سے بچ سکتی ہے۔ نیز دیکھیے سورۂ انعام (۲)۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت6) ➊ { وَ قَالُوْا يٰۤاَيُّهَا الَّذِيْ نُزِّلَ عَلَيْهِ الذِّكْرُ:} وہ یہ بات بھی استہزا کے لیے کہہ رہے ہیں، یہ نہیں کہ وہ اسے مانتے تھے۔ {’’ الذِّكْرُ ‘‘} سے ہر وہ چیز مراد ہے جو رسول اللہ صلی اللہ علیہ وسلم پر نازل کی گئی، اس میں قرآن مجید بھی شامل ہے اور حدیث بھی۔ ¤ ➋ { اِنَّكَ لَمَجْنُوْنٌ :} پچھلی آیات میں کفار کو کتاب اللہ کے جھٹلانے پر ڈانٹا گیا تھا، اب ان کی سرکشی کا بیان ہے اور ان کے رسول کے ساتھ استہزا اور آپ کو جھٹلانے کا بیان ہے۔ وہ لوگ مذاق کے طور پر آپ صلی اللہ علیہ وسلم کو پاگل اور دیوانہ کہتے تھے، حالانکہ آپ سب سے زیادہ عقل مند تھے۔یہ ان کے کفر و استہزا کی بدترین صورت تھی اور انھوں نے یہ بات اس قدر مشہو ر کر رکھی تھی کہ صحیح مسلم میں ضماد ازدی کا قصہ مذکور ہے کہ وہ ازد قبیلے کا ایک فرد تھا، مکہ آیا تو اس نے مکہ کے بے وقوفوں سے سنا کہ آپ مجنون ہیں، وہ آپ کے پاس آیا اور آپ کو آپ کا علاج کرنے کی پیش کش کی، آپ نے خطبہ مسنونہ پڑھا، اس نے درخواست کی کہ آپ اسے پھر پڑھیں، آپ نے تین دفعہ یہ خطبہ پڑھا، اس نے اس کی بے حد تعریف کی اور اسی پر مسلمان ہو گیا۔ [ مسلم، الجمعۃ،باب تخفیف الصلاۃ و الخطبۃ : ۸۶۸ ] سبحان اللہ! علاج کے لیے آنے والے کا خود علاج ہو گیا۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت7) {لَوْ مَا تَاْتِيْنَا بِالْمَلٰٓىِٕكَةِ : } کہ فرشتے سامنے آ کر گواہی دیں کہ یہ واقعی اللہ کا سچا پیغمبر ہے، اس کی پیروی اختیار کرو، جیسا کہ اللہ تعالیٰ نے ان کے اس مطالبے کا کئی جگہ ذکر کیا ہے، فرمایا : «{ وَ قَالُوْا لَوْ لَاۤ اُنْزِلَ عَلَيْهِ مَلَكٌ }» [ الأنعام : ۸ ] ’’اور انھوں نے کہا اس پر کوئی فرشتہ کیوں نہ اتارا گیا؟‘‘ اور دیکھیے سورۂ زخرف (۵۳) اورسورۂ فرقان( ۲۱، ۲۲) اور یہ بھی ہو سکتا ہے کہ جب آپ صلی اللہ علیہ وسلم ان کو عذاب سے ڈراتے تو انھوں نے {’’ لَوْ مَا تَاْتِيْنَا بِالْمَلٰٓىِٕكَةِ ‘‘} کہہ کر عذاب کا مطالبہ کیا ہو۔ (کبیر)"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت8) {مَا نُنَزِّلُ الْمَلٰٓىِٕكَةَ اِلَّا بِالْحَقِّ … : } یعنی فرشتے تو عین اس وقت نازل ہوتے ہیں جب کسی شخص کی موت کا وقت آ گیا ہو، یا کسی قوم پر عذاب کا قطعی فیصلہ ہو چکا ہو، اس کے بعد انھیں مہلت نہیں دی جاتی۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت9) ➊ {اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ … :} یہاں اللہ تعالیٰ نے لفظ ’’قرآن ‘‘ کے بجائے لفظ ’’ذکر ‘‘ استعمال فرمایا، جس میں سب سے پہلے قرآن آتا ہے، جیسا کہ فرمایا : «{ اِنَّاۤ اَنْزَلْنٰهُ قُرْءٰنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُوْنَ }» [ یوسف : ۲ ] ’’بے شک ہم نے اسے عربی قرآن بنا کر نازل کیا ہے، تاکہ تم سمجھو۔‘‘ اور اس کے بعد رسول اللہ صلی اللہ علیہ وسلم کے اقوال، افعال اور احوال یعنی حدیث بھی ذکر (نصیحت) ہے، کیونکہ اللہ تعالیٰ نے خود رسول اللہ صلی اللہ علیہ وسلم کو اپنا نازل کردہ ذکر قرار دیا، جیسا کہ فرمایا : «{ قَدْ اَنْزَلَ اللّٰهُ اِلَيْكُمْ ذِكْرًا (10) رَّسُوْلًا يَّتْلُوْا عَلَيْكُمْ اٰيٰتِ اللّٰهِ مُبَيِّنٰتٍ }» [ الطلاق : ۱۰، ۱۱ ] ’’یقینا اللہ نے تمھاری طرف ایک ذکر (نصیحت) نازل کیا ہے، جو ایسا رسول ہے کہ تمھارے سامنے اللہ کی واضح بیان کرنے والی آیات پڑھتا ہے۔‘‘ علاوہ ازیں قرآن مجید میں اللہ تعالیٰ نے بار بار آپ صلی اللہ علیہ وسلم جو کریں اسے کرنے کا اور جو کہیں اسے ماننے کا حکم دیا، پہلے کا نام اتباع ہے، دوسرے کا اطاعت ہے، چنانچہ فرمایا : «{ قُلْ اِنْ كُنْتُمْ تُحِبُّوْنَ اللّٰهَ فَاتَّبِعُوْنِيْ۠ }» [ آل عمران : ۳۱ ] ’’کہہ دو اگر تم اللہ سے محبت کرتے ہو تو میری پیروی کرو۔‘‘ اور فرمایا : «{ قُلْ اَطِيْعُوا اللّٰهَ وَ الرَّسُوْلَ }» [ آل عمران : ۳۲ ] ’’کہہ دے اللہ اور رسول کا حکم مانو۔‘‘ ¤ ➋ {اِنَّا نَحْنُ نَزَّلْنَا:} اس جملے میں اللہ تعالیٰ نے بے حد تاکید کے لیے لفظ ’’ہم نے‘‘ کو تین دفعہ دہرایا {’’ اِنَّا ‘‘} میں {’’ نَا ‘‘} ( ہم نے)، دوسرا {’’ نَحْنُ ‘‘} (ہم نے) اور تیسرا {’’ نَزَّلْنَا ‘‘} میں {’’نَا‘‘} (ہم نے) ۔ بہت کوشش سے بھی تینوں تاکیدوں کا ترجمہ فصیح اردو میں مشکل ہے۔ ¤ ➋ یعنی یہ ’’ذکر‘‘ جس کے لانے والے کو تم دیوانہ کہہ رہے ہو، یہ تو خود ہم ہی نے نازل کیا اور یقینا ہم ہی اس کی حفاظت کرنے والے ہیں۔ قاضی اسماعیل بصری سے پوچھا گیا کہ اس میں کیا راز ہے کہ پہلی کتابیں قرآن کی طرح محفوظ نہ رہ سکیں؟ انھوں نے فرمایا، اللہ تعالیٰ نے ان کی حفاظت انسانووں کے ذمے لگائی تھی، جیسا کہ فرمایا : «{ اِنَّاۤ اَنْزَلْنَا التَّوْرٰىةَ … بِمَا اسْتُحْفِظُوْا مِنْ كِتٰبِ اللّٰهِ }» [ المائدۃ : ۴۴ ] ’’بے شک ہم نے تورات اتاری… اس لیے کہ وہ اللہ کی کتاب کے محافظ بنائے گئے تھے‘‘ جب کہ قرآن کی حفاظت اللہ تعالیٰ نے اپنے ذمے لی۔ (الوسیط) ایک حکمت یہ بھی ہے کہ قرآن وحدیث قیامت تک کے لیے تمام لوگوں کے لیے ہیں، جب کہ اس سے پہلے ہر کتاب ایک قوم اور ایک وقت تک کے لیے تھی۔ جس طرح قرآن اپنے الفاظ اور معانی کے اعتبار سے معجزہ ہے کہ جن و انس جمع ہو کر بھی اس جیسی ایک سورت نہیں بنا سکتے، اسی طرح یہ بھی اس کا معجزہ ہے کہ اس میں رد و بدل نہیں ہو سکے گا۔ قرآن کی حفاظت کا یہ وعدہ حیرت انگیز طور پر پورا ہو رہا ہے۔ قرآن کے سوا دنیا کی کوئی کتاب ایسی نہیں جو چودہ سو سال گزرنے کے باوجود اس طرح محفوظ ہو کہ اس کے کسی ایک حرف میں رد و بدل نہ ہوا ہو۔ دنیا بھر میں قرآن کے جتنے نسخے موجود ہیں ان میں معمولی سا بھی اختلاف نہیں ہے۔ اس کے علاوہ یہ لاکھوں کروڑوں انسانوں کے سینوں میں محفوظ ہے۔ مسلمانوں پر زوال اور غلامی کے ایام بھی آئے، مگر قرآن کی حفاظت میں کوئی فرق نہیں آیا۔ یہ ہے اللہ تعالیٰ کی طرف سے حفاظت جو کسی اور کتاب کو نصیب نہیں ہوئی اور قرآن کی اس طرح حفاظت کے غیر مسلم مخالف بھی معترف ہیں۔ ¤ ➍ منکرینِ حدیث عموماً حدیث سے انکار کے لیے کہتے ہیں کہ قرآن کی حفاظت کا تو اللہ نے وعدہ کیا، مگر حدیث کی حفاظت کا وعدہ نہیں فرمایا، اس لیے اس کا کوئی اعتبار نہیں۔ ان سے پوچھیے کہ اس کی کیا دلیل ہے؟ تو وہ یہ آیت پڑھیں گے، حالانکہ اس میں لفظ ’’قرآن‘‘ نہیں بلکہ {’’ الذِّكْرَ ‘‘} ہے، جس میں حدیث بھی شامل ہے اور اس کی حفاظت کا بھی اللہ تعالیٰ نے اتنا زبردست اور عجیب و غریب انتظام فرمایا کہ دنیا میں کسی شخص کے اقوال و افعال اور احوال اس طرح محفوظ نہیں جس طرح ہمارے نبی کریم صلی اللہ علیہ وسلم کے محفوظ ہیں۔ اس کے لیے صحابہ کرام رضی اللہ عنھم ، تابعین اور محدثین نے اتنی محنت کی کہ آپ صلی اللہ علیہ وسلم کی پوری زندگی ہمارے لیے محفوظ فرما دی، جس کی پیروی اور اطاعت ہمارے لیے لازم تھی۔ اس حفاظت کے لیے اللہ تعالیٰ نے مسلمانوں کے دلوں میں رجال اور اصول حدیث کے علوم کا الہام فرمایا اور انھوں نے ایک لاکھ سے زائد افراد کی زندگی کے حالات، ان کا قابل اعتماد ہونا یا نہ ہونا، ان کا سن پیدائش و وفات محفوظ فرما دیا، جس سے معلوم ہو جاتا ہے کہ یہ روایت جو آپ صلی اللہ علیہ وسلم کی طرف منسوب ہے، صحیح ہے یا نہیں۔ کسی نبی کی زندگی کے حالات اور اقوال و افعال کے لیے نہ یہ اہتمام کسی امت کو نصیب ہوا اور نہ کسی نبی کے حالات اس کا ہزارواں حصہ بھی ملتے ہیں جس قدر محمد رسول اللہ صلی اللہ علیہ وسلم کے حالات بحفاظت دنیا تک پہنچے ہیں۔ حقیقت یہ ہے کہ اگر حدیث محفوظ نہ ہو تو قرآن پر عمل ناممکن ہے، نماز، زکوٰۃ، روزہ، حج وغیرہ غرض کوئی چیز بھی حدیث کی تفصیل کے بغیر ادا کرنا ناممکن ہے۔رہی یہ بات کہ احادیث میں ضعیف روایات کی آمیزش ہے تو جواب یہ ہے کہ جب اس کا حل موجود ہے تو اس سے کوئی فرق نہیں پڑتا، کیونکہ محدثین نے صحیح و ضعیف کو الگ الگ کر دیا ہے۔ جس طرح شیعہ کے عقیدے سے کہ یہ قرآن وہ نہیں جو علی رضی اللہ عنہ یا اہل بیت کے پاس تھا، قرآن مجید کی صحت و عظمت پر کوئی فرق نہیں پڑتا، کیونکہ بے دلیل دعویٰ کچھ وزن نہیں رکھتا اور آج تک ان کے مزعوم قرآن کا کہیں وجود نہیں ملا، اسی طرح منکرین حدیث کے اعتراض سے حدیثوں کی حفاظت پر کوئی حرف نہیں آتا، کیونکہ یہ سب اعتراض لاعلمی یا الحاد کا نتیجہ ہیں اور ان سب کا جواب علمائے اسلام نے بہترین طریقے سے دے دیا ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت11،10) {وَ لَقَدْ اَرْسَلْنَا مِنْ قَبْلِكَ …:’’ شِيَعِ ‘‘ ’’ شِيْعَةٌ ‘‘} کی جمع ہے، معنی ہے لوگوں کا ایسا گروہ جو ایک طریقے اور مذہب پر متفق ہو، خواہ نیک ہوں یا بد۔ یہاں یہ لفظ برے شیعہ یعنی بری جماعت کے معنی میں ہے، جیسا کہ اس آیت میں ہے : «{ اِنَّ الَّذِيْنَ فَرَّقُوْا دِيْنَهُمْ وَ كَانُوْا شِيَعًا لَّسْتَ مِنْهُمْ فِيْ شَيْءٍ }» [ الأنعام : ۱۵۹] ’’بے شک وہ لوگ جنھوں نے اپنے دین کو جدا جدا کر لیا اور کئی گروہ بن گئے، تو کسی چیز میں بھی ان سے نہیں۔‘‘ البتہ صافات میں نیک معنی میں ہے : «{ وَ اِنَّ مِنْ شِيْعَتِهٖ لَاِبْرٰهِيْمَ }» [ الصآفات : ۸۳ ] ’’اور بے شک اس کے گروہ میں سے ابراہیم بھی ہے۔‘‘ نبی کریم صلی اللہ علیہ وسلم کو تسلی دی گئی ہے کہ آپ ان کے جھٹلانے اور استہزا سے رنجیدہ نہ ہوں، ہر زمانے میں کفار نے انبیاء کی اسی طرح ہنسی اڑائی ہے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت11،10) {وَ لَقَدْ اَرْسَلْنَا مِنْ قَبْلِكَ …:’’ شِيَعِ ‘‘ ’’ شِيْعَةٌ ‘‘} کی جمع ہے، معنی ہے لوگوں کا ایسا گروہ جو ایک طریقے اور مذہب پر متفق ہو، خواہ نیک ہوں یا بد۔ یہاں یہ لفظ برے شیعہ یعنی بری جماعت کے معنی میں ہے، جیسا کہ اس آیت میں ہے : «{ اِنَّ الَّذِيْنَ فَرَّقُوْا دِيْنَهُمْ وَ كَانُوْا شِيَعًا لَّسْتَ مِنْهُمْ فِيْ شَيْءٍ }» [ الأنعام : ۱۵۹] ’’بے شک وہ لوگ جنھوں نے اپنے دین کو جدا جدا کر لیا اور کئی گروہ بن گئے، تو کسی چیز میں بھی ان سے نہیں۔‘‘ البتہ صافات میں نیک معنی میں ہے : «{ وَ اِنَّ مِنْ شِيْعَتِهٖ لَاِبْرٰهِيْمَ }» [ الصآفات : ۸۳ ] ’’اور بے شک اس کے گروہ میں سے ابراہیم بھی ہے۔‘‘ نبی کریم صلی اللہ علیہ وسلم کو تسلی دی گئی ہے کہ آپ ان کے جھٹلانے اور استہزا سے رنجیدہ نہ ہوں، ہر زمانے میں کفار نے انبیاء کی اسی طرح ہنسی اڑائی ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت13،12) {كَذٰلِكَ نَسْلُكُهٗ فِيْ قُلُوْبِ الْمُجْرِمِيْنَ …: ’’ نَسْلُكُهٗ ‘‘} میں {’’ هٗ ‘‘} ضمیر کے متعلق مفسرین نے دو وجہیں بیان کی ہیں، بعض نے کہا کہ {’’هٗ‘‘} کی ضمیر {’’ الذِّكْرَ ‘‘} کی طرف جا رہی ہے، یعنی ہم مجرموں کے دلوں کے اندر ذکر کو داخل کر دیتے ہیں اور وہ اسے اچھی طرح سنتے اور سمجھتے ہیں، مگر اس طرح کہ وہ باوجود دل سے سمجھنے کے اس پر ایمان بالکل نہیں لاتے اور پہلے لوگوں میں بھی یہی طریقہ گزر چکا ہے اور وہ اسی کی پاداش میں تباہ کیے جاتے رہے ہیں۔ زمخشری، رازی اور سید طنطاوی کی تفسیر کے مطابق {’’ نَسْلُكُهٗ ‘‘} اور {’’ لَا يُؤْمِنُوْنَ بِهٖ ‘‘} میں ضمیر غائب کا مرجع ایک رہتا ہے ۔ہمارے استاذ شیخ محمد عبدہ رحمہ اللہ نے بھی یہی تفسیر ذکر فرمائی ہے۔ ¤ دوسری تفسیر امام المفسرین طبری رحمہ اللہ کی ہے کہ {’’ نَسْلُكُهٗ ‘‘} میں ضمیر{ ’’هٗ ‘‘} ’’استہزا و کفر‘‘ کی طرف جاتی ہے، یعنی ہم مجرموں کے جرائم کی پاداش میں ان کے دلوں میں کفر و استہزا داخل کر دیتے ہیں، اس طرح کہ وہ اللہ کے نازل کردہ ذکر پر بالکل ایمان نہیں لاتے، بلکہ اس سے استہزا کرتے ہیں اور پہلے لوگوں کا طریقہ بھی یہی رہا ہے۔ دونوں تفسیروں کا نتیجہ رسول اللہ صلی اللہ علیہ وسلم کو تسلی دینا ہے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت13،12) {كَذٰلِكَ نَسْلُكُهٗ فِيْ قُلُوْبِ الْمُجْرِمِيْنَ …: ’’ نَسْلُكُهٗ ‘‘} میں {’’ هٗ ‘‘} ضمیر کے متعلق مفسرین نے دو وجہیں بیان کی ہیں، بعض نے کہا کہ {’’هٗ‘‘} کی ضمیر {’’ الذِّكْرَ ‘‘} کی طرف جا رہی ہے، یعنی ہم مجرموں کے دلوں کے اندر ذکر کو داخل کر دیتے ہیں اور وہ اسے اچھی طرح سنتے اور سمجھتے ہیں، مگر اس طرح کہ وہ باوجود دل سے سمجھنے کے اس پر ایمان بالکل نہیں لاتے اور پہلے لوگوں میں بھی یہی طریقہ گزر چکا ہے اور وہ اسی کی پاداش میں تباہ کیے جاتے رہے ہیں۔ زمخشری، رازی اور سید طنطاوی کی تفسیر کے مطابق {’’ نَسْلُكُهٗ ‘‘} اور {’’ لَا يُؤْمِنُوْنَ بِهٖ ‘‘} میں ضمیر غائب کا مرجع ایک رہتا ہے ۔ہمارے استاذ شیخ محمد عبدہ رحمہ اللہ نے بھی یہی تفسیر ذکر فرمائی ہے۔ ¤ دوسری تفسیر امام المفسرین طبری رحمہ اللہ کی ہے کہ {’’ نَسْلُكُهٗ ‘‘} میں ضمیر{ ’’هٗ ‘‘} ’’استہزا و کفر‘‘ کی طرف جاتی ہے، یعنی ہم مجرموں کے جرائم کی پاداش میں ان کے دلوں میں کفر و استہزا داخل کر دیتے ہیں، اس طرح کہ وہ اللہ کے نازل کردہ ذکر پر بالکل ایمان نہیں لاتے، بلکہ اس سے استہزا کرتے ہیں اور پہلے لوگوں کا طریقہ بھی یہی رہا ہے۔ دونوں تفسیروں کا نتیجہ رسول اللہ صلی اللہ علیہ وسلم کو تسلی دینا ہے۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت14) {وَ لَوْ فَتَحْنَا عَلَيْهِمْ …: ’’ ظَلَّ‘‘} اور {’’ بَاتَ ‘‘ } میں وقت بھی ملحوظ ہوتا ہے۔ {’’ظَلَّ‘‘ } دن کو ہونا، {’’بَاتَ‘‘} رات کو ہونا۔ اب ایک عجیب انداز میں ان کی ہٹ دھرمی اور ہر دلیل دیکھ کر بھی ایمان نہ لانے کا بیان ہوتا ہے، یعنی ان کا مطالبہ تو صرف فرشتے لانے کا ہے، اگر اس سے بڑھ کر عین دن کے بارہ بجے روشنی میں سب کے سامنے ہم آسمان کے دروازے کھول دیں اور یہ لوگ سیڑھی لگا کر آسمان پر چڑھنے لگیں تو پھر بھی ایمان نہیں لائیں گے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت15) { لَقَالُوْۤا اِنَّمَا سُكِّرَتْ اَبْصَارُنَا …: ’’ سَكَرَ يَسْكُرُ سَكْرًا ‘‘} باندھنا، روکنا اور بند کرنا، {’’سَكَرْتُ الْبَابَ‘‘} ’’میں نے دروازہ بند کیا۔‘‘ {’’ سُكِّرَتْ ‘‘} باب تفعیل مبالغہ کے لیے ہے، یعنی یہی کہیں گے کہ جادو کے زور سے ہماری آنکھیں بالکل بند کر دی گئی ہیں، اس لیے جادو زدہ ہونے کی و جہ سے ہم جو کچھ دیکھ رہے ہیں محض خیال ہے اور فی الواقع انھوں نے یہ کام کر بھی دکھایا، چنانچہ اللہ تعالیٰ نے فرمایا : «{ اِقْتَرَبَتِ السَّاعَةُ وَ انْشَقَّ الْقَمَرُ (1) وَ اِنْ يَّرَوْا اٰيَةً يُّعْرِضُوْا وَ يَقُوْلُوْا سِحْرٌ مُّسْتَمِرٌّ} » [القمر : ۱، ۲ ] ’’قیامت بالکل قریب آ گئی اور چاند پھٹ گیا اور اگر وہ کوئی نشانی دیکھتے ہیں تو منہ پھیر لیتے ہیں اور کہتے ہیں کہ (یہ) ایک جادو ہے جو گزر جانے والا ہے (یا ہمیشہ سے چلا آنے والا ہے)۔‘‘"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت16) ➊ {وَ لَقَدْ جَعَلْنَا فِي السَّمَآءِ بُرُوْجًا: ’’ بُرُوْجًا ‘‘ ’’ بُرْجٌ ‘‘} کی جمع ہے، جو اصل میں بڑے بلند و بالا اور مزین قلعہ یا محل کو کہتے ہیں، اللہ تعالیٰ نے فرمایا : «{ اَيْنَ مَا تَكُوْنُوْا يُدْرِكْكُّمُ الْمَوْتُ وَ لَوْ كُنْتُمْ فِيْ بُرُوْجٍ مُّشَيَّدَةٍ }» [ النساء : ۷۸ ] ’’تم جہاں کہیں بھی ہو گے موت تمھیں پا لے گی، خواہ تم مضبوط قلعوں میں ہو۔‘‘ اس کا اصل معنی نمایاں اور ظاہر ہونا ہے، جیسا کہ اللہ تعالیٰ نے ازواج مطہرات رضی اللہ عنھن سے فرمایا: «{ وَ لَا تَبَرَّجْنَ تَبَرُّجَ الْجَاهِلِيَّةِ الْاُوْلٰى }» [ الأحزاب : ۳۳ ] ’’اور پہلی جاہلیت کے زینت لگا کر نمایاں ہونے کی طرح زینت لگا کر ظاہر نہ ہو۔‘‘ مزید دیکھیے سورۂ بروج کی پہلی آیت۔ پچھلی آیاتِ رسالت کے بعد اب توحید کا بیان شروع ہوتا ہے، اللہ تعالیٰ کی توحید کے دلائل کے لیے پہلے عالم بالا کا ذکر فرمایا ہے، پھر زمین کا، پھر ان کے درمیان کی چیزوں کا اور اس کے بعد آدم و ابلیس کا تذکرہ ہے۔ چنانچہ فرمایا ہم نے آسمان میں عظیم الشان اور نمایاں برج بنائے ہیں، یعنی ستاروں کے نمایاں جھرمٹ، سورج اور چاند کی منازل جس سے رات کو ٹھنڈک والی روشنی اور دن کو تیز روشنی اور حرارت کے حصول کے علاوہ وقت، دنوں، مہینوں اور سالوں کا تعین ہوتا ہے۔ انسانوں، حیوانوں اور پودوں کی نشوونما، ان کی بقا اور بے انتہا ضرورتوں کا بندوبست ہوتا ہے، سمندر کا مدوجزر اور بے شمار فوائد جو تمھارے وہم و گمان میں بھی نہیں، انھی سے حاصل ہوتے ہیں۔ان سب کو بنانے والا، چلانے والا اللہ تعالیٰ کے سوا کون ہے؟ کسی کا دعویٰ ہے تو اسے سامنے لاؤ۔ بعض اہلِ علم نے {’’ بُرُوْجًا ‘‘} ان مقامات کو بھی بتایا ہے جہاں آسمان کے محافظ فرشتے رہتے ہیں۔ ¤ ➋ { وَ زَيَّنّٰهَا لِلنّٰظِرِيْنَ:} اللہ تعالیٰ کی قدرت و توحید کے دلائل میں سے ایک بہت بڑی دلیل یہ بھی ہے کہ اس نے آسمان کو چاند، ستاروں اور سورج سے مزین کر دیا ہے۔ رات کو ستاروں اور چاند کے ساتھ آسمان کی زینت کا نظارہ صحیح طرح وہاں ہوتا ہے جہاں مصنوعی روشنیاں نہ ہوں۔ یہ صرف ایک آسمان ہی پر موقوف نہیں، اس لامحدود قدرت والے نے جو چیز بھی پیدا کی خوب صورت پیدا کی اور اس میں زینت کا خاص اہتمام فرمایا، چھوٹے سے چھوٹے کیڑے سے لے کر بڑی سے بڑی مخلوق سب کچھ ہی کمال خوبصورت بنایا، فرمایا : «{ الَّذِيْۤ اَحْسَنَ كُلَّ شَيْءٍ خَلَقَهٗ وَ بَدَاَ خَلْقَ الْاِنْسَانِ مِنْ طِيْنٍ }» [ السجدۃ : ۷ ] ’’جس نے اچھا بنایا ہر چیز کو جو اس نے پیدا کی اور انسان کی پیدائش تھوڑی سی مٹی سے شروع کی۔‘‘ اسی لیے رسول اللہ صلی اللہ علیہ وسلم صاف ستھرا اور بن سنور کر رہنے کو پسند کرتے تھے، فرمایا : [ إِنَّ اللّٰهَ جَمِيْلٌ يُحِبُّ الْجَمَالَ ] [ مسلم، الإیمان، باب تحریم الکبر و بیانہ : ۹۱ ] ’’بے شک اللہ خوبصورت ہے، خوبصورتی کو پسند کرتا ہے۔‘‘ وہ سادھوؤں، جوگیوں یا راہبوں اور بے وقوف صوفیوں کی طرح گندے اور بدزیب ہو کر رہنے کو پسند نہیں کرتا۔ وہ دس چیزیں جنھیں رسول اللہ صلی اللہ علیہ وسلم نے فطرت کا حصہ قرار دیا، مثلاً کلی، مسواک ،ک ،زیر ناف کی صفائی وغیرہ، یہ اسی نظافت اور جمال کو کامل رکھتی ہیں۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت18،17) ➊ {وَ حَفِظْنٰهَا مِنْ كُلِّ شَيْطٰنٍ رَّجِيْمٍ :} یعنی آسمان کو ہم نے ہر مردود شیطان سے محفوظ رکھنے کا زبردست انتظام کر رکھا ہے۔ ¤ ➋ {اِلَّا مَنِ اسْتَرَقَ السَّمْعَ …:} سرقہ چوری کو کہتے ہیں، باب افتعال سے معنی میں اضافہ ہو گیا، یعنی مگر جو نہایت کوشش سے، یا نہایت خفیہ رہ کر چوری کرے۔ {’’ السَّمْعَ ‘‘} مصدر بمعنی اسم مفعول ہے، یعنی سنی ہوئی چیز چرا لے۔ {’’ شِهَابٌ ‘‘} ہر روشنی کرنے والی چیز جو آگ سے پیدا ہو، عموماً ستارہ جو شعلے کی طرح پیچھا کرتا نظر آتا ہے۔ {’’ شِهَابٌ مُّبِيْنٌ ‘‘} روشن شعلہ۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے، وہ نبی صلی اللہ علیہ وسلم سے بیان کرتے ہیں کہ آپ نے فرمایا : [ إِذَا قَضَی اللّٰهُ الْأَمْرَ فِي السَّمَاءِ  ضَرَبَتِ الْمَلَائِكَةُ بِأَجْنِحَتِهَا خُضْعَانًا لِقَوْلِهِ كَالسِّلْسِلَةِ عَلٰی صَفْوَانٍ ، فَإِذَا فُزِّعَ عَنْ قُلُوْبِهِمْ قَالُوْا مَاذَا قَالَ رَبُّكُمْ؟ قَالُوْا لِلَّذِيْ قَالَ الْحَقَّ وَهُوَ الْعَلِيُّ الْكَبِيْرُ، فَيَسْمَعُهَا مُسْتَرِقُو السَّمْعِ وَمُسْتَرِقُو السَّمْعِ هٰكَذَا، وَاحِدٌ فَوْقَ آخَرَ ــ وَوَصَفَ سُفْيَانُ بِيَدِهِ وَفَرَّجَ بَيْنَ أَصَابِعِ يَدِهِ الْيُمْنَی، نَصَبَهَا بَعْضَهَا فَوْقَ بَعْضٍ فَرُبَّمَا أَدْرَكَ الشِّهَابُ الْمُسْتَمِعَ قَبْلَ أَنْ يَرْمِيَ بِهَا إِلٰی صَاحِبِهِ فَيُحْرِقَهٗ، وَرُبَّمَا لَمْ يُدْرِكْهُ حَتّٰی يَرْمِیَ بِهَا إِلَی الَّذِيْ يَلِيْهِ، إِلَی الَّذِيْ هُوَ أَسْفَلُ مِنْهُ حَتّٰی يُلْقُوْهَا إِلَی الْأَرْضِ، فَتُلْقَی عَلٰی فَمِ السَّاحِرِ فَيَكْذِبُ مَعَهَا مِائَةَ كَذْبَةٍ، فَيُصَدَّقُ كَذَا وَ كَذَا؟ فَوَجَدْنَاهُ حَقًّا لِلْكَلِمَةِ الَّتِيْ سُمِعَتْ مِنَ السَّمَاءِ ] [ بخاری، التفسیر، باب قولہ: «إلا من استرق السمع … » : ۴۷۰۱ ] ’’جب اللہ تعالیٰ آسمان میں کوئی حکم صادر فرماتا ہے تو اس کا کلام سن کر فرشتے اظہار اطاعت و عجز کے لیے اپنے بازو (پر) پھڑ پھڑانے لگتے ہیں، (اس کلام کی آواز ایسی ہوتی ہے) جیسے کسی چٹان پر زنجیر کی آواز۔ پھر جب ان کے دلوں سے گھبراہٹ دور کر دی جاتی ہے تو وہ ایک دوسرے سے پوچھتے ہیں کہ تمھارے رب نے کیا کہا؟ وہ کہتے ہیں کہ اس نے جو فرمایا حق فرمایا اور وہ بلند اور بڑا ہے۔ (اس وقت) فرشتوں سے سنائی دینے والی بات کو چوری سننے والے شیطان سننے کی کوشش کرتے ہیں اور وہ چوری چھپے سننے والے اس طرح ایک دوسرے کے اوپر ہوتے ہیں‘‘ اور راوی حدیث سفیان نے دائیں ہاتھ کی انگلیاں کھول کر ایک دوسرے کے اوپر کر کے دکھائیں ’’پھر بعض اوقات وہ شعلہ سننے والے کو اس سے پہلے جا پہنچتا ہے کہ وہ اپنے ساتھی کو جلدی سے بتائے اور اسے جلا دیتا ہے اور بعض اوقات اس وقت پہنچتا ہے جب وہ اپنے ساتھ والے کو جلدی سے بتا چکا ہوتا ہے، جو اس سے نیچے ہوتا ہے، یہاں تک کہ وہ اسے زمین تک پہنچا دیتے ہیں، تو وہ بات کاہن (نجومی) یا جادوگر کو پہنچا دی جاتی ہے، وہ اس کے ساتھ سو جھوٹ ملا لیتا ہے تو اس کی بات کو سچا سمجھا جاتا ہے۔ لوگ کہتے ہیں، کیا اس نے ہمیں فلاں فلاں دن ایسے ایسے نہیں بتایا تھا اور ہم نے دیکھا کہ وہ بالکل درست تھا، اس بات کے متعلق جو آسمان سے سنی گئی تھی۔‘‘ مزید دیکھیے سورۂ صافات (6،5) اور سورۂ طارق (۱ تا ۴)۔ یاد رہے کہ شیطان صرف وہ بات چرا سکتے ہیں جس کا تعلق آئندہ ہونے والے ان کاموں سے ہوتا ہے، جن کے متعلق فرشتے آسمان کے نیچے آپس میں گفتگو کر رہے ہوتے ہیں، جیسا کہ صحیح بخاری میں ہے کہ فرشتے بادل میں گفتگو کر رہے ہوتے ہیں۔ [ بخاری : 3210 ] مگر اللہ تعالیٰ کی طرف سے انبیاء کی طرف جو وحی ہوتی ہے، اس کی حفاظت کا اتنا زبردست انتظام ہوتا ہے کہ ممکن ہی نہیں کہ کوئی شیطان اسے سن سکے یا چرا سکے، دیکھیے سورۂ جن کی ابتدائی اور آخری آیات کی تفسیر۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت18،17) ➊ {وَ حَفِظْنٰهَا مِنْ كُلِّ شَيْطٰنٍ رَّجِيْمٍ :} یعنی آسمان کو ہم نے ہر مردود شیطان سے محفوظ رکھنے کا زبردست انتظام کر رکھا ہے۔ ¤ ➋ {اِلَّا مَنِ اسْتَرَقَ السَّمْعَ …:} سرقہ چوری کو کہتے ہیں، باب افتعال سے معنی میں اضافہ ہو گیا، یعنی مگر جو نہایت کوشش سے، یا نہایت خفیہ رہ کر چوری کرے۔ {’’ السَّمْعَ ‘‘} مصدر بمعنی اسم مفعول ہے، یعنی سنی ہوئی چیز چرا لے۔ {’’ شِهَابٌ ‘‘} ہر روشنی کرنے والی چیز جو آگ سے پیدا ہو، عموماً ستارہ جو شعلے کی طرح پیچھا کرتا نظر آتا ہے۔ {’’ شِهَابٌ مُّبِيْنٌ ‘‘} روشن شعلہ۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے، وہ نبی صلی اللہ علیہ وسلم سے بیان کرتے ہیں کہ آپ نے فرمایا : [ إِذَا قَضَی اللّٰهُ الْأَمْرَ فِي السَّمَاءِ  ضَرَبَتِ الْمَلَائِكَةُ بِأَجْنِحَتِهَا خُضْعَانًا لِقَوْلِهِ كَالسِّلْسِلَةِ عَلٰی صَفْوَانٍ ، فَإِذَا فُزِّعَ عَنْ قُلُوْبِهِمْ قَالُوْا مَاذَا قَالَ رَبُّكُمْ؟ قَالُوْا لِلَّذِيْ قَالَ الْحَقَّ وَهُوَ الْعَلِيُّ الْكَبِيْرُ، فَيَسْمَعُهَا مُسْتَرِقُو السَّمْعِ وَمُسْتَرِقُو السَّمْعِ هٰكَذَا، وَاحِدٌ فَوْقَ آخَرَ ــ وَوَصَفَ سُفْيَانُ بِيَدِهِ وَفَرَّجَ بَيْنَ أَصَابِعِ يَدِهِ الْيُمْنَی، نَصَبَهَا بَعْضَهَا فَوْقَ بَعْضٍ فَرُبَّمَا أَدْرَكَ الشِّهَابُ الْمُسْتَمِعَ قَبْلَ أَنْ يَرْمِيَ بِهَا إِلٰی صَاحِبِهِ فَيُحْرِقَهٗ، وَرُبَّمَا لَمْ يُدْرِكْهُ حَتّٰی يَرْمِیَ بِهَا إِلَی الَّذِيْ يَلِيْهِ، إِلَی الَّذِيْ هُوَ أَسْفَلُ مِنْهُ حَتّٰی يُلْقُوْهَا إِلَی الْأَرْضِ، فَتُلْقَی عَلٰی فَمِ السَّاحِرِ فَيَكْذِبُ مَعَهَا مِائَةَ كَذْبَةٍ، فَيُصَدَّقُ كَذَا وَ كَذَا؟ فَوَجَدْنَاهُ حَقًّا لِلْكَلِمَةِ الَّتِيْ سُمِعَتْ مِنَ السَّمَاءِ ] [ بخاری، التفسیر، باب قولہ: «إلا من استرق السمع … » : ۴۷۰۱ ] ’’جب اللہ تعالیٰ آسمان میں کوئی حکم صادر فرماتا ہے تو اس کا کلام سن کر فرشتے اظہار اطاعت و عجز کے لیے اپنے بازو (پر) پھڑ پھڑانے لگتے ہیں، (اس کلام کی آواز ایسی ہوتی ہے) جیسے کسی چٹان پر زنجیر کی آواز۔ پھر جب ان کے دلوں سے گھبراہٹ دور کر دی جاتی ہے تو وہ ایک دوسرے سے پوچھتے ہیں کہ تمھارے رب نے کیا کہا؟ وہ کہتے ہیں کہ اس نے جو فرمایا حق فرمایا اور وہ بلند اور بڑا ہے۔ (اس وقت) فرشتوں سے سنائی دینے والی بات کو چوری سننے والے شیطان سننے کی کوشش کرتے ہیں اور وہ چوری چھپے سننے والے اس طرح ایک دوسرے کے اوپر ہوتے ہیں‘‘ اور راوی حدیث سفیان نے دائیں ہاتھ کی انگلیاں کھول کر ایک دوسرے کے اوپر کر کے دکھائیں ’’پھر بعض اوقات وہ شعلہ سننے والے کو اس سے پہلے جا پہنچتا ہے کہ وہ اپنے ساتھی کو جلدی سے بتائے اور اسے جلا دیتا ہے اور بعض اوقات اس وقت پہنچتا ہے جب وہ اپنے ساتھ والے کو جلدی سے بتا چکا ہوتا ہے، جو اس سے نیچے ہوتا ہے، یہاں تک کہ وہ اسے زمین تک پہنچا دیتے ہیں، تو وہ بات کاہن (نجومی) یا جادوگر کو پہنچا دی جاتی ہے، وہ اس کے ساتھ سو جھوٹ ملا لیتا ہے تو اس کی بات کو سچا سمجھا جاتا ہے۔ لوگ کہتے ہیں، کیا اس نے ہمیں فلاں فلاں دن ایسے ایسے نہیں بتایا تھا اور ہم نے دیکھا کہ وہ بالکل درست تھا، اس بات کے متعلق جو آسمان سے سنی گئی تھی۔‘‘ مزید دیکھیے سورۂ صافات (6،5) اور سورۂ طارق (۱ تا ۴)۔ یاد رہے کہ شیطان صرف وہ بات چرا سکتے ہیں جس کا تعلق آئندہ ہونے والے ان کاموں سے ہوتا ہے، جن کے متعلق فرشتے آسمان کے نیچے آپس میں گفتگو کر رہے ہوتے ہیں، جیسا کہ صحیح بخاری میں ہے کہ فرشتے بادل میں گفتگو کر رہے ہوتے ہیں۔ [ بخاری : 3210 ] مگر اللہ تعالیٰ کی طرف سے انبیاء کی طرف جو وحی ہوتی ہے، اس کی حفاظت کا اتنا زبردست انتظام ہوتا ہے کہ ممکن ہی نہیں کہ کوئی شیطان اسے سن سکے یا چرا سکے، دیکھیے سورۂ جن کی ابتدائی اور آخری آیات کی تفسیر۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت19) ➊ {وَ الْاَرْضَ مَدَدْنٰهَا:} اب زمین اور اس پر پیدا کر دہ اشیاء کو توحید کی دلیل کے لیے بیان کیا جا رہا ہے۔ {’’مَدَدْنٰهَا ‘‘ ’’مَدَّ يَمُدُّ ‘‘} (ن) کا معنی ہے کھینچنا، پھیلانا۔ جب ہم زمین کی وسعت اور پھیلاؤ کو دیکھتے ہیں تو وہ اتنی ہے کہ اس پر چلنے پھرنے، رہنے، کاشت کرنے، مکان یا سڑکیں بنانے میں کوئی مشکل پیش نہیں آتی، مگر آنکھوں کو اس کی انتہا نظر نہیں آتی، خواہ کتنا سفر کر لیں۔ یہ پھیلاؤ اور مدّ دلیل ہے کہ زمین کو اللہ تعالیٰ نے گول بنایا ہے، ورنہ اگر یہ مربع یا کسی اور شکل کی ہوتی تو یہ پھیلاؤ کسی جگہ جا کر ختم ہو جاتا، اب تو گول زمین کی تصویریں بھی آ چکی ہیں اور تجربے سے بھی یہ حقیقت ثابت ہو چکی ہے، اس کے باوجود اس کا جھکاؤ ایسا عجیب ہے کہ نہ نظر آتا ہے اور نہ اس کلیے میں کوئی فرق پڑتا ہے کہ ’’پانی اپنی سطح ہموار رکھتا ہے‘‘ مگر سیکڑوں برس پہلے اس حقیقت کو وہی بیان کر سکتا تھا جس نے اسے پیدا کیا اور پھیلایا ہے۔ ¤ ➋ {وَ اَلْقَيْنَا فِيْهَا رَوَاسِيَ: ’’ رَوَاسِيَ ‘‘ ’’ رَاسِيَةٌ ‘‘} کی جمع ہے جو {’’ رَسَا يَرْسُوْ ‘‘} (ن) کا اسم فاعل ہے، جس کا معنی کسی بھاری چیز کا گڑا ہوا ہونا ہے۔ مراد پہاڑ ہیں جن کا اکثر حصہ زمین کے اندر اور باقی باہر ہوتا ہے۔ اس سے ایک دوسری حقیقت بھی ثابت ہوتی ہے کہ زمین کو متحرک بنایا گیا ہے، تبھی اس پر بھاری پہاڑ زمین کی گردش میں توازن رکھنے کے لیے گاڑ دیے گئے، تاکہ تیز رفتاری کے باوجود اس میں لرزش اور تھرتھراہٹ پیدا نہ ہو، جیسا کہ گاڑی کے پہیوں کا توازن برقرار رکھنے کے لیے ان کی مختلف جگہوں پر ضرورت کے مطابق لوہے وغیرہ کے ٹکڑے لگا دیے جاتے ہیں۔ ایک اور آیت میں بھی یہ اشارہ موجود ہے : «{وَ تَرَى الْجِبَالَ تَحْسَبُهَا جَامِدَةً وَّ هِيَ تَمُرُّ مَرَّ السَّحَابِ }» [ النمل : ۸۸] ’’اور تو پہاڑوں کو دیکھے گا، انھیں گمان کرے گا کہ وہ جمے ہوئے ہیں،حالانکہ وہ بادلوں کے چلنے کی طرح چل رہے ہوں گے۔‘‘ ¤ ➋ {وَ اَنْۢبَتْنَا فِيْهَا مِنْ كُلِّ شَيْءٍ مَّوْزُوْنٍ:’’ فِيْهَا ‘‘} یعنی زمین میں ہر چیز اتنی اگائی اور پیدا کی جتنی اس کی ضرورت تھی، نہ کسی چیز کو بلاضرورت پیدا کیا اور نہ ایک خاص حد سے بڑھنے دیا۔ {’’ فِيْهَا ‘‘} میں ضمیر جبال (پہاڑوں) کے لیے بھی ہو سکتی ہے، یعنی پہاڑوں کے اندر ہر چیز یعنی معدنیات وغیرہ پورے اندازے سے پیدا کیں۔ (شوکانی)"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت20) { وَ جَعَلْنَا لَكُمْ فِيْهَا مَعَايِشَ …: ’’ مَعَايِشَ ‘‘ ’’مَعِيْشَةٌ‘‘} کی جمع ہے، {’’عَاشَ يَعِيْشُ عَيْشًا وَ مَعَاشًا وَمَعِيْشَةً‘‘} کا معنی زندہ رہنا ہے، جیسے {’’مَاتَ يَمُوْتُ مَوْتًا‘‘} کا معنی مرنا ہے۔ پھر یہ لفظ زندگی کی ضرورتوں کے لیے استعمال ہونے لگا، یعنی تمھاری زندگی گزارنے کے لیے کھانے پینے، رہنے، علاج، راحت، سواری، الغرض ہر ضرورت کی چیز تمھارے لیے بھی پیدا کی اور ان کے لیے بھی جنھیں تم روزی دینے والے نہیں۔ اس سے دو قسم کی چیزیں مراد ہیں، ایک تو وہ جن کا تم سے تعلق ہی نہیں، سمندر کی گہرائیوں میں پہاڑوں کی بلندیوں میں، صحراؤں کی وسعتوں میں، زمین کی تہوں میں، آباد اور بے آباد زمین کی سطح پر اور فضاؤں میں بے شمار مخلوق ہے جنھیں تم ہرگز روزی دینے والے نہیں۔ {’’ لَسْتُمْ ‘‘} نفی کی تاکید {’’ بِرٰزِقِيْنَ ‘‘} کی باء کے ساتھ ہونے کی و جہ سے ترجمہ ’’ہر گز‘‘ کیا گیا ہے۔ دوسری وہ تمام چیزیں جو تمھاری خدمت کے لیے ہیں، مثلاً چوپائے، سواریاں، بیوی بچے اور نوکر چاکر وغیرہ، جن کے متعلق تم سمجھتے ہو کہ ہم انھیں کھانے کو دے رہے ہیں، خوب سمجھ لو کہ تم ہر گز انھیں روزی نہیں دے رہے ،زمین میں ان کی معیشت بھی ہم ہی نے بنائی ہے اور ہم ہی انھیں رزق دے رہے ہیں، فرمایا : «{اِنَّ اللّٰهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِيْنُ }» [ الذاریات : ۵۸ ] ’’بے شک اللہ ہی بے حد رزق دینے والا، قوت والا، نہایت مضبوط ہے۔‘‘ اور فرمایا : «{ وَ مَا مِنْ دَآبَّةٍ فِي الْاَرْضِ اِلَّا عَلَى اللّٰهِ رِزْقُهَا }» [ ہود : ۶ ] ’’اور زمین میں کوئی چلنے والا (جاندار) نہیں مگر اس کا رزق اللہ ہی پر ہے۔‘‘"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت21) {وَ اِنْ مِّنْ شَيْءٍ اِلَّا عِنْدَنَا … :} یعنی کوئی بھی چیز، قیمتی سے قیمتی ہو یا معمولی سے معمولی، ہمارے پاس اس کے کئی خزانے ہیں، مگر ہم اس کو معلوم اندازے کے مطابق ہی ظاہر کرتے ہیں، مثلاً جلانے اور روشنی کے لیے لکڑی استعمال ہوتی تھی، جب آبادی زیادہ ہوئی تو کوئلہ نکل آیا، مزید بڑھی تو پٹرولیم عطا ہوا ،اس سے بھی بڑھی تو گیس نکل آئی، بجلی کے اوون ایجاد ہو گئے۔ توانائی اور سواری کے لیے جانور استعمال ہوتے تھے، پھر پہیہ ایجاد ہوا، پھر کوئلہ استعمال ہونے لگا، پھر پٹرولیم، گیس، بجلی اور ایٹم، الغرض! ایجادات بھی ضرورت کے مطابق اپنے اپنے وقت پر ہوئیں۔ اس سے ان ملحد لوگوں، خصوصاً حکمرانوں کی بات کا غلط ہونا صاف واضح ہوتا ہے جو کہتے ہیں کہ آبادی زیادہ بڑھ رہی ہے ، جب کہ ہمارے پاس وسائل کم ہیں ،ہم سب کی خوراک کا بندوبست نہیں کر سکتے، اس لیے آبادی کم کرو، ضبط ولادت کرو، ایک یا دو بچے پیدا ہونے دو۔ یہ لوگ درحقیقت اللہ پر ایمان نہیں رکھتے، جس نے فرمایا کہ ہمارے پاس ہر چیز کے بے شمار خزانے ہیں، مگر ہم مقرر اندازے کے ساتھ ہی اسے نازل کرتے ہیں۔ ان حکمرانوں نے کسی کو خوراک کیا دینی ہے، یہ تو خود عوام کی کمائی پر پلتے ہیں۔ اللہ کا کرم دیکھو، جو زمین پہلے دس من غلہ پیدا کرتی تھی اب سو من نکالتی ہے، بجلی اور دوسری ایجادات سے جو آسائشیں آج عام آدمی کو میسر ہیں وہ چند سو سال پہلے کسی بڑے سے بڑے بادشاہ کو بھی میسر نہ تھیں، بلکہ ان کے خیال میں بھی نہ تھیں، الا یہ کہ وہ سلیمان علیہ السلام جیسا ہو، پیدل سفر اور اونٹوں، گھوڑوں کی جگہ گاڑیاں اور جہاز اور لق و دق صحراؤں کی جگہ آبادیاں اور نہایت صاف اور کشادہ سڑکیں اور ریلویز۔ اُون اور کپاس کی جگہ پٹرولیم کے کپڑے۔ الغرض! کس کس نئی نعمت اور خزانے کا ذکر کیا جائے۔ رہا آبادی اور وسائل کا تناسب، تو وہ اللہ تعالیٰ سے بہتر کون جانتا ہے، اگر آبادی کم کرنے کی ضرورت ہو تووہ اپنی غیبی تدبیر سے خود ہی کم کر لیتا ہے، کبھی طوفانوں سے، کبھی جنگوں سے، کبھی زلزلوں سے، کبھی وباؤں کے ذریعے سے۔ الغرض ہر جان دار کا رزق اللہ کے ذمے ہے اور ہر شخص کو اللہ تعالیٰ دنیا میں ایک منہ کھانے کے لیے اور دو ہاتھ کمانے کے لیے دے کر بھیجتا ہے اور ایک ایک شخص کئی کئی افراد کی ضروریات مہیا کرتا ہے۔ دراصل یہ حکمران اس بہانے سے بدکاری اور بے حیائی پھیلانا چاہتے ہیں اور بے حیائی پھیلانے کے خواہش مند لوگوں کی سزا اللہ تعالیٰ نے سورۂ نور (۱۹) میں بیان کی ہوئی ہے۔ ہمیں اللہ کے رسول صلی اللہ علیہ وسلم کا یہی حکم ہے کہ آبادی میں زیادہ سے زیادہ اضافہ کرو، دنیامیں غلبے کا یہ ایک مضبوط ذریعہ بھی ہے اور قیامت کے دن ہمارے نبی صلی اللہ علیہ وسلم کے لیے دوسرے انبیاء سے اپنی امت کے زیادہ ہونے کی خوشی اور فخر کا باعث بھی، جیسا کہ معقل بن یسار رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ہے : [ تَزَوَّجُوا الْوَدُوْدَ الْوَلُوْدَ فَإِنِّيْ مُكَاثِرٌ بِكُمُ الْأُمَمَ ] [ أبوداوٗد، النکاح، باب النھي عن تزویج من لم یلد من النسآء : ۲۰۵۰۔ نسائی :۳۲۲۹، و صححہ الألباني ] ’’ایسی عورت سے نکاح کرو جو (خاوند سے) بہت محبت کرنے والی ہو اور بہت بچے جننے والی ہو، کیونکہ میں دوسری امتوں کے مقابلے میں تمھاری کثرت پر فخر کرنے والا ہوں گا۔‘‘"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت22) ➊ {وَ اَرْسَلْنَا الرِّيٰحَ لَوَاقِحَ …: ’’ لَوَاقِحَ ‘‘ ’’لَاقِحٌ‘‘} کی جمع بھی ہو سکتی ہے، یہ لفظ مذکر ہونے کے باوجود مؤنث ہے ،جیسے {’’حَائِضٌ‘‘} اور {’’ حَامِلٌ ‘‘، ’’ لِقَاحٌ ‘‘} نر جانور کے مخصوص پانی کو کہتے ہیں۔ {’’لَاقِحٌ‘‘} وہ اونٹنی جس نے {’’لِقَاحٌ‘‘} کو قبول کر لیا ہو، یعنی حاملہ ہو چکی ہو اور اپنے پیٹ میں جنین اٹھائے پھرتی ہو۔ اللہ تعالیٰ نے ہواؤں کو حمل اٹھانے والی اس لیے قرار دیا کہ وہ اپنے اندر حاملہ اونٹنیوں کی طرح ایسے آبی بخارات اور بادلوں کا بوجھ اٹھا کر چلتی ہیں جو بارش برسانے کا ذریعہ بنتے ہیں اور یہ {’’لَاقِحٌ‘‘} بمعنی {’’مُلْقِحٌ‘‘} (باب افعال سے اسم فاعل، یعنی وہ نر جو حاملہ کرتا ہے) کی جمع بھی ہو سکتی ہے، یعنی یہ ہوائیں بادلوں پر اور مادہ درختوں پر، مثلاً کھجور وغیرہ، یا مادہ پھولوں پر عمل کرنے کا ذریعہ بنتی ہیں کہ ہواؤں کے ذریعے سے بادل برسنے کے قابل ہوتے ہیں، ہواؤں ہی کے ذریعے سے نر درختوں اور نر پھولوں کا بور ان کے مادہ درختوں اور پھولوں تک پہنچتا ہے، جس سے ان کے پھل لانے کا عمل وجود میں آتا ہے۔ آیت کا کمالِ بلاغت یہ ہے کہ {’’ لَوَاقِحَ ‘‘} کا لفظ استعمال فرمایا جو حاملہ ہونے اور حاملہ کرنے کے دونوں مفہوم ادا کرتا ہے۔ ¤ ➋ {فَاَسْقَيْنٰكُمُوْهُ : ’’سَقٰي يَسْقِيْ‘‘} پلانا، {’’أَسْقٰي يُسْقِيْ‘‘} پلانے کے لیے دینا، مہیا کرنا، یعنی ہم نے آسمان سے پانی اتارا اور تمھیں ایک دوسرے کو پلانے اور اپنے جانوروں اور پودوں کو پلانے کے لیے عطا فرمایا۔ ¤ ➌ { وَ مَاۤ اَنْتُمْ لَهٗ بِخٰزِنِيْنَ:} یعنی نہ اوپر آسمان میں بارش کا خزانہ تمھارے قبضے میں ہے اور نہ نیچے زمین میں کنوؤں، چشموں، تالابوں کے خزانے پر تمھارا کوئی اختیار ہے۔ اللہ تعالیٰ ہی پانی کو جس مقدار میں چاہتا ہے رکھتا ہے، وہ جب چاہے بارش برسائے تم اسے روک نہیں سکتے، یا جب چاہے روک لے تم اسے اپنی مرضی سے برسا نہیں سکتے۔ اسی طرح اگر وہ چاہے تو چشموں اور کنوؤں میں تمام جمع شدہ پانی زمین میں جذب ہو جائے اور تمھیں ایک قطرہ بھی پینے کو نہ ملے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت23) {وَ اِنَّا لَنَحْنُ نُحْيٖ وَ نُمِيْتُ … :} اس آیت میں زندگی اور موت اور وراثت کا مالک صرف اللہ تعالیٰ ہونے کی تاکید {’’ اِنَّ ‘‘} ، لام تاکید، {’’ نَا ‘‘} ضمیر متکلم، {’’ نَحْنُ ‘‘} ضمیرمتکلم، {’’ نُحْيٖ ‘‘} اور {’’ نُمِيْتُ ‘‘} میں ضمیر متکلم کے ساتھ کی ہے اور آخر میں پھر {’’نَحْنُ الْوٰرِثُوْنَ ‘‘ } میں {’’ نَحْنُ ‘‘} کے ساتھ اور {’’ الْوٰرِثُوْنَ ‘‘} خبر کو الف لام برائے حصر کے ساتھ لا کر تاکید کی انتہا کر دی ہے کہ زندگی اور موت کا مالک صرف اللہ ہے اور صرف وہی وارث ہے۔ عربی زبان کے علاوہ کسی اور زبان میں اتنی تاکید کا سامان ہی موجود نہیں اور اتنی تاکید کی ضرورت اس لیے ہے کہ کفار کا طرز عمل بتاتا ہے کہ وہ یہ تینوں باتیں نہیں مانتے، ورنہ وہ اللہ کے ساتھ کسی کو شریک نہ کرتے۔جتنا انکار سخت ہو گا اتنی ہی زیادہ تاکید کے ساتھ بات کی جائے گی۔ مطلب یہ ہے کہ سب فنا ہو جائیں گے، مال و متاع جو کچھ بچ رہے گا وہ سب اللہ تعالیٰ ہی کا ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت24) {وَ لَقَدْ عَلِمْنَا الْمُسْتَقْدِمِيْنَ … :} اس میں بہت سی چیزیں آ جاتی ہیں : (1) وہ لوگ جو ہم سے پہلے گزر چکے اور جو ہمارے بعد آنے والے ہیں اللہ تعالیٰ سب کو جانتا ہے۔ اس کا علم ازلی اور ابدی ہے۔ (2) وہ لوگ جو اذان کا پہلا لفظ {’’الله اكبر‘‘} سنتے ہی اللہ تعالیٰ کو سب سے بڑا سمجھتے ہوئے سب سے پہلے نماز کے لیے چل پڑتے ہیں اور جو پیچھے رہ جاتے ہیں، اللہ تعالیٰ سب کو جانتا ہے۔ (3) مستقدمین و مستاخرین، یعنی جہاد اور دوسری نیکیوں میں آگے بڑھنے والے اور پیچھے رہنے والے سب اللہ تعالیٰ کے علم میں ہیں۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت25) { وَ اِنَّ رَبَّكَ هُوَ يَحْشُرُهُمْ … :} کفار دوبارہ زندہ ہونے کے منکر تھے، توحید کے دلائل کے بعد نہایت تاکید کے ساتھ قیامت کا یقین دلایا، کیونکہ یہ اللہ کے حکیم و علیم ہونے کا لازمی نتیجہ ہے اور اس کے بغیر بندہ نہ مومن ہوتا ہے، نہ باز پُرس کے یقین کے بغیر کوئی نیکی ہو سکتی ہے اورنہ گناہ سے بچا جا سکتا ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت26) ➊ { وَ لَقَدْ خَلَقْنَا الْاِنْسَانَ …:} اس سورت میں آیت (۱۶) «{ وَ لَقَدْ جَعَلْنَا فِي السَّمَآءِ بُرُوْجًا }» سے دلائلِ توحید کا بیان چلا آ رہا ہے، جب اوپر کی آیات میں مختلف چیزوں کی تخلیق کو بطور دلیل ذکر کیا تو اب انسان کے پیدا کیے جانے کو بطور دلیل ذکر کیا جا رہا ہے، الغرض یہ دلائلِ توحید میں ساتویں قسم ہے۔ (کبیر) ¤ ➋ {مِنْ صَلْصَالٍ مِّنْ حَمَاٍ مَّسْنُوْنٍ:} عربی زبان میں خشک مٹی کو {’’ تُرَابٌ ‘‘} کہتے ہیں، جب اسے بھگو دیا جائے تو وہ {’’طِيْنٌ‘‘} کہلاتی ہے، پھر جب مدت تک پڑی رہنے سے وہ سیاہ ہو جائے تو اسے {’’ حَمَاٍ ‘‘} کہتے ہیں ،بدبو بھی آنے لگے تو {’’ حَمَاٍ مَّسْنُوْنٍ ‘‘} (بدبو دار کیچڑ) کہتے ہیں، پھر جب وہ خشک ہو کر کھن کھن بجنے لگے تو وہ{’’ صَلْصَالٍ ‘‘} کہلاتی ہے۔ {’’ مَسْنُوْنٍ ‘‘} کا ایک معنی یہ بھی ہے کہ جس کی تصویر بنائی گئی ہو، جیسا کہ {’’ سُنَّةُ الْوَجْهِ‘‘} کا معنی {’’صُوْرَةُ الْوَجْهِ‘‘} آتا ہے اور {’’مَسْنُوْنٍ ‘‘} کا معنی ملائم و نرم بھی ہے۔ آیات و تفاسیر سے آدم علیہ  السلام کی پیدائش کی ترتیب یہ معلوم ہوتی ہے کہ سب سے پہلے اللہ تعالیٰ نے پوری زمین سے خشک مٹی لی، جیسا کہ سورۂ آل عمران (۵۹) میں آدم علیہ السلام کو {’’ تُرَابٍ ‘‘} سے پیدا کرنے کا ذکر فرمایا ہے اور جیسا کہ ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ خَلَقَ آدَمَ مِنْ قَبْضَةٍ قَبَضَهَا مِنْ جَمِيْعِ الْأَرْضِ فَجَاءَ بَنُوْ آدَمَ عَللٰی قَدْرِ الْأَرْضِ جَاءَ مِنْهُمُ الْأَحْمَرُ وَالْأَبْيَضُ وَالْأَسْوَدُ وَبَيْنَ ذٰلِكَ وَالسَّهْلُ وَاالْحَزْنُ وَالْخَبِيْثُ وَالطَّيِّبُ وَبَيْنَ ذٰلِكَ ] [ أبوداووٗد، السنۃ، باب في القدر : ۴۶۹۳۔ ترمذی : ۲۹۵۵۔ أحمد : ۴ /۴۰۰، ح : ۱۹۶۰۱، و صححہ الألباني ]’’اللہ تعالیٰ نے آدم کو ایک مٹھی سے پیدا فرمایا، جو اس نے ساری زمین سے لی، تو بنی آدم اس زمین کے اندازے کے مطابق وجود میں آئے، ان میں سرخ، سفید، سیاہ اور اس کے مابین لوگ ہیں اور نرم، سخت خبیث، طیب اور اس کے مابین بھی ہیں۔‘‘ پھر اس میں پانی ڈالا تو وہ {’’طِيْنٌ‘‘} ہو گئی، پھر اسے مدتوں پڑا رہنے دیا، جب وہ کالی سیاہ اور ملائم و نرم ہو گئی تو آدم علیہ السلام کا ڈھانچہ اور شکل و صورت بنائی، فرمایا : «{ وَ لَقَدْ خَلَقْنٰكُمْ ثُمَّ صَوَّرْنٰكُمْ }» [ الأعراف : ۱۱ ] جب وہ سوکھ کر کھن کھن بجنے لگا تو اس میں اپنی خاص پیدا کردہ روح پھونکی، جیسا کہ اس جگہ {’’ صَلْصَالٍ ‘‘} کا ذکر ہے اور اس کے خوب خشک ہونے کا ذکر سورۂ رحمن (۱۴) میں ہے، فرمایا : «{مِنْ صَلْصَالٍ كَالْفَخَّارِ }» کہ وہ کھنکھنانے والی مٹی آگ میں پکی ہوئی مٹی کی طرح کھنکھنانے والی تھی۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت27) ➊ {وَ الْجَآنَّ خَلَقْنٰهُ:} یہاں {’’ الْجَآنَّ ‘‘ } سے مراد اکثر مفسرین نے جنوں کا باپ لیا ہے، بعض جنوں کی جنس مراد لیتے ہیں، بعض نے ابلیس مراد لیا ہے۔ اسے {’’ الْجَآنَّ ‘‘} یا جن ({جَنَّ يَجُنُّ } ، بمعنی ڈھانپنا، چھپانا) انسان کی آنکھوں سے چھپنے کی وجہ سے کہتے ہیں، جیسا کہ جنین اور جنون وغیرہ سب میں ڈھانپنے کا مفہوم شامل ہے۔ جنوں کے بارے میں فرمایا : «{ اِنَّهٗ يَرٰىكُمْ هُوَ وَ قَبِيْلُهٗ مِنْ حَيْثُ لَا تَرَوْنَهُمْ }» [ الأعراف : ۲۷ ] ’’بے شک وہ اور اس کا قبیلہ تمھیں وہاں سے دیکھتے ہیں جہاں سے تم انھیں نہیں دیکھتے۔‘‘ ¤ ➋ { مِنْ قَبْلُ مِنْ نَّارِ السَّمُوْمِ : ’’ السَّمُوْمِ ‘‘} دراصل سخت گرم ہوا (لو) کو کہتے ہیں، ایک تو اس کے زہریلے ہونے کی و جہ سے ({مِنَ السُّمِّ}) اور ایک اس لیے کہ وہ جسم کے مسامات کے اندر پہنچ جاتی ہے ({مِنَ الْمَسَامِّ})۔ مراد خالص آگ جو دھوئیں سے خالی اور اپنی تیزی کی و جہ سے لو کی شکل اختیار کر چکی ہے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت28) {وَ اِذْ قَالَ رَبُّكَ لِلْمَلٰٓىِٕكَةِ اِنِّيْ خَالِقٌۢ … :} اولاً انسان کی تخلیق کو بطور دلیل ذکر فرمایا، اب اس کے بعد اس کا قصہ ذکر فرمایا۔ (رازی) {’’ وَ اِذْ قَالَ ‘‘} سے پہلے {’’اُذْكُرْ‘‘} مقدر مانتے ہیں کہ اے مخاطب عاقل! وہ وقت یاد کر جب…۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت29) ➊ {فَاِذَا سَوَّيْتُهٗ …:} یعنی جب میں اسے برابر کر لوں، مکمل بنا لوں۔ {’’ مِنْ رُّوْحِيْ ‘‘} اور اس میں اپنی روح سے پھونک دوں۔ یہاں {’’ رُوْحِيْ ‘‘} میں {’’رُوْحٌ‘‘} کی ’’یاء‘‘ کی طرف اضافت، اضافت تشریفی کہلاتی ہے، یعنی اس کا عزو شرف بڑھانے کے لیے اسے اپنی روح قرار دیا، یہاں ’’میری روح‘‘ سے مراد اللہ تعالیٰ کی مخلوق روح ہے، کیونکہ اس کی ذات کی مثل تو کوئی چیز نہیں، وہ {’’ لَمْ يَلِدْ وَ لَمْ يُوْلَدْ ‘‘} ہے، اس لیے اللہ تعالیٰ کی ذاتی روح تو کسی صورت مراد نہیں ہو سکتی، صرف آدم ہی نہیں دوسری جگہ ہر انسان کی روح کو اللہ نے اپنی روح قرار دیا ہے، فرمایا : «{ ثُمَّ سَوّٰىهُ وَ نَفَخَ فِيْهِ مِنْ رُّوْحِهٖ }» [ دیکھیے السجدۃ : ۷ تا ۹ ] اور ظاہر ہے کہ انسان مخلوق ہے، یہ ایسے ہی ہے کہ ساری زمین اور اس کی ہر چیز اللہ تعالیٰ ہی کی ہے، مگر مسجد حرام کو بیت اللہ (اللہ کا گھر) اور صالح علیہ السلام کی اونٹنی کو اللہ کی اونٹنی قرار دیا ہے۔ ¤ ➋ اس آیت سے آیت (۳۹) تک کی مفصل تفسیر کے لیے سورۂ اعراف ( ۱۱ تا ۱۸) اور سورۂ بقرہ ( ۳۰ تا ۳۴) تک کے فوائد ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 30,
      "tafsir": ""
    },
    {
      "ayah": 31,
      "tafsir": ""
    },
    {
      "ayah": 32,
      "tafsir": ""
    },
    {
      "ayah": 33,
      "tafsir": ""
    },
    {
      "ayah": 34,
      "tafsir": ""
    },
    {
      "ayah": 35,
      "tafsir": "(آیت35) {وَ اِنَّ عَلَيْكَ اللَّعْنَةَ :} اس کا ترجمہ ’’خاص لعنت‘‘ الف لام کی و جہ سے کیا گیا ہے اور اس کی وضاحت سورۂ ص (۷۸) میں آئی ہے، فرمایا : «{ وَ اِنَّ عَلَيْكَ لَعْنَتِيْۤ }» یعنی تجھ پر میری لعنت ہے۔"
    },
    {
      "ayah": 36,
      "tafsir": ""
    },
    {
      "ayah": 37,
      "tafsir": ""
    },
    {
      "ayah": 38,
      "tafsir": ""
    },
    {
      "ayah": 39,
      "tafsir": "(آیت39) {لَاُزَيِّنَنَّ لَهُمْ فِي الْاَرْضِ : } میں ان کے لیے زمین میں مزین کروں گا، کیا چیز، آیت کے سیاق و سباق سے عبارت یہ بنتی ہے کہ میں ان کے لیے زمین میں بھی خواہش نفس اور اللہ کی نافرمانی کو مزین اور خوش نما بنا کر پیش کروں گا، جیسا کہ آسمان میں ان کو ممنوعہ پودے کا کھانا خوش نما بنا کر پیش کیا اور گمراہ کر دیا تھا، فرمایا : «{ وَ عَصٰۤى اٰدَمُ رَبَّهٗ فَغَوٰى }» [ طہٰ : ۱۲۱ ] دوسرا معنی یہ ہے کہ میں انھیں تمام زینت زمین ہی میں دکھاؤں گا کہ جو کچھ ہے یہیں ہے، تاکہ وہ نہ آخرت کی طرف توجہ کریں اور نہ اس کا یقین کریں، سو اس طرح میں ان سب کو گمراہ کر دوں گا، جیسا کہ فرمایا : «{ وَ لٰكِنَّهٗۤ اَخْلَدَ اِلَى الْاَرْضِ وَ اتَّبَعَ هَوٰىهُ فَمَثَلُهٗ كَمَثَلِ الْكَلْبِ }» [ الأعراف : ۱۷۶ ] ’’اور لیکن وہ زمین ہی کی طرف چمٹ گیا اور اپنی خواہش کے پیچھے لگ گیا، سو اس کی مثال کتے کی سی ہے۔‘‘"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت40) {اِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِيْنَ :} یعنی تیرے وہ بندے جو خالص تیرے لیے چن لیے گئے اور جنھیں تو نے خاص اپنا بنا لیا میں انھیں گمراہ نہیں کر سکوں گا۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت41) {قَالَ هٰذَا صِرَاطٌ عَلَيَّ مُسْتَقِيْمٌ :} یعنی یہی صراط مستقیم اور درست بات ہے جو مجھ پر لازم ہے کہ تو میرے مخلص بندوں کو گمراہ نہ کر سکے گا اور جو میرے لیے خالص ہو گا اس کی حفاظت میں خود کروں گا، جیسے بعد میں فرمایا : «{ اِنَّ عِبَادِيْ لَيْسَ لَكَ عَلَيْهِمْ سُلْطٰنٌ }» [ الحجر : ۴۲ ] اور ایک معنی یہ بھی ہے کہ {’’ هٰذَا ‘‘} سے اخلاص کی طرف اشارہ ہو، یعنی یہی اخلاص کی راہ مجھ تک سیدھی پہنچتی ہے اور میرے خاص بندوں پر تیرا کوئی غلبہ نہیں ہو گا۔ (روح المعانی) دوسرا معنی واضح ہے۔ (واللہ اعلم)"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت42) {اِنَّ عِبَادِيْ لَيْسَ لَكَ … :} یہ پچھلی بات ہی کی وضاحت ہے اور مستثنیٰ منقطع ہے اور اگر {’’عِبَادٌ‘‘} سے مراد عام ہو تو مستثنیٰ متصل ہو گا، مطلب یہ کہ جو خود ہی بھٹکے ہوں اور جہالت کی بنا پر خود ہی تیری پیروی کرنا چاہیں۔"
    },
    {
      "ayah": 43,
      "tafsir": ""
    },
    {
      "ayah": 44,
      "tafsir": "(آیت44) ➊ { لَهَا سَبْعَةُ اَبْوَابٍ:} یہ سات دروازے مختلف قسم کے گناہ گاروں کے لیے ہوں گے، جو جہنمیوں کو جہنم کے مختلف درجوں کی طرف پہنچائیں گے۔ قرآن مجید میں جہنم کے درجوں کو ’’درکات‘‘ کہا گیا ہے، جیسا کہ فرمایا : «{ اِنَّ الْمُنٰفِقِيْنَ فِي الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِ }» [ النساء : ۱۴۵ ] ’’بے شک منافق لوگ آگ کے سب سے نچلے درجے میں ہوں گے۔‘‘ ابوطالب کے متعلق صحیح حدیث میں آیا ہے کہ آگ اس کے ٹخنوں تک پہنچ رہی ہو گی۔ سمرہ رضی اللہ عنہ سے روایت کہ انھوں نے نبی صلی اللہ علیہ وسلم سے سنا، آپ فرماتے تھے : [ إِنَّ مِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلٰی كَعْبَيْهِ، وَمِنْهُمْ مَنْ تَأْخُذُهُ إِلٰی حُجْزَتِهِ، وَمِنْهُمْ مَنْ تَأْخُذُهُ إِلٰی عُنُقِهِ ] [ مسلم، الجنۃ وصفۃ  نعیمھا، باب جہنم أعاذنا اللہ منھا : ۲۸۴۵ ]’’ان میں سے کچھ لوگ ایسے ہوں گے جنھیں آگ ٹخنوں تک پکڑے گی اور ان میں سے کچھ لوگ ایسے ہوں گے جنھیں ان کی کمر تک پکڑے گی اور ان میں سے کچھ ایسے ہوں گے جنھیں ان کی گردن تک پکڑے گی۔‘‘ ¤ ➋ {لِكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُوْمٌ :} تقسیم کیے ہوئے حصے سے مراد بدکاروں کے سات حصوں میں تقسیم شدہ مجرموں کا ایک حصہ ہے، یعنی جس طرح ایک خاص عمل والے لوگ جنت میں ایک خاص دروازے سے داخل ہوں گے، اسی طرح برے عمل والے لوگ بھی اپنے اعمال کے مطابق جہنم کے مختلف دروازوں سے داخل ہوں گے، جیسے اوپر ذکر ہوا : «{ اِنَّ الْمُنٰفِقِيْنَ فِي الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِ }» [ النساء : ۱۴۵ ] ’’بے شک منافق لوگ آگ کے سب سے نچلے درجے میں ہوں گے۔‘‘ شاہ عبدالقادر رحمہ اللہ فرماتے ہیں : ’’شاید بہشت کا ایک دروازہ زیادہ اس لیے ہے کہ بعض موحدین صرف اللہ کے فضل سے جنت میں جائیں گے، بغیر عمل کے۔‘‘ (موضح)"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت45) ➊ {’’ الْمُتَّقِيْنَ ‘‘ ’’اِتَّقٰي‘‘} باب افتعال سے اسم فاعل {’’مُتَّقِيْ‘‘} کی جمع ہے۔ مجرد {’’وَقٰي يَقِیْ وَقَايَةً‘‘} ہے، بمعنی بچانا اور نقصان دہ چیزوں سے محفوظ رکھنا۔ تفصیل کے لیے دیکھیے سورۂ بقرہ (۲)۔ ¤ ➋ {فِيْ جَنّٰتٍ وَّ عُيُوْنٍ:} گمراہ لوگوں کے برے انجام کے ساتھ ہی متقی لوگوں کے بہترین انجام کا ذکر ہے اور یہ قرآن مجید کا عام انداز ہے کہ وہ دونوں پہلوؤں کا ساتھ ساتھ ذکر کرتا ہے۔ {’’ جَنّٰتٍ ‘‘ ’’جَنَّةٌ‘‘} کی جمع ہے، گھنے درختوں کا باغ جو زمین کو چھپائے ہوئے ہو۔ {’’جَنَّ يَجُنُّ‘‘} کا معنی ہے چھپانا۔ {’’ عُيُوْنٍ ‘‘ } کا معنی ہے چشمے، مراد وہ چشمے ہیں جن سے جنت کی نہریں نکلتی ہیں، یا الگ چشمے، کیونکہ چشموں کا حسن ایک الگ ہی چیز ہے۔ سورۂ دہر میں کافور اور زنجبیل کی آمیزش والے چشمے، سلسبیل نامی چشمے اور سورۂ مطففین میں تسنیم نامی چشمے کی تفصیل ملاحظہ فرمائیں۔ یاد رہے کہ جنت سے مراد صرف باغ ہی نہیں، بلکہ سونے چاندی کی اینٹوں کے مکانات اور ایک ایک موتی یا لعل سے بنے ہوئے میلوں لمبے اور اونچے خیموں کے ساتھ ملے ہوئے باغات ہیں، جیسا کہ صحیح احادیث میں جنت کے اوصاف میں مذکور ہے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت46) {اُدْخُلُوْهَا بِسَلٰمٍ …: } یعنی انھیں یہ کہا جائے گا۔ {’’ بِسَلٰمٍ ‘‘} یعنی ہر قسم کے آفات و مصائب سے سلامتی کے ساتھ، ایک دوسرے کو سلام کہتے ہوئے، فرشتوں کے سلام سنتے ہوئے اور پروردگار عالم کے {’’ سَلٰمٌ قَوْلًا مِّنْ رَّبٍّ رَّحِيْمٍ ‘‘} کے ساتھ۔ (دیکھیے یٰسٓ : ۵۸) اسی لیے جنت کا ایک نام ’’دار السلام‘‘ بھی ہے، فرمایا : «{ لَهُمْ دَارُ السَّلٰمِ عِنْدَ رَبِّهِمْ }» [ الأنعام : ۱۲۷ ] {’’ اٰمِنِيْنَ ‘‘} ہر خوف خطرے سے محفوظ۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت47) {وَ نَزَعْنَا مَا فِيْ صُدُوْرِهِمْ مِّنْ غِلٍّ …: ’’ نَزْعٌ‘‘} کا معنی کھینچ کر، اکھاڑ کر نکالنا ہے۔ اس سے معلوم ہوا کہ کینہ اور دشمنی دل میں کتنی گہری جڑ پکڑتی ہے۔ {’’ غِلٍّ ‘‘} کینہ، کھوٹ، یعنی اللہ تعالیٰ دنیا میں اہل جنت کے دلوں میں ایک دوسرے کے متعلق ہر کینے کو جڑ سے اکھاڑ کر پھینک دے گا، کیونکہ جس سینے میں کوئی کدورت ہو وہ مکمل خوشی سے ہم کنار نہیں ہو سکتا۔ دلوں کی صفائی کے بعد وہ بھائی بھائی بن کر آمنے سامنے تختوں پر بیٹھے ہوں گے۔ محبت ہو تو خودبخود چہرے آپس میں مل جاتے ہیں، جب کہ دلوں میں کدورت ہو تو چہرے بھی ادھر ادھر ہو جاتے ہیں: ¤ دل بدلتے ہیں تو چہرے بھی بدل جاتے ہیں ¤ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے (اہل جنت کے متعلق) فرمایا : [ قُلُوْبُهُمْ عَلٰی قَلْبِ رَجُلٍ وَّاحِدٍ لاَ اخْتِلَافَ بَيْنَهُمْ وَلَا تَبَاغُضَ ] [ بخاری، بدء الخلق، باب ما جاء فی صفۃ الجنۃ : ۳۲۴۶ ] ’’ان کے دل ایک آدمی کے دل کی طرح ہوں گے، نہ ان میں کوئی اختلاف ہو گا، نہ آپس میں کوئی بغض۔‘‘ ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایایا: [ يَخْلُصُ الْمُؤْمِنُوْنَ مِنَ النَّارِ فَيُحْبَسُوْنَ عَلٰی قَنْطَرَةٍ بَيْنَ الجَنَّةِ وَالنَّارِ، فَيُقْتَصُّ لِبَعْضِهِمْ مِنْ بَعْضٍ مَظَالِمُ كَانَتْ بَيْنَهُممْ فِي الدُّنْيَا، حَتّٰی إِذَا هُذِّبُوْا وَ نُقُّوْا أُذِنَ لَهُمْ فِيْ دُخُوْلِ الجَنَّةِ ] [ بخاری، الرقاق، باب القصاص یوم القیامۃ : ۶۵۳۵ ] ’’مومن آگ سے بچ کر آئیں گے تو جنت اور جہنم کے درمیان ایک پل پر روک لیے جائیں گے، پھر دنیا میں ان کے ایک دوسرے پر مظالم کا قصاص ایک دوسرے کو دلوایا جائے گا، یہاں تک کہ جب ان کی پوری تراش خراش کر دی جائے گی اور خوب پاک صاف کر دیے جائیں گے تو انھیں جنت میں داخلے کی اجازت ملے گی۔‘‘ اس آیت سے معلوم ہوا کہ صحابہ کرام اور صلحائے امت باہمی لڑائیوں اور رنجشوں کے باوجود جنت میں جائیں گے، مگر اس سے پہلے ان کے دلوں کی باہمی کدورتیں بالکل دور کر دی جائیں گی اور وہ صاف دل بھائی بھائی ہو کر جنت میں جائیں گے۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت48) ➊ { لَا يَمَسُّهُمْ فِيْهَا نَصَبٌ:} دنیا میں کوئی شخص دکھ، مصیبت، مشقت اور تھکن سے خالی نہیں، بلکہ یہ ساری زندگی ہی محنت اور مشقت کی ہے، یہاں زیادہ سے زیادہ خوشی اور لذت کے ساتھ بھی کوئی نہ کوئی مشقت، محنت، تھکن یا غم ضرور ہے۔ اللہ تعالیٰ نے سورۂ بلد کے شروع میں کئی قسمیں کھا کر فرمایا : «{ لَقَدْ خَلَقْنَا الْاِنْسَانَ فِيْ كَبَدٍ }» [ البلد : ۴ ] ’’بلاشبہ یقینا ہم نے انسان کو بڑی مشقت میں پیدا کیا ہے‘‘ اور سورۂ انشقاق میں فرمایا : «{ يٰۤاَيُّهَا الْاِنْسَانُ اِنَّكَ كَادِحٌ اِلٰى رَبِّكَ كَدْحًا فَمُلٰقِيْهِ }» [ الانشقاق : ۶ ] ’’اے انسان! بے شک تو مشقت کرتے کرتے اپنے رب کی طرف جانے والا ہے، سخت مشقت، پھر اس سے ملنے والا ہے۔‘‘ جب کہ جنت میں نہ کوئی دکھ ہو گا نہ تھکاوٹ۔ ابوسعید خدری اور ابوہریرہ رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُنَادِيْ مُنَادٍ إِنَّ لَكُمْ أَنْ تَصِحُّوْا فَلَا تَسْقَمُوْا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَحْيَوْا فَلَا تَمُوْتُوا أَبَدًا، وَإِنَّ لَكُمْ أَنْ تَشِبُّوْا فَلَا تَهْرَمُوْا أَبَدًا، وَإِنَّ لَكُممْ أَنْ تَنْعَمُوْا فَلَا تَبْأَسُوْا أَبَدًا فَذٰلِكَ قَوْلُهٗ عَزَّوَجَلَّ : «{ وَ نُوْدُوْۤا اَنْ تِلْكُمُ الْجَنَّةُ اُوْرِثْتُمُوْهَا بِمَا كُنْتُمْ تَعْمَلُوْنَ }» ] [ الأعراف : ۴۳ ]’’ایک منادی ندا دے گا (اے جنت والو!) بے شک تمھارے لیے یہ ہو گا کہ تم تندرست رہو گے کبھی بیمار نہیں ہو گے اور تمھارے لیے یہ ہو گا کہ تم زندہ رہو گے کبھی تمھیں موت نہیں آئے گی اور تمھارے لیے یہ ہو گا کہ تم جوان رہو گے کبھی بوڑھے نہیں ہو گے اور تمھارے لیے طے ہو چکا کہ تم خوش حال رہو گے کبھی تنگی اورتکلیف نہیں اٹھاؤ گے۔‘‘ چنانچہ یہی اللہ تعالیٰ کا فرمان ہے : «{ وَ نُوْدُوْا اَنْ تِلْکُمُ الْجَنَّۃُ اُوْرِثْتُمُوْھَابِمَا کُنْتُمْ تَعْمَلُوْنَ }» ’’اور انھیں آواز دی جائے گی کہ یہی وہ جنت ہے جس کے وارث تم اس کی وجہ سے بنائے گئے ہو جو تم کیا کرتے تھے۔‘‘ [ مسلم، الجنۃ و صفۃ نعیمھا، باب في دوام نعیم أہل الجنۃ… : ۲۲ /۲۸۳۷ ] ¤ ➋ {وَ مَا هُمْ مِّنْهَا بِمُخْرَجِيْنَ :} عبد اللہ بن عمر رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا صَارَ أَهْلُ الْجَنَّةِ إِلَی الْجَنَّةِ، وَصَارَ أَهْلُ النَّارِ إِلَی النَّارِ، أُتِيَ بِالْمَوْتِ حَتّٰی يُجْعَلَ بَيْنَ الْجَنَّةِ وَالنَّارِ، ثُمَّ يُذْبَحُ، ثُمَّ يُنَادِيْ مُنَادٍ يَا أَهْلَ الْجَنَّةِ! لَا مَوْتَ، يَا أَهْلَ النَّارِ! لَا مَوْتَ، فَيَزْدَادُ أَهْلُ الْجَنَّةِ فَرَحًا إِللٰی فَرَحِهِمْ، وَيَزْدَادُ أَهْلُ النَّارِ حُزْنًا إِلٰی حُزْنِهِمْ ] [ مسلم، الجنۃ و صفۃ نعیمھا، باب النار یدخلھا الجبارون… : ۴۳ /۲۸۵۰ ] ’’جب جنتی جنت میں اور جہنمی جہنم میں پہنچ جائیں گے تو موت کو (ایک مینڈھے کی شکل میں) لایا جائے گا اور اسے جنت اور جہنم کے درمیان رکھ دیا جائے گا، پھر اسے ذبح کر دیا جائے گا، پھر ایک منادی اعلان کرے گا اے جنت والو! اب موت نہیں اور اے آگ والو! اب موت نہیں، تو جنت والے اپنی خوشی کے ساتھ اور زیادہ خوش ہو جائیں گے اور آگ والے اپنے غم کے ساتھ اور زیادہ غم زدہ ہو جائیں گے۔‘‘"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت50،49) ➊ {نَبِّئْ عِبَادِيْۤ اَنِّيْۤ اَنَا الْغَفُوْرُ الرَّحِيْمُ … : ’’نَبَأٌ‘‘ } خاص اور اہمیت والی خبر کو کہتے ہیں۔ {’’ نَبِّئْ ‘‘} باب تفعیل سے امر ہے، یعنی یہ بات اچھی طرح بتا دو، تاکہ وہ امید بھی رکھیں اور خوف بھی، کیونکہ ایمان ان دونوں کے درمیان ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَوْ يَعْلَمُ الْمُؤْمِنُ مَا عِنْدَ اللّٰهِ مِنَ الْعُقُوْبَةِ، مَا طَمِعَ بِجَنَّتِهِ أَحَدحَدٌ، وَلَوْ يَعْلَمُ الْكَافِرُ مَا عِنْدَ اللّٰهِ مِنَ الرَّحْمَةِ، مَا قَنِطَ مِنْ جَنَّتِهِ أَحَدٌ ] [ مسلم، التوبۃ، باب في سعۃ رحمۃ اللہ تعالٰی… : ۲۷۵۵ ] ’’اگر مومن جان لے کہ اللہ کے پاس کتنی عقوبت ہے تو کوئی اس کی جنت کا طمع نہ رکھے اور اگر کافر جان لے کہ اللہ کے پاس کس قدر رحمت ہے تو کوئی اس کی جنت سے ناامید نہ ہو۔‘‘ ان آیات میں رحمت و مغفرت کا بیان پہلے اور عذاب الیم کا ذکر بعد میں ہے، کیونکہ اللہ تعالیٰ کی اصل اور غالب صفت رحمت ہے، عذاب تو محض عدل کے نتیجے میں ظاہر ہوتا ہے۔ تفصیل کے لیے دیکھیے سورۂ اعراف کی آیت (۱۵۶) کی تفسیر۔ ¤ یہاں رحمت کے اظہار کے لیے پہلے {’’ عِبَادِيْۤ ‘‘} سے خطاب، پھر {’’أَنَّ‘‘، ’’ اَنَا ‘‘} ضمیر فصل اور {’’ الْغَفُوْرُ الرَّحِيْمُ ‘‘} کو الف لام کے ساتھ لا کر تاکید پر تاکید فرمائی، دوسری آیت میں {’’ هُوَ ‘‘} ضمیر فصل اور {’’ الْعَذَابُ ‘‘} کو معرف باللام لا کر تاکید فرمائی۔ پہلی آیت میں فرمایا کہ میری صفات رحمت یہ ہیں اور ان کا مالک میرے سوا کوئی نہیں، دوسری آیت میں فرمایا اور میرے عذاب کی صفت یہ ہے، یہ نہیں فرمایا : {’’ وَإِنِّيْ أَنَا الْمُعَذِّبُ… ‘‘} کہ میں ہی ایسا عذاب دینے والا ہوں، بلکہ اپنے عذاب کی صفت بیان فرمائی کہ میرا عذاب ہی ایسا ہے جو عذاب الیم ہے۔ ¤ ➋ یہ آیات تمہید ہیں ان واقعات کی جو آگے آ رہے ہیں، جن میں فرشتوں کی ایک جماعت کے ذریعے سے اللہ تعالیٰ کی رحمت کا ظہور ہوا اور انھی کے ذریعے سے اس کے عذاب الیم کا ظہور ہوا۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت50،49) ➊ {نَبِّئْ عِبَادِيْۤ اَنِّيْۤ اَنَا الْغَفُوْرُ الرَّحِيْمُ … : ’’نَبَأٌ‘‘ } خاص اور اہمیت والی خبر کو کہتے ہیں۔ {’’ نَبِّئْ ‘‘} باب تفعیل سے امر ہے، یعنی یہ بات اچھی طرح بتا دو، تاکہ وہ امید بھی رکھیں اور خوف بھی، کیونکہ ایمان ان دونوں کے درمیان ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَوْ يَعْلَمُ الْمُؤْمِنُ مَا عِنْدَ اللّٰهِ مِنَ الْعُقُوْبَةِ، مَا طَمِعَ بِجَنَّتِهِ أَحَدحَدٌ، وَلَوْ يَعْلَمُ الْكَافِرُ مَا عِنْدَ اللّٰهِ مِنَ الرَّحْمَةِ، مَا قَنِطَ مِنْ جَنَّتِهِ أَحَدٌ ] [ مسلم، التوبۃ، باب في سعۃ رحمۃ اللہ تعالٰی… : ۲۷۵۵ ] ’’اگر مومن جان لے کہ اللہ کے پاس کتنی عقوبت ہے تو کوئی اس کی جنت کا طمع نہ رکھے اور اگر کافر جان لے کہ اللہ کے پاس کس قدر رحمت ہے تو کوئی اس کی جنت سے ناامید نہ ہو۔‘‘ ان آیات میں رحمت و مغفرت کا بیان پہلے اور عذاب الیم کا ذکر بعد میں ہے، کیونکہ اللہ تعالیٰ کی اصل اور غالب صفت رحمت ہے، عذاب تو محض عدل کے نتیجے میں ظاہر ہوتا ہے۔ تفصیل کے لیے دیکھیے سورۂ اعراف کی آیت (۱۵۶) کی تفسیر۔ ¤ یہاں رحمت کے اظہار کے لیے پہلے {’’ عِبَادِيْۤ ‘‘} سے خطاب، پھر {’’أَنَّ‘‘، ’’ اَنَا ‘‘} ضمیر فصل اور {’’ الْغَفُوْرُ الرَّحِيْمُ ‘‘} کو الف لام کے ساتھ لا کر تاکید پر تاکید فرمائی، دوسری آیت میں {’’ هُوَ ‘‘} ضمیر فصل اور {’’ الْعَذَابُ ‘‘} کو معرف باللام لا کر تاکید فرمائی۔ پہلی آیت میں فرمایا کہ میری صفات رحمت یہ ہیں اور ان کا مالک میرے سوا کوئی نہیں، دوسری آیت میں فرمایا اور میرے عذاب کی صفت یہ ہے، یہ نہیں فرمایا : {’’ وَإِنِّيْ أَنَا الْمُعَذِّبُ… ‘‘} کہ میں ہی ایسا عذاب دینے والا ہوں، بلکہ اپنے عذاب کی صفت بیان فرمائی کہ میرا عذاب ہی ایسا ہے جو عذاب الیم ہے۔ ¤ ➋ یہ آیات تمہید ہیں ان واقعات کی جو آگے آ رہے ہیں، جن میں فرشتوں کی ایک جماعت کے ذریعے سے اللہ تعالیٰ کی رحمت کا ظہور ہوا اور انھی کے ذریعے سے اس کے عذاب الیم کا ظہور ہوا۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت51) {وَ نَبِّئْهُمْ عَنْ ضَيْفِ اِبْرٰهِيْمَ : ’’ ضَيْفِ ‘‘} یہ {’’ضَافَ يَضِيْفُ‘‘} کا مصدر ہے، جو مائل ہونے کے معنی میں آتا ہے، مہمان چونکہ کسی کی طرف مائل ہو کر ہی آتا ہے، اس لیے اسے {’’ضَيْفٌ‘‘} کہتے ہیں، یہ واحد، تثنیہ اور جمع سبھی کے لیے {’’ضَيْفٌ ‘‘} واحد ہی آتا ہے، جیسا کہ اس آیت میں جمع کے لیے آیا ہے بعض لوگ اس کی جمع {’’اَضْيَافٌ‘‘} یا {’’ضُيُوْفٌ‘‘} بھی استعمال کرتے ہیں۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت52) { اِنَّا مِنْكُمْ وَ جِلُوْنَ : ’’ وَ جِلُوْنَ ‘‘ ’’ وَجِلَ يَوْجَلُ} (س) سے{ ’’ وَجِلٌ ‘‘} (صفت مشبہ) کی جمع ہے، بمعنی ڈرنے والے۔ ڈرنے کی وجہ، مکمل واقعہ اور اس کے فوائد کے لیے دیکھیے سورۂ ہود (۶۹) سے واقعہ کے آخر تک۔"
    },
    {
      "ayah": 53,
      "tafsir": ""
    },
    {
      "ayah": 54,
      "tafsir": ""
    },
    {
      "ayah": 55,
      "tafsir": ""
    },
    {
      "ayah": 56,
      "tafsir": "(آیت56) {قَالَ وَ مَنْ يَّقْنَطُ مِنْ رَّحْمَةِ رَبِّهٖۤ … :} یعنی میں نے دنیا کا عام دستور اور اپنا بڑھاپا دیکھ کر محض تعجب کا اظہار کیا ہے، ورنہ یہ مقصد نہیں ہے کہ میں اللہ تعالیٰ کی رحمت سے مایوسی کا اظہار کر رہا ہوں۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت57) { قَالَ فَمَا خَطْبُكُمْ اَيُّهَا الْمُرْسَلُوْنَ :} غالباً ابراہیم علیہ السلام قرائن سے سمجھ گئے کہ فرشتوں کے آنے کا مقصد محض مجھے خوش خبری دینا نہیں، کیونکہ عموماً فرشتے کسی بڑی مہم ہی کے لیے آیا کرتے ہیں، جیسا کہ فرمایا : «{ مَا نُنَزِّلُ الْمَلٰٓىِٕكَةَ اِلَّا بِالْحَقِّ }» [ الحجر : ۸ ] ’’ہم فرشتوں کو نہیں اتارتے مگر حق کے ساتھ۔‘‘"
    },
    {
      "ayah": 58,
      "tafsir": ""
    },
    {
      "ayah": 59,
      "tafsir": ""
    },
    {
      "ayah": 60,
      "tafsir": ""
    },
    {
      "ayah": 61,
      "tafsir": ""
    },
    {
      "ayah": 62,
      "tafsir": "(آیت62) {قَالَ اِنَّكُمْ قَوْمٌ مُّنْكَرُوْنَ :} جن کی جان پہچان نہ ہو، اجنبی، اُوپرے۔ ابراہیم علیہ السلام کی طرح لوط علیہ السلام بھی انھیں پہچان نہ سکے۔ اس سے واضح طور پر ثابت ہوا کہ دوسری ساری مخلوق کی طرح یہ دونوں جلیل القدر انبیاء بھی عالم الغیب نہ تھے، ورنہ وہ ان کے آنے سے پہلے ہی انھیں جانتے ہوتے اور ان کے آنے سے باخبر ہوتے، بلکہ ابراہیم علیہ السلام کو پہلے ہی معلوم ہوتا کہ مجھے اتنی عمر میں اسحاق عطا ہوں گے اور لوط علیہ السلام کو پہلے ہی اپنی قوم کا انجام معلوم ہوتا، مگر اس کا نتیجہ یہ ہو گا کہ ابراہیم علیہ السلام کا اسماعیل علیہ السلام کو ذبح کرنے پر صبر، آگ میں ڈالے جانے پر بھی استقامت کا اظہار، جبار مصر کی زیادتی کی آزمائش پر صبر، ہاجر اور اسماعیل کو وادی غیر ذی زرع میں چھوڑنے پر صبر، غرض ان کی کوئی آزمائش، آزمائش نہیں رہے گی، کیونکہ اگر پہلے علم ہو کہ ہمارا کچھ نہیں بگڑے گا تو ہر شخص آگ میں کود سکتا ہے اور بیٹے کی گردن پر چھری چلانے کے لیے تیار ہو سکتا ہے۔ شیعہ حضرات نے تو انبیاء کے علاوہ اپنے بارہ اماموں کو ہر گزری ہوئی اور آنے والی بات جاننے والا قرار دیا۔ دیکھیے ان کی کتاب ’’الکافی‘‘ کی فہرست، جسے وہ اتنا معتبر سمجھتے ہیں جتنا اہل سنت صحیح بخاری کو۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت64،63) {قَالُوْا بَلْ جِئْنٰكَ بِمَا كَانُوْا فِيْهِ يَمْتَرُوْنَ … : ’’ اِمْتِرَاءٌ ‘‘} سے مضارع معلوم ہے، ایسا شک جو انسان کو ایسی بات پر جھگڑنے کے لیے آمادہ کرے جس کی حقیقت کچھ نہ ہو، بلکہ وہ صرف وہم و گمان پر مبنی ہو۔ (طنطاوی) اس لیے اس میں جھگڑے کا مفہوم بھی پایا جاتا ہے۔ فرشتوں نے لوط علیہ السلام کو تسلی دینے کے لیے یہ بات کہی کہ ہم تمھیں پریشان کرنے کے لیے نہیں آئے، بلکہ وہ عذاب لے کر آئے ہیں جس میں یہ لوگ شک کرتے اور جھگڑتے رہے ہیں اور واقعی ہم سچ کہہ رہے ہیں۔ {’’ بِالْحَقِّ ‘‘} سے مراد عذاب ہے، جیسا کہ فرمایا : «{ مَا نُنَزِّلُ الْمَلٰٓىِٕكَةَ اِلَّا بِالْحَقِّ وَ م مَا كَانُوْۤا اِذًا مُّنْظَرِيْنَ }» [ الحجر : ۸ ] ’’ہم فرشتوں کو نہیں اتارتے مگر حق (یعنی عذاب) کے ساتھ اور اس وقت وہ مہلت دیے گئے نہیں ہوتے۔‘‘"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت64،63) {قَالُوْا بَلْ جِئْنٰكَ بِمَا كَانُوْا فِيْهِ يَمْتَرُوْنَ … : ’’ اِمْتِرَاءٌ ‘‘} سے مضارع معلوم ہے، ایسا شک جو انسان کو ایسی بات پر جھگڑنے کے لیے آمادہ کرے جس کی حقیقت کچھ نہ ہو، بلکہ وہ صرف وہم و گمان پر مبنی ہو۔ (طنطاوی) اس لیے اس میں جھگڑے کا مفہوم بھی پایا جاتا ہے۔ فرشتوں نے لوط علیہ السلام کو تسلی دینے کے لیے یہ بات کہی کہ ہم تمھیں پریشان کرنے کے لیے نہیں آئے، بلکہ وہ عذاب لے کر آئے ہیں جس میں یہ لوگ شک کرتے اور جھگڑتے رہے ہیں اور واقعی ہم سچ کہہ رہے ہیں۔ {’’ بِالْحَقِّ ‘‘} سے مراد عذاب ہے، جیسا کہ فرمایا : «{ مَا نُنَزِّلُ الْمَلٰٓىِٕكَةَ اِلَّا بِالْحَقِّ وَ م مَا كَانُوْۤا اِذًا مُّنْظَرِيْنَ }» [ الحجر : ۸ ] ’’ہم فرشتوں کو نہیں اتارتے مگر حق (یعنی عذاب) کے ساتھ اور اس وقت وہ مہلت دیے گئے نہیں ہوتے۔‘‘"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت65) ➊ { وَ اتَّبِعْ اَدْبَارَهُمْ:} لوط علیہ السلام کو ان کے پیچھے چلنے کا حکم اس لیے دیا کہ وہ ان کی اچھی طرح حفاظت کر سکیں، کوئی پیچھے نہ رہ جائے، سب مسلسل چلتے رہیں اور ٹھہر کر آنے والوں کا انتظار نہ کرنا پڑے۔ ہمارے نبی کریم صلی اللہ علیہ وسلم کا طریقہ بھی یہی تھا، چنانچہ جابر بن عبد اللہ رضی اللہ عنھما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سفر میں پیچھے رہتے، کمزوروں کو آگے چلاتے اور سواری پر اپنے پیچھے بٹھاتے اور ان کے لیے دعا فرماتے۔ [ أبوداوٗد، الجہاد، باب لزوم الساقۃ : ۲۶۳۹ ] ¤ ➋ { وَ لَا يَلْتَفِتْ مِنْكُمْ اَحَدٌ :} کیونکہ مڑ کر دیکھنے میں وہ تیزی باقی نہیں رہے گی جو اللہ کے عذاب کی جگہ سے بھاگنے میں ہونی چاہیے اور وطن چھوڑتے وقت حسرت سے اسے بار بار دیکھنے کے بجائے بس آگے بڑھتے جاؤ، تاکہ نہ دل کسی اور طرف متوجہ ہو اور نہ اللہ کے ذکر و شکر اور تمھاری رفتار میں کوئی کمی واقع ہو، نہ قوم کی بدترین بربادی دیکھتے ہوئے دل میں کوئی رقت پیدا ہو۔ ¤ ➌ {وَ امْضُوْا حَيْثُ تُؤْمَرُوْنَ:} وہ جگہ اللہ تعالیٰ نے ذکر نہیں فرمائی، نہ رسول اللہ صلی اللہ علیہ وسلم نے۔ تعجب ہوتا ہے کہ بعض مفسرین اس کے بغیر ہی {’’قِيْلَ‘‘} (کہا گیا ہے) کہہ کر کبھی شام، کبھی اردن اور کبھی مصر کا نام لیتے ہیں، یہ اندھیرے میں تیر پھینکنے والی بات ہے۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت66) ➊ {وَ قَضَيْنَاۤ اِلَيْهِ ذٰلِكَ الْاَمْرَ … : ’’ اِلَيْهِ ‘‘} کی و جہ سے {’’ قَضَيْنَاۤ ‘‘} کا معنی ’’ہم نے وحی کی‘‘ کیا جاتا ہے۔ {’’دَابِرَ‘‘} سب سے پیچھے رہ جانے والا، کسی چیز کا وہ حصہ جو سب کے بعد بچ گیا ہو۔ کسی درخت کو اکھاڑتے وقت آخری چیز جڑ ہوتی ہے، اسے بھی {’’ دَابِرَ ‘‘} کہہ لیتے ہیں۔ یعنی یہ سب لوگ ہلاک کر دیے جائیں گے، ان میں سے کوئی زندہ نہیں بچے گا۔ ¤ ➋ {مَقْطُوْعٌ مُّصْبِحِيْنَ : ’’أَصْبَحَ‘‘} کا معنی ہے {’’ دَخَلَ فِي الصُّبْحِ ‘‘} کہ وہ صبح کے وقت آیا۔ قوم لوط کی ہلاکت کے لیے صبح کا وقت مقرر کیا گیا تھا، جیسا کہ سورۂ ہود میں ہے : «{ اِنَّ مَوْعِدَهُمُ الصُّبْحُ اَلَيْسَ الصُّبْحُ بِقَرِيْبٍ }» [ ہود : ۸۱ ] ’’بے شک ان کے وعدے کا وقت صبح ہے، کیا صبح واقعی قریب نہیں ہے۔‘‘"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت67) ➊ {وَ جَآءَ اَهْلُ الْمَدِيْنَةِ : ’’ الْمَدِيْنَةِ ‘‘} کا ترجمہ ’’اس شہر ‘‘الف لام برائے عہد کی و جہ سے کیا ہے۔ مفسرین نے اس کا نام ’’سدوم‘‘ بتایا ہے۔ قوم لوط کا عمل کرنے والوں کو بہت سی زبانوں میں ’’سدومی‘‘ کہا جاتا ہے، اس لیے عربی یا اردو میں اس کے لیے ’’لوطی‘‘ کا جو لفظ استعمال کیا جاتا ہے وہ مناسب نہیں۔ اس میں لوط علیہ السلام کی ایک طرح سے توہین ہے۔ اہل علم فرماتے ہیں کہ بروں کے ساتھ رہنے میں بھی بدنامی ہے، خواہ کتنا نیک ہو، اب لوط علیہ السلام کے اس بدبخت قوم کے پیغمبر ہونے کے باعث کتنے برے فعل کی نسبت ان کے مبارک نام کی طرف کی جاتی ہے۔ ¤ ➋ { يَسْتَبْشِرُوْنَ: ’’ بَشَرَ ‘‘} (ض، س)، {’’ أَبْشَرَ ‘‘} اور {’’ اِسْتَبْشَرَ ‘‘} تینوں کا معنی خوش ہونا ہے، صرف حروف کے اضافے کی وجہ سے معنی میں اضافہ ہوتا جائے گا، اس لیے معنی کیا گیا ہے ’’بہت خوش ہو رہے تھے‘‘ یعنی لوط علیہ السلام کے گھر نہایت خوبصورت لڑکوں کے آنے کی خبر سن کر نہایت خوش خوش بے اختیار دوڑتے ہوئے آئے۔ (دیکھیے ہود : ۷۸) اس سے ظاہر ہے کہ وہ لوگ شرم و حیا سے خالی ہو کر کتنی پستی میں گر چکے تھے۔ واضح رہے کہ {’’ وَ جَآءَ اَهْلُ الْمَدِيْنَةِ ‘‘} میں ’’واؤ‘‘ ترتیب کے لیے نہیں، بلکہ صرف واقعہ کے مختلف حصوں کو ملانے کے لیے ہے، کیونکہ اگر پہلے وحی آ چکی ہوتی اور لوط علیہ السلام مہمانوں کو جان چکے ہوتے کہ یہ فرشتے ہیں تو انھیں پریشان ہونے کی، قوم کی منتیں کرنے کی اور اپنی یعنی قوم کی بیٹیاں پیش کرنے کی ضرورت نہ تھی۔ اس سے یہ بھی واضح ہو رہا ہے کہ انبیاء علیھم السلام غیب دان نہیں ہوتے، انھیں صرف وہی معلوم ہوتا ہے جو انھیں وحی کے ذریعے سے بتا دیا جائے۔ سورۂ ہود ( ۷۷ تا ۸۱) میں لوط علیہ السلام کی پریشانی کا نقشہ اور فرشتوں کا انھیں تسلی دینا ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت69،68) {قَالَ اِنَّ هٰۤؤُلَآءِ ضَيْفِيْ … : ’’ ضَيْفٌ ‘‘} کی تشریح کے لیے دیکھیے اس سورت کی آیت(۵۱) {’’ فَلَا تَفْضَحُوْنِ ‘‘} اور {’’ وَ لَا تُخْزُوْنِ ‘‘} دونوں {’’ فَلاَ تَفْضَحُوْنِيْ‘‘} اور {’’اَ تُخْزُوْنِيْ‘‘} تھے، آیات کے آخر کی مناسبت کے لیے یاء حذف کرکے نون وقایہ مکسور رکھا گیا، یعنی مہمان پر زیادتی اور اس کی بے عزتی درحقیقت میزبان کی ذلت و رسوائی ہوتی ہے، تو لوط علیہ السلام نے دو طریقوں سے انھیں اس فعل بد سے ہٹانے کی کوشش کی، پہلی کوشش ان کی مہمانی کا حق ذکر کرکے اور آخری کوشش {’’وَ اتَّقُوا اللّٰهَ ‘‘} کہہ کراللہ تعالیٰ سے ڈرانے کے ذریعے سے، مگر بے سود۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت69،68) {قَالَ اِنَّ هٰۤؤُلَآءِ ضَيْفِيْ … : ’’ ضَيْفٌ ‘‘} کی تشریح کے لیے دیکھیے اس سورت کی آیت(۵۱) {’’ فَلَا تَفْضَحُوْنِ ‘‘} اور {’’ وَ لَا تُخْزُوْنِ ‘‘} دونوں {’’ فَلاَ تَفْضَحُوْنِيْ‘‘} اور {’’اَ تُخْزُوْنِيْ‘‘} تھے، آیات کے آخر کی مناسبت کے لیے یاء حذف کرکے نون وقایہ مکسور رکھا گیا، یعنی مہمان پر زیادتی اور اس کی بے عزتی درحقیقت میزبان کی ذلت و رسوائی ہوتی ہے، تو لوط علیہ السلام نے دو طریقوں سے انھیں اس فعل بد سے ہٹانے کی کوشش کی، پہلی کوشش ان کی مہمانی کا حق ذکر کرکے اور آخری کوشش {’’وَ اتَّقُوا اللّٰهَ ‘‘} کہہ کراللہ تعالیٰ سے ڈرانے کے ذریعے سے، مگر بے سود۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت70) {قَالُوْۤا اَوَ لَمْ نَنْهَكَ عَنِ الْعٰلَمِيْنَ: ’’ لَمْ نَنْهَكَ ‘‘ ’’ نَهَي يَنْهٰي‘‘} سے جمع متکلم جحد معلوم ہے، {’’ نَنْهٰي‘‘} کا الف {’’لَمْ‘‘} کی و جہ سے حذف ہو گیا، کاف ضمیر مفعول بہ ہے۔ یعنی تم سارے جہان کو مہمان بنا لیا کرو گے تو کیا ہم سب ہی کو چھوڑ دیں گے، کیا ہم نے تمھیں منع نہیں کیا کہ ہمارے ہوتے اجنبی مسافروں کو مہمان نہ بنایا کرو اور ہمارے مقابلے میں کسی کی حمایت نہ کرو۔ کیسے خبیث اور مسخ شدہ فطرت والے لوگ تھے، جو اپنے شہر میں آنے والے مہمان یا گزرنے والے کو بھی نہیں چھوڑتے تھے، نہ اس میں کوئی شرم محسوس کرتے تھے۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت71) {قَالَ هٰۤؤُلَآءِ بَنٰتِيْۤ :} اس آیت کی تفسیر کے لیے دیکھیے سورۂ ہود کی آیت (۷۸) کی تفسیر۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت72) {لَعَمْرُكَ اِنَّهُمْ لَفِيْ …: ’’ عَمْرٌ ‘‘} عین کے فتحہ کے ساتھ {’’عُمْرٌ‘‘} ہی کی ایک لغت ہے، اس کا معنی دنیا میں زندگی کی مدت ہے۔ قسم کے وقت ’’عین‘‘ ہمیشہ مفتوح ہوتا ہے۔ لام ابتدا کا ہے جو قسم کے معنی میں ہے۔ {’’عَمْرٌ‘‘} مبتدا ہے اور اس کی خبر {’’قَسْمِيْ‘‘ } یا {’’يَمِيْنِيْ‘‘} ہے جو لازماً حذف ہوتی ہے، یعنی مجھے تیری عمر کی قسم۔ {’’سَكْرَةٌ‘‘} نشے میں ہونا، مدہوش ہونا۔ اکثر مفسرین کا کہنا ہے کہ اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم کی زندگی کی قسم کھائی اور آپ کی اتنی تکریم فرمائی کہ آپ کے علاوہ کسی انسان کی زندگی کی قسم نہیں کھائی۔ لوط علیہ السلام کے قصے کے درمیان یہ جملہ معترضہ ہے، جس سے ان کا گمراہی سے کسی صورت باز نہ آنا بیان کرنا مقصود ہے۔ قسم اور جوابِ قسم میں مناسبت یہ ہے کہ اے نبی! آپ کی پوری پاکیزہ زندگی اور عفت اس بات کی دلیل ہے کہ وہ لوگ جو اس کے بالکل برعکس چلنے والے تھے وہ دراصل ہوش میں نہ تھے اور اسی مدہوشی میں ایسے بھٹکے پھرتے تھے کہ ان کے لیے راہِ راست پر آنا ممکن ہی نہ تھا۔ ¤ ایک تفسیر یہ بھی ہے کہ یہ فرشتوں کا کلام ہے اور انھوں نے لوط علیہ السلام کی زندگی کی قسم کھائی ہے۔ ہماری شریعت میں اللہ تعالیٰ کے سوا کسی کی قسم کھانا منع ہے، صحیح احادیث میں اس کی ممانعت آئی ہے۔ اللہ تعالیٰ جس کی چاہے قسم کھا سکتا ہے۔ قسم کے متعلق مفصل بات ان شاء اللہ آگے کسی مقام پر ہو گی۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت73) { فَاَخَذَتْهُمُ الصَّيْحَةُ مُشْرِقِيْنَ:’’ اَشْرَقَتِ الشَّمْسُ‘‘} ’’سورج طلوع ہوا‘‘۔ اس سے پہلے آیت (۶۶) میں {’’مُصْبِحِيْنَ ‘‘} کا لفظ ہے ،یعنی صبح کے وقت۔ سورۂ قمر (۳۸) میں {’’ بُكْرَةً ‘‘} کا لفظ ہے، جس کا معنی دن کا پہلا حصہ ہے۔ بعض اہل علم نے فرمایا کہ صبح کے وقت عذاب شروع ہوا اور سورج چڑھنے تک جاری رہا۔ ایک تطبیق یہ ہو سکتی ہے کہ صبح نمودار ہونے سے لے کر سورج چڑھنے کے کچھ بعد تک سارے وقت کو عرف میں صبح کہہ لیتے ہیں اور ایک تطبیق یہ بھی ہے کہ{’’ أَشْرَقَ يُشْرِقُ‘‘} مطلقاً تاریکی میں روشنی ہونے کے معنی میں بھی آتا ہے، جو ظاہر ہے کہ صبح کے ساتھ ہی شروع ہو جاتی ہے اور سورج نکلنے کے ساتھ مکمل ہوتی ہے، جیسا کہ فرمایا : «{ وَ اَشْرَقَتِ الْاَرْضُ بِنُوْرِ رَبِّهَا }» [ الزمر : ۶۹ ] ’’ اور زمین اپنے رب کے نور کے ساتھ روشن ہو جائے گی۔‘‘ میں نے ترجمہ میں یہی معنی اختیار کیا ہے، تاکہ {’’ مُصْبِحِيْنَ ‘‘} کے ساتھ مطابقت رہے۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت74) اس آیت کی تفسیرسورۂ ہود(۸۲)میں دیکھیے۔قرآن مجید نے قوم لوط پر تین طرح کا عذاب ذکر فرمایاہے، پہلے ان پر {’’صَيْحَةٌ‘‘} (چیخ) کا عذاب آیا، پھر ان کی بستیوں کو الٹ دیاگیا اورآخرمیں ان پر پتھروں کی بارش برسائی گئی۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت75) {اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ …: ’’ لِلْمُتَوَسِّمِيْنَ ‘‘ } یہ {’’ وَسْمٌ، سِمَةٌ ‘‘} سے باب تفعل کا اسم فاعل ہے۔ {’’ وَسْمٌ‘‘} کامعنی نشان ہے، خصوصاً جوگرم لوہے کے ساتھ اونٹ یا گھوڑے پر لگایا جاتا ہے۔ {’’مِيْسَمٌ‘‘} گرم کرکے نشان لگانے کا آلہ۔ نشانات کو دیکھ کر بات کی تہ تک پہنچنا {’’تَوَسُّمٌ‘‘} کہلاتاہے، یعنی غور و فکر کرنے والوں اورگہری نظر والوں کے لیے ان بستیوں میں عبرت کے بہت سے نشان موجودہیں۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت76) {وَ اِنَّهَا لَبِسَبِيْلٍ مُّقِيْمٍ : ’’ مُقِيْمٍ ‘‘} ’’ہمیشہ رہنے والا، دائمی‘‘ یعنی جو قافلے حجاز سے شام یا عراق سے مصر جاتے ہیں یہ بستی ان کے راستے میں پڑتی ہے، مگر لوگ ہیں کہ اس میں تباہی کے آثار دیکھ کر کوئی عبرت حاصل نہیں کرتے، جیسا کہ فرمایا : «{ وَ اِنَّكُمْ لَتَمُرُّوْنَ عَلَيْهِمْ مُّصْبِحِيْنَ (137) وَ بِالَّيْلِ اَفَلَا تَعْقِلُوْنَ } » [ الصافات : ۱۳۷، ۱۳۸ ] ’’اور بلاشبہ تم یقینا صبح جاتے ہوئے ان پر سے گزرتے ہو اور رات کو بھی، تو کیا تم سمجھتے نہیں؟‘‘ جدید محققین کا خیال ہے کہ یہ بستی بحرمیت (جسے بحر لوط یا اردو میں بحر مردار بھی کہتے ہیں) کے جنوب مشرق میں واقع تھی، بلکہ اس زمانہ میں اردن کی حکومت بحرمیت کے جنوبی حصہ سے اس کے تباہ شدہ آثار برآمد کرنے کی کوشش بھی کر رہی ہے۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت77) { اِنَّ فِيْ ذٰلِكَ لَاٰيَةً لِّلْمُؤْمِنِيْنَ :} یعنی ابراہیم اور لوط علیھما السلام کے قصے میں ایمان والوں کے لیے اللہ تعالیٰ کی مغفرت و رحمت اور عذاب الیم کی بہت بڑی نشانی ہے۔ {’’ لَاٰيَةً ‘‘} میں تنوین تعظیم کے لیے ہے، یہاں {’’ لَاٰيَةً ‘‘} واحد اس لیے ذکر فرمایا کہ ایمان والوں کے یقین کے لیے یہ ایک نشانی ہی کافی ہے۔ ظاہر ہے کہ اس میں مومنوں کی تعریف بھی ہے۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت78) ➊ {وَ اِنْ كَانَ اَصْحٰبُ الْاَيْكَةِ … :} یہ {’’ اِنْ ‘‘} اصل میں {’’إِنَّ ‘‘} تھا، اس کا اسم ضمیر شان {’’هٗ‘‘} محذوف ہے، اس کی دلیل اور سبب وہ لام ہے جو{ ’’ظَالِمِيْنَ‘‘} پر آیا ہے، جو {’’ كَانَ ‘‘} کی خبر ہے۔ {’’اَلْأَيْكُ‘‘} اسم جنس ہے، درختوں کے جھنڈ، زیادہ ہوں یا ایک، جیسے {’’ تَمْرٌ ‘‘} اسم جنس ہے۔ تاء وحدۃ کے اظہار کے لیے ہے، اس لیے {’’ الْاَيْكَةِ ‘‘} کا معنی ہے ایک جھنڈ، جیسے {’’تَمَرْةٌ‘‘} ایک کھجور۔ ¤ ➋ بہت سے علماء کا کہنا ہے کہ اصحاب مدین اور اصحاب الایکہ ایک ہی قبیلہ تھا اور کئی مفسرین انھیں الگ الگ قوم شمار فرماتے ہیں۔ ان کا ظلم یہ تھا کہ وہ شرک میں گرفتار تھے، ناپ تول میں کمی بیشی کرتے تھے، راہ چلتے مسافروں کو لوٹ لیتے تھے۔ ان دونوں کی طرف شعیب علیہ السلام کو بھیجا گیا، تا کہ وہ ظلم کی ان تمام صورتوں سے باز آ جائیں۔ مدین والوں کی تفصیل سورۂ ہود (۸۴ تا ۹۵) میں ہے اور اصحاب الایکہ کی تفصیل سورۂ شعراء ( ۱۷۶ تا ۱۹۱) میں ہے۔ بعض کے مطابق اصحاب مدین اسی قوم کے شہری لوگ تھے اور اصحاب الایکہ انھی کے باہر جنگل میں رہنے والے لوگ تھے۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت79) {وَ اِنَّهُمَا لَبِاِمَامٍ مُّبِيْنٍ : ’’اِمَامٌ‘‘} کے کئی معنی ہیں، یہاں مراد واضح راستہ ہے، جس طرح امام کے پیچھے چلا جاتا ہے، اسی طرح صاف واضح راستے پر چل کر مسافر منزل پر پہنچ جاتا ہے۔ (طنطاوی) وہ دونوں سے مراد قوم لوط اور اصحاب الایکہ کی بستیاں ہیں کہ وہ ایک ہی راستے پر قریب قریب واقع ہیں۔ مدین اور ایکہ بھی مراد ہو سکتے ہیں۔ (قرطبی)"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت80) ➊ {وَ لَقَدْ كَذَّبَ اَصْحٰبُ الْحِجْرِ الْمُرْسَلِيْنَ : ’’ الْحِجْرِ ‘‘} اصل میں اس جگہ کو کہتے ہیں جسے پتھروں سے گھیرا گیا ہو، جیسا کہ حطیم کو بھی حجر کہہ لیتے ہیں۔{ ’’حَجَرَ يَحْجُرُ‘‘} کا معنی روکنا بھی ہے، تو {’’ الْحِجْرِ ‘‘} وہ جگہ جہاں عام لوگوں کا آنا جانا ممنوع ہو۔ یہ اس سورت میں چوتھا قصہ ہے۔ {’’ الْحِجْرِ ‘‘} شام اور مدینہ منورہ کے درمیان ایک مقام ہے، جو صالح علیہ السلام کی قوم ثمود کے لوگوں کا مرکز تھا، یہ جگہ خیبر سے تبوک جانے والی سڑک پر واقع ہے اور اب ’’مدائن صالح‘‘ کے نام سے مشہور ہے۔ یہ علاقہ{ ’’العُلاء‘‘} سے چند میل کے فاصلے پر واقع ہے۔ حجاز سے شام کو جو قافلے جاتے ہیں وہ لازماً یہاں سے گزر کر جاتے ہیں اور یہ اس ریلوے لائن کا ایک سٹیشن بھی ہے جو ترکوں کے زمانہ میں مدینہ سے دمشق کو جاتی تھی۔ اس قوم کے مفصل حالات سورۂ ہود (۶۵ تا ۶۸)، سورۂ اعراف، سورۂ قمر اور سورۂ شعراء میں ملاحظہ فرمائیں۔ ¤ ➋ {الْمُرْسَلِيْنَ :} ایک رسول کو جھٹلانا چونکہ سب کو جھٹلانا ہے، اس لیے ان کے بارے میں فرمایا گیا کہ انھوں نے رسولوں کو جھٹلا دیا۔ (روح المعانی)"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت81) ➊ {وَ اٰتَيْنٰهُمْ اٰيٰتِنَا : ’’ اٰيٰتِنَا ‘‘ } ہماری نشانیاں، ان نشانیوں میں اونٹنی کا معجزہ ہی کئی معجزوں پر مشتمل تھا۔ پیغمبر پر نازل شدہ آیات بھی اور ان کی وادی میں زراعت کا عمدہ انتظام اور پہاڑ تراش کر مکان بنانے کا سلیقہ جن کا ذکر سورۂ شعراء میں ہے، سب شامل ہیں۔ وہ عقلی دلائل بھی ان نشانیوں میں شامل ہیں جو توحید کی طرف رہنمائی کا کام دیتے ہیں۔ ¤ ➋ { فَكَانُوْا عَنْهَا مُعْرِضِيْنَ :} یعنی انھوں نے کوئی عبرت حاصل نہ کی، بلکہ اونٹنی کی کونچیں کاٹ ڈالیں اور صالح علیہ السلام کو چیلنج دیا کہ جس عذاب کی دھمکی دے رہے ہو لے آؤ۔"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت82تا84){وَ كَانُوْا يَنْحِتُوْنَ مِنَ الْجِبَالِ بُيُوْتًا اٰمِنِيْنَ … :} یعنی اس سے پہلی قوم عاد آندھی سے برباد ہوئی تھی تو انھوں نے اپنے خیال میں پہاڑوں کو تراش کر محفوظ مکان بنا لیے، جن میں کوئی خوف و خطرہ نہ تھا، مگر صبح کے وقت ایسی چیخ آئی کہ سب کے کلیجے پھٹ گئے اور ایک حد سے بڑھی ہوئی خوفناک آواز ({اَلطَّاغِيَةُ}) کے ساتھ پیدا ہونے والے زلزلے نے باقی کسر نکال دی، پھر ان کی تعمیراتی اور زرعی ترقی اور مہارت ان کے کسی کام نہ آئی۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت82تا84){وَ كَانُوْا يَنْحِتُوْنَ مِنَ الْجِبَالِ بُيُوْتًا اٰمِنِيْنَ … :} یعنی اس سے پہلی قوم عاد آندھی سے برباد ہوئی تھی تو انھوں نے اپنے خیال میں پہاڑوں کو تراش کر محفوظ مکان بنا لیے، جن میں کوئی خوف و خطرہ نہ تھا، مگر صبح کے وقت ایسی چیخ آئی کہ سب کے کلیجے پھٹ گئے اور ایک حد سے بڑھی ہوئی خوفناک آواز ({اَلطَّاغِيَةُ}) کے ساتھ پیدا ہونے والے زلزلے نے باقی کسر نکال دی، پھر ان کی تعمیراتی اور زرعی ترقی اور مہارت ان کے کسی کام نہ آئی۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت82تا84){وَ كَانُوْا يَنْحِتُوْنَ مِنَ الْجِبَالِ بُيُوْتًا اٰمِنِيْنَ … :} یعنی اس سے پہلی قوم عاد آندھی سے برباد ہوئی تھی تو انھوں نے اپنے خیال میں پہاڑوں کو تراش کر محفوظ مکان بنا لیے، جن میں کوئی خوف و خطرہ نہ تھا، مگر صبح کے وقت ایسی چیخ آئی کہ سب کے کلیجے پھٹ گئے اور ایک حد سے بڑھی ہوئی خوفناک آواز ({اَلطَّاغِيَةُ}) کے ساتھ پیدا ہونے والے زلزلے نے باقی کسر نکال دی، پھر ان کی تعمیراتی اور زرعی ترقی اور مہارت ان کے کسی کام نہ آئی۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت85) {وَ مَا خَلَقْنَا السَّمٰوٰتِ وَ الْاَرْضَ …: ’’ بِالْحَقِّ ‘‘} کا معنی صحیح، با مقصد کام جو ہو کر رہنے والا ہو، جو بے کار، بے مقصد نہ ہو اور جسے کوئی روک نہ سکے۔ اس کے بالمقابل باطل ہے، فرمایا : «{ بَلْ نَقْذِفُ بِالْحَقِّ عَلَى الْبَاطِلِ }» [ الأنبیاء : ۱۸] ’’بلکہ ہم حق کو باطل پر پھینک مارتے ہیں۔‘‘ چار انبیاء کے واقعات کے بعد اب اللہ تعالیٰ کی عظیم مخلوق آسمان و زمین اور ان کے درمیان بے شمار مخلوقات کی طرف توجہ دلائی، جن میں سے ہر ایک اللہ تعالیٰ کی وحدانیت اور عظمت و قدرت پر دلالت کرتی ہے۔ فرمایا کہ یہ سب ہم نے بے مقصد پیدا نہیں کیا، بلکہ یہ سب کچھ تمھاری ضروریات کے لیے ہے اور ان میں سے ہر چیز کے لیے اللہ کا حکم ماننا ہر حال میں لازم ہے، کسی کو اختیار ہی نہیں کہ وہ سرتابی کر سکے۔ صرف انسانوں اور جنوں کو آزمائش کے لیے کچھ اختیار دیا ہے، اگر اس کا صحیح استعمال کریں گے تو دنیا و آخرت میں اللہ کے انعامات کے مستحق ہوں گے، جیسے ابراہیم علیہ السلام کا واقعہ ذکر ہوا ہے، غلط استعمال کریں گے تو یا تو دنیا ہی میں اللہ کی گرفت میں آ جائیں گے، جیسے لوط، شعیب اور صالح علیھم السلام کی قومیں اللہ کے عذاب کی گرفت میں آئیں۔ اس کے بعد یقینا قیامت آنے والی ہے، اس میں نیکوں کو ان کی نیکی کا پورا بدلہ دیا جائے گا، اگر دنیا میں بدلہ نہیں ملا تو وہاں کسر نکال دی جائے گی، اسی طرح بروں کو ان کی بدی کا پورا بدلہ ملے گا اور اگر دنیا میں انھیں مہلت ملی رہی تو وہاں کسر پوری کر دی جائے گی۔ اس لیے آپ اور آپ کے ساتھی ان کفار کی زیادتی پر صبر کریں اور ان کی زبان درازی سے درگزر فرمائیں (دیکھیے آل عمران : ۱۸۶) اور درگزر بھی خوبصورت طریقے سے، تاکہ قطع تعلق سے دعوت کا راستہ بند نہ ہو جائے۔ یہ سارا بیان نبی صلی اللہ علیہ وسلم کی تسلی کے لیے ہے۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت86) {اِنَّ رَبَّكَ هُوَ الْخَلّٰقُ الْعَلِيْمُ:} تو پھر اس کے لیے انھیں دوبارہ زندہ کرنا کیا مشکل ہے؟ [ديكهيے سورهٔ يٰس: ۸۱]"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت87) ➊ {وَ لَقَدْ اٰتَيْنٰكَ سَبْعًا مِّنَ الْمَثَانِيْ:’’ الْمَثَانِيْ ‘‘ ’’ ثَنٰي يَثْنِيْ ‘‘} (ض) کے اسم مفعول{ ’’مَثْنِيَّةٌ‘‘} (بروزن {مَضْرُوْبَةٌ، مَرْمِيَّةٌ} ) کی جمع ہے، معنی دوہرا کرنا، دوہرانا ہے، یعنی بار بار دہرائی جانے والی۔ ¤ ➋ کافروں کی زیادتی سے درگزر کی تلقین کے ساتھ اپنی ایک عظیم نعمت سبع مثانی اور قرآن عظیم یاد دلائی، تاکہ اتنی بڑی دولت کا مالک ہونے کے احساس سے کفار سے درگزر میں آسانی رہے۔ ¤ ➌ {سَبْعًا مِّنَ الْمَثَانِيْ:} ’’لام‘‘ اور {’’قَدْ‘‘ } کی تاکید کے ساتھ فرمایا کہ ہم نے آپ کو سات بار بار دہرائی جانے والی عطا فرمائیں۔ یہ آیت اس بات کی بھی بڑی واضح دلیل ہے کہ قرآن کے ساتھ حدیث پر بھی ایمان اور عمل واجب ہے، اس کے بغیر قرآن نہ صحیح سمجھا جا سکتا ہے نہ اس پر عمل ہو سکتا ہے۔ دیکھیے اللہ تعالیٰ نے قرآن میں کہیں نہیں بتایا کہ وہ سبع مثانی سات سورتیں ہیں یا سات آیتیں، نہ یہ بتایا کہ وہ سورتیں ہیں تو کون سی اور آیتیں ہیں تو کون سی؟ بلکہ ایک جگہ سارے قرآن ہی کو مثانی فرما دیا، فرمایا : «{ اَللّٰهُ نَزَّلَ اَحْسَنَ الْحَدِيْثِ كِتٰبًا مُّتَشَابِهًا مَّثَانِيَ }» [ الزمر : ۲۳ ] ’’اللہ نے سب سے اچھی بات نازل فرمائی، وہ کتاب جو ایک دوسرے سے ملتی جلتی اور بار بار دہرائی جانے والی ہے۔‘‘ اب لازم ہے کہ پورے قرآن میں سے جو سارا ہی مثانی ہے، یہ متعین کیا جائے کہ ان سبع مثانی سے مراد کیا ہے۔ اپنے پاس سے متعین کریں تو کبھی اتفاق نہیں ہو سکتا، اس لیے کسی مفسر نے سات سورتیں بتائیں، کسی نے سات آیتیں، تو کسی نے کچھ اور بتایا۔ یہاں رسول اللہ صلی اللہ علیہ وسلم کی وضاحت کے بغیر قرآن کی اس آیت کا مفہوم متعین کرنا ممکن ہی نہیں، چنانچہ ابوسعید بن معلی رضی اللہ عنہ فرماتے ہیں : [ كُنْتُ أُصَلِّيْ فَمَرَّبِيْ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَدَعَانِيْ، فَلَمْ آتِهِ حَتّٰی صَلَّيْتُ، ثُمَّ أَتَيْتُهُ، فَقَالَ مَا مَنَعَكَ أَنْ تَأْتِيَ؟ أَلَمْ يَقُلِ اللّٰهُ : «{ اسْتَجِيْبُوْا لِلّٰهِ وَ لِلرَّسُوْلِ اِذَا دَعَاكُمْ }» [الأنفال : ۲۴] ؟ ثُمَّ قَالَ لِيْ لَأُعَلِّمَنَّكَ سُوْرَةً هِيَ أَعْظَمُ السُّوَرِ فِي الْقُرْآنِ قَبْلَ أَنْ تَخْرُجَ مِنَ الْمَسْجِدِ ثُمَّ أَخَذَ بِيَدِيْ فَلَمَّا أَرَادَ أَنْ يّيَّخْرُجَ قُلْتُ لَهٗ أَلَمْ تَقُلْ لَأُعَلِّمَنَّكَ سُوْرَةً هِيَ أأَعْظَمُ سُوْرَةٍ فِي الْقُرْآنِ ؟ قَالَ : «{ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ }» هِيَ السّبْعُ الْمَثانِيْ وَالقُرْآنُ الْعَظِيْمُ الَّذِيْ أُوْتِيْتُهُ ] [ بخاری، التفسیر، باب ما جاء في فاتحۃ الکتاب : ۴۴۷۴، ۴۶۴۷ ] ’’نبی صلی اللہ علیہ وسلم میرے پاس سے گزرے اور میں نماز پڑھ رہا تھا، تو آپ نے مجھے بلایا، میں آپ کے پاس نہیں آیا، یہاں تک کہ میں نے نماز پڑھ لی، پھر میں آیا تو آپ نے فرمایا : ’’تمھیں میرے پاس آنے سے کس چیز نے روکے رکھا؟‘‘ کیا اللہ تعالیٰ نے نہیں فرمایا : «{ اسْتَجِيْبُوْا لِلّٰهِ وَ لِلرَّسُوْلِ اِذَا دَعَاكُمْ }» [ الأنفال : ۲۴ ] اللہ کی اور رسول کی دعوت قبول کرو جب وہ تمھیں بلائیں۔‘‘ پھر مجھے فرمایا : ’’میں تمھارے مسجد سے نکلنے سے پہلے ضرور تمھیں ایک سورت سکھاؤں گا جو قرآن کی تمام سورتوں سے بڑی (اعظم) ہے۔‘‘ پھر آپ نے میرا ہاتھ پکڑ لیا، جب آپ نے نکلنے کا ارادہ کیا تو میں نے آپ سے کہا : ’’کیا آپ نے فرمایا نہیں تھا کہ میں تمھیں ایک سورت سکھاؤں گا جو قرآن کی تمام سورتوں سے بڑی ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : «{ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ }» یہی سبع مثانی اور قرآن عظیم ہے جو مجھے عطا کیا گیا ہے۔‘‘ اس سے معلوم ہوا کہ سبع مثانی سے سورۂ فاتحہ کی سات آیتیں مراد ہیں، کیونکہ وہ ہر نماز کی ہر رکعت میں بار بار پڑھی جاتی ہیں۔ دوسری تفسیریں مثلاً یہ کہ سات لمبی سورتیں مراد ہیں وغیرہ نبی کریم صلی اللہ علیہ وسلم کی صراحت کے بعد کچھ حیثیت نہیں رکھتیں۔ اس لیے بھی کہ لمبی سات سورتوں کی اکثریت تو اتری ہی مدینہ میں ہے، جب کہ یہ آیت مکی ہے۔ ¤ ➍ {وَ الْقُرْاٰنَ الْعَظِيْمَ : } بہت سے مفسرین نے سبع مثانی سے مراد فاتحہ اور قرآن عظیم سے مراد باقی قرآن لیا ہے، حالانکہ یہ بات درست نہیں، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے اس آیت میں مذکور سبع مثانی بھی اور القرآن العظیم بھی سورۂ فاتحہ ہی کو کہا ہے۔ بخاری میں اس آیت کی تفسیر میں آپ کے الفاظ ہیں : [ اُمُّ الْقُرْآنِ هِيَ السَّبْعُ الْمَثَانِيْ وَالْقُرْآنُ الْعَظِيْمُ ] [ بخاري، التفسیر، باب قولہ : « و لقد اٰتینک سبعا من المثانی…» : ۴۷۰۴ ] ’’ام القرآن ہی سبع مثانی اور قرآن عظیم ہے۔‘‘ کیونکہ قرآن ہونے کے لیے پورا قرآن ہونا ضروری نہیں، ایک آیت ہو تو وہ بھی قرآن ہے۔ آپ کا مطلب یہ ہے کہ سورۂ فاتحہ جب قرآن کی سب سے بڑی سورت ہے تو قرآن عظیم (بہت بڑا قرآن) یہی ہے۔ رہی ’’واؤ‘‘ تو وہ ایک ہی چیز کی دو مختلف صفات کے درمیان آ جاتی ہے، جیسا کہ فرمایا : «{ سَبِّحِ اسْمَ رَبِّكَ الْاَعْلَى (1) الَّذِيْ خَلَقَ فَسَوّٰى (2) وَ الَّذِيْ قَدَّرَ فَهَدٰى (3) وَ الَّذِيْۤ اَخْرَجَ الْمَرْعٰى }» [ الأعلٰی : ۱ تا ۴ ] ’’اپنے رب کے نام کی تسبیح کر جو سب سے بلند ہے، وہ جس نے پیدا کیا، پس درست بنایا اور وہ جس نے اندازہ ٹھہرایا، پھر ہدایت کی اور وہ جس نے چارا اگایا۔‘‘ اور اس لحاظ سے بھی فاتحہ کو {’’ وَ الْقُرْاٰنَ الْعَظِيْمَ ‘‘ } فرمایا کہ قرآن مجید کے تمام مضامین اس میں اجمالی طور پر موجود ہیں۔ ¤ ایک دفعہ گوجرانوالہ میں ایک منکر حدیث نے بہت اودھم مچایا اور بہت سے لوگوں کے عقیدے خراب کیے، مولانا محمد عبد اللہ رحمہ اللہ (دال بازار والے) کی اس سے گفتگو ہوئی تو مولانا نے سورۂ توبہ کی آیت پڑھی : «{ اِنَّ عِدَّةَ الشُّهُوْرِ عِنْدَ اللّٰهِ اثْنَا عَشَرَ شَهْرًا فِيْ كِتٰبِ اللّٰهِ يَوْمَ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ مِنْهَاۤ اَرْبَعَةٌ حُرُمٌ }» [ التوبۃ : ۳۶ ] ’’بے شک مہینوں کی گنتی، اللہ کے نزدیک، اللہ کی کتاب میں بارہ مہینے ہے، جس دن اس نے آسمانوں اور زمین کو پیدا کیا، ان میں سے چار حرمت والے ہیں‘‘ اور فرمایا کہ جب حدیث کی ضرورت نہیں تو آپ قرآن سے بتائیں کہ حرمت والے وہ چار ماہ کون سے ہیں؟ اسے بالکل کوئی جواب نہ آیا اور حق بات بہت سے لوگوں کی سمجھ میں آ گئی۔"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت88) ➊ {لَا تَمُدَّنَّ عَيْنَيْكَ اِلٰى مَا مَتَّعْنَا بِهٖۤ اَزْوَاجًا مِّنْهُمْ:’’ مَتَّعْنَا ‘‘} متاع معمولی اور عارضی سازو سامان۔ {’’اَزْوَاجًا ‘‘} زوج ایک قسم، مثلاً نر اور مادہ میں سے ہر ایک ایک زوج ہے، دونوں ہوں تو {’’ زَوْجَانِ ‘‘} (ایک جوڑا) ہے۔ ان ازواج کی بہت سی قسمیں ہیں، مثلاً سرمایہ دار، حاکم، فوجی، زمیندار، کارخانے دار، مذہبی پیشوا وغیرہم، یعنی سبع مثانی اور قرآن عظیم کی دولت رکھتے ہوئے آپ کفار کے مختلف قسم کی دنیاوی نعمتیں رکھنے والوں کی طرف ہرگز نظر اٹھا کر بھی نہ دیکھیے، خصوصاً جب وہ نعمتیں ان کے لیے فتنہ و عذاب ہیں۔ دیکھیے سورۂ توبہ (۵۵) اور سورۂ طٰہٰ ( ۱۳۰ تا ۱۳۲) کی تفسیر۔ ¤ ➋ {وَ لَا تَحْزَنْ عَلَيْهِمْ :} ان کے بڑے بڑے سردار اور کفر کے ٹھیکیدار اور ان کے پیروکار اگر ایمان نہیں لاتے تو آپ ان کے ایمان نہ لانے اور جہنم میں جانے پر غمگین نہ ہوں، آپ نے بات پہنچا کر حق ادا کر دیا تو غم کی کیا ضرورت ہے۔ ¤ ➌ {وَ اخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِيْنَ۠ : ’’ جَنَاحٌ‘‘} بازو، پر، پہلو۔ یہ دراصل ایک استعارہ ہے کہ پرندہ جس طرح اپنے بچوں کو اپنے پروں کے نیچے لے کر سمیٹ لیتا ہے اور انھیں سرد و گرم سے محفوظ رکھنے کی کوشش کرتا ہے، اسی طرح آپ بھی اہل ایمان کے لیے اپنا بازو یا پہلو جھکا دیں، مراد ان کے لیے نرمی، شفقت، محبت اور حفاظت ہے۔ یہی صفت اصحاب رسول صلی اللہ علیہ وسلم کی تھی، فرمایا : «{ اَشِدَّآءُ عَلَى الْكُفَّارِ رُحَمَآءُ بَیْنَھُمْ}» [ الفتح : ۲۹ ] ’’کافروں پربہت سخت ہیں، آپس میں نہایت رحم دل ہیں۔‘‘"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت89) {وَ قُلْ اِنِّيْۤ اَنَا النَّذِيْرُ الْمُبِيْنُ :} یہاں صرف ڈرانے کا ذکر ہے، خوش خبری کا نہیں، اس لیے کہ بات منکروں کے متعلق ہو رہی ہے۔{ ’’ النَّذِيْرُ الْمُبِيْنُ ‘‘} (کھلم کھلا ڈرانے والا) کی تفسیر میں وہ حدیث عین حسب حال ہے جو ابو موسیٰ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان فرمائی: [ إِنَّمَا مَثَلِيْ وَمَثَلُ مَا بَعَثثَنِيَ اللّٰهُ بِهِ كَمَثَلِ رَجُلٍ أَتَي قَوْمًا فَقَالَ يَا قَوْمِ ! إِنِّيْ رَأَيْتُ الْجَيْشَ بِعَيْنَيَّ، وَإِنِّيْ أَنَا النَّذِيْرُ الْعُرْيَانُ، فَالنَّجَاءَ، فَأَطَاعَهُ طَائِفَةٌ مِنْ قَوْمِهِ فَأَدْلَجُوْا فَانْطَلَقُوْا عَلٰي مَهْلِهِمْ فَنَجَوْا، وَ كَذَّبَتْ طَائِفَةٌ مِنْهُمْ فَأَصْبَحُوْا مَكَانَهُمْ، فَصَبَّحَهُمُ الْجَيْشُ فَأَهْلَكَهُمْ وَاجْتَاحَهُمْ، فَذٰلِكَ مَثَلُ مَنْ أَطَاعَنِيْ فَاتاتَّبَعَ مَا جِئْتُ بِهِ، وَمَثَلُ مَنْ عَصَانِيْ وَكَذَّبَ بِمَا جِئْتُ بِهِ مِنَ الْحَقِّ ] [ بخاري، الاعتصام بالکتاب و السنۃ، باب الاقتداء بسنن رسول اللہ صلی اللہ علیہ وسلم : ۷۲۸۳ ] ’’میری مثال اور اللہ نے جو کچھ دے کر مجھے بھیجا اس کی مثال اس آدمی کی مثال جیسی ہے جو اپنی قوم کے پاس آیا اور کہنے لگا : ’’اے میری قوم! میں نے اپنی آنکھوں سے لشکر دیکھا ہے اور میں ننگا ڈرانے والا ہوں (پہلے زمانے میں لوگ دشمن سے ڈرانے کے لیے چیخنے چلانے کے ساتھ کپڑے بھی اتار دیتے تھے، ان سے تشبیہ دی ہے) سو تم بچ جاؤ، بچ جاؤ، اس کی قوم میں سے ایک گروہ نے اس کا کہنا مان لیا، وہ راے کے پہلے حصے ہی میں چل پڑے اور آرام سے چلتے ہوئے بچ نکلے اور ایک گروہ نے اسے جھٹلا دیا اور صبح تک اسی جگہ رہے۔ صبح کے وقت لشکر نے ان پر حملہ کیا اور انھیں ہلاک اور نیست و نابود کر دیا، سو یہ مثال ہے اس شخص کی جس نے میری اطاعت کی اور جو کچھ میں لے کر آیا ہوں اس کی پیروی کی اور اس کی (مثال) جس نے میری نافرمانی کی اور اس حق کو جھٹلا دیا جو لے کر میں آیا ہوں۔‘‘"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت91،90) ➊ {كَمَاۤ اَنْزَلْنَا عَلَى الْمُقْتَسِمِيْنَ … : ’’ الْمُقْتَسِمِيْنَ ‘‘} یہ {’’قَسْمٌ‘‘} سے باب افتعال کا اسم فاعل ہے، ’’تقسیم کرنے والے۔‘‘ قرطبی نے فرمایا : {’’ عِضِيْنَ ‘‘ ’’عِضَةٌ‘‘} کی جمع ہے، جس کا معنی کسی چیز کا جز یا ٹکڑا ہے۔ {’’عَضَا يَعْضُوْ عَضْوًا الشَّيْءَ‘‘ } اور {’’عَضّٰي يُعَضِّي الشَّيْءَ‘‘} ’’ کسی چیز کو ٹکڑے ٹکڑے کرنا۔‘‘ ہر ٹکڑا {’’عِضَةٌ‘‘ } کہلاتا ہے، اس کے آخر سے واؤ حذف کرکے تاء لائی گئی ہے۔ {’’ الْقُرْاٰنَ ‘‘} قرآن مجید کا نام ہے، پہلے انبیاء کی کتابوں کو بھی ’’قرآن‘‘ کہہ لیتے ہیں، کیونکہ وہ بھی پڑھی جاتی تھیں، گویا کتاب اور قرآن کا لفظ سب کے لیے ہے۔ ہمارے قرآن کے لیے عموماً {’’هٰذَا الْقُرْآنُ‘‘ } یا{ ’’ذٰلِكَ الْكِتَابُ‘‘} وغیرہ کا اشارہ ساتھ موجود ہوتا ہے۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ خُفِّفَ عَلٰی دَاوٗدَ عَلَيْهِ السَّلَامُ الْقُرْآنُ فَكَانَ يَأْمُرُ بِدَوَابِّهِ فَتُسْرَجُ فَيَقْرَأُ الْقُرْآنَ قَبْلَ أَنْ تُسْرَجَ دَوَابُّهُ ] [ بخاری، أحادیث الأنبیاء، باب قول اللہ تعالٰی : «و آتینا داود زبورا » : ۳۴۱۷ ] ’’داؤد علیہ السلام پر قرآن (پڑھنا) بہت ہلکا کر دیا گیا تھا، چنانچہ وہ اپنی سواریوں کے متعلق حکم دیتے تو ان پر زین ڈالی جاتی اور آپ سواریوں پر زین ڈالے جانے سے پہلے قرآن پڑھ لیتے تھے۔‘‘ ¤ ➋ ان آیات کی مختلف تفسیریں کی گئی ہیں، ان میں سے ایک وہ ہے جو امام المفسرین طبری رحمہ اللہ نے پسند فرمائی ہے۔ یہاں سمجھنے کی بات یہ ہے کہ {’’ كَمَاۤ اَنْزَلْنَا عَلَى الْمُقْتَسِمِيْنَ ‘‘} (جیسا ہم نے ان تقسیم کرنے والوں پر اتارا) کا تعلق پچھلی کس آیت اور کس لفظ کے ساتھ ہے اور اس مشبہ بہ کا مشبہ کیا ہے اور {’’ اَنْزَلْنَا ‘‘} (ہم نے اتارا) سے کیا چیز اتارنا مراد ہے؟ جواب اس کا یہ ہے کہ{’’ اَنْزَلْنَا ‘‘} کا مفعول محذوف ہے{ ’’اَلْعَذَابَ‘‘ } یعنی ہم نے عذاب اتارا اور {’’ كَمَاۤ اَنْزَلْنَا ‘‘} کا تعلق اس سے پہلی آیت : «{ وَ قُلْ اِنِّيْۤ اَنَا النَّذِيْرُ الْمُبِيْنُ }» کے ساتھ ہے اور معنی یہ ہے، اے نبی! کہہ دے کہ بے شک میں تو تمھیں کھلم کھلا ڈرانے والا ہوں، اس قسم کے عذاب سے جیسا ہم نے ان تقسیم کرنے والوں پر نازل کیا تھا جنھوں نے (اپنی) کتاب کو ٹکڑے ٹکڑے کر دیا تھا۔ یعنی اس کے بعض حصوں کو مان لیا اور بعض کو نہ مانا۔ سورۂ بقرہ میں اللہ تعالیٰ نے ان کے اس طرح کے بعض کاموں کا ذکر کرکے فرمایا : «{ اَفَتُؤْمِنُوْنَ بِبَعْضِ الْكِتٰبِ وَ تَكْفُرُوْنَ بِبَعْضٍ }» [ البقرۃ : ۸۵ ] ’’ پھر کیا تم کتاب کے بعض پر ایمان لاتے ہو اور بعض کے ساتھ کفر کرتے ہو؟‘‘ اور اس کی جزا دنیا کی رسوائی اور آخرت میں سخت ترین عذاب بیان فرمائی۔ اب یہاں آپ کے زمانے کے اسرائیلیوں کو اس قسم کے عذاب سے ڈرایا جا رہا ہے جو ان سے پہلوں پر آیا تھا، کیونکہ وہ بھی تورات کے بعض حصوں کا صاف انکار کرتے تھے، مثلاً نبی کریم صلی اللہ علیہ وسلم پر ایمان لانے کی تاکید والی آیات۔ اور قریش کو بھی کہ کتاب اللہ کے بعض حصوں کو جھٹلانے والوں پر جس طرح عذاب آیا میں تمھیں بھی ویسے ہی عذاب سے کھلم کھلا ڈرانے والا ہوں، کیونکہ تم نے بھی جھٹلانے کی روش اختیار کر رکھی ہے اور تم قرآن کے بعض حصوں کو ماننے کے لیے بالکل تیار نہیں ہو، چنانچہ تم بھی بتوں کی مذمت کی آیات نکال دینے پر ایمان لانے کی پیش کش کرتے ہو، فرمایا : «{ وَدُّوْا لَوْ تُدْهِنُ فَيُدْهِنُوْنَ }» [ القلم : ۹ ] ’’وہ چاہتے ہیں کاش! تو نرمی کرے تو وہ بھی نرمی کریں۔‘‘ اسی طرح ان کا یہ مطالبہ بھی ذکر فرمایا کہ اس قرآن کے علاوہ اور قرآن لے آؤ، یا اس میں تبدیلی کر دو۔ (دیکھیے یونس : ۱۵) دوسری تفسیر یہ ہے کہ {’’ كَمَاۤ اَنْزَلْنَا ‘‘} کا تعلق آیت (۸۷) « { وَ لَقَدْ اٰتَيْنٰكَ سَبْعًا مِّنَ الْمَثَاننِيْ وَ الْقُرْاٰنَ الْعَظِيْمَ }» سے ہے اور {’’ اَنْزَلْنَا ‘‘} کا مفعول محذوف {’’اَلْكِتَابَ‘‘ } ہے اور مطلب یہ ہے کہ ہم نے آپ کو سبع مثانی اور قرآن عظیم عطا فرمائے، جیسے ان لوگوں پر کتاب نازل کی تھی جنھوں نے اپنی کتاب کو ٹکڑے ٹکڑے کر دیا، کسی حصے کو مان لیا کسی کو نہ مانا، جب ہم ان پر کتاب نازل کر سکتے ہیں تو آپ پر، جن کی پاکیزہ زندگی کے یہ لوگ چالیس سالہ گواہ ہیں، ہم سبع مثانی اور قرآن عظیم کیوں نازل نہیں کر سکتے! یہ تفسیر بھی اچھی ہے۔"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت91،90) ➊ {كَمَاۤ اَنْزَلْنَا عَلَى الْمُقْتَسِمِيْنَ … : ’’ الْمُقْتَسِمِيْنَ ‘‘} یہ {’’قَسْمٌ‘‘} سے باب افتعال کا اسم فاعل ہے، ’’تقسیم کرنے والے۔‘‘ قرطبی نے فرمایا : {’’ عِضِيْنَ ‘‘ ’’عِضَةٌ‘‘} کی جمع ہے، جس کا معنی کسی چیز کا جز یا ٹکڑا ہے۔ {’’عَضَا يَعْضُوْ عَضْوًا الشَّيْءَ‘‘ } اور {’’عَضّٰي يُعَضِّي الشَّيْءَ‘‘} ’’ کسی چیز کو ٹکڑے ٹکڑے کرنا۔‘‘ ہر ٹکڑا {’’عِضَةٌ‘‘ } کہلاتا ہے، اس کے آخر سے واؤ حذف کرکے تاء لائی گئی ہے۔ {’’ الْقُرْاٰنَ ‘‘} قرآن مجید کا نام ہے، پہلے انبیاء کی کتابوں کو بھی ’’قرآن‘‘ کہہ لیتے ہیں، کیونکہ وہ بھی پڑھی جاتی تھیں، گویا کتاب اور قرآن کا لفظ سب کے لیے ہے۔ ہمارے قرآن کے لیے عموماً {’’هٰذَا الْقُرْآنُ‘‘ } یا{ ’’ذٰلِكَ الْكِتَابُ‘‘} وغیرہ کا اشارہ ساتھ موجود ہوتا ہے۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ خُفِّفَ عَلٰی دَاوٗدَ عَلَيْهِ السَّلَامُ الْقُرْآنُ فَكَانَ يَأْمُرُ بِدَوَابِّهِ فَتُسْرَجُ فَيَقْرَأُ الْقُرْآنَ قَبْلَ أَنْ تُسْرَجَ دَوَابُّهُ ] [ بخاری، أحادیث الأنبیاء، باب قول اللہ تعالٰی : «و آتینا داود زبورا » : ۳۴۱۷ ] ’’داؤد علیہ السلام پر قرآن (پڑھنا) بہت ہلکا کر دیا گیا تھا، چنانچہ وہ اپنی سواریوں کے متعلق حکم دیتے تو ان پر زین ڈالی جاتی اور آپ سواریوں پر زین ڈالے جانے سے پہلے قرآن پڑھ لیتے تھے۔‘‘ ¤ ➋ ان آیات کی مختلف تفسیریں کی گئی ہیں، ان میں سے ایک وہ ہے جو امام المفسرین طبری رحمہ اللہ نے پسند فرمائی ہے۔ یہاں سمجھنے کی بات یہ ہے کہ {’’ كَمَاۤ اَنْزَلْنَا عَلَى الْمُقْتَسِمِيْنَ ‘‘} (جیسا ہم نے ان تقسیم کرنے والوں پر اتارا) کا تعلق پچھلی کس آیت اور کس لفظ کے ساتھ ہے اور اس مشبہ بہ کا مشبہ کیا ہے اور {’’ اَنْزَلْنَا ‘‘} (ہم نے اتارا) سے کیا چیز اتارنا مراد ہے؟ جواب اس کا یہ ہے کہ{’’ اَنْزَلْنَا ‘‘} کا مفعول محذوف ہے{ ’’اَلْعَذَابَ‘‘ } یعنی ہم نے عذاب اتارا اور {’’ كَمَاۤ اَنْزَلْنَا ‘‘} کا تعلق اس سے پہلی آیت : «{ وَ قُلْ اِنِّيْۤ اَنَا النَّذِيْرُ الْمُبِيْنُ }» کے ساتھ ہے اور معنی یہ ہے، اے نبی! کہہ دے کہ بے شک میں تو تمھیں کھلم کھلا ڈرانے والا ہوں، اس قسم کے عذاب سے جیسا ہم نے ان تقسیم کرنے والوں پر نازل کیا تھا جنھوں نے (اپنی) کتاب کو ٹکڑے ٹکڑے کر دیا تھا۔ یعنی اس کے بعض حصوں کو مان لیا اور بعض کو نہ مانا۔ سورۂ بقرہ میں اللہ تعالیٰ نے ان کے اس طرح کے بعض کاموں کا ذکر کرکے فرمایا : «{ اَفَتُؤْمِنُوْنَ بِبَعْضِ الْكِتٰبِ وَ تَكْفُرُوْنَ بِبَعْضٍ }» [ البقرۃ : ۸۵ ] ’’ پھر کیا تم کتاب کے بعض پر ایمان لاتے ہو اور بعض کے ساتھ کفر کرتے ہو؟‘‘ اور اس کی جزا دنیا کی رسوائی اور آخرت میں سخت ترین عذاب بیان فرمائی۔ اب یہاں آپ کے زمانے کے اسرائیلیوں کو اس قسم کے عذاب سے ڈرایا جا رہا ہے جو ان سے پہلوں پر آیا تھا، کیونکہ وہ بھی تورات کے بعض حصوں کا صاف انکار کرتے تھے، مثلاً نبی کریم صلی اللہ علیہ وسلم پر ایمان لانے کی تاکید والی آیات۔ اور قریش کو بھی کہ کتاب اللہ کے بعض حصوں کو جھٹلانے والوں پر جس طرح عذاب آیا میں تمھیں بھی ویسے ہی عذاب سے کھلم کھلا ڈرانے والا ہوں، کیونکہ تم نے بھی جھٹلانے کی روش اختیار کر رکھی ہے اور تم قرآن کے بعض حصوں کو ماننے کے لیے بالکل تیار نہیں ہو، چنانچہ تم بھی بتوں کی مذمت کی آیات نکال دینے پر ایمان لانے کی پیش کش کرتے ہو، فرمایا : «{ وَدُّوْا لَوْ تُدْهِنُ فَيُدْهِنُوْنَ }» [ القلم : ۹ ] ’’وہ چاہتے ہیں کاش! تو نرمی کرے تو وہ بھی نرمی کریں۔‘‘ اسی طرح ان کا یہ مطالبہ بھی ذکر فرمایا کہ اس قرآن کے علاوہ اور قرآن لے آؤ، یا اس میں تبدیلی کر دو۔ (دیکھیے یونس : ۱۵) دوسری تفسیر یہ ہے کہ {’’ كَمَاۤ اَنْزَلْنَا ‘‘} کا تعلق آیت (۸۷) « { وَ لَقَدْ اٰتَيْنٰكَ سَبْعًا مِّنَ الْمَثَاننِيْ وَ الْقُرْاٰنَ الْعَظِيْمَ }» سے ہے اور {’’ اَنْزَلْنَا ‘‘} کا مفعول محذوف {’’اَلْكِتَابَ‘‘ } ہے اور مطلب یہ ہے کہ ہم نے آپ کو سبع مثانی اور قرآن عظیم عطا فرمائے، جیسے ان لوگوں پر کتاب نازل کی تھی جنھوں نے اپنی کتاب کو ٹکڑے ٹکڑے کر دیا، کسی حصے کو مان لیا کسی کو نہ مانا، جب ہم ان پر کتاب نازل کر سکتے ہیں تو آپ پر، جن کی پاکیزہ زندگی کے یہ لوگ چالیس سالہ گواہ ہیں، ہم سبع مثانی اور قرآن عظیم کیوں نازل نہیں کر سکتے! یہ تفسیر بھی اچھی ہے۔"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت93،92) ➊ {فَوَرَبِّكَ لَنَسْـَٔلَنَّهُمْ اَجْمَعِيْنَ … : ’’ يَعْمَلُوْنَ ‘‘} میں دل، زبان ا اور جسم کے تمام حصوں کے افعال شامل ہیں۔ اس سے پہلے گزر چکا ہے کہ {’’ وَ اِنَّ السَّاعَةَ لَاٰتِيَةٌ ‘‘} (بے شک قیامت آنے والی ہے)، اب اسی بات کو آگے بڑھایا کہ تیرے رب کی قسم! ہم ان سب سے سوال کریں گے۔ اللہ تعالیٰ کا کسی سے سوال کرنا ہی نہایت خوفناک بات ہے، خصوصاً جب زبان، دل اور اعضا کے ہر ہر عمل کے متعلق ہو۔ آسان حساب صرف انھی کا ہو گا جن کا دفتر پیش ہونے پر کسی سوال و جواب کے بغیر نجات ہو جائے گی۔ دیکھیے سورہ ٔانشقاق( ۷ تا ۹) کی تفسیر۔ قسم کھا کر تمام کفار سے باز پرس کا یقین دلانے سے مقصود نبی کریم صلی اللہ علیہ وسلم اور مسلمانوں کو تسلی دینا ہے۔ ¤ ➋ ان آیات میں ذکر ہے کہ قیامت کے دن تمام کفار سے سوال کیا جائے گا، جب کہ سورۂ رحمن میں ہے : «{ فَيَوْمَىِٕذٍ لَّا يُسْـَٔلُ عَنْ ذَنْۢبِهٖۤ اِنْسٌ وَّ لَا جَآنٌّ }» [ الرحمٰن : ۳۹ ] ’’پھر اس دن نہ کسی انسان سے اس کے گناہ کے متعلق سوال کیا جائے گا اور نہ کسی جن سے۔ ‘‘ ایک آیت میں ہے سوال کیا جائے گا، دوسری میں ہے کہ نہیں کیا جائے گا، تو ابن عباس رضی اللہ عنھما نے اس کا جواب یہ دیا کہ کسی سے یہ سوال نہیں ہو گا کہ تم نے کیا کیا، کیونکہ اللہ تعالیٰ تو بندوں سے بھی زیادہ یہ بات جانتا ہے۔ سوال یہ ہو گا کہ کیوں کیا؟ اور ظاہر ہے کہ یہ سزا کی تمہید ہے۔ (ابن کثیر)"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت93،92) ➊ {فَوَرَبِّكَ لَنَسْـَٔلَنَّهُمْ اَجْمَعِيْنَ … : ’’ يَعْمَلُوْنَ ‘‘} میں دل، زبان ا اور جسم کے تمام حصوں کے افعال شامل ہیں۔ اس سے پہلے گزر چکا ہے کہ {’’ وَ اِنَّ السَّاعَةَ لَاٰتِيَةٌ ‘‘} (بے شک قیامت آنے والی ہے)، اب اسی بات کو آگے بڑھایا کہ تیرے رب کی قسم! ہم ان سب سے سوال کریں گے۔ اللہ تعالیٰ کا کسی سے سوال کرنا ہی نہایت خوفناک بات ہے، خصوصاً جب زبان، دل اور اعضا کے ہر ہر عمل کے متعلق ہو۔ آسان حساب صرف انھی کا ہو گا جن کا دفتر پیش ہونے پر کسی سوال و جواب کے بغیر نجات ہو جائے گی۔ دیکھیے سورہ ٔانشقاق( ۷ تا ۹) کی تفسیر۔ قسم کھا کر تمام کفار سے باز پرس کا یقین دلانے سے مقصود نبی کریم صلی اللہ علیہ وسلم اور مسلمانوں کو تسلی دینا ہے۔ ¤ ➋ ان آیات میں ذکر ہے کہ قیامت کے دن تمام کفار سے سوال کیا جائے گا، جب کہ سورۂ رحمن میں ہے : «{ فَيَوْمَىِٕذٍ لَّا يُسْـَٔلُ عَنْ ذَنْۢبِهٖۤ اِنْسٌ وَّ لَا جَآنٌّ }» [ الرحمٰن : ۳۹ ] ’’پھر اس دن نہ کسی انسان سے اس کے گناہ کے متعلق سوال کیا جائے گا اور نہ کسی جن سے۔ ‘‘ ایک آیت میں ہے سوال کیا جائے گا، دوسری میں ہے کہ نہیں کیا جائے گا، تو ابن عباس رضی اللہ عنھما نے اس کا جواب یہ دیا کہ کسی سے یہ سوال نہیں ہو گا کہ تم نے کیا کیا، کیونکہ اللہ تعالیٰ تو بندوں سے بھی زیادہ یہ بات جانتا ہے۔ سوال یہ ہو گا کہ کیوں کیا؟ اور ظاہر ہے کہ یہ سزا کی تمہید ہے۔ (ابن کثیر)"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت94) {فَاصْدَعْ بِمَا تُؤْمَرُ … : ’’ صَدَعَ يَصْدَعُ، الْأَمْرَ ‘‘} کسی معاملے کو خوب کھول کر بیان کرنا اور {’’صَدَعَ بِالْحَقِّ‘‘} کھلم کھلا بلند آواز سے حق کا اظہار کرنا۔ شروع میں نبی صلی اللہ علیہ وسلم خفیہ اسلام کی دعوت دیتے تھے، اس کے بعد ان آیات میں چھپ کر دعوت دینے کے بجائے صاف اعلانیہ طور پر اللہ تعالیٰ کے احکام سنانے کا اور مشرکین کی پروا نہ کرتے ہوئے ان سے اعراض کرنے کا حکم ہوا اور ساتھ ہی اللہ تعالیٰ نے ان لوگوں سے خود نمٹنے کا ذمہ اٹھایا جو آپ سے استہزا کرتے اور ٹھٹھا اڑاتے تھے۔ یہ حکم مکہ میں نازل ہوا، مدینہ گئے تو وہاں کفار اور اہل کتاب سے جنگ شروع ہوئی اور خطرے کے پیش نظر صحابہ کرام رضی اللہ عنھم آپ کا پہرا دیتے تھے ،جب سورۂ مائدہ کی آیت (۶۷) «{ يٰۤاَيُّهَا الرَّسُوْلُ بَلِّغْ مَاۤ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ وَ اِنْ لَّمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهٗ وَ اللّٰهُ يَعْصِمُكَ مِنَ النَّاسِ }» (اے رسول ! پہنچا دے جو کچھ تیری طرف تیرے رب کی جانب سے نازل کیا گیا ہے اور اگر تو نے نہ کیا تو تو نے اس کا پیغام نہیں پہنچایا اور اللہ تجھے لوگوں سے بچائے گا) اتری تو آپ نے خیمہ سے سر نکال کر پہرے داروں سے فرمایا: [ يَا أَيُّهَا النَّاسُ! انْصَرِفُوْا، فَقَدْ عَصَمَنِيَ اللّٰهُ ] [ ترمذی، تفسیر القرآن، باب ومن سورۃ المائدۃ : ۳۰۴۶۔ سلسلۃ الأحادیث الصحیحۃ : ۵ /۶۴۴، ح : ۲۴۸۹ ] ’’لوگو! چلے جاؤ، کیونکہ اللہ تعالیٰ نے مجھے محفوظ کر دیا ہے۔‘‘"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت95) {اِنَّا كَفَيْنٰكَ الْمُسْتَهْزِءِيْنَ :} ہم ان سے نبٹ لیں گے، آپ بے خوف و خطر دعوت و تبلیغ کا فریضہ سرانجام دیتے رہیے۔ عبد اللہ بن عباس رضی اللہ عنھما نے قرآن مجید کی یہ آیت پڑھی اور فرمایا کہ نبی صلی اللہ علیہ وسلم کا مذاق اڑانے والے (بڑے بڑے یہ پانچ) آدمی تھے، ولید بن مغیرہ، اسود بن عبد یغوث زہری، ابوزمعہ اسود بن مطلب، حارث بن عیطل سہمی اور عاص بن وائل۔ جبریل علیہ السلام رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو آپ نے ان سے مذاق اڑانے والوں کی شکایت کی۔ حدیث لمبی ہے، خلاصہ یہ کہ جبریل علیہ السلام نے ان کے جسم کے کسی نہ کسی حصے کی طرف اشارہ کیا اور وہ پانچوں بری طرح فوت ہوئے۔ [ السنن الکبریٰ للبیہقی:8/9، ح : ۱۸۱۸۷ ] جو مذاق اڑانے والے باقی رہے ان کا انجام عبد اللہ بن مسعود رضی اللہ عنہ نے بیان فرمایا : [ أَنَّ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّيْ  عِنْدَ الْبَيْتِ، وَ أَبُوْجَهْلٍ وَأَصْحَابٌ لَهُ جُلُوْسٌ، إذْ قَالَ بَعْضُهُمْ لِبَعْضٍ أَيُّكُمْ يَجِيْئُ بِسَلَی جَزُوْرِ بَنِيْ فُلاَنٍ فَيَضَعُهُ عَلٰی ظَهْرِ  مُحَمَّدٍ إِذَا سَجَدَ؟ فَانْبَعَثَ أَشْقَی الْقَوْمِ، فَجَاءَ بِهِ فَنَظَرَ حتّٰی إِذَا سَجَدَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَضَعَهُ عَلٰی ظَهْرِهِ بَيْنَ كَتِفَيْهِ وَأَنَا أَنْظُرُ، لاَ أُغْنِيْ شَيْئًا، لَوْ كَانَتْ لِيْ مَنَعَةٌ، قَالَ فَجَعَلُوْا يَضْحَكُوْنَ وَيُحِيْلُ بَعْضُهُمْ عَلٰی بَعْضٍ، وَرَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ سَاجِدٌ لاَ يَرْفَعُ رَأْسَهُ حَتّٰی جَاءَتْهُ فَاطِمَةُ فَطَرَحَتْهُ عَنْ ظَهْرِهِ، فَرَفَعَ رَأْسَهُ ثُمَّ قَالَ اَللّٰهُمَّ عَلَيْكَ بِقُرَيْشٍ، ثَلاَثَ مَرَّاتٍ، فَشَقَّ عَلَيْهِمْ إِذْ دَععَا عَلَيْهِمْ، قَالَ وَكَانُوْا يَرَوْنَ أنَّ الدَّعْوَةَ فِيْ ذٰلِكَ الْبَلَدِ مُسْتَجَابَةٌ، ثُمَّ سَمَّی اَللّٰهُمَّ عَلَيْكَ ببِأَبِيْ جَهْلٍ، وَعَلَيْكَ بِعُتْبَةَ بْنِ رَبِيْعَةَ، وَشَيْبَةَ ببْنِ رَبِيْعَةَ، وَالْوَليْدِ بْنِ عُتْبَةَ، وَأُمَيَّةَ بْنِ خَلَفٍ، وَعُقَبَةَ بْنِ أَبِيْ مُعَيْطٍ، وَعَدَّ السَّابِعَ فَلَمْ نَحْفَظْهُ، قَالَ فَوَالَّذِيْ نَفْسِيْ بِيَدِهِ لَقَدْ رَأَيْتُ الَّذذِيْنَ عَدَّ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ صَرْعَی فِي الْقَلِيْبِ قَلِيْبِ بَدْرٍ ] [ بخاری، الوضوء، باب إذا ألقي علٰی ظہر المصلی قدر…: ۲۴۰ ] ایک دفعہ رسول اللہ صلی اللہ علیہ وسلم بیت اللہ کے پاس نماز پڑھ رہے تھے اور ابوجہل اور اس کے کچھ ساتھی وہاں ببیٹھے ہوئے تھے، انھوں نے آپس میں کہا کہ تم میں سے کون ہے جو بنو فلاں کی ذبح کردہ اونٹنی کے رحم میں بچے کے اوپر والی جھلی اٹھا کر لائے اور محمد( صلی اللہ علیہ وسلم ) جب سجدہ کرے تو اس کی پیٹھ پر رکھ دے۔ تو ان میں سے سب سے بدبخت شخص اٹھا اور اس نے وہ جھلی لا کر آپ کے کندھوں کے درمیان رکھ دی۔ میں دیکھ رہا تھا مگر کچھ نہ کر سکتا تھا، کاش! مجھ میں آپ کے دفاع کی طاقت ہوتی۔ تو وہ سب ہنستے ہنستے ایک دوسرے پر لوٹ پوٹ ہونے لگے۔ رسول اللہ صلی اللہ علیہ وسلم سجدے ہی میں رہے، سر نہیں اٹھایا، یہاں تک کہ فاطمہ رضی اللہ عنھا آئیں اور اسے آپ کی کمر سے اتار پھینکا، تو آپ نے سراٹھایا اور کہا : ’’یا اللہ! قریش کو پکڑ۔‘‘ آپ کی یہ بددعا ان پر بڑی شاق گزری، وہ سمجھتے تھے کہ اس شہر میں دعا قبول ہوتی ہے۔ پھر آپ نے نام لے کر فرمایا : ’’اے اللہ! ابوجہل کو پکڑ، عتبہ بن ربیعہ، شیبہ بن ربیعہ، ولید بن عتبہ، امیہ بن خلف اور عقبہ بن ابی معیط کو پکڑ۔‘‘ ایک ساتواں بھی گنا جو ہمیں یاد نہیں رہا۔‘‘ ابن مسعود رضی اللہ عنہ نے فرمایا : ’’پھر اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! میں نے ان تمام آدمیوں کو جو رسول اللہ صلی اللہ علیہ وسلم نے گنے تھے، بدر کے کنویں میں ہلاک شدہ گرے ہوئے دیکھا۔‘‘"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت96) { الَّذِيْنَ يَجْعَلُوْنَ مَعَ اللّٰهِ …:} نبی کریم صلی اللہ علیہ وسلم سے استہزا کے ساتھ ساتھ ان کا سب سے بڑا جرم شرک ذکر کر کے فرمایا، یہ لوگ عنقریب انجام دیکھ لیں گے۔ دنیا میں ان کے انجام کا ذکر اوپر گزرا، آخرت کا معاملہ تو بیان ہی میں نہیں آ سکتا۔"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت97) {وَ لَقَدْ نَعْلَمُ اَنَّكَ يَضِيْقُ …: } اللہ تعالیٰ نے کفار کے استہزا اورکفر و شرک پر اصرار سے متعلق نبی صلی اللہ علیہ وسلم کو نہایت تاکید والے الفاظ میں تسلی دی ۔چنانچہ لام تاکید اور {’’قَدْ‘‘} برائے تحقیق کے ساتھ اس بات کا اظہار فرمایا کہ ہم آپ کے حالات سے بے خبر نہیں، بلکہ ہر وقت ہماری توجہ آپ کی طرف ہے، اب بھی اور آئندہ بھی اور ہم جانتے ہیں کہ یقینا آپ کاسینہ ان کی باتوں سے تنگ پڑجاتاہے۔"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت98) ➊ {فَسَبِّحْ بِحَمْدِ رَبِّكَ :} کفار کی زیادتیوں اور استہزا کی و جہ سے سینہ کی اس تنگی کا علاج بیان فرمایا کہ اگر آپ کا سینہ اس سے تنگ ہو تو آپ اللہ تعالیٰ کی تسبیح اور حمد کریں۔ تسبیح کا معنی ہے اللہ تعالیٰ کو ہر عیب، نقص اور ایسی چیزوں سے پاک قرار دینا جو اس کے لائق نہیں اور حمد کا معنی اللہ کی ان تمام صفات کمال کے ساتھ تعریف کرنا جو اس کی شان کے لائق ہیں۔ اہل علم فرماتے ہیں کہ تسبیح اور حمد میں اللہ تعالیٰ کی تمام صفات کمال آجاتی ہیں، کیونکہ تسبیح میں تمام صفات سلبیہ (یعنی ہر عیب اور کمی سے پاک ہونا) آ گئیں اور حمد میں تمام صفات ثبوتیہ (یعنی ہر خوبی کا مالک ہونا) آ گئیں، چنانچہ قرآن مجید میں بہت سے مقامات پر ہر مصیبت اور تنگی میں صبر اور تسبیح و حمد کا حکم دیا، جیسا کہ دیکھیے سورۂ طٰہٰ (۱۳۰)، فرقان (۵۸)، مومن (۵۵)، طور ( ۴۸) اور سورۂ نصر (۳) وغیرہ۔ ¤ ➋ { وَ كُنْ مِّنَ السّٰجِدِيْنَ :} یعنی نماز پڑھنے والوں میں سے ہو جا، جس طرح قیام اور {’’رَكْعَةٌ‘‘ } (رکوع) سے مراد پوری نماز لی جاتی ہے، حالانکہ قیام اور {’’رَكْعَةٌ‘‘} (رکوع) نماز کا جز ہیں، کل نہیں، مگر جز سے مراد کل ہے، اسی طرح یہاں سجدہ سے مراد نماز ہے، اسی لیے اس آیت پر سجدہ نہیں۔ سجدے کا ذکر خصوصاً اس لیے کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَقْرَبُ مَا يَكُوْنُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ، فَأَكْثِرُوا الدُّعَاءَ] [ مسلم، الصلاۃ، باب ما یقال في الرکوع و السجود : ۴۸۲، عن أبي ھریرۃ رضی اللہ عنہ ] ’’بندہ اپنے رب کے سب سے زیادہ قریب اس وقت ہوتا ہے جب وہ سجدے میں ہوتا ہے تو (سجدے میں) دعا کثرت سے کیا کرو۔‘‘ اس آیت سے معلوم ہوا کہ ہر پیش آنے والی مصیبت کا علاج اللہ کا ذکر، خصوصاً تسبیح و تحمید اور نماز ہے، ان کی برکت سے دل کو تسلی بھی ہو گی اور فکر و غم کے بادل بھی چھٹ جائیں گے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فاطمہ رضی اللہ عنھا کے چکی پیسنے اور مشک میں پانی ڈھونے کی مشقت کی و جہ سے خادمہ کے لیے درخواست پر انھیں سوتے وقت تسبیحات فاطمہ کا حکم دیا اور ان تسبیحات کو خادمہ سے بہتر قرار دیا اور خود آپ صلی اللہ علیہ وسلم کا عمل تھا کہ جب آپ کو کوئی معاملہ پیش آتا تو نماز میں مصروف ہو جاتے۔ [ أبوداوٗد، التطوع، باب وقت قیام النبی صلی اللہ علیہ وسلم فی اللیل : ۱۳۱۹۔ مسند أحمد : ۵ /۳۸۸، ح : ۲۳۳۶۱ ]"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت99) {وَ اعْبُدْ رَبَّكَ حَتّٰى يَاْتِيَكَ الْيَقِيْنُ :} یعنی موت آنے تک اپنے رب کی عبادت پر قائم رہیں۔ موت کو ’’یقین‘‘ اس لیے فرمایا کہ ہر جان دار کے لیے اس کا آنا یقینی ہے۔ قرآن میں بعض دوسرے مقامات پر بھی ’’یقین‘‘ کا لفظ موت کے معنی میں آیا ہے، جیسے فرمایا : «{ حَتّٰۤى اَتٰىنَا الْيَقِيْنُ }» [ المدثر : ۴۷ ] ’’یہاں تک کہ ہمیں یقین آ پہنچا (یعنی موت ا ٓگئی)۔‘‘ اس لیے سب قابل ذکر مفسرین نے اس آیت میں یقین کو بمعنی موت مراد لیا ہے۔ تو جب تک ہوش رہے نماز اوردوسری عبادات زندگی کے آخری دم تک حسب طاقت کھڑے ہو کر یا بیٹھ کر یا پہلو کے بل لیٹ کر ادا کرنا فرض ہے۔ بعض جاہل اور بے عمل پیر اس آیت کی رو سے کہتے ہیں کہ عبادت کرتے کرتے جب یقین حاصل ہو جائے تو پھر عبادت کی ضرورت نہیں ہے، اس لیے وہ اپنے آپ کو نماز، روزہ اور عبادات سے مستثنیٰ قرار دے لیتے ہیں۔ یہ تفسیر کتاب اللہ کے ساتھ کھیل ہے۔ کیا یہ جس یقین کا نام لیتے ہیں رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنھم کو حاصل نہ ہو سکا کہ وہ آخر وقت تک نماز، روزہ اور دوسری عبادات کی پابندی کرتے رہے۔ بہرحال آیت میں یقین سے مراد یقین قلبی لینا اور نماز روزہ چھوڑ دینا صریح بے دینی ہے۔"
    }
  ]
}