{
  "surah": "Al-Kahf",
  "surah_number": 18,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "{سورة كهف} ¤ کہف کا معنی پہاڑ میں کھلی اور وسیع غار ہے، تنگ غار کو{ ’’غَارٌ‘‘ } یا {’’مَغَارَةٌ‘‘ } کہتے ہیں۔ اس سورت میں اللہ تعالیٰ نے کہف والوں کا قصہ بیان فرمایا ہے، جس میں اللہ پر ایمان کی برکات بیان ہوئی ہیں کہ اس کی بدولت کس طرح آدمی دشمن سے محفوظ اور تمام دنیا سے بے نیاز ہو جاتا ہے، اس میں حق کہنے کی کتنی جرأت پیدا ہو جاتی ہے اور اللہ تعالیٰ اپنے بندوں کو کیسے عجیب طریقوں سے عزت و کرامت عطا فرماتا ہے۔ (مہائمی) اس کی فضیلت میں متعدد احادیث ثابت ہیں۔ ایک حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ حَفِظَ عَشْرَ آيَاتٍ مِنْ أَوَّلِ سُوْرَةِ الْكَهْفِ، عُصِمَ مِنْ فِتْنَةِ الدَّجَّالِ ] [ مسلم، صلاۃ المسافرین، باب فضلضل سورۃ الکہف و آیۃ الکرسی : ۸۰۹ ]’’جو شخص سورۂ کہف کی شروع کی دس آیات حفظ کرلے وہ دجال کے فتنے سے محفوظ رہے گا۔‘‘ مسلم کی اس حدیث میں اس سورت کی آخری دس آیات کی بھی یہی فضیلت بیان ہوئی ہے۔ اس سورت کے پڑھنے سے گھر میں سکینت اور برکت کا نزول ہوتا ہے۔ براء بن عازب رضی اللہ عنہ بیان فرماتے ہیں : [ كَانَ رَجُلٌ يَقْرَأُ سُوْرَةَ الْكَهْفِ وَإِلٰی جَانِبِهِ حِصَانٌ مَرْبُوْطٌ بِشَطَنَيْنِ، فَتَغَشَّتْهُ سَحَابَةٌ فَجَعَلَتْ تَدْنُوْ وَ تَدْنُوْ، وَجَعَلَ فَرَسُهُ يَنْفِرُ، فَلَمَّا أَصْبَحَ أَتَي النَّبِيَّ صَلَّی اللّٰهُ ععَلَيْهِ وَسَلَّمَ فَذَكَرَ ذٰلِكَ لَهُ، فَقَالَ تِلْكَ السَّكِيْنَةُ تَنَزَّلَتْ بِالْقُرْآنِ ] ’’ایک آدمی سورۂ کہف پڑھ رہا تھا، اس کے ایک طرف ایک گھوڑا تھا جو دو رسیوں سے بندھا ہوا تھا، تو اسے بادل کے ایک ٹکڑے نے ڈھانپ لیا، پھر اس نے قریب آنا شروع کر دیا اور مزید قریب آتا گیا، چنانچہ اس کا گھوڑا بدکنے لگا، جب صبح ہوئی تو وہ نبی صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ سکینت تھی جو قرآن کے ساتھ اتری۔‘‘ [ بخاری، فضائل القرآن، باب فضل الکہف : ۵۰۱۱ ] ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ مَنْ قَرَأَ سُوْرَةَ الْكَهْفِ يَوْمَ الْجُمُعَةِ أَضَاءَ لَهٗ مِنَ النُّوْرِ مَا بَيْنَ الْجُمُعَتَيْنِ] [ مستدرک حاکمم : 368/2، ح : ۳۳۹۲، صححہ الألباني في صحیح الجامع : ۶۴۷۰ ] ’’جو شخص جمعہ کے دن سورۂ کہف پڑھے تو دو جمعوں کے درمیان اس کے لیے نور روشن رہے گا۔‘‘ ¤ (آیت 1) ➊ { اَلْحَمْدُ لِلّٰهِ الَّذِيْۤ … :} یہ سورت ان پانچ سورتوں میں شامل ہے جن کی ابتدا {’’ اَلْحَمْدُ ‘‘} کے ساتھ ہوئی ہے، دوسری چار سورتیں فاتحہ، انعام، سبا اور فاطر ہیں۔ پچھلی سورت کا خاتمہ بھی {’’ اَلْحَمْدُ ‘‘} کے ساتھ ہوا ہے۔ اس سے یہ سبق ملتا ہے کہ ہر کام کی ابتدا اور انتہا اللہ کے پاکیزہ نام کے ساتھ یا اس کی حمد کے ساتھ کرنی چاہیے۔ ان تمام سورتوں میں سے ہر سورت کا طریقہ اگرچہ مختلف ہے مگر مقصود لوگوں کو اس بات کا یقین دلانا ہے کہ حمد کے لائق صرف اللہ تعالیٰ کی ذات پاک ہے، اور کوئی نہیں، کیونکہ کسی میں کوئی خوبی ہے تو اللہ تعالیٰ ہی کی عطا کر دہ ہے۔ ¤ ➋ {الَّذِيْۤ اَنْزَلَ عَلٰى عَبْدِهِ الْكِتٰبَ :} سورۂ فاتحہ میں اللہ تعالیٰ کے تمام حمد کا مالک ہونے کی دلیل کے لیے چار صفات بیان ہوئی ہیں، یہاں اللہ تعالیٰ کے تمام حمد اور خوبیوں کا مالک ہونے کی ایک ہی دلیل بیان کی گئی ہے اور وہ اللہ تعالیٰ کا اپنے بندے پر {’’الْكِتٰبَ ‘‘} نازل فرمانا ہے۔ کیونکہ دوسرے تمام انعامات اگرچہ ایک دوسرے سے بڑھ کر ہیں مگر یہ نعمت سب سے اہم ہے، کیونکہ اس پر ہمیشہ کی زندگی یعنی اخروی کامیابی یا ناکامی کا دارومدار ہے۔ ¤ ➌ { عَلٰى عَبْدِهِ:} ’’اپنے بندے پر، اپنے غلام پر‘‘ اس میں رسول اللہ صلی اللہ علیہ وسلم کو اپنا خاص عبد قرار دینے میں آپ صلی اللہ علیہ وسلم کی بے انتہا شان بیان ہوئی ہے، اگرچہ زمین و آسمان میں رہنے والی ہر چیز اللہ تعالیٰ کی غلام ہے، مگر ’’اپنا غلام‘‘ کہنے میں آپ صلی اللہ علیہ وسلم کو جو عزت ملی وہ بہت کم لوگوں کو ملی ہے، جیسا کہ «سُبْحٰنَ الَّذِيْۤ اَسْرٰى بِعَبْدِهٖ » [بنی إسرائیل : ۱ ] میں ہے اور اس کتاب کی بھی تعریف ہے جو نازل کی گئی۔ {’’ الْكِتٰبَ ‘‘} میں الف لام عہد کا ہے، یعنی یہ کتاب، مراد قرآن کریم ہے، کیونکہ جب صرف {’’ الْكِتٰبَ ‘‘} کہا جائے تو قرآن کریم ہی مراد ہوتا ہے، اس لیے کہ اس کے سوا کسی اور میں یہ کمال ہی نہیں کہ اسے {’’ الْكِتٰبَ ‘‘} کہا جا سکے۔ ¤ ➍ {وَ لَمْ يَجْعَلْ لَّهٗ عِوَجًا: ’’ عِوَجًا ‘‘} کجی، ٹیڑھا پن۔ {’’ عِوَجًا ‘‘} پر تنوین عموم کے لیے ہے جو نفی کے بعد آکر مزید عام ہو گیا ہے، یعنی اس کتاب میں کسی بھی قسم کا کوئی ٹیڑھا پن نہیں، نہ الفاظ میں، نہ معانی میں، نہ فصاحت و بلاغت میں، نہ یہ کہ اس کی آیات کا آپس میں کوئی اختلاف ہو، یا اس کی کوئی خبر غلط نکلے، یا کوئی حکم حکمت سے خالی ہو۔ مزید دیکھیے سورۂ زمر (۲۸)، بنی اسرائیل (۹ ، ۱۰) اور نساء (۸۲)۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ {’’ قَيِّمًا ‘‘} میں مبالغہ ہے، یعنی بالکل سیدھی، پہلے فرمایا تھا کہ اس میں کوئی کجی نہیں رکھی، اب فرمایا بالکل سیدھی ہے۔ بات ایک ہی ہے مگر اس تاکید کا فائدہ یہ ہے کہ بعض اوقات ایک چیز میں بظاہر کوئی کجی نہیں ہوتی، مگر حقیقت میں اور باریکی سے دیکھا جائے تو اس میں کوئی نہ کوئی کجی ہوتی ہے، اس سے اس کی بھی نفی ہو گئی۔ جیسے ایک جگہ ہموار نظر آتی ہے مگر آلہ رکھ کر دیکھیں تو پتا چلتا ہے کہ ہموار نہیں۔ {’’ قَيِّمًا ‘‘} کا معنی نگران بھی ہے، {’’مُهَيْمِنٌ‘‘ } کا بھی یہی معنی ہے۔ (دیکھیے مائدہ : ۴۸) اس صورت میں مراد یہ ہو گی کہ یہ کتاب پچھلی تمام کتابوں پر نگران ہے، یعنی ان کے مضامین کا درست یا تحریف شدہ ہونا اس کتاب کی تصدیق یا تکذیب سے معلوم ہوتا ہے۔ ¤ ➋ { لِيُنْذِرَ بَاْسًا …:} یہاں یہ بتایا کہ اس کتاب کو اپنے بندے پر اس لیے نازل فرمایا کہ وہ اس سخت عذاب سے ڈرائے جو اس کی جانب سے ہو گا، مگر یہ نہیں بتایا کہ کسے ڈرائے، اس کی وجہ یا تو یہ ہے کہ مراد عموم ہے، یعنی کافر و مومن ہر ایک کو اللہ کی جانب سے آنے والے سخت عذاب سے ڈرائے، یا یہ کہ یہ بات اللہ تعالیٰ نے اگلی آیت میں بتائی ہے، چنانچہ فرمایا : «وَ يُنْذِرَ الَّذِيْنَ قَالُوا اتَّخَذَ اللّٰهُ وَلَدًا » [ الکہف : ۴ ] ’’اور (تاکہ) ان لوگوں کو ڈرائے جنھوں نے کہا اللہ نے کوئی اولاد بنا رکھی ہے۔‘‘ اس آیت(۴) میں یہ نہیں بتایا کہ کس چیز سے ڈرائے، اس کا ذکر زیر تفسیر آیت (۲) میں ہے کہ اس کی جانب سے آنے والے سخت عذاب سے ڈرائے۔ دونوں آیات کو ملائیں تو مضمون یہ بنے گا : ’’تاکہ ان لوگوں کو اپنی جانب سے آنے والے سخت عذاب سے ڈرائے جنھوں نے کہا کہ اللہ تعالیٰ نے کوئی اولاد بنا رکھی ہے۔‘‘ دونوں آیتوں میں ڈرانے کا ذکر دو بار آیا ہے۔ اس سے معلوم ہوا کہ اس کتاب اور پیغمبر کے فرائض میں ڈرانے کا فریضہ زیادہ اہم ہے، کیونکہ ایمان نہ لانے والے زیادہ ہیں، جن میں سے کوئی مسیح علیہ السلام کو اور کوئی عزیر علیہ السلام کو اللہ کا بیٹا قرار دیتا ہے، کوئی فرشتوں کو اللہ کی بیٹیاں کہتا ہے، کوئی اپنے انبیاء و اولیاء کو اللہ کے نور کا ٹکڑا اور کوئی انھیں عین اللہ تعالیٰ قرار دیتا ہے، جیسا کہ نصرانیوں نے کہا : «اِنَّ اللّٰهَ هُوَ الْمَسِيْحُ ابْنُ مَرْيَمَ » [ المائدۃ : ۷۲ ] ’’بے شک اللہ مسیح ابن مریم ہی تو ہے۔‘‘ اور ہماری امت کے ایک ظالم نے کہا ہے: ¤ وہی جو مستوی عرش تھا خدا ہو کر ¤ اتر پڑا ہے مدینہ میں مصطفی ہو کر ¤ اللہ تعالیٰ کے حکم سے یہ کتاب ان سب کو اس کی جانب سے آنے والے سخت عذاب سے ڈراتی ہے، خواہ وہ دنیا و آخرت دونوں میں ہو یا صرف آخرت میں۔ اللہ تعالیٰ کے لیے اولاد رکھنے کی تردید کے لیے دیکھیے سورۂ مریم (۸۸ تا ۹۵) {’’ مِنْ لَّدُنْهُ ‘‘} سے عذاب کی ہولناکی بیان کرنا مقصود ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": ""
    },
    {
      "ayah": 4,
      "tafsir": ""
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {مَا لَهُمْ بِهٖ مِنْ عِلْمٍ …:} یعنی اللہ کی اولاد ہونے کی کوئی دلیل نہ ان کے پاس ہے اور نہ ان کے آباء کے پاس، کیونکہ علم وہ ہے جس کی کوئی دلیل ہو۔ ان کے باپ دادا نے کسی علم کے بغیر محض جہل سے یہ بات نکالی اور انھوں نے محض جہالت کی بنا پر ان کی تقلید کی۔ ابن قیم رحمہ اللہ نے تقلید کے بارے میں کیا خوب کہا:¤ {اَلْعِلْمُ قَالَ اللّٰهُ قَالَ رَسُوْلُهُ ¤ مَا ذَاكَ وَالتَّقْلِيْدُ يَسْتَوِيَانِ ¤ اِذْ أَجْمَعَ الْعُلَمَاءُ أَنَّ مُقَلِّدًا ¤ لِلنَّاسِ وَالْأَعْمَي هُمَا سِيَّانِ} ¤ ’’علم وہ ہے جو اللہ نے فرمایا اور اس کے رسول نے فرمایا۔ یہ اور تقلید برابر نہیں ہیں، کیونکہ علماء کا اتفاق ہے کہ لوگوں کی تقلید کرنے والا اور اندھا دونوں برابر ہیں۔ ‘‘ ¤ ➋ {كَبُرَتْ كَلِمَةً … : ’’ كَبُرَتْ ‘‘} مذمت کے لیے فعل ماضی ہے، گویا افعال مدح و ذم کے قبیل سے ہے۔ {’’ كَبُرَتْ ‘‘} فعل ذم ہے، اس کا فاعل {’’هِيَ‘‘} محذوف ہے، {’’ كَلِمَةً ‘‘ } تمیز ہے، یعنی یہ جو کچھ انھوں نے کہا کہ اللہ تعالیٰ کی اولاد ہے، یہ بطور کلمہ (یعنی منہ سے بولنے کے لحاظ سے) ہی بہت بڑی بات ہے، کجا یہ کہ اس کا عقیدہ رکھا جائے۔ اس میں کچھ تعجب کا اظہار بھی ہے کہ کتنی بڑی بات انھوں نے اپنے منہ سے نکال دی۔ دوسری جگہ فرمایا : «وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا (88) لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا (89) تَكَادُ السَّمٰوٰتُ يَتَفَطَّرْنَ مِنْهُ وَ تَنْشَقُّ الْاَرْضُ وَ تَخِرُّ الْجِبَالُ هَدًّا (90) اَنْ دَعَوْا لِلرَّحْمٰنِ وَلَدًا (91) وَ مَا يَنْۢبَغِيْ لِلرَّحْمٰنِ اَنْ يَّتَّخِذَ وَلَدًا (92) اِنْ كُلُّ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ اِلَّاۤ اٰتِي الرَّحْمٰنِ عَبْدًا (93) لَقَدْ اَحْصٰىهُمْ وَ عَدَّهُمْ عَدًّا (94) وَ كُلُّهُمْ اٰتِيْهِ يَوْمَ الْقِيٰمَةِ فَرْدًا» [ مریم : ۸۸ تا ۹۵ ] ’’اور انھوں نے کہا رحمان نے کوئی اولاد بنا لی ہے۔ بلاشبہ یقینا تم ایک بہت بھاری بات کو آئے ہو۔ آسمان قریب ہیں کہ اس سے پھٹ پڑیں اور زمین شق ہوجائے اور پہاڑ ڈھے کر گر پڑیں کہ انھوں نے رحمان کے لیے کسی اولاد کا دعویٰ کیا، حالانکہ رحمان کے لائق نہیں کہ وہ کوئی اولاد بنائے۔ آسمانوں اور زمین میں جو کوئی بھی ہے وہ رحمان کے پاس غلام بن کر آنے والا ہے۔ بلاشبہ یقینا اس نے ان کا احاطہ کر رکھا ہے اور انھیں خوب اچھی طرح گن کر شمار کر رکھا ہے اور ان میں سے ہر ایک قیامت کے دن اس کے پاس اکیلا آنے والا ہے۔‘‘"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {فَلَعَلَّكَ بَاخِعٌ نَّفْسَكَ … : ’’ بَاخِعٌ ‘‘ ’’بَخَعَ يَبْخَعُ نَفْسَهُ‘‘} اس نے اپنے آپ کو غم سے مار ڈالا۔ {’’لَعَلَّ‘‘} کا لفظ محبوب چیز کے لیے بولا جائے تو ترجی، یعنی امید کرنا مراد ہوتا ہے اور ایسی چیز کے لیے بولا جائے جس کا خطرہ ہو تو اسے اشفاق یعنی ڈرنا کہا جاتا ہے، یہاں یہی مراد ہے۔ اس آیت سے مقصود آپ صلی اللہ علیہ وسلم کو تسلی دینا ہے کہ ان لوگوں کے ایمان نہ لانے پر آپ اپنے آپ کو رنج و غم سے کیوں گھلا رہے ہیں؟ اس آیت سے اندازہ ہوتا ہے کہ آپ صلی اللہ علیہ وسلم کو اپنی قوم کے ایمان نہ لانے کا کس قدر صدمہ تھا، حتیٰ کہ اللہ تعالیٰ نے اس کے لیے {’’ بَاخِعٌ نَّفْسَكَ ‘‘} (اپنے آپ کو ہلاک کر لینے والے) کے الفاظ استعمال فرمائے۔ مزید دیکھیے سورۂ شعراء(۳) ابوہریرہ رضی اللہ عنہ راوی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [إِنَّمَا مَثَلِيْ وَمَثَلُ النَّاسِ  كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا فَلَمَّا أَضَائَتْ مَا حَوْلَهُ جَعَلَ الْفَرَاشُ وَهٰذِهِ الدَّوَابُّ الَّتِيْ تَقَعُ فِي النَّارِ يَقَعْنَ فِيْهَا، فَجَعَلَ الرَّجُلُ يَنْزِعُهُنَّ وَيَغْلِبْنَهُ، فَيَقْتَحِمْنَ فِيْهَا، فَأَنَا آخُذُ بِحُجَزِكُمْ عَنِ النَّارِ وَاَنْتُمْ تَقْتَحِمُوْنَ فِيْهَا ] [بخاری، الرقاق، باب الانتھاء عن المعاصي : ۶۴۸۳۔ مسلم : 2284/16 ]’’میری اور لوگوں کی مثال اس شخص کی سی ہے جس نے ایک آگ خوب بھڑکائی، جب اس نے اس کے اردگرد کو روشن کر دیا تو پروانے اور اس قسم کے جانور اس آگ میں گرنے لگے۔ وہ اس میں گرتے تھے اور وہ شخص انھیں روکتا تھا اور وہ اس سے زبردستی آگ میں گھستے تھے۔ تو میں آگ سے بچانے کے لیے تمھاری کمروں کو پکڑنے والا ہوں اور تم زبردستی اس میں گھستے ہو۔‘‘ مزید دیکھیے سورۂ فاطر (۸)، نمل (۷۰) اور نحل (۲۷) {’’ عَلٰۤى اٰثَارِهِمْ ‘‘} ان کے قدموں کے نشانات پر، یعنی ان کے پیچھے۔ {’’ اَسَفًا ‘‘} بہت زیادہ فکر و غم، یہ مفعول ہے، یعنی غم کی وجہ سے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) { اِنَّا جَعَلْنَا مَا عَلَى الْاَرْضِ زِيْنَةً لَّهَا …:} یعنی ہم نے زمین پر جو کچھ بھی ہے، حیوان، انسان، پودے، ندی نالے، سمندر اور پہاڑ، غرض ہر چیز اس زمین کی زینت بنائی ہے۔ زینت کی مزید تفصیل کے لیے دیکھیے آل عمران (۱۴) مقصد انسانوں کی آزمائش ہے کہ ان میں سے عمل میں کون زیادہ اچھا ہے، کون دنیا کی سج دھج کی طرف دوڑتا ہے اور کون اس کو چھوڑ کر آخرت کے حصول کی کوشش کرتا ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) {وَ اِنَّا لَجٰعِلُوْنَ مَا عَلَيْهَا …: ’’ صَعِيْدًا ‘‘ } مٹی، کیونکہ وہ سمندر سے اوپر اٹھی ہوئی ہے۔ {’’ صَعِدَ يَصْعَدُ ‘‘} چڑھنا۔{ ’’ جُرُزًا ‘‘ } چٹیل زمین، جس میں کوئی سبزہ نہ ہو۔ {’’جَرَزَتِ الْأَرْضُ‘‘} قحط یا ٹڈی دل کی وجہ سے زمین پر کوئی اگی ہوئی چیز نہ رہ گئی۔ سورۂ سجدہ میں فرمایا : «اَوَ لَمْ يَرَوْا اَنَّا نَسُوْقُ الْمَآءَ اِلَى الْاَرْضِ الْجُرُزِ فَنُخْرِجُ بِهٖ زَرْعًا تَاْكُلُ مِنْهُ اَنْعَامُهُمْ وَ اَنْفُسُهُمْ اَفَلَا يُبْصِرُوْنَ » [ السجدۃ : ۲۷ ] ’’اور کیا اس بات نے ان کی رہنمائی نہیں کی کہ ہم پانی کو چٹیل زمین کی طرف ہانک کر لے جاتے ہیں، پھر اس کے ذریعے کھیتی نکالتے ہیں جس میں سے ان کے چوپائے کھاتے ہیں اور وہ خود بھی، تو کیا وہ نہیں دیکھتے؟‘‘ ان دونوں آیتوں میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ کفار جن چیزوں پر اترا رہے ہیں وہ سب چند دن کے لیے زمین کی زینت ہیں، پھر ایک وقت آنے والا ہے کہ نہ اس پر کوئی مکان رہے گا نہ باغ، نہ سبزہ، نہ جانور، نہ آدمی، یعنی یہ ساری چہل پہل ختم ہو جائے گی۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {اَمْ حَسِبْتَ …:’’ الْكَهْفِ ‘‘} پہاڑ میں وسیع غار۔ {’’ الرَّقِيْمِ ‘‘} بمعنی {’’مَرْقُوْمٌ‘‘} یعنی لکھی ہوئی تختی یا سل یا کتاب والے۔ ان لوگوں کو ’’اصحاب الرقیم‘‘ اس لیے کہتے ہیں کہ جب وہ اچانک غائب ہو گئے اور بہت تلاش کے باوجود نہ ملے تو ان کے نام ایک تختی یا سل پر لکھ کر خزانے میں محفوظ کر دیے گئے، یا یہ کہ ان کے پاس شریعت کے احکام پر مشتمل لکھی ہوئی کتاب تھی۔(شنقیطی) یا یہ کہ ان کے جاگنے کے بعد لوگوں نے غار پر ایک تختی نصب کر دی جس پر ان کے نام لکھے ہوئے تھے۔ ¤ ➋ { اَمْ حَسِبْتَ اَنَّ اَصْحٰبَ الْكَهْفِ … :} اس آیت کی تفسیرجو اکثر مفسرین، مثلاً طبری، ابن کثیر، شنقیطی رحمۃ اللہ علیھم نے کی ہے، یہ ہے کہ {’’ اَمْ ‘‘} منقطعہ انکار کے لیے ہے۔ شنقیطی رحمہ اللہ نے فرمایا : ’’اللہ تعالیٰ اپنے نبی سے فرما رہے ہیں کہ کیا تم نے اصحابِ کہف کے قصے کو ہماری نشانیوں میں بڑی عجیب نشانی سمجھ لیا ہے۔ بے شک لوگ اسے بہت بڑی اور عجیب بات سمجھیں، مگر یہ ہماری قدرت اور عظیم نشانیوں کے سامنے کچھ عجیب نہیں، کیونکہ ہمارا آسمانوں کو اور زمین کو پیدا کرنا، پھر زمین میں اس کی زینت کی ہر چیز پیدا کرنا، پھر قیامت کے دن اسے چٹیل میدان بنا دینا اصحابِ کہف کے معاملے سے بہت زیادہ عجیب ہے، جنھیں ہم نے تین سو نو (۳۰۹) سال سلائے رکھا، پھر دوبارہ اٹھا دیا۔ اس کی دلیل بہت سی آیات ہیں، ایک تو یہ کہ اللہ تعالیٰ نے اصحاب کہف کے ذکر سے پہلے زمین اور اس کی زینت پیدا کرنے، پھر اسے چٹیل میدان بنانے کا ذکر فرمایا ہے۔ اس سے معلوم ہوا کہ یہ قصہ ان چیزوں کے مقابلے میں کچھ عجیب نہیں جو اس سے کہیں بڑی ہیں۔ قرآن مجید میں بہت سی جگہ لوگوں کو توجہ دلائی گئی ہے کہ آسمان و زمین کو پیدا کرنا لوگوں کو پیدا کرنے سے بہت بڑی بات ہے، جیسا کہ فرمایا : «لَخَلْقُ السَّمٰوٰتِ وَ الْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ » [ المؤمن : ۵۷ ] ’’یقینا آسمانوں کو اور زمین کو پیدا کرنا لوگوں کو پیدا کرنے سے بہت بڑا ہے۔‘‘ اور دیکھیے نازعات (۲۷ تا ۳۳) یاد رہے کہ ’’اصحاب کہف‘‘ اور ’’اصحاب رقیم ‘‘ ایک ہی گروہ کے نام ہیں اور صحیح بخاری میں مذکور غار کے اندر پناہ لینے والے تین آدمیوں کا اس واقعہ سے تعلق بہت بعید ہے، جن میں سے ایک والدین سے حسن سلوک کرنے والا، ایک پاک دامن رہنے والا اور ایک اجرت پر مزدور رکھنے والا تھا۔ اور یہ بات یاد رکھیں کہ اصحابِ کہف کے قصے، ان کے ناموں اور یہ کہ وہ زمین کے کس حصے میں تھے؟ اس سب سے متعلق نبی صلی اللہ علیہ وسلم سے اس کے علاوہ کوئی بات ثابت نہیں جو قرآن سے زائد ہو۔ مفسرین نے ان کے متعلق بہت سی اسرائیلی روایات بیان کی ہیں جن کے قابل اعتماد نہ ہونے کی وجہ سے ہم نے ان کی طرف توجہ نہیں کی۔‘‘ (شنقیطی ملخصاً) ¤ ایک اور تفسیر جو پہلی تفسیر کے علاوہ صاحب روح المعانی اور ابن عاشور رحمۃ اللہ علیھما وغیرہ نے ذکر فرمائی ہے، یہ ہے کہ {’’حِسْبَانٌ‘‘} گمان اور علم دونوں معنوں میں آتا ہے، ہاں {’’ اَمْ ‘‘} انکار کے لیے نہیں بلکہ تقریری ہے، یعنی یہ بتانے کے لیے ہے کہ یقینا یہ لوگ واقعی عجیب تھے۔ گویا یہ کہا گیا : {’’اِعْلَمْ أَنَّهُمْ عَجَبٌ‘‘} ’’جان لے کہ یقینا وہ لوگ بڑے عجیب تھے۔‘‘ جیسا کہ تم کہتے ہو : {’’ أَعَلِمْتَ أَنَّ فُلاَنًا فَعَلَ كَذَا ‘‘} ’’کیا تمھیں معلوم م ہے کہ فلاں نے اس طرح کیا۔‘‘ یعنی یقینا اس نے اس طرح کیا ہے۔ ان مفسرین کا کہنا ہے کہ اللہ تعالیٰ ان کے واقعے کا عجیب ہونا ذکر کرنے کے بعد تفصیل سے واقعہ بیان کر رہے ہیں، تاکہ مخاطب کو سننے کا شوق پیدا ہوجائے۔ یہ تفسیر بھی ہو سکتی ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {اِذْ اَوَى الْفِتْيَةُ اِلَى الْكَهْفِ …: ’’ اَوَى ‘‘ } (ض) جگہ پکڑی، پناہ لی۔ {’’ الْفِتْيَةُ ‘‘ ’’ فَتًي‘‘} کی جمع قلت ہے، جوان جو آغاز شباب میں ہوں۔ {’’ هَيِّئْ ‘‘} باب تفعیل سے امر ہے، مہیا فرما، میسر فرما، {’’ رَشَدًا ‘‘} بھلائی، رہنمائی۔ {’’ اِذْ ‘‘} یا تو {’’ كَانُوْا ‘‘} کی ظرف ہے، یا {’’ عَجَبًا ‘‘} کی اور یا {’’أُذْكُرْ‘‘} کی جو محذوف ہے، یعنی جب چند نوجوان جو اپنی مشرک قوم اور مشرک بادشاہ کے سامنے توحید کا برملا اظہار و اعلان کرنے کی وجہ سے انھیں مطلوب تھے، اپنے گھروں سے نکلے اور انھوں نے ایک پہاڑ کے کھلے غار میں پناہ لی اور اللہ تعالیٰ سے دعا کی کہ اے ہمارے رب! ہمیں اپنے پاس سے، یعنی محض اپنے فضل اور اپنی جناب سے کوئی بھی رحمت جو تو چاہے عطا فرما، جیسے موسیٰ علیہ السلام نے عرض کیا تھا : «رَبِّ اِنِّيْ لِمَاۤ اَنْزَلْتَ اِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ » [ القصص : ۲۴ ] ’’اے میرے رب! بے شک میں، جو بھلائی بھی تو میری طرف نازل فرمائے، اس کا محتاج ہوں۔‘‘ رحمت میں کھانا پینا، امن و اطمینان اور ضرورت کی ہر چیز شامل ہے۔{’’ هَيِّئْ لَنَا مِنْ اَمْرِنَا رَشَدًا ‘‘} اور ہمارے لیے اس معاملے میں کوئی رہنمائی عطا فرما کہ ہم کیا کریں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {فَضَرَبْنَا عَلٰۤى اٰذَانِهِمْ …:’’ فَضَرَبْنَا ‘‘} کا مفعول مقدر ہے، یعنی {’’حِجَابًا‘‘} ’’تو ہم نے ان کے کانوں پر پردہ ڈال دیا‘‘ یعنی ہم نے انھیں سلا دیا، تاکہ ان کی پریشانی اور گھبراہٹ ختم ہو جائے، کیونکہ نیند اس کا سب سے اچھا علاج ہے اور وہ اپنی مشرک قوم سے بھی محفوظ ہوجائیں۔ یہ عربی زبان کا ایک محاورہ ہے، کوئی سو جائے تو اسے کہتے ہیں {’’ ضُرِبَ عَلٰي آذَانِهِ ‘‘} ’’اس کے کانوں پر پردہ ڈال دیا گیا۔‘‘ اگرچہ نیند میں آنکھوں اور دوسرے اعضا پر بھی پردہ ہوتا ہے اور انھیں بیرونی دنیا کا کچھ احساس نہیں ہوتا، مگر سب سے آخر میں کانوں کا سننا بند ہوتا ہے اور انسان گہری نیند سو جاتا ہے۔ {’’ سِنِيْنَ عَدَدًا ‘‘} گنتی کے کئی سال، جن کا شمار آگے آ رہا ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) { ثُمَّ بَعَثْنٰهُمْ لِنَعْلَمَ اَيُّ الْحِزْبَيْنِ … : ’’بَعَثَ‘‘} کا معنی کسی ساکن چیز کو حرکت میں لانا ہے۔ یہ لفظ مردہ کو زندہ کرنے اور سوئے ہوئے کو جگانے کے لیے آتا ہے، یعنی پھر ہم نے انھیں اٹھایا، تاکہ ہم معلو م کریں کہ ان سونے والوں کے دو گروہوں میں سے کون سا گروہ ہے جو اپنے وہاں ٹھہرنے کی مدت کو زیادہ یاد رکھنے والا ہے۔ یہ ترجمہ اس وقت ہے جب {’’اَحْصٰى ‘‘} کو اسم تفضیل مانیں اور یہ معنی راجح ہے، کیونکہ باب افعال سے بھی {’’أَفْعَلُ‘‘} کے وزن پر اسم تفضیل آ جاتا ہے۔ دوسرا معنی اس صورت میں ہے کہ {’’ اَحْصٰى ‘‘} کو ماضی معروف قرار دیں، اس وقت معنی یہ ہو گا کہ دونوں گروہوں میں سے کون ہے جس نے اس مدت کو یاد رکھا ہے جو وہ ٹھہرے ہیں۔ یاد رہے کہ اللہ تعالیٰ کو گزشتہ، موجودہ اور آئندہ ہر چیز کا علم ہے کہ کیا ہوا، کیا ہو رہا ہے اور کیا ہو گا، مگر ظاہر ہے کہ یہ علم کہ فلاں کام واقع ہو چکا ہے، اسی وقت ہو سکتا ہے جب وہ کام واقع ہو جائے، یعنی تاکہ ہم اپنے علم کے مطابق اس کا واقع ہونا جان لیں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ { نَحْنُ نَقُصُّ عَلَيْكَ نَبَاَهُمْ بِالْحَقِّ:} اس سے معلوم ہوتا ہے کہ یہ واقعہ مشہور تھا، مگر اس میں بہت سی خرافات اور غلط باتیں شامل تھیں، اس لیے فرمایا کہ ہم تجھ سے ان کا واقعہ ٹھیک ٹھیک بیان کرتے ہیں۔ ¤ ➋ { اِنَّهُمْ فِتْيَةٌ …:} حافظ ابن کثیر رحمہ اللہ کے بیان کا خلاصہ یہ ہے، اللہ تعالیٰ نے بیان فرمایا کہ وہ چند نوجوان تھے اور نوجوان بوڑھوں کی نسبت حق کو زیادہ قبول کرنے والے ہوتے ہیں، اسی لیے اللہ اور اس کے رسول کی دعوت پر لبیک کہنے والے اکثر نوجوان تھے۔ قریش کے بوڑھے بزرگ اپنے دین ہی پر باقی رہے، ان میں سے بہت کم ہی ایمان لائے۔ کئی ایک ائمہ مثلاً بخاری رحمہ اللہ وغیرہ نے {’’ وَ زِدْنٰهُمْ هُدًى ‘‘} (اور ہم نے انھیں ہدایت میں زیادہ کر دیا) سے استدلال فرمایا کہ ایمان زیادہ ہوتا ہے اور کم بھی۔ امام بخاری رحمہ اللہ نے اس کے لیے آٹھ آیات اور بہت سی احادیث بیان فرمائی ہیں۔ اتنی واضح آیات و احادیث کو پڑھ کر بھی کئی حضرات اڑے ہوئے ہیں کہ اصل ایمان میں سب برابر ہیں، وہ نہ کم ہوتا ہے نہ بڑھتا ہے، ہمارا اور ابوبکر رضی اللہ عنہ اور جبرائیل علیہ السلام سب کا ایمان برابر ہے۔ اللہ تعالیٰ انھیں اپنے نبی کی بات پر {’’سَمِعْنَا وَ آمَنَّا‘‘ } کہنے کی توفیق عطا فرمائے۔ (آمین) ¤ ➌ { اٰمَنُوْا بِرَبِّهِمْ :} یعنی یہ چند جوان تھے جو اپنی قوم کے اونچے طبقے سے تعلق رکھتے تھے، جیسا کہ ان کے کھانا منگواتے ہوئے سب سے ستھرا کھانا رکھنے والے شخص سے کھانا منگوانے کی فرمائش سے ظاہر ہو رہا ہے۔ ان کی قوم اور بادشاہ مشرک بت پرست تھے، مگر یہ نوجوان بت پرستی چھوڑ کر اپنے رب کی توحید پر پختہ اور خالص ایمان لے آئے اور اس پر ڈٹ گئے اور اللہ کی خاطر خویش و اقارب، مال و منال اور وطن کو چھوڑ کر ہجرت کر گئے تو اللہ تعالیٰ نے انھیں اور زیادہ ہدایت و ایمان سے نواز دیا۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ {وَ رَبَطْنَا عَلٰى قُلُوْبِهِمْ : ’’ رَبْطٌ ‘‘ } کا معنی باندھنا ہے، یعنی بادشاہ اور قوم کے ڈر سے جس گھبراہٹ اور پریشانی کا خطرہ تھا اس سے بچانے کے لیے ہم نے ان کے دلوں پر بند باندھ دیا، جس سے وہ مضبوط ہو گئے، جس طرح بکھری ہوئی چیزیں گٹھڑی میں ڈال کر ان کو گرہ لگا کر مضبوطی سے باندھ دیا جائے تو وہ بکھرنے سے بچ جاتی ہیں، اسی طرح اللہ تعالیٰ کے ان کے دلوں پر بند باندھ دینے سے وہ حق گوئی کے وقت ہر قسم کے خوف سے محفوظ ہو گئے۔ ¤ ➋ { اِذْ قَامُوْا فَقَالُوْا رَبُّنَا رَبُّ السَّمٰوٰتِ وَ الْاَرْضِ … :} یعنی جب وہ بادشاہ کے سامنے اس کے بھرے دربار میں کھڑے ہوئے اور انھوں نے صاف اعلان کر دیا کہ ہم نہ بادشاہ کو اپنا رب مانتے ہیں نہ تمھارے بتوں کو، بلکہ ان سے ہزاروں لاکھوں سال پہلے موجود آسمانوں اور زمین کے رب کو اپنا رب مانتے ہیں۔ یہ توحیدِ ربوبیت کا اعلان تھا کہ رب صرف ایک ہے۔ ’’اور ہم اس کے سوا کسی معبود کو ہر گز نہ پکاریں گے‘‘ یہ توحید الوہیت کا اعلان ہے کہ ہم عبادت بھی صرف اسی کی کریں گے، اسی سے دعا، اسی سے امید اور اسی سے خوف رکھیں گے۔ اگر ہم بادشاہ کو یا اس کے بتوں کو رب یامعبود مانیں تو اس وقت ہم بہت بڑی زیادتی کی بات کہیں گے۔ {’’ شَطَطًا ‘‘} پر تنوین تعظیم کی ہے، کیونکہ شرک سے بڑھ کر نہ کوئی ظلم ہے نہ زیادتی۔ گویا یہ آیت اور سورۂ لقمان (۱۳) میں لقمان علیہ السلام کا قول : «اِنَّ الشِّرْكَ لَظُلْمٌ عَظِيْمٌ»ہم معنی ہیں۔ {’’ اِذْ قَامُوْا ‘‘} کا ایک معنی یہ بھی ہے کہ جب انھوں نے اپنی قوم کے باطل عقائد و اعمال چھوڑنے کا پختہ عزم کر لیا اور توحید کی دعوت لے کر اٹھ کھڑے ہوئے اور وہ تقریر کی جو آگے مذکور ہے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ {هٰۤؤُلَآءِ قَوْمُنَا اتَّخَذُوْا مِنْ دُوْنِهٖۤ اٰلِهَةً …: } انھوں نے صرف توحید کے اعلان پر اکتفا نہیں کیا بلکہ اپنی قوم کے فعل کا رد بھی فرمایا کہ یہ ہماری قوم کے لوگ اللہ کے سوا کسی اور کی عبادت کی کوئی دلیل کیوں نہیں پیش کرتے۔ معلوم ہوا یہ اپنے دعویٰ میں سراسر جھوٹے ہیں۔ چند آیات جن میں مشرکین سے شرک کی دلیل کا مطالبہ کیا گیا ہے، دیکھیے انعام (۱۴۸) اور احقاف (۴)۔ ¤ ➋ { فَمَنْ اَظْلَمُ …:} یعنی اللہ کے سوا دوسروں کو پکارنا محض جھوٹ ہے اور جو اللہ پر جھوٹ باندھے اس سے بڑا ظالم کون ہے؟"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { وَ اِذِ اعْتَزَلْتُمُوْهُمْ وَ مَا يَعْبُدُوْنَ …:’’ مِرْفَقًا ‘‘’’ اَلْاِرْتِفَاقُ‘‘} کا معنی فائدہ اٹھانا ہے، یعنی کوئی سہولت، آسانی۔ ان کی قوم اور بادشاہ میں سے کسی نے ان کی دعوت قبول نہ کی تو انھوں نے مشورہ کیا کہ جب تم ان لوگوں سے اور ان کے معبودوں سے علیحدہ ہو چکے تو اب یہاں رہ کر جان یا ایمان بچانا مشکل ہے، اس لیے کسی پہاڑ کے کھلے غار میں پناہ لے لو۔ رہا کھانا پینا اور دوسری ضروریات زندگی تو جب تم اپنے رب کی راہ میں ہجرت کر رہے ہو تو وہ خود اپنی رحمت کا دامن پھیلا دے گا اور ہر معاملے میں تمھارے لیے آسانی مہیا فرمائے گا۔ اللہ تعالیٰ نے قرآن مجید میں بھی اس کا وعدہ فرمایا ہے۔ دیکھیے سورۂ نساء (۱۰۰) باہمی مشورے سے یہ فیصلہ کرکے وہ ایک پہاڑ کے کھلے غار میں جا بیٹھے، نیند غالب آئی تو سو گئے۔معلوم ہوا کہ جب معاشرے میں رہ کر دین پر عمل ممکن نہ رہے تو ہجرت کے لیے پہاڑ ہی بہترین مقام ہیں، چنانچہ ہمارے نبی صلی اللہ علیہ وسلم نے فرمایا : [ يُوْشِكُ أَنْ يَّكُوْنَ خَيْرَ مَالِ الْمُسْلِمِ غَنَمٌ يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ، وَمَوَاقِعَ الْقَطْرِ، يَفِرُّ بِدِيْنِهِ مِنَ الْفِتَنِ ] [ بخاري، الإیمان، باب من الدین الفرار من الفتن : ۱۹، عن أبي سعید الخدری رضی اللہ عنہ ] ’’قریب ہے کہ مسلمان کا بہترین مال چند بکریاں ہوں گی، جن کو لے کر وہ پہاڑوں کی چوٹیوں اور بارش کے مقامات کے پیچھے پھرتا رہے گا، اپنے دین کو فتنوں سے بچانے کے لیے بھاگتا پھرے گا۔‘‘ جب کفار مکہ نے ہمارے نبی صلی اللہ علیہ وسلم کو قتل کرنے کا منصوبہ طے کر لیا تو آپ صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کے ہمراہ تین راتیں غار ثور میں چھپے رہے اور اللہ تعالیٰ نے آپ کو کفار سے محفوظ رکھا۔ دیکھیے سورۂ توبہ (۴۰)۔ ¤ ➋ بعض لوگوں نے اس سے عزلت یعنی لوگوں سے علیحدگی اختیار کرنے کا استدلال کیا ہے، حالانکہ اصحابِ کہف نے کفار سے علیحدگی اختیار کی، اپنوں سے نہیں، بلکہ آپس میں تو وہ اکٹھے ہی رہے۔ اسلام میں رہبانیت کی کوئی گنجائش ہی نہیں۔(قاسمی)"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {وَ تَرَى الشَّمْسَ اِذَا طَلَعَتْ …:} یعنی ان کے غار کا منہ شمال کی طرف تھا، جب سورج چڑھتا تو دھوپ دائیں طرف ہو جاتی اور غروب کے وقت بائیں طرف ہو جاتی تھی۔ ان کے بدن غار کے کشادہ حصے میں سورج کی تیز شعاؤں سے محفوظ تھے۔ ¤ ➋ { مَنْ يَّهْدِ اللّٰهُ فَهُوَ الْمُهْتَدِ : ’’هُوَ‘‘} معرفہ کے بعد خبر {’’ الْمُهْتَدِ ‘‘} بھی معرفہ ہے، اس سے حصر کا معنی حاصل ہوا، یعنی جسے اللہ سیدھی راہ پر چلائے سو وہی سیدھی راہ پانے والا ہے، جیسا کہ اصحابِ کہف کو ایمان کی نعمت، پھر اعلان حق کی ہمت، پھر ہجرت کی توفیق اور غار میں جانے کا راستہ عطا فرمایا، جہاں زندہ رہنے کے لیے دھوپ اور ہوا کی جس مقدار میں ضرورت تھی موجود تھی اور وہ لوگوں کی نگاہوں اور دشمن کی دسترس سے بھی محفوظ رہے۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { وَ تَحْسَبُهُمْ اَيْقَاظًا وَّ هُمْ رُقُوْدٌ : ’’ اَيْقَاظًا ‘‘} جمع ہے {’’يَقِظٌ‘‘} کی اور {’’ رُقُوْدٌ ‘‘} جمع ہے {’’رَاقِدٌ‘‘} کی، یعنی یہ اللہ تعالیٰ کی قدرت کا عجیب کرشمہ ہے کہ تم انھیں دیکھو تو سمجھو گے کہ جاگ رہے ہیں، حالانکہ وہ سوئے ہوئے ہیں، یعنی سوتے میں آنکھیں کھلی ہونے اور کروٹیں بدلنے کی وجہ سے تم انھیں جاگتے ہوئے سمجھو گے۔ اور ہم دائیں اور بائیں ان کی کروٹ بدلتے رہتے ہیں، تاکہ ایک ہی پہلو پر پڑے رہنے سے مٹی ان کے بدنوں کو نہ کھا جائے اور ان کا کتا اپنے دونوں بازو دہلیز پر پھیلائے ہوئے ہے، جیسے پہرا دے رہا ہے۔ ایک الگ تھلگ غار میں ان کا اس طرح لیٹا ہونا اور چوکھٹ پر کتے کا بیٹھا ہونا ایک ایسا دہشت ناک منظر پیش کرتا تھا کہ اگر کوئی شخص اندر جھانکنے کی کوشش بھی کرتا تو خوف کے مارے بھاگ کھڑا ہوتا، یہ سب اللہ تعالیٰ کی طرف سے انھیں ایک لمبی مدت تک آرام و سکون سے سلائے رکھنے کا انتظام تھا۔ ¤ ➋ کتے کے دہلیز پر بیٹھے رہنے اور غار میں نہ جانے کی وجہ یہ معلوم ہوتی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيْهِ كَلْبٌ وَلاَ تَصَاوِيْرُ ] [ بخاری، اللباس، باب التصاویر : ۵۹۴۹ ] ’’فرشتے اس گھر میں داخل نہیں ہوتے جہاں کتا یا تصویر ہو۔‘‘ البتہ کھیتی کے لیے، مویشیوں کی حفاظت کے لیے اور شکار کے لیے کتا رکھنے کی اجازت ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 20،19) ➊ {وَ كَذٰلِكَ بَعَثْنٰهُمْ …:} یعنی جیسے ہم نے انھیں ایک حیرت انگیز طریقے سے غار کے اندر سلایا تھا اسی طرح انھیں اٹھا دیا کہ ان کے جسم صحیح سالم تھے، ان میں کوئی تبدیلی نہ آئی تھی، تاکہ وہ آپس میں ایک دوسرے سے سوال کریں اور جب انھیں پتا چلے کہ وہ اتنی لمبی مدت سونے کے بعد بیدار ہوئے ہیں تو انھیں ہماری قدرت کا اور مردوں کو زندہ کرنے کا اپنی ذات میں عملی مشاہدہ ہو جائے، ان کا ایمان و یقین مزید مضبوط ہو جائے اور وہ اللہ تعالیٰ کی نعمت پر اس کا شکر ادا کریں۔ ¤ ➋ { قَالَ قَآىِٕلٌ مِّنْهُمْ كَمْ لَبِثْتُمْ … :} حافظ ابن کثیر رححمہ اللہ نے فرمایا : ’’معلوم ہوتا ہے کہ وہ غار میں دن کے پہلے پہر داخل ہوئے تھے اور دن کے آخری حصے میں بیدار ہوئے۔ اس لیے اس سوال کے جواب میں کہ تم کتنی مدت یہاں ٹھہرے، کسی نے ایک دن اور کسی نے دن کا کچھ حصہ کہا، مگر جب غار کے اردگرد کا عالم بالکل ہی بدلا ہوا نظر آیا تو کہنے لگے، تمھارا رب زیادہ جانتا ہے کہ تم کتنی مدت ٹھہرے ہو۔‘‘ ¤ ➌ اس آیت سے معلوم ہوا کہ نہ پہلے سوال کرنے والے ولی کو وہاں ٹھہرنے کی مدت کا علم تھا، نہ دوسرے ولیوں کو، جب کہ کئی لوگ اپنے ائمہ اور اولیاء کو {’’مَا كَانَ وَمَا يَكُوْنُ‘‘} (جو ہو چکا اور جو ہو گا) کا جاننے والا سمجھتے ہیں۔ ¤ ➍ یہ بھی معلوم ہوا کہ اللہ کے نیک بندے بھی بعض اوقات اندازے اور گمان سے کوئی بات کہہ دیتے ہیں، مگر ایسی بات میں وہ اصل علم اللہ کے حوالے کرنے سے غفلت نہیں کرتے۔ ¤ ➎ { فَابْعَثُوْۤا اَحَدَكُمْ بِوَرِقِكُمْ هٰذِهٖۤ … :} غار میں ٹھہرنے کی مدت پر بحث کے بعد جب وہ کسی نتیجے پر نہ پہنچ سکے تو انھوں نے اصل مدت کے اندازے کے لیے اپنے کسی ایک ساتھی کو چاندی (کا سکہ) دے کر شہر بھیجنے کا فیصلہ کیا اور اسے چند باتوں کا خیال رکھنے کی تاکید کی۔ ایک یہ کہ کھانا لاتے وقت یہ دیکھ لے کہ شہر میں سب سے ستھرا کھانا کس کا ہے، اس سے تمھارے لیے کچھ کھانا لے آئے۔ {’’ اَزْكٰى ‘‘} کا معنی سب سے پاکیزہ، سب سے ستھرا ہے، اس میں کھانے کا حلال و طیب ہونا بھی شامل ہے اور سب سے صاف ستھرا ہونا بھی۔ معلوم ہوا کہ یہ نوجوان شہزادے تھے، یا امراء و وزراء کے چشم و چراغ تھے، جو شہر کے سب سے ستھرے ہوٹل سے کم پر راضی نہ تھے۔ دوسری بات یہ کہ نرمی اور باریک بینی کی کوشش کرے، کیونکہ سختی سے کام بگڑ جاتے ہیں اور باریک بینی اختیار نہ کرنے سے راز کھل جاتے ہیں اور مطلوبہ معلومات بھی حاصل نہیں ہوتیں۔ کوشش کا مفہوم {’’ وَ لْيَتَؔلَطَّفْ ‘‘} (باب تفعل) سے ظاہر ہو رہا ہے اور ’’لطف‘‘ کے مفہوم میں نرمی اور باریک بینی دونوں شامل ہیں۔ تیسری تاکید یہ کی کہ تمھارے بارے میں کسی کو ہر گز معلوم نہ ہونے دے۔ کیونکہ اگر مشرکین کو تمھارا پتا چل گیا تو وہ تمھیں سنگ سار کر دیں گے، یا جبراً تمھیں دوبارہ اپنے مشرکانہ دین میں واپس لے آئیں گے۔ ایسی صورت میں تم کبھی فلاح نہ پا سکو گے، کیونکہ مشرکوں پر اللہ نے جنت حرام کر دی ہے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20،19) ➊ {وَ كَذٰلِكَ بَعَثْنٰهُمْ …:} یعنی جیسے ہم نے انھیں ایک حیرت انگیز طریقے سے غار کے اندر سلایا تھا اسی طرح انھیں اٹھا دیا کہ ان کے جسم صحیح سالم تھے، ان میں کوئی تبدیلی نہ آئی تھی، تاکہ وہ آپس میں ایک دوسرے سے سوال کریں اور جب انھیں پتا چلے کہ وہ اتنی لمبی مدت سونے کے بعد بیدار ہوئے ہیں تو انھیں ہماری قدرت کا اور مردوں کو زندہ کرنے کا اپنی ذات میں عملی مشاہدہ ہو جائے، ان کا ایمان و یقین مزید مضبوط ہو جائے اور وہ اللہ تعالیٰ کی نعمت پر اس کا شکر ادا کریں۔ ¤ ➋ { قَالَ قَآىِٕلٌ مِّنْهُمْ كَمْ لَبِثْتُمْ … :} حافظ ابن کثیر رححمہ اللہ نے فرمایا : ’’معلوم ہوتا ہے کہ وہ غار میں دن کے پہلے پہر داخل ہوئے تھے اور دن کے آخری حصے میں بیدار ہوئے۔ اس لیے اس سوال کے جواب میں کہ تم کتنی مدت یہاں ٹھہرے، کسی نے ایک دن اور کسی نے دن کا کچھ حصہ کہا، مگر جب غار کے اردگرد کا عالم بالکل ہی بدلا ہوا نظر آیا تو کہنے لگے، تمھارا رب زیادہ جانتا ہے کہ تم کتنی مدت ٹھہرے ہو۔‘‘ ¤ ➌ اس آیت سے معلوم ہوا کہ نہ پہلے سوال کرنے والے ولی کو وہاں ٹھہرنے کی مدت کا علم تھا، نہ دوسرے ولیوں کو، جب کہ کئی لوگ اپنے ائمہ اور اولیاء کو {’’مَا كَانَ وَمَا يَكُوْنُ‘‘} (جو ہو چکا اور جو ہو گا) کا جاننے والا سمجھتے ہیں۔ ¤ ➍ یہ بھی معلوم ہوا کہ اللہ کے نیک بندے بھی بعض اوقات اندازے اور گمان سے کوئی بات کہہ دیتے ہیں، مگر ایسی بات میں وہ اصل علم اللہ کے حوالے کرنے سے غفلت نہیں کرتے۔ ¤ ➎ { فَابْعَثُوْۤا اَحَدَكُمْ بِوَرِقِكُمْ هٰذِهٖۤ … :} غار میں ٹھہرنے کی مدت پر بحث کے بعد جب وہ کسی نتیجے پر نہ پہنچ سکے تو انھوں نے اصل مدت کے اندازے کے لیے اپنے کسی ایک ساتھی کو چاندی (کا سکہ) دے کر شہر بھیجنے کا فیصلہ کیا اور اسے چند باتوں کا خیال رکھنے کی تاکید کی۔ ایک یہ کہ کھانا لاتے وقت یہ دیکھ لے کہ شہر میں سب سے ستھرا کھانا کس کا ہے، اس سے تمھارے لیے کچھ کھانا لے آئے۔ {’’ اَزْكٰى ‘‘} کا معنی سب سے پاکیزہ، سب سے ستھرا ہے، اس میں کھانے کا حلال و طیب ہونا بھی شامل ہے اور سب سے صاف ستھرا ہونا بھی۔ معلوم ہوا کہ یہ نوجوان شہزادے تھے، یا امراء و وزراء کے چشم و چراغ تھے، جو شہر کے سب سے ستھرے ہوٹل سے کم پر راضی نہ تھے۔ دوسری بات یہ کہ نرمی اور باریک بینی کی کوشش کرے، کیونکہ سختی سے کام بگڑ جاتے ہیں اور باریک بینی اختیار نہ کرنے سے راز کھل جاتے ہیں اور مطلوبہ معلومات بھی حاصل نہیں ہوتیں۔ کوشش کا مفہوم {’’ وَ لْيَتَؔلَطَّفْ ‘‘} (باب تفعل) سے ظاہر ہو رہا ہے اور ’’لطف‘‘ کے مفہوم میں نرمی اور باریک بینی دونوں شامل ہیں۔ تیسری تاکید یہ کی کہ تمھارے بارے میں کسی کو ہر گز معلوم نہ ہونے دے۔ کیونکہ اگر مشرکین کو تمھارا پتا چل گیا تو وہ تمھیں سنگ سار کر دیں گے، یا جبراً تمھیں دوبارہ اپنے مشرکانہ دین میں واپس لے آئیں گے۔ ایسی صورت میں تم کبھی فلاح نہ پا سکو گے، کیونکہ مشرکوں پر اللہ نے جنت حرام کر دی ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ {وَ كَذٰلِكَ اَعْثَرْنَا عَلَيْهِمْ …:} یعنی جس طرح ہم نے انھیں ثابت قدم رکھا اور حیرت انگیز طریقے سے سلائے رکھا اسی طرح ہم نے شہر والوں کو ان کی حقیقت حال اور جگہ سے مطلع کر دیا۔ بہت سے مفسرین کا بیان ہے اور واقعہ کی صورت خود بخود بھی یہ معلوم ہوتی ہے کہ جب وہ شخص کھانا خریدنے کے لیے روانہ ہوا تو اس نے دیکھا کہ شہر کے راستے، لوگوں کی تہذیب، رہن سہن، زبان اور لباس ہر چیز بدل چکی ہے، اس نے خیال کیا کہ شاید میں پاگل ہو گیا ہوں یا خواب دیکھ رہا ہوں۔ بالآخر وہ شہر پہنچا اور ایک دکاندار سے کھانا خریدنے لگا اور اس نے سکہ نکالا تو دکاندار ششدر رہ گیا اور اس نے ایک دوسرے دکاندار کو بلایا، بالآخر کچھ لوگ جمع ہو گئے اور انھیں شک گزرا کہ شاید اس شخص کو کہیں سے پرانا خزانہ ہاتھ لگا ہے۔ مگر جب اس نے بتایا کہ میں اسی شہر کا رہنے والا ہوں اور کل ہی یہاں فلاں بادشاہ کو چھوڑ کر گیا ہوں تو لوگوں کی حیرت اور بڑھ گئی اور وہ اسے پکڑ کر بادشاہ کے پاس لے آئے۔ وہاں جب پوچھ گچھ ہوئی تو سب معاملہ کھل گیا، اس لیے اصحابِ کہف کو دیکھنے اور انھیں سلام کرنے کے لیے بادشاہ اور اس کے ساتھ لوگوں کا ایک ہجوم غار پر پہنچ گیا۔ شہر جانے والا ساتھی اندر داخل ہو گیا اور سارے ساتھی دوبارہ لیٹ گئے، اسی حال میں اللہ تعالیٰ نے ان کی روح قبض کر لی۔ دلیل اس کی یہ ہے کہ اللہ تعالیٰ نے ان کا وہاں تین سو نو (۳۰۹) سال ٹھہرنا بیان فرمایا ہے، اگر وہ اس کے بعد بھی زندہ ہوتے تو ان پر عمارت بنانے یا مسجد بنانے کا سوال ہی پیدا نہیں ہوتا تھا، بلکہ ان کی کرامت دیکھنے والے خوش عقیدہ لوگ انھیں شہر لے جاتے اور ہر طرح ان کی خدمت بجا لاتے۔ ¤ ➋ اس آیت سے کئی ساتھیوں کا مال برابر جمع کرکے کھانے وغیرہ کے لیے اکٹھا خرچ کرنا ثابت ہوتا ہے، خواہ کوئی کم کھاتا ہو یا زیادہ اور یہ آیت اس بات کی بھی دلیل ہے کہ کسی کو اپنا نائب یا وکیل بنایا جا سکتا ہے۔ ¤ ➌ { لِيَعْلَمُوْۤا اَنَّ وَعْدَ اللّٰهِ حَقٌّ … :} یعنی ان پر مطلع ہونے والے شہر کے لوگوں کو یقین آ جائے کہ اللہ تعالیٰ کا وعدہ سچا ہے اور قیامت کے آنے میں کوئی شک نہیں۔ ¤ ➍ {اِذْ يَتَنَازَعُوْنَ بَيْنَهُمْ … :} یعنی ہم نے شہر والوں کو ان پر اس وقت مطلع کیا جب وہ آپس میں اپنے معاملے میں جھگڑ رہے تھے۔ کوئی کہتا تھا کہ مر کر جی اٹھنا برحق ہے، کوئی اس کا انکار کرتا تھا، کوئی کہتا کہ حشر صرف روح کا ہو گا بدن کا نہیں۔ مگر اللہ تعالیٰ نے انھیں اصحابِ کہف کا حال آنکھوں سے دکھا کر یقین دلا دیا کہ قیامت آئے گی اور حشر بدن اور روح دونوں کا ہو گا۔ {’’اِذْ يَتَنَازَعُوْنَ بَيْنَهُمْ اَمْرَهُمْ ‘‘} کا معنی یہ بھی ہو سکتا ہے کہ جب شہر والے اصحابِ کہف کے بارے میں جھگڑ رہے تھے کہ یہ کون لوگ تھے؟ غار میں کب آئے؟ کتنی دیر سوئے رہے؟ اب ان کے مرنے پر ان کے ساتھ کیا کیا جائے؟ بعض نے کہا، ان پر دیوار بنا کر غار کا منہ بند کر دیں۔ بعض نے کہا، ان پر ایک عمارت ان کی یادگار کے طور پر بنا دیں۔ ¤ ➎ { رَبُّهُمْ اَعْلَمُ بِهِمْ :} یعنی اصحابِ کہف اور شہر والوں کے احوال ان کا رب بہتر جانتا ہے۔ ¤ ➏ { قَالَ الَّذِيْنَ غَلَبُوْا عَلٰۤى اَمْرِهِمْ … :} جن لوگوں کے پاس غلبہ و اقتدار تھا وہ کہنے لگے کہ ہم تو ضرور ان پر ایک مسجد بنائیں گے اور اس طرح ان کی یاد گار کو باقی رکھیں گے۔ گزشتہ قوموں میں اسی راستے سے شرک داخل ہوتا رہا اور اب بھی شرک کے سب سے بڑے مراکز انھی قبروں پر تعمیر شدہ عمارتیں مثلاً خانقاہیں وغیرہ یا مسجدیں ہی ہیں۔ عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی اس بیماری میں فرمایا جس میں آپ فوت ہوئے : [ لَعَنَ اللّٰهُ الْيَهُوْدَ وَالنَّصَارَی اتَّخَذُوْا قُبُوْرَ أَنْبِيَائِهِمْ مَسَاجِدَ ] [ بخاری، الجنائز، باب ما یکرہ من اتخاذ المساجد… : ۱۳۳۰۔ مسلم : ۵۲۹ ] ’’اللہ یہود و نصاریٰ پر لعنت کرے، انھوں نے اپنے انبیاء کی قبروں کو مسجدیں بنا لیا۔‘‘ جندب رضی اللہ عنہ نے فرمایا کہ میں نے نبی صلی اللہ علیہ وسلم سے آپ کے فوت ہونے سے پانچ دن پہلے سنا، آپ نے فرمایا : [ أَلَا وَإِنَّ مَنْ كَانَ قَبْلَكُمْ كَانُوْا يَتَّخِذُوْنَ قُبُوْرَ أَنْبِيَائِهِمْ وَصَالِحِيْهِمْ مَسَاجِدَ، أَلَا فَلاَ تَتَّخِذُوا الْقُبُوْرَ مَسَاجِدَ، إِنِّيْ أَنْهَاكُمْ عَنْ ذٰلِكَ ] [ مسلم، المساجد، باب النہي عن بناء المساجد علی القبور… : ۵۳۲ ] ’’جان لو! جو لوگ تم سے پہلے تھے وہ اپنے نبیوں اور صالحین کی قبروں کو مسجدیں بنا لیتے تھے، سن لو کہ تم قبروں کو مسجدیں نہ بنانا، میں تمھیں اس سے منع کرتا ہوں۔‘‘ ¤ ایک حدیث میں آپ صلی اللہ علیہ وسلم نے ایسا کرنے والوں کو اللہ کے ہاں سب سے بدتر مخلوق قرار دیا، فرمایا : [ فَأُولٰئئِكَ شِرَارُ الْخَلْقِ عِنْدَ اللّٰهِ يَوْمَ الْقِيَامَةِ ] [ بخاري، الصلاۃ، باب ھل تنبش قبور مشرکي الجاھلیۃ … : ۴۲۷۔ مسلم : ۵۲۸، عن عائشۃ رضی اللہ عنہا ] ¤ ان احادیث میں قبروں پر مسجدیں بنانے سے مراد ان کے پاس مسجدیں بنانا ہے، کیونکہ یہود و نصاریٰ کے عبادت خانے ان کے انبیاء و اولیاء کی قبروں کے پاس ہوا کرتے تھے۔ افسوس کہ بعض مسلمانوں نے یہ تکلف بھی ختم کرکے اپنے بزرگوں کی قبریں عین مسجدوں کے اندر بنانا شروع کر دیں۔ ان لوگوں کی کوئی مسجد کم ہی کسی نہ کسی قبر سے خالی نظر آئے گی، ان کے مولویوں نے اس بدترین فعل کے جواز کے لیے زیر تفسیر آیت کو دلیل بنا لیا، حالانکہ اس میں صرف یہ ذکر ہے کہ ان کے غالب اور بااثر لوگوں نے یہ کہا۔ رہی یہ بات کہ انھوں نے درست کہا یا غلط، اس کی وضاحت رسول اللہ صلی اللہ علیہ وسلم نے فرما دی، چنانچہ جابر رضی اللہ عنہ بیان کرتے ہیں : [ نَهٰی رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ أَنْ يُّجَصَّصَ الْقَبْرُ، وَأَنْ يُّقْعَدَ عَلَيْهِ، وَأَنْ يُّبْنٰی عَلَيْهِ ] [ مسلم، الجنائز، باب النھي عن تجصیص القبر…:۹۷۰ ]’’رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع فرمایا کہ قبر چونا گچ (سیمنٹڈ) بنائی جائے اور اس سے کہ اس پر بیٹھا جائے اور اس سے کہ اس پر عمارت بنائی جائے۔‘‘ بلکہ آپ صلی اللہ علیہ وسلم نے ایسی قبروں کو برابر کرنے کا حکم دیا۔ چنانچہ ابو الہیاج الاسدی، علی رضی اللہ عنہ کے داماد فرماتے ہیں کہ علی بن ابی طالب رضی اللہ عنہ نے مجھ سے فرمایا : [ أَلاَ أَبْعَثُكَ عَلٰی مَا بَعَثَنِیْ عَلَيْهِ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ؟ أَنْ لاَّ تَدَعَ تِمْثَالاً إِلَّا طَمَسْتَهُ وَلاَ قَبْرًا مُشْرِفًا إِلاَّ سَوَّيْتَهُ ] [ مسلم، الجنائز، باب الأمر بتسویۃ القبر : ۹۶۹ ] ’’کیا میں تمھیں اس کام پر مقرر نہ کروں جس پر مجھے رسول اللہ صلی اللہ علیہ وسلم نے مقرر فرمایا؟ وہ یہ ہے کہ کوئی مورتی نہ چھوڑ جسے تو مٹا نہ دے اور نہ کوئی اونچی قبر جسے تو برابر نہ کر دے۔‘‘ اللہ کی حکمت دیکھیے کہ رسول اللہ صلی اللہ علیہ وسلم نے قبریں برابر کرنے پر اس شخص کو مقرر فرمایا جس کے نام لیواؤں نے سب سے زیادہ قبروں کو پختہ اور اونچا بنانا تھا، تاکہ کسی کے پاس کوئی عذر باقی نہ رہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {سَيَقُوْلُوْنَ ثَلٰثَةٌ رَّابِعُهُمْ كَلْبُهُمْ … :} اس سے معلوم ہوتا ہے کہ نزول قرآن کے وقت اہل کتاب میں اور ان کے ذریعے سے مشرکین عرب میں اصحابِ کہف سے متعلق طرح طرح کی باتیں موجود تھیں، مگر مستند معلومات کسی کے پاس نہ تھیں۔ ¤ ➋ اصحابِ کہف کے ناموں کے بارے میں کوئی صحیح مرفوع روایت نہیں ہے۔ ناموں کی صراحت غالباً اسرائیلی کتب تواریخ سے ماخوذ ہے اور ان اسماء کے تلفظ میں بھی بہت اختلاف ہے، کسی قول پر بھی اعتماد نہیں ہو سکتا۔ (فتح الباری) پھر بعض لوگ ان ناموں کے خواص اور فائدے بیان کرتے ہیں اور مختلف بیماریوں کے لیے ان کو لکھتے ہیں جو کسی صورت بھی صحیح نہیں، بلکہ اگر ’’یا‘‘ حرف ندا کے ساتھ لکھے جائیں، یا ان ناموں میں نفع پہنچانے یا نقصان سے بچانے کی تاثیر کا عقیدہ رکھا جائے تو صاف شرک ہے۔ عجیب بات ہے کہ اس بارے میں بعض روایات بھی گھڑ لی گئی ہیں جو ابن عباس اور دیگر اصحاب رضی اللہ عنھم کی طرف منسوب ہیں، مگر ان میں سے کوئی روایت بھی ابن عباس رضی اللہ عنہما یا سلف صالحین سے ثابت نہیں۔ نواب صدیق حسن خاں رحمہ اللہ نے اپنی تفسیر میں ان ناموں کے ساتھ علاج کی تردید کی ہے۔ ¤ ➌ نبی صلی اللہ علیہ وسلم کے زمانے کے اہل کتاب یہ تو جانتے تھے کہ کسی زمانے میں یہ واقعہ ہوا ہے، مگر وہ اس کی حقیقت سے بے خبر تھے۔ اس لیے محض اٹکل سے اس کی تفصیلات بیان کرتے رہتے تھے۔ اللہ تعالیٰ نے ان کی تعداد کے متعلق ان کے دو قول ذکر فرما کر ان کی تردید فرمائی، البتہ تیسرے قول کا ذکر فرما کر کہ وہ سات تھے، اس کی تردید نہیں فرمائی، بلکہ فرمایا، کہہ دے میرا رب ان کی تعداد سے متعلق زیادہ جانتا ہے اور انھیں بہت تھوڑے لوگوں کے سوا کوئی نہیں جانتا۔ پھر اس بحث کے بے فائدہ ہونے کی طرف اشارہ کرتے ہوئے فرمایا کہ ان لوگوں سے سرسری بحث کے سوا کوئی بحث کریں، نہ ان کے متعلق ان میں سے کسی سے کچھ پوچھیں، کیونکہ ان کے پاس اس کا کچھ علم نہیں۔ اکثر اہل علم نے، جن میں ابن عباس رضی اللہ عنہما بھی ہیں، آخری قول کو صحیح قرار دیا ہے۔ شیخ الاسلام ابن تیمیہ رحمہ اللہ نے فرمایا کہ جس بات میں مختلف اقوال ہوں اسے بیان کرنے کا طریقہ یہ ہے کہ تمام اقوال ذکر کیے جائیں اور صحیح قول کی طرف اشارہ کر دیا جائے اور بحث کا فائدہ بھی بیان کیا جائے کہ اس سے کیا حاصل ہوا۔ چنانچہ اللہ تعالیٰ نے تینوں باتیں بیان فرما دیں۔ (قاسمی ملخصاً)"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 24،23) ➊ { وَ لَا تَقُوْلَنَّ لِشَايْءٍ … :} یہاں شان نزول میں ایک روایت بیان کی جاتی ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے اصحابِ کہف، روح اور ذو القرنین سے متعلق سوال کیا گیا تو آپ نے فرمایا : ’’میں تمھیں کل جواب دوں گا‘‘ اور ’’ان شاء اللہ‘‘ نہ کہا، تو پندرہ (۱۵) دن وحی رکی رہی، پھر یہ آیت اتری : «وَ لَا تَقُوْلَنَّ لِشَايْءٍ اِنِّيْ فَاعِلٌ ذٰلِكَ غَدًا (23) اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ »رازی رحمہ اللہ نے فرمایا کہ قاضی نے اسے کئی وجہوں سے بے کار قرار دیا ہے۔ قاسمی نے فرمایا کہ ان کی بات حق ہے، کیونکہ محمد بن اسحاق نے یہ روایت ایک مجہول شیخ سے بیان کی ہے، جیسا کہ ابن کثیر (اور طبری) میں اس کی سندیں موجود ہیں۔ (محاسن التاویل) ¤ ➋ اس آیت کا ایک معنی تو مشہور ہے کہ کسی کام کے متعلق یہ مت کہو کہ میں کل یہ کام کرنے والا ہوں، مگر اس کے ساتھ ’’ان شاء اللہ‘‘ ضرور کہو، کیونکہ اللہ نے چاہا تو کام ہو گا، ورنہ نہیں۔ اس کی مثال سلیمان علیہ السلام کا واقعہ ہے کہ انھوں نے کہا : [ لَأَطُوْفَنَّ اللَّيْلَةَ عَلٰي مِائَةِ امْرَأَةٍ أَوْ تِسْعٍ وَّتِسْعِيْنَ، كُلُّهُنَّ يَأْتِيْ بِفَارِسٍ يُجَاهِدُ فِيْ سَبِيْلِ اللّٰهِ فَقَالَ لَهُ صَاحِبُهُ قُلْ إِنْ شَاءَ اللّٰهُ، فَلَمْ يَقُلْ إِنْ شَاءَ اللّٰهُ، فَلَممْ تَحْمِلْ مِنْهُنَّ إِلَّا امْرَأَةٌ وَاحِدَةٌ جَاءَتْ بِشِقِّ رَجُلٍ، وَالَّذِيْ نَفْسُ مُحَمَّدٍ بِيَدِهِ ! لَوْ قَالَ إِنْ شَاءَ اللّٰهُ، لَجَاهَدُوْا فِيْ سَبِيْلِ اللّٰهِ فُرْسَانًا أَجْمَعُوْنَ ]نَ ] [ بخاري، الجہاد والسیر، باب من طلب الولد للجہاد : ۲۸۱۹ ]’’آج رات میں اپنی سو (۱۰۰) یا فرمایا ننانوے (۹۹) عورتوں کے پاس جاؤں گا اور ہر عورت ایک بیٹا جنے گی، جو جہاد فی سبیل اللہ کا شہ سوار ہو گا۔‘‘ ان کے ایک ساتھی نے کہا : ’’ان شاء اللہ کہیے۔‘‘ مگر سلیمان علیہ السلام نے (مشغولیت وغیرہ کی وجہ سے) ان شاء اللہ نہ کہا، تو ان عورتوں میں سےے صرف ایک عورت کو حمل ہوا اور وہ بھی ادھورا بیٹا ہوا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’قسم اس ذات کی جس کے ہاتھ میں محمد کی جان ہے! اگر وہ ان شاء اللہ کہتے تو سب عورتوں کے بیٹے ہوتے جو شہ سوار ہوتے اور سب اللہ کے راستے میں جہاد کرتے۔‘‘ ¤ دوسرا معنی یہ ہے کہ اے نبی! کسی کام کے بارے میں (اپنی مرضی سے) یہ مت کہیے کہ کل میں یہ کام کرنے والا ہوں، مگر یہ کہ اللہ چاہے، یعنی اللہ چاہے گا کہ آپ وہ کام کریں تو وہ آپ کو اجازت دے گا، پھر آپ اس کے اذن سے یہ کہہ سکتے ہیں۔ (قاسمی) یہ معنی {’’ اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ ‘‘ } الفاظ کے زیادہ قریب ہے اور سورۂ نجم کی آیات (۳، ۴) : «وَ مَا يَنْطِقُ عَنِ الْهَوٰى اِنْ هُوَ اِلَّا وَحْيٌ يُّوْحٰى »میں بھی یہی مفہوم ہے۔ ¤ ➌ { وَ اذْكُرْ رَّبَّكَ اِذَا نَسِيْتَ :} یعنی جب بھول جائیں تو یاد آنے پر ’’ان شاء اللہ‘‘ کہہ لیں۔ یاد رہے کہ قسم کے ساتھ ’’ان شاء اللہ‘‘ کہہ لے تو قسم پوری نہ کرنے پر کوئی کفارہ نہیں۔ بعض لوگ کہتے ہیں کہ اگر قسم سے متصل ’’ان شاء اللہ‘‘ نہ کہے تو اس کا اعتبار نہیں ہو گا، مگر یہ آیت دلیل ہے کہ اگر اس کا ارادہ ’’ان شاء اللہ‘‘ کہنے کا تھا مگر بھول کر نہیں کہہ سکا اور یاد آتے ہی اس نے کہہ لیا تو اس کا اعتبار ہو گا۔ مستدرک حاکم (۴؍۳۰۳، ح : ۷۸۳۳) میں صحیح سند کے ساتھ ابن عباس رضی اللہ عنہما کا قول مروی ہے کہ جب آد می کسی بات پر قسم کھا لے تو وہ ایک سال تک ’’ان شاء اللہ‘‘ کہہ سکتا ہے۔‘‘ ابن قیم رحمہ اللہ نے مدارج السالکین میں فرمایا : ’’یہ نسیان کی صورت میں ہے۔‘‘ (محاسن التاویل ملخصاً) ¤ ➍ {وَ قُلْ عَسٰۤى اَنْ يَّهْدِيَنِ رَبِّيْ … :} اور کہہ دیجیے کہ مجھے اپنے رب سے امید ہے کہ وہ مجھے اصحابِ کہف کی خبر سے بھی قریب تر لوگوں کی ہدایت کا باعث بننے والی خبریں بتائے گا جن سے میری رسالت ثابت ہو گی، چنانچہ اللہ تعالیٰ نے غیب کی بہت سی خبریں آپ کو بتائیں جن کی کسی کو کچھ خبر نہ تھی۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24،23) ➊ { وَ لَا تَقُوْلَنَّ لِشَايْءٍ … :} یہاں شان نزول میں ایک روایت بیان کی جاتی ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے اصحابِ کہف، روح اور ذو القرنین سے متعلق سوال کیا گیا تو آپ نے فرمایا : ’’میں تمھیں کل جواب دوں گا‘‘ اور ’’ان شاء اللہ‘‘ نہ کہا، تو پندرہ (۱۵) دن وحی رکی رہی، پھر یہ آیت اتری : «وَ لَا تَقُوْلَنَّ لِشَايْءٍ اِنِّيْ فَاعِلٌ ذٰلِكَ غَدًا (23) اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ »رازی رحمہ اللہ نے فرمایا کہ قاضی نے اسے کئی وجہوں سے بے کار قرار دیا ہے۔ قاسمی نے فرمایا کہ ان کی بات حق ہے، کیونکہ محمد بن اسحاق نے یہ روایت ایک مجہول شیخ سے بیان کی ہے، جیسا کہ ابن کثیر (اور طبری) میں اس کی سندیں موجود ہیں۔ (محاسن التاویل) ¤ ➋ اس آیت کا ایک معنی تو مشہور ہے کہ کسی کام کے متعلق یہ مت کہو کہ میں کل یہ کام کرنے والا ہوں، مگر اس کے ساتھ ’’ان شاء اللہ‘‘ ضرور کہو، کیونکہ اللہ نے چاہا تو کام ہو گا، ورنہ نہیں۔ اس کی مثال سلیمان علیہ السلام کا واقعہ ہے کہ انھوں نے کہا : [ لَأَطُوْفَنَّ اللَّيْلَةَ عَلٰي مِائَةِ امْرَأَةٍ أَوْ تِسْعٍ وَّتِسْعِيْنَ، كُلُّهُنَّ يَأْتِيْ بِفَارِسٍ يُجَاهِدُ فِيْ سَبِيْلِ اللّٰهِ فَقَالَ لَهُ صَاحِبُهُ قُلْ إِنْ شَاءَ اللّٰهُ، فَلَمْ يَقُلْ إِنْ شَاءَ اللّٰهُ، فَلَممْ تَحْمِلْ مِنْهُنَّ إِلَّا امْرَأَةٌ وَاحِدَةٌ جَاءَتْ بِشِقِّ رَجُلٍ، وَالَّذِيْ نَفْسُ مُحَمَّدٍ بِيَدِهِ ! لَوْ قَالَ إِنْ شَاءَ اللّٰهُ، لَجَاهَدُوْا فِيْ سَبِيْلِ اللّٰهِ فُرْسَانًا أَجْمَعُوْنَ ]نَ ] [ بخاري، الجہاد والسیر، باب من طلب الولد للجہاد : ۲۸۱۹ ]’’آج رات میں اپنی سو (۱۰۰) یا فرمایا ننانوے (۹۹) عورتوں کے پاس جاؤں گا اور ہر عورت ایک بیٹا جنے گی، جو جہاد فی سبیل اللہ کا شہ سوار ہو گا۔‘‘ ان کے ایک ساتھی نے کہا : ’’ان شاء اللہ کہیے۔‘‘ مگر سلیمان علیہ السلام نے (مشغولیت وغیرہ کی وجہ سے) ان شاء اللہ نہ کہا، تو ان عورتوں میں سےے صرف ایک عورت کو حمل ہوا اور وہ بھی ادھورا بیٹا ہوا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’قسم اس ذات کی جس کے ہاتھ میں محمد کی جان ہے! اگر وہ ان شاء اللہ کہتے تو سب عورتوں کے بیٹے ہوتے جو شہ سوار ہوتے اور سب اللہ کے راستے میں جہاد کرتے۔‘‘ ¤ دوسرا معنی یہ ہے کہ اے نبی! کسی کام کے بارے میں (اپنی مرضی سے) یہ مت کہیے کہ کل میں یہ کام کرنے والا ہوں، مگر یہ کہ اللہ چاہے، یعنی اللہ چاہے گا کہ آپ وہ کام کریں تو وہ آپ کو اجازت دے گا، پھر آپ اس کے اذن سے یہ کہہ سکتے ہیں۔ (قاسمی) یہ معنی {’’ اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ ‘‘ } الفاظ کے زیادہ قریب ہے اور سورۂ نجم کی آیات (۳، ۴) : «وَ مَا يَنْطِقُ عَنِ الْهَوٰى اِنْ هُوَ اِلَّا وَحْيٌ يُّوْحٰى »میں بھی یہی مفہوم ہے۔ ¤ ➌ { وَ اذْكُرْ رَّبَّكَ اِذَا نَسِيْتَ :} یعنی جب بھول جائیں تو یاد آنے پر ’’ان شاء اللہ‘‘ کہہ لیں۔ یاد رہے کہ قسم کے ساتھ ’’ان شاء اللہ‘‘ کہہ لے تو قسم پوری نہ کرنے پر کوئی کفارہ نہیں۔ بعض لوگ کہتے ہیں کہ اگر قسم سے متصل ’’ان شاء اللہ‘‘ نہ کہے تو اس کا اعتبار نہیں ہو گا، مگر یہ آیت دلیل ہے کہ اگر اس کا ارادہ ’’ان شاء اللہ‘‘ کہنے کا تھا مگر بھول کر نہیں کہہ سکا اور یاد آتے ہی اس نے کہہ لیا تو اس کا اعتبار ہو گا۔ مستدرک حاکم (۴؍۳۰۳، ح : ۷۸۳۳) میں صحیح سند کے ساتھ ابن عباس رضی اللہ عنہما کا قول مروی ہے کہ جب آد می کسی بات پر قسم کھا لے تو وہ ایک سال تک ’’ان شاء اللہ‘‘ کہہ سکتا ہے۔‘‘ ابن قیم رحمہ اللہ نے مدارج السالکین میں فرمایا : ’’یہ نسیان کی صورت میں ہے۔‘‘ (محاسن التاویل ملخصاً) ¤ ➍ {وَ قُلْ عَسٰۤى اَنْ يَّهْدِيَنِ رَبِّيْ … :} اور کہہ دیجیے کہ مجھے اپنے رب سے امید ہے کہ وہ مجھے اصحابِ کہف کی خبر سے بھی قریب تر لوگوں کی ہدایت کا باعث بننے والی خبریں بتائے گا جن سے میری رسالت ثابت ہو گی، چنانچہ اللہ تعالیٰ نے غیب کی بہت سی خبریں آپ کو بتائیں جن کی کسی کو کچھ خبر نہ تھی۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {وَ لَبِثُوْا فِيْ كَهْفِهِمْ …:} بعض مفسرین نے فرمایا کہ اللہ تعالیٰ نے نو سالوں کا ذکر الگ اس لیے فرمایا کہ اگر شمسی سال ہوں تو تین سو سال اور قمری ہوں تو ان کے ٹھہرنے کی مدت تین سو نو سال تھی۔ ان حضرات کا کہنا یہ ہے کہ اگر یہ بات نہ ہوتی تو {’’ثَلاَثَ مِائَةٍ وَ تِسْعَ سِنِيْنَ‘‘} (یعنی تین سو نو سال) کہنا کافی بھی تھا اور مختصر بھی۔ مگر حقیقت یہ ہے کہ شمسی اور قمری کے اس فرق کی کوئی دلیل نہیں۔ نو سالوں کو الگ ذکر کرنے کی وجہ آیات کے فواصل (آخری الفاظ) ہیں، جن سے کلام میں حُسن پیدا ہوتا ہے اور بلاغت کے لحاظ سے قرآن کے الفاظ {’’ ثَلٰثَ مِائَةٍ سِنِيْنَ وَ ازْدَادُوْا تِسْعًا ‘‘} کے درمیان اور {’’ ثَلاَثَ مِائَةٍ وَ تِسْعَ سِنِيْنَ ‘‘} کے درمیان فرق زمین و آسمان کا ہے۔ بلاغت کا قاعدہ ہے کہ کبھی اختصار میں حُسن ہوتا ہے اور کبھی تطویل میں۔ اس لیے ان کے ٹھہرنے کی مدت تین سو نو سال ہی تھی، قمری سال تھے تو سب قمری اور شمسی تھے تو سب شمسی۔ تین سو شمسی اور تین سو نو قمری کی تفریق ایک ذہنی اُپج کے سوا کچھ نہیں۔ (محاسن التاویل)"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ {قُلِ اللّٰهُ اَعْلَمُ بِمَا لَبِثُوْا …:} یعنی اگر اہل کتاب آپ سے اس مدت میں اختلاف کریں تو آپ کہہ دیجیے کہ اللہ کا علم تم سے زیادہ ہے، لہٰذا جو مدت اس نے بتائی ہے وہی صحیح ہے، تمھاری بات کا اعتبار نہیں۔ ¤ ➋ { لَهٗ غَيْبُ السَّمٰوٰتِ …:} یہ اللہ کے {’’ اَعْلَمُ ‘‘} ہونے کی دلیل ہے کہ آسمانوں کا اور زمین کا غیب صرف اس کے پاس ہے۔ رہا دیکھنے اور سننے کے ذریعے سے علم تو وہ کس قدر دیکھنے والا اور کس قدر سننے والا ہے، اس پر تعجب تو ہو سکتا ہے، بیان میں نہیں آ سکتا۔ تو پھر اس کی بات درست ہے یا ان کی جو ان صفات سے خالی ہیں۔ ان کا حال یہ ہے کہ اس کے سوا ان کا کوئی مددگار نہیں اور اس کی شان یہ ہے کہ وہ اپنے فیصلے میں کسی کو بھی شریک نہیں کرتا۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { وَ اتْلُ مَاۤ اُوْحِيَ اِلَيْكَ مِنْ كِتَابِ رَبِّكَ :} یعنی اصحابِ کہف کے بارے میں جو بات آپ کو اس کتاب میں بتائی جا رہی ہے وہ بالکل کافی اور جامع مانع ہے۔ آپ اسی کو جوں کا توں پڑھ کر سناتے رہیے، یا یہ کہ قرآن اللہ تعالیٰ کی سچی کتاب ہے، یہی ان کو پڑھ کر سنائیں اور ان کی مخالفت کی پروا نہ کریں۔ ¤ ➋ {لَا مُبَدِّلَ لِكَلِمٰتِهٖ وَ لَنْ تَجِدَ … : ’’ مُلْتَحَدًا ‘‘} کا معنی التحاد کی جگہ ہے، جو {’’لَحْدٌ‘‘} سے باب افتعال ہے، جس کا معنی مائل ہونا ہے۔ قبر کو بھی اسی لیے لحد کہتے ہیں کہ وہ ایک طرف ہٹی ہوتی ہے۔ چنانچہ {’’ مُلْتَحَدًا ‘‘} سے مراد ایسی جگہ ہے جہاں آدمی ایک طرف جا کر پناہ لے لے۔ یعنی اگر آپ کسی کی خاطر داری سے اس کتاب کی تبلیغ میں کوتاہی کریں گے، یا اس میں کوئی رد و بدل کریں گے تو آپ کو اس کے سوا کہیں پناہ نہ ملے گی۔ اس مفہوم کی آیات کے لیے دیکھیے سورۂ مائدہ (۶۷) اور یونس (۱۵) یہ خطاب بظاہر آپ صلی اللہ علیہ وسلم سے ہے مگر مقصود اہل کتاب اور کفار مکہ سب کو متنبہ کرنا ہے کہ تمھاری خاطر آپ صلی اللہ علیہ وسلم اپنے مالک کی کتاب میں کوئی رد و بدل کرنے والے نہیں۔ ¤ ➌ اس آیت پر اور بعض علمائے تفسیر کے قول کے مطابق اوپر کی آیت پر اصحابِ کہف کا قصہ ختم ہو گیا۔ اس کے بعد دوسرا مضمون شروع ہو رہا ہے جس میں ان حالات پر تبصرہ ہے جو نبی صلی اللہ علیہ وسلم اور مسلمانوں کو ان دنوں مکہ میں درپیش تھے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) {وَ اصْبِرْ نَفْسَكَ مَعَ الَّذِيْنَ يَدْعُوْنَ رَبَّهُمْ : ’’ وَ لَا تَعْدُ عَيْنٰكَ ‘‘ ’’عَدَا يَعْدُوْ‘‘} (ن) سے نہی کا صیغہ ہے، تجاوز نہ کریں تیری آنکھیں۔ یہ وہی حکم ہے جو اس سے پہلے سورۂ انعام (۵۲) میں گزر چکا ہے۔ مراد وہ کمزور مسلمان ہیں جن کے پاس قریش کے چودھریوں کو بیٹھنا گوارا نہ تھا۔ سعد بن ابی وقاص رضی اللہ عنہ فرماتے ہیں کہ ہم نبی صلی اللہ علیہ وسلم کے ساتھ چھ آدمی تھے تو مشرکین نے آپ سے کہا، ان لوگوں کو دور ہٹا دیں کہ یہ لوگ ہم پر جرأت نہ کریں۔ میں تھا، ابن مسعود، قبیلہ ہذیل کا ایک آدمی، بلال اور دو آدمی اور جن کا میں نام نہیں لیتا۔ تو رسول اللہ صلی اللہ علیہ وسلم کے دل میں آیا جو اللہ نے چاہا کہ آئے، تو آپ صلی اللہ علیہ وسلم نے اپنے دل میں کوئی بات سوچی تو اللہ تعالیٰ نے یہ آیت نازل فرمائی : «وَ لَا تَطْرُدِ الَّذِيْنَ يَدْعُوْنَ رَبَّهُمْ بِالْغَدٰوةِ وَ الْعَشِيِّ يُرِيْدُوْنَ وَجْهَهٗ » [ الأنعام : ۵۲ ] ’’اور ان لوگوں کو دور نہ ہٹا جو اپنے رب کو پہلے اور پچھلے پہر پکارتے ہیں، اس کا چہرہ چاہتے ہیں۔‘‘ [ مسلم، فضائل الصحابۃ، باب في فضل سعد بن أبي وقاص رضی اللہ عنہ : 2413/46 ] اس آیت میں بھی آپ کو ایسے لوگوں کے ساتھ اپنے آپ کو روک کر رکھنے کا حکم ہے جن میں مذکورہ صفات پائی جاتی ہیں، کیونکہ ان صفات کی وجہ سے وہی اس قابل ہیں کہ آپ ان کے ساتھ رہیں۔ ان کو چھوڑ کر آپ کی نگاہیں آگے مت بڑھیں کہ آپ دنیا کی زندگی کی زینت کا ارادہ رکھتے ہوں اور ایسے لوگوں کی بات مت مانیں جن کے دلوں کو ہم نے اپنی یاد سے غافل کر دیا اور وہ اپنی خواہش کے پیچھے چل رہے ہیں۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ {وَ قُلِ الْحَقُّ مِنْ رَّبِّكُمْ : ’’ الْحَقُّ ‘‘} پر الف لام عہد کا ہے، اس لیے اس کا ترجمہ ’’یہ حق‘‘ کیا ہے۔ ¤ ➋ { فَمَنْ شَآءَ فَلْيُؤْمِنْ … :} یعنی مجھے تمھاری کوئی پروا نہیں، مانو گے تو اپنا بھلا کرو گے اور ننہ مانو گے تو اپنی شامت لاؤ گے، میں مومنوں کو اپنی مجلس سے نہیں اٹھا سکتا۔ ¤ ➌ { اِنَّاۤ اَعْتَدْنَا لِلظّٰلِمِيْنَ نَارًا : ’’ اَعْتَدْنَا ‘‘ } میں تاء اصلی ہے۔ {’’ لِلظّٰلِمِيْنَ ‘‘} سے مراد کفار و مشرکین ہیں۔ ¤ ➍ {اَحَاطَ بِهِمْ سُرَادِقُهَا …: ’’ سُرَادِقٌ ‘‘} وہ پردہ جو خیمے کے اردگرد لگایا جاتا ہے، یعنی قنات، جمع {’’سُرَادِقَاتٌ‘‘} (قاموس) {’’اَلْمُهْلُ‘‘ } پگھلی ہوئی دھات، وہ تانبہ ہو یا سیسہ وغیرہ اور نہایت گرم تیل کی تلچھٹ۔ {’’ مُرْتَفَقًا ‘‘} ظرف مکان ہے، ارتفاق کی جگہ، اصل اس کا یہ ہے کہ آدمی اپنی مرفق (کہنی) پر ٹیک لگا کر آرام کرتا ہے۔ جہنم کو آرام کی جگہ بطور طنز کہا ہے، ورنہ وہاں کہنی پر سر رکھ کر کیسے سو سکتا ہے۔ یعنی چاروں طرف آگ کی دیوار ہو گی، کہیں بھاگنے کا راستہ نہیں ملے گا۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 31،30) { اِنَّ الَّذِيْنَ اٰمَنُوْا … :} ظالمین یعنی کفار کے بعد اہل ایمان اور ان کے اجر کا ذکر فرمایا۔ اس مفہوم کی آیات کہ جو اچھا عمل کرے ہم اس کا اجر ضائع نہیں کرتے، کے لیے دیکھیے آل عمران (۱۷۱، ۱۹۵)۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31،30) { اِنَّ الَّذِيْنَ اٰمَنُوْا … :} ظالمین یعنی کفار کے بعد اہل ایمان اور ان کے اجر کا ذکر فرمایا۔ اس مفہوم کی آیات کہ جو اچھا عمل کرے ہم اس کا اجر ضائع نہیں کرتے، کے لیے دیکھیے آل عمران (۱۷۱، ۱۹۵)۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 33،32) { وَ اضْرِبْ لَهُمْ مَّثَلًا رَّجُلَيْنِ …:} کفار کو مسلمان فقراء کے مقابلے میں اپنے اموال و انصار پر فخر تھا، اس بنا پر وہ مسلمانوں کو حقیر سمجھتے اور مجلس میں ان کے ساتھ بیٹھنا پسند نہ کرتے۔ اللہ تعالیٰ نے یہ قصہ بیان فرما کر سمجھایا کہ یہ چیزیں فخر کے لائق نہیں ہیں، کیونکہ ایک لمحہ میں فقیر غنی ہو سکتا ہے اور غنی فقیر۔ دنیا میں اگر فخر کی کوئی چیز ہے تو وہ ہے اللہ کی اطاعت اور اس کی عبادت اور یہ ان فقراء کو حاصل ہے۔ اللہ تعالیٰ نے کافر و مومن کی ایک مثال بیان فرمائی کہ دو آدمی تھے (ان کے نام یا زمانہ معلوم نہیں، نہ ہی اس میں کوئی فائدہ ہے) ان میں سے ایک کو، جو کافر تھا، اللہ تعالیٰ نے انگوروں کے دو باغ عطا فرمائے تھے، جو بہت ہی خوب صورت اور نفع آور تھے۔ انگوروں کے باغوں کو کھجوروں نے گھیر رکھا تھا، دونوں باغوں کے درمیان کھیتی تھی اور دونوں باغوں کے درمیان اللہ کے حکم سے نہر چل رہی تھی۔ باغوں اور کھیتوں کو پانی کی کوئی کمی نہ تھی، چنانچہ دونوں باغوں نے پوری پیدا وار دی اور کسی قسم کی کمی نہیں کی۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33،32) { وَ اضْرِبْ لَهُمْ مَّثَلًا رَّجُلَيْنِ …:} کفار کو مسلمان فقراء کے مقابلے میں اپنے اموال و انصار پر فخر تھا، اس بنا پر وہ مسلمانوں کو حقیر سمجھتے اور مجلس میں ان کے ساتھ بیٹھنا پسند نہ کرتے۔ اللہ تعالیٰ نے یہ قصہ بیان فرما کر سمجھایا کہ یہ چیزیں فخر کے لائق نہیں ہیں، کیونکہ ایک لمحہ میں فقیر غنی ہو سکتا ہے اور غنی فقیر۔ دنیا میں اگر فخر کی کوئی چیز ہے تو وہ ہے اللہ کی اطاعت اور اس کی عبادت اور یہ ان فقراء کو حاصل ہے۔ اللہ تعالیٰ نے کافر و مومن کی ایک مثال بیان فرمائی کہ دو آدمی تھے (ان کے نام یا زمانہ معلوم نہیں، نہ ہی اس میں کوئی فائدہ ہے) ان میں سے ایک کو، جو کافر تھا، اللہ تعالیٰ نے انگوروں کے دو باغ عطا فرمائے تھے، جو بہت ہی خوب صورت اور نفع آور تھے۔ انگوروں کے باغوں کو کھجوروں نے گھیر رکھا تھا، دونوں باغوں کے درمیان کھیتی تھی اور دونوں باغوں کے درمیان اللہ کے حکم سے نہر چل رہی تھی۔ باغوں اور کھیتوں کو پانی کی کوئی کمی نہ تھی، چنانچہ دونوں باغوں نے پوری پیدا وار دی اور کسی قسم کی کمی نہیں کی۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) {وَ كَانَ لَهٗ ثَمَرٌ فَقَالَ لِصَاحِبِهٖ …: ’’ ثَمَرٌ ‘‘ } کی تنوین تکثیر کے لیے ہے، یعنی اس کے علاوہ بھی اس کے پاس بہت سا پھل تھا یا بہت نفع تھا، کیونکہ نفع کو بھی ثمر کہہ لیتے ہیں۔ بعض مفسرین نے اس سے مراد اولاد لی ہے کہ کھیتوں اور باغوں کے علاوہ اس کی اولاد بھی بہت تھی۔ اس کی دلیل آگے مومن کا قول ہے : «اِنْ تَرَنِ اَنَا اَقَلَّ مِنْكَ مَالًا وَّ وَلَدًا » [ الکہف : ۳۹ ] ’’اگر تو مجھے دیکھتا ہے کہ میں مال اور اولاد میں تجھ سے کم تر ہوں۔‘‘ دوسرا آدمی مومن تھا مگر نادار تھا، اب اس کافر نے فخر سے گفتگو کرتے ہوئے اسے کہا، میرے پاس تم سے مال بھی زیادہ ہے اور آدمی بھی، یعنی اولاد، نوکر چاکر اور دوست۔ الغرض! اس بے ایمان نے اپنے مال و جاہ کے بھروسے پر مومن بھائی پر فخر کیا اور اسے اپنے باغات کا مشاہدہ کرانے کے لیے ساتھ لے چلا۔ (کبیر)"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 36،35) {وَ دَخَلَ جَنَّتَهٗ وَ هُوَ ظَالِمٌ لِّنَفْسِهٖ …:} اپنی جان پر ظلم کرنے والا اس لیے کہ اس نے تین باتیں کہیں جو تینوں کفر ہیں، اگرچہ وہ رب تعالیٰ کے وجود کو مانتا تھا، جیسا کہ {’’ وَ لَىِٕنْ رُّدِدْتُّ اِلٰى رَبِّيْ ‘‘} سے ظاہر ہے۔ پہلی یہ کہ میں نہیں سمجھتا کہ یہ باغ کبھی برباد ہو گا، حالانکہ اللہ کے سوا کسی بھی چیز کو ہمیشہ سے یا ہمیشہ کے لیے باقی سمجھنا نری جہالت اور دہریت ہے اور اللہ تعالیٰ کے اختیار اور ارادے کا انکار ہے، وہ جب چاہے کسی بھی چیز کو {’’كُنْ‘‘} کہہ کر فنا کر سکتا ہے اور کرتا رہتا ہے۔ دوسری یہ کہ میں قیامت کو قائم ہونے والی نہیں سمجھتا، حالانکہ یہ اللہ کی قدرت کا انکار ہے، کیونکہ اللہ تعالیٰ جب پہلی دفعہ پیدا کرنے پر قادر ہے تو دوبارہ بھی قادر ہے۔ تیسری بات یہ کہ اگر بالفرض میں اپنے رب کی طرف دوبارہ لے جایا گیا تومجھے یہاں سے بہتر جگہ ملے گی، کیونکہ یہ میرا حق ہے۔ دیکھیے حم السجدہ (۵۰) اور سورۂ مریم (۷۷) یہ اعمال کی جزا و سزا سے اور اللہ تعالیٰ کی حکمت و عددل سے انکار ہے اور مذکورہ تینوں باتیں کفر ہیں۔ (مہائمی)"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36،35) {وَ دَخَلَ جَنَّتَهٗ وَ هُوَ ظَالِمٌ لِّنَفْسِهٖ …:} اپنی جان پر ظلم کرنے والا اس لیے کہ اس نے تین باتیں کہیں جو تینوں کفر ہیں، اگرچہ وہ رب تعالیٰ کے وجود کو مانتا تھا، جیسا کہ {’’ وَ لَىِٕنْ رُّدِدْتُّ اِلٰى رَبِّيْ ‘‘} سے ظاہر ہے۔ پہلی یہ کہ میں نہیں سمجھتا کہ یہ باغ کبھی برباد ہو گا، حالانکہ اللہ کے سوا کسی بھی چیز کو ہمیشہ سے یا ہمیشہ کے لیے باقی سمجھنا نری جہالت اور دہریت ہے اور اللہ تعالیٰ کے اختیار اور ارادے کا انکار ہے، وہ جب چاہے کسی بھی چیز کو {’’كُنْ‘‘} کہہ کر فنا کر سکتا ہے اور کرتا رہتا ہے۔ دوسری یہ کہ میں قیامت کو قائم ہونے والی نہیں سمجھتا، حالانکہ یہ اللہ کی قدرت کا انکار ہے، کیونکہ اللہ تعالیٰ جب پہلی دفعہ پیدا کرنے پر قادر ہے تو دوبارہ بھی قادر ہے۔ تیسری بات یہ کہ اگر بالفرض میں اپنے رب کی طرف دوبارہ لے جایا گیا تومجھے یہاں سے بہتر جگہ ملے گی، کیونکہ یہ میرا حق ہے۔ دیکھیے حم السجدہ (۵۰) اور سورۂ مریم (۷۷) یہ اعمال کی جزا و سزا سے اور اللہ تعالیٰ کی حکمت و عددل سے انکار ہے اور مذکورہ تینوں باتیں کفر ہیں۔ (مہائمی)"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) {قَالَ لَهٗ صَاحِبُهٗ وَ هُوَ يُحَاوِرُهٗۤ …: ’’ تُرَابٍ ‘‘} اور {’’ نُطْفَةٍ ‘‘} کی تنوین تحقیر کے لیے ہے۔ اس کے مومن ساتھی نے، جسے وہ اپنے مال و جاہ پر فخر کرتے ہوئے فقر کا طعنہ دے رہا تھا، اس سے گفتگو کرتے ہوئے اسے جواب میں کفر کا طعنہ دیا اور کہا کیا تو نے اس ہستی سے کفر کیا جس نے تجھے حقیر مٹی سے، پھر ایک قطرے سے پیدا کیا، پھر ٹھیک ٹھاک ایک آدمی بنا دیا۔ دیکھیے حج (۵)، بقرہ (۲۸) اور مومنون (۱۲ تا ۱۴) تفسیر وحیدی میں ہے : ’’افسوس کہ اکثر مسلمان مال دار بھی اسی غرور میں مبتلا ہیں، مساکین بلکہ علماء و صلحاء تک کو نظر حقارت سے دیکھتے ہیں۔‘‘"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) {لٰكِنَّاۡ هُوَ اللّٰهُ رَبِّيْ … : ’’ لٰكِنَّاۡ ‘‘} اصل میں {’’لٰكِنْ أَنَا‘‘} (لیکن میں) ہے، یعنی تم کفر کرتے ہو تو کرتے رہو، لیکن میں یہ ظلم کبھی نہیں کروں گا، بلکہ وہ اللہ ہی میرا رب ہے اور میں اپنے رب کے ساتھ کسی کو شریک نہیں کروں گا۔ اس سے معلوم ہوا کہ اس کا ساتھی مشرک تھا۔ اسماء بنت عمیس رضی اللہ عنہا سے روایت ہے کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے چند کلمات سکھائے جنھیں میں پریشانی اور بے چینی کے وقت کہوں : [ اَللّٰهُ اَللّٰهُ رَبِّيْ لَا أُشْرِكُ بِهِ شَيْئًا ] [ أبوداوٗد، الوتر، باب في الاستغفار : ۱۵۲۵ ] ’’اللہ، اللہ ہی میرا رب ہے، میں اس کے ساتھ کسی چیز کو شریک نہیں بناتی (بناتا)۔‘‘"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) {وَ لَوْ لَاۤ اِذْ دَخَلْتَ جَنَّتَكَ … :} اس سے معلوم ہوا کہ آدمی کو اپنی کوئی چیز اچھی لگے تو اسے یہ کلمات کہنے چاہییں : « مَا شَآءَ اللّٰهُ لَا قُوَّةَ اِلَّا بِاللّٰهِ » ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسرسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : [ يَا أَبَا هُرَيْرَةَ ! أَفَلاَ أَدُلُّكَ عَلٰی كَنْزٍ مِنْ كَنْزِ الْجَنَّةِ تَحْتَ الْعَرْشِ ، قَالَ قُلْتُ نَعَمْ فِدَاكَ أَبِيْ وَ أُمِّيْ، قَالَ أَنْ تَقُوْلَ لَا قُوَّةَ إِلاَّ بِاللّٰهِ، قَالَ أَبُوْ بَلْجٍ وَأَحْسِبُ أَنَّهُ قَالَ : فَإِنَّ اللّٰهَ عَزَّوَجَلَّ يَقُوْلُ أَسْلَمَ عَبْدِيْ وَاسْتَسْلَمَ، قَالَ فَقُلْتُ لِعَمْرٍو قَاالَ أَبُوْبَلْجٍ قَالَ عَمْرٌو قُلْتُ لِأَبِيْ هُرَيْرَةَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ فَقَالَ: لَا إِنَّهَا فِيْ سُوْرَةِ  الْكَهْفِ : «وَ لَوْ لَاۤ اِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ مَا شَآءَ اللّٰهُ لَا قُوَّةَ اِلَّا بِاللّٰهِ »] [ مسند أحمد :335/2، ح : ۸۴۴۷ ] ’’اے ابوہریرہ! کیا میں تمھیں عرش کے نیچے جنت کے خزانوں میں سے ایک خزانہ بتاؤں؟‘‘ میں نے کہا : ’’ہاں! آپ پر میرے ماں باپ قربان!‘‘ فرمایا : ’’تم کہو {’’لَا قُوَّةَ اِلَّا بِاللّٰهِ‘‘} ابوبلج راوی کہتے ہیں، میرا گمان ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’کیونکہ اللہ تعالیٰ فرماتا ہے، میرا بندہ مطیع ہو گیا اور اس نے اپنا آپ میرے سپرد کر دیا۔‘‘ ابوہریرہ رضی اللہ عنہ سے ان کے شاگرد نے پوچھا : {’’لَا حَوْلَ وَلَا قُوَّةَ اِلَّا بِاللّٰهِ‘‘} تو انھوں نے فرمایا: ’’نہیں، یہ کلمہ سورۂ کہف میں ہے : « وَ لَوْ لَاۤ اِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ ممَا شَآءَ اللّٰهُ لَا قُوَّةَ اِلَّا بِاللّٰهِ »“ ششعیب ارنؤوط نے کہا کہ یہ روایت عرش کے لفظ کے بغیر صحیح ہے۔ صحیح بخاری میں انس رضی اللہ عنہ نے {’’لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ‘‘} کی یہی فضیلت رسول اللہ صلی اللہ علیہ وسلم سے بیان کی ہے۔ [بخاری، القدر، باب لا حول ولا قوۃ إلا باللہ : ۶۶۱۰ ] باقی وہ روایات جن میں یہ کلمات پڑھنے سے نظر بد یا کسی بھی نقصان سے محفوظ رہنے کا ذکر ہے، وہ سب ضعیف ہیں۔ (البانی) مگر ان کی فضیلت کے لیے آیت ہی کافی ہے ۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 41،40) {’’ صَعِيْدًا ‘‘} میدان، {’’ زَلَقًا ‘‘} جس میں قدم پھسلتا ہو۔ اس مومن نے اپنے مغرور ساتھی سے کہا کہ اگر تم مجھے مال و اولاد میں اپنے سے کم دیکھتے ہو تو یہ کوئی ہمیشہ رہنے والی چیز نہیں، عین قریب ہے کہ میرا رب دنیا میں یا آخرت میں مجھے تمھارے باغ سے بہتر عطا کر دے اور تمھارے باغ پر آسمان سے کوئی عذاب بھیج کر زمین کو چٹیل میدان بنا دے جہاں قدم پھسلتا ہو، یا وہ چشمہ جس سے اس کی نہر نکلتی ہے، اس کا پانی گہرا چلا جائے اور تم کسی صورت اسے حاصل نہ کر سکو۔ دیکھیے سورۂ ملک کی آخری آیت۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41،40) {’’ صَعِيْدًا ‘‘} میدان، {’’ زَلَقًا ‘‘} جس میں قدم پھسلتا ہو۔ اس مومن نے اپنے مغرور ساتھی سے کہا کہ اگر تم مجھے مال و اولاد میں اپنے سے کم دیکھتے ہو تو یہ کوئی ہمیشہ رہنے والی چیز نہیں، عین قریب ہے کہ میرا رب دنیا میں یا آخرت میں مجھے تمھارے باغ سے بہتر عطا کر دے اور تمھارے باغ پر آسمان سے کوئی عذاب بھیج کر زمین کو چٹیل میدان بنا دے جہاں قدم پھسلتا ہو، یا وہ چشمہ جس سے اس کی نہر نکلتی ہے، اس کا پانی گہرا چلا جائے اور تم کسی صورت اسے حاصل نہ کر سکو۔ دیکھیے سورۂ ملک کی آخری آیت۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) { وَ اُحِيْطَ بِثَمَرِهٖ …:} لفظی معنی ہے اس کے پھل کو گھیر لیا گیا، یعنی سب مارا گیا۔ چنانچہ ایسا ہی ہوا جیسا اس مومن نے کہا تھا کہ رات اللہ کی طرف سے کسی عذاب مثلاً طوفانی بارش، یا سردی کی شدید لہر، یا آگ لگنے سے اس کا سارا باغ برباد ہو گیا، انگور چھتوں سمیت گر گئے اور صبح ہوئی تو وہاں کچھ بھی نہ تھا۔ اللہ تعالیٰ نے اس کافر کی عجیب تصویر کھینچی ہے، کیونکہ جب یک لخت صدمہ پہنچتا ہے تو آدمی پہلے گنگ رہ جاتا ہے، پھر کچھ سنبھلتا ہے تو بات کرتا ہے، یہ مشرک بھی اپنے باغ کی حالت دیکھتے ہی اپنی دونوں ہتھیلیاں پھیرنے لگا۔ اس سے دو صورتیں مراد ہو سکتی ہیں، ایک یہ کہ ایک دوسری پر ملنے لگا اور دوسری یہ کہ حسرت و افسوس سے الگ الگ ہی ان کو الٹ پلٹ کرنے لگا کہ ہائے ہائے! میں نے اس میں کس قدر رقم خرچ کی تھی، نفع کے بجائے اصل بھی گیا۔ اب اسے یاد آیا کہ مومن بھائی کی بات سچی تھی اور کہنے لگا، کاش! میں اپنے رب کے ساتھ کسی کو شریک نہ کرتا، غرور و تکبر کی راہ سے اپنے نفس کی پیروی نہ کرتا، بلکہ بھائی کی بات مان لیتا اور اپنی ساری شان و شوکت کو اللہ ہی کا عطیہ سمجھتا۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) {وَ لَمْ تَكُنْ لَّهٗ فِئَةٌ …: ’’ مُنْتَصِرًا ‘‘ } کا معنی انتقام لینے والا بھی ہے اور خود بچنے والا بھی، یعنی عذاب آیا تو اس کا کوئی گروہ نہ تھا جو اس کی مدد کرتے، سوائے اللہ کے اور نہ وہ خود بچنے والا تھا۔ {’’ مِنْ دُوْنِ اللّٰهِ ‘‘ } کا ایک مطلب یہ ہے جو ترجمے میں گزرا۔ زمحشری اور کئی مفسرین نے یہی معنی کیا ہے، یعنی اس ’’وقت اللہ کے سوا‘‘ اسے کوئی بچانے والا نہ تھا، مگر اس کو وہ ناراض کر چکا تھا۔ ¤ {’’ مِنْ دُوْنِ اللّٰهِ ‘‘} کا دوسرا معنی یہ ہے کہ پھر ’’اللہ کے مقابلے میں‘‘ اس کا کوئی گروہ نہ تھا جو اس کی مدد کو پہنچتا…۔ یہ معنی بھی کئی مفسرین نے کیا ہے۔ کسی بھی کافر کو جب یہ معاملہ پیش آتا ہے تو وہ اس وقت ہر طرف سے ناامید اور مجبور ہو کر اللہ کی طرف رجوع کرتا ہے، مگر تب وقت گزر چکا ہوتا ہے اور اس کا ایمان اسے کچھ فائدہ نہیں دیتا، جیسا کہ فرعون غرق ہوتے وقت ایمان لے آیا۔ تفصیل کے لیے دیکھیے یونس (۹۰ تا ۹۲) انبیاء علیہم السلام کے مخالفین نے اللہ کا عذاب دیکھا تو کہنے لگے، ہم اللہ اکیلے پر ایمان لے آئے۔ (دیکھیے مومن : ۸۴) اور قارون کے متعلق تو اللہ تعالیٰ نے بعینہ یہ الفاظ فرمائے جو زیر تفسیر قصے والے شخص کے متعلق فرمائے، فرمایا : «فَخَسَفْنَا بِهٖ وَ بِدَارِهِ الْاَرْضَ فَمَا كَانَ لَهٗ مِنْ فِئَةٍ يَّنْصُرُوْنَهٗ مِنْ دُوْنِ اللّٰهِ وَ مَا كَانَ مِنَ الْمُنْتَصِرِيْنَ » [ القصص : ۸۱ ]’’تو ہم نے اسے اور اس کے گھر کو زمین میں دھنسا دیا، پھر نہ اس کے لیے کوئی جماعت تھی جو اللہ کے مقابلے میں اس کی مدد کرتی اور نہ وہ اپنا بچاؤ کرنے والوں میں سے تھا۔‘‘ مگر ان میں سے کسی کے ایمان نے اسے فائدہ نہ دیا۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ {هُنَالِكَ الْوَلَايَةُ لِلّٰهِ الْحَقِّ : ’’ هُنَالِكَ ‘‘} کا معنی اس وقت بھی ہے اور اس جگہ بھی، اس لیے دونوں کو ملحوظ رکھ کر ترجمہ اس موقع پر کیا گیا ہے۔ {’’ الْوَلَايَةُ ‘‘} واؤ کے فتحہ کے ساتھ معنی ہے ’’مدد ‘‘ اور واؤ کے کسرہ کے ساتھ معنی ہے ’’حکومت، اختیار‘‘ یعنی اس موقع پر صرف اللہ سچے ہی کی مدد کار آمد ہو سکتی ہے، جیسا کہ پچھلی آیت کی تفسیر میں گزرا۔ ¤ ➋ { هُوَ خَيْرٌ ثَوَابًا وَّ خَيْرٌ عُقْبًا :} اہل علم متفق ہیں کہ {’’خَيْرٌ‘‘} اور {’’شَرٌّ‘‘} دونوں اسم تفضیل ہیں، یعنی اصل میں {’’اَخْيَرُ‘‘} اور {’’اَشَرُّ‘‘} تھے، تخفیف کے لیے انھیں {’’خَيْرٌ‘‘} اور {’’شَرٌّ‘‘} کر دیا گیا۔ یعنی بدلہ دینے میں اللہ سب سے بہترہے، اس جیسا یا اس سے اچھا بدلہ کسی کے پاس نہیں اور اچھے انجام کے لحاظ سے بھی وہی سب سے بہتر ہے۔ اس کے عطا کردہ انجام جیسا انجام بھی کسی کے پاس نہیں۔ {’’ خَيْرٌ ‘‘} کا لفظ دوبارہ تاکید اور مبالغہ کے لیے ہے۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) {وَ اضْرِبْ لَهُمْ مَّثَلَ الْحَيٰوةِ الدُّنْيَا … : ’’ هَشِيْمًا ‘‘} یہ {’’فَعِيْلٌ‘‘ } بمعنی {’’مَفْعُوْلٌ‘‘} ہے، یعنی چورا چورا کیا ہوا۔ {’’تَذْرُوْهُ‘‘ ’’ذَرَا يَذْرُوْ‘‘} (ن) ہواؤں کا اڑانا۔ {’’ مُقْتَدِرًا ‘‘ ’’قَدَرَ يَقْدِرُ‘‘} سے باب افتعال کا اسم فاعل ہے، حروف زیادہ ہونے سے معنی زیادہ ہو گیا، یعنی پوری قدرت رکھنے والا۔ یہ دنیا کی بے ثباتی کی ایک اور مثال ہے، یعنی دنیا کی مثال اس پانی کی سی ہے جسے اللہ تعالیٰ نے آسمان سے اتارا، اس کے ساتھ زمین سے پودے اگے، پھر اتنے گھنے ہوگئے کہ ایک دوسرے کے ساتھ مل کر نہایت خوب صورت منظر پیش کرنے لگے، جسے دیکھ کر کاشت کار خوش ہو گئے، پھر وہ کھیتی پک کر زرد ہو گئی، پھر ایسی خشک ہوئی کہ ٹوٹ پھوٹ کر چورا ہو گئی۔ اسی طرح آسمان سے روح اتری، زمین سے بننے والے بدن سے مل کر انسان بڑھنا شروع ہو گیا، بچپن کے بعد دیکھتے ہی دیکھتے جوانی آ گئی، ماں باپ جوان اولاد کو دیکھ کر کھل اٹھے، پھر تھوڑی ہی مدت بعد بڑھاپا آ گیا۔ اب اس نے فنا ہونا ہی ہونا ہے، جس طرح پکی ہوئی فصل کو پانی دیا جائے یا کھاد، اسے ریزہ ریزہ ہونا ہی ہے، اسی طرح بوڑھے کو مقوی غذا دی جائے یا کشتے، اس نے قبر میں جا کر مٹی کے ذرات میں بدلنا ہی ہے۔ پھر کئی پودے اگتے ہی اکھاڑ لیے جاتے ہیں، کئی سرسبز پودے جوبن پر کاٹ لیے جاتے ہیں، پھر اگر کوئی حادثہ پیش نہ آئے تو پکنے پر کاٹ لیے جاتے ہیں، یا خود ہی ٹوٹ پھوٹ کا شکار ہو جاتے ہیں۔ اسی طرح انسان کوئی بچپن میں، کوئی جوانی یا ادھیڑ عمر میں فوت ہو جاتے ہیں، اگر یہ مدت خیریت سے گزر جائے تو بڑھاپے کے بعد یہاں رہنے کا معاملہ ہر حال میں ختم ہو جاتا ہے۔ اللہ تعالیٰ نے زندگی کے تمام مرحلوں کے درمیان ’’فاء تعقیب‘‘ رکھی، یعنی {’’ فَاخْتَلَطَ ‘‘} اور {’’ فَاَصْبَحَ ‘‘} یعنی یہ مرحلے ایک دوسرے کے پیچھے جلد از جلد آتے چلے جاتے ہیں۔ اس مفہوم کی آیات کے لیے دیکھیے یونس (۲۴)، زمر (۲۱) اور حدید (۲۰)۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { اَلْمَالُ وَ الْبَنُوْنَ …:} اس آیت سے مقصود لوگوں کو نیک اعمال کی طرف توجہ دلانا ہے، تاکہ وہ باقی رہنے والے نیک اعمال کو چھوڑ کر، جو آخرت میں کام آنے والے ہیں، محض دنیا کی زندگی کی زینت والی چیزوں میں مشغول نہ رہیں، کیونکہ دنیا کی زندگی بے ثبات اور عارضی ہے، جیسا کہ پچھلی آیت میں مثال سے واضح فرمایا، تو اس کی چمک دمک اور زینت اس سے بھی زیادہ بے ثبات اور عارضی ہے۔ سو باقی کو فانی پر ترجیح دینا ہی کامیابی ہے۔ اس آیت میں مال اور بیٹوں ہی کا ذکر فرمایا، کیونکہ مال میں انسان کی ملکیت کی ہر چیز آ جاتی ہے، مکان، مویشی اور سونا چاندی وغیرہ۔ دوسری آیات میں ان کی تفصیل اور ان کا فتنہ و آزمائش ہونا تفصیل سے ذکر فرمایا، دیکھیے آل عمران (۱۴، ۱۵)، منافقون (۹) اور تغابن (۱۴، ۱۵)۔ ¤ ➋ {وَ الْبٰقِيٰتُ الصّٰلِحٰتُ:} ان الفاظ میں وہ تمام نیک اعمال آجاتے ہیں جو اللہ کو راضی کرنے والے ہیں اور ان کا اجر قیامت کے دن کے لیے باقی ہے۔ عثمان رضی اللہ عنہ سے پوچھا گیا کہ {’’الْبٰقِيٰتُ الصّٰلِحٰتُ ‘‘} کیا ہیں؟ تو انھوں نے فرمایا : [ لاَ إِلٰهَ إِلَّا اللّٰهُ وَ سُبْحَانَ اللّٰهِ وَالْحَمْدُ لِلّٰهِ وَاللّٰهُ أَكْبَررُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ ] [ مسند أحمد : 71/1، ح : ۵۱۵ ] {’’ الْبٰقِيٰتُ الصّٰلِحٰتُ ‘‘} کا ایک خاص مفہوم بھی ہے، یعنی وہ اعمال جن کا ثواب آدمی کو فوت ہونے کے بعد بھی ملتا رہتا ہے۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ : إِلَّا مِنْ صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْوْ وَلَدٍ صَالِحٍ يَدْعُوْ لَهُ ] [ مسلم، الوصیۃ، باب ما یلحق الإنسان من الثواب بعد وفاتہ :۱۶۳۱ ] ’’جب انسان فوت ہو جاتا ہے تو اس کا عمل اس سے منقطع ہو جاتا ہے، سوائے تین چیزوں کے، ایک وہ صدقہ جو جاری رہنے والا ہو (مثلاً مسجد، شفا خانہ، کنواں وغیرہ)، ایک وہ علم جس سے نفع اٹھایا جائے (مثلاً تدریس، تصنیف، تبلیغ وغیرہ) اور نیک اولاد جو اس کے لیے دعا کرے (یا شاگرد وغیرہ جو دعا کرتے رہیں)۔‘‘ سلمان رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ رِبَاطُ يَوْمٍ وَلَيْلَةٍ فِيْ سَبِيْلِ اللّٰهِ خَيْرٌ مِنْ صِيَامِ شَهْرٍ وَقِيَامِهِ، وَإِنْ مَاتَ، جَرَی عَلَيْهِ عَمَلُهُ الَّذِيْ كَانَ يَعْمَلُهُ، وَأُججْرِيَ عَلَيْهِ رِزْقُهُ، وَأَمِنَ الْفَتَّانَ ] [ مسلم، الإمارۃ، باب فضل الرباط في سبیل اللہ عز وجل : ۱۹۱۳۔ ترمذي : ۱۶۶۵۔ نسائي : ۳۱۶۹، ۳۱۷۰ ] ’’اللہ کے راستے میں ایک دن اور ایک رات کا رباط (سرحد پر دشمن کے مقابلے کے لیے رہنا) ایک ماہ کے روزے اور اس کے قیام سے بہتر ہے، پھر اگر وہ فوت ہو جائے تو اس کا وہ عمل اس کے لیے جاری رکھا جاتا ہے جو وہ کرتا تھا اور اس کے لیے اس کا رزق جاری رکھا جاتا ہے اور آزمائش کرنے والوں (منکر و نکیر) سے امن میں رہتا ہے۔‘‘ مسلم میں ایک دن اور ایک رات کے لفظ ہیں اور اس میں {’’ فِيْ سَبِيْلِ اللّٰهِ ‘‘} کے الفاظ نہیں ہیں۔ ان احادیث سے معلوم ہوا کہ صدقہ جاریہ، تعلیم دین، دعا کرنے والی اولاد صالح اور جہاد فی سبیل اللہ خاص باقیات صالحات ہیں، جن کا ثواب مرنے کے بعد بھی جاری رہتا ہے۔ ¤ ➌ { خَيْرٌ عِنْدَ رَبِّكَ … :} یعنی ان اعمال کا بدلہ تیرے رب کے ہاں تمام بدلوں سے بہتر ہے اور ان کے اجر کی امید بھی سب امیدوں سے بہتر ہے۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {وَ يَوْمَ نُسَيِّرُ الْجِبَالَ …: ’’ يَوْمَ ‘‘ ’’ أُذْكُرْ ‘‘} محذوف کی وجہ سے منصوب ہے۔ دنیا کی بے ثباتی اور آخرت کے اجر کی پائیداری کی مناسبت سے اب قیامت کے دن کا ذکر فرمایا، یعنی اس دن کو یاد کیجیے جب پہاڑوں کو چلایا جائے گا اور وہ مختلف حالتوں سے گزرتے ہوئے آخر سراب کی طرح رہ جائیں گے، زمین کے سمندر، پہاڑ اور اونچی نیچی تمام جگہیں ہموار ہو جائیں گی اور پوری زمین پر نگاہ کے لیے کوئی رکاوٹ یا اوٹ باقی نہیں رہے گی۔ پہاڑوں پر گزرنے والی کیفیات کی تفصیل کے لیے دیکھیے سورۂ نبا (۲۰)، حاقہ (۱۳ تا ۱۵)، طور (۹، ۱۰)، تکویر (۳)، نمل (۸۸)، معارج (۸، ۹)، قارعہ (۴، ۵)، مزمل (۱۴) اور واقعہ (۵، ۶) زمین کے ہموار ہونے کے ذکر کے لیے دیکھیے سورۂ طٰہٰ (۱۰۵ تا ۱۰۷)۔ ¤ ➋ { وَ حَشَرْنٰهُمْ فَلَمْ نُغَادِرْ مِنْهُمْ اَحَدًا :} اللہ تعالیٰ پہلے اور پچھلے سب لوگوں کو اکٹھا کرے گا، کسی کو باقی نہیں چھوڑے گا۔ دیکھیے سورۂ واقعہ (۴۹، ۵۰) دوسرے مقام پر وضاحت فرمائی کہ اس حشر میں جن و انس کے علاوہ دوسری تمام مخلوقات بھی شامل ہوں گی، چنانچہ فرمایا : «وَ مَا مِنْ دَآبَّةٍ فِي الْاَرْضِ وَ لَا طٰٓىِٕرٍ يَّطِيْرُ بِجَنَاحَيْهِ اِلَّاۤ اُمَمٌ اَمْثَالُكُمْ مَا فَرَّطْنَا فِي الْكِتٰبِ مِنْ شَيْءٍ ثُمَّ اِلٰى رَبِّهِمْ يُحْشَرُوْنَ » [ الأنعام : ۳۸ ] ’’اور زمین میں کوئی چلنے والا جان دار نہیں اور نہ کوئی پرندہ ہے جو اپنے دو پروں سے اڑتا ہے مگر تمھاری طرح امتیں ہیں، ہم نے کتاب میں کسی چیز کی کمی نہیں چھوڑی، پھر وہ اپنے رب کی طرف اکٹھے کیے جائیں گے۔‘‘ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَتُؤَدَّنَّ الْحُقُوْقُ إِلٰی أَهْلِهَا يَوْمَ الْقِيَامَةِ حَتّٰي يُقَادَ لِلشَّاةِ الْجَلْححَاءِ مِنَ الشَّاةِ الْقَرْنَاءِ] [ مسلم، البر والصلۃ، باب تحریم الظلم : ۲۵۸۲ ] ’’قیامت کے دن حق والوں کو ان کے حقوق ہر صورت ادا کیے جائیں گے، حتیٰ کہ بغیر سینگ والی بکری کو سینگ والی بکری سے بدلہ دلوایا جائے گا۔‘‘"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) {لَقَدْ جِئْتُمُوْنَا كَمَا خَلَقْنٰكُمْ اَوَّلَ مَرَّةٍ …:} یعنی اللہ تعالیٰ ان سے یہ بات فرمائے گا۔ دیکھیے سورۂ انعام (۹۴) یہ خطاب آخرت کے منکروں سے ہو گا، جیسا کہ اس آیت کے آخر میں ہے : «بَلْ زَعَمْتُمْ اَلَّنْ نَّجْعَلَ لَكُمْ مَّوْعِدًا » ’’بلکہ تم نے گمان کیا تھا کہ ہم تمھارے لیے کبھی وعدے کا کوئی وقت مقرر نہیں کریں گے۔‘‘ ام المومنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ تُحْشَرُوْنَ حُفَاةً عُرَاةً غُرْلاً قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُوْلَ اللّٰهِ ! الرِّجَالُ وَالنِّسَاءُ يَنْظُرُ بَعْضُهُمْ إِلٰی بَعْضٍ؟ فَقَالَ الْأَمْرُ أَشَدُّ مِنْ أَنْ يُهِمَّهُمْ ذَاكِ ] [ بخاری، الرقاق، باب الحشر : ۶۵۲۷ ] ’’تم قیامت کے دن ننگے پاؤں، ننگے بدن اور بغیر ختنے کے اکٹھے کیے جاؤ گے۔‘‘ عائشہ رضی اللہ عنہا فرماتی ہیں، میں نے کہا : ’’یا رسول اللہ! مرد اور عورتیں ایک دوسرے کو دیکھیں گے؟‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’معاملہ اس سے کہیں سخت ہو گا کہ انھیں اس بات کی سوچ آئے۔‘‘ ابن عباس رضی اللہ عنہما سے بھی یہ حدیث آئی ہے، اس میں ہے کہ آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «كَمَا بَدَاْنَاۤ اَوَّلَ خَلْقٍ نُّعِيْدُهٗ وَعْدًا عَلَيْنَا اِنَّا كُنَّا فٰعِلِيْنَ » [ الأنبیاء : ۱۰۴ ] ’’جس طرح ہم نے پہلی پیدائش کی ابتدا کی (اسی طرح) ہم اسے لوٹائیں گے۔ یہ ہمارے ذمے وعدہ ہے، یقینا ہم ہمیشہ (پورا) کرنے والے ہیں۔‘‘ اس حدیث میں یہ بھی ہے : [ ثُمَّ إِنَّ أَوَّلَ الْخَلاَئِقِ يُكْسٰی يَوْمَ الْقِيَامَةِ إِبْرَاهِيْمُ ] [ بخاری، التفسیر، سورۃ الأنبیاء، باب : «کما بدأنا أول خلق نعیدہ وعداً علینا» : ۴۷۴۰، ۶۵۲۶ ] ’’پھر سب سے پہلے جسے لباس پہنایا جائے گا وہ ابراہیم ( علیہ السلام ) ہوں گے۔‘‘ اس سے معلوم ہوا کہ مسلسل بے لباس کفار ہی رہیں گے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { مَالِ هٰذَا الْكِتٰبِ :} بقاعی رحمہ اللہ نے رسم عثمانی میں لامِ جارہ کو الگ لکھنے کا ایک نکتہ بیان کیا ہے کہ مجرم اتنے خوف زدہ ہوں گے کہ وہ بعض کلمات پر رک جایا کریں گے۔ علامہ قاسمی رحمہ اللہ فرماتے ہیں کہ یہ بقاعی کے لطیف نکتوں میں سے ایک ہے۔ ¤ ➋ {لَا يُغَادِرُ صَغِيْرَةً … :} اس کی ہم معنی آیات کے لیے دیکھیے آل عمران (۳۰) اور زلزال (۷، ۸)۔ ¤ ➌ {وَ لَا يَظْلِمُ رَبُّكَ اَحَدًا:} یعنی کسی کو بے قصور سزا نہیں دے گا اور نہ ایسا ہو گا کہ اس نے کوئی گناہ نہ کیا ہو اور اس کے نامۂ اعمال میں درج کر دیا جائے۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ { وَ اِذْ قُلْنَا لِلْمَلٰٓىِٕكَةِ۠ اسْجُدُوْا …:} اس سلسلۂ کلام میں آدم و ابلیس کا قصہ ذکر کرنے کی مناسبت یہ ہے کہ کفار کو متنبہ کیا جائے کہ تم جس غرور و تکبر کی راہ پر چل رہے ہو اور فقراء مسلمین کو حقیر سمجھتے ہو یہ وہی راہ ہے جس پر تم سے پہلے شیطان نے قدم رکھا تھا، پھر دیکھ لو کہ اس کا انجام کیا ہوا؟ ¤ ➋ {كَانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ اَمْرِ رَبِّهٖ : ’’ فَفَسَقَ ‘‘} میں فاء تعلیل یعنی وجہ بیان کرنے کے لیے ہے، جیسے کہتے ہیں : {’’سَرَقَ فَقُطِعَتْ يَدُهُ‘‘} ’’اس نے چوری کی، تو اس کا ہاتھ کاٹ دیا گیا۔‘‘ یعنی شیطان جنوں میں سے تھا، اس لیے اس نے اپنے رب کے حکم کی نافرمانی کی۔ اگر فرشتوں سے ہوتا تو کبھی نافرمانی نہ کرتا، کیونکہ فرشتے نہ اللہ کی نافرمانی کرتے ہیں نہ اس کے حکم کے بغیر کوئی کام کرتے ہیں۔ دیکھیے انبیاء (۲۶ تا ۲۸) اور تحریم (۶) معلوم ہوا کہ ابلیس کے متعلق یہ کہنا کہ وہ اصل میں فرشتہ تھا، نام اس کا عزازیل تھا، یا جن تھا مگر کثرت عبادت کی وجہ سے فرشتوں کا استاد بن گیا، بالکل بے اصل بات ہے۔ رہا یہ سوال کہ سجدے کا حکم تو فرشتوں کو تھا، جنوں کو تھا ہی نہیں تو اس کے لیے دیکھیے سورۂ اعراف (۱۲) اور سورۂ بقرہ (۳۴) کی تفسیر۔ ¤ ➌ { اَفَتَتَّخِذُوْنَهٗ وَ ذُرِّيَّتَهٗۤ … :} اس سے معلومم ہوا کہ ابلیس کی اولاد ہے، مگر ان کی نسل کیسے بڑھی اور کیسے بڑھتی ہے اس کے متعلق صحیح ذریعے سے ہمارے پاس کوئی علم نہیں۔ ¤ ➍ {بِئْسَ لِلظّٰلِمِيْنَ بَدَلًا : ’’ بِئْسَ ‘‘} کا فاعل {’’هُوَ‘‘} ضمیر ہے، جو ابلیس کی طرف لوٹتی ہے، یعنی اللہ کے بدلے میں ابلیس کو دوست بنایا تو تم نے بہت برا بدل حاصل کیا۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ { مَاۤ اَشْهَدْتُّهُمْ خَلْقَ السَّمٰوٰتِ …:} اللہ تعالیٰ نے اپنے معبود برحق ہونے کی سب سے بڑی دلیل جو قرآن میں بیان فرمائی ہے اور بار بار بیان فرمائی ہے، وہ یہ ہے کہ ہر چیز کا خالق میں ہوں، میرے سوا کوئی مکھی بھی پیدا نہیں کر سکتا تو پھر میری بندگی اور دوستی چھوڑ کر مخلوق کی بندگی اور دوستی کیوں؟ مثلاً دیکھیے سورۂ نحل (۱۷)، رعد (۱۶)، لقمان (۱۱)، فاطر (۴۰) اور احقاف (۴) وغیرہ۔ اس آیت میں فرمایا کہ جب میں نے زمین و آسمان کو پیدا کیا تو ان شیاطین کا کوئی وجود نہ تھا کہ وہ ان کے بنانے میں میرے شریک ہوتے اور نہ میں نے انھیں ان کی اپنی پیدائش میں شریک کیا۔ مطلب یہ کہ یہ خود میرے پیدا کردہ ہیں، پھر یہ میرے شریک اور تمھاری بندگی اور اطاعت کے مستحق کیسے بن گئے؟ اور مخلوق خالق کی ہمسر کیسے بن گئی؟ ¤ ➋ { وَ مَا كُنْتُ مُتَّخِذَ الْمُضِلِّيْنَ عَضُدًا :} یعنی نہ میں نے کسی بھی مخلوق سے پیدا کرنے میں کوئی مشورہ یا مدد لی اور نہ میں کبھی اس طرح کے شریروں اور نافرمانوں کو، جن کا کام دوسروں کو گمراہ کرنا اور شرارت پھیلانا ہے، اپنا بازو، یعنی مددگار بنانے والا تھا۔ میں نے کسی کی بھی مدد یا مشورے کے بغیر اپنی مرضی کے مطابق ساری مخلوق پیدا کی۔ گویا {’’ الْمُضِلِّيْنَ ‘‘ } پر الف لام عہد کا ہے، مراد شیطان اور اس کی اولاد ہے۔ اس کی ہم معنی آیت کے لیے دیکھیے سورۂ سبا (۲۲، ۲۳)۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ { وَ يَوْمَ يَقُوْلُ نَادُوْا شُرَكَآءِيَ …:} یعنی ان مشرکوں سے اس دن کا ذکر کیجیے جب اللہ تعالیٰ فرمائے گا کہ میرے شریکوں کو آواز دو جنھیں تم نے میرے شریک سمجھ رکھا تھا، وہ انھیں پکاریں گے مگر مدد تو کجا، وہ انھیں جواب بھی نہیں دیں گے۔ دیکھیے قصص (۶۲ تا ۶۴) فاطر (۱۳، ۱۴)، احقاف (۵، ۶)، مریم (۸۱، ۸۲)، انعام (۹۴) اور ابراہیم (۲۲)۔ ¤ ➋ {وَ جَعَلْنَا بَيْنَهُمْ مَّوْبِقًا : ’’ وَبَقَ يَبِقُ ‘‘} (ض، ع) بروزن {’’ وَرَثَ ‘‘ } ہلاک ہونا، یعنی ہم ان مشرکوں اور ان لوگوں کے درمیان جنھیں وہ دنیا میں اپنا معبود سمجھتے تھے ہلاکت کی ایک جگہ بنا دیں گے جس سے ان کا ایک دوسرے تک پہنچنا ممکن نہ رہے گا۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) { وَرَاَ الْمُجْرِمُونَ النَّارَ … :} آگ میں جانے سے پہلے آگ کو دیکھنا اور اس بات کا یقین کہ اب اس میں جائے بغیر کوئی چارہ نہیں، بجائے خود ایک بہت بڑا عذاب ہے۔ مزید دیکھیے شوریٰ (۴۴ تا ۴۷)۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ {وَ لَقَدْ صَرَّفْنَا فِيْ هٰذَا الْقُرْاٰنِ …:} مثال سے بات بہت اچھی طرح سمجھ میں آتی ہے۔ اس سورت میں اللہ تعالیٰ نے کئی مثالیں بیان فرمائی ہیں، مثلاً دنیا کی زندگی کی مثال اور آخرت پر ایمان رکھنے والے مسکین اور ایمان نہ رکھنے والے دو باغوں کے مالک کی مثال وغیرہ۔ اس کے علاوہ دوسری سورتوں میں بھی مختلف دلیلوں، کئی طریقوں اور مثالوں سے بات سمجھائی گئی ہے۔ اللہ تعالیٰ نے کئی باتیں مچھر (بقرہ : ۲۶)، مکھی (حج : ۷۳) کتے (اعراف : ۱۷۷) اور گدھے (جمعہ : ۵) کی مثالیں دے کر سمجھائی ہیں۔ اللہ تعالیٰ کے مختار مطلق اور مخلو ق کے بے اختیار ہونے کے لیے مالک اور غلام کی مثالیں کئی جگہ بیان ہوئی ہیں۔ دیکھیے نحل (۷۵، ۷۶) اور روم (۲۸) قرآن و حدیث کی تمام مثالوں کا مقصد یہ ہے کہ لوگ بات پر غور و فکر کریں اور اسے سمجھیں، مگر انھیں جاننے والے ہی سمجھتے ہیں۔ ( دیکھیے حشر : ۲۱۔ عنکبوت :۴۳) پھر ان مثالوں سے کچھ لوگ فائدہ اٹھا کر ہدایت پا لیتے ہیں اور کچھ الٹی سمجھ سے گمراہ ہو جاتے ہیں۔ (دیکھیے بقرہ : ۲۶۔ رعد : ۱۷، ۱۸) آیت کی مزید تفصیل کے لیے دیکھیے بنی اسرائیل (۸۹) اس آیت میں {’’ فِيْ هٰذَا الْقُرْاٰنِ ‘‘ } پہلے ہے، کیونکہ اس سورت کی ابتدا ہی قرآن کے ذکر سے ہوئی ہے اور یہ سورت قرآن کے وصف میں سے ہے اور بنی اسرائیل میں {’’ لِلنَّاسِ ‘‘} پہلے ہے، کیونکہ اس سورت کا بنیادی مضمون {’’اَلنَّاسُ‘‘} (لوگوں) کے احوال کی طرف توجہ ہے، جو فی الحقیقت {’’اَلنَّاسُ‘‘} (لوگ) ہیں، جن میں تققویٰ اور احسان پایا جاتا ہے۔ (بقاعی) ¤ ➋ { وَ كَانَ الْاِنْسَانُ اَكْثَرَ شَيْءٍ جَدَلًا :} یعنی جو چیزیں جھگڑا کر سکتی ہیں انسان ان میں سب سے زیادہ جھگڑنے والا ہے، اس لیے خواہ مخواہ حیل و حجت کیے جاتا ہے اور حق بات کی طرف نہیں آتا۔ قرآن میں جا بجا ہمارے نبی صلی اللہ علیہ وسلم اور دوسرے انبیاء کے ساتھ کفار کے جھگڑے مذکور ہیں۔ جھگڑے کی ایک مثال سورۂ زخرف (۵۷، ۵۸) میں دیکھیے۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) {وَ مَا مَنَعَ النَّاسَ اَنْ يُّؤْمِنُوْۤا …: } اس آیت کے دو مطلب ہو سکتے ہیں اور دونوں کی تائید میں آیات موجود ہیں۔ ایک مطلب یہ ہے کہ رسولوں کے واضح نشانیاں لانے کے باوجود لوگوں کو ایمان لانے اور استغفار سے روکا تو صرف اس بات نے کہ اللہ کے علم میں تھا کہ یہ لوگ اس وقت تک ایمان نہیں لائیں گے جب تک ان پر ہمارا عذاب اسی طریقے سے نہ آ جائے جس طرح پہلے لوگوں، مثلاً قوم نوح، عاد اور ثمود وغیرہ پر آیا، جس نے انھیں جڑ سے اکھیڑ دیا، یا قیامت کے دن کا عذاب ان کے سامنے نہ آ جائے، یعنی ان کی تقدیر ہی میں ایمان لانا نہیں ہے۔ یہ قضیہ {’’مَانِعَةُ الْخَلْوِ‘‘} ہے۔ یعنی ان دونوں چیزوں میں سے ایک ضرور ہو گی کہ اگر دنیا میں پہلے لوگوں جیسے عذاب سے بچے رہے تو قیامت کا عذاب ان کی آنکھوں کے سامنے ضرور آئے گا اور دونوں جمع بھی ہو سکتے ہیں کہ دنیا میں پہلے لوگوں کی طرح عذاب بھی آئے گا اور آخرت میں بھی عذاب کو سامنے دیکھ لیں گے، مگر یہ نہیں ہو سکتا کہ ایک بھی نہ ہو۔ اس معنی کی تائید میں فرمایا : « اِنَّ الَّذِيْنَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِنُوْنَ (96) وَ لَوْ جَآءَتْهُمْ كُلُّ اٰيَةٍ حَتّٰى يَرَوُا الْعَذَابَ الْاَلِيْمَ » [ یونس : ۹۶، ۹۷ ] ’’بے شک وہ لوگ جن پر تیرے رب کی بات ثابت ہو چکی، وہ ایمان نہیں لائیں گے، خواہ ان کے پاس ہر نشانی آجائے، یہاں تک کہ دردناک عذاب دیکھ لیں۔‘‘ اس معنی کی مزید آیات کے لیے دیکھیے یونس (۱۰۱) اور مائدہ (۴۱)۔ ¤ دوسرا معنی یہ ہے کہ لوگوں کو ان کے ایمان لانے اور استغفار کرنے سے روکا تو صرف ان کے اس مطالبے نے کہ ان پر پہلے لوگوں جیسا جڑ سے اکھاڑ دینے والا عذاب آ جائے، یا قیامت کا عذاب ان کی آنکھوں کے سامنے آجائے، یعنی وہ اپنی سرکشی کی وجہ سے اسی مطالبے پر ڈٹے رہے، نہ ایمان لائے نہ اپنے گناہوں کی معافی مانگی۔ اس مفہوم کی آیات بہت ہیں، مثلاً شعیب علیہ السلام کی قوم نے کہا کہ تو ہم پر آسمان کے ٹکڑے گرا دے، اگر تو سچوں سے ہے۔ (شعراء : ۱۸۷) اسی طرح قومِ ہود کا مطالبہ (احقاف : ۲۲)، ثمود کا مطالبہ (اعراف : ۷۷)، قومِ لوط (عنکبوت : ۲۹)، قومِ نوح (ہود : ۳۲) اور مشرکینِ مکہ کا مطالبہ (انفال : ۳۲) آیت میں دونوں معنی کی گنجائش ہے اور دونوں درست ہیں۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ { وَ مَا نُرْسِلُ الْمُرْسَلِيْنَ اِلَّا مُبَشِّرِيْنَ … :} یعنی رسولوں کا کام بشارت و نذارت ہے، عذاب لانا یا نہ لانا ان کے اختیار میں نہیں اور کافر لوگ باطل کے ذریعے سے جھگڑا کرکے حق کو شکست دینا چاہتے ہیں، مثلاً یہ کہ تم رسول ہو تو صفا پہاڑ سونے کا بنا دو وغیرہ، حالانکہ یہ نہ رسول کا کام ہے نہ اس کے اختیار میں ہے۔ دوسرے کئی مقامات پر فرمایا کہ کافروں کی یہ خواہش نہ کبھی پوری ہو گی اور نہ اللہ کا نور پھونکوں سے بجھایا جا سکے گا۔ دیکھیے توبہ (۳۲) اور شوریٰ (۱۶)۔ ¤ ➋ { وَ اتَّخَذُوْۤا اٰيٰتِيْ … :} اللہ کی آیات اور اس کے رسولوں  کو مذاق بنا لینا جھٹلانے کی بد ترین صورت ہے۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) ➊ {وَ مَنْ اَظْلَمُ مِمَّنْ ذُكِّرَ بِاٰيٰتِ رَبِّهٖ …:} یعنی اس سے بڑھ کر ظالم کوئی نہیں۔ قرآن مجید میں یہ لفظ جس جس کے متعلق آیا ہے وہ سب ایسے ہیں کہ ان سے بڑا ظالم کوئی نہیں، مثلاً اس سے بڑھ کر کون ظالم ہے جو اللہ پر جھوٹ باندھے۔ دیکھیے سورۂ کہف (۱۵)۔ ¤ ➋ {اِنَّا جَعَلْنَا عَلٰى قُلُوْبِهِمْ اَكِنَّةً …: ’’ اَكِنَّةً ‘‘ ’’كِنَانٌ‘‘} کی جمع ہے، پردے۔ {’’ وَقْرًا ‘‘} کا معنی ہے بوجھ، بہرا پن۔ یعنی جب کوئی شخص کسی کے سیدھی طرح سمجھانے سے کوئی اثر نہیں لیتا، بلکہ جانتے بوجھتے ہٹ دھرم اور جھگڑالو بن جاتا ہے، اللہ کی واضح آیات کا مذاق اڑاتا ہے اور اپنے کرتوتوں اور ان کے برے نتائج سے بھی کوئی سبق حاصل نہیں کرتا تو آخر کار اس کا نتیجہ یہ ہوتا ہے کہ اس کے دل پر پردہ پڑ جاتا ہے اور اس کے کان حق بات سننے سے بہرے ہو جاتے ہیں۔ اس کے بعد اگر کوئی شخص اسے سیدھی راہ کی طرف بلائے بھی تو ٹس سے مس نہیں ہوتا۔ اس کی یہ کیفیت اگرچہ اس کے اپنے عمل سے پیدا ہوتی ہے، مگر خالق چونکہ ہر چیز کا اللہ تعالیٰ ہے، اس لیے اس کیفیت کے پیدا کرنے کے فعل کو اللہ تعالیٰ نے اپنی طرف منسوب کر دیا ہے۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) ➊ {وَ رَبُّكَ الْغَفُوْرُ ذُو الرَّحْمَةِ:} اس کی تفسیر کے لیے دیکھیے سورۂ اعراف (۱۵۶)، سورۂ نجم (۳۲) اور زمر(۵۳)۔ ¤ ➋ { لَوْ يُؤَاخِذُهُمْ بِمَا كَسَبُوْا لَعَجَّلَ لَهُمُ الْعَذَابَ :} اس کی تفسیر کے لیے دیکھیے سورۂ نحل (۶۱) اور فاطر (۴۵)۔ ¤ ➌ {بَلْ لَّهُمْ مَّوْعِدٌ لَّنْ يَّجِدُوْا … : ’’مَوْىِٕلًا ‘‘ ’’وَأَلَ يَئِلُ اِلٰي مَكَانٍ ‘‘} کسی جگہ کی طرف پناہ لینا۔ {’’ مَوْىِٕلًا ‘‘} پناہ کی جگہ، یعنی ان کے عذاب کے وعدے کا ایک وقت ہے، دنیا میں ہو یا آخرت میں۔ جب ان کی گرفت ہو گی تو اس سے بچنے کے لیے وہ کوئی پناہ کی جگہ نہیں پائیں گے۔ تو اے کفار قریش! تمھیں بھی ڈرتے رہنا چاہیے، ایسا نہ ہو کہ آخر کار تمھارا بھی وہی حشر ہو جو ان بستیوں کا ہوا۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) {وَ تِلْكَ الْقُرٰۤى اَهْلَكْنٰهُمْ … :} مراد ہیں سبا، ثمود، مدین اور قوم لوط کی تباہ شدہ بستیاں، جن کی سرگزشت سے عرب کے تمام لوگ واقف تھے اور جن پر قریش کا اپنے سفروں میں آتے جاتے ہمیشہ گزر ہوتا تھا۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) ➊ { وَ اِذْ قَالَ مُوْسٰى لِفَتٰىهُ …:} یہاں سے تیسرا قصہ شروع ہوتا ہے کہ موسیٰ علیہ السلام خضر کے پاس علم حاصل کرنے کے لیے گئے۔ اگرچہ یہ اپنی جگہ ایک مستقل قصہ ہے، تاہم اس میں اس بات کی تائید بھی ہے جو پہلے دونوں قصوں میں گزری۔ اوپر ذکر فرمایا کہ کافر اپنے مال و جاہ پر مغرور رہتے اور مسلمانوں کو ذلیل سمجھ کر آپ صلی اللہ علیہ وسلم سے کہتے کہ اگر ان کو اپنے پاس نہ بٹھاؤ تو ہم آپ کے پاس بیٹھیں۔ اس پر دو بھائیوں کا قصہ بیان فرمایا اور پھر دنیا کی مثال بیان فرمائی اور بتایا کہ ابلیس غرور کے سبب ہی ہلاک ہوا اور اب خضر اور موسیٰ علیھما السلام کا واقعہ بیان فرمایا کہ دیکھو موسیٰ علیہ السلام جیسے جلیل القدر اولو العزم پیغمبر اتنے زیادہ علم و عمل کے باوجود خضر علیہ السلام سے علم حاصل کرنے کے لیے گئے اور ان کے سامنے تواضع اختیار کرتے ہوئے ان کی ہر شرط قبول کی۔ (رازی و موضح) ¤ ➋ {’’ لِفَتٰىهُ ‘‘ ’’فَتًي‘‘} کا معنی نوجوان ہے، خادم کو بھی{ ’’فَتًي‘‘ } کہہ لیتے ہیں، کیونکہ بہتر خدمت نوجوان ہی کر سکتے ہیں۔ یہ یوشع بن نون تھے جو موسیٰ علیہ السلام سے بہت محبت رکھتے تھے، ان کی خدمت کے لیے ان کے ساتھ رہتے تھے، موسیٰ علیہ السلام کے بعد ان کے جانشین بنے اور انھی کے ہاتھوں بیت المقدس فتح ہوا۔ اس سے معلوم ہوا کہ کوئی شخص اگر خوش دلی سے خدمت کرے تو اس سے خدمت لی جا سکتی ہے۔ ¤ ➌ { مَجْمَعَ الْبَحْرَيْنِ : ’’بَحْرٌ‘‘} کا لفظ عربی زبان میں نمکین پانی والے سمندر پر بھی بولا جاتا ہے اور میٹھے پانی والے دریا پر بھی۔ (قاموس) فارسی میں بھی دریا کا لفظ دونوں پر بولا جاتا ہے۔ اللہ تعالیٰ نے وہ دو بحر ذکر نہیں فرمائے، کیونکہ مراد قصہ گوئی نہیں، نصیحت ہے اور وہ ان دو دریاؤں کی تعیین کے بغیر بھی پوری ہے۔ بعض مفسرین نے ان سے بحر فارس اور بحر روم مراد لیے ہیں، مگر یہ ملتے نہیں۔ بعض نے بحر ابیض اور بحر احمر مراد لیے ہیں۔ بعض نے افریقہ کے اور بعض نے اندلس کے دو دریا مراد لیے ہیں۔ بعض نے دجلہ و فرات مراد لیے ہیں، مگر مصر کو مدنظر رکھیں تو سوڈان کی طرف سے مصر میں آنے والے دریائے نیل میں ملنے والے کئی دریاؤں کے نیل کے ساتھ ملنے کی کوئی جگہ مراد ہو سکتی ہے، جسے اللہ تعالیٰ نے مچھلی کے وہاں گم ہونے کی علامت کے ساتھ متعین فرمایا۔ اب اندازے سے ان جگہوں میں سے دو دریاؤں کے جمع ہونے کی کوئی ایک جگہ متعین کرنا ممکن نہیں اور اس کا کوئی فائدہ بھی نہیں۔ {’’ حُقُبًا ‘‘ ’’حَقْبَةٌ‘‘} کی جمع ہے، لمبی مدت کو {’’ حَقْبَةٌ ‘‘} کہتے ہیں۔ اس واقعہ کی تفصیل رسول اللہ صلی اللہ علیہ وسلم نے خود بیان فرمائی ہے، قارئین اس پوری حدیث کو غور سے پڑھیں، آئندہ فوائد میں اس کا بار بار ذکر آئے گا۔ ¤ ➍ ابی بن کعب رضی اللہ عنہ سے روایت ہے کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ موسیٰ علیہ السلام بنی اسرائیل میں کھڑے خطبہ دے رہے تھے کہ ان سے پوچھا گیا : ’’لوگوں میں سب سے زیادہ علم والا کون ہے؟‘‘ انھوں نے فرمایا : ’’میں ہوں۔‘‘ تو اللہ تعالیٰ نے ان پر ناراضگی کا اظہار فرمایا، کیونکہ انھوں نے یہ بات اللہ کے سپرد نہیں کی (کہ اللہ بہتر جانتا ہے)۔ سو اللہ تعالیٰ نے ان کی طرف وحی کی کہ میرا ایک بندہ دو دریاؤں کے ملنے کی جگہ ہے، وہ تم سے زیادہ عالم ہے۔ موسیٰ علیہ السلام نے عرض کیا : ’’اے میرے رب! پھر میری اس سے ملاقات کیسے ہو سکتی ہے؟‘‘ فرمایا : ’’اپنے ساتھ ایک مچھلی لے لو اور اسے کسی مکتل (کھجور کے نرم پتوں کی بنی ہوئی ٹوکری) میں رکھ لو، تو جہاں مچھلی کو گم پاؤ، وہ وہیں ہو گا۔‘‘ تو انھوں نے ایک مچھلی لی، اسے ایک ٹوکری میں رکھا اور چل پڑے اور اپنے ساتھ اپنے جوان یوشع بن نون کو بھی لے لیا۔ یہاں تک کہ وہ ایک خاص قسم کی چٹان کے پاس پہنچے تو دونوں لیٹ گئے اور سو گئے۔ مچھلی تڑپی اور دریا میں جا گری اور اس نے دریا میں اپنا راستہ سرنگ کی صورت میں بنا لیا اور اللہ تعالیٰ نے مچھلی سے پانی کا بہاؤ روک دیا تو وہ اس پر طاق کی طرح ہو گیا۔ جب (موسیٰ علیہ السلام ) جاگے تو ان کا ساتھی انھیں مچھلی کے متعلق بتلانا بھول گیا، چنانچہ وہ دونوں دن کا باقی حصہ اور رات بھر چلتے رہے۔ اگلا دن ہوا تو موسیٰ علیہ السلام نے اپنے جوان سے کہا : ’’ہمارا دن کا کھانا لاؤ، ہمیں اپنے اس سفر میں بہت تھکاوٹ ہوئی ہے۔‘‘ (رسول اللہ صلی اللہ علیہ وسلم نے) فرمایا : ’’موسیٰ علیہ السلام کو اس وقت تک کوئی تھکاوٹ نہیں ہوئی جب تک وہ اپنی اس جگہ سے آگے نہیں گزرے جس کا انھیں اللہ تعالیٰ نے حکم دیا تھا۔‘‘ تو ان کے جوان نے ان سے کہا : ’’کیا آپ نے دیکھا کہ جب ہم اس چٹان کے پاس ٹھہرے تھے تو میں مچھلی بھول گیا اور مجھے اس کا ذکر کرنا شیطان ہی نے بھلایا ہے اور اس نے دریامیں اپنا عجیب راستہ بنا لیا۔‘‘ سو مچھلی کے لیے سرنگ بنی اور موسیٰ علیہ السلام اور ان کے جوان کو تعجب ہوا۔ موسیٰ علیہ السلام نے کہا : ’’یہی تو ہم ڈھونڈ رہے تھے۔‘‘ چنانچہ وہ دونوں اپنے قدموں کے نشانوں کا پیچھا کرتے ہوئے واپس پلٹے، یہاں تک کہ اس چٹان تک آ پہنچے، تو اس وقت (وہاں) ایک آدمی کپڑا اوڑھ کر لیٹا ہوا تھا۔ اسے موسیٰ علیہ السلام نے سلام کہا تو خضر نے کہا : ’’اور تیری (اس) سرزمین میں سلام کیسا؟‘‘ کہا : ’’میں موسیٰ ہوں۔‘‘ اس نے کہا : ’’بنی اسرائیل والے موسیٰ؟‘‘ کہا : ’’ہاں، میں آپ کے پاس آیا ہوں کہ آپ کو جو کچھ سکھایا گیا ہے اس میں سے کچھ بھلائی مجھے سکھا دیں۔‘‘ اس نے  کہا : ’’تو میرے ساتھ ہر گز صبر نہیں کر سکے گا، اے موسیٰ! میں اللہ کے علم میں سے ایک ایسے علم پر ہوں جسے تم نہیں جانتے اور تم اللہ کے علم میں سے ایک ایسے علم پر ہو جسے میں نہیں جانتا۔‘‘ تو موسیٰ علیہ السلام نے کہا : ’’تم مجھے اگر اللہ نے چاہا تو صبر کرنے والا پاؤ گے اور میں تمھارے کسی حکم کی نافرمانی نہیں کروں گا۔‘‘ تو خضر نے اس سے کہا : ’’پھر اگر تو میرے پیچھے چلا ہے تو مجھ سے کسی چیز کے بارے میں مت پوچھنا، یہاں تک کہ میں تیرے لیے اس کا کچھ ذکر شروع کروں۔‘‘ چنانچہ وہ دونوں چل پڑے، دریا کے کنارے پر جا رہے تھے کہ ایک کشتی گزری، انھوں نے ان سے بات کی کہ وہ انھیں سوار کر لیں۔ ان لوگوں نے خضر کو پہچان لیا، اس لیے انھوں نے ان کو کسی اجرت کے بغیر سوار کر لیا۔ جب وہ دونوں کشتی میں سوار ہوئے تو اچانک ہی خضر نے کشتی کے تختوں میں سے ایک تختہ تیشے کے ساتھ اکھیڑ دیا۔ موسیٰ علیہ السلام نے اس سے کہا : ’’ایسے لوگ جنھوں نے ہمیں اجرت کے بغیر سوار کر لیا، تم نے بڑھ کر ان کی کشتی کا تختہ اکھیڑ دیا، تاکہ اس میں سوار لوگوں کو غرق کر دو، بلاشبہ یقینا تو ایک بڑے کام کو آیا ہے۔‘‘ کہا : ’’کیا میں نے نہیں کہا تھا کہ یقینا تو میرے ساتھ ہر گز صبر نہ کر سکے گا؟‘‘ کہا : ’’مجھے اس پر نہ پکڑ جو میں بھول گیا اور مجھے میرے معاملے میں کسی مشکل میں نہ پھنسا۔‘‘ (ابی بن کعب رضی اللہ عنہ نے) کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ پہلی دفعہ موسیٰ علیہ السلام سے بھول ہوئی تھی۔‘‘ فرمایا : ’’اور ایک چڑیا آئی اور کشتی کے ایک کنارے پر بیٹھ گئی، اس نے دریا میں ایک ٹھونکا مارا تو خضر نے اس سے کہا : ’’میرا علم اور تیرا علم اللہ کے علم میں سے اتنا ہی ہے جتنا اس چڑیا نے اس دریا سے کم کیا ہے۔‘‘ پھر وہ دونوں کشتی سے نکلے، ابھی وہ کنارے پر چل ہی رہے تھے کہ خضر نے ایک لڑکا دیکھا جو لڑکوں کے ساتھ کھیل رہا تھا، تو خضر نے اس کا سر پکڑا اور اسے اپنے ہاتھ سے اکھیڑ کر قتل کر دیا۔ موسیٰ نے اس سے کہا : ’’کیا تو نے ایک بے گناہ جان کو کسی جان کے بدلے کے بغیر قتل کر دیا، بلاشبہ یقینا تو ایک بہت برے کام کو آیا ہے۔‘‘ کہا : ’’کیا میں نے تجھ سے نہیں کہا تھا کہ تو میرے ساتھ ہر گز صبر نہ کر سکے گا۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اور یہ پہلی سے سخت (تنبیہ) تھی۔‘‘ کہا : ’’اگر میں تجھ سے اس کے بعد کسی چیز کے متعلق پوچھوں تو مجھے ساتھ نہ رکھنا، یقینا تو میری طرف سے پورے عذر کو پہنچ چکا ہے۔‘‘ پھر وہ دونوں چل پڑے، یہاں تک کہ جب وہ ایک بستی والوں کے پاس آئے، انھوں نے اس کے رہنے والوں سے کھانا طلب کیا تو انھوں نے انکار کر دیا کہ ان کی مہمان نوازی کریں، پھر انھوں نے اس میں ایک دیوار پائی جو چاہتی تھی کہ گر جائے۔ فرمایا، ایک طرف جھکی ہوئی تھی۔ تو خضر اٹھے اور اسے اپنے ہاتھ سے سیدھا کر دیا۔ موسیٰ علیہ السلام نے کہا : ’’ایسے لوگ جن کے پاس ہم آئے تو نہ انھوں نے ہمیں کھانا کھلایا اور نہ ہماری مہمان نوازی کی، اگر آپ چاہتے تو اس پر کچھ اجرت لے لیتے۔‘‘ (خضر نے) کہا : ’’یہ میرے اور تیرے درمیان جدائی ہے۔‘‘ اس کے بعد پورا واقعہ بیان فرمایا جو آیت (۷۸) سے آیت (۸۲) کے آخر تک ہے۔ ابن عباس رضی اللہ عنہما پڑھا کرتے تھے : {’’ وَ أَمَّا الْغُلَامُ فَكَانَ كَافِرًا وَكَانَ أَبَوَااهُ مُؤْمِنَيْنِ ‘‘} یعنی وہ لڑکا کافر تھا اور اس کے ماں باپ مومن تھے۔ [ بخاری، التفسیر، باب قولہ : «و إذ قال موسٰی لفتاہ لا أبرح…» : ۴۷۲۵ ]"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) ➊ { فِي الْبَحْرِ سَرَبًا :} مچھلی پانی سے باہر زندہ نہیں رہ سکتی، معلوم ہوا وہ مچھلی مردہ تھی، پھر اگر اسے نمک لگا کر خشک نہ کیا جائے تو وہ شدید بدبو دار ہو جاتی ہے اور کیڑوں سے بھر جاتی ہے۔ معلوم ہوا اسے نمک لگا کر خشک کیا گیا تھا۔ اس مردہ مچھلی کا زندہ ہونا معجزہ تھا۔ ¤ ➋ پانی کو موسیٰ علیہ السلام کے لیے پہاڑوں کی شکل دینا (شعراء : ۶۳) یا سرنگ کی، یہ اللہ تعالیٰ کی قدرت ہے اور معجزۂ ربانی۔ جس طرح پانی کے ایک قطرے (نطفہ) سے احسن تقویم میں انسان کی صورت گری اس خلاق علیم کی قدرت کا ادنیٰ کرشمہ ہے۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) ➊ { اٰتِنَا غَدَآءَنَا :} معلوم ہوا سفر کے لیے کھانا ساتھ لے جانا انبیاء علیہم السلام کی سنت ہے اور توکل کے منافی نہیں اور یہ کہ بھوک، پیاس، تھکاوٹ، بھول چوک، غرض انسان کو پیش آنے والی چیزیں انبیاء علیہم السلام کو بھی پیش آتی ہیں، کیونکہ وہ بھی انسان ہوتے ہیں اور یہ بھی کہ آدمی کو جو عارضہ پیش آئے، اس کا ذکر کر سکتا ہے، بشرطیکہ اس کا ارادہ اللہ تعالیٰ کے شکوے کا نہ ہو۔ ¤ ➋ {لَقَدْ لَقِيْنَا مِنْ سَفَرِنَا هٰذَا نَصَبًا:} شاید اس تھکاوٹ کی وجہ اس نعمت کا احساس دلانا ہو کہ صحیح راستے پر طلب علم کے لیے جاتے ہوئے اللہ تعالیٰ کی خاص مدد شامل ہوتی ہے، جس سے تھکن نہیں ہوتی اور جب اس کی مدد نہ ہو تو انسان تھک کر رہ جاتا ہے۔"
    },
    {
      "ayah": 63,
      "tafsir": ""
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) {فَارْتَدَّا عَلٰۤى اٰثَارِهِمَا قَصَصًا:} یہ واقعہ انبیاء و اولیاء، خصوصاً موسیٰ، یوشع بن نون اور خضر علیہم السلام کے غیب نہ جاننے کی کئی طرح سے دلیل ہے : (1) موسیٰ علیہ السلام کا کہنا کہ مجھ سے زیادہ کوئی عالم نہیں، حالانکہ ان سے زیادہ علم والے موجود تھے۔ (2) اللہ تعالیٰ کا ناراض ہونا۔ (3) موسیٰ علیہ السلام کا اللہ تعالیٰ سے خضر کا پتا پوچھنا۔ (4) مجمع البحرین اور مچھلی کی نشانی کی ضرورت عالم الغیب کو نہیں ہوتی۔ (5) مچھلی کے نکل جانے کا علم نہ ہونا۔ (6) اگلا سفر، تھکاوٹ کے احساس کی وجہ معلوم نہ ہونا۔ (7) قدموں کے نشانوں کو دیکھتے ہوئے واپسی کی اسے کیا ضرورت ہے جس کی نگاہ سے کچھ اوجھل نہ ہو۔ مزید اگلی آیات میں ملاحظہ فرمائیے۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) ➊ { عَبْدًا مِّنْ عِبَادِنَاۤ:} اس سے مراد خضر علیہ السلام ہیں (خاء کے فتحہ اور ضاد کے کسرہ کے ساتھ، یا خاء کے کسرہ اور ضاد کے سکون کے ساتھ)۔ نبی صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّمَا سُمِّيَ الْخَضِرُ لِأَنَّهٗ جَلَسَ عَلٰی فَرْوَةٍ بَيْضَاءَ فَإِذَا هِيَ تَهْتَزُّ مِنْ خَلْفِهٖ خَضْرَاءَ] [ بخاری، أحادیث الأنبیاء، باب حدیث الخضر… : ۳۴۰۲ ]’’ان کا نام خضر اس لیے پڑا کہ وہ سفید زمین کے ایک قطعے پر بیٹھے تو وہ ان کے پیچھے سرسبز ہو کر لہلہانے لگا۔‘‘ یہ اللہ کے نبی تھے، اس کی دلیل یہ ہے کہ انھوں نے آخر میں فرمایا کہ میں نے یہ اپنی مرضی سے نہیں کیا۔ (کہف : ۸۲) بلکہ یہ سب اللہ کے حکم سے تھا جو وحی کی صورت میں انبیاء کو صادر ہوتا ہے۔ اسی طرح ان کا اوپر مفصل حدیث میں یہ کہنا کہ میرے پاس ایک علم ہے جو اللہ تعالیٰ نے مجھے سکھایا ہے، تم اسے نہیں جانتے…۔ ولی کتنا بھی مقرب ہو اس کا الہام حجت نہیں، نہ وہ الہام سے کسی کو قتل کر سکتا ہے، ورنہ ہر مومن اللہ کا ولی ہے۔ (بقرہ : ۲۵۷) وہ اللہ کے امر کا بہانہ بنا کر جسے چاہے گا قتل کر دے گا، جب کہ اس کا کوئی بھی قائل نہیں۔ ¤ محقق علماء جن میں امام بخاری، ابن تیمیہ اور حافظ ابن حجر رحمۃ اللہ علیھم جیسے عظیم ائمہ شامل ہیں، فرماتے ہیں کہ خضر علیہ السلام فوت ہو چکے ہیں، کیونکہ اگر وہ زندہ ہوتے تو سورۂ آل عمران کی آیت (۸۱) کے مطابق ان پر لازم تھا کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر آپ پر ایمان لاتے اور آپ کے ساتھ مل کر جہاد کرتے، جب کہ ان کے آنے کا کہیں ذکر نہیں، نہ کسی صحابی سے ان کے ملنے کا کوئی ذکر ہے۔ صحیح بخاری کی وہ حدیث بھی اس کی دلیل ہے جس میں نبی صلی اللہ علیہ وسلم نے فرمایا : [أَرَأَيْتَكُمْ لَيْلَتَكُمْ هٰذِهِ، فَإِنَّ رَأْسَ مِائَةِ سَنَةٍ مِنْهَا لَا يَبْقَی مِمَّنْ هُوَ عَلٰی ظَهْرِ الْأَرْضِ أَحَدٌ ] [ بخاری، العلم، باب السمر في العلم : ۱۱۶، عن ابن عمر رضی اللہ عنھما ]’’آج رات سے ایک سو سال پورے ہونے تک زمین کی پشت پر جو بھی ہے کوئی باقی نہیں رہے گا۔‘‘ جو لوگ کہتے ہیں کہ وہ زمین پر نہیں بلکہ دریاؤں اور سمندروں میں رہتے ہیں، ان کا رد جابر رضی اللہ عنہ سے مروی حدیث سے ہوتا ہے، جس میں رسول اللہ صلی اللہ علیہ وسلم نے اپنی وفات سے ایک ماہ قبل فرمایا : [ مَا مِنْ نَفْسٍ مَنْفُوْسَةٍ الْيَوْمَ، تَأْتِيْ عَلَيْهَا مِائَةُ سَنَةٍ، وَ هِيَ حَيَّةٌ يَوْمَئِذٍ ] [ مسلم، فضائل الصحابۃ، باب بیان معنی قولہ صلی اللہ علیہ وسلم : علی رأس مائۃ… : ۲۵۳۸ ] ’’کوئی بھی جان جو آج پیدا ہو چکی ہے اس پر سسو سال نہیں آئیں گے کہ وہ اس وقت زندہ ہو۔‘‘ جو لوگ خضر علیہ السلام کے زندہ ہونے کے قائل ہیں ان کے پاس کوئی صحیح دلیل نہیں ہے، ابن قیم رحمہ اللہ نے فرمایا کہ وہ تمام روایات جن میں خضر علیہ السلام کے اب تک زندہ ہونے کا ذکر ہے سب جھوٹی ہیں۔ سب سے بڑی دلیل جو وہ حضرات بیان کرتے ہیں، یہ ہے کہ بہت سے صالحین سے ان کی ملاقات ہوئی ہے، حالانکہ اسے دلیل کہنا دلیل کی توہین ہے، کیونکہ جنھوں نے انھیں دیکھا ہے انھیں کیسے معلوم ہوا کہ وہ خضر ہیں؟ کیا انھوں نے پہلے خضر علیہ السلام کو دیکھا ہے کہ ملاقات پر وہ انھیں پہچان گئے؟ رہا کسی ملنے والے کے کہنے سے کہ ’’میں خضر ہوں‘‘ اسے خضر مان لینا سادہ لوحی کی انتہا ہے، جس سے فائدہ اٹھا کر شیطان نے بے شمار لوگوں کو گمراہ کیا ہے، مگر وہ سب وہی ہیں جو صحابہ کے بعد آئے، کیونکہ صحابہ رضی اللہ عنھم آسانی سے شیطان کے فریب میں آنے والے نہیں تھے۔ صحیح بخاری اور ترمذی میں جس عین الحیاۃ (آبِ حیات) کا ذکر ہے وہ رسول اللہ صلی اللہ علیہ وسلم سے ثابت نہیں اور آپ کے سوا کسی دوسرے کے قول سے کوئی بات ثابت نہیں ہوتی۔ ¤ ➋ { اٰتَيْنٰهُ رَحْمَةً مِّنْ عِنْدِنَا … :} قرآن مجید میں {’’ رَحْمَةً مِّنْ رَّبِّكَ ‘‘} سے مراد نبوت کئی جگہ لی گئی ہے، جیسا کہ فرمایا : «وَ قَالُوْا لَوْ لَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيْمٍ (31) اَهُمْ يَقْسِمُوْنَ رَحْمَتَ رَبِّكَ » [ الزخرف:۳۱، ۳۲ ] ’’اور انھوں نے کہا یہ قرآن ان دو بستیوں میں سے کسی بڑے آدمی پر کیوں نازل نہ کیا گیا؟ کیا وہ تیرے رب کی رحمت (یعنی نبوت) تقسیم کرتے ہیں؟‘‘ مزید دیکھیے سورۂ دخان (۵، ۶) اور قصص (۸۶) اور ’’اللہ کی طرف سے علم‘‘ بول کر وحی اور نبوت مراد لی گئی ہے۔ دیکھیے سورۂ نساء (۱۱۳) اگرچہ یہ الفاظ نبوت کے ساتھ خاص نہیں، مگر ان کے ساتھ {’’ وَ مَا فَعَلْتُهٗ عَنْ اَمْرِيْ ‘‘} واضح دلیل ہے کہ یہاں ان الفاظ سے مراد نبوت اور وحی الٰہی ہی ہے اور بلاشک و شبہ خضر علیہ السلام اللہ کے نبی تھے۔ (شنقیطی) علم لدنی سے صرف اولیاء کا علم مراد لینا اور انھیں نبیوں سے بھی اونچا درجہ دینا صاف الحاد اور بے دینی ہے، جس کے ذریعے سے زندیق لوگ شریعت کا طوق گردن سے اتار پھینکنا چاہتے ہیں۔ اللہ کے احکام جو شیطان کے ہر قسم کے دخل سے محفوظ ہوں، صرف انبیاء کے ذریعے سے نازل ہوتے ہیں۔ دیکھیے سورۂ جن (۲۶ تا ۲۸) اور سورۂ حج (۵۲) جو شخص کسی اور کو یہ درجہ دے وہ کافر ہے، اسے توبہ کروائی جائے، اگر نہ کرے تو اسے قتل کر دیا جائے۔ (قرطبی ملخص) ¤ ➌ خضر علیہ السلام کے عالم الغیب نہ ہونے کی دلیل ان کا موسیٰ علیہ السلام سے یہ پوچھنا ہے کہ اس سرزمین میں سلام کیسا؟ پھر موسیٰ علیہ السلام کے اپنا نام بتانے پر ان کا یہ پوچھنا کہ بنی اسرائیل والے موسیٰ؟ پھر ان کا موسیٰ علیہ السلام سے صاف کہنا کہ آپ کے پاس جو علم ہے وہ میں نہیں جانتا…۔ پھر اپنے اور موسیٰ علیہ السلام کے علم کو اللہ کے علم سے چڑیا کی چونچ کے پانی کو دریا سے نسبت کی طرح قرار دینا ہے۔ کس قدر بدنصیب ہیں وہ لوگ جو خضر علیہ السلام کو نبی کے بجائے ولی قرار دیتے ہیں، پھر ان کے چند واقعات کو سامنے رکھ کر اولیاء کو علم لدنی کا ضمیمہ لگا کر عالم الغیب بنا دیتے ہیں۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66تا70) ان آیات اور گزشتہ آیات میں اپنے علم پر عجب سے پرہیز، طلب علم کے لیے سفر، آخری دم تک حصول علم کا عزم مصمم، استاذ کے سامنے طلب علم کے لیے درخواست کا طریقہ، استاد کا ادب، اس کے کسی حکم کی نافرمانی نہ کرنا، اپنے کسی بھی کام یا عہد میں اپنے آپ پر بھروسے کے بجائے ان شاء اللہ کہہ کر اسے اللہ کے سپرد کرنا سکھایا گیا ہے اور یہ کہ استاذ تعلیم کے لیے شاگرد پر بعض شرطیں عائد کر سکتا ہے۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 66تا70) ان آیات اور گزشتہ آیات میں اپنے علم پر عجب سے پرہیز، طلب علم کے لیے سفر، آخری دم تک حصول علم کا عزم مصمم، استاذ کے سامنے طلب علم کے لیے درخواست کا طریقہ، استاد کا ادب، اس کے کسی حکم کی نافرمانی نہ کرنا، اپنے کسی بھی کام یا عہد میں اپنے آپ پر بھروسے کے بجائے ان شاء اللہ کہہ کر اسے اللہ کے سپرد کرنا سکھایا گیا ہے اور یہ کہ استاذ تعلیم کے لیے شاگرد پر بعض شرطیں عائد کر سکتا ہے۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 66تا70) ان آیات اور گزشتہ آیات میں اپنے علم پر عجب سے پرہیز، طلب علم کے لیے سفر، آخری دم تک حصول علم کا عزم مصمم، استاذ کے سامنے طلب علم کے لیے درخواست کا طریقہ، استاد کا ادب، اس کے کسی حکم کی نافرمانی نہ کرنا، اپنے کسی بھی کام یا عہد میں اپنے آپ پر بھروسے کے بجائے ان شاء اللہ کہہ کر اسے اللہ کے سپرد کرنا سکھایا گیا ہے اور یہ کہ استاذ تعلیم کے لیے شاگرد پر بعض شرطیں عائد کر سکتا ہے۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 66تا70) ان آیات اور گزشتہ آیات میں اپنے علم پر عجب سے پرہیز، طلب علم کے لیے سفر، آخری دم تک حصول علم کا عزم مصمم، استاذ کے سامنے طلب علم کے لیے درخواست کا طریقہ، استاد کا ادب، اس کے کسی حکم کی نافرمانی نہ کرنا، اپنے کسی بھی کام یا عہد میں اپنے آپ پر بھروسے کے بجائے ان شاء اللہ کہہ کر اسے اللہ کے سپرد کرنا سکھایا گیا ہے اور یہ کہ استاذ تعلیم کے لیے شاگرد پر بعض شرطیں عائد کر سکتا ہے۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 66تا70) ان آیات اور گزشتہ آیات میں اپنے علم پر عجب سے پرہیز، طلب علم کے لیے سفر، آخری دم تک حصول علم کا عزم مصمم، استاذ کے سامنے طلب علم کے لیے درخواست کا طریقہ، استاد کا ادب، اس کے کسی حکم کی نافرمانی نہ کرنا، اپنے کسی بھی کام یا عہد میں اپنے آپ پر بھروسے کے بجائے ان شاء اللہ کہہ کر اسے اللہ کے سپرد کرنا سکھایا گیا ہے اور یہ کہ استاذ تعلیم کے لیے شاگرد پر بعض شرطیں عائد کر سکتا ہے۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71تا73) ان آیات سے اولو العزم پیغمبروں سے بھول کا صادر ہونا ثابت ہوتا ہے اور کامل استاذ کا شاگرد کی غلطی پر مؤاخذہ، پہلی غلطی پر مؤاخذہ میں نسبتاً نرمی کرنے ( {’’ اَلَمْ اَقُلْ ‘‘ ’’ اَلَمْ اَقُلْ لَّكَ ‘‘} سے نرم ہے) اور بھول کے عذر پر درگزر کرنے کا سبق حاصل ہوتا ہے۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 71تا73) ان آیات سے اولو العزم پیغمبروں سے بھول کا صادر ہونا ثابت ہوتا ہے اور کامل استاذ کا شاگرد کی غلطی پر مؤاخذہ، پہلی غلطی پر مؤاخذہ میں نسبتاً نرمی کرنے ( {’’ اَلَمْ اَقُلْ ‘‘ ’’ اَلَمْ اَقُلْ لَّكَ ‘‘} سے نرم ہے) اور بھول کے عذر پر درگزر کرنے کا سبق حاصل ہوتا ہے۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 71تا73) ان آیات سے اولو العزم پیغمبروں سے بھول کا صادر ہونا ثابت ہوتا ہے اور کامل استاذ کا شاگرد کی غلطی پر مؤاخذہ، پہلی غلطی پر مؤاخذہ میں نسبتاً نرمی کرنے ( {’’ اَلَمْ اَقُلْ ‘‘ ’’ اَلَمْ اَقُلْ لَّكَ ‘‘} سے نرم ہے) اور بھول کے عذر پر درگزر کرنے کا سبق حاصل ہوتا ہے۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) ➊ { حَتّٰۤى اِذَا لَقِيَا غُلٰمًا فَقَتَلَهٗ:} اس آیت سے معلوم ہوتا ہے کہ وہ لڑکا جوان تھا، اگرچہ وہ اپنے جیسے لڑکوں کے ساتھ کھیل رہا تھا۔ کیونکہ گزشتہ حدیث میں ہے کہ وہ کافر تھا جب کہ اس کے والدین مومن تھے، اگر وہ بچہ ہوتا تو اسے کافر نہ کہا جاتا، کیونکہ مومنوں کی اولاد کو بچپن میں کافر نہیں کہا جاتا۔ موسیٰ علیہ السلام نے بھی اسے کسی کو قتل نہ کرنے کی وجہ سے بے گناہ کہا ہے، بچہ ہونے کی وجہ سے نہیں۔ اس لیے خضر علیہ السلام کا اللہ کے حکم سے ایک کافر کو قتل کرنا کوئی جائے اعتراض نہیں۔ ’’غلام‘‘ کا لفظ بچے کے علاوہ جوان اور ادھیڑ عمر پر بھی بولا جاتا ہے، جیسا کہ حدیث معراج میں موسیٰ علیہ السلام نے ہمارے نبی صلی اللہ علیہ وسلم کو {’’هٰذَا الْغُلَامُ‘‘‘} کہا ہے۔ [ بخاری : ۳۲۰۷ ] ¤ ➋ بعض حضرات نے اس سوال کے جواب میں کہ خضر علیہ السلام کے لیے اس لڑکے کا قتل کیونکر جائز تھا، خضر علیہ السلام کو فرشتوں میں سے قرار دیا ہے جو اللہ کے حکم سے تکوینی امور سرانجام دیتے ہیں، مگر یہ بات درست نہیں، کیونکہ کارکنانِ قضا و قدرنہ کھاتے ہیں، نہ مہمان نوازی کے طور پر کھانے کا سوال کرتے ہیں۔ ابراہیم علیہ السلام کا بھنا ہوا بچھڑا پیش کرنے کا واقعہ اس کی دلیل ہے۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 76،75) { قَالَ اَلَمْ اَقُلْ لَّكَ :} ’’کیا میں نے تجھے نہیں کہا تھا‘‘ ان الفاظ میں تنبیہ پہلے سے سخت ہے۔ یہ بھی معلوم ہوا کہ درگزر دو دفعہ ہوتی ہے، تیسری دفعہ کوئی معاف نہ کرے تو وہ حق بجانب اور معذور ہے اور یہ کہ استاذ اگر سمجھے کہ میں طالب علم کو نہیں پڑھا سکتا تو وہ عذر کر سکتا ہے۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76،75) { قَالَ اَلَمْ اَقُلْ لَّكَ :} ’’کیا میں نے تجھے نہیں کہا تھا‘‘ ان الفاظ میں تنبیہ پہلے سے سخت ہے۔ یہ بھی معلوم ہوا کہ درگزر دو دفعہ ہوتی ہے، تیسری دفعہ کوئی معاف نہ کرے تو وہ حق بجانب اور معذور ہے اور یہ کہ استاذ اگر سمجھے کہ میں طالب علم کو نہیں پڑھا سکتا تو وہ عذر کر سکتا ہے۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77) { اسْتَطْعَمَاۤ اَهْلَهَا :} بعض صوفیوں نے اس آیت سے گدائی کے مستحب ہونے کا استدلال کیا ہے اور اسے باقاعدہ سالک کے آداب میں شمار کیا ہے، اس لیے عموماً صوفی لوگ روزی کمانے کے بجائے گدائی کو اور دوسروں کے ٹکڑوں پر پلنے کو کمال ولایت و توکل سمجھتے ہیں اور اس کام میں مہارت رکھتے ہیں، حالانکہ یہ ان کی جہالت ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا زَالَ الرَّجُلُ يَسْأَلُ النَّاسَ حَتّٰی يَأْتِيَ يَوْمَ الْقِيَامَةِ لَيْسَ فِيْ وَجْهِهِ مُزْعَةُ لَحْمٍ ] [ بخاري، الزکوٰۃ، باب من سأل تکثرًا : ۱۴۷۴۔ مسلم : 1040/104 ] ’’آدمی لوگو ں سے مانگتا رہتا ہے، یہاں تک کہ وہ قیامت کے دن اس حال میں آئے گا کہ اس کے منہ پر گوشت کی بوٹی نہیں ہو گی۔‘‘ ان دونوں انبیاء نے اپنے حق کا سوال کیا ہے جو بطور ضیافت بستی والوں پر فرض تھا۔ عقبہ بن عامر رضی اللہ عنہ نے بیان کیا کہ ہم نے نبی صلی اللہ علیہ وسلم سے عرض کی: [ إِنَّكَ تَبْعَثُنَا فَنَنْزِلُ بِقَوْمٍ لَا يَقْرُوْنَنَا، فَمَا تَرَی فِيْهِ؟ فَقَالَ لَنَا إِنْ نَزَلْتُمْ بِقَوْمٍ فَأُمِرَ لَكُمْ بِمَاا يَنْبَغِيْ لِلضَّيْفِ فَاقْبَلُوْا، فَإِنْ لَّمْ يَفْعَلُوْا فَخُذُوْا مِنْهُمْ حَقَّ الضَّيْفِ ] [ بخاري، المظالم، باب قصاص المظلوم إذا وجد مال ظالمہ : ۲۴۶۱۔ مسلم : ۱۷۲۷ ] ’’آپ ہمیں بھیجتے ہیں اور ہم کسی قوم کے پاس جاتے ہیں اور وہ ہماری ضیافت نہیں کرتے، تو آپ اس بارے میں کیا فرماتے ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے ہمیں فرمایا : ’’اگر تم کسی قوم کے پاس جاؤ اور تمھارے لیے ان چیزوں کا حکم دیا جائے جو مہمان کے لیے چاہییں تو قبول کر لو، اگر وہ ایسا نہ کریں تو ان سے مہمان کا حق لے لو۔‘‘"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) { هٰذَا فِرَاقُ :} اس پر اصل میں تنوین تھی، پھر تخفیف کے لیے مضاف کر دیا۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79) { فَكَانَتْ لِمَسٰكِيْنَ …:} اس آیت میں کشتی کا مالک ہونے اور اسے کرایہ پر چلانے کے باوجود ان لوگوں کو مسکین کہا گیا ہے۔ معلوم ہوا کہ مسکین وہ ہے جس کی آمدنی اس کی ضروریات سے کم ہو، یعنی وہ ضرورت مند لوگ جو نہ مانگتے ہیں اور نہ کسی کو ان کی حالت کی خبر ہوتی ہے کہ ان پر صدقہ کریں۔ [ دیکھیے بخاري، الزکوٰۃ، باب قول اللہ عز و جل : « لا یسئلون الناس إلحافا…» : ۱۴۷۹۔ مسلم : ۱۰۳۹، عن أبي ھریرۃ رضی اللہ عنہ ] فقیر کی حالت مسکین سے بدتر ہوتی ہے۔ {’’ وَ كَانَ وَرَآءَهُمْ ‘‘} کا معنی ابن عباس رضی اللہ عنھما نے ’’ان کے آگے‘‘ کیا ہے۔ [ بخاري، التفسیر، باب قولہ : « فلما بلغا مجمع بینھما نسیا …» : ۴۷۲۶ ]"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 81،80) { وَ اَمَّا الْغُلٰمُ فَكَانَ اَبَوٰهُ مُؤْمِنَيْنِ … :} ان آیات سے معلوم ہوا کہ اللہ تعالیٰ کس طرح اپنے مومن بندوں کی آنے والے فتنوں سے بھی حفاظت کرتا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اِنَّ اللّٰهَ يُدٰفِعُ عَنِ الَّذِيْنَ اٰمَنُوْا }» [ الحج : ۳۸ ] ’’بے شک اللہ ان لوگوں کی طرف سے دفاع کرتا ہے جو ایمان لائے۔‘‘"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81،80) { وَ اَمَّا الْغُلٰمُ فَكَانَ اَبَوٰهُ مُؤْمِنَيْنِ … :} ان آیات سے معلوم ہوا کہ اللہ تعالیٰ کس طرح اپنے مومن بندوں کی آنے والے فتنوں سے بھی حفاظت کرتا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اِنَّ اللّٰهَ يُدٰفِعُ عَنِ الَّذِيْنَ اٰمَنُوْا }» [ الحج : ۳۸ ] ’’بے شک اللہ ان لوگوں کی طرف سے دفاع کرتا ہے جو ایمان لائے۔‘‘"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) ➊ { وَ كَانَ اَبُوْهُمَا صَالِحًا :} اللہ تعالیٰ اپنے صالح بندوں کی وفات کے بعد بھی ان کی مومن اولاد کی خاص نگہداشت فرماتا ہے اور قیامت کو بھی انھیں خاص رعایت دے گا۔ دیکھیے سورۂ طور (۲۱)۔ ¤ ➋ ان تینوں واقعات کی اصل حقیقت بیان کرتے ہوئے خضر علیہ السلام نے اللہ تعالیٰ کے ساتھ حسن ادب کو خاص طور پر ملحوظ رکھا ہے۔ کشتی کو عیب دار کرنے کی نسبت اپنی طرف کی ہے، لڑکے کے قتل کے ارادہ کی نسبت اپنی طرف اور اس کے صالح باپ کو بہتر اولاد عطا کرنے کی نسبت اللہ تعالیٰ کی طرف فرمائی ہے اور یتیم لڑکوں کے بالغ ہو کر اپنا خزانہ سنبھالنے کے ارادہ کی نسبت اللہ تعالیٰ کی طرف فرمائی ہے۔ ¤ ➌ {وَ مَا فَعَلْتُهٗ عَنْ اَمْرِيْ :} یہ خضر علیہ السلام کے نبی ہونے کی واضح دلیل ہے، کیونکہ کسی ولی کو اللہ کی طرف سے الہام کی بنا پر کسی بد سے بد کو بھی قتل کرنے ے کی اجازت نہیں، کیونکہ اس کے الہام میں شیطان دخیل ہو سکتا ہے۔ {’’ لَمْ تَسْطِعْ ‘‘} اصل میں {’’ لَمْ تَسْتَطِعْ‘‘} تھا، تخفیف کے لیے تاء کو حذف کر دیا۔ خضر علیہ السلام کے کلام کی ابتدا میں {’’ لَمْ تَسْتَطِعْ‘‘} ہے، کیونکہ وہاں بات شروع ہو رہی ہے، اختصار کی ضرورت نہیں، بات ختم ہونے پر قصہ مختصر کیا جاتا ہے، اس لیے یہاں {’’ لَمْ تَسْطِعْ ‘‘} فرمایا۔ ایک وجہ یہ بھی بیان کی جاتی ہے کہ وضاحت نہ ہونے کی وجہ سے ذہنی بوجھ تھا تو ثقیل لفظ بولا اور وضاحت کے بعد بوجھ اتر جانے پر خفیف لفظ بولا ہے۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) ➊ { وَ يَسْـَٔلُوْنَكَ عَنْ ذِي الْقَرْنَيْنِ:} واؤ کے ساتھ ذوالقرنین کے قصے کا موسیٰ علیہ السلام کے قصے پر عطف ہے۔ بقاعی رحمہ اللہ نے فرمایا، موسیٰ علیہ السلام کے خضر علیہ السلام کے ساتھ قصہ میں علم کے حصول کے لیے سفروں کا ذکر تھا اور ذوالقرنین کے قصہ میں جہاد فی سبیل اللہ کے لیے سفروں کا ذکر ہے۔ چونکہ علم عمل کی بنیاد ہے اس لیے اس کا ذکر پہلے فرمایا۔ ایک مناسبت یہ ہے کہ دو باغوں والے شخص اور ابلیس کے تکبر اور ان کے انجام کے بعد موسیٰ علیہ السلام جیسے اولو العزم پیغمبر کا اتنے مرتبے کے باوجود اور ذوالقرنین جیسے عظیم بادشاہ کا مشرق و مغرب کی سلطنت کے باوجود ہر قسم کے کبر و غرور سے پاک ہونے کا اور حد درجہ کی تواضع اختیار کرنے کا ذکر فرمایا، تاکہ ان کے نقش قدم پر چلا جائے۔ ¤ ➋ ذوالقرنین کون تھا، کس ملک کا تھا، قرآن و حدیث میں اس کا ذکر نہیں۔ البتہ اتنا واضح ہے کہ عرب کے لوگ اس سے واقف تھے۔ ان کے شعروں میں بھی اس کا ذکر موجود ہے، اس لیے انھوں نے اس کے متعلق سوال کیا، مگر ان سے گزشتہ فاتح فرماں رواؤں میں سے کسی ایک کی تعیین نہیں ہوتی، اس لیے مفسرین میں اس کے متعلق بہت ہی اختلاف ہے۔ آلوسی رحمہ اللہ نے فرمایا کہ ابوریحان البیرونی نے اپنی کتاب {’’ اَلْآثَارُ الْبَاقِيَةُ عَنِ الْقُرُوْنِ الْخَالِيَةِ ‘‘} میں ذکر کیا ہے کہ ذوالقرنین (یمن کا) ابوکرب حمیری ہے، جس کی اولاد ہونے پر، مشرق و مغرب کا بادشاہ ہونے پر اور مسلم ہونے پر تبع یمنی نے اپنے اشعار میں فخر کا اظہار کیا ہے، جو روح المعانی میں منقول ہیں۔ البیرونی نے اس قول کے حقیقت کے سب سے زیادہ قریب ہونے کا ایک قرینہ یہ لکھا ہے کہ یمن کے بادشاہوں کے لقب لفظ ’’ذو ‘‘ سے شروع ہوتے تھے، جیسے ذو نواس اور ذویزن وغیرہ۔ بعض نے یونانی فاتح سکندر مقدونی کو اس کا مصداق ٹھہرایا ہے، جیسے علامہ قاسمی رحمہ اللہ وغیرہ، جب کہ بہت سے مفسرین مثلاً ابن قیم، طنطاوی اور آلوسی وغیرہ نے شدت سے اس کی تردید کی ہے، کیونکہ یہ سکندر ارسطو کا شاگرد اور بت پرست تھا، جب کہ قرآن میں مذکور ذوالقرنین مومن، موحد اور متقی تھا۔ برصغیر کے ایک مفسر نے ذو القرنین کے متعلق قرآن میں مذکور صفات ایرانی بادشاہ خورس پر چسپاں کرنے کی کوشش کی ہے، ان کے بعد آنے والے ایک صاحب نے تاریخ اور بائبل سے خورس ہی کو سب سے زیادہ ذوالقرنین کا مصداق ٹھہرانے کا حق دار قرار دیا ہے۔ ¤ اشرف الحواشی میں ہے کہ بعض کے نزدیک اس سے مراد ایک اور بادشاہ ہے جو ابراہیم علیہ السلام کا ہم عصر تھا اور ابراہیم علیہ السلام کی دعا ہی سے اللہ تعالیٰ نے اسے خارق عادت اسباب و وسائل عطا فرمائے۔ اس کے وزیر خضر تھے، اس لیے خضر کے قصے کے ساتھ اس کا قصہ بیان کیا ہے۔ حافظ ابن حجر رحمہ اللہ نے فتح الباری میں اور ابن کثیر رحمہ اللہ نے اپنی تفسیر میں اس کو ترجیح دی ہے۔ ابن کثیر نے اس کا نام بھی اسکندر بیان کیا ہے۔ یہ ہیں بڑے بڑے اہل علم یا متجد دین کے اقوال جن کا ماخذ جاہلی اشعار ہیں، جن کی کوئی سند نہیں، یا زمانۂ قبل مسیح کی تاریخ، جس کے مؤرخین کا حال قابل اعتماد ذرائع سے معلوم ہے نہ ان کی ثقاہت، یا آثار قدیمہ ہیں جن کی معدوم زبانیں یورپی کفار نے اندازے سے پڑھیں، جو کسی طرح بھی اعتماد کے قابل نہیں، یا بائبل جس میں مذکور باتوں کو (جو نہ قرآن و حدیث کے مطابق ہوں نہ مخالف) ہم رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق نہ سچا کہہ سکتے ہیں نہ جھوٹا۔ پھر ایسی باتوں پر یقین کیسے ہو سکتا ہے!؟ لطف یہ ہے کہ جو بھی نیا مفسر نئی سے نئی بات نکال کر قدیم تاریخ، آثار قدیمہ، جاہلی اشعار، بائبل کے اقوال کا ڈھیر لگا دیتا ہے وہ اتنا ہی بڑا صاحب کمال گنا جاتا ہے، حالانکہ ان میں سے کسی سے بھی یقین کی دولت حاصل نہیں ہوتی۔ حقیقت یہ ہے کہ قرآن مجید کسی قصے کو تاریخ کے طور پر بیان نہیں کرتا، بلکہ اس کے ان حصوں کو اجاگر کرتا ہے جن سے عبرت اور سبق حاصل ہو۔ قرآن کے مطابق ذوالقرنین اللہ کا نیک بندہ تھا جس نے جہاد فی سبیل اللہ کے ذریعے سے مشرق سے مغرب تک اللہ کے دین کو غالب کیا اور اپنے محروسہ (ماتحت) ممالک میں امن قائم کیا اور انھیں دشمنوں سے محفوظ رکھنے کی نہایت عمدہ تدبیر کی۔ اگر ہم کسی قابل یقین ذریعے سے اس کی تعیین نہ کر سکیں یا اس کے مفصل حالات معلوم نہ کر سکیں تو قرآن کے منشا و مقصد میں کوئی خلل واقع نہیں ہوتا۔ آخر کتنے ہی نبی ہیں جن کے نام قرآن و حدیث میں نہیں۔ دیکھیے سورۂ مومن (۷۸) تو کیا اس لیے کہ اللہ تعالیٰ نے فرمایا ہے کہ ہر امت میں کوئی نہ کوئی ڈرانے والا گزرا ہے، ہم ان ناقابل اعتماد ذرائع سے ہند، چین، روس، یورپ اور افریقہ میں آنے والے نبیوں کے نام متعین کرنے کی بے کار کوششوں میں وقت ضائع کریں گے، تاکہ لوگ کہیں واہ ! کیا بات نکالی ہے۔ ¤ ➌ ذوالقرنین کے اس لقب کی مختلف وجہیں بیان کی گئی ہیں، کیونکہ قرن کے کئی معانی ہیں، سینگ، کنارا، بالوں کی مینڈھی۔ دو سینگوں والا سے مراد مرد شجاع ہے، کیونکہ عرب شجاع آدمی کو کبش کہتے ہیں، کیونکہ مینڈھا اپنے سینگوں سے ٹکر مارتا ہے۔ دوسری وجہ یہ ہے کہ اس کے تاج پر دو سینگ بنے ہوئے تھے۔ تیسری وجہ یہ ہے کہ وہ زمین کے مشرق و مغرب کے دونوں کناروں تک پہنچا۔ چوتھی یہ کہ اس کے سر کے بالوں کی دو مینڈھیاں بنی ہوئی تھیں۔ یہ چاروں باتیں بیک وقت بھی وجہ تسمیہ ہو سکتی ہیں۔ ¤ ➍ {قُلْ سَاَتْلُوْا عَلَيْكُمْ مِّنْهُ ذِكْرًا : ’’ ذِكْرًا ‘‘} تنوین کی وجہ سے ترجمہ ’’کچھ ذکر‘‘ کیا گیا ہے، یعنی اس کی پوری تاریخ نہیں بلکہ کچھ ذکر بیان کروں گا جس سے تم نصیحت اور سبق حاصل کر سکو۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84) { اِنَّا مَكَّنَّا لَهٗ فِي الْاَرْضِ …: ’’ مَكَّنَّا ‘‘} سے مراد حکومت و اقتدار ہے۔ دیکھیے سورۂ حج (۴۱) ہر چیز میں سے کچھ سامان سے مراد وہ تمام وسائل ہیں جن کی اقتدار کے لیے ضرورت ہوتی ہے، مثلاً شجاعت، قوت، تدبیر و رائے، فوج، دولت، اسلحہ، سامان سفر، تعمیر و ترقی کے ذرائع وغیرہ۔ ان اسباب کی تفصیل میں بعض مفسرین کی اسرائیلی روایات پر مبنی عجیب و غریب روایات کی کچھ حیثیت نہیں اور نہ کسی صحیح حدیث میں ان کا پتا ملتا ہے۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 86،85) ➊ { فَاَتْبَعَ سَبَبًا : ’’ تَبِعَ ‘‘} ساتھ گیا، {’’أَتْبَعَ‘‘} (افعال) ساتھ لے گیا، یعنی اس نے اپنے اقتدار کو مضبوط اور وسیع کرنے کے لیے اور پوری زمین پر اللہ کا کلمہ غالب کرنے کے لیے ایک لمبے سفر کی تیاری کی اور اس کے لیے درکار افواج، اسلحہ اور سامان سفر ساتھ لے کر مغرب کی طرف جہاد فی سبیل اللہ کے لیے نکل پڑا۔ راستے میں ہر مقابل کو زیر کرتا ہوا اور ہر رکاوٹ کو روندتا ہوا زمین کے اس حصے تک جا پہنچا جہاں تک اس وقت آبادی موجود تھی اور سفر ممکن تھا، اس سے آگے سمندر سے پہلے وسیع و عریض دلدلی علاقہ تھا، جس میں نہ خشکی کے ذرائع سے سفر ہو سکتا تھا، نہ بحری ذرائع سے۔ وہاں اس نے سورج غروب ہونے کا مشاہدہ کیا تو وہ اسے ایک کیچڑ والے چشمے میں غروب ہوتا ہوا نظر آیا، کیونکہ آگے سمندر کے اثر سے اور چشموں کی کثرت سے زمین دلدل اور کیچڑ بنی ہوئی تھی۔ جس طرح سمندر، صحرا یا میدان میں سے جو چیز بھی سامنے ہو سورج اسی میں غروب ہوتا ہوا نظر آتا ہے۔ بعض لوگوں نے جو اعتراض کیا ہے کہ قرآن کے بیان کے مطابق سورج کیچڑ والے چشمے میں غروب ہوتا ہے، انھوں نے غور ہی نہیں کیا کہ قرآن نے ذوالقرنین کا مشاہدہ بیان فرمایا ہے اور اب بھی دیکھنے والے کو ایسے ہی نظر آئے گا۔ اصل حقیقت دوسری جگہ بیان فرمائی ہے، فرمایا : «{ وَ الشَّمْسُ تَجْرِيْ لِمُسْتَقَرٍّ لَّهَا }» [ یٰس : ۳۸ ] ’’اور سورج اپنے ایک ٹھکانے کے لیے چل رہا ہے (جسے اللہ تعالیٰ ہی جانتا ہے)۔‘‘ ¤ ➋ { قُلْنَا يٰذَا الْقَرْنَيْنِ … :} یعنی مغرب کی طرف آبادی کے آخری حصے میں اس نے ایک قوم کو پایا تو ہم نے کہا کہ اے ذو القرنین! تمھیں اختیار ہے، چاہو تو انھیں قتل، قید یا غلامی کی صورت میں یا جس طرح چاہو سزا دو، یا ان کے بارے میں کوئی نیک سلوک اختیار کرو۔ ¤ ➌ اللہ تعالیٰ کے فرمان {’’ قُلْنَا يٰذَا الْقَرْنَيْنِ ‘‘} (ہم نے کہا اے ذو القرنین!) کو بعض مفسرین نے ذوالقرنین کے نبی ہونے کی دلیل قرار دیا ہے، مگر یہ الفاظ اس مفہوم کے لیے صریح نہیں ہیں، کیونکہ یہ بھی ہو سکتا ہے کہ اس کے ساتھ طالوت کی طرح کوئی نبی ہو، جس کے ذریعے سے اللہ تعالیٰ نے اسے یہ پیغام دیا ہو، جیسے فرمایا : «{ فَقُلْنَا اضْرِبُوْهُ بِبَعْضِهَا }» [ البقرۃ : ۷۳ ] ’’تو ہم نے کہا اس پر اس کا کوئی ٹکڑا مارو۔‘‘ یا اس قوم کو مکمل طور پر ذوالقرنین کے اختیار میں دینے کی حالت کو ان الفاظ میں ادا کیا گیا ہو، اس لیے اکثر سلف اس کے نبی ہونے کے قائل نہیں۔ البتہ اس میں کوئی شک نہیں کہ وہ اللہ کا نیک، مخلص اور مجاہد بندہ تھا، جس نے اپنے آرام کو چھوڑ کر ساری زندگی غلبۂ اسلام کے لیے جہاد میں صرف کر دی۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86،85) ➊ { فَاَتْبَعَ سَبَبًا : ’’ تَبِعَ ‘‘} ساتھ گیا، {’’أَتْبَعَ‘‘} (افعال) ساتھ لے گیا، یعنی اس نے اپنے اقتدار کو مضبوط اور وسیع کرنے کے لیے اور پوری زمین پر اللہ کا کلمہ غالب کرنے کے لیے ایک لمبے سفر کی تیاری کی اور اس کے لیے درکار افواج، اسلحہ اور سامان سفر ساتھ لے کر مغرب کی طرف جہاد فی سبیل اللہ کے لیے نکل پڑا۔ راستے میں ہر مقابل کو زیر کرتا ہوا اور ہر رکاوٹ کو روندتا ہوا زمین کے اس حصے تک جا پہنچا جہاں تک اس وقت آبادی موجود تھی اور سفر ممکن تھا، اس سے آگے سمندر سے پہلے وسیع و عریض دلدلی علاقہ تھا، جس میں نہ خشکی کے ذرائع سے سفر ہو سکتا تھا، نہ بحری ذرائع سے۔ وہاں اس نے سورج غروب ہونے کا مشاہدہ کیا تو وہ اسے ایک کیچڑ والے چشمے میں غروب ہوتا ہوا نظر آیا، کیونکہ آگے سمندر کے اثر سے اور چشموں کی کثرت سے زمین دلدل اور کیچڑ بنی ہوئی تھی۔ جس طرح سمندر، صحرا یا میدان میں سے جو چیز بھی سامنے ہو سورج اسی میں غروب ہوتا ہوا نظر آتا ہے۔ بعض لوگوں نے جو اعتراض کیا ہے کہ قرآن کے بیان کے مطابق سورج کیچڑ والے چشمے میں غروب ہوتا ہے، انھوں نے غور ہی نہیں کیا کہ قرآن نے ذوالقرنین کا مشاہدہ بیان فرمایا ہے اور اب بھی دیکھنے والے کو ایسے ہی نظر آئے گا۔ اصل حقیقت دوسری جگہ بیان فرمائی ہے، فرمایا : «{ وَ الشَّمْسُ تَجْرِيْ لِمُسْتَقَرٍّ لَّهَا }» [ یٰس : ۳۸ ] ’’اور سورج اپنے ایک ٹھکانے کے لیے چل رہا ہے (جسے اللہ تعالیٰ ہی جانتا ہے)۔‘‘ ¤ ➋ { قُلْنَا يٰذَا الْقَرْنَيْنِ … :} یعنی مغرب کی طرف آبادی کے آخری حصے میں اس نے ایک قوم کو پایا تو ہم نے کہا کہ اے ذو القرنین! تمھیں اختیار ہے، چاہو تو انھیں قتل، قید یا غلامی کی صورت میں یا جس طرح چاہو سزا دو، یا ان کے بارے میں کوئی نیک سلوک اختیار کرو۔ ¤ ➌ اللہ تعالیٰ کے فرمان {’’ قُلْنَا يٰذَا الْقَرْنَيْنِ ‘‘} (ہم نے کہا اے ذو القرنین!) کو بعض مفسرین نے ذوالقرنین کے نبی ہونے کی دلیل قرار دیا ہے، مگر یہ الفاظ اس مفہوم کے لیے صریح نہیں ہیں، کیونکہ یہ بھی ہو سکتا ہے کہ اس کے ساتھ طالوت کی طرح کوئی نبی ہو، جس کے ذریعے سے اللہ تعالیٰ نے اسے یہ پیغام دیا ہو، جیسے فرمایا : «{ فَقُلْنَا اضْرِبُوْهُ بِبَعْضِهَا }» [ البقرۃ : ۷۳ ] ’’تو ہم نے کہا اس پر اس کا کوئی ٹکڑا مارو۔‘‘ یا اس قوم کو مکمل طور پر ذوالقرنین کے اختیار میں دینے کی حالت کو ان الفاظ میں ادا کیا گیا ہو، اس لیے اکثر سلف اس کے نبی ہونے کے قائل نہیں۔ البتہ اس میں کوئی شک نہیں کہ وہ اللہ کا نیک، مخلص اور مجاہد بندہ تھا، جس نے اپنے آرام کو چھوڑ کر ساری زندگی غلبۂ اسلام کے لیے جہاد میں صرف کر دی۔"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 88،87) { قَالَ اَمَّا مَنْ ظَلَمَ … :} ذوالقرنین نے اپنی فتح و قوت کے نشے میں آکر سب کو تہ تیغ کرنے یا غلام بنانے کے بجائے ہر ایک سے وہ سلوک کرنے کا اظہار کیا جس کے وہ لائق تھا۔ {’’ اَمَّا مَنْ ظَلَمَ ‘‘} (جو شخص ظلم کرے گا) سے مراد کفار و مشرکین ہیں۔ دیکھیے سورۂ انعام (۸۲) اس کا ایک قرینہ یہ ہے کہ ان کے مقابلے میں ایمان اور عمل صالح والوں کا ذکر ہے، یعنی کفار و مشرکین میں سے ہر ایک سے اس کے حسب حال سخت سزا کا سلوک کروں گا، جنگ پر آمادہ لوگوں کو قتل اور قید کروں گا اور غلام بناؤں گا۔ دوسروں سے جزیہ لے کر غلام بنا کر رکھوں گا، پھر قیامت کے دن وہ اپنے کفر وشرک کی بہت بری سزا پائیں گے۔ رہے ایمان اور عمل صالح والے تو ان کے لیے بدلے میں بھلائی ہی بھلائی ہے اور ہم ان کے ساتھ اپنے تمام معاملات میں آسانی کا سلوک کریں گے۔ ہمارے نبی صلی اللہ علیہ وسلم نے بھی اپنی جنگوں میں اسی پر عمل فرمایا۔"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88،87) { قَالَ اَمَّا مَنْ ظَلَمَ … :} ذوالقرنین نے اپنی فتح و قوت کے نشے میں آکر سب کو تہ تیغ کرنے یا غلام بنانے کے بجائے ہر ایک سے وہ سلوک کرنے کا اظہار کیا جس کے وہ لائق تھا۔ {’’ اَمَّا مَنْ ظَلَمَ ‘‘} (جو شخص ظلم کرے گا) سے مراد کفار و مشرکین ہیں۔ دیکھیے سورۂ انعام (۸۲) اس کا ایک قرینہ یہ ہے کہ ان کے مقابلے میں ایمان اور عمل صالح والوں کا ذکر ہے، یعنی کفار و مشرکین میں سے ہر ایک سے اس کے حسب حال سخت سزا کا سلوک کروں گا، جنگ پر آمادہ لوگوں کو قتل اور قید کروں گا اور غلام بناؤں گا۔ دوسروں سے جزیہ لے کر غلام بنا کر رکھوں گا، پھر قیامت کے دن وہ اپنے کفر وشرک کی بہت بری سزا پائیں گے۔ رہے ایمان اور عمل صالح والے تو ان کے لیے بدلے میں بھلائی ہی بھلائی ہے اور ہم ان کے ساتھ اپنے تمام معاملات میں آسانی کا سلوک کریں گے۔ ہمارے نبی صلی اللہ علیہ وسلم نے بھی اپنی جنگوں میں اسی پر عمل فرمایا۔"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 90،89) { ثُمَّ اَتْبَعَ سَبَبًا … :} مغرب کی طرف انسانی آبادی کے آخری حصے تک تمام علاقے فتح کرکے اسلام کے زیر نگیں لانے کے بعد اب اس نے مشرق کی طرف آبادی کے آخری حصے تک اسلام کا پیغام پہنچانے کے لیے ایک نہایت طویل اور دشوار سفر کے لیے ہر قسم کا سازوسامان مہیا کیا اور اپنی زبردست افواج اور جنگی سازو سامان ساتھ لے کر بے شمار دریاؤں، پہاڑوں، جنگلوں اور صحراؤں کو عبور کرتا ہوا اور تمام بادشاہوں کو شکست دیتا ہوا مشرق کی طرف آبادی کی ابتدا تک جا پہنچا۔ وہاں اس نے دیکھا کہ سورج ایسے لوگوں پر طلوع ہوتا ہے جن کے پاس سورج کی تپش سے بچنے کے لیے کوئی پردہ تھا نہ مکان، نہ کوئی عمارت، نہ خیمہ، نہ لباس۔ اگرچہ اللہ تعالیٰ نے تفصیل سے ذکر نہیں فرمایا، مگر اہلِ مغرب کے ساتھ اس کے سلوک سے ظاہر ہے کہ اس نے انھیں بھی اسلام کی دعوت دی اور ہر ایک کے ساتھ اس کے رویے کے مطابق سلوک کیا ہے اور انھیں وحشی زندگی کے بجائے تہذیب و تمدن کی تعلیم دی۔"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت 90،89) { ثُمَّ اَتْبَعَ سَبَبًا … :} مغرب کی طرف انسانی آبادی کے آخری حصے تک تمام علاقے فتح کرکے اسلام کے زیر نگیں لانے کے بعد اب اس نے مشرق کی طرف آبادی کے آخری حصے تک اسلام کا پیغام پہنچانے کے لیے ایک نہایت طویل اور دشوار سفر کے لیے ہر قسم کا سازوسامان مہیا کیا اور اپنی زبردست افواج اور جنگی سازو سامان ساتھ لے کر بے شمار دریاؤں، پہاڑوں، جنگلوں اور صحراؤں کو عبور کرتا ہوا اور تمام بادشاہوں کو شکست دیتا ہوا مشرق کی طرف آبادی کی ابتدا تک جا پہنچا۔ وہاں اس نے دیکھا کہ سورج ایسے لوگوں پر طلوع ہوتا ہے جن کے پاس سورج کی تپش سے بچنے کے لیے کوئی پردہ تھا نہ مکان، نہ کوئی عمارت، نہ خیمہ، نہ لباس۔ اگرچہ اللہ تعالیٰ نے تفصیل سے ذکر نہیں فرمایا، مگر اہلِ مغرب کے ساتھ اس کے سلوک سے ظاہر ہے کہ اس نے انھیں بھی اسلام کی دعوت دی اور ہر ایک کے ساتھ اس کے رویے کے مطابق سلوک کیا ہے اور انھیں وحشی زندگی کے بجائے تہذیب و تمدن کی تعلیم دی۔"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت 91) ➊ {كَذٰلِكَ وَ قَدْ اَحَطْنَا … :} یعنی اہلِ مشرق سے اس کا سلوک بھی اہلِ مغرب جیسا تھا، یا مطلب یہ ہے کہ کوئی اس کے مغرب و مشرق اور اس کے درمیان تمام علاقوں کے پامال کرنے کو ناممکن نہ سمجھے، یقینا ایسے ہی ہوا اور اس مقصد کے لیے اس نے جو افواج اور سازو سامان مہیا کیا اور اپنا عیش و آرام ترک کرکے مسلسل سفر اور جنگوں کی جو تکالیف برداشت کیں اس کی پوری خبر ہم ہی کو ہے، کسی دوسرے کو کیا خبر؟ ¤ ➋ ذوالقرنین کی زندگی سے جو سبق حاصل ہوتے ہیں ان میں سے پہلا سبق یہ ہے کہ اقتدار حاصل ہوتے ہی بلند ہمت مسلم حکمران نو عمری ہی میں تمام دنیا کو فتح کرنے کا عزم کر لیتے ہیں، کیونکہ ذوالقرنین کے اتنی بے پناہ افواج کو لے کر اتنے طویل اور دشوار گزار سفر اور پیش آنے والے معرکوں کے لیے طویل عرصے کی بھی ضرورت تھی۔ دوسرا سبق یہ ہے کہ اگرچہ شاہی محلات، طاؤس و رباب، قالین و کمخواب، حسیناؤں اور حاشیہ نشینوں کے جھرمٹ میں زندگی گزارنے میں بھی لذت اور لطف ہے، مگر گھوڑے کی پشت پر پہاڑوں، صحراؤں، جنگلوں اور دریاؤں کو عبور کرتے ہوئے دشمنوں کے ساتھ جہاد کرنے اور زخم کھانے کے بعد فتح میں جو سرور اور اسلام کو سربلند کرنے میں جو لذت ہے عیش پرستی کی لذت کو اس سے کوئی نسبت ہی نہیں۔ ¤ ➌ اقتدار حاصل ہونے کے بعد ہمارے نبی کریم صلی اللہ علیہ وسلم اور آپ کے خلفاء کا مشن بھی مسلسل جہاد کے ذریعے سے مشرق سے مغرب تک اسلام پھیلانا تھا اور آپ صلی اللہ علیہ وسلم کو اس وقت تک تمام دنیا کے لوگوں سے لڑنے کا حکم دیا گیا جب تک وہ اسلام قبول نہ کریں، یا جزیہ دے کر محکوم و مقہور نہ بن جائیں۔ آپ کو اللہ تعالیٰ نے زمین کے تمام مشارق و مغارب دکھا دیے اور بتا دیا کہ آپ کی امت کی سلطنت یہاں تک پہنچے گی۔ [ ابن ماجہ، الفتن، باب ما یکون من الفتن : ۳۹۵۲ ] اور فی الواقع چند ہی سال میں مشرق کے آخر تک قتیبہ بن مسلم رحمہ اللہ پہنچ چکے تھے اور مغرب کے آخر تک عقبہ بن نافع رحمہ اللہ ۔ جنوب و شمال کی طرف جو علاقے رہ گئے ان کے متعلق بھی آپ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ يَبْقٰی عَلٰی ظَهْرِ الْأَرْضِ بَيْتُ مَدَرٍ وَلَا وَبَرٍ إِلَّا أَدْخَلَهُ اللّٰهُ كَلِمَةَ الْإِسْلَامِ بِعِزِّ عَزِيْزٍ أَوْ ذُلِّ ذَلِيْلٍ إِمَّا يُعِزُّهُمُ اللّٰهُ عَزَّوَجَلَّ فَيَجْعَلُهُمْ مِنْ اأَهْلِهَا أَوْ يُذِلُّهُمْ فَيَدِيْنُوْنَ لَهَا ] [ مسند أحمد : 4/6، ح : ۲۳۸۷۶، عن المقداد و عائشۃ علیھا السلام ]’’زمین کی پشت پر اینٹوں یا بالوں کا بنا ہوا کوئی گھر (یا خیمہ) باقی نہیں رہے گا، مگر اللہ تعالیٰ اس میں کلمۂ اسلام کو داخل کر دے گا، عزت والے کو عزت بخش کر اور ذلیل کو ذلت دے کر، یا تو انھیں عزت دے گا اور انھیں یہ کلمہ پڑھنے والوں میں داخل کر دے گا یا انھیں ذلیل کرے گا اور وہ اس کے محکوم بن جائیں گے۔‘‘ اب دیکھیے وہ محمدی ذوالقرنین کب اٹھتا ہے جو یہ کارنامہ سرانجام دے گا؟ بہرحال ہم سب کو کسی ذوالقرنین کا انتظار کرنے کے بجائے جتنا ہو سکے خود ہی اسلام کی سربلندی اور کفر کو مٹانے کے لیے جہاد کی ضروریات مہیا کرنے اور دشمنوں کو زیر کرنے کے لیے مسلسل جہاد میں مصروف رہنا لازم ہے، کیا خبر اللہ کس کو یہ سعادت بخش دے!! یہی ذوالقرنین کا مشن اور عمل تھا اور یہی ہمارے پیارے پیغمبر اور آپ کے خلفاء کا مشن اور عمل تھا اور یہی کام ہمارے ذمے ہے۔ ¤ ➍ جیسا کہ شروع سورت کی تفسیر میں گزرا کہ اس سورت کی ابتدائی یا آخری آیات کا حفظ کرنا دجال کے فتنے سے محفوظ رکھتا ہے، جس کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا بَيْنَ خَلْقِ آدَمَ اِلٰی قِيَامِ السَّاعَةِ خَلْقٌ أَكْبَرُ مِنَ الدَّجَّالِ ] [ مسلم، الفتن، باب في بقیۃ من أحادیث الدجال : ۲۹۴۶، عن عمران بن حصین رضی اللہ عنہ ] ’’آدم علیہ السلام کی پیدائش سے لے کر قیامت قائم ہونے تک کوئی مخلوق دجال سے بڑی نہیں ہوئی۔‘‘ پھر جو شخص اس سے محفوظ رہا وہ دوسرے فتنوں سے تو بالاولیٰ محفوظ رہے گا۔ اصحابِ کہف اور ذوالقرنین دونوں کے قصوں کا خلاصہ یہ ہے کہ فتنے میں مبتلا کرنے والے کفار کے ساتھ مومن گزارا نہیں کر سکتا۔ اگر اس کے پاس اقتدار نہیں تو وہ ایمان بچانے کے لیے غاروں اور پہاڑوں میں چلا جاتا ہے اور اللہ تعالیٰ اس کی جان و ایمان دونوں کی حفاظت فرماتا ہے اور اگر صاحب اقتدار ہے تو پوری عمر کفر اور کفار کی کمر توڑنے میں مصروف رہتا ہے، تاکہ وہ غالب آکر اس کے ایمان کے لیے خطرہ نہ بن سکیں۔یہ بھی معلوم ہوا کہ صرف اس سورت یا اس کی چند آیات کا پڑھنا ہی کافی نہیں بلکہ اس کے تقاضوں پر عمل بھی فتنوں سے بچنے کے لیے ضروری ہے۔ یہ نہیں کہ اللہ کو چھوڑ کر غیر اللہ سے دوستی گانٹھ لے، اپنی ایمانی غیرت کو تھپکیاں دے کر سلا دے، کفر و شرک پر زبان بند رکھ کر کافر معاشرے میں عیش و عشرت کی زندگی بسر کرتا رہے اور ہر جمعہ کو سورۂ کہف کی تلاوت کر لیا کرے، بلکہ حفظ آیات میں ان پر عمل بھی شامل ہے۔ تفصیل کے لیے دیکھیے سورۂ کہف (۱۰۲ تا ۱۰۴)۔"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت 93،92) ➊ { ثُمَّ اَتْبَعَ سَبَبًا … :} مغرب و مشرق کے سفر کے بعد ذوالقرنین کا یہ تیسرا سفر ہے، اللہ تعالیٰ نے اس کی جہت بیان نہیں فرمائی کہ وہ شمال ہے یا جنوب یا چاروں جہتوں کا کوئی کونا۔ معلوم ہوتا ہے اسے پوشیدہ رکھنے ہی میں اللہ کی حکمت ہے۔ چنانچہ مدت دراز سے لوہے اور تانبے سے بنی ہوئی دو پہاڑوں کے درمیان اس جیسی بلندی والی یہ دیوار کسی نے نہیں دیکھی۔ دیوار چین یا داغستان میں دربند اور خوزامہ کے درمیان کسی زمانے میں پائی جانے والی دیوار یا کسی اور دیوار کی نہ یہ ہیئت ہے، نہ ان کے پار رہنے والوں میں کہیں یاجوج ماجوج کا وجود ہے۔ ¤ ➋ بہت سے مفسرین نے ذوالقرنین کا یہ سفر شمال کی طرف قرار دیا ہے، کوئی اسے روس کا علاقہ قرار دیتا ہے، کوئی تاتاریوں کو یاجوج ماجوج کا مصداق ٹھہراتا ہے، جنھوں نے شمال کی جانب سے نکل کر دنیاکو تہ و بالا کر دیا تھا اور بغداد کی اینٹ سے اینٹ بجا دی تھی۔ بعض انھیں مغل یا ترک قرار دیتے ہیں، مگر سب بلادلیل اندھیرے میں پتھر پھینکتے چلے جاتے ہیں۔ بعض حضرات اپنے دعوے کے کسی جز کی دلیل کے طور پر بائبل سے کچھ نقل کرکے پورے دعوے کی دلیل کے فریضے سے سبکدوش ہو جاتے ہیں، حالانکہ موجودہ بائبل پر یقین ممکن ہی نہیں۔ ان حضرات کی تفسیر کا حاصل یہ ہے کہ ذوالقرنین کی دیوار ختم ہو چکی اور اس کے پیچھے روکے ہوئے یاجوج ما جوج جو نکلنے تھے نکل چکے، حالانکہ قرآن و سنت دونوں سے اس کی تردید ہوتی ہے۔ حقیقت یہ ہے کہ قرآن مجید کی کسی آیت کی تفصیل کی ضرورت ہو تو وہ قرآن مجید کی کسی دوسری آیت ساتھ ملانے سے پوری ہو جاتی ہے، اگر پھر بھی ضرورت باقی رہے تو صحیح حدیث ملانے سے وہ بھی پوری ہو جاتی ہے۔ قرآن مجید میں یاجوج ماجوج کے نکلنے کا ذکر ایک اور مقام پر بھی آتا ہے، فرمایا : «{ حَتّٰۤى اِذَا فُتِحَتْ يَاْجُوْجُ وَ مَاْجُوْجُ وَ هُمْ مِّنْ كُلِّ حَدَبٍ يَّنْسِلُوْنَ (96) وَ اقْتَرَبَ الْوَعْدُ الْحَقُّ فَاِذَا هِيَ شَاخِصَةٌ اَبْصَارُ الَّذِيْنَ كَفَرُوْا يٰوَيْلَنَا قَدْ كُنَّا فِيْ غَفْلَةٍ مِّنْ هٰذَا بَلْ كُنَّا ظٰلِمِيْنَ }» [ الأنبیاء : ۹۶، ۹۷ ] ’’یہاں تک کہ جب یاجوج اور ماجوج کھول دیے جائیں گے اور وہ ہر اونچی جگہ سے دوڑتے ہوئے آئیں گے اور سچا وعدہ بالکل قریب آ جائے گا تو اچانک یہ ہو گا کہ ان لوگوں کی آنکھیں کھلی رہ جائیں گی جنھوں نے کفر کیا۔ ہائے ہماری بربادی! بے شک ہم اس سے غفلت میں تھے، بلکہ ہم ظلم کرنے والے تھے۔‘‘ سورۂ کہف اور سورۂ انبیاء دونوں کی آیات کو ملانے سے صاف واضح ہے کہ اس دیوار کے زمین کے برابر ہونے اور یاجوج ماجوج کے موجیں مارتے ہوئے نکلنے کا وقت ایک ہی ہے اور اس کے بعد نفخ صور اور قیامت بالکل قریب ہوں گی۔ اس کی مزید تفصیل صحیح مسلم میں رسول اللہ صلی اللہ علیہ وسلم کی زبانی موجود ہے کہ یہ سب کچھ دجال کے نکلنے اور مسیح علیہ السلام کے زمین پر نازل ہونے کے بعد ہو گا۔ چنانچہ نواس بن سمعان رضی اللہ عنہ سے مروی لمبی حدیث میں دجال کے نکلنے، فتنہ و فساد پھیلانے، پھر مسیح علیہ السلام کے نازل ہو کر اسے قتل کرنے کا ذکر ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’عیسیٰ علیہ السلام اسی طرح (مصروف) ہوں گے کہ اللہ تعالیٰ عیسیٰ علیہ السلام کی طرف وحی فرمائے گا کہ میں نے اپنے کچھ ایسے بندے نکالے ہیں کہ کسی میں ان سے لڑنے کی طاقت نہیں، اس لیے میرے بندوں کو طور کی طرف لے جا کر محفوظ کر لو، تو اللہ تعالیٰ یاجوج ماجوج کو بھیجے گا اور وہ ہر اونچی جگہ سے دوڑتے ہوئے آئیں گے۔ ان کے پہلے لوگ طبریہ جھیل پر پہنچیں گے تو اس میں جو بھی (پانی) ہے پی جائیں گے اور ان کے آخری لوگ گزریں گے اور کہیں گے کہ یہاں کبھی ضرور پانی رہا ہے۔ اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی محصور رہیں گے، یہاں تک کہ ان میں سے ہر ایک کے نزدیک بیل کا سر آج تمھارے نزدیک سو دینار (تین سو گرام سونے) سے بہتر ہو گا۔ پھر عیسیٰ علیہ السلام اور ان کے ساتھی اللہ تعالیٰ سے دعا کریں گے تو اللہ تعالیٰ ان کی گردنوں میں کیڑے ڈال دے گا تو وہ سب ایک شخص کی موت کی طرح ہلاک ہو جائیں گے، پھر اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی زمین پر اتریں گے تو زمین میں ایک بالشت جگہ بھی نہیں پائیں گے جسے ان کی سڑاند اور گندگی نے نہ بھر رکھا ہو۔ تو اللہ تعالیٰ بختی اونٹوں کی گردنوں جیسے پرندے بھیجے گا جو انھیں اٹھا کر وہاں پھینک دیں گے جہاں اللہ چاہے گا۔ پھر اللہ تعالیٰ ایسی بارش برسائے گا کہ کوئی مکان یا خیمہ اس کے بغیر نہیں رہے گا۔ چنانچہ وہ بارش زمین کو دھو دے گی، یہاں تک کہ اسے آئینے کی طرح صاف کر دے گی۔ پھر زمین کو حکم ہو گا کہ اپنے پھل اُگا اور اپنی برکت واپس لا تو ان دنوں ایک جماعت انار کا ایک حصہ کھائے گی اور اس کے چھلکے سے سایہ حاصل کرے گی اور دودھ والے جانوروں میں برکت دی جائے گی، یہاں تک کہ دودھ والی اونٹنی لوگوں کی کئی جماعتوں کو کافی ہو گی اور دودھ والی گائے لوگوں کے ایک قبیلے کو کافی ہو گی اور دودھ والی بکری لوگوں کے ایک خاندان کو کافی ہو گی۔ تو وہ اسی حال میں ہوں گے کہ اللہ تعالیٰ ایک طیب ہوا بھیجے گا جو ان کی بغلوں کے نیچے اثر کرے گی اور ہر مومن اور ہر مسلم کی روح قبض کر لے گی اور بدترین لوگ باقی رہ جائیں گے، جو گدھوں کی طرح ایک دوسرے سے جنسی ملاپ کریں گے تو ان پر قیامت قائم ہو گی۔‘‘ [ مسلم، الفتن، باب ذکر الدجال : ۲۹۳۷ ] ¤ اس صحیح حدیث سے ذوالقرنین کی دیوار کا زمین کے برابر ہو چکا ہونا اور یاجوج ماجوج کا روسی، چینی یا تاتاری ہونا اور ان کے خروج کا واقع ہو چکا ہونا صاف غلط ثابت ہوتا ہے اور یہ بات طے شدہ ہے کہ قرآن مجید اور صحیح حدیث کے خلاف جو بات بھی ہے وہ باطل اور جھوٹ ہے، خواہ وہ بات کہنے والا کتنا بڑا ہو اور خواہ وہ بائبل کی کسی کتاب میں موجود ہو، کیونکہ بائبل کے محفوظ نہ رہنے اور اس میں اضافہ اور تبدیلی کی شہادت قرآن مجید میں کئی جگہ موجود ہے۔ دیکھیے سورۂ مائدہ (۱۳)، انعام (۹۱)، بقرہ (۷۹) اور آل عمران (۷۸) اس کے مقابلے میں قرآن و سنت کی حفاظت کا ذمہ اللہ تعالیٰ نے خود لیا ہے۔ دیکھیے سورۂ حجر (۹)، قیامہ (۱۶، ۱۷)، حم السجدہ (۴۲) اور نجم (۳، ۴) بلکہ اس میں کئی ایسی عبارتیں ہیں کہ کوئی یہودی یا عیسائی انھیں عام مجمع میں پڑھنے کی جرأت نہیں کر سکتا، مثلاً لوط، داؤد اور سلیمان علیھم السلام پر تہمتوں کے طوفان والی عبارتیں۔ اور اس بات پر امت کا اتفاق ہے کہ اہل کتاب کی کوئی بات قرآن و سنت کے خلاف ہو تو وہ جھوٹ ہے اور اگر نہ خلاف ہو نہ موافق تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ انھیں نہ سچا کہو نہ جھوٹا۔ زیر تفسیر آیات کے بارے میں اسرائیلی روایات قرآن مجید اور صحیح احادیث کے خلاف ہیں، اس لیے بے بنیاد اور باطل ہیں۔ ¤ ➌ یاجوج اور ماجوج عجمی نام ہیں، اس لیے عجمہ اور تانیث (مجوس کی طرح قبیلہ ہونے) کی وجہ سے غیر منصرف ہیں۔ اگر انھیں عربی مانا جائے تو یاجوج بروزن {’’يَفْعُوْلٌ‘‘} مثلاً {’’يَرْبُوْعٌ‘‘} اور ماجوج بروزن {’’مَفْعُوْلٌ‘‘} مثلاً {’’مَعْقُوْلٌ‘‘} ہو گا اور ان کا ماخذ {’’ اَجَّ يَؤُجُّ ‘‘} ہو گا۔ {’’’اَجَّ الظَّلِيْمُ‘‘ } کا معنی نر شتر مرغ تیز دوڑا اور {’’اَجَّتِ النَّارُ‘‘} آگ بھڑک اٹھی۔ غرض یاجوج اور ماجوج کا اشتقاق ایک ہی مادے سے ہے اور اس کے مفہوم میں تیزی اور اشتعال شامل ہے اور یہ لفظ معرفہ اور تانیث کی وجہ سے غیر منصرف ہیں۔ (قاسمی) ¤ ➍ یاجوج اور ماجوج آدم علیہ السلام ہی کی اولاد ہیں، جیسا کہ صحیحین میں ہے : [ يَقُوْلُ اللّٰهُ عَزَّوَجَلَّ يَا آدَمُ ! فَيَقُوْلُ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِيْ يَدَيْكَ قَالَ يَقُوْلُ أَخْرِجْ بَعْثَ النَّارِ، قَالَ وَمَا بَعْثُ  النَّارِ ؟ قَالَ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً ووَتِسْعِيْنَ، قَالَ فَذَاكَ حِيْنَ يَشِيْبُ الصَّغِيْرُ «{ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَ تَرَي النَّاسَ بِسُكٰرٰي وَ مَا هُمْ بِسُكٰرٰي وَ لٰكِنَّ عَذَابَ اللّٰهِ شَدِيْدٌ }» قَالَ فَاشْتَدَّ ذٰلِكَ عَلَيْهِمْ قَالُوْا يَا رَسُوْلَ اللّٰهِ! أَيُّنَا ذَاكَ الرَّجُلُ؟ فَقَالَ أَبْشِرُوْا فَإِنَّ مِنْ يَأْجُوْجَ وَمَأْجُوْجَ أَلْفٌ، وَمِنْكُمْ رَجُلٌ ]  [ مسلم، الإیمان، باب قولہ : یقول اللّٰہ لآدم… : ۲۲۲۔ بخاري : ۶۵۳۰ ] ’’اللہ تعالیٰ فرمائیں گے : ’’اے آدم!“ وہ عرض کریں گے : ’’لبیک و سعدیک اور ہر خیر تیرے ہی ہاتھ میں ہے۔‘‘ اللہ تعالیٰ فرمائیں گے : ’’آگ والی جماعت کو نکالو۔‘‘ وہ عرض کریں گے : ’’اور آگ والی جماعت کیا ہے؟‘‘ فرمائیں گے : ’’ہر ہزار میں سے نو سو ننانوے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو یہ وہ وقت ہو گا کہ بچہ بوڑھا ہو جائے گا اور ہر حمل والی اپنا حمل گرا دے گی اور تو لوگوں کو نشے میں دیکھے گا، حالانکہ وہ ہر گز نشے میں نہیں ہوں گے اور لیکن اللہ کا عذاب بہت سخت ہے۔‘‘ راوی نے کہا، تو یہ بات ان پر بہت شاق گزری، انھوں نے کہا : ’’اے اللہ کے رسول! ہم میں وہ ایک آدمی کون ہو گا؟‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’خوش ہو جاؤ کہ یاجوج ماجوج میں سے ایک ہزار اور تم میں سے ایک آدمی ہو گا۔‘‘ بعض مفسرین نے یاجوج ماجوج کی شکل و صورت، قد کے لمبے اور چھوٹے ہونے اور ان کے کانوں کے متعلق عجیب و غریب اقوال و روایات لکھی ہیں جن میں سے کوئی بھی قرآن و سنت سے ثابت نہیں۔ (ابن کثیر) ¤ ➎ اس حقیقت پر بعض کم فہم لوگ اعتراض کرتے ہیں کہ یورپی اقوام نے زمین کا ہر کونا چھان مارا ہے مگر انھیں نہ کہیں یاجوج ماجوج نظر آتے ہیں نہ پہاڑوں جیسی بلند لوہے اور تانبے کی کوئی دیوار نظر آتی ہے۔ جواب اس کا یہ ہے کہ اللہ تعالیٰ جسے مخفی رکھنا چاہے کوئی اسے نہیں دیکھ سکتا۔ بنی اسرائیل میدان تیہ میں چالیس سال تک چند میل کے دائرے میں گھومتے رہے، نہ وہ اس دائرے سے نکل سکے اور نہ کسی اور کو ان کا پتا چل سکا، ورنہ وہ انھیں نکلنے کا راستہ بتا کر وہاں سے نکال لیتا۔ ایمان ہو تو اس دیوار، یاجوج ماجوج، نزول مسیح، دجال، دا بۃ الارض سب پر یقین آ جاتا ہے اور اگر ایمان نہ ہو تو انسان ’’ایک جمع ایک، جمع ایک، برابر تین‘‘ کے بجائے ’’برابر ایک‘‘ جیسی صریح خلاف عقل بات پر اڑ جاتا ہے، مگر اللہ تعالیٰ کے رازوں تک اپنی نا رسائی کو تسلیم نہیں کرتا۔"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت 93،92) ➊ { ثُمَّ اَتْبَعَ سَبَبًا … :} مغرب و مشرق کے سفر کے بعد ذوالقرنین کا یہ تیسرا سفر ہے، اللہ تعالیٰ نے اس کی جہت بیان نہیں فرمائی کہ وہ شمال ہے یا جنوب یا چاروں جہتوں کا کوئی کونا۔ معلوم ہوتا ہے اسے پوشیدہ رکھنے ہی میں اللہ کی حکمت ہے۔ چنانچہ مدت دراز سے لوہے اور تانبے سے بنی ہوئی دو پہاڑوں کے درمیان اس جیسی بلندی والی یہ دیوار کسی نے نہیں دیکھی۔ دیوار چین یا داغستان میں دربند اور خوزامہ کے درمیان کسی زمانے میں پائی جانے والی دیوار یا کسی اور دیوار کی نہ یہ ہیئت ہے، نہ ان کے پار رہنے والوں میں کہیں یاجوج ماجوج کا وجود ہے۔ ¤ ➋ بہت سے مفسرین نے ذوالقرنین کا یہ سفر شمال کی طرف قرار دیا ہے، کوئی اسے روس کا علاقہ قرار دیتا ہے، کوئی تاتاریوں کو یاجوج ماجوج کا مصداق ٹھہراتا ہے، جنھوں نے شمال کی جانب سے نکل کر دنیاکو تہ و بالا کر دیا تھا اور بغداد کی اینٹ سے اینٹ بجا دی تھی۔ بعض انھیں مغل یا ترک قرار دیتے ہیں، مگر سب بلادلیل اندھیرے میں پتھر پھینکتے چلے جاتے ہیں۔ بعض حضرات اپنے دعوے کے کسی جز کی دلیل کے طور پر بائبل سے کچھ نقل کرکے پورے دعوے کی دلیل کے فریضے سے سبکدوش ہو جاتے ہیں، حالانکہ موجودہ بائبل پر یقین ممکن ہی نہیں۔ ان حضرات کی تفسیر کا حاصل یہ ہے کہ ذوالقرنین کی دیوار ختم ہو چکی اور اس کے پیچھے روکے ہوئے یاجوج ما جوج جو نکلنے تھے نکل چکے، حالانکہ قرآن و سنت دونوں سے اس کی تردید ہوتی ہے۔ حقیقت یہ ہے کہ قرآن مجید کی کسی آیت کی تفصیل کی ضرورت ہو تو وہ قرآن مجید کی کسی دوسری آیت ساتھ ملانے سے پوری ہو جاتی ہے، اگر پھر بھی ضرورت باقی رہے تو صحیح حدیث ملانے سے وہ بھی پوری ہو جاتی ہے۔ قرآن مجید میں یاجوج ماجوج کے نکلنے کا ذکر ایک اور مقام پر بھی آتا ہے، فرمایا : «{ حَتّٰۤى اِذَا فُتِحَتْ يَاْجُوْجُ وَ مَاْجُوْجُ وَ هُمْ مِّنْ كُلِّ حَدَبٍ يَّنْسِلُوْنَ (96) وَ اقْتَرَبَ الْوَعْدُ الْحَقُّ فَاِذَا هِيَ شَاخِصَةٌ اَبْصَارُ الَّذِيْنَ كَفَرُوْا يٰوَيْلَنَا قَدْ كُنَّا فِيْ غَفْلَةٍ مِّنْ هٰذَا بَلْ كُنَّا ظٰلِمِيْنَ }» [ الأنبیاء : ۹۶، ۹۷ ] ’’یہاں تک کہ جب یاجوج اور ماجوج کھول دیے جائیں گے اور وہ ہر اونچی جگہ سے دوڑتے ہوئے آئیں گے اور سچا وعدہ بالکل قریب آ جائے گا تو اچانک یہ ہو گا کہ ان لوگوں کی آنکھیں کھلی رہ جائیں گی جنھوں نے کفر کیا۔ ہائے ہماری بربادی! بے شک ہم اس سے غفلت میں تھے، بلکہ ہم ظلم کرنے والے تھے۔‘‘ سورۂ کہف اور سورۂ انبیاء دونوں کی آیات کو ملانے سے صاف واضح ہے کہ اس دیوار کے زمین کے برابر ہونے اور یاجوج ماجوج کے موجیں مارتے ہوئے نکلنے کا وقت ایک ہی ہے اور اس کے بعد نفخ صور اور قیامت بالکل قریب ہوں گی۔ اس کی مزید تفصیل صحیح مسلم میں رسول اللہ صلی اللہ علیہ وسلم کی زبانی موجود ہے کہ یہ سب کچھ دجال کے نکلنے اور مسیح علیہ السلام کے زمین پر نازل ہونے کے بعد ہو گا۔ چنانچہ نواس بن سمعان رضی اللہ عنہ سے مروی لمبی حدیث میں دجال کے نکلنے، فتنہ و فساد پھیلانے، پھر مسیح علیہ السلام کے نازل ہو کر اسے قتل کرنے کا ذکر ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’عیسیٰ علیہ السلام اسی طرح (مصروف) ہوں گے کہ اللہ تعالیٰ عیسیٰ علیہ السلام کی طرف وحی فرمائے گا کہ میں نے اپنے کچھ ایسے بندے نکالے ہیں کہ کسی میں ان سے لڑنے کی طاقت نہیں، اس لیے میرے بندوں کو طور کی طرف لے جا کر محفوظ کر لو، تو اللہ تعالیٰ یاجوج ماجوج کو بھیجے گا اور وہ ہر اونچی جگہ سے دوڑتے ہوئے آئیں گے۔ ان کے پہلے لوگ طبریہ جھیل پر پہنچیں گے تو اس میں جو بھی (پانی) ہے پی جائیں گے اور ان کے آخری لوگ گزریں گے اور کہیں گے کہ یہاں کبھی ضرور پانی رہا ہے۔ اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی محصور رہیں گے، یہاں تک کہ ان میں سے ہر ایک کے نزدیک بیل کا سر آج تمھارے نزدیک سو دینار (تین سو گرام سونے) سے بہتر ہو گا۔ پھر عیسیٰ علیہ السلام اور ان کے ساتھی اللہ تعالیٰ سے دعا کریں گے تو اللہ تعالیٰ ان کی گردنوں میں کیڑے ڈال دے گا تو وہ سب ایک شخص کی موت کی طرح ہلاک ہو جائیں گے، پھر اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی زمین پر اتریں گے تو زمین میں ایک بالشت جگہ بھی نہیں پائیں گے جسے ان کی سڑاند اور گندگی نے نہ بھر رکھا ہو۔ تو اللہ تعالیٰ بختی اونٹوں کی گردنوں جیسے پرندے بھیجے گا جو انھیں اٹھا کر وہاں پھینک دیں گے جہاں اللہ چاہے گا۔ پھر اللہ تعالیٰ ایسی بارش برسائے گا کہ کوئی مکان یا خیمہ اس کے بغیر نہیں رہے گا۔ چنانچہ وہ بارش زمین کو دھو دے گی، یہاں تک کہ اسے آئینے کی طرح صاف کر دے گی۔ پھر زمین کو حکم ہو گا کہ اپنے پھل اُگا اور اپنی برکت واپس لا تو ان دنوں ایک جماعت انار کا ایک حصہ کھائے گی اور اس کے چھلکے سے سایہ حاصل کرے گی اور دودھ والے جانوروں میں برکت دی جائے گی، یہاں تک کہ دودھ والی اونٹنی لوگوں کی کئی جماعتوں کو کافی ہو گی اور دودھ والی گائے لوگوں کے ایک قبیلے کو کافی ہو گی اور دودھ والی بکری لوگوں کے ایک خاندان کو کافی ہو گی۔ تو وہ اسی حال میں ہوں گے کہ اللہ تعالیٰ ایک طیب ہوا بھیجے گا جو ان کی بغلوں کے نیچے اثر کرے گی اور ہر مومن اور ہر مسلم کی روح قبض کر لے گی اور بدترین لوگ باقی رہ جائیں گے، جو گدھوں کی طرح ایک دوسرے سے جنسی ملاپ کریں گے تو ان پر قیامت قائم ہو گی۔‘‘ [ مسلم، الفتن، باب ذکر الدجال : ۲۹۳۷ ] ¤ اس صحیح حدیث سے ذوالقرنین کی دیوار کا زمین کے برابر ہو چکا ہونا اور یاجوج ماجوج کا روسی، چینی یا تاتاری ہونا اور ان کے خروج کا واقع ہو چکا ہونا صاف غلط ثابت ہوتا ہے اور یہ بات طے شدہ ہے کہ قرآن مجید اور صحیح حدیث کے خلاف جو بات بھی ہے وہ باطل اور جھوٹ ہے، خواہ وہ بات کہنے والا کتنا بڑا ہو اور خواہ وہ بائبل کی کسی کتاب میں موجود ہو، کیونکہ بائبل کے محفوظ نہ رہنے اور اس میں اضافہ اور تبدیلی کی شہادت قرآن مجید میں کئی جگہ موجود ہے۔ دیکھیے سورۂ مائدہ (۱۳)، انعام (۹۱)، بقرہ (۷۹) اور آل عمران (۷۸) اس کے مقابلے میں قرآن و سنت کی حفاظت کا ذمہ اللہ تعالیٰ نے خود لیا ہے۔ دیکھیے سورۂ حجر (۹)، قیامہ (۱۶، ۱۷)، حم السجدہ (۴۲) اور نجم (۳، ۴) بلکہ اس میں کئی ایسی عبارتیں ہیں کہ کوئی یہودی یا عیسائی انھیں عام مجمع میں پڑھنے کی جرأت نہیں کر سکتا، مثلاً لوط، داؤد اور سلیمان علیھم السلام پر تہمتوں کے طوفان والی عبارتیں۔ اور اس بات پر امت کا اتفاق ہے کہ اہل کتاب کی کوئی بات قرآن و سنت کے خلاف ہو تو وہ جھوٹ ہے اور اگر نہ خلاف ہو نہ موافق تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ انھیں نہ سچا کہو نہ جھوٹا۔ زیر تفسیر آیات کے بارے میں اسرائیلی روایات قرآن مجید اور صحیح احادیث کے خلاف ہیں، اس لیے بے بنیاد اور باطل ہیں۔ ¤ ➌ یاجوج اور ماجوج عجمی نام ہیں، اس لیے عجمہ اور تانیث (مجوس کی طرح قبیلہ ہونے) کی وجہ سے غیر منصرف ہیں۔ اگر انھیں عربی مانا جائے تو یاجوج بروزن {’’يَفْعُوْلٌ‘‘} مثلاً {’’يَرْبُوْعٌ‘‘} اور ماجوج بروزن {’’مَفْعُوْلٌ‘‘} مثلاً {’’مَعْقُوْلٌ‘‘} ہو گا اور ان کا ماخذ {’’ اَجَّ يَؤُجُّ ‘‘} ہو گا۔ {’’’اَجَّ الظَّلِيْمُ‘‘ } کا معنی نر شتر مرغ تیز دوڑا اور {’’اَجَّتِ النَّارُ‘‘} آگ بھڑک اٹھی۔ غرض یاجوج اور ماجوج کا اشتقاق ایک ہی مادے سے ہے اور اس کے مفہوم میں تیزی اور اشتعال شامل ہے اور یہ لفظ معرفہ اور تانیث کی وجہ سے غیر منصرف ہیں۔ (قاسمی) ¤ ➍ یاجوج اور ماجوج آدم علیہ السلام ہی کی اولاد ہیں، جیسا کہ صحیحین میں ہے : [ يَقُوْلُ اللّٰهُ عَزَّوَجَلَّ يَا آدَمُ ! فَيَقُوْلُ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِيْ يَدَيْكَ قَالَ يَقُوْلُ أَخْرِجْ بَعْثَ النَّارِ، قَالَ وَمَا بَعْثُ  النَّارِ ؟ قَالَ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً ووَتِسْعِيْنَ، قَالَ فَذَاكَ حِيْنَ يَشِيْبُ الصَّغِيْرُ «{ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَ تَرَي النَّاسَ بِسُكٰرٰي وَ مَا هُمْ بِسُكٰرٰي وَ لٰكِنَّ عَذَابَ اللّٰهِ شَدِيْدٌ }» قَالَ فَاشْتَدَّ ذٰلِكَ عَلَيْهِمْ قَالُوْا يَا رَسُوْلَ اللّٰهِ! أَيُّنَا ذَاكَ الرَّجُلُ؟ فَقَالَ أَبْشِرُوْا فَإِنَّ مِنْ يَأْجُوْجَ وَمَأْجُوْجَ أَلْفٌ، وَمِنْكُمْ رَجُلٌ ]  [ مسلم، الإیمان، باب قولہ : یقول اللّٰہ لآدم… : ۲۲۲۔ بخاري : ۶۵۳۰ ] ’’اللہ تعالیٰ فرمائیں گے : ’’اے آدم!“ وہ عرض کریں گے : ’’لبیک و سعدیک اور ہر خیر تیرے ہی ہاتھ میں ہے۔‘‘ اللہ تعالیٰ فرمائیں گے : ’’آگ والی جماعت کو نکالو۔‘‘ وہ عرض کریں گے : ’’اور آگ والی جماعت کیا ہے؟‘‘ فرمائیں گے : ’’ہر ہزار میں سے نو سو ننانوے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو یہ وہ وقت ہو گا کہ بچہ بوڑھا ہو جائے گا اور ہر حمل والی اپنا حمل گرا دے گی اور تو لوگوں کو نشے میں دیکھے گا، حالانکہ وہ ہر گز نشے میں نہیں ہوں گے اور لیکن اللہ کا عذاب بہت سخت ہے۔‘‘ راوی نے کہا، تو یہ بات ان پر بہت شاق گزری، انھوں نے کہا : ’’اے اللہ کے رسول! ہم میں وہ ایک آدمی کون ہو گا؟‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’خوش ہو جاؤ کہ یاجوج ماجوج میں سے ایک ہزار اور تم میں سے ایک آدمی ہو گا۔‘‘ بعض مفسرین نے یاجوج ماجوج کی شکل و صورت، قد کے لمبے اور چھوٹے ہونے اور ان کے کانوں کے متعلق عجیب و غریب اقوال و روایات لکھی ہیں جن میں سے کوئی بھی قرآن و سنت سے ثابت نہیں۔ (ابن کثیر) ¤ ➎ اس حقیقت پر بعض کم فہم لوگ اعتراض کرتے ہیں کہ یورپی اقوام نے زمین کا ہر کونا چھان مارا ہے مگر انھیں نہ کہیں یاجوج ماجوج نظر آتے ہیں نہ پہاڑوں جیسی بلند لوہے اور تانبے کی کوئی دیوار نظر آتی ہے۔ جواب اس کا یہ ہے کہ اللہ تعالیٰ جسے مخفی رکھنا چاہے کوئی اسے نہیں دیکھ سکتا۔ بنی اسرائیل میدان تیہ میں چالیس سال تک چند میل کے دائرے میں گھومتے رہے، نہ وہ اس دائرے سے نکل سکے اور نہ کسی اور کو ان کا پتا چل سکا، ورنہ وہ انھیں نکلنے کا راستہ بتا کر وہاں سے نکال لیتا۔ ایمان ہو تو اس دیوار، یاجوج ماجوج، نزول مسیح، دجال، دا بۃ الارض سب پر یقین آ جاتا ہے اور اگر ایمان نہ ہو تو انسان ’’ایک جمع ایک، جمع ایک، برابر تین‘‘ کے بجائے ’’برابر ایک‘‘ جیسی صریح خلاف عقل بات پر اڑ جاتا ہے، مگر اللہ تعالیٰ کے رازوں تک اپنی نا رسائی کو تسلیم نہیں کرتا۔"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت 94) ➊ { قَالُوْا يٰذَا الْقَرْنَيْنِ …:} جب وہ قریب نہ تھے کہ کوئی بات سمجھیں تو ذوالقرنین سے ان کی گفتگو کیسے ہوئی؟ جواب یہ ہے کہ اشاروں کی زبان میں، جو بین الاقوامی زبان ہے، یا ذوالقرنین کو اللہ تعالیٰ نے خاص طور پر ان کی زبان سمجھا دی ہو گی، جیسا کہ داؤد و سلیمان علیھما السلام کو اللہ تعالیٰ نے پرندوں کی بولی سکھا دی تھی۔ ¤ ➋ { فَهَلْ نَجْعَلُ لَكَ خَرْجًا …:} اس قوم اور یاجوج ماجوج کے درمیان دو پہاڑ تھے جن کے درمیان ایک درہ تھا، جہاں سے آ کر وہ لوگ لوٹ مار کر کے چلے جاتے تھے۔ دو پہاڑوں کے درمیان ان کے برابر ایک بلند دیوار کوئی اولو العزم بادشاہ ہی بنا سکتا تھا، جس کے پاس ہر قسم کے وسائل ہوں۔ کوئی قوم کتنی بھی مال دار ہو یہ کام سرانجام نہیں دے سکتی۔ اس لیے انھوں نے اخراجات ادا کرنے کی پیش کش کرکے اپنے اور یاجوج ماجوج کے درمیان رکاوٹ بننے والی دیوار بنانے کی درخواست کی جو پہاڑوں کی طرح ان کا راستہ روک سکے۔"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت 95) ➊ {قَالَ مَا مَكَّنِّيْ فِيْهِ رَبِّيْ خَيْرٌ:} ذوالقرنین نے فرمایا، اللہ تعالیٰ نے جو کچھ میری دسترس میں دیا ہے وہ تمھارے دیے ہوئے اخراجات سے کہیں بہتر ہے، سو تم خرچ کی فکر مت کرو۔ ہاں، تم عملی طور پر آدمیوں اور محنت کے ساتھ میری مدد کرو، تاکہ میں تمھارے اور ان کے درمیان ایک موٹی دیوار بنا دوں۔ اس سے ذوالقرنین کی سیر چشمی، فراخ دلی اور سخاوت نفس کے ساتھ ساتھ رعایا کو دشمن سے محفوظ رکھنے کے لیے مضبوط ترین دفاع کا بندوبست کرنا واضح ہوتا ہے۔ سلیمان علیہ السلام نے بھی ملکہ سبا کو ہدیے بھیجنے پر ایسا ہی جواب بھیجا تھا : «{ فَمَاۤ اٰتٰىنِۧ اللّٰهُ خَيْرٌ مِّمَّاۤ اٰتٰىكُمْ }» [ النمل : ۳۶ ] ’’جو کچھ اللہ نے مجھے دیا ہے وہ اس سے بہتر ہے جو اس نے تمھیں دیا ہے۔‘‘ رعایا کی زندگی کے ایک ایک لمحے تک پر ٹیکس لگا دینے والے جمہوری حکمران، جو ملوکیت کو گالی قرار دیتے ہیں، رعایا کے لیے اللہ کی رحمت بننے والے ملوک کے طرز عمل سے سبق حاصل کریں۔ ¤ ➋ { فَاَعِيْنُوْنِيْ بِقُوَّةٍ …: ’’ رَدْمًا ‘‘} کا معنی خالی جگہ کو پتھروں سے پر کرنا اور پتھروں کی بنی ہوئی موٹی دیوار ہے، {’’سَحَابٌ مُرْدَمٌ‘‘ } تہ بہ تہ بادل۔"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت 96) { اٰتُوْنِيْ زُبَرَ الْحَدِيْدِ حَتّٰۤى اِذَا سَاوٰى …: ’’ زُبَرَ ‘‘ ’’ زُبْرَةٌ ‘‘} کی جمع ہے، جیسا کہ {’’ غُرْفَةٌ ‘‘} کی جمع {’’غُرَفٌ‘‘} ہے، معنی ہے لوہے کے بڑے بڑے ٹکڑے۔ پہاڑوں کے درمیان ان کی بلندی کے برابر لوہے کے بڑے بڑے ٹکڑے مہیا کرنا، انھیں اوپر پہنچانا اور جوڑنا ہمارے اس ترقی یافتہ دور میں بھی امر محال نظر آتا ہے، مگر اہرام مصر کو دیکھیں تو ماننا پڑتا ہے کہ ہم سے ہزاروں سال پہلے جر ثقیل (وزنی اشیاء کو کھینچنے اور اوپر لے جانے) کا علم آج سے بہت آگے تھا۔ چنانچہ ذوالقرنین نے پہاڑوں کے دونوں کناروں کے برابر لوہے کے بڑے بڑے ٹکڑے جوڑنے کے بعد یک جان کرنے کے لیے انھیں آگ سے سرخ کرنے کا حکم دیا، ادھر تانبے کو پگھلانے کا بندوبست کیا۔ جب لوہے کی اینٹیں اور تختے سراسر آگ بن گئے تو اس نے کہا، اب پگھلا ہوا تانبا لاؤ، تاکہ میں اس پر ڈالوں۔ اس طرح وہ لوہے اور تانبے کی بہت موٹی، مضبوط اور پہاڑوں کے برابر بلند اور چکنی دیوار بن گئی، جس پر نہ یاجوج ماجوج چڑھ سکتے تھے، نہ اس میں سوراخ کر سکتے تھے۔ ہزاروں فٹ اونچی اس دیوار کو بنانے میں سائنس کے کیا کیا علوم استعمال ہوئے، لوہے اور تانبے کی کتنی مقدار صرف ہوئی، اتنی بلندی پر لوہے کو کیسے سرخ کیا گیا اور تانبے کی اتنی مقدار اس قدر بلندی پر پہنچانے تک کیسے پگھلی ہوئی حالت میں رکھی گئی اور اتنی موٹی دیوار جب سرخ ہوئی ہو گی تو اس کے پاس کھڑا ہو کر پگھلا ہوا تانبا کیسے ڈالا گیا ہو گا، پھر یہ کام کتنی مدت میں مکمل ہوا، یہ سب کچھ اب صرف اللہ تعالیٰ ہی جانتا ہے۔ اس سارے عمل میں ذوالقرنین بہ نفس نفیس کام میں شریک رہے، بلکہ اپنے ہاتھوں سے کام کرتے رہے۔ یہی سنت ہمارے پیارے پیغمبر صلی اللہ علیہ وسلم کی ہے کہ آپ کعبہ کی تعمیر میں، مسجد نبوی بنانے اور خندق کھودنے میں بہ نفس نفیس برابر شریک رہے۔"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت 97) { فَمَا اسْطَاعُوْۤا اَنْ يَّظْهَرُوْهُ …: ’’ اسْطَاعُوْۤا ‘‘} بھی اصل میں {’’ اسْتَطَاعُوْۤا ‘‘} تھا، تخفیف کے لیے تاء حذف کر دی۔ چڑھنے کے لیے ہلکا لفظ {’’ اسْطَاعُوْۤا ‘‘} اور نقب کے لیے بھاری لفظ {’’ اسْتَطَاعُوْۤا ‘‘} استعمال فرمایا، کیونکہ ایسی دیوار پر چڑھنا اس میں نقب کی بہ نسبت آسان ہے۔"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت 98) ➊ { قَالَ هٰذَا رَحْمَةٌ مِّنْ رَّبِّيْ :} ذوالقرنین نے دیوار بنا کر اسے اپنا کارنامہ قرار دینے کے بجائے اپنے رب کی رحمت قرار دیا، جس کی بدولت وہ لوگ یاجوج ماجوج کے حملوں سے محفوظ ہو گئے۔ اس کے ساتھ ہی اس کی مضبوطی کے باوجود اسے لازوال قرار دینے کے بجائے فرمایا کہ جب میرے رب کا وعدہ آئے گا تو وہ اسے زمین کے برابر کر دے گا اور میرے رب کا وعدہ ہمیشہ سے سچا ہے۔ ذوالقرنین کی بات اور دو باغوں والے بے ایمان کی بات کا موازنہ کریں، جو اپنے باغوں کو کبھی برباد نہ ہونے والا کہہ رہا تھا، تو مومن و کافر کی سوچ کا فرق صاف واضح ہو جاتا ہے۔ ¤ ➋ { فَاِذَا جَآءَ وَعْدُ رَبِّيْ جَعَلَهٗ دَكَّآءَ …:} ذوالقرنین کی اس بات سے یہ بھی معلوم ہوا کہ ساری دنیا کی بادشاہت ملنے کے باوجود آخرت کی فکر ہر وقت رہنی چاہیے، کیونکہ دنیا فانی ہے اور آخرت ہمیشہ رہنے والی ہے۔ اس وعدے سے مراد قیامت کے قریب یاجوج ماجوج کے نکلنے کا وقت ہے، جیسا کہ سورۂ انبیاء (۹۶، ۹۷) میں ہے۔ زینب بنت جحش رضی اللہ عنھا فرماتی ہیں : [ اِسْتَيْقَظَ النَّبِيُّ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ مِنَ النَّوْمِ مُحْمَرًّا وَجْهُهُ وَهُوَ يَقُوْلُ لاَ إِلٰهَ إِلاَّ اللّٰهُ، وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ، فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوْجَ وَمَأْجُوْجَ مِثْلُ هٰذِهِ وَعَقَدَ سُفْيَانُ تِسْعِيْنَ أَوْ  مِائَةً قِيْلَ أَنَهْلِكُ وَفِيْنَا الصَّالِحُوْنَ ؟ قَالَ نَعَمْ إِذَا كَثُرَ الْخَبَثُ ] [ بخاری، الفتن، باب قول النبي صلی اللہ علیہ وسلم : ویل للعرب… : ۷۰۵۹ ]’’رسول اللہ صلی اللہ علیہ وسلم نیند سے لا الٰہ الا اللہ کہتے ہوئے بیدار ہوئے، جب کہ آپ کا چہرہ سرخ تھا، فرمایا : ’’عرب کے لیے بہت بڑی تباہی ہے اس شر سے جو بہت قریب آ گیا ہے، آج یاجوج ماجوج کی دیوار میں اتنا حصہ کھول دیا گیا۔‘‘ اور سفیان نے نوے (۹۰) یا سو (۱۰۰) کی گرہ بنائی، یعنی انگوٹھے اور شہادت کی انگلی ملا کر گول دائرہ بنا کر دکھایا۔ پوچھا گیا : ’’کیا ہم اپنے آپ میں صالحین کے موجود ہوتے ہوئے ہلاک ہو جائیں گے؟‘‘ فرمایا : ’’ہاں، جب برائی زیادہ ہو جائے گی۔‘‘"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت 99) ➊ {وَ تَرَكْنَا بَعْضَهُمْ يَوْمَىِٕذٍ يَّمُوْجُ فِيْ بَعْضٍ :} اس دن سے مراد یہ ہے کہ ذوالقرنین کی بنائی ہوئی دیوار کے مسمار ہونے کے وقت یاجوج ماجوج سمندر کی موجوں کی طرح بے حساب تعداد میں یلغار کرتے ہوئے نکلیں گے۔ اسی کیفیت کو «{ وَ هُمْ مِّنْ كُلِّ حَدَبٍ يَّنْسِلُوْنَ }» [ الأنبیاء : ۹۶ ] میں بیان کیا گیا ہے۔ ¤ ➋ {وَ نُفِخَ فِي الصُّوْرِ فَجَمَعْنٰهُمْ جَمْعًا:’’’ الصُّوْرِ ‘‘} سے مراد وہ سینگ ہے جس میں فرشتہ پھونک مارے گا تو حشر برپا ہو جائے گا۔ یہ تفسیر خود رسول اللہ صلی اللہ علیہ وسلم سے ثابت ہے، چنانچہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ اَلصُّوْرُ قَرْنٌ يُنْفَخُ فِيْهِ ] [ أبوداوٗد، السنۃ، باب في ذکر البعث والصور : ۴۷۴۲۔ الصحیحۃ : ۱۰۸۰ ] ’’صور وہ قرن ہے جس میں پھونکا جائے گا۔‘‘ اس آیت میں مذکور نفخہ سے مراد دوسرا نفخہ ہے جس سے سب لوگ قبروں سے نکل کر میدان حشر میں جمع ہو جائیں گے۔"
    },
    {
      "ayah": 100,
      "tafsir": "(آیت 100) { وَ عَرَضْنَا جَهَنَّمَ …:} یہ پیش کرنا بھی عذاب سے پہلے عذاب ہو گا۔ دیکھیے اسی سورت کی آیت (۵۳) کی تفسیر۔"
    },
    {
      "ayah": 101,
      "tafsir": "(آیت 101) { الَّذِيْنَ كَانَتْ اَعْيُنُهُمْ … : ’’ غِطَآءٍ ‘‘} میں تنوین تعظیم کے لیے ہے، معنی ہے سخت گاڑھا پردہ، یعنی اپنی عقل کی آنکھ نہ تھی کہ قدرتیں دیکھ کر یقین لاتے اور ضد کی وجہ سے کسی کی بات سننے کے لیے تیار نہ تھے کہ سمجھانے سے سمجھ جاتے۔ مزید دیکھیے سورۂ ملک (۱۰)۔"
    },
    {
      "ayah": 102,
      "tafsir": "(آیت 102) ➊ {اَفَحَسِبَ الَّذِيْنَ كَفَرُوْۤا … :} سورت کی ابتدا اللہ تعالیٰ کے لیے اولاد بتانے والوں کو ڈرانے اور اصحابِ کہف کے اعلانِ توحید کے ذکر سے ہوئی تھی، آخر میں پھر وہی بات دہرائی، یعنی کیا ان کفار نے میرے خاص بندوں، جیسے مسیح، عزیر، روح القدس اور فرشتوں وغیرہ کو اپنا معبود بنا کر یہ سمجھ رکھا ہے کہ انھیں میرے مقابلے میں لا کھڑا کریں گے اور اپنا حمایتی بنا لیں گے۔ استفہام انکاری ہے، یعنی یہ گمان سراسر غلط ہے، بلکہ وہ سب ان کی عبادت سے بے زاری کا اعلان کریں گے اور ان کے مقابل مدعی بن کر کھڑے ہوں گے۔ دیکھیے سورۂ مریم (۸۲) اور احقاف (۵، ۶) اگرچہ {’’ عِبَادِيْ ‘‘} سے نیک و بد سبھی مراد ہو سکتے ہیں، کیونکہ سب اللہ کے بندے ہیں (دیکھیے مریم : ۹۳) مگر پہلا معنی زیادہ صحیح ہے، کیونکہ ’’میرے بندے‘‘ کہہ کر اپنا بنا لینے میں جو عزت افزائی ہے وہ خاص بندوں ہی کا حصہ ہے ۔ ¤ ➋ {اِنَّاۤ اَعْتَدْنَا جَهَنَّمَ لِلْكٰفِرِيْنَ نُزُلًا : ’’ نُزُلًا ‘‘} کا معنی وہ چیزیں ہیں جو مہمان نوازی کے لیے پیش کی جاتی ہیں۔ جہنم بطور مہمانی کفار کو مذاق ہے۔ {’’ نُزُلًا ‘‘} کا ایک معنی منزل بھی ہے، یعنی ہم نے جہنم کو کافروں کی منزل کے طور پر تیار کررکھا ہے۔"
    },
    {
      "ayah": 103,
      "tafsir": ""
    },
    {
      "ayah": 104,
      "tafsir": "(آیت 104) { اَلَّذِيْنَ ضَلَّ سَعْيُهُمْ … :} یعنی جتنے نیک اعمال انھوں نے کیے سب کفر کی شامت سے رائگاں گئے۔ دیکھیے سورۂ ابراہیم (۱۸)، نور (۳۹، ۴۰) اور فرقان (۲۳) یہ مطلب بھی درست ہے کہ ’’جن کی ساری کوشش دنیا کی زندگی میں گم ہو کر رہ گئی‘‘ یعنی اللہ تعالیٰ اور آخرت کی پروا نہ کی اور دنیا کی خوش حالیوں اور کامیابیوں کو اپنا اصل مقصد بنائے رکھا۔"
    },
    {
      "ayah": 105,
      "tafsir": "(آیت 105) {اُولٰٓىِٕكَ الَّذِيْنَ كَفَرُوْا … :} یعنی یہ لوگ اللہ تعالیٰ کی آیات اور آخرت کو مانتے ہی نہ تھے، سو انھوں نے اس کے لیے کچھ بھی نہ کیا، نیکیوں کے پلڑے میں کچھ ہے ہی نہیں تو صرف ایک پلڑے کا وزن کیا کیا جائے؟"
    },
    {
      "ayah": 106,
      "tafsir": ""
    },
    {
      "ayah": 107,
      "tafsir": "(آیت 107) { اِنَّ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ …:} کفار کے بعد ان کے مقابل اہل ایمان کی مہمانی کا ذکر فرمایا۔ فردوس کا معنی وہ باغ ہے جس میں تمام باغوں کے درخت، پھول اور پودے ہوں۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فَإِذَا سَأَلْتُمُ اللّٰهَ فَسْئَلُوْهُ الْفِرْدَوْسَ، فَإِنَّهُ أَوْسَطُ الْجَنَّةِ وَأَعْلَی الْجَنَّةِ، وَفَوْقَهُ ع عَرْشُ الرَّحْمٰنِ، وَمِنْهُ تَفَجَّرُ أَنْهَارُ الْجَنَّةِ ] ’’جب تم اللہ سے مانگو تو اس سے فردوس کا سوال کرو، کیونکہ وہ جنت کا سب سے افضل اور جنت کا سب سے اونچا مقام ہے اور اس کے اوپر رحمان کا عرش ہے اور اسی سے جنت کی نہریں نکلتی ہیں۔‘‘ [ بخاري، التوحید، باب: وکان عرشہ علی الماء : ۷۴۲۳ ]"
    },
    {
      "ayah": 108,
      "tafsir": "(آیت 108) { لَا يَبْغُوْنَ عَنْهَا حِوَلًا:} ایک جگہ زیادہ دیر رہنے سے آدمی اکتا جاتا ہے، مگر جنتی جنت سے کبھی دوسری جگہ منتقل ہونا نہیں چاہیں گے، کیونکہ اس سے بہتر عیش کی کوئی جگہ نہیں ہے، اللہ تعالیٰ نے فرمایا : «{ وَ لَكُمْ فِيْهَا مَا تَشْتَهِيْۤ اَنْفُسُكُمْ وَ لَكُمْ فِيْهَا مَا تَدَّعُوْنَ (31) نُزُلًا مِّنْ غَفُوْرٍ رَّحِيْمٍ }» [ حٰمٓ السجدۃ : ۳۱، ۳۲ ] ’’اور تمھارے لیے اس میں وہ کچھ ہے جو تمھارے دل چاہیں گے اور تمھارے لیے اس میں وہ کچھ ہے جو تم مانگو گے۔ یہ بے حد بخشنے والے، نہایت مہربان کی طرف سے مہمانی ہے۔‘‘ اور حدیث قدسی میں اللہ تعالیٰ نے فرمایا : [ أَعْدَدْتُ لِعِبَادِيَ الصَّالِحِيْنَ مَا لَا عَيْنٌ رَأَتْ، وَلَا أُذُنٌ سَمِعَتْ، وَلَا خَطَرَ عَلٰی قَلْبِ بَشَرٍ ] [ بخاری، بدء الخلق، باب ما جاء في صفۃ الجنۃ… : ۳۲۴۴۔ مسلم : ۲۸۲۴ ] ’’میں نے اپنے صالح بندوں کے لیے وہ کچھ تیار کیا ہے جو نہ کسی آنکھ نے دیکھا اور نہ کسی کان نے سنا اور نہ کسی انسان کے دل میں اس کا خیال گزرا۔‘‘ اور ان سب نعمتوں سے بڑی نعمت اللہ تعالیٰ کا دیدار ہو گی، پھر جنت کی نعمتیں ہر آن نئی سے نئی ہوتی رہیں گی، نہ ختم ہوں گی نہ کہیں رکیں گی، کیونکہ وہ اللہ کے کلمۂ کن سے وجود میں آئیں گی اور اللہ کے کلمات کی کوئی انتہا نہیں، دیکھیے اس سے اگلی آیت۔"
    },
    {
      "ayah": 109,
      "tafsir": "(آیت 109) ➊ { قُلْ لَّوْ كَانَ الْبَحْرُ مِدَادًا …:} کیونکہ سمندر مخلوق ہے جس کی حد اور انتہا ہے، جب کہ اللہ کا کلام اس کی صفت ہے، مخلوق نہیں، نہ اللہ کی ذات کی کوئی انتہا ہے نہ اس کی صفات کی۔ اگر اللہ کے کلمات لکھنے کے لیے سارے سمندر سیاہی بن جائیں اور زمین کے تمام درخت قلم بن جائیں، پھر اتنی سیاہی ہم اور لے آئیں، بلکہ مزید سات سمندر سیاہی بن جائیں تو سب ختم ہو جائیں گے، مگر اللہ کے کلمات ختم نہ ہوں گے۔ (دیکھیے لقمان : ۲۷) کیونکہ محدود چیز لا متناہی اور غیر محدود کا احاطہ کبھی نہیں کر سکتی۔ ¤ ➋ اس سے معلوم ہوا کہ جس طرح اللہ کی ذات ہمیشہ سے ہے اور ہمیشہ رہے گی اسی طرح اس کی دوسری صفات کی طرح صفت کلام بھی ہمیشہ سے ہے اور ہمیشہ رہے گی۔ وہ جب چاہے، جس سے چاہے، جو چاہے کلام کرتا ہے، اس کے کلام کی کوئی انتہا نہیں، وہ ہمیشہ کلام پر قادر رہے گا، جیسے رسولوں کے متعلق فرمایا : «{ مِنْهُمْ مَّنْ كَلَّمَ اللّٰهُ }» [ البقرۃ : ۲۵۳ ] ’’ان میں سے بعض سے اللہ نے کلام فرمایا۔‘‘ اور فرمایا : «وَ كَلَّمَ اللّٰهُ مُوْسٰى تَكْلِيْمًا » [ النساء : ۱۶۴] ’’اور اللہ نے موسیٰ سے کلام کیا، خود کلام کرنا۔‘‘ اور فرمایا : «{ وَ اِنْ اَحَدٌ مِّنَ الْمُشْرِكِيْنَ اسْتَجَارَكَ فَاَجِرْهُ حَتّٰى يَسْمَعَ كَلٰمَ اللّٰهِ }» [ التوبۃ : ۶ ] ’’اور اگر مشرکوں میں سے کوئی تجھ سے پناہ مانگے تو اسے پناہ دے دے، یہاں تک کہ وہ اللہ کا کلام سنے۔‘‘ اتنی واضح آیات کے باوجود مسلمانوں کے بہت سے گمراہ فرقے اللہ تعالیٰ کی صفت کلام کے منکر ہیں۔ ان کے مطابق اللہ کا کلام وہ معانی ہیں جو اس کی ذات میں ہیں۔ وہ بول نہیں سکتا، نہ اس کے الفاظ ہیں نہ آواز۔ الفاظ اور آواز کو اس نے پیدا کیا ہے، اس لیے یہ قرآن بھی مخلوق ہے، اللہ کا کلام نہیں۔ صرف اس کا مفہوم و معنی اللہ کی صفت ہے۔ چنانچہ ان میں سے بعض نے کہا کہ نماز میں قرآنی آیت کا مفہوم عربی الفاظ کے بجائے فارسی، اردو یا کسی اور زبان میں ادا کر دیا جائے تو نماز ہو جائے گی، کیونکہ قرآن کی تلاوت ہو گئی۔ حالانکہ اللہ تعالیٰ کے فرمان کے مطابق قرآن عربی ہے۔ دیکھیے سورۂ یوسف (۳) وغیرہ۔ امام اہل السنہ احمد ابن حنبل رحمہ اللہ نے انھی گمراہ فرقوں کی طرف سے بے شمار عذاب برداشت کیے، مگر قرآن کو اللہ کا کلام کہتے رہے، اسے مخلوق نہیں مانا اور امت کو صراط مستقیم سے ہٹنے نہیں دیا۔ بھلا کوئی شخص اپنے آپ کو تو کلام پر قادر سمجھے اور اپنے لیے گونگا ہونے کو عیب جانے، حالانکہ گونگے کے دل میں بھی معانی موجود ہوتے ہیں، مگر تمام صفات حسنہ کے مالک کے متعلق کہے کہ وہ نہ بولتا ہے نہ سنتا ہے، نہ دیکھتا ہے، نہ کوئی اس کا کلام سن سکتا ہے۔ ایسا عاجز رب انھی کو مبارک ہو قرآن و حدیث میں مذکور ہمارا رب تو بولتا بھی ہے، سنتا بھی اور وہ تمام صفات کمال کا مالک ہے۔ بعض پیغمبروں نے خود اس کا کلام سنا، بعض کو فرشتے کے ذریعے سے پہنچا، رسولوں کی معرفت آیا ہوا کلام ہم پڑھتے بھی ہیں اور سنتے بھی۔ [ وَالْحَمْدُ لِلّٰہِ عَلٰی نِعَمِہِ االشَّامِلَۃِ وَ آلَائِہِ الْکَامِلَۃِ ] ¤ ➌ یہاں انسان یہ سوچنے پر مجبور ہوتا ہے کہ ان عقل پرستوں نے صفات کا انکار کیوں کیا؟ پھر قرآن کے الفاظ کو مخلوق کہنے پر اتنا اصرار کیوں کیا کہ جو بھی قرآن کو مخلوق نہ کہے وہ ہر قسم کے سرکاری عہدے سے معزول ہے، حتیٰ کہ وہ نہ کسی مسجد کا خطیب ہو سکتا ہے نہ امام، نہ اپنے طور پر کسی مسجد میں پڑھا سکتا ہے، نہ درس دے سکتا ہے اور اہل السنہ، خصوصاً ان کے امام احمد ابن حنبل رحمہ اللہ نے اس کے انکار میں اتنی شدت کیوں کی اور اتنا عذاب کیوں جھیلا؟ جواب اس کا یہ ہے کہ خیر القرون گزرنے کے بعد عملی کمزوریوں کی وجہ سے طبائع قرآن و سنت پر عمل کی پابندیوں کو بوجھ سمجھنے لگیں، حکمرانوں کی مطلق العنانی میں بھی یہ دونوں چیزیں رکاوٹ تھیں، جیسا کہ ہم آج کل کے اکثر حکمرانوں اور ان کی اسلامی نظریاتی کونسلوں کے علماء کو دیکھتے ہیں۔ چنانچہ علمائے سوء نے عقل کا نام لے کر آزادی کی راہ میں رکاوٹ بننے والی ہر چیز کو راستے سے ہٹا دینے کی کوششیں شروع کر دیں۔ انھی دنوں مامون الرشید نے یونانی کتابوں کے تراجم کروائے تھے۔ دنیاوی معاملات میں اپنے پیش رو لوگوں کے تجربات سے فائدہ اٹھانے میں کوئی حرج نہیں، مگر ساتھ ہی یونانی فلسفے کا بھی ترجمہ ہوا تو اللہ تعالیٰ کے متعلق بھی ان کے عقائد ان لوگوں پر اثر انداز ہوئے۔ چنانچہ معتزلہ، یعنی عقل پرستوں نے ان کے کچھ بنیادی اصول تسلیم کر لیے، مثلاً ایک سے ایک ہی چیز کا صدور ہو سکتا ہے۔ محلِ حوادث حادث ہوتا ہے، یعنی جس سے کوئی نئی چیز وجود میں آئے وہ ذات قدیم، یعنی اللہ تعالیٰ نہیں ہو سکتا۔ لہٰذا اللہ تعالیٰ نہ دیکھتا ہے، نہ سنتا ہے، نہ بولتا ہے، نہ حرکت کر سکتا ہے، نہ وہ عرش پر ہے، نہ آسمان پر اترتا ہے، نہ قیامت کے دن زمین پر آئے گا، کیونکہ یہ سب حوادث ہیں۔ یہ عقائد قرآن و حدیث کا صاف انکار تھے، کیونکہ قرآن کے مطابق اللہ تعالیٰ ہر وقت نئی سے نئی حالت میں ہے، فرمایا : «{ كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ }» [ الرحمٰن : ۲۹ ] ’’ہر دن وہ ایک (نئی) شان میں ہے۔‘‘ وہ سمیع ہے، بصیر ہے، قیامت کے دن زمین پر آئے گا وغیرہ۔ ان لوگوں کے مقابلے میں مسلم علماء میں سے ایک تو متکلمین اٹھے جنھوں نے ان کا جواب دیا، مگر بدقسمتی سے ان کے اصول مان بیٹھے، چنانچہ انھوں نے فلاسفہ کے اصول بچانے کے لیے قرآن و حدیث کی تاویل بلکہ تحریف کی۔ کلام بھی چونکہ حادث ہے، یعنی ہر لفظ پہلے کے بعد نئے سے نیا آتا ہے اور ان کے بقول اللہ تعالیٰ ایسی چیزوں کا محل نہیں، لہٰذا انھوں نے اللہ کے کلام کا انکار کرنے کے لیے تاویل کا سہارا لیا اور کہا کہ قرآن کے معانی قدیم ہیں، وہ تو اللہ کی ذات میں ہیں، مگر الفاظ مخلوق ہیں، اصل مفہوم جس زبان اور جن الفاظ میں بھی ادا ہو جائے وہی قرآن ہے۔ حدیث سے وہ پہلے ہی یہ کہہ کر جان چھڑا چکے تھے کہ حدیث سے قرآن پر اضافہ نہیں ہو سکتا اور یہ کہ ان کے کہنے کے مطابق غیر فقیہ صحابی کی روایت کردہ حدیث قیاس کے خلاف ہو تو رد کر دی جائے گی۔ رہا قرآن تو اس میں من مانی تبدیلی کے لیے اس کے الفاظ کو اللہ کا کلام ماننے سے انکار کر دیا، صرف معنی و مفہوم کو قرآن قرار دیا۔ یہود و نصاریٰ میں بھی تحریف کا دروازہ یہیں سے کھلا کہ تورات و انجیل کے تراجم کو اللہ کا کلام کہہ دیا گیا، حتیٰ کہ اصل زبان والی کتابیں دنیا سے مفقود ہو گئیں۔ تراجم میں تبدیلی کچھ مشکل نہ تھی، لہٰذا اب وہ کتب اس قابل ہی نہیں رہیں کہ ان پر اعتماد کیا جا سکے۔ امام احمد ابن حنبل رحمہ اللہ ان کے عقلی ڈھکوسلوں کے مقابلے میں کہتے تھے کہ کوئی آیت یا حدیث پڑھو جس میں ہو کہ قرآن مخلوق ہے، ہم مان لیں گے۔ امام صاحب اسی پر قائم رہے۔ قرآن کے الفاظ ہی کو اللہ کا کلام کہنے پر ڈٹے رہے، جس کے نتیجے میں قرآن محفوظ رہا اور حدیث بھی حجت رہی۔ یہ «{ اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَ اِنَّا لَهٗ لَحٰفِظُوْنَ }» [ الحجر : ۹ ] کے وعدے کی تکمیل تھی۔ ان لوگوں نے مسلمانوں سے ان کی معنوی قوت ختم کرنے کے لیے ایمان کو بھی صرف دل کا فعل قرار دیا، اقرار کو بھی صرف مسلمان تسلیم ہونے کے لیے ضروری قرار دیا، اقرار نہ بھی کرے تو لوگوں کے نزدیک نہ سہی اللہ کے ہاں پکا مومن ہے۔ اقرار کر لے، عمل نہ بھی کرے تو اللہ کے ہاں اور مسلمانوں کے ہاں پکا مومن ہے۔ یہ اہل سنت محدثین ہی تھے جنھوں نے اسلام پر ان حملوں کا دفاع کیا اور جو سختی بھی ان پر گزری اسے برداشت کیا۔ کتنے ہی اس امتحان میں ناکام ہوئے، کتنے شہادت پا کر سرخرو ہوئے۔ اب بھی قرآن و حدیث پر قائم رہنے والوں کا ایسے لوگوں سے مقابلہ جاری ہے جو قرآن کے الفاظ کو اللہ کا کلام نہیں مانتے، اللہ تعالیٰ کی صفات، سننے، دیکھنے، رحم کرنے، اترنے، چڑھنے، عرش پر ہونے کو نہیں مانتے۔ اس کے ساتھ ہی اسلام کے ٹھیکیدار بھی بنے ہوئے ہیں۔ یہ اللہ ہی کا فضل ہے کہ قرآن و سنت پر قائم علماء صریح دلائل سے ان لوگوں کے عقائد کا باطل ہونا بیان کرتے رہتے ہیں اور قرآن و حدیث پر ذرہ برابر آنچ آنے دیتے ہیں نہ ان میں کوئی لفظی یا معنوی تحریف برداشت کرتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَرِثُ هٰذَا الْعِلْمَ مِنْ كُلِّ خَلَفٍ عُدُوْلُهُ يَنْفُوْنَ عَنْهُ تَأْوِيْلَ الْجَاهِلِيْنَ وَانْتِحَالَ الْمُبْطِلِيْنَ وَ تَحْرِيْفَ  الْغَالِيْنَ ] [ السنن الکبریٰ للبیھقی : 209/10، ح : ۲۱۴۳۹ ] ’’قرآن و حدیث کے اس علم کے وارث بعد میں آنے والے تمام لوگوں میں سے ان کے وہ عادل لوگ ہوں گے جو اس سے جاہلوں کی تاویل، باطل پرستوں کے گھڑے ہوئے جھوٹ اور غلو کرنے والوں کی تحریف کو دور کریں گے۔‘‘ [ اَللّٰھُمَّ اجْعَلْنَا مِنْھُمْ ]"
    },
    {
      "ayah": 110,
      "tafsir": "(آیت 110) ➊ { قُلْ اِنَّمَاۤ اَنَا بَشَرٌ مِّثْلُكُمْ …:} اللہ کے کبھی ختم نہ ہونے والے کلمات میں سے تمام پیغمبر اور ہمارے نبی صلی اللہ علیہ وسلم جو کلمات لے کر آئے کفار نے ان پر ایمان لانے سے اس لیے انکار کر دیا کہ انھیں لانے والے بشر تھے۔ ان کے خیال میں بشر اللہ کا رسول نہیں ہو سکتا تھا۔ دیکھیے سورۂ ابراہیم (۱۱) اور بنی اسرائیل (۹۴) کی تفسیر۔ عقل کے ان اندھوں کو دیکھو کہ احسن تقویم والے انسان کو اللہ کا رسول ماننے کے لیے تیار نہیں، مگر بے جان پتھروں کو معبود مان رہے ہیں۔ اللہ تعالیٰ نے فرمایا، ان سے کہہ دیجیے کہ میں تمھاری طرح ایک بشر ہونے کے سوا کچھ نہیں، نہ میں رب ہوں، نہ رب ہونے میں میرا کوئی حصہ ہے، نہ عالم الغیب ہوں، نہ اپنے یا تمھارے لیے کسی نفع یا نقصان کا مالک ہوں، بلکہ میں تمھاری طرح صرف ایک بشر ہوں، آدم علیہ السلام کی اولاد ہوں۔ میرے والدین بھی ہیں، بیوی بچے بھی، کھانے پینے کی اور دوسری بے شمار اشیاء کی محتاجی میں بھی تمھارا شریک ہوں۔ پیدائش، بچپن، جوانی، بڑھاپے، تندرستی، بیماری اور وفات سب میں تمھاری طرح ہوں، ہاں اللہ تعالیٰ کا مجھ پر احسان ہے کہ اس نے اپنے کلمات پہنچانے کے لیے مجھے وحی کا شرف عطا فرمایا ہے، جس کا اصل الاصول ایک اللہ کی عبادت ہے۔ سو تم میری نبوت مانو اور اللہ کی توحیدپر ایمان لے آؤ۔ ¤ واضح رہے کہ قرآن مجید کے مطابق رسول بشر ہوتا ہے، جسے اللہ رسالت کے لیے چن لیتا ہے۔ کوئی یہ کہے کہ بشر رسول نہیں ہو سکتا، یا یہ کہے کہ رسول بشر نہیں ہو سکتا، دونوں کا عقیدہ ایک ہے اور دونوں میں کوئی فرق نہیں۔ حافظ ابن کثیر رحمہ اللہ نے اس آیت کی تفسیر یہ کی ہے کہ ’’ان مشرکین سے جو آپ کی رسالت کو جھٹلاتے ہیں، کہہ دیجیے کہ میں محض تمھارے جیسا ایک بشر ہوں، پھر جو شخص سمجھتا ہے کہ میں جھوٹا ہوں تو جیسا کلام میں لے کر آیا ہوں وہ لے کر آئے، دیکھو میں نے عالم الغیب نہ ہوتے ہوئے ماضی کے جو واقعات (اصحاب کہف، ذوالقرنین وغیرہ کے) عین واقعہ کے مطابق تمھیں بتائے ہیں اگر اللہ تعالیٰ مجھے اطلاع نہ دیتا تو میں تمھیں کبھی نہ بتا سکتا۔‘‘ یہ تفسیر بھی اچھی ہے۔ ¤ ➋ {فَمَنْ كَانَ يَرْجُوْا لِقَآءَ رَبِّهٖ … : ’’ يَرْجُوْا ‘‘ ’’رَجَاءٌ‘‘} کا معنی امید ہے، اس کے ضمن میں خوف بھی ہوتا ہے کہ ایسا نہ ہو کہ امید پوری نہ ہو۔ غرض اس کے معنی امید اور خوف دونوں کر لیے جاتے ہیں۔ بندے اور اس کے رب کے تعلق کو نمایاں کرکے فرمایا کہ جو اپنے رب کی ملاقات اور دیدار کی امید رکھتا ہے، یا اس سے ملاقات کے وقت اس کے عذاب سے ڈرتا ہے اس کے لیے دو کام ضروری ہیں، پہلا یہ کہ وہ صالح عمل کرے اور صالح عمل وہ ہے جو اللہ تعالیٰ نے اپنے رسول کے ذریعے سے بتایا ہے، اس کے علاوہ سب بدعت اور گمراہی ہے۔ دوسرا یہ کہ اپنے رب کی عبادت میں کسی کو شریک نہ کرے، نہ کسی دوسرے کی عبادت کرکے اور نہ ریا کاری کرکے، کیونکہ غیر اللہ کی عبادت اگر شرک اکبر ہے تو ریا کاری (دکھاوا) شرک اصغر ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ قَالَ اللّٰهُ تَبَارَكَ وَ تَعَالٰی أَنَا أَغْنَی الشُّرَكَاءِ عَنِ الشِّرْكِ، مَنْ عَمِلَ عَمَلاً أَشْرَكَ فِيْهِ مَعِيَ غَيْرِيْ تَرَكْتُهُ وَ شِرْكَهُ ] [ مسلم، الزھد، باب تحریم الریاء : ۲۹۸۵، عن أبي ھریرۃ رضی اللہ عنہ ] ’’اللہ تبارک و تعالیٰ فرماتا ہے، میں تمام حصے داروں سے کہیں زیادہ (ہر قسم کے) حصے سے بے نیاز ہوں، جس نے کوئی ایسا عمل کیا جس میں میرے سوا کسی اور کو حصے دار بنایا تو میں اس عمل کو اور اس کے حصے کو چھوڑ دیتا ہوں۔‘‘ یعنی میں وہ حصہ بھی قبول نہیں کرتا جو اس عمل میں سے اس نے میرے لیے کیا ہے، کیونکہ اس میں دوسرا بھی حصے دار ہوتا ہے، تو میں اپنا حصہ بھی چھوڑ کر اسی کو دے دیتا ہوں، اب وہ اس کا اجر اسی سے لے، میں تو صرف وہ عمل قبول کرتا ہوں جو سارے کا سارا میرے لیے ہو، کسی دوسرے کا اس میں حصہ نہ ہو۔ جندب رضی اللہ عنہ فرماتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : [ مَنْ سَمَّعَ سَمَّعَ اللّٰهُ بِهِ، وَ مَنْ يُرَائِيْ يُرَائِي اللّٰهُ بِهِ ] ’’جو شخص سنانے (شہرت) کی خاطر عمل کرے اللہ تعالیٰ (اس کی بدنیتی) سب کو سنا دے گا اور جو لوگوں کو دکھانے کے لیے کوئی کام کرے گا اللہ تعالیٰ اسے سب لوگوں کو دکھلا دے گا۔‘‘ [ بخاری، الرقاق، باب الریاء والسمعۃ : ۶۴۹۹ ] ¤ ام المومنین ام سلمہ رضی اللہ عنھا فرماتی ہیں کہ حبشہ کے بادشاہ نجاشی نے، جو عیسائی تھا، جعفر بن ابی طالب رضی اللہ عنہ سے کہا : ’’جو کتاب محمد( صلی اللہ علیہ وسلم ) پر نازل ہوئی ہے اس کا کوئی حصہ تمھیں یاد ہے تو مجھے پڑھ کر سناؤ۔‘‘ چنانچہ جعفر رضی اللہ عنہ نے سورۂ مریم کا ابتدائی حصہ پڑھ کر سنایا، اللہ کی قسم! اسے سن کر نجاشی رونے لگا، حتیٰ کہ اس کی ڈاڑھی تر ہو گئی اور جتنے پادری اس کے پاس بیٹھے تھے وہ بھی رونے لگے، یہاں تک کہ ان کی کتابیں تر ہو گئیں، پھر نجاشی نے کہا : [ إِنَّ هٰذَا وَاللّٰهِ! وَالَّذِيْ جَاءَ بِهٖ مُوْسَی لَيَخْرُجُ مِنْ مِشْكَاةٍ وَاحِدَةٍ ]  [ مسند أحمد : 202/1، ۲۰۳، ح : ۱۷۴۵، حسنہ محققوہ ] ’’اللہ کی قسم! یہ کلام اور وہ کلام جو موسیٰ علیہ السلام لے کر آئے ایک ہی مشکاۃ(روشنی کے طاق) سے نکل رہا ہے۔‘‘"
    }
  ]
}