{
  "surah": "Al-Anbiyaa",
  "surah_number": 21,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "یہ سورت مکہ میں نازل ہونے والی ابتدائی سورتوں میں سے ہے۔ عبد اللہ بن مسعود رضی اللہ عنہ نے سورۂ بنی اسرائیل، کہف، مریم، طٰہٰ اور سورۂ انبیاء کے متعلق فرمایا : [ هُنَّ مِنَ الْعِتَاقِ الْأُوَلِ وَهُنَّ مِنْ تَلاَدِيْ ] ’’یہ پہلی قدیم سورتوں میں سے ہیں اور یہ میرے قدیم مال میں سے ہیں۔‘‘ [ بخاري، التفسیر، سورۃ الأنبیاء : ۴۷۳۹ ] ¤ (آیت 1) ➊ { اِقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ : ’’ اِقْتَرَبَ ‘‘ ’’ قَرِبَ يَقْرَبُ ‘‘} (ع، ک) میں سے باب افتعال کا ماضی معلوم ہے۔ حروف میں اضافے سے معنی میں مبالغہ پیدا ہوتا ہے، اس لیے ترجمہ کیا گیا ہے ’’بہت قریب آ گیا۔‘‘ {’’ غَفْلَةٍ ‘‘} میں تنوین تعظیم کے لیے ہے، اس لیے ترجمہ ’’بھاری غفلت‘‘ کیا گیا ہے۔ ¤ ➋ { ’’ اَلنَّاسُ‘‘ } کا لفظ عام ہے، یعنی سب لوگوں کے لیے ان کا حساب بہت قریب آ گیا، اس کے باوجود انھیں اس کی کچھ فکر نہیں، بلکہ وہ بھاری غفلت میں پڑے ہوئے ہیں، یعنی دنیا کی دلچسپیوں میں محو ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے {’’ فِيْ غَفْلَةٍ‘‘} کی تفسیر {’’ غَفْلفْلَةُ أَهْلِ الدُّنْيَا ‘‘} (دنیا والوں کی غفلت) فرمائی ہے۔ [ بخاري : ۴۷۳۰ ] دیکھیے سورۂ مریم (۳۹)۔ ¤ ➌ {حِسَابُهُمْ : } حساب کے لفظ میں دنیا و آخرت دونوں کا محاسبہ شامل ہے۔ دنیا میں محاسبہ جیسا کہ کفار قریش کو بدر اور فتح مکہ کی صورت میں پیش آیا اور ہر انسان کو سال میں ایک دو دفعہ پیش آتا رہتا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اَوَ لَا يَرَوْنَ اَنَّهُمْ يُفْتَنُوْنَ فِيْ كُلِّ عَامٍ مَّرَّةً اَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوْبُوْنَ وَ لَا هُمْ يَذَّكَّرُوْنَ }» [ التوبۃ : ۱۲۶ ] ’’اور کیا وہ نہیں دیکھتے کہ وہ ہر سال ایک یا دو مرتبہ آزمائش میں ڈالے جاتے ہیں پھر بھی وہ نہ توبہ کرتے ہیں اور نہ نصیحت پکڑتے ہیں۔‘‘ دنیا کے محاسبے کے فوراً بعد موت کی صورت میں محاسبہ پیش آئے گا، فرشتے کفار کی جانیں نکالتے ہوئے کہہ رہے ہوں گے : «{ اَخْرِجُوْۤا اَنْفُسَكُمْ اَلْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُوْنِ بِمَا كُنْتُمْ تَقُوْلُوْنَ عَلَى اللّٰهِ غَيْرَ الْحَقِّ وَ كُنْتُمْ عَنْ اٰيٰتِهٖ تَسْتَكْبِرُوْنَ}» [ الأنعام : ۹۳ ] ’’نکالو اپنی جانیں، آج تمھیں ذلت کا عذاب دیا جائے گا، اس کے بدلے جو تم اللہ پر ناحق (باتیں) کہتے تھے اور تم اس کی آیتوں سے تکبر کرتے تھے۔‘‘ موت کے بعد قبر کے سوال و جواب کی صورت میں محاسبہ اور آخر میں قیامت کے دن حساب ہو گا۔حساب کے لفظ میں یہ تمام محاسبے شامل ہیں مگر یوم حساب کے طور پر قیامت کا دن مشہور ہے، اس لیے اکثر مفسرین نے یہاں صرف اسی کا ذکر کیا ہے۔ حقیقت یہ ہے کہ حساب کے یہ تمام مرحلے بالکل قریب ہیں۔ حساب کی کچھ صورتیں تو زندگی ہی میں ہر روز پیش آتی رہتی ہیں، پھر موت کے قرب میں کسی کو شک نہیں، رہی قیامت تو اگرچہ وہ لوگوں کو دور دکھائی دیتی ہے مگر ہر آنے والی چیز قریب ہے، خواہ کتنے انتظار کے بعد آئے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اِنَّهُمْ يَرَوْنَهٗ بَعِيْدًا (6) وَ نَرٰىهُ قَرِيْبًا }» [ المعارج : ۶، ۷ ] ’’بے شک وہ اسے دور خیال کر رہے ہیں اور ہم اسے قریب دیکھ رہے ہیں۔‘‘ نیز دیکھیے سورۂ نحل (۱)، حج (۴۷) اور قمر (۱) اس لحاظ سے بھی یوم حساب بہت قریب آ گیا ہے کہ دنیا کی مدت کا اکثر حصہ گزر چکا۔ اب آخری نبی صلی اللہ علیہ وسلم کے آنے کے بعد کوئی اور نبی نہیں آئے گا، بلکہ قیامت ہی آئے گی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ بُعِثْتُ أَنَا وَالسَّاعَةُ كَهَاتَيْنِ يَعْنِيْ إِصْبَعَيْنِ ] ’’میں اور قیامت ان دو انگلیوں کی طرح (قریب قریب) بھیجے گئے ہیں۔‘‘ [ بخاري، الرقاق، باب قول النبي صلی اللہ علیہ وسلم : بعثت أنا والساعۃ کھاتین : ۶۵۰۵، عن أنس رضی اللہ عنہ ] ¤ ➍ { مُعْرِضُوْنَ :} یعنی لوگوں کا حال یہ ہے کہ اپنا حساب نہایت قریب آنے کے باوجود ایسی بھاری غفلت میں پڑے ہیں کہ ہر نصیحت سے منہ موڑے ہوئے ہیں۔ {’’اَلنَّاسُ‘‘} کے لفظ سے تمام لوگوں کو حساب کے بہت قریب آنے سے ڈرایا مگر آئندہ آیات میں کفار و مشرکین کی غفلت اور اعراض کو زیادہ اجاگر فرمایا ہے۔ اس آدمی کی غفلت و اعراض میں کیا شک ہے جو یہ جانتے ہوئے بھی خبردار نہیں ہوتا کہ مجھے یقینا مرنا ہے، صرف اس لیے کہ موت یا قیامت کا دن اسے متعین کرکے نہیں بتایا گیا۔ اس کی مثال اس نکمّے طالب علم کی سی ہے جسے معلوم ہے کہ امتحان یقینا ہونا ہے مگر وہ اس لیے بے پروا ہے کہ ابھی امتحان کی تاریخ کا اعلان نہیں ہوا۔ ابن کثیر نے یہاں ابوالعتاہیہ کا ایک شعر نقل فرمایا ہے: ¤ {اَلنَّاسُ فِيْ غَفَلاَتِهِمْ ¤ وَ رَحَي الْمَنِيَّةِ تَطْحَنُ} ¤ ’’لوگ اپنی غفلتوں میں پڑے ہوئے ہیں، جب کہ موت کی چکی پیستی چلی جا رہی ہے۔‘‘"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { مَا يَاْتِيْهِمْ مِّنْ ذِكْرٍ مِّنْ رَّبِّهِمْ …:’’ اِلَّا اسْتَمَعُوْهُ ‘‘ ’’سَمِعَ يَسْمَعُ‘‘} کا معنی سننا ہے، باب افتعال میں تاء کے اضافے سے معنی میں اضافہ ہو گیا، جو موقع کی مناسبت سے خود بخود سمجھ میں آ رہا ہے۔ عام طور پر {’’اِسْتَمَعَ‘‘} کا معنی کان لگا کر سننا آتا ہے، مگر ظاہر ہے کہ کفار کے لیے نصیحت کو کان لگا کر سننا مشکل ہے، خصوصاً جب وہ اس کا مذاق اڑا رہے ہوں، اس لیے معنی کیا گیا ہے ’’مگر وہ اسے مشکل سے سنتے ہیں۔‘‘ ¤ ➋ پچھلی آیت میں لوگوں کے غفلت میں گرفتار ہونے اور منہ موڑنے کا ذکر تھا۔ اس آیت میں بتایا کہ انھیں اس غفلت سے بیدار کرنے کے لیے ان کے رب کی طرف سے قرآن و سنت کی صورت میں نئی سے نئی نصیحت آتی رہتی ہے، مگر قبول کرنا تو دور کی بات، وہ اسے توجہ اور اطمینان سے سنتے بھی نہیں، بلکہ کھیلتے اور مذاق اڑاتے ہوئے بڑی مشکل اور گرانی سے سنتے ہیں۔ ¤ ➌ {’’ مِنْ ذِكْرٍ مِّنْ رَّبِّهِمْ ‘‘} (ان کے رب کی طرف سے نصیحت) سے معلوم ہو رہا ہے کہ رب تعالیٰ صرف کھانے پینے اور دنیوی ضرورتیں پوری کرنے والا رب اور پروردگار ہی نہیں بلکہ انسان کی روحانی ضرورتیں اور آخرت کی نجات کی ضامن چیزوں کو مہیا کرنے والا رب بھی ہے۔ ¤ ➍ {’’ مُحْدَثٍ ‘‘} کا معنی ’’نیا‘‘ ہے، یعنی اللہ تعالیٰ کے ہاں سے لوگوں کی طرف قرآن اور حدیث کی صورت میں نئی سے نئی نصیحت آتی رہتی ہے۔ اس سے معلوم ہوا کہ اللہ تعالیٰ جب چاہے اور جو چاہے کلام کر سکتا ہے۔ بعض لوگوں نے قرآن کو اللہ تعالیٰ کا کلام ماننے سے انکار کر دیا، بلکہ اسے مخلوق قرار دیا اور کہا کہ اللہ تعالیٰ کا کلام کرنا ناممکن ہے۔ اس بحث کی تفصیل کے لیے دیکھیے سورۂ اعراف (۱۴۳)، توبہ (۶) اور کہف (۱۰۹)۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {لَاهِيَةً قُلُوْبُهُمْ وَ اَسَرُّوا النَّجْوَى …: ’’ لَاهِيَةً ‘‘ ’’ لَهِيَ يَلْهٰي ‘‘} (ع) یا {’’ لَهَا يَلْهُوْ‘‘} (ن) سے اسم فاعل مؤنث کا صیغہ ہے۔ {’’ لَهْوٌ‘‘} وہ چیز ہے جو انسان کو اس کے ضروری اور اہم کاموں سے کسی اور کام میں مشغول کر دے۔ (راغب) جیسا کہ مادہ پرست لوگ آخرت کی فکر چھوڑ کر صرف دنیا کی طلب میں مشغول ہیں۔ آج کل کے علوم و فنون سائنس، آرٹ وغیرہ میں کوئی چیز ایسی نہیں جو آخرت کی یاد دلانے والی ہو، بلکہ یہ سب روشن خیالیاں دن بدن موت اور آخرت کی فکر سے دور لے جا رہی ہیں۔ مزید دیکھیے سورۂ روم (۶، ۷)۔ ¤ ➋ { وَ اَسَرُّوا النَّجْوَى :} یہاں نحو کا ایک مشہور سوال ہے کہ جب فاعل ظاہر ہو تو خواہ وہ واحد ہو یا تثنیہ یا جمع، فعل واحد کے صیغے کے ساتھ آتا ہے۔ یہاں {’’ الَّذِيْنَ ظَلَمُوْا ‘‘} فاعل ظاہر ہونے کے باوجود فعل جمع کے صیغے کے ساتھ کیوں آیا ہے؟ جواب اس کا یہ ہے کہ {’’ اَسَرُّوا ‘‘} کا فاعل ضمیر جمع ہے اور {’’ الَّذِيْنَ ظَلَمُوْا ‘‘} اس سے بدل ہے، یعنی کفار نے باہمی خفیہ مشورے سے لوگوں کو آپ صلی اللہ علیہ وسلم سے دور رکھنے کے لیے خفیہ مشاورت کرکے طے کیا کہ لوگوں سے یہ کہو اور خفیہ رکھنے کی وجہ یہ تھی کہ اگر لوگوں کو پتا چل گیا کہ یہ ان کی طے کردہ بات ہے تو وہ اس سے متاثر نہیں ہوں گے۔ ¤ ➌ {هَلْ هٰذَاۤ اِلَّا بَشَرٌ مِّثْلُكُمْ … :} یعنی یہ کوئی فرشتہ نہیں ہے، بلکہ تمھاری طرح کا ایک انسان ہے، اب جو یہ معجزات دکھاتا ہے اور اس کلام کو سن کر لوگ گرویدہ ہو رہے ہیں تو یہ سب جادو ہے۔ کفار نے آپ صلی اللہ علیہ وسلم کی نبوت پر دو طرح سے طعن کیا، ایک یہ کہ آپ بشر ہیں اور بشر نبی نہیں ہو سکتا۔ اللہ تعالیٰ نے یہ بات کئی جگہ بیان فرمائی ہے، مثلاً دیکھیے سورۂ بنی اسرائیل (۹۴)، تغابن (۶)، قمر (۲۴)، مومنون (۳۳، ۳۴)، فرقان (۷) اور ابراہیم (۱۰) پہلے کفار و مشرکین کہتے تھے کہ بشر نبی نہیں ہو سکتا، آج کل کچھ لوگ کہتے ہیں کہ نبی بشر نہیں ہو سکتا، بات ایک ہی ہے، «{ بَلْ قَالُوْا مِثْلَ مَا قَالَ الْاَوَّلُوْنَ }» [المؤمنون : ۸۱ ] ’’بلکہ انھوں نے کہا جیسے پہلوں نے کہا تھا۔‘‘ اللہ تعالیٰ نے آگے اس کا رد فرمایا۔ دوسرا طعن یہ تھا کہ قرآن اللہ کا کلام نہیں بلکہ جادو ہے۔ کفار کا یہ طعن بھی اللہ تعالیٰ نے کئی جگہ ذکر فرمایا ہے، مثلاً دیکھیے سورۂ مدثر (۲۴) اور ذاریات (۵۲)۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) { قٰلَ رَبِّيْ يَعْلَمُ الْقَوْلَ … :} یعنی پیغمبر صلی اللہ علیہ وسلم نے اس کے جواب میں فرمایا کہ تم نے خفیہ مشورے سے جو بات طے کی ہے وہ میرے رب سے مخفی نہیں۔ وہ آسمان و زمین میں ہونے والی ہر بات کو جانتا ہے، کیونکہ وہ سمیع بھی ہے اور علیم بھی۔ یہاں اللہ تعالیٰ نے {’’يَعْلَمُ السِّرَّ‘‘} (وہ چھپی بات کو جانتا ہے) کے بجائے {’’ يَعْلَمُ الْقَوْلَ ‘‘} فرمایا، یعنی وہ ہر بات جانتا ہے، تمھاری خفیہ سرگوشیاں بھی اور بلند آواز سے گفتگو بھی۔ اس لیے اس کے پیغمبر کے خلاف تمھاری یہ خفیہ مجلسیں یا علانیہ مخالفت تمھارے کسی کام نہیں آئیں گی اور تم غلبۂ اسلام کو کسی طرح نہیں روک سکو گے۔ ایک قراء ت میں {’’ قُلْ رَّبِّي‘‘} ہے، یعنی کہہ دے کہ میرا رب آسمان و زمین میں ہونے والی ہر بات جانتا ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {بَلْ قَالُوْۤا اَضْغَاثُ اَحْلَامٍۭ … : ’’ اَضْغَاثُ اَحْلَامٍۭ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ یوسف (۴۴)۔ ¤ ➋ اللہ تعالیٰ نے قرآن کریم کو جھٹلانے والے کفار کے مختلف اقوال ذکر کرکے ثابت کیا کہ یہ خوب جانتے ہیں کہ قرآن اللہ تعالیٰ کا کلام ہے، مگر ضد اور عناد کی وجہ سے اسے ماننے کے لیے تیار نہیں ہیں، اس لیے سخت بدحواس اور مذبذب ہیں کہ قرآن کو کیا کہہ کر جھٹلائیں۔ کبھی کہتے ہیں کہ یہ خوابوں کی پریشان باتیں ہیں، پھر کہتے ہیں کہ نہیں، بلکہ آپ صلی اللہ علیہ وسلم نے اسے خود تصنیف کرکے اللہ کے ذمے لگا دیا ہے۔ پھر اس پر تسلی نہیں ہوتی تو کہتے ہیں کہ نہیں، اصل یہ ہے کہ آپ شاعر ہیں اور یہ قرآن آپ کے شاعرانہ تخیل کا نتیجہ ہے۔ سورۂ مدثر (۱۸ تا ۲۵) میں کفار کے ایک کھڑپینچ کی اسی طرح کی پریشان خیالی کا ذکر فرمایا ہے۔ مگر اللہ تعالیٰ نے ان کی ایسی تمام باتوں کا جواب دے رکھا تھا کہ اگر تمھیں اس قرآن کے اللہ کا کلام ہونے میں شک ہے تو اس جیسی کتاب بنا کر لے آؤ، یا دس سورتیں بنا کر لے آؤ، چلو! یہ بھی نہیں تو اس جیسی ایک سورت بنا کر لے آؤ۔ اگر یہ بھی نہ کرو اور کر بھی نہیں سکو گے، تو جہنم کی آگ سے ڈر کر اس پر ایمان لے آؤ۔ حقیقت یہ ہے کہ قرآن مجید رسول اللہ صلی اللہ علیہ وسلم کو عطا کیا گیا سب سے بڑا معجزہ ہے۔ کفار کے پاس اس کا کوئی جواب نہ اس وقت تھا اور نہ قیامت تک اس کا جواب لا سکتے ہیں۔ مگر وہ ماننے کے لیے تیار ہی نہ تھے، اس لیے کہنے لگے کہ اس معجزے کو دیکھ کر ہم ایمان نہیں لائیں گے، ہمارے پاس تو یہ رسول وہ معجزے لے کر آئے جو پہلے رسولوں کو دیے گئے تھے، مثلاً صالح علیہ السلام کی اونٹنی، موسیٰ علیہ السلام کا عصا، عیسیٰ علیہ السلام کا مردہ کو زندہ کرنا، نابینا کو بینا کرنا وغیرہ۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) { مَاۤ اٰمَنَتْ قَبْلَهُمْ مِّنْ قَرْيَةٍ … :} اس آیت میں تین باتیں نہایت اختصار کے ساتھ بیان فرمائی ہیں۔ پہلی یہ کہ ایمان لانے کی شرط کے طور پر تم نے پہلے رسولوں جیسا معجزہ لانے کا مطالبہ کیا ہے، سو پہلی امتوں کو ایسے معجزات دکھائے گئے، وہ ان پر ایمان نہیں لائے، تو تم جو ان سے کہیں بڑھ کر سرکش اور ضدی ہو، کیسے ایمان لاؤ گے؟ دیکھیے سورۂ بنی اسرائیل (۵۹) دوسری یہ کہ جو قومیں معجزات دیکھ کر ایمان نہیں لائیں انھیں ہلاک کر دیا گیا، کیونکہ صریح معجزہ آنکھوں سے دیکھ لینے کے بعد ایمان نہ لانے والی قوم ہلاک کر دی جاتی ہے، تو تم ایسا مطالبہ کیوں کرتے ہو جس کا نتیجہ تمھاری ہلاکت ہے؟ تیسری یہ کہ تمھیں معجزہ نہ دکھانا اللہ تعالیٰ کی تم پر رحمت ہے کہ اس نے تمھیں مہلت دے رکھی ہے اور اس کے علم میں تمھاری کئی نسلوں کا مسلمان ہونا مقدر ہے۔ تفصیل کے لیے دیکھیے سورۂ عنکبوت (۴۸تا ۵۱) کی تفسیر۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {وَ مَاۤ اَرْسَلْنَا قَبْلَكَ اِلَّا رِجَالًا … :} یہ {’’ هَلْ هٰذَاۤ اِلَّا بَشَرٌ مِّثْلُكُمْ ‘‘} (یہ تم جیسے ایک بشر کے سوا ہے کیا) کا جواب ہے، یعنی وہ تمام رسول جو آپ سے پہلے آئے، جن کے رسول ہونے کو یہ بھی مانتے ہیں، مثلاً ابراہیم، اسماعیل اور اسحاق علیہم السلام وغیرہم، وہ سب بشر تھے، جن کی طرف ہم وحی کرتے تھے۔ تو یہ لوگ آپ کو بشر ہونے کی وجہ سے رسول کیوں نہیں مانتے؟ دیکھیے سورۂ انعام (۹۱) سیدہ عائشہ رضی اللہ عنھا فرماتی ہیں : [ كَانَ بَشَرًا مِّنَ الْبَشَرِ يَفْلِيْ ثَوْبَهُ وَ يَحْلِبُ شَاتَهُ وَيَخْدِمُ نَفْسَهُ ] [ مسند أحمد : 256/6، ح : ۲۶۲۴۸۔ سلسلۃ الأحادیث الصحیحۃ : ۶۷۱ ] ’’آپ صلی اللہ علیہ وسلم انسانوں میں سے ایک انسان تھے، اپنا کپڑا خود ٹٹول لیا کرتے تھے اور اپنی بکری کا دودھ خود دوہ لیتے تھے اور اپنا کام خود کر لیتے تھے۔‘‘ زمین میں اگر فرشتے رہا کرتے تو رسول بھی فرشتہ آتا، اب انسان بستے ہیں تو ان کے لیے نمونہ اور ان کی رہنمائی کرنے والا انسان ہی ہو سکتا ہے۔ دیکھیے سورۂ بنی اسرائیل (۹۴، ۹۵)۔ ¤ ➋ {فَسْـَٔلُوْۤا اَهْلَ الذِّكْرِ … :} اس جملے کی مفصل تفسیر کے لیے دیکھیے سورۂ نحل (۴۳)۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {وَ مَا جَعَلْنٰهُمْ جَسَدًا …:’’ جَسَدًا ‘‘} کا معنی بے جان جسم ہے، یہ جثہ کا ہم معنی ہے۔ محقق ائمۂ لغت کا یہی قول ہے، جیسا کہ ابو اسحاق زجاج نے اللہ تعالیٰ کے فرمان : «{ فَاَخْرَجَ لَهُمْ عِجْلًا جَسَدًا لَّهٗ خُوَارٌ }» [ طٰہٰ : ۸۸ ] کی تفسیر میں نقل کیا ہے۔ [ التحریر والتنویر ] یہ ان کے اس اعتراض کا جواب ہے : «{ مَالِ هٰذَا الرَّسُوْلِ يَاْكُلُ الطَّعَامَ وَ يَمْشِيْ فِي الْاَسْوَاقِ }» [الفرقان : ۷ ] ’’اس رسول کو کیا ہے کہ کھانا کھاتا ہے اور بازاروں میں چلتا پھرتا ہے۔‘‘ اس کے ساتھ ہی ان کا ایک اعتراض یہ بھی تھا : «{ هَلْ هٰذَاۤ اِلَّا بَشَرٌ مِّثْلُكُمْ }» [ الأنبیاء : ۳ ] ’’یہ تمھارے جیسا ایک بشر ہی تو ہے۔‘‘ ان اعتراضوں کے ساتھ مطالبہ یہ تھا : «{ فَلْيَاْتِنَا بِاٰيَةٍ كَمَاۤ اُرْسِلَ الْاَوَّلُوْنَ }» [ الأنبیاء : ۵ ] ’’پس یہ ہمارے پاس کوئی نشانی لائے جس طرح پہلے رسول بھیجے گئے۔‘‘ {’’ فَلْيَاْتِنَا بِاٰيَةٍ ‘‘} کا جواب پہلے گزر چکا ہے۔ یہاں دوسرے دونوں اعتراضوں کا جواب دیا کہ اس سے پہلے تمام رسول جو ہم نے بھیجے، بشر تھے فرشتے نہ تھے، مرد تھے عورتیں نہ تھے۔ اسی طرح وہ بے جان جسم نہ تھے جو نہ کھاتے ہوں اور نہ بازاروں میں چلتے پھرتے ہوں، بلکہ وہ کھاتے پیتے بھی تھے اور بازاروں میں بھی چلتے پھرتے تھے۔ (فرقان : ۲۰) ان کی بیویاں بھی تھیں اور اولاد بھی۔ (رعد : ۳۸) جیسے تمھارے جد امجد ابراہیم اور اسماعیل علیھما السلام اور بنی اسرائیل کے جد امجد یعقوب، اسحاق اور ابراہیم علیھم السلام ۔ تو جب ان سب کو بشر ہونے، کھانے پینے، بازاروں میں چلنے پھرنے اور صاحب آل و اولاد ہونے کے بباوجود رسول مانتے ہو تو نبی امی صلی اللہ علیہ وسلم کو رسول کیوں نہیں مانتے؟ ¤ ➋ مشرکین خواہ پہلے زمانے کے ہوں یا رسول اللہ صلی اللہ علیہ وسلم کے زمانے کے یا ہمارے زمانے کے، سب کا ذہن یہی ہوتا ہے کہ بزرگ کھانے پینے سے بے نیاز اور بیوی بچوں سے مستغنی ہوتے ہیں اور دنیا کے دھندوں سے ان کا کوئی تعلق نہیں ہوتا۔ اسی لیے ان کی نگاہ میں بزرگ اور پیر بننے والے حضرات کمائی وغیرہ چھوڑ کر کٹیاؤں اور خانقاہوں میں ڈیرے لگا لیتے ہیں۔ ان بزرگوں کے بعض عقیدت مند ان کے متعلق عجیب و غریب قصے مشہور کر دیتے ہیں، جن کا ہونا ممکن ہی نہیں۔ اگر یقین نہ آئے تو ’’تذکرۃ الاولیاء‘‘ پڑھ لیں، مثلاً فلاں بزرگ نے پہلے ایک دن کھانے کا ناغہ کیا، پھر ایک ماہ کا، پھر ایک سال کا اور پھر ساری عمر کا۔ پنجاب کے ایک بزرگ کے متعلق ان کے عقیدت مندوں نے مشہور کر رکھا ہے کہ انھوں نے بارہ سال کچھ کھائے بغیر جنگل میں عبادت کرتے ہوئے گزار دیے، صرف ایک لکڑی کی روٹی ان کے پاس تھی، جسے کبھی کبھار وہ دانتوں سے کاٹتے تھے۔ پھر بارہ سال انھوں نے ایک کنویں میں الٹے لٹک کر اللہ کی عبادت کرتے ہوئے گزار دیے۔ ان سے کوئی نہیں پوچھتا کہ الٹا لٹکنا کون سی عبادت ہے؟ اور اس عرصے کی نمازیں، روزے اور وضو و غسل سب کہاں گئے؟ ان لوگوں کے ہاں یہ بزرگی ہے، جب کہ وہ تین صحابہ، جن میں سے ایک نے کہا تھا کہ میں ہمیشہ ساری ساری رات قیام کیا کروں گا، کبھی سوؤں گا نہیں، دوسرے نے کہا تھا کہ میں ہمیشہ دن کو روزہ رکھوں گا کبھی روزے کے بغیر نہیں رہوں گا اور تیسرے نے کہا تھا کہ میں عورتوں سے نکاح نہیں کروں گا، تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا تھا : [ وَاللّٰهِ ! إِنِّيْ لَأَخْشَاكُمْ لِلّٰهِ وَأَأَتْقَاكُمْ لَهُ لٰكِنّيْ أَصُوْمُ وَأُفْطِرُ وَ أُصَلِّيْ وَ أَرْقُدُ وَ أَتَزَوَّجُ النِّسَاءَ فَمَنْ رَغِبَ عَنْ سُنَّتِيْ فَلَيْسَ مِنِّيْ ] ’’اللہ کی قسم ! میں تم سب سے زیادہ اللہ سے ڈرنے والا ہوں اور تم سب سے زیادہ پرہیز گار ہوں، لیکن میں قیام کرتا ہوں اور سوتا بھی ہوں، روزے رکھتا ہوں کبھی نہیں بھی رکھتا اور میں عورتوں سے نکاح بھی کرتا ہوں، تو جس نے میرے طریقے سے بے رغبتی کی وہ مجھ سے نہیں۔‘‘ [ بخاري، النکاح، باب الترغیب في النکاح : ۵۰۶۳ ] ¤ ➌ { وَ مَا كَانُوْا خٰلِدِيْنَ :} یہ بھی کفار کے ایک غلط عقیدے کا ررد ہے کہ اللہ کے رسول اور خاص بندے مرتے نہیں۔ کئی جاہلوں نے ایک عبارت بنا رکھی ہے جسے وہ قرآن کی آیت قرار دے کر سناتے ہیں : {’’ أَلَا إِنَّ أَوْلِيَائَ اللّٰهِ لَا يَمُوْتُوْنَ وَلٰكِنَّهُمْ مِنْ دَارٍ إِلٰي دَارٍ يَنْتَقِلُوْنَ ‘‘} ’’یاد رکھو! اللہ کے ولی مرتے نہیں، بلکہ  ایک گھر سے دوسرے گھر کی طرف منتقل ہوجاتے ہیں۔‘‘ اگر کوئی شخص کہہ بیٹھے کہ اللہ کے رسول صلی اللہ علیہ وسلم یا فلاں بزرگ فوت ہو گئے ہیں تو یہ لوگ اسے گستاخ قرار دے کر اس پر حملہ کرنے سے بھی گریز نہیں کرتے۔ اللہ تعالیٰ نے یہاں فرمایا کہ پہلے گزرے ہوئے رسول ہمیشہ رہنے والے نہ تھے، بلکہ اپنی طبعی زندگی گزار کر فوت ہو گئے۔ دوسری جگہ فرمایا : «{ وَ مَا جَعَلْنَا لِبَشَرٍ مِّنْ قَبْلِكَ الْخُلْدَ اَفَاۡىِٕنْ مِّتَّ فَهُمُ الْخٰلِدُوْنَ }» [الأنبیاء : ۳۴ ] ’’اور ہم نے تجھ سے پہلے کسی بشر کے لیے ہمیشگی نہیں رکھی، سو کیا اگر تو مر جائے تو یہ ہمیشہ رہنے والے ہیں۔‘‘ مزید تفصیل کے لیے دیکھیے سورۂ زمر (۳۰، ۳۱)۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {ثُمَّ صَدَقْنٰهُمُ الْوَعْدَ …: ’’ صَدَقَ يَصْدُقُ‘‘} لازم بھی آتا ہے، یعنی سچ کہنا اور متعدی بھی، یعنی سچا کر دکھانا، ’’پھر ہم نے ان سے وعدہ سچا کر دیا۔‘‘ {’’ ثُمَّ ‘‘} (پھر) کا لفظ یہ بتانے کے لیے ہے کہ رسولوں کی مخالفت ہوئی، انھیں ستایا گیا، جنگیں بھی ہوئیں مگر پھر آخر کار ہم نے ان سے مدد کا جو وعدہ کیا تھا وہ پورا کیا، سو ہم نے رسولوں کو نجات دی اور ان کو بھی جنھیں ہم چاہتے تھے۔ اس میں رسولوں کے پیروکار بھی شامل ہیں اور کفار میں سے وہ بھی جنھیں آئندہ ایمان لانا تھا، یا جن کی اولاد کو ایمان کی توفیق ملنا تھی۔ عربوں پر سب کو ہلاک کرنے والا عذاب نہ آنے میں یہی حکمت تھی۔ ’’اور حد سے بڑھنے والوں کو ہلاک کر دیا‘‘ اس میں رسول اللہ صلی اللہ علیہ وسلم اور آپ کے پیروکاروں کے لیے خوش خبری ہے اور کفار کے لیے وعید۔ رسولوں سے کیے گئے مدد کے وعدے اور اسے پورا کرنے کے ذکر پر مشتمل آیات سورۂ مجادلہ (۲۱)، صافات (۷۱ تا ۷۳)، ابراہیم (۱۳، ۱۴) اور یوسف (۱۱۰) میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {لَقَدْ اَنْزَلْنَاۤ اِلَيْكُمْ كِتٰبًا … :} اس آیت میں کفار کی ان تمام پریشان کن باتوں کا اکٹھا جواب ہے جو وہ نبی صلی اللہ علیہ وسلم اور قرآن کے متعلق کہتے تھے کہ یہ خوابوں کی پراگندہ باتیں ہیں، یا من گھڑت باتیں ہیں، یا جادو ہے، یا شاعری ہے، تو فرمایا کہ قرآن کا ان میں سے کسی بات سے کوئی تعلق نہیں، بلکہ ہم نے تو تمھاری طرف ایسی کتاب نازل کی ہے جس میں تمھارا ہی ذکر ہے، تمھارے ہی حالات اور زندگی کے معاملات پر بحث کی گئی ہے اور انھی کے متعلق تمھاری راہنمائی کی گئی ہے۔ اس میں خواب، جادو یا شاعری کی کون سی بات ہے، تو کیا تم سمجھتے نہیں؟ {’’ فِيْهِ ذِكْرُكُمْ ‘‘} کا ایک معنی یہ ہے کہ ایمان لانے کی صورت میں یہ کتاب ساری دنیا میں تمھاری ناموری، شہرت اور عز و شرف کا باعث ہے، جیسا کہ دوسری جگہ رسول اللہ صلی اللہ علیہ وسلم کو مخاطب کرکے فرمایا : «{ وَ اِنَّهٗ لَذِكْرٌ لَّكَ وَ لِقَوْمِكَ }» [ الزخرف : ۴۴ ] یعنی بے شک یہ قرآن تیرے لیے اور تیری قوم کے لیے عز و شرف کا باعث ہے۔ ذکر کا ایک معنی نصیحت بھی ہے، جیسے فرمایا : «{ وَ ذَكِّرْ فَاِنَّ الذِّكْرٰى تَنْفَعُ الْمُؤْمِنِيْنَ }» [ الذاریات : ۵۵ ] ’’اور نصیحت کر، کیونکہ یقینا نصیحت ایمان والوں کو نفع دیتی ہے۔‘‘ تو آیت کا ترجمہ یہ ہو گا ’’بلاشبہ یقینا ہم نے تمھاری طرف ایسی کتاب نازل کی ہے جس میں تمھاری نصیحت کا سامان ہے۔‘‘ آیت میں ذکر کے تینوں معنی بیک وقت مراد ہو سکتے ہیں، کیونکہ ان میں کوئی باہمی تعارض نہیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {وَ كَمْ قَصَمْنَا مِنْ قَرْيَةٍ كَانَتْ ظَالِمَةً : ’’قَصْمٌ‘‘} کا معنی کسی سخت چیز کو توڑنا ہے۔ کہا جاتا ہے : {’’فُلاَنٌ قَصَمَ ظَهْرَ فُلاَنٍ ‘‘} کہ فلاں نے فلاں کی کمر توڑ دی۔ {’’اِنْقَصَمَتْ سِنُّهُ‘‘} فلاں کا دانت ٹوٹ گیا۔ {’’ كَمْ ‘‘} یہاں تکثیر کے لیے ہے، ’’کتنی ہی بستیاں‘‘ سے مراد بہت سی بستیاں ہیں، اس سے کوئی خاص بستی مراد نہیں۔ ابن عباس رضی اللہ عنھما کی طرف منسوب وہ روایت موضوع ہے جس میں ان سے نقل کیا گیا ہے کہ اس سے مراد یمن کے شہروں کے لوگ ہیں۔ [ الاستیعاب في بیان الأسباب ] آیت کے الفاظ کے مطابق بھی وہ بستیاں عام ہیں اور کوئی خاص علاقہ مراد نہیں۔ ¤ ➋ {وَ اَنْشَاْنَا بَعْدَهَا قَوْمًا اٰخَرِيْنَ : ’’ اَلإْنْشَاءُ‘‘} کا معنی نئی چیز بنانا ہے۔ {’’ بَعْدَهَا ‘‘} بعض مقامات پر {’’ مِنْ بَعْدِهَا ‘‘} ہوتا ہے، اس میں کچھ دیر بعد مراد ہوتا ہے، یہاں {’’ بَعْدَهَا ‘‘} کا مطلب یہ ہے کہ ہم ان بستیوں کی ہلاکت کے بعد ساتھ ہی نئے سرے سے اور قومیں وہاں لے آئے۔ اللہ تعالیٰ نے اس آیت اور بعد والی آیات میں اپنا ذکر جمع کے صیغے سے کیا ہے۔ مراد اس سے اپنی عظمت کا اظہار ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) { فَلَمَّاۤ اَحَسُّوْا بَاْسَنَاۤ … :} احساس کا معنی حواس سے معلوم کرنا، مثلاً دیکھنا یا سننا وغیرہ۔ {’’ يَرْكُضُوْنَ ‘‘ ’’رَكَضَ يَرْكُضُ‘‘ } (ن) کا معنی سواری کو تیز دوڑانے کے لیے ایڑ لگانا ہے، مراد تیزی سے بھاگنا ہے، یعنی جب انھوں نے ہمارے عذاب کو اپنے حواس یعنی آنکھوں یا کانوں وغیرہ سے محسوس کیا تو بہت تیزی کے ساتھ بھاگ کھڑے ہوئے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) { لَا تَرْكُضُوْا وَ ارْجِعُوْۤا اِلٰى مَاۤ اُتْرِفْتُمْ فِيْهِ …:} یعنی ان کا حال یہ ہوتا ہے کہ انھیں کہا جائے یا فرشتے ان سے کہتے ہیں کہ بھاگو نہیں، بلکہ ان جگہوں کی طرف جن میں تمھیں خوشحالی دی گئی تھی اور اپنے گھروں کی طرف واپس آؤ، تاکہ تم سے پوچھا جائے کہ ان تمام نعمتوں کی تم نے کیا قدر کی؟ ایک معنی یہ ہے کہ اپنی انھی مجلسوں میں دوبارہ واپس آؤ، تاکہ پہلے کی طرح تمھارے نوکر چاکر ہاتھ باندھ کر تم سے سوال کریں کہ سرکار کیا حکم ہے؟ تیسرا معنی یہ ہے کہ بھاگو نہیں، بلکہ اپنی وہی پنچایتیں اور کونسلیں جما کر بیٹھو، تاکہ لوگ اپنے مسائل کا حل تم سے پوچھنے کے لیے آئیں اور مانگنے والے تم سے مانگنے کے لیے آئیں، جنھیں تم فخر و ریا کے لیے دیا کرتے تھے۔ بہرحال یہ سب کچھ انھیں ڈانٹنے اور ان کا مذاق اڑانے کے لیے کہا جا رہا ہے۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) { قَالُوْا يٰوَيْلَنَاۤ … :} جب اللہ کا عذاب آ گھیرتا ہے تو بدکار سے بدکار قومیں بھی گناہوں کا اعتراف کرتے ہوئے اسی طرح واویلا مچاتی ہیں، مگر اس وقت گناہوں کے اعتراف اور توبہ کرنے کا کچھ فائدہ نہیں ہوتا۔ دیکھیے سورۂ مومن (۸۵)۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) { فَمَا زَالَتْ تِّلْكَ دَعْوٰىهُمْ … : ’’ حَصِيْدًا ‘‘ ’’حَصَدَ يَحْصُدُ‘‘} (درانتی سے کاٹنا) سے {’’فَعِيْلٌ‘‘} بمعنی مفعول ({مَحْصُوْدٌ}) ہے۔ فعیل کا وزن مذکر و مؤنث اور واحد، تثنیہ، جمع سب کے لیے ایک ہی آتا ہے، معنی کٹے ہوئے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) { وَ مَا خَلَقْنَا السَّمَآءَ وَ الْاَرْضَ … :} پچھلی آیات میں ظالم بستیوں کو برباد کرنے کا ذکر فرمایا تھا، اب اس کی حکمت بیان فرمائی کہ ایسا نہیں ہے کہ ہم نے اس زمین و آسمان کو کھیلتے ہوئے پیدا کر دیا ہے کہ لوگ جیسے چاہیں ظلم و ستم کرتے پھریں اور ان سے کوئی باز پرس نہ ہو۔ بلکہ ان کے پیدا کرنے میں ہماری بے شمار حکمتیں اور مصلحتیں ہیں اور کائنات میں ہر عمل کی جزا یا سزا کا عمل جاری ہے۔ لہٰذا اگر ان ظالموں کو ہلاک کیا گیا تو یہ عدل و انصاف اور جزا و سزا کے قانون کے عین مطابق تھا۔ تمھیں چاہیے کہ آنے والی دوسری زندگی میں جواب دہی کے لیے تیاری کرو۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { لَوْ اَرَدْنَاۤ اَنْ نَّتَّخِذَ لَهْوًا …:} یعنی بفرض محال اگر ہم اپنی دل لگی اور کھیل کے لیے کھیلنے کی کوئی چیز بناتے تو اپنے پاس بنا لیتے اور تمھیں اس کا پتا نہ چلنے دیتے، کیونکہ لہو و لعب تو نقص اور خامی کی بات ہے، اس لیے ہم اسے کسی کی نگاہ کے سامنے نہ آنے دیتے۔ تو یہ آسمان و زمین جو ہر وقت تمھارے سامنے ہیں، ہم کھیل اور دل لگی کے لیے کیسے بنا سکتے ہیں؟ یہ ساری بات بطور فرض ہے۔ اللہ تعالیٰ کس قدر رحیم و کریم ہے کہ اس نے انسان کی چھوٹی عقل کو سمجھانے اور ہر طرح سے مطمئن کرنے کے لیے اس کی ذہنی سطح کے مطابق بات کی ہے، ورنہ ممکن ہی نہیں کہ اللہ تعالیٰ اس کا ارادہ کرے، کیونکہ لفظ {’’لَوْ ‘‘} ہوتا ہی محال چیز کے بیان کے لیے ہے۔ ¤ ➋ طبری نے صحیح سند کے ساتھ مجاہد سے {’’ لَاتَّخَذْنٰهُ مِنْ لَّدُنَّا ‘‘} کا معنی نقل کیا ہے کہ ہم اسس لہو و لعب کو اپنے پاس بنا لیتے، نہ جنت اور جہنم پیدا کرتے اور نہ ہی موت اور قیامت۔ یعنی پھر زمین و آسمان، انسان، جن اوران کی جزا و سزا کے سلسلے کو پیدا کرنے کی کیا ضرورت تھی۔ دیکھیے سورۂ مومنون (۱۱۵)، سورۂ صٓ (۲۷) اور سورۂ ملک (۲)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ {بَلْ نَقْذِفُ بِالْحَقِّ …: ’’ قَذَفَ يَقْذِفُ‘‘} (ض) کا معنی کسی چیز کو سختی کے ساتھ پھینک مارنا۔ {’’ فَيَدْمَغُهٗ ‘‘ ’’ دَمَغَ يَدْمَغُ ‘‘} (ف) کسی چیز کا دماغ کو توڑنا، یہاں تک کہ اس کی وہ جھلی پھٹ جائے جس کے پھٹنے سے روح نکل جاتی ہے۔ {’’زَاهِقٌ ‘‘ ’’زُهُوْقٌ‘‘} کا معنی کسی چیز کا مکمل طور پر ختم ہو جانا ہے۔ یعنی ہم نے اس کائنات کو بے مقصد نہیں بنایا، بلکہ اس میں حق و باطل کا معرکہ جاری ہے اور اس کا نظام ہم نے اس طرح بنایا ہے کہ باطل نے جب بھی سر اٹھایا حق نے ضرب کاری لگا کر اسے نیست و نابود کر دیا۔ اسی طرح اب بھی بالآخر باطل فنا ہو جائے گا اور حق قائم و دائم رہے گا۔ ¤ ➋ {’’ فَاِذَا هُوَ زَاهِقٌ ‘‘} میں {’’إِذَا‘‘} فجائیہ یعنی اچانک کے معنی میں ہے اور{ ’’ هُوَ زَاهِقٌ ‘‘} جملہ اسمیہ ہے جو استمرار کے لیے ہے اور جس سے ظاہر ہو رہا ہے کہ باطل نہایت تیزی کے ساتھ مٹتا ہے اور اس کا مٹنا عارضی نہیں دائمی ہوتا ہے۔ (آلوسی) ¤ ➌ { وَ لَكُمُ الْوَيْلُ مِمَّا تَصِفُوْنَ :} یعنی اگر تم یہ کہو گے کہ اللہ تعالیٰ نے دنیا کا یہ سلسلہ ایک کھیل بنایا ہے اور دوبارہ زندہ ہونا، حساب کتاب اور جنت و دوزخ سب فرضی قصے کہانیاں ہیں تو تمھارے اس بیان کا نتیجہ تمھاری بربادی کی صورت میں ظاہر ہو گا، دنیا میں بھی اور آخرت میں بھی۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { وَ لَهٗ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ : ’’ مَنْ ‘‘} کا لفظ عموماً عقل والی مخلوقات کے لیے استعمال ہوتا ہے، اگرچہ یہاں زمین و آسمان کے عقلاء کو اللہ تعالیٰ کی ملکیت قرار دیا گیا ہے مگر اس میں آسمان و زمین، ان کے اندر پائے جانے والے تمام اَجرام فلکی اور دوسری تمام مخلوقات بھی شامل ہیں اور وہ سب اللہ کی ملکیت ہیں۔ کیونکہ یہ زمین آسمانوں کے اندر ہے اور ہر آسمان اپنے سے اوپر والے آسمان کے اندر ہے اور سب سے اوپر والا آسمان عرش کے اندر ہے اور اللہ سبحانہ عرش عظیم کا مالک ہے، جیسا کہ آگے آیت (۲۲) میں آ رہا ہے : «{فَسُبْحٰنَ اللّٰهِ رَبِّ الْعَرْشِ عَمَّا يَصِفُوْنَ}» تو اس سے عقلاً یہ بات ثابت ہوئی کہ وہ ہر چیز کا مالک ہے اور ملک یعنی بادشاہ بھی۔ (بقاعی) ¤ ➋ {وَ مَنْ عِنْدَهٗ لَا يَسْتَكْبِرُوْنَ عَنْ عِبَادَتِهٖ :} یعنی عرش اٹھانے والے (حاقہ : ۱۷) اور دوسرے فرشتے اور اللہ کی وہ مخلوق جسے وہی جانتا ہے۔ یعنی اتنی عظمت والے فرشتے جب ہمیشہ اللہ کی عبادت میں مصروف رہتے ہیں اور اپنے آپ کو اس سے بڑا نہیں سمجھتے تو پھر انسان کی کیا بساط ہے کہ اپنے آپ کو اس کی عبادت سے بالا تر سمجھے؟ ¤ ➌ {وَ لَا يَسْتَحْسِرُوْنَ: ’’حَسَرَ يَحْسِرُ حُسُوْرًا (ض)‘‘} تھک کر رہ جانا۔ سورۂ ملک میں ہے : «{يَنْقَلِبْ اِلَيْكَ الْبَصَرُ خَاسِئًا وَّ هُوَ حَسِيْرٌ}» [ الملک : ۴ ] ’’نظر ناکام ہو کر تیری طرف پلٹ آئے گی اور وہ تھکی ہوئی ہو گی۔‘‘ یہاں ایک سوال ہے کہ {’’يَسْتَحْسِرُوْنَ ‘‘} باب استفعال سے ہے جس میں طلب کا معنی پایا جاتا ہے، یا حروف میں اضافے کی وجہ سے معنی میں مبالغہ ہو جاتا ہے، یہاں باب استفعال لانے میں کیا نکتہ ہے؟ اہلِ علم نے اس کے مختلف جواب دیے ہیں، جن میں سے ایک یہ ہے کہ {’’ وَ لَا يَسْتَحْسِرُوْنَ أَيْ لَا يَطْلُبُوْنَ أَنْ يَّنْقَطِعُوْا عَنْ ذٰلِكَ فَأَنْتَجَ ذٰلِكَ قَوْلُهُ ’’ يُسَبِّحُوْنَ الَّيْلَ وَ  النَّهَارَ ‘‘} ’’یعنی وہ اللہ تعالیٰ کی عبادت سے تھکنا چاہتے ہی نہیں اور انھیں اس کی طلب ہی نہیں۔ جس کا نتیجہ یہ ہے کہ وہ رات دن اللہ تعالیٰ کی تسبیح کرتے ہیں، وقفہ نہیں کرتے۔‘‘ (بقاعی) اس کا سب سے اچھا جواب وہ ہے جو ابوالسعود اور آلوسی رحمھما اللہ نے دیا ہے کہ جب حرفِ نفی مبالغہ کے لفظ پر آئے تو مراد مبالغہ کی نفی نہیں ہوتی بلکہ نفی میں مبالغہ ہوتا ہے، جیسا کہ {’’ وَ مَا رَبُّكَ بِظَلَّامٍ لِّلْعَبِيْدِ ‘‘} کا معنی یہ نہیں ہو گا کہ ’’تیرا رب بندوں پر بہت زیادہ ظلم کرنے والا نہیں‘‘ بلکہ یہ ہو گا کہ ’’تیرا رب بندوں پر کچھ بھی ظلم کرنے والا نہیں۔‘‘ دیکھیے سورۂ آل عمران (۱۸۲) اور انفال (۵۱) چنانچہ {’’ وَ لَا يَسْتَحْسِرُوْنَ‘‘} کا معنی ہوگا ’’اور وہ ذرا برابر نہیں تھکتے۔‘‘ {’’ لَا يَسْتَكْبِرُوْنَ‘‘} کی بھی یہی توجیہیں ہیں۔ اس کی ہم معنی آیات کے لیے دیکھیے سورۂ نحل (۴۹، ۵۰) اور نساء (۱۷۲)۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {يُسَبِّحُوْنَ الَّيْلَ وَ النَّهَارَ لَا يَفْتُرُوْنَ:’’ اَلْفُتُوْرُ ‘‘} کا معنی کسی کام سے رک جانا ہے، جیسا کہ فرمایا : «{ قَدْ جَآءَكُمْ رَسُوْلُنَا يُبَيِّنُ لَكُمْ عَلٰى فَتْرَةٍ مِّنَ الرُّسُلِ }» [ المائدۃ : ۱۹ ] ’’بے شک تمھارے پاس ہمارا رسول آیا ہے، جو تمھارے لیے کھول کر بیان کرتا ہے، رسولوں کے ایک وقفے کے بعد۔‘‘ یعنی فرشتے رات دن اللہ کی تسبیح کرتے ہیں، کبھی نہیں رکتے، وقفہ نہیں کرتے۔ یہاں ایک سوال ہے جو عبد اللہ بن حارث بن نوفل نے کعب احبار سے کیا کہ آپ بتائیں کہ اللہ تعالیٰ نے فرشتوں کے متعلق فرمایا : «{ يُسَبِّحُوْنَ الَّيْلَ وَ النَّهَارَ لَا يَفْتُرُوْنَ }» تو کیا انھیں آپس کی بات چیت، پیغمبروں کو وحی پہنچانا اور دوسرے کام تسبیح میں رکاوٹ نہیں بنتے؟ انھوں نے فرمایا : ’’بیٹا! اللہ تعالیٰ نے ان کے لیے تسبیح ایسے ہی کر دی ہے جیسے تمھارے لیے سانس لینا کر دیا ہے۔ کیا ایسا نہیں ہے کہ تم بات کرتے ہوئے سانس لیتے جاتے ہو اور چلتے ہوئے سانس لیتے رہتے ہو؟‘‘ [ طبری من طرق یقوي أحدھما الآخر، حکمت بن بشیر ] دن رات بغیر وقفے کے تسبیح سے مراد مبالغہ بھی ہو سکتا ہے کہ وہ بہت زیادہ تسبیح کرتے ہیں، جیسے کہتے ہیں کہ فلاں تمھاری ہر وقت تعریف کرتا ہے، یا میں دن رات تمھیں یاد کرتا ہوں وغیرہ۔ مفسر آلوسی نے اس توجیہ کی تعریف کی ہے۔ (روح المعانی) یا جس طرح ام المومنین عائشہ رضی اللہ عنھا نے رسول اللہ صلی اللہ علیہ وسلم کے متعلق فرمایا : [ كَانَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ اللّٰهَ عَلٰی كُلِّ أَحْيَانِهِ ] [ مسلم، الحیض، باب ذکر اللہ في حال الجنابۃ وغیرھا : ۳۷۳ ]’’آپ صلی اللہ علیہ وسلم اپنے تمام اوقات میں اللہ کا ذکر کرتے تھے۔‘‘ ظاہر ہے آپ اپنی انسانی ضروریات، دعوت و تبلیغ اور جہاد کے لیے بات بھی کرتے تھے، کھاتے پیتے اور سوتے بھی تھے، اس کے باوجود اللہ کی یاد سے دل غافل نہیں ہوتا تھا۔ یہ توجیہ کعب احبار کی توجیہ سے ملتی جلتی ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { اَمِ اتَّخَذُوْۤا اٰلِهَةً …:’’ اَمْ ‘‘} کسی جملہ استفہامیہ کے بعد آتا ہے، جو ہر مقام پر سیاق و سباق سے سمجھ میں آ رہا ہوتا ہے۔ یہاں پہلی آیات کو مدنظر رکھتے ہوئے مفسر بقاعی رحمہ اللہ نے فرمایا : ’’کیا یہ لوگ جان چکے ہیں کہ آسمانوں اور زمین کی ہر ہستی اللہ تعالیٰ کی ملکیت ہے اور اس میں اسی کا امر نافذ ہے اور یہ جان کر اپنی گمراہی سے باز آ چکے ہیں یا (جاننے کے باوجود اپنی ہٹ پر قائم ہیں اور) انھوں نے زمین سے کچھ معبود بنا لیے ہیں جو اکیلے زندگی کی روح پھونک سکتے ہیں؟ اگر ایسا نہیں اور یقینا نہیں تو پھر یہ ایسے بے چاروں کو معبود کیوں مان رہے ہیں؟‘‘ ¤ ➋ {’’ اٰلِهَةً مِّنَ الْاَرْضِ ‘‘} کا مطلب یہ ہے کہ ان کے بنائے ہوئے معبود سب زمین سے تعلق رکھتے ہیں، بت ہوں یا قبریں، درخت ہوں یا دریا، جانور ہوں یا انسان یاجن، مردہ داتا و دستگیر ہوں یا زندہ، سب اسی مٹی سے ہیں جو قدموں تلے روندی جاتی ہے۔ ان کی کوڑھ مغزی دیکھو کہ انھوں نے کس قدر بے وقعت ہستیوں کو اس رب کے ہوتے ہوئے حاجت روا اور مشکل کُشا بنا لیا جو زمین ہی کا نہیں عرش کا بھی رب ہے۔ اگلی آیت میں اسی مناسبت سے فرمایا : «{ فَسُبْحٰنَ اللّٰهِ رَبِّ الْعَرْشِ عَمَّا يَصِفُوْنَ }» ’’سو پاک ہے اللہ جو عرش کا رب ہے، ان چیزوں سے جو وہ بیان کرتے ہیں۔‘‘ جو زمین و آسمان دونوں کا مالک ہے اور دونوں میں اسی کی عبادت ہوتی ہے۔ دیکھیے سورۂ زخرف (۸۴، ۸۵)۔ ¤ ➌ {هُمْ يُنْشِرُوْنَ:} ما وردی نے فرمایا : ’’اس میں دو قول ہیں، ایک یہ کہ اس کا معنی {’’يَخْلُقُوْنَ‘‘} ہے، یعنی وہ پیدا کرتے ہیں، یہ قطرب کا قول ہے۔ دوسرا یہ کہ اس کا معنی {’’ يُحْيُوْنَ ‘‘} ہے، یعنی وہ دوبارہ زندہ کریں گے، یہ مجاہد کا قول ہے۔ حقیقت یہ ہے کہ یہ لفظ دونوں معنوں میں آتا ہے۔ پہلے معنی کی تائید سورۂ روم کی آیت (۲۰) سے ہوتی ہے اور دوسرے معنی کی سورۂ عبس کی آیت (۱۹) سے۔ مطلب یہ ہے کہ کیا انھوں نے کوئی ایسے معبود بنائے ہیں جو پہلی دفعہ پیدا کرتے ہیں یا دوبارہ زندہ کریں گے؟ یہ شان تو صرف اللہ تعالیٰ کی ہے، فرمایا : «{ وَ هُوَ الَّذِيْ يَبْدَؤُا الْخَلْقَ ثُمَّ يُعِيْدُهٗ وَ هُوَ اَهْوَنُ عَلَيْهِ }» [ الروم : ۲۷] ’’اور وہی ہے جو خلق کو پہلی بار پیدا کرتا ہے، پھر اسے دوبارہ پیدا کرے گا اور وہ اسے زیادہ آسان ہے۔‘‘ اس کے سوا کوئی نہ پیدا کر سکتا ہے اور نہ دوبارہ زندہ کر سکتا ہے۔ دیکھیے سورۂ فرقان (۳)۔ ¤ ➍ {هُمْ يُنْشِرُوْنَ :} یعنی کیا ان کے کوئی ایسے معبود ہیں کہ وہی زندگی بخشتے ہیں اور دوبارہ بھی وہی زندہ کریں گے؟ یہ ان کے معبودوں سے مذاق ہے کہ ذرا ان کی اوقات تو دیکھو کہ اللہ تعالیٰ کے مقابلے میں اکیلے ہی یہ سب کچھ کر رہے ہیں۔ ¤ ➎ ابن جزی رحمہ اللہ نے {’’ مِنَ الْاَرْضِ ‘‘} کو {’’ يُنْشِرُوْنَ ‘‘} کے متعلق کیا ہے، اس صورت میں معنی یہ ہو گا کہ یا انھوں نے کوئی ایسے معبود بنا رکھے ہیں جو (لوگوں کو) زمین سے دوبارہ زندہ کریں گے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) {لَوْ كَانَ فِيْهِمَاۤ اٰلِهَةٌ اِلَّا اللّٰهُ … :} یعنی ان لوگوں نے تو زمین سے لے کر کئی معبود بنا رکھے ہیں، جب کہ زمین اور آسمان دونوں میں ایک اللہ کے سوا کوئی معبود نہیں، فرمایا : «{ وَ هُوَ الَّذِيْ فِي السَّمَآءِ اِلٰهٌ وَّ فِي الْاَرْضِ اِلٰهٌ وَ هُوَ  الْحَكِيْمُ الْعَلِيْمُ }» [ الزخرف : ۸۴ ] ’’اور وہی ہے جو آسمانوں میں معبود ہے اور زمین میں بھی معبود ہے اور وہی کمال حکمت والا، سب کچھ جاننے والا ہے۔‘‘ کیونکہ معبود برحق تو وہ ہے جو پوری قدرت اور مکمل اختیار رکھنے واالا ہو اور کسی معاملے میں عاجز نہ ہو۔ اب اگر زمین و آسمان میں اللہ تعالیٰ کے سوا اور بھی قادر و مختار ہوتے تو کائنات کا یہ سلسلہ کبھی کا درہم برہم ہو چکا ہوتا۔ کیونکہ ان سب کی ہمیشہ کشمکش رہتی اور کوئی چیز اپنی مرتب شکل میں نہ بن سکتی اور نہ چل سکتی، جیسا کہ فرمایا : «{ مَا اتَّخَذَ اللّٰهُ مِنْ وَّلَدٍ وَّ مَا كَانَ مَعَهٗ مِنْ اِلٰهٍ اِذًا لَّذَهَبَ كُلُّ اِلٰهٍۭ بِمَا خَلَقَ وَ لَعَلَا بَعْضُهُمْ عَلٰى بَعْضٍ سُبْحٰنَ اللّٰهِ عَمَّا يَصِفُوْنَ }» [ المؤمنون : ۹۱ ] ’’نہ اللہ نے (اپنی) کوئی اولاد بنائی اور نہ کبھی اس کے ساتھ کوئی معبود تھا، اس وقت ضرور ہر معبود، جو کچھ اس نے پیدا کیا تھا، اسے لے کر چل دیتا اور یقینا ان میں سے بعض بعض پر چڑھائی کر دیتا۔ پاک ہے اللہ اس سے جو وہ بیان کرتے ہیں۔‘‘ اسی طرح ان میں سے ہر ایک اپنی قوت و اختیار منوانے کے لیے پوری کائنات کا اختیار حاصل کرنے کی کوشش کرتا اور عرش پر قبضے کی جدو جہد کرتا، نتیجہ پوری کائنات کی تباہی ہوتا، فرمایا : «{ قُلْ لَّوْ كَانَ مَعَهٗۤ اٰلِهَةٌ كَمَا يَقُوْلُوْنَ اِذًا لَّابْتَغَوْا اِلٰى ذِي الْعَرْشِ سَبِيْلًا }» [ ببني إسرائیل : ۴۲ ] ’’کہہ دے اگر اس کے ساتھ کچھ اور معبود ہوتے، جیسا کہ یہ کہتے ہیں تو اس وقت وہ عرش والے کی طرف کوئی راستہ ضرور ڈھونڈتے۔‘‘ ¤ خلاصہ یہ کہ زمین و آسمان میں کسی فساد کا نہ ہونا اور پوری کائنات میں زبردست ترتیب اور ہم آہنگی کا ہونا اس بات کی دلیل ہے کہ ان کا مالک اور انھیں چلانے والا ایک ہی ہے۔ یہ دلیل بہت زبردست، نہایت ہی سادہ اور آسانی سے سمجھ میں آنے والی ہے۔ ایک چھوٹے سے گھر کا نظام کبھی درست نہیں چل سکتا اگر اس کا ذمہ دار ایک نہ ہو اور نہ ایک مملکت میں دو فرماں روا رہ سکتے ہیں، تو اتنی بڑی کائنات کا نظام دو فرماں رواؤں کی صورت میں کیسے چل سکتا ہے؟ علمائے اسلام نے اس دلیل کی کئی طرح سے تشریح فرمائی ہے، میں ان میں سے صرف دو تشریحات نقل کرتا ہوں۔ ایک یہ کہ اگر ہم دو معبود فرض کریں تو کسی چیز کو حرکت دینے یا ساکن رکھنے میں اگر دونوں میں اختلاف ہو جائے تو یہ ناممکن ہے کہ دونوں کا ارادہ پورا ہو جائے اور یہ بھی ناممکن ہے کہ کسی کا ارادہ بھی پورا نہ ہو (کیونکہ پھر وہ قادر و مختار ہی کیا ہوئے؟) اگر صرف ایک کا ارادہ پورا ہو تو دوسرا عاجز ٹھہرا، جو کسی صورت معبود برحق نہیں ہو سکتا اور دونوں کے اختلاف کا ممکن ہونا اس کے واقع ہونے کے قائم مقام ہے۔ دوسری تشریح یہ ہے کہ عدم سے وجود میں آنے والا ہر جز ناممکن ہے کہ دو قدرتوں کے نتیجے میں پیدا ہو۔ جب وہ دونوں میں سے ایک کی قدرت سے وجود میں آیا، تو دوسرا زائد اور بے کار ٹھہرا، جس کا اس جز میں کوئی دخل نہیں۔ اسی طرح کائنات کے ہر جز اور ہر ذرے میں غور کرتے جائیں، نتیجہ صرف ایک قادر و مختار نکلے گا۔ [ ابن عطیہ فی المحرّر الوجیز ]"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) { لَا يُسْـَٔلُ عَمَّا يَفْعَلُ … :} اللہ تعالیٰ کی اس صفت کے دو مطلب ہیں، ایک یہ کہ ہر چیز کا مالک اور سلطان وہ خود ہے، کسی کی کیا جرأت کہ اس کے کسی کام کے متعلق پوچھے کہ ایسا کیوں کیا؟ کیونکہ اپنی ملکیت میں وہ جو چاہے کرے۔ اگر وہ زمین و آسمان کی تمام مخلوق کو عذاب دے تو بھی عین عدل ہو گا، کیونکہ وہ مالک ہے اور اپنی چیز سے جو چاہے کرے۔ جس طرح انسان اپنی خریدی ہوئی ایک اینٹ کو مکان کی پیشانی پر لگا دیتا ہے، دوسری کو چولھے یا بھٹی میں لگا دیتا ہے اور کوئی اسے ظالم نہیں کہتا، حالانکہ وہ اینٹ کا خالق بھی نہیں، صرف عارضی مالک ہے اور اگر اللہ تعالیٰ مخلوق پر رحم فرمائے تو اس کا فضل ہے۔ دوسرا یہ کہ اس کا ہر کام اتنا محکم اور درست ہے کہ اس میں کوئی خامی یا خلل نہیں، اس نے جو کیا اور جو فرمایا سب نہایت عمدہ اور کمال حسن و خوبی والا ہے۔ اس لیے اس کے کسی کام کے متعلق سوال یا اعتراض کی گنجائش نہیں۔ مفسر بقاعی نے ایک قدیم فلسفی سے نقل کیا ہے کہ کسی نے اس سے پوچھا، جب اللہ تعالیٰ ہمیشہ سے ہے اور اس کے سوا کوئی چیز نہ تھی تو اس نے یہ جہان کیوں بنایا؟ اس نے جواب دیا کہ اس سے ’’کیوں‘‘ کا سوال ہو ہی نہیں سکتا، کیونکہ کوئی اس سے اوپر ہو تو یہ سوال کرے۔ اس کے برعکس لوگوں سے دونوں وجہوں سے سوال ہو سکتا ہے اور ہو گا، کیونکہ وہ مالک نہیں غلام ہیں اور مالک غلام سے پوچھ سکتا ہے اور پوچھتا ہے کہ اس نے کوئی کام کیوں کیا اور اس لیے کہ ان کے ہر کام میں خامی اور خلل موجود ہے۔ قیامت کے دن سوال کا ذکر کئی آیات میں ہے، دیکھیے سورۂ حجر (۹۲) اور صافات (۲۴)۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { اَمِ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اٰلِهَةً:} یہ بات شرک کے نہایت قبیح اور باطل ہونے کے بیان کے لیے پھر دہرائی۔ ¤ ➋ { قُلْ هَاتُوْا بُرْهَانَكُمْ:} اس سے پہلے شرک کے باطل ہونے کی دو عقلی دلیلیں بیان فرمائیں، ایک {’’ لَوْ كَانَ فِيْهِمَاۤ اٰلِهَةٌ ‘‘} اور دوسری {’’ لَا يُسْـَٔلُ عَمَّا يَفْعَلُ ‘‘} ، اس آیت میں اس کی دو نقلی دلیلیں بیان فرمائیں اور کفار سے مطالبہ فرمایا کہ تم بھی اپنی کوئی عقلی یا نقلی دلیل پیش کرو۔ ظاہر ہے کفار کے پاس شرک کی کوئی عقلی دلیل ہے نہ نقلی، ان کا سرمایہ محض وہم و گمان اور نفس کی خواہشیں ہیں (سورۂ نجم : ۲۳ ، ۲۸۔ یونس : ۶۶) یا آبا و اجداد کی تقلید (زخرف : ۲۱ تا ۲۴) اور دونوں میں سے کوئی بھی دلیل یا برہان نہیں ہے۔ ¤ ➌ { هٰذَا ذِكْرُ مَنْ مَّعِيَ وَ ذِكْرُ مَنْ قَبْلِيْ:} یہ توحید کے حق ہونے اور شرک کے باطل ہونے کی دو نقلی دلیلیں ہیں۔ {’’ مَنْ مَّعِيَ‘‘} (جو میرے ساتھ ہیں) سے رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے والے مسلم مراد ہیں اور ان کے ذکر سے مراد قرآن کریم ہے جو اس امت کے لیے نصیحت ہے، جیسا کہ فرمایا : «{ لَقَدْ اَنْزَلْنَاۤ اِلَيْكُمْ كِتٰبًا فِيْهِ ذِكْرُكُمْ اَفَلَا تَعْقِلُوْننَ }» [الأنبیاء : ۱۰ ] ’’بلاشبہ یقینا ہم نے تمھاری طرف ایسی کتاب نازل کی ہے جس میں تمھارا ذکر (تمھاری نصیحت) ہے، تو کیا تم نہیں سمجھتے؟‘‘ {’’ وَ ذِكْرُ مَنْ قَبْلِيْ ‘‘} (اور مجھ سے پہلے لوگوں کی نصیحت) سے مراد پہلی امتوں پر نازل ہونے والی کتابیں تورات، انجیل، زبور اور صحف ابراہیم وغیرہ ہیں۔ مطلب اس کا یہ ہے کہ یہ قرآن مجید اور پہلی کتابیں تمھاری دسترس میں ہیں، کسی میں شرک کی کوئی دلیل ہے تو دکھا دو۔ پہلے پچھلے تمام اہل علم کی شہادت یہ ہے کہ اللہ کے سوا کوئی معبود نہیں، فرمایا : «{ شَهِدَ اللّٰهُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا هُوَ وَ الْمَلٰٓىِٕكَةُ وَ اُولُوا الْعِلْمِ قَآىِٕمًۢا بِالْقِسْطِ لَاۤ اِلٰهَ اِلَّا هُوَ الْعَزِيْزُ الْحَكِيْمُ }» [ آل عمران : ۱۸ ] ’’اللہ نے اس بات کی شہادت دی کہ بے شک حقیقت یہ ہے کہ اس کے سوا کوئی معبود نہیں اور فرشتوں نے اور علم والوں نے بھی، اس حال میں کہ وہ انصاف پر قائم ہے۔ اس کے سوا کوئی معبود نہیں، سب پر غالب ہے، کمال حکمت والا ہے۔‘‘ قرآن مجید میں کفار سے شرک کی نقلی دلیل پیش کرنے کا مطالبہ کئی آیات میں آیا ہے۔ دیکھیے سورۂ احقاف (۳) اور زخرف (۴۵)۔ ¤ ➍ {بَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَ الْحَقَّ :} لفظ {’’ بَلْ ‘‘} کا مطلب یہ ہے کہ ان لوگوں کے سامنے عقلی یا نقلی دلیلیں پیش کرکے یہ امید نہ رکھیں کہ وہ قبول کر لیں گے، کیونکہ یہ جاہل ہیں اور انھیں حق کا علم ہی نہیں۔ {’’ وَالنَّاسُ أَعْدَاءٌ لِمَا جَهِلُوْا ‘‘} (لوگ جس چیز کا علم نہ رکھتے ہوں اس کے دشمن ہوتے ہیں)۔ {’’ اَكْثَرُهُمْ ‘‘} سے معلوم ہوا کہ وہ سب ایسے نہیں بلکہ ان میں سے کچھ لوگ ایسے بھی ہیں جو حق جانتے ہیں مگر عناد کی وجہ سے تسلیم نہیں کرتے اور کچھ ایسے لوگوں کی طرف بھی اشارہ ہے جن کی طبیعتیں حق جان کر اسے قبول کرنے کے لیے آمادہ ہو چکی ہوتی ہیں، جیسے عمر بن خطاب اور ان جیسے دیگر اصحاب(رضی اللہ عنہم ) تھے اور ایسے لوگوں کی امید پر ہی داعیان حق کا حوصلہ قائم رہتا ہے۔ ¤ ➎ { فَهُمْ مُّعْرِضُوْنَ:} اس میں ان کے جہل کا سبب بیان فرمایا کہ وہ حق معلوم کرنے کی طرف توجہ ہی نہیں کرتے اور نہ کسی دلیل پر غور کرتے ہیں، جیسے فرمایا : «{ وَ كَاَيِّنْ مِّنْ اٰيَةٍ فِي السَّمٰوٰتِ وَ الْاَرْضِ يَمُرُّوْنَ عَلَيْهَا وَ هُمْ عَنْهَا مُعْرِضُوْنَ }» [ یوسف : ۱۰۵ ] ’’اور آسمانوں اور زمین میں کتنی ہی نشانیاں ہیں جن پر سے گزرتے ہیں اور وہ ان سے بے دھیان ہوتے ہیں۔‘‘"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ {وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ …:} پچھلی آیت میں {’’ هٰذَا ذِكْرُ مَنْ مَّعِيَ وَ ذِكْرُ مَنْ قَبْلِيْ ‘‘} کہہ کر جو بات اختصار کے ساتھ کہی گئی تھی اب وہ واضح الفاظ میں تاکید کے ساتھ دہرائی گئی ہے اور جس بات کا حوالہ صرف چند کتابوں کے ساتھ خاص تھا اب تمام رسولوں کے ذکر کے ساتھ اسے عام کرکے بیان کیا گیا ہے۔ چنانچہ فرمایا کہ آپ سے پہلے جو بھی رسول ہم نے بھیجا، خواہ اسے کتاب دی یا نہ دی، اسے یہی وحی کرتے رہے کہ میرے سوا کوئی عبادت کے لائق نہیں، سو میری عبادت کرو۔ مزید دیکھیے سورۂ نحل (۳۶) معلوم ہوا تمام رسول توحید الوہیت کی دعوت دینے کے لیے مبعوث کیے گئے تھے کہ عبادت صرف اللہ کی کرو اور اسی سے دعا اور فریاد کرو، کیونکہ توحید ربوبیت کے تو اکثر کفار بھی قائل تھے، یعنی وہ اللہ تعالیٰ کو خالق، مالک اور رازق مانتے تھے، مگر پکارتے وقت غیر اللہ کو بھی پکارتے اور انھیں نفع نقصان کا مالک سمجھتے تھے، یا یہ عقیدہ رکھتے تھے کہ وہ اپنی بات اللہ تعالیٰ سے منوا سکتے ہیں اور ہماری حاجتیں پوری کروا سکتے ہیں۔ دیکھیے سورۂ یونس (۱۸) اور سورۂ زمر (۳)۔ ¤ ➋ اس آیت میں اللہ تعالیٰ نے اپنا ذکر پہلے اپنی صفات کے تعدد کی بنا پر جمع متکلم کے ساتھ کیا ہے، مراد اپنی عظمت کا اظہار ہے، پھر جب توحید کا ذکر آیا تو اپنا ذکر واحد متکلم کے ساتھ فرمایا کہ {’’ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ ‘‘} اس میں {’’ اَنَا ‘‘} (میں) بھی واحد ہے اور {’’ فَاعْبُدُوْنِ ‘‘} (جو اصل میں {’’ فَاعْبُدُوْنِيْ ‘‘} تھا) کی یائے متکلم بھی واحد ہے، یہاں جمع کا صیغہ استعمال نہیں فرمایا، تاکہ شبہ بھی پیدا نہ ہو کہ معبود ایک سے زیادہ ہیں۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊{ وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا … :} عقلی اور نقلی دلیلوں سے شرک کی تردید کے بعد اب ان لوگوں کا رد کیا جا رہا ہے جو اللہ تعالیٰ کے صاحبِ اولاد ہونے کے قائل تھے۔ عرب کے بعض مشرکین کا عقیدہ تھا کہ فرشتے اللہ کی بیٹیاں ہیں۔ بعض یہود کا کہنا تھا کہ (نعوذ باللہ) جنات اللہ تعالیٰ کے سسرال ہیں، جن سے فرشتے پیدا ہوتے ہیں، اسی طرح یہود نے عزیر علیہ السلام کو اللہ تعالیٰ کا بیٹا بتایا۔ نصاریٰ نے مسیح علیہ السلام کو اور بعض مسلمان کہلانے والوں نے نبی کریم صلی اللہ علیہ وسلم کو اللہ تعالیٰ کے ذاتی نور کا ٹکڑا قرار دیا اور بعض نے کہا: ¤ خدا کے نور سے پیدا ہوئے ہیں پانچوں تن ¤ محمد است، علی، فاطمہ، حسین و حسن ¤ چونکہ یہ شرک کی بدترین صورت اور اللہ تعالیٰ کی بہت بڑی گستاخی تھی (دیکھیے مریم : ۸۸ تا ۹۰۔ بقرہ : ۱۱۶۔ نساء : ۱۷۱) اس لیے اللہ تعالیٰ نے کئی طرح سے اس کا رد فرمایا۔ ¤ ➋ سب سے پہلے یہ کہہ کر رد فرمایا کہ {’’ وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا ‘‘} (اور انھوں نے کہا رحمان نے کوئی اولاد بنا رکھی ہے) یعنی باپ اور اولاد ایک جنس ہوتے ہیں، اب کہاں رحمان کہ جس کی کمال رحمت سے یہ کائنات وجود میں آئی اور مسلسل چل رہی ہے اور جس کے سوا ’’رحمان‘‘ نام کا مصداق تم بھی کسی کو نہیں سمجھتے۔ اگر اس کی اولاد مانو تو والد اور اولاد کے ایک جنس ہونے کی وجہ سے فرشتوں کو اور عزیر و مسیح علیھما السلام کو اور ایک ہی نور سے ہونے کی وجہ سے نبی کریم صلی اللہ علیہ وسلم اور پنجتن کو اسم رحمان کا مصداق ماننا پڑے گا۔ خود ہی سوچ لو کیا یہ رحمان تھے؟ ¤ ➌ پھر {’’ سُبْحٰنَهٗ ‘‘} کہہ کر رد فرمایا، یعنی جن کمزوریوں کی وجہ سے اولاد کی ضرورت ہوتی ہے وہ ان سے پاک ہے۔ انسان کو اولاد کی ضرورت اپنی کمزوریوں کی وجہ سے ہوتی ہے، تاکہ وہ مشکل میں اس کی مدد کرے، بڑھاپے میں اس کا سہارا (عصائے پیری) بنے اور مرنے کے بعد اس کی جانشین بنے۔ پھر اولاد کے لیے بیوی کا ہونا لازم ہے، انسان اپنی خواہشِ نفس کی وجہ سے بیوی کا محتاج ہوتا ہے۔ دیکھیے سورۂ انعام (۱۰۱) رحمان ان تمام کمزوریوں سے پاک ہے، اگر اس میں یہ کمزوریاں ہوں تو وہ رحمان نہیں ہو گا، بلکہ خود رحم کے قابل ہو گا، جس طرح تمام انسان، جن، فرشتے اور تمام مخلوقات ہیں۔ پھر وہ نہ رحمان ہو گا اور نہ تمام عیوب اور کمزوریوں سے پاک۔ [ سُبْحَانَہُ وَ تَعَالٰی عَمَّا یُشْرِکُوْنَ ] ¤ ➍ پھر {’’ بَلْ عِبَادٌ ‘‘} کہہ کر رد فرمایا، یعنی جنھیں یہ لوگ اولاد کہہ رہے ہیں وہ بندے (غلام) ہیں۔ غلام اپنے مالک کی اولاد نہیں ہوتا اور اولاد اپنے باپ کی غلام نہیں ہوتی۔ بندگی اور ولدیت جمع نہیں ہو سکتیں۔ اہلِ علم نے اس آیت سے استدلال فرمایا کہ اگر کسی کا بیٹا غلامی کی حالت میں اس کی ملکیت میں آئے تو آزاد ہو جائے گا، کیونکہ ولدیت اور عبدیت جمع نہیں ہو سکتیں۔ ¤ ➎ { ’’ مُكْرَمُوْنَ ‘‘ } کفار نے ان ہستیوں کی عظمت شان کی وجہ سے انھیں اللہ تعالیٰ کی اولاد قرار دیا تھا۔ اللہ تعالیٰ نے ان کے اس شبہے کو یہ کہہ کر دور فرمایا کہ ان ہستیوں کی تمام عظمت و رفعت صرف اس لیے ہے کہ انھیں عزت عطا کی گئی ہے۔ اس میں ان کا اپنا کمال کچھ نہیں، جب کہ والد اور اولاد اوصاف میں یکساں اور برابر کا جوڑ ہوتے ہیں۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ {لَا يَسْبِقُوْنَهٗ بِالْقَوْلِ :} یعنی ان کی بندگی اور فرماں برداری کا یہ حال ہے کہ اس کی اجازت کے بغیر بات تک نہیں کرتے۔ ¤ ➋ { وَ هُمْ بِاَمْرِهٖ يَعْمَلُوْنَ : ’’ بِاَمْرِهٖ ‘‘} کو پہلے لانے سے دو باتیں واضح ہوئیں، ایک یہ کہ وہ جو کرتے ہیں اس کے حکم سے کرتے ہیں، اس کے حکم کے بغیر نہیں کرتے۔ دوسری یہ کہ وہ ہر کام صرف اس کے حکم سے کرتے ہیں، کسی اور کے حکم سے نہیں۔ غور کرو، بندگی اور غلامی کی انتہا ہے کہ مولا کی مرضی کے بغیر نہ بولتے ہیں نہ کچھ کرتے ہیں، بھلا اولاد بھی اس طرح ہوتی ہے؟ اس آیت میں بھی اللہ تعالیٰ سے اولاد کی نفی فرمائی۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَ مَا خَلْفَهُمْ:} یعنی جو کام وہ کر چکے یا جو آئندہ کریں گے وہ ان سب کو جانتا ہے۔ اس میں ان کے اس قدر اطاعت گزار اور فرماں بردار ہونے کی وجہ بیان فرمائی ہے، یعنی وہ جانتے ہیں کہ اللہ تعالیٰ ہماری پہلی، پچھلی، ظاہر اور پوشیدہ ہر بات جانتا ہے، اس لیے وہ اس کے کسی حکم کی خلاف ورزی نہیں کرتے۔ ¤ ➋ {وَ لَا يَشْفَعُوْنَ اِلَّا لِمَنِ ارْتَضٰى :} یعنی وہ اسی کے حق میں سفارش کرتے ہیں جسے وہ پسند کرے اور جس کے حق میں سفارش کو پسند کرے اور اس کی اجازت دے۔ دیکھیے سورۂ بقرہ (۲۵۵) اور سبا (۲۳) مراد اس سے اہل ایمان اور اہل توحید ہیں، کیونکہ کافر و مشرک نہ اللہ کو پسند ہیں اور نہ اسے ان کے حق میں سفارش پسند ہے۔ یہ سفارش دنیا میں بھی ہے، جیسا کہ فرشتے اہل ایمان کے حق میں دعا اور استغفار کرتے ہیں (دیکھیے سورۂ مومن : ۷ تا ۹) اور انبیاء و رسل بھی ان کے حق میں دعا کیا کرتے تھے۔ آخرت میں بھی فرشتے اور انبیاء سفارش کریں گے۔ جابر بن عبد اللہ رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ شَفَاعَتِيْ لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِيْ ] [ مستدرک حاکم : ۱؍۶۹، ح : ۲۲۸، و صححہ الذھبی ] ’’میری شفاعت میری امت کے کبیرہ گناہوں والے لوگوں کے لیے ہو گی۔‘‘ اس میں بھی اولاد کی نفی ہے، کیونکہ اولاد والد کی مرضی کے خلاف بھی سفارش کر سکتی ہے۔ ¤ ➌ { وَ هُمْ مِّنْ خَشْيَتِهٖ مُشْفِقُوْنَ:} اس میں فرشتوں اور رسولوں کی اللہ تعالیٰ کے لیے انتہائی تعظیم کا ذکر فرمایا کہ وہ اس کے خوف کی وجہ سے ہمیشہ ڈرتے رہتے ہیں۔ یہ بھی اللہ کی اولاد نہ ہونے کی دلیل ہے، کیونکہ والد اور اولاد کا یہ حال نہیں ہوتا۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { وَ مَنْ يَّقُلْ مِنْهُمْ اِنِّيْۤ اِلٰهٌ …:} یعنی بالفرض اگر ان فرشتوں یا انبیاء میں سے کوئی یہ کہے کہ اللہ کو چھوڑ کر میری بندگی کرو، تو ہم اسے اس کی جزا جہنم دیں گے۔ فرشتوں اور انبیاء سے یہ بات کبھی سرزد نہیں ہو سکتی۔ یہ ایسے ہی ہے جیسے رسول اللہ صلی اللہ علیہ وسلم اور تمام انبیاء کو شرک کرنے کی صورت میں تمام اعمال ضائع ہونے کی وعید سنائی ہے، حالانکہ انھوں نے شرک کرنا ہی نہیں تھا۔ دیکھیے سورۂ انعام (۸۳ تا ۸۸) اور زمر (۶۵)۔ ¤ ➋ { كَذٰلِكَ نَجْزِي الظّٰلِمِيْنَ:} اس سے بڑا ظلم کیا ہو گا کہ ہر لحاظ سے ناقص اور فقیر مخلوق اللہ تعالیٰ کے مقابلے میں رب اور معبود ہونے کا دعویٰ کرے۔ حقیقت یہ ہے کہ شرک سے بڑا ظلم اور بے انصافی کوئی نہیں (لقمان : ۱۳) اور اسی لیے آخرت میں اس کی معافی کی کوئی صورت نہیں۔ دیکھیے سورۂ نساء (۴۸، ۱۱۶) اور مائدہ (۷۲)۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ {اَوَ لَمْ يَرَ الَّذِيْنَ كَفَرُوْۤا … : ’’ رَتْقًا ‘‘} کا معنی دو یا کئی چیزوں کا آپس میں سختی سے جڑا اور چپکا ہوا ہونا ہے، خواہ وہ فطری ہو (جیسے پتھر) یا کسی کے بنانے سے۔ (راغب) یہ مصدر بمعنی اسم فاعل برائے مبالغہ ہے، یعنی بالکل بند۔ {’’ فَتْقٌ ‘‘} کا معنی ایسی جڑی ہوئی چیزوں کو الگ الگ کرنا ہے۔ {’’ اَوَ لَمْ يَرَ ‘‘} کا معنی ہے ’’اور کیا دیکھا نہیں‘‘ اور جہاں دیکھی جانے والی چیز نہ ہو وہاں معنی ہے ’’اور کیا جانا نہیں۔‘‘ (دیکھیے سورۂ فیل) اس آیت کے دو معنی ہیں اور دونوں درست ہیں۔ طبری نے حسن سند کے ساتھ ابن عباس رضی اللہ عنھما سے نقل کیا ہے : [ كَانَتَا مُلْتَزِقَتَيْنِ ] ’’سارے آسمان اور زمین آپس میں سختی سے ملے ہوئے تھے۔‘‘ یعنی کیا یہ لوگ جو اللہ تعالیٰ کی توحید کا انکار کر رہے ہیں اور اس کے ساتھ بے بس ہستیوں کو شریک بنا رہے ہیں، انھیں معلوم نہیں کہ سارے آسمان اور زمین ایک ٹھوس تودہ تھے، پھر اللہ تعالیٰ نے اپنی بے پناہ قوت اور کمالِ قدرت کے ساتھ ان کو الگ الگ کرکے درمیان میں ہوا اور خلا کا فاصلہ کر دیا اور آسمانوں کو سات آسمان اور زمین کو سات زمینیں بنا دیا۔ دیکھیے سورۂ طلاق(۱۲) بھلا اس کے سوا کسی کی یہ مجال ہے؟ آج کل سائنس بھی تسلیم کرتی ہے کہ کائنات پہلے ایک تودے کی شکل میں تھی، پھر ایک بہت بڑے دھماکے کے ساتھ جدا جدا ہوئی، مگر بے چارے سائنس دان وہ دھماکا کرنے والے سے ناآشنا ہی رہے۔ (الا ما شاء اللہ) ¤ دوسرا معنی یہ ہے کہ کیا اللہ کی توحید کے منکروں نے نہیں دیکھا کہ آسمان بند تھا، اس سے ایک قطرہ نہیں برستا تھا اور زمین بند تھی، اس سے ایک پتا نہیں اگتا تھا؟ ہم نے اپنی قدرتِ کاملہ کے ساتھ اپنی مخلوق کے فائدے کے لیے بارش کے ساتھ آسمان کے دہانے کھول دیے اور اس کے ساتھ زمین کے مسام کھول کر طرح طرح کی نباتات پیدا فرما دیں۔ ¤ ➋ { وَ جَعَلْنَا مِنَ الْمَآءِ كُلَّ شَيْءٍ حَيٍّ :} اس میں انسان، حیوان، پودے اور درخت سب شامل ہیں۔ پانی سے جاندار چیز کی پیدائش کی تفصیل کے لیے دیکھیے سورۂ نور (۴۵) اور نباتات کی پیدائش کے لیے دیکھیے سورۂ انعام (۹۹)۔ ¤ ➌ ہمارے استاذ محمد عبدہ رحمہ اللہ امام رازی سے نقل کرتے ہوئے لکھتے ہیں : ’’یعنی جن چیزوں میں جان ہے، جیسے حیوانات اور نباتات، ان سب کی پیدائش پانی سے ہے، لیکن فرشتے اور جن یا دوسری کوئی چیز جس کے متعلق ثابت ہو جائے کہ اس کے مادہ میں پانی کو دخل نہیں ہے، وہ اس سے مستثنیٰ قرار پائیں گی۔‘‘ (کبیر) دراصل یہ اس سوال کا جواب ہے کہ فرشتے اور جن تو پانی سے نہیں بلکہ نور اور آگ سے پیدا ہوئے ہیں، ان کی پیدائش پانی سے کیسے تسلیم کی جا سکتی ہے؟ اس جواب کی بنیاد اس بات پر ہے کہ {’’ كُلٌّ ‘‘} سے مراد کائنات کی ہر چیز نہیں ہوتی، بلکہ ہر موقع کی مناسبت سے {’’كُلٌّ‘‘} کا معنی کیا جاتا ہے، جیسا کہ ملکہ سبا کے متعلق ہد ہد نے کہا تھا : «{ وَ اُوْتِيَتْ مِنْ كُلِّ شَيْءٍ }» [ النمل : ۲۳ ] ’’اور اسے ہر چیز میں سے حصہ دیا گیا ہے۔‘‘ اور قوم عاد پر آنے والی آندھی کے متعلق اللہ نے فرمایا : «{ تُدَمِّرُ كُلَّ شَيْءٍۭ بِاَمْرِ رَبِّهَا }» [ الأحقاف : ۲۵ ] ’’جو ہر چیز کو اپنے رب کے حکم سے برباد کر دے گی۔‘‘مفسر رازی کا یہ جواب معقول ہے۔ تاہم اگر {’’ كُلَّ شَيْءٍ حَيٍّ ‘‘} ہر زندہ چیز کا وجود پانی سے مان لیا جائے، جس میں انسان کے ساتھ جن اور فرشتے بھی شامل ہوں تو کچھ بعید نہیں، جب مٹی سے بننے والے انسان کا اصل پانی ہے تو آگ اور نور سے بننے والے جنوں اور فرشتوں کا اصل بھی پانی ہو سکتا ہے۔ آج جب ایٹم کو پھاڑنے کی صورت میں مادے کا توانائی میں بدلنا مشاہدے سے ثابت ہو چکا ہے، جس سے انسان کو بے پناہ تعمیری اور تخریبی قوت حاصل ہوئی ہے اور قیامت کے دن سمندر کے پانی آگ کی صورت اختیار کر جائیں گے (دیکھیے سورۂ تکویر : ۶) تو اللہ کے حکم سے پانی آگ کے علاوہ نور کی صورت بھی اختیار کر سکتا ہے۔ (واللہ اعلم) ¤ ➍ { اَفَلَا يُؤْمِنُوْنَ :} یعنی زمین و آسمان میں حیرت انگیز نظام قائم کرنے والے ہم ہیں، کوئی اور نہیں، کیا اس پر بھی یہ لوگ توحید کا راستہ اختیار نہیں کرتے، بلکہ دوسروں کو ہمارا شریک سمجھ رہے ہیں؟ ¤ ➎ رازی فرماتے ہیں : ’’اس آیت (۳۰) سے آیت (۳۳) تک چار آیات میں کائنات کو بنانے والے کے وجود اور اس کے صرف ایک ہونے کے چھ قسم کے دلائل مذکور ہیں۔‘‘ (کبیر)"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { وَ جَعَلْنَا فِي الْاَرْضِ رَوَاسِيَ : ’’ رَوَاسِيَ ‘‘ ’’رَاسِيَةٌ‘‘} کی جمع ہے جو {’’رَسَا يَرْسُوْ رُسُوًّا‘‘} سے اسم فاعل ہے، یعنی زمین میں گڑے ہوئے۔ ارضیات کے ماہروں پر اب یہ حقیقت ظاہر ہوئی ہے کہ پہاڑوں کا بہت بڑا حصہ زمین کے نیچے گڑا ہوا ہے۔ ¤ ➋ { اَنْ تَمِيْدَ بِهِمْ : ’’مَادَ يَمِيْدُ مَيْدًا وَ مَيْدَانًا‘‘} حرکت کرنا، ٹیڑھا ہونا۔ (قاموس) {’’ اَنْ تَمِيْدَ ‘‘} اصل میں {’’أَنْ لَا تَمِيْدَ‘‘} ہے۔ یہ تیسری دلیل ہے، یعنی اگر زمین میں یہ بھاری پہاڑ نہ گاڑ دیے جاتے تو اس میں ہر وقت زلزلے اور حرکت کی حالت رہتی، اس میں نہ وہ توازن ہوتا اور نہ سکون جو مخلوق کے رہنے کے لیے ضروری ہے۔ وہ کسی وقت بھی ایک طرف جھک جاتی، یا زلزلے سے دو چار رہتی جس سے زمین کے ستر فیصد حصے پر پھیلا ہوا سمندر کا پانی خشکی پر چڑھ دوڑتا اور زمین پر ایک متنفس بھی باقی نہ رہتا۔ اب بھی کبھی کبھار اللہ تعالیٰ زلزلے کے ذریعے سے اپنی نعمت یاد دلاتا رہتا ہے، جس سے سمندر کا پانی خشکی پر چڑھ دوڑتا ہے اور میلوں تک آبادیوں کو نیست و نابود کر دیتا ہے۔ ¤ ➌ { وَ جَعَلْنَا فِيْهَا فِجَاجًا سُبُلًا : ’’ فِجَاجًا ‘‘ ’’ فَجٌّ‘‘} کی جمع ہے، یعنی پہاڑوں کے درمیان کھلا راستہ۔ زمخشری نے {’’ فِجَاجًا ‘‘} کو {’’سُبُلًا ‘‘} سے حال قرار دیا ہے، کیونکہ یہ نکرہ {’’ سُبُلًا ‘‘} کی صفت ہے جو پہلے آئی ہے، جیسا کہ فرمایا : «{ لِتَسْلُكُوْا مِنْهَا سُبُلًا فِجَاجًا }» [ نوح : ۲۰ ] ’’تاکہ تم اس کے کھلے راستوں پر چلو۔‘‘ یعنی اگر یہ بلند اور ٹھوس پہاڑ اس طرح واقع ہوتے کہ ان میں کوئی راستہ نہ ہوتا، یا ان میں ڈھلوان نہ ہوتی بلکہ عموداً کھڑے ہوتے تو نہ زمین کی ایک طرف کے لوگ دوسری طرف جا سکتے، نہ ایک شہر کے لوگ دوسرے شہر کے لوگوں سے مل سکتے اور نہ خود پہاڑوں پر آبادی ہو سکتی۔ یہ ہماری قدرت کا کمال ہے کہ ہم نے پہاڑوں میں ندی نالوں، دروں اور ڈھلوانوں کی صورت میں آنے جانے کے کشادہ راستے بنا دیے ہیں، جس سے پہاڑ بھی میدانوں کی طرح آباد ہیں۔ ¤ ➍ { لَعَلَّهُمْ يَهْتَدُوْنَ:} تاکہ وہ زمین میں جہاں جانا چاہیں اس کے لیے راہ پا سکیں اور تاکہ وہ زمین و آسمان اور پہاڑوں کی پیدائش میں اللہ تعالیٰ کی قدرت کے کرشمے دیکھ کر اس کی توحید کی راہ پا سکیں۔ {’’ يَهْتَدُوْنَ ‘‘} میں دونوں مفہوم شامل ہیں۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ { وَ جَعَلْنَا السَّمَآءَ سَقْفًا مَّحْفُوْظًا:} زمین کے چند عجائب کے ذکر کے بعد آسمان کے عجائب کی طرف متوجہ فرمایا۔ لوگوں کی بنائی ہوئی چھوٹی سی چھتیں بھی دیواروں یا ستونوں کے بغیر قائم نہیں رہ سکتیں اور پھر ان میں ٹوٹ پھوٹ کا سلسلہ جاری رہتا ہے۔ ان سے گرنے والی چیزیں کسی نہ کسی نقصان کا باعث بنتی ہیں، وہ جتنی دیر بھی رہیں آخر گر پڑتی ہیں۔ چور ان میں نقب لگا کر مال و متاع چرا کر لے جاتے ہیں، لیکن اللہ تعالیٰ نے آسمان کو زمین کے لیے ایسی چھت بنایا جو ستونوں کے بغیر قائم ہے۔ دیکھیے سورۂ رعد (۲) اور لقمان (۱۰) اور گرنے سے ہر طرح سے محفوظ ہے۔ دیکھیے سورۂ فاطر (۴۱) اور سورۂ حج (۶۵) اس سے کوئی نقصان دہ چیز نیچے آنے کے بجائے زندگی کو قائم رکھنے والی چیزیں، مثلاً سورج کی تیز روشنی (ضیا) اور حرارت، چاند اور ستاروں کا نور، رات دن کا آنا جانا، بادل، بارش، ہوائیں، فرشتے اور اللہ تعالیٰ کی بے شمار نظر نہ آنے والی رحمتیں اترتی ہیں۔ پھر نقب تو بہت دور، راز چرانے کی کوشش کرنے والے شیاطین سے بھی شہاب ثاقب کے ذریعے سے اس کی حفاظت کا زبردست انتظام کیا گیا ہے۔ دیکھیے سورۂ حجر (۱۶ تا ۱۸) اور صافات (۶ تا ۱۰)۔ ¤ ➋ { وَ هُمْ عَنْ اٰيٰتِهَا مُعْرِضُوْنَ:} یعنی مشرک لوگ آسمان اور اس میں پائی جانے والی نشانیوں کی طرف توجہ ہی نہیں کرتے، مثلاً سورج، چاند، ستارے، رات، دن، بارش، بادل، بجلی، ہوائیں اور اللہ تعالیٰ کی قدرت کی بے شمار چیزیں۔ کیونکہ اگر وہ عبرت کی نظر سے ان تمام چیزوں کو دیکھیں تو یقین کر لیں کہ ان کا بنانے والا موجود ہے اور اس کا کوئی شریک نہیں۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ {وَ هُوَ الَّذِيْ خَلَقَ الَّيْلَ وَ النَّهَارَ:} پچھلی آیت میں مشرکوں کے زمین و آسمان کی نشانیوں سے منہ موڑنے کا ذکر فرمایا، اس آیت میں ان میں سے چند نشانیاں ذکر فرمائی ہیں، یعنی رات، دن، سورج اور چاند۔ بڑی نشانیوں کے ذکر کے بعد چھوٹی نشانیوں، مثلاً ستاروں وغیرہ کے ذکر کی ضرورت نہیں رہی۔ ان کی تفصیل کے لیے دیکھیے سورۂ بنی اسرائیل (۱۲)، قصص (۷۱، ۷۲)، یونس (۵، ۶)، فرقان (۶۱، ۶۲)، انعام (۹۶) اور یس (۳۷ تا ۴۰)۔ ¤ ➋ { كُلٌّ فِيْ فَلَكٍ يَّسْبَحُوْنَ : ’’ فَلَكٍ ‘‘} دراصل چرخے کے دھاگا بنانے والے تکلے پر گھومنے والے گول چمڑے کو کہتے ہیں، پھر ہر دائرے کو فلک کہہ لیتے ہیں۔ {’’سَبَحَ يَسْبَحُ‘‘} (ف) کا معنی تیرنا ہے۔ نہایت تیزی سے چلنے کو بھی تیرنے سے تشبیہ دیتے ہیں، جیسا کہ متنبی نے کہا ہے : ¤ {أَعَزُّ مَكَانٍ فِي الدُّنْيَا سَرْجُ سَابِحٍ ¤ وَ خَيْرُ جَلِيْسٍ فِي الزَّمَانِ كِتَابُ} ¤ ’’دنیا میں سب سے زیادہ باعزت جگہ تیرنے والے گھوڑے کی زین ہے اور زمانے میں سب سے بہتر ہم نشین کتاب ہے۔‘‘ ¤ مطلب یہ ہے کہ سورج، چاند اور تمام سیارے اپنے اپنے دائرے میں نہایت تیزی سے گھوم رہے ہیں۔ کوئی اپنے مقرر کردہ مدار سے نہ ادھر ادھر ہوتا ہے اور نہ خراب ہو کر رکتا ہے۔ نہ کسی میں کوئی حادثہ رونما ہوتا ہے اور نہ تصادم، فرمایا : «{ ذٰلِكَ تَقْدِيْرُ الْعَزِيْزِ الْعَلِيْمِ }» [ یٰسٓ : ۳۸ ] ’’یہ اس کا مقرر کردہ اندازہ ہے جو سب پر غالب، سب کچھ جاننے والا ہے۔‘‘"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ { وَ مَا جَعَلْنَا لِبَشَرٍ مِّنْ قَبْلِكَ الْخُلْدَ :} اس سے پہلے چار آیات میں خالق کائنات کے وجود اور اس کی توحید کے چھ دلائل بیان فرمائے۔ اب یہاں سے بیان فرمایا کہ یہ نظام ہمیشہ قائم رہنے کے لیے نہیں بلکہ امتحان اور آزمائش کے لیے بنایا گیا ہے۔ (کبیر) ¤ ➋ بقاعی نے پچھلی آیت کے ساتھ یہ مناسبت ذکر کی ہے کہ اس میں رات دن کے آنے جانے کا ذکر ہے، جس سے ہر انسان کی عمر کا سلسلہ آخر منقطع ہو جاتا ہے، اس لیے فرمایا کہ ہم نے آپ سے پہلے کسی بشر کے لیے ہمیشگی نہیں رکھی، خواہ نیک ہو یا بد۔ یہ آیت خضر علیہ السلام کے زندہ نہ ہونے کی بھی ایک بہت مضبوط دلیل ہے۔ رہے عیسیٰ علیہ السلام ، تو ان کی عمر بہت طویل ہونے کا مطلب یہ نہیں کہ انھیں ہمیشہ کی زندگی حاصل ہے، کیونکہ قیامت کے قریب زمین پر اترنے کے بعد انھوں نے بھی فوت ہونا ہے۔ [ بخاري، العلم، باب السمر في العلم : ۱۱۶، عن ابن عمر رضی اللہ عنھما ] وہ حدیث بھی اس کی صریح دلیل ہے جس میں رسول اللہ صلی اللہ علعلیہ وسلم نے فرمایا : [ فَإِنَّ رَأْسَ مِئَةِ سَنَةٍ مِنْهَا لَا يَبْقٰی مِمَّنْ هُوَ عَلٰی ظَهْرِ الْأَرْضِ أَحَدٌ ] [ بخاري، في العلم، باب السمر فی العلم : ۱۱۶۔ مسلم : ۲۵۳۸ ] ’’جو لوگ آج زمین کی پشت پر موجود ہیں آج سے ایک سو سال کے سرے پر ان میں سے کوئی باقی نہیں رہے گا۔‘‘ ¤ ➌ { اَفَاۡىِٕنْ مِّتَّ فَهُمُ الْخٰلِدُوْنَ:} اس میں ان لوگوں کا جواب ہے جو یہ کہہ کر خوشی کا اظہار کیا کرتے تھے کہ محمد صلی اللہ علیہ وسلم عنقریب مر جائیں گے تو ہماری جان چھوٹ جائے گی۔ دیکھیے سورۂ طور (۲۰) فرمایا، اس میں ان کے لیے خوشی کا موقع تو تب ہو جب انھیں ہمیشہ زندہ رہنا ہو۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ {كُلُّ نَفْسٍ ذَآىِٕقَةُ الْمَوْتِ: ’’ ذَآىِٕقَةُ ‘‘ ’’ ذَاقَ يَذُوْقُ ‘‘} (ن) سے اسم فاعل ہے، یعنی چکھنے والی۔ اس میں تمام بت پرستوں کی تردید ہے جو اپنے دیوی دیوتاؤں کے ہمیشہ زندہ رہنے کا عقیدہ رکھتے ہیں، اسی طرح ان قبر پرستوں کا بھی جو اپنے داتاؤں، حاجت رواؤں اور مشکل کشاؤں کے لیے موت کا لفظ گالی سمجھتے ہیں۔ چنانچہ جب بھی رسول کریم صلی اللہ علیہ وسلم یا کسی بزرگ کے بارے میں موت یا فوت کا لفظ آئے وہ اس کے بجائے انتقال (جگہ بدلنے) کا لفظ استعمال کریں گے، یا کہیں گے وہ پردے میں ہو گئے ہیں یا پردہ فرما گئے ہیں۔ اللہ کے بندے یہ نہیں سوچتے کہ موت تو مومن کا تحفہ ہے، جس کے بغیر اس کے لیے اللہ تعالیٰ کی ملاقات اور اس کا دیدار ممکن ہی نہیں۔ چنانچہ ابن کثیر رحمہ اللہ نے یہاں دو شعر نقل فرمائے ہیں جو امام شافعی رحمہ اللہ نے ایسے ہی کسی موقع پر پڑھے: ¤ {تَمَنَّي رِجَالٌ أَنْ أَمُوْتَ وَ إِنْ أَمُتْ ¤ فَتِلْكَ سَبِيْلٌ لَسْتُ فِيْهَا بِأَوْحَدٖ ¤ فَقُلْ لِلَّذِيْ يَبْغِيْ خِلاَفَ الَّذِيْ مَضٰي ¤ تَهَيَّأْ لِأُخْرٰي مِثْلِهَا فَكَأَنْ قَدٖ} ¤ ’’کچھ لوگوں نے میری موت کی تمنا کی ہے اور اگر میں مر جاؤں تو یہ ایسا راستہ ہے جس میں میں اکیلا نہیں ہوں۔ سو اس شخص سے کہہ دو جو جانے والے کے بعد اس کی جگہ کا طلب گار ہے کہ تو بھی اس جیسی ایک اور (موت) کے لیے تیار ہو جا اور سمجھ لے کہ وہ بس آ ہی چکی۔‘‘ ایک فارسی شاعر نے خوب کہا ہے: ¤ بے فنائے خود میسر نیست دیدارِ شما مے فروشد خویش را اول خریدارِ شما ¤ ’’اپنے فنا ہونے کے بغیر تمھارا دیدار میسر نہیں ہو سکتا، اس لیے تمھارا خریدار پہلے اپنے آپ کو فروخت کرتا ہے۔‘‘ مزید دیکھیے سورۂ زمر (۳۰)، آل عمران (۱۸۵)، عنکبوت (۵۶، ۵۷) اور نساء (۷۸)۔ ¤ ➋ {وَ نَبْلُوْكُمْ بِالشَّرِّ وَ الْخَيْرِ فِتْنَةً:’’ نَبْلُوْكُمْ ‘‘ ’’بَلَا يَبْلُوْ‘‘} اور {’’اِبْتَلٰي يَبْتَلِيْ‘‘} کا معنی ایک ہی ہے، آزمانا، مبتلا کرنا۔ {’’ فِتْنَةً ‘‘ آزمائش۔ ’’ فِتْنَةً ‘‘} لفظ کی تبدیلی کے ساتھ {’’ نَبْلُوْكُمْ ‘‘} کا مفعول مطلق ہے، مفعول لہ بھی ہو سکتا ہے۔ ترجمہ مفعول لہ کی حیثیت سے کیا گیا ہے۔ شر سے مراد دنیا میں بدحالی اور سختی ہے اور خیر سے مراد خوشحالی اور آسانی ہے۔ یعنی ہم تمھیں کبھی سختی سے دوچار کرتے ہیں، کبھی نرمی کا سلوک کرتے ہیں۔ کبھی تم پر بیماری آتی ہے، کبھی صحت۔ کبھی دولت وافر ہوتی ہے کبھی فقیری، غرض ان تمام حالتوں سے مقصود تمھاری آزمائش ہے کہ تم نعمت پر شکر اور مصیبت پر صبر کرتے ہو یا نہیں۔ کافر اور فاسق خوشحالی میں بخل اور تکبر کرنے لگتا ہے اور مصیبت میں بے صبری اور جزع فزع۔ دیکھیے سورۂ معارج (۱۹ تا ۲۱) مومن کا حال اس کے برعکس ہوتا ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ عَجَبًا لِأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَهٗ كُلَّهٗ خَيْرٌ وَلَيْسَ ذَاكَ لِأَحَدٍ إِلَّا لِلْمُؤْمِنِ إِنْ أَصَابَتْهٗ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَّهٗ وَإِنْ أَصَابَتْهٗ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَّهٗ ] [ مسلم، الزھد، باب المؤمن أمرہ کلہ خیر : ۲۹۹۹، عن صہیب رضی اللہ عنہ ]’’مومن کا معاملہ عجیب ہے، کیونکہ اس کا سارا معاملہ ہی خیر ہے اور یہ چیز مومن کے سوا کسی کو حاصل نہیں۔ اگر اسے خوشی حاصل ہوتی ہے تو وہ شکر کرتا ہے، سو وہ اس کے لیے بہتر ہے اور اگر اسے کوئی تکلیف پہنچتی ہے تو صبر کرتا ہے، وہ بھی اس کے لیے بہتر ہے۔‘‘ اللہ تعالیٰ کے اپنی مخلوق کو آزمانے کا ذکر کئی آیات میں آیا ہے، دیکھیے سورۂ اعراف (۹۴، ۹۵، ۱۶۸) اور سورۂ انعام (۴۲ تا ۴۵)۔ ¤ ➌ { وَ اِلَيْنَا تُرْجَعُوْنَ : ’’ اِلَيْنَا ‘‘} پہلے لانے سے کلام میں حصر پیدا ہو گیا ہے، یعنی تم ہماری ہی طرف لوٹائے جاؤ گے، پھر ہم تمھیں تمھارے اعمال کے مطابق اچھی یا بری جزا دیں گے۔ ’’لوٹائے جاؤ گے‘‘ اس لیے فرمایا کہ ہمارے والد ماجد آدم علیہ السلام کو پیدا کرنے کے بعد جنت میں رکھا گیا، پھر ان کی خطا سے انھیں جنت سے نکالا گیا۔ معلوم ہوا ہمارا اصل وطن جنت ہے، آزمائش کے لیے کچھ مدت زمین پر گزارنے کے بعد ہمیں دوبارہ اپنے رب کے حضور پیش ہونا ہو گا، اگر کامیاب ہوئے تو دوبارہ جنت ملے گی اور ناکام ہوئے تو جہنم۔ دیکھیے سورۂ بقرہ (۳۸، ۳۹)۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) ➊ { وَ اِذَا رَاٰكَ الَّذِيْنَ كَفَرُوْۤا … : ’’ هُزُوًا ‘‘} مصدر بمعنی مفعول ہے، یعنی جسے مذاق کیا جائے۔ پچھلی آیت میں لوگوں کو خیر و شر کے ساتھ آزمانے کا ذکر فرمایا۔ بنی نوع انسان کے لیے سب سے بڑی خیر رسول کریم صلی اللہ علیہ وسلم کی ذات گرامی ہے اور آپ کی آمد لوگوں کے لیے سب سے بڑی آزمائش بھی ہے کہ کون نعمت کی قدر کرتے ہوئے آپ پر ایمان لاتا ہے اور کون ناشکری اور کفر کرتا ہے۔ اس آیت میں اس نعمت کے عطا ہونے پر ناشکری کرنے والے لوگوں یعنی کافروں کے رویے کا ذکر فرمایا کہ جب وہ آپ کو دیکھتے ہیں تو آپ کو مذاق ہی بناتے ہیں، سنجیدگی سے نہ کوئی بات سنتے ہیں اور نہ سمجھتے ہیں۔ ¤ ➋ { اَهٰذَا الَّذِيْ يَذْكُرُ اٰلِهَتَكُمْ :} یہ جملہ ان کے ٹھٹھے کی تفسیر ہے، یعنی وہ آپ کو دیکھ کر کہتے ہیں کہ کیا یہی ہے جو تمھارے معبودوں کا ذکر کرتا ہے؟ ذکر کرنے سے مراد اچھائی سے ذکر کرنا بھی ہوتا ہے اور برائی سے بھی، تعین اس کا حال کے قرینے سے ہوتا ہے، مثلاً کوئی شخص آپ سے آپ کے کسی دوست کے متعلق بیان کرتا ہے کہ وہ آپ کا ذکر کر رہا تھا، تو ظاہر ہے اس کی مراد یہی ہے کہ وہ آپ کی تعریف کر رہا تھا اور اگر آپ کے کسی مخالف کے متعلق بیان کرے کہ وہ آپ کا ذکر کر رہا تھا تو اس سے مراد یہی ہو گی کہ وہ برائی کے ساتھ آپ کا ذکر کر رہا تھا۔ جیسا کہ بت توڑنے والے کو تلاش کرتے ہوئے ابراہیم علیہ السلام کی قوم کے لوگوں نے کہا تھا : «{ سَمِعْنَا فَتًى يَّذْكُرُهُمْ يُقَالُ لَهٗۤ اِبْرٰهِيْمُ }» [ الأنبیاء : ۶۰ ] ’’ہم نے ایک جوان کو سنا ہے، وہ ان کا ذکر کرتا ہے، اسے ابراہیم کہا جاتا ہے۔‘‘ {’’ اَهٰذَا ‘‘} (کیا یہی ہے) میں ہمزہ تعجب کے اظہار کے لیے اور {’’ هٰذَا ‘‘} تحقیر کے لیے استعمال ہوا ہے۔ ¤ ➌ { وَ هُمْ بِذِكْرِ الرَّحْمٰنِ هُمْ كٰفِرُوْنَ :} یعنی ان کے معبودوں کا برائی سے ذکر کرنے پر آپ کا مذاق اڑانا انھیں کس طرح زیب دیتا ہے، جب کہ خود ان کا حال یہ ہے کہ وہ رحمان کے ذکر ہی سے منکر ہیں؟ انھیں اس بے حد رحم والے کا ذکر گوارا نہیں جس نے انھیں پیدا کیا، ان پر انعام فرمایا اور جس اکیلے کے ہاتھ میں ان کا نفع اور ان کا نقصان ہے۔ پھر مذاق کے حق دار یہ لوگ ہیں یا ہمارا رسول؟ {’’ بِذِكْرِ الرَّحْمٰنِ ‘‘} کی تفسیر بعض مفسرین نے قرآن مجید فرمائی ہے کہ «{ اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ }» [الحجر : ۹ ] یعنی وہ خود رحمان کے نازل کردہ ذکر کے منکر ہیں۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { خُلِقَ الْاِنْسَانُ مِنْ عَجَلٍ :} کسی چیز کے وقت سے پہلے اس کا ارادہ عجلہ (جلد بازی) ہے، یعنی جلد بازی انسان کی فطرت میں شامل ہے، وہ پیدا ہی جلد باز کیا گیا، جیسا کہ فرمایا : «{ وَ كَانَ الْاِنْسَانُ عَجُوْلًا }» [ بني إسرائیل : ۱۱ ] ’’اور انسان ہمیشہ سے بہت جلد باز ہے۔‘‘ ’’جلد بازی سے پیدا کیا گیا ہے‘‘ سے مراد مبالغہ ہے، جیسے فرمایا : «{ اَللّٰهُ الَّذِيْ خَلَقَكُمْ مِّنْ ضُؔعْفٍ }» [ الروم : ۵۴ ] ’’اللہ وہ ہے جس نے تمھیں ضعف سے پیدا کیا۔‘‘ ¤ ➋ {سَاُورِيْكُمْ اٰيٰتِيْ فَلَا تَسْتَعْجِلُوْنِ: ’’ فَلَا تَسْتَعْجِلُوْنِ‘‘} اصل میں {’’فَلَا تَسْتَعْجِلُوْنِيْ‘‘} ہے۔ آییات کے آخری حروف کی موافقت کے لیے نون پر کسرہ باقی رکھ کر ’’یاء‘‘ حذف کر دی گئی۔ اس آیت کی تفسیر دو طرح سے کی گئی ہے، ایک یہ کہ کفار کی شدید مخالفت اور رسول اللہ صلی اللہ علیہ وسلم کا مذاق اڑانے پر مسلمان سخت غم زدہ اور پریشان تھے اور کفار پر جلد از جلد عذاب کے منتظر تھے۔ اللہ تعالیٰ نے ان کے اس عمل کو جلد بازی قرار دے کر تسلی دی کہ میں تمھیں اپنی نشانیاں ضرور دکھاؤں گا، مگر ہر کام کا ایک وقت مقرر ہے، اس سے پہلے اس کا مطالبہ مت کرو۔ نشانیوں سے مراد کفار پر آنے والی آفات و مصائب ہیں، مثلاً بدر، احد، خندق، حدیبیہ اور فتح مکہ میں کفار کی شکست اور ان کے اقتدار کا خاتمہ۔ اس مطلب کا قرینہ یہ ہے کہ کفار کے عذاب جلدی لانے کے مطالبے کا ذکر اگلی آیت میں ہے۔ دوسرا مطلب یہ ہے کہ انسان کی سرشت میں جلد بازی ہے، وہ کسی سے ناراض ہو اور اس کے پاس طاقت ہو تو وہ فوراً انتقام لیتا ہے۔ اپنی اس سرشت کے مطابق انھوں نے اللہ تعالیٰ کے متعلق بھی یہ خیال کیا کہ اگر اس کے پاس انتقام کی طاقت ہوتی تو وہ فوراً عذاب نازل کر دیتا، چنانچہ وہ آپ صلی اللہ علیہ وسلم کا مذاق اڑاتے اور عذاب میں دیر کی وجہ سے بار بار اس کے جلد لانے کا مطالبہ کرتے۔ فرمایا، تم عذاب کے جلدی آنے کا مطالبہ کیوں کرتے ہو؟ اب تک جو ہم نے تمھیں ڈھیل دی ہے اس میں ہماری کئی حکمتیں ہیں، جن میں سے تم پر حجت پوری کرنا اور تم میں سے کئی لوگوں کا اسلام قبول کرنا بھی ہے۔ اس سے تم نے یہ کیسے سمجھ لیا کہ ہمیں تمھاری کارستانیاں اور شرارتیں گوارا ہیں؟ ذرا ٹھہرو! ابھی تمھیں معلوم ہو جائے گا کہ ہم تم سے کیسے انتقام لیتے ہیں۔ دنیا میں بھی قتل ہو گے اور ذلت و رسوائی برداشت کرنا پڑے گی اور آخرت میں بھی تمھیں جہنم کی آگ کا ایندھن بنایا جائے گا۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) {وَ يَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ …:} یہ ان کے عذاب طلب کرنے میں جلدی کی تفصیل ہے۔ کفار رسول اللہ صلی اللہ علیہ وسلم کو جھٹلانے اور آپ کا اور مسلمانوں کا مذاق اڑانے کے لیے بار بار پوچھتے کہ عذاب کا وہ وعدہ کب پورا ہو گا؟ جھٹلانے کے ساتھ ساتھ چڑانے اور بھڑکانے کے لیے طنزاً یہ بھی کہتے کہ ’’اگر تم سچے ہو۔‘‘ {’’ كُنْتُمْ ‘‘} ہمیشگی کا اظہار کرتا ہے اور {’’صٰدِقِيْنَ ‘‘} اسم فاعل بھی سچ کے دوام کا اظہار کرتا ہے، یعنی تم جو ہمیشہ سچ بولتے ہو، تمھاری صفت ہی صادق ہے تو عذاب کا جو وعدہ تم نے کیا تھا وہ کب پورا ہو گا؟ (بقاعی)"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ { لَوْ يَعْلَمُ الَّذِيْنَ كَفَرُوْا …:} یعنی ان لوگوں کے عذاب کو جھٹلانے اور اسے ناممکن سمجھنے کی اصل وجہ ان کا جہل ہے، انھیں اس وقت کا علم ہی نہیں جب آگ انھیں چاروں طرف سے گھیر لے گی۔ یہ نہ اپنے چہروں سے آگ کو روک سکیں گے، جو ان کے جسم کا سب سے اہم اور خوبصورت حصہ ہے اور نہ پشتوں سے، جو جسم کا سب سے مضبوط حصہ ہے۔ جب ان اعضا کو آگ سے نہ بچا سکے تو دوسرے اعضا کو کیسے بچائیں گے؟ کفار کو آگ کے چاروں طرف سے گھیرنے کا ذکر کئی جگہ آیا ہے۔ دیکھیے سورۂ کہف (۲۹)، اعراف (۴۱)، زمر (۱۶)، ابراہیم (۵۰)، مومنون (۱۰۴) اور دوسری آیات۔ ’’ لَوْ ‘‘ کی دو تفسیریں ہیں، ایک یہ کہ یہ حرف شرط ہے اور اس کی جزا محذوف ہے، جو خودبخود سمجھ میں آ رہی ہے، یعنی اگر کافر لوگ اس وقت کو جان لیں تو نہ کبھی اسے جلدی طلب کریں، نہ اس کا مذاق اڑائیں اور نہ اس کا انکار کریں۔ دوسری تفسیر یہ کہ یہ حرف تمنی ہے، یعنی ’’کاش کہ کافر لوگ اس وقت کو جان لیں‘‘ اس صورت میں جزا کی ضرورت نہیں۔ ¤ ➋ { وَ لَا هُمْ يُنْصَرُوْنَ :} کوئی ان کی مدد کو نہیں آئے گا اور نہ وہ اپنی یا ایک دوسرے کی مدد کر سکیں گے۔ دیکھیے سورۂ طارق (۱۰)، صافات (۲۵، ۲۶) اور شعراء (۹۲ تا ۹۵)۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ {بَلْ تَاْتِيْهِمْ بَغْتَةً … :} ’’بلکہ وہ ان کے پاس اچانک آئے گا۔‘‘ {’’ تَاْتِيْهِمْ ‘‘} کی ضمیر سے مراد قیامت ہے، کیونکہ آگ کا چاروں طرف سے گھیرنا قیامت کے دن ہو گا۔ اچانک آنے کی وجہ یہ ہے کہ اس کے آنے سے پہلے اس کا وقت معلوم ہونے کی کوئی صورت ہی نہیں اور نہ اللہ تعالیٰ نے وہ کسی کو بتایا ہے۔ دیکھیے سورۂ طٰہٰ (۱۵)، اعراف (۱۸۷) اور نازعات (۴۲ تا ۴۶) نہ قیامت آہستہ آہستہ بتدریج آئے گی کہ اس کے آنے کا علم ہو جائے۔ (بقاعی) بلکہ اچانک آئے گی، اسی لیے اس کا ایک نام {’’ اَلسَّاعَةُ ‘‘} ہے، اس لیے کہ وہ ایک ساعت (گھڑی) میں قائم ہو جائے گی۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَلَتَقُوْمَنَّ السَّاعَةُ وَقَدْ نَشَرَ الرَّجُلَانِ ثَوْبَهُمَا فَلاَ يَتَبَايَعَانِهٖ وَلَا يَطْوِيَانِهٖ وَلَتَقُوْمَنَّ السَّاعَةُ وَقَدِ انْصَرَفَ الرَّجُلُ بِلَبَنِ لِقْحَتِهٖ فَلَا يَطْعَمُهٗ وَلَتَققُوْمَنَّ السَّاعَةُ وَهُوَ يَلِيْطُ حَوْضَهٗ فَلَا يَسْقِيْ فِيْهِ وَلَتَقُوْمَنَّ السَّاعَةُ وَقَدْ رَفَعَ أَحَدُكُمْ أُكْلَتَهُ إِلٰی فِيْهِ فَلَا يَطْعَمُهَا ] [ بخاري، الرقاق، بابٌ : ۶۵۰۶۔ مسلم : ۲۹۵۴ ] ’’قیامت اس حال میں قائم ہو گی کہ دو آدمیوں نے اپنا کپڑا پھیلایا ہو گا، پھر نہ اس کی خرید و فروخت کر سکیں گے اور نہ اسے لپیٹ سکیں گے اور قیامت اس حال میں قائم ہو گی کہ آدمی اپنے دودھ والے جانور کا دودھ لائے گا تو اسے پیے گا نہیں اور قیامت اس حال میں قائم ہوگی کہ وہ اپنے حوض کی لپائی کر رہا ہو گا تو اس میں اپنے جانوروں کو پانی نہیں پلا سکے گا اور قیامت اس حال میں قائم ہو گی کہ اس نے لقمہ اپنے منہ کی طرف اٹھایا ہو گا تو کھا نہیں سکے گا۔‘‘ ¤ ➋ { فَتَبْهَتُهُمْ : ’’ بَهَتَ يَبْهَتُ بَهْتًا ‘‘} (ف،ع، ن، ک) اچانک آپکڑنا، لاجواب کر دینا، حیران کر دینا۔ (قاموس) یعنی وہ انھیں مبہوت (حیرت زدہ) کر دے گی۔ {’’ فَلَا يَسْتَطِيْعُوْنَ رَدَّهَا ‘‘} کیونکہ نہ وہ اسے ہٹا سکیں گے اور نہ اس پر صبر کر سکیں گے۔ {’’ وَ لَا هُمْ يُنْظَرُوْنَ ‘‘} اور نہ انھیں کوئی مہلت ملے گی کہ ایک لمحہ آرام کر لیں، کیونکہ مہلت کی مدت تو اس سے پہلے پوری ہو چکی ہو گی۔ (قاسمی)"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) {وَ لَقَدِ اسْتُهْزِئَ بِرُسُلٍ …:’’ حَاقَ يَحِيْقُ ‘‘} گھیر لینا۔ اس آیت میں رسول االلہ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ آپ کفار کے مذاق اڑانے اور جھٹلانے سے بد دل نہ ہوں، آپ سے پہلے پیغمبروں کا بھی اسی طرح مذاق اڑایا گیا۔ انھوں نے اللہ کے جس عذاب سے ڈرایا اس کا بھی مذاق اڑایا گیا۔ آخر کار ان مذاق اڑانے والوں کو اسی عذاب نے گھیر لیا جس کا وہ مذاق اڑاتے تھے۔ آپ کا مذاق اڑانے والوں کا انجام بھی یہی ہو گا۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ {قُلْ مَنْ يَّكْلَؤُكُمْ بِالَّيْلِ …:’’ كَلَأَ يَكْلَؤُ ‘‘} (ف) پہرا دینا، حفاظت کرنا۔ (قاموس) {’’ مِنَ الرَّحْمٰنِ ‘‘} سے مراد {’’مِنْ أَمْرِ الرَّحْمَانِ‘‘} یا {’’مِنْ عَذَابِ الرَّحْمٰنِ‘‘} ہے۔ (طبری وغیرہ) پچھلی آیت میں رسولوں کا مذاق اڑانے والی گزشتہ اقوام کو اللہ تعالیٰ کے عذاب کے گھیر لینے کا ذکر تھا، اس آیت میں موجود کفار سے خطاب ہے کہ وہ کون ہے جو رات یا دن کسی وقت آنے والے رحمان کے عذاب سے تمھاری حفاظت کرتا ہے؟ درحقیقت یہ سوال کفار کو لاجواب کرنے کے لیے ہے، کیونکہ اگر وہ اس کا جواب دیں تو انھیں ماننا پڑے گا کہ دن رات پیش آنے والی بے شمار آفات و مصائب سے اللہ تعالیٰ کے سوا نہ کوئی ان کی حفاظت کرتا ہے اور نہ بچا سکتا ہے، اس لیے وہ اس سوال کا جواب ہی نہیں دیں گے۔ {’’ بَلْ هُمْ عَنْ ذِكْرِ رَبِّهِمْ مُّعْرِضُوْنَ ‘‘} بلکہ وہ ایسا جواب دینے سے گریز ہی کریں گے جس میں ان کے رب کا ذکر آئے۔ (التسہیل) زمخشری نے فرمایا: ’’بلکہ انھوں نے اپنے رب کے ذکر (یاد یا نصیحت) ہی سے منہ موڑ رکھا ہے، وہ اس کے عذاب سے کیا ڈریں گے۔‘‘ ¤ ➋ ابن کثیر رحمہ اللہ نے {’’ مِنَ الرَّحْمٰنِ ‘‘} کا معنی {’’ بَدْلَ الرَّحْمَانِ ‘‘} فرمایا ہے، یعنی وہ کون ہے جو دن رات میں آنے والی بے شمار آفات سے رحمان کے بجائے تمھاری حفاظت کرتا ہو؟ ظاہر ہے ایسا کوئی نہیں۔ ¤ ➌ { ’’ الرَّحْمٰنِ ‘‘} کے لفظ میں اشارہ ہے کہ رات دن میں پیش آنے والی بے شمار آفات و حوادث سے تمام انسانوں حتیٰ کہ کفار کی بھی ایک وقت تک حفاظت کرنا اللہ تعالیٰ کی صفت رحمت کا نتیجہ ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ لَهٗ مُعَقِّبٰتٌ مِّنْۢ بَيْنِ يَدَيْهِ وَ مِنْ خَلْفِههٖ يَحْفَظُوْنَهٗ مِنْ اَمْرِ اللّٰهِ }» [ الرعد : ۱۱ ] ’’اس کے لیے اس (انسان) کے آگے اور اس کے پیچھے یکے بعد دیگرے آنے والے کئی پہرے دار ہیں، جو اللہ کے حکم (یعنی عذاب اور دوسری آفات) سے اس کی حفاظت کرتے ہیں۔‘‘ ¤ ➍ {’’ قُلْ مَنْ يَّكْلَؤُكُمْ ‘‘} میں کفار کو مخاطب فرمایا، پھر نفرت کے اظہار کے لیے انھیں غائب کے صیغے سے ذکر فرمایا کہ {’’ بَلْ هُمْ عَنْ ذِكْرِ رَبِّهِمْ مُّعْرِضُوْنَ ‘‘} یعنی یہ خطاب کے قابل ہی نہیں۔ اسے التفات کہتے ہیں، اس کی ایک اور مثال کے لیے دیکھیے سورۂ یونس (۲۲)۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ { اَمْ لَهُمْ اٰلِهَةٌ تَمْنَعُهُمْ مِّنْ دُوْنِنَا : ’’ اَمْ ‘‘} کا عطف اس سے پہلے محذوف جملہ استفہامیہ پر ہوتا ہے۔ (بقاعی) یعنی کیا حقیقت وہی ہے جو اوپر گزری کہ ہمارے عذاب سے انھیں کوئی بچانے والا نہیں، یا ہمارے سوا ان کے کوئی ایسے معبود ہیں جو ان کو بچاتے اور ان کا دفاع کرتے ہیں؟ {’’ مِنْ دُوْنِنَا ‘‘} کا ایک معنی یہ بھی ہو سکتا ہے کہ ’’یا ان کے کوئی ایسے معبود ہیں جو ہمارے مقابلے میں ان کو بچاتے اور ان کا دفاع کرتے ہیں۔‘‘ ¤ ➋ {لَا يَسْتَطِيْعُوْنَ نَصْرَ اَنْفُسِهِمْ :} یہ اس کا رد ہے کہ ان کے معبود انھیں بچا سکتے ہیں، یعنی ان کے بنائے ہوئے معبود اپنی مدد نہیں کر سکتے تو ان کی یا کسی اور کی کیا مدد کریں گے؟ ¤ ➌ { وَ لَا هُمْ مِّنَّا يُصْحَبُوْنَ :} ’’اور نہ ہماری طرف سے ان کا ساتھ دیا جاتا ہے‘‘ یہ کفار کے اس عقیدے کا رد ہے کہ ہمارے معبود ہمیں بچانے کی طاقت نہ بھی رکھتے ہوں تو انھیں اللہ تعالیٰ کی تائید اور اس کا ساتھ حاصل ہے، جس کی بدولت وہ جو چاہیں کروا لیتے ہیں۔ اللہ تعالیٰ نے فرمایا کہ ان کے معبود نہ خود اپنی مدد کر سکتے ہیں اور نہ انھیں ہمارا کسی قسم کا ساتھ یا تائید حاصل ہے۔ اس کے قریب معنی والی آیت دیکھیے سورۂ زمر (۳)۔ (ابن عاشور)"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ { بَلْ مَتَّعْنَا هٰۤؤُلَآءِ وَ اٰبَآءَهُمْ …:} یعنی ان کے اللہ تعالیٰ کے عذاب سے بے پروا ہونے، پیغمبر کا مذاق اڑانے اور جلدی عذاب لانے کا مطالبہ کرنے کی وجہ یہ ہے کہ ہم نے ان پر جو مہربانی کی، انھیں اور ان کے آبا و اجداد کو دنیا کے سازو سامان سے فائدہ اٹھانے کا جو موقع دیا تو اس پر احسان مند ہونے کے بجائے اس غلط فہمی میں پڑ گئے کہ یہ نعمت ہمیشہ رہے گی، کبھی زائل نہ ہو گی، جیسا کہ فرمایا : «{ اَوَ لَمْ تَكُوْنُوْۤا اَقْسَمْتُمْ مِّنْ قَبْلُ مَا لَكُمْ مِّنْ زَوَالٍ }» [ إبراہیم : ۴۴ ] ’’اور کیا تم نے اس سے پہلے قسمیں نہ کھائی تھیں کہ تمھارے لیے کوئی بھی زوال نہیں۔‘‘ اور پھر ہوتے ہوتے اپنی خوش حالی میں اس قدر مست ہو گئے کہ سرے سے بھول ہی گئے کہ ان کے اوپر کوئی ان کا رب بھی ہے، جو جب چاہے عذاب بھیج کر ان کا نام و نشان مٹا سکتا ہے۔ ¤ ➋ { اَفَلَا يَرَوْنَ اَنَّا نَاْتِي الْاَرْضَ نَنْقُصُهَا مِنْ اَطْرَافِهَا …:} یعنی کیا یہ مشرکین جو عذاب جلدی لانے کا مطالبہ کرتے ہیں اس عذاب کے آثار اپنی آنکھوں سے نہیں دیکھ رہے کہ ہم ان کی زمین کی طرف پیش قدمی کرتے ہوئے اسے مسلسل کم کرتے چلے آ رہے ہیں۔ مسلمان شہروں پر شہر اور علاقوں پر علاقے فتح کرتے چلے جا رہے ہیں اور وہ وقت آ رہا ہے کہ ان کی مقبوضہ زمین گھٹتے گھٹتے ساری کی ساری ان کے قبضے سے نکل جائے گی، تو کیا پھر بھی یہی غالب ہوں گے؟ زمین کو اس کے کناروں سے کم کرتے چلے آنے کا ایک مطلب یہ ہے کہ زمین سے مراد زمین کے رہنے والے ہیں، جیسا کہ فرمایا : «{ وَ سْـَٔلِ الْقَرْيَةَ الَّتِيْ كُنَّا فِيْهَا }» [ یوسف : ۸۲ ] ’’اور اس بستی سے پوچھ لیجیے جس میں ہم تھے۔‘‘ یہاں بستی سے مراد بستی میں رہنے والے ہیں۔ یعنی کیا یہ کافر ہماری زبردست قدرت اپنی آنکھوں سے نہیں دیکھ رہے کہ بے سروسامان اور مظلوم و مقہور مسلمانوں کی تعداد بڑھتی چلی جا رہی ہے اور ان سرداروں کے ساتھی مسلمان ہوتے جا رہے ہیں، جس سے کفار کی تعداد روز بروز کم ہوتی جارہی ہے، جو آخر کار ختم ہو جانے والی ہے۔ تیسرا مطلب اس کا یہ ہے کہ کیا یہ لوگ ہماری زبردست قدرت نہیں دیکھتے کہ ہم آسمانی اور زمینی آفات مثلاً طوفانوں، سیلابوں، زلزلوں، آتش فشاں پہاڑوں کی ہلاکت خیزیوں، جنگوں، وباؤں اور دوسرے عذابوں کی صورت میں ہزاروں لاکھوں لوگوں کو ہلاک کرکے آباد زمینوں کو بے آباد کر دیتے ہیں؟ ان کے اردگرد ہود علیہ السلام ، صالح علیہ السلام ، لوط علیہ السلام اور قوم سبا کی برباد شدہ بستیاں ان کی آنکھوں کے سامنے ہیں، بھلا ہماری اس عظیم الشان قوت کے مقابلے میں یہ لوگ غالب ا ٓسکتے ہیں؟ پہلا مطلب الفاظ کے بہت قریب ہے، مگر سورت مکی ہونے کی وجہ سے آخری دو مطلب بیان کیے گئے ہیں، کیونکہ مکہ میں مسلمانوں کی فتوحات کا سلسلہ شروع نہیں ہوا تھا۔ مزید دیکھیے سورۂ رعد (۴۱)۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ { قُلْ اِنَّمَاۤ اُنْذِرُكُمْ بِالْوَحْيِ :} یعنی آپ ان سے کہہ دیں کہ میرا کام تو وحی کے مطابق تمھیں اللہ کے عذاب سے ڈرانا ہے، عذاب لانا نہیں۔ وہ صرف اللہ تعالیٰ کے ہاتھ میں ہے اور فوراً عذاب لانا اس کی کونی اور شرعی حکمتوں کے خلاف ہے، کیونکہ اس سے آزمائش کا مقصد فوت ہوتا ہے۔ ¤ ➋ { وَ لَا يَسْمَعُ الصُّمُّ الدُّعَآءَ :} بہروں سے مراد کفار ہیں جنھیں حق سنائی ہی نہیں دیتا۔ الف لام عہد کا ہے، اس لیے ترجمہ ’’یہ بہرے‘‘ کیا گیا ہے۔ آیت کے شروع میں کفار کو مخاطب فرمایا کہ ’’میں تو تمھیں وحی کے ساتھ ڈراتا ہوں‘‘ پھر فرمایا ’’یہ بہرے پکار نہیں سنتے‘‘، بعد میں انھیں غائب کے صیغے سے ذکر فرمایا کہ یہ لوگ مخاطب کرنے کے اہل ہی نہیں، یہ التفات ہے۔ ¤ ➌ { اِذَا مَا يُنْذَرُوْنَ :} ’’جب ڈرائے جاتے ہیں‘‘ کے الفاظ سے ان کے بہرے پن کی شدت بیان کرنا مقصود ہے، کیونکہ بہرہ تو کوئی بھی بات نہیں سنتا، خواہ ڈرانے کی ہو یا خوش خبری کی، مگر عام دستور ہے کہ ڈرانے کے وقت زیادہ سے زیادہ اونچی آواز کے ساتھ پکارا جاتا ہے۔ تو جو بہرہ اتنی بلند پکار نہ سنے وہ کوئی اور آواز کیا سنے گا؟"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { وَ لَىِٕنْ مَّسَّتْهُمْ نَفْحَةٌ … : ’’ نَفْحَةٌ ‘‘} کسی چیز کا ایک دفعہ کا تھوڑا سا حصہ، مثلاً ہوا کا ہلکا سا جھونکا، آگ یا گرمی کی معمولی سی لپٹ، خوشبو کی ہلکی سی لپٹ۔یعنی آج تو یہ لوگ تکبر کی وجہ سے بہرے ہو رہے ہیں مگر جلد ہی ان کی یہ حالت بدل جائے گی اور عذاب کا تو ذکر ہی کیا، اگر صرف ایک مرتبہ اس کی ذرا سی لپٹ انھیں چھو بھی گئی تو ساری شیخی ختم ہو جائے گی اور واویلا کرنے لگیں گے، مگر اس وقت چیخ پکار کچھ فائدہ نہ دے گی۔ کفار کا عذاب دیکھتے ہی اپنے ظالم ہونے کا اقرار قرآن مجید میں کئی جگہ مذکور ہے۔ دیکھیے سورۂ مومن (۸۴، ۸۵)۔ ¤ ➋ ہلکے سے ہلکے عذاب سے ان کی یہ حالت ہونے کی تصویر کشی کے لیے تین مبالغے استعمال کیے گئے۔ لفظ{ ’’مَسّ‘‘ } (چھونا) اور {’’ نَفْحَةٌ ‘‘} کا لفظ، جس کا معنی کسی بھی چیز کا کم از کم ہونا ہے اور {’’ نَفْحَةٌ ‘‘} میں ’’ تاء ‘‘ جو ایک مرتبہ کے مفہوم کو واضح کرتی ہے۔ (زمخشری)"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {وَ نَضَعُ الْمَوَازِيْنَ الْقِسْطَ … :} پچھلی آیات میں ذکر ہوا ہے کہ کفار کے پاس جب تک قدرت رہتی ہے وہ عدل و انصاف سے کنارہ کش اور ظلم و جور پر تلے رہتے ہیں اور اختیار ختم ہوتے ہی حق کا اعتراف کرنے لگتے ہیں، اس آیت میں فرمایا کہ اللہ تعالیٰ کا معاملہ اس طرح نہیں، وہ ہمیشہ {’’قَائِمًا بِالْقِسْطِ‘‘} انصاف پر قائم ہے، حتیٰ کہ قیامت کے دن بھی وہ انصاف کے ترازو قائم فرمائے گا، پھر کسی جان پر کچھ ظلم نہیں ہو گا۔ (بقاعی) ¤ ➋ {’’ الْمَوَازِيْنَ ‘‘ ’’مِيْزَانٌ‘‘} کی جمع ہے۔ {’’ الْقِسْطَ ‘‘} مصدر ہے جو اسم فاعل{ ’’مُقْسِطٌ‘‘ } کے معنی میں ہے اور {’’ الْمَوَازِيْنَ ‘‘} کی صفت ہے، جیسے مبالغے کے لیے عادل آدمی کو {’’رَجُلٌ عَدْلٌ‘‘} کہہ لیتے ہیں، یعنی اتنا عادل آدمی کہ سراپا عدل ہے۔ یعنی ہم ایسے ترازو رکھیں گے جو اتنے انصاف والے ہیں گویا عین انصاف ہیں۔ موصوف واحد ہو یا تثنیہ یا جمع، مذکر ہو یا مؤنث، اگر اس کی صفت مصدر ہو تو وہ سب کے لیے ایک جیسی ہوتی ہے۔ {’’ الْقِسْطَ ‘‘} مفعول لہ بھی ہو سکتا ہے، یعنی ہم انصاف کے لیے بہت سے ترازو رکھیں گے۔ ¤ ➌ {’’ الْمَوَازِيْنَ ‘‘} سے معلوم ہوا کہ قیامت کے دن متعدد ترازو ہوں گے، جن کے ساتھ اعمال کا وزن کیا جائے گا، پھر یا تو ہر آدمی کے لیے الگ ترازو ہو گا یا ہر عمل کے لیے۔ نیز دیکھیے سورۂ اعراف (۷)۔ ¤ ➍ { فَلَا تُظْلَمُ نَفْسٌ شَيْـًٔا :} ’’پھر کسی شخص پر کچھ ظلم نہیں کیا جائے گا‘‘ یعنی نہ نیکیوں میں کچھ کمی آئے گی اور نہ برائیوں میں کوئی اضافہ ہو گا۔ ¤ ➎ { وَ اِنْ كَانَ مِثْقَالَ حَبَّةٍ … :} اس کی تفسیر کے لیے دیکھیے سورۂ زلزال (۷، ۸) اور لقمان (۱۶)۔ ¤ ➏ {وَ كَفٰى بِنَا حٰسِبِيْنَ :} ہم حساب لینے والے کافی ہیں، ہمیں کسی مدد گار کی ضرورت نہیں، پھر نہ ہمارے حساب کے بعد کسی پڑتال کی گنجائش ہے اور نہ کہیں اپیل ہو سکتی ہے۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ { وَ لَقَدْ اٰتَيْنَا مُوْسٰى وَ هٰرُوْنَ …:} سورت کے شروع سے توحید، نبوت اور قیامت پر بات چلی آ رہی ہے، اب چند انبیاء کے واقعات کا آغاز ہوتا ہے۔ مقصد رسول اللہ صلی اللہ علیہ وسلم کو تسلی دینا ہے کہ ان انبیاء کی طرح آپ بھی پوری تن دہی سے دعوت کا فریضہ سرانجام دیتے رہیں اور اس راہ میں آنے والی ہر مشکل میں صبر و استقامت سے کام لیں، اس کے علاوہ اس بات کی تفصیل ہے کہ پہلے تمام انبیاء بشر تھے۔ اس سلسلے میں سب سے پہلے موسیٰ اور ہارون علیھما السلام کا ذکر فرمایا۔ قرآن مجید میں اکثر موسیٰ علیہ السلام اور نبی کریم صلی اللہ علیہ وسلم کا اور دونوں کی کتابوں کا ذکر اکٹھا آتا ہے، کیونکہ دعوت کے ساتھ جہاد کا سلسلہ موسیٰ علیہ السلام سے شروع ہوتا ہے اور دعوت کے سلسلے میں دونوں کے درمیان بڑی مماثلت ہے۔ ¤ ➋ {الْفُرْقَانَ وَ ضِيَآءً وَّ ذِكْرًا لِّلْمُتَّقِيْنَ : ’’ الْفُرْقَانَ ‘‘} اور {’’ اَلْفَرْقُ ‘‘} کا معنی ایک ہی ہے، الف اور نون کی وجہ سے معنی میں مبالغہ پیدا ہو گیا ہے، یعنی حق و باطل کے درمیان خوب فرق کرنے والی چیز۔ اس سے مراد تورات بھی ہے، معجزے اور جادو کے درمیان فرق کرنے والے معجزے بھی اور موسیٰ اور ہارون علیھما السلام اور بنی اسرائیل کو فرعونیوں پر حاصل ہونے والی فتح و نصرت بھی، جیسا کہ اللہ تعالیٰ نے یوم بدر کو یوم الفرقان قرار دیا۔ گویا {’’ الْفُرْقَانَ ‘‘} کتاب، معجزات اور نصرتِ الٰہی تینوں کی صفت ہو سکتی ہے، کیونکہ تینوں ہی حق و باطل کے درمیان فرق کرنے والی چیز ہیں۔ اسی طرح {’’ ضِيَآءً ‘‘} اور {’’ ذِكْرًا لِّلْمُتَّقِيْنَ ‘‘} بھی تینوں کی صفت ہیں، کیونکہ تورات، معجزات اور نصرتِ الٰہی تینوں حق و باطل کے درمیان فرق کرنے والی بھی ہیں، ایمان کی روشنی بھی ہیں اور نصیحت بھی۔ مگر کتاب، معجزات اور نصرتِ الٰہی کے مشاہدے سے حق و باطل کے درمیان فرق، ایمان کی روشنی اور نصیحت اسی کو نصیب ہوتی ہے جو متقی ہو۔ تفصیل کے لیے دیکھیے سورۂ بقرہ کی آیت (۲) کی تفسیر۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ {الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ : } اس کے دو معنی ہیں، ایک یہ کہ وہ اپنے رب کو دیکھے بغیر اس کا شدید خوف رکھتے ہیں اور دوسرا یہ کہ لوگوں کی نگاہوں سے غائب ہونے کی حالت میں بھی وہ اپنے رب سے بہت ڈرتے ہیں۔ ان کے کسی عمل سے مقصود نہ ریا ہے اور نہ لوگوں کی طعن تشنیع سے بچنا، بلکہ ان کے ہر عمل کا باعث صرف اپنے رب کی خشیت ہے۔ ¤ ➋ {وَ هُمْ مِّنَ السَّاعَةِ مُشْفِقُوْنَ :} یہ جملہ اسمیہ ہے جس میں دوام پایا جاتا ہے، ’’اشفاق‘‘ کا معنی ہے کسی آنے والے حادثے کا شدید کھٹکا، یعنی انھیں ہر وقت قیامت کا کھٹکا لگا رہتا ہے اور وہ ہمیشہ اس سے ڈرتے رہتے ہیں۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ {وَ هٰذَا ذِكْرٌ مُّبٰرَكٌ اَنْزَلْنٰهُ : ’’ هٰذَا ‘‘} (یہ) سے مراد قرآن مجید ہے، سامعین کے ذہن میں حاضر ہونے کی وجہ سے اس کی طرف {’’ هٰذَا ‘‘} کے ساتھ اشارہ فرمایا ہے۔ {’’ ذِكْرٌ ‘‘} یعنی یہ نصیحت ہے اور یاد دہانی بھی۔ {’’ مُبٰرَكٌ ‘‘} جس میں بہت برکت، یعنی بے شمار بھلائیاں ہیں اور ہم نے (اللہ تعالیٰ نے اپنی عظمت کے اظہار کے لیے جمع متکلم کا صیغہ استعمال فرمایا ہے) اسے نازل کیا ہے۔ ¤ ➋ { اَفَاَنْتُمْ لَهٗ مُنْكِرُوْنَ :} ہم نے موسیٰ اور ہارون علیھما السلام کو تورات اور معجزات عطا کیے، تم لوگ انھیں مانتے ہو تو یہ بابرکت ذکر یعنی قرآن بھی ہم نے ہی نازل کیا ہے، پھر کیا وجہ ہے کہ تم اسے نہیں مانتے؟"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ {وَ لَقَدْ اٰتَيْنَاۤ اِبْرٰهِيْمَ رُشْدَهٗ … : ’’رُشْدٌ‘‘} ہدایت اور سیدھا راستہ، یہ لفظ {’’غَيٌّ‘‘} کے مقابلے میں آتا ہے، جیسا کہ فرمایا : «{ قَدْ تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ}» [ البقرۃ : ۲۵۶ ] ’’بلاشبہ ہدایت گمراہی سے صاف واضح ہو چکی۔‘‘ اور سمجھ بوجھ اور ہوش مندی کے معنی میں بھی، جیسا کہ فرمایا : «{ فَاِنْ اٰنَسْتُمْ مِّنْهُمْ رُشْدًا }» [ النساء : ۶ ] ’’پھر اگر تم ان سے کچھ سمجھ داری معلوم کرو۔‘‘ {’’ رُشْدَهٗ ‘‘} یعنی وہ سمجھ بوجھ جو اس کے لائق تھی۔ ¤ ➋ { مِنْ قَبْلُ :} یعنی موسیٰ اور ہارون علیھما السلام سے پہلے یا نبوت عطا کرنے سے پہلے۔ بعض نے کہا غار سے نکلنے کے بعد۔ تفصیل کے لیے دیکھیے سورۂ انعام(۷۵ تا ۷۹)۔ ¤ ➌ { وَ كُنَّا بِهٖ عٰلِمِيْنَ :} یعنی ہم اسے جانتے تھے کہ ہم نے اس میں کیا کیا خوبیاں اور صلاحیتیں رکھی تھیں۔ ابراہیم علیہ السلام کی جتنی بھی خوبیاں بیان کر لی جائیں اللہ تعالیٰ کی یہ شہادت ان سب سے بڑھ کر ہے۔ یہ منصب عطا ہی اسے ہوتا ہے جو اللہ کے علم میں اس کا اہل ہو، فرمایا : «{اَللّٰهُ اَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهٗ }» [ الأنعام : ۱۲۴ ] ’’اللہ زیادہ جاننے والا ہے جہاں وہ اپنی رسالت رکھتا ہے۔‘‘"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ {اِذْ قَالَ لِاَبِيْهِ وَ قَوْمِهٖ …: ’’ التَّمَاثِيْلُ ‘‘ ’’تِمْثَالٌ‘‘} کی جمع ہے، اللہ تعالیٰ کی کسی مخلوق کی مثل بنائی ہوئی صورت، مجسمہ۔ بت پرست عموماً انسانوں کے مجسموں کی پوجا کرتے ہیں۔ یہ ہے وہ سمجھ بوجھ جو موسیٰ علیہ السلام سے پہلے اللہ تعالیٰ نے ابراہیم علیہ السلام کو عطا فرمائی تھی، یعنی اللہ تعالیٰ کی توحید کا ححق ہونا اور بتوں اور دوسرے تمام معبودوں کا باطل ہونا۔ ابراہیم علیہ السلام کی قوم بت پرست بھی تھی، ستارے، چاند اور سورج کی پرستش بھی کرتی تھی اور بادشاہ کو بھی رب مانتی تھی۔ ستارے، چاند اور سورج کے معبود نہ ہونے کے لیے ابراہیم علیہ السلام کی نہایت مدلل، مؤثر اور لاجواب دعوت سورۂ انعام (۷۶ تا ۸۳) میں ملاحظہ فرمائیں۔ بادشاہ کے رب نہ ہونے کی دعوت سورۂ بقرہ (۲۵۸) میں ملاحظہ فرمائیں۔ یہاں بتوں کے بے اختیار ہونے کی تبلیغ اور اس کا عملی اظہار فرمایا ہے۔ ¤ ➋ {مَا هٰذِهِ التَّمَاثِيْلُ …: ’’ هٰذِهِ ‘‘} کا اشارہ بتوں کی تحقیر کے لیے ہے۔ ابراہیم علیہ السلام نے نادان بنتے ہوئے اپنے باپ اور اپنی قوم سے بتوں کا تذکرہ نہایت تحقیر کے ساتھ کرتے ہوئے پوچھا : ’’یہ مورتیاں جن کے تم مجاور بنے بیٹھے ہو، کیا چیز ہیں؟‘‘ گویا ابراہیم علیہ السلام ان کو کوئی چیز ماننے ہی پر تیار نہ تھے، کیونکہ وہ نہ سنتے تھے اور نہ کوئی فائدہ یا نقصان پہنچا سکتے تھے۔ دیکھیے سورۂ مریم (۴۲)۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) { قَالُوْا وَجَدْنَاۤ اٰبَآءَنَا …:} ابراہیم علیہ السلام کے والد اور ان کی قوم کے پاس بتوں کی عبادت کی کوئی عقلی یا نقلی دلیل نہ تھی، اس لیے انھوں نے تقلید کا سہارا لیا اور کہا کہ ہم نے اپنے باپ داد اکو ان کی عبادت کرنے والے پایا ہے، حالانکہ باپ دادا سیدھے راستے پر ہوں تو بے شک ان کے پیچھے چلو، لیکن اگر وہ غلط راستے پر ہوں تو غلط راستے پر چلتے جانا کہاں کی دانش مندی ہے؟"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) { قَالَ لَقَدْ كُنْتُمْ اَنْتُمْ وَ اٰبَآؤُكُمْ فِيْ ضَلٰلٍ مُّبِيْنٍ :} اس کا یہ معنی نہیں کہ تم اور تمھارے باپ دادا ماضی میں گمراہی میں مبتلا تھے اب نہیں، بلکہ {’’كَانَ‘‘} دوام اور استمرار کے لیے ہے اور {’’ فِيْ ‘‘} ان کے گمراہی میں بری طرح پھنسے ہونے کے اظہار کے لیے ہے، جیسا کہ ابوالسعود نے فرمایا : {’’ وَ مَعْنٰي’’ كُنْتُمْ ‘‘ مُطْلَقُ اِسْتِقْرَارِهِمْ عَلَي الضَّلاَلِ لاَ اسْتِقْرَارُهُمُ الْمَاضِيْ الْحَاصِلُ قَبْلَ زَمَانِ الْخِطَابِ الْمُتَنَاوِلِ لَهُمْ وَلِآبَائِهِمْ‘‘} خلاصہ یہ کہ ابراہیم علیہ السلام نے واشگاف الفاظ میں فرما دیا کہ بلاشبہ یقینا تم اور تمھارے باپ دادا پہلے بھی کھلی گمراہی میں مبتلا تھے اور اب بھی مسلسل ایسے ہی چلے آرہے ہو۔ کیونکہ بت پرستی سے بڑھ کر کھلی گمراہی اور کیا ہو سکتی ہے؟"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) { قَالُوْۤا اَجِئْتَنَا بِالْحَقِّ … :} قوم کو بت پرستی کے حق ہونے کا اتنا یقین تھا کہ وہ سوچ ہی نہ سکتے تھے کہ کوئی شخص اسے کھلی گمراہی قرار دے سکتا ہے۔ علاوہ ازیں ابراہیم علیہ السلام جیسے حسن اخلاق والے شخص سے (جو کوئی ایسی بات کہتا ہی نہیں جو کسی کو ناگوار گزرے) صاف گمراہی کا فتویٰ سن کر انھیں یقین نہ آیا کہ ابراہیم علیہ السلام یہ بات سنجیدگی سے کہہ رہے ہیں۔ وہ سمجھے کہ آپ مذاق کر رہے ہیں، اس لیے انھوں نے پوچھا کہ آپ یہ حقیقت بیان کر رہے ہیں یا دل لگی کر رہے ہیں؟"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ {قَالَ بَلْ رَّبُّكُمْ … : ’’ بَلْ ‘‘} (بلکہ) سے پہلے کلام کا کچھ حصہ محذوف ہے جو خود بخود سمجھ میں آ رہا ہے، یعنی میں یہ بات مذاق سے نہیں بلکہ پوری سنجیدگی سے کہہ رہا ہوں کہ یہ مورتیاں اور مجسّمے رب نہیں ہیں بلکہ تمھارا رب صرف وہ ہے جو تمام آسمانوں کا اور زمین کا رب ہے۔{’’ رَبُّكُمْ رَبُّ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} مبتدا اور خبر دونوں کے معرفہ ہونے سے حصر کا معنی پیدا ہو رہا ہے۔ ¤ ➋ { وَ اَنَا عَلٰى ذٰلِكُمْ مِّنَ الشّٰهِدِيْنَ :} یعنی میں یہ بات دلیل سے ثابت کر سکتا ہوں، تمھاری طرح نہیں کہ آبا و اجداد کی تقلید کے سوا میرے پاس کوئی دلیل ہی نہ ہو (کیونکہ شہادت اسی بات کی دی جاتی ہے جس کا انسان کو یقینی علم ہو، جب کہ تقلید اور علم ایک دوسرے کے منافی ہیں)۔ (رازی)"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) ➊ { وَ تَاللّٰهِ لَاَكِيْدَنَّ اَصْنَامَكُمْ … :} ابراہیم علیہ السلام نے زبان سے بتوں کی تردید کے بعد سمجھا کہ ان لوگوں کو زبانی سمجھانا کافی نہیں بلکہ ان کے دماغوں میں ان بتوں کی خدائی اور مشکل کشائی کا جما ہوا عقیدہ ختم کرنا ایک زبردست عملی کارروائی کے بغیر ممکن نہیں، جس سے ان کی بے بسی صاف واضح ہو جائے۔ چونکہ ان تک پہنچنا اور کارروائی کرنا آسان نہ تھا، تو اس کام کے لیے انھوں نے اس دن کا انتخاب فرمایا جب سب لوگوں کے جشن پر جانے سے کارروائی کا موقع مل سکتا تھا۔ دیکھیے سورۂ صافات (۸۸ تا ۹۰)۔ ¤ ➋ ابراہیم علیہ السلام نے بتوں کے باطل ہونے کو عمل سے ثابت کرنے سے پہلے اللہ کی قسم کھا کر اپنے ارادے کا اعلان فرمایا۔ کچھ لوگ پختہ قبروں یا آستانوں اور بتوں کو خفیہ طریقے سے توڑ دیتے ہیں اور روپوش ہو جاتے ہیں اور اپنے اس عمل کو سنتِ ابراہیمی قرار دیتے ہیں، لیکن اگر واقعی وہ سنت ابراہیمی کے پیروکار ہیں تو انھیں چاہیے کہ اعلان کرکے یہ کام کریں، تاکہ اس کے نتیجے کے ذمہ دار بھی خود بنیں اور ابراہیم علیہ السلام جیسی استقامت دکھائیں۔ یہ نہیں کہ کرے کوئی اور بھرے کوئی۔ ¤ ➌ بعض مفسرین نے لکھا ہے کہ ابراہیم علیہ السلام نے یہ بات دل میں کہی۔ بعض نے لکھا ہے کہ جب سب لوگ چلے گئے تو انھوں نے ایک آدھ آدمی کی موجودگی میں یہ بات کہی۔ حقیقت یہ ہے کہ یہ سب اسرائیلیات ہیں۔ قرآن مجید نے صاف الفاظ میں ان کے اپنے والد اور قوم کے سامنے یہ بات کہنے کا ذکر فرمایا ہے۔ مگر قوم کے وہم و گمان میں بھی نہ تھا کہ ایسا بھی ہو سکتا ہے، اس لیے انھوں نے اس کی پروا نہیں کی۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) ➊ { فَجَعَلَهُمْ جُذٰذًا: ’’ جُذٰذًا ‘‘ ’’جَذَّ يَجُذُّ‘‘} (قطع کرنا اور ریزہ ریزہ کرنا) میں سے{ ’’فُعَالٌ‘‘} بمعنی مفعول ({مَجْذُوْذٌ}) ہے، یعنی ریزہ ریزہ، ٹکڑے ٹکڑے۔ اسی کے ہم وزن اور ہم معنی {’’حُطَامٌ‘‘} اور {’’فُتَاتٌ‘‘} ہیں۔ ابراہیم علیہ السلام کی قوم کے لوگ اپنے خاص جشن کے موقع پر گھروں سے باہر نکلتے اور سارا دن جشن مناتے، چنانچہ انھوں نے ابراہیم علیہ السلام کو بھی اپنے ساتھ چلنے کی دعوت دی مگر انھوں نے بیماری کا عذر کر لیا۔ (صافات : ۸۸ تا ۹۰) ابراہیم علیہ السلام موقع پا کر بت خانے کے اندر داخل ہو گئے، پہلے ان سے کچھ خطاب کیا، جس کا تذکرہ سورۂ صافات میں ہے، جواب نہ پا کر پوری قوت سے انھیں توڑنا شروع کر دیا اور ایک کے سوا سب کو ٹکڑے ٹکڑے کر دیا۔ یہاں اکثر مفسرین نے لکھا ہے کہ ابراہیم علیہ السلام نے سب کو توڑ کر کلہاڑا بڑے بت کے کندھے پر رکھ دیا، مگر یہ محض اسرائیلی روایت ہے، قرآن یا حدیث میں اس کا کہیں ذکر نہیں۔ پھر پتھر کے بت توڑنے کے لیے کلہاڑے کے بجائے ہتھوڑا استعمال ہوتا ہے۔ ہاں اگر لکڑی کے بت ہوں تو الگ بات ہے۔ اللہ بہتر جانتا ہے ابراہیم علیہ السلام نے ان بتوں کو کیسے ٹکڑے ٹکڑے کیا اور اس کے لیے صرف ایک ہتھیار استعمال کیا یا جس جس اوزار کی ضرورت تھی سب استعمال فرمائے۔ ¤ ➋ {اِلَّا كَبِيْرًا لَّهُمْ:’’ كَبِيْرًا ‘‘} نکرہ ہے، سوائے ان کے ایک بڑے کے۔ معلوم ہوا کہ ان کے بڑے بت کئی تھے، مگر ابراہیم علیہ السلام نے ایک بڑے کے سوا چھوٹے بڑے تمام بتوں کو ٹکڑے ٹکڑے کر دیا۔ اس کی تائید آئندہ آیت(۶۳) {’’ قَالَ بَلْ فَعَلَهٗ كَبِيْرُهُمْ ‘‘} سے بھی ہوتی ہے کہ ’’یہ کام ان کے اس بڑے نے کیا ہے۔‘‘ معلوم ہوا کہ اس بڑے کے سوا اور بھی بڑے بت تھے جو اپنے انجام کو پہنچ چکے تھے۔ (بقاعی) جو لوگ اسے ان کے سب بتوں سے بڑا بت قرار دیتے ہیں قرآن کے الفاظ ان کا ساتھ نہیں دیتے۔ ¤ ➌ ’’سوائے ان کے ایک بڑے کے‘‘ سے معلوم ہوا کہ اللہ تعالیٰ نے مشرکوں یا ان کے معبودوں کو ’’کبیر‘‘ نہیں فرمایا، ہاں ’’ان کے ہاں کبیر‘‘ فرمایا ہے، کیونکہ وہ اسے کبیر مانتے تھے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اسلام کی دعوت کا خط بھیجتے ہوئے لکھا : [ اِلٰی هِرَقْلَ عَظِيْمِ الرُّوْمِ ] دیکھیے ہرقل کو صرف رومیوں کے ہاں عظیم فرمایا ہے، کافر کو مطلقاً عظیم نہیںـ فرمایا۔ (سعدی) ¤ ➍ { لَعَلَّهُمْ اِلَيْهِ يَرْجِعُوْنَ :} ان کے ایک بڑے بت کو کچھ نہیں کہا، تاکہ جب وہ سب بتوں کو ٹوٹا ہوا اور اسے صحیح سلامت دیکھیں تو اس سے پوچھیں کہ جناب آپ کے غصے کا باعث کیا ہوا کہ آپ نے ان سب خداؤں کو ٹکڑے ٹکڑے کر دیا اور اگر آپ نے یہ کام نہیں کیا تو آپ کے ہوتے ہوئے کوئی ظالم یہ کام کیسے کر گیا؟ ایک معنی اس کا یہ بھی ہو سکتا ہے کہ ابراہیم علیہ السلام نے ایک بڑے کے سوا تمام بت ٹکڑے ٹکڑے کر دیے کہ وہ لوگ جب یہ ماجرا دیکھیں گے تو فوراً ان کا ذہن ابراہیم علیہ السلام ہی کی طرف جائے گا، پھر جب وہ ان سے پوچھیں گے تو انھیں شرک کی تردید کا بہترین موقع مل جائے گا۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) ➊ { قَالُوْا مَنْ فَعَلَ هٰذَا بِاٰلِهَتِنَاۤ :} مشرکوں کے عقل سے عاری ہونے کی کیسی زببردست تصویر ہے۔ کہنے لگے، ہمارے معبودوں کے ساتھ یہ سلوک کس نے کیا ہے؟ سوچا ہی نہیں کہ وہ معبود ہی کیا جو اپنا دفاع بھی نہ کر سکے؟ لطف یہ کہ سب نے یہی کہا کہ کوئی اور ان کے خداؤں کا یہ حال کر گیا ہے۔ قبر پرستوں کا بھی یہی حال ہے: ¤ جو کروٹ بدلنا نہیں جانتے ہیں ¤ انھیں آپ مشکل کشا مانتے ہیں ¤ ➋ { اِنَّهٗ لَمِنَ الظّٰلِمِيْنَ : ’’ إِنَّ ‘‘} اور لام کی تاکید کے ساتھ، بے شک وہ یقینا ظالموں سے ہے کہ اس نے مشکل کشاؤں کی تعظیم کے بجائے ان کا یہ حال کر دیا ہے۔ یا اس لیے کہ مارنے کی بھی کوئی حد ہوتی ہے، اس ظالم نے تو انھیں اتنا مارا ہے کہ ان کا کچھ باقی ہی نہیں چھوڑا اور نہ انھیں ذلیل کرنے میں کوئی کسر رہنے دی ہے۔ (رازی)"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) {قَالُوْا سَمِعْنَا فَتًى يَّذْكُرُهُمْ … : } بتوں کو توڑنے کا مجرم تلاش کرنے میں انھیں کوئی مشکل پیش نہیں آئی۔ جن لوگوں نے وہ تقریر سنی تھی، جو ابراہیم علیہ السلام نے اپنے والد اور قوم کے سامنے کی تھی اور جس میں انھوں نے صاف اعلان کیا تھا کہ اللہ کی قسم! میں ضرور تمھارے بتوں کی خفیہ تدبیر کروں گا، انھوں نے کہا کہ ہم نے ایک جوان کو سنا ہے جو ان (بتوں) کا ذکر کر رہا تھا، اسے ابراہیم کہا جاتا ہے۔ ان مشرکوں کا ابراہیم علیہ السلام کی تحقیر کا انداز دیکھیے، وہ انھیں ابراہیم نامی ایک غیر معروف جوان بتا رہے ہیں، حالانکہ ابراہیم علیہ السلام جیسی شخصیت گمنام ہو ہی نہیں سکتی تھی۔ بھلا سورج یا چاند بھی چھپے رہ سکتے ہیں؟ پھر وہ اس عمل کا باعث ان کی جوانی کو قرار دے رہے ہیں، حالانکہ ان جاہلوں کو معلوم ہی نہیں کہ اس جوان کی جوانی دیوانی نہیں بلکہ ایسی ہوش مند ہے جس پر بے شمار پختہ عمروں کی پختہ عمری قربان ہے۔ {’’ يَذْكُرُهُمْ ‘‘} کی تفسیر کے لیے دیکھیے اسی سورت کی آیت (۳۶)۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) ➊ { قَالُوْا فَاْتُوْا بِهٖ عَلٰۤى اَعْيُنِ النَّاسِ :} کہنے لگے، اگر ایسا ہے تو اسے لوگوں کی آنکھوں کے سامنے لاؤ۔ ¤ ➋ { لَعَلَّهُمْ يَشْهَدُوْنَ:} اس کے دو معنی ہیں، ایک تو یہ کہ اسے لوگوں کے سامنے لاؤ، تاکہ وہ گواہ ہو جائیں کہ یہی شخص ہے جو بتوں کی برائی بیان کرتا تھا اور ان کا بندوبست کرنے کی قسمیں اٹھاتا تھا اور اس کا مجرم ہونا ثابت ہو جائے کہ یہ کام بھی اسی کا ہے اور ہو سکتا ہے کہ کوئی موقع کا گواہ بھی مل جائے، جس نے اسے بت توڑتے ہوئے دیکھا ہو۔ اس سے معلوم ہوا کہ مشرک ہونے کے باوجود وہ لوگ ملزم پر جرم ثابت کرنا ضروری سمجھتے تھے، جو ان کے نزدیک جرم تھا۔ بقاعی رحمہ اللہ لکھتے ہیں : ’’اب اللہ تعالیٰ کی جناب ہی میں ان لوگوں کی شکایت ہے جو (مسلمان ہو کر) اپنے دین کے اکابر کو بغیر کسی دلیل یا تہمت کے پکڑ کر بند کر دیتے ہیں (نہ فرد جرم، نہ کوئی گواہ اور نہ کوئی اور ثبوت، بلکہ اکثر اوقات انھیں بے گناہی کے جرم میں پکڑ لیتے ہیں)۔‘‘ دوسرا معنی یہ ہے کہ اسے لوگوں کے سامنے لاؤ، تاکہ وہ گواہ ہو جائیں اور آنکھوں سے دیکھ لیں کہ اس کے ساتھ کیسا عبرتناک سلوک کیا جاتا ہے، تاکہ آئندہ کسی کو ایسی حرکت کی جرأت نہ ہو۔ وہ تو ابراہیم علیہ السلام کو مجرم ثابت کرنے کے لیے لوگوں کو اکٹھا کر رہے تھے مگر درحقیقت اللہ تعالیٰ کی طرف سے ابراہیم علیہ السلام کی دلی تمنا پوری ہونے کا سامان ہو رہا تھا کہ کسی طرح سب لوگ جمع ہوں تو وہ ان کے سامنے بتوں کی بے بسی اور مشرکوں کی بے عقلی واضح کریں، جیسا کہ موسیٰ علیہ السلام کے لیے عید کے دن دوپہر کے وقت تمام لوگوں کو کھلے میدان میں جمع کرنے کا اہتمام کیا گیا تھا۔ دیکھیے سورۂ طٰہٰ(۵۸، ۵۹)۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 63،62) ➊ { قَالُوْۤا ءَاَنْتَ فَعَلْتَ هٰذَا …:} لوگوں کے سوال کے جواب میں کہ اے ابراہیم! کیا تو نے ہمارے معبودوں کے ساتھ یہ کام کیا ہے؟ ابراہیم علیہ السلام نے ان کے بتوں کی بے بسی و بے چارگی واضح کرنے کے لیے شدید طنز کرتے ہوئے فرمایا : ’’بلکہ یہ کام ان کے اس بڑے نے کیا ہے، سو ان سے پوچھ لو اگر وہ بولتے ہیں۔‘‘ مراد خود ان کے منہ سے اس بات کا اقرار کروانا تھا کہ بت نفع یا نقصان تو دور کی بات ہے بول کر بتا بھی نہیں سکتے کہ ان کا یہ حال زار کون کر گیا ہے۔ {’’فَسْـَٔلُوْهُمْ ‘‘} (سو ان سے پوچھ لو) یعنی صحیح سالم رہنے والے ان کے اس بڑے سے پوچھو کہ اس نے بت کیوں توڑے اور اگر کسی اور نے توڑے ہیں تو اس نے اپنے ساتھیوں کا دفاع کیوں نہیں کیا؟ اور ٹوٹے ہوئے خداؤں سے بھی پوچھو کہ کس نے ان کا یہ حال کیا اور یہ بھی کہ وہ خود یا ان کا بڑا ان کا دفاع کیوں نہیں کر سکے؟ ان کے ایک بڑے بت کو سالم چھوڑنے میں یہ اشارہ بھی معلوم ہوتا ہے کہ کوئی بڑا اپنے ساتھ کسی بڑے یا چھوٹے مدمقابل کو برداشت نہیں کرتا تو رب تعالیٰ جس کی صفت ہی ’’اللہ اکبر‘‘ ہے، اپنے ساتھ کسی شریک کو کیسے برداشت کر سکتا ہے؟ ¤ ➋ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَمْ يَكْذِبْ إِبْرَاهِيْمُ عَلَيْهِ الصَّلاَةُ وَالسَّلاَمُ إِلاَّ ثَلاَثَ كَذِبَاتٍ : ثِنْتَيْنِ مِنْهُنَّ فِیْ ذَاتِ اللّٰهِ عَزَّوَجَلَّ، قَوْلُهُ : «{ اِنِّيْ سَقِيْمٌ }» [الصافات : ۸۹] وَ قَوْلُ : «{ بَلْ فَعَلَهٗ كَبِيْرُهُمْ هٰذَا }» [الأنبياء : ۶۳] وَقَالَ بَيْنَا هُوَ ذَاتَ يَوْمٍ وَسَارَةُ إِذْ أَتَي عَلٰي جَبَّارٍ مِنَ الْجَبَابِرَةِ، فَقِيْلَ لَهُ إِنَّ هَاهُنَا رَجُلاً مَعَهُ امْرَأَةٌ مِنْ أَحْسَنِ النَّاسِ فَأَرْسَلَ إِلَيْهِ فَسَأَلَهُ عَنْهَا فَقَالَ مَنْ هٰذِهِ ؟ قَالَ أُخْتِيْ فَأَتَی سَارَةَ فَقَاالَ يَا سَارَةُ ! لَيْسَ عَلَی وَجْهِ الْأَرْضِ مُؤْمِنٌ غَيْرِيْ وَ غَيْرُكِ ، وَإِنَّ هٰذَا سَأَلَنِيْ عَنْكِ فَأَخْبَرْتُهُ أَنَّكِ أُخْتِيْ فَلاَ تُكَذِّبِيْنِيْ ] [ بخاري، أحادیثث الأنبیاء، باب قول اللہ تعالٰی : { واتخذ اللہ إبراہیم خلیلا } : ۳۳۵۸۔ مسلم : ۲۳۷۱ ] ’’ابراہیم علیہ السلام نے تین دفعہ کے سوا کبھی جھوٹ نہیں کہا، جن میں سے دو اللہ تعالیٰ کی ذات کی خاطر تھے۔ ان کا کہنا : «{ اِنِّيْ سَقِيْمٌ }» [ الصافات : ۸۹] ’’میں بیمار ہوں‘‘اور ان کا یہ کہنا : «{ بَلْ فَعَلَهٗ كَبِيْرُهُمْ هٰذَا }» [ الأنبیاء : ۶۳ ] ’’بلکہ اسے ان کے اس بڑے نے کیا ہے۔‘‘ اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اور ایک دفعہ وہ اور (ان کی بیوی) سارہ سفر کر رہے تھے کہ وہ جابر لوگوں میں سے ایک جابر (کی بستی) کے پاس آئے۔ اسے بتایا گیا کہ یہاں ایک آدمی ہے جس کے ساتھ ایک عورت ہے جو حسین ترین لوگوں سے ہے۔ اس نے ان کی طرف پیغام بھیجا اور اس کے متعلق پوچھا اور کہا : ’’وہ کون ہے ؟ ‘‘کہا : ’’وہ میری بہن ہے۔‘‘ پھر سارہ کے پاس آئے تو کہا، اے سارہ! اس سرزمین پر میرے اور تمھارے سوا کوئی مومن نہیں اور اس نے مجھ سے پوچھا تو میں نے اسے بتایا ہے کہ تو میری بہن ہے، سو مجھے مت جھٹلانا۔‘‘ ¤ بعض لوگوں نے اس حدیث میں ابراہیم علیہ السلام کے تین جھوٹوں کے ذکر کی وجہ سے اس حدیث کا انکار ہی کر دیا کہ ایک صدیق نبی جھوٹ کیسے بول سکتا ہے؟ ایک روشن خیال بزرگ نے تو امام بخاری اور تمام ائمۂ حدیث کے ساتھ اس حدیث کو صحیح کہنے والے حضرات کے متعلق یہاں تک لکھ دیا ہے : ’’ایک گروہ روایت پرستی میں غلو کرکے اس حد تک پہنچ جاتا ہے کہ اسے بخاری و مسلم کے چند راویوں کی صداقت زیادہ عزیز ہے اور اس بات کی پروا نہیں کہ اس سے ایک نبی پر جھوٹ کا الزام عائد ہوتا ہے۔‘‘ ان بزرگوں نے یہ سوچا ہی نہیں کہ اس حدیث کے روایت کرنے والے ائمہ کرام یعنی بخاری، محمد بن محبوب، حماد بن زید اور ابو ہریرہ رضی اللہ عنہ کی صداقت کو عزیز نہ رکھنے کا نتیجہ کیا ہو گا؟ جب ان کی صداقت ہی عزیر نہ رہی تو امت کے اتفاق کے ساتھ {’’ أَصَحُّ الْكُتُبِ بَعْدَ كِتَابِ اللّٰهِ ‘‘} اور دوسری کتب حدیث کی کیا حیثیت رہ جائے گی اور امت کے پاس باقی کیا رہ جائے گا؟ لطف یہ کہ ان بزرگوں نے ائمۂ حدیث کے صدق پر یہ مہربانی بزعم خود منکرین حدیث کے فتنے کے سد باب کے لیے فرمائی ہے۔ بھلا اس کرم فرمائی کے بعد منکرین حدیث کو کسی مزید محنت کی ضرورت باقی رہ جاتی ہے؟ ایک بزرگ نے یہ تک کہہ دیا کہ ’’نبی کو جھوٹا کہنے سے بہتر ہے کہ اس حدیث کے راویوں کو جھوٹا کہہ دیا جائے۔‘‘ سبحان اللہ! ابراہیم علیہ السلام کو جھوٹا کس نے کہا ہے؟ اور آپ حضرات کی دلیری کا کیا کہنا کہ جن راویوں کو پوری امت بالاتفاق سچا قرار دیتی ہے آپ انھیں جھوٹا قرار دے رہے ہیں۔ مجھے تعجب ہوتا ہے کہ اچھے خاصے ذہین حضرات صحیح حدیث اور ائمۂ حدیث پر اتنی جرأت کرتے ہوئے یہ بات نہ سمجھ سکے کہ اس حدیث میں ابراہیم علیہ السلام کو جھوٹا نہیں کہا گیا بلکہ اعلیٰ درجے کا سچا (صدیق) ثابت کیا گیا ہے۔ کیونکہ جس شخص نے پوری زندگی میں ان تین باتوں کے سوا کوئی جھوٹ نہ بولا ہو، جو حقیقت میں جھوٹ ہیں ہی نہیں، بلکہ صرف ظاہر میں جھوٹ ہیں، وہ کس قدر سچا ہو گا۔ بلاغت میں اسے {’’تَأْكِيْدُ الْمَدْحِ بِمَا يَشْبَهُ الذَّمَّ‘‘} کہا جاتا ہے، یعنی ایسی تعریف جو بظاہر مذمت ہو، جیسا کہ ایک شاعر نے کہا ہے : ¤ {وَلَا عَيْبَ فِيْهِمْ غَيْرَ أَنَّ سُيُوْفَهُمْ ¤ بِهِنَّ فُلُوْلٌ مِنْ قِرَاعِ الْكَتَائِبِ} ¤ ’’یعنی ان میں اس کے سوا کوئی عیب نہیں کہ ان کی تلواروں میں لشکروں کو کھٹکھٹانے کی وجہ سے دندانے پڑے ہوئے ہیں۔‘‘ ظاہر ہے کہ دشمنوں کے مقابلے کی وجہ سے تلواروں میں دندانے پڑ جانا کوئی عیب نہیں، تو جن کا عیب یہ ہے ان کی خوبیوں کا حال کیا ہو گا۔ ¤ اب آپ ان تینوں واقعات پر غور کریں۔ وہ لوگ ابراہیم علیہ السلام سے پوچھتے ہیں کہ اے ابراہیم! کیا ہمارے معبودوں کے ساتھ تو نے یہ کام کیا ہے؟ وہ کہتے ہیں، بلکہ ان کے اس بڑے نے یہ کام کیا ہے۔ ’’بلکہ‘‘ کا معنی یہی ہے کہ میں نے نہیں کیا، حالانکہ ابراہیم کو خوب معلوم تھا کہ انھوں نے ہی یہ کام کیا ہے۔ یہ بظاہر صاف جھوٹ ہے مگر حقیقت میں یہ ایک تدبیر تھی جس کے ذریعے سے وہ ان کے منہ سے اقرار کروانا چاہتے تھے کہ بت بول نہیں سکتے، نفع نقصان کا مالک ہونے کا تو سوال ہی پیدا نہیں ہوتا۔ مشرکین بھی ابراہیم علیہ السلام کے مقصد کو سمجھ رہے تھے اور ان کے پاس یہ ماننے کے سوا کوئی چارہ نہ تھا کہ بت بولتے نہیں۔ چنانچہ انھوں نے اس کا اقرار کیا۔ اب جس شخص کا جھوٹ دشمنوں کے مونہوں سے کائنات کی سب سے بڑی حقیقت کا اقرار کروا لے کہ اللہ کے سوا کسی کے اختیار میں کچھ نہیں، اس شخص کے صدیق ہونے میں کیا شبہ رہ جاتا ہے۔اسی طرح فرمایا : «{ اِنِّيْ سَقِيْمٌ }» [ الصافات : ۸۹ ] کہ میں بیمار ہوں، وہ سمجھے کہ اتنے بیمار ہیں کہ ساتھ نہیں جا سکتے، حالانکہ جو شخص اتنا بیمار ہو وہ پتھروں وغیرہ کے اتنے مجسموں کا ستیا ناس کیسے کر سکتا ہے؟ ابراہیم علیہ السلام کے ذہن میں کفر و شرک سے نفرت کی وجہ سے پیدا ہونے والی تکلیف یا کوئی بیماری تھی، اسے عربی زبان میں تعریض کہتے ہیں کہ کہنے والا اپنے الفاظ سے کچھ مراد لے اور سننے والے کچھ اور سمجھیں۔ سننے والوں کے لحاظ سے واقعہ کے خلاف ہونے کی وجہ سے اس پر کذب کا لفظ بولا جاتا ہے، مگر یہ حقیقت میں جھوٹ نہیں ہوتا، بلکہ جھوٹ سے بچنے کا ایک طریقہ ہے، جیسا کہ عمران بن حصین رضی اللہ عنہ نے فرمایا : [ إِنَّ فِي الْمَعَارِيْضِ لَمَنْدُوْحَةٌ عَنِ الْكَذِبِ ] [ الأدب المفرد : ۸۵۷ ] ’’بے شک معاریض میں کذب سے بچنے کی گنجائش ہے۔‘‘ اسی طرح سارہ علیھا السلام کو بہن کہنا بظاہر واقعہ کے خلاف تھا مگر انھیں بہن کہتے وقت اپنی مراد ابراہیم علیہ السلام نے خود بیان فرما دی جو بالکل درست ہے۔ ان دونوں واقعوں میں ابراہیم علیہ السلام نے تعریض سے کام لیا ہے۔ غور کیجیے وہ حدیث جس میں مذکور ہے کہ ابراہیم علیہ السلام نے ساری زندگی میں ان تین کے سوا کوئی جھوٹ نہیں بولا، ابراہیم علیہ السلام کو سچا ثابت کر رہی ہے یا جھوٹا؟ چلیں مان ہی لیں کہ اس حدیث میں ابراہیم علیہ السلام کا تین دفعہ جھوٹ بولنا واقعی بیان ہوا ہے، پھر بھی اس میں ابراہیم علیہ السلام پر کوئی گناہ لازم نہیں آتا اور نہ ان کا جھوٹا ہونا لازم آتا ہے، کیونکہ وہ حالت جنگ میں تھے اور جنگ میں جھوٹ بولنا جائز ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْحَرْبُ خُدْعَةٌ ] [ بخاري، الجھاد والسیر، باب الحرب خدعۃ : ۳۰۲۹ ] ’’جنگ دھوکے کا نام ہے۔‘‘ بتائیے! اس میں ابراہیم علیہ السلام کے صدق پر کیا حرف آتا ہے؟ ¤ اوپر مذکور بزرگوں نے بڑے زور شور سے یہ بات کہی ہے کہ سند صحیح ہونا کافی نہیں، متن بھی صحیح ہونا ضروری ہے۔ یہ بات فی الواقع درست ہے اور خود محدثین نے اسے حدیث کی صحت کے لیے شرط قرار دیا ہے، مگر حقیقت یہ ہے کہ امام بخاری اور دوسرے محدثین کو اس حدیث میں ابراہیم علیہ السلام کی توہین نظر آتی تو وہ کبھی اسے صحیح قرار نہ دیتے۔ افسوس ! ہمارے ان بزرگوں کی طعن تشنیع کا نشانہ محدثین ہی بنتے ہیں، اپنی رائے اور قیاس سے ایک نئی شریعت ایجاد کر لینے والے حضرات کے متعلق ان کے دلوں اور قلموں میں بہت نرم گوشہ ہے۔ [ فَإِلَی اللّٰہِ الْمُشْتَکٰی] ¤ بائبل کے حوالے سے ابراہیم علیہ السلام کی عمر ۷۵ سال اور سارہ کی عمر ۶۵ سال نقل کرکے بھی اس حدیث پر اعتراض کیا گیا ہے کہ اس عمر میں عورت میں کیا حسن باقی رہ جاتا ہے جو شاہِ مصر اس پر فریفتہ ہو۔ افسوس! ہمارے یہ حضرات ائمۂ محدثین پر اس قدر خفا ہیں کہ کتاب اللہ کے بعد سب سے صحیح کتاب کی حدیث انھیں غلط نظر آئی اور وہ کتاب جس میں تحریف کی خود اللہ تعالیٰ نے شہادت دی ہے اور جس کی داخلی شہادتیں اس کے بے شمار جھوٹوں کی نشان دہی کر رہی ہیں، وہ انھیں اس قابل نظر آئی کہ انھوں نے اس کے ساتھ صحیح حدیث رسول صلی اللہ علیہ وسلم کو رد کر دییا۔ [ إِنَّا لِلّٰہِ وَ إِنَّا إِلَیْہِ رَاجِعُوْنَ ] ¤ ➌ یہاں ایک اشکال باقی رہ جاتا ہے کہ صحیح بخاری میں مذکور حدیثِ شفاعت میں ہے کہ لوگ جب ابراہیم علیہ السلام کے پاس شفاعت کی درخواست لے کر جائیں گے تو وہ اپنے تین کذبات کا ذکر کرکے شفاعت سے عذر کر دیں گے۔ اگر یہ جھوٹ نہیں تو ابراہیم علیہ السلام شفاعت سے معذوری کیوں ظاہر کریں گے؟ اہل علم نے اس کا جواب یہ دیا ہے کہ اللہ تعالیٰ نے ابراہیم کو جو مرتبہ عطا فرمایا تھا ان کے خیال کے مطابق اس کا تقاضا یہ تھا کہ وہ ان موقعوں پر بھی تعریض کے بجائے صاف کہتے کہ ہاں، میں نے بت توڑے ہیں اور مشرکین کی عید پر جانے سے بیماری کے عذر کے بجائے صاف لفظوں میں انکار کر دیتے کہ میں نہیں جاتا۔ اسی طرح جبار مصر کے سامنے صاف کہہ دیتے کہ سارہ میری بیوی ہے، پھر جو آزمائش آتی اس پر صبر کرتے، جس طرح دوسری بہت سی آزمائشوں پر انھوں نے صبر کیا اور اللہ تعالیٰ نے انھیں امامت کے رتبے پر سرفراز فرمایا۔ اپنے اس عمل کو اپنے آپ پر اللہ تعالیٰ کی بے شمار نعمتوں کے مقابلے میں کمتر سمجھ کر وہ شفاعت سے معذوری ظاہر کریں گے۔ [ أحکام القرآن لابنن العربی ] دیکھیے اسی حدیث شفاعت میں ہے کہ عیسیٰ علیہ السلام شفاعت سے یہ کہہ کر عذر کر دیں گے کہ لوگوں نے میری پرستش کی، اس لیے مجھے شفاعت کے لیے جاتے ہوئے ڈر لگتا ہے، حالانکہ اس میں ان کا کوئی قصور نہیں تھا۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63،62) ➊ { قَالُوْۤا ءَاَنْتَ فَعَلْتَ هٰذَا …:} لوگوں کے سوال کے جواب میں کہ اے ابراہیم! کیا تو نے ہمارے معبودوں کے ساتھ یہ کام کیا ہے؟ ابراہیم علیہ السلام نے ان کے بتوں کی بے بسی و بے چارگی واضح کرنے کے لیے شدید طنز کرتے ہوئے فرمایا : ’’بلکہ یہ کام ان کے اس بڑے نے کیا ہے، سو ان سے پوچھ لو اگر وہ بولتے ہیں۔‘‘ مراد خود ان کے منہ سے اس بات کا اقرار کروانا تھا کہ بت نفع یا نقصان تو دور کی بات ہے بول کر بتا بھی نہیں سکتے کہ ان کا یہ حال زار کون کر گیا ہے۔ {’’فَسْـَٔلُوْهُمْ ‘‘} (سو ان سے پوچھ لو) یعنی صحیح سالم رہنے والے ان کے اس بڑے سے پوچھو کہ اس نے بت کیوں توڑے اور اگر کسی اور نے توڑے ہیں تو اس نے اپنے ساتھیوں کا دفاع کیوں نہیں کیا؟ اور ٹوٹے ہوئے خداؤں سے بھی پوچھو کہ کس نے ان کا یہ حال کیا اور یہ بھی کہ وہ خود یا ان کا بڑا ان کا دفاع کیوں نہیں کر سکے؟ ان کے ایک بڑے بت کو سالم چھوڑنے میں یہ اشارہ بھی معلوم ہوتا ہے کہ کوئی بڑا اپنے ساتھ کسی بڑے یا چھوٹے مدمقابل کو برداشت نہیں کرتا تو رب تعالیٰ جس کی صفت ہی ’’اللہ اکبر‘‘ ہے، اپنے ساتھ کسی شریک کو کیسے برداشت کر سکتا ہے؟ ¤ ➋ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَمْ يَكْذِبْ إِبْرَاهِيْمُ عَلَيْهِ الصَّلاَةُ وَالسَّلاَمُ إِلاَّ ثَلاَثَ كَذِبَاتٍ : ثِنْتَيْنِ مِنْهُنَّ فِیْ ذَاتِ اللّٰهِ عَزَّوَجَلَّ، قَوْلُهُ : «{ اِنِّيْ سَقِيْمٌ }» [الصافات : ۸۹] وَ قَوْلُ : «{ بَلْ فَعَلَهٗ كَبِيْرُهُمْ هٰذَا }» [الأنبياء : ۶۳] وَقَالَ بَيْنَا هُوَ ذَاتَ يَوْمٍ وَسَارَةُ إِذْ أَتَي عَلٰي جَبَّارٍ مِنَ الْجَبَابِرَةِ، فَقِيْلَ لَهُ إِنَّ هَاهُنَا رَجُلاً مَعَهُ امْرَأَةٌ مِنْ أَحْسَنِ النَّاسِ فَأَرْسَلَ إِلَيْهِ فَسَأَلَهُ عَنْهَا فَقَالَ مَنْ هٰذِهِ ؟ قَالَ أُخْتِيْ فَأَتَی سَارَةَ فَقَاالَ يَا سَارَةُ ! لَيْسَ عَلَی وَجْهِ الْأَرْضِ مُؤْمِنٌ غَيْرِيْ وَ غَيْرُكِ ، وَإِنَّ هٰذَا سَأَلَنِيْ عَنْكِ فَأَخْبَرْتُهُ أَنَّكِ أُخْتِيْ فَلاَ تُكَذِّبِيْنِيْ ] [ بخاري، أحادیثث الأنبیاء، باب قول اللہ تعالٰی : { واتخذ اللہ إبراہیم خلیلا } : ۳۳۵۸۔ مسلم : ۲۳۷۱ ] ’’ابراہیم علیہ السلام نے تین دفعہ کے سوا کبھی جھوٹ نہیں کہا، جن میں سے دو اللہ تعالیٰ کی ذات کی خاطر تھے۔ ان کا کہنا : «{ اِنِّيْ سَقِيْمٌ }» [ الصافات : ۸۹] ’’میں بیمار ہوں‘‘اور ان کا یہ کہنا : «{ بَلْ فَعَلَهٗ كَبِيْرُهُمْ هٰذَا }» [ الأنبیاء : ۶۳ ] ’’بلکہ اسے ان کے اس بڑے نے کیا ہے۔‘‘ اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اور ایک دفعہ وہ اور (ان کی بیوی) سارہ سفر کر رہے تھے کہ وہ جابر لوگوں میں سے ایک جابر (کی بستی) کے پاس آئے۔ اسے بتایا گیا کہ یہاں ایک آدمی ہے جس کے ساتھ ایک عورت ہے جو حسین ترین لوگوں سے ہے۔ اس نے ان کی طرف پیغام بھیجا اور اس کے متعلق پوچھا اور کہا : ’’وہ کون ہے ؟ ‘‘کہا : ’’وہ میری بہن ہے۔‘‘ پھر سارہ کے پاس آئے تو کہا، اے سارہ! اس سرزمین پر میرے اور تمھارے سوا کوئی مومن نہیں اور اس نے مجھ سے پوچھا تو میں نے اسے بتایا ہے کہ تو میری بہن ہے، سو مجھے مت جھٹلانا۔‘‘ ¤ بعض لوگوں نے اس حدیث میں ابراہیم علیہ السلام کے تین جھوٹوں کے ذکر کی وجہ سے اس حدیث کا انکار ہی کر دیا کہ ایک صدیق نبی جھوٹ کیسے بول سکتا ہے؟ ایک روشن خیال بزرگ نے تو امام بخاری اور تمام ائمۂ حدیث کے ساتھ اس حدیث کو صحیح کہنے والے حضرات کے متعلق یہاں تک لکھ دیا ہے : ’’ایک گروہ روایت پرستی میں غلو کرکے اس حد تک پہنچ جاتا ہے کہ اسے بخاری و مسلم کے چند راویوں کی صداقت زیادہ عزیز ہے اور اس بات کی پروا نہیں کہ اس سے ایک نبی پر جھوٹ کا الزام عائد ہوتا ہے۔‘‘ ان بزرگوں نے یہ سوچا ہی نہیں کہ اس حدیث کے روایت کرنے والے ائمہ کرام یعنی بخاری، محمد بن محبوب، حماد بن زید اور ابو ہریرہ رضی اللہ عنہ کی صداقت کو عزیز نہ رکھنے کا نتیجہ کیا ہو گا؟ جب ان کی صداقت ہی عزیر نہ رہی تو امت کے اتفاق کے ساتھ {’’ أَصَحُّ الْكُتُبِ بَعْدَ كِتَابِ اللّٰهِ ‘‘} اور دوسری کتب حدیث کی کیا حیثیت رہ جائے گی اور امت کے پاس باقی کیا رہ جائے گا؟ لطف یہ کہ ان بزرگوں نے ائمۂ حدیث کے صدق پر یہ مہربانی بزعم خود منکرین حدیث کے فتنے کے سد باب کے لیے فرمائی ہے۔ بھلا اس کرم فرمائی کے بعد منکرین حدیث کو کسی مزید محنت کی ضرورت باقی رہ جاتی ہے؟ ایک بزرگ نے یہ تک کہہ دیا کہ ’’نبی کو جھوٹا کہنے سے بہتر ہے کہ اس حدیث کے راویوں کو جھوٹا کہہ دیا جائے۔‘‘ سبحان اللہ! ابراہیم علیہ السلام کو جھوٹا کس نے کہا ہے؟ اور آپ حضرات کی دلیری کا کیا کہنا کہ جن راویوں کو پوری امت بالاتفاق سچا قرار دیتی ہے آپ انھیں جھوٹا قرار دے رہے ہیں۔ مجھے تعجب ہوتا ہے کہ اچھے خاصے ذہین حضرات صحیح حدیث اور ائمۂ حدیث پر اتنی جرأت کرتے ہوئے یہ بات نہ سمجھ سکے کہ اس حدیث میں ابراہیم علیہ السلام کو جھوٹا نہیں کہا گیا بلکہ اعلیٰ درجے کا سچا (صدیق) ثابت کیا گیا ہے۔ کیونکہ جس شخص نے پوری زندگی میں ان تین باتوں کے سوا کوئی جھوٹ نہ بولا ہو، جو حقیقت میں جھوٹ ہیں ہی نہیں، بلکہ صرف ظاہر میں جھوٹ ہیں، وہ کس قدر سچا ہو گا۔ بلاغت میں اسے {’’تَأْكِيْدُ الْمَدْحِ بِمَا يَشْبَهُ الذَّمَّ‘‘} کہا جاتا ہے، یعنی ایسی تعریف جو بظاہر مذمت ہو، جیسا کہ ایک شاعر نے کہا ہے : ¤ {وَلَا عَيْبَ فِيْهِمْ غَيْرَ أَنَّ سُيُوْفَهُمْ ¤ بِهِنَّ فُلُوْلٌ مِنْ قِرَاعِ الْكَتَائِبِ} ¤ ’’یعنی ان میں اس کے سوا کوئی عیب نہیں کہ ان کی تلواروں میں لشکروں کو کھٹکھٹانے کی وجہ سے دندانے پڑے ہوئے ہیں۔‘‘ ظاہر ہے کہ دشمنوں کے مقابلے کی وجہ سے تلواروں میں دندانے پڑ جانا کوئی عیب نہیں، تو جن کا عیب یہ ہے ان کی خوبیوں کا حال کیا ہو گا۔ ¤ اب آپ ان تینوں واقعات پر غور کریں۔ وہ لوگ ابراہیم علیہ السلام سے پوچھتے ہیں کہ اے ابراہیم! کیا ہمارے معبودوں کے ساتھ تو نے یہ کام کیا ہے؟ وہ کہتے ہیں، بلکہ ان کے اس بڑے نے یہ کام کیا ہے۔ ’’بلکہ‘‘ کا معنی یہی ہے کہ میں نے نہیں کیا، حالانکہ ابراہیم کو خوب معلوم تھا کہ انھوں نے ہی یہ کام کیا ہے۔ یہ بظاہر صاف جھوٹ ہے مگر حقیقت میں یہ ایک تدبیر تھی جس کے ذریعے سے وہ ان کے منہ سے اقرار کروانا چاہتے تھے کہ بت بول نہیں سکتے، نفع نقصان کا مالک ہونے کا تو سوال ہی پیدا نہیں ہوتا۔ مشرکین بھی ابراہیم علیہ السلام کے مقصد کو سمجھ رہے تھے اور ان کے پاس یہ ماننے کے سوا کوئی چارہ نہ تھا کہ بت بولتے نہیں۔ چنانچہ انھوں نے اس کا اقرار کیا۔ اب جس شخص کا جھوٹ دشمنوں کے مونہوں سے کائنات کی سب سے بڑی حقیقت کا اقرار کروا لے کہ اللہ کے سوا کسی کے اختیار میں کچھ نہیں، اس شخص کے صدیق ہونے میں کیا شبہ رہ جاتا ہے۔اسی طرح فرمایا : «{ اِنِّيْ سَقِيْمٌ }» [ الصافات : ۸۹ ] کہ میں بیمار ہوں، وہ سمجھے کہ اتنے بیمار ہیں کہ ساتھ نہیں جا سکتے، حالانکہ جو شخص اتنا بیمار ہو وہ پتھروں وغیرہ کے اتنے مجسموں کا ستیا ناس کیسے کر سکتا ہے؟ ابراہیم علیہ السلام کے ذہن میں کفر و شرک سے نفرت کی وجہ سے پیدا ہونے والی تکلیف یا کوئی بیماری تھی، اسے عربی زبان میں تعریض کہتے ہیں کہ کہنے والا اپنے الفاظ سے کچھ مراد لے اور سننے والے کچھ اور سمجھیں۔ سننے والوں کے لحاظ سے واقعہ کے خلاف ہونے کی وجہ سے اس پر کذب کا لفظ بولا جاتا ہے، مگر یہ حقیقت میں جھوٹ نہیں ہوتا، بلکہ جھوٹ سے بچنے کا ایک طریقہ ہے، جیسا کہ عمران بن حصین رضی اللہ عنہ نے فرمایا : [ إِنَّ فِي الْمَعَارِيْضِ لَمَنْدُوْحَةٌ عَنِ الْكَذِبِ ] [ الأدب المفرد : ۸۵۷ ] ’’بے شک معاریض میں کذب سے بچنے کی گنجائش ہے۔‘‘ اسی طرح سارہ علیھا السلام کو بہن کہنا بظاہر واقعہ کے خلاف تھا مگر انھیں بہن کہتے وقت اپنی مراد ابراہیم علیہ السلام نے خود بیان فرما دی جو بالکل درست ہے۔ ان دونوں واقعوں میں ابراہیم علیہ السلام نے تعریض سے کام لیا ہے۔ غور کیجیے وہ حدیث جس میں مذکور ہے کہ ابراہیم علیہ السلام نے ساری زندگی میں ان تین کے سوا کوئی جھوٹ نہیں بولا، ابراہیم علیہ السلام کو سچا ثابت کر رہی ہے یا جھوٹا؟ چلیں مان ہی لیں کہ اس حدیث میں ابراہیم علیہ السلام کا تین دفعہ جھوٹ بولنا واقعی بیان ہوا ہے، پھر بھی اس میں ابراہیم علیہ السلام پر کوئی گناہ لازم نہیں آتا اور نہ ان کا جھوٹا ہونا لازم آتا ہے، کیونکہ وہ حالت جنگ میں تھے اور جنگ میں جھوٹ بولنا جائز ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْحَرْبُ خُدْعَةٌ ] [ بخاري، الجھاد والسیر، باب الحرب خدعۃ : ۳۰۲۹ ] ’’جنگ دھوکے کا نام ہے۔‘‘ بتائیے! اس میں ابراہیم علیہ السلام کے صدق پر کیا حرف آتا ہے؟ ¤ اوپر مذکور بزرگوں نے بڑے زور شور سے یہ بات کہی ہے کہ سند صحیح ہونا کافی نہیں، متن بھی صحیح ہونا ضروری ہے۔ یہ بات فی الواقع درست ہے اور خود محدثین نے اسے حدیث کی صحت کے لیے شرط قرار دیا ہے، مگر حقیقت یہ ہے کہ امام بخاری اور دوسرے محدثین کو اس حدیث میں ابراہیم علیہ السلام کی توہین نظر آتی تو وہ کبھی اسے صحیح قرار نہ دیتے۔ افسوس ! ہمارے ان بزرگوں کی طعن تشنیع کا نشانہ محدثین ہی بنتے ہیں، اپنی رائے اور قیاس سے ایک نئی شریعت ایجاد کر لینے والے حضرات کے متعلق ان کے دلوں اور قلموں میں بہت نرم گوشہ ہے۔ [ فَإِلَی اللّٰہِ الْمُشْتَکٰی] ¤ بائبل کے حوالے سے ابراہیم علیہ السلام کی عمر ۷۵ سال اور سارہ کی عمر ۶۵ سال نقل کرکے بھی اس حدیث پر اعتراض کیا گیا ہے کہ اس عمر میں عورت میں کیا حسن باقی رہ جاتا ہے جو شاہِ مصر اس پر فریفتہ ہو۔ افسوس! ہمارے یہ حضرات ائمۂ محدثین پر اس قدر خفا ہیں کہ کتاب اللہ کے بعد سب سے صحیح کتاب کی حدیث انھیں غلط نظر آئی اور وہ کتاب جس میں تحریف کی خود اللہ تعالیٰ نے شہادت دی ہے اور جس کی داخلی شہادتیں اس کے بے شمار جھوٹوں کی نشان دہی کر رہی ہیں، وہ انھیں اس قابل نظر آئی کہ انھوں نے اس کے ساتھ صحیح حدیث رسول صلی اللہ علیہ وسلم کو رد کر دییا۔ [ إِنَّا لِلّٰہِ وَ إِنَّا إِلَیْہِ رَاجِعُوْنَ ] ¤ ➌ یہاں ایک اشکال باقی رہ جاتا ہے کہ صحیح بخاری میں مذکور حدیثِ شفاعت میں ہے کہ لوگ جب ابراہیم علیہ السلام کے پاس شفاعت کی درخواست لے کر جائیں گے تو وہ اپنے تین کذبات کا ذکر کرکے شفاعت سے عذر کر دیں گے۔ اگر یہ جھوٹ نہیں تو ابراہیم علیہ السلام شفاعت سے معذوری کیوں ظاہر کریں گے؟ اہل علم نے اس کا جواب یہ دیا ہے کہ اللہ تعالیٰ نے ابراہیم کو جو مرتبہ عطا فرمایا تھا ان کے خیال کے مطابق اس کا تقاضا یہ تھا کہ وہ ان موقعوں پر بھی تعریض کے بجائے صاف کہتے کہ ہاں، میں نے بت توڑے ہیں اور مشرکین کی عید پر جانے سے بیماری کے عذر کے بجائے صاف لفظوں میں انکار کر دیتے کہ میں نہیں جاتا۔ اسی طرح جبار مصر کے سامنے صاف کہہ دیتے کہ سارہ میری بیوی ہے، پھر جو آزمائش آتی اس پر صبر کرتے، جس طرح دوسری بہت سی آزمائشوں پر انھوں نے صبر کیا اور اللہ تعالیٰ نے انھیں امامت کے رتبے پر سرفراز فرمایا۔ اپنے اس عمل کو اپنے آپ پر اللہ تعالیٰ کی بے شمار نعمتوں کے مقابلے میں کمتر سمجھ کر وہ شفاعت سے معذوری ظاہر کریں گے۔ [ أحکام القرآن لابنن العربی ] دیکھیے اسی حدیث شفاعت میں ہے کہ عیسیٰ علیہ السلام شفاعت سے یہ کہہ کر عذر کر دیں گے کہ لوگوں نے میری پرستش کی، اس لیے مجھے شفاعت کے لیے جاتے ہوئے ڈر لگتا ہے، حالانکہ اس میں ان کا کوئی قصور نہیں تھا۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) {فَرَجَعُوْۤا اِلٰۤى اَنْفُسِهِمْ … :} ابراہیم علیہ السلام کی اس زبردست چوٹ نے انھیں سوچنے پر مجبور کر دیا۔ سب نے اپنے دل میں غور کیا تو کہہ اٹھے کہ تم اس جوان کو خواہ مخواہ ظالم کہہ رہے ہو، ظالم تو تم خود ہو جو ایسی بے حقیقت چیزوں کو اپنا معبود قرار دے کر پوجتے پکارتے اور انھیں اپنا حاجت روا اور مشکل کشا قرار دیتے ہو، جن کی بے بسی اور بے چارگی کا حال یہ ہے کہ وہ خود اپنے اوپر آنے والی مصیبت کو بھی دفع نہیں کر سکتے۔ اس سے بھی بڑھ کر یہ کہ وہ اپنے آپ پر گزری ہوئی مصیبت کسی دوسرے کے سامنے بیان بھی نہیں کر سکتے، تو پھر اس سے بڑھ کر ظلم اور حماقت کیا ہو سکتی ہے؟ سچ فرمایا اللہ تعالیٰ نے : «{ اِنَّ الشِّرْكَ لَظُلْمٌ عَظِيْمٌ }» [ لقمان : ۱۳ ] ’’بے شک شرک یقینا بہت بڑا ظلم ہے۔‘‘ بعض نے یہ مطلب بیان کیا ہے کہ تم ہی ظالم ہو کہ تم نے اپنے بتوں کی حفاظت کا خاطر خواہ بندوبست نہیں کیا، مگر پہلا معنی ہی صحیح اور مقام کے مناسب ہے۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) { ثُمَّ نُكِسُوْا عَلٰى رُءُوْسِهِمْ …: ’’ نَكَسَ ‘‘} کا معنی سر کے بل الٹا کرنا ہے، یعنی سر نیچے اور پاؤں اوپر کر دینا، یہ کسی بھی شخص کی بدترین حالت ہے۔ {’’ نُكِسَ الْوَلَدُ ‘‘} جب بچے کی ٹانگیں سر سے پہلے باہر آئیں۔ {’’ نُكِسَ فِي الْمَرَضِ ‘‘} تندرست ہو کر پھر بیمار ہو جانا۔ یعنی اگرچہ ابراہیم علیہ السلام کا جواب سنتے ہی ان کے دلوں نے فیصلہ کر دیا کہ ظالم تم خود ہو جو ایسے بے حس اور بے بس بتوں کو معبود بنا بیٹھے ہو جو بول کر یہ بھی نہیں بتا سکتے کہ ان پر کیا گزری، مگر پھر حق تسلیم کرنے کے بجائے ان پر ضد اور جہالت سوار ہو گئی، جس سے ان کی عقل الٹی ہوگئی اور وہ بغیر کسی حیا کے وہ بات کہنے لگے جس سے ان کی بے وقوفی اور حماقت بالکل واضح ہو رہی تھی۔ {’’ نُكِسُوْا ‘‘} الٹے کر دیے گئے، جیسے کسی چیز نے زبردستی انھیں سر کے بل اوندھا کر دیا ہو، چنانچہ کہنے لگے : «{ لَقَدْ عَلِمْتَ مَا هٰۤؤُلَآءِ يَنْطِقُوْنَ }» ’’بلاشبہ یقینا تو جانتا ہے کہ یہ بولتے نہیں۔‘‘"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) { قَالَ اَفَتَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ …:} ابراہیم علیہ السلام اتنے بڑے مجمع میںں ان کی زبان سے یہی کہلوانا چاہتے تھے اور سب کچھ اسی ترتیب سے ہو رہا تھا جو ابراہیم علیہ السلام کی توقع اور خواہش کے مطابق تھی۔ ان کے لیے توحید کی دعوت اور شرک کے رد کا ایسا سنہرا موقع شاید اس سے پہلے کبھی نہ آیا ہو، چنانچہ فرمایا کہ جب یہ بول ہی نہیں سکتے تو فائدہ یا نقصان پہنچانے کا تو سوال ہی پیدا نہیں ہوتا، تو پھر کیا تم ایسی چیزوں کی عبادت کرتے ہو جو تمھیں نہ کچھ فائدہ پہنچاتی ہیں اور نہ نقصان؟ {’’ مَا ‘‘} کا لفظ عموماً ان چیزوں کے لیے استعمال ہوتا ہے جن میں عقل نہیں ہوتی۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) { اُفٍّ لَّكُمْ وَ لِمَا تَعْبُدُوْنَ …: ’’ اُفٍّ ‘‘} کا اصل معنی ہر گندی سمجھی جانے والی چیز ہے، مثلاً میل، گندگی، ناخن کے تراشے اور اس قسم کی چیزیں۔ یہی لفظ ہر اس شخص یا چیز کے لیے بولا جاتا ہے جس سے اکتاہٹ کااظہار کرنا اور اسے گندا اور نہایت حقیر قرار دینا مقصود ہو۔ (راغب) {’’ اُفٍّ ‘‘} کی تنوین سے نفرت کی شدت کا اظہار ہو رہا ہے، یعنی میری زبردست نفرت، اکتاہٹ اور تحقیر تم جیسے بے عقلوں کے لیے اور تمھارے بنائے ہوئے معبودوں کے لیے ہے، کیا تم نہیں سمجھتے کہ ایسے بے حس اور بے بس پتھر وغیرہ بھی کبھی اس قابل ہو سکتے ہیں کہ کوئی ہوش مند انسان ساری کائنات کے خالق و مالک اللہ تعالیٰ کو چھوڑ کر ان کی عبادت کرے؟"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) ➊ { قَالُوْا حَرِّقُوْهُ وَ انْصُرُوْۤا اٰلِهَتَكُمْ :} یہ قاعدہ ہے کہ جب انسان دلیل سے لاجواب ہو جاتا ہے تو یا تو نیکی اسے اپنی طرف کھینچ لیتی ہے یا بدی غالب آ جاتی ہے۔ بدی کے غلبے کی صورت میں جب اس کے پاس کوئی دلیل نہیں رہتی اور وہ مکمل طور پر لاجواب ہو جاتا ہے تو اپنے مخالف کو دھمکیاں دیتا ہے۔ دیکھیے نوح علیہ السلام کی قوم (شعراء : ۱۱۶)، ابراہیم علیہ السلام کو ان کے والد کی دھمکی (مریم : ۴۶)، لوط علیہ السلام کی قوم (شعراء : ۱۶۷)، شعیب علیہ السلام کی قوم (اعراف : ۸۸)، فرعون کی موسیٰ علیہ السلام کو دھمکی (شعراء : ۲۹) اور جادوگروں کو دھمکی (شعراء : ۴۹)۔ پھر اپنی دھمکیوں کو عملی جامہ پہناتے ہوئے اپنے لاجواب کر دینے والے حریف کو ختم کرنے کی کوشش کرتا ہے۔ ابراہیم علیہ السلام کی قوم بھی جب دلیل میں ہر طرح لاجواب ہو گئی تو ابراہیم علیہ السلام کی جان کے درپے ہو گئی۔ مشورہ ہوا کہ اسے قتل کر دو یا جلا دو۔ دیکھیے سورۂ عنکبوت (۲۴) آخر فیصلہ یہ ٹھہرا کہ اپنے معبودوں کا انتقام لینے کی اور ان کی نصرت کی یہی صورت ہے کہ اسے جلا کر راکھ بنا دو۔ ¤ ➋ { اِنْ كُنْتُمْ فٰعِلِيْنَ :} یہ الفاظ ان کے ضمیر کی کشمکش کا اظہار کر رہے ہیں کہ اول تو ابراہیم کو نقصان پہنچانے والے تمھارے کسی اقدام کا کوئی جواز نہیں۔ دلیل کا جواب دلیل ہے، مار ڈالنا نہیں، لیکن اگر تمھارے پاس اس کا کوئی علاج نہیں اور تم نے ضرور ہی اس کے خلاف کچھ کرنا ہے تو پھر معمولی سزا مت سوچو۔ اپنے معبودوں کی مدد کرتے ہوئے اس کا قصہ نہایت عبرت ناک سزا کے ساتھ ختم کرو، تاکہ آئندہ کوئی اس بحث کی جرأت ہی نہ کرے۔ (بقاعی)"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) ➊ {قُلْنَا يٰنَارُ كُوْنِيْ بَرْدًا …: ’’ بَرْدًا ‘‘} ٹھنڈک، {’’ سَلٰمًا ‘‘} سلامتی۔ ممبالغہ کے طور پر مصدر بمعنی اسم فاعل ہے۔ یہاں کچھ عبارت محذوف ہے جو خود بخود سمجھ میں آ رہی ہے کہ اپنے فیصلے کے مطابق انھوں نے ابراہیم علیہ السلام کو جلانے کا زبردست انتظام کیا، چنانچہ لکڑیاں جمع کرنے کے لیے باقاعدہ ایک چار دیواری بنائی گئی، جیسا کہ فرمایا : «{ قَالُوا ابْنُوْا لَهٗ بُنْيَانًا فَاَلْقُوْهُ فِي الْجَحِيْمِ } » [ الصافات : ۹۷ ] ’’انھوں نے کہا، اس کے لیے ایک عمارت بناؤ، پھر اسے بھڑکتی آگ میں پھینک دو۔‘‘ پھر جب آگ خوب بھڑک اٹھی اور اس کی تپش چاروں طرف پھیل گئی تو انھوں نے منجنیق کے ذریعے سے یا جیسے بھی ہو سکا، ابراہیم علیہ السلام کو اس میں پھینک دیا تو ہم نے حکم دیا کہ اے آگ! ابراہیم پر سراسر ٹھنڈک ہو جا، مگر تکلیف دینے والی ٹھنڈک نہیں، بلکہ ایسی کہ سراسر سلامتی ہو۔ اگر اللہ تعالیٰ صرف {’’ بَرْدًا ‘‘} (سراسر ٹھنڈک) فرماتے تو شدید ٹھنڈک ابراہیم علیہ السلام برداشت نہ کر سکتے، اس لیے آگ کو ٹھنڈک کے ساتھ سلامتی والی بن جانے کا حکم دیا۔ ¤ ➋ یہ اللہ تعالیٰ کی طرف سے ابراہیم علیہ السلام کے لیے معجزہ یعنی فطرت کے عام قوانین کے برعکس معاملہ تھا، جیسا کہ اللہ تعالیٰ نے موسیٰ علیہ السلام کو سمندر پر اپنی لاٹھی مارنے کا حکم دیا تو سمندر پھٹ گیا اور پانی کا ہر حصہ ایک بہت بڑے پہاڑ کی طرح اپنی جگہ کھڑا رہا، فرمایا : «{ فَانْفَلَقَ فَكَانَ كُلُّ فِرْقٍ كَالطَّوْدِ الْعَظِيْمِ }» [ الشعراء : ۶۳ ] ’’پس وہ پھٹ گیا تو ہر ٹکڑا بہت بڑے پہاڑ کی طرح ہو گیا۔‘‘ جب کہ پانی کی فطرت بہنا ہے، ایسے ہی آگ کی فطرت جلانا ہے مگر اللہ تعالیٰ کے حکم کے بعد وہ ابراہیم علیہ السلام کے لیے گلزار بن گئی۔ اگر کسی کی سمجھ میں یہ بات نہ آتی ہو تو وہ اللہ تعالیٰ کا یہ فرمان پڑھ لے : «{ اِذَا قَضٰۤى اَمْرًا فَاِنَّمَا يَقُوْلُ لَهٗ كُنْ فَيَكُوْنُ }» [ آل عمران : ۴۷ ] ’’جب وہ کسی کام کا فیصلہ کر لیتا ہے تو اس سے یہی کہتا ہے کہ ہو جا، تو وہ ہو جاتا ہے۔‘‘ اس موقع پر بھی اللہ تعالیٰ نے آگ کو {’’ كُوْنِيْ ‘‘} (ہو جا) سے خطاب فرمایا، پھر آگ کی کیا مجال تھی کہ ٹھنڈی اور سلامتی والی نہ ہوتی۔ (ثنائی) اگر کسی کو پھر بھی اصرار ہے کہ آگ کا کام جلانا ہی ہے، وہ اللہ تعالیٰ کے حکم سے بھی ٹھنڈی نہیں ہو سکتی تو اسے قرآن مجید پر ایمان کے دعوے کا تکلف نہیں کرنا چاہیے۔ ¤ ➌ ام شریک رضی اللہ عنھا بیان کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے چھپکلی کو مار دینے کا حکم دیا اور فرمایا : [ وَكَانَ يَنْفُخُ عَلٰی إِبْرَاهِيْمَ عَلَيْهِ السَّلَامُ ] ’’یہ ابراہیم علیہ السلام پر پھونکیں مارتی تھی۔‘‘ [ بخاري، الأنبیاء، باب قولہ تعالٰی: « واتخذ اللہ إبراہیم خلیلا… » : ۳۳۵۹ ] محدث عبد الرزاق نے اپنی مصنف (۸۳۹۲) میں معمر عن الزہری عن عروہ عن عائشہ رضی اللہ عنھا روایت کیا ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ كَانَتِ الضِّفْدَعُ تُطْفِئُ النَّارَ عَنْ إِبْرَاهِيْمَ وَكَانَ الْوَزَغُ يَنْفُخُ فِيْهِ فَنَهَی عَنْ قَتْلِ هٰذا وَ أَمَرَ بِقَتْلِ هٰذَا ] ’’مینڈک ابراہیم علیہہ السلام سے آگ بجھاتے تھے اور چھپکلی اس میں پھونکیں مارتی تھی، سو انھیں قتل کرنے سے منع فرمایا اور اسے قتل کرنے کا حکم دیا۔‘‘ مسند احمد کے محقق نے لکھا ہے کہ یہ سند شیخین کی شرط پر صحیح ہے۔ صحیح بخاری کی ایک حدیث میں ہے کہ عائشہ رضی اللہ عنھا نے فرمایا : [ أَنَّ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْوَزَغِ اَلْفُوَيْسِقُ وَلَمْ أَسْمَعْهٗ أَمَرَ بِقَتْلِهٖ ] ’’نبی صلی اللہ علیہ وسلم نے چھپکلی کو ’’فویسق‘‘(بہت نافرمان) فرمایا اور میں نے آپ صلی اللہ علیہ وسلم کو اسے قتل کرنے کا حکم دیتے ہوئے نہیں سنا۔‘‘ اور سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں : [ أَنَّ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِهِ ] [ بخاري : ۳۳۰۶ ] ’’نبی صلی اللہ علیہ وسلم نے اسے قتل کرنے کا حکم دیا ہے۔‘‘ اس سے معلوم ہوتا ہے کہ عائشہ رضی اللہ عنھا نے چھپکلی کو قتل کرنے کی حدیث کسی صحابی کے واسطے سے سنی ہے، اس صورت میں بھی حدیث صحیح ہے، کیونکہ تمام صحابہ روایت حدیث میں معتبر ہیں۔ ¤ ➍ ابن عباس رضی اللہ عنھما نے فرمایا کہ ابراہیم علیہ السلام کا آخری قول، جب انھیں آگ میں پھینکا گیا {’’حَسْبِيَ اللّٰهُ وَ نِعْمَ الْوَكِيْلُ ‘‘} تھا، یعنی مجھے اللہ کافی ہے اور وہ بہت اچھا کارساز ہے۔ [ بخاري، التفسیر، باب : «الذین قال لھم الناس… » : ۴۵۶۴ ] ¤ ➎ بغوی نے اس آیت کی تفسیر میں لکھا ہے کہ کعب احبار سے روایت کی گئی ہے کہ جب انھوں نے ابراہیم علیہ السلام کو منجنیق میں رکھ کر آگ کی طرف پھینکا تو جبریل علیہ السلام آپ کے سامنے آئے اور کہا : ’’ابراہیم! تمھیں کوئی حاجت ہے؟‘‘ فرمایا : ’’تمھاری طرف تو نہیں۔‘‘ انھوں نے کہا : ’’پھر اپنے رب سے سوال کرو۔‘‘ فرمایا : [ حَسْبِيْ مِنْ سُؤَالِيْ عِلْمُهُ بِحَالِيْ ] ’’مجھے میرے سسوال کرنے سے اس کا میری حالت کو جاننا ہی کافی ہے۔‘‘ بغوی نے یہ کہہ کر اس کے ضعف کی طرف اشارہ کر دیا ہے :{ ’’ رُوِيَ عَنْ كَعْبٍ ‘‘} کہ کعب سے روایت کی گئی ہے۔ معلوم ہوا کہ اس روایت کا کوئی سر پیر نہیں، اس لیے شیخ البانی رحمہ اللہ نے فرمایا : {’’ لَا أَصْلَ لَهُ ‘‘} [ سلسلۃ الأحادیث الضعیفۃ : ۲۱ ] اور ابن عراق نے {’’ تنزيہ الشريعة المرفوعة عن الأخبار الشنيعة الموضوعة ‘‘} میں یہ روایت ذکر کرکے فرمایا : ’’ابن تیمیہ رحمہ اللہ نے فرمایا، یہ روایت موضوع ہے۔‘‘ علاوہ ازیں یہ روایت ان آیات و احادیث کے بھی خلاف ہے جن میں دعا کرنے کا حکم دیا گیا ہے، فرمایا : «{ وَ قَالَ رَبُّكُمُ ادْعُوْنِيْۤ اَسْتَجِبْ لَكُمْ اِنَّ الَّذِيْنَ يَسْتَكْبِرُوْنَ عَنْ عِبَادَتِيْ سَيَدْخُلُوْنَ جَهَنَّمَ دٰخِرِيْنَ }» [ المؤمن : ۶۰ ] ’’اور تمھارے رب نے فرمایا، مجھے پکارو میں تمھاری دعا قبول کروں گا۔ بے شک وہ لوگ جو میری عبادت سے تکبر کرتے ہیں عنقریب ذلیل ہو کر جہنم میں داخل ہوں گے۔‘‘ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ لَمْ يَدْعُ اللّٰهَ يَغْضَبْ عَلَيْهِ ] [ سلسلۃ الأحادیث الصحیحۃ : 153/6، ح : ۲۶۵۴۔ ترمذی : ۳۳۷۳۔ ابن ماجہ : ۳۸۲۷ ] ’’جو اللہ تعالیٰ سے دعا نہ کرے اللہ تعالیٰ اس پر غصے ہو جاتا ہے۔‘‘ ¤ کعب احبار والی باطل روایت صحیح بخاری کی اس حدیث کے بھی خلاف ہے جو اوپر گزری کہ ابراہیم علیہ السلام نے آگ میں پھینکے جانے کے وقت آخری الفاظ {’’ حَسْبِيَ اللّٰهُ وَ نِعْمَ الْوَكِيْلُ ‘‘ } کہے تھے۔ قرآن میں ابراہیم علیہ السلام کی بہت سی دعائیں مذکور ہیں، اگر دعا کے بجائے اللہ تعالیٰ کا علم ہی کافی ہو تو اللہ تعالیٰ کو تو ہر شخص کی ہر حالت کا علم ہے، پھر اس سے دعا اور سوال کا معاملہ تو سرے سے ختم ہے، حالانکہ دعا اس لیے نہیں ہوتی کہ اللہ تعالیٰ کو ہماری حالت کا علم نہیں بلکہ دعا خود ایک عبادت ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلدُّعَاءُ هُوَ الْعِبَادَةُ ] [ ترمذی، التفسیر، باب ومن سورۃ البقرۃ : ۲۹۶۹ ] ’’دعا ہی عبادت ہے۔‘‘ اسی حدیث میں ہے کہ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «{ وَ قَالَ رَبُّكُمُ ادْعُوْنِيْۤ اَسْتَجِبْ لَكُمْ اِنَّ الَّذِيْنَ يَسْتَكْبِرُوْنَ عَنْ عِبَادَتِيْ سَيَدْخُللُوْنَ جَهَنَّمَ دٰخِرِيْنَ }» [ المؤمن : ۶۰ ] ’’اور تمھارے رب نے فرمایا مجھے پکارو، میں تمھاری دعا قبول کروں گا۔ بے شک وہ لوگ جو میری عبادت سے تکبر کرتے ہیں عنقریب ذلیل ہو کر جہنم میں داخل ہوں گے۔‘‘ بعض صوفیاء نے جو اس باطل روایت کو دلیل بنا کر کہا ہے کہ تمھارا اس سے سوال کرنا تمھاری طرف سے اس پر تہمت لگانا ہے، یہ ان کی بہت بڑی گمراہی ہے کہ اللہ تعالیٰ سے دعا کرنے کو اللہ تعالیٰ پر تہمت لگانا قرار دے رہے ہیں۔ (خلاصہ سلسلہ صحیحہ) شیخ محمد امین شنقیطی رحمہ اللہ ’’اضواء البیان‘‘ میں فرماتے ہیں : ’’ابوالعالیہ سے روایت ہے کہ اگر اللہ تعالیٰ {’’ وَ سَلٰمًا ‘‘} نہ فرماتے تو اس کی سردی ان کے لیے اس کی گرمی سے زیادہ تکلیف دہ ہوتی اور اگر {’’ عَلٰۤى اِبْرٰهِيْمَ ‘‘} نہ فرماتے تو اس کی ٹھنڈک ہمیشہ تک باقی رہتی۔ اور سدی سے ہے کہ اس دن جو آگ بھی تھی بجھ گئی۔ اور کعب اور قتادہ سے ہے کہ آگ نے صرف ابراہیم علیہ السلام کو باندھنے والی رسیاں جلائیں۔ اور نہال بن عمرو سے ہے کہ ابراہیم علیہ السلام نے فرمایا : ’’میں ان ایام جیسا خوش حال کبھی نہیں رہا جن دنوں میں آگ میں تھا۔‘‘ اور شعیب حمانی سے ہے کہ انھیں آگ میں ڈالا گیا تو ان کی عمر سولہ (۱۶) سال تھی۔ اور ابن جریج سے ہے کہ اس وقت وہ چھبیس (۲۶) برس کے تھے۔ اور کلبی سے ہے کہ جتنی آگیں تھیں سب ٹھنڈی ہو گئیں، چنانچہ کسی آگ نے ایک کھری تک نہیں پکائی۔ اور بعض نے قصے میں ذکر کیا ہے کہ نمرود نے اپنے محل میں سے جھانکا تو دیکھا کہ ابراہیم علیہ السلام تخت پر ہیں اور سایوں کا فرشتہ ان کا دل لگا رہا ہے، تو اس نے کہا، تیرا رب بہت اچھا رب ہے، میں اس کے لیے چار ہزار گائیں قربانی کروں گا اور پھر اس نے ابراہیم علیہ السلام کو کچھ نہیں کہا۔‘‘ ¤ شیخ شنقیطی رحمہ اللہ یہ سب کچھ لکھنے کے بعد فرماتے ہیں : ’’یہ سب اسرائیلیات ہیں اور مفسرین اس قصے میں اور دوسرے بہت سے قصوںمیں ایسی بہت سی باتیں بیان کر دیتے ہیں۔‘‘ یہاں تھوڑا سا غور کرنے کی ضرورت ہے کہ یہ سب تابعین اور راوی اس وقت تو موجود ہی نہ تھے جب ابراہیم علیہ السلام کو آگ میں پھینکا گیا، نہ ان پر وحی اتری اور نہ وہ درمیان کی کوئی سند بیان کرتے ہیں، پھر انھیں ان باتوں کا پتا کیسے چلا؟ ظاہر ہے یہ وہی سنی سنائی باتیں ہیں جنھیں تفسیر قرآن میں کسی طرح بھی قبول نہیں کیا جا سکتا۔ مزید دیکھیے اس تفسیر کا مقدمہ۔ ¤ ➏ یہ واقعہ حق کی طرف دعوت اور اس پر استقامت کا عجیب و غریب واقعہ ہے۔ اس میں ہمارے نبی کریم صلی اللہ علیہ وسلم اور پوری امت مسلمہ کے لیے حق کی خاطر جان کی بازی لگا دینے کا سبق ہے اور یہ بھی کہ جب اللہ تعالیٰ چاہتا ہے تو تمام اسباب ختم ہونے کے باوجود اپنے بندے کا بال بھی بیکا نہیں ہونے دیتا۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) { وَ اَرَادُوْا بِهٖ كَيْدًا … : ’’ الْاَخْسَرِيْنَ ‘‘} اگرچہ اسم تفضیل ہے، مگر یہاں کسی سے زیادہ خسارا اٹھانے والے مراد نہیں، بلکہ یہ خاسرین میں مبالغہ ہے، اس لیے ترجمہ ’’انتہائی خسارے والے‘‘ کیا گیا ہے۔ اگر تفضیل کا معنی لیں تو {’’أَخْسَرِيْنَ مِنْ كُلِّ خَاسِرٍ‘‘} مراد ہو گا، یعنی ہر خسارے والے سے زیادہ خسارے والے۔ {’’ كَيْدًا ‘‘} خفیہ تدبیر کو کہتے ہیں۔ معلوم ہوتا ہے کہ کفار نے ابراہیم علیہ السلام کو جلانے کی سازش ان سے خفیہ رکھی تھی۔ شاید ان کا مقصد یہ ہو کہ ابراہیم علیہ السلام ہاتھ سے نہ نکل جائیں۔ (ابن عاشور) {’’ فَجَعَلْنٰهُمُ الْاَخْسَرِيْنَ ‘‘} میں {’’هُمْ‘‘} اور {’’ الْاَخْسَرِيْنَ ‘‘} دونوں کے معرفہ ہونے سے قصر کا فائدہ حاصل ہوتا ہے کہ بس وہی انتہائی خسارے والے ہوئے، ابراہیم علیہ السلام کو ذرہ بھر خسارا نہیں ہوا۔ انھیں خسارے والے (ناکام) اس لیے قرار دیا کہ وہ ابراہیم علیہ السلام کی کسی بھی دلیل کا جواب نہ دے سکے جس کے ساتھ انھوں نے سورج، چاند اور ستاروں کو بے بس ثابت کیا، یا جس کے ساتھ انھوں نے بادشاہ کا بے اختیار ہونا ثابت کیا، یا بتوں کا معبود نہ ہونا ثابت کیا۔ پھر نہ ان سے بت توڑنے کا انتقام لے سکے اور نہ انھیں آگ میں جلا سکے، بلکہ وہ سب کچھ جو انھوں نے انھیں سزا دینے کے لیے تیار کیا تھا ان کے لیے معجزہ اور ان کی عظمتِ شان کا باعث بن گیا اور انتہائی خسارا یہ کہ اس واقعہ کے بعد اس قوم پر اللہ تعالیٰ کا عذاب آ گیا، جیسا کہ سورۂ حج میں ان قوموں کا ذکر فرمایا جن پر اللہ کا عذاب آیا، تو ان میں قوم ابراہیم کا بھی ذکر ہے، آخر میں فرمایا : «{ فَاَمْلَيْتُ لِلْكٰفِرِيْنَ ثُمَّ اَخَذْتُهُمْ فَكَيْفَ كَانَ نَكِيْرِ }» [ الحج : ۴۴ ] ’’تو میں نے ان کافروں کو مہلت دی، پھر میں نے انھیں پکڑ لیا تو میرا عذاب کیسا تھا؟‘‘"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) { وَ نَجَّيْنٰهُ وَ لُوْطًا … :} اس واقعہ کو دیکھ کر لوط علیہ السلام ابراہیم علیہ السلام پر ایمان لے آئے۔ دیکھیے سورۂ عنکبوت (۲۶) اور جس طرح اللہ تعالیٰ نے ابراہیم علیہ السلام کو آگ میں جلنے سے محفوظ رکھا تھا اسی طرح ابراہیم اور لوط علیھما السلام دونوں کو ان ظالموں کے پنجے سے بحفاظت نکال کر شام کی طرف ہجرت کرنے کی آسانی عطا فرمائی۔ یہ بھی عظیم احسان تھا، کیونکہ وہاں سے ان کا نکلنا آسان نہ تھا۔ شام کی طرف ہجرت سے معلوم ہوا کہ ابراہیم علیہ السلام عراق کے رہنے والے تھے۔ برکت والی زمین کی تفسیر کے لیے دیکھیے سورۂ بنی اسرائیل (۱) کی تفسیر۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) ➊ {وَ وَهَبْنَا لَهٗۤ اِسْحٰقَ وَ يَعْقُوْبَ نَافِلَةً:’’ نَافِلَةً ‘‘} کا معنی زائد عطیہ ہے۔ اس آیت کے دو معنی ہیں، ایک یہ کہ ہم نے اسے اسحاق عطا کیا اور زائد انعام کے طور پر یعقوب (پوتا) عطا کیا۔ دوسرا معنی یہ ہے کہ ہم نے اسے اسحاق اور یعقوب دونوں زائد انعام کے طور پر عطا کیے۔ مفسر ابن عاشور رحمہ اللہ نے اس کی بہت عمدہ توجیہ فرمائی ہے کہ سورۂ صافات (۱۰۰) میں مذکور ہے کہ جب ابراہیم علیہ السلام ہجرت کے لیے روانہ ہوئے تو انھوں نے اللہ تعالیٰ سے دعا کی : «{ رَبِّ هَبْ لِيْ مِنَ الصّٰلِحِيْنَ }» ’’اے میرے رب! مجھے (لڑکا) عطا کر جو نیکوں سے ہو۔‘‘ فرمایا : «{ فَبَشَّرْنٰهُ بِغُلٰمٍ حَلِيْمٍ }» [ الصافات : ۱۰۱ ] ’’تو ہم نے اسے ایک بہت بردبار لڑکے کی بشارت دی۔‘‘ یہ بردبار لڑکا اسماعیل علیہ السلام تھے جن کی قربانی کا واقعہ بھی اس مقام پر مذکور ہے۔ ابراہیم علیہ السلام کی دعا تو اسماعیل علیہ السلام کی ولادت سے قبول ہو گئی تھی، اس کے بعد اللہ تعالیٰ نے اسحاق اور یعقوب علیھما السلام جو عطا کیے تو وہ بغیر دعا اور بغیر امید کے عطا فرمائے، اس لیے دونوں کو زائد عطیہ قرار دیا جو اسماعیل علیہ السلام کے بعد بلاطلب عطا ہوئے۔ دونوں کی خوش خبری بھی اکٹھی دی گئی تھی : «{ فَبَشَّرْنٰهَابِاِسْحٰقَ وَ مِنْ وَّرَآءِ اِسْحٰقَ يَعْقُوْبَ }» [ ھود : ۷۱ ] ’’تو ہم نے اس (سارہ) کو اسحاق کی بشارت دی اور اسحاق کے بعد یعقوب کی۔‘‘ ¤ ➋ {وَ كُلًّا جَعَلْنَا صٰلِحِيْنَ : ’’ كُلًّا ‘‘} سے مراد ابراہیم، اسحاق اور یعقوب علیھم السلام ہیں، کیونکہ آخری بات انھی کی ذکر ہوئی ہے۔ لوط علیہ السلام کا ذکر ابراہیم علیہ السلام کی معیت کے طور پر آیا ہے، ان کا الگ ذکر آگے آ رہا ہے۔ [ التحریر والتنویر ] {’’صٰلِحِيْنَ ‘‘} اصلاح فساد کی ضد ہے۔ {’’ صَلَحَ ‘‘} (ف، ک) درست ہونا، یعنی ہم نے ان تمام پیغمبروں کو درست عقیدے اور درست عمل والا اپنا مکمل فرماں بردار بنایا۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) ➊ { وَ جَعَلْنٰهُمْ اَىِٕمَّةً يَّهْدُوْنَ بِاَمْرِنَا :} یعنی وہ صرف خود ہی ہر لحاظ سے درست اور ہمارے مکمل فرماں بردار نہ تھے، بلکہ وہ اپنی قوم کے پیشوا بھی تھے جو ہماری وحی کے مطابق دوسروں کو بھی حق کی طرف دعوت دیتے تھے۔ معلوم ہوا اصل ہدایت وہی ہے جو اللہ تعالیٰ کے حکم کے مطابق ہو اور جو ائمہ اللہ کے حکم کے بغیر حکم دیں تو وہ ہدایت کے امام نہیں، گمراہی کے امام ہیں۔ ¤ ➋ {وَ اَوْحَيْنَاۤ اِلَيْهِمْ فِعْلَ الْخَيْرٰتِ … :} یعنی صالحیت اور امامت کے علاوہ ہم نے انھیں اپنی وحی سے بھی سرفراز فرمایا۔ {’’فِعْلَ الْخَيْرٰتِ ‘‘} میں اگرچہ تمام نیک اعمال آ جاتے ہیں مگر اسلام لانے کے بعد اللہ کے حقوق میں سے سب سے اہم عمل نماز اور بندوں کے حقوق میں سے سب سے اہم حق زکوٰۃ کا ذکر خاص طور پر فرمایا، کیونکہ اگر یہ نہیں تو اسلام بھی معتبر نہیں۔ دیکھیے سورۂ توبہ (۵)۔ ¤ ➌ {وَ كَانُوْا لَنَا عٰبِدِيْنَ : ’’ لَنَا ‘‘} پہلے آنے سے کلام میں حصر پیدا ہو گیا، یعنی وہ صرف ہماری عبادت کرنے والے تھے، کسی اور کو ہمارے ساتھ شریک کرنے والے نہ تھے۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 75،74) {وَ لُوْطًا اٰتَيْنٰهُ حُكْمًا وَّ عِلْمًا …:} لوط علیہ السلام کا ذکر الگ کرنے سے ظاہر ہو رہا ہے کہ انھیں پہلے تینوں انبیاء کے علاقے اور قوم کے علاوہ کسی دوسرے علاقے اور قوم کی طرف بھیجا گیا تھا۔ لوط علیہ السلام کا قصہ سورۂ اعراف (۸۰)، ہود (۸۱) اور حجر (۶۱) میں گزر چکا ہے۔ ان کی بستی کے خبیث اعمال کا ذکر گزشتہ سورتوں کے علاوہ سورۂ عنکبوت (۲۸ تا ۳۵) اور سورۂ قمر (۳۳ تا ۳۷) وغیرہ میں بھی موجود ہے۔ اس بستی کا نام سدوم مشہور ہے۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75،74) {وَ لُوْطًا اٰتَيْنٰهُ حُكْمًا وَّ عِلْمًا …:} لوط علیہ السلام کا ذکر الگ کرنے سے ظاہر ہو رہا ہے کہ انھیں پہلے تینوں انبیاء کے علاقے اور قوم کے علاوہ کسی دوسرے علاقے اور قوم کی طرف بھیجا گیا تھا۔ لوط علیہ السلام کا قصہ سورۂ اعراف (۸۰)، ہود (۸۱) اور حجر (۶۱) میں گزر چکا ہے۔ ان کی بستی کے خبیث اعمال کا ذکر گزشتہ سورتوں کے علاوہ سورۂ عنکبوت (۲۸ تا ۳۵) اور سورۂ قمر (۳۳ تا ۳۷) وغیرہ میں بھی موجود ہے۔ اس بستی کا نام سدوم مشہور ہے۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 77،76) ➊ ابراہیم علیہ السلام کو آگ سے نجات دینے کے بعد نوح علیہ السلام کو پانی کے طوفان سے نجات دینے کا ذکر فرمایا۔ ¤ ➋ { وَ نُوْحًا اِذْ نَادٰى مِنْ قَبْلُ …:} نوح علیہ السلام کی اس دعا کا ذکر سورۂ نوح (۲۶ تا ۲۸) میں تفصیل سے مذکور ہے، اسی طرح سورۂ قمر میں ہے : «{ فَدَعَا رَبَّهٗۤ اَنِّيْ مَغْلُوْبٌ فَانْتَصِرْ }» [ القمر :۱۰] ’’تو اس نے اپنے رب کو پکارا کہ میں مغلوب ہوں سو تو بدلہ لے۔‘‘ ¤ ➌ { فَنَجَّيْنٰهُ وَ اَهْلَهٗ : ’’ اَهْلَهٗ ‘‘} سے مراد ان کے مشرک بیٹے اور بیوی کے سوا باقی گھر والے ہیں۔ بیٹے کے متعلق دیکھیے سورۂ ہود (۴۰ تا ۴۳) اور بیوی کے متعلق سورۂ تحریم (۱۰)۔ ¤ ➍ {مِنَ الْكَرْبِ الْعَظِيْمِ: ’’ الْكَرْبِ ‘‘} کا معنی ہے {’’أَقْصَي الْغَمِّ ‘‘} یعنی آخری حد کو پہنچا ہوا غم۔ {’’ الْكَرْبِ الْعَظِيْمِ ‘‘} سے مراد کفار کی نوح علیہ السلام سے ساڑھے نو سو برس کی مسلسل مخالفت، بدسلوکی، ایذا رسانی، استہزا اور سنگسار کرنے کی دھمکیاں بھی ہیں، جن کا شکوہ انھوں نے اللہ تعالیٰ کے حضور کیا، جو سورۂ نوح کی آیت (۵) سے آیت (۲۴) تک میں مذکور ہے اور جن کا ذکر سورۂ ہود (۳۸) اور شعراء (۱۱۶) میں ہے۔ پہاڑوں جیسی موجوں والا طوفان بھی مراد ہے، جس نے اللہ کے حکم سے زمین پر بسنے والا ایک مشرک بھی باقی نہ چھوڑا۔ ¤ ➎ { فَاَغْرَقْنٰهُمْ اَجْمَعِيْنَ :} اس کی تفصیل سورۂ ہود (۳۷ تا ۴۹) میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77،76) ➊ ابراہیم علیہ السلام کو آگ سے نجات دینے کے بعد نوح علیہ السلام کو پانی کے طوفان سے نجات دینے کا ذکر فرمایا۔ ¤ ➋ { وَ نُوْحًا اِذْ نَادٰى مِنْ قَبْلُ …:} نوح علیہ السلام کی اس دعا کا ذکر سورۂ نوح (۲۶ تا ۲۸) میں تفصیل سے مذکور ہے، اسی طرح سورۂ قمر میں ہے : «{ فَدَعَا رَبَّهٗۤ اَنِّيْ مَغْلُوْبٌ فَانْتَصِرْ }» [ القمر :۱۰] ’’تو اس نے اپنے رب کو پکارا کہ میں مغلوب ہوں سو تو بدلہ لے۔‘‘ ¤ ➌ { فَنَجَّيْنٰهُ وَ اَهْلَهٗ : ’’ اَهْلَهٗ ‘‘} سے مراد ان کے مشرک بیٹے اور بیوی کے سوا باقی گھر والے ہیں۔ بیٹے کے متعلق دیکھیے سورۂ ہود (۴۰ تا ۴۳) اور بیوی کے متعلق سورۂ تحریم (۱۰)۔ ¤ ➍ {مِنَ الْكَرْبِ الْعَظِيْمِ: ’’ الْكَرْبِ ‘‘} کا معنی ہے {’’أَقْصَي الْغَمِّ ‘‘} یعنی آخری حد کو پہنچا ہوا غم۔ {’’ الْكَرْبِ الْعَظِيْمِ ‘‘} سے مراد کفار کی نوح علیہ السلام سے ساڑھے نو سو برس کی مسلسل مخالفت، بدسلوکی، ایذا رسانی، استہزا اور سنگسار کرنے کی دھمکیاں بھی ہیں، جن کا شکوہ انھوں نے اللہ تعالیٰ کے حضور کیا، جو سورۂ نوح کی آیت (۵) سے آیت (۲۴) تک میں مذکور ہے اور جن کا ذکر سورۂ ہود (۳۸) اور شعراء (۱۱۶) میں ہے۔ پہاڑوں جیسی موجوں والا طوفان بھی مراد ہے، جس نے اللہ کے حکم سے زمین پر بسنے والا ایک مشرک بھی باقی نہ چھوڑا۔ ¤ ➎ { فَاَغْرَقْنٰهُمْ اَجْمَعِيْنَ :} اس کی تفصیل سورۂ ہود (۳۷ تا ۴۹) میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 79،78) ➊ {وَ دَاوٗدَ وَ سُلَيْمٰنَ اِذْ يَحْكُمٰنِ فِي الْحَرْثِ …: ’’ نَفَشَتْ ‘‘} کا معنی ہے جانوروں کا رات کو کھیت میں پھیل جانا اور اس کی کھیتی اور پودوں کو کھا جانا۔ {’’ غَنَم‘‘} کا لفظ بھیڑ بکری دونوں پر آتا ہے۔ ان آیات میں اللہ تعالیٰ نے داؤد اور سلیمان علیھما السلام کو عطا کردہ نعمتوں کا ذکر فرمایا ہے۔ پہلے وہ نعمت ذکر فرمائی جو دونوں کو عطا ہوئی تھی اور جو بعد میں آنے والی تمام نعمتوں سے افضل ہے، چنانچہ فرمایا : «{ وَ كُلًّا اٰتَيْنَا حُكْمًا وَّ عِلْمًا » ’’ حُكْمًا ‘‘} سے مراد قوت فیصلہ ہے اور {’’ عِلْمًا ‘‘} سے مراد علم شریعت ہے۔ ¤ ➋ ان آیات کی تفسیر رسول اللہ صلی اللہ علیہ وسلم سے نہیں آئی، البتہ ابن جریر نے ابن مسعود رضی اللہ عنہ سے نقل کیا ہے کہ انھوں نے اس آیت کے متعلق فرمایا : [ كَرْمٌ قَدْ أَنْبَتَتْ عَنَاقِيْدُهُ فَأَفْسَدَتْهُ الْغَنَمُ قَالَ فَقَضَی دَاوٗدُ بِالْغَنَمِ لِصَاحِبِ الْكَرْمِ، فَقَالَ سُلَيْمَانُ غَيْرُ هٰذَا يَا نَبِيَّ اللّٰهِ  ! قَالَ وَمَا ذٰلِكَ؟ قَالَ تَدْفَعُ الْكَرْمَ اِلٰي صَاحِبِ الْغَنَمِ فَيَقُوْمُ عَلَيْهِ حَتّٰی يَعُوْدَ كَمَا كَانَ وَتَدْفَعُ الْغَنَمَ اِلٰي صَاحِبِ الْكَرْمِ فَيُصِيْبَ مِنْهَا حَتّٰی إإِذَا عَادَ الْكَرْمَ كَمَا كَانَ دَفَعْتَ الْكَرْمَ اِلٰی صَاحِبِهِ وَدَفَعْتَ الْغَنَمَ اِلٰی صَاحِبِهَا قَالَ اللّٰهُ عَزَّوَجَلَّ: «{ فَفَهَّمْنٰهَا سُلَيْمٰنَ وَ كُلًّا اٰتَيْنَا حُكْمًا وَّ عِلْمًا }» ] [ مستدرک : 588/2، ح : ۴۱۳۸ ] ’’یہ انگور کی بیلیں تھیں جن کے گچھے نکل چکے تھے، جنھیں بھیڑ بکریوں نے اجاڑ دیا تھا۔ فرماتے ہیں کہ داؤد علیہ السلام نے فیصلہ فرمایا کہ بھیڑ بکریاں انگور کی بیلوں کے مالک کو دے دی جائیں، تو سلیمان علیہ السلام نے کہا : ’’اے اللہ کے نبی! اس کا فیصلہ اور ہے۔‘‘ انھوں نے پوچھا : ’’وہ کیا ہے؟‘‘ عرض کی: ’’آپ انگور کی بیلیں بھیڑ بکریوں والے کے حوالے کر دیں، وہ ان کی نگہداشت کرے جب تک وہ دوبارہ پہلے جیسی نہ ہو جائیں اور بھیڑ بکریاں انگور کی بیلوں والے کے حوالے کر دیں، وہ اس وقت تک ان سے فائدہ اٹھاتا رہے اور جب انگوروں کی بیلیں پہلی حالت پر لوٹ آئیں تو آپ انگوروں کی بیلیں اس کے مالک کے سپرد اور بھیڑ بکریاں اس کے مالک کے سپرد کر دیں۔‘‘ تو اللہ تعالیٰ نے فرمایا : ’’تو ہم نے وہ (فیصلہ) سلیمان کو سمجھا دیا اور ہم نے ہر ایک کو حکم اور علم عطا کیا۔‘‘ ابن کثیر کے محقق دکتور حکمت بن بشیر نے فرمایا : ’’حاکم نے اسے روایت کرکے صحیح کہا ہے اور ذہبی نے ان کی موافقت کی ہے۔ (اس سند میں ابو اسحاق کی تدلیس موجود ہے)۔‘‘ دکتور حکمت بن بشیر لکھتے ہیں : ’’طبری نے صحیح سند کے ساتھ مجاہد کا یہی قول نقل فرمایا ہے اور قتادہ اور ابن زید کا یہی قول صحیح سند کے ساتھ مسند عبد الرزاق میں بھی مروی ہے۔‘‘ اللہ تعالیٰ نے یہ واقعہ ذکر کرتے ہوئے فرمایا کہ ہم داؤد اور سلیمان کے فیصلے کے وقت حاضر تھے، یعنی ہمیں اس کی ایک ایک جزئی کا پورا علم ہے۔ اگرچہ ابن مسعود رضی اللہ عنہ نے یہ تفسیر رسول اللہ صلی اللہ علیہ وسلم سے سننے کی صراحت نہیں کی، تاہم واقعہ کی صورت وہی معلوم ہوتی ہے جو انھوں نے بیان کی ہے۔ اس لیے بھی کہ بائبل میں اس واقعہ کا ذکر نہیں اور نہ یہ یہودی لٹریچر میں معروف ہے اور پھر عبد اللہ بن مسعود رضی اللہ عنہ اسرائیلیات بیان کرنے میں معروف بھی نہیں ہیں۔ ¤ ➌ داؤد اور سلیمان علیھما السلام دونوں میں سے ہر ایک کا فیصلہ ان کا اجتہاد تھا، کیونکہ اگر وہ وحی سے ہوتا تو داؤد علیہ السلام کے فیصلے کے بعد اور فیصلے کی گنجائش نہ ہوتی۔ انبیاء بھی اجتہاد فرماتے ہیں مگر ان کے اجتہاد اور دوسرے لوگوں کے اجتہاد میں یہ فرق ہے کہ انبیاء کے اجتہاد میں اگر کوئی خطا ہو تو اللہ تعالیٰ اس کی اصلاح کر دیتا ہے، جیسا کہ یہاں سلیمان علیہ السلام کے فیصلے کے ساتھ اس کی اصلاح فرما دی اور جیسا کہ اللہ تعالیٰ نے ہمارے نبی کریم صلی اللہ علیہ وسلم کو فرمایا : «{ عَفَا اللّٰهُ عَنْكَ لِمَ اَذِنْتَ لَهُمْ }» [ التوبۃ : ۴۳ ] ’’اللہ نے تجھے معاف کر دیا، تو نے انھیں کیوں اجازت دی۔‘‘ اور فرمایا : «{ يٰۤاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ لَكَ }» [ التحریم : ۱ ] ’’اے نبی! تو کیوں حرام کرتا ہے جو اللہ نے تیرے لیے حلال کیا ہے؟‘‘ اگر کسی بات پر اللہ تعالیٰ خاموشی اختیار فرمائے، تو وہ اللہ تعالیٰ کی موافقت کی وجہ سے حق ہوتی ہے اور وحی کا حکم رکھتی ہے، یہی مطلب ہے اللہ تعالیٰ کے اس فرمان : «{ وَ مَا يَنْطِقُ عَنِ الْهَوٰى (3) اِنْ هُوَ اِلَّا وَحْيٌ يُّوْحٰى }» [ النجم : ۳، ۴ ] کا۔ انبیاء علیھم السلام کے سوا کسی مجتہد کی خطا کی بذریعہ وحی اصلاح نہیں ہوتی، اس لیے ان کے اجتہادات شریعت میں حجت نہیں ہیں۔ ¤ ➍ مسئلہ : اگر کسی کے جانور دن کے وقت کسی دوسرے کے کھیت یا باغ کو چر جائیں تو جانور والے پر کوئی تاوان نہیں ہے اور اگر رات کے وقت چر جائیں تو جس قدر نقصان ہو اس قدر تاوان جانور والے کے ذمے ہو گا، جیسا کہ براء بن عازب رضی اللہ عنھما سے روایت ہے کہ میری ایک اونٹنی تھی جو بہت نقصان کیا کرتی تھی، ایک دفعہ وہ ایک باغ میں داخل ہو گئی اور وہاں نقصان کر دیا۔ رسول اللہ صلی اللہ علیہ وسلم سے اس بارے میں بات کی گئی تو آپ نے فیصلہ فرمایا : ’’ دن کے وقت باغات کی نگرانی اور حفاظت ان کے مالکوں کے ذمے ہے اور رات کے وقت جانوروں کی نگرانی ان کے مالکوں کے ذمے ہے اور رات کے وقت جانور جو نقصان کر جائیں تو وہ ان کے مالکوں کے ذمے ہے (کہ اسے پورا کریں)۔‘‘ [ أبو داوٗد، الإجارۃ، باب المواشی تفسد زرع قوم : ۳۵۷۰۔ ابن ماجہ : ۲۳۳۲۔ سلسلۃ الأحادیث الصحیحۃ : 237/1، ح:۲۳۸ ] بعض لوگوں کا کہنا ہے کہ جانور والے پر کسی صورت تاوان نہیں ہے اور دلیل میں {’’اَلْعَجْمَاءُ جُرْحُهَا جُبَارٌ‘‘} (جانور کا کسی کو زخمی کر دینا رائگاں ہے) پیش کرتے ہیں، حالانکہ اس حدیث میں صرف زخم کے معاف ہونے کا ذکر ہے، کھیت کے نقصان کے معاف ہونے کا ذکر نہیں ہے۔ لہٰذا براء بن عازب رضی اللہ عنھما والی حدیث میں اور اس میں کوئی تعارض نہیں ہے کہ براء رضی اللہ عنھما کی حدیث کو منسوخ کہا جائے۔ (قرطبی) ¤ ➎ اس آیت سے اس حدیث کی تائید ہوتی ہے جو عمرو بن العاص رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ ثُمَّ أَصَابَ فَلَهٗ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ ثُمَّ أَخْطَأَ فَلَهٗ أَجْرٌ ] [ بخاري، الاعتصام بالکتاب والسنۃ، باب أجر الحاکم إذا اجتھد… : ۷۳۵۲ ] ’’جب حاکم فیصلہ کرے اور پوری کوشش کرے، پھر درست فیصلہ کرے تو اس کے لیے دو اجر ہیں اور جب وہ فیصلہ کرے اور پوری کوشش کرے، پھر خطا کر جائے تو اس کے لیے ایک اجر ہے۔‘‘ یہاں اللہ تعالیٰ نے اگرچہ {’’ فَفَهَّمْنٰهَا سُلَيْمٰنَ ‘‘} (ہم نے وہ فیصلہ سلیمان کو سمجھا دیا) کہہ کر سلیمان علیہ السلام کے فیصلے کی تائید فرمائی، مگر داؤد اور سلیمان دونوں کے متعلق فرمایا : «وَ كُلًّا اٰتَيْنَا حُكْمًا وَّ عِلْمًا» کہ ہم نے ہر ایک کو حکم اور علم عطا کیا۔ ¤ ➏ ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے سلیمان علیہ السلام کے کمال فہم و ذکاوت کا ایک اور واقعہ روایت کیا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا : [ كَانَتِ امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا فَقَالَتْ صَاحِبَتُهَا إِنَّمَا ذَهَبَ بِابْنِكِ، وَقَالَتِ الْأُخْرَی إِنَّمَا ذَهَبَ بِابْنِكِ، فَتَحاكَمَتَا إِلٰی دَاوٗدَ فَقَضَی بِهِ لِلْكُبْرٰی، فَخَرَجَتَا عَلٰی سسُلَيْمَانَ بْنِ دَاوٗدَ عَلَيْهِمَا السَّلاَمُ فَأَخْبَرَتَاهٗ فَقَالَ ائْتُوْنِيْ بِالسِّكِّيْنِ أَشُقُّهُ بَيْنَهُمَا، فَقَالَتِ الصُّغْرٰی لاَ تَفْعَلْ يَرْحَمُكَ اللّٰهُ، هُوَ ابْنُهَا ، فَقَضَی بِهِ لِلْصُّغْرٰی] [بخاري، الأنبیاء، باب قول اللہ تعالٰی : « ووھبنا لداوٗد سلیمان … » : ۳۴۲۷۔ مسلم : ۱۷۲۰۔ نسائی : ۵۴۰۵ ] ’’دو عورتیں تھیں جن کے پاس ان کے بیٹے تھے۔ بھیڑیا آیا اور ان میں سے ایک کے بیٹے کو لے گیا۔ وہ اپنی ساتھی عورت سے کہنے لگی کہ وہ تو تمھارا بیٹا لے گیا ہے۔ دوسری کہنے لگی، وہ تمھارا بیٹا ہی لے گیا ہے۔ چنانچہ وہ دونوں فیصلے کے لیے داؤد علیہ السلام کے پاس گئیں۔ انھوں نے اس کا فیصلہ بڑی کے حق میں کر دیا۔ دونوں جاتے ہوئے سلیمان بن داؤد علیھما السلام کے پاس سے گزریں تو انھیں یہ بات بتائی، انھوں نے فرمایا : ’’میرے پاس چاقو لاؤ، میں اسے دونوں کے درمیان چیر دوں۔‘‘ تو چھوٹی نے کہا : ’’ایسا نہ کریں، اللہ آپ پر رحم کرے، یہ اسی کا بیٹا ہے۔‘‘ چنانچہ انھوں نے اس کا فیصلہ چھوٹی کے حق میں کر دیا۔‘‘ امام نسائی نے اس حدیث پر باب باندھا ہے کہ حاکم کے لیے گنجائش ہے کہ جو کام اس نے نہیں کرنا، اس کے متعلق کہے کہ میں ایسا کرتا ہوں، تا کہ حق واضح ہو جائے۔ ¤ ➐ اس واقعہ سے یہ بھی معلوم ہوا کہ بعض اوقات بیٹا باپ سے زیادہ بات سمجھ لیتا ہے، اس میں کفار عرب کے لیے بھی سبق ہے جو رسول اللہ صلی اللہ علیہ وسلم کی رہنمائی کے باوجود آبا و اجداد کی رسوم چھوڑنے پر تیار نہ تھے اور ان مقلدین کے لیے بھی جنھوں نے چار اماموں کے بعد اجتہاد کا دروازہ قیامت تک کے لیے بند کر دیا ہے۔ بتائیے اس سے بڑھ کر اللہ تعالیٰ کے فیض عام کی توہین اور کیا ہو گی؟ ¤ ➑ { وَ سَخَّرْنَا مَعَ دَاوٗدَ الْجِبَالَ يُسَبِّحْنَ وَ الطَّيْرَ :} اس سے پہلے ابراہیم اور نوح علیھما السلام کی خاطر آگ اور پانی کو مسخر کرنے کا ذکر فرمایا تھا۔ اب داؤد اور سلیمان علیھما السلام دونوں پر مشترکہ نعمت حکم و علم کا ذکر کرنے کے بعد دونوں کو عطا کر دہ نعمتیں الگ الگ ذکر فرمائیں۔ چنانچہ داؤد علیہ السلام کے ساتھ اللہ تعالیٰ نے پہاڑوں اور پرندوں کو مسخر اور پابند کر دیا اور انھیں اتنی خوبصورت آواز عطا فرمائی کہ جب وہ اللہ کی کتاب زبور پڑھتے یا تسبیح کرتے تو پہاڑ اور پرندے بھی ان کے ساتھ تسبیح کرتے۔ سورۂ سبا میں فرمایا : «{ يٰجِبَالُ اَوِّبِيْ مَعَهٗ وَ الطَّيْرَ }» [ سبا : ۱۰ ] ’’اے پہاڑو! اس کے ساتھ تسبیح کو دہراؤ اور پرندوں کو بھی (یہی حکم دیا)۔‘‘ سورۂ صٓ میں فرمایا : «{ اِنَّا سَخَّرْنَا الْجِبَالَ مَعَهٗ يُسَبِّحْنَ بِالْعَشِيِّ وَ الْاِشْرَاقِ (18) وَ الطَّيْرَ مَحْشُوْرَةً كُلٌّ لَّهٗۤ اَوَّابٌ }» [ صٓ : ۱۸، ۱۹ ] ’’بے شک ہم نے پہاڑوں کو اس کے ہمراہ مسخر کر دیا، وہ دن کے پچھلے پہر اور سورج چڑھنے کے وقت تسبیح کرتے تھے اور پرندوں کو بھی، جب کہ وہ اکٹھے کیے ہوتے، سب اس کے لیے رجوع کرنے والے تھے۔‘‘ سبحان اللہ! وہ کیسا حسین منظر ہو گا جب اللہ کے نبی داؤد علیہ السلام کے ساتھ پہاڑ اور پرندے بھی مصروف تسبیح ہوتے ہوں گے۔ بعض لوگوں نے پہاڑوں کی تسبیح کا مطلب داؤد علیہ السلام کی بلند اور سریلی آواز سے ان کا گونج اٹھنا اور پرندوں کی تسبیح سے مراد ان کا ٹھہر جانا قرار دیا ہے، مگر درحقیقت یہ پہاڑوں اور پرندوں کی ان کے ہمراہ تسبیح کو ناممکن سمجھ کر اس کا انکار ہے۔ اللہ تعالیٰ نے یہ چیز داؤد علیہ السلام پر خاص نعمت کے طورپر ذکر فرمائی ہے، پہاڑوں کی گونج تو ہر بلند آواز سے پیدا ہوتی ہے، اچھی ہو یا بری، اس میں داؤد علیہ السلام کی خصوصیت کیا ہوئی؟ اس لیے صحیح معنی یہی ہے کہ پہاڑ اور پرندے فی الواقع ان کے ہمراہ تسبیح کرتے تھے۔ مزید تفصیل کے لیے دیکھیے سورۂ بنی اسرائیل (۴۴)۔ ¤ ➒ { وَ كُنَّا فٰعِلِيْنَ :} یعنی تعجب مت کرو کہ وہ پہاڑ اور پرندے کیسے بولتے اور تسبیح کرتے تھے، یہ سب کچھ ہمارے کرنے سے ہوتا تھا۔ (کبیر)"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79،78) ➊ {وَ دَاوٗدَ وَ سُلَيْمٰنَ اِذْ يَحْكُمٰنِ فِي الْحَرْثِ …: ’’ نَفَشَتْ ‘‘} کا معنی ہے جانوروں کا رات کو کھیت میں پھیل جانا اور اس کی کھیتی اور پودوں کو کھا جانا۔ {’’ غَنَم‘‘} کا لفظ بھیڑ بکری دونوں پر آتا ہے۔ ان آیات میں اللہ تعالیٰ نے داؤد اور سلیمان علیھما السلام کو عطا کردہ نعمتوں کا ذکر فرمایا ہے۔ پہلے وہ نعمت ذکر فرمائی جو دونوں کو عطا ہوئی تھی اور جو بعد میں آنے والی تمام نعمتوں سے افضل ہے، چنانچہ فرمایا : «{ وَ كُلًّا اٰتَيْنَا حُكْمًا وَّ عِلْمًا » ’’ حُكْمًا ‘‘} سے مراد قوت فیصلہ ہے اور {’’ عِلْمًا ‘‘} سے مراد علم شریعت ہے۔ ¤ ➋ ان آیات کی تفسیر رسول اللہ صلی اللہ علیہ وسلم سے نہیں آئی، البتہ ابن جریر نے ابن مسعود رضی اللہ عنہ سے نقل کیا ہے کہ انھوں نے اس آیت کے متعلق فرمایا : [ كَرْمٌ قَدْ أَنْبَتَتْ عَنَاقِيْدُهُ فَأَفْسَدَتْهُ الْغَنَمُ قَالَ فَقَضَی دَاوٗدُ بِالْغَنَمِ لِصَاحِبِ الْكَرْمِ، فَقَالَ سُلَيْمَانُ غَيْرُ هٰذَا يَا نَبِيَّ اللّٰهِ  ! قَالَ وَمَا ذٰلِكَ؟ قَالَ تَدْفَعُ الْكَرْمَ اِلٰي صَاحِبِ الْغَنَمِ فَيَقُوْمُ عَلَيْهِ حَتّٰی يَعُوْدَ كَمَا كَانَ وَتَدْفَعُ الْغَنَمَ اِلٰي صَاحِبِ الْكَرْمِ فَيُصِيْبَ مِنْهَا حَتّٰی إإِذَا عَادَ الْكَرْمَ كَمَا كَانَ دَفَعْتَ الْكَرْمَ اِلٰی صَاحِبِهِ وَدَفَعْتَ الْغَنَمَ اِلٰی صَاحِبِهَا قَالَ اللّٰهُ عَزَّوَجَلَّ: «{ فَفَهَّمْنٰهَا سُلَيْمٰنَ وَ كُلًّا اٰتَيْنَا حُكْمًا وَّ عِلْمًا }» ] [ مستدرک : 588/2، ح : ۴۱۳۸ ] ’’یہ انگور کی بیلیں تھیں جن کے گچھے نکل چکے تھے، جنھیں بھیڑ بکریوں نے اجاڑ دیا تھا۔ فرماتے ہیں کہ داؤد علیہ السلام نے فیصلہ فرمایا کہ بھیڑ بکریاں انگور کی بیلوں کے مالک کو دے دی جائیں، تو سلیمان علیہ السلام نے کہا : ’’اے اللہ کے نبی! اس کا فیصلہ اور ہے۔‘‘ انھوں نے پوچھا : ’’وہ کیا ہے؟‘‘ عرض کی: ’’آپ انگور کی بیلیں بھیڑ بکریوں والے کے حوالے کر دیں، وہ ان کی نگہداشت کرے جب تک وہ دوبارہ پہلے جیسی نہ ہو جائیں اور بھیڑ بکریاں انگور کی بیلوں والے کے حوالے کر دیں، وہ اس وقت تک ان سے فائدہ اٹھاتا رہے اور جب انگوروں کی بیلیں پہلی حالت پر لوٹ آئیں تو آپ انگوروں کی بیلیں اس کے مالک کے سپرد اور بھیڑ بکریاں اس کے مالک کے سپرد کر دیں۔‘‘ تو اللہ تعالیٰ نے فرمایا : ’’تو ہم نے وہ (فیصلہ) سلیمان کو سمجھا دیا اور ہم نے ہر ایک کو حکم اور علم عطا کیا۔‘‘ ابن کثیر کے محقق دکتور حکمت بن بشیر نے فرمایا : ’’حاکم نے اسے روایت کرکے صحیح کہا ہے اور ذہبی نے ان کی موافقت کی ہے۔ (اس سند میں ابو اسحاق کی تدلیس موجود ہے)۔‘‘ دکتور حکمت بن بشیر لکھتے ہیں : ’’طبری نے صحیح سند کے ساتھ مجاہد کا یہی قول نقل فرمایا ہے اور قتادہ اور ابن زید کا یہی قول صحیح سند کے ساتھ مسند عبد الرزاق میں بھی مروی ہے۔‘‘ اللہ تعالیٰ نے یہ واقعہ ذکر کرتے ہوئے فرمایا کہ ہم داؤد اور سلیمان کے فیصلے کے وقت حاضر تھے، یعنی ہمیں اس کی ایک ایک جزئی کا پورا علم ہے۔ اگرچہ ابن مسعود رضی اللہ عنہ نے یہ تفسیر رسول اللہ صلی اللہ علیہ وسلم سے سننے کی صراحت نہیں کی، تاہم واقعہ کی صورت وہی معلوم ہوتی ہے جو انھوں نے بیان کی ہے۔ اس لیے بھی کہ بائبل میں اس واقعہ کا ذکر نہیں اور نہ یہ یہودی لٹریچر میں معروف ہے اور پھر عبد اللہ بن مسعود رضی اللہ عنہ اسرائیلیات بیان کرنے میں معروف بھی نہیں ہیں۔ ¤ ➌ داؤد اور سلیمان علیھما السلام دونوں میں سے ہر ایک کا فیصلہ ان کا اجتہاد تھا، کیونکہ اگر وہ وحی سے ہوتا تو داؤد علیہ السلام کے فیصلے کے بعد اور فیصلے کی گنجائش نہ ہوتی۔ انبیاء بھی اجتہاد فرماتے ہیں مگر ان کے اجتہاد اور دوسرے لوگوں کے اجتہاد میں یہ فرق ہے کہ انبیاء کے اجتہاد میں اگر کوئی خطا ہو تو اللہ تعالیٰ اس کی اصلاح کر دیتا ہے، جیسا کہ یہاں سلیمان علیہ السلام کے فیصلے کے ساتھ اس کی اصلاح فرما دی اور جیسا کہ اللہ تعالیٰ نے ہمارے نبی کریم صلی اللہ علیہ وسلم کو فرمایا : «{ عَفَا اللّٰهُ عَنْكَ لِمَ اَذِنْتَ لَهُمْ }» [ التوبۃ : ۴۳ ] ’’اللہ نے تجھے معاف کر دیا، تو نے انھیں کیوں اجازت دی۔‘‘ اور فرمایا : «{ يٰۤاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ لَكَ }» [ التحریم : ۱ ] ’’اے نبی! تو کیوں حرام کرتا ہے جو اللہ نے تیرے لیے حلال کیا ہے؟‘‘ اگر کسی بات پر اللہ تعالیٰ خاموشی اختیار فرمائے، تو وہ اللہ تعالیٰ کی موافقت کی وجہ سے حق ہوتی ہے اور وحی کا حکم رکھتی ہے، یہی مطلب ہے اللہ تعالیٰ کے اس فرمان : «{ وَ مَا يَنْطِقُ عَنِ الْهَوٰى (3) اِنْ هُوَ اِلَّا وَحْيٌ يُّوْحٰى }» [ النجم : ۳، ۴ ] کا۔ انبیاء علیھم السلام کے سوا کسی مجتہد کی خطا کی بذریعہ وحی اصلاح نہیں ہوتی، اس لیے ان کے اجتہادات شریعت میں حجت نہیں ہیں۔ ¤ ➍ مسئلہ : اگر کسی کے جانور دن کے وقت کسی دوسرے کے کھیت یا باغ کو چر جائیں تو جانور والے پر کوئی تاوان نہیں ہے اور اگر رات کے وقت چر جائیں تو جس قدر نقصان ہو اس قدر تاوان جانور والے کے ذمے ہو گا، جیسا کہ براء بن عازب رضی اللہ عنھما سے روایت ہے کہ میری ایک اونٹنی تھی جو بہت نقصان کیا کرتی تھی، ایک دفعہ وہ ایک باغ میں داخل ہو گئی اور وہاں نقصان کر دیا۔ رسول اللہ صلی اللہ علیہ وسلم سے اس بارے میں بات کی گئی تو آپ نے فیصلہ فرمایا : ’’ دن کے وقت باغات کی نگرانی اور حفاظت ان کے مالکوں کے ذمے ہے اور رات کے وقت جانوروں کی نگرانی ان کے مالکوں کے ذمے ہے اور رات کے وقت جانور جو نقصان کر جائیں تو وہ ان کے مالکوں کے ذمے ہے (کہ اسے پورا کریں)۔‘‘ [ أبو داوٗد، الإجارۃ، باب المواشی تفسد زرع قوم : ۳۵۷۰۔ ابن ماجہ : ۲۳۳۲۔ سلسلۃ الأحادیث الصحیحۃ : 237/1، ح:۲۳۸ ] بعض لوگوں کا کہنا ہے کہ جانور والے پر کسی صورت تاوان نہیں ہے اور دلیل میں {’’اَلْعَجْمَاءُ جُرْحُهَا جُبَارٌ‘‘} (جانور کا کسی کو زخمی کر دینا رائگاں ہے) پیش کرتے ہیں، حالانکہ اس حدیث میں صرف زخم کے معاف ہونے کا ذکر ہے، کھیت کے نقصان کے معاف ہونے کا ذکر نہیں ہے۔ لہٰذا براء بن عازب رضی اللہ عنھما والی حدیث میں اور اس میں کوئی تعارض نہیں ہے کہ براء رضی اللہ عنھما کی حدیث کو منسوخ کہا جائے۔ (قرطبی) ¤ ➎ اس آیت سے اس حدیث کی تائید ہوتی ہے جو عمرو بن العاص رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ ثُمَّ أَصَابَ فَلَهٗ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ ثُمَّ أَخْطَأَ فَلَهٗ أَجْرٌ ] [ بخاري، الاعتصام بالکتاب والسنۃ، باب أجر الحاکم إذا اجتھد… : ۷۳۵۲ ] ’’جب حاکم فیصلہ کرے اور پوری کوشش کرے، پھر درست فیصلہ کرے تو اس کے لیے دو اجر ہیں اور جب وہ فیصلہ کرے اور پوری کوشش کرے، پھر خطا کر جائے تو اس کے لیے ایک اجر ہے۔‘‘ یہاں اللہ تعالیٰ نے اگرچہ {’’ فَفَهَّمْنٰهَا سُلَيْمٰنَ ‘‘} (ہم نے وہ فیصلہ سلیمان کو سمجھا دیا) کہہ کر سلیمان علیہ السلام کے فیصلے کی تائید فرمائی، مگر داؤد اور سلیمان دونوں کے متعلق فرمایا : «وَ كُلًّا اٰتَيْنَا حُكْمًا وَّ عِلْمًا» کہ ہم نے ہر ایک کو حکم اور علم عطا کیا۔ ¤ ➏ ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے سلیمان علیہ السلام کے کمال فہم و ذکاوت کا ایک اور واقعہ روایت کیا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا : [ كَانَتِ امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا فَقَالَتْ صَاحِبَتُهَا إِنَّمَا ذَهَبَ بِابْنِكِ، وَقَالَتِ الْأُخْرَی إِنَّمَا ذَهَبَ بِابْنِكِ، فَتَحاكَمَتَا إِلٰی دَاوٗدَ فَقَضَی بِهِ لِلْكُبْرٰی، فَخَرَجَتَا عَلٰی سسُلَيْمَانَ بْنِ دَاوٗدَ عَلَيْهِمَا السَّلاَمُ فَأَخْبَرَتَاهٗ فَقَالَ ائْتُوْنِيْ بِالسِّكِّيْنِ أَشُقُّهُ بَيْنَهُمَا، فَقَالَتِ الصُّغْرٰی لاَ تَفْعَلْ يَرْحَمُكَ اللّٰهُ، هُوَ ابْنُهَا ، فَقَضَی بِهِ لِلْصُّغْرٰی] [بخاري، الأنبیاء، باب قول اللہ تعالٰی : « ووھبنا لداوٗد سلیمان … » : ۳۴۲۷۔ مسلم : ۱۷۲۰۔ نسائی : ۵۴۰۵ ] ’’دو عورتیں تھیں جن کے پاس ان کے بیٹے تھے۔ بھیڑیا آیا اور ان میں سے ایک کے بیٹے کو لے گیا۔ وہ اپنی ساتھی عورت سے کہنے لگی کہ وہ تو تمھارا بیٹا لے گیا ہے۔ دوسری کہنے لگی، وہ تمھارا بیٹا ہی لے گیا ہے۔ چنانچہ وہ دونوں فیصلے کے لیے داؤد علیہ السلام کے پاس گئیں۔ انھوں نے اس کا فیصلہ بڑی کے حق میں کر دیا۔ دونوں جاتے ہوئے سلیمان بن داؤد علیھما السلام کے پاس سے گزریں تو انھیں یہ بات بتائی، انھوں نے فرمایا : ’’میرے پاس چاقو لاؤ، میں اسے دونوں کے درمیان چیر دوں۔‘‘ تو چھوٹی نے کہا : ’’ایسا نہ کریں، اللہ آپ پر رحم کرے، یہ اسی کا بیٹا ہے۔‘‘ چنانچہ انھوں نے اس کا فیصلہ چھوٹی کے حق میں کر دیا۔‘‘ امام نسائی نے اس حدیث پر باب باندھا ہے کہ حاکم کے لیے گنجائش ہے کہ جو کام اس نے نہیں کرنا، اس کے متعلق کہے کہ میں ایسا کرتا ہوں، تا کہ حق واضح ہو جائے۔ ¤ ➐ اس واقعہ سے یہ بھی معلوم ہوا کہ بعض اوقات بیٹا باپ سے زیادہ بات سمجھ لیتا ہے، اس میں کفار عرب کے لیے بھی سبق ہے جو رسول اللہ صلی اللہ علیہ وسلم کی رہنمائی کے باوجود آبا و اجداد کی رسوم چھوڑنے پر تیار نہ تھے اور ان مقلدین کے لیے بھی جنھوں نے چار اماموں کے بعد اجتہاد کا دروازہ قیامت تک کے لیے بند کر دیا ہے۔ بتائیے اس سے بڑھ کر اللہ تعالیٰ کے فیض عام کی توہین اور کیا ہو گی؟ ¤ ➑ { وَ سَخَّرْنَا مَعَ دَاوٗدَ الْجِبَالَ يُسَبِّحْنَ وَ الطَّيْرَ :} اس سے پہلے ابراہیم اور نوح علیھما السلام کی خاطر آگ اور پانی کو مسخر کرنے کا ذکر فرمایا تھا۔ اب داؤد اور سلیمان علیھما السلام دونوں پر مشترکہ نعمت حکم و علم کا ذکر کرنے کے بعد دونوں کو عطا کر دہ نعمتیں الگ الگ ذکر فرمائیں۔ چنانچہ داؤد علیہ السلام کے ساتھ اللہ تعالیٰ نے پہاڑوں اور پرندوں کو مسخر اور پابند کر دیا اور انھیں اتنی خوبصورت آواز عطا فرمائی کہ جب وہ اللہ کی کتاب زبور پڑھتے یا تسبیح کرتے تو پہاڑ اور پرندے بھی ان کے ساتھ تسبیح کرتے۔ سورۂ سبا میں فرمایا : «{ يٰجِبَالُ اَوِّبِيْ مَعَهٗ وَ الطَّيْرَ }» [ سبا : ۱۰ ] ’’اے پہاڑو! اس کے ساتھ تسبیح کو دہراؤ اور پرندوں کو بھی (یہی حکم دیا)۔‘‘ سورۂ صٓ میں فرمایا : «{ اِنَّا سَخَّرْنَا الْجِبَالَ مَعَهٗ يُسَبِّحْنَ بِالْعَشِيِّ وَ الْاِشْرَاقِ (18) وَ الطَّيْرَ مَحْشُوْرَةً كُلٌّ لَّهٗۤ اَوَّابٌ }» [ صٓ : ۱۸، ۱۹ ] ’’بے شک ہم نے پہاڑوں کو اس کے ہمراہ مسخر کر دیا، وہ دن کے پچھلے پہر اور سورج چڑھنے کے وقت تسبیح کرتے تھے اور پرندوں کو بھی، جب کہ وہ اکٹھے کیے ہوتے، سب اس کے لیے رجوع کرنے والے تھے۔‘‘ سبحان اللہ! وہ کیسا حسین منظر ہو گا جب اللہ کے نبی داؤد علیہ السلام کے ساتھ پہاڑ اور پرندے بھی مصروف تسبیح ہوتے ہوں گے۔ بعض لوگوں نے پہاڑوں کی تسبیح کا مطلب داؤد علیہ السلام کی بلند اور سریلی آواز سے ان کا گونج اٹھنا اور پرندوں کی تسبیح سے مراد ان کا ٹھہر جانا قرار دیا ہے، مگر درحقیقت یہ پہاڑوں اور پرندوں کی ان کے ہمراہ تسبیح کو ناممکن سمجھ کر اس کا انکار ہے۔ اللہ تعالیٰ نے یہ چیز داؤد علیہ السلام پر خاص نعمت کے طورپر ذکر فرمائی ہے، پہاڑوں کی گونج تو ہر بلند آواز سے پیدا ہوتی ہے، اچھی ہو یا بری، اس میں داؤد علیہ السلام کی خصوصیت کیا ہوئی؟ اس لیے صحیح معنی یہی ہے کہ پہاڑ اور پرندے فی الواقع ان کے ہمراہ تسبیح کرتے تھے۔ مزید تفصیل کے لیے دیکھیے سورۂ بنی اسرائیل (۴۴)۔ ¤ ➒ { وَ كُنَّا فٰعِلِيْنَ :} یعنی تعجب مت کرو کہ وہ پہاڑ اور پرندے کیسے بولتے اور تسبیح کرتے تھے، یہ سب کچھ ہمارے کرنے سے ہوتا تھا۔ (کبیر)"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) {وَ عَلَّمْنٰهُ صَنْعَةَ لَبُوْسٍ لَّكُمْ …: ’’ لَبُوْسٍ ‘‘} اور {’’ لِبَاسٌ‘‘} ایک ہی ہے جو موقع کے لحاظ سے مختلف ہوتا ہے، چنانچہ لڑائی کا لباس زرہ ہے۔ یہ داؤد علیہ السلام پر تیسرا انعام ہے کہ اللہ تعالیٰ نے ان کے ہمراہ پہاڑوں اور پرندوں کو مسخر کرنے کے علاوہ ان کے لیے لوہے کو بھی نرم کر دیا اور انھیں اس کی تاروں اور حلقوں سے زرہیں بنانے کا ہنر سکھایا۔ چنانچہ اتنی ہلکی اور عمدہ زرہیں بنانے کے موجد وہی ہیں۔ انھی سے دوسروں نے یہ فن سیکھا۔ یہ نعمت صرف انھی پر نہیں تھی، بلکہ قیامت تک تمام لڑنے والوں کے لیے نعمت ہے، جس پر اللہ تعالیٰ کا شکر لازم ہے، تو کیا تم شکر کرنے والے ہو؟ یہ سوال دراصل شکر کے حکم کی تاکید ہے۔ داؤد علیہ السلام کے متعلق مزید دیکھیے سورۂ سبا (۱۰، ۱۱) اور سورۂ صٓ (۱۷ تا ۲۶)۔"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) ➊ { وَ لِسُلَيْمٰنَ الرِّيْحَ عَاصِفَةً :} اللہ تعالیٰ نے پانی کو حکم دیا تو اس نے نوح علیہ السلام اور ان کے ساتھیوں کو چھوڑ کر ان کی ساری قوم کو غرق کر دیا۔ آگ کو حکم دیا تو وہ ابراہیم علیہ السلام پر برد و سلام بن گئی۔ داؤد علیہ السلام کے ساتھ تسبیح کے لیے پہاڑوں اور پرندوں کو مسخر کر دیا، فرمایا : «{ وَ سَخَّرْنَا مَعَ دَاوٗدَ الْجِبَالَ يُسَبِّحْنَ وَ الطَّيْرَ }» [ الأنبیاء : ۷۹ ] مگر پانی یا آگ کو نوح یا ابراہیم علیھما السلام کے تابع فرمان نہیں کیا، نہ پہاڑوں یا پرندوں کو داؤد علیہ السلام کے حکم کا پابند کیا، مگر سلیمان علیہ السلام کا خاصہ یہ ہے کہ ہوا ان کے حکم کے تابع کر دی گئی، فرمایا : «{ تَجْرِيْ بِاَمْرِهٖۤ }» کہ وہ اس کے حکم سے چلتی تھی۔ ¤ ➋ {’’ عَاصِفَةً ‘‘} کا معنی ہے {’’شَدِيْدَةُ الْهُبُوْبِ‘‘} بہت سخت تیز چلنے والی ہوا۔ سورۂ ص میں فرمایا : «{ فَسَخَّرْنَا لَهُ الرِّيْحَ تَجْرِيْ بِاَمْرِهٖ رُخَآءً حَيْثُ اَصَابَ }» [ صٓ : ۳۶ ] ’’تو ہم نے اس کے لیے ہوا کو تابع کر دیا، جو اس کے حکم سے بہت نرم چلتی تھی، جہاں کا وہ ارادہ کرتا تھا۔‘‘ اور سورۂ سبا میں فرمایا : «{ وَ لِسُلَيْمٰنَ الرِّيْحَ غُدُوُّهَا شَهْرٌ وَّ رَوَاحُهَا شَهْرٌ }» [ سبا : ۱۲ ] ’’اور (ہم نے) ہوا کو سلیمان کے (تابع کر دیا) پہلے پہر اس کا چلنا ایک ماہ کا تھا اور پچھلے پہر اس کا چلنا بھی ایک ماہ کا۔‘‘ یہاں ایک سوال ہے کہ ایک جگہ اس کو تند و تیز بتایا، دوسری جگہ نہایت نرم؟ جواب اس کا یہ ہے کہ اس ہوا میں دونوں خوبیاں موجود ہوتی تھیں، تند و تیز اتنی کہ صبح کے وقت چند گھنٹوں میں ایک ماہ کا سفر طے کر لیتی، اسی طرح پچھلے پہر بھی چند گھنٹوں میں اتنا ہی سفر طے کر لیتی اور نرم اور ہموار اتنی کہ سلیمان علیہ السلام اور ان کے ہمراہیوں کو کوئی تکلیف یا جھٹکا محسوس نہ ہوتا۔ ¤ ➌ { تَجْرِيْ بِاَمْرِهٖۤ اِلَى الْاَرْضِ الَّتِيْ بٰرَكْنَا فِيْهَا:} قرآن مجید میں ارضِ مبارک شام کو کہا گیا ہے۔ دیکھیے سورۂ بنی اسرائیل۔ اس آیت میں سلیمان علیہ السلام کے اپنے کسی بھی سفر سے ان کے دار الحکومت شام کی طرف واپسی کا ذکر ہے، کیونکہ بعض اوقات آدمی سفر میں جاتے ہوئے بہت دور پہنچ جاتا ہے اور واپسی اس کے لیے مشکل ہوتی ہے، چنانچہ اللہ تعالیٰ نے فرمایا کہ ہوا سلیمان علیہ السلام کے حکم سے ارض مبارک کی طرف چلتی تھی۔ رہا سلیمان علیہ السلام کا دوسرے مقامات کی طرف جانا، تو اس کا ذکر سورۂ ص (۳۶) میں ہے کہ ہوا ان کے حکم سے اسی طرف چل پڑتی تھی جہاں ان کا ارادہ ہوتا، جیسا کہ پچھلے فائدے میں گزرا ہے۔ ¤ ➍ ہوا کو سلیمان علیہ السلام کے لیے مسخر کرنے سے کیا مراد ہے؟ بعض مفسرین نے اس سے ہوا کا ان کے بحری بیڑوں کے موافق چلنا مراد لیا ہے، کیونکہ اس زمانے میں بحری جہازوں کا چلنا موافق ہوا پر موقوف تھا۔ یہ حضرات بائبل کا حوالہ دیتے ہیں۔ بعض تابعین نے کہا کہ سلیمان علیہ السلام اور ان کی افواج لکڑی کے بہت لمبے چوڑے چبوترے پر بیٹھ جاتے تو سلیمان علیہ السلام کے حکم سے ہوا انھیں اٹھا کر ان کی منزل مقصود کی طرف چل پڑتی۔ بعض نے اس طرح کے ایک مربع میل قالین کا ذکر کیا ہے۔ ظاہر ہے ان میں سے کوئی صاحب بھی موقع پر موجود نہیں تھا اور نہ انھوں نے اپنی معلومات کا کوئی ذریعہ بیان کیا ہے۔ رہی بائبل، تو اس کی حیثیت مقدمے میں تفصیل سے بیان ہو چکی ہے۔ اللہ تعالیٰ نے سورۂ ص میں ذکر فرمایا ہے کہ سلیمان علیہ السلام نے دعا کی تھی : «{ رَبِّ اغْفِرْ لِيْ وَهَبْ لِيْ مُلْكًا لَّا يَنْۢبَغِيْ لِاَحَدٍ مِّنْۢ بَعْدِيْ }» [ صٓ : ۳۵ ] ’’اے میرے رب! مجھے بخش دے اور مجھے ایسی بادشاہی عطا فرما جو میرے بعد کسی کے لائق نہ ہو۔‘‘ اس دعا کو قبول کرتے ہوئے اللہ تعالیٰ نے ہوا ان کے تابع کر دی کہ ان کے حکم سے وہ جہاں کا ارادہ کرتے چل پڑتی تھی۔ آج کل انسان مہینوں کا سفر گھنٹوں میں ہوائی جہاز کے ذریعے سے طے کر رہا ہے، اگر سمندری سفر کی تیزی ہی مراد ہو تو یہ وہ سلطنت تو ہر گز نہیں جو سلیمان علیہ السلام کے بعد کسی کے لائق ہی نہیں۔ کیونکہ ہوائی جہاز سمندر ہی نہیں خشکی کو بھی عبور کرتے چلے جا رہے ہیں اور وہ تقریباً ہر ملک میں موجود ہیں۔ اس لیے ماننا پڑے گا کہ ان کے لیے ہوا کی وہ تسخیر ہوائی جہازوں اور اس قسم کے آلات کی محتاج نہ تھی، بلکہ وہ اس سے بہت اعلیٰ چیز تھی جس کی بدولت وہ ہوا کے ذریعے سے سمندروں اور خشکی پر مہینوں کا سفر گھنٹوں میں طے کرتے ہوئے جہاں چاہتے چلے جاتے تھے۔ اس کی تفصیل اگر انسان کی سمجھ میں آ سکتی یا اس کی ضرورت ہوتی تو اللہ تعالیٰ بیان فرما دیتا، ہمیں اتنا ہی کافی ہے جو اللہ تعالیٰ نے بیان فرما دیا۔ ¤ ➎ { وَ كُنَّا بِكُلِّ شَيْءٍ عٰلِمِيْنَ:} یہ اس سوال کا جواب ہے کہ یہ کیسے ممکن ہے کہ تند و تیز ہوا نہایت نرمی سے چلتی ہوئی سلیمان علیہ السلام کو لے کر مہینوں کا سفر پہروں میں طے کر لے؟ فرمایا، ہم ہمیشہ سے ہر چیز کا علم رکھتے ہیں اور ہمارے لیے یہ کوئی انوکھی بات نہیں ہے۔"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) ➊ { وَ مِنَ الشَّيٰطِيْنِ مَنْ يَّغُوْصُوْنَ لَهٗ :} اللہ تعالیٰ نے ہوا کے علاوہ کئی شیطان جن بھی سلیمان علیہ السلام کے تابع کر دیے۔ گویا عناصر اربعہ میں سے ہوا کے علاوہ آگ سے بنی ہوئی کچھ مخلوق بھی ان کے تابع فرمان کر دی گئی، پھر اس مخلوق کے ذریعے سے غوطہ خوری کے ساتھ بہت سے سمندری منافع حاصل کرنے کی استطاعت بخشی اور انھی کے ذریعے سے مٹی اور اس سے نکلنے والے پتھر وغیرہ سے ہر وہ چیز بنانا ان کی دسترس میں کر دیا جو وہ بنانا چاہتے تھے۔ گویا تسخیر عناصر کی عجیب نعمت انھیں عطا فرمائی گئی۔ (بقاعی) بعض منحرف مفسرین کا کہنا ہے کہ شیاطین کا لفظ جن و انس دونوں پر آ جاتا ہے، جیسا کہ سورۂ انعام (۱۱۲) میں {’’ شَيٰطِيْنَ الْاِنْسِ وَ الْجِنِّ ‘‘} کا ذکر ہے، اس لیے دراصل یہ سرکش اور قوی قسم کے دیہاتی لوگ تھے، جن سے سلیمان علیہ السلام غوطہ خوری اور عمارات کی تعمیر کا کام لیتے تھے۔ مگر سورۂ سبا میں صراحت ہے : «{ وَ مِنَ الْجِنِّ مَنْ يَّعْمَلُ بَيْنَ يَدَيْهِ بِاِذْنِ رَبِّهٖ وَ مَنْ يَّزِغْ مِنْهُمْ عَنْ اَمْرِنَا نُذِقْهُ مِنْ عَذَابِ السَّعِيْرِ (12) يَعْمَلُوْنَ لَهٗ مَا يَشَآءُ مِنْ مَّحَارِيْبَ وَ تَمَاثِيْلَ وَ جِفَانٍ كَالْجَوَابِ وَ ققُدُوْرٍ رّٰسِيٰتٍ اِعْمَلُوْۤا اٰلَ دَاوٗدَ شُكْرًا وَ قَلِيْلٌ مِّنْ عِبَادِيَ الشَّكُوْرُ }» [ سبا : ۱۲، ۱۳ ] ’’اور جنوں میں سے کچھ وہ تھے جو اس کے سامنے اس کے رب کے اذن سے کام کرتے تھے اور ان میں سے جو ہمارے حکم سے کجی کرتا ہم اسے بھڑکتی آگ کا کچھ عذاب چکھاتے تھے۔ وہ اس کے لیے بناتے تھے جو وہ چاہتا تھا، بڑی بڑی عمارتیں، مجسّمے اور حوضوں جیسے لگن اور ایک جگہ جمی ہوئی دیگیں۔ اے داؤد کے گھر والو! شکر ادا کرنے کے لیے عمل کرو۔ اور بہت تھوڑے میرے بندوں میں سے پورے شکر گزار ہیں۔‘‘ سورۂ سبا (۱۴) ہی میں ذکر ہے کہ ان جنوں کے متعلق بعض لوگوں کا عقیدہ تھا کہ وہ غیب دان ہیں مگر جنوں کو سلیمان علیہ السلام کی وفات کا علم اس وقت تک نہ ہوا جب تک دیمک نے ان کی لاٹھی کو کھا نہیں لیا، پھر جب سلیمان علیہ السلام گرے تو جنوں کی حقیقت کھل گئی کہ اگر وہ غیب جانتے ہوتے تو اس ذلیل عذاب (عمارتیں وغیرہ بنانے کے کام) میں نہ رہتے۔ ظاہر ہے کہ یہ تمام چیزیں اس بات کی دلیل ہیں کہ اللہ تعالیٰ نے غوطہ خوری اور دوسرے دشوار کاموں کے لیے جنوں میں سے کچھ شیاطین کو سلیمان علیہ السلام کے تابع کیا تھا، ورنہ دیہاتی سرکش اور قوی انسان تو سلیمان علیہ السلام سے پہلے بھی عمارتیں بناتے تھے اور اب بھی بناتے ہیں، پھر سلیمان علیہ السلام کی وہ بے مثال سلطنت کیا ہوئی جس جیسی سلطنت ان کے بعد کسی کے لائق ہی نہیں ہے۔ ¤ ➋ { وَ يَعْمَلُوْنَ عَمَلًا دُوْنَ ذٰلِكَ :} اس کی تفصیل کچھ پچھلے فائدے میں گزری ہے، کچھ سورۂ سبا (۱۲ تا ۱۴) میں آئے گی۔ ¤ ➌ { وَ كُنَّا لَهُمْ حٰفِظِيْنَ:} یعنی اللہ تعالیٰ نے انھیں اپنی قدرت سے سلیمان علیہ السلام کے تابع کرکر دیا اور خود ان کی حفاظت فرمائی کہ نہ وہ بھاگ سکتے تھے، نہ ان کی نافرمانی کر سکتے تھے، نہ کسی کو نقصان پہنچا سکتے تھے اور نہ کوئی چیز یا کوئی کام خراب کر سکتے تھے، کیونکہ جو ان کے حکم سے ذرا بھی سرتابی کرتا تو اللہ تعالیٰ کی طرف سے اسے بھڑکتی ہوئی آگ سے سزا دی جاتی، فرمایا : «{ وَ مَنْ يَّزِغْ مِنْهُمْ عَنْ اَمْرِنَا نُذِقْهُ مِنْ عَذَابِ السَّعِيْرِ }» [ سبا : ۱۲ ] ’’اور ان میں سے جو ہمارے حکم سے کجی کرتا ہم اسے بھڑکتی آگ کا کچھ عذاب چکھاتے تھے۔‘‘ اور جو زیادہ ہی سرکشی دکھانے والے تھے انھیں بیڑیوں میں اکٹھے جکڑنے کا بندوبست موجود تھا، فرمایا : «{ وَ اٰخَرِيْنَ مُقَرَّنِيْنَ فِي الْاَصْفَادِ }» [ صٓ : ۳۸ ] ’’اور کچھ اوروں کو بھی (تابع کر دیا) جو بیڑیوں میں اکٹھے جکڑے ہوئے تھے۔‘‘ ظاہر ہے یہ سب کچھ اللہ تعالیٰ کی طرف سے تھا، ورنہ انسان کی کیا بساط کہ اتنی خوفناک قوتوں کو قابو میں رکھ سکے۔ ¤ ➍ اس آیت سے یہ بھی معلوم ہوا کہ سلیمان علیہ السلام کے تابع جو جن کیے گئے تھے وہ کافر تھے، کیونکہ شیطان کا کفر معلوم ہے۔ اگر وہ مسلمان ہوتے تو خود ہی اللہ کے پیغمبر کے تابع ہو جاتے، پھر ان کی خاص حفاظت کی ضرورت نہ تھی۔ ¤ ➎ سلیمان علیہ السلام کی وفات کے بعد اگر کوئی شخص کوئی جن پکڑ لے، جیسا کہ ابوہریرہ رضی اللہ عنہ نے زکوٰۃِ فطر کی حفاظت کرتے ہوئے تین دفعہ شیطان کو پکڑا تھا، تو اللہ کی طرف سے اس کے لیے ان کے نقصان سے حفاظت کا کوئی ذمہ نہیں۔ ایک دفعہ رسول اللہ صلی اللہ علیہ وسلم نے ایک سرکش جن کو پکڑ کر چھوڑ دیا تھا، ابوہریرہ رضی اللہ عنہ یہ واقعہ رسول اللہ صلی اللہ علیہ وسلم سے بیان فرماتے ہیں : [ إِنَّ عِفْرِيْتًا مِّنَ الْجِنِّ تَفَلَّتَ عَلَيَّ الْبَارِحَةَ لِيَقْطَعَ عَلَيَّ صَلاَتِيْ فَأَمْكَنَنِيَ اللّٰهُ مِنْهُ فَأَخَذْتُهُ فَأَرَدْتُ أَنْ أَرْبُطَهُ عَلٰی سَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ حتَّی تَنْظُرُوْا إِلَيْهِ كُلُّكُمْ، فَذَكَرْتُ دَعْوَةَ أَخِيْ سُلَيْمَانَ : «{ رَبِّ اغْفِرْ لِيْ وَهَبْ لِيْ مُلْكًا لَّا يَنْۢبَغِيْ لِاَحَدٍ مِّنْۢ بَعْدِيْ }» [صٓ : ۳۵] فَرَدَدْتُهُ خَاسِئًا ] ’’ایک سرکش جن گزشتہ رات مجھ پر حملہ آور ہوا، تاکہ مجھ پر میری نماز قطع کر دے، تو اللہ تعالیٰ نے مجھے اس پر قابو دے دیا اور میں نے اسے پکڑ لیا اور ارادہ کیا کہ اسے مسجد کے ستونوں میں سے ایک ستون کے ساتھ باندھ دوں، تاکہ تم سب اسے دیکھو، پھر مجھے اپنے بھائی سلیمان ( علیہ السلام ) کی دعا یاد آ گئی : «{ رَبِّ اغْفِرْ لِيْ وَهَبْ لِيْ مُلْكًا لَّا يَنْۢبَغِيْ لِاَحَدٍ مِّنْۢ بَعْدِييْ }» ’’اے میرے رب! مجھے بخش دے اور مجھے ایسی حکومت عطا فرما جو میرے بعد کسی کے لائق نہ ہو۔‘‘ تو میں نے اسے دفع دور کرتے ہوئے پیچھے دھکیل دیا۔‘‘ [ بخاري، أحادیث الأنبیاء، باب قول اللہ تعالٰی : « ووھبنا لداوٗد سلیمان …» : ۳۴۲۳ ]"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 84،83) ➊ { وَ اَيُّوْبَ اِذْ نَادٰى رَبَّهٗۤ …:} یعنی ایوب کو یاد کرو۔ داؤد اور سلیمان علیھما السلام کی آزمائش ان نعمتوں کے ساتھ ہوئی جن پر شکر واجب تھا، جبکہ ایوب علیہ السلام کی آزمائش ایسی تکالیف کے ساتھ ہوئی جن پر صبر لازم تھا۔ حقیقت یہ ہے کہ شکر اور صبر لازم و ملزوم ہیں۔ صبر وہی کر سکتا ہے جو شاکر ہو اور شکر وہی کرتا ہے جو صابر ہو۔ بے صبرا شاکر نہیں ہوتا اور ناشکرا صابر نہیں ہوتا۔ ان کا واقعہ قرآن مجید میں دو جگہ آیا ہے۔ ایک یہاں سورۂ انبیاء میں اور ایک سورۂ ص (۴۱ تا ۴۴) میں۔ ایک دفعہ زیر تفسیر آیات کا ترجمہ ملاحظہ کریں، ساتھ ہی سورۂ ص کی آیات کا ترجمہ دیکھیں، وہاں اللہ تعالیٰ نے فرمایا ہے : ’’اور ہمارے بندے ایوب کو یاد کر جب اس نے اپنے رب کو پکارا کہ بے شک شیطان نے مجھے بڑا دکھ اور تکلیف پہنچائی ہے۔ اپنا پاؤں مار، یہ نہانے کا اور پینے کا ٹھنڈا پانی ہے اور ہم نے اسے اس کے گھر والے عطا کر دیے اور ان کے ساتھ اتنے اور بھی، ہماری طرف سے رحمت کے لیے اور عقلوں والوں کی نصیحت کے لیے۔‘‘ ¤ ان آیات سے معلوم ہوتا ہے کہ ایوب علیہ السلام اللہ کے برگزیدہ نبی تھے۔ اللہ کی طرف سے ان پر ایسی آزمائش آئی کہ وہ شدید اور لمبی بیماری میں مبتلا ہو گئے، ان کے اہل و عیال بھی جدائی یا فوت ہونے کی وجہ سے ان سے جدا ہو گئے۔ (ثنائی) جب کمانے والے ہی نہ رہے تو مال مویشی بھی ہلاک ہو گئے، مگر ایوب علیہ السلام نے ہر مصیبت پر صبر کیا، نہ کوئی واویلا کیا اور نہ کوئی حرف شکایت لب پر لائے۔ جب تکلیف حد سے بڑھ گئی تو انھوں نے اللہ تعالیٰ سے دعا کی۔ ایک یہ کہ اے میرے رب! مجھے شیطان نے بڑا دکھ اور تکلیف پہنچائی ہے۔ دوسری یہ کہ اے میرے رب! مجھے بیماری لگ گئی ہے اور تو رحم کرنے والوں میں سب سے زیادہ رحم والا ہے۔ اس دعا میں انھوں نے اپنی حالت زار بیان کرنے کے بعد اللہ تعالیٰ کے ارحم الراحمین ہونے کے بیان ہی کو کافی سمجھا ہے۔ اللہ تعالیٰ نے ان کی دعا قبول فرمائی اور حکم دیا کہ زمین پر اپنا پاؤں مارو۔ انھوں نے پاؤں مارا تو ٹھنڈے پانی کا چشمہ نمودار ہو گیا۔ حکم ہوا کہ اسے پیو اور اس سے غسل کرو۔ وہ مبارک پانی پینے اور اس کے ساتھ غسل کرنے سے ان کی ساری بیماری دور ہو گئی اور وہ پوری طرح صحت مند ہو گئے۔ اللہ تعالیٰ نے انھیں ان کے گھر والے بھی عطا فرما دیے اور اتنے ہی اور عطا فرما دیے۔ بیماری کے دوران انھوں نے کسی پر ناراض ہو کر اسے کوڑے مارنے کی قسم کھائی تھی، اب وہ سزا زیادہ سمجھ کر پریشان تھے کہ اسے اتنے کوڑے ماروں تو زیادتی ہوتی ہے، نہ ماروں تو قسم ٹوٹتی ہے۔ اللہ تعالیٰ نے ان کی یہ مشکل بھی حل فرما دی کہ اتنے تنکوں کا مٹھا لے کر ایک دفعہ مار دو، جتنے کوڑے مارنے کی تم نے قسم کھائی تھی، اس سے تمھاری قسم پوری ہو جائے گی، قسم توڑنے کا گناہ نہیں ہو گا۔ ¤ ➋ {’’اَلضَّرُّ‘‘ } اور {’’اَلضُّرُّ‘‘} میں فرق یہ ہے کہ ضاد کے فتحہ کے ساتھ {’’ضَرٌّ‘‘}‘} نفع کی ضد ہے، اس سے مراد کوئی بھی نقصان ہے، مالی ہو یا جانی یا کوئی اور، جبکہ ضاد کے ضمہ کے ساتھ {’’ضُرٌّ‘‘} سے مراد آدمی کی جسمانی بدحالی ہے، مثلاً بیماری، لا غری یا بڑھاپا وغیرہ۔ (اعراب القرآن از درویش) ¤ ➌ ایوب علیہ السلام نے شدید تکلیف دہ بیماری اور اموال و اولاد کی ہلاکت جیسے مصائب کی آزمائش میں جس طرح صبر کیا، پھر جس طرح انھوں نے اللہ کی جناب میں اپنی حالت زار کا ذکر کرکے اس کے ارحم الراحمین ہونے کے واسطے سے دعا کی اور جسے شرف قبولیت عطا ہوا، اس سے چند اسباق حاصل ہوتے ہیں۔ ایک یہ کہ شدید بیماری اور مال و اہل کی تباہی کے ساتھ آزمائش اللہ تعالیٰ کی رحمت تھی، اسی طرح اس پر صبر کی توفیق دینا، پھر دعا قبول فرما کر صحت سے نوازنا اور دگنے اہل و عیال عطا فرمانا، سب کچھ اللہ کی عظیم رحمت تھی۔ دوسرا یہ کہ اس میں عبادت گزار بندوں کے لیے یاد دہانی ہے کہ اگر اللہ کے بندوں کا مصائب کے ذریعے سے امتحان ہو اور وہ اس پر صبر کریں اور اللہ تعالیٰ ہی کی جناب میں اپنی فریاد پیش کریں تو اللہ تعالیٰ کی طرف سے انعام ملتا ہے اور آدمی کے گمان سے بھی بہت زیادہ ملتا ہے۔ یہاں {’’ وَ ذِكْرٰى لِلْعٰبِدِيْنَ ‘‘} فرمایا، جبکہ سورۂ صٓ (۴۳) میں {’’ وَ ذِكْرٰى لِاُولِي الْاَلْبَابِ ‘‘} فرمایا، معلوم ہوا عبادت کرنے والے ہی عقل والے ہیں، جو بندگی نہیں کرتے وہ کتنے ہی ہوشیار نظر آئیں، عقل سے خالی ہیں۔ تیسرا یہ کہ آزمائش میں صبر اور اللہ تعالیٰ ہی سے بار بار رجوع اور استغاثہ و فریاد کی وجہ سے اللہ تعالیٰ نے ایوب علیہ السلام کی تعریف میں تین جملے ارشاد فرمائے : (1) «{ اِنَّا وَجَدْنٰهُ صَابِرًا }» ’’ہم نے اسے صبر کرنے والا پایا۔‘‘ (2) «{ نِعْمَ الْعَبْدُ }» ’’وہ بہت اچھا بندہ تھا۔‘‘ (3) «{ اِنَّهٗۤ اَوَّابٌ }» ’’یقینا وہ بہت رجوع کرنے والا تھا۔‘‘ اس سے معلوم ہوا کہ آزمائش میں کامیابی پر اللہ تعالیٰ کی طرف سے شاباش بھی ملتی ہے۔ اللہ تعالیٰ کی طرف سے یہ تحسین و آفرین ایوب علیہ السلام کے حق میں بہت ہی بڑی شہادت ہے۔ ¤ ➍ دکتور محمد بن محمد ابو شہبہ رحمہ اللہ اپنی کتاب {’’ اَلْاِسْرَائِيْلِيَاتُ وَالْمَوْضُوْعَاتُ فِيْ كُتُبِ التَّفْسِيْرِ ‘‘} میں لکھتے ہیں کہ ابن کثیر نے اپنی تفسیر میں اس آیت کے تحت فرمایا : ’’وہب بن منبہ سے ایوب علیہ السلام کے واقعہ میں ایک لمبا قصہ روایت کیا گیا ہے، جسے ابن جریر نے اور ابن ابی حاتم نے سند کے ساتھ اس (وہب بن منبہ) سے نقل کیا ہے۔ بعد میں آنے والے کئی ایک مفسرین نے بھی اسے ذکر کیا ہے۔ اس واقعہ میں غرابت ہے، ہم نے لمبا ہونے کی وجہ سے اسے ترک کر دیا ہے۔‘‘ ابوشہبہ فرماتے ہیں : ’’عجیب بات یہ ہے کہ روایات پر نقد کرنے والے حافظ ابن کثیر بھی ایوب علیہ السلام کے واقعہ میں انھی باتوں میں پڑ گئے ہیں جن میں دوسرے حضرات پڑے ہوئے تھے۔ انھوں نے یہاں بہت سی اسرائیلیات ذکر فرمائی ہیں، جن پر کوئی تعاقب نہیں فرمایا، حالانکہ ان کے متعلق ہمارا مشاہدہ ہے کہ وہ ایسی جو بات بھی ذکر فرماتے ہیں اس کے بارے میں بتاتے ہیں کہ وہ کہاں سے آئی اور اسلامی روایات میں کیسے داخل ہوئی؟ میں نہیں سمجھتا کہ وہ ان روایات کو (بلانقد) بیان کرنا جائز سمجھتے ہوں۔ چنانچہ انھوں نے ذکر کیا ہے کہ کہا جاتا ہے کہ ’’ان کے سارے بدن میں جذام (کوڑھ) ہو گیا اور ان کے دل اور زبان کے سوا کوئی چیز سلامت نہ رہی، جن کے ساتھ وہ اللہ عزو جل کا ذکر کرتے تھے۔ یہاں تک کہ پاس بیٹھنے والوں کو ان سے نفرت ہو گئی اور انھیں شہر کے ایک کونے میں الگ رہائش رکھنا پڑی۔ ان کی بیوی کے سوا ان پر شفقت کرنے والا کوئی نہ رہا، جس نے ان کی آزمائش کے دوران ناقابل بیان مصیبتیں اٹھائیں، حتیٰ کہ وہ محنت مزدوری کرنے لگیں، بلکہ انھوں نے اسی وجہ سے اپنے بال بھی فروخت کر دیے۔‘‘ پھر ذکر فرماتے ہیں : ’’بیان کیا جاتا ہے کہ وہ اس آزمائش میں بہت لمبی مدت تک مبتلا رہے۔ پھر اختلاف ہے کہ انھیں اس دعا کے لیے بے قرار کرنے کا باعث کیا تھا؟ چنانچہ حسن بصری اور قتادہ نے کہا، ایوب علیہ السلام سات سال اور کچھ مہینے آزمائش میں مبتلا رہے، اس عرصے میں انھیں کوڑا پھینکنے کی جگہ میں ڈال دیا گیا اور ان کے بدن میں کیڑے پڑ گئے۔ پھر اللہ تعالیٰ نے ان کی تکلیف دور فرمائی اور انھیں اجر عظیم عطا فرمایا اور ان کی بہت اچھی تعریف فرمائی۔ اور وہب بن منبہ نے کہا کہ آپ تین سال تکلیف میں مبتلا رہے، نہ زیادہ نہ کم۔ سدی نے کہا، ایوب علیہ السلام کا گوشت جھڑ گیا، صرف ہڈیاں اور پٹھے باقی رہ گئے۔‘‘ پھر ایک لمبا قصہ ذکر کیا، پھر ابن کثیرنے وہ واقعہ ذکر فرمایا جو ابن ابی حاتم نے اپنی سند سے عن الزہری عن انس بن مالک روایت کیا ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے نبی ایوب علیہ السلام پر ان کی آزمائش اٹھارہ برس رہی۔ دور و نزدیک کے سب لوگوں نے انھیں چھوڑ دیا۔ ان کے دوستوں بھائیوں میں سے صرف دو آدمی صبح اور شام ان کے پاس آتے تھے۔ ان میں سے ایک نے دوسرے سے کہا، جانتے ہو! اللہ کی قسم! ایوب نے کوئی ایسا گناہ کیا ہے جو دنیا میں کسی نے نہیں کیا۔ ساتھی نے کہا، وہ کیا ہے؟ اس نے کہا، اٹھارہ سال ہوئے اللہ تعالیٰ نے اس پر رحم نہیں کیا کہ اس کی تکلیف دور کر دیتا۔ جب شام کو دونوں ان کے پاس گئے تو اس آدمی نے اس بات کا ذکر کر دیا۔ ایوب علیہ السلام نے کہا، مجھے معلوم نہیں تم کیا کہہ رہے ہو؟ ہاں یہ بات اللہ تعالیٰ جانتا ہے کہ میں دو آدمیوں کے پاس سے گزرتا جو جھگڑ رہے ہوتے، جس میں وہ اللہ کا ذکر کرتے تو میں گھر آ کر ان کی طرف سے کفارہ دے دیتا کہ کہیں وہ ناحق اللہ کا ذکر نہ کر رہے ہوں۔ اور وہ حاجت کے لیے باہر جایا کرتے تھے، جب فارغ ہو جاتے تو ان کی بیوی ہاتھ پکڑ کر لے آتی۔ ایک دن اس نے آنے میں دیر کی تو اسی جگہ اللہ تعالیٰ نے ان کی طرف وحی کی : «{ اُرْكُضْ بِرِجْلِكَ هٰذَا مُغْتَسَلٌۢ بَارِدٌ وَّ شَرَابٌ }» [ صٓ : ۴۲ ] ’’اپنا پاؤں مار، یہ نہانے کا اور پینے کا ٹھنڈا پانی ہے۔‘‘ ¤ حافظ ابن حجر رحمہ اللہ نے فرمایا کہ ایوب علیہ السلام کے قصے میں سب سے صحیح روایت وہ ہے جو ابن ابی حاتم اور ابن جریر نے بیان کی ہے اور ابن حبان اور حاکم نے اسے صحیح کہا ہے، پھر یہ روایت بیان کی۔ شیخ ناصر الدین البانی نے بھی اسے صحیح کہا ہے۔ (سلسلہ صحیحہ : ۱۷) مگر صحیح بات یہی ہے کہ یہ روایت صحیح نہیں۔ حافظ ابن حجر کے قول سے اس کا صحیح ہونا ثابت نہیں ہوتا، صرف دوسری روایتوں سے اس کا بہتر ہونا ثابت ہوتا ہے۔ اگر ان کی مراد اس حدیث کا صحیح ہونا ہو تب بھی ان کی بات محل نظر ہے۔ ابن کثیر نے {’’ اَلْبِدَايَةُ وَالنِّهَايَةُ ‘‘} میں ایوب علیہ السلام کے تذکرہ میں فرمایا : {’’هٰذَا غَرِيْبٌ رَفْعُهُ جِدًّا وَالْأَشْبَهُ أَنْ يَّكُوْنَ مَوْقُوْفًا‘‘} ’’اس روایت کا رسول اللہ صلی اللہ علیہ وسلم سے مروی ہونا بہت ہی غریب ہے، زیادہ قریب یہی ہے کہ یہ صحابی کا قول ہے۔‘‘ اس روایت کی تمام سندوں میں زہری کی روایت ’’عن‘‘ کے لفظ کے ساتھ آئی ہے اور زہری کا اپنی تمام تر عظمت وجلالت کے باوجود مدلس ہونا معروف و مشہور ہے۔ اس لیے صحیحین کے سوا ان کی تدلیس والی روایت کو صحیح نہیں کہا جا سکتا۔ ¤ ایوب علیہ السلام کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے صرف ایک صحیح حدیث آئی ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ بَيْنَمَا أَيُّوْبُ يَغْتَسِلُ عُرْيَانًا خَرَّ عَلَيْهِ رِجْلُ جَرَادٍ مِنْ ذَهَبٍ فَجَعَلَ يَحْثِيْ فِيْ ثَوْبِهِ فَنَادَاهُ رَبُّهُ يَا أَيُّوْبُ ! أَلَمْ أَكُنْ أَغْنَيْتُكَ عَمَّا تَرَی؟ قَالَ بَلٰی يَا رَبِّ ! وَلَكِنْ لَا غِنَی  لِيْ عَنْ بَرَكَتِكَ ] [بخاري، أحادیث الأنبیاء، باب قول اللّٰہ تعالٰی : « و أیوب إذ نادی ربہ…» : ۳۳۹۱ ]’’ایوب علیہ السلام کپڑے اتار کر غسل کر رہے تھے، غسل کے دوران ہی ان پر سونے کی ٹڈیوں کا ایک دَل (لشکر) آ گرا۔ ایوب علیہ السلام لپوں کے ساتھ اسے اپنے کپڑے میں بھرنے لگے تو انھیں ان کے رب نے آواز دی : ’’اے ایوب! کیا میں نے تمھیں اس سے غنی نہیں کر دیا جو تم دیکھ رہے ہو؟‘‘ انھوں نے عرض کی : ’’کیوں نہیں، تیری عزت کی قسم! لیکن میرے لیے تیری برکت سے کسی طرح بے پروائی ممکن نہیں۔‘‘ ¤ اس کے علاوہ ایوب علیہ السلام کے متعلق تمام اقوال تابعین یا صحابہ سے مروی ہیں اور سب وہب بن منبہ کے بیان ہی کا خلاصہ یا تفصیل ہیں، جو صاف ظاہر ہے کہ بنی اسرائیل سے لیے گئے ہیں۔ حقیقت صرف وہی ہے جو اللہ تعالیٰ نے بیان فرمائی ہے اور جس کا خلاصہ اس آیت کے فائدہ نمبر (۱) میں گزر چکا ہے۔ کسی مسلمان کے لیے جائز نہیں کہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے بیان پر اپنے پاس سے یا ان اہلِ کتاب سے لے کر اضافہ کرے جنھوں نے انبیاء پر تہمتیں باندھیں، بلکہ انھوں نے اللہ تعالیٰ کو بھی نہیں بخشا اور کہہ دیا کہ اللہ فقیر ہے اور ہم غنی ہیں۔ دیکھیے سورۂ آل عمران (۱۸۱) اور یہ کہ اللہ کا ہاتھ بندھا ہوا ہے۔ اللہ تعالیٰ نے فرمایا : «{ غُلَّتْ اَيْدِيْهِمْ وَ لُعِنُوْا بِمَا قَالُوْا }» [ المائدۃ : ۶۴ ] ’’انھی کے ہاتھ بندھے ہوئے ہیں اور ان کی باتوں کی وجہ سے ان پر لعنت کی گئی ہے۔‘‘ ¤ ➎ ابوشہبہ فرماتے ہیں، ہمیں جو عقیدہ رکھنا واجب ہے وہ یہ ہے کہ ایوب علیہ السلام کی آزمائش یقینا ہوئی، ان پر جسم اور اہلِ مال کی شدید تکلیف آئی، جس پر انھوں نے ایسا صبر کیا کہ صبر میں ضرب المثل بن گئے اور اللہ تعالیٰ نے بھی اس پر ان کی تعریف فرمائی، مگر ان کی آزمائش اس حد تک نہیں پہنچی جو ان جھوٹی داستانوں میں بیان ہوئی ہے کہ انھیں جذام (کوڑھ) ہو گیا، ان کے سارے جسم پر پھوڑے بن گئے، انھیں کوڑے کے ڈھیر پر پھینک دیا گیا۔ ان کے جسم میں کیڑے رینگتے پھرتے تھے اور ہڈیوں اور پٹھوں کے سوا سارا گوشت جھڑ گیا تھا اور ان سے دور ہی سے بدبو آتی تھی وغیرہ۔ ایوب علیہ السلام اللہ تعالیٰ کے ہاں اس سے کہیں معزز ومکرم تھے کہ انھیں کوڑے پر پھینک دیا جائے، یا وہ ایسے مرض میں مبتلا ہوں جس سے لوگ ان کی دعوت سے متنفر ہوں۔ اللہ کا پیغام پہنچانے والا ہی اس قدر معیوب حالت میں ہو تو ایسی دعوت کا کیا فائدہ اور اس سے حاصل کیا ہو گا؟ پھر انبیاء ہمیشہ اپنی قوم کے اونچے نسب میں سے مبعوث کیے جاتے رہے ہیں (جیسا کہ حدیثِ ہرقل میں ہے)۔ ایوب علیہ السلام کی ایسی حالت میں ان کا قبیلہ کہاں تھا کہ ان کی حفاظت کرتا، ان کے کھانے پینے کا بندوبست کرتا، بجائے اس کے کہ ان کی بیوی لوگوں کے گھروں میں کام کرے، بلکہ اپنے سر کے بال فروخت کرتی پھرے اور ان پر ایمان لانے والے کہاں گئے، کیا سب انھیں چھوڑ گئے، کیا ایمان کا تقاضا یہی ہے؟ ¤ حقیقت یہ ہے کہ اس قسم کی ساری داستانیں بے بنیاد ہیں، نہ عقل سلیم انھیں تسلیم کرتی ہے اور نہ صحیح نقل۔ ایوب علیہ السلام پر آنے والی بیماری ایسی ہر گز نہ تھی جس سے نفرت پیدا ہو، کیونکہ یہ ان کے منصب ہی کے خلاف تھا، بلکہ وہ اس قسم کی کوئی بیماری تھی جس کا جسم پر کوئی نشان ظاہر نہیں ہوتا، مثلاً کوئی جسمانی درد، ریوماٹزم، جوڑوں یا ہڈیوں وغیرہ کی تکلیف۔ جب اللہ کا فضل ہوا تو زمین پر پاؤں مارنے کے نتیجے میں نمودار ہونے والے چشمے کا ٹھنڈا پانی پینے اور اس کے ساتھ غسل کرنے سے مکمل شفایاب ہو گئے۔ قاضی ابوبکر ابن العربی رحمہ اللہ کی بات دل کو بہت لگتی ہے، وہ فرماتے ہیں : ’’ایوب علیہ السلام کے معاملے میں کوئی بات ثابت نہیں سوائے اس کے جو اللہ تعالیٰ نے ہمیں اپنی کتاب میں دو مقامات پر بتائی ہے، ایک : «{ وَ اَيُّوْبَ اِذْ نَادٰى رَبَّهٗۤ اَنِّيْ مَسَّنِيَ الضُّرُّ }» [ الأنبیاء : ۸۳ ] اور دوسری : «{ رَبَّهٗۤ اَنِّيْ مَسَّنِيَ الشَّيْطٰنُ بِنُصْبٍ وَّ عَذَابٍ }» [ صٓ : ۴۱ ] رہے نبی کریم صلی اللہ علیہ وسلم ! تو آپ سے اس حدیث کے سوا ایوب علیہ السلام کے متعلق ایک حرف بھی ثابت نہیں جس میں ان پر غسل کے دوران سونے کی ٹڈیاں گرنے کا ذکر ہے۔ پھر جب اس کے سوا قرآن اور حدیث میں کوئی بات ثابت ہی نہیں تو وہ کون صاحب ہیں جنھوں نے ایوب علیہ السلام کا حال آنکھوں سے دیکھا یا کانوں سے سنا؟ رہی اسرائیلی روایات! تو وہ علماء کے نزدیک قطعی طور پر متروک ہیں، اس لیے ان کے پڑھنے سے اپنی نگاہیں بچا کر رکھو اور ان کے سننے سے اپنے کان بند رکھو۔ کیونکہ وہ تمھاری سوچ میں محض خیال کا اور دل میں صرف خرابی کا اضافہ کریں گی۔ ابن عباس رضی اللہ عنھما نے فرمایا : [ يَا مَعْشَرَ الْمُسْلِمِيْنَ ! كَيْفَ تَسْأَلُوْنَ أَهْلَ الْكِتَابِ؟ وَكِتَابُكُمُ الَّذِيْ أُنْزِلَ عَلٰی نَبِيِّهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ أَحْدَثُ الْأَخْبَارِ بِاللّٰهِ تَقْرَؤُوْنَهٗ لَمْ يُشَبْ، وَقَدْ حَددَّثَكُمُ اللّٰهُ أَنَّ أَهْلَ الْكِتَابِ بَدَّلُوْا مَا كَتَبَ اللّٰهُ وَغَيَّرُوْا بِأَيْدِهِمُ الْكِتَابَ فَقَالُوْا : «{ هٰذَا مِنْ عِنْدِ اللّٰهِ لِيَشْتَرُوْا بِهٖ ثَمَنًا قَلِيْلًا }» [البقرة : ۷۹] أَفَلاَ يَنْهَاكُمْ مَا جَاءَكُمْ مِنَ الْعِلْمِ عَنْ مُسَاءَلَتِهِمْ؟ وَلَا وَاللّٰهِ ! مَا رَأَيْنَا رَجُلًا مِنْهُمْ قَطُّ يَسْأَلُكُمْ عَنِ الَّذِيْ أُنْزِلَ عَلَيْكُمْ ] [ بخاري، الشھادات، باباب لا یسأل أھل الشرک عن الشھادۃ وغیرھا : ۲۶۸۵ ] ’’اے مسلمانو کی جماعت! تم اہل کتاب سے کس طرح سوال کرتے ہو، جب کہ تمھاری کتاب، جو نبی صلی اللہ علیہ وسلم پر نازل کی گئی، اللہ تعالیٰ کی طرف سے آنے والی خبروں میں سے سب سے تازہ ہے۔ تم اسے اس حال میں پڑھتے ہو کہ اس میں کوئی ملاوٹ نہیں کی گئی اور اللہ تعالیٰ نے تمھیں بتا ددیا ہے کہ اللہ تعالیٰ نے جو لکھا تھا اہلِ کتاب نے اسے بدل دیا اور انھوں نے اپنے ہاتھوں سے اللہ کی کتاب میں تبدیلی کر دی اور کہا کہ یہ اللہ کی طرف سے ہے، تاکہ اس کے ساتھ بہت تھوڑی قیمت حاصل کریں۔ تو کیا تمھارے پاس جو علم آیا ہے وہ تمھیں ان سے سوال کرنے سے منع نہیں کرتا؟ نہیں! قسم ہے اللہ کی! ہم نے ان میں سے کسی آدمی کو کبھی تم سے اس کے متعلق سوال کرتے ہوئے نہیں دیکھا جو تم پر نازل کیا گیا ہے۔‘‘ آخر میں ابوشہبہ نے آلوسی، طبری اور دوسرے علماء سے اس مفہوم کی عبارتیں نقل کی ہیں۔ ایوب علیہ السلام کے متعلق مزید دیکھیے سورۂ صٓ (۴۱ تا ۴۴)۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84،83) ➊ { وَ اَيُّوْبَ اِذْ نَادٰى رَبَّهٗۤ …:} یعنی ایوب کو یاد کرو۔ داؤد اور سلیمان علیھما السلام کی آزمائش ان نعمتوں کے ساتھ ہوئی جن پر شکر واجب تھا، جبکہ ایوب علیہ السلام کی آزمائش ایسی تکالیف کے ساتھ ہوئی جن پر صبر لازم تھا۔ حقیقت یہ ہے کہ شکر اور صبر لازم و ملزوم ہیں۔ صبر وہی کر سکتا ہے جو شاکر ہو اور شکر وہی کرتا ہے جو صابر ہو۔ بے صبرا شاکر نہیں ہوتا اور ناشکرا صابر نہیں ہوتا۔ ان کا واقعہ قرآن مجید میں دو جگہ آیا ہے۔ ایک یہاں سورۂ انبیاء میں اور ایک سورۂ ص (۴۱ تا ۴۴) میں۔ ایک دفعہ زیر تفسیر آیات کا ترجمہ ملاحظہ کریں، ساتھ ہی سورۂ ص کی آیات کا ترجمہ دیکھیں، وہاں اللہ تعالیٰ نے فرمایا ہے : ’’اور ہمارے بندے ایوب کو یاد کر جب اس نے اپنے رب کو پکارا کہ بے شک شیطان نے مجھے بڑا دکھ اور تکلیف پہنچائی ہے۔ اپنا پاؤں مار، یہ نہانے کا اور پینے کا ٹھنڈا پانی ہے اور ہم نے اسے اس کے گھر والے عطا کر دیے اور ان کے ساتھ اتنے اور بھی، ہماری طرف سے رحمت کے لیے اور عقلوں والوں کی نصیحت کے لیے۔‘‘ ¤ ان آیات سے معلوم ہوتا ہے کہ ایوب علیہ السلام اللہ کے برگزیدہ نبی تھے۔ اللہ کی طرف سے ان پر ایسی آزمائش آئی کہ وہ شدید اور لمبی بیماری میں مبتلا ہو گئے، ان کے اہل و عیال بھی جدائی یا فوت ہونے کی وجہ سے ان سے جدا ہو گئے۔ (ثنائی) جب کمانے والے ہی نہ رہے تو مال مویشی بھی ہلاک ہو گئے، مگر ایوب علیہ السلام نے ہر مصیبت پر صبر کیا، نہ کوئی واویلا کیا اور نہ کوئی حرف شکایت لب پر لائے۔ جب تکلیف حد سے بڑھ گئی تو انھوں نے اللہ تعالیٰ سے دعا کی۔ ایک یہ کہ اے میرے رب! مجھے شیطان نے بڑا دکھ اور تکلیف پہنچائی ہے۔ دوسری یہ کہ اے میرے رب! مجھے بیماری لگ گئی ہے اور تو رحم کرنے والوں میں سب سے زیادہ رحم والا ہے۔ اس دعا میں انھوں نے اپنی حالت زار بیان کرنے کے بعد اللہ تعالیٰ کے ارحم الراحمین ہونے کے بیان ہی کو کافی سمجھا ہے۔ اللہ تعالیٰ نے ان کی دعا قبول فرمائی اور حکم دیا کہ زمین پر اپنا پاؤں مارو۔ انھوں نے پاؤں مارا تو ٹھنڈے پانی کا چشمہ نمودار ہو گیا۔ حکم ہوا کہ اسے پیو اور اس سے غسل کرو۔ وہ مبارک پانی پینے اور اس کے ساتھ غسل کرنے سے ان کی ساری بیماری دور ہو گئی اور وہ پوری طرح صحت مند ہو گئے۔ اللہ تعالیٰ نے انھیں ان کے گھر والے بھی عطا فرما دیے اور اتنے ہی اور عطا فرما دیے۔ بیماری کے دوران انھوں نے کسی پر ناراض ہو کر اسے کوڑے مارنے کی قسم کھائی تھی، اب وہ سزا زیادہ سمجھ کر پریشان تھے کہ اسے اتنے کوڑے ماروں تو زیادتی ہوتی ہے، نہ ماروں تو قسم ٹوٹتی ہے۔ اللہ تعالیٰ نے ان کی یہ مشکل بھی حل فرما دی کہ اتنے تنکوں کا مٹھا لے کر ایک دفعہ مار دو، جتنے کوڑے مارنے کی تم نے قسم کھائی تھی، اس سے تمھاری قسم پوری ہو جائے گی، قسم توڑنے کا گناہ نہیں ہو گا۔ ¤ ➋ {’’اَلضَّرُّ‘‘ } اور {’’اَلضُّرُّ‘‘} میں فرق یہ ہے کہ ضاد کے فتحہ کے ساتھ {’’ضَرٌّ‘‘}‘} نفع کی ضد ہے، اس سے مراد کوئی بھی نقصان ہے، مالی ہو یا جانی یا کوئی اور، جبکہ ضاد کے ضمہ کے ساتھ {’’ضُرٌّ‘‘} سے مراد آدمی کی جسمانی بدحالی ہے، مثلاً بیماری، لا غری یا بڑھاپا وغیرہ۔ (اعراب القرآن از درویش) ¤ ➌ ایوب علیہ السلام نے شدید تکلیف دہ بیماری اور اموال و اولاد کی ہلاکت جیسے مصائب کی آزمائش میں جس طرح صبر کیا، پھر جس طرح انھوں نے اللہ کی جناب میں اپنی حالت زار کا ذکر کرکے اس کے ارحم الراحمین ہونے کے واسطے سے دعا کی اور جسے شرف قبولیت عطا ہوا، اس سے چند اسباق حاصل ہوتے ہیں۔ ایک یہ کہ شدید بیماری اور مال و اہل کی تباہی کے ساتھ آزمائش اللہ تعالیٰ کی رحمت تھی، اسی طرح اس پر صبر کی توفیق دینا، پھر دعا قبول فرما کر صحت سے نوازنا اور دگنے اہل و عیال عطا فرمانا، سب کچھ اللہ کی عظیم رحمت تھی۔ دوسرا یہ کہ اس میں عبادت گزار بندوں کے لیے یاد دہانی ہے کہ اگر اللہ کے بندوں کا مصائب کے ذریعے سے امتحان ہو اور وہ اس پر صبر کریں اور اللہ تعالیٰ ہی کی جناب میں اپنی فریاد پیش کریں تو اللہ تعالیٰ کی طرف سے انعام ملتا ہے اور آدمی کے گمان سے بھی بہت زیادہ ملتا ہے۔ یہاں {’’ وَ ذِكْرٰى لِلْعٰبِدِيْنَ ‘‘} فرمایا، جبکہ سورۂ صٓ (۴۳) میں {’’ وَ ذِكْرٰى لِاُولِي الْاَلْبَابِ ‘‘} فرمایا، معلوم ہوا عبادت کرنے والے ہی عقل والے ہیں، جو بندگی نہیں کرتے وہ کتنے ہی ہوشیار نظر آئیں، عقل سے خالی ہیں۔ تیسرا یہ کہ آزمائش میں صبر اور اللہ تعالیٰ ہی سے بار بار رجوع اور استغاثہ و فریاد کی وجہ سے اللہ تعالیٰ نے ایوب علیہ السلام کی تعریف میں تین جملے ارشاد فرمائے : (1) «{ اِنَّا وَجَدْنٰهُ صَابِرًا }» ’’ہم نے اسے صبر کرنے والا پایا۔‘‘ (2) «{ نِعْمَ الْعَبْدُ }» ’’وہ بہت اچھا بندہ تھا۔‘‘ (3) «{ اِنَّهٗۤ اَوَّابٌ }» ’’یقینا وہ بہت رجوع کرنے والا تھا۔‘‘ اس سے معلوم ہوا کہ آزمائش میں کامیابی پر اللہ تعالیٰ کی طرف سے شاباش بھی ملتی ہے۔ اللہ تعالیٰ کی طرف سے یہ تحسین و آفرین ایوب علیہ السلام کے حق میں بہت ہی بڑی شہادت ہے۔ ¤ ➍ دکتور محمد بن محمد ابو شہبہ رحمہ اللہ اپنی کتاب {’’ اَلْاِسْرَائِيْلِيَاتُ وَالْمَوْضُوْعَاتُ فِيْ كُتُبِ التَّفْسِيْرِ ‘‘} میں لکھتے ہیں کہ ابن کثیر نے اپنی تفسیر میں اس آیت کے تحت فرمایا : ’’وہب بن منبہ سے ایوب علیہ السلام کے واقعہ میں ایک لمبا قصہ روایت کیا گیا ہے، جسے ابن جریر نے اور ابن ابی حاتم نے سند کے ساتھ اس (وہب بن منبہ) سے نقل کیا ہے۔ بعد میں آنے والے کئی ایک مفسرین نے بھی اسے ذکر کیا ہے۔ اس واقعہ میں غرابت ہے، ہم نے لمبا ہونے کی وجہ سے اسے ترک کر دیا ہے۔‘‘ ابوشہبہ فرماتے ہیں : ’’عجیب بات یہ ہے کہ روایات پر نقد کرنے والے حافظ ابن کثیر بھی ایوب علیہ السلام کے واقعہ میں انھی باتوں میں پڑ گئے ہیں جن میں دوسرے حضرات پڑے ہوئے تھے۔ انھوں نے یہاں بہت سی اسرائیلیات ذکر فرمائی ہیں، جن پر کوئی تعاقب نہیں فرمایا، حالانکہ ان کے متعلق ہمارا مشاہدہ ہے کہ وہ ایسی جو بات بھی ذکر فرماتے ہیں اس کے بارے میں بتاتے ہیں کہ وہ کہاں سے آئی اور اسلامی روایات میں کیسے داخل ہوئی؟ میں نہیں سمجھتا کہ وہ ان روایات کو (بلانقد) بیان کرنا جائز سمجھتے ہوں۔ چنانچہ انھوں نے ذکر کیا ہے کہ کہا جاتا ہے کہ ’’ان کے سارے بدن میں جذام (کوڑھ) ہو گیا اور ان کے دل اور زبان کے سوا کوئی چیز سلامت نہ رہی، جن کے ساتھ وہ اللہ عزو جل کا ذکر کرتے تھے۔ یہاں تک کہ پاس بیٹھنے والوں کو ان سے نفرت ہو گئی اور انھیں شہر کے ایک کونے میں الگ رہائش رکھنا پڑی۔ ان کی بیوی کے سوا ان پر شفقت کرنے والا کوئی نہ رہا، جس نے ان کی آزمائش کے دوران ناقابل بیان مصیبتیں اٹھائیں، حتیٰ کہ وہ محنت مزدوری کرنے لگیں، بلکہ انھوں نے اسی وجہ سے اپنے بال بھی فروخت کر دیے۔‘‘ پھر ذکر فرماتے ہیں : ’’بیان کیا جاتا ہے کہ وہ اس آزمائش میں بہت لمبی مدت تک مبتلا رہے۔ پھر اختلاف ہے کہ انھیں اس دعا کے لیے بے قرار کرنے کا باعث کیا تھا؟ چنانچہ حسن بصری اور قتادہ نے کہا، ایوب علیہ السلام سات سال اور کچھ مہینے آزمائش میں مبتلا رہے، اس عرصے میں انھیں کوڑا پھینکنے کی جگہ میں ڈال دیا گیا اور ان کے بدن میں کیڑے پڑ گئے۔ پھر اللہ تعالیٰ نے ان کی تکلیف دور فرمائی اور انھیں اجر عظیم عطا فرمایا اور ان کی بہت اچھی تعریف فرمائی۔ اور وہب بن منبہ نے کہا کہ آپ تین سال تکلیف میں مبتلا رہے، نہ زیادہ نہ کم۔ سدی نے کہا، ایوب علیہ السلام کا گوشت جھڑ گیا، صرف ہڈیاں اور پٹھے باقی رہ گئے۔‘‘ پھر ایک لمبا قصہ ذکر کیا، پھر ابن کثیرنے وہ واقعہ ذکر فرمایا جو ابن ابی حاتم نے اپنی سند سے عن الزہری عن انس بن مالک روایت کیا ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے نبی ایوب علیہ السلام پر ان کی آزمائش اٹھارہ برس رہی۔ دور و نزدیک کے سب لوگوں نے انھیں چھوڑ دیا۔ ان کے دوستوں بھائیوں میں سے صرف دو آدمی صبح اور شام ان کے پاس آتے تھے۔ ان میں سے ایک نے دوسرے سے کہا، جانتے ہو! اللہ کی قسم! ایوب نے کوئی ایسا گناہ کیا ہے جو دنیا میں کسی نے نہیں کیا۔ ساتھی نے کہا، وہ کیا ہے؟ اس نے کہا، اٹھارہ سال ہوئے اللہ تعالیٰ نے اس پر رحم نہیں کیا کہ اس کی تکلیف دور کر دیتا۔ جب شام کو دونوں ان کے پاس گئے تو اس آدمی نے اس بات کا ذکر کر دیا۔ ایوب علیہ السلام نے کہا، مجھے معلوم نہیں تم کیا کہہ رہے ہو؟ ہاں یہ بات اللہ تعالیٰ جانتا ہے کہ میں دو آدمیوں کے پاس سے گزرتا جو جھگڑ رہے ہوتے، جس میں وہ اللہ کا ذکر کرتے تو میں گھر آ کر ان کی طرف سے کفارہ دے دیتا کہ کہیں وہ ناحق اللہ کا ذکر نہ کر رہے ہوں۔ اور وہ حاجت کے لیے باہر جایا کرتے تھے، جب فارغ ہو جاتے تو ان کی بیوی ہاتھ پکڑ کر لے آتی۔ ایک دن اس نے آنے میں دیر کی تو اسی جگہ اللہ تعالیٰ نے ان کی طرف وحی کی : «{ اُرْكُضْ بِرِجْلِكَ هٰذَا مُغْتَسَلٌۢ بَارِدٌ وَّ شَرَابٌ }» [ صٓ : ۴۲ ] ’’اپنا پاؤں مار، یہ نہانے کا اور پینے کا ٹھنڈا پانی ہے۔‘‘ ¤ حافظ ابن حجر رحمہ اللہ نے فرمایا کہ ایوب علیہ السلام کے قصے میں سب سے صحیح روایت وہ ہے جو ابن ابی حاتم اور ابن جریر نے بیان کی ہے اور ابن حبان اور حاکم نے اسے صحیح کہا ہے، پھر یہ روایت بیان کی۔ شیخ ناصر الدین البانی نے بھی اسے صحیح کہا ہے۔ (سلسلہ صحیحہ : ۱۷) مگر صحیح بات یہی ہے کہ یہ روایت صحیح نہیں۔ حافظ ابن حجر کے قول سے اس کا صحیح ہونا ثابت نہیں ہوتا، صرف دوسری روایتوں سے اس کا بہتر ہونا ثابت ہوتا ہے۔ اگر ان کی مراد اس حدیث کا صحیح ہونا ہو تب بھی ان کی بات محل نظر ہے۔ ابن کثیر نے {’’ اَلْبِدَايَةُ وَالنِّهَايَةُ ‘‘} میں ایوب علیہ السلام کے تذکرہ میں فرمایا : {’’هٰذَا غَرِيْبٌ رَفْعُهُ جِدًّا وَالْأَشْبَهُ أَنْ يَّكُوْنَ مَوْقُوْفًا‘‘} ’’اس روایت کا رسول اللہ صلی اللہ علیہ وسلم سے مروی ہونا بہت ہی غریب ہے، زیادہ قریب یہی ہے کہ یہ صحابی کا قول ہے۔‘‘ اس روایت کی تمام سندوں میں زہری کی روایت ’’عن‘‘ کے لفظ کے ساتھ آئی ہے اور زہری کا اپنی تمام تر عظمت وجلالت کے باوجود مدلس ہونا معروف و مشہور ہے۔ اس لیے صحیحین کے سوا ان کی تدلیس والی روایت کو صحیح نہیں کہا جا سکتا۔ ¤ ایوب علیہ السلام کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے صرف ایک صحیح حدیث آئی ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ بَيْنَمَا أَيُّوْبُ يَغْتَسِلُ عُرْيَانًا خَرَّ عَلَيْهِ رِجْلُ جَرَادٍ مِنْ ذَهَبٍ فَجَعَلَ يَحْثِيْ فِيْ ثَوْبِهِ فَنَادَاهُ رَبُّهُ يَا أَيُّوْبُ ! أَلَمْ أَكُنْ أَغْنَيْتُكَ عَمَّا تَرَی؟ قَالَ بَلٰی يَا رَبِّ ! وَلَكِنْ لَا غِنَی  لِيْ عَنْ بَرَكَتِكَ ] [بخاري، أحادیث الأنبیاء، باب قول اللّٰہ تعالٰی : « و أیوب إذ نادی ربہ…» : ۳۳۹۱ ]’’ایوب علیہ السلام کپڑے اتار کر غسل کر رہے تھے، غسل کے دوران ہی ان پر سونے کی ٹڈیوں کا ایک دَل (لشکر) آ گرا۔ ایوب علیہ السلام لپوں کے ساتھ اسے اپنے کپڑے میں بھرنے لگے تو انھیں ان کے رب نے آواز دی : ’’اے ایوب! کیا میں نے تمھیں اس سے غنی نہیں کر دیا جو تم دیکھ رہے ہو؟‘‘ انھوں نے عرض کی : ’’کیوں نہیں، تیری عزت کی قسم! لیکن میرے لیے تیری برکت سے کسی طرح بے پروائی ممکن نہیں۔‘‘ ¤ اس کے علاوہ ایوب علیہ السلام کے متعلق تمام اقوال تابعین یا صحابہ سے مروی ہیں اور سب وہب بن منبہ کے بیان ہی کا خلاصہ یا تفصیل ہیں، جو صاف ظاہر ہے کہ بنی اسرائیل سے لیے گئے ہیں۔ حقیقت صرف وہی ہے جو اللہ تعالیٰ نے بیان فرمائی ہے اور جس کا خلاصہ اس آیت کے فائدہ نمبر (۱) میں گزر چکا ہے۔ کسی مسلمان کے لیے جائز نہیں کہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے بیان پر اپنے پاس سے یا ان اہلِ کتاب سے لے کر اضافہ کرے جنھوں نے انبیاء پر تہمتیں باندھیں، بلکہ انھوں نے اللہ تعالیٰ کو بھی نہیں بخشا اور کہہ دیا کہ اللہ فقیر ہے اور ہم غنی ہیں۔ دیکھیے سورۂ آل عمران (۱۸۱) اور یہ کہ اللہ کا ہاتھ بندھا ہوا ہے۔ اللہ تعالیٰ نے فرمایا : «{ غُلَّتْ اَيْدِيْهِمْ وَ لُعِنُوْا بِمَا قَالُوْا }» [ المائدۃ : ۶۴ ] ’’انھی کے ہاتھ بندھے ہوئے ہیں اور ان کی باتوں کی وجہ سے ان پر لعنت کی گئی ہے۔‘‘ ¤ ➎ ابوشہبہ فرماتے ہیں، ہمیں جو عقیدہ رکھنا واجب ہے وہ یہ ہے کہ ایوب علیہ السلام کی آزمائش یقینا ہوئی، ان پر جسم اور اہلِ مال کی شدید تکلیف آئی، جس پر انھوں نے ایسا صبر کیا کہ صبر میں ضرب المثل بن گئے اور اللہ تعالیٰ نے بھی اس پر ان کی تعریف فرمائی، مگر ان کی آزمائش اس حد تک نہیں پہنچی جو ان جھوٹی داستانوں میں بیان ہوئی ہے کہ انھیں جذام (کوڑھ) ہو گیا، ان کے سارے جسم پر پھوڑے بن گئے، انھیں کوڑے کے ڈھیر پر پھینک دیا گیا۔ ان کے جسم میں کیڑے رینگتے پھرتے تھے اور ہڈیوں اور پٹھوں کے سوا سارا گوشت جھڑ گیا تھا اور ان سے دور ہی سے بدبو آتی تھی وغیرہ۔ ایوب علیہ السلام اللہ تعالیٰ کے ہاں اس سے کہیں معزز ومکرم تھے کہ انھیں کوڑے پر پھینک دیا جائے، یا وہ ایسے مرض میں مبتلا ہوں جس سے لوگ ان کی دعوت سے متنفر ہوں۔ اللہ کا پیغام پہنچانے والا ہی اس قدر معیوب حالت میں ہو تو ایسی دعوت کا کیا فائدہ اور اس سے حاصل کیا ہو گا؟ پھر انبیاء ہمیشہ اپنی قوم کے اونچے نسب میں سے مبعوث کیے جاتے رہے ہیں (جیسا کہ حدیثِ ہرقل میں ہے)۔ ایوب علیہ السلام کی ایسی حالت میں ان کا قبیلہ کہاں تھا کہ ان کی حفاظت کرتا، ان کے کھانے پینے کا بندوبست کرتا، بجائے اس کے کہ ان کی بیوی لوگوں کے گھروں میں کام کرے، بلکہ اپنے سر کے بال فروخت کرتی پھرے اور ان پر ایمان لانے والے کہاں گئے، کیا سب انھیں چھوڑ گئے، کیا ایمان کا تقاضا یہی ہے؟ ¤ حقیقت یہ ہے کہ اس قسم کی ساری داستانیں بے بنیاد ہیں، نہ عقل سلیم انھیں تسلیم کرتی ہے اور نہ صحیح نقل۔ ایوب علیہ السلام پر آنے والی بیماری ایسی ہر گز نہ تھی جس سے نفرت پیدا ہو، کیونکہ یہ ان کے منصب ہی کے خلاف تھا، بلکہ وہ اس قسم کی کوئی بیماری تھی جس کا جسم پر کوئی نشان ظاہر نہیں ہوتا، مثلاً کوئی جسمانی درد، ریوماٹزم، جوڑوں یا ہڈیوں وغیرہ کی تکلیف۔ جب اللہ کا فضل ہوا تو زمین پر پاؤں مارنے کے نتیجے میں نمودار ہونے والے چشمے کا ٹھنڈا پانی پینے اور اس کے ساتھ غسل کرنے سے مکمل شفایاب ہو گئے۔ قاضی ابوبکر ابن العربی رحمہ اللہ کی بات دل کو بہت لگتی ہے، وہ فرماتے ہیں : ’’ایوب علیہ السلام کے معاملے میں کوئی بات ثابت نہیں سوائے اس کے جو اللہ تعالیٰ نے ہمیں اپنی کتاب میں دو مقامات پر بتائی ہے، ایک : «{ وَ اَيُّوْبَ اِذْ نَادٰى رَبَّهٗۤ اَنِّيْ مَسَّنِيَ الضُّرُّ }» [ الأنبیاء : ۸۳ ] اور دوسری : «{ رَبَّهٗۤ اَنِّيْ مَسَّنِيَ الشَّيْطٰنُ بِنُصْبٍ وَّ عَذَابٍ }» [ صٓ : ۴۱ ] رہے نبی کریم صلی اللہ علیہ وسلم ! تو آپ سے اس حدیث کے سوا ایوب علیہ السلام کے متعلق ایک حرف بھی ثابت نہیں جس میں ان پر غسل کے دوران سونے کی ٹڈیاں گرنے کا ذکر ہے۔ پھر جب اس کے سوا قرآن اور حدیث میں کوئی بات ثابت ہی نہیں تو وہ کون صاحب ہیں جنھوں نے ایوب علیہ السلام کا حال آنکھوں سے دیکھا یا کانوں سے سنا؟ رہی اسرائیلی روایات! تو وہ علماء کے نزدیک قطعی طور پر متروک ہیں، اس لیے ان کے پڑھنے سے اپنی نگاہیں بچا کر رکھو اور ان کے سننے سے اپنے کان بند رکھو۔ کیونکہ وہ تمھاری سوچ میں محض خیال کا اور دل میں صرف خرابی کا اضافہ کریں گی۔ ابن عباس رضی اللہ عنھما نے فرمایا : [ يَا مَعْشَرَ الْمُسْلِمِيْنَ ! كَيْفَ تَسْأَلُوْنَ أَهْلَ الْكِتَابِ؟ وَكِتَابُكُمُ الَّذِيْ أُنْزِلَ عَلٰی نَبِيِّهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ أَحْدَثُ الْأَخْبَارِ بِاللّٰهِ تَقْرَؤُوْنَهٗ لَمْ يُشَبْ، وَقَدْ حَددَّثَكُمُ اللّٰهُ أَنَّ أَهْلَ الْكِتَابِ بَدَّلُوْا مَا كَتَبَ اللّٰهُ وَغَيَّرُوْا بِأَيْدِهِمُ الْكِتَابَ فَقَالُوْا : «{ هٰذَا مِنْ عِنْدِ اللّٰهِ لِيَشْتَرُوْا بِهٖ ثَمَنًا قَلِيْلًا }» [البقرة : ۷۹] أَفَلاَ يَنْهَاكُمْ مَا جَاءَكُمْ مِنَ الْعِلْمِ عَنْ مُسَاءَلَتِهِمْ؟ وَلَا وَاللّٰهِ ! مَا رَأَيْنَا رَجُلًا مِنْهُمْ قَطُّ يَسْأَلُكُمْ عَنِ الَّذِيْ أُنْزِلَ عَلَيْكُمْ ] [ بخاري، الشھادات، باباب لا یسأل أھل الشرک عن الشھادۃ وغیرھا : ۲۶۸۵ ] ’’اے مسلمانو کی جماعت! تم اہل کتاب سے کس طرح سوال کرتے ہو، جب کہ تمھاری کتاب، جو نبی صلی اللہ علیہ وسلم پر نازل کی گئی، اللہ تعالیٰ کی طرف سے آنے والی خبروں میں سے سب سے تازہ ہے۔ تم اسے اس حال میں پڑھتے ہو کہ اس میں کوئی ملاوٹ نہیں کی گئی اور اللہ تعالیٰ نے تمھیں بتا ددیا ہے کہ اللہ تعالیٰ نے جو لکھا تھا اہلِ کتاب نے اسے بدل دیا اور انھوں نے اپنے ہاتھوں سے اللہ کی کتاب میں تبدیلی کر دی اور کہا کہ یہ اللہ کی طرف سے ہے، تاکہ اس کے ساتھ بہت تھوڑی قیمت حاصل کریں۔ تو کیا تمھارے پاس جو علم آیا ہے وہ تمھیں ان سے سوال کرنے سے منع نہیں کرتا؟ نہیں! قسم ہے اللہ کی! ہم نے ان میں سے کسی آدمی کو کبھی تم سے اس کے متعلق سوال کرتے ہوئے نہیں دیکھا جو تم پر نازل کیا گیا ہے۔‘‘ آخر میں ابوشہبہ نے آلوسی، طبری اور دوسرے علماء سے اس مفہوم کی عبارتیں نقل کی ہیں۔ ایوب علیہ السلام کے متعلق مزید دیکھیے سورۂ صٓ (۴۱ تا ۴۴)۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 85) ➊ { وَ اِسْمٰعِيْلَ وَ اِدْرِيْسَ وَ ذَا الْكِفْلِ :} یعنی ان تینوں کو یاد کرو۔ ایوب علیہ السلام کے صبر اور ان کے حسن انجام کے ذکر کے بعد اللہ تعالیٰ نے اپنے تین پیغمبروں کا ذکر فرمایا جو خاص طور پر صبر کی صفت سے آراستہ تھے۔ اسماعیل علیہ السلام نے ذبح کے متعلق اپنے والد ماجد کے پوچھنے پر کہا : «{ سَتَجِدُنِيْۤ اِنْ شَآءَ اللّٰهُ مِنَ الصّٰبِرِيْنَ }» [ الصافات : ۱۰۲ ] ’’اگر اللہ نے چاہا تو تو مجھے ضرور صبر کرنے والوں میں سے پائے گا۔‘‘ اور اس نے واقعی صبر کرکے دکھایا۔ اسی طرح وادی غیر ذی زرع میں مستقل رہائش پر اور شکار اور زمزم کے ساتھ زندگی گزارنے پر صبر کیا، پھر بیت اللہ کی تعمیر میں ہر طرح کی مشقت برداشت کی۔ اللہ تعالیٰ نے ان کی اولاد میں سید ولد آدم صلی اللہ علیہ وسلم کو پیدا فرمایا۔ اسماعیل اور ادریس علیھما السلام کا ذکر سورۂ مریم (۵۴ تا ۵۷) میں گزر چکا ہے۔ ذوالکفل کے متعلق قرآن و حدیث میں تفصیل نہیں آئی۔ ابن کثیر نے فرمایا کہ انبیاء کے ساتھ ذکر سے معلوم ہوتا ہے کہ وہ اللہ کے نبی تھے۔ (واللہ اعلم) اس کے علاوہ تفاسیر میں ان کے متعلق بیان کردہ تمام باتیں اسرائیلیات پر مبنی اور بے اصل ہیں۔ ¤ ➋ { كُلٌّ مِّنَ الصّٰبِرِيْنَ :} صبر کا لفظی معنی باندھنا ہے، یہ تین طرح کا ہوتا ہے : (1) اللہ تعالیٰ کی اطاعت پر صبر، یعنی اپنے آپ کو اس کی فرماں برداری کا پابند رکھنا۔ (2) اللہ تعالیٰ کی نافرمانی سے صبر، یعنی اپنے آپ کو اس سے روک کر رکھنا۔ (3) اللہ تعالیٰ کی طرف سے تقدیر میں لکھے ہوئے آلام و مصائب آنے پر اپنے آپ کو جزع فزع اور اللہ تعالیٰ یا مخلوق کے شکوہ و شکایت سے روک کر رکھنا۔ کوئی بھی شخص صابر نہیں کہلا سکتا جب تک وہ صبر کی ان تینوں قسموں سے پوری طرح آراستہ نہ ہو۔ اللہ تعالیٰ نے ان تمام پیغمبروں کے متعلق شہادت دی کہ انھوں نے صبر کا پورا حق ادا کیا۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86) { وَ اَدْخَلْنٰهُمْ فِيْ رَحْمَتِنَا اِنَّهُمْ مِّنَ الصّٰلِحِيْنَ : ’’صَلَحَ يَصْلَحُ صَلَاحًا‘‘} (ف، ن، ک) درست ہونا۔ یہ فساد کی ضد ہے۔ (قاموس) اللہ تعالیٰ نے ان انبیاء کی تعریف فرمائی کہ وہ پوری طرح صالح تھے، ان کا دل اللہ تعالیٰ پر ایمان، اس کی محبت اور ہر وقت اس کے ذکر سے درست تھا۔ ان کی زبان اس کے ذکر، اس کے دین کی دعوت اور ہر وقت سچ کہنے سے درست تھی اور دوسرے تمام اعضاء اس کے احکام کی اطاعت اور منع کردہ چیزوں سے اجتناب کی وجہ سے درست تھے، کیونکہ ان تینوں کے درست ہوئے بغیر کوئی شخص صالح نہیں کہلا سکتا۔ اللہ تعالیٰ نے فرمایا کہ صبر و صالحیت کی وجہ سے ہم نے انھیں اپنی رحمت میں داخل کر لیا اور انھیں نبوت عطا کی۔ دنیا و آخرت کی نعمتیں عطا فرمائیں، یہی کیا کم ہے کہ اللہ تعالیٰ نے اپنی کتاب میں ان کی تعریف فرمائی اور قیامت تک کے لیے انھیں حقیقی ناموری عطا فرمائی۔ (سعدی)"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) ➊ { وَ ذَا النُّوْنِ :} یعنی مچھلی والے کو یاد کرو۔ {’’ النُّوْنِ ‘‘} کی جمع {’’نِيْنَانٌ‘‘} ہے، جیسے {’’حُوْتٌ‘‘} کی جمع {’’حِيْتَانٌ‘‘} ہے۔ اس سے مراد یونس بن متی (بروزن {شَتّٰي}) ہیں جو نینویٰ (پہلے نون کے کسرہ  اور دوسرے کے فتحہ کے ساتھ) کے رہنے والے تھے، جو موصل (عراق) کے قریب تھا۔ ¤ ➋ { اِذْ ذَّهَبَ مُغَاضِبًا: ’’ مُغَاضِبًا ‘‘} باب مفاعلہ سے اسم فاعل ہے جس میں مشارکت ہوتی ہے، یا معنی میں مبالغہ مراد ہوتا ہے۔ یونس علیہ السلام نے جب اپنی قوم کو دعوت دی اور وہ مسلسل کفر کرتے رہے تو آخر اکتا کرسخت غصے کی حالت میں ان کے حق میں بددعا کی اور عذاب کی دھمکی دے کر اللہ تعالیٰ کی اجازت کے بغیر انھیں چھوڑ کر نکل پڑے۔ جب کہ منصبِ رسالت کا تققاضا تھا کہ ان کے تمام تر غیظ و غضب اور کفر و طغیان کے باوجود انھی میں رہتے اور اللہ تعالیٰ کے حکم کے بغیر ہر گز انھیں چھوڑ کر نہ جاتے، جیسا کہ نوح علیہ السلام نے ساڑھے نو سو سال دعوت میں گزار دیے، نہ اکتائے اور نہ ان کے حق میں بددعا کی، جب تک اللہ تعالیٰ نے انھیں یہ نہیں بتایا کہ آئندہ ان کی قوم میں سے کوئی شخص ایمان نہیں لائے گا۔ دیکھیے سورۂ ہود (۳۶) اس لیے اللہ تعالیٰ نے ہمارے نبی کریم صلی اللہ علیہ وسلم کو فرمایا : «{ فَاصْبِرْ لِحُكْمِ رَبِّكَ وَ لَا تَكُنْ كَصَاحِبِ الْحُوْتِ }» [ القلم : ۴۸ ] ’’پس اپنے رب کے فیصلے تک صبر کر اور مچھلی والے کی طرح نہ ہو۔‘‘ اور فرمایا : «{ فَاصْبِرْ كَمَا صَبَرَ اُولُوا الْعَزْمِ مِنَ الرُّسُلِ وَ لَا تَسْتَعْجِلْ لَّهُمْ }» [ الأحقاف : ۳۵ ] ’’پس اولو العزم رسولوں کی طرح صبر کر اور ان کے لیے جلدی (عذاب کا) مطالبہ نہ کر۔‘‘ اللہ تعالیٰ نے یونس علیہ السلام کے بلااجازت نکلنے کو غلام کا بھاگ جانا قرار دیا ہے، فرمایا : «{ اِذْ اَبَقَ اِلَى الْفُلْكِ الْمَشْحُوْنِ }» [ الصافات : ۱۴۰ ] ’’جب وہ بھری ہوئی کشتی کی طرف بھاگ کر گیا۔‘‘ یونس علیہ السلام کے واقعہ کے لیے مزید دیکھیے سورۂ یونس (۹۸) اور سورۂ صافات (۱۳۹ تا ۱۴۸)۔ ¤ ➌ { فَظَنَّ اَنْ لَّنْ نَّقْدِرَ عَلَيْهِ : ’’ اَنْ ‘‘} اصل میں {’’أَنَّا‘‘} سے مخفف ہے، {’’ نَا ‘‘} کو حذف کر کے {’’ أَنَّ ‘‘} کے نون کو ساکن کر دیا گیا ہے، یا {’’ أَنْ ‘‘} حرف تفسیر ہے جو {’’أَيْ‘‘} کے معنی میں ہے۔ یہاں ایک سوال ہے کہ {’’قَدَرَ يَقْدِرُ‘‘} کا معنی قادر ہونا، قابو پانا ہے، تو یہ کس طرح ہو سکتا ہے کہ اللہ کا جلیل القدر پیغمبر یہ سمجھ لے کہ اللہ تعالیٰ مجھ پر قابو نہیں پا سکے گا؟ اس کے دو جواب ہیں، ایک یہ کہ انھوں نے یہ ہر گز نہیں سمجھا کہ اللہ تعالیٰ ان پر قابو نہیں پا سکے گا، بلکہ اصل یہ ہے کہ اللہ تعالیٰ اپنے پیغمبروں کی معمولی کوتاہی پر بھی سخت خفگی کا اظہار فرماتے ہیں۔ اس آیت میں ان کی حالت کا بیان ہے کہ بلااجازت ان کے چلے جانے سے ظاہر ہو رہا تھا جیسے وہ سمجھ رہے ہوں کہ مجھے کوئی پکڑ نہیں سکے گا۔ دوسرا جواب اس سے بہتر ہے کہ یہاں {’’ لَنْ نَّقْدِرَ ‘‘} قادر ہونے کے معنی میں نہیں، بلکہ تنگی کرنے اور گرفت کرنے کے معنی میں ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اَللّٰہُ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَآءُ وَ يَقْدِرُ }» [ الرعد : ۲۶ ] ’’اللہ رزق فراخ کر دیتا ہے جس کے لیے چاہتا ہے اور تنگ کر دیتا ہے۔‘‘ اور فرمایا : «{وَ مَنْ قُدِرَ عَلَيْهِ رِزْقُهٗ فَلْيُنْفِقْ مِمَّاۤ اٰتٰىهُ اللّٰهُ }» [ الطلاق : ۷ ] ’’اور جس پر اس کا رزق تنگ کیا گیا ہو تو وہ اس میں سے خرچ کرے جو اللہ نے اسے دیا ہے۔‘‘ آیت کا معنی یہ ہو گا کہ یونس علیہ السلام نے سمجھا کہ ان کے بلااجازت قوم سے نکل جانے پر ہم ان پر کوئی گرفت نہیں کریں گے۔ بعض اہل علم نے پہلے معنی کو سرے سے غلط قرار دیا ہے۔ ¤ ➍ {فَنَادٰى فِي الظُّلُمٰتِ :} یہاں ایک لمبی بات حذف کر دی گئی ہے، جو سورۂ صافات (۱۳۹ تا ۱۴۸) میں مذکور ہے۔ خلاصہ اس کا یہ ہے کہ وہ قوم سے نکلے تو سمندری سفر کے لیے ایک کشتی میں سوار ہوئے جو ضرورت سے زیادہ بھری ہوئی تھی۔ طوفان آیا اور سب کے ڈوبنے کا خطرہ پیدا ہوا تو کشتی ہلکی کرنے کے لیے سامان پھینکنے کے بعد کچھ آدمیوں کو سمندر میں پھینکنے کا فیصلہ ہوا۔ قرعہ ڈالا گیا تو کئی اور آدمیوں کے ساتھ یونس علیہ السلام کے نام کا قرعہ نکلا، چنانچہ دوسروں کے ساتھ انھیں بھی سمندر میں پھینک دیا گیا، جہاں اللہ کے حکم سے ایک بہت بڑی مچھلی نے انھیں سالم ہی نگل لیا۔ اب وہ ایسی جگہ تھے جہاں اندھیرا ہی اندھیرا تھا۔ یہ ایسا قید خانہ تھا جہاں نہ کوئی ملاقاتی، نہ مقدمہ لڑنے والا، نہ پیروی کرنے والا، نہ قید کی کوئی میعاد، بلکہ تا قیامت قید کا فیصلہ (اگر وہ تسبیح نہ کریں) اور نہ اللہ کے سوا امید کی کوئی روشنی۔ ان کئی اندھیروں میں انھوں نے اپنے رب کو اس حال میں آواز دی کہ وہ غم سے بھرے ہوئے تھے، فرمایا : «{ اِذْ نَادٰى وَ هُوَ مَكْظُوْمٌ }» [ القلم :۴۸ ] ’’جب اس نے پکارا، اس حال میں کہ وہ غم سے بھرا ہوا تھا۔‘‘ ¤ ➎ قرآن مجید میں {’’ الظُّلُمٰتِ ‘‘} کا لفظ ہر جگہ جمع ہی آیا ہے، واحد کہیں بھی استعمال نہیں ہوا۔ (ابن عاشور) پھر سمندر کی تاریکیوں کا کوئی حساب ہی نہیں، اللہ تعالیٰ نے فرمایا : «{ اَوْ كَظُلُمٰتٍ فِيْ بَحْرٍ لُّجِّيٍّ يَّغْشٰىهُ مَوْجٌ مِّنْ فَوْقِهٖ مَوْجٌ مِّنْ فَوْقِهٖ سَحَابٌ ظُلُمٰتٌۢ بَعْضُهَا فَوْقَ بَعْضٍ }» [ النور : ۴۰ ] ’’یا (کفار کے اعمال کی مثال) ان اندھیروں کی طرح ہے جو نہایت گہرے سمندر میں ہوں، جسے ایک موج ڈھانپ رہی ہو، جس کے اوپر ایک اور موج ہو، جس کے اوپر ایک بادل ہو، کئی اندھیرے ہوں، جن میں سے بعض بعض کے اوپر ہوں۔‘‘ اللہ تعالیٰ کے فرمان کے مطابق سمندر کے اندھیرے جب صرف {’’ الظُّلُمٰتِ ‘‘} ہی نہیں بلکہ{ ’’ ظُلُمٰتٌۢ بَعْضُهَا فَوْقَ بَعْضٍ ‘‘} ہیں تو{ ’’ الظُّلُمٰتِ ‘‘} کی جمع کا صیغہ مکمل کرنے کے لیے رات کا اندھیرا شامل کرنے کی کیا ضرورت ہے؟ یونس علیہ السلام کی دعا دن کے وقت ہو تب بھی {’’ فِي الظُّلُمٰتِ ‘‘} ہی ہے۔ [ التفسیر القرآنی للشیخ عبد الکریم الخطیب ] ¤ ➏ { اَنْ لَّاۤ اِلٰهَ اِلَّاۤ اَنْتَ:} یہ{’’ اَنْ ‘‘} بھی اصل میں {’’أَنَّهُ‘‘} سے مخفف ہے، یا حرف تفسیر بمعنی {’’ أَيْ ‘‘} ہے۔ اللہ تعالیٰ نے اس سے اگلی آیت میں فرمایا ہے : «{ فَاسْتَجَبْنَا لَهٗ }» ’’تو ہم نے اس کی دعا قبول کی۔‘‘ یہاں سوال پیدا ہوتا ہے کہ یونس علیہ السلام نے کچھ مانگا ہی نہیں، نہ رہائی اور نہ اس مصیبت سے چھٹکارا، تو اللہ تعالیٰ نے کون سی دعا قبول فرمائی؟ جواب اس کا یہ ہے (واللہ اعلم) کہ انھوں نے اپنی حالت کے مطابق بہترین دعا کی ہے۔ پہلے اللہ تعالیٰ کی تعریف کی کہ تیرے سوا کوئی معبود نہیں، تو میرا مالک و معبود ہے، میں تیرا بندہ اور تیرا غلام ہوں، میں اور میرا سب کچھ تیرے سپرد اور تیرے تابع ہے۔ پھر اس کی تسبیح کی کہ تو ہر عیب اور کمی سے پاک ہے، میری اس آزمائش اور مصیبت میں تیرا کوئی ظلم ہے نہ زیادتی، تیری ذات ظلم سے یکسر پاک ہے۔ تو نے جو کیا مالک اور معبود ہونے کی وجہ سے تیرا حق ہے اور اس میں تیری بے شمار حکمتیں ہیں۔ آخر میں اپنے ظلم کا اعتراف کیا کہ یقینا مجھ پر جو کچھ گزرا یہ میرے اپنی جان پر ظلم کی وجہ سے ہے۔ یہ دعا بہترین اس لیے ہے کہ اللہ تعالیٰ کی توحید کے اعتراف میں درخواست ہو رہی ہے کہ تیرے سوا کوئی مجھے اس مصیبت سے نجات نہیں دے سکتا، تسبیح کے ضمن میں اظہار ہو رہا ہے کہ تو مجھے اس مصیبت سے نکالنے سے عاجز نہیں کہ جس سے نکلنے کی بظاہر کوئی صورت نہیں اور ہمیشہ سے اپنے ظالموں میں سے ہونے کا اعتراف معافی اور بخشش مانگنے کی لطیف ترین صورت ہے۔ ایوب علیہ السلام نے بھی دعا کے لیے عرض حال اور اللہ کی رحمت کا واسطہ دینے پر اکتفا کیا ہے۔ مزید سورۂ فاتحہ کی تفسیر میں {’’ اَلْحَمْدُ لِلّٰهِ ‘‘} کے بہترین دعا ہونے کی تفصیل ملاحظہ فرمائیں۔ یونس علیہ السلام کے واقعہ کی مزید تفصیل سورۂ صافات اور سورۂ قلم میں دیکھیں۔"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) { وَ كَذٰلِكَ نُـْۨجِي الْمُؤْمِنِيْنَ :} اس کے دو معنی ہیں اور دونوں ہی مراد ہیں، ایک یہ کہ جس طرح ہم نے یونس علیہ السلام کی دعا قبول کرکے انھیں غم سے نجات دی اسی طرح ہم ایمان والوں کو ان کی دعائیں قبول کرکے غم سے نجات دیتے ہیں۔ دوسرا یہ کہ جس طرح اس دعا کے ساتھ ہم نے یونس علیہ السلام کو غم سے نجات دی اسی طرح ایمان والوں کو ہم اس دعا کے ساتھ غم سے نجات دیتے ہیں۔ سعد بن ابی وقاص رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ دَعْوَةُ ذِي النُّوْنِ إِذْ دَعَا وَهُوَ فِيْ بَطْنِ الْحُوْتِ « لَاۤ اِلٰهَ اِلَّاۤ اَنْتَ سُبْحٰنَكَ اِنِّيْ كُنْتُ مِنَ نَ الظّٰلِمِيْنَ» فَإِنَّهٗ لَمْ يَدْعُ بِهَا رَجُلٌ مُسْلِمٌ فِيْ شَيْءٍ قَطُّ إِلَّا اسْتَجَابَ اللّٰهُ لَهٗ ] [ ترمذي، الدعوات، باب في دعوۃ ذي النون : ۳۵۰۵۔ مسند أحمد : 170/1، ح : ۱۶۴۴، و صححہ الألباني ]’’ذو النون (یونس علیہ السلام ) کی دعا، جو اس نے مچھلی کے پیٹ میں کی « لَاۤ اِلٰهَ اِلَّاۤ اَنْتَ سُبْحٰنَكَ اِنِّيْ كُنْتُ مِنَ الظّٰلِمِيْنَ» کوئی مسلم آدمی اس کے ساتھ کسی چیز کے بارے میں دعا نہیں کرتا مگر اللہ تعالیٰ اس کی دعا قبول کرتا ہے۔‘‘"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 89) ➊ {وَ زَكَرِيَّاۤ اِذْ نَادٰى رَبَّهٗ … :} یہ اس سورت میں مذکور نواں قصہ ہے، اس کی تفصیل سورۂ آل عمران (۳۹ تا ۴۱) اور سورۂ مریم ( ۱ تا ۱۵) میں ملاحظہ فرمائیں۔ ¤ ➋ { وَ اَنْتَ خَيْرُ الْوٰرِثِيْنَ :} وارث وہ ہے جو کسی مالک کے فوت ہونے کے بعد اس کی ملکیت کا مالک بنے۔ اصل وارث سب کا اللہ تعالیٰ ہی ہے، جیسا کہ فرمایا : «{ اِنَّا نَحْنُ نَرِثُ الْاَرْضَ وَ مَنْ عَلَيْهَا }» [ مریم : ۴۰ ] ’’بے شک ہم، ہم ہی زمین کے وارث ہوں گے اور ان کے بھی جو اس پر ہیں۔‘‘ زکریا علیہ السلام نے اپنے علم و نبوت کا وارث عطا کرنے کی درخواست کرتے ہوئے اللہ تعالیٰ کی صفت {’’ خَيْرُ الْوٰرِثِيْنَ ‘‘} کا وسیلہ پکڑا۔ قرآن و سنت میں مذکور دعاؤں میں ہر دعا کی مناسبت سے اللہ تعالیٰ کی صفت کا ذکر ہے، جیسا کہ ایوب علیہ السلام نے {’’ وَ اَنْتَ خَيْرُ الْوٰرِثِيْنَ ‘‘} کہا اور یونس علیہ السلام نے {’’ لَاۤ اِلٰهَ اِلَّاۤ اَنْتَ سُبْحٰنَكَ ‘‘} کہا۔ بعض مفسرین نے اس جملہ کی یہ توجیہ فرمائی ہے کہ میں تجھ سے وارث عطا کرنے کی دعا کر رہا ہوں، مگر حقیقی وارث تو ہی ہے، اگر تو مجھے اولاد نہ بھی دے گا تب بھی میرے بعد اپنے دین کا انتظام ضرور کرے گا۔ (قرطبی)"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت 90) ➊ { فَاسْتَجَبْنَا لَهٗ وَ وَهَبْنَا لَهٗ يَحْيٰى وَ اَصْلَحْنَا لَهٗ زَوْجَهٗ:} بیوی کو درست کرنے سے مراد ان کا بانجھ پن دور کر کے انھیں اولاد کے قابل بنانا ہے۔ یہاں ایک سوال ہے کہ بظاہر ترتیب تو یہ ہونی چاہیے کہ ہم نے اس کی دعا قبول کی اور اس کے لیے اس کی بیوی کو درست کر دیا اور اسے یحییٰ عطا کیا، کیونکہ بیوی درست ہونے کے بعد بچے کا مرحلہ آتا ہے۔ جواب اس کا یہ ہے کہ واؤ ہمیشہ ترتیب کے لیے نہیں ہوتی۔ یہاں یحییٰ علیہ السلام عطا کرنے کا ذکر پہلے اس لیے ہے کہ دعا بیٹا عطا کرنے کی تھی، اس کی قبولیت کے بیان کے لیے پہلے یحییٰ عطا کرنے کا ذکر ہوا، پھر اس سوال کا جواب دے دیا گیا کہ اتنی بوڑھی اور بانجھ بیوی سے بیٹا کیسے پیدا ہو گیا؟ ¤ ➋ { اِنَّهُمْ كَانُوْا يُسٰرِعُوْنَ فِي الْخَيْرٰتِ :} یعنی زکریا علیہ السلام ، ان کی بیوی اور یحییٰ علیہ السلام نیکیوں میں جلدی کرتے اور رغبت اور خوف کے ساتھ ہمیں پکارتے تھے اور صرف ہمارے لیے عاجزی کرنے والے تھے۔ یہ بھی مراد ہو سکتا ہے کہ ان تمام انبیاء میں، جن کا ذکر اس سے پہلے گزرا، یہ تینوں صفات پائی جاتی تھیں۔ معلوم ہوا دعا کی قبولیت کے لیے یہ تینوں باتیں بہت اہمیت رکھتی ہیں۔ یہ بھی معلوم ہوا کہ ان بڑے لوگوں میں یہ بات نہ تھی کہ شفا بخش سکیں یا مشکل کشائی کر سکیں یا اولاد عطا کر دیں، بلکہ وہ نیکیوں میں جلدی کرتے تھے اور خوف اور طمع کے ساتھ اللہ تعالیٰ ہی سے دعا کرتے تھے اور اللہ تعالیٰ بندگی میں ان کے عظیم مرتبے کے پیش نظر معجزانہ طریقے سے ان کی دعا قبول فرماتا تھا۔ ¤ ➌ {وَ يَدْعُوْنَنَا رَغَبًا وَّ رَهَبًا :} یعنی وہ ہمیں اس طرح پکارتے تھے کہ ایک طرف انھیں ہمارے اجر کی توقع رہتی تھی اور دوسری طرف ہمارے عذاب کا ڈر اور یہی بندگی کا اعلیٰ ترین مقام ہے، جیسا کہ فرمایا : «{ يَدْعُوْنَ رَبَّهُمْ خَوْفًا وَّ طَمَعًا }» [ السجدۃ : ۱۶ ] ’’وہ اپنے رب کو ڈرتے ہوئے اور طمع کرتے ہوئے پکارتے ہیں۔‘‘ بعض صوفی حضرات کہا کرتے ہیں کہ جنت کے لالچ یا جہنم کے خوف سے اللہ تعالیٰ کی عبادت کرنا تو سودے بازی ہے، عبادت تو بس اللہ کی رضا کے لیے کرنی چاہیے، اس آیت میں ان کا رد ہے، انبیائے کرام اللہ کے قرب کے سب سے اعلیٰ مرتبے پر فائز ہوتے ہیں، ان کے متعلق فرمایا : «{ يَدْعُوْنَنَا رَغَبًا وَّ رَهَبًا }» یعنی وہ ہمیں اس طرح پکارتے تھے کہ ایک طرف انھیں ہمارے اجر کی توقع رہتی تھی اور دوسری طرف ہمارے عذاب کا ڈر اور یہی بندگی کا اعلیٰ ترین مقام ہے۔ جاہل صوفیوں کو علم نہیں کہ جنت اللہ کی رضا سے ملے گی اور جہنم اللہ کے غضب کا نتیجہ ہے۔ رہی سودے بازی، تو وہ خود اللہ تعالیٰ نے بندوں سے کی ہے، فرمایا : «{ اِنَّ اللّٰهَ اشْتَرٰى مِنَ الْمُؤْمِنِيْنَ اَنْفُسسَهُمْ وَ اَمْوَالَهُمْ بِاَنَّ لَهُمُ الْجَنَّةَ }» [ التوبۃ : ۱۱۱ ] ’’بے شک اللہ نے مومنوں سے ان کی جانیں اور ان کے اموال خرید لیے ہیں، اس کے بدلے کہ ان کے لیے جنت ہے۔‘‘"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت 91) ➊ {وَ الَّتِيْۤ اَحْصَنَتْ فَرْجَهَا :} یعنی اس خاتون کا بھی ذکر کر جس پر ناپاک لوگ (یہودی) تہمتیں لگاتے ہیں، حالانکہ اس نے اپنی شرم گاہ کو حرام سے محفوظ رکھا، بلکہ عبادت میں ایسی مشغول رہی کہ حلال سے بھی محفوظ رکھا، جیسا کہ فرمایا : «{ لَمْ يَمْسَسْنِيْ بَشَرٌ }» [ آل عمران : ۴۷ ] ’’حالانکہ کسی بشر نے مجھے ہاتھ نہیں لگایا۔‘‘ اللہ تعالیٰ نے اس کی نیک شہرت کے اظہار کے لیے اس کا نام نہیں لیا، کیونکہ سب جانتے ہیں اس سے مراد مریم بنت عمران علیھا السلام ہیں۔ ¤ ➋ {فَنَفَخْنَا فِيْهَا مِنْ رُّوْحِنَا :} مراد عیسیٰ علیہ السلام کی روح ہے جو اللہ تعالیٰ کی مخلوق ہے اور اس کے حکم سے جبریل علیہ السلام نے پھونکی تھی۔ لیکن اللہ تعالیٰ نے عیسیٰ علیہ السلام کو عزت و شرف بخشنے کے لیے اسے اپنی روح قرار دیا اور جبریل علیہ السلام کے پھونکنے کو اپنا پھونکنا قرار دیا، جیسے {’’بيت الله‘‘} اور {’’ناقة الله‘‘} میں کعبہ کو اپنا گھر اور صالح علیہ السلام کی اونٹنی کو اپنی اونٹنی قرار دیا۔ شیخ ثناء اللہ امر تسری رحمہ اللہ اپنی تفسیر میں لکھتے ہیں : ’’عیسائی لوگ اس آیت اور اس قسم کی اور آیات سے عموماً دلیل لایا کرتے ہیں کہ حضرت مسیح (معاذ اللہ) خدا تھا، کیونکہ اس کو ’’روح اللہ‘‘ کہا گیا ہے، مگر وہ قرآن شریف کے محاورے کو غور سے نہیں دیکھتے کہ اس قسم کی اضافات سے مطلب کیا ہوتا ہے؟ سورۂ سجدہ میں عام انسانوں کے لیے بھی یہی اضافت روح کی اللہ کی طرف آئی ہے، چنانچہ ارشاد ہے : «{ وَ بَدَاَ خَلْقَ الْاِنْسَانِ مِنْ طِيْنٍ (7) ثُمَّ جَعَلَ نَسْلَهٗ مِنْ سُلٰلَةٍ مِّنْ مَّآءٍ مَّهِيْنٍ (8) ثُمَّ سَوّٰىهُ وَ نَفَخَ فِيْهِ مِنْ رُّوْحِهٖ }» [ السجدۃ : ۷ تا ۹ ] ’’(یعنی اللہ نے) انسان کی پیدائش تھوڑی سی مٹی سے شروع کی، پھر اس کی نسل ایک حقیر پانی کے خلاصے سے بنائی، پھر اسے درست کیا اور اس میں اپنی ایک روح پھونکی۔‘‘ اس جگہ عام انسانی پیدائش کی ابتدا اور سلسلے کا ذکر ہے۔ پس اگر آیت زیر تفسیر سے مسیح علیہ السلام کی الوہیت (خدا ہونا) ثابت ہوتی ہو تو اس قسم کی آیات سے تمام انسانوں کی الوہیت ثابت ہو گی، پھر اگر مسیح بھی ایسے ہی خدا اور الٰہ تھے جیسے کہ سب انسان ہیں تو خیر اس کے ماننے میں کسی کو کلام نہیں۔ پس آیت موصوفہ کے معنی وہی ہیں جو ہم نے لکھے ہیں (کہ وہ روح مخلوق تھی) ({فَافْهَمْ})۔‘‘ ¤ ➌ {وَ جَعَلْنٰهَا وَ ابْنَهَاۤ اٰيَةً لِّلْعٰلَمِيْنَ :} مریم اور مسیح علیھما السلام کا جہانوں کے لیے اللہ تعالیٰ کی عظیم نشانی ہونا سورۂ آل عمران (۳۶ تا ۶۳)، نساء (۱۵۶ تا ۱۵۹، ۱۷۱) اور مائدہ (۴۶، ۱۱۰ تا ۱۲۰) میں تفصیل سے بیان ہوا ہے۔"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت 92) { اِنَّ هٰذِهٖۤ اُمَّتُكُمْ اُمَّةً وَّاحِدَةً …:} بہت سے مفسرین نے یہاں امت سے مراد دین لیا ہے، جیسا کہ اللہ تعالیٰ نے کفار کا قول نقل فرمایا : «{ اِنَّا وَجَدْنَاۤ اٰبَآءَنَا عَلٰۤى اُمَّةٍ }» [ الزخرف : ۲۲ ] ’’بے شک ہم نے اپنے باپ دادا کو ایک امت (یعنی ایک دین) پر چلتے پایا۔‘‘ یعنی تمھارا دین اور ملت ایک ہی ہے اور وہ ہے دین توحید، اور {’’ هٰذِهٖۤ ‘‘} سے مراد اس سے پہلے مذکور انبیاء، نوح، ابراہیم، اسحاق، یعقوب، لوط، داؤد، سلیمان، ایوب، اسماعیل، ادریس، ذوالکفل، یونس، زکریا، مسیح ابن مریم علیھم السلام ہیں کہ سب کا ایک ہی دین تھا اور سب توحید پر قائم تھے۔ کسی اور کو معبود، مشکل کُشا، شفا دینے والا، بگڑی بنانے والا یا اولاد عطا کرنے والا نہیں سمجھتے تھے، یہ سب لوگ ایک ہی دین پر تھے کہ میں تمھارا رب ہوں، سو میری ہی عبادت کرو۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْأَنْبِيَاءُ إِخْوَةٌ لِعَلاَّتٍ أُمَّهَاتُهُمْ شَتّٰی وَدِيْنُهُمْ وَاحِدٌ ] [ بخاري، أحادیث الأنبیاء، باب «واذکر في الکتاب مریم…» : ۳۴۴۳۔ مسلم : 2365/145] ’’انبیاء علاتی بھائی ہیں، جن کی مائیں مختلف ہیں اور ان کا دین ایک ہے۔‘‘ امت کا معنی جماعت بھی ہے، مگر ایسی جماعت جس کے لوگوں کے درمیان انھیں اکٹھا رکھنے والی کوئی چیز ہو، جیسا کہ فرمایا : «{ وَ لْتَكُنْ مِّنْكُمْ اُمَّةٌ يَّدْعُوْنَ اِلَى الْخَيْرِ }» [ آل عمران : ۱۰۴ ] ’’اور لازم ہے کہ تمھاری صورت میں ایک جماعت ہو جو نیکی کی طرف دعوت دیں۔‘‘ یعنی یہ تمام انبیاء ایک ہی جماعت تھے جن کا رب ایک اور دین ایک تھا۔"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت 93) ➊ {وَ تَقَطَّعُوْۤا اَمْرَهُمْ بَيْنَهُمْ:’’ تَقَطَّعُوْۤا ‘‘} باب تفعل سے ہے جو لازم ہے۔ اصل میں {’’ تَقَطَّعُوْا فِي أَمْرِهِمْ‘‘} تھا، یعنی وہ اپنے دین کے معاملے میں آپس میں ٹکڑے ٹکڑے ہو گئے۔ {’’فِيْ‘‘ } کو حذف کرنے کی وجہ سے {’’ اَمْرَهُمْ ‘‘} پر نصب آ گیا۔ بعض نے فرمایا کہ یہاں {’’ تَقَطَّعُوْۤا ‘‘} باب تفعیل ({قَطَّعُوْا}) کے معنی میں ہے جو متعدی ہے، یعنی انھوں نے اپنے دین کو آپس میں ٹکڑے ٹکڑے کر ڈالا۔ اس معنی کی بھی گنجائش ہے، مگر پہلا معنی راجح ہے۔ یعنی سب کا دین ایک اور رب ایک ہے، اس لیے لازم تھا کہ سب ایک جماعت رہتے اور اپنے نبی کی کتاب اورر سنت کو مضبوطی سے تھامے رکھتے، مگر وہ سب کچھ جانتے ہوئے محض باہمی ضد اور عناد کی وجہ سے دین کے بارے میں کئی فرقوں میں بٹ گئے۔ دیکھیے سورۂ بقرہ (۲۱۳) اور سورۂ شوریٰ (۱۳، ۱۴) ہماری امت کا بھی یہی حال ہوا کہ وہ کتاب و سنت پر متحد ہونے کے بجائے فقہ و تصوف کے الگ الگ پیشوا بنا کر بہت سے فرقوں میں بٹ گئے، جن میں سے ہر فرقہ اپنے آپ ہی کو حق پر قرار دیتا ہے۔ سیاسی طور پر خلافت اسلامیہ کو ختم کر کے چھپن (۵۶) خود مختار ملکوں میں تقسیم ہو گئے، جن میں سے ایک بھی حقیقت میں خود مختار نہیں ہے، نتیجہ سب کے سامنے ہے۔ ¤ ➋ اس سے پہلے اللہ تعالیٰ نے اہل کتاب کو مخاطب کرکے فرمایا تھا : «{ اِنَّ هٰذِهٖۤ اُمَّتُكُمْ اُمَّةً وَّاحِدَةً وَّ اَنَا رَبُّكُمْ فَاعْبُدُوْنِ }» یعنی یہ تمھاری امت ایک ہی امت ہے اور میں تمھارا رب ہوں، سو میری ہی عبادت کرو۔ اب اس آیت میں انھیں مخاطب کرنے کے بجائے ان کا ذکر غائب کے صیغے کے ساتھ کیا اور {’’ تَقَطَّعْتُمْ أَمْرَكُمْ بَيْنَكُمْ ‘‘} (تم اپنے دین کے معاملے میں آپس میں ٹکڑے ٹکڑے ہو گئے) کے بجائے فرمایا : {’’ وَ تَقَطَّعُوْۤا اَمْرَهُمْ بَيْنَهُمْ ‘‘} کہ وہ اپنے معاملے میں آپس میں ٹکڑے ٹکڑے ہو گئے۔ یہ مخاطب سے غائب کی طرف التفات ہے، گویا اللہ تعالیٰ نے انھیں مخاطب کرنے کے بعد ان کی گروہ بندی کی وجہ سے انھیں اس قابل نہیں سمجھا کہ ان سے خطاب کیا جائے، اس لیے ان کا ذکر غائب کے صیغے سے فرمایا۔ ¤ ➌ { كُلٌّ اِلَيْنَا رٰجِعُوْنَ :} یعنی یہ لوگ جتنے گروہ چاہیں بنا لیں، آخر سب نے ہمارے پاس آنا ہے، پھر ہم سب کا فیصلہ کریں گے، فرمایا : «{ قُلِ اللّٰهُمَّ فَاطِرَ السَّمٰوٰتِ وَ الْاَرْضِ عٰلِمَ الْغَيْبِ وَ الشَّهَادَةِ اَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْ مَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ }» [الزمر : ۴۶ ] ’’تو کہہ اے اللہ! آسمانوں اور زمین کو پیدا کرنے والے! ہر چھپی اور کھلی کو جاننے والے! تو ہی اپنے بندوں کے درمیان اس چیز کا فیصلہ کرے گا جس میں وہ اختلاف کیا کرتے تھے۔‘‘"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت 94) ➊ { فَمَنْ يَّعْمَلْ مِنَ الصّٰلِحٰتِ … :} یعنی ان مختلف گروہوں میں سے جو بھی اس کے مطابق کچھ عمل کرے گا جو اللہ اور اس کے رسول نے حکم دیا ہے، جب کہ وہ اللہ تعالیٰ پر، اس کی توحید پر، اس کے فرشتوں پر، اس کے رسولوں پر، اس کی کتابوں پر، خیر و شر تقدیر پر اور یوم آخرت پر ایمان رکھتا اور اللہ کے ساتھ کسی کو شریک نہ بناتا ہو، تو اس کی کوشش کی کوئی ناقدری نہ ہو گی اور اللہ تعالیٰ اس کے اعمال کو اس کے نامۂ اعمال میں درج فرمائے گا۔ ¤ ➋ {’’ مِنَ الصّٰلِحٰتِ ‘‘} میں {’’ مِنْ ‘‘} بعض کے معنی میں ہے۔ (ابوالسعود) یعنی جو شخص صالح اعمال میں سے کچھ اعمال کرے، اس لیے ترجمہ کیا گیا ہے ’’پس جو شخص کچھ نیک اعمال کرے۔‘‘ اللہ تعالیٰ کی کریمی دیکھیے کہ ایمان کے بعد بعض اعمال صالحہ کی بھی قدر دانی ہو رہی ہے۔"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت 95) {وَ حَرٰمٌ عَلٰى قَرْيَةٍ اَهْلَكْنٰهَاۤ … : } اس آیت کے تین معنی ہو سکتے ہیں اور تینوں درست ہیں، یہ اللہ تعالیٰ کے کلام کا اعجاز ہے کہ ایک آیت کئی معانی کی گنجائش رکھتی ہے۔ پہلے معنی کی صورت میں {’’ حَرٰمٌ ‘‘} کا معنی ’’ممنوع‘‘ اور ’’ناممکن‘‘ ہے اور {’’ لَا يَرْجِعُوْنَ ‘‘} میں {’’ لَا ‘‘} کا حرف زائد ہے، نفی کا معنی نہیں دے رہا، مگر بے فائدہ نہیں بلکہ{ ’’ حَرٰمٌ ‘‘ } کے معنی میں جو نفی پائی جاتی ہے اس میں زور پیدا کرنے کے لیے ہے، جیسا کہ اللہ تعالیٰ نے ایک مقام پر فرمایا : « مَا مَنَعَكَ اَنْ تَسْجُدَ » [ صٓ : ۷۵ ] ’’تجھے کس چیز نے روکا کہ تو سجدہ کرے؟‘‘ دوسری جگہ فرمایا : «{ مَا مَنَعَكَ اَلَّا تَسْجُدَ }» [ الأعراف : ۱۲ ] ’’تجھے کس چیز نے روکا کہ تو سجدہ نہیں کرتا؟‘‘ اس سے ظاہر ہے کہ {’’ اَلَّا تَسْجُدَ ‘‘} میں {’’ لاَ ‘‘} زائد ہے اور {’’ مَنَعَكَ ‘‘} کے معنی میں زور پیدا کرنے کے لیے ہے۔ اس معنی کے اعتبار سے آیت کا ترجمہ یہ ہو گا کہ جس بستی کو ہم ہلاک کر دیں ناممکن ہے کہ وہ (دنیا میں) واپس لوٹیں، جیسا کہ فرمایا : «{ اَلَمْ يَرَوْا كَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنَ الْقُرُوْنِ اَنَّهُمْ اِلَيْهِمْ لَا يَرْجِعُوْنَ }» [ یٰسٓ : ۳۱ ] ’’کیا انھوں نے نہیں دیکھا، ہم نے ان سے پہلے کتنے زمانوں کے لوگ ہلاک کر دیے کہ وہ ان کی طرف پلٹ کر نہیں آتے۔‘‘ دوسرے معنی کی صورت میں {’’ حَرٰمٌ ‘‘ } کا معنی ’’ممنوع‘‘ اور ’’ناممکن‘‘ ہی ہو گا، مگر {’’ لَا يَرْجِعُوْنَ ‘‘} میں {’’ لَا ‘‘} نفی کے معنی میں ہو گا جو اس کا اصل ہے۔ اس صورت میں آیت کا معنی یہ ہو گا کہ جس بستی کو ہم ہلاک کر دیں، ناممکن ہے کہ وہ (قیامت کے دن ہماری طرف) واپس نہ آئیں، بلکہ وہ ضرور ہماری طرف واپس لوٹیں گے۔ تیسرا معنی یہ ہے کہ یہاں {’’ حَرٰمٌ ‘‘} کا لفظ لازم اور واجب کے معنی میں ہے، جیسا کہ ابن کثیر نے ابن عباس رضی اللہ عنھما سے نقل فرمایا ہے۔ مزید دیکھیے فتح الباری (۱۱؍۵۰۳) اس صورت میں معنی یہ ہے کہ جس بستی کو ہم ہلاک کر دیں لازم ہے کہ وہ (دنیا میں) واپس نہیں لوٹیں گے۔ ابن کثیر رحمہ اللہ نے اس معنی کو ترجیح دی ہے۔ شاہ رفیع الدین اور شاہ عبد القادر رحمہما اللہ نے بھی اسی مفہوم کو اختیار فرمایا ہے۔ اگر غور کیا جائے تو تینوں معنوں کا نتیجہ ایک ہی ہے، البتہ اس میں سے وہ لوگ مستثنیٰ ہوں گے جنھیں اللہ تعالیٰ نے مرنے کے بعد زندہ کرنے کا ذکر فرمایا ہے، مثلاً بنی اسرائیل کا مقتول جو گائے کا کوئی حصہ مارنے سے زندہ ہوا وغیرہ۔"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت 96) {حَتّٰۤى اِذَا فُتِحَتْ يَاْجُوْجُ وَ مَاْجُوْجُ …: ’’ حَدَبٍ ‘‘} زمین کا ابھرا ہوا حصصہ، اونچی جگہ، جیسے کسی کی پیٹھ ابھری ہوئی ہو تو اسے {’’حَدَبَةُ الظَّهْرِ‘‘} کہتے ہیں۔ {’’نَسَلَ‘‘} (ض، ن) قریب قریب قدم رکھ کر نیچے کی طرف تیز دوڑنا، یعنی ہلاک ہونے والی بستیوں کے لوگوں کا دوبارہ زندہ ہونا اس وقت تک ناممکن رہے گا جب تک قیامت قائم نہ ہو، جس کی بالکل قریب نشانیوں میں سے ایک یاجوج ماجوج کا نکلنا بھی ہے۔ ان کے نکلنے کے بعد بہت جلد قیامت قائم ہو جائے گی۔ حذیفہ بن اسید غفاری رضی اللہ عنہ بیان کرتے ہیں : ’’ایک دفعہ ہم آپس میں قیامت کے بارے میں باتیں کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے اور فرمایا : ’’تم آپس میں کیا ذکر کر رہے ہو۔‘‘ انھوں نے کہا : ’’ہم قیامت کا ذکر کر رہے ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّهَا لَنْ تَقُوْمَ حَتّٰی تَرَوْنَ قَبْلَهَا عَشْرَ آيَاتٍ ، فَذَكَرَ الدُّخَانَ وَالدَّجَّالَ، وَالدَّابَّةَ، وَطُلُوْعَ الشَّمْسِ مِنْ مَّغْرِبِهَا، وَنُزُوْلَ عِيْسَی ابْنِ مَرْيَمَ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ ، وَيَأْجُوْجَ وَمَأْجُوْجَ، وَثَلاَثَةَ خُسُوْفٍ : خَسْفٌ بِالْمَشْرِقِ، وَخَسْفٌ بِالْمَغْرِبِ، وَخَسْفٌ بِجَزِييْرَةِ الْعَرَبِ، وَآخِرُ ذٰلِكَ نَارٌ تَخْرُجُ مِنَ الْييَمَنِ تَطْرُدُ النَّاسَ إِلٰی مَحْشَرِهِمْ ] [ مسلم، الفتن، باب في الآیات التی تکون قبل الساعۃ : ۲۹۰۱ ] ’’قیامت اس وقت تک قائم نہیں ہو گی جب تک تم اس سے پہلے دس نشانیاں نہ دیکھ لو۔‘‘ پھر آپ نے دخان (دھوئیں)، دجال، دابۃ الارض، سورج کے مغرب سے طلوع ہونے، عیسیٰ علیہ السلام کے نزول، یاجوج ماجوج اور تین خسوف (زمین میں دھنس جا نے) کا ذکر فرمایا۔ ایک خسف مشرق میں، ایک خسف مغرب میں اور ایک خسف جزیرۂ عرب میں ہو گا اور ان کے آخر میں ایک آگ یمن سے نکلے گی جو لوگوں کو ان کے حشر کی جگہ کی طرف ہانکے گی۔‘‘ یاجوج ماجوج کے کھولے جانے سے مراد قیامت کے قریب اس دیوار کا ٹوٹنا ہے جو ذوالقرنین نے لوگوں کو یاجوج ماجوج کی غارت گری سے بچانے کے لیے بنائی تھی۔ اس وقت ان کے نکلنے کا نقشہ بیان ہوا ہے کہ وہ اتنی کثرت اور تیزی سے نکلیں گے کہ ہر بلندی و پستی پر چھا جائیں گے، کسی میں ان کے مقابلے کی طاقت نہ ہو گی۔ [ مسلم، الفتن، باب ذکر الدجال : ۲۹۳۷ ] یاجوج ماجوج کی تفصیل سورۂ کہف (۹۳ تا ۹۹) کی تفسیر میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت 97) ➊ {وَ اقْتَرَبَ الْوَعْدُ الْحَقُّ : ’’ اقْتَرَبَ ‘‘ ’’قَرِبَ‘‘ } میں ہمزہ اور تاء کے اضافے سے معنی میں اضافہ ہو گیا، یعنی بہت یا بالکل قریب ہو گیا۔ ’’سچے وعدے‘‘ سے مراد قیامت ہے۔ یاجوج ماجوج کی ہلاکت کے بعد مسیح علیہ السلام مسلمانوں کو لے کر پہاڑ سے اتریں گے، پھر اللہ تعالیٰ مسلمانوں کو زمین کی بے شمار برکتیں عطا فرمائے گا۔ صحیح مسلم (۲۹۳۷) میں ہے کہ وہ اسی حال میں ہوں گے کہ اللہ تعالیٰ ایک طیب ہوا ان کی بغلوں کے نیچے بھیجے گا، جو ہر مومن کی روح قبض کر لے گی اور بدترین لوگ باقی رہ جائیں گے، جو شہوت رانی کے لیے گدھوں کی طرح ایک دوسرے پر چڑھیں گے، انھی پر قیامت قائم ہو گی۔ عبد اللہ بن عمرو رضی اللہ عنھما بیان کرتے ہیں : [ لاَ تَقُوْمُ السَّاعَةُ إِلَّا عَلٰی شِرَارِ الْخَلْقِ هُمْ شَرٌّ مِنْ أَهْلِ الْجَاهِلِيَّةِ لاَ يَدْعُوْنَ اللّٰهَ بِشَيْءٍ إِلَّا رَدَّهُ عَلَيْهِمْ ] [ مسلم، الإمارۃ، باب قولہ صلی اللہ علیہ وسلم : لا تزال طائفۃ من أمتی… : ۱۹۲۴ ] ’’قیامت ان لوگوں پر قائم ہو گی جو اللہ کی مخلوق میں سے بدترین لوگ ہوں گے، وہ جاہلیت والوں سے بھی بدتر ہوں گے اور اللہ تعالیٰ سے جو بھی مانگیں گے اللہ تعالیٰ انھیں وہ چیز دے دے  گا۔‘‘ ¤ ➋ { فَاِذَا هِيَ شَاخِصَةٌ اَبْصَارُ الَّذِيْنَ كَفَرُوْا : ’’شُخُوْصٌ‘‘} کا معنی حیرت یا خوف سے کھلا رہ جانا ہے، یعنی قیامت کا منظر دیکھ کر اس وقت تمام موجود لوگوں کی، جو بدترین کافر ہوں گے، آنکھیں کھلی رہ جائیں گی۔ اس کی ہم معنی آیت : «{ وَ لَا تَحْسَبَنَّ اللّٰهَ غَافِلًا عَمَّا يَعْمَلُ الظّٰلِمُوْنَ اِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيْهِ الْاَبْصَارُ (32) مُهْطِعِيْنَ مُقْنِعِيْ رُءُوْسِهِمْ لَا يَرْتَدُّ اِلَيْهِمْ طَرْفُهُمْ وَ اَفْـِٕدَتُهُمْ هَوَآءٌ}» [ إبراھیم : ۴۲، ۴۳ ] ’’اور تو اللہ کو ہرگز اس سے غافل گمان نہ کر جو ظالم لوگ کر رہے ہیں، وہ تو انھیں صرف اس دن کے لیے مہلت دے رہا ہے جس میں آنکھیں کھلی رہ جائیں گی۔ اس حال میں کہ تیز دوڑنے والے، اپنے سروں کو اوپر اٹھانے والے ہوں گے، ان کی نگاہ ان کی طرف نہیں لوٹے گی اور ان کے دل خالی ہوں گے۔‘‘ ¤ ➌ {يٰوَيْلَنَا قَدْ كُنَّا فِيْ غَفْلَةٍ مِّنْ هٰذَا بَلْ كُنَّا ظٰلِمِيْنَ :} اس وقت وہ اپنی بربادی اور ہلاکت کو آواز دیں گے اور پہلے غفلت کا عذر کریں گے، پھر خود ہی صاف اعتراف کریں گے کہ انبیاء نے ہمیں اس دن سے خبردار کیا تھا، اس لیے ہم غافل نہیں بلکہ اپنے آپ پر ظلم کرنے والے تھے۔ دیکھیے سورۂ ملک (۵ تا ۱۱)۔"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت 98) ➊ { اِنَّكُمْ وَ مَا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ حَصَبُ جَهَنَّمَ :} یعنی اس وقت ان کے اعتراف جرم اور توبہ کا انھیں کچھ فائدہ نہ ہو گا (سورۂ مومن : ۸۵) بلکہ کہا جائے گا کہ تم اور جن چیزوں کی تم عبادت کرتے تھے، سب جہنم کا ایندھن ہو۔ اس میں ان کے بت بھی شامل ہیں اور وہ تمام انسان یا جن بھی جو اپنی عبادت کروا کر خوش ہوتے تھے، اللہ تعالیٰ نے ان سب کو جہنم کا ایندھن قرار دیا۔ بتوں کو آگ میں پھینکنے کا مقصد ان مشرکین کو ذلیل کرنا ہے کہ اپنے خداؤں کا حال دیکھ لو، جیسا کہ فرمایا : «{ وَ قُوْدُهَا النَّاسُ وَ الْحِجَارَةُ }» [ البقرۃ : ۲۴ ]کہ جہنم کا ایندھن انسان اور پتھر ہیں۔ {’’ مَا ‘‘} کا لفظ عموماً غیر ذوی العقول کے لیے استعمال ہوتا ہے، گویا اپنی عبادت پر خوش ہونے والے انسانوں اور جنوں کو غیر ذوی العقول قرار دیا گیا۔ اگر {’’ مَا ‘‘} کو عاقل و غیر عاقل سب کے لیے عام مانا جائے، جیسا کہ بعض اوقات استعمال ہوتا ہے، تب بھی اللہ کے پیغمبر اور مقبول بندے اس میں شامل نہیں ہوں گے، کیونکہ آیت (۱۰۱) میں تمام مومنوں کے لیے جہنم سے دور رکھے جانے کی بشارت آ رہی ہے۔ ¤ ➋ { اَنْتُمْ لَهَا وٰرِدُوْنَ: ’’ لَهَا ‘‘} کا لفظ {’’ وٰرِدُوْنَ ‘‘} سے پہلے آنے سے حصر پید اہو گیا، اس لیے ترجمہ ’’اس میں‘‘ کے بجائے ’’اسی میں‘‘ داخل ہونے والے ہو گا۔ اس جملے کا فائدہ یہ ہے کہ جہنم کا ایندھن بننے کے بعد یہ مت سمجھو کہ موحدین کی طرح اس سے نکل کر جنت میں چلے جاؤ گے، نہیں! بلکہ تم اسی میں داخل رہو گے۔ اس کے علاوہ {’’ وٰرِدُوْنَ ‘‘} کو بعد میں لانے سے دوسری آیات کے فواصل (آخری حروف) کے ساتھ موافقت بھی ہو گئی۔"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت 99) {لَوْ كَانَ هٰۤؤُلَآءِ اٰلِهَةً مَّا وَرَدُوْهَا … : ’’وَرَدُوْا‘‘} کی ضمیر پوجنے والوں اور ان کے بنائے ہوئے معبودوں سب کی طرف جاتی ہے، اس لیے اس آیت سے دو باتیں ثابت ہوتی ہیں، ایک یہ کہ اگر لات، منات، عزیٰ یا شیاطین وغیرہ معبود ہوتے تو ان کو پوجنے والے جہنم میں داخل نہ ہوتے، بلکہ ان کے معبود ان کو بچا لیتے۔ دوسری یہ کہ اگر یہ معبود ہوتے تو کم از کم خود ہی جہنم میں داخل نہ ہوتے، مگر جب {’’ كُلٌّ فِيْهَا خٰلِدُوْنَ ‘‘} یعنی پوجنے والے اور جنھیں پوجا گیا سب جہنم کا ایندھن ہیں تو ان کے بنائے ہوئے خدا معبود کیسے ہو گئے؟ اس آیت پر مشرکین کے اعتراض کی تفصیل کے لیے دیکھیے سورۂ زخرف (۵۷ تا ۵۹)۔"
    },
    {
      "ayah": 100,
      "tafsir": "(آیت 100) ➊ {لَهُمْ فِيْهَا زَفِيْرٌ : ’’ زَفِيْرٌ ‘‘} کے معنی کے لیے دیکھیے سورۂ ہود (۱۰۶)۔ ¤ ➋ { وَ هُمْ فِيْهَا لَا يَسْمَعُوْنَ:} اس کی ایک تفسیر یہ ہے کہ وہ اتنی اونچی آواز سے گدھے کی طرح رینکیں گے کہ اپنے چیخ پکار کے شور میں کوئی بات نہیں سنیں گے۔ دوسری تفسیر عبد اللہ بن مسعود رضی اللہ عنہ نے فرمائی کہ جب وہ لوگ باقی رہ جائیں گے جنھیں ہمیشہ آگ میں رکھا جائے گا، تو انھیں آگ کے تابوتوں میں ڈال دیا جائے گا، جن میں آگ کی میخیں ہوں گی، تو ان میں سے کسی کو نظر نہیں آئے گا کہ اس کے سوا کسی کو عذاب ہو رہا ہے۔ پھر عبد اللہ رضی اللہ عنہ نے یہ آیت پڑھی : «{ لَهُمْ فِيْهَا زَفِيْرٌ وَّ هُمْ فِيْهَا لَا يَسْمَعُوْنَ }» ابن کثیر بحوالہ ابن ابی حاتم، دکتور حکمت بن بشیر نے اس کی سند کو حسن کہا ہے۔گویا آگ کے عذاب کے ساتھ تنہائی کا شدید عذاب مزید ہوگا کہ نہ کسی کو دیکھیں گے اور نہ کوئی آواز سنیں گے۔"
    },
    {
      "ayah": 101,
      "tafsir": "(آیت 101) { اِنَّ الَّذِيْنَ سَبَقَتْ لَهُمْ مِّنَّا الْحُسْنٰۤى …:’’ الْحُسْنٰۤى ‘‘ ’’اَلْأَحْسَنُ‘‘} کی مؤنث ہے، معنی ہے سب سے اچھی چیز۔ مراد وہ سعادت اور خوش قسمتی ہے جو اللہ تعالیٰ نے پہلے ہی ان کی تقدیر میں لکھ دی ہے۔ اللہ تعالیٰ نے شرک کی وجہ سے جہنم میں جانے والوں کے ذکر کے بعد اللہ اور اس کے رسول پر ایمان رکھنے والوں کا ذکر فرمایا۔ یہ وہ لوگ ہیں جن کے لیے اللہ تعالیٰ نے پہلے ہی سعادت اورنیک اعمال کی توفیق یا معافی مقدر کر دی ہے اور وہ جہنم سے دور رکھے جائیں گے۔ بعض مفسرین نے اس آیت سے مراد وہ صالحین، انبیاء اور فرشتے لیے ہیں جن کی مشرکین عبادت کرتے تھے۔ ان کے مطابق یہ آیت مشرکین کے جواب میں اتری ہے جنھوں نے اعتراض کیا تھا کہ اگر اللہ کے علاووہ جن کی عبادت کی گئی ہے وہ جہنم میں جائیں گے تو لوگوں نے عبادت فرشتوں اور پیغمبروں کی بھی کی ہے۔ جواب یہ دیا گیا کہ یہ لوگ جہنم سے دور رکھے جائیں گے۔ اگرچہ اس آیت میں اس اعتراض کا جواب بھی موجود ہے، تاہم آیت کے الفاظ عام ہیں، اس لیے اس میں فرشتوں، پیغمبروں اور صالحین کے ساتھ تمام سعادت مند مومن بھی شامل ہیں اور یہ اللہ تعالیٰ کا خاص اسلوب ہے کہ وہ جنت و جہنم اور نیک و بد دونوں کا ذکر ساتھ ساتھ فرماتا ہے۔ چنانچہ اللہ تعالیٰ نے سعادت مند لوگوں کو عطا ہونے والی پانچ نعمتیں ذکر فرمائی ہیں، جن میں سے پہلی یہ ہے کہ وہ جہنم سے دور رکھے جائیں گے۔"
    },
    {
      "ayah": 102,
      "tafsir": "(آیت 102) ➊ { لَا يَسْمَعُوْنَ حَسِيْسَهَا :} یہ دوسری نعمت ہے کہ جہنم کی ہلکی سے ہلکی محسو س ہونے والی آواز بھی ان کے کانوں میں نہیں آئے گی کہ انھیں کسی طرح بھی تکلیف پہنچ سکے۔ مراد جنت میں جانے کے بعد ہے۔ (قرطبی) ¤ ➋ { وَ هُمْ فِيْ مَا اشْتَهَتْ اَنْفُسُهُمْ خٰلِدُوْنَ :} یہ تیسری نعمت ہے، یعنی اہل جنت کے دل کی ہر خواہش نہ صرف یہ کہ پوری ہو گی (حم السجدہ : ۳۰ تا ۳۲) بلکہ ان کی من پسند ہر نعمت دائمی اور ابدی بھی ہو گی، جس میں وہ ہمیشہ رہیں گے۔"
    },
    {
      "ayah": 103,
      "tafsir": "(آیت 103) ➊ {لَا يَحْزُنُهُمُ الْفَزَعُ الْاَكْبَرُ :} یہ چوتھی نعمت ہے کہ پہلے کوئی گھبراہٹ ہو تو ہو، آگ سے نجات اور جنت میں داخلے کے بعد وہ ہر گھبراہٹ سے محفوظ رہیں گے، حتیٰ کہ سب سے بڑی گھبراہٹ بھی انھیں غمگین نہیں کرے گی، پھر چھوٹی موٹی گھبراہٹوں کی کیا مجال ہے کہ انھیں غم زدہ کر سکیں؟ ¤ ➋ {الْفَزَعُ الْاَكْبَرُ:} ابن عطیہ رحمہ اللہ نے فرمایا : ’’یہ نعمت جنت میں داخلے کے بعد حاصل ہو گی۔‘‘ کیونکہ صحیح احادیث میں رسول اللہ صلی اللہ علیہ وسلم کی شفاعت کے ساتھ بہت سے اہل ایمان کا جہنم سے نکلنا اور جنت میں جانا ثابت ہے، اس لیے {’’الْفَزَعُ الْاَكْبَرُ ‘‘ } سے مراد وہ وقت معلوم ہوتا ہے جس کا ذکر ابوسعید خدری رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے کیا ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ يُوْتٰی بِالْمَوْتِ كَهَيْئَةِ كَبْشٍ أَمْلَحَ فَيُنَادِيْ مُنَادٍ يَا أَهْلَ الْجَنَّةِ ! فَيَشْرَئِبُّوْنَ وَييَنْظُرُوْنَ فَيَقُوْلُ هَلْ تَعْرِفُوْنَ هٰذَا؟ فَيَقُوْلُوْنَ نَعَمْ، هٰذَا الْمَوْتُ، وَكُلُّهُمْ قَدْ رَآهُ، ثُمَّ يُنَادِيْ يَا أَهْلَ النَّارِ، فَيَشْرَئِبُّوْنَ وَيَنْظُرُوْنَ فَيَقُوْلُ هَلْ تَعْرِفُوْنَ هٰذَا؟ فَيَقُوْلُوْنَ : نَعَمْ، هٰذَا الْمَوْتُ، وَكُلُّهُمْ قَدْ رَآهٗ، فَيُذْبَحُ، ثُمَّ يَقُوْلُ : يَا أَهْلَ الْجَنَّةِ ! خُلُوْدٌ فَلاَ مَوْتَ، وَ يَا أَهْلَ النَّارِ ! خُلُوْدٌ فَلاَ مَوْتَ، ثُمَّ قَرَأَ: «{ وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ }» وَهٰؤُلَاءِ فيْ غَفْلَةٍ أَهْلُ الدُّنْيَا، «{ وَ هُمْ لَا يُؤْمِنُوْنَ } » ] [ بخاري، التفسیر، باب قولہ عز و جل : « وأنذرھم یوم الحسرۃ » : ۴۷۳۰ ] ’’موت کو ایک سیاہ و سفید مینڈھے کی صورت میں لایا جائے گا، پھر ایک آواز دینے والا آواز دے گا : ’’اے جنت والو!‘‘ وہ گردن اٹھائیں گے اور دیکھیں گے تو وہ کہے گا : ’’کیا تم اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں! یہ موت ہے‘‘ اور ان سب نے اسے دیکھا ہو گا، پھر وہ آواز دے گا : ’’اے آگ والو!‘‘ تو وہ گردن اٹھائیں گے اور دیکھیں گے تو وہ کہے گا : ’’کیا تم اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں! یہ موت ہے‘‘ اور ان سب نے اسے دیکھا ہو گا، پھر اسے ذبح کر دیا جائے گا، پھر وہ کہے گا : ’’اے جنت والو! (اب) ہمیشگی ہے اور موت نہیں ہے اور اے آگ والو! (اب) ہمیشگی ہے اور موت نہیں ہے۔‘‘ پھر آپ نے یہ آیت پڑھی : «{ وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ }» [ مریم : ۳۹ ] ( اور انھیں پچھتاوے کے دن سے ڈرا جب (ہر) کام کا فیصلہ کر دیا جائے گا اور وہ سراسر غفلت میں ہیں ) یعنی وہ سراسر دنیا کی غفلت میں ہیں : «{ وَ هُمْ لَا يُؤْمِنُوْنَ }» ’’اور وہ ایمان نہیں لاتے۔‘‘ابن کثیر نے ’’عبد الرزاق عن یحییٰ بن ربیعہ عن عطاء‘‘ یہ قول ذکر فرمایا ہے : ’’گویا {’’ يَوْمَ الْحَسْرَةِ ‘‘} اور {’’ الْفَزَعُ الْاَكْبَرُ ‘‘} ایک ہی چیز ہے۔‘‘ اکثر حضرات نے اس سے مراد صور میں آخری پھونک کا وقت مراد لیا ہے۔ بعض نے میدان حشر میں پیش آنے والے ہولناک واقعات مراد لیے ہیں، مگر جو غم یا گھبراہٹ ختم ہو جائے اسے {’’ الْفَزَعُ الْاَكْبَرُ ‘‘} نہیں کہا جا سکتا۔ ابن کثیر میں ہے کہ سعید بن جبیر نے فرمایا : [ حِيْنَ تُطْبَقُ النَّارُ عَلٰی أَهْلِهَا ] ’’اس سے مراد وہ وقت ہے جب جہنم والوں کے اوپر جہنم کو بند کر دیا جائے گا۔‘‘ دکتور حکمت بن بشیر نے فرمایا : ’’اسے طبری نے حسن سند سے ذکر کیا ہے۔‘‘ یہ قول اور موت کو ذبح کرنے کا قول ایک ہی ہے، کیونکہ جہنم کو اسی وقت اوپر سے بند کیا جائے گا جب اس میں وہی لوگ رہ جائیں گے جنھیں ہمیشہ جہنم میں رہنا ہے۔ خلاصہ یہ کہ جنت میں جانے کے بعد جنتی ہر قسم کی گھبراہٹ اور خوف سے محفوظ رہیں گے، حتیٰ کہ سب سے بڑی گھبراہٹ بھی انھیں غم زدہ نہیں کرے گی، بلکہ وہ صرف اور صرف جہنمیوں کے لیے مخصوص ہو گی۔ ¤ ➌ {وَ تَتَلَقّٰىهُمُ الْمَلٰٓىِٕكَةُ …:} یہ استقبال جنت میں داخلے کے وقت ہو گا، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ وَ سِيْقَ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ اِلَى الْجَنَّةِ زُمَرًا حَتّٰۤى اِذَا جَآءُوْهَا وَ فُتِحَتْ اَبْوَابُهَا وَ قَالَ لَهُمْ خَزَنَتُهَا سَلٰمٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوْهَا خٰلِدِيْنَ}» [ الزمر : ۷۳ ] ’’اور وہ لوگ جو اپنے رب سے ڈر گئے، گروہ در گروہ جنت کی طرف لے جائے جائیں گے، یہاں تک کہ جب وہ اس کے پاس آئیں گے، اس حال میں کہ اس کے دروازے کھول دیے گئے ہوں گے اور اس کے نگران ان سے کہیں گے تم پر سلام ہو، تم پاکیزہ رہے، پس اس میں داخل ہو جاؤ، ہمیشہ رہنے والے۔‘‘ اس سے پہلے موت کے وقت بھی فرشتے ان کا استقبال کریں گے اور بشارتیں دیں گے، فرمایا : «{ اِنَّ الَّذِيْنَ قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْتَقَامُوْا تَتَنَزَّلُ عَلَيْهِمُ الْمَلٰٓىِٕكَةُ اَلَّا تَخَاففُوْا وَ لَا تَحْزَنُوْا وَ اَبْشِرُوْا بِالْجَنَّةِ الَّتِيْ كُنْتُمْ تُوْعَدُوْنَ (30) نَحْنُ اَوْلِيٰٓؤُكُمْ فِي الْحَيٰوةِ الدُّنْيَا وَ فِي الْاٰخِرَةِ وَ لَكُمْ فِيْهَا مَا تَشْتَهِيْۤ ااَنْفُسُكُمْ وَ لَكُمْ فِيْهَا مَا تَدَّعُوْنَ (31) نُزُلًا مِّنْ غَفُوْرٍ رَّحِيْمٍ }» [ حٰمٓ السجدۃ : ۳۰ تا ۳۲ ] ’’بے شک وہ لوگ جنھوں نے کہا ہمارا رب اللہ ہے، پھر خوب قائم رہے، ان پر فرشتے اترتے ہیں کہ نہ ڈرو اور نہ غم کرو اور اس جنت کے ساتھ خوش ہو جاؤ جس کاتم وعدہ دیے جاتے تھے۔ ہم تمھارے دوست ہیں دنیا کی زندگی میں اور آخرت میں بھی اور تمھارے لیے اس میں وہ کچھ ہے جو تمھارے دل چاہیں گے اور تمھارے لیے اس میں وہ کچھ ہے جو تم مانگو گے۔ یہ بے حد بخشنے والے، نہایت مہربان کی طرف سے مہمانی ہے۔‘‘ اور فرمایا : «{ الَّذِيْنَ تَتَوَفّٰىهُمُ الْمَلٰٓىِٕكَةُ طَيِّبِيْنَ يَقُوْلُوْنَ سَلٰمٌ عَلَيْكُمُ ادْخُلُوا الْجَنَّةَ بِمَا كُنْتُمْ تَعْمَلُوْنَ }» [النحل : ۳۲ ] ’’جنھیں فرشتے اس حال میں قبض کرتے ہیں کہ پاک ہوتے ہیں۔ کہتے ہیں سلام ہو تم پر، جنت میں داخل ہوجاؤ، اس کے بدلے جو تم کیا کرتے تھے۔‘‘"
    },
    {
      "ayah": 104,
      "tafsir": "(آیت 104) ➊ {يَوْمَ نَطْوِي السَّمَآءَ كَطَيِّ السِّجِلِّ لِلْكُتُبِ : ’’طَوٰي يَطْوِيْ طَيًّا‘‘} لپیٹنا۔ {’’ السِّجِلِّ ‘‘} کا معنی ہے صحیفہ و کتاب بھی ہے اور کاتب بھی۔ (قاموس) یہاں کاتب معنی زیادہ موزوں ہے، کیونکہ کاتب کاغذات لکھنے کے بعد آخر میں لپیٹ کر اکٹھے کر لیتا ہے۔ (ابن عاشور) بعض لوگوں نے ایک فرشتے کا نام ’’سجل‘‘ بتایا ہے اور بعض نے نبی صلی اللہ علیہ وسلم کے ایک کاتب کا نام ’’سجل‘‘ بتایا ہے، مگر یہ دونوں درست نہیں، نہ کسی فرشتے کا نام ’’سجل‘‘ ثابت ہے اور نہ کسی صحابی کا۔ ¤ ➋ {’’ يَوْمَ ‘‘} یعنی جن چیزوں کا ذکر اوپر گزرا یہ سب اس دن ہوں گی جس دن… ({أَيْ تَكُوْنُ هٰذِهِ الْأَشْيَاءَ يَوْمَ}) ۔(بقاعی) ¤ ➌ {نَطْوِي السَّمَآءَ كَطَيِّ السِّجِلِّ لِلْكُتُبِ :} یعنی جس طرح کاتب اپنے اوراق لپیٹ لیتا ہے اسی طرح ہم آسمانوں کو لپیٹ دیں گے۔ قرآن مجید میں دوسری جگہ یہ بات کچھ تفصیل سے آئی ہے، چنانچہ فرمایا : « {وَ مَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖ وَ الْاَرْضُ جَمِيْعًا قَبْضَتُهٗ يَوْمَ الْقِيٰمَةِ وَ السَّمٰوٰتُ مَطْوِيّٰتٌۢ بِيَمِيْنِهٖ} » [ الزمر : ۶۷ ] ’’اور انھوں نے اللہ کی قدر نہیں کی جو اس کی قدر کا حق ہے، حالانکہ ساری زمین قیامت کے دن اس کی مٹھی میں ہو گی اور آسمان اس کے دائیں ہاتھ میں لپیٹے ہوئے ہوں گے۔‘‘ اور ابن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ يَقْبِضُ يَوْمَ الْقِيَامَةِ الْأَرْضَ وَتَكُوْنُ السَّمَاوَاتُ بِيَمِيْنِهِ ] [ بخاري، التوحید، باب قول اللّٰہ تعالٰی : «لما خلقت بیدی» : ۷۴۱۲ ] ’’بے شک اللہ تعالیٰ قیامت کے دن تمام زمینوں کو مٹھی میں لے لے گا اور تمام آسمان اس کے دائیں ہاتھ میں ہوں گے۔‘‘ مزید تفصیل سورۂ زمر (۶۷) میں دیکھیے۔ سلف صالحین کا اتفاق ہے کہ اللہ تعالیٰ کی صفات جس طرح قرآن و حدیث میں آئی ہیں ان کا اسی طرح عقیدہ رکھنا چاہیے اور انھیں اسی طرح بیان کرنا چاہیے، نہ ان کا انکار کیا جائے اور نہ تاویل، نہ یہ کہا جائے کہ ان الفاظ کا معنی ہی ہمیں معلوم نہیں۔ ہاں یہ ضروری ہے کہ اللہ تعالیٰ کی صفات کو مخلوق کی صفات کے مشابہ نہ سمجھا جائے۔ ¤ ➍ {كَمَا بَدَاْنَاۤ اَوَّلَ خَلْقٍ نُّعِيْدُهٗ … :} ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہم میں نصیحت کی خاطر خطبہ دینے کے لیے کھڑے ہوئے اور فرمایا : [ يَا أَيُّهَا النَّاسُ ! إِنَّكُمْ تُحْشَرُوْنَ إِلَی اللّٰهِ حُفَاةً عُرَاةً غُرْلًا ] [ مسلم، الجنۃ وصفۃ نعیمہا، باب فناء الدنیاء : 2860/58۔ بخاري : ۴۷۴۰ ] ’’اے لوگو! تم اللہ کی طرف اس حال میں اٹھائے جاؤ گے کہ ننگے پاؤں، ننگے بدن، ختنے کے بغیر ہو گے۔‘‘ پھر یہ آیت پڑھی : « {كَمَا بَدَاْنَاۤ اَوَّلَ خَلْقٍ نُّعِيْدُهٗ وَعْدًا عَلَيْنَا اِنَّا كُنَّا فٰعِلِيْنَ} »"
    },
    {
      "ayah": 105,
      "tafsir": "(آیت 105) {وَ لَقَدْ كَتَبْنَا فِي الزَّبُوْرِ مِنْۢ بَعْدِ الذِّكْرِ … :} زبور کا معنی کتاب ہےے، یہاں زبور سے مراد داؤد علیہ السلام کی کتاب ہے اور ذکر سے مراد نصیحت ہے، جیسا کہ ترجمہ کیا گیا ہے، کیونکہ موجودہ زبور میں یہ بات موجود ہے۔ یا پھر زبور سے مراد گزشتہ آسمانی کتابیں اور ذکر سے مراد لوح محفوظ ہے، یعنی پہلے لوح محفوظ میں یہ بات درج ہے اور اس کے بعد آسمانی کتابوں میں بھی یہ بات لکھی جاتی رہی ہے کہ زمین کے وارث نیک بندے ہوں گے۔ گویا یہ اللہ تعالیٰ کا کونی فیصلہ بھی ہے اور شرعی بھی۔ اس زمین سے کیا مراد ہے؟ آیات کے سیاق و سباق کو دیکھنے سے بات صاف سمجھ میں آ رہی ہے کہ اس سے مراد زمین و آسمان کی بساط لپیٹنے کے بعد وجود میں آنے والی زمین ہے، جو بطور انعام اللہ تعالیٰ کے صالح بندوں کو عطا کی جائے گی اور وہ ان کی دائمی اور ابدی وراثت ہو گی۔ چنانچہ موجودہ زبور اگرچہ تحریف سے خالی نہیں مگر یہ حوالہ اس میں بھی موجود ہے : ’’صادق زمین کے وارث ہوں گے اور اس میں ہمیشہ بسے رہیں گے۔‘‘ [ زبور، باب : ۳۷، آیت : ۲۹ ] قرآن مجید میں بھی بطور انعام ملنے والی اس وراثت کا ذکر ہے جو ہمیشہ رہے گی، چنانچہ فلاح پانے والے مومنوں کے اوصاف ذکر کرنے کے بعد فرمایا : «{اُولٰٓىِٕكَ هُمُ الْوٰرِثُوْنَ (10) الَّذِيْنَ يَرِثُوْنَ الْفِرْدَوْسَ هُمْ فِيْهَا خٰلِدُوْنَ}» [ المؤمنون : ۱۰، ۱۱ ] ’’یہی لوگ ہیں جو وارث ہیں، جو فردوس کے وارث ہوں گے، وہ اس میں ہمیشہ رہنے والے ہیں۔‘‘ اور فرمایا : «{ وَ قَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْ صَدَقَقَنَا وَعْدَهٗ وَ اَوْرَثَنَا الْاَرْضَ نَتَبَوَّااُ مِنَ الْجَنَّةِ حَيْثُ نَشَآءُ فَنِعْمَ اَجْرُ الْعٰمِلِيْنَ }» [ الزمر : ۷۴ ] ’’اور وہ (جنتی) کہیں گے سب تعریف اللہ کے لیے ہے جس نے ہم سے اپنا وعدہ سچا کیا اور ہمیں اس زمین کا وارث بنا دیا کہ ہم جنت میں سے جہاں چاہیں جگہ بنا لیں، سو یہ عمل کرنے والوں کا اچھا اجر ہے۔‘‘ زبور اور قرآن دونوں سے معلوم ہوا کہ صالحین کو بطور انعام ملنے والی وراثت ارضِ جنت ہے، کیونکہ ہمیشہ کا بسیرا وہی ہے۔ رہی موجودہ زمین، تو اس کی وراثت صالح و طالح، کافر و مسلم دونوں کو ملتی ہے اور صرف انعام کے طور پر نہیں، بلکہ امتحان کے لیے ملتی ہے اور ہمیشہ کے لیے نہیں بلکہ عارضی ہے، جیسا کہ فرمایا : «{ قَالَ مُوْسٰى لِقَوْمِهِ اسْتَعِيْنُوْا بِاللّٰهِ وَ اصْبِرُوْا اِنَّ الْاَرْضَ لِلّٰهِ يُوْرِثُهَا مَنْ يَّشَآءُ مِنْ عِبَادِهٖ وَ الْعَاقِبَةُ لِلْمُتَّقِيْنَ (128) قَالُوْا اُوْذِيْنَا مِنْ قَبْلِ اَنْ تَاْتِيَنَا وَ مِنْۢ بَعْدِ مَا جِئْتَنَا قَالَ عَسٰى رَبُّكُمْ اَنْ يُّهْلِكَ عَدُوَّكُمْ وَ يَسْتَخْلِفَكُمْ فِي الْاَرْضِ فَييَنْظُرَ كَيْفَ تَعْمَلُوْنَ }» [ الأعراف : ۱۲۸، ۱۲۹ ] ’’موسیٰ نے اپنی قوم سے کہا، اللہ سے مدد مانگو اور صبر کرو، بے شک زمین اللہ کی ہے، وہ اس کا وارث اپنے بندوں میں سے جسے چاہتا ہے بناتا ہے اور اچھا انجام متقی لوگوں کے لیے ہے۔ انھوں نے کہا، ہمیں اس سے پہلے ایذا دی گئی کہ تو ہمارے پاس آئے اور اس کے بعد بھی کہ تو ہمارے پاس آیا۔ اس نے کہا، تمھارا رب قریب ہے کہ تمھارے دشمن کو ہلاک کر دے اور تمھیں زمین میں جانشین بنا دے، پھر دیکھے کہ تم کیسے عمل کرتے ہو۔‘‘ اس زمین کی وراثت نہ نیکی و بدی پر موقوف ہے اور نہ ابدی اور دائمی ہے، فرمایا : «{ وَ تِلْكَ الْاَيَّامُ نُدَاوِلُهَا بَيْنَ النَّاسِ }» [ آل عمران : ۱۴۰ ] ’’اور یہ تو دن ہیں، ہم انھیں لوگوں کے درمیان باری باری بدلتے رہتے ہیں۔‘‘ البتہ اللہ تعالیٰ کا وعدہ ہے کہ اگر مسلمان صحیح مومن ہوں تو دنیا میں بھی آخر وہی غالب رہیں گے، چنانچہ فرمایا : «{ وَ اَنْتُمُ الْاَعْلَوْنَ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ }» [آل عمران : ۱۳۹ ] ’’اور تم ہی غالب ہو، اگر تم مومن ہو۔‘‘ اور فرمایا : «{ وَعَدَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ وَ عَمِلُوا الصّٰلِحٰتِ لَيَسْتَخْلِفَنَّهُمْ فِي الْاَرْضِ كَمَا اسْتَخْلَفَ الَّذِيْنَ مِنْ قَبْلِهِمْ وَ لَيُمَكِّنَنَّ لَهُمْ دِيْنَهُمُ الَّذِي ارْتَضٰى لَهُمْ وَ لَيُبَدِّلَنَّهُمْ مِّنْۢ بَعْدِ خَوْفِهِمْ اَمْنًا يَعْبُدُوْنَنِيْ لَا يُشْرِكُوْنَ بِيْ شَيْـًٔا وَ مَنْ كَفَرَ بَعْدَ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ}» [ النور : ۵۵ ] ’’اللہ نے ان لوگوں سے جو تم میں سے ایمان لائے اور انھوں نے نیک اعمال کیے، وعدہ کیا ہے کہ وہ انھیں زمین میں ضرور ہی جانشین بنائے گا، جس طرح ان لوگوں کو جانشین بنایا جو ان سے پہلے تھے اور ان کے لیے ان کے اس دین کو ضرور ہی اقتدار دے گا جسے اس نے ان کے لیے پسند کیا ہے اور ہر صورت انھیں ان کے خوف کے بعد بدل کرامن دے گا۔ وہ میری عبادت کریں گے، میرے ساتھ کسی چیز کو شریک نہ ٹھہرائیں گے اور جس نے اس کے بعد کفر کیا تو یہی لوگ نافرمان ہیں۔‘‘ ثوبان رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ تَعَالٰی زَوَی لِيَ الْأَرْضَ فَأُرِيْتُ مَشَارِقَهَا وَمَغَارِبَهَا وَإِنَّ مُلْكَ أُمَّتِيْ سَيَبْلُغُ مَا زُوِيَ لِيْ مِنْهَا وَأُعْطِيْتُ الْكَنْزَيْنِ الْأَحْمَرَ وَالْأَبْيَضَ ] [ أبوداوٗد، الفتن والملاحم، باب ذکر الفتن و دلائلھا : ۴۲۵۲، و صححہ الألباني ]’’اللہ تعالیٰ نے میرے لیے زمین تہ کر دی تو میں نے اس کے مشرق اور مغرب دیکھ لیے اور میری امت کا ملک وہاں تک پہنچے گا جہاں تک وہ میرے لیے تہ کی گئی ہے اور مجھے سرخ اور سفید (سونا اور چاندی) دو خزانے دیے گئے ہیں۔‘‘ اور واقعی آپ صلی اللہ علیہ وسلم کی پیش گوئی کے مطابق چند ہی سالوں میں مسلمان زمین کے مشرق و مغرب کے مالک بن گئے، مگر جب ان میں ایمان اور عمل صالح کی کمی ہوئی، انھوں نے ایمان، تقویٰ اور جہاد فی سبیل اللہ میں کوتاہی کی اور عیش و عشرت میں پڑ گئے تو اللہ تعالیٰ نے ان پر ان کے اور اپنے دشمن سزا دینے کے لیے مسلط کر دیے، جس طرح بنی اسرائیل پر بخت نصر کو مسلط کیا تھا۔ دیکھیے سورۂ بنی اسرائیل (۵ تا ۷) معلوم ہوا ایسا نہیں ہے کہ جو بھی اس زمین کے کسی حصے کا مالک بن جائے وہ صالحین میں شمار ہو گیا، ورنہ فرعون، ہامان، قارون، شداد، نمرود، چنگیز، ہلاکو، ہٹلر، نپولین، بش، کمیونسٹ، گائے اور بتوں کے پجاری اور تثلیث کے فرزند اللہ کے صالح بندے شمار ہوں گے اور آج کل کے روشن خیال یہی چاہتے ہیں کہ مغرب کے مشرکوں، بدکاروں اور ہم جنس پرستوں کو صالح شمار کیا جائے، تاکہ انھیں اللہ اور اس کے رسول کے احکام پر عمل کرنے سے چھٹکارا مل جائے۔"
    },
    {
      "ayah": 106,
      "tafsir": "(آیت 106) { اِنَّ فِيْ هٰذَا لَبَلٰغًا …:} یعنی اس قرآن میں یا اس سورت میں توحید، آخرت، انبیاء کے واقعات اور جو دوسرے مضامین بیان ہوئے ہیں ان میں ان لوگوں کے لیے بہت بڑا پیغام ہے جو اللہ تعالیٰ کی بندگی اختیار کرنے والے ہیں۔ جو لوگ اللہ کی عبادت پر آمادہ ہی نہیں، بلکہ شیطان اور نفس کی پیروی پر ڈٹے ہوئے ہیں انھیں اس قرآن سے کچھ حاصل نہیں ہوتا۔ آنکھوں میں روشنی ہو تو سورج یا چراغ کی روشنی کا فائدہ ہوتا ہے، اندھے کو چراغ سے کچھ دکھائی نہ دے تو اس میں چراغ کا کوئی قصور نہیں۔ دیکھیے سورۂ بقرہ کی آیت (۲) میں {’’ هُدًى لِّلْمُتَّقِيْنَ ‘‘} کی تفسیر۔"
    },
    {
      "ayah": 107,
      "tafsir": "(آیت 107) { وَ مَاۤ اَرْسَلْنٰكَ اِلَّا رَحْمَةً لِّلْعٰلَمِيْنَ:} اعراب القرآن (قرآن کی ترکیب نحوی) کے موضوع پر لکھی ہوئی تقریباً تمام کتابوں میں {’’ رَحْمَةً ‘‘ } کو {’’ اَرْسَلْنٰكَ ‘‘} کا مفعول لہ بیان کیا گیا ہے۔ بعض کتابوں میں دوسری تراکیب بھی بیان ہوئی ہیں جن کا ذکر آگے آ رہا ہے۔ نحو کا مسلمہ قاعدہ ہے کہ مفعول لہ جس فعل کی علت بیان کر رہا ہو اس فعل کا اور مفعول لہ کا فاعل ایک ہوتا ہے، مثلاً {’’ضَرَبْتُ زَيْدًا تَأْدِيْبًا‘‘} (میں نے زید کو ادب سکھانے کے لیے مارا) اس میں مارنے والا اور ادب سکھانے والا ایک ہی ہے، اس طرح یہاں بھیجنے والا بھی اللہ تعالیٰ ہے اور رحم کرنے والا بھی۔ چنانچہ معنی یہ ہو گا کہ ہم نے تجھے نہیں بھیجا مگر جہانوں پر رحم کرنے کے لیے۔ یعنی اللہ تعالیٰ کے رسول اللہ صلی اللہ علیہ وسلم کو بھیجنے کی وجہ اللہ تعالیٰ کا جہانوں پر رحم کرنا ہے۔ چنانچہ شاہ ولی اللہ رحمہ اللہ نے اس کا ترجمہ کیا ہے : ’’ونفرستادیم ترا مگر ازروئے مہربانی برعالمہا‘‘ (اور ہم نے تجھے نہیں بھیجا مگر جہانوں پر مہربانی کی وجہ سے) اور شاہ عبد القادر رحمہ اللہ نے ترجمہ کیا ہے : ’’اور تجھ کو جو ہم نے بھیجا سو مہر (یعنی مہربانی) کر کر جہان کے لوگوں پر۔‘‘ مفسر ابوالسعود نے فرمایا : {’’ أَيْ مَا أَرْسَلْنَاكَ بِمَا ذُكِرَ لِعِلَّةٍ مِنَ الْعِلَلِ إِلاَّ لِرَحْمَتِنَا الْوَاسِعَةِ لِلْعَالَمِيْنَ قَاطِبَةً‘‘} ’’اور ہم نے تجھے مذکورہ وحی دے کر کسی بھی وجہ سے نہیں بھیجا مگر تمام جہانوں پر اپنی وسیع رحمت کی وجہ سے۔‘‘ امام المفسرین طبری نے فرمایا : {’’ وَمَا أَرْسَلْنَاكَ يَا مُحَمَّدُ ! إِلاَّ رَحْمَةً لِمَنْ أَرْسَلْنَاكَ إِلَيْهِ مِنْ خَلْقِيْ‘‘} ’’اور ہم نے اے محمد! تجھے نہیں بھیجا مگر اپنی مخلوق میں سے ان لوگوں پر رحم کے لیے جن کی طرف ہم نے تجھے بھیجا ہے۔‘‘ پھر امام طبری نے {’’ لِّلْعٰلَمِيْنَ ‘‘} کی تفسیر میں اس قول کو ترجیح دی ہے کہ آپ صلی اللہ علیہ وسلم کو بھیجنے کی وجہ مومن و کافر سب پر رحم ہے کہ جو آپ پر ایمان لائے گا اس کے لیے دنیا و آخرت دونوں جہانوں میں رحمت لکھی جائے گی اور جو آپ پر ایمان نہیں لائے گا وہ دنیا میں ان عذابوں سے محفوظ رہے گا جو پہلی امتوں پر نبی کو جھٹلانے کی وجہ سے نازل ہوتے تھے، مثلاً زمین میں دھنس جانا، شکلیں بدل جانا وغیرہ۔ ¤ ایک ترکیب نحوی یہ ہے کہ {’’ رَحْمَةً ‘‘} حال بمعنی اسم فاعل برائے مبالغہ ہے۔ جس طرح کہتے ہیں {’’زَيدٌ عَدْلٌ‘‘} کہ زید عدل ہے، یعنی اتنا عادل ہے گویا سراپا عدل ہے۔ پھر یہ {’’ اَرْسَلْنٰكَ ‘‘} میں ضمیر فاعل ’’ہم‘‘ سے بھی حال ہو سکتا ہے اور {’’ اَرْسَلْنٰكَ ‘‘} میں ضمیر ’’کاف‘‘ سے بھی۔ پہلی صورت میں معنی یہ ہو گا کہ ہم نے تجھے نہیں بھیجا مگر اس حال میں کہ ہم جہانوں کے لیے سراسر رحمت ہیں۔ دوسری صورت میں معنی ہو گا کہ ہم نے تجھے نہیں بھیجا مگر اس حال میں کہ تو جہانوں کے لیے سراسر رحمت ہے۔ پہلا معنی مفعول لہ والے معنی کے قریب ہے۔ اللہ تعالیٰ کا رسول اللہ صلی اللہ علیہ وسلم کو جہانوں پر رحم کی وجہ سے مبعوث کرنا اور اللہ تعالیٰ کا رسول اللہ صلی اللہ علیہ وسلم کو اس حال میں بھیجنا کہ اس کی ذات پاک تمام جہانوں کے لیے سراسر رحمت ہے، دونوں کا مفہوم ایک ہے جو سورۂ فاتحہ میں {’’ رَبِّ الْعٰلَمِيْنَ ‘‘} اور {’’ الرَّحْمٰنِ الرَّحِيْمِ ‘‘} کے اکٹھے بیان سے واضح ہے۔ دوسرا معنی کہ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو اس حال میں بھیجا کہ آپ جہانوں کے لیے سراسر رحمت ہیں، بھی درست ہے کہ آپ مومنوں کے لیے تو دنیا و آخرت دونوں میں سراسر رحمت ہیں، فرمایا : «{ بِالْمُؤْمِنِيْنَ رَءُوْفٌ رَّحِيْمٌ }» [التوبۃ : ۱۲۸ ] ’’مومنوں پر بہت شفقت کرنے والا، نہایت مہربان ہے۔‘‘ اور فرمایا : «{ وَ رَحْمَةٌ لِّلَّذِيْنَ اٰمَنُوْا مِنْكُمْ }» [التوبۃ : ۶۱ ] ’’اور ان کے لیے ایک رحمت ہے جو تم میں سے ایمان لائے ہیں۔‘‘ اور کفار کے لیے بھی دنیا میں سراسر رحمت ہیں کہ آپ کی وجہ سے وہ دنیا میں پہلی قوموں جیسے عذابوں سے محفوظ ہو گئے اور آپ کی شریعت میں صلح و جنگ دونوں حالتوں میں ان پر وہ ظلم و جور روا نہیں رکھا جاتا جو دوسری تمام اقوام اپنے مخالفین پر روا رکھتی ہیں اور آپ کو کفار کے ایمان نہ لانے اور ان کے جہنم کا ایندھن بننے کا اتنا غم تھا کہ اللہ تعالیٰ نے آپ کو تسلی دیتے ہوئے فرمایا : «{ لَعَلَّكَ بَاخِعٌ نَّفْسَكَ اَلَّا يَكُوْنُوْا مُؤْمِنِيْنَ }» [الشعراء : ۳ ] ’’شاید تو اپنے آپ کو ہلاک کرنے والا ہے، اس لیے کہ وہ مومن نہیں ہوتے۔‘‘ آپ صلی اللہ علیہ وسلم جانوروں پر رحم فرماتے اور اس کا حکم دیتے اور ان پر ظلم سے منع فرماتے تھے، فرمایا : [ فِيْ كُلِّ ذَاتِ كَبِدٍ رَطْبَةٍ أَجْرٌ ] [ بخاري، المظالم، باب الآبار علی الطرق إذا لم یُتأذّبہا : ۲۴۶۶ ] ’’ہر تر جگر (زندگی) والی چیز (پر رحم) میں اجر ہے۔‘‘ حتیٰ کہ آپ صلی اللہ علیہ وسلم نے ایک پیاسے کتے کو پانی پلانے پر ایک بدکار عورت کو مغفرت کی نوید سنائی۔ شریعت اسلامیہ اور رسول اللہ صلی اللہ علیہ وسلم کی یہ رحمت بھی رب العالمین ہی کی رحمت ہے کہ اس نے اپنے محبوب رسول میں یہ وصف رکھا۔ چنانچہ ابن جزی ’’التسہیل‘‘ میں اعراب کی یہ تینوں وجہیں لکھ کر فرماتے ہیں : {’’وَالْمَعْنٰي عَلٰي كُلِّ وَجْهٍ أَنَّ اللّٰهَ رَحِمَ الْعَالَمِيْنَ بِإِرْسَالِ سَيِّدِنَا مُحَمَّدٍ صَلَّي اللّٰهُ عَلَيْهِ وَ سَلَّمَ‘‘}  ’’ان تمام صورتوں میں معنی ایک ہی ہے کہ اللہ تعالیٰ نے سیدنا محمد صلی اللہ علیہ وسلم کو بھیجنے کے ساتھ جہانوں پر رحم فرمایا۔‘‘"
    },
    {
      "ayah": 108,
      "tafsir": "(آیت 108) {قُلْ اِنَّمَا يُوْحٰۤى اِلَيَّ اَنَّمَاۤ اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ …:} اس آیت میں {’’ اِنَّمَا ‘‘} کلمۂ حصر دو دفعہ آیا ہے۔ فرمایا، آپ کہہ دیں کہ میری طرف صرف یہ وحی ہوتی ہے کہ تمھارا معبود صرف ایک معبود ہے۔ یہاں سوال پیدا ہوتا ہے کہ رسول اللہ صلی اللہ علیہ وسلم پر تو اس کے علاوہ بھی بہت سی وحی آتی تھی، مثلاً رسالت، قیامت، نماز، روزہ اور دوسرے احکام، تو یہ کیوں فرمایا کہ میری طرف صرف ایک وحی آتی ہے اور وہ یہ ہے کہ تمھارا معبود صرف ایک ہے؟ جواب یہ ہے کہ پوری شریعت کا خلاصہ یہ ہے کہ ہمارا کام صرف ایک معبود کی عبادت یعنی ایک مالک کی غلامی ہے۔ وہ جو حکم دے اسے کرنا ہے، جس سے منع کرے اس سے باز رہنا ہے۔ اپنی ہر ضرورت اسی سے مانگنی ہے، کیونکہ اسے وہی پورا کر سکتا ہے، یہ تمام انبیاء کی دعوت ہے، فرمایا : «{ وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ }» [ الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔‘‘ یہی ملتِ ابراہیم ہے، فرمایا : «{ اِذْ قَالَ لَهٗ رَبُّهٗۤ اَسْلِمْ قَالَ اَسْلَمْتُ لِرَبِّ الْعٰلَمِيْنَ }» [ البقرۃ : ۱۳۱ ] ’’جب اس سے اس کے رب نے کہا، فرماں بردار ہو جا، اس نے کہا، میں جہانوں کے رب کے لیے فرماں بردار ہو گیا۔‘‘ شریعت کے تمام احکام اس مالک کی بندگی بجا لانے کی مختلف صورتیں ہیں اور سب {’’ اَنَّمَاۤ اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ ‘‘} کی تفصیل ہیں۔ ایک شاعر نے کیا خوب کہا ہے: ¤ داستان حسن جب پھیلی تو لامحدود تھی ¤ اور جب سمٹی تو تیرا نام بن کر رہ گئی ¤ اس لیے یہاں جب اس حقیقت کے اعلان کا حکم دیا کہ میری طرف صرف یہ وحی ہوتی ہے کہ تمھارا معبود صرف ایک معبود ہے اور تمھارا کام اسی کی عبادت یعنی اس سے انتہا درجے کی محبت اور اس کے لیے انتہا درجے کی عاجزی کے ساتھ پوری طرح اس کا بندہ اور غلام بن جانا اور اسلام یعنی اپنے آپ کو مکمل طور پر اس کے سپرد کر دینا اور اپنی مرضی چھوڑ کر صرف اس کی مرضی پر چلنا ہے۔ تو آخر میں انھیں ایک اللہ کی عبادت اور اپنے آپ کو مکمل طور پر اس کے حوالے کرنے کا حکم دینے کے لیے استفہام کا طریقہ اختیار فرمایا کہ جب مجھے یہی وحی ہوتی ہے تو کیا اس کے مطابق تم اس کے لیے مسلم یعنی اس کے سپرد ہونے والے اور مکمل فرماں بردار بننے والے ہو؟ مقصد یہ ہے کہ ضرور بننا چاہیے، چنانچہ ہمارے نبی کو حکم ہوا : «{ قُلْ اِنَّ صَلَاتِيْ وَ نُسُكِيْ وَ مَحْيَايَ وَ مَمَاتِيْ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ (162) لَا شَرِيْكَ لَهٗ وَ بِذٰلِكَ اُمِرْتُ وَ اَنَا اَوَّلُ الْمُسْلِمِيْنَ }» [ الأنعام : ۱۶۲، ۱۶۳ ] ’’کہہ دے بے شک میری نماز اور میری قربانی اور میری زندگی اور میری موت اللہ کے لیے ہے، جو جہانوں کا رب ہے۔ اس کا کوئی شریک نہیں اور مجھے اسی کا حکم دیا گیا ہے اور میں حکم ماننے والوں میں سب سے پہلا ہوں۔‘‘"
    },
    {
      "ayah": 109,
      "tafsir": "(آیت 109) ➊ { فَاِنْ تَوَلَّوْا فَقُلْ اٰذَنْتُكُمْ … : ’’ إِنْ ‘‘} کا لفظ شک کے لیے آتا ہے، یعنی اول تو اتنے یقینی دلائل کے بعد ممکن نہیں کہ وہ مسلم نہ بنیں، لیکن اتنے واضح اور قطعی دلائل کے بعد بھی اگر وہ منہ موڑیں اور مسلم نہ بنیں تو ان سے کہہ دیجیے کہ تمھارے اسلام اور توحید سے منہ موڑنے کے بعد میں تمھیں صاف آگاہ کر رہا ہوں کہ تم نے توحید سے منہ موڑا تو میں نے بھی تمھارے شرک سے منہ موڑا، تاکہ یہ بات جاننے میں ہم تم دونوں برابر ہو جائیں۔ سورۂ کافرون میں بھی یہ اعلان صاف الفاظ میں سنا دیا گیا ہے۔ ¤ ➋ { وَ اِنْ اَدْرِيْۤ اَقَرِيْبٌ … :} یعنی توحید سے منہ موڑنے کی وجہ سے عذاب کا تم پر آنا لازم ہے، مگر مجھے معلوم نہیں کہ تم سے جس دنیوی یا اخروی عذاب کا وعدہ کیا جا رہا ہے وہ قریب ہے یا دور، کیونکہ اس کا ٹھیک وقت اللہ کے سوا کسی کو معلوم نہیں۔ سورۂ جن میں فرمایا : «{ قُلْ اِنْ اَدْرِيْۤ اَقَرِيْبٌ مَّا تُوْعَدُوْنَ اَمْ يَجْعَلُ لَهٗ رَبِّيْۤ اَمَدًا }» [ الجن : ۲۵ ] ’’کہہ دے میں نہیں جانتا آیا وہ چیز قریب ہے جس کا تم سے وعدہ کیا جاتا ہے، یا میرا رب اس کے لیے کچھ مدت رکھے گا۔‘‘"
    },
    {
      "ayah": 110,
      "tafsir": "(آیت 110) ➊ { اِنَّهٗ يَعْلَمُ الْجَهْرَ مِنَ الْقَوْلِ …:} سب کے سامنے کھلم کھلا عمل بھی ہوتا ہے اور قول بھی، اس لیے فرمایا کہ کوئی بھی کھلم کھلی اور بلند آواز میں ہونے والی بات ہو، اللہ تعالیٰ اسے بھی جانتا ہے اور جو بات تم دل میں چھپاتے ہو اسے بھی جانتا ہے۔ یہ تنبیہ اور خبردار کرنے کا مؤثر ترین طریقہ ہے کہ کسی کو غلط کام سے روکنا ہو تو اسے روکنے کے بجائے کہا جائے کہ میں تمھاری سب حرکتیں دیکھ رہا ہوں، مطلب یہ کہ تم سے نمٹ لوں گا۔ اسی طرح اللہ تعالیٰ نے فرمایا کہ میں تمھاری بلند آواز کی باتیں بھی جانتا ہوں اور جو کچھ تم چھپاتے ہو وہ بھی جانتا ہوں۔ مطلب یہ کہ تمھارا کفر بھی مجھے معلوم ہے اور تمھارا نفاق بھی، اس لیے کفر بھی چھوڑ دو اور نفاق بھی، ورنہ میری گرفت کے لیے تیار رہو۔ ¤ ➋ یہاں ایک سوال ہے کہ چھپی ہوئی بات جاننا تو واقعی کمال ہے اور یہ اللہ ہی کی شان ہے، مگر جہر اور بلند آواز سے کی ہوئی بات تو ہر شخص سن سکتا ہے اور جان سکتا ہے، اس صفت کو خاص طور پر کیوں ذکر فرمایا گیا؟ جواب اس کا یہ ہے کہ بلند آواز سے ایک آدمی بات کرے تو واقعی وہ سمجھ میں آ جاتی ہے مگر جب ایک ہی وقت میں دو چار یا دس پندرہ آدمی اپنی پوری بلند آواز کے ساتھ بات کرنا شروع کر دیں تو آدمی کو کسی کی بات بھی سمجھ میں نہیں آتی، یہ اللہ مالک الملک، سمیع و بصیر کی شان ہے کہ دس پندرہ نہیں کروڑوں، اربوں انسان، جن، فرشتے اور حیوانات اپنی پوری آواز کے ساتھ اللہ تعالیٰ سے دعا کرتے ہیں، تو وہ ان سب کی پکار سنتا ہے، جو کچھ وہ کہہ رہے ہوتے ہیں اسے جانتا ہے اور ان کی ضرورتیں پوری کرتا ہے۔ مخلوق میں یہ وصف کہاں؟ (بقاعی)"
    },
    {
      "ayah": 111,
      "tafsir": "(آیت 111) { وَ اِنْ اَدْرِيْ لَعَلَّهٗ فِتْنَةٌ لَّكُمْ … :} یعنی مجھے معلوم نہیں کہ شاید عذاب میں یہ تاخیر تمھارے لیے آزمائش ہو کہ تم اس سے فائدہ اٹھا کر حق کی طرف پلٹتے ہو، یا اپنی سرکشی میں مزید ترقی کرتے ہو، جس کے بعد یہ مہلت دنیا میں کچھ دیر تک فائدہ اٹھانے کے لیے دی گئی ہو۔"
    },
    {
      "ayah": 112,
      "tafsir": "(آیت 112) ➊ { قٰلَ رَبِّ احْكُمْ بِالْحَقِّ …:} پہلے انبیاء کی امتوں نے جب حق کو جھٹلایا تو انھوں نے حق تعالیٰ سے اس دعا سے ملتی جلتی دعا کی جو اس آیت میں مذکور ہے، چنانچہ شعیب علیہ السلام نے دعا کی : «{ رَبَّنَا افْتَحْ بَيْنَنَا وَ بَيْنَ قَوْمِنَا بِالْحَقِّ وَ اَنْتَ خَيْرُ الْفٰتِحِيْنَ }» [ الأعراف : ۸۹ ] ’’اے ہمارے رب! ہمارے درمیان اور ہماری قوم کے درمیان حق کے ساتھ فیصلہ کر دے اور تو سب فیصلہ کرنے والوں سے بہتر ہے۔‘‘ اور ان سب پیغمبروں کے متعلق فرمایا جنھیں ان کی قوم نے کفر اختیار نہ کرنے کی صورت میں اپنی بستی سے نکالنے کی دھمکی دی تھی : «{ وَ اسْتَفْتَحُوْا وَ خَابَ كُلُّ جَبَّارٍ عَنِيْدٍ }» [ إبراہیم : ۱۵ ] ’’اور انھوں نے (حق تعالیٰ سے) فیصلہ مانگا اور ہر سرکش، سخت عناد رکھنے والا نامراد ہوا۔‘‘ ¤ {’’ قٰلَ رَبِّ احْكُمْ ‘‘} کے{’’ قٰلَ ‘‘} میں دو قراء تیں ہیں، ایک امر کے صیغے کے سساتھ {’’ قُلْ ‘‘} ہے، جس کا معنی یہ ہے کہ اللہ تعالیٰ نبی کریم صلی اللہ علیہ وسلم کو حکم دے رہے ہیں کہ آپ یہ کہیں جو اس آیت میں مذکور ہے۔ دوسری قراء ت، جو ہمارے ہاں رائج ہے، اس کے مطابق یہ ماضی کا صیغہ {’’ قَالَ ‘‘} ہے، جس کا معنی ہے، اس نے کہا۔ اس صورت میں معنی یہ ہو گا کہ اللہ تعالیٰ فرماتے ہیں کہ ہمارے اس رسول نے بھی کفار کے جھٹلانے اور جلاوطن کرنے کی کوششوں کی وجہ سے ہم سے یہ کہا جو اس آیت میں مذکور ہے۔ اس سے یہ سبق ملتا ہے کہ کوئی بھی داعی جب ایسے حالات سے دو چار ہو تو اسے یہ دعا کرنی چاہیے۔ ¤ ➋ قرآن مجید کے رسم الخط میں اس آیت کا پہلا لفظ الف کے بغیر {’’ قٰلَ ‘‘} لکھا گیا ہے، جسے {’’ قُلْ ‘‘} اور {’’ قَالَ ‘‘} دونوں طرح پڑھنے کی گنجائش ہے، جس طرح {’’ مٰلِكِ يَوْمِ الدِّيْنِ ‘‘} میں {’’ مَلِكِ ‘‘} اور {’’ مَالِكِ ‘‘} دونوں طرح پڑھنے کی گنجائش ہے اور یہ قرآن مجید کے رسم الخط کا کمال ہے۔"
    }
  ]
}