{
  "surah": "Al-Muminoon",
  "surah_number": 23,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "یزید بن بابنوس رحمہ اللہ کہتے ہیں کہ ہم نے عائشہ رضی اللہ عنھا سے پوچھا : [ يَا أُمَّ الْمُؤْمِنِيْنَ! كَيْفَ كَانَ خُلُقُ رَسُوْلِ اللّٰهِ ص صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ؟ قَالَتْ كَانَ خُلُقُ رَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ الْقُرْآنَ، ثُمَّ قَالَتْ تَقْرَأُ سُوْرَةَ الْمُؤْممِنِيْنَ؟ اقْرَأْ : «قَدْ اَفْلَحَ الْمُؤْمِنُوْنَ» حَتّٰی بَلَغَ الْعَشْرَ، فَقَالَتْ هٰكَذَا كَانَ خُلْقُ رَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ] [مستدرک حاکم : 392/2، ح : ۳۴۸۱، قال الحاکم صحیح الإسناد ۔ مسلم، صلاۃ المسافرین، باب جامع صلاۃ اللیل و من نام عنہ أو مرض: ۷۴۶ ]’’اے ام المومنین! ہمیں بتائیے کہ رسول اللہ صلی اللہ علیہ وسلم کا خلق کیا تھا؟‘‘ انھوں نے فرمایا : ’’رسول اللہ صلی اللہ علیہ وسلم کا خلق قرآن تھا۔‘‘ پھر انھوں نے فرمایا : ’’سورۂ مومنون پڑھتے ہو؟ پڑھو : «قَدْ اَفْلَحَ الْمُؤْمِنُوْنَ » ‘‘ دس آیات تک تلاوت کرنے کے بعد فرمایا : ’’رسول اللہ صلی اللہ علیہ وسلم کا خلق ایسے ہی تھا۔‘‘ ذہبی نے حاکم کے فیصلے کو برقرار رکھا ہے اور شیخ البانی رحمہ اللہ نے {’’صحيح الأدب المفرد (۲۳۴)‘‘} میں اسے صحیح کہا ہے۔ خلق کا معنی ایسی عادت ہے جو آدمی کی پیدائشی اور طبعی عادت بن جائے اور کسی مشقت کے بغیر خود بخود ادا ہوتی رہے۔ ام المومنین عائشہ رضی اللہ عنھا کا مطلب یہ ہے کہ پورا قرآن ہی رسول اللہ صلی اللہ علیہ وسلم کی عادت بن چکا تھا اور سورۂ  مومنون کے شروع کی دس آیات میں جو اوصاف بیان ہوئے ہیں رسول اللہ صلی اللہ علیہ وسلم ان سے اس طرح آراستہ تھے کہ وہ آپ کی طبیعت بن چکے تھے۔ ¤ (آیت 1) ➊ {قَدْ اَفْلَحَ الْمُؤْمِنُوْنَ: ’’ قَدْ ‘‘} حرف {’’ لَمَّا ‘‘} کی نقیض ہے۔ {’’ لَمَّا ‘‘} کا مفہوم یہ ہے کہ متوقع کام ماضی میں ابھی تک نہیں ہوا، جیسا کہ فرمایا : «{ كَلَّا لَمَّا يَقْضِ مَاۤ اَمَرَهٗ}» [ عبس : ۲۳ ] ’’ہر گز نہیں، ابھی تک اس (انسان) نے وہ کام پورا نہیں کیا جس کا اس نے اسے حکم دیا تھا۔‘‘ جب کہ {’’ قَدْ ‘‘} ماضی کو حال کے قریب کر دیتا ہے اور جملہ فعلیہ میں تاکید کا وہی فائدہ دیتا ہے جو جملہ اسمیہ میں {’’إِنَّ‘‘} اور ’’لام تاکید‘‘ دیتے ہیں۔ اس کا مفہوم یہ ہے کہ جس کام کی توقع تھی وہ ماضی قریب میں یقینا واقع ہو چکا ہے۔ یعنی آگے ذکر کردہ صفات والے مومن یقینا فلاح پا چکے ہیں۔ مستقبل میں حاصل ہونے والی کامیابی کو یقینی ہونے کی وجہ سے {’’ قَدْ ‘‘} اور ماضی کے صیغہ {’’ اَفْلَحَ ‘‘} کے ساتھ ذکر فرمایا ہے۔ (بقاعی وابن عاشور) ¤ {’’ قَدْ ‘‘} کے ساتھ تاکید کی وجہ یہ ہے کہ اس سے پہلے بہت سی آیات میں ایمان والوں کو فلاح کی امید دلائی گئی تھی، جیسا کہ پچھلی سورت کے آخر میں فرمایا : «{ وَ افْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُوْنَ }» [ الحج : ۷۷ ] ’’اور نیکی کرو، تاکہ تم کامیاب ہو جاؤ۔‘‘ تو اس توقع کے پورا کرنے کی خوش خبری {’’ قَدْ اَفْلَحَ ‘‘ } کے ساتھ بیان فرمائی۔ شاید نماز کی اقامت {’’ قَدْ قَامَتِ الصَّلَاةُ ‘‘} میں حرف {’’ قَدْ ‘‘} اسی وجہ سے ہے کہ نمازی شوق سے جماعت کے انتظار میں ہوتے ہیں۔ {’’ قَدْ قَامَتِ الصَّلَاةُ‘‘} اسی انتظار کا اثبات میں جواب ہے، جیسا کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ يَا بِلَالُ ! أَقِمِ الصَّلَاةَ أَرِحْنَا بِهَا ] [ أبو داوٗد، الأدب، باب في صلاۃ العتمۃ : ۴۹۸۵ ] ’’بلال! نماز کھڑی کرو، ہمیں اس کے ساتھ راحت دلاؤ۔‘‘ (ابن عاشور) ¤ ➋ { اَفْلَحَ : ’’اَلْفَلَحُ‘‘} لام کے فتحہ کے ساتھ اور {’’اَلْفَلَاحُ‘‘} کا معنی بھلائی کے کام میں کامیابی ہے اور {’’اَلْفَلْحُ‘‘} لام کے سکون کے ساتھ ’’پھاڑنا۔‘‘ دونوں باب {’’مَنَعَ‘‘} سے آتے ہیں۔ کہا جاتا ہے : {’’اَلْحَدِيْدُ بِالْحَدِيْدِ يُفْلَحُ‘‘} ’’لوہا، لوہے کے ساتھ کاٹا جاتا ہے۔‘‘ کسان کو اسی لیے {’’اَلْفَلَّاحُ‘‘} کہتے ہیں کہ وہ زمین کو پھاڑتا ہے۔ گویا فلاح وہ کامیابی ہے جو محنت و مشقت کے نتیجے میں حاصل ہو۔ کامیابی دنیا کی بھی ہے اور آخرت کی بھی۔ ¤ ➌ {’’ قَدْ اَفْلَحَ الْمُؤْمِنُوْنَ ‘‘} میں یہ بتایا ہے کہ بعد میں ذکر کردہ صفات والے مومن یقینا کامیاب ہو گئے، مگر یہ نہیں بتایا کہ کس چیز میں کامیاب ہو گئے۔ یہ بات ان آیات کے آخر میں بیان فرمائی ہے، فرمایا : «{ اُولٰٓىِٕكَ هُمُ الْوٰرِثُوْنَ (10) الَّذِيْنَ يَرِثُوْنَ الْفِرْدَوْسَ }» [ المؤمنون : ۱۰، ۱۱ ] ’’یہی لوگ ہیں جو وارث ہیں۔ جو فردوس کے وارث ہوں گے۔‘‘ یعنی کامیابی سے مراد آخرت کی کامیابی ہے، کیونکہ حقیقی زندگی وہی ہے، فرمایا : «{ وَ اِنَّ الدَّارَ الْاٰخِرَةَ لَهِيَ الْحَيَوَانُ لَوْ كَانُوْا يَعْلَمُوْنَ }» [ العنکبوت : ۶۴ ] ’’اور بے شک آخری گھر، یقینا وہی اصل زندگی ہے، اگر وہ جانتے ہوتے۔‘‘ دنیا کی زندگی نہ حقیقی زندگی ہے اور نہ اس کی کامیابی حقیقی کامیابی، فرمایا : «{ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَ اُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ وَ مَا الْحَيٰوةُ الدُّنْيَاۤ اِلَّا مَتَاعُ الْغُرُوْرِ }» [ آل عمران : ۱۸۵ ] ’’پھر جو شخص آگ سے دور کر دیا گیا اور جنت میں داخل کر دیا گیا تو یقینا وہ کامیاب ہوگیا اور دنیا کی زندگی تو دھوکے کے سامان کے سوا کچھ نہیں۔‘‘ ¤ ➍ کامیاب ہونے والوں کے اوصاف میں سب سے پہلے ایمان کا ذکر فرمایا، کیونکہ ایمان ہی کامیابی کا اصل سبب ہے، پھر بعد کی آیات میں اہلِ ایمان کی چند مزید صفات بیان فرمائیں جو ایمان کے درست اور پختہ ہونے کی دلیل ہیں اور جن کے بغیر ایمان بے معنی ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ {الَّذِيْنَ هُمْ فِيْ صَلَاتِهِمْ خٰشِعُوْنَ :} طبری نے اپنی حسن سند کے ساتھ ابن عباس رضی اللہ عنھما سے {’’خٰشِعُوْنَ ‘‘} کی تفسیر {’’خَائِفُوْنَ سَاكِنُوْنَ‘‘} روایت کی ہے۔ (طبری : ۲۵۶۲۷) یعنی وہ نماز میں دل سے اللہ تعالیٰ سے ڈرنے والے ہوتے ہیں اور اس خوف کا ان کے جسم پر ایسا اثر ہوتا ہے کہ وہ نماز کے منافی کسی بھی حرکت سے اجتناب کرتے ہیں، نہ ادھر ادھر نگاہ پھیرتے ہیں، نہ اپنے کپڑے یا ڈاڑھی سے کھیلتے ہیں اور نہ انگلیاں چٹخاتے ہیں۔ عائشہ رضی اللہ عنھا فرماتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے نماز میں ادھر ادھر جھانکنے کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ هُوَ اخْتِلَاسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ صَلَاةِ الْعَبْدِ ] [ بخاري، الأذان، باب الالتفات في الصلاۃ : ۷۵۱ ] ’’یہ شیطان کا آدمی کی نماز سے اچک کر لے جانا ہے، جو شیطان بندے کی نماز سے اچک کر لے جاتا ہے۔‘‘ ¤ ➋ اس آیت کی تفسیر میں بہت سے مفسرین نے ایک روایت بیان کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو نمازمیں اپنی ڈاڑھی سے کھیلتے ہوئے دیکھا تو فرمایا : ’’اگر اس کا دل خشوع کرتا تو اس کے دوسرے اعضا بھی خشوع کرتے۔‘‘ شیخ البانی نے {’’سلسلة الأحاديث الضعيفة والموضوعة(۱۱۰)‘‘} میں اس کا موضوع (خود بنائی ہوئی) ہونا دلائل سے ذکر فرمایا ہے۔ ¤ تنبیہ : نماز میں ڈاڑھی، کپڑے یا کسی بھی چیز سے کھیلنے اور بے مقصد حرکت کرنے کا خشوع، یعنی دل کے خوف اور جسم کے سکون کے منافی ہونا واضح بات ہے، مگر یہ ہرگز جائز نہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے ذمے وہ الفاظ لگائے جائیں جو آپ صلی اللہ علیہ وسلم سے ثابت نہیں، کیونکہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ] [ بخاري، العلم، باب إثم من  کذب…: ۱۱۰۔ مسلم : ۳ ]’’جس شخص نے جان بوجھ کر مجھ پر جھوٹ بولا وہ اپنا ٹھکانا آگ میں بنا لے۔‘‘ ¤ ➌ امام بخاری رحمہ اللہ نے اپنی صحیح میں ایک باب باندھا ہے : ’’نماز میں ہاتھ سے مدد لینے کا باب، جب وہ کام نماز ہی سے متعلق ہو۔‘‘ پھر اس عنوان کے تحت ابن عباس رضی اللہ عنھما کا قول نقل کیا ہے کہ انھوں نے فرمایا : ’’آدمی نماز میں اپنے جسم سے جس طرح چاہے مدد حاصل کرے۔‘‘ پھر لکھتے ہیں کہ ابو اسحاق نے نماز میں اپنی ٹوپی نیچے رکھی اور اسے اٹھایا اور علی رضی اللہ عنہ نے اپنی ہتھیلی اپنی بائیں کلائی کے جوڑ پر رکھے رکھی، سوائے اس کے کہ اپنی جلد کو کھجلی کریں یا اپنا کپڑا درست کریں۔‘‘ اس کے بعد امام صاحب نے ابن عباس رضی اللہ عنھما سے وہ حدیث نقل کی ہے جس میں انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کھڑے ہو کر رات کی نماز پڑھنے کا ذکر کیا ہے۔ اس میں یہ بھی ہے : ’’آپ صلی اللہ علیہ وسلم نے اپنا دایاں ہاتھ میرے سر پر رکھا اور میرا کان پکڑ کر اسے مروڑنے لگے (یعنی مجھے کان سے پکڑ کر دائیں طرف کیا)۔‘‘ [ بخاري، العمل في الصلاۃ، باب استعانۃ الید في الصلاۃ إذا کان من أمر الصلاۃ : ۱۱۹۸ ]"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) { وَ الَّذِيْنَ هُمْ عَنِ اللَّغْوِ مُعْرِضُوْنَ:’’لغو‘‘} ہر وہ بات یا کام جس کا کوئی فائدہ نہ ہو۔ اس میں شرک اور ہر گناہ، بلکہ ہر بے فائدہ اور بے مقصد قول و فعل آ جاتا ہے۔ یعنی کوئی لغو بات یا کام خود کرنا تو دور کی بات ہے، وہ کوئی لغو کام ہوتا ہوا دیکھتے یا سنتے بھی نہیں، بلکہ ان کی عادت ہی لغو سے منہ موڑے رکھنا ہے۔ {’’ يُعْرِضُوْنَ‘‘} کے بجائے {’’ مُعْرِضُوْنَ ‘‘} (اسم فاعل) کا مطلب ہے کہ لغو سے اعراض ان کی عادت ہے۔رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيْهِ ] [ ترمذي، الزھد، باب حدیث من حسن إسلام المرء … : ۲۳۱۷،عن أبي ھریرۃ رضی اللہ عنہ ]’’آدمی کے اسلام کے حسن میں سے اس کا ان چیزوں کو چھوڑ دینا ہے جو اس کے مقصد کی نہیں ہیں۔‘‘ عباد الرحمان کی صفت بیان فرمائی : «وَ اِذَا مَرُّوْا بِاللَّغْوِ مَرُّوْا كِرَامًا » [ الفرقان : ۷۲ ] ’’اور جب بے ہودہ کام کے پاس سے گزرتے ہیں تو باعزت گزر جاتے ہیں۔‘‘ جنت کی ایک خوبی یہ ہو گی : « لَا يَسْمَعُوْنَ فِيْهَا لَغْوًا وَّ لَا تَاْثِيْمًا » [ الواقعۃ : ۲۵ ] ’’وہ اس میں نہ بے ہودہ گفتگو سنیں گے اور نہ گناہ میں ڈالنے والی بات۔‘‘"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) { وَ الَّذِيْنَ هُمْ لِلزَّكٰوةِ فٰعِلُوْنَ:} زکوٰۃ کا لفظ طہارت پر بولا جاتا ہے، جیسا کہ فرمایا : « قَدْ اَفْلَحَ مَنْ تَزَكّٰى» [ الأعلٰی : ۱۴ ] ’’بے شک وہ کامیاب ہو گیا جو پاک ہو گیا۔‘‘ اور کسی چیز کے بڑھنے پر بھی، جیسا کہ کہا جاتا ہے : {’’ زَكَا الزَّرْعُ ‘‘} ’’کھیتی بڑھ گئی۔‘‘ زکوٰۃ ارکانِ اسلام میں سے ایک رکن کا نام بھی ہے، جو مال میں سے ایک مخصوص حصے کی ادائیگی پر بولا جاتا ہے، کیونکہ اس عمل سے نفس کو پاکیزگی حاصل ہوتی ہے اور مال میں اضافہ بھی ہوتا ہے۔ اس معنی کے مطابق {’’ لِلزَّكٰوةِ ‘‘} کا لام اسم فاعل کی تقویت کے لیے ہو گا۔ مطلب یہ ہے کہ وہ زکوٰۃ کا عمل کرنے والے ہیں۔(بقاعی) قرآن میں عام طور پر نماز اور زکوٰۃ کا ذکر اکٹھا آیا ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) { وَ الَّذِيْنَ هُمْ لِفُرُوْجِهِمْ حٰفِظُوْنَ:} پاکدامنی کی صفت اگرچہ لغو سے اعراض میں شامل ہے، مگر نفس کی سب سے منہ زور قوت پر قابو رکھنے کی اہمیت کی وجہ سے اسے الگ بھی ذکر فرمایا، جیسا کہ {’’ الْمُؤْمِنُوْنَ ‘‘} کے لفظ میں ایمان کے تمام اعمال شامل ہیں، مگر بعد میں سات چیزوں کو ان کی اہمیت کے پیشِ نظر الگ بھی ذکر فرمایا۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { اِلَّا عَلٰۤى اَزْوَاجِهِمْ …:} اس سے معلوم ہوا کہ اسلام جوگیوں، راہبوں اور بعض صوفیوں کی طرح جنسی خواہش کو سرے سے روک دینے کا حکم نہیں دیتا، بلکہ بیویوں اور لونڈیوں سے جماع کو جائز قرار دیتا ہے۔ اللہ تعالیٰ نے نکاح کا حکم دیا ہے، فرمایا : «وَ اَنْكِحُوا الْاَيَامٰى مِنْكُمْ وَ الصّٰلِحِيْنَ مِنْ عِبَادِكُممْ وَ اِمَآىِٕكُمْ اِنْ يَّكُوْنُوْا فُقَرَآءَ يُغْننِهِمُ اللّٰهُ مِنْ فَضْلِهٖ وَ اللّٰهُ وَاسِعٌ عَلِيْمٌ » [ النور : ۳۲ ] ’’اور اپنے میں سے بے نکاح مردوں، عورتوں کا نکاح کر دو اور اپنے غلاموں اور اپنی لونڈیوں سے جو نیک ہیں ان کا بھی، اگر وہ محتاج ہوں گے تو اللہ انھیں اپنے فضل سے غنی کر دے گا اور اللہ وسعت والا، سب کچھ جاننے والا ہے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے ان تین صحابہ سے جن میں سے ایک نے نکاح نہ کرنے کا ارادہ کیا تھا، فرمایا : [ أَمَا وَاللّٰهِ ! إِنِّيْ لَأَخْشَاكُمْ لِلّٰهِ وَ أَتْقَاكُمْ لَهُ، لٰكِنِّيْ أَصُوْمُ وَ أُفْطِرُ وَ أُصَلِّيْ وَ أَرْقُدُ وَ أَتَزَوَّجُ النِّسَاءَ، فَمَنْ رَغِبَ عَنْ سُنَّتِيْ فَلَيْسَ مِنِّيْ ] [ بخاري، النکاح، باب الترغیب في النکاح… : ۵۰۶۳ ] ’’اللہ کی قسم! میں تم سب سے زیادہ اللہ سے ڈرنے والا اور تم سب سے زیادہ اس سے بچنے والا ہوں، لیکن (اس کے باوجود) میں روزہ رکھتا بھی ہوں اور چھوڑتا بھی ہوں، میں قیام اللیل بھی کرتا ہوں اور سوتا بھی ہوں اور میں عورتوں سے نکاح کرتا ہوں، پھر جو میری سنت سے بے رغبتی کرے وہ مجھ سے نہیں۔‘‘ ¤ ➋ {’’ اِلَّا عَلٰۤى اَزْوَاجِهِمْ اَوْ مَا مَلَكَتْ اَيْمَانُهُمْ ‘‘} سے معلوم ہوا کہ شہوت پوری کرنے کے لیے مسلمان مرد کے پاس صرف دو راستے ہیں، بیوی اور لونڈی اور عورت کے لیے صرف ایک راستہ ہے اور وہ ہے خاوند یا لونڈی کا مالک۔ کیونکہ جب بیوی خاوند کے لیے حلال ہوئی تو خاوند بیوی کے لیے خود بخود حلال ہو گیا۔ عورت اپنے غلام سے حاجت پوری نہیں کر سکتی، کیونکہ {’’ عَلٰۤى‘‘} کا لفظ اس سے منع کرتا ہے، جو بلندی اور اوپر ہونے کے معنی میں استعمال ہوتا ہے۔ ¤ ➌ اس آیت سے یہ معلوم ہوا کہ کسی عورت سے جماع کے جواز کے لیے نکاح ضروری ہے، یا اس کا مملوکہ ہونا۔ مالک کو مملوکہ لونڈی کے لیے نکاح کی ضرورت نہیں، اگر مالک کو اس سے جماع کے لیے نکاح ضروری ہوتا تو {’’ عَلٰۤى اَزْوَاجِهِمْ ‘‘} ہی کافی تھا، مملوکہ لونڈیوں کا الگ ذکر کرنے کی ضرورت نہیں تھی۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {فَمَنِ ابْتَغٰى وَرَآءَ ذٰلِكَ … :} یعنی بیوی اور لونڈی کے علاوہ کسی بھی طریقے سے شہوت پوری کرنے والے ہی حد سے بڑھنے والے ہیں۔ اس آیت سے اپنی منکوحہ عورتوں اور اپنی لونڈیوں کے سوا کسی بھی عورت سے جماع حد سے بڑھنا ٹھہرا۔ چنانچہ فرمایا : «وَ لَا تَقْرَبُوا الزِّنٰۤى اِنَّهٗ كَانَ فَاحِشَةً وَ سَآءَ سسَبِيْلًا » [ بنی إسرائیل : ۳۲ ] ’’اور زنا کے قریب نہ جاؤ، بے شک وہ ہمیشہ سے بڑی بے حیائی ہے اور برا راستہ ہے۔‘‘ اسی طرح قوم لوط کا عمل، کسی جانور سے بدفعلی اور ہاتھ یا کسی اور طریقے سے ایسا فعل بھی حد سے تجاوز ہے۔ اگرچہ تجاوز کے درجوں میں فرق ہے، مگر مومن کو کسی طرح بھی اللہ کی حدود سے تجاوز درست نہیں۔ ¤ تنبیہ : ہاتھ سے منی نکالنا اگرچہ ایک قبیح اور مروّت کے خلاف فعل ہے اور حد سے بڑھنا ہے، مگر اس کی وعید میں رسول اللہ صلی اللہ علیہ وسلم سے جتنی روایات بیان کی جاتی ہیں ان میں سے کوئی بھی ثابت نہیں، مثلاً روایت : [ نَاكِحُ الْيَدِ مَلْعُوْنٌ ] ’’ہاتھ سے نکاح کرنے والا ملعون ہے۔‘‘ اور یہ روایت کہ سات آدمی ہیں جن کی طرف قیامت کے دن اللہ تعالیٰ نہ دیکھے گا اور نہ انھیں پاک کرے گا اور انھیں آگ میں سب سے پہلے داخل کرے گا، ان میں سے پہلا {’’نَاكِحُ الْيَدِ‘‘} (ہاتھ سے نکاح کرنے والا) ہے اور یہ روایت کہ قیامت کے دن یہ فعل کرنے والوں کے ہاتھ حمل کی حالت میں ہوں گے، وغیرہ۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) {وَ الَّذِيْنَ هُمْ لِاَمٰنٰتِهِمْ وَ عَهْدِهِمْ رٰعُوْنَ :} عفت اللہ تعالیٰ کی ایک بہت بڑی امانت ہے، اس کے ذکر کے بعد عام امانتوں کی حفاظت کا ذکر فرمایا۔ عہد بھی ایک امانت ہے، اس کی اہمیت کے پیش نظر اس کا الگ ذکر فرمایا۔ {’’ رٰعُوْنَ ‘‘ ’’رَعٰي يَرْعٰي‘‘} (ف) سے اسم فاعل ہے۔ فعل مضارع کے بجائے اسم فاعل لانے کا مطلب یہ ہے کہ وہ ہمیشہ اپنی امانتوں اور عہدوں کی حفاظت کرتے ہیں، یہ ان کی عادت ہے۔ منافقوں کی طرح نہیں کہ جن کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ آيَةُ الْمُنَافِقِ ثَلَاثٌ إِذَا حَدَّثَ كَذَبَ وَ إِذَا وَعَدَ أَخْلَفَ وَ إِذَا اؤْتُمِنَ خَانَ ] [ بخاري، الإیمان، باباب علامات المنافق : ۳۳ ] ’’منافق کی تین نشانیاں ہیں، جب بات کرے تو جھوٹ بولے، جب وعدہ کرے تو خلاف ورزی کرے اور جب اس کے پاس امانت رکھی جائے تو خیانت کرے۔‘‘"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ { وَ الَّذِيْنَ هُمْ عَلٰى صَلَوٰتِهِمْ يُحَافِظُوْنَ :} فلاح پانے والے مومنوں کی پہلی صفت نماز میں خشوع بیان فرمائی اور دوسرے اوصاف بیان کرنے کے بعد آخر میں پھر نماز ہی سے تعلق رکھنے والی ایک صفت بیان فرمائی کہ وہ اپنی نمازوں کی خوب حفاظت کیا کرتے ہیں۔ اس سے ظاہر ہے کہ اللہ تعالیٰ کے ہاں نماز کی کس قدر اہمیت ہے۔ ¤ ➋ {’’ يُحَافِظُوْنَ ‘‘} باب مفاعلہ سے مبالغے کے لیے ہے، کیونکہ یہاں مقابلے کا معنی مراد نہیں ہو سکتا۔ {’’يَحْفَظُوْنَ‘‘} ’’حفاظت کرتے ہیں‘‘ اور {’’ يُحَافِظُوْنَ ‘‘} ’’خوب حفاظت کرتے ہیں۔‘‘ محافظت سے مراد نماز ہمیشہ ادا کرنا اور ہر نماز کو اس کے وقت پر ادا کرنا ہے۔ عبد اللہ بن مسعود رضی اللہ عنہ نے فرمایا : ’’میں نے نبی صلی اللہ علیہ وسلم سے پوچھا : ’’یا رسول اللہ! کون سا عمل اللہ کو سب سے زیادہ محبوب ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ اَلصَّلَاةُ عَلٰی وَقْتِهَا ] ’’نماز اس کے وقت پر ادا کرنا۔‘‘ میں نے کہا : ’’پھر کون سا عمل؟‘‘ فرمایا : ’’والدین سے حسن سلوک۔‘‘ میں نے کہا : ’’پھر کون سا؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’جہاد فی سبیل اللہ۔‘‘ [ بخاري، مواقیت الصلاۃ، باب فضل الصلاۃ لوقتھا : ۵۲۷۔ مسلم : ۸۵ ] مستدرک حاکم (۱؍۱۸۸، ح : ۶۷۴) میں ہے : [ اَلصَّلَاةُ فِيْ أَوَّلِ وَقْتِهَا ] ’’نماز اس کے اول وقت میں ادا کرنا۔‘‘ حاکم نے فرمایا، یہ لفظ دو ثقہ راویوں بندار بن بشار اور حسن بن مکرم کی روایت سے ثابت ہیں، جو ان دونوں نے عثمان بن عمرو سے روایت کی ہے اور یہ شیخین کی شرط پر صحیح ہے، جب کہ شیخین نے اسے روایت نہیں کیا۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 11،10) { اُولٰٓىِٕكَ هُمُ الْوٰرِثُوْنَ … :} ان سات صفات کے مالک فردوس کے وارث ہوں گے۔ انھیں وارث کہنے کی تین وجہیں ہیں، ایک یہ کہ وراثت کسی چیز کے حق دار ہونے کا سب سے مضبوط سبب ہے، یعنی یہ لوگ جنت کے سب سے زیادہ مستحق ہیں۔ دوسری وجہ یہ کہ جنت ان کے والد مکرم آدم علیہ السلام کی ملکیت تھی، جب وہ وہاں سے نکلے تو ان کی اولاد جو یہ اعمال کرے گی اپنے والد کی جائداد کی وارث ہو گی۔ تیسری وجہ حدیث میں آئی ہے، ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا لَهُ مَنْزِلَانِ، مَنْزِلٌ فِي الْجَنَّةِ، وَ مَنْزِلٌ فِي النَّارِ، فَإِذَا مَاتَ، فَدَخَلَ النَّارَ، وَرِثَ أَهْلُ الْجَنَّةِ مَنْزِلَهُ، فَذٰلِكَ قَوْلُهُ تَعَالٰی: « اُولٰٓىِٕكَ هُمُ الْوٰرِثثُوْنَ » ] [ ابن ماجہ، الزھد، باب صفۃ الجنۃ : ۴۳۴۱۔ صححہ الألباني في سلسلۃ الأحادیث الصحیحۃ : ۲۲۷۹ ] ’’تم میں سے ہر ایک کے لیے دو گھر ہیں، ایک گھر جنت میں اور ایک گھر آگ میں۔ پھر اگر کوئی فوت ہو جائے اور آگ میں چلا جائے تو جنت والے اس کے گھر کے وارث بن جاتے ہیں، سو یہی مطلب ہے اللہ تعالیٰ کے اس فرمان کا : « اُولٰٓىِٕكَ هُمُ الْوٰرِثُوْنَ»۔“ ¤ {’’ الْفِرْدَوْسَ ‘‘} لغت میں وسیع باغ کو کہتے ہیں، جس میں کئی قسم کے باغات ہوں، جن میں ہر طرح کے پھل دار درخت خصوصاً انگور اور خوشبو دار پھول کثرت سے ہوں۔ قرآن میں مذکور فردوس کی تفسیر رسول اللہ صلی اللہ علیہ وسلم سے آئی ہے، ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فَإِذَا سَأَلْتُمُ اللّٰهَ فَاسْأَلُوْهُ الْفِرْدَوْسَ فَإِنَّهُ أَوْسَطُ الْجَنَّةِ وَ أَعْلَی الْجَنَّةِ، أُرَاهُ قَالَ: وَ فَوْقَهُ عَرْشُ الرَّحْمٰنِ وَ مِنْهُ تَفَجَّرُ أَنْهَارُ الْجَنَّةِ] [بخاري،، الجہاد والسیر، باب درجات المجاہدین… : ۲۷۹۰ ] ’’جب تم اللہ سے مانگو تو فردوس مانگو، کیونکہ وہ جنت کا اوسط اور جنت کا اعلیٰ (سب سے بلند) حصہ ہے۔‘‘ راوی حدیث کہتا ہے کہ میں سمجھتا ہوں پھر یوں فرمایا : ’’اور اس کے اوپر رحمان کا عرش ہے اور اسی سے جنت کی نہریں نکلتی ہیں۔‘‘ اوسط کا معنی افضل بھی ہے اور سب سے درمیان بھی۔ شاید درمیان سے مراد یہ ہو کہ وہ طول و عرض کے لحاظ سے جنت کے عین درمیان ہے اور بلندی کے لحاظ سے جنت کی سب سے بلند منزل ہے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11،10) { اُولٰٓىِٕكَ هُمُ الْوٰرِثُوْنَ … :} ان سات صفات کے مالک فردوس کے وارث ہوں گے۔ انھیں وارث کہنے کی تین وجہیں ہیں، ایک یہ کہ وراثت کسی چیز کے حق دار ہونے کا سب سے مضبوط سبب ہے، یعنی یہ لوگ جنت کے سب سے زیادہ مستحق ہیں۔ دوسری وجہ یہ کہ جنت ان کے والد مکرم آدم علیہ السلام کی ملکیت تھی، جب وہ وہاں سے نکلے تو ان کی اولاد جو یہ اعمال کرے گی اپنے والد کی جائداد کی وارث ہو گی۔ تیسری وجہ حدیث میں آئی ہے، ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا لَهُ مَنْزِلَانِ، مَنْزِلٌ فِي الْجَنَّةِ، وَ مَنْزِلٌ فِي النَّارِ، فَإِذَا مَاتَ، فَدَخَلَ النَّارَ، وَرِثَ أَهْلُ الْجَنَّةِ مَنْزِلَهُ، فَذٰلِكَ قَوْلُهُ تَعَالٰی: « اُولٰٓىِٕكَ هُمُ الْوٰرِثثُوْنَ » ] [ ابن ماجہ، الزھد، باب صفۃ الجنۃ : ۴۳۴۱۔ صححہ الألباني في سلسلۃ الأحادیث الصحیحۃ : ۲۲۷۹ ] ’’تم میں سے ہر ایک کے لیے دو گھر ہیں، ایک گھر جنت میں اور ایک گھر آگ میں۔ پھر اگر کوئی فوت ہو جائے اور آگ میں چلا جائے تو جنت والے اس کے گھر کے وارث بن جاتے ہیں، سو یہی مطلب ہے اللہ تعالیٰ کے اس فرمان کا : « اُولٰٓىِٕكَ هُمُ الْوٰرِثُوْنَ»۔“ ¤ {’’ الْفِرْدَوْسَ ‘‘} لغت میں وسیع باغ کو کہتے ہیں، جس میں کئی قسم کے باغات ہوں، جن میں ہر طرح کے پھل دار درخت خصوصاً انگور اور خوشبو دار پھول کثرت سے ہوں۔ قرآن میں مذکور فردوس کی تفسیر رسول اللہ صلی اللہ علیہ وسلم سے آئی ہے، ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فَإِذَا سَأَلْتُمُ اللّٰهَ فَاسْأَلُوْهُ الْفِرْدَوْسَ فَإِنَّهُ أَوْسَطُ الْجَنَّةِ وَ أَعْلَی الْجَنَّةِ، أُرَاهُ قَالَ: وَ فَوْقَهُ عَرْشُ الرَّحْمٰنِ وَ مِنْهُ تَفَجَّرُ أَنْهَارُ الْجَنَّةِ] [بخاري،، الجہاد والسیر، باب درجات المجاہدین… : ۲۷۹۰ ] ’’جب تم اللہ سے مانگو تو فردوس مانگو، کیونکہ وہ جنت کا اوسط اور جنت کا اعلیٰ (سب سے بلند) حصہ ہے۔‘‘ راوی حدیث کہتا ہے کہ میں سمجھتا ہوں پھر یوں فرمایا : ’’اور اس کے اوپر رحمان کا عرش ہے اور اسی سے جنت کی نہریں نکلتی ہیں۔‘‘ اوسط کا معنی افضل بھی ہے اور سب سے درمیان بھی۔ شاید درمیان سے مراد یہ ہو کہ وہ طول و عرض کے لحاظ سے جنت کے عین درمیان ہے اور بلندی کے لحاظ سے جنت کی سب سے بلند منزل ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {وَ لَقَدْ خَلَقْنَا الْاِنْسَانَ مِنْ سُلٰلَةٍ مِّنْ طِيْنٍ : ’’ سُلٰلَةٍ ‘‘ ’’سَلَّ يَسُلُّ‘‘} کوئی چیز نرمی کے ساتھ کھینچتے ہوئے نکالنا۔ {’’سَلَلْتُ السَّيْفَ‘‘} ’’میں نے میان سے تلوار نکالی۔‘‘ {’’اَلسُّلَالَةُ‘‘} بمعنی {’’ اَلشَّيْءُ الْمَسْلُوْلُ‘‘} یعنی کسی چیز کا خلاصہ۔ {’’فُعَالَةٌ‘‘} کے وزن میں قلت کا مفہوم پایا جاتا ہے، جیسے {’’قُلَامَةٌ‘‘} قلم کا تراشہ اور {’’ صُبَابَةٌ ‘‘} تھوڑا سا گرا ہوا پانی۔ ¤ ➋ ان آیات کی پچھلی آیات کے ساتھ مناسبت یہ معلوم ہوتی ہے کہ اللہ تعالیٰ نےے فلاح پانے والے مومنوں کے فردوس کے وارث ہونے کا ذکر فرمایا، تو ظاہر ہے کہ یہ قیامت کے دن ہی ہو گا، اس لیے قیامت اور موت کے بعد زندگی کی دلیل کے طور پر انسان کی پہلی دفعہ پیدائش کا ذکر فرمایا، پھر کائنات میں اس سے بھی بڑی مخلوقات آسمان و زمین اور ان میں موجود نعمتوں کا ذکر دلیل کے طور پر فرمایا کہ جس نے یہ سب کچھ پہلی دفعہ پیدا کیا وہ دوبارہ زندہ کرنے پر بھی قادر ہے۔ پھر اللہ کی توحید اور دوبارہ زندہ کرنے کی قدرت کے منکروں کے انجام بد سے ڈرایا، چنانچہ سب سے پہلے نوح علیہ السلام کی قوم کے انکار اور ان پر آنے والے عذاب کا ذکر فرمایا۔ واللہ اعلم (نظم الدرر للبقاعی) ¤ ➌ {مِنْ سُلٰلَةٍ مِّنْ طِيْنٍ : ’’ طِيْنٍ ‘‘} کی تنوین تحقیر کے لیے ہے اور {’’ سُلٰلَةٍ ‘‘} میں بھی قلت کا مفہوم موجود ہے، یعنی یہ انسان جسے تم چلتے پھرتے اور ہنستے مسکراتے دیکھتے ہو اس کی ابتدا حقیر مٹی کے تھوڑے سے خلاصے کے ساتھ ہوئی۔ ابوموسیٰ اشعری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ خَلَقَ آدَمَ مِنْ قَبْضَةٍ قَبَضَهَا مِنْ جَمِيْعِ الْأَرْضِ فَجَاءَ بَنُوْ آدَمَ عَلٰی قَدْرِ الْأَرْضِ جَاءَ مِنْهُمُ الْأَحْممَرُ وَالْأَبْيَضُ وَالْأَسْوَدُ وَ بَيْنَ ذٰلِكَ وَالسَّهْلُ وَالْحَزْنُ وَالْخَبِيْثُ وَالطَّيِّبُ ] [ أبو داوٗد، السنۃ، باب في القدر : ۴۶۹۳ ] ’’اللہ عزو جل نے آدم کو ایک مٹھی مٹی سے پیدا کیا ہے، جسے اس نے تمام روئے زمین سے جمع فرمایا تھا۔ چنانچہ آدم کی اولاد اس مٹی کے لحاظ سے ہوئی ہے، کئی سرخ ہیں اور کئی سفید، کئی سیاہ ہیں اور کئی ان کے بین بین۔ کئی نرم خو ہیں اور کئی سخت طبیعت۔ کئی بری طبیعت کے مالک ہوتے ہیں اور کئی اچھی اور عمدہ طبیعت والے۔‘‘ اس آیت میں آدم علیہ السلام کی پیدائش کا ذکر ہے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) { ثُمَّ جَعَلْنٰهُ نُطْفَةً فِيْ قَرَارٍ مَّكِيْنٍ :} اس میں آدم علیہ السلام کے بعد نسلِ انسانی کی پیدائش کا ذکر ہے، یعنی پھر اس مٹی کو یا مٹی سے بنی ہوئی اس مخلوق کو پانی کا ایک قطرہ بنا کر ایک نہایت محفوظ ٹھکانے (رحم مادر) میں رکھا۔ مٹی سے پانی کا قطرہ بنانا، جس میں مٹی کا نام و نشان نہیں اور اسے ماں کے رحم کے نہایت محفوظ ٹھکانے میں رکھ کر پانی کے قطرے کو نو (۹) ماہ میں مکمل انسان بنا دینا سب اس کی قدرت کا کمال ہے۔ {’’ قَرَارٍ مَّكِيْنٍ ‘‘} کی مزید تفسیر کے لیے دیکھیے سورۂ مرسلات (۲۰ تا ۲۲)۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً …:’’ عَلَقَةً ‘‘} کا معنی جمے ہوئے خون کا ٹکڑا بھی ہے اور جونک بھی۔ پھر اللہ تعالیٰ پانی کے سفید سیال قطرے کو سرخ جمے ہوئے خون کے جامد ٹکڑے کی شکل دے دیتا ہے جو جونک کی شکل کا ہوتا ہے اور جونک ہی کی طرح رحم کی دیوار کے ساتھ چپکا ہوا ہوتاہے۔ مزید دیکھیے سورۂ حج (۵)۔ ¤ ➋ { ثُمَّ اَنْشَاْنٰهُ خَلْقًا اٰخَرَ:} یعنی پھر ہم اس میں روح پھونکتے ہیں تو وہ نہایت خوب صورت دیکھنے، سننے، سمجھنے اور حرکت کرنے والا انسان بن جاتا ہے۔ جس کی شکل و صورت ہی اور ہوتی ہے۔ اب پہلی صورت کے ساتھ اس کی کوئی مناسبت نہیں، یعنی مٹی سے اس کا دور کا بھی کوئی تعلق نہیں، پہلے بے جان تھا اب جاندار ہے۔ پہلے اندھا، بہرا اور گونگا تھا اب آنکھ، کان اور زبان والا ہے۔ پہلے گوشت کا بے حس ٹکڑا تھا، اب اس کے ذرّے ذرّے میں اللہ تعالیٰ کی عجیب و غریب باریکیاں اور ہزاروں قسم کے احساسات ہیں۔ اس پر آنے والا ہر لمحہ نئی سے نئی تبدیلی لے کر آ رہا ہے، پہلے جنین پھر دودھ پیتا بچہ، جو پیدا ہوتے ہی اپنا اختیار استعمال کرنا شروع کر دیتا ہے، پھر لڑکا پھر نوجوان پھر جوان پھر ادھیڑ عمر پھر بوڑھا، پھر ایسا بوڑھا کہ بچپن کی کمزوری کی طرف پلٹ جاتا ہے۔ انھی منزلوں میں سے کسی منزل میں اسے موت اپنی آغوش میں لے لیتی ہے۔ ¤ ➌ { فَتَبٰرَكَ اللّٰهُ اَحْسَنُ الْخٰلِقِيْنَ :} اللہ تعالیٰ نے اس سے پہلے انسان کی پیدائش کا ذکر ایسے مدلل اور خوب صورت انداز میں فرمایا ہے کہ خود بخود یہ جملہ زبان پر آجاتا ہے : « فَتَبٰرَكَ اللّٰهُ اَحْسَنُ الْخٰلِقِيْنَ» ’’سو بہت برکت والاہے اللہ جو بنانے والوں میں سب سے اچھا ہے۔‘‘ حقیقت یہ ہے کہ یہ کسی کلام کی خوبی کی انتہا ہے۔ چنانچہ ایک شاعر نے چند قصیدوں کی تعریف کرتے ہوئے کہا ہے : ¤ {قَصَائِدٌ إِنْ تَكُنْ تُتْلٰي عَلٰي مَلَإٍ ¤ صُدُوْرُهَا عُلِمَتْ مِنْهَا قَوَافِيْهَا} ¤ ’’وہ ایسے قصیدے ہیں کہ لوگوں کے سامنے ان کے ابتدائی اشعار پڑھے جائیں تو ان کے آخری اشعار خود بخود معلوم ہو جاتے ہیں۔‘‘ غالب نے کیا خوب کہا ہے: ¤ دیکھنا تقریر کی لذت کہ جو اس نے کہا ¤ میں نے یہ جانا کہ گویا یہ بھی میرے دل میں ہے ¤ ➍ { الْخٰلِقِيْنَ :} یہاں {’’خَلْقٌ‘‘} کا لفظ ظاہری شکل و صورت بنانے کے معنی میں استعمال ہوا ہے، جیسا کہ عیسیٰ علیہ السلام کے متعلق فرمایا : { وَ اِذْ تَخْلُقُ مِنَ الطِّيْنِ كَهَيْـَٔةِ الطَّيْرِ بِاِذْنِيْ } [ المائدۃ : ۱۱۰ ] ’’اور جب تو مٹی سے پرندے کی شکل کی مانند میرے حکم سے بناتا تھا۔‘‘ اور جیسا کہ حدیث میں ہے کہ قیامت کے دن اللہ تعالیٰ تصویر بنانے والوں سے فرمائے گا : [ أَحْيُوْا مَا خَلَقْتُمْ ] [ بخاري، البیوع، باب التجارۃ فیما یکرہ… ۲۱۰۵، عن عائشۃ رضی اللہ عنھا ] ’’تم نے جو خلق کیا ہے اسے زندہ کرو۔‘‘ پیدا کرنے اور زندگی بخشنے کے معنی میں خالق صرف اللہ تعالیٰ ہے۔ ¤ ➍ {’’ اَحْسَنُ الْخٰلِقِيْنَ ‘‘} کے لفظ میں انسان کے حسن و جمال کی طرف بھی واضح اشارہ ہے۔ (بقاعی)"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) { ثُمَّ اِنَّكُمْ بَعْدَ ذٰلِكَ لَمَيِّتُوْنَ :} اگرچہ مٹی اور نطفے سے لے کر موت تک کا ہر لمحہ ہی موت کے بعد زندگی کا شاہد ہے، کیونکہ جسم کا ہر خلیہ جو موجود ہوتا ہے فنا ہوتا اور اس کی جگہ نیا خلیہ وجود میں آتا رہتا ہے اور یہ عمل مسلسل جاری رہتا ہے، جس کے دوران انسان بچپن، جوانی اور بڑھاپے کی طرف بھی منتقل ہوتا رہتا ہے، مگر موت و حیات کے اس سلسلے پر غور کرنے والے بہت ہی کم ہیں۔ اس لیے اللہ تعالیٰ نے موت کا وہ مرحلہ بیان فرمایا جو ہر شخص اپنے سر کی آنکھوں کے ساتھ دیکھتا ہے۔ چنانچہ {’’ ثُمَّ ‘‘} کے ساتھ اس مہلت کی طرف اشارہ فرمایا جو انسان کو پیدا ہونے کے بعد عمل کے لیے ملتی ہے اور {’’إِنَّ‘‘ } اور {’’لَام‘‘} کی تاکید کے ساتھ فرمایا کہ پھر زندگی کے سارے یا کچھ ادوار گزار کر آخر تمھیں ہر حال میں مرنا ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) { ثُمَّ اِنَّكُمْ يَوْمَ الْقِيٰمَةِ تُبْعَثُوْنَ :} انسانی زندگی کے مراحل کو بطور دلیل بیان کرکے اصل بات بیان فرمائی، جسے کافر ناممکن خیال کرتے تھے کہ پھر ایک مدت کے بعد یقینا تم دوبارہ زندہ کیے جاؤ گے۔ سورۂ حج میں واضح طور پر فرمایا : « يٰۤاَيُّهَا النَّاسُ اِنْ كُنْتُمْ فِيْ رَيْبٍ مِّنَ الْبَعْثِ فَاِنَّا خَلَقْنٰكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِنْ مُّضضْغَةٍ مُّخَلَّقَةٍ وَّ غَيْرِ مُخَلَّقَةٍ لِّنُبَيِّنَ لَكُمْ وَ نُقِرُّ فِي الْاَرْحَامِ مَا نَشَآءُ اِلٰۤى اَجَلٍ مُّسَمًّى ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْۤا اَشُدَّكُمْ وَ مِنْكُمْ مَّنْ يُّتَوَفّٰى وَ مِنْكُمْ مَّنْ يُّرَدُّ اِلٰۤى اَرْذَلِ الْعُمُرِ لِكَيْلَا يَعْلَمَ مِنْۢ بَعْدِ عِلْمٍ شَيْـًٔا وَ تَرَى الْاَرْضَ هَامِدَةً فَاِذَاۤ اَنْزَلْنَا عَلَيْهَا الْمَآءَ اهْتَزَّتْ وَ رَبَتْ  وَ اَنْۢبَتَتْ مِنْ كُلِّ زَوْجٍۭ بَهِيْجٍ » [ الحج : ۵ ] ’’اے لوگو! اگر تم اٹھائے جانے کے بارے میں کسی شک میں ہو تو بے شک ہم نے تمھیں حقیر مٹی سے پیدا کیا، پھر ایک قطرے سے، پھر کچھ جمے ہوئے خون سے، پھر گوشت کی ایک بوٹی سے، جس کی پوری شکل بنائی ہوئی ہے اور جس کی پوری شکل نہیں بنائی ہوئی، تاکہ ہم تمھارے لیے واضح کریں اور ہم جسے چاہتے ہیں ایک مقررہ مدت تک رحموں میں ٹھہرائے رکھتے ہیں، پھر ہم تمھیں ایک بچے کی صورت میں نکالتے ہیں، پھر تاکہ تم اپنی جوانی کو پہنچو اور تم میں سے کوئی وہ ہے جو قبض کر لیا جاتا ہے اور تم میں سے کوئی وہ ہے جو سب سے نکمی عمر کی طرف لوٹایا جاتا ہے، تاکہ وہ جاننے کے بعد کچھ نہ جانے۔ اور تو زمین کو مردہ پڑی ہوئی دیکھتا ہے، پھر جب ہم اس پر پانی اتارتے ہیں تو وہ لہلہاتی ہے اور ابھرتی ہے اور ہر خوبصورت قسم میں سے اگاتی ہے۔‘‘ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا بَيْنَ النَّفْخَتَيْنِ أَرْبَعُوْنَ، قَالُوْا يَا أَبَا هُرَيْرَةَ! أَرْبَعُوْنَ يَوْمًا؟ قَالَ أَبَيْتُ، قَالَ أَرْبَعُوْنَ سَنَةً؟ قَالَ أَبَيْتُ، قَالَ أَرْبَعُوْنَ شَهْرًا؟ قَالَ أَبَيْتُ، وَيَبْلَہ كُلُّ شَيْءٍ مِنَ الْإِنْسَانِ إِلَّا عَجْبَ ذَنَبِهِ، فِيْهِ يُرَكَّبُ الْخَلْقُ] [بخاري، التفسیر، باب قولہ : «و نفخ في الصور…» : ۴۸۱۴ ] ’’دو نفخوں کے درمیان چالیس کا عرصہ ہے؟‘‘ لوگوں نے کہا : ’’اے ابوہریرہ! چالیس دن کا؟‘‘ کہا : ’’میں نہیں مانتا۔‘‘ انھوں نے کہا : ’’چالیس سال کا؟‘‘ کہا : ’’میں نہیں مانتا۔‘‘ انھوں نے کہا : ’’چالیس ماہ کا؟‘‘ کہا : ’’میں نہیں مانتا۔‘‘ (کیونکہ دنیا کے ایام اور ماہ و سال کی بساط تو سورج کے ساتھ ہی لپیٹی جا چکی ہو گی) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اور انسان کی ی ہر چیز بوسیدہ ہو جائے گی، مگر اس کی دم کی ہڈی، اسی پر اس مخلوق کو جوڑا جائے گا۔‘‘"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { وَ لَقَدْ خَلَقْنَا فَوْقَكُمْ سَبْعَ طَرَآىِٕقَ:} اللہ تعالیٰ نے موت کے بعد زندگی کی دلیل کے طور پر انسان کی اپنی پیدائش کا ذکر فرمایا، جو غور کرنے والے کے لیے کافی تھی، مگر اس کے بعد اس سے بھی کہیں بڑی مخلوق آسمانوں اور زمین کا اور ان میں رکھی ہوئی نعمتوں کا ذکر فرمایا۔ قیامت کی دلیل کے طور پر اللہ تعالیٰ اکثر انسان کی پیدائش کے ذکر کے بعد آسمانوں اور زمین کی پیدائش کا ذکر فرماتا ہے اور اس سے پہلے یا بعد قیامت کا ذکر فرماتا ہے، جیسا کہ فرمایا : «ءَاَنْتُمْ اَشَدُّ خَلْقًا اَمِ السَّمَآءُ بَنٰىهَا (27) رَفَعَ سَمْكَهَا فَسَوّٰىهَا (28) وَ اَغْطَشَ لَيْلَهَا وَ اَخْرَجَ ضُحٰىهَا (38) وَ الْاَرْضَ بَعْدَ ذٰلِكَ دَحٰىهَا» [ النازعات : ۲۷ تا ۳۰ ] ’’کیا پیدا کرنے میں تم زیادہ مشکل ہو یا آسمان؟ اس نے اسے بنایا۔ اس کی چھت کو بلند کیا، پھر اسے برابر کیا ۔ اور اس کی رات کو تاریک کر دیا اور اس کے دن کی روشنی کو ظاہر کر دیا اور زمین، اس کے بعد اسے بچھا دیا۔‘‘ اسی طرح دیکھیے سورۂ مومن (۵۷) اور سورۂ سجدہ کی شروع کی آیات۔ ¤ ➋ { فَوْقَكُمْ :} زمین کے کسی حصے پر چلے جاؤ آسمان اوپر ہی ہو گا۔ ¤ ➌ {سَبْعَ طَرَآىِٕقَ:’’ طَرَآىِٕقَ ‘‘ ’’طَرِيْقَةٌ‘‘} کی جمع ہے۔ {’’طَارَقَ يُطَارِقُ‘‘} اور {’’أَطْرَقَ‘‘} کا معنی ایک دوسرے پر چڑھانا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تم ترکوں سے لڑو گے۔‘‘ پھر ان کی صفات بیان کرتے ہوئے فرمایا : [ كَأَنَّ وُجُوْهَهُمُ الْمَجَانُّ الْمُطَرَّقَةُ ] [ بخاري، الجہاد والسیر، باب قتال الترک : ۲۹۲۸ ] ’’ان کے چہرے (ایسے چوڑے ہوں گے) جیسے وہ ایسی ڈھا لیں ہیں جن پر چمڑا چڑھایا ہوا ہے۔‘‘ {’’طَارَقْتُ بَيْنَ الثَّوْبَيْنِ‘‘} ’’میں نے دو کپڑے اوپر تلے لیے۔‘‘ مطلب یہ ہے کہ یہ ساتوں آسمان ایک دوسرے کے اوپر ہیں، جیسا کہ فرمایا : « اَلَمْ تَرَوْا كَيْفَ خَلَقَ اللّٰهُ سَبْعَ سَمٰوٰتٍ طِبَاقًا » [ نوح : ۱۵ ] ’’کیا تم نے دیکھا نہیں کہ کس طرح اللہ نے سات آسمانوں کو اوپر تلے پیدا فرمایا۔‘‘ {’’طَرَقَ يَطْرُقُ ‘‘} (ن ){ ’’ضَرَبَ‘‘} کے معنی میں بھی آتا ہے، ہتھوڑے کو {’’اَلْمِطْرَقَةُ‘‘} اسی لیے کہتے ہیں۔ {’’طَرِيْقٌ‘‘} کا ایک معنی راستہ بھی ہے، کیونکہ وہ چلنے والوں کی ٹھوکر میں ہوتا ہے۔ آسمانوں کو {’’طَرِيْقَةٌ‘‘} اس لیے بھی کہتے ہیں کہ وہ فرشتوں کی آمد و رفت اور احکام الٰہی کے نزول اور اعمال کے اوپر جانے کے راستے ہیں، جیسا کہ فرمایا : «اَللّٰهُ الَّذِيْ خَلَقَ سَبْعَ سَمٰوٰتٍ وَّ مِنَ الْاَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْاَمْرُ بَيْنَهُنَّ لِتَعْلَمُوْۤا اَنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِييْرٌ وَّ اَنَّ اللّٰهَ قَدْ اَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا » [ الطلاق : ۱۲ ] ’’اللہ وہ ہے جس نے سات آسمان پیدا کیے اور زمین سے بھی ان کی مانند ۔ان کے درمیان حکم نازل ہوتا ہے، تاکہ تم جان لو کہ اللہ ہر چیز پر خوب قدرت رکھنے والا ہے اور یہ کہ اللہ نے یقینا ہر چیز کو علم سے گھیر رکھا ہے۔‘‘ ¤ ➍ { وَ مَا كُنَّا عَنِ الْخَلْقِ غٰفِلِيْنَ : ’’ كُنَّا ‘‘} استمرار (ہمیشگی) کے لیے ہے، اسی لیے ترجمہ میں ’’کبھی‘‘ کا اضافہ کیا گیا ہے۔ یعنی ایسا نہیں کہ انسانوں اور آسمانوں کو پیدا کرنے کے بعد ہم ان سے بے خبر اور بے تعلق ہو گئے ہوں، یا انھیں کسی داتا، دستگیر یا گنج بخش کے حوالے کر دیا ہو، نہیں، ایسا نہ کبھی تھا نہ ہو گا۔ ان کا وجود تو قائم ہی ہمارے علم اور ہماری قدرت کی بدولت ہے، جیسا کہ فرمایا : «يَعْلَمُ مَا يَلِجُ فِي الْاَرْضِ وَ مَا يَخْرُجُ مِنْهَا وَ مَا يَنْزِلُ مِنَ السَّمَآءِ وَ مَا يَعْرُجُ فِيْهَاا وَ هُوَ مَعَكُمْ اَيْنَ مَا كُنْتُمْ وَ اللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ » [ الحدید : ۴ ] ’’ وہ جانتا ہے جو چیز زمین میں داخل ہوتی ہے اور جو اس سے نکلتی ہے اور جو آسمان سے اترتی ہے اور جو اس میں چڑھتی ہے اور وہ تمھارے ساتھ ہے، جہاں بھی تم ہو اور اللہ اسے جو تم کرتے ہو خوب دیکھنے والا ہے۔‘‘ اور دیکھیے سورۂ انعام (۵۹)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ {وَ اَنْزَلْنَا مِنَ السَّمَآءِ مَآءًۢ بِقَدَرٍ:} آسمان کی پیدائش کے بعد اپنی مزید نعمتوں کا ذکر فرمایا۔ پانی بذات خود بہت بڑی نعمت ہے، جیسا کہ فرمایا : «{ وَ جَعَلْنَا مِنَ الْمَآءِ كُلَّ شَيْءٍ حَيٍّ }» [ الأنبیاء : ۳۰ ] ’’اور ہم نے پانی سے ہر زندہ چیز بنائی۔‘‘ اس آیت میں پانی اتارنے کی عظیم نعمت کے ذکر کے بعد اس کے متعلق تین باتیں فرمائیں، چنانچہ فرمایا کہ ہم نے آسمان سے ایک اندازے کے ساتھ کچھ پانی اتارا، جس سے انسان، حیوان، کھیت اور درخت سیراب ہو سکیں۔ میدانوں، صحراؤں اور پہاڑوں میں زندگی باقی رہ سکے اور سمندروں اور ندی نالوں کی ضرورت پوری ہو سکے، کیونکہ اگر اس مخصوص مقدار سے زیادہ بارش برستی تو سمندر خشکی پر چڑھ کر زندگی کا سلسلہ نیست و نابود کر دیتے اور اگر کم برستی تو انسان، حیوان، درخت اور کھیت زندہ نہ رہ سکتے۔ دوسری جگہ فرمایا کہ صرف پانی ہی نہیں، بلکہ اللہ تعالیٰ ہر چیز مخصوص مقدار میں اتارتا ہے، نہ ضرورت سے زیادہ نہ کم، جیسا کہ فرمایا : «{ وَ اِنْ مِّنْ شَيْءٍ اِلَّا عِنْدَنَا خَزَآىِٕنُهٗ وَ مَا نُنَزِّلُهٗۤ اِلَّا بِقَدَرٍ مَّعْلُوْمٍ }» [ الحجر : ۲۱ ] ’’اور کوئی بھی چیز نہیں مگر ہمارے پاس اس کے کئی خزانے ہیں اور ہم اسے نہیں اتارتے مگر ایک معلوم اندازے سے۔‘‘ ¤ مستدرک حاکم میں رسول اللہ صلی اللہ علیہ وسلم کی حدیث ہے : [ مَا مِنْ عَامٍ أَمْطَرَ مِنْ عَامٍ وَلٰكِنَّ اللّٰهَ يُصَرِّفُهُ حَيْثُ يَشَاءُ ثُمَّ قَرَأَ : «{ وَ لَقَدْ صَرَّفْنٰهُ بَيْنَهُمْ لِيَذَّكَّرُوْا }» الفرقان : ۵۰ ] [ مستدرک حاکم : 403/2، ح : ۳۵۲۰۔ سلسلۃ الأحادیث الصحیحۃ : 460/5، ح : ۲۴۶۱ ] ’’کوئی سال ایسا نہیں جس میں دوسرے کسی سال کی نسبت بارش زیادہ ہوتی ہو، لیکن اللہ تعالیٰ جہاں چاہتا ہے بارش میں کمی بیشی کرتا ہے۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی: ’’اور بلاشبہ یقینا ہم نے اسے ان کے درمیان پھیر پھیر کر بھیجا، تاکہ وہ نصیحت حاصل کریں۔‘‘ ¤ ➋ { فَاَسْكَنّٰهُ فِي الْاَرْضِ :} دوسری بات یہ کہ آسمانوں سے برسنے والا پانی اللہ کے حکم سے مختلف صورتوں میں زمین پر ٹھہر جاتا ہے۔ اس میں سے کچھ چشموں کی صورت میں نمودار ہو جاتا ہے، کچھ زیر زمین محفوظ ہو جاتا ہے، جسے لوگ کنووں وغیرہ کی صورت میں نکال کر استعمال کرتے ہیں، جیسا کہ فرمایا : «{ اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَآءِ مَآءً فَسَلَكَهٗ يَنَابِيْعَ فِي الْاَرْضِ }» [الزمر : ۲۱ ] ’’کیا تو نے نہیں دیکھا کہ اللہ نے آسمان سے کچھ پانی اتارا، پھر اسے چشموں کی صورت زمین میں چلایا۔‘‘ اور کچھ پانی ندی نالوں اور دریاؤں کی صورت اختیار کر جاتا ہے جس سے لوگ اپنی ضروریات پوری کرتے ہیں، خود پیتے ہیں، غسل کرتے ہیں، کپڑے وغیرہ دھوتے ہیں، جانوروں کو پلاتے ہیں، کھیتیاں اور باغات سیراب کرتے ہیں، جیسا کہ فرمایا : «{ اَنْزَلَ مِنَ السَّمَآءِ مَآءً فَسَالَتْ اَوْدِيَةٌۢ بِقَدَرِهَا }» [ الرعد : ۱۷] ’’اس نے آسمان سے کچھ پانی اتارا تو کئی نالے اپنی اپنی وسعت کے مطابق بہ نکلے۔‘‘ اور بارش کا کچھ پانی سمندر کی صورت میں ذخیرہ ہو جاتا ہے، جو دوبارہ بارش کا اور انسان کے بے شمار منافع و فوائد کا ذریعہ بنتا ہے۔ ¤ ➌ {وَ اِنَّا عَلٰى ذَهَابٍۭ بِهٖ لَقٰدِرُوْنَ :} تیسری بات یہ کہ جس طرح ہم نے پانی اتارا ہے اسے لے جا بھی سکتے ہیں، پھر کون ہے جو اسے واپس لا سکے؟ {’’ ذَهَابٍ‘‘} کی تنوین میں نکرہ کے عموم کی وجہ سے ترجمہ کیا ہے کہ ’’ہم اسے کسی بھی طرح لے جانے پر قادر ہیں۔‘‘ مثلاً ہم بارش روک دیں، یا برسنے والا پانی گندا کر دیں جو پینے اور استعمال کے قابل ہی نہ رہے، یا جس طرح یہ آکسیجن اور ہائیڈروجن کا مرکب ہے تو {’’كُنْ‘‘} کہہ کر اسے پھر گیس میں بدل دیں، یا زمین میں اتنا گہرا لے جائیں کہ تم نکال ہی نہ سکو، جیسا کہ فرمایا : « قُلْ اَرَءَيْتُمْ اِنْ اَصْبَحَ مَآؤُكُمْ غَوْرًا فَمَنْ يَّاْتِيْكُمْ بِمَآءٍ مَّعِيْنٍ » [ الملک : ۳۰ ] ’’کہہ دے کیا تم نے دیکھا اگر تمھارا پانی گہرا چلا جائے تو کون ہے جو تمھارے پاس بہتا ہوا پانی لائے گا؟‘‘ یا اسے سخت نمکین بنا دیں جو پیا ہی نہ جا سکے، جیسا کہ فرمایا : « اَفَرَءَيْتُمُ الْمَآءَ الَّذِيْ تَشْرَبُوْنَ (68) ءَاَنْتُمْ اَنْزَلْتُمُوْهُ مِنَ الْمُزْنِ اَمْ نَحْنُ الْمُنْزِلُوْنَ (69) لَوْ نَشَآءُ جَعَلْنٰهُ اُجَاجًا فَلَوْ لَا تَشْكُرُوْنَ » [ الواقعۃ : ۶۸ تا ۷۰ ] ’’پھر کیا تم نے دیکھا وہ پانی جو تم پیتے ہو؟ کیا تم نے اسے بادل سے اتارا ہے، یا ہم ہی اتارنے والے ہیں؟ اگر ہم چاہیں تو اسے سخت نمکین بنادیں، پھر تم شکر ادا کیوں نہیں کرتے؟‘‘ یا اس میں سے وہ برکت نکال لیں جو ان لوگوں کو عطا ہوتی ہے جنھیں ہم عطا کرنا چاہتے ہیں۔ یہ آیت سورۂ ملک کی آیت (۳۰) : « قُلْ اَرَءَيْتُمْ اِنْ اَصْبَحَ مَآؤُكُمْ غَوْرًا » سے زیادہ وسعت رکھتی ہے۔ صاحب روح المعانی نے زیر تفسیر آیت کے سورۂ ملک کی آیت سے زیادہ بلیغ ہونے کی اٹھارہ وجہیں ’’التقریب لتفسیر التحریر والتنویر للطاہر ابن عاشور‘‘ سے نقل کرنے کے بعد مزید بارہ وجہیں ذکر کرکے انھیں تیس تک پہنچا دیا ہے۔ صاحب ذوق حضرات وہاں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { فَاَنْشَاْنَا لَكُمْ بِهٖ جَنّٰتٍ :} پانی اتارنے کے ذکر کے بعد حیات بعد الموت پر دلالت کرنے والی چند چیزیں ذکر فرمائیں، پہلی یہ کہ ہم نے اس پانی کے ساتھ (اپنے لیے نہیں بلکہ) تمھارے لیے کئی قسم کے باغات پیدا فرمائے۔ ¤ ➋ { مِنْ نَّخِيْلٍ وَّ اَعْنَابٍ : ’’ نَخِيْلٍ ‘‘} کھجور کے درخت، {’’ اَعْنَابٍ ‘‘ ’’عِنَبٌ‘‘} کی جمع ہے، انگور کا پھل۔ کھجور اور انگور کا خصوصاً ذکر ان کے بے شمار فوائد کی وجہ سے فرمایا، کیونکہ انھیں دوسرے تمام پھلوں پر برتری حاصل ہے، جیسا کہ فرشتوں میں جبریل اور میکال کا خصوصاً الگ ذکر کیا، فرمایا : « مَنْ كَانَ عَدُوًّا لِّلّٰهِ وَ مَلٰٓىِٕكَتِهٖ وَ رُسُلِهٖ وَ جِبْرِيْلَ وَ مِيْكٰىلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلْكٰفِرِيْنَ» [ البقرۃ : ۹۸ ] ’’جو کوئی اللہ اور اس کے فرشتوں اور اس کے رسولوں اور جبریل اور میکال کا دشمن ہو تو بے شک اللہ کافروں کا دشمن ہے۔‘‘ اور اس لیے بھی کہ عرب میں یہ دونوں پھل زیادہ پائے جاتے ہیں۔ انگور کے پھل کے ذکر سے پہلے کھجور کے پھل کے بجائے اس کے درخت کا ذکر فرمایا، کیونکہ کھجور کا درخت پھل کے علاوہ بھی بہت سے فوائد رکھتا ہے۔ اس کا ہر حصہ کارآمد ہے، اللہ تعالیٰ نے اسے شجرۂ طیبہ قرار دے کر کلمہ طیبہ کی مثال اس کے ساتھ دی ہے، فرمایا : « اَلَمْ تَرَ كَيْفَ ضَرَبَ اللّٰهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ» [ إبراھیم  : ۲۴ ] ’’کیا تو نے نہیں دیکھا کہ اللہ نے ایک پاکیز ہ کلمہ کی مثال کیسے بیان فرمائی (کہ وہ) ایک پاکیزہ درخت کی طرح ہے۔‘‘ کھجور کے درخت کے ضمن میں وہ تمام درخت بھی آ گئے جن کے پھل پھول، پتے، چھال اور لکڑی ہر چیز کارآمد ہے۔ ¤ ➌ {لَكُمْ فِيْهَا فَوَاكِهُ كَثِيْرَةٌ … :} اللہ تعالیٰ اپنے احسانات کی طرف توجہ دلانے کے لیے بار بار {’’ لَكُمْ ‘‘} کا لفظ دہرا رہے ہیں کہ یہ سب کچھ تمھارے لیے ہے، ہمارے لیے نہیں، یعنی تمھارے لیے ان باغات میں کھجور کے درختوں اور انگوروں کے علاوہ بہت سے لذیذ پھل ہیں۔ ¤ ➍ { وَ مِنْهَا تَاْكُلُوْنَ :} اس جملے کے جملہ اسمیہ پر عطف سے معلوم ہوتا ہے کہ اس سے پہلے ایک جملہ فعلیہ محذوف ہے : {’’أَيْ مِنْهَا «وَ هِيَ طَرِيَّةٌ» تَتَفَكَّهُوْنَ وَ مِنْهَا تَأْكُلُوْنَ‘‘} یعنی تم ان کے بعض سے تازہ ہونے کی حالت میں لذت حاصل کرتے ہو اور خشک کرکے یا رس اور روغن نکال کر بعد میں بھی اور یہی تمھاری خوراک کا ایک حصہ بنتے ہیں۔ (بقاعی) {’’ مِنْهَا تَاْكُلُوْنَ ‘‘} میں یہ بھی شامل ہے کہ انھی کی آمدنی سے سارا سال تمھارے کھانے پینے اور دوسری ضروریات زندگی کا بند و بست ہوتا ہے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { وَ شَجَرَةً تَخْرُجُ مِنْ طُوْرِ سَيْنَآءَ :} طور ایک مخصوص پہاڑ کا نام ہے۔ طور کا معنی پہاڑ بھی ہے۔ بعض نے کہا کہ طور وہ پہاڑ ہے جس پر درخت اگتے ہوں۔ سیناء اس پہاڑ کا نام ہے، جیسا کہ جبلِ احد کہتے ہیں، یا {’’جَبَلَا طَيْءٍ‘‘} (بنو طے کے دو پہاڑ) کہتے ہیں۔ امام طبری نے فرمایا : ’’اور ہم نے تمھارے لیے وہ درخت بھی پیدا کیا جو طور سیناء سے نکلتا ہے، یعنی اس پہاڑ سے جس پر درخت اگتے ہیں۔ مراد زیتون کا درخت ہے۔‘‘ اعراب القرآن و بیانہ از درویش میں ہے : ’’سیناء ایک شبہ جزیرہ ہے، جس کی حد شمال میں بحر ابیض متوسط ہے اور مغرب میں نہر سویز اور خلیج سویز ہے اور مشرق میں فلسطین اور خلیج عقبہ ہے اور جنوب میں وہ بحر احمر میں ’’رأس محمد ‘‘ کے پاس ختم ہوتا ہے اور سیناء ایک پہاڑ ہے جو شبہ جزیرہ سیناء میں جنوب کی طرف واقع ہے اور درخت سے مراد زیتون کا درخت ہے اور اسے طور سیناء کے ساتھ اس لیے خاص کیا گیا ہے کہ اس کا اصل وطن وہ ہے جہاں سے وہ دوسرے مقامات پر منتقل ہوا۔‘‘ کھجور اور انگور کے بعد زیتون کا خصوصیت کے ساتھ ذکر اس کے کثیر فوائد کی وجہ سے فرمایا۔ شام اور فلسطین اس کا اصلی وطن ہیں اور وہاں کا زیتون بہت عمدہ ہوتا ہے۔ شام میں زیتون اتنی کثرت سے ہے کہ گھروں، کھیتوں اور سڑکوں کے کناروں وغیرہ پر خود بخود اگا ہوا ملتا ہے۔ اس درخت کی عمر بہت زیادہ ہوتی ہے۔ بعض مفسرین نے لکھا ہے : ’’یہ ڈیڑھ دو ہزار برس تک چلتا ہے، حتیٰ کہ فلسطین کے بعض درختوں کا قد و قامت اور پھیلاؤ دیکھ کر اندازہ کیا گیا ہے کہ وہ عیسیٰ علیہ السلام کے زمانے سے اب تک چلے آ رہے ہیں۔‘‘ (واللہ اعلم) ¤ سورۂ نور میں اللہ تعالیٰ نے اسے شجرۂ مبارکہ قرار دیا ہے، اس کے تیل کی تعریف میں فرمایا : « يَكَادُ زَيْتُهَا يُضِيْٓءُ وَ لَوْ لَمْ  تَمْسَسْهُ نَارٌ » [ النور : ۳۵ ] ’’اس کا تیل قریب ہے کہ روشن ہو جائے، خواہ اسے آگ نے نہ چھوا ہو۔‘‘ اور سورۃ التین میں اس کی قسم کھائی ہے۔ ¤ ➋ { تَنْۢبُتُ بِالدُّهْنِ وَ صِبْغٍ لِّلْاٰكِلِيْنَ :} زیتون میں اللہ تعالیٰ کی نعمت اور اس کی قدرت کا کمال دیکھیے کہ پانی سے سیراب ہوتا ہے اور اپنے ہمراہ تیل کا خزانہ اور کھانے والوں کے لیے ایک طرح کا سالن لے کر اگتا ہے۔ {’’ صِبْغٍ ‘‘} نکرہ ہے، اس لیے ترجمہ ’’ایک طرح کا سالن‘‘ کیا گیا ہے، کیونکہ سالن بے شمار ہیں اور اس سے عمدہ اور لذیذ بھی ہیں۔ (بقاعی) اس کا تیل کھانا پکانے، سالن کے طور پر کھانے، جسم پر لگانے اور دوسری ضروریات میں کام آتا ہے اور اس کا پھل اچار کی صورت میں بھی کھانے کے کام آتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كُلُوا الزَّيْتَ وَادَّهِنُوْا بِهِ فَإِنَّهُ مِنْ شَجَرَةٍ مُبَارَكَةٍ ] [ ترمذي، الأطعمۃ، باب ما جاء في أکل الزیت : ۱۸۵۱۔ صححہ الألباني في الصحیحۃ : ۳۷۹ ] ’’زیتون کھاؤ اور اس کا تیل استعمال کرو، کیونکہ یہ ایک مبارک درخت سے ہے۔‘‘ ابن حبان نے فرمایا : ’’کھجور، انگور اور زیتون کا خاص طور پر اس لیے ذکر فرمایا: {’’لِأَنَّهَا أَكْرَمُ الشَّجَرِ وَ أَجْمَعُهَا لِلْمُنَافِعِ‘‘} ’’کیونکہ یہ تمام درختوں سے زیادہ عمدہ ہیں اور سب سے زیادہ فوائد کے جامع ہیں۔‘‘ [ البحر المحیط ] ¤ ➌ اگرچہ یہاں صرف زیتون کا ذکر کیا گیا ہے، مگر اس کے ضمن میں وہ تمام درخت اور پودے بھی آ گئے جن سے انسان اپنی روغنیات کی ضرورت حاصل کرتا ہے اور جنھیں کھانے کے لازمہ کے طور پر استعمال کرتا ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { وَ اِنَّ لَكُمْ فِي الْاَنْعَامِ لَعِبْرَةً :} پچھلی آیات میں پانی کے ساتھ پیدا ہونے والی نباتات کا ذکر فرمایا، جس میں موت کے بعد زندگی کی دلیل اور اللہ تعالیٰ کی نعمتوں کی یاد دہانی ہے۔ اب موت کے بعد زندگی کا یقین دلانے کے لیے اور اپنی نعمتوں اور قدرتوں کا احساس دلانے کے لیے نباتات سے اعلیٰ درجے کی زندگی والی مخلوق کا ذکر فرمایا، جو روح رکھنے والے چوپائے ہیں۔ {’’ لَعِبْرَةً ‘‘} میں تنوین تعظیم کی ہے، اس لیے ترجمہ ’’بڑی عبرت‘‘ کیا ہے۔ ¤ ➋ { نُسْقِيْكُمْ مِّمَّا فِيْ بُطُوْنِهَا :} اس کی تفصیل سورۂ نحل (۶۶) میں دیکھیے۔ ¤ ➌ { وَ لَكُمْ فِيْهَا مَنَافِعُ كَثِيْرَةٌ :} اس کی تفصیل کے لیے دیکھیے سورۂ انعام (۱۴۲)، سورۂ نحل (۵ تا ۸، ۶۶، ۸۰)، سورۂ حج (۲۷، ۲۸، ۳۲، ۳۳، ۳۶، ۳۷) اور سورۂ مومن (۷۹)۔ ¤ ➍ { وَ مِنْهَا تَاْكُلُوْنَ :} یعنی تم ان کا گوشت کھاتے ہو اور وہ چوپائے خرید و فروخت کے ذریعے سے تمھارے کھانے پینے اور ضروریات زندگی کی اشیاء حاصل کرنے کا ذریعہ ہیں۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) {وَ عَلَيْهَا وَ عَلَى الْفُلْكِ تُحْمَلُوْنَ : ’’ عَلَيْهَا ‘‘} (ان پر) سے مراد اونٹ ہیں، جو صحرا کے جہاز ہیں۔ عرب میں سواری اور بار برداری کے لیے زیادہ تر اونٹ ہی استعمال ہوتے تھے اور اونٹوں کے لیے ’’خشکی کے جہاز‘‘ کا استعارہ قدیم زمانے سے معروف ہے۔ ذو الرُّمّہ شاعر اپنی اونٹنی کے متعلق کہتا ہے: ¤ { طُرُوْقًا وَجُلْبُ الرَّحْلِ مَشْدُوْدَةٌ بِهَا ¤ سَفِيْنَةُ بَرٍّ تَحْتَ خَدِّيْ زِمَامُهَا} ¤ ’’رات کا وقت تھا اور {’’جُلْبُ الرَّحْلِ‘‘} (پالان کی لکڑیوں) کے ساتھ خشکی کا جہاز بندھا ہوا تھا، جس کی مہار میرے رخسار کے نیچے تھی۔‘‘ (اضواء البیان) ¤ خشکی کے جہازوں کی مناسبت سے بحری جہازوں کی نعمت کا ذکر بھی فرما دیا ہے۔ ’’سوار ہوتے ہو‘‘ کے بجائے ’’سوار کیے جاتے ہو ‘‘ کا مطلب یہ ہے کہ اونٹ (اور ہاتھی) جیسے عظیم الجثّہ جانوروں پر سوار ہونا اور انھیں اپنا تابع فرمان بنانا تمھارے بس کی بات نہیں، بلکہ ان پر سوار کرنا اور انھیں تمھارے تابع فرمان بنا دینا ہمارا کام ہے، یقین نہ ہو تو ان سے بدرجہا چھوٹے جانوروں، مثلاً ہرن، بھیڑیے، لومڑی، گیدڑ اور چیتے وغیرہ کو ان کی طرح مانوس کرکے دکھاؤ۔ اسی طرح ہماری عظیم الشان مخلوق سمندر کہ جس کے مقابلے میں تم اتنے بھی نہیں جتنا صحرا کے مقابلے میں ریت کا ذرہ، اس پر سوار ہونا اور اس کا تمھیں اپنے سینے پر اٹھائے رکھنا تمھارے بس کی بات نہیں، یہ تو ہم ہیں جو تمھیں کشتیوں میں سوار کرکے اسے تمھارے تابع کر دیتے ہیں، اگر یقین نہ ہو تو ان طوفانوں کو یاد کرو جن کی بلاخیزی سے پہاڑوں جیسے جہاز آنکھ جھپکنے میں اس کی آغوش میں ڈوب جاتے ہیں۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ { وَ لَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ:} توحید و قیامت کے دلائل اور اپنی عظیم الشان نعمتوں کا ذکر کرنے کے بعد ان کا انکار کرنے والی اور رسولوں کو جھٹلانے والی قوموں کے انجام بد کا اور اپنے رسولوں کی نصرت کا ذکر فرمایا۔ اس سلسلے میں سب سے پہلے نوح علیہ السلام اور ان کی قوم کا ذکر فرمایا، کیونکہ زمین والوں کی طرف سب سے پہلے رسول وہی تھے اور نعمتوں کے تذکرے سے بات کا رخ نوح علیہ السلام کی طرف نہایت خوب صورت طریقے سے موڑا کہ آخری نعمت جو ذکر فرمائی وہ انسانوں کو کشتیوں پر سوار کرنا تھی اور سب سے پہلے کشتی کے سوار نوح علیہ السلام اور ان کے مومن ساتھی تھے، بعد میں تمام کشتیاں اسی کی طرز پر بنیں۔ (دیکھیے سورۂ یٰس : ۴۱ تا ۴۳) اس لیے کشتیوں کے بعد ان کا ذکر فرمایا۔ ¤ ➋ انعامات اور دلائل توحید بیان کرنے کے بعد آگے انبیاء اور ان قوموں کے حالات بیان فرمائے جنھوں نے اللہ تعالیٰ کی ان نعمتوں میں غور و فکر کے بجائے احسان فراموشی اور تکبر سے کام لیا، تو ان پر اللہ تعالیٰ کا عذاب آ گیا۔ اس میں قریش اور دوسرے تمام کفار کو ڈرانا اور رسول اللہ صلی اللہ علیہ وسلم کو تسلی دینا مقصود ہے۔ قرآن میں عموماً {’’ آلَاءُ اللّٰهِ ‘‘} (اللہ کی نعمتوں) کے بعد{ ’’ أَيَّامُ اللّٰهِ ‘‘ } کا بیان ہوتا ہے، تاکہ لوگ نصیحت حاصل کریں۔ ¤ ➌ { ’’ اِلٰى قَوْمِهٖ ‘‘} سے معلوم ہوا کہ نوح علیہ السلام صرف اپنی قوم کی طرف مبعوث ہوئے تھے، یہ الگ بات ہے کہ اس وقت موجود ہی ان کی قوم تھی۔ تمام انسانوں اور جنوں کی طرف مبعوث ہونا صرف ہمارے رسول صلی اللہ علیہ وسلم کا خاصہ ہے۔ ¤ ➍ { فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ : ’’ يٰقَوْمِ ‘‘} اصل میں {’’يَا قَوْمِيْ‘‘} ہے ’’اے میری قوم!‘‘ کتنی محبت اور نرمی سے خطاب فرمایا ہے، پھر فرمایا : ’’اللہ کی عبادت کرو۔‘‘ ہر پیغمبر کی دعوت یہی رہی ہے۔ (دیکھیے سورۂ انبیاء : ۲۵) نوح علیہ السلام کے واقعات کے لیے سورۂ اعراف (۵۹ تا ۶۴)، یونس (۷۱ تا ۷۳)، بنی اسرائیل (۳) اور سورۂ انبیاء (۷۶، ۷۷) بھی ملاحظہ فرمائیں۔ ¤ ➎ {مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ : ’’ مِنْ ‘‘} کے ساتھ معبودوں کے عموم کی تاکید ہے، اس لیے ترجمہ ہو گا ’’اس کے سوا تمھارا کوئی بھی معبود نہیں۔‘‘ یہ جملہ {’’ اعْبُدُوا اللّٰهَ ‘‘} کی علت ہے، یعنی اللہ کی عبادت کرو، کیونکہ اس کے سوا تمھارا کوئی بھی معبود نہیں۔ جب اور کوئی بھی معبود نہیں تو عبادت کیسی؟ ¤ ➏ { اَفَلَا تَتَّقُوْنَ :} یعنی کیا اللہ کے ساتھ شریک بناتے ہوئے تم اس سے اور اس کے عذاب سے ڈرتے نہیں۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { فَقَالَ الْمَلَؤُا الَّذِيْنَ كَفَرُوْا مِنْ قَوْمِهٖ :} معلوم ہوتا ہے کہ اس قوم کے واضح طور پر الگ الگ قبیلے تھے اور نوح علیہ السلام کا اپنا قبیلہ انکار میں پیش پیش تھا۔ اس لیے انکار اور اعتراض کے اپنوں کی طرف سے ہونے کی شناعت کو واضح کرنے کے لیے {’’ مِنْ قَوْمِهٖ ‘‘} فرمایا۔ (بقاعی) اس میں ہمارے رسول صلی اللہ علیہ وسلم کے لیے تسلی ہے، کیونکہ آپ کی سخت ترین مخالفت آپ کے قریب ترین رشتہ دار ابولہب نے کی۔ (دیکھیے سورۂ لہب) اایک شاعر نے کہا : ¤ {وَ ظُلْمُ ذَوِي الْقُرْبٰي أَشَدُّ مَضَاضَةً ¤ عَلَي الْمَرْئِ مِنْ وَقْعِ الْحُسَامِ الْمُهَنَّدِ} ¤ ’’اور قرابت والوں کا ظلم تکلیف میں آدمی پر ہندی تلوار لگنے سے بھی زیادہ ہوتا ہے۔‘‘ ¤ ➋ {مَا هٰذَاۤ اِلَّا بَشَرٌ مِّثْلُكُمْ :} مفسر رازی نے فرمایا : ’’اللہ تعالیٰ نے ان لوگوں کے پانچ شبہات ذکر فرمائے، مگر جواب کسی کا نہیں دیا، کیونکہ معمولی سے غور کے ساتھ ان کا بے کار ہونا سمجھ میں آ جاتا ہے۔‘‘ ان کا پہلا شبہ یہ تھا کہ یہ تو تمھارے جیسا بشر ہے۔ بقاعی نے فرمایا : ’’انھوں نے کسی انسان کا نبی ہونا نہیں مانا تو لازم تھا کہ کسی مٹی کا انسان ہونا بھی نہ مانتے، پانی کے کسی قطرے کا علقہ ہونا اور خون کی کسی پھٹکی کا مضغہ ہونا بھی نہ مانتے… ۔‘‘ ابن جَزیّ نے التسہیل میں فرمایا : ’’کس قدر تعجب ہے کہ انھوں نے بشر کے رسول ہونے کو نہیں مانا، مگر پتھر کے رب ہونے کو مان لیا۔‘‘ مشرک کی عقل ایسی ہی ہوتی ہے، ہمارے زمانے کے بعض لوگ جو جدّی پشتی مسلمان ہیں، آبا و اجداد سے سن کر محمد صلی اللہ علیہ وسلم کو نبی مانتے ہیں مگر بشر نہیں مانتے۔ پہلے لوگوں کا کہنا تھا کہ بشر رسول نہیں ہو سکتا اور ان کا کہنا ہے کہ رسول بشر نہیں ہو سکتا۔ نتیجہ دونوں باتوں کا ایک ہی ہے۔ قرآن نے بشر کے رسول نہ ہونے یا رسول کے بشر نہ ہونے کا بار بار رد فرمایا ہے۔ دیکھیے سورۂ اعراف (۶۳ تا ۶۹)، یونس (۲)، ہود (۲۷ تا ۳۱)، یوسف (۱۰۹)، رعد (۳۸)، ابراہیم (۱۰، ۱۱)، نحل (۴۳)، بنی اسرائیل (۹۴، ۹۵)، کہف (۱۱۰)، انبیاء (۳)، مومنون (۳۳، ۳۴، ۴۷)، فرقان (۷ تا ۲۰)، شعراء (۱۵۴، ۱۸۶) اور سورۂ یٰس (۱۵)۔ ¤ ➌ { يُرِيْدُ اَنْ يَّتَفَضَّلَ عَلَيْكُمْ:} یہ دوسرا شبہ ہے جو کافر سرداروں نے انبیاء کو عوام میں بے وقعت بنانے کے لیے پیش کیا کہ یہ تم پر برتری حاصل کرنا چاہتا ہے۔ اکثر کفار نے اپنے اپنے انبیاء کے بارے میں یہی بات کہی کہ یہ اقتدار کے بھوکے ہیں۔ فرعون اور اس کے سرداروں نے موسیٰ اور ہارون علیھما السلام کو یہ طعنہ دیا تھا : « قَالُوْۤا اَجِئْتَنَا لِتَلْفِتَنَا عَمَّا وَجَدْنَا عَلَيْهِ اٰبَآءَنَا وَ تَكُوْنَ لَكُمَا الْكِبْرِيَآءُ فِي الْاَرْضِ» [ یونس : ۷۸ ] ’’انھوں نے کہا کیا تو ہمارے پاس اس لیے آیا ہے کہ ہمیں اس راہ سے پھیر دے جس پر ہم نے اپنے باپ دادا کو پایا ہے اور اس سر زمین میں تم دونوں ہی کو بڑائی مل جائے؟‘‘ گویا سرداری اور برتری ان مشرکوں ہی کا مادری و پدری ورثہ ہے، یہ کسی اور کا حق نہیں۔ جواب اس اعتراض کا یہ ہے کہ اگر رسول اپنے منصب کی وجہ سے برتری چاہتے ہیں تو برتری کا حامل ہونا ان کا حق ہے، تاکہ کسی کو ان کے اتباع میں عار نہ ہو اور اگر وہ تکبر اور فخر و غرور کے لیے برتری چاہتے ہیں تو یہ ان پر بہتان ہے، کیونکہ ان سے بڑھ کر کوئی متواضع نہیں ہوتا۔ ¤ ➍ { وَ لَوْ شَآءَ اللّٰهُ لَاَنْزَلَ مَلٰٓىِٕكَةً :} یہ تیسرا اعتراض ہے۔ اس سے معلوم ہوا کہ وہ اللہ کو مانتے تھے، مگر اس کے ساتھ شریک ٹھہراتے تھے۔ نوح علیہ السلام کی طرف سے ایک اللہ کی عبادت کا حکم سن کر بہانہ گھڑا کہ اگر اللہ چاہتا کہ کوئی رسول بھیجے تو وہ انسان کے بجائے کوئی فرشتے بھیج دیتا۔ یہ بھی درحقیقت بشر کی نبوت سے انکار ہے۔ انھوں نے یہ نہیں سوچا کہ مالک مرضی والا ہے، وہ جسے چاہے، جس کام کے لیے چاہے چن لیتا ہے۔ وہ مالک ہی کیا ہوا جو تمھارے چاہنے ککا پابند ہو۔ ¤ ➎ {مَّا سَمِعْنَا بِهٰذَا فِيْۤ اٰبَآىِٕنَا الْاَوَّلِيْنَ :} یہ چوتھا اعتراض ہے۔ اس سے معلوم ہوتا ہے کہ نوح علیہ السلام سے پہلے جاہلیت کا طویل عرصہ گزرا تھا۔ پہلی تینوں باتوں میں نوح علیہ السلام کے رسول ہونے کا انکار تھا اور یہ اس دعوت کا انکار ہے جو نوح علیہ السلام لے کر آئے تھے۔ یعنی اللہ کے سوا کسی کی عبادت نہ کرنے کی بات ہم نے نہیں سنی اور نہ یہ سنا ہے کہ اللہ کا قرب حاصل کرنے کے لیے یا سفارشی بنانے کے لیے بھی کسی کی عبادت نہ کی جائے۔ کفار کے سرداروں کی یہ بات بھی اس لیے جواب کے قابل نہیں کہ اس کی بنیاد تقلید ہے، جب کہ تقلید سراسر جہل ہے اور جاہلوں کا جواب خاموشی اور سلام متارکہ ہے، جیسا کہ فرمایا : « وَ اِذَا خَاطَبَهُمُ الْجٰهِلُوْنَ قَالُوْا سَلٰمًا» [ الفرقان : ۶۳ ] ’’اور جب جاہل لوگ ان سے بات کرتے ہیں تو وہ کہتے ہیں سلام ہے۔‘‘ (دیکھیے بقرہ : ۱۷۰) بھلا بتاؤ اس سے بڑی جہالت کیا ہو گی کہ جو چیز ہم نے سنی نہیں وہ ہے ہی نہیں؟"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ { اِنْ هُوَ اِلَّا رَجُلٌۢ بِهٖ جِنَّةٌ:’’ جِنَّةٌ ‘‘} جنون، دیوانگی۔ ان کی پانچویں بات یہ بہتان ہے جو انھوں نے لگایا، یعنی اس کا یہ کہنا کہ مجھے اللہ تعالیٰ نے رسول بنایا ہے، پھر وہ بات کہنا جو ہم نے کبھی سنی ہی نہیں کہ بتوں کی عبادت مت کرو، صرف اللہ کی عبادت کرو اور دن رات اسی کی تبلیغ میں لگے رہنا، نہ کاروبار کا خیال، نہ پوری قوم کی مخالفت کی پروا، درحقیقت اسے ایک جنون لاحق ہے، دیوانگی ہے جو اس سے یہ سب کچھ کرواتی ہے۔ حقیقت یہ ہے کہ مومن کی نظر میں کافر جو کچھ کرتا ہے سراسر دیوانگی ہے کہ ساری جد و جہد چند روزہ زندگی کے لیے کرتا ہے، ہمیشہ کی زندگی کی اسے فکر ہی نہیں اور پیدا کرنے والے کے ساتھ ان لوگوں کو پکارتا اور ان کی عبادت کرتا ہے جنھوں نے نہ کچھ پیدا کیا اور نہ وہ کچھ اختیار رکھتے ہیں۔ اسی طرح کافر کی نظر میں مومن کے کام دیوانگی ہیں کہ نقد کو چھوڑ کر ادھار کے پیچھے پڑا ہے، نظر نہ آنے والے رب سے ڈر کر اپنی محبوب خواہشیں ترک کیے ہوئے ہے۔ {’’ جِنَّةٌ ‘‘} میں تنوین تنکیر کی ہے، یعنی اسے ایک قسم کا جنون لاحق ہے۔ مکمل پاگل کہنے کے بجائے کچھ جنون کہا، تاکہ ہر شخص انھیں جھٹلا نہ دے کہ بھلا اتنا کامل عقل والا شخص دیوانہ ہو سکتا ہے؟ ابن جزی فرماتے ہیں : ’’ان کی باتوں کا باہمی تضاد دیکھیے، ابھی کہہ رہے تھے کہ یہ شخص (اتنی صلاحیتوں کا مالک ہے کہ) تم پر برتری حاصل کرنا چاہتا ہے اور ابھی کہتے ہیں کچھ دیوانگی میں مبتلا ہے۔‘‘ ¤ ➋ { فَتَرَبَّصُوْا بِهٖ حَتّٰى حِيْنٍ :} یعنی اس کے متعلق کچھ مدت انتظار کرو، حتیٰ کہ یہ زمانے کے کسی چکر کی لپیٹ میں آ جائے، یا فوت ہو جائے اور تمھاری جان چھوٹ جائے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) { قَالَ رَبِّ انْصُرْنِيْ بِمَا كَذَّبُوْنِ :} درحقیقت یہ قوم پر عذاب کی دعا ہے۔ نوح علیہ السلام نے یہ بد دعا کب کی اور کن الفاظ میں کی، اس کے لیے دیکھیے سورۂ قمر (۹، ۱۰)، سورۂ شعراء (۱۱۷، ۱۱۸) اور سورۂ نوح (۲۶، ۲۷)۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) { فَاَوْحَيْنَاۤ اِلَيْهِ اَنِ اصْنَعِ الْفُلْكَ … :} اس آیت کی تفسیر سورۂ ہود (۳۷) میں دیکھیں۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ {فَاِذَا اسْتَوَيْتَ اَنْتَ وَ مَنْ مَّعَكَ عَلَى الْفُلْكِ …:} کشتی پر سوار ہو کر اللہ تعالیٰ کی حمد کا حکم دیا اور اس کے الفاظ خود بتائے، جیسے آدم علیہ السلام کو خود دعا سکھائی اور جیسے قیامت کے دن ہمارے نبی صلی اللہ علیہ وسلم کو حمد سکھائیں گے۔ دوسری جگہ چوپاؤں اور کشتیوں کے متعلق فرمایا : «{ وَ جَعَلَ لَكُمْ مِّنَ الْفُلْكِ وَ الْاَنْعَامِ مَا تَرْكَبُوْنَ (12) لِتَسْتَوٗا عَلٰى ظُهُوْرِهٖ ثُمَّ تَذْكُرُوْا نِعْمَةَ رَبِّكُمْ اِذَا اسْتَوَيْتُمْ عَلَيْهِ وَ تَقُوْلُوْا سُبْحٰنَ الَّذِيْ سَخَّرَ لَنَا هٰذَا وَ مَا كُنَّا لَهٗ  مُقْرِنِيْنَۙ (13) وَ اِنَّاۤ اِلٰى رَبِّنَا لَمُنْقَلِبُوْنَ۠}» [ الزخرف : ۱۲ تا ۱۴ ] ’’اور تمھارے لیے وہ کشتیاں اور چوپائے بنائے جن پر تم سوار ہوتے ہو۔ تاکہ تم ان کی پیٹھوں پر جم کر بیٹھو، پھر اپنے رب کی نعمت یاد کرو، جب ان پر جم کر بیٹھ جاؤ اور کہو پاک ہے وہ جس نے اسے ہمارے لیے تابع کر دیا، حالانکہ ہم اسے قابو میں لانے والے نہیں تھے ۔ اور بے شک ہم اپنے رب کی طرف ضرور لوٹ کر جانے والے ہیں۔‘‘ رسول اللہ صلی اللہ علیہ وسلم سواری پر سوار ہو کر یہ دعا پڑھتے تھے : [اَللّٰهُ أَكْبَرُ، اَللّٰهُ أَكْبَرُ، اَللّٰهُ أَكْبَرُ، سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هٰذَا وَ مَا كُنَّا لَهُ مُقْرِنِيْنَ وَ إِنَّا إِلٰی رَبِّنَا لَمُنْقَلِبُوْنَ، اَللّٰهُمَّ إِنَّا نَسْئَلُكَ فِيْ سَفَرِنَا هٰذَا الْبِرَّ وَالتَّقْوٰی وَ مِنَ الْعَمَلِ مَا تَرْضٰی، اَللّٰهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هٰذَا وَاطْوِ عَنَّا بُعْدَهُ، اَللّٰهُمَّ أَنْتَ الصَّاحِبُ فی السَّفَرِ والْخَلِيْفَةُ فِی الْأَهْلِ، اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ وَعْثَآءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَ سُوْٓءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ ] ’’اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، پاک ہے وہ جس نے اسے ہمارے لیے مسخر کر دیا، حالانکہ ہم اسے ملنے والے نہیں تھے اور یقینا ہم اپنے رب کی طرف پلٹنے والے ہیں۔ اے اللہ! ہم اپنے اس سفر میں تجھ سے نیکی اور تقویٰ کا سوال کرتے ہیں اور اس عمل کا جسے تو پسند کرے سوال کرتے ہیں۔ اے اللہ! ہمارا یہ سفر ہم پر آسان فرما دے اور ہم سے اس کی دوری کم کر دے۔ اے اللہ! تو ہی سفر میں ساتھی اور گھر والوں میں نائب ہے۔ اے اللہ! میں تجھ سے سفر کی مشقت سے اور مال اور اہل میں منظر کے غم سے اور ناکام لوٹنے کی برائی سے تیری پناہ چاہتا ہوں۔‘‘ اور جب رسول اللہ صلی اللہ علیہ وسلم سفر سے واپس آتے تو یہی دعا پڑھتے، البتہ یہ الفاظ زیادہ کہتے : [ آئِبُوْنَ، تَائِبُوْنَ، عَابِدُوْنَ لِرَبِّنَا حَامِدُوْنَ ] [ مسلم، الحج، باب استحباب الذکر إذا رکب … : ۱۳۴۲ ] ’’ہم واپس لوٹنے والے، توبہ کرنے والے، عبادت کرنے والے اور اپنے رب ہی کی حمد کرنے والے ہیں۔‘‘ نوح علیہ السلام کو سوار ہو کر یہ دعا پڑھنے کا حکم ہوا : «{ الْحَمْدُ لِلّٰهِ الَّذِيْ نَجّٰىنَا مِنَ الْقَوْمِ الظّٰلِمِيْنَ}» [ المؤمنون : ۲۸ ] ’’سب تعریف اللہ کے لیے ہے جس نے ہمیں ظالم لوگوں سے نجات دی۔ ‘‘ اور انھوں نے یہ کہہ کر ساتھیوں کو کشتی میں سوار ہونے کا حکم دیا : «{ بِسْمِ اللّٰهِ مَجْرٖىهَا وَ مُرْسٰىهَا اِنَّ رَبِّيْ لَغَفُوْرٌ رَّحِيْمٌ  }» [ ھود : ۴۱ ] ’’اللہ کے نام کے ساتھ اس کا چلنا اور اس کا ٹھہرنا ہے۔ بے شک میرا رب یقینا بے حد بخشنے والا، نہایت رحم والا ہے۔‘‘ ¤ ➋ { فَقُلِ الْحَمْدُ لِلّٰهِ الَّذِيْ نَجّٰىنَا …: ’’ الظّٰلِمِيْنَ ‘‘} سے مراد مشرک ہیں، کیونکہ شرک ظلم عظیم ہے۔ ظلم کا معنی {’’وَضْعُ الشَّيْءِ فِيْ غَيْرِ مَحَلِّهِ‘‘} (کسی چیز کو اس کی جگہ کے علاوہ کہیں رککھنا) ہے اور ظلم کا معنی اندھیرا بھی ہے، گویا ظالم اندھیرے میں چیزوں کو ان کے اصل محل کے بجائے ادھر ادھر رکھ دیتا ہے۔ سب سے بڑا حق اللہ کا ہے، وہ غیر کو دیا تو یہ سب سے بڑا ظلم ٹھہرا۔ (ابن عاشور) ¤ ➌ ظالم لوگوں سے نجات پر اللہ کی حمد کا حکم اس لیے دیا کہ وہ نوح علیہ السلام اور ان کے ساتھیوں کو بے شمار اذیتوں کا نشانہ بناتے تھے، اس کے علاوہ نوح علیہ السلام اور ان کے ساتھیوں کا ان میں رہنا، ان کے کفر و شرک اور گندے اور غلیظ کاموں کو دیکھنا بجائے خود شدید تکلیف دہ تھا۔ اب ان سے نجات ملی، دشمن غرق ہوئے، الگ رہنے کی جگہ ملی، اپنا ماحول اور اپنی مجلس بنی، تو اس پر شکر اد اکرنے کا حکم ہوا۔ ¤ ➍ اسی لیے مسلمان کو دعوت یا جہاد کے مقصد کے بغیر کفار میں رہائش رکھنا حرام ہے، کیونکہ مسلسل کفر و شرک اور بدکاری و بے حیائی کا ارتکاب دیکھ دیکھ کر یا تو ہمیشہ شدید تکلیف میں رہے گا، یا اس کی اپنی غیرت و حمیت بھی ختم ہو جائے گی۔ چنانچہ اگر ایسی جگہ رہتا ہے تو وہاں سے ہجرت کا حکم ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَنَا بَرِيْئٌ مِنْ كُلِّ مُسْلِمٍ يُقِيْمُ بَيْنَ أَظْهُرِ الْمُشْرِكِيْنَ ] [ أبوداوٗد، الجہاد، باب النھي عن قتل … : ۲۶۴۵ ] ’’میں ہر اس مسلم سے بری ہوں جو مشرکوں کے درمیان رہتا ہے۔‘‘"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { وَ قُلْ رَّبِّ اَنْزِلْنِيْ مُنْزَلًا مُّبٰرَكًا :} یہ نوح علیہ السلام کو سکھائی گئی دعا کا دوسرا حصہ ہے۔ {’’ مُنْزَلًا ‘‘} باب افعال میں سے مصدر میمی بھی ہے اور ظرف بھی، اتارنا اور اتارنے کی جگہ، یعنی اے میرے پروردگار! تو مجھے اتار، ایسا اتارنا جو بابرکت ہو اور ایسی جگہ اتار جو بہت برکت والی ہو۔ بابرکت اتارنے سے مراد یہ ہے کہ سوار ہوتے وقت کوئی تکلیف نہ ہو اور جہاں اتریں وہاں کوئی آفت نہ آئے، ہر حال میں اور ہر جگہ بڑی رحمت و برکت شامل رہے۔ ہمارے نبی صلی اللہ علیہ وسلم کو اللہ تعالیٰ نے یہ دعا سکھائی : «{ وَ قُلْ رَّبِّ اَدْخِلْنِيْ مُدْخَلَ صِدْقٍ وَّ اَخْرِجْنِيْ مُخْرَجَ صِدْقٍ وَّ اجْعَلْ لِّيْ مِنْ لَّدُنْكَ سُلْطٰنًا نَّصِيْرًا }» [ بني إسرائیل : ۸۰ ] ’’اور کہہ اے میرے رب! داخل کر مجھے سچا داخل کرنا اور نکال مجھے سچا نکالنا اور میرے لیے اپنی طرف سے ایسا غلبہ بنا جو مددگار ہو۔‘‘ یہ دونوں دعائیں خود اللہ تعالیٰ کی سکھائی ہوئی ہیں جنھیں {’’ قُلْ ‘‘} کہہ کر پڑھنے کا حکم دیا ہے۔ ان کی قبولیت میں کوئی شک نہیں، ان دونوں دعاؤں کو ورد زبان رکھنا چاہیے، خصوصاً گھر جاتے اور گھر سے نکلتے وقت اور یہ دعائیں کرتے ہوئے دنیا کی باعزت اور بابرکت منزل کے ساتھ ہماری اصل منزل جنت کی نیت بھی رکھنی چاہیے۔ اللہ تعالیٰ اپنے فضل و کرم سے ہمیں وہ باعزت اور بابرکت مقام عطا فرمائے۔ (آمین) ¤ ➋ { وَ اَنْتَ خَيْرُ الْمُنْزِلِيْنَ :} اس کا ایک مطلب تو وہ ہے جو اوپر ترجمے میں ہے اور ایک وہ ہے جو یوسف علیہ السلام نے اپنے بھائیوں سے کہا تھا : «{ وَ اَنَا خَيْرُ الْمُنْزِلِيْنَ }» [ یوسف : ۵۹ ] ’’اور میں بہترین مہمان ٹھہرانے والا (میزبان) ہوں۔‘‘ یعنی کشتی سے اترنے کے بعد تو ہی ہماری مہمان نوازی اور ہماری ضروریات کا بندوبست کرنے والا ہے اور تجھ سے بہتر مہمان نواز کوئی نہیں۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ :} نوح علیہ السلام کا قصہ بیان کرنے کے بعد اس سے حاصل ہونے والی عبرتوں کی طرف توجہ دلائی کہ یقینا اس واقعہ میں بہت سی نشانیاں ہیں، مثلاً اس میں نوح علیہ السلام کے اولو العزم پیغمبر ہونے کی کئی نشانیاں ہیں، یعنی مدت دراز تک ان کا بے مثال صبر، قوم کے ایمان نہ لانے کی اطلاع پر ان پر بددعا کا قبول ہونا، ان کے دشمنوں کا غرق ہونا، اللہ تعالیٰ کا ان کی رسالت کی تصدیق کرنا اور ان کی تعریف کرنا وغیرہ۔ نوح علیہ السلام کی قوم جیسی رسولوں کو جھٹلانے والی دیگر قوموں کے لیے بھی کئی نشانیاں ہیں۔ اسی طرح اللہ کی عظیم قدرت کی بھی بہت سی نشانیاں ہیں، مثلاً اتنا عظیم طوفان جس سے پہاڑ بھی نہ بچا سکیں اور اس میں نوح علیہ السلام اور ان کے ساتھیوں کو محفوظ رکھ کر بابرکت طریقے سے اتار کر بابرکت جگہ دینا۔ اسی طرح اللہ تعالیٰ کے کامل علم و حکمت کی بھی بہت سی نشانیاں ہیں کہ اس نے کس طرح زمین کو مکمل طور پر شرک سے پاک کرنا طے کر رکھا تھا اور اتنے تباہ کن طوفان میں بھی اس نے انسانی ضروریات اور جانوروں کی بقا کا انتظام طے کر رکھا تھا اور کیا۔ (ابن عاشور) ¤ ➋ { وَ اِنْ كُنَّا لَمُبْتَلِيْنَ : ’’ وَ ‘‘} اصل میں {’’إِنَّ‘‘} ہے، جس کا اسم {’’نَا‘‘} محذوف ہے۔ دلیل {’’ لَمُبْتَلِيْنَ ‘‘} پر آنے والا لام ہے۔ {’’كَانَ‘‘} استمرار کے لیے ہے، یعنی بلاشبہ یقینا ہم ہمیشہ سے آزمانے والے ہیں۔ ہم نے نوح علیہ السلام اور ان کی قوم کی آزمائش کی، اسی طرح ہم ہر پیغمبر اور اس کی امت کی آزمائش کرتے چلے آئے ہیں اور اب بھی آزمائش کرتے رہتے ہیں۔ اس میں ہماری حکمت کھرے کھوٹے کو ظاہر کرنا، آزمائش میں کامیاب ہونے والوں کو نوازنا اور ناکام رہنے والوں کے ساتھ ان کے حسب حال سلوک کرنا ہے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) { ثُمَّ اَنْشَاْنَا مِنْۢ بَعْدِهِمْ قَرْنًا اٰخَرِيْنَ:} اس سے مراد اکثر مفسرین نے قومِ عاد لی ہے، کیونکہ قومِ نوح کے جانشین یہی لوگ بنے تھے۔ ہود علیہ السلام نے ان سے خطاب کرتے ہوئے فرمایا تھا : «{ وَ اذْكُرُوْۤا اِذْ جَعَلَكُمْ خُلَفَآءَ مِنْۢ بَعْدِ قَوْمِ نُوْحٍ }» [ الأعراف : ۶۹ ] ’’اور یاد کرو جب اللہ نے تمھیں قومِ نوح کا جانشین بنایا۔‘‘ مگر بہت سے مفسرین نے اس سے مراد صالح علیہ السلام کی قوم ثمود لی ہے، کیونکہ یہاں {’’ الصَّيْحَةُ ‘‘} (چیخ) کا ذکر ہے اور ’’صیحہ‘‘ یعنی چیخ سے ہلاک ہونے والے ثمود تھے۔ اس کے علاوہ اہل عرب کی نصیحت کے لیے قوم ثمود کا تذکرہ زیادہ موزوں تھا، کیونکہ پہاڑوں کو تراش کر ان کے بنائے ہوئے مکانات مقام حجر میں ان کے سامنے موجود تھے۔ امام طبری، ابن عاشور اور مفسر سعدی وغیرہم نے اسی کو ترجیح دی ہے۔ اللہ تعالیٰ نے یہاں کسی قوم کا نام نہیں لیا، کیونکہ مراد تاریخ کا بیان یا قصہ گوئی نہیں بلکہ عبرت ہے کہ بعد میں آنے والوں نے بھی پہلوں کے انجام سے کوئی سبق حاصل نہ کیا، آخر اللہ کی گرفت کا نشانہ بنے۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) { فَاَرْسَلْنَا فِيْهِمْ رَسُوْلًا مِّنْهُمْ … :} اس آیت کی تفسیر اسی سورت کی آیت (۲۳) میں گزر چکی ہے۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ { وَ قَالَ الْمَلَاُ مِنْ قَوْمِهِ الَّذِيْنَ كَفَرُوْا … :} اس آیت میں ان کے سرداروں کی اپنے رسول کو بشر کہہ کر جھٹلانے کی دو بڑی وجہیں بیان ہوئی ہیں، ایک یہ کہ وہ آخرت کی ملاقات کو جھٹلاتے تھے اور دوسری یہ کہ انھیں دنیا میں وسیع خوش حالی حاصل تھی۔ {’’تَرَفٌ‘‘} کا معنی وسیع خوش حالی ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے امتِ مسلمہ میں سے حدیث کے منکر کا بھی یہی حال بیان کیا کہ اس کے انکار میں اس کی خوش حالی اور فارغ البالی کا دخل ہو گا۔ مقدام بن معدیکرب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَلَا إِنِّيْ أُوْتِيْتُ الْكِتَابَ وَ مِثْلَهُ مَعَهُ، أَلَا يُوْشِكُ رَجُلٌ شَبْعَانُ عَلٰی أَرِيْكَتِهِ يَقُوْلُ عَلَيْكُمْ بِهٰذَا الْقُرْآنِ فَمَا وَجَدْتُمْ فِيْهِ مِنْ حَلَالٍ فَاأَحِلُّوْهُ وَمَا وَجَدْتُمْ فِيْهِ مِنْ حَرَامٍ فَحَرِّمُوْهُ، أَلَا، لَا يَحِلُّ لَكُمُ الْحِمَارُ الْأَهْلِيُّ وَلَا كُلُّ ذِيْ نَابٍ مِنَ السَّبُعِ ] [ أَبوداوٗد، السنۃ، باب في لزوم السنۃ… : ۴۶۰۴ ] ’’سنو! مجھے کتاب دی گئی ہے اور اس کے ساتھ اس کی مثل (حدیث) دی گئی ہے۔ سنو! قریب ہے کہ ایک بھرے ہوئے پیٹ والا (یعنی خوش حال) آدمی جو اپنے تخت پر تکیہ لگائے ہو گا، یہ کہے گا کہ اس قرآن کو لازم پکڑو، جو اس میں حلال پاؤ اسے حلال سمجھو اور جو اس میں حرام پاؤ اسے حرام سمجھو۔ سنو! تمھارے لیے گھریلو گدھا حلال نہیں اور نہ کچلی والا درندہ حلال ہے (حالانکہ یہ قرآن میں نہیں بلکہ حدیث رسول میں ہے)۔‘‘ ¤ ➋ { يَاْكُلُ مِمَّا تَاْكُلُوْنَ … :} ’’بشر رسول نہیں ہو سکتا‘‘ پیغمبروں کو جھٹلانے والے سبھی لوگوں نے یہی کہا۔ ہمارے نبی صلی اللہ علیہ وسلم کے لیے اس میں تسلی ہے کہ آپ اس تکذیب میں اکیلے نہیں، کیونکہ آپ کے متعلق بھی کفار نے کہا تھا : « مَالِ هٰذَا الرَّسُوْلِ يَاْكُلُ الطَّعَامَ وَ يَمْشِيْ فِي الْاَسْوَاقِ» [ الفرقان: ۷ ] ’’اس رسول کو کیا ہے کہ کھانا کھاتا ہے اور بازاروں میں چلتا پھرتا ہے۔‘‘ ¤ ➌ سورۂ اعراف اور سورۂ ہود میں پیغمبروں کی نصیحت کے بعد قوم کے سرداروں کی بات {’’ قَالَ الْمَلَاُ ‘‘} سے شروع ہوتی ہے، جب کہ اس سورت میں نوح علیہ السلام کی نصیحت کے بعد {’’ فَقَالَ الْمَلَؤُا ‘‘} ہے اور زیر تفسیر آیت میں {’’ وَ قَالَ الْمَلَاُ‘‘} ہے۔ اس فرق کی توجیہ ابن عاشور رحمہ اللہ نے یہ بیان فرمائی ہے کہ ان دونوں سورتوں یعنی اعراف اور ہود میں پیغمبروں کی نصیحت کے بعد قوم کے سرداروں کا پیغمبروں سے براہ راست خطاب ہے، اس لیے ’’فاء‘‘ یا ’’واؤ‘‘ کی ضرورت نہیں، جب کہ یہاں پیغمبروں کی نصیحت کے بعد قوم کے سرداروں کا پیغمبروں کو جواب مذکور نہیں، بلکہ اس کے بعد ان کا اپنے لوگوں کے پاس جا کر انھیں بہکانا مذکور ہے، تاکہ وہ پیغمبر کی بات سے متاثر نہ ہو جائیں، اس لیے ’’فاء‘‘ اور ’’واؤ‘‘ لائی گئی ہیں۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) { وَ لَىِٕنْ اَطَعْتُمْ بَشَرًا مِّثْلَكُمْ … :} سورۂ قمر میں اسی قوم کے صالح علیہ السلام کے متعلق تحقیر سے بھرے ہوئے الفاظ ملاحظہ کریں، کہا : «{ فَقَالُوْۤا اَبَشَرًا مِّنَّا وَاحِدًا نَّتَّبِعُهٗۤ اِنَّاۤ اِذًا لَّفِيْ ضَلٰلٍ وَّ سُعُرٍ (24) ءَاُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْۢ بَيْنِنَا بَلْ هُوَ كَذَّابٌ اَشِرٌ }» [ القمر : ۲۴، ۲۵ ] ’’پس انھوں نے کہا کیا ایک آدمی جو ہمیں سے ہے اکیلا، ہم اس کے پیچھے لگ جائیں؟ یقینا ہم تو اس وقت بڑی گمراہی اور دیوانگی میں ہوں گے ۔ کیا یہ نصیحت ہمارے درمیان میں سے اسی پر نازل کی گئی ہے؟ بلکہ وہ بہت جھوٹا ہے، متکبر ہے۔‘‘ اپنے مال و جاہ پر مغرور سرداروں نے سرداری خطرے میں دیکھ کر دنیا اور آخرت کی ذلت قبول کر لی، مگر بے شمار نشان دیکھنے کے باوجود رسول پر ایمان لا کر تابع ہونا قبول نہ کیا۔ سرداری کی آفات میں سے یہ سب سے بڑی آفت ہے۔ اللہ تعالیٰ اس سے بچائے رکھے۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) { اَيَعِدُكُمْ اَنَّكُمْ اِذَا مِتُّمْ … :} پچھلی آیات میں رسول کو جھٹلانے کا ذکر ہے اور اس آیت میں اس کی دعوت، یعنی قیامت کو جھٹلانے کا ذکر ہے۔ مرنے کے بعد دوبارہ زندہ کیا جانا ان کی نگاہ میں ناممکن تھا، حالانکہ پہلی دفعہ بنانے والے کے لیے دوبارہ بنانا کچھ مشکل نہیں۔ اس سورۂ مبارکہ کے شروع {’’ وَلَقَدْ خَلَقْنَا الْاِنْسَانَ ‘‘} سے لے کر نوح علیہ السلام کے ذکر تک موت کے بعد زندگی ہی کے دلائل ہیں۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) { هَيْهَاتَ هَيْهَاتَ لِمَا تُوْعَدُوْنَ : ’’ هَيْهَاتَ ‘‘} اسم مبنی جامد غیر مشتق ہے۔ اکثر مفسرین کا کہنا ہے کہ یہ فعل ماضی {’’بَعُدَ‘‘} (دور ہوا) کے معنی میں ہے۔ {’’مَا تُوْعَدُوْنَ‘‘} اس کا فاعل ہے اور لام فاعل کے بیان اور وضاحت کے لیے ہے۔ معنی ہو گا : ’’دور ہے، دور ہے وہ جس کا تم وعدہ دیے جاتے ہو۔‘‘ زجاج نے اپنی تفسیر میں فرمایا اور زمخشری نے بھی اسی بات کو پسند کرنے کا اشارہ فرمایا ہے کہ یہ مصدر {’’بُعْدٌ‘‘} (دوری) کے معنی میں ہے۔ معنی یہ ہو گا کہ ’’دوری ہے، دوری ہے اس کے لیے جس کا تم وعدہ دیے جاتے ہو۔‘‘ اس صورت میں لام کا معنی سمجھنے میں مشکل پیش نہیں آتی، میں نے اسی کے مطابق ترجمہ کیا ہے۔ مطلب یہ کہ مٹی اور ہڈیاں ہونے کے بعد دوبارہ قبروں سے زندہ نکالے جانے کی بات میں بہت بُعد ہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { اِنْ هِيَ اِلَّا حَيَاتُنَا الدُّنْيَا : ’’ هِيَ ‘‘} سے مراد {’’حَيَاةٌ‘‘} ہے، جو {’’ حَيَاتُنَا ‘‘} سے واضح ہو رہی ہے، یعنی مرنے کے بعد زندگی کہاں؟ زندگی ہے تو صرف یہ دنیا کی زندگی، باقی سب خیال و محال ہے۔ ¤ ➋ { نَمُوْتُ وَ نَحْيَا :} ’’ہم مرتے ہیں اور جیتے ہیں‘‘ اس کا مطلب یہ نہیں کہ وہ مرنے کے بعد جینے کے قائل ہو گئے تھے، کیونکہ وہ اس دنیا کے سوا کسی زندگی کو مانتے ہی نہ تھے۔ اس لیے اس کا مطلب یہ ہے کہ یہیں ہم مرتے جاتے ہیں اور پچھلے پیدا ہوتے رہتے ہیں، دنیا کا یہ سلسلہ اسی طرح جاری رہا ہے اور جاری رہے گا۔ ¤ ➌ {وَ مَا نَحْنُ بِمَبْعُوْثِيْنَ :} باء کی وجہ سے نفی میں تاکید پیدا ہو گئی، اس لیے ترجمہ ہے ’’اور ہم ہر گز اٹھائے جانے والے نہیں۔‘‘ اگرچہ ان سرداروں کی پچھلی تمام باتوں کا مطلب بھی رسول اور قیامت کو جھٹلانا تھا، پھر بھی کوئی کمی باقی تھی تو انھوں نے نہایت تاکید کے ساتھ صاف لفظوں میں قیامت کا انکار کرکے اور رسول کو مفتری کہہ کر پوری کر دی، جیسا کہ اگلی آیت میں ہے۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) { اِنْ هُوَ اِلَّا رَجُلٌ افْتَرٰى … :} یعنی یہ {’’ رَجُلٌ ‘‘} (آدمی) ہو کر جو رسالت کا دعویٰ کرتا ہے اور مرنے کے بعد زندگی سے ڈراتا ہے، تو محض اللہ پر جھوٹ باندھتا ہے، یا یہ کہ یہ صرف ایک آدمی ہے جو …۔ {’’ بِمُؤْمِنِيْنَ ‘‘} پر باء بھی نفی کی تاکید کے لیے ہے، اس لیے ترجمہ میں لفظ ’’ہر گز‘‘ کا اضافہ کیا ہے۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) { قَالَ رَبِّ انْصُرْنِيْ بِمَا كَذَّبُوْنِ : ’’ كَذَّبُوْنِ ‘‘} اصل میں {’’ كَذَّبُوْنِيْ‘‘} ہے، نون کا کسرہ اس کی دلیل ہے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) { قَالَ عَمَّا قَلِيْلٍ لَّيُصْبِحُنَّ نٰدِمِيْنَ : ’’ قَلِيْلٍ ‘‘} کا معنی بہت کم ہے، اس کی قلت کی مزید تاکید کے لیے {’’عَنْ‘‘} کے ساتھ {’’مَا‘‘ } کا اضافہ فرمایا ہے، یعنی بہت ہی کم مدت میں۔ (بقاعی)"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) { فَاَخَذَتْهُمُ الصَّيْحَةُ بِالْحَقِّ :} یعنی جو سزا انھیں دی گئی تھی وہ عین عدل و انصاف کے مطابق تھی، ان پر کوئی زیادتی نہیں کی گئی۔ بعض نے {’’ فَاَخَذَتْهُمُ الصَّيْحَةُ بِالْحَقِّ ‘‘} کا ترجمہ یہ کیا ہے : ’’آخر سچے وعدے کے مطابق ایک چیخ نے انھیں آ دبوچا۔‘‘ یعنی وہ وعدہ جو {’’ عَمَّا قَلِيْلٍ لَّيُصْبِحُنَّ نٰدِمِيْنَ ‘‘} کے ضمن میں پایا جاتا ہے۔ {’’اَلْحَقُّ‘‘} سے مراد قطعی امر بھی ہو سکتا ہے، جسے کوئی روک نہ سکتا ہو۔ (روح)"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) { ثُمَّ اَنْشَاْنَا مِنْۢ بَعْدِهِمْ قُرُوْنًا اٰخَرِيْنَ :} یعنی قوم ثمود کے بعد ہم نے کئی اور دور پیدا کیے۔ (طبری)"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) { مَا تَسْبِقُ مِنْ اُمَّةٍ اَجَلَهَا … :} یعنی کسی امت کے لیے اللہ تعالیٰ نے زندگی کی جو مدت مقرر کر دی ہے وہ دنیا میں نہ اس سے کم ٹھہرتی ہے نہ زیادہ۔ طبری نے فرمایا : ’’یہ ہمارے نبی محمد صلی اللہ علیہ وسلم کی قوم کے مشرکوں کے لیے وعید ہے اور انھیں آگاہ کرنا ہے کہ ان کے کفر و شرک اور رسول کو جھٹلانے کے باوجود انھیں جو مہلت دی جا رہی ہے وہ اس لیے ہے کہ وہ اپنی مقرر کر دہ مدت کو پہنچ جائیں، پھر ان پر اس کی گرفت آئے گی، جیسا کہ پہلی امتوں کے ساتھ ہوا۔‘‘"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) { ثُمَّ اَرْسَلْنَا رُسُلَنَا تَتْرَا …:’’ تَتْرَا ‘‘ ’’دَعْوٰي‘‘} اور {’’سَلْوٰي‘‘} ({فَعْلٰي})کے وزن پر مصدر ہے، جو {’’ رُسُلَنَا ‘‘} سے حال ہے۔ {’’ تَتْرَا ‘‘} اصل میں {’’ وَتَرٰي‘‘} ہے۔ واؤ کو تاء سے بدل دیا، جس طرح {’’تَقْوٰي‘‘} میں تاء واؤ کی جگہ آئی ہے۔ مصدر بمعنی اسم فاعل ہے، یعنی {’’مُتَوَاتِرِيْنَ‘‘} یعنی پھر ہم نے اپنے کئی رسول پے در پے بھیجے، مگر ان کی قوموں نے پہلی امتوں کے انجام سے کوئی عبرت حاصل نہ کی اور ہر امت اپنے رسول کے آنے پر اسے جھٹلاتی رہی، تو ہم نے بھی یکے بعد دیگرے ان کی ہلاکت کا تانتا باندھ دیا اور انھیں ایسا نیست و نابود کیا کہ قصے کہانیوں کے سوا ان کی کوئی چیز باقی نہیں رہی۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ { ثُمَّ اَرْسَلْنَا مُوْسٰى وَ اَخَاهُ هٰرُوْنَ … : ’’ ثُمَّ ‘‘} کے لفظ سے معلوم ہوتا ہے کہ موسیٰ علیہ السلام پیغمبروں کے لمبے وقفے کے بعد مبعوث ہوئے۔ فرعون اور اس کی قوم اپنے زمانے کے نہایت قوت و شوکت اور مال و دولت والے لوگ تھے، انھوں نے بنی اسرائیل کو غلام بنا رکھا تھا، چنانچہ ان کی طرف رسول بھی نہایت عظیم الشان بھیجا گیا، جس کے حالات اور معجزات قرآن میں سب سے زیادہ بیان ہوئے ہیں اور اس مقام پر نوح علیہ السلام کے بعد ذکر کردہ پیغمبروں اور امتوں کی طرح مبہم رکھنے کے بجائے موسیٰ و ہارون( علیھما السلام ) کا اور فرعون اور اس کے سرداروں کا نام لیا گیا۔ موسیٰ علیہ السلام کی قوم بنی اسرائیل تھی، جب کہ فرعون اور اس کی قوم قبطی تھے۔ اس لیے یہ کہنے کے بجائے کہ ہم نے موسیٰ کو ان کی قوم بنی اسرائیل کی طرف بھیجا، یہ فرمایا کہ فرعون اور اس کے سرداروں کی طرف بھیجا۔ فرعون کی قوم کا نام نہیں لیا، کیونکہ وہ فرعون اور اس کے سرداروں کے مقابلے میں کچھ حیثیت نہ رکھتے تھے۔ فرعون کی طرف بھیجنے کا مقصد اسے توحید کی دعوت دینا (دیکھیے نازعات : ۱۵ تا ۱۹) اور بنی اسرائیل کو آزادی دلانا تھا۔ ( دیکھیے طٰہٰ : ۴۷) ¤ ➋ { بِاٰيٰتِنَا وَ سُلْطٰنٍ مُّبِيْنٍ :} نشانیوں سے مراد وہ معجزات اور نشانیاں ہیں جو فرعون کے غرق ہونے سے پہلے ظاہر ہوئیں، جن کا ذکر سورۂ اعراف اور دوسرے مقامات پر ہے۔ ان میں سمندر کا پھٹنا، من و سلویٰ اترنا، بارہ چشمے جاری ہونا اور بادل کا سایہ وغیرہ شامل نہیں، کیونکہ ان کا فرعون کو دعوت سے کوئی تعلق نہیں۔ {’’ سُلْطٰنٍ مُّبِيْنٍ ‘‘} بھی اگرچہ آیات میں شامل ہے، مگر اس کی عظمت کی وجہ سے اسے الگ ذکر فرمایا۔ اکثر مفسرین نے اگرچہ اس سے عصائے موسیٰ مراد لیا ہے، مگر مجھے ان مفسرین کی بات راجح معلوم ہوتی ہے جنھوں نے فرمایا : ’’اس سے مراد وہ غلبہ اور سطوت و ہیبت ہے جو موسیٰ اور ہارون علیھما السلام کو عطا ہوئی تھی۔‘‘ چنانچہ اللہ تعالیٰ نے انھیں فرعون کی طرف بھیجتے ہوئے فرمایا : « وَ نَجْعَلُ لَكُمَا سُلْطٰنًا فَلَا يَصِلُوْنَ اِلَيْكُمَا » [ القصص : ۳۵ ] ’’اور ہم تم دونوں کے لیے غلبہ رکھیں گے، سو وہ تم تک نہیں پہنچیں گے۔‘‘ اللہ تعالیٰ نے ہمارے نبی صلی اللہ علیہ وسلم کو بھی اس کے حصول کی دعا سکھائی، فرمایا : « وَ قُلْ رَّبِّ اَدْخِلْنِيْ مُدْخَلَ صِدْقٍ وَّ اَخْرِجْنِيْ مُخْرَجَ صِدْقٍ وَّ اجْعَلْ لِّيْ مِنْ لَّدُنْكَ سُلْطٰنًا نَّصِيْرًا » [ بني إسرائیل : ۸۰ ] ’’اور کہہ اے میرے رب! داخل کر مجھے سچا داخل کرنا اور نکال مجھے سچا نکالنا اور میرے لیے اپنی طرف سے ایسا غلبہ بنا جو مددگار ہو۔‘‘ ¤ زیر تفسیر آیت میں بھی {’’ سُلْطٰنٍ ‘‘} سے مراد غلبہ ہے۔ غور کیجیے فرعون کس قدر متکبر اور ظالم تھا، کتنے لوگوں کو اس نے قتل کیا ہو گا۔ اس کے دروازے پر کتنا سخت پہرا ہو گا۔ دو آدمی جو ہاتھ میں صرف عصا لیے ہوئے ہیں، اس کے پاس جاتے ہیں، کسی کو روکنے کی جرأت نہیں ہوتی۔ بات شروع ہوتی ہے تو وہ ہر بات میں لاجواب ہوتا ہے۔ لاجواب ہو کر جیل کی دھمکی دیتا ہے، مگر دھمکی پر عمل کی ہمت نہیں ہوتی، جادوگروں سے مقابلہ کرواتا ہے، ناکام ہوتا ہے۔ (شعراء : ۱۸ تا ۲۸) پھر قتل کرنا چاہتا ہے مگر جرأت نہیں ہوتی۔ (مؤمن : ۲۶) اللہ بہتر جانتا ہے کتنے سال اسی طرح گزرے، مگر وہ موسیٰ اور ہارون علیھما السلام کو کوئی گزند نہیں پہنچا سکا، اسے کہتے ہیں {’’ سُلْطٰنٍ مُّبِيْنٍ ‘‘} یعنی واضح غلبہ۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ {اِلٰى فِرْعَوْنَ وَ مَلَاۡىِٕهٖ فَاسْتَكْبَرُوْا:} یہاں وہ بات حذف کر دی ہے جسے فرعون اور اس کے سرداروں نے سخت تکبر سے ٹھکرا دیا، کیونکہ اس سے پہلے تمام انبیاء کے تذکرے میں اس کا بیان کئی بار ہو چکا ہے، یعنی : « اَنِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ اَفَلَا تَتَّقُوْنَ» [ المؤمنون : ۳۲ ] ’’کہ اللہ کی عبادت کرو، اس کے سوا تمھارا کوئی معبود نہیں، تو کیا تم ڈرتے نہیں۔‘‘ اور اللہ تعالیٰ کے بیان کے متعلق ہر رسول کی دعوت یہی تھی۔ (دیکھیے انبیاء : ۲۵) ¤ ➋ { فَاسْتَكْبَرُوْا وَ كَانُوْا قَوْمًا عَالِيْنَ:’’ فَاسْتَكْبَرُوْا ‘‘} میں سین اور تاء کا اضافہ تکبر کی شدت پر دلالت کرتا ہے۔ {’’ قَوْمًا عَالِيْنَ‘‘} کی تفصیل کے لیے دیکھیے سورۂ قصص (۴)۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) { فَقَالُوْۤا اَنُؤْمِنُ لِبَشَرَيْنِ مِثْلِنَا … :} تکبر اور سرکشی کے نتیجے میں انھوں نے موسیٰ اور ہارون علیھما السلام کی بات ماننے سے یہ کہہ کر انکار کر دیا کہ کیا ہم اپنے جیسے دو انسانوں کی بات پر ایمان لے آئیں، جب کہ ان کے لوگ ہمارے غلام ہیں اور ہم ان سے بلند تر ہیں۔ پہلا اعتراض موسیٰ اور ہارون علیھما السلام کی ذات پر ہے اور دوسرا ان کی قوم پر ہے۔ تعجب ہوتا ہے کہ انھوں نے کھانے پینے اور چلنے پھرنے میں رسولوں کو اپنے جیسا بشر تو دیکھ لیا اور اسے جھٹلانے کا بہانہ بھی بنا لیا، مگر یہ نہ دیکھا کہ وہ ان کے دلائل و معجزات کے سامنے لاجواب ہیں اور لاکھوں کی تعداد میں ہونے کے باوجود انھیں قتل کرنے سے عاجز ہیں۔ کم از کم وہ یہی سوچ لیتے کہ کوئی بشر وہ ہے جو جاہل اور عقل سے خالی ہے اور کوئی بشر وہ ہے جو اتنا علم اور اتنی عقل رکھتا ہے کہ بیان سے باہر ہے۔ جب علم و عقل میں اتنا تفاوت ہو سکتا ہے تو رسالت کا تفاوت کیوں نہیں ہو سکتا؟ اور اللہ اپنے کسی بندے پر یہ احسان کیوں نہیں کر سکتا۔ دیکھیے سورۂ ابراہیم (۱۰، ۱۱)۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ {فَكَذَّبُوْهُمَا۠ فَكَانُوْا مِنَ الْمُهْلَكِيْنَ :} فاء سببیہ ہے، یعنی تکبر جھٹلانے کا سبب بنا اور جھٹلانا ہلاک کیے جانے والوں میں شامل ہونے کا باعث بنا۔ ¤ ➋ {فَكَانُوْا مِنَ الْمُهْلَكِيْنَ :} یعنی بجائے اس کے کہ وہ عام عادت کے مطابق یکے بعد دیگرے فوت ہوں، جھٹلانے کے باعث سمندر میں ڈبو کر ہلاک کیے جانے والوں میں شامل ہو گئے۔ تفصیل کے لیے دیکھیے سورۂ یونس (۹۰ تا ۹۲) {’’ مِنَ الْمُهْلَكِيْنَ ‘‘} میں قریش کے لیے بھی دھمکی ہے کہ اللہ تعالیٰ کی سنت ہے کہ وہ اپنے رسولوں کو جھٹلانے والوں کو ہلاک کر دیا کرتا ہے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { وَ لَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ لَعَلَّهُمْ يَهْتَدُوْنَ :} موسیٰ علیہ السلام کو کتاب تورات فرعونیوں کو غرق کرنے کے بعد ملی، جیسا کہ سورۂ اعراف (۱۳۶ تا ۱۴۵) میں فرعون کے غرق ہونے کے بعد موسیٰ علیہ السلام کے چالیس راتوں کے لیے طور پر اعتکاف اور دیدارِ الٰہی والے معاملے کے بعد الواح کی صورت میں کتاب عطا فرمانے کا ذکر ہے۔ ابن کثیر رحمہ اللہ نے فرمایا : ’’اللہ تعالیٰ نے موسیٰ علیہ السلام پر تورات فرعون اور قبطیوں کو غرق کرنے کے بعد نازل فرمائی اور تورات نازل کرنے کے بعد کسی امت کو عام عذاب کے ساتھ ہلاک نہیں فرمایا، بلکہ ایمان والوں کو کفار کے ساتھ لڑنے کا حکم دیا، جیسا کہ اللہ تعالیٰ نے فرمایا : «وَ لَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ مِنْۢ بَعْدِ مَاۤ اَهْلَكْنَا الْقُرُوْنَ الْاُوْلٰى بَصَآىِٕرَ لِلنَّاسِ وَ هُدًى وَّ رَحْمَةً لَّعَلَّهُمْ يَتَذَكَّرُوْنَ » [ القصص : ۴۳ ] ’’اور بلاشبہ یقینا ہم نے موسیٰ کو کتاب دی، اس کے بعد کہ ہم نے پہلی نسلوں کو ہلاک کر دیا، جولوگوں کے لیے دلائل اور ہدایت اور رحمت تھی، تاکہ وہ نصیحت حاصل کریں۔‘‘ اس لیے {’’ لَعَلَّهُمْ ‘‘} (تاکہ وہ) میں ضمیر {’’هُمْ‘‘} بنی اسرائیل ہی کے لیے قرار دی جائے گی، فرعونیوں کے لیے نہیں۔ ¤ ➋ { لَعَلَّهُمْ يَهْتَدُوْنَ :} یعنی کتاب تو اس لیے تھی کہ بنی اسرائیل ہدایت حاصل کریں، مگر اپنے آپ میں نبی کو موجود پا کر، اس کے معجزوں کو آنکھوں سے دیکھ کر اور اس پر نازل ہونے والی کتاب کو سن کر بھی ان کے اکثر سیدھی راہ پر نہیں آئے۔ جیسا کہ قرآن میں جا بجا ان کی نافرمانی کے قصے مذکور ہیں۔ امت مسلمہ کو تنبیہ ہے کہ دیکھنا تمھارا حال بھی ان کی طرح نہ ہو جائے۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ { وَ جَعَلْنَا ابْنَ مَرْيَمَ وَ اُمَّهٗۤ اٰيَةً: ’’ اٰيَةً ‘‘} میں تنوین تعظیم کی ہے ’’عظیم نشانی۔‘‘ یہ نہیں فرمایا کہ ہم نے ابن مریم کو نشانی بنایا، نہ یہ فرمایا کہ ہم نے ابن مریم اور اس کی ماں کو دو نشانیاں بنایا، بلکہ دونوں کو ملاکر ایک عظیم نشانی قرار دیا، کیونکہ ان دونوں کا وجود اللہ تعالیٰ کی قدرت کا عظیم نشان تھا کہ اس نے آدم علیہ السلام کو ماں باپ دونوں کے بغیر پیدا فرمایا، حوا علیھا السلام کو صرف مرد سے پیدا فرمایا اور مریم علیھا السلام کے بطن سے عیسیٰ علیہ السلام کو بغیر باپ کے پیدا فرمایا۔ جب کہ عام پیدائش ماں باپ دونوں سے ہوتی ہے اور وہ بھی اللہ کی قدرت کا نشان ہے۔ ¤ ➋ یہاں اللہ تعالیٰ نے عیسیٰ علیہ السلام کا نام لینے کے بجائے ’’ابن مریم‘‘ فرمایا کہ انھیں خدا قرار دینے والوں کو توجہ دلائی جائے کہ وہ ایک خاتون کے بطن سے پیدا ہوئے تھے، سو خدا کیسے ہو گئے؟ ¤ ➌ {وَ اٰوَيْنٰهُمَاۤ اِلٰى رَبْوَةٍ ذَاتِ قَرَارٍ وَّ مَعِيْنٍ : ’’ رَبْوَةٍ ‘‘} ٹیلا، اونچی جگہ۔ {’’ ذَاتِ قَرَارٍ ‘‘} ہموار،، جہاں رہنا آسان ہو۔ {’’ مَعِيْنٍ ‘‘} جاری پانی، یہ {’’عَانَ يَعِيْنُ‘‘} ({بَاعَ يَبِيْعُ}) سے ہو تو {’’مَبِيْعٌ‘‘} کے وزن پر اسم مفعول ہے، اصل اس کا {’’مَعْيُوْنٌ ‘‘} ہے، میم زائد ہے۔ زجاج نے فرمایا : {’’ مَعِيْنٍ ‘‘} چشموں میں جاری پانی، گویا یہ {’’عَيْنٌ‘‘} (چشمہ) سے مشتق ہے۔‘‘ ابن الاعرابی نے فرمایا : {’’ مَعَنَ الْمَاءُ‘‘} ’’پانی بہ پڑا۔‘‘ اس صورت میں اس کا وزن {’’فَعِيْلٌ‘‘} ہے اور میم اصلی ہے، جاری پانی۔ (قرطبی) ¤ ➍ اس ربوہ (ٹیلا) سے کیا مراد ہے۔ بعض مفسرین نے اس سے مراد سرزمین مصر لی ہے۔ وہ کہتے ہیں کہ اس زمانے میں ملک شام (جہاں عیسیٰ علیہ السلام پیدا ہوئے) کا حاکم ہیروڈس تھا، وہ نجومیوں سے سن کر کہ عیسیٰ علیہ السلام کو سرداری ملے گی، بچپن ہی سے ان کا دشمن ہو گیا تھا اور ان کے قتل کے در پے تھا۔ مریم علیھا السلام انھیں لے کر مصر چلی گئیں اور جب تک ہیروڈس زندہ رہا واپس نہ آئیں۔ انجیل متیّٰ میں یہ واقعہ اسی طرح مذکور ہے، لیکن حافظ ابن کثیر رحمہ اللہ نے فرمایا : ’’زیادہ ظاہر بات یہ ہے کہ اس سے مراد بیت المقدس کے قریب کھجور والی وہ بلند جگہ ہے جہاں عیسیٰ علیہ السلام کی ولادت ہوئی اور مریم علیھا السلام کو نیچے سے آواز دی گئی کہ غم نہ کر، تیرے نیچے تیرے رب نے ایک ندی جاری کر دی ہے اور کھجور کے تنے کو اپنی طرف ہلا تو وہ تجھ پر تازہ پکی ہوئی کھجوریں گرائے گی، پس کھا، پی اور ٹھنڈی آنکھ سے رہ۔ (دیکھیے مریم : ۲۳ تا ۲۶) کیونکہ قرآن کی سب سے صحیح تفسیر وہ ہے جو قرآن کی کسی آیت سے ہو، پھر صحیح احادیث سے اور پھر آثار سے۔‘‘(ابن کثیر) اسرائیلی روایات کو جب ہم نہ سچا کہہ سکتے نہ جھوٹا تو ان سے کوئی بات کیسے ثابت ہو سکتی ہے؟"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ { يٰۤاَيُّهَا الرُّسُلُ كُلُوْا مِنَ الطَّيِّبٰتِ …:} ابن کثیر رحمہ اللہ نے فرمایا : ’’اللہ تعالیٰ تمام رسولوں کو حکم دے رہے ہیں کہ حلال کھاؤ اور صالح اعمال کرتے رہو۔ اس سے معلوم ہوا کہ اکلِ حلال عمل صالح کے لیے مددگار ہے۔‘‘ (ابن کثیر) ظاہر ہے حلال حاصل کرنے کے لیے محنت بھی کرنا پڑے گی۔ چنانچہ نبوت سے پہلے رسول اللہ صلی اللہ علیہ وسلم نے اجرت پر بکریاں چرائی ہیں اور تجارت بھی کی ہے اور آخر میں تو آپ کو اللہ تعالیٰ نے پاکیزہ ترین رزق مال غنیمت کے ساتھ غنی فرما دیا، چنانچہ فرمایا : « فَكُلُوْا مِمَّا غَنِمْتُمْ حَلٰلًا طَيِّبًا » [  الأنفال : ۶۹ ] ’’سو اس میں سے کھاؤ جو تم نے غنیمت حاصل کی، اس حال میں کہ حلال، طیب ہے۔‘‘ مقدام رضی اللہ عنہ راوی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا أَكَلَ أَحَدٌ طَعَامًا قَطُّ خَيْرًا مِنْ أَنْ يَّأْكُلَ مِنْ عَمَلِ  يَدِهِ وَ إِنَّ نَبِيَّ اللّٰهِ دَاوٗدَ عَلَيْهِ السَّلَاممُ كَانَ يَأْكُلُ مِنْ عَمَلِ يَدِهِ ] [ بخاري، البیوع، باب کسب الرجل و عملہ بیدہ : ۲۰۷۲ ] ’’کسی شخص نے کوئی کھانا اس کھانے سے بہتر نہیں کھایا جو وہ اپنے ہاتھ کی کمائی سے کھائے اور اللہ کے نبی داؤد علیہ السلام اپنے ہاتھ کی کمائی سے کھاتتے تھے۔‘‘ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَانَ زَكَرِيَّا نَجَّارًا ] [ ابن ماجہ، التجارات، باب الصناعات : ۲۱۵۰، عن أبي ھریرۃ رضی اللہ عنہ و صححہ الألباني ] ’’زکریا علیہ السلام نجار (ترکھان) تھے۔‘‘ اس کی مزید تفصیل اور حرام کھانے والے کی دعا قبول نہ ہونے کے لیے دیکھیے سورۂ بقرہ (۱۷۲)۔ ¤ اس آیت میں رہبانیت کا بھی رد ہے، جو اللہ کی نعمتیں اپنے آپ پر حرام کر لیتے ہیں۔ عیسیٰ علیہ السلام کے تذکرے کے بعد شاید اسی لیے اس حکم کا ذکر کیا ہے کہ رہبانیت کا حکم کسی بھی رسول کو نہ تھا۔ ¤ ➋ { إِنِّيْ بِمَا تَعْمَلُوْنَ عَلِيْمٌ:} اس میں حلال کھانے اور عمل صالح پر جزا کا وعدہ ہے اور اس کے خلاف پر سزا کی وعید ہے۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) { وَ اِنَّ هٰذِهٖۤ اُمَّتُكُمْ اُمَّةً وَّاحِدَةً … :} اس آیت کی تفسیر کے لیے دیکھیے سورۂ انبیاء (۹۲)۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ { فَتَقَطَّعُوْۤا اَمْرَهُمْ بَيْنَهُمْ زُبُرًا :} اصل دین تمام پیغمبروں کا ایک ہے، البتہ بعض وقتی احکام میں فرق ہو سکتا ہے۔ آدم علیہ السلام سے لے کر رسول اللہ صلی اللہ علیہ وسلم تک سب کا دین اسلام ہے اور ان کے پیروکار سب امتِ مسلمہ ہیں۔ جس کے چند بنیادی اصول یہ ہیں : (1) توحید، یعنی عبادت صرف اللہ کی ہے، اس کے سوا کسی کی عبادت جائز نہیں۔ (2) قیامت، یعنی مرنے کے بعد سب کو اللہ کے حضور پیش ہونا ہے اور اپنے عمل کا بدلا پانا ہے۔ (3) اکل حلال، یعنی صرف حلال اور طیب کھانا کھانا ہے، حرام سے پوری طرح اجتناب کرنا ہے۔ (4) عمل صالح، یعنی ریا سے بچ کر خالص اللہ کے لیے رسول کے بتائے ہوئے طریقے کے مطابق عمل کرنا ہے۔ ہر پیغمبر یہی اصول دین لے کر آیا، مگر لوگوں نے اصول دین ہی میں اختلاف کرکے سیکڑوں فرقے بنا لیے، مثلاً پہلے اصل توحید کو لے لیجیے، صرف ایک اللہ کی عبادت اور اسی سے استعانت کی جگہ کسی نے پیغمبر کو رب بنا لیا، کسی نے احبار و رہبان کو، کسی نے تین رب بنا لیے، کسی نے وحدت الوجود کا عقیدہ نکال لیا کہ ہر چیز میں رب ہے۔ کسی نے کہا، فلاں اللہ کا بیٹا ہے، کسی نے کہا، فلاں اللہ کے نور میں سے جدا شدہ نور ہے۔ کسی نے کہا، اللہ تعالیٰ بزرگوں اور ولیوں مییں اتر آتا ہے۔ کسی نے کہا، بزرگ ترقی کرکے رب بن جاتے ہیں۔ اللہ کے سوا کئی ہستیوں کو عالم الغیب اور مختار کل تسلیم کیا گیا۔ حتیٰ کہ انسان نے، جسے اللہ تعالیٰ نے اپنے ہاتھوں سے پیدا کیا، اپنے نفع و نقصان کو پتھروں، درختوں، مویشیوں، جن بھوتوں، قبروں اور آستانوں سے وابستہ کر دیا اور ان کے آگے سر جھکانے اور انھی سے مرادیں مانگنے لگا۔ پیغمبروں کی لائی ہوئی توحید پر بہت کم لوگ قائم رہے۔ ¤ دوسرا اصل قیامت پر ایمان ہے۔ بعض لوگوں نے دوبارہ جی اٹھنے ہی کا انکار کر دیا اور جنھوں نے اسے تسلیم کیا انھوں نے بھی اس کے تقاضوں کو نہ سمجھا۔ کسی نے کہا، ہم چونکہ انبیاء کی اولاد یا سادات ہیں، لہٰذا ہمیں عذاب کیسے ہو سکتا ہے؟ بعض لوگوں نے جبری سفارش کا عقیدہ وضع کر لیا کہ اگر فلاں مرشد کی بیعت کر لی جائے تو وہ شفاعت کرکے ہمیں چھڑا لیں گے۔ بعض نے یہی عقیدہ اپنے بتوں یا دیوتاؤں سے وابستہ کر لیا۔ نصاریٰ نے کفارے کا عقیدہ گھڑ لیا کہ مسیح علیہ السلام ہم گناہ گاروں کے کفارے کے طور پر سولی چڑھ گئے، اب ان کے نام لیواؤں کے سب گناہ معاف ہیں۔ بعض پادری حضرات اس دنیا ہی میں لوگوں سے رقمیں بٹور کر انھیں معافی نامے جاری کرنے لگے اور بعض لوگوں نے عقیدہ گھڑا کہ اگر فلاں قبر کے بہشتی دروازے کے نیچے سے عرس کے دن گزرا جائے تو یقینا نجات ہو جائے گی۔ سستی نجات کے ایسے سب عقیدے لغو اور باطل ہیں اور قرآن نے ایسے عقائد رکھنے والوں کو آخرت کے منکر یعنی کافر قرار دیا ہے۔ تیسرا اصل حلال و طیب کھانا تھا، اس میں بھی لوگوں نے افراط و تفریط کی راہ پیدا کر لی۔ راہبوں، جوگیوں اور بعض صوفیوں نے اپنے اوپر حلال اشیاء کو حرام قرار دے لیا اور بعض دوسروں نے حلال و حرام کی تمیز ہی ختم کر دی اور سود اور قوم لوط کے عمل جیسی حرام اشیاء کو، جنھیں ساری شریعتوں میں حرام قرار دیا جاتا رہا، حلال ثابت کرنے کی کوشش کی۔ بہت سے علماء و مشائخ، بتوں کے مہنتوں اور مقبروں اور مزاروں کے مجاوروں نے حلت و حرمت کے اختیارات خود سنبھال لیے۔ ایسے لوگوں کا تذکرہ قرآن میں متعدد بار آیا ہے۔ چوتھا اصل عمل صالح ہے، غالباً اس اصل میں شرک سے بھی زیادہ فرقہ بازی ہوئی، دین کے بعض اصولی احکام کو مسخ کرکے بدعی عقائد و اعمال شامل کر دیے گئے اور ان باتوں کی اصل بنیاد حب جاہ و مال تھی۔ چنانچہ بے شمار سیاسی اور بدعی قسم کے فرقے وجود میں آ گئے، ہر فرقے نے اپنے پیشوا کی بات انبیاء کی بات کی طرح حرف آخر قرار دے دی۔ ¤ گویا اس سادہ اور مختصر سی اصولی تعلیم سے اختلاف کر کے لوگ جو فی الحقیقت ایک ہی امت تھے، سیکڑوں ہزاروں فرقوں میں بٹتے چلے گئے اور لطف کی بات یہ ہے کہ ان میں سے ہر فرقہ اپنے آپ کو حق پر سمجھتا ہے اور اپنے علاوہ دوسرے فرقوں کو دوزخ کا ایندھن سمجھتا ہے، حالانکہ یہ اصولی تعلیم آج بھی موجود ہے اور اگر کوئی شخص یا کوئی فرقہ تعصب سے بالاتر ہو کر راہِ حق کو تلاش کرنا چاہے تو راہِ حق آج بھی ایسی چھپی ہوئی چیز نہیں جس کا سراغ نہ لگایا جا سکتا ہو۔ (تیسیرالقرآن از کیلانی رحمہ اللہ بتصرف) ¤ ➋ { كُلُّ حِزْبٍۭ بِمَا لَدَيْهِمْ فَرِحُوْنَ : ’’ فَرِحُوْنَ ‘‘} بہت خوش۔ یہ ٹکڑے ٹکڑے ہونے کا لازمی نتیجہ ہے کہ جب کوئی شخص ہر حال میں اپنے گروہ کو قائم رکھنے پر اڑ جاتا ہے تو اس کے دل میں حقیقت کی تلاش کا جذبہ بھی ختم ہو جاتا ہے اور اسے اپنے دھڑے ہی کی ہر بات درست معلوم ہوتی ہے اور وہ اسی پر خوش رہتا ہے، خواہ کتنی غلط ہو اور دوسرے کی بات خواہ کتنی صحیح ہو اسے غلط معلوم ہوتی ہے۔ افسوس! مسلمان بھی خیر القرون کے بعد کتاب وسنت پر ایک جماعت رہنے کے بجائے فرقوں میں بٹ گئے۔ کچھ عقائدی فرقے، کچھ فقہی فرقے اور کچھ صوفی فرقے اور ہر ایک اپنے دھڑے پر اتنی سختی سے قائم ہے کہ اس کے مسلک کے خلاف قرآن مجید کی صریح آیت، یا رسول اللہ صلی اللہ علیہ وسلم کی صحیح حدیث بھی پیش کی جائے تو وہ یہ کہہ کر اسے ماننے سے انکار کر دے گا کہ کیا ہمارے بڑوں کو اس کا علم نہ تھا؟ اور اب یہ حال ہو گیا ہے کہ شاید مسیح علیہ السلام ہی اس امت کو کتاب و سنت پر جمع فرما سکیں گے۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) { فَذَرْهُمْ فِيْ غَمْرَتِهِمْ حَتّٰى حِيْنٍ:} یعنی ایسے متعصب اور ہٹ دھرم لوگ جو راہِ راست کی طرف آنا پسند ہی نہیں کرتے اور اپنے حال ہی پر خوش ہیں، انھیں ان کے حال ہی پر رہنے دیجیے، ایک وقت آنے والا ہے جب انھیں سب حقیقت پوری طرح معلوم ہو جائے گی۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 56،55) ➊ {اَيَحْسَبُوْنَ اَنَّمَا نُمِدُّهُمْ بِهٖ …: ’’ اَنَّمَا ‘‘} یہاں اکٹھا لفظ نہیں بلکہ {’’أَنَّ‘‘} اور {’’مَا‘‘} (بمعنی {اَلَّذِيْ}) الگ الگ لفظ ہیں، قرآن کے رسم الخط میں انھیں اکٹھا لکھ دیا گیا ہے، معنی ہے ’’کہ وہ چیزیں جو۔‘‘ ¤ ➋ ہر گروہ کے اپنے حال پر بہت خوش رہنے کا سبب چونکہ انھیں لگنے والا دھوکا تھا کہ خوش حالی اور مال و اولاد کی کثرت اللہ تعالیٰ کے راضی ہونے کی دلیل ہے، چنانچہ کفار کہا کرتے تھے کہ ہم اموال و اولاد میں زیادہ ہیں اور ہمیں کسی صورت عذاب نہیں ہو گا۔ دیکھیے سورۂ سبا (۳۵) اور کہف (۳۴ تا ۳۶) اس لیے اللہ تعالیٰ نے مسلمانوں کو تنبیہ کے لیے اس کا رد فرمایا۔ ¤ ➌ { بَلْ لَّا يَشْعُرُوْنَ:} یعنی ان کا یہ گمان درست نہیں، بلکہ حقیقت یہ ہے کہ انھیں شعور ہی نہیں کہ مال و اولاد کی یہ فراوانی انھیں مہلت دینے کے لیے اور ان پر حجت تمام کرنے کے لیے ہے کہ جس قدر انھیں ڈھیل ملے اسی قدر ان کے گناہوں کا پیمانہ اور لبریز ہو اور پھر بھرپور طریقے سے ان پر گرفت کی جائے۔ اہل علم فرماتے ہیں کہ جو شخص اللہ کی نافرمانی کرے اور اللہ کی عطا کردہ نعمتوں میں کمی محسوس نہ کرے وہ فکر کر لے کہ اللہ تعالیٰ کی طرف سے اس کی رسی دراز کی جا رہی ہے۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56،55) ➊ {اَيَحْسَبُوْنَ اَنَّمَا نُمِدُّهُمْ بِهٖ …: ’’ اَنَّمَا ‘‘} یہاں اکٹھا لفظ نہیں بلکہ {’’أَنَّ‘‘} اور {’’مَا‘‘} (بمعنی {اَلَّذِيْ}) الگ الگ لفظ ہیں، قرآن کے رسم الخط میں انھیں اکٹھا لکھ دیا گیا ہے، معنی ہے ’’کہ وہ چیزیں جو۔‘‘ ¤ ➋ ہر گروہ کے اپنے حال پر بہت خوش رہنے کا سبب چونکہ انھیں لگنے والا دھوکا تھا کہ خوش حالی اور مال و اولاد کی کثرت اللہ تعالیٰ کے راضی ہونے کی دلیل ہے، چنانچہ کفار کہا کرتے تھے کہ ہم اموال و اولاد میں زیادہ ہیں اور ہمیں کسی صورت عذاب نہیں ہو گا۔ دیکھیے سورۂ سبا (۳۵) اور کہف (۳۴ تا ۳۶) اس لیے اللہ تعالیٰ نے مسلمانوں کو تنبیہ کے لیے اس کا رد فرمایا۔ ¤ ➌ { بَلْ لَّا يَشْعُرُوْنَ:} یعنی ان کا یہ گمان درست نہیں، بلکہ حقیقت یہ ہے کہ انھیں شعور ہی نہیں کہ مال و اولاد کی یہ فراوانی انھیں مہلت دینے کے لیے اور ان پر حجت تمام کرنے کے لیے ہے کہ جس قدر انھیں ڈھیل ملے اسی قدر ان کے گناہوں کا پیمانہ اور لبریز ہو اور پھر بھرپور طریقے سے ان پر گرفت کی جائے۔ اہل علم فرماتے ہیں کہ جو شخص اللہ کی نافرمانی کرے اور اللہ کی عطا کردہ نعمتوں میں کمی محسوس نہ کرے وہ فکر کر لے کہ اللہ تعالیٰ کی طرف سے اس کی رسی دراز کی جا رہی ہے۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) ➊ {اِنَّ الَّذِيْنَ هُمْ مِّنْ خَشْيَةِ رَبِّهِمْ مُّشْفِقُوْنَ:’’إِشْفَاقٌ ‘‘} کا معنی ہے متوقع چیز کا شدید خوف اور {’’وَجِلٌ‘‘} بروزن {’’فَزِعٌ‘‘} کا معنی ہے، سخت ڈرنے والا۔ اس سے پہلے غفلت میں مبتلا ان لوگوں کا ذکر فرمایا جن کے ہاں کفر و فسق کے باوجود مال اور بیٹوں کی فراوانی ہوتی جاتی ہے اور وہ سمجھتے ہیں کہ اللہ تعالیٰ ہم پر خوش ہے، تبھی یہ سب کچھ ہمیں دے رہا ہے۔ اب ان کے مقابلے میں مخلص و مومن بندوں کا ذکر ہے، جو کمال ایمان و عمل کے باوجود عجب اور خود پسندی سے محفوظ ہیں اور ہر وقت اس بات سے خوف زدہ رہتے ہیں کہ ہمیں اپنے رب کے حضور پیش ہونا ہے۔ کیا خبر اس کی جناب میں ہمارے عمل قبول ہوتے ہیں یا نہیں۔ ¤ ➋ ان آیات میں اللہ تعالیٰ نے اپنے مخلص مومن بندوں کی چار صفات بیان فرمائی ہیں، پہلی یہ کہ وہ اپنے رب سے بہت ڈرنے والے ہیں کہ وہ ناراض نہ ہو جائے۔ واضح رہے کہ اہل ایمان کا اپنے رب سے یہ خوف اس قسم کا نہیں ہوتا جیسے کسی جابر و ظالم بے رحم سے ہوتا ہے، بلکہ وہ اسے اپنا رب یعنی ہر نعمت عطا کرنے والا سمجھ کر اس کے ساتھ انتہائی محبت کے ساتھ ساتھ اس کی ناراضی کے خطرے سے انتہائی خوف بھی رکھتے ہیں۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) { وَ الَّذِيْنَ هُمْ بِاٰيٰتِ رَبِّهِمْ يُؤْمِنُوْنَ :} دوسری صفت یہ کہ وہ اپنے رب کی آیات پر ایسا یقین رکھتے ہیں جو شک سے پاک ہے۔ چنانچہ وہ یقین انھیں اس کی اطاعت کا پابند کرتا ہے اور اس کی نافرمانی سے باز رکھتا ہے۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) { وَ الَّذِيْنَ هُمْ بِرَبِّهِمْ لَا يُشْرِكُوْنَ :} تیسری صفت یہ کہ وہ اپنے رب کے ساتھ نہ بڑا شرک کرتے ہیں، نہ چھوٹا، نہ جلی، نہ خفی، نہ کسی غیر کی پرستش کرتے ہیں اور نہ کوئی عمل ریا (دکھلاوے) کے لیے کرتے ہیں اور نہ سمعہ (شہرت) کے لیے، بلکہ ان کا ہر عمل اپنے رب کے لیے خالص ہوتا ہے۔ اگرچہ یہ صفت ایمان میں شامل تھی مگر اس کی اہمیت کے پیش نظر اسے الگ بھی ذکر فرمایا۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) {وَ الَّذِيْنَ يُؤْتُوْنَ مَاۤ اٰتَوْا …: ’’ آتٰي يُؤْتِيْ إِيْتَاءً‘‘} کا معنی ہے، دینا۔ عام طور پر اس سے مراد صدقہ و زکوٰۃ لیا جاتا ہے، مگر ابن عباس رضی اللہ عنھما اور سعید بن جبیر رحمہ اللہ نے فرمایا : ’’اس سے نیکی کے تمام اعمال مراد ہیں۔‘‘ (طبری) عربی میں {’’إِيْتَاءٌ‘‘} (دینا) کا لفظ صرف مال یا کوئی مادی چیز دینے ہی کے معنی میں استعمال نہیں ہوتا، بلکہ معنوی چیزیں دینے کے معنی میں بھی بولا جاتا ہے، مثلاً کسی شخص کی اطاعت قبول کر لینے کے لیے کہتے ہیں : {’’آتَيْتُهُ مِنْ نَفْسِي الْقَبُوْلَ‘‘} اور اطاعت قبول نہ کرنے کے لیے کہتے ہیں : {’’آتَيْتُهُ مِنْ نَفْسِي الْإِبَاءَ۔‘‘} ابن عطیہ فرماتے ہیں : ’’یہ معنی زیادہ خوب صورت ہے، گویا فرمایا : {’’وَالَّذِيْنَ يُعْطُوْنَ مِنْ أَنْفُسِهِمْ فِيْ طَاعَةِ اللّٰهِ مَا بَلَغَهُ جُهْدُهُمْ‘‘} ’’یعنی وہ اپنی جانوں کی طرف سے اللہ کی اطاعت میں وہ سب کچھ پیش کر دیتے ہیں جو ان کے آخری بس میں ہوتا ہے۔‘‘ مطلب یہ ہے کہ وہ ہر نیک عمل کرتے ہوئے خود پسندی کا شکار ہونے کے بجائے سخت ڈر رہے ہوتے ہیں کہ ہمیں اپنے رب کے پاس جانا ہے، کیا خبر اس کی جناب میں ہمارا عمل قبول ہوتا ہے یا نہیں اور کیا خبر کہ رب تعالیٰ کے حضور جانے کے وقت ہمارے ایمان و عمل کا کیا حال ہوتا ہے، کیونکہ دار و مدار تو خاتمے پر ہے۔ عائشہ رضی اللہ عنھا بیان کرتی ہیں کہ میں نے پوچھا : [ يَا رَسُوْلَ اللّٰهِ! «{ وَ الَّذِيْنَ يُؤْتُوْنَ مَاۤ اٰتَوْا وَّ قُلُوْبُهُمْ وَجِلَةٌ }» المؤمنون : ۶۰ أَ هُوَ الَّذِيْ يَزْنِيْ وَ يَسْرِقُ وَ يَشْرَبُ الْخَمْرَ؟ قَالَ لَا، يَا بِنْتَ أَبِيْ بَكْرٍ ! أَوْ يَا بِنْتَ الصِّدِّيْقِ! وَلٰكِنَّهُ الرَّجُلُ يَصُوْمُ وَ يَتَصَدَّققُ وَ يُصَلِّيْ، وَ هُوَ يَخَافُ أَنْ لَا يُتَقَبَّلَ مِنْهُ ] [ ابن ماجہ، الزھد، باب التوقي علی العمل : ۴۱۹۸۔ ترمذي:۳۱۷۵۔ سلسلۃ الأحادیث الصحیحۃ:۱۶۲]’’یا رسول اللہ! (اللہ کا فرمان ہے): «{ وَ الَّذِيْنَ يُؤْتُوْنَ مَاۤ اٰتَوْا وَّ قُلُوْبُهُمْ وَجِلَةٌ }» کیا اس سے مراد وہ شخص ہے جو چوری کرتا ہے، زنا کرتا ہے اور شراب پیتا ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’نہیں! اے ابوبکر کی بیٹی! بلکہ یہ وہ لوگ ہیں جو نماز پڑھتے ہیں، روزہ رکھتے ہیں اور صدقہ کرتے ہیں اور وہ ڈر رہے ہوتے ہیں کہ کہیں ایسا نہ ہو کہ ان سے قبول نہ کیا جائے۔‘‘ ترمذی کی حدیث کے آخر میں ہے کہ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «{ اُولٰٓىِٕكَ يُسٰرِعُوْنَ فِي الْخَيْرٰتِ وَ هُمْ لَهَا سٰبِقُوْنَ }» [ المؤمنون : ۶۱ ] ’’یہی (مذکورہ بالا صفات والے) وہ لوگ ہیں جو بھلائیاں حاصل کرنے میں جلدی کرتے ہیں اور یہی لوگ ان کی طرف آگے نکلنے والے ہیں۔‘‘ اس حدیث سے یہ بھی معلوم ہوا کہ {’’ يُؤْتُوْنَ مَاۤ اٰتَوْا ‘‘} سے مراد صرف صدقہ و زکوٰۃ ہی نہیں، بلکہ تمام اعمال ہیں۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) {اُولٰٓىِٕكَ يُسٰرِعُوْنَ فِي الْخَيْرٰتِ …:} یعنی یہ لوگ جن میں یہ چاروں خوبیاں ہیں یہی نیک کاموں میں ایک دوسرے سے بڑھ کر جلدی کرتے ہیں اور یہی لوگ انھیں حاصل کرنے میں سبقت لے جانے والے ہیں۔ (دیکھیے سورۂ واقعہ : ۱۰ تا ۲۶) طبری نے {’’ وَ هُمْ لَهَا سٰبِقُوْنَ ‘‘} کے متعلق ابن عباس رضی اللہ عنھما کا قول حسن سند کے ساتھ نقل کیا ہے، وہ فرماتے ہیں : {’’سَبَقَتْ لَهُمُ السَّعَادَةُ‘‘} ’’یعنی ان کی ان چاروں صفات کی وجہ سے (جو پہلے ہی اللہ کے علم میں ہیں) ان کے لیے پہلے ہی (جلدی بھلائیاں حاصل ہونے کی) سعادت طے ہو چکی ہے۔‘‘ گویا یہ اس آیت کے ہم معنی ہے : « اِنَّ الَّذِيْنَ سَبَقَتْ لَهُمْ مِّنَّا الْحُسْنٰۤى اُولٰٓىِٕكَ عَنْهَا مُبْعَدُوْنَ» [ الأنبیاء : ۱۰۱ ] ’’بے شک وہ لوگ جن کے لیے ہماری طرف سے پہلے بھلائی طے ہوچکی، وہ اس سے دور رکھے گئے ہوں گے۔‘‘"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) ➊ { وَ لَا نُكَلِّفُ نَفْسًا اِلَّا وُسْعَهَا …:} یعنی ہم نے اپنے مومن بندوں کی جو صفات بیان کی ہیں یہ ایسی نہیں ہیں کہ انسان کی وسعت اور گنجائش سے باہر ہوں اور وہ ان پر عمل نہ کر سکتا ہو۔ کیونکہ یہ ہمارا دستور ہی نہیں کہ کسی کو اس کی وسعت سے زیادہ تکلیف دیں۔ اسی لیے جہاں عذر آتا ہے رخصت دے دی جاتی ہے۔ پانی نہیں تو تیمم کر لو، سفر ہے تو نماز قصر کر لو اور روزہ افطار کر لو، بیمار ہو تو بیٹھ کر یا لیٹ کر نماز پڑھ لو، خوف ہے تو پیدل یا سوار ہی پڑھ لو، بھوک سے بے بس ہو تو بقدر ضرورت حرام کھا لو، اگر نفس کی سرکشی سے نافرمانی ہو جائے تو توبہ کرکے پلٹ آؤ۔ پھر اتنی آسانیوں کے بعد بھی بے رخی اور سرکشی کی روش اپناؤ، تو یاد رکھو کہ ہمارے پاس ایک کتاب ہے جو حق کے ساتھ بولتی ہے، جس میں تمھارا چھوٹا، بڑا، ظاہر اور مخفی ہر عمل محفوظ ہے۔ دیکھیے سورۂ کہف (۴۹) اور جاثیہ (۲۹) رازی نے فرمایا : ’’کتاب کو انسان کے ساتھ تشبیہ دی ہے جو بولتا ہے، کیونکہ کتاب تو بولتی نہیں، بلکہ جو اس میں لکھا ہوتا ہے اس کا اظہار کرتی ہے۔‘‘ مگر اب وڈیو کیمرے کے ذریعے سے کسی بھی شخص کے عمل کی تصویر بھی محفوظ ہوتی ہے اور آواز بھی۔ اس لیے اس تاویل کی ضرورت نہیں، کیونکہ اللہ تعالیٰ کی قدرت تو ہمارے خیال سے بھی کہیں بلند ہے، جس کے حکم سے چمڑے اور ہاتھ پاؤں بول کر سب کچھ بتائیں گے، اس کے حکم سے کتاب کا بولنا کون سا بعید ہے۔ ¤ ➋ { وَ هُمْ لَا يُظْلَمُوْنَ :} یعنی نہ کسی کو قصور کے بغیر سزا ملے گی، نہ کسی کا قصور دوسرے کے نامۂ اعمال میں درج ہو گا، نہ کسی عمل کی جزا میں کمی ہو گی اور نہ سزا میں زیادتی۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) { بَلْ قُلُوْبُهُمْ فِيْ غَمْرَةٍ مِّنْ هٰذَا … : ’’ غَمْرَةٍ ‘‘} میں تنوین تہویل کی ہے، اس لیے ترجمہ ’’سخت غفلت‘‘ کیا ہے۔ {’’هٰذَا ‘‘} کا اشارہ ان چیزوں کی طرف ہے جو اس سے پہلے مذکور ہیں، یعنی بات وہ نہیں جو کفار نے سمجھ رکھی ہے کہ اموال و اولاد کی صورت میں انھیں اللہ کی طرف سے بھلائیاں مل رہی ہیں، بلکہ اصل بات یہ ہے کہ ان لوگوں کے دل بھلائیوں کے حصول کا سبب بننے والی صفات (یعنی خشیت الٰہی، آیات پر ایمان، شرک سے اجتناب اور کوئی بھی عمل کرتے ہوئے اس کے قبول نہ ہونے کا خوف رہنا) اور قیامت کے دن کتاب اعمال کے پیش ہونے سے سخت غفلت میں ہیں۔ پھر ان کا جرم یہی نہیں بلکہ ان کے علاوہ اور بھی کئی اعمال ہیں جنھیں وہ ہر حال میں کرنے والے ہیں، تاکہ ان پر حجت تمام ہو اور وہ اپنے کیے کا خمیازہ بھگتیں۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) { حَتّٰۤى اِذَاۤ اَخَذْنَا مُتْرَفِيْهِمْ بِالْعَذَابِ … : ’’ يَجْـَٔرُوْنَ ‘‘ ’’جُؤَارٌ‘‘} درحقیقت گائے یا بیل کے سخت تکلیف میں بلبلانے کو کہتے ہیں۔ عذاب سے مراد بظاہر دنیا میں آنے والا عذاب ہے، خواہ کسی آفت کی صورت میں ہو یا موت کی صورت میں، کیونکہ آسودگی اور خوش حالی کی موجودگی میں وہی آتا ہے۔ عذاب خواہ خوش حال کفار پر آئے یا بدحال کفار پر، چیخنے چلانے اور بلبلانے میں دونوں یکساں ہوتے ہیں، مگر {’’مُتْرَفِيْنَ‘‘} (خوش حال) کا ذکر خاص طور پر اس لیے معلوم ہوتا ہے کہ یہی لوگ حق کی مخالفت میں پیش پیش ہوتے ہیں اور اپنی سرداری کی وجہ سے بدحال لوگوں کے کفر پر قائم رہنے کا باعث بنتے ہیں۔ (دیکھیے سورۂ سبا : ۳۱ تا ۳۳) اس لیے عذاب نازل ہونے کے وقت ان کی حالت بیان فرمائی کہ ان کی ساری شیخی اور اکڑفوں ختم ہو جائے گی اور وہ سخت تکلیف میں مبتلا بیل کی طرح بلبلائیں گے۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) { لَا تَجْـَٔرُوا الْيَوْمَ … :} یعنی اب بلبلانے اور چیخنے چلانے سے کچھ حاصل نہیں، کیونکہ یہ جزا کا وقت ہے، توبہ اور عمل کا وقت ختم ہو گیا۔ اب ہماری طرف سے کسی مدد کی امید مت رکھو۔ دیکھیے سورۂ مومن (۸۲ تا ۸۵)۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) {قَدْ كَانَتْ اٰيٰتِيْ تُتْلٰى عَلَيْكُمْ …: ’’نَكَصَ‘‘} (ض، ن) عموماً کسی خیر کے کام سے پیچھے ہٹنے کو کہتے ہیں۔ ابن عباس رضی اللہ عنھما نے {’’ تَنْكِصُوْنَ ‘‘} کا معنی {’’تُدْبِرُوْنَ‘‘} (پلٹتے تھے) بیان فرمایا ہے۔ (طبری) یعنی یہ عذاب تمھارے اپنے اعمالِ بد ہی کا نتیجہ ہے کہ میری آیات جب تمھارے سامنے پڑھی جاتی تھیں تو تم ایڑیوں کے بل پھر جاتے تھے، تمھیں سننا تک گوارا نہ تھا۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) ➊ {’’ مُسْتَكْبِرِيْنَ‘‘} یہ {’’ تَنْكِصُوْنَ ‘‘} کی ضمیر سے حال ہے، یعنی ہماری آیات کی تلاوت کے وقت تمھارا الٹے پاؤں پھر جانا کسی خوف یا مصروفیت یا کسی اور وجہ سے نہیں تھا، بلکہ تم محض تکبر کرتے ہوئے سننے سے اجتناب کے لیے ایڑیوں پر پھر جاتے تھے۔ ¤ ➋ { بِهٖ سٰمِرًا تَهْجُرُوْنَ : ’’سَمَرَ يَسْمُرُ سَمْرًا وَ سُمُوْرًا فَهُوَ سَامِرٌ‘‘} (ن) رات کو دوستوں کے ساتھ بیٹھ کر باتیں کرنا اور قصے کہانیاں سنانا۔ {’’هَجَرَ يَهْجُرُ هَجْرًا وَ هِجْرَةً‘‘} چھوڑنا اور {’’هُجْرًا‘‘} بے ہودہ، لغو اور فضول باتیں کرنا، بکواس کرنا۔ {’’ بِهٖ ‘‘} کی ضمیر قرآن کی طرف جاتی ہے، جو آیات کے ضمن میں مذکور ہے، یعنی رات کو باتیں کرتے ہوئے تم اس قرآن کے متعلق بے ہودہ گوئی اور بکواس کیا کرتے تھے۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) ➊ { اَفَلَمْ يَدَّبَّرُوا الْقَوْلَ …:} ان آیات میں اللہ تعالیٰ نے پانچ چیزیں بیان فرمائی ہیں کہ اگر ان میں سے کوئی بھی سبب ہوتا تو کفار کا رسول اللہ صلی اللہ علیہ وسلم اور قرآن پر ایمان نہ لانا معقول تھا، مگر جب ان میں سے کوئی بات بھی نہیں تو ان کے پاس انکار، تکبر اور مذاق اڑانے کا کوئی عذر نہیں۔ ¤ ➋ { اَفَلَمْ يَدَّبَّرُوا الْقَوْلَ:} یعنی کیا ان کے ایمان نہ لانے کی وجہ یہ ہے کہ اس کلام کو انھوں نے سمجھا نہیں۔ ظاہر ہے کہ یہ وجہ نہیں، قرآن کوئی پہیلی نہیں، کسی ایسی زبان میں نہیں جو ان کی سمجھ سے باہر ہو۔ اس میں کوئی ایسی بات نہیں جو آدمی کی سمجھ سے بالا ہو، وہ اس کی ایک ایک بات کو سمجھتے ہیں۔ مخالفت اس لیے نہیں کر رہے کہ انھوں نے سمجھنے کی کوشش کی اور انھیں سمجھ نہیں آیا، بلکہ اس لیے مخالفت کر رہے ہیں کہ وہ ماننا نہیں چاہتے۔ ¤ ➌ {اَمْ جَآءَهُمْ مَّا لَمْ يَاْتِ اٰبَآءَهُمُ الْاَوَّلِيْنَ :} یعنی یا ان کے انکار کی یہ وجہ ہے کہ اس نے کوئی نرالی بات پیش کی ہے جو کبھی کسی کے سننے ہی میں نہیں آئی؟ ظاہر ہے یہ بات بھی نہیں۔ اللہ تعالیٰ کی طرف سے انبیاء ہمیشہ آتے رہے ہیں، یہ کوئی پہلا رسول نہیں۔ فرمایا : « قُلْ مَا كُنْتُ بِدْعًا مِّنَ الرُّسُلِ » [ الأحقاف : ۹ ] ’’کہہ دیجیے میں رسولوں میں سے کوئی انوکھا نہیں ہوں۔‘‘ ان کے گرد و پیش عراق، شام اور مصر میں کئی انبیاء آئے ہیں، ان کی اپنی سرزمین میں ابراہیم اور اسماعیل علیھما السلام آئے، ہود، صالح اور شعیب علیھم السلام آئے۔ یہ خود ان کو سچے رسول مانتے ہیں اور جانتے ہیں کہ وہ مشرک نہ تھے، بلکہ توحید کی دعوت لے کر آئے تھے۔ غرض ان کے انکار کی وجہ یہ بھی نہیں کہ ان کے پاس نبی صلی اللہ علیہ وسلم کی آمد کوئی انوکھی بات ہے۔ ¤ تنبیہ : قرآن میں جہاں یہ ذکر ہے کہ آپ صلی اللہ علیہ وسلم کو ان لوگوں کی طرف بھیجا گیا جن کے آباء کی طرف کوئی رسول نہیں آیا، وہاں مراد قریب زمانے میں رسول کا نہ آنا ہے اور یہاں مراد بعید زمانے میں رسول کا آنا ہے، جو ان کے بھی علم میں ہے، کیونکہ ابراہیم، اسماعیل، ہود، صالح اور شعیب علیھم السلام کو وہ لوگ بھی رسول مانتے تھے۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) { اَمْ لَمْ يَعْرِفُوْا رَسُوْلَهُمْ فَهُمْ لَهٗ مُنْكِرُوْنَ :} تیسری وجہ ان کے ایمان نہ لانے کی یہ ہو سکتی ہے کہ ایک بالکل اجنبی آدمی ان میں اٹھ کر کھڑا ہو گیا ہو کہ مجھے رسول مانو، جس کے حسب نسب، صدق و امانت اور حسن اخلاق کو وہ نہ جانتے ہوں، سو یہ وجہ بھی نہیں، کیونکہ وہ ان میں سے سب سے عالی خاندان کا فرد اور عالی اخلاق کا مالک ہے۔ اس دعویٰ سے پہلے چالیس سال تک وہ ان میں رہا۔ تفصیل کے لیے دیکھیے سورۂ یونس (۱۶)۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) ➊ {اَمْ يَقُوْلُوْنَ بِهٖ جِنَّةٌ …:’’ جِنَّةٌ ‘‘} پر تنوین تنکیر کی ہے، یعنی یہ کہتے ہیں کہ اس کو کسی قسم کا جنون ہے۔ چوتھی وجہ ان کے انکار کی یہ ہو سکتی ہے کہ وہ کہتے ہوں کہ اسے کسی قسم کا جنون ہے اور واقعی وہ آپ کو کسی قسم کا دیوانہ یا پاگل سمجھتے ہوں۔ ظاہر ہے کہ یہ بھی اصل وجہ نہیں ہے، کیونکہ وہ ہٹ دھرمی سے اپنی زبان سے جو چاہیں کہتے رہیں، مگر دل سے آپ صلی اللہ علیہ وسلم کی کمال دانائی کے قائل ہیں، کیونکہ خود انھوں نے صادق اور امین کا لقب دیا ہے۔ بھلا پاگلوں کو یہ لقب دیا جاتا ہے، پھر وہ کیسا دیوانہ ہے (یا مستشرقین کی ہرزہ سرائی کے مطابق مرگی کے دورے کا مریض ہے) کہ دیوانگی یا مرگی کے دورے کے وقت اس کی زبان سے قرآن جیسا کلام نکلتا ہے، جس کی سب سے چھوٹی سورت کا جواب پیش کرنے سے پوری کائنات قاصر ہے اور جس نے تیئیس (۲۳) برس کے مختصر عرصے میں ساری دنیا کی کایا پلٹ کر رکھ دی۔ ¤ ➋ { بَلْ جَآءَهُمْ بِالْحَقِّ وَ اَكْثَرُهُمْ لِلْحَقِّ كٰرِهُوْنَ :} جب یہ بات بھی نہیں تو نتیجہ یہی ہے کہ جو دعوت اس رسول نے پیش کی ہے وہ حق ہے، جب کہ ان کے اکثر حق بات کو ناپسند کرتے ہیں، کیونکہ وہ ان کی شتر بے مہار خواہشات اور حیوانی خصلتوں کے خلاف ہے۔ چنانچہ وہ اپنی ضد اور ہٹ دھرمی کی وجہ سے یہ سچی بات قبول کرنے کے لیے تیار نہیں ہیں۔ فرمایا : ’’ان میں سے اکثر حق کو ناپسند کرتے ہیں۔‘‘ کیونکہ جو حق پسند تھے وہ ایمان لے آئے۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) ➊ { وَ لَوِ اتَّبَعَ الْحَقُّ اَهْوَآءَهُمْ …:} یعنی اگر حق ان کی خواہشات کے پیچھے چلے تو زمین و آسمان کا یہ سلسلہ تباہ ہو جائے، کیونکہ ان میں سے ہر ایک کی خواہش دوسرے کی خواہش سے ٹکراتی ہے اور ان کا علم محدود ہے، نہ پوری موجود کائنات کا علم رکھتے ہیں، نہ آئندہ کی کچھ خبر رکھتے ہیں۔ ان کی خواہشات پر عمل کا نتیجہ بربادی کے سوا کچھ نہیں ہو گا۔ دور کیوں جائیے، ملکوں کے منتخب نمائندے ایک قانون بناتے ہیں، جب اس کی خرابیاں سامنے آتی ہیں تو اسے ختم کر کے اور بنا دیتے ہیں، کچھ دیر کے بعد اسے بھی بدلنا پڑتا ہے۔ کتنے قانون انھوں نے خود بنائے، جن کے نتیجے میں وہ خود پھانسی کے پھندے میں جھول گئے۔ پھر یہ لوگ تو اللہ کے سوا کئی معبودوں کی پرستش کرتے ہیں، اگر ان کی خواہش کے مطابق ایک سے زیادہ معبودوں کے ہاتھ میں کائنات کا نظام دے دیا جائے تو سوچ لو کہ ایک لمحے کے لیے بھی یہ سلسلہ چل سکتا ہے؟ یہ کائنات تو صرف ایک مالک کے حکم پر چل رہی ہے، جو خود حق ہے، اس کا کلام حق ہے اور اس کا سب کچھ برحق ہے۔ دیکھیے سورۂ انبیاء کی آیت (۲۲) : «لَوْ كَانَ فِيْهِمَاۤ اٰلِهَةٌ اِلَّا اللّٰهُ لَفَسَدَتَا » کی تفسیر۔ ¤ ➋ { بَلْ اَتَيْنٰهُمْ بِذِكْرِهِمْ … :} ذکر کے دو معنی ہیں، ایک نصیحت اور ایک عز و شرف اور ناموری، یہاں دونوں درست ہیں۔ نصیحت اس لیے کہ کفار مکہ کہہ سکتے تھے : « لَوْ اَنَّاۤ اُنْزِلَ عَلَيْنَا الْكِتٰبُ لَكُنَّاۤ اَهْدٰى مِنْهُمْ» [ الأنعام : ۱۵۷ ] ’’اگر ہم پر کتاب نازل کی جاتی تو ہم پہلی امتوں سے زیادہ ہدایت یافتہ ہوتے۔‘‘ اللہ تعالیٰ نے ان کو شکوے کا موقع ہی نہیں دیا اور خود ہی وہ کتاب نازل فرما دی جو ان کے لیے نصیحت ہے، مگر چونکہ اس میں ان کے عیوب اور خامیوں کی اصلاح کی بات تھی، اس لیے تکبر اور ہٹ دھرمی کی وجہ سے وہ اسے تسلیم کرنے کے بجائے اپنی ہی نصیحت اور خیر خواہی کی بات سے منہ موڑنے والے بن گئے۔ فعل ماضی {’’أَعْرَضُوْا‘‘} کے بجائے اسم فاعل {’’ مُعْرِضُوْنَ ‘‘} کا مطلب یہ ہے کہ انھوں نے صرف ایک دو بار ہی منہ نہیں موڑا، بلکہ پکے منہ موڑنے والے بن گئے۔ ذکر کا دوسرا معنی عز و شرف اور شہرت و ناموری ہے، یعنی یہ قرآن ایمان لانے والوں، خصوصاً عرب کے لیے تمام دنیا میں قیامت تک کے لیے عز و شرف اور ناموری کا باعث ہے، مگر یہ ایسے بدنصیب ہیں کہ انھیں اپنی ناموری اور اپنا عز و شرف بھی راس نہیں آتا۔ یہ دوسرا مطلب یہاں زیادہ موزوں معلوم ہوتا ہے۔ (واللہ اعلم)"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) { اَمْ تَسْـَٔلُهُمْ خَرْجًا …: ’’خَرْجٌ‘‘} اور {’’خَرَاجٌ‘‘} کسی شخص کو ادا کیا جانے والا روزانہ، ماہانہ یا سالانہ عطیہ۔ یہ ان کے انکار کی پانچویں وجہ ہے، جو ممکن ہو سکتی تھی۔ اللہ تعالیٰ نے فرمایا، یا پھر یہ وجہ ہو سکتی ہے کہ آپ ان سے روزانہ، ماہانہ یا سالانہ کسی تنخواہ کا سوال کرتے ہوں، جسے وہ بوجھ محسوس کرتے ہوں، تو ان سے کہہ دیجیے کہ مجھے تم سے کسی اجرت کی ضرورت نہیں۔ کیونکہ ان کا دیا ہوا تو ختم ہو جائے گا مگر دنیا اور آخرت میں آپ کے رب کی طرف سے عطا کیا جانے والا رزق کبھی ختم ہونے والا نہیں اور اس سے بہتر روزی دینے والا کوئی نہیں۔ مطلب یہ ہے کہ جب آپ دعوت حق کا یہ کام بالکل بے لوث ہو کر کر رہے ہیں اور ان سے کوئی حق الخدمت طلب نہیں کرتے تو ان کا آپ کی دعوت کو ٹھکرانا سراسر حماقت اور عاقبت نااندیشی ہے۔ قرآن مجید میں اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم کو کئی جگہ صاف اعلان کرنے کا حکم دیا ہے کہ میں تم سے کسی اجرت یا بدلے کا مطالبہ نہیں کرتا۔ مثلاً سورۂ ص (۸۶) وغیرہ۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) { وَ اِنَّكَ لَتَدْعُوْهُمْ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ :} یعنی ان پانچوں باتوں میں سے ایک کا وجود بھی نہیں، جس کی وجہ سے یہ آپ کو جھٹلا سکیں۔ بلکہ حقیقت یہ ہے کہ آپ انھیں بالکل سیدھے راستے کی طرف دعوت دیتے ہیں، جسے کوئی الٹی سمجھ والا ہی ٹھکرا سکتا ہے۔ صراط مستقیم سے مراد اسلام ہے۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) { وَ اِنَّ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ عَنِ الصِّرَاطِ لَنٰكِبُوْنَ :} یعنی سیدھے راستے سے ہٹنے کا اصل باعث آخرت پر ایمان کا نہ ہونا ہے۔ اگر پختہ یقین ہو کہ آخرت کو اللہ کے حضور پیش ہونا ہے تو ممکن نہیں کہ آدمی صحیح راستہ جاننے کے بعد غلط راستوں پر چلتا رہے۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) {وَ لَوْ رَحِمْنٰهُمْ وَ كَشَفْنَا مَا بِهِمْ مِّنْ ضُرٍّ … :} اس آیت کی ایک تفسیر وہ ہے جو ابن عاشور نے ’’التحریر والتنویر‘‘ میں اور بقاعی نے ’’نظم الدرر‘‘ میں فرمائی ہے۔ روح المعانی میں بھی اسے ایک امکان کے طو ر پر بیان کیا گیا ہے۔ وہ تفسیر یہ ہے کہ اس آیت کا عطف آیت (۶۴) : «{ حَتّٰۤى اِذَاۤ اَخَذْنَا مُتْرَفِيْهِمْ بِالْعَذَابِ اِذَا هُمْ يَجْـَٔرُوْنَ }» (یہاں تک کہ جب ہم ان کے خوش حال لوگوں کو عذاب میں پکڑیں گے، اچانک وہ بلبلا رہے ہوں گے) پر ہے اور اس آیت اور اُس آیت کے درمیان کی آیات جملہ ہائے معترضہ ہیں، جن سے مقصود ان کے خلاف دلائل کا ذکر اور ان کے عذر بہانے ختم کرنا ہے۔ یعنی اگر ہم ان کے چیخنے، پکارنے اور بلبلانے پر رحم کرکے ان پر آنے والا عذاب دور کر دیں، تب بھی وہ اپنی سرکشی سے باز نہیں آئیں گے، بلکہ اسی پر اڑے رہیں گے اور اسی میں سر مارتے پھریں گے، کیونکہ کفر اور سرکشی ان کی طبعی خصلت بن چکی ہے، جو کسی طرح ان سے جدا نہیں ہو سکتی۔ اسی طرح فرمایا : «{ وَ لَوْ رُدُّوْا لَعَادُوْا لِمَا نُهُوْا عَنْهُ وَ اِنَّهُمْ لَكٰذِبُوْنَ }» [ الأنعام : ۲۸ ] ’’اور اگر انھیں واپس بھیج دیا جائے تو ضرور پھر وہی کریں گے جس سے انھیں منع کیا گیا تھا اور بلاشبہ وہ یقینا جھوٹے ہیں۔‘‘ آیات کے سیاق سے یہ تفسیر نہایت مناسب ہے۔ ¤ دوسری تفسیر شیخ عبد الرحمان سعدی نے کی ہے کہ اس میں کفار کی شدید سرکشی اور ہٹ دھرمی کا بیان ہے کہ جب وہ اللہ تعالیٰ کی طرف سے کسی مصیبت میں گرفتار ہوتے ہیں، مثلاً قحط پڑ جاتا ہے، بھوک سے لاچار ہو جاتے ہیں، سمندری طوفان میں گھر جاتے ہیں، یا کوئی وبا آ گھیرتی ہے تو خلوصِ دل کے ساتھ اللہ تعالیٰ سے اسے دور کرنے کی دعا کرتے ہیں، پھر اگر اللہ تعالیٰ ان پر رحم فرما کر وہ مصیبت دور کر دے تو بھی وہ اپنے کفر اور سرکشی پر اڑے رہتے ہیں اور اسی میں سر مارتے پھرتے ہیں، جیسا کہ فرمایا : «وَ اِذَاۤ اَذَقْنَا النَّاسَ رَحْمَةً مِّنْۢ بَعْدِ ضَرَّآءَ مَسَّتْهُمْ اِذَا لَهُمْ م مَّكْرٌ فِيْۤ اٰيَاتِنَا قُلِ اللّٰهُ اَسْرَعُ مَكْرًا اِنَّ رُسُلَنَا يَكْتُبُوْنَ مَا تَمْكُرُوْنَ (21) هُوَ الَّذِيْ يُسَيِّرُكُمْ فِي الْبَرِّ وَ الْبَحْرِ حَتّٰۤى اِذَاا كُنْتُمْ فِي الْفُلْكِ وَ جَرَيْنَ بِهِمْ بِرِيْحٍ طَيِّبَةٍ وَّ فَرِحُوْا بِهَا جَآءَتْهَا رِيْحٌ عَاصِفٌ وَّ جَآءَهُمُ الْمَوْجُ مِنْ كُلِّ مَكَانٍ وَّ ظَنُّوْۤا اَنَّهُمْ اُحِيْطَ بِهِمْ دَعَوُاا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ لَىِٕنْ اَنْجَيْتَنَا مِنْ هٰذِهٖ لَنَكُوْنَنَّ مِنَ الشّٰكِرِيْنَ (22) فَلَمَّاۤ اَنْجٰىهُمْ اِذَا هُمْ يَبْغُوْنَ فِي الْاَرْضِ بِغَيْرِ الْحَقِّ » [ یونس : ۲۱ تا ۲۳ ] ’’اور جب ہم لوگوں کو کوئی رحمت چکھاتے ہیں، کسی تکلیف کے بعد، جو انھیں پہنچی ہو، تو اچانک ان کے لیے ہماری آیات کے بارے میں کوئی نہ کوئی چال ہوتی ہے۔ کہہ دے اللہ چال میں زیادہ تیز ہے۔ بے شک ہمارے بھیجے ہوئے لکھ رہے ہیں جو تم چال چلتے ہو۔ وہی ہے جو تمھیں خشکی اور سمندر میں چلاتا ہے، یہاں تک کہ جب تم کشتیوں میں ہوتے ہو اور وہ انھیں لے کر عمدہ ہوا کے ساتھ چل پڑتی ہیں اور وہ اس پر خوش ہوتے ہیں تو ان (کشتیوں) پر سخت تیز ہوا آجاتی ہے اور ان پر ہرجگہ سے موج آجاتی ہے اور وہ یقین کر لیتے ہیں کہ ان کو گھیر لیا گیا ہے، تو اللہ کو اس طرح پکارتے ہیں کہ ہر عبادت کو اس کے لیے خالص کرنے والے ہوتے ہیں، یقینا اگر تو نے ہمیں اس سے نجات دے دی تو ہم ضرور ہی شکر کرنے والوں سے ہوں گے۔ پھر جب اس نے انھیں نجات دے دی اچانک وہ زمین میں ناحق سرکشی کرنے لگتے ہیں۔‘‘"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 77،76) { وَ لَقَدْ اَخَذْنٰهُمْ بِالْعَذَابِ … : ’’ اَخَذْنٰهُمْ ‘‘} (ہم نے انھیں پکڑا) میں {’’هُمْ‘‘} ({اُن}) سے مراد موجودہ کفار و منکرین نہیں بلکہ اس سے مراد ان جیسے وہ منکرین ہیں جو ان سے پہلے گزر چکے ہیں اور جو اپنے اپنے دور میں اسی طرح کے کفر و انکار پر اڑے ہوئے تھے۔ موجودہ دور کے منکرین کو تاریخ کے اس سبق کی طرف توجہ دلائی گئی ہے کہ ایسے لوگ اللہ تعالیٰ کی طرف سے تنبیہ کے لیے آنے والے عذابوں سے سبق نہیں لیتے، یہاں تک کہ وہ اپنے آخری ہولناک انجام کو پہنچ کر رہتے ہیں۔ یہ بھی اللہ تعالیٰ کی رحمت ہے کہ وہ پہلے کمتر درجے کا عذاب بھیجتا ہے، تاکہ لوگ سنبھل جائیں، فرمایا : «{ وَ لَنُذِيْقَنَّهُمْ مِّنَ الْعَذَابِ الْاَدْنٰى دُوْنَ الْعَذَابِ الْاَكْبَرِ }» [ السجدۃ : ۲۱ ] ’’اور یقینا ہم انھیں قریب ترین عذاب کا کچھ حصہ سب سے بڑے عذاب سے پہلے ضرور چکھائیں گے۔ ‘‘ پھر جب لوگ اس عذاب سے عبرت نہیں پکڑتے تو ان کی رسی دراز کر دی جاتی ہے اور انھیں نافرمانی کے باوجود خوش حالی عطا کر دی جاتی ہے، تاکہ ان پر حجت تمام ہو جائے۔ قرآن مجید میں یہ مضمون کثرت سے بیان ہوا ہے۔ دیکھیے سورۂ انعام ( ۴۲ تا ۴۴)، اعراف (۹۴ تا ۹۸)، یونس (۱۲ تا ۲۱) اور دخان (۱۰ تا ۱۶)۔ ¤ بعض مفسرین نے اس عذاب سے مراد وہ قحط لیا ہے جو ہجرت سے پہلے مکہ والوں پر رسول اللہ صلی اللہ علیہ وسلم کی بد دعا سے مسلط ہوا اور سخت عذاب والے دروازے سے مراد یوم بدر لیا ہے، جبکہ بعض نے اس عذاب سے مراد بدر اور سخت عذاب والے دروازے سے مراد ہجرت کے بعد ثمامہ بن اثال رضی اللہ عنہ کے گندم روک لینے سے واقع ہونے والا قحط لیا ہے۔ ابن جزی ’’التسہیل‘‘ میں فرماتے ہیں : ’’زیادہ راجح یہ ہے کہ پہلے عذاب سے مراد دنیا کا عذاب ہے اور شدید عذاب سے مراد موت اور آخرت کا عذاب ہے۔ کیونکہ شدید عذاب وہی ہے، دنیا کا عذاب اس کے مقابلے میں ادنیٰ ہے۔‘‘ اور فرمایا : «{ اِذَا هُمْ فِيْهِ مُبْلِسُوْنَ }» یعنی ہر خیر سے ناامید ہوں گے۔ کفار کو یہ ناامیدی آخرت کے دن ہو گی، جیسا کہ فرمایا : «{ وَ يَوْمَ تَقُوْمُ السَّاعَةُ يُبْلِسُ الْمُجْرِمُوْنَ }» [ الروم : ۱۲ ] ’’اور جس دن قیامت قائم ہوگی مجرم نا امید ہو جائیں گے۔‘‘ بدر اور قحط کے بعد تو وہ بار بار حملہ آور ہوتے رہے تھے۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77،76) { وَ لَقَدْ اَخَذْنٰهُمْ بِالْعَذَابِ … : ’’ اَخَذْنٰهُمْ ‘‘} (ہم نے انھیں پکڑا) میں {’’هُمْ‘‘} ({اُن}) سے مراد موجودہ کفار و منکرین نہیں بلکہ اس سے مراد ان جیسے وہ منکرین ہیں جو ان سے پہلے گزر چکے ہیں اور جو اپنے اپنے دور میں اسی طرح کے کفر و انکار پر اڑے ہوئے تھے۔ موجودہ دور کے منکرین کو تاریخ کے اس سبق کی طرف توجہ دلائی گئی ہے کہ ایسے لوگ اللہ تعالیٰ کی طرف سے تنبیہ کے لیے آنے والے عذابوں سے سبق نہیں لیتے، یہاں تک کہ وہ اپنے آخری ہولناک انجام کو پہنچ کر رہتے ہیں۔ یہ بھی اللہ تعالیٰ کی رحمت ہے کہ وہ پہلے کمتر درجے کا عذاب بھیجتا ہے، تاکہ لوگ سنبھل جائیں، فرمایا : «{ وَ لَنُذِيْقَنَّهُمْ مِّنَ الْعَذَابِ الْاَدْنٰى دُوْنَ الْعَذَابِ الْاَكْبَرِ }» [ السجدۃ : ۲۱ ] ’’اور یقینا ہم انھیں قریب ترین عذاب کا کچھ حصہ سب سے بڑے عذاب سے پہلے ضرور چکھائیں گے۔ ‘‘ پھر جب لوگ اس عذاب سے عبرت نہیں پکڑتے تو ان کی رسی دراز کر دی جاتی ہے اور انھیں نافرمانی کے باوجود خوش حالی عطا کر دی جاتی ہے، تاکہ ان پر حجت تمام ہو جائے۔ قرآن مجید میں یہ مضمون کثرت سے بیان ہوا ہے۔ دیکھیے سورۂ انعام ( ۴۲ تا ۴۴)، اعراف (۹۴ تا ۹۸)، یونس (۱۲ تا ۲۱) اور دخان (۱۰ تا ۱۶)۔ ¤ بعض مفسرین نے اس عذاب سے مراد وہ قحط لیا ہے جو ہجرت سے پہلے مکہ والوں پر رسول اللہ صلی اللہ علیہ وسلم کی بد دعا سے مسلط ہوا اور سخت عذاب والے دروازے سے مراد یوم بدر لیا ہے، جبکہ بعض نے اس عذاب سے مراد بدر اور سخت عذاب والے دروازے سے مراد ہجرت کے بعد ثمامہ بن اثال رضی اللہ عنہ کے گندم روک لینے سے واقع ہونے والا قحط لیا ہے۔ ابن جزی ’’التسہیل‘‘ میں فرماتے ہیں : ’’زیادہ راجح یہ ہے کہ پہلے عذاب سے مراد دنیا کا عذاب ہے اور شدید عذاب سے مراد موت اور آخرت کا عذاب ہے۔ کیونکہ شدید عذاب وہی ہے، دنیا کا عذاب اس کے مقابلے میں ادنیٰ ہے۔‘‘ اور فرمایا : «{ اِذَا هُمْ فِيْهِ مُبْلِسُوْنَ }» یعنی ہر خیر سے ناامید ہوں گے۔ کفار کو یہ ناامیدی آخرت کے دن ہو گی، جیسا کہ فرمایا : «{ وَ يَوْمَ تَقُوْمُ السَّاعَةُ يُبْلِسُ الْمُجْرِمُوْنَ }» [ الروم : ۱۲ ] ’’اور جس دن قیامت قائم ہوگی مجرم نا امید ہو جائیں گے۔‘‘ بدر اور قحط کے بعد تو وہ بار بار حملہ آور ہوتے رہے تھے۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) ➊ { وَ هُوَ الَّذِيْۤ اَنْشَاَ لَكُمُ السَّمْعَ وَ الْاَبْصَارَ … :} اس سے پہلے کفار کا ذکر غائب کے صیغے کے ساتھ تھا، اب انھیں مخاطب کرکے احسانات یاد دلائے۔ یہ غائب سے مخاطب کی طرف التفات ہے، کیونکہ بعض اوقات وعید کا اثر نہیں ہوتا، ہاں! کسی احسان کی خوشگوار یاد دل کو مائل کر دیتی ہے۔ ¤ ➋ { وَ هُوَ الَّذِيْۤ اَنْشَاَ لَكُمُ السَّمْعَ …:} یعنی وہ لوگ نہ اپنے رب کے لیے جھکے اور نہ عاجزی اختیار کی، حالانکہ رب صرف وہ ہے، کوئی اور نہیں۔ جس نے کسی پہلے نمونے کے بغیر تمھارے لیے کان، آنکھیں اور دل پیدا فرمائے، جو سننے، دیکھنے اور سمجھنے کے مرکز ہیں۔ ان تینوں چیزوں کا ذکر اس لیے فرمایا کہ جسم کی تمام نعمتیں ان کے تابع ہیں، یہ نہ ہوں تو کچھ بھی نہیں۔ ¤ ➌ { قَلِيْلًا مَّا تَشْكُرُوْنَ :} یہ بات کہ تم بہت ہی کم شکر کرتے ہو، کئی طرح سمجھی جا سکتی ہے۔ مثلاً سوچو، کوئی آدمی اگر تمھیں یہ تینوں نعمتیں دے اور تم اس کا بدلا دینا چاہو تو کیا دے سکتے ہو؟ یا اس طرح سوچو کہ اگر اللہ تعالیٰ یہ تینوں نعمتیں تم سے چھین لے تو تمھارا کیا حال ہو گا؟ اب جو اس نے یہ سب کچھ تمھیں دے رکھا ہے تو ان نعمتوں کا شکر ادا کرتے ہوئے تم اس کی کس قدر فرماں برداری کر رہے ہو؟ اس سے بڑی ناشکری کیا ہو ـگی کہ اپنا خالق و مالک مانتے ہوئے اس اکیلے کی عبادت کے بجائے تم نے اس کے شریک بنا رکھے ہیں، جنھوں نے کچھ پیدا ہی نہیں کیا اور اس کے رسول پر ایمان لانے کے بجائے تم اسے جھٹلا رہے ہو؟ ان حواس کی شکر گزاری تو یہ ہے کہ ان کے ذریعے سے صحیح راستے کی طرف رہنمائی حاصل کرو، ورنہ ان کے ذریعے سے جسمانی اور مادی خواہش تو دوسرے حیوانات بھی پوری کر رہے ہیں۔ تمھارا حق یہ ہے کہ کائنات میں توحید کے جو دلائل پائے جاتے ہیں ان حواس کے ذریعے سے ان دلائل کو آنکھوں سے دیکھو، کانوں سے سنو اور دل سے سمجھو اور توحیدِ الٰہی پر دل و جان سے ایمان رکھو۔ ¤ ➍ {’’ قَلِيْلًا مَّا تَشْكُرُوْنَ ‘‘} کا معنی یہ بھی ہو سکتا ہے کہ تم شکر کرتے ہی نہیں، کیونکہ عرب {’’قَلِيْلٌ‘‘} کو نہ ہونے کے معنی میں بھی استعمال کرتے ہیں، جیسا کہ ابوکبیر ہذلی نے {’’تَأَبَّطَ شَرًّا‘‘} کی تعریف کرتے ہوئے کہا ہے: ¤ {قَلِيْلُ التَّشَكِّيْ لِلْمُهِمِّ يُصِيْبُهُ ¤ كَثِيْرُ الْهَوٰي شَتَّي النَّوٰي وَ الْمَسَالِكِ} ¤ ’’وہ پیش آنے والی مہمات کی شکایت بہت کم کرنے والا ہے، بہت سے مقاصد والا، مختلف نیتوں اور راستوں والا ہے۔‘‘ ’’شکایت بہت کم کرنے والا‘‘ سے مراد یہ ہے کہ وہ شکایت کرتا ہی نہیں۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79) { وَ هُوَ الَّذِيْ ذَرَاَكُمْ … :} یہ اللہ تعالیٰ کے ’’وحدہ لا شریک لہ‘‘ ہونے کی دوسری دلیل ہے اور قیامت کی بھی کہ جس اکیلے نے تمھیں وجود کی نعمت عطا کرکے ساری دنیا میں پھیلا دیا، وہ تمھیں سمیٹنے پر بھی قادر ہے اور یاد رکھو کہ اس اکیلے ہی کی طرف تمھیں دوبارہ اکٹھا کیا جائے گا۔"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) ➊ { وَ هُوَ الَّذِيْ يُحْيٖ وَ يُمِيْتُ …:} اکٹھا کرنے کے ذکر کے ساتھ ہی اللہ تعالیٰ کے ساری کائنات کو اپنی مرضی کے مطابق چلانے کا ذکر فرمایا۔ خصوصاً ان کاموں کا ذکر فرمایا جو ایک دوسرے کی ضد ہیں، تاکہ مرنے کے بعد دوبارہ زندگی کی دلیل بن سکیں۔ چنانچہ فرمایا، اور وہی زندگی بخشتا اور موت دیتا ہے اور رات اور دن کا بدلنا بھی اسی کے قبضے میں ہے۔ یہ توحید کی بھی دلیل ہے اور قیامت کی بھی کہ موت و حیات اور اندھیرے و اجالے کو یکے بعد دیگرے لانے والے کے لیے تمھیں موت کے بعد زندگی عطا کرنا اور تمھیں قیامت کو زندہ کرکے حساب کے لیے سامنے لا کھڑا کرنا کیا مشکل ہے؟ فرمایا : «كَمَا بَدَاَكُمْ تَعُوْدُوْنَ » [ الأعراف : ۲۹ ] ’’جس طرح اس نے تمھاری ابتدا کی، اسی طرح تم دوبارہ پیدا ہو گے۔‘‘ ¤ ➋ { اَفَلَا تَعْقِلُوْنَ :} ہمزہ استفہام اصل میں فاء کے بعد ہے، مگر چونکہ اس کا مقام کلام کی ابتدا ہے، اس لیے اسے فاء سے پہلے لایا گیا ہے، یعنی تو کیا تم اتنی واضح بات بھی نہیں سمجھتے؟ یا یوں کہہ لیجیے، تو کیا تم کوئی بات بھی نہیں سمجھتے؟"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 82،81) ➊ { بَلْ قَالُوْا مِثْلَ مَا قَالَ الْاَوَّلُوْنَ:} یہاں پھر اللہ تعالیٰ نے اپنی ناراضی کے اظہار کے لیے انھیں مخاطب کرنا چھوڑ کر ان کا ذکر غائب کے صیغے کے ساتھ کرنا شروع کر دیا، گویا اتنی واضح دلیلوں کے بعد بھی انکار پر اڑے رہنے کی وجہ سے وہ اس قابل نہیں کہ انھیں مخاطب کیا جائے۔ ¤ ➋ مرنے کے بعد زندگی کا انکار صرف قیامت کا انکار نہیں، بلکہ اللہ تعالیٰ کی قدرت اور حکمت کا بھی انکار ہے اور شرک ہی کا شاخسانہ ہے۔ جو شخص رب تعالیٰ کو ایک مانتا ہو اور اس کی قدرت و حکمت پر ایمان رکھتا ہو وہ کبھی قیامت کا انکار نہیں کر سکتا۔ ¤ ➌ یعنی ان لوگوں کے پاس اپنے آباء کی تقلید کے سوا قیامت کے انکار اور دوسرے غلط عقائد و اعمال کے لیے کوئی عقلی یا نقلی دلیل نہیں ہے۔ ¤ ➍ {قَالُوْۤا ءَاِذَا مِتْنَا وَ كُنَّا تُرَابًا …:} ’’جب ہم مر جائیں گے‘‘ ہی کافی تھا، مگر اس کے بعد ’’اور ہم مٹی اور ہڈیاں ہو جائیں گے ‘‘ کے الفاظ کے ساتھ وہ اپنے خیال میں مرنے کے بعد زندگی کے عقل سے بعید ہونے کی بات بہت مدلل کر رہے ہیں اور {’’ ءَاِنَّا لَمَبْعُوْثُوْنَ‘‘} میں {’’إِنَّ‘‘} اور ’’لام‘‘ کے ساتھ وہ رسول اللہ صلی اللہ علیہ وسلم کا قیامت کے عقیدے کو نہایت تاکید سے بیان کرنے کا ذکر کرتے ہوئے ہمزہ استفہام کے ساتھ اس کا شدت سے انکار کر رہے ہیں کہ بھلا ایسا بھی کبھی ہو سکتا ہے؟"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82،81) ➊ { بَلْ قَالُوْا مِثْلَ مَا قَالَ الْاَوَّلُوْنَ:} یہاں پھر اللہ تعالیٰ نے اپنی ناراضی کے اظہار کے لیے انھیں مخاطب کرنا چھوڑ کر ان کا ذکر غائب کے صیغے کے ساتھ کرنا شروع کر دیا، گویا اتنی واضح دلیلوں کے بعد بھی انکار پر اڑے رہنے کی وجہ سے وہ اس قابل نہیں کہ انھیں مخاطب کیا جائے۔ ¤ ➋ مرنے کے بعد زندگی کا انکار صرف قیامت کا انکار نہیں، بلکہ اللہ تعالیٰ کی قدرت اور حکمت کا بھی انکار ہے اور شرک ہی کا شاخسانہ ہے۔ جو شخص رب تعالیٰ کو ایک مانتا ہو اور اس کی قدرت و حکمت پر ایمان رکھتا ہو وہ کبھی قیامت کا انکار نہیں کر سکتا۔ ¤ ➌ یعنی ان لوگوں کے پاس اپنے آباء کی تقلید کے سوا قیامت کے انکار اور دوسرے غلط عقائد و اعمال کے لیے کوئی عقلی یا نقلی دلیل نہیں ہے۔ ¤ ➍ {قَالُوْۤا ءَاِذَا مِتْنَا وَ كُنَّا تُرَابًا …:} ’’جب ہم مر جائیں گے‘‘ ہی کافی تھا، مگر اس کے بعد ’’اور ہم مٹی اور ہڈیاں ہو جائیں گے ‘‘ کے الفاظ کے ساتھ وہ اپنے خیال میں مرنے کے بعد زندگی کے عقل سے بعید ہونے کی بات بہت مدلل کر رہے ہیں اور {’’ ءَاِنَّا لَمَبْعُوْثُوْنَ‘‘} میں {’’إِنَّ‘‘} اور ’’لام‘‘ کے ساتھ وہ رسول اللہ صلی اللہ علیہ وسلم کا قیامت کے عقیدے کو نہایت تاکید سے بیان کرنے کا ذکر کرتے ہوئے ہمزہ استفہام کے ساتھ اس کا شدت سے انکار کر رہے ہیں کہ بھلا ایسا بھی کبھی ہو سکتا ہے؟"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) ➊ { لَقَدْ وُعِدْنَا نَحْنُ وَ اٰبَآؤُنَا هٰذَا …:’’ اَسَاطِيْرُ ‘‘ ’’أُسْطُوْرَةٌ‘‘} کی جمع ہے، دل لگی کے لیے لکھے جانے والے قصے کہانیاں اور افسانے۔ {’’ أُفْعُوْلَةٌ ‘‘} کا وزن عموماً دل لگی کا مفہوم ادا کرنے والے الفاظ کے لیے آتا ہے، جیسے : {’’أُضْحُوْكَةٌ، أُرْجُوْحَةٌ، أُعْجُوْبَةٌ، أُحْدُوْثَةٌ، أُغْلُوْطَةٌ‘‘} وغیرہ۔ ¤ ➋ پچھلی آیت میں ان کے قیامت کے انکار کی ایک وجہ بیان ہوئی ہے، یہ دوسری وجہ ہے کہ دوبارہ زندہ ہو کر پیش ہونے کا دعویٰ اس پیغمبر کی طرح پہلے انبیاء کی طرف سے بھی ہوتا چلا آ رہا ہے، مگر سیکڑوں ہزاروں برس گزرنے کے باوجود پورا نہیں ہوا، کوئی مرنے کے بعد واپس نہیں آیا، معلوم ہوا یہ سب قصے کہانیاں ہیں۔ گویا ان کے خیال میں دوبارہ زندہ ہونے کا وعدہ اسی دنیا کے اندر پورا ہونا ہے۔ انتہائی ذہانت اور عقل کے دعوے داروں کی سمجھ دیکھیے کہ رسول کیا فرما رہے ہیں اور وہ اس کا مطلب کیا سمجھ رہے ہیں؟"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 85،84) ➊ { قُلْ لِّمَنِ الْاَرْضُ وَ مَنْ فِيْهَاۤ …:} جب کفار نے اتنی شدت کے ساتھ قیامت کا انکار کیا تو اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم کو حکم دیا کہ ان سے ان باتوں کا اقرار کروائیں اور ان کی زبان سے کہلوائییں جنھیں وہ جانتے پہچانتے اور مانتے ہیں، جنھیں تسلیم کرنے کی صورت میں انھیں لازماً قیامت کے دن زندہ ہونے کا اقرار کرنا پڑے گا۔ چنانچہ فرمایا، ان سے کہہ اگر واقعی تم کچھ جانتے ہو تو بتاؤ یہ زمین اوراس میں جو کچھ ہے، اس کا مالک کون ہے؟ ¤ ➋ { قُلْ اَفَلَا تَذَكَّرُوْنَ : ’’تَذَكُّرٌ‘‘} (تفعّل) کا اصل معنی یاد کرنا ہے۔{’’ تَذَكَّرُوْنَ ‘‘} اصل میں {’’ تَتَذَكَّرُوْنَ ‘‘} ہے، یعنی تو پھر تم اپنی فطرت میں رکھی ہوئی اس بات کو یاد کیوں نہیں کرتے جو غفلت میں پڑ کر بھلا چکے ہو اور اس سے نصیحت حاصل کیوں نہیں کرتے کہ جب زمین کا اور اس میں موجود ہر چیز کا مالک صرف اللہ تعالیٰ ہے تو پھر مالک کو چھوڑ کر مملوک کی پوجا کیوں؟ اور جب تم میں سے معمولی شخص بھی اس بات پر تیار نہیں کہ وہ اپنے غلاموں سے پوچھ گچھ نہ کرے، یا انھیں ان کی کارکردگی کا صلہ نہ دے، یا ان کے درمیان عدل نہ کرے، تو تم نے اس قادرِ مطلق اور حکیمِ کامل کے متعلق کیسے سوچ لیا کہ وہ تمھیں دوبارہ زندہ نہیں کر سکتا، یا نہیں کرے گا اور اس کے بندے جو بھی کرتے رہیں نہ ان سے باز پرس کرے گا، نہ انھیں ان کے کیے کی جزا سزا دے گا اور نہ ان کے درمیان عدل فرمائے گا۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 85،84) ➊ { قُلْ لِّمَنِ الْاَرْضُ وَ مَنْ فِيْهَاۤ …:} جب کفار نے اتنی شدت کے ساتھ قیامت کا انکار کیا تو اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم کو حکم دیا کہ ان سے ان باتوں کا اقرار کروائیں اور ان کی زبان سے کہلوائییں جنھیں وہ جانتے پہچانتے اور مانتے ہیں، جنھیں تسلیم کرنے کی صورت میں انھیں لازماً قیامت کے دن زندہ ہونے کا اقرار کرنا پڑے گا۔ چنانچہ فرمایا، ان سے کہہ اگر واقعی تم کچھ جانتے ہو تو بتاؤ یہ زمین اوراس میں جو کچھ ہے، اس کا مالک کون ہے؟ ¤ ➋ { قُلْ اَفَلَا تَذَكَّرُوْنَ : ’’تَذَكُّرٌ‘‘} (تفعّل) کا اصل معنی یاد کرنا ہے۔{’’ تَذَكَّرُوْنَ ‘‘} اصل میں {’’ تَتَذَكَّرُوْنَ ‘‘} ہے، یعنی تو پھر تم اپنی فطرت میں رکھی ہوئی اس بات کو یاد کیوں نہیں کرتے جو غفلت میں پڑ کر بھلا چکے ہو اور اس سے نصیحت حاصل کیوں نہیں کرتے کہ جب زمین کا اور اس میں موجود ہر چیز کا مالک صرف اللہ تعالیٰ ہے تو پھر مالک کو چھوڑ کر مملوک کی پوجا کیوں؟ اور جب تم میں سے معمولی شخص بھی اس بات پر تیار نہیں کہ وہ اپنے غلاموں سے پوچھ گچھ نہ کرے، یا انھیں ان کی کارکردگی کا صلہ نہ دے، یا ان کے درمیان عدل نہ کرے، تو تم نے اس قادرِ مطلق اور حکیمِ کامل کے متعلق کیسے سوچ لیا کہ وہ تمھیں دوبارہ زندہ نہیں کر سکتا، یا نہیں کرے گا اور اس کے بندے جو بھی کرتے رہیں نہ ان سے باز پرس کرے گا، نہ انھیں ان کے کیے کی جزا سزا دے گا اور نہ ان کے درمیان عدل فرمائے گا۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 87،86) ➊ { قُلْ مَنْ رَّبُّ السَّمٰوٰتِ السَّبْعِ …:} زمین کے بعد ان سے عالم بالا کے متعلق سوال کرنے کا حکم دیا، کیونکہ آسمان زمین سے کہیں بڑا ہے، پھر ہر آسمان نیچے والے سے بڑا ہے اور ان سے اوپر عرش ان سب کو محیط ہے، جسے رب تعالیٰ نے عظیم (بہت بڑی عظمت والا) فرمایا ہے اور جو زمین و آسمان اور ان میں موجود ہر چیز سے پہلے موجود تھا۔ فرمایا : ’’پوچھو، ان کا رب کون ہے؟‘‘ فرمایا : ’’وہ جواب میں کہیں گے، یہ سب کچھ اللہ کی ملکیت ہے۔‘‘ فرمایا : ’’تو پھر تم ڈرتے نہیں؟‘‘ پہلے فرمایا تھا : « اَفَلَا تَذَكَّرُوْنَ» (پھر کیا تم نصیحت حاصل نہیں کرتے ؟) اب اس سے سخت الفاظ میں فرمایا : « اَفَلَا تَتَّقُوْنَ » (تو پھر کیا تم ڈرتے نہیں؟) کیونکہ کوئی شخص جس قدر اللہ تعالیٰ کی عظمت و قدرت کا علم رکھے گا اتنا ہی زیادہ وہ اس سے ڈرے گا۔ مثلاً ایک بچے کو کچھ علم نہیں کہ بادشاہ کتنی قوت کا مالک ہے، وہ اس سے نہیں ڈرے گا۔ ہاں، جسے جس قدر معلوم ہو گا کہ بادشاہ کتنی قوت رکھتا ہے، وہ اس سے اتنا ہی ڈرے گا۔ اس لیے فرمایا : « اِنَّمَا يَخْشَى اللّٰهَ مِنْ عِبَادِهِ الْعُلَمٰٓؤُا » [ فاطر : ۲۸ ] ’’اللہ سے تو اس کے بندوں میں سے صرف جاننے والے ہی ڈرتے ہیں۔‘‘ یہاں فرمایا کہ یہ جان کر بھی کہ ساتوں آسمانوں اور عرش عظیم کا رب اللہ ہے، تم اس کے ساتھ شریک بناتے ہو اور اس کی دوبارہ زندہ کرنے کی قدرت کا انکار کرتے ہو، تو کیا تم ڈرتے نہیں؟ ¤ ➋ { سَيَقُوْلُوْنَ لِلّٰهِ :} یہاں ایک سوال ہے کہ یہ کہنے کے بعد کہ ساتوں آسمانوں کا رب اور عرش عظیم کا رب کون ہے؟ جو اب بظاہر یہ ہے : {’’اَللّٰهُ‘‘} کہ وہ اللہ ہے، اس کے بجائے فرمایا : {’’ لِلّٰهِ ‘‘} کہ یہ سب کچھ اللہ کے لیے ہے۔ اس میں کیا حکمت ہے؟ اس کا جواب طبری اور دوسرے مفسرین نے یہ دیا ہے کہ {’’ مَنْ رَّبُّ السَّمٰوٰتِ السَّبْعِ ‘‘} (ساتوں آسمانوں کا رب کون ہے؟) کا معنی یہی ہے کہ {’’لِمَنِ السَّمٰوَاتُ السَّبْعُ‘‘} یعنی ساتوں آسمان اور عرش عظیم کس کی ملکیت ہیں؟ اس لیے جواب آیا : {’’ لِلّٰهِ ‘‘} کہ یہ سب اللہ کی ملکیت ہیں۔ ¤ ➌ حجاز، عراق اور شام کے تمام قراء اس لفظ کو {’’ لِلّٰهِ ‘‘} پڑھنے پر متفق ہیں، کیونکہ ان کی طرف امیر المومنین عثمان رضی اللہ عنہ کی طرف سے جو مصحف بھیجے گئے، ان میں یہ لفظ اسی طرح ہے۔ البتہ بصرہ کے قاری ابو عمرو رحمہ اللہ اسے {’’اَللّٰهُ‘‘} پڑھتے ہیں، کیونکہ ان کے مصحف میں اسی طرح لکھا ہے۔ اس صورت میں معنی واضح ہے کہ ’’وہ اللہ ہے۔‘‘ طبری نے {’’ لِلّٰهِ ‘‘} کی قراء ت کو راجح قرار دیا ہے، کیونکہ بصرہ کے سوا تمام بلادِ اسلام کے مصاحف میں یہ لفظ اسی طرح لکھا ہے۔ ¤ ➍ ابن عاشور رحمہ اللہ نے {’’ لِلّٰهِ ‘‘} میں ایک نکتہ بیان فرمایا ہے کہ سوال تو یہ تھا کہ ساتوں آسمانوں اور عرش عظیم کا رب کون ہے؟ ان کی طرف سے اس کا جواب یہ ذکر فرمایا کہ وہ (یہ کہنے کے بجائے کہ ان کا رب اللہ ہے) یہ کہیں گے کہ یہ سب کچھ اللہ کی ملکیت ہے، کیونکہ وہ زمین و آسمان اور عرش عظیم غرض ہر چیز کا مالک اللہ تعالیٰ ہی کو سمجھتے تھے، مگر انھوں نے شریک اور رب کئی بنا رکھے تھے۔ چنانچہ وہ حج و عمرہ کے لیے لبیک کہتے ہوئے کہتے تھے : [ لَبَّيْكَ لَا شَرِيْكَ لَكَ … إِلَّا شَرِيْكًا هُوَ لَكَ تَمْلِكُهُ وَمَا مَلَكَ ] [ مسمسلم، الحج، باب التلبیۃ وصفتھا و وقتھا : ۱۱۸۵ ] ’’(اے اللہ!) میں حاضر ہوں، تیرا کوئی شریک نہیں …مگر تیرا ایک شریک ہے، اس کا مالک بھی تو ہے، وہ کسی شے کا مالک نہیں۔‘‘ مشرکین عرب فرشتوں کو اور مشرکین یہود و نصاریٰ عزیر اور عیسیٰ علیھما السلام کو رب سمجھتے تھے۔ یوسف علیہ السلام نے قید خانے کے ساتھیوں کو فرمایا : « ءَاَرْبَابٌ مُّتَفَرِّقُوْنَ خَيْرٌ اَمِ اللّٰهُ الْوَاحِدُ الْقَهَّارُ » [ یوسف : ۳۹ ] ’’کیا الگ الگ رب بہتر ہیں یا اللہ، جو اکیلا ہے، نہایت زبردست ہے۔‘‘ غرض مشرکین مالک صرف اللہ کو سمجھتے، مگر رب دوسروں کو بھی مانتے تھے، اس لیے فرمایا : «اَفَلَا تَتَّقُوْنَ » کہ پھر کہہ دے کہ ہر چیز کا مالک اللہ کو مان کر پھر دوسرے ارباب کی پرستش کرتے ہو، تو تم اس کے غصے سے ڈرتے نہیں کہ وہ ساری کائنات کا مالک تمھارے ساتھ کیا سلوک کرے گا؟"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87،86) ➊ { قُلْ مَنْ رَّبُّ السَّمٰوٰتِ السَّبْعِ …:} زمین کے بعد ان سے عالم بالا کے متعلق سوال کرنے کا حکم دیا، کیونکہ آسمان زمین سے کہیں بڑا ہے، پھر ہر آسمان نیچے والے سے بڑا ہے اور ان سے اوپر عرش ان سب کو محیط ہے، جسے رب تعالیٰ نے عظیم (بہت بڑی عظمت والا) فرمایا ہے اور جو زمین و آسمان اور ان میں موجود ہر چیز سے پہلے موجود تھا۔ فرمایا : ’’پوچھو، ان کا رب کون ہے؟‘‘ فرمایا : ’’وہ جواب میں کہیں گے، یہ سب کچھ اللہ کی ملکیت ہے۔‘‘ فرمایا : ’’تو پھر تم ڈرتے نہیں؟‘‘ پہلے فرمایا تھا : « اَفَلَا تَذَكَّرُوْنَ» (پھر کیا تم نصیحت حاصل نہیں کرتے ؟) اب اس سے سخت الفاظ میں فرمایا : « اَفَلَا تَتَّقُوْنَ » (تو پھر کیا تم ڈرتے نہیں؟) کیونکہ کوئی شخص جس قدر اللہ تعالیٰ کی عظمت و قدرت کا علم رکھے گا اتنا ہی زیادہ وہ اس سے ڈرے گا۔ مثلاً ایک بچے کو کچھ علم نہیں کہ بادشاہ کتنی قوت کا مالک ہے، وہ اس سے نہیں ڈرے گا۔ ہاں، جسے جس قدر معلوم ہو گا کہ بادشاہ کتنی قوت رکھتا ہے، وہ اس سے اتنا ہی ڈرے گا۔ اس لیے فرمایا : « اِنَّمَا يَخْشَى اللّٰهَ مِنْ عِبَادِهِ الْعُلَمٰٓؤُا » [ فاطر : ۲۸ ] ’’اللہ سے تو اس کے بندوں میں سے صرف جاننے والے ہی ڈرتے ہیں۔‘‘ یہاں فرمایا کہ یہ جان کر بھی کہ ساتوں آسمانوں اور عرش عظیم کا رب اللہ ہے، تم اس کے ساتھ شریک بناتے ہو اور اس کی دوبارہ زندہ کرنے کی قدرت کا انکار کرتے ہو، تو کیا تم ڈرتے نہیں؟ ¤ ➋ { سَيَقُوْلُوْنَ لِلّٰهِ :} یہاں ایک سوال ہے کہ یہ کہنے کے بعد کہ ساتوں آسمانوں کا رب اور عرش عظیم کا رب کون ہے؟ جو اب بظاہر یہ ہے : {’’اَللّٰهُ‘‘} کہ وہ اللہ ہے، اس کے بجائے فرمایا : {’’ لِلّٰهِ ‘‘} کہ یہ سب کچھ اللہ کے لیے ہے۔ اس میں کیا حکمت ہے؟ اس کا جواب طبری اور دوسرے مفسرین نے یہ دیا ہے کہ {’’ مَنْ رَّبُّ السَّمٰوٰتِ السَّبْعِ ‘‘} (ساتوں آسمانوں کا رب کون ہے؟) کا معنی یہی ہے کہ {’’لِمَنِ السَّمٰوَاتُ السَّبْعُ‘‘} یعنی ساتوں آسمان اور عرش عظیم کس کی ملکیت ہیں؟ اس لیے جواب آیا : {’’ لِلّٰهِ ‘‘} کہ یہ سب اللہ کی ملکیت ہیں۔ ¤ ➌ حجاز، عراق اور شام کے تمام قراء اس لفظ کو {’’ لِلّٰهِ ‘‘} پڑھنے پر متفق ہیں، کیونکہ ان کی طرف امیر المومنین عثمان رضی اللہ عنہ کی طرف سے جو مصحف بھیجے گئے، ان میں یہ لفظ اسی طرح ہے۔ البتہ بصرہ کے قاری ابو عمرو رحمہ اللہ اسے {’’اَللّٰهُ‘‘} پڑھتے ہیں، کیونکہ ان کے مصحف میں اسی طرح لکھا ہے۔ اس صورت میں معنی واضح ہے کہ ’’وہ اللہ ہے۔‘‘ طبری نے {’’ لِلّٰهِ ‘‘} کی قراء ت کو راجح قرار دیا ہے، کیونکہ بصرہ کے سوا تمام بلادِ اسلام کے مصاحف میں یہ لفظ اسی طرح لکھا ہے۔ ¤ ➍ ابن عاشور رحمہ اللہ نے {’’ لِلّٰهِ ‘‘} میں ایک نکتہ بیان فرمایا ہے کہ سوال تو یہ تھا کہ ساتوں آسمانوں اور عرش عظیم کا رب کون ہے؟ ان کی طرف سے اس کا جواب یہ ذکر فرمایا کہ وہ (یہ کہنے کے بجائے کہ ان کا رب اللہ ہے) یہ کہیں گے کہ یہ سب کچھ اللہ کی ملکیت ہے، کیونکہ وہ زمین و آسمان اور عرش عظیم غرض ہر چیز کا مالک اللہ تعالیٰ ہی کو سمجھتے تھے، مگر انھوں نے شریک اور رب کئی بنا رکھے تھے۔ چنانچہ وہ حج و عمرہ کے لیے لبیک کہتے ہوئے کہتے تھے : [ لَبَّيْكَ لَا شَرِيْكَ لَكَ … إِلَّا شَرِيْكًا هُوَ لَكَ تَمْلِكُهُ وَمَا مَلَكَ ] [ مسمسلم، الحج، باب التلبیۃ وصفتھا و وقتھا : ۱۱۸۵ ] ’’(اے اللہ!) میں حاضر ہوں، تیرا کوئی شریک نہیں …مگر تیرا ایک شریک ہے، اس کا مالک بھی تو ہے، وہ کسی شے کا مالک نہیں۔‘‘ مشرکین عرب فرشتوں کو اور مشرکین یہود و نصاریٰ عزیر اور عیسیٰ علیھما السلام کو رب سمجھتے تھے۔ یوسف علیہ السلام نے قید خانے کے ساتھیوں کو فرمایا : « ءَاَرْبَابٌ مُّتَفَرِّقُوْنَ خَيْرٌ اَمِ اللّٰهُ الْوَاحِدُ الْقَهَّارُ » [ یوسف : ۳۹ ] ’’کیا الگ الگ رب بہتر ہیں یا اللہ، جو اکیلا ہے، نہایت زبردست ہے۔‘‘ غرض مشرکین مالک صرف اللہ کو سمجھتے، مگر رب دوسروں کو بھی مانتے تھے، اس لیے فرمایا : «اَفَلَا تَتَّقُوْنَ » کہ پھر کہہ دے کہ ہر چیز کا مالک اللہ کو مان کر پھر دوسرے ارباب کی پرستش کرتے ہو، تو تم اس کے غصے سے ڈرتے نہیں کہ وہ ساری کائنات کا مالک تمھارے ساتھ کیا سلوک کرے گا؟"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) ➊ {قُلْ مَنْۢ بِيَدِهٖ مَلَكُوْتُ كُلِّ شَيْءٍ : ’’مُلْكٌ‘‘} اور {’’مِلْكٌ‘‘} دونوں کے مفہوم میں مبالغہ پیدا کرنے کے لیے لفظ {’’ مَلَكُوْتُ ‘‘} استعمال کیا گیا ہے، یعنی ایسی کامل ملکیت اور کامل بادشاہی جس میں کوئی نقص نہ ہو۔ {’’ بِيَدِهٖ ‘‘} کو پہلے لانے سے کلام میں حصر پیدا ہو گیا، اس لیے ترجمہ کیا گیا ہے ’’کہہ کون ہے وہ کہ صرف اس کے ہاتھ میں ہر چیز کی مکمل بادشاہی ہے۔‘‘ ¤ ➋ { وَ هُوَ يُجِيْرُ وَ لَا يُجَارُ عَلَيْهِ: ’’ أَجَارَ يُجِيْرُ ‘‘} (افعال) پناہ دینا، کسی کو ہر ایک سے بچا کر اپنی حفاظت میں لے لینا۔ ابن کثیر فرماتے ہیں : ’’عرب کا دستور تھا کہ ان کا سردار کسی کو پناہ دے دیتا تو اس کی پناہ کی خلاف ورزی نہیں کی جاتی تھی اور کسی کو اس کے مقابلے میں پناہ دینے کا اختیار نہیں ہوتا تھا۔‘‘ ¤ ➌ جب ان سے نیچے اور اوپر کے دونوں جہانوں کے مالک ہونے کا اقرار کروا لیا تو حکم دیا گیا کہ ان سے اللہ تعالیٰ کے ہر چیز کے رب ہونے کا اعتراف کر واؤ، تاکہ اس میں وہ چیزیں آ جائیں جن کا ذکر ہوا ہے اور وہ بھی جن کا ذکر نہیں ہوا۔ چنانچہ فرمایا، کہہ دے وہ کون ہے کہ صرف اس کے ہاتھ میں ہر چیز کی مکمل ملکیت اور کامل بادشاہی ہے اور وہ پناہ دیتا ہے (یعنی جسے وہ پناہ دے دے اسے کوئی نقصان نہیں پہنچا سکتا) اور اس کے مقابلے میں پناہ نہیں دی جاتی (یعنی جسے وہ پکڑ لے اسے کوئی اپنی پناہ میں نہیں لے سکتا، نہ اس سے چھڑا سکتا ہے)۔"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 89) ➊ {سَيَقُوْلُوْنَ لِلّٰهِ :} یعنی وہ کہیں گے اس کا مالک بھی اللہ ہی ہے ۔ ¤ ➋ { قُلْ فَاَنّٰى تُسْحَرُوْنَ : ’’ تُسْحَرُوْنَ ‘‘} کا لفظی معنی ہے ’’جادو کیے جاتے ہو۔‘‘ جادو کا اثر دماغ پر ہوتا ہے، آدمی دھوکا کھا جاتا ہے۔ مراد یہ ہے کہ پھر تمھاری مت کہاں سے ماری جا رہی ہے اور تمھارے ہوش و حواس کیسے گم ہو گئے کہ ایسی موٹی بات نہیں سمجھ سکتے۔ جب زمین و آسمان اور عرش عظیم کا مالک وہی ہوا اور ہر چیز اسی کے قبضہ و اختیار میں ہوئی تو عبادت میں اس کا شریک کہاں سے نکل آیا اور تمھارے بدن کی ہڈیاں اور ریزے اس کی قدرت و اختیار سے نکل کر کہاں چلے جائیں گے کہ وہ انھیں زندہ نہیں کر سکے گا۔ ¤ ➌ اس آیت سے معلوم ہوا کہ مشرکین عرب کا عقیدہ یہی تھا کہ اللہ تعالیٰ جسے پکڑ لے اسے کوئی پناہ دے کر چھڑا نہیں سکتا اور جسے اپنی پناہ میں لے لے اسے کوئی نقصان نہیں پہنچا سکتا۔ مگر افسوس کہ بعض مسلمان کہلانے والے شرک میں اس حد تک بڑھ گئے کہ مخلوق کو خالق سے بھی زیادہ اختیار رکھنے والا بنا دیا، چنانچہ ایسے ہی ایک تُک باندھنے والے نے کہا ہے: ¤ خدا جس کو پکڑے چھڑا لے محمد ¤ محمد کا پکڑا چھڑا کوئی نہیں سکتا ¤ عجیب بات یہ ہے کہ اس صریح شرک اور اللہ تعالیٰ کی شدید گستاخی کے باوجود انھیں اصرار ہے کہ وہ اعلیٰ درجے کے مسلمان ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا تُطْرُوْنِيْ كَمَا أَطْرَتِ النَّصَارَی ابْنَ مَرْيَمَ فَإِنَّمَا أَنَا عَبْدُهُ فَقُوْلُوْا عَبْدُ اللّٰهِ وَ رَسُوْلُهُ ] [بخاري، أحادیث الأنبیاء، باب قول اللہ تعالٰی : « واذکر في الکتاب مریم…» : ۳۴۴۵ ] ’’مجھے حد سے مت بڑھاؤ، جیسے نصاریٰ نے مسیح ابن مریم کو حد سے بڑھا دیا، میں تو صرف اس کا بندہ ہوں، چنانچہ یہی کہو کہ میں اللہ کا بندہ اور اس کا رسول ہوں۔‘‘"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت 90) ➊ { بَلْ اَتَيْنٰهُمْ بِالْحَقِّ : ’’اَلْحَقُّ‘‘} سے مراد یہاں ’’سچ‘‘ ہے، کیونکہ مقابلے میں {’’ لَكٰذِبُوْنَ ‘‘} آ رہا ہے۔ ’’کامل‘‘ کا مفہوم الف لام سے حاصل ہو رہا ہے، یعنی ہم ان کے پاس جھوٹے قصے کہانیاں ({اَسَاطِيْرُ الْاَوَّلِيْنَ})نہیں لائے، بلکہ ایسا سچ لائے ہیں جس میں کوئی نقص نہیں۔ ¤ ➋ { وَ اِنَّهُمْ لَكٰذِبُوْنَ :} یعنی یہ لوگ یقیینا جھوٹے ہیں، اس بات میں کہ اللہ تعالیٰ کا کوئی شریک ہے، یا کوئی اس کا بیٹا ہے جسے خدائی اختیارات حاصل ہیں، یا وہ جو چاہے اللہ تعالیٰ سے منوا سکتا ہے اور اس بات میں جھوٹے ہیں کہ موت کے بعد زندگی ممکن نہیں ہے اور ان کا جھوٹ ان کے اعترافات سے ثابت ہے جو اوپر گزرے۔"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت 92،91) ➊ { مَا اتَّخَذَ اللّٰهُ مِنْ وَّلَدٍ …: ’’ وَلَدٍ ‘‘} نکرہ پر{ ’’ مَا ‘‘ } کے ساتھ نفی آئی تو عموم پیدا ہو گیا کہ ’’اللہ نے کوئی اولاد نہیں بنائی۔‘‘ {’’ مِنْ ‘‘} کے ساتھ اس عموم کی تاکید ہو گئی، اس لیے ترجمہ کیا گیا ہے : ’’اللہ تعالیٰ نے کوئی بھی اولاد نہیں بنائی۔‘‘ یعنی نہ کوئی فرشتہ، نہ نبی، نہ ولی، نہ کوئی اور۔ ¤ ➋ تفسیر ابن کثیر میں ہے : ’’اللہ تعالیٰ اس سے اپنی برتری بیان فرما رہا ہے کہ اس کی اولاد ہو یا اس کا کوئی شریک ہو، ملک میں، تصرف میں، عبادت کا مستحق ہونے میں۔ وہ یکتا ہے، نہ اس کی اولاد ہے، نہ اس کا کوئی شریک ہے۔ اگر مان لیا جائے کہ کئی ایک الٰہ (معبود) ہیں تو ہر ایک اپنی مخلوق کا مستقل مالک ہونا چاہیے۔ ایسی صورت میں موجودات میں نظام قائم نہیں رہ سکتا، حالانکہ کائنات کا انتظام مکمل ہے۔ عالم علوی، عالم سفلی اور آسمان و زمین وغیرہ کمال ربط کے ساتھ اپنے اپنے کام میں مشغول ہیں۔ دستور سے ایک انچ اِدھر اُدھر نہیں ہوتے۔ پس معلوم ہوا کہ ان سب کا خالق و مالک ایک ہی ہے، نہ کہ متفرق کئی ایک۔ پھر بہت سے الٰہ (معبود) مان لینے کی صورت میں یہ بھی ظاہر ہے کہ ہر ایک دوسرے کو پست و مغلوب کرنا اور خود غالب اور طاقت ور ہونا چاہے گا، اگر غالب آ گیا تو مغلوب الٰہ (معبود) نہ رہا، اگر غالب نہ آیا تو وہ خود الٰہ (معبود) نہیں۔‘‘ (ابن کثیر) ¤ پس ثابت ہوا کہ معبود ایک اللہ ہے۔ وہ ظالم، سرکش، حد سے گزر جانے والے مشرک جو اللہ کی اولاد ٹھہراتے ہیں اور اس کے شریک بتاتے ہیں، ان کے بیان کردہ اوصاف سے ذات الٰہی بہت  بلند و بالا اور برتر و منزہ ہے، وہ ہر چیز کو جانتا ہے جو مخلوق سے پوشیدہ ہے اور اسے بھی جو مخلوق پر عیاں ہے، پس وہ ان تمام شرکاء سے پاک ہے جو مشرک اور منکر اللہ کا شریک بتاتے ہیں۔ اللہ تعالیٰ کی اولاد یا شریک کے رد کے لیے دیکھیے سورۂ انبیاء (۲۲)، بنی اسرائیل (۴۲، ۱۱۱)، نحل (۵۷، ۵۸)، اور کہف (۴) کی تفسیر۔"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت 92،91) ➊ { مَا اتَّخَذَ اللّٰهُ مِنْ وَّلَدٍ …: ’’ وَلَدٍ ‘‘} نکرہ پر{ ’’ مَا ‘‘ } کے ساتھ نفی آئی تو عموم پیدا ہو گیا کہ ’’اللہ نے کوئی اولاد نہیں بنائی۔‘‘ {’’ مِنْ ‘‘} کے ساتھ اس عموم کی تاکید ہو گئی، اس لیے ترجمہ کیا گیا ہے : ’’اللہ تعالیٰ نے کوئی بھی اولاد نہیں بنائی۔‘‘ یعنی نہ کوئی فرشتہ، نہ نبی، نہ ولی، نہ کوئی اور۔ ¤ ➋ تفسیر ابن کثیر میں ہے : ’’اللہ تعالیٰ اس سے اپنی برتری بیان فرما رہا ہے کہ اس کی اولاد ہو یا اس کا کوئی شریک ہو، ملک میں، تصرف میں، عبادت کا مستحق ہونے میں۔ وہ یکتا ہے، نہ اس کی اولاد ہے، نہ اس کا کوئی شریک ہے۔ اگر مان لیا جائے کہ کئی ایک الٰہ (معبود) ہیں تو ہر ایک اپنی مخلوق کا مستقل مالک ہونا چاہیے۔ ایسی صورت میں موجودات میں نظام قائم نہیں رہ سکتا، حالانکہ کائنات کا انتظام مکمل ہے۔ عالم علوی، عالم سفلی اور آسمان و زمین وغیرہ کمال ربط کے ساتھ اپنے اپنے کام میں مشغول ہیں۔ دستور سے ایک انچ اِدھر اُدھر نہیں ہوتے۔ پس معلوم ہوا کہ ان سب کا خالق و مالک ایک ہی ہے، نہ کہ متفرق کئی ایک۔ پھر بہت سے الٰہ (معبود) مان لینے کی صورت میں یہ بھی ظاہر ہے کہ ہر ایک دوسرے کو پست و مغلوب کرنا اور خود غالب اور طاقت ور ہونا چاہے گا، اگر غالب آ گیا تو مغلوب الٰہ (معبود) نہ رہا، اگر غالب نہ آیا تو وہ خود الٰہ (معبود) نہیں۔‘‘ (ابن کثیر) ¤ پس ثابت ہوا کہ معبود ایک اللہ ہے۔ وہ ظالم، سرکش، حد سے گزر جانے والے مشرک جو اللہ کی اولاد ٹھہراتے ہیں اور اس کے شریک بتاتے ہیں، ان کے بیان کردہ اوصاف سے ذات الٰہی بہت  بلند و بالا اور برتر و منزہ ہے، وہ ہر چیز کو جانتا ہے جو مخلوق سے پوشیدہ ہے اور اسے بھی جو مخلوق پر عیاں ہے، پس وہ ان تمام شرکاء سے پاک ہے جو مشرک اور منکر اللہ کا شریک بتاتے ہیں۔ اللہ تعالیٰ کی اولاد یا شریک کے رد کے لیے دیکھیے سورۂ انبیاء (۲۲)، بنی اسرائیل (۴۲، ۱۱۱)، نحل (۵۷، ۵۸)، اور کہف (۴) کی تفسیر۔"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت 94،93) ➊ { قُلْ رَّبِّ اِمَّا تُرِيَنِّيْ مَا يُوْعَدُوْنَ: ’’ اِمَّا ‘‘ ’’إِنْ‘‘} کی تاکید {’’مَا‘‘} کے ساتھ کی گئی ہے، اس لیے ترجمہ ’’اگر کبھی‘‘ کیا گیا ہے اور {’’تُرِيَنَّ‘‘} میں نون ثقیلہ تاکید کے لیے ہے۔ مفسر بقاعی نے لکھا ہے : {’’أَيْ إِنْ كَانَ وَلَا بُدَّ مِنْ أَنْ تُرِيَنِّيْ قَبْلَ مَوْتِيْ ‘‘} اس لیے ترجمہ کیا گیا ہے : ’’اگر تو کبھھی مجھے ضرور ہی وہ (عذاب) دکھائے۔‘‘ ¤ ➋ یعنی جب اللہ تعالیٰ کی جناب میں اولاد یا شریک بنانے کی سخت گستاخی کی جاتی ہے تو یقینا کوئی سخت آفت آ کر رہے گی، اس لیے ہر مومن کو حکم دیا گیا کہ وہ اللہ کے عذاب سے ڈر کر یہ دعا مانگے۔ ¤ ➌ آیت کے اولین مخاطب رسول اللہ صلی اللہ علیہ وسلم ہیں، ان کے ساتھ امت کا ہر فرد بھی مخاطب ہے۔ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں عذاب نہ لانے کا وعدہ فرمایا ہے، فرمایا : «وَ مَا كَانَ اللّٰهُ لِيُعَذِّبَهُمْ وَ اَنْتَ فِيْهِمْ وَ مَا كَانَ اللّٰهُ مُعَذِّبَهُمْ وَ هُمْ يَسْتَغْفِرُوْنَ» [ الأنفال : ۳۳ ] ’’اور اللہ کبھی ایسا نہیں کہ انھیں عذاب دے، جب کہ تو ان میں ہو اور اللہ انھیں کبھی عذاب دینے والا نہیں جب کہ وہ بخشش مانگتے ہوں۔‘‘ اس کے باوجود اس آیت میں آپ صلی اللہ علیہ وسلم کو عذاب سے بچنے کی دعا کا حکم دیا، چنانچہ رسول اللہ صلی اللہ علیہ وسلم اللہ کے عذاب سے سخت خوف زدہ رہتے تھے اور اس سے بچنے کی دعا کرتے رہتے تھے۔ جیسا کہ اللہ تعالیٰ نے آپ کے پہلے اور پچھلے تمام گناہ معاف فرما دیے، اس کے باوجود آپ کو استغفار کا حکم دیا، فرمایا : « فَسَبِّحْ بِحَمْدِ رَبِّكَ وَ اسْتَغْفِرْهُ» [ النصر : ۳ ] ’’تو اپنے رب کی حمد کے ساتھ تسبیح کر اور اس سے بخشش مانگ۔‘‘ اور آپ صلی اللہ علیہ وسلم کثرت سے استغفار کیا کرتے تھے۔ اس سے آپ صلی اللہ علیہ وسلم کی اللہ تعالیٰ سے خشیت کا اندازہ ہوتا ہے اور اس میں امت کے لیے تعلیم بھی ہے۔ عائشہ رضی اللہ عنھما فرماتی ہیں : ’’رسول اللہ صلی اللہ علیہ وسلم جب بادل یا آندھی دیکھتے تو آپ کے چہرے پر اس کے اثرات پہچانے جاتے۔‘‘ عائشہ رضی اللہ عنھا نے کہا : ’’یا رسول اللہ! لوگ جب بادل دیکھتے ہیں تو خوش ہوتے ہیں، اس امید پر کہ اس میں بارش ہو گی اور میں آپ کو دیکھتی ہوں کہ جب آپ اسے دیکھتے ہیں تو آپ کے چہرے پر ناپسندیدگی کے آثار نظر آتے ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ يَا عَائِشَةُ! مَا يُؤْمِنِّيْ أَنْ يَّكُوْنَ فِيْهِ عَذَابٌ؟ عُذِّبَ قَوْمٌ بِالرِّيْحِ وَقَدْ رَأَی قَوْمٌ الْعَذَابَ فَقَالُوْا هٰذَا عَارِضٌ مُّمْطِرُنَا ] [ بخاري، التفسیر، باب قولہ : « فلما رأوہ عارضا…» : ۴۸۲۹ ] ’’اے عائشہ! کیا ضمانت ہے کہ اس میں کوئی عذاب نہ ہو؟ ایک قوم (عاد) پر آندھی کا عذاب آیا اور ایک قوم نے عذاب دیکھا تو کہنے لگے، یہ بادل ہم پر بارش برسانے والا ہے۔‘‘ ¤ ➍ اس آیت سے معلوم ہوا کہ آدمی کو ہمیشہ دعا کرتے رہنا چاہیے کہ پروردگارا! تو مجھے عفو اور عافیت عطا فرما اور اگر تو نے کچھ لوگوں کو عذاب دینے کا ارادہ کر ہی لیا ہو تو مجھے ان ظالموں میں شامل نہ کرنا۔ معاذ بن جبل رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے یہ دعا نقل فرمائی ہے : [ اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ وَ تَرْكَ الْمُنْكَرَاتِ وَ حُبَّ الْمَسَاكِيْنِ وَ أَنْ تَغْفِرَ لِيْ وَ تَرْحَمَنِيْ وَ إِذَا أَرَدْتَ فِتْنَةً فِيْ قَوْمٍ فَتَوَفَّنِيْ غَيْرَ مَفْتُوْنٍ، وَ أَسْأَلُكَ حُبَّكَ وَ حُبَّ مَنْ يُّحِبُّكَ وَ حُبَّ عَمَلٍ يُقَرِّبُ إِلٰی حُبِّكَ ] ’’اے اللہ! میں تجھ سے نیکیاں کرنے، برائیاں چھوڑنے اور مساکین کی محبت کا سوال کرتا ہوں اور اس بات کا بھی کہ تو مجھے بخش دے اور مجھ پر رحم کرے اور جب تو کسی قوم کے فتنے کا ارادہ کرے تو مجھے فتنے میں ڈالے بغیر قبض کر لے۔ میں تجھ سے تیری محبت کا سوال کرتا ہوں اور ان لوگوں کی محبت کا جو تجھ سے محبت رکھتے ہیں اور ایسے عمل کی محبت کا جو تیری محبت کے قریب کر دے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّهَا حَقٌّ فَادْرُسُوْهَا ثُمَّ تَعَلَّمُوْهَا ] [ ترمذي، تفسیر القرآن، باب و من سورۃ صٓ : ۳۲۳۵، قال الترمذي حسن صحیح و قال الألباني صحیح ] ’’یہ کلمات حق ہیں انھیں پڑھو، پھر انھیں اچھی طرح سیکھ لو۔‘‘ ¤ ➎ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو یہ دعا سکھائی تاکہ مشرکین پر عذاب آئے تو آپ اس وقت ان کے ساتھ نہ ہوں، بلکہ ان سے الگ ہوں، پھر آپ صلی اللہ علیہ وسلم کو ہجرت کی توفیق عطا فرما کر آپ کو کافروں سے الگ کر دیا اور قحط اور جنگوں کی صورت میں ان پر جو عذاب آئے آپ کو ان سے محفوظ رکھا۔"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت 94،93) ➊ { قُلْ رَّبِّ اِمَّا تُرِيَنِّيْ مَا يُوْعَدُوْنَ: ’’ اِمَّا ‘‘ ’’إِنْ‘‘} کی تاکید {’’مَا‘‘} کے ساتھ کی گئی ہے، اس لیے ترجمہ ’’اگر کبھی‘‘ کیا گیا ہے اور {’’تُرِيَنَّ‘‘} میں نون ثقیلہ تاکید کے لیے ہے۔ مفسر بقاعی نے لکھا ہے : {’’أَيْ إِنْ كَانَ وَلَا بُدَّ مِنْ أَنْ تُرِيَنِّيْ قَبْلَ مَوْتِيْ ‘‘} اس لیے ترجمہ کیا گیا ہے : ’’اگر تو کبھھی مجھے ضرور ہی وہ (عذاب) دکھائے۔‘‘ ¤ ➋ یعنی جب اللہ تعالیٰ کی جناب میں اولاد یا شریک بنانے کی سخت گستاخی کی جاتی ہے تو یقینا کوئی سخت آفت آ کر رہے گی، اس لیے ہر مومن کو حکم دیا گیا کہ وہ اللہ کے عذاب سے ڈر کر یہ دعا مانگے۔ ¤ ➌ آیت کے اولین مخاطب رسول اللہ صلی اللہ علیہ وسلم ہیں، ان کے ساتھ امت کا ہر فرد بھی مخاطب ہے۔ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں عذاب نہ لانے کا وعدہ فرمایا ہے، فرمایا : «وَ مَا كَانَ اللّٰهُ لِيُعَذِّبَهُمْ وَ اَنْتَ فِيْهِمْ وَ مَا كَانَ اللّٰهُ مُعَذِّبَهُمْ وَ هُمْ يَسْتَغْفِرُوْنَ» [ الأنفال : ۳۳ ] ’’اور اللہ کبھی ایسا نہیں کہ انھیں عذاب دے، جب کہ تو ان میں ہو اور اللہ انھیں کبھی عذاب دینے والا نہیں جب کہ وہ بخشش مانگتے ہوں۔‘‘ اس کے باوجود اس آیت میں آپ صلی اللہ علیہ وسلم کو عذاب سے بچنے کی دعا کا حکم دیا، چنانچہ رسول اللہ صلی اللہ علیہ وسلم اللہ کے عذاب سے سخت خوف زدہ رہتے تھے اور اس سے بچنے کی دعا کرتے رہتے تھے۔ جیسا کہ اللہ تعالیٰ نے آپ کے پہلے اور پچھلے تمام گناہ معاف فرما دیے، اس کے باوجود آپ کو استغفار کا حکم دیا، فرمایا : « فَسَبِّحْ بِحَمْدِ رَبِّكَ وَ اسْتَغْفِرْهُ» [ النصر : ۳ ] ’’تو اپنے رب کی حمد کے ساتھ تسبیح کر اور اس سے بخشش مانگ۔‘‘ اور آپ صلی اللہ علیہ وسلم کثرت سے استغفار کیا کرتے تھے۔ اس سے آپ صلی اللہ علیہ وسلم کی اللہ تعالیٰ سے خشیت کا اندازہ ہوتا ہے اور اس میں امت کے لیے تعلیم بھی ہے۔ عائشہ رضی اللہ عنھما فرماتی ہیں : ’’رسول اللہ صلی اللہ علیہ وسلم جب بادل یا آندھی دیکھتے تو آپ کے چہرے پر اس کے اثرات پہچانے جاتے۔‘‘ عائشہ رضی اللہ عنھا نے کہا : ’’یا رسول اللہ! لوگ جب بادل دیکھتے ہیں تو خوش ہوتے ہیں، اس امید پر کہ اس میں بارش ہو گی اور میں آپ کو دیکھتی ہوں کہ جب آپ اسے دیکھتے ہیں تو آپ کے چہرے پر ناپسندیدگی کے آثار نظر آتے ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ يَا عَائِشَةُ! مَا يُؤْمِنِّيْ أَنْ يَّكُوْنَ فِيْهِ عَذَابٌ؟ عُذِّبَ قَوْمٌ بِالرِّيْحِ وَقَدْ رَأَی قَوْمٌ الْعَذَابَ فَقَالُوْا هٰذَا عَارِضٌ مُّمْطِرُنَا ] [ بخاري، التفسیر، باب قولہ : « فلما رأوہ عارضا…» : ۴۸۲۹ ] ’’اے عائشہ! کیا ضمانت ہے کہ اس میں کوئی عذاب نہ ہو؟ ایک قوم (عاد) پر آندھی کا عذاب آیا اور ایک قوم نے عذاب دیکھا تو کہنے لگے، یہ بادل ہم پر بارش برسانے والا ہے۔‘‘ ¤ ➍ اس آیت سے معلوم ہوا کہ آدمی کو ہمیشہ دعا کرتے رہنا چاہیے کہ پروردگارا! تو مجھے عفو اور عافیت عطا فرما اور اگر تو نے کچھ لوگوں کو عذاب دینے کا ارادہ کر ہی لیا ہو تو مجھے ان ظالموں میں شامل نہ کرنا۔ معاذ بن جبل رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے یہ دعا نقل فرمائی ہے : [ اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ وَ تَرْكَ الْمُنْكَرَاتِ وَ حُبَّ الْمَسَاكِيْنِ وَ أَنْ تَغْفِرَ لِيْ وَ تَرْحَمَنِيْ وَ إِذَا أَرَدْتَ فِتْنَةً فِيْ قَوْمٍ فَتَوَفَّنِيْ غَيْرَ مَفْتُوْنٍ، وَ أَسْأَلُكَ حُبَّكَ وَ حُبَّ مَنْ يُّحِبُّكَ وَ حُبَّ عَمَلٍ يُقَرِّبُ إِلٰی حُبِّكَ ] ’’اے اللہ! میں تجھ سے نیکیاں کرنے، برائیاں چھوڑنے اور مساکین کی محبت کا سوال کرتا ہوں اور اس بات کا بھی کہ تو مجھے بخش دے اور مجھ پر رحم کرے اور جب تو کسی قوم کے فتنے کا ارادہ کرے تو مجھے فتنے میں ڈالے بغیر قبض کر لے۔ میں تجھ سے تیری محبت کا سوال کرتا ہوں اور ان لوگوں کی محبت کا جو تجھ سے محبت رکھتے ہیں اور ایسے عمل کی محبت کا جو تیری محبت کے قریب کر دے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّهَا حَقٌّ فَادْرُسُوْهَا ثُمَّ تَعَلَّمُوْهَا ] [ ترمذي، تفسیر القرآن، باب و من سورۃ صٓ : ۳۲۳۵، قال الترمذي حسن صحیح و قال الألباني صحیح ] ’’یہ کلمات حق ہیں انھیں پڑھو، پھر انھیں اچھی طرح سیکھ لو۔‘‘ ¤ ➎ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو یہ دعا سکھائی تاکہ مشرکین پر عذاب آئے تو آپ اس وقت ان کے ساتھ نہ ہوں، بلکہ ان سے الگ ہوں، پھر آپ صلی اللہ علیہ وسلم کو ہجرت کی توفیق عطا فرما کر آپ کو کافروں سے الگ کر دیا اور قحط اور جنگوں کی صورت میں ان پر جو عذاب آئے آپ کو ان سے محفوظ رکھا۔"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت 95) ➊ {وَ اِنَّا عَلٰۤى اَنْ نُّرِيَكَ مَا نَعِدُهُمْ لَقٰدِرُوْنَ :’’إِنَّ‘‘} اور ’’لام‘‘ کے ساتھ تاکید سے معلوم ہوتا ہے کہ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو مشرکین مکہ پر عذاب کا وہ وعدہ پورا ہوتا ہوا آنکھوں سے دکھا دیا، جب کہ آپ اس وقت ان سے الگ ہو چکے تھے اور مدینہ کی طرف ہجرت کر چکے تھے۔ چنانچہ اس عذاب کی ابتدا بدر سے ہوئی، جب رسول اللہ صلی اللہ علیہ وسلم نے کفار قریش کے سرداروں کی لاشیں کنویں میں پھینکنے کا حکم دیا اور پھر اس کنویں کے کنارے پر کھڑے ہو کر ایک ایک کا نام لے کر فرمایا : [ فَإِنَّا قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا فَهَلْ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا ؟ ] [ بخاري، المغازي، باب قتل أبي جھل : ۳۹۷۶ ] ’’یقینا ہم نے تو وہ وعدہ سچا پا لیا جو ہمارے رب نے ہم سے کیا تھا، تو کیا تم نے بھی وہ وعدہ سچا پایا جو تمھارے رب نے تم سے کیا تھا؟‘‘ پھر ہجرت کے آٹھویں سال مکہ فتح ہو گیا اور دسویں سال حُجۃ الوداع کے موقع پر مشرکین کو چار ماہ کی مہلت دی گئی کہ اسلام قبول کر لیں یا جزیرۃ العرب خالی کر دیں اور یہاں سے نکل جائیں، ورنہ جہاد کے ذریعے سے ان کا کلی خاتمہ کر دیا جائے گا۔ یہ عذاب تو رسول اللہ صلی اللہ علیہ وسلم کی زندگی ہی میں ان پر نازل ہوا، پھر خلفائے راشدین کے زمانے میں آس پاس کے ممالک سے شرک اور مشرکین کا خاتمہ ہوا اور اسلام کا بول بالا ہوا۔ (والحمد للہ) ¤ ➋ اگر عذاب سے مراد آسمان سے نازل ہونے والا عذاب ہو، جیسا کہ عاد و ثمود پر نازل ہوا، تو مطلب یہ ہو گا کہ ہم ان سے عذاب کا جو وعدہ کر رہے ہیں یقینا آپ کو دکھانے پر قادر ہیں، مگر ایک تو موسیٰ علیہ السلام کے بعد ہم نے طے کیا ہے کہ جہاد کے ذریعے سے مسلمانوں کے ہاتھوں کفار کو عذاب ہو، جیسا کہ فرمایا : « قَاتِلُوْهُمْ يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ » [ التوبۃ : ۱۴ ] ’’ان سے لڑو، اللہ انھیں تمھارے ہاتھوں سے عذاب دے گا۔‘‘ اور بے شک ہم آسمان سے ایسا عذاب بھیجنے پر قادر ہیں جو ان کا صفایا کر دے، مگر ہماری حکمت کا تقاضا انھیں مہلت دینے کا ہے، تاکہ ان میں سے جنھوں نے اسلام قبول کرنا ہے کر لیں اور جن کی آئندہ نسل نے اسلام قبول کرنا ہے وہ نسل وجود میں آ جائے۔"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت 96) ➊ { اِدْفَعْ بِالَّتِيْ هِيَ اَحْسَنُ السَّيِّئَةَ …:} یعنی ہم عذاب میں جو تاخیر کر رہے ہیں اس میں ہماری حکمت ہے، آپ اس دوران ان کی ہر برائی اور زیادتی کا جواب ایسے طریقے سے دیں جو اچھا ہی نہیں، سب سے اچھا ہو۔ ہمیں خوب معلوم ہے کہ وہ کیا کچھ کہتے ہیں، کس طرح اللہ کی شان میں گستاخی کرتے ہیں اور کس طرح آپ کو کاہن، شاعر، جادوگر اور دیوانہ وغیرہ کہتے ہیں۔ ¤ ➋ برائی کا جواب بہترین طریقے سے یہ ہے کہ بدی کا جواب نیکی سے، ظلم کا جواب انصاف سے، خیانت کا جواب دیانت داری سے، جھوٹ کا جواب سچ سے، قطع رحمی کا جواب صلہ رحمی سے اور گالی گلوچ کا جواب دعا و سلام سے دیا جائے۔ دوسری جگہ اللہ تعالیٰ نے ایسا کرنے کا نتیجہ بیان کرتے ہوئے فرمایا : «اِدْفَعْ بِالَّتِيْ هِيَ اَحْسَنُ فَاِذَا الَّذِيْ بَيْنَكَ وَ بَيْنَهٗ عَدَاوَةٌ كَاَنَّهٗ وَلِيٌّ حَمِيْمٌ » [ حٰمٓ السجدۃ : ۳۴ ] ’’(برائی کو) اس (طریقے) کے ساتھ ہٹا جو سب سے اچھا ہے، تو اچانک وہ شخص کہ تیرے درمیان اور اس کے درمیان دشمنی ہے، ایسا ہو گا جیسے وہ دلی دوست ہو۔‘‘ اس میں عفو و درگزر کی تعلیم دی گئی ہے، کیونکہ لوگوں کے ساتھ مل جل کر رہنے کے لیے یہ سب سے اچھا طریقہ ہے۔ عائشہ رضی اللہ عنھا بیان کرتی ہیں : [ وَاللّٰهِ! مَا انْتَقَمَ لِنَفْسِهِ فِيْ شَيْءٍ يُؤْتَی إِلَيْهِ قَطُّ حَتّٰیی تُنْتَهَكَ حُرُمَاتُ اللّٰهِ فَيَنْتَقِمُ لِلّٰهِ ] [ بخاري، الحدود، باب إقامۃ الحدود والانتقام لحرمات اللہ : ۶۷۸۶ ] ’’اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم نے اپنے ساتھ کی گئی کسی زیادتی میں اپنی ذات کا انتقام کبھی نہیں لیا، مگر اس صورت میں کہ اللہ تعالیٰ کی حرمتوں کو پامال کیا جائے تو اللہ کی خاطر انتقام لیتے تھے۔‘‘"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت 98،97) ➊ { وَ قُلْ رَّبِّ اَعُوْذُ بِكَ مِنْ هَمَزٰتِ الشَّيٰطِيْنِ … : ’’اَلْهَمْزُ‘‘} کا معنی ہاتھ یا کسی بھی چیز کے ساتھ چونکا مارنا ہے۔ گلا گھونٹنے، طعنہ دینے اور غیبت کے معنی میں بھی آتا ہے۔ مراد شیطان کے چونکے، وسوسے اور اکساہٹیں ہیں، جن کے ساتھ وہ غصے پر ابھارتا ہے، حتیٰ کہ جنون تک پہنچا دیتا ہے۔ شیاطین انس و جن کے وساوس کی تفصیل کے لیے دیکھیے سورۂ ناس کی تفسیر۔ {’’ اَنْ يَّحْضُرُوْنِ ‘‘} اصل میں {’’أَنْ يَّحْضُرُوْنِيْ‘‘} ہے، کیونکہ اگر ایسا نہ ہوتا تو {’’ اَنْ ‘‘} کے ساتھ {’’ يَحْضُرُوْنِ ‘‘} کا نون گر جاتا، یاء کو حذف کرکے نون کا کسرہ باقی رکھا ہے۔ مطلب یہ ہے کہ اے میرے رب! میں صرف شیاطین کے چونکوں ہی سے تیری پناہ نہیں مانگتا، اس بات سے بھی تیری پناہ مانگتا ہوں کہ وہ میرے پاس آئیں، کیونکہ انھوں نے خیر کے ساتھ تو آنا ہی نہیں۔ برے لوگوں کی صحبت سے بھی بچنے کی دعا سکھائی۔ ¤ ➋ برائی کا جواب نیکی سے دینا اگرچہ دشمنوں کو دوست بنانے کے لیے اکسیر ہے، مگر اس کے لیے بہت بڑے حوصلے کی ضرورت ہے، ہر شخص میں یہ برداشت نہیں پائی جاتی، آدمی کا نفس اسے انتقام پر ابھارتا ہے، پھر انسانوں اور جنوں میں سے شیطان اسے اکسا کر غصہ دلاتے ہیں۔ اللہ تعالیٰ نے برائی کا جواب بہترین طریقے کے ساتھ دینے کی تلقین کے بعد ایسے شیطان انسانوں اور جنوں کی اکساہٹوں سے اپنی پناہ مانگنے کی تاکید فرمائی، کیونکہ ان ظالموں کا مقابلہ کرنے میں انسان بے بس ہے۔ یہاں اس کی کوئی تدبیر کام نہیں آتی، نہ ہی وہ شیطان کسی نیکی یا احسان سے دوست بنتے یا نرم ہوتے ہیں، کیونکہ انھوں نے دشمنی کی قسم کھا رکھی ہے۔ اس لیے اسے اس ذات گرامی کی پناہ میں آ جانا چاہیے جس کے قبضے میں کائنات کی ہر چیز ہے، نیک ہو یا بد ہر ایک کی پیشانی اس کے ہاتھ میں ہے۔ دوسری جگہ یہی بات تفصیل سے بیان فرمائی : «وَ لَا تَسْتَوِي الْحَسَنَةُ وَ لَا السَّيِّئَةُ اِدْفَعْ بِالَّتِيْ هِيَ اَحْسَنُ ففَاِذَا الَّذِيْ بَيْنَكَ وَ بَيْنَهٗ عَدَاوَةٌ كَاَنَّهٗ وَلِيٌّ حَمِيْمٌ (34) وَ مَا يُلَقّٰىهَاۤ اِلَّا الَّذِيْنَ صَبَرُوْا وَ مَا يُلَقّٰىهَاۤ اِلَّا ذُوْ حَظٍّ عَظِيْمٍ (35) وَ اِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ فَاسْتَعِذْ بِاللّٰهِ اِنَّهٗ هُوَ السَّمِيْعُ الْعَلِيْمُ » [ حٰمٓ السجدۃ : ۳۴ تا ۳۶ ] ’’اور نہ نیکی برابر ہوتی ہے اور نہ برائی۔ (برائی کو) اس (طریقے) کے ساتھ ہٹا جو سب سے اچھا ہے، تو اچانک وہ شخص کہ تیرے درمیان اور اس کے درمیان دشمنی ہے، ایسا ہوگا جیسے وہ دلی دوست ہے۔ اور یہ چیز نہیں دی جاتی مگر انھی کو جو صبر کریں اور یہ نہیں دی جاتی مگر اسی کو جو بہت بڑے نصیب والا ہے۔ اور اگر کبھی شیطان کی طرف سے کوئی اکساہٹ تجھے ابھار ہی دے تو اللہ کی پناہ طلب کر، بلاشبہ وہی سب کچھ سننے والا، سب کچھ جاننے والا ہے۔‘‘ اللہ تعالیٰ نے قرآن مجید پڑھتے وقت شیطان سے پناہ مانگنے کا حکم دیا۔ ( النحل : ۹۸) رسول اللہ صلی اللہ علیہ وسلم نے موت کے وقت شیطان کے گمراہ کرنے سے دعا کی تعلیم دی، ابو الیسر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا کیا کرتے تھے : [ أَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَدْمِ وَ أَعُوْذُ بِكَ مِنَ التَّرَدِّيْ، وَ  أَعُوْذُ بِكَ منَ الْغَرَقِ وَالْحَرَقِ وَالْهَرَمِ وَ أَعُوْذُ بِكَ مِنْ أَنْ يَتَخَبَّطَنِيَ الشَّيْطَانُ عِنْدَ الْمَوْتِ وَ أَعُوْذُ بِكَ أَنْ أَمُوْتَ فِيْ سَبِيْلِكَ مُدْبِرًا وَ أَعُوْذُ بِكَ أَنْ أَمُوْتَ لَدِيْغًا ] [ أبوداوٗد، الوتر، باب في الإستعاذۃ : ۱۵۵۲، و صححہ الألباني ]’’اے اللہ! میں تیری پناہ مانگتا ہوں (اپنے اوپر) دیوار وغیرہ گرنے سے اور تیری پناہ مانگتا ہوں نیچے گر جانے سے اور تیری پناہ مانگتا ہوں غرق ہونے سے، جلنے سے اور شدید بڑھاپے سے اور تیری پناہ مانگتا ہوں کہ شیطان مجھے موت کے وقت خبطی بنا دے اور اس بات سے تیری پناہ مانگتا ہوں کہ تیرے راستے میں پیٹھ دیتا ہوا مروں اور تیری پناہ مانگتا ہوں کہ زہریلے ڈنک سے مروں۔‘‘ کسی خاص وقت ہی میں نہیں، بلکہ {’’ وَ اَعُوْذُ بِكَ رَبِّ اَنْ يَّحْضُرُوْنِ ‘‘} کا مطلب یہ ہے کہ ’’اے میرے رب! میں تیری پناہ چاہتا ہوں کہ شیاطین میرے پاس کسی بھی وقت آئیں یا موجود ہوں۔‘‘ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے تمام کاموں کے شروع میں اللہ کا نام لینے کا حکم دیا، کیونکہ اللہ کا نام لینے سے شیطان بھاگ جاتا ہے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے کھانے پینے، جماع اور ذبح وغیرہ کے شروع میں اللہ کا نام لینے کا حکم دیا، رات کو اللہ کا نام لے کر سونے کا حکم دیا اور فرمایا : [ وَ أَغْلِقُوا الْأَبْوَابَ، وَاذْكُرُوا اسْمَ اللّٰهِ، فَإِنَّ الشَّيْطَانَ لاَ يَفْتَحُ بَابًا مُغْلَقًا، وَ أَوْكُوْا قِرَبَكُمْ وَاذْكُرُوا اسْمَ اللّٰهِ، وَ خَمِّرُوْا آنِيَتتَكُمْ وَاذْكُرُوا اسْمَ اللّٰهِ، وَلَوْ أَنْ تَعْرُضُوْا عَلَيْهَا شَيْئًا وَ أَطْفِؤا مَصَابِيْحَكُمْ ] [ بخاري، الأشربۃ، باب تغطیۃ الإناء : ۵۶۲۳۔ مسلم : ۹۷؍۲۰۱۲ ] ’’ (جب رات کی ایک گھڑی گزر جائے تو) دروازے بند کر لو اور اس وقت اللہ کا نام لو، کیونکہ شیطان بند دروازے کو نہیں کھولتا اور اللہ کا نام لے کر اپنے مشکیزوں کا منہ باندھ دو۔ اللہ کا نام لے کر اپنے برتنوں کو ڈھانپ دو، خواہ کسی چیز کو چوڑائی میں رکھ کر ہی ڈھانپ سکو اور اپنے چراغ ( سونے سے پہلے ) بجھا دیا کرو۔‘‘ ہمارے استاذ حافظ محمد گوندلوی رحمہ اللہ نے بیان کیا کہ ان کے پاس ایک شخص نے شکایت کی کہ رات کو اچانک گھر کے تمام دروازے کھل جاتے ہیں، تو انھوں نے رات بسم اللہ پڑھ کر دروازے بند کرنے کی نصیحت کی تو دروازوں کا کھلنا ختم ہو گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے غصے کے وقت بھی شیطان سے پناہ مانگنے کی تلقین فرمائی۔ سلیمان بن صرد رضی اللہ عنہ فرماتے ہیں کہ دو آدمی نبی صلی اللہ علیہ وسلم کے پاس ایک دوسرے کو گالی دینے لگے، ہم آپ کے پاس بیٹھے تھے۔ ان میں سے ایک دوسرے کو سخت غصے میں گالی دے رہا تھا، اس کا چہرہ سرخ ہو چکا تھا، نبی صلی اللہ علیہ وسلم نے فرمایا : [ إِنِّيْ لَأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ مَا يَجِدُ، لَوْ قَالَ أَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، فَقَالُوْا لِلرَّججُلِ أَلَا تَسْمَعُ مَا يَقُوْلُ النَّبِيُّ صَلَّي اللّٰهُ عَلَيْهِ وَ سَلَّمَ؟ قَالَ إِنِّيْ لَسْتُ بِمَجْنُوْنٍ ] [ بخاري، الأدب، باب الحذر من الغضب : ۶۱۱۵ ] ’’میں ایک کلمہ جانتا ہوں، اگر یہ شخص وہ کلمہ کہہ دے تو جو غصہ اسے آیا ہوا ہے چلا جائے۔ وہ کلمہ {’’أَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ‘‘} ہے۔‘‘ لوگوں نے اسے کہا : ’’سنتے نہیں! نبی صلی اللہ علیہ وسلم کیا فرما رہے ہیں؟‘‘ وہ کہنے لگا : ’’میں کوئی پاگل نہیں ہوں۔‘‘"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت 98،97) ➊ { وَ قُلْ رَّبِّ اَعُوْذُ بِكَ مِنْ هَمَزٰتِ الشَّيٰطِيْنِ … : ’’اَلْهَمْزُ‘‘} کا معنی ہاتھ یا کسی بھی چیز کے ساتھ چونکا مارنا ہے۔ گلا گھونٹنے، طعنہ دینے اور غیبت کے معنی میں بھی آتا ہے۔ مراد شیطان کے چونکے، وسوسے اور اکساہٹیں ہیں، جن کے ساتھ وہ غصے پر ابھارتا ہے، حتیٰ کہ جنون تک پہنچا دیتا ہے۔ شیاطین انس و جن کے وساوس کی تفصیل کے لیے دیکھیے سورۂ ناس کی تفسیر۔ {’’ اَنْ يَّحْضُرُوْنِ ‘‘} اصل میں {’’أَنْ يَّحْضُرُوْنِيْ‘‘} ہے، کیونکہ اگر ایسا نہ ہوتا تو {’’ اَنْ ‘‘} کے ساتھ {’’ يَحْضُرُوْنِ ‘‘} کا نون گر جاتا، یاء کو حذف کرکے نون کا کسرہ باقی رکھا ہے۔ مطلب یہ ہے کہ اے میرے رب! میں صرف شیاطین کے چونکوں ہی سے تیری پناہ نہیں مانگتا، اس بات سے بھی تیری پناہ مانگتا ہوں کہ وہ میرے پاس آئیں، کیونکہ انھوں نے خیر کے ساتھ تو آنا ہی نہیں۔ برے لوگوں کی صحبت سے بھی بچنے کی دعا سکھائی۔ ¤ ➋ برائی کا جواب نیکی سے دینا اگرچہ دشمنوں کو دوست بنانے کے لیے اکسیر ہے، مگر اس کے لیے بہت بڑے حوصلے کی ضرورت ہے، ہر شخص میں یہ برداشت نہیں پائی جاتی، آدمی کا نفس اسے انتقام پر ابھارتا ہے، پھر انسانوں اور جنوں میں سے شیطان اسے اکسا کر غصہ دلاتے ہیں۔ اللہ تعالیٰ نے برائی کا جواب بہترین طریقے کے ساتھ دینے کی تلقین کے بعد ایسے شیطان انسانوں اور جنوں کی اکساہٹوں سے اپنی پناہ مانگنے کی تاکید فرمائی، کیونکہ ان ظالموں کا مقابلہ کرنے میں انسان بے بس ہے۔ یہاں اس کی کوئی تدبیر کام نہیں آتی، نہ ہی وہ شیطان کسی نیکی یا احسان سے دوست بنتے یا نرم ہوتے ہیں، کیونکہ انھوں نے دشمنی کی قسم کھا رکھی ہے۔ اس لیے اسے اس ذات گرامی کی پناہ میں آ جانا چاہیے جس کے قبضے میں کائنات کی ہر چیز ہے، نیک ہو یا بد ہر ایک کی پیشانی اس کے ہاتھ میں ہے۔ دوسری جگہ یہی بات تفصیل سے بیان فرمائی : «وَ لَا تَسْتَوِي الْحَسَنَةُ وَ لَا السَّيِّئَةُ اِدْفَعْ بِالَّتِيْ هِيَ اَحْسَنُ ففَاِذَا الَّذِيْ بَيْنَكَ وَ بَيْنَهٗ عَدَاوَةٌ كَاَنَّهٗ وَلِيٌّ حَمِيْمٌ (34) وَ مَا يُلَقّٰىهَاۤ اِلَّا الَّذِيْنَ صَبَرُوْا وَ مَا يُلَقّٰىهَاۤ اِلَّا ذُوْ حَظٍّ عَظِيْمٍ (35) وَ اِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ فَاسْتَعِذْ بِاللّٰهِ اِنَّهٗ هُوَ السَّمِيْعُ الْعَلِيْمُ » [ حٰمٓ السجدۃ : ۳۴ تا ۳۶ ] ’’اور نہ نیکی برابر ہوتی ہے اور نہ برائی۔ (برائی کو) اس (طریقے) کے ساتھ ہٹا جو سب سے اچھا ہے، تو اچانک وہ شخص کہ تیرے درمیان اور اس کے درمیان دشمنی ہے، ایسا ہوگا جیسے وہ دلی دوست ہے۔ اور یہ چیز نہیں دی جاتی مگر انھی کو جو صبر کریں اور یہ نہیں دی جاتی مگر اسی کو جو بہت بڑے نصیب والا ہے۔ اور اگر کبھی شیطان کی طرف سے کوئی اکساہٹ تجھے ابھار ہی دے تو اللہ کی پناہ طلب کر، بلاشبہ وہی سب کچھ سننے والا، سب کچھ جاننے والا ہے۔‘‘ اللہ تعالیٰ نے قرآن مجید پڑھتے وقت شیطان سے پناہ مانگنے کا حکم دیا۔ ( النحل : ۹۸) رسول اللہ صلی اللہ علیہ وسلم نے موت کے وقت شیطان کے گمراہ کرنے سے دعا کی تعلیم دی، ابو الیسر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا کیا کرتے تھے : [ أَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَدْمِ وَ أَعُوْذُ بِكَ مِنَ التَّرَدِّيْ، وَ  أَعُوْذُ بِكَ منَ الْغَرَقِ وَالْحَرَقِ وَالْهَرَمِ وَ أَعُوْذُ بِكَ مِنْ أَنْ يَتَخَبَّطَنِيَ الشَّيْطَانُ عِنْدَ الْمَوْتِ وَ أَعُوْذُ بِكَ أَنْ أَمُوْتَ فِيْ سَبِيْلِكَ مُدْبِرًا وَ أَعُوْذُ بِكَ أَنْ أَمُوْتَ لَدِيْغًا ] [ أبوداوٗد، الوتر، باب في الإستعاذۃ : ۱۵۵۲، و صححہ الألباني ]’’اے اللہ! میں تیری پناہ مانگتا ہوں (اپنے اوپر) دیوار وغیرہ گرنے سے اور تیری پناہ مانگتا ہوں نیچے گر جانے سے اور تیری پناہ مانگتا ہوں غرق ہونے سے، جلنے سے اور شدید بڑھاپے سے اور تیری پناہ مانگتا ہوں کہ شیطان مجھے موت کے وقت خبطی بنا دے اور اس بات سے تیری پناہ مانگتا ہوں کہ تیرے راستے میں پیٹھ دیتا ہوا مروں اور تیری پناہ مانگتا ہوں کہ زہریلے ڈنک سے مروں۔‘‘ کسی خاص وقت ہی میں نہیں، بلکہ {’’ وَ اَعُوْذُ بِكَ رَبِّ اَنْ يَّحْضُرُوْنِ ‘‘} کا مطلب یہ ہے کہ ’’اے میرے رب! میں تیری پناہ چاہتا ہوں کہ شیاطین میرے پاس کسی بھی وقت آئیں یا موجود ہوں۔‘‘ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے تمام کاموں کے شروع میں اللہ کا نام لینے کا حکم دیا، کیونکہ اللہ کا نام لینے سے شیطان بھاگ جاتا ہے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے کھانے پینے، جماع اور ذبح وغیرہ کے شروع میں اللہ کا نام لینے کا حکم دیا، رات کو اللہ کا نام لے کر سونے کا حکم دیا اور فرمایا : [ وَ أَغْلِقُوا الْأَبْوَابَ، وَاذْكُرُوا اسْمَ اللّٰهِ، فَإِنَّ الشَّيْطَانَ لاَ يَفْتَحُ بَابًا مُغْلَقًا، وَ أَوْكُوْا قِرَبَكُمْ وَاذْكُرُوا اسْمَ اللّٰهِ، وَ خَمِّرُوْا آنِيَتتَكُمْ وَاذْكُرُوا اسْمَ اللّٰهِ، وَلَوْ أَنْ تَعْرُضُوْا عَلَيْهَا شَيْئًا وَ أَطْفِؤا مَصَابِيْحَكُمْ ] [ بخاري، الأشربۃ، باب تغطیۃ الإناء : ۵۶۲۳۔ مسلم : ۹۷؍۲۰۱۲ ] ’’ (جب رات کی ایک گھڑی گزر جائے تو) دروازے بند کر لو اور اس وقت اللہ کا نام لو، کیونکہ شیطان بند دروازے کو نہیں کھولتا اور اللہ کا نام لے کر اپنے مشکیزوں کا منہ باندھ دو۔ اللہ کا نام لے کر اپنے برتنوں کو ڈھانپ دو، خواہ کسی چیز کو چوڑائی میں رکھ کر ہی ڈھانپ سکو اور اپنے چراغ ( سونے سے پہلے ) بجھا دیا کرو۔‘‘ ہمارے استاذ حافظ محمد گوندلوی رحمہ اللہ نے بیان کیا کہ ان کے پاس ایک شخص نے شکایت کی کہ رات کو اچانک گھر کے تمام دروازے کھل جاتے ہیں، تو انھوں نے رات بسم اللہ پڑھ کر دروازے بند کرنے کی نصیحت کی تو دروازوں کا کھلنا ختم ہو گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے غصے کے وقت بھی شیطان سے پناہ مانگنے کی تلقین فرمائی۔ سلیمان بن صرد رضی اللہ عنہ فرماتے ہیں کہ دو آدمی نبی صلی اللہ علیہ وسلم کے پاس ایک دوسرے کو گالی دینے لگے، ہم آپ کے پاس بیٹھے تھے۔ ان میں سے ایک دوسرے کو سخت غصے میں گالی دے رہا تھا، اس کا چہرہ سرخ ہو چکا تھا، نبی صلی اللہ علیہ وسلم نے فرمایا : [ إِنِّيْ لَأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ مَا يَجِدُ، لَوْ قَالَ أَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، فَقَالُوْا لِلرَّججُلِ أَلَا تَسْمَعُ مَا يَقُوْلُ النَّبِيُّ صَلَّي اللّٰهُ عَلَيْهِ وَ سَلَّمَ؟ قَالَ إِنِّيْ لَسْتُ بِمَجْنُوْنٍ ] [ بخاري، الأدب، باب الحذر من الغضب : ۶۱۱۵ ] ’’میں ایک کلمہ جانتا ہوں، اگر یہ شخص وہ کلمہ کہہ دے تو جو غصہ اسے آیا ہوا ہے چلا جائے۔ وہ کلمہ {’’أَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ‘‘} ہے۔‘‘ لوگوں نے اسے کہا : ’’سنتے نہیں! نبی صلی اللہ علیہ وسلم کیا فرما رہے ہیں؟‘‘ وہ کہنے لگا : ’’میں کوئی پاگل نہیں ہوں۔‘‘"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت 99) ➊ { حَتّٰۤى اِذَا جَآءَ اَحَدَهُمُ الْمَوْتُ :} یہاں ایک سوال ہے کہ لفظ {’’ حَتّٰۤى ‘‘} (یہاں تک) کا تعلق کس سے ہے؟ مفسرین نے اس کی کئی توجیہیں فرمائی ہیں۔ ایک یہ کہ آپ کفار کی برائیوں کا جواب بہترین طریقے سے دیتے رہیں اور جو باتیں یہ بناتے ہیں انھیں ہمارے حوالے کرتے رہیں، یہاں تک کہ…الخ۔ دوسری توجیہ اس سے زیادہ واضح ہے کہ اس کا تعلق محذوف جملے سے ہے جو {’’ حَتّٰۤى اِذَا جَآءَ اَحَدَهُمُ الْمَوْتُ ‘‘} سے خود بخود معلوم ہو رہا ہے۔ {’’أَيْ لَا يَزَالُوْنَ كَذٰلِكَ حَتّٰي إِذَا جَاءَ …‘‘} یعنی وہ اسی طرح اپنے کفر و شرک پر قائم رہتے ہیں، یہاں تک کہ جب ان میں سے کسی کے پاس موت آتی ہے…۔ اس طرح جملے کے حذف کی مثال فرزدق کا شعر ہے: ¤ {فَيَا عَجَبَا حَتّٰي كُلَيْبٌ تَسُبُّنِيْ ¤ كَأَنَّ أَبَاهَا نَهْشَلٌ أَوْ مُجَاشِعُ } ¤ ({أَيْ يَسُبُّنِيَ النَّاسُ حَتّٰي كُلَيْبٌ}) ’’یعنی تعجب ہے کہ مجھے سبھی لوگ گالی دیتے ہیں، حتیٰ کہ بنو کلیب بھی گالی دیتے ہیں، جیسے ان کا باپ نہشل یا مجاشع ہے، یعنی کسی نامور باپ کی اولاد نہ ہونے کے باوجود کلیب جیسے قبیلے کے بے وقعت لوگ بھی میرے جیسے اونچے نسب والے شخص کو گالی دیتے ہیں۔‘‘ ¤ ➋ { قَالَ رَبِّ ارْجِعُوْنِ : ’’رَجَعَ يَرْجِعُ‘‘} لازم بھی آتا ہے اور متعدی بھی، اس کا معنی لوٹنا بھی ہے اور لوٹانا بھی، یہاں مراد لوٹانا ہے۔ یعنی کافر و مشرک اپنے کفر و شرک پر اڑے رہتے ہیں، یہاں تک کہ جب ان میں سے کسی کے پاس موت آتی ہے اور رسولوں کی بتائی ہوئی وہ تمام حقیقتیں آنکھوں کے سامنے آتی ہیں، جنھیں وہ اب تک جھٹلاتے رہے تھے، تو وہ مہلت دینے اور دنیا کی طرف واپس لوٹانے کی درخواست کرتے ہیں۔ دیکھیے سورۂ منافقون (۱۰، ۱۱) اور ابراہیم (۴۴) یہ درخواست وہ موت کے وقت بھی کریں گے، قیامت کے دن بھی اور آگ کو دیکھ کر بھی، جیسا کہ دوسری آیات میں آیا ہے۔ دیکھیے سورۂ اعراف (۵۳)، سجدہ (۱۲)، انعام (۲۷)، شوریٰ (۴۴)، مؤمن (۱۱)، فاطر (۳۷) اور سبا (۵۱ تا ۵۳)۔ ¤ ➌ { ’’ رَبِّ ‘‘} (اے میرے رب!) میں مخاطب واحد ہے، جبکہ {’’ ارْجِعُوْنِ ‘‘} (مجھے واپس بھیجو) میں مخاطب جمع ہے۔ مفسرین نے اس کی تین توجیہیں کی ہیں، ایک یہ کہ کافر نہایت عجز کے ساتھ درخواست کرتے ہوئے تعظیم کے لیے اللہ تعالیٰ کو جمع کے صیغے سے مخاطب کرے گا، جیسا کہ تمام زبانوں میں یہ انداز معروف ہے، عربی میں بھی ایسے ہی ہے۔ جیسا کہ فرشتوں نے سارہ علیھا السلام کو مخاطب کرتے ہوئے کہا تھا : « اَتَعْجَبِيْنَ مِنْ اَمْرِ اللّٰهِ رَحْمَتُ اللّٰهِ وَ بَرَكٰتُهٗ عَلَيْكُمْ اَهْلَ الْبَيْتِ» [ ھود : ۷۳ ] ’’کیا تو اللہ کے حکم سے تعجب کرتی ہے؟ اللہ کی رحمت اور اس کی برکتیں ہوں تم پر اے گھر والو!‘‘ ابن عاشور لکھتے ہیں کہ مخاطب مذکر ہو یا مؤنث، تعظیم کے وقت اس کے لیے جمع مذکر کی ضمیر {’’كُمْ‘‘} ہی استعمال ہوتی ہے۔ کلام عرب میں واحد مخاطب کے لیے جمع کی ضمیر کی مثال حسانن بن ثابت رضی اللہ عنہ کا قول ہے: ¤ {أَلَا فَارْحَمُوْنِيْ يَا إِلٰهَ مُحَمَّدٍ ¤ فَإِنْ لَمْ أَكُنْ أَهْلًا فَأَنْتَ لَهُ أَهْلٌ} ¤ اس شعر میں شاعر نے {’’فَارْحَمْنِيْ‘‘} کے بجائے {’’فَارْحَمُوْنِيْ‘‘} کہا ہے اور حماسہ کے شاعر جعفر بن عُلبہ حارثی کا شعر ہے، جس میں وہ اپنی محبوبہ کو مخاطب کرتے ہوئے کہتا ہے: ¤ {فَلاَ تَحْسَبِيْ أَنِّيْ تَخَشَّعْتُ بَعْدَكُمْ ¤ لِشَيْءٍ وَ لَا أَنِّيْ مِنَ الْمَوْتِ أَفْرَقُ}  ¤ ’’پس تو یہ گمان نہ کر کہ میں تمھارے بعد کسی چیز کی وجہ سے عاجز ہو گیا ہوں اور نہ یہ کہ میں موت سے ڈرتا ہوں۔‘‘ ¤ اس شعر میں شاعر نے {’’بَعْدَكِ‘‘} کے بجائے {’’بَعْدَكُمْ‘‘} کہا ہے۔ یہ توجیہ سب سے اچھی ہے۔ دوسری توجیہ طبری رحمہ اللہ نے فرمائی ہے کہ کافر کلام کی ابتدا {’’ رَبِّ ‘‘} سے کرے گا، جو استغاثہ کے لیے ہے، مگر وہ واپس بھیجنے کی درخواست ان فرشتوں سے کرے گا جو اس کی روح نکالنے کے لیے آئے ہوں گے۔ یہ ایسے ہی ہے جیسے کچھ لوگ کسی کو پکڑ لیں اور وہ کہے ’’ہائے اللہ! مجھے چھوڑ دو۔‘‘ یہ توجیہ بھی بہت اچھی ہے۔ تیسری توجیہ یہ ہے کہ کافر اللہ تعالیٰ سے بار بار درخواست کرے گا : {’’ارْجِعْنِيْ، ارْجِعْنِيْ، ارْجِعْنِيْ‘‘} تو اس تکرار کے بیان کے لیے جمع کا صیغہ {’’ ارْجِعُوْنِ ‘‘} استعمال کیا گیا ہے۔ اس توجیہ کی معتبر نظیر مجھے نہیں ملی۔"
    },
    {
      "ayah": 100,
      "tafsir": "(آیت 100) ➊ {لَعَلِّيْۤ اَعْمَلُ صَالِحًا فِيْمَا تَرَكْتُ :} تاکہ میں جو کچھ مال و متاع چھوڑ آیا ہوں اس میں کوئی نیک عمل کر لوں، یا اس دنیا میں جا کر کوئی نیک عمل کر لوں جسے میں چھوڑ آیا ہوں۔ تفسیر ابن کثیر میں ہے : ’’قتادہ نے آیت : « حَتّٰۤى اِذَا جَآءَ اَحَدَهُمُ الْمَوْتُ» کے متعلق کہا کہ علاء بن زیاد فرمایا کرتے تھے کہ آدمی کو چاہیے کہ اپنے آپ کو اس مرنے والے کی جگہ رکھ کر سوچے کہ گویا اس کی موت آ پہنچی تھی اور اس نے رب تعالیٰ سے مہلت مانگی تو اسے مل گئی، سو وہ اس مہلت میں جس قدر ہو سکے اللہ تعالیٰ کی بندگی کر لے۔ اور قتادہ نے فرمایا، اللہ کی قسم! نہ وہ گھر والوں کی طرف جانے کی تمنا کرے گا، نہ اولاد کی طرف، بلکہ یہی تمنا کرے گا کہ واپس جا کر اللہ کی اطاعت کر لے۔ سو کوتاہی کرنے والے کافر کی آرزو دیکھو اور ملی ہوئی مہلت سے فائدہ اٹھا کر اس پر عمل کر لو۔ ‘‘ ¤ ➋ { كَلَّا :} اس کے دو معنی ہیں اور دونوں مراد ہیں، ایک یہ کہ ہر گز ایسا نہ ہو گا کہ تم دنیا میں واپس جاؤ اور دوسرا یہ کہ تمھارا کہنا کہ میں واپس جا کر نیک عمل کروں گا، ہر گز درست نہیں۔ ¤ ➌ { اِنَّهَا كَلِمَةٌ هُوَ قَآىِٕلُهَا :} یعنی یہ صرف ایک بات ہو گی جو وہ کہے گا، حقیقت سے اس کا کوئی تعلق نہیں ہو گا، بلکہ وہ صاف جھوٹ کہہ رہا ہو گا، جیسا کہ فرمایا : « وَ لَوْ رُدُّوْا لَعَادُوْا لِمَا نُهُوْا عَنْهُ وَ اِنَّهُمْ لَكٰذِبُوْنَ » [ الأنعام : ۲۸ ] ’’اور اگر انھیں واپس بھیج دیا جائے تو ضرور پھر وہی کریں گے جس سے انھیں منع کیا گیا اور بلاشبہ وہ یقینا جھوٹے ہیں۔‘‘ دوسرا مطلب یہ کہ یہ صرف اس کے منہ کی بات ہو گی جو وہ بار بار کہے گا، مگر اسے اس کا کچھ فائدہ نہیں ہو گا اور تیسرا مطلب یہ ہے کہ یہ ایسی بات ہے جو ہر کافر مرتے وقت ضرور ہی کہنے والا ہے۔ ¤ ➍ { وَ مِنْ وَّرَآىِٕهِمْ بَرْزَخٌ اِلٰى يَوْمِ يُبْعَثُوْنَ : ’’وَرَاءٌ‘‘} کا معنی آگے بھی ہے اور پیچھے بھی، یہاں دونوں معنی مراد ہیں کہ آگے ایک اور عالم برزخ آ رہا ہے، جسے قبر کی زندگی بھی کہا جاتا ہے، جہاں پہنچ کر دنیا والوں سے پردہ ہو جاتا ہے اور آخرت بھی سامنے نہیں آتی۔ ہاں کافر کے لیے آخرت کے عذاب کا تھوڑا سا نمونہ سامنے آتا ہے، جس کا مزہ قیامت تک چکھتا رہے گا۔ اسی طرح اہل ایمان کے لیے راحت و نعمت میسر ہوتی ہے۔ دونوں کا احادیث میں ذکر ہے اور آیات میں بھی۔ دیکھیے سورۂ مؤمن (۴۵، ۴۶)۔"
    },
    {
      "ayah": 101,
      "tafsir": "(آیت 101) ➊ { فَاِذَا نُفِخَ فِي الصُّوْرِ فَلَاۤ اَنْسَابَ بَيْنَهُمْ:} نسب سے مراد وہ قرابت ہہے جو ولادت کی وجہ سے حاصل ہوتی ہے۔ {’’ بَيْنَهُمْ ‘‘} سے مراد کفار ہیں، کیونکہ پیچھے انھی کا ذکر آ رہا ہے۔ عالم برزخ کے بعد جب قبروں سے زندہ ہو کر نکلنے کے لیے صور میں پھونکا جائے گا تو کفار کی باہمی تمام نسبی قرابتیں ختم ہو جائیں گی۔ اس کا یہ مطلب نہیں کہ کوئی کسی کا باپ یا بیٹا یا بھائی نہیں رہے گا، بلکہ مطلب یہ ہے کہ اس نسبی تعلق کی وجہ سے جو ایک دوسرے کی مدد ہوتی ہے، وہ نہیں ہو گی، جیسا کہ فرمایا : «يَوْمَ يَفِرُّ الْمَرْءُ مِنْ اَخِيْهِ (34) وَ اُمِّهٖ وَ اَبِيْهِ (35) وَ صَاحِبَتِهٖ وَ بَنِيْهِ (36) لِكُلِّ امْرِئٍ مِّنْهُمْ يَوْمَىِٕذٍ شَاْنٌ يُّغْنِيْهِ» [عبس: ۳۴ تا ۳۷ ] ’’جس دن آدمی اپنے بھائی سے بھاگے گا۔اور اپنی ماں اور اپنے باپ سے۔ اور اپنی بیوی اور اپنے بیٹوں سے ۔ اس دن ان میں سے ہر شخص کی ایک ایسی حالت ہوگی جو اسے (دوسروں سے) بے پروا بنا دے گی۔‘‘ یہ حال مجرموں کا ہو گا، جیسا کہ فرمایا : «يَوَدُّ الْمُجْرِمُ لَوْ يَفْتَدِيْ مِنْ عَذَابِ يَوْمِىِٕذٍۭ بِبَنِيْهِ (11) وَ صَاحِبَتِهٖ وَ اَخِيْهِ (12) وَ فَصِيْلَتِهِ الَّتِيْ تُـْٔوِيْهِ (13) وَ مَنْ فِي الْاَرْضِ جَمِيْعًا ثُمَّ يُنْجِيْهِ » [ المعارج : ۱۱ تا ۱۴ ] ’’مجرم چاہے گا کاش کہ اس دن کے عذاب سے (بچنے کے لیے) فدیے میں دے دے اپنے بیٹوں کو۔ اور اپنی بیوی اور اپنے بھائی کو۔ اور اپنے خاندان کو، جو اسے جگہ دیا کرتا تھا۔ اور ان تمام لوگوں کو جو زمین میں ہیں، پھر اپنے آپ کو بچا لے۔‘‘ یہ معاملہ صور پھونکنے کے وقت ہو گا۔ بعد میں بھی کفار کا حال یہی رہے گا۔ البتہ ایمان والوں کو ان کی نسبی قرابت کا فائدہ ہو گا اور دوستی کا بھی، جیسا کہ فرمایا : «وَ الَّذِيْنَ اٰمَنُوْا وَ اتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِاِيْمَانٍ اَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَ مَاۤ اَلَتْنٰهُمْ مِّنْ عَمَلِهِمْ مِّنْ شَيْءٍ » [ الطور : ۲۱ ] ’’اور جو لوگ ایمان لائے اور ان کی اولاد کسی بھی درجے کے ایمان کے ساتھ۔ ان کے پیچھے چلی، ہم ان کی اولاد کو ان کے ساتھ ملا دیں گے اور ان سے ان کے عمل میں کچھ کمی نہ کریں گے۔‘‘ اور دوستی کے متعلق فرمایا : « اَلْاَخِلَّآءُ يَوْمَىِٕذٍۭ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ اِلَّا الْمُتَّقِيْنَ» [ الزخرف : ۶۷ ] ’’سب دلی دوست اس دن ایک دوسرے کے دشمن ہوں گے، مگر متقی لوگ۔‘‘ ¤ ➋ { وَ لَا يَتَسَآءَلُوْنَ :} یہاں ایک سوال ہے کہ یہاں فرمایا کہ وہ ایک دوسرے سے سوال نہیں کریں گے، جب کہ دوسری جگہ فرمایا : « وَ اَقْبَلَ بَعْضُهُمْ عَلٰى بَعْضٍ يَّتَسَآءَلُوْنَ » [ الصافآت : ۲۷ ] ’’اور ان کے بعض بعض کی طرف متوجہ ہوں گے، ایک دوسرے سے سوال کریں گے۔‘‘ ایسا کیوں ہے؟ جواب اس کا یہ ہے کہ قیامت کا دن پچاس ہزار سال کا دن ہے۔ اس میں مختلف مواقع اور مختلف حالتیں ہوں گی، کسی حالت میں ایک دوسرے سے سوال کریں گے اور کسی میں نہیں کریں گے۔ لہٰذا ان آیات میں تعارض نہیں۔"
    },
    {
      "ayah": 102,
      "tafsir": "(آیت 103،102) ان دونوں آیات میں قیامت کا ایک اور منظر بیان کیا گیا ہے اور وہ ہے اعمال کا وزن۔ {’’مَوَازِيْنُ‘‘} کو جمع لانے سے معلوم ہوتا ہے کہ میزان کئی قسم کے ہوں گے، ہر عمل کے لیے مخصوص ترازو ہو گا۔ ان دونوں آیات میں اہل ایمان کے لیے خوش خبری ہے اور مشرکین کے لیے وعید، کیونکہ اصل وزن ایمان کے ساتھ عمل صالح کا ہو گا، مشرکین کے عمل ویسے ہی باطل ہوں گے، جیسا کہ فرمایا : « وَ قَدِمْنَاۤ اِلٰى مَا عَمِلُوْا مِنْ عَمَلٍ فَجَعَلْنٰهُ هَبَآءً مَّنْثُوْرًاا » [ الفرقان : ۲۳ ] ’’اور ہم اس کی طرف آئیں گے جو انھوں نے کوئی بھی عمل کیا ہو گا تو اسے بکھرا ہوا غبار بنا دیں گے۔‘‘ اور فرمایا : « اُولٰٓىِٕكَ الَّذِيْنَ كَفَرُوْا بِاٰيٰتِ رَبِّهِمْ وَ لِقَآىِٕهٖ فَحَبِطَتْ اَعْمَالُهُمْ فَلَا نُقِيْمُ لَهُمْ يَوْمَ الْقِيٰمَةِ وَزْنًا» [ الکہف : ۱۰۵ ] ’’یہی لوگ ہیں جنھوں نے اپنے رب کی آیات اور اس کی ملاقات کا انکار کیا، تو ان کے اعمال ضائع ہوگئے، سو ہم قیامت کے دن ان کے لیے کوئی وزن قائم نہیں کریں گے۔‘‘"
    },
    {
      "ayah": 103,
      "tafsir": "(آیت 103،102) ان دونوں آیات میں قیامت کا ایک اور منظر بیان کیا گیا ہے اور وہ ہے اعمال کا وزن۔ {’’مَوَازِيْنُ‘‘} کو جمع لانے سے معلوم ہوتا ہے کہ میزان کئی قسم کے ہوں گے، ہر عمل کے لیے مخصوص ترازو ہو گا۔ ان دونوں آیات میں اہل ایمان کے لیے خوش خبری ہے اور مشرکین کے لیے وعید، کیونکہ اصل وزن ایمان کے ساتھ عمل صالح کا ہو گا، مشرکین کے عمل ویسے ہی باطل ہوں گے، جیسا کہ فرمایا : « وَ قَدِمْنَاۤ اِلٰى مَا عَمِلُوْا مِنْ عَمَلٍ فَجَعَلْنٰهُ هَبَآءً مَّنْثُوْرًاا » [ الفرقان : ۲۳ ] ’’اور ہم اس کی طرف آئیں گے جو انھوں نے کوئی بھی عمل کیا ہو گا تو اسے بکھرا ہوا غبار بنا دیں گے۔‘‘ اور فرمایا : « اُولٰٓىِٕكَ الَّذِيْنَ كَفَرُوْا بِاٰيٰتِ رَبِّهِمْ وَ لِقَآىِٕهٖ فَحَبِطَتْ اَعْمَالُهُمْ فَلَا نُقِيْمُ لَهُمْ يَوْمَ الْقِيٰمَةِ وَزْنًا» [ الکہف : ۱۰۵ ] ’’یہی لوگ ہیں جنھوں نے اپنے رب کی آیات اور اس کی ملاقات کا انکار کیا، تو ان کے اعمال ضائع ہوگئے، سو ہم قیامت کے دن ان کے لیے کوئی وزن قائم نہیں کریں گے۔‘‘"
    },
    {
      "ayah": 104,
      "tafsir": "(آیت 104) ➊ { تَلْفَحُ وُجُوْهَهُمُ النَّارُ:} چہرے کا ذکر اس لیے فرمایا کہ یہ انسان کا سب سے اہم اور باشرف حصہ ہے اور انسان سب سے زیادہ اسی کو بچانے کی کوشش کرتا ہے، جب آگ اسے بھی جلا رہی ہو گی تو جسم کے دوسرے حصوں کا کیا حال ہو گا۔ ¤ ➋ { وَ هُمْ فِيْهَا كٰلِحُوْنَ : ’’ كَلَحَ ‘‘} کا معنی ہے کہ اوپر کا ہونٹ اوپر اٹھ جائے اور نیچے کا مزید نیچے ہو جائے اور دانت باہر نکل آئیں، جس سے چہرہ شدید تیوری والا، نہایت بدشکل اور ڈراؤنا ہو جائے، جیسے بکرے کی جلی ہوئی سری ہوتی ہے۔"
    },
    {
      "ayah": 105,
      "tafsir": ""
    },
    {
      "ayah": 106,
      "tafsir": "(آیت 106) ➊ {قَالُوْا رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا: ’’شِقْوَةٌ‘‘} بدبختی۔ {’’الصحيح المسبور‘‘} میں ہے کہ آدم بن ابی ایاس نے صحیح سند کے ساتھ مجاہد کا قول نقل فرمایا ہے کہ آیت : «غَلَبَتْ عَلَيْنَا شِقْوَتُنَا » کا معنی ہے : {’’اَلَّتِيْ كَتَبْتَ عَلَيْنَا‘‘} یعنی ہم پر ہماری وہ بدبختی غالب آ گئی جو تو نے ہم پر لکھی تھی۔ طبری نے بھی یہ قول نقل فرمایا ہے۔ معلوم ہوا کہ ظالم اپنا عذر پیش کرتے ہوئے بھی سارا الزام اللہ تعالیٰ پر رکھیں گے، جیسا کہ شیطان نے بھی اپنی گمراہی کا الزام اللہ تعالیٰ کو دیا تھا۔ دیکھیے سورۂ اعراف (۱۶)۔ ¤ ➋ { وَ كُنَّا قَوْمًا ضَآلِّيْنَ:} ابن کثیر نے فرمایا : ’’یعنی ہم پر حجت قائم ہوئی (اور ہم تک ہدایت کی بات پہنچی) لیکن ہم اس سے کہیں زیادہ بدبخت تھے کہ اس کے تابع ہوتے اور اس کی پیروی کرتے، سو ہم اس سے بھٹک گئے اور ہمیں ہدایت حاصل نہ ہو سکی۔‘‘"
    },
    {
      "ayah": 107,
      "tafsir": "(آیت 107) { رَبَّنَاۤ اَخْرِجْنَا مِنْهَا …:} یہ مطالبہ وہ اس سے پہلے بھی کئی بار کر چکے ہوں گے۔ دیکھیے اسی سورت کی آیت (۹۹)۔"
    },
    {
      "ayah": 108,
      "tafsir": "(آیت 108) {قَالَ اخْسَـُٔوْا فِيْهَا …:’’ خَسَأَ يَخْسَأُ} (منع) {أَيْ ذَلَّ۔‘‘ ’’ اخْسَـُٔوْا ‘‘} ذلیل رہو، دفع دور رہو۔ یہ لفظ کتے وغیرہ کو دھتکارنے کے لیے بولا جاتا ہے، پھر اس کا استعمال ہر اس شخص کے لیے بھی ہونے لگا جسے حقیر اور ذلیل قرار دے کر دور دفع ہونے کے لیے کہا جائے، یعنی اللہ تعالیٰ انھیں دھتکارتے ہوئے فرمائیں گے کہ اسی جہنم میں ذلیل اور دور دفع رہو اور مجھ سے بات مت کرو۔ بعض روایات میں ہے کہ اس کے بعد ان کی زبانیں بند ہو جائیں گی اور یہ ان کا آخری کلام ہو گا، مگر انھی آیات میں آگے ان کی اللہ تعالیٰ سے گفتگو آ رہی ہے : « قٰلَ كَمْ لَبِثْتُمْ فِي الْاَرْضِ عَدَدَ سِنِيْنَ (112) قَالُوْا لَبِثْنَا يَوْمًا اَوْ بَعْضَ يَوْمٍ فَسْـَٔلِ الْعَآدِّيْنَ » [ المؤمنونن : ۱۱۲، ۱۱۳ ] ’’فرمائے گا تم زمین میں سالوں کی گنتی میں کتنی مدت رہے؟ وہ کہیں گے ہم ایک دن یا دن کا کچھ حصہ رہے، سو شمار کرنے والوں سے پوچھ لے۔‘‘ اس سے معلوم ہوا کہ ایسی کوئی روایت صحیح نہیں۔ البتہ آیت سے یہ بات ثابت ہوتی ہے کہ ان کی درخواست حقارت کے ساتھ رد کر دی جائے گی۔"
    },
    {
      "ayah": 109,
      "tafsir": "(آیت 109) ➊ { اِنَّهٗ كَانَ فَرِيْقٌ مِّنْ عِبَادِيْ … : ’’ فَرِيْقٌ ‘‘} کے لفظ سے معلوم ہوا کہ اللہ کے وہ بندے کفار اور ان کے عقیدہ و عمل سے یکسر الگ گروہ تھے۔ مقصود اس کلام سے کفار کو دنیا میں اہل ایمان کے ساتھ ان کے سلوک کی اور اہل ایمان کی موجودہ حالت کی خبر دے کر حسرت و افسوس دلانا ہے۔ ¤ ➋ { رَبَّنَاۤ اٰمَنَّا فَاغْفِرْ لَنَا وَ ارْحَمْنَا:} ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا گیا : [ أَيُّ الْعَمَلِ أَفْضَلُ؟ قَالَ إِيْمَانٌ بِاللّٰهِ وَرَسُوْلِهِ ] [ بخاري، الإیمان، باب من قال إن الإیمان ھو العمل : ۲۶ ]’’ کون سا عمل افضل ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ اور اس کے رسول پر ایمان لانا۔‘‘ یعنی میرے بندوں میں سے ایک گروہ کے لوگ مجھ پر اور میرے رسول پر ایمان لانے کے عمل کا وسیلہ پیش کرکے مجھ سے دعا کیا کرتے تھے۔ اس سے دعا کے وقت اپنے کسی خالص عمل کا وسیلہ پیش کرنا ثابت ہوا۔ دیکھیے { اِيَّاكَ نَعْبُدُ وَ اِيَّاكَ نَسْتَعِيْنُ } کی تفسیر اور آل عمران کی آیت (۱۹۳) کی تفسیر۔ ¤ ➌ { فَاغْفِرْ لَنَا وَ ارْحَمْنَا : ’’غَفَرَ‘‘} کا معنی پردہ ڈالنا ہے۔ {’’اَلْمِغْفَرُ‘‘} خَود کو کہتے ہیں، جو لوہے کا ہوتا ہے اور دشمن کی ضرب سے پردے کا کام دیتا ہے، یعنی اے ہمارے رب! ہم تجھ پر اور تیرے رسول پر ایمان لائے ہیں، اس لیے تو ہمارے گناہوں اور لغزشوں پر پردہ ڈال، ایسا پردہ کہ کراماً کاتبین کے دفتر میں بھی نظر نہ آئے اور ہم پر رحم کر۔ ¤ ➍ { وَ اَنْتَ خَيْرُ الرّٰحِمِيْنَ :} یہاں بقاعی رحمہ اللہ نے واؤ عطف کا نکتہ بیان فرمایا ہے (اور انھوں نے تقریباً ہر ایسی جگہ مقام کے مطابق کوئی نکتہ بیان فرمایا ہے، جو صاحب ذوق حضرات کے لیے نہایت پر لطف ہے) وہ کہتے ہیں کہ واؤ کا مطلب یہ ہے کہ {’’اَنْتَ خَيْرُ الرّٰحِمِيْنَ ‘‘} سے پہلے ایک جملہ ہے جس پر {’’ اَنْتَ خَيْرُ الرّٰحِمِيْنَ ‘‘} کا عطف ہے۔ {’’ فَاغْفِرْ لَنَا وَ ارْحَمْنَا ‘‘} کی مناسبت سے پورا کلام اس طرح ہے : {’’ فَأَنْتَ خَيْرُ الْغَافِرِيْنَ وَ أَنْتَ خَيْرُ الرَّاحِمِيْنَ ۔‘‘} واؤ عطف سے چونکہ بات واضح ہو رہی ہے، اس لیے {’’ أَنْتَ خَيْرُ الْغَافِرِيْنَ ‘‘} کو حذف کر دیا، کیونکہ مسلمہ قاعدہ ہے: {’’خَيْرُ الْكَلَامِ مَا قَلَّ وَ دَلَّ‘‘} کہ بہترین کلام وہ ہے جس میں الفاظ کم ہوں اور وہ مدلل ہو۔"
    },
    {
      "ayah": 110,
      "tafsir": "(آیت 110) ➊ {فَاتَّخَذْتُمُوْهُمْ سِخْرِيًّا …: ’’ حَتّٰۤى اَنْسَوْكُمْ ذِكْرِيْ ‘‘} کا لفظی معنی یہ ہے کہ انھوں نے تمھیں میری یاد بھلا دی۔ یعنی تم ان کے پیچھے ایسے ہاتھ دھو کر پڑے اور ان کا اس قدر مذاق اڑاتے رہے کہ گویا وہ تمھیں میری یاد بھلانے کا سبب بن گئے۔ (شوکانی) ¤ ➋ { وَ كُنْتُمْ مِّنْهُمْ تَضْحَكُوْنَ :} دیکھیے سورۂ مطففین (۲۹ تا ۳۶)۔"
    },
    {
      "ayah": 111,
      "tafsir": "(آیت 111) { اِنِّيْ جَزَيْتُهُمُ الْيَوْمَ …:} دنیا میں اہل ایمان کے لیے ایک صبر آزما مرحلہ یہ ہوتا ہے کہ جب وہ دین پر عمل کرتے ہیں تو دین سے جاہل اور ایمان سے بے خبر لوگ انھیں ہنسی مذاق اور ملامت کا نشانہ بنا لیتے ہیں۔ کتنے ہی کمزور ایمان والے ہیں جو ان ملامتوں سے ڈر کر بہت سے احکام الٰہی پر عمل کرنے سے گریز کرتے ہیں، جیسے مشرکانہ رسوم سے کنارہ کشی اور ان کا رد ہے، ڈاڑھی ہے، پردے کا مسئلہ ہے، شادی بیاہ اور موت وغیرہ کی ہندوانہ رسوم سے اجتناب ہے وغیرہ وغیرہ۔ خوش قسمت ہیں وہ لوگ جو کسی بھی ملامت کی پروا نہیں کرتے اور اللہ اور اس کے رسول کی اطاعت سے کسی بھی موقع پر انحراف نہیں کرتے۔ اللہ تعالیٰ قیامت کے دن انھیں اس کی بہترین جزا عطا فرمائے گا اور انھی کو کامیابی سے سرفراز فرمائے گا۔ یا اللہ! تو ہمیں بھی ان خوش نصیبوں میں شامل فرما۔ (آمین) سورۂ مطففین کی آیات (۲۹ تا ۳۶) بھی ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 112,
      "tafsir": "(آیت 112) { قٰلَ كَمْ لَبِثْتُمْ فِي الْاَرْضِ عَدَدَ سِنِيْنَ :} کفار قیامت کا انکار کرتے تھے اور دنیا کی زندگی کے علاوہ کسی زندگی کو نہیں مانتے تھے۔ ان کے خیال میں مٹی اور ہڈیاں ہو جانے کے بعد زندہ ہونا ممکن نہ تھا، اس لیے انھوں نے دنیا کی زندگی ہی کو سب کچھ سمجھا، اسے آخرت پر ترجیح دی اور اسے اس طرح گزارا جیسے انھیں ہمیشہ یہیں رہنا ہے، حالانکہ یہ تھوڑا سا وقت غنیمت جان کر اگر آخرت کو دنیا پر ترجیح دیتے اور اسے اللہ کی فرماں برداری میں گزارتے تو اس کے صلے میں ہمیشہ ہمیشہ جنت کی نہ ختم ہونے والی نعمتوں کے مالک بنتے۔ لیکن انھوں نے یہ تھوڑا سا وقت بہت لمبا زمانہ سمجھ کر اللہ کی نافرمانی میں گزارا تو اس کے بدلے میں ہمیشہ ہمیشہ جہنم کے مستحق ٹھہرے۔ قیامت کے دن جب وہ اس عذاب میں مبتلا ہوں گے جو ختم ہونے والا ہی نہیں، تو اللہ تعالیٰ انھیں اس زندگی کی حقیقت یاد دلانے کے لیے، جسے وہ سبھی کچھ سمجھتے تھے، ان سے سوال کریں گے کہ تم زمین میں کتنے سال رہے ہو؟"
    },
    {
      "ayah": 113,
      "tafsir": "(آیت 113) ➊ { قَالُوْا لَبِثْنَا يَوْمًا اَوْ بَعْضَ يَوْمٍ … :} وہ جواب میں کہیں گے کہ ہم وہاں ایک دن یا اس کا کچھ حصہ رہے ہیں۔ گویا وہ عذاب کی مصیبت میں ایسے پھنسے ہوں گے کہ انھیں اچھی طرح وہ عرصہ بھی یاد نہیں رہے گا جو انھوں نے دنیا میں گزارا، اس لیے وہ اللہ تعالیٰ کے سوال کے جواب میں یہ کہہ کر کہ ہم نے وہاں ایک دن یا دن کا کچھ حصہ گزارا ہے، یہ کہیں گے کہ ہمیں تو وہ مدت اچھی طرح یاد نہیں، اس لیے آپ شمار کرنے والوں سے پوچھ لیں، جنھوں نے ہماری زندگی کے ایک ایک سانس کے عمل کو شمار کر رکھا ہے۔ مراد فرشتے ہیں۔ ¤ ➋ انھیں دنیا کی زندگی اتنی مختصر کیوں دکھائی دے گی، اس لیے کہ گزرا ہوا وقت ایسے ہی دکھائی دیتا ہے اور اس لیے کہ جو ختم ہو جائے وہ باقی رہنے والے کے مقابلے میں کالعدم ہوتا ہے اور اس لیے کہ جہنم کے ایک غوطے کے بعد ہی انھیں یہ محسوس ہو گا کہ انھوں نے کبھی راحت و آرام دیکھا ہی نہیں۔ [ دیکھیے مسلم : ۲۸۰۷ ]"
    },
    {
      "ayah": 114,
      "tafsir": "(آیت 114) { قٰلَ اِنْ لَّبِثْتُمْ اِلَّا قَلِيْلًا … :} اللہ تعالیٰ ان کی بات کی تصدیق کرتے ہوئے فرمائیں گے کہ واقعی تم دنیا میں بہت تھوڑا ٹھہرے ہو، کیونکہ دنیا اور اس کا سازو سامان فانی ہونے کی وجہ سے ہے ہی بہت تھوڑا، جیسا کہ فرمایا : « قُلْ مَتَاعُ الدُّنْيَا قَلِيْلٌ وَ الْاٰخِرَةُ خَيْرٌ لِّمَنِ اتَّقٰى » [ النساء : ۷۷ ] ’’کہہ دے دنیا کا سامان بہت تھوڑا ہے اور آخرت اس کے لیے بہتر ہے جو متقی ہے۔‘‘ مگر اب اس اعتراف کا کچھ فائدہ نہیں، کاش! تم اس وقت یہ جانتے ہوتے تو اس مختصر سے وقت میں اپنے مالک کی فرماں برداری کر کے ہمیشہ کی جنتوں کے وارث بن جاتے۔"
    },
    {
      "ayah": 115,
      "tafsir": "(آیت 115) { اَفَحَسِبْتُمْ اَنَّمَا خَلَقْنٰكُمْ عَبَثًا … :} یعنی پھر کیا تم نے سمجھ رکھا تھا کہ ہم اس دنیا میں عیش کرنے اور مزے لوٹنے ہی کے لیے پیدا ہوئے ہیں اور ہمیں کوئی پوچھنے والا نہیں۔ (دیکھیے قیامہ : ۳۶) تم نے دیکھا کہ اس دنیا میں نہ ظالموں کو ان کے ظلم کا پورا بدلا ملتا ہے، نہ اپنے خیال میں نیک اعمال کرنے والوں کو ان کی نیکی کا بدلا ملتا ہے اور نہ کوئی انسان دوبارہ زندہ ہو کر آیا جو تمھیں بتاتا کہ اچھے اعمال والوں کو ان کی جزا اور ظالموں کو ان کے ظلم کی سزا ملی ہے۔ لہٰذا تم نے یقین کر لیا کہ یہی دنیا ہی دنیا ہے، جس قدر ہو سکے یہاں عیش و عشرت کا سامان جمع کر لو۔ اس کے سوا زندگی کا کوئی مقصد نہیں، نہ ہمیں مرنے کے بعد دوبارہ زندہ ہونا ہے، نہ کسی کے سامنے پیش ہونا ہے، حالانکہ اگر تم اس کائنات کے نظامِ عدل میں ذرا بھی غور کرتے، یا رسول کی بات پر یقین کرتے تو تمھیں معلوم ہو جاتا کہ اس کائنات اور اس میں انسان کو محض کھیل تماشے کے طور پر اور بے مقصد نہیں بنایا گیا، بلکہ ہر کام کا ایک نتیجہ ہے، پھر یہ کیسے ہو سکتا ہے کہ تمھارے اچھے اور برے اعمال کا کوئی نتیجہ نہ نکلے اور چونکہ دنیا کی زندگی اعمال کا نتیجہ بھگتنے کے لیے بہت تھوڑی ہے، اس لیے مرنے کے بعد ہم نے ہمیشہ کی زندگی رکھی ہے، تاکہ عدل و انصاف کے تقاضے پورے کیے جا سکیں۔"
    },
    {
      "ayah": 116,
      "tafsir": "(آیت 116) ➊ { فَتَعٰلَى اللّٰهُ …: ’’ تَعَالٰي‘‘ ’’عَلَا يَعْلُوْ‘‘} (ن) سے باب تفاعل ہے، جس میں مبالغہ ہوتا ہے، اس لیے ترجمہ کیا گیا ہے ’’پس بہت بلند ہے اللہ‘‘ یعنی اللہ کی شان اس سے بہت بلند ہے کہ وہ تمھیں بے کار اور بے مقصد پیدا کرے۔ پھر اللہ تعالیٰ کی تین صفات بیان فرمائیں، جن میں سے ہر صفت کا تقاضا ہے کہ وہ کوئی کام عبث اور بے مقصد نہ کرے۔ ¤ ➋ { الْمَلِكُ الْحَقُّ :} پہلی صفت یہ ہے کہ وہ سچا بادشاہ ہے، اس کی بادشاہی حق اور ہمیشہ قائم رہنے والی ہے۔ دوسرے بادشاہ نہ اپنی بادشاہی کے حقیقی مالک ہیں اور نہ ان کی بادشاہی حق اور باقی رہنے والی ہے۔ اللہ تعالیٰ ہی جسے چاہتا ہے حکومت عطا کرتا ہے اور جس سے چاہتا ہے چھین لیتا ہے، جیسا کہ فرمایا : « قُلِ اللّٰهُمَّ مٰلِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَآءُ وَ تَنْزِعُ الْمُلْكَ مِمَّنْ تَشَآءُ» [ آل عمران : ۲۶ ] ’’کہہ دے اے اللہ! بادشاہی کے مالک! تو جسے چاہے بادشاہی دیتا ہے اور جس سے چاہے بادشاہی چھین لیتا ہے۔‘‘ جب کوئی عقل مند آدمی بے مقصد کام نہیں کرتا تو سچا بادشاہ جو ساری کائنات کا اور بادشاہوں کا بادشاہ ہے، اس کے متعلق تم نے کیسے گمان کر لیا کہ اس نے تمھیں عبث اور بے مقصد پیدا کر دیا ہے؟ ¤ ➌ { لَاۤ اِلٰهَ اِلَّا هُوَ:} یہ دوسری صفت ہے، جس میں پیدا کرنے کی حکمت کی طرف بھی اشارہ ہے۔ یعنی صرف یہی نہیں کہ وہ بادشاہی میں یکتا ہے، بلکہ اس کے سوا کوئی معبود ہے ہی نہیں، عبادت صرف اسی کا حق ہے، کس قدر نادان ہو کہ اس وحدہ لا شریک لہ معبود نے تمھیں اپنی توحید اور عبادت کے لیے پیدا فرمایا اور تم نے گمان کر لیا کہ ہمیں پیدا کرنے کا کوئی مقصد ہی نہیں۔ ¤ ➍ { رَبُّ الْعَرْشِ الْكَرِيْمِ :} عرش کا معنی تخت ہے۔ کسی چیز کے کریم ہونے کا مطلب یہ ہے کہ اس میں اس کی جنس کی اشیاء کی تمام خوبیاں اور کمالات موجود ہوں اور وہ ان سب سے بلند اور باشرف ہو، جیسے فرمایا : « اِنِّيْۤ اُلْقِيَ اِلَيَّ كِتٰبٌ كَرِيْمٌ » [ النمل : ۲۹ ] ’’بے شک میری طرف ایک عزت والا خط پھینکا گیا ہے۔‘‘ اور فرمایا : «وَ زُرُوْعٍ وَّ مَقَامٍ كَرِيْمٍ » [ الدخان : ۲۶ ] ’’اور کھیتیاں اور عمدہ مقام۔‘‘ اور فرمایا : «كَمْ اَنْۢبَتْنَا فِيْهَا مِنْ كُلِّ زَوْجٍ كَرِيْمٍ » [ الشعراء : ۷ ] ’’ہم نے اس میں کتنی چیزیں ہرعمدہ قسم میں سے اگائی ہیں۔‘‘ اور فرمایا : « وَ قُلْ لَّهُمَا قَوْلًا كَرِيْمًا » [ بني إسرائیل : ۲۳ ] ’’اور ان سے بہت کرم والی بات کہہ۔‘‘ (ابن عاشور و راغب) اس آیت میں یہ اللہ تعالیٰ کی تیسری صفت ہے کہ وہ کائنات کی سب سے بڑی مخلوق عرشِ الٰہی کا مالک ہے، جو زمین و آسمان اور اس میں موجود ساری مخلوق کو محیط ہے اور سب سے بلند ہے، تو وہ باقی مخلوقات کا مالک کیوں نہ ہو گا۔ ¤ ➎ عرش الٰہی کو کریم (عزت و شرف والا) اس لیے فرمایا کہ کسی جگہ کی عزت اس کے رہنے والے کی وجہ سے ہوتی ہے، جیسے کہتے ہیں {’’فُلَانٌ مِنْ بَيْتٍ كَرِيْمٍ‘‘} کہ فلاں شخص باعزت گھر کا فرد ہے۔ کیونکہ اس گھر کے رہنے والے معزز ہوتے ہیں۔ عرش کی سب سے بڑی عزت اور اس کا سب سے بڑا شرف یہ ہے کہ اس پر رب کریم مستوی ہے اور اس عرش ہی سے تمام احکامات اور ساری رحمتوں اور برکتوں کا نزول ہوتا ہے۔ ¤ ➏ پورے قرآن مجید میں {’’ رَبُّ الْعَرْشِ الْكَرِيْمِ ‘‘} اسی مقام پر آیا ہے۔ {’’ رَبُّ الْعَرْشِ الْعَظِيْمِ‘‘} دو جگہ آیا ہے، سورۂ توبہ (۱۲۹) اور نمل (۲۶) میں۔ یہاں عرش کی صفت کریم اس لیے آئی ہے کہ یہاں اللہ تعالیٰ کے عیب سے منزہ ہونے اور دنیا اور آخرت میں اس کی صفت عدل کا بیان مقصود ہے، جب کہ سورۂ توبہ اور نمل میں اس کی صفت قہر و جبروت کا بیان مقصود ہے۔ (بقاعی)"
    },
    {
      "ayah": 117,
      "tafsir": "(آیت 117) ➊ { وَ مَنْ يَّدْعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ … :} ’’جو شخص اللہ کے ساتھ کسی دوسرے معبود کو پکارے‘‘ کے بعد ’’جس کی کوئی دلیل اس کے پاس نہیں‘‘ کا یہ مطلب نہیں کہ کسی دوسرے ایسے معبود کو پکارنا جائز ہے جس کی کوئی دلیل کسی کے پاس موجود ہو۔ بلکہ یہ جملہ معترضہ ہے، جس کا مقصد اس حقیقت کی طرف توجہ دلانا ہے کہ اللہ کے سوا کسی دوسرے کو پکارنے کی کوئی دلیل ہے ہی نہیں، نہ عقلی، نہ نقلی۔ (دیکھیے احقاف : ۴) یہ ایسے ہی ہے جیسے کہا جائے کہ جو شخص کسی پر ظلم کرے، جس کا اسے کوئی حق نہیں تو وہ اس کا بدلا پائے گا۔ اس کا مطلب یہ نہیں کہ کوئی ایسا ظلم بھی ہوتا ہے جس کا کسی کو حق حاصل ہے، بلکہ مقصد ظلم کی برائی بیان کرنا ہے کہ ظلم کا حق کسی کو بھی نہیں۔ ¤ ➋ رازی نے اس آیت کے تحت لکھا ہے کہ اس سے معلوم ہوا کہ غور و فکر کے بعد دلیل پر عمل کرنا حق ہے اور تقلید (بلا دلیل کسی بات کو لے لینا) باطل ہے۔ ¤ ➌ {فَاِنَّمَا حِسَابُهٗ عِنْدَ رَبِّهٖ :} یعنی اس کا یہ جرم اتنا بڑا ہے کہ اس کی سزا کا کوئی شخص حساب نہیں کر سکتا، نہ اندازہ کر سکتا ہے۔ اس کا حساب صرف اس کے رب کے پاس ہے اور وہی اس کی سزا جانتا ہے۔ لوگوں کو اس نے صرف اتنا بتایا ہے کہ میں یہ جرم کسی صورت بھی معاف نہیں کروں گا، اس کے سوا جو بھی گناہ ہے، جسے چاہوں گا بخش دوں گا۔ (دیکھیے نساء : ۴۸، ۱۱۶) اور اس میں رسول اللہ صلی اللہ علیہ وسلم کو بھی تسلی ہے کہ آپ کا کام پیغام پہنچانا ہے، حساب لینا ہمارا کام ہے، جیسا کہ فرمایا : « فَاِنَّمَا عَلَيْكَ الْبَلٰغُ وَ عَلَيْنَا الْحِسَابُ» [ الرعد : ۴۰ ] ’’تو تیرے ذمے صرف پہنچا دینا ہے اور ہمارے ذمے حساب لینا ہے۔‘‘ ¤ ➍ { اِنَّهٗ لَا يُفْلِحُ الْكٰفِرُوْنَ : ’’إِنَّ‘‘} کے بعد ضمیر{ ’’هٗ‘‘} پیچھے کسی لفظ کی طرف نہیں لوٹتی، اسے ضمیر شان کہتے ہیں۔ یہ کسی بات کو اچھی طرح ذہن نشین کرانے کے لیے ہوتی ہے۔ اس لیے ترجمہ کیا گیا ہے ’’بے شک حقیقت یہ ہے کہ۔‘‘ ’’کافر فلاح نہیں پائیں گے‘‘ کا مطلب یہ ہے کہ اللہ کے سوا کسی دوسرے کو پکارنے والے کافر ہیں اور کافر فلاح نہیں پائیں گے۔ ¤ ➎ سورت کی ابتدا ان لوگوں کے ذکر سے ہوئی تھی جو فلاح پانے والے ہیں اور اختتام ان لوگوں کے ذکر سے ہو رہا ہے جو فلاح نہیں پائیں گے۔"
    },
    {
      "ayah": 118,
      "tafsir": "(آیت 118) ➊ { وَ قُلْ رَّبِّ اغْفِرْ وَ ارْحَمْ …:} اس سے پہلے آیت (۱۰۹) میں اللہ تعالیٰ نے اپنے کامیاب ہونے والے بندوں کی ایک صفت یہ بیان فرمائی کہ وہ یہ دعا {’’ رَبِّنَااٰمَنَّا فَاغْفِرْلَنَا وَارْحَمْنَا وَ اَنْتَ خَيْرُ الرّٰحِمِيْنَ ‘‘} کرتے ہیں اور سورت کے آخر میں انھی بندوں کی طرح کفار و مشرکین سے کٹ کر اپنے رب کی مغفرت اور رحمت کے دامن میں پناہ لینے کا حکم دیا۔ وہ تمام دعائیں جن کا اللہ تعالیٰ نے قرآن مجید میں لفظ {’’ قُلْ ‘‘} کے ساتھ حکم دیا ہے، نہایت جامع دعائیں ہیں اور عجیب و غریب اسرار رکھتی ہیں۔ جب رسول اللہ صلی اللہ علیہ وسلم کو یہ دعا کرنے کا حکم ہے، جن کے پہلے پچھلے تمام گناہ اللہ نے معاف فرما دیے (دیکھیے فتح : ۲) تو امت کو تو بدرجۂ اولیٰ یہ دعا کرنے کا حکم ہے۔ ¤ ➋ ابن کثیر نے فرمایا : {’’اَلْغَفْرُ‘‘} کا لفظ جب مطلق آئے تو اس کا معنی گناہ کو مٹانا اور لوگوں کے سامنے اس پر پردہ ڈالنا ہوتا ہے اور ’’رحمت ‘‘ کا معنی یہ ہے کہ اللہ تعالیٰ تمام اقوال و افعال میں سیدھا رکھے اور اپنی توفیق خاص سے نوازے۔ ¤ ➌ {وَ اَنْتَ خَيْرُ الرّٰحِمِيْنَ:} یہ مختصر جملہ ہے، مکمل جملہ یوں ہے : {’’رَبِّ اغْفِرْ وَ ارْحَمْ فَأَنْتَ خَيْرُ الْغَافِرِيْنَ وَ أَنْتَ خَيْرُ الرَّاحِمِيْنَ ‘‘} اس کی وضاحت کے لیے دیکھیے آیت (۱۰۹) کی تفسیر۔ اللہ تعالیٰ سب رحم کرنے والوں سے بہتر اس لیے ہے کہ دوسرے سب رحم کرنے والے اسی کا عطا کردہ رحم کرتے ہیں اور وہ بھی اس کی رحمت کے سویں حصے میں سے اپنے حصے میں آنے والے رحم سے۔ ¤ ➍ ابوبکر صدیق رضی اللہ عنہ سے روایت ہے کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا : ’’مجھے ایسی دعا سکھائیں جو میں اپنی نماز میں کروں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا، یوں کہو : [ اَللّٰهُمَّ إِنِّيْ ظَلَمْتُ نَفْسِيْ ظُلْمًا كَثِيْرًا وَّلَا يَغْفِرُ الذُّنُوْبَ إِلَّا أَنْتَ فَاغْفِرْلِيْيْ مَغْفِرَةً مِّنْ عِنْدِكَ وَارْحَمْنِيْ إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيْمُ ] [ بخاري، الأذان، باب الدعاء قبل السلام : ۸۳۴ ] ’’اے اللہ! یقینا میں نے اپنی جان پر ظلم کیا، بہت زیادہ ظلم اور تیرے سوا کوئی گناہوں کو نہیں بخشتا، سو مجھے بخش دے، عظیم بخشش اپنے پاس سے اور مجھ پر رحم کر، کیونکہ تو ہی غفور و رحیم ہے۔‘‘"
    }
  ]
}