{
  "surah": "An-Noor",
  "surah_number": 24,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { سُوْرَةٌ اَنْزَلْنٰهَا:’’ سُوْرَةٌ‘‘} پر تنوین تعظیم کے لیے ہے اور یہ مبتدا محذوف {’’هٰذِهِ‘‘} کی خبر ہے، اس لیے ترجمہ کیا گیا ہے ’’(یہ) ایک عظیم سورت ہے۔‘‘ ¤ ➋ {’’ اَنْزَلْنٰهَا ‘‘} (ہم نے اسے نازل کیا) یہاں اللہ تعالیٰ نے اپنی عظمت کے اظہار کے لیے اپنا ذکر جمع متکلم کے صیغے (ہم نے ) کے ساتھ فرمایا ہے، بلکہ{’’ اَنْزَلْنٰهَا ‘‘ ’’ فَرَضْنٰهَا ‘‘} اور {’’ اَنْزَلْنَا فِيْهَاۤ ‘‘} تینوں میں زور جمع متکلم کے صیغہ ’’ہم نے‘‘ پر ہے، یعنی اس کا نازل کرنے والا کوئی اور نہیں بلکہ ’’ہم‘‘ ہیں۔ اس لیے اسے کسی بے اختیار واعظ کی بات سمجھ کر ہلکا نہ سمجھ بیٹھنا، بلکہ خوب جان لو کہ اس کا نازل کرنے والا وہ ہے جس کی مٹھی میں ساری کائنات ہے، جو ہر جان دار کی پیشانی پکڑے ہوئے ہے اور تم مر کر بھی اس کی گرفت سے نہیں نکل سکتے۔ ¤ ➌ { ’’ اَنْزَلْنَا ‘‘} (نازل کرنے) سے ظاہر ہے کہ اسے اتارنے والا بلندی پر ہے اور اس نے اسے بلند مقام عرش سے اتارا ہے، جیسا کہ خود اس نے فرمایا : «اَلرَّحْمٰنُ عَلَى الْعَرْشِ اسْتَوٰى » [ طٰہٰ : ۵ ] ’’وہ بے حد رحم والا عرش پر بلند ہوا۔‘‘ ان مفسروں پر افسوس ہوتا ہے جو یہ ماننے کے لیے تیار نہیں کہ اللہ تعالیٰ بلندی پر ہے، اس لیے وہ ’’ہم نے نازل کیا‘‘ کی بھی تاویل بلکہ تحریف پر اصرار کرتے ہیں۔ ان کا کہنا ہے کہ اللہ تعالیٰ کسی جہت میں نہیں، نہ کسی جگہ میں ہے، وہ نہ اوپر ہے نہ نیچے، نہ دائیں ہے نہ بائیں، نہ آگے ہے اور نہ پیچھے۔ پھر وہ کہاں ہے؟ کہتے ہیں کسی جگہ بھی نہیں۔ مگر وہ اس فطری تقاضے کا کیا کریں گے جو ہر انسان کو مجبور کرتا ہے کہ وہ اللہ تعالیٰ سے دعا کرتے ہوئے اپنے ہاتھ اور اپنی نگاہ آسمان کی طرف اٹھائے۔ ان حضرات میں سے کئی ایسے دیدہ دلیر بزرگ بھی گزرے ہیں اور کئی موجود ہیں جو یہ کہتے ہیں کہ یہ سوال ہی غلط ہے کہ اللہ تعالیٰ کہاں ہے؟ بلکہ جو شخص یہ سوال کرے کہ اللہ تعالیٰ کہاں ہے وہ کافر ہے۔ ان لوگوں کو یہ خوف بھی نہیں آتا کہ ان کے فتوے کی زد میں کون کون آ رہا ہے۔ خود رسول کریم صلی اللہ علیہ وسلم نے ایک لونڈی کے ایمان کا امتحان لیتے ہوئے دو سوال کیے تھے، ایک یہ کہ اللہ کہاں ہے؟ اس نے کہا : ’’آسمان میں۔‘‘ دوسرا سوال یہ کیا کہ میں کون ہوں؟ اس نے کہا : ’’آپ اللہ کے رسول ہیں۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ مومنہ ہے۔‘‘ [ مسلم، المساجد، باب تحریم الکلام في الصلاۃ… : ۵۳۷ ] ¤ ➍ { وَ فَرَضْنٰهَا :} یعنی اس سورت میں جو احکام دیے گئے ہیں وہ محض سفارشات نہیں ہیں کہ جی چاہے تو مانو، ورنہ جو جی میں آئے کرتے رہو، بلکہ یہ قطعی احکام ہیں جن پر عمل کرنا ہم نے تم پر اور تمھارے بعد آنے والوں پر فرض کر دیا ہے۔ ابن کثیر رحمہ اللہ نے فرمایا : {’’ اَنْزَلْنٰهَا وَ فَرَضْنٰهَا ‘‘} سے اس سورت کی عظمت اور اہمیت بیان کرنا مقصود ہے، یہ مقصد نہیں کہ دوسری سورتوں کی یہ شان نہیں ہے۔ ¤ ➎ { وَ اَنْزَلْنَا فِيْهَاۤ اٰيٰتٍۭ بَيِّنٰتٍ:} یعنی اس سورت میں ہم نے جو احکام و مسائل بیان کیے ہیں ان میں کوئی پیچیدگی یا ابہام نہیں ہے، صاف اور واضح ہدایات ہیں، جن کے متعلق تم یہ عذر نہیں کر سکتے کہ فلاں بات ہماری سمجھ میں نہیں آئی، تو ہم اس پر عمل کیسے کرتے؟ اس پرُ زور تمہید سے اس سورت میں مذکور احکام کی اہمیت واضح ہو رہی ہے۔ اس کے بعد احکام شروع ہوتے ہیں۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ {اَلزَّانِيَةُ وَ الزَّانِيْ فَاجْلِدُوْا … : } سورۂ نساء کی آیات (۱۵، ۱۶) میں اللہ تعالیٰ نے زنا کرنے والی عورتوں کے متعلق چار مردوں کی گواہی کے بعد انھیں گھروں میں بند رکھنے کا حکم دیا، یہاں تک کہ انھیں موت اٹھا لے جائے، یا اللہ تعالیٰ ان کے لیے کوئی سبیل پیدا فرما دے۔ اسی طرح زنا کا ارتکاب کرنے والے مرد اور عورت کو توبہ کرنے تک ایذا و تکلیف دینے کا حکم دیا اور یہاں سورۂ نور کی زیر تفسیر آیت میں اللہ تعالیٰ نے کنوارے مرد اور کنواری عورت کی سزا بیان فرمائی۔ جیسا کہ عبادہ ابن صامت رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا :  [ خُذُوْا عَنِّيْ، خُذُوْا عَنِّيْ، قَدْ جَعَلَ اللّٰهُ لَهُنَّ سَبِيْلاً، الْبِكْرُ بِالْبِكْرِ جَلْدُ مِائَةٍ وَ نَفْيُ سَنَةٍ وَالثَّيِّبُ بِالثثَّيِّبِ جَلْدُ مِائَةٍ وَالرَّجْمُ ]  [ مسلم، الحدود، باب حد الزنٰی : ۱۶۹۰ ] ’’مجھ سے (دین کے احکام) لے لو، مجھ سے (دین کے احکام) لے لو، اللہ تعالیٰ نے ان عورتوں کے لیے سبیل پیدا فرما دی ہے۔ کنوارا، کنواری کے ساتھ (زنا کرے) تو ان کے لیے سو کوڑے اور ایک سال کی جلاوطنی ہے اور شادی شدہ، شادی شدہ کے ساتھ (زنا کرے) تو ان کے لیے سو کوڑے اور سنگسار ہے۔‘‘ اس آیت سے بالاتفاق سورۂ نساء کی آیت کا حکم منسوخ ہو گیا۔ ¤ \n ➋ { اَلزَّانِيَةُ وَ الزَّانِيْ:}  یہ مبتدا ہے، اس کی خبر {’’ فَاجْلِدُوْا ‘‘}  ہے۔ اس پر ’’فاء‘‘ اس لیے آئی ہے کہ مبتدا میں شرط کا معنی پایا جاتا ہے، کیونکہ الف لام، {’’ أَلَّذِيْ ‘‘}  کے معنی میں ہے، یعنی جو زنا کرنے والی عورت اور جو زنا کرنے والا مرد ہے۔ اس آیت میں مسلم حکام کو حکم ہے کہ جو عورت یا جو مرد بھی زنا کا ارتکاب کرے، خواہ وہ کسی دین یا ملت سے تعلق رکھتا ہو، اگر ان کا مقدمہ تمھارے پاس لایا جائے، جب وہ شادی شدہ نہ ہوں تو دونوں میں سے ہر ایک کو سو کوڑے مارو۔ شادی شدہ زانیہ اور زانی کے لیے رجم کا حکم ہے، جیسا کہ گزشتہ فائدہ میں مذکور حدیث میں آیا ہے، مزید تفصیل آگے آئے گی۔ ¤ \n ➌ غیر مسلم ذمی اگر زنا کا ارتکاب کریں اور مسلم حکام کے پاس مقدمہ لایا جائے تو ان کا فیصلہ بھی کتاب و سنت کے مطابق کیا جائے گا، جیسا کہ سورۂ مائدہ (۴۸، ۴۹) میں مذکور ہے۔ عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ یہودی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور انھوں نے آپ سے ذکر کیا کہ ان کے ایک مرد اور ایک عورت نے زنا کیا ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا :  [ مَا تَجِدُوْنَ فِي التَّوْرَاةِ فِيْ شَأْنِ الرَّجْمِ ؟ ]  ’’تم تورات میں رجم کے متعلق کیا پاتے ہو؟‘‘ انھوں نے کہا : ’’ہم انھیں ذلیل کرتے ہیں اور انھیں کوڑے مارے جاتے ہیں۔‘‘ عبد اللہ بن سلام رضی اللہ عنہ نے کہا : ’’تم نے جھوٹ کہا، تورات میں رجم یقینا موجود ہے۔‘‘ چنانچہ وہ تورات لائے اور اسے کھولا، تو ان میں سے ایک شخص نے رجم کی آیت پر ہاتھ رکھ دیا اور جو اس سے پہلے اور اس کے بعد تھا اسے پڑھ دیا۔ عبد اللہ بن سلام رضی اللہ عنہ نے اس سے کہا : ’’ہاتھ اٹھا۔‘‘ اس نے ہاتھ اٹھایا تو اس میں رجم کی آیت موجود تھی، توکہنے لگے : ’’اے محمد! اس نے سچ کہا ہے، اس میں رجم کی آیت موجود ہے۔‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں کے متعلق حکم دیا اور دونوں کو سنگسار کر دیا گیا۔ [ بخاري، الحدود، باب أحکام أہل الذمۃ و إحصانہم إذا زنوا و رفعوا إلی الإمام : ۶۸۴۱ ] ¤ \nامام بخاری رحمہ اللہ کے باب کے عنوان قائم کرنے سے بھی یہی بات ثابت ہوتی ہے کہ اہل ذمہ اگر مقدمہ مسلمانوں کے پاس لائیں تو ان کے لیے بھی زنا کی سزا وہی ہے جو مسلمانوں کے لیے ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے یہودیوں پر بھی رجم کا حکم نافذ فرمایا۔ تفصیل کے لیے فتح الباری ملاحظہ فرمائیں۔ جن روایات میں اس حد کے نفاذ کے لیے اسلام کی شرط آئی ہے، ان میں سے کوئی بھی رسول اللہ صلی اللہ علیہ وسلم سے صحیح سند سے ثابت نہیں۔ حقیقت یہ ہے کہ مسلم معاشرے میں ذمی غیر مسلموں کو بے شک اپنے دین پر عمل کرنے کی آزادی ہے، مگر انھیں بے حیائی اور بدکاری پھیلانے کی اجازت نہیں دی جا سکتی۔ ¤ \n ➍ { ’’ اَلزَّانِيَةُ ‘‘}  کو {’’ الزَّانِيْ ‘‘}  سے پہلے لانے میں حکمت یہ معلوم ہوتی ہے کہ عموماً زنا کی ترغیب عورتوں کی طرف سے ہوتی ہے، اگر ان کی طرف سے کوئی اشارہ یا مسکراہٹ یا بے حجابی یا کلام میں دلکشی نہ ہو تو مرد کو اقدام کی جرأت کم ہی ہوتی ہے۔ اسامہ ابن زید رضی اللہ عنھما فرماتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا :  [ مَا تَرَكْتُ بَعْدِيْ فِتْنَةً أَضَرَّ عَلَی الرِّجَالِ مِنَ النِّسَاءِ]  [ بخاري، النکاح، باب ما یتقي من شؤم المرأۃ : ۵۰۹۶ ] ’’میں نے اپنے بعد مردوں کے لیے عورتوں سے زیادہ نقصان پہنچانے والا کوئی فتنہ نہیں چھوڑا۔‘‘ اس کے علاوہ زنا کی قباحت اور اس کی عار عورتوں کے لیے زیادہ ہوتی ہے، کیونکہ بکارت اور حمل کے مسائل کا سامنا انھی کو ہوتا ہے۔ {’’ فَاجْلِدُوْا كُلَّ وَاحِدٍ مِّنْهُمَا ‘‘}  اس لیے فرمایا کہ زنا کی ترغیب عورت کی طرف سے ہو یا مرد کی طرف سے، سزا دونوں کو ایک جیسی ملے گی۔ ¤ \n ➎ { فَاجْلِدُوْا : ’’ جِلْدٌ ‘‘}  کا معنی چمڑا ہے۔ اس لفظ سے فقہاء نے دو مسائل اخذ کیے ہیں، ایک یہ کہ مارنے کے لیے کوڑا چمڑے کا ہونا چاہیے، جو درمیانہ ہو، نہ بہت سخت نہ بالکل نرم۔ دوسرا یہ کہ ضرب یعنی مار کا اثر جلد تک رہنا چاہیے، ایسی ضرب نہ ہو جس سے گوشت پھٹ جائے، اور یہ کوڑے چہرے اور نازک حصوں کو چھوڑ کر جسم کے الگ الگ حصوں پر مارے جائیں نہ کہ ایک ہی جگہ، اور پوری طاقت سے ہاتھ بلند کرکے نہیں بلکہ ہاتھ کندھے سے بلند کیے بغیر درمیانی ضرب لگائی جائے۔ زمخشری نے فرمایا : {’’ اَلْجِلْدُ ‘‘}  کا معنی جلد پر ضرب ہے، چنانچہ{’’جَلَدَهُ ‘‘}  (اس نے اس کی جلد پر مارا) ایسے ہی ہے جیسے {’’ظَهَرَهُ‘‘}  (اس نے اس کی پشت پر مارا)، {’’ بَطَنَهُ ‘‘}  (اس نے اس کے پیٹ پر مارا) اور {’’رَأَسَهُ‘‘}  (اس نے اس کے سر پر مارا)۔ آج کل حکومتیں جلادوں کے ہاتھوں جس قسم کے کوڑے مرواتی ہیں، جن کے لیے جلادوں کو باقاعدہ مشق کروائی جاتی ہے کہ وہ ایک ہی جگہ پڑیں، پھر ملزم کو ٹکٹکی پر باندھ کر اس کے چوتڑوں پر اس طرح کوڑے برسائے جاتے ہیں کہ جلاد دور سے دوڑتا ہوا آ کر پوری قوت سے کوڑا مارتا ہے، ایک ہی جگہ چند کوڑے لگنے کے بعد گوشت کے ٹکڑے اڑنے لگتے ہیں، حتیٰ کہ بعض اوقات ہڈیاں ننگی ہو جاتی ہیں اور وہ ساری عمر کے لیے روگی بن جاتا ہے۔ اسلام میں ایسے کوڑے مارنے کی وحشیانہ سزا کسی بھی جرم میں مقرر نہیں کی گئی، بلکہ اگر زنا کا ارتکاب ایسے کنوارے شخص سے ہو جو سو کوڑے برداشت نہ کر سکتا ہو تو اس کے لیے رعایت بھی موجود ہے۔ سعید بن سعد بن عبادہ رضی اللہ عنھما بیان کرتے ہیں کہ ہمارے محلے میں ایک ناقص اعضا والا کمزور آدمی تھا، اسے دیکھا گیا کہ محلے کی ایک لونڈی سے بدکاری کر رہا تھا۔ سعد بن عبادہ رضی اللہ عنہ نے اس کا معاملہ رسول اللہ صلی اللہ علیہ وسلم کے سامنے پیش کیا تو آپ نے فرمایا : ’’اسے سو کوڑے مارو۔‘‘ لوگوں نے کہا : ’’یا رسول اللہ! وہ اس سے کمزور ہے، اگر ہم نے اسے سو کوڑے مارے تو وہ مر جائے گا۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا :  [فَخُذُوْا لَهُ عِثْكَالًا، فِيْهِ مِائَةُ شِمْرَاخٍ، فَاضْرِبُوْهُ ضَرْبَةً وَاحِدَةً ]  [ ابن ماجہ، الحدود، باب الکبیر والمریض یجب علیہ الحد : ۲۵۷۴ ]’’پھر کھجور کا ایک خوشہ لو، جس میں سو ٹہنیاں ہوں اور وہ اسے ایک ہی بار مار دو۔‘‘  ¤ \n ➏ { وَ لَا تَاْخُذْكُمْ بِهِمَا رَاْفَةٌ …:} کیونکہ بدکاروں پر رحم کرنا سارے اسلامی معاشرے پر ظلم ہے۔ پہلی امتوں پر حدود الٰہی میں نرمی ہی سے تباہی آئی۔حدود اللہ کا احترام اور نفاذ باقی نہ رہے تو قوم اندرونی خلفشار اور جرائم میں مبتلا ہو جاتی ہے اور ان پر وبائیں ٹوٹ پڑتی ہیں۔ ابن عمر رضی اللہ عنھما بیان کرتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے، آپ صلی اللہ علیہ وسلم نے فرمایا :  [ يَا مَعْشَرَ الْمُهَاجِرِيْنَ! خَمْسٌ إِذَا ابْتُلِيْتُمْ بِهِنَّ، وَ أَعُوْذُ بِاللّٰهِ أَننْ تُدْرِكُوْهُنَّ : لَمْ تَظْهَرِ الْفَاحِشَةُ فِيْ قَوْمٍ قَطُّ، حَتّٰی يُعْلِنُوْا بِهَا، إِلَّا فَشَا فِيْهِمُ الطَّاعُوْنُ وَالْأَوْجَاعُ الَّتِيْ لَمْ تَكُنْ مَضَتْ فِيْ أَسْلَافِهِمُ الَّذِيْنَ مَضَوْا، وَلَمْ يَنْقُصُوا الْمِكْيَالَ وَالْمِيْزَانَ، إِلَّا أُخِذُوْا بِالسِّنِيْنَ وَ شِدَّةِ الْمَؤُوْنَةِ وَ جَوْرِ السُّلْطَانِ عَلَيْهِمْ، وَلَمْ يَمْنَعُوْا زَككَاةَ أَمْوَالِهِمْ، إِلَّا مُنِعُوا الْقَطْرَ مِنَ السَّمَاءِ، وَ لَوْ لَا الْبَهَائِمُ لَمْ يُمْطَرُوْا وَلَمْ يَنْقُضُوْا عَهْدَ اللّٰهِ وَ عَهْدَ رَسُوْلِهِ، إِلَّا سَلَّطَ اللّٰهُ عَلَيْهِمْ عَدُوًّا مِنْ غَيْرِههِمْ، فَأَخَذُوْا بَعْضَ مَا فِيْ أَيْدِيْهِمْ وَمَا لَمْ تَحْكُمْ أَئِمَّتُهُمْ بِكِتَابِ اللّٰهِ، وَ يَتَخَيَّرُوْا مِمَّا أَنْززَلَ اللّٰهُ، إِلَّا جَعَلَ اللّٰهُ بَأْسَهُمْ بَيْنَهُمْ ]  [ ابن ماجہ، الفتن، باب العقوبات : ۴۰۱۹۔ مستدرک حاکم : 540/4، ح : ۸۶۲۳، و قال صحیح علی شرط مسلم۔ صحیح الترغیب و الترہیب : ۲۱۸۷ ] ’’اے مہاجرین کی جماعت! پانچ چیزیں ایسی ہیں کہ جب تم ان میں مبتلا ہو گئے (تو ان کی سزا ضرور ملے گی) اور میں اللہ کی پناہ مانگتا ہوں کہ تم انھیں پاؤ، کسی قوم میں جب بھی فحاشی (بے حیائی و بدکاری) عام ہوتی ہے، جو ان میں علانیہ کی جائے تو ان میں طاعون اور ایسی بیماریاں پھیل جاتی ہیں جو ان کے پہلے گزرے ہوئے لوگوں میں نہیں ہوتی تھیں اور جو بھی قوم ماپ اور تول میں کمی کرتی ہے انھیں قحط سالیوں، مشقت کی سختی اور بادشاہ کے ظلم کے ساتھ پکڑ لیا جاتا ہے اور کوئی بھی قوم اپنے مالوں کی زکوٰۃ دینا چھوڑ دیتی ہے تو ان کے لیے آسمان سے بارش روک لی جاتی ہے اور اگر چوپائے نہ ہوں تو بارش سرے ہی سے نہ ہو اور جب کوئی قوم اللہ اوراس کے رسول کا عہد توڑتی ہے تو ان پر دوسری قوموں میں سے دشمن مسلط کر دیے جاتے ہیں جو ان کے قبضے سے کئی چیزیں چھین لیتے ہیں اور جن کے امراء اللہ تعالیٰ کی کتاب کے مطابق فیصلے نہیں کرتے اور جو اللہ نے اتارا ہے اسے اختیار نہیں کرتے تو اللہ تعالیٰ ان کی لڑائی آپس میں ڈال دیتا ہے۔‘‘ \nیہ نتیجہ حدود اللہ کو معطل کرنے کا ہے، جب کہ حدود اللہ قائم کرنے سے بے حساب برکتیں نازل ہوتی ہیں۔ دیکھیے سورۂ مائدہ (۶۶) اور سورۂ اعراف (۹۶)۔ ¤ \n ➐ { وَ لَا تَاْخُذْكُمْ بِهِمَا رَاْفَةٌ فِيْ دِيْنِ اللّٰهِ :}  اس کایہ مطلب نہیں کہ انھیں مارتے وقت تمھارے دل میں ان پر رحم اور شفقت کا کوئی جذبہ پیدا نہ ہو، بلکہ {’’ فِيْ دِيْنِ اللّٰهِ ‘‘}  کے الفاظ بتا رہے ہیں کہ مطلب یہ ہے کہ اللہ تعالیٰ کی حد نافذ کرنے میں تمھاری طرف سے کوئی نرمی یا ترس رکاوٹ نہ بنے۔ رہا مارتے ہوئے، یا یہ منظر دیکھ کر دل میں رحم و شفقت کا کوئی جذبہ پیدا ہونا تو یہ طبعی بات ہے، اس پر آدمی کا کوئی اختیار نہیں اور نہ اس پر کوئی گناہ ہے۔ گناہ یہ ہے کہ ترس کھا کر حد نافذ نہ کی جائے، یا ترس کھا کر حد نہ لگانے کی سفارش کی جائے، یا اس قدر آہستہ کوڑے مارے جائیں کہ حد کا مقصد ہی فوت ہو جائے۔ قرہ مزنی رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی نے کہا : ’’یا رسول اللہ! میں بکری ذبح کرتا ہوں تو میں اس پر رحم کرتا ہوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا :  [ وَالشَّاةُ إِنْ رَحِمْتَهَا رَحِمَكَ اللّٰهُ، مَرَّتَيْنِ ]  [ الأدب المفرد للبخاري : ۳۷۳۔ مسند أحمد : 436/3، ح : ۱۵۵۹۸ ] ’’اور بکری پر اگر تو رحم کرے گا تو اللہ تجھ پر رحم کرے گا۔‘‘ یہ الفاظ آپ نے دو مرتبہ فرمائے۔‘‘ ¤ \n ➑  وہ جرم، جس کی حد اللہ تعالیٰ نے مقرر فرمائی ہے، وہ حاکم کے پاس لے جانے سے پہلے آپس میں معاف کیا جا سکتا ہے، حاکم کے پاس مقدمہ پیش ہونے کے بعد نہ سفارش کی اجازت ہے، نہ حاکم کو حد معاف کرنے کا اختیار ہے۔ عبد اللہ بن عمرو رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا :  [ تَعَافَوُا الْحُدُوْدَ فِيْمَا بَيْنَككُمْ فَمَا بَلَغَنِيْ مِنْ حَدٍّ فَقَدْ وَجَبَ ]  [أبوداوٗد، الحدود، باب یعفی عن الحدود… : ۴۳۷۶۔ نسائي : ۴۸۹۰، قال الألباني صحیح ] ’’حدود کو آپس میں ایک دوسرے کو معاف کر دیا کرو، کیونکہ میرے پاس جو بھی حد آئے گی واجب ہو جائے گی۔‘‘ ¤ \nعائشہ رضی اللہ عنھا سے روایت ہے کہ قریش کو مخزومی عورت کے معاملے نے فکر میں ڈال دیا، جس نے چوری کی تھی، کہنے لگے : ’’رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق کون بات کرے؟ اور رسول اللہ صلی اللہ علیہ وسلم کے پیارے اسامہ بن زید کے سوا کون یہ جرأت کرے گا۔‘‘ تو اسامہ نے رسول اللہ صلی اللہ علیہ وسلم سے بات کی۔ آپ صلی اللہ علیہ وسلم نے فرمایا :  [ أَتَشْفَعُ فِيْ حَدٍّ مِنْ حُدُوْدِ اللّٰهِ؟ ثُمَّ قَامَ فَخَطَبَ، فَقَالَ : يَا أَيُّهَا النَّاسُ! إِنَّمَا ضَلَّ  مَنْ كَانَ قَبْلَكُمْ أَنَّهُمْ كَانُوْا إِذَا سَرَقَ الشَّرِيْفُ تَرَكُوْهُ، وَ إِذَا سَرَقَ الضَّعِيْفُ فِيْهِمْ أَقَامُوْا عَلَيْهِ الْحَدَّ، وَايْمُ اللّٰهِ! لَوْ أَنَّ فَاطِمَةَ  بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعَ مُحَمَّدٌ يَدَهَا ]  [ بخاري، الحدود، باب کراھیۃ الشفاعۃ في الحد إذا رفع إلی السلطان : ۶۷۸۸۔ مسلم : ۱۶۸۸ ] ’’کیا تم اللہ کی حدوں میں سے ایک حد کے متعلق سفارش کر رہے ہو؟‘‘ پھر آپ صلی اللہ علیہ وسلم اٹھے اور خطبہ دیا، فرمایا : ’’لوگو! تم سے پہلے لوگ اسی لیے گمراہ ہو گئے کہ جب اونچا آدمی چوری کرتا تو اسے چھوڑ دیتے اور جب کمزور چوری کرتا تو اس پر حد قائم کر دیتے۔ اللہ کی قسم! اگر فاطمہ بنت محمد( صلی اللہ علیہ وسلم ) بھی چوری کرتی تو یقینا محمد اس کا ہاتھ بھی کاٹ دیتا۔‘‘ ¤ \n ➒ { وَ لْيَشْهَدْ عَذَابَهُمَا طَآىِٕفَةٌ مِّنَ الْمُؤْمِنِيْنَ:}  اللہ تعالیٰ کی حدود کے دو مقصد ہیں، ایک یہ کہ مجرم کو اس کے جرم کی سزا ملے، دوسرا یہ کہ وہ اس کے لیے اور لوگوں کے لیے عبرت بنے اور وہ اس جرم سے باز رہیں، جیسا کہ فرمایا :  « وَ السَّارِقُ وَ السَّارِقَةُ فَاقْطَعُوْۤا اَيْدِيَهُمَا جَزَآءًۢ بِمَا كَسَبَا نَكَالًا مِّنَ اللّٰهِ وَ اللّٰهُ عَزِيْزٌ حَكِيْمٌ» [ المائدۃ : ۳۸ ] ’’اور جو چوری کرنے والا ہے اور جو چوری کرنے والی ہے سو دونوں کے ہاتھ کاٹ دو۔ اس کی جزا کے لیے جو ان دونوں نے کمایا، اللہ کی طرف سے عبرت کے لیے اور اللہ سب پر غالب کمال حکمت والا ہے۔‘‘ چور کا کٹا ہوا ہاتھ عبرت کے لیے کافی ہے، یہاں زانی کے لیے حد لگاتے وقت مومنوں کی ایک جماعت موجود ہونے کا حکم دیا، تاکہ باعث عبرت ہو۔ کوڑے مارتے وقت مسلمانوں کی ایک جماعت کی موجودگی بجائے خود ایک سزا ہے، کیونکہ کوڑوں کی تکلیف تو ختم ہو جاتی ہے مگر رسوائی کا احساس جلدی ختم ہونے والا نہیں۔ اس کے علاوہ لوگوں کے سامنے حد لگانے کی صورت میں اس بات کی گنجائش بھی نہیں رہے گی کہ حد معطل کر دی جائے، یا اس میں کمی یا نرمی کی جائے۔ ¤ \n➓ شادی شدہ مرد یا شادی شدہ عورت زنا کرے تو اس کی حد رجم ہے جو قرآن، سنت متواترہ اور اجماع امت سے ثابت ہے۔ یہ حکم قرآن مجید میں موجود آیات کے ساتھ بھی ثابت ہے اور قرآن کی اس آیت سے بھی ثابت ہے جس کی تلاوت منسوخ ہے، لیکن اس کا حکم باقی ہے۔ قرآن مجید میں موجود آیت کے ذکر سے پہلے یہ بات یاد رکھنا ضروری ہے کہ پہلے انبیاء اور ان کی امتوں پر نازل شدہ احکام جو قرآن نے ذکر فرمائے ہیں اور قرآن و سنت میں ان کے منسوخ ہونے کا ذکر نہیں کیا گیا، ان پر عمل ہمارے نبی کریم صلی اللہ علیہ وسلم اور آپ کی پوری امت پر فرض ہے، جیسا کہ اللہ تعالیٰ نے سورۂ انعام میں اٹھارہ (۱۸) پیغمبروں کا نام لیا اور ان کے آباء اور اولاد و اخوان کا ذکر فرمایا، پھر فرمایا : « اُولٰٓىِٕكَ الَّذِيْنَ هَدَى اللّٰهُ فَبِهُدٰىهُمُ اقْتَدِهْ » [الأنعام : ۹۰ ] ’’یہی وہ لوگ ہیں جنھیں اللہ نے ہدایت دی، سو تو ان کی ہدایت کی پیروی کر۔‘‘ رجم کی سزا کا ذکر اللہ تعالیٰ نے سورۂ مائدہ میں تورات کے حوالے سے فرمایا ہے : « وَ كَيْفَ يُحَكِّمُوْنَكَ وَ عِنْدَهُمُ التَّوْرٰىةُ فِيْهَا حُكْمُ اللّٰهِ» [ المائدۃ : ۴۳ ] ’’اور وہ تجھے کیسے منصف بنائیں گے جب کہ ان کے پاس تورات ہے جس میں اللہ کا حکم ہے۔‘‘ یہ حکم رجم تھا جیسا کہ مذکورہ بالا آیت کے فوائد میں گزر چکا۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے اسی کے موافق فیصلہ فرمایا اور فرمایا : [ اَللّٰهُمَّ إِنِّيْ أَوَّلُ مَنْ أَحْيَا أَمْرَكَ إِذْ أَمَاتُوْهُ ] ’’اے اللہ! میں پہلا شخص ہوں جس نے تیرا حکم زندہ کیا، جب انھوں نے اسے مردہ کر دیا تھا۔‘‘ مفصل حدیث اس طرح ہے کہ براء بن عازب رضی اللہ عنہ بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم ایک یہودی کے پاس سے گزرے جس کا منہ کالا کیا ہوا تھا اور اسے کوڑے مارے گئے تھے تو نبی اکرم صلی اللہ علیہ وسلم نے انھیں بلایا اور فرمایا : [ هٰكَذَا تَجِدُوْنَ حَدَّ الزَّانِيْ فِيْ كِتَابِكُمْ؟ قَالُوْا نَعَمْ، فَدَعَا رَجُلًا مِنْ عُلَمَائِهِمْ، فَقَالَ أَنْشُدُكَ بِاللّٰهِ الَّذِيْ أَنْزَلَ التَّوْرَاةَ عَلٰی مُوْسٰی! أَهٰكَذَا تَجِدُوْنَ حَدَّ الزَّانِييْ فِيْ كِتَابِكُمْ؟ قَالَ لَا، وَلَوْ لَا أَنَّكَ نَشَدْتَنِيْ بِهٰذَا لَمْ أُخْبِرْكَ، نَجِدُهُ الرَّجْمَ، وَلٰكِنَّهُ كَثُرَ فِيْ أَشْرَافِنَا، فَكُنَّا إِذَا أَخَذْنَا الشَّرِيْفَ تَرَكْنَاههُ، وَإِذَا أَخَذْنَا الضَّعِيْفَ، أَقَمْنَا عَلَيْهِ الْحَدَّ، قُلْنَا تَعَالَوْا فَلْنَجْتَمِعْ عَلٰی شَيْءٍ نُقِيْمُهُ عَلَی الشَّرِيْفِ وَالْوَضِيْعِ، فَجَعَلْنَا التَّحْمِيْمَ وَالْجَلْدَ مَكَانَ الرَّجْمِ، فَقَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ اَللّٰهُمَّ إِنِّيْ أَوَّلُ مَنْ أَحْيَا أَمْرَكَ إِذْ أَمَاتُوْهُ فَأَمَرَ بِهِ فَرُجِمَ]  [مسلم، الحدود، باب رجم الیہود أہل الذمۃ في الزنٰی : ۱۷۰۰ ] ’’کیا تم اپنی کتاب میں زانی کی حد ایسے ہی پاتے ہو؟‘‘ انھوں نے کہا : ’’ہاں!‘‘ تو آپ صلی اللہ علیہ وسلم نے ان کے علماء میں سے ایک آدمی کو بلایا اور فرمایا : ’’میں تمھیں اس اللہ کی قسم دیتا ہوں جس نے موسیٰ  پر تورات نازل فرمائی، کیا تم اپنی کتاب میں زنا کی حد ایسے ہی پاتے ہو؟‘‘ اس نے کہا : ’’نہیں! اور اگر آپ مجھے یہ قسم نہ دیتے تو میں آپ کو نہ بتاتا۔ ہم وہ (حد) رجم ہی پاتے ہیں، لیکن یہ کام (زنا) ہمارے بڑے لوگوں میں عام ہو گیا تو ہم جب بڑے کو پکڑتے تو اسے چھوڑ دیتے اور جب کمزور کو پکڑتے تو اس پر حد قائم کر دیتے۔ تو ہم نے کہا، آؤ ہم کسی ایسی سزا پر متفق ہو جائیں جو ہم اونچے لوگوں اور کمزور لوگوں سب پر قائم کریں، تو ہم نے رجم کی جگہ منہ کالا کرنا اور کوڑے مارنا مقرر کر دیا۔‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اے اللہ! میں پہلا شخص ہوں جس نے تیرا حکم زندہ کیا جب انھوں نے اسے مردہ کر دیا تھا۔‘‘ تو آپ صلی اللہ علیہ وسلم نے اس کے متعلق حکم دیا اور اسے رجم کر دیا گیا۔‘‘ اس حدیث کے بعد سورۂ مائدہ کی آیات (۴۱ تا ۵۰) ملاحظہ فرمائیں، رجم اللہ کا حکم ہونا بالکل واضح ہو جائے گا۔ ¤ \nتورات کے اس حکم رجم کو اللہ کا حکم قرار دے کر اس پر عمل ایسے ہی ہے جیسے اللہ تعالیٰ نے اعضا کے قصاص کا ذکر تورات کے حوالے سے فرمایا۔ قرآن میں اعضا کے قصاص کا اس کے سوا کہیں ذکر نہیں، اس کے باوجود رسول اللہ صلی اللہ علیہ وسلم نے اعضا کے قصاص کا حکم دیا اور امت اعضا کے قصاص پر متفق ہے، فرمایا : «وَ كَتَبْنَا عَلَيْهِمْ فِيْهَاۤ اَنَّ النَّفْسَ بِالنَّفْسِ وَ الْعَيْنَ بِالْعَيْنِ وَ الْاَنْفَ بِالْاَنْفِ وَ الْاُذُنَ بِالْاُذُنِ وَ السِّنَّ بِالسِّنِّ وَ الْجُرُوْحَ قِصَاصصٌ فَمَنْ تَصَدَّقَ بِهٖ فَهُوَ كَفَّارَةٌ لَّهٗ وَ مَنْ لَّمْ يَحْكُمْ بِمَاۤ اَنْزَلَ اللّٰهُ فَاُولٰٓىِٕكَ هُمُ الظّٰلِمُوْنَ » [ المائدۃ : ۴۵ ] ’’اور اس میں ہم نے ان پر لکھ دیا کہ جان کے بدلے جان ہے اور آنکھ کے بدلے آنکھ اور ناک کے بدلے ناک اور کان کے بدلے کان اور دانت کے بدلے دانت اور سب زخموں میں برابر بدلا ہے، پھر جو اس (قصاص) کا صدقہ کر دے تو وہ اس کے لیے کفارہ ہے اور جو اس کے مطابق فیصلہ نہ کرے جو اللہ نے نازل کیا ہے تو وہی لوگ ظالم ہیں۔‘‘ مائدہ کی آیت (۴۸) میں قرآن کو پہلی کتابوں پر {’’ مُهَيْمِنًا ‘‘} فرمانے سے ایک مقصد یہ بھی ظاہر ہے کہ شادی شدہ زانی کے رجم اور نفس اور اعضا کے قصاص کا مسئلہ اب قرآن کے زیر حفاظت ہے۔ ¤ \n⓫ قرآن کی وہ آیت جس میں رجم کا صریح حکم تھا اور جس کی تلاوت منسوخ اور حکم باقی ہے، اس کا ذکر امیر المومنین عمر بن خطاب رضی اللہ عنہ نے منبر پر نہایت شدّ و مد سے فرمایا، جب آپ کو فکر ہوئی کہ کچھ لوگ قرآن میں رجم کا صریح لفظ نہیں دیکھیں گے تو اس کا انکار کر دیں گے (جیسا کہ خارجیوں نے اور ہمارے زمانے کے کچھ آزاد خیال لوگوں نے کیا ہے) تو اس کے ساتھ ہی رسول اللہ صلی اللہ علیہ وسلم ، ابوبکر رضی اللہ عنہ اور اپنے عمل کا حوالہ بھی دیا۔ ابن عباس رضی اللہ عنھما سے عمر بن خطاب رضی اللہ عنہ کا خطبہ مروی ہے، جو انھوں نے اپنے آخری حج سے واپس آ کر مدینہ میں دیا۔ اس میں مذکور ہے کہ انھوں نے فرمایا : [ إِنَّ اللّٰهَ بَعَثَ مُحَمَّدًا صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ  بِالْحَقِّ، وَ أَنْزَلَ عَلَيْهِ الْكِتَابَ، فَكَانَ مِمَّا أَنْزَلَ اللّٰهُ آيَةُ الرَّجْمِ فَقَرَأْنَاهَا وَ عَقَلْنَاهَا وَ وَعَيْنَاهَا، رَجَمَ رَسُوْلُ اللّٰهِ ص صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ وَ رَجَمْنَا بَعْدَهُ، فَأَخْشَی إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَّقُوْلَ قَائِلٌ، وَاللّٰهِ! مَا نَجِدُ آيَةَ الرَّجْمِ فِيْ كِتَابِ اللّٰهِ، فَيَضِللُّوْا بِتَرْكِ فَرِيْضَةٍ أَنْزَلَهَا اللّٰهُ، وَالرَّجْمُ فِيْ كِتَابِ اللّٰهِ حَقٌّ عَلٰی مَنْ زَنٰی إِذَا أُحْصِنَ مِنَ الرِّجَالِ وَالنِّسَاءِ، إِذَا قَامَتِ الْبَيِّنَةُ، أَوْ كَانَ الْحَبَلُ، أَوِ الْاِعْتِرَافُ]  [بخاري، الحدود، باب رجم الحبلٰی من الزنا  إذا أحصنت : ۶۸۳۰ ] ’’اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم  کو حق دے کر بھیجا اور آپ پر کتاب نازل فرمائی تو اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم  پر جو کچھ نازل فرمایا اس میں رجم کی آیت بھی تھی، ہم نے اسے پڑھا، سمجھا اور یاد کر لیا۔ رسول اللہ صلی اللہ علیہ وسلم  نے رجم کیا اور آپ صلی اللہ عل علیہ وسلم  کے بعد ہم نے بھی رجم کیا۔ میں ڈرتا ہوں کہ اگر لوگوں پر لمبا زمانہ گزر گیا تو کوئی کہنے والا کہے کہ اللہ کی قسم! ہم اللہ کی کتاب میں رجم کو نہیں پاتے، تو وہ اس فریضہ کو ترک کرنے کی وجہ سے گمراہ ہو جائیں جو اللہ تعالیٰ نے نازل فرمایا ہے۔ رجم اللہ کی کتاب میں حق ہے اس شخص پر جو شادی شدہ ہو، مرد ہو یا عورت، جب دلیل قائم ہو جائے، یا حمل ہو یا اعتراف ہو۔‘‘  ¤ \n ⓬  رسول اللہ صلی اللہ علیہ وسلم  سے کئی احادیث میں رجم کا حکم منقول ہے، جیسا کہ زیر تفسیر آیت کے فائدہ (۱) میں گزرا اور آپ صلی اللہ علیہ وسلم  کا ماعز اسلمی اور غامدیہ کو رجم کرنا تقریباً حدیث کی ہر کتاب میں مذکور ہے، اسی طرح یہود کو رجم کرنا فائدہ (۳) اور فائدہ (۱۰) میں گزرا ہے۔ اس کے علاوہ رسول اللہ صلی اللہ علیہ وسلم  کا رجم کو اللہ کی کتاب کا فیصلہ قرار دے کر اس پر عمل کرنا صحیح بخاری میں مروی ہے، ابوہریرہ اور زید بن خالد رضی اللہ عنھما  نے بیان کیا کہ ہم نبی صلی اللہ علیہ وسلم  کے پاس موجود تھے کہ ایک آدمی کھڑا ہوا اور کہنے لگا :  [ أَنْشُدُكَ اللّٰهَ إِلَّا مَا قَضَيْتَ بَيْنَنَا بِكِتَابِ اللّٰهِ ]  ’’میں آپ کو اللہ کی قسم دیتا ہوں کہ آپ ہر حال میں ہمارے درمیان کتاب اللہ کے ساتھ فیصلہ فرمائیں۔‘‘ تو وہ شخص کھڑا ہو گیا جس سے اس کا جھگڑا تھا اور وہ اس سے زیادہ سمجھ دار تھا۔ اس نے کہا : ’’آپ ہمارے درمیان اللہ کی کتاب کے ساتھ فیصلہ فرمائیں اور مجھے (بات کرنے کی) اجازت دیں۔‘‘ آپ صلی اللہ علیہ وسلم  نے فرمایا : ’’کہو!‘‘ اس نے کہا : ’’میرا بیٹا اس کے ہاں مزدور تھا تو اس نے اس کی بیوی سے زنا کر لیا، میں نے اس کے بدلے سو بکریاں اور ایک خادم دے کر اس کی جان چھڑائی۔ پھر میں نے کچھ اہل علم آدمیوں سے پوچھا تو انھوں نے بتایا کہ میرے بیٹے پر سو کوڑے اور ایک سال کی جلا وطنی ہے اور اس کی بیوی پر رجم ہے۔‘‘ تو نبی صلی اللہ علیہ وسلم  نے فرمایا :  [ وَالَّذِيْ نَفْسِيْ بِيَدِهِ لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللّٰهِ جَلَّ ذِكْرُهُ، الْمِائَةُ شَاةٍ وَالْخَادِمُ رَدٌّ عَلَيْكَ، وَعَلَی ابْنِكَ جَلْدُ مِائَةٍ وَ تَغْرِيْبُ عَامٍ، وَاغْدُ يَا أُنَيْسُ ! عَلَی امْرَأَةِ هٰذَا، فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا، فَغَدَا عَلَيْهَا فَاعْتَرَفَتْ فَرَجَمَهَا ]  [ بخاري، الحدود، باب الاعتراف بالزنا : ۶۸۲۷، ۶۸۲۸ ] ’’اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! میں ضرور تمھارے درمیان اللہ جل ذکرہ کی کتاب کے مطابق فیصلہ کروں گا۔ وہ سو بکریاں اور خادم تمھیں واپس ہوں گے اور تیرے بیٹے پر سو کوڑے اور ایک سال کی جلا وطنی ہے، اور اے انیس ! صبح اس کی بیوی کے پاس جاؤ، اگر وہ اعتراف کر لے، تو اسے رجم کر دو۔‘‘ وہ صبح اس کے پاس گئے، اس نے اعتراف کر لیا تو انھوں نے اسے رجم کر دیا۔‘‘ ¤ \n ⓭  امت مسلمہ میں کچھ لوگوں نے رجم کا انکار کیا۔ بعض نے کوڑوں اور رجم بلکہ تمام حدود ہی کو وحشیانہ سزائیں قرار دے کر ان کا انکار کر دیا۔ ایسے لوگوں کو امت مسلمہ بدترین منافق ہی کے طور پر پہچانتی ہے کہ جب وہ اللہ اور اس کے رسول کے احکام کو وحشیانہ قرار دیتے ہیں تو ظاہر ہے کہ اسلام کا لبادہ انھوں نے مسلمانوں میں شامل رہ کر کفر کی نمائندگی کے لیے اوڑھ رکھا ہے۔ اس لیے ان کے نفاق کا علم عام ہونے کی وجہ سے یہ لوگ اسلام کو کچھ نقصان نہیں پہنچا سکے، بلکہ مسلمان ہمیشہ اس انتظار میں ہیں اور دعائیں کرتے ہیں کہ کب وہ مبارک وقت آئے گا جب عہد نبوی اور خلافت راشدہ کی طرح اللہ کی حدود قائم ہوں گی اور معاشرے میں امن و امان اور عفت و پاک دامنی کا دور دورہ ہو گا۔  ¤ \n ⓮  اللہ کی حدود کو اصل نقصان ان لوگوں نے پہنچایا اور انھی کے ہم نواؤوں کے برسر اقتدار ہونے کی وجہ سے اللہ کی حدود معطل ہوئیں، جنھوں نے اگرچہ حدود اللہ کا انکار نہیں کیا، نہ کنوارے زانی کے لیے کوڑوں کی حد کا اور نہ شادی شدہ زانی کے لیے رجم کی حد کا، مگر انھوں نے ایسے حیلے ایجاد کر لیے جن سے کسی زانی پر (کنوارا ہو یا شادی شدہ) حد نافذ کرنا تقریباً ناممکن ہے اور لطف یہ کہ ان لوگوں کے موجودہ ہم نوا ان فقہی قوانین کو اللہ کا حکم قرار دینے پر اور انھیں بطور اسلام ملک میں نافذ کرنے پر مُصِر ہیں۔ ہم ان میں سے چند شقیں یہاں نقل کرتے ہیں : (1) اجرت پر لائی ہوئی عورت سے زنا کرے تو اس پر حد نہیں۔ (2) دار الحرب اور دار البغی میں زنا کرے تو اس پر حد نہیں۔ (3) جن عورتوں سے نکاح حرام ہے (ماں، بہن، بیٹی، خالہ، پھوپھی، بھانجی اور بھتیجی وغیرہ) ان سے نکاح کرکے زنا کرے تو اس پر حد نہیں، خواہ اسے معلوم ہو کہ یہ حرام ہے۔ (4) جس حکمران کے اوپر کوئی حکمران نہ ہو وہ زنا کرے تو اس پرحد نہیں۔ (5) اگر زانی دعویٰ کر دے کہ وہ اس کی بیوی ہے تو حد ساقط ہو جائے گی، خواہ وہ کسی اور کی بیوی ہو اور وہ کوئی دلیل بھی پیش نہ کرے۔ یہ ہیں ان کے چند حیلے، تو فرمائیے ! وہ کون سا زانی ہو گا جو جھوٹا دعویٰ کرکے حد سے جان نہیں بچائے گا؟"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { اَلزَّانِيْ لَا يَنْكِحُ اِلَّا زَانِيَةً اَوْ مُشْرِكَةً :} یہاں ایک سوال ہے کہ کئی زانی مرد عفیف اور پاک دامن عورتوں سے نکاح کرتے ہیں اور کئی زانیہ عورتوں سے عفیف اور پاک دامن مرد نکاح کر لیتے ہیں، تو اس آیت کا مطلب کیا ہے؟ اس سوال کا جواب بعض مفسرین نے یہ دیا ہے کہ یہاں نکاح سے مراد معروف نکاح نہیں ہے، بلکہ یہ جماع کے معنی میں ہے اور مقصد زنا کی قباحت اور شناعت بیان کرنا ہے۔ مطلب یہ ہے کہ زانی مرد اپنی ناجائز ہوس کسی زانیہ ہی سے پوری کرے گا جو اس جیسی بدکار ہے، یا کسی مشرکہ سے جو زنا کو حرام نہیں سمجھتی، اسی طرح زانیہ عورت کی ناجائز ہوس وہی مرد پوری کرے گا جو اس جیسا بدکار ہے، یا کوئی مشرک جو زنا کو حرام نہیں سمجھتا اور ایسا کرنا یعنی زنا کرنا مومنوں پر حرام کر دیا گیا ہے۔ طبری نے حسن سند کے ساتھ یہ تفسیر ابن عباس رضی اللہ عنھما سے روایت کی ہے اور اسے راجح قرار دیا ہے۔ اس تفسیر کے مطابق آیت سے مراد زنا کی حرمت ہے، نکاح کی حرمت نہیں۔ ¤ بعض مفسرین نے فرمایا کہ آیت کا مطلب یہ ہے کہ فاسق و فاجر آدمی، جس کی عادت زنا اور فسق ہے، اسے صالح عورتوں سے نکاح کی رغبت نہیں ہوتی، اسے اپنے جیسی کسی خبیث، فاسق اور بدکار عورت یا اس جیسی مشرکہ عورت ہی سے نکاح کی رغبت ہوتی ہے، اسی طرح علانیہ بدکار اور فاسق عورت سے نکاح کی رغبت صالح مردوں کو نہیں ہوتی بلکہ اس جیسے بدکار مردوں ہی کو ہوتی ہے۔ ان مفسرین کے مطابق یہ حکم اکثر لوگوں کا بیان ہوا ہے، جیسا کہ کہا جاتا ہے نیکی کوئی پرہیز گار آدمی ہی کرتا ہے، حالانکہ بعض اوقات وہ آدمی بھی نیکی کر لیتا ہے جو پرہیز گار نہیں ہوتا۔ اسی طرح زانی بعض اوقات عفیفہ و مومنہ عورت سے نکاح کر لیتا ہے اور زانیہ عورت سے بعض اوقات عفیف و مومن مرد نکاح کر لیتا ہے۔ مشرک مرد اور مشرکہ عورت کی زانی مرد اور زانیہ عورت کے ساتھ ایک مناسبت یہ ہے کہ جس طرح مشرک مرد اور مشرکہ عورت اپنے مالک کو چھوڑ کر دوسروں کے در پر جھکتے ہیں اسی طرح زانی مرد اپنی بیوی کو چھوڑ کر اور زانیہ عورت اپنے شوہر کو چھوڑ کر غیروں سے منہ کالا کرتے ہیں۔ ¤ ➋ { وَ حُرِّمَ ذٰلِكَ عَلَى الْمُؤْمِنِيْنَ:’’ ذٰلِكَ ‘‘} کا اشارہ بعض نے زنا کی طرف قرار دیا ہے، جیسا کہ اوپر گزرا، مگر زیادہ درست یہی ہے کہ یہ اشارہ عقد نکاح کی طرف ہے۔ یعنی یہ جانتے ہوئے کہ فلاں عورت بدکار اور غیر تائب ہے، اس سے نکاح کرنا مومن مردوں کے لیے حرام ہے، اسی طرح اپنی پاک دامن بیٹی کو کسی بدکار شخص کے نکاح میں دینا جو تائب نہ ہو، مومنوں کے لیے حرام ہے، اللہ تعالیٰ نے فرمایا : «اَلْخَبِيْثٰتُ لِلْخَبِيْثِيْنَ۠ وَ الْخَبِيْثُوْنَ لِلْخَبِيْثٰتِ وَ الطَّيِّبٰبٰتُ لِلطَّيِّبِيْنَ وَ الطَّيِّبُوْنَ لِلطَّيِّبٰتِ » [ النور : ۲۶ ] ’’گندی عورتیں گندے مردوں کے لیے ہیں اور گندے مرد گندی عورتوں کے لیے ہیں اور پاک عورتیں پاک مردوں کے لیے ہیں اور پاک مرد پاک عورتوں کے لیے ہیں۔‘‘ اللہ تعالیٰ نے دوسرے مقام پر بھی مردوں اور عورتوں کے نکاح کے لیے دونوں کے پاک دامن ہونے کی اور بدکار نہ ہونے کی شرط لگائی ہے، چنانچہ فرمایا : « اَلْيَوْمَ اُحِلَّ لَكُمُ الطَّيِّبٰتُ وَ طَعَامُ الَّذِيْنَ اُوْتُوا الْكِتٰبَ حِلٌّ لَّكُمْ وَ طَعَامُكُمْ حِلٌّ لَّهُمْ وَ الْمُحْصَنٰتُ مِنَ  الْمُؤْمِنٰتِ وَ الْمُحْصَنٰتُ مِنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلِكُمْ اِذَاۤ اٰتَيْتُمُوْهُنَّ اُجُوْرَهُنَّ مُحْصِنِيْنَ غَيْرَ مُسٰفِحِيْنَ وَ لَا مُتَّخِذِيْۤ اَخْدَانٍ»» [ المائدۃ : ۵ ] ’’آج تمھارے لیے پاکیزہ چیزیں حلال کر دی گئیں اور ان لوگوں کا کھانا تمھارے لیے حلال ہے جنھیں کتاب دی گئی اور تمھارا کھانا ان کے لیے حلال ہے اور مومن عورتوں میں سے پاک دامن عورتیں اور ان لوگوں کی پاک دامن عورتیں جنھیں تم سے پہلے کتاب دی گئی، جب تم انھیں ان کے مہر دے دو، اس حال میں کہ تم قید نکاح میں لانے والے ہو، بدکاری کرنے والے نہیں اور نہ چھپی آشنائیں بنانے والے۔‘‘ {’’ وَ حُرِّمَ ذٰلِكَ عَلَى الْمُؤْمِنِيْنَ ‘‘} کی شان نزول میں مروی حدیث رسول صلی اللہ علیہ وسلم سے بھی ثابت ہوتا ہے کہ بدکار عورتوں یا بدکار مردوں سے، جو تائب نہ ہوں، نکاح حرام ہے۔ عبد اللہ بن عمرو رضی اللہ عنھما بیان کرتے ہیں کہ ایک آدمی جسے مرثد بن ابی مرثد ( رضی اللہ عنھما ) کہا جاتا تھا، وہ مکہ سے قیدی اٹھا کر مدینہ لایا کرتا تھا اور مکہ میں ایک بدکار عورت تھی، جسے عناق کہا جاتا تھا، وہ اس کی دوست تھی۔ مرثد بن ابی مرثد نے مکہ میں قید ایک آدمی سے وعدہ کیا تھا کہ وہ اسے اٹھا لے جائے گا۔ اس کا بیان ہے کہ میں مکہ میں آیا اور میں چاندنی رات میں مکہ کی ایک دیوار کے سائے میں تھا کہ عناق آئی، اس نے دیوار کے ساتھ میرے سائے کا ہیولا دیکھا۔ جب وہ میرے پاس پہنچی تو اس نے مجھے پہچان لیا۔ کہنے لگی : ’’مرثد ہو؟‘‘ میں نے کہا : ’’مرثد ہوں۔‘‘ کہنے لگی : ’’مرحباً و اھلاً، آؤ ہمارے پاس رات گزارو۔‘‘ میں نے کہا : ’’عناق! اللہ نے زنا حرام کر دیا ہے۔‘‘ اس نے آواز دی، خیموں والو! یہ وہ آدمی ہے جو تمھارے آدمی اٹھا لے جاتا ہے۔ چنانچہ آٹھ آدمی میرے پیچھے لگ گئے اور میں (مکہ کے ایک پہاڑ) خندمہ پر چلنے لگا، حتیٰ کہ اس کی ایک غار تک پہنچ کر اس میں داخل ہو گیا۔ وہ لوگ آئے، حتیٰ کہ میرے سر پر آ کھڑے ہوئے اور انھوں نے پیشاب کیا، تو ان کا پیشاب میرے سر پر گرا، مگر اللہ تعالیٰ نے انھیں مجھ سے اندھا کر دیا۔ پھر وہ واپس چلے گئے، میں بھی دوبارہ اپنے ساتھی کے پاس آیا اور اسے اٹھایا، وہ آدمی بھاری تھا، یہاں تک کہ میں اسے ’’اذخر‘‘ تک لے آیا (یعنی مکہ سے باہر جہاں اذخر گھاس تھی)، اس کی بھاری بیڑی کھولی اور اسے اس طرح لے کر چلا کہ میں اسے اٹھاتا تھا اور وہ مجھے تھکا دیتا تھا، حتیٰ کہ میں مدینہ پہنچ گیا۔ تو میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہا : ’’یا رسول اللہ! میں عناق سے نکاح کر لوں؟‘‘ میں نے دو مرتبہ یہ بات کہی، رسول اللہ صلی اللہ علیہ وسلم خاموش رہے، مجھے کوئی جواب نہیں دیا، یہاں تک کہ یہ آیت نازل ہوئی : « اَلزَّانِيْ لَا يَنْكِحُ اِلَّا زَانِيَةً اَوْ مُشْرِكَةً وَّ الزَّانِيَةُ لَا يَنْكِحُهَاۤ اِلَّا زَانٍ اَوْ مُشْرِكٌ وَ حُرِّمَ ذٰلِككَ عَلَى الْمُؤْمِنِيْنَ » [ النور : ۳ ] تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مرثد! زانی نکاح نہیں کرتا مگر کسی زانیہ یا مشرکہ سے اور جو زانیہ یا مشرکہ ہے اس سے نکاح نہیں کرتا مگر جو زانی ہے یا مشرک ہے، اس لیے تو اس (عناق) سے نکاح مت کر۔‘‘ [ ترمذي، تفسیر القرآن، باب و من سورۃ النور : ۳۱۷۷۔ نسائي : ۳۲۳۰۔ أبوداوٗد : ۲۰۵۱۔ مستدرک حاکم : 166/2، ح : ۲۷۰۱، و قال الألباني حسن الأسناد ] ¤ ابن قیم رحمہ اللہ نے فرمایا : ’’زانیہ عورت سے نکاح کے متعلق اللہ تعالیٰ نے سورۂ نور میں تصریح فرمائی ہے کہ وہ حرام ہے اور فرمایا کہ جو اس سے نکاح کرے وہ زانی ہے یا مشرک، کیونکہ یا تو وہ اللہ تعالیٰ کے حکم کی پابندی قبول کرے گا اور اس کے وجوب کا عقیدہ رکھے گا یا نہیں۔ اگر وہ اس کے وجوب کا عقیدہ ہی نہ رکھتا ہو تو وہ مشرک ہے اور اگر اس کی پابندی قبول کرتا ہو اور اس کے وجوب کا عقیدہ رکھتا ہو، پھر اس کی خلاف ورزی کرے تو وہ زانی ہے۔ پھر اس کے حرام ہونے کی تصریح فرمائی کہ زانی یا مشرک سے نکاح مومنوں پر حرام کر دیا گیا ہے۔‘‘ اس آیت کے مطابق امام احمد ابن حنبل رحمہ اللہ پاک دامن مرد کا نکاح زانی غیر تائب عورت سے اور پاک دامن عورت کا نکاح زانی غیر تائب مرد سے حرام قرار دیتے ہیں۔ شیخ الاسلام ابن تیمیہ رحمہ اللہ نے تفسیر سورۂ نور میں اس مسلک کی تائید کرتے ہوئے ان لوگوں کی پُر زور تردید کی جو اس نکاح کو جائز قرار دیتے ہیں۔ ¤ ➌ اگر کسی مرد سے زنا سرزد ہو جائے، پھر وہ توبہ کر لے تو اس کا نکاح پاک دامن عورت سے جائز ہے، اسی طرح زانیہ عورت توبہ کر لے تو اس سے عفیف مومن کا نکاح جائز ہے، جیسا کہ کوئی مشرک مرد یا عورت شرک سے توبہ کرکے مسلمان ہو جائیں تو ان کے ساتھ نکاح جائز ہے۔ اس کی دلیل سورۂ فرقان کی آیت (۷۰) اور دوسری بہت سی آیات ہیں۔ ابن ابی حاتم نے اپنی سند کے ساتھ نقل کیا ہے کہ ایک آدمی نے ابن عباس رضی اللہ عنھما سے پوچھا کہ میں ایک عورت کے پاس جاتا تھا اور اس کے ساتھ اس کام کا ارتکاب کرتا تھا جو اللہ نے مجھ پر حرام کیا ہے، پھر اللہ تعالیٰ نے مجھے اس سے توبہ کی توفیق عطا فرمائی۔ اب میرا ارادہ ہے کہ اس سے نکاح کروں تو کچھ لوگوں نے کہا ہے : {’’ إِنَّ الزَّانِيْ لَا يَنْكِحُ إِلَّا زَانِيَةً أَوْ مُشْرِكَةً ‘‘} ’’زانی نہیں نکاح کرے گا مگر زانیہ سے یا مشرکہ سے۔‘‘ توابن عباس رضی اللہ عنھما نے فرمایا : ’’یہ آیت اس کے متعلق نہیں، تم اس سے نکاح کر لو، جو گناہ ہو گا وہ میرے ذمے رہنے دو۔‘‘ (ابن کثیر، دکتور حکمت بن بشیر نے اس کی سند کو حسن کہا ہے)"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { وَ الَّذِيْنَ يَرْمُوْنَ الْمُحْصَنٰتِ ثُمَّ لَمْ يَاْتُوْا بِاَرْبَعَةِ شُهَدَآءَ : ’’ الْمُحْصَنٰتِ ‘‘} سے مراد پاک دامن عورتیں ہیں، کنواری ہوں یا شادی شدہ۔ ان پر تہمت لگانے سے مراد زنا کی تہمت ہے، کیونکہ ’’پاک دامن عورتوں‘‘ کا لفظ قرینہ ہے کہ ان پر تہمت پاک دامن نہ ہونے ہی کی ہے۔اس کے علاوہ چار گواہوں کی شہادت بھی دلیل ہے کہ مراد زنا کی تہمت ہے، اگر کوئی شخص کسی پر چوری یا شراب نوشی یا کفر وغیرہ کی تہمت لگائے تو اس پر حد قذف نافذ نہیں کی جائے گی، بلکہ حاکم کی صواب دید کے مطابق تعزیر ہو گی۔ اگرچہ یہاں ذکر پاک دامن عورتوں کا ہے مگر اس میں پاک دامن مرد بھی شامل ہیں، ان پر بہتان لگانے والوں پر بھی یہی حد لاگو ہو گی، کیونکہ جس علت کی بنا پر پاک دامن عورتوں پر تہمت لگانے کی حد مقرر کی گئی ہے وہی علت پاک دامن مردوں پر تہمت لگانے میں بھی موجود ہے۔ اس لیے پوری امت کا اجماع ہے کہ پاک دامن عورتوں پر تہمت لگانے کی حد پاک دامن مرد پر تہمت لگانے والے پر بھی نافذ کی جائے گی۔ یہاں عورتوں کا ذکر اس لیے ہے کہ ان پر تہمت زیادہ تکلیف دہ اور باعث عار ہوتی ہے اور اس لیے بھی کہ آگے ام المومنین عائشہ رضی اللہ عنھا پر تہمت کا ذکر آ رہا ہے۔ ¤ ➋ جو شخص کسی پاک دامن عورت پر زنا کی تہمت لگائے اس سے مطالبہ کیا جائے گا کہ اپنے دعوے کے ثبوت کے لیے چار مسلمان عادل مرد گواہ پیش کرے۔ (دیکھیے نساء : ۱۵) دوسرے کسی جرم کے ثبوت کے لیے چار گواہ مقرر نہیں کیے گئے۔ اگر کسی شخص نے کسی کو زنا کرتے ہوئے اپنی آنکھوں سے بھی دیکھا ہے تو اگر اس کے پاس مزید تین گواہ نہیں تو اسے اجازت نہیں کہ اس کا ذکر کرے، بلکہ اسے خاموش رہنے کا حکم ہے، تاکہ وہ گندگی جہاں ہے وہیں تک محدود رہے، معاشرے میں لوگوں کے ناجائز تعلقات کے چرچے نہ ہوں، کیونکہ اس سے بے شمار برائیاں پھیلتی ہیں، ماحول میں زنا کا تذکرہ اسے پھیلانے کا ذریعہ بنتا ہے۔ کوئی شخص اگر چھپ کر زنا کا ارتکاب کرتا ہے تو اس کا اتنا نقصان نہیں جتنا زنا کی اشاعت (بے حیائی کی بات پھیلانے) سے معاشرے کا نقصان ہوتا ہے۔ ہاں، اگر کوئی شخص اتنی دیدہ دلیری سے زنا کرتا ہے کہ چار مرد اسے عین حالت زنا میں دیکھتے ہیں تو انھیں اجازت ہے کہ اسے حاکم کے پاس لے جائیں، تاکہ وہ اس پر حد نافذ کرکے اس خبیث فعل کی روک تھام کرے۔ ایک طرف زنا کی سخت ترین حد مقرر فرمائی، دوسری طرف لوگوں کی عزتوں کی حفاظت اور ان کی کمزوریوں پر پردے کے لیے حکم دیا کہ جو شخص کسی پاک دامن پر زنا کا الزام لگائے، پھر چار گواہ پیش نہ کرے تو اسے بہتان کی حد لگاؤ۔ بہتان لگانے والا مرد ہو یا عورت، جیسا کہ حسان بن ثابت اور مسطح بن اثاثہ( رضی اللہ عنھما ) کے ساتھ حمنہ بنت جحش( رضی اللہ عنھا ) پر بھی حد قذف لگائی گئی تھی۔ ¤ ➌ جو شخص کسی پاک دامن مسلم مرد یا عورت پر زنا کا الزام لگائے، پھر چار گواہ نہ لا سکے تو اللہ تعالیٰ نے اس کے متعلق تین حکم دیے ہیں، پہلا یہ کہ اسے اسّی (۸۰) کوڑے مارو، دوسرا یہ کہ اس کی کوئی شہادت کبھی قبول نہ کرو اور تیسرا یہ کہ یہی لوگ فاسق (نافرمان) ہیں ({اُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ} میں قصرِ قلب ہے)، نہ کہ وہ لوگ جنھیں یہ فاسق ثابت کرنا چاہتے تھے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) { اِلَّا الَّذِيْنَ تَابُوْا مِنْۢ بَعْدِ ذٰلِكَ وَ اَصْلَحُوْا … :} اس بات پر اتفاق ہے کہ توبہ سے بہتان کی حد معاف نہیں ہو گی، اسی طرح اس پر بھی اتفاق ہے کہ توبہ اور اصلاح کے بعد اس سے فسق کا حکم اٹھ جائے گا، البتہ اس بات میں اختلاف ہے کہ توبہ اور اصلاح کے بعد اس کی شہادت قبول ہو گی یا نہیں۔ طبری رحمہ اللہ نے حسن سند کے ساتھ عبد اللہ بن عباس رضی اللہ عنھما کا قول ذکر کیا ہے کہ انھوں نے {’’ وَ لَا تَقْبَلُوْا لَهُمْ شَهَادَةً اَبَدًا ‘‘} پڑھا اور فرمایا : ’’پھر جو شخص توبہ اور اپنی اصلاح کر لے تو اللہ تعالیٰ کی کتاب کے مطابق اس کی شہادت قبول کی جائے گی۔‘‘ اگرچہ بعض لوگوں کے مطابق توبہ اور اصلاح کے بعد بھی اس کی شہادت قبول نہیں ہو گی، مگر صحیح بات یہی ہے کہ اگر بہتان لگانے والا توبہ کرے کہ آئندہ میں ایسی بات نہیں کروں گا اور واقعی اپنی اصلاح کر لے اور ایسی کوئی غلطی نہ کرے تو اس کی شہادت قبول کی جائے گی۔ کیونکہ مردود الشہادہ تو وہ فسق کی وجہ سے تھا، جب فسق نہ رہا تو شہادت کیوں قبول نہ ہو۔ اس کے علاوہ یہ کہ توبہ سے تو کفر و شرک بھی معاف ہو جاتا ہے، قذف تو اس سے کہیں کم گناہ ہے۔ رہا لفظ{ ’’ اَبَدًا ‘‘ } (ہمیشہ) تو اس کا مطلب یہ ہے کہ جب تک وہ تہمت لگانے سے باز نہ آئے، خواہ کتنی ہی مدت گزر جائے، اس کی شہادت مت قبول کرو۔ رہی وہ مدت جس سے اس کی توبہ اور اصلاح ثابت ہو جاتی ہے تو بعض لوگوں نے اس کے لیے ایک سال مدت مقرر کی ہے، مگر یہ بات کتاب و سنت سے ثابت نہیں، اس لیے یہ بات قاضی پر چھوڑ دی جائے گی، اگر اسے کسی بھی مدت میں اس کی توبہ اور اصلاح کا یقین ہو جائے تو وہ اس کی شہادت قبول کر سکتا ہے، کیونکہ یقینا اللہ غفور بھی ہے اور رحیم بھی، وہ توبہ کے بعد بے حد پردہ پوشی بھی کرتا ہے اور رحم بھی۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6تا9) ➊ { وَ الَّذِيْنَ يَرْمُوْنَ اَزْوَاجَهُمْ …:} حد قذف کی آیات نازل ہونے کے بعد یہ مسئلہ پیش آیا کہ اگر خاوند اپنی بیوی کو زنا کرتے ہوئے دیکھے اور اس کے پاس گواہ نہ ہوں تو وہ کیا کرے۔ سب سے پہلے سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے فرضی طور پر اس کے متعلق پوچھا، کہنے لگے : [ يَا رَسُوْلَ اللّٰهِ! إِنْ وَجَدْتُ مَعَ امْرَأَتِيْ رَجُلاً، أَ أُمْهِلُهُ حَتّٰی آتِيَ بِأَرْبَعَةِ شُهَدَاءَ؟ قَالَ نَعَمْ ] [ مسلم، کتاب اللعان : 1498/15 ] ’’یا رسول اللہ! اگر میں اپنی بیوی کے ساتھ کسی آدمی کو پاؤں تو کیا اسے چار گواہ لانے تک مہلت دوں؟‘‘ آپ نے فرمایا : ’’ہاں!‘‘ عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے پوچھا : ’’اگر کوئی آدمی اپنی بیوی کے ساتھ کسی مرد کو پائے تو وہ یا تو بات کرے گا تو تم اسے کوڑے مارو گے، یا وہ (اسے) قتل کر دے گا، تو تم اسے قتل کر دو گے، یا خاموش رہے گا تو دلی غیظ پر خاموش رہے گا۔‘‘ آپ نے کہا : [ اللّٰهُمَّ ! افْتَحْ ] ’’یا اللہ! تو فیصلہ فرما!‘‘ اور دعا کرنے لگے، تو لعان کی آیات اتریں : « وَ الَّذِيْنَ يَرْمُوْنَ اَزْوَاجَهُمْ وَ لَمْ يَكُنْ لَّهُمْ شُهَدَآءُ اِلَّاۤ اَنْفُسُهُمْ … اِنْ كَانَ مِنَ الصّٰدِقِيْنَ» [ النور : ۶ تا ۹ ] تو وہی آدمی اس آزمائش میں مبتلا ہو گیا۔ چنانچہ وہ اور اس کی بیوی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور انھوں نے لعان کیا۔ مرد نے اللہ کی چار قسمیں کھائیں کہ وہ یقینا سچوں میں سے ہے، پھر پانچویں دفعہ اس نے لعنت کی کہ اس پر لعنت ہو اگر وہ جھوٹوں میں سے ہو۔ پھر وہ عورت لعنت کرنے لگی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ٹھہرو!‘‘ مگر وہ نہیں مانی اور اس نے لعان کر دیا۔ جب وہ واپس گئے تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’شاید کہ وہ سیاہ گھونگھریالے بالوں والے بچے کو جنم دے۔‘‘ تو اس نے سیاہ گھونگھریالے بالوں والے بچے ہی کو جنم دیا۔ [ مسلم، کتاب اللعان : ۱۴۹۵ ] ¤ سہل بن سعد رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک آدمی آیا اور کہنے لگا : ’’یا رسول اللہ! یہ بتائیں کہ کوئی آدمی اپنی بیوی کے ساتھ کسی مرد کو دیکھے تو کیا اسے قتل کر دے، تو تم اسے قتل کر دو گے، یا وہ کیا کرے؟ تو اللہ تعالیٰ نے ان دونوں کے بارے میں قرآن کی وہ آیات نازل فرمائیں جن میں لعان کا ذکر ہے۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے تمھارے اور تمھاری بیوی کے متعلق فیصلہ فرما دیا ہے۔‘‘ سہل رضی اللہ عنہ فرماتے ہیں : ’’ان دونوں نے لعان کیا اور میں رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر تھا اور اس نے بیوی سے علیحدگی اختیار کر لی تو یہ سنت ٹھہری کہ لعان کرنے والے میاں بیوی کے درمیان علیحدگی کر دی جائے گی اور وہ حاملہ تھی تو خاوند نے اس کے حمل کو اپنا تسلیم کرنے سے انکار کر دیا۔ اس لیے وہ ماں کے نام پر پکارا جاتا تھا، پھر میراث میں یہ سنت جاری ہوئی کہ وہ لڑکا اپنی ماں کا وارث بنے گا اور وہ اس کی وارث ہو گی۔‘‘ [ بخاري، التفسیر، باب : «والخامسۃ أن لعنت اللہ علیہ … » : ۴۷۴۶ ] ¤ ➋ ان دونوں احادیث میں لعان کے تقریباً سبھی احکام آ گئے ہیں۔ میاں بیوی دونوں میں سے ایک کے یقینا جھوٹا ہونے کے باوجود ان کا معاملہ لعان کے بعد اللہ کے سپرد کیا جائے گا، تاکہ مہلت اور پردہ پوشی سے فائدہ اٹھا کر غلطی والا فریق اللہ تعالیٰ سے توبہ و استغفار کرلے۔ ¤ ➌ یاد رہے کہ کسی خاوند کا محض شک کی بنا پر یا بچے کے حلیہ کو اپنے مطابق نہ دیکھ کر بیوی پر زنا کا الزام لگا دینا سخت گناہ ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : ’’یا رسول اللہ! میرے ہاں کالے رنگ کا بچہ پیدا ہوا ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تمھارے پاس کچھ اونٹ ہیں؟‘‘ اس نے کہا : ’’جی ہاں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ان کے رنگ کیا ہیں؟‘‘ کہا : ’’سرخ ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’کیا ان میں کوئی خاکستری بھی ہے؟‘‘ کہا : ’’جی ہاں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ کیسے ہو گیا؟‘‘ کہا : ’’شاید اسے کوئی رگ کھینچ کرلے گئی ہو۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو شاید تمھارے اس بیٹے کو بھی کوئی رگ کھینچ کر لے گئی ہو۔‘‘ [ بخاری، الطلاق، باب إذا عرض بنفي الولد : ۵۳۰۵ ]"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 6تا9) ➊ { وَ الَّذِيْنَ يَرْمُوْنَ اَزْوَاجَهُمْ …:} حد قذف کی آیات نازل ہونے کے بعد یہ مسئلہ پیش آیا کہ اگر خاوند اپنی بیوی کو زنا کرتے ہوئے دیکھے اور اس کے پاس گواہ نہ ہوں تو وہ کیا کرے۔ سب سے پہلے سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے فرضی طور پر اس کے متعلق پوچھا، کہنے لگے : [ يَا رَسُوْلَ اللّٰهِ! إِنْ وَجَدْتُ مَعَ امْرَأَتِيْ رَجُلاً، أَ أُمْهِلُهُ حَتّٰی آتِيَ بِأَرْبَعَةِ شُهَدَاءَ؟ قَالَ نَعَمْ ] [ مسلم، کتاب اللعان : 1498/15 ] ’’یا رسول اللہ! اگر میں اپنی بیوی کے ساتھ کسی آدمی کو پاؤں تو کیا اسے چار گواہ لانے تک مہلت دوں؟‘‘ آپ نے فرمایا : ’’ہاں!‘‘ عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے پوچھا : ’’اگر کوئی آدمی اپنی بیوی کے ساتھ کسی مرد کو پائے تو وہ یا تو بات کرے گا تو تم اسے کوڑے مارو گے، یا وہ (اسے) قتل کر دے گا، تو تم اسے قتل کر دو گے، یا خاموش رہے گا تو دلی غیظ پر خاموش رہے گا۔‘‘ آپ نے کہا : [ اللّٰهُمَّ ! افْتَحْ ] ’’یا اللہ! تو فیصلہ فرما!‘‘ اور دعا کرنے لگے، تو لعان کی آیات اتریں : « وَ الَّذِيْنَ يَرْمُوْنَ اَزْوَاجَهُمْ وَ لَمْ يَكُنْ لَّهُمْ شُهَدَآءُ اِلَّاۤ اَنْفُسُهُمْ … اِنْ كَانَ مِنَ الصّٰدِقِيْنَ» [ النور : ۶ تا ۹ ] تو وہی آدمی اس آزمائش میں مبتلا ہو گیا۔ چنانچہ وہ اور اس کی بیوی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور انھوں نے لعان کیا۔ مرد نے اللہ کی چار قسمیں کھائیں کہ وہ یقینا سچوں میں سے ہے، پھر پانچویں دفعہ اس نے لعنت کی کہ اس پر لعنت ہو اگر وہ جھوٹوں میں سے ہو۔ پھر وہ عورت لعنت کرنے لگی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ٹھہرو!‘‘ مگر وہ نہیں مانی اور اس نے لعان کر دیا۔ جب وہ واپس گئے تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’شاید کہ وہ سیاہ گھونگھریالے بالوں والے بچے کو جنم دے۔‘‘ تو اس نے سیاہ گھونگھریالے بالوں والے بچے ہی کو جنم دیا۔ [ مسلم، کتاب اللعان : ۱۴۹۵ ] ¤ سہل بن سعد رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک آدمی آیا اور کہنے لگا : ’’یا رسول اللہ! یہ بتائیں کہ کوئی آدمی اپنی بیوی کے ساتھ کسی مرد کو دیکھے تو کیا اسے قتل کر دے، تو تم اسے قتل کر دو گے، یا وہ کیا کرے؟ تو اللہ تعالیٰ نے ان دونوں کے بارے میں قرآن کی وہ آیات نازل فرمائیں جن میں لعان کا ذکر ہے۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے تمھارے اور تمھاری بیوی کے متعلق فیصلہ فرما دیا ہے۔‘‘ سہل رضی اللہ عنہ فرماتے ہیں : ’’ان دونوں نے لعان کیا اور میں رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر تھا اور اس نے بیوی سے علیحدگی اختیار کر لی تو یہ سنت ٹھہری کہ لعان کرنے والے میاں بیوی کے درمیان علیحدگی کر دی جائے گی اور وہ حاملہ تھی تو خاوند نے اس کے حمل کو اپنا تسلیم کرنے سے انکار کر دیا۔ اس لیے وہ ماں کے نام پر پکارا جاتا تھا، پھر میراث میں یہ سنت جاری ہوئی کہ وہ لڑکا اپنی ماں کا وارث بنے گا اور وہ اس کی وارث ہو گی۔‘‘ [ بخاري، التفسیر، باب : «والخامسۃ أن لعنت اللہ علیہ … » : ۴۷۴۶ ] ¤ ➋ ان دونوں احادیث میں لعان کے تقریباً سبھی احکام آ گئے ہیں۔ میاں بیوی دونوں میں سے ایک کے یقینا جھوٹا ہونے کے باوجود ان کا معاملہ لعان کے بعد اللہ کے سپرد کیا جائے گا، تاکہ مہلت اور پردہ پوشی سے فائدہ اٹھا کر غلطی والا فریق اللہ تعالیٰ سے توبہ و استغفار کرلے۔ ¤ ➌ یاد رہے کہ کسی خاوند کا محض شک کی بنا پر یا بچے کے حلیہ کو اپنے مطابق نہ دیکھ کر بیوی پر زنا کا الزام لگا دینا سخت گناہ ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : ’’یا رسول اللہ! میرے ہاں کالے رنگ کا بچہ پیدا ہوا ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تمھارے پاس کچھ اونٹ ہیں؟‘‘ اس نے کہا : ’’جی ہاں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ان کے رنگ کیا ہیں؟‘‘ کہا : ’’سرخ ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’کیا ان میں کوئی خاکستری بھی ہے؟‘‘ کہا : ’’جی ہاں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ کیسے ہو گیا؟‘‘ کہا : ’’شاید اسے کوئی رگ کھینچ کرلے گئی ہو۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو شاید تمھارے اس بیٹے کو بھی کوئی رگ کھینچ کر لے گئی ہو۔‘‘ [ بخاری، الطلاق، باب إذا عرض بنفي الولد : ۵۳۰۵ ]"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 6تا9) ➊ { وَ الَّذِيْنَ يَرْمُوْنَ اَزْوَاجَهُمْ …:} حد قذف کی آیات نازل ہونے کے بعد یہ مسئلہ پیش آیا کہ اگر خاوند اپنی بیوی کو زنا کرتے ہوئے دیکھے اور اس کے پاس گواہ نہ ہوں تو وہ کیا کرے۔ سب سے پہلے سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے فرضی طور پر اس کے متعلق پوچھا، کہنے لگے : [ يَا رَسُوْلَ اللّٰهِ! إِنْ وَجَدْتُ مَعَ امْرَأَتِيْ رَجُلاً، أَ أُمْهِلُهُ حَتّٰی آتِيَ بِأَرْبَعَةِ شُهَدَاءَ؟ قَالَ نَعَمْ ] [ مسلم، کتاب اللعان : 1498/15 ] ’’یا رسول اللہ! اگر میں اپنی بیوی کے ساتھ کسی آدمی کو پاؤں تو کیا اسے چار گواہ لانے تک مہلت دوں؟‘‘ آپ نے فرمایا : ’’ہاں!‘‘ عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے پوچھا : ’’اگر کوئی آدمی اپنی بیوی کے ساتھ کسی مرد کو پائے تو وہ یا تو بات کرے گا تو تم اسے کوڑے مارو گے، یا وہ (اسے) قتل کر دے گا، تو تم اسے قتل کر دو گے، یا خاموش رہے گا تو دلی غیظ پر خاموش رہے گا۔‘‘ آپ نے کہا : [ اللّٰهُمَّ ! افْتَحْ ] ’’یا اللہ! تو فیصلہ فرما!‘‘ اور دعا کرنے لگے، تو لعان کی آیات اتریں : « وَ الَّذِيْنَ يَرْمُوْنَ اَزْوَاجَهُمْ وَ لَمْ يَكُنْ لَّهُمْ شُهَدَآءُ اِلَّاۤ اَنْفُسُهُمْ … اِنْ كَانَ مِنَ الصّٰدِقِيْنَ» [ النور : ۶ تا ۹ ] تو وہی آدمی اس آزمائش میں مبتلا ہو گیا۔ چنانچہ وہ اور اس کی بیوی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور انھوں نے لعان کیا۔ مرد نے اللہ کی چار قسمیں کھائیں کہ وہ یقینا سچوں میں سے ہے، پھر پانچویں دفعہ اس نے لعنت کی کہ اس پر لعنت ہو اگر وہ جھوٹوں میں سے ہو۔ پھر وہ عورت لعنت کرنے لگی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ٹھہرو!‘‘ مگر وہ نہیں مانی اور اس نے لعان کر دیا۔ جب وہ واپس گئے تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’شاید کہ وہ سیاہ گھونگھریالے بالوں والے بچے کو جنم دے۔‘‘ تو اس نے سیاہ گھونگھریالے بالوں والے بچے ہی کو جنم دیا۔ [ مسلم، کتاب اللعان : ۱۴۹۵ ] ¤ سہل بن سعد رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک آدمی آیا اور کہنے لگا : ’’یا رسول اللہ! یہ بتائیں کہ کوئی آدمی اپنی بیوی کے ساتھ کسی مرد کو دیکھے تو کیا اسے قتل کر دے، تو تم اسے قتل کر دو گے، یا وہ کیا کرے؟ تو اللہ تعالیٰ نے ان دونوں کے بارے میں قرآن کی وہ آیات نازل فرمائیں جن میں لعان کا ذکر ہے۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے تمھارے اور تمھاری بیوی کے متعلق فیصلہ فرما دیا ہے۔‘‘ سہل رضی اللہ عنہ فرماتے ہیں : ’’ان دونوں نے لعان کیا اور میں رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر تھا اور اس نے بیوی سے علیحدگی اختیار کر لی تو یہ سنت ٹھہری کہ لعان کرنے والے میاں بیوی کے درمیان علیحدگی کر دی جائے گی اور وہ حاملہ تھی تو خاوند نے اس کے حمل کو اپنا تسلیم کرنے سے انکار کر دیا۔ اس لیے وہ ماں کے نام پر پکارا جاتا تھا، پھر میراث میں یہ سنت جاری ہوئی کہ وہ لڑکا اپنی ماں کا وارث بنے گا اور وہ اس کی وارث ہو گی۔‘‘ [ بخاري، التفسیر، باب : «والخامسۃ أن لعنت اللہ علیہ … » : ۴۷۴۶ ] ¤ ➋ ان دونوں احادیث میں لعان کے تقریباً سبھی احکام آ گئے ہیں۔ میاں بیوی دونوں میں سے ایک کے یقینا جھوٹا ہونے کے باوجود ان کا معاملہ لعان کے بعد اللہ کے سپرد کیا جائے گا، تاکہ مہلت اور پردہ پوشی سے فائدہ اٹھا کر غلطی والا فریق اللہ تعالیٰ سے توبہ و استغفار کرلے۔ ¤ ➌ یاد رہے کہ کسی خاوند کا محض شک کی بنا پر یا بچے کے حلیہ کو اپنے مطابق نہ دیکھ کر بیوی پر زنا کا الزام لگا دینا سخت گناہ ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : ’’یا رسول اللہ! میرے ہاں کالے رنگ کا بچہ پیدا ہوا ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تمھارے پاس کچھ اونٹ ہیں؟‘‘ اس نے کہا : ’’جی ہاں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ان کے رنگ کیا ہیں؟‘‘ کہا : ’’سرخ ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’کیا ان میں کوئی خاکستری بھی ہے؟‘‘ کہا : ’’جی ہاں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ کیسے ہو گیا؟‘‘ کہا : ’’شاید اسے کوئی رگ کھینچ کرلے گئی ہو۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو شاید تمھارے اس بیٹے کو بھی کوئی رگ کھینچ کر لے گئی ہو۔‘‘ [ بخاری، الطلاق، باب إذا عرض بنفي الولد : ۵۳۰۵ ]"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 6تا9) ➊ { وَ الَّذِيْنَ يَرْمُوْنَ اَزْوَاجَهُمْ …:} حد قذف کی آیات نازل ہونے کے بعد یہ مسئلہ پیش آیا کہ اگر خاوند اپنی بیوی کو زنا کرتے ہوئے دیکھے اور اس کے پاس گواہ نہ ہوں تو وہ کیا کرے۔ سب سے پہلے سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے فرضی طور پر اس کے متعلق پوچھا، کہنے لگے : [ يَا رَسُوْلَ اللّٰهِ! إِنْ وَجَدْتُ مَعَ امْرَأَتِيْ رَجُلاً، أَ أُمْهِلُهُ حَتّٰی آتِيَ بِأَرْبَعَةِ شُهَدَاءَ؟ قَالَ نَعَمْ ] [ مسلم، کتاب اللعان : 1498/15 ] ’’یا رسول اللہ! اگر میں اپنی بیوی کے ساتھ کسی آدمی کو پاؤں تو کیا اسے چار گواہ لانے تک مہلت دوں؟‘‘ آپ نے فرمایا : ’’ہاں!‘‘ عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے پوچھا : ’’اگر کوئی آدمی اپنی بیوی کے ساتھ کسی مرد کو پائے تو وہ یا تو بات کرے گا تو تم اسے کوڑے مارو گے، یا وہ (اسے) قتل کر دے گا، تو تم اسے قتل کر دو گے، یا خاموش رہے گا تو دلی غیظ پر خاموش رہے گا۔‘‘ آپ نے کہا : [ اللّٰهُمَّ ! افْتَحْ ] ’’یا اللہ! تو فیصلہ فرما!‘‘ اور دعا کرنے لگے، تو لعان کی آیات اتریں : « وَ الَّذِيْنَ يَرْمُوْنَ اَزْوَاجَهُمْ وَ لَمْ يَكُنْ لَّهُمْ شُهَدَآءُ اِلَّاۤ اَنْفُسُهُمْ … اِنْ كَانَ مِنَ الصّٰدِقِيْنَ» [ النور : ۶ تا ۹ ] تو وہی آدمی اس آزمائش میں مبتلا ہو گیا۔ چنانچہ وہ اور اس کی بیوی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور انھوں نے لعان کیا۔ مرد نے اللہ کی چار قسمیں کھائیں کہ وہ یقینا سچوں میں سے ہے، پھر پانچویں دفعہ اس نے لعنت کی کہ اس پر لعنت ہو اگر وہ جھوٹوں میں سے ہو۔ پھر وہ عورت لعنت کرنے لگی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ٹھہرو!‘‘ مگر وہ نہیں مانی اور اس نے لعان کر دیا۔ جب وہ واپس گئے تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’شاید کہ وہ سیاہ گھونگھریالے بالوں والے بچے کو جنم دے۔‘‘ تو اس نے سیاہ گھونگھریالے بالوں والے بچے ہی کو جنم دیا۔ [ مسلم، کتاب اللعان : ۱۴۹۵ ] ¤ سہل بن سعد رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک آدمی آیا اور کہنے لگا : ’’یا رسول اللہ! یہ بتائیں کہ کوئی آدمی اپنی بیوی کے ساتھ کسی مرد کو دیکھے تو کیا اسے قتل کر دے، تو تم اسے قتل کر دو گے، یا وہ کیا کرے؟ تو اللہ تعالیٰ نے ان دونوں کے بارے میں قرآن کی وہ آیات نازل فرمائیں جن میں لعان کا ذکر ہے۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے تمھارے اور تمھاری بیوی کے متعلق فیصلہ فرما دیا ہے۔‘‘ سہل رضی اللہ عنہ فرماتے ہیں : ’’ان دونوں نے لعان کیا اور میں رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر تھا اور اس نے بیوی سے علیحدگی اختیار کر لی تو یہ سنت ٹھہری کہ لعان کرنے والے میاں بیوی کے درمیان علیحدگی کر دی جائے گی اور وہ حاملہ تھی تو خاوند نے اس کے حمل کو اپنا تسلیم کرنے سے انکار کر دیا۔ اس لیے وہ ماں کے نام پر پکارا جاتا تھا، پھر میراث میں یہ سنت جاری ہوئی کہ وہ لڑکا اپنی ماں کا وارث بنے گا اور وہ اس کی وارث ہو گی۔‘‘ [ بخاري، التفسیر، باب : «والخامسۃ أن لعنت اللہ علیہ … » : ۴۷۴۶ ] ¤ ➋ ان دونوں احادیث میں لعان کے تقریباً سبھی احکام آ گئے ہیں۔ میاں بیوی دونوں میں سے ایک کے یقینا جھوٹا ہونے کے باوجود ان کا معاملہ لعان کے بعد اللہ کے سپرد کیا جائے گا، تاکہ مہلت اور پردہ پوشی سے فائدہ اٹھا کر غلطی والا فریق اللہ تعالیٰ سے توبہ و استغفار کرلے۔ ¤ ➌ یاد رہے کہ کسی خاوند کا محض شک کی بنا پر یا بچے کے حلیہ کو اپنے مطابق نہ دیکھ کر بیوی پر زنا کا الزام لگا دینا سخت گناہ ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : ’’یا رسول اللہ! میرے ہاں کالے رنگ کا بچہ پیدا ہوا ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تمھارے پاس کچھ اونٹ ہیں؟‘‘ اس نے کہا : ’’جی ہاں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ان کے رنگ کیا ہیں؟‘‘ کہا : ’’سرخ ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’کیا ان میں کوئی خاکستری بھی ہے؟‘‘ کہا : ’’جی ہاں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ کیسے ہو گیا؟‘‘ کہا : ’’شاید اسے کوئی رگ کھینچ کرلے گئی ہو۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو شاید تمھارے اس بیٹے کو بھی کوئی رگ کھینچ کر لے گئی ہو۔‘‘ [ بخاری، الطلاق، باب إذا عرض بنفي الولد : ۵۳۰۵ ]"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) { وَ لَوْ لَا فَضْلُ اللّٰهِ عَلَيْكُمْ وَ رَحْمَتُهٗ … :} ’’اگر تم پر اللہ کا فضل اور اس کی رحمت نہ ہوتی…‘‘ اس ’’اگر‘‘ کا جواب محذوف ہے، یعنی ’’تو پھر تمھارا وہ حال ہوتا جو بیان میں آنا مشکل ہے‘‘ اس لیے یہ جواب محذوف کر دیا ہے۔ اس کی کچھ تفصیل یہ ہے کہ اگر اللہ تعالیٰ لعان کا حکم نازل نہ کرتا تو خاوند اگر بیوی کو زنا کی حالت میں دیکھتا تو اس کا معاملہ دوسرے لوگوں کی طرح نہیں تھا، جن کے متعلق حکم ہے کہ اگر وہ کسی کو زنا کرتے ہوئے دیکھیں اور وہ چار گواہ نہ لا سکتے ہوں تو خاموش رہیں، کیونکہ اس میں ان کا ذاتی دخل نہیں اور وہ اللہ سے زیادہ غیرت مند نہیں، بخلاف خاوند کے کہ وہ اگر خاموش رہے تو ساری عمر دل کی جلن کے ساتھ خاموش رہے اور دوسروں کی اولاد کو اپنی اولاد تسلیم کرے، طلاق دے تو اس کا نقصان ہے اور اگر الزام لگائے تو چار گواہ لائے، اگر نہ لا سکے، جو بظاہر لانے ممکن نہیں تو بہتان کی حد جھیلے۔ دوسری طرف اگر محض خاوند کے الزام یا قسمیں کھانے سے بیوی کے زنا کا ثبوت ہو جاتا تو عورت کے لیے سخت مصیبت تھی، کیونکہ ممکن ہے وہ سچی ہو۔ اسی طرح اگر عورت کو قسمیں کھانے کی وجہ سے بری سمجھ لیا جاتا تو مرد پر حد قذف واجب ہو جاتی، حالانکہ ممکن ہے وہی سچا ہو۔ اس لیے لعان کا حکم اللہ تعالیٰ کا خاص فضل اور اس کی رحمت ہے اور اس نے یہ حکم اپنے {’’ تَوَّابٌ ‘‘} اور {’’ حَكِيْمٌ ‘‘} ہونے کی وجہ سے دیا ہے، تاکہ میاں بیوی میں سے جو فریق سچا ہو بلاسبب سزا سے بچ جائے اور جو جھوٹا ہو دنیا میں اس پر پردہ رہے اور ہو سکتا ہے کہ وہ مہلت سے فائدہ اٹھا کر اللہ تعالیٰ کی توّابیت کی صفت کی بدولت توبہ کر لے اور اسے توبہ قبول ہونے کی سعادت حاصل ہو جائے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {اِنَّ الَّذِيْنَ جَآءُوْ بِالْاِفْكِ عُصْبَةٌ مِّنْكُمْ : ’’اَلْإِفْكُ‘‘} کا لفظی معنی الٹا کرنا ہوتا ہے، مراد ایسا بہتان ہے جو حقیقت کے بالکل خلاف ہو۔ اس سے مراد وہ بہتان ہے جو منافقین نے ام المومنین عائشہ رضی اللہ عنھا پر لگایا تھا، دو تین مخلص مسلمان بھی سادہ دلی کی وجہ سے ان کے ساتھ شامل ہو گئے۔ اس کی تفصیل خود عائشہ رضی اللہ عنھا سے سنیے، وہ فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی عادت تھی کہ آپ جب سفر پر جاتے تو اپنی بیویوں کے نام قرعہ ڈالتے، جس بیوی کے نام قرعہ نکلتا اسے آپ اپنے ساتھ لے جاتے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے ایک غزوہ (بنو المصطلق) میں قرعہ ڈالا جو میرے نام نکلا، تو میں آپ کے ساتھ روانہ ہو گئی۔ یہ واقعہ حجاب کا حکم نازل ہونے کے بعد کا ہے۔ میں ایک ہودے میں سوار رہتی اور جب اترتی تو ہودے سمیت اتاری جاتی۔ ہم اسی طرح سفر کرتے رہے، جب آپ صلی اللہ علیہ وسلم اس غزوہ سے فارغ ہوئے اور سفر سے لوٹے تو ہم لوگ مدینہ کے نزدیک آ پہنچے، آپ نے ایک رات کوچ کا اعلان کیا۔ یہ اعلان سن کر میں اٹھی اور پیدل چل کر لشکر سے پار نکل گئی، جب حاجت سے فارغ ہوئی اور لشکر کی طرف آنے لگی تو مجھے معلوم ہوا کہ ’’اظفار‘‘ کے نگینوں کا ہار (جو میرے گلے میں تھا) ٹوٹ کر گر گیا ہے۔ میں اسے ڈھونڈنے لگی اور اسے ڈھونڈنے میں دیر لگ گئی۔ اتنے میں وہ لوگ جو میرا ہودہ اٹھا کر اونٹ پر لادا کرتے تھے، انھوں نے ہودہ اٹھایا اور میرے اونٹ پر لاد دیا۔ وہ یہ سمجھتے رہے کہ میں ہودہ میں موجود ہوں، کیونکہ اس زمانہ میں عورتیں ہلکی پھلکی ہوتی تھیں، پُر گوشت اور بھاری بھر کم نہ ہوتی تھیں اور تھوڑا سا کھانا کھایا کرتی تھیں۔ لہٰذا ان لوگوں نے جب ہودہ اٹھایا تو انھیں اس کے ہلکے پن کا کوئی خیال نہ آیا، علاوہ ازیں میں ان دنوں ایک کم سن لڑکی تھی۔ خیر وہ ہودہ اونٹ پر لاد کر چل دیے۔ لشکر کے روانہ ہونے کے بعد میرا ہار مجھے مل گیا اور میں اسی ٹھکانے کی طرف چلی گئی جہاں رات کو اترے تھے، دیکھا تو وہاں نہ کوئی پکارنے والا ہے اور نہ جواب دینے والا (مطلب سب جا چکے تھے)، میں نے ارادہ کیا کہ اپنے ٹھکانے پر چلی جاؤں، کیونکہ میرا خیال تھا کہ جب وہ لوگ مجھے نہ پائیں گے تو اسی جگہ تلاش کرنے آئیں گے۔ میں وہاں بیٹھی رہی، نیند نے غلبہ کیا اور میں سو گئی۔ لشکر کے پیچھے پیچھے (گرے پڑے سامان کی خبر رکھنے کے لیے) صفوان بن معطل السلمی الذکوانی مقرر تھے۔ وہ رات چلے اور صبح میرے ٹھکانے کے قریب پہنچے اور دور سے کسی انسان کو سوتے ہوئے دیکھا، پھر میرے قریب آئے تو مجھے پہچان لیا، کیونکہ حجاب کا حکم نازل ہونے سے پہلے انھوں نے مجھے دیکھا تھا، جب انھوں نے مجھے پہچان کر {’’إِنَّا لِلّٰهِ وَ إِنَّا إِلَيْهِ رَاجِعُوْنَ‘‘} پڑھا تو میں بیدار ہو گئی اور اپنی چادر سے چہرہ ڈھانپ لیا۔ اللہ کی قسم! انھوں نے نہ مجھ سے کوئی بات کی اور نہ میں نے {’’إِنَّا لِلّٰهِ وَ إِنَّا إِلَيْهِ رَاجِعُوْنَ‘‘} کے سوا کوئی بات سنی۔ انھوں نے اپنی سواری بٹھائی اور اس کے اگلے پاؤں کو پاؤں سے دبائے رکھا تو میں اس پر سوار ہو گئی۔ وہ آگے سے اونٹنی کی مہار پکڑ کر پیدل چلتے رہے، یہاں تک کہ ہم لشکر سے اس وقت جا ملے جب وہ عین دوپہر کو گرمی کی شدت کی وجہ سے پڑاؤ کیے ہوئے تھے۔ تو جن کی قسمت میں تباہی لکھی تھی وہ تباہ ہوئے۔ اس تہمت کا ذمہ دار عبد اللہ بن ابی ابن سلول تھا۔ خیر ہم لوگ مدینہ پہنچے، وہاں پہنچ کر میں بیمار ہو گئی اور مہینا بھر بیمار رہی۔ لوگ تہمت لگانے والوں کی باتوں کا چرچا کرتے رہے اور مجھے خبر تک نہ ہوئی، البتہ ایک بات سے مجھے شک سا پڑتا تھا، وہ یہ کہ آپ صلی اللہ علیہ وسلم کی وہ مہربانی جو بیماری کی حالت میں مجھ پر ہوا کرتی تھی وہ اس بیماری میں مجھے نظر نہیں آئی۔ بس یہ تھا کہ آپ میرے پاس آتے تو سلام کہتے، پھر فرماتے : ’’کیا حال ہے؟‘‘ اور چلے جاتے، اس سے مجھے شک پڑتا، مگر مجھے کسی بات کی خبر نہ تھی۔ بیماری سے کچھ افاقہ ہوا تو میں کمزور ہو گئی، ابھی کمزور ہی تھی کہ ’’مناصع‘‘ کی طرف گئی۔ مسطح کی ماں (عاتکہ) میرے ساتھ تھی۔ ہم لوگ ہر رات کو وہاں رفع حاجت کے لیے جایا کرتے تھے۔ یہ اس زمانے کی بات ہے جب ہم اپنے گھروں کے نزدیک بیت الخلا نہیں بناتے تھے، بلکہ اگلے زمانہ کے عربوں کی طرح رفع حاجت کے لیے باہر جایا کرتے تھے۔ کیونکہ گھروں کے قریب بیت الخلا بنانے سے اس کی بدبو ہمیں تکلیف دیتی۔ خیر میں اور مسطح کی ماں جو ابو رہم بن عبد مناف کی بیٹی تھی اور اس کی ماں صخر بن عامر کی بیٹی اور ابوبکر صدیق کی خالہ تھی، اس کا بیٹا مسطح تھا، رفع حاجت سے فراغت کے بعد ہم دونوں گھر کو آ رہی تھیں کہ مسطح کی ماں کا پاؤں چادر میں الجھ کر پھسلا تو وہ کہنے لگی : ’’مسطح ہلاک ہو۔‘‘ میں نے اسے کہا : ’’تم نے بہت بری بات کہی، کیا تم اس شخص کو کوستی ہو جو بدر میں شریک تھا؟‘‘ وہ کہنے لگی : ’’اے بھولی لڑکی! کیا تم نے وہ نہیں سنا جو اس نے کہا ہے؟‘‘ میں نے کہا : ’’اس نے کیا کہا ہے؟‘‘ تب اس نے تہمت لگانے والوں کی باتیں مجھ سے بیان کیں تو میری بیماری میں مزید اضافہ ہو گیا۔ جب میں گھر پہنچی تو رسول اللہ صلی اللہ علیہ وسلم گھر تشریف لائے اور سلام کرکے پوچھا : ’’اب کیسی ہو؟‘‘ میں نے کہا : ’’کیا آپ مجھے اجازت دیتے ہیں کہ میں والدین کے پاس جاؤں؟‘‘ میرا ارادہ اس وقت یہ تھا کہ ان سے خبر کی تحقیق کروں۔ آپ صلی اللہ علیہ وسلم نے مجھے اجازت دے دی۔ میں اپنے والدین کے پاس آ گئی تو میں نے اپنی ماں سے کہا : ’’امی! لوگ (میرے بارے میں) کیا باتیں کر رہے ہیں؟‘‘ اس نے کہا : ’’بیٹی! اتنا رنج نہ کرو، اللہ کی قسم! اکثر ایسا ہوتا ہے کہ جب کسی مرد کے پاس کوئی خوبصورت عورت ہوتی ہے اور وہ اس سے محبت کرتا ہے اور اس کی سوکنیں بھی ہوں تو وہ بہت کچھ کرتی رہتی ہیں۔‘‘ میں نے کہا : ’’سبحان اللہ! لوگوں نے اس کا چرچا بھی کر دیا۔‘‘ چنانچہ میں وہ ساری رات روتی رہی، صبح ہو گئی مگر میرے آنسو تھمتے ہی نہ تھے، نہ آنکھوں میں نیند کا سرمہ تک آتا تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے علی بن ابی طالب اور اسامہ بن زید( رضی اللہ عنھما ) کو بلایا، کیونکہ وحی اترنے میں دیر ہو رہی تھی اور آپ صلی اللہ علیہ وسلم ان سے اپنی اہلیہ سے علیحدگی کے متعلق مشورہ چاہتے تھے۔ چنانچہ اسامہ بن زید نے تو آپ کو اس کے مطابق مشورہ دیا جو وہ جانتے تھے کہ عائشہ ایسی ناپاک باتوں سے پاک ہے اور اس کے مطابق کہا جو ان کے دل میں آپ کے گھر والوں کی محبت تھی۔ انھوں نے کہا : ’’یا رسول اللہ! وہ آپ کی اہلیہ ہے اور ہم خیر کے سوا کچھ نہیں جانتے۔‘‘ علی( رضی اللہ عنہ ) نے کہا : ’’یا رسول اللہ! اللہ تعالیٰ نے آپ پر کوئی تنگی نہیں کی اور عورتیں اس کے علاوہ بھی بہت ہیں اور اگر آپ بریرہ سے پوچھیں تو وہ آپ کو ٹھیک ٹھیک بتا دے گی۔‘‘ چنانچہ آپ صلی اللہ علیہ وسلم نے بریرہ( رضی اللہ عنھا ) کو بلایا اور اس سے پوچھا : ’’کیا تم نے کوئی ایسی بات دیکھی ہے کہ عائشہ کے متعلق تمھیں کچھ شک ہو؟‘‘ بریرہ( رضی اللہ عنھا ) کہنے لگیں : ’’اللہ کی قسم، جس نے آپ کو حق کے ساتھ بھیجا ہے! میں نے اس میں کوئی بات نہیں دیکھی جسے میں اس کا عیب سمجھوں، زیادہ سے زیادہ یہ ہے کہ وہ نو عمر لڑکی ہے، گھر والوں کا گندھا ہوا آٹا رکھ کر سو جاتی ہے اور بکری آ کر اسے کھا جاتی ہے۔‘ ‘(اس کے بعد) رسول اللہ صلی اللہ علیہ وسلم (خطبہ دینے کے لیے) کھڑے ہوئے اور اس دن عبد اللہ بن ابی کے خلاف مدد مانگی، فرمایا: [ يَا مَعْشَرَ الْمُسْلِمِيْنَ! مَنْ يَعْذِرُنِيْ مِنْ رَجُلٍ قَدْ بَلَغَنِيْ أَذَاهُ فِيْ أَهْلِ بَيْتِيْ ؟ فَوَ اللّٰهِ! مَا عَلِمْتُ عَلٰی أَهْلِيْ إِلَّا خَيْرًا، وَ لَقَدْ ذَكَرُوْا رَجُلًا مَا عَلِمْتُ عَلَيْهِ إِلَّا خَيْرًا، وَمَا ككَانَ يَدْخُلُ عَلٰی أَهْلِيْ إِلَّا مَعِيَ ] ’’مسلمانو! اس آدمی کے خلاف کون میری حمایت کرتا ہے جس کی تکلیف مجھے میرے گھر والوں کے متعلق پہنچی ہے، اللہ کی قسم! میں نے اپنے اہل خانہ میں بھلائی کے سوا کچھ نہیں دیکھا اور ان لوگوں نے ایک ایسے آدمی کا ذکر کیا ہے جس میں خیر کے سوا میں نے کچھ نہیں دیکھا اور وہ میرے گھر کبھی اکیلا نہیں بلکہ میرے ساتھ ہی آتا ہے۔‘‘ یہ سن کر سعد بن معاذ انصاری (اوس قبیلے کے سردار) کھڑے ہوئے اور کہنے لگے : ’’میں اس کے مقابل آپ کی مدد کرتا ہوں، اگر وہ اوس قبیلے سے ہے تو میں اس کی گردن اڑاتا ہوں اور اگر ہمارے بھائیوں خزرج قبیلے سے ہے تو آپ جو حکم دیں گے ہم بجا لائیں گے۔‘‘ یہ بات سن کر سعد بن عبادہ، جو خزرج قبیلے کے سردار تھے، کھڑے ہوئے، وہ اس سے پہلے نیک آدمی تھے، مگر قومی حمیّت نے انھیں بھڑ کا دیا، انھوں نے سعد بن معاذ سے کہا : ’’اللہ کی قسم! تم نے جھوٹ کہا، اللہ کی قسم! نہ تم اسے قتل کرو گے اور نہ ہی قتل کر سکتے ہو۔‘‘ اتنے میں اسید بن حضیر رضی اللہ عنہ جو سعد بن معاذ رضی اللہ عنہ کے چچا کے بیٹے تھے، کھڑے ہوئے اور انھوں نے سعد بن عبادہ سے کہا : ’’تم جھوٹ کہہ رہے ہو، اللہ کی قسم! ہم اسے ضرور قتل کریں گے، کیونکہ تم منافق ہو، منافقوں کی طرف داری کرتے ہوئے، ان کی طرف سے جھگڑتے ہو۔‘‘ اس پر اوس اور خزرج دونوں قبیلوں کے لوگ اٹھ کھڑے ہوئے اور قریب تھا کہ آپس میں لڑ پڑیں، رسول اللہ صلی اللہ علیہ وسلم ابھی منبر ہی پر تھے، آپ صلی اللہ علیہ وسلم انھیں سمجھاتے اور ٹھنڈا کرتے رہے، یہاں تک کہ وہ خاموش ہو گئے اور آپ صلی اللہ علیہ وسلم بھی خاموش ہو گئے۔\nعائشہ رضی اللہ عنھا فرماتی ہیں کہ میں وہ سارا دن روتی رہی، نہ میرے آنسو تھمتے تھے نہ آنکھوں میں نیند کا سرمہ تک پڑتا تھا۔ (والد نے مجھے گھر واپس جانے کا حکم دیا اور میں گھر چلی گئی) میرے والدین صبح میرے پاس ا ٓ گئے، میں دو رات اور ایک دن سے مسلسل رو رہی تھی، اس عرصہ میں مجھے نہ نیند آئی تھی اور نہ آنسو تھمتے تھے، والدین کو گمان ہوتا تھا کہ رو رو کر میرا کلیجہ پھٹ جائے گا۔ پھر ایسا ہوا کہ میرے والدین میرے پاس بیٹھے تھے اور میں رو رہی تھی کہ ایک انصاری عورت نے اندر آنے کی اجازت مانگی، میں نے اجازت دے دی تو وہ بھی میرے ساتھ بیٹھ کر رونے لگی۔ ہم اس حال میں تھے کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے، آپ نے سلام کہا اور بیٹھ گئے۔ اس سے پہلے جب سے مجھ پر تہمت لگی تھی آپ میرے پاس نہیں بیٹھے تھے۔ آپ ایک مہینا انتظار کرتے رہے، مگر وحی نہیں آئی۔ آپ صلی اللہ علیہ وسلم نے بیٹھ کر خطبہ پڑھا، پھر فرمایا : [ أَمَّا بَعْدُ، يَا عَائِشَةُ! فَإِنَّهُ قَدْ بَلَغَنِيْ عَنْكِ كَذَا وَ كَذَا، فَإِنْ كُنْتِ بَرِيْئَةً فَسَيُبَرِّئْكِ اللّٰهُ، وَإِنْ كُنْتِ أَلْمَمْتِ بِذَنْبٍ فَاسْتَغْفِرِي اللّٰهَ وَتُوبِيْ إِلَيْهِ، فَإِنّنَّ الْعَبْدَ إِذَا اعْتَرَفَ بِذَنْبِهِ ثُمَّ تَابَ إِلَي اللّٰهِ تَابَ اللّٰهُ عَلَيْهِ ] ’’اما بعد! عائشہ! مجھے تمھارے بارے میں یہ بات پہنچی ہے، اگر تو بے گناہ ہے تو اللہ تعالیٰ تجھے ضرور بری کر دے گا اور اگر تو کسی گناہ سے آلودہ ہوئی ہے تو اللہ سے معافی مانگ اور توبہ کر، کیونکہ بندہ جب اپنے گناہ کا اقرار کرکے توبہ کرتا ہے تو اللہ اس کی توبہ قبول کرتا ہے۔‘‘ جب رسول اللہ صلی اللہ علیہ وسلم نے اپنی بات ختم کی تو میرے آنسو سوکھ گئے، حتیٰ کہ مجھے ان کا ایک قطرہ بھی محسوس نہیں ہوتا تھا، میں نے اپنے والد سے کہا : ’’رسول اللہ صلی اللہ علیہ وسلم نے جو کچھ کہا ہے اس کا جواب دیں۔‘‘ انھوں نے کہا : ’’اللہ کی قسم! مجھے معلوم نہیں میں کیا کہوں۔‘‘ پھر میں نے اپنی ماں سے کہا : ’’آپ رسول اللہ صلی اللہ علیہ وسلم کو جواب دیں۔‘‘ انھوں نے کہا : ’’اللہ کی قسم! مجھے معلوم نہیں میں کیا کہوں۔‘‘ آخر میں خود ہی جواب دینے لگی، میں نو عمر لڑکی تھی، قرآن میں نے زیادہ نہیں پڑھا تھا، میں نے کہا : [ إِنِّيْ وَاللّٰهِ لَقَدْ عَلِمْتُ لَقَدْ سَمِعْتُمْ هٰذَا الْحَدِيْثَ حَتَّی اسْتَقَرَّ فِيْ أَنْففُسِكُمْ وَ صَدَّقْتُمْ بِهِ، فَلَئِنْ قُلْتُ لَكُمْ : إِنِّيْ بَرِيْئَةٌ، وَاللّٰهُ يَعْلَمُ أَنّيْ بَرِيْئَةٌ، لَا تُصَدِّقُوْنَنِيْ بِذٰلِكَ، وَلَئِنِ اعْتَرَفْتُ لَكُمْ بِأَمْرٍ وَاللّٰهُ يَعْلَمُ أَنِّيْ مِنْهُ بَرِيْئَةٌ لَتُصَدِّقُنِّيْ، وَاللّٰهِ مَا أَجِدُ لَكُمْ مَثَلًا إِلَّا قَوْلَ أَبِيْ يُوْسُفَ قَالَ : «{ فَصَبْرٌ جَمِيْلٌ وَ اللّٰهُ الْمُسْتَعَانُ عَلٰى مَا تَصِفُوْنَ }»» [يوسف : ۱۸] ] ’’اللہ کی قسم! میں جانتی ہوں کہ آپ لوگوں نے یہ بات سنی ہے، حتیٰ کہ آپ کے دل میں جم گئی ہے اور آپ نے اسے سچا سمجھ لیا ہے، اب اگر میں آپ سے کہوں کہ میں بے گناہ ہوں اور اللہ جانتا ہے کہ میں بے گناہ ہوں، تو تم مجھے اس میں سچا نہیں سمجھو گے اور اگر میں کسی بات کا اعتراف کر لوں، جب کہ اللہ تعالیٰ جانتا ہے کہ میں اس سے بری ہوں تو آپ مجھے سچا سمجھیں گے۔ اللہ کی قسم! میں اپنی اور تمھاری مثال ایسی ہی سمجھتی ہوں جیسے یوسف کے باپ نے کہا تھا : ’’سو (میرا کام) اچھا صبر ہے اور اللہ ہی ہے جس سے اس پر مدد مانگی جاتی ہے، جو تم بیان کرتے ہو۔‘‘ پھر میں نے کروٹ بدل لی اور بستر پر لیٹ گئی۔ میں اس وقت جانتی تھی کہ میں بے گناہ ہوں اور اللہ تعالیٰ ضرور میری بے گناہی کی وجہ سے مجھے بری کر دے گا، لیکن اللہ کی قسم! مجھے یہ گمان تک نہ تھا کہ اللہ تعالیٰ میرے بارے میں ایسی وحی نازل کرنے والا ہے جس کی تلاوت کی جائے گی اور میرے دل میں میری شان اس سے کہیں کم تر تھی کہ اللہ تعالیٰ میرے بارے میں ایسی بات فرمائے گا جس کی تلاوت کی جایا کرے گی۔ مجھے تو یہ امید تھی کہ رسول اللہ صلی اللہ علیہ وسلم نیند میں خواب دیکھیں گے، جس کے ساتھ اللہ تعالیٰ مجھے پاک قرار دے گا۔ تو اللہ کی قسم! ابھی رسول اللہ صلی اللہ علیہ وسلم وہاں سے چلے نہ تھے، نہ ہی گھر والوں میں سے کوئی باہر گیا تھا کہ آپ پر وحی نازل ہونے لگی اور آپ پر وہ سختی ہونے لگی جو اس موقع پر ہوا کرتی تھی، یہاں تک کہ آپ سے موتیوں کی طرح پسینا ٹپکنے لگا، حالانکہ وہ سردی کا دن تھا۔ ایسا اس کلام کے بوجھ کی وجہ سے ہوتا تھا جو آپ پر نازل ہوتا تھا۔ جب وہ حالت ختم ہوئی تو آپ خوش تھے اور ہنس رہے تھے۔ پھر پہلی بات جو آپ نے کہی یہ تھی : [ يَا عَائِشَةُ! أَمَّا اللّٰهُ عَزَّ وَ جَلَّ فَقَدْ بَرَّأَكِ ] ’’عائشہ! اللہ عز و جل نے تمھیں بری کر دیا۔‘‘ میری والدہ نے کہا : ’’رسول اللہ صلی اللہ علیہ وسلم کی طرف اٹھو (اور شکریہ ادا کرو)۔‘‘ میں نے کہا : ’’اللہ کی قسم! میں آپ کی طرف نہیں اٹھوں گی اور اللہ کے سوا کسی کا شکریہ ادا نہیں کروں گی۔‘‘ اللہ تعالیٰ نے یہ آیات نازل فرمائیں : « اِنَّ الَّذِيْنَ جَآءُوْ بِالْاِفْكِ عُصْبَةٌ مِّنْكُمْ … وَ اَنَّ اللّٰهَ رَءُوْفٌ رَّحِيْمٌ » [ النور : ۱۱ تا ۲۰ ] \nجب اللہ تعالیٰ نے میری براء ت میں یہ آیات نازل فرمائیں تو ابوبکر صدیق( رضی اللہ عنہ ) نے، جو محتاجی اور قرابت کی وجہ سے مسطح پر خرچ کیا کرتے تھے، کہا : ’’اللہ کی قسم! میں مسطح پر کبھی کچھ خرچ نہیں کروں گا، کیونکہ اس نے عائشہ کے متعلق ایسی باتیں کی ہیں۔‘‘ تو اللہ تعالیٰ نے یہ آیت نازل فرمائی : « وَ لَا يَاْتَلِ اُولُوا الْفَضْلِ مِنْكُمْ وَ السَّعَةِ اَنْ يُّؤْتُوْۤا اُولِي الْقُرْبٰى وَ الْمَسٰكِيْنَ وَ الْمُهٰجِرِيْنَ فِيْ سَبِيْلِ اللّٰهِ وَ لْيَعْفُوْا وَ لْيَصْفَحُوْا اَلَا تُحِبُّوْنَ اَنْ يَّغْفِرَ اللّٰهُ  لَكُمْ وَ اللّٰهُ غَفُوْرٌ رَّحِيْمٌ » [ النور : ۲۲ ] ’’اور تم میں سے فضیلت اور وسعت والے اس بات سے قسم نہ کھا لیں کہ قرابت والوں اور مسکینوں اور اللہ کی راہ میں ہجرت کرنے والوں کو دیں اور لازم ہے کہ معاف کر دیں اور درگزر کریں، کیا تم پسند نہیں کرتے کہ اللہ تمھیں بخشے اور اللہ بے حد بخشنے والا، نہایت مہربان ہے۔‘‘ یہ آیت سن کر ابوبکر نے کہا : ’’کیوں نہیں؟ اللہ کی قسم! مجھے پسند ہے کہ اللہ مجھے بخش دے۔‘‘ اور وہ مسطح پر جو خرچ کیا کرتے تھے دوبارہ کرنے لگے اور کہا : ’’اللہ کی قسم! میں کبھی یہ معمول بند نہیں کروں گا۔‘‘ عائشہ رضی اللہ عنھا نے فرمایا : ’’رسول اللہ صلی اللہ علیہ وسلم (اس تہمت کے زمانہ میں) زینب بنت جحش رضی اللہ عنھا سے میرے بارے میں پوچھا کرتے تھے کہ زینب تمھیں کیا معلوم ہے، یا تم نے کیا دیکھا ہے؟ تو وہ یہی کہتی کہ میں اپنے کان اور آنکھ کی خوب احتیاط رکھتی ہوں، مجھے تو اس کے اچھا ہونے کے سوا کچھ معلوم نہیں۔ رسول اللہ صلی اللہ علیہ وسلم کی بیویوں میں سے زینب ہی میرا مقابلہ کرتی تھی، اللہ تعالیٰ نے اس کی پرہیز گاری کی وجہ سے اسے بچا لیا اور اس کی بہن حمنہ اس کی خاطر لڑنے لگی۔ تو جس طرح دوسرے تہمت لگانے والے تباہ ہوئے وہ بھی تباہ ہوئی۔‘‘ [ بخاري، التفسیر، باب :  «لو لا إذ سمعتموہ ظن المؤمنون…» : ۴۷۵۰ ] ¤ \n➋ { اِنَّ الَّذِيْنَ جَآءُوْ بِالْاِفْكِ عُصْبَةٌ مِّنْكُمْ … :} ایک ذہن کے لوگوں کے گروہ اور جماعت کو {’’عُصْبَةٌ‘‘} اور {’’ عِصَابَةٌ‘‘} کہا جاتا ہے، کیونکہ وہ ایک دوسرے کی تقویت کا باعث ہوتے ہیں اور {’’ عَصَبَ يَعْصِبُ ‘‘} (ض) کا معنی باندھنا اور مضبوط کرنا ہے، یعنی جو لوگ یہ عظیم بہتان اپنے پاس سے بنا کر لائے ہیں ان کا شمار مسلمانوں میں ہوتا ہے، اس لیے ان سے معاملہ کرتے وقت ان کے ساتھ غیر مسلموں والا سلوک نہ کرو، کیونکہ یہ تمھی میں سے ہیں، ایسا نہ ہو کہ مسلمانوں میں سے کچھ لوگ ان کی حمایت میں اٹھ کھڑے ہوں اور بات باہمی فساد تک جا پہنچے۔ جیسا کہ تجربے سے یہ بات ثابت بھی ہو گئی ہے کہ جب آپ نے عبد اللہ بن ابی کے مقابلے میں مدد کے لیے کہا تو قریب تھا کہ لوگ لڑ پڑتے، اگر نبی کریم صلی اللہ علیہ وسلم انھیں ٹھنڈا نہ کرتے۔ اس لیے اللہ سبحانہ نے یہ کہہ کر کہ ’’جو لوگ یہ بہتان لائے ہیں تمھی میں سے ایک گروہ ہیں‘‘ ان کا بہتان اور جھوٹ بھی واضح فرمایا اور زیادہ تعاقب سے بھی منع فرما دیا۔ ¤ \n➌ { لَا تَحْسَبُوْهُ شَرًّا لَّكُمْ بَلْ هُوَ خَيْرٌ لَّكُمْ :} یہ بات مخلص مسلمانوں کے اطمینان کے لیے فرمائی، جنھیں اس بہتان سے صدمہ پہنچا تھا، خصوصاً جن کا اس واقعہ سے براہ راست تعلق تھا، مثلاً نبی کریم صلی اللہ علیہ وسلم ، ابوبکر صدیق، عائشہ، ان کی والدہ اور صفوان بن معطل رضی اللہ عنھم ۔ فرمایا، تم اس واقعہ کو اپنے لیے برا مت سمجھو، بلکہ یہ تمھارے لیے کئی لحاظ سے بہتر ہے : ¤ \n(1) اس واقعہ سے رسول اللہ صلی اللہ علیہ وسلم ، عائشہ، ان کے والدین اور صفوان بن معطل رضی اللہ عنھم کو جو رنج و غم پہنچا اور مسلسل ایک ماہ تک وہ شدید کرب میں مبتلا رہے، اس کرب پر صبر اور بہتان لگانے والوں سے درگزر کا یقینا اللہ کے ہاں بہت اجر ہے، فرمایا: «اِنَّمَا يُوَفَّى الصّٰبِرُوْنَ اَجْرَهُمْ بِغَيْرِ حِسَابٍ » [ الزمر : ۱۰ ] ’’صرف صبر کرنے والوں ہی کو ان کا اجر کسی شمار کے بغیر دیا جائے گا۔‘‘ حالانکہ رسول اللہ صلی اللہ علیہ وسلم کے ایک اشارے سے تمام بہتان لگانے والوں کی گردنیں تن سے جدا ہو سکتی تھیں۔ اس اجر کے علاوہ براء ت کی آیات نازل ہونے پر ان تمام حضرات کو اتنی ہی خوشی ہوئی جتنا صدمہ پہنچا تھا، چنانچہ رسول اللہ صلی اللہ علیہ وسلم آیات اترنے پر ہنس رہے تھے، اسی طرح عائشہ، ان کے والدین، صفوان بن معطل رضی اللہ عنھم اور تمام مسلمانوں کو درجہ بدرجہ خوشی ہوئی۔ ¤ \n(2) ام المومنین عائشہ رضی اللہ عنھا کو اس واقعہ سے جو عزت ملی امت مسلمہ میں سے کسی کو حاصل نہ ہو سکی کہ ان کی بریت کے لیے قرآن مجید اترا، جو قیامت تک تمام دنیا میں پڑھا جاتا رہے گا اور قرآن نے ان کی جو براء ت بیان فرمائی رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں اور آپ کی وفات کے بعد ام المومنین عائشہ رضی اللہ عنھا کی پاکیزہ زندگی اس کی سچی شہادت ہے کہ وہ ہر بہتان سے پاک ہیں۔ اس سے قرآن کا اعجاز بھی ثابت ہوتا ہے کہ اس کی کوئی پیش گوئی غلط ثابت نہ ہوئی ہے، نہ ہو گی۔ ¤ \n(3) اس واقعہ میں یہ بھی خیر ہے کہ بہتان لگانے والے مخلص مسلمانوں پر حد لگنے سے وہ گناہ سے پاک ہو گئے اور منافقین کا نفاق ظاہر ہو گیا، جس سے آئندہ ان کے نقصانات سے بچنا آسان ہو گیا۔ ¤ \n(4) اس واقعہ سے صحابہ کرام رضی اللہ عنھم کی نیک نفسی اور پاک طینتی بھی ثابت ہوتی ہے کہ مسلسل ایک ماہ کے پروپیگنڈے کے باوجود مخلص مسلمانوں میں سے صرف تین آدمی حسان بن ثابت، مسطح بن اثاثہ اور حمنہ بنت جحش رضی اللہ عنھم اس پروپیگنڈے کا شکار ہوئے، باقی تمام صحابہ اس بدگمانی سے پوری طرح محفوظ رہے۔ ازواج مطہرات میں سے کسی نے عائشہ رضی اللہ عنھا کی بدنامی میں حصہ نہیں لیا، حتیٰ کہ زینب بنت جحش رضی اللہ عنھا نے، جو عائشہ رضی اللہ عنھا کی برابر کی چوٹ تھیں، سوکن ہونے کے باوجود قسم کھا کر عائشہ رضی اللہ عنھا کے پاک ہونے کی شہادت دی۔ ابو ایوب انصاری رضی اللہ عنہ اور ان کی بیوی کا واقعہ بھی، جو آگے آ رہا ہے، صحابہ کے کریم النفس اور پاک طینت ہونے کا زبردست ثبوت ہے۔ ابوبکر رضی اللہ عنہ کا بہتان لگانے کے باوجود مسطح سے حسن سلوک ان کی خشیتِ الٰہی اور صبر کا بہترین نمونہ ہے۔ عائشہ رضی اللہ عنھا کا حسان بن ثابت رضی اللہ عنہ سے بہتان کے باوجود حسن سلوک اور ان کی عزت افزائی کرنا ان کے عالی نفس ہونے کی دلیل ہے۔ ¤ \n(5) اس واقعہ سے یہ بھی ثابت ہوا کہ رسول اللہ صلی اللہ علیہ وسلم عالم الغیب نہیں تھے، ورنہ آپ ایک ماہ تک مسلسل کرب میں مبتلا نہ رہتے۔ اس سے اس غلو کی جڑ کٹ گئی جس میں اس سے پہلے یہود و نصاریٰ مبتلا ہوئے اور جس میں بعض نادان مسلمان بھی مبتلا ہیں۔ ¤ \n(6) اس واقعہ کے نتیجہ میں زنا اور قذف کی حد نازل ہوئی اور قیامت تک کے لیے مسلمان مردوں اور عورتوں کی عصمت و عفت بہتان طرازوں سے محفوظ کر دی گئی اور مسلم معاشرے میں بے حیائی کی اشاعت کا پوری طرح سد باب کر دیا گیا۔ ¤ \n➍ { لِكُلِّ امْرِئٍ مِّنْهُمْ مَّا اكْتَسَبَ مِنَ الْاِثْمِ :} یعنی جس شخص نے اس فتنے میں جتنا حصہ لیا اسی قدر گناہ گار ہوا اور سزا کا مستحق ہوا۔ کسی نے اپنے پاس سے بہتان باندھ کر طوفان اٹھایا، کسی نے بہتان باندھنے والے کی زبانی موافقت کی، کوئی سن کر ہنس دیا، کسی نے خاموشی سے سن لیا، حالانکہ اسے انکار کرنا چاہیے تھا اور کسی نے سنتے ہی کہہ دیا کہ یہ صاف جھوٹ ہے، یہ بات کہنے والوں کو اللہ نے پسند فرمایا، باقی سب کو تھوڑا بہت الزام دیا۔ ¤ \n➎ { وَ الَّذِيْ تَوَلّٰى كِبْرَهٗ مِنْهُمْ لَهٗ عَذَابٌ عَظِيْمٌ :} اس سے مراد رئیس المنافقین عبد اللہ بن ابی ہے، جیسا کہ خود عائشہ رضی اللہ عنھا نے فرمایا ہے اور رسول اللہ صلی اللہ علیہ وسلم نے منبر پر اسی کے متعلق فرمایا کہ اس کی تکلیف مجھے میرے گھر والوں کے متعلق پہنچی ہے، دیکھیے زیر تفسیر آیت کا پہلا فائدہ۔ بعض روایات میں حسان بن ثابت رضی اللہ عنہ کو اس کا ذمہ دار ٹھہرایا گیا ہے، مگر صحیح بات یہی ہے کہ حسان بن ثابت رضی اللہ عنہ کا قصور صرف اتنا تھا کہ انھوں نے سن کر یہ بات آگے کر دی، ورنہ یہ بہتان گھڑنے والا عبد اللہ بن ابی ہی تھا۔ یہی ظالم لوگووں کو جمع کرتا اور نہایت چالاکی سے خود دامن بچا کر دوسروں کے منہ سے کہلوایا کرتا تھا۔ اس کے لیے عذاب عظیم اس لیے کہ دوسرے تمام لوگوں کا گناہ اس کے سرپر بھی تھا، کیونکہ اس نے اس کی ابتدا کی تھی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [مَنْ سَنَّ فِي الإِْسْلَامِ سُنَّةً سَيِّئَةً، كَانَ عَلَيْهِ وِزْرُهَا وَ وِزْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ، مِنْ غَيْرِ أَنْ يَّنْقُصَ مِنْ  أَوْزَارِهِمْ شَيْءٌ] [ مسلم، الزکاۃ، باب الحث علی الصدقۃ ولو بشق تمرۃ… : ۱۰۱۷ ] ’’جو شخص اسلام میں کوئی برا طریقہ جاری کرے اس پر اس کا اپنا گناہ بھی ہو گا اور ان کا گناہ بھی جو اس پر عمل کریں گے، بغیر اس کے کہ ان کے گناہوں میں کوئی کمی ہو۔‘‘ عذاب عظیم کا مطلب یہ ہے کہ اسے توبہ کی توفیق نہیں ہو گی، وہ کفر پر فوت ہو گا اور آخرت کے عذاب میں مبتلا ہو گا، جو {’’اَلدَّرْكُ الْأَسْفَلُ مِنَ النَّارِ‘‘} ہے۔ [ أَعَاذَنَا اللّٰہُ مِنْہُ ] اس میں یہ بھی اشارہ ہے کہ اس جماعت کے دوسرے لوگوں کو توبہ کی توفیق عطا ہو گی۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { لَوْ لَاۤ اِذْ سَمِعْتُمُوْهُ ظَنَّ الْمُؤْمِنُوْنَ وَ الْمُؤْمِنٰتُ بِاَنْفُسِهِمْ خَيْرًا :} بظاہر یوں کہنا چاہیے تھا کہ ’’کیوں نہ جب تم نے اسے سنا تو تم نے اپنے نفسوں میں اچھا گمان کیا‘‘ اس کے بجائے فرمایا : ’’کیوں نہ جب تم نے اسے سنا تو مومن مردوں اور مومن عورتوں نے اپنے نفسوں میں اچھا گمان کیا‘‘ اس کی وجہ یہ ہے کہ اس تہمت کو سچا سمجھنے والے مرد اور عورتیں دونوں تھے، اس لیے دونوں کو متنبہ کرنے کے لیے خاص طور پر ان کے مومن ہونے کا ذکر فرمایا کہ ایمان کا تقاضا یہ ہے کہ کسی تہمت کی وجہ سے کسی مومن کے متعلق اپنے دل میں برا گمان نہ آنے دیا جائے۔ ¤ ➋ اس آیت کے تین مطلب ہو سکتے ہیں، ایک یہ کہ ایسا کیوں نہ ہوا کہ اس بہتان کو سن کر اپنے دلوں میں (عائشہ رضی اللہ عنھا کے متعلق) اچھا گمان کرتے اور کہہ دیتے کہ یہ صریح بہتان ہے۔ دوسرا مطلب یہ کہ ایسا کیوں نہ ہوا کہ اس بہتان کو سن کر مومن مرد اور مومن عورتیں اپنے بارے میں اچھا گمان کرتے۔ یعنی تم اپنے متعلق سوچتے کہ اگر تم اپنی ماں، بہن یا بیٹی کے ساتھ اکیلے ہوتے تو کبھی یہ حرکت کرتے۔ تو تم نے یہ کیسے گمان کر لیا کہ صفوان( رضی اللہ عنہ ) اپنی اور تمام مومنوں کی ماں کے ساتھ ایسا خیال بھی کرے گا، بلکہ کیا تمھارے ایمان کا تقاضا یہ ہے کہ کسی قافلے سے بچھڑی ہوئی کوئی خاتون مل جائے تو اس کے ساتھ ایسی خسیس حرکت کرو۔ یہ وہی شخص سوچ سکتا ہے جس میں ایمان نہ ہو اور انتہائی گندے ذہن کا مالک ہو، وہ دوسرے کو بھی ایسا ہی گندا سمجھے گا جیسا خود گندا ہے۔ پاک باز شخص دوسرے کے متعلق بھی پاک بازی ہی کا گمان کرے گا۔ ¤ تیسرا معنی یہ ہے کہ {’’ بِاَنْفُسِهِمْ ‘‘} سے مراد دوسرے مومن ہیں، کیونکہ تمام مومن ایک جان کی مانند ہیں۔ اللہ تعالیٰ نے فرمایا : «{ وَ لَا تَقْتُلُوْۤا اَنْفُسَكُمْ }» [ النساء: ۲۹ ] ’’اپنے آپ کو قتل نہ کرو۔‘‘ اور فرمایا : «{ فَسَلِّمُوْا عَلٰۤى اَنْفُسِكُمْ }» [ النور : ۶۱ ] ’’اپنے آپ کو سلام کہو۔‘‘ اور فرمایا : «{ وَ لَا تَلْمِزُوْۤا اَنْفُسَكُمْ }» [ الحجرات : ۱۱ ] ’’اور اپنے آپ پر عیب نہ لگاؤ۔‘‘ مراد کسی دوسرے کو قتل کرنا اور ایک دوسرے کو سلام کہنا اور کسی دوسرے پر عیب لگانا ہے۔ یعنی ایسا کیوں نہ ہوا کہ مومن مرد اور مومن عورتیں اپنے بارے میں یعنی دوسرے مومنوں کے بارے میں اچھا گمان کرتے، کیونکہ وہ اور دوسرے مومن ایک ہی ہیں۔ نعمان بن بشیر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ تَرَی الْمُؤْمِنِيْنَ فِيْ تَرَاحُمِهِمْ وَ تَوَادِّهِمْ وَ تَعَاطُفِهِمْ كَمَثَلِ الْجَسَدِ إِذَا اشْتَكٰی عُضْوًا تَدَاعٰی لَهُ سَائِرُ جَسَدِهِ بِالسَّهَرِ وَالْحُمّٰی] [بخاري، الأدب، بباب رحمۃ الناس والبھائم : ۶۰۱۱ ] ’’تم مومنوں کو ایک دوسرے پر رحم، ایک دوسرے کے ساتھ دوستی اور ایک دوسرے پر شفقت کے معاملہ میں ایک جسم کی طرح دیکھو گے کہ جب اس کا ایک عضو بیمار ہو تو اس کی خاطر سارا جسم بخار اور بیداری میں مبتلا ہو جاتا ہے۔‘‘ ¤ ➌ { وَ قَالُوْا هٰذَااِفْكٌ مُّبِيْنٌ :} صاف جھوٹ اور صریح بہتان اس لیے کہ جو کچھ ہوا اس میں شک کی گنجائش ہی نہ تھی، ام المومنین رضی اللہ عنھا دن کے وقت عین دوپہر کی روشنی میں صفوان بن معطل رضی اللہ عنہ کی سواری پر آ رہی ہیں۔ صفوان مہار پکڑے ہوئے ہیں، پورا لشکر آپ کو دیکھ رہا ہے، رسول اللہ صلی اللہ علیہ وسلم بنفس نفیس موجود ہیں۔ اگر (بالفرض) شک والی کوئی بات ہوتی تو وہ چھپ چھپا کر آتے، اکٹھے آنے کی جرأت نہ کرتے اور دن کے بجائے رات کو آتے، جیسا کہ یوسف علیہ السلام کے بھائی رات کو آئے تھے، فرمایا : « وَ جَآءُوْۤ اَبَاهُمْ عِشَآءً يَّبْكُوْنَ » [ یوسف : ۱۶ ] ’’اور وہ اپنے باپ کے پاس اندھیرا پڑے روتے ہوئے آئے۔‘‘ اس لیے یہ بات واضح تھی کہ ام المومنین رضی اللہ عنھا پر جو الزام لگایا گیا صاف جھوٹ اور صریح بہتان ہے اور ایمان والے ہر مرد اور عورت کو یہی کہنا لازم ہے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) { لَوْ لَا جَآءُوْ عَلَيْهِ بِاَرْبَعَةِ شُهَدَآءَ … :} ام المومنین عائشہ رضی اللہ عنھا پر بہتان لگانے والوں کے متعلق فرمایا کہ وہ اس دعویٰ پر چار گواہ کیوں نہیں لائے، تو جب وہ اس کے گواہ نہیں لائے تو وہی اللہ کے ہاں کامل جھوٹے ہیں۔ ابن عاشور نے اس کی تفسیر اس طرح فرمائی ہے : ’’مطلب یہ ہے کہ جو شخص دیکھے بغیر کوئی خبر دے اسے لازم ہے کہ وہ مشاہدہ کرنے والے کا حوالہ دے اور وہ مشاہدہ کرنے والے اتنی تعداد میں ہونے ضروری ہیں کہ اس قسم کے واقعہ میں اتنی تعداد سے سچ کا یقین حاصل ہو جائے۔ (یہ تعداد زنا کے لیے کم از کم چار ہے) اب ان لوگوں نے جو اُمّ المومنین پر تہمت باندھی تو ان میں سے کسی نے بھی نہ دیکھا اور نہ اتنی تعداد میں دیکھنے والے پیش کیے جس سے کسی پر زنا کا جرم ثابت ہوتا ہے، بلکہ محض خیال اور گمان سے تہمت لگا دی، اس لیے اللہ کے نزدیک وہی جھوٹے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيْثِ ] [ بخاري، الأدب، باب : « یأیھا الذین آمنوا اجتنبوا…» : ۶۰۶۶ ] ’’(برے) گمان سے بچو، کیونکہ (برا) گمان سب سے زیادہ جھوٹی بات ہے۔‘‘ {’’ فَاُولٰٓىِٕكَ ‘‘} کی تاکید {’’ هُمْ ‘‘} کے ساتھ کرنے اور خبر {’’ الْكٰذِبُوْنَ ‘‘} پر الف لام لانے سے کلام میں حصر پیدا ہو گیا، جس سے مراد ان کے جھوٹا ہونے میں مبالغہ ہے۔ گویا وہ اتنے کامل جھوٹے ہیں کہ ان کے مقابلے میں کوئی اور جھوٹا ہے ہی نہیں۔ ’’اللہ کے ہاں جھوٹے‘‘ سے مقصود ان کے حقیقی جھوٹا ہونے کا بیان ہے، کیونکہ اللہ کا علم کبھی خلاف واقعہ نہیں ہو سکتا۔ رہا یہ مسئلہ کہ کوئی شخص اگر چار گواہ زنا کے ثبوت کے لیے پیش نہ کر سکے تو ممکن ہے وہ سچ ہی کہہ رہا ہو، مگر شرعی فیصلہ ظاہر کے مطابق ہو گا اور اسے جھوٹا قرار دے کر اس پر قذف کی حد نافذ کی جائے گی، تو اس آیت کا یہ مطلب نہیں (اگرچہ دوسرے دلائل سے یہ بات درست ہے)۔‘‘ [ التحریر والتنویر ]"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) {وَ لَوْ لَا فَضْلُ اللّٰهِ عَلَيْكُمْ وَ رَحْمَتُهٗ … :} یعنی اگر دنیا میں تم پر اللہ کا فضل نہ ہوتا کہ اس نے تمھیں دنیا میں بے شمار نعمتیں دی ہیں، جن میں سے ایک یہ ہے کہ گناہ پر فوراً مؤاخذہ کے بجائے وہ مہلت دیتا ہے اور اگر آخرت میں اس کا فضل نہ ہوتا کہ وہ توبہ قبول کرتا ہے اور گناہ بخش دیتا ہے، تو تم جس کام (بہتان) میں مشغول ہوئے تھے اس کی وجہ سے تمھیں بہت بڑا عذاب ا ٓلیتا۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { اِذْ تَلَقَّوْنَهٗ بِاَلْسِنَتِكُمْ: ’’ تَلَقّٰي يَتَلَقّٰي‘‘} (تفعّل) کسی سے کوئی چیز لینا، جیسے فرمایا : «{ فَتَلَقّٰۤى اٰدَمُ مِنْ رَّبِّهٖ كَلِمٰتٍ }» [البقرۃ : ۳۷ ] ’’پھر آدم نے اپنے رب سے چند کلمات سیکھ لیے۔‘‘ یعنی جب تم اس بہتان کو ایک دوسرے سے لے کر آگے بیان کرتے تھے کہ میں نے فلاں سے یوں سنا، فلاں نے یہ کہا وغیرہ۔ ¤ ➋ { وَ تَقُوْلُوْنَ بِاَفْوَاهِكُمْ :} یعنی یہ صرف تمھارے مونہوں کی بات تھی، نہ تمھارے دل میں اس کا یقین تھا نہ سننے والے کو یقین ہو سکتا تھا، جیسا کہ منافقین کے متعلق فرمایا : «{ يَقُوْلُوْنَ بِاَفْوَاهِهِمْ مَّا لَيْسَ فِيْ قُلُوْبِهِمْ }» [ آل عمران : ۱۶۷ ] ’’اپنے مونہوں سے وہ باتیں کہتے ہیں جو ان کے دلوں میں نہیں۔‘‘ ¤ ➌ { مَا لَيْسَ لَكُمْ بِهٖ عِلْمٌ : ’’ عِلْمٌ ‘‘} پر تنوین تنکییر کے لیے ہے، یعنی تم اپنے مونہوں سے وہ بات کہہ رہے تھے جس کا تمھیں کچھ علم نہ تھا۔ ¤ ➍ { وَ تَحْسَبُوْنَهٗ هَيِّنًا :} تم اسے معمولی سمجھتے تھے، جس کی دلیل یہ ہے کہ تم اسے ایک دوسرے سے لے کر آگے بیان کرتے تھے، یا کم از کم اس پر خاموش رہتے تھے، کیونکہ اگر تم اسے معمولی نہ سمجھتے تو سختی سے اس کا انکار کرتے اور ایسی بات کرنے والے کو ٹوکتے۔ ¤ ➎ { وَ هُوَ عِنْدَ اللّٰهِ عَظِيْمٌ :} حالانکہ بہتان کسی پر بھی ہو، اللہ کے ہاں بہت بڑا گناہ ہے، تو جب وہ ام المومنین پر ہو، جو خاتم الانبیاء، سید المرسلین اور سید ولد آدم صلی اللہ علیہ وسلم کی بیوی ہے تو کتنا بڑا گناہ ہو گا۔ رازی نے فرمایا کہ اللہ تعالیٰ نے انھیں تین گناہوں کا مرتکب قرار دیا اور اس پر عذاب عظیم کے خطرے سے آگاہ فرمایا۔ پہلا گناہ یہ کہ ایک دوسرے سے سن کر اسے پھیلانا برائی کی اشاعت ہے، جو بہت بڑا گناہ ہے۔ دوسرا گناہ وہ بات کرنا ہے جس کا علم نہیں، اس سے معلوم ہوا کہ وہی بات کرنی چاہیے جس کا علم ہو، ایسی بات کرنا جس کے سچا ہونے کا علم نہ ہو اسی طرح حرام ہے جیسے وہ بات کرنا حرام ہے جس کے جھوٹا ہونے کا علم ہو، جیسا کہ فرمایا : «{ وَ لَا تَقْفُ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ }» [ بني إسرائیل : ۳۶ ] ’’اور اس چیز کا پیچھا نہ کر جس کا تجھے کوئی علم نہیں۔‘‘ اور نبی صلی اللہ علیہ وسلم نے فرمایا : [ كَفٰي بِالْمَرْءِ كَذِبًا أَنْ يُّحَدِّثَ بِكُلِّ مَا سَمِعَ ] [ مسلم، المقدمۃ : ۵ ] ’’آدمی کو جھوٹا ہونے کے لیے یہی کافی ہے کہ وہ ہر بات جو سنے آگے بیان کر دے۔‘‘ تیسرا گناہ یہ کہ وہ اسے معمولی سمجھتے تھے، حالانکہ یہ بہت بڑا گناہ ہے۔ ¤ ➏ اس آیت سے معلوم ہوا کہ کسی شخص کے کسی گناہ کو معمولی سمجھنے سے وہ معمولی نہیں ہوتا، بلکہ عین ممکن ہے کہ وہ اس کی دنیا و آخرت کی بربادی کا باعث بن جائے، جب وہ اسے معمولی سمجھ کر بار بار اس کا ارتکاب کرتا رہے۔ ابوہریرہ رضی اللہ عنہ بیان فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ  مِنْ رِضْوَانِ اللّٰهِ لَا يُلْقِيْ لَهَا بَالًا يَرْفَعُ اللّٰهُ بِهَا دَرَجَاتٍ وَ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ سَخَطِ اللّٰهِ لَا يُلْقِيْ لَهَا بَالًا يَهْوِيْ بِهَا فِيْ جَهَنَّمَ ] [ بخاري، الرقاق، باب حفظ اللسان : ۶۴۷۸ ] ’’بندہ اللہ تعالیٰ کی رضا کی بات کرتا ہے، جس کی طرف وہ خیال بھی نہیں کرتا، لیکن اللہ تعالیٰ اس بات کے ساتھ اسے بہت سے درجے بلند کر دیتا ہے اور بندہ اللہ تعالیٰ کی ناراضی کی بات کرتا ہے، جس کی طرف وہ خیال بھی نہیں کرتا، لیکن اس کے ساتھ وہ جہنم میں گر جاتا ہے۔‘‘"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) { وَ لَوْ لَاۤ اِذْ سَمِعْتُمُوْهُ قُلْتُمْ …:} اس سے پہلے آیت (۱۳) میں یہ ادب سکھایا تھا کہ جب اچھے لوگوں کے بارے میں کوئی نامناسب بات سنی جائے تو ان کے متعلق اچھا گمان رکھنا لازم ہے۔ اب اس کے متعلق دوسرا ادب بیان فرمایا کہ اگر کوشش کے باوجود کوئی وسوسہ یا خیال دل میں آ جائے تو اسے زبان پر ہر گز نہ لائے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : [ إِنَّ اللّٰهَ تَجَاوَزَ لِأُمَّتِيْ عَمَّا وَسْوَسَتْ أَوْ حَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ تَعْمَلْ بِهِ أَوْ تَكَلَّمْ ] [ بخاري، الأیمان والنذور، باب إذا حنث ناسیا … : ۶۶۶۴، عن أبي ھریرۃ رضی اللہ عنہ ] ’’اللہ تعالیٰ نے میری امت کے لیے ان باتوں سے درگزر فرمایا ہے جو وہ اپنے دل میں کریں، جب تک وہ اسے قول یا عمل میں نہ لائیں۔‘‘ یعنی جب تم نے یہ بات سنی تو بجائے اس کے کہ اس پر خاموش رہتے، یا اس پر یقین کرتے، یا اسے آگے پھیلاتے، تم نے سنتے ہی یہ کیوں نہ کہا کہ ہمارا حق نہیں کہ ہم یہ بات زبان پر لائیں، بلکہ ایسی بات سے اپنی شدید نفرت کے اظہار کے لیے ساتھ ہی یہ بھی کہنا تھا : « سُبْحٰنَكَ هٰذَا بُهْتَانٌ عَظِيْمٌ » تو پاک ہے کہ تیرے نبی کی بیوی بدکاری کے ارتکاب سے آلودہ ہو، یہ بہت بڑا بہتان ہے۔ کیونکہ ممکن ہی نہیں کہ نبی کی بیوی بدکار ہو، وہ کافر تو ہو سکتی ہے، بدکار نہیں، کیونکہ انبیاء کفار کی طرف مبعوث ہوتے ہیں تو ضروری ہے کہ جو چیز کفار کے نزدیک قابل نفرت ہو وہ اس سے پاک ہوں اور ظاہر ہے کہ عورت کی بدکاری ان کے نزدیک بھی قابل نفرت ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) { يَعِظُكُمُ اللّٰهُ اَنْ تَعُوْدُوْا لِمِثْلِهٖۤ …:’’ يَعِظُكُمْ‘‘} کے ضمن میں {’’ يَنْهَاكُمْ‘‘} کا معنی موجود ہے، یعنی اللہ تعالیٰ تمھیں اس سے منع کرتا ہے کہ دوبارہ کبھی ایسا کام کرو، اگر تم مومن ہو، یعنی یہ کام ایمان کے منافی ہے جس کا تم دعویٰ کرتے ہو۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) { وَ يُبَيِّنُ اللّٰهُ لَكُمُ الْاٰيٰتِ …:} آیات کو کھول کر بیان کرنے کے ساتھ علیم و حکیم کی مناسبت ظاہر ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { اِنَّ الَّذِيْنَ يُحِبُّوْنَ اَنْ تَشِيْعَ الْفَاحِشَةُ … : ’’ الْفَاحِشَةُ ‘‘} اننتہائی برے کام کو کہتے ہیں، یہ لفظ زنا پر بھی بولا جاتا ہے اور اس کی تہمت اور چرچے پر بھی۔ یعنی جو لوگ ایمان والوں میں بے حیائی اور بدکاری کا تذکرہ پھیلانا چاہتے ہیں اور پاک دامن مسلمانوں پر تہمتیں تراش کر مجلسوں میں ان کا چرچا کرتے ہیں، جس کے سننے سے زنا سے نفرت ختم ہوتی ہے، بلکہ ایسی باتوں میں دلچسپی کے نتیجے میں یہ برائی مزید پھیلتی ہے اور اس کا ذکر کرنے والے اور اسے خاموشی سے سن کر تہمت تراشنے والوں کی حوصلہ افزائی کرنے والے، عفیف مسلمانوں کے گوشت سے لذت اٹھاتے ہیں۔ ان کے لیے دنیا میں عذابِ الیم ہے کہ تہمت لگانے والوں کو درّے پڑتے ہیں اور وہ مردود الشہادہ اور فاسق ٹھہرتے اور ان کا اور ان کے مجلس نشینوں کا نفاق اور فسق مسلمانوں کے سامنے بے نقاب ہو جاتا ہے، جس سے وہ مسلم معاشرے میں بے اعتبار ٹھہرتے ہیں اور آخرت کے عذاب کے المناک ہونے کی کوئی حد ہی نہیں۔ ¤ ➋ آج کل تمام دنیا کے کفار اور ان کے مددگار مسلم حکمرانوں کی پوری کوشش ہے کہ ریڈیو، اخبارات، ٹیلی ویژن، انٹرنیٹ، سکول و کالج کی تعلیم، غرض ہر طریقے سے مسلم معاشروں میں زنا اور اس کا تذکرہ عام ہو۔ ایک آدھ ملک کے سوا کسی ملک میں نہ زنا کی حد نافذ ہے نہ بہتان کی۔ نتیجہ اس کا دشمنوں کے خوف، قتل و غارت، بدامنی، وباؤں اور نئی سے نئی بیماریوں کے عذابِ الیم کی صورت میں سب کے سامنے ہے اور قیامت کا عذابِ الیم ابھی باقی ہے۔ اللہ تعالیٰ ہم سب کو توبہ کرنے کی توفیق عطا فرمائے۔ (آمین) ¤ ➌ { وَ اللّٰهُ يَعْلَمُ وَ اَنْتُمْ لَا تَعْلَمُوْنَ:} یعنی زنا کی حد اور بہتان کی حد جو اللہ نے مقرر فرمائی ہے اور ایمان والوں میں بے حیائی پھیلانے والوں کے لیے دنیا اور آخرت میں جو عذابِ الیم رکھا ہے، سو اس کی وجہ یہ ہے کہ ’’اللہ تعالیٰ ہر بات جانتا ہے‘‘، اسے ان گناہوں کے خوفناک نتائج کا بھی علم ہے اور یہ بھی کہ انھیں کیسے روکا جا سکتا ہے۔ ’’اور تم نہیں جانتے‘‘ لہٰذا تم اپنی عقل سے جو بھی قاعدہ و قانون مقرر کرو گے وہ تمھاری لاعلمی کی وجہ سے کبھی بھی مسلمانوں کی پاک دامنی اور ان کی عزت و آبرو کی حفاظت کا ضامن نہیں بن سکتا۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) { وَ لَوْ لَا فَضْلُ اللّٰهِ عَلَيْكُمْ وَ رَحْمَتُهٗ …:} اس کا جواب محذوف ہے ’’تو تمھیں توبہ کا موقع ہی نہ ملتا اور فوراً اللہ کا عذاب تمھیں اپنی گرفت میں لے لیتا، یہ محض اس کا فضل و رحمت اور اس کا رؤف و رحیم ہونا ہے کہ اس نے تمھیں توبہ کا موقع دیا اور حد کے ذریعے سے تمھیں پاک کرنے کا اہتمام فرمایا۔‘‘"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّبِعُوْا خُطُوٰتِ الشَّيْطٰنِ… : ’’ خُطُوٰتِ الشَّيْطٰنِ ‘‘} كی وضاحت کے لیے دیکھیے سورۂ بقرہ کی آیت (۱۶۸) اور {’’ بِالْفَحْشَآءِ وَ الْمُنْكَرِ ‘‘} کی تفصیل کے لیے دیکھیے سورۂ نحل کی آیت (۹۰) پہلے فرمایا : «{ لَا تَتَّبِعُوْا خُطُوٰتِ الشَّيْطٰنِ }» پھر {’’ الشَّيْطٰنِ ‘‘} کے لیے ضمیر لا کر {’’وَ مَنْ يَّتَّبِعْ خُطُوَاتِهِ‘‘} کہنے کے بجائے دوبارہ نام لے کر فرمایا : « وَ مَنْ يَّتَّبِعْ خُطُوٰتِ الشَّيْطٰنِ » مراد توجہ دلانا ہے کہ آدمی سوچے کہ میں کس کی پیروی کر رہا ہوں۔ ¤ ➋ { وَ لَوْ لَا فَضْلُ اللّٰهِ عَلَيْكُمْ وَ رَحْمَتُهٗ …:} اس آیت سے معلوم ہوا کہ کوئی بھی شخص کسی طرح بھی اپنے آپ کو پاک نہیں رکھ سکتا، نہ پاک کر سکتا ہے۔ اگر انسان کو اس کی حالت پر چھوڑ دیا جائے تو کوئی انسان بھی پاک نہ رہ سکے، کیونکہ شیطان اور اس کے لشکر اسے گمراہ کرنے پر تلے ہوئے ہیں اور ’’فحشاء‘‘ اور ’’منکر‘‘ کو خوش نما بنا کر اس کے سامنے پیش کرتے رہتے ہیں، نفس امارہ ان کی طرف مائل ہے اور ان کا حکم دیتا ہے ۔انسان کمزور پیدا کیا گیا ہے، یہ اللہ کا فضل اور اس کی رحمت ہی ہے جس کی بدولت کوئی شخص گناہوں سے پاک رہتا ہے، یا گناہ کے بعد توبہ کے ساتھ پاک ہوتا ہے۔ اس مفہوم کی آیات کے لیے دیکھیے سورۂ نساء (۱۶، ۱۷) اور سورۂ نجم (۳۲)۔ ¤ ➌ اس مقام پر ان الفاظ سے مقصد یہ معلوم ہوتا ہے کہ جو لوگ مذکورہ واقعۂ افک میں ملوث ہونے سے بچ گئے، یہ محض اللہ کا فضل و کرم ہے جو ان پر ہوا، ورنہ وہ بھی اسی رو میں بہ جاتے جس میں بعض مسلمان بہ گئے تھے۔ اس لیے شیطان کے مکر و فریب سے بچنے کے لیے ایک تو ہر وقت اللہ سے مدد طلب کرتے رہو اور اس کی طرف رجوع کرتے رہو اور دوسرے جو لوگ اپنے نفس کی کمزوری سے شیطان کے فریب کا شکار ہو گئے ان کو زیادہ ہدف ملامت نہ بناؤ، بلکہ خیر خواہانہ طریقے سے ان کی اصلاح کرو۔ ¤ ➍ { وَّ لٰكِنَّ اللّٰهَ يُزَكِّيْ مَنْ يَّشَآءُ وَ اللّٰهُ سَمِيْعٌ عَلِيْمٌ :} یعنی اللہ تعالیٰ جسے چاہتا ہے پاک کرتا ہے، مگر اس کی مشیت اندھی نہیں، بلکہ وہ سب کچھ سننے والا، سب کچھ جاننے والا ہے۔ اپنے اس علم ہی کی وجہ سے جسے پاک کرنے کے لائق جانتا ہے پاک کر دیتا ہے، جیسا کہ فرمایا : «{ اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ وَ لٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَآءُ وَ هُوَ اَعْلَمُ بِالْمُهْتَدِيْنَ }» [ القصص : ۵۶ ] ’’بے شک تو ہدایت نہیں دیتا جسے تو دوست رکھے اور لیکن اللہ ہدایت دیتا ہے جسے چاہتا ہے اور وہ ہدایت پانے والوں کو زیادہ جاننے والا ہے۔‘‘"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {وَ لَا يَاْتَلِ اُولُوا الْفَضْلِ مِنْكُمْ وَ السَّعَةِ … : ’’ وَ لَا يَاْتَلِ ‘‘ ’’ أَلِيَّةٌ ‘‘} (بروزن {فَعِيْلَةٌ،} بمعنی قسم) میں سے باب افتعال {’’اِئْتَلٰي يَأْتَلِيْ‘‘} میں سے نہی غائب ہے۔ سورۂ بقرہ کی آیت (۲۲۶) : «{ لِلَّذِيْنَ يُؤْلُوْنَ مِنْ نِّسَآىِٕهِمْ }» میں {’’ يُؤْلُوْنَ ‘‘} باب افعال میں سے ہے۔ سورۂ نور کی آیت (۱۱) میں صحیح بخاری کی حدیث (۴۷۵۰) گزر چکی ہے کہ عائشہ رضی اللہ عنھا پر بہتان لگانے والوں میں مسطح بن اثاثہ رضی اللہ عنہ بھی تھے، جو ابوبکر رضی اللہ عنہ کی خالہ زاد بہن کے بیٹے تھے (بعض نے انھیں خالہ زاد بھی کہا ہے)، ابوبکر رضی اللہ عنہ نے ان سے قرابت اور ان کے فقر کی وجہ سے ان کا وظیفہ مقرر کر رکھا تھا، جب مسطح نے یہ بات کی تو ابوبکر رضی اللہ عنہ نے وہ وظیفہ بند کر دیا، لیکن جب یہ آیت اتری اور اس میں یہ الفاظ آئے : «{ اَلَا تُحِبُّوْنَ اَنْ يَّغْفِرَ اللّٰهُ لَكُمْ }» ’’کیا تم پسند نہیں کرتے کہ اللہ تمھیں بخشے؟‘‘ تو ابوبکر رضی اللہ عنہ نے کہا، کیونکہ نہیں، میں تو پسند کرتا ہوں کہ اللہ تعالیٰ مجھے بخش دے۔ چنانچہ انھوں نے وہ وظیفہ دوبارہ جاری کر دیا اور کہا، میں اس میں کبھی کمی نہیں کروں گا۔ ¤ ➋ پچھلی آیت میں فرمایا تھا کہ اللہ تعالیٰ جسے چاہتا ہے پاک کرتا ہے تو اگر اہلِ افک اس گناہ میں مبتلا ہوئے ہیں اور تم اس سے محفوظ رہے ہو تو اس میں تمھارا کچھ کمال نہیں، یہ محض اللہ کا فضل اور اس کی رحمت ہے، اس لیے جب بہتان لگانے والے تائب ہو چکے، انھیں اس کی سزا بھی مل چکی تو ان کی غلطی ہی پر نظر نہ رکھو، بلکہ ان سے حُسن سلوک کے اسباب پر بھی نگاہ رکھو، جن میں سے ہر سبب کا تقاضا ہے کہ اللہ تعالیٰ نے جو تمھیں برتری اور وسعت دی ہے اس میں سے انھیں بھی دیتے رہو۔ ان حُسن سلوک کے اسباب میں سے ایک سبب قرابت دار ہونا ہے، دوسرا مسکین اور تیسرا مہاجر فی سبیل اللہ ہونا ہے۔ تینوں سبب جمع ہیں تو ان کا حق انھیں بالاولیٰ دینا چاہیے۔ ¤ ➌ اس آیت سے معلوم ہوا کہ مرتد ہونے کے سوا دوسرے گناہوں سے کسی شخص کے اعمال صالحہ بالکل ختم نہیں ہو جاتے، کیونکہ اللہ تعالیٰ نے بہتان لگانے کے باوجود اہل افک میں سے مہاجرین کی ہجرت کی قدر افزائی فرمائی ہے اور ان کے ساتھ حسن سلوک کا حکم دیا ہے ۔ ¤ ➍ {وَ لْيَعْفُوْا وَ لْيَصْفَحُوْا:’’ وَ لْيَعْفُوْا ‘‘ ’’عَفَا يَعْفُوْ‘‘} کا معنی مٹانا ہے، کہا جاتا ہے : {’’عَفَتِ الرِّيْحُ الْأَثَرَ‘‘} ’’ہوا نے قدموں کا نشان مٹا دیا۔‘‘ یعنی ان کی لغزش کا خیال دل سے مٹا دیں اور اس پر پردہ ڈال دیں۔ {’’ وَ لْيَصْفَحُوْا ‘‘} بعض اہل علم نے فرمایا کہ یہ {’’صَفْحَةُ الْعُنُقِ‘‘} (گردن کا کنارہ) سے مشتق ہے، یعنی ان کے برے سلوک سے اس طرح درگزر کرو جیسے تم نے ان سے گردن کا کنارا پھیر لیا ہے۔ عفو و درگزر کا یہ حکم سورۂ آل عمران (۱۳۴)، نساء (۱۴۹)، حجر (۸۵)، شوریٰ (۴۳) اور دیگر کئی آیات میں آیا ہے۔ (اضواء البیان) ¤ ➎ { اَلَا تُحِبُّوْنَ اَنْ يَّغْفِرَ اللّٰهُ لَكُمْ:} اس کی شان نزول اوپر بیان ہو چکی ہے۔ اس سے معلوم ہوا کہ گناہ گار مسلم کو معاف کرنا اور اس سے درگزر کرنا گناہوں کی معافی کا ذریعہ ہے۔ تم بخشو گے تو اللہ تعالیٰ تمھیں بخشے گا، تم درگزر کر وگے تو اللہ تعالیٰ تم سے درگزر فرمائے گا، جیسا عمل کرو گے ویسی جزا پاؤ گے۔ ¤ ➏ یہ آیت دلیل ہے کہ نیکی نہ کرنے کی قسم کھانا جائز نہیں، ایسی قسم کا کفارہ دے کر وہ نیکی کر لینی چاہیے۔ اسی طرح اگر قسم کا پورا نہ کرنا بہتر ہو تو اس کا بھی کفارہ دے کر بہتر کام کرنا چاہیے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ حَلَفَ عَلٰی يَمِيْنٍ فَرَأَی غَيْرَهَا خَيْرًا مِّنْهَا فَلْيُكَفِّرْ عَنْ يَّمِيْنِهِ وَلْيَفْعَلْ ] [ ترمذي،، النذور والأیمان، باب ما جاء في الکفارۃ قبل الحنث : ۱۵۳۰، و قال الألباني صحیح ]’’جو شخص کسی کام پر قسم کھائے، پھر اس کے علاوہ کو بہتر سمجھے تو اسے چاہیے کہ اپنی قسم کا کفارہ دے دے اور (بہتر کام) کر لے۔‘‘"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ {اِنَّ الَّذِيْنَ يَرْمُوْنَ الْمُحْصَنٰتِ الْغٰفِلٰتِ …: ’’ الْغٰفِلٰتِ ‘‘} (بے خبر) سے مراد وہ سیدھی سادی شریف عورتیں ہیں جن کے دل پاک ہیں اور ان کے دل میں بدچلنی کا بھولے سے بھی خیال نہیں آتا، ان میں سے کسی پر تہمت لگانا کبیرہ گناہ اور لعنت کا باعث ہے۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اِجْتَنِبُوا السَّبْعَ الْمُوْبِقَاتِ، قَالُوْا يَا رَسُوْلَ اللّٰهِ! وَمَا هُنَّ؟ قَالَ الشِّرْكُ بِاللّٰهِ وَالسِّحْرُ وَ قَتْلُ النَّفْسِ الَّتِيْ حَرَّمَ اللّٰهُ  إِلَّا بِالْحَقِّ وَ أَكْلُ الرِّبَا وَ أَكْلُ مَالِ الْيَتِيْمِ وَالتَّوَلِّيْ يَوْمَ الزَّحْفِ وَ قَذْفُ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ الْغَافِلاَتِ ] [ بخاري، الحدود، باب رمي المحصنات : ۶۸۵۷ ] ’’سات ہلاک کر دینے والی چیزوں سے بچو۔‘‘ صحابہ نے پوچھا : ’’یا رسول اللہ! وہ ہلاک کرنے والی چیزیں کیا ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ کے ساتھ شرک، جادو، اس جان کو قتل کرنا جسے اللہ نے حرام کیا ہے مگر حق کے ساتھ، سود کھانا، یتیم کا مال کھانا، جنگ کے دن بھاگ جانا اور پاک دامن مومن و غافل عورتوں پر تہمت لگانا۔‘‘ یہاں جب عام پاک دامن غافل و مومن عورتوں پر تہمت لگانا لعنت کا باعث ہے تو امہات المومنین خصوصاً عائشہ رضی اللہ عنھا کے بارے میں بدزبانی کرنے والے کا کیا حال ہو گا، جن کی براء ت خود اللہ تعالیٰ نے بیان فرمائی۔ اب ان پر تہمت لگانے والا صرف تہمت کا مجرم نہیں بلکہ قرآن کو جھٹلانے کا بھی مجرم ہے اور قرآن کو جھٹلانے والا کافر ہے۔ ¤ ➋ یہاں پاک دامن غافل و مومن عورتوں پر بہتان کی جتنی شدید وعید آئی ہے وہ عموماً کفار ہی کے لیے ہے کہ دنیا و آخرت میں ان پر لعنت ہے اور ان کے لیے عذاب عظیم ہے، جو جہنم ہی ہو سکتا ہے اور قیامت کے دن ان کے اعضا ان کے خلاف گواہی دیں گے، جو کفار کے ساتھ کیا جانے والا معاملہ ہے، جیسا کہ سورۂ حٰم سجدہ (۱۹ تا ۲۳) میں ہے، اس لیے اکثر مفسرین کا کہنا ہے کہ {’’ اِنَّ الَّذِيْنَ يَرْمُوْنَ الْمُحْصَنٰتِ … ‘‘} سے مراد عبد اللہ بن ابی اور اس کے منافق ساتھی ہیں اور {’’ الْمُحْصَنٰتِ الْغٰفِلٰتِ الْمُؤْمِنٰتِ ‘‘} سے مراد امہات المومنین خصوصاً عائشہ صدیقہ رضی اللہ عنھن ہیں۔ {’’ اِنَّ الَّذِيْنَ جَآءُوْ بِالْاِفْكِ ‘‘} سے لے کر تمام آیات کے تسلسل سے یہ معنی درست معلوم ہوتا ہے، مگر آیت کے الفاظ عام ہونے کی وجہ سے (کہ جو لوگ بھی پاک دامن غافل و مومن عورتوں پر تہمت لگاتے ہیں، وہ عورتیں جو بھی ہوں، ان کے لیے یہ وعید ہے) اگر مراد عام ہو کہ ہر تہمت لگانے والے کے لیے یہ وعید ہے تو اس سے مراد وہ تہمت لگانے والے ہوں گے جو تہمت لگانے کو حلال سمجھتے ہیں، یا جنھوں نے توبہ نہیں کی، کیونکہ اس سے پہلی آیات میں توبہ کرنے والوں کے ساتھ حسن سلوک کا اور ان کی سابقہ نیکیاں پیشِ نظر رکھنے کا حکم ہے۔ اس آیت میں یہ بھی اشارہ ہے کہ قذف سے توبہ نہ کرنے والوں کی موت کفر پر ہونے کا خطرہ ہے۔ اللہ سب مسلمانوں کو محفوظ رکھے۔ ¤ ➌ یہاں ایک مشہور سوال ہے کہ یہ ساری وعید پاک دامن غافل و مومن عورتوں پر بہتان کی آئی ہے، مردوں پر بہتان کا ذکر کیوں نہیں فرمایا؟ جواب اس کا یہ ہے کہ {’’ الْمُحْصَنٰتِ الْغٰفِلٰتِ الْمُؤْمِنٰتِ ‘‘} پر بہتان عموماً کسی مومن مرد کے ساتھ ہی لگایا جائے گا، اس لیے اسے الگ سے ذکر نہیں کیا گیا۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { يَوْمَ تَشْهَدُ عَلَيْهِمْ اَلْسِنَتُهُمْ … :} اس کی تفصیل کے لیے دیکھیے سورۂ یٰسٓ (۶۵) اور سورۂ حٰم السجدہ (۱۹ تا ۲۱) یعنی ان کے یہ اعضا ان کے خلاف تہمت لگانے اور دوسرے برے اعمال کی گواہی دیں گے۔ انس بن مالک رضی اللہ عنہ فرماتے ہیں : [ كُنَّا عِنْدَ رَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ فَضَحِكَ فَقَالَ هَلْ تَدْرُوْنَ مِمَّا أَضْحَكُ؟ قَالَ قُلْننَا اللّٰهُ وَ رَسُوْلُهُ أَعْلَمُ، قَالَ مِنْ مُخَاطَبَةِ الْعَبْدِ رَبَّهُ، يَقُوْلُ يَا رَبِّ! أَلَمْ تُجِرْنِيْ مِنَ الظُّلْمِ؟ قَالَ يَقُوْلُ بَلٰی، قَالَ فَيَقُوْلُ فَإِنِّيْ لَا أُجِيْزُ عَلٰی نَفْسِيْ إِلَّا شَاهِدًا مِنِّيْ، قَالَ فَيَقُوْلُ كَفٰی بِنَفْسِكَ الْيَوْمَ عَلَيْكَ شَهِيْدًا، وَ بِالْكِررَامِ الْكَاتِبِيْنَ شُهُوْدًا، قَالَ : فَيُخْتَمُ عَلٰی فِيْهِ، فَيُقَالُ لِأَرْكَانِهِ انْطِقِيْ، قَالَ فَتَنْطِقُ بِأَعْمَالِهِ، قَالَ ثُمَّ يُخَلّٰی بَيْنَهُ وَ بَيْنَ الْكَلَامِ، قَالَ فَيَقُوْلُ بُعْدًا لَكُنَّ وَ سُحْقًا، فَعَنْكُنَّ كُنْتُ أُنَاضِلُ] [مسلم،، الزھد، باب الدنیا سجن للمؤمن … : ۲۹۶۹ ] ’’ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے، آپ صلی اللہ علیہ وسلم ہنسے اور فرمایا : ’’کیا تم جانتے ہو میں کس بات پر ہنسا ہوں؟‘‘ ہم نے کہا : ’’اللہ اور اس کا رسول بہتر جانتے ہیں۔‘‘ فرمایا : ’’بندے کی اپنے رب کے ساتھ گفتگو پر، وہ کہے گا : ’’اے میرے رب! کیا تو نے مجھے ظلم سے پناہ نہیں دی؟‘‘ اللہ فرمائے گا : ’’کیوں نہیں!‘‘ تو وہ کہے گا : ’’پھر میں اپنی ذات پر اپنے سوا کسی گواہ کو نہیں مانتا۔‘‘ اللہ فرمائے گا : ’’آج تجھ پر تو خود ہی کافی گواہ ہے اور کراماً کاتبین گواہ کافی ہیں۔‘‘ چنانچہ اس کے منہ پر مہر کر دی جائے گی اور اس کے اعضا سے کہا جائے گا، بولو ! چنانچہ وہ بول کر اس کے اعمال بتائیں گے۔ پھر اسے بات کرنے کی اجازت دی جائے گی تو وہ اپنے اعضا سے کہے گا : ’’تمھارے لیے دوری اور ہلاکت ہو، میں تمھاری طرف ہی سے تو دفاع کر رہا تھا۔‘‘ ¤ ➋ زبان اگرچہ دنیا میں بھی بولتی ہے مگر یہاں بندے کی مرضی کے مطابق بولتی ہے، کیونکہ اسے اللہ کا حکم یہی ہے، وہاں اللہ کی مرضی کے مطابق اصل حقیقت کے مطابق بولے گی، کیونکہ اسے یہی حکم ہو گا۔ ¤ ➌ اگرچہ جسم کے اور اعضا بھی بولیں گے، جیسا کہ سورۂ حٰم السجدہ (۲۰، ۲۱) میں چمڑوں کے بولنے کا ذکر ہے، تاہم یہاں زبان، ہاتھ اور پاؤں کا خاص طور پر ذکر اس لیے فرمایا کہ ان اعضا کا تہمت تراشی میں زیادہ دخل ہے، زبان کی بات، ہاتھوں کے اشارے اور پاؤں کی دوڑ دھوپ تہمت کی تکمیل کرتی ہے۔ ¤ ➍ زبان گوشت کا ایک ٹکڑا ہے، جس رب کے حکم سے اس میں کلام کی قوت پیدا ہوئی ہے اسی کے حکم سے جسم کے ہر حصے میں یہ قوت پیدا ہو جائے گی۔ اس لیے ہاتھ، پاؤں اور چمڑوں کے کلام پر تعجب نہیں ہونا چاہیے، فرمایا : «{ اِنَّمَاۤ اَمْرُهٗۤ اِذَاۤ اَرَادَ شَيْـًٔا اَنْ يَّقُوْلَ لَهٗ كُنْ فَيَكُوْنُ }» [ یٰسسٓ : ۸۲ ] ’’اس کا حکم تو، جب وہ کسی چیز کا ارادہ کرتا ہے، اس کے سوا نہیں ہوتا کہ اسے کہتا ہے ’’ہو جا‘‘ تو وہ ہو جاتی ہے۔‘‘ آج کل پلاسٹک کی سی ڈی اور کیسٹ سے آواز نکلتی ہے اور کسی کو تعجب نہیں ہوتا۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ { يَوْمَىِٕذٍ يُّوَفِّيْهِمُ اللّٰهُ دِيْنَهُمُ الْحَقَّ …: ’’ دِيْنَهُمْ ‘‘} سے مراد جزا ہے، کیونکہ وہی پوری دی جائے گی۔ دوسری جگہ فرمایا : «{ ثُمَّ يُجْزٰىهُ الْجَزَآءَ الْاَوْفٰى }» [ النجم : ۴۱ ] ’’پھر اسے اس کا بدلا دیا جائے گا، پورا بدلا۔‘‘ ¤ ➋ { وَ يَعْلَمُوْنَ اَنَّ اللّٰهَ هُوَ الْحَقُّ الْمُبِيْنُ :} اللہ تعالیٰ کی صفت {’’ الْحَقُّ ‘‘} کے دو ممعنی ہیں، ایک معنی ’’ثابت‘‘ ہے، کیونکہ اس کی ذات ہمیشہ سے ہے، نہ اس پر پہلے عدم ہے اور نہ اس پر کبھی فنا ہے، دوسری کسی چیز میں یہ صفت نہیں پائی جاتی ہے۔ لفظ {’’ اللّٰهَ ‘‘} اور اس کی خبر {’’ الْحَقُّ ‘‘} پر الف لام آنے سے اور ان دونوں کے درمیان {’’ هُوَ ‘‘} لانے سے کلام میں حصر پیدا ہو گیا، یعنی حق صرف اللہ تعالیٰ کی ذات ہے، باقی سب باطل ہیں، کیونکہ حق کے مقابلے میں باطل ہے۔ ابوہریرہ رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَصْدَقُ كَلِمَةٍ قَالَهَا الشَّاعِرُ كَلِمَةُ لَبِيْدٍ : أَلَا كُلُّ شَيْءٍ مَا خَلَا اللّٰهَ بَاطِلُ ] [بخاري، مناقب الأنصار، باب أیام الجاھلیۃ :۳۸۴۱ ] ’’سب سے سچی بات جو شاعر نے کہی ہے، وہ لبید کی بات ہے کہ سن لو! اللہ کے سوا ہر چیز باطل ہے۔‘‘ ’’حق‘‘ کا دوسرا معنی عدل و انصاف ہے، مراد {’’ذُو الْحَقِّ أَيْ ذُو الْعَدْلِ‘‘} ہے، یعنی عدل و انصاف والا ہے، جیسے {’’زَيْدٌ عَدْلٌ‘‘} بول کر مراد  {’’ذُوالْعَدْلِ‘‘} لیتے ہیں۔ یعنی قیامت کے دن اللہ تعالیٰ بہتان لگانے والوں کو ان کا صحیح بدلا دے گا اور وہ جان لیں گے کہ اللہ تعالیٰ ہی ہے جو حق فیصلہ کرنے والا ہے، سچ کو سچ ظاہر کرنے والا ہے۔ کیونکہ دوسرے حاکم حق فیصلہ کریں بھی تو اس میں خطا اور کوتاہی کا امکان رہتا ہے۔ صرف اللہ تعالیٰ ہی ایک ایسی ذات ہے جس کا ہر فیصلہ حق ہے۔ ¤ ➌ اس آیت سے بھی معلوم ہوتا ہے کہ {’’ اِنَّ الَّذِيْنَ يَرْمُوْنَ …‘‘} سے مراد کفار و منافقین ہی ہیں، کیونکہ مومن کو تو دنیا میں بھی اللہ تعالیٰ کے {’’ الْحَقُّ الْمُبِيْنُ ‘‘} ہونے کا علم ہے، اس لیے اگر اس سے بہتان کی غلطی سرزد ہو جائے تو وہ اللہ کے خوف سے توبہ کر لیتا ہے، جبکہ کافر اور منافق اس حقیقت کو تسلیم نہ کرنے کی وجہ سے بہتان باندھنے پر جمے رہتے ہیں، انھیں قیامت کو اللہ تعالیٰ کے {’’ الْحَقُّ الْمُبِيْنُ ‘‘} ہونے کا علم ہو گا۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ { اَلْخَبِيْثٰتُ لِلْخَبِيْثِيْنَ… :} اس آیت میں یہ نفسیاتی حقیقت بیان کی گئی ہے کہ خبیث (گندے) مردوں کا نبھاؤ خبیث عورتوں سے اور پاکیزہ مردوں کا نبھاؤ پاکیزہ عورتوں ہی سے ہو سکتا ہے، ایسا نہیں ہو سکتا کہ ایک مرد خود تو بڑا پاکیزہ ہے مگر وہ ایک خبیث عورت سے برسوں نبھاؤ کرتا چلا جائے۔ مقصود عائشہ رضی اللہ عنھا کی پاکیزگی کا بیان ہے کہ ان میں خباثت کا ادنیٰ شائبہ بھی ہوتا تو یہ کیسے ممکن تھا کہ نبی کریم صلی اللہ علیہ وسلم جو ازل سے ابد تک پاکیزہ ہستیوں کے سردار تھے، ان کے ساتھ نہایت محبت و اطمینان سے برسوں نبھاؤ کرتے چلے جاتے؟ بعض مفسرین نے {’’ اَلْخَبِيْثٰتُ ‘‘} سے مراد گندے اقوال و افعال اور {’’ الطَّيِّبٰتُ ‘‘} سے مراد پاکیزہ اقوال و افعال لیے ہیں، یعنی کوئی آدمی جیسا خود ہوتا ہے ویسے ہی وہ اعمال کرتا ہے اور ویسے ہی اقوال زبان پر لاتا ہے۔ اب چونکہ عائشہ رضی اللہ عنھا پاک تھیں، ان کی سیرت اور ان کے اقوال و افعال بھی پاک تھے اور یہ منافق خود گندے تھے، اس لیے ان سے ایسے ہی گندے اقوال و افعال کی توقع تھی۔ ¤ ➋ {اُولٰٓىِٕكَ مُبَرَّءُوْنَ مِمَّا يَقُوْلُوْنَ:} یعنی طیّب مرد اور طیّب عورتیں ان باتوں سے صاف بری کیے ہوئے ہیں جو خبیث مرد اور خبیث عورتیں کہتے ہیں۔ {’’ مُبَرَّءُوْنَ ‘‘} اسم مفعول کا صیغہ ہے ’’بری کیے ہوئے۔‘‘ اس میں ام المومنین عائشہ رضی اللہ عنھا کی واشگاف الفاظ میں براء ت کا ذکر ہے ۔ یعنی اہل ایمان میں سے جو یہ سنتا ہے وہ {’’ سُبْحٰنَكَ هٰذَا بُهْتَانٌ عَظِيْمٌ ‘‘} کہہ کر انھیں پاک قرار دیتا ہے اور رب تعالیٰ بھی {’’ اِنَّ الَّذِيْنَ جَآءُوْ بِالْاِفْكِ عُصْبَةٌ مِّنْكُمْ ‘‘} کے ساتھ ان کی براء ت کا اعلان فرماتے ہہیں۔ {’’ مِمَّا يَقُوْلُوْنَ ‘‘} یعنی بہتان تراشوں کی صرف منہ کی باتیں ہیں، ان کی حقیقت کچھ نہیں۔ ¤ ➌ { لَهُمْ مَّغْفِرَةٌ وَّ رِزْقٌ كَرِيْمٌ : ’’ مَغْفِرَةٌ ‘‘} پر تنوینِ تعظیم کی وجہ سے ’’بڑی بخشش‘‘ ترجمہ کیا گیا ہے، یعنی خبیث لوگوں کے برا کہنے سے وہ برے نہیں ہو جاتے، بلکہ ان کی تہمتوں کی وجہ سے انھیں جو رنج پہنچتا ہے اور وہ اس پر صبر کرتے ہیں تو یہ چیز ان کی خطاؤں اور لغزشوں کی بخشش کا ذریعہ بنتی ہے اور مفسد لوگ جس قدر انھیں ذلیل کرنا چاہتے ہیں اسی قدر انھیں عزت کی روزی ملتی ہے۔ اس میں رسول اللہ صلی اللہ علیہ وسلم ، عائشہ، ان کے والدین اور صفوان رضی اللہ عنھم سب کے لیے جنت کی بشارت ہے، جو حقیقی رزق کریم ہے، کیونکہ اس بہتان سے ان سب کی عزت و آبرو پر حملہ ہوا اور سب کو نہایت رنج پہنچا۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَدْخُلُوْا بُيُوْتًا …:} سورت کے شروع سے زنا اور بہتان کی حد اور ان کی مذمت کا بیان آ رہا ہے، اب ان احکام کا ذکر شروع ہوتا ہے جن سے مردوں اور عورتوں کے ایسے میل جول کی روک تھام ہوتی ہے جو زنا اور بہتان کا سبب بنتا ہے۔ ان احکام میں گھروں میں داخلے کی اجازت، نظر کی حفاظت، پردے اور نکاح کی تاکید اور قحبہ گری سے ممانعت جیسے آداب شامل ہیں۔ ¤ ➋ { غَيْرَ بُيُوْتِكُمْ :} یعنی صرف اپنے گھروں میں داخلے کے لیے اجازت کی ضرورت نہیں، جہاں آدمی اکیلا رہتا ہو، یا بیوی کے ساتھ رہتا ہو۔ اگرچہ افضل یہی ہے کہ وہاں داخلے سے پہلے بھی کسی طرح گھر والوں کو اپنی آمد سے آگاہ کر دیا جائے، ممکن ہے وہ ایسی حالت میں ہوں جس میں خاوند کا دیکھنا انھیں پسند نہ ہو۔ چنانچہ عبد اللہ بن مسعود رضی اللہ عنہ کی بیوی زینب بیان کرتی ہیں : [ كَانَ عَبْدُ اللّٰهِ إِذَا جَاءَ مِنْ حَاجَةٍ فَانْتَهٰی إِلَی الْبَابِ تَنَحْنَحَ وَ بَزَقَ كَرَاهَةَ أَنْ يَّهْجُمَ مِنَّا عَلٰی أَمْرٍ يَكْرَهُهُ ] [ ابن جریر : ۲۶۱۳۱ ] ’’عبد اللہ( رضی اللہ عنہ ) جب کسی کام سے فارغ ہو کر گھر آتے تو دروازے پر آ کر کھانستے اور تھوکتے کہ کہیں ان کی نظر ہماری کسی ایسی چیز پر نہ پڑ جائے جو انھیں نا پسند ہو۔‘‘ ابن کثیر نے اس کی سند کو صحیح کہا ہے۔ جابر بن عبد اللہ رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا أَطَالَ أَحَدُكُمُ الْغَيْبَةَ فَلَا يَطْرُقْ أَهْلَهُ لَيْلًا ] [ بخاري، النکاح، باب لا یطرق أھلہ… : ۵۲۴۴ ] ’’جب تم میں سے کوئی شخص زیادہ عرصہ گھر سے غائب رہے تو گھر والوں کے پاس رات کے وقت نہ آئے۔‘‘ مسلم میں یہ الفاظ زائد ہیں : [ نَهٰی رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ أَنْ يَّطْرُقَ الرَّجُلُ أَههْلَهُ لَيْلًا يَتَخَوَّنُهُمْ أَوْ يَلْتَمِسُ عَثَرَاتِهِمْ ] [ مسلم، الإمارۃ، باب کراھیۃ الطروق… : 715/184، قبل ح : ۱۹۲۹ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے (زیادہ عرصہ گھر سے غائب رہنے والے شخص کو) منع فرمایا کہ وہ گھر والوں کی خیانت یا ان کی غلطی کی تلاش کے لیے رات کو (اچانک) ان کے پاس آئے۔‘‘ ¤ ➌ {’’ حَتّٰى تَسْتَاْنِسُوْا ‘‘} کا لفظی ترجمہ ہے ’’یہاں تک کہ تم انس حاصل کر لو۔‘‘ اس لیے اس میں نہ صرف اجازت حاصل کرنے کا مفہوم شامل ہے، بلکہ یہ مفہوم بھی شامل ہے کہ تم معلوم کر لو کہ گھر میں کوئی ہے بھی یا نہیں اور ہے تو اسے تمھارا آنا ناگوار تو نہیں ہے؟ ¤ ➍ اجازت مانگنے کا طریقہ، بنو عامر کا ایک آدمی آیا اور اس نے رسول اللہ صلی اللہ علیہ وسلم کے پاس آنے کی اجازت طلب کی، کہنے لگا : ’’کیا میں اندر آ جاؤں؟‘‘ نبی صلی اللہ علیہ وسلم نے اپنے خادم سے کہا : ’’اس کے پاس جاؤ اور اسے اجازت مانگنے کا طریقہ سکھاؤ کہ وہ اس طرح کہے : [ اَلسَّلَامُ عَلَيْكُمْ أَ أَدْخُلُ؟ ] ’’السلام علیکم، کیا میں اندر آ سکتا ہوں؟‘‘ اس آدمی نے یہ بات سن لی اور کہا : [اَلسَّلَامُ عَلَيْكُمْ أَ أَدْخُلُ؟] تو رسول اللہ صلی  اللہ علیہ وسلم نے اسے اجازت دے دی اور وہ داخل ہو گیا۔‘‘ [ أبوداوٗد، الأدب، باب کیف الاستئذان ؟ : ۵۱۷۷ ] ¤ کَلَدہ بن حنبل رضی اللہ عنہ کہتے ہیں : ’’میں نبی صلی اللہ علیہ وسلم کے پاس گیا اور آپ کے پاس سیدھا چلا آیا، میں نے نہ سلام کہا ( اور نہ اجازت مانگی)، تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ اِرْجِعْ فَقُلْ اَلسَّلَامُ عَلَيْكُمْ ] [ أبوداوٗد، الأدب، باب کیف الاستئذان؟ : ۵۱۷۶، صححہ الألباني ] ’’واپس جاؤ اور کہو السلام علیکم۔‘‘ ¤ ➎ اجازت زیادہ سے زیادہ تین مرتبہ مانگے، اگر اجازت نہ ملے تو واپس چلا جائے۔ [ دیکھیے بخاري، الاستئذان، باب التسلیم و الاستئذان ثلاثا : ۶۲۴۵، عن أبي موسٰی رضی اللہ عنہ ] ¤ ➏ دروازہ کھٹکھٹانے یا سلام کہنے پر اگر گھر والے پوچھیں، کون ہے تو اپنا نام بتائے۔ جابر رضی اللہ عنہ کہتے ہیں کہ میں نبی صلی اللہ علیہ وسلم کے پاس ایک قرض کے سلسلے میں حاضر ہوا، جو میرے والد کے ذمے تھا، میں نے دروازہ کھٹکھٹایا، آپ صلی اللہ علیہ وسلم نے پوچھا : [ مَنْ ذَا؟ فَقُلْتُ أَنَا، فَقَالَ أَنَا أَنَا ] ’’کون ہے؟‘‘ میں نے کہا : ’’میں ہوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’میں، میں۔‘‘ گویا آپ نے اسے ناپسند فرمایا۔ [ بخاري، الاستئذان، باب إذا قال من ذا؟ فقال أنا : ۶۲۵۰ ] ¤ ➐ ہزیل رضی اللہ عنہ فرماتے ہیں، ایک آدمی آیا اور نبی صلی اللہ علیہ وسلم کے دروازے کے سامنے کھڑا ہو کر اجازت مانگنے لگا، تو نبی صلی اللہ علیہ وسلم نے فرمایا : [ هٰكَذَا عَنْكَ أَوْ هٰكَذَا، فَإِنَّمَا الْاِسْتِئْذَانُ مِنَ النَّظَرِ ] [ أبوداوٗد، الأدب، باب کیف الاستئذان ؟ : ۵۱۷۴، صححہ الألباني ] ’’اس طرف ہو جاؤ یا اس طرف، کیونکہ دیکھنے ہی کی وجہ سے اجازت مانگی جاتی ہے۔‘‘ ¤ ➑ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَوِ اطَّلَعَ فِيْ بَيْتِكَ أَحَدٌ وَ لَمْ تَأْذَنْ لَهُ خَذَفْتَهُ بِحَصَاةٍ فَفَقَأْتَ عَيْنَهُ مَا كَانَ عَلَيْكَ مِنْ جُنَاحٍ ] [ بخاري، الدیات، باب من أخذ حقہ… : ۶۸۸۸ ] ’’اگر کوئی آدمی تیرے گھر میں جھانکے، جبکہ تو نے اجازت نہ دی ہو اور تو کنکری پھینک کر اس کی آنکھ پھوڑ دے تو تجھ پر کچھ گناہ نہ ہو گا۔‘‘ ایسی صورت میں آنکھ پھوڑنے پر نہ قصاص ہے، نہ دیت۔ ¤ ➒ { ذٰلِكُمْ خَيْرٌ لَّكُمْ … :} یعنی ان آداب میں دونوں طرف کا فائدہ ہے، اجازت مانگنے والے کا بھی اور گھر والوں کا بھی۔ (ابن کثیر) {’’ لَعَلَّكُمْ تَذَكَّرُوْنَ ‘‘} تاکہ تم نصیحت حاصل کرو کہ جس طرح تمھیں دوسروں کا بلااجازت آ گھسنا برا محسوس ہوتا ہے، اسی طرح دوسروں کو تمھارا بلااجازت در آنا بھی برا محسوس ہوتا ہے۔ افسوس کہ مسلمانوں نے اجازت مانگنے کے حکم پر عمل کرنا چھوڑ دیا۔ (الا ما شاء اللہ) رشتہ داروں، ہمسایوں بلکہ اجنبیوں تک کے گھروں میں آنے جانے کے لیے اجازت کی ضرورت ہی نہیں رہی، اس پر مزید عام بے پردگی اور بے لباسی سے بدتر لباس ہے، جس سے مسلم معاشرے میں بے حیائی کا سیلاب آ رہا ہے۔ جس کے نتیجے میں بدکاری، بدگمانی، تہمت تراشی، رقابت، قتل و غارت اور دوسری برائیاں پھیل رہی ہیں۔ اللہ تعالیٰ ہمیں اپنی حدود اور اپنے احکام پر عمل کی توفیق عطا فرمائے۔ ( آمین )"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { فَاِنْ لَّمْ تَجِدُوْا فِيْهَاۤ اَحَدًا فَلَا تَدْخُلُوْهَا :} یعنی اگر گھر میں کوئی موجود نہ ہو تو اس سے تمھارے لیے بغیر اجازت وہاں داخلہ جائز نہیں ہو جاتا۔ ہر آدمی جس طرح اپنی ذاتی حالتوں میں سے بعض حالتوں پر کسی کا مطلع ہونا پسند نہیں کرتا اسی طرح وہ اپنی بعض چیزوں پر بھی کسی کے مطلع ہونے کو پسند نہیں کرتا اور عین ممکن ہے کہ بلااجازت گھس جانے سے تم پر چوری یا خیانت کا الزام لگ جائے اور جھگڑا پیدا ہو جائے۔ ہاں، اگر اس نے اجازت دے رکھی ہو کہ میں گھر میں نہ ہوں تو تم آ جاؤ تو وہاں جانے میں کوئی حرج نہیں۔ ¤ ➋ { وَ اِنْ قِيْلَ لَكُمُ ارْجِعُوْا فَارْجِعُوْا:} یعنی اگر تمھیں واپس جانے کے لیے کہا جائے تو واپس ہو جاؤ، نہ غصہ کرو، نہ کبر کی وجہ سے تنگی یا بے عزتی محسو س کرو، کیونکہ گھر والے نے تمھارا کوئی ایسا حق نہیں روکا جو اس پر واجب ہو، وہ اجازت کا اختیار رکھتا ہے، چاہے دے یا نہ دے، لوگوں کے اپنے اپنے حالات ہوتے ہیں، کسی کو کیا خبر کہ کوئی کس حال میں ہے۔ ¤ ➌ { هُوَ اَزْكٰى لَكُمْ:} یعنی تمھارا واپس آ جانا تمھارے لیے زیادہ عزت اور پاکیزگی کا باعث ہے، کیونکہ اس طرح تم کسی کے دروازے پر کھڑے رہنے کی بے قدری سے بچ جاؤ گے، واپس چلے آنے سے صاحب خانہ کے دل میں تمھاری حیا ہو گی اور سب سے بڑھ کر اللہ کی طرف سے اجر ہے۔ ¤ ➍ { وَ اللّٰهُ بِمَا تَعْمَلُوْنَ عَلِيْمٌ:} اس میں جاسوسی یا کسی بری نیت سے کسی گھر میں داخل ہونے پر وعید ہے۔ ¤ ➎ طبری نے بعض مہاجرین سے نقل کیا ہے کہ میری ساری عمر یہ آرزو رہی ہے کہ میں کسی کے گھر جاؤں اور اندر سے مجھے یہ جواب ملے کہ واپس چلے جاؤ اور میں واپس چلا آؤں، تاکہ مجھے اس آیت پر کم از کم ایک مرتبہ تو عمل کرنے کی سعادت نصیب ہو جائے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ {لَيْسَ عَلَيْكُمْ جُنَاحٌ اَنْ تَدْخُلُوْا بُيُوْتًا غَيْرَ مَسْكُوْنَةٍ …:} یعنی ایسے مکان جو کسی کے رہنے کی جگہیں نہ ہوں اور ان سے تمھارا کوئی فائدہ یا کوئی ضرورت وابستہ ہو اور وہ ہر خاص و عام کے لیے کھلے ہوں تو ان کے اندر بلااجازت داخل ہونے میں تم پر کوئی گناہ نہیں، جیسے اسٹیشن، بسوں کے اڈے، مساجد، کھانے پینے اور رہائش کے ہوٹل، مسافر خانے، دکانیں اور وہ مہمان خانے جن میں جانے کی ایک دفعہ اجازت مل چکی ہو۔ اسی طرح وہ مکانات جو بے آباد، ویران اور اجڑے پڑے ہوں ان کے اندر آرام کر لینا، سایہ حاصل کرنا اور رات گزارنا وغیرہ جائز ہے۔ اس سے معلوم ہوا کہ جن مکانوں میں آدمی کا کوئی فائدہ، مقصد یا ضرورت نہ ہو وہاں نہیں جانا چاہیے۔ ¤ ➋ { وَ اللّٰهُ يَعْلَمُ مَا تُبْدُوْنَ وَ مَا تَكْتُمُوْنَ :} یعنی اللہ تعالیٰ تمھارے ظاہر اور پوشیدہ اعمال جانتا ہے، اسے خوب معلوم ہے کہ کسی جگہ جانے میں تمھاری نیت کیا ہے۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ {قُلْ لِّلْمُؤْمِنِيْنَ يَغُضُّوْا مِنْ اَبْصَارِهِمْ: ’’غَضَّ طَرْفَهُ، خَفَضَهُ‘‘} ’’اس نے اپنی آنکھ نیچی کر لی۔‘‘ دوسرا معنی ہے {’’نَقَصَ وَ وَضَعَ مِنْ قَدْرِهِ‘‘} ’’اس نے فلاں کی قدر کم کی۔‘‘ (قاموس) زنا اور بہتان سے محفوظ رکھنے کے لیے گھروں میں داخلے کے آداب بیان فرمانے کے بعد نظر کی حفاظت کا حکم دیا، کیونکہ آدمی کے دل کا دروازہ یہی ہے اور تمام شہوانی فتنوں کا آغاز عموماً یہیں سے ہوتا ہے۔ احمد شوقی نے کہا ہے : {’’نَظْرَةٌ فَابْتِسَامَةٌ فَسَلَامٌ فَكَلَامٌ فَمَوْعِدٌ فَلِقَاءٌ‘‘} ’’نظر ملتی ہے، پھر مسکراہٹ، پھر سلام، پھر گفتگو، پھر وعدہ اور پھر ملاقات تک بات جا پہنچتی ہے۔‘‘ ¤ ➋ اس سے پہلی آیات میں اللہ تعالیٰ نے {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا ‘‘} کے ساتھ براہ راست مخاطب فرمایا ہے، جیسا کہ {’’ لَا تَتَّبِعُوْا خُطُوٰتِ الشَّيْطٰنِ ‘‘} اور {’’ لَا تَدْخُلُوْا بُيُوْتًا غَيْرَ بُيُوْتِكُمْ ‘‘} سے پہلے ہے، یہاں رسول اللہ صلی اللہ علیہ وسلم کو مخاطب کر کے فرمایا : ’’مومن مردوں سے کہہ دے‘‘ اس کی وجہ یہ معلوم ہوتی ہے کہ نظر کا معاملہ نہایت خطرناک ہے اور اسے روکنا نہایت مشکل کام ہے، اس لیے اللہ تعالیٰ نے شہنشاہانہ جلال کے ساتھ نبی صلی اللہ علیہ وسلم کو حکم دیا کہ مومن مردوں سے کہہ دے اور مومن عورتوں سے کہہ دے۔ (البقاعی) (واللہ اعلم) ¤ ➌ {’’ قُلْ لِّلْمُؤْمِنِيْنَ يَغُضُّوْا مِنْ اَبْصَارِهِمْ ‘‘} میں{’’ مِنْ ‘‘} تبعیض کے لیے ہے، اس لیے ترجمہ کیا گیا ہے ’’مومن مردوں سے کہہ دے اپنی کچھ نگاہیں نیچی رکھیں۔‘‘ اللہ تعالیٰ کا حکم یہ نہیں کہ کسی چیز کو بھی نظر بھر کر نہ دیکھو، راستہ چلتے ہہوئے بھی نگاہ مت اٹھاؤ، بلکہ حکم کچھ نگاہیں نیچی رکھنے کا ہے اور مراد ان چیزوں سے نگاہ نیچی رکھنا ہے جن کی طرف نگاہ بھر کر دیکھنا اللہ تعالیٰ نے حرام فرمایا ہے، مثلاً اپنی بیوی اور محرم رشتوں کے سوا عورتوں کو دیکھنا، کسی ڈاڑھی کے بغیر لڑکے کو شہوت کی نظر سے دیکھنا، یا کسی کا خط یا وہ چیز دیکھنا جسے وہ چھپانا چاہتا ہے وغیرہ۔ ¤ ➍ { يَغُضُّوْا مِنْ اَبْصَارِهِمْ :} بلا ارادہ پڑنے والی پہلی نظر معاف ہے، گناہ اس نظر پر ہے جو جان بوجھ کر ڈالی جائے۔ نظر کا ذکر خصوصاً فرمایا، کیونکہ عموماً زنا کی ابتدا اس سے ہوتی ہے، ورنہ زنا سارے حواس ہی سے ہوتا ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهُ كَتَبَ عَلَی ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَا أَدْرَكَ  ذٰلِكَ لَا مَحَالَةَ فَزِنَا الْعَيْنِ النَّظَرُ وَ زِنَا اللِّسَانِ الْمَنْطِقُ وَالنَّفْسُ تَتَمَنّٰی وَ تَشْتَهِيْ وَالْفَرْجُ يُصَدِّقُ ذٰلِكَ كُلَّهُ وَ يُكَذِّببُهُ ] [ بخاري، الاستئذان، باب زنا الجوارح دون الفرج : ۶۲۴۳ ] ’’اللہ تعالیٰ نے ابن آدم پر زنا میں سے اس کا حصہ لکھ دیا ہے، جسے وہ لامحالہ حاصل کرے گا، چنانچہ آنکھ کا زنا دیکھنا ہے، زبان کا زنا بولنا ہے اور نفس تمنا اور خواہش کرتا ہے اور شرم گاہ اس کی تصدیق کرتی ہے یا تکذیب کر دیتی ہے۔‘‘ ¤ جریر بن عبد اللہ رضی اللہ عنہ فرماتے ہیں : ’’میں نے رسول اللہ صلی اللہ علیہ وسلم سے اچانک نظر کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں اپنی نظر ہٹا لوں۔‘‘ [ مسلم، الآداب، باب نظر الفجائۃ : ۲۱۵۹ ] البتہ ضرورت کے لیے غیر محرم عورت کو دیکھ سکتا ہے، مثلاً اس سے نکاح کا ارادہ ہو، یا طبی ضرورت ہو، یا کسی حادثہ کی وجہ سے ضرورت پڑ جائے۔ اللہ نے فرمایا : «{ وَ قَدْ فَصَّلَ لَكُمْ مَّا حَرَّمَ عَلَيْكُمْ اِلَّا مَا اضْطُرِرْتُمْ اِلَيْهِ }» [ الأنعام : ۱۱۹ ] ’’حالانکہ بلاشبہ اس نے تمھارے لیے وہ چیزیں کھول کر بیان کر دی ہیں جو اس نے تم پر حرام کی ہیں، مگر جس کی طرف تم مجبور کر دیے جاؤ۔‘‘ ¤ ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا يَنْظُرُ الرَّجُلُ إِلٰی عَوْرَةِ الرَّجُلِ وَلَا الْمَرْأَةُ إِلٰی عَوْرَةِ الْمَرْأَةِ وَ لَا يُفْضِی الرَّجُلُ إِلَی الرَّجُلِ فِيْ ثَوْبٍ وَاحِدٍ وَلَا تُفْضِی الْمَرْأَةُ إِلَی الْمَرْأَةِ فِي الثَّوْبِ  الْوَاحِدِ ] [مسلم، الحیض، باب تحریم النظر إلی العورات : ۳۳۸ ] ’’کوئی مرد دوسرے مرد کی شرم گاہ نہ دیکھے، نہ ہی کوئی عورت کسی عورت کی شرم گاہ دیکھے۔ نہ کوئی مرد کسی مرد کے ساتھ ایک کپڑے میں لیٹے اور نہ کوئی عورت کسی عورت کے ساتھ ایک کپڑے میں لیٹے۔‘‘ ¤ ➎ مرد کے لیے اپنی بیوی یا لونڈی کے جسم کا ہر حصہ دیکھنا جائز ہے، اسی طرح بیوی کے لیے اپنے خاوند کے جسم کا اور لونڈی کے لیے اپنے مالک کے جسم کا ہر حصہ دیکھنا جائز ہے، اللہ تعالیٰ نے فرمایا : «{ هُنَّ لِبَاسٌ لَّكُمْ وَ اَنْتُمْ لِبَاسٌ لَّهُنَّ }» [ البقرۃ : ۱۸۷ ] ’’وہ تمھارے لیے لباس ہیں اور تم ان کے لیے لباس ہو۔‘‘ ظاہر ہے کہ لباس سے جسم کا کوئی حصہ پوشیدہ نہیں رہتا۔ ابن ماجہ (۶۶۲) میں عائشہ رضی اللہ عنھا سےے مروی حدیث کہ میں نے کبھی رسول اللہ صلی اللہ علیہ وسلم کی شرم گاہ نہیں دیکھی، سند کے لحاظ سے ثابت نہیں، کیونکہ عائشہ رضی اللہ عنھا سے روایت کرنے والا راوی مجہول ہے۔ اس کے برعکس عائشہ رضی اللہ عنھا فرماتی ہیں : ’’میں اور رسول اللہ صلی اللہ علیہ وسلم ایک ہی برتن سے غسل کرتے تھے، ہمارے ہاتھ اس میں باری باری آتے جاتے تھے۔‘‘ ایک روایت میں ہے : ’’ہم جنبی ہوتے تھے۔‘‘ [ بخاري، الغسل، باب ھل یدخل الجنب یدہ… : ۲۶۱، ۲۶۳ ] ¤ ➏ { وَ يَحْفَظُوْا فُرُوْجَهُمْ:}يہاں {’’مِنْ‘‘} استعمال نہیں فرمایا کہ اپنی کچھ شرم گاہوں کی حفاظت کریں، بلکہ فرمایا، اپنی شرم گاہوں کی مکمل حفاظت کریں، کیونکہ نظر سے مکمل بچاؤ ممکن نہ تھا۔ ¤ ➐ { اِنَّ اللّٰهَ خَبِيْرٌۢ بِمَا يَصْنَعُوْنَ :} وہ اس حکم پر عمل کرنے والوں کو جزا دے گا اور عمل نہ کرنے والوں کو سزا دے گا، خواہ ان کی نیکی یا بدی سے کوئی آگاہ ہو یا آگاہ نہ ہو، جو کچھ وہ کر رہے ہیں اللہ تعالیٰ اس سے پوری طرح واقف ہے۔ فرمایا : «{ يَعْلَمُ خَآىِٕنَةَ الْاَعْيُنِ وَ مَا تُخْفِي الصُّدُوْرُ }» [ المؤمن : ۱۹ ] ’’وہ آنکھوں کی خیانت کو جانتا ہے اور اسے بھی جو سینے چھپاتے ہیں۔‘‘"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { وَ قُلْ لِّلْمُؤْمِنٰتِ يَغْضُضْنَ مِنْ اَبْصَارِهِنَّ … :} عورتوں کو بھی اسی طرحح اپنی کچھ نگاہیں نیچی رکھنے اور اپنی شرم گاہوں کی حفاظت کرنے کا حکم فرمایا جیسے مردوں کو یہ حکم دیا، مگر عورتوں پر مردوں کو نہ دیکھنے کی اتنی سختی نہیں جتنی مردوں پر عورتوں کے دیکھنے کے بارے میں ہے۔ عائشہ رضی اللہ عنھا فرماتی ہیں : ’’میں نے نبی صلی اللہ علیہ وسلم کو دیکھا آپ اپنی چادر کے ساتھ مجھے پردے میں لیے ہو ئے تھے اور میں حبشیوں کو دیکھ رہی تھی، وہ (برچھوں کے ساتھ) کھیل رہے تھے، یہاں تک کہ میں ہی اکتا جاتی، تو ایک نو عمر لڑکی کا اندازہ کر لو جو کھیل دیکھنے کی شوقین ہو۔‘‘ [ بخاري، النکاح، باب نظر المرأۃ إلی الحبش… : ۵۲۳۶ ] یعنی اندازہ لگا لو کہ رسول اللہ صلی اللہ علیہ وسلم میرے لیے کتنی دیر کھڑے رہے ہوں گے۔ فاطمہ بنت قیس رضی اللہ عنھا کو ان کے خاوند نے تیسری طلاق دے دی تو رسول اللہ صلی اللہ علیہ وسلم نے انھیں فرمایا : ’’ام شریک کے گھر رہ کر عدت گزارو۔‘‘ پھر فرمایا : ’’اس عورت کے پاس میرے صحابہ کثرت سے آتے ہیں (کیونکہ وہ مال دار اور بہت مہمان نواز خاتون تھی)، اس لیے تم ابن ام مکتوم کے گھر عدت گزارو، کیونکہ وہ نابینا آدمی ہے، تم اپنے کپڑے بھی نیچے رکھ سکو گی۔‘‘ [ مسلم، الطلاق، باب المطلقۃ البائن لا نفقۃ لھا : 1480/38 ] ان احادیث سے معلوم ہوا کہ اگر شہوانی خیال نہ ہو تو عورتیں مردوں کو دیکھ سکتی ہیں۔ پردے کا حکم عورتوں کو ہے، تاکہ مرد انھیں نہ دیکھیں، مردوں کو نہیں کہ عورتیں انھیں نہ دیکھیں۔ البتہ اگر شہوت کے ساتھ ہو تو عورتوں کو بھی مردوں کی طرف دیکھنا حرام ہے، جیسا کہ آیت سے ظاہر ہے۔ ¤ \n➋ سنن ابی داؤد اور بعض دوسری کتب احادیث میں ام سلمہ رضی اللہ عنھا سے مروی ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس تھی اور آپ صلی اللہ علیہ وسلم کے پاس میمونہ رضی اللہ عنھا بھی تھیں تو ابن ام مکتوم رضی اللہ عنہ آئے اور یہ واقعہ ہمیں حجاب کا حکم ہونے کے بعد کا ہے۔ تو نبی صلی اللہ علیہ وسلم نے فرمایا : ’’اس سے حجاب کرو۔‘‘ ہم نے کہا : ’’یا رسول اللہ! کیا یہ نابینا نہیں کہ نہ ہمیں دیکھتا ہے، نہ ہمیں پہچانتا ہے؟‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَ فَعَمْيَاوَانِ أَنْتُمَا؟ أَلَسْتُمَا تُبْصِرَانِهِ ! ] [ أبوداوٗد، اللباس، باب في قولہ عزوجل : «و قل للمؤمنات … » : ۴۱۱۲ ] ’’تو کیا تم بھی اندھی ہو؟ کیا تم اسے نہیں دیکھتیں!‘‘ اس حدیث سے عورتوں کا آنکھوں والے مردوں کو ہی نہیں نابینا مردوں کو دیکھنا بھی منع ثابت ہوتا ہے، مگر امام ابوداؤد رحمہ اللہ نے اس کی توجیہ یہ فرمائی ہے کہ یہ نبی صلی اللہ علیہ وسلم کی بیویوں کی خصوصیت ہے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فاطمہ بنت قیس رضی اللہ عنھا کو ابن ام مکتوم رضی اللہ عنہ کے گھر عدت گزارنے کا حکم دیا تھا۔ ہمارے ایک شیخ اس کی یہ توجیہ فرماتے تھے کہ نابینا آدمی اپنے ستر کا خیال نہیں رکھ سکتا، نہ اسے اپنا ستر کھلنے کا پتا چل سکتا ہے، اس لیے اس سے حجاب کا حکم دیا، مگر حقیقت یہ ہے کہ یہ روایت ثابت ہی نہیں، چنانچہ شیخ البانی رحمہ اللہ نے بھی اسے ضعیف کہا ہے۔ وجہ اس کی یہ ہے کہ اس میں ایک راوی نبہان مولیٰ ام سلمہ ہے، اسے تقریب میں ’’مقبول‘‘ کہا گیا ہے اور حافظ ابن حجر رحمہ اللہ نے تقریب کے مقدمہ میں خود فرمایا ہے کہ جس راوی کے متعلق وہ مقبول کہیں، اگر کسی حدیث میں اس کی متابعت ہو تو وہ مقبول ہے، ورنہ ’’لین الحدیث‘‘ ہے۔ اس لیے یہ روایت ضعیف ہے۔ [ ہدایۃ المستنیر بتخریج ابن کثیر ] ¤ \n➌ { وَ لَا يُبْدِيْنَ زِينَتَهُنَّ اِلَّا مَا ظَهَرَ مِنْهَا :} چونکہ مردوں کے لیے عورتوں سے بڑا فتنہ کوئی نہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا تَرَكْتُ بَعْدِيْ فِتْنَةً أَضَرَّ عَلَی الرِّجَالِ مِنَ النِّسَاءِ] [بخاري، النکاح، باب ما یتقي من شؤم المرأۃ… : ۵۰۹۶، عن أسامۃ بن زید رضی اللہ عنھما ] ’’میں نے اپنے بعد مردوں پر کوئی فتنہ عورتوں سے زیادہ نقصان پہنچانے والا نہیں چھوڑا۔‘‘ اس لیے اللہ تعالیٰ نے عورتوں کو نگاہیں نیچی رکھنے کے علاوہ اپنی زینت چھپانے کا بھی حکم دیا، چنانچہ فرمایا کہ مومن عورتوں سے کہہ دے کہ (ان کے ایمان کا تقاضا ہے کہ) اپنی کچھ نگاہیں نیچی رکھیں اور اپنی شرم گاہوں کی حفاظت کریں اور اپنی زینت ظاہر نہ کریں مگر جو اس میں سے ظاہر ہو جائے۔ زینت کا معنی جمال اور حسن ہے۔ یہ دو قسم کی ہے، ایک فطری حسن و جمال اور دوسری جو بناؤ سنگار، زیبائش و آرائش اور زیور وغیرہ سے حاصل ہوتی ہے۔ لباس بھی زینت ہے، اللہ تعالیٰ نے فرمایا : «{ خُذُوْا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ }» [ الأعراف : ۳۱ ] ’’ہر نماز کے وقت اپنی زینت لے لو۔‘‘ اس میں زینت کا معنی لباس ہی ہے۔ اللہ تعالیٰ کا حکم یہ ہے کہ عورتیں اپنی کوئی زینت ظاہر نہ کریں مگر جو خود ظاہر ہو جائے، یعنی انھیں اپنے بدن اور اس کے بناؤ سنگار میں سے کوئی چیز ظاہر کرنا جائز نہیں مگر وہ کپڑے جنھیں چھپایا جا ہی نہیں سکتا، یا وہ زینت جو کسی کام یا حرکت کی وجہ سے بے اختیار ظاہر ہو جائے۔ {’’الصحيح المسبور من التفسير بالمأثور‘‘} میں ہے : ’’طبری نے صحیح اسانید کے ساتھ عبد اللہ بن مسعود رضی اللہ عنہ سے بیان کیا ہے کہ انھوں نے فرمایا : {’’ « وَ لَا يُبْدِيْنَ زِينَتَهُنَّ اِلَّا مَا ظَهَرَ مِنْهَا» قَالَ هِيَ الثِّيَابُ‘‘} یعنی اللہ تعالیٰ نے جو فرمایا ہے کہ ’’وہ اپنی زینت ظاہر نہ کریں مگر جو اس میں سے ظاہر ہو جائے‘‘ اس سے مراد کپڑے ہیں۔‘‘ حاکم نے اسے روایت کیا اور اسے صحیح کہا ہے اور ذہبی نے ان کی موافقت کی ہے۔ (مستدرک حاکم : ۲؍۳۹۷، ح : ۳۴۹۹) اور طبرانی (۹۱۱۶) نے بھی اسے روایت کیا ہے۔ ہیثمی نے مجمع الزوائد (۷؍۸۲) میں فرمایا : ’’طبرانی نے اسے کئی اسانید کے ساتھ مطول اور مختصر روایت کیا ہے، جن میں سے ایک سند کے راوی صحیحین (بخاری و مسلم) کے راوی ہیں۔‘‘ ¤ ..."
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ {وَ اَنْكِحُوا الْاَيَامٰى مِنْكُمْ: ’’ الْاَيَامٰى ‘‘ ’’آمَ يَئِيْمُ أَيْمًا‘‘} ({بَاعَ يَبِيْعُ}) سے{ ’’أَيِّمٌ‘‘ } (بروزن {فَیْعِلٌ، كَسَيِّدٍ} )کی جمع ہے، یعنی وہ عورت جس کا خاوند نہ ہو، کنواری ہو یا بیوہ یا مطلقہ اور وہ مرد جس کی بیوی نہ ہو، کنوارا ہو یا ثیب۔ زمخشری کے مطابق {’’أَيَامٰي‘‘} کا وزن {’’أَفَاعِلُ‘‘} ہے، کیونکہ یہ {’’ أَيِّمٌ‘‘} کی جمع ہے، جو {’’فَيْعِلٌ‘‘} کے وزن پر ہے اور {’’فَيْعِلٌ‘‘} کی جمع {’’فَعَالٰي‘‘} نہیں آتی۔ اس لیے {’’أَيَامٰي‘‘} کا اصل {’’ أَيَايِمُ‘‘} ہے، جس میں قلب کرکے میم کو یاء کی جگہ پہلے کر دیا گیا، کیونکہ الف کے بعد یاء پڑھنے میں ثقل ہے، پھر میم کو تخفیف کے لیے فتحہ دے دیا گیا اور یاء کو الف سے بدل کر {’’أَيَامٰي‘‘} کر دیا۔ ابن مالک اور کئی علماء کے مطابق یہ خلاف قیاس {’’ فَعَالٰي‘‘} کے وزن پر ہے، سیبویہ کے کلام کا ظاہر بھی یہی ہے۔ (التحریر والتنویر) ¤ ➋ نگاہیں نیچی رکھنے اور شرم گاہوں کی حفاظت کرنے کے حکم کا مطلب یہ نہیں کہ اللہ تعالیٰ کی عطا کردہ جنسی جبلت کو معطل کر دو اور ترک دنیا کرکے راہب اور جوگی بن جاؤ، کیونکہ یہ فطرت کا مقابلہ ہے اور جو شخص فطرت کا مقابلہ کرنے کی کوشش کرے گا پادریوں اور ننوں (راہبات) کی طرح بری طرح شکست کھائے گا، بلکہ حکم دیا کہ اپنے مجرد مردوں اور عورتوں کا نکاح کرو اور حلال طریقے سے اپنی خواہش اور لذت کی تکمیل کرو، یہ تمھاری پاک دامنی اور نگاہ نیچی رکھنے کا ذریعہ ہے اور امت مسلمہ کی تعداد بڑھانے کا بھی۔ ¤ ➌ { ’’ الْاَيَامٰى مِنْكُمْ ‘‘} سے مراد مسلم آزاد مجرد مرد اور عورتیں ہیں، کیونکہ غلاموں کا ذکر بعد میں آ رہا ہے اور غیر مسلم {’’ مِنْكُمْ ‘‘} نہیں بلکہ {’’مِنْ غَيْرِكُمْ ‘‘} ہیں۔ رہی یہ بات کہ یہ حکم کس کو ہے؟ تو عورت کا نکاح اس کے اولیاء کی ذمہ داری ہے، ان کی اجازت کے بغیر عورت کو نکاح کی اجازت نہیں۔ اگر کسی عورت کا ولی نہ ہو یا وہ ولایت کا اہل نہ رہے کہ اس کا نکاح کرنے کے بجائے نکاح کی راہ میں کسی معقول وجہ کے بغیر رکاوٹ بنا رہے تو حاکم وقت اس کا ولی ہے اور اسے حکم ہے کہ اس کا نکاح کرے۔ عائشہ رضی اللہ عنھا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَيُّمَا امْرَأَةٍ نَكَحَتْ بِغَيْرِ إِذْنِ مَوَالِيْهَا فَنِكَاحُهَا بَاطِلٌ، ثَلاَثَ مَرَّاتٍ، فَإِنْ دَخَلَ بِهَا فَالْمَهْرُ لَهَا بِمَا أَصَابَ مِنْهَا فَإِنْ تَشَاجَرُوْا فَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُ ] [أبوداوٗد، النکاح، باب في الولي : ۲۰۸۳ ] ’’جو عورت اپنے اولیاء کی اجازت کے بغیر نکاح کرے تو اس کا نکاح باطل ہے۔‘‘ تین دفعہ فرمایا، پھر فرمایا : ’’اگر شوہر اس عورت سے صحبت کر لے تو اسے مہر دینا پڑے گا، اس سے فائدہ حاصل کرنے کی وجہ سے اور اگر وہ اولیاء آپس میں جھگڑ پڑیں تو جس کا کوئی ولی نہ ہو سلطان اس کا ولی ہے۔‘‘ ¤ رہے مرد تو ان کا نکاح کسی ولی کی اجازت پر موقوف نہیں، مگر ظاہر ہے کہ بچے کے جوان ہونے پر اس کے والدین یا رشتہ دار جو اس کی کفالت کر رہے ہیں، اگر اس کے نکاح کی کوشش اور اس میں تعاون نہ کریں تو اس کے لیے نکاح بہت مشکل ہے، اس لیے انھیں حکم ہے کہ اپنے بچوں کا جوان ہونے پر جتنی جلدی ممکن ہو نکاح کر دیں۔ {’’ اَنْكِحُوْا ‘‘} (نکاح کر دو) کا لفظ عام ہونے کی وجہ سے اس کے مخاطب حکومت و عوام تمام مسلمان بھی ہیں کہ مردوں اور عورتوں کے نکاح میں وہ جس قدر بھی تعاون کر سکتے ہوں ان کا نکاح کروا دیں۔ جب دوسروں کا نکاح کروانے کا حکم ہے تو خود اپنا نکاح کروانا تو بدرجہ اولیٰ ضروری ہو گا۔ عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ ہم نبی صلی اللہ علیہ وسلم کے ساتھ ہوتے تھے، جوان تھے اور کوئی چیز نہ پاتے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں فرمایا : [ يَا مَعْشَرَ الشَّبَابِ! مَنِ اسْتَطَاعَ مِنْكُمُ الْبَائَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَّمْ يَيَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ] [ بخاري، النکاح، باب من لم یستطع البائۃ فلیصم : ۵۰۶۶، ۵۰۶۵ ] ’’اے جوانو کی جماعت! تم میں سے جو نکاح کر سکتا ہو وہ نکاح کرلے، کیونکہ وہ نظر کو بہت نیچا کرنے والا اور شرم گاہ کو بہت محفوظ رکھنے والا ہے اور جو نکاح کا سامان نہ پائے وہ روزے کو لازم پکڑے، کیونکہ وہ اس کے لیے (شہوت) کچلنے کا باعث ہے۔‘‘ ¤ ➍ { وَ الصّٰلِحِيْنَ مِنْ عِبَادِكُمْ وَ اِمَآىِٕكُمْ:’’ الصّٰلِحِيْنَ ‘‘} سے مراد دین کی صلاحیت (نیکی) بھی ہو سکتی ہے، اس صورت میں غلام یا لونڈی میں سے صالح وہ ہو گا جو فاجر اور زانی نہ ہو۔ اس کے مالک کو اس کی نیکی کے انعام اور مزید نیکی کی ترغیب دلانے کے لیے اس کا نکاح کر دینا چاہیے۔ رہا زانی تو وہ کیونکہ صالح نہیں فاسد ہے، اس لیے اس کا نکاح جائز نہیں، جب تک توبہ کرکے صالح نہ بن جائے۔ گویا یہ سورت کے آغاز میں مذکور حکم {’’ اَلزَّانِيْ لَا يَنْكِحُ اِلَّا زَانِيَةً اَوْ مُشْرِكَةً وَّ الزَّانِيَةُ لَا يَنْكِحُهَاۤ اِلَّا زَانٍ اَوْ مُشْرِكٌ وَ حُرِّمَ ذٰلِكَ عَلَى الْمُؤْمِنِيْنَ ‘‘} کی تائید ہے۔ غللاموں میں خاص طور پر یہ شرط لگانے کی وجہ یہ معلوم ہوتی ہے کہ اکثر یہ بیماری اس طبقے میں ہوتی ہے، کیونکہ وہ اس شرف سے محروم ہوتے ہیں جو معاشرے میں کسی آزاد مرد یا عورت کو اپنی عزت کی حفاظت پر مجبور کرتا ہے۔ (سعدی) اس لیے اہل علم نے یوسف علیہ السلام کے زنا سے بچنے کو عفت کا کمال قرار دیا ہے، کیونکہ دنیاوی لحاظ سے انھیں زنا سے روکنے والی کوئی چیز موجود نہیں تھی، حتیٰ کہ ان کے پاس حرّیت بھی نہیں تھی۔ (تفصیل سورۂ یوسف میں ملاحظہ فرمائیں) {’’ الصّٰلِحِيْنَ ‘‘} سے مراد یہ بھی ہو سکتا ہے کہ وہ لونڈی یا غلام جو نکاح کی صلاحیت رکھتے ہوں اور انھیں اس کی ضرورت ہو۔ اس کی تائید اس بات سے ہوتی ہے کہ اگر غلام یا لونڈی کو نکاح کی حاجت نہ ہو تو مالک کو اس کے نکاح کا حکم نہیں اور {’’ الصّٰلِحِيْنَ ‘‘} کے دونوں معنی مراد لیے جائیں تو کچھ بعید نہیں۔ (سعدی) ¤ ➎ { اِنْ يَّكُوْنُوْا فُقَرَآءَ يُغْنِهِمُ اللّٰهُ مِنْ فَضْلِهٖ :} عام طور پر غربت کو مرد کے نکاح کی راہ میں رکاوٹ سمجھا جاتا ہے کہ جب اس کے پاس کچھ ہے ہی نہیں تو بیوی کو کہاں سے کھلائے گا، اس لیے غریب کو کوئی رشتہ نہیں دیتا۔ اللہ تعالیٰ نے اس خیال کی تردید کی اور فرمایا کہ تم مجرد لوگوں کا نکاح کر دو، اگر وہ فقیر ہیں تو اللہ تعالیٰ انھیں غنی کر دے گا۔ اللہ تعالیٰ کے پاس غیب سے غنی کر دینے کا اختیار ہے اور اسباب کے لحاظ سے بھی بیوی آنے کے بعد وہ کمائی کے لیے زیادہ جدو جہد کرے گا۔ کھانا تو پہلے وہ خود بھی کھاتا ہے، اگر مزید کمائی نہ بھی کرے تو رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق ایک کا کھانا دو کے لیے کافی ہوتا ہے۔ [ دیکھیے، بخاری : ۵۳۹۲ ] پہلے یہ اکیلا کمائی کرتا تھا، بیوی آنے کے بعد اس کی کمائی کی استعداد دو گنا ہی نہیں بلکہ مشہور عام قول کے مطابق گیارہ گنا ہو جائے گی۔ بیوی اس کا ہاتھ بٹائے گی، ہو سکتا ہے کہ بیوی کو اللہ تعالیٰ نے کوئی ہنر عطا کر رکھا ہو، یا وہ بہتر مشورے دے کر خاوند کی بہترین مشیر ثابت ہو، یا بیوی کے رشتہ داروں کے تعاون سے حالت بدل جائے۔ علاوہ ازیں اولاد ہونے کے بعد عین ممکن ہے کہ وہ اتنی کمائی کریں کہ پورا کنبہ ہی اغنیاء میں شامل ہو جائے۔ اس کے برعکس کسی غنی کو لڑکی دے تو ہو سکتا ہے کسی آزمائش میں وہ فقیر ہو جائے۔ اللہ نے فرمایا : «{ قُلِ اللّٰهُمَّ مٰلِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَآءُ وَ تَنْزِعُ الْمُلْكَ مِمَّنْ تَشَآءُ وَ تُعِزُّ مَنْ تَشَآءُ وَ تُذِلُّ مَنْ تَشَآءُ بِيَدِكَ الْخَيْرُ اِنَّكَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ (26) تُوْلِجُ الَّيْلَ فِي النَّهَارِ وَ تُوْلِجُ النَّهَارَ فِي الَّيْلِ وَ تُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَ تُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَ تَرْزُقُ مَنْ تَشَآءُ بِغَيْرِ حِسَابٍ}}» [ آل عمران : ۲۶، ۲۷ ] ’’کہہ دے اے اللہ! بادشاہی کے مالک! تو جسے چاہے بادشاہی دیتا ہے اور جس سے چاہے بادشاہی چھین لیتا ہے اور جسے چاہے عزت دیتا ہے اور جسے چاہے ذلیل کر دیتا ہے، تیرے ہی ہاتھ میں ہر بھلائی ہے، بے شک تو ہر چیز پر پوری طرح قادر ہے۔ تو رات کو دن میں داخل کرتا ہے اور تو دن کو رات میں داخل کرتا ہے اور تو زندہ کو مردہ سے نکالتا ہے اور تو مردہ کو زندہ سے نکالتا ہے اور تو جسے چاہے کسی حساب کے بغیر رزق دیتا ہے۔‘‘ یہ سب کچھ عام مشاہدے میں آتا رہتا ہے۔ دولت دھوپ چھاؤں کی طرح آج یہاں ہے تو کل وہاں، بلکہ دولت کا معنی ہی گھومنا ہے، اس لیے رسول اللہ صلی اللہ علیہ وسلم نے اس صحابی کا نکاح بھی کر دیا تھا جس کے پاس ایک چادر کے سوا کچھ نہیں تھا، حتیٰ کہ لوہے کی انگوٹھی بھی نہیں تھی۔ (دیکھیے بخاری : ۵۰۲۹) یہ خیال ہی نہیں فرمایا کہ یہ بیوی کو کہاں سے کھلائے گا۔ اس لیے اہل علم نے دولت مند بننے کے اسباب میں سے نکاح کو بھی ایک سبب قرار دیا ہے۔ حافظ ابن کثیر رحمہ اللہ نے فرمایا : ’’بعض لوگ ایک روایت بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’فقیری میں بھی نکاح کیا کرو، اللہ تمھیں غنی کر دے گا۔‘‘ میری نگاہ سے تو یہ روایت نہیں گزری، نہ کسی قوی سند سے، نہ ضعیف سند سے اور نہ ہمیں اس مضمون کے لیے ایسی بے اصل روایت کی کوئی ضرورت ہے، کیونکہ قرآن کی یہ آیت اور (لوہے کی انگوٹھی تک نہ رکھنے والے سے نکاح والی) حدیث اس کے لیے کافی ہے۔ (وللہ الحمد)‘‘ ( ابن کثیر) ¤ ایسی ہی ایک روایت عام مشہور ہے کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس فقر کی شکایت لے کر آیا، آپ صلی اللہ علیہ وسلم نے فرمایا : ’’نکاح کر لو۔‘‘ اس نے نکاح کر لیا مگر غربت بدستور مسلط رہی، وہ پھر شکایت لے کر آیا تو آپ صلی اللہ علیہ وسلم نے پھر نکاح کا حکم دیا۔ اس نے دوسرا نکاح کر لیا، پھر بھی وہی حال رہا تو وہ پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، آپ صلی اللہ علیہ وسلم نے پھر نکاح کا حکم دیا۔ تیسرے نکاح پر بھی غربت دور نہ ہوئی تو اس نے پھر آ کر شکایت کی، تو آپ صلی اللہ علیہ وسلم نے چوتھے نکاح کا حکم دیا، اس نے اس پر عمل کیا تو اس کی غربت دور ہو گئی۔ میں نے یہ روایت بہت تلاش کی مگر کسی معتبر کتاب میں نہیں ملی اور نہ یہ روایت نقل کرنے والے کسی صاحب نے اس کا حوالہ دیا ہے۔ ایسی باتوں کا بے سروپا ہونا خود اس کے مضمون سے ظاہر ہوتا ہے۔ ایسے فقیر کو یکے بعد دیگرے چار بیویاں ملتے چلے جانے کی کوئی مثال مشکل ہی سے ملے گی۔ ¤ ➏ { وَ اللّٰهُ وَاسِعٌ عَلِيْمٌ :} واؤ عطف سے معلوم ہوتا ہے کہ اس کا عطف پہلے جملے پر ہے جو {’’ يُغْنِيَهُمُ اللّٰهُ مِنْ فَضْلِهٖ ‘‘} سے خود بخود سمجھ میں آنے کی وجہ سے حذف کر دیا گیا ہے اور یہ اختصار قرآن کی بلاغت کا اعجاز ہے۔ گویا محذوف جملے کو ظاہر کیا جائے تو عبارت یوں ہو گی : {’’ أَنْ يَّكُوْنُوْا فُقَرَآءَ يُغْنِهِمُ اللّٰهُ مِنْ فَضْلِهِ فَاللّٰهُ ذُوْ فَضْلٍ عَظِيْمٍ وَاوَاللّٰهُ وَاسِعٌ عَلِيْمٌ‘‘} یہاں {’’ وَاسِعٌ ‘‘ } اور {’’عَلِيْمٌ‘‘} صفات لانے کی مناسبت یہ ہے کہ اللہ وسعتت والا ہے، اس کے ہاں کوئی کمی نہیں، وہ جسے چاہے، خواہ وہ کتنا کنگال کیوں نہ ہو، اسے غنی کر دیتا ہے اور وہ سب کچھ جاننے والا ہے، اسے معلوم ہے کہ کسے غنی کرنا ہے اور کس طرح اور کن اسباب کے ذریعے سے غنی کرنا ہے۔ (بقاعی)"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ {وَ لْيَسْتَعْفِفِ الَّذِيْنَ لَا يَجِدُوْنَ نِكَاحًا: ’’عَفَّ يَعِفُّ عَفَافًا وَ عِفَّةً‘‘} اس چیز سے باز رہنا جو حلال نہ ہو یا جمیل نہ ہو۔ {’’اِسْتَعَفَّ‘‘} اور {’’ تَعَفَّفَ‘‘} کا بھی یہی معنی ہے۔ (القاموس) {’’ وَ لْيَسْتَعْفِفِ ‘‘} میں حروف کے اضافے کی وجہ سے معنی میں اضافہ ہو گیا، اس لیے ترجمہ کیا گیا ہے ’’اور حرام سے بہت بچیں۔‘‘ یعنی جو لوگ کسی وجہ سے نکاح نہ کر سکیں، مثلاً رشتہ نہ ملے، یا مہر میسر نہ ہو، یا غلام کو اس کا مالک نکاح کی اجازت نہ دے، یا کسی اور وجہ سے حالات سازگار نہ ہوں تو وہ حرام سے بچنے کی بہت زیادہ کوشش کریں، یعنی زنا، قوم لوط کے عمل اور استمنا بالید وغیرہ سے باز رہیں۔ اس کوشش میں نگاہ نیچی رکھنا، بلااجازت دوسروں کے گھروں میں نہ جانا اور خیالات کو پاکیزہ رکھنا وغیرہ آداب شامل ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے انسان کی اس منہ زور قوت یعنی شہوت کی آفات سے محفوظ رہنے کے لیے نکاح کا حکم دیا اور جسے نکاح میسر نہ ہو اسے زیادہ سے زیادہ نفلی روزے رکھنے کا حکم دیا اور فرمایا : ’’یہ اس کے لیے (شہوت) کچلنے کا باعث ہو گا۔‘‘ [ دیکھیے بخاري : ۱۹۰۵ ] آپ صلی اللہ علیہ وسلم نے شہوت کو روزے کے ساتھ کچلنے کا حکم دیا، کیونکہ اس سے شہوت کمزور ہونے کے علاوہ ضبط نفس کی عادت بھی پڑتی ہے۔ بعض اوقات خیال ہوتا ہے کہ روزے سے تو شہوت قوی ہوئی ہے، یہ خیال فرض روزوں یا کبھی کبھار روزے کی حد تک تو صحیح ہے، کیونکہ جب صحت بہتر ہوتی ہے تو ہر قوت مضبوط ہوتی ہے، مگر مسلسل روزے رکھنے کا نتیجہ وہی ہے جو رسول اللہ صلی اللہ علیہ وسلم نے بیان فرمایا اور آپ کے تجویز کر دہ نسخے میں ضبط نفس کی عادت بھی ہے اور کوئی نقصان بھی نہیں، کیونکہ روزے چھوڑنے سے وہ قوت پھر بحال ہو جائے گی جو افزائش نسل اور زمین کی رونق کا ذریعہ ہے۔ اس کے برعکس اگر کوئی شخص مسلسل دھنیا، یا کافور، یا پوٹاشیم برومائید، یا ایسی دوائیں استعمال کرے جن سے شہوت ختم ہو جائے تو اس کا نتیجہ نہایت نقصان دہ نکلتا ہے، کیونکہ دوائیں چھوڑنے کے باوجود بعض اوقات وہ قوت دوبارہ بحال ہی نہیں ہوتی، یہ ایک قسم کا خصی ہونا ہے، جو حرام ہے ۔ ¤ ➋ { حَتّٰى يُغْنِيَهُمُ اللّٰهُ مِنْ فَضْلِهٖ :} اس میں پاک دامن رہنے والوں کے لیے وعدہ ہے کہ اللہ تعالیٰ انھیں غنی کرے گا اور ان کے لیے آسانی پیدا فرمائے گا۔ مومن کا اللہ کے وعدے پر یقین اس کے لیے انتظار کی مشقت کو آسان بنا دیتا ہے۔ (سعدی) ¤ عرفی اگر بگریہ میسر شدے وصال ¤ صد سال می تو اں بتمنا گریستن ¤ ’’عرفی! اگر رونے سے وصل کی دولت میسر ہو سکتی تو تمنا میں سو سال بھی رویا جا سکتا ہے۔‘‘ ¤ ➌ {وَ الَّذِيْنَ يَبْتَغُوْنَ الْكِتٰبَ …: ’’ الْكِتٰبَ ‘‘} باب مفاعلہ کا مصدر ہے، جیسے {’’قَاتَلَ يُقَاتِلُ مُقَاتَلَةً وَ قِتَالًا‘‘} ہے، یعنی غلام اور اس کے مالک کے درمیان آزادی کی تحریر کہ غلام اتنی رقم قسطوں میں فلاں مدت تک ادا کرے گا تو اسے آزادی مل جائے گی، اسے {’’اَلْكِتَابُ‘‘، ’’اَلْكِتَابَةُ‘‘ } یا {’’اَلْمُكَاتَبَةُ ‘‘} کہتے ہیں۔ پچھلی آیت میں مالکوں کو اپنے صالح غلاموں اور لونڈیوں کا نکاح کرنے کا حکم دیا۔ ان کے نکاح میں دو بڑی رکاوٹیں ہو سکتی تھیں، ایک یہ کہ مالک انھیں نکاح کی اجازت نہ دے، دوسری یہ کہ وہ خود نکاح سے اجتناب کریں، کیونکہ غلام ہوتے ہوئے ان کے جتنے بچے پیدا ہوں گے، وہ ان کی طرح ان کے مالک کے غلام ہوں گے۔ ان دونوں رکاوٹوں کا حل یہ تھا کہ وہ آزادی حاصل کرنے کی کوشش کریں اور اس کے لیے مالک کے ساتھ مکاتبت کر لیں۔ اللہ تعالیٰ نے مالکوں کو مکاتبت کا تقاضا کرنے والے لونڈی اور غلاموں کے ساتھ مکاتبت کرنے کا حکم دیا۔ اس سے معلوم ہوا کہ مکاتبت کا تقاضا کرنے والے غلاموں کے ساتھ مکاتبت سے انکار جائز نہیں۔ اس کی دلیل یہ ہے کہ امر وجوب کے لیے ہوتا ہے، اگر اس کے خلاف کوئی قرینہ نہ ہو۔ امام بخاری رحمہ اللہ نے صحیح بخاری میں یہی آیت : «{ وَ الَّذِيْنَ يَبْتَغُوْنَ الْكِتٰبَ …}» درج کرنے کے بعد لکھا ہے کہ ابن جریج بیان کرتے ہیں کہ میں نے عطاء (تابعی کبیر) سے کہا : ’’کیا مجھ پر واجب ہے کہ میں اپنے غلام سے مکاتبت کروں، جب مجھے معلوم ہو کہ اس کے پاس مال ہے؟‘‘ تو انھوں نے فرمایا : ’’میں تو اسے واجب ہی سمجھتا ہوں۔‘‘ عمرو بن دینار نے بیان کیا کہ میں نے عطاء سے پوچھا : ’’کیا آپ یہ بات کسی سے نقل کرتے ہیں؟‘‘ انھوں نے فرمایا : ’’نہیں‘‘ پھر انھوں نے مجھے بتایا کہ انھیں موسیٰ بن انس نے بیان کیا کہ (مشہور امام محمد بن سیرین کے والد) سیرین نے انس رضی اللہ عنہ سے مکاتبت کا تقاضا کیا اور وہ بہت مال والا تھا، انس رضی اللہ عنہ نے انکار کر دیا تو سیرین، عمر رضی اللہ عنہ کے پاس چلا گیا، انھوں نے فرمایا : ’’اس سے مکاتبت کرو۔‘‘ انس رضی اللہ عنہ نے انکار کر دیا تو عمر رضی اللہ عنہ نے یہ آیت پڑھتے ہوئے انھیں درّے کے ساتھ مارا : «{ فَكَاتِبُوْهُمْ اِنْ عَلِمْتُمْ فِيْهِمْ خَييْرًا }» تو انس رضی اللہ عنہ نے اس سے مکاتبت کر لی۔ [ بخاري، المکاتب، باب المکاتب و نجومہ …، قبل ح : ۲۵۶۰ ] اس سے معلوم ہوا کہ اگر کوئی مالک غلام کے ساتھ مکاتبت کرنے سے انکار کر دے تو غلام عدالت میں جا سکتا ہے اور حاکم مالک کو مکاتبت پر مجبور کرے گا، جیسا کہ عمر رضی اللہ عنہ کے درّے کے ساتھ مارنے سے ثابت ہوتا ہے۔ ¤ ➍ { اِنْ عَلِمْتُمْ فِيْهِمْ خَيْرًا :} بعض اہل علم نے خیر سے مراد مال لیا ہے، مگر ظاہر ہے کہ اس صورت میں {’’إِنْ عَلِمْتُمْ لَهُمْ خَيْرًا‘‘} ہونا چاہیے تھا، یعنی اگر تم ان کے پاس خیر کا علم رکھتے ہو، جبکہ یہاں الفاظ یہ ہیں کہ اگر تم ان میں خیر کا علم رکھتے ہو۔ اس لیے خیر کا مطلب یہ ہے کہ ان میں اتنی استعداد اور قوت و امانت ہو کہ وہ کمائی کرکے اپنی قیمت ادا کر سکتے ہوں، مکاتبت کو کچھ عرصہ کام سے جان چھڑانے کا بہانہ نہ بنا رہے ہوں اور آزاد ہونے کے بعد چوری یا خیانت کے بغیر اپنی روزی کما سکتے ہوں، تاکہ آزاد ہو کر گدائی نہ کرتے پھریں اور مسلم معاشرے پر بوجھ نہ بنیں۔ خیر میں یہ بھی شامل ہے کہ وہ نیک اور پاک باز ہوں، تاکہ آزاد ہو کر بدکاری اور چوری ڈاکے کا ارتکاب نہ کرتے پھریں۔ ¤ بعض اہلِ علم کا کہنا ہے کہ مالک کے لیے مکاتبت کا تقاضا قبول کرنا مستحب ہے، واجب نہیں، کیونکہ یہ فیصلہ اس نے کرنا ہے کہ اس میں خیر ہے یا نہیں، پھر غلام اس کا مال ہے جو زبردستی اس سے لینا جائز نہیں۔ مگر یہ بات درست نہیں، کیونکہ جب اللہ تعالیٰ نے مکاتبت قبول کرنے کا حکم دیا ہے تو اس غلام کا حکم عام مال والا نہیں ہو سکتا اور غلام کو حق حاصل ہے کہ اگر مالک خواہ مخواہ اس میں خیر نہ ہو نے کا بہانہ بنا کر مکاتبت سے انکار کرتا ہے تو وہ اسلامی عدالت میں چلا جائے، جو سارے حالات کا جائزہ لے کر فیصلہ کرے گی کہ مالک کی بات درست ہے یا محض بہانہ ہے، جیسا کہ سیرین رحمہ اللہ کے عمر رضی اللہ عنہ کے پاس جانے سے ظاہر ہے۔ ¤ ➎ { وَ اٰتُوْهُمْ مِّنْ مَّالِ اللّٰهِ الَّذِيْۤ اٰتٰىكُمْ :} یہ حکم مکاتب کے مالک کو بھی ہے کہ وہ طے شدہ رقم کا ایک حصہ اسے چھوڑ دے، یا جو کچھ اس سے لیا ہے اس میں سے کچھ نہ کچھ واپس کر دے اور عام مسلمانوں کو بھی کہ ایسے غلاموں کو مال دے کر انھیں آزادی حاصل کرنے میں تعاون کریں۔ تعاون کی ترغیب کے لیے ارشاد ہے کہ تم جو مال انھیں دو گے وہ اللہ ہی کا عطا کردہ ہے اور اللہ تعالیٰ تمھیں حکم دے رہا ہے کہ اس کے دیے ہوئے مال میں سے انھیں دو، کیونکہ ایسے غلاموں کی مدد اس نے اپنے آپ پر حق قرار دی ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ ثَلَاثَةٌ حَقٌّ عَلَی اللّٰهِ عَزَّ وَ جَلَّ عَوْنُهُمُ الْمُكَاتَبُ الَّذِيْ يُرِيْدُ الْأَدَاءَ وَالنَّاكِحُ الَّذِيْ يُرِيْدُ الْعَفَافَ وَالْمُجَاهِدُ فِيْ سَبِييْلِ اللّٰهِ] [ نسائي، النکاح، باب معونۃ اللہ الناکح الذي یرید العفاف : ۳۲۲۰۔ ترمذي : ۱۶۵۵، قال الترمذي والألباني حسن ] ’’تین آدمیوں کی مدد اللہ پر حق ہے، وہ مکاتب جو ادائیگی کا ارادہ رکھتا ہے اور وہ نکاح کرنے والا جو حرام سے بچنے کا ارادہ رکھتا ہے اور مجاہد فی سبیل اللہ۔‘‘ اللہ تعالیٰ نے زکوٰۃ کے مصارف میں غلاموں کی آزادی کو باقاعدہ ایک مصرف مقرر فرمایا ہے، فرمایا : «{ وَ فِی الرِّقَابِ }» [ التوبۃ : ۶۰ ] یعنی گردنوں کو غلامی سے آزاد کرانے میں زکوٰۃ خرچ کی جائے۔ اس لیے اسلامی حکومت کی ذمہ داری ہے کہ وہ بیت المال میں سے مکاتب غلاموں کی رہائی کے لیے رقم خرچ کرے اور اللہ تعالیٰ کے نزدیک {’’ فَكُّ رَقَبَةٍ ‘‘} (گردن چھڑانا) عمل صالح کی دشوار گھاٹی کو عبور کرنے کا حصہ ہے۔ دیکھیے سورۂ بلد (۱۳)۔ ¤ مکاتب اپنی رہائی کے لیے لوگوں اور حکومت سے مالی امداد کی درخواست کر سکتا ہے، جیسا کہ بریرہ رضی اللہ عنھا نے اپنی مکاتبت میں امداد کے لیے ام المومنین عائشہ رضی اللہ عنھا سے درخواست کی اور انھوں نے پوری رقم یک مشت ادا کرکے انھیں خرید لیا اور آزاد کر دیا۔ [ دیکھیے بخاري : ۲۱۶۸ ] ¤ ➏ یہاں یہ بات یاد رکھنی چاہیے کہ عہد نبوی میں غلام تین قسم کے تھے، ایک وہ جو اصل میں آزاد تھے، لیکن کسی نے اغوا کر کے یا زبردستی غلام بنا لیا، دوسرے وہ جو نسل در نسل غلام چلے آتے تھے اور تیسرے وہ جو جنگ میں گرفتار کرکے لونڈی یا غلام بنائے جاتے تھے۔ ان غلاموں کی خرید و فروخت ہوتی تھی اور مالک ان کی محنت کو اپنی آمدنی کا ذریعہ سمجھتے تھے۔ جس کے پاس جتنے زیادہ غلام ہوتے وہ اتنا ہی صاحب حیثیت سمجھا جاتا۔ اسلام نے جو غلام موجود تھے ان کی آزادی کے لیے ہر ممکن صورت اختیار فرمائی، مگر غلامی کو اس طرح ممنوع قرار نہیں دیا جس طرح شراب یا سود کو ممنوع قرار دیا اور نہ تمام غلام آزاد کرنے کا جبری حکم صادر فرمایا، بلکہ غلام آزاد کرنے کی ترغیب دی، اس کا ثواب بیان فرمایا۔ ابوہریرہ رضی اللہ عنہ فرماتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرماتے تھے : [ مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً أَعْتَقَ اللّٰهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنَ النَّارِ حَتّٰی يُعْتِقَ فَرْجَهُ بِفَرْجِهِ ]] [ ترمذي، النذور و الأیمان، باب ما جاء في ثواب من أعتق رقبۃ : ۱۵۴۱، قال الترمذي حسن صحیح وقال الألباني صحیح ] ’’جو شخص کوئی مومن گردن آزاد کرے تو اللہ تعالیٰ اس کے ہر عضو کے بدلے اس کا ایک عضو آزاد کرے گا، یہاں تک کہ اس کی شرم گاہ کے بدلے اس کی شرم گاہ کو آزاد کرے گا۔‘‘ کئی کاموں کا کفارہ گردن آزاد کرنا مقرر فرمایا، مثلاً قسم، ظہار، قتلِ خطا اور فرض روزے کی حالت میں جماع کے کفارے میں ترجیح غلام آزاد کرنے کو دی۔ اس کے باوجود غلامی کو ممنوع اس لیے قرار نہیں دیا کہ قیامت تک جنگیں ہوتی رہیں گی اور قیدی بنتے رہیں گے۔ ایسے مواقع پر ایک غیر مسلم حکومت کے فوجی مفتوح قوم کی عورتوں پر جس طرح کی دست درازیاں کرتے اور ظلم و ستم ڈھاتے ہیں وہ ڈھکی چھپی بات نہیں۔ گزشتہ دونوں عالمگیر جنگوں میں بے بس قیدی عورتوں میں سے ایک ایک عورت سے جس طرح کئی کئی فوجیوں نے اپنی ہوس پوری کی اور جس درندگی کا ثبوت دیا وہ ان نام نہاد مہذب بھیڑیوں کے ماتھے پر لعنت کا بدترین داغ ہے۔ ان بیچاریوں کی صحت یا عزت یا اولاد کا ذمہ دار بننے کے لیے کوئی تیار نہیں ہوتا، جب کہ ہر ایک اپنی ہوس پوری کرنے کی زیادہ سے زیادہ کوشش کرتا ہے۔ اسلام نے ایسی فحاشی اور درندگی کو حرام قرار دیا اور لونڈیاں بنانے کی پاکیزہ راہ کھولی، جس میں اسیر عورت ایک شخص کی لونڈی ہوتی ہے، صرف اس کے لیے اس سے بیوی کی طرح فائدہ اٹھانا جائز ہوتا ہے۔ اس سے پیدا ہونے والی اولاد بیوی سے پیدا ہونے والی اولاد کی طرح باپ کی وارث ہوتی ہے اور بچوں کی ماں بن جانے کی صورت میں وہ مالک کی وفات کے بعد خود بخود آزاد ہو جاتی ہے۔ اس کے وارث اسے آزاد کروانا چاہیں تو کسی حکومت سے معاملہ کرنے کے بجائے اس کے مالک سے لین دین کرکے آسانی کے ساتھ آزاد کروا سکتے ہیں۔ غرض اسلام کا غلامی کی اجازت دینا مردوں اور عورتوں کی پاکیزگی اور عفت کا ضامن ہے۔ کفار نے غلامی کو سر ے سے ممنوع قرار دے کر قیدی بننے والے مردوں اور عورتوں پر کوئی احسان نہیں کیا، بلکہ ظلم و ستم اور بدکاری و درندگی کا دروازہ کھولا ہے اور یہی کفر کا نتیجہ ہے، جب کہ اسلام عدل، رحم، پاکیزگی اور پاک دامنی کا ضامن ہے اور غلاموں اور لونڈیوں کی سہولت اور آسائش کا اہتمام کرتا ہے اور ہر ممکن طریقے سے انھیں آزادی دلانے کے راستے کھولتا ہے۔ ¤ ➐ {وَ لَا تُكْرِهُوْا فَتَيٰتِكُمْ عَلَى الْبِغَآءِ … : ’’ الْبِغَآءِ ‘‘} کا معنی زنا ہے، مگر یہ لفظ صرف عورت کے زنا پر بولا جاتا ہے، کہا جاتا ہے : {’’بَغَتْ، تَبْغِيْ بِغَاءً، فَهِيَ بَغِيٌّ وَ لِلْجَمَاعَةِ بَغَايَا۔‘‘} {’’فَتَيَاتٌ‘‘ ’’ فَتَاةٌ ‘‘} کی جمع ہے، معنی اس کا جوان لڑکی ہے، جیسا ککہ {’’فَتًي‘‘} کا معنی جوان لڑکا ہے۔ عام طور پر غلام اور لونڈی پر {’’عَبْدٌ‘‘} اور {’’أَمَةٌ‘‘} کا لفظ بولا جاتا ہے، جیسا کہ پچھلی آیت میں اللہ تعالیٰ نے فرمایا : «{ وَ اَنْكِحُوا الْاَيَامٰى مِنْكُمْ وَ الصّٰلِحِيْنَ مِنْ عِبَادِكُمْ وَ اِمَآىِٕكُمْ }» اس لیے غلام اور لونڈی پر {’’عَبْدٌ‘‘} اور {’’أَمَةٌ‘‘} کا لفظ بولنا جائز ہے، مگر بہتر یہ ہے کہ غلام کے لیے {’’فَتًي‘‘} اور لونڈی کے لیے {’’فَتَاةٌ‘‘} کا لفظ بولا جائے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا يَقُلْ أَحَدُكُمْ عَبْدِيْ وَلَا أَمَتِيْ، وَلْيَقُلْ فَتَايَ وَفَتَاتِيْ وَغُلاَمِيْ ] [ بخاری، العتق، باب کراھیۃ التطاول علی الرقیق : ۲۵۵۲، عن أبي ھریرۃ رضی اللہ عنہ ] ’’تم میں سے کوئی شخص {’’عَبْدِيْ‘‘} اور {’’أَمَتِيْ‘‘} نہ کہے، بلکہ {’’فَتَايَ‘‘، ’’فَتَاتِيْ‘‘} اور{ ’’غُلَامِيْ‘‘ } کہے۔‘‘ یہاں لونڈیوں کے لیے {’’إِمَائَكُمْ‘‘} کے بجائے {’’ فَتَيٰتِكُمْ ‘‘} کا لفظ استعمال کرنے میں ان لونڈیوں کی فتوت (جواں مردی) کا بیان مقصود ہے کہ وہ لونڈیاں ہو کر بھی پاک دامن رہنا چاہتی ہیں۔ (بقاعی) یہاں ایک سوال ہے کہ اللہ تعالیٰ نے فرمایا کہ ’’اپنی لونڈیوں کو بدکاری پر مجبور نہ کرو، اگر وہ پاک دامن رہنا چاہیں۔‘‘ تو کیا اس کا مطلب یہ ہے کہ اگر وہ پاک دامن نہ رہنا چاہیں تو انھیں بدکاری پر مجبور کیا جا سکتا ہے۔ اہل علم نے اس کا دو طرح سے جواب دیا ہے، ایک یہ کہ بدکاری پر مجبور اسی کو کیا جاتا ہے جو پاک دامن رہنا چاہے، جو پاک دامن رہنا ہی نہ چاہے اسے بدکاری پر مجبور کرنے کی ضرورت ہی کیا ہے کہ کہا جائے اسے بدکاری پر مجبور نہ کرو۔ دوسرا جواب اس کا یہ ہے کہ لفظ {’’ اِنْ ‘‘ } (اگر) یہاں شرط کے لیے نہیں بلکہ اس واقعہ کے بیان کے لیے ہے جس پر یہ آیت اتری۔ واقعہ یہ تھا کہ عبدا للہ بن ابی اور اس قسم کے بدقماش اپنی لونڈیوں کو بدکاری پر مجبور کرتے تھے، جب کہ وہ پاک دامن رہنا چاہتی تھیں۔ چنانچہ جابر بن عبدا للہ رضی اللہ عنھما بیان کرتے ہیں کہ عبد اللہ بن ابی ابن سلول کی ایک لونڈی کا نام مُسیکہ تھا اور دوسری کا نام امیمہ تھا، وہ انھیں بدکاری پر مجبور کرتا تھا، ان دونوں نے اس کی شکایت رسول اللہ صلی اللہ علیہ وسلم کے پاس کی تو اللہ تعالیٰ نے یہ آیت نازل فرمائی : « وَ لَا تُكْرِهُوْا فَتَيٰتِكُمْ عَلَى الْبِغَآءِ اِنْ اَرَدْنَ تَحَصُّنًا لِّتتَبْتَغُوْا عَرَضَ الْحَيٰوةِ الدُّنْيَاوَ مَنْ يُّكْرِهْهُّننَّ فَاِنَّ اللّٰهَ مِنْۢ بَعْدِ اِكْرَاهِهِنَّ غَفُوْرٌ رَّحِيْمٌ » [ مسلم، التفسیر، باب في قولہ تعالٰی : «ولا تكرهوا فتياتكم علي البغاء» : 3029/27 ] اس کی ایک مثال یہ آیت ہے : «{ وَ اِذَا ضَرَبْتُمْ فِي الْاَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ اَنْ تَقْصُرُوْا مِنَ الصَّلٰوةِ اِنْ خِفْتُمْ اَنْ يَّفْتِنَكُمُ الَّذِيْنَ كَفَرُوْا }» [ النساء : ۱۰۱ ] ’’اور جب تم زمین میں سفر کرو تو تم پر کوئی گناہ نہیں کہ نماز کچھ کم کر لو، اگر ڈرو کہ تمھیں وہ لوگ فتنے میں ڈال دیں گے جنھوں نے کفر کیا۔‘‘ یہاں خوف کا ذکر شرط کے لیے نہیں بلکہ اس واقعہ کو مدنظر رکھتے ہوئے ہے جس موقع پر یہ آیت اتری تھی۔ یہ دوسرا جواب پہلے کی بہ نسبت زیادہ صحیح ہے، کیونکہ لونڈیاں پاک دامن نہ بھی رہنا چاہیں تو ضروری نہیں کہ وہ اس شخص سے زنا پر بھی راضی ہوں جس پر ان کا مالک انھیں مجبور کر رہا ہے۔ ¤ ➑ { لِتَبْتَغُوْا عَرَضَ الْحَيٰوةِ الدُّنْيَا:} اس کا مطلب یہ نہیں کہ اگر دنیا کا مال طلب کرنا مقصود نہ ہو تو لونڈیوں سے زنا کروایا جا سکتا ہے، بلکہ یہ بھی بیان واقعہ کے لیے ہے کہ یہ کام کرنے والوں کا مقصد دنیا کے سازو سامان کی طلب تھا۔ چنانچہ صحیح مسلم ہی کی ایک روایت میں ہے کہ عبد اللہ بن ابی اپنی ایک لونڈی سے کہا کرتا تھا کہ جاؤ اور ہمارے لیے کچھ تلاش کرکے لاؤ، تو اس پر یہ آیت اتری۔ [ دیکھیے مسلم : ۳۰۲۹ ] رسول اللہ صلی اللہ علیہ وسلم نے عورت کی بدکاری کی کمائی سے منع فرمایا، ابومسعود انصاری رضی اللہ عنہ فرماتے ہیں : ’’رسول اللہ صلی اللہ علیہ وسلم نے کتے کی قیمت، زانیہ کی آمدنی اور کاہن کی شیرینی سے منع فرمایا۔‘‘ [ بخاري، البیوع، باب ثمن الکلب : ۲۲۳۷ ] ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ لَا يَحِلُّ ثَمَنُ الْكَلْبِ وَلَا حُلْوَانُ الْكَاهِنِ وَلَا مَهْرُ الْبَغِيِّ ] [ نسائي، الصید والذبائح، باب النھي عن ثمن الکلب : ۴۲۹۸ ] ’’نہ کتے کی قیمت حلال ہے، نہ کاہن کی شیرینی اور نہ زانیہ کی آمدنی۔‘‘ ¤ ➒ { وَ مَنْ يُّكْرِهْهُّنَّ فَاِنَّ اللّٰهَ مِنْۢ بَعْدِ اِكْرَاهِهِنَّ غَفُوْرٌ رَّحِيْمٌ :} زنا ایک ایسا فعل ہے کہ مجبور ہو کر کرنے سے بھی نفس کی لذت کا دخل اس میں ہو ہی جاتا ہے، اس لیے اللہ تعالیٰ نے فرمایا کہ لونڈیوں کو مجبور کیے جانے کے بعد ان کی گناہ میں شرکت پر کوئی مؤاخذہ نہیں۔ اللہ تعالیٰ ان کے لیے غفور و رحیم ہے، ان کا گناہ مجبور کرنے والوں پر ہے۔ علی بن ابی طلحہ کی روایت سے ابن عباس رضی اللہ عنھما کی تفسیر یہی ہے اور یہی ظاہر بھی ہے اور راجح بھی۔ تفسیر سعدی میں ہے : ’’اس آیت میں لونڈیوں کو زنا پر مجبور کرنے والوں کو توبہ کی دعوت دی گئی ہے کہ وہ بھی اگر توبہ کریں تو اللہ تعالیٰ ان کے مجبور کرنے کے گناہ کے بعد بھی غفور و رحیم ہے، اس لیے انھیں چاہیے کہ اللہ کی جناب میں توبہ کریں اور آئندہ اس جرم سے باز آ جائیں۔‘‘ اس آیت کے علاوہ اللہ کی رحمت کی ایک جھلک اس آیت میں بھی دکھائی دیتی ہے : «{ اِنَّ الَّذِيْنَ فَتَنُوا الْمُؤْمِنِيْنَ وَ الْمُؤْمِنٰتِ ثُمَّ لَمْ يَتُوْبُوْا فَلَهُمْ عَذَابُ جَهَنَّمَ وَ لَهُمْ عَذَابُ الْحَرِيْقِ }» [ البروج : ۱۰ ] ’’یقینا وہ لوگ جنھوں نے مومن مردوں اور مومن عورتوں کو آزمائش میں ڈالا، پھر انھوں نے توبہ نہیں کی تو ان کے لیے جہنم کا عذاب ہے اور ان کے لیے جلنے کا عذاب ہے۔‘‘ کوئی حد ہے اللہ تعالیٰ کی صفت مغفرت و رحمت کی کہ اس کے دوستوں کو آگ میں جلا کر تماشا دیکھنے والوں کے لیے بھی جہنم کے عذاب کی وعید تب ہے جب انھوں نے توبہ نہ کی ہو۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ {وَ لَقَدْ اَنْزَلْنَاۤ اِلَيْكُمْ اٰيٰتٍ مُّبَيِّنٰتٍ: ’’ مُبَيِّنٰتٍ ‘‘} باب تفعیل سے اسم فاعل {’’مُبَيِّنَةٌ‘‘} کی جمع ہے، یہ باب لازم و متعدی دونوں میں آتا ہے، یہاں دونوں معنی اکٹھے بھی مراد ہو سکتے ہیں، یعنی اللہ تعالیٰ کی آیات واضح اور آسانی سے سمجھ میں آنے والی بھی ہیں اور اللہ تعالیٰ کے احکام و فرامین کو خوب واضح کرنے والی بھی ہیں۔ ان آیات سے مراد نبی صلی اللہ علیہ وسلم پر نازل ہونے والی تمام آیات ہیں، اگرچہ سب سے پہلے اس سورت میں مذکور آیات و احکام مراد ہیں، جیسا کہ فرمایا : «{ سُوْرَةٌ اَنْزَلْنٰهَا وَ فَرَضْنٰهَا وَ اَنْزَلْنَا فِيْهَاۤ اٰيٰتٍۭ بَيِّنٰتٍ لَّعَلَّكُمْ تَذَكَّرُوْنَ }» [ النور : ۱ ] ’’(یہ) ایک عظیم سورت ہے، ہم نے اسے نازل کیا اور ہم نے اسے فرض کیا اور ہم نے اس میں واضح آیات اتاری ہیں، تاکہ تم نصیحت حاصل کرو۔‘‘ ¤ ➋ { وَ مَثَلًا مِّنَ الَّذِيْنَ خَلَوْا مِنْ قَبْلِكُمْ : ’’أَيْ وَ أَنْزَلْنَا مَثَلًا مِنَ الَّذِيْنَ خَلَوْا مِنْ قَبْلِكُمْ۔‘‘ ’’ مَثَلًا ‘‘} کا معنی ہے ضرب المثل، وہ چیز جو دوسری چیز کے مشابہ ہو، کسی کا حال جو دوسرے کے حال سے ملتا جلتا ہو، کسی چیز کی صفت اور قصہ عجیبہ، یعنی ہم نے تمھاری طرف کھول کر بیان کرنے والی آیات نازل کی ہیں اور پہلے لوگوں کے کچھ احوال نازل کیے ہیں جو تمھارے احوال سے ملتے جلتے ہیں۔ اس میں وہ احکام و حدود بھی شامل ہیں جو امت مسلمہ کی طرح پہلی امتوں پر فرض کیے گئے تھے، مثلاً زنا کی حد، قصاص، فحاشی کی اشاعت کی روک تھام وغیرہ اور پہلی امتوں کے وہ حالات و واقعات جو اس امت کے احوال سے ملتے جلتے ہیں، مثلاً عائشہ رضی اللہ عنھا پر بہتان کا واقعہ اور مریم علیھا السلام پر یہودیوں کے بہتان اور یوسف علیہ السلام پر عزیزِ مصر کی بیوی کے بہتان کا واقعہ ایک دوسرے سے ملتے جلتے ہیں۔ تینوں واقعات میں اللہ تعالیٰ نے اپنے مومن بندوں کی پاک دامنی قیامت تک کے لیے قرآن میں ثبت فرما دی اور بہتان لگانے والوں کا جھوٹ ہمیشہ کے لیے واضح کر دیا۔ ¤ ➌ { وَ مَوْعِظَةً لِّلْمُتَّقِيْنَ۠ : ’’ أَيْ وَ أَنْزَلْنَا مَوْعِظَةً ‘‘} یعنی ہم نے ڈرنے والوں اور نافرمانی سے بچنے والوں کے لیے عظیم نصیحت نازل فرمائی، کیونکہ جسے اللہ کا خوف نہیں اسے ان آیات سے کچھ حاصل نہیں۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ {اَللّٰهُ نُوْرُ السَّمٰوٰتِ وَ الْاَرْضِ:} ’’اللہ ہی آسمانوں اور زمین کا نور ہے‘‘  یعنی آسمان و زمین جو روشن ہیں تو اللہ کے نور ہی سے روشن ہیں۔ وہ نہ ہو توکچھ بھی نہ ہو۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یعنی اللہ سے رونق اور بستی ہے زمین اور آسمان کی۔ اس کی مدد نہ ہو تو سب ویران ہو جائیں۔‘‘ یاد رہے، یہاں اللہ کے آسمان و زمین کا نور ہونے کا یہ مطلب نہیں کہ اللہ تعالیٰ کا ذاتی نور آسمان و زمین کا نور ہے اور اسے روشن کرنے والا ہے۔ اس کی دلیل یہ ہے کہ اس آیت میں مذکور نور کی مثال بیان کی گئی ہے، جب کہ اللہ کی کوئی مثال ہے ہی نہیں، جیسا کہ فرمایا : «{ لَيْسَ كَمِثْلِهٖ شَيْءٌ }» [ الشورٰی : ۱۱ ] ’’اس کی مثل کوئی چیز نہیں۔‘‘ دوسری دلیل یہ کہ اس آیت میں اس نور کا ذکر ہے جس سے آسمان و زمین روشن ہیں، جب کہ اللہ تعالیٰ کا ذاتی نور حجاب کے پیچھے ہے۔ ابوموسیٰ رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم میں کھڑے ہو کر پانچ باتیں بیان فرمائیں، آپ نے فرمایا : [ إِنَّ اللّٰهَ عَزَّ وَجَلَّ لَا يَنَامُ وَلَا يَنْبَغِيْ لَهُ أَنْ يَّنَامَ، يَخْفِضُ الْقِسْطَ وَ يَرْفَعُهُ، يُرْفَعُ إِلَيْهِ عَمَلُ اللَّيْلِ قَبْلَ عَمَلِ النَّهَارِ وَ عَمَلُ النَّهَارِ قَبْلَ عَمَلِ اللَّيْلِ، حِجَابُهُ النُّوْرُ، لَوْ كَشَفَهُ لَأَحْرَقَتْ سُبُحَاتُ وَجْهِهِ مَا انْتَهَی إِلَيْهِ بَصَرُهُ مِنْ خَلْقِهِ] [مسلم، الإیمان، باب في قولہ علیہ السلام ’’إن اللہ لا ینام‘‘ …:۱۷۹ ] ’’اللہ عزوجل سوتا نہیں اور اس کے لائق ہی نہیں کہ وہ سوئے، وہ ترازو کو نیچا کرتا ہہے اور اسے اونچا کرتا ہے، رات کا عمل دن کے عمل سے پہلے اور دن کا عمل رات کے عمل سے پہلے اس کی طرف اوپر لے جایا جاتا ہے اور اس کا حجاب نور ہے، اگر وہ اسے ہٹا دے تو اس کے چہرے کی شعاعیں اس کی مخلوق میں سے ہر اس چیز کو جلا دیں جہاں تک اس کی نگاہ پہنچتی ہے۔‘‘ ¤ ➋ اس آیت میں {’’ نُوْرُ ‘‘} کا معنی {’’ذُوْ نُوْرٍ‘‘} ہے، یعنی روشن کرنے والا، جیسا کہ {’’زَيْدٌ عَدْلٌ‘‘} کا معنی یہ نہیں کہ زید عدل و انصاف ہے، بلکہ اس کا معنی ہے کہ زید عدل و انصاف والا ہے۔ بعض مفسرین نے یہی مفہوم ان الفاظ میں ادا فرمایا : {’’ اَللّٰهُ نَوَّرَ السَّمٰوَاتِ وَالْأَرْضَ ‘‘} یعنی اللہ ہی ہے جس نے آسمانوں اور زمین کو روشن فرمایا۔ (نقلہ ابن کثیر عن ضحاک) آسمانوں اور زمین سے سارا جہان مراد ہے، یعنی کائنات کی ہر چیز اللہ تعالیٰ کے پیدا کردہ نور سے روشن ہے۔ یہ نور حسی بھی ہے اور معنوی بھی۔ ¤ حسی کی کئی قسمیں ہیں، ایک وہ نور جو خود روشن ہے اور دوسروں کو روشن کرتا ہے، جیسے سورج، چاند، ستارے، بجلی، آگ، ہر قسم کے چراغ، جگنو اور ہر وہ حیوان یا درخت جس سے روشنی نکلتی ہے، یہ سب اللہ کے پیدا کردہ ہیں۔ ایک وہ نور ہے جو اللہ تعالیٰ نے حسن یا توانائی کی کسی نہ کسی شکل میں کائنات کے ہر ذرّے میں ودیعت کر رکھا ہے، مثلاً چہرے کا حسن چہرے کا نور کہلاتا ہے، گھر کے افراد گھر کا نور ہوتے ہیں، گلے کا نور آواز کی صورت میں روشنی بکھیرتا ہے، زبان کا نور بولنے سے ظاہر ہوتا ہے، ہر عضو کی توانائی اس کا نور ہے۔ سمندر، پہاڑ، درخت، صحرا غرض ہر چیز کا حسن و جمال اور ان کے منافع اللہ کا نور ہے۔ جو اللہ تعالیٰ نے ان میں ودیعت کر رکھا ہے۔ یہ سب کچھ اللہ تعالیٰ ہی کا پیدا کردہ ہے۔ نور کی ایک قسم ہر عضو کی وہ استعداد ہے جس سے حیوان یا انسان کائنات میں پھیلے ہوئے نور کا ادراک کرتا ہے، مثلاً آنکھ میں بینائی کا نور ہے، یہ نہ ہو تو نہ سورج چاند یا کوئی روشنی نظر آئے، نہ اس سے روشن کائنات کے ذرّے ذرّے میں پھیلا ہوا حسن نظر آئے، اس لیے نابینے آدمی کے متعلق کہا جاتا ہے کہ اس کی آنکھوں میں نور نہیں۔ کان کا نور اس کے سننے کی قوت ہے۔ اسی طرح چھونے، چکھنے، سونگھنے کی قوتیں ان اعضا کا نور ہیں جن میں یہ رکھی گئی ہیں۔ اسی طرح بھوک پیاس، جنسی اشتہا، غرض بے شمار استعدادات ہیں جو اپنے اپنے متعلقہ عضو کا نور ہیں۔ شاہ عبد القادر رحمہ اللہ نے کیا خوب خلاصہ نکالا ہے جو اوپر گزرا کہ اللہ سے رونق اور بستی ہے زمین و آسمان کی، اس کی مدد نہ ہو تو سب ویران ہو جائیں۔ ¤ معنوی نور کی بھی کئی قسمیں ہیں، ایک اللہ تعالیٰ کی ہدایت ہے جس سے ضلالت کے اندھیرے ختم ہوتے ہیں۔ اللہ تعالیٰ نے ہدایت کا یہ نور پیغمبروں کے ذریعے سے نازل فرمایا، اللہ نے فرمایا : «{ يٰۤاَيُّهَا النَّاسُ قَدْ جَآءَكُمْ بُرْهَانٌ مِّنْ رَّبِّكُمْ وَ اَنْزَلْنَاۤ اِلَيْكُمْ نُوْرًا مُّبِيْنًا }» [ النساء : ۱۷۴ ] ’’اے لوگو! بلاشبہ تمھارے پاس تمھارے رب کی طرف سے واضح دلیل آئی ہے اور ہم نے تمھاری طرف ایک واضح نور نازل کیا ہے۔‘‘ اور فرمایا : { هُوَ الَّذِيْ يُنَزِّلُ عَلٰى عَبْدِهٖۤ اٰيٰتٍۭ بَيِّنٰتٍ لِّيُخْرِجَكُمْ مِّنَ الظُّلُمٰتِ اِلَى النُّوْرِ وَ اِنّنَّ اللّٰهَ بِكُمْ لَرَءُوْفٌ رَّحِيْمٌ } [ الحدید : ۹ ] ’’وہی ہے جو اپنے بندے پر واضح آیات اتارتا ہے، تاکہ تمھیں اندھیروں سے روشنی کی طرف نکالے اور بلاشبہ اللہ تعالیٰ تم پر یقینا بے حد نرمی کرنے والا نہایت مہربان ہے۔‘‘ اور فرمایا : «{ اَللّٰهُ وَلِيُّ الَّذِيْنَ اٰمَنُوْا يُخْرِجُهُمْ مِّنَ الظُّلُمٰتِ اِلَى النُّوْرِ }» [ البقرۃ : ۲۵۷ ] ’’اللہ ان لوگوں کا دوست ہے جو ایمان لائے، وہ انھیں اندھیروں سے نکال کر روشنی کی طرف لاتا ہے۔‘‘ اور فرمایا : «{ قَدْ جَآءَكُمْ مِّنَ اللّٰهِ نُوْرٌ وَّ كِتٰبٌ مُّبِيْنٌ }» [ المائدۃ : ۱۵ ] ’’بے شک تمھارے پاس اللہ کی طرف سے ایک روشنی اور واضح کتاب آئی ہے۔‘‘ مزید دیکھے سورۂ انعام (۱۲۲) اور سورۂ شوریٰ (۵۲)۔ اس معنوی نور کی دوسری قسم حق کو پہچاننے اور قبول کرنے کی وہ استعداد ہے جو مومن کے دل میں ہوتی ہے، جو شروع ہی سے اللہ تعالیٰ نے ہر انسان کے دل میں رکھ دی ہے، مگر بعض اوقات وہ ماحول کے اثر یا اپنی بدعملی کی وجہ سے اس سے محروم ہو جاتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا مِنْ مَوْلُوْدٍ إِلَّا يُوْلَدُ عَلَی الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُمَجِّسَانِهِ كَمَا تُنْتَجُ الْبَهِيْمَةُ بَهِيْمَةً جَمْعَاءَ هَلْ تُحِسُّوْنَ فِيْهَا مِنْ جَدْعَااءَ ؟ ] [بخاري، تفسیر سورۃ الروم، باب لا تبدیل لخلق اللہ : ۴۷۷۵، عن أبي ھریرۃ رضی اللہ عنہ ] ’’پیدا ہونے والا ہر بچہ فطرت پر پیدا ہوتا ہے، پھر اس کے ماں باپ اسے یہودی بنا دیتے ہیں، یا نصرانی بنا دیتے ہیں یا مجوسی بنا دیتے ہیں، جیسے چوپایہ پیدا ہوتا ہے تو پورے اعضا والا ہوتا ہے، کیا تم ان میں سے کوئی کان کٹا یا ناک کٹا دیکھتے ہو (یعنی اس کا کان یا ناک بعد میں لوگ کاٹتے ہیں)۔‘‘ ہدایت کا یہ نور اگر کسی دل میں نہ ہو تو جتنے بھی انبیاء آ جائیں یا جتنی بھی آیات الٰہی نازل ہوں دل کے اندھے کو ان سے کچھ فائدہ نہیں ہوتا اور اگر یہ نور آنکھوں یا کانوں میں نہ ہو تو تمام معجزے اور ہر وعظ و نصیحت بے کار ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ لَهُمْ قُلُوْبٌ لَّا يَفْقَهُوْنَ بِهَا وَ لَهُمْ اَعْيُنٌ لَّا يُبْصِرُوْنَ بِهَا وَ لَهُمْ اٰذَانٌ لَّا يَسْمَعُوْنَ بِهَا }» [ الأعراف : ۱۷۹ ] ’’ان کے دل ہیں جن کے ساتھ وہ سمجھتے نہیں اور ان کی آنکھیں ہیں جن کے ساتھ وہ دیکھتے نہیں اور ان کے کان ہیں جن کے ساتھ وہ سنتے نہیں۔‘‘ ¤ مطلب ساری آیت کا یہ ہے کہ کائنات کی ساری رونق اور آبادی اللہ تعالیٰ کے فیض سے ہے، وہ نہ ہو تو کچھ بھی نہ رہ جائے، نور کے تمام ذرائع مثلاً سورج چاند وغیرہ، ان سے روشن ہونے والی کائنات اور ان کا ادراک کرنے والا نور اسی کا پیدا کردہ ہے، اسی طرح ایمان کا نور بھی اسی کا عطا کردہ ہے، اسی نے وحی بھیجی، پیغمبر بھیجے، کتابیں نازل کیں اور دلوں میں انھیں قبول کرنے کا نور رکھا۔ ¤ ➌ { ’’ اَللّٰهُ نُوْرُ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} میں اگرچہ حسی و معنوی تمام نور داخل ہیں اور سب ہی اللہ کے عطا کردہ ہیں، مگر زیرِ تفسیر آیت میں مراد ہدایت کا نور ہے کہ وہ صرف اللہ کی عطا ہے، اس کا ایک قرینہ اس سے پہلی آیت ہے، جس میں {’’ اٰيٰتٍ مُبَيِّنٰتٍ‘‘} اور گزشتہ اقوام کے کچھ حالات اور متقین کے لیے نصیحت نازل کرنے کا ذکر ہے اور ایک قرینہ خود اس آیت میں موجود ہے کہ {’’ يَهْدِي اللّٰهُ لِنُوْرِهٖ مَنْ يَّشَآءُ ‘‘} اور تیسرا قرینہ اس سلسلہ کلام کی آخری آیت کا اختتام ہے، فرمایا : «{ وَ مَنْ لَّمْ يَجْعَلِ اللّٰهُ لَهٗ نُوْرًا فَمَا لَهٗ مِنْ نُّوْرٍ }» [ النور : ۴۰ ] ’’اور وہ شخص جس کے لیے اللہ کوئی نور نہ بنائے تو اس کے لیے کوئی بھی نور نہیں۔‘‘ اس لیے ترجمان القرآن عبد اللہ بن عباس رضی اللہ عنھما سے علی بن ابی طلحہ کی معتبر سند کے ساتھ یہ تفسیر آئی ہے کہ انھوں نے فرمایا : {’’ « اَللّٰهُ نُوْرُ السَّمٰوٰتِ وَ الْاَرْضِ» يَقُوْلُ:اللّٰهُ سُبْحَانَهُ هَادِيْ أَهْلِ السَّمَاوَاتِ وَالْأَرْضِ‘‘} [ طبري : ۲۶۲۹۲ ]’’اللہ تعالیٰ کے فرمان {’’ اَللّٰهُ نُوْرُ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} کا معنی یہ ہے کہ اللہ سبحانہ آسمانوں اور زمین والوں کو ہدایت دینے والا ہے۔‘‘ ¤ شیخ المفسرین طبری نے یہی تفسیر اختیار کی ہے اور شیخ الاسلام ابن تیمیہ نے یہ تفسیر ذکر کرکے اسے قائم رکھا ہے، مگر ساتھ ہی فرمایا ہے کہ یہ تفسیر نور کی دوسری انواع کو اس کی تفسیر میں داخل کرنے سے مانع نہیں ہے۔ (تفسیر سورۃ النور از ابن تیمیہ) ابن کثیر نے بھی یہی تفسیر فرمائی ہے۔ قرآن مجید کی دوسری آیات سے بھی اس کی تائید ہوتی ہے، جیسے فرمایا : «{ اَفَمَنْ شَرَحَ اللّٰهُ صَدْرَهٗ لِلْاِسْلَامِ فَهُوَ عَلٰى نُوْرٍ مِّنْ رَّبِّهٖ }» [ الزمر : ۲۲ ] ’’تو کیا وہ شخص جس کا سینہ اللہ نے اسلام کے لیے کھول دیا ہے سو وہ اپنے رب کی طرف سے ایک روشنی پر ہے۔‘‘ ¤ ➍ {مَثَلُ نُوْرِهٖ كَمِشْكٰوةٍ فِيْهَا مِصْبَاحٌ… : ’’ مِشْكَاةٌ ‘‘} دیوار میں طاق جو دیوار کے آر پار نہ ہو، {’’ زُجَاجَةٍ ‘‘} شیشے کا فانوس۔ {’’ دُرِّيٌّ ‘‘ ’’دُرٌّ‘‘ } کے ساتھ یاء نسبت لگانے سے {’’ دُرِّيٌّ ‘‘} بن گیا، موتی کی طرح چمکتا ہوا۔ {’’ لَا شَرْقِيَّةٍ وَّ لَا غَرْبِيَّةٍ ‘‘} کے الفاظ سے زیتون کے اس تیل کی عمدگی اور شفافیت بیان کرنا مقصود ہے۔ اہلِ علم سے اس کی دو تفسیریں آئی ہیں، ایک یہ کہ وہ تیل زیتون کے ایسے درخت سے حاصل ہوا ہے جو نہ مشرقی ہے کہ اس کے مغرب میں کوئی پہاڑ یا اوٹ ہو، جس کی وجہ سے اس پر صرف دن کے پہلے پہر کی دھوپ پڑتی ہو اور نہ مغربی ہے کہ اس کے مشرق میں کوئی پہاڑ یا اوٹ ہو جس کی وجہ سے اس پر صرف دن کے پچھلے پہر کی دھوپ پڑتی ہو، بلکہ وہ درخت کھلی جگہ میں ہے جس پر سارا دن سورج کی دھوپ پڑتی ہے، ایسے درخت کا تیل زیادہ صاف اور عمدہ ہوتا ہے۔ دوسری تفسیر یہ ہے کہ زیتون کا وہ درخت نہ مشرق کی جانب ہے نہ مغرب کی طرف، بلکہ دوسرے درختوں کے عین درمیان واقع ہے، جس پر صرف جنوب کی طرف سے سورج کی دھوپ پڑتی ہے۔ درختوں کے درمیان واقع ہونے کی وجہ سے وہ سورج کی مسلسل تپش سے محفوظ رہتا ہے، جس سے اس کے پھل کی رطوبت پوری طرح محفوظ رہتی ہے۔ دونوں تفسیریں سلف سے مروی ہیں، دوسری تفسیر ابی بن کعب رضی اللہ عنہ سے معتبر سند کے ساتھ طبری نے نقل فرمائی ہے، جیسا کہ آگے آ رہا ہے۔ شاہ عبد القادر لکھتے ہیں : ’’اور زیتون نہ شرق کا نہ غرب کا، یعنی باغ کے بیچ کا، نہ صبح کی دھوپ کھاوے نہ شام کی، خوب ہرا اور چکنا رہے۔‘‘ ¤ ➎ { ’’ مَثَلُ نُوْرِهٖ ‘‘} یعنی ’’اس کے نور کی مثال‘‘ سے مراد کس کے نور کی مثال ہے اور مثال کس طرح ہے؟ میں نے جتنی تفسیریں دیکھی ہیں سب سے واضح تفسیر ترجمان القرآن ابن عباس رضی اللہ عنھما کی ہے، جو طبری نے علی بن ابی طلحہ عن ابن عباس رضی اللہ عنھا کی معتبر سند کے ساتھ نقل کی ہے، وہ فرماتے ہیں : [ «{ مَثَلُ نُوْرِهٖ كَمِشْكٰوةٍ }» قَالَ مَثَلُ هَدَاهُ فِيْ قَلْبِ الْمُؤْمِنِ كَمَا يَكَادُ الزَّيْتُ الصَّافِيْ يُضِيْءءُ قَبْلَ أَنْ تَمَسَّهُ النَّارُ فَإِذَا مَسَّتْهُ النَّارُ ازْدَادَ ضَوْئًا عَلٰجی ضَوْءٍ كَذٰلِكَ يَكُوْنُ قَلْبُ الْمُؤْمِنِ يَعْمَلُ بِالْهُدٰی قَبْلَ أَنْ يَّأْتِيَهُ الْعِلْمُ فَإِذَا جَاءَهُ الْعِلْمُ ازْدَادَ هُدًی عَلٰی هُدًی وَ نُوْرًا عَلٰی نُوْرٍ ] [ طبري : ۲۶۳۱۳ ] ’’اس کے نور کی مثال ایک طاق کی سی ہے‘‘ فرمایا : ’’مومن کے دل میں اللہ تعالیٰ کی ہدایت کی مثال اس طرح ہے جیسے صاف زیتون کا تیل، قریب ہوتا ہے کہ اس سے پہلے ہی روشن ہو جائے کہ اسے آگ چھوئے، پھر جب اسے آگ چھوتی ہے تو وہ روشنی پر روشنی میں بڑھ جاتا ہے، ایسے ہی مومن کا دل ہے کہ اس سے پہلے ہی ہدایت پر عمل کرنے والا ہوتا ہے کہ اس کے پاس علم آئے، پھر جب اس کے پاس علم آتا ہے تو وہ ہدایت پر ہدایت میں بڑھ جاتا ہے اور نور پر نور میں بڑھ جاتا ہے۔‘‘ ¤ ➏ آیت میں مومن کے دل میں اللہ کی ہدایت کے نور کو مثال دے کر زیادہ سے زیادہ روشن بیان کرنا مقصود ہے، اس کے لیے اسے ایسے چراغ کی روشنی کے ساتھ تشبیہ دی گئی ہے جو آیت کے نزول کے وقت رات کے اندھیرے میں روشنی کے لیے انسانی استعمال میں آنے والی سب سے روشن چیز تھی اور اس کی روشنی کو زیادہ سے زیادہ بڑھانے کے جو اسباب و ذرائع ہو سکتے تھے وہ بھی ساتھ ذکر فرمائے۔ سب سے پہلے یہ کہ وہ چراغ ایک طاق میں ہے، طاق میں ہونے کی وجہ سے اس کی شعائیں مجتمع ہو کر زیادہ روشنی کا باعث بنتی ہیں، اگر وہ کسی کھلی جگہ میں ہوتا تو اس کی شعائیں بکھر جاتیں۔ دوسری چیز اس کی روشنی کو بڑھانے والی یہ ہے کہ وہ چراغ شیشے کے ایک فانوس میں ہے، جس سے وہ ہوا کے تھپیڑوں سے محفوظ ہے اور فانوس کی وجہ سے اس کی روشنی کئی گنا بڑھ گئی ہے۔ تیسری چیز یہ کہ وہ فانوس عام شیشے کا بنا ہوا نہیں کہ روشنی میں معمولی اضافے کا باعث ہو، بلکہ اتنا شفاف اور چمک دار ہے جیسے کوئی چمکتا ہوا تارا ہو۔ چوتھی چیز یہ ہے کہ وہ چراغ کسی عام تیل سے روشن نہیں کیا جا رہا، بلکہ تیل کی تمام قسموں میں سے جو تیل سب سے شفاف، سب سے زیادہ روشنی دینے والا اور سب سے کم دھواں دینے والا ہے وہ اس کے ساتھ روشن کیا جا رہا ہے، جو روغن زیتون ہے۔ پانچویں چیز یہ ہے کہ زیتون کا وہ تیل ردی یا خراب قسم کا نہیں کہ ایسے پھلوں سے نکالا گیا ہو جو نکمے اور خشک ہوں، بلکہ ایسے درخت کے پھلوں سے نکالا گیا ہے جو نہایت سر سبز و شاداب ہے اور جس کے پھل صاف روغن سے بھرپور ہیں۔ چھٹی چیز یہ کہ وہ تیل اتنا شفاف ہے کہ آگ لگائے بغیر بھی ایسے دکھائی دیتا ہے کہ ابھی اس سے روشنی پھوٹنے لگے گی۔ نور پر نور یعنی نور کو جس طرح بھی بڑھایا جا سکتا ہے اسی طرح اسے زیادہ سے زیادہ روشن کیا گیا ہے۔ اس میں جس کو تشبیہ دی گئی ہے وہ مومن کے دل میں اللہ کی ہدایت کا نور ہے اور جس کے ساتھ تشبیہ دی گئی ہے وہ ایسے چراغ کی روشنی ہے جس میں ہر اس طریقے سے اضافہ کیا گیا ہے جس سے اضافہ ہو سکتا ہے، یعنی تشبیہ ایک چیز سے نہیں بلکہ اس چراغ کی مجموعی صورت سے ہے، اسے تشبیہ تمثیل کہتے ہیں۔ اس میں مشبّہ کی ایک ایک چیز کی تشبیہ مشبّہ بہ کی ایک ایک چیز کے ساتھ نہیں دی جاتی، بلکہ مشبّہ کی مجموعی صورت کی تشبیہ مشبّہ بہ کی مجموعی صورت کے ساتھ دی جاتی ہے۔ ابن عباس رضی اللہ عنھما کی تفسیر کا انداز یہی ہے، البتہ بعض اہلِ علم نے مشبّہ کے اجزا کو مشبّہ بہ کے ایک ایک جز سے تشبیہ دی ہے۔ چنانچہ طبری (۲۶۳۱۰) نے معتبر سند کے ساتھ ابو العالیہ سے ابی بن کعب رضی اللہ عنہ کی تفسیر نقل فرمائی ہے، ان کے مطابق طاق سے مراد مومن کا سینہ ہے، فانوس سے مراد مومن کا دل ہے، چراغ وہ ایمان اور قرآن ہے جو مومن کے دل میں ہے۔ ستارے کی طرح چراغ کے روشن ہونے سے مراد مومن کے دل کا نور ایمان سے منور ہونا ہے۔ شجرہ مبارکہ سے اس چراغ کے روشن ہونے سے مراد اس کا اللہ وحدہ کے لیے اخلاص اور اس کی عبادت سے روشن ہونا ہے۔ {’’ لَا شَرْقِيَّةٍ وَّ لَا غَرْبِيَّةٍ ‘‘} سے مراد ایسے درخت سے تشبیہ ہے جو گھنے درختوں کے درمیان گھرا ہوا ہے، چنانچہ وہ نہایت سبز اور چکنا ہے، اسے شدید دھوپ نہیں پہنچتی، نہ سورج کے طلوع ہوتے وقت نہ غروب ہوتے وقت، اسی طرح مومن کا دل اس سے محفوظ ہے کہ اسے مختلف حالات نقصان پہنچائیں، اگر وہ ایسے انقلابات کی زد میں آتا بھی ہے تو اللہ اسے ثابت رکھتا ہے۔ یہ بھی ایک جلیل القدر صحابی کی تفسیر ہے، جو سید القراء تھے۔ {’’ نُوْرٌ عَلٰى نُوْرٍ ‘‘} یعنی وہ نور تہ بہ تہ ہے اور اسے قوت دینے والی اور زیادہ روشن کرنے والی کوئی چیز باقی نہیں رہی جس نے اسے مزید روشن نہ کیا ہو۔ ¤ ➐ { يَهْدِي اللّٰهُ لِنُوْرِهٖ مَنْ يَّشَآءُ :} یہ اس سوال کا جواب ہے کہ جب اللہ کے نورِ ہدایت سے آسمان و زمین روشن ہیں، تو کافر اس سے کیوں محروم ہیں اور عائشہ صدیقہ رضی اللہ عنھا کی اظہر من الشمس براء ت کے باوجود ان پر بہتان لگانے والے اس سے اندھے کیوں رہے؟ فرمایا، اللہ اس نور کا مالک ہے، وہ اپنی چیز جسے چاہے دے، جسے چاہے نہ دے، اگر وہ کسی کو بھی نہ دے تو ظالم نہیں، مگر یہ اس کا کرم ہے کہ جو ہدایت کے قابل ہو اسے ضرور ہدایت دیتا ہے، جیسا کہ فرمایا : «{ اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ وَ لٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَآءُ وَ هُوَ اَعْلَمُ بِالْمُهْمُهْتَدِيْنَ }» [ القصص : ۵۶ ] ’’بے شک تو ہدایت نہیں دیتا جسے تو دوست رکھے اور لیکن اللہ ہدایت دیتا ہے جسے چاہتا ہے اور وہ ہدایت پانے والوں کو زیادہ جاننے والا ہے۔‘‘ ¤ ➑ { وَ يَضْرِبُ اللّٰهُ الْاَمْثَالَ لِلنَّاسِ :} یعنی اللہ تعالیٰ لوگوں کی ہدایت کے لیے حسب حال مثالیں بیان کرتا ہے۔ قرآن مجید میں تقریباً ہر اہم مسئلے کے ساتھ کوئی نہ کوئی مثال بیان ہوئی ہے، کیوں کہ اس سے بات خوب ذہن نشین ہو جاتی ہے۔ ¤ ➒ { وَ اللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ :} اور اللہ ہر چیز کو خوب جاننے والا ہے، جس میں سے یہ بھی ہے کہ کس بات کے لیے کون سی مثال موزوں ہے اور ہدایت کے لائق کون ہے اور کون نہیں۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) ➊ {فِيْ بُيُوْتٍ اَذِنَ اللّٰهُ اَنْ تُرْفَعَ : ’’ بُيُوْتٍ ‘‘} میں تنوین تعظیم کے لیے ہے، اس لیے ترجمہ ’’ان عظیم گھروں میں‘‘ کیا گیا ہے۔ {’’ اَذِنَ ‘‘} کا لفظ اجازت اور حکم دونوں معنوں میں آتا ہے، یہاں مراد حکم ہے، جیسا کہ فرمایا : «{ وَ مَاۤ اَرْسَلْنَا مِنْ رَّسُوْلٍ اِلَّا لِيُطَاعَ بِاِذْنِ اللّٰهِ }» [ النساء : ۶۴ ] ’’اور ہم نے کوئی رسول نہیں بھیجا مگر اس لیے کہ اللہ کے حکم سے اس کی فرماں برداری کی جائے۔‘‘ ¤ ➋ {’’ فِيْ بُيُوْتٍ ‘‘} جار مجرور کس کے متعلق ہیں؟ حقیقت یہ ہے کہ پچھلی آیت میں کئی الفاظ ہیں جن میں سے کسی کے بھی متعلق کر دیں تو معنی درست ہوتا ہے، مثلاً {’’ نُوْرٌ ، كَمِشْكٰوةٍ ، مِصْبَاحٌ ، اَلزُّجَاجَةُ ‘‘} اور {’’ يُوْقَدُ ‘‘} یعنی وہ نور ہدایت ایسے عظیم گھروں میں ملتا ہے جن کے بارے میں اللہ تعالیٰ نے حکم دیا ہے۔ ابن کثیر فرماتے ہیں : ’’جب اللہ تعالیٰ نے مومن کے دل کی اور اس میں موجود علم اور ہدایت کی مثال ایسے چراغ کے ساتھ دی جو شفاف فانوس میں ہے اور نہایت عمدہ تیل کے ساتھ روشن کیا جا رہا ہے، تو اس کی جگہ بیان فرمائی کہ وہ جگہ زمین کے تمام قطعوں میں سے اللہ تعالیٰ کو سب سے محبوب قطعہ اللہ کی مسجدیں ہیں، جن میں اس کی عبادت ہوتی ہے اور اس کی توحید کا اعلان ہوتا ہے۔‘‘ ¤ ➌ {’’ اَنْ تُرْفَعَ ‘‘} کا لفظی معنی ہے ’’کہ وہ (گھر) بلند کیے جائیں ‘‘ مگر یہاں بلند کرنے سے مراد یہ نہیں کہ ان کی عمارت زیادہ سے زیادہ اونچی بنائی جائے، کیونکہ اگر یہ مطلب ہوتا تو رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر و عمر رضی اللہ عنھما انھیں کھجور کے تنوں اور ٹہنیوں سے نہ بناتے اور آپ صلی اللہ علیہ وسلم یہ نہ فرماتے : [ مَا أُمِرْتُ بِتَشْيِيْدِ الْمَسَاجِدِ ] [ أبوداوٗد، الصلاۃ، باب في بناء المساجد : ۴۴۸، قال الألباني صحیح، عن ابن عباس رضی اللہ عنھما ] ’’مجھے مساجد کو اونچا بنانے یا چونا گچ بنانے کا حکم نہیں دیا گیا۔‘‘ اس سے مراد ان کی تعظیم و تکریم ہے۔ طبری نے معتبر سند کے ساتھ علی بن ابی طلحہ سے ابن عباس رضی اللہ عنھما کی تفسیر نقل فرمائی ہے : {’’ « فِيْ بُيُوْتٍ اَذِنَ اللّٰهُ اَنْ تُرْفَعَ » وَهِيَ الْمَسَاجِدُ تُكْرَمُ وَ نُهِيَ عَنِ اللَّغْووِ فِيْهَا ‘‘} [ طبري : ۲۶۳۳۶ ] ’’اس آیت میں {’’ بُيُوْتٍ ‘‘ } سے مراد مساجد ہیں، ان کی تکریم و تعظیم کی جائے اور ان میں لغو کاموں سے منع کیا گیا۔‘‘ ابن عباس رضی اللہ عنھما کے اس قول سے معلوم ہوا کہ {’’ بُيُوْتٍ ‘‘} سے مراد مساجد ہیں اور انھیں بلند کرنے سے مراد ان کی تکریم اور ان میں لغو کاموں سے بچنا ہے۔ ’’رفع مساجد‘‘ یعنی مسجدوں کی تعظیم و تکریم میں انھیں ہر محلے میں بنانا، ان میں جھاڑو پھیرنا، انھیں نجاست اور گندگی سے پاک رکھنا، انھیں خوشبو دار رکھنا، تحیۃ المسجد پڑھے بغیر ان میں نہ بیٹھنا، ان میں تھوکنے سے، غلط اور شرکیہ اشعار پڑھنے سے، بے ہودہ باتوں اور شوروغل سے بچنا، گم شدہ چیز کا ان میں اعلان نہ کرنا اور ان میں خرید و فروخت نہ کرنا، سب کچھ شامل ہے۔ علاوہ ازیں حائضہ اور جنبی کو مسجد میں داخلے سے ممانعت، بدبودار چیز کھا کر مسجد میں آنے کی ممانعت، مسجد کو راستے کے طور پر استعمال کرنے کی ممانعت اور مساجد میں حدود اللہ قائم کرنے سے ممانعت بھی ان کی نظافت اور تکریم ہی کی وجہ سے ہے۔ ان میں داخل ہوتے وقت دایاں پاؤں اور نکلتے وقت بایاں پاؤں پہلے رکھنا ان کی تکریم کا حصہ ہے۔ اسی طرح ان میں داخل ہوتے وقت اللہ تعالیٰ سے رحمت کی درخواست اور شیطان مردود سے پناہ کی طلب اور نکلتے وقت اللہ کے فضل کی درخواست واضح علامت ہے کہ بندہ کسی عام جگہ میں داخل یا اس سے خارج نہیں ہو رہا، بلکہ ایک نہایت عظمت والے مقام میں داخل ہو رہا ہے، یا اس سے نکل رہا ہے۔ ان تمام باتوں کی تفصیل آیات و احادیث میں موجود ہے اور تھوڑی سے توجہ سے بآسانی دیکھی جا سکتی ہے۔ تفسیر ابن کثیر میں اس کا خاصا حصہ مذکور ہے۔ ¤ ➍ { وَ يُذْكَرَ فِيْهَا اسْمُهٗ :} مساجد میں اللہ کا نام یاد کرنے میں فرض اور نفل سب نمازیں شامل ہیں، اسی طرح اس میں قرآن مجید کی تلاوت، اللہ کی تسبیح، اس کی حمد، لا الٰہ الا اللہ اور دوسرے تمام اذکار شامل ہیں۔ علم کا سیکھنا سکھانا، اس کا باہم مذاکرہ، اعتکاف اور دوسری تمام عبادات شامل ہیں جو مساجد میں ادا کی جاتی ہیں۔ ¤ ➎ {يُسَبِّحُ لَهٗ فِيْهَا بِالْغُدُوِّ وَ الْاٰصَالِ : ’’ بِالْغُدُوِّ وَ الْاٰصَالِ ‘‘} کے لیے دیکھیے سورۂ اعراف کی آیت (۲۰۵) یعنی ان مساجد میں بڑی شان والے مرد خلوص کے ساتھ اللہ کے لیے صبح و شام تسبیح بیان کرتے ہیں۔ تسبیح میں اگرچہ سب اذکار آ جاتے ہیں اور عموماً اذکار روزانہ صبح و شام ہی کیے جاتے ہیں، مگر ترجمان القرآن ابن عباس رضی اللہ عنھما نے اس کی تفسیر فرض نماز کے ساتھ فرمائی ہے۔ چنانچہ طبری نے معتبر سند کے ساتھ علی بن ابی طلحہ کے طریق سے ابن عباس رضی اللہ عنھما کی تفسیر بیان فرمائی ہے، انھوں نے فرمایا : {’’ يُسَبِّحُ لَهٗ فِيْهَا بِالْغُدُوِّ وَ الْاٰصَالِ ‘‘} کا مطلب یہ ہے کہ بڑی شان والے وہ مرد پہلے اور پچھلے پہر ان میں اللہ کے لیے نماز پڑھتے ہیں۔ {’’غُدُوٌّ‘‘} سے مراد صبح کی نماز ہے اور {’’آصَالٌ‘‘} سے مراد عصر کی نماز ہے۔ یہ دونوں نمازیں اللہ تعالیٰ نے سب سے پہلے فرض فرمائیں، اس لیے اس نے پسند فرمایا کہ ان نمازوں کا ذکر کرے اور ان کے ساتھ اپنی عبادت کا ذکر کرے۔‘‘ [ طبري : ۲۶۳۵۱ ] ¤ قرآن مجید میں دوسرے مقامات پر بھی تسبیح بول کر نماز مراد لی گئی ہے، دیکھیے سورۂ طٰہٰ (۱۳۰)، سورۂ ق (۳۹، ۴۰) اور سورۂ طور (۴۹) بعض مفسرین نے {’’ الْاٰصَالِ ‘‘} سے چاروں نمازیں مراد لی ہیں۔ ببغوی نے فرمایا : ’’کیونکہ {’’ الْاٰصَالِ ‘‘} میں وہ چاروں آ جاتی ہیں۔‘‘ {’’صَيْلٌ‘‘ } کا لفظ سورج ڈھلنے سے لے کر فجر سے پہلے تک بھی بولا جاتا ہے، اگرچہ الفاظ کے لحاظ سے یہ تفسیر درست ہے، تاہم شان نزول کو مدنظر رکھیں تو ابن عباس رضی اللہ عنھما کی تفسیر راجح ہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { رِجَالٌ لَّا تُلْهِيْهِمْ تِجَارَةٌ وَّ لَا بَيْعٌ … : ’’ رِجَالٌ ‘‘} پر تنوین تفخیم کے لیے ہے، اس لیے ترجمہ ’’بڑی شان والے مرد‘‘ کیا گیا ہے۔ یہاں ایک سوال ہے کہ ’’تجارت‘‘ کے بعد ’’بیع‘‘ کو ذکر کرنے کی کیا ضرورت ہے، جب کہ بیع بھی تجارت ہی ہے؟ جواب اس کا یہ ہے کہ تجارت ایک وسیع عمل ہے، جس میں مختلف اشیاء خریدنے کے لیے سفر کرنا، انھیں مناسب مقام سے مناسب وقت پر مناسب قیمت کے ساتھ خریدنا، انھیں محفوظ کرکے رکھنا، پھر بیچنے کے لیے مناسب موقع کی تلاش میں رہنا، اس کے لیے دکان پر بیٹھنا، گاہک کا انتظار کرنا اور مناسب وقت پر فروخت کر دینا سب کچھ شامل ہے۔ اللہ تعالیٰ نے یہ فرمانے کے بعد کہ ان عظیم مردوں کو اللہ کے ذکر اور اقامتِ صلاۃ اور ادائے زکوٰۃ سے تجارت میں درکار کوئی عمل غافل نہیں کرتا، تجارت کے تمام کاموں میں سے خاص اس کام کا ذکر فرمایا جو تجارت کی ساری محنت کا نتیجہ ہے اور وہ ہے بیع، یہ لفظ بیچنے اور خریدنے دونوں پر بولا جاتا ہے، یعنی اللہ کے ان بندوں کو تجارت میں درکار کوئی کام اللہ کے ذکر سے غافل نہیں کرتا، حتیٰ کہ خرید و فروخت کا عمل، جو تجارت کی ساری محنت کا نتیجہ ہے اور جس سے نفع حاصل ہوتا ہے، وہ بھی انھیں اللہ کے ذکر سے نہیں روکتا۔ اذان ہونے پر خواہ کوئی چیز بک رہی ہو یا خریدی جا رہی ہو اور خواہ کتنا نفع حاصل ہو رہا ہو وہ دنیا کے اس نفع کو لات مار کر اللہ کے گھر میں حاضر ہو جاتے ہیں۔ ¤ ➋ {عَنْ ذِكْرِ اللّٰهِ :} اللہ کے ذکر سے مراد دل میں اسے  یاد رکھنا اور زبان سے اس کا ذکر دونوں مراد ہیں، یعنی وہ تجارت کے کسی موقع پر حتیٰ کہ خرید و فروخت کے وقت بھی اللہ تعالیٰ کو نہیں بھولتے، نہ کسی سودے میں ایسا کام کرتے ہیں جس سے اس نے منع فرما دیا ہے اور ان کی زبان پر ہر وقت اللہ کا ذکر ہی رہتا ہے۔ وہ بات بات پر الحمد للہ، سبحان اللہ، ماشاء اللہ وغیرہ کہتے ہیں اور خاموشی کی حالت میں بھی ان کی زبان اللہ کے ذکر سے تر رہتی ہے، وہ اس حکم پر کاربند رہتے ہیں : [ لَا يَزَالُ لِسَانُكَ رَطْبًا مِّنْ ذِكْرِ اللّٰهِ ] [ ترمذي، الدعوات، باب ما جاء في فضل الذکر : ۳۳۷۵ ] ’’تیری زبان ہمیشہ اللہ کے ذکر سے تر رہے۔‘‘ اور اللہ تعالیٰ کے اس حکم : «{ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا اذْكُرُوا اللّٰهَ ذِكْرًا كَثِيْرًا }» [ الأحزاب : ۴۱ ] ’’اے لوگو جو ایمان لائے ہو ! اللہ کو یاد کرو، بہت یاد کرنا۔‘‘ ¤ ➌ { وَ اِقَامِ الصَّلٰوةِ وَ اِيْتَآءِ الزَّكٰوةِ:} نماز کی اقامت میں اسے وقت پر ادا کرنا اور اس کے تمام ارکان کو صحیح طریقے سے ادا کرنا سب کچھ شامل ہے، یعنی کوئی تجارت یا خرید و فروخت اللہ کے ذکر اور اقامت صلاۃ اور ادائے زکوٰۃ میں ان کے لیے غفلت کا باعث نہیں بنتی۔ ¤ ➍ اس آیت سے معلوم ہوا کہ اسلام کی تعلیم یہ نہیں ہے کہ دنیا کا کاروبار چھوڑ کر اللہ اللہ کرتے رہو، یہ تو رہبانیت ہے جس کی تعلیم اللہ تعالیٰ نے نہیں دی۔ اللہ کے تمام جلیل القدر پیغمبر محنت کے ساتھ کمائی کرتے تھے، آدم علیہ السلام مویشی پالنے، کھیتی باڑی، صنعت و حرفت اور ضرورت کے سارے کام خود کرتے تھے۔ زکریا علیہ السلام نجار تھے، داؤد علیہ السلام زرہیں بناتے تھے۔ تمام پیغمبروں نے بکریاں چرائی ہیں، ہمارے نبی صلی اللہ علیہ وسلم نے نبوت سے پہلے اجرت پر بکریاں چرائی ہیں، تجارت بھی کی ہے، آخر میں اللہ تعالیٰ نے آپ کا رزق آپ کے نیزے کے سائے تلے رکھ دیا تھا۔ صحابہ کرام رضی اللہ عنھم کا بھی یہی حال تھا، کوئی مویشی پالتا تھا، کوئی کاشت کار تھا، کوئی صنعت کار، کوئی تجارت کرتا تھا، کوئی مزدوری، البتہ جہادمیں سبھی شامل تھے، جو رزق کا سب سے باعزت ذریعہ ہے۔ حقیقت یہ ہے کہ ایتائے زکوٰۃ (زکوٰۃ دینے) کے حکم میں بھی کسب حلال کی ترغیب ہے کہ مال نہیں کمائے گا تو زکوٰۃ کس سے دے گا۔ اسی لیے جب رسول اللہ صلی اللہ علیہ وسلم صدقے کی اپیل کرتے تو بعض صحابہ بوجھ اٹھا کر اور بعض رات بھر ڈول کھینچ کر جو کچھ کماتے پیش کر دیتے۔ دیکھیے سورۂ توبہ کی آیت (۷۹) کی تفسیر۔ ¤ امتِ مسلمہ کی بدنصیبی کا آغاز اس دن سے ہوا جب ان لوگوں کو اولیاء اللہ قرار دے دیا گیا جنھوں نے جہاد کرنا تو دور، حلال کمانا بھی چھوڑ دیا اور اللہ پر توکّل کے نام پر لوگوں کے لقموں پر پلنا شروع کر دیا۔ ان کے ترک دنیا اور خود ساختہ زہد سے متاثر ہو کر لوگ ان پر اپنا مال نچھاور کرنے لگے کہ ان بزرگوں کے طفیل ہم بھی کچھ کیے کرائے بغیر بخشے جائیں گے۔ جب یہ حضرات لوگوں کی نظروں میں نیکی کا معیار بن گئے تو کفار کو مسلمانوں پر چڑھ دوڑنے کا موقع مل گیا۔ مسلمانوں کی نگاہوں میں ان اعلیٰ ترین لوگوں نے تجارت، صنعت، زراعت، حرب و ضرب سب کچھ چھوڑا تو عوام اور حکمرانوں کی نظر میں بھی یہ کام دنیا پرستی ٹھہرے۔ نتیجہ وہ غلامی ہے جس کا عذاب امتِ مسلمہ جھیل رہی ہے۔ جب تک یہ امت روزانہ ہزار ہزار رکعت پڑھنے والے، دنیا ترک کرکے مساجد کو چھوڑ کر خانقاہوں کو آباد کرنے والے، کسی معشوق یا شیخ کے تصور میں عمر گزارنے والے، دوسروں کے ٹکڑوں پر پلنے والے عزت مآب راہبوں کی حقیقت کو نہیں سمجھے گی اور خیر القرون کے صحابہ و تابعین کے عمل کی طرف نہیں پلٹے گی، تو کوئی طاقت انھیں ذلت و رسوائی سے نہیں نکال سکتی۔ ¤ ➎ اللہ تعالیٰ کو مطلوب یہ ہے کہ اس کے بندے دنیا کے سب جائز کام کریں، مگر وہ کام ان کے لیے اس کی یاد اور اس کے احکام کی بجا آوری میں رکاوٹ نہ بنیں۔ امام بخاری رحمہ اللہ نے {’’كِتَابُ الْبُيُوْعِ، بَابُ التِّجَارَةِ فِي الْبَزِّ وَ غَيْرِهِ‘‘} (کپڑے وغیرہ کی تجارت کے باب) میں آیت : «{ رِجَالٌ لَّا تُلْهِيْهِمْ تِجَارَةٌ وَّ لَا بَيْعٌ عَنْ ذِكْرِ اللّٰهِ }» نقل فرمانے کے بعد جلیل القدر تابعی قتادہ کا قول نقل فرمایا ہے، جس میں انھوں نے صحابہ کرام رضی اللہ عنھم کا حال بیان فرمایا ہے، وہ فرماتے ہیں : [ كَانَ الْقَوْمُ يَتَبَايَعُوْنَ وَ يَتَّجِرُوْنَ وَلٰكِنَّهُمْ إِذَا نَابَهُمْ حَقٌّ مِنْ حُقُوْقِ اللّٰهِ لَمْ تُلْهِهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللّٰهِ حَتّٰہ يُؤَدُّوْهُ إِلَی اللّٰهِ] [بخاري، بعد ح : ۲۰۵۹ ] ’’وہ لوگ خرید و فروخت کرتے اور تجارت کرتے تھے، لیکن جب ان کے سامنے اللہ کے حقوق میں سے کوئی حق آ جاتا تو کوئی تجارت یا کوئی خرید و فروخت انھیں اللہ کے اس حق کی ادائیگی سے غافل نہیں کرتی تھی۔‘‘ ¤ ➏ یہاں ایک سوال ہے کہ اللہ کے گھروں میں تسبیح کرنے والوں میں سے یہاں صرف مردوں کا ذکر فرمایا، تو کیا عورتیں مسجد میں نہیں جا سکتیں؟ جواب اس کا یہ ہے کہ یہاں ان لوگوں کی مردانگی کا ذکر ہے جو تجارت اور خرید و فروخت چھوڑ کر مسجدوں میں جماعت کے ساتھ آ ملتے ہیں اور ظاہر ہے یہ کام مردوں کا ہے، عورتوں کا نہیں۔ (رازی) رہا عورتوں کا مسجد میں آنا تو یہ بات معروف ہے کہ وہ مسجد نبوی میں جماعت کے ساتھ شریک ہوتی تھیں اور رسول اللہ صلی اللہ علیہ وسلم نے انھیں مسجدوں میں آنے کی اجازت دی اور روکنے سے منع فرمایا۔ ابن عمر رضی اللہ عنھما فرماتے ہیں : ’’عمر رضی اللہ عنہ کی ایک بیوی صبح اور عشاء کی نماز مسجد میں جماعت کے ساتھ پڑھتی تھی (عمر رضی اللہ عنہ اسے ناپسند کرتے اور غیرت کھاتے تھے) اسے کسی نے کہا : ’’تم کیوں نکلتی ہو، جب کہ تمھیں معلوم ہے کہ عمر اسے ناپسند کرتے ہیں اور غیرت کھاتے ہیں؟‘‘ اس نے کہا : ’’انھیں کیا مانع ہے کہ مجھے (جانے سے) روک دیں؟‘‘ تو اس نے کہا، انھیں رسول اللہ صلی اللہ علیہ وسلم کا فرمان مانع ہے : [ لَا تَمْنَعُوْا إِمَاءَ اللّٰهِ مَسَاجِدَ اللّٰهِ ] [ بخاري، الجمعۃ، باب : ۹۰۰ ] ’’اللہ کی بندیوں کو اللہ کی مسجدوں سے منع مت کرو۔‘‘ البتہ آپ صلی اللہ علیہ وسلم نے عورتوں کے گھر میں نماز پڑھنے کو افضل قرار دیا ہے۔ ابن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا تَمْنَعُوْا نِسَاءَكُمُ الْمَسَاجِدَ وَ بُيُوْتُهُنَّ خَيْرٌ لَّهُنَّ ] [ أبوداوٗد، الصلاۃ، باب ما جاء في خروج النساء إلی المسجد : ۵۶۷ ] ’’اپنی عورتوں کو مسجدوں سے مت روکو اور ان کے گھر ان کے لیے زیادہ اچھے ہیں۔‘‘ ¤ ➐ { يَخَافُوْنَ يَوْمًا تَتَقَلَّبُ فِيْهِ الْقُلُوْبُ وَ الْاَبْصَارُ :} یعنی ان مردوں کا اللہ کے گھروں میں ذکر و تسبیح کرنا اس دن کے خوف کی وجہ سے ہے جب دل اور آنکھیں الٹ جائیں گی، یعنی دل اور آنکھیں خوف اور گھبراہٹ کی شدت سے اپنی معمول کی جگہ چھوڑ دیں گی، جیسا کہ فرمایا : «{ وَ اَنْذِرْهُمْ يَوْمَ الْاٰزِفَةِ اِذِ الْقُلُوْبُ لَدَى الْحَنَاجِرِ كٰظِمِيْنَ }» [ المؤمن : ۱۸ ] ’’اور انھیں قریب آنے والی گھڑی سے ڈرا جب دل گلوں کے پاس غم سے بھرے ہوں گے۔‘‘ اور فرمایا : «{ اِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيْهِ الْاَبْصَارُ }» [ إبراھیم : ۴۲ ] ’’وہ تو انھیں صرف اس دن کے لیے مہلت دے رہا ہے جس میں آنکھیں کھلی رہ جائیں گی۔‘‘"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) {لِيَجْزِيَهُمُ اللّٰهُ اَحْسَنَ مَا عَمِلُوْا:} اس کا ترجمہ یہ ہو سکتا ہے : {’’ أَيْ ثَوَابَ أَحْسَنَ مَا عَمِلُوْا ‘‘} کہ اللہ تعالیٰ انھیں ان بہترین اعمال کا ثواب دے جو انھوں نے کیے، اور یہ بھی : {’’ أَيْ أَحْسَنَ جَزَاءٍ مَا عَمِلُوْا ‘‘} کہ اللہ تعالیٰ انھیں ان اعمال کا بہترین بدلا دے جو انھوں نے کیے۔ دوسرا معنی یہاں زیادہ مناسب ہے، کیونکہ آگے فرمایا : «{ وَ اللّٰهُ يَرْزُقُ مَنْ يَّشَآءُ بِغَيْرِ حِسَابٍ }» ’’اور اللہ جسے چاہتا ہے بے حساب دیتا ہے۔‘‘"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) { وَ الَّذِيْنَ كَفَرُوْۤا اَعْمَالُهُمْ كَسَرَابٍۭ…: ’’سَرَابٌ‘‘} چٹیل میدان یا ریگستانی صحرا میں دوپہر کے وقت سورج کی روشنی کی وجہ سے دور سے ایسا نظر آتا ہے جیسے پانی لہریں مار رہا ہو، اسے ’’سراب‘‘ کہتے ہیں، جو محض نظر کا دھوکا ہوتا ہے۔ {’’قِيْعَةٌ‘‘} اور {’’ قَاعٍ‘‘} دونوں کا معنی چٹیل میدان ہے۔ {’’ الظَّمْاٰنُ ‘‘ ’’فَعْلَانُ‘‘} کے وزن پر مبالغے کا صیغہ ہے، معنی ہے سخت پیاسا۔ اس سے پہلے اہل ایمان کے دل میں ہدایت کے نور کی مثال بیان فرمائی، اب کفار کے اعمال کے لیے دو مثالیں بیان فرمائی ہیں، جیسا کہ سورۂ بقرہ میں منافقین کے لیے آگ اور پانی کی مثال بیان فرمائی اور سورۂ رعد میں اس ہدایت اور علم کی جو دلوں میں جاگزین ہو جاتے ہیں، دو مثالیں بیان فرمائیں، ایک پانی کی اور دوسری آگ کی۔ یہاں کفار کے اعمال کی دو مثالیں لفظ {’’ اَوْ ‘‘} کے ساتھ بیان کی گئی ہیں۔ ¤ بعض اہلِ علم نے سراب والی مثال کی وضاحت اس طرح فرمائی ہے کہ کافر دو قسم کے ہیں، ایک وہ جو اپنے گمان کے مطابق کچھ اچھے کام کرتے ہیں اور سمجھتے ہیں کہ مرنے کے بعد کام آئیں گے، جیسا کہ بیت اللہ کی خدمت، حاجیوں کو پانی پلانا، صدقہ و خیرات وغیرہ کرنا، حالانکہ ان کا کوئی بھی کام، اگرچہ وہ بظاہر اچھا ہی ہو، پھر بھی کفر کی شامت سے اللہ کے ہاں قبول و معتبر نہیں۔ ان لوگوں کو ان کے اچھے اعمال کی جزا دنیا ہی میں دے دی جاتی ہے، جیسا کہ فرمایا : «{ اَذْهَبْتُمْ طَيِّبٰتِكُمْ فِيْ حَيَاتِكُمُ الدُّنْيَا وَ اسْتَمْتَعْتُمْ بِهَا }» [ الأحقاف : ۲۰ ] ’’تم اپنی نیکیاں اپنی دنیا کی زندگی میں لے جا چکے اور تم ان سے فائدہ اٹھا چکے۔‘‘ آخرت میں ان کے اعمال {’’ هَبَاءً مَّنْثُوْرًا ‘‘} (بکھرا ہوا غبار) کر دیے جائیں گے۔ (دیکھیے فرقان : ۲۳) دوسری جگہ ان کے اعمال کی مثال اس راکھ سے بیان فرمائی جس پر آندھی والے دن میں سخت ہوا چلی ہو۔ دیکھیے سورۂ ابراہیم (۱۸)۔ ¤ زیر تفسیر آیت میں فرمایا کہ جن لوگوں نے اپنے رب کے ساتھ کفر کیا ان کے اعمال کی مثال اس طرح ہے جیسے دوپہر کے وقت ایک سخت پیاسے شخص کو دور سے پانی دکھائی دے، جو دراصل سراب ہو، وہ سخت پیاس کی وجہ سے اسے پانی سمجھ کر وہاں پہنچے، تو وہاں پانی وغیرہ کچھ نہ ہو، بلکہ وہاں اس سے حساب کا تقاضا کرنے والے ہوں جو اسے پکڑ کر اپنے حساب میں باندھ لیں۔ اسی طرح کافر اپنے گمان میں اپنے اچھے کاموں کو قیامت کے دن فائدہ پہنچانے والے گمان کرتا ہے، مگر قیامت کے دن وہ سراب کی طرح بے حقیقت ہو جائیں گے اور جزا ملنے کے بجائے اسے اللہ تعالیٰ سے سابقہ پیش آئے گا، جو اس سے اپنا حساب پورا لے گا۔ {’’ وَ اللّٰهُ سَرِيْعُ الْحِسَابِ ‘‘} یعنی اللہ بہت جلد حساب کرنے والا ہے، کیونکہ دوسرے لوگوں کو ہر چیز کا علم نہیں، نہ ان میں سے کوئی ایک وقت میں ایک سے زیادہ کا حساب لے سکتا ہے، اس لیے ان کے حساب میں تاخیر ہو جاتی ہے، جب کہ اللہ تعالیٰ کو پہلی پچھلی ہر چیز کا مکمل علم ہے، وہ کسی لکھنے پڑھنے کا محتاج نہیں اور وہ ایک لمحے میں ساری کائنات کا حساب بھی لے سکتا ہے، اس لیے وہ {’’ سَرِيْعُ الْحِسَابِ ‘‘} ہے۔ اسے حساب میں کچھ دیر نہیں لگتی۔ ¤ دوسری قسم کے کافر وہ ہیں جنھیں آخرت کی فکر ہی نہیں کہ اس کی وجہ سے وہ کوئی اچھا کام کریں، وہ سر سے پاؤں تک دنیا کی لذتوں میں غرق ہیں اور کفر و ضلالت، ظلم و جہل، خواہش پرستی اور اللہ کی نافرمانی میں غوطے کھا رہے ہیں۔ ان کی مثال آگے بیان فرمائی کہ ان کے پاس روشنی کی اتنی چمک بھی نہیں جتنی سراب پر دھوکا کھانے والے کو نظر آتی تھی۔ یہ لوگ خالص اندھیروں اور تہ بہ تہ ظلمات میں بندہیں، روشنی کی کوئی شعاع کسی طرف سے ان تک نہیں پہنچتی۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ {اَوْ كَظُلُمٰتٍ فِيْ بَحْرٍ لُّجِّيٍّ … : ’’ لُجِّيٍّ ‘‘} میں یاء نسبت کی ہے اور یہ{’’لُجٌّ‘‘} کی طرف منسوب ہے، جو {’’لُجَّةٌ‘‘} کی جمع ہے، جس کا معنی ہے بہت بڑا اور گہرا پانی۔ {’’ بَحْرٍ لُّجِّيٍّ ‘‘} کا معنی ہو گا ’’نہایت گہرے پانیوں والا سمندر۔‘‘ اس مثال کی وضاحت یہ ہے کہ گہرے پانیوں والے سمندر کی گہرائی پانی کی موٹائی کی وجہ سے نہایت تاریک ہوتی ہے۔ جدید تحقیقات بھی یہی ہیں کہ سمندر کی گہرائی میں ایک حد کے بعد روشنی کا گزر بالکل نہیں ہوتا، پھر جب اس پر تہ بہ تہ موجیں ہوں تو تاریکی اور بڑھ جاتی ہے اور جب ان موجوں کے اوپر بادل بھی ہوں تو تاریکی اپنی انتہا کو پہنچ جاتی ہے، تو جو شخص ایسے سمندر کی گہرائی میں ہو وہ اتنی تہ بہ تہ تاریکیوں میں ہو گا کہ اپنے ہاتھ کو دیکھنا چاہے تو قریب نہیں کہ دیکھ پائے، حالانکہ آدمی اپنے جسم کا جو حصہ آنکھوں کے سب سے زیادہ قریب لے جا کر دیکھ سکتا ہے وہ اس کا ہاتھ ہے۔ ¤ ➋ آیت میں کافر کے عمل کی ایسے شخص کے ساتھ تشبیہ کی کیفیت اہلِ علم نے کئی طرح بیان فرمائی ہے، طبری نے ابی بن کعب رضی اللہ عنہ سے معتبر سند کے ساتھ نقل فرمایا ہے کہ انھوں نے فرمایا : ’’کافر پانچ ظلمتوں میں پھرتا رہتا ہے، چنانچہ اس کا کلام ظلمت ہے، اس کا عمل ظلمت ہے، وہ ظلمت میں داخل ہوتا ہے اور ظلمت ہی میں سے نکلتا ہے اور قیامت کے دن آگ کی طرف جاتے ہوئے اس کا لوٹنا بھی ظلمتوں میں ہو گا۔‘‘ (طبری : ۲۶۳۷۱) یہ سید القراء کی تفسیر ہے، بعض اہلِ علم نے فرمایا : ’’اللہ تعالیٰ نے تین طرح کی ظلمتیں بیان فرمائی ہیں، سمندر کی ظلمت، امواج کی ظلمت اور بادلوں کی ظلمت۔ اسی طرح کافر بھی تین ظلمتوں میں گرفتار ہے، عقیدے کی ظلمت، قول کی ظلمت اور عمل کی ظلمت۔‘‘ ¤ رازی نے اسے حسن کی طرف منسوب کیا ہے۔ بعض اہلِ علم نے فرمایا کہ ان ظلمتوں سے مراد دل پر، آنکھوں پر اور کانوں پر پڑے ہوئے پردے ہیں، جیسا کہ فرمایا : «{ خَتَمَ اللّٰهُ عَلٰى قُلُوْبِهِمْ وَ عَلٰى سَمْعِهِمْ وَ عَلٰۤى اَبْصَارِهِمْ غِشَاوَةٌ }» [ البقرۃ : ۷ ] ’’اللہ نے ان کے دلوں پر اور ان کے کانوں پر مہر لگا دی اور ان کی نگاہوں پر بھاری پردہ ہے۔‘‘ بعض نے فرمایا، تاریک دل تاریک سینے میں ہے جو تاریک جسم میں ہے۔ ایک وجہ تشبیہ یہ ہے کہ کافر حق بات نہیں جانتا اور اسے یہ علم بھی نہیں ہوتا کہ وہ نہیں جانتا اور وہ سمجھتا یہ ہے کہ وہ جانتا ہے۔ یہ تینوں مراتب ان تین ظلمتوں کے مشابہ ہیں۔ (رازی) ¤ ایک وجہ تشبیہ یہ ہے کہ کافر کے اعمال کو اس شخص کی مجموعی حالت کے ساتھ تشبیہ دی ہے جو سمندر، اس کی امواج اور بادلوں کی تاریکیوں میں گھرا ہوا ہے۔ اسے تشبیہ تمثیل کہتے ہیں اور اس میں مشبّہ کی ایک ایک چیز کی مشبّہ بہ کی ایک ایک چیز کے ساتھ مشابہت تلاش کرنے کی ضرورت نہیں ہوتی۔ یہ توجیہ تکلف سے خالی ہونے کی وجہ سے بہت اچھی ہے۔ ¤ ➌ { وَ مَنْ لَّمْ يَجْعَلِ اللّٰهُ لَهٗ نُوْرًا فَمَا لَهٗ مِنْ نُّوْرٍ:} اس سے پہلے آیت (۳۵) میں مومن کے متعلق فرمایا تھا : «{ يَهْدِي اللّٰهُ لِنُوْرِهٖ مَنْ يَّشَآءُ }» ’’اللہ اپنے نور کی طرف جس کی چاہتا ہے رہنمائی کرتا ہے۔‘‘ اب کافر کے متعلق فرمایا : «{ وَ مَنْ لَّمْ يَجْعَلِ اللّٰهُ لَهٗ نُوْرًا فَمَا لَهٗ مِنْ نُّوْرٍ }» جسے اللہ تعالیٰ (اس کی استعداد کی خرابی کی وجہ سے) نورِ ہدایت نہ دے اسے کہیں سے بھی کوئی نور نہیں مل سکتا۔ یا اللہ! تو اپنے خاص فضل و کرم سے ہمیں اپنا نور ہدایت عطا فرما اور ہمیں ان لوگوں میں شامل فرما جن کے متعلق تو نے فرمایا ہے : «{ يَوْمَ تَرَى الْمُؤْمِنِيْنَ وَ الْمُؤْمِنٰتِ يَسْعٰى نُوْرُهُمْ بَيْنَ اَيْدِيْهِمْ وَ بِاَيْمَانِهِمْ }» [ الحدید : ۱۲ ] ’’جس دن تو ایمان والے مردوں اور ایمان والی عورتوں کو دیکھے گا ان کی روشنی ان کے آگے اور ان کی دائیں طرفوں میں دوڑ رہی ہو گی۔‘‘"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ { اَلَمْ تَرَ اَنَّ اللّٰهَ يُسَبِّحُ لَهٗ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ :} اس سے پہلی آیات میں یہ بتایا کہ آسمانوں اور زمین کو حسی اور معنوی نور سے روشن کرنے والا اللہ تعالیٰ ہی ہے، ساتھ ہی مومنوں کے دلوں کے نور ایمان سے منور ہونے اور کفار کے دلوں کے تاریکیوں میں غوطے کھانے کی مثالیں بیان فرمائیں، اب آسمانوں اور زمین میں پھیلے ہوئے اس نور (توحید) کی طرف رہنمائی کرنے والے چند دلائل بیان فرمائے۔ ¤ ➋ { اَلَمْ تَرَ :} یہ بات تو صاف ظاہر ہے کہ زمین و آسمان میں موجود ہر چیز کو اللہ تعالیٰ کی تسبیح بیان کرتے ہوئے اللہ تعالیٰ کے سوا کسی نے بھی نہیں دیکھا، اس لیے یہاں {’’ اَلَمْ تَرَ ‘‘} سے مراد یہ نہیں کہ ’’کیا تو نے نہیں دیکھا ‘‘ بلکہ مراد ہے {’’أَلَمْ تَعْلَمْ‘‘} یعنی کیا تجھے معلوم نہیں؟ جیسا کہ فرمایا : { اَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِاَصْحٰبِ الْفِيْلِ } [ الفیل : ۱ ] اس میں مخاطب اگر رسول اللہ صلی اللہ علیہ وسلم ہوں تو آپ پیدا ہی اس واقعہ کے بعد ہوئے ہیں، آپ کے اسے دیکھنے کا سوال ہی پیدا نہیں ہوتا اور اگر ہر شخص اس کا مخاطب ہے تو ہر شخص کا اس واقعہ کو دیکھنا ممکن ہی نہیں، اس لیے وہاں بھی معنی {’’أَلَمْ تَعْلَمْ‘‘} ہے۔ دراصل اس لفظ سے پوچھنا نہیں بلکہ بتانا مقصود ہوتا ہے کہ کیا تمھیں یہ بات معلوم نہیں، اگر معلوم نہیں ہے تو اب جان لو، اور {’’ اَلَمْ تَرَ ‘‘} کا لفظ اس لیے فرمایا کہ اللہ تعالیٰ کے بتانے سے حاصل ہونے والا علم خود دیکھنے سے حاصل ہونے والے علم کی طرح بلکہ اس سے بھی زیادہ یقینی ہے۔ (شعراوی) ¤ ➌ یعنی کیا تمھیں معلوم نہیں کہ زمین و آسمان میں جو بھی موجود ہیں، یعنی جن، انسان، فرشتے، جانور، اڑتے ہوئے پرندے، حتیٰ کہ نباتات اور جمادات سب شہادت دیتے ہیں کہ ہمیں پیدا کرنے والا اور ساری کائنات کو کسی خرابی کے بغیر نہایت حُسن و خوبی سے چلانے والا ہر نقص اور ہر شریک سے پاک ہے۔ تو جب ہر چیز اللہ کی تسبیح بیان کرتی ہے تو انسان پر تو سب سے بڑھ کر اس کی تسبیح کرنا اور اس کی توحید کی شہادت دینا لازم ہے۔ کائنات کی ہر چیز کی یہ تسبیح زبان حال ہی سے نہیں زبان قال سے یعنی بول کر بھی ہے۔ اس کی تفصیل کے لیے دیکھیے سورۂ بنی اسرائیل (۴۴) اور سورۂ رعد (۱۳)۔ ¤ ➍ { وَ الطَّيْرُ صٰٓفّٰتٍ:} زمین و آسمان میں موجود ہر چیز کی تسبیح کے بعد پرندوں کی تسبیح کا الگ ذکر فرمایا، کیونکہ وہ اڑتے وقت نہ زمین پر ہوتے ہیں نہ آسمان میں، بلکہ ان کے درمیان معلق ہوتے ہیں، یہ پرندے بھی اللہ کے ہر نقص سے پاک ہونے کی گواہی دے رہے ہیں۔ مزید دیکھیے سورۂ ملک (۱۹)۔ ¤ ➎ { كُلٌّ قَدْ عَلِمَ صَلَاتَهٗ وَ تَسْبِيْحَهٗ :} اس سے معلوم ہوا کہ ان کی یہ تسبیح اتفاقی طور پر بے سوچے سمجھے نہیں، بلکہ سمجھ کر اور علم کی بنا پر ہے، جو اللہ تعالیٰ نے انھیں سکھایا اور ان کی طرف الہام کیا ہے۔ ¤ ➏ { وَ اللّٰهُ عَلِيْمٌۢ بِمَا يَفْعَلُوْنَ :} یعنی اللہ تعالیٰ ان کی تسبیح اور بندگی کو اور ان کے ہر عمل کو خوب جاننے والا ہے۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) { وَ لِلّٰهِ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ … :} آسمان و زمین یعنی پوری کائنات میں حقیقی بادشاہی صرف اللہ کی ہے، اسی نے سب کو پیدا فرمایا، زندگی کا سارا سلسلہ وہی چلا رہا ہے اور سب کی واپسی بھی آخر کار اسی کی طرف ہے۔ نہ دنیا میں اس کی سلطنت میں کسی کا دخل ہے نہ آخرت میں اس کے سوا کسی کا کوئی دخل ہو گا۔ جب زمین و آسمان اور دنیا و آخرت میں سارا اختیار اسی کا ہے تو پھر دوسرے کی عبادت کیوں ہو !"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ {اَلَمْ تَرَ اَنَّ اللّٰهَ يُزْجِيْ سَحَابًا …: ’’ أَزْجٰي يُزْجِيْ ‘‘} نرمی کے ساتھ چلانا، ہانکنا، دھکیلنا۔ {’’ ألَّفَ يُؤَلِّفُ‘‘} دو یا زیادہ چیزوں کو جوڑنا۔ بادل کو جوڑنے سے مراد اس کے ٹکڑوں کو جوڑنا ہے۔ {’’رَكْمٌ‘‘ } کہتے ہیں ایک چیز کو دوسری کے اوپر رکھنا۔{ ’’رُكَامًا ‘‘} تہ بہ تہ۔ {’’خِلاَلٌ‘‘ ’’خَلَلٌ‘‘} کی جمع ہے، جیسے : {’’جِبَالٌ‘‘ ’’جَبَلٌ‘‘} کی جمع ہے۔ {’’خَلَلٌ‘‘} کا معنی شگاف، دراڑ اور سوراخ ہے۔ ¤ ➋ ہوائیں کئی کام سر انجام دیتی ہیں، اللہ تعالیٰ پہلے ہوائیں بھیجتا ہے، وہ زمین پر جھاڑو پھیر کر خوب صفائی کر دیتی ہیں، پھر مزید ہوائیں بھیجتا ہے، وہ بادلوں کو اٹھا لاتی ہیں، تیسری ہوائیں بادلوں کو ایک دوسرے کے ساتھ جوڑ کر تہ بہ تہ کر دیتی ہیں، پھر چوتھی ہوائیں انھیں برسانا شروع کر دیتی ہیں۔ دیکھیے سورۂ اعراف (۵۷)، روم (۴۸) اور فاطر (۹)۔ ¤ یہ توحید کی دوسری دلیل ہے، یعنی اللہ تعالیٰ بادلوں کو چلاتا ہے، پھر انھیں جوڑ کر تہ بہ تہ کر دیتا ہے، پھر یہ بھی اس کا احسان ہے کہ تہ بہ تہ بادلوں میں موجود پانی کے ذخیرے کو قطروں کی صورت میں زمین پر گراتا ہے، جس سے مردہ زمین زندہ ہو جاتی ہے اور انسانوں، حیوانوں اور پودوں کو زندگی ملتی ہے۔ اگر وہ سیکڑوں ہزاروں مربع میل میں پھیلے ہوئے بادلوں کا کروڑوں اربوں ٹن پانی ایک ہی وقت میں زمین پر گرا دے تو نہ کوئی جان دار اس بوجھ کو برداشت کر سکے، نہ کوئی پودا اور نہ کوئی مکان باقی رہ جائے جس میں کوئی شخص سکونت اختیار کر سکے۔ ¤ ➌ { وَ يُنَزِّلُ مِنَ السَّمَآءِ مِنْ جِبَالٍ فِيْهَا مِنْۢ بَرَدٍ: ’’ بَرَدٍ ‘‘} ’’اولے۔‘‘ زمین سے جیسے جیسے بلندی کی طرف جائیں ٹھنڈک بڑھتی چلی جاتی ہے اور بعض اوقات اللہ کے حکم سے بادل برف کے پہاڑوں کی صورت اختیار کر جاتے ہیں۔ اب یہ اللہ کا فضل ہے کہ برف کے ان پہاڑوں میں سے تودوں کی شکل میں برف گرانے کے بجائے وہ اسے اولوں کی شکل میں گراتا ہے، جس سے کم از کم نقصان ہوتا ہے اور یہ بھی اس کی قدرت کا ثبوت ہے کہ وہی سمندر ہے، وہی سورج ہے جس کی تپش سے پانی بخارات بن کر اٹھتا ہے، وہی زمین ہے جس پر برستا ہے، زمین کے ہر قطعے کا سمندر سے اتنا ہی فاصلہ ہے جتنا پہلے تھا، پہاڑ جن سے ٹکرا کر سائنسدان بارش برسنے کا ذکر کرتے ہیں، وہ بھی اسی جگہ ہیں، سارے اسباب یکساں ہونے کے باوجود ہمیشہ ہر جگہ ایک جیسی نہ بارش ہوتی ہے، نہ اولے پڑتے ہیں۔ کسی جگہ اگر کبھی خوش حالی لانے والی بارش ہے تو کبھی وہاں قحط مسلط کرنے والی خشکی ہے، کبھی غرق کر دینے والا سیلاب ہے اور کبھی اولوں کی صورت میں تباہی و بربادی ہے، یہ سب کچھ اللہ مالک الملک کی توحید، اس کی قدرت اور اس کے اختیار کی دلیل ہے۔ ¤ ➍ { فَيُصِيْبُ بِهٖ مَنْ يَّشَآءُ وَ يَصْرِفُهٗ عَنْ مَّنْ يَّشَآءُ :} اس میں اللہ تعالیٰ نے اپنے اختیار کا ذکر فرمایا ہے کہ وہ ان اولوں کو جس پر برسانا چاہتا ہے برسا دیتا ہے اور جس سے ہٹانا چاہتا ہے ہٹا دیتا ہے، محکمہ موسمیات کے اندازے دھرے کے دھرے رہ جاتے ہیں۔ ¤ ➎ {يَكَادُ سَنَا بَرْقِهٖ يَذْهَبُ بِالْاَبْصَارِ: ’’ سَنَا ‘‘} بروزن {’’ عَصَا ‘‘} چمک، روشنی اور {’’ سَنَاءٌ‘‘} بروزن {’’جَلاَءٌ‘‘} بلندی اور رفعت شان۔ آیت کا یہ جملہ اس جملے کی طرح ہے جس میں فرمایا : «{ يَكَادُ الْبَرْقُ يَخْطَفُ اَبْصَارَهُمْ }» [ البقرۃ : ۲۰ ] مزید دیکھیے سورۂ رعد (۱۲، ۱۳)۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) { يُقَلِّبُ اللّٰهُ الَّيْلَ وَ النَّهَارَ …:} یہ اس بات کی تیسری دلیل ہے کہ اس کائنات کا مالک و مختار اللہ وحدہ لا شریک لہ ہے اور اس کی ہدایت کی روشنی زمین و آسمان میں ہر جگہ پھیلی ہوئی ہے، چنانچہ فرمایا، اللہ تعالیٰ رات اور دن کو بدلتا رہتا ہے، نہ ہمیشہ دن رہتا ہے نہ رات۔ دیکھیے قصص (۷۱ تا ۷۳) پھر کبھی رات چھوٹی ہوتی ہے کبھی دن۔ دیکھیے لقمان (۲۹) واضح رہے کہ زمین پر زندہ رہنے کے جتنے اسباب موجود ہیں رات دن کے اسی الٹ پھیر کی بدولت ہیں، اگر ہمیشہ رات رہتی یا ہمیشہ دن رہتا تو کوئی چیز پیدا نہ ہو سکتی، یہ سب اللہ سبحانہ و تعالیٰ کا بنایا ہوا نظام ہے۔ رات دن کو یا اس نظام کو برا بھلا کہنے والا درحقیقت اللہ تعالیٰ کو برا بھلا کہتا ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ قَالَ اللّٰهُ تَبَارَكَ وَ تَعَالٰي يُؤْذِيْنِي ابْنُ آدَمَ، يَقُوْلُ يَا خَيْبَةَ الدَّهْرِ! فَلَا يَقُوْلَنَّ أَحَدُكُمْ يَا خَيْبَةَ الدَّهْرِ! فَإِنِّيْ أَنَا الدَّهْرُ، أُقَلِّبُ لَيْلَهُ وَ نَهَارَهُ، فَإِذَا شِئْتُ قَبَضْتُهُمَا ] [ مسلم، الألفاظ من اللأدب وغیرھا، باب النہي عن سب الدھر : 2246/3 ] ’’اللہ عز و جل فرماتا ہے، ابن آدم مجھے ایذا دیتا ہے، کہتا ہے، ہائے زمانے کی کم بختی! سو تم میں سے کوئی ہرگز یوں نہ کہے، ہائے زمانے کی کم بختی! اس لیے کہ میں ہی زمانہ ہوں، میں رات دن کو بدل بدل کر لاتا ہوں اور میں جب چاہوں گا دونوں کو سمیٹ لوں گا۔‘‘"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ { وَ اللّٰهُ خَلَقَ كُلَّ دَآبَّةٍ مِّنْ مَّآءٍ …:} اس کی تفسیر کے لیے دیکھیے سورۂ انبیاء کی آیت (۳۰) یہ اس مقام پر توحید کی چوتھی دلیل ہے کہ اللہ تعالیٰ نے ہر چلنے والا (جان دار) پانی سے پیدا فرمایا، پھر ایک ہی چیز سے پیدا ہونے والے تمام جان دار زندگی کی پہلی حالت ہی میں ایک دوسرے سے مختلف ہیں، کوئی اپنے پیٹ پر چلتا ہے جیسے سانپ، مچھلی اور بعض قسم کے کیڑے مکوڑے، کوئی دو پاؤں پر چلتا ہے جیسے انسان اور پرندے اور کوئی چار پاؤں پر چلتا ہے جیسے گائے، بھینس، گھوڑے اور دوسرے چوپائے اور درندے۔ ¤ ➋ {يَخْلُقُ اللّٰهُ مَا يَشَآءُ :} یعنی کسی جانور کو چاہے تو اس سے زیادہ پاؤں دے دیتا ہے، جیسے کنکھجورا، کیکڑا، مکڑی اور کئی قسم کے کیڑے اور سمندری مخلوق۔ یہ کائنات میں پھیلے ہوئے نور ہدایت ہی کا اظہار ہے، جسے دیکھ کر سعادت مند لوگ اللہ تعالیٰ کی توحید پر ایمان لے آتے ہیں اور اس پر بھی کہ جب اللہ تعالیٰ جو چاہے پیدا فرما سکتا ہے، تو وہ قیامت کے روز دوبارہ زندہ بھی کرے گا۔ چلنے میں جانوروں کی ترتیب بھی قابل توجہ ہے، سب سے پہلے وہ جس کے پاؤں ہی نہیں، ان کے چلنے میں قدرت کا اظہار سب سے زیادہ ہے، پھر دو پاؤں پر چلنا چار پاؤں پر چلنے سے عجیب ہے۔ ¤ ➌ { اِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ:} یہ اس بات کی دلیل ہے کہ اللہ جو چاہے پیدا کر سکتا ہے، کیونکہ وہ ہر چیز پر پوری طرح قادر ہے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { لَقَدْ اَنْزَلْنَاۤ اٰيٰتٍ مُّبَيِّنٰتٍ :} دیکھیے اسی سورت کی آیت (۳۴) کی تفسیر۔ ¤ ➋ { وَ اللّٰهُ يَهْدِيْ مَنْ يَّشَآءُ :} دیکھیے اسی سورت کی آیت (۳۵) کی تفسیر۔ ¤ ➌ یہ آیت آئندہ آیات کی تمہید ہے، جن میں منافقین کا ذکر فرمایا ہے کہ یقینا ہم نے تو کھول کر بیان کرنے والی عظیم الشان آیات نازل کی ہیں، مگر ان کے ذریعے سے صراطِ مستقیم کی ہدایت دینا صرف اللہ تعالیٰ کا کام ہے۔ آگے کچھ ایسے لوگوں کا ذکر فرمایا جنھیں ہدایت دینا اللہ کی مشیت نہیں ہے۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) { وَ يَقُوْلُوْنَ اٰمَنَّا بِاللّٰهِ وَ بِالرَّسُوْلِ وَ اَطَعْنَا:} اس جملے کا {’’ وَ اللّٰهُ يَهْدِيْ مَنْ يَّشَآءُ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ ‘‘} پر عطف ہے، گویا اللہ تعالیٰ اب ان لوگوں کا ذکر کر رہے ہیں جنھیں ہدایت دینا اللہ تعالیٰ نے نہیں چاہا، یہ وہ لوگ ہیں جو ظاہر تو اسلام کرتے ہیں لیکن دل میں کفر چھپائے ہوئے ہیں، یہ منافق لوگ ہیں۔ اس آیت کا مضمون سورۂ نساء کی آیات (۶۰ تا ۶۵) سے ملتا جلتا ہے، ان کی تفسیر پر نظر ڈال لیں۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) { وَ اِذَا دُعُوْۤا اِلَى اللّٰهِ وَ رَسُوْلِهٖ لِيَحْكُمَ بَيْنَهُمْ …:} واضح رہے کہ اللہ اور اس کے رسول کی طرف بلائے جانے کا معاملہ صرف نبی صلی اللہ علیہ وسلم کی زندگی تک ہی نہیں تھا، بلکہ آپ صلی اللہ علیہ وسلم کے بعد آپ کی سنت کی طرف جو دعوت دی جاتی ہے وہ اصل میں آپ ہی کی طرف دعوت ہوتی ہے، اس سے منہ موڑنے والے کا حکم بھی وہی ہے جو اس آیت میں منافقین کے گروہ کا بیان ہوا ہے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) {وَ اِنْ يَّكُنْ لَّهُمُ الْحَقُّ …: ’’ مُذْعِنِيْنَ ‘‘ ’’أَيْ مُنْقَادِيْنَ‘‘} مطیع ہونے والے، یعنی جب دیکھتے ہیں کہ شریعت کے مطابق فیصلے میں ان کا فائدہ ہے، تب تو بڑے فرماں بردار بن کر آتے ہیں اور ایمان کے لمبے چوڑے دعوے کرتے ہیں ورنہ دبک کر بیٹھ جاتے ہیں اور شریعت کے احکامات میں کیڑے نکالنا شروع کر دیتے ہیں۔ معلوم ہوا کہ شریعت کی اس طرح کی پیروی اللہ تعالیٰ کی نظر میں کوئی وزن نہیں رکھتی، کیونکہ یہ شریعت کی پیروی نہیں بلکہ نفس کی پیروی ہے۔ (ابن کثیر)"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) { اَفِيْ قُلُوْبِهِمْ مَّرَضٌ اَمِ ارْتَابُوْۤا …: ’’حَافَ يَحِيْفُ حَيْفًا ‘‘} ظلم کرنا، یعنی آخر یہ لوگ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی عدالت میں فیصلہ لے جانے سے کیوں کتراتے ہیں؟ آیا اس لیے کہ ان کے دلوں میں کفر و نفاق کی بیماری ہے، یا اس لیے کہ انھیں پیغمبر کے سچا ہونے میں شک ہے، یا اس لیے کہ انھیں فکر ہے کہ آپ صلی اللہ علیہ وسلم کے پاس مقدمہ لے جائیں گے تو ہم پر ظلم کیا جائے گا؟ ظاہر ہے کہ نہ تو انھیں آپ صلی اللہ علیہ وسلم کی نبوت میں شک ہے اور نہ انھیں یہ خوف ہے کہ آپ صلی اللہ علیہ وسلم غلط فیصلہ کرکے ان پر ظلم کریں گے (کیونکہ ایسا نہ پہلے کبھی ہوا نہ ہو گا) تو پھر بات یہی رہ جاتی ہے کہ ان کے دلوں ہی میں بیماری ہے، ظالم اور قصور وار یہ خود ہیں، یعنی جس شخص کا ان کے ذمے حق ہے اس کو دبانا چاہتے ہیں۔ (جامع البیان، فتح القدیر) ¤ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’دل میں روگ یہ کہ اللہ اور رسول کو سچ جانا لیکن حرص نہیں چھوڑتی کہ کہے پر چلیں، جیسے بیمار چاہتا ہے کہ چلے مگر پاؤں نہیں اٹھتے۔‘‘ (موضح) اس سے معلوم ہوا کہ جو قاضی کتاب و سنت کے مطابق فیصلہ کرتا ہو اس کے سمن کو قبول کرنا واجب ہے اور اس سے کترانا اللہ اور اس کے رسول کے فیصلے سے منہ موڑنا ہے، مگر جو قاضی کتاب و سنت سے بے خبر ہو اور اس نے کسی عالم و مجتہد کے آراء و اجتہادات کو جمع کر رکھا ہو اور اس کے مطابق فیصلہ کرتا ہو تو اس کے پاس مقدمہ لے جانا اور اس کے سمن کو قبول کرنا ضروری نہیں، اس لیے کہ اس رائے پر عمل کرنا اس مجتہد کے لیے جائز تھا جس کی طرف وہ رائے منسوب ہے اور وہ بھی اس وقت تک جب تک اسے کتاب و سنت کا فیصلہ نہ پہنچا تھا، مگر کسی دوسرے کے لیے اس پر آنکھیں بند کرکے عمل کرنا اور اس کے مطابق لوگوں کے مقدمات کے فیصلے کرنا صحیح نہیں۔ (شوکانی)"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) { اِنَّمَا كَانَ قَوْلَ الْمُؤْمِنِيْنَ …:} پچھلی آیات میں منافقین کی حالت بیان ہوئی، اب اس آیت میں خالص مومنوں کا بیان اور ان کی تعریف ہے، یعنی سچے مومنوں کا کام یہ ہوتا ہے کہ جب کسی تنازع کے فیصلے کے لیے انھیں اللہ اور اس کے رسول (کتاب و سنت) کی طرف بلایا جائے، خواہ اس میں بظاہر ان کا نفع ہو یا نقصان تو وہ ایک لمحے کی تاخیر نہیں کرتے، بلکہ فوراً کہتے ہیں ہم نے سنا اور اطاعت کی اور یہی لوگ ہیں جو حقیقت میں کامیاب ہیں۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) { وَ مَنْ يُّطِعِ اللّٰهَ وَ رَسُوْلَهٗ … : ’’ يَتَّقْهِ ‘‘} اصل میں {’’يَتَّقِيْهِ‘‘} تھا، آیت کے شروع میں اسم جازم {’’ مَنْ ‘‘} کی وجہ سے اس کی یاء گر گئی اور لفظ {’’يَتَّقِهِ‘‘} ہو گیا، جس میں قاف اور ہاء دونوں پر کسرہ ہے، پھر تخفیف کے لیے قاف کو ساکن کر دیا، جیسے {’’كَتْفٌ‘‘} کی تاء کو ساکن کیا گیا۔ (ابوالسعود) یعنی صرف باہمی جھگڑے کے لیے ہی نہیں بلکہ مومن کے لیے ضروری ہے کہ وہ اپنے ہر کام میں اللہ اور اس کے رسول کی اطاعت کرے اور کوئی کوتاہی ہو جائے تو اللہ سے ڈرے، اس گناہ سے توبہ کرے اور معافی مانگے اور آئندہ کے لیے بھی اللہ تعالیٰ سے ڈرتا رہے اور جو ایسا کریں سو وہی مراد پانے والے ہیں۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ {وَ اَقْسَمُوْا بِاللّٰهِ جَهْدَ اَيْمَانِهِمْ … : ’’ جَهْدَ اَيْمَانِهِمْ ‘‘} کی دوو ترکیبیں ہو سکتی ہیں، ایک یہ کہ یہ فعل محذوف کا مصدر ہے، جو اس فعل کی تاکید کر رہا ہے : {’’أَيْ أَقْسَمُوْا بِاللّٰهِ يَجْهَدُوْنَ أَيْمَانَهُمْ جَهْدًا‘‘} اور {’’ جَهْدَ اَيْمَانِهِمْ ‘‘} کا مطلب یہ ہے کہ وہ اللہ کی قسم کھانے کی زیادہ سے زیادہ جو طاقت رکھتے تھے اس کے ساتھ انھوں نے قسم کھائی۔ یہ ’’جَھَدَ نَفْسَہُ ‘‘ سے ماخوذ ہے، جس کا معنی ہے اس نے اپنی جان کی آخری طاقت لگا دی۔ دوسری ترکیب یہ ہے کہ یہ حال ہونے کی وجہ سے منصوب ہے : {’’أَيْ أَقْسَمُوْا بِاللّٰهِ مُجْتَهِدِيْنَ فِيْ أَيْمَانِهِمْ‘‘} یعنی انھوں نے قسموں میں اپنی پوری کوشش لگاتے ہوئے اللہ کی قسم کھائی۔ (شوکانی) یعنی منافقین کو اپنے طرز عمل کی وجہ سے احساس تھا کہ مسلمان ہماری بات کا اعتبار نہیں کرتے تو انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے زیادہ سے زیادہ پکی قسمیں کھا کر کہا کہ اگر آپ ہمیں ہمارے گھروں اور اہل و عیال سے نکلنے کا حکم دیں تو ہم ان سے نکل جائیں گے اور اگر جہاد کا حکم دیں تو ہم ہر صورت آپ کے ساتھ جہاد کے لیے نکلیں گے، غرض جو کہیں گے اس پر عمل کریں گے۔ درحقیقت ان کا قسم کھانا ہی اس بات کی چغلی کر رہا تھا کہ ان کی بات کا اعتبار نہیں، جیسا کہ متنبی نے کہا ہے: ¤ {وَ فِيْ يَمِيْنِكَ فِيْمَا أَنْتَ وَاعِدُهُ ¤ مَا دَلَّ أَنَّكَ فِي الْمِيْعَادِ مُتَّهَمُ} ¤ ’’اور تو جس بات کا وعدہ کر رہا ہے اس پر تیرے قسم کھانے میں اس بات کی دلیل ہے کہ تو اپنے وعدے میں قابل اعتبار نہیں۔‘‘ ¤ اللہ تعالیٰ نے فرمایا، ان سے کہہ دے کہ قسمیں مت کھاؤ۔ ¤ ➋ { طَاعَةٌ مَّعْرُوْفَةٌ: ’’أَيْ الْمَطْلُوْبُ مِنْكُمْ طَاعَةٌ مَّعْرُوْفَةٌ‘‘} یعنی مطلوب تم سے قسمیں لینا نہیں بلکہ مطلوب جانے پہچانے طریقے کے مطابق فرماں برداری ہے اور یہی کافی ہے، قسموں کی ضرورت نہیں۔ دوسرا مطلب یہ ہے : {’’طَاعَتُكُمْ طَاعَةٌ مَّعْرُوْفَةٌ‘‘} کہ قسمیں مت کھاؤ، تمھاری اطاعت جانی پہچانی اور تمھارا جھوٹ مشہور و معروف ہے، سب جانتے ہیں کہ تم کیسی اطاعت کرتے ہو۔ قسمیں کھانے سے تم مطیع نہیں بن جاؤ گے، تم جو کچھ کر رہے ہو یا کرو گے، جتنا چاہو چھپانے کی کوشش کرو، اللہ تعالیٰ اس سے پوری طرح باخبر ہے۔ اس دوسری تفسیر کی تائید اس آیت سے ہوتی ہے : «{ يَحْلِفُوْنَ لَكُمْ لِتَرْضَوْا عَنْهُمْ فَاِنْ تَرْضَوْا عَنْهُمْ فَاِنَّ اللّٰهَ لَا يَرْضٰى عَنِ الْقَوْمِ الْفٰسِقِيْنَ }» [ التوبۃ : ۹۶ ] ’’تمھارے لیے قسمیں کھائیں گے، تاکہ تم ان سے راضی ہو جاؤ، پس اگر تم ان سے راضی ہو جاؤ تو بے شک اللہ نافرمان لوگوں سے راضی نہیں ہوتا۔‘‘"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ { قُلْ اَطِيْعُوا اللّٰهَ وَ اَطِيْعُوا الرَّسُوْلَ:} یعنی صرف اللہ کا نہیں بلکہ اللہ کا بھی اور اس کے ساتھ رسول کا بھی حکم مانو۔ یہ بتانے کی ضرورت نہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی وفات کے بعد ان کا کہنا ماننا یہی ہے کہ ان کی سنت کی پیروی کی جائے۔ ¤ ➋ {فَاِنْ تَوَلَّوْا : ’’ تَوَلَّوْا ‘‘} اصل میں {’’تَتَوَلَّوْا‘‘} ہے، جو مضارع میں سے مخاطب کا صیغہ ہے، معنی ہے اگر تم پھر جاؤ۔ یہ فعل ماضی سے غائب کا صیغہ نہیں، جس کا معنی ہے اگر وہ پھر جائیں، کیونکہ آگے انھیں مخاطب کیا جا رہا ہے : «{ فَاِنَّمَا عَلَيْهِ مَا حُمِّلَ وَ عَلَيْكُمْ مَّا حُمِّلْتُمْ }» یعنی اگر تم کسی طرح کی بھی حکم عدولی کرو گے تو رسول اللہ صلی اللہ علیہ وسلم کا کچھ نقصان نہیں۔ اس کی ذمہ داری تم تک اللہ کا پیغام پہنچا دینا تھی، سو اس نے یہ پیغام پہنچا دیا، اب اس پر عمل کرنا تمھاری ذمہ داری ہے، اگر تم اس سے پیٹھ پھیرتے ہو تو اپنا انجام خود سوچ لو۔ ¤ ➌ { وَ اِنْ تُطِيْعُوْهُ تَهْتَدُوْا :} یعنی اگر تم رسول کی اطاعت کرو گے تو ہدایت پا جاؤ گے، اس کے سوا جس کی بھی اطاعت کرو گے ہدایت نہیں پاؤ گے۔ ابن عطیہ نے یہاں سلف میں سے بعض کا قول نقل فرمایا ہے جو اس آیت کی بہترین تفسیر ہے، لکھتے ہیں : ’’جو شخص اپنے قول و فعل میں سنت کو اپنا امیر بنا لے وہ حکمت اور دانائی کی بات کرے گا اور جو اپنے قول و فعل میں خواہش کو امیر بنا لے وہ بدعت کی بات کرے گا۔‘‘ [ المحرر الوجیز ] ¤ ➍ { وَ مَا عَلَى الرَّسُوْلِ اِلَّا الْبَلٰغُ الْمُبِيْنُ :} یعنی اگر تمھیں ہدایت نہ ہو تو گرفت رسول کی نہیں تمھاری ہو گی۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) ➊ { وَعَدَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ … :} منافقین کی تمام تر زیادتیوں کے باوجود رسول اللہ صلی اللہ علیہ وسلم ان سے صَرفِ نظر فرماتے کہ لوگ یہ نہ کہیں کہ محمد صلی اللہ علیہ وسلم اپنے ہی ساتھیوں کو اور پناہ دینے والوں کو قتل کرتے ہیں۔ اب ایک طرف پورے عرب کے کفار کی دشمنی تھی، دوسری طرف اسلام کے دعوے دار منافقین کی سازشیں تھیں، نتیجتاً مسلمان سخت پریشان اور خوف زدہ رہتے تھے۔ اس مقام پر اللہ تعالیٰ نے منافقین کا طرزِ عمل بیان کرنے اور انھیں نصیحت کرنے کے بعد مخلص مومنوں کو کئی بشارتیں دیں۔ اُبیَ بن کعب رضی اللہ عنہ فرماتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم اور آپ کے ساتھی مدینہ میں آئے اور انصار نے انھیں جگہ دی تو سارا عرب ایک کمان کے ساتھ ان پر حملہ آور ہو گیا، اس لیے مسلمان رات اسلحہ کے ساتھ گزارتے اور دن بھی اسی حال میں گزارتے، حتیٰ کہ وہ یہ کہنے لگ گئے : ’’کیا تم خیال کرتے ہو کہ ہم اس وقت تک زندہ رہیں گے جب ہماری راتیں امن و اطمینان سے گزریں گی، ہمیں اللہ کے سوا کسی کا خوف نہیں ہو گا۔‘‘ تو اس پر یہ آیت نازل ہوئی : «{ وَعَدَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ وَ عَمِلُوا الصّٰلِحٰتِ لَيَسْتَخْلِفَنَّهُمْ فِي الْاَرْضِ كَمَا اسْتَخْلَفَ الَّذِيْنَ مِنْ قَبْلِهِمْ وَ لَيُمَكِّنَنَّ لَهُمْ دِيْنَهُمُ الَّذِي ارْتَضٰى لَهُمْ ووَ لَيُبَدِّلَنَّهُمْ مِّنْۢ بَعْدِ خَوْفِهِمْ اَمْنًا يَعْبُدُوْنَنِيْ لَا يُشْرِكُوْنَ بِيْ شَيْـًٔا وَ مَنْ كَفَرَ بَعْدَ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ}» [ النور : ۵۵ ] [مستدرک حاکم : 401/2، ح : ۳۵۱۲، قال الحاکم صحیح الإسناد وقال الذھبي صحیح ] اس حدیث میں یہ بھی ہے کہ {’’ وَ مَنْ كَفَرَ بَعْدَ ذٰلِكَ ‘‘} کا معنی ہے، جو اس کے بعد نعمت کی ناشکری کرے گا۔ مسلمانوں کی اس خوف کی حالت کا نقشہ سورۂ انفال (۲۶) میں بہترین صورت میں کھینچا گیا ہے۔ ¤ ➋ { وَعَدَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ …:} یعنی تم کھلے اور چھپے دشمن کفار و منافقین کی دشمنی سے پریشان نہ ہو، تم میں سے مخلص مومن جو اعمالِ صالحہ سے آراستہ ہیں، ان سے اللہ تعالیٰ کا وعدہ ہے کہ انھیں عرب و عجم کے کفار و مشرکین کی زمین کا وارث بنائے گا، وہ اس کے جانشین اور حکمران ہوں گے، جیسا کہ اس نے اس سے پہلے کفار و مشرکین کے بعد بنی اسماعیل اور بنی اسرائیل کو جزیرۂ عرب، مصر اور شام کی حکومت بخشی۔ اللہ تعالیٰ نے مومنوں سے کیا ہوا یہ وعدہ بہت تھوڑے عرصے میں پورا فرما دیا، ہجرت کے بعد دس سال کے اندر، جب کہ ابھی رسول اللہ صلی اللہ علیہ وسلم زندہ تھے، اللہ تعالیٰ نے آپ کو مکہ، خیبر، بحرین، یمن اور پورے جزیرۂ عرب پر فتح عطا فرما دی۔ آپ صلی اللہ علیہ وسلم ہجر کے مجوسیوں اور شام کے کئی علاقوں سے جزیہ وصول کرنے لگے، روم کے بادشاہ ہرقل، مصر کے بادشاہ مقوقس اور حبشہ کے بادشاہ نجاشی نے آپ کی خدمت میں ہدیے ارسال کیے۔ جب رسول اللہ صلی اللہ علیہ وسلم دنیا سے رخصت ہوئے تو خلفائے اسلام نے یہ ذمہ داری سنبھالی اور آپ صلی اللہ علیہ وسلم کے طریقے پر چل کر انھوں نے مشرق و مغرب کا بہت سا حصہ فتح کر لیا۔ اس وقت کے سب سے مضبوط حکمران کسریٰ کے تخت پر قبضہ کر لیا اور قیصر کو اس کے مملوکہ علاقوں شام وغیرہ سے ایسا نکالا کہ اسے قسطنطنیہ میں پناہ لینا پڑی۔ مشرق میں چین اور مغرب میں افریقہ تک اسلام کا پرچم لہرانے لگا۔ مسلمان ان کی گردنوں اور ان کے خزانوں کے مالک بن گئے اور رسول اللہ صلی اللہ علیہ وسلم کی یہ پیش گوئی پوری ہوئی : [ إِنَّ اللّٰهَ زَوٰی لِيَ الْأَرْضَ، فَرَأَيْتُ مَشَارِقَهَا وَ مَغَارِبَهَا، وَ إِنَّ أُمَّتِيْ سَيَبْلُغُ مُللْكُهَا مَا زُوِيَ لِيْ مِنْهَا، وَ أُعْطِيْتُ الْكَنْزَيْنِ الْأَحْمَرَ وَالْأَبْيَضَ ] [ مسلم، الفتن، باب ھلاک ھذہ الأمۃ بعضہم ببعض : ۲۸۸۹ ] ’’اللہ تعالیٰ نے میرے لیے زمین لپیٹ دی تو میں نے اس کے تمام مشرق اور مغرب دیکھ لیے اور میری امت کی سلطنت اس کے ان مقامات تک پہنچے گی جو مجھے لپیٹ کر دکھائے گئے اور مجھے سرخ اور سفید دو خزانے عطا کیے گئے۔‘‘ ¤ ➌ { وَ لَيُمَكِّنَنَّ لَهُمْ دِيْنَهُمُ الَّذِي ارْتَضٰى لَهُمْ:} یہ دوسرا وعدہ ہے کہ اللہ تعالیٰ مسلمانوں کے لیے ان کے اس دین کو اقتدار بخشے گا جو اس نے ان کے لیے پسند فرمایا ہے، یعنی مسلمانوں کو ایسا اقتدار ملے گا جس میں کسی اور آئین و قانون کا نہیں بلکہ اللہ کے دین اسلام کا مکمل غلبہ ہو گا، اس میں اللہ کی بات سب سے اونچی اور اس کا بول سب سے بالا ہو گا۔ دین کا یہ اقتدار پوری دنیا پر ہو گا۔ تمیم داری رضی اللہ عنہ فرماتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : [ لَيَبْلُغَنَّ هٰذَا الْأَمْرُ مَا بَلَغَ اللَّيْلُ وَالنَّهَارُ وَلاَ يَتْرُكُ اللّٰهُ بَيْتَ مَدَرٍ وَلَا وَبَرٍ إِلَّا أَدْخَلَهُ اللّٰهُ هٰذَا الدِّيْنَ بِعِزِّ عَزِيْزٍ أَوْ بِذُلِّ ذَلِيْلٍ، عِزًّا يَعِزُّ اللّٰهُ  بِهِ الْإِسْلَامَ، وَ ذُلًّا يُذِلُّ اللّٰهُ بِهِ الْكُفْرَ ] [ مسند أحمد : 103/4، ح : ۱۶۹۵۹، قال محقق المسند إسنادہ صحیح علی شرط مسلم ] ’’یہ کام یعنی دین اسلام وہاں تک پہنچے گا جہاں رات اور دن پہنچتے ہیں اور اللہ تعالیٰ کوئی اینٹوں کا بنا ہوا مکان چھوڑے گا اور نہ ریشم کا بنا ہوا، مگر اللہ تعالیٰ اس میں اس دین کو داخل کر دے گا، عزت والے کو عزت دے کر اور ذلیل کو ذلت دے کر۔ عزت ایسی جس کے ساتھ اللہ تعالیٰ اسلام کو عزت بخشے گا اور ذلت ایسی جس کے ساتھ اللہ تعالیٰ کفر کو ذلیل کرے گا۔‘‘ اس پیش گوئی کا اکثر حصہ خلفائے راشدین، خلفائے بنی امیہ اور عثمانی خلفاء کے ہاتھوں پورا ہوا اور جو رہ گیا ہے وہ بھی پورا ہو کر رہے گا، مسلمانوں میں دین کی طرف رجوع اور جذبہ جہاد کی بیداری آنے والی صبح روشن کی نوید ہیں۔ ¤ ➍ {وَ لَيُبَدِّلَنَّهُمْ مِّنْۢ بَعْدِ خَوْفِهِمْ اَمْنًا :} یہ تیسرا وعدہ ہے کہ اللہ تعالیٰ مسلمانوں کو خوف کی حالت بدل کر امن عطا فرمائے گا۔ جہاد کی بدولت کفار یا تو اسلام قبول کرکے اس کے محافظ بن جائیں گے، یا محکوم ہو کر جزیہ دیں گے۔ اللہ کے احکام پر عمل کی بدولت خوش حالی کا دور دورہ ہو گا اور حدود اللہ کے نفاذ کی برکت سے اسلام کے زیر نگیں تمام علاقے امن کی نعمت سے فیض یاب ہوں گے۔ عدی بن حاتم طائی رضی اللہ عنہ بیان کرتے ہیں : ’’میں نبی صلی اللہ علیہ وسلم کے پاس موجود تھا جب آپ کے پاس ایک آدمی آیا اور اس نے آپ سے فاقے کی شکایت کی، پھر ایک اور آیا اور اس نے ڈاکے اور راہ زنی کی شکایت کی۔ آپ صلی اللہ علیہ وسلم نے مجھے مخاطب ہو کر فرمایا : ’’عدی! تم نے حیرہ (شہر) دیکھا ہے؟‘‘ میں نے کہا : ’’میں نے اسے نہیں دیکھا، لیکن میں نے اس کے متعلق سنا ہے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اگر تمھاری زندگی لمبی ہوئی تو تم اونٹنی پر سوار ایک عورت کو دیکھو گے، وہ حیرہ سے سفر کرے گی، حتیٰ کہ کعبہ کا طواف کرے گی، اللہ کے سوا اسے کسی کا خوف نہیں ہو گا۔‘‘ میں نے دل ہی دل میں کہا، تو بنو طے کے وہ بدمعاش کہاں جائیں گے جنھوں نے شہروں میں آگ لگا رکھی ہے؟ (آپ نے مزید فرمایا :) ’’اور اگر تمھاری زندگی لمبی ہوئی تو تم کسریٰ کے خزانے فتح کرو گے۔‘‘ میں نے کہا : ’’کسریٰ بن ہرمز کے خزانے؟‘‘ آپ نے فرمایا : ’’ہاں، کسریٰ بن ہرمز کے خزانے، اور اگر تمھاری زندگی لمبی ہوئی تو تم آدمی کو دیکھو گے، وہ سونے یا چاندی سے اپنی لپ بھر کر اس شخص کی تلاش میں نکلے گا جو اس سے اسے قبول کرے، مگر اسے کوئی شخص نہیں ملے گا جو اس سے قبول کرے…۔‘‘ عدی رضی اللہ عنہ کہتے ہیں : ’’پھر میں نے اونٹنی پر سوار ایک عورت کو دیکھا جو حیرہ سے سفر شروع کرتی تھی، حتیٰ کہ کعبہ کا طواف کرتی تھی اور میں ان لوگوں میں شامل تھا جنھوں نے کسریٰ بن ہرمز کے خزانے فتح کیے اور اگر تمھاری زندگی لمبی ہوئی تو تم وہ بھی دیکھ لو گے جو نبی ابو القاسم صلی اللہ علیہ وسلم نے فرمایا : ’’آدمی سونے چاندی سے لپ بھر کر صدقہ نکالے گا۔‘‘ [ بخاري، المناقب، باب علامات النبوۃ في الإسلام : ۳۵۹۵ ] ¤ ➎ { يَعْبُدُوْنَنِيْ۠ لَا يُشْرِكُوْنَ بِيْ شَيْـًٔا :} یعنی وہ لوگ جن کے ساتھ خلافتِ ارضی، دین کے غلبے اور خوف کے بعد امن عطا کرنے کا وعدہ ہے، وہ ایسے لوگ ہیں جو ایمان اور عمل صالح سے آراستہ ہوں گے، صرف اللہ کی عبادت کریں گے، اس کے ساتھ کسی چیز کو شریک نہیں کریں گے۔ ظاہر ہے کہ جن لوگوں میں ان اوصاف میں سے کسی وصف کی کمی ہو گی یا سرے سے ان سے عاری ہوں گے انھیں حکومت مل بھی جائے تو دین کے غلبے اور امن کی نعمت میسر نہ ہو گی۔ ¤ ➏ یہ آیت خلفائے راشدین کی خلافت کے برحق ہونے کی بہت بڑی اور واضح دلیل ہے، کیونکہ اس آیت میں اگرچہ خلافت، تمکینِ دین اور خوف کے بعد امن کا وعدہ ان تمام لوگوں سے ہے جو ایمان اور عمل صالح پر کاربند ہوں، خواہ کسی زمانے میں ہوں، مگر اس کے سب سے پہلے مخاطب چونکہ صحابہ کرام رضی اللہ عنھم تھے اور اللہ تعالیٰ نے انھی کو مخاطب کرتے ہوئے فرمایا : «{ وَعَدَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ وَ عَمِلُوا الصّٰلِحٰتِ }» کہ اللہ تعالیٰ نے ان لوگوں سے وعدہ کیا جو ’’تم میں سے ایمان لائے اور انھوں نے نیک اعمال کیے۔‘‘ اس لیے اس آیت کے سب سے پہلے مصداق بھی وہی ہیں اور کوئی شخص اس سے انکار نہیں کر سکتا کہ ابوبکر، عمر، عثمان اور علی رضی اللہ عنھم کو اللہ تعالیٰ نے زمین میں خلافت بخشی، ان کے زمانے میں دین غالب ہوا، اللہ کی حدود قائم ہوئیں، مسلمانوں کو امن میسر رہا اور تمام دنیا کے کافر مرعوب و مقہور رہے۔ ان کے بعد بھی جن خلفاء نے جہاد جاری رکھا، اللہ کی حدود پر عمل کیا اور کسی بھی قسم کے شرک سے آلودہ نہیں ہوئے، وہ بھی اس کے مصداق ہیں اور ان کے زمانے میں بھی دین غالب رہا اور مسلمانوں کو امن کی نعمت میسر رہی۔ آئندہ جو لوگ ان اوصاف سے آراستہ ہوں گے اللہ تعالیٰ ان کے ساتھ بھی یہ وعدہ پورا فرمائے گا۔ جو لوگ کہتے ہیں کہ خلافت صرف تیس (۳۰) برس قائم رہی ان کی بات اس حد تک تو درست ہے کہ اعلیٰ درجے کے اوصاف والے لوگ یہی خلفاء تھے، کیونکہ وہ براہِ راست نبی کریم صلی اللہ علیہ وسلم کے تربیت یافتہ تھے اور انھیں ایمان میں سبقت اور ہجرت کا شرف بھی حاصل تھا، ان کے بعد والوں کو یہ سارے فضائل حاصل نہ تھے، اس لیے ان کی خلافت اس بلند ترین درجے کی نہ تھی، مگر یہ بات غلط ہے کہ اس کے بعد امتِ مسلمہ اللہ کے اس وعدے سے محروم ہو گئی۔ خود رسول اللہ صلی اللہ علیہ وسلم نے ان تیس (۳۰) سالوں کے بعد بھی ایسے خلفاء کی پیش گوئی فرمائی ہے جن کے زمانے میں دین غالب ہو گا۔ چنانچہ جابر بن سمرہ رضی اللہ عنہ فرماتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا، میرے ساتھ میرے والد بھی تھے، میں نے آپ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : [ لَا يَزَالُ هٰذَا الدِّيْنُ عَزِيْزًا مَنِيْعًا إِلَي اثْنَيْ عَشَرَ خَلِيْفَةً ] ’’یہ دین بارہ خلیفوں تک خوب غالب اور محفوظ رہے گا۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے ایک بات کی جو لوگوں نے مجھے سننے نہیں دی، میں نے اپنے والد سے پوچھا کہ آپ صلی اللہ علیہ وسلم نے کیا فرمایا ہے؟ تو انھوں نے بتایا : [كُلُّهُمْ مِنْ قُ قُرَيْشٍ ] ’’وہ سب قریش سے ہوں گے۔‘‘ [ مسلم، الإمارۃ، باب الناس تبع لقریش : 1821/9 ] ابو داؤد کی روایت (۴۲۷۹) میں یہ الفاظ بھی ہیں : [ كُلُّهُمْ تَجْتَمِعُ عَلَيْهِ الْأُمَّةُ ] ’’ان سب پر امت مجتمع ہو گی۔‘‘ علامہ البانی رحمہ اللہ نے ان الفاظ کو ضعیف کہا ہے۔ ¤ ان بارہ خلفاء سے مسلسل خلفاء مراد ہیں، یا درمیان میں کچھ وقفے سے آنے والے خلفاء مراد ہیں، یہ بات اللہ تعالیٰ ہی بہتر جانتا ہے، مگر اس میں شک نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے امت مسلمہ میں نااہل لوگوں کے بعد پھر نبوی طریقے پر خلافت قائم ہونے کی پیش گوئی فرمائی ہے، حتیٰ کہ آخر زمانے میں مہدی خلیفہ راشد ہوں گے۔ حذیفہ رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ تَكُوْنُ النُّبُوَّةُ فِيْكُمْ مَا شَاءَ اللّٰهُ أَنْ تَكُوْنَ، ثُمَّ يَرْفَعُهَا إِذَا شَاءَ أءَ أَنْ يَّرْفَعَهَا، ثُمَّ تَكُوْنُ خِلَافَةً عَلٰی مِنْهَاجِ النُّبُوَّةِ فَتَكُوْنُ مَا شَاءَ اللّٰهُ أَنْ تَكُوْنَ، ثُمَّ يَرْفَعُهَا إِذَا شَاءَ اللّٰهُ أَنْ يَّرْفَعَهَهَا، ثُمَّ تَكُوْنُ مُلْكًا عَاضًّا فَيَكُوْنُ مَا شَاءَ اللّٰهُ أَنْ يَّكُوْنَ، ثُمَّ يَرْفَعُهَا إِذَا شَاءَ أَنْ يَّرْفَعَهَا، ثُمَّ تَكُوْنُ مُلْكًا جَبْرِيَّةً فَتَكُوْنُ مَا شَاءَ اللّٰهُ أَنْ تَكُوْنَ ثُمَّ يَرْفَعُهَا إِذَا شَاءَ أَنْ يَّرْفَعَهَا، ثُمَّ تَكُوْنُ خِلَافَةً عَلٰی مِنْهَاجِ النُّبُوَّةِ، ثُمَّ سَكَتَ] [مسند أحمد : 273/4، ح : ۱۸۴۳۶، مسند احمد کے محقق اور شیخ البانی نے صحیحہ (۵) میں اسے حسن کہا ہے] ’’تم میں نبوت رہے گی جب تک اللہ نے چاہا کہ رہے، پھر جب وہ اسے اٹھانا چاہے گا اٹھا لے گا، پھر نبوت کے طریقے پر خلافت ہو گی اور اس وقت تک رہے گی جب تک اللہ چاہے گا کہ رہے، پھر اللہ اسے اٹھا لے گا جب چاہے گا کہ اسے اٹھا لے پھر ’’ملک عاض‘‘ (دانتوں سے کاٹنے والی بادشاہی) ہو گی اور جب تک اللہ چاہے گا کہ رہے، وہ رہے گی، پھر جب اللہ تعالیٰ اسے اٹھانا چاہے گا، تو اٹھا لے گا، پھر جبر والی بادشاہی ہو گی اور جب تک اللہ چاہے گا کہ رہے، وہ رہے گی، پھر جب وہ چاہے گا کہ اسے اٹھائے تو اٹھا لے گا، پھر نبوت کے طریقے پر خلافت ہو گی۔‘‘ پھر آپ صلی اللہ علیہ وسلم خاموش ہو گئے۔‘‘ ¤ اس آیت اور ان احادیث کی روشنی میں مسلمانوں کو ہمیشہ پُر امید رہنا چاہیے کہ جب بھی مسلمان ایمان اور عمل صالح پر کاربند ہو گئے، اللہ کے ساتھ شرک سے تائب ہو گئے، اپنی روزمرہ کی زندگی، اپنی معیشت، اپنی سیاست، غرض ہر چیز میں غیر اللہ کے حکم سے مکمل منہ موڑ کر ایک اللہ کے حکم پر چلنے لگے اور اس کے مطابق فیصلے کرنے لگے، اللہ کے سوا ہر حاجت روا اور م مشکل کشا کو چھوڑ کر ایک اللہ سے استغاثہ و استعانت کرنے لگے، بزدلی اور دنیا سے محبت کے بجائے شوقِ شہادت سے سرشار ہو کر جہاد کرنے لگے، تو اللہ تعالیٰ انھیں ضرور خلافت علی منہاج النبوۃ کی نعمت عطا فرمائے گا، کیونکہ اسے ایمان اور عمل صالح سے مزین ایسے بندے مطلوب ہیں جو {’’ يَعْبُدُوْنَنِيْ۠ لَا يُشْرِكُوْنَ بِيْ شَيْـًٔا ‘‘} کی عملی تصویر ہوں، یعنی صرف اس کی عبادت کریں، اس کے ساتھ کسی کو شریک نہ ٹھہرائیں۔ البتہ یہ حقیقت بھی پیش نظر رکھنا ضروری ہے کہ جب تک مسلمانوں کی موجودہ حالت نہیں بدلتی کہ ان کی عدالتوں میں کفار کا قانون رائج ہے، ان کی تجارت سود پر مبنی ہے، ان کی حکومت کا طریقہ کفار سے لیا ہوا ہے، ان کے معاشرے میں ہندوؤں اور یہود و نصاریٰ کی رسوم جاری ہیں، ان کی مساجد کے اندر پختہ قبروں کی پرستش ہو رہی ہے، ایک اللہ کو حاجت روا اور مشکل کُشا ماننے کے بجائے ہر ایک نے اپنا الگ داتا و دستگیر بنا رکھا ہے، وہ ایک امت بننے کے بجائے مختلف فرقوں میں بٹے ہوئے ہیں۔ موجودہ حالت کے بدلنے تک اس خلافت کی نعمت کا حصول ایک خوبصورت خواب کے سوا کچھ نہیں جس کا اس آیت میں ذکر ہے ۔ ¤ ➐ کچھ لوگوں نے چار صحابہ کے سوا تمام صحابہ کرام رضی اللہ عنھم کو کافر کہنا اپنے دین کا جز بنا لیا ہے کوئی ان سے پوچھے کہ اس آیت میں اللہ تعالیٰ نے ایمان اور عمل صالح والوں سے خلافت عطا کرنے کا جو وعدہ فرمایا ہے وہ کس طرح اور کن لوگوں کے ذریعے سے پورا ہوا؟ اگر وہ اپنے بارہ (۱۲) خود ساختہ اماموں کو حقیقی خلفاء بتائیں تو بتائیں علی اور حسن رضی اللہ عنھما کو چھوڑ کر دوسرے دس (۱۰) خلفاء و ائمہ کی حکومت زمین کے کس خطے پر تھی، ان میں سے کس نے امن کے ساتھ حکومت کی؟ ان ائمہ کی حالت تو یہ تھی کہ یہ حضرات خود بتاتے ہیں کہ ان کا بارھواں امام دشمنوں کے خوف سے ایک غار میں چھپ گیا اور آج تک نمودار نہیں ہوا۔ پھر اللہ کا وعدہ کن لوگوں کے ذریعے سے پورا ہوا؟ ان لوگوں کے باطل پر ہونے کے لیے یہ بات بھی ایک واضح اور فیصلہ کن دلیل ہے کہ اسلام کے مرکز مکہ اور مدینہ میں ان ساڑھے چودہ سو سالوںمیں حکومت کرنے والے صحابہ کرام رضی اللہ عنھم تھے، یا پھر ان سے محبت کرنے والے۔ آج تک اللہ تعالیٰ نے اس پاک سرزمین میں صحابہ کے دشمنوں کے ناپاک قدم جمنے نہیں دیے۔ ¤ ➑ { وَ مَنْ كَفَرَ بَعْدَ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ:} فاسق کے کئی درجے ہیں، کامل فاسق وہی ہے جو ایمان ہی سے نکل جائے۔ آیت کا مطلب یہ ہوا کہ اس خلافت کے بعد جو لوگ کفر کریں اور کفر ہی پر مریں تو یہی لوگ پورے نافرمان ہیں۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’جو کوئی خلفائے اربعہ کی خلافت (اور ان کے فضل و شرف) سے منکر ہوا ان الفاظ سے اس کا حال سمجھا گیا۔‘‘"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) {وَ اَقِيْمُوا الصَّلٰوةَ وَ اٰتُوا الزَّكٰوةَ …:} اس کا عطف {’’ يَعْبُدُوْنَنِيْ لَا يُشْرِكُوْنَ بِيْ شَيْـًٔا ‘‘} پر ہے، کیونکہ وہ اگرچہ لفظوں میں خبر ہے مگر معنی کے لحاظ سے امر ہے۔ گویا یہ کہا جا رہا ہے : {’’ اُعْبُدُوْنِيْ وَلَا تُشْرِكُوْا بِيْ شَيْئًا وَأَقِيْمُوا الصَّلاَةَ وَ آتُوا الزَّكَاةَ… ‘‘} خبر کے امر کے معنی میں ہونے کی ایک مثال یہ آیت ہے : { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا هَلْ اَدُلُّكُمْ عَلٰى تِجَارَةٍ تُنْجِيْكُمْ مِّنْ عَذَابٍ اَلِيْمٍ (10) تُؤْمِنُوْنَ بِاللّٰهِ وَ رَسُوْلِهٖ }آگے فرمایا: «{ يَغْفِرْ لَكُمْ ذُنُوْبَكُمْ }» [ الصف : ۱۰ تا ۱۲ ] اس میں {’’ يَغْفِرْ ‘‘} پر جزم اس لیے ہے کہ یہ امر کا جواب ہے، جو {’’ تُؤْمِنُوْنَ بِاللّٰهِ وَ رَسُوْلِهٖ ‘‘} خبر کی صورت میں ہے۔ (ابن عاشور) اس آیت میں اللہ تعالیٰ نے خلافتِ ارضی کے حصول اور اللہ تعالیٰ کی رحمت کے حق دار بننے کا طریقہ بیان فرمایا ہے کہ ایک اللہ کی عبادت کرو، اس کے ساتھ کسی کو شریک نہ ٹھہراؤ (یہ بات {’’ يَعْبُدُوْنَنِيْ۠ لَا يُشْرِكُوْنَ بِيْ شَيْـًٔا ‘‘} واؤ پر عطف سے ظاہر ہے) اور نماز قائم کرو، زکوٰۃ ادا کرو اور رسول کی فرماں برداری کرو، تاکہ تم پر رحم کیا جائے۔ یہ نہایت جامع آیت ہے، دین کی کوئی بات باقی نہیں رہی جو اس آیت میں نہ آتی ہو۔ اللہ کی توحید کے بعد نماز اور زکوٰۃ کا خاص ذکر کرکے رسول کا ہر حکم ماننے کا حکم دیا۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) { لَا تَحْسَبَنَّ الَّذِيْنَ كَفَرُوْا مُعْجِزِيْنَ فِي الْاَرْضِ …:} مشرکین عام طور پر ہمیشہ تعداد اور قوت میں زیادہ رہے ہیں، رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں بھی یہی حال تھا کہ مسلمان کمزور تھے، ان سے خوف زدہ رہتے تھے، تو ایسے حالات میں ان کے لیے خلافت کا وعدہ عجیب اور ناممکن سی بات نظر آتا تھا۔ اس لیے فرمایا کہ کافروں کے متعلق یہ گمان ہر گز نہ کریں کہ وہ اللہ کو مقابلے میں عاجز کر دیں گے، یہ لوگ جتنی تعداد اور قوت میں ہوں، جتنی چال بازیاں اور فوجیں اکٹھی کر لیں، مقابلہ ان کا اللہ تعالیٰ سے ہے اور اللہ تعالیٰ کو یہ لوگ کسی صورت مقابلے میں عاجز نہیں کر سکتے۔ کعب رضی اللہ عنہ کا شعر ہے: ¤ {هَمَّتْ سَخِيْنَةُ أَنْ تُغَالِبَ رَبَّهَا ¤ فَلَيُغْلَبَنَّ مُغَالِبُ الْغَلَّابِ} ¤ ’’سخینہ (قریش) نے ارادہ کیا کہ اپنے رب سے مقابلے میں غالب آئیں، مگر اس زبردست غالب کا مقابلہ کرنے والا تو ہر صورت مغلوب ہی ہو گا۔ ‘‘ [ مستدرک حاکم : ۳؍۴۸۸، ح : ۶۰۶۵ حاکم، ذہبی اور البانی نے اسے صحیح کہا ہے] یہ حال تو دنیا میں ہو گا اور آخری مقام ان کا جہنم ہے اور وہ لوٹ کر جانے کے لیے بہت بری جگہ ہے۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لِيَسْتَاْذِنْكُمُ الَّذِيْنَ مَلَكَتْ اَيْمَانُكُمْ … :} یہاں سے پھر انھی احکام کی تکمیل کا سلسلہ شروع ہوتا ہے جو آیت (۳۴) تک بیان ہو رہے تھے۔ اس آیت میں ان لوگوں کا ذکر فرمایا جنھیں گھر میں داخلے کے لیے اجازت کی ضرورت نہیں اور یہ بھی کہ تین اوقات میں انھیں بھی اجازت لینا ضروری ہے۔ یہ دو قسم کے لوگ ہیں، آدمی کے لونڈی و غلام اور نابالغ بچے۔ انھیں داخلے کے لیے اجازت کی ضرورت نہیں، کیونکہ گھروں میں ان کا آنا جانا کثرت سے ہوتا ہے اور ان پر اجازت کی پابندی لگانے سے دشواری اور تنگی پیدا ہوتی ہے۔ {’’ طَوّٰفُوْنَ عَلَيْكُمْ ‘‘} میں یہی حکمت بیان ہوئی ہے۔ اس سے یہ بھی معلوم ہوا کہ اللہ تعالیٰ نے اپنے احکام میں انسانوں کی آسانی کو مدنظر رکھا ہے اور اس کے ہر حکم میں حکمت ہے، خواہ ہمیں معلوم ہو سکے یا نہ ہو سکے۔ ¤ ➋ {’’ ثَلٰثَ مَرّٰتٍ ‘‘} سے مراد تین اوقات ہیں، یعنی ان تین اوقات میں اجازت مانگیں، جن کا ذکر آگے فرمایا ہے، یعنی نمازِ فجر سے پہلے، دوپہر کو آرام کے وقت جب عموماً آرام کے لیے کپڑے اتار دیے جاتے ہیں اور عشاء کی نماز کے بعد۔ یہ تینوں وقت پردے کے اوقات ہیں، ان اوقات میں آدمی ایسی حالت میں بھی ہوتا ہے کہ جس پر کسی کا بھی مطلع ہونا درست نہیں۔ {’’ ثَلٰثَ مَرّٰتٍ ‘‘} کی ایک تفسیر یہ ہے کہ غلام اور بچے بھی ان تین اوقات میں تین دفعہ اجازت مانگیں، اجازت مل جائے تو اندر آ جائیں ورنہ واپس چلے جائیں۔ (بقاعی) اس تفسیر میں {’’ ثَلٰثَ مَرّٰتٍ ‘‘} کے لفظ سے محض گنتی بتانے کے بجائے ایک مستقل حکم معلوم ہوتا ہے، جو رسول اللہ صلی اللہ علیہ وسلم نے سب لوگوں کے لیے تمام اوقات میں اپنے گھر کے سوا دوسرے گھروں میں جانے کے متعلق بیان فرمایا کہ اجازت مانگنا تین دفعہ ہے، اگر مل جائے تو بہتر ورنہ واپس ہو جانا چاہیے۔ [ دیکھیے بخاري : ۶۲۴۵۔ أبوداوٗد : ۵۱۸۰ ] اس آیت میں ان تین اوقات میں غلاموں اور بچوں کو بھی تین دفعہ اجازت مانگنے کا پابند فرمایا۔ ¤ ➌ { لَيْسَ عَلَيْكُمْ وَ لَا عَلَيْهِمْ جُنَاحٌۢ بَعْدَهُنَّ :} یعنی ان تین اوقات کے سوا غلام اور بچے بلااجازت آ جا سکتے ہیں۔ اس وقت اگر کوئی ایسی حالت میں ہے جو مناسب نہیں تو غلاموں اور بچوں کا قصور نہیں، خود اس کی نالائقی ہے۔ ¤ ➍ {كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَكُمُ الْاٰيٰتِ وَ اللّٰهُ عَلِيْمٌ حَكِيْمٌ :} آیات کو کھول کر وہی بیان کر سکتا ہے جس کا علم کامل ہو اور حکمت بھی کامل ہو، کوئی دوسرا جتنی وضاحت بھی کرلے اپنے علم و حکمت کی نارسائی کی وجہ سے اس کی بات پوری ہی نہیں ہو گی، پوری طرح واضح ہونا تو دور کی بات ہے۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) { وَ اِذَا بَلَغَ الْاَطْفَالُ مِنْكُمُ الْحُلُمَ فَلْيَسْتَاْذِنُوْا …:} بالغ ہونے کے بعد بچوں کو بھی اجازت لینا ضروری ہے، جس طرح ان لوگوں کے لیے ضروری ہے جن کا ذکر اس سے پہلے آیت (۲۷) {’’ لَا تَدْخُلُوْا بُيُوْتًا غَيْرَ بُيُوْتِكُمْ حَتّٰى تَسْتَاْنِسُوْا ‘‘} میں آیا ہے اور جس طرح بالغ ہونے والے ان بچوں سے پہلے دوسرے بالغ لوگ اجازت لیتے چلے آئے ہیں، بالغ ہونے کے بعد انھیں بھی ہر حال میں اجازت لے کر آنا ہو گا۔ عطاء بن یسار کہتے ہیں کہ میں نے ابن عباس رضی اللہ عنھما سے پوچھا : ’’کیا میں اپنی بہن کے پاس جانے کے لیے بھی اجازت مانگوں؟‘‘ فرمایا : ’’ہاں!‘‘ میں نے پھر سوال دہرایا : ’’میری پرورش میں میری دو بہنیں ہیں، ان کا خرچہ میرے ذمے ہے، ان کے پاس بھی اجازت لے کر جاؤں؟‘‘ فرمایا : ’’ہاں! کیا تم پسند کرتے ہو کہ انھیں برہنہ حالت میں دیکھو۔‘‘ پھر یہ آیت پڑھی : «{ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لِيَسْتَاْذِنْكُممُ الَّذِيْنَ مَلَكَتْ اَيْمَانُكُمْ }» [ النور : ۵۸ ] {’’ثَلٰثُ عَوْرٰتٍ لَّكُمْ ‘‘} تک، تو ان لوگوں کو صرف ان تین اوقات میں اجازت مانگنے کا حکم دیا گیا، پھر فرمایا : «{ وَ اِذَا بَلَغَ الْاَطْفَالُ مِنْكُمُ الْحُلُمَ فَلْيَسْتَاْذِنُوْا }» [ النور : ۵۹ ] ابن عباس رضی اللہ عنھما نے فرمایا : ’’اب اجازت لینا واجب ہے۔‘‘ [ الأدب المفرد للبخاري : ۱۰۶۳ ]"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) ➊ { وَ الْقَوَاعِدُ مِنَ النِّسَآءِ الّٰتِيْ لَا يَرْجُوْنَ نِكَاحًا …:} بچوں کو بالغ ہونے کے بعد اجازت طلب کرنے کی پابندی کے ذکر کے بعد عورتوں کے سن یاس کو پہنچنے کے بعد ان کے لیے پردے کی پابندی میں تخفیف کا حکم بیان فرمایا۔ {’’ الْقَوَاعِدُ ‘‘ ’’ قَاعِدٌ‘‘} کی جمع ہے، جو مذکر کا صیغہ ہونے کے باوجود عورتوں کے لیے استعمال ہوتا ہے، جیسا کہ {’’حَائِضٌ‘‘} اور {’’حَامِلٌ‘‘} ہے، یعنی وہ عورتیں جو بڑی عمر کو پہنچ جائیں، انھیں نکاح کی رغبت نہ رہے، نہ دوسروں کو ان سے نکاح کی دلچسپی رہے، ان کے لیے رعایت ہے کہ وہ غیر محرم مردوں سے پردہ نہ کریں تو ان پر گناہ نہیں، بشرطیکہ وہ اپنی زینت کا اظہار کرنے والی نہ ہوںـ۔ اس سے معلوم ہوا کہ وہ عورتیں جن کے حسن و جمال میں مردوں کے لیے کشش باقی ہو، انھیں پردہ اتارنا جائز نہیں۔ ¤ طبری نے معتبر سند کے ساتھ علی بن ابی طلحہ کا قول نقل فرمایا ہے : ’’آیت {’’ وَ الْقَوَاعِدُ مِنَ النِّسَآءِ الّٰتِيْ لَا يَرْجُوْنَ نِكَاحًا ‘‘} کا مطلب یہ ہے کہ ایسی عورت پر گناہ نہیں کہ گھر میں قمیص اور دوپٹے کے ساتھ رہے اور بڑی چادر اتار دے، جب تک وہ زینت ظاہر نہ کرے، جسے ظاہر کرنا اللہ تعالیٰ کو ناپسند ہے۔‘‘ (طبری : ۲۶۴۰۹) شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یعنی بوڑھی عورتیں گھر میں تھوڑے کپڑوں میں رہیں تو درست ہے اور پورا پردہ رکھیں تو اور بہتر ہے۔‘‘ گھر سے باہر بھی اگر وہ برقع یا بڑی چادر نہ لیں تو حرج نہیں، بشرطیکہ وہ کسی قسم کی زینت کا اظہار نہ کر رہی ہوں۔ {’’ بِزِيْنَةٍ ‘‘} میں تنوین سے ظاہر ہے کہ بوڑھی عورت کے لیے غیر محرموں کے سامنے کسی بھی طرح کی زینت کا اظہار جائز نہیں۔ ¤ ➋ مرد جس عمر کو بھی پہنچ جائے اور جتنا بوڑھا بھی ہو جائے اگر غیر محرم ہے تو عورت کو اس سے پردہ کرنا لازم ہے، بعض عورتوں کا بوڑھوں سے پردہ اتار دینا درست نہیں۔ قرآن و حدیث میں کہیں بھی اس سے پردہ نہ کرنے کی اجازت نہیں آئی۔ ¤ ➌ { وَ اللّٰهُ سَمِيْعٌ عَلِيْمٌ :} یعنی اجازت طلب کرنے اور پردہ کرنے کے یہ احکام فتنے کی روک تھام کے ظاہری اسباب ہیں، باقی پردے کے اندر جو کچھ ہوتا ہے اور جو فتنے اٹھائے جاتے ہیں اللہ تعالیٰ ان سب کو سنتا اور جانتا ہے اور وہ اسی کے موافق ہر ایک سے معاملہ فرمائے گا۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) ➊ {لَيْسَ عَلَى الْاَعْمٰى حَرَجٌ وَّ لَا عَلَى الْاَعْرَجِ حَرَجٌ …:} بعض مفسرین نے فرمایا، اس آیت کے دو حصے ہیں، ایک شروع سے {’’ وَ لَا عَلَى الْمَرِيْضِ حَرَجٌ ‘‘} تک اور دوسرا {’’ وَ لَا عَلٰۤى اَنْفُسِكُمْ ‘‘} سے آخر تک۔ پہلے حصے کا تعلق جہاد سے ہے کہ اندھے، لنگڑے اور بیمار اگر جہاد میں نہ جا سکیں تو ان پر کوئی گناہ نہیں، کیونکہ وہ معذور ہیں۔ سورۂ فتح کی آیت (۱۷) میں بعینہٖ یہی الفاظ : «{ لَيْسَ عَلَى الْاَعْمٰى حَرَجٌ وَّ لَا عَلَى الْاَعْرَجِ حَرَجٌ وَّ لَا عَلَى الْمَرِيْضِ حَرَجٌ }» اسی مفہوم کے لیے آئے ہیں اور سورۂ توبہ کی آیت (۹۱) : «{ لَيْسَ عَلَى الضُّعَفَآءِ وَ لَا عَلَى الْمَرْضٰى }» میں بھی یہی بات بیان ہوئی ہے۔ بعض مفسرین نے فرمایا کہ عرب لوگ اندھے، لنگڑے اور مریض کے ساتھ کھانے سے کراہت محسوس کرتے تھے، اس پر فرمایا کہ ان کے ساتھ کھانے میں کوئی حرج نہیں۔ مگر یہ بات درست نہیں، کیونکہ یہاں یہ نہیں فرمایا کہ تم پر کوئی حرج نہیں کہ اندھے، لنگڑے یا مریض کے ساتھ مل کر کھاؤ، بلکہ یہ فرمایا ہے کہ اندھے پر کوئی حرج نہیں، نہ لنگڑے پر کوئی حرج ہے اور نہ مریض پر کوئی حرج ہے۔ ¤ تیسری تفسیر جو اس مقام سے زیادہ مناسبت رکھتی ہے، یہ ہے کہ یہاں {’’ لَيْسَ عَلَى الْاَعْمٰى ‘‘} سے آیت کے آخر تک ایک ہی مسئلہ بیان ہوا ہے۔ طبری نے اپنی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما سے بیان کیا ہے کہ جب اللہ تعالیٰ نے یہ آیت نازل فرمائی : «{ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَاْكُلُوْۤا اَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ }» [ النساء : ۲۹ ] ’’اے لوگو جو ایمان لائے ہو ! اپنے مال آپس میں باطل طریقے سے نہ کھاؤ۔‘‘ تو مسلمانوں نے کہا کہ اللہ تعالیٰ نے ہمیں آپس میں اپنے اموال باطل طریقے سے کھانے سے منع فرمایا ہے اور کھانا ہمارے ان اموال میں سے ہے جو سب سے بہتر ہیں، اس لیے ہم میں سے کسی کو حلال نہیں کہ کسی کے ہاں کھانا کھائے، تو لوگوں نے ایک دوسرے کے ہاں کھانا چھوڑ دیا، اس پر یہ آیت اتری : «{ لَيْسَ عَلَى الْاَعْمٰى حَرَجٌ … اَوْ مَا مَلَكْتُمْ مَّفَاتِحَهٗۤ }» (طبری : ۲۶۴۲۶) اس تفسیر کے مطابق اندھے، لنگڑے اور بیمار کو اجازت دی گئی ہے کہ معذور ہونے کی وجہ سے ان کا لوگوں پر حق ہے کہ وہ بھوک مٹانے کے لیے ہر جگہ اور ہر گھر سے کھا سکتے ہیں، انھیں خواہ مخواہ کی عزتِ نفس کے یا حرام سے اجتناب کے خیال میں مبتلا ہو کر کسی دوسرے کے کھانے سے گریز نہیں کرنا چاہیے۔ مجاہد نے آیت زیر تفسیر کے متعلق فرمایا : ’’آدمی کسی اندھے یا لنگڑے یا بیمار کو لے کر اپنے باپ یا بھائی یا بہن یا پھوپھی یا خالہ کے گھر (کچھ کھلانے کے لیے) لے جاتا تو وہ معذور لوگ اس میں گناہ محسوس کرتے کہ یہ لوگ ہمیں دوسروں کے گھروں میں لے جاتے ہیں۔ اس پر یہ آیت ان کے لیے رخصت بیان کرنے کے لیے اتری۔‘‘ [ مسند عبد الرزاق و سندہ صحیح ] ¤ اس کے بعد عام لوگوں کا ذکر فرمایا کہ وہ اپنے گھروں سے اور ان لوگوں کے گھروں سے کھا سکتے ہیں جن کا یہاں ذکر کیا گیا ہے۔ ان میں سے کسی کے ہاں کھانے کے لیے اس طرح کی شرطوں کی کوئی ضرورت نہیں ہے کہ صاحب خانہ باقاعدہ اجازت دے تو کھائیں، ورنہ خیانت ہو گی۔ آدمی اگر ان میں سے کسی کے گھر جائے اور گھر کا مالک موجود نہ ہو اور اس کے بیوی بچے کھانے کو کچھ پیش کریں تو بلاتکلف کھایا جا سکتا ہے۔ اسی طرح کھانا سامنے لا کر رکھ دیا جائے تو مزید اجازت کی درخواست محض تکلف ہے۔ یہاں ایک سوال ہے کہ اپنے گھروں سے تو ہر شخص ہی کھاتا ہے، یہ کہنے میں کیا حکمت ہے کہ تم پر کوئی گناہ نہیں کہ اپنے گھروں سے کھاؤ؟ جواب یہ ہے کہ اس میں دو حکمتیں معلوم ہوتی ہیں، ایک یہ کہ اپنے گھروں سے کھانے اور مذکورہ رشتہ داروں کے گھروں سے کھانے میں کوئی فرق نہیں، جس طرح اپنے گھروں سے کھا سکتے ہو ایسے ہی ان لوگوں کے گھروں سے بھی کھا سکتے ہو۔ دوسری حکمت یہ ہے کہ ’’اپنے گھروں‘‘ کے لفظ میں اپنے گھر کے علاوہ اپنی اولاد کا گھر بھی شامل ہے۔ دلیل اس کی یہ ہے کہ آیت میں کھانے کی اجازت کے سلسلے میں اولاد کا الگ ذکر نہیں اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : [ أَنْتَ وَ مَالُكَ لِأَبِيْكَ ] [ سلسلۃ الأحادیث الصحیحۃ : 63/6، ح : ۲۵۶۴۔ أبو داوٗد : ۳۵۳۰ ] ’’تو اور تیرا مال تیرے باپ کے لیے ہے۔‘‘ ¤ ➋ آباء میں باپ دادا اور نانا اوپر تک شامل ہیں، اسی طرح امہات میں دادی اور نانی اوپر تک اور اخوان، اخوات، اعمام، عمات، اخوال اور خالات میں حقیقی، عینی اور علاتی بھائی بہنیں، چچا، ماموں اوپر تک اور ان کی اولادیں بھی شامل ہیں، سب کے گھروں سے کھانے کی اجازت ہے۔ ابن کثیر نے فرمایا کہ اس آیت سے بعض اہلِ علم نے استدلال فرمایا ہے کہ اقارب میں سے ہر ایک کا نفقہ دوسرے پر واجب ہے، اگر وہ ضرورت مند ہوں۔ ¤ ➌ { اَوْ مَا مَلَكْتُمْ مَّفَاتِحَهٗۤ :} طبری نے معتبر سند کے ساتھ علی بن ابی طلحہ سے ابن عباس رضی اللہ عنھما کی تفسیر نقل فرمائی ہے کہ اس سے مراد یہ ہے کہ آدمی کسی شخص کو اپنی جائداد (گھر یا باغ وغیرہ) کا نگران مقرر کر دے، تو اللہ تعالیٰ نے اس کے لیے رخصت عطا فرمائی کہ اپنی زیر حفاظت و نگرانی گھر یا باغ سے کھانا یا پھل وغیرہ کھا لے یا دودھ پی لے۔ ¤ ➍ { اَوْ صَدِيْقِكُمْ:} یہ {’’صَدِيْقٌ‘‘} (دوست) دال کی تشدید کے بغیر ہے اور {’’صَدَاقَةٌ‘‘} (دوستی) سے مشتق ہے۔ یہ وزن ({فَعِيْلٌ}) واحد، جمع، مذکر اور مؤنث سب کے لیے ایک ہی ہوتا ہے۔ {’’صِدِّيْقٌ‘‘} دال کی تشدید کے ساتھ ہو تو اس کا معنی ہے بہت سچا یا بہت تصدیق کرنے والا۔ {’’صَدِيْقِكُمْ ‘‘} سے مراد وہ بے تکلف دوست ہیں جن کی عدم موجودگی میں اگر ان کے گھر سے کوئی چیز کھائی جائے تو وہ ناراض ہونے کے بجائے خوش ہوتے ہیں۔ ¤ ➎ بعض اہلِ علم نے فرمایا کہ اس آیت میں جن لوگوں کے گھروں سے کھانے کی اجازت دی گئی ہے ان کی طرف سے بھی اجازت ہونی چاہیے، وہ اجازت خواہ عام ہو یا خاص، اگر وہ ناگواری محسوس کریں تو ان کے گھروں سے کھانا درست نہیں، حتیٰ کہ کسی بھائی کی لاٹھی اٹھانا بھی اس کی دلی خوشی کے بغیر جائز نہیں۔ سائب بن یزید رضی اللہ عنہ بیان فرماتے ہیں کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرما رہے تھے : [ لَا يَأْخُذَنَّ أَحَدُكُمْ مَتَاعَ أَخِيْهِ لَاعِبًا وَلَا جَادًّا وَ مَنْ أَخَذَ عَصَا أَخِيْهِ فَلْيَرُدَّهَا ] [ أبوداوٗد، الأدب، باب من یأخذ الشيء من مزاح : ۵۰۰۳، قال الألباني حسن ] ’’تم میں سے کوئی شخص اپنے بھائی کا سامان نہ لے، نہ ہنسی مذاق کرتے ہوئے اور نہ سنجیدگی سے اور جس نے اپنے بھائی کی لاٹھی لی ہو وہ اسے واپس کرے۔‘‘ اور بعض اہلِ علم نے فرمایا کہ جب اللہ تعالیٰ نے ان گھروں سے کھانے کی اجازت دے دی تو کھانے کے لیے گھر والوں سے اجازت لینا ضروری نہیں، اس میں نہ کھانے والوں کو حجاب کرنا چاہیے، نہ اہلِ خانہ کو دریغ کرنا چاہیے۔ ¤ ➏ {لَيْسَ عَلَيْكُمْ جُنَاحٌ اَنْ تَاْكُلُوْا جَمِيْعًا اَوْ اَشْتَاتًا :} کھانے کے متعلق جاہلیت میں دو طرح کا غلو پایا جاتا تھا، کچھ لوگ تو وہ تھے جو اکیلے اکیلے کھانا کھاتے تھے اور کسی دوسرے کے ساتھ مل کر کھانے سے نفرت کرتے تھے، جیسا کہ ہندوؤں کا طریقہ ہے، یا جس طرح اب بھی کفار سے متاثر بعض لوگ جراثیم کے ذریعے سے بیماری لگ جانے کے خوف سے کسی دوسرے کے ساتھ مل کر کھانا نہیں کھاتے اور کچھ لوگ وہ تھے جو اکیلا کھانے کو بخل اور کمینگی سمجھتے تھے اور جب تک کوئی دوسرا ساتھی نہ ملتا کھانا نہیں کھاتے تھے، حتیٰ کہ بعض اوقات فاقہ کر جاتے، تو اللہ تعالیٰ نے دونوں پابندیاں ختم کرکے عام اجازت دے دی کہ الگ الگ کھاؤ یا اکٹھے مل کر کھاؤ، دونوں صورتوں میں تم پر گناہ نہیں۔ ¤ اگرچہ الگ الگ کھانے کی اجازت ہے مگر مل کر کھانا افضل ہے اور اس میں برکت ہوتی ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ طَعَامُ الْاِثْنَيْنِ كَافِي الثَّلَاثَةِ وَ طَعَامُ الثَّلَاثَةِ كَافِي الْأَرْبَعَةِ ] [ بخاري، الأطعمۃ، باب طعام الواحد یکفي الاثنین : ۵۳۹۲ ] ’’دو آدمیوں کا کھانا تین کو کافی ہوتا ہے اور تین آدمیوں کا کھانا چار کو کافی ہوتا ہے۔‘‘ جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ طَعَامُ الْوَاحِدِ يَكْفِي الْاِثْنَيْنِ وَطَعَامُ الْاِثْنَيْنِ يَكْفِي الْأَرْبَعَةَ وَطَعَامُ الْأَرْبَعَةِ يَكْفِي اللثَّمَانِيَةَ ] [ مسلم، الأشربۃ، باب فضیلۃ المواساۃ في الطعام القلیل… : ۲۰۵۹ ] ’’ایک آدمی کا کھانا دو کو کافی ہو جاتا ہے اور دو کا کھانا چار کو اور چار کا آٹھ کو کافی ہو جاتا ہے۔‘‘ ¤ ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ الْأَشْعَرِيِّيْنَ، إِذَا أَرْمَلُوْا فِي الْغَزْوِ، أَوْ قَلَّ طَعَامُ عِيَالِهِمْ بِالْمَدِيْنَةِ، جَمَعُوْا مَا كَانَ عِنْدَههُمْ فِيْ ثَوْبٍ وَاحِدٍ، ثُمَّ اقْتَسَمُوْهُ بَيْنَهُمْ فِيْ إِنَاءٍ وَاحِدٍ، بِالسَّوِيَّةِ، فَهُمْ مِنِّيْ وَ أَنَا مِنْههُمْ ] [ مسلم، فضائل الصحابۃ، باب من فضائل الأشعریین رضي اللہ عنھم : ۲۵۰۰ ] ’’اشعری لوگ جب لڑائی میں (کھانے کے حوالے سے) محتاج ہو جاتے ہیں، یا مدینہ میں ان کے بال بچوں کا کھانا کم ہو جاتا ہے، تو جو کچھ ان کے پاس ہوتا ہے وہ اسے ایک کپڑے میں اکٹھا کرتے ہیں، پھر آپس میں برابر بانٹ لیتے ہیں۔ یہ لوگ مجھ سے ہیں اور میں ان سے ہوں۔‘‘ ¤ ➐ {فَاِذَا دَخَلْتُمْ بُيُوْتًا فَسَلِّمُوْا عَلٰۤى اَنْفُسِكُمْ … :} اس میں گھروں میں داخلے کا ادب بیان فرمایا کہ داخل ہوتے وقت گھر والوں کو سلام کہے۔ {’’ عَلٰۤى اَنْفُسِكُمْ ‘‘} سے مراد اپنے لوگوں کو سلام کہنا ہے، کیونکہ وہ سب ایک جان کی مانند ہیں۔ اگر گھر میں کوئی بھی نہ ہو تو پھر بھی سلام کہے۔ تشہد کے الفاظ سے معلوم ہوتا ہے کہ اگر گھر میں کوئی نہ ہو تو اس وقت سلام اس طرح کہنا چاہیے {’’اَلسَّلَامُ عَلَيْنَا وَ عَلٰي عِبَادِ اللّٰهِ الصَّالِحِيْنَ‘‘} امام بخاری رحمہ اللہ نے ’’الأدب المفرد‘‘ (۱۰۵۵) میں حسن سند کے ساتھ ابن عمر رضی اللہ عنھما کا قول نقل فرمایا ہے : ’’جب تو کسی گھر میں جائے، جس میں کوئی نہ ہو تو یوں کہہ {’’اَلسَّلَامُ عَلَيْنَا وَ عَلٰي عِبَادِ اللّٰهِ الصَّالِحِيْنَ۔‘‘} شاہ عبد القادر رحمہ اللہ نے اس آیت کا نہایت عمدہ خلاصہ بیان فرمایا ہے، لکھتے ہیں : ’’یعنی اپنایت کے علاقوں میں کھانے کی چیز کو ہر وقت پوچھنا ضروری نہیں، نہ کھانے والا حجاب کرے، نہ گھر والا دریغ کرے، مگر عورت کا گھر اس کے خاوند کا ہو تو اس کی مرضی چاہیے، اور مل کر کھاؤ یا جدا، یعنی اس کا تکرار دل میں نہ رکھیے کہ کس نے کم کھایا کس نے زیادہ، سب نے مل کر پکایا، سب نے مل کر کھایا، اور اگر ایک شخص کی مرضی نہ ہو پھر کسی کی چیز کھانی ہر گز درست نہیں۔ اور سلام کی تاکید فرمائی آپس کی ملاقات میں، اس سے بہتر دعا نہیں، جو لوگ اس کو چھوڑ کر اور لفظ ٹھہراتے ہیں اللہ کی تجویز سے ان کی تجویز بہتر نہیں۔‘‘ ¤ ➑ { كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَكُمُ الْاٰيٰتِ لَعَلَّكُمْ تَعْقِلُوْنَ :} یہاں آیات کو کھول کر بیان کرنے کی بات تیسری دفعہ آ رہی ہے، یعنی آیات کو اس طرح کھول کر بیان کرنے کا مقصد یہ ہے کہ تم غور و فکر کرو اور ان آیات میں ذکر کردہ احکام کو سمجھو۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) ➊ { اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ … :} اس سے پہلے گھروں میں داخل ہوتے وقت اجازت طلب کرنے کا حکم دیا تھا، اب نکلتے وقت اجازت طلب کرنے کا حکم دیا، خصوصاً جب کسی اہم کام کے لیے اکٹھا کیا گیا ہو، مثلاً کسی کام کے بارے میں مشورہ ہو، یا جہاد کے لیے جمع کیا گیا ہو، یا نصیحت کے لیے جمع کیا گیا ہو، یا جیسا کہ خندق کھودنے کے لیے مسلمان اکٹھے ہوئے تھے، ایسے موقعوں پر منافقین جان بچانے کے لیے بلااجازت نکل جاتے تھے، جیسا کہ اس کے بعد والی آیت میں فرمایا : «{ قَدْ يَعْلَمُ اللّٰهُ الَّذِيْنَ يَتَسَلَّلُوْنَ مِنْكُمْ لِوَاذًا }» [ النور : ۶۳ ] ’’بے شک اللہ ان لوگوں کو جانتا ہے جو تم میں سے ایک دوسرے کی آڑ لیتے ہوئے کھسک جاتے ہیں۔‘‘ اور دوسری جگہ فرمایا : «{ وَ اِذَا مَاۤ اُنْزِلَتْ سُوْرَةٌ نَّظَرَ بَعْضُهُمْ اِلٰى بَعْضٍ هَلْ يَرٰىكُمْ مِّنْ اَحَدٍ ثُمَّ انْصَرَفُوْا صَرَفَ اللّٰهُ قُلُوْبَهُمْ بِاَنَّهُمْ قَوْمٌ لَّا  يَفْقَهُوْنَ }» [ التوبۃ : ۱۲۷ ] ’’اور جب بھی کوئی سورت نازل کی جاتی ہے تو ان کا بعض بعض کی طرف دیکھتا ہے کہ کیا تمھیں کوئی دیکھ رہا ہے ؟ پھر واپس پلٹ جاتے ہیں۔ اللہ نے ان کے دل پھیر دیے ہیں، اس لیے کہ وہ ایسے لوگ ہیں جو نہیں سمجھتے۔‘‘ بعض اہل علم نے فرمایا کہ یہاں منافقین کی صریح الفاظ میں مذمت کے بجائے اجازت لے کر جانے والے مسلمانوں کی تعریف کرکے فرمایا کہ مومن صرف یہ ہیں اور یہ بات اسی آیت میں دو دفعہ بیان فرمائی، ایک {’’ اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اٰمَنُوْا … ‘‘} اور دوسری {’’ اِنَّ الَّذِيْنَ يَسْتَاْذِنُوْنَكَ اُولٰٓىِٕكَ الَّذِيْنَ يُؤْمِنُوْنَ بِاللّٰهِ وَ رَسُوْلِهٖ ‘‘} ااس سے ظاہر ہے کہ ایسے موقع پر اجازت کے بغیر کھسک جانے والوں میں کامل ایمان نہیں، یا وہ ایمان سے بالکل ہی فارغ ہیں۔ مگر یہ بات صراحت کے بجائے کنائے سے بیان فرمائی، گویا منافقین اس قابل نہیں کہ ان کا نام مذمت کے لیے بھی لیا جائے۔ ¤ ➋ { فَاِذَا اسْتَاْذَنُوْكَ لِبَعْضِ شَاْنِهِمْ فَاْذَنْ لِّمَنْ شِئْتَ مِنْهُمْ :} اس سے معلوم ہوا کہ اجازت بلاوجہ نہیں بلکہ اپنے کسی اہم کام کے لیے مانگنی چاہیے اور یہ بھی کہ امیر کو اختیار ہے کہ جسے چاہے اجازت دے اور جسے چاہے نہ دے، کیونکہ وہ بہتر جانتا ہے کہ مجلس کی اہمیت کے پیش نظر کسے اجازت دینے کی گنجائش ہے۔ ¤ ➌ {وَ اسْتَغْفِرْ لَهُمُ اللّٰهَ :} اس میں اس بات کی طرف اشارہ ہے کہ عذر کی بنا پر اگرچہ اجازت لے کر جانا جائز ہے مگر پھر بھی اچھا نہیں ہے، کیونکہ یہ دنیا کے کام کو دین پر مقدم رکھنا ہے، اس لیے آپ صلی اللہ علیہ وسلم کو ایسے لوگوں کے لیے مغفرت کی دعا کرنے کا حکم دیا ہے۔ (وحیدی) ¤ ➍ یہ آیت امت کی مصلحت کے لیے جماعتی نظم کی بنیاد ہے، کیونکہ سنت یہ ہے کہ ہر اجتماع کے لیے (چھوٹا ہو یا بڑا) ایک امیر ہو۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا كَانَ ثَلَاثَةٌ فِيْ سَفَرٍ فَلْيُؤَمِّرُوْا أَحَدَهُمْ ] [ أبوداوٗد، الجہاد، باب في القوم یسافرون… : ۲۶۰۹، قال الألباني حسن صحیح ] ’’جب سفر میں تین(۳) آدمی ہوں تو وہ اپنے میں سے ایک کو امیر بنا لیں۔‘‘ یہ امیر ان مسلمانوں کے لیے ولی الامر کا قائم مقام ہو گا اور اس کی حیثیت رسول اللہ صلی اللہ علیہ وسلم کے جانشین کی ہو گی، اس لیے اس کے اجتماع سے اس کی اجازت کے بغیر جانا جائز نہیں، کیونکہ اگر ہر شخص کو اپنی مرضی سے کھسک جانے کی اجازت ہے تو کوئی اجتماع بکھرنے سے نہیں بچے گا۔ اسی طرح جب امیر کسی دینی، سیاسی یا جہادی ضرورت کے لیے مجلس بلائے تو طے شدہ مقام اور وقت سے اجازت یا صحیح عذر کے بغیر پیچھے رہنا جائز نہیں۔ (ابن عاشور)"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) ➊ { لَا تَجْعَلُوْا دُعَآءَ الرَّسُوْلِ بَيْنَكُمْ …:} مفسرین نے اس آیت کے تین مطلب  بیان فرمائے ہیں، پہلا یہ کہ {’’دُعَآءَ الرَّسُوْلِ ‘‘} کا معنی ہے رسول کا بلانا۔ اس صورت میں لفظ {’’ دُعَآءَ ‘‘} اپنے فاعل کی طرف مضاف ہے، یعنی رسول اللہ صلی اللہ علیہ وسلم تمھیں بلائیں تو آپ صلی اللہ علیہ وسلم کے بلانے کو آپس میں ایک دوسرے کو بلانے کی طرح معمولی نہ سمجھو، کیونکہ آپ صلی اللہ علیہ وسلم جب بلائیں تو حاضر ہونا واجب ہوتا ہے، جب کہ آپس میں ایک دوسرے کو بلانے کا یہ حکم نہیں ہے۔ یہ مفہوم یہاں زیادہ مناسب ہے، کیونکہ اس سے پہلے اجازت طلب کرنے اور امر جامع میں موجود رہنے کا بیان ہے۔ دوسرا معنی یہ ہے، تمھارا رسول کو بلانا۔ اس صورت میں {’’ دُعَآءَ ‘‘} اپنے مفعول کی طرف مضاف ہے، یعنی رسول اللہ صلی اللہ علیہ وسلم کو اس طرح نام لے کر مت بلاؤ جس طرح تم ایک دوسرے کو نام لے کر بلاتے ہو، بلکہ یا نبی اللہ، یا رسول اللہ، یا ایسے القاب سے بلاؤ جن میں آپ صلی اللہ علیہ وسلم کی تعظیم و تکریم ہو اور ایسے لہجے میں مت بلاؤ جس میں تم ایک دوسرے کو بلاتے ہو، بلکہ آواز نیچی رکھ کر ادب کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کو بلاؤ۔ اس معنی کی تائید سورۂ حجرات کی ابتدائی آیات سے ہوتی ہے، فرمایا : «{ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَرْفَعُوْۤا اَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَ لَا تَجْهَرُوْا لَهٗ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْعْضٍ اَنْ تَحْبَطَ اَعْمَالُكُمْ وَ اَنْتُمْ لَا تَشْعُرُوْنَ }» [ الحجرات : ۲ ] ’’اپنی آوازیں نبی کی آواز کے اوپر بلند نہ کرو اور نہ بات کرنے میں اس کے لیے آواز اونچی کرو، تمھارے بعض کے بعض کے لیے آواز اونچی کرنے کی طرح، ایسا نہ ہو کہ تمھارے اعمال برباد ہو جائیں اور تم شعور نہ رکھتے ہو۔‘‘ یہ معنی بھی بہت عمدہ ہے۔ تیسرا معنی یہ ہے کہ تم رسول کی دعا کو عام لوگوں کی دعا کی طرح مت سمجھو۔ کیونکہ آپ کی دعا قبول شدہ ہے، اگر تمھارے حق میں ہو گئی تو اس سے بڑی نعمت کوئی نہیں اور اگر تمھارے خلاف ہو گئی تو کوئی جائے پناہ نہیں۔ یہ معنی اگرچہ اپنی جگہ درست ہے، مگر آیت کے الفاظ سے بعید ہے۔ ¤ ➋ {قَدْ يَعْلَمُ اللّٰهُ الَّذِيْنَ يَتَسَلَّلُوْنَ مِنْكُمْ لِوَاذًا:’’ يَتَسَلَّلُوْنَ ‘‘ } آہستہ آہستہ خفیہ طریقے سے نکلتے ہیں، کھسکتے ہیں، جیسے {’’ تَدَخَّلَ‘‘} اور {’’ تَدَرَّجَ‘‘} میں آہستہ آہستہ کا مفہوم شامل ہے۔ {’’ لِوَاذًا ‘‘ لَاذَ يَلُوْذُ} سے باب مفاعلہ کا مصدر ہے، ایک دوسرے کی پناہ لینا۔ یہ منافقین کا شیوہ تھا کہ کوئی مسلمان اجازت لے کر نکلتا تو اس کی آڑ لے کر وہ بھی نکل جاتے۔ کھسکنے والوں کو اللہ کی گرفت سے ڈرانا مقصود ہے۔ ¤ ➌ {فَلْيَحْذَرِ الَّذِيْنَ يُخَالِفُوْنَ عَنْ اَمْرِهٖۤ : ’’ خَالَفَ يُخَالِفُ خِلَافًا وَ مُخَالَفَةً‘‘} کا معنی پیچھے رہنا بھی ہے، جیسا کہ فرمایا : «{ فَرِحَ الْمُخَلَّفُوْنَ۠ بِمَقْعَدِهِمْ خِلٰفَ رَسُوْلِ اللّٰهِ }» [ التوبۃ : ۸۱ ] ’’وہ لوگ جو پیچھے چھوڑ دیے گئے وہ اللہ کے رسول کے پیچھے اپنے بیٹھ رہنے پر خوش ہو گئے۔‘‘ {’’ يُخَالِفُوْنَ ‘‘} کے بعد {’’ عَنْ ‘‘} کی وجہ سے ترجمہ کیا گیا ہے ’’سو لازم ہے کہ وہ لوگ ڈریں جو اس کا حکم ماننے سے پیچھے رہتے ہیں۔‘‘ اس آیت کی تفسیر کے لیے دیکھیے سورۂ انفال (۲۴، ۲۵) شوکانی نے فرمایا : {’’ يُخَالِفُوْنَ ‘‘} کے بعد {’’عَنْ ‘‘} لانے کا مطلب یہ ہے کہ {’’ يُخَالِفُوْنَ ‘‘} کے ضمن میں اعراض کا مفہوم شامل ہے، یعنی جو لوگ اس کے حکم سے اعراض کرتے ہیں۔‘‘ زمخشری نے فرمایا : {’’ يُخَالِفُوْنَ عَنْ اَمْرِهٖۤ ‘‘} کا معنی {’’يَصُدُّوْنَ عَنْ أَمْرِهِ‘‘} ہے، یعنی جو لوگ اس کے حکم سے دوسروں کو روکتے ہیں۔‘‘ مختصر یہ کہ رسول اللہ صلی اللہ علیہ وسلم کے حکم سے پیچھے رہنے کا نتیجہ فتنے میں مبتلا ہونا ہے۔ طبری نے اپنی معتبر سند کے ساتھ علی بن ابی طلحہ سے ابن عباس رضی اللہ عنھما کا قول نقل کیا ہے کہ آیت {’’ وَ قٰتِلُوْهُمْ حَتّٰي لَا تَكُوْنَ فِتْنَةٌ ‘‘} میں فتنہ سے مراد شرک ہے، یعنی جو شخص جان بوجھ کر رسول اللہ صلی اللہ علیہ وسلم کے حکم پر عمل نہیں کرتا یا عمل کرنے میں تاخیر کرتا ہے، خطرہ ہے کہ وہ خالص ایمان سے ہاتھ دھو بیٹھے گا اور کفر و شرک یا بدعت میں مبتلا ہو جائے گا۔ ¤ ➍ { اَوْ يُصِيْبَهُمْ عَذَابٌ اَلِيْمٌ :} دنیا میں اس عذاب کی کئی صورتیں ہو سکتی ہیں، دیکھیے سورۂ انعام کی آیت (۶۵) کی تفسیر۔ ¤ ➎ اس آیت میں لفظ{ ’’ اَوْ ‘‘} مانعۃ الخلو ہے، یعنی یہ نہیں ہو سکتا کہ فتنے اور عذابِ الیم میں سے کوئی چیز بھی ان پر نہ آئے، ہاں یہ ہو سکتا ہے کہ دونوںچیزیں ان پر اتریں۔ ¤ ➏ جب صرف ایک معاملہ میں رسول کی اطاعت نہ کرنے پر یہ وعید سنائی گئی ہے تو ان لوگوں کو اپنے معاملے پر ضرور غور کرنا چاہیے جنھوں نے رسول کو سرے سے اطاعت کا مستحق ہی نہیں سمجھا، بلکہ دوسروں کو بھی اس سے بے نیاز ہونے کی دعوت دیتے ہیں۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) ➊ { اَلَاۤ اِنَّ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ الْاَرْضِ :} طبری نے فرمایا : ’’اللہ تعالیٰ فرماتے ہیں، یاد رکھو، سارے آسمان اور زمین اللہ تعالیٰ کی ملکیت ہیں اور مملوک کو لائق نہیں کہ اپنے مالک کے حکم کی نافرمانی کرے اور اس کی سزا کا حق دار بنے۔ فرماتے ہیں، لوگو! اسی طرح تمھارے لیے بھی اپنے رب کے حکم کی جو تمھارا مالک ہے، خلاف ورزی کرنا درست نہیں، سو اس کی اطاعت کرو، اس کے حکم پر عمل کرو اور جب تم اس کے رسول کے ساتھ کسی جامع کام میں حاضر ہو تو اس کی اجازت کے بغیر مت نکلو۔‘‘ (طبری : ۲۶۴۷۶) ¤ ➋ {قَدْ يَعْلَمُ مَاۤ اَنْتُمْ عَلَيْهِ :} یعنی تم جس روش پر قائم ہو، وہ اچھی ہے یا بری، اللہ تعالیٰ یقینا اسے جانتا ہے۔ ¤ ➌ { وَ يَوْمَ يُرْجَعُوْنَ اِلَيْهِ …:} خبر دینے سے مراد ان کے اعمال کی جزا دینا ہے۔ منافقین کا خطاب کے بعد غائب کے صیغے سے ذکر التفات ہے، جس سے ناراضی کا اظہار ہو رہا ہے۔ ¤ ➍ {وَ اللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ :} یہ {’’ قَدْ يَعْلَمُ مَاۤ اَنْتُمْ عَلَيْهِ ‘‘} کے مضمون کی تکمیل ہے، پہلے صرف منافقین کے احوال جاننے کا ذکر فرمایا، اب فرمایا، وہ صرف تمھارے احوال ہی نہیں بلکہ ہر چیز کو خوب جاننے والا ہے۔"
    }
  ]
}