{
  "surah": "Al-Furqaan",
  "surah_number": 25,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { تَبٰرَكَ الَّذِيْ نَزَّلَ الْفُرْقَانَ …:} اللہ تعالیٰ نے اس سورت میں سب سے پہلے توحید پر کلام فرمایا، کیونکہ وہ سب سے پہلے اور سب سے اہم ہے، پھر نبوت پر، کیونکہ وہ رب اور بندے کے درمیان واسطہ ہے، پھر قیامت پر، کیونکہ وہ خاتمہ ہے۔ (شوکانی) ¤ ➋ {’’ تَبٰرَكَ ‘‘ ’’بَرَكَةٌ‘‘} سے باب تفاعل ہے، {’’بَرَكَةٌ‘‘} کا اشتقاق {’’ بِرْكَةٌ ‘‘} (حوض) سے ہے کہ اس میں بہت زیادہ پانی ہوتا ہے، یا {’’بَرَكَ الْإِبِلُ‘‘} سے ہے، جس کا معنی اونٹ کا بیٹھنا ہے۔ باب تفاعل میں مبالغہ پایا جاتا ہے، اسی مناسبت سے اس کا ترجمہ ’’بہت برکت والا ہے‘‘ کیا گیا ہے۔ برکت سے مراد خیر میں زیادہ ہونا، بڑھا ہوا ہونا، دائمی خیر والا ہونا ہے۔ یعنی وہ خیر اور بھلائی میں ساری کائنات سے بے انتہا بڑھا ہوا ہے۔ بلندی، بڑائی، احسان، غرض ہر لحاظ سے اس کی ذات بے حد و حساب خوبیوں اور بھلائیوں کی جامع ہے۔ یاد رہے {’’ تَبٰرَكَ ‘‘} کا لفظ اللہ تعالیٰ ہی کے لیے آتا ہے، کسی اور میں یہ خوبی نہیں۔ ¤ ➌ {نَزَّلَ الْفُرْقَانَ : ’’ نَزَّلَ ‘‘} میں تکرار کا معنی پایا جاتا ہے، یعنی تھوڑا تھوڑا کرکے نازل فرمایا۔ اس کی حکمت آگے آیت (۳۲) میں آ رہی ہے۔ قرآن کو {’’ الْفُرْقَانَ ‘‘} کہا ہے، یعنی یہ اپنے احکام کے ذریعے سے حق و باطل کے درمیان فرق کرنے والا ہے اور اسی لفظ کی بنا پر اس سورت کا نام ’’الفرقان‘‘ رکھا گیا ہے۔ ¤ ➍ { عَلٰى عَبْدِهٖ :} دیکھیے سورۂ بنی اسرائیل کی پہلی آیت کی تفسیر۔ ¤ ➎ { لِيَكُوْنَ لِلْعٰلَمِيْنَ نَذِيْرَا:} اس میں آپ پر قرآن نازل کرنے کی حکمت بیان فرمائیی ہے۔ سارے جہانوں سے مراد قیامت تک تمام جن و انس ہیں، اس لیے کہ آپ صلی اللہ علیہ وسلم کی بعثت ان سب کے لیے ہے، کوئی دوسرا رسول دنیا میں ایسا نہیں آیا۔ یہ مضمون قرآن مجید میں کئی مقامات پر بیان ہوا ہے۔ دیکھیے سورۂ اعراف (۱۵۸)، انعام (۱۹)، سبا (۲۸) اور احزاب (۴۰) عرب اور اہلِ کتاب کی صراحت کے لیے دیکھیے آل عمران (۲۰) جابر بن عبد اللہ رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أُعْطِيْتُ خَمْسًا لَمْ يُعْطَهُنّنَّ أَحَدٌ مِنَ الْأَنْبِيَاءِ قَبْلِيْ… وَ  كَانَ النَّبِيُّ يُبْعَثُ إِلٰی قَوْمِهِ خَاصَّةً وَ بُعِثْتُ إِلَی النَّاسِ كَافَّةً ] [بخاري، الصلاۃ، باب قول النبي صلی اللہ علیہ وسلم : جعلت لي الأرض … : ۴۳۸ ] ’’مجھے پانچ چیزیں عطا کی گئی ہیں جو مجھ سے پہلے انبیاء میں سے کسی کو نہیں دی گئیں… (ان میں سے ایک یہ ہے کہ) پہلے نبی خاص اپنی قوم کی طرف بھیجا جاتا تھا جبکہ مجھے تمام لوگوں کی طرف مبعوث کیا گیا۔‘‘ ¤ ➏ یہاں رسول اللہ صلی اللہ علیہ وسلم کے صرف ’’نذیر‘‘ ہونے کا ذکر فرمایا، کیونکہ آگے کفار کے اقوال و احوال اور ان کے انجام کا ذکر ہے، اس کے مناسب ڈرانا ہی ہے۔ نذارت و بشارت دونوں کا اکٹھا ذکر آگے آ رہا ہے، فرمایا : «{ وَ مَاۤ اَرْسَلْنٰكَ اِلَّا مُبَشِّرًا وَّ نَذِيْرًا }» [ الفرقان : ۵۶ ] ’’اور ہم نے تجھے نہیں بھیجا مگر خوش خبری دینے والا اور ڈرانے والا بنا کر۔‘‘"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { الَّذِيْ لَهٗ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ :} اس آیت میں اللہ تعالیٰ نے اپنی چار صفات بیان فرمائی ہیں جو اس کی توحید کی دلیل ہیں۔ پہلی یہ کہ آسمان و زمین کی بادشاہی اسی کی ہے، کسی اور کی نہیں۔ ان دونوں کو چلانے والا وہی ہے، دوسرے سب اپنے وجود اور اپنی بقا میں اسی کے محتاج ہیں۔ ¤ ➋ { وَ لَمْ يَتَّخِذْ وَلَدًا :} یہ دوسری صفت ہے، تفصیل کے لیے دیکھیے سورۂ بنی اسرائیل کی آخری آیت کی تفسیر۔ اس میں یہود و نصاریٰ کا ردّ ہے اور ان جھوٹے مسلمانوں کا بھی جو نبی صلی اللہ علیہ وسلم کو یا علی، فاطمہ، حسن اور حسین رضی اللہ عنھم کو، یا کسی اور کو اللہ کے نور کا ٹکڑا مانتے ہیں۔ ¤ ➌ { وَ لَمْ يَكُنْ لَّهٗ شَرِيْكٌ فِي الْمُلْكِ :} یہ تیسری صفت ہے۔ {’’ لَمْ يَكُنْ ‘‘} میں نفی کا استمرار ہے، اس لیے ترجمہ کیا گیا ہے ’’اور نہ کبھی بادشاہی میں کوئی اس کا شریک رہا ہے۔‘‘ اس میں ہر قسم کے مشرکین کا ردّ ہے، جیسے بت پرست، قبر پرست، دو خدا ماننے والے اور شرک خفی کا ارتکاب کرنے والے وغیرہ۔ ¤ ➍ { وَ خَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهٗ تَقْدِيْرًا :} یہ چوتھی صفت ہے کہ ہر چیز اسی نے پیدا کی، پھر اس کے لیے ایک خاص اندازہ مقرر فرما دیا، جس کی بدولت اس سے وہی افعال و اثرات صادر ہوتے ہیں جن کے لیے وہ پیدا کی گئی ہے اور اسے وہی صورت، جسامت اور صلاحیتیں عطا کیں جو اس کی ضرورت کے مطابق ہیں، مثلاً انسان کو فہم و ادراک، غور و فکر، صنعت و حرفت اور مفید کام بجا لانے کی صلاحیت بخشی، اسی طرح ہر حیوان اور پودے اور جماد کو اس مصلحت کے مطابق بنایا جو اس سے مطلوب تھی۔ جب اللہ کے سوا کسی نے کچھ بھی پیدا نہیں کیا تو کسی اور کی عبادت کیوں؟ دیکھیے سورۂ انعام (۱۰۲)، رعد (۱۶)، فاطر (۳)، زمر (۶۲)، مؤمن (۶۲)، حج (۷۳)، نحل (۲۰) اور اعراف (۱۹۱)۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) { وَ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اٰلِهَةً لَّا يَخْلُقُوْنَ شَيْـًٔا …:} اس آیت میں اللہ تعالیٰ نے معبود برحق ہونے کے چند معیار بیان فرمائے اور تمام مشرکوں کو دعوت دی کہ وہ اپنے خداؤں کو ان معیاروں پر پرکھیں اور بتائیں کہ وہ کسی طرح بھی معبود ہو سکتے ہیں۔ وہ معیار یہ ہیں : (1) جو ہستی کوئی چیز پیدا نہ کر سکے، یا کسی چیز کی بھی خالق نہ ہو وہ معبود نہیں ہو سکتی۔ (2) جو چیز خود مخلوق ہو، اسے کسی نے پیدا کیا ہو وہ الٰہ نہیں ہو سکتی۔ ظاہر ہے اللہ کے سوا جن کو بھی معبود بنایا گیا ہے سب مخلوق ہیں، وہ چاہے فرشتے ہوں یا جن، انسان، درخت، پتھر، بت، قبر، سورج، چاند، تارے یا کوئی اور، اس لیے انھیں معبود بنانا بہت بڑی جہالت ہے۔ (3) جو ہستی کسی دوسرے کو فائدہ یا نقصان نہ پہنچا سکتی ہو، دوسرے لفظوں میں جو ہستی حاجت روا اور مشکل کشا نہ ہو وہ الٰہ نہیں ہو سکتی۔ یہی وہ صفت ہے جسے مشرکین اللہ کے سوا بعض دوسری ہستیوں میں تسلیم کرتے ہیں، خواہ وہ جان دار ہوں یا بے جان، زندہ ہوں یا مر چکی ہوں، اور شرک کی یہی قسم سب سے زیادہ عام ہے۔ اس کا ردّ اللہ تعالیٰ نے اس طرح فرمایا کہ جو چیز اپنے نفع و نقصان ہی کی مالک نہ ہو وہ کسی دوسرے کی حاجت روا یا مشکل کُشا کیسے ہو سکتی ہے! یہ معیار ایسا واضح اور زبردست ہے کہ اس کے مطابق اللہ کے سوا تمام معبود باطل قرار پاتے ہیں۔ ابراہیم علیہ السلام نے بتوں کو توڑا اور وہ ان کا بال بیکا نہ کر سکے۔ رہے بزرگان دین، خواہ وہ پیغمبر ہوں یا ولی، زندہ ہوں یا فوت ہو چکے ہوں، سب کو ان کی زندگی میں بے شمار تکلیفیں پہنچتی رہیں، لیکن وہ اپنی تکلیفیں اور بیماریاں خود رفع نہ کر سکے، تو دوسروں کی کیا کرتے، یا کیا کریں گے، وہ تو خود صرف اللہ سے دعا کرتے رہے۔ رہے شمس و قمر، تارے اور فرشتے، تو یہ سب ایسی مخلوق ہیں جن کے پاس اپنا اختیار کچھ بھی نہیں ہے۔ اللہ نے انھیں جس کام پر لگا دیا ہے اس کے سوا دوسرا کام کر ہی نہیں سکتے، لہٰذا وہ بھی الوہیت کے معیار پر پورے نہیں اترتے۔ ¤ (4) معبود برحق ہونے کا ایک معیار یہ ہے کہ وہ ہستی کسی زندہ کو مار سکتی ہو اور مردہ کو زندہ کر سکتی ہو اور زندہ کرکے قبروں سے اٹھا سکتی ہو، اللہ کی یہ شان ہے کہ وہ ہر وقت زندہ سے مردہ اور مردہ سے زندہ چیزیں پیدا کر رہا ہے، قیامت کو وہ سب کو زندہ کرکے سامنے لا کھڑا کرے گا، دوسری کسی ہستی کے اختیار میں کسی کو زندہ کرنا ہے نہ مارنا اور نہ قیامت برپا کرنا۔ اس مقام پر معبود برحق ہونے کے یہ معیار بیان ہوئے ہیں، جب کہ دوسرے مقامات پر اور بھی کئی معیار مذکور ہیں، مثلاً جو خود محتاج ہو وہ الٰہ نہیں ہو سکتا، جو بے جان ہو وہ الٰہ نہیں ہو سکتا، جو کھانا کھاتا ہو وہ الٰہ نہیں ہو سکتا، جسے نیند یا موت آتی ہے وہ الٰہ نہیں ہو سکتا، جو ہر چیز کا علم نہ رکھتا ہو وہ الٰہ نہیں ہو سکتا، جو نہ سن سکتا ہو، نہ دیکھ سکتا ہو، نہ بول سکتا ہو، نہ جواب دے سکتا ہو وہ الٰہ نہیں ہو سکتا وغیرہ۔ (تیسیر القرآن کیلانی بتصرف)"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { وَ قَالَ الَّذِيْنَ كَفَرُوْۤا …:} توحید کے بیان اور شرک اور مشرکین کے ردّ کے بعد منکرینِ نبوت کے شبہات و اعتراضات ذکر فرمائے، چنانچہ پہلا اعتراض ان کا یہ بیان فرمایا کہ یہ قرآن آپ نے اپنے پاس سے گھڑ لیا ہے اور کچھ لوگوں نے اس معاملہ میں آپ کی مدد کی ہے۔ اس کی کچھ تفصیل سورۂ نحل (۱۰۳) میں گزر چکی ہے۔ ¤ ➋ { فَقَدْ جَآءُوْ ظُلْمًا وَّ زُوْرًا :} ظلم کا معنی کسی چیز کو اس کی جگہ کے سوا رکھ دینا ہے، کیونکہ ظلم کا اصل معنی اندھیرا ہے اور اندھیرے میں آدمی چیز کو اس کی جگہ نہیں رکھ سکتا۔ {’’ زُوْرًا ‘‘} ایسے سخت جھوٹ کو کہتے ہیں جو بنا سنوار کر خوش نما بنا دیا گیا ہو، اس لیے اس کا معنی فریب بھی ہو سکتا ہے۔ تنوین تہویل کے لیے ہے، یعنی انھوں نے یہ جو بات کہی ہے وہ بھاری ظلم (بے انصافی) اور سخت جھوٹ ہے، اس لیے کہ وہ جانتے ہیں کہ قرآن جیسی کتاب، جس کی فصاحت و بلاغت اور مضامین کے مقابلے سے کل کائنات عاجز ہے، اسے اپنے پاس سے تصنیف کرکے پیش کر دینا کسی انسان کے بس میں نہیں، چاہے اس کی پشت پر چند نہیں ہزاروں بلکہ اللہ کے سوا سب جمع ہو جائیں۔ افسوس اور تعجب اس پر ہے کہ یہ لوگ محمد صلی اللہ علیہ وسلم کے بارے میں یہ بات کہہ رہے ہیں جن کی پوری زندگی ان کے سامنے گزری (دیکھیے یونس : ۱۶) اور جن کے بارے میں انھیں خوب معلوم ہے کہ آپ نے نہ کبھی پڑھنا لکھنا سیکھا اور نہ کسی عالم کی شاگردی کی (دیکھیے عنکبوت : ۴۸) پھر یہ قرآن آپ کی تصنیف کیسے ہو سکتا ہے؟"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) { وَ قَالُوْۤا اَسَاطِيْرُ الْاَوَّلِيْنَ اكْتَتَبَهَا … :} یعنی خود تو اَن پڑھ ہے، اس  لیے دوسرے لوگوں کے ذمے اس نے یہ کام لگا رکھا ہے کہ صبح و شام یہ لکھوائی ہوئی کہانیاں اسے پڑھ پڑھ کر سنائیں، تاکہ اسے زبانی یاد ہو جائیں۔ یہ بات ایسی تھی جس کے جھوٹ اور بہتان ہونے میں کسی کو شبہ نہیں ہو سکتا۔ چالیس سال آپ صلی اللہ علیہ وسلم ان میں رہ چکے تھے، اگر کوئی شخص چھوٹے سے شہر میں چند دن صبح و شام کسی کے پاس رہے تو اس کا پتا ہر ایک کو چل جاتا ہے اور ان لوگوں کا اصرار ہے کہ اب بھی دوسروں کی لکھوائی ہوئی باتیں صبح و شام آپ کے سامنے پڑھی جاتی ہیں۔ پھر اگر ایسا ہی تھا تو وہ بھی کسی سے لکھو اکر ایسی ایک سورت ہی پیش کر دیتے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { قُلْ اَنْزَلَهُ الَّذِيْ يَعْلَمُ السِّرَّ فِي السَّمٰوٰتِ وَ الْاَرْضِ:} یہ ان کے جھوٹ اور افترا کے جواب میں فرمایا کہ قرآن کو تو دیکھو اس میں کیا ہے ؟ کیا اس کی کوئی بات غلط اور خلاف واقعہ ہے ؟ یقینا نہیں ہے، بلکہ ہر بات بالکل سچی اور صحیح ہے، اس لیے کہ اس کو اتارنے والی وہ ذات ہے جس کے پاس زمین و آسمان کی ظاہر باتوں ہی کا نہیں تمام پوشیدہ باتوں کا بھی پورا علم ہے۔ وہ ماضی کو جانتا ہے، حال اور مستقبل کو بھی۔ اس لیے اس کی نازل کردہ کتاب میں گزشتہ زمانوں کی باتیں ہیں، حال کی بھی اور آئندہ زمانے کی بھی اور ان میں سے کوئی بات غلط ثابت ہوئی ہے نہ ہو گی۔ جو شخص آسمانوں اور زمین کے تمام راز نہ جانتا ہو وہ اس جیسی کتاب تو کجا اس جیسی ایک سورت بھی نہیں بنا سکتا، اگر تمھیں اصرار ہے کہ یہ اللہ کا کلام نہیں بلکہ بندے کی تصنیف ہے، تو تم بھی مقابلے میں کوئی سورت لے آؤ۔ ¤ ➋ { اِنَّهٗ كَانَ غَفُوْرًا رَّحِيْمًا :} یہ اس سوال کا جواب ہے کہ جو سب چیزوں کا علم رکھتا ہو وہ ہر چیز پر قادر بھی ہوتا ہے، پھر وہ ان لوگوں کے انکار، تکبر اور استہزا پر فوری گرفت کیوں نہیں کرتا۔ فرمایا وجہ یہ ہے کہ {’’ اِنَّهٗ كَانَ ‘‘} یعنی وہ ہمیشہ سے بندوں کے گناہوں پر بہت پردہ ڈالنے والا ہے، دائمی رحم والا ہے، وہ چاہتا تو اس گستاخی پر انھیں سخت سزا دیتا، مگر وہ غفور و رحیم ہے، اس لیے تم سے درگزر کر رہا ہے۔ اس میں انھیں توبہ و انابت اور اسلام و ہدایت کی طرف پلٹ آنے کی ترغیب ہے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یعنی (آسمان و زمین کی چھپی ہوئی باتیں جاننے والے نے) اپنی بخشش اور مہربانی سے ہی اسے اتارا ہے۔‘‘ (موضح) یعنی اس کی مغفرت و رحمت یہ قرآن اتارنے کا باعث ہے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { وَ قَالُوْا مَالِ هٰذَا الرَّسُوْلِ يَاْكُلُ الطَّعَامَ … :} یہ قرآن پر طعن کے بعد رسول پر طعن ہے اور بہت گھٹیا طعن ہے، کفار کا یہ جاہلانہ طعن قرآن میں متعدد مقامات پر دہرایا گیا ہے، ان کے خیال میں کوئی بشر رسول نہیں ہو سکتا۔ (دیکھیے بنی اسرائیل : ۹۴، ۹۵) اس لیے انھوں نے کہا، یہ رسول (جو ہماری طرف بھیجے جانے کا دعویٰ کرتا ہے) اسے کیا ہے کہ ہماری طرح کھانا کھاتا ہے اور بازاروں میں چلتا پھرتا ہے، ہم میں اور اس میں فرق کیا ہے؟ اسے تو فرشتہ ہونا چاہیے تھا، جو بشری ضرورتوں سے پاک ہوتا اور اگر انسان ہوتے ہوئے اسے یہ مقام مل گیا تھا، تو اس کی شان کم از کم اتنی تو ہوتی جتنی دنیا کے کسی بادشاہ کی ہوتی ہے۔ (دیکھیے زخرف : ۵۳) اللہ تعالیٰ نے اس کا جواب آگے آیت (۲۰) میں دیا ہے۔ ¤ ➋ { لَوْ لَاۤ اُنْزِلَ اِلَيْهِ مَلَكٌ … :} یعنی اگر انسان ہی کو رسول ہونا تھا تو اس کی طرف آسمان سے کوئی فرشتہ اتارا جاتا، جو سب کو نظر آتا، ہر وقت اس کے ساتھ رہتا اور لوگوں کو بتاتا کہ یہ اللہ کا رسول ہے، پھر جو لوگ اس پر ایمان نہ لاتے انھیں اللہ کے عذاب کی دھمکی دیتا۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { اَوْ يُلْقٰۤى اِلَيْهِ كَنْزٌ:} یا اس کی طرف کوئی خزانہ اتارا جاتا جس سے اس کی شان کم از کم قیصر و کسریٰ کی سی تو ہوتی۔ ¤ ➋ {اَوْ تَكُوْنُ لَهٗ جَنَّةٌ يَّاْكُلُ مِنْهَا:} یا خزانہ نہ سہی، کم از کم اس کا کوئی باغ ہوتا، تاکہ اس باغ سے اطمینان کی روزی حاصل کرتا اور روزی کمانے کے لیے بازاروں کے چکر لگانے سے بچ جاتا۔ کفار کے اس طرح کے مطالبات کی اس سے بھی لمبی فہرست سورۂ بنی اسرائیل (۹۰ تا ۹۳) میں بیان ہوئی ہے۔ ¤ ➌ { وَ قَالَ الظّٰلِمُوْنَ اِنْ تَتَّبِعُوْنَ اِلَّا رَجُلًا مَّسْحُوْرًا :} یہی بات فرعون نے موسیٰ علیہ السلام سے کہی تھی۔ دیکھیے بنی اسرائیل (۱۰۱)۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ { اُنْظُرْ كَيْفَ ضَرَبُوْا لَكَ الْاَمْثَالَ :} دیکھو انھوں نے تمھارے لیے کیسے مثالیں بیان کیں، صرف اس لیے کہ کسی طرح آپ کو جھوٹا ثابت کر سکیں۔ ¤ ➋ { فَضَلُّوْا فَلَا يَسْتَطِيْعُوْنَ سَبِيْلًا :} سو بھٹک گئے اور ایسے بھٹکے کہ کسی راستے پر آ ہی نہیں سکتے، کیونکہ راہ پر وہ آتا ہے جس کے دل میں اخلاص ہو اور وہ محض غلط فہمی کا شکار ہو گیا ہو، ان کے دلوں میں تو اخلاص کے بجائے ضد اور ہٹ دھرمی ہے۔ مزید دیکھیے بنی اسرائیل (۴۷، ۴۸)۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) { تَبٰرَكَ الَّذِيْۤ اِنْ شَآءَ جَعَلَ لَكَ خَيْرًا مِّنْ ذٰلِكَ جَنّٰتٍ … :} بہت برککت اور لامحدود قوتوں اور اسباب کا مالک ہے وہ اللہ کہ اگر چاہے تو جو کچھ یہ لوگ کہہ رہے ہیں آپ کو اس سے کہیں بہتر چیزیں دنیا ہی میں دے دے، ایک باغ نہیں بے شمار باغات دے دے، جن کے نیچے نہریں بہتی ہوں اور ایک محل نہیں بہت سے محل عطا کر دے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) { بَلْ كَذَّبُوْا بِالسَّاعَةِ … :} پچھلی آیت کے ساتھ اس کا تعلق یہ ہے کہ اگر اللہ تعالیٰ آپ کو اس سے کہیں بہتر چیزیں عطا کر بھی دے تو سوال یہ ہے کہ کیا یہ لوگ ایمان لے آئیں گے؟ یقینی جواب اس کا یہ ہے کہ یہ لوگ پھر بھی ایمان نہیں لائیں گے، بلکہ پھر اور قسم کی باتیں بنانا شروع کر دیں گے۔ وجہ یہ ہے کہ یہ لوگ سرے سے قیامت کے دن کو، دوبارہ جی اٹھنے کو، اللہ کے سامنے حاضر ہونے کو اور اپنے برے اعمال کی سزا بھگتنے کو تسلیم کرنے کے لیے تیار نہیں، بلکہ انھوں نے اسے صاف جھٹلا دیا ہے، کیونکہ اس سے انھیں دنیا میں اپنی خواہش پرستی سے دست بردار ہونا پڑتا ہے، پھر اگر یہ لوگ ایسی کٹ حجتیاں نہ کریں تو اور کریں بھی کیا؟ دیکھیے سورۂ قیامہ کی آیات (۱ تا ۶)۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) { اِذَا رَاَتْهُمْ مِّنْ مَّكَانٍۭ بَعِيْدٍ …:} جہنم جب ان کافروں کو بہت دور سے دیکھے گی تو وہ جہنم کی ایسی آواز سنیں گے جو شدید غصے والی اور گدھے کی آواز جیسی ہو گی۔ اس وقت جہنم کے غصے کا حال سورۂ ملک (۶ تا ۸) میں بیان ہوا ہے۔ اس سے جہنم کا صاحب شعور ہونا ثابت ہوتا ہے، اس کے علاوہ بھی کئی آیات و احادیث سے جہنم کا صاحب شعور ہونا، غصے ہونا، گدھے جیسی آواز نکالنا، کلام کرنا سب کچھ ثابت ہے، جیسا کہ فرمایا : «{ يَوْمَ نَقُوْلُ لِجَهَنَّمَ هَلِ امْتَلَاْتِ وَ تَقُوْلُ هَلْ مِنْ مَّزِيْدٍ }» [ قٓ : ۳۰ ] ’’جس دن ہم جہنم سے کہیں گے کیا تو بھر گئی؟ اور وہ کہے گی کیا کچھ مزید ہے؟‘‘ اور صحیح بخاری میں جنت اور جہنم کے آپس میں جھگڑنے کا ذکر آیا ہے، جس میں اللہ تعالیٰ کے جہنم کے اندر قدم (پاؤں) رکھنے پر اس کے قط قط (بس بس) کہنے کا ذکر ہے۔ [ دیکھیے بخاري، التفسیر، باب قولہ : « و تقول ھل من مزید » : ۴۸۴۸، ۴۸۴۹ ] اور بخاری ہی میں جہنم کے اللہ تعالیٰ سے اپنی شدید گرمی کی شکایت کرنے اور اللہ تعالیٰ کی طرف سے اسے سال میں دو سانس نکالنے کی اجازت ملنے کی حدیث موجود ہے۔ [ دیکھیے بخاري، بدء الخلق، باب صفۃ النار وأنہا مخلوقۃ : ۳۲۶۰ ] جہنم کے شعور، اس کی تندی اور سرکشی کے لیے دیکھیے سورۂ فجر (۲۳) کی تفسیر۔ بعض عقل پرست حضرات ان تمام آیات و احادیث کو مجاز پر محمول کرتے ہیں، مگر اہل السنہ اسے حقیقت مانتے ہیں، کیونکہ مجاز اس وقت مانا جاتا ہے جب حقیقت ناممکن ہو۔ اللہ تعالیٰ کا جہنم کو شعور، رؤیت اور کلام عطا کرنا کچھ مشکل نہیں۔ اگر بے جان حنانہ (ستون) کے رونے کی آواز صحابہ کرام رضی اللہ عنھم سن سکتے ہیں تو جہنمی جہنم کے غصے کی آواز کیوں نہیں سن سکتے اور جہنم انھیں دور سے کیوں نہیں دیکھ سکتی؟ اور اگر اللہ تعالیٰ گوشت کے ایک ٹکڑے (زبان) کو بولنے کی قوت عطا کر سکتا ہے تو وہ کسی بھی چیز میں یہ قوت کیوں پیدا نہیں کر سکتا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کے قریب مسلمانوں اور یہودیوں کی جنگ میں غرقد کے سوا ہر درخت اور پتھر مومن کو بول کر بتائے گا کہ یہ یہودی میرے پیچھے چھپا ہوا ہے اسے قتل کر دے۔ [ دیکھیے مسلم، الفتن و أشراط الساعۃ، باب لا تقوم الساعۃ حتی… : ۲۹۲۲ ] اور ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَالَّذِيْ نَفْسِيْ بِيَدِهِ، لَا تَقُوْمُ السَّاعَةُ حَتّٰی تُكَلِّمَ السِّبَاعُ الْإِنْسَ، وَ حَتّٰی تُكَلِّمَ الرَّجُلَ عَذَبَةُ سَوْطِهِ وَ شِرَاكُ نَعْلِهِ وَ تُخْبِرُهُ فَخِذُهُ بِمَا أَحْدَثَ أَهْلُهُ بَعْدَهُ ] [ ترمذي، االفتن، باب ما جاء في کلام السباع : ۲۱۸۱، وقال الألباني صحیح ] ’’اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! قیامت قائم نہیں ہو گی حتیٰ کہ درندے انسانوں سے کلام کریں گے اور آدمی سے اس کے کوڑے کا سرا اور جوتے کا تسمہ کلام کرے گا اور اس کی ران اسے بتائے گی کہ اس کے اہل نے اس کے بعد کیا گناہ کیا ہے۔‘‘ عقل پرست حضرات ان تمام مقامات پر تاویل کرتے جائیں تو اکثر آیات و احادیث کھلونا بن کر رہ جائیں گی، جن سے یہ لوگ جس طرح چاہیں گے کھیلیں گے اور جو مطلب چاہیں گے نکالتے رہیں گے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {وَ اِذَاۤ اُلْقُوْا مِنْهَا مَكَانًا ضَيِّقًا …:’’ مُقَرَّنِيْنَ ‘‘ ’’قَرَنَ الثَّوْرَيْنِ‘‘} (ض) اس نے دو بیل ایک لکڑی میں اکٹھے جوڑ دیے۔ {’’ قَرَنَ الْبَعِيْرَيْنِ‘‘} اس نے دو اونٹ ایک رسی میں اکٹھے باندھ دیے۔ {’’ مُقَرَّنِيْنَ ‘‘} باب تفعیل سے اسم مفعول ہے، اس میں باندھنے کی شدت کا اظہار ہو رہا ہے۔ اس سے دو چیزوں کا مفہوم ظاہر ہوتا ہے، ایک ان کے ہاتھوں، پاؤں اور گردنوں کا زنجیروں سے بندھا ہوا ہونا اور دوسرا ایک قسم کے کئی مجرموں کا ایک ہی جگہ ہونا۔ (دیکھیے نمل : ۸۳۔ حم السجدہ : ۱۹) یعنی جہنم میں ہر مجرم کے لیے اتنی تنگ جگہ ہو گی جہاں سے وہ ہل بھی نہیں سکے گا، اس کے علاوہ ایک ہی قسم کے کئی مجرم ایک ساتھ ہوں گے۔ (دیکھیے ابراہیم : ۴۹۔ ہمزہ : ۸، ۹) جہنم کی آگ کی لپٹیں انھیں ہر طرف سے گھیرے ہوئے ہو ں گی، اس وقت وہ سخت مصیبت سے گھبرا کر موت کو پکاریں گے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یعنی ایک بار مریں تو چھوٹ جائیں، دن میں ہزار بار مرنے سے بدتر حال ہوتا ہے۔‘‘ (موضح)"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) { لَا تَدْعُوا الْيَوْمَ ثُبُوْرًا وَّاحِدًا …:} یعنی انھیں یہ جواب دیا جائے گا۔ دیکھیے سورۂ زخرف (۷۷) اور مومن (۴۹، ۵۰)۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { قُلْ اَذٰلِكَ خَيْرٌ اَمْ جَنَّةُ الْخُلْدِ …:} یعنی آپ ان مشرکوں سے کہیں کہ اس طرح جکڑے ہوئے جہنم کی تنگ جگہ میں ہر وقت موت کی آرزو کرتے رہنا بہتر ہے، یا جنتِ خلد (ہمیشگی کی جنت)؟ یہ سوال پوچھنے کے لیے نہیں بلکہ ڈانٹنے کے لیے ہے، کیونکہ جنت اور جہنم کے درمیان بہتر ہونے کا کوئی مقابلہ ہی نہیں۔ ¤ ➋ { الَّتِيْ وُعِدَ الْمُتَّقُوْنَ :} متقی سے مراد وہ شخص ہے جو کم از کم شرک سے بچے، اس کے بعد گناہ سے بچنے کے لحاظ سے متقین کے بے شمار درجے ہیں اور حسبِ مراتب سب کے ساتھ جنت کا وعدہ ہے۔ البتہ مشرک کبھی جنت میں نہیں جائے گا، فرمایا : «{ اِنَّهٗ مَنْ يُّشْرِكْ بِاللّٰهِ فَقَدْ حَرَّمَ اللّٰهُ عَلَيْهِ الْجَنَّةَ وَ مَاْوٰىهُ النَّارُ وَ مَا لِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ }» [ المائدۃ :۷۲ ] ’’بے شک حقیقت یہ ہے کہ جو بھی اللہ کے ساتھ شریک بنائے، سو یقینا اس پر اللہ نے جنت حرام کر دی اور اس کا ٹھکانا آگ ہے اور ظالموں کے لیے کوئی مدد کرنے والے نہیں۔‘‘"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {لَهُمْ فِيْهَا مَا يَشَآءُوْنَ خٰلِدِيْنَ:’’ لَهُمْ ‘‘} اور {’’ فِيْهَا ‘‘} کو پہلے لانے میں حصر کا مفہوم ہے، یعنی یہ نعمت کہ جو چاہیں مل جائے، صرف متقی لوگوں کو حاصل ہو گی اور انھیں بھی صرف جنت میں ملے گی۔ دنیا میں یہ نعمت نہ متقی لوگوں کو حاصل ہے نہ غیر متقی لوگوں کو۔ دنیا میں ہر ایک کا حال وہ ہے جو شاعر نے بیان کیا ہے: ¤ {مَا كُلُّ مَا يَتَمَنَّي الْمَرْءُ يُدْرِكُهُ ¤ تَجْرِي الرِّيَاحُ بِمَا لَا تَشْتَهِي السُّفُنُ}  ¤ ’’ایسا نہیں کہ آدمی جو بھی تمنا کرے اسے حاصل ہی کر لے، کیونکہ ہوائیں کشتیوں کی خواہش کے خلاف چلا کرتی ہیں۔‘‘ ¤ سورۂ حٰمٓ السجدہ کی آیت(۳۱) : « وَ لَكُمْ فِيْهَا مَا تَشْتَهِيْۤ اَنْفُسُكُمْ وَ لَكُمْ فِيْهَا مَا تَدَّعُوْنَ» میں بھی اسی آیت کا مضمون بیان ہوا  ہے۔ ¤ ➋ یہاں ایک سوال کیا جاتا ہے کہ جنتیوں کو جب ہر وہ چیز ملے گی جس کی وہ خواہش کریں گے تو اگر وہ نبیوں کے مرتبے کی خواہش کریں تو کیا انھیں وہ بھی حاصل ہو جائے گا؟ جواب اس کا یہ ہے کہ اللہ کی طرف سے ان کے دلوں میں ایسی تمنا پیدا ہی نہیں ہو گی، وہ سب اپنے اپنے شغل ہی میں خوش ہوں گے اور سب حسد اور تنافس سے پاک اپنی حالت پر خوش ہوں گے، جیسا کہ فرمایا : «{ اِنَّ اَصْحٰبَ الْجَنَّةِ الْيَوْمَ فِيْ شُغُلٍ فٰكِهُوْنَ }» [ یٰسٓ : ۵۵ ] ’’بے شک جنت کے رہنے والے آج ایک شغل میں خوش ہیں۔‘‘ اور جنت میں درجوں کا تفاوت اللہ تعالیٰ کی طرف سے طے ہے۔ ابوسعید خدری رضی اللہ عنہ فرماتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَهْلَ الْجَنَّةِ يَتَرَاءَ وْنَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ كَمَا يَتَرَاءَوْنَ الْكَوْكَبَ الدُّرِّيَّ الْغَابِرَ فِي الْأُفُقِ مِنَ الْمَشْرِقِ أَوِ الْمَغْرِبِ لِتَفَاضُلِ مَا بَيْنَهُمْ ] [ بخاري، بدء الخلق، باب ما جاء في صفۃ الجنۃ … : ۳۲۵۶ ] ’’اہلِ جنت اپنے اوپر کے بالاخانوں والوں کو اس طرح دیکھیں گے جیسے وہ نہایت چمک دار تارے کو دیکھتے ہیں، جو مشرق یا مغرب کے دور افق میں ہوتا ہے، ان کی ایک دوسرے کے درمیان درجوں کی برتری کی وجہ سے۔‘‘ ¤ ➌ { كَانَ عَلٰى رَبِّكَ وَعْدًا مَّسْـُٔوْلًا :} اس کے دو معنی ہو سکتے ہیں، ایک یہ کہ یہ وعدہ اس قابل ہے کہ اللہ تعالیٰ سے اس کے پورا کرنے کی دعا کی جائے، یا یہ ایسا وعدہ ہے جو مانگنے پر یقینا پورا کیا جائے گا، جیسا کہ اللہ تعالیٰ نے {’’ اُولُوا الْاَلْبَابِ ‘‘} (مومنوں) کی دعا ذکر فرمائی ہے، جو وہ کیا کرتے ہیں : «{ رَبَّنَا وَ اٰتِنَا مَا وَعَدْتَّنَا عَلٰى رُسُلِكَ وَ لَا تُخْزِنَا يَوْمَ الْقِيٰمَةِ اِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ }» [آل عمران : ۱۹۴ ] ’’اے ہمارے رب! اور ہمیں عطا فرما جس کا وعدہ تو نے ہم سے اپنے رسولوں کی زبانی کیا ہے اور ہمیں قیامت کے دن رسوا نہ کر، بے شک تو وعدے کی خلاف ورزی نہیں کرتا۔‘‘ طبری نے بعض اہل عربیت سے {’’ وَعْدًا مَّسْـُٔوْلًا ‘‘} کا معنی {’’ وَعْدًا وَاجِبًا ‘‘} نقل فرمایا ہے، کیونکہ جس چیز کا سوال یا مطالبہ ہو سکتا ہو وہ واجب ہوتی ہے، خواہ مطالبہ نہ ہی کیا جائے، مثلاً قرض، جیسا کہ عرب کہتے ہیں : {’’ لَأُعْطِيَنَّكَ أَلْفًا وَّعْدًا مَسْؤلًا‘‘} ’’میں تمھیں ایک ہزار دوں گا، یہ مسؤل وعدہ ہے۔‘‘ یعنی تمھارے لیے واجب ہے، تم اس کا سوال اور مطالبہ کر سکتے ہو۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { وَ يَوْمَ يَحْشُرُهُمْ وَ مَا يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ …:} قیامت کے دن اللہ تعالیٰ غیر اللہ کی پرستش کرنے والوں کو اور ان سب کو اکٹھا کرے گا جن کی وہ پرستش کرتے رہے تھے۔ ان میں فرشتے بھی ہوں گے، انبیاء بھی، جیسے عیسیٰ اور عزیر علیھما السلام اور اللہ کے کئی دوسرے نیک بندے بھی، حیوانات بھی ہوں گے، جیسے گائے، سانپ اور بندر وغیرہ، نباتات بھی ہوں گے، جیسے پیپل وغیرہ اور جمادات بھی ہوں گے، جیسے بت وغیرہ۔ اللہ تعالیٰ بے شعور اور بے جان چیزوں کو بھی شعور اور بولنے کی قوت عطا فرمائے گا اور ان سب سے پوچھے گا کہ کیا تم نے میرے ان بندوں کو گمراہ کیا، یا یہ خود ہی سیدھے راستے سے بھٹک گئے تھے؟ ¤ ➋ اللہ تعالیٰ کو ہر چیز کا پہلے ہی علم ہے، اس سوال سے مقصود ایک تو غیر اللہ کی پرستش کرنے والوں کو لاجواب اور ذلیل و رسوا کرنا ہو گا، دوسرا ان کی پاک باز ہستیوں کی زبانی شرک سے بے زاری کا اعلان ہو گا۔ ¤ ➌ {’’ وَ مَا يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ ‘‘} میں لفظ {’’ مَا ‘‘} استعمال ہوا ہے، جو عموماً غیر عاقل چیزوں کے لیے آتا ہے، حالانکہ وہ انبیاء و اولیاء کی بھی پرستش کرتے تھے۔ شاید ایسا اللہ تعالیٰ کے مقابلے میں ان کی حیثیت ظاہر کرنے کے لیے کیا گیا ہے، یا اس لیے کہ {’’ مَا ‘‘} عاقل اور غیر عاقل دونوں کے لیے آتا ہے، اگرچہ اکثر غیر عاقل چیزوں کے لیے آتا ہے۔ ¤ ➍ یہ مضمون قرآن مجید میں کئی مقامات پر آیا ہے، فرشتوں سے سوال کے لیے دیکھیے سورۂ سبا (۴۰، ۴۱) اور مسیح علیہ السلام سے سوال کے لیے دیکھیے سورۂ مائدہ (۱۱۶)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { قَالُوْا سُبْحٰنَكَ مَا كَانَ يَنْۢبَغِيْ لَنَاۤ … :} یعنی جب ہم خود تیرے سوا کسی کو یارو مددگار نہیں سمجھتے تھے اور تیری توحید پر قائم تھے، تو لوگوں کو اپنے بارے میں کس طرح کہہ سکتے تھے کہ تم اللہ کے بجائے ہمیں اپنا حاجت روا اور مشکل کشا بنا لو۔ یہ بات تو ہمیں زیب ہی نہیں دیتی۔ دیکھیے آل عمران (۷۹، ۸۰)۔ ¤ ➋ {وَ لٰكِنْ مَّتَّعْتَهُمْ وَ اٰبَآءَهُمْ …: ’’ بُوْرًا ‘‘ ’’ بَارَ يَبُوْرُ ‘‘} سے مصدر بمعنی اسم فاعل برائے مبالغہ ہے، یا {’’بَائِرٌ‘‘} کی جمع ہے، ہلاک ہونے والے، یعنی ہم نے انھیں گمراہ نہیں کیا، بلکہ یہ خود ہی کم ظرف اور کمینے لوگ تھے، تو نے انھیں اور ان کے آبا و اجداد کو ہر قسم کا رزق دیا، یہ کھا پی کر نمک حرام ہو گئے، حتیٰ کہ تیری یاد بھی بھول گئے، جو انھیں سب نعمتیں دینے والا تھا۔ {’’ الذِّكْرَ ‘‘} کا دوسرا معنی یہ ہے کہ یہ لوگ وہ نصیحتیں بھول گئے جو انبیاء نے انھیں کی تھیں۔ دیکھیے سورۂ انبیاء (۴۴)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { فَقَدْ كَذَّبُوْكُمْ بِمَا تَقُوْلُوْنَ :} یہ اللہ تعالیٰ کا قول ہے جو وہ مشرکین سے مخاطب ہو کر فرمائے گا کہ تم نے جنھیں معبود بنا رکھا تھا انھوں نے تو تمھیں تمھاری بات میں جھٹلا دیا اور تم سے بری ہو گئے۔ قیامت کے دن تمام خود ساختہ معبودوں کا اپنے پوجنے والوں سے بری ہونا اور ان کا دشمن بن جانا قرآن میں متعدد مقامات پر آیا ہے، دیکھیے سورۂ یونس (۲۸)، نحل (۸۶)، مریم (۸۲)، فاطر (۱۳، ۱۴) اور احقاف (۶)۔ ¤ ➋ {فَمَا تَسْتَطِيْعُوْنَ۠ صَرْفًا وَّ لَا نَصْرًا:} یعنی جن سے تم مدد کی توقع رکھتے تھے وہ تمھارے دشمن بن گئے، تو اب تم عذاب سے کسی طرح نہیں بچ سکتے، نہ اسے اپنے آپ سے کسی سفارش یا فدیے سے ہٹا سکتے ہو اور نہ ہی خود یا کوئی اور تمھاری مدد کو آ سکتا ہے۔ ¤ ➌ { وَ مَنْ يَّظْلِمْ مِّنْكُمْ نُذِقْهُ عَذَابًا كَبِيْرًا :} ظلم سے مراد شرک ہے، دیکھیے سورۂ انعام کی آیت (۸۲) : «{ اَلَّذِيْنَ اٰمَنُوْا وَ لَمْ يَلْبِسُوْۤا اِيْمَانَهُمْ بِظُلْمٍ }» کی تفسیر اور عذابِ کبیر سے مراد جہنم ہے۔ مطلب یہ کہ تم سب نے ظلم کا ارتکاب کیا، اس لیے ہم تمھیں جہنم کا عذاب چکھائیں گے، یعنی جہنم میں پھینکنے کی وجہ بیان فرمائی ہے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { وَ مَاۤ اَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِيْنَ … :} یہ اس اعتراض کا جواب ہے کہ یہ کیسا رسول ہے جو کھاتا پیتا ہے اور بازاروںمیں چلتا پھرتا ہے؟ فرمایا، پہلے تمام رسول بھی کھاتے پیتے تھے اور روزی کمانے کے لیے اور ضرورت کی چیزیں خریدنے کے لیے بازاروں میں جاتے تھے، بشر تھے فرشتے نہ تھے۔ (دیکھیے یوسف : ۱۰۹۔ انبیاء : ۷، ۸) اگر کھانے پینے اور بازاروں میں چلنے پھرنے کے باوجود تم انھیں رسول مانتے ہو، جیسا کہ تم ابراہیم اور اسماعیل علیھما السلام کی اولاد ہونے اور ان کی ملت ہونے پر فخر کرتے ہو، نوح، موسیٰ اور عیسیٰ علیھم السلام کو پیغمبر مانتے ہو، تو اس رسول پر ایمان کیوں نہیں لاتے؟ ¤ ➋ { وَ جَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً اَتَصْبِرُوْنَ:} یہ اس سوال کا جواب ہے کہ پیغمبر کو سونے چاندی کے خزانے اور باغات و محلات کیوں عطا نہیں کیے گئے؟ فرمایا : ’’ہم نے تمھارے بعض کو بعض کے لیے آزمائش بنایا ہے‘‘ مطلب یہ ہے کہ اللہ تعالیٰ عموماً انبیاء کو دنیاوی لحاظ سے معمولی حالت میں رکھتا ہے، ورنہ اگر وہ انھیں دنیا کثرت کے ساتھ دیتا تو بہت سے لوگ مال کے لالچ میں ان کے ساتھ ہو جاتے، سچے جھوٹے مل جل جاتے اور امتحان کا مقصد فوت ہو جاتا۔ عیاض بن حمار رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بیان کرتے ہیں کہ اللہ تعالیٰ فرماتے ہیں : [ إِنَّمَا بَعَثْتُكَ لِأَبْتَلِيَكَ وَ أَبْتَلِيَ بِكَ وَ أَنْزَلْتُ عَلَيْكَ كِتَابًا لَا يَغْسِلُهُ الْمَاءُ تَقْرَأُهُ نَائِمًا وَ يَقْظَانَ ] [ مسلم، الجنۃ و صفۃ نعیمھا و أھلھا ، باب الصفات التي یعرف بہا … : ۲۸۶۵ ] ’’میں نے تجھے صرف اس لیے بھیجا ہے کہ تیری آزمائش کروں اور تیرے ساتھ (لوگوں کی) آزمائش کروں اور میں نے تجھ پر ایسی کتاب نازل کی ہے جسے پانی نہیں دھو سکتا، تو اسے سوتے جاگتے پڑھے گا۔‘‘ ¤ الغرض! اللہ تعالیٰ نے تمام لوگوں کو ان کے مختلف حالات کی وجہ سے ایک دوسرے کے لیے آزمائش بنایا ہے، چنانچہ رسول اور اہل ایمان منکرین کے لیے آزمائش ہیں اور منکرین کے لیے رسول اور اہل ایمان آزمائش ہیں۔ غنی فقیر کے لیے آزمائش ہیں، تندرست بیمار کے لیے آزمائش ہیں کہ وہ اپنے سے برتر کو دیکھ کر اپنی حالت پر صبر کرتے ہیں یا نہیں۔ فقیر اور بیمار غنی اور تندرست کے لیے آزمائش ہیں کہ وہ اپنے سے کم تر کو دیکھ کر شکر کرتے ہیں یا نہیں۔ حقیقت ہے کہ شکر کی بنیاد بھی صبر ہے، جو اپنی حالت پر صابر نہیں وہ کبھی شاکر نہیں ہو سکتا، اس لیے اللہ تعالیٰ نے صبر کی تلقین کرتے ہوئے فرمایا : «{ اَتَصْبِرُوْنَ }» ’’کیا تم صبر کرتے ہو۔‘‘ مطلب یہ ہے کہ صبر کرو۔ ¤ ➌ { وَ كَانَ رَبُّكَ بَصِيْرًا :} اس کے دو معنی ہیں اور دونوں ہی یہاں مناسبت رکھتے ہیں، ایک یہ کہ تمھارا رب جو کچھ کر رہا ہے دیکھ کر ہی کر رہا ہے، اس کے ہر کام میں حکمت ہے۔ دوسرا یہ کہ تم جس صدق اور خلوص کے ساتھ کفار کی مخالفت برداشت کرو گے وہ اسے دیکھ رہا ہے اور وہ کبھی تمھاری محنت کی بے قدری نہیں کرے گا۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ {وَ قَالَ الَّذِيْنَ لَا يَرْجُوْنَ لِقَآءَنَا …:} یہ نبی صلی اللہ علیہ وسلم کی نبووت کے منکروں کا چوتھا اعتراض ہے، اللہ تعالیٰ نے {’’وَقَالُوْا‘‘} (اور انھوں نے کہا) یا {’’وَ قَالَ الَّذِيْنَ كَفَرُوْا‘‘} ( اور ان لوگوں نے کہا جنھوں نے کفر کیا) کہنے کے بجائے فرمایا : «{وَ قَالَ الَّذِيْنَ لَا يَرْجُوْنَ لِقَآءَنَا }» (اور ان لوگوں نے کہا جو  ہماری ملاقات کی امید نہیں رکھتے) یعنی انھیں اتنی گستاخی کی جرأت اس لیے ہوئی کہ وہ ہماری ملاقات کی امید نہیں رکھتے۔ یقین تو دور، اگر انھیں قیامت کی اور ہمارے سامنے پیش ہونے کی امید بھی ہوتی تو اتنی بڑی بات ان کے منہ سے نہ نکلتی۔ ¤ ➋ منکرین نے کہا کہ (اس نبی پر فرشتہ وحی لے کر اترتا ہے تو) ہم پر فرشتے کیوں نازل نہیں کیے گئے، یا ایسا کیوں نہیں ہوا کہ ہم اپنے رب کو (اپنی آنکھوں سے) دیکھ لیتے؟ یہ ایسی بات ہے کہ کسی انسان کا حق نہیں کہ زبان پر لانے کی جرأت کرے، کیونکہ یہ اس ذات پاک پر اعتراض ہے جس کی عظمت کی کوئی حد ہے نہ کوئی اس کی حکمتیں معلوم کر سکتا ہے۔ اس لیے اللہ تعالیٰ نے قسم کا مفہوم رکھنے والے الفاظ {’’ لَقَدْ ‘‘} کے ساتھ فرمایا کہ مجھے قسم ہے کہ یہ لوگ اپنے دلوں میں بہت بڑے بن گئے اور انھوں نے ایسی سرکشی اختیار کی جو بہت بڑی سرکشی ہے۔ حالانکہ نہ حقیقت میں انھیں کوئی بڑائی حاصل ہے نہ لوگوں کی نگاہ میں۔ آیت کا ایک مطلب یہ بھی ہو سکتا ہے کہ ایسا کیوں نہیں ہوا کہ اس نبی کے ساتھ فرشتے اترتے، یا خود رب تعالیٰ سامنے آ کر اس کی تصدیق کرتا۔ گویا ان کے لیے نبی کے واضح معجزات خصوصاً قرآن کی کوئی حیثیت نہیں، جس کی ایک سورت کی مثل وہ نہیں لا سکے۔ ¤ ➌ کفار کا یہ اعتراض اللہ تعالیٰ نے دوسرے کئی مقامات پر بھی ذکر فرمایا ہے۔ چنانچہ سورۂ انعام میں فرمایا : «{ وَ اِذَا جَآءَتْهُمْ اٰيَةٌ قَالُوْا لَنْ نُّؤْمِنَ حَتّٰى نُؤْتٰى مِثْلَ مَاۤ اُوْتِيَ رُسُلُ اللّٰهِ اَللّٰهُ اَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهٗ سَيُصِيْبُ الَّذِيْنَ اَجْرَمُوْا صَغَارٌ عِنْدَ اللّٰهِ  وَ عَذَابٌ شَدِيْدٌۢ بِمَا كَانُوْا يَمْكُرُوْنَ }» [ الأنعام : ۱۲۴ ] ’’اور جب ان کے پاس کوئی نشانی آتی ہے تو کہتے ہیں ہم ہر گز ایمان نہیں لائیں گے، یہاں تک کہ ہمیں اس جیسا دیا جائے جو اللہ کے رسولوں کو دیا گیا، اللہ زیادہ جاننے والا ہے جہاں وہ اپنی رسالت رکھتا ہے۔ عنقریب ان لوگوں کو جنھوں نے جرم کیے، اللہ کے ہاں بڑی ذلت پہنچے گی اور بہت سخت عذاب، اس وجہ سے کہ وہ فریب کیا کرتے تھے۔‘‘ اور سورۂ بنی اسرائیل کی آیات (۹۰ تا ۹۳) میں ان مطالبات کا ذکر ہے جو انھوں نے رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے کی شرط کے طور پر پیش کیے تھے، ان میں سے ایک مطالبہ یہ تھا : «{ اَوْ تَاْتِيَ بِاللّٰهِ وَ الْمَلٰٓىِٕكَةِ قَبِيْلًا }» [ بني إسرائیل : ۹۲ ] ’’یا تو اللہ اور فرشتوں کو سامنے لے آئے۔‘‘ ¤ ➍ اللہ تعالیٰ نے اسے بہت بڑا تکبر اور بہت بڑی سرکشی اس لیے قرار دیا کہ انھوں نے اپنے ہر شخص کے لیے نبی کا مرتبہ ملنے کا مطالبہ کیا جو فرشتے کے نزول کی وجہ سے اسے حاصل ہوتا ہے۔ (دیکھیے مدثر : ۵۲، ۵۳) پھر یہیں تک نہیں رہے، بلکہ کئی فرشتوں کے نزول کا مطالبہ کیا جو ان کے پاس اللہ کا پیغام لے کر آئیں۔ اس سے بھی بڑھے تو رب تعالیٰ کو دیکھنے کا مطالبہ کر دیا۔ گویا ان چیزوں کا مطالبہ کر دیا جو نبیوں کو بھی عطا نہیں ہوئیں۔ یہاں سوال پیدا ہوتا ہے کہ اللہ تعالیٰ کو دیکھنے کا سوال تو موسیٰ علیہ السلام نے بھی کیا تھا، اسے تکبر کیوں نہیں کہا گیا؟ جواب یہ ہے کہ موسیٰ علیہ السلام نے اللہ تعالیٰ کے دیدار کا مطالبہ ایمان کی شرط کے طور پر نہیں کیا تھا بلکہ شوق کے تقاضے سے کیا تھا۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ { يَوْمَ يَرَوْنَ الْمَلٰٓىِٕكَةَ لَا بُشْرٰى يَوْمَىِٕذٍ لِّلْمُجْرِمِيْنَ:} یعنی رب تعالیٰ کو دیکھنا تو بہت دور، فرشتوں کو دیکھنا بھی معمولی بات نہیں، جس دن وہ فرشتوں کو دیکھیں گے اس دن ان مجرموں کے لیے کوئی خوشی کی خبر نہیں ہو گی، کیونکہ وہ ان کے لیے عذاب ہی لے کر آتے ہیں (حجر : ۸) خواہ وہ دنیا میں کوئی عذاب لے کر آئیں یا موت کے وقت ان کے پاس آئیں (انعام : ۹۳۔ انفال : ۵۰۔ محمد : ۲۷، ۲۸) یا قیامت کے دن انھیں دکھائی دیں۔ ¤ ➋ { وَ يَقُوْلُوْنَ حِجْرًا مَّحْجُوْرًا: ’’ حِجْرًا ‘‘} کا معنی آڑ، رکاوٹ ہے، {’’ مَحْجُوْرًا ‘‘} تاکید کے لیے ہے، یعنی بہت مضبوط رکاوٹ۔ یعنی جب مجرم فرشتوں کو دیکھیں گے تو چاہیں گے کہ ان کے اور فرشتوں کے درمیان کوئی مضبوط آڑ ہو، کوئی سخت رکاوٹ ہو جس کے ذریعے سے وہ ان سے بچ جائیں۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) {وَ قَدِمْنَاۤ اِلٰى مَا عَمِلُوْا مِنْ عَمَلٍ …: ’’ هَبَآءً ‘‘} غبار کے ان ذرّات کو کہتے ہیں جو روشن دان کے ذریعے سے کمرے میں آنے والی دھوپ میں چمک رہے ہوتے ہیں، پکڑنا چاہیں تو کچھ ہاتھ نہیں آتا۔ کوئی شخص جسے کسی چیز سے شدید کراہت و نفرت ہو وہ اسے کسی دوسرے کے ہاتھوں تباہ و برباد کرنے پر قناعت نہیں کرتا، بلکہ وہ خود اسے تباہ و برباد کرتا ہے، اس لیے فرمایا کہ جس دن وہ فرشتوں کو دیکھیں گے، دنیا میں دیکھیں یا آخرت میں، تو انھوں نے اپنے خیال میں جو بھی اچھا عمل کیا ہو گا، خواہ سخاوت ہو یا صلہ رحمی یا مظلوم کی مدد یا بیت اللہ کی آباد کاری اور حاجیوں کی خدمت وغیرہ، ہم خود اس کی طرف آئیں گے اور اسے بکھرا ہوا غبار بنا دیں گے، کیونکہ عمل کی قبولیت کے لیے ایمان، اخلاص اور اس کا شریعت کے مطابق ہونا ضروری ہے، جب کہ ان کے اعمال اس سے خالی تھے۔ روشن دان سے آنے والی روشنی میں سکون کی حالت میں غبار کے ذرات پھر بھی کچھ مرتب اور موجود نظر آتے ہیں، لیکن جب انھیں ہوا یا کوئی اور چیز حرکت دیتی ہے تو کچھ ہاتھ نہیں آتا اور وہ سب بکھر کر کالعدم ہو جاتے ہیں، اس لیے انھیں بکھرا ہوا غبار فرمایا۔ (بقاعی) کفار کے اعمال کو اللہ تعالیٰ نے کہیں {’’رَمَادٌ‘‘} (راکھ) کے ساتھ تشبیہ دی ہے (دیکھیے ابراہیم : ۱۸)، کہیں سراب کے ساتھ (دیکھیے نور : ۳۹) اور کہیں فرمایا کہ ہم ان کے لیے کوئی وزن قائم نہیں کریں گے۔ (دیکھیے کہف : ۱۰۵)۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { اَصْحٰبُ الْجَنَّةِ يَوْمَىِٕذٍ خَيْرٌ مُّسْتَقَرًّا …:} جہنمیوں کے ذکر کے ساتھ اہلِ جنت کا ذکر فرمایا کہ وہ اس دن کفار سے ٹھکانے کے اعتبار سے نہایت بہتر اور آرام گاہ کے اعتبار سے کہیں اچھے ہوں گے۔ یہاں ایک سوال پیدا ہوتا ہے کہ قیامت کے دن کفار کے لیے تو خیر کا وجود ہی نہیں ہو گا، پھر اہلِ جنت کا ٹھکانے اور آرام گاہ میں ان سے بہتر ہونے کا کیا مطلب ؟ جواب یہ ہے کہ دنیا میں کفار کو جو عیش و آرام میسر تھا اہلِ جنت اس دن اس سے کہیں اچھے ٹھکانے اور آرام گاہ میں ہوں گے، یا یہ بات جہنمیوں پر طنز کے طور پر کہی گئی ہے۔ ¤ ➋ { اَحْسَنُ مَقِيْلًا :} اصل میں {’’ مَقِيْلًا ‘‘ } کے لفظی معنی ہیں ’’قیلولہ کرنے کی جگہ‘‘ اور قیلولہ گرمی میں دوپہر کے آرام کو کہتے ہیں۔ اس آیت کی تفسیر میں عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں : [ لَا يَنْتَصِفُ النَّهَارُ مِنْ يَوْمِ الْقِيَامَةِ حَتّٰی يَقِيْلَ هٰؤُلَاءِ وَ هٰؤُلَاءِ ثُمَّ قَرَأَ : «{ اِنَّ مَرْجِعَهُمْ لَاۡاِلَى الْجَحِيْمِ }» ] [ مستدرک حاکم : 402/2، ح : ۳۵۱۶، صححہ الحاکم و وافقہ الذھبي ] ’’قیامت کے دن ابھی دوپہر نہ ہوئی ہو گی کہ یہ لوگ اور وہ لوگ دوپہر کا آرام کر رہے ہوں گے، پھر (کفار کے متعلق) یہ آیت پڑھی : «{اِنَّ مَرْجِعَهُمْ لَاۡاِلَى الْجَحِيْمِ }» [ الصافات : ۶۸ ] ’’بلاشبہ ان کی واپسی یقینا اسی بھڑکتی ہوئی آگ کی طرف ہو گی۔‘‘"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {وَ يَوْمَ تَشَقَّقُ السَّمَآءُ بِالْغَمَامِ …: ’’ يَوْمَ ‘‘} پر نصب محذوف {’’اُذْكُرْ‘‘} کی وجہ سے ہے، یعنی اس دن کو یاد کرو۔ {’’تَشَقَّقُ ‘‘} اصل میں {’’تَتَشَقَّقُ‘‘} ہے، تخفیف کے لیے ایک تاء حذف کر دی ہے۔ ’’آسمان باددل کے ساتھ پھٹ جائے گا‘‘ کا مطلب یہ ہے کہ آسمان پھٹ کر اس سے بادل نکلے گا، جیسا کہ کہا جاتا ہے : {’’ تَشَقَّقَتِ الْأَرْضُ بِالنَّبَاتِ ‘‘} ’’زمین نبات کے ساتھ پھٹی‘‘ یعنی زمین پھٹ کر اس میں سے نبات نکلی۔ یعنی اس دن کو یاد کرو جب آسمان پھٹ کر اس میں سے سائبانوں کی صورت ایک بادل نکلے گا، جس میں فرشتے جماعتوں کی صورت میں لگا تار میدانِ محشر میں اتارے جائیں گے، جو زمین پر ہو گا۔ ابن کثیر رحمہ اللہ نے فرمایا : ’’اللہ تعالیٰ قیامت کے دن کی ہولناکی اور اس میں واقع ہونے والے عظیم معاملات کا ذکر فرما رہے ہیں، جن میں سے آسمان کا پھٹنا اور بادلوں کے ساتھ اس کا کھل جانا بھی ہے، جو نور کے عظیم سائبانوں کی صورت میں ہوں گے۔ پھر فرشتے اتریں گے اور میدانِ محشر میں تمام انسانوں کو گھیر لیں گے، پھر اللہ اپنے بندوں میں فیصلے کے لیے تشریف لائے گا۔ مجاہد نے فرمایا، یہ اسی طرح ہو گا جیسا کہ اللہ تعالیٰ نے فرمایا : «{ هَلْ يَنْظُرُوْنَ اِلَّاۤ اَنْ يَّاْتِيَهُمُ اللّٰهُ فِيْ ظُلَلٍ مِّنَ الْغَمَامِ وَ الْمَلٰٓىِٕكَةُ وَ قُضِيَ الْاَمْرُ وَ  اِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ }» [ البقرۃ : ۲۱۰ ] ’’وہ اس کے سوا کس چیز کا انتظار کر رہے ہیں کہ ان کے پاس اللہ بادل کے سائبانوں میں آجائے اور فرشتے بھی اور کام تمام کر دیا جائے اور سب کام اللہ ہی کی طرف لوٹائے جاتے ہیں۔‘‘ ¤ اس دن کی کچھ کیفیت ان آیات میں بیان ہوئی ہے، فرمایا : «{ فَاِذَا نُفِخَ فِي الصُّوْرِ نَفْخَةٌ وَّاحِدَةٌ (13) وَّ حُمِلَتِ الْاَرْضُ وَ الْجِبَالُ فَدُكَّتَا دَكَّةً وَّاحِدَةً (14) فَيَوْمَىِٕذٍ وَّقَعَتِ الْوَاقِعَةُ (15) وَ انْشَقَّتِ السَّمَآءُ فَهِيَ يَوْمَىِٕذٍ وَّاهِيَةٌ (16) وَّ الْمَلَكُ عَلٰۤى اَرْجَآىِٕهَا وَ يَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَىِٕذٍ ثَمٰنِيَةٌ (17) يَوْمَىِٕذٍ تُعْرَضُوْنَ لَا تَخْفٰى مِنْكُمْ خَافِيَةٌ }» [ الحاقۃ : ۱۳ تا ۱۸ ] ’’پس جب صور میں پھونکا جائے گا، ایک بار پھونکنا۔ اور زمین اور پہاڑوں کو اٹھایا جائے گا، پس دونوں ٹکرا دیے جائیں گے، ایک بار ٹکرا دینا۔ تو اس دن ہونے والی ہو جائے گی۔ اور آسمان پھٹ جائے گا، پس وہ اس دن کمزور ہو گا۔ اور فرشتے اس کے کناروں پر ہوں گے اور تیرے رب کا عرش اس دن آٹھ (فرشتے) اپنے اوپر اٹھائے ہوئے ہوں گے۔ اس دن تم پیش کیے جاؤ گے، تمھاری کوئی چھپی ہوئی بات چھپی نہیں رہے گی۔‘‘ اور فرمایا : «{ وَ نُفِخَ فِي الصُّوْرِ فَصَعِقَ مَنْ فِي السَّمٰوٰتِ وَ مَنْ فِي الْاَرْضِ اِلَّا مَنْ شَآءَ اللّٰهُ ثُمَّ نُفِخَ فِيْهِ اُخْرٰى فَاِذَا هُمْ قِيَامٌ يَّنْظُرُوْنَ (68) وَ اَشْرَقَتِ الْاَرْضُ بِنُوْرِ رَبِّهَا وَ وُضِعَ الْكِتٰبُ وَ جِايْٓءَ بِالنَّبِيّٖنَ وَ الشُّهَدَآءِ وَ قُضِيَ بَيْنَهُمْ بِالْحَقِّ وَ هُمْ لَا يُظْلَمُوْنَ (69) وَ وُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَ هُوَ اَعْلَمُ بِمَا يَفْعَللُوْنَ}» [ الزمر : ۶۸ تا ۷۰ ] ’’اور صور میں پھونکا جائے گا تو جو لوگ آسمانوں میں اور جو زمین میں ہوں گے، مر کر گر جائیں گے مگرجسے اللہ نے چاہا، پھر اس میں دوسری دفعہ پھونکا جائے گا تو اچانک وہ کھڑے دیکھ رہے ہوں گے۔ اور زمین اپنے رب کے نور کے ساتھ روشن ہو جائے گی اور لکھا ہوا (سامنے) رکھا جائے گا اور نبی اور گواہ لائے جائیں گے اور ان کے درمیان حق کے ساتھ فیصلہ کر دیا جائے گا اور ان پر ظلم نہیں کیا جائے گا ۔ اور ہر شخص کو پورا پورا دیا جائے گا جو اس نے کیا اور وہ زیادہ جاننے والا ہے جو کچھ وہ کر رہے ہیں۔‘‘ اور فرمایا : «{ كَلَّاۤ اِذَا دُكَّتِ الْاَرْضُ دَكًّا دَكًّا (21) وَّ جَآءَ رَبُّكَ وَ الْمَلَكُ صَفًّا صَفًّا (22) وَ جِايْٓءَ يَوْمَىِٕذٍۭ بِجَهَنَّمَ١ۙ۬ يَوْمَىِٕذٍ يَّتَذَكَّرُ الْاِنْسَانُ وَ اَنّٰى لَهُ الذِّكْرٰى }» [ الفجر : ۲۱ تا ۲۳ ] ’’ہر گز نہیں، جب زمین کوٹ کوٹ کر ریزہ ریزہ کر دی جائے گی۔ اور تیرا رب آئے گا اور فرشتے جو صف در صف ہوں گے۔ اور اس دن جہنم کو لایا جائے گا، اس دن انسان نصیحت حاصل کرے گا اور ( اس وقت) اس کے لیے نصیحت کہاں۔‘‘ اتنی صریح آیات کے باوجود کئی بدنصیب قیامت کے دن اللہ تعالیٰ کے زمین پر نزول فرمانے کے منکر ہیں اور ایسی تاویلیں کرتے ہیں جو انکار سے بھی بدتر ہیں۔ مزید دیکھیے سورۂ بقرہ (۲۱۰)، فجر (۲۱ تا ۲۳) اور حاقہ (۱۶، ۱۷) کی تفسیر۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) { اَلْمُلْكُ يَوْمَىِٕذِ الْحَقُّ لِلرَّحْمٰنِ …:} یعنی دنیا کی وہ تمام عارضی اور مجازی حکومتیں ختم ہو جائیں گی، جن سے انسان دھوکے میں پڑا رہتا ہے اور ظاہراً، باطناً، صورتاً، یعنی ہر لحاظ سے اکیلے رحمان کی بادشاہت ہو گی اور صرف اسی کا حکم چلے گا اور وہ دن کافروں پر بہت سخت ہو گا۔ یہ بھی مومنوں پر اس کی رحمت کا تقاضا ہو گا، کیونکہ ان کے دشمنوں کو سزا دینے سے جو خوشی انھیں حاصل ہونی ہے وہ اور کسی طرح حاصل نہیں ہو سکتی؟ (بقاعی) عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَطْوِي اللّٰهُ عَزَّ وَ جَلَّ السَّمَاوَاتِ يَوْمَ الْقِيَامَةِ ثُمَّ يَأْخُذُهُنَّ بِيَدِهِ الْيُمْنٰی ثُمَّ يَقُوْلُ أَنَا الْمَلِكُ، أَيْنَ الْجَبَّارُوْنَ؟ أَيْنَ الْمُتَكَبِّرُوْنَ؟ ]] [ مسلم، صفات المنافقین، باب صفۃ القیامۃ والجنۃ والنار : ۲۷۸۸ ] ’’اللہ تعالیٰ قیامت کے دن آسمان کو لپیٹ دے گا، پھر انھیں اپنے دائیں ہاتھ میں پکڑ کر فرمائے گا، میں ہوں بادشاہ، کہاں ہیں جبار لوگ؟ کہاں ہیں متکبر لوگ؟‘‘ اور دیکھیے سورۂ زمر (۶۷) اور مومن (۱۶) کفار پر اس دن کے سخت ہونے اور مومنوں پر آسان ہونے کا مضمون دیکھیے سورۂ مدثر (۸ تا ۱۰) میں۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { وَ يَوْمَ يَعَضُّ الظَّالِمُ عَلٰى يَدَيْهِ:} ظالم سے مراد یہاں وہ مشرک ہے جس نے ایمان قبول نہیں کیا۔ اس کا قرینہ {’’ يٰلَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُوْلِ سَبِيْلًا ‘‘} ہے، یعنی وہ حسرت و افسوس اور ندامت سے ہاتھوں کو دانتوں سے کاٹے گا۔ ¤ ➋ { يَقُوْلُ يٰلَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُوْلِ سَبِيْلًا : ’’ سَبِيْلًا ‘‘} پر تنوین تنکیر کے لیے ہے، کوئی راستہ، کچھ راستہ، یعنی قیامت کے دن جب ایمان والوں کو، وہ خواہ کسی بھی درجے کا ایمان رکھتے ہوں، آخر کار جنت میں داخلہ ملے گا، تو اس وقت کافر کہے گا، کاش! میں نے رسول کے ساتھ کچھ ہی راستہ اختیار کیا ہوتا، کسی بھی درجے میں رسول کی رفاقت اختیار کی ہوتی۔ دیکھیے اس کی ہم معنی آیت : «{ رُبَمَا يَوَدُّ الَّذِيْنَ كَفَرُوْا لَوْ كَانُوْا مُسْلِمِيْنَ }» [ الحجر : ۲ ] کی تفسیر۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) {يٰوَيْلَتٰى لَيْتَنِيْ لَمْ اَتَّخِذْ … : ’’ يٰوَيْلَتٰى ‘‘} اصل میں {’’يَا وَيْلَتِيْ‘‘} ہے، جس میں لفظ {’’وَيْلَةٌ‘‘} یائے متکلم کی طرف مضاف ہے، جسے الف سے بدل دیا گیا ہے، معنی ہے میری ہلاکت، میری بربادی۔ یعنی کافر اپنی ہلاکت کو پکارے گا اور ان لوگوں کا نام لے کر کہے گا جنھوں نے اسے گمراہ کیا تھا کہ کاش! میں فلاں کو دلی دوست نہ بناتا۔ اللہ تعالیٰ نے ایک ایک کا نام لینے کے بجائے ہر شخص کے دلی دوست کے لیے {’’ فُلَانًا ‘‘} کا لفظ استعمال فرمایا ہے۔ کفار کی اس ندامت کا ذکر سورۂ بقرہ (۱۶۷) اور سورۂ احزاب (۶۶ تا ۶۸) میں بھی دیکھیے۔ اس سے معلوم ہوا آدمی کو خوب سوچ سمجھ کر دوست کا انتخاب کرنا چاہیے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلرَّجُلُ عَلٰی دِيْنِ خَلِيْلِهِ فَلْيَنْظُرْ أَحَدُكُمْ مَنْ يُّخَالِلُ ] [ أبوداوٗد، الأدب، باب من یؤمر أن یجالس : ۴۸۳۳، عن أبي ھریرۃ رضی اللہ عنہ و حسنہ الألباني ] ’’آدمی اپنے دوست کے دین پر ہوتا ہے، اس لیے تم میں سے ہر ایک کو دیکھنا چاہیے کہ وہ کسے دلی دوست بنا رہا ہے۔‘‘ اور آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَثَلُ الْجَلِيْسِ الصَّالِحِ وَالسَّوْءِ كَحَامِلِ الْمِسْكِ وَ نَافِخِ الْكِيْرِ، فَحَامِلُ الْمِسْكِ إِمَّا أَنْ يُّحْذِيَكَ وَ إِمَّا أَنْ تَبْتَاعَ مِنْهُ وَ إِمَّا أَنْ تَجِدَ مِنْهُ رِيْحًا طَيِّبَةً، وَ نَافِخُ الْكِيْرِ إِمَّا أَنْ يُحْرِقَ ثِيَابَكَ وَ إِمَّا أَنْ تَججِدَ رِيْحًا خَبِيْثَةً ] [ بخاري، الذبائح و الصید، باب المسک : ۵۵۳۴، عن أبي موسٰی رضی اللہ عنہ ] ’’نیک اور برے ہم نشین کی مثال کستوری رکھنے والے اور بھٹی دھونکنے والے کی ہے، کستوری رکھنے والا یا تو تجھے عطیہ دے دے گا، یا تو اس سے خرید لے گا، یا اس سے عمدہ خوشبو پاتا رہے گا اور بھٹی دھونکنے والا یا تو تیرے کپڑے جلا دے گا، یا تو اس سے گندی بو پاتا رہے گا۔‘‘"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { لَقَدْ اَضَلَّنِيْ عَنِ الذِّكْرِ بَعْدَ اِذْ جَآءَنِيْ :} اس میں اس تمنا کی وجہ  بیان کی ہے کہ کاش! میں فلاں کو دوست نہ بناتا۔ وہ یہ کہ میرے پاس ({الذِّكْرِ}) کامل نصیحت آئی، مگر اس دوست نے مجھے اس کو قبول کرنے سے بے راہ کر دیا۔ {’’ الذِّكْرِ ‘‘} سے مراد کے لیے دیکھیے سورۂ حجر (۶، ۹)۔ ¤ ➋ {وَ كَانَ الشَّيْطٰنُ … : ’’ الشَّيْطٰنُ ‘‘ ’’شَطْنٌ‘‘} سے مشتق ہے، جس کا معنی دوری بھی ہے اور خباثت بھی۔ شیطان ہر وہ خبیث شخص ہے جو حق سے دور ہو، خواہ انسان ہو یا جن، کیونکہ شیطان دونوں ہی میں پائے جاتے ہیں۔ دیکھیے سورۂ انعام (۱۱۲) {’’خَذُوْلًا ‘‘} چھوڑ جانے والا، {’’ كَانَ ‘‘} کی وجہ سے ’’ہمیشہ چھوڑ جانے والا‘‘ ترجمہ کیا گیا ہے، یعنی شیطان آدمی کو پہلے برے کام کی ترغیب دیتا ہے، جب آدمی وہ کام کر لیتا ہے اور مصیبت میں گرفتار ہو جاتا ہے تو اس کو چھوڑ کر الگ ہو جاتا ہے۔ دیکھیے سورۂ ابراہیم (۲۱، ۲۲) رہے دوست، تو قیامت کے دن متقی دوستوں کے سوا سب ایک دوسرے کے دشمن بن جائیں گے۔ دیکھیے سورۂ زخرف (۶۷)۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {وَ قَالَ الرَّسُوْلُ يٰرَبِّ اِنَّ قَوْمِي اتَّخَذُوْا …:} اس کے دو معنی ہو سکتے ہیں، ایک یہ کہ رسول اللہ صلی اللہ علیہ وسلم نے اللہ تعالیٰ سے یہ شکایت دنیا میں کی، کیونکہ کفار نے کہا تھا : «{ لَا تَسْمَعُوْا لِهٰذَا الْقُرْاٰنِ وَ الْغَوْا فِيْهِ لَعَلَّكُمْ تَغْلِبُوْنَ }» [ حٰمٓ السجدۃ : ۲۶ ] ’’اس قرآن کو مت سنو اور اس میں شور کرو، تاکہ تم غالب رہو۔‘‘ اور دوسرا یہ کہ قیامت کے دن آپ صلی اللہ علیہ وسلم یہ شکایت کریں گے، کیونکہ قرآن مجید میں یقینی مستقبل کے لیے ماضی کا لفظ کثرت سے استعمال ہوا ہے۔ یہاں یہ بات قابلِ توجہ ہے کہ ’’میری قوم نے اس قرآن کو چھوڑا ہوا بنا رکھا تھا‘‘ کے الفاظ سے جان بوجھ کر اسے نظر انداز کرنے کا مفہوم واضح ہو رہا ہے، جو صرف ’’چھوڑ رکھا تھا‘‘ کے الفاظ سے واضح نہیں ہوتا۔ {’’ هٰذَا الْقُرْاٰنَ ‘‘} میں {’’ هٰذَا ‘‘} کے لفظ سے قرآن کی عظمت بیان کرنا مقصود ہے، یعنی انھوں نے اتنی عظمت والے قرآن کو اس طرح بنا رکھا تھا جیسے کوئی ایسی چیز ہو جسے جان بوجھ کر نظر انداز کر دیا جائے۔ رہا یہ سوال کہ آیت میں مذکور ’’میری قوم‘‘ سے مراد کیا ہے؟ تو جواب اس کا یہ ہے کہ ’’میری قوم‘‘ کے لفظ سے سب سے پہلے آپ صلی اللہ علیہ وسلم کی زندگی میں قرآن پر ایمان نہ لانے والے مراد ہیں، اس کے بعد آپ صلی اللہ علیہ وسلم کی بعثت سے لے کر قیامت تک آنے والے وہ تمام لوگ مراد ہیں جو آپ صلی اللہ علیہ وسلم پر ایمان نہیں لائے، کیونکہ وہ بھی آپ صلی اللہ علیہ وسلم کی امتِ دعوت اور آپ کی قوم ہیں، جیسا کہ نوح علیہ السلام کی امت تھی، جو ایمان نہ لانے کے باوجود ان کی امت اور ان کی قوم تھی۔ ان کے قرآن کو چھوڑنے سے مراد اسے سننے، پڑھنے، اس پر غور و فکر کرنے سے اجتناب اور اس پر ایمان نہ لانا ہے۔ اس کے بعد {’’ قَوْمِي ‘‘} میں وہ تمام ایمان لانے والے بھی شامل ہیں جنھوں نے کسی طرح بھی قرآن کو چھوڑا۔ حافظ ابن کثیر رحمہ اللہ فرماتے ہیں : ’’قرآن کو سننے سے گریز، اس میں شور ڈالنا اور اس پر ایمان نہ لانا، اسے چھوڑنا ہے۔ اسی طرح بقدر ضرورت اس کا علم حاصل نہ کرنا اور اسے حفظ نہ کرنا بھی اسے چھوڑنا ہے۔ اس کا مطلب سمجھنے کی کوشش نہ کرنا، اس کے اوامر پر عمل نہ کرنا اور اس کی منع کردہ چیزوں سے باز نہ آنا بھی اسے چھوڑنا ہے۔ اسے چھوڑ کر دوسری چیزوں کو اختیار کرنا بھی اسے چھوڑنا ہے، مثلاً گانے بجانے کو، عشقیہ اشعار کو، لوگوں کے اقوال و آراء کو اور ان کے بنائے ہوئے طریقوں کو قرآن پر ترجیح دینا اسے چھوڑنا ہے۔‘‘ ¤ حقیقت یہ ہے کہ اس وقت امتِ مسلمہ نے جس طرح جان بوجھ کر قرآن کو پسِ پشت پھینک رکھا ہے شاید اس سے پہلے کبھی نہ پھینکا ہو۔ ان کے اکثر لوگ دنیا کمانے کے لیے اپنے بچوں کو ڈاکٹر، انجینئر، سائنسدان، تاجر اور صنعت کار بنائیں گے اور اس کام کے لیے اپنی ساری توانائیاں صرف کریں گے، مگر انھیں قرآن کی تعلیم نہیں دلوائیں گے اور دلوائیں گے بھی تو صرف ناظرہ قرآن کی یا حفظ کی، جس سے انھیں کچھ معلوم نہیں ہوتا کہ اس کا مطلب کیا ہے؟ کتنا ستم ہے کہ دنیا کی کوئی زبان سیکھی جائے تو اس کا ایک لفظ بھی مطلب سمجھے بغیر نہیں پڑھا جاتا، جب کہ قرآن پورا ناظرہ پڑھ لیا جاتا ہے، بعض اوقات حفظ کر لیا جاتا ہے، اس سے آگے اس کی تجوید اور حسن قراء ت بھی حاصل کر لی جاتی ہے، مگر اس کا مطلب سمجھنے کی زحمت ہی نہیں کی جاتی۔ جب اس کا مطلب ہی نہیں سمجھا گیا، تو اس پر غور و فکر کا اور اس پر عمل کا مرحلہ کب آئے گا؟ پورا قرآن تو دور کی بات ہے روزانہ پانچ وقت جو نماز وہ پڑھتے ہیں انھیں اس کا مطلب معلوم نہیں، نہ وہ یہ جانتے ہیں کہ ہم اپنے مالک سے کلام کرتے ہوئے کیا عرض کر رہے ہیں۔ یہی وجہ ہے کہ مسلمانوں کے تمام ممالک میں ({إِلَّا مَا رَحِمَ رَبِّيْ}) قرآن کو مسلمانوں کی زندگی سے عملاً نکال باہر کر دیا گیا ہے۔ ان کی سیاست کفار سے لی ہوئی جمہوریت ہے، جس میں اللہ اور اس کے رسول کا کوئی دخل نہیں، یا قرآن و سنت کے احکام کی پابندی سے آزاد استبدادی ملوکیت ہے، ان کی تجارت و صنعت کا دار و مدار سود پر ہے، ان کی عدالتوں میں کفار کے قوانین رائج ہیں اور ان کی وضع قطع اور تمدن و تہذیب یہود و نصاریٰ اور ہندوؤں کی سی ہے۔ ان کے ہاں قرآن صرف برکت کے لیے ہے، یا مجلس کے افتتاح کے لیے، یا دم درود اور پیری مریدی میں خود ساختہ وظائف کے لیے، یا محبت و عداوت اور تسخیر قلوب کے عملیات کے لیے، یا اچھے سے اچھے کاغذ اور اچھی جلد والا خرید کر جہیز میں دینے کے لیے ہے، یا خوبصورت غلاف میں لپیٹ کر اونچی سے اونچی جگہ رکھنے کے لیے۔ وہ اس کی طرف پیٹھ نہیں کرتے، مگر بات اس کی ایک نہیں مانتے۔ ان کے دینی مدارس میں سالہا سال تک انسانوں کے مرتب کیے ہوئے مسائل پڑھائے جاتے ہیں، جب وہ دل و دماغ میں خوب راسخ ہو جاتے ہیں تو انھیں قرآن و حدیث سے دورے کی شکل میں سال دو سال میں فارغ کر دیا جاتا ہے۔ (الا ما رحم ربی) ¤ حقیقت یہ ہے کہ جب تک ہم قرآن کو چھوڑنے کی یہ روش ترک کرکے صحابہ و تابعین کی طرح قرآن کی طرف واپس نہیں آئیں گے، اسے اپنی زندگی کا اوڑھنا بچھونا نہیں بنائیں گے، نصرتِ الٰہی اور باعزت زندگی سے محروم ہی رہیں گے۔ سچ فرمایا امام مالک رحمہ اللہ نے : {’’ لَنْ يَّصْلُحَ آخِرُ هٰذِهِ الْأُمَّةِ إِلَّا بِمَا صَلُحَ بِهِ أَوَّلُهَا‘‘} [ شرح سنن  أبي داوٗد لعبد المحسن العباد : 334/2 ] ’’اس امت کا آخر بھی اسی کے ساتھ درست ہو گا جس کے ساتھ اس کا اول درست ہوا تھا۔‘‘"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { وَ كَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِّنَ الْمُجْرِمِيْنَ :} چونکہ اس شکایت میں دل کی جلن اور شدید غم کا اظہار تھا، اس لیے اس آیت میں نبی صلی اللہ علیہ وسلم کو اور مسلمانوں کو تسلی دی کہ قرآن کو چھوڑنے والوں کا یہ طرز عمل صرف تمھارے ساتھ ہی نہیں ہے بلکہ پہلے انبیاء کے ساتھ بھی ایسے ہی رہا ہے۔ دیکھیے سورۂ انعام (۱۱۲، ۱۲۳)۔ ¤ ➋ { وَ كَفٰى بِرَبِّكَ هَادِيًا وَّ نَصِيْرًا:} اس میں آپ صلی اللہ علیہ وسلم کو دو بشارتیں دی ہیں، ایک یہ کہ جو لوگ اب اعراض کر رہے ہیں ان میں سے کئی ہدایت قبول کریں گے، یا ان کی پشتوں سے آنے والے ہدایت قبول کریں گے، جیسا کہ پہاڑوں کے فرشتے نے اللہ کے حکم سے آکر رسول اللہ صلی اللہ علیہ وسلم کو پیش کش کی کہ اگر آپ چاہیں تو میں ان پر مکہ کے دو پہاڑوں کو آپس میں ملا دوں، توآپ صلی اللہ علیہ وسلم نے فرمایا : [ بَلْ أَرْجُوْ أَنْ يُّخْرِجَ اللّٰهُ مِنْ أَصْلاَبِهِمْ م مَنْ يَّعْبُدُ اللّٰهَ وَحْدَهُ لَا يُشْرِكُ بِهِ شَيْئًا ] [ بخاري، بدء الخلق، باب إذا قال أحدکم آمین … : ۳۲۳۱ ] ’’بلکہ میں امید کرتا ہوں کہ اللہ تعالیٰ ان کی پشتوں سے ایسے لوگ نکالے گا جو اکیلے اللہ کی عبادت کریں گے، اس کے ساتھ کسی چیز کو شریک نہیں کریں گے۔‘‘ اور دوسری بشارت نصرتِ الٰہی کی ہے۔ {’’ وَ كَفٰى بِرَبِّكَ هَادِيًا وَّ نَصِيْرًا ‘‘} میں اس بات کی طرف بھی اشارہ ہے کہ اپنے سارے کام اس کے سپرد کر دو، کیونکہ ہدایت و نصرت کے لیے کفایت کرنے والا وہی ہے۔ (ابن عاشور)"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ { وَ قَالَ الَّذِيْنَ كَفَرُوْا لَوْ لَا نُزِّلَ …:} یہ رسول اللہ صلی اللہ علیہ وسلم کی نبوت کے منکروں کا پانچواں اعتراض ہے جو بالکل ہی بے کار ہے۔ اعتراض یہ تھا کہ آپ صلی اللہ علیہ وسلم پر سارا قرآن ایک ہی دفعہ کیوں نازل نہیں کیا گیا؟ یہ تھوڑا تھوڑا کر کے جو آ رہا ہے تو اس کا مطلب ہے کہ آپ صلی اللہ علیہ وسلم سوچ سوچ کر اسے تصنیف کر لیتے ہیں اور یہ انسانی کلام ہے۔ جواب اس کا یہ ہے کہ ہاں، اسے ایسے ہی تھوڑا تھوڑا کرکے نازل کیا گیا ہے، کیونکہ اس میں بہت سی حکمتیں ہیں۔ اعتراض بے کار اس لیے ہے کہ قرآن کا دعویٰ ہے کہ چونکہ یہ اللہ کا کلام ہے، اس لیے ساری کائنات مل کر بھی اس کی ایک سورت کی مثل نہیں بنا سکتی۔ اس سے پہلے قرآن کا جو حصہ نازل ہوا ہے اس کی مثل تو یہ لوگ لا نہیں سکے، اگر پورا قرآن اکٹھا نازل ہو جائے تو اس کی مثل کیسے پیش کریں گے۔ پھر ایسا مطالبہ کیوں؟ ¤ ➋ یہاں بھی اگر {’’ وَقَالُوْا ‘‘} (اور انھوں نے کہا) کہہ دیا جاتا تو کافی تھا، مگر {’’ وَ قَالَ الَّذِيْنَ كَفَرُوْا ‘‘} اس لیے فرمایا کہ ان لوگوں نے جو یہ بات کی ہے اس کی وجہ اس مطالبے کا معقول ہونا نہیں بلکہ اس کا باعث صرف اور صرف کفر ہے، جب کوئی شخص انکار پر تل ہی جائے تو وہ ایسی ہی بے تکی ہانکا کرتا ہے۔ ¤ ➌ { كَذٰلِكَ لِنُثَبِّتَ بِهٖ فُؤَادَكَ :} یعنی اس طرح تھوڑا تھوڑا نازل کرنے میں بہت سے عظیم فائدے ہیں : (1) ان میں سے ایک یہ ہے کہ اس طرح ہم آپ کے دل کو مضبوط اور قائم رکھتے ہیں، اس طرح کہ جب مشکلات کا ہجوم ہوتا ہے، کفار کوئی اعتراض کرتے ہیں، یا کوئی مسئلہ پیش آتا ہے تو ہم وحی کے ذریعے سے اس کا حل بتا دیتے ہیں، اس طرح بار بار وحی کا نزول ہوتا ہے، جبریل علیہ السلام بار بار آپ کے پاس آتے ہیں، تو اس احساس سے آپ کی ڈھارس بندھ جاتی ہے، حوصلہ بڑھ جاتا ہے اور دل مضبوط ہو جاتا ہے کہ مالک ہمارے حال سے غافل نہیں، مسلسل نظر رکھے ہوئے ہے اور ساتھ ساتھ رہنمائی فرما رہا ہے اور اپنے سب سے مقرب فرشتے کو ہمارے پاس بھیج رہا ہے۔ اگر جبریل علیہ السلام ایک ہی دفعہ پورا قرآن لا کر فارغ ہو جاتے تو بار بار پیش آنے والی مشکلات میں دل کو حوصلہ کیسے ملتا اور اسے وہ لذت و قوت کیسے حاصل ہوتی جو اس احساس سے حاصل ہوتی ہے کہ اللہ تعالیٰ کا قاصد اس کی طرف سے اس کا پیغام لے کر آیا ہے: ¤ وداع و وصل جدا گانہ لذتے دارد ¤ ہزار بار برو، صد ہزار بار بیا ¤ ’’وداع و وصل الگ الگ لذت رکھتے ہیں، تو ہزار بار جا اور سو ہزار بار آ۔‘‘ ¤ (2) ایک وقت میں چند آیات اترنے سے ان کا سمجھنا آسان ہوتا تھا، موقع کی مناسبت سے ان کا مفہوم زیادہ متعین اور واضح ہو جاتا تھا، یہ امکان ختم ہو جاتا تھا کہ ہر شخص محض لفظوں کو لے کر ان کا جو مفہوم چاہے نکالتا پھرے۔ رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کے عمل میں آ کر ان آیات کی عملی تصویر بھی سامنے آ جاتی تھی۔ ساری کتاب اکٹھی اترنے میں یہ بات نہ تھی۔ (3) اس طرح قرآنِ مجید اترنے میں احکام تدریج کے ساتھ اترے، جس سے امت کے لیے تخفیف ہوئی، اگر ایک ہی وقت میں چوری، ڈاکے، قتل، شراب، بہتان، زنا، غرض ہر گناہ کی حد بیان کر دی جاتی تو اس پر عمل نہایت مشکل ہوتا۔ (4) مصلحتِ وقت کے لحاظ سے کئی احکام کچھ مدت تک کے لیے تھے، اس کے بعد انھیں منسوخ ہونا تھا، لہٰذا پوری کتاب نازل ہونے کی صورت میں یہ ممکن نہ تھا۔ (5) لوگوں کے سوالات کے حل اور کفار کے اعتراضات کے جواب کے لیے بار بار آیات کے نزول سے جو تسلی و تشفی ہوتی تھی وہ بیک وقت قرآن نازل ہونے سے کبھی نہ ہو سکتی تھی۔ (6) اہلِ عرب اُمّی لوگ تھے، جو لکھنا پڑھنا نہیں جانتے تھے، ان کے لیے چند آیات کو حفظ کرنا آسان تھا، جو ہر موقع پر اترتیں۔ پورا قرآن اترنے میں یہ بات نہ تھی۔ اس طرح قرآن سینوں میں محفوظ ہو گیا، کاغذ کا محتاج نہ رہا۔ لکھی ہوئی پوری کتاب مسلسل یاد کرنے میں سستی ہو سکتی تھی، جس سے صرف لکھی ہوئی کتاب پر انحصار ہو جاتا، نتیجتاً قرآن بھی پہلی کتابوں کی طرح غیر محفوظ ہو جاتا۔ (7) چند آیات اترنے سے قرآن کا معجز اور بے مثال کتاب ثابت ہونا زیادہ واضح ہوتا تھا، جب بھی چند آیات اترتیں تو کفار کا ان کے جواب سے قاصر رہنا نمایاں ہوتا۔ اگر پورا قرآن ایک وقت میں اترتا تو اس کا اعجاز اتنا نمایاں نہ ہوتا۔ (8) دوسرے مقام پر فرمایا : «{ وَ قُرْاٰنًا فَرَقْنٰهُ لِتَقْرَاَهٗ عَلَى النَّاسِ عَلٰى مُكْثٍ وَّ نَزَّلْنٰهُ تَنْزِيْلًا }» [ بني إسرائیل : ۱۰۶ ] ’’اور عظیم قرآن، ہم نے اس کو جدا جدا کر کے (نازل) کیا، تاکہ تو اسے لوگوں پر ٹھہر ٹھہر کر پڑھے اور ہم نے اسے نازل کیا، (تھوڑا تھوڑا) نازل کرنا۔‘‘ اس قرآن کی مثال بارش کی طرح ہے، بارش جب بھی نازل ہوتی ہے مردہ زمین میں زندگی کی لہر دوڑ جاتی ہے اور یہ فائدہ تبھی ہوتا ہے جب بارش وقتاً فوقتاً نازل ہو، نہ کہ ایک ہی مرتبہ ساری بارش ہو جائے۔ ایک مثال اس کی یہ ہے کہ کوئی استاد اپنے شاگرد کو ایک ہی دن میں ساری کتاب پڑھ کر سنا دے۔ ¤ ➍ { وَ رَتَّلْنٰهُ تَرْتِيْلًا:’’ تَرْتِيْلًا ‘‘} کا اصل {’’تَرْتِيْلُ الْأَسْنَانِ ‘‘} سے ہے، ’’دانتوں کے درمیان کچھ فاصلہ ہونا‘‘ جیسے بابونہ کے پھول کی پتیاں ہوں، ایسے دانتوں کو {’’ ثَغْرٌ مُرتَّلٌ‘‘} کہتے ہیں۔ یعنی اسی طرح قرآن ٹھہر ٹھہر کر تیئیس (۲۳) برس میں نازل ہوا۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) { وَ لَا يَاْتُوْنَكَ بِمَثَلٍ … : ’’مَثَلٌ‘‘ } کا معنی کسی چیز کے مشابہ چیز بھی ہے، ضرب المثل یا کہاوت بھی اور کسی چیز کی صفت بھی، جیسے فرمایا : «{ مَثَلُ الْجَنَّةِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَ }» [ الرعد : ۳۵ ] ’’اس جنت کی صفت جس کا متقی لوگوں سے وعدہ کیا گیا ہے۔‘‘ (راغب) سورت کے شروع سے اللہ تعالیٰ نے کفار کے پانچ اعتراض ذکر فرمائے ہیں اور سب کا دندان شکن جواب دیا ہے، آخر میں خلاصے کے طور پر فرمایا کہ ان لوگوں نے جو شکوک و شبہات اور طعن و اعتراض پیش کیے ہیں، یا قیامت تک پیش کریں گے ہم نے سب کا ایسا جواب دیا ہے اور دیتے رہیں گے جو سراسر حق ہے اور نہایت واضح ہے، ان کے اقوال کی طرح باطل یا غیر واضح نہیں ہے۔ {’’ مَثَلٌ‘‘} سے مراد ان کے وہ سوالات، مطالبات اور اعتراضات ہیں جو انھوں نے آپ پر پیش کیے تھے اور {’’اَلْحَقُّ‘‘} سے مراد شبہے کا ازالہ اور سوال کا جواب ہے۔ (شوکانی) دیکھیے ان کا پہلا اعتراض تھا : «{ وَ قَالَ الَّذِيْنَ كَفَرُوْۤا اِنْ هٰذَاۤ اِلَّاۤ اِفْكٌ افْتَرٰىهُ وَ اَعَانَههٗ عَلَيْهِ قَوْمٌ اٰخَرُوْنَ }» [ الفرقان : ۴ ] اسی کے ضمن میں تھا : { وَ قَالُوْۤا اَسَاطِيْرُ الْاَوَّلِيْنَ اكْتَتَبَهَا فَهِيَ تُمْلٰى عَلَيْهِ بُكْرَةةً وَّ اَصِيْلًا } [ الفرقان : ۵ ] دوسرا اعتراض تھا : «{ وَ قَالُوْا مَالِ هٰذَا الرَّسُوْلِ يَاْكُلُ الطَّعَامَ وَ يَمْشِيْ فِي الْاَسْوَاقِ لَوْ لَاۤ اُنْزِلَ اِلَيْهِ مَلَكٌ فَيَكُوْنَ مَعَهٗ نَذِيْرًا (7) اَوْ يُلْقٰۤى اِلَيْهِ كَنْزٌ اَوْ تَكُوْنُ لَهٗ جَنَّةٌ يَّاْكُلُ مِنْهَا }» [الفرقان : ۷، ۸ ] تیسرا اعتراض تھا : «{ وَ قَالَ الظّٰلِمُوْنَ اِنْ تَتَّبِعُوْنَ اِلَّا رَجُلًا مَّسْحُوْرًا }» [ الفرقان: ۸ ] چوتھا اعتراض تھا : «{ وَ قَالَ الَّذِيْنَ لَا يَرْجُوْنَ لِقَآءَنَا لَوْ لَاۤ اُنْزِلَ ع عَلَيْنَا الْمَلٰٓىِٕكَةُ اَوْ نَرٰى رَبَّنَا }» [ الفرقان : ۲۱ ] اور پانچواں اعتراض تھا : «{ وَ قَالَ الَّذِيْنَ كَفَرُوْا لَوْ لَا نُزِّلَ عَلَيْهِ الْقُرْاٰنُ جُمْلَةً وَّاححِدَةً }» [ الفرقان : ۳۲ ] ان اعتراضات کو امثال کہنے کی دلیل یہ ہے کہ اللہ تعالیٰ نے ان کا تیسرا اعتراض {’’ وَ قَالَ الظّٰلِمُوْنَ اِنْ تَتَّبِعُوْنَ اِلَّا رَجُلًا مَّسْحُوْرًا ‘‘} بیان کرنے کے بعد فرمایا : «{ اُنْظُرْ كَيْفَ ضَرَبُوْا لَكَ الْاَمْثَالَ فَضَلُّوْا فَلَا يَسْتَطِيْعُوْنَ  سَبِيْلًا }» [الفرقان : ۹ ] ’’ دیکھ انھوں نے تیرے لیے کیسی مثالیں بیان کیں، سو گمراہ ہو گئے، پس وہ کوئی راستہ نہیں پا سکتے۔‘‘ (ابن عاشور)"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ { اَلَّذِيْنَ يُحْشَرُوْنَ عَلٰى وُجُوْهِهِمْ اِلٰى جَهَنَّمَ … :} اس آیت کو پچھلی آیات کے ساتھ ملائیں تو ان الفاظ کا تقاضا ہے کہ یہاں کچھ عبارت محذوف ہے، جو یہ ہے کہ ’’نبی اور قرآن پر اعتراض کرنے والے یہ لوگ اپنے چہروں کے بل جہنم کی طرف اکٹھے کیے جائیں گے‘‘ اور وہ لوگ جو اپنے چہروں کے بل جہنم کی طرف اکٹھے کیے جائیں گے وہی ٹھکانے میں نہایت برے اور راستے کے اعتبار سے بہت زیادہ گمراہ ہیں۔ ¤ ➋ { اُولٰٓىِٕكَ شَرٌّ مَّكَانًا وَّ اَضَلُّ سَبِيْلًا : ’’ شَرٌّ ‘‘} اصل میں {’’أَشَرُّ ‘‘} ہے، جیسے {’’خَيْرٌ‘‘} اصل میں {’’ أَخْيَرُ‘‘} ہے، دونوں اسم تفضیل کے صیغے ہیں، {’’ اَضَلُّ ‘‘} بھی اسم تفضیل ہے، مگر یہاں تفضیل مراد نہیں، نہ یہ معنی ہے کہ یہ لوگ اہلِ جنت سے زیادہ برے ہیں۔ یہاں {’’ شَرٌّ ‘‘} اور {’’ اَضَلُّ ‘‘} کا لفظ کسی کے مقابلے میں زیادہ برے یا زیادہ گمراہ کے معنی میں نہیں بلکہ صرف مبالغے کے لیے ہے، یعنی نہایت برے اور بہت زیادہ گمراہ ہیں، اس لیے ترجمہ کیا گیا ہے ’’وہی ٹھکانے میں نہایت برے اور راستے کے اعتبار سے بہت زیادہ گمراہ ہیں۔‘‘ ٹھکانے سے مراد جہنم ہے اور راستے سے مراد کفر و شرک کا راستہ ہے، جو جہنم کی طرف لے جاتا ہے۔ چند آیات پہلے اہلِ جنت کا وصف بیان ہوا ہے : «{ اَصْحٰبُ الْجَنَّةِ يَوْمَىِٕذٍ خَيْرٌ مُّسْتَقَرًّا وَّ اَحْسَنُ مَقِيْلًا }» [ الفرقان : ۲۴ ] اس کے مقابلے میں یہاں اہلِ جہنم کا وصف {’’ شَرٌّ مَّكَانًا وَّ اَضَلُّ سَبِيْلًا ‘‘} بیان ہوا ہے۔ ¤ ➌ { اَلَّذِيْنَ يُحْشَرُوْنَ عَلٰى وُجُوْهِهِمْ …:} دیکھیے سورۂ بنی اسرائیل (۹۷) اور طٰہٰ (۱۲۵) چہروں کے بل اکٹھے کیے جانے کی ایک تفسیر یہ ہے کہ انھیں چہروں کے بل گھسیٹتے ہوئے میدانِ محشر کی طرف لے جایا جائے گا، جیسا کہ جہنم میں بھی ان کے ساتھ یہی معاملہ ہو گا، فرمایا : «{ يَوْمَ يُسْحَبُوْنَ فِي النَّارِ عَلٰى وُجُوْهِهِمْ ذُوْقُوْا مَسَّ سَقَرَ }» [ القمر : ۴۸ ] ’’جس دن وہ آگ میں اپنے چہروں پر گھسیٹے جائیں گے، چکھو آگ کا چھونا۔‘‘ اور فرمایا : «{ وَ مَنْ جَآءَ بِالسَّيِّئَةِ فَكُبَّتْ وُجُوْهُهُمْ فِي النَّارِ }» [ النمل : ۹۰ ] ’’اور جوبرائی لے کر آئے گا تو ان کے چہرے آگ میں اوندھے ڈالے جائیں گے۔‘‘ دوسری تفسیر وہ ہے جو انس رضی اللہ عنہ نے روایت فرمائی ہے کہ ایک آدمی نے کہا : ’’یا رسول اللہ! کافر کو قیامت کے دن چہرے کے بل اکٹھا کیا جائے گا؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَلَيْسَ الَّذِيْ أَمْشَاهُ عَلَی الرِّجْلَيْنِ فِي الدُّنْيَا قَادِرًا عَلٰی أَنْ يُّمْشِيَهُ عَلٰی وَجْهِهِ يَوْمَ الْقِيَامَةِ؟ ] [ بخاري، التفسیر، باب قولہ : « الذین یحشرون علی…» : ۴۷۶۰ ] ’’کیا جس نے اسے ٹانگوں پر چلایا ہے وہ اس پر قادر نہیں کہ اسے قیامت کے دن اس کے چہرے پر چلائے؟‘‘ اکثر مفسرین نے یہی تفسیر کی ہے۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ { وَ لَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ :} ان آیات میں اللہ تعالیٰ نے پانچ رسولوں ااور ان کی اقوام کے قصّے اور قومِ لوط کی بستیوں کا ذکر نہایت اختصار کے ساتھ فرمایا ہے، مقصد رسول اللہ صلی اللہ علیہ وسلمکو تسلی دینا اور آپ صلی اللہ علیہ وسلم کو جھٹلانے والوں کو گزشتہ اقوام جیسے برے انجام سے ڈرانا ہے۔ موسیٰ علیہ السلام کو فرعون کی طرف بھیجنے سے پہلے جو کتاب عطا فرمائی گئی اس کے متعلق دو قول ہیں، ایک یہ کہ وہ تورات ہی تھی اور فرعون کے غرق ہونے کے بعد موسیٰ علیہ السلام کو جو کتاب الواح کی شکل میں ’’طُور‘‘ پر عطا کی گئی وہ پوری تورات نہ تھی، بلکہ اس کا ایک حصہ تھی۔ دوسرا قول یہ ہے کہ تورات تو فرعون کے غرق ہونے کے بعد موسیٰ علیہ السلام کو ’’طور‘‘ پر ملی، اس سے پہلے فرعون کی طرف روانہ ہوتے وقت موسیٰ علیہ السلام کو جو کتاب عطا ہوئی اس سے مراد وحی الٰہی پر مشتمل وہ احکام ہیں جو تورات کے علاوہ تھے، انھیں بھی ’’کتاب اللہ‘‘ کہا جاتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس مزدور کے فیصلے کے متعلق فرمایا تھا جس نے اس شخص کی بیوی سے زنا کیا تھا جس کی وہ مزدوری کر رہا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا : [ وَ الَّذِيْ نَفْسِيْ بِيَدِهِ لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللّٰهِ ] ’’اس س ذات کی قسم جس کے ہاتھ میں میری جان ہے! میں تم دونوں کے درمیان اللہ کی کتاب کے ساتھ فیصلہ کروں گا۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے کنوارے مزدور کو سو کوڑے اور ایک سال کی جلا وطنی کا اور عورت کو اعتراف کی صورت میں رجم کا حکم دیا۔ [ بخاري، الشروط، باب الشروط التي لا تحل في الحدود : ۲۷۲۴، ۲۷۲۵ ] اس قول کے مطابق فرعون اس کتاب اللہ کی تکذیب کی وجہ سے غرق ہوا جو تورات کے علاوہ تھی اور جو موسیٰ علیہ السلام کی طرف حدیث کی صورت میں بھیجی گئی تھی۔ ¤ ➋ { وَ جَعَلْنَا مَعَهٗۤ اَخَاهُ هٰرُوْنَ وَزِيْرًا :} دیکھیے سورۂ طٰہٰ (۲۹ تا ۳۵) اس آیت میں یہ اشارہ بھی ہے کہ کسی رسول کو اگر واقعی ضرورت ہو تو اس کا بوجھ بٹانے کے لیے فرشتہ نہیں بھیجا جاتا، جیسا کہ کفار کا مطالبہ ہے، بلکہ آدمی ہی بھیجا جاتا ہے۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) ➊ { فَقُلْنَا اذْهَبَاۤ اِلَى الْقَوْمِ …:} اس سے پہلی آیت اور اس آیت میں اللہ تعالیٰ نے موسیٰ علیہ السلام اور فرعون کے قصے کی ابتدا کا ذکر فرمایا، پھر سارا طویل قصہ حذف کرکے ان دونوں کے قصے کی انتہا کا ذکر فرما دیا، کیونکہ یہاں مقصود اتنی بات ہی تھی، یہ اختصار کا کمال ہے۔ ¤ ➋ {اِلَى الْقَوْمِ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا:} ان آیات سے مراد یا تو وہ معجزے ہیں جو موسیٰ علیہ السلام لے کر آئے تھے، یا ایک اللہ کی عبادت، موسیٰ علیہ السلام کی نبوت تسلیم کرنے اور بنی اسرائیل کو آزادی دینے کے احکام ہیں، جو اللہ کی طرف سے موسیٰ علیہ السلام لے کر فرعون کے پاس گئے تھے۔ رسول بھیجنے سے پہلے ہی انھیں آیات جھٹلانے والے اس لیے قرار دیا کہ اللہ تعالیٰ کو علم تھا کہ انھوں نے آیات کو جھٹلا دینا ہے، یا اس لیے کہ قرآن کے مخاطب لوگوں کو معلوم تھا کہ فرعون نے اللہ کی آیات کو جھٹلا دیا تھا۔ ان کے علم کے اعتبار سے {’’ كَذَّبُوْا بِاٰيٰتِنَا ‘‘} فرما دیا۔ ¤ ➌ { فَدَمَّرْنٰهُمْ تَدْمِيْرًا:’’ تَدْمِيْرًا ‘‘} کسی چیز کو اس طرح توڑنا کہ پھر درست نہ ہو سکے۔ (المراغی) مزید وضاحت کے لیے دیکھیے سورۂ بنی اسرائیل (۱۶)۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) { وَ قَوْمَ نُوْحٍ لَّمَّا كَذَّبُوا الرُّسُلَ …:} اس قوم کی طرف صرف نوح علیہ السلام آئے تھے، جب کہ اللہ تعالیٰ نے فرمایا ہے کہ انھوں نے رسولوں کو جھٹلا دیا، وجہ اس کی یہ ہے کہ ایک پیغمبر کو جھٹلانا سب کو جھٹلانا ہے، کیونکہ تمام انبیاء کی دعوت ایک ہے۔ ان کی تکذیب اور غرق کی تفصیل کے لیے دیکھیے سورۂ ہود (۲۵ تا ۴۹)۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ {وَ عَادًا وَّ ثَمُوْدَاۡ وَ اَصْحٰبَ الرَّسِّ :} نوح علیہ السلام سب سے پہلے نبی ہیں جن کی امت انھیں جھٹلانے کی وجہ سے غرق ہوئی اور موسیٰ علیہ السلام آخری نبی ہیں جن پر ایمان نہ لانے کی وجہ سے فرعون اور اس کی آل غرق ہوئی۔ اس آیت میں ان کے درمیان کے لوگوں کا ذکر ہے جو پانی کے سوا ہلاک کیے گئے۔ {’’ الرَّسِّ ‘‘} کا معنی کنواں اور جمع {’’رِسَاسٌ‘‘} ہے۔ ابن جریر نے فرمایا : ’’کلامِ عرب میں {’’ الرَّسِّ ‘‘} ہر کھودی ہوئی جگہ کو کہتے ہیں، مثلاً کنواں اور قبر وغیرہ۔‘‘ اس لیے بعض نے اس سے مراد ’’اصحاب الاخدود‘‘ بھی لیے ہیں۔ شنقیطی نے فرمایا : ’’عاد و ثمود کا قصہ قرآن کی متعدد آیات میں آیا ہے، رہے {’’اَصْحٰبَ الرَّسِّ ‘‘} تو قرآن میں نہ ان کے قصے کی تفصیل آئی ہے نہ ان کے نبی کا نام آیا ہے۔‘‘ ان کے متعلق مفسرین کے بہت سے اقوال ہیں جو سب بے دلیل ہیں، اس لیے ہم نے انھیں ذکر نہیں کیا۔ {’’ الرَّسِّ ‘‘} ایک وادی کا نام بھی ہے، جس کا زہیر نے اپنے مُعَلَّقہ میں ذکر کیا ہے: ¤ {بَكَرْنَ بُكُوْرًا وَاسْتَحَرْنَ بِسُحْرَةٍ ¤ فَهُنَّ لِوَادِي الرَّسِّ كَالْيَدِ لِلْفَمِ } ¤ ➋ { وَ قُرُوْنًۢا بَيْنَ ذٰلِكَ كَثِيْرًا:’’ قَرْنٌ‘‘} ایک زمانے کے لوگ جو ایک دوسرے سے ملتے رہے ہوں، {’’فَهُوَ مِنَ الْاِقْتِرَانِ۔‘‘ ’’بَيْنَ ذٰلِكَ ‘‘} (اس کے درمیان) سے مراد نوح اور موسیٰ علیھما السلام کے درمیان کا یا عاد و ثمود اور اصحاب الرس کے درمیان کا زمانہ ہے۔ دوسری جگہ ان کی کثرت کے متعلق فرمایا : «{ اَلَمْ يَاْتِكُمْ نَبَؤُا الَّذِيْنَ مِنْ قَبْلِكُمْ قَوْمِ نُوْحٍ وَّ عَادٍ وَّ ثَمُوْدَ وَ الَّذِيْنَ مِنْۢ بَعْدِهِمْ لَا يَعْلَمُهُمْ اِلَّا اللّٰهُ }» [ إبراہیم : ۹ ] ’’کیا تمھارے پاس ان لوگوں کی خبر نہیں آئی جو تم سے پہلے تھے، نوح کی قوم کی (خبر) اور عاد اور ثمود کی اور ان کی جو ان کے بعد تھے، جنھیں اللہ کے سوا کوئی نہیں جانتا۔‘‘ اور فرمایا : «{ وَ كَمْ اَهْلَكْنَا مِنَ الْقُرُوْنِ مِنْۢ بَعْدِ نُوْحٍ }» [ بني إسرائیل : ۱۷ ] ’’اور ہم نے نوح کے بعد کتنے ہی زمانوں کے لوگ ہلاک کر دیے۔‘‘ اس سے معلوم ہوا کہ بائبل وغیرہ کے حوالے سے نوح اور موسیٰ علیھما السلام کے درمیان آباء کی گنتی اور سالوں کی گنتی کا کچھ اعتبار نہیں، نہ دنیا کی مدت کا کوئی یقینی علم ہے۔ سائنسدانوں کی باتیں بھی محض ظن و تخمین پر مبنی ہیں۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ { وَ كُلًّا ضَرَبْنَا لَهُ الْاَمْثَالَ:} یعنی ہم نے ہر ایک کو مثالیں اور دلائل دے دے کر سمجھایا۔ یہ معنی بھی ہو سکتا ہے کہ ہم نے ہر ایک کو پہلی تباہ شدہ قوموں کی مثالیں بیان کرکے سمجھایا۔ ¤ ➋ { وَ كُلًّا تَبَّرْنَا تَتْبِيْرًا : ’’ تَبَّرَ يُتَبِّرُ تَتْبِيْرًا ‘‘} کسی چیز کو ٹکڑے ٹکڑے اور ریزہ ریزہ کر دینا۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ { وَ لَقَدْ اَتَوْا عَلَى الْقَرْيَةِ …: ’’ وَ لَقَدْ ‘‘} کا لفظ قسم کا مفہوم رکھتا ہے، یعنی قسم ہے کہ یہ لوگ شام کی طرف جاتے ہوئے قومِ لوط کی بستیوں کے پاس سے گزرتے ہیں، کیونکہ وہ مکہ سے شام کو جانے والے راستے پر تھیں۔ دیکھیے سورۂ حجر (۷۹) اور صافات (۱۳۷)۔ ¤ ➋ { الَّتِيْۤ اُمْطِرَتْ مَطَرَ السَّوْءِ :} مراد کھنگر پتھروں کی بارش ہے۔ دیکھیے سورۂ ہود (۸۲)، حجر (۷۴)، اعراف (۸۴)، شعراء (۱۷۳) اور نمل (۵۸)۔ ¤ ➌ {اَفَلَمْ يَكُوْنُوْا يَرَوْنَهَا …:} ’’تو کیا وہ اسے دیکھا نہ کرتے تھے؟‘‘ یعنی یقینا دیکھا کرتے تھے۔ تو ان کے ایمان نہ لانے کی یہ وجہ نہ تھی کہ انھوں نے ان تباہ شدہ بستیوں کے آثار نہیں دیکھے تھے، بلکہ اصل وجہ یہ تھی کہ وہ کسی طرح دوبارہ زندہ ہونے کی امید نہ رکھتے تھے، اس لیے انھوں نے انھیں صرف تماشائی کی حیثیت سے دیکھا، ان سے کوئی عبرت حاصل نہ کی۔ اس سے معلوم ہوتا ہے کہ آخرت کے قائل اور اس کے منکر کے دیکھنے میں کتنا بڑا فرق ہوتا ہے۔ {’’ نُشُوْرًا ‘‘} کی تنوین کی وجہ سے ترجمہ کیا ہے ’’بلکہ وہ کسی طرح اٹھائے جانے کی امید نہ رکھتے تھے۔‘‘"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ { وَ اِذَا رَاَوْكَ اِنْ يَّتَّخِذُوْنَكَ۠ اِلَّا هُزُوًا:} مشرکین رسول اللہ صلی اللہ علیہ وسلمکی نبوت کا جس طرح شدت کے ساتھ انکار کرتے اور آپ کی نبوت اور قرآن پر متعدد اعتراضات کرتے رہتے تھے، اس کے ذکر کے بعد ان کی ایک خاص ایذا کا ذکر فرمایا کہ وہ جب تجھے دیکھتے ہیں تو اپنے مذاق کا نشانہ بنا لیتے ہیں۔ ¤ ➋ { اَهٰذَا الَّذِيْ بَعَثَ اللّٰهُ رَسُوْلًا: ’’ هٰذَا ‘‘} کا اشارہ آپ صلی اللہ علیہ وسلم کی تحقیر کے لیے ہے، یعنی کیا یہی وہ شخص ہے جسے اللہ تعالیٰ نے رسول بنا کر بھیجا ہے۔ پہلی بات تو یہ ہے کہ یہ رسول ہو کیسے گیا، جب کہ یہ ہمارے جیسا بشر ہے، جیسا کہ ایک جگہ ان کا قول ہے : «{ اَبَعَثَ اللّٰهُ بَشَرًا رَّسُوْلًا }» [ بني إسرائیل : ۹۴ ] ’’کیا اللہ نے ایک بشر کو رسول بنا کر بھیج دیا ہے۔‘‘ پھر دیکھو اگر رسالت کسی بشر کو ملنا ہی تھی تو مکہ اور طائف کے کسی سردار کو ملتی۔ یہ نہ بادشاہ نہ سرمایہ دار، اسے کیسے مل گئی! ان کا قول نقل کرتے ہوئے فرمایا : «{ وَ قَالُوْا لَوْ لَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيْمٍ }» [ الزخرف : ۳۱ ] ’’اور انھوں نے کہا یہ قرآن ان دو بستیوں میں سے کسی بڑے آدمی پر کیوں نازل نہ کیا گیا؟‘‘ شیخ عبد الرحمن السعدی نے فرمایا : ’’ان کی یہ بات ایسا شخص ہی کر سکتا ہے جو سب سے بڑھ کر جاہل اور گمراہ ہو اور سخت عناد اور دشمنی رکھتا ہو۔ اس کا مقصد اپنے باطل کی ترویج ہو۔‘‘ دوسری جگہ فرمایا : «{ وَ اِذَا رَاٰكَ الَّذِيْنَ كَفَرُوْۤا اِنْ يَّتَّخِذُوْنَكَ۠ اِلَّا هُزُوًا اَهٰذَا الَّذِيْ يَذْكُرُ اٰلِهَتَكُمْ وَ هُمْ بِذِكْرِ الرَّحْمٰنِ هُمْ كٰفِرُوْنَ }» [ الأنبیاء : ۳۶ ] ’’اور جب تجھے وہ لوگ دیکھتے ہیں جنھوں نے کفر کیا تو تجھے مذاق ہی بناتے ہیں، کیا یہی ہے جو تمھارے معبودوں کا ذکر کرتا ہے، اور وہ خود رحمان کے ذکر ہی سے منکر ہیں۔‘‘"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ { اِنْ كَادَ لَيُضِلُّنَا عَنْ اٰلِهَتِنَا …: ’’ اِنْ كَادَ ‘‘} اصل میں {’’إِنَّهُ كَادَ‘‘} تھا، یعنی بے شک وہ قریب تھا۔ یعنی یہ تو یقینا قریب تھا کہ ہمیں ہمارے معبودوں کی عبادت ہی سے نہیں خود ان معبودوں ہی سے گمراہ کر دیتا، یہ ہماری بہادری ہے کہ ہم ان کی عبادت پر ڈٹے رہے ہیں۔ ¤ ➋ اس سے کفار کا اپنے شرک پر شدت کے ساتھ ڈٹے رہنا ظاہر ہو رہا ہے کہ وہ اسے چھوڑنے کو گمراہ ہونا قرار دے رہے ہیں اور یہ بھی کہ ان کا یہ کام کسی دلیل کی بنا پر نہ تھا، بلکہ محض آبا و اجداد کی تقلید اور ہٹ دھرمی کی وجہ سے تھا۔ ¤ ➌ اس آیت سے ان کا اعتراف ثابت ہو رہا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حق کی دعوت پیش کرنے، اس کے لیے دلائل و معجزات پیش کرنے اور ہر اعتراض کا جواب دینے میں اتنی محنت سے کام لیا کہ کفار کو حق تسلیم کرنے کے سوا کوئی چارہ نہ رہا، پھر انھوں نے حق قبول نہیں کیا تو اس کی وجہ صرف اور صرف ان کی ہٹ دھرمی تھی۔ ¤ ➍ پچھلی آیت کے ساتھ ملا کر اس آیت کو دیکھیں تو کفار کی عجیب تضاد بیانی سامنے آتی ہے کہ ابھی جس شخص کے متعلق انھوں نے نہایت حقارت سے کہا کہ کیا یہی ہے وہ جسے اللہ نے رسول بنا کر بھیجا ہے؟ تو ابھی اس کی شخصیت کی تاثیر اور اس کے دلائل کی قوت کے بے پناہ ہونے کا اپنے منہ سے اعتراف کر رہے ہیں۔ اس سے ظاہر ہو رہا ہے کہ وہ اسلام کی دعوت سے کس قدر مرعوب اور بوکھلائے ہوئے تھے کہ مذاق بھی اڑاتے تھے اور رسول اللہ صلی اللہ علیہ وسلم کی عظمت اور برتری کا احساس ان پر اس قدر حاوی بھی تھا کہ بلا ارادہ ان کے منہ سے وہ باتیں نکلوا دیتا تھا جو وہ ہر گز کہنا نہیں چاہتے تھے۔ ¤ ➎ { وَ سَوْفَ يَعْلَمُوْنَ حِيْنَ يَرَوْنَ الْعَذَابَ …:} یہ ان کے لیے حق کو گمراہی کہنے پر اللہ تعالیٰ کی طر ف سے سخت وعید ہے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ {اَرَءَيْتَ مَنِ اتَّخَذَ اِلٰهَهٗ هَوٰىهُ :} یہ فطری بات ہے کہ کفار کا رسول اللہ صلی اللہ علیہ وسلم کو مذاق کا نشانہ بنانا اور اپنے باطل معبودوں کی عبادت پر ڈٹے رہنا آپ صلی اللہ علیہ وسلم کے لیے سخت تکلیف دہ تھا، کیونکہ آپ کی شدید خواہش تھی کہ وہ ایمان لے آئیں، اس لیے اللہ تعالیٰ نے ان کے حال پر تعجب دلاتے ہوئے فرمایا : ’’کیا تو نے وہ شخص دیکھا جس نے اپنی خواہش ہی اپنا معبود بنا لیا؟‘‘ ابوحیان نے فرمایا : {’’وَالْمَعْنٰي أَنَّهُ لَمْ يَتَّخِذْ إِلٰهًا إِلَّا هَوَاهُ‘‘} ’’معنی یہ ہے کہ اس نے اپنی خواہش کے سوا کسی کو معبود بنایا ہی نہیں۔‘‘ زمخشری نے فرمایا : ’’جو شخص اپنے دین میں خواہش ہی کا حکم مانے، کوئی بھی کام کرنے یا نہ کرنے میں اسی کے پیچھے چلے تو یہ شخص اپنی خواہش کی عبادت کرنے والا اور اسے اپنا معبود بنانے والا ہے۔ اس لیے اللہ تعالیٰ فرماتے ہیں کہ یہ شخص جو اپنی خواہش کے سوا کسی اور کو اپنا معبود ہی نہیں سمجھتا آپ اسے ہدایت کی طرف کیسے لا سکتے ہیں؟ کیا آپ اس کے ذمہ دار ہیں، یا اسے اسلام لانے پر مجبور کر سکتے ہیں اور کہہ سکتے ہیں کہ تمھیں ہر حال میں اسلام قبول کرنا ہو گا، چاہو یا نہ چاہو، جب کہ دین میں (قبولِ اسلام کے معاملہ میں) زبردستی ہے ہی نہیں، فرمایا : «{ لَاۤ اِكْرَاهَ فِي الدِّيْنِ }» [ البقرۃ : ۲۵۶ ] ’’دین میں کوئی زبردستی نہیں۔‘‘ اور فرمایا : «{ وَ مَاۤ اَنْتَ عَلَيْهِمْ بِجَبَّارٍ }» [قٓ : ۴۵ ] ’’اور تو ان پر کوئی زبردستی کرنے والا نہیں۔‘‘ اور فرمایا : «{ لَسْتَ عَلَيْهِمْ بِمُصَۜيْطِرٍ}» [ الغاشیۃ : ۲۲ ] ’’تو ہر گز ان پر کوئی مسلط کیا ہوا نہیں ہے۔‘‘ (الکشاف) اور دیکھیے سورۂ جاثیہ (۲۳) اور فاطر (۸)۔ ¤ ➋ کوئی شخص اگر نفس کی خواہش پر کوئی گناہ کر لے اور اپنے آپ کو اللہ کا گناہ گار سمجھے تو یہ نہیں کہا جا سکتا کہ اس نے اپنی خواہش کو اپنا الٰہ بنا لیا۔ ورنہ ہر گناہ شرک ہو گا اور ہر گناہ گار مشرک، جبکہ ایسا نہیں ہے، جیسا کہ فرمایا : «{ اِنَّ اللّٰهَ لَا يَغْفِرُ اَنْ يُّشْرَكَ بِهٖ }» [ النساء : ۴۸ ] ’’بے شک اللہ اس بات کو نہیں بخشے گا کہ اس کا شریک بنایا جائے۔‘‘ طبری نے اپنی معتبر سند کے ساتھ علی بن ابی طلحہ سے ابن عباس رضی اللہ عنھما کا قول نقل فرمایا : ’’مراد اس سے کافر ہے جو اللہ تعالیٰ کی ہدایت اور کسی دلیل کے بجائے اپنی خواہش ہی کو اپنا معبود بنا لے۔‘‘ ¤ ➌ { اَفَاَنْتَ تَكُوْنُ عَلَيْهِ وَكِيْلًا :} یعنی آپ اس کی ہدایت کے ذمہ دار نہیں ہیں، آپ کا کام صرف دعوت ہے، جیسا کہ فرمایا : «{فَاِنَّمَا عَلَيْكَ الْبَلٰغُ وَ عَلَيْنَا الْحِسَابُ }» [ الرعد : ۴۰ ] ’’تو تیرے ذمے صرف پہنچا دینا ہے اور ہمارے ذمے حساب لینا ہے۔‘‘ اور دیکھیے سورۂ شوریٰ (۴۸)۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) { اَمْ تَحْسَبُ اَنَّ اَكْثَرَهُمْ يَسْمَعُوْنَ … : } راستے کے اعتبار سے زیادہ گمراہ اس لیے کہ جانور تو معذور ہیں کہ اللہ تعالیٰ نے ان میں سوچنے سمجھنے کا مادہ ہی نہیں رکھا، مگر افسوس ان پر ہے جو عقل و شعور رکھتے ہیں مگر اس سے کوئی کام نہیں لیتے، یا لیتے ہیں تو الٹا لیتے ہیں۔ یا یہ مطلب ہے کہ چوپائے تو پھر بھی اپنے مالک کے تابع رہتے ہیں، چراگاہ میں چلے جاتے ہیں، پھر واپس ٹھکانے پر پہنچ جاتے ہیں، مگر یہ نہ اپنے خالق و مالک کو پہچانتے ہیں نہ اس کی مرضی کے مطابق زندگی گزار رہے ہیں۔ دیکھیے سورۂ اعراف (۱۷۹)۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ { اَلَمْ تَرَ اِلٰى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ … :} سورت کی ابتدا توحید کے اثبات اور شرک کے رد کے دلائل سے ہوئی ہے، کفار کی گمراہی کے بیان کے بعد ایک بار پھر توحید کے دلائل کا بیان ہے۔ دوسری مناسبت یہ ہے کہ سائے کے پھیلنے اور سکڑنے کو کائنات میں تدریج کے اصول کی مثال کے طور پر ذکر کیا گیا ہے، توجہ اس بات کی طرف دلائی جا رہی ہے کہ یہی اصول قرآن کے آہستہ آہستہ نازل ہونے میں کار فرما ہے۔ ¤ ➋ آیت کے شروع میں رسول اللہ صلی اللہ علیہ وسلم کو مخاطب کرکے اپنا ذکر غائب کے صیغے کے ساتھ فرمایا ہے، فرمایا : «{اَلَمْ تَرَ اِلٰى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ }» ’’کیا تو نے اپنے رب کو نہیں دیکھا، اس نے کس طرح سائے کو پھیلا دیا۔‘‘ کیونکہ اصل مقصود سائے کی کیفیت کی طرف توجہ دلانا ہے اور آخر میں اپنا ذکر اپنی عظمت کے اظہار کے لیے جمع متکلم کے صیغے کے ساتھ فرمایا ہے، فرمایا : «{ ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيْلًا }» ’’پھر ہم نے سورج کو اس پر دلالت کرنے والا بنایا۔‘‘ ¤ ➌ سائے سے مراد روشنی اور تاریکی کے بین بین وہ درمیانی حالت ہے جو سورج نکلنے سے پہلے ہوتی ہے اور دن بھر مکانوں میں، دیواروں کی اوٹ میں اور درختوں کے نیچے رہتی ہے۔ بعض مفسرین نے سائے سے مراد رات کی ظلمت لی ہے، جسے اللہ تعالیٰ سورج غروب ہونے کے ساتھ بتدریج پھیلاتا ہے اور طلوع آفتاب تک بتدریج ختم کرتا ہے۔ ¤ ➍ یعنی تم نے اپنے رب کی عجیب کاری گری نہیں دیکھی کہ اس نے سائے کو اس طرح بنایا کہ طلوع آفتاب تک ہر جگہ پھیلا ہوتا ہے، اگر اللہ تعالیٰ سورج کو طلوع نہ ہونے دیتا تو وہی سایہ قائم رہتا، مگر اس نے اپنی قدرت سے سورج نکالا، جس سے دھوپ پھیلنا شروع ہوئی اور سایہ بتدریج ایک طرف کو سمٹنے لگا۔ اگر دھوپ نہ آتی تو سائے کو ہم سمجھ بھی نہ سکتے۔ پھر سورج طلوع ہونے کے ساتھ ہر چیز کا سایہ مغرب کی طرف بہت لمبا اور پھیلا ہوا ہوتا ہے، پھر جیسے جیسے سورج بلند ہوتا ہے سایہ آہستہ آہستہ سکڑتا جاتا ہے، حتیٰ کہ دھوپ پھیلنے سے بالکل ختم ہو جاتا ہے یا تھوڑا سا رہ جاتا ہے، پھر سایہ مشرق کی طرف بڑھنا شروع ہو جاتا ہے جو آخر کار رات کی تاریکی کے ساتھ ختم ہو جاتا ہے۔ سائے کے اس پھیلنے اور سکڑنے میں انسان، حیوان حتیٰ کہ زمین پر پائی جانے والی ہر چیز کے لیے بے شمار فائدے ہیں، بلکہ ان کی زندگی ہی سائے کے اس گھٹنے بڑھنے پر موقوف ہے۔ ہمیشہ سایہ رہے تو زمین پر کوئی جان دار مخلوق بلکہ نباتات تک باقی نہ رہ سکے، کیونکہ ان سب کی زندگی سورج کی حرارت پر موقوف ہے۔ سایہ بالکل نہ رہے تب بھی زندگی محال ہے، کیونکہ ہر وقت سورج کے سامنے رہنے اور اس کی شعاعوں سے کوئی پناہ نہ ملنے کی صورت میں نہ جان دار زندہ رہ سکتے ہیں نہ نباتات، بلکہ پانی تک کا وجود باقی رہنا مشکل ہے، پھر اللہ کا فضل یہ ہے کہ دھوپ چھاؤں کا یہ سلسلہ آہستہ آہستہ بدلتا ہے، اگر یہ تبدیلی یک لخت ہو تب بھی زمین کی مخلوقات کی خیر نہیں۔ دن رات، دھوپ چھاؤں اور موسموں کے تغیر و تبدل کا سارا سلسلہ تدریج کے اصول پر قائم ہے، جس سے مقصود انسان کی ضروریات بہم پہنچانا ہے۔ دن بھر کے اوقات، نمازوں کے ہوں یا کسی اور کام کے، سائے کے بڑھنے گھٹنے سے وجود میں آتے ہیں۔ ¤ ➎ { وَ لَوْ شَآءَ لَجَعَلَهٗ سَاكِنًا :} اس کی تفسیر کے لیے دیکھیے سورۂ قصص (۷۱، ۷۲)۔ ¤ ➏ { ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيْلًا :} یعنی اگر دھوپ نہ ہوتی تو کچھ پتا نہ چلتا کہ سایہ کیا ہوتا ہے، کیونکہ ہر چیز اپنی ضد سے پہچانی جاتی ہے۔ (قرطبی) اس کے علاوہ سورج کا سائے پر دلالت کرنے کا مطلب یہ بھی ہے کہ سایہ دھوپ کے تابع رہتا ہے، دھوپ ہی کے اعتبار سے وہ بڑھتا گھٹتا اور پھیلتا سمٹتا ہے، گویا دھوپ اس کے لیے بمنزلہ دلیل و راہنما ہے۔ (شوکانی)"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { ثُمَّ قَبَضْنٰهُ اِلَيْنَا …:} یعنی آہستہ آہستہ گھٹاتے ہوئے ہم اسے بالکل مٹا دیتے ہیں، جیسے جیسے سورج بلند ہوتا ہے سایہ بھی بتدریج کم ہوتا جاتا ہے، حتیٰ کہ نصف النہار کے وقت بالکل ختم ہو جاتا ہے۔ اسی طرح سورج کے مغرب کی طرف ڈھلنے کے ساتھ سائے کو بڑھاتے بڑھاتے رات کے آنے پر اپنی طرف سمیٹ لیتے ہیں۔ ¤ ➋ اپنی طرف سمیٹنے سے مراد غائب کرنا اور فنا کر دینا ہے، کیونکہ ہر چیز کا رجوع اللہ ہی کی طرف ہے، ہر چیز اسی کی طرف سے آتی ہے اور اسی کی طرف جاتی ہے، چنانچہ فرمایا : «{ وَ لِلّٰهِ غَيْبُ السَّمٰوٰتِ وَ الْاَرْضِ وَ اِلَيْهِ يُرْجَعُ الْاَمْرُ كُلُّهٗ }» [ ھود : ۱۲۳ ] ’’اور اللہ ہی کے پاس آسمانوں اور زمین کا غیب ہے اور سب کے سب کام اسی کی طرف لوٹائے جاتے ہیں۔‘‘ ¤ ➌ {قَبْضًا يَّسِيْرًا :} یعنی اتنا آہستہ کہ پوری طرح اس کے سمٹنے کا ادراک نہایت مشکل ہے۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {وَ هُوَ الَّذِيْ جَعَلَ لَكُمُ الَّيْلَ لِبَاسًا …: ’’ سُبَاتًا ‘‘} اور {’’ سَبْتٌ ‘‘} (ن، ض) مصدر ہیں، راحت، سکون، قطع کرنا۔ کلام کا اسلوب بطور التفات متکلم سے غائب کی طرف واپس آ گیا ہے۔ سائے اور دھوپ کے بعد رات اور دن کا ذکر فرمایا۔ جملے کے دونوں جز {’’ هُوَ ‘‘} اور {’’ الَّذِيْ ‘‘} معرفہ ہونے سے اس میں قصر افراد پیدا ہو رہا ہے، یعنی رات دن بنانے والا وہ اکیلا ہی ہے، کوئی اس کے ساتھ شریک نہیں۔ جب تم بھی مانتے ہو کہ رات دن کا ایک لمحہ بنانے میں کسی کا کوئی حصہ نہیں، تو ان کے اندر موجود کسی چیز کا داتا اور دستگیر کوئی دوسرا کیسے بن گیا؟ {’’ جَعَلَ لَكُمْ‘‘} میں توجہ دلائی ہے کہ اللہ تعالیٰ نے دھوپ چھاؤں اور رات دن کا یہ سلسلہ تمھارے لیے بنایا ہے، وہ ہر چیز سے غنی ہے۔ رات کو لباس بنانے کا مطلب یہ ہے کہ روشنی راحت میں خلل انداز ہو سکتی تھی، لہٰذا اس نے رات کو تاریک بنا دیا جو لباس کی طرح ہر چیز کو چھپا لیتی ہے۔ رات کی تاریکی میں کتنے ہی دینی و دنیوی فائدے ہیں، کسی غازی، کسی عابد شب بیدار، کسی علم کی لذت یا کسی اونچے مقصد کی لذت سے آشنا ہی کو اس کا اندازہ ہو سکتا ہے۔ البتہ ایک فائدہ ایسا ہے جس سے کوئی بھی محروم نہیں رہتا، نہ اس سے کوئی مستغنی ہو سکتا ہے اور وہ ہے نیند، جو موت کی طرح تمھاری تمام حرکت قطع کر کے تمھیں مکمل سکون کی وادی میں لے جاتی ہے اور تمھاری تھکن دور کرتی اور پورے جسم کی ٹوٹ پھوٹ کی مرمت کر دیتی ہے۔ دیکھیے سورۂ انعام (۶۰) اور زمر (۴۲)۔ ¤ ➋ {وَ جَعَلَ النَّهَارَ نُشُوْرًا : ’’ نُشُوْرًا ‘‘} میں دو مفہوم پائے جاتے ہیں، ایک یہ کہ نیند ایک طرح کی موت ہے اور دن کو بیدار ہونا قیامت کو اٹھنے کی ایک مثال ہے۔ حذیفہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب بستر پر جاتے تو کہتے : [ بِاسْمِكَ أَمُوْتُ وَ أَحْيَا ] ’’تیرے ہی نام کے ساتھ میں مرتا ہوں اور زندہ ہوں گا۔‘‘ اور جب بیدار ہوتے تو کہتے : [ اَلْحَمْدُ لِلّٰهِ الَّذِيْ أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَ إِلَيْهِ النُّشُوْرُ ] [ بخاري، الدعوات، باب ما یقول إذا نام : ۶۳۱۲ ] ’’سب تعریف اللہ کے لیے ہے جس نے ہمیں موت دینے کے بعد زندگی بخشی اور اسی کی طرف اٹھ کر جانا ہے۔‘‘ دوسرا یہ کہ رات آرام کے لیے اور دن کام کاج اور اللہ کا فضل تلاش کرنے کے لیے ہے۔ آیت میں اللہ کی توحید کی دلیل بھی ہے اور قیامت پر اس کی قدرت کا اظہار بھی اور نعمت کی یاد دہانی بھی۔ اور دیکھیے سورۂ قصص (۷۳)۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ { وَ هُوَ الَّذِيْۤ اَرْسَلَ الرِّيٰحَ بُشْرًۢا …:} دیکھیے سورۂ اعراف (۵۷) ابن کثیر رحمہ اللہ نے فرمایا : ’’یہ بھی اللہ تعالیٰ کی قدرتِ کاملہ ہے کہ وہ ہواؤں کو خوش خبری دینے والی بنا کر بھیجتا ہے کہ وہ اپنے بعد بادل آنے کی خوش خبری دیتی ہیں، اور ہواؤں کی کئی قسمیں ہیں جو کئی کاموں پر مقرر ہیں، بعض وہ جو بادلوں کو ابھارتی ہیں، بعض انھیں اٹھاتی ہیں، کچھ انھیں ہانکتی ہیں، کچھ ان سے پہلے بشارت دیتی ہیں، کچھ زمین پر جھاڑو پھیر دیتی ہیں اور کچھ بادلوں میں بار آوری کا کام کرتی ہیں، تاکہ ان سے بارش برسے۔‘‘ یعنی ہواؤں، بادلوں اوربارش کے اس سلسلے کا خالق اور مالک و مختار بھی وہی ہے۔ اس حقیقت کو مشرکینِ مکہ بھی تسلیم کرتے تھے۔ ¤ ➋ { وَ اَنْزَلْنَا مِنَ السَّمَآءِ مَآءً طَهُوْرًا:} یہاں پھر غائب سے متکلم کی طرف التفات ہے۔ {’’ السَّمَآءِ ‘‘} سے مراد بادل ہے۔ {’’ طَهُوْرًا ‘‘ } ’’جس کے ساتھ طہارت حاصل کی جائے‘‘ جیسا کہ {’’وَقُوْدٌ‘‘} جس کے ساتھ آگ جلائی جائے، {’’وَضُوْءٌ‘‘} جس کے ساتھ وضو کیا جائے، {’’سَحُوْرٌ‘‘} جس کے ساتھ سحری کی جائے اور {’’سَنُوْنٌ‘‘} جس کے ساتھ دانت صاف کیے جائیں۔ یعنی ہم نے بادل سے پانی اتارا جو ہر طرح کی گندگیوں سے پاک ہوتا ہے اور ہر طرح کے جراثیم اور زہریلے مادوں سے بھی۔ زمین سے جو پانی بخارات کی صورت میں بادل کی صورت اختیار کرتا ہے وہ بخارات بن کر اڑنے سے پہلے نجس ہو یا زہر آلود، نمکین ہو یا کسی عنصر کے ساتھ ملا ہوا، جب بادل سے برسے گا تو ہر آمیزش اور نجاست سے پاک ہو گا اور صرف خود ہی پاک نہیں ہو گا بلکہ دوسری چیزوں کو بھی نجاست سے پاک کرنے والا ہو گا۔ یہ آیت دلیل ہے کہ کسی بھی چیز کو پاک کرنے کا اصل ذریعہ پانی ہے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ {لِنُحْيِۧ بِهٖ بَلْدَةً مَّيْتًا وَّ نُسْقِيَهٗ …: ’’ اَنَاسِيَّ ‘‘ ’’ أَنْسِيٌّ‘‘} کی جمع ہے، جیسے : {’’كُرْسِيٌّ‘‘} کی جمع {’’كَرَاسِيُّ‘‘} ہے یا {’’إِنْسَانٌ‘‘} کی جمع ہے جو اصل میں {’’أَنَاسِيْنُ‘‘} تھا، جیسے : {’’ظَرْبَانٌ‘‘} (بلی جیسا ایک جانور) کی جمع {’’ظَرَابِيُّ‘‘} ہے، پھر آخری نون کو یاء سے بدل دیا اور یاء کا یاء میں ادغام کر دیا۔ {’’سَقٰي يَسْقِيْ‘‘} پلانا، {’’أَسْقٰي يُسْقِيْ‘‘} پلوانا، پینے کے لیے مہیا کرنا۔ ¤ ➋ اگر سمندر کا پانی اپنی اصل حالت میں کھیتی کو پلایا جائے تو کھیتی مرجھا کر تباہ ہو جائے اور اگر کوئی جان دار پی لے تو اس کی آنتوں کو کاٹ کے رکھ دے، یا کم از کم زخمی کر دے، لیکن اسی سمندر کے پانی کے بخارات جب بارش میں منتقل ہوتے ہیں تو کیا نباتات، کیا حیوان اور کیا انسان، سب کے لیے یہ پانی حیات بخش ثابت ہوتا ہے، کھیتیاں لہلہانے لگتی ہیں اور جان دار مخلوق بارش ہونے سے پہلے ہواؤں کی آمد ہی پر مسرور ہو کر جھومنے لگتی ہے۔ نباتات ہی سے جان دار مخلوق کو غذا حاصل ہوتی ہے اور اس کے پینے کے لیے اللہ تعالیٰ صاف ستھرا پانی دیتا ہے۔ جمادات کے علاوہ اس کائنات ارضی پر کوئی مخلوق ایسی نہیں جس کی زندگی کی بقا پانی کے بغیر ممکن ہو۔ (کیلانی) ¤ ➌ ان دو آیات میں بھی اللہ کی توحید، موت کے بعد زندگی کے دلائل اور اللہ کی نعمت کی یاد دہانی تینوں چیزیں موجود ہیں۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ {وَ لَقَدْ صَرَّفْنٰهُ بَيْنَهُمْ … :} اس آیت کی دو تفسیریں ہیں اور دونوں درست ہیں۔ اگر{’’ صَرَّفْنٰهُ ‘‘} میں {’’هٗ ‘‘} کی ضمیر اوپر بیان کردہ دلائل کی طرف ہو، جیسا کہ اکثر مفسرین کا رجحان ہے، تو معنی یہ ہو گا کہ ہم نے توحید کے دلائل کو قرآن مجید میں مختلف طریقوں سے پھیر پھیر کر بیان کیا ہے، تاکہ وہ نصیحت حاصل کریں، مگر اکثر لوگوں نے توحید قبول نہیں کی اور انھوں نے ناشکری اور کفر کے سوا کچھ مانا ہی نہیں۔ اور اگر {’’ صَرَّفْنٰهُ ‘‘ } کی ضمیر {’’ مَآءً ‘‘} کی طرف ہو تو معنی یہ ہو گا کہ ہم نے اس پانی کو ان کے درمیان طرح طرح سے پھیرا ہے، چنانچہ وہ کہیں زیادہ برستا ہے کہیں کم۔ سب جگہ ایک جیسا اور ایک وقت میں نہیں برستا، کسی جگہ بارش سے سیلاب آ جاتا ہے تو دوسری جگہ بارش کا ایک قطرہ نہیں گرتا اور قحط پڑ جاتا ہے، کہیں وہ مائع صورت میں ہے، کہیں پتھر کی طرح برف کی صورت میں اور کہیں بخارات کی صورت میں۔ غرض یہ سب اللہ تعالیٰ کی حکمت اور اس کی قدرت کے کرشمے ہیں۔ ابن کثیر رحمہ اللہ لکھتے ہیں کہ ابن عباس اور ابن مسعود رضی اللہ عنھم نے فرمایا : [ مَا مِنْ عَامٍ أَمْطَرَ مِنْ عَامٍ وَ لٰكِنَّ اللّٰهَ يَصْرِفُهُ حَيْثُ يَشَاءُ ثُمَّ قَرَأَ : «{ وَ لَقَدْ صَرَّفْنٰهُ بَيْنَهُمْ لِيَذَّكَّرُوْا } » ] [ مستدرک حاکم : 403/2، ح : ۳۵۲۰۔ طبري : ۲۱۲۱۶۔ سلسلۃ الأحادیث الصحیحۃ : 460/5، ح : ۲۴۶۱ ] ’’یعنی کوئی سال ایسا نہیں جس میں دوسرے کسی سال سے زیادہ بارش ہوتی ہو، لیکن اللہ تعالیٰ جیسے چاہتا ہے اسے پھیرتا ہے۔‘‘ پھر یہ آیت پڑھی : «{ وَ لَقَدْ صَرَّفْنٰهُ بَيْنَهُمْ لِيَذَّكَّرُوْا }» [ الفرقان : ۵۰ ]’’اور بلاشبہ یقینا ہم نے اسے ان کے درمیان پھیر پھیر کر بھیجا، تاکہ وہ نصیحت حاصل کریں۔‘‘ دکتور حکمت بن بشیر نے اس حدیث کی تخریج کرتے ہوئے لکھا ہے کہ ابن عباس رضی اللہ عنھما کا قول ابن ابی حاتم نے صحیح سند کے ساتھ سعید بن جبیر کے واسطے سے روایت کیا ہے اور حاکم نے اسی سند کے ساتھ روایت کرکے اسے صحیح کہا ہے اور ذہبی نے اس کی موافقت کی ہے اور ابن مسعود رضی اللہ عنہ کا قول طبری اور بیہقی نے دو سندوں سے روایت کیا ہے اور امام بیہقی نے اسے صحیح کہا ہے۔ [ السنن الکبریٰ للبیہقي : 363/3 ] ¤ ان دو جلیل القدر صحابہ کے قول کی رو سے یہ تفسیر زیادہ صحیح ہے، کیونکہ ظاہر ہے کہ یہ بات وہ اپنے پاس سے نہیں کہہ سکتے، اس لیے یہ حکماً مرفوع ہے۔ ابن عاشور لکھتے ہیں : ’’جدید تحقیق سے یہ بات ثابت ہو چکی ہے کہ بارش زمین پر ہر سال مجموعی طور پر ایک جیسی ہوتی ہے اور یہی بات سیکڑوں برس پہلے وحی کے ذریعے سے بتا دی گئی تھی۔‘‘ ¤ ➋ { لِيَذَّكَّرُوْا:} یعنی بارش کو اس طرح پھیر پھیر کر مختلف جگہوں پر کم یا زیادہ نازل کرنے کا مقصد یہ ہے کہ لوگ اس سے نصیحت حاصل کریں، بارش کو محض اللہ تعالیٰ کی رحمت و فضل کا نتیجہ مانیں، اس کے برسنے پر اللہ کا شکر ادا کریں اور نہ برسنے پر توبہ و استغفار کریں۔ ¤ ➌ {فَاَبٰۤى اَكْثَرُ النَّاسِ اِلَّا كُفُوْرًا: ’’ كُفُوْرًا ‘‘} اور {’’ كُفْرٌ‘‘ } دونوں مصدر ہیں، {’’ كُفُوْرًا ‘‘} میں حرف زیادہ ہونے کی وجہ سے مبالغہ ہے، یعنی سخت ناشکری۔ ناشکری یہ کہ اس بارش کو ستاروں کا کرشمہ قرار دیا جائے۔ زید بن خالد جہنی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حدیبیہ میں ایک بارش کے بعد، جو رات کے وقت ہوئی تھی، صبح کی نماز پڑھائی، جب فارغ ہوئے تو لوگوں کی طرف متوجہ ہو کر فرمایا : [ هَلْ تَدْرُوْنَ مَاذَا قَالَ رَبُّكُمْ؟ قَالُوا اللّٰهُ وَ رَسُوْلُهُ أَعْلَمُ، قَالَ : قَالَ أَصْبَحَ مِنْ عِبَادِيْ مُؤْمِنٌ بِيْ وَ كَافِرٌ، فَأَمَّا مَنْ قَالَ مُطِرْنَا بِفَضْلِ اللّٰهِ وَ رَحْمَتِهِ، فَذٰلِكَ مُؤْمِنٌ بِيْ ووَكَافِرٌ بِالْكَوْكَبِ، وَ أَمَّا مَنْ قَالَ مُطِرْنَا بِنَوْءِ كَذَا وَ كَذَا، فَذٰلِكَ كَافِرٌ بِيْ وَ مُؤْمِنٌ بِالْكَوْكَبِ ] [ مسلم، الإیمان، باب بیان کفر من قال مطرنا بالنوء : ۷۱۔ بخاري : ۸۴۶ ] ’’جانتے ہو آج رات تمھارے رب نے کیا فرمایا ہے؟‘‘ انھوں نے کہا : ’’اللہ اور اس کا رسول زیادہ جانتے ہیں۔‘‘ کہا، اس نے فرمایا ہے : ’’آج میرے بندوں نے صبح کی ہے کہ کچھ مجھ پر ایمان رکھنے والے ہیں اور کچھ کفر کرنے والے ہیں۔ جس نے کہا، ہم پر اللہ کے فضل اور اس کی رحمت سے بارش ہوئی ہے، تو یہ مجھ پر ایمان رکھنے والا اور ستارے کے ساتھ کفر کرنے والا ہے اور جس نے کہا، ہم پر فلاں فلاں ستارے کی وجہ سے بارش ہوئی تو یہ ستارے پر ایمان رکھنے والا اور میرے ساتھ کفر کرنے والا ہے۔‘‘"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ { وَ لَوْ شِئْنَا لَبَعَثْنَا فِيْ كُلِّ قَرْيَةٍ نَّذِيْرًا :} یعنی جس طرح ہم نے بارش کو مختلف شہروں اور ملکوں میں بانٹ دیا، اگر ہم چاہتے تو اسی طرح ہر بستی میں ایک ڈرانے والا بھیج دیتے، مگر ہم نے ایسا نہیں چاہا، کیونکہ اس سے الگ الگ امتیں وجود میں آتیں، جن کا آپس میں اختلاف ہوتا، اس لیے ہم نے ساری زمین کے لیے ایک آفتاب کی طرح سب کے لیے ایک ہی ڈرانے والا مقرر فرمایا کہ سب اس کی اطاعت کریں اور ان کے انکار کی صورت میں وہ سب کے ساتھ قتال کرے۔ رسول اللہ صلی اللہ علیہ وسلم کا قیامت تک کے تمام لوگوں کے لیے نذیر ہونے کا ذکر اسی سورت کے شروع میں بھی ہے : «{ لِیَکُوْنَ لِلْعٰلَمِیْنَ نَذِیْرًا }» مزید حوالہ جات کے لیے دیکھیے سورۂ اعراف (۱۵۸)۔ ¤ ➋ اس آیت میں اللہ تعالیٰ کی کمال قوت اور بے نیازی کا اظہار بھی ہے اور اس کی حکمت اور رسول اللہ صلی اللہ علیہ وسلم پر کمال نعمت کا بھی۔ فرمایا اگر ہم چاہتے تو ہر بستی میں ایک ڈرانے والا بھیج دیتے اور جس شان کا چاہتے بھیج دیتے، کسی کی جرأت نہ تھی کہ ہمیں روک سکتا، مگر ہم نے یہ نہیں چاہا، بلکہ یہ چاہا ہے کہ یہ عزت و رفعت ’’محمد صلی اللہ علیہ وسلم‘‘ کو ملے، فرمایا : «{ وَ رَفَعْنَا لَكَ ذِكْرَكَ }» [ الم نشرح : ۴ ]’’اور ہم نے تیرے لیے تیرا ذکر بلند کر دیا۔‘‘ اور فرمایا : «{ عَسٰۤى اَنْ يَّبْعَثَكَ رَبُّكَ مَقَامًا مَّحْمُوْدًا }» [ بني إسرائیل : ۷۹ ] ’’قریب ہے کہ تیر ارب تجھے مقام محمود پر کھڑا کرے۔‘‘"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ { فَلَا تُطِعِ الْكٰفِرِيْنَ:} چونکہ ہم نے ہر بستی کی طرف الگ الگ نذیر بھیجنے کے بجائے تمام جہانوں کے لیے آپ ہی کو ڈرانے والا بنا کر بھیجا ہے، اس لیے آپ کافروں کا کہنا مت مانیے، خواہ وہ معجزوں کا مطالبہ کریں یا طعن و تشنیع اور ٹھٹھے مذاق کے ساتھ دعوت سے روکنے کی کوشش کریں، یا مدا ہنت کی پیش کش کریں، جیسا کہ فرمایا : «{ وَدُّوْا لَوْ تُدْهِنُ فَيُدْهِنُوْنَ}» [ القلم : ۹ ] ’’ وہ چاہتے ہیں کاش! تو نرمی کرے تو وہ بھی نرمی کریں۔‘‘ ¤ ➋ {وَ جَاهِدْهُمْ بِهٖ جِهَادًا كَبِيْرًا: ’’جَاهَدَ يُجَاهِدُ جِهَادًا وَ مُجَاهَدَةً‘‘} (مفاعلہ) کسی کے مقابلے میں اپنی پوری کوشش صرف کر دینا۔ {’’ بِهٖ ‘‘ } سے مراد قرآن مجید ہے، جس کا تذکرہ {’’ وَ لَقَدْ صَرَّفْنٰهُ بَيْنَهُمْ ‘‘} میں گزرا ہے اور جس کے ذکر کے ساتھ سورت کی ابتدا ہوئی ہے، فرمایا : «{ تَبٰرَكَ الَّذِيْ نَزَّلَ الْفُرْقَانَ عَلٰى عَبْدِهٖ }» یعنی اگر ہر بستی میں ایک ڈرانے والا بھیجا جاتا تو آپ کے بوجھ میں کمی ہو جاتی، اب تمام لوگوں تک پیغام پہنچانے کی ذمہ داری کی وجہ سے آپ کا بوجھ بہت زیادہ ہو گیا ہے، اس لیے آپ اس قرآن کو لے کر جہاد کبیر کریں۔ ’’جہاد کبیر‘‘ سے کیا مراد ہے؟ ظاہر ہے اس سے مراد اپنی آخری کوشش تک لگا دینا ہے، یعنی دعوت کے ذریعے سے بھی اور جب ممکن ہو قتال کے ذریعے سے بھی۔ رازی لکھتے ہیں : ’’بعض مفسرین نے فرمایا، یہاں جہاد سے مراد اللہ کا پیغام پہنچانے اور دعوت میں پوری کوشش کرنا ہے اور بعض نے فرمایا، قتال (لڑائی) کے ساتھ جہاد مراد ہے اور بعض نے فرمایا، دونوں کے ساتھ جہاد مراد ہے۔‘‘ رازی نے فرمایا : ’’پہلی تفسیر زیادہ قریب ہے، کیونکہ سورت مکی ہے اور قتال کا حکم ہجرت کے بھی کچھ دیر بعد نازل ہوا۔‘‘ مگر حقیقت یہ ہے کہ زیادہ قریب بات یہ ہے کہ دعوت و قتال دونوں کے ساتھ جہاد مراد ہے، کیونکہ لفظ جہاد (پوری کوشش صرف کرنے) کا تقاضا بھی یہی ہے اور لفظ ’’کبیر‘‘ کا بھی۔ رہی یہ بات کہ یہ سورت مکی ہے، تو مکی سورتوں میں بھی قتال کا ذکر موجود ہے، اگرچہ حکمتِ الٰہی کے پیشِ نظر ہجرت سے پہلے قتال کی اجازت نہیں دی گئی، جیسا کہ سورۂ مزمل میں (جو بالاتفاق مکی ہے) فرمایا : «{ عَلِمَ اَنْ سَيَكُوْنُ مِنْكُمْ مَّرْضٰى وَ اٰخَرُوْنَ يَضْرِبُوْنَ فِي الْاَرْضِ يَبْتَغُوْنَ مِنْ فَضْلِ اللّٰهِ وَ اٰخَرُوْنَ يُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ فَاقْرَءُوْا مَا تَيَسَّرَ مِنْهُ }» [ المزمل : ۲۰ ] ’’اس نے جان لیا کہ یقینا تم میں سے کچھ بیمار ہوں گے اور کچھ دوسرے زمین میں سفر کریں گے، اللہ کا فضل تلاش کریں گے اور کچھ دوسرے اللہ کی راہ میں لڑیں گے، پس اس میں سے جو میسر ہو پڑھو۔‘‘ اور عروہ بن زبیر نے عبد اللہ بن عمرو رضی اللہ عنھما سے پوچھا : ’’قریش نے رسول اللہ صلی اللہ علیہ وسلمکو زیادہ سے زیادہ جو ایذا دی وہ کیا تھی؟‘‘ تو انھوں نے دو دنوں کا ذکر فرمایا، جن میں سے ایک وہ دن تھا جب عقبہ بن ابی معیط نے آپ صلی اللہ علیہ وسلم کی گردن میں چادر ڈال کر گلا گھونٹا اور ابوبکر رضی اللہ عنہ نے اسے دھکا دے کر آپ کو چھڑایا اور ایک اس سے پہلا دن کہ جب آپ طواف کر رہے تھے اور جب آپ کفارِ قریش کے پاس سے گزرتے تو وہ کوئی نہ کوئی تکلیف دہ بات کرتے، تین چکروں میں ایسا ہی ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ تَسْمَعُوْنَ يَا مَعْشَرَ قُرَيْشٍ ! أَمَا وَالَّذِيْ نَفْسُ مُحَمَّدٍ بِيَدِهِ! لَقَدْ جِئْتُكُمْ بِالذَّبْحِ ] ’’قریشیو ! سنتے ہو، اس ذات کی قسم جس کے ہاتھ میں محمد( صلی اللہ علیہ وسلم) کی جان ہے! میں تمھارے پاس (تمھارے) ذبح (کا پیغام) لے کر آیا ہوں۔‘‘ [ مسند أحمد : 218/2، ح : ۷۰۵۴۔ مسند أبی یعلٰی : 425/6، ح : ۷۳۳۹ ] مسند احمد اور مسند ابی یعلی ٰ دونوں کی تحقیق میں اسے حسن کہا گیا ہے ۔ ¤ ذبح کا یہ حکم جسے لے کر رسول اللہ صلی اللہ علیہ وسلم مبعوث ہوئے تھے، جب اس پر عمل کا وقت آیا تو رسول اللہ صلی اللہ علیہ وسلم نے اس پر عمل کرکے دکھایا اور فرمایا : [ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتّٰی يَشْهَدُوْا أَنْ لَا إِلٰهَ اِلَّا اللّٰهُ وَ أَنَّ مُحَمَّدًا رَّسُوْلُ اللّٰهِ، وَيُققِيْمُوا الصَّلَاةَ، وَيُؤْتُوا الزَّكَاةَ، فَإِذَا فَعَلُوْا ذٰلِكَ عَصَمُوْا مِنِّيْ دِمَاءَهُمْ وَ أَمْوَالَهُمْ إِلَّا بِحَقِّ الْإِسْلاَمِ وَ حِسَابُهُمْ عَلَی اللّٰهِ ] [ بخاري، الإیمان، باب  : «فإن تابوا و أقاموا الصلاۃ… » : ۲۵، عن ابن عمر رضی اللہ عنھما ] ’’مجھے حکم دیا گیا ہے کہ میں تمام لوگوں سے لڑوں، یہاں تک کہ وہ اس بات کی شہادت دیں کہ اللہ کے سوا کوئی معبود نہیں اور محمد اللہ کا رسول ہے۔ نماز قائم کریں اور زکوٰۃ دیں، جب وہ یہ کام کر لیں تو انھوں نے مجھ سے اپنے خون اور اپنے مال محفوظ کر لیے، مگر اسلام کے حق کے ساتھ اور ان کا حساب اللہ پر ہے ۔‘‘ ¤ ➌ جہادِ کبیر کی تفسیر دعوت و قتال دونوں کے ساتھ کرنا اس لیے بھی راجح ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا : [ أَيُّ الْجِهَادِ أَفْضَلُ؟ ] ’’کون سا جہاد افضل ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ أُهْرِيْقَ دَمُهُ وَ عُقِرَ جَوَادُهُ ] [ ابن ماجہ، الجہاد، باب القتال في سبیل اللہ : ۲۷۹۴، قال الشیخ الألباني صحیح ] ’’جس کا خون بہا دیا گیا اور اس کا گھوڑا کاٹ دیا گیا۔‘‘ اور طارق ابن شہاب رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی نے اس وقت رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا جب آپ رکاب میں پاؤں رکھ چکے تھے : [ أَيُّ الْجِهَادِ أَفْضَلُ؟ ] ’’کون سا جہاد افضل ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ كَلِمَةُ حَقٍّ عِنْدَ سُلْطَانٍ جَائِررٍ ] [ نسائي، البیعۃ، باب فضل من تکلم بالحق عند إمام جائر : ۴۲۱۴ ] ’’کسی ظالم بادشاہ کے پاس حق بات کہہ دینا۔‘‘ ظاہر ہے ظالم بادشاہ کے سامنے وہی شخص کلمۂ حق کہہ سکتا ہے جو اس کے سامنے اپنی جان ہتھیلی پر رکھ کر جائے گا، یہ ہر ایرے غیرے کا کام نہیں۔ اس لیے پچھلی حدیث میں اور اس میں کوئی تضاد نہیں۔ ¤ ➍ اس مقام پر ایک روایت بیان کی جاتی ہے، جس میں مال و جان کی قربانی والے جہاد کو جہاد اصغر قرار دیا گیا ہے، اس کے الفاظ یہ ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ رَجَعْنَا مِنَ الْجِهَادِ الْأَصْغَرِ إِلَی الْجِهَادِ الْأَكْبَرِ قَالُوْا وَمَا االْجِهَادُ الْأَكْبَرُ؟ قَالَ جِهَادُ الْقَلْبِ ] ’’ہم جہادِ اصغر سے جہادِ اکبر کی طرف واپس پلٹ آئے ہیں۔‘‘ لوگوں نے کہا : ’’تو وہ جہادِ اکبر کیا ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’جہاد القلب (دل کا جہاد)۔‘‘ [’’اَلْمَقُوْلُ مِنْ مَا لَيْسَ بِمَنْقُوْلٍ‘‘] کے مصنف ولید بن راشد السعیدان لکھتے ہیں : ’’حافظ ابن حجر نے (تسدید القوس میں) فرمایا، یہ ابراہیم بن ابی عَبلَہ کا کلام ہے۔‘‘ مطلب یہ ہے کہ اس کا اصل کچھ نہیں اور یہ جابر رضی اللہ عنہ سے بھی مروی ہے اور اس کی سند بھی ضعیف ہے۔ (و اللہ اعلم)"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ { وَ هُوَ الَّذِيْ مَرَجَ الْبَحْرَيْنِ …: ’’ فُرَاتٌ ‘‘ ’’فَرُتَ يَفْرُتُ‘‘} کا معنی توڑ دینا ہے، میٹھا پانی پیاس کو ختم کرتا ہے، اس لیے اسے {’’ فُرَاتٌ ‘‘ } کہتے ہیں۔ توحید کے دلائل جو {’’ اَلَمْ تَرَ اِلٰى رَبِّكَ كَيْففَ مَدَّ الظِّلَّ ‘‘} سے شروع ہوئے تھے یہ ان کا چوتھا سلسلہ ہے۔ اس آیت میں بھی اللہ تعالیٰ کی توحید، اس کی قدرت کے کمال اور انسان پر اس کے انعامات تینوں چیزوں کا بیان ہے۔ اس کی ہم معنی آیت سورۂ رحمن میں ہے : «{ مَرَجَ الْبَحْرَيْنِ يَلْتَقِيٰنِ (19) بَيْنَهُمَا بَرْزَخٌ لَّا يَبْغِيٰنِ }» [ الرحمٰن : ۱۹، ۲۰ ] ’’اس نے دو سمندروں کو ملادیا ، جو اس حال میں مل رہے ہیں کہ ان دونوں کے درمیان ایک پردہ ہے (جس سے) وہ آگے نہیں بڑھتے۔‘‘ {’’ وَ هُوَ الَّذِيْ ‘‘} میں مبتدا اور خبر دونوں کے معرفہ ہونے سے قصر کا مفہوم ادا ہو رہا ہے کہ دو سمندروں کو اس طرح ملانے والا اللہ تعالیٰ ہی ہے، کسی اور کا اس میں کوئی دخل نہیں۔ زمین کے تقریباً ستر (۷۰) فیصد حصے پر سمندر ہے جس کا پانی سخت نمکین ہے، بظاہر اس کے ساتھ ملا ہوا میٹھے پانی کا کوئی سمندر نہیں اور یہ بات یقینی ہے کہ اللہ تعالیٰ کی بات کسی صورت غلط نہیں ہو سکتی۔ اس لیے مفسرین نے آیت کے کئی مصداق بیان فرمائے ہیں اور سبھی درست ہیں۔ ایک مصداق اس کا یہ ہے کہ عربی میں بحر کا لفظ پانی کے بڑے ذخیرے پر بولا جاتا ہے، اس لیے یہ لفظ سمندر اور دریا دونوں کے لیے استعمال ہوتا ہے۔ تو اس سے مراد زمین پر موجود پانی کے دو بڑے ذخیرے ہیں، ایک میٹھا جو دریاؤں، جھیلوں اور ندی نالوں کی صورت میں ہے اور دوسرا کڑوا جو سمندر کی صورت میں ہے۔ ایک دوسرے کے قریب ہونے کے باوجود دونوں کے درمیان اللہ تعالیٰ نے زمین کی اوٹ بنا دی ہے جس کی وجہ سے وہ اپنی اپنی جگہ رہتے ہیں، نہ نمکین میٹھے پر غالب آتا ہے اور نہ میٹھا نمکین پر۔ اس کا واضح مشاہدہ جزیروں پر ہوتا ہے، جہاں سمندر کے سخت نمکین پانی کے ساتھ ہی میٹھے پانی کا دریا چل رہا ہوتا ہے۔ ¤ دوسرا مصداق اس کا یہ ہے کہ اس سے مراد زمین کے نیچے موجود پانی کے دو سمندر ہیں، جن میں سے ہر ایک کی رو دوسرے کی رو کے بالکل ساتھ چل رہی ہے، ایک جگہ نلکا لگائیں تو میٹھا پانی نکلتا ہے اور بعض اوقات اس کے قریب ہی دوسرا نلکا لگانے سے نمکین پانی نکلتا ہے، حتیٰ کہ دیوار کی ایک طرف کا پانی میٹھا ہوتا ہے اور دوسری طرف کا نمکین، نہ یہ اس کی نمکینی میں دخل دیتا ہے اور نہ وہ اس کی شیرینی میں۔ میری دانست میں یہ صورت سب سے واضح ہے، ہر شخص اس کا مشاہدہ کر سکتا ہے اور اس پر کسی ملحد کے لیے اعتراض کی بھی کوئی گنجائش نہیں۔ تیسرا مصداق اس کا وہ مقام ہے جہاں کسی بڑے دریا کا پانی سمندر میں گرتا ہے اور اس کے اندر دور تک چلا جاتا ہے، اس کا رنگ اور ذائقہ سمندر کے پانی کے رنگ اور ذائقے سے الگ رہتا ہے، دونوں کے درمیان نظر نہ آنے والی رکاوٹ حائل رہتی ہے۔ مفسر ابوحیان لکھتے ہیں : {’’ وَ نِيْلُ مِصْرَ فِيْ فَيْضِهِ يَشُقُّ الْبَحْرَ الْمَالِحَ شَقًّا بِحَيْثُ يَبْقٰي نَهْرًا جَارِيًا أَحْمَرَ فِيْ وَسْطِ الْمَالِحِ لِيَسْتَقِي النَّاسُ مِنْهُ ‘‘} [ البحر المحیط ] ’’یعنی مصر کا دریائےے نیل اپنی طغیانی کے زمانے میں نمکین سمندر کو چیرتا ہوا شور سمندر کے وسط میں سرخ رنگ کے دریا کی صورت میں دور تک بہتا چلا جاتا ہے، جس سے لوگ پینے کے لیے پانی حاصل کرتے ہیں۔‘‘ چوتھا مصداق اس کا یہ ہے کہ کھارے اور کڑوے سمندر کے درمیان ایسے ذخیرے موجود ہیں جن کا پانی بالکل میٹھا ہے۔ ابو حیان ہی نے لکھا ہے : {’’ وَ تَرَي الْمِيَاهَ قِطْعًا فِيْ وَسْطِ الْبَحْرِ الْمَالِحِ فَيَقُوْلُوْنَ هٰذَا مَاءٌ ثَلْجٌ  فَيَسْقُوْنَ مِنْهُ مِنْ وَسْطِ الْبَحْرِ ‘‘} [ البحر المحیط ] ’’یعنی نمکین سمندر کے وسط میں (میٹھے) پانی ٹکڑوں کی صورت میں دکھائی دیتے ہیں، جن کے متعلق لوگ کہتے ہیں کہ یہ برف کا پانی ہے اور وہ سمندر کے درمیان اس سے پینے کا پانی حاصل کرتے ہیں۔‘‘ ¤ تفہیم القرآن میں ہے : ’’خود سمندر میں بھی مختلف مقامات پر میٹھے پانی کے چشمے پائے جاتے ہیں، جن کا پانی سمندر کے نہایت تلخ پانی کے درمیان بھی اپنی مٹھاس پر قائم رہتا ہے۔ ترکی امیر البحر سیدی علی رئیس (کاتب رومی) اپنی کتاب ’’مرأۃ الممالک‘‘ میں (جو سولھویں صدی عیسوی کی تصنیف ہے) خلیج فارس کے اندر ایسے ہی ایک مقام کی نشان دہی کرتا ہے، اس نے لکھا ہے کہ وہاں آبِ شور کے نیچے آبِ شیریں کے چشمے ہیں، جن سے میں خود اپنے بیڑے کے لیے پینے کا پانی حاصل کرتا رہا ہوں۔ موجودہ زمانے میں جب امریکن کمپنی نے سعودی عرب میں تیل نکالنے کا کام شروع کیا تو ابتداءً وہ بھی خلیج فارس کے انھی چشموں سے پانی حاصل کرتی تھی، بعد میں ’’ظہران‘‘ کے پاس کنویں کھود لیے گئے اور ان سے پانی لیا جانے لگا۔ بحرین کے قریب بھی سمندر کی تہ میں آبِ شیریں کے چشمے ہیں جن سے لوگ کچھ مدت پہلے تک پینے کا پانی حاصل کرتے رہے ہیں۔‘‘ ¤ ➋ اس آیت میں نعمت کی یاد دہانی کس طرح ہے، اس کے لیے میٹھے اور نمکین سمندروں میں سے میٹھے پانی کے فوائد بیان کرنے کی تو خاص ضرورت ہی نہیں، کیونکہ خشکی کے ہر جان دار کی زندگی کا دار و مدار اسی پر ہے، البتہ نمکین سمندر میں اللہ تعالیٰ کی نعمت کا مشاہدہ کئی طرح سے ہوتا ہے۔ ’’تفسیر احسن البیان‘‘ میں ہے : ’’سمندری پانی کھارا رکھنے میں اللہ تعالیٰ کی بڑی حکمت ہے۔ میٹھا پانی زیادہ دیر کہیں ٹھہرا رہے تو وہ خراب ہو جاتا ہے، اس کے ذائقے، رنگ یا بو میں تبدیلی آ جاتی ہے، کھارا پانی خراب نہیں ہوتا، نہ اس کا ذائقہ بدلتا ہے، نہ رنگ اور بو۔ اگر ان ساکن سمندروں کا پانی بھی میٹھا ہوتا تو اس میں بدبو پیدا ہو جاتی، جس سے انسانوں اور حیوانوں کا زمین میں رہنا مشکل ہو جاتا۔ اس میں مرنے والے جانوروں کی سڑاند اس پر مستزاد۔ اللہ کی حکمت تو یہ ہے کہ ہزاروں (لاکھوں) برس سے یہ سمندر موجود ہیں، ان میں ہزاروں (لاکھوں بلکہ کروڑوں) جانور مرتے ہیں اور انھی میں گل سڑ جاتے ہیں، لیکن اللہ تعالیٰ نے ان میں ملاحت (نمکیات) کی اتنی مقدار رکھ دی ہے کہ وہ اس کے پانی میں ذرا بھی بدبو پیدا نہیں ہونے دیتی، ان سے اٹھنے والی ہوائیں بھی صحیح ہیں اور ان کا پانی بھی پاک ہے، حتیٰ کہ ان کا مردار بھی حلال ہے، جیسا کہ حدیث میں ہے : [ هُوَ الطَّهُوْرُ مَاءُهُ وَ الْحِلُّ مَيْتَتُهُ ] [أبوداوٗد، الطہارۃ، باب الوضوء بماء البحر : ۸۳ ] ’’اس (سمندر) کا پانی پاک ہے اور اس کا مردہ حلال ہے۔‘‘ (احسن البیان) پانی کا یہ عظیم ذخیرہ ہزاروں لاکھوں ٹن وزنی سامان مختلف مقامات پر پہنچانے کا آسان ترین ذریعہ بھی ہے، خوراک اور ضروریات زندگی کا لا محدود خزانہ بھی اور تمام جان داروں اور پودوں کو میٹھا پانی مہیا کرنے کے لیے بادلوں اور بارشوں کی پیدائش کا منبع بھی۔ اس کے علاوہ موسموں کے رد و بدل میں بھی اس کا بہت بڑا حصہ ہے۔ مزید دیکھیے سورۂ فاطر (۱۲)، نحل (۱۴)، حج (۶۵)، زخرف (۱۱، ۱۲) اور جاثیہ (۱۲)۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ {وَ هُوَ الَّذِيْ خَلَقَ مِنَ الْمَآءِ بَشَرًا … : } یہ توحید کے دلائل کی پانچویں قسم ہے۔ اس میں بھی اللہ تعالیٰ کی توحید، اس کی قدرت کاملہ اور آدمی پر انعام تینوں کا ذکر ہے۔ {’’ بَشَرًا ‘‘} کا لفظ {’’اَلْبَشَرَةُ‘‘} (کھال، ظاہری جلد) سے ہے، دوسرے تمام جانوروں کا جسم بالوں سے یا پروں وغیرہ سے چھپا ہوتا ہے، جبکہ انسان کی جلد اس سے صاف ہوتی ہے، اس لیے اسے ’’بشر‘‘ کہا جاتا ہے۔ پچھلی آیت میں خالق و مالک اور تنہا معبود ہونے کی دلیل کے طور پر دو پانیوں کو ملنے سے روکنے کی قدرت کا ذکر تھا اور اس آیت میں انھیں ملانے کا ذکر ہے، فرمایا : «{ اِنَّا خَلَقْنَا الْاِنْسَانَ مِنْ نُّطْفَةٍ اَمْشَاجٍ }» [ الدھر : ۲ ] ’’بلاشبہ ہم نے انسان کو ایک ملے جلے قطرے سے پیدا کیا۔‘‘ تاکہ کوئی یہ نہ سمجھے کہ کائنات میں سب کچھ خود بخود ہر چیز کی طبیعت کے تقاضے سے ہو رہا ہے۔ نہیں! یہ اس زبردست مالک و مختار کا کام ہے، چاہتا ہے تو سمندروں کو ملنے سے روک دیتا ہے، چاہتا ہے تو قطرے کو باہم ملا دیتا ہے اور پانی پر صورت گری اور نقش آفرینی فرما دیتا ہے۔ ¤ ➋ { فَجَعَلَهٗ نَسَبًا وَّ صِهْرًا :} یعنی یہی کرشمہ بجائے خود کیا کم تھا کہ وہ ایک حقیر قطرے سے انسان جیسی حیرت انگیز مخلوق بنا دیتا ہے، اس پر مزید یہ کہ اس نے انسان کا ایک نمونہ ہی نہیں، دو الگ الگ نمونے (عورت اور مرد) بنا دیے، فرمایا : «{ فَجَعَلَ مِنْهُ الزَّوْجَيْنِ الذَّكَرَ وَ الْاُنْثٰى }» [ القیامۃ : ۳۹ ] ’’پھر اس نے اس سے دو قسمیں نر اور مادہ بنائیں۔‘‘ پھر وہ مذکر ہو یا مؤنث، ان سب کی نسبت باپ دادا کی طرف ہوتی ہے، فلاں بن فلاں اور فلانہ بنت فلاں۔ جب مرد اور عورت کی آپس میں شادی ہوتی ہے تو ان کے بہت سے سسرالی رشتے دار بن جاتے ہیں، خاندانی قبیلوں اور قوموں کا یہ سارا پھیلاؤ ایک قطرۂ منی سے وجود میں آتا ہے۔ دیکھیے سورۂ نساء کی پہلی آیت اور سورۂ حجرات (۱۳)۔ ¤ ➌ { وَ كَانَ رَبُّكَ قَدِيْرًا :} یہ سب اللہ تعالیٰ کی قدرت کے کرشمے ہیں، کیونکہ تیرا رب ہمیشہ سے بے حد قدرت والا ہے ۔ہمیشگی کا مفہوم {’’ كَانَ ‘‘} سے ظاہر ہو رہا ہے۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) ➊ {وَ يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَا يَنْفَعُهُمْ وَ لَا يَضُرُّهُمْ … :} اننسان کو کسی کی عبادت اور خود سپردگی پر آمادہ کرنے والی چیز اس سے فائدے کی امید ہوتی ہے یا نقصان کا خوف۔ اللہ تعالیٰ نے انسان پر اپنے انعامات اور عاد و ثمود اور دوسری قوموں کو دی جانے والی سزائیں شمار کرنے کے بعد کفار کی بے عقلی بیان فرمائی کہ وہ اس محسن کو چھوڑ کر جس نے انھیں پانی کی ایک بوند سے پیدا فرما کر ضرورت کی ہر چیز اور ہر نعمت عطا فرمائی ہے، ان بے حقیقت چیزوں کی پوجا کر رہے ہیں جو نہ انھیں کوئی فائدہ پہنچاتی ہیں اور نہ نقصان۔ {’’ يَعْبُدُوْنَ ‘‘} مضارع کا صیغہ (جو استمرار کے لیے ہے) ان کے حال پر تعجب کے لیے ذکر فرمایا کہ یہ نہیں کہ انھوں نے ایک آدھ دفعہ یہ کمینگی کی ہو، بلکہ کرتے ہی چلے جاتے ہیں۔ اللہ تعالیٰ نے قرآن مجید میں اپنے سوا تمام ہستیوں کے نفع و نقصان کے مالک ہونے کی اور عبادت کا حق دار ہونے کی نفی بار بار فرمائی ہے۔ دیکھیے سورۂ مائدہ (۷۶)، اعراف (۱۸۸)، یونس (۱۸، ۴۹)، رعد (۱۶)، فرقان (۳)، یٰس (۷۵)، فتح (۱۱) اور سورۂ جن (۲۱)۔ ¤ ➋ { وَ كَانَ الْكَافِرُ عَلٰى رَبِّهٖ ظَهِيْرًا : ’’ الْكَافِرُ ‘‘} میں الف لام جنس کا ہے یا استغراق کا، اور {’’ كَانَ ‘‘} استمرار اور ہمیشگی کے لیے ہے، یعنی ہر کافر کی عادت ہے کہ وہ ہمیشہ اللہ تعالیٰ کے مقابلے میں اس کے دشمنوں کی مدد کرتا ہے، خواہ وہ شیاطین الجن ہوں یا شیاطین الانس۔ اس کی دلی، زبانی، مالی اور جانی ساری توانائیاں اسلام اور مسلمانوں کی مخالفت اور کفر اور کافروں کی حمایت کے لیے وقف ہوتی ہیں، جیسا کہ فرمایا : «{اَلَّذِيْنَ اٰمَنُوْا يُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ وَ الَّذِيْنَ كَفَرُوْا يُقَاتِلُوْنَ فِيْ سَبِيْلِ الطَّااغُوْتِ فَقَاتِلُوْۤا اَوْلِيَآءَ الشَّيْطٰنِ اِنَّ كَيْدَ الشَّيْطٰنِ كَانَ ضَعِيْفًا } » [ النساء : ۷۶ ] ’’وہ لوگ جو ایمان لائے وہ اللہ کے راستے میں لڑتے ہیں اور وہ لوگ جنھوں نے کفر کیا وہ باطل معبود کے راستے میں لڑتے ہیں۔ پس تم شیطان کے دوستوں سے لڑو، بے شک شیطان کی چال ہمیشہ نہایت کمزور رہی ہے۔‘‘ {’’ عَلٰى رَبِّهٖ ‘‘} میں کافر کی نمک حرامی نمایاں فرمائی ہے کہ اسے سوچنا چاہیے کہ وہ کس کے خلاف مورچہ باندھے ہوئے ہے، کیا اپنے پرورش کرنے والے ہی کے خلاف؟"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) { وَ مَاۤ اَرْسَلْنٰكَ اِلَّا مُبَشِّرًا وَّ نَذِيْرًا :} اس آیت میں رسول اللہ صلی اللہ علیہ وسلمکے لیے تسلی ہے اور کفار کے لیے تنبیہ، یعنی اگر کافر ایمان نہیں لاتے اور اللہ، اس کے رسول اور اہل ایمان کی دشمنی اور مخالفت سے باز نہیں آتے تو اس کی ذمہ داری آپ پر نہیں، آپ کا کام حق قبول کرنے والوں کو بشارت دینا اور اسے ٹھکرانے والے کو ڈرانا ہے اور بس۔ کفار کو سمجھایا جا رہا ہے کہ جس رسول کی دشمنی پر تم کمر باندھے ہوئے ہو وہ تو سر سے پاؤں تک تمھارا خیر خواہ ہے، وہ تمھیں ایمان قبول کرنے پر جنت کی خوش خبری دینے والا اور ایمان سے انکار کرنے پر اللہ کے عذاب سے ڈرانے والا ہے، ایسے خیر خواہ سے دشمنی رکھنا تمھیں زیب دیتا بھی ہے؟"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) ➊ { قُلْ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ:} قرآن مجید میں یہ جملہ کئی جگہ آیاا ہے، یہاں مطلب یہ ہے کہ کفار جو آپ کی عداوت پر تلے ہوئے ہیں ان سے کہہ دیجیے کہ میں اپنے رب کی طرف سے تمھارے پاس جو پیغام لے کر آیا ہوں، اسے پہنچانے میں تم سے کوئی مزدوری نہیں مانگتا کہ تم اپنے اموال بچانے کی خاطر مجھ پر ایمان لانے سے گریز کرو۔ دوسری جگہ فرمایا : «{ اِنْ اَجْرِيَ اِلَّا عَلَى الَّذِيْ }» [ ھود : ۵۱ ] ’’میری مزدوری اللہ کے سوا کسی پر نہیں۔‘‘ اس سے بڑی نادانی کیا ہو گی کہ جو شخص تمھاری دین و دنیا کی بہتری کے لیے اپنی ساری توانائیاں صرف کر رہا ہے اور اس پر تم سے کسی مزدوری کا مطالبہ بھی نہیں کرتا، تم اسی کی جان کے دشمن بنے ہوئے ہو۔ ¤ ➋ { اِلَّا مَنْ شَآءَ اَنْ يَّتَّخِذَ اِلٰى رَبِّهٖ سَبِيْلًا :} مفسرین نے اس جملے کی دو تفسیریں فرمائی ہیں اور دونوں درست ہیں۔ ایک یہ کہ میں اس دعوت پر تم سے کوئی مزدوری نہیں مانگتا، لیکن تم میں سے جو شخص چاہے کہ جہاد اور دوسرے خیر کے کاموں میں خرچ کرکے اللہ تعالیٰ کا قرب حاصل کرے اور اسے اس کی رحمت اور ثواب کے حصول کا ذریعہ بنائے تو وہ ایسا کرے، جیسا کہ فرمایا : «{ وَ مِنَ الْاَعْرَابِ مَنْ يُّؤْمِنُ بِاللّٰهِ وَ الْيَوْمِ الْاٰخِرِ وَ يَتَّخخِذُ مَا يُنْفِقُ قُرُبٰتٍ عِنْدَ اللّٰهِ وَ صَلَوٰتِ الرَّسُوْلِ اَلَاۤ اِنَّهَا قُرْبَةٌ لَّهُمْ سَيُدْخِلُهُمُ اللّٰهُ فِيْ رَحْمَتِهٖ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ }» [ التوبۃ : ۹۹ ] ’’اور بدویوں میں سے کچھ وہ ہیں جو اللہ اور یومِ آخرت پر ایمان رکھتے ہیں اور جو کچھ خرچ کرتے ہیں اسے اللہ کے ہاں قربتوں اور رسول کی دعاؤں کا ذریعہ سمجھتے ہیں۔ سن لو! بے شک وہ ان کے لیے قرب کا ذریعہ ہے، عنقریب اللہ انھیں اپنی رحمت میں داخل کرے گا۔ بے شک اللہ بے حد بخشنے والا، نہایت رحم والا ہے۔‘‘ اس صورت میں {’’ اِلَّا ‘‘} بمعنی {’’لٰكِنْ‘‘} ہے اور استثنا منقطع ہے۔ دوسری تفسیر یہ ہے کہ میں تم سے اس دعوت پر اس شخص کے سوا کوئی مزدوری نہیں مانگتا جو اپنے رب کے قرب کا راستہ اختیار کرنا چاہے۔ میری مزدوری بس ایسے لوگوں کا حصول ہے، اس کے سوا اللہ تم سے کسی مال یا جاہ یا کسی بھی مزدوری کا مطالبہ نہیں کرتا۔ ہاں، ایسے لوگوں کا حصول میرے لیے بہت بڑی مزدوری اور اجرت ہے، کیونکہ ایک شخص بھی ایمان لے آئے تو وہ میرے لیے سرخ اونٹوں سے بہتر ہے، پھر میری دعوت پر ایمان لانے والے جو بھی صالح عمل کریں گے سب کا اجر ان کے ساتھ ساتھ مجھے بھی ملے گا، میرے لیے یہی اجرت بہت ہے۔ اس صورت میں استثنا متصل ہے۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) ➊ { وَ تَوَكَّلْ عَلَى الْحَيِّ الَّذِيْ لَا يَمُوْتُ :} یہ بتانے کے بعد کہ تمام کفار آپ کی دشمنی میں یک جان اور ایک دوسرے کے مددگار ہیں، ان کی دشمنی اور ایذا سے بچنے کا طریقہ بتایا کہ آپ ان کی دشمنی پر صبر کریں، نہ کسی کا خوف رکھیں نہ کسی سے امید، اپنے ہر کام میں اس پر بھروسا رکھیں جو ہمیشہ زندہ ہے، کبھی نہیں مرے گا، وہی آپ کی ہر طرح سے حفاظت فرمائے گا، جیسا کہ فرمایا : «{ يٰۤاَيُّهَا الرَّسُوْلُ بَلِّغْ مَاۤ اُنْزِلَ اِللَيْكَ مِنْ رَّبِّكَ وَ اِنْ لَّمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهٗ وَ اللّٰهُ يَعْصِمُكَ مِنَ النَّاسِ }» [ المائدۃ : ۶۷ ] ’’اے رسول! پہنچا دے جو کچھ تیری طرف تیرے رب کی جانب سے نازل کیا گیا ہے اور اگر تو نے نہ کیا تو تُو نے اس کا پیغام نہیں پہنچایا اور اللہ تجھے لوگوں سے بچائے گا۔‘‘ بعض اہلِ علم نے فرمایا، اس کے بعد کسی عاقل کو زیب نہیں دیتا کہ وہ کسی بھی مخلوق پر بھروسا کرے، کیونکہ مخلوق کو مرنا ہے۔ یاد رہے، توکل کا معنی یہ نہیں کہ اسباب کو ترک کر دیا جائے، بلکہ توکل کا مطلب یہ ہے کہ اللہ تعالیٰ کے حکم کے مطابق حسب استطاعت تمام اسباب اختیار کرنے کے بعد بھروسا صرف اللہ پر رکھا جائے۔ ¤ ➋ اس جملے میں اللہ تعالیٰ کی دو صفات {’’ الْحَيِّ ‘‘} اور {’’ الَّذِيْ لَا يَمُوْتُ ‘‘} کے ساتھ مشرکین پر چوٹ بھی ہے کہ وہ ان ہستیوں کی عبادت کرتے اور انھیں اپنا داتا و دستگیر مانتے ہیں جو نہ زندہ ہیں اور نہ موت سے محفوظ، جیسا کہ فرمایا : « وَ الَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ لَا يَخْلُقُوْنَ شَيْـًٔا وَّ هُمْ يُخْلَقُوْنَ (20) اَمْوَاتٌ غَيْرُ اَحْيَآءٍ وَ مَا يَشْعُرُوْنَ اَيَّانَ يُبْعَثُوْنَ » [ النحلل : ۲۰، ۲۱ ] ’’اور وہ لوگ جنھیں وہ اللہ کے سوا پکارتے ہیں، وہ کچھ بھی پیدا نہیں کرتے اور وہ خودپیدا کیے جاتے ہیں۔ مردے ہیں، زندہ نہیں ہیں اور وہ نہیں جانتے کب اٹھائے جائیں گے۔‘‘ ¤ ➌ { وَ سَبِّحْ بِحَمْدِهٖ :} تسبیح سے مراد اللہ تعالیٰ کی ذات سے ہر ایسی چیز کی نفی ہے جو اس کی شان کے لائق نہ ہو، جس میں سب سے پہلی چیز اس کا کوئی شریک ہونا ہے اور حمد سے مراد اس کے لیے ہر خوبی ثابت کرنا ہے جو اس کی شان کے لائق ہے۔ یعنی اللہ پر توکل کے ساتھ اس کی تسبیح و تحمید آپ کو ہر دشمن سے محفوظ رکھے گی۔ اللہ تعالیٰ نے اپنے رسول کو جو بھی حکم دیا ہے وہ آپ کے ساتھ پوری امت کے لیے بھی ہے، جب تک یہ ثابت نہ ہو کہ وہ آپ کے ساتھ خاص ہے۔ ¤ ➍ { وَ كَفٰى بِهٖ بِذُنُوْبِ عِبَادِهٖ خَبِيْرًا :} اس میں دو عموم ہیں، تمام بندے اور ان کے تمام گناہ اور {’’ خَبِيْرَا ‘‘} میں مبالغے کی وجہ سے ’’علم‘‘ کا بھی عموم ہے اور {’’ كَفٰى ‘‘} کے فاعل کی تاکید ’’باء‘‘ کے ساتھ کرنے میں کفایت میں بھی عموم ہے، یعنی وہ اپنے تمام بندوں کے تمام گناہوں کی پوری پوری خبر رکھنے والا ہونے کے لحاظ سے ہر طرح کافی ہے، کیونکہ اس سے کوئی چیز مخفی نہیں۔ دیکھیے سورۂ انعام (۵۹) اور سورۂ سبا (۳)۔ ¤ ➎ اس جملے میں کفار کے لیے وعید اور دھمکی بھی ہے، جیسے کوئی بڑا اپنے ماتحت کو کہے کہ تم جو کچھ کر رہے ہو میں دیکھ رہا ہوں۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) ➊ {الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ وَ مَا بَيْنَهُمَا … :} اس کی تفسیر سورۂ یونس، ہود اور طٰہٰ میں گزر چکی ہے۔ یہاں ان صفات کا ذکر اللہ تعالیٰ پر توکل کی تلقین کے لیے بھی ہے اور اس میں نزول قرآن میں تدریج پر اعتراض کے جواب کی طرف اشارہ بھی ہے۔ ¤ ➋ { فَسْـَٔلْ بِهٖ خَبِيْرًا:} ’’پورے باخبر‘‘ سے مراد خود اللہ تبارک و تعالیٰ ہے اور {’’ بِهٖ ‘‘} سے مراد {’’عَنْهُ‘‘} (اس کے متعلق) ہے۔ اس آیت میں مزید وہ افعال و اوصاف ذکر فرمائے ہیں جن کی وجہ سے اللہ پر توکل کرنا چاہیے، یعنی اس پر توکل کر جو ہمیشہ زندہ ہے، جس پر کبھی موت نہیں آئے گی، جس نے آسمان و زمین کو چھ دنوں میں پیدا کیا، پھر عرش پر مستوی ہو گیا، جو بے حد رحم والا ہے۔ مطلب یہ ہے کہ آسمان و زمین کی پیدائش، استواء علی العرش اور اس کی لا محدود رحمت کے بارے میں اہلِ کتاب یا مشرکین کیا جانیں، ان کی تفصیلات کا صحیح علم صرف اللہ تعالیٰ کو ہے، لہٰذا اسی سے دریافت کیجیے۔ دوسری جگہ فرمایا : «{ وَ لَا يُنَبِّئُكَ مِثْلُ خَبِيْرٍ}» [ فاطر : ۱۴ ] ’’اور تجھے ایک پوری خبر رکھنے والے کی طرح کوئی خبر نہیں دے گا۔‘‘ یعنی اللہ تعالیٰ جیسا پورا باخبر۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) {وَ اِذَا قِيْلَ لَهُمُ اسْجُدُوْا لِلرَّحْمٰنِ …:} اس آیت کی دو تفسیریں ہیں، ایک یہ کہ مشرکین مکہ زمین و آسمان کے خالق کے لیے ’’اللہ‘‘ کا لفظ تو مانتے تھے، لیکن وہ اس کے نام ’’رحمان‘‘ سے مانوس نہ تھے، اس لیے اسے سنتے ہی چڑ جاتے تھے۔ دیکھیے سورۂ رعد (۳۰) اور بنی اسرائیل (۱۱۰) دوسری تفسیر اس کی یہ ہے کہ وہ لوگ یہ بات کہ ’’رحمان چیز کیا ہے‘‘ محض کافرانہ شوخی اور سراسر ہٹ دھرمی کی بنا پر کہتے تھے، جس طرح فرعون نے موسیٰ علیہ السلام سے کہا تھا : «{ وَ مَا رَبُّ الْعٰلَمِيْنَ }» [الشعراء : ۲۳ ] ’’اور رب العالمین کیا چیز ہے؟‘‘ حالانکہ نہ کفار مکہ اس بے حد رحم والی ہستی سے بے خبر تھے اور نہ فرعون رب العالمین سے نا واقف تھا، جیسا کہ موسیٰ علیہ السلام نے اسے برملا کہا تھا : «{ لَقَدْ عَلِمْتَ مَاۤ اَنْزَلَ هٰۤؤُلَآءِ اِلَّا رَبُّ السَّمٰوٰتِ وَ الْاَرْضِ بَصَآىِٕرَ }» [ بنی إسرائیل : ۱۰۲ ] ’’بلاشبہ یقینا تو جان چکا ہے کہ انھیں آسمانوں اور زمین کے رب کے سوا کسی نے نہیں اتارا، اس حال میں کہ واضح دلائل ہیں۔‘‘"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) {تَبٰرَكَ الَّذِيْ جَعَلَ فِي السَّمَآءِ بُرُوْجًا … :} اس آیت کی تفسیر کے لیے دیکھیے سورۂ حجر (۱۶) اور بروج (۱)۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) ➊ { وَ هُوَ الَّذِيْ جَعَلَ الَّيْلَ وَ النَّهَارَ خِلْفَةً:} اس آیت میں بھی اللہ تعالیٰ کی توحید، اس کی قدرت کا کمال اور نعمتوں کی یاد دہانی تینوں چیزیں موجود ہیں۔ یعنی رات اور دن ایک دوسرے کے پیچھے آتے ہیں، رات جاتی ہے تو دن آ جاتا ہے اور دن جاتا ہے تو رات آ جاتی ہے۔ اگر ہمیشہ دن رہتا یا ہمیشہ رات رہتی تو زندگی اور اس کی مصروفیات کا سلسلہ باقی نہ رہ سکتا۔ (دیکھیے قصص : ۷۱ تا ۷۳) دن رات کے اس بدلنے میں بہت سی نشانیاں ہیں۔ (دیکھیے بقرہ : ۱۶۴۔ آل عمران : ۱۹۰) ایک مطلب اس کا یہ ہے کہ دن اور رات گھٹتے بڑھتے اور ایک دوسرے کی جگہ آتے جاتے رہتے ہیں، جیسا کہ فرمایا : «{ ذٰلِكَ بِاَنَّ اللّٰهَ يُوْلِجُ الَّيْلَ فِي النَّهَارِ وَ يُوْلِجُ النَّهَارَ فِي الَّيْلِ وَ اَنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ }» [ الحج : ۶۱ ] ’’یہ اس لیے کہ اللہ رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے اور اللہ سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔‘‘ طبری نے معتبر سند کے ساتھ علی بن ابی طلحہ سے ابن عباس رضی اللہ عنھما کی تفسیر نقل فرمائی ہے : ’’جس کا کوئی کام رات کو رہ جائے تو وہ دن کو پورا کر لیتا ہے اور دن کو رہ جائے تو رات کو پورا کر لیتا ہے۔‘‘ (طبری : ۲۶۶۶۰) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ عَزَّ وَجَلَّ يَبْسُطُ يَدَهُ بِاللَّيْلِ، لِيَتُوْبَ مُسِيْءُ  النَّهَارِ، وَيَبْسُطُ يَدَهُ بِالنَّهَارِ، لِيَتُوْبَ مُسِيْءُ اللَّيْلِ، حَتّٰی تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا ] [ مسلم، التوبۃ، باب قبول التوبۃ من الذنوب … : ۲۷۵۹ ] ’’اللہ تعالیٰ رات کو اپنا ہاتھ پھیلاتا ہے، تاکہ دن کو برائی کرنے والا شخص توبہ کر لے اور دن کو اپنا ہاتھ پھیلاتا ہے، تاکہ رات کو برائی کرنے والا توبہ کر لے، یہاں تک کہ سورج مغرب سے طلوع ہو جائے۔‘‘ نبی صلی اللہ علیہ وسلمنے فرمایا : [مَنْ نَسِيَ صَلَاةً أَوْ نَامَ عَنْهَا، فَكَفَّارَتُهَا أَنْ يُصَلِّيَهَا إِذَا ذَكَرَهَا ] [ مسلم، المساجد، باب قضاء الصلاۃ الفائتۃ… : ۳۱۵ /۶۸۴ ]’’جو شخص کسی نماز سے سویا رہ جائے یا بھول جائے تو اس کا کفارہ یہ ہے کہ جب اسے وہ یاد آئے پڑھ لے۔‘‘ امیر المومنین عمر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ نَامَ عَنْ حِزْبِهِ أَوْ عَنْ شَيْءٍ مِنْهُ فَقَرَأَهُ فِيْمَا بَيْنَ صَلَاةِ الْفَجْرِ وَ صَلَاةِ الظُّهْرِ، كُتِبَ لَهُ كَأَنَّمَا قَرَأَهُ مِنَ اللَّيْلِ ] [ مسلملم، صلاۃ المسافرین، باب جامع صلاۃ اللیل : ۷۴۷ ] ’’جو شخص اپنے مقرر کر دہ وظیفے سے یا اس کے کچھ حصے سے سویا رہ جائے، پھر اسے فجر کی نماز اور ظہر کی نماز کے درمیان پڑھ لے تو گویا اس نے اسے رات ہی میں پڑھا ہے۔‘‘ ¤ {’’ خِلْفَةً ‘‘} کا ایک معنی ’’مختلف‘‘ بھی ہے، قاموس میں ہے : {’’ اَلْخِلْفُ وَالْخِلْفَةُ بِالْكَسْرِ الْمُخْتَلِفُ‘‘} اس کے مطابق معنی یہ ہو گا کہ اللہ تعالیٰ نے رات اور دن کو روشنی اور اندھیرے میں، گرمی اور سردی میں، کام اور آرام میں ایک دوسرے سے مختلف بنایا ہے۔ ¤ ➋ { لِمَنْ اَرَادَ اَنْ يَّذَّكَّرَ اَوْ اَرَادَ شُكُوْرًا :} یعنی کہ اگر کوئی کفر یا فسق کی وجہ سے غفلت میں مبتلا ہے اور چاہتا ہے کہ اسے کسی طرح نصیحت ہو تو دن رات کے ایک دوسرے کے پیچھے آنے میں اس کے لیے بہت بڑی نصیحت ہے کہ اتنی بڑی تبدیلی وہی کر سکتا ہے جو لا محدود قدرت والا اور ہر طرح صاحب اختیار ہے، اوراگر کوئی مومن اور صالح ہے اور اللہ کا شکر ادا کرنا چاہتا ہے تو دن رات کی یہ تبدیلی بہت بڑی نعمت ہے، جس پر اسے شکر ادا کرنا لازم ہے۔ رات دن کے سلسلے میں ایک نصیحت ابن العربی نے ذکر فرمائی ہے کہ ایک آدمی جس کی عمر ساٹھ (۶۰) برس ہے، وہ رات سو کر گزار دیتا ہے، تو اس کی آدھی عمر بے کار گئی، پھر دن کا تقریباً چھٹا حصہ آرام میں گزر جاتا ہے، یوں کل دو تہائی چلا گیا۔ اس کے پاس ساٹھ (۶۰) سال کی عمر میں سے بیس (۲۰) برس رہ گئے۔ کتنی بڑی جہالت اور بے وقوفی ہے کہ آدمی اپنی عمر کا دو تہائی حصہ فانی لذت میں گزار دے اور عمر عزیز کو اس دائمی لذت کے حصول کے لیے خرچ نہ کرے جو اللہ تعالیٰ نے اپنے پاس اس کے لیے تیار کر رکھی ہے۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) ➊ {وَ عِبَادُ الرَّحْمٰنِ الَّذِيْنَ يَمْشُوْنَ …:} اللہ تعالیٰ کا عبد (بندہ) ہونے کی  دو حیثیتیں ہیں، ایک یہ کہ اللہ تعالیٰ رب ہے اور یہ اس کا بندہ ہے، اس بندگی میں ساری مخلوق شریک ہے، مسلم ہوں یا کافر، نیک ہوں یا بد، سب اللہ کے عبد (بندے) ہیں، وہ سب کا رب ہے، فرمایا : «{ اِنْ كُلُّ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ اِلَّاۤ اٰتِي  الرَّحْمٰنِ عَبْدًا }» [ مریم : ۹۳ ] ’’آسمانوں اور زمین میں جو کوئی بھی ہے وہ رحمان کے پاس غلام بن کر آنے والا ہے۔‘‘ دوسری حیثیت عبد ہونے کی یہ ہے کہ اللہ تعالیٰ معبود ہے اور یہ اس کی عبادت اور بندگی کرنے والا ہے۔ اس معنی میں عباد الرحمن (رحمان کے بندے) صرف انبیاء، اولیاء اور اس کے نیک بندے ہیں۔ اس لحاظ سے جب کسی کو عبد اللہ (اللہ کا بندہ) کہا جاتا ہے، تو اسے مخلوق کے مرتبوں میں سے سب سے اونچے مرتبے پر فائز کیا جاتا ہے۔ دیکھیے سورۂ بنی اسرائیل (۱) اور سورۂ جن (۱۹)۔ ¤ ➋ رحمان کی عبادت کے لحاظ سے بندوں کی ایک قسم کا ذکر پچھلی آیات میں گزرا ہے کہ جب ان سے کہا جاتا ہے کہ رحمان کو سجدہ کرو تو وہ جانتے بوجھتے ہوئے شوخی و شرارت اور سرکشی و تکبر کے ساتھ رحمان کو جاننے ہی سے انکار کر دیتے ہیں اور کہتے ہیں رحمان ہے کیا چیز؟ اور مزید بدک جاتے ہیں، حالانکہ وہ خوب جانتے ہیں کہ رحمان کون ہے۔ اب رحمان کے ان بندوں کا ذکر ہے جو واقعی رحمان کی بندگی کرتے ہیں اور رات دن کے یکے بعد دیگرے آنے جانے سے اور کائنات کی ہر چیز سے نصیحت حاصل کرتے اور مالک کا شکر ادا کرتے ہیں، فرمایا : «{ لِمَنْ اَرَادَ اَنْ يَّذَّكَّرَ اَوْ اَرَادَ شُكُوْرًا }» [ الفرقان : ۶۲ ] ’’اس کے لیے جو چاہے کہ نصیحت حاصل کرے، یا کچھ شکر کرنا چاہے۔‘‘ اور ان کی ان صفات کا ذکر ہے جو رحمان کی بندگی سے پیدا ہوتی ہیں، جن سے وہ لوگ سراسر محروم رہتے ہیں جو رحمان کو سجدہ کرنے کے حکم پر سرکشی اور نفرت کا اظہار کرتے ہیں اور نہ نصیحت حاصل کرتے ہیں، نہ شکر اد اکرتے ہیں۔ ¤ ➌ {’’ عِبَادُ الرَّحْمٰنِ ‘‘} کے لفظ میں اشارہ ہے کہ ان کی یہ صفات ان پر رحمان کی رحمت کا نتیجہ ہیں۔ ¤ ➍ ’’عباد الرحمان‘‘ کے سب سے پہلے مصداق صحابہ کرام رضی اللہ عنھم ہیں جو ان آیات میں ذکر کر دہ تمام صفات کے ساتھ متصف تھے۔ (دیکھیے فتح : ۲۹) اس کے بعد قیامت تک آنے والے تمام متقی مومن اس کے مصداق ہیں۔ اسی طرح ’’عباد الشیطان‘‘ کے سب سے پہلے مصداق ابو لہب، ابوجہل اور ان کے ساتھی ہیں، ان کے بعد قیامت تک آنے والے تمام کفار و فجار۔ ¤ ➎ عباد الرحمان کی صفات جو اس مقام پر بیان ہوئی ہیں، چار قسم کی ہیں، پہلی قسم ان کا دینی کمالات کے ساتھ آراستہ ہونا ہے، ان کی ابتدا {’’ الَّذِيْنَ يَمْشُوْنَ عَلَى الْاَرْضِ هَوْنًا ‘‘} سے ہوتی ہے۔ دوسری قسم ان کا ہر طرح کے رذائل اور کمینگیوں سے پاک ہونا ہے، یہ {’’ وَ الَّذِيْنَ لَا يَدْعُوْنَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ ‘‘} سے شروع ہوتی ہے۔ تیسری قسم ان کا اسلام کے احکام پر کار بند ہونا ہے، ان صفات کا ذکر آیت (۶۴) : «{ وَ الَّذِيْنَ يَبِيْتُوْنَ لِرَبِّهِمْ سُجَّدًا وَّ قِيَامًا }» اور آیت (۶۷) : «{ وَ الَّذِيْنَ اِذَاۤ اَنْفَقُوْا لَمْ يُسْرِفُوْا…}» اور آیت (۶۸) : «{ وَ لَا يَقْتُلُوْنَ النَّفْسَ الَّتِيْ حَرَّمَ اللّٰهُ }» سے لے کر آیت (۷۲) : « وَ الَّذِيْنَ لَا يَشْهَدُوْنَ الزُّوْرَ » تک میں ہے اور چوتھی قسم ان کی طرف سے اس بات کی مسلسل کوشش اور اللہ تعالیٰ سے دعا ہے کہ دنیا کی زندگی میں ان کی دینی حالت بہتر سے بہتر ہوتی چلی جائے، اس کا ذکر آیت (۷۴) : «{ وَ اِذَا مَرُّوْا بِاللَّغْوِ مَرُّوْا كِرَامًا }» میں ہے۔ (ابن عاشور) ¤ ➏ { يَمْشُوْنَ عَلَى الْاَرْضِ هَوْنًا : ’’ هَوْنًا ‘‘} نرمی، مصدر بمعنی اسم فاعل برائے مبالغہ ہے : {’’أَيْ مَشْيًا ذَا هَوْنٍ‘‘} یعنی بہت نرمی والی چال چلتے ہیں۔ یعنی رحمان کے محبوب بندے وہ ہیں جو تواضع اور عاجزی اختیار کرتے ہیں اور جب زمین پر چلتے ہیں تو نرمی کے ساتھ چلتے ہیں نہ کہ فساد برپا کرنے والوں اور ظلم و جبر کرنے والوں کی طرح اینٹھتے اور اکڑتے ہوئے۔ لقمان حکیم نے اپنے بیٹے کو وصیت فرمائی : «{ وَ لَا تَمْشِ فِي الْاَرْضِ مَرَحًا اِنَّ اللّٰهَ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُوْرٍ }» [ لقمان : ۱۸ ] ’’اور زمین میں اکڑ کر نہ چل، بے شک اللہ کسی اکڑنے والے، فخر کرنے والے سے محبت نہیں کرتا۔‘‘ نرمی کی چال سے مراد سکون اور وقار کی چال ہے نہ کہ دکھاوے کے لیے بناوٹ کے ساتھ مریضوں کی طرح چلنا۔ خود رسول اللہ صلی اللہ علیہ وسلم مضبوط قدم رکھتے ہوئے چلتے تھے، چنانچہ علی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اس طرح چلتے تھے : {’’ كَأَنَّمَا يَنْحَطُّ عَنْ صَبَبٍ ‘‘} (گویا ڈھلوان کی طرف اتر رہے ہوں۔) [ مسند أحمد : 96/1، ح : ۷۴۹، قال المحقق سندہ قوي ] ابو طفیل رضی اللہ عنہ آپ صلی اللہ علیہ وسلمکے بارے میں بیان کرتے ہیں : [ كَانَ أَبْيَضَ مَلِيْحًا، إِذَا مَشَی كَأَنَّمَا يَهْوِيْ فِيْ صَبُوْبٍ ] [ أبوداوٗد، اللأدب ، باب في ھدی الرجل : ۴۸۶۴، وقال الألبانی صحیح ] ’’آپ سفید رنگ اور انتہائی خوبصورت تھے، جب چلتے تو گویا ڈھلوان میں اتر رہے ہوں۔‘‘ زمین پر نرمی کے ساتھ چلنے میں عام زندگی کا چال چلن بھی شامل ہے، کیونکہ آدمی کی چال اس کے چلن ہی کے مطابق ہوتی ہے۔ رحمان کے بندوں کی چال اور ان کا چلن دونوں سے تواضع اور نرمی کا اظہار ہوتا ہے، ان میں نہ تکبر ہوتا ہے نہ شدت، ہاں، کفار کے مقابلے میں وہ اکڑ کر بھی چلتے ہیں اور ان میں شدت بھی ہوتی ہے، جیسا کہ طواف کے اندر رمل کے حکم سے ظاہر ہے اور اللہ تعالیٰ نے فرمایا : «{ مُحَمَّدٌ رَّسُوْلُ اللّٰهِ وَ الَّذِيْنَ مَعَهٗۤ اَشِدَّآءُ عَلَى الْكُفَّارِ رُحَمَآءُ بَيْنَهُمْ }» [ الفتح : ۲۹ ] ’’محمد اللہ کا رسول ہے اور وہ لوگ جو اس کے ساتھ ہیں وہ کافروں پر بہت سخت ہیں، آپس میں نہایت رحم دل ہیں۔‘‘ اور فرمایا : «{اَذِلَّةٍ عَلَى الْمُؤْمِنِيْنَ اَعِزَّةٍ عَلَى الْكٰفِرِيْنَ }» [ المائدۃ : ۵۴ ] ’’مومنوں پر بہت نرم ہوں گے، کافروں پر بہت سخت۔‘‘ ¤ ➐ { وَ اِذَا خَاطَبَهُمُ الْجٰهِلُوْنَ قَالُوْا سَلٰمًا : ’’جَهْل‘‘} کا لفظ یہاں ’’علم‘‘ کے مقابلے میں نہیں بلکہ ’’حلم‘‘ کے مقابلے میں ہے۔{’’ الْجٰهِلُوْنَ ‘‘} کے لفظ سے یہ بات سمجھ میں آ رہی ہے کہ عباد الرحمن لوگوں سے ہمیشہ علیحدگی اور ترکِ کلام اختیار نہیں کرتے، بلکہ صرف ان کی جہالت اور اکھڑ پن کے رویے پر انھیں ترکی بہ ترکی جواب دینے اور جھگڑنے کے بجائے سلام کہہ کر گزر جاتے ہیں۔ دوسری جگہ فرمایا : «{ وَ اِذَا سَمِعُوا اللَّغْوَ اَعْرَضُوْا عَنْهُ وَ قَالُوْا لَنَاۤ اَعْمَالُنَا وَ لَكُمْ اَعْمَالُكُمْ سَلٰمٌ عَلَيْكُمْ لَا نَبْتَغِي الْجٰهِلِيْنَ }» [ القصص : ۵۵ ] ’’اور جب وہ لغو بات سنتے ہیں تو اس سے کنارہ کرتے ہیں اور کہتے ہیں ہمارے لیے ہمارے اعمال ہیں اور تمھارے لیے تمھارے اعمال۔ سلام ہے تم پر، ہم جاہلوں کو نہیں چاہتے۔‘‘ ابوامامہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَنَا زَعِيْمٌ بِبَيْتٍ فِيْ رَبَضِ الْجَنَّةِ لِمَنْ تَرَكَ الْمِرَاءَ وَإِنْ كَانَ مُحِقًّا، وَ بِبَيْتٍ فِيْ وَسَطِ الْجَنَّةِ لِمَنْ تَرَكَ الْكَذِبَ وَإِنْ كَانَ مَازِحًا، وَ بِبَيْتٍ فِيْ أَعْلَی الْجَنَّةِ لِمَنْ حَسَّنَ خُلُقَهُ ] [ أبوداوٗد، الأدب، باب في حسن الخلق : ۴۸۰۰، و حسنہ الألباني ] ’’میں جنت کے اطراف میں مکان کا ضامن ہوں، اس شخص کے لیے جو جھگڑا چھوڑ دے خواہ حق دار ہو اور جنت کے وسط میں مکان کا ضامن ہوں اس شخص کے لیے جو جھوٹ چھوڑ دے خواہ مذاق سے ہو اور جنت کے سب سے بلند مقام پر مکان کا ضامن ہوں اس شخص کے لیے جو اپنا خلق (اخلاق) اچھا بنا لے۔‘‘"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) {وَ الَّذِيْنَ يَبِيْتُوْنَ لِرَبِّهِمْ …:} پچھلی آیت میں لوگوں کے ساتھ ان کے معاملے کا ذکر تھا، اس آیت میں اپنے رب کے ساتھ ان کے معاملے کا ذکر ہے۔ حسن بصری نے فرمایا : ’’پچھلی آیت میں ان کے دن کا ذکر ہے اور اس آیت میں ان کی رات کا۔‘‘ اس آیت سے قیام اللیل کی اہمیت ثابت ہوتی ہے۔ مزید دیکھیے آیت : «{ تَتَجَافٰى جُنُوْبُهُمْ عَنِ الْمَضَاجِعِ }» [ السجدۃ : ۱۶ ] اور آیت : «{ كَانُوْا قَلِيْلًا مِّنَ الَّيْلِ مَا يَهْجَعُوْنَ }» [ الذاریات : ۱۷ ] امیر المومنین عثمان بن عفان رضی اللہ عنہ نے فرمایا، میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : [ مَنْ صَلَّی الْعِشَاءَ فِيْ جَمَاعَةٍ فَكَأَنَّمَا قَامَ نِصْفَ اللَّيْلِ وَ مَنْ  صَلَّی الصُّبْحَ فِيْ جَمَاعَةٍ فَكَأَنَّمَا صَلَّی اللَّيْلَ كُلَّهُ] [مسلم، المساجد و مواضع الصلاۃ، باب فضل صلاۃ العشاء والصبح في جماعۃ : ۶۵۶ ] ’’جو شخص عشاء کی نماز جماعت کے ساتھ پڑھے تو گویا اس نے نصف رات قیام کیا اور جو صبح کی نماز جماعت کے ساتھ پڑھے تو گویا اس نے ساری رات نماز پڑھی۔‘‘ اس حدیث سے عشاء اور فجر جماعت کے ساتھ پڑھنے پر قیام اللیل کا اجر حاصل ہونا ثابت ہوتا ہے، اس کے باوجود کوئی شک نہیں کہ جو لوگ اس کے علاوہ بھی قیام اللیل کی پابندی کرتے ہیں ان کے درجے کو وہ لوگ نہیں پہنچ سکتے جو صرف فرائض پر اکتفا کرتے ہیں۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) ➊ { وَ الَّذِيْنَ يَقُوْلُوْنَ رَبَّنَا اصْرِفْ عَنَّا … :} مخلوق اور خالق کے ساتھ اپنا معاملہ درست کرنے کے باوجود ان میں غرور یا خود پسندی کا شائبہ تک نہیں ہوتا، بلکہ وہ اپنی کوتاہیوں کی وجہ سے اپنے آپ کو عذاب کا مستحق سمجھتے ہوئے ہمیشہ اللہ تعالیٰ سے اس کی رحمت اور عفو کے طلب گار اور عذاب جہنم سے بچنے کے خواست گار رہتے ہیں۔ سورۂ مومنون کی آیت (۶۰) : «{ وَ الَّذِيْنَ يُؤْتُوْنَ مَاۤ اٰتَوْا وَّ قُلُوْبُهُمْ وَجِلَةٌ }» (اور وہ کہ انھوں نے جو کچھ دیا اس حال میں دیتے ہیں کہ ان کے دل ڈرنے والے ہوتے ہیں) میں ان کی یہی کیفیت بیان ہوئی ہے اور سورۂ ذاریات کی آیت (۱۷، ۱۸) : «{ كَانُوْا قَلِيْلًا مِّنَ الَّيْلِ مَا يَهْجَعُوْنَ (17) وَ بِالْاَسْحَارِ هُمْ يَسْتَغْفِرُوْنَ}» (وہ رات کے بہت تھوڑے حصے میں سوتے تھے اور رات کی آخری گھڑیوں میں وہ بخشش مانگتے تھے) میں مذکور ساری رات قیام کے بعد سحریوں کے وقت استغفار کا باعث بھی ان کا یہی احساس ہوتا ہے۔ ¤ ➋ {اِنَّ عَذَابَهَا كَانَ غَرَامًا : ’’ غَرَامًا ‘‘} ’’چمٹ جانے والا‘‘ جس طرح مقروض جب تک قرض ادا نہ کرے غریم (قرض خواہ) اس کی جان نہیں چھوڑتا، جیسے شاعر نے کہا ہے: ¤ {سَتَعْلَمُ لَيْلٰي أَيَّ دَيْنٍ تَدَانَيَتْ ¤ وَ أَيَّ غَرِيْمٍ فِي التَّقَاضِيْ غَرِيْمُهَا} ¤ ’’لیلیٰ جان لے گی کہ اس نے کون سا قرض اٹھا لیا ہے اور تقاضا کرنے میں اس کا قرض خواہ کیسا قرض خواہ ہے؟‘‘ ¤ یہ جملہ عباد الرحمان کا قول بھی ہو سکتا ہے اور رب رحمان کا فرمان بھی۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) { اِنَّهَا سَآءَتْ مُسْتَقَرًّا وَّ مُقَامًا:’’ مُسْتَقَرًّا ‘‘} کچھ مدت ٹھہرنے کی جگہ گناہ گار مسلمانوں کے لیے اور {’’ مُقَامًا ‘‘} ہمیشہ اقامت کی جگہ کفار کے لیے۔ یہ جملہ بھی رب رحمان اور عباد الرحمان دونوں کا ہو سکتا ہے۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) {وَ الَّذِيْنَ اِذَاۤ اَنْفَقُوْا لَمْ يُسْرِفُوْا وَ لَمْ يَقْتُرُوْا … :} لوگوں کے ساتھ اور اپنے رب کے ساتھ رویے کے بعد ان کے مالی معاملے کا ذکر ہے۔ اسراف کا اطلاق کسی کام میں ضرورت سے زیادہ خرچ کرنے پر ہوتا ہے، مثلاً کھانے پینے یا لباس یا مکان یا شادی بیاہ وغیرہ پر بے دریغ خرچ کر دینا (ایک بلب کی ضرورت ہو تو زیادہ بلب لگا دینا، تھوڑے پانی سے کام چلتا ہو تو بے دریغ پانی بہا دینا) یا اپنی ہمت اور مقدور سے زیادہ خرچ کر دینا (پھر قرض اتارتے رہنا یا مانگنا شروع کر دینا) ایسی فضول خرچیوں سے اللہ تعالیٰ نے منع فرمایا ہے۔ پھر اسراف کی ایک قسم تبذیر ہے، جس کا معنی ہے بلاضرورت خرچ کرنا، مثلاً دن کو بھی گلی میں بلب جلائے رکھنا، یا پانی کی ٹونٹی کھلی چھوڑ دینا۔ اسی طرح ناجائز کاموں میں خرچ کرنا بھی تبذیر ہے، جیسے شراب، زنا، جوئے، گانے بجانے یا آتش بازی وغیرہ ایسے کاموں میں ایک پیسہ بھی خرچ کرنا حرام ہے۔ اسراف کی ضد ’’قتور‘‘ ہے، جو {’’قَتَرَ يَقْتُرُ} (ن، ض) {قَتْرًا وَ قُتُوْرًا‘‘} سے ہے۔ باب ’’افعال‘‘ اور ’’تفعیل‘‘ سے {’’إِقْتَارٌ‘‘} اور {’’تَقْتِيْرٌ‘‘ } بھی اسی معنی میں آتا ہے، یعنی خرچ میں تنگی کرنا، شدید بخل کہ مقدور ہوتے ہوئے بھی ضرورت سے کم خرچ کرنا اور مال کو جوڑ جوڑ کر رکھنا، اپنی ذات اور اہل و عیال کی جائز ضروریات میں بھی بخل کرنا۔ اسراف اور تقتیر کے درمیان کی صفت کا نام اقتصاد (میانہ روی) ہے، یعنی اتنا خرچ کرنا جتنی ضرورت ہے اور جتنی ہمت ہے۔ اللہ تعالیٰ نے اسے {’’ بَيْنَ ذٰلِكَ قَوَامًا ‘‘} کے الفاظ سے تعبیر فرمایا ہے۔ {’’قَوَامٌ‘‘} دو چیزوں کے عین درمیان کو کہتے ہیں۔ مزید دیکھیے سورۂ انعام (۱۴۲)، اعراف (۳۱) اور بنی اسرائیل (۲۶، ۲۹)۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) ➊ { وَ الَّذِيْنَ لَا يَدْعُوْنَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ :} یہ عباد الرحمن کی صفات کی ایک اور قسم ہے، یعنی ان برائیوں اور کمینگیوں سے پاک ہونا جو مشرکین میں پائی جاتی ہیں اور عباد الرحمان ایمان کی وجہ سے ان سے محفوظ رہتے ہیں۔ یہاں ان کے تین بڑی برائیوں سے بچے رہنے کا ذکر فرمایا، یعنی شرک، قتل ناحق اور زنا۔ اگرچہ کبیرہ گناہ اور بھی بہت سے ہیں، مگر عرب کے معاشرے میں اس وقت زیادہ تسلط انھی تین گناہوں کا تھا، اس لیے مسلمانوں کی اس خصوصیت کو نمایاں کیا گیا، اس سے مشرکین پر چوٹ بھی مقصود ہے کہ وہ اتنی نمایاں برائیوں میں مبتلا ہیں جن کی برائی ہر عقل سلیم پر واضح ہے۔ ¤ ➋ { وَ لَا يَقْتُلُوْنَ النَّفْسَ الَّتِيْ حَرَّمَ اللّٰهُ :} مراد ہرہر انسانی جان ہے، کیونکہ کسی بھی انسانی جان کا قتل اللہ نے حرام کیا ہے۔ ¤ ➌ { اِلَّا بِالْحَقِّ:} جیسے جان کے بدلے جان، شادی شدہ زانی کا رجم، مرتد کو قتل کرنا، جنگ میں کافر کو قتل کرنا اور مسلم یا غیر مسلم محارب کو قتل کرنا، یہ سب صورتیں {’’ اِلَّا بِالْحَقِّ ‘‘} کے تحت آتی ہیں۔ یہ تینوں گناہ اسی ترتیب کے ساتھ ایک حدیث میں بھی مذکور ہیں، عبد اللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم سے پوچھا گیا : ’’کون سا گناہ سب بڑا ہے؟‘‘ فرمایا : ’’یہ کہ تم کسی کو اللہ کا شریک قرار دو، حالانکہ اسی نے تمھیں پیدا فرمایا۔‘‘ سائل نے کہا : ’’پھر کون سا؟‘‘ فرمایا : ’’یہ کہ تم اپنی اولاد کو اس اندیشے سے قتل کر دو کہ وہ تمھارے ساتھ کھانے میں شریک ہو گی۔‘‘ اس نے کہا : ’’پھر کون سا؟‘‘ فرمایا : ’’یہ کہ تم اپنے ہمسائے کی بیوی کی رضا سے اس کے ساتھ زنا کرو۔‘‘ تو اللہ تعالیٰ نے اس کی تصدیق میں یہ آیت اتار دی : «{ وَ الَّذِيْنَ لَا يَدْعُوْنَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ }» [ الفرقان : ۶۸ ] [ بخاری، الأدب، باب قتل الولد … : ۶۰۰۱ ] ¤ ➍ { وَ مَنْ يَّفْعَلْ ذٰلِكَ يَلْقَ اَثَامًا : ’’ اَثَامًا ‘‘ ’’إِثْمٌ‘‘} میں الف کے اضافے سے معنی میں اضافہ ہو گیا، ’’سخت گناہ۔‘‘ اس کا معنی گناہ کی جزا بھی آتا ہے، یعنی سخت گناہ کی سزا پائے گا۔ ابن کثیر میں ہے کہ عبد اللہ بن عمرو رضی اللہ عنھما نے فرمایا : ’’اثام جہنم میں ایک وادی ہے۔‘‘ دکتور حکمت بن بشیر نے فرمایا : ’’اسے طبری نے صحیح سند کے ساتھ روایت کیا ہے۔‘‘"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) { يُضٰعَفْ لَهُ الْعَذَابُ يَوْمَ الْقِيٰمَةِ … : ’’ فِيْهٖ ‘‘} میں ہائے ضمیر کے کسرہ کے ساتھ یاء ملا دی گئی ہے، اسے اشباع کہتے ہیں۔ ان تینوں برائیوں کو ایک ہی {’’ الَّذِيْنَ ‘‘} کے صلے کے طور پر ذکر کیا ہے، گویا ان کے مجموعے کو ایک برائی قرار دیا ہے۔ {’’ذٰلِكَ ‘‘} کا اشارہ بھی اس مجموعے کی طرف ہے۔ مراد اس سے کفار ہیں، کیونکہ مومن نہ غیر اللہ کو پکارتا ہے، نہ وہ ابدی جہنمی ہے، جبکہ ان تینوں کے مرتکب کے لیے دگنے عذاب کی اور اس میں ذلیل ہو کر ہمیشہ رہنے کی وعید ہے۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) ➊ { اِلَّا مَنْ تَابَ وَ اٰمَنَ وَ عَمِلَ عَمَلًا صَالِحًا …:} ابن عباس رضی اللہ عنھما نے فرمایا : ’’اہلِ شرک میں سے کچھ لوگوں نے قتل کیے اور بہت کیے اور زنا کیے اور بہت کیے، پھر وہ محمد صلی اللہ علیہ وسلم کے پاس آئے اور کہنے لگے : ’’آپ جو بات کہتے ہیں اور جس کی دعوت دیتے ہیں وہ بہت اچھی ہے، اگر آپ ہمیں یہ بتا دیں کہ ہم نے جو کچھ کیا اس کا کوئی کفارہ ہے؟‘‘ تو یہ آیت اتری : «{ وَ الَّذِيْنَ لَا يَدْعُوْنَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ … }» [ الفرقان : ۶۸ ] اور یہ آیت اتری : «{ يٰعِبَادِيَ الَّذِيْنَ اَسْرَفُوْا عَلٰۤى اَنْفُسِهِمْ لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ }» [ الزمر : ۵۳ ] ’’اے میرے بندو جنھوں نے اپنی جانوں پر زیادتی کی! اللہ کی رحمت سے نا امید نہ ہو جاؤ۔‘‘ [ مسلم، الإیمان، باب کون الإسلام یھدم ما قبلہ… : ۱۲۲ ] یہ آیت ان لوگوں کے لیے بشارت ہے جن کی زندگی پہلے طرح طرح کے جرائم سے آلودہ رہی ہو اور اب وہ اپنی اصلاح پر آمادہ ہوں، یہی عام معافی کا دن تھا جس نے اس بگڑے ہوئے معاشرے کے لاکھوں انسانوں کو سہارا دے کر مستقبل کے بگاڑ سے بچا لیا اور انھیں امید کی روشنی دکھا کر اصلاح پر آمادہ کیا۔ اگر ان سے کہا جاتا کہ جو گناہ تم کر چکے ہو ان کی سزا سے اب تم کسی طرح بچ نہیں سکتے تو وہ ہمیشہ کے لیے بدی کے بھنور میں پھنس جاتے۔ توبہ کی اس نعمت نے بگڑے ہوئے لوگوں کو کس طرح سنبھالا، اس کا اندازہ ان بہت سے واقعات سے ہوتا ہے جو نبی صلی اللہ علیہ وسلم کے زمانے میں پیش آئے، عمرو بن عاص رضی اللہ عنہ فرماتے ہیں : ’’جب اللہ تعالیٰ نے اسلام کی محبت میرے دل میں ڈال دی تو میں نبی صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے عرض کی : ’’اپنا دایاں ہاتھ آگے کیجیے، تاکہ میں آپ کی بیعت کروں۔‘‘ آپ صلی اللہ علیہ وسلم نے اپنا دایاں ہاتھ آگے بڑھایا تو میں نے اپنا ہاتھ پیچھے کھینچ لیا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اے عمرو! تجھے کیا ہوا؟‘‘ میں نے کہا : ’’میری ایک شرط ہے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تیری کیا شرط ہے؟‘‘ میں نے کہا : [ أَنْ يُّغْفَرَ لِيْ، قَالَ أَمَا عَلِمْتَ يَا عَمْرُو! أَنَّ الْإِسْلَامَ يَهْدِمُ  مَا كَانَ قَبْلَهُ؟ وَ أَنَّ الْهِجْرَةَ تَهْدِمُ مَا كَانَ قَبْلَهَا؟ وَأَنَّ الْحَجَّ يَهْدِمُ مَا كَانَ قبْلَهُ؟ ] [ مسلم، الإیمان، باب کون الإسلام یھدم ما قبلہ و کذا الھجرۃ والحج : ۱۲۱ ] ’’(میری شرط یہ ہے) کہ میرے گناہ معاف ہوں (جو اب تک کیے ہیں)۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اے عمرو! کیا تو جانتا نہیں کہ اسلام اپنے سے پہلے کے گناہوں کو ختم کر دیتا ہے؟ اور یہ کہ ہجرت اپنے سے پہلے گناہوں کو مٹا دیتی ہے؟ اور یہ کہ حج اپنے سے پہلے گناہوں کو ختم کر دیتا ہے؟‘‘ ¤ ➋ اللہ تعالیٰ نے برائیوں کو نیکیوں میں بدلنے کے لیے تین شرطیں رکھی ہیں، پہلی توبہ، یعنی گناہ سے باز آ جانا، گزشتہ گناہوں پر ندامت اور آئندہ کے لیے گناہ نہ کرنے کا عزم۔ دوسری شرط ایمان ہے، کیونکہ ایمان کے بغیر کوئی عمل قبول ہی نہیں اور تیسری شرط عمل صالح ہے، یعنی اللہ اور اس کے رسول کے حکم کے مطابق عمل کرنا۔ {’’ عَمَلًا صَالِحًا ‘‘} نکرہ ہونے کی وجہ سے ترجمہ کیا ہے ’’اورعمل کیا، کچھ نیک عمل۔‘‘ شاہ عبد القادر رحمہ اللہ نے ترجمہ کیا ہے ’’اور کیا کچھ نیک کام۔‘‘ اس میں بشارت ہے کہ اللہ تعالیٰ کے ہاں توبہ اور ایمان کے ساتھ تھوڑے عمل صالح کی بھی بہت قدر ہے۔ ¤ ➌ { فَاُولٰٓىِٕكَ يُبَدِّلُ اللّٰهُ سَيِّاٰتِهِمْ حَسَنٰتٍ :} اس کی دو تفسیریں ہیں، ایک یہ کہ اللہ تعالیٰ دنیا میں انھیں گناہوں کی جگہ نیکیوں کی توفیق دے گا، کفر اور شرک کی جگہ وہ ایمان اور توحید پر قائم ہوں گے، مومنوں کو قتل کرنے کے بجائے میدان جنگ میں کفار کو قتل کریں گے۔ زنا کی جگہ پاک دامنی پر، جھوٹ کی جگہ صدق پر اور نافرمانی کی جگہ فرماں برداری پر قائم ہوں گے۔ (و علی ہذا القیاس) یہ تفسیر ابن عباس رضی اللہ عنھما سے معتبر سند کے ساتھ طبری نے نقل فرمائی ہے۔ ¤ دوسری یہ کہ اللہ تعالیٰ قیامت کے دن ان کے تمام گناہوں کو نیکیوں میں بدل دے گا، یہ تفسیر رسول اللہ صلی اللہ علیہ وسلم سے آئی ہے۔ ابوذر غفاری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنِّيْ لَأَعْلَمُ آخِرَ أَهْلِ الْجَنَّةِ دُخُوْلًا الْجَنَّةَ، وَآخِرَ أَهْلِ النَّارِ خُرُوْجًا مِنْهَا، رَجُلٌ يُؤْتٰی بِهِ يَوْمَ اللْقِيَامَةِ، فَيُقَالُ اعْرِضُوْا عَلَيْهِ صِغَارَ ذُنُوْبِهِ وَارْفَعُوْا عَنْهُ كِبَارَهَا، فَتُعْرَضُ عَلَيْهِ صِغَارُ  ذُنُوْبِهِ، فَيُقَالُ عَمِلْتَ يَوْمَ كَذَا وَ كَذَا، كَذَا وَ كَذَا، وَ عَمِلْتَ يَوْمَ كَذَا وَ كَذَا، كَذَا وَ كَذَا، فَيَقُوْلُ نَعَمْ، لَا يَسْتَطِيْعُ أَنْ يُّنْكِرَ، وَهُوَ مُشْفِقٌ مِنْ كِبَارِ ذُنُوْبِهِ أَنْ تُّعْرَضَ عَلَيْهِ، فَيُقَالُ لَهُ فَإِنَّ لَكَ مَكَانَ كُلِّ سَيِّئَةٍ حَسَنَةً، فَيَقُوْلُ رَبِّ! قَدْ عَمِلْتُ أَشْيَاءَ لَا أَرَاهَا هٰهُنَا، فَلَقَدْ رَأَيْتُ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ ضَحِكَ حَحَتّٰی بَدَتْ نَوَاجِذُهُ] [مسلم، الإیمان، باب أدنٰی أہل الجنۃ منزلۃ فیھا : ۱۹۰ ] ’’میں اس شخص کو جانتا ہوں جو جنت میں داخل ہونے والوں میں سب سے آخری اور جہنم سے نکلنے والوں میں سب سے آخری ہو گا، وہ ایسا آدمی ہو گا جسے قیامت کے دن لایا جائے گا اور کہا جائے گا : ’’اس کے سامنے اس کے چھوٹے گناہ پیش کرو اور اس کے بڑے گناہ بچائے رکھو۔‘‘ تو اس کے سامنے اس کے چھوٹے گناہ پیش کیے جائیں گے اور کہا جائے گا : ’’تو نے فلاں فلاں دن یہ یہ عمل کیے تھے اور فلاں فلاں دن یہ یہ عمل کیے تھے؟‘‘ وہ کہے گا : ’’ہاں!‘‘ انکار نہیں کر سکے گا اور وہ اپنے بڑے گناہوں کے پیش کیے جانے سے ڈر رہا ہو گا، تو اس سے کہا جائے گا : ’’تمھارے لیے ہر برائی کی جگہ ایک نیکی ہے۔‘‘ تو وہ کہے گا : ’’اے میرے رب! میں نے کئی کام کیے ہیں جو مجھے یہاں دکھائی نہیں دے رہے۔‘‘ (ابو ذر رضی اللہ عنہ کہتے ہیں) : ’’تو میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا آپ ہنسے یہاں تک کہ آپ کی ڈاڑھیں ظاہر ہو گئیں۔‘‘ ¤‘ ¤ ➍ اہلِ علم نے گناہوں کو نیکیوں میں بدلنے کی توجیہ یہ بیان فرمائی ہے کہ گناہ جتنی بار یاد آتے ہیں ان پر ندامت اور استغفار مسلسل نیکی ہے، اسی طرح توبہ کے بعد یہ عزم کہ آئندہ اگر موقع ملا تو میں ہمیشہ برائی کے بجائے نیکی کروں گا، یہ عزم ایسی نیکی ہے جو انسان کو جنت کا ابدی وارث بنا دیتی ہے۔ گزشتہ پر ندامت یا آئندہ کا عزم اور اس کے ساتھ اللہ تعالیٰ کا فضل و کرم گناہوں کو نیکیوں میں بدلنے کا باعث بن جائے گا۔ (بقاعی) ایک اور توجیہ یہ ہے کہ وہ شخص جس نے گناہ کیا ہی نہیں، مثلاً زنا یا چوری کی ہی نہیں، اسے گناہ سے بچنے میں کوئی دشواری پیش نہیں آتی، بخلاف اس شخص کے جو زنا کا مرتکب رہا ہے، اسے زنا چھوڑنے میں جس قدر دشواری پیش آتی ہے اسے برداشت کرنا اور گناہ نہ کرنا بہت بڑی نیکی ہے۔ ¤ ➎ { وَ كَانَ اللّٰهُ غَفُوْرًا رَّحِيْمًا :} بظاہر گناہوں کو نیکیوں میں بدلنابدلنا بعید معلوم ہوتا ہے، اس کا جواب دیا کہ اللہ تعالیٰ ہمیشہ سے گناہوں پر پردہ ڈالنے والا اور بے حد رحم کرنے والا ہے، اس سے یہ کرم کچھ بھی بعید نہیں۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) {وَ مَنْ تَابَ وَ عَمِلَ صَالِحًا فَاِنَّهٗ يَتُوْبُ …:} یہاں ایک سوال یہ ہے کہ پچھلیی آیت میں توبہ کے ذکر کے بعد دوبارہ توبہ کے ذکر میں کیا حکمت ہے؟ اور ایک یہ کہ یہ کہنا کہ ’’جو شخص توبہ کرے تو وہ توبہ کرتا ہے…‘‘ ایسے ہی ہے جیسے کوئی کہے {’’مَنْ قَامَ فَإِنَّهُ يَقُوْمُ‘‘} یعنی جو کھڑا ہو تو وہ کھڑا ہوتا ہے، تو اس سے کیا فائدہ حاصل ہوا؟ اس کا جواب کئی طرح سے دیا گیا ہے، ایک یہ کہ اس میں توبہ کی ترغیب دلائی گئی ہے کہ جو شخص توبہ کرے اور عمل صالح کرے، تو اسے جان لینا چاہیے کہ وہ اس توبہ کے ساتھ کسی معمولی ہستی کی طرف پلٹ کر نہیں جا رہا، بلکہ اللہ تعالیٰ کی طرف پلٹ کر جا رہا ہے، جو بندے کی توبہ سے بہت محبت کرتا ہے اور اس کی توبہ معمولی نہیں بلکہ بڑی شان والی اور سچی توبہ ہے۔ ¤ دوسرا یہ کہ اگرچہ پچھلی آیت میں بھی عملِ صالح کا ذکر تھا مگر اس کی اہمیت کے پیشِ نظر اللہ تعالیٰ نے اسے پھر دہرایا اور فرمایا کہ صرف زبانی توبہ اللہ کے ہاں معتبر نہیں، اس کے مطابق عمل بھی ضروری ہے، چنانچہ جو شخص توبہ کرے اور نیک اعمال کرے وہ اللہ کی طرف سچی اور حقیقی توبہ کرتا ہے اور جو قدرت کے باوجود عمل نہ کرے اس کا توبہ کا دعویٰ قبول نہیں اور اس کی توبہ سچی اور حقیقی نہیں، بلکہ جھوٹی اور بے کار ہے۔ تیسرا یہ کہ پچھلی آیت میں کفر کے زمانے میں کیے ہوئے گناہوں سے توبہ کا ذکر تھا، اس آیت میں مسلمان ہونے کے بعد کیے ہوئے گناہوں سے توبہ کا ذکر ہے کہ مسلمان ہونے کے بعد بھی کوئی شخص کسی بھی گناہ سے توبہ کرے تو اس کی توبہ بھی سچی اور مقبول توبہ ہو گی۔ ابن عباس رضی اللہ عنھما مسلمان قاتل کی توبہ قبول ہونے کے قائل نہیں، اس آیت سے اس کی توبہ کا قبول ہونا بھی ثابت ہوتا ہے۔ تفصیل کے لیے دیکھیے سورۂ نساء کی آیت (۹۳) : «{ وَ مَنْ يَّقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا }» کی تفسیر۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) ➊ {وَ الَّذِيْنَ لَا يَشْهَدُوْنَ الزُّوْرَ:} اہل ایمان کی تین بنیادی صفات کے بعد اب چند مزید صفات کا ذکر ہوتا ہے، جن کے ساتھ ایمان میں کمال حاصل ہوتا ہے۔ {’’شَهِدَ يَشْهَدُ‘‘ } حاضر ہونے کے معنی میں آتا ہے اور اس کا اصل مفہوم یہی ہے، جیسا کہ فرمایا : «{ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ }» [ البقرۃ : ۱۸۵ ] ’’تو تم میں سے جو اس مہینے میں حاضر ہو وہ اس کا روزہ رکھے۔‘‘ اور کسی چیز کے متعلق گواہی دینے کے لیے بھی آتا ہے، جس میں وہ حاضر رہا ہو یا جانتا ہو، جیسا کہ فرمایا : «{ وَ اَشْهِدُوْا ذَوَيْ عَدْلٍ مِّنْكُمْ }» [ الطلاق : ۲ ] ’’اور اپنوں میں سے دو صاحب عدل آدمی گواہ بنا لو۔‘‘ اور فرمایا : «{ شَهِدَ اللّٰهُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا هُوَ وَ الْمَلٰٓىِٕكَةُ وَ اُولُوا الْعِلْمِ قَآىِٕمًۢا بِالْقِسْطِ }» [ آل عمران : ۱۸ ]’’اللہ نے گواہی دی کہ بے شک حقیقت یہ ہے کہ اس کے سوا کوئی معبود نہیں اور فرشتوں نے اور علم والوں نے بھی، اس حال میں کہ وہ انصاف پر قائم ہے۔‘‘ ¤ اس آیت کے دو معنی ہو سکتے ہیں، ایک یہ کہ وہ باطل کی مجلسوں میں حاضر نہیں ہوتے، جن میں مشرکین حاضر ہوتے ہیں۔ وہ لہو و لعب، گانے بجانے، غیبت یا بدکاری کی مجلسیں ہوں یا ظلم و زیادتی یا کسی بھی گناہ کی منصوبہ بندی کی مجلسیں، یا کفار کے جشنوں، ان کے کھیل تماشوں کی مجلسیں، غرض ایسی ہر مجلس میں شرکت سے وہ اجتناب کرتے ہیں۔ اس صورت میں لفظ {’’الزُّوْرَ ‘‘ ’’ لَا يَشْهَدُوْنَ ‘‘} کا مفعول بہ ہو گا۔ یہی مفہوم سورۂ انعام میں بیان ہوا ہے، فرمایا : «{ وَ اِذَا رَاَيْتَ الَّذِيْنَ يَخُوْضُوْنَ فِيْۤ اٰيٰتِنَا فَاَعْرِضْ عَنْهُمْ حَتّٰى يَخُوْضُوْا فِيْ حَددِيْثٍ غَيْرِهٖ وَ اِمَّا يُنْسِيَنَّكَ الشَّيْطٰنُ فَلَا تَقْعُدْ بَعْدَ الذِّكْرٰى مَعَ الْقَوْمِ الظّٰللِمِيْنَ }» [الأنعام : ۶۸ ] ’’اور جب تو ان لوگوں کو دیکھے جو ہماری آیات کے بارے میں (فضول) بحث کرتے ہیں تو ان سے کنارہ کر، یہاں تک کہ وہ اس کے علاوہ بات میں مشغول ہو جائیں اور اگر کبھی شیطان تجھے ضرور ہی بھلا دے تو یا د آنے کے بعد ایسے ظالم لوگوں کے ساتھ مت بیٹھ۔‘‘ اور {’’يَشْهَدُوْنَ‘‘} کا معنی گواہی بھی ہو سکتا ہے، اس صورت میں {’’ لَا يَشْهَدُوْنَ الزُّوْرَ ‘‘} سے مراد {’’لَا يَشْهَدُوْنَ بِالزُّوْرِ‘‘} یا {’’لَا يَشْهَدُوْنَ شَهَادَةَ الزُّوْرِ‘‘} ہو گا کہ وہ جھوٹی گواہی نہیں دیتے۔ انس رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم سے کبیرہ گناہوں کے متعلق سوال کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْإِشْرَاكُ بِاللّٰهِ وَ عُقُوْقُ الْوَالِدَيْنِ وَ قَتْلُ النَّفْسِ وَ شَهَادَةُ الزُّوْرِ ] [ بخاري، الشھادات، باب ما قیل في شھادۃ الزور : ۲۶۵۳ ] ’’اللہ کے ساتھ شریک ٹھہرانا، والدین کو ستانا، کسی جان کو قتل کرنا اور جھوٹی گواہی دینا۔‘‘ ابن کثیر رحمہ اللہ نے فرمایا : ’’آیات کے سیاق سے زیادہ ظاہر بات یہی ہے کہ وہ جھوٹ اور باطل کی مجلس میں شریک نہیں ہوتے۔‘‘ ¤ ➋ { وَ اِذَا مَرُّوْا بِاللَّغْوِ مَرُّوْا كِرَامًا:’’ كِرَامًا ‘‘} کریم کا اصل معنی وہ چیز ہے جو اپنی قسم میں سب سے عمدہ ہو، جیسا کہ فرمایا : «{فَاَنْۢبَتْنَا فِيْهَا مِنْ كُلِّ زَوْجٍ کَرِیْمٍ}» [ لقمان : ۱۰ ] ’’پھر ہم نے اس میں ہر طرح کی عمدہ قسم اگائی۔‘‘ ’’لغو‘‘ کا معنی بے فائدہ اور بے کار چیز، یعنی {’’كُلَّ مَا يَنْبَغِيْ أَنْ يُّلْغٰي وَ يُطْرَحُ ‘‘} کہ ہر وہ چیز جو بے کار کیے جانے اورپھینکے جانے کے لائق ہو۔ (کشاف) اس میں ہر گناہ آ جاتا ہے، یعنی رحمان کے بندے بے ہودہ مجالس میں شریک نہیں ہوتے اور اگر ایسی کسی مجلس پر ان کا گزر ہو تو الجھنے اور لڑنے کے بجائے بہت باعزت اور عمدہ ترین طریقے سے گزر جاتے ہیں۔ دوسری جگہ فرمایا : «{ وَ ذَرِ الَّذِيْنَ اتَّخَذُوْا دِيْنَهُمْ لَعِبًا وَّ لَهْوًا }» [ الأنعام : ۷۰ ] ’’اور ان لوگوں کو چھوڑ دے جنھوں نے اپنے دین کو کھیل اور دل لگی بنا لیا۔‘‘ اور فرمایا : «{ وَ اِذَا سَمِعُوا اللَّغْوَ اَعْرَضُوْا عَنْهُ وَ قَالُوْا لَنَاۤ اَعْمَالُنَاا وَ لَكُمْ اَعْمَالُكُمْ سَلٰمٌ عَلَيْكُمْ لَا نَبْتَغِي الْجٰهِلِيْنَ }» [ القصص : ۵۵ ] ’’اور جب وہ لغو بات سنتے ہیں تو اس سے کنارہ کرتے ہیں اور کہتے ہیں ہمارے لیے ہمارے اعمال ہیں اور تمھارے لیے تمھارے اعمال۔ سلام ہے تم پر، ہم جاہلوں کو نہیں چاہتے۔‘‘"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) {وَ الَّذِيْنَ اِذَا ذُكِّرُوْا بِاٰيٰتِ رَبِّهِمْ …:} ’’بہرے اور اندھے ہو کر نہیں گرتے‘‘ بلکہ وہ انھیں نہایت غور و فکر سے سنتے اور ان کا گہرا اثر قبول کرتے ہیں۔ اس میں کفار پر چوٹ ہے کہ وہ اپنے رب کی آیات سن کر ذرہ بھر متاثر نہیں ہوتے، بلکہ اپنے کفر پر سختی سے جمے رہتے ہیں۔ نوح علیہ السلام نے اپنی قوم کے کفار کا یہی نقشہ کھینچا ہے، فرمایا : «{ وَ اِنِّيْ كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوْۤا اَصَابِعَهُمْ فِيْۤ اٰذَانِهِمْ وَ اسْتَغْشَوْا ثِيَابَهُمْ وَ اَصَرُّوْا وَ اسْتَكْبَرُوا اسْتِكْبَارًا }» [ نوح : ۷ ] ’’اور بے شک میں نے جب بھی انھیں دعوت دی، تاکہ تو انھیں معاف کردے، انھوں نے اپنی انگلیاں اپنے کانوں میں ڈال لیں اور اپنے کپڑے اوڑھ لیے اور اَڑ گئے اور تکبر کیا، بڑا تکبر کرنا۔‘‘ کفار کی اس حالت کے بیان کے لیے دیکھیے سورۂ حم السجدہ (۵، ۲۶)۔ زمخشری نے فرمایا کہ اس کا معنی یہ نہیں کہ رحمان کے بندے آیات کے ساتھ نصیحت سن کر گرتے نہیں، بلکہ مطلب یہ ہے کہ اندھے بہرے ہو کر نہیں گرتے بلکہ سنتے اور دیکھتے ہوئے گر جاتے ہیں، جیسا کہ فرمایا : «{ اِنَّمَا يُؤْمِنُ بِاٰيٰتِنَا الَّذِيْنَ اِذَا ذُكِّرُوْا بِهَا خَرُّوْا سُجَّدًا وَّ سَبَّحُوْا بِحَمْدِ رَبِّهِمْ وَ هُمْ لَا ي يَسْتَكْبِرُوْنَ۠ }» [ السجدۃ : ۱۵ ] ’’ہماری آیات پر تو وہی لوگ ایمان لاتے ہیں کہ جب انھیں ان کے ساتھ نصیحت کی جاتی ہے تو وہ سجدہ کرتے ہوئے گر پڑتے ہیں اور اپنے رب کی حمد کے ساتھ تسبیح کرتے ہیں اور وہ تکبر نہیں کرتے۔‘‘ اور فرمایا : «{ اِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُ الرَّحْمٰنِ خَرُّوْاسُجَّدًا وَّ بُكِيًّا }» [ مریم : ۵۸ ] ’’جب ان پر رحمان کی آیات پڑھی جاتی تھیں وہ سجدہ کرتے اور روتے ہوئے گر جاتے تھے۔‘‘"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) ➊ { وَ الَّذِيْنَ يَقُوْلُوْنَ رَبَّنَا هَبْ لَنَا …:} مکی دور میں مسلمانوں کی زندگی کچھ اس طرح سے گزر رہی تھی کہ باپ مسلمان ہے تو اولاد کافر ہے اور اولاد مسلمان ہے تو والدین کافر ہیں، شوہر مسلمان ہے تو بیوی کافر ہے اور بیوی مسلمان ہے تو شوہر کافر ہے۔ یہ صورت حال مسلمانوں کے لیے سخت غم اور اضطراب کا باعث بنی ہوئی تھی، وہ اپنی آنکھوں سے اپنے پیاروں کو جہنم کا ایندھن بنتے ہوئے دیکھتے تو سخت بے چین ہوتے۔ لہٰذا عباد الرحمان کی صفات میں سے ایک صفت یہ بیان فرمائی کہ وہ یہ دعا کرتے رہتے ہیں کہ ہمارے ازواج و اولاد کو بھی ایمان کی دولت نصیب فرما، تاکہ انھیں دیکھ کر ہماری آنکھیں ٹھندی ہوں۔ واضح رہے کہ مرد یہ دعا کریں تو ان کی ازواج بیویاں ہوں گی اور عورتیں یہ دعا کریں تو ان کے ازواج ان کے خاوند ہوں گے۔ اس دعا کے مفہوم میں یہ بھی شامل ہے کہ پروردگارا! ہمیں ایسے ازواج و اولاد عطا فرما جو تیرے فرماں بردار ہوں اور ہماری آنکھوں کی ٹھنڈک اور دل کی خوشی کا باعث ہوں۔ ¤ ➋ {وَ اجْعَلْنَا لِلْمُتَّقِيْنَ اِمَامًا :} اس کے دو معنی ہیں، ایک تو یہ کہ ہر شخص امام ہے اور کوئی نہ کوئی پیروکار رکھتا ہے، جیسا کہ صحیح بخاری (۵۲۰۰) میں ہے : [ كُلُّكُمْ رَاعٍ وَ كُلُّكُمْ مَسْؤلٌ عَنْ رَّعِيَّتِهِ ] ’’تم سب حکمران ہو اور تم سب اپنی رعیت کے بارے میں جواب دہ ہو۔‘‘ مطلب یہ ہے کہ پروردگارا! جن لوگوں کے ہم امام ہیں، مثلاً ہمارے اہل و عیال اور ہمارے زیر نگرانی لوگ، تو انھیں متقی بنا دے، تاکہ ہم متقین کے امام ہوں، فاجروں کے امام نہ ہوں۔ دوسرا مطلب یہ ہے کہ تو ہمیں اتنا متقی بنا کہ ہم متقین کے امام اور پیشوا بن جائیں۔ طبری نے معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل فرمایا ہے کہ ہمیں ہدایت کے امام بنا کہ ہم سے لوگوں کو ہدایت حاصل ہو، گمراہی کے امام نہ بنا، کیونکہ اللہ تعالیٰ نے اہلِ سعادت کے متعلق فرمایا : «{ وَ جَعَلْنٰهُمْ اَىِٕمَّةً يَّهْدُوْنَ بِاَمْرِنَا وَ اَوْحَيْنَاۤ اِلَيْهِمْ فِعْلَ الْخَيْرٰتِ وَ اِقَامَ الصَّلٰوةِ وَ اِيْتَآءَ الزَّكٰوةِ وَ كَانُوْا لَنَا عٰبِدِيْنَ }» [الأنبیاء : ۷۳ ] ’’اور ہم نے انھیں ایسے پیشوا بنایا جو ہمارے حکم کے ساتھ رہنمائی کرتے تھے اور ہم نے ان کی طرف نیکیاں کرنے اور نماز قائم کرنے اور زکوٰۃ ادا کرنے کی وحی بھیجی اور وہ صرف ہماری عبادت کرنے والے تھے۔‘‘ اور اہل شقاوت کے متعلق فرمایا : «{ وَ جَعَلْنٰهُمْ اَىِٕمَّةً يَّدْعُوْنَ اِلَى النَّارِ }» [ القصص : ۴۱ ] ’’اور ہم نے انھیں ایسے پیشوا بنایا جو آگ کی طرف بلاتے تھے۔‘‘ خلاصہ یہ کہ انھوں نے دو دعائیں کیں، ایک اپنی اولاد و ازواج کے لیے کہ وہ توحید و اطاعتِ الٰہی پر کاربند ہوں اور ان کے لیے دنیا و آخرت میں آنکھوں کی ٹھنڈک بنیں، دوسری اپنے لیے کہ انھیں تقویٰ کی ایسی توفیق عطا ہو کہ وہ متقین کے امام بنیں اور لوگوں کو ہدایت اور تقویٰ کی دعوت دیں۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) ➊ { اُولٰٓىِٕكَ يُجْزَوْنَ الْغُرْفَةَ …:’’ غُرْفَةٌ ‘‘} ہر بلند عمارت اور اونچا محل، بالا خانہ۔ {’’ الْغُرْفَةَ ‘‘} سے مراد کوئی ایک بالا خانہ نہیں بلکہ مراد جنس ہے، یعنی عباد الرحمان کو صبر کے بدلے جنت کے بالا خانے یعنی اونچے محل عطا کیے جائیں گے، جن کی بلندی ان کے مراتب کے اعتبار سے ہو گی۔ ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَهْلَ الْجَنَّةِ يَتَرَاءَوْنَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ، كَمَا يَتَرَاءَوْنَ الْكَوْكَبَ الدُّرِّيَّ الْغَابِرَ فِي الْأُفُقِ مِنَ الْمَشْرِقِ أَوِ الْمَغْرِبِ لِتَفَاضُلِ مَا بَيْنَهُمْ ] [ بخاري، بدء الخلق، باب ما جاء في صفۃ الجنۃ … : ۳۲۵۶ ]’’اہلِ جنت اپنے اوپر کی طرف بالا خانوں والوں کو دیکھیں گے جیسے تم مشرق یا مغرب کے افق پر دور چمک دار تارے کو دیکھتے ہو، ان کی ایک دوسرے کے درمیان درجوں کی برتری کی وجہ سے۔‘‘ اور دیکھیے سورۂ زمر (۲۰) اور عنکبوت (۵۸)۔ ¤ ➋ { بِمَا صَبَرُوْا:} یعنی عباد الرحمان کو یہ نعمت ان کے صبر کی وجہ سے حاصل ہو گی کہ انھوں نے نیکی پر صبر کیا، برائی سے اجتناب پر صبر کیا اور راہِ حق میں پیش آنے والی مصیبتوں پر صبر کیا اور اللہ تعالیٰ نے فرمایا : «{ اِنَّمَا يُوَفَّى الصّٰبِرُوْنَ اَجْرَهُمْ بِغَيْرِ حِسَابٍ }» [ الزمر : ۱۰ ] ’’صرف صبر کرنے والوں ہی کو ان کا اجر کسی شمار کے بغیر دیا جائے گا۔‘‘ ¤ ➌ { وَ يُلَقَّوْنَ فِيْهَا تَحِيَّةً وَّ سَلٰمًا : ’’ تَحِيَّةً ‘‘ ’’حَيّٰ يُحَيِّيْ‘‘} کا مصدر ہے، زندگی کی دعا دینا۔ رب تعالیٰ اور فرشتوں کی طرف سے جنتیوں کے استقبال اور سلام کے لیے دیکھیے سورۂ رعد (۲۳، ۲۴)، انبیاء (۱۰۱ تا ۱۰۳)، زمر (۷۳) اور سورۂ یٰس (۵۵ تا ۵۸)۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 77،76) ➊ { قُلْ مَا يَعْبَؤُا بِكُمْ رَبِّيْ:’’ مَا ‘‘} یہاں نافیہ بھی ہو سکتا ہے اور استتفہامیہ بھی، یعنی میرا رب تمھاری پروا نہیں کرتا، یا میرا رب تمھاری کیا پروا کرے گا؟ ’’میرا رب‘‘ اس لیے فرمایا کہ خطاب کفار سے ہے، جو کما حقہ اسے رب نہیں مانتے۔ ¤ ➋ { لَوْ لَا دُعَآؤُكُمْ:} یہ خطاب کفار سے ہے، کیونکہ آگے فرمایا ہے : «{ فَقَدْ كَذَّبْتُمْ }» ’’سو بے شک تم نے جھٹلا دیا۔‘‘ {’’دُعَآؤُكُمْ ‘‘} کا معنی ابن عباس رضی اللہ عنھما نے {’’إِيْمَانُكُمْ‘‘} کیا ہے۔ [ طبري بطریق علي بن أبي طلحۃ و ذکرہ البخاري ] یعنی میرا رب تمھیں مہلت اس لیے دے رہا ہے کہ تم اس پر ایمان لے آؤ، اس کی عبادت کرو اور اس سے دعا کرو، کیونکہ اس نے جنّ و انس کو پیدا ہی اپنی عبادت کے لیے کیا ہے، سو اگر تم ایمان لا کر اس کی عبادت نہ کرو اور اس کے حضور دعائیں نہ کرو تو اسے تمھاری کچھ پروا نہیں ہے۔ ¤ ایک تفسیر اس کی یہ بھی ہے کہ کفار بھی شدید مصیبت کے وقت اللہ تعالیٰ کو پکارتے ہیں اور اللہ تعالیٰ جب چاہتا ہے ان کی التجا سن کر مصیبت دور بھی کر دیتا ہے۔ دیکھیے سورۂ انعام (۴۰، ۴۱)، یونس (۲۲)، عنکبوت (۶۵)، روم (۳۳) اور لقمان (۳۲) فرمایا، اللہ تعالیٰ جو تمھیں مہلت دے رہا ہے اور تمھاری پکار پر مشکلات بھی دور کر دیتا ہے، یہ صرف تمھارے اس کو پکارنے کی وجہ سے ہے، اس کے باوجود تم نے جھٹلا دیا ہے تو سن لو کہ اس کا عذاب تمھیں پہنچ کر رہے گا۔ چنانچہ دنیا ہی میں جنگِ بدر اور دوسرے موقعوں پر انھوں نے وہ عذاب اپنی آنکھوں سے دیکھ لیا اور قیامت بھی کچھ دور نہیں۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77،76) ➊ { قُلْ مَا يَعْبَؤُا بِكُمْ رَبِّيْ:’’ مَا ‘‘} یہاں نافیہ بھی ہو سکتا ہے اور استتفہامیہ بھی، یعنی میرا رب تمھاری پروا نہیں کرتا، یا میرا رب تمھاری کیا پروا کرے گا؟ ’’میرا رب‘‘ اس لیے فرمایا کہ خطاب کفار سے ہے، جو کما حقہ اسے رب نہیں مانتے۔ ¤ ➋ { لَوْ لَا دُعَآؤُكُمْ:} یہ خطاب کفار سے ہے، کیونکہ آگے فرمایا ہے : «{ فَقَدْ كَذَّبْتُمْ }» ’’سو بے شک تم نے جھٹلا دیا۔‘‘ {’’دُعَآؤُكُمْ ‘‘} کا معنی ابن عباس رضی اللہ عنھما نے {’’إِيْمَانُكُمْ‘‘} کیا ہے۔ [ طبري بطریق علي بن أبي طلحۃ و ذکرہ البخاري ] یعنی میرا رب تمھیں مہلت اس لیے دے رہا ہے کہ تم اس پر ایمان لے آؤ، اس کی عبادت کرو اور اس سے دعا کرو، کیونکہ اس نے جنّ و انس کو پیدا ہی اپنی عبادت کے لیے کیا ہے، سو اگر تم ایمان لا کر اس کی عبادت نہ کرو اور اس کے حضور دعائیں نہ کرو تو اسے تمھاری کچھ پروا نہیں ہے۔ ¤ ایک تفسیر اس کی یہ بھی ہے کہ کفار بھی شدید مصیبت کے وقت اللہ تعالیٰ کو پکارتے ہیں اور اللہ تعالیٰ جب چاہتا ہے ان کی التجا سن کر مصیبت دور بھی کر دیتا ہے۔ دیکھیے سورۂ انعام (۴۰، ۴۱)، یونس (۲۲)، عنکبوت (۶۵)، روم (۳۳) اور لقمان (۳۲) فرمایا، اللہ تعالیٰ جو تمھیں مہلت دے رہا ہے اور تمھاری پکار پر مشکلات بھی دور کر دیتا ہے، یہ صرف تمھارے اس کو پکارنے کی وجہ سے ہے، اس کے باوجود تم نے جھٹلا دیا ہے تو سن لو کہ اس کا عذاب تمھیں پہنچ کر رہے گا۔ چنانچہ دنیا ہی میں جنگِ بدر اور دوسرے موقعوں پر انھوں نے وہ عذاب اپنی آنکھوں سے دیکھ لیا اور قیامت بھی کچھ دور نہیں۔"
    }
  ]
}