{
  "surah": "As-Sajda",
  "surah_number": 32,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں : [ كَانَ النَّبِيُّ صَلّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ يَقْرَأُ فِي الْجُمُعَةِ فِيْ صَلاَةِ الْفَجْرِ : « الٓمّٓ (1) تَنْزِيْلُ » [ السجدة] وَ: «{ هَلْ اَتٰى عَلَى الْاِنْسَانِ }» [الدهر ] ] [ بخاري، الجمعۃ، باب ما یقرأ في صلاۃ الفجر یوم الجمعۃ : ۸۹۱ ] ’’رسول اللہ صلی اللہ علیہ وسلم جمعہ کے دن فجر کی نماز میں سورۂ سجدہ اور سورۂ دہر کی تلاوت کیا کرتے تھے۔‘‘ ¤ (آیت 2،1) {الٓمّٓ (1)تَنْزِيْلُ الْكِتٰبِ لَا رَيْبَ فِيْهِ مِنْ رَّبِّ الْعٰلَمِيْنَ:’’ الٓمّٓ ‘‘} کے متعلق دیکھیے سورۂ بقرہ کی پہلی آیت۔ {’’ الْكِتٰبِ ‘‘} میں الف لام عہد کا ہے، اس لیے ترجمہ ’’اس کتاب‘‘ کیا گیا ہے۔ {’’ مِنْ رَّبِّ الْعٰلَمِيْنَ ‘‘ ’’ تَنْزِيْلُ الْكِتٰبِ ‘‘} کی خبر ہے۔ جملہ {’’ لَا رَيْبَ فِيْهِ ‘‘} معترضہ ہے یا {’’ الْكِتٰبِ ‘‘} کی صفت، یا اس سے حال ہے۔ آیت میں قرآن مجید کے متعلق دو باتیں بیان کی گئی ہیں، ایک یہ کہ یہ کتاب رب العالمین کی طرف سے نازل کی گئی ہے، دوسری یہ کہ اس میں کوئی شک نہیں۔ کوئی شک نہ ہونے سے مراد یہ بھی ہے کہ اس میں بیان کردہ ہر بات یقینی ہے، کسی بات میں شک کی گنجائش نہیں اور یہ بھی مراد ہے کہ اس کے رب العالمین کی طرف سے نازل شدہ ہونے میں کوئی شک نہیں۔ اگر کسی کو شک ہے تو اللہ تعالیٰ نے اسے دور کرنے کا طریقہ بھی بتایا ہے، فرمایا : «{ وَ اِنْ كُنْتُمْ فِيْ رَيْيْبٍ مِّمَّا نَزَّلْنَا عَلٰى عَبْدِنَا فَاْتُوْا بِسُوْرَةٍ مِّنْ مِّثْلِهٖ وَ ادْعُوْا شُهَدَآءَكُمْ مِّنْ دُوْنِ اللّٰهِ اِنْ كُنْتُمْ صٰدِقِيْنَ }» [ البقرۃ : ۲۳ ] ’’اور اگر تم اس کے بارے میں کسی شک میں ہو جو ہم نے اپنے بندے پر اتارا ہے تو اس کی مثل ایک سورت لے آؤ اور اللہ کے سوا اپنے حمایتی بلا لو، اگر تم سچے ہو۔‘‘ حقیقت یہ ہے کہ قرآن مجید سب سے بڑا معجزہ ہے جو رسول اللہ صلی اللہ علیہ وسلم کو دیا گیا، جس کے مقابلے سے پوری مخلوق عاجز ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں : [ كَانَ النَّبِيُّ صَلّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ يَقْرَأُ فِي الْجُمُعَةِ فِيْ صَلاَةِ الْفَجْرِ : « الٓمّٓ (1) تَنْزِيْلُ » [ السجدة] وَ: «{ هَلْ اَتٰى عَلَى الْاِنْسَانِ }» [الدهر ] ] [ بخاري، الجمعۃ، باب ما یقرأ في صلاۃ الفجر یوم الجمعۃ : ۸۹۱ ] ’’رسول اللہ صلی اللہ علیہ وسلم جمعہ کے دن فجر کی نماز میں سورۂ سجدہ اور سورۂ دہر کی تلاوت کیا کرتے تھے۔‘‘ ¤ (آیت 2،1) {الٓمّٓ (1)تَنْزِيْلُ الْكِتٰبِ لَا رَيْبَ فِيْهِ مِنْ رَّبِّ الْعٰلَمِيْنَ:’’ الٓمّٓ ‘‘} کے متعلق دیکھیے سورۂ بقرہ کی پہلی آیت۔ {’’ الْكِتٰبِ ‘‘} میں الف لام عہد کا ہے، اس لیے ترجمہ ’’اس کتاب‘‘ کیا گیا ہے۔ {’’ مِنْ رَّبِّ الْعٰلَمِيْنَ ‘‘ ’’ تَنْزِيْلُ الْكِتٰبِ ‘‘} کی خبر ہے۔ جملہ {’’ لَا رَيْبَ فِيْهِ ‘‘} معترضہ ہے یا {’’ الْكِتٰبِ ‘‘} کی صفت، یا اس سے حال ہے۔ آیت میں قرآن مجید کے متعلق دو باتیں بیان کی گئی ہیں، ایک یہ کہ یہ کتاب رب العالمین کی طرف سے نازل کی گئی ہے، دوسری یہ کہ اس میں کوئی شک نہیں۔ کوئی شک نہ ہونے سے مراد یہ بھی ہے کہ اس میں بیان کردہ ہر بات یقینی ہے، کسی بات میں شک کی گنجائش نہیں اور یہ بھی مراد ہے کہ اس کے رب العالمین کی طرف سے نازل شدہ ہونے میں کوئی شک نہیں۔ اگر کسی کو شک ہے تو اللہ تعالیٰ نے اسے دور کرنے کا طریقہ بھی بتایا ہے، فرمایا : «{ وَ اِنْ كُنْتُمْ فِيْ رَيْيْبٍ مِّمَّا نَزَّلْنَا عَلٰى عَبْدِنَا فَاْتُوْا بِسُوْرَةٍ مِّنْ مِّثْلِهٖ وَ ادْعُوْا شُهَدَآءَكُمْ مِّنْ دُوْنِ اللّٰهِ اِنْ كُنْتُمْ صٰدِقِيْنَ }» [ البقرۃ : ۲۳ ] ’’اور اگر تم اس کے بارے میں کسی شک میں ہو جو ہم نے اپنے بندے پر اتارا ہے تو اس کی مثل ایک سورت لے آؤ اور اللہ کے سوا اپنے حمایتی بلا لو، اگر تم سچے ہو۔‘‘ حقیقت یہ ہے کہ قرآن مجید سب سے بڑا معجزہ ہے جو رسول اللہ صلی اللہ علیہ وسلم کو دیا گیا، جس کے مقابلے سے پوری مخلوق عاجز ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { اَمْ يَقُوْلُوْنَ افْتَرٰىهُ: ’’ اَمْ ‘‘} سے پہلے عموماً ایسا جملہ موجود یا مقدر ہوتا ہے جو ہمزہ استفہام سے شروع ہوتا ہے۔ یہاں مقدر جملہ ظاہر کریں تو عبارت یہ ہو گی : {’’ أَهُمْ يُؤْمِنُوْنَ بِهِ أَمْ يَقُوْلُوْنَ افْتَرَاهُ ‘‘} یعنی ’’کیا یہ لوگ اللہ کی نازل کردہ کتاب پر ہر قسم کے شک و شبہ سے پاک ہو کر ایمان لاتے ہیں، یا یہ کہہ کر جھٹلا دیتے ہیں کہ اس پیغمبر نے اسے اپنے پاس سے گھڑ لیا ہے؟‘‘ کئی مفسرین نے اس {’’ اَمْ ‘‘} کو منقطعہ قرار دے کر {’’ بَلْ‘‘} کے معنی میں قرار دیا ہے۔ اس صورت میں معنی یہ ہو گا : ’’بلکہ وہ کہتے ہیں کہ اس نے اسے گھڑ لیا ہے۔‘‘ اس{ ’’ بَلْ ‘‘} سے پہلے بھی ایک عبارت محذوف ہے کہ یہ لوگ اس پر ایمان لانے کے بجائے یہی کہتے ہیں کہ اس نے اسے اپنے پاس سے گھڑ لیا ہے۔ دیکھیے سورۂ فرقان (۴، ۵) اور مدثر (۱۸ تا ۲۵)۔ ¤ ➋ { بَلْ هُوَ الْحَقُّ مِنْ رَّبِّكَ:} فرمایا، ان کا یہ کہنا درست نہیں، بلکہ یہ تیرے رب کی طرف سے حق ہے اور یہ لوگ محمد صلی اللہ علیہ وسلم کے صدق و امانت کو پوری طرح جاننے کے باوجود صریح غلط اور لغو بات کہہ رہے ہیں۔ ¤ ➌ {لِتُنْذِرَ قَوْمًا مَّاۤ اَتٰىهُمْ مِّنْ نَّذِيْرٍ مِّنْ قَبْلِكَ :} مراد قوم عرب ہے، جنھیں اللہ تعالیٰ نے اس کتاب کے ساتھ سب سے پہلے خطاب فرمایا اور ان کے ذریعے سے تمام دنیا تک یہ پیغام پہنچانے کا اہتمام فرمایا۔ اس سے پہلے اگرچہ عرب میں اسماعیل، ہود، صالح اور شعیب علیھم السلام مبعوث ہو چکے تھے، مگر ان کی بعثت کو مدتیں گزر چکی تھیں۔ ان کے بعد تورات و انجیل نازل ہوئیں، مگر عرب میں کوئی نبی مبعوث نہیں ہوا۔ اس لیے اللہ عزوجل نے آخری نبی ان میں مبعوث فرمایا، جیسا کہ ارشاد ہے : «{ وَ هٰذَا كِتٰبٌ اَنْزَلْنٰهُ مُبٰرَكٌ فَاتَّبِعُوْهُ وَ اتَّقُوْا لَعَلَّكُمْ تُرْحَمُوْنَ (155) اَنْ تَقُوْلُوْۤا اِنَّمَاۤ اُنْزِلَ الْكِتٰبُ عَلٰى طَآىِٕفَتَيْنِ مِنْ قَبْلِنَا وَ اِنْ كُنَّا عَنْ دِرَاسَتِهِمْ لَغٰفِلِيْنَ (156) اَوْ تَقُوْلُوْا لَوْ اَنَّاۤ اُنْزِلَ عَلَيْنَا الْكِتٰبُ لَكُنَّاۤ اَهْدٰى مِنْهُمْ فَقَدْ  جَآءَكُمْ بَيِّنَةٌ مِّنْ رَّبِّكُمْ وَ هُدًى وَّ رَحْمَةٌ فَمَنْ اَظْلَمُ مِمَّنْ كَذَّبَ بِاٰيٰتِ اللّٰهِ وَ صَدَفَ عَنْهَا سَنَجْزِي الَّذِيْنَ يَصْدِفُوْنَ عَنْ اٰيٰتِنَا سُوْٓءَ الْعَذَابِ بِمَا كَانُوْا يَصْدِفُوْنَ }» [ الأنعام : ۱۵۵ تا ۱۵۷ ] ’’اور یہ عظیم کتاب ہے جسے ہم نے نازل کیا ہے، بڑی برکت والی، پس اس کی پیروی کرو اور بچ جاؤ، تاکہ تم پر رحم کیا جائے۔ ایسا نہ ہو کہ تم کہو کہ کتاب تو صرف ان دو گروہوں پر اتاری گئی جو ہم سے پہلے تھے اور بے شک ہم ان کے پڑھنے پڑھانے سے یقینا بے خبر تھے۔ یا یہ کہو کہ اگر ہم پر کتاب اتاری جاتی تو ہم ان سے زیادہ ہدایت والے ہوتے۔ پس بے شک تمھارے پاس تمھارے رب کی طرف سے ایک روشن دلیل اور ہدایت اور رحمت آچکی، پھر اس سے زیادہ ظالم کون ہے جو اللہ کی آیات کو جھٹلائے اور ان سے کنارا کرے۔ عنقریب ہم ان لوگوں کو جو ہماری آیات سے کنارا کرتے ہیں، برے عذاب کی جزا دیں گے، اس کے بدلے جو وہ کنارا کرتے تھے۔‘‘ مزید تفصیل مذکورہ بالا آیات کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➍ اس مقام پر کئی مفسرین نے اسماعیل علیہ السلام اور نبی کریم صلی اللہ علیہ وسلم کے درمیان دو ہزار یا اڑھائی ہزار سال کا عرصہ بیان کیا ہے، مگر اس کا کوئی قابل اعتماد حوالہ نہیں دیا، اس لیے ہمارے پاس اس لمبی مدت کی تعیین کا کوئی ذریعہ نہیں۔ ¤ ➎ { لَعَلَّهُمْ يَهْتَدُوْنَ :} یہاں {’’لَعَلَّ‘‘ ’’كَيْ‘‘} کے معنی میں ہے ’’تاکہ وہ ہدایت پائیں‘‘ اور اگر ’’ترجی‘‘ کے معنی میں ہو، یعنی ’’امید ہے، یا شاید‘‘ تو وہ رسول اللہ صلی اللہ علیہ وسلم کے اعتبار سے ہے کہ تاکہ آپ اس قوم کو ڈرائیں، اس امید پر کہ وہ ہدایت پا جائیں گے، کیونکہ اللہ تعالیٰ کو تو ہر بات کا علم ہے کہ وہ ہدایت پائیں گے یا نہیں، تو اسے ’’شاید‘‘ یا ’’امید ہے‘‘ کہنے کی کیا ضرورت ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { اَللّٰهُ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ وَ مَا بَيْنَهُمَا فِيْ سِتَّةِ اَيَّامٍ :} قرآن کریم اور رسول کریم صلی اللہ علیہ وسلم کی رسالت کے حق ہونے کے بیان کے بعد اس اہم ترین مسئلے کا ذکر فرمایا جس کی طرف دعوت دینے کے لیے آپ صلی اللہ علیہ وسلم کو اور تمام رسولوں کو بھیجا گیا اور وہ ہے اللہ تعالیٰ کی توحید اور اس کے دلائل ککا بیان۔ چنانچہ فرمایا : ’’اللہ وہ ہے جس نے آسمانوں کو، زمین کو اور ان کے درمیان کی تمام چیزوں کو چھ دنوں میں پیدا فرمایا۔‘‘ ان دنوں سے مراد معروف دن نہیں، کیونکہ آسمان و زمین کی پیدائش سے پہلے ان کا وجود ہی نہیں تھا، ہو سکتا ہے وہ دن ہزاروں یا لاکھوں سال کے ہوں۔ دیکھیے سورۂ اعراف (۵۴) اور حٰم السجدہ (۹ تا ۱۲)۔ ¤ ➋ { ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ :} اس کی تفسیر کے لیے دیکھیے سورۂ اعراف (۵۴)، یونس (۳) اور طٰہٰ (۵)۔ ¤ ➌ {مَا لَكُمْ مِّنْ دُوْنِهٖ مِنْ وَّلِيٍّ وَّ لَا شَفِيْعٍ :} یہ اس باطل خیال کا رد ہے کہ بے شک آسمان و زمین اور ہر چیز کا مالک اللہ تعالیٰ ہے، مگر کچھ ہستیاں ایسی زبردست یا اللہ کی محبوب ہیں جو سفارش کر کے اس کی گرفت سے چھڑا لیں گی۔ فرمایا، یاد رکھو! اگر وہ تمھیں عذاب دینا چاہے تو اس کے مقابلے میں تمھارا کوئی دوست نہیں ہو گا جو اس کے عذاب سے تمھیں چھڑا سکے اور نہ کوئی سفارشی، جو اس کی اجازت کے بغیر سفارش کی جرأت کر سکے۔ ¤ ➍ { اَفَلَا تَتَذَكَّرُوْنَ :} یعنی کیا تم نصیحت حاصل نہیں کرتے کہ عرش سے فرش تک اس کی حکومت ہے، اس کے پیغام اور پیغمبر کو جھٹلا کر کہاں جاؤ گے؟"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { يُدَبِّرُ الْاَمْرَ مِنَ السَّمَآءِ اِلَى الْاَرْضِ … :} اس آیت کی تفسیر میں اہلِ علم کا بہت اختلاف ہے، حتیٰ کہ بعض نے اس کی تفصیل اللہ کے علم کے سپرد کرتے ہوئے خاموشی اختیار فرمائی ہے، کیونکہ ہر تفسیر میں ایک طرح کی کمی اور اعتراض کی گنجائش باقی رہتی ہے۔ یہاں ان میں سے دو تفسیریں نقل کی جاتی ہیں، ایک یہ کہ اللہ تعالیٰ جو فیصلہ فرماتا ہے اسے آسمان سے زمین کی طرف نافذ فرماتا ہے، پھر اس کے نافذ ہونے کی خبر اوپر اس کی طرف ایک ایسے دن میں جاتی ہے جس کی مقدار آسمان سے زمین پر اترنے اور پھر اس کی طرف چڑھنے میں دنیا کے ہزار سال کے برابر ہے، کیونکہ آسمان و زمین کے درمیان پانچ سو سال کا فاصلہ ہے، چنانچہ اترنے اور اوپر جانے کا فاصلہ ہزار سال ہے۔ ابن جریر طبری نے فرمایا : ’’یہ سب اقوال سے بہتر ہے، کیونکہ یہ اس کے معانی میں سب سے ظاہر اور قرآن کے ظاہر الفاظ سے زیادہ ملتا ہے۔‘‘ ابن کثیر رحمہ اللہ نے اس کے ساتھ مجاہد، قتادہ اور ضحاک کا قول نقل فرمایا ہے : ’’(اللہ تعالیٰ کا حکم لے کر) فرشتے کا اترنا پانچ سو سال کے فاصلے میں ہوتا ہے اور اس کا چڑھنا بھی پانچ سو سال کے فاصلے میں ہوتا ہے، لیکن وہ اسے آنکھ جھپکنے میں طے کر لیتا ہے۔ اس لیے اللہ تعالیٰ نے فرمایا : «{ فِيْ يَوْمٍ كَانَ مِقْدَارُهٗۤ اَلْفَ سَنَةٍ مِّمَّا تَعُدُّوْنَ }» [ السجدۃ : ۵ ] ’’ایک ایسے دن میں جس کی مقدار ہزار سال ہے، اس (حساب) سے جو تم شمار کرتے ہو۔‘‘ (ابن کثیر) قاسمی، ابن جزی صاحب التسہیل، بغوی ، سعدی اور بہت سے مفسرین نے یہی معنی بیان فرمایا ہے، یا اس کو ترجیح دی ہے۔ ¤ واضح رہے کہ قرآن مجید میں {’’ يَوْمٍ ‘‘} کا لفظ پچاس ہزار سال کی مدت کے لیے بھی آیا ہے اور ہزار سال کے لیے بھی، دنیا کے عام دنوں کے لیے بھی اور وقت کے چھوٹے سے چھوٹے جز کے لیے بھی، جیسا کہ فرمایا : «{ يَسْـَٔلُهٗ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ }» [ الرحمٰن : ۲۹ ] ’’اس سے مانگتا ہے جو کوئی آسمانوں اور زمین میں ہے، ہر دن وہ ایک نئی شان میں ہے۔‘‘ یہاں ’’ہر دن‘‘ سے مراد ہر لمحہ ہے۔ مقصد اس آیت کا یہ ہے کہ آسمانوں اور زمین کو چھ دنوں میں پیدا فرمانے کے بعد اللہ تعالیٰ ان سے لاتعلق نہیں ہو گیا کہ اس کے چلانے کا کام کوئی اور کر رہا ہو، بلکہ آسمان سے لے کر زمین تک، بڑے سے لے کر چھوٹے تک، ہر کام کی تدبیر وہ خود کرتا ہے۔ وہ اپنے ہر حکم پر عمل کی بھی مکمل خبر رکھتا ہے اور زمین و آسمان کے درمیان ہزار برس کے فاصلے کے باوجود اس کے حکم سے یہ سب کچھ لمحوں میں ہو جاتا ہے۔ ¤ اس آیت میں ان جاہل صوفیوں اور مشرکین کا رد ہے جو کہتے ہیں کہ اللہ تعالیٰ عالم کا نظام اپنے پیاروں کو دے کر فارغ ہو چکا ہے اور اب سارا نظام وہی چلا رہے ہیں۔ پھر ان حضرات نے اس کے لیے باقاعدہ عہدے بنا رکھے ہیں، جن کے مطابق ان کا کوئی ولی قیّوم کے مرتبے پر ہے، کوئی قطب ہے، کوئی غوث ہے، کچھ ابدال ہیں اور کچھ اوتاد، اور یہی حضرات دنیا کا نظام چلا رہے ہیں۔ اس کے مطابق انھوں نے شیخ عبدالقادر جیلانی کو غوثِ اعظم (سب سے بڑا مددگار) کا عہدہ دے رکھا ہے۔ ایک اللہ کو پکارنے کے بجائے یہ لوگ کبھی کسی کو مدد کے لیے پکارتے ہیں اور کبھی کسی کو۔ دراصل ان کی گمراہی کے پیچھے وہی فاسد عقیدہ ہے جس کی تردید اللہ تعالیٰ نے اس آیت میں فرمائی ہے کہ جو مالک لمحوں میں ہزار سال کے فاصلے سے ہر معاملے کی تدبیر کرتا اور اس کی پوری خبر رکھتا ہے، اس اکیلے کی عبادت اور اسی سے مانگنے کے بجائے کسی ایسے کی عبادت اور اس سے فریاد کیوں کی جائے جس کا کسی کام کی تدبیر میں کوئی دخل ہی نہیں۔ ¤ ➋ دوسری تفسیر یہ ہے کہ اللہ تعالیٰ آسمان و زمین کو پیدا کرنے کے وقت سے لے کر آسمان سے اپنی مخلوق اور زمین کے ہر معاملے کی تدبیر کر رہا ہے اور یہ سلسلہ ان کے فنا ہونے تک جاری رہے گا۔ پھر یہ تمام معاملات اس کی طرف اوپر جاتے ہیں، تاکہ وہ ان کے بارے میں ایک ایسے دن کے اندر فیصلہ فرمائے جس کی مقدار ہزار برس ہے، ان دنوں سے جو تم شمار کرتے ہو۔ مفسر المراغی، ابن عاشور، ابوبکر الجزائری صاحب ایسر التفاسیر، ابراہیم القطان صاحب تیسیرالتفسیر اور دوسرے کئی مفسرین نے یہی معنی بیان کرنے پر اکتفا فرمایا ہے اور کئی دوسرے مفسرین نے اسے ترجیح دی ہے۔ اس معنی کو ترجیح دینے کی وجہ یہ ہے کہ اللہ تعالیٰ نے قرآن مجید میں ہر معاملے کے اور ہر انسان کے اللہ تعالیٰ کی طرف لوٹنے کا ذکر فرمایا ہے، فرمایا : «{ وَ اِلَى اللّٰهِ الْمَصِيْرُ }» [ آل عمران : ۲۸ ]، «{ ثُمَّ اِلَيْهِ تُرْجَعُوْنَ }» [ البقرۃ : ۲۸ ]، «{ وَ اِلَيْهِ يُرْجَعُ الْاَمْرُ كُلُّهٗ }» [ ھود : ۱۲۳ ]، «{ ثُمَّ اِلَيْهِ مَرْجِعُكُمْ ثُمَّ يُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ }» [ الأنعام : ۶۰ ] اور فرمایا : «{ اِلَيْهِ مَرْجِعُكُمْ جَمِيْعًا وَععْدَ اللّٰهِ حَقًّا اِنَّهٗ يَبْدَؤُا الْخَلْقَ ثُمَّ يُععِيْدُهٗ }» [ یونس : ۴ ] ¤ اس تفسیر میں ایک اشکال ہے کہ سورۂ معارج (۴) میں اللہ تعالیٰ نے قیامت کے دن کی مقدار پچاس ہزار سال بتائی ہے، جب کہ یہاں ایک ہزار سال کا ذکر ہے۔ اس کا حل یہ ہے کہ ہزار سال سے مراد محض کثرت ہے، کیونکہ عربی زبان میں سب سے بڑا عدد {’’أَلْفٌ‘‘} (ہزار) ہی ہے۔ اس سے زیادہ عدد کی ضرورت ہو تو دوسرے عدد ساتھ ملائے جاتے ہیں، مثلاً {’’خَمْسُوْنَ أَلْفًا‘‘} یا {’’مِائَةُ أَلْفٍ‘‘ } اور بعض اوقات کثرت کے اظہار کے لیے {’’أَلْفٌ‘‘} ہی پر اکتفا کیا جاتا ہے۔ اس لیے {’’ خَمْسِيْنَ اَلْفَ سَنَةٍ ‘‘} اور {’’ اَلْفَ سَنَةٍ ‘‘} دونوں سے قیامت ہی کا دن مراد ہے اور دونوں عددوں سے کثرت کا اظہار مقصود ہے۔ ہو سکتا ہے اصل مدت اس سے کہیں زیادہ ہو جسے اللہ تعالیٰ ہی بہتر جانتا ہے۔ (واللہ اعلم) بعض مفسرین نے یہ حل بیان فرمایا ہے کہ مصیبت کے ایام لمبے ہوتے ہیں، چنانچہ پچاس ہزار ساال کی لمبائی کفار کے لیے ہو گی، جیسے فرمایا : { فَذٰلِكَ يَوْمَىِٕذٍ يَّوْمٌ عَسِيْرٌ (9) عَلَى الْكٰفِرِيْنَ غَيْرُ يَسِيْرٍ } [ المدثر : ۹، ۱۰ ] ’’تو وہ اس دن، ایک مشکل دن ہے۔ کافروں پر آسان نہیں۔‘‘"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {ذٰلِكَ عٰلِمُ الْغَيْبِ وَ الشَّهَادَةِ …:} یعنی وہ پروردگار جو خلق و تدبیر کا یہ سارا سلسلہ چلا رہا ہے، اس کا علم اتنا وسیع ہے کہ جو کچھ تم سے غائب ہے یا حاضر، ماضی ہے یا حال یا مستقبل، سب کچھ اس کے علم میں ہے، قدرت اس کی اتنی بے پایاں ہے کہ وہ ہر ایک پر غالب ہے اور رحمت اتنی کہ ہر چیز کو اپنے دامن میں سمائے ہوئے ہے۔ اس کے سوا نہ کسی کے پاس یہ علم ہے، نہ قدرت اور نہ رحمت، خواہ وہ انسان ہو یا جن یا فرشتہ یا کوئی اور مخلوق، تو پھر کسی اور کی عبادت کیوں کی جائے؟"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { الَّذِيْۤ اَحْسَنَ كُلَّ شَيْءٍ خَلَقَهٗ :} یعنی اللہ تعالیٰ نے اس عظیم الشان کائنات میں بے حد و حساب جتنی چیزیں پیدا فرمائی ہیں اور جس مقصد کے لیے بنائی ہیں، انھیں اس کے لیے ایسی شکل و صورت عطا فرمائی ہے جس سے زیادہ خوب صورت اور عمدہ صورت کا تصور میں آنا محال ہے۔ ¤ ➋ {وَ بَدَاَ خَلْقَ الْاِنْسَانِ مِنْ طِيْنٍ:} اپنی پیدا کردہ ہر چیز کے حسن کے مشاہدے کے لیے انسان کو خود اس کی ذات میں غور و فکر کرنے کی دعوت دی کہ اس کے لیے تمھیں کہیں اور جانے کی ضرورت نہیں، اللہ تعالیٰ نے تمھاری پیدائش کی ابتدا حقیر مٹی سے کی، جس میں زندگی کا نام و نشان نہ تھا۔ پوری زمین سے ایک مٹھی لے کر اپنے ہاتھوں سے ُپتلا بنا کر پہلا انسان پیدا فرما دیا۔ {’’ طِيْنٍ ‘‘ } میں تنوین تحقیر کی ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { ثُمَّ جَعَلَ نَسْلَهٗ مِنْ سُلٰلَةٍ مِّنْ مَّآءٍ مَّهِيْنٍ :} اس کے لیے دیکھیے سورۂ مومنون (۱۲ تا۱۴) اور سورۂ حج (۵) یعنی پھر اس کی نسل کو نطفہ اور توالد و تناسل سے آگے چلا دیا، جس سے لاتعداد انسان آگے پیدا ہوتے چلے جا رہے ہیں۔ نطفہ کو خلاصہ اس لیے فرمایا کہ اطباء کے مطابق یہ غذا کے چوتھے ہضم کے نتیجے میں وجود میں آتا ہے، جب کہ خون تیسرے ہضم کے بعد پیدا ہوتا ہے اور اعضائے بول سے نکلنے کی وجہ سے اسے {’’ مَهِيْنٍ ‘‘} قرار دیا۔ پھر منی کے اس قطرے میں لاکھوں جرثومے ہوتے ہیں جو طاقت ور خوردبین کے بغیر نظر نہیں آتے، جن میں سے ہر جرثومہ رحم میں مکمل انسان بننے کی استعداد رکھتا ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ { ثُمَّ سَوّٰىهُ : ’’سَوّٰي يُسَوِّيْ تَسْوِيَةً‘‘} برابر کرنا، درست کرنا۔ پھر اس انتہائی چھوٹے سے جرثومے کو ماں کے رحم میں پیوست کیا اور علقہ اور مضغہ کی منزلوں سے بڑھاتے ہوئے ہڈیوں کا ڈھانچہ بنا کر، اسے گوشت پوست پہنا کر، ہر عضو کو اس کی بہتر سے بہتر جگہ رکھ کر ہر طرح سے درست اور مکمل کر دیا۔ ¤ ➋ {وَ نَفَخَ فِيْهِ مِنْ رُّوْحِهٖ : ’’ مِنْ ‘‘} تبعیض کے لیے ہے، اس لیے ترجمہ کیا گیا ہے ’’اور اس میں اپنی ایک روح پھونکی۔‘‘ مراد اس سے اپنی پیدا کردہ روح ہے، کیونکہ اللہ تعالیٰ تو {’’ لَمْ يَلِدْ وَ لَمْ يُوْلَدْ ‘‘} ہے، انسان کا شرف بیان کرنے کے لیے اس میں پھونکی جانے والی روح کو اپنی روح قرار دیا۔ کیونکہ ارواح جتنی بھی ہیں سب اللہ تعالیٰ کی ملکیت ہیں، مگر انسان کی خصوصیت کے اظہار کے لیے اس کی روح کی نسبت اپنی طرف فرمائی، جیسا کہ تمام اونٹنیوں کا مالک اللہ ہے مگر صالح علیہ السلام کی اونٹنی کو {’’نَاقَةُ اللّٰهِ‘‘} فرمایا، تمام مساجد اللہ تعالیٰ ہی کی ہیں، مگر کعبہ کو ’’بیت اللہ‘‘ کہا جاتا ہے اور بندے سب کے سب اللہ کے ہیں، مگر رسول اللہ صلی اللہ علیہ وسلم کے خاص شرف کے اظہار کے لیے فرمایا : «{ سُبْحٰنَ الَّذِيْۤ اَسْرٰى بِعَبْدِهٖ }» [ بني إسرائیل : ۱ ] اور فرمایا : «{ وَ اَنَّهٗ لَمَّا قَامَ عَبْدُ اللّٰهِ يَدْعُوْهُ }» [ الجن : ۱۹ ] اور دوسرے مقامات پر انھیں اپنا بندہ قرار دیا۔ مزید دیکھیے سورۂ حجر کی آیت (۲۹) کی تفسیر۔ ¤ ➌ { وَ جَعَلَ لَكُمُ السَّمْعَ وَ الْاَبْصَارَ وَ الْاَفْـِٕدَةَ :} اس سے پہلے انسان کی پیدائش کا ذکر غائب کے صیغے کے ساتھ کیا، روح پھونکنے سے جیتا جاگتا انسان وجود میں آگیا تو اللہ تعالیٰ نے اسے مخاطب کر کے فرمایا کہ جب تم پیدا ہوئے تو کچھ نہ جانتے تھے، اللہ تعالیٰ نے تمھیں علم حاصل کرنے کے ذرائع عطا فرمائے، جیسا کہ فرمایا : «{ وَ اللّٰهُ اَخْرَجَكُمْ مِّنْۢ بُطُوْنِ اُمَّهٰتِكُمْ لَا تَعْلَمُوْنَ شَيْـًٔا وَّ جَعَلَ لَكُمُ السَّمْعَ وَ الْاَبْصَارَ وَ الْاَفْـِٕدَةَ لَعَلَّكُمْ تَشْكُرُوْنَ }» [ النحل : ۷۸ ] ’’اور اللہ نے تمھیں تمھاری ماؤں کے پیٹوں سے اس حال میں نکالا کہ تم کچھ نہ جانتے تھے اور اس نے تمھارے لیے کان اور آنکھیں اور دل بنا دیے، تاکہ تم شکر کرو۔‘‘ علم حاصل کرنے کے ذرائع میں سب سے پہلے سننے کی نعمت کا ذکر فرمایا، کیونکہ پیدا ہونے کے بعد سب سے پہلے کان ہی اپنا کام شروع کرتے ہیں، اس کے بعد آنکھیں اپنا کام شروع کرتی ہیں، اور اس لیے بھی کانوں کا ذکر پہلے فرمایا کہ کانوں پر کوئی پردہ نہیں، وہ ہر وقت اپنا کام سرانجام دیتے ہیں، حتیٰ کہ سونے کی حالت میں بھی سخت آواز جگانے کا باعث ہوتی ہے، جب کہ آنکھیں بند کر لینے سے یا سوجانے سے دیکھنے کا عمل رک جاتا ہے۔ سوچنے سمجھنے کا عمل ان دونوں کے بعد شروع ہوتا ہے، اس لیے {’’ الْاَفْـِٕدَةَ ‘‘} کا ذکر دونوں کے بعد فرمایا۔ ¤ ➍ {قَلِيْلًا مَّا تَشْكُرُوْنَ:} یہ سب باتیں ایسی واضح ہیں کہ تم میں سے ہر ایک کے مشاہدہ میں آتی رہتی ہیں، مگر تم بہت کم شکر کرتے ہو۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ { وَ قَالُوْۤا ءَاِذَا ضَلَلْنَا فِي الْاَرْضِ …:} رسول کریم صلی اللہ علیہ وسلم اور قرآن کریم کے حق ہونے اور توحید اور اس کے چند دلائل بیان کرنے کے بعد اب اسلام کے تیسرے بنیادی عقیدے قیامت اور اس پر کفار کے اعتراض اور اس کے جواب کا ذکر ہوتا ہے۔ {’’ وَ قَالُوْۤا ‘‘} میں ’’واؤ‘‘ کے ساتھ ان کے اس قول پر عطف ہے جو پہلی آیات سے ظاہر ہو رہا ہے، گویا کلام یوں ہو گا: {’’قَالُوْا مُحَمَّدٌ لَيْسَ بِرَسُوْلٍ وَالإِلٰهُ لَيْسَ بِوَاحِدٍ وَقَالُوْا ءَ إِذَا ضَلَلْنَا فِيي الْأَرْضِ…‘‘} یعنی انھوں نے کہا کہ محمد رسول نہیں ہے اور معبود ایک نہیں ہے اور انھوں نے کہا کہ کیا جب ہم زمین میں گم ہو گئے…۔‘‘ زمخشری اور طبری نے فرمایا : {’’ ضَلَّ الْمَاءُ فِي اللَّبَنِ ‘‘} اس وقت کہا جاتا ہے جب پانی دودھ میں اچھی طرح مل جائے اور غائب ہو جائے۔ یعنی کیا جب ہم مٹی میں مل کر مٹی ہو جائیں گے تو کیا واقعی ہم ایک نئی پیدائش میں زندہ کر دیے جائیں گے؟ ہمزہ استفہام کے بعد پھر ہمزہ استفہام دوسری زندگی پر تعجب اور اس سے انکار کے لیے ہے، یعنی یہ کیسے ہو سکتا ہے؟ ایسا کبھی نہیں ہو سکتا۔ ¤ ➋ {بَلْ هُمْ بِلِقَآئِ رَبِّهِمْ كٰفِرُوْنَ :} اس سے پہلے انسان کی مٹی اور پھر نطفے سے پیدائش کا ذکر کرنے کے بعد کفار کے اس اعتراض کے جواب کی ضرورت ہی نہیں سمجھی کہ ہم مٹی میں مٹی ہو گئے تو دوبارہ کیسے پیدا ہوں گے، جواب ظاہر تھا کہ جس طرح پہلی مرتبہ اس مٹی سے پیدا ہوئے جب تمھارا نام و نشان نہ تھا، اب اسی مٹی میں مل گئے تو دوبارہ کیوں پیدا نہیں ہو سکتے۔ دیکھیے سورۂ یٰس (۷۹ تا ۸۱ اور ۱۲) اس لیے فرمایا، بلکہ اصل بات یہ ہے کہ یہ لوگ اپنے رب کی ملاقات تسلیم نہیں کرنا چاہتے، کیونکہ وہ اپنی خواہش پرستی اور فسق و فجور کو چھوڑنا نہیں چاہتے، جو انھیں رب تعالیٰ کی ملاقات تسلیم کرنے کے بعد چھوڑنا پڑیں گے، جیسا کہ فرمایا : « لَاۤ اُقْسِمُ بِيَوْمِ الْقِيٰمَةِ (1) وَ لَاۤ اُقْسِمُ بِالنَّفْسِ اللَّوَّامَةِ (2) اَيَحْسَبُ الْاِنْسَانُ اَلَّنْ نَّجْمَعَ عِظَامَهٗ (3) بَلٰى قٰدِرِيْنَ عَلٰۤى اَنْ نُّسَوِّيَ بَنَانَهٗ (4) بَلْ يُرِيْدُ الْاِنْسَانُ لِيَفْجُرَ اَمَامَهٗ » [ القیامۃ : ۱ تا ۵ ] ’’نہیں، میں قیامت کے دن کی قسم کھاتا ہوں! اور نہیں، میں بہت ملامت کرنے والے نفس کی قسم کھاتا ہوں! کیا انسان گمان کرتا ہے کہ ہم کبھی اس کی ہڈیاں اکٹھی نہیں کریں گے۔ کیوں نہیں؟ (ہم انھیں اکٹھا کریں گے) اس حال میں کہ ہم قادر ہیں کہ اس (کی انگلیوں) کے پورے درست کر (کے بنا) دیں۔ بلکہ انسان چاہتا ہے کہ اپنے آگے (آنے والے دنوں میں بھی) نافرمانی کرتا رہے۔‘‘"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ { قُلْ يَتَوَفّٰىكُمْ مَّلَكُ الْمَوْتِ الَّذِيْ وُكِّلَ بِكُمْ :} یعنی تم اپنے آپ  کو محض بدن اور دھڑ سمجھتے ہو کہ خاک میں رل مل کر برابر ہو گئے۔ ایسا نہیں، بلکہ تم اصل میں ’’جان‘‘ (روح) ہو، جسے فرشتہ لے جاتا ہے، بالکل فنا نہیں ہوتے۔ (موضح) {’’ وُكِّلَ بِكُمْ ‘‘} کے لفظ سے معلوم ہوا کہ فرشتہ وہی جان نکالتا ہے جس کا اسے حکم ہو، خود اس کا اختیار کچھ نہیں۔ ¤ ➋ { ثُمَّ اِلٰى رَبِّكُمْ تُرْجَعُوْنَ:’’ اِلٰى رَبِّكُمْ ‘‘} پہلے لانے کی وجہ سے ترجمہ کیا گیا ہے : ’’پھر تم اپنے رب ہی کی طرف لوٹائے جاؤ گے۔‘‘ ¤ ➌ ملک الموت کا نام عام طور پر عزرائیل مشہور ہے، مگر کتاب و سنت میں یہ بات کہیں مذکور نہیں، محض اسرائیلی روایت ہے۔ دوسری آیات میں اللہ تعالیٰ نے بیان فرمایا ہے کہ لوگوں کو ایک فرشتہ نہیں بلکہ کئی فرشتے فوت کرتے ہیں، جیساکہ فرمایا : «{ حَتّٰۤى اِذَا جَآءَ اَحَدَكُمُ الْمَوْتُ تَوَفَّتْهُ رُسُلُنَا وَ هُمْ لَا يُفَرِّطُوْنَ }» [ الأنعام : ۶۱ ] ’’یہاں تک کہ جب تمھارے کسی ایک کو موت آتی ہے اسے ہمارے بھیجے ہوئے قبض کر لیتے ہیں اور وہ کوتاہی نہیں کرتے۔‘‘ مزید دیکھیے سورۂ نساء (۹۷)، انعام (۹۳) اور سورۂ محمد (۲۷) اہلِ علم نے اس کی توجیہ یہ فرمائی ہے کہ روحیں قبض کرنے پر مقرر فرشتہ ایک ہی ہے جس کا یہاں ذکر ہے، لیکن اس کے ساتھ مدد کرنے والے فرشتے بھی ہیں جو مختلف طرح سے اس کی مدد کرتے ہیں، جیسا کہ براء بن عازب رضی اللہ عنہما کی طویل حدیث میں مومن اور کافر کی جان نکلنے کا ذکر ہے کہ ملک الموت جب میت کی روح نکالتا ہے تو دوسرے فرشتے اس کے ہاتھ سے تیزی کے ساتھ لے کر آسمان کی طرف چڑھتے ہیں۔ [ دیکھیے مسند أحمد : 287/4، ح : ۱۸۵۶۱ ]"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { وَ لَوْ تَرٰۤى اِذِ الْمُجْرِمُوْنَ نَاكِسُوْا رُءُوْسِهِمْ عِنْدَ رَبِّهِمْ:} پچھلی آیت میں جو فرمایا{’’ ثُمَّ اِلٰى رَبِّكُمْ تُرْجَعُوْنَ ‘‘} (پھر تم اپنے رب ہی کی طرف لوٹائے جاؤ گے) اب اس حالت کا نقشہ پیش کیا جاتا ہے۔ {’’نَكَسَ يَنْكُسُ‘‘} (ن) کا معنی کسی چیز کو سر کے بل الٹا کرنا ہے، مراد ذلت، شرمندگی اور غم کے ساتھ سروں کو جھکانا ہے۔ {’’ الْمُجْرِمُوْنَ ‘‘} کے لفظ کے ساتھ ان کے اس انجام کا سبب صراحت کے ساتھ بیان فرمایا ہے۔ ¤ ➋ {رَبَّنَاۤ اَبْصَرْنَا وَ سَمِعْنَا فَارْجِعْنَا نَعْمَلْ صَالِحًا :} یہاں {’’يَقُوْلُوْنَ‘‘} کا لفظ مقدر ہے، یعنی وہ سر جھکائے ہوئے یہ بات کہہ رہے ہوں گے۔ دوسری جگہ اللہ تعالیٰ نے بیان فرمایا کہ اگر انھیں دوبارہ واپس بھیج بھی دیا جائے تو اپنی پرانی روش ہی پر چلیں گے، فرمایا : «{ وَ لَوْ تَرٰۤى اِذْ وُقِفُوْا عَلَى النَّارِ فَقَالُوْا يٰلَيْتَنَا نُرَدُّ وَ لَا نُكَذِّبَ بِاٰيٰتِ رَبِّنَا وَ نَكُوْنَ مِنَ الْمُؤْمِنِيْنَ (27) بَلْ بَدَا لَهُمْ مَّا ككَانُوْا يُخْفُوْنَ مِنْ قَبْلُ وَ لَوْ رُدُّوْا لَعَادُوْا لِمَا نُهُوْا عَنْهُ وَ اِنَّهُمْ لَكٰذِبُوْنَ }» [ الأنعام : ۲۷، ۲۸ ] ’’اور کاش! تو دیکھے جب وہ آگ پر کھڑے کیے جائیں گے تو کہیں گے اے کاش ! ہم واپس بھیجے جائیں اور اپنے رب کی آیات کو نہ جھٹلائیں اور ایمان والوں میں سے ہو جائیں۔ بلکہ ان کے لیے ظاہر ہو گیا جو وہ اس سے پہلے چھپاتے تھے اور اگر انھیں واپس بھیج دیا جائے تو ضرور پھر وہی کریں گے جس سے انھیں منع کیا گیا تھا اور بلاشبہ وہ یقینا جھوٹے ہیں۔‘‘ کفار کے اس اظہارِ حسرت و ندامت کا ذکر متعدد آیات میں آیا ہے۔ دیکھیے سورۂ اعراف (۵۳) اور مومنون (۹۹، ۱۰۰)۔ ¤ ➌ { اِنَّا مُوْقِنُوْنَ :} مگر اس وقت یقین ہو جانے کا کیا فائدہ؟ جو وقت یقین کے فائدہ دینے کا تھا (یعنی دنیا میں) وہ تو انھوں نے گنوا دیا۔ دیکھیے سورۂ مومن (۸۵)۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {وَ لَوْ شِئْنَا لَاٰتَيْنَا كُلَّ نَفْسٍ هُدٰىهَا …:} یعنی یہ کیا بات ہوئی کہ اب تم حقیقت کو اپنی آنکھوں سے دیکھ کر ایمان لے آؤ اور ہم تمھاری سزا موقوف کر دیں، یا تمھیں دوبارہ دنیا میں بھیج دیں۔ اس طرح کی جبری ہدایت تو ہم تمھیں پہلے ہی دے سکتے تھے، مگر اس سے قیامت کی جزا و سزا بے نتیجہ ہو کر رہ جاتی اور امتحان کا مقصد فوت ہو جاتا۔ اب تو ضروری ہے کہ میرا وہ قول پورا ہو جو میں نے ابلیس کے آدم کو سجدے سے انکار کے وقت اسے مخاطب کر کے فرمایا تھا : «{ قَالَ فَالْحَقُّ وَ الْحَقَّ اَقُوْلُ (84) لَاَمْلَـَٔنَّ جَهَنَّمَ مِنْكَ وَ مِمَّنْ تَبِعَكَ مِنْهُمْ اَجْمَعِيْنَ }» [ صٓ: ۸۴، ۸۵ ] ’’فرمایا پھر حق یہی ہے اور میں حق ہی کہتا ہوں کہ میں ضرور بالضرور جہنم کو تجھ سے اور ان سب لوگوں سے بھر دوں گا جو ان میں سے تیری پیروی کریں گے۔‘‘"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ {فَذُوْقُوْا بِمَا نَسِيْتُمْ لِقَآءَ يَوْمِكُمْ هٰذَا :} یعنی ان مجرموں سے کہا جائے گا کہ دنیا کے عیش میں گم ہو کر تم نے اس بات کو بالکل بھلا دیا کہ کبھی اپنے رب سے ملاقات بھی ہونی ہے، اب اس بھولنے کا مزا چکھو۔ آیت کے آخر میں اس مزے کی صراحت فرما دی کہ اپنے عمل کی وجہ سے ہمیشگی کا عذاب چکھو۔ ¤ ➋ { اِنَّا نَسِيْنٰكُمْ :} یعنی جس طرح تم نے ہمیں بھلائے رکھا، آج ہم نے بھی تمھیں بھلا دیا۔ انھیں ہمیشہ عذاب میں چھوڑے رکھنے کو نسیان کے لفظ سے تعبیر فرمایا ہے۔ ورنہ ظاہر ہے کہ اللہ تعالیٰ کا بھولنا ممکن ہی نہیں، جیسا کہ فرمایا : «{ لَا يَضِلُّ رَبِّيْ وَ لَا يَنْسَى } » [ طٰہٰ : ۵۲ ] ’’میرا رب نہ بھٹکتا ہے اور نہ بھولتا ہے۔‘‘ اور دیکھیے سورۂ طٰہٰ (۱۲۴ تا ۱۲۶)۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) { اِنَّمَا يُؤْمِنُ بِاٰيٰتِنَا الَّذِيْنَ اِذَا ذُكِّرُوْا بِهَا … :} یعنی وہ لوگ جو تکبر کرتے ہوئے ہماری ملاقات ہی کو بھول گئے، وہ ہماری آیات پر کبھی ایمان نہیں لاتے۔ ہماری آیات پر تو صرف وہ لوگ ایمان لاتے ہیں جن کی صفات اپنے رب کی ملاقات کو بھول جانے والوں سے بالکل جدا ہوتی ہیں۔ ان کے دلوں میں ضد، ہٹ دھرمی اور عناد نہیں ہوتا۔ ان کی طبیعت اتنی سلیم ہوتی ہے کہ جب انھیں آیات الٰہی کے ساتھ نصیحت کی جاتی ہے تو وہ فوراً حق قبول کرتے اور اللہ کے سامنے سجدہ ریز ہو جاتے ہیں۔ وہ اپنے رب کی حمد کے ساتھ اس کی تسبیح بیان کرتے ہیں اور وہ تکبر نہیں کرتے۔ ان کے نفس کی کبریائی انھیں حق قبول کرنے اور اللہ اور اس کے رسول کی اطاعت سے مانع نہیں ہوتی۔ عائشہ رضی اللہ عنھا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم اپنے رکوع اور سجود میں یہ دعا پڑھا کرتے تھے : [ سُبْحَانَكَ اللّٰهُمَّ رَبَّنَا وَ بِحَمْدِكَ، اَللّٰهُمَّ اغْفِرْ لِيْ ] ’’پاک ہے تو اے اللہ! اے ہمارے پروردگار! اور تیری حمد کے ساتھ، اے اللہ! مجھے بخش دے۔‘‘ [ بخاري، الأذان، باب الدعاء في الرکوع : ۷۹۴ ]"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {تَتَجَافٰى جُنُوْبُهُمْ عَنِ الْمَضَاجِعِ …:} یعنی وہ نماز اور ذکر الٰہی کی خاطر اپنے آرام دہ بستر اور لذیذ نیند چھوڑ دیتے ہیں۔ اس کا اعلیٰ درجہ تہجد ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّ عُيُوْنٍ (15) اٰخِذِيْنَ مَاۤ اٰتٰىهُمْ رَبُّهُمْ اِنَّهُمْ كَانُوْا قَبْلَ ذٰلِكَ مُحْسِنِيْنَ (16) كَانُوْا قَلِيْلًا مِّنَ الَّيْلِ مَا يَهْجَعُوْنَ (17) وَ بِالْاَسْحَارِ هُمْ يَسْتَغْفِرُوْنَ» [ الذاریات : ۱۵ تا ۱۸ ] ’’بے شک متقی لوگ باغوں اور چشموں میں ہوں گے۔ لینے والے ہوں گے جو ان کا رب انھیں دے گا، یقینا وہ اس سے پہلے نیکی کرنے والے تھے۔ وہ رات کے بہت تھوڑے حصے میں سوتے تھے۔ اور رات کی آخری گھڑیوں میں وہ بخشش مانگتے تھے۔‘‘ اس کے علاوہ بھی قیام اللیل کی فضیلت میں بہت سی آیات و احادیث آئی ہیں اور رسول اللہ صلی اللہ علیہ وسلم کی تعریف میں عبد اللہ بن رواحہ رضی اللہ عنہ نے کہا ہے: ¤ {يَبِيْتُ يُجَافِيْ جَنْبَهُ عَنْ فِرَاشِهِ ¤ إِذَا اسْتَثْقَلَتْ بِالْمُشْرِكِيْنَ الْمَضَاجِعُ} ¤ ’’وہ رات اس حال میں گزارتا ہے کہ اپنا پہلو اپنے بستر سے الگ رکھتا ہے، جب مشرکین کے بستر انھیں نہایت بوجھل کیے ہوتے ہیں۔‘‘ [ بخاري، التھجد، باب فضل من تعار من اللیل فصلّی : ۱۱۵۵ ] ¤ مگر یہاں ایک سوال ہے کہ یہ جو فرمایا کہ ہماری آیات پر ایمان صرف وہی لوگ لاتے ہیں جن میں یہ صفات پائی جائیں، تو کیا جو شخص تہجد نہ پڑھے اس کا اللہ تعالیٰ کی آیات پر ایمان نہیں؟ جواب اس کا یہ ہے کہ بے شک ایمان کا اعلیٰ مرتبہ انھی لوگوں کا ہے جو فرائض کے علاوہ نفل قیام اللیل کا اہتمام کرتے ہیں، مگر یہ اللہ تعالیٰ کا خاص کرم ہے کہ جو شخص مغرب کے بعد عشاء کے انتظار میں نہیں سوتا بلکہ عشاء جماعت کے ساتھ ادا کرتا ہے، پھر فجر کے وقت آرام دہ بستر اور میٹھی نیند چھوڑ کر جماعت کے ساتھ نماز ادا کرتا ہے، وہ بھی اس فضیلت سے محروم نہیں رہتا۔ کیونکہ اس کا پہلو بھی نماز کی خاطر بستر سے جدا رہا ہے اور وہ سویا ہے تب بھی اس کے انتظار میں سویا ہے۔ عبدالرحمن بن ابی عمرہ کہتے ہیں کہ عثمان بن عفان رضی اللہ عنہ مغرب کی نماز کے بعد مسجد میں داخل ہوئے اور اکیلے بیٹھ گئے، میں ان کے پاس جا بیٹھا تو انھوں نے کہا، بھتیجے! میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے، آپ فرماتے تھے : [ مَنْ صَلَّی الْعِشَاءَ فِيْ جَمَاعَةٍ فَكَأَنَّمَا قَامَ نِصْفَ اللَّيْلِ وَمَنْ صَلَّی الصُّبْحَ فِيْ جَمَاعَةٍ فَكَأَنَّمَا صَلَّی اللَّيْلَ كُلَّهُ ] [مسلم، المساجد و مواضع الصلاۃ، باب فضل صلاۃ العشاء و الصبح في جماعۃ : ۶۵۶ ] ’’جو شخص عشاء کی نماز جماعت کے ساتھ پڑھے تو گویا اس نے نصف رات قیام کیا اور جو شخص صبح کی نماز جماعت کے ساتھ پڑھے تو گویا اس نے ساری رات قیام کیا۔‘‘ انس بن مالک رضی اللہ عنہ زیر تفسیر آیت : «{ تَتَجَافٰى جُنُوْبُهُمْ عَنِ الْمَضَاجِعِ }» کے بارے میں فرماتے ہیں : [ نَزَلَتْ فِي انْتِظَارِ هٰذِهِ الصَّلَاةِ الَّتِيْ تُدْعَی الْعَتَمَةَ ] [ ترمذي، تفسیر القرآن، باب و من سورۃ السجدۃ : ۳۱۹۶، و صححہ الألباني ]’’یہ آیت اس نماز کے بارے میں اتری جسے عتمہ (عشاء) کہا جاتا ہے۔‘‘ اور ابو برزہ رضی اللہ عنہ بیان کرتے ہیں : [ أَنَّ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ كَانَ يَكْرَهُ النَّوْمَ قَبْلَ الْعِشَاءِ وَالْحَدِيْثَ بَعْدَهَا ] [ بخاري، مواقیت الصلاۃ، باب ما یکرہ من النوم قبل العشاء : ۵۶۸ ] ’’رسول اللہ صلی اللہ علیہ وسلم عشاء سے پہلے سونے کو اور اس کے بعد باتیں کرنے کو ناپسند کرتے تھے۔‘‘ ¤ ➋ { يَدْعُوْنَ رَبَّهُمْ خَوْفًا وَّ طَمَعًا :} یعنی وہ اپنے  رب کی گرفت کے خوف اور اس کی رحمت کی امید کے ساتھ اسے پکارتے ہیں۔ انھیں خوف ہے کہ ان کے اعمال رد نہ کر دیے جائیں اور امید بھی کہ وہ قبولیت کا شرف حاصل کر لیں گے۔ (دیکھیے مومنون : ۵۷ تا ۶۱) نہ بے جا امید، جو بے عمل یا بد عمل بنا دیتی ہے اور نہ اتنا خوف جو اللہ کی رحمت سے مایوس کر دے اور آدمی کو کفر تک پہنچا دے۔ اس سے معلوم ہوا کہ بعض صوفیوں نے جو کہا : ’’میرا دل چاہتا ہے کہ میں جہنم کو بجھادوں اور جنت کو جلا دوں، تاکہ لوگ اللہ تعالیٰ کی عبادت کسی ڈر یا لالچ سے نہ کریں بلکہ محض اس کی رضا کے لیے کریں۔‘‘ اور بعض نے کہا : ’’میں چاہتا ہوں کہ میرا رب مجھ سے راضی ہو جائے، پھر خواہ مجھے جنت میں بھیج دے خواہ جہنم میں پھینک دے۔‘‘ یہ فضول باتیں ہیں، کیونکہ اللہ تعالیٰ نے اپنے مومن بندوں کی صفت ہی یہ بیان فرمائی ہے کہ وہ اپنے رب کو خوف اور طمع کے ساتھ پکارتارتے ہیں، پھر یہ بھی ان لوگوں کی جہالت ہے کہ اللہ تعالیٰ کی رضا کو جنت اور جہنم سے الگ کر دیا، حالانکہ جنت اسے ملے گی جس پر وہ راضی ہو گا اور جہنم میں وہ جائے گا جس پر وہ ناراض ہو گا۔ رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی سے کہا : [ كَيْفَ تَقُوْلُ فِي الصَّلاَةِ؟ ] ’’تم نماز میں کیا کہتے ہو؟‘‘ اس نے کہا : [ أَ تَشَهَّدُ وَ أَقُوْلُ، أَللّٰهُمَّ إِنِّيْيْ أَسْأَلُكَ الْجَنَّةَ وَ أَعُوْذُ بِكَ مِنَ النَّارِ، أَمَا إِنِّيْ لَا أُحْسِنُ دَنْدَنَتَكَ وَلَا دَنْدَنَةَ مُعَاذٍ ] ’’میں تشہد پڑھتا ہوں اور یہ کہتا ہوں کہ اے اللہ! میں تجھ سے جنت مانگتا ہوں اور آگ سے تیری پناہ مانگتا ہوں، ہاں! میں آپ جیسی اچھی گنگناہٹ نہیں کر سکتا اور نہ معاذ جیسی گنگناہٹ کر سکتا ہوں۔‘‘ تو نبی صلی اللہ علیہ وسلم نے فرمایا : [ حَوْلَهَا نُدَنْدِنُ ] [ أبوداوٗد، الصلاۃ، باب تخفیف الصلاۃ : ۷۹۲، و صححہ الألباني ] ’’ہم بھی اسی کے گرد گنگنا رہے ہیں۔‘‘ تو جب رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحابہ کی ساری تگ و دو جہنم سے بچنے اور جنت کے حصول کے لیے ہے، تو پھر ان سے بڑھ کر اللہ کی رضا چاہنے والا کون ہو گا۔ ہمارے ایک شاعر نے جو کہا ہے: ¤ واعظ کمال ترک سے ملتی ہے یاں مراد ¤ دنیا جو چھوڑ دی ہے تو عقبیٰ بھی چھوڑ دے ¤ سوداگری نہیں یہ عبادت خدا کی ہے ¤ او بے خبر، جزا کی تمنا بھی چھوڑ دے ¤ تو یہ اسی تصوف سے متاثر ہونے کا نتیجہ ہے جس کی تعلیمات بنیادی طور پر اسلام ہی کے خلاف ہیں۔ اسلام نے تو {’’ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَّ فِي الْآخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ‘‘} کہنے کی تعلیم دی ہے۔ مسلمانوں نے جہاد چھوڑ کر دنیا کفار کے سپرد کر دی اور غلامی پر قانع ہو گئے، پھر عیش و عشرت میں پڑ کر عقبیٰ سے بھی گئے اور کچھ بے چارے راہبوں کی طرح رب کو راضی کرنے کے لیے دنیا کو چھوڑ کر خانقاہوں، جنگلوں اور کٹیاؤں میں ہُو، حق کے ورد کرتے رہے اور کفر کی یلغار اسلام اور مسلمانوں کو محکوم بناتی چلی گئی۔ [ إِنَّا لِلّٰہِ وَ إِنَّا إِلَیْہِ رَاجِعُوْنَ ] ¤ ➌ { وَ مِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ :} اس کی تفسیر کے لیے دیکھیے سورۂ بقرہ کی آیت (۳) کی تفسیر۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {فَلَا تَعْلَمُ نَفْسٌ مَّاۤ اُخْفِيَ لَهُمْ مِّنْ قُرَّةِ اَعْيُنٍ … :} لفظ {’’ نَفْسٌ ‘‘} نکرہ ہے، جو عموم کا فائدہ دیتا ہے، یعنی کوئی نفس نہیں جانتا، خواہ انسان ہو یا جن یا فرشتہ، پھر خواہ ملک مقرب ہو یا نبی مرسل، غرض اللہ کے سوا کوئی ان نعمتوں کو نہیں جانتا جو اس نے مذکور اہل ایمان کے لیے چھپا کر رکھی ہیں، جن سے ان کی آنکھیں ٹھنڈی ہوں گی، ان کے ان اعمال کی جزا کے لیے جو وہ کیا کرتے تھے۔ ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ قَالَ اللّٰهُ تَبَارَكَ وَ تَعَالٰی أَعْدَدْتُ لِعِبَادِيَ الصَّالِحِيْنَ مَا لَا عَيْنٌ رَأَتْ، وَلَا أُذُنٌ سَمِعَتْ، وَلَا خَطَرَ عَلٰی قَلْببِ بَشَرٍ، قَالَ أَبُوْ هُرَيْرَةَ اقْرَؤُوْا إِنْ شِئْتُمْ : «{ فَلَا تَعْلَمُ نَفْسٌ مَّاۤ اُخْفِيَ لَهُمْ مِّنْ قُرَّةِ اَعْيُنٍ }» ] [ بخاري، التفسیر، باب قولہ : «فلا تعلم نفس ما أخفي… » : ۴۷۷۹۔ مسلم : ۲۸۲۴ ] ’’اللہ تبارک و تعالیٰ فرماتا ہے، میں نے اپنے صالح بندوں کے لیے وہ کچھ تیار کر رکھا ہے جو نہ کسی آنکھ نے دیکھا اور نہ کسی کان نے سنا اور نہ کسی بشر کے دل میں اس کا خیال آیا۔‘‘ ابوہریرہ رضی اللہ عنہ نے فرمایا، اگر چاہو تو اللہ تعالیٰ کا یہ فرمان پڑھ لو : «{ فَلَا تَعْلَمُ نَفْسٌ مَّاۤ اُخْفِيَ لَهُمْ مِّنْ قُرَّةِ اَعْيُنٍ }» [ السجدۃ : ۱۷ ] اس مقام پر ابن کثیر رحمہ اللہ نے جنت کی نعمتوں کے بیان میں کئی احادیث ذکر کی ہیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) { اَفَمَنْ كَانَ مُؤْمِنًا كَمَنْ كَانَ فَاسِقًا …: ’’فِسْقٌ‘‘} کا لفظ {’’فَسَقَتِ الثَّمَرَةُ‘‘} سے نکلا ہے، جب پھل پھٹ کر چھلکے سے نکل جائے، پھر اطاعت سے نکل جانے کے معنی میں استعمال ہونے لگا۔ یہ لفظ نافرمان مومن پر بھی بولا جاتا ہے اور کافر پر بھی، جیسا کہ فرمایا : «{ وَ مَنْ كَفَرَ بَعْدَ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ }» [ النور : ۵۵ ] ’’جس نے اس کے بعد کفر کیا تو یہی لوگ نافرمان ہیں۔‘‘ اس آیت میں فاسق سے مراد کافر و مشرک ہے، کیونکہ مومن کے مقابلے میں آ رہا ہے۔ کفار کے لیے عذاب کی وعید اور مومنوں کے لیے نعمتوں کی نوید کا ذکر آیا تو اس پر کوئی کج بحث کہہ سکتا تھا کہ اللہ تعالیٰ کے خزانوں میں کیا کمی ہے، وہ چاہے تو جس طرح دنیا میں اس نے مومن و کافر سبھی کو اپنی نعمتیں دے رکھی ہیں، آخرت میں بھی دونوں کو نواز دے۔ فرمایا، یہ تو عدل و حکمت ہی کے خلاف ہے، بھلا ایک ماننے والا اس شخص کی طرح ہو سکتا ہے جو نہ ماننے والا ہے؟ ایک مطیع و فرماں بردار شخص اس شخص کی طرح ہو سکتا ہے جو نافرمان اور باغی ہے؟ دونوں کبھی برابر نہیں ہو سکتے، نہ دنیا میں ان کی زندگی کا انداز ایک ہے، نہ موت کے وقت اور نہ آخر ت میں ایک ہو گا۔ اس مضمون کی آیات کے لیے دیکھیے سورۂ صٓ (۲۸)، حشر (۲۰) اور جاثیہ (۲۱) یہ آخرت کے ثواب و عقاب کی نہایت عمدہ دلیل ہے، کیونکہ اگر اس دنیا کے بعد کوئی دوسری زندگی نہ ہو تو نیک و بد سب یکساں ہو جائیں اور نیک و بد کا یکساں ہو جانا پروردگار عالم کی حکمت کے بالکل خلاف ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ {اَمَّا الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ فَلَهُمْ جَنّٰتُ الْمَاْوٰى: ’’ الْمَاْوٰى ‘‘ ’’أَوٰي يَأْوِيْ ‘‘} (ض) (جگہ پکڑنا، پناہ لینا، رہنا) سے ظرف یا مصدر میمی ہے، رہنے کی جگہ یا رہائش۔ یعنی جو لوگ ایمان لائے اور انھوں نے صالح عمل کیے ان کے لیے ہمیشہ رہنے کے باغات ہیں، دنیا کی طرح نہیں جو دارِ زوال ہے اور نہ ہی جہنم کی طرح جو جائے فرار ہے۔ ¤ ➋ {نُزُلًۢا بِمَا كَانُوْا يَعْمَلُوْنَ : ’’ نُزُلًا‘‘} مہمان کی آمد پر اس کی خاطر تواضع کے لیے جو کچھ پیش کیا جائے۔ جب مہمانی کا یہ عالم ہے تو مزید عنایتوں کا کیا حال ہو گا۔ ان کا کچھ اندازہ اس سے پہلی آیت : «{ فَلَا تَعْلَمُ نَفْسٌ مَّاۤ اُخْفِيَ لَهُمْ مِّنْ قُرَّةِ اَعْيُنٍ }» اور حدیثِ رسول : [ مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلٰی قَلْبِ بَشَرٍ ] [ مسلم : ۲۸۲۴ ] سے ہو سکتا ہے۔ یہ محض اللہ تعالیٰ کا فضل و کرم ہے کہ وہ کسی کے نیک اعمال کو اس کے لیے جنت کی مہمانی کا سبب بنا دے، ورنہ کسی کا عمل اسے جنت میں داخل نہیں کرے گا، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ سَدِّدُوْا وَقَارِبُوْا وَأَبْشِرُوْا، فَإِنَّهُ لَا يُدْخِلُ أَحَدًا الْجَنَّةَ عَمَلُهُ، قَالُوْا وَلَا أَننْتَ يَا رَسُوْلَ اللّٰهِ!؟ قَالَ وَلَا أَنَا إِلَّا أَنْ يَّتَغَمّمَّدَنِيَ اللّٰهُ بِمَغْفِرَةٍ وَ رَحْمَةٍ ] [ بخاري، الرقاق، باب القصد و المداومۃ علی العمل : ۶۴۶۷ ]’’سیدھے رہو، قریب رہو اور خوش خبری سنو، کیونکہ کسی کو بھی اس کا عمل جنت میں داخل نہیں کرے گا۔‘‘ لوگوں نے کہا : ’’یا رسول اللہ! کیا آپ کو بھی نہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھے بھی نہیں، الا یہ کہ اللہ تعالیٰ مجھے مغفرت اور رحمت کے ساتھ ڈھانپ لے۔‘‘"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ {وَ اَمَّا الَّذِيْنَ فَسَقُوْا فَمَاْوٰىهُمُ النَّارُ:’’ الَّذِيْنَ فَسَقُوْا ‘‘} سے مراد کفار ہیں، جیسا کہ پیچھے گزرا۔ {’’مَاْوَاهُمْ ‘‘} کی خبر{’’ النَّارُ ‘‘ } معرف باللّام آنے کی وجہ سے کلام میں حصر پید اہو گیا کہ ’’ان کا ٹھکانا آگ ہی ہے۔‘‘ یعنی کفار کی جہنم سے نکلنے کی کوئی صورت نہیں۔ ¤ ➋ { كُلَّمَاۤ اَرَادُوْۤا اَنْ يَّخْرُجُوْا مِنْهَاۤ اُعِيْدُوْا فِيْهَا … :} ظاہر ہے جہنم سے کفار کے نکلنے کی تو کوئی صورت ہی نہیں، تو وہ آگ سے نکلنے کا ارادہ کیسے کریں گے۔ اس کا اندازہ سمرہ بن جندب رضی اللہ عنہ سے مروی ایک لمبی حدیث سے ہوتا ہے، جس میں رسول اللہ صلی اللہ علیہ وسلم نے کئی چیزوں کا ذکر فرمایا، جو اللہ تعالیٰ نے آپ کو خواب میں دکھائیں۔ ان میں سے ایک چیز یہ ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ فَانْطَلَقْنَا إِلٰی ثَقْبٍ مِثْلِ التَّنُّوْرِ أَعْلَاهُ ضَيِّقٌ وَ أَسْفَلُهُ وَاسِعٌ يَتَوَقَّدُ تَحْتَهُ نَارًا فَإِذَا اقْتَرَبَ ارْتَفَعُوْا حَتّٰی كَادَ أَنْ يَخْرُجُوْا، فَإِذَا خَمَدَتْ رَجَعُوْا فِيْهَا، وَ فِيْهَا رِجَالٌ وَنِسَاءٌ عُرَاةٌ، فَقُلْتُ مَنْ هٰذَا؟ قَالَا انْطَلِقْ… وَالَّذِيْ رَأَيْتَهُ فِي الثَّقْبِ فَهُمُ الزُّنَاةُ ] [ بخاري، الجنائز، باب : ۱۳۸۶ ] ’’پھر ہم ایک سوراخ کی طرف چلے جو تنور کی طرح تھا، اس کا اوپر کا حصہ تنگ اور نیچے کا کھلا تھا۔ اس کے نیچے سے آگ بھڑک رہی تھی، جب وہ اوپر قریب آتی تو وہ اوپر اٹھ آتے، یہاں تک کہ نکلنے کے قریب ہو جاتے، جب وہ ماند پڑتی تو واپس اسی میں لوٹ جاتے۔ میں نے کہا : ’’یہ کون ہیں؟‘‘ تو دونوں فرشتوں نے کہا : ’’آگے چلو۔‘‘… (تمام مشاہدات کے بعد ان فرشتوں نے بتایا) ’’تم نے اس سوراخ میں جو کچھ دیکھا وہ زانی لوگ تھے۔‘‘ واضح رہے کہ ایک ہی حال میں رہنے میں تکلیف کی وہ شدت نہیں ہوتی جو بار بار اس کے دہرانے سے ہوتی ہے۔ جہنمیوں کے لیے آگ کے ماند ہونے پر ہر مرتبہ اس کی تیزی اور بڑھا دی جائے گی، جیسا کہ فرمایا : «{ مَاْوٰىهُمْ جَهَنَّمُ كُلَّمَا خَبَتْ زِدْنٰهُمْ سَعِيْرًا }» [ بني إسرائیل : ۹۷ ] ’’ان کا ٹھکانا جہنم ہے، جب کبھی بجھنے لگے گی ہم ان پر بھڑکانا زیادہ کر دیں گے۔‘‘ اور فرمایا : «{ كُلَّمَاۤ اَرَادُوْۤا اَنْ يَّخْرُجُوْا مِنْهَا مِنْ غَمٍّ اُعِيْدُوْا فِيْهَا }» [ الحج : ۲۲ ] ’’جب کبھی ارادہ کریں گے کہ سخت گھٹن کی وجہ سے اس سے نکلیں، اس میں لوٹا دیے جائیں گے۔‘‘"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {وَ لَنُذِيْقَنَّهُمْ مِّنَ الْعَذَابِ الْاَدْنٰى … :} یعنی ہم اس بڑے عذاب سے پہلے، جس کا ابھی ذکر ہوا انھیں ایک ادنیٰ عذاب ضرور چکھائیں گے، تاکہ وہ باز آجائیں۔ مراد آخرت کے عذاب سے پہلے دنیا کا عذاب ہے، جیسا کہ طبری نے معتبر سند کے ساتھ عبداللہ بن عباس رضی اللہ عنھما سے نقل کیا ہے : ’’اس سے مراد دنیا کی مصیبتیں، بیماریاں اور آزمائشیں ہیں، جن میں اللہ تعالیٰ بندوں کو مبتلا کرتا ہے، تاکہ وہ توبہ کر لیں۔‘‘ دوسری جگہ اللہ تعالیٰ نے فرمایا : «{ اَوَ لَا يَرَوْنَ اَنَّهُمْ يُفْتَنُوْنَ فِيْ كُلِّ عَامٍ مَّرَّةً اَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوْبُوْنَ وَ لَا هُمْ يَذَّكَّرُوْنَ }» [ التوبۃ : ۱۲۶ ] ’’اور کیا وہ نہیں دیکھتے کہ بے شک وہ ہر سال ایک یا دو مرتبہ آزمائش میں ڈالے جاتے ہیں، پھر بھی وہ نہ توبہ کرتے ہیں اور نہ ہی وہ نصیحت پکڑتے ہیں۔‘‘ اور فرمایا : «{ ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَ الْبَحْرِ بِمَا كَسَبَتْ اَيْدِي النَّاسِ لِيُذِيْقَهُمْ بَعْضَ الَّذِيْ عَمِلُوْا لَعَلَّهُمْ يَرْجِعُوْنَ }» [ الروم : ۴۱ ]’’خشکی اور سمندر میں فساد ظاہر ہوگیا، اس کی وجہ سے جو لوگوں کے ہاتھوں نے کمایا، تاکہ وہ انھیں اس کا کچھ مزہ چکھائے جو انھوں نے کیا ہے، تاکہ وہ باز آ جائیں۔‘‘ کفار مکہ کے لیے اس سے مراد وہ قتل بھی ہے جس سے وہ جنگ بدر میں دو چار ہوئے اور وہ قحط سالی بھی جو نبی کریم صلی اللہ علیہ وسلم کی بددعا سے ان پر مسلط ہوئی۔بعض مفسرین نے {’’ الْعَذَابِ الْاَدْنٰى ‘‘} سے مراد عذابِ قبر لیا ہے، مگر آیت کے آخری الفاظ {’’ لَعَلَّهُمْ يَرْجِعُوْنَ ‘‘} (تاکہ وہ پلٹ آئیں) سے ظاہرہے کہ یہ تفسیر درست نہیں، کیونکہ عذابِ قبر کے بعد توبہ اور واپس پلٹنے کا کوئی موقع نہیں۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {وَ مَنْ اَظْلَمُ مِمَّنْ ذُكِّرَ بِاٰيٰتِ رَبِّهٖ …:} یہ استفہام انکاری ہے کہ ’’اس سے بڑا ظالم کون ہے؟‘‘ یعنی کوئی نہیں، وہی بڑا ظالم ہے جسے اس کے رب کی آیات کے ساتھ نصیحت کی گئی، پھر اس نے ان سے منہ پھیر لیا۔ {’’ ثُمَّ ‘‘} (پھر) کا مطلب یہ ہے کہ یہ بات بہت بعید اور تعجب والی ہے کہ آیاتِ الٰہی کے ساتھ نصیحت کے بعد بھی اس نے ان سے منہ پھیر لیا۔ وہ آیات (نشانیاں) جن کے ساتھ آدمی کو نصیحت ہوتی ہے، کئی طرح کی ہیں، ایک آفاقی نشانیاں، جو کائنات میں ہر طرف بکھری ہوئی ہیں، مثلاً سورج، چاند، ستارے، دن رات، ہوا، بارش، سمندر، کشتیاں اور زمین کی نباتات وغیرہ۔ دوسری وہ جو خود انسان کے نفس میں موجود ہیں، یعنی اس کی ساخت، اس میں رکھی گئی عجیب و غریب قوتیں اور استعدادیں اور اس کے اعضا کا حیران کن خود کار نظام۔ ان دونوں کے متعلق اللہ تعالیٰ نے فرمایا : «{ سَنُرِيْهِمْ اٰيٰتِنَا فِي الْاٰفَاقِ وَ فِيْۤ اَنْفُسِهِمْ حَتّٰى يَتَبَيَّنَ لَهُمْ اَنَّهُ الْحَقُّ }» [ حٰمٓ السجدۃ:۵۳] ’’عنقریب ہم انھیں اپنی نشانیاں دنیا کے کناروں میں اور ان کے نفسوں میں دکھلائیں گے، یہاں تک کہ ان کے لیے واضح ہو جائے کہ یہی حق ہے۔‘‘ تیسری وہ تاریخی واقعات جن سے ہمیشہ ایک ہی نتیجہ برآمد ہوتا ہے کہ جس قوم نے بھی اللہ کے مقابلے میں سرکشی اختیار کی اور اس کے رسولوں اور اس کی آیات کو جھٹلایا، تو اللہ نے اسے تباہ و برباد کر کے رکھ دیا۔ سورۂ ابراہیم کی آیت (۵) : «{ وَ ذَكِّرْهُمْ بِاَيّٰىمِ اللّٰهِ }» اور سورۂ یوسف کی آیت (۱۱۱) : «{ لَقَدْ كَانَ فِيْ قَصَصِهِمْ عِبْرَةٌ لِّاُولِي الْاَلْبَابِ }» میں ایسے ہی واقعات کے ساتھ نصیحت اور عبرت مراد ہے۔ چوتھی جو آزمائشوں اور مصیبتوں کی شکل میں ہر شخص اور ہر قوم کے سامنے آتی ہیں، تاکہ وہ پلٹ آئیں، جن کا ذکر اس سے پہلی آیت میں ہے۔ پانچویں قسم اللہ تعالیٰ کی وہ آیات ہیں جو اللہ تعالیٰ نے انسانوں کی ہدایت کے لیے اپنے انبیاء پر نازل فرمائیں۔ ان آیات میں بھی گزشتہ چاروں قسم کی آیات پر غوروفکر کی طرف توجہ دلا کر اللہ تعالیٰ، اس کے رسولوں اور اس کے احکام پر عمل کی دعوت دی جاتی ہے۔ ¤ ➋ { اِنَّا مِنَ الْمُجْرِمِيْنَ مُنْتَقِمُوْنَ: ’’ الْمُجْرِمِيْنَ ‘‘} میں الف لام عہد کا ہے، اس لیے ترجمہ ’’ان مجرموں سے‘‘ کیا گیا ہے، یعنی آیاتِ الٰہی کے ساتھ نصیحت کے بعد منہ موڑ لینے والے ان مجرموں سے ہم یقینا انتقام لینے والے ہیں، دنیا میں عذابِ ادنیٰ اور آخرت میں عذابِ اکبر کے ساتھ۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ {وَ لَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ فَلَا تَكُنْ فِيْ مِرْيَةٍ مِّنْ لِّقَآىِٕهٖ : ’’ لِقَآىِٕهٖ ‘‘} کی ضمیر {’’ الْكِتٰبَ ‘‘} کی طرف بھی لوٹ سکتی ہے اور لفظ {’’ مُوْسَى ‘‘} کی طرف بھی۔ پہلی صورت میں وہی بات دہرائی ہے جو سورت کے شروع میں فرمائی تھی کہ اس لاریب کتاب کا نازل کرنا رب العالمین کی طرف سے ہے۔ مطلب یہ ہے کہ اس سے پہلے ہم نے موسیٰ علیہ السلام کو کتاب دی، اب آپ کو کتاب ملی ہے، تو آپ اس کتاب کے ملنے میں کسی قسم کے شک میں مبتلا نہ ہوں۔ ہماری طرف سے کتاب کا عطا کیا جانا کوئی نئی بات نہیں، ہم پہلے بھی رسولوں کو کتابیں عطا کرتے رہے ہیں، جیسا کہ فرمایا : «{ قُلْ مَا كُنْتُ بِدْعًا مِّنَ الرُّسُلِ وَ مَاۤ اَدْرِيْ مَا يُفْعَلُ بِيْ وَ لَا بِكُمْ اِنْ اَتَّبِعُ اِلَّا مَا يُوْحٰۤى اِلَيَّ وَ مَاۤاۤ اَنَا اِلَّا نَذِيْرٌ مُّبِيْنٌ }» [ الأحقاف : ۹ ] ’’ کہہ دے میں رسولوں میں سے کوئی انوکھا نہیں ہوں اور نہ میں یہ جانتا ہوں کہ میرے ساتھ کیا کیا جائے گا اور نہ (یہ کہ) تمھارے ساتھ (کیا) ، میں تو بس اسی کی پیروی کرتا ہوں جو میری طرف وحی کیا جاتا ہے اور میں تو بس واضح ڈرانے والا ہوں۔‘‘ اس میں اگرچہ اول مخاطب رسول اللہ صلی اللہ علیہ وسلم ہیں، مگر مراد ہر سننے والا ہے کہ کوئی بھی سننے والا رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی طرف سے کتاب ملنے میں کسی قسم کے شک میں نہ رہے، آپ کو کتاب ملنا ایسے ہی ہے جیسے ہم نے موسیٰ علیہ السلام کو کتاب دی، یہ کوئی انوکھی بات نہیں۔ اس تفسیر کے مطابق {’’ الْكِتٰبَ ‘‘} سے مراد خاص تورات نہیں، جنس کتاب ہے، یعنی ہم نے موسیٰ علیہ السلام کو کتاب دی تو آپ بھی کتاب ملتے ہی کوئی شک نہ کریں۔ اور {’’لِقَاءٌ‘‘} سے مراد کتاب کا ملنا ہے، جیسا کہ فرمایا : «{ وَ اِنَّكَ لَتُلَقَّى الْقُرْاٰنَ مِنْ لَّدُنْ حَكِيْمٍ عَلِيْمٍ }» [ النمل : ۶ ] ’’اور بلاشبہ یقینا تجھے قرآن ایک کمال حکمت والے،سب کچھ جاننے والے کے پاس سے عطا کیا جاتا ہے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم سے پہلے قریب ترین پیغمبر اگرچہ عیسیٰ علیہ السلام ہیں، مگر ایک تو تمام بنی اسرائیل ان پر ایمان نہیں لائے اور ایک یہ کہ وہ بھی تورات ہی کے احکام پر عمل کرتے تھے۔ اس لیے اللہ تعالیٰ نے ان کے بجائے موسیٰ علیہ السلام کو کتاب دینے کا ذکر فرمایا۔ بعض مفسرین نے {’’ الْكِتٰبَ ‘‘} کی طرف ضمیر لوٹانے کی صورت میں یہ معنی کیا ہے کہ آپ موسیٰ علیہ السلام کو کتاب ملنے کے بارے میں شک نہ کریں۔ ¤ دوسری صورت میں یعنی جب {’’ لِقَآىِٕهٖ ‘‘} کی ضمیر موسیٰ علیہ السلامم کی طرف جا رہی ہو تو معنی یہ ہو گا کہ آپ موسیٰ علیہ السلام کے ساتھ اپنی ملاقات کے بارے میں کسی قسم کے شک میں نہ رہیں، جو معراج کی رات بیت المقدس میں اور چھٹے آسمان پر ہوئی، جیسا کہ صحیح بخاری اور دوسری کتب احادیث میں مذکور ہے۔ ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ رَارَأَيْتُ لَيْلَةَ أُسْرِيَ بِيْ مُوْسٰی رَجُلاً آدَمَ طُوَالاً جَعْدًا ، كَأَنَّهُ مِنْ رِجَالِ شَنُوْئَةَ، وَ رَأَيْتُ عِيْسٰی رَجُلاً مَرْبُوْعًا مَرْبُوْعَ الْخَلْقِ إِلَی الْحُمْررَةِ وَ الْبَيَاضِ، سَبْطَ الرَّأْسِ، وَرَأَيْتُ مَالِكًا خَازِنَ النَّارِ وَ الدَّجَّالَ فِيْ آيَاتٍ أَرَاهُنَّ اللّٰهُ إِيَّاهُ ، فَلاَ تَكُنْ فِيْ مِرْيَةٍ مِنْ لِّقَائِهِ] [بخاري، اري، بدء الخلق، باب إذا قال أحدکم آمین و الملائکۃ في السماء… : ۳۲۳۹ ] ’’میں نے اس رات جب مجھے رات کو لے جایا گیا، موسیٰ ( علیہ السلام ) کو دیکھا، بہت لمبے گٹھے ہوئے جسم یا گھونگریالے بالوں والے، گویا وہ شنوء ہ قبیلے کے آدمیوں سے ہیں اور میں نے عیسیٰ ( علیہ السلام ) کو دیکھا، میانہ قد، سرخی اور سفیدی کی طرف مائل سیدھے بالوں والے اور میں نے جہنم کے دربان مالک اور دجال کو دیکھا، من جملہ ان کئی اور نشانیوں کے جو اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو دکھائیں۔ (سورۂ سجدہ میں اسی کا ذکر ہے کہ) پس تو اس کی ملاقات کے بارے میں کسی شک میں نہ رہ۔‘‘ ¤ ➋ {وَ جَعَلْنٰهُ هُدًى لِّبَنِيْۤ اِسْرَآءِيْلَ : ’’ جَعَلْنٰهُ ‘‘} میں {’’هٗ‘‘} کی ضمیر کتاب کے لیے ہے، یعنی ہم نے موسیٰ علیہ السلام کو دی جانے والی کتاب کو بنی اسرائیل کے لیے ہدایت بنا دیا۔ پہلے اسی مضمون کی آیت سورۂ بنی اسرائیل (۲) میں گزر چکی ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { وَ جَعَلْنَا مِنْهُمْ اَىِٕمَّةً يَّهْدُوْنَ بِاَمْرِنَا :} اور ہم نے بنی اسرائیل میں سے کچھ ایسے امام اور پیشوا بنائے جو لوگوں کی رہنمائی ہمارے حکم کے ساتھ کرتے تھے۔ ظاہر ہے اللہ کے حکم کے ساتھ رہنمائی وہی لوگ کر سکتے ہیں جو اس کا علم رکھتے ہوں، اس میں بنی اسرائیل کے انبیاء بھی شامل ہیں، جیسا کہ اللہ تعالیٰ نے ان سے پہلے ابراہیم، اسحاق اور یعقوب علیھم السلام کے متعلق فرمایا : «{ وَ جَعَلْنٰهُمْ اَىِٕمَّةً يَّهْدُوْنَ بِاَمْرِنَا وَ اَوْحَيْنَاۤ اِلَيْهِمْ فِعْلَ الْخَيْرٰتِ وَ ااِقَامَ الصَّلٰوةِ وَ اِيْتَآءَ الزَّكٰوةِ وَ كَانُوْا لَنَا عٰبِدِيْنَ }» [ الأنبیاء : ۷۳ ] ’’اور ہم نے انھیں ایسے پیشوا بنایا جو ہمارے حکم کے ساتھ رہنمائی کرتے تھے اور ہم نے ان کی طرف نیکیاں کرنے اور نماز قائم کرنے اور زکوٰۃ ادا کرنے کی وحی بھیجی اور وہ صرف ہماری عبادت کرنے والے تھے۔‘‘ اور بنی اسرائیل کے وہ علماء بھی جو ہدایت پر قائم تھے اور لوگوں کو اللہ کے حکم کے مطابق اس ہدایت کی طرف دعوت دیتے تھے۔ یہ ہدایت اللہ کی کتاب تھی اور اس پر ایمان لانے والے دو طرح کے لوگ تھے، ایک وہ ائمہ جو اللہ کے حکم کے مطابق رہنمائی کرتے تھے اور دوسرے ان کے وہ پیروکار جو اس رہنمائی پر عمل کرتے تھے۔ پہلی قسم کے لوگوں کا مقام نبوت کے بعد سب سے بلند ہے، فرمایا : «{ يَرْفَعِ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ وَ الَّذِيْنَ اُوْتُوا الْعِلْمَ دَرَجٰتٍ }» [ المجادلۃ : ۱۱ ] ’’اللہ ان لوگوں کو درجوں میں بلند کرے گاجو تم میں سے ایمان لائے اور جنھیں علم دیا گیا۔‘‘ ¤ ➋ {لَمَّا صَبَرُوْا وَ كَانُوْا بِاٰيٰتِنَا يُوْقِنُوْنَ :} یعنی ان ائمہ کو پیشوائی کا یہ مقام دو وجہ سے حاصل ہوا، ایک صبر کی وجہ سے کہ انھوں نے اپنے آپ کو اللہ تعالیٰ کے احکام کی بجا آوری پر باندھ کر اور اس کی منع کردہ چیزوں سے روک کر رکھا۔ وہ اللہ کے دین کی دعوت دیتے رہے اور اس کے لیے جہاد کرتے رہے اور انھوں نے اس راستے میں پیش آنے والی ہر مصیبت پر صبر کیا۔ دوسرے اللہ تعالیٰ کی آیات پر یقین کی وجہ سے کہ وہ دنیاوی فائدوں اور لذتوں میں پھسل جانے والے نہیں تھے، بلکہ اللہ تعالیٰ کی آیات اور اس کے وعدوں پر یقین رکھنے والے تھے۔ اس سے معلوم ہوا کہ امامت کا مقام وہی لوگ حاصل کر سکتے ہیں جو صبر اور اللہ تعالیٰ کی آیات پر یقین کے وصف سے آراستہ ہوں۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ { اِنَّ رَبَّكَ هُوَ يَفْصِلُ بَيْنَهُمْ …:} پچھلی آیت میں اس وقت کا ذکر ہے جب بنی اسرائیل نے کتاب اللہ پر عمل کیا، ان کے علماء اور ائمہ خود دین پر قائم رہے، دوسروں کو امر بالمعروف اور نہی عن المنکرکا فریضہ سرانجام دیتے رہے اور اس راستے میں اپنوں اور بیگانوں کی ایذا رسانی پر صبر کرتے رہے۔ بعد میں جب وہ دنیا پرستی اور طمع میں مبتلا ہو گئے، جانتے بوجھتے ہوئے اللہ تعالیٰ کی کتاب پر عمل کے بجائے اس کی من مانی تاویل بلکہ اس میں تحریف کرنے لگے، ہر ایک نے اپنی مرضی کے مسائل ایجاد کر لیے تو وہ مختلف گروہوں میں بٹ گئے۔ ہر فرقہ اپنے آپ ہی کو سچا قرار دیتا تھا، تو اللہ تعالیٰ نے فرمایا، ان کے ان اختلافات کے بارے میں تیرا رب ہی قیامت کے دن فیصلہ فرمائے گا۔ ¤ ➋ بنی اسرائیل کے ان حالات و واقعات میں امت مسلمہ کے لیے سبق ہے کہ امامت کا مقام کن لوگوں کو حاصل ہوتا ہے اور کسی قوم کے عروج و زوال کا باعث کیا چیز ہوتی ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) {اَوَ لَمْ يَهْدِ لَهُمْ كَمْ اَهْلَكْنَا مِنْ قَبْلِهِمْ … :} یہ بات مشرکین عرب کے متعلق فرمائی کہ کیا اس بات نے ان کی رہنمائی نہیں کی کہ ہم نے ان سے پہلے کتنی ہی قوموں کو ہلاک کر دیا، جن کے تباہ شدہ کھنڈرات اب بھی باقی ہیں، جن میں یہ لوگ چلتے پھرتے ہیں اور ان کی ویرانی ان کی آنکھوں کے سامنے ہے۔ مراد عرب میں آنے والے پیغمبروں کی امتیں ہیں، یعنی قوم عاد، ثمود اور اہل مدین وغیرہ۔ اہلِ عرب ان کے کھنڈرات اپنی آنکھوں سے دیکھتے تھے اور ان اقوام کے حالات زندگی اپنے بزرگوں سے سنتے بھی تھے، پھر بھی کوئی سبق حاصل نہیں کرتے تھے، اس لیے فرمایا : «{ اَفَلَا يَسْمَعُوْنَ }» تو کیا یہ لوگ سنتے نہیں کہ پیغمبروں کی نافرمانی کا انجام کیا ہوتا ہے؟"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) {اَوَ لَمْ يَرَوْا اَنَّا نَسُوْقُ الْمَآءَ اِلَى الْاَرْضِ الْجُرُزِ … :} یہ توحید و رسالت کے ساتھ سورت کے تیسرے بنیادی مضمون کا تذکرہ ہے، یعنی کیا ان لوگوں نے اپنی آنکھوں سے بارش کے پانی کے ساتھ بنجر زمین سے کھیتیوں کو پیدا ہوتے ہوئے نہیں دیکھا، جن میں سے وہ بھی کھاتے ہیں اور ان کے چوپائے بھی؟ اسی طرح اللہ تعالیٰ تمام مردوں کو دوبارہ زندگی بخش کر حساب کے لیے سامنے لا کر کھڑا کرے گا۔ دیکھیے سورۂ اعراف (۵۷)، روم (۵۰) اور یٰس(۳۳ تا ۳۵)۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) {وَ يَقُوْلُوْنَ مَتٰى هٰذَا الْفَتْحُ … :} مشرکین جب قیامت قائم ہونے کے دلائل کے سامنے لاجواب ہوتے تو کہتے، اچھا بتاؤ، یہ فیصلہ کب ہو گا، قیامت کب آئے گی؟ اس سے ان کی جہالت واضح ہوتی ہے کہ جب ایک چیز کا آنا یقینی ہو تو صرف اس وجہ سے اس سے غفلت برتنا کیسے درست ہو سکتا ہے کہ ہمیں اس کے وقت کا علم نہیں۔ اللہ تعالیٰ نے کفار کے اس سوال کا متعدد مرتبہ ذکر فرمایا ہے۔ دیکھیے سورۂ نازعات (۴۲ تا ۴۵) اور بنی اسرائیل (۴۹ تا ۵۱)۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) {قُلْ يَوْمَ الْفَتْحِ لَا يَنْفَعُ الَّذِيْنَ كَفَرُوْۤا اِيْمَانُهُمْ … :} یعنی تمھارے اس سوال سے تمھیں کچھ حاصل نہیں، تم اس مہلت کو غنیمت سمجھو جو اس وقت تمھیں حاصل ہے۔ کیونکہ فیصلے کا وہ دن آگیا تو آنکھوں دیکھی حقیقت پا کر نہ تمھارا ایمان لانا تمھیں کچھ فائدہ دے گا اور نہ مزید مہلت ملے گی۔ دیکھیے سورۂ مومن(۸۴، ۸۵)۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { فَاَعْرِضْ عَنْهُمْ وَ انْتَظِرْ :} جو لوگ قیامت کا انکار محض اس لیے کر رہے ہیں کہ انھیں اس کا وقت نہیں بتایا گیا، انھیں سمجھانا بے سود ہے، آپ انھیں ان کے حال پر چھوڑ دیں اور انتظار کریں کہ اللہ کا وعدہ کب پورا ہوتا ہے، جو ہر حال میں پورا ہو کر رہنے والا ہے۔ ¤ ➋ {اِنَّهُمْ مُّنْتَظِرُوْنَ :} یقینا وہ بھی انتظار کرنے والے ہیں کہ آپ اور آپ کی یہ چھوٹی سی جماعت کب زمانے کی کسی گردش کا شکار ہوتی ہے۔ دیکھیے سورۂ توبہ (۹۸) اور سورۂ طور میں فرمایا : «{ اَمْ يَقُوْلُوْنَ شَاعِرٌ نَّتَرَبَّصُ بِهٖ رَيْبَ الْمَنُوْنِ (30) قُلْ تَرَبَّصُوْا فَاِنِّيْ مَعَكُمْ مِّنَ الْمُتَرَبِّصِيْنَ }» [ الطور : ۳۰، ۳۱ ] ’’یا وہ کہتے ہیں کہ یہ ایک شاعر ہے جس پر ہم زمانے کے حوادث کا انتظار کرتے ہیں ؟ کہہ دے انتظار کرو، پس بے شک میں (بھی) تمھارے ساتھ انتظار کرنے والوں سے ہوں۔‘‘"
    }
  ]
}