{
  "surah": "Saba ",
  "surah_number": 34,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ {اَلْحَمْدُ لِلّٰهِ الَّذِيْ لَهٗ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ …:} حمد کا معنی کسی کی خوبی کی وجہ سے تعریف ہے۔ یہ سورت ان پانچ سورتوں میں سے ایک ہے جن کی ابتدا {’’ اَلْحَمْدُ لِلّٰهِ ‘‘} سے ہوتی ہے اور وہ ہیں سورۂ فاتحہ، انعام، کہف، سبا اور فاطر۔ پانچوں میں سب تعریف اللہ کے لیے ہونے کی الگ الگ دلیل بیان کی گئی ہے، اگرچہ ان سب کا ایک دوسری کے ساتھ بھی تعلق ہے۔ {’’ اَلْحَمْدُ لِلّٰهِ ‘‘} کہنے میں صرف یہی بات نہیں آتی کہ ساری تعریف اللہ کے لیے ہے، بلکہ یہ بات بھی آتی ہے کہ تمام خوبیوں کا مالک بھی وہی ہے، کیونکہ خوبی نہ ہو تو تعریف کیسی؟ اور سب تعریف اور تمام خوبیاں اللہ کے لیے ہونے کی دلیل یہ ہے کہ آسمانوں میں جو کچھ ہے، یا زمین میں جو کچھ ہے، مراد پوری کائنات میں جو بھی چیز ہے اس کا مالک وہی ہے۔ اسی نے سب کچھ پیدا کیا، وہی انھیں قائم رکھے ہوئے ہے اور وہی ان کی تدبیر فرما رہا ہے۔ کسی بھی چیز میں اگر کوئی خوبی ہے تو اس کی عطا کردہ، پھر ہر خوبی اور ہر تعریف کا مالک اس کے سوا کون ہو سکتا ہے؟ ¤ ➋ اس آیت کی تفسیر دو طرح ہے، ایک یہ کہ پہلے جملے {’’ اَلْحَمْدُ لِلّٰهِ الَّذِيْ لَهٗ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ ‘‘} سے مراد یہ ہے کہ دنیا میں سب تعریف اللہ کے لیے ہے، کیونکہ دوسرے جملے {’’ وَ لَهُ الْحَمْدُ فِي الْاٰخِرَةِ ‘‘} میں آخرت میں سب تعریف اس کے لیے ہونے کا ذکر ہے۔ دوسری تفسیر یہ ہے کہ پہلے جملے {’’ اَلْحَمْدُ لِلّٰهِ الَّذِيْ لَهٗ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ ‘‘} سے مراد یہ ہہے کہ دنیا اور آخرت دونوں میں حمد اللہ کے لیے ہے۔ پھر آخرت میں حمد کا اللہ ہی کے لیے ہونا خاص طور پر دوبارہ ذکر فرمایا، کیونکہ دنیا میں تو بظاہر کسی اور کی بھی تعریف ہو جاتی ہے، مگر آخرت میں صرف اللہ تعالیٰ ہی کی حمد ہو گی اور ہر ایک کی زبان پر {’’ اَلْحَمْدُ لِلّٰهِ ‘‘} کا کلمہ جاری ہو گا۔ دیکھیے سورۂ زمر (۷۴)، اعراف (۴۳) اور فاطر (۳۴، ۳۵) یہ ایسے ہی جیسے سورۂ بقرہ کی آیت (۹۸) : « مَنْ كَانَ عَدُوًّا لِّلّٰهِ وَ مَلٰٓىِٕكَتِهٖ وَ رُسُلِهٖ وَ جِبْرِيْلَ وَ مِيْكٰىلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلْكٰفِرِيْنَ » میں لفظ{ ’’ مَلٰٓىىِٕكَتِهٖ ‘‘} میں سب فرشتے شامل ہونے کے باوجود جبریل و میکال کا الگ ذکر بھی فرمایا۔ {’’اَلْحَمْدُ لِلّٰهِ ‘‘} کے مزید فوائد کے لیے سورۂ فاتحہ کے فوائد ملاحظہ فرمائیں۔ ¤ ➌ { وَ هُوَ الْحَكِيْمُ الْخَبِيْرُ :} یعنی صرف وہ ایک ہے جس  کا ہر کام محکم و مضبوط ہے اور جسے کائنات کے ذرّے ذرّے کی پوری خبر ہے، اس لیے اس کے کسی کام میں کوئی نقص ہے نہ عیب، جبکہ کوئی اور نہ پوری خبر رکھتا ہے نہ حکمت، اس لیے اس کے پاس عجز و فقر کے سوا کچھ نہیں، پھر حمد کس بات پر ؟"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { يَعْلَمُ مَا يَلِجُ فِي الْاَرْضِ وَ مَا يَخْرُجُ مِنْهَا … :} اس آیت میں اللہ تعالیٰ کے علم کی کچھ تفصیل بیان فرمائی۔ وہ ان تمام چیزوں کو جانتا ہے جو زمین میں داخل ہوتی ہیں اور جو اس سے نکلتی ہیں اور جو آسمان سے اترتی ہیں اور اس میں چڑھتی ہیں، جو شمار سے باہر ہیں اور جنھیں صرف وہی جانتا ہے۔ اللہ تعالیٰ کا یہ کمال علم بھی اس کے اکیلے مستحق حمد ہونے کی دلیل ہے، کسی اور کو دوسری چیزیں تو ایک طرف رہیں خود اپنی ذات کا بھی پورا علم نہیں، پھر وہ {’’الحمد‘‘} کے لائق کیسے ہو گیا۔ ¤ ➋ { وَ هُوَ الرَّحِيْمُ الْغَفُوْرُ :} یعنی ہر چیز کا مالک ہونے، حکیم و خبیر ہونے اور ذرّے ذرّے کا علم رکھنے کے باوجود بندوں کی نافرمانی پر فوری گرفت نہیں کرتا، کیونکہ وہی ہے جس کی نہ رحمت کی کوئی حد ہے، نہ مغفرت کی۔ اس لیے اس نے بندوں کو مہلت دے رکھی ہے اور بڑی سے بڑی سرکشی پر بھی مقرر کردہ وقت سے پہلے گرفت نہیں فرماتا۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { وَ قَالَ الَّذِيْنَ كَفَرُوْا لَا تَاْتِيْنَا السَّاعَةُ :} یہ بیان کرنے کے بعد کہ اللہ تعالیٰ نے اپنے بندوں پر جو بے حساب نعمتیں کی ہیں، ان پر دنیا کے علاوہ آخرت میں بھی حمد اور شکر اسی کے لیے ہے، یہ بیان فرمایا کہ کفار اپنے خالق و مالک کی حمد کے بجائے دوبارہ زندہ ہو کر اس کے سامنے پیش ہونے کو تسلیم ہی نہیں کرتے اور کہتے ہیں کہ ہم پر قیامت نہیں آئے گی۔ ¤ ➋ { قُلْ بَلٰى وَ رَبِّيْ لَتَاْتِيَنَّكُمْ:} قسم اٹھا کر بات کرنے سے اس بات کی اہمیت اور اس کے واقع ہونے کی تاکید مقصود ہوتی ہے، جس پر قسم اٹھائی گئی ہے۔ اس کے علاوہ کوئی بات جتنی شدت سے کی گئی ہو اس کا رد اتنی ہی یا اس سے بھی زیادہ شدت کے ساتھ کیا جاتا ہے۔ کفار قیامت کا انکار قسمیں اٹھا اٹھا کر کرتے تھے، جیسا کہ اللہ نے ذکر فرمایا : « وَ اَقْسَمُوْا بِاللّٰهِ جَهْدَ اَيْمَانِهِمْ لَا يَبْعَثُ اللّٰهُ مَنْ يَّمُوْتُ » [ النحل : ۳۸ ] ’’اور انھوں نے اپنی پکی قسمیں کھاتے ہوئے اللہ کی قسم کھائی کہ اللہ اسے نہیں اٹھائے گا جو مر جائے۔‘‘ وہ قیامت کا مذاق بھی اڑاتے تھے اور اسے جلد از جلد لانے کا مطالبہ بھی کرتے تھے، اس لیے اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیا کہ وہ اپنے رب کی قسم کھا کر انھیں بتائیں کہ وہ تم پر ضرور بالضرور آئے گی۔ حافظ ابن کثیر نے فرمایا کہ یہ آیت ان تین آیات میں سے ایک ہے جن میں اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو حکم دیا کہ وہ اپنے رب کی قسم کھا کر بتائیں کہ قیامت ضرور قائم ہو گی۔ ان میں سے ایک سورۂ یونس کی آیت ہے : « وَ يَسْتَنْۢبِـُٔوْنَكَ اَحَقٌّ هُوَ قُلْ اِيْ وَ رَبِّيْۤ اِنَّهٗ لَحَقٌّ وَ  مَاۤ اَنْتُمْ بِمُعْجِزِيْنَ » [ یونس : ۵۳ ] ’’اور وہ تجھ سے پوچھتے ہیں کیا یہ سچ ہی ہے؟ تو کہہ ہاں! مجھے اپنے رب کی قسم! یقینا یہ ضرور سچ ہے اور تم ہر گز عاجز کرنے والے نہیں ہو۔‘‘ دوسری یہ آیت اور تیسری سورۂ تغابن میں ہے : « زَعَمَ الَّذِيْنَ كَفَرُوْۤا اَنْ لَّنْ يُّبْعَثُوْا قُلْ بَلٰى وَ رَبِّيْ لَتُبْعَثُنَّ » [ التغابن : ۷ ] ’’وہ لوگ جنھوں نے کفر کیا انھوں نے گمان کیا کہ وہ ہرگز اٹھائے نہیں جائیں گے۔ کہہ دے کیوں نہیں؟ میرے رب کی قسم! تم ضرور بالضرور اٹھائے جاؤ گے۔‘‘ ¤ ➌ {عٰلِمِ الْغَيْبِ لَا يَعْزُبُ عَنْهُ…: ’’ عٰلِمِ الْغَيْبِ ‘‘ ’’ رَبِّيْ ‘‘} کی صفت ہے۔ {’’عَزَبَ يَعْزُبُ‘‘} (ن، ض) غائب ہونا، چھپا رہنا۔ {’’ وَ لَاۤ اَصْغَرُ مِنْ ذٰلِكَ وَ لَاۤ اَكْبَرُ …‘‘} میں {’’ اَصْغَرُ ‘‘} اور {’’ اَكْبَرُ ‘‘} پر رفع مبتدا ہونے کی وجہ سے ہے۔ {’’ اِلَّا ‘‘} حرف استثنا ہے اور {’’ فِيْ كِتٰبٍ مُّبِيْنٍ ‘‘} خبر ہے۔ {’’ كِتٰبٍ مُّبِيْنٍ ‘‘} سے مراد لوح محفوظ ہے۔ کتاب کو واضح کہنے کا مطلب یہ ہے کہ کتابوں میں لکھی ہوئی بات ڈھونڈنا پڑتی ہے، مگر وہ ایسی کتاب ہے جو ہر چیز کو خود ہی واضح کر دیتی ہے۔ ¤ ➍ قیامت کے منکروں کی سب سے بڑی دلیل یہ تھی اور ہے کہ جب ہم مر کر مٹی ہو گئے اور ہماری خاک کے ذرّات بھی کہاں سے کہاں منتشر ہو گئے تو ہم دوبارہ کیسے زندہ ہوں گے۔ اللہ تعالیٰ نے فرمایا کہ ان سے کہو، مجھے اپنے اس رب کی قسم ہے جو غیب کو جاننے والا ہے! جس سے ذرہ برابر کوئی چیز بھی چھپی ہوئی نہیں، نہ اس سے کوئی چھوٹی چیز ہے اور نہ بڑی، مگر اس کے علم میں ہے اور لوح محفوظ میں درج ہے۔ مطلب یہ ہے کہ مرنے والوں کے ذرّات جہاں بھی ہوں وہ سب سے واقف بھی ہے اور انھیں جمع کرنے اور دوبارہ جوڑنے اور زندہ کرنے پر قادر بھی ہے۔ دیکھیے سورۂ ق (۳، ۴) اور قیامہ (۳، ۴)۔ ¤ ➎ {’’ ذَرَّةٍ ‘‘} غبار کے اس چھوٹے سے چھوٹے حصے کو کہتے ہیں جو روشنی میں چمکتا ہوا نظر آتا ہے۔ اللہ تعالیٰ کے اس فرمان میں ’’کہ اس سے چھوٹی ہر چیز بھی کتاب مبین میں ہے‘‘ اس حقیقت کا بیان ہے جو ان آیات کے نزول کے سیکڑوں برس بعد تجربے سے ثابت ہوئی کہ ذرہ (ایٹم) بھی قابل تقسیم ہے اور اس سے چھوٹی بھی بہت سے چیزیں موجود ہیں۔ ¤ ➏ { وَ لَاۤ اَكْبَرُ :} یہاں ایک سوال ہے کہ یہ کہنے کے بعد کہ ’’ذرے سے چھوٹی چیزیں بھی کتاب مبین میں ہیں‘‘ یہ کہنے کی کیا ضرورت ہے کہ ’’اس سے بڑی چیزیں بھی کتاب مبین میں ہیں۔‘‘ جواب اس کا یہ ہے کہ اس کی ضرورت یہ ہے کہ کوئی یہ نہ سمجھے کہ لوح محفوظ میں صرف باریک چیزوں کا علم ہی محفوظ کیا گیا ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) { لِيَجْزِيَ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ … :} ان آیات میں قیامت کا مقصد اور اس کی حکمت بیان کی گئی ہے، یعنی قیامت اس لیے برپا ہو گی کہ اللہ تعالیٰ ایمان اور عمل صالح والوں کو ان کی جزا دے، کیونکہ دنیا کی محدود مدت میں نہ نیکوں کو ان کی پوری جزا ملتی ہے، نہ بدوں کو ان کی پوری سزا۔ اب اگر جزا و سزا کا کوئی دن ہی نہ ہو تو اس کا مطلب یہ ہو گا کہ نیک و بد یکساں ہیں، جب کہ یہ بات عقل کے خلاف ہے۔ دیکھیے سورۂ ص (۲۸)، سجدہ (۱۸ تا ۲۰) اور حشر (۲۰) اور اللہ تعالیٰ کے عدل کے بھی خلاف ہے۔ (دیکھیے انبیاء : ۴۷) بلکہ یہ ان لوگوں پر ظلم ہو گا جن پر دنیا میں ظلم ہوتا رہا، جب کہ اللہ تعالیٰ بندوں پر ذرہ برابر ظلم کا روا دار نہیں، جیسا کہ فرمایا : «{ وَ مَا رَبُّكَ بِظَلَّامٍ لِّلْعَبِيْدِ }» [ حٰمٓ السجدۃ : ۴۶ ] ’’اور تیرا رب اپنے بندوں پر ہرگز کوئی ظلم کرنے والا نہیں۔‘‘ بھلا وہ کون سا مالک ہے جس کے غلاموں میں سے کوئی اس کا حکم مانے، کوئی نہ مانے اور وہ سب سے یکساں سلوک کرے، اور اس کے غلاموں میں سے بعض بعض پر ظلم کرتا رہے اور وہ ظالم سے باز پرس ہی نہ کرے، پھر جب انسان اپنے غلاموں میں یہ برداشت نہیں کرتا تو اس بادشاہوں کے بادشاہ، ملک الملوک کے متعلق یہ گمان کیسے کیا جا سکتا ہے؟ {’’ مَغْفِرَةٌ ‘‘} پر تنوین تعظیم کی ہے اور{ ’’ رِزْقٌ كَرِيْمٌ ‘‘} سے مراد جنت کی نعمتیں ہیں۔ دیکھیے سورۂ سجدہ (۱۷)۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {وَ الَّذِيْنَ سَعَوْ فِيْۤ اٰيٰتِنَا مُعٰجِزِيْنَ … : ’’ رِجْزٍ ‘‘} کا معنی ہے {’’أَسْوَأُ الْعَذَابِ‘‘} (بد ترین عذاب) یعنی جن لوگوں کی کوشش ہے کہ ہماری آیات کا مقابلہ کرتے ہوئے عاجز کر دیں اور نیچا دکھا دیں، کبھی انھیں جادو کہتے ہیں، کبھی شعر اور کبھی پہلے لوگوں کے افسانے، تاکہ لوگوں کو ان پر ایمان لانے سے روکیں، ان کے لیے بدترین قسم کے عذاب کی سزا ہے، جو نہایت المناک ہے۔ مراد جہنم ہے، جس سے زیادہ بری اور درد ناک سزا کوئی نہیں۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {وَ يَرَى الَّذِيْنَ اُوْتُوا الْعِلْمَ … : ’’ يَرَى ‘‘} میں رُؤیت (دیکھنے) سے مراد یہاں دل کے ساتھ دیکھنا یعنی جاننا ہے۔{’’ يَرَى الَّذِيْنَ اُوْتُوا الْعِلْمَ ‘‘} کا پہلا مفعول {’’ الَّذِيْۤ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ ‘‘} ہے اور دوسرا مفعول {’’ الْحَقَّ ‘‘} ہے۔ {’’ هُوَ ‘‘} ضمیر فصل ہے۔ خبر {’’ الْحَقَّ ‘‘} پر الف لام کی وجہ سے اور ضمیر فصل کی وجہ سے کلام میں حصر اور تاکید پیدا ہو گئی، اس لیے ترجمہ کیا گیا ہے کہ ’’وہی حق ہے۔‘‘ {’’ الَّذِيْنَ اُوْتُوا الْعِلْمَ ‘‘} سے مراد سب سے پہلے صحابہ کرام ہیں، پھر تمام مسلمان جو فکرو دانش اور علم نافع سے بہرہ مند ہوئے، یا اہلِ کتاب میں سے جو لوگ ایمان لائے، جیسے عبد اللہ بن سلام رضی اللہ عنہ ۔ اس آیت اور اس سے اگلی آیت میں رسول، وحی الٰہی اور قیامت کے متعلق اہل علم و دانش کا یقین و ایمان اور کفار کا عقیدہ و اعلان بیان فرمایا ہے۔ چنانچہ فرمایا، جن لوگوں کو علم دیا گیا ہے وہ تو جانتے اور یقین رکھتے ہیں کہ جو کچھ آپ کی طرف نازل کیا گیا ہے وہی حق ہے اور وہ اس ذات پاک کا راستہ دکھاتا ہے جو سب پرغالب اور تمام خوبیوں کا مالک ہے۔ کفار اور شیطان لاکھ کوشش کر لیں، وہ اس کے سب پر غالب ہونے اور تمام خوبیوں کا مالک ہونے کے یقین کی وجہ سے اس کے راستے کے سوا کسی اور راستے پر چلنے کے لیے تیار نہیں ہیں۔ اس لیے وہ اس کے بتانے کے مطابق قیامت قائم ہونے پر یقین رکھتے ہیں اور اس کی تیاری کرتے ہیں۔ ¤ ➋ بعض مفسرین نے {’’ وَ يَرَى الَّذِيْنَ ‘‘} کا عطف {’’ لِيَجْزِيَ الَّذِيْنَ اٰمَنُوْا ‘‘} پر بیان کیا ہے، مگر بہتر یہی ہے کہ اسے نیا کلام قرار دیا جائے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {وَ قَالَ الَّذِيْنَ كَفَرُوْا هَلْ نَدُلُّكُمْ … :} اہلِ علم کے بعد کفار کا قول ذکر فرمایا کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم جیسی شخصیت کا ذکر، جن کی شہرت محتاج بیان نہیں، حقارت کے انداز سے ’’ایک آدمی‘‘ کہہ کر کیا، یعنی لوگوں سے کہا، کیا ہم تمھیں ’’ایک آدمی‘‘ بتائیں جو تمھیں یہ بتاتا ہے کہ جب تم ریزہ ریزہ کر کے منتشر کر دیے جاؤ گے تو پھر ایک نئی پیدائش کے ساتھ زندہ کر دیے جاؤ گے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { اَفْتَرٰى عَلَى اللّٰهِ كَذِبًا … :} یعنی اس کا یہ کہنا کہ ریزہ ریزہ کر دیے جانے کے بعد تم نئے سرے سے پھر زندہ کیے جاؤ گے، دو حال سے خالی نہیں، یا تو ہوش و حواس کی درستی میں وہ جان بوجھ کر اللہ تعالیٰ پر جھوٹ باندھ رہا ہے اور اس کی طرف نسبت کر کے وہ بات کہہ رہا ہے جو اس نے نہیں فرمائی، یا اسے جنون ہے، اس کا دماغ خراب ہے، بے سوچے سمجھے جو جی میں آئے کہہ دیتا ہے۔ [ نَعُوْذُ بِاللّٰہِ مِنْ ذٰلِکَ ] ¤ ➋ { بَلِ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ … :} رسول اللہ صلی اللہ علیہ وسلم کی پوری عمر قریش مکہ کے سامنے گزری تھی۔ (دیکھیے یونس : ۱۶) آپ کے متعلق یہ دونوں باتیں اتنی بے کار تھیں کہ ان کی تردید کی ضرورت ہی نہیں تھی، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کا صادق اور امین ہونا سب کے ہاں مسلّم تھا۔(دیکھیے انعام : ۳۳) جیسا کہ ابوسفیان کے اس اعتراف پر کہ انھیں رسول اللہ صلی اللہ علیہ وسلم کے متعلق جھوٹ بولنے کا کوئی واقعہ معلوم نہیں، ہرقل نے کہا تھا : ’’یہ نہیں ہو سکتا کہ وہ لوگوں پر تو جھوٹ نہ بولے، مگر اللہ تعالیٰ پر جھوٹ باندھنے لگے۔‘‘ [ دیکھیے بخاري : ۷ ] رہی دیوانہ یا پاگل ہونے کی بات تو آپ کی عقل کا کمال دوست و دشمن سب کے سامنے تھا، اس لیے اللہ تعالیٰ نے فرمایا، ان دونوں باتوں میں سے ایک بھی نہیں، اصل بات یہ ہے کہ جو لوگ آخرت کے منکر ہیں وہ جہالت اور نادانی سے کام لے رہے ہیں اور غوروفکر سے بات کی تہ تک پہنچنے کی کوشش ہی نہیں کرتے، جس کی وجہ سے وہ حق بات اور سیدھی راہ سے بہت دور نکل گئے ہیں اور اس راستے پر چل رہے ہیں جو انھیں سیدھا جہنم کے عذاب میں لے جانے والا ہے۔ الٹا سیدھی راہ پر چلنے والے کو جھوٹا یا دیوانہ بتا رہے ہیں۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ { اَفَلَمْ يَرَوْا اِلٰى مَا بَيْنَ اَيْدِيْهِمْ وَ مَا خَلْفَهُمْ … :} فرمایا، آخرت کا انکار زمین و آسمان کی پیدائش میں غوروفکر نہ کرنے کا نتیجہ ہے، ورنہ اگر یہ اپنے آگے اور پیچھے چاروں طرف پھیلے ہوئے آسمان اور زمین کے پیدا کرنے پر غور کرتے، جن کی وسعت ان کے خیال سے بھی زیادہ ہے تو زمین وآسمان کو پیدا کرنے والے کے لیے انسان کو دوبارہ پیدا کرنے پر نہ تعجب کرتے، نہ اس کا انکار کرتے، کیونکہ آسمان و زمین کی پیدائش کے مقابلے میں ان کی تخلیق تو کوئی حیثیت ہی نہیں رکھتی، جیسا کہ فرمایا : «ءَاَنْتُمْ اَشَدُّ خَلْقًا اَمِ السَّمَآءُ بَنٰىهَا » [ النازعات : ۲۷ ] ’’کیا پیدا کرنے میں تم زیادہ مشکل ہو یا آسمان؟ اس نے اسے بنایا۔‘‘ اور فرمایا : «لَخَلْقُ السَّمٰوٰتِ وَ الْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ » [ المؤمن : ۵۷ ] ’’یقینا آسمانوں اور زمین کا پیدا کرنا لوگوں کے پیدا کرنے سے زیادہ بڑا (کام) ہے اور لیکن اکثر لوگ نہیں جانتے۔‘‘ ¤ ➋ { اِنْ نَّشَاْ نَخْسِفْ بِهِمُ الْاَرْضَ … : ’’ كِسَفًا ‘‘ ’’كِسْفَةٌ‘‘} کی جمع ہے، ٹکڑے۔ اس میں کفار کو ڈرایا ہے کہ یہی آسمان و زمین جن کو تم اپنے لیے نفع بخش اور زندگی کا سبب سمجھتے ہو، اللہ تعالیٰ چاہے تو انھی چیزوں کو تمھاری ہلاکت کا موجب بنا سکتا ہے۔ پھر وہ چاہے تو تمھیں اس زمین میں دھنسا دے، جیسے اس نے قارون کو دھنسا دیا، یا آسمان سے عذاب کے کچھ ٹکڑے گرا دے، جیسے اس نے اصحاب الایکہ کے ساتھ کیا۔ ¤ ➌ { اِنَّ فِيْ ذٰلِكَ لَاٰيَةً لِّكُلِّ عَبْدٍ مُّنِيْبٍ :} یعنی جو شخص کسی قسم کا تعصّب یا ہٹ دھرمی نہ رکھتا ہو، بلکہ اخلاص کے ساتھ اپنے رب سے ہدایت کا طالب ہو اور اس کی طرف رجوع رکھتا ہو، اس کے لیے تو آسمان و زمین کے اس عظیم الشّان نظام میں بہت بڑا سبق موجود ہے کہ جس نے اتنا بڑا حکمت سے بھرا ہوا نظام بنایا ہے، وہ دوبارہ زندہ بھی کر سکتا ہے اور یہ بھی سبق ہے کہ اس کی عنایت اور اس کے فضل ہی سے ہم بچے ہوئے ہیں، ورنہ وہ ایک ہی لمحہ میں ہمیں ہلاک کر سکتا ہے۔ یہ زمین اس کی ہے اور آسمان بھی اسی کا ہے، پھر ہم بھاگ کر کہاں جا سککتے ہیں؟ مگر جو اپنے رب کی طرف رجوع کے بجائے اس سے بغاوت اختیار کر چکا ہو، اس کے لیے یہ سب کچھ دیکھنے کے باوجود اس میں کوئی سبق نہیں۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {وَ لَقَدْ اٰتَيْنَا دَاوٗدَ مِنَّا فَضْلًا : ’’ فَضْلًا ‘‘} پر تنوین تعظیم کے لیے ہے، اس لیے ترجمہ ’’بڑا فضل‘‘ کیا گیا ہے۔ پچھلی آیات کے ساتھ داؤد علیہ السلام کے ذکر کی مناسبت یہ ہے کہ پچھلی آیت میں فرمایا کہ زمین وآسمان میں ہر اس بندے کے لیے عظیم نشانی اور عبرت ہے جو اللہ تعالیٰ کی طرف رجوع کرنے والا ہو۔ اب اپنے رجوع کرنے والے کچھ بندوں کا اور ان کے چند واقعات کا ذکر فرمایا، ان میں سے ایک داؤد علیہ السلام ہیں۔ اللہ تعالیٰ نے ان پر بہت سی عنایات فرمائیں اور انھیں متعدّد قسم کی نعمتیں بخشیں۔ ان پر اللہ تعالیٰ کی چند عنایات کا یہاں ذکر کیا جاتا ہے جو قرآن یا حدیث میں آئی ہیں۔ ¤ وہ بکریاں چرانے والے ایک عام نوجوان تھے۔ اللہ تعالیٰ نے ان کے ہاتھوں کفار کے بادشاہ جالوت جیسے گراں ڈیل دشمن کو قتل کروا کر بنی اسرائیل کا محبوب بنا دیا اور پھر ایسا عروج عطا فرمایا کہ وہ طالوت کی وفات کے بعد بنی اسرائیل کے بادشاہ بن گئے اور اللہ تعالیٰ نے انھیں سلطنت کے ساتھ علم و حکمت بھی عطا ف فرمایا۔ (بقرہ : ۲۵۱) انھیں نبوت بخشی اور زبور عطا فرمائی۔ (نساء : ۱۶۳) انھیں زبردست قوت عطا فرمائی۔ (سورۂ ص : ۱۷) انھیں اور ان کے بیٹے سلیمان علیہ السلام کو خاص علم عطا فرمایا۔ (نمل : ۱۵) انھیں پرندوں کی بولی سکھائی۔ (نمل :۱۶) انھیں توبہ و انابت کا وصف عطا فرمایا اور ان کی مغفرت فرمائی۔ (سورۂ ص : ۲۴، ۲۵) انھیں صحیح فیصلہ کرنے کی استعداد اور عدل کرنے کی توفیق بخشی۔ (انبیاء : ۷۹۔ ص : ۲۶) ان کے لیے لوہا نرم کر دیا اور انھیں زرہیں بنانا سکھایا۔ (انبیاء : ۸۰۔ سبا : ۱۰، ۱۱) انھیں نہایت خوب صورت آواز عطا فرمائی اور پہاڑوں اور پرندوں کو ان کے ساتھ تسبیح دہرانے کا حکم دیا۔ (انبیاء : ۷۹۔ سبا : ۱۰) ان کے لیے (زبور) پڑھنا ہلکا کر دیا گیا تھا، چنانچہ وہ گھوڑوں پر زین ڈالنے کا حکم دیتے اور ان پر زین ڈالنے سے پہلے اسے پڑھ لیتے تھے۔ [ دیکھیے بخاري، أحادیث الأنبیاء، باب قول اللہ تعالٰی : «و آتینا داوٗد زبورا » : ۳۴۱۷ ] انھیں صوم و صلاۃ کی اور اس کے ساتھ جہاد فی سبیل اللہ میں استقامت کی وہ توفیق بخشی جس کی تفصیل رسول اللہ صلی اللہ علیہ وسلم نے بیان فرمائی کہ ’’وہ رات کا نصف سو جاتے، پھر ایک ثلث قیام کرتے اور ایک سدس پھر سو جاتے تھے اور ایک دن روزہ رکھتے اور ایک دن افطار کرتے تھے۔‘‘ [ أبوداوٗد، الصیام، باب في صوم یوم و فطر یوم : ۲۴۴۸، و قال الألباني صحیح ] اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’جب دشمن سے مڈبھیڑ ہوتی تو (داؤد علیہ السلام ) بھاگتے نہیں تھے۔‘‘ [ بخاري، الصوم، باب صوم داوٗد علیہ السلام : ۱۹۷۹، عن عبد اللہ بن عمرو رضی اللہ عنھما ] اور وہ صرف اپنے ہاتھ کی کمائی سے کھاتے تھے۔ [ دیکھیے بخاري، البیوع، باب کسب الرجل و عملہ بیدہ : ۲۰۷۲ ] تلاش کرنے سے ان پر اللہ تعالیٰ کی مزید عنایات بھی مل سکتی ہیں۔ ¤ ➋ {يٰجِبَالُ اَوِّبِيْ مَعَهٗ وَ الطَّيْرَ:} اس سے پہلے لفظ {’’قُلْنَا‘‘} (ہم نے کہا) محذوف ہے، جو خود بخود سمجھ میں آرہا ہے۔ {’’ اَوِّبِيْ ‘‘ ’’آبَ يَؤُبُ أَوْبًا‘‘} (ن) لوٹنا اور {’’أَوَّبَ يُأَوِّبُ‘‘} (تفعیل) لوٹانا، دہرانا۔ یعنی ہم نے پہاڑوں سے کہا کہ اے پہاڑو! ان کے ساتھ تسبیح اور تلاوت کے کلمات دہراؤ اور اے پرندو! تم بھی۔ گویا {’’ وَ الطَّيْرَ ‘‘} کا عطف {’’جِبَالٌ‘‘} کے محل پر ہے، اس لیے منصوب ہے، یا یہ {’’سَخَّرْنَا لَهُ‘‘} محذوف کا مفعول ہے، یعنی ہم نے ان کے لیے پرندے بھی تسبیح کرنے کے لیے مسخّر کر دیے، جیسا کہ سورۂ ص میں فرمایا : «وَ الطَّيْرَ مَحْشُوْرَةً كُلٌّ لَّهٗۤ اَوَّابٌ » [ صٓ : ۱۹ ] ’’اور پرندوں کو بھی (مسخّر کر دیا) جب کہ وہ اکٹھے کیے ہوئے سب اس کے لیے بہت رجوع کرنے والے تھے۔‘‘ پہاڑوں اور پرندوں کی تسبیح کا بیان سورۂ انبیاء (۷۹) میں گزر چکا ہے۔ ¤ ➌ { وَ اَلَنَّا لَهُ الْحَدِيْدَ :} داؤد علیہ السلام کے لیے لوہا نرم کرنے کی کیفیت اکثر مفسرین نے یہ لکھی ہے کہ وہ اللہ کے حکم سے آگ میں پگھلائے بغیر ان کے ہاتھ میں موم یا گندھے ہوئے آٹے کی طرح ہوتا تھا۔ اگر ایسا ہو تو اس میں کوئی تعجب کی بات نہیں، مگر یہ صرف قتادہ کا قول ہے، رسول اللہ صلی اللہ علیہ وسلم سے یہ بات ثابت نہیں۔ اگر اللہ تعالیٰ نے انھیں لوہا پگھلا کر نرم کرنے کا سلیقہ سکھا دیا ہو تو یہ بھی {’’ وَ اَلَنَّا لَهُ الْحَدِيْدَ ‘‘} ہی ہے۔ آج کل کسی معجزے یا کرامت کے بغیرر ہنر کی بدولت لوہا لوگوں کے ہاتھوں میں نرم ہو چکا ہے۔ داؤد علیہ السلام کے لیے سب سے پہلے لوہے کی بھٹی ایجاد کرنے، اسے اپنی مرضی کے مطابق ڈھالنے اور سب سے پہلے زرہیں بنانے کا اور اس بات کا شرف بھی کچھ کم نہیں کہ بعد میں آنے والوں نے انھی سے یہ ہنر حاصل کیے۔ نیز دیکھیے سورۂ انبیاء (۸۰)۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ { اَنِ اعْمَلْ سٰبِغٰتٍ : ’’ سٰبِغٰتٍ ‘‘} کامل اور وسیع، یہ {’’دُرُوْعٌ‘‘} محذوف کی صفت ہے، یعنی ہم نے اس سے کہا کہ مکمل اور کشادہ زرہیں تیار کر، جو لڑنے والے کے پورے جسم کو صحیح طریقے سے ڈھانپ لیں اور اسے دشمن کے وار سے محفوظ رکھیں۔ ¤ ➋ {وَ قَدِّرْ فِي السَّرْدِ : ’’ السَّرْدِ ‘‘} کسی موٹی چیز کو سینا، پرونا، جیسے زرہ بننا، چمڑے کو سینا، یہاں لوہے کی کڑیوں کو ترتیب سے جوڑنا مراد ہے۔ (مفردات) کڑیاں جوڑنے میں اندازہ رکھنے کا مطلب یہ ہے کہ چھوٹی بڑی نہ ہوں، نہ ایسی کھلی ہوں کہ جوڑ زیادہ حرکت کرتے رہیں، نہ اتنی تنگ ہوں یا کیل اتنے موٹے ہوں کہ آدمی انھیں پہن کر حرکت ہی نہ کر سکے۔ بلکہ ہر کڑی اور ہر جوڑ جسم میں اس کی جگہ درست بیٹھے اور آپس میں صحیح طریقے سے مرتب ہو۔ ¤ ➌ { وَ اعْمَلُوْا صَالِحًا :} اس خطاب میں داؤد علیہ السلام کی آل کو بھی شامل فرما لیا ہے، اس لیے {’’اِعْمَلْ‘‘} کے بجائے {’’ اعْمَلُوْا ‘‘} فرمایا۔ ¤ ➍ { اِنِّيْ بِمَا تَعْمَلُوْنَ بَصِيْرٌ:} اس میں وعدہ بھی ہے اور وعید بھی، یعنی تم جو کچھ کر رہے ہو میں اسے خوب دیکھ رہا ہوں، صالح اعمال پر جزا دوں گا اور برے اعمال پر سزا دوں گا۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {وَ لِسُلَيْمٰنَ الرِّيْحَ غُدُوُّهَا شَهْرٌ … :} اللہ تعالیٰ کی طرف انابت کرنے والے بندوں میں سے داؤد علیہ السلام کے بعد ان کے فرزند ارجمند سلیمان علیہ السلام کا ذکر فرمایا۔ اللہ تعالیٰ نے ان کے لیے ہوا کو مسخر کر دیا۔ وہ ایک مہینے کی راہ دن کے پہلے پہر اور ایک مہینے کی راہ دن کے پچھلے پہر طے کر لیتی تھی۔ بعض مفسرین نے لکھا ہے کہ اس سے مراد یہ ہے کہ اس زمانے میں بحری جہاز موافق ہواؤں کے ساتھ سفر کرتے تھے۔ آیت میں {’’غُدُوٌّ‘‘} سے مراد جانا ہے اور {’’رَوَاحٌ‘‘} سے مراد واپسی ہے اور مطلب یہ ہے کہ ایک ماہ تک موافق ہوا سلیمان علیہ السلام کے پایۂ تخت سے مشرق کی طرف چلتی تھی، جس کے ذریعے سے ان کے بحری جہاز تجارتی اور دوسرے مقاصد کے لیے مشرق کی طرف روانہ ہوتے تھے، پھر ایک ماہ کے لیے واپسی کے سفر کے لیے مغرب کی طرف چلتی تھی جس سے وہ جہاز واپس فلسطین کی طرف آ جاتے اور یہ مطلب ہے اس آیت کا : «تَجْرِيْ بِاَمْرِهٖۤ اِلَى الْاَرْضِ الَّتِيْ بٰرَكْنَا فِيْهَا وَ كُنَّا بِكُلِّ شَيْءٍ عٰلِمِيْنَ» [ الأنبیاء : ۸۱ ] ’’اس کے حکم سے اس زمین کی طرف چلتی تھی جس میں ہم نے برکت رکھی اور ہم ہر چیز کو جاننے والے تھے۔‘‘ یہ اور اس جیسی تفسیروں کی حقیقت کے لیے دیکھیے سورۂ انبیاء (۸۱)۔ ¤ ان آیات کی تفسیر کرتے ہوئے یہ بات ذہن میں رہنا ضروری ہے کہ ان میں اس شخصیت کو عطا ہونے والی چیزوں کا ذکر ہے، جس نے یہ دعا کی تھی : « رَبِّ اغْفِرْ لِيْ وَهَبْ لِيْ مُلْكًا لَّا يَنْۢبَغِيْ لِاَحَدٍ مِّنْۢ بَعْدِيْ » [ صٓ : ۳۵ ] ’’اے میرے رب! مجھے بخش دے اور مجھے ایسی بادشاہی عطا فرماجو میرے بعد کسی کے لائق نہ ہو۔‘‘ اور جس کی فوجوں کے ایک صاحبِ علم نے یمن سے آنکھ جھپکنے میں ملکہ سبا کا تخت لا حاضر کیا تھا۔ موجودہ زمانے میں جتنی ترقی ہوئی ہے، یا آئندہ ہو گی سلیمان علیہ السلام کو عطا کردہ قوتوں کے مقابلے میں کچھ بھی حیثیت نہیں رکھتی، پھر اگر ہوا ان کے حکم سے انھیں ایک ماہ کا سفر پہلے پہر اور ایک ماہ کا سفر پچھلے پہر میں طے کروا دے تو اس میں تعجب کی کیا بات ہے۔ رہی اس کی کیفیت کہ ہوا انھیں یہ فاصلہ کیسے طے کرواتی تھی تو وہ اللہ تعالیٰ نے بیان نہیں فرمائی اور جو بات معلوم نہ ہو اس کے متعلق تکلّف نہیں کرنا چاہیے۔ سورۂ ص میں فرمایا : « قُلْ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ وَّ مَاۤ اَنَا مِنَ الْمُتَكَلِّفِيْنَ » [ صٓ : ۸۶ ] ’’کہہ دے میں تم سے اس پر کوئی اجرت نہیں مانگتا اور نہ میں بناوٹ کرنے والوں سے ہوں۔‘‘ مزید دیکھیے سورۂ انبیاء (۸۱)۔ ¤ ➋ { وَ اَسَلْنَا لَهٗ عَيْنَ الْقِطْرِ : ’’سَالَ يَسِيْلُ سَيْلًا‘‘} (ض) بہنا۔ {’’أَسَالَ يُسِيْلُ إِسَالَةً‘‘} (افعال) بہانا، جاری کرنا۔ {’’ اَسَلْنَا ‘‘} باب افعال کے ماضی معلوم سے جمع متکلم کا صیغہ ہے۔ داؤد علیہ السلام کے لیے لوہا نرم کر دیا، سلیمان علیہ السلام کو وہ نعمت وراثت میں ملی، مزید ان کے لیے تانبے کا چشمہ جاری کر دیا، تاکہ وہ انھیں وافر مقدار میں دستیاب رہے اور ان کے زیرِ فرمان انسان اور جنّ اس سے ان کی اور ان کی افواج کی ضرورت کی ہر چیز، مثلاً ہر قسم کے چھوٹے بڑے برتن اور گھروں کے اندر اور باہر استعمال ہونے والا سامان تیار کرتے رہیں۔ ایک اخبار کے مطابق اب بھی اسرائیل میں یہودی تانبے کے اس مقام کی تلاش میں ہیں۔ ¤ ➌ { وَ مِنَ الْجِنِّ مَنْ يَّعْمَلُ بَيْنَ يَدَيْهِ بِاِذْنِ رَبِّهٖ :} سورۂ انبیاء میں ان جنّات کا تذکرہ ’’شیاطین‘‘ کے لفظ سے کیا گیا ہے، اس سے معلوم ہوا کہ سورۂ انبیاء میں مذکورہ شیاطین سے مراد انسانی شیاطین نہیں، بلکہ جنّی شیاطین ہیں۔ وہ جنّات جو کام کرتے تھے ان کا تذکرہ اس مقام کے علاوہ سورۂ انبیاء (۸۲) اور سورۂ ص (۳۷، ۳۸) میں ملاحظہ کریں۔ ¤ ➍ { وَ مَنْ يَّزِغْ مِنْهُمْ عَنْ اَمْرِنَا … :} اس کی تفسیر سورۂ انبیاء (۸۲) میں ملاحظہ کریں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ {يَعْمَلُوْنَ لَهٗ مَا يَشَآءُ مِنْ مَّحَارِيْبَ:’’ مَحَارِيْبَ ‘‘ ’’مِحْرَابٌ‘‘} ککی جمع ہے، یہ {’’حَرْبٌ‘‘} سے {’’مِفْعَالٌ‘‘} کے وزن پر ہے، جو آلہ کے لیے استعمال ہوتا ہے۔ اصل معنی اس کا جنگ کا آلہ یا ہتھیار ہے، پھر یہ لفظ کئی معانی میں استعمال ہونے لگا، جن سب معانی میں کسی نہ کسی طرح جنگ کا مفہوم شامل ہے۔ چنانچہ قلعہ اور بڑی عالی شان عمارت کو بھی ’’محراب‘‘ کہتے ہیں، کیونکہ اس میں رہ کر دشمن سے جنگ کی جاتی ہے۔ عبادت کے لیے خاص کمرے کو بھی ’’محراب‘‘ کہتے ہیں، کیونکہ وہ شیطان سے جنگ میں مددگار ہے، جیسا کہ زکریا علیہ السلام کے متعلق فرمایا : «فَنَادَتْهُ الْمَلٰٓىِٕكَةُ وَ هُوَ قَآىِٕمٌ يُّصَلِّيْ فِي الْمِحْرَابِ » [ آل عمران : ۳۹ ] ’’ تو فرشتوں نے اسے آواز دی، جب کہ وہ عبادت خانے میں کھڑا نماز پڑھ رہا تھا۔‘‘ داؤد علیہ السلام کی عبادت کے لیے مخصوص جگہ کو بھی ’’محراب‘‘ کہا گیا ہے، فرمایا : « وَ هَلْ اَتٰىكَ نَبَؤُا الْخَصْمِ اِذْ تَسَوَّرُوا الْمِحْرَابَ» [ صٓ : ۲۱ ] ’’اور کیا تیرے پاس جھگڑنے والوں کی خبر آئی ہے، جب وہ دیوار پھاند کر عبادت خانے میں آ گئے۔‘‘ ¤ سلیمان علیہ السلام کی سیرت میں سب سے نمایاں وصف جہاد ہے، اس کے لیے اللہ تعالیٰ نے انھیں انسانوں، جنّوں اور پرندوں کی فوجیں عطا فرما رکھی تھیں۔ جنگی ضروریات کی تیاری اور فراہمی سے انھیں خاص دلچسپی تھی، چنانچہ گھوڑوں کی دوڑ کروانے کے بعد ان کی پنڈلیوں اور گردنوں پر محبت سے ہاتھ پھیرنے کا ذکر سورۂ ص (۳۰ تا ۳۳) میں ہے۔ یہ سن کر کہ زمین کے کسی خطے پر شرک کا غلبہ اور مشرک عورت کی حکومت ہے، فوراً جہاد کے لیے تیار ہو جانے کا ذکر ملکہ سبا کے قصے میں ہے۔ (دیکھیے سورۂ نمل) ظاہر ہے اس کے لیے ہر قسم کا جنگی سازو سامان تیار کرنا ضروری تھا، اسے ذخیرہ کرنے کے لیے بڑی بڑی عمارتوں کی ضرورت تھی، دشمن کے علاقے میں پیش قدمی، اس پر حملے اور جنگ کے لیے ان شہروں کے نقشے اور اہم عمارتوں کے ماڈل بہم پہنچانا ضروری تھا۔ بڑی تعداد میں فوجوں کے لیے کھانا پکانے، تقسیم کرنے اور اس کے لیے برتن مہیا کرنے کا کام بہت بڑا کام تھا۔ اللہ تعالیٰ نے ان تمام کاموں کے لیے انسانوں اور پرندوں کے علاوہ جنّوں کو بھی سلیمان علیہ السلام کے تابع کر دیا۔ اگر ان میں سے کوئی ان کے حکم سے سرتابی کرتا، تو اسے اللہ تعالیٰ کی طرف سے آگ کے شعلوں کے ساتھ سزا دی جاتی تھی۔ چنانچہ وہ ان کی جنگی ضروریات کے لیے دور دراز سے ہر قسم کا عمارتی سامان پتھر، مرمر، لکڑی اور لوہا وغیرہ مہیا کرتے اور ان کے ساتھ بڑی بڑی عمارتیں تعمیر کرتے۔ ان عمارتوں میں مسجد اقصیٰ کی عمارت بھی شامل تھی۔ ¤ ➋ {وَ تَمَاثِيْلَ :} یہ {’’تِمْثَالٌ‘‘} کی جمع ہے، کسی دوسری چیز کی مثل جو چیز بنائی جائے، خواہ جان دار کی ہو یا بے جان کی، ماڈل اور مجسّمہ کی شکل میں ہو، یا کاغذ پر تصویر کی شکل میں ہو۔ جنّات سلیمان علیہ السلام کے لیے کس قسم کی تماثیل بناتے تھے، رسول اللہ صلی اللہ علیہ وسلم سے اس کی تفصیل نہیں آئی، بعض مفسرین نے اس کی تفصیل میں جو جان دار اشیاء، مثلاً شیر، چیتے وغیرہ کی تصاویر یا مجسّمے بنانے کا ذکر کیا ہے، وہ ان کی سنی سنائی بات ہے، کیونکہ نہ انھوں نے یہ بات رسول اللہ صلی اللہ علیہ وسلم سے نقل کی ہے، نہ وہ سلیمان علیہ السلام کے ساتھ رہے ہیں اور نہ اپنی معلومات کا ذریعہ بتاتے ہیں، جو سلیمان علیہ السلام تک پہنچتا ہو۔ ¤ آیت کے الفاظ یہ ہیں کہ جنات سلیمان علیہ السلام کے حکم سے وہ محاریب اور تماثیل بناتے تھے جو وہ چاہتے تھے۔ ظاہر ہے اللہ کا اتنا جلیل القدر پیغمبر شیروں، ہاتھیوں اور چیتوں یا انسانوں کے لاحاصل مجسّمے بنوائے، ممکن ہی نہیں، خصوصاً اس لیے کہ وہ جس تورات کے احکام پر عامل تھے اس میں جان دار اشیاء کی مورتیاں بنانا حرام تھا۔ حرمت کا یہ حکم اب بھی تورات میں متعدد مقامات پر موجود ہے : ’’تو اپنے لیے کوئی تراشی ہوئی مورت نہ بنانا، نہ کسی چیز کی صورت بنانا جو اوپر آسمان میں یا نیچے زمین پر یا زمین کے نیچے پانی میں ہے۔‘‘ (خروج، باب : ۲۰، آیت : ۴) اور ایک جگہ ہے : ’’تم اپنے لیے بت نہ بنانا اور نہ کوئی تراشی ہوئی مورت یا لاٹ اپنے لیے کھڑی کرنا اور نہ ملک میں کوئی شبیہ دار پتھر رکھنا کہ اسے سجدہ کرو، اس لیے کہ میں خداوند تمھارا خدا ہوں۔‘‘ (احبار، باب : ۲۶، آیت ۱) ایک اور جگہ ہے : ’’تانہ ہو کہ تم بگڑ کر کسی شکل یا صورت کی کھودی ہوئی مورت اپنے لیے بنا لو، جس کی شبیہ کسی مرد یا عورت یا زمین کے کسی حیوان یا ہوا میں اڑنے والے پرندے یا زمین کے رینگنے والے جان دار یا مچھلی سے جو زمین کے نیچے پانی میں رہتی ہو، ملتی ہو۔‘‘ (استثناء، باب : ۴، آیت : ۱۶ تا ۱۸)۔ ¤ تورات کی ان صریح آیات سے واضح ہے کہ سلیمان علیہ السلام کی طرف جان دار اشیاء کے مجسّمے بنانے کی نسبت ان پر بہتان ہے، جو اسی طرح ان پر لگایا گیا ہے جیسے ان پر جادوگر ہونے کا یا بیویوں کے عشق میں مبتلا ہو کربت پرستی کا بہتان لگایا گیا ہے، حالانکہ وہ اللہ تعالیٰ کے برگزیدہ پیغمبر تھے اور تورات کے احکام پر پوری طرح عامل تھے۔ اس لیے آیت کا مطلب یہی ہے کہ سلیمان علیہ السلام جو عمارت بنوانا چاہتے یا جن علاقوں کے نقشے یا عمارتوں کے ماڈل بنوانا چاہتے تھے، جنّات ان کے حکم سے تیار کر دیتے تھے۔ اس آیت سے جان دار اشیاء کی تصاویر یا مجسّموں کا جواز نکالنا ہرگز درست نہیں، کیونکہ ان کی حرمت متفق علیہ مسئلہ ہے۔ رسول اللہ صلی اللہ علیہ وسلم سے جان دار اشیاء کی تصاویر کی صریح حرمت اور ان پر وعید کے لیے صحیح بخاری اور دوسری کتب احادیث کا مطالعہ فرمائیں۔ اختصار کے پیش نظر انھیں یہاں نقل نہیں کیا گیا۔ ¤ ➌ { وَ جِفَانٍ كَالْجَوَابِ وَ قُدُوْرٍ رّٰسِيٰتٍ : ’’ جِفَانٍ ‘‘ ’’جَفْنَةٌ‘‘} کی جمع ہے، کھانے کا بڑا برتن، لگن، تھال۔ {’’اَلْجَوَابِ‘‘} اصل میں {’’اَلْجَوَابِيْ‘‘ } ہے جو {’’جَابِيَةٌ‘‘} کی جمع ہے ’’حوض‘‘۔ {’’ قُدُوْرٍ ‘‘ ’’قِدْرٌ‘‘} کی جمع ہے، ہانڈی، دیگ۔ {’’ رٰسِيٰتٍ ‘‘ ’’رَسَا يَرْسُوْ‘‘} سے اسم فاعل مؤنث {’’رَاسِيَةٌ‘‘} کی جمع ہے۔ قرآن میں پہاڑوں کو {’’ رٰسِيٰتٍ ‘‘} کہا گیا ہے، زمین میں گڑے ہوئے۔ سلیمان علیہ السلام کی فوجوں کی کثرت کے پیش نظر عام دیگیں جتنی بھی ہوں کافی نہیں تھیں، نہ چھوٹے چھوٹے برتن کھانا کھلانے کے لیے کافی تھے، اس لیے جنّات سلیمان علیہ السلام کے لیے ان کی خواہش کے مطابق پکانے کے لیے تانبے وغیرہ کی یا پہاڑوں کو تراش کر پتھر کی اتنی بڑی بڑی دیگیں تیار کرتے تھے جو ایک ہی جگہ جمی رہتیں۔ انھیں اٹھا کر دوسری جگہ لے جایا نہیں جا سکتا تھا۔ ان میں سے ہر دیگ میں ہزاروں آدمیوں کا کھانا پکتا تھا اور مجاہدین کو اجتماعی طور پر کھانا کھلانے کے لیے جنّات سلیمان علیہ السلام کی حسبِ منشا اتنے بڑے بڑے لگن یا تھال بناتے تھے جو حوضوں کی طرح لمبے چوڑے ہوتے، جن پر ایک وقت میں بہت سے آدمی کھانا کھا لیتے تھے۔ ¤ ایک ہی برتن میں بہت سے آدمیوں کے کھانا کھانے کا یہ معمول ہمارے نبی کریم صلی اللہ علیہ وسلم کے ہاں بھی موجود تھا۔ عبد اللہ بن بسر رضی اللہ عنہ بیان کرتے ہیں : [ كَانَ لِلنَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ قَصْعَةٌ يَحْمِلُهَاا أَرْبَعَةُ رِجَالٍ يُقَالُ لَهَا الْغَرَّاءُ فَلَمَّا أَضْحَوْا وَسَجَدُوا الضُّحٰی أُتِيَ بِتِلْكَ الْقَصْعَةِ يَعْنِيْ وَقَدْ ثُرِدَ فِيْهَا فَالْتَفُّوْا عَلَيْهَا فَلَمَّا كَثُرُوْا جَثَا رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ فَقمَ فَقَالَ أَعْرَابِيٌّ مَا هٰذِهِ الْجِلْسَةُ؟ قَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللّٰهَ تَعَالیٰ جَعَلَنِيْ عَبْدًا كَرِيْمًا وَلَمْ يَجْعَلْنِيْ جَبَّارًا عَنِيْدًا ثُمَّ قَالَ  رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ كُلُوْا مِنْ حَوَالَيْهَا وَ دَعُوْا ذِرْوَتَهَا يُبَارَكْ فِيْهَا ] [ أبو داوٗد، الأطعمۃ، باب ما جاء في الأکل من أعلی الصحفۃ : ۳۷۷۳، قال الألباني صحیح ] ’’رسول اللہ صلی اللہ علیہ وسلم کا ایک لگن یا تھال تھا، جسے چار آدمی اٹھاتے تھے، اسے ’’غراء‘‘ کہتے تھے۔ جب ضحی ہوئی اور لوگوں نے ضحی کی نماز پڑھ لی تو وہ لگن لایا گیا، اس میں گوشت کے سالن میں روٹی بھگو کر ثرید بنایا گیا تھا۔ لوگ اس کے گرد بیٹھ گئے، جب لوگ زیادہ ہو گئے تو رسول اللہ صلی اللہ علیہ وسلم گھٹنوں کے بل ہو گئے، ایک اعرابی نے کہا : ’’یہ کیا بیٹھنے کا طریقہ ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے مجھے کریم بندہ بنایا ہے، بدبخت و سرکش نہیں بنایا۔‘‘ پھر فرمایا : ’’اس کے اردگرد سے کھاؤ، درمیان کو چھوڑے رکھو کہ اس میں برکت ہو۔‘‘ ظاہر ہے جس برتن کو چار آدمی اٹھائیں، اس میں سو دو سو آدمیوں کا کھانا تو ضرور ہو گا اور جو برتن حوض جیسا کھلا ہو، اس میں سے کھانے والوں کا اندازہ آپ خود لگا لیں۔ سلیمان علیہ السلام کے لیے جنّوں کے ان کاموں کے بیان کا مقصد ان کی سلطنت کی وسعت، جہاد کے لیے ان کی افواج کی کثرت، ان کی وسعت قلب، سخاوت اور انسانوں کے علاوہ جنّات پر ان کی ہیبت کا بیان ہے کہ یہ سب کچھ ان پر اللہ تعالیٰ کا خاص انعام تھا۔ ¤ ➍ { اِعْمَلُوْۤا اٰلَ دَاوٗدَ شُكْرًا : ’’ اِعْمَلُوْۤا اٰلَ ‘‘} سے پہلے {’’قُلْنَا‘‘} اور {’’ اٰلَ دَاوٗدَ ‘‘} سے پہلے حرف ندا {’’يَا‘‘} محذوف ہے، جس کی وجہ سے {’’ اٰلَ ‘‘} کا لفظ منصوب ہے۔ {’’ شُكْرًا ‘‘} مفعول لہ ہے۔ آل داؤد میں ان کے گھر والوں کے ساتھ وہ خود بھی شامل ہیں، یعنی ہم نے کہا، اے داؤد کے گھر والو! شکر ادا کرنے کے لیے عمل کرو۔ معلوم ہوا آدمی پر اللہ تعالیٰ کے انعام جتنے زیادہ ہوں، اسے اتنی ہی زیادہ اعمالِ صالحہ کی کوشش کرنی چاہیے۔ مغیرہ بن شعبہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم یقینا نماز کے لیے اتنا قیام کرتے کہ آپ کے دونوں پاؤں، یا (یہ کہا کہ) آپ کی دونوں پنڈلیوں پر ورم آ جاتا، جب آپ صلی اللہ علیہ وسلم سے (اس بارے میں) کہا جاتا تو فرماتے : [ أَفَلَا أَكُوْنُ عَبْدًا شَكُوْرًا؟ ] ’’تو کیا میں پورا شکر گزار بندہ نہ بنوں؟‘‘ [ بخاري، التہجد، باب قیام النبي صلی اللہ علیہ وسلم اللیل : ۱۱۳۰ ] داؤد علیہ السلام کی نماز، ان کے روزوں اور جہاد کا تذکرہ اس سورت کی آیت (۱۰) میں گزر چکا ہے۔ ¤ ➎ { وَ قَلِيْلٌ مِّنْ عِبَادِيَ الشَّكُوْرُ : ’’ الشَّكُوْرُ ‘‘} مبالغے کا صیغہ ہے، اس لیے ترجمہ ’’پورے شکر گزار‘‘ کیا ہے۔ اس میں ترغیب ہے کہ تم بھی میرے ان قلیل بندوں میں شامل ہونے کی کوشش کرو جو پورے شکر گزار ہیں۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { فَلَمَّا قَضَيْنَا عَلَيْهِ الْمَوْتَ … : ’’ دَآبَّةُ الْاَرْضِ ‘‘} دیمک۔ {’’ تَبَيَّنَتِ الْجِنُّ ‘‘ ’’تَبَيَّنَ يَتَبَيَّنُ‘‘} (تفعّل) کا معنی واضح طور پر جان لینا بھی ہے اور کسی چیز کا واضح ہو جانا اور کھل کر سامنے آجانا بھی ہے، جیسا کہ شاعر نے کہا ہے: ¤ {إِذَا اشْتَبَكَتْ دُمُوْعٌ فِيْ خُدُوْدٍ ¤ تَبَيَّنَ مَنْ بَكٰي مِمَّنْ تَبَاكٰي} ¤ ’’جب رخساروں میں آنسوؤں کی جھڑی لگ گئی تو وہ لوگ صاف ظاہر ہو گئے جو رو رہے تھے، ان لوگوں سے جو رونے کی نمائش کر رہے تھے۔‘‘ ¤ ➋ اللہ تعالیٰ نے سلیمان علیہ السلام کو عطا کردہ عظیم سلطنت، علمی کمالات اور ہوا اور جنّوں کی تسخیر وغیرہ کے بیان کے بعد ان کی موت کا تذکرہ فرمایا ہے، یہ بتانے کے لیے کہ موت سے کوئی نہیں بچ سکتا، اگر اس سے کوئی بچتا تو سلیمان علیہ السلام ضرور بچ جاتے، جن کے پاس اتنی عظیم قوتیں تھیں۔ ¤ ➌ سلیمان علیہ السلام کے زمانے میں بہت سے لوگ سمجھتے تھے کہ جنّات غیب جانتے ہیں، جیسا کہ آج کل بھی اکثر لوگوں کا یہی حال ہے۔ اللہ تعالیٰ نے جنّوں کے علم غیب کی حقیقت واضح کرنے کے لیے ایک عجیب طریقہ اختیار فرمایا، وہ یہ کہ سلیمان علیہ السلام کی وفات اس حال میں ہوئی کہ وہ اپنی لاٹھی پر ٹیک لگا کر کھڑے تھے۔ جنّات ان کاموں میں مصروف تھے جن کا حکم انھیں سلیمان علیہ السلام نے دے رکھا تھا، انھیں معلوم نہیں ہو سکا کہ سلیمان علیہ السلام فوت ہو چکے ہیں اور وہ بدستور کام میں جتے رہے۔ دیمک ان کی لاٹھی کو اندر سے کھاتی رہی، جب لاٹھی اندر سے کھوکھلی ہو گئی اور سلیمان علیہ السلام کا بوجھ برداشت نہ کر سکی تو وہ گر پڑے۔ تب جا کر لوگوں اور جنّوں کو ان کی وفات کا پتا چلا۔ اس واقعہ سے تمام لوگوں کے سامنے جنّوں کی حقیقت کھل گئی کہ اگر وہ غیب جانتے ہوتے تو ذلیل کرنے والے عذاب میں مبتلا نہ رہتے۔ ¤ ➍ اس آیت سے صاف ظاہر ہے کہ سلیمان علیہ السلام کے تابع جنّوں اور شیاطین سے سرکش انسانی قبائل مراد نہیں، کیونکہ ان کے متعلق کوئی بھی علم غیب کا قائل نہیں، نہ خود انھیں اس کا دعویٰ ہو سکتا ہے، بلکہ یہ حقیقی جنّ و شیاطین تھے۔ ¤ ➎ اکثر تفاسیر میں لکھا ہے کہ سلیمان علیہ السلام وفات کے بعد لاٹھی کے سہارے ایک سال تک کھڑے رہے۔ بعض حضرات نے یہ بیان کیا ہے کہ سلیمان علیہ السلام نے جنّوں کو حکم دے کر شیشے کا ایک مکان بنوایا اور اس میں لاٹھی کے سہارے کھڑے ہو گئے۔ اسی حالت میں ان کی وفات ہو گئی۔ جنّات ان کو ایک سال تک لاٹھی کے سہارے کھڑے دیکھتے رہے اور انھیں زندہ سمجھ کر ان کی ہیبت کی وجہ سے ان کی بتائی ہوئی تعمیرات اور دوسرے کام کرتے رہے۔ مگر ایک سال تک اس طرح کھڑے رہنے پر سوال پیدا ہوتا ہے کہ سلیمان علیہ السلام نے پورا سال نہ کچھ کھایا، نہ پیا، نہ لباس بدلا، نہ نماز پڑھی یا جماعت کروائی، نہ کسی خدمت گار کے دل میں کوئی فکر پیدا ہوئی، جو ہر روز ان کے لیے ان کاموں کا اہتمام کرتے تھے، نہ امور سلطنت کے متعلق کسی نے ان سے پوچھنے کی ضرورت محسوس کی۔ آیا یہ ممکن بھی ہے؟ میں نے بہت سی تفسیروں کا مطالعہ کیا، مگر انھوں نے اس سوال کی طرف توجہ نہیں فرمائی۔ بعض مفسرین نے اسے استعارہ قرار دیا ہے اور کہا ہے کہ لاٹھی کو دیمک کے کھانے کا مطلب ان کی سلطنت کا اندرونی طور پر آہستہ آہستہ کمزور ہونا ہے وغیرہ، مگر آیت کے الفاظ اس کا ساتھ نہیں دیتے۔ ¤ علامہ مراغی نے اس کا اچھا حل بیان کیا ہے، وہ فرماتے ہیں : {’’ وَالْكِتَابُ الْكَرِيْمُ لَمْ يُحَدِّدِ الْمُدَّةَ الَّتِيْ قَضَاهَا سُلَيْمَانُ وَهُوَ مُتَووَكِّئٌ عَلٰي عَصَاهُ حَتّٰي عَلِمَ الْجِنُّ بِمَوْتِهِ، وَقَدْ رَوَي الْقَصَّاصُوْنَ أَنَّهَا كَانَتْ سَنَةً، وَ مِثْلُ هٰذَا لَا يَنْبَغِي الرُّكُوْنُ إِلَيْهِ، فَلَيْسَ مِنَ الْجَائِزِ أَنَّ خَدَمَ سُلَيْمَانَ لَا يَتَنَبَّهُوْنَ إِلَي الْقِيَامِ بِوَاجِبَاتِهِ الْمَعِيْشِيَّةِ مِنْ مَأْكَلٍ وَ مَشْرَبٍ وَ مَلْبَسٍ وَ نَحْوِهَا يَوْمًا كَامِلًا دُوْنَ أَنْ يُّحَادِثُوْهُ فِيْ ذٰلِكَ وَ يَطَّلِبُوْا إِلَيْهِ الْقِيَامَ بِخِدْمَتِهِ، فَالْمَعْقُوْلُ أَنَّ الْأَرْضَةَ بَدَأَتِ الْعَصَا وَ سُلَيْمَانُ لَمْ يَتَنَبَّهْ لِذٰلِكَ، وَ بَيْنَمَا هُوَ مُتَوَكِّئٌ عَلَيْهَا حَانَتْ مَنِيَّتُهُ، وَكَانَتِ الْأَرَضَةُ قَدْ فَعَلَتْ فِعْلَهَا فِي الْعَصَا فَانْكَسَرَتْ فَخَرَّ عَلَي الْأَرْضِ فَعَلِمَتِ الْجِنُّ كِذْبَهَا، إِذْ كَانَتْ تَدَّعِيْ أَنَّهَا تَعْلَمُ الْغَيْبَ، إِذْ لَوْ عَلِمَتْهُ مَا لَبِثَتْ تُرْهِقُ نَفْسَهَا فِيْ شَاقِّ الْأَعْمَالِ الَّتِيْ كُلِّفَتْ بِهَا ‘‘} ’’قرآن کریم نے اس مدت کی تعیین نہیں فرمائی جو سلیمان علیہ السلام نے جنوّں کو ان کی موت کا علم ہونے تک لاٹھی پر ٹیک لگانے کی حالت میں گزاری۔ قصہ گو حضرات نے بیان کیا ہے کہ وہ ایک سال تھی مگر ایسی بات قابل توجہ نہیں ہے، کیونکہ یہ نہیں ہو سکتا کہ سلیمان علیہ السلام کی خدمت کرنے والوں کا پورا ایک دن ان کی معاشی ضروریات یعنی کھانے پینے اور لباس وغیرہ کی طرف خیال ہی نہ جائے، نہ وہ ان سے اس کے بارے میں بات کریں، نہ ان کی خدمت سرانجام دینے کا تقاضا کریں (سال تو بہت دور کی بات ہے)۔ اس لیے معقول بات یہ ہے کہ دیمک پہلے ہی لاٹھی میں لگ چکی تھی، سلیمان علیہ السلام کو اس کی خبر نہیں ہوئی۔ وہ اس پر ٹیک لگائے ہوئے تھے کہ ان کی موت کا وقت آ گیا، جب کہ دیمک لاٹھی کے اندر اپنا کام کر چکی تھی۔ چنانچہ وہ ٹوٹ گئی اور سلیمان علیہ السلام زمین پر گر گئے تو جنوّں کو اپنا جھوٹ معلوم ہو گیا، کیونکہ ان کا دعویٰ تھا کہ وہ غیب جانتے ہیں، اس لیے کہ اگر وہ اسے جانتے ہوتے تو ان مشقت والے کاموں میں اپنی جان نہ مارتے رہتے جن کی انھیں تکلیف دی گئی تھی۔ ‘‘ ¤ مراغی کی رائے اس لیے بھی مضبوط ہے کہ ایک سال کی مدت کی کوئی روایت رسول اللہ صلی اللہ علیہ وسلم سے ثابت نہیں، محض اسرائیلی روایات ہیں، جن کا یہ درجہ بھی نہیں کہ انھیں {’’لَا نُصَدِّقُ وَلَا نُكَذِّبُ‘‘} کہا جا سکے، بلکہ سب صریح عقل کے خلاف ہونے کی وجہ سے مردود ہیں۔ ابن کثیر رحمہ اللہ نے ایک سال مدت بیان کرنے کے باوجود ان روایات کو اسرائیلیات قرار دیا ہے اور مرفوع روایت کو غریب اور {’’فِيْ صِحَّتِهِ نَظْرٌ‘‘} فرمایا ہے اور فی الواقع وہ روایت غیر ثابت ہے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { لَقَدْ كَانَ لِسَبَاٍ فِيْ مَسْكَنِهِمْ اٰيَةٌ:} اللہ تعالیٰ نے داؤد اور سلیمان علیھما السلام کے ذکر کے بعد، جو انابت و رجوع والے شکر گزار بندے تھے، قومِ سبا کا ذکر فرمایا، جنھیں اللہ تعالیٰ نے ہر طرح کی نعمتیں دیں، مگر انھوں نے ان نعمتوں کی ناشکری کی، انابت کے بجائے اعراض اور سرکشی اختیار کی، اپنے رسولوں کو اور آخرت کو جھٹلا دیا، جس کے نتیجے میں ان پر عذاب آیا اور ساری خوش حالی ختم ہو گئی۔ اس میں قریش کے لیے بھی نصیحت تھی، جنھیں بیت اللہ کی وجہ سے ہر طرح کی نعمت و راحت میسر تھی، انھوں نے اللہ تعالیٰ کے رسول کو جھٹلایا تو قومِ سبا کی طرح ان کی وہ خوش حالی اور امن و سکون ختم ہو گیا، جیسا کہ فرمایا : « وَ ضَرَبَ اللّٰهُ مَثَلًا قَرْيَةً كَانَتْ اٰمِنَةً مُّطْمَىِٕنَّةً يَّاْتِيْهَا رِزْقُهَا رَغَدًا مِّنْ كُلِّ مَكَانٍ فَكَفَرَتْ بِاَنْعُمِ اللّٰهِ فَاَذَاقَهَا اللّٰهُ لِبَاسَ الْجُوْعِ وَ الْخَوْفِ بِمَا كَانُوْا يَصْنَعُوْنَ (116) وَ لَقَدْ جَآءَهُمْ رَسُوْلٌ مِّنْهُمْ فَكَذَّبُوْهُ فَاَخَذَهُمُ الْعَذَابُ وَ هُمْ ظٰلِمُوْنَ » [ النحل : ۱۱۲، ۱۱۳ ] ’’اور اللہ نے ایک بستی کی مثال بیان کی جو امن والی ، اطمینان والی تھی، اس کے پاس اس کا رزق کھلا ہر جگہ سے آتا تھا، تو اس نے اللہ کی نعمتوں کی ناشکری کی تو اللہ نے اسے بھوک اور خوف کا لباس پہنا دیا، اس کے بدلے جو وہ کیا کرتے تھے۔ اور بلاشبہ یقینا ان کے پاس انھی میں سے ایک رسول آیا تو انھوں نے اسے جھٹلا دیا، تو انھیں عذاب نے اس حال میں پکڑ لیا کہ وہ ظالم تھے۔‘‘ سلیمان علیہ السلام کے ذکر کے ساتھ سبا کے ذکر کا ایک اور تعلق بھی ہے جو سورۂ نمل میں مذکور سلیمان علیہ السلام اور ملکہ سبا کے قصے سے ظاہر ہے۔ ¤ ➋ سبا سے مراد قوم ہے جس کا باپ سبا نامی شخص تھا۔ (دیکھیے سورۂ نمل : ۲۲) پھر ملک کا نام بھی یہی پڑ گیا۔ ¤ ➌ { فِيْ مَسْكَنِهِمْ:} یہ علاقہ آج کل یمن کے نام سے معروف ہے۔ ¤ ➍ { اٰيَةٌ :} یعنی ان کے لیے ان کے ملک میں بہت بڑی نشانی تھی، جس سے اللہ تعالیٰ کی وحدانیت، اس کی قدرت اور کاری گری کا اظہار ہوتا تھا اور جسے دیکھ کر معلوم ہوتا تھا کہ ایسے مالک کا شکر اور اس کی اطاعت واجب ہے اور اس کی ناشکری اور نافرمانی سے پرہیز لازم ہے۔ ¤ ➎ { جَنَّتٰنِ عَنْ يَّمِيْنٍ وَّ شِمَالٍ :} یہ اس نشانی کی تفصیل ہے۔ سبا کی عمارتوں کا ذکر کرتے ہوئے ’’ارض القرآن‘‘ کے مصنف نے لکھا ہے : ’’اسی سلسلۂ عمارت میں ایک چیز ’’بند مآرب‘‘ ہے، جس کو عرب حجاز ’’سد‘‘ اور عرب یمن ’’عرم‘‘ کہتے ہیں۔ عرب کے ملک میں کوئی دائمی دریا نہیں، پانی پہاڑوں سے بہ کر ریگستانوں میں خشک اور ضائع ہو جاتا ہے، زراعت کے مصرف میں نہیں آتا۔ ’’سبا‘‘ مختلف مناسب موقعوں پر پہاڑوں اور وادیوں کے بیچ میں بڑے بڑے بند باندھ دیتے تھے کہ پانی رک جائے اور بقدر ضرورت زراعت کے کام میں آئے۔ مملکت سبا میں اس طرح کے سیکڑوں بند تھے، ان میں سب سے زیادہ مشہور ’’سد مآرب‘‘ ہے، جو ان کے دار الحکومت ’’مارب‘‘ میں واقع تھا۔ شہر مارب کے جنوب میں دائیں بائیں دو پہاڑ ہیں، سبا نے ان دو پہاڑوں کے بیچ میں تقریباً ۸۰۰ ق م میں ’’سد مارب‘‘ کی تعمیر کی تھی۔ یہ بند تقریباً ایک سو پچاس فٹ لمبی اور پچاس فٹ چوڑی ایک دیوار ہے۔ اس کا اکثر حصہ تو اب افتادہ ہے، تاہم ایک ثلث دیوار اب بھی باقی ہے۔ ’’ارناڈ‘‘ ایک یورپی سیاح نے اس کے موجودہ حالات پر ایک مضمون فرنچ ایشیا ٹک سوسائٹی کے جرنل (رسالے) میں لکھا ہے، اس کا موجودہ نقشہ نہایت عمدگی سے تیار کیا ہے، اس دیوار پر جا بجا کتبات ہیں، وہ بھی پڑھے گئے۔ اس سد میں اوپر نیچے بہت سی کھڑکیاں تھیں جو حسب ضرورت کھولی اور بند کی جا سکتی تھیں۔ ’’سد‘‘ کے دائیں بائیں، مشرق و مغرب میں دو بڑے بڑے دروازے تھے، جن سے پانی تقسیم ہو کر چپ و راست کی زمینوں کو سیراب کرتا تھا۔ اس نظام آب رسانی سے چپ و راست دونوں جانب اس ریگستانی اور شور ملک کے اندر سیکڑوں کوس تک بہشت زار تیار ہو گئی تھی، جس میں انواع و اقسام کے میوے اور خوشبودار درخت تھے۔ قرآن کریم {’’ جَنَّتٰنِ عَنْ يَّمِيْنٍ وَّ شِمَالٍ ‘‘} کہہ کر انھی باغوں کی طرف اشارہ کرتا ہے۔‘‘ (ارض القرآن) دائیں اور بائیں دو باغوں کا ایک مطلب یہ بھی ہے کہ ہر گھر اور ہر گلی کے دائیں بائیں، یعنی ہر طرف باغ ہی باغ تھے۔ ¤ ➏ { كُلُوْا مِنْ رِّزْقِ رَبِّكُمْ وَ اشْكُرُوْا لَهٗ:} یعنی ہم نے اپنے رسولوں اور صالح بندوں کی زبانی ان سے یہ بات کہی، یا اللہ تعالیٰ کی بے شمار نعمتوں اور دائیں بائیں کے ان باغات اور کھیتوں کا ان سے تقاضا یہ تھا۔ ¤ ➐ { بَلْدَةٌ طَيِّبَةٌ :} ’’طیب‘‘ ہر چیز میں سے اعلیٰ کو کہتے ہیں۔ {’’ بَلْدَةٌ طَيِّبَةٌ ‘‘} سے مراد زرخیز اور عمدہ آب و ہوا والی زمین ہے، اس کے مقابلے میں بنجر، شور اور خراب آب و ہوا والی زمین کے لیے ’’خبیث‘‘ کا لفظ استعمال ہوتا ہے، جیسا کہ فرمایا : «وَ الْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهٗ بِاِذْنِ رَبِّهٖ وَ الَّذِيْ خَبُثَ لَا يَخْرُجُ اِلَّا نَكِدًا » [ الأعراف : ۵۸ ] ’’اور جو شہر پاکیزہ ہے اس کی کھیتی اس کے رب کے حکم سے نکلتی ہے اور جو خراب ہے (اس کی کھیتی) ناقص کے سوا نہیں نکلتی۔‘‘ ¤ ➑ { وَ رَبٌّ غَفُوْرٌ :} یعنی اگر توحید پر قائم رہو گے، انبیاء کی اطاعت کرو گے اور انابت و رجوع کو اپنا شیوہ بناؤ گے تو اس خوش حالی کے ساتھ اپنے رب کو بھی اپنے لیے مہربان پاؤ گے، جو تمھاری کوتاہیوں پر پردہ ڈالے گا، اس طرح دنیا و آخرت دونوں تمھاری ہوں گی۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { فَاَعْرَضُوْا :} یعنی انھوں نے انابت و رجوع کے بجائے اعراض اور سرکشی کو اور بندگی اور شکرگزاری کے بجائے کفر اور ناشکری کو اختیار کیا اور پیغمبروں اور نیکی کا حکم کرنے والوں کی نصیحتوں سے منہ موڑ لیا۔ ¤ ➋ {فَاَرْسَلْنَا عَلَيْهِمْ سَيْلَ الْعَرِمِ : ’’ الْعَرِمِ ‘‘ ’’عَرِمَةٌ‘‘} کی جمع ہے، تہ بہ تہ پتھر، مراد پتھروں کا بنا ہوا بند ہے۔ یعنی ان کی سرکشی اور اعراض کی پاداش میں اللہ تعالیٰ نے ان پر بند کا سیلاب بھیجا۔ زور دار مسلسل بارشوں سے اتنا پانی جمع ہوا کہ اس کے سامنے بند ٹھہر نہ سکا اور ٹوٹ پھوٹ گیا۔ پانی کی شدت اتنی تھی کہ باقی بند بھی ٹوٹتے چلے گئے اور سارا قابل کاشت علاقہ زیر آب آگیا۔ پانی کے ریلے سے باغ اور کھیت ہی تباہ نہیں ہوئے بلکہ زمین بھی کٹاؤ کا شکار ہو گئی اور اس کی زرخیز تہ اتر گئی۔بند اور نہریں ختم ہونے سے آئندہ کے لیے زمین کی سیرابی کا ذریعہ ختم ہو گیا۔ جہاں کبھی پانی کی فراوانی تھی وہاں لوگ پینے کے پانی کو بھی ترسنے لگے۔ سیلاب میں اکثر لوگ اور ان کے مال مویشی غرق ہو گئے، جو بچے وہ جان بچا کر مختلف ملکوں کی طرف نکل گئے اور ایسے بکھرے کہ ان کا بکھرنا عربی زبان کا ایک محاورہ بن گیا، چنانچہ کہا جانے لگا کہ فلاں قوم ’’سبا‘‘ کی طرح بکھر گئی۔ ¤ ➌ {وَ بَدَّلْنٰهُمْ بِجَنَّتَيْهِمْ جَنَّتَيْنِ … : ’’ ذَوَاتَيْ ‘‘} یہ {’’ذَاتٌ‘‘} کا تثنیہ ہے، والے۔ {’’ اُكُلٍ ‘‘} پھل۔ {’’ خَمْطٍ ‘‘} بکھٹا، گلے میں اٹکنے والا، بدمزہ۔ {’’ اَثْلٍ ‘‘} جھاؤ۔ یعنی میلوں پھیلی ہوئی وادیوں کی دونوں جانب بہترین پھلوں والے باغوں کی جگہ ہم نے ان کے لیے ایسے دو رویہ باغ اگا دیے جن میں یا تو بکھٹے، کسیلے اور بد مزہ پھلوں والے درخت تھے، یا جھاؤ کے درخت یا تھوڑی سی بیریوں کا کچھ حصہ۔ بکھٹے اور بدمزہ پھلوں اور جھاؤ پر مشتمل قطعوں کو باغ نہیں کہا جا سکتا، بطور تہکم اور مذاق صرف لفظی طور پر باغ کے مقابلے میں باغ کا لفظ استعمال فرمایا ہے، البتہ بیری میں لذت ہوتی ہے۔ اس کی قلت بیان کرنے کے لیے دو لفظ استعمال فرمائے، ایک {’’ قَلِيْلٍ ‘‘} اور دوسرا اس میں سے بھی کچھ تھوڑا سا حصہ یعنی {’’ شَيْءٍ مِّنْ سِدْرٍ ‘‘} کا لفظ استعمال فرمایا۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {ذٰلِكَ جَزَيْنٰهُمْ بِمَا كَفَرُوْا … : ’’ الْكَفُوْرَ ‘‘} مبالغے کا صیغہ ہے، بہت کفر کرنے والا، بہت ناشکرا۔ یعنی ہم نے انھیں اس کا بدلا دیا جو انھوں نے ناشکری کی اور ایسی سخت سزا ہم اسی کو دیتے ہیں جو بہت ناشکرا ہو، یعنی کافر و مشرک ہو، کیونکہ بڑی ناشکری اور بڑا ظلم شرک ہی ہے۔ تھوڑی بہت ناشکری والے سے ہمارا معاملہ درگزر کا ہوتا ہے۔ {’’ وَ هَلْ نُجٰزِيْۤ اِلَّا الْكَفُوْرَ ‘‘} کے الفاظ سے معلوم ہو رہا ہے کہ یہاں کچھ الفاظ جو آگے قوسین میں ہیں، محذوف ہیں، یعنی ہم نے انھیں یہ جزا اس کے بدلے میں دی جو انھوں نے ناشکری کی (اور ناشکری میں حد سے بڑھ گئے) اور ہم ایسے بڑے ناشکرے ہی کو یہ سخت بدلا دیا کرتے ہیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ {وَ جَعَلْنَا بَيْنَهُمْ وَ بَيْنَ الْقُرَى الَّتِيْ بٰرَكْنَا فِيْهَا … :} برکت والی بستیوں سے مراد شام کا علاقہ ہے۔ قرآن مجیدمیں اکثر برکت والی زمین شام کی سر زمین کو کہا گیا ہے۔ دیکھیے سورۂ اعراف (۱۳۷)، بنی اسرائیل (۱) اور سورۂ انبیاء (۷۱ اور ۸۱) یعنی یمن سے شام تک سڑک کے کنارے مسلسل بستیاں تھیں، جو پہاڑیوں یا اونچی جگہوں پر بنائی گئی تھیں اور ایک دوسری سے اتنی قریب تھیں کہ ایک بستی سے دوسری بستی نظر آتی تھی اور ایسے اندازے اور تناسب سے آباد تھیں کہ مسافر کو ہر منزل پر کھانا، پانی اور آرام کا موقع ملتا تھا۔ آبادیوں کے قریب ہونے اور نظر آتے رہنے کی وجہ سے نہ مسافروں کا دل گھبراتا تھا، نہ چوروں ڈاکوؤں کا خوف تھا اور نہ زاد راہ ساتھ لینے کی مشقت تھی۔ ¤ ➋ { سِيْرُوْا فِيْهَا لَيَالِيَ وَ اَيَّامًا اٰمِنِيْنَ :} یعنی رات دن کی جس گھڑی میں سفر کرنا چاہو کرو، نہ جان و مال کا کوئی اندیشہ، نہ راستے کے لیے سامان سفر ساتھ لینے کی کوئی ضرورت۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { فَقَالُوْا رَبَّنَا بٰعِدْ بَيْنَ اَسْفَارِنَا … :} اس کی تفسیر تین طرح سے کی گئی ہے، ایک یہ کہ انھیں یہ نعمتیں راس نہ آئیں، وہ امن و عافیت کی قدر کرنا بھول گئے اور کبرو غرور میں آکر کہنے لگے کہ یہ بھی کوئی سفر ہے کہ ہر تھوڑی مسافت کے بعد بستی پائی جاتی ہے۔ مزا تو جب آتا کہ دور دراز علاقوں، چٹیل میدانوں، دشوار گزار جنگلوں اور پُرخطر وادیوں سے گزر ہوتا۔ شاہ عبدالقادر رحمہ اللہ لکھتے ہیں : ’’آرام میں مستی یہ آئی، لگے تکلیف مانگنے کہ جیسے اور ملکوں کی خبر سنتے ہیں کہ سفروں میں پانی نہیں ملتا، آبادی نہیں ملتی، ویسا ہم کو بھی ہو، یہ بڑی ناشکری ہوئی۔‘‘ (موضح) ان کی یہ دعا اسی طرح کی ہے جیسے بنی اسرائیل نے من و سلویٰ اور دوسری سہولتوں کے مقابلے میں دالوں اور سبزیوں وغیرہ کا مطالبہ کیا تھا۔ ¤ دوسری تفسیر ابن عاشور کی ہے، وہ فرماتے ہیں : ’’میرے نزدیک زیادہ ظاہر بات یہ ہے کہ انھوں نے یہ بات اپنے انبیاء اور صالح لوگوں کے جواب میں کہی، جب وہ انھیں شرک سے منع کرتے تھے، کیونکہ وہ انھیں نصیحت کرتے تھے کہ اللہ تعالیٰ نے تم پر اتنی نعمتیں کی ہیں، سفر اتنا آسان بنا دیا اور اس قدر خوش حالی عطا فرمائی ہے، سو تم پر اس کا شکر کرنا اور اس اکیلے کی عبادت کرنا واجب ہے، تو انھوں نے آگے سے یہ بات کہی جو آیت میں مذکور ہے، جیسا کہ کفارِ قریش نے کہا تھا : « اللّٰهُمَّ اِنْ كَانَ هٰذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَاَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَآءِ اَوِ ائْتِنَا بِعَذَابٍ اَلِيْمٍ » [ الأنفال : ۳۲ ] ’’اے اللہ! اگر صرف یہی تیری طرف سے حق ہے تو ہم پر آسمان سے پتھر برسا، یا ہم پر کوئی دردناک عذاب لے آ۔‘‘ دلیل اس کی یہ ہے کہ اس سے پہلے اللہ تعالیٰ نے فرمایا : «فَاَعْرَضُوْا » ’’انھوں نے منہ موڑ لیا‘‘ ظاہر ہے منہ کسی دعوت ہی سے موڑا جاتا ہے۔ اس کی تائید اس سے بھی ہوتی ہے کہ ان کی اس بات کے بعد فرمایا : «وَ ظَلَمُوْۤا اَنْفُسَهُمْ » ’’اور انھوں نے اپنی جانوں پر ظلم کیا‘‘ یعنی انھوں نے نا شکری اور اللہ تعالیٰ کے ساتھ شرک کیا، قرآن میں ظلم کا لفظ اکثر شرک کے لیے آیا ہے، کیونکہ اس سے بڑا ظلم کوئی نہیں۔‘‘ ¤ تیسری تفسیر وہ ہے جس کی طرف تقریباً تمام مفسرین نے اشارہ فرمایا ہے کہ یہ ان کی زبانِ حال کی بات ہے۔ جو شخص بھی اللہ تعالیٰ کی دی ہوئی نعمتوں کی ناشکری کرتا ہے وہ گویا زبانِ حال سے کہتا ہے کہ پروردگارا! میں ان نعمتوں کا مستحق نہیں ہوں۔ اسی طرح جو قوم اللہ کی نعمتوں کی قدر نہیں کرتی اور سرکشی کا رویہ اختیار کرتی ہے، وہ گویا اپنے رب سے دعا کرتی ہے کہ اے پروردگارا! یہ نعمتیں ہم سے واپس لے لے، کیونکہ ہم اس قابل نہیں ہیں۔ ¤ ➋ { وَ ظَلَمُوْۤا اَنْفُسَهُمْ:} یعنی انھوں نے کفر و شرک پر اصرار کیا۔ ¤ ➌ { فَجَعَلْنٰهُمْ اَحَادِيْثَ … :} یعنی ہم نے انھیں اس طرح برباد اور منتشر کیا کہ وہ بکھرنے کے لیے کہاوت اور ضرب المثل بن گئے۔ مختلف قبائل کے سیلاب سے بچ نکلنے والے لوگ اپنا وطن چھوڑ کر عرب کے مختلف علاقوں میں چلے گئے۔ غسانیوں نے اردن اور شام کا رخ کیا، اوس اور خزرج کے قبیلے یثرب میں جا بسے، خزاعہ نے جدہ کے قریب تہامہ کے علاقہ میں سکونت اختیار کی۔ ازد کا قبیلہ عمان میں جا کر آباد ہوا، لخم اور کندہ بھی نکلنے پر مجبور ہوئے، حتیٰ کہ سبا نام کی کوئی قوم دنیا میں موجود نہ رہی، صرف کہاوتوں اور افسانوں میں اس کا ذکر باقی رہ گیا۔ ¤ ➍ {اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ :} قوم سبا پر لازم تھا کہ ان بے حساب نعمتوں کی قدر کرتے اور ان کا شکر ادا کرتے جن کا ان آیات میں ذکر ہوا، پھر جب عذاب آیا تو لازم تھا کہ گناہوں سے توبہ کرتے اور مصیبت پر صبر کرتے۔ ان کے سردار ملک کے نظام کو دوبارہ درست کرنے کی کوشش کرتے، امن بحال کرتے، پہلے کی طرح زرعی ضرورتوں اور سفری سہولتوں کا بندوبست کرتے، مگر وہ صبر کا دامن ہاتھ سے چھوڑ کر مختلف علاقوں میں بکھر گئے اور انھوں نے نہ اللہ کے انعامات کا شکر کیا، نہ مصیبت آنے پر تائب ہوئے اور نہ صبر سے وہاں رہ کر ان کے سرداروں نے ملک کی اصلاح کی کوشش کی، بلکہ جس کا جدھر منہ آیا نکل گیا۔ حقیقت یہ ہے کہ صبر اور شکر لازم و ملزوم ہیں۔ شکر وہی کرتا ہے جو تقدیر میں سے اپنے حصے پر صابر ہو اور صبر وہی کرتا ہے جو اللہ تعالیٰ کی ان نعمتوں کی قدر جانتا اور ان کا شکر ادا کرتا ہو جو اسے حاصل ہیں۔ سبا کے واقعات میں نشانیاں تو ہر شخص کے لیے ہیں، مگر ہر صبّار و شکور کے لیے بہت سی نشانیاں اور عبرتیں اس لیے بتائیں کہ وہی ہیں جو اپنی مصیبتوں پر بہت صبر اور نعمتوں پر بہت شکر کرتے ہیں اور دوسروں پر آنے والی مصیبتوں اور انھیں ملنے والی نعمتوں پر ان کے رویے اور اس کے انجام سے عبرت حاصل کرتے ہیں۔ دوسرے لوگ نہ صبر کرتے ہیں، نہ شکر اور نہ ہی دوسروں کے حال سے انھیں عبرت ہوتی ہے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {وَ لَقَدْ صَدَّقَ عَلَيْهِمْ اِبْلِيْسُ ظَنَّهٗ … :} یعنی ابلیس نے آدم علیہ السلام کو سجدے سے انکار کے بعد جس گمان کا اظہار کیا تھا کہ تو ان کے اکثر کو شکر کرنے والے نہیں پائے گا۔ (دیکھیے اعراف : ۱۷) اس ظالم نے قوم سبا کو گمراہ کر کے ان کے بارے میں اپنے اس گمان کو سچا کر دکھایا، چنانچہ وہ سب اس کے پیچھے لگ گئے، صرف مومنوں کا ایک گروہ اس سے محفوظ رہا۔ اس آیت سے معلوم ہوا کہ سبا میں بھی ہمیشہ کچھ لوگ ایسے موجود رہے جو اللہ واحد کی عبادت پر قائم رہے اور شیطان ان پر اپنا تسلّط قائم نہ کر سکا۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { وَ مَا كَانَ لَهٗ عَلَيْهِمْ مِّنْ سُلْطٰنٍ:} یعنی ابلیس کو یہ طاقت حاصل نہ تھی کہ جو شخص اللہ تعالیٰ کی فرماں برداری کرنا چاہے اسے زبردستی ڈنڈے کے زور سے نافرمانی کی راہ پر کھینچ کر لے جائے۔ اسے صرف یہ اختیار تھا کہ انسان کے دل میں وسوسہ ڈال سکے، اسے سبز باغ دکھا کر دھوکے میں مبتلا کرے اور اس کے سامنے گناہوں کو خوش نما کر کے پیش کرے۔ ¤ ➋ { اِلَّا لِنَعْلَمَ مَنْ يُّؤْمِنُ بِالْاٰخِرَةِ :} یعنی ابلیس کو یہ ا اختیار دینے میں اللہ تعالیٰ کی حکمت یہ تھی کہ معلوم ہو جائے کہ کون آخرت پر ایمان رکھتا ہے اور کون ہے جسے اس میں شک ہے اور سب دیکھ لیں کہ رحمان کی بات ماننے والا کون ہے اور شیطان کی پیروی کرنے والا کون، جنتی کون ہے اور جہنمی کون۔ ¤ ➌ {مِمَّنْ هُوَ مِنْهَا فِيْ شَكٍّ :} معلوم ہوا آخرت میں شک کرنا بھی کفر ہے اور سبا والوں کی ناشکری اور سرکشی کا اصل سبب یہ تھا کہ انھیں آخرت پر یقین نہیں تھا۔ قرآن کریم نے متعدد مقامات پر اس حقیقت کو واضح کیا ہے کہ صحیح عقیدہ ہی انسان کو راہِ راست پر قائم رکھ سکتا ہے اور آخرت پر یقین ہی ایسی چیز ہے جو انسان کو سیدھے راستے پر چلنے کا پابند رکھتی ہے۔ ¤ ➍ { وَ رَبُّكَ عَلٰى كُلِّ شَيْءٍ حَفِيْظٌ :} تیرا رب ہر چیز پر پوری طرح نگران اور نگہبان ہے، کوئی چیز اس کی حفاظت اور نگرانی سے باہر نہیں، نہ ہی شیطان اس سے زبردست ہو کر کسی کو گمراہ کر سکتا ہے، اس نے خود ہی اپنی حکمت کے تحت اسے آزمائش کے لیے اور حجت تمام کرنے کے لیے انسانوں کے دل میں وسوسہ ڈالنے کا اختیار دے رکھا ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ { قُلِ ادْعُوا الَّذِيْنَ زَعَمْتُمْ … :} سورت کی ابتدا اس بات سے ہوئی کہ آسمان و زمین میں جو کچھ ہے اس کا مالک صرف اللہ تعالیٰ ہے اور دنیا اور آخرت میں حمد کا سزا وار بھی وہی ہے۔ اس کے ساتھ ہی ذکر فرمایا کہ کفار آخرت کا انکار کرتے ہیں، جب کہ وہ ضرور آئے گی۔ اس کے بعد آخرت پر ایمان رکھنے والوں اور اس کے منکروں کی اور ان کے اچھے اور برے انجام کی مثال کے طور پر داؤد و سلیمان علیھما السلام کا اور قومِ سبا کا ذکر فرمایا۔ آخرت کے بیان کے بعد یہاں سے پھر اسی توحید کا بیان شروع ہوتا ہے جس سے سورت کا آغاز ہوا تھا۔ ¤ ➋ { لَا يَمْلِكُوْنَ مِثْقَالَ ذَرَّةٍ …:} یعنی اللہ تعالیٰ تو جسے چاہتا ہے داؤد و سلیمان علیھما السلام کی طرح نواز دیتا ہے اور جسے چاہتا ہے قومِ سبا کی طرح برباد کر دیتا ہے، کیونکہ وہ آسمان و زمین کی ہر چیز کا مالک ہے، اب تم اپنے بناوٹی معبودوں کو پکارو، بھلا وہ تمھاری کوئی مدد کر سکتے ہیں؟ نہیں، ہر گز نہیں، کیونکہ مدد وہ تب کریں جب ان کے پاس کوئی چیز ہو، وہ تو آسمان و زمین میں موجود ایک ذرے کے مالک بھی نہیں۔ دیکھیے سورۂ فاطر (۱۳)، مومنون (۸۸، ۸۹)، نحل (۷۳)، یونس (۱۰۶) اور سورۂ جنّ (۲۱، ۲۲)۔ ¤ ➌ {وَ مَا لَهُمْ فِيْهِمَا مِنْ شِرْكٍ :} یہ اس  بات کا رد ہے کہ چلیے پورے مالک نہ سہی، ملکیت و اختیار میں ان کا کچھ حصہ ضرور ہے۔ دیکھیے سورۂ فاطر (۴۰) اور سورۂ احقاف (۴)۔ ¤ ➍ { وَ مَا لَهٗ مِنْهُمْ مِّنْ ظَهِيْرٍ :} نہ ہی ان میں سے کوئی اللہ تعالیٰ کا مددگار ہے جس سے کبھی اللہ تعالیٰ نے مدد لی ہو، یا اب مدد لیتا ہو۔ دیکھیے سورۂ بنی اسرائیل (۱۱۱) اور سورۂ کہف (۵۱)۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ { وَ لَا تَنْفَعُ الشَّفَاعَةُ عِنْدَهٗۤ اِلَّا لِمَنْ اَذِنَ لَهٗ:} مشرکین کہتے تھے کہ ہم اپنے معبودوں کو اس لیے پکارتے ہیں کہ وہ اللہ تعالیٰ سے سفارش کر کے ہماری حاجت روائی اور مشکل کُشائی کروا دیتے ہیں۔ (دیکھیے یونس : ۱۸۔ زمر : ۳) یہ اس کا رد ہے کہ اللہ تعالیٰ کے ہاں کسی کی سفارش کام نہیں آتی، ہاں، جسے وہ خود اجازت دے اور جس کے حق میں اجازت دے۔{’’ لِمَنْ اَذِنَ لَهٗ ‘‘} (جس کے لیے وہ اجازت دے) میں یہ دونوں باتیں شامل ہیں۔ ظاہر ہے مشرک کو تو شفاعت کرنے کی جرأت ہی نہ ہو گی، اجازت تو دور کی بات ہے اور نہ ہی کسی کو مشرک کے حق میں سفارش کی اجازت ہو گی، کیونکہ اس پر اللہ تعالیٰ نے جنت حرام کر دی ہے۔ (دیکھیے مائدہ : ۷۳) صرف ایمان والوں کے حق میں سفارش ہو گی، مگر اللہ تعالیٰ کی اجازت کے بعد، حتیٰ کہ فرشتے اور رسول بھی اجازت کے بغیر سفارش نہیں کر سکیں گے۔ (دیکھیے نجم : ۲۶) سفارش تو دور کی بات ہے، وہاں اجازت کے بغیر کوئی بول بھی نہیں سکے گا۔ (دیکھیے طٰہٰ : ۱۰۹) حتیٰ کہ سید الانبیاء والرسل صلی اللہ علیہ وسلم بھی سفارش کے لیے جائیں گے تو سجدے میں گر جائیں گے، لمبی مدت تک تسبیح و تحمید کے بعد سر اٹھانے اور سفارش کرنے کی اجازت ملے گی تو سفارش کریں گے، جیسا کہ حدیث شفاعت میں معروف ہے۔ ¤ ➋ {حَتّٰۤى اِذَا فُزِّعَ عَنْ قُلُوْبِهِمْ … : ’’فَزِعَ يَفْزَعُ‘‘} (س) گھبرا جانا۔ {’’فَزَّعَ يُفَزِّعُ‘‘} (تفعیل) گھبراہٹ دور کرنا، خصوصاً جب اس کے ساتھ حرف {’’عَنْ‘‘} ہو۔ یہاں ایک سوال ہے کہ اس سے پہلے جملے {’’ وَ لَا تَنْفَعُ الشَّفَاعَةُ عِنْدَهٗۤ اِلَّا لِمَنْ اَذِنَ لَهٗ ‘‘} کے ساتھ اس جملے کا کیا تعلق ہے؟ جواب اس کا یہ ہے کہ تم جن ہستیوں کو اپنا سفارشی سمجھتے ہو اور کہتے ہو کہ وہ اپنے زور یا دبدبے یا اللہ کا محبوب ہونے کی وجہ سے اپنی بات منوا لیتے ہیں، ان کی کیا بساط ہے کہ اجازت کے بغیر سفارش کی جرأت کر سکیں۔ وہاں تو اللہ تعالیٰ کی عظمت اور اس کے جلال کے سامنے عرشِ معلی کے فرشتے اور ان کے نیچے آسمان دنیا تک کے فرشتے، جو برابر احکامِ الٰہی سنتے ہیں، ان کا یہ حال ہے کہ جب رب العزت کوئی وحی فرماتا ہے تو وہ سب اس کی ہیبت سے تھر تھرا اٹھتے ہیں، پھر جب اللہ تعالیٰ اس ہیبت کو ان کے دلوں سے ہٹا لیتا ہے تو ہر گروہ اپنے سے اوپر والے سے پوچھتا ہے کہ رب تعالیٰ نے کیا فرمایا ہے؟ {’’ قَالُوا الْحَقَّ ‘‘} وہ کہتے ہیں، اس نے حق فرمایا ہے۔ {’’ وَ هُوَ الْعَلِيُّ الْكَبِيْرُ ‘‘} اور وہی سب سے بلند اور بہت بڑا ہے۔ چنانچہ وہ فرشتے اپنے نیچے والے فرشتوں کو حق تعالیٰ کی وحی کسی کمی بیشی کے بغیر پہنچاتے ہیں۔ پھر جب مقربین ملائکہ کی یہ حالت ہے، جو وحی کے عادی بنا دیے گئے ہیں، تو مشرکین کسی اور سے کیا توقع رکھتے ہیں؟ بخاری نے اس آیت کی تفسیر میں ابوہریرہ رضی اللہ عنہ سے یہ حدیث روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا قَضَی اللّٰهُ الْأَمْرَ فِي السَّمَاءِ ضَرَبَتِ الْمالْمَلاَئِكَةُ بِأَجْنِحَتِهَا خُضْعَانًا لِقَوْلِهِ كَالسِّلْسِلَةِ عَلٰی صَفْوَانٍ، قَالَ عَلِيٌّ وَ قَالَ غَيْرُهُ صَفْوَانٍ يَنْفُذُهُمْ ذٰلِكَ، فَإِذَا فُزِّعَ عَنْ قُلُوْبِهِمْ قَالُوْا مَاذَا قَالَ رَبُّكُمْ؟ قَالُوْا لِلَّذِيْ قَالَ الْحَقَّ وَهُوَ الْعَلِيُّ الْكَبِيْرُ، فَيَسْمَعُهَا مُسْتَرِقُو السَّمْعِ، وَ مُسْتَرِقُو السَّمْعِ هٰكَذَا، وَاحِدٌ فَوْقَ آخَرَ وَ وَصَفَ سُفْيَانُ بِيَدِهِ، وَ فَرَّجَ بَيْنَ أَصَابِعِ يَدِهِ الْيُمْنٰي، نَصَبَهَا بَعْضَهَا فَوْقَ بَعْضٍ فَرُبَّمَا أَدْرَكَ الشِّهَابُ الْمُسْتَمِعَ، قَبْلَ أَنْ يَرْمِيَ بِهَا إِلٰی صَاحِبِهِ، فَيُحْرِقُهُ وَ رُبَّمَا لَمْ يُدْرِكْهُ حَتّٰی يَرْمِيَ بِهَا إِلَی الَّذِيْ يَلِيْهِ إِلَی الَّذِيْ هُوَ أَسْفَلُ مِنْهُ حَتّٰی يُلْقُوْهَا إِلَی الْأَرْضِ، وَ رُبَّمَا قَالَ سُفْيَانُ حَتّٰہ تَنْتَهِيَ إِلَی الْأَرْضِ فَتُللْقٰی عَلٰی فَمِ السَّاحِرِ، فَيَكْذِبُ مَعَهَا مِائَةَ كَذْبَةٍ فَيُصَدَّقُ، فَيَقُوْلُوْنَ أَلَمْ يُخْبِرْنَا يَوْمَ كَذَا وَكَذَا يَكُوْنُ كَذَا وَكَذَا؟ فَوَجَدْنَاهُ حَقًّا، لِلْكَللِمَةِ الَّتِيْ سُمِعَتْ مِنَ السَّمَاءِ] [ بخاري، التفسیر، باب قولہ : «إلا من استرق السمع…» : ۴۷۰۱ ] ’’جب اللہ تعالیٰ آسمان میں کسی کام کا فیصلہ کرتا ہے تو فرشتے اس کے فرمان کے سامنے عاجزی اختیار کرتے ہوئے اپنے پر پھڑ پھڑاتے ہیں۔ (انھیں اللہ کا فرمان اس طرح سنائی دیتا ہے) جیسے وہ صاف چکنے پتھر پر زنجیر کی آواز ہو، تو جب ان کے دلوں سے گھبراہٹ دور کی جاتی ہے تو وہ (آپس میں) پوچھتے ہیں : ’’تمھارے رب نے کیا فرمایا؟‘‘ وہ کہتے ہیں : ’’اس نے حق فرمایا اور وہی سب سے بلند، بہت بڑا ہے۔‘‘ اس گفتگو کو چوری سننے والے شیاطین بھی سن لیتے ہیں، جو اس طرح ایک دوسرے کے اوپر ہوتے ہیں۔‘‘ حدیث کے راوی سفیان نے اس کیفیت کو بیان کرنے کے لیے اپنے ہاتھ کو کنارے کے رخ کیا اور انگلیوں کو کھول دیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو وہ شیطان وہ بات سن لیتا ہے اور اپنے سے نیچے والے شیطان کو بتا دیتا ہے (یہ سلسلہ نیچے تک چلتا ہے)، یہاں تک کہ سب سے نیچے والا وہ بات کسی جادوگر یا کاہن کو پہنچا دیتا ہے، پھر کبھی اس سے پہلے کہ وہ نیچے والے کو بات پہنچائے اسے آگ کا انگارا آ دبوچتا ہے اور اسے جلا دیتا ہے اور کبھی اس کے لگنے سے پہلے وہ اس بات کو آگے پہنچا دیتا ہے، تو وہ (جادوگر یا کاہن) اس کے ساتھ سو جھوٹ ملا دیتا ہے، تو (جب آسمان سے سنی ہوئی بات صحیح ہو جاتی ہے تو اس کے ماننے والوں کی طرف سے) کہا جاتا ہے کہ کیا فلاں فلاں دن اس (جادو گر یا کاہن) نے ہمیں اس طرح نہیں کہا تھا؟ تو اس ایک بات کی وجہ سے جو شیطان نے آسمان سے سنی تھی کاہن یا ساحر کی بات کو سچا سمجھ لیا جاتا ہے۔‘‘"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { قُلْ مَنْ يَّرْزُقُكُمْ مِّنَ السَّمٰوٰتِ وَ الْاَرْضِ قُلِ اللّٰهُ :} پچھلی آیت میں بیان کرنے کے بعد کہ مشرکین کے بنائے ہوئے شرکاء کائنات میں ایک ذرے کے مالک نہیں، بلکہ سب کا مالک ایک اللہ تعالیٰ ہے، اب نبی صلی اللہ علیہ وسلم کو حکم دیا کہ ان سے اس بات کا اقرار کروائیں کہ کائنات میں ہر ایک کو رزق بھی وہ اکیلا ہی دے رہا ہے۔ چنانچہ فرمایا، ان سے کہو آسمان سے بارش برسا کر، سورج، چاند اور ستاروں سے گرمی، توانائی اور روشنی بہم پہنچا کر اور تمھارے فائدے کے لیے ہر چیز مسخر کر کے زمین سے تمھارے لیے اور تمھارے چوپاؤں کے لیے خوراک اور زندگی کی ہر ضرورت کون مہیا کرتا ہے؟ یہ سب دل سے مانتے ہیں کہ وہ اللہ ہی ہے، اس لیے اس کا انکار نہیں کر سکتے کہ وہ اللہ تعالیٰ ہے، مگر ان کے لیے اقرار بھی مشکل ہے، کیونکہ اس سے ان کے شرک کی عمارت ڈھے جاتی ہے، کیونکہ وہ اس کا جواز پیش نہیں کر سکتے کہ رزق تو اللہ دے اور عبادت کسی اور کی ہو، اس لیے لامحالہ وہ خاموشی اختیار کریں گے۔ تو اس موقع پر آپ خود اعلان کریں کہ وہ تو صرف اللہ تعالیٰ ہے۔ ¤ ➋ { وَ اِنَّاۤ اَوْ اِيَّاكُمْ لَعَلٰى هُدًى … :} یعنی ہم دو فریق بن چکے ہیں، ایک وہ جو آسمان و زمین میں ایک اللہ ہی کو رزاق مانتے ہیں اور اسی کی عبادت کرتے ہیں۔ دوسرے وہ جو اس کے ساتھ ایسی ہستیوں کو شریک بناتے ہیں جو نہ کائنات کے ایک ذرے کے مالک ہیں، نہ کسی کا نفع و نقصان یا رزق ان کے اختیار میں ہے، اور ہم دونوں میں سے ایک گروہ یا ہدایت پر ہے یا واضح گمراہی میں مبتلا ہے، تم خود فیصلہ کر لو کہ ہدایت پر کون ہے اور گمراہ کون؟ اس کا یہ مطلب نہیں کہ اس بات میں کوئی شک ہے کہ ایک رب کو رزاق مان کر اسی کی عبادت کرنے والے حق پر ہیں اور ان کے مخالف باطل پر، بلکہ نہایت حکیمانہ طریقے سے دونوں چیزیں مخاطب کے سامنے رکھ کر خود اس سے انصاف طلب کیا گیا ہے، کیونکہ اس کے پاس کوئی چارہ نہیں کہ وہ کہے دونوں گمراہ ہیں، نہ یہ کہ دونوں حق پر ہیں۔ لا محالہ اسے ماننا پڑے گا کہ ہدایت پر وہی ہے جو اللہ تعالیٰ کو زمین و آسمان کا خالق و رازق ماننے کے بعد عبادت بھی اسی کی کرتا ہے اور وہ شخص یقینا کھلی گمراہی میں ہو گا جو اللہ تعالیٰ کو خالق و رازق تو مانتا ہے، مگر عبادت دوسروں کی کرتا ہے، لہٰذا آپ اپنے منہ سے کہنے کے بجائے کہ مشرک باطل پر ہے، اسے فیصلے کا موقع دے کر اس مقام پر لے آئیں کہ وہ خود کہے کہ ایک اللہ کی عبادت کرنے والا حق پر ہے اور اس کے ساتھ شریک ٹھہرانے والا باطل پر ہے۔ ¤ ➌ اس آیت سے معلوم ہوا کہ یہ کہنا غلط ہے کہ جو جہاں لگا ہوا ہے ٹھیک ہے، یا اپنی جگہ سب لوگ ہی درست ہیں، بلکہ حق ایک ہے اور جو حق پر نہیں وہ باطل پر ہے۔ باہم متضاد باتیں دونوں حق نہیں ہو سکتیں، مثلاً یہ نہیں ہو سکتا کہ یہ بھی حق ہو کہ ہر نشہ آور چیز حرام ہے اور یہ بھی حق ہو کہ ہر نشہ آور چیز حرام نہیں۔ نہ ایک مسئلے میں چار متضاد مذہب حق ہو سکتے ہیں۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {قُلْ لَّا تُسْـَٔلُوْنَ عَمَّاۤ اَجْرَمْنَا …:} یہ بھی بحث و مناظرہ میں حکمت و شائستگی برتنے کی تعلیم ہے، یعنی باوجود یہ کہ مسلمان حق پر ہیں اور ان کے اعمال نیک ہیں، مگر انھیں چاہیے کہ مخاطب کو یوں کہہ کر غور و فکر کی دعوت دیں کہ اپنے صغیرہ گناہوں کو مدنظر رکھتے ہوئے اپنے لیے جرم کا لفظ استعمال کریں اور ان کے کفرو شرک اور کبیرہ گناہوں کے لیے لفظ ’’عمل‘‘ استعمال کریں کہ تم سے اس کے بارے میں سوال نہیں ہو گا جو ہم نے جرم کیے اور ہم سے اس کے بارے میں نہیں پوچھا جائے گا جو عمل تم کر رہے ہو۔ اپنے لیے ماضی کا لفظ {’’ اَجْرَمْنَا ‘‘} استعمال کرنے کا حکم دیا اور ان کے لیے مضارع کا لفظ {’’ تَعْمَلُوْنَ‘‘} استعمال کرنے کا حکم دیا، یعنی فرض کرو ہم مجرم ہیں تو اس کا خمیازہ ہم بھگتیں گے، تم سے اس کی باز پرس نہیں ہو گی اور تمھارا کوئی عمل گرفت کے قابل ہوا تو اس کی بازپرس تم سے ہو گی، ہم سے نہیں۔ لہٰذا ہم میں سے ہر ایک کو اپنا فائدہ مدنظر رکھنا چاہیے کہ کہیں ہم غلط راستے پر تو نہیں جا رہے۔ ابن کثیر رحمہ اللہ نے فرمایا، اس کا مطلب ان سے براء ت کا اظہار ہے، یعنی نہ تم ہمارے ہو نہ ہم تمھارے، بلکہ ہم تمھیں اللہ تعالیٰ کی طرف، اس کی توحید اور اس اکیلے کی عبادت کی طرف دعوت دیتے ہیں، اگر تم قبول کر لو تو تم ہمارے اور ہم تمھارے ہو گئے اور اگر نہ مانو تو ہم تم سے بری ہیں اور تم ہم سے بری ہو، جیسا کہ اللہ تعالیٰ نے فرمایا: « وَ اِنْ كَذَّبُوْكَ فَقُلْ لِّيْ عَمَلِيْ وَ لَكُمْ عَمَلُكُمْ اَننْتُمْ بَرِيْٓـُٔوْنَ مِمَّاۤ اَعْمَلُ وَ اَنَا بَرِيْٓءٌ مِّمَّا تَعْمَلُوْنَ » [ یونس : ۴۱ ] ’’ اور اگر وہ تجھے جھٹلائیں تو کہہ دے میرے لیے میرا عمل ہے اور تمھارے لیے تمھارا عمل، تم اس سے بری ہو جو میں کرتا ہوں اور میں اس سے بری ہوں جو تم کر رہے ہو۔‘‘ اور فرمایا : « قُلْ يٰۤاَيُّهَا الْكٰفِرُوْنَ (1) لَاۤ اَعْبُدُ مَا تَعْبُدُوْنَ (2) وَ لَاۤ اَنْتُمْ عٰبِدُوْنَ مَاۤ اَعْبُدُ (3) وَ لَاۤ اَنَا عَابِدٌ مَّا عَبَدْتُّمْ (4) وَ لَاۤ اَنْتُمْ عٰبِدُوْنَ مَاۤ اَعْبُدُ (5) لَكُمْ دِيْنُكُمْ وَ لِيَ دِيْنِ » [ الکافرون : ۱ تا ۶ ] ’’کہہ دے اے کافرو! میں اس کی عبادت نہیں کرتا جس کی تم عبادت کرتے ہو ۔ اور نہ تم اس کی عبادت کرنے والے ہو جس کی میں عبادت کرتا ہوں ۔ اور نہ میں اس کی عبادت کرنے والا ہوں جس کی عبادت تم نے کی۔ اور نہ تم اس کی عبادت کرنے والے ہو جس کی عبادت میں کرتا ہوں۔ تمھارے لیے تمھارا دین اور میرے لیے میرا دین ہے۔‘‘"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) {قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا ثُمَّ يَفْتَحُ بَيْنَنَا بِالْحَقِّ … :} عبد الرحمان کیلانی رحمہ اللہ لکھتے ہیں : ’’اور اگر تم لوگ یہ سمجھتے ہو کہ آخرت کا اور جواب دہی کا تصور ہی غلط ہے تو یقین جانو کہ جو اللہ ہم سب کو عدم سے وجود میں لایا ہے، پھر ہم سب کو دوبارہ مرنے کے بعد زندہ کر کے اکٹھا کرنے کی قدرت بھی رکھتا ہے، آج تم اپنے آپ کو درست سمجھتے ہو اور ہم اپنے آپ کو درست سمجھتے ہیں، لیکن اس دن اللہ تعالیٰ ہمارے درمیان اس طرح انصاف کے ساتھ فیصلہ کر دے گا جس کی تمھیں بھی ٹھیک سمجھ آجائے گی اور اس کا فیصلہ اس لحاظ سے درست ہو گا کہ وہ ہم سب کا خالق ہے اور خالق کو اپنی بنائی ہوئی چیز کی جس قدر سمجھ ہو سکتی ہے دوسروں کو نہیں ہو سکتی۔ وہ تو تمھارے اور ہمارے ارادوں اور نیتوں تک سے واقف ہے، لہٰذا اس کے فیصلے پر کسی غلطی یا زیادتی کا امکان نہیں ہو سکتا۔‘‘"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { قُلْ اَرُوْنِيَ الَّذِيْنَ اَلْحَقْتُمْ بِهٖ شُرَكَآءَ :} یعنی اس سے پہلے کہ آخرت میں پہنچ کر ہمارے اور تمھارے درمیان فیصلہ ہو، تم مجھے یہیں بتاؤ کہ تمھارے ان معبودوں میں کون سی ایسی بات ہے جس کی وجہ سے تم انھیں اللہ کا شریک یا اپنا معبود سمجھ رہے ہو اور ان کی حمایت پر بھروسا کر کے اللہ کے عذاب سے بے خوف ہو رہے ہو۔ ¤ ➋ { كَلَّا بَلْ هُوَ اللّٰهُ الْعَزِيْزُ الْحَكِيْمُ :} نہیں، یہ ہرگز اس کے شریک نہیں ہو سکتے، بلکہ عبادت کا حق دار صرف اللہ تعالیٰ ہے، جو سب پر غالب اور کمال حکمت والا ہے، جب کہ یہ بے چارے نہ عزیز ہیں نہ حکیم، ان کے پاس بندگی و بے چارگی کے سوا کچھ ہے ہی نہیں۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ {وَ مَاۤ اَرْسَلْنٰكَ اِلَّا كَآفَّةً لِّلنَّاسِ : ’’ كَآفَّةً ‘‘} بمعنی {’’عَامَّةً‘‘} ہے، یہ {’’اَلنَّاسُ‘‘} سے حال ہے، یعنی ہم نے تجھے نہیں بھیجا، مگر تمام لوگوں کی طرف۔ آخرت اور توحید کے بیان کے بعد نبی کریم صلی اللہ علیہ وسلم کی رسالت کا بیان فرمایا۔ داؤد و سلیمان علیھما السلام کو نبوت کے ساتھ ایسی بادشاہت عطا ہوئی جو ان کا خاصہ تھی اور نبی کریم صلی اللہ علیہ وسلم کو ایسی رسالت عطا ہوئی جو آپ صلی اللہ علیہ وسلم کے سوا کسی نبی کو عطا نہیں ہوئی۔ وہ یہ کہ پہلے تمام انبیاء صرف اپنی قوم کی طرف مبعوث ہوتے تھے اور ان کی دعوت محدود وقت تک کے لوگوں کے لیے ہوتی تھی، جبکہ آپ صلی اللہ علیہ وسلم کو روئے زمین کی تمام اقوام اور سب لوگوں کی طرف مبعوث کیا گیا اور آپ صلی اللہ علیہ وسلم کی دعوت قیامت تک کے لوگوں کے لیے ہے۔ مزید دیکھیے سورۂ اعراف (۱۵۸)، انبیاء (۱۰۷) اور سورۂ فرقان (۱) کی تفسیر۔ ¤ ➋ {’’ كَآفَّةً ‘‘} کا ایک اور معنی بھی کیا گیا ہے کہ {’’كَفَّ يَكُفُّ كَفًّا‘‘} (ن) کا معنی روکنا ہے اور {’’ كَآفَّةً ‘‘} میں تاء تانیث کی نہیں، بلکہ مبالغہ کی ہے، جیسا کہ {’’عَلَّامَةٌ‘‘} اور {’’رَاوِيَةٌ‘‘} میں ہے، بہت روکنے والا، یعنی ہم نے تجھے لوگوں کو (ضلالت سے) بہت روکنے والا ہی بنا کر بھیجا ہے۔ یہ معنی بھی درست ہے۔ ¤ ➌ { بَشِيْرًا وَّ نَذِيْرًا :} یعنی آپ کی دعوت میں بشارت و نذارت دونوں جمع ہیں، اطاعت کرنے والوں کے لیے خوش خبری دینا اور نہ ماننے والوں کو عذابِ الٰہی سے ڈرانا۔ ¤ ➍ {وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ :} یعنی اکثر لوگ آپ کی قدرو منزلت نہیں جانتے، انھیں احساس نہیں کہ کیسی عظیم الشّان ہستی کی بعثت سے انھیں نوازا گیا ہے، اس لیے جہل کی وجہ سے وہ آپ کی مخالفت اور عداوت پر کمر بستہ ہیں۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) { وَ يَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ … :} یعنی جس وقت کے متعلق تم نے ابھی کہا ہے کہ ’’ہم سب کو ہمارا رب جمع کرے گا، پھر ہمارے درمیان حق کے ساتھ فیصلہ کرے گا‘‘ وہ وقت آخر کب آئے گا؟ ان کے پوچھنے کا مطلب یہ نہیں تھا کہ اس وقت کا علم ہونے پر وہ اس کے لیے تیاری کرنا چاہتے تھے، بلکہ یہ کہہ کر وہ قیامت کو جھٹلا رہے تھے اور اس کا مذاق اڑا رہے تھے، کیونکہ آخرت پر ایمان رکھنے والے اس کے جلدی لانے کا مطالبہ نہیں کیا کرتے، بلکہ اس سے خوف زدہ رہتے ہیں۔ دیکھیے سورۂ شوریٰ (۱۸)۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {قُلْ لَّكُمْ مِّيْعَادُ يَوْمٍ لَّا تَسْتَاْخِرُوْنَ عَنْهُ سَاعَةً … :} یعنی تمھارے لیے اس کا ایک وقت مقرر کیا گیا ہے جس سے تم نہ ایک گھڑی پیچھے رہو گے کہ تمھیں توبہ اور رجوع کی مہلت ملے، نہ ایک گھڑی آگے ہو گے کہ مقرر وقت سے پہلے عذاب آ جائے، بلکہ اللہ تعالیٰ نے تمھارے لیے جتنی مہلت طے کر رکھی ہے وہ پوری ہونے کے بعد ہی عذاب آئے گا، خواہ تم کتنی ہی جلدی مچاتے رہو۔ خلاصہ یہ کہ یہ مت پوچھو کہ وہ وقت کب آئے گا، بلکہ اس کے لیے تیاری کرو۔ مزید دیکھیے سورۂ یونس (۴۹)۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { وَ قَالَ الَّذِيْنَ كَفَرُوْا لَنْ نُّؤْمِنَ بِهٰذَا الْقُرْاٰنِ … :} نبی صلی اللہ علیہ وسلم کفارِ مکہ سے توحید، رسالت اور آخرت پر بات کرتے ہوئے کبھی اپنی وحی کی تائید کے طور پر تورات و انجیل کا ذکر فرماتے کہ قرآن کی طرح ان میں بھی توحید اور آخرت کا ذکر ہے، تو کفارِ مکہ کبر و عناد میں آکر کہتے کہ نہ ہم اس قرآن کو مانیں گے، نہ اس سے پہلی کسی کتاب کو۔ قرآن مجید نے ان کی اس بات کے جواب یا اس کی تردید کی ضرورت محسوس نہیں فرمائی، کیونکہ انھوں نے بات ہی ایسی کی جس کا نتیجہ پہلے تمام پیغمبروں کا انکار تھا، جو واضح طور پر غلط تھا اور انھوں نے یہ بات محض ضد میں آکر کہی تھی، ورنہ وہ پہلے پیغمبروں اور ان کی کتابوں کو جانتے تھے۔ دلیل اس کی یہ ہے کہ انھوں نے کبھی نبی صلی اللہ علیہ وسلم سے موسیٰ علیہ السلام جیسے معجزے لانے کا مطالبہ کیا، جیسا کہ سورۂ قصص میں ہے : « لَوْ لَاۤ اُوْتِيَ مِثْلَ مَاۤ اُوْتِيَ مُوْسٰى» [ القصص : ۴۸ ]’’اسے اس جیسی چیزیں کیوں نہ دی گئیں جو موسیٰ کو دی گئیں؟‘‘ کبھی تورات کی طرح لکھی ہوئی کتاب لانے کا مطالبہ کیا، جیسا کہ سورۂ بنی اسرائیل میں ہے : «وَ لَنْ نُّؤْمِنَ لِرُقِيِّكَ حَتّٰى تُنَزِّلَ عَلَيْنَا كِتٰبًا نَّقْرَؤُهٗ » [ بني إسرائیل : ۹۳ ] ’’اور ہم تیرے چڑھنے کا ہرگز یقین نہ کریں گے، یہاں تک کہ تو ہم پر کوئی کتاب اتار لائے جسے ہم پڑھیں۔‘‘ اگر پہلے کسی نبی یا اس کی شریعت یا کتاب کو مانتے ہی نہ تھے تو ان مطالبوں کا کیا مطلب؟ اس لیے اللہ تعالیٰ نے ان کی بات کی تردید کے بجائے قیامت کے دن ان کے ہونے والے برے حال کا ذکر فرمایا، جس قیامت کا وہ شدت سے انکار کرتے اور مذاق اڑاتے تھے۔ ¤ ➋ { وَ لَوْ تَرٰۤى اِذِ الظّٰلِمُوْنَ مَوْقُوْفُوْنَ عِنْدَ رَبِّهِمْ … : ’’رَجَعَ يَرْجِعُ‘‘} (ض) لازم بھی آتا ہے اور متعدی بھی، لوٹنا اور لوٹانا۔ یہاں لوٹانا مراد ہے۔ {’’ الظّٰلِمُوْنَ ‘‘} ظالم سے مراد مشرک ہیں، کیونکہ شرک ظلم عظیم ہے، الف لام کی وجہ سے ’’یہ ظالم‘‘ ترجمہ کیا گیا ہے۔ یعنی ان میں سے ہر ایک اپنی گمراہی کا الزام دوسروں پر دھر رہا ہو گا، جیسا کہ عموماً ناکامی کی صورت میں ہوتا ہے۔ یہ مکالمہ جہنم میں داخلے سے پہلے ہو گا، تاہم جہنم میں داخلے کے بعد بھی ان کا یہ جھگڑا جاری رہے گا۔ دیکھیے سورۂ اعراف (۳۸، ۳۹)، ابراہیم (۲۱)، قصص (۶۳)، احزاب (۶۶ تا ۶۸)، مومن (۴۷، ۴۸)، ص (۵۵ تا ۶۱)، بقرہ (۱۶۵ تا ۱۶۷) اور حمٰ السجدہ (۲۹) ۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) {بَلْ كُنْتُمْ مُّجْرِمِيْنَ :} بلکہ تم خود مجرم تھے جو عقل اور سمجھ رکھنے کے باوجود محض دنیا کے لالچ میں ہمارے پیچھے چلتے رہے اور ہدایت قبول کرنے سے انکار کرتے رہے۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ { بَلْ مَكْرُ الَّيْلِ وَ النَّهَارِ … : ’’أَيْ بَلْ صَدَّنَا عَنِ الْهُدٰي مَكْرُكُمْ فِي اللَّيْلِ وَالنَّهَارِ‘‘} یعنی کمزور لوگ ان بڑوں سے کہیں گے کہ صرف یہی نہیں کہ ہم مجرم تھے اور تمھارا ہمیں ہدایت سے روکنے میں کوئی دخل نہ تھا، بلکہ حقیقت یہ ہے کہ تمھاری دن رات کی تدبیروں اور سازشوں نے ہمیں راہِ راست سے روکے رکھا۔ جب تم ہمیں اللہ کے ساتھ کفر کرنے اور اس کے ساتھ شریک بنانے کا حکم دیا کرتے تھے۔ ¤ ➋ { وَ اَسَرُّوا النَّدَامَةَ لَمَّا رَاَوُا الْعَذَابَ :} یعنی دونوں فریق ایک دوسرے پر الزام تراشی کریں گے، مگر دونوں ہی اپنے اپنے کفر پر نادم ہوں گے، لیکن اپنی پشیمانی اور ندامت کو چھپانے کی کوشش کریں گے۔ ¤ ➌ {وَ جَعَلْنَا الْاَغْلٰلَ فِيْۤ اَعْنَاقِ الَّذِيْنَ كَفَرُوْا :} آپس کی بحث سے دونوں فریقوں کو معلوم ہو جائے گا کہ دونوں ہی مجرم ہیں اور ان کی یہ بحث لاحاصل ہے۔ لہٰذا ہم دونوں کو ایک جیسی سزا دیں گے، ان کے گلوں میں طوق اور پاؤں میں لوہے کی زنجیریں ڈال کر انھیں جہنم میں پھینک دیا جائے گا۔ ¤ ➍ { هَلْ يُجْزَوْنَ اِلَّا مَا كَانُوْا يَعْمَلُوْنَ :} یعنی یہ عذاب ان کے اپنے اعمال ہی کی جزا ہو گی۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) {وَ مَاۤ اَرْسَلْنَا فِيْ قَرْيَةٍ مِّنْ نَّذِيْرٍ …: ’’تَرَفٌ‘‘} خوش حالی۔{ ’’مُتْرَفُوْنَ‘‘} اسم مفعول ہے، وہ لوگ جنھیں خوش حالی عطا کی گئی۔ خوش حالی عطا فرمانے والا اللہ تعالیٰ تھا، جیسا کہ سورۂ مومنون میں فرمایا : « وَ قَالَ الْمَلَاُ مِنْ قَوْمِهِ الَّذِيْنَ كَفَرُوْا وَ كَذَّبُوْا بِلِقَآءِ الْاٰخِرَةِ وَ اَتْرَفْنٰهُمْ فِي الْحَيٰوةِ الدُّنْييَا مَا هٰذَاۤ اِلَّا بَشَرٌ مِّثْلُكُمْ يَاْكُلُ مِمَّا تَاْكُلُوْنَ مِنْهُ وَ يَشْرَبُ مِمَّا تَشْرَبُوْنَ» [ المؤمنون : ۳۳ ] ’’اور اس کی قوم میں سے ان سرداروں نے جنھوں نے کفر کیا اورآخرت کی ملاقات کو جھٹلایا اور ہم نے انھیں دنیا کی زندگی میں خوش حال رکھا تھا، کہا یہ نہیں ہے مگر تمھارے جیسا ایک بشر، جو اس میں سے کھاتا ہے جس میں سے تم کھاتے ہو اور اس میں سے پیتا ہے جو تم پیتے ہو۔‘‘ اس میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ آپ ان کی مخالفت پر مغموم نہ ہوں، آپ سے پہلے ہر نبی کی مخالفت اور اس کا مقابلہ مال و ثروت اور جاہ و حشمت والے لوگوں ہی نے کیا اور شروع میں اس کا ساتھ مستضعفین، یعنی کمزور اور غریب لوگوں ہی نے دیا۔ یہی بات ہرقل نے ابو سفیان اور اس کے ساتھیوں سے اس وقت کہی جب اس کے دریافت کرنے پر ابو سفیان نے بتایا کہ آپ صلی اللہ علیہ وسلم کی پیروی کرنے والے غریب اور معمولی قسم کے لوگ ہیں۔ [ دیکھیے بخاري : ۷ ] قرآن مجید میں یہ بات بہت سے مقامات پر بیان کی گئی ہے کہ انبیاء علیھم السلام کی دعوت کی مخالفت سب سے پہلے اور سب سے زیادہ خوش حال اور متکبّر لوگوں ہی نے کی ہے۔ مثلاً دیکھیے سورۂ انعام (۱۲۳)، اعراف (۶۰، ۶۶، ۷۵، ۸۸، ۹۰)، ہود (۲۷)، بنی اسرائیل (۱۶) اور سورۂ مومنون (۲۴، ۳۳ تا ۳۸، ۴۶، ۴۷)۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) {وَ قَالُوْا نَحْنُ اَكْثَرُ اَمْوَالًا وَّ اَوْلَادًا … :} یعنی انھوں نے ایک تو اپنے اموال و اولاد کی کثرت پر فخر کیا اور انبیاء اور ان کے متبعین کی تحقیر کی، جیسا کہ فرعون نے اپنے آپ کو مصر کا بادشاہ ہونے کی وجہ سے بہتر اور موسیٰ علیہ السلام کو مہین (حقیر) کہا تھا۔ دیکھیے سورۂ زخرف (۵۱ تا ۵۴) {’’ وَ مَا نَحْنُ بِمُعَذَّبِيْنَ ‘‘} دوسرے انھوں نے اپنی خوش حالی کو اللہ تعالیٰ کے راضی ہونے کی دلیل قرار دیتے ہوئے کہا کہ اگر اللہ تعالیٰ ہم پر ناراض ہوتا تو ہمیں تم سے زیادہ مال و اولاد کیوں دیتا، یہ دلیل ہے کہ ہم پر عذاب ہرگز نہیں آئے گا۔ ({بِمُعَذَّبِيْنَ } میں باء نفی کی تاکید کے لیے ہے) بلکہ اگر قیامت قائم ہوئی تو وہاں بھی ہم ہی کو یہ نعمتیں ملیں گی۔ دیکھیے سورۂ مریم (۷۷ تا ۸۰) اور سورۂ مدثر (۱۱)۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {قُلْ اِنَّ رَبِّيْ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَآءُ وَ يَقْدِرُ … :} یعنی دنیا کی آسودگی اور خوش حالی اللہ تعالیٰ کے راضی ہونے کی دلیل نہیں ہے، بلکہ اس کی حکمت و مشیّت یعنی بندوں کی آزمائش ہے۔ وہ بعض اوقات ناراض ہونے کے باوجود آزمائش کے لیے اور حجت تمام کرنے کے لیے کافر و فاسق کا رزق فراخ کر دیتا ہے اور کبھی آزمائش کے لیے اور گناہوں کی مغفرت اور درجات کی بلندی کے لیے مومن کا رزق تنگ کر دیتا ہے اور کبھی اپنی حکمت و مصلحت کی بنا پر کافر کا رزق تنگ اور مومن کا فراخ کر دیتا ہے، تاکہ آزمائش قائم رہے اور دنیا کی خوش حالی دیکھ کر سب لوگ کفر ہی کی طرف مائل نہ ہو جائیں۔ (دیکھیے زخرف : ۳۳ تا ۳۵) لیکن اکثر لوگ یہ بات نہیں جانتے اور مال و اولاد کی کثرت کو اللہ تعالیٰ کے خوش ہونے کی دلیل سمجھ لیتے ہیں۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { وَ مَاۤ اَمْوَالُكُمْ وَ لَاۤ اَوْلَادُكُمْ …:} اس جملے کے دو مطلب ہیں، ایک یہ کہ مال و اولاد ایسی چیزیں نہیں ہیں جو اللہ تعالیٰ کے ہاں تقرب کا ذریعہ بن سکیں، بلکہ یہی چیزیں اکثر انسانوں کے لیے تقرب کے بجائے الٹا اس کے غضب اور غصے کا سبب بن جاتی ہیں اور اسے لے ڈوبتی ہیں۔ اس کے بجائے اللہ تعالیٰ کے ہاں تقرب کا معیار ایمان اور اعمالِ صالحہ ہیں۔ {’’ اِلَّا مَنْ اٰمَنَ وَ عَمِلَ صَالِحًا ‘‘} کا دوسرا مطلب یہ ہے کہ اگر کوئی شخص ایمان لائے اور اعمال صالحہ بھی لائے تو یہی مال اور اولاد اس کے لیے اللہ کے ہاں تقرب کا ذریعہ بن سکتے ہیں۔ وہ یوں کہ اپنے مال و دولت کو اللہ کی راہ میں خرچ کرتا رہے اور اولاد کی صحیح تعلیم و تربیت کر کے اسے اللہ کا فرماں بردار بنا دے۔ (تیسیرالقرآن) ¤ ➋ { فَاُولٰٓىِٕكَ لَهُمْ جَزَآءُ الضِّعْفِ بِمَا عَمِلُوْا : ’’ الضِّعْفِ ‘‘ ’’نِصصْفٌ‘‘} کی ضد ہے، یعنی کسی چیز کی مثل اتنا ہی اور، پھر یہی لفظ کئی گنا کے معنوںمیں استعمال ہوتا ہے، جو دس گنا بھی ہو سکتا ہے، سات سو گنا بھی، بلکہ اس سے زیادہ بھی۔ دیکھیے سورۂ بقرہ (۲۶۱)۔ ¤ ➌{ وَ هُمْ فِي الْغُرُفٰتِ : ’’اَلْغُرْفَةُ‘‘} بلند و بالا عمارت، بالا خانہ۔ ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَهْلَ الْجَنَّةِ يَتَرَاءَوْنَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ  كَمَا يَتَرَاءَوْنَ الْكَوْكَبَ الدُّرِّيَّ الْغَابِرَ فِي الْأُفُقِ مِنَ الْمَشْرِقِ أَوِ الْمَغْرِبِ، لِتَفَاضُلِ مَا بَيْنَهُمْ، قَالُوْا يَا رَسُوْلَ اللّٰهِ! تِلْكَ مَنَازِلُ الْأَنْبِيَاءِ لَا يَبْلُغُهَا غَيْرُهُمْ، قَالَ بَلٰی، وَالَّذِيْ نَفْسِيْ بِيَدِهِ! رِجَالٌ آمَنُوْا بِاللّٰهِ وَ صَدَّقُوا الْمُرْسَلِيْنَ ] [بخاري، بدء الخلق، باب ما جاء في صفۃ الجنۃ … : ۳۲۵۶ ] ’’جنتی لوگ اپنے سے اوپر بالا خانوں میں رہنے والوں کو اس طرح دیکھیں گے جیسے وہ اس ستارے کو دیکھتے ہیں جو آسمان کے کنارے پر مشرق یا مغرب میں گزر رہا ہوتا ہے، کیونکہ ان میں سے بعض بعض سے افضل ہو گا۔‘‘ لوگوں نے کہا : ’’اے اللہ کے رسول! یہ تو انبیاء کے گھر ہوں گے، جہاں ان کے سوا کوئی نہیں پہنچ سکے گا؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’کیوں نہیں! اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! وہ لوگ (وہاں پہنچیں گے) جو اللہ تعالیٰ پر ایمان لائے اور انھوں نے رسولوں کی تصدیق کی۔‘‘ ¤ ➍ { اٰمِنُوْنَ :} بے خوف اس لیے ہوں گے کہ جنت کی نعمتیں ابدی اور دائمی ہوں گی اور ان کا دنیا والا خوف دور ہو جائے گا۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) { وَ الَّذِيْنَ يَسْعَوْنَ فِيْۤ اٰيٰتِنَا … :} اس کی تفسیر کے لیے دیکھیے سورۂ حج (۵۱) اور سورۂ سبا (۵) {’’ مُحْضَرُوْنَ ‘‘} یعنی کبھی تھوڑی دیر کے لیے بھی اس سے غائب نہیں ہو سکیں گے، ہمیشہ اس میں حاضر رکھے جائیں گے۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ {قُلْ اِنَّ رَبِّيْ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَآءُ مِنْ عِبَادِهٖ وَ يَقْدِرُ لَهٗ :} یہ الفاظ دوبارہ لانے کی وجہ یہ ہے کہ دونوں جگہ مقصد مختلف ہے۔ پہلی آیت میں کفار کی بات کا رد مقصود ہے اور یہاں اہلِ ایمان کو خرچ کرنے کی ترغیب مقصود ہے۔ اس کے علاوہ یہاں {’’ يَقْدِرُ ‘‘} کے ساتھ {’’ لَهٗ ‘‘} کا اضافہ ہے، یعنی اللہ تعالیٰ اپنے بندوں میں سے جس کا رزق چاہتا ہے فراخ کر دیتا ہے اور اسی کا رزق جب چاہتا ہے تنگ کر دیتا ہے۔ اس لیے کوئی شخص اگر یہ سمجھ کر بخل کرے اور اللہ کے راستے میں خرچ نہ کرے کہ خرچ کرنے سے میرا رزق تنگ ہو جائے گا تو یہ اس کی بھول ہے، رزق کی تنگی یا فراخی کا تعلق اس کے بخل یا سخاوت سے نہیں، بلکہ اللہ تعالیٰ کی مشیّت سے ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے بلال رضی اللہ عنہ سے فرمایا : [ أَنْفِقْ بِلاَلُ! وَلاَ تَخْشَ مِنْ ذِي الْعَرْشِ إِقْلَالًا] [ سلسلۃ الأحادیث الصحیحۃ: 160/6، ح : ۲۶۶۱۔ مسند البزار : 204/4، ح : ۱۳۶۶ ] ’’بلال! خرچ کر اور عرش والے کی طرف سے فقیری سے مت ڈر۔‘‘ ¤ ➋ { ’’ يَقْدِرُ لَهٗ ‘‘} (اس کے لیے تنگ کر دیتا ہے) میں {’’عَلَيْهِ‘‘} کے بجائے {’’ لَهٗ ‘‘} کا مطلب یہ ہے کہ اللہ تعالیٰ مومن کا رزق تنگ بھی اس کے فائدے ہی کے لیے کرتا ہے، کیونکہ اللہ تعالیٰ کے عطا کردہ پر قناعت کرنا اور اس پر راضی ہو جانا بہت بڑی سعادت ہے اور اس میں حساب بھی کم ہے۔ عبداللہ بن عمرو بن العاص رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ قَدْ أَفْلَحَ مَنْ أَسْلَمَ وَ رُزِقَ كَفَافًا وَ قَنَّعَهُ اللّٰهُ بِمَا آتَاهُ ] [ مسلم، الزکاۃ، باب في الکفاف والقناعۃ : ۱۰۵۴ ] ’’یقینا وہ شخص کامیاب ہو گیا جو اسلام لایا اور اسے گزارے کے مطابق رزق دیا گیا اور اللہ نے اسے جو کچھ دیا اس پر قانع کر دیا۔‘‘ ¤ ➌ {وَ مَاۤ اَنْفَقْتُمْ مِّنْ شَيْءٍ فَهُوَ يُخْلِفُهٗ :} یعنی اللہ کی راہ میں اس کے حکم کے مطابق زیادہ سے زیادہ یا کم سے کم جو چیز بھی خرچ کرو گے اللہ تعالیٰ اس کی جگہ دنیا میں اور عطا فرمائے گا اور آخرت کے اجر کا تو کوئی اندازہ نہیں کر سکتا۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا مِنْ يَوْمٍ يُصْبِحُ الْعِبَادُ فِيْهِ إِلَّا مَلَكَانِ يَنْزِلَانِ فَيَقُوْلُ أَحَدُهُمَا اللّٰهُمَّ أَعْطِ مُنْفِقًا خَلَفًا، وَ يَقُوْلُ الْآخَرُ اللّٰهُمَّ أَعْطِ مُمْسِكًا تَلَفًا ] [ بخاري، الزکاۃ، باب قول اللّٰہ تعالٰی : «فأما من أعطی …» : ۱۴۴۲ ] ’’جس دن بھی بندے صبح کرتے ہیں، اس میں دو فرشتے اترتے ہیں، ان میں سے ایک کہتا ہے، اے اللہ! خرچ کرنے والے کو اس کی جگہ اور دے اور دوسرا کہتا ہے، اے اللہ! روک کر رکھنے والے کے مال کو تباہ کر۔‘‘ ابوہریرہ رضی اللہ عنہ نبی صلی اللہ علیہ وسلم سے بیان کرتے ہیں کہ اللہ تبارک و تعالیٰ نے فرمایا : [ يَا ابْنَ آدَمَ! أَنْفِقْ أُنْفِقْ عَلَيْكَ، وَ قَالَ يَمِيْنُ اللّٰهِ  مَلْأَی سَحَّاءُ لَا يَغِيْضُهَا شَيْءٌ، اللَّيْلَ وَ النَّهَارَ ] [ مسلم، الزکاۃ، باب الحث علی النفقۃ… : ۹۹۳۔ بخاري : ۴۶۸۴ ] ’’اے آدم کے بیٹے! تو خرچ کر، میں تجھ پر خرچ کروں گا۔‘‘ اور فرمایا : ’’اللہ کا دایاں ہاتھ بھرا ہوا ہے، بہت برسنے والا ہے، دن رات خرچ کرنے سے اس میں کوئی چیز کمی نہیں لاتی۔‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا نَقَصَتْ صَدَقَةٌ مِنْ مَّالٍ وَ مَا زَادَ اللّٰهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلّٰهِ إِلَّا رَفَعَهُ اللّٰهُ ] [ مسلم، البر و الصلۃ، باب استحباب العفو والتواضع : ۲۵۸۸ ] ’’کوئی صدقہ مال میں کمی نہیں لاتا اور معاف کرنے سے اللہ تعالیٰ بندے کی عزت ہی میں اضافہ فرماتا ہے اور اللہ کے لیے کوئی نیچا نہیں ہوتا، مگر اللہ تعالیٰ اسے اونچا کر دیتا ہے۔‘‘ ¤ ➍ { وَ هُوَ خَيْرُ الرّٰزِقِيْنَ:} اس لیے کہ دوسرے تمام دینے والے اسی کے دیے میں سے دیتے ہیں، وہ اکیلا ہے جو ہر چیز اپنے پاس سے دیتا ہے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ {وَ يَوْمَ يَحْشُرُهُمْ جَمِيْعًا ثُمَّ يَقُوْلُ لِلْمَلٰٓىِٕكَةِ…:} اس کا عطف{’’ وَ لَوْ تَرٰۤى اِذِ الظّٰلِمُوْنَ مَوْقُوْفُوْنَ عِنْدَ رَببِّهِمْ ‘‘} پر ہے۔ پہلے مستکبرین کے مستضعفین سے بری ہونے کا ذکر فرما کر اس دن ان کی بری حالت کا نقشہ کھینچا ہے، اب فرشتوں کے ان سے بری ہونے کا ذکر فرما کر اس دن ان کے ذلیل وخوار اور بے یار و مددگار ہونے کا ذکر فرمایا۔ ¤ ➋ مفسر عبدالرحمان کیلانی رحمہ اللہ لکھتے ہیں : ’’مشرکین خواہ دور نبوی کے ہوں یا اس سے پہلے دور کے یا مابعد کے دور کے، وہ یہ نہیں کہتے تھے کہ ہم ان بتوں کو پوجتے ہیں، یا ان قبروں کو پوجتے ہیں، بلکہ ان کے اعتقاد کے پیچھے ان کا ایک پورا گھڑا ہوا فلسفہ ہوتا ہے۔ مثلاً سورج کی پوجا کرنے والے پہلے سورج کی روح کا ایک خیالی نقشہ یا تصویر قائم کرتے ہیں، پھر اس خیالی تصویر کے مطابق اس کا مجسّمہ بناتے ہیں، پھر یہ سمجھتے ہیں کہ اس مجسّمے کے ساتھ سورج کی روح کا ہر وقت تعلق قائم رہتا ہے اور ہم جو سورج کے مجسّمے کو پوجتے ہیں تو دراصل یہ اس بت کی نہیں بلکہ ہم سورج دیوتا کی عبادت کرتے ہیں۔ مشرکین نے اس طرح کی کئی دیویاں اور دیوتا بنا رکھے تھے، پھر یہ مجسّمے مظاہر قدرت ہی کے نہیں بلکہ بعض صفات کے بھی ہوتے تھے اور ان صفات کو بھی سیاروں سے منسوب کر دیا جاتا تھا۔ مثلاً فلاں علم کی دیوی، فلاں دولت کی دیوی ہے وغیرہ وغیرہ، پھر کچھ مشرک فرشتوں کے خیالی مجسّمے بنا کر ان کی پوجا کرتے تھے۔ مشرکین عرب کی ایک کثیر تعداد ایسی ہی تھی جو فرشتوں کو اللہ کی بیٹیاں قرار دیتے تھے اور لات، منات اور عزیٰ کے مجسّمے بنا کر ان کی عبادت کرتے، تو سمجھتے یہی تھے کہ ہم ان بتوں کی نہیں بلکہ ان فرشتوں کی عبادت کرتے ہیں جن کی ارواح ان مجسّموں یا بتوں سے وابستہ رہتی ہیں۔ اسی طرح قبر پرست بھی یہ سمجھتے تھے کہ ہم اس قبر کے پرستار نہیں، بلکہ ہماری سب نیاز مندیاں اور نذریں نیازیں تو صاحب قبر کے لیے ہیں، جس کی روح اس کی قبر کے ساتھ وابستہ رہتی ہے۔ ان تمام معبودوں سے چونکہ فرشتے ہی برتر مخلوق ہیں، لہٰذا قیامت کے دن اللہ تعالیٰ مشرکوں کو شرمندہ کرنے اور انھیں حسرت دلانے کے لیے انھی سے سوال کرے گا کہ یہ لوگ تمھاری ہی عبادت کرتے تھے؟ کیا تم نے انھیں ایسا کہا تھا کہ تمھاری عبادت کیا کریں، یا کچھ اس قسم کی آرزو تم نے کی تھی؟ اور یہ سوال اگرچہ فرشتوں سے ہو گا مگر مقصد ان کی پوجا کرنے والوں کو رسوا اور لاجواب کرنا ہو گا۔‘‘ ¤ ➌ قیامت کے روز یہ سوال فرشتوں ہی سے نہیں ہو گا بلکہ ان تمام ہستیوں سے کیا جائے گا جن کی دنیا میں عبادت ہوتی تھی۔ سورۂ فرقان میں ہے : « وَ يَوْمَ يَحْشُرُهُمْ وَ مَا يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ فَيَقُوْلُ ءَاَنْتُمْ اَضْلَلْتُمْ عِبَادِيْ هٰۤؤُلَآءِ اَمْ هُمْ ضَلُّوا السَّبِيْلَ » [ الفرقان : ۱۷ ] ’’اور جس دن وہ انھیں اور جن کو وہ اللہ کے سوا پوجتے تھے، اکٹھا کرے گا، پھر کہے گا کیا تم نے میرے ان بندوں کو گمراہ کیا، یا وہ خود راستے سے بھٹک گئے تھے؟‘‘ اور سورۂ مائدہ میں ہے : « وَ اِذْ قَالَ اللّٰهُ يٰعِيْسَى ابْنَ مَرْيَمَ ءَاَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُوْنِيْ وَ ااُمِّيَ اِلٰهَيْنِ مِنْ دُوْنِ اللّٰهِ» [ المائدۃ : ۱۱۶ ] ’’اور جب اللہ فرمائے گا، اے عیسیٰ ابن مریم! کیا تو نے لوگوں سے یہ کہا کہ اللہ کے سوا مجھے اور میری ماں کو معبود بنا لو؟‘‘"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ {قَالُوْا سُبْحٰنَكَ اَنْتَ وَلِيُّنَا مِنْ دُوْنِهِمْ:} یعنی فرشتے بھی عیسیٰ علیہ السلام کی طرح اللہ تعالیٰ کی پاکیزگی بیان کر کے اپنی صفائی پیش کریں گے اور کہیں گے، تو اس سے پاک ہے کہ تیرا کوئی شریک ہو، ہم تو تیرے بندے ہیں اور تو ہی ہمارا ولی ہے، تجھ ہی سے ہماری دوستی ہے، ان سے ہماری کوئی دوستی ہے نہ کوئی تعلق۔ ¤ ➋ { بَلْ كَانُوْا يَعْبُدُوْنَ الْجِنَّ … :} یعنی گو یہ بظاہر ہمارے بت بنا کر ہماری عبادت کرتے تھے، لیکن حقیقت میں یہ شیاطین کی بندگی کرتے تھے، کیونکہ انھوں نے ہی ان کو یہ راستہ دکھایا تھا کہ تجھے چھوڑ کر دوسروں کو اپنا معبود سمجھیں، ان کے آگے نذر و نیاز پیش کریں اور اپنی حاجت روائی کے لیے انھیں پکاریں۔ {’’ الْجِنَّ ‘‘} سے مراد شیاطین ہیں، جیسا کہ دوسری جگہ فرمایا : «اِنْ يَّدْعُوْنَ مِنْ دُوْنِهٖۤ اِلَّاۤ اِنٰثًا وَ اِنْ يَّدْعُوْنَ اِلَّا شَيْطٰنًا مَّرِيْدًا » [ النساء : ۱۱۷ ] ’’وہ اس کے سوا نہیں پکارتے مگر مؤنثوں کو اور نہیں پکارتے مگر سرکش شیطان کو۔‘‘"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ {فَالْيَوْمَ لَا يَمْلِكُ بَعْضُكُمْ لِبَعْضٍ نَّفْعًا وَّ لَا ضَرًّا :} یہ فرشتوں اور ان کی عبادت کرنے والوں دونوں سے خطاب ہے۔ یعنی دنیا میں یہ لوگ یہ سمجھ کر تمھاری عبادت کرتے تھے کہ تم انھیں کوئی فائدہ پہنچاؤ گے، یا نقصان سے بچا لو گے اور اللہ کے عذاب سے محفوظ رکھو گے، جیسے آج کل پیر پرستوں اور قبر پرستوں کا حال ہے، مگر آج تم میں سے کوئی نہ کسی کو فائدہ پہنچانے کا اختیار رکھتا ہے نہ نقصان سے بچانے کا۔ عابد و معبود دونوں عاجز ہیں، جیسا کہ فرمایا : « ضَعُفَ الطَّالِبُ وَ الْمَطْلُوْبُ » [ الحج : ۷۳ ]’’کمزور ہے مانگنے والا اور وہ بھی جس سے مانگا گیا۔‘‘ ¤ ➋ {وَ نَقُوْلُ لِلَّذِيْنَ ظَلَمُوْا ذُوْقُوْا عَذَابَ النَّارِ …:} ظالموں سے مراد مشرک ہیں، کیونکہ شرک ظلم عظیم ہے اور مشرک سب سے بڑے ظالم ہیں۔ دیکھیے سورۂ انعام (۸۲) اور سورۂ لقمان (۱۳)۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ { وَ اِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا … :} یہ ذکر کرنے کے بعد کہ قیامت کے دن مشرکین جہنم میں جائیں گے اور ان کے بنائے ہوئے معبود ان کے کچھ کام نہ آئیں گے، اب ان کے اس عذاب کا حق دار ہونے کی وجہ بیان فرمائی، جو یہ تھی کہ جب رسول اللہ صلی اللہ علیہ وسلم نے یا اسلام کے کسی داعی نے ان کے سامنے ہماری واضح آیات پڑھیں تو انھوں نے وہ الفاظ کہے جو اس آیت میں ذکر ہوئے ہیں۔ ¤ ➋ { قَالُوْا مَا هٰذَاۤ اِلَّا رَجُلٌ …:} یعنی یہ شخص تمھیں ان ہستیوں کی عبادت سے روکنا چاہتا ہے جن کی عبادت تمھارے آبا و اجداد مدت سے کرتے چلے آئے ہیں۔ مقصد ان کا لوگوں کو اسلام کی دعوت دینے والے کے خلاف بھڑکانا تھا، یہ کہہ کر کہ یہ شخص تمھیں تمھارے آباء کے دین سے روکنا چاہتا ہے، تو کیا تمھارے آبا و اجداد کوئی پاگل تھے جو ان کی عبادت کرتے تھے۔ پھر یہ نہیں کہ انھوں نے ایک آدھ دفعہ یہ کام کیا ہو، بلکہ{’’ كَانَ يَعْبُدُ اٰبَآؤُكُمْ ‘‘} وہ مدت سے ان کی عبادت کرتے چلے آئے ہیں۔ گویا ان کے نزدیک ان کے شرک کے حق ہونے کی واحد دلیل آبا و اجداد کی تقلید تھی، جو سراسر جہل ہے، جس کا علم سے کوئی تعلق نہیں۔ ¤ ➌ { وَ قَالُوْا مَا هٰذَاۤ اِلَّاۤ اِفْكٌ مُّفْتَرًى :} یہاں {’’ هٰذَاۤ ‘‘} سے مراد قرآن ہے۔ لفظ  {’’ اِفْكٌ مُّفْتَرًى ‘‘} میں قرآن کے متعلق انھوں نے دو باتیں کہیں، ایک تو یہ کہ فی نفسہ یہ جھوٹ ہے، دوسری یہ کہ اسے گھڑ کر اللہ کے ذمے لگا دیا گیا ہے۔ ¤ ➍ { وَ قَالَ الَّذِيْنَ كَفَرُوْا لِلْحَقِّ … :} کفار کی پریشان گوئی دیکھیے کہ کبھی اسے جھوٹ کہتے ہییں اور کبھی اسے واضح جادو کہتے ہیں، اور یہ جو فرمایا کہ جب ان کے پاس حق آگیا تو انھوں نے اسے واضح جادو کہا، تو مراد اس سے یہ ہے کہ اگر انھیں حق کا علم نہ ہوتا اور وہ اس قسم کی باتیں کرتے تو شاید معذور ہوتے، اب حق واضح ہو جانے کے بعد انکار کی صورت میں جہنم کے سوا ان کا انجام کیا ہو سکتا ہے؟"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) {وَ مَاۤ اٰتَيْنٰهُمْ مِّنْ كُتُبٍ يَّدْرُسُوْنَهَا۠ … :} اس آیت کی تفسیر دو طرح سے ہو سکتی ہے، ایک یہ کہ ہم نے انھیں ان کے مشرکانہ اقوال و افعال کی اجازت پر مشتمل کوئی کتاب نہیں دی جو ان کے پاس موجود ہو اور وہ اسے پڑھتے پڑھاتے ہوں اور نہ ہی ہم نے آپ سے پہلے ان کی طرف ایسا کوئی آگاہ کرنے والا بھیجا ہے جو ان کے مشرکانہ اقوال و افعال کی تائید کرتا ہو۔ دیکھیے سورۂ روم (۳۵)، فاطر (۴۰)، زخرف (۲۱) اور سورۂ احقاف (۴) اس کی دوسری تفسیر یہ ہے کہ ہماری طرف سے خاص ان کے لیے کوئی کتابیں نازل نہیں ہوئیں، نہ ہی آپ سے پہلے ان کے پاس کوئی ڈرانے والا آیا، اس لیے ضروری تھا کہ ان پر کتاب نازل ہو اور ان کی طرف پیغمبر مبعوث ہو، اسی لیے ہم نے آپ کو یہ قرآن دے کر ان کی طرف مبعوث فرمایا۔ دیکھیے سورۂ سجدہ (۳)۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ {وَ كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ… : ’’ مِعْشَارَ ‘‘} اور {’’عُشْرٌ‘‘} دونوں کا معنی دسواں حصہ ہے۔ یعنی پہلی اقوام جو تباہ کی گئیں، انھیں جو قد و قامت، قوت و دولت اور شان و شوکت عطا کی گئی تھی ان عرب کے کافروں کے پاس تو اس کا دسواں حصہ بھی نہیں۔ دیکھیے سورۂ روم (۹)، مومن (۲۱) اور سورۂ احقاف (۲۶)۔ ¤ ➋ { فَكَذَّبُوْا رُسُلِيْ فَكَيْفَ كَانَ نَكِيْرِ:’’ نَكِيْرِ ‘‘} اصل میں {’’نَكِيْرِيْ‘‘} ہے، آیات کے فواصل (آخری حروف) کی موافقت کے لیے یاء حذف کر دی اور کسرہ یہ بتانے کے لیے باقی رکھا کہ یہاں یاء محذوف ہے، یعنی میرا انکار، میرا عذاب۔ انھوں نے میرے رسولوں کو جھٹلایا تو دیکھ لو اس پر میں نے انھیں کیسی سخت سزا دی اور کس طرح برباد کیا کہ ان کا نشان تک نہیں ملتا، تو ان بے چاروں کی کیا حیثیت ہے کہ یہ ہماری گرفت سے بچ سکیں گے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { قُلْ اِنَّمَاۤ اَعِظُكُمْ بِوَاحِدَةٍ … : ’’ جِنَّةٍ ‘‘} کا معنی جنون، دیوانگی اور پاگل پن ہے۔ مشرکین کے باطل اقوال کے رد کے بعد رسول اللہ صلی اللہ علیہ وسلم کو نہایت قوی دلائل، مؤثر اسالیب اور مختلف انداز سے حق بات سمجھانے کی تلقین فرمائی۔ وہ رسول اللہ صلی اللہ علیہ وسلم کو کذّاب اور ساحر کے علاوہ مجنون، یعنی دیوانہ بھی کہتے تھے۔ تو اللہ تعالیٰ نے فرمایا، ان سے کہو کہ میں تمھیں صرف ایک نصیحت کرتا ہوں کہ بڑی مجلسوں میں تو شوروغل، بھیڑ بھاڑ اور اجتماعی دباؤ کی وجہ سے آدمی صحیح طرح سوچ نہیں سکتا، تم ضد اور تعصّب کو نکال کر اکیلے اکیلے یا دو دو ہو کر سوچو کہ محمد ( صلی اللہ علیہ وسلم ) آخر تمھارا صاحب ہے، تمھارے ساتھ اس نے نبوت سے پہلے چالیس برس گزارے، جسے تم صادق اور امین کہتے تھے، جس کی معاملہ فہمی اور درست رائے کی شہادت تم بھی دیتے تھے، اب اس نے جب تمھیں اللہ کا پیغام پہنچایا تو تم نے اسے مجنون کہنا شروع کر دیا، لہٰذا تم اس کی لائی ہوئی ہر بات پر پوری طرح غور کرو اور سوچ کر بتاؤ کہ آخر ان میں سے کون سی بات ہے جسے تم جنون کہہ سکو؟ کیا اللہ کو ایک ماننا دیوانگی ہے؟ کیا زنا، چوری، قتل نفس اور بہتان سے منع کرنا دیوانگی ہے؟ کیا صدق، عفاف، امانت، مہمان نوازی اور ہمدردی کا حکم دینا دیوانگی ہے؟ کسی ایک بات پر انگلی رکھ کر تو بتاؤ کہ یہ بات دیوانے کی بات ہے۔ یہ تفسیر {’’ مَا ‘‘} کو استفہامیہ مان کر ہے، اگر {’’ مَا ‘‘} نافیہ ہو تو معنی ہو گا کہ تمھارے ساتھی میں کسی طرح کا جنون نہیں۔ یہ معنی بھی درست ہے۔ ¤ ➋ {اِنْ هُوَ اِلَّا نَذِيْرٌ لَّكُمْ … :} یعنی پیغمبر تو تمھیں ایک نہایت سخت عذاب آنے سے پہلے اس سے ڈرانے والا ہے، تو تم اچھی طرح سوچ کر فیصلہ کرو کہ اپنی قوم کو شدید عذاب آنے سے پہلے آگاہ کر کے اس سے بچانے کی کوشش کرنے والا دیوانہ ہوتا ہے یا اس کا ہمدرد اور خیر خواہ۔ بخاری نے اس آیت کی تفسیر میں یہ حدیث نقل فرمائی ہے، ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم ایک دن صفا پہاڑی پر چڑھے اور فرمایا : {’’يَا صَبَاحَاهُ‘‘} (جو کسی اہم خطرے سے آگاہ کرنے کے لیے کہا جاتا تھا) تو قریش آپ کے پاس جمع ہو گئے اور کہنے لگے : ’’تمھیں کیا ہوا؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَرَأَيْتُمْ لَوْ أَخْبَرْتُكُمْ أَنَّ الْعَدُوَّ يُصَبِّحُكُمْ أَوْ يُمَسِّيْكُمْ أَمَا كُنْتُمْ تُصَدِّقُوْنِيْ؟ ] ’’یہ بتاؤ کہ اگر میں تمھیں اطلاع دوں کہ دشمن تم پر صبح حملہ کرے گا یا شام حملہ کرے گا تو کیا تم مجھے سچا سمجھو گے؟‘‘ انھوں نے کہا : [ بَلٰی ] ’’کیوں نہیں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ فَإِنِّيْ نَذِيْرٌ لَّكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيْدٍ ] ’’تو پھر میں تمھیں ایک نہایت ت سخت عذاب سے پہلے اس سے ڈرانے والا ہوں۔‘‘ تو ابو لہب نے کہا : [ تَبًّا لَكَ أَلِهٰذَا جَمَعْتَنَا؟ ] ’’تیرے لیے ہلاکت ہو، کیا تو نے ہمیں اس لیے جمع کیا ہے؟‘‘ تو اللہ تعالیٰ نے یہ (سورت) اتاری : « تَبَّتْ يَدَاۤ اَبِيْ لَهَبٍ وَّ تَبَّ » [ بخاري، التفسیر، باب : «إن ھو إلا نذیر لکم… » : ۴۸۰۱ ]"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ { قُلْ مَا سَاَلْتُكُمْ مِّنْ اَجْرٍ فَهُوَ لَكُمْ … :} یہ دوسری تلقین ہے کہ اس بات کی صراحت کر دیں کہ اللہ تعالیٰ کا پیغام پہنچانے پر میں تم سے کوئی اجرت یا معاوضہ تو نہیں مانگتا، میں نے تم سے جو بھی اجرت مانگی ہے تو وہ تمھاری ہوئی۔ یہ ایسے ہی ہے جیسے کوئی شخص دوسرے سے کہے کہ اگر تم نے مجھے کچھ دیاہے تو وہ تم لے لو، جب اسے معلوم ہو کہ اس نے اسے کچھ نہیں دیا، مطلب صرف اس بات کا اظہار ہوتا ہے کہ تم نے مجھے کچھ دیا ہی نہیں جو میں تمھیں واپس دوں۔ ایسے ہی یہاں فرمایا کہ اگر میں نے تم سے کوئی مزدوری مانگی ہے تو وہ تمھاری ہوئی۔ مطلب یہ کہ میں نے تم سے کوئی مزدوری مانگی ہی نہیں، میری دعوت تو محض تمھاری خیر خواہی کے لیے ہے، جیسا کہ ہود علیہ السلام نے اپنی قوم کو فرمایا : «{ وَ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ اِنْ اَجْرِيَ اِلَّا عَلٰى رَبِّ الْعٰلَمِيْنَ }» [ الشعراء : ۱۲۷] ’’اور میں اس پر تم سے کسی اجرت کا سوال نہیں کرتا، میری اجرت تو رب العالمین ہی کے ذمے ہے۔‘‘ دوسرا معنی یہ ہے کہ میں نے یہ پیغام پہنچا کر تم سے کسی چیز کا سوال کیا ہے تو وہ تمھارے ہی فائدے کی چیز ہے۔ میرا تم سے مطالبہ صرف یہ ہے کہ تم اپنے رب تعالیٰ کی طرف جانے والا راستہ اختیار کرو، جیسا کہ فرمایا : «{ قُلْ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ اِلَّا مَنْ شَآءَ اَنْ يَّتَّخِذَ اِلٰى رَبِّهٖ سَبِيْلًا }» [ الفرقان : ۵۷ ] ’’کہہ دے میں تم سے اس پر کسی مزدوری کا سوال نہیں کرتا مگر جو چاہے کہ اپنے رب کی طرف کوئی راستہ اختیار کرے۔‘‘ ¤ ➋ {وَ هُوَ عَلٰى كُلِّ شَيْءٍ شَهِيْدٌ :} یعنی الزام لگانے والے جو کچھ چاہیں کہتے رہیں مگر حقیقت یہ ہے کہ میری مزدوری اللہ کے ذمے ہے اور وہ سب کچھ جانتا ہے اور وہ میرے صدق اور خلوص نیت پر گواہ ہے کہ اس کا پیغام پہنچانے میں مجھے دنیا کی کسی چیز کا طمع نہیں، نہ میں اس کے سوا کسی سے کسی مزدوری یا بدلے کا طلب گار ہوں، نہ اس کی خواہش رکھتا ہوں۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ { قُلْ اِنَّ رَبِّيْ يَقْذِفُ بِالْحَقِّ : ’’قَذَفَ يَقْذِفُ‘‘} کا معنی پھینکنا ہے، یہ ڈالنے کے معنی میں بھی آتا ہے : {’’أَيْ يَقْذِفُ بِالْحَقِّ فِيْ قُلُوْبِ أَصْفِيَاءِهِ ‘‘} یعنی وہ اپنے خاص بندوں کے دلوں میں حق ڈال دیتا ہے۔ جب ثابت ہو گیا کہ یہ نبی نہ مجنون ہے، نہ دنیا کا طالب، نہ تم اس کے کسی قول یا فعل کو جھوٹ، جادو یا دیوانگی ثابت کر سکے تو ثابت ہوا کہ یہ اللہ تعالیٰ کی طرف سے ہے، اس لیے فرمایا، اے نبی! جو لوگ توحید، انبیاء کی رسالت اور آخرت کے منکر ہیں ان سے کہہ دے کہ بے شک میرا رب وحی کے ذریعے سے اپنے چنے ہوئے بندوں کے دل میں حق بات ڈالتا ہے، اسی نے میرے دل میں بذریعہ وحی اس حق کا القا فرمایا ہے، جیسا کہ فرمایا : «يُلْقِي الرُّوْحَ مِنْ اَمْرِهٖ عَلٰى مَنْ يَّشَآءُ مِنْ عِبَادِهٖ لِيُنْذِرَ  يَوْمَ التَّلَاقِ » [ المؤمن : ۱۵ ] ’’وہ اپنے بندوں میں سے جس پر چاہتا ہے اپنے حکم سے وحی اتارتا ہے، تاکہ آپس کی ملاقات کے دن سے ڈرائے۔‘‘ {’’ يَقْذِفُ بِالْحَقِّ ‘‘} کا دوسرا معنی {’’يَقْذِفُ بِالْحَقِّ عَلَي الْبَاطِلِ‘‘} ہے، یعنی کہہ دے بے شک میرا رب حق کو باطل پر پھینک مارتا ہے تو وہ اس کا دماغ کچل دیتا ہے، پس وہ اچانک مٹنے والا ہوتا ہے، جیسا کہ فرمایا : « بَلْ نَقْذِفُ بِالْحَقِّ عَلَى الْبَاطِلِ فَيَدْمَغُهٗ فَاِذَا هُوَ زَاهِقٌ » [ الأنبیاء : ۱۸ ] ’’بلکہ ہم حق کو باطل پر پھینک مارتے ہیں تو وہ اس کا دماغ کچل دیتا ہے، پس اچانک وہ مٹنے والا ہوتا ہے۔‘‘ یعنی تمھارے اس حق کو جھوٹ یا جادو یا دیوانگی کہنے سے اس کا کچھ نہیں بگڑے گا، میرا رب اس حق کو باطل پر اس زور سے پھینک مارے گا کہ وہ یکایک ہی مٹ جائے گا۔ اس آیت میں تیسری بات کی تلقین ہے کہ آپ مشرکین کو صراحت سے کہہ دیجیے کہ تم لوگ نہ حق سے جھگڑے میں غالب آ سکتے ہو نہ لڑائی میں، کیونکہ میرا رب میرے دل میں حق کا القا کرتا ہے، کیونکہ وہ تمام غیبوں کو خوب جاننے والا ہے۔ اب جو شخص غیب جانتا ہی نہیں، نہ اسے اللہ تعالیٰ کی طرف سے غیب کی کوئی بات بتائی جاتی ہے تو وہ حق کے ساتھ کیا جھگڑا کرے گا؟ پھر میرا رب حق کو باطل پر مار کر اس کا دماغ کچل دیتا، تو اہل باطل اہل حق کے ساتھ کیا لڑائی کریں گے؟ ¤ ➋ { عَلَّامُ الْغُيُوْبِ :} وہ تمام غیبوں کو خوب جاننے والا ہے۔ غیب کی ان باتوں میں سے جو چاہے اپنے جس پیغمبر کے دل میں چاہے ڈال دیتا ہے اور وہی خوب جانتا ہے کہ غیب کی کس بات کی اطلاع کس پیغمبر کو دینی ہے۔ دیکھیے سورۂ جنّ (۲۶ تا ۲۸)۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { قُلْ جَآءَ الْحَقُّ :} یہ چوتھی تلقین ہے کہ انھیں واضح کر دیں کہ ان کا باطل بہت جلد ختم ہو جائے گا اور اس کا نام و نشان تک نہیں رہے گا۔ دوسری جگہ فرمایا : «وَ قُلْ جَآءَ الْحَقُّ وَ زَهَقَ الْبَاطِلُ اِنَّ الْبَاطِلَ كَانَ زَهُوْقًا» [ بني إسرائیل : ۸۱ ] ’’اور کہہ دے حق آگیا اور باطل مٹ گیا، بے شک باطل ہمیشہ سے مٹنے والا تھا۔‘‘ ¤ ➋ { وَ مَا يُبْدِئُ الْبَاطِلُ وَ مَا يُعِيْدُ : ’’أَبْدَأَ يُبْدِءُ إِبْدَاءً‘‘} (افعال) کوئی کام شروع میں کرنا اور اعادہ کا معنی ہے اسے دوبارہ کرنا۔ ہر زندہ شخص ان دونوں سے خالی نہیں ہوتا، یا وہ کوئی کام ابتداءً کرتا ہے یا دوبارہ، البتہ مُردہ ان میں سے کچھ بھی نہیں کر سکتا۔ یہ ایک مقولہ ہے جو عرب کسی شخص یا قوم کے نیست و نابود ہونے پر استعمال کرتے ہیں : {’’إِنَّهُ مَا يُبْدِئُ وَمَا يُعِيْدُ‘‘} یعنی وہ بالکل مٹ گیا، اس کا نشان بھی باقی نہ رہا۔ ¤ ➌ اس آیت کے نزول کے تھوڑا عرصہ بعد ہی یہ پیش گوئی سچی ہو گئی۔ عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم مکہ میں داخل ہوئے اور بیت اللہ کے اردگرد تین سو ساٹھ بت نصب تھے، تو آپ ہر بت کو ایک لکڑی کے ساتھ، جو آپ کے ہاتھ میں تھی، ٹھوکر مارتے جاتے اور کہتے تھے : «جَآءَ الْحَقُّ وَ زَهَقَ الْبَاطِلُ اِنَّ الْبَاطِلَ كَانَ زَهُوْقًا » اور «جَآءَ الْحَقُّ وَ مَا يُبْدِئُ الْبَاطِلُ وَ مَا يُعِيْدُ » [ بخاري، التفسیر، باب : «و قل جاء الحق و زھق الباطل » : ۴۷۲۰ ]"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ { قُلْ اِنْ ضَلَلْتُ فَاِنَّمَاۤ اَضِلُّ عَلٰى نَفْسِيْ :} یہ پانچویں تلقین ہے کہ آپ انھیں سمجھانے کے لیے کہیں کہ اگر تمھارے بتوں کو اور تمھارے آباء کے دین کو چھوڑنے کی وجہ سے میں گمراہ ہو گیا ہوں، جیسا کہ میرے بارے میں تم کہتے پھرتے ہو تو اس گمراہی کا وبال مجھی پر پڑے گا، تم پر اس کی ذمہ داری نہیں اور اگر میں ہدایت یافتہ ہوں، جیسا کہ حقیقت ہے، تو یہ میرا کمال یا خوبی نہیں ہے بلکہ اس کی وجہ اللہ تعالیٰ کی طرف سے میری راہ نمائی ہے اور میں تمھیں صاف بتا چکا ہوں کہ میں اپنے نفس کی یا کسی اور کی پیروی کرتا ہی نہیں، بلکہ صرف وحی کی پیروی کرتا ہوں جو میری طرف کی جاتی ہے، جیسا کہ فرمایا : «قُلْ اِنَّمَاۤ اَتَّبِعُ مَا يُوْحٰۤى اِلَيَّ مِنْ رَّبِّيْ » [ الأعراف : ۲۰۳ ] ’’کہہ دے میں تو اسی کی پیروی کرتا ہوں جو میرے رب کی جانب سے میری طرف وحی کی جاتی ہے۔‘‘ اس آیت میں یہ ادب بھی سکھایا گیا کہ خامی اور غلطی کی نسبت اپنی طرف کرنی ہے اور ہدایت کی نسبت اللہ تعالیٰ کی طرف، کیونکہ ساری خیر اللہ تعالیٰ کے ہاتھ میں ہے اور ہدایت اور بھلائی صرف اللہ تعالیٰ کی نازل کردہ وحی اور اس کے بیان کردہ حق میں ہے، پھر جو گمراہ ہوتا ہے وہ اپنے نفس کی وجہ سے گمراہ ہوتا ہے اور جسے ہدایت ملتی ہے اسے اللہ کی طرف سے ملتی ہے، جیساکہ عبد اللہ بن مسعود رضی اللہ عنہ سے ایک مسئلہ پوچھا گیا تو انھوں نے فرمایا: [ أَقُوْلُ فِيْهَا بِرَأْيِيْ، فَإِنْ يَّكُ خَطَأً فَمِنِّيْ وَ مِنَ الشَّيْطَانِ، وَ إِنْ يَّكُ صَوَابًا، فَمِنَ اللّٰهِ ] [ مسند أحمد : 279/4، ح : ۱۸۴۸۹ ] ’’میں اس کے بارے میں اپنی رائے سے کہتا ہوں، اگر وہ خطا ہوئی تو میری طرف سے اور شیطان کی طرف سے ہو گی اور اگر درست ہوئی تو اللہ تعالیٰ کی طرف سے ہے ۔‘‘ ¤ ➋ {اِنَّهٗ سَمِيْعٌ قَرِيْبٌ :} ابو موسیٰ اشعری رضی اللہ عنہ بیان کرتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے، جب ہم کسی وادی کی بلندی پر پہنچتے تو ہم ’’لاالٰہ الا اللہ‘‘ اور ’’اللہ اکبر‘‘ کہتے اور ہماری آوازیں بلند ہو جاتیں۔ تو نبی صلی اللہ علیہ وسلم نے فرمایا : [ يَا أَيُّهَا النَّاسُ! ارْبَعُوْا عَلٰی أَنْفُسِكُمْ، فَإِنَّكُمْ لَا تَدْعُوْنَ أَصَمَّ وَ لَا غَائِبًا، إِنَّهُ مَعَكُمْ، إِنَّهُ سَمِيْعٌ قَرِيْبٌ، تَبَارَكَ اسْمُهُ وَ تَعَالٰی جَدُّهُ ] [ بخاري، الجہاد والسیر، باب ما یکرہ من رفع الصوت في التکبیر : ۲۹۹۲ ] ’’لوگو! اپنی جانوں پر رحم کرو، کیونکہ تم نہ کسی بہرے کو پکار رہے ہو نہ غائب کو، وہ تو تمھارے ساتھ ہے، بے شک وہ سب کچھ سننے والا ہے، قریب ہے۔ اس کا نام بہت برکت والا اور اس کی شان بہت بلند ہے۔‘‘"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ {وَ لَوْ تَرٰۤى اِذْ فَزِعُوْا فَلَا فَوْتَ : ’’ اِذْ فَزِعُوْا ‘‘} (جب گھبرا جائیں گے) سے دنیا کے بعد آخرت کی تمام منزلیں مراد ہیں، جن میں موت کے وقت فرشتوں کی آمد، پھر قبر میں سوال و جواب، پھر قبروں سے نکلنا اور اللہ تعالیٰ کے حضور پیش ہونا، پھر جہنم میں جانا سب کچھ شامل ہے۔ یعنی اب تو کفار بہت ڈینگیں مارتے ہیں، لیکن جب دنیا کی مہلت ختم ہو گی، اللہ تعالیٰ کی گرفت آئے گی اور ان پر گھبراہٹ طاری ہو گی، اس وقت ان کے لیے اس سے بچ کر نکلنے کی کوئی صورت نہیں ہو گی۔ ¤ ➋ { وَ اُخِذُوْا مِنْ مَّكَانٍ قَرِيْبٍ :} یعنی ایسے مجرموں کو کہیں دور سے تلاش نہیں کرنا پڑے گا، وہ جہاں بھی ہوں گے وہیں گرفتار کر لیے جائیں گے۔ بچ نکلنے کی یا بھاگ کھڑے ہونے کی کوئی صورت نہ ہو گی۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ { وَ قَالُوْۤا اٰمَنَّا بِهٖ :} یعنی جب آخرت کے عذاب کو دیکھیں گے تو کہیں گے، ہم اللہ پر ایمان لے آئے جو اکیلا ہے، جیسا کہ دوسری جگہ فرمایا : « فَلَمَّا رَاَوْا بَاْسَنَا قَالُوْۤا اٰمَنَّا بِاللّٰهِ وَحْدَهٗ وَ كَفَرْنَا بِمَا كُنَّا بِهٖ مُشْرِكِيْنَ» [ المؤمن : ۸۴ ] ’’پھر جب انھوں نے ہمارا عذاب دیکھا تو انھوں نے کہا ہم اس اکیلے اللہ پر ایمان لائے اور ہم نے ان کا انکار کیا جنھیں ہم اس کے ساتھ شریک ٹھہرانے والے تھے۔‘‘ اور فرمایا : « وَ لَوْ تَرٰۤى اِذِ الْمُجْرِمُوْنَ نَاكِسُوْا رُءُوْسِهِمْ عِنْدَ رَبِّهِمْ رَبَّنَاۤ اَبْصَرْنَاا وَ سَمِعْنَا فَارْجِعْنَا نَعْمَلْ صَالِحًا اِنَّا مُوْقِنُوْنَ» [ السجدۃ : ۱۲ ] ’’اور کاش! تو دیکھے جب مجرم لوگ اپنے رب کے پاس اپنے سر جھکائے ہوں گے اے ہمارے رب! ہم نے دیکھ لیا اور ہم نے سن لیا، پس ہمیں واپس بھیج کہ ہم نیک عمل کریں، بے شک ہم یقین کرنے والے ہیں۔‘‘ ¤ ➋ {وَ اَنّٰى لَهُمُ التَّنَاوُشُ مِنْ مَّكَانٍۭ بَعِيْدٍ : ’’ التَّنَاوُشُ ‘‘} آسانی سے کسی چیز کو حاصل کر لینا، لے لینا۔ یعنی ایمان لانے کی جگہ دنیا تھی جو بہت دور رہ گئی، اب اتنی دور جگہ سے ایمان کو حاصل کرنا کیسے ممکن ہے؟ عذاب دیکھ لینے کے بعد ایمان لانے سے تو کچھ حاصل نہیں، اس کا وقت تو سکرات موت سے پہلے تھا۔ ابن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ يَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ ] [ ترمذي، الدعوات، باب إن اللّٰہ یقبل توبۃ العبد… : ۳۵۳۷، قال الألباني حسن ] ’’اللہ تعالیٰ بندے کی توبہ قبول کرتا ہے جب تک موت کے وقت اس کا گلا نہ بولنے لگے۔‘‘"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ {وَ قَدْ كَفَرُوْا بِهٖ مِنْ قَبْلُ:} یعنی اس سے پہلے جب ایمان لانے کا وقت تھا تو اس کے ساتھ کفر کرتے رہے۔ ¤ ➋ { وَ يَقْذِفُوْنَ بِالْغَيْبِ مِنْ مَّكَانٍۭ بَعِيْدٍ :} غیب سے مراد بِن دیکھے ہے۔ دور سے پتھر یا تیر پھینکا جائے، پھر ایسے نشانے پر پھینکا جائے جسے دیکھا ہی نہ ہو تو وہ پتھر یا تیر نشانے پر کیسے پہنچ سکتا ہے۔ یعنی یہ لوگ دنیا میں اللہ تعالیٰ کی توحید، اس کے رسول اور آخرت کے انکار پر اڑے رہے اور ان کے متعلق کچھ بھی جانے بغیر طرح طرح کی باتیں کرتے رہے، کبھی رسول کا مذاق اڑاتے، اسے مجنون، ساحر، کذّاب کہتے، کبھی اہلِ ایمان پر پھبتیاں کستے، کبھی موت کے بعد زندگی کو ناممکن قرار دیتے رہے۔ الغرض! جو منہ میں آیا بے باکی اور بے خوفی سے بکتے رہتے اور انھیں اقرار بھی تھا کہ ہم جو کچھ کہہ رہے ہیں گمان کی بنا پر کہہ رہے ہیں، جیسا کہ فرمایا : « اِنْ نَّظُنُّ اِلَّا ظَنًّا وَّ مَا نَحْنُ بِمُسْتَيْقِنِيْنَ» [ الجاثیۃ : ۳۲ ] ’’ہم تو محض معمولی سا گمان کرتے ہیں اور ہم ہرگز پورا یقین کرنے والے نہیں۔‘‘ حقیقت بھی یہی ہے کہ شرک، دہریت اور انکارِ آخرت کے عقائد کوئی شخص بھی یقین کی بنا پر اختیار نہیں کرتا اور نہ کر سکتا ہے۔ کفر کی پوری عمارت محض قیاس و گمان کی بنیاد پر ہے، علم و یقین پر نہیں۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ { وَ حِيْلَ بَيْنَهُمْ وَ بَيْنَ مَا يَشْتَهُوْنَ …: ’’أَشْيَاعٌ‘‘ ’’شِيْعَةٌ‘‘} کی جمع ہے، ایک جیسے لوگوں کی جماعت۔{ ’’ مَا يَشْتَهُوْنَ ‘‘} (جس کی وہ خواہش کریں گے) سے مراد توبہ اور ایمان لانا ہے۔ یعنی وہ آخرت میں چاہیں گے کہ ان کا ایمان قبول ہو جائے اور عذاب سے ان کی نجات ہو جائے، مگر ان کے درمیان اور ان کی خواہش کے درمیان رکاوٹ ڈال دی جائے گی، جیسا کہ ان سے پہلے توحید و رسالت اور آخرت کے منکرین کے ساتھ کیا گیا کہ عذاب دیکھنے کے بعد کسی کی توبہ قبول ہوئی نہ ایمان لانا معتبر ہوا، جیسا کہ فرمایا : « فَلَمْ يَكُ يَنْفَعُهُمْ اِيْمَانُهُمْ لَمَّا رَاَوْا بَاْسَنَا سُنَّتَ اللّٰهِ الَّتِيْ قَدْ خَلَتْ فِيْ عِبَادِهٖ وَ خَسِرَ هُنَالِكَ الْكٰفِرُوْنَ» [ المؤمن : ۸۵ ] ’’پھر یہ نہ تھا کہ ان کا ایمان انھیں فائدہ دیتا، جب انھوں نے ہمارا عذاب دیکھ لیا۔ یہ اللہ کا طریقہ ہے جو اس کے بندوں میں گزر چکا اور اس موقع پر کافر خسارے میں رہے۔‘‘ ¤ ➋ { اِنَّهُمْ كَانُوْا فِيْ شَكٍّ مُّرِيْبٍ : ’’ مُرِيْبٍ ‘‘ ’’أَرَابَ يُرِيْبُ إِرَابَةً‘‘} (افعال) سے اسم فاعل ہے، بے چین رکھنے والا۔ یعنی اللہ تعالیٰ کے وجود، اس کی توحید، اس کے پیغمبروں کی رسالت اور آخرت سے انکار کرنے والوں کے عقائد کی بنیاد علم پر نہیں ہوتی، بلکہ محض وہم و گمان پر ہوتی ہے۔ وہ کبھی دلیل کے ساتھ ثابت نہیں کر سکتے کہ اتنی عظیم کائنات کسی بنانے والے کے بغیر خود بخود بن گئی، یا ان کے بنائے ہوئے معبود فی الواقع اللہ تعالیٰ کے اختیارات میں شریک ہیں، نہ ہی وہ یہ ثابت کر سکتے ہیں کہ اللہ تعالیٰ کسی بشر کو اپنا پیغمبر نہیں بنا سکتا، نہ یہ کہ وہ دوبارہ پیدا نہیں ہو سکتے یا قیامت نہیں آ سکتی، وہ خود بھی اس کے متعلق شک میں مبتلا رہتے ہیں اور شک بھی ایسا جو انھیں بے چین رکھتا ہے۔ اگرچہ وہ اپنے بعض مفادات کی بنا پر اپنے شک کا اظہار نہیں کرتے۔"
    }
  ]
}