{
  "surah": "Faatir",
  "surah_number": 35,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ {اَلْحَمْدُ لِلّٰهِ فَاطِرِ السَّمٰوٰتِ وَ الْاَرْضِ : ’’فَطَرَ يَفْطِرُ فَطْرًا‘‘} (ض، ن) نئے سرے سے پیدا کرنا، پھاڑنا۔ سورت کی ابتدا اس دعوے کے ساتھ ہوئی ہے کہ تمام خوبیوں اور سب تعریف کا حق دار اللہ وحدہ ہے۔ {’’ اَلْحَمْدُ لِلّٰهِ ‘‘} کی تفسیر سورۂ فاتحہ کی ابتدا میں ملاحظہ فرمائیں۔ اس کے بعد پوری سورت میں اس بات کے دلائل بیان ہوئے ہیں کہ وہ اکیلا تمام خوبیوں کا مالک اور معبود برحق ہے۔ درمیان میں توحید کے ساتھ ساتھ نبوت، قیامت اور ان سے متعلق بعض باتوں کا ذکر بھی ہے۔ چنانچہ اللہ تعالیٰ کے اکیلے معبود برحق ہونے کی پہلی دلیل یہ بیان فرمائی کہ وہ آسمان و زمین کو ابتداءً کسی نمونے کے بغیر عدم سے پھاڑ نکالنے والا ہے۔ آسمان و زمین سے مراد ساری کائنات ہے۔ جب پیدا کرنے والا وہ ہے تو عبادت کا حق دار کوئی دوسرا کیسے ہو سکتا ہے؟ یہی بات آگے صراحت کے ساتھ آیت (۳) میں آرہی ہے۔ پھر اس نے اپنی مخلوق کو پیدا فرما کر ایسے ہی نہیں چھوڑ دیا، بلکہ ان کے لیے دنیا کی ہر ضرورت مہیا فرمائی اور اس کی طرف ان کی راہ نمائی فرمائی، فرمایا : « رَبُّنَا الَّذِيْۤ اَعْطٰى كُلَّ شَيْءٍ خَلْقَهٗ ثُمَّ هَدٰى» [ طٰہٰ : ۵۰ ] ’’ہمارا رب وہ ہے جس نے ہر چیز کو اس کی شکل و صورت بخشی، پھر راستہ دکھایا۔‘‘ فطری ہدایت کے علاوہ انبیاء و رسل کو مبعوث فرمایا، اس کا ذکر آیت (۴) میں ہے۔ پھر ظاہر ہے کہ جب اس نے پہلے پہل نمونے کے بغیر یہ سب کچھ پیدا فرما لیا تو دوبارہ بنانا اس کے لیے کیا مشکل ہے، اس کا صراحت کے ساتھ ذکر آیت (۵) میں آرہا ہے۔ ¤ ➋ { جَاعِلِ الْمَلٰٓىِٕكَةِ رُسُلًا : ’’ رُسُلًا ‘‘ ’’رَسُوْلٌ‘‘} (بروزن{ فَعُوْلٌ} بمعنی {مَفْعُوْلٌ} ) کی جمع ہے، جسے کوئی پیغام دے کر بھیجا جائے۔ یعنی اللہ تعالیٰ نے انسانوں کی ہدایت کے لیے جن انبیاء و رسل کا انتخاب فرمایا، ان کے پاس اپنا پیغام پہنچانے کے لیے اس نے فرشتوں کو اپنا رسول بنایا۔ (دیکھیے سورۂ شوریٰ : ۵۱) ان میں سب سے بڑی شان والے جبریل علیہ السلام ہیں۔ ان کا لقب {’’اَلرُّوْحُ الْأَمِيْنُ‘‘ } ہے۔ بعض اوقات وہ دوسرے فرشتوں کو بھی پیغام پہنچانے کے لیے یا اپنے احکام کی تنفیذ کے لیے بھیجتا ہے۔ جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے طائف میں کفار کی بدسلوکی اور زیادتی کا ذکر کرتے ہوئے فرمایا : [ فَانْطَلَقْتُ وَ أَنَا مَهْمُوْمٌ عَلٰی وَجْهِيْ فَلَمْ أَسْتَفِقْ إِلَّا وَأَنَا بِقَرْنِ الثَّعَالِبِ فَرَفَعْتُ رَأْسِيْ فَإِذَا أَنَا بِسَحَابَةٍ قَدْ أَظَلَّتْنِيْ فَنَظَرْتُ فَإِذَا فِيْهَا جِبْرِيْلُ فَنَادَانِيْ فَقَالَ إِنَّ اللّٰهَ قَدْ سَمِعَ قَوْلَ قَوْمِكَ لَكَ وَمَا رَدُّوْا عَلَيْكَ وَ قَدْ بَعَثَ اللّٰهُ  إِلَيْكَ مَلَكَ الْجِبَالِ لِتَأْمُرَهُ بِمَا شِئْتَ فِيْهِمْ فَنَادَانِيْ مَلَكُ الْجِبَالِ فَسَلَّمَ عَلَيَّ ثُمَّ قَالَ يَا مُحَمَّدُ! إِنَّ اللّٰهَ قَدْ سَمِعَ قَوْلَ قَوْمِكَ لَكَ، وَ أَنَا مَلَكُ الْججِبَالِ وَ قَدْ بَعَثَنِيْ رَبُّكَ إِلَيْكَ لِتَأْمُرَنِيْ بِأَمْرِكَ فَمَا شِئْتَ؟ إِنْ شِئْتَ أَنْ أُطْبِقَ عَلَيْهِمُ الْأَخْشَبَيْنِ فَقَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ بَلْ أَرْجُوْ أَنْ يُّخْرِجَ اللّٰهُ مِنْ أَصْلاَبِهِمْ مَنْ يَّعْبُدُ اللّٰهَ وَحْدَهُ لَا يُشْرِكُ بِهِ شَيْئًا ] [ بخاري، بدء الخلق، باب إذا قال أحدکم آمین و الملائکۃ … : ۳۲۳۱۔ مسلم : ۱۷۹۵ ] ’’تو میں غم کی حالت میں جدھر منہ تھا چل پڑا۔ مجھے افاقہ ہوا تو میں قرن الثعالب پر تھا، میں نے سر اٹھایا تو ایک بدلی نے مجھ پر سایہ کیا ہوا تھا۔ میں نے دیکھا تو اس میں جبریل علیہ السلام تھے۔ انھوں نے مجھے آواز دی اور کہا : ’’اللہ تعالیٰ نے آپ کی قوم کی بات اور آپ کو ان کا جواب سن لیا اور اس نے آپ کی طرف پہاڑوں کے فرشتے کو بھیجا ہے، تا کہ آپ ان کے متعلق اسے جو چاہیں حکم دیں۔‘‘ پھر مجھے پہاڑوں کے فرشتے نے آواز دی اور مجھے سلام کہا، پھر کہا : ’’اے محمد! اللہ عزوجل نے آپ کی قوم کی بات سن لی ہے، میں پہاڑوں کا فرشتہ ہوں اور آپ کے رب نے مجھے آپ کی طرف بھیجا ہے، تاکہ آپ مجھے جو حکم چاہیں کریں؟ اگر چاہیں کہ میں انھیں دو پہاڑوں کے درمیان پیس دوں تو میں ایسے کر دیتا ہوں۔‘‘ تو میں نے کہا : ’’بلکہ میں امید کرتا ہوں کہ اللہ تعالیٰ ان کی پشتوں سے وہ لوگ نکالے گا جو اللہ کی عبادت کریں گے اور اس کے ساتھ کسی کو شریک نہیں کریں گے۔‘‘ ¤ بعض اوقات فرشتوں کو انبیاء کے علاوہ بھی اپنے صالح بندوں کو بشارت دینے کے لیے یا ان کی راہ نمائی کے لیے خواب میں یا بیداری میں بھیج دیتا ہے، جیسا کہ اسماعیل علیہ السلام کی والدہ، موسیٰ علیہ السلام کی والدہ اور مریم علیھما السلام کا معاملہ ہوا اور جیسا کہ وہ میدانِ قتال میں مجاہدین کے دل مضبوط رکھنے کے لیے فرشتوں کو بھیجتا ہے۔ بعض اوقات وہ انھیں آزمائش کے لیے بھی بھیج دیتا ہے، جیسا کہ صحیح بخاری (۳۴۶۴) میں گنجے، برص والے اور اندھے کا قصہ مذکور ہے۔ اللہ تعالیٰ نے {’’ اَلْحَمْدُ لِلّٰهِ ‘‘} کی دلیل کے طور پر یہاں آسمان و زمین کی پیدائش کے بعد فرشتوں کا ذکر اس لیے فرمایا کہ وہ اس کے ہاں بہت معزز مقام رکھتے ہیں، اس کے باوجود اس کے بندے ہیں، جیسا کہ فرمایا : « بَلْ عِبَادٌ مُّكْرَمُوْنَ» [ الأنبیاء : ۲۶ ] ’’بلکہ وہ بندے ہیں جنھیں عزت دی گئی ہے۔‘‘ ان کے ذمے اللہ تعالیٰ کے احکام پہنچانا ہے اور انھیں نافذ کرنا بھی، جیسا کہ فرمایا : « فَالْمُدَبِّرٰتِ اَمْرًا » [ النازعات : ۵ ] ’’ پھر جو کسی کام کی تدبیر کرنے والے ہیں!‘‘ اس میں مشرکین کو اس بات کی طرف توجہ دلانا بھی مقصود ہے کہ جن فرشتوں کو تم نے معبود بنا رکھا ہے وہ اپنا اختیار کچھ نہیں رکھتے، ان کی حیثیت محض رسول (قاصد) کی ہے جس کی اپنی بات کچھ نہیں ہوتی، بلکہ وہ بھیجنے والے کا پیغام پہنچاتا ہے، یا اس پر عمل کرتا ہے۔ ¤ ➌ { اُولِيْۤ اَجْنِحَةٍ مَّثْنٰى وَ ثُلٰثَ وَ رُبٰعَ :} فرشتوں کی پیدائش میں اپنے کمال قدرت کے بیان کے لیے ان کے {’’ اَجْنِحَةٍ ‘‘} کا ذکر فرمایا، جو {’’جَنَاحٌ‘‘} (بفتح جیم) کی جمع ہے۔ یہ لفظ ہاتھ، بازو اور پہلو کے معنی میں بھی آتا ہے، مگر پرندوں کے ذکر کے ساتھ اس کا معنی ’’پَر‘‘ ہوتا ہے، جیسا کہ فرمایا : « وَ لَا طٰٓىِٕرٍ يَّطِيْرُ بِجَنَاحَيْهِ » [ الأنعام : ۳۸ ] ’’اور نہ کوئی اڑنے والا، جو اپنے دو پروں سے اڑتا ہے۔‘‘ فرشتوں کی آسمانوں اور زمین میں آمدورفت کے لیے پَر ہی موزوں ہو سکتے ہیں، اب اللہ تعالیٰ ہی بہتر جاانتا ہے، یا جس نے انھیں اصل صورت میں دیکھا ہے کہ ان {’’ اَجْنِحَةٍ ‘‘} کی کیا کیفیت ہے؟ آیا وہ صرف پرواز کے لیے ہیں، یا وہی بازوؤں کا کام بھی دیتے ہیں۔ آیت سے یہ ضرور ظاہر ہوتا ہے کہ ان کے پَر کم از کم دو ضرور ہیں، زیادہ کی حد اللہ تعالیٰ بہتر جانتا ہے۔ تین تین، چار چار سے معلوم ہوا کہ وہ دو سے زیادہ پروں والے بھی ہیں اور یہ بھی معلوم ہوا کہ ضروری نہیں فرشتوں کے پر جفت عدد میں ہوں بلکہ طاق بھی ہیں۔ ¤ ➍ { يَزِيْدُ فِي الْخَلْقِ مَا يَشَآءُ:} اس جملے کے کئی مطلب ہو سکتے ہیں اور سبھی بیک وقت مراد لیے جا سکتے ہیں اور جامع کلمات ایسے ہی ہوتے ہیں۔ ایک یہ کہ اللہ تعالیٰ فرشتوں کو پیدا کرتے ہوئے جس کے پَر جتنے چاہتا ہے زیادہ بنا دیتا ہے، جس سے ان کی قوتِ پرواز میں بے حساب اضافہ ہو جاتا ہے۔ عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں : [ أَنَّ مُحَمَّدًا صَلَّی اللّٰهُ  عَلَيْهِ وَ سَلَّمَ رَأَی جِبْرِيْلَ، لَهُ سِتُّمِائَةِ جَنَاحٍ ] [ بخاري، التفسیر، باب قولہ تعالٰی : « فأوحی إلی عبدہ ما أوحی » : ۴۸۵۷ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے جبریل علیہ السلام کو (اصل صورت میں) دیکھا، ان کے چھ سو پَر تھے۔‘‘ ¤ دوسرا مطلب یہ ہے کہ اللہ تعالیٰ اپنی ساری مخلوق میں سے جس میں چاہتا ہے اور جتنی چاہتا ہے زیادتی کر دیتا ہے، مثلاً طویل القامت یا قصیر القامت ہونے میں، حسن و جمال میں، عقل و دانش میں، جرأت و بہادری میں، سخاوت و بخل میں، بلندی و پستی میں، قوت و ضعف میں، غرض کمیت و کیفیت کی بے شمار صورتوں میں جتنی چاہتا ہے زیادتی کر دیتا ہے۔ تیسرا مطلب یہ ہے کہ اس نے جتنی مخلوق بنائی ہے اس میں جتنا چاہتا ہے اضافہ کرتا رہتا ہے، نئی سے نئی مخلوق، نئے سے نئے سیارے، نئی کہکشائیں، نئے حیوانات و جمادات و نباتات پیدا فرماتا رہتا ہے۔ سورۂ رحمٰن میں ہے: « كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ » [ الرحمٰن : ۲۹ ] ’’ہر دن وہ ایک (نئی) شان میں ہے۔‘‘ اس میں یہود کا رد ہے، جو کہتے ہیں کہ اللہ تعالیٰ آدم علیہ السلام کی پیدائش کے بعد ساتویں دن فارغ ہو گیا، اب وہ مزید کوئی چیز پیدا نہیں کرتا۔ ¤ ➎ { اِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ : ’’ اِنَّ ‘‘} عموماً پہلی بات کی علت بیان کرنے کے لیے ہوتا ہے، یعنی اللہ تعالیٰ خلق میں اپنی مرضی کے مطابق اضافہ کرتا ہے اور زمین و آسمان کی اور پروں والے پیغام رساں فرشتوں کی پیدائش فرماتا ہے، کیونکہ وہ ہر چیز پر پوری طرح قارد ہے۔ وہاں کسی بھی ارادے کے پورا کرنے میں کسی عجز کا تصور نہیں ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { مَا يَفْتَحِ اللّٰهُ لِلنَّاسِ مِنْ رَّحْمَةٍ … :} اس آیت سے مقصود بھی مشرکین کی اس غلط فہمی کا رد ہے کہ اللہ تعالیٰ کے بندوں میں سے کوئی انھیں اولاد، روزی یا کوئی نعمت دے سکتا ہے یا روک سکتاہے۔ رحمت سے مراد وہ نعمت ہے جو اللہ تعالیٰ اپنے بندوں کو عطا فرماتا ہے، چاہے وہ مادی ہو جیسے بارش، روزی، اولاد اور صحت وغیرہ، یا معنوی اور روحانی ہو، جیسے علم و حکمت، ایمان و اسلام، بعثت انبیاء، دعا کی قبولیت اور توبہ کی توفیق وغیرہ۔ مطلب یہ ہے کہ بندوں کو جو بھی نعمت حاصل ہے وہ اللہ تعالیٰ ہی کی طرف سے ہے۔ وہ اپنی نعمت کسی کو دینا چاہے تو کوئی اسے روکنے والا نہیں اور روکنا چاہے تو کوئی اسے دینے والا نہیں۔ مغیرہ بن شعبہ رضی اللہ عنہ سےے روایت ہے کہ نبی صلی اللہ علیہ وسلم ہر فرض نماز کے بعد کہا کرتے تھے : [ لَا إِلٰهَ إِلاَّ اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ، وَ لَهُ الْحَمْدُ، وَ هُوَ عَلٰی كُلِّ شَيْءٍ قَدِيْرٌ، اللّٰهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَ لَا مُعْطِيَ لِمَا مَنَعْتَ، وَ لاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَددُّ ] [ بخاري، الأذان، باب الذکر بعد الصلاۃ : ۸۴۴ ] ’’اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ اسی کی بادشاہت ہے اور اسی کے لیے سب تعریف ہے اور وہ ہر چیز پر کامل قدرت رکھتا ہے۔ اے اللہ! جو تو دے اسے کوئی روکنے والا نہیں اور جو تو روک دے وہ دینے والا کوئی نہیں اور تیرے مقابلے میں کسی شان والے کو اس کی شان کوئی کام نہیں دیتی۔‘‘ یہ مضمون قرآن مجید میں کئی مقامات پر بیان ہوا ہے۔ دیکھیے سورۂ انعام (۱۷)، یونس (۱۰۷) اور سورۂ زمر (۳۸)۔ ¤ ➋ {وَ هُوَ الْعَزِيْزُ الْحَكِيْمُ :} خبر پر الف لام لانے سے کلام میں حصر پیدا ہو گیا۔ یہ پہلے جملے کی علت ہے کہ وہی ایسا زبردست غالب ہے کہ اس کے حکم کو کوئی روک نہیں سکتا اور ایسا کمال حکمت والا ہے جس کا کوئی کام حکمت سے خالی نہیں، کسی اور میں یہ صفات ہیں ہی نہیں، تو پھر کون ہے جو اس کے کھولے ہوئے کو بند کر سکے یا اس کے بند کیے ہوئے کو کھول سکے؟"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {يٰۤاَيُّهَا النَّاسُ اذْكُرُوْا نِعْمَتَ اللّٰهِ عَلَيْكُمْ … :} یعنی اللہ تعالیٰ کی نعمتیں فراموش نہ کرو اور نمک حرام نہ بنو، بھلا بتاؤ اللہ کے سوا تمھارا کوئی خالق ہے جو تمھیں رزق دے رہا ہو؟ ظاہر ہے کوئی نہیں۔ استفہام انکاری ہے۔ ¤ ➋ {فَاَنّٰى تُؤْفَكُوْنَ :} یعنی پھر تمھیں یہ دھوکا کہاں سے لگ گیا کہ خالق و رازق تو اللہ تعالیٰ ہو، مگر بندگی اور فرماں برداری دوسروں کی کی جائے۔ مثل مشہور ہے ’’جس کا کھائیے اسی کا گائیے۔‘‘"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {وَ اِنْ يُّكَذِّبُوْكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِّنْ قَبْلِكَ :} توحید کے بعد رسالت کا ذکر ہے۔ {’’ وَ اِنْ يُّكَذِّبُوْكَ ‘‘} میں واؤ عطف دلیل ہے کہ اس سے پہلے ایک جملہ محذوف ہے، جس کا مفہوم یہ ہے : {’’فَإِنْ يُصَدِّقُوْكَ فَقَدْ فَازُوْا لِأَنَّكَ رَسُوْلُ اللّٰهِ حَقًّا‘‘} یعنی اگر یہ آپ کی تصدیق کریں تو یہ کامیاب ہیں، کیونکہ آپ اللہ کے سچے رسول ہیں۔ ¤ ➋ {’’ وَ اِنْ يُّكَذِّبُوْكَ ‘‘ } شرط ہے، اس کی جزا محذوف ہے جو خود بخود سمجھ میں آ رہی ہے : {’’وَإِنْ يُكَذِّبُوْكَ فَتَأَسَّ بِالرُّسُلِ مِنْ قَبْلِكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِنْ قَبْلِكَ‘‘} یعنی اگر یہ آپ کو جھٹلا دیں تو آپ اپنے سے پہلے رسولوں کے حالات سے تسلی حاصل کریں، کیونکہ آپ سے پہلے کئی رسول جھٹلائے گئے اور انھوں نے قوم کے جھٹلانے پر صبر کیا۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی ہے اور جھٹلانے والوں کے لیے وعید کہ رسولوں کو پہلے جھٹلانے والے لوگوں کی طرح یہ لوگ بھی برباد ہوں گے۔ قرآن مجید میں کئی مقامات پر پہلے رسولوں کا حوالہ دے کر آپ کو تسلی دی گئی، جیسا کہ فرمایا : «وَ لَقَدْ كُذِّبَتْ رُسُلٌ مِّنْ قَبْلِكَ فَصَبَرُوْا عَلٰى مَا كُذِّبُوْا وَ اُوْذُوْا حَتّٰۤى اَتٰىهُمْ نَصْرُنَا وَ لَا مُبَدِّلَ لِكَلِمٰتِ اللّٰهِ  وَ لَقَدْ جَآءَكَ مِنْ نَّبَاِي الْمُرْسَلِيْنَ » [الأنعام : ۳۴ ] ’’اور بلاشبہ یقینا تجھ سے پہلے کئی رسول جھٹلائے گئے تو انھوں نے اس پر صبر کیا کہ وہ جھٹلائے گئے اور ایذا دیے گئے، یہاں تک کہ ان کے پاس ہماری مدد آگئی اور کوئی اللہ کی باتوں کو بدلنے والا نہیں اور بلاشبہ یقینا تیرے پاس ان رسولوں کی کچھ خبریں آئی ہیں۔‘‘ اور دیکھیے سورۂ حٰم السجدہ (۴۳)۔ ¤ ➌ {وَ اِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ : } یعنی یہ لوگ آپ کو جھٹلا کر آخر کہاں جائیں گے، تمام معاملات آخر پیش تو ہمارے سامنے ہی ہوں گے اور ہم نے ہی ان کا فیصلہ کرنا ہے۔ توحید و رسالت کے ساتھ آخرت کا ذکر ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { يٰۤاَيُّهَا النَّاسُ اِنَّ وَعْدَ اللّٰهِ حَقٌّ :} وعدے سے مراد آخرت کا وعدہ ہے، جس کا پچھلی آیت کے آخری جملے میں ذکر ہے کہ تمام معاملات اللہ کے حضور پیش ہونے والے ہیں۔ ¤ ➋ { فَلَا تَغُرَّنَّكُمُ الْحَيٰوةُ الدُّنْييَا :} یعنی اللہ کا وعدہ یقینا سچا ہے کہ تمھیں اس کے حضور پیش ہونا ہے تو کہیں دنیا کی زندگی اپنی لذتوں اور دل فریبیوں کے ساتھ تمھیں اس دھوکے میں نہ ڈال دے کہ بس یہی زندگی ہے، کیونکہ اس دنیا نے بہت سے لوگوں کو اس دھوکے میں رکھ کر برباد کر دیا۔ دیکھیے سورۂ انعام (۲۹)، مؤمنون (۳۷) اور سورۂ جاثیہ (۲۴) {’’ الدُّنْيَا ‘‘ ’’اَلْأَدْنٰي‘‘} کی مؤنث ہے، قریب کی زندگی جو آخرت کے مقابلے میں قریب ہے، یا کمینی اور حقیر زندگی، جیسا کہ {’’دَنِئٌ‘‘} بمعنی حقیر ہے۔ مقصود دنیا کی زندگی کی حقارت کی طرف توجہ دلا کر اس سے ہوشیار ہونے کی تاکید ہے۔ ¤ ➌ { وَ لَا يَغُرَّنَّكُمْ بِاللّٰهِ الْغَرُوْرُ:’’ الْغَرُوْرُ ‘‘} غین کے ضمّہ کے ساتھ {’’غَرَّ يَغُرُّ‘‘} (ن) کا مصدر ہے، دھوکا دینا اور غین کے فتحہ کے ساتھ صفت مشبہ ہے، جس میں مبالغے کا معنی بھی ہے، یعنی بہت دھوکا دینے والا۔ الف لام اس میں عہد کا ہے، وہ دھوکا دینے والا جسے تم بھی جانتے ہو، یعنی شیطان، جس کی صراحت اگلی آیت میں آرہی ہے، جیسا کہ {’’شُكُوْرٌ‘‘} (شین کے ضمّہ کے ساتھ) شکر کرنا اور {’’شَكُوْرٌ‘‘} (شین کے فتحہ کے ساتھ) بہت شکر کرنے والا۔ ¤ ➍ شیطان اللہ تعالیٰ کے بارے میں کئی طرح سے فریب دیتا ہے، کسی کو یہ فریب دیتا ہے کہ اللہ تعالیٰ کا سرے سے وجود ہی نہیں، یہ کائنات خود بخود چل رہی ہے۔ کسی کو اس غلط فہمی میں مبتلا کرتا ہے کہ اللہ کے سوا اور بھی معبود ہیں جو نفع و نقصان کا اختیار رکھتے ہیں۔ کسی کو یہ حکم دیتا ہے کہ گناہ کر لو پھر توبہ کر لینا، کسی کو اللہ کی رحمت کے نام پر دھوکا دیتا ہے کہ اللہ تعالیٰ بڑا غفور و رحیم ہے، جتنے چاہو گناہ کر لو، وہ بخش دے گا اور اکثر کو ’’تسویف‘‘ کے ساتھ دھوکا دیتا ہے، تسویف کا معنی ہے {’’سَوْفَ أَفْعَلُ‘‘} کہ میں نیک عمل کر ہی لوں گا، ایسی بھی کیا جلدی ہے، ابھی بہت وقت باقی ہے، وہ آدمی کو اسی دھوکے میں رکھتا ہے، حتیٰ کہ عمل کی مہلت ختم ہو جاتی ہے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { اِنَّ الشَّيْطٰنَ لَكُمْ عَدُوٌّ :} شیطان تمھارا دشمن ہے، تمھارے ساتھ اس کی عداوت قدیم اور قیامت تک کے لیے دائمی ہے، جس کی بنیاد حسد پر ہے اور حاسد کی عداوت کبھی ختم نہیں ہوتی۔ سورۂ کہف میں اس کی تفصیل بیان کرتے ہوئے فرمایا : «وَ اِذْ قُلْنَا لِلْمَلٰٓىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْۤا اِلَّاۤ اِبْلِيْسَ كَانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ اَمْرِ رَبِّهٖ اَفَتَتَّخِذُوْنَهٗ وَ ذُرِّيَّتَهٗۤ اَوْلِيَآءَ مِنْ دُوْنِيْ وَ هُمْ لَكُمْ عَدُوٌّ بِئْسَ لِلظّٰلِمِيْنَ بَدَلًا » [ الکہف : ۵۰ ] ’’اور جب ہم نے فرشتوں سے کہا آدم کو سجدہ کرو تو انھوں نے سجدہ کیا مگر ابلیس، وہ جنوں میں سے تھا، سو اس نے اپنے رب کے حکم کی نافرمانی کی، تو کیا تم اسے اور اس کی اولاد کو مجھے چھوڑ کر دوست بناتے ہو، حالانکہ وہ تمھارے دشمن ہیں، وہ (شیطان) ظالموں کے لیے بطور بدل برا ہے۔‘‘ ¤ ➋ { فَاتَّخِذُوْهُ عَدُوًّا :} جب وہ تمھارا دشمن ہے تو تم بھی ہمیشہ اسے دشمن ہی سمجھو، وہ کبھی تمھارا خیر خواہ یا دوست نہیں ہو سکتا، اپنے عقائد و اعمال اور اپنے اقوال و افعال اور احوال، غرض ہر چیز میں ا س کی مخالفت کرو اور مرتے دم تک یہ عداوت قائم رکھو۔ ¤ ➌ {اِنَّمَا يَدْعُوْا حِزْبَهٗ لِيَكُوْنُوْا مِنْ اَصْحٰبِ السَّعِيْرِ :} اپنے گروہ سے مراد وہ لوگ ہیں جو اس کا کہا مانتے ہیں اور اس کے بتائے ہوئے راستے پر چلتے ہیں۔ یعنی شیطان بظاہر جتنی بھی خیر خواہی کرے مقصد اس کا یہی ہے کہ وہ اکیلا جہنم میں جانے کے بجائے اپنے دوستوں کو بھی اپنے ساتھ لے کر جائے۔ اس لیے اس کی خیر خواہی پر کبھی بھی اعتماد نہ کرو۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { اَلَّذِيْنَ كَفَرُوْا لَهُمْ عَذَابٌ شَدِيْدٌ:} اس آیت میں اپنے فرماں بردار اور نافرمان بندوں کا انجام بیان فرمایا ہے۔ ¤ ➋ { لَهُمْ مَّغْفِرَةٌ وَّ اَجْرٌ كَبِيْرٌ: ’’ مَغْفِرَةٌ ‘‘} پر تنوین تعظیم کے لیے ہے، اس لیے ترجمہ ’’بڑی بخشش‘‘ کیا گیا ہے۔ {’’ اَجْرٌ كَبِيْرٌ ‘‘} (بہت بڑا اجر) یعنی ان کے لیے ان کے اعمال سے کہیں بڑھ کر اور ان کی سوچ اور فکر سے بھی بڑا اجر ہے۔ یہاں {’’اَجْرٌ كَبِيْرٌ ‘‘} سے مراد جنت اور اس کی نعمتیں ہیں۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { اَفَمَنْ زُيِّنَ لَهٗ سُوْٓءُ عَمَلِهٖ :} اس کا جواب محذوف ہے : {’’أَيْ كَمَنْ لَيْسَ كَذٰلِكَ‘‘} یعنی کیا وہ شخص جس کے لیے اس کا برا عمل مزین کر دیا گیا تو اس نے اسے اچھا سمجھا، وہ اس شخص کی طرح ہے جو ایسا نہیں؟ ظاہر ہے کہ دونوں برابر نہیں ہو سکتے۔ ایسا شخص اس شخص کی طرح نہیں ہو سکتا ہے جسے اللہ تعالیٰ کی طرف سے ہدایت عططا ہوئی ہو اور وہ اس پر عمل کرتا ہو۔ دوسری جگہ یہ بات واضح الفاظ میں فرمائی : « اَفَمَنْ كَانَ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّهٖ كَمَنْ زُيِّنَ لَهٗ سُوْٓءُ عَمَلِهٖ وَ اتَّبَعُوْۤا اَهْوَآءَهُمْ» [محمد : ۱۴ ] ’’تو کیا وہ شخص جو اپنے رب کی طرف سے ایک واضح دلیل پر ہے، اس شخص کی طرح ہے جس کے لیے اس کے برے اعمال مزیّن کر دیے گئے اور انھوں نے اپنی خواہشوں کی پیروی کی۔‘‘ مطلب یہ کہ کافر اور مومن برابر نہیں ہو سکتے اور نہ ہی وہ شخص جس کے لیے اس کا برا عمل مزیّن کیا گیا تو اس نے اسے اچھا سمجھا، اس شخص کی طرح ہو سکتا ہے جو اگرچہ برا کام کرتا ہے لیکن اسے برا ہی سمجھتا ہے، اچھا نہیں۔ ظاہر ہے یہ دونوں شخص بھی برابر نہیں ہو سکتے، کیونکہ ایک شخص جو برا کام کرتا ہے اور اسے برا ہی سمجھتا ہے، اس کے متعلق تو امید کی جا سکتی ہے کہ وہ کبھی نہ کبھی راہ راست پر آ جائے گا، لیکن جو شخص برا کام کرتا ہے مگر اسے اچھا سمجھ کر کرتا ہے تو اس کے راہ راست پر آنے کی کبھی امید نہیں کی جا سکتی، جیسا کہ اللہ تعالیٰ نے فرمایا : «قُلْ هَلْ نُنَبِّئُكُمْ بِالْاَخْسَرِيْنَ اَعْمَالًا (103) اَلَّذِيْنَ ضَلَّ سَعْيُهُمْ فِي الْحَيٰوةِ الدُّنْيَا وَ هُمْ يَحْسَبُوْننَ اَنَّهُمْ يُحْسِنُوْنَ صُنْعًا » [ الکہف : ۱۰۳، ۱۰۴ ] ’’کہہ دے کیا ہم تمھیں وہ لوگ بتائیں جو اعمال میں سب سے زیادہ خسارے والے ہیں۔ وہ لوگ جن کی کوشش دنیا کی زندگی میں ضائع ہو گئی اور وہ سمجھتے ہیں کہ وہ ایک اچھا کام کر رہے ہیں۔‘‘ اس آیت میں برے عمل سے مراد کفرو شرک ہے، جیسا کہ سورۂ کہف کی آیت کے بعد فرمایا: « اُولٰٓىِٕكَ الَّذِيْنَ كَفَرُوْا بِاٰيٰتِ رَبِّهِمْ وَ لِقَآىِٕهٖ » [ الکہف : ۱۰۵ ] ’’یہی وہ لوگ ہیں جنھوں نے اپنے رب کی آیات کا اور اس کی ملاقات کا انکار کیا۔‘‘ البتہ آیت کے الفاظ عام ہونے کی وجہ سے بدعتی لوگ بھی اس میں شامل ہیں، کیونکہ وہ بدعت کو نیکی سمجھ کر اس پر عمل کرتے ہیں۔ ظاہر ہے چوری، زنا اور قتل وغیرہ کا ارتکاب کرنے والا شخص اپنے آپ کو گناہ گار سمجھتا ہے، اس لیے امید ہے کہ وہ توبہ کر لے گا، مگر خود ساختہ دین پر عمل کرنے والا، مثلاً اپنے یا لوگوں کے بنائے ہوئے ورد و وظائف یا دوسرے کام کرنے والا شخص تو جو کچھ کر رہا ہے نیکی سمجھ کر کرتا ہے، اسے توبہ کی توفیق کیسے ہو سکتی ہے؟ اس لیے جب شیطان کسی کو کافر بنانے میں کامیاب نہیں ہوتا تو اس کی سب سے بڑی کامیابی یہ ہے کہ اسے کسی بدعت پر لگا دے، جسے وہ نیکی سمجھ کر کرتا رہے گا اور جتنی محنت سے کرے گا اتنا ہی اللہ تعالیٰ کی رحمت سے دور ہوتا جائے گا، کیونکہ ہر بدعت گمراہی ہے اور ہر گمراہی آگ میں ہے۔ ¤ ➋ { فَاِنَّ اللّٰهَ يُضِلُّ مَنْ يَّشَآءُ وَ يَهْدِيْ مَنْ يَّشَآءُ :} یعنی ایسے لوگوں کا وجود اللہ تعالیٰ کی مشیّت ہی کی وجہ سے ہے اور بعض کا گمراہ ہونا اور بعض کا ہدایت پانا اس کی حکمت کا نتیجہ ہے، وہ چاہتا تو سب ہدایت پا جاتے مگر وہ جسے چاہتا ہے گمراہ کر دیتا ہے اور جسے چاہتا ہے ہدایت دیتا ہے، اگرچہ اس کا ہدایت دینا یا گمراہ کرنا بھی آدمی کے عمل یا استعداد کا نتیجہ ہوتا ہے، جیسا کہ فرمایا : «وَ مَا يُضِلُّ بِهٖۤ اِلَّا الْفٰسِقِيْنَ» [ البقرۃ : ۲۶ ] ’’اور وہ اس کے ساتھ گمراہ نہیں کرتا مگر فاسقوں کو۔‘‘ ¤ ➌ {فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرٰتٍ : ’’ حَسَرٰتٍ ‘‘} واحد {’’حَسْرَةٌ‘‘} کسی چیز کے ہاتھ سے نکلنے پر شدید غم اور افسوس، یعنی آپ کا کام دعوت اور پیغام پہنچانا ہے، انھیں راہ راست پر لے آنا آپ کے بس میں نہیں۔ اس لیے یہ نہیں ہونا چاہیے کہ ان کے ایمان نہ لانے پر حسرت و افسوس کی وجہ سے آپ کی جان ہی نکل جائے۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی ہے کہ کفار کا کفر پر قائم رہنا اللہ کی مشیّت سے ہے، آپ اپنا کام سر انجام دیں، لوگوں کا ایمان لانا آپ کی ذمہ داری نہیں۔ اس آیت سے اس بات کا اظہار بھی ہوتا ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو لوگوں کے ایمان نہ لانے پر کس قدر افسوس اور صدمہ ہوتا تھا، حتیٰ کہ قریب تھا کہ آپ اس غم میں جان ہی سے گزر جائیں، جیسا کہ فرمایا : « فَلَعَلَّكَ بَاخِعٌ نَّفْسَكَ عَلٰۤى اٰثَارِهِمْ اِنْ لَّمْ يُؤْمِنُوْا بِهٰذَا الْحَدِيْثِ اَسَفًا» [ الکہف : ۶ ] ’’پس شاید تو اپنی جان ان کے پیچھے غم سے ہلاک کر لینے والا ہے، اگر وہ اس بات پر ایمان نہ لائے۔‘‘ اور فرمایا : « لَعَلَّكَ بَاخِعٌ نَّفْسَكَ اَلَّا يَكُوْنُوْا مُؤْمِنِيْنَ» [ الشعراء : ۳ ] ’’شاید تو اپنے آپ کو ہلاک کرنے والا ہے، اس لیے کہ وہ مومن نہیں ہوتے۔‘‘ ¤ ➍ { اِنَّ اللّٰهَ عَلِيْمٌۢ بِمَا يَصْنَعُوْنَ :} اس جملے میں دھمکی ہے کہ ایک وقت آئے گا جب اللہ تعالیٰ انھیں ان کے برے اعمال کی سزا دے گا۔ کسی حاکم کا مجرم کو یہ کہنا کہ میں تمھاری حرکتوں سے خوب واقف ہوں، دراصل اسے آگاہ کرنا ہوتا ہے کہ تمھیں اس کی سزا دے کر رہوں گا۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { وَ اللّٰهُ الَّذِيْۤ اَرْسَلَ الرِّيٰحَ فَتُثِيْرُ سَحَابًا …:} قرآن کریم میں موت کے بعد زندگی پر عموماً خشک زمین کے ہرا ہونے سے استدلال کیا گیا ہے، جیسا کہ سورۂ حج میں فرمایا : «وَ تَرَى الْاَرْضَ هَامِدَةً فَاِذَاۤ اَنْزَلْنَا عَلَيْهَا الْمَآءَ اهْتَزَّتْ وَ رَبَتْ وَ اَنْۢبَتَتْ مِنْ كُلِّ زَوْجٍۭ بَهِيْجٍ (5) ذٰلِكَ بِاَنَّ اللّٰهَ هُوَ الْحَقُّ وَ اَنَّهٗ يُحْيِ الْمَوْتٰى وَ اَنَّهٗ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ (6) وَّ اَنَّ السَّاعَةَ اٰتِيَةٌ لَّا رَيْبَ فِيْهَا وَ اَنَّ اللّٰهَ يَبْعَثُ مَنْ فِي الْقُبُوْرِ » [ الحج : ۵ تا ۷ ] ’’اور تو زمین کو مردہ پڑی ہوئی دیکھتا ہے، پھر جب ہم اس پر پانی اتارتے ہیں تو وہ لہلہاتی ہے اور ابھرتی ہے اور ہر خوبصورت قسم میں سے اگاتی ہے۔ یہ اس لیے ہے کہ اللہ ہی حق ہے اور (اس لیے) کہ وہی مردوں کو زندہ کرے گا اور (اس لیے) کہ وہ ہر چیز پر پوری طرح قادر ہے۔ اور (اس لیے) کہ قیامت آنے والی ہے، اس میں کوئی شک نہیں اور (اس لیے) کہ اللہ ان لوگوں کو اٹھائے گا جو قبروں میں ہیں۔‘‘ سب لوگ دیکھتے ہیں کہ بارش ہوتی ہے تو خشک، بنجر اور مردہ زمین یک دم زندہ ہو کر نباتات سے لہلہا اٹھتی ہے، پھر اس سے صرف نباتات ہی پیدا نہیں ہوتے بلکہ ہزاروں جانور یعنی مینڈک، حشرات الارض اور جھینگر وغیرہ بھی پیدا ہو کر اپنی اپنی بولیاں بولنے لگتے ہیں۔ یہ آخر کہاں سے پیدا ہو گئے؟ بالکل یہی کیفیت انسانوں کے زمین سے جی اٹھنے کی ہو گی، انسان کا حال عجیب ہے کہ جو چیز اس کے مشاہدے میں آتی ہے اسے من و عن تسلیم کر لیتا ہے، مگر بالکل اس جیسی دوسری چیز کا انکار صرف اس لیے کر دیتا ہے کہ وہ اس کے مشاہدے میں نہیں آئی، حالانکہ دونوں میں کوئی فرق نہیں ہوتا۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {مَنْ كَانَ يُرِيْدُ الْعِزَّةَ فَلِلّٰهِ الْعِزَّةُ جَمِيْعًا:} عزت کا معنی غلبہ ہے، جیسا کہ فرمایا : « وَ عَزَّنِيْ فِي الْخِطَابِ» [ صٓ : ۲۳ ] ’’اور اس نے بات کرنے میں مجھ پر بہت سختی کی۔‘‘ اس آیت کی تفسیر دو طرح سے ہو سکتی ہے، پہلی جو سب سے واضح ہے، یہ ہے کہ جو شخص چاہتا ہے کہ اسے عزت و غلبہ حاصل ہو تو اسے جان لینا چاہیے کہ عزت سب کی سب اللہ کے ہاتھ میں ہے، جیسا کہ فرمایا : « قُلِ اللّٰهُمَّ مٰلِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَآءُ وَ تَنْزِعُ الْمُلْكَ مِمَّنْ تَشَآءُ وَ تُعِزُّ مَنْ تَشَآءُ وَ تُذِلُّ مَنْ تَشَآءُ بِيَدِكَ الْخَيْرُ اِنَّكَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ » [ اآل عمران : ۲۶ ] ’’کہہ دے اے اللہ! بادشاہی کے مالک! تو جسے چاہے بادشاہی دیتا ہے اور جس سے چاہے بادشاہی چھین لیتا ہے اور جسے چاہے عزت دیتا ہے اور جسے چاہے ذلیل کر دیتا ہے، تیرے ہی ہاتھ میں ہر بھلائی ہے، بے شک تو ہر چیز پر پوری طرح قادر ہے۔‘‘ اس میں ان کفار و مشرکین اور بعض نام نہاد مسلمانوں کا رد ہے جو غیر اللہ کی عبادت کرتے ہیں، تاکہ وہ ان کے لیے عزت اور غلبے کا باعث بنیں، فرمایا : « وَ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اٰلِهَةً لِّيَكُوْنُوْا لَهُمْ عِزًّا (81) كَلَّا سَيَكْفُرُوْنَ بِعِبَادَتِهِمْ وَ يَكُوْنُوْنَ عَلَيْهِمْ ضِدًّا » [ مریم : ۸۱، ۸۲ ] ’’اور انھوں نے اللہ کے سوا اور معبود بنا لیے، تاکہ وہ ان کے لیے باعث عزت ہوں۔ ہرگز ایسا نہ ہوگا، عنقریب وہ ان کی عبادت کا انکار کر دیں گے اور ان کے خلاف مد مقابل ہوں گے۔‘‘ اور ان ضعیف الایمان اور منافق قسم کے لوگوں کا بھی رد ہے جو کفار سے دوستی کرتے ہیں، تاکہ دنیا میں باعزت اور غالب ہو کر زندگی بسر کر سکیں، جیسا کہ فرمایا : « بَشِّرِ الْمُنٰفِقِيْنَ بِاَنَّ لَهُمْ عَذَابًا اَلِيْمَا (138) ا۟لَّذِيْنَ يَتَّخِذُوْنَ الْكٰفِرِيْنَ اَوْلِيَآءَ مِنْ دُوْنِ الْمُؤْمِنِيْنَ اَيَبْتَغُوْنَ عِنْدَهُمُ الْعِزَّةَ فَاِنَّ الْعِزَّةَ لِلّٰهِ جَمِيْعًا » [ النساء : ۱۳۸، ۱۳۹ ] ’’منافقوں کو خوش خبری دے دے کہ ان کے لیے ایک درد ناک عذاب ہے۔ وہ جو کافروں کو مومنوں کے سوا دوست بناتے ہیں، کیا وہ ان کے پاس عزت ڈھونڈتے ہیں؟ تو بے شک عزت سب اللہ کے لیے ہے۔‘‘ یعنی جو شخص جاننا چاہتا ہے کہ عزت و غلبے کا مالک کون ہے، وہ جان لے کہ عزت و غلبہ سب اللہ تعالیٰ کے لیے ہے۔ اب جو بھی عزت و غلبہ چاہتا ہو وہ اس سے طلب کرے، کیونکہ جس کسی کو بھی عزت ملی ہے یا ملے گی اسی سے ملی ہے اور اسی سے ملے گی۔ ¤ دوسری تفسیر یہ ہے کہ جو شخص اسلام کا مقابلہ کر کے اس پر غالب ہونا چاہتا ہے وہ جان لے کہ عزت و غلبہ تو سب اللہ تعالیٰ کے لیے ہے، جو اس پر غالب آنے کی کوشش کرے گا وہ بری طرح مغلوب ہو گا۔ ¤ ➋ {اِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ : ’’ الْكَلِمُ ‘‘ ’’كَلِمَةٌ‘‘} کی جمع نہیں، ورنہ {’’ يَصْعَدُ ‘‘} کے بجائے {’’تَصْعَدُ‘‘} کا لفظ آتا اور اس کی صفت مؤنث آتی، بلکہ یہ اسم جنس ہے جو واحد و جمع سب پر بولا جاتا ہے۔ جب اس کا ایک فرد بیان کرنا مقصود ہو تو اس کے ساتھ ’’تاء‘‘ لگا دیتے ہیں، جیسے {’’تَمْرٌ‘‘} کھجور، ایک ہو یا بہت سی ہوں، لیکن اگر ایک کھجور کہنا ہو تو {’’تَمْرَةٌ‘‘} کہا جائے گا۔ ¤ ➌ اس میں ان چیزوں کا بیان ہے جن کے ذریعے سے عزت حاصل ہوتی ہے اور وہ ہیں ایمان اور عمل صالح۔ ¤ ➍ {’’ الْكَلِمُ الطَّيِّبُ ‘‘} (پاکیزہ بات) سے مراد بعض نے کلمہ توحید ’’لاالٰہ الا اللہ ‘‘ لیا ہے، مگر لفظ عام ہے، اس میں کلمہ اسلام کے ساتھ ذکر، دعا، تلاوتِ قرآن، تعلیم، تربیت اور دعوت سبھی شامل ہیں، یعنی ہر پاکیزہ بات اسی کی طرف چڑھتی ہے اور وہی اسے قبول کرتا اور بلندی عطا کرتا ہے۔ ناپاک اور خبیث باتیں عروج حاصل کرہی نہیں سکتیں۔ ¤ ➎ {وَ الْعَمَلُ الصَّالِحُ يَرْفَعُهٗ : } اس کی تفسیر میں بھی تین احتمال ہیں، پہلا یہ کہ {’’هٗ‘‘} ضمیر سے مراد الکلم الطیب ہے، یعنی عمل صالح الکلم الطیب (پاکیزہ بات) کو بلند کرتا ہے۔ کوئی کلمہ اپنی جگہ کتنا پاکیزہ ہو قبول اسی وقت ہوتا ہے جب اس کے ساتھ عمل بھی نیک ہو، یعنی عمل کا نیک ہونا الکلم الطیب کی قبولیت کے لیے شرط ہے۔ نیک عمل وہ ہے جو خالص اللہ کے لیے ہو اور سنت کے مطابق ہو۔ دیکھیے سورۂ کہف کی آخری آیت۔ دوسرا یہ کہ {’’يَرْفَعُ‘‘} کا فاعل{ ’’ الْكَلِمُ الطَّيِّبُ ‘‘} کی ضمیر ہو اور {’’هٗ‘‘ } کی ضمیر سے مراد عمل صالح ہو، یعنی پاکیزہ بات عمل صالح کو بلند کرتی ہے۔ یہ اس صورت میں ہے کہ الکلم الطیب سے مراد ’’لاالٰہ الا اللہ‘‘ ہو، یعنی ایمان اور کلمہ توحید کے بغیر کوئی عمل قبول نہیں، جیسا کہ فرمایا : «مَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُنْثٰى وَ هُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهٗ حَيٰوةً طَيِّبَةةً » [ النحل : ۹۷ ] ’’جو بھی نیک عمل کرے، مرد ہو یا عورت اور وہ مومن ہو تو یقینا ہم اسے ضرور زندگی بخشیں گے، پاکیزہ زندگی۔‘‘ اور تیسرا احتمال یہ ہے کہ{ ’’يَرْفَعُ‘‘} میں فاعل کی ضمیر سے مراد اللہ تعالیٰ ہے۔ مطلب یہ ہو گا کہ جو بھی عمل صالح ہے اللہ اس  کو بلند کرتا ہے، یعنی اسے قبول کرتا اور اس کی جزا عطا کرتا ہے۔ یہ تینوں معنی یہاں مراد ہو سکتے ہیں اور تینوں درست ہیں۔ شاہ عبد القادر رحمہ اللہ نے ارادۂ عزت، صعودِ کلم طیب اور رفع عمل صالح کی باہمی مناسبت بیان کرتے ہوئے لکھا ہے : ’’یعنی عزت اللہ کے ہاتھ میں ہے، تمھارے ذکر اور بھلے کام چڑھتے جاتے ہیں جب اپنی حد کو پہنچیں گے تب بدی پر غلبہ (حاصل) کریں گے، کفر دفع ہوگا (اور) اسلام کو عزت (نصیب) ہو گی۔‘‘ ¤ ➏ {وَ الَّذِيْنَ يَمْكُرُوْنَ السَّيِّاٰتِ لَهُمْ عَذَابٌ شَدِيْدٌ :} مکر کا معنی ہے خفیہ تدبیر، وہ اچھی ہو یا بری، اکثر مذموم تدبیر کے لیے استعمال ہوتا ہے۔ {’’ يَمْكُرُوْنَ السَّيِّاٰتِ ‘‘} سے مراد وہ لوگ ہیں جو الکلم الطیب کے بجائے باطل اور خبیث باتیں لے کر اٹھتے ہیں اور مکاریوں اور چالاکیوں سے انھیں غالب کر نے کی کوشش کرتے ہیں، ان کے لیے بہت سخت عذاب ہے۔ اس کے اولین مصداق وہ لوگ ہیں جنھوں نے دار الندوہ میں رسول اللہ صلی اللہ علیہ وسلم کو قید یا قتل یا جلا وطن کرنے کا منصوبہ بنایا۔ دیکھیے سورۂ انفال (۳۰) ان کے علاوہ وہ سب لوگ اس میں داخل ہیں جو اسلام کے خلاف سازشیں کر کے اس پر غلبے کی کوشش کرتے ہیں۔ ¤ ➐ { وَ مَكْرُ اُولٰٓىِٕكَ هُوَ يَبُوْرُ:} یعنی انھی کی تدبیر ناکام و نامراد ہو گی، اللہ کی تدبیر کبھی ناکام نہیں ہو گی، جیسا کہ فرمایا : « وَ مَكَرُوْا وَ مَكَرَ اللّٰهُ وَ اللّٰهُ خَيْرُ الْمٰكِرِيْنَ » [ آل عمران : ۵۴ ] ’’اور انھوں نے خفیہ تدبیر کی اور اللہ نے بھی خفیہ تدبیر کی اور اللہ سب خفیہ تدبیر کرنے والوں سے بہتر ہے۔‘‘ چنانچہ آپ صلی اللہ علیہ وسلم کو قتل کرنے کی سازش کرنے والے اس میں کامیاب نہ ہوئے، بلکہ بدر میں ہلاک ہوئے، پھر باقی فتح مکہ میں مغلوب ہوئے۔ مزید دیکھیے سورۂ فاطر (۴۳)، طور (۴۲)، رعد (۴۲) اور سورۂ انعام (۱۲۴، ۱۲۵)۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {وَ اللّٰهُ خَلَقَكُمْ مِّنْ تُرَابٍ …:} اس سے پہلے بارش سے زمین کے زندہ ہونے کو موت کے بعد زندگی کی دلیل کے طور پر پیش فرمایا، اب اس آیت میں موت کے بعد زندگی کی تین دلیلیں پیش فرمائیں جو تینوں عقلی ہیں، پہلی انسان کا مٹی سے پیدا ہو کر مختلف مراحل سے گزر کر موت کی آغوش میں جا بسنا ہے، جیسا کہ فرمایا : « يٰۤاَيُّهَا النَّاسُ اِنْ كُنْتُمْ فِيْ رَيْبٍ مِّنَ الْبَعْثِ فَاِنَّا خَلَقْنٰكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ  ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِنْ مُّضْغَةٍ مُّخَلَّقَةٍ وَّ غَيْرِ مُخَلَّقَةٍ لِّنُبَيِّنَ لَكُمْ وَ نُقِرُّ فِي الْاَرْحَامِ مَا نَشَآءُ اِلٰۤى اَجَلٍ مُّسَمًّى ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْۤا اَشُدَّكُمْ وَ مِنْكُمْ مَّنْ يُّتَوَفّٰى وَ مِنْكُمْ مَّنْ يُّرَدُّ  اِلٰۤى اَرْذَلِ الْعُمُرِ لِكَيْلَا يَعْلَمَ مِنْۢ بَعْدِ عِلْمٍ شَيْـًٔا » [ الحج : ۵ ] ’’اے لوگو! اگر تم اٹھائے جانے کے بارے میں کسی شک میں ہو تو بے شک ہم نے تمھیں حقیر مٹی سے پیدا کیا، پھر ایک قطرے سے، پھر کچھ جمے ہوئے خون سے، پھر گوشت کی ایک بوٹی سے، جس کی پوری شکل بنائی ہوئی ہے اور جس کی پوری شکل نہیں بنائی ہوئی، تاکہ ہم تمھارے لیے واضح کریں اور ہم جسے چاہتے ہیں ایک مقررہ مدت تک رحموں میں ٹھہرائے رکھتے ہیں، پھر ہم تمھیں ایک بچے کی صورت میں نکالتے ہیں، پھر تاکہ تم اپنی جوانی کو پہنچو اور تم میں سے کوئی وہ ہے جو قبض کر لیا جاتا ہے اور تم میں سے کوئی وہ ہے جو سب سے نکمّی عمر کی طرف لوٹایا جاتا ہے، تاکہ وہ جاننے کے بعد کچھ نہ جانے۔‘‘ یعنی جس اللہ نے پہلے مٹی سے پیدا فرمایا وہ انسان کے مٹی ہونے کے بعد دوبارہ بھی اسے پیدا فرما سکتا ہے۔ ¤ ➋ { وَ مَا تَحْمِلُ مِنْ اُنْثٰى وَ لَا تَضَعُ اِلَّا بِعِلْمِهٖ :} یعنی کسی بھی مادہ کے حمل سے لے کر وضع تک کے تمام مراحل جس ہستی کے علم میں ہیں اور اسی کے کمال قدرت سے سر انجام پا رہے ہیں، اس کے لیے اس انسان کو مرنے کے بعد دوبارہ بنا دینا کیا مشکل ہے؟ اس کی ہم معنی آیت کے لیے دیکھیے سورۂ حج کی آیت (۸)۔ ¤ ➌ {وَ مَا يُعَمَّرُ مِنْ مُّعَمَّرٍ … :} یہ بعث بعد الموت کی تیسری دلیل ہے، یعنی کسی زیادہ عمر والے کو زیادہ عمر دی جاتی ہے، یا کم عمر والے کو کم عمر دی جاتی ہے، تو یہ سب کچھ ایک کتاب میں درج ہے اور اللہ تعالیٰ نے اسے پہلے ہی طے فرما دیا ہے۔ تو جس ہستی نے ہر زیادہ عمر والے کی عمر اور کم عمر والے کی عمر پہلے ہی لکھ دی ہے اور جو ہر شخص کی زندگی کے ایک ایک لمحے سے واقف ہے اس کے لیے انھیں دوبارہ بنانے میں کیا دشواری ہو سکتی ہے؟ ¤ ➍ یعنی اگرچہ تمھارے لیے اور پوری مخلوق کے لیے ناممکن ہے کہ تم پہلے ہی ان باتوں کو جان لو یا ان کا فیصلہ کر لو، مگر اللہ تعالیٰ کے لیے یہ بالکل آسان ہے، کیونکہ اسے پہلے ہی ان سب باتوں کا علم ہے اور وہ ہمیشہ سے یہ سب کچھ کرنے پر پوری طرح قادر ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) {وَ مَا يَسْتَوِي الْبَحْرٰنِ … :} موت کے بعد زندگی کے لیے بارش کے ساتھ مردہ زمین کو زندہ کرنے کی مثال اور دوسری مثالوں کے بعد دوبارہ اللہ تعالیٰ کی وحدانیت اور کمال قدرت کے مزید دلائل کا بیان فرمایا۔ ان میں سے ایک دلیل میٹھے دریاؤں اور نمکین سمندروں کا بظاہر ایک ہونے اور کئی منافع میں ایک جیسا ہونے کے باوجود کئی چیزوں میں ایک دوسرے سے مختلف ہونا ہے۔ عذب فرات کی مفصل تفسیر کے لیے دیکھیے سورۂ فرقان (۵۳) اور باقی آیت کی تفسیر کے لیے دیکھیے سورۂ نحل(۱۴)۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ { يُوْلِجُ الَّيْلَ فِي النَّهَارِ …:} اس کی تفسیر کے لیے دیکھیے سورۂ آل عمران (۲۷)، حج (۶۱) اور سورۂ لقمان (۲۹)۔ ¤ ➋ { كُلٌّ يَّجْرِيْ لِاَجَلٍ مُّسَمًّى :} یعنی یہ سب قیامت کے دن تک چل رہے ہیں، جب قیامت آئے گی تو ان کا چلنا موقوف ہو جائے گا اور یہ نظام باقی نہیں رہے گا۔ ¤ ➌ { وَ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِهٖ …:’’ قِطْمِيْرٍ ‘‘} کھجور کی گٹھلی پر باریک سے چھلکے کو کہتے ہیں، یعنی جس کی صفات اوپر بیان ہوئی ہیں حقیقت میں یہ ہے تمھارا سچا پروردگار، جو اکیلا زمین و آسمان کا بادشاہ ہے اور جنھیں تم حاجت روا اور مشکل کُشا سمجھ کر پکارتے ہو وہ بے چارے بادشاہ تو کیا ہوں گے، کھجور کی گٹھلی پر باریک سی جھلی کے مالک بھی نہیں۔ بعض مفسرین نے {’’ مِنْ دُوْنِهٖ ‘‘} سے مراد بت قرار دیے ہیں، مگر حقیقت یہ ہے کہ اس میں اللہ تعالیٰ کے سوا جو بھی ہے سب شامل ہیں، حتیٰ کہ اللہ تعالیٰ نے سید الاولین و الآخرین صلی اللہ علیہ وسلم کو حکم دیا کہ برملا اعلان کر دیں کہ وہ نہ اپنے لیے کسی نفع یا نقصان کے مالک ہیں، نہ کسی دوسرے کے لیے، پھر کسی اور پیر فقیر کی کیا حیثیت ہے؟ دیکھیے سورۂ اعراف (۱۸۸) اور سورۂ جنّ (۲۱) اس کی ایک دلیل اگلی آیت کے یہ الفاظ ہیں : « وَ يَوْمَ الْقِيٰمَةِ يَكْفُررُوْنَ بِشِرْكِكُمْ» [ فاطر : ۱۴ ] ’’اور قیامت کے دن وہ تمھارے شرک کا انکار کریں گے۔‘‘ ظاہر ہے قیامت کے دن ان کے شرک کا انکار بت نہیں، بلکہ وہ فرشتے، انبیاء اور صالحین کریں گے جن کے وہ بُت بناتے تھے اور جنھیں وہ پکارتے رہے تھے، جیسا کہ اللہ تعالیٰ نے عیسیٰ علیہ السلام کا قول نقل فرمایا ہے۔ دیکھیے سورۂ مائدہ (۱۱۶)۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { اِنْ تَدْعُوْهُمْ لَا يَسْمَعُوْا دُعَآءَكُمْ:} جیسا کہ دوسری جگہ فرمایا : «وَ مَنْ اَضَلُّ مِمَّنْ يَّدْعُوْا مِنْ دُوْنِ اللّٰهِ مَنْ لَّا يَسْتَجِيْبُ لَهٗۤ اِلٰى يَوْمِ الْقِيٰمَةِ وَ هُمْ عَنْ دُعَآىِٕهِمْ غٰفِلُوْنَ » [ الأحقاف : ۵ ] ’’ اور اس سے بڑھ کر کون گمراہ ہے جو اللہ کے سوا انھیں پکارتا ہے جو قیامت کے دن تک اس کی دعا قبول نہیں کریں گے اور وہ ان کے پکارنے سے بے خبر ہیں۔‘‘ ¤ ➋ { وَ لَوْ سَمِعُوْا مَا اسْتَجَابُوْا لَكُمْ:} اگر وہ سن بھی لیں تو تمھیں کوئی فائدہ نہیں پہنچا سکتے، کیونکہ ان کے پاس کوئی اختیار ہی نہیں، جیسا کہ فرمایا : « اِنَّ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ عِبَادٌ اَمْثَالُكُمْ فَادْعُوْهُمْ فَلْيَسْتَجِيْبُوْا لَكُمْ اِنْ كُنْتُممْ صٰدِقِيْنَ» [الأعراف : ۱۹۴ ] ’’بے شک جنھیں تم اللہ کے سوا پکارتے ہو وہ تمھارے جیسے بندے ہیں، پس انھیں پکارو تو لازم ہے کہ وہ تمھاری دعا قبول کریں، اگر تم سچے ہو۔‘‘ اور فرمایا : « لَهٗ دَعْوَةُ الْحَقِّ وَ الَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِهٖ لَا يَسْتَجِيْبُوْنَ۠  لَهُمْ بِشَيْءٍ اِلَّا كَبَاسِطِ كَفَّيْهِ اِلَى الْمَآءِ لِيَبْلُغَ فَاهُ وَ مَا هُوَ بِبَالِغِهٖ وَ مَا دُعَآءُ الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ » [ الرعد : ۱۴ ] ’’برحق پکارنا صرف اسی کے لیے ہے اور جن کو وہ اس کے سوا پکارتے ہیں وہ ان کی دعا کچھ بھی قبول نہیں کرتے، مگراس شخص کی طرح جو اپنی دونوں ہتھیلیاں پانی کی طرف پھیلانے والا ہے، تاکہ وہ اس کے منہ تک پہنچ جائے، حالانکہ وہ اس تک ہرگز پہنچنے والا نہیں اور نہیں ہے کافروں کا پکارنا مگر سراسر بے سود۔‘‘ ¤ ➌ { وَ يَوْمَ الْقِيٰمَةِ يَكْفُرُوْنَ بِشِرْكِكُمْ :} اس کی مفصل تفسیر کے لیے دیکھیے سورۂ مریم (۸۲) اور سورۂ قصص (۶۲، ۶۳)۔ ¤ ➍ { وَ لَا يُنَبِّئُكَ مِثْلُ خَبِيْرٍ :} عرب میں یہ کلمہ ضربُ المثل ہے کہ جب کسی نادان کو کسی دانا مجرب نے انجام کار سے آگاہ کیا تو وہ تنبیہ کر دیتا ہے کہ اس نصیحت کو گرہ میں باندھ لے اور کہتا ہے : {’’لَا يُنَبِّئُكَ مِثْلُ خَبِيْرٍ‘‘} یعنی جو شخص خبردار ہے، جس طرح اس نے تجھے بتا دیا ویساکوئی نہیں بتائے گا، پھر ظاہر ہے اللہ تعالیٰ سے بڑھ کر کون علیم و خبیر ہو سکتا ہے۔ (مواہب) {’’ خَبِيْرٍ ‘‘} کا معنی پوری خبر رکھنے والا ہے اور پوری خبر رکھنے والا خود اللہ تعالیٰ ہے، اس کے سوا سب کا علم ناقص ہے اور پوری خبر رکھنے والے کی طرح کوئی بھی خبر نہیں دے سکتا اور اس نے تمھیں بتا دیا ہے کہ اللہ کے سوا کوئی پکار نہیں سنتا، بالفرض سن بھی لے تو درخواست قبول نہیں کر سکتا اور قیامت کے دن وہ سب تمھارے شرک کا انکار کردیں گے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ {يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ … :} خبر {’’ الْفُقَرَآءُ ‘‘} پر الف لام آنے سے حصر اور تاکید کا معنی پیدا ہو گیا کہ لوگو! تم ہی اللہ کی طرف محتاج ہو۔ اسی طرح {’’ وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ ‘‘} میں ضمیر فصل {’’ هُوَ ‘‘} اور خبر {’’ الْغَنِيُّ ‘‘} پر الف لام سے حصر کامعنی پیدا ہوا کہ صرف اللہ ہی ہے جو سب سے بے پروا، تمام تعریفوں کے لائق ہے۔ ¤ ➋ یہ بیان کرنے کے بعد کہ آسمان و زمین کا مالک اللہ تعالیٰ ہے اور اس کے سوا جنھیں پکارا جاتا ہے وہ نہ نفع پہنچا سکتے ہیں نہ نقصان سے بچا سکتے ہیں، حتیٰ کہ وہ ایک قطمیر (کھجور کی گٹھلی پر باریک چھلکا) کے مالک بھی نہیں۔ اب پچھلے سارے بیان کے خلاصے اور نتیجے کے طور پر فرمایا، لوگو! تم ہی اللہ تعالیٰ کے ہر طرح سے محتاج ہو، اپنے وجود میں، اپنی بقا اور اپنی ہر ضرورت کے لیے، لہٰذا اسی سے مانگو اور اسی کی عبادت کرو۔ ¤ ➌ { وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ :} یعنی دوسرے سب محتاج ہیں، ایک اللہ تعالیٰ ہے جو غنی ہے، کسی کا محتاج نہیں۔ غنی کے ساتھ حمید اس لیے فرمایا کہ غنی ایسا بھی ہو سکتا ہے جو کسی کا محتاج تو نہ ہو مگر نہ اس میں کوئی خوبی ہو نہ کسی کو کوئی فائدہ پہنچاتا ہو۔ فرمایا، اللہ ایسا غنی ہے کہ وہ تمام کمالات اور خوبیوں کا مالک ہے، تمھیں اور تمام مخلوق کو حاصل ہر نعمت اسی کی عطا کردہ ہے، اس لیے وہی تمام تعریفوں اور تمام شکر کا مستحق ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 17،16) ➊ { اِنْ يَّشَاْ يُذْهِبْكُمْ … :} زمخشری نے فرمایا : ’’اس آیت میں شریک بنانے کی وجہ سے ان پر غضب کا اظہار ہے، جیسا کہ فرمایا : «وَ اِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُوْنُوْۤا اَمْثَالَكُمْ » [ محمد : ۳۸ ] ’’اور اگر تم پھر جاؤ گے تو وہ تمھاری جگہ تمھارے سوا اور لوگوں کو لے آئے گا، پھر وہ تمھاری طرح نہیں ہوں گے۔‘‘ ¤ ➋ غضب کے اظہار کے ساتھ اپنے غنی ہونے کا بھی بیان ہے کہ اگر اللہ تعالیٰ تمھیں ہلاک کرنا چاہے تو کر سکتا ہے، کیونکہ اس نے تمھیں اپنی کوئی محتاجی دور کرنے کے لیے پیدا نہیں فرمایا۔ نہ تمھارے نہ ہونے سے اس کے ملک میں کوئی کمی واقع ہو گی، نہ یہ کہ وہ تمھارے جیسے اور پیدا نہیں کر سکتا، وہ چاہے تو تمھیں ختم کرکے نئی مخلوق پیدا کر لے، جو تم سے ہر طرح بہتر ہو اور یہ بات اللہ کے لیے کچھ مشکل نہیں۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17،16) ➊ { اِنْ يَّشَاْ يُذْهِبْكُمْ … :} زمخشری نے فرمایا : ’’اس آیت میں شریک بنانے کی وجہ سے ان پر غضب کا اظہار ہے، جیسا کہ فرمایا : «وَ اِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُوْنُوْۤا اَمْثَالَكُمْ » [ محمد : ۳۸ ] ’’اور اگر تم پھر جاؤ گے تو وہ تمھاری جگہ تمھارے سوا اور لوگوں کو لے آئے گا، پھر وہ تمھاری طرح نہیں ہوں گے۔‘‘ ¤ ➋ غضب کے اظہار کے ساتھ اپنے غنی ہونے کا بھی بیان ہے کہ اگر اللہ تعالیٰ تمھیں ہلاک کرنا چاہے تو کر سکتا ہے، کیونکہ اس نے تمھیں اپنی کوئی محتاجی دور کرنے کے لیے پیدا نہیں فرمایا۔ نہ تمھارے نہ ہونے سے اس کے ملک میں کوئی کمی واقع ہو گی، نہ یہ کہ وہ تمھارے جیسے اور پیدا نہیں کر سکتا، وہ چاہے تو تمھیں ختم کرکے نئی مخلوق پیدا کر لے، جو تم سے ہر طرح بہتر ہو اور یہ بات اللہ کے لیے کچھ مشکل نہیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { وَ لَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰى :} اس آیت میں مشرکین کے اس غلط خیال کا ردد فرمایا کہ قیامت کے دن کچھ لوگ ان کے گناہ اپنے ذمے لے کر انھیں چھڑا لیں گے، جیسا کہ نصرانیوں کا کہنا ہے کہ مسیح علیہ السلام ان کے گناہوں کی پاداش میں سولی پر چڑھ گئے اور بعض کلمہ گو حضرات کا کہنا ہے کہ حسین رضی اللہ عنہ کی محبت کی وجہ سے انھیں قیامت کے دن کوئی نہیں پوچھے گا، کیونکہ انھوں نے شہید ہو کر اپنے ساتھ محبت کرنے والوں کے گناہوں کا بوجھ خود اٹھا لیا ہے۔ آیت میں {’’ وَازِرَةٌ ‘‘} محذوف لفظ {’’نَفْسٌ‘‘} کی صفت ہے، جو مؤنث ہے، اس لیے صفت بھی مؤنث آئی ہے اور یہ لفظ اس لیے اختیار فرمایا کہ اس میں مرد عورتیں سب آ جاتے ہیں۔ یعنی کوئی بوجھ اٹھانے والی جان کسی دوسری جان کے گناہوں کا بوجھ نہیں اٹھائے گی۔ ¤ ➋ { وَ اِنْ تَدْعُ مُثْقَلَةٌ اِلٰى حِمْلِهَا … :} یعنی نہ یہ ہوگا کہ کوئی اپنے آپ کسی کے گناہوں کا بوجھ اٹھا لے اور نہ یہ ہوگا کہ کسی کے پکارنے اور درخواست کرنے سے کوئی کسی کا بوجھ اٹھالے، بلکہ اگر کوئی قرابت دار اپنے قریبی رشتہ دار کو اس مقصد کے لیے بلائے گا، حتیٰ کہ باپ ہو یا بیٹا تو وہ بھی اس کے بوجھ سے ذرہ برابر اپنے ذمے نہیں لے گا۔ ہر ایک کو اپنی پڑی ہوگی اور ہر ایک دوسرے سے بھاگے گا۔ بلانے پر بھی بوجھ نہ اٹھانے کا ذکر الگ اس لیے فرمایا کہ عرب کے ہاں معروف تھا کہ جب کوئی تمھیں مدد کے لیے بلائے تو ہر صورت اس کی مدد کرو۔ فرمایا، وہاں بلانے پر بھی کوئی مدد نہیں کرے گا۔ دیکھیے سورۂ لقمان (۳۳) اور عبس (۳۳تا ۳۷) مزید دیکھیے سورۂ انعام (۱۶۴)، بنی اسرائیل (۱۵) اور عنکبوت (۱۲، ۱۳)۔ ¤ ➌ { اِنَّمَا تُنْذِرُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ … :} اس میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ آپ ان لوگوں کے رویے سے دلبرداشتہ اور غم زدہ نہ ہوں جو آپ کی دعوت سن کر ایمان نہیں لاتے، کیونکہ آپ صرف ان لوگوں کو ڈرا سکتے ہیں جو اپنے رب کو دیکھے بغیر اس سے ڈرتے ہیں اور جب کوئی بھی نہیں دیکھ رہا ہوتا اس وقت بھی اس سے ڈرتے ہیں ({’’ بِالْغَيْبِ ‘‘} کے دونوں معنی ہوسکتے ہیں) اور نماز قائم کرتے ہیں۔ مطلب یہ کہ آپ کے ڈرانے سے وہی لوگ فائدہ حاصل کر سکتے ہیں جو اللہ تعالیٰ کو دیکھے بغیر اس پر ایمان رکھتے، اس سے ڈرتے اور اس کے احکام پر عمل کرتے ہیں اور جو ان دیکھے رب کو مانتا ہی نہیں اور ہٹ دھرمی اختیار کرتا ہے، اسے آپ کے ڈرانے سے کچھ حاصل نہ ہو گا، نہ آپ اس کے لیے فکر مند ہوں۔ دیکھیے سورۂ یٰس (۱۱) اور سورۂ قٓ (۴۵)۔ ¤ ➍ {وَ مَنْ تَزَكّٰى فَاِنَّمَا يَتَزَكّٰى لِنَفْسِهٖ :} یعنی آپ کی نصیحت سن کر جو شخص کفر و شرک اور فسق و فجور کی نجاست سے پاک ہوتا ہے، اس کا آپ پر یا اللہ تعالیٰ پر کچھ احسان نہیں، اس کے پاک ہونے کا فائدہ خود اسی کو ہے۔ ¤ ➎ {وَ اِلَى اللّٰهِ الْمَصِيْرُ :} یعنی کفر و فسوق کی نجاست میں آلودہ رہنے کا یا اس سے پاک ہونے کا نتیجہ پوری طرح قیامت کے دن ظاہر ہوگا اور ضرور ظاہر ہو گا، کیونکہ سب کو دوبارہ اللہ ہی کی طرف واپس پلٹنا ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) { وَ مَا يَسْتَوِي الْاَعْمٰى وَ الْبَصِيْرُ :} یہ کافر اور مومن کی مثال ہے کہ کافر اندھا ہے اور مومن آنکھوں والا۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {وَ لَا الظُّلُمٰتُ وَ لَا النُّوْرُ : } یہ کفر و ایمان کی مثال ہے کہ کفر نام ہے اندھیروں کا اور ایمان نور ہے۔ باطل اور کفر کی صورتیں اور اس کی راہیں بے شمار ہیں، اس لیے اس کے لیے جمع کا لفظ{ ’’ الظُّلُمٰتُ ‘‘} استعمال فرمایا، جب کہ حق ایک ہے اور ایمان کا راستہ بھی ایک ہی ہے، اس لیے اس کے لیے لفظ {’’ النُّوْرُ ‘‘} واحد استعمال فرمایا۔ حرف نفی {’’ لَا ‘‘} دو بار تاکید کے لیے استعمال فرمایا ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {وَ لَا الظِّلُّ وَ لَا الْحَرُوْرُ : ’’ الْحَرُوْرُ ‘‘} سخت گرم ہوا، لُو۔ یہ ثواب اور عذاب یعنی جنت و جہنم کی مثال ہے کہ جنت سایہ ہے اور جہنم لُو۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ { وَ مَا يَسْتَوِي الْاَحْيَآءُ وَ لَا الْاَمْوَاتُ :} یہ ایمان لانے والوں کی اور ایمان نہ لانے والوں کی مثال ہے کہ ایمان لانے والے زندوں کی طرح ہیں اور ایمان نہ لانے والے مُردوں کی طرح۔ ابن کثیر رحمۃ اللہ علیہ نے فرمایا، جس طرح یہ باہم متضاد اور مختلف چیزیں برابر نہیں ہیں کہ اندھا اور دیکھنے والا برابر نہیں، بلکہ دونوں کے درمیان بہت سا فرق اور بُعد ہے اور جس طرح اندھیرے اور روشنی برابر نہیں اور سایہ اور لُو برابر نہیں، اسی طرح زندہ اور مُردے برابر نہیں۔ یہ مثال ہے جو اللہ تعالیٰ نے ایمان والوں کے لیے بیان فرمائی ہے کہ وہ زندہ ہیں اور کافروں کے لیے کہ وہ مردہ ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا : «اَوَ مَنْ كَانَ مَيْتًا فَاَحْيَيْنٰهُ وَ جَعَلْنَا لَهٗ نُوْرًا يَّمْشِيْ بِهٖ فِي النَّاسِ كَمَننْ مَّثَلُهٗ فِي الظُّلُمٰتِ لَيْسَ بِخَارِجٍ مِّنْهَا » [ الأنعام : ۱۲۲ ] ’’اور کیا وہ شخص جو مردہ تھا، پھر ہم نے اسے زندہ کیا اور اس کے لیے ایسی روشنی بنا دی جس کی مدد سے وہ لوگوں میں چلتا پھرتا ہے، اس شخص کی طرح ہے جس کا حال یہ ہے کہ وہ اندھیروں میں ہے، ان سے کسی صورت نکلنے والا نہیں۔‘‘ اور فرمایا : «مَثَلُ الْفَرِيْقَيْنِ كَالْاَعْمٰى وَ الْاَصَمِّ وَ الْبَصِيْرِ وَ السَّمِيْعِ هَلْ يَسْتَوِيٰنِ مَثَلًا » [ ھود : ۲۴ ] ’’دونوں گروہوں کی مثال اندھے اور بہرے اور دیکھنے والے اور سننے والے کی طرح ہے، کیا یہ دونوں مثال میں برابر ہیں؟‘‘ چنانچہ مومن سننے اور دیکھنے والا ہے، دنیا اور آخرت کے اندر روشنی میں صراطِ مستقیم پر چلتا ہے، یہاں تک کہ یہ سفر اسے سایوں اور چشموں والی جنتوں کے ٹھکانے میں پہنچا دیتا ہے اور کافر اندھا اور بہرا ہے، اندھیروں میں چلتا ہے، ان سے کسی طرح نہیں نکلتا۔ دنیا اور آخرت میں اپنی سرکشی اور گمراہی میں بھٹکتا پھرتا ہے، یہاں تک کہ یہ سفر اسے جہنم کی لُو اور گرم پانی تک پہنچا دیتا ہے، جیسا کہ فرمایا : «وَ ظِلٍّ مِّنْ يَّحْمُوْمٍ (43) لَّا بَارِدٍ وَّ لَا كَرِيْمٍ » [ الواقعۃ : ۴۳، ۴۴ ] ’’اور سیاہ دھوئیں کے سائے میں ہوں گے۔ جو نہ ٹھنڈا ہے اور نہ باعزت۔‘‘ ¤ ➋ { اِنَّ اللّٰهَ يُسْمِعُ مَنْ يَّشَآءُ :} سنانے کا مطلب سوچنے، سمجھنے اور قبول کرنے کی توفیق کے ساتھ سنانا ہے۔ یعنی اللہ تعالیٰ کی مشیّت اور چاہنے کی تو بات ہی دوسری ہے، وہ جسے چاہے سنا دے، چاہے تو بے جان پتھروں کو سنا دے، کسی اور میں یہ قدرت نہیں، نہ یہ رسول کے بس کا کام ہے کہ جن لوگوں کے دل مردہ ہو چکے ہوں ان کے دلوں میں اپنی بات اُتار سکے اور جو بات سننا ہی نہ چاہتے ہوں ان کے بہرے کانوں کو حق کی آواز سنا سکے، وہ تو انھی کو سنا سکتا ہے جو معقول بات سننے اور اس پر غور کے لیے آمادہ ہوں۔ ¤ ➌ { وَ مَاۤ اَنْتَ بِمُسْمِعٍ مَّنْ فِي الْقُبُوْرِ :} یہ مشرکین کی مثال ہے کہ وہ مُردوں کی طرح ہیں جو سنتے نہیں، یعنی جس طرح تیرے بس میں یہ بات نہیں کہ تو قبروں میں دفن مُردوں کو اپنی بات سنا سکے اسی طرح جن لوگوں کے دل مُردہ ہو چکے ہیں تو انھیں بھی اللہ کی آیات نہیں سنا سکتا، نہ انھیں راہ راست پر لا سکتا ہے۔ ¤ ➍ یہ آیت مُردوں کے نہ سننے کی بھی واضح دلیل ہے۔ دیکھیے سورۂ نمل (۸۰، ۸۱)۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) { اِنْ اَنْتَ اِلَّا نَذِيْرٌ :} یعنی تیرا کام لوگوں کو خبردار کرنے اور اللہ کے عذاب سے ڈرانے سے زیادہ کچھ نہیں، انھیں ہدایت دینا اور ان کے دل میں ایمان اتار دینا تیرا کام نہیں، یہ صرف اللہ تعالیٰ کے ہاتھ میں ہے، اس لیے تُو ان کے ایمان نہ لانے پر اس قدر دلبرداشتہ اور غم زدہ نہ ہو۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { اِنَّاۤ اَرْسَلْنٰكَ بِالْحَقِّ بَشِيْرًا وَّ نَذِيْرًا:} حق سے مراد اللہ تعالیٰ کی نازل کردہ شریعت ہے۔ یعنی اے رسول! ہم نے تجھے حق دے کر بھیجا ہے، تاکہ جو تجھ پر ایمان لائیں انھیں جنت کی بشارت دے اور جو تجھے جھٹلائیں اننھیں اللہ کے عذاب سے ڈرائے۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے بشارت اور تسلی ہے۔ ¤ ➋ { وَ اِنْ مِّنْ اُمَّةٍ اِلَّا خَلَا فِيْهَا نَذِيْرٌ :} اس میں اللہ تعالیٰ نے لوگوں پر اپنی رحمت کا اور اپنے فضل کا بیان فرمایا ہے کہ اس نے لوگوں کو اندھیروں میں بھٹکتا ہوا نہیں چھوڑا کہ ان کے لیے سیدھے اور غلط راستے کی نشان دہی نہ کرے، بلکہ اس سے پہلے جو قوم بھی گزری اس نے اس کی طرف کوئی نہ کوئی ڈرانے والا ضرور بھیجا، خواہ وہ نبی یا رسول ہو، خواہ اس کا نائب دین کا کوئی عالم اور مبلغ ہو جس کے ذریعے سے رسول کی لائی ہوئی شریعت لوگوں تک پہنچ جائے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ { وَ اِنْ يُّكَذِّبُوْكَ فَقَدْ كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ:} اس میں رسول اللہ صلی اللہ علیہ وسلم کو مزید تسلی دی ہے۔ یعنی اگر یہ لوگ تجھے جھٹلا دیں تو غم یا افسوس کی ضرورت نہیں، یہ کوئی نئی بات نہیں، نہ آپ پہلے رسول ہیں جسے جھٹلایا گیا ہو، بلکہ آپ سے پہلے لوگوں کے پاس بھی کئی رسول آئے اور آپ سے پہلے لوگوں نے بھی اپنے رسولوں کو جھٹلایا۔ ¤ ➋ {جَآءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنٰتِ وَ بِالزُّبُرِ وَ بِالْكِتٰبِ الْمُنِيْرِ:} یہاں ایک سوال ہے کہ {’’اَلْكِتَابُ الْمُنِيْرُ‘‘ ’’اَلزُّبُرُ‘‘} میں بھی داخل ہے اور {’’اَلْبَيِّنَاتُ‘‘} میں بھی، تو پھر عطف ڈال کر اسے الگ کیوں ذکر کیا گیا؟ بعض اہل علم نے اس کا جواب دیا کہ تینوں الفاظ اگرچہ ایک چیز پر صادق آتے ہیں مگر عطف اس لیے ڈالا گیا ہے کہ تینوں سے الگ الگ مفہوم مراد لیا گیا ہے، چنانچہ {’’اَلْبَيِّنَاتُ‘‘} سے مراد معجزات ہیں، {’’اَلزُّبُرُ‘‘} سے مراد وہ کتابیں ہیں جو وعظ و نصیحت پر مشتمل ہیں اور {’’اَلْكِتَابُ الْمُنِيْرُ‘‘} سے مراد وہ کتابیں ہیں جن میں شریعت کے احکام تھے، جیسا کہ تورات وغیرہ۔ (شوکانی)"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) {ثُمَّ اَخَذْتُ الَّذِيْنَ كَفَرُوْا … :} نبی صلی اللہ علیہ وسلم کو تسلی دینے کے بعد آپ کی نافرمانی کرنے والوں اور ایمان نہ لانے والوں کو دھمکی اور ڈانٹ کے لیے فرمایا کہ پھر ان رسولوں پر ایمان نہ لانے والوں کو میں نے پکڑ لیا، تو میرا عذاب کیسا تھا؟ اسی طرح اگر یہ لوگ آپ پر ایمان نہ لائے تو میرا عذاب ان سے بھی کچھ دور نہیں۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَآءِ مَآءً … :} یعنی اس کائنات میں اشیاء کا اختلاف اللہ تعالیٰ کی قدرت کی دلیل ہے، جیسا کہ میٹھے دریا اور نمکین سمندر، نابینا اور بینا لوگ، اندھیرے اور روشنی، سایہ اور لُو، مردہ اور زندہ، مومن اور کافر کی مثالیں گزر چکی ہیں۔ اب نباتات و جمادات کی بوقلمونی اور رنگا رنگی پر غور کرو، اگر ایک صانع حکیم کی کاریگری نہ ہوتی تو کائنات میں یہ رنگا رنگی کبھی نہ ہوتی۔ یہ اندھے، بہرے اور شعور سے عاری مادے کا کام نہیں، بلکہ اس قادرِ مطلق کا کام ہے جس نے اس اختلاف کو اپنی وحدانیت اور کمال قدرت کی دلیل کے طور پر پیش فرمایا ہے۔ ¤ ➋ {’’ اَلَمْ تَرَ ‘‘} کا لفظی معنی ہے ’’کیا تو نے نہیں دیکھا؟‘‘ یہ کلمہ بعض اوقات ایسے شخص سے کہا جاتا ہے جسے پہلے اس بات کا علم ہو، اس وقت یہ تعجب کے اظہار کے لیے ہوتا ہے اور بعض اوقات ایسے شخص سے کہا جاتا ہے جسے پہلے علم نہیں ہوتا۔ اس وقت مقصود اسے بتانا اور اسے تعجب میں ڈالنا ہوتا ہے۔ یہ کلمہ اس دوسرے مفہوم میں ضرب المثل کے طور پر مشہور ہے، گویا جس شخص نے ایک چیز نہیں دیکھی اسے دیکھنے والے شخص کی طرح قرار دے کر اس سے بات کی جاتی ہے، اس لحاظ سے کہ یہ ایسی چیز ہے جس سے تمھارا لاعلم ہونا مناسب ہی نہیں، پھر اس سے اس شخص کی طرح بات کی جاتی ہے جس نے اسے دیکھا ہو اور اسے اچھی طرح جانتا ہو۔ آیت میں {’’ اَلَمْ تَرَ ‘‘} کا معنی {’’أَلَمْ تَعْلَمْ‘‘} ہے، کیا تو نے نہیں جانا، یعنی یقینا تم جانتے ہو۔ (ملخص از آلوسی) ¤ ➌ یعنی اے مردِ عاقل! یقینا تو جانتا ہے کہ اللہ تعالیٰ نے آسمان سے بہت سا پانی اتارا ({’’ مَآءً ‘‘} کی تنوین تکثیر کے لیے ہے) پھر اس کے ساتھ زمین سے بہت سے پھل اگائے، جن کے رنگ، شکلیں، اقسام اور ذائقے مختلف ہیں۔ کوئی سرخ ہے، کوئی زرد، کوئی سبز، کوئی میٹھا، کوئی کھٹا اور کوئی اس کے علاوہ، حالانکہ سب ایک ہی زمین سے پیدا ہوئے اور ایک ہی پانی سے سیراب ہوئے ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا : «وَ فِي الْاَرْضِ قِطَعٌ مُّتَجٰوِرٰتٌ وَّ جَنّٰتٌ مِّنْ اَعْنَابٍ وَّ زَرْعٌ وَّ نَخِيْلٌ صِنْوَانٌ وَّ غَيْرُ صِنْوَانٍ يُّسْقٰى بِمَآءٍ وَّاحِدٍ وَ نُفَضِّلُ بَعْضَهَا عَلٰى بَعْضٍ فِي الْاُكُلِ اِنَّ فِيْ ذٰلِكَ  لَاٰيٰتٍ لِّقَوْمٍ يَّعْقِلُوْنَ » [ الرعد : ۴ ] ’’اور زمین میں ایک دوسرے سے ملے ہوئے مختلف ٹکڑے ہیں اور انگوروں کے باغ اور کھیتی اور کھجور کے درخت کئی تنوں والے اور ایک تنے والے، جنھیں ایک ہی پانی سے سیراب کیا جاتا ہے اور ہم ان میں سے بعض کو پھل میں بعض پر فوقیت دیتے ہیں۔ بلاشبہ اس میں ان لوگوں کے لیے یقینا بہت سی نشانیاں ہیں جو سمجھتے ہیں۔‘‘ ¤ ➍ {’’ اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَآءِ مَآءً ‘‘} میں اللہ تعالیٰ نے پانی اتارنے میں اپنا ذکر غائب کے صیغے کے ساتھ فرمایا، پھر {’’فَاَخْرَجْنَا بِهٖ ‘‘} میں اپنا ذکر جمع متکلم کے صیغے کے ساتھ کیا ہے، اسے ’’التفات‘‘ کہتے ہیں۔ اس سے مقصود زمین سے اتنی مختلف چیزیں اگانے میں اپنی کمال قدرت کو نمایاں کرنا ہے کہ یہ سب کچھ ہم نے سرانجام دیا ہے۔ ¤ ➎ {وَ مِنَ الْجِبَالِ جُدَدٌۢبِيْضٌ … : ’’ جُدَدٌ‘‘ ’’جُدَّةٌ‘‘} کی جمع ہے، اس کا معنی راستہ اور لکیر ہے۔ مراد پہاڑوں میں مختلف رنگوں کی دھاریاں اور قطعے ہیں۔ {’’ سُوْدٌ ‘‘ ’’أَسْوَدُ‘‘} کی جمع ہے۔ {’’ غَرَابِيْبُ ‘‘} جمع ہے {’’غِرْبِيْبٌ‘‘} کی۔ جب کسی چیز کو زیادہ سیاہ کہنا ہو تو {’’أَسْوَدُ‘‘} کی تاکید کے طور پر یہ لفظ آتا ہے، یعنی {’’أَسْوَدُ غِرْبِيْبٌ‘‘} جیسا کہ اردو میں ’’کالا سیاہ‘‘ یا ’’کالا بھجنگا‘‘ کہا جاتا ہے۔ یہاں آیات کے فواصل کی مناسبت سے {’’ غَرَابِيْبُ ‘‘} کو پہلے کر دیا ہے۔ اس میں اللہ تعالیٰ کی قدرت کے نمونوں میں سے ایک اور نمونے کا ذکر ہے، فرمایا ہماری قدرت ہی کا کرشمہ ہے کہ پہاڑوں میں مختلف رنگوں کے قطعے ہیں، کوئی سفید ہیں، کوئی سرخ اور کوئی کالے سیاہ اور کوئی کسی اور رنگ کے، کسی کی کوئی شکل ہے کسی کی کوئی اور، کوئی چھوٹا ہے کوئی بڑا، کوئی پتھر کا ہے کوئی مٹی کا، کوئی سنگ مرمر کا ہے کوئی نمک کا اور کوئی کسی اور چیز کا۔ {’’ غَرَابِيْبُ سُوْدٌ ‘‘} میں ایک مزید اہم نکتے کی طرف توجہ دلائی ہے کہ پہلے تو نباتات و جمادات کے رنگ مختلف ہیں، پھر ہر رنگ میں مزید اختلاف ہے، کوئی کالا ہے، کوئی اس سے زیادہ کالا اور کوئی کالا سیاہ۔ انسانوں کے سروں کے بالوں کی سیاہی کو ہی دیکھ لو کہ ایک شخص کے سر کے بالوں کی سیاہی دوسرے کے سر کے بالوں کی سیاہی سے مختلف ہے۔ دیکھتے جاؤ اور تعجب کرتے جاؤ کہ اس قادر مطلق کے کارخانۂ حکمت کی رنگا رنگی کی کوئی حد ہے کہ اس نے آدم علیہ السلام سے لے کر آخری انسان کے سر کے بالوں کی سیاہی کو دوسرے انسان کے سر کے بالوں کی سیاہی سے الگ بنایا ہے اور اس کے ہاتھوں کی لکیروں اور آنکھ کی پتلی بلکہ جسم کی ہر چیز کو دوسرے سے مختلف بنایا ہے۔ ہر درخت کے سبز رنگ کو دوسرے کے سبز رنگ سے الگ بنایا ہے، اس کے ہر پتے کی لکیریں دوسرے پتے سے الگ ہیں۔ ہر پھل مثلاً آم، جامن اور کھجور کو دوسرے سے الگ تو بنایا ہی ہے، پھر ہر پھل کے اندر اتنا تنوع رکھ دیا ہے کہ آم اور کھجور وغیرہ کی گٹھلی سے پیدا ہونے والا پھل پہلے درخت کے پھل سے الگ قسم کا ہے، جس کی گٹھلی سے وہ پیدا ہوا ہے، جیسا کہ ہر انسان اپنے ماں باپ سے الگ رنگ اور الگ شکل و صورت کا ہے۔ غرض ہر چیز کا رنگ الگ ہے اور اس رنگ مثلاً سفید یا سرخ یا زرد یا سیاہ میں سے ہر سفید ، سرخ، زرد اور سیاہ کی سفیدی، سرخی، زردی اور سیاہی دوسرے سے مختلف ہے، یہی حال اس کے ذائقے کا ہے۔ «فَتَبٰرَكَ اللّٰهُ اَحْسَنُ الْخٰلِقِيْنَ» [ المؤمنون : ۱۴ ] ’’سو بہت برکت والا ہے اللہ جو بنانے والوں میں سب سے اچھا ہے۔‘‘"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { وَ مِنَ النَّاسِ وَ الدَّوَآبِّ وَ الْاَنْعَامِ مُخْتَلِفٌ اَلْوَانُهٗ كَذٰلِكَ:} یعنی صرف نباتات اور جمادات ہی میں نہیں بلکہ دوسری تمام مخلوقات میں رنگا رنگی کا یہی عالم ہے۔ انسان، جانور اور چوپائے سب ایک دوسرے سے مختلف ہیں اور ان میں ہر جنس کی مختلف قسمیں ہیں اور ہر قسم کا ہر فرد دوسرے سے مختلف ہے۔ ¤ ➋ { اِنَّمَا يَخْشَى اللّٰهَ مِنْ عِبَادِهِ الْعُلَمٰٓؤُا :} یہاں علم سے مراد دنیوی علوم نہیں، بلکہ اللہ تعالیٰ کی عظمت اور اس کی صفات کا علم ہے، جس کو اللہ کی عظمت و صفات کا جتنا علم ہو گا اتنا ہی وہ اس کی نافرمانی سے ڈرے گا۔ علاوہ ازیں آیت میں ’’علماء‘‘ سے مراد وہ اصطلاحی علماء بھی نہیں جو قرآن و حدیث اور فقہ کا علم رکھنے کی بنا پر علمائے دین کہے جاتے ہیں۔ وہ اس آیت کے مصداق اسی صورت میں ہوں گے جب ان کے اندر اللہ کا ڈر بھی ہو گا۔ اسی طرح وہ مسلمان سائنس دان بھی اس کے مصداق ہیں جن کے دل میں کائنات کے عجائب سامنے آنے پر اللہ کی عظمت کے یقین اور اس سے ہیبت و خشیت میں اضافہ ہوتا ہے۔ طبری نے معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل فرمایا ہے کہ علماء وہ ہیں جو جانتے ہیں : « اِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ » ’’یقینا اللہ ہر چیز پر پوری طرح قادر ہے۔‘‘ ¤‘‘ ¤ ➌ تفسیر قاسمی میں ہے : ’’اس سے پہلے فرمایا تھا : « اِنَّمَا تُنْذِرُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ » [ فاطر : ۱۸ ] ’’تو صرف ان لوگوں کو ڈراتا ہے جو دیکھے بغیر اپنے رب سے ڈرتے ہیں۔‘‘ یہ جملہ اسی کی تکمیل ہے، لوگوں کے مختلف طبقات اور مراتب بیان کرنے کے بعد بتایا کہ رب تعالیٰ کو دیکھے بغیر اس سے کون ڈرتے ہیں، یعنی اللہ تعالیٰ کو دیکھے بغیر اس سے وہی ڈرتے ہیں جو اس کا اور اس کی صفاتِ جلیلہ و افعالِ جمیلہ کا علم رکھتے ہیں، کیونکہ بندہ اسی سے ڈرتا ہے جس کا اسے علم ہو اور جس کی قوت و عظمت اور صفات کمال کو وہ جانتا ہو۔ پھر جسے اس کا جتنا زیادہ علم ہو گا اتنا ہی وہ اس سے ڈرے گا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَاللّٰهِ! لَأَنَا أَعْلَمُكُمْ بِاللّٰهِ وَ أَخْشَاكُمْ لَهُ ] [ منتخب مسند عبد بن حمید، ح : ۱۵۰۲ ] ’’اللہ کی قسم! میں تم سب سے زیادہ اللہ کا علم رکھنے والا اور تم سب سے زیادہ اس سے ڈرنے والا ہوں۔‘‘ صحیح بخاری کے الفاظ یہ ہیں : [ إِنَّ أَتْقَاكُمْ وَ أَعْلَمَكُمْ بِاللّٰهِ أَنَا ] [ بخاري، الإیمان، باب قول النبي صلی اللہ علیہ وسلم أنا أعلمکم باللہ : ۲۰ ] ’’بے شک تم سب سے زیادہ ڈرنے والا اور اللہ کا سب سے زیادہ علم رکھنے والا میں ہوں۔‘‘ اس لیے اللہ تعالیٰ نے اپنی قدرت پر دلالت کرنے والے کاموں کے ذکر کے بعد فرمایا کہ اللہ تعالیٰ سے اس کے بندوں میں سے صرف علم والے ڈرتے ہیں۔ کافر چونکہ اللہ تعالیٰ کی اس پہچان سے بالکل بے خبر ہیں، اس لیے انھیں ڈرانا بالکل بے سود ہے۔‘‘ (افادہ از ابو السعود) ¤ قاسمی ہی نے قاشانی سے نقل فرمایا ہے : ’’یعنی اللہ تعالیٰ سے وہی لوگ ڈرتے ہیں جو اس کے عالم و عارف ہیں (اسے جاننے پہچاننے والے ہیں)، کیونکہ یہاں خشیّت اور ڈرنے سے مراد عذاب کا ڈر نہیں ہے، بلکہ خشیّت دل میں خشوع و انکسار کی اس حالت کا نام ہے جو اس کی عظمت کے تصور اور اسے دل میں حاضر کرنے سے پیدا ہوتی ہے، کیونکہ جو اس کی عظمت کا تصور نہ کرے، ممکن نہیں اس سے ڈرے اور اللہ تعالیٰ اپنی عظمت کے ساتھ جس شخص کے دل کی آنکھوں کے سامنے حاضر ہو وہ اس سے اس طرح ڈرے گا جیسے اس سے ڈرنے کا حق ہے اور اللہ تعالیٰ کا کامل علم و معرفت رکھنے والے کے درمیان اور اس کا ناقص علم و معرفت رکھنے والے کے درمیان اس کی حاضری کے تصور میں بہت زیادہ فرق ہے اور دونوں کے درمیان علم و معرفت کی کمی بیشی کے لحاظ سے اتنے مرتبے ہیں جن کا شمار نہیں ہو سکتا۔‘‘ ¤ ➍ { اِنَّ اللّٰهَ عَزِيْزٌ غَفُوْرٌ :} یعنی اللہ تعالیٰ سب پر غالب ہے، چاہے تو نافرمان اور سرکش لوگوں کو فوراً پکڑے، مگر وہ بے حد بخشنے والا ہے، اس لیے انھیں مہلت دیے جاتا ہے، تاکہ وہ کسی وقت بھی پلٹ آئیں۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { اِنَّ الَّذِيْنَ يَتْلُوْنَ كِتٰبَ اللّٰهِ … :} یہ بات ذکر کرنے کے بعد کہ علماء ہی وہ لوگ ہیں جو اللہ تعالیٰ سے ڈرتے ہیں، ان کے تین اوصاف ذکر فرمائے، پھر انھیں ملنے والے اجر کا ذکر فرمایا۔ ان تین اوصاف میں سے پہلا وصف اللہ تعالیٰ کی کتاب کی تلاوت ہے، کیونکہ اللہ تعالیٰ کی ذات و صفات کے علم کا سرچشمہ وہی ہے اور اسی سے اللہ کی خشیت پیدا کرنے والا علم حاصل ہوتا ہے۔ دوسری اور تیسری صفت اس علم کے تقاضے پر عمل کرتے ہوئے نماز قائم کرنا اور اس کے دیے ہوئے میں سے خفیہ اور علانیہ ہر طرح سے خرچ کرنا ہے۔ یہ تینوں چیزیں علم و عمل کی بنیاد ہیں، اس لیے اللہ تعالیٰ نے یہود کا حال بیان کرتے ہوئے بتایا کہ انھوں نے اللہ کی کتاب کو پیٹھ کے پیچھے پھینک دیا : « فَنَبَذُوْهُ وَرَآءَ ظُهُوْرِهِمْ» [ آل عمران : ۱۸۷ ] ’’تو انھوں نے اسے اپنی پیٹھوں کے پیچھے پھینک دیا۔‘‘ اور نماز قائم کرنے کے بجائے اسے ضائع کر دیا اور اللہ کی راہ میں خرچ کرنے کے بجائے خواہش پرستی، سود خوری اور شدید بخل کو اپنا شیوہ بنا لیا، فرمایا : « فَخَلَفَ مِنْۢ بَعْدِهِمْ خَلْفٌ اَضَاعُوا الصَّلٰوةَ وَ اتَّبَعُوا الشَّهَوٰتِ فَسَوْفَ يَلْقَوْنَ غَيًّا » [ مریم : ۵۹ ] ’’پھر ان کے بعد ایسے نالائق جانشین ان کی جگہ آئے جنھوں نے نماز کو ضائع کر دیا اور خواہشات کے پیچھے لگ گئے تو وہ عنقریب گمراہی کو ملیں گے۔‘‘ جس کے نتیجے میں وہ اس علم سے محروم ہو گئے جس سے خشیّتِ الٰہی پیدا ہوتی ہے۔ ¤ ➋ { يَرْجُوْنَ تِجَارَةً لَّنْ تَبُوْرَ :} علم و ایمان والوں کے عمل کو تجارت کے ساتھ تشبیہ اس لیے دی گئی ہے کہ آدمی دنیا میں جو بھی تجارت کرتا ہے، اس میں اپنا سرمایہ اور محنت و قابلیت اس امید پر صرف کرتا ہے کہ اسے اصل کے ساتھ ساتھ نفع بھی حاصل ہو گا، اس کے باوجود اسے نفع کی امید کے ساتھ خسارے کا بلکہ اصل سرمایہ برباد ہونے کا ڈر بھی رہتا ہے، مگر اللہ کے بندے جو اپنے اوقاتِ عزیزہ کو، جو ان کی زندگی کا سرمایہ ہیں، اللہ تعالیٰ کے احکام کی تعمیل کے سودے میں صرف کرتے ہیں، یہ وہ لوگ ہیں جنھیں اپنے سودے میں نفع ہی نفع کی امید ہے، خسارے کا یا اصل سرمایہ برباد ہونے کا کوئی خوف نہیں۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { لِيُوَفِّيَهُمْ اُجُوْرَهُمْ وَ يَزِيْدَهُمْ مِّنْ فَضْلِهٖ:’’ لِيُوَفِّيَهُمْ ‘‘} میں لام عاقبت کا ہے، یعنی اہل علم کی تلاوتِ کتاب، اقامتِ صلاۃ اور خرچ کرنے کا نتیجہ یہ ہو گا کہ اللہ تعالیٰ انھیں ان کے اجر پورے دے گا اور اپنے فضل سے مزید بھی دے گا۔ یہ لام علت اور وجہ بیان کرنے کے لیے بھی ہو سکتا ہے، یعنی علم والے لوگ قرآن کی تلاوت، اقامتِ صلاۃ اور اللہ کے عطا کردہ میں سے خرچ کرتے ہیں، تاکہ وہ انھیں ان کے اجر پورے دے اور اپنے فضل سے مزید بھی عطا فرمائے، جیسا کہ اللہ تعالیٰ نے فرمایا : «فَاَمَّا الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ فَيُوَفِّيْهِمْ اُجُوْرَهُمْ وَ يَزِيْدُهُمْ مِّنْ فَضْلِهٖ  » [ النساء : ۱۷۳ ] ’’پھر جو لوگ تو ایمان لائے اور انھوں نے نیک اعمال کیے سو وہ انھیں ان کے اجر پورے دے گا اور انھیں اپنے فضل سے زیادہ بھی دے گا۔‘‘ اپنے فضل سے مزید عطا کرنے میں ایک نیکی کو سات سو نیکیوں تک یا اس سے بھی زیادہ بڑھانا ہے، پھر چند روزہ زندگی کے عمل پر ہمیشہ کی جنت عطا کرنا ہے، پھر جنت کی تمام نعمتوں سے بڑی نعمت اپنا دیدار عطا فرمانا ہے، جیسا کہ فرمایا : « لِلَّذِيْنَ اَحْسَنُوا الْحُسْنٰى وَ زِيَادَةٌ » [ یونس : ۲۶ ] ’’جن لوگوں نے نیکی کی انھی کے لیے نہایت اچھا بدلا اور کچھ زیادہ ہے۔‘‘ اللہ تعالیٰ ہمیں بھی ان خوش نصیبوں میں شامل فرمائے۔ (آمین) ¤ ➋ { اِنَّهٗ غَفُوْرٌ شَكُوْرٌ :} یعنی اس کی وجہ یہ ہے کہ وہ اہل ایمان کے گناہوں پر بے حد پردہ ڈالنے والا اور ان کے نیک اعمال کی بے حد قدر کرنے والا ہے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ {وَ الَّذِيْۤ اَوْحَيْنَاۤ اِلَيْكَ مِنَ الْكِتٰبِ هُوَ الْحَقُّ … :} اس کا عطف {’’ اِنَّ الَّذِيْنَ يَتْلُوْنَ كِتٰبَ اللّٰهِ ‘‘} پر ہے۔ ککتاب اللہ کی تلاوت کرنے والے علماء کی فضیلت بیان کرنے کے بعد فرمایا : ’’اور یہ کتاب جو ہم نے آپ کی طرف وحی فرمائی ہے، کامل حق یہی ہے۔‘‘ اس کے علاوہ اللہ تعالیٰ کی ذات و صفات اور اس کے احکام پر مشتمل جتنی کتابیں ہیں ان میں سے جو لوگوں کی تصنیف کر دہ ہیں ان میں حق کا کچھ حصہ ہے بھی تو اکثر حصہ باطل ہے اور جو اس سے پہلے اللہ تعالیٰ کی طرف سے نازل ہوئی ہیں، مثلاً تورات و انجیل تو ان کے اندر بعد میں تحریف اور کمی بیشی کی وجہ سے کچھ باطل چیزیں بھی شامل ہو گئی ہیں، ان کی جو باتیں حق ہیں یہ کتاب ان کی تصدیق کرتی ہے اور جو باطل ہیں ان کی تردید کرتی ہے، اس لیے یہ ان کے اصل اور صحیح مضامین کی محافظ ہے۔ اب کامل حق چونکہ صرف اسی کتاب میں ہے، اس لیے آپ کو اور آپ کی امت کو صرف اس پر عمل کرنا چاہیے۔ ¤ ➋ { اِنَّ اللّٰهَ بِعِبَادِهٖ لَخَبِيْرٌۢ بَصِيْرٌ:} یعنی اللہ تعالیٰ اپنے بندوں کی ضروریات کی پوری خبر رکھنے والا اور ان کے اعمال کو پوری طرح دیکھنے والا ہے۔ اس نے آپ پر یہ کتاب ان کی اور ان کے زمانے کی تمام ضروریات کو مدنظر رکھ کر نازل فرمائی ہے۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ {ثُمَّ اَوْرَثْنَا الْكِتٰبَ الَّذِيْنَ اصْطَفَيْنَا مِنْ عِبَادِنَا :} یعنی ہم نے یہ کتاب آپ کی طرف وحی کی، پھر اس کتاب کا وارث ان لوگوں کو بنایا جنھیں ہم نے اس کتاب کا وارث بننے کے لیے، یعنی امتِ مسلمہ میں شامل ہونے کے لیے چن لیا اور یہ ہماری مرضی ہے کہ ہم جسے چاہتے ہیں چن لیتے ہیں، جیسا کہ فرمایا : « اَللّٰهُ يَجْتَبِيْۤ اِلَيْهِ مَنْ يَّشَآءُ وَ يَهْدِيْۤ اِلَيْهِ مَنْ يُّنِيْبُ » [الشورٰی : ۱۳ ] ’’اللہ اپنی طرف چن لیتا ہے جسے چاہتا ہے اور اپنی طرف راستہ اسے دیتا ہے جو رجوع کرے۔‘‘ ¤ ➋ { فَمِنْهُمْ ظَالِمٌ لِّنَفْسِهٖ وَ مِنْهُمْ مُّقْتَصِدٌ … :} کتاب اللہ کے وارث بننے والےے افراد کی، یعنی امت مسلمہ کی تین قسمیں ہیں، کچھ وہ جو اپنی جان پر ظلم کرنے والے ہیں کہ ان کی نیکیاں گناہوں کے مقابلے میں کم ہیں، کچھ میانہ رو ہیں کہ جن کے نیک و بد اعمال قریباً برابر ہیں اور کچھ وہ جو اللہ کے حکم سے نیکیوں میں آگے نکل جانے والے ہیں۔ ان تینوں گروہوں کو حاصل ہونے والی نعمت، یعنی کتاب اللہ کی وراثت اور امتِ مسلمہ میں شمولیت بہت ہی بڑا فضل ہے۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ { جَنّٰتُ عَدْنٍ يَّدْخُلُوْنَهَا:} یعنی یہ تینوں گروہ آخر کار جنات عدن میں داخل ہو جائیں گے۔ طبری اور بیہقی نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما سے نقل فرمایا ہے : [ هُمْ أُمَّةُ مُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ، وَرَّثَهُمُ اللّٰهُ كُلَّ كِتَابٍ أَنْزَلَهُ، فَظَالِمُهُمْ يُغْفَرُ لَهُ، وَ مُقْتَصِدُهُمْ يُحَاسَبُ حِسَابًا يَّسِيْرًا، وَ سَابِقُهُمْ يَدْخُلُ الْجَنَّةَ بِغَيْرِ حِسَابٍ ] [طبري : ۲۹۲۳۶۔ البعث والنشور للبیھقي : 68/1، ح : ۶۴ ] ’’یہ (کتاب کے وارث) امت محمد صلی اللہ علیہ وسلم کے لوگ ہیں، اللہ تعالیٰ نے انھیں اپنی نازل کردہ تمام کتابوں کا وارث بنایا۔ ان میں سے ظالم کو بخش دیا جائے گا، ان کے میانہ رو کا آسان حساب ہو گا اور ان کے سبقت لے جانے والے جنت میں بغیر حساب داخل ہوں گے۔‘‘ یعنی امت مسلمہ میں سے اپنی جان پر ظلم کرنے والے لوگ اگر جہنم میں گئے بھی تو ہمیشہ وہاں نہیں رہیں گے، بلکہ ایمان کی برکت سے انھیں شفاعت کے ذریعے سے یا ایمان والوں پر اللہ تعالیٰ کی خاص رحمت کے نتیجے میں جہنم سے نکال لیا جائے گا اور وہ جنات عدن میں داخل ہو جائیں گے اور یہ بہت ہی بڑا فضل ہے جو ان لوگوں کو کبھی حاصل نہیں ہو گا جو امت مسلمہ میں داخل ہو کر کتاب اللہ کے وارث نہیں بنے، کیونکہ اللہ تعالیٰ نے ان پر جنت کی نعمتیں ہمیشہشہ کے لیے حرام کر دی ہیں، جیسا کہ فرمایا : « اِنَّ اللّٰهَ حَرَّمَهُمَا عَلَى الْكٰفِرِيْنَ» [ الأعراف : ۵۰ ] ’’اللہ تعالیٰ نے جنت کا پانی اور اس کا رزق کافروں پر حرام کر دیا ہے۔‘‘ ¤ ➋ بعض مفسرین نے ان تینوں گروہوں میں سے {’’ ظَالِمٌ لِّنَفْسِهٖ ‘‘} کفار کو قرار دیا ہے اور تینوں گروہوں کی تفصیل ان تین گروہوں کے مطابق کی ہے جن کا ذکر سورۂ واقعہ میں ہے کہ قیامت کے دن لوگوں کی تین قسمیں ہو جائیں گی، اصحاب الیمین، اصحاب الشمال اور سابقون۔ ان میں سے سابقون اور اصحاب الیمین جنتی ہوں گے اور اصحاب الشمال جہنمی ہوں گے۔ مگر پہلی تفسیر راجح ہے، کیونکہ اللہ تعالیٰ نے تینوں گروہوں کا ذکر کرکے تینوں کے متعلق فرمایا کہ وہ جنات عدن میں داخل ہوں گے۔ اس پر یہ سوال پیدا ہوتا ہے کہ جب امت مسلمہ کا ہر فرد ہی جنت میں داخل ہو گا تو ایمان لانے کے بعد جہنم سے ڈرانے اور ڈرنے کی کیا ضرورت ہے؟ جواب اس کا یہ ہے کہ اس میں یہ نہیں فرمایا کہ ان میں سے کوئی جہنم میں نہیں جائے گا، بلکہ اگر کوئی شخص جہنم میں مدتوں رہنے کے بعد آخر کار جنت میں داخل ہو جائے تو یہ بھی فضل کبیر ہے۔ کیونکہ جب ایسے لوگ جنت میں جائیں گے تو کافر اس وقت تمنا کریں گے کہ کاش! وہ کسی درجے کے بھی مسلمان ہوتے تو ہمیشہ جہنم میں نہ رہتے۔ اللہ تعالیٰ نے فرمایا : «رُبَمَا يَوَدُّ الَّذِيْنَ كَفَرُوْا لَوْ كَانُوْا مُسْلِمِيْنَ » [ الحجر : ۲ ] ’’بہت بار چاہیں گے وہ لوگ جنھوں نے کفر کیا، کاش! وہ کسی طرح کے مسلم ہوتے۔‘‘ مزید سورۂ حجر کی آیت (۲) کی تفسیر ملاحظہ فرمائیں۔ ¤ ➌ { يُحَلَّوْنَ فِيْهَا مِنْ اَسَاوِرَ مِنْ ذَهَبٍ … :} اس کی مفصل تفسیر کے لیے دیکھیے سورۂ حج کی آیت (۲۳)۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ {وَ قَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْۤ اَذْهَبَ عَنَّا الْحَزَنَ :} حزن کسی چیز کے ہاتھ  ہاتھ سے نکلنے کی وجہ سے پیدا ہونے والی دل کی کیفیت کا نام ہے، یعنی غم، جیسا کہ فرمایا : « لِكَيْلَا تَاْسَوْا عَلٰى مَا فَاتَكُمْ» [ الحدید : ۲۳ ] ’’تاکہ تم اس پر غم نہ کرو جو تمھارے ہاتھ سے نکل جائے۔‘‘ دنیا میں انسان کو جو بھی ملا ہے وہ اس کے ہاتھ سے نکل جانے والا ہے، اس لیے دنیا میں جب تک کوئی نعمت انسان کے پاس رہتی ہے وہ اس خوف میں رہتا ہے کہ یہ نعمت مجھ سے چھن نہ جائے اور جب چھنتی ہے تو اسے غم ہوتا ہے۔ جنت میں داخلے اور موت کے ذبح کر دیے جانے کے بعد اہلِ جنت کو نہ کوئی نعمت چھننے کا خوف ہو گا، یعنی {’’ لَا خَوْفٌ عَلَيْهِمْ ‘‘} اور نہ کسی نعمت کے ہاتھ سے نکل جانے کا غم، یعنی {’’ وَلَا هُمْ يَحْزَنُوْنَ ‘‘} کیونکہ نہ ان کے جمال میں کمی ہو گی، نہ کھانے پینے میں، نہ ان کی قوت اور جوانی میں، نہ ان کی لذتوں میں اور نہ ہمیشہ رہائش میں تو پھر غم کس بات کا، اس لیے وہ اللہ کا شکر ادا کریں گے، جس نے ان سے ہر قسم کا غم دور کر دیا۔ دنیا کی ہر نعمت تو ختم ہونے کی وجہ سے غم کا باعث بنتی تھی، یہ جنت ہی ہے جس کی کوئی نعمت غم کا باعث نہیں بنے گی۔ ابن الرومی نے کہا ہے: ¤ {وَ مَنْ سَرَّهُ أَلَّا يَرٰي مَا يَسُوْءُهُ ¤ فَلَا يَتَّخِذْ شَيْئًا يُبَالِيْ لَهُ فَقْدًا} ¤ ’’جسے پسند ہو کہ وہ غمگین کرنے والی کوئی چیز نہ دیکھے تو وہ ایسی کوئی چیز نہ پکڑے جس کے گم ہونے کی اسے فکر ہو۔‘‘ ¤ ➋ { اِنَّ رَبَّنَا لَغَفُوْرٌ شَكُوْرٌ:} اس کی تفسیر کے لیے دیکھیے اسی سورت کی آیت (۳۰)۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ {الَّذِيْۤ اَحَلَّنَا دَارَ الْمُقَامَةِ : ’’ دَارَ الْمُقَامَةِ ‘‘} ہمیشہ رہنے کا گھر، جس سے کبھی نکالا نہیں جائے گا۔ ¤ ➋ { مِنْ فَضْلِهٖ :} یعنی جنت میں داخلہ اور ہمیشہ اس میں رہنا محض اللہ کے فضل سے ہے، کیونکہ آدمی کے اعماعمال تو ان نعمتوں کے شکر کے لیے بھی کافی نہیں جو اللہ تعالیٰ نے دنیا میں اسے عطا کی ہیں، پھر اگر کوئی نیکی کی ہے تو محدود وقت میں کی ہے، اس پر ہمیشہ ہمیشہ کی جنت محض اللہ کا فضل ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرماتے تھے : [ لَنْ يُّدْخِلَ أَحَدًا عَمَلُهُ الْجَنَّةَ ] ’’کسی شخص کا عمل بھی اسے جنت میں داخل نہیں کرے گا۔‘‘ صحابہ نے کہا : ’’تو کیا آپ کو بھی نہیں اے اللہ کے رسول!؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَا، وَ لَا أَنَا إِلَّا أَنْ يَّتَغَمَّدَنِيَ اللّٰهُ بِفَضْلٍ وَ رَحْمَةٍ ] [ بخاري، المرضٰی، باب تمنی المریض الموت : ۵۶۷۳ ]’’نہیں، مجھے بھی نہیں، مگر یہ کہ اللہ تعالیٰ مجھے فضل و رحمت کے ساتھ ڈھانپ لے۔‘‘ ¤ ➌ { لَا يَمَسُّنَا فِيْهَا نَصَبٌ وَّ لَا يَمَسُّنَا فِيْهَا لُغُوْبٌ :} یعنی ہماری تمام محنتوں اور تکلیفوں کا خاتمہ ہو گیا۔ شاہ عبد القادر لکھتے ہیں : ’’رہنے کا گھر اس سے پہلے کوئی نہ تھا، ہر جگہ چل چلاؤ اور روزی کا غم، دشمنوں کا ڈر اور رنج اور مشقت، وہاں پہنچ کر سب گئے۔‘‘ (موضح)"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) ➊ { وَ الَّذِيْنَ كَفَرُوْا لَهُمْ نَارُ جَهَنَّمَ :} جنت میں جانے والے خوش نصیبوں کے بعد جہنم میں جانے والے بد نصیبوں کا ذکر فرمایا، یعنی جن لوگوں نے اس کتاب کو ماننے سے انکار کر دیا جو ہم نے محمد صلی اللہ علیہ وسلم پر نازل فرمائی اور جس کے وارث ہمارے چنے ہوئے بندے ہیں، ان کے لیے جہنم کی آگ ہے۔ ¤ ➋ {لَا يُقْضٰى عَلَيْهِمْ فَيَمُوْتُوْا:} جہنمی موت کو راحت خیال کریں گے اور اس کی تمنا کریں گے، مگر ان کی یہ تمنا کبھی پوری نہیں ہو گی۔ قرآن مجید کی کئی آیات میں یہ ذکر فرمایا ہے کہ جہنمیوں پر موت نہیں آئے گی کہ وہ عذاب سے رہائی پا جائیں، نہ ہی ان کی زندگی کوئی زندگی ہو گی، جیسا کہ فرمایا : « ثُمَّ لَا يَمُوْتُ فِيْهَا وَ لَا يَحْيٰى » [ الأعلٰی : ۱۳ ] ’’پھر وہ نہ اس میں مرے گا اور نہ زندہ رہے گا۔‘‘ اور دیکھیے سورۂ ابراہیم (۱۵ تا ۱۷) اور سورۂ زخرف (۷۷) ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُؤْتٰی بِالْمَوْتِ كَهَيْئَةِ كَبْشٍ أَمْلَحَ فَيُنَادِيْ مُنَادٍ يَا أَهْلَ اللْجَنَّةِ! فَيَشْرَئِبُّوْنَ وَ يَنْظُرُوْنَ فَيَقُوْلُ هَلْ تَعْرِفُوْنَ هٰذَا؟ فَيَقُوْلُوْنَ نَعَمْ هٰذَا اللْمَوْتُ، وَ كُلُّهُمْ قَدْ رَآهُ، ثُمَّ يُنَادِيْ يَا أَهْلَ النَّارِ! فَيَشْرَئِبُّوْنَ وَ يَنْظُرُوْنَ، فَيَقُوْلُ هَلْ تَعْرِفُوْنَ هٰذَا؟ فَيَقُوْلُوْنَ نَعَمْ هٰذَا الْمَوْتُ، وَ كُلُّهُمْ قَدْ رَآهُ، فَيُذْبَحُ ثُمَّ يَقُوْلُ يَا أَهْلَ  الْجَنَّةِ! خُلُوْدٌ فَلَا مَوْتَ، وَ يَا أَهْلَ النَّارِ! خُلُوْدٌ فَلَا مَوْتَ، ثُمَّ قَرَأَ : «وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ وَّ هُمْ لَا يُؤْمِنُوْنَ» وَ هٰؤُلَاَءِ فِيْ غَفْلَةٍ أَهْلُ الدُّنْيَا « وَ هُمْ لَا يُؤْمِنُوْنَ» ] [ بخاري، التفسیر، سورۃ کھیعص، باب قولہ عزوجل : «و أنذرھم یوم الحسرۃ » : ۴۷۳۰ ] ’’موت کو ایک چتکبرے مینڈھے کی شکل میں لایا جائے گا، پھر ایک آواز دینے والا آواز دے گا : ’’اے جنت والو!‘‘ وہ گردنیں اٹھا کر دیکھیں گے، وہ کہے گا : ’’کیا تم اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں، یہ موت ہے۔‘‘ اور ان سب نے اسے دیکھا ہو گا، پھر وہ آواز دے گا : ’’اے آگ والو!‘‘ وہ گردنیں اٹھا کر دیکھیں گے، وہ کہے گا : ’’کیا تم اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں، یہ موت ہے۔‘‘ اور ان سب نے اسے دیکھا ہو گا، پھر اسے ذبح کر دیا جائے گا، پھر وہ کہے گا : ’’اے جنت والو! (اب) ہمیشگی ہے اور کوئی موت نہیں اور اے آگ والو! (اب) ہمیشگی ہے اور کوئی موت نہیں۔‘‘ پھر یہ آیت پڑھی : « وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ وَّ هُمْ لَا يُؤْمِنُوْنَ» [ مریم : ۳۹ ] ’’اور انھیں پچھتاوے کے دن سے ڈرا جب (ہر) کام کا فیصلہ کر دیا جائے گا اور وہ سراسر غفلت میں ہیں (یعنی دنیا دار لوگ) اور وہ ایمان نہیں لاتے۔‘‘ ¤ ➌ { وَ لَا يُخَفَّفُ عَنْهُمْ مِّنْ عَذَابِهَا :} کفار کی ایک سزا تو یہ ہو گی کہ ان کی موت کی تمنا کبھی پوری نہیں ہو گی، اس پر مزید سزا یہ ہو گی کہ کبھی عذاب میں وقفہ نہیں ہو گا، نہ عذاب کی شدت میں کمی ہو گی، بلکہ لمحہ بہ لمحہ ان کے عذاب میں اضافہ ہوتا رہے گا۔ دیکھیے سورۂ بقرہ (۱۶۱، ۱۶۲)، زخرف (۷۴)، بنی اسرائیل (۹۷) اور سورۂ نبا (۳۰)۔ ¤ ➍ { كَذٰلِكَ نَجْزِيْ كُلَّ كَفُوْرٍ:} ہم ہر ناشکرے کو ایسے ہی جزا دیتے ہیں جو ہماری نعمتوں کا شکر ادا کرتے ہوئے ایمان لانے کے بجائے کفر پر اصرار کرتا ہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ {وَ هُمْ يَصْطَرِخُوْنَ فِيْهَا … : ’’ يَصْطَرِخُوْنَ ‘‘ ’’صَرَخَ يَصْرُخُ صُرَاخًا‘‘} (ن) (سخت چیخنا) سے باب افتعال ہے، جس میں مزید مبالغہ ہے، اصل میں {’’يَصْتَرِخُوْنَ‘‘} تھا، ’’صاد‘‘ کی مناسبت سے ’’تاء‘‘ کو ’’طاء‘‘ سے بدل دیا، یعنی بہت چیخیں چلائیں گے۔ جہنمیوں کی تمنا کہ انھیں ایک دفعہ جہنم سے نکال کر دنیا میں بھیج دیا جائے اور وہ پہلے کے برعکس نیک عمل کریں گے، قرآن مجید میں کئی جگہ ذکر ہوئی ہے، مگر ان کی یہ تمنا پوری نہیں کی جائے گی۔ دیکھیے سورۂ اعراف (۵۳)، سجدہ (۱۲)، مؤمن (۱۱) اور سورۂ شوریٰ (۴۴) ایک مقام پر فرمایا کہ اگر انھیں واپس بھیج بھی دیا جائے تو دوبارہ وہی کچھ کریں گے جو پہلے کرتے رہے ہیں۔ دیکھیے سورۂ انعام (۲۸)۔ ¤ ➋ {اَوَ لَمْ نُعَمِّرْكُمْ مَّا يَتَذَكَّرُ فِيْهِ مَنْ تَذَكَّرَ … :} اس آیت کی تفسیر میں امام بخاری رحمہ اللہ نے ابوہریرہ رضی اللہ عنہ سے مروی حدیث بیان فرمائی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَعْذَرَ اللّٰهُ إِلَی امْرِئٍ أَخَّرَ أَجَلَهُ حَتّٰی بَلَّغَهُ سِتِّيْنَ سَنَنَةً ] [بخاري، الرقاق، باب من بلغ ستین سنۃ…: ۶۴۱۹ ]’’اللہ تعالیٰ نے اس آدمی کا عذر ختم کر دیا جس کی موت میں اتنی دیر کی کہ وہ ساٹھ برس ہی کو پہنچ گیا۔‘‘ مگر اس حدیث سے مراد یہ نہیں کہ اس سے کم عمر والے کو یہ بات نہیں کہی جائے گی، بلکہ مراد یہ ہے کہ سب سے زیادہ ڈانٹ اس عمر کے لوگوں کو پڑے گی۔ حقیقت یہ ہے کہ یہ بات ہر اس شخص کو کہی جائے گی جو بلوغت کی عمر کو پہنچا، اللہ تعالیٰ نے اسے اچھے برے کی تمیز عطا فرمائی، اگر وہ چاہتا تو ایمان لا سکتا تھا، مگر وہ جان بوجھ کر کفر پر اڑا رہا۔ کیونکہ اس بات پر سب متفق ہیں کہ ساٹھ سال سے کم عمر والے کفار کو اس عذر کی وجہ سے جہنم سے چھٹکارا نہیں ملے گا کہ انھیں ساٹھ برس کی عمر نہیں ملی اور رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں کتنے ہی کافر جہنم واصل ہوئے، جن کی عمریں ساٹھ سال سے کم تھیں۔ ¤ ➌ {وَ جَآءَكُمُ النَّذِيْرُ:} اس سے مراد رسول اللہ صلی اللہ علیہ وسلم اور آپ کے بعد ہر وہ شخص ہے جس کے ذریعے سے کسی کو حق کا پیغام پہنچے، کیونکہ اللہ تعالیٰ کا قاعدہ ہے : «وَ مَا كُنَّا مُعَذِّبِيْنَ حَتّٰى نَبْعَثَ رَسُوْلًا » [ بني إسرائیل : ۱۵ ] ’’اور ہم کبھی عذاب دینے والے نہیں یہاں تک کہ کوئی پیغام پہنچانے والا بھیجیں۔‘‘ {’’ النَّذِيْرُ ‘‘} کا لفظ عام ہے، جس میں رسول اور اس کے نائب کے علاوہ وقتاً فوقتاً پیش آنے والے حوادث بھی شامل ہیں، جن سے بندہ عبرت حاصل کر سکتا ہے، جیسا کہ فرمایا : « اَوَ لَا يَرَوْنَ اَنَّهُمْ يُفْتَنُوْنَ فِيْ كُلِّ عَامٍ مَّرَّةً اَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوْبُوْنَ وَ لَا هُمْ يَذَّكَّرُوْنَ » [ [ التوبۃ : ۱۲۶ ] ’’اور کیا وہ نہیں دیکھتے کہ وہ ہر سال ایک یا دو مرتبہ آزمائش میں ڈالے جاتے ہیں، پھر بھی وہ نہ توبہ کرتے ہیں اور نہ ہی وہ نصیحت پکڑتے ہیں۔‘‘ بعض سلف نے سفید بالوں کو بھی {’’ النَّذِيْرُ ‘‘} میں شامل کیا ہے، کیونکہ وہ زندگی کی مہلت ختم ہونے سے خبردار کرتے ہیں۔ ¤ ➍ {فَذُوْقُوْا فَمَا لِلظّٰلِمِيْنَ مِنْ نَّصِيْرٍ :} یہاں ظالموں سے مراد مشرک ہیں، کیونکہ جہنم میں ہمیشہ وہی رہیں گے۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) { اِنَّ اللّٰهَ عٰلِمُ غَيْبِ السَّمٰوٰتِ وَ الْاَرْضِ … :} اللہ تعالیٰ آسمان و زمین میں ہر غائب چیز کو جاننے والا ہے، اس کے علم سے کوئی چیز مخفی نہیں، وہ سینوں میں چھپی ہوئی باتوں کو بھی خوب جانتا ہے اور تمھارے دلوں میں چھپے ہوئے کفر پر اصرار سے بھی خوب واقف ہے۔ وہ جانتا ہے کہ اتنی مدت تک عمر دینے پر جب تم کفر پر قائم رہے تو مزید عمر دینے پر بھی تم یہی کچھ کرتے اور اسے خوب معلوم ہے کہ اگر وہ تمھاری درخواست قبول کرکے تمھیں دوبارہ دنیا میں بھیج دے تو تم پھر وہی کچھ کرو گے جو پہلے کرتے رہے، جیسا کہ فرمایا : « وَ لَوْ رُدُّوْا لَعَادُوْا لِمَا نُهُوْا عَنْهُ وَ اِنَّهُمْ لَكٰذِبُوْنَ » [ الأنعام : ۲۸ ] ’’اور اگر انھیں دوبارہ بھیج دیا جائے تو دوبارہ وہی کام کریں گے جس سے انھیں منع کیا گیا تھا اور یقینا وہ جھوٹے ہیں۔‘‘"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ { هُوَ الَّذِيْ جَعَلَكُمْ خَلٰٓىِٕفَ فِي الْاَرْضِ :} اس کے انعام اور اپنے کفر اور ناشکری پر غور کرو، اس کا احسان دیکھو کہ اس نے پہلی نسل کو فوت کرکے تمھیں اس کی جگہ زمین اور اس میں موجود تمام چیزوں کا مالک بنا دیا۔ (خلیفہ کا مطلب سمجھنے کے لیے سورۂ بقرہ کی آیت (۳۰) {’’ اِنِّيْ جَاعِلٌ فِي الْاَرْضِ خَلِيْفَةً ‘‘} کی تفسیر ملاحظہ فرمائیں) اگر ہر آنے والی نسل کے ساتھ پہلی تمام نسلیں بھی موجود رہتیں تو زمین میں نہ رہنے کی گنجائش رہتی، نہ ان کی ضروریات پوری ہوتیں۔ اس احسان کا بدلا تم نے یہ دیا کہ اس کی ناشکری کی، اس کا احسان ماننے سے انکار کیا اور اس کے ساتھ شریک بنا لیے، جنھوں نے نہ کچھ پیدا کیا، نہ ان کا زمین کی پیدائش یا ملکیت میں کوئی حصہ ہے اور تم نے انھیں پکارنا شروع کر دیا۔ ¤ ➋ { فَمَنْ كَفَرَ فَعَلَيْهِ كُفْرُهٗ :} تو جو اس نعمت کی ناشکری کرے اور اس کا احسان ماننے اور اس کے احکام تسلیم کرنے سے انکار کر دے تو اس کی ناشکری اور انکار کا وبال اسی پر پڑے گا، کسی دوسرے کو اس کا کچھ نقصان نہیں۔ ¤ ➌ { وَ لَا يَزِيْدُ الْكٰفِرِيْنَ كُفْرُهُمْ عِنْدَ رَبِّهِمْ اِلَّا مَقْتًا … :} یعنی اگر کفار کو ان کے کفر کے باوجود زمین کی خلافت ملی ہوئی ہے اور مال و اولاد اور دوسری نعمتوں کے ساتھ لمبی عمر ملی ہوئی ہے اور ان کی رسی دراز ہے، تو یہ نہ سمجھیں کہ اللہ تعالیٰ ان پر خوش ہے، اس لیے انھیں نعمتیں دیے جا رہا ہے اور نہ یہ سمجھیں کہ وہ اس طرح نفع کا سودا کر رہے ہیں۔ حقیقت یہ ہے کہ ان کافروں کے کفر سے ان پر اللہ تعالیٰ کے شدید غضب میں اضافہ ہی ہو رہا ہے اور اللہ تعالیٰ کے ہاں ان کے کفر سے ان کا خسارا ہی بڑھ رہا ہے، کیونکہ اس سے ان پر حجت تمام ہو رہی ہے اور ان کے عذر ختم ہو رہے ہیں۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ { قُلْ اَرَءَيْتُمْ شُرَكَآءَكُمُ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ … :} یعنی اللہ تعالیٰ نے تمھیں زمین کی خلافت بخشی، تو تم نے اس کی عبادت میں کچھ اوروں کو شریک بنا لیا اور انھیں پکارنا اور ان سے مانگنا شروع کر دیا، تو یہ بتاؤ کہ تمھارے پاس اس کی کیا دلیل ہے؟ کیا تمھارے بنائے ہوئے ان شریکوں نے، جنھیں تم اللہ کے سوا پکارتے ہو، زمین یا زمین کی کوئی چیز پیدا کی ہے؟ اگر کی ہے تو مجھے بھی دکھاؤ وہ کون سی چیز ہے؟ (دیکھیے حج : ۷۳۔ رعد : ۱۶) یا آسمانوں میں ان کا کوئی حصہ ہے تو اس کی نشان دہی کرو، یا ہم نے انھیں کوئی تحریر دی ہے، جو اس بات کی دلیل ہو کہ فلاں فلاں کو ہم نے بیماروں کو تندرست کرنے یا بے روزگاروں کو روزگار عطا کرنے یا حاجت مندوں کو ان کی حاجتیں پوری کرنے کے اختیارات دیے ہیں، اس لیے تمھیں یہ سب کچھ ان سے مانگنا چاہیے اور ان کا احسان مند ہونا چاہیے، اگر ایسی کوئی تحریر ہے تو لاؤ پیش کرو اور اگر نہیں اور یقینا نہیں تو خود ہی سوچو کہ آخر تم اپنی جانوں پر اتنا بڑا ظلم کیوں کر رہے ہو۔ یہی بات اللہ تعالیٰ نے سورۂ احقاف (۴) میں بھی بیان فرمائی ہے۔ ¤ ➋ { بَلْ اِنْ يَّعِدُ الظّٰلِمُوْنَ بَعْضُهُمْ بَعْضًا اِلَّا غُرُوْرًا :} یعنی بات یہ نہیں کہ ان شریکوں میں سے کسی کے پااس کوئی اختیار ہے، بلکہ اصل حقیقت یہ ہے کہ شرک کا کاروبار کرنے والے یہ تمام ظالم، یہ جھوٹے پیشوا اور پیر، یہ پنڈت، پروہت، یہ کاہن اور عراف، یہ مجاور اور ان کے ایجنٹ ایک دوسرے کو محض جھوٹے وعدے دلا رہے ہیں کہ فلاں آستانے پر جاؤ گے تو اولاد ملے گی، فلاں بزرگوں سے مدد مانگو گے تو سنگ دل محبوب موم ہو جائے گا، فلاں درگاہ سے ہر مراد پوری ہوتی ہے۔ غرض یہ سارا کاروبار دھوکے پر اور جھوٹے وعدوں پر چل رہا ہے، جیسا کہ فرمایا : « يَعِدُهُمْ وَ يُمَنِّيْهِمْ وَ مَا يَعِدُهُمُ الشَّيْطٰنُ اِلَّا غُرُوْرًا» [النساء : ۱۲۰ ] ’’وہ انھیں وعدے دیتا ہے اور انھیں آرزوئیں دلاتا ہے اور شیطان انھیں دھوکے کے سوا کچھ وعدہ نہیں دیتا۔‘‘ اور قیامت کے دن شیطان صاف کہہ دے گا : « اِنَّ اللّٰهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَ وَعَدْتُّكُمْ فَاَخْلَفْتُكُمْ۠ » [ إبراہیم : ۲۲ ] ’’بے شک اللہ نے تم سے وعدہ کیا، سچا وعدہ اور میں نے تم سے وعدہ کیا تو میں نے تم سے خلاف ورزی کی۔‘‘"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ {اِنَّ اللّٰهَ يُمْسِكُ السَّمٰوٰتِ وَ الْاَرْضَ اَنْ تَزُوْلَا…:} یعنی تمھارے بنائے ہوئے شریکوں کا تو یہ حال ہے کہ نہ انھوں نے زمین یا اس کی کوئی چیز پیدا کی، نہ آسمانوں میں ان کا کوئی حصہ ہے، وہ بے چارے تو اپنا آپ بھی نہیں سنبھال سکتے، جب کہ اللہ جل شانہ وہ ہے جس نے ساری کائنات پیدا فرمائی اور وہی اس کا نظام چلا رہا ہے۔ اسی نے اتنے عظیم آسمانوں کو اور زمین کو ان کی اپنی اپنی جگہ تھام رکھا ہے کہ کسی زلزلے یا حادثے سے اپنی جگہ سے ادھر ادھر نہیں ہوتے اور اگر یہ اپنی جگہ سے ہٹ جائیں تو اس کے سوا کوئی نہیں جو انھیں تھام سکے۔ اگر تم کہتے ہو کہ تمھارے شریک پیدا تو نہیں کر سکتے، نہ آسمانوں میں ان کا کوئی حصہ ہے مگر وہ گرتے ہوؤں کو تھام لیتے ہیں تو تمھارا یہ خیال بھی غلط ہے۔ گرتے ہوؤں کو تھامنا بھی اسی کا کام ہے جس نے ہر چیز کو اس کی جگہ تھام رکھا ہے۔ ¤ ➋ {اِنَّهٗ كَانَ حَلِيْمًا غَفُوْرًا :} یعنی تمھارے مشرکانہ اقوال و افعال تو اتنے خوفناک عذاب کے طالب ہیں کہ ان کی وجہ سے آسمان پھٹ جائیں، زمین شق ہو جائے اور پہاڑ تم پر ڈھے کر گر پڑیں، جیسا کہ فرمایا : « تَكَادُ السَّمٰوٰتُ يَتَفَطَّرْنَ مِنْهُ وَ تَنْشَقُّ الْاَرْضُ وَ تَخِرُّ الْجِبَالُ هَدًّا (90) اَنْ دَعَوْا لِلرَّحْمٰنِ وَلَدًا» [ مریم : ۹۰، ۹۱ ] ’’آسمان قریب ہیں کہ اس سے پھٹ پڑیں اور زمین شق ہوجائے اور پہاڑ ڈھے کر گر پڑیں کہ انھوں نے رحمان کے لیے کسی اولاد کا دعویٰ کیا۔‘‘ مگر اللہ تعالیٰ نے آسمانوں کو اور زمین کو گرنے سے روک رکھا ہے، کیونکہ وہ بے حد بردبار ہے، اس لیے مہلت پر مہلت دیے جا رہا ہے، بے حد بخشنے والا ہے، جو اس کے حلم سے فائدہ اٹھا کر توبہ کرے اس کے تمام گناہ بخش دیتا ہے۔ آیت کا ایک معنی یہ بھی ہو سکتا ہے کہ یہ مشرک اپنے شرک اور نافرمانی کی وجہ سے اس کے مستحق ہو چکے ہیں کہ ان پر آسمان گرا کر اور زمین شق کرکے انھیں تباہ و برباد کر دیا جائے، مگر اللہ تعالیٰ اپنے حلم و مغفرت کی وجہ سے آسمانوں کو اور زمین کو تھامے ہوئے ہے اور اگر یہ اپنی جگہ سے ٹل جائیں تو اس کے سوا کوئی طاقت نہیں جو انھیں تھام سکے۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ { وَ اَقْسَمُوْا بِاللّٰهِ جَهْدَ اَيْمَانِهِمْ …:} مشرکین کے کفر اور ناشکری کا اظہار شرک کی صورت میں بھی ہوتا تھا اور پیغمبر کو جھٹلانے کی صورت میں بھی، چنانچہ شرک کی تردید کے بعد پیغمبر کو جھٹلانے کی صورت میں ان کی ناشکری کا ذکر فرمایا۔ رسول اللہ صلی اللہ علیہ وسلم کی تشریف آوری سے پہلے مشرکین مکہ کی سفر کے دوران میں عرب کے دوسرے شہروں مثلاً یثرب اور خیبر وغیرہ میں یا دوسرے ملکوں مثلاً شام وغیرہ میں اہل کتاب سے ملاقات ہوتی تو وہ ان کی بت پرستی اور دوسری جہالتوں پر طعن کرتے، تو یہ اس کے جواب میں کہتے کہ تم لوگوں کے پاس تو اللہ کے رسول اور اس کی کتابیں آئیں، اگر ہمارے پاس کوئی پیغمبر آیا تو ہم کسی بھی امت سے زیادہ ہدایت یافتہ ہوں گے، اور اپنی اس بات پر پکی سے پکی جو قسم وہ کھا سکتے تھے کھاتے، جیسا کہ اللہ تعالیٰ نے دوسری جگہ فرمایا : «اَنْ تَقُوْلُوْۤا اِنَّمَاۤ اُنْزِلَ الْكِتٰبُ عَلٰى طَآىِٕفَتَيْنِ مِنْ قَبْلِنَا وَ اِنْ كُنَّا عَنْ دِرَاسَتِهِمْ لَغٰفِلِيْنَ (156) اَوْ تَقُوْلُوْا لَوْ اَنَّاۤ اُنْزِلَ عَلَيْنَا الْكِتٰبُ لَكُنَّاۤ اَهْدٰى مِنْهُمْ فَقَدْ جَآءَكُمْ بَيِّنَةٌ مِّنْ رَّبِّكُمْ وَ هُدًى وَّ رَحْمَةٌ فَمَننْ اَظْلَمُ مِمَّنْ كَذَّبَ بِاٰيٰتِ اللّٰهِ وَ صَدَفَ عَنْهَا » [ الأنعام : ۱۵۶، ۱۵۷ ] ’’ایسا نہ ہو کہ تم کہو کہ کتاب تو صرف ان دو گروہوں پر اتاری گئی جو ہم سے پہلے تھے اور بے شک ہم ان کے پڑھنے پڑھانے سے یقینا بے خبر تھے۔ یا یہ کہو کہ اگر ہم پر کتاب اتاری جاتی تو ہم ان سے زیادہ ہدایت والے ہوتے۔ پس بے شک تمھارے پاس تمھارے رب کی طرف سے ایک روشن دلیل اور ہدایت اور رحمت آچکی، پھر اس سے زیادہ ظالم کون ہے جو اللہ کی آیات کو جھٹلائے اور ان سے کنارا کرے۔‘‘ اور جیسا کہ فرمایا : «وَ اِنْ كَانُوْا لَيَقُوْلُوْنَ (167) لَوْ اَنَّ عِنْدَنَا ذِكْرًا مِّنَ الْاَوَّلِيْنَ (168) لَكُنَّا عِبَادَ اللّٰهِ الْمُخْلَصِيْنَ (169) فَكَفَرُوْا بِهٖ فَسَوْفَ يَعْلَمُوْنَ » [ الصافات : ۱۶۷ تا ۱۷۰ ] ’’اور بے شک وہ (کافر) تو کہا کرتے تھے۔ اگر ہمارے پاس پہلے لوگوں کی کوئی نصیحت ہوتی۔ تو ہم ضرور اللہ کے چنے ہوئے بندے ہوتے۔ تو انھوں نے اس کا انکار کر دیا، سو جلد ہی جان لیں گے۔‘‘ ¤ ➋ {فَلَمَّا جَآءَهُمْ نَذِيْرٌ مَّا زَادَهُمْ اِلَّا نُفُوْرًا :} تو جب ان کے پاس ڈرانے والا آیا تو بجائے اس کے کہ وہ کسی بھی امت سے زیادہ ہدایت قبول کرتے، وہ اپنے کفر و شرک پر اڑے رہے، بلکہ رسول کی آمد نے ان کے بدکنے اور دور بھاگنے میں اضافہ ہی کیا اور وہ پہلے سے بھی زیادہ ہدایت سے دور ہو گئے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ { اسْتِكْبَارًا فِي الْاَرْضِ :} یعنی ان کی رسول اللہ صلی اللہ علیہ وسلم کو جھٹلانے او اور ہدایت سے بدکنے اور دور بھاگنے کی وجہ یہ نہ تھی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کو جھوٹا سمجھتے تھے، بلکہ اس کی ایک وجہ یہ تھی کہ وہ زمین پر رہ کر، جو اللہ تعالیٰ کی کائنات میں پستی کی انتہا ہے، اونچے اور بڑے بن کر رہنا چاہتے تھے، جو پیغمبر کی اطاعت قبول کرنے کی صورت میں ممکن نہ تھا، کیونکہ اس وقت انھیں اپنی مرضی چھوڑ کر اللہ کے حکم کے تابع ہونا پڑتا تھا، جو انھیں منظور نہ تھا۔ ¤ ➋ { وَ مَكْرَ السَّيِّئِ :} اور حق سے زیادہ دور ہونے کی دوسری وجہ یہ تھی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے صدق و امانت کو جاننے کے باوجود آپ پر ایمان لانے کے بجائے حق کا راستہ روکنے اور آپ صلی اللہ علیہ وسلم کو نقصان پہنچانے کے لیے بہت بری تدبیریں اور خوف ناک سازشیں اختیار کیں، جس کا نتیجہ یہ ہوا کہ حق قبول کرنے کے بجائے ضد میں آ کر وہ اس سے بہت دور ہو گئے، جیسا کہ سورۂ انفال (۳۰) میں کفار مکہ کی رسول اللہ صلی اللہ علیہ وسلم کے خلاف قید، جلاوطنی یا قتل کی تدبیروں کا ذکر ہے۔ ¤ ➌ { وَ لَا يَحِيْقُ الْمَكْرُ السَّيِّئُ اِلَّا بِاَهْلِهٖ: ’’حَاقَ يَحِيْقُ‘‘} اور {’’أَحَاطَ يُحِيْطُ‘‘} دونوں کا معنی گھیرنا ہے، یعنی بری تدبیر جس کے متعلق کی جائے ہو سکتا ہے اسے تھوڑا بہت نقصان پہنچ جائے، مگر وہ پوری طرح گھیرا اور احاطہ بری تدبیر کرنے والے ہی کا کرتی ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کے خلاف سازشوں سے آپ صلی اللہ علیہ وسلم کا کچھ نہیں بگڑا، بلکہ ان سازشوں نے غزوۂ بدر، احد، خندق اور فتح مکہ میں کفار ہی کو گھیرے میں لے کر انھیں ناکام و نامراد کر دیا۔ ¤ ➍ { فَهَلْ يَنْظُرُوْنَ اِلَّا سُنَّتَ الْاَوَّلِيْنَ:} یعنی اگر یہ اپنی روش نہ بد لیں گے اور اپنی سرکشی میں بڑھتے جائیں گے تو پہلے کافروں کی طرح ان پر عذاب نازل ہو کر رہے گا۔ ¤ ➎ { فَلَنْ تَجِدَ لِسُنَّتِ اللّٰهِ تَبْدِيْلًا :} یعنی اللہ تعالیٰ کا دستور جو پہلے سے چلا آ رہا ہے کہ وہ مجرموں کو مہلت دیتا ہے، پھر پکڑ لیتا ہے، تم اس میں کسی قسم کی تبدیلی نہیں پاؤ گے کہ ان مجرموں کی رسی ہمیشہ دراز رہے، یا انھیں عذاب کے بجائے انعام سے نوازا جائے۔ اس میں کفار کے لیے وعید ہے اور رسول اللہ صلی اللہ علیہ وسلم اور اہل ایمان کے لیے تسلی اور بشارت ہے۔ ¤ ➏ { فَلَنْ تَجِدَ لِسُنَّتِ اللّٰهِ تَبْدِيْلًا :} نہ ہی یہ ہو گا کہ اللہ تعالیٰ کوئی کام ہونے کا حکم دے یا کسی قوم پر عذاب نازل کرنے کا ارادہ کرے اور عذاب نازل نہ ہو، یا کسی قوم پر عذاب کا ارادہ کرے اور وہ اس سے پھیر کر کسی اور قوم پر نازل کر دیا جائے، جیسا کہ فرمایا : « وَ اِذَاۤ اَرَادَ اللّٰهُ بِقَوْمٍ سُوْٓءًا فَلَا مَرَدَّ لَهٗ » [ الرعد : ۱۱ ] ’’اور جب اللہ کسی قوم کے ساتھ برائی کا ارادہ کر لے تو اسے ہٹانے کی کوئی صورت نہیں۔‘‘"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ {اَوَ لَمْ يَسِيْرُوْا فِي الْاَرْضِ …:} اس کی تفسیر کے لیے دیکھیے سورۂ روم کی آیت (۹) کی تفسیر۔ ¤ ➋ { وَ مَا كَانَ اللّٰهُ لِيُعْجِزَهٗ مِنْ شَيْءٍ …:} یعنی آسمان و زمین یعنی ساری کائنات میں کوئی چیز اللہ تعالیٰ کو عاجز نہیں کر سکتی کہ وہ اسے پکڑ نہ سکے، یا پکڑنے کے بعد وہ اس کی گرفت سے نکل کر بھاگ جائے۔ ¤ ➌ {اِنَّهٗ كَانَ عَلِيْمًا قَدِيْرًا :} کیونکہ وہ ہمیشہ سے سب کچھ جاننے والا ہے اور ہر چیز پر پوری طرح قادر ہے، یعنی یہ نہیں ہو سکتا کہ کوئی چیز اسے عاجز کر دے، وہ اسے اس لیے نہ پکڑ سکے کہ اسے پتا ہی نہ چلے کہ وہ کہاں ہے، یا اسے معلوم تو ہو مگر وہ اسے پکڑنے کی طاقت نہ رکھے۔ ہمیشہ کا معنی {’’ كَانَ ‘‘} کا لفظ ادا کر رہا ہے۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ {وَ لَوْ يُؤَاخِذُ اللّٰهُ النَّاسَ بِمَا كَسَبُوْا … :} اس کی تفسیر کے لیے دیکھیے سورۂ نحل کی آیت (۶۱) کی تفسیر۔ ¤ ➋ { فَاِذَا جَآءَ اَجَلُهُمْ فَاِنَّ اللّٰهَ كَانَ بِعِبَادِهٖ بَصِيْرًا :} یعنی جب ان کا مقرر وقت آ گیا تو اللہ ہمیشہ سے اپنے بندوں کو خوب دیکھنے والا ہے، اسے خوب معلوم ہے کہ کون کہاں ہے۔ لہٰذا اس وقت نہ کوئی اس سے چھپا رہ سکے گا، نہ اس کی گرفت سے بچ سکے گا، پھر کسی کا حال اس سے پوشیدہ نہیں، وہ ہر ایک کو اس کے اچھے یا برے عمل کا ٹھیک ٹھیک بدلا دے گا۔"
    }
  ]
}