{
  "surah": "As-Saaffaat",
  "surah_number": 37,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) { وَ الصّٰٓفّٰتِ صَفًّا :} قسم عموماً تاکید کے لیے استعمال کی جاتی ہے، جب مخاطب کسی بات کا منکر ہو۔ بعض اوقات کسی بات کی عظمت اور اہمیت واضح کرنے کے لیے بھی قسم اٹھائی جاتی ہے۔ قرآن مجید کی اکثر قسموں پر غور کرنے سے ظاہر ہوتا ہے کہ قسم عموماً اس بات کی دلیل ہوتی ہے جو قسم کے بعد بیان ہوتی ہے۔ {’’ الصّٰٓفّٰتِ ‘‘ ’’صَافَّةٌ ‘‘} کی جمع ہے، صف بنانے والی جماعت۔ ان جماعتوں سے اکثر مفسرین نے فرشتے مراد لیے ہیں، کیونکہ اللہ تعالیٰ نے ان کی یہ صفت خود ان کی زبانی بیان فرمائی ہے، فرمایا : «وَ اِنَّا لَنَحْنُ الصَّآفُّوْنَ (165) وَ اِنَّا لَنَحْنُ الْمُسَبِّحُوْنَ» [ الصافات : ۱۶۵، ۱۶۶ ] ’’اور بلاشبہ ہم، یقینا ہم صف باندھنے والے ہیں۔ اور بلاشبہ ہم، یقینا ہم تسبیح کرنے والے ہیں۔‘‘ حذیفہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فُضِّلْنَا عَلَی النَّاسِ بِثَلاَثٍ، جُعِلَتْ صُفُوْفُنَا كَصُفُوْفِ الْمَلَائِكَةِ وَ جُعِلَتْ لَنَا الْأَرْضُ كُلُّهَا مَسْجِدًا وَ جُعِلَتْ تُرْبَتُهَا لَنَا طَهُوْرًا إِذَا لَمْ نَجِدِ الْمَاءَ] [مسلم، المساجد و مواضع الصلاۃ : ۵۲۲ ] ’’ہمیں دوسرے لوگوں پر تین باتوں میں فضیلت دی گئی ہے، ہماری صفیں فرشتوں کی صفوں کی طرح بنائی گئی ہیں اور ہمارے لیے ساری زمین مسجد بنا دی گئی ہے اور ہمارے لیے اس کی مٹی پاک کرنے والی بنا دی گئی ہے جب ہمیں پانی نہ ملے۔‘‘ اور جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَلَا تَصُفُّوْنَ كَمَا تَصُفُّ الْمَلَائِكَةُ عِنْدَ رَبِّهَا؟ فَقُلْنَا يَا رَسُوْلَ اللّٰهِ! وَكَيْفَ تَصُفُّ الْمَلَائِكَةُ عِنْدَ رَبِّههَا؟ قَالَ يُتِمُّوْنَ الصُّفُوْفَ الْأُوَلَ وَيَتَرَاصُّوْنَ فِي الصَّفِّ ] [ مسلم، الصلاۃ، باب الأمر بالسکون في الصلاۃ… : ۴۳۰ ] ’’کیا تم اس طرح صفیں نہیں بناتے جس طرح فرشتے اپنے رب کے پاس صفیں بناتے ہیں؟‘‘ ہم نے کہا : ’’اے اللہ کے رسول! فرشتے اپنے رب کے پاس کس طرح صفیں بناتے ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ (پہلے) پہلی صفیں مکمل کرتے ہیں اور صف میں چونا گچ ہو کر کھڑے ہوتے ہیں۔‘‘"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) { فَالزّٰجِرٰتِ زَجْرًا :} ’’فاء‘‘ اس بات کی دلیل ہے کہ ان سے مراد بھی فرشتے ہیں، جن کا ذکر پچھلی آیت میں ہے۔ {’’ زَجْرًا ‘‘} تاکید کے لیے ہے، یعنی پھر ان فرشتوں کی قسم! جن کی ڈانٹ معمولی نہیں بلکہ ایسی زبردست ہوتی ہے کہ اللہ تعالیٰ کی پیدا کردہ مخلوقات، خواہ کتنی بے پناہ قوت کی مالک ہوں، ان کے سامنے دم نہیں مار سکتیں، مثلاً موت کے فرشتے۔ (دیکھیے انعام : ۹۳) ہواؤں اور بادلوں پر مامور فرشتے جو انھیں ہانکتے اور چلاتے ہیں۔ (دیکھیے رعد : ۱۳) پہاڑوں پر مامور فرشتہ، جس نے رسول اللہ صلی اللہ علیہ وسلم کی طائف سے واپسی پر اللہ کے حکم سے آپ کو پیش کش کی کہ اگر آپ فرمائیں تو میں آپ کی قوم کے کفار کو دو پہاڑوں کے درمیان پیس کر ملیامیٹ کر دوں۔ صور میں پھونکنے والا فرشتہ، جس کی ایک ہی ڈانٹ سے تمام لوگ قبروں سے نکل کر زمین کے اوپر ہوں گے، جیسا کہ فرمایا : « فَاِنَّمَا هِيَ زَجْرَةٌ وَّاحِدَةٌ (13) فَاِذَا هُمْ بِالسَّاهِرَةِ » [ النازعات : ۱۳، ۱۴] ’’پس وہ تو صرف ایک ہی ڈانٹ ہو گی۔ پس یک لخت وہ زمین کے اوپر موجود ہوں گے۔‘‘"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {فَالتّٰلِيٰتِ ذِكْرًا:} اس سے مراد بھی فرشتے ہیں جو اللہ تعالیٰ کی طرف سے اس کے انبیاء پر ذکر نازل کرتے ہیں اور لوگوں کے دلوں میں نیکی کا خیال ڈالتے ہیں، جیسا کہ فرمایا : « فَالْمُلْقِيٰتِ ذِكْرًا (5) عُذْرًا اَوْ نُذْرًا » [ المرسلات : ۵، ۶ ] ’’پھر جو (دلوں میں) یاد (الٰہی) ڈالنے والے ہیں۔ عذر کے لیے یا ڈرانے کے لیے۔‘‘"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {اِنَّ اِلٰهَكُمْ لَوَاحِدٌ :} یعنی اللہ کے حکم سے کائنات کا نظام چلانے والے فرشتے، جو اس کے سامنے صف بستہ کھڑے ہوتے ہیں اور جن کی ڈانٹ سے زمین و آسمان کے معاملات کی تدبیر ہوتی ہے اور جو پیغمبروں پر وحی نازل کرتے ہیں اور ذکر الٰہی کی تلاوت کرتے ہیں، یہ سب فرشتے شاہد اور دلیل ہیں کہ کائنات کا معبودِ حقیقی ایک ہے۔ کیونکہ اگر وہ ایک نہ ہو تو یہ کائنات ایک لمحے کے لیے قائم نہیں رہ سکتی، بلکہ ایک دوسرے سے ٹکرا کر فنا ہو جائے گی، جیسا کہ فرمایا : « لَوْ كَانَ فِيْهِمَاۤ اٰلِهَةٌ اِلَّا اللّٰهُ لَفَسَدَتَا» [ الأنبیاء : ۲۲ ] ’’اگر ان دونوں (زمین و آسمان) میں اللہ کے سوا کوئی اور معبود ہوتے تو وہ دونوں ضرور بگڑ جاتے۔‘‘ شاہ عبدالقادر رحمہ اللہ نے ان تینوں آیات کی ایک اور بہت عمدہ تفسیر فرمائی ہے، وہ لکھتے ہیں : ’’فرشتے کھڑے ہوتے ہیں قطار ہو کر سننے کو حکم اللہ کا، پھر جھڑکتے ہیں شیطانوں کو جو سننے کو جا لگتے ہیں، پھر جب اتر چکا، تو اس کو پڑھتے ہیں ایک دوسرے کو سنانے کو۔‘‘ (موضح) اگلی آیات میں اس دعوے کی مزید دلیلیں بیان فرمائی ہیں۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊{ رَبُّ السَّمٰوٰتِ وَ الْاَرْضِ وَ مَا بَيْنَهُمَا :} مراد اس سے پوری کائنات ہے۔ اللہ تعالیٰ نے قرآن مجید میں بار بار اپنے اکیلے رب ہونے کو اکیلا معبود ہونے کی دلیل کے طور پر پیش فرمایا ہے کہ جب ہر چیز کا مالک اور رب میں ہوں اور تم بھی مانتے ہو کہ ہر چیز پیدا میں نے کی اور اس کی پرورش بھی میں ہی کرتا ہوں، تو عبادت کسی اور کی کیوں ہو؟ داتا اور دستگیر کوئی اور کس طرح بن گیا؟ مصیبت کے وقت کسی اور کو پکارا کیوں جائے؟ ¤ ➋ {وَ رَبُّ الْمَشَارِقِ : ’’ الْمَشَارِقِ ‘‘ ’’مَشْرِقٌ‘‘} کی جمع ہے، طلوع ہونے کی جگہ۔ سورج ہمیشہ مشرقی سمت کے درمیان سے طلوع نہیں ہوتا، بلکہ گرمیوں میں اس کا مشرق شمال کی طرف سرکتا جاتا ہے اور سردیوں میں جنوب کی طرف اور ہر روز سورج کے طلوع ہونے کی جگہ الگ ہوتی ہے، اس لحاظ سے سال بھر میں سورج کے ۳۶۵ مشرق ہوتے ہیں۔ پھر اس کائنات میں صرف سورج ہی گردش نہیں کرتا، چاند اور بے شمار سیارے طلوع و غروب ہوتے ہیں۔ ہر ایک کے طلوع ہونے کے اپنے اپنے مقامات ہیں، جن میں سورج کے مشرقوں کی طرح تبدیلی ہوتی رہتی ہے۔ اس لحاظ سے مشرقوں کی تعداد ہمارے حساب سے باہر ہے۔ یہاں صرف مشارق کے ذکر پر اکتفا فرمایا، کیونکہ ظاہر ہے کہ جو مشرقوں کا رب ہے مغربوں کا رب بھی وہی ہے۔ سورۂ معارج (۷۰) میں مشارق و مغارب دونوں کے رب کی قسم کھائی ہے۔ اللہ تعالیٰ کے رب المشارق ہونے کا مطلب یہ ہے کہ سورج اور ان تمام سیاروں کی نقل و حرکت کا مالک وہی ہے، کسی اور کا اس میں کچھ دخل نہیں۔ {’’ رَبُّ الْمَشَارِقِ ‘‘} میں ایک اور نکتہ بھی ہے کہ سورج اپنی روزانہ کی گردش میں اس زمین کے مختلف حصوں پر ایک دوسرے کے بعد پے در پے طلوع ہوتا ہے۔ جہاں زمین کا کوئی حصہ سورج کے سامنے آتا ہے وہی اس کا مشرق ہے۔ اس لحاظ سے بھی نہ مشرقوں کا شمار ہے نہ مغربوں کا۔ ( الوسیط)"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {اِنَّا زَيَّنَّا السَّمَآءَ الدُّنْيَا بِزِيْنَةٍ الْكَوَاكِبِ:’’ الدُّنْيَا ‘‘ ’’اَلْأَدْنٰي‘‘} کی مؤنث ہے، سب سے قریب، یعنی جو آسمان ہماری زمین سے دکھائی دیتا ہے۔ {’’زِيْنَةٌ‘‘} پر تنوین تنکیر کی ہے، اس لیے ترجمہ ’’ایک انوکھی زینت‘‘ کیا ہے۔ {’’ الْكَوَاكِبِ ‘‘ ’’زِيْنَةٌ‘‘} سے بدل ہے، ترجمے میں اسے ملحوظ رکھا گیا ہے۔ معلوم ہوا کہ ستاروں کی پیدائش کی بے شمار حکمتوں میں سے ایک آسمان دنیا کی آرائش و زیبائش ہے۔ اگر ستارے نہ ہوں تو نہ آسمان کا یہ حسن ہو نہ زمین پر روشنی ہو۔ اس لیے اللہ تعالیٰ نے انھیں چراغ بھی فرمایا ہے : «وَ لَقَدْ زَيَّنَّا السَّمَآءَ الدُّنْيَا بِمَصَابِيْحَ وَ جَعَلْنٰهَا رُجُوْمًا لِّلشَّييٰطِيْنِ وَ اَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيْرِ » [ الملک : ۵ ] ’’اور بلاشبہ یقینا ہم نے قریب کے آسمان کو چراغوں کے ساتھ زینت بخشی اور ہم نے انھیں شیطانوںکو مارنے کے آلے بنایا اور ہم نے ان کے لیے بھڑکتی ہوئی آگ کا عذاب تیار کر رکھا ہے۔‘‘"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {وَ حِفْظًا مِّنْ كُلِّ شَيْطٰنٍ مَّارِدٍ : ’’ مَارِدٍ ‘‘ ’’شَدِيْدُ الشَّرِّ‘‘} یعنی زینت کے علاوہ آسمان دنیا کو ہر سرکش شیطان سے محفوظ کرنے کے لیے بنایا ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { لَا يَسَّمَّعُوْنَ اِلَى الْمَلَاِ الْاَعْلٰى … : ’’ لَا يَسَّمَّعُوْنَ ‘‘} اصل میں {’’لَا يَتَسَمَّعُوْنَ‘‘} (تفعّل) ہے۔ ’’اوپر کی مجلس‘‘ سے مراد فرشتوں کی مجلس ہے جو اللہ تعالیٰ کے احکام کی تنفیذ کے لیے آپس میں گفتگو کرتے ہیں کہ آئندہ فلاں کام کب اور کیسے کرنا ہے۔ یعنی ان ستاروں کے ذریعے سے سرکش شیاطین سے فرشتوں کی باتیں محفوظ رکھنے کا اتنا زبردست انتظام ہے کہ وہ ان کی مجلس کی طرف کان بھی نہیں لگا سکتے، بلکہ ان پر ہر جانب سے شہاب پھینکے جاتے ہیں۔ اگر {’’ اِلَّا مَنْ خَطِفَ الْخَطْفَةَ ‘‘} کا استثنا نہ ہوتا تو یہ آیت دلیل تھی کہ وہ کچھ بھی نہیں سن سکتے، مگر اللہ تعالیٰ نے خود ہی {’’ اِلَّا مَنْ خَطِفَ الْخَطْفَةَ ‘‘} (مگر جو کوئی اچانک اچک کر لے جائے) کے ساتھ استثنا فرما دیا، جو آگے آرہا ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {دُحُوْرًا وَّ لَهُمْ عَذَابٌ وَّاصِبٌ:’’دَحَرَ يَدْحَرُ دَحْرًا وَ دُحُوْرًا‘‘} (ف) بھگانا، دفع کرنا۔ {’’ وَّاصِبٌ ‘‘ ’’وَصَبَ يَصِبُ وُصُوْبًا‘‘} (ض) دائمی ہونا۔ یعنی ان کے لیے دائمی عذاب ہے، کیونکہ دنیا میں بھگانے کے لیے ان پر شہاب پھینکے جاتے ہیں اور آخرت میں جہنم کا عذاب اس کے علاوہ ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {اِلَّا مَنْ خَطِفَ الْخَطْفَةَ … :} یعنی شیاطین ملأ اعلیٰ کی کسی بات پر کان نہیں لگا سکتے، سوائے اس بات کے جسے کوئی شیطان دفعتاً اچک کر لے جائے، تو ایسی صورت میں ایک چمکتا ہوا شعلہ اس کا پیچھا کرتا ہے۔ چنانچہ کبھی تو وہ شعلہ نیچے کے شیطان کو وہ بات پہنچانے سے پہلے ہی لگ کر اسے ہلاک کر ڈالتا ہے اور کبھی پہنچانے کے بعد، پھر وہ بات کئی شیاطین سے منتقل ہوتی ہوئی کسی کاہن تک پہنچ جاتی ہے، جو اس میں سو جھوٹ ملا کر لوگوں کے درمیان پھیلا دیتا ہے۔ استاذ محمد عبدہٗ رحمہ اللہ لکھتے ہیں : ’’یہ بحث حکماء اور علماء کے مابین مختلف فیہ چلی آئی ہے کہ آیا یہی تارے شہابِ ثاقب کا بھی کام دیتے ہیں یا وہ شہاب ان کے علاوہ ہیں، یا ان تاروں کی گرمی سے آگ پیدا ہو کر ہی انگارا بن جاتا ہے۔‘‘ شاہ عبد القادر لکھتے ہیں : ’’انھی تاروں کی روشنی سے آگ نکلتی ہے جس سے شیطانوں کو مار پڑتی ہے، جیسے سورج سے اور آتشی شیشے سے۔‘‘ (موضح) ان آیات کی مفصل تفسیر کے لیے دیکھیے سورۂ حجر (۱۶تا۱۸)، شعراء (۲۱۰ تا ۲۱۲ اور ۲۲۲، ۲۲۳) اور سورۂ جن (۸، ۹)۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {فَاسْتَفْتِهِمْ اَهُمْ اَشَدُّ خَلْقًا … :} کفار آخرت کو ماننے کے لیے تیار نہیں تھے، ان کا کہنا تھا کہ مرنے کے بعد دوبارہ زندہ ہونا ممکن ہی نہیں۔ اللہ تعالیٰ نے یہاں ان کے جواب میں دو دلیلیں ذکر فرمائی ہیں، پہلی یہ کہ اس سے پہلے ہم جو کچھ پیدا کر چکے ہیں، جن کا اس سورت میں ذکر ہے، یعنی آسمان و زمین اور ان کے درمیان کی مخلوق، صافات، زاجرات، تالیات، فرشتے، شیاطین اور ستارے وغیرہ، انھیں پیدا کرنا مشکل ہے یا ان لوگوں کو دوبارہ پیدا کرنا؟ ظاہر ہے اتنی عظیم مخلوقات کے مقابلے میں انسان بے چارے کی حیثیت ہی کیا ہے کہ اللہ تعالیٰ اسے دوبارہ زندہ نہ کر سکے، جیسا کہ فرمایا : «لَخَلْقُ السَّمٰوٰتِ وَ الْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ » [ المؤمن : ۵۷ ] ’’یقینا آسمانوں اور زمین کا پیدا کرنا لوگوں کے پیدا کرنے سے زیادہ بڑا (کام) ہے اور لیکن اکثر لوگ نہیں جانتے۔‘‘ مزید تفصیل کے لیے دیکھیے سورۂ یٰس (۸۱)۔ ¤ دوسری دلیل یہ ہے کہ ہم نے انھیں ایک چپکتے ہوئے گارے سے پیدا کیا ہے (جو مٹی اور پانی کے ملنے سے بنتا ہے) اور یہ مر کر پھر مٹی ہو جائیں گے۔ تو جب پہلی دفعہ ہم نے انھیں مٹی سے پیدا کر لیا تو اسی مٹی سے ہم انھیں دوبارہ کیوں پیدا نہیں کر سکتے، جب کہ اس سے پہلے ہم ایک مرتبہ انھیں پیدا کر بھی چکے ہیں!؟ (دیکھیے حج : ۵) اور ہر عقل مند جانتا ہے کہ دوسری مرتبہ بنانا پہلی مرتبہ سے آسان ہوتا ہے، یہی حقیقت اللہ تعالیٰ نے سورۂ روم میں بیان کرتے ہوئے فرمایا : «وَ هُوَ الَّذِيْ يَبْدَؤُا الْخَلْقَ ثُمَّ يُعِيْدُهٗ وَ هُوَ اَهْوَنُ عَلَيْهِ »  [ الروم : ۲۷ ] ’’اور وہی ہے جو خلق کو پہلی بار پیدا کرتا ہے، پھراسے دوبارہ پیدا کرے گا اور وہ اسے زیادہ آسان ہے۔‘‘"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 13,12) ➊ {بَلْ عَجِبْتَ :} یہاں ایک سوال ہے کہ یہاں {’’ بَلْ ‘‘} لانے کا کیا فائدہ ہے؟ جواب اس کا یہ ہے کہ پچھلی آیت میں اللہ تعالیٰ نے حکم دیا {’’ فَاسْتَفْتِهِمْ ‘‘} (ان سے پوچھ) کہ تمھیں دوبارہ پیدا کرنا زیادہ مشکل ہے یا جو کچھ ہم پیدا کر چکے؟ جواب اس کا اس کے سوا ہو ہی نہیں سکتا کہ یقینا وہ سب کچھ انسان کے دوبارہ پیدا کرنے سے زیادہ مشکل ہے جو اللہ تعالیٰ نے اس سورت کے شروع میں بیان فرمایا ہے۔ چنانچہ اس سوال کا مقصد انھیں لاجواب کرنے کے علاوہ کچھ نہیں۔ اتنے واضح دلائل کے باوجود یہ لوگ قیامت سے انکار کیوں کرتے ہیں، یہ بات انسان کی سمجھ میں نہیں آ سکتی، بلکہ اے نبی یا اے مخاطب! اس پر تجھے تعجب ہوتا ہے اور تعجب ہونا بھی چاہیے، کیونکہ بات ہی تعجب کی ہے، جیسا کہ فرمایا : « وَ اِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ ءَاِذَا كُنَّا تُرٰبًا ءَاِنَّا لَفِيْ خَلْقٍ جَدِيْدٍ اُولٰٓىِٕكَ الَّذِيْنَ  كَفَرُوْا بِرَبِّهِمْ وَ اُولٰٓىِٕكَ الْاَغْلٰلُ فِيْۤ اَعْنَاقِهِمْ وَ اُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِيْهَا خٰلِدُوْنَ» [ الرعد : ۵ ] ’’اور اگر تو تعجب کرے تو ان کا یہ کہنا بہت عجیب ہے کہ کیا جب ہم مٹی ہو جائیں گے تو کیا واقعی ہم یقینا ایک نئی پیدائش میں ہوں گے۔ یہی لوگ ہیں جنھوں نے اپنے رب کا انکار کیا اور یہی ہیں جن کی گردنوں میں طوق ہوں گے اور یہی آگ والے ہیں، وہ اس میں ہمیشہ رہنے والے ہیں۔‘‘ ¤ ➋ {وَ يَسْخَرُوْنَ :} یعنی تجھے ان پر تعجب ہوتا ہے اور ان کا حال یہ ہے کہ جب دلائل سے لاجواب ہوتے ہیں تو مذاق اڑاتے ہیں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13,12) ➊ {بَلْ عَجِبْتَ :} یہاں ایک سوال ہے کہ یہاں {’’ بَلْ ‘‘} لانے کا کیا فائدہ ہے؟ جواب اس کا یہ ہے کہ پچھلی آیت میں اللہ تعالیٰ نے حکم دیا {’’ فَاسْتَفْتِهِمْ ‘‘} (ان سے پوچھ) کہ تمھیں دوبارہ پیدا کرنا زیادہ مشکل ہے یا جو کچھ ہم پیدا کر چکے؟ جواب اس کا اس کے سوا ہو ہی نہیں سکتا کہ یقینا وہ سب کچھ انسان کے دوبارہ پیدا کرنے سے زیادہ مشکل ہے جو اللہ تعالیٰ نے اس سورت کے شروع میں بیان فرمایا ہے۔ چنانچہ اس سوال کا مقصد انھیں لاجواب کرنے کے علاوہ کچھ نہیں۔ اتنے واضح دلائل کے باوجود یہ لوگ قیامت سے انکار کیوں کرتے ہیں، یہ بات انسان کی سمجھ میں نہیں آ سکتی، بلکہ اے نبی یا اے مخاطب! اس پر تجھے تعجب ہوتا ہے اور تعجب ہونا بھی چاہیے، کیونکہ بات ہی تعجب کی ہے، جیسا کہ فرمایا : « وَ اِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ ءَاِذَا كُنَّا تُرٰبًا ءَاِنَّا لَفِيْ خَلْقٍ جَدِيْدٍ اُولٰٓىِٕكَ الَّذِيْنَ  كَفَرُوْا بِرَبِّهِمْ وَ اُولٰٓىِٕكَ الْاَغْلٰلُ فِيْۤ اَعْنَاقِهِمْ وَ اُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِيْهَا خٰلِدُوْنَ» [ الرعد : ۵ ] ’’اور اگر تو تعجب کرے تو ان کا یہ کہنا بہت عجیب ہے کہ کیا جب ہم مٹی ہو جائیں گے تو کیا واقعی ہم یقینا ایک نئی پیدائش میں ہوں گے۔ یہی لوگ ہیں جنھوں نے اپنے رب کا انکار کیا اور یہی ہیں جن کی گردنوں میں طوق ہوں گے اور یہی آگ والے ہیں، وہ اس میں ہمیشہ رہنے والے ہیں۔‘‘ ¤ ➋ {وَ يَسْخَرُوْنَ :} یعنی تجھے ان پر تعجب ہوتا ہے اور ان کا حال یہ ہے کہ جب دلائل سے لاجواب ہوتے ہیں تو مذاق اڑاتے ہیں۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) {وَ اِذَا رَاَوْا اٰيَةً يَّسْتَسْخِرُوْنَ : ’’سَخِرَ يَسْخَرُ‘‘} (س) مذاق اڑانا اور {’’اِسْتَسْخَرَ‘‘} (استفعال) میں حروف زیادہ ہونے کی وجہ سے معنی میں مبالغہ پیدا ہو گیا، اس لیے ترجمہ میں لفظ ’’خوب‘‘ کا اضافہ کیا گیا ہے۔ یعنی جب کوئی معجزہ دیکھتے ہیں، مثلاً چاند کا پھٹنا یا آپ کا راتوں رات مسجد اقصیٰ تک سیر کر کے آجانا اور اس کے متعلق ان کے ہر سوال کا درست جواب دینا وغیرہ، تو ایمان لانے کے بجائے خوب مذاق اڑاتے ہیں۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) {وَ قَالُوْۤا اِنْ هٰذَاۤ اِلَّا سِحْرٌ مُّبِيْنٌ :} یعنی ہر معجزے کو جادو قرار دے کر ایمان لانے سے انکار کر دیتے ہیں۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 17،16) {ءَاِذَا مِتْنَا وَ كُنَّا تُرَابًا … :} ان آیات کی تفسیر اور {’’ ءَاِذَا مِتْنَا ‘‘} اور {’’ ءَاِنَّا ‘‘} میں دو دفعہ ہمزہ استفہام لانے کی حکمت کے لیے دیکھیے سورۂ نمل (۶۷، ۶۸)۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17،16) {ءَاِذَا مِتْنَا وَ كُنَّا تُرَابًا … :} ان آیات کی تفسیر اور {’’ ءَاِذَا مِتْنَا ‘‘} اور {’’ ءَاِنَّا ‘‘} میں دو دفعہ ہمزہ استفہام لانے کی حکمت کے لیے دیکھیے سورۂ نمل (۶۷، ۶۸)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ {قُلْ نَعَمْ :} یعنی آپ ان سے کہیں ہاں، تم اور تمھارے باپ دادا مٹی اور ہڈیاں ہونے کے بعد دوبارہ اٹھائے جاؤ گے۔ ¤ ➋ { وَ اَنْتُمْ دَاخِرُوْنَ : ’’دَخَرَ يَدْخَرُ دُخُوْرًا‘‘} (ف) ذلیل اور حقیر ہونا۔ یعنی تم اس حال میں اٹھائے جاؤ گے کہ اللہ عزوجل کی قدرت کے سامنے بے بس اور حقیر ہو گے۔ تمھارا اٹھنا اختیاری نہیں بلکہ اضطراری ہو گا، یعنی جس طرح تمھاری پیدائش اور موت میں تمھاری اپنی مرضی کا کوئی عمل دخل نہ تھا، اسی طرح تم دوبارہ جی اٹھنے پر بھی مجبور اور بے بس ہو گے، جیسا کہ فرمایا : «وَ كُلٌّ اَتَوْهُ دٰخِرِيْنَ » [ النمل : ۸۷ ] ’’اور وہ سب اس کے پاس ذلیل ہو کر آئیں گے۔‘‘"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ {فَاِنَّمَا هِيَ زَجْرَةٌ وَّاحِدَةٌ :} اس سے مراد دوسرا نفخہ ہے۔ یعنی انھیں دوبارہ اٹھانے کے لیے اللہ تعالیٰ کو کسی خاص اہتمام کی ضرورت نہیں ہو گی، بلکہ صور کی ایک پھونک ایسی زبردست ڈانٹ اور اٹھ جانے کا اعلان ہو گی کہ سب قبروں سے نکل کر زمین کے اوپر ہوں گے، جیسا کہ فرمایا : « فَاِنَّمَا هِيَ زَجْرَةٌ وَّاحِدَةٌ (13) فَاِذَا هُمْ بِالسَّاهِرَةِ » [ النازعات : ۱۳، ۱۴ ] ’’پس وہ تو صرف ایک ہی ڈانٹ ہو گی۔ پس یک لخت وہ زمین کے اوپر ہوں گے۔‘‘ ¤ ➋ { فَاِذَا هُمْ يَنْظُرُوْنَ :} یعنی اس ایک ہی ڈانٹ سے سب مردے خواہ مٹی ہو چکے ہوں، یکایک زندہ ہو کر قیامت کو اپنی آنکھوں سے دیکھ رہے ہوں گے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {وَ قَالُوْا يٰوَيْلَنَا هٰذَا يَوْمُ الدِّيْنِ :} قیامت کے دن کفار کے پچھتانے اور اپنے آپ کو ملامت کرنے کا ذکر ہو رہا ہے کہ وہ اس وقت اپنی ہلاکت کو آواز دیں گے اور کہیں گے، ہائے ہماری بربادی! یہی جزا کا دن ہے، حالانکہ اس وقت ندامت کا کوئی فائدہ نہیں ہوگا۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {هٰذَا يَوْمُ الْفَصْلِ الَّذِيْ كُنْتُمْ بِهٖ تُكَذِّبُوْنَ :} اس وقت فرشتے اور مومن انھیں کہیں گے، یا وہ خود ایک دوسرے کو ملامت کے لیے کہیں گے، ہاں! یہی وہ فیصلے کا دن ہے جسے تم نہیں مانتے تھے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 23،22) ➊ {اُحْشُرُوا الَّذِيْنَ ظَلَمُوْا وَ اَزْوَاجَهُمْ … :} یہاں {’’ الَّذِيْنَ ظَلَمُوْا ‘‘} سے مراد کفار و مشرکین ہیں۔ اس کی دلیل یہ ہے کہ انھیں اور ان کے ’’من دون اللہ‘‘ معبودوں کو جہنم کی طرف لے جانے کا حکم ہو گا اور ظاہر ہے موحد مسلمان اللہ کے سوا کسی معبود کی پرستش نہیں کرتے۔ نیز دیکھیے سورۂ انعام (۸۲) اور لقمان (۱۳) {’’ وَ اَزْوَاجَهُمْ ‘‘} طبری میں علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما سے مروی ہے : {’’أَزْوَاجٌ‘‘} (جوڑوں) سے مراد ان جیسے دوسرے لوگ ہیں۔‘‘ بیویاں بھی مراد ہو سکتی ہیں، جو کفرو شرک میں ان کی ہم نوا تھیں۔یعنی قیامت قائم ہونے کے ساتھ فرشتوں کو حکم ہوگا کہ کفار ومشرکین کو مومنوں سے الگ کرو اور ان میں سے ہر ہر قسم کو الگ الگ اکٹھا کرو، مثلاً زانیوں کو زانیوں کے ساتھ، سود خوروں کو سود خوروں کے ساتھ، چوروں کو چوروں کے ساتھ، اسی طرح مشرک خاوندوں کو ان کی مشرک بیویوں کے ساتھ اکٹھا کرنے کا حکم ہو گا، جیسا کہ ایمان والے اپنی بیویوں کے ساتھ ہوں گے۔ اللہ تعالیٰ نے فرمایا : « جَنّٰتُ عَدْنٍ يَّدْخُلُوْنَهَا وَ مَنْ صَلَحَ مِنْ اٰبَآىِٕهِمْ وَ اَزْوَاجِهِمْ وَ ذُرِّيّٰتِهِمْ » [ الرعد : ۲۳ ] ’’ہمیشگی کے باغات، جن میں وہ داخل ہوں گے اور ان کے باپ دادوں اور ان کی بیویوں اور ان کی اولادوں میں سے جو نیک ہوئے۔‘‘ ان کے ساتھ ان کے بتوں اور دوسرے باطل معبودوں کو بھی اکٹھا کر کے جہنم کے راستے کی طرف لے جانے کا حکم ہو گا، جن کی وہ اللہ تعالیٰ کو چھوڑ کر عبادت کرتے رہے تھے۔ جن میں شیاطین اور وہ جنّ اور انسان بھی شامل ہوں گے جو اپنی عبادت کروانے پر خوش تھے۔ مقصد انھیں ذلیل کرنا ہوگا کہ اب اپنے خداؤں سے کہو کہ تمھاری مدد کریں۔ البتہ فرشتے، انبیاء اور صلحاء، جنھیں وہ پوجتے رہے تھے، وہ اس سے مستثنیٰ ہوں گے۔ دیکھیے سورۂ انبیاء (۹۸ تا ۱۰۳)۔ ¤ ➋ { فَاهْدُوْهُمْ اِلٰى صِرَاطِ الْجَحِيْمِ :} ہدایت کا لفظ یہاں ان کا مذاق اڑانے کے لیے استعمال کیا گیا ہے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23،22) ➊ {اُحْشُرُوا الَّذِيْنَ ظَلَمُوْا وَ اَزْوَاجَهُمْ … :} یہاں {’’ الَّذِيْنَ ظَلَمُوْا ‘‘} سے مراد کفار و مشرکین ہیں۔ اس کی دلیل یہ ہے کہ انھیں اور ان کے ’’من دون اللہ‘‘ معبودوں کو جہنم کی طرف لے جانے کا حکم ہو گا اور ظاہر ہے موحد مسلمان اللہ کے سوا کسی معبود کی پرستش نہیں کرتے۔ نیز دیکھیے سورۂ انعام (۸۲) اور لقمان (۱۳) {’’ وَ اَزْوَاجَهُمْ ‘‘} طبری میں علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما سے مروی ہے : {’’أَزْوَاجٌ‘‘} (جوڑوں) سے مراد ان جیسے دوسرے لوگ ہیں۔‘‘ بیویاں بھی مراد ہو سکتی ہیں، جو کفرو شرک میں ان کی ہم نوا تھیں۔یعنی قیامت قائم ہونے کے ساتھ فرشتوں کو حکم ہوگا کہ کفار ومشرکین کو مومنوں سے الگ کرو اور ان میں سے ہر ہر قسم کو الگ الگ اکٹھا کرو، مثلاً زانیوں کو زانیوں کے ساتھ، سود خوروں کو سود خوروں کے ساتھ، چوروں کو چوروں کے ساتھ، اسی طرح مشرک خاوندوں کو ان کی مشرک بیویوں کے ساتھ اکٹھا کرنے کا حکم ہو گا، جیسا کہ ایمان والے اپنی بیویوں کے ساتھ ہوں گے۔ اللہ تعالیٰ نے فرمایا : « جَنّٰتُ عَدْنٍ يَّدْخُلُوْنَهَا وَ مَنْ صَلَحَ مِنْ اٰبَآىِٕهِمْ وَ اَزْوَاجِهِمْ وَ ذُرِّيّٰتِهِمْ » [ الرعد : ۲۳ ] ’’ہمیشگی کے باغات، جن میں وہ داخل ہوں گے اور ان کے باپ دادوں اور ان کی بیویوں اور ان کی اولادوں میں سے جو نیک ہوئے۔‘‘ ان کے ساتھ ان کے بتوں اور دوسرے باطل معبودوں کو بھی اکٹھا کر کے جہنم کے راستے کی طرف لے جانے کا حکم ہو گا، جن کی وہ اللہ تعالیٰ کو چھوڑ کر عبادت کرتے رہے تھے۔ جن میں شیاطین اور وہ جنّ اور انسان بھی شامل ہوں گے جو اپنی عبادت کروانے پر خوش تھے۔ مقصد انھیں ذلیل کرنا ہوگا کہ اب اپنے خداؤں سے کہو کہ تمھاری مدد کریں۔ البتہ فرشتے، انبیاء اور صلحاء، جنھیں وہ پوجتے رہے تھے، وہ اس سے مستثنیٰ ہوں گے۔ دیکھیے سورۂ انبیاء (۹۸ تا ۱۰۳)۔ ¤ ➋ { فَاهْدُوْهُمْ اِلٰى صِرَاطِ الْجَحِيْمِ :} ہدایت کا لفظ یہاں ان کا مذاق اڑانے کے لیے استعمال کیا گیا ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) {وَ قِفُوْهُمْ اِنَّهُمْ مَّسْـُٔوْلُوْنَ :} جہنم کے صراط کی طرف لے جاتے ہوئے حکم ہوگا کہ انھیں ٹھہراؤ، کیونکہ ان سے ان کے اعمال کے متعلق سوال ہو گا، اس وقت دنیا میں ان کے کفرو شرک اور دوسرے برے اعمال میں شریک دوست اور ان کے جھوٹے معبود بھی ان کے ساتھ ہوں گے، جیسا کہ فرمایا : « وَ يَوْمَ يُحْشَرُ اَعْدَآءُ اللّٰهِ اِلَى النَّارِ فَهُمْ يُوْزَعُوْنَ» [ حٰمٓ السجدۃ : ۱۹ ] ’’اور جس دن اللہ کے دشمن آگ کی طرف اکٹھے کیے جائیں گے، پھر ان کی الگ الگ قسمیں بنائی جائیں گی۔‘‘ {’’ يُوْزَعُوْنَ ‘‘} کا ایک معنی یہ ہے کہ ان کی الگ الگ قسمیں بنائی جائیں گی اور ایک معنی یہ ہے کہ انھیں روکا جائے گا۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {مَا لَكُمْ لَا تَنَاصَرُوْنَ:’’ تَنَاصَرُوْنَ ‘‘} (تفاعل) اصل میں {’’تَتَنَاصَرُوْنَ‘‘} ہے، ایک تاء تخفیف کے لیے حذف کر دی ہے۔ باب تفاعل میں تشارک ہوتا ہے، {’’تَنَاصَرَ‘‘} ایک دوسرے کی مدد کرنا۔ اعمال کے محاسبے کے ساتھ ساتھ انھیں ذلیل کرنے کے لیے اور ان کے خداؤں کی بے بسی ظاہر کرنے کے لیے ایک سوال یہ ہوگا کہ تم تو کہا کرتے تھے : « نَحْنُ جَمِيْعٌ مُّنْتَصِرٌ» [ القمر : ۴۴ ] ’’ہم ایک جماعت ہیں جو بدلا لے کر رہنے والے ہیں۔‘‘ یا جیسا کہ تمھارا دعویٰ تھا کہ قیامت کے دن ہمارے معبود ہمیں بچا لیں گے، اب تمھیں کیا ہوا کہ تم ایک دوسرے کی مدد نہیں کر رہے؟"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) {بَلْ هُمُ الْيَوْمَ مُسْتَسْلِمُوْنَ: ’’أَسْلَمَ يُسْلِمُ‘‘} (افعال) تابع فرمان ہو جانا، {’’اِسْتَسْلَمَ‘‘} میں مبالغہ ہے، اس لیے ترجمہ ’’بالکل فرماں بردار‘‘ کیا گیا ہے۔ یعنی آج وہ کوئی جواب نہیں دے رہے، بلکہ ان کی تمام اکڑفوں جاتی رہی اور وہ پوری طرح عاجز اور فرماں بردار ہو کر کھڑے ہیں، جیسا کہ فرمایا : «وَ اَلْقَوْا اِلَى اللّٰهِ يَوْمَىِٕذٍ السَّلَمَ وَ ضَلَّ عَنْهُمْ مَّا كَانُوْا يَفْتَرُوْنَ» [ النحل : ۸۷ ] ’’اور اس دن وہ اللہ کے سامنے فرماں بردار ہونا پیش کریں گے اور ان سے گم ہو جائے گا جو وہ جھوٹ باندھا کرتے تھے۔‘‘"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) {وَ اَقْبَلَ بَعْضُهُمْ عَلٰى بَعْضٍ يَّتَسَآءَلُوْنَ :} یعنی گمراہ لوگ اور انھیں گممراہ کرنے والے، کمزور اور قوت والے ایک دوسرے سے مخاطب ہو کر یہ گفتگو کریں گے۔ اللہ تعالیٰ نے اہلِ جہنم کی باہمی گفتگو، ان کا ایک دوسرے کو ملامت کرنا اور گمراہ کرنے والوں کا اپنی پیروی کرنے والوں سے بری ہونے کے اعلان کا ذکر کئی مقامات پر فرمایا ہے۔ دیکھیے سورۂ بقرہ (۱۶۶، ۱۶۷)، ابراہیم (۲۱، ۲۲)، اعراف (۳۸، ۳۹)، سبا (۳۱ تا ۳۳) اور مومن (۴۷، ۴۸)۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { قَالُوْۤا :} یعنی کمزور اور پیروی کرنے والے اپنے سرداروں اور گمراہ کرنے والوں سے کہیں گے۔ ¤ ➋ { اِنَّكُمْ كُنْتُمْ تَاْتُوْنَنَا عَنِ الْيَمِيْنِ : ’’ الْيَمِيْنِ ‘‘} کا معنی قسم بھی ہے، دایاں  ہاتھ بھی اور دائیں جانب بھی۔ اگر اس کا معنی قسم لیا جائے تو مطلب یہ ہوگا کہ تم ہی قسم کی راہ سے ہمارے پاس آتے تھے، یعنی قسمیں کھا کھا کر اپنے آپ کو ہمارا خیرخواہ ظاہر کرتے تھے اور اگر اس کا معنی دایاں ہاتھ لیا جائے تو اس سے مراد قوت ہو گی، کیونکہ اہل عرب یمین بول کر قوت مراد لیتے ہیں۔ مطلب یہ ہوگا کہ تم زور اور قوت دکھلا کر ہمیں مرعوب کرتے تھے اور بہکانے کے لیے ہم پر چڑھ دوڑا کرتے تھے اور اگر دائیں جانب معنی ہو تو مراد خیر اور نیکی کی جانب ہو گی اور مطلب یہ ہوگا کہ تم آکر ہمیں خیرخواہی، نیکی اور دین حق کی راہ سے بہکاتے تھے اور کہتے تھے کہ جس چیز کا ہم تمھیں حکم دے رہے ہیں نیکی اور حق وہی ہے۔ آیت کے الفاظ میں بیک وقت تینوں معنوں کی گنجائش ہے اور یہ کلام اللہ کا اعجاز ہے، کیونکہ ان کے سردار گمراہ کرنے کے یہ تینوں طریقے استعمال کرتے تھے۔ کمزور لوگوں کا مقصد اپنی گمراہی کی پوری ذمہ داری سرداروں پر ڈالنا ہو گا، تاکہ عذاب سے کسی طرح بچ سکیں۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) {قَالُوْا بَلْ لَّمْ تَكُوْنُوْا مُؤْمِنِيْنَ :} ان کے سردار انھیں پانچ جواب دیں گے، پہلا یہ کہ دنیا میں ہم تمھارے کفر کا سبب نہیں تھے، بلکہ تم نے خود اپنی مرضی سے ایمان قبول کرنے سے انکار کیا اور اس پر کفر کو ترجیح دی۔ کفر کا منبع تمھاری ذات تھی، ایمان کسی وقت بھی تمھارے دلوں میں نہیں تھا کہ ہم نے تمھیں اس سے مرتد کیا ہو۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ {وَ مَا كَانَ لَنَا عَلَيْكُمْ مِّنْ سُلْطٰنٍ :} یہ دوسرا جواب ہے کہ ہمارا تم پر کوئی ایسا غلبہ نہ تھا جو تمھیں کفر پر قائم رہنے پر مجبور کرتا۔ تم اپنی رضا سے کفر پر مطمئن اور خوش تھے۔ ¤ ➋ {بَلْ كُنْتُمْ قَوْمًا طٰغِيْنَ :} یہ تیسرا جواب ہے کہ بلکہ خود تمھارے خمیر میں حد سے تجاوز اور سرکشی بھری ہوئی تھی، اس لیے تم حق کو چھوڑ کر ہمارے پیچھے لگ گئے اور انبیاء کی مخالفت کرتے رہے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) {فَحَقَّ عَلَيْنَا قَوْلُ رَبِّنَاۤ اِنَّا لَذَآىِٕقُوْنَ :} یہ پہلے تینوں جوابوں کے نتیجے میں چوتھا جواب ہے، یعنی ہم نے کفر پر قائم رکھنے کے لیے تم پر کوئی زبردستی نہیں کی، بلکہ اصل میں نہ تم ایمان والے تھے نہ ہم، جیسے ہم مجرم تھے ویسے ہی تم مجرم تھے، لہٰذا یہی انجام ہوا کہ دونوں عذاب کے مستحق ٹھہرے اور کفر وشرک کی جزا کے طور پر ہمارے رب نے جس عذاب کا وعدہ کیا تھا کہ : « لَاَمْلَـَٔنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَ النَّاسِ اَجْمَعِيْنَ » [ السجدۃ : ۱۳ ] (یقینا میں جہنم کو جنوں اور انسانوں، سب سے ضرور بھروں گا) وہ وعدہ ہم پر پورا ہو گیا۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) { فَاَغْوَيْنٰكُمْ اِنَّا كُنَّا غٰوِيْنَ :} یہ پانچواں جواب ہے کہ ہمارا تم پر کوئی زور نہ تھا، مگر ہم خود گمراہ تھے اور ظاہر ہے ایک گمراہ سے گمراہی کی طرف بلانے ہی کی توقع ہو سکتی ہے، کیونکہ جو گمراہ ہوتا ہے وہ لازماً یہ چاہتا ہے کہ دوسرے بھی اس جیسے ہو جائیں، تاکہ کوئی کسی کو ملامت کرنے والا نہ رہے۔ لہٰذا ہم نے تمھیں گمراہی کی دعوت ہی دینا تھی اور دی، یہ تمھارا کام تھا کہ عقل سے کام لیتے اور ہماری بات نہ مانتے۔ اب مرضی سے کفر اختیار کرنے کے بعد ہمیں اس کا ذمہ دار نہ ٹھہراؤ۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) { فَاِنَّهُمْ يَوْمَىِٕذٍ فِي الْعَذَابِ مُشْتَرِكُوْنَ :} یعنی پیروی کرنے والے بھی اور پیشوا بھی، گمراہ ہونے والے بھی اور گمراہ کرنے والے بھی، سب اپنی اپنی گمراہی کے مطابق عذاب میں شریک ہوں گے، جیسے گمراہی میں شریک تھے۔ کسی کا کوئی عذر قبول کر کے اسے معافی نہیں دی جائے گی۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) { اِنَّا كَذٰلِكَ نَفْعَلُ بِالْمُجْرِمِيْنَ:} مجرمین سے مراد کفار و مشرکین ہیں، کیونکہ آگے آ رہا ہے کہ وہ ’’لا الٰہ الا اللہ‘‘ کہنے سے تکبر کرتے تھے۔ یعنی ان کے ساتھ ہم یہی سلوک کرتے ہیں کہ جس طرح وہ جرم میں باہم شریک تھے، عذاب میں بھی باہم شریک ہیں۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) { اِنَّهُمْ كَانُوْۤا اِذَا قِيْلَ لَهُمْ …:} یہاں {’’ لَاۤ اِلٰهَ اِلَّا اللّٰهُ ‘‘} سے پہلے {’’قُوْلُوْا‘‘} (کہو) محذوف ہے۔ {’’إِنَّ‘‘} تعلیل یعنی عذاب کی وجہ بیان کرنے کے لیے ہے۔ یعنی ان کے عذاب کی وجہ یہ ہے کہ جب انھیں کہا جاتا ہے کہ ’’لا الٰہ الا اللہ‘‘ کہو اور توحید کا اقرار کرو تو اس سے تکبر کرتے تھے، یعنی اس سب سے بڑی حقیقت کو بھی ماننے سے انکار کر دیتے تھے اور اصل تکبر یہی ہے کہ حق بات کا انکار کر دیا جائے۔ عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : [ لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِيْ قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ، قَالَ رَجُلٌ إِنَّ الرَّجُلَ يُحِبُّ أَنْ يَكُوْنَ ثَوْبُهُ حَسَنًا وَنَعْلُهُ حَسَنَةً، قَالَ إِنَّ اللّٰهَ جَمِيْلٌ يُحِبُّ الْجَمَالَ، الْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ ]] [ مسلم، الإیمان، باب تحریم الکبر و بیانہ : ۹۱ ] ’’وہ شخص جنت میں داخل نہیں ہو گا جس کے دل میں ذرہ برابر تکبر ہو گا۔‘‘ ایک آدمی نے پوچھا : ’’آدمی پسند کرتا ہے کہ اس کا کپڑا اچھا ہو اور اس کا جوتا اچھا ہو۔ (کیا یہ بھی تکبر ہے)؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’بے شک اللہ جمیل ہے، جمال کو پسند کرتا ہے، تکبر تو حق سے اکڑ جانے اور لوگوں کو حقیر جاننے کا نام ہے۔‘‘"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) { وَ يَقُوْلُوْنَ اَىِٕنَّا لَتَارِكُوْۤا اٰلِهَتِنَا … :} یعنی وہ کلمہ توحید کی دعوت کے جواب میں کہتے تھے کہ کیا ہم اپنے معبودوں کو، جن کی عبادت ہم اور ہمارے آباء کرتے چلے آئے ہیں، ایک دیوانے شاعر کے کہنے پر چھوڑ دیں؟ اس سے ان کی مراد نبی کریم صلی اللہ علیہ وسلم تھے۔ ان ظالموں نے حق سے انکار ہی کو کافی نہیں سمجھا، بلکہ سارے جہان سے زیادہ علم و عقل والے شخص کو دیوانہ اور شاعر قرار دیا۔ حالانکہ وہ خوب جانتے تھے کہ آپ کا شعر اور شعراء سے کوئی تعلق تھا اور نہ ہی آپ دیوانے تھے۔ اس لیے اللہ تعالیٰ نے اگلی آیت میں ان کا جواب دیا۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { بَلْ جَآءَ بِالْحَقِّ :} یعنی آپ صلی اللہ علیہ وسلم کا آنا حق ہے اور آپ جو کتاب اور شریعت لے کر آئے ہیں وہ بھی حق ہے۔ ¤ ➋ {وَ صَدَّقَ الْمُرْسَلِيْنَ :} اور آپ نے تمام رسولوں کی تصدیق کی ہے۔ تصدیق کا معنی سچا قرار دینا ہے، یہاں اس سے کئی معانی مراد ہیں، ایک یہ کہ آپ صلی اللہ علیہ وسلم کے آنے کے ساتھ پہلے رسولوں کا سچا ہونا ثابت ہو گیا، کیونکہ انھوں نے آپ کی آمد کی پیش گوئی کی تھی، اگر آپ تشریف نہ لاتے تو ان کا سچا ہونا ثابت نہ ہوتا۔ دوسرا یہ کہ آپ صلی اللہ علیہ وسلم نے پہلے رسولوں کی تصدیق کی، ان پر ایمان لائے اور انھیں اور ان کی لائی ہوئی شریعت کو سچا قرار دیا۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) {اِنَّكُمْ لَذَآىِٕقُوا الْعَذَابِ الْاَلِيْمِ:} اس سے پہلے انھوں نے آپس میں جو کہا تھا {’’ اِنَّا لَذَآىِٕقُوانَ ‘‘} (ہم عذاب چکھنے والے ہیں) صحیح بھی ہو سکتا تھا، غلط بھی۔ اس لیے اللہ تعالیٰ نے یقینی بات کا اعلان فرمایا کہ تم یقینا دردناک عذاب چکھنے والے ہو۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) {وَ مَا تُجْزَوْنَ اِلَّا مَا كُنْتُمْ تَعْمَلُوْنَ:} یعنی ہم نے تم پر کوئی ظلم نہیں  کیا، بلکہ تمھیں اسی کفرو شرک اور رسولوں کو جھٹلانے کی جزا مل رہی ہے جس کا ارتکاب تم کرتے رہے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) { اِلَّا عِبَادَ اللّٰهِ الْمُخْلَصِيْنَ :} مگر اللہ کے وہ بندے جنھیں اس نے اپنے لیے خالص کر لیا، جن کے متعلق ابلیس نے بھی اقرار کیا کہ وہ انھیں گمراہ نہیں کر سکے گا (دیکھیے سورۂ ص : ۸۳) وہ عذابِ الیم نہیں چکھیں گے، نہ ان کے حساب میں شدت ہو گی، بلکہ اللہ تعالیٰ ان کی نیکیوں کو دس گنا سے سات سو گنا، بلکہ بے حساب گنا تک بڑھائے گا اور برائیوں سے، اگر کوئی ہوئیں، درگزر فرمائے گا۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) { اُولٰٓىِٕكَ لَهُمْ رِزْقٌ مَّعْلُوْمٌ :} یعنی ایسی روزی جو ان کے لیے مقرر ہو چکی ہے، جس کے ملنے کا انھیں یقین ہے کہ ہمیشہ ملتی رہے گی، کبھی روکی نہیں جائے گی۔ اگلی آیت میں اس کی کچھ تفصیل بیان فرمائی۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ {’’ فَوَاكِهُ ‘‘ ’’فَاكِهَةٌ ‘‘} کی جمع ہے، پھل جس سے لذت حاصل ہو۔ یعنی ان کے کھانے کی تمام چیزیں، حتیٰ کہ گوشت وغیرہ بھی، لذت کے لیے ہوں گی، نہ کہ پیٹ بھرنے کے لیے، کیونکہ جنت میں بھوک پیاس کے ستانے کا سوال ہی پیدا نہیں ہوتا۔ دیکھیے سورۂ طٰہٰ (۱۱۸، ۱۱۹)۔ ¤ ➋ {وَ هُمْ مُّكْرَمُوْنَ: ’’ فَوَاكِهُ ‘‘‘} جسمانی لذتیں ہیں جو روحانی لذتوں کے بغیر مکمل نہیں ہو سکتیں، اس لیے فرمایا کہ وہ اس میں عزت بخشے گئے ہیں۔ {’’ مُكْرَمُوْنَ ‘‘} اسم مفعول اس لیے استعمال فرمایا کہ انھیں اللہ تعالیٰ کی طرف سے، فرشتوں کی طرف سے اور جنت کے دوسرے تمام ساتھیوں اور خدمت گاروں غرض ہر طرف سے عزت ملے گی۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) { فِيْ جَنّٰتِ النَّعِيْمِ :} کھانے پینے اور اکرام کے ساتھ رہنے کی عمدہ جگہ بھی ضروری ہے، اس لیے فرمایا، وہ نعمت کے باغوں میں ہوں گے، جہاں نعمت کے سوا کسی چیز کا تصور ہی نہیں۔ وہاں نہ فقر ہے نہ بیماری، نہ بغض ہے نہ عداوت، نہ غم ہے نہ خوف اور نہ ہی وہاں موت ہے۔ غرض نعمت ہی نعمت ہے، نہ کوئی زحمت ہے نہ کسی نعمت کا زوال۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) {عَلٰى سُرُرٍ مُّتَقٰبِلِيْنَ :} لذت کی تکمیل کے لیے احباب اور مجلس کے لوازم کا ہونا ضروری ہے۔ فرمایا، وہ اور ان کے احباب سب بادشاہ ہوں گے، جو تختوں پر بیٹھے ہوں گے اور وہ جتنے بھی زیادہ ہوں گے ہر ایک کا چہرہ دوسرے کے چہرے کے سامنے ہو گا، کسی کی پیٹھ دوسرے کی طرف نہیں ہو گی۔ اس سے ان کے دلوں کی صفائی اور باہمی محبت کا بھی اظہار ہوتا ہے، کیونکہ دلوں میں محبت نہ ہو تو چہرے ایک دوسرے کی طرف نہیں رہتے۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ {يُطَافُ عَلَيْهِمْ بِكَاْسٍ : ’’كَأْسٌ‘‘} شیشے کا پیالہ جو شراب سے بھرا ہوا ہو، خالی پیالے کو {’’كَأْسٌ‘‘} نہیں کہتے۔ مجلس احباب میں سرور کے لیے شراب معروف تھی، سو فرمایا، جنت میں شراب کے جام پھرانے والے۔ غلمان ہوں گے، انھی جنتیوں کے لڑکے جو (چھوٹی عمر میں فوت ہو گئے اور )ہمیشہ اسی طرح رہیں گے، جیسا کہ فرمایا : «وَ يَطُوْفُ عَلَيْهِمْ غِلْمَانٌ لَّهُمْ كَاَنَّهُمْ لُؤْلُؤٌ مَّكْنُوْنٌ » [ الطور : ۲۴ ] ’’اور ان پر چکر لگاتے رہیں گے انھی کے لڑکے، جیسے وہ چھپائے ہوئے موتی ہوں۔‘‘ اور فرمایا : « يَطُوْفُ عَلَيْهِمْ وِلْدَانٌ مُّخَلَّدُوْنَ (17) بِاَكْوَابٍ وَّ اَبَارِيْقَ وَ كَاْسٍ مِّنْ مَّعِيْنٍ» [ الواقعۃ : ۱۷، ۱۸ ] ’’ان پر چکر لگا رہے ہوں گے وہ لڑکے جو ہمیشہ (لڑکے ہی) رکھے جائیں گے۔ ایسے کوزے اور ٹونٹی والی صراحیاںاور لبالب بھرے ہوئے پیالے لے کر جو بہتی ہوئی شراب کے ہوں گے۔‘‘ ¤ ➋ { مِنْ مَّعِيْنٍ : ’’ مَعِيْنٍ ‘‘ ’’مَعَنَ يَمْعَنُ مُعُوْنًا‘‘} (ف، ک){ ’’ اَلْمَاءُ‘‘ ’’جَرٰي‘‘} پانی کا بہنا۔ {’’ مَعِيْنٍ ‘‘ } ({فَعِيْلٌ} ) بہنے والا، جیسے {’’شَرُفَ‘‘} سے {’’شَرِيْفٌ‘‘} ہے۔ یعنی وہ شراب اس قسم کی نہیں ہو گی جو دنیا میں پھلوں اور غلوں کو سڑا کر کشید کی جاتی ہے، بلکہ قدرتی چشموں سے نکلے گی اور نہروں کی صورت میں بہتی ہو گی، جن میں سے جام بھر بھر کر انھیں پلائے جائیں گے۔ جنت کی چار قسم کی نہروں میں سے ایک قسم کے بارے میں اللہ تعالیٰ نے فرمایا : «وَ اَنْهٰرٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشّٰرِبِيْنَ » [ محمد : ۱۵ ] ’’اور کئی نہریں شراب کی ہیں، جو پینے والوں کے لیے لذیذ ہے۔‘‘"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) { بَيْضَآءَ لَذَّةٍ لِّلشّٰرِبِيْنَ : ’’ بَيْضَآءَ ‘‘ ’’أَبْيَضُ‘‘} کی مؤنث ہے، سفید۔ کھانے پینے کی چیزوں میں سب سے پہلی مرغوب یا نامرغوب چیز ان کا رنگ ہے، اس کے بعد ان کی لذت ہے۔ دنیا کی شرابیں عموماً بد رنگ ہوتی ہیں اور اتنی بد ذائقہ اور بدبودار ہوتی ہیں کہ پینے والے کا منہ بگڑ بگڑ جاتا ہے، جبکہ جنت کی شراب کا رنگ نہایت سفید ہو گا اور پینے والوں کے لیے بہت لذیذ ہو گی، جس میں سے کستوری کی خوشبو آئے گی، جیسا کہ فرمایا : « خِتٰمُهٗ مِسْكٌ » [ المطففین : ۲۶ ] ’’اس کی مہر کستوری ہو گی۔‘‘ {’’ لِلشّٰرِبِيْنَ ‘‘} (جمع) لانے میں اشارہ ہے کہ شراب کا دور مجلس احباب میں چلے گا۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) {لَا فِيْهَا غَوْلٌ وَّ لَا هُمْ عَنْهَا يُنْزَفُوْنَ : ’’ غَوْلٌ ‘‘} کا معنی خرابی، سر درد ، پیٹ کا درد اور ہلاکت ہے۔ {’’ يُنْزَفُوْنَ ‘‘ ’’نَزَفَ‘‘} (مجرد) اور {’’أَنْزَفَ‘‘} (مزیدفیہ) معروف و مجہول کا معنی عقل زائل ہونا ہے۔ دنیا کی شراب میں پائی جانے والی خرابیوں میں سے اس کے بدرنگ، بد ذائقہ اور بدبو دار ہونے کی نفی تو {’’ بَيْضَآءَ لَذَّةٍ لِّلشّٰرِبِيْنَ ‘‘} سے ہو گئی تھی، اب اس میں پائی جانے والی مزید خرابیوں کی بھی نفی فرما دی۔ دنیا کی شراب پینے کے بعد الٹیاں آتی ہیں، خمار کی صورت میں سر، پیٹ اور سارے جسم میں درد ہوتا ہے جو بعض اوقات ہلاکت تک پہنچا دیتا ہے اور عقل جو انسان کا شرف ہے، جاتی رہتی ہے۔ جنت کی شراب ایسی ہر خرابی سے پاک ہو گی، نہ اس میں سر درد یا کوئی اور خرابی ہو گی اور نہ ہی اس کی وجہ سے ان کی عقل ماری جائے گی۔ البتہ شراب کی وہ خوبیاں جن کی وجہ سے لوگ اتنی خرابیوں کے باوجود اسے پیتے ہیں، وہ سب بدرجہ اَتم موجود ہوں گی، مثلاً کھانے کی رغبت پیدا کرنا، سرور لانا اور قوت و شہوت کو ابھارنا وغیرہ۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) {وَ عِنْدَهُمْ قٰصِرٰتُ الطَّرْفِ عِيْنٌ : ’’ عِيْنٌ ‘‘ ’’عَيْنَاءُ‘‘} کی جمع ہے، خوب صورت موٹی آنکھوں والی۔ کھانے پینے اور شراب کے ساتھ لذت کی تکمیل بیویوں کی صحبت سے ہوتی ہے، اس کے لیے ان کی بیویوں کا ذکر فرمایا، جو ہر قسم کے ظاہری و باطنی اور صوری و معنوی کمال سے آراستہ ہوں گی۔ معنوی کمال یہ کہ ایسی عفیف ہوں گی کہ ان کی نگاہیں اپنے خاوندوں کے سوا کسی کی طرف نہیں اٹھیں گی اور ظاہری حسن کا یہ حال ہو گا کہ وہ گورے رنگ والی اور نہایت خوب صورت موٹی آنکھوں والی ہوں گی، جن کی آنکھوں کی سیاہی بہت سیاہ اور سفیدی بہت سفید ہو گی۔ سورۂ واقعہ میں ہے : « وَ حُوْرٌ عِيْنٌ» [ الواقعۃ : ۲۲ ] ’’اور (ان کے لیے وہاں) سفید جسم، سیاہ آنکھوں والی عورتیں ہیں، جو فراخ آنکھوں والی ہیں۔‘‘"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) { كَاَنَّهُنَّ بَيْضٌ مَّكْنُوْنٌ: ’’ بَيْضٌ ‘‘ ’’بَيْضَةٌ‘‘} کی جمع ہے، انڈے۔ انڈے کا رنگ عموماً سفید سرخی مائل ہوتا ہے، جس میں کچھ زردی کی آمیزش ہوتی ہے۔ یہ رنگ چھپا کر رکھنے سے قائم رہتا ہے، ورنہ اڑجاتا ہے۔ خصوصاً شتر مرغ کے انڈے اس رنگ کے ہوتے ہیں اور شتر مرغ انھیں اپنے ملائم اور نرم پروں کے ریشوں کے فرش پر رکھ کر انھی کے ساتھ ڈھانپ دیتا ہے۔ عرب لوگ عورتوں کے ایسے رنگ کو بہت پسند کرتے ہیں اور انھیں چھپائے ہوئے انڈوں کے ساتھ تشبیہ دیتے ہیں۔ اشرف الحواشی میں ہے : ’’بعض مفسرین نے {’’ بَيْضٌ مَّكْنُوْنٌ ‘‘} کی تفسیر ’’انڈے کے چھلکے کے نیچے چھپی ہوئی جھلی‘‘ سے کی ہے اور اس کی یہی تفسیر ام سلمہ رضی اللہ عنھا نے نبی صلی اللہ علیہ وسلم سے نقل کی ہے، اس لیے اس کی یہی تفسیر صحیح ہے۔ وہ فرماتی ہیں کہ میں نے نبی صلی اللہ علیہ وسلم سے {’’ بَيْضٌ مَّكْنُوْنٌ ‘‘} کا مطلب دریافت کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ان کی (یعنی جنت کی حوروں کی) نرمی اور نزاکت اس جھلی جیسی ہو گی جو انڈے کے چھلکے سے چپکی ہوتی ہے اور اسے {’’غِرْقِيٌّ‘‘} کہا جاتا ہے۔‘‘ (ابن کثیر، ابن جریر ) قاموس میں ہے : {’’غَرْقَأَتِ الدَّجَاجَةُ بَيْضَتَهَا‘‘} ’’مرغی نے سخت چھلکے کے بغیر انڈا دیا۔‘‘ مگر تفسیر ابن کثیر کے محقق حکمت بن بشیر نے اس روایت کے متعلق لکھا ہے : ’’اسے طبری اور طبرانی نے ایک ہی سند اور متن کے ساتھ روایت کیا ہے اور اس کی سند سلیمان بن ابی کریمہ کی وجہ سے ضعیف ہے۔ اسے عقیلی اور ابن عدی نے ضعیف کہا ہے۔‘‘ علاوہ ازیں قرآن میں ان عورتوں کو {’’ اللُّؤْلُؤِ الْمَكْنُوْنِ ‘‘} بھی کہا گیا ہے، اس لیے {’’ بَيْضٌ مَّكْنُوْنٌ ‘‘} اور {’’ اللُّؤْلُؤِ الْمَكْنُوْنِ ‘‘} کی مناسبت مدنظر رہنی چاہیے۔ (واللہ اعلم)"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) { فَاَقْبَلَ بَعْضُهُمْ عَلٰى بَعْضٍ يَّتَسَآءَلُوْنَ :} جنتی جنت میں ایسی آراستہ مجلسوں میں بیٹھے ہوئے ایک دوسرے سے دنیا میں گزرے ہوئے حالات و واقعات پوچھیں گے اور سنائیں گے۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51تا53){ قَالَ قَآىِٕلٌ مِّنْهُمْ اِنِّيْ كَانَ لِيْ قَرِيْنٌ … : ’’ قَرِيْنٌ ‘‘} ایسے ساتھی یا دوست کو کہتے ہیں جو ہم عمر ہو یا بہادری، قوت اور اس طرح کے دوسرے اوصاف میں ہم سر ہو، اور اس لفظ کا استعمال عموماً برے معنوں میں ہوتا ہے۔ (کیلانی) ان میں سے ایک جنتی کہے گا، دنیا میں میرا ایک ساتھی تھا، جو مرنے کے بعد اٹھنے کا منکر تھا، وہ مذاق کرتے ہوئے انکار کے طور پر کہا کرتا تھا کہ کیا واقعی تم بھی ان لوگوں میں شامل ہو جو مرنے کے بعد دوبارہ زندہ ہونے جیسی بعید از عقل بات کو مانتے ہیں، کیا جب ہم مرکر مٹی اور ہڈیاں ہو گئے تو کیا واقعی ہمیں ہمارے اعمال کی جزا دی جائے گی؟ {’’مَدِيْنُوْنَ‘‘ ’’مَدِيْنٌ‘‘} کی جمع ہے، جو اصل میں {’’دَانَ يَدِيْنُ دِيْنًا‘‘} (ض) سے اسم مفعول {’’مَدْيُوْنٌ‘‘} ہے۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 51تا53){ قَالَ قَآىِٕلٌ مِّنْهُمْ اِنِّيْ كَانَ لِيْ قَرِيْنٌ … : ’’ قَرِيْنٌ ‘‘} ایسے ساتھی یا دوست کو کہتے ہیں جو ہم عمر ہو یا بہادری، قوت اور اس طرح کے دوسرے اوصاف میں ہم سر ہو، اور اس لفظ کا استعمال عموماً برے معنوں میں ہوتا ہے۔ (کیلانی) ان میں سے ایک جنتی کہے گا، دنیا میں میرا ایک ساتھی تھا، جو مرنے کے بعد اٹھنے کا منکر تھا، وہ مذاق کرتے ہوئے انکار کے طور پر کہا کرتا تھا کہ کیا واقعی تم بھی ان لوگوں میں شامل ہو جو مرنے کے بعد دوبارہ زندہ ہونے جیسی بعید از عقل بات کو مانتے ہیں، کیا جب ہم مرکر مٹی اور ہڈیاں ہو گئے تو کیا واقعی ہمیں ہمارے اعمال کی جزا دی جائے گی؟ {’’مَدِيْنُوْنَ‘‘ ’’مَدِيْنٌ‘‘} کی جمع ہے، جو اصل میں {’’دَانَ يَدِيْنُ دِيْنًا‘‘} (ض) سے اسم مفعول {’’مَدْيُوْنٌ‘‘} ہے۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 51تا53){ قَالَ قَآىِٕلٌ مِّنْهُمْ اِنِّيْ كَانَ لِيْ قَرِيْنٌ … : ’’ قَرِيْنٌ ‘‘} ایسے ساتھی یا دوست کو کہتے ہیں جو ہم عمر ہو یا بہادری، قوت اور اس طرح کے دوسرے اوصاف میں ہم سر ہو، اور اس لفظ کا استعمال عموماً برے معنوں میں ہوتا ہے۔ (کیلانی) ان میں سے ایک جنتی کہے گا، دنیا میں میرا ایک ساتھی تھا، جو مرنے کے بعد اٹھنے کا منکر تھا، وہ مذاق کرتے ہوئے انکار کے طور پر کہا کرتا تھا کہ کیا واقعی تم بھی ان لوگوں میں شامل ہو جو مرنے کے بعد دوبارہ زندہ ہونے جیسی بعید از عقل بات کو مانتے ہیں، کیا جب ہم مرکر مٹی اور ہڈیاں ہو گئے تو کیا واقعی ہمیں ہمارے اعمال کی جزا دی جائے گی؟ {’’مَدِيْنُوْنَ‘‘ ’’مَدِيْنٌ‘‘} کی جمع ہے، جو اصل میں {’’دَانَ يَدِيْنُ دِيْنًا‘‘} (ض) سے اسم مفعول {’’مَدْيُوْنٌ‘‘} ہے۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) {قَالَ هَلْ اَنْتُمْ مُّطَّلِعُوْنَ:} وہ مومن اپنے جنتی ساتھیوں اور ہم نشینوں سے کہے گا، کیا تم جہنم میں جھانکو گے، شاید وہ کہیں نظر آجائے تو دیکھیں کس حال میں ہے؟ کیونکہ اسے گمراہ کرنے کی کوشش کرنے والے کو جہنم میں دیکھ کر اور دوستوں کو دکھا کر خوشی ہو گی، جیسا کہ اللہ تعالیٰ نے فرمایا : « فَالْيَوْمَ الَّذِيْنَ اٰمَنُوْا مِنَ الْكُفَّارِ يَضْحَكُوْنَ (34) عَلَى الْاَرَآىِٕكِ يَنْظُرُوْنَ (35) هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوْا يَفْعَلُوْنَ » [ المطففین : ۳۴ تا ۳۶ ] ’’ سو آج وہ لوگ جو ایمان لائے، کافروں پر ہنس رہے ہیں۔ تختوں پر (بیٹھے) نظارہ کر رہے ہیں۔ کیا کافروں کو اس کا بدلا دیا گیا جو وہ کیا کرتے تھے؟‘‘"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) ➊ { فَاطَّلَعَ فَرَاٰهُ فِيْ سَوَآءِ الْجَحِيْمِ:’’ سَوَآءِ ‘‘} کا اصل معنی برابر ہے، یہاں مراد درمیان ہے، کیونکہ درمیان کی جگہ چاروں طرف سے برابر ہوتی ہے۔ چنانچہ وہ مومن اپنے دوستوں کے ساتھ جھانکے گا تو قیامت کے اس منکر کو بھڑکتی ہوئی آگ کے وسط میں دیکھے گا۔ ¤ ➋ اس سے معلوم ہوا کہ آخرت میں جنتیوں کو دیکھنے اور سننے کی جو قوتیں عطا کی جائیں گی وہ دنیا کے مقابلے میں بہت زیادہ ہوں گی۔ اس وقت ہم دنیا میں ہزاروں میل دور بیٹھے ہوئے آدمیوں کی آوازیں سنتے اور انھیں دیکھتے ہیں، مگر صرف ٹیلی ویژن کی وساطت سے۔ آخرت میں ہر شخص دوسرے سے کسی آلے کے بغیر بات کر سکے گا اور اسے دیکھ سکے گا، خواہ وہ کتنا دور ہو۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ {قَالَ تَاللّٰهِ اِنْ كِدْتَّ لَتُرْدِيْنِ:’’ اِنْ كِدْتَّ ‘‘} اصل میں {’’إِنَّكَ كِدْتَّ‘‘} تھا، دلیل اس کی{’’ لَتُرْدِيْنِ ‘‘} کا لام ہے۔ {’’ كِدْتَّ ‘‘ ’’كَادَ يَكَادُ‘‘} سے ماضی معلوم ہے۔ {’’ لَتُرْدِيْنِ ‘‘} اصل میں {’’ لَتُرْدِيْنِيْ‘‘} تھا۔ {’’أَرْدٰي يُرْدِيْ إِرْدَاءً‘‘} (افعال) ہلاک کرنا۔ اسے مخاطب کر کے کہے گا، اللہ کی قسم ! یقینا تو قریب تھا کہ مجھے راہ راست سے بہکا کر ہلاک کر دیتا۔ ¤ ➋ ان آیات میں برے ساتھیوں سے اجتناب کا سبق ہے کہ اگر اللہ تعالیٰ کا خاص فضل نہ ہو تو اس کا نتیجہ کتنا مہلک ہے۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) ➊ { وَ لَوْ لَا نِعْمَةُ رَبِّيْ لَكُنْتُ مِنَ الْمُحْضَرِيْنَ :} اس کے ساتھ وہ اللہ تعالیٰ کا احسان یاد کر کے اس کا تذکرہ کرے گا کہ اگر میرے رب کا مجھ پر احسان نہ ہوتا تو میں بھی ان لوگوں میں شامل ہوتا جنھیں گرفتار کر کے جہنم میں حاضر کیا گیا ہے۔ یہ اس کا احسان ہے کہ اس نے مجھے ایمان پر قائم رکھا، ورنہ میرے قدم بھی ڈگمگا جاتے۔ ¤ ➋ ان دونوں دوستوں کا قصہ سورۂ کہف میں مذکور دو باغوں کے مالک (جو آخرت کا منکر تھا) اور اس کے مومن دوست کے قصے سے مناسبت رکھتا ہے۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 59،58) {اَفَمَا نَحْنُ بِمَيِّتِيْنَ … :} ان آیات کی دو تفسیریں ہیں، ایک یہ ہے کہ وہ مومن یہ بات اپنے اس کافر دوست کو کہے گا جو قیامت کا منکر تھا اور وہ دنیا میں کہا کرتا تھا : «اِنْ هِيَ اِلَّا مَوْتَتُنَا الْاُوْلٰى وَ مَا نَحْنُ بِمُنْشَرِيْنَ » [ الدخان : ۳۵ ] ’’کہ ہماری اس پہلی موت کے سوا کوئی (موت) نہیں اور نہ ہم کبھی دوبارہ اٹھائے جانے والے ہیں۔‘‘ مومن اسے مخاطب کر کے کہے گا، اب دیکھ لو! کیا تمھاری وہ بات درست نکلی یا غلط کہ : « اَفَمَا نَحْنُ بِمَيِّتِيْنَ (58) اِلَّا مَوْتَتَنَا الْاُوْلٰى وَ مَا نَحْنُ بِمُعَذَّبِيْنَ» ’’تو کیا ہم کبھی مرنے والے نہیں ہیں، مگر ہماری پہلی موت اور نہ ہم کبھی عذاب دیے جانے والے ہیں۔‘‘ یعنی اب آگ کے وسط میں گرنے پر تمھیں ثابت ہو گیا کہ تمھاری بات غلط تھی ؟ ¤ دوسری تفسیر یہ ہے کہ اس مومن کا یہ خطاب اپنے دنیا کے کافر ساتھی کے ساتھ اس سے پہلی آیت {’’ لَكُنْتُ مِنَ الْمُحْضَرِيْنَ ‘‘} پر ختم ہو گیا، اس کے بعد وہ مومن جنت میں عطا کردہ نعمتوں کو دیکھ کر اور یہ جان کر کہ اب ہمیشہ جنت میں رہنا ہے، اب نہ موت آئے گی اور نہ یہاں سے نکالے جائیں گے، خوشی اور تعجب کے ساتھ اپنے جنتی ساتھیوں سے کہے گا کہ کیا واقعی ایسا ہے کہ پہلی موت کے بعد جو آ چکی، اب ہم کبھی مرنے والے نہیں، نہ ہی ہمیں کبھی عذاب ہو گا، بلکہ ہم ہمیشہ زندہ رہیں گے اور جنت ہی میں رہیں گے؟ اگرچہ اکثر مفسرین نے دوسری تفسیر کی ہے، مگر پہلی تفسیر زیادہ ظاہر ہے۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59،58) {اَفَمَا نَحْنُ بِمَيِّتِيْنَ … :} ان آیات کی دو تفسیریں ہیں، ایک یہ ہے کہ وہ مومن یہ بات اپنے اس کافر دوست کو کہے گا جو قیامت کا منکر تھا اور وہ دنیا میں کہا کرتا تھا : «اِنْ هِيَ اِلَّا مَوْتَتُنَا الْاُوْلٰى وَ مَا نَحْنُ بِمُنْشَرِيْنَ » [ الدخان : ۳۵ ] ’’کہ ہماری اس پہلی موت کے سوا کوئی (موت) نہیں اور نہ ہم کبھی دوبارہ اٹھائے جانے والے ہیں۔‘‘ مومن اسے مخاطب کر کے کہے گا، اب دیکھ لو! کیا تمھاری وہ بات درست نکلی یا غلط کہ : « اَفَمَا نَحْنُ بِمَيِّتِيْنَ (58) اِلَّا مَوْتَتَنَا الْاُوْلٰى وَ مَا نَحْنُ بِمُعَذَّبِيْنَ» ’’تو کیا ہم کبھی مرنے والے نہیں ہیں، مگر ہماری پہلی موت اور نہ ہم کبھی عذاب دیے جانے والے ہیں۔‘‘ یعنی اب آگ کے وسط میں گرنے پر تمھیں ثابت ہو گیا کہ تمھاری بات غلط تھی ؟ ¤ دوسری تفسیر یہ ہے کہ اس مومن کا یہ خطاب اپنے دنیا کے کافر ساتھی کے ساتھ اس سے پہلی آیت {’’ لَكُنْتُ مِنَ الْمُحْضَرِيْنَ ‘‘} پر ختم ہو گیا، اس کے بعد وہ مومن جنت میں عطا کردہ نعمتوں کو دیکھ کر اور یہ جان کر کہ اب ہمیشہ جنت میں رہنا ہے، اب نہ موت آئے گی اور نہ یہاں سے نکالے جائیں گے، خوشی اور تعجب کے ساتھ اپنے جنتی ساتھیوں سے کہے گا کہ کیا واقعی ایسا ہے کہ پہلی موت کے بعد جو آ چکی، اب ہم کبھی مرنے والے نہیں، نہ ہی ہمیں کبھی عذاب ہو گا، بلکہ ہم ہمیشہ زندہ رہیں گے اور جنت ہی میں رہیں گے؟ اگرچہ اکثر مفسرین نے دوسری تفسیر کی ہے، مگر پہلی تفسیر زیادہ ظاہر ہے۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 61،60) {اِنَّ هٰذَا لَهُوَ الْفَوْزُ الْعَظِيْمُ … :} یہ دونوں آیات اس مومن کا بقیہ کلام بھی ہو سکتا ہے اور اللہ تعالیٰ کا کلام بھی کہ {’’ عِبَادَ اللّٰهِ الْمُخْلَصِيْنَ ‘‘} (اللہ کے خالص کیے ہوئے بندوں) کو حاصل ہونے والا یہ {’’ رِزْقٌ مَّعْلُوْمٌ ‘‘} (مقرر رزق) ہی سب سے بڑی کامیابی ہے۔ ایسے ہی خوش کن انجام کو حاصل کرنے کے لیے عمل کرنے والوں کو عمل کرنا چاہیے۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61،60) {اِنَّ هٰذَا لَهُوَ الْفَوْزُ الْعَظِيْمُ … :} یہ دونوں آیات اس مومن کا بقیہ کلام بھی ہو سکتا ہے اور اللہ تعالیٰ کا کلام بھی کہ {’’ عِبَادَ اللّٰهِ الْمُخْلَصِيْنَ ‘‘} (اللہ کے خالص کیے ہوئے بندوں) کو حاصل ہونے والا یہ {’’ رِزْقٌ مَّعْلُوْمٌ ‘‘} (مقرر رزق) ہی سب سے بڑی کامیابی ہے۔ ایسے ہی خوش کن انجام کو حاصل کرنے کے لیے عمل کرنے والوں کو عمل کرنا چاہیے۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) { اَذٰلِكَ خَيْرٌ نُّزُلًا اَمْ شَجَرَةُ الزَّقُّوْمِ : ’’ نُزُلًا ‘‘} کھانے پینے کی چیزیں اور آرام کی جگہ جو مہمان کے آنے کے وقت کے لیے تیار کی جائیں۔ {’’ الزَّقُّوْمِ ‘‘} اسی سے {’’تَزَقُّمٌ‘‘} ہے، جس کا معنی کسی ناگوار چیز کو نہایت مشکل سے نگلنا ہے۔ اس درخت کا دنیا میں وجود نہیں، کیونکہ اللہ تعالیٰ اسے آگ میں پیدا فرمائے گا۔ صرف لفظی مشابہت کی حد تک ایک زہریلا پودا ہے جو ’’زقوم‘‘ کہلاتا ہے، جس کا دودھ جسم کو لگ جائے تو جسم سوج جاتا ہے اور آدمی مر جاتا ہے۔ صحرا کے قریب کی خشک زمینوں میں پایا جاتا ہے۔ (الوسیط) اہل جنت کے لیے {’’ رِزْقٌ مَّعْلُوْمٌ (41) فَوَاكِهُ وَ هُمْ مُّكْرَمُوْنَ (42) فِيْ جَنّٰتِ النَّعِيْمِ ‘‘} کی مہمانی کے ذکر کے بعد اہل جہنم کی مہمانی کا ذکر فرمایا۔ اگرچہ بہتری میں دونوں کا کوئی مقابلہ نہیں، مگر کفار اپنے اعمال کو مسلمانوں کے اعمال سے بہتر سمجھتے تھے، اس لیے ان کا نتیجہ ذکر کر کے فرمایا کہ بتاؤ، دونوں میں سے بہتر کیا ہے؟ علاوہ ازیں اس میں کفار پر طنز بھی ہے۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) {اِنَّا جَعَلْنٰهَا فِتْنَةً لِّلظّٰلِمِيْنَ:} یہاں {’’اَلظَّالِمِيْنَ‘‘} سے مراد کفارو مشرکین ہیں اور ’’زقوم‘‘ انھی کے لیے آزمائش ہے۔ اس کی دلیل یہ ہے کہ جب رسول اللہ صلی اللہ علیہ وسلم نے اللہ تعالیٰ کا یہ فرمان سنایا : « اِنَّ شَجَرَتَ الزَّقُّوْمِ (43) طَعَامُ الْاَثِيْمِ (44) كَالْمُهْلِ يَغْلِيْ فِي الْبُطُوْنِ (45) كَغَلْيِ الْحَمِيْمِ» [ الدخان : ۴۳ تا ۴۶ ] ’’بے شک زقوم کا درخت گناہ گار کا کھانا ہے۔ پگھلے ہوئے تانبے کی طرح، پیٹوں میں کھولتا ہے۔ گرم پانی کے کھولنے کی طرح۔‘‘ اور یہ فرمان : «ثُمَّ اِنَّكُمْ اَيُّهَا الضَّآلُّوْنَ الْمُكَذِّبُوْنَ (51) لَاٰكِلُوْنَ مِنْ شَجَرٍ مِّنْ زَقُّوْمٍ» [ الواقعۃ : ۵۱، ۵۲ ] ’’پھر بے شک تم اے گمراہو! جھٹلانے والو! یقینا تھوہر کے پودے میں سے کھانے والے ہو۔‘‘ تو ایمان والوں کو اسے ماننے میں کوئی الجھن نہیں ہوئی، کیونکہ انھیں یقین تھا کہ اللہ اور اس کا رسول جو فرماتے ہیں وہ حق ہے۔ وہ کفار ہی تھے جنھوں نے کہا، آگ میں درخت کیسے ہو سکتا ہے؟ مزید دیکھیے سورۂ بنی اسرائیل (۶۰)۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) { اِنَّهَا شَجَرَةٌ تَخْرُجُ فِيْۤ اَصْلِ الْجَحِيْمِ :} یعنی زقوم ایسا درخت ہے جو جہنم کی تہ میں اگتا ہے اور آگ کی حرارت سے اس کا کچھ نہیں بگڑتا، جیسے پانی جن پودوں پر چڑھ جائے وہ مرجاتے ہیں، مگر سمندر کی تہ میں بے شمار درخت اور پودے اگتے ہیں۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) {طَلْعُهَا كَاَنَّهٗ رُءُوْسُ الشَّيٰطِيْنِ :} قاموس میں ہے {’’طَلْعٌ‘‘} دو ملے ہوئے جوتوں جیسی چیز ہے (جو کھجور کے درخت کے سرے پر نکلتی ہے) جس کے درمیان تہ بہ تہ پھل ہوتا ہے۔ {’’ رُءُوْسُ الشَّيٰطِيْنِ ‘‘} میں شیاطین سے مراد اگر ابلیس کی اولاد ہو تو وہ کسی نے نہیں دیکھی، نہ ان کے سر دیکھے ہیں، مگر یہ تشبیہ اس لیے دی گئی ہے کہ تمام دماغوں میں شیطان کا تصور سب سے بری اور مکروہ شخصیت کا ہے، جو ہر قسم کی خیر سے خالی ہے، جیسا کہ کسی بدصورت عورت یا مرد کو بدصورتی میں تشبیہ دینی ہو تو اسے بھوتنی یا بھوت کہا جاتا ہے، حالانکہ بھوت کسی نے نہیں دیکھا۔ بعض مفسرین نے فرمایا کہ سانپوں کی ایک قسم کو بھی شیاطین کہتے ہیں، ان کے سروں سے مراد ان کے ’’پھن‘‘ ہیں۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) {فَاِنَّهُمْ لَاٰكِلُوْنَ مِنْهَا … :} یعنی جہنمیوں پر ایسی خوف ناک بھوک مسلط ہو گی کہ زقوم کے نہایت تلخ ہونے اور گلے میں اٹکنے کے باوجود اسے چارو ناچار کھائیں گے۔ دیکھیے سورۂ مزمل (۱۲، ۱۳) اور غاشیہ (۶، ۷) اور پیٹ بھر کر کھائیں گے۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) {ثُمَّ اِنَّ لَهُمْ عَلَيْهَا لَشَوْبًا مِّنْ حَمِيْمٍ : ’’شَابَ يَشُوْبُ شَوْبًا‘‘} (ن) ملانا۔ {’’ حَمِيْمٍ ‘‘} انتہائی گرم پانی، یعنی زقوم کھانے کے بعد انھیں ایسی ہولناک پیاس لگے گی جس کی وجہ سے وہ مجبوراً انتہائی گرم پانی پییں گے، جو ایسا سخت گرم ہو گا کہ ان کی انتڑیاں ٹکڑے ٹکڑے کر دے گا، فرمایا : « وَ سُقُوْا مَآءً حَمِيْمًا فَقَطَّعَ اَمْعَآءَهُمْ » [ محمد : ۱۵ ] ’’اور انھیں کھولتا ہوا پانی پلایا جائے گا تو وہ ان کی انتڑیاں ٹکڑے ٹکڑے کر دے گا۔‘‘ یہی مضمون سورۂ واقعہ (۵۱ تا ۵۵) میں بھی بیان ہوا ہے۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) {ثُمَّ اِنَّ مَرْجِعَهُمْ لَاۡاِلَى الْجَحِيْمِ :} اس سے معلوم ہوا کہ زقوم کا درخت اور کھولتے پانی کے چشمے جہنم کے کسی خاص حصے میں ہوں گے، جب انھیں بھوک یا پیاس لگے گی تو انھیں اس مقام کی طرف ہانک دیا جائے گا، یا وہ خود ہی چلے جائیں گے، پھر دوبارہ انھیں بھڑکتی ہوئی آگ میں اپنے ٹھکانے کی طرف واپس لایا جائے گا، جیسا کہ فرمایا : « يَطُوْفُوْنَ بَيْنَهَا وَ بَيْنَ حَمِيْمٍ اٰنٍ » [ الرحمٰن : ۴۴ ] ’’وہ اس (جہنم) کے درمیان اور کھولتے ہوئے سخت گرم پانی کے درمیان چکر کاٹتے رہیں گے۔‘‘"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 70،69) {اِنَّهُمْ اَلْفَوْا اٰبَآءَهُمْ ضَآلِّيْنَ … : ’’ اَلْفَوْا ‘‘ ’’أَلْفٰي يُلْفِيْ إِلْفَاءً‘‘} (افعال) پانا۔ {’’ يُهْرَعُوْنَ ‘‘} کی وضاحت کے لیے دیکھیے سورۂ ہود کی آیت(۷۸) کی تفسیر۔ یعنی ان کفار کے عذاب الیم کا سبب یہ ہے کہ انھوں نے اپنے آباء کو ضلالت پر جمے ہوئے دیکھا اور اندھوں کی طرح بغیر سوچے سمجھے ان کے پیچھے دوڑ پڑے، جیسے کوئی انھیں پیچھے سے ہانک رہا ہو۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70،69) {اِنَّهُمْ اَلْفَوْا اٰبَآءَهُمْ ضَآلِّيْنَ … : ’’ اَلْفَوْا ‘‘ ’’أَلْفٰي يُلْفِيْ إِلْفَاءً‘‘} (افعال) پانا۔ {’’ يُهْرَعُوْنَ ‘‘} کی وضاحت کے لیے دیکھیے سورۂ ہود کی آیت(۷۸) کی تفسیر۔ یعنی ان کفار کے عذاب الیم کا سبب یہ ہے کہ انھوں نے اپنے آباء کو ضلالت پر جمے ہوئے دیکھا اور اندھوں کی طرح بغیر سوچے سمجھے ان کے پیچھے دوڑ پڑے، جیسے کوئی انھیں پیچھے سے ہانک رہا ہو۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) ➊ {وَ لَقَدْ ضَلَّ قَبْلَهُمْ اَكْثَرُ الْاَوَّلِيْنَ :} اس آیت میں رسول اللہ صلی اللہ علیہ وسلم اور داعیان حق کو تسلی دی ہے کہ ان کے ایمان نہ لانے پر زیادہ پریشان نہ ہوں، ان سے پہلے بھی اکثر لوگ گمراہ ہوئے۔ اگر یہ گمراہ ہیں تو کوئی تعجب کی بات نہیں۔ ¤ ➋ اس سے معلوم ہوا کہ حق کی پیروی کرنے والی ایک جماعت ہمیشہ موجود رہی ہے، اگرچہ اکثریت گمراہوں کی رہی ہے۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) {وَ لَقَدْ اَرْسَلْنَا فِيْهِمْ مُّنْذِرِيْنَ:} یعنی پہلے اکثر لوگوں کے گمراہ ہونے کا باعث یہ نہیں تھا کہ ان کے پاس کوئی خبردار کرنے والا نہیں آیا، بلکہ حقیقت یہ ہے کہ ہم نے ان میں بہت سے ڈرانے والے بھیجے، جو انھیں کفرو شرک اور اللہ کی حدود سے تجاوز کے برے انجام سے ڈراتے تھے۔ مگر انھوں نے حق قبول نہیں کیا، بلکہ باپ دادا کی تقلید پر جمے رہے اور اندھا دھند پہلوں کے نقش قدم پر دوڑتے گئے۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) {فَانْظُرْ كَيْفَ كَانَ … :} تو اے رسول یا اے مخاطب! دیکھ، ان لوگوں کا انجام کیا ہوا کہ اپنے اعمال کی وجہ سے پکڑے گئے، اس پکڑ کی کچھ وضاحت سورۂ عنکبوت میں ہے، فرمایا : « فَكُلًّا اَخَذْنَا بِذَنْۢبِهٖ فَمِنْهُمْ مَّنْ اَرْسَلْنَا عَلَيْهِ حَاصِبًا وَ مِنْهُمْ مَّنْ اَخَذَتْهُ الصَّيْحَةُ وَ مِنْهُمْ مَّنْ خَسَفْنَا بِهِ الْاَرْضَ وَ مِنْهُمْ مَّنْ اَغْرَقْنَا وَ مَا كَانَ اللّٰهُ لِيَظْلِمَهُمْ وَ لٰكِنْ كَانُوْۤا اَنْفُسَهُمْ يَظْلِمُوْنَ» [ العنکبوت : ۴۰ ] ’’تو ہم نے ہر ایک کو اس کے گناہ میں پکڑ لیا، پھر ان میں سے کوئی وہ تھا جس پر ہم نے پتھراؤ والی ہوا بھیجی اور ان میں سے کوئی وہ تھا جسے چیخ نے پکڑ لیا اور ان میں سے کوئی وہ تھا جسے ہم نے زمین میں دھنسا دیا اور ان میں سے کوئی وہ تھا جسے ہم نے غرق کر دیا اور اللہ ایسا نہ تھا کہ ان پر ظلم کرے اور لیکن وہ خود اپنے آپ پر ظلم کرتے تھے۔‘‘"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) {اِلَّا عِبَادَ اللّٰهِ الْمُخْلَصِيْنَ :} یعنی ہم نے تمام جھٹلانے والوں کو تباہ و برباد کر دیا، مگر اللہ کے وہ بندے جو اس کی توحید و عبادت کے لیے چنے ہوئے تھے، وہی محفوظ رہے۔ آگے چند {’’مُنْذِرِيْنَ‘‘} (ڈرانے والوں) اور چند {’’مُنْذَرِيْنَ‘‘} (ڈرائے جانے والوں) کے قصے بیان فرمائے، تاکہ رسول اللہ صلی اللہ علیہ وسلم اور حق کے تمام داعی حضرات کے دلوں کو اطمینان حاصل ہو اور حق جھٹلانے والوں کو عبرت ہو۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) ➊ { وَ لَقَدْ نَادٰىنَا نُوْحٌ :} پکارنے سے مراد وہ دعا ہے جو نوح علیہ السلام نے ساڑھے نوسو سال تک صبرو استقامت کے ساتھ دعوت دینے کے بعد اس وقت کی جب اللہ تعالیٰ نے انھیں آگاہ کیا کہ اب تمھاری قوم میں سے ان کے سوا کوئی ایمان نہیں لائے گا جو ایمان لا چکے۔ اس دعا کا ذکر سورۂ قمر (۱۰) اور سورۂ نوح (۲۶) میں ہے۔ ¤ ➋ {فَلَنِعْمَ الْمُجِيْبُوْنَ :} یہاں اس کے بعد مخصوص بالمدح {’’نَحْنُ‘‘} محذوف ہے، یعنی یقینا ہم اچھے دعا قبول کرنے والے ہیں۔ نوح علیہ السلام کی دعا کی قبولیت کی تفصیل کے لیے دیکھیے سورۂ ہود (۳۶ تا ۴۸)۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76) {وَ نَجَّيْنٰهُ وَ اَهْلَهٗ … : ’’ الْكَرْبِ الْعَظِيْمِ ‘‘} (بہت بڑی مصیبت) سے نجات سے مراد اس طوفانِ عظیم سے نجات ہے اور اس ہر وقت کی پریشانی سے بھی جو قوم کے جھٹلانے اور ستانے کی صورت میں سیکڑوں برس انھیں لاحق رہی۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77) {وَ جَعَلْنَا ذُرِّيَّتَهٗ هُمُ الْبٰقِيْنَ :} اس سے صاف ظاہر ہے کہ طوفان کے بعد صرف نوح علیہ السلام کی نسل آگے چلی، باقی ایمان والوں کی نسل ختم ہو گئی۔ اس آیت کے مطابق سورۂ بنی اسرائیل کی آیت (۳) : « ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوْحٍ » (اے ان لوگوں کی اولاد جنھیں ہم نے نوح کے ساتھ سوار کیا!) کا مطلب بھی یہی ہے کہ بعد میں نوح علیہ السلام کے بیٹوں اور پوتوں کی نسل ہی چلی جو کشتی میں سوار تھے۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل کیا ہے کہ نوح علیہ السلام کی اولاد کے سوا کوئی باقی نہیں رہا۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 79،78) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ … :} یعنی بعد میں آنے والی تمام اقوام نوح علیہ السلام پر سلام بھیجتی رہیں گی۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79،78) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ … :} یعنی بعد میں آنے والی تمام اقوام نوح علیہ السلام پر سلام بھیجتی رہیں گی۔"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) {اِنَّا كَذٰلِكَ نَجْزِي الْمُحْسِنِيْنَ :} ’’احسان‘‘ اللہ تعالیٰ کی عبادت میں بھی ہوتا ہے اور بندوں کے ساتھ بھی۔ اللہ کی عبادت میں احسان کا ذکر حدیثِ جبریل میں ہے، آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَنْ تَعْبُدَ اللّٰهَ كَأَنَّكَ تَرَاهُ ، فَإِنْ لَمْ تَكُنْ تَ تَرَاهُ فَإِنَّهُ يَرَاكَ ] [ بخاري، الإیمان، باب سؤال جبریل النبي صلی اللہ علیہ وسلم … : ۵۰ ] ’’(احسان یہ ہے) کہ تو اللہ کی عبادت اس طرح کرے گویا تو اسے دیکھ رہا ہے، تو اگر تُو اسے نہیں دیکھتا تو یقینا وہ تجھے دیکھ رہا ہے۔‘‘ بندوں کے ساتھ احسان کا ذکر قارون کو اس کی قوم کی نصیحت میں ہے، فرمایا : «وَ اَحْسِنْ كَمَاۤ اَحْسَنَ اللّٰهُ اِلَيْكَ » [ القصص : ۷۷ ] ’’جس طرح اللہ نے تجھ پر احسان کیا تو بھی احسان کر۔‘‘ یعنی کسی معاوضے کی خواہش کے بغیر ان سے نیکی کر۔ آیت کا مطلب یہ ہے کہ جس طرح ہم نے نوح علیہ السلام کو جزا دی، ان کی دعا قبول کی، انھیں اور ان کے اہل کو بہت بڑی مصیبت سے نجات دی اور ان پر سلام کو تاقیامت جاری رکھا، ایسے ہی ہم سب احسان کرنے والوں کو جزا دیتے ہیں۔ اس میں رسول اللہ صلی اللہ علیہ وسلم اور آپ کے ساتھیوں کے لیے بہت بڑی خوش خبری ہے۔"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) { اِنَّهٗ مِنْ عِبَادِنَا الْمُؤْمِنِيْنَ:} کیونکہ وہ ہمارے مومن بندوں سے تھا۔ اس سے معلوم ہوا کہ ایمان بندوں کے مراتب میں سب سے بلند مرتبہ ہے، کیونکہ اس میں دین کے تمام عقائد و اعمال آ جاتے ہیں، پھر جیسے جیسے ایمان کامل ہو گا ویسے ہی جزا کامل ہوگی۔ اور ظاہر ہے نوح علیہ السلام اور دوسرے انبیاء کے ایمان کے کمال تک عام لوگوں کا ایمان نہیں پہنچ سکتا اور ہمارے نبی صلی اللہ علیہ وسلم کو تو اللہ تعالیٰ نے سید ولد آدم بنایا، ان کے ایمان کا درجہ تو سب سے عالی ہے۔"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) {ثُمَّ اَغْرَقْنَا الْاٰخَرِيْنَ :} پھر نوح علیہ السلام کو ملنے والی جزا میں سے ایک بہت بڑی جزا یہ ہے کہ ہم نے انھیں اور ان کے اہل کو نجات دی اور دوسرے تمام لوگوں کو غرق کر دیا جو ان پر ایمان نہیں لائے اور انھیں عمر بھر ستاتے رہے، کیونکہ دشمنوں سے انتقام کے ساتھ دل اور آنکھیں ٹھنڈی ہوتی ہیں۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) {وَ اِنَّ مِنْ شِيْعَتِهٖ لَاِبْرٰهِيْمَ : ’’شِيْعَةٌ‘‘ ’’شَاعَ يَشِيْعُ شِيَاعًا‘‘} (ض) سے مشتق ہے، جس کا معنی ساتھ دینا ہے، ایسی جماعت جو کسی کا ساتھ دے۔ یعنی نوح علیہ السلام کا ساتھ دینے والے گروہ میں سے ابراہیم علیہ السلام بھی ہیں، کیونکہ وہ بھی توحید، آخرت اور دین کی تمام بنیادی چیزوں کے متعلق وہی عقائد و اعمال رکھتے تھے جو نوح علیہ السلام کے تھے، بلکہ تمام انبیاء کا اصل دین ایک ہی ہے جس کا نام اسلام ہے اور سب کی امتیں ایک امت ہیں جس کا نام امتِ مسلمہ ہے، جیسا کہ فرمایا : «وَ اِنَّ هٰذِهٖۤ اُمَّتُكُمْ اُمَّةً وَّاحِدَةً وَّ اَنَا رَبُّكُمْ فَاتَّقُوْنِ » [ المؤمنون : ۵۲ ] ’’اور بے شک یہ تمھاری امت ہے، جو ایک ہی امت ہے اور میں تمھارا رب ہوں، سو مجھ سے ڈرو۔‘‘"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84) { اِذْ جَآءَ رَبَّهٗ بِقَلْبٍ سَلِيْمٍ :} جب اس نے نوح علیہ السلام کی طرح شرک، شک، منافقت، حسد، بغض، سرکشی اور ہر روگ سے پاک دل لے کر نہایت اخلاص اور عاجزی کے ساتھ اپنے رب کی طرف رجوع کیا۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 85) {اِذْ قَالَ لِاَبِيْهِ وَ قَوْمِهٖ …:} ابراہیم علیہ السلام کا یہ سوال پوچھنے کے لیے نہیں بلکہ ان کی عبادت کے انکار کے لیے تھا۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86) { اَىِٕفْكًا اٰلِهَةً دُوْنَ اللّٰهِ تُرِيْدُوْنَ : ’’ ىِٕفْكًا ‘‘} مصدر بمعنی اسم مفعول برائے مبالغہ ہے اور {’’ اٰلِهَةً ‘‘} اس سے بدل ہے۔ {’’ ىِٕفْكًا ‘‘} کو اصل معنی میں لیں تو یہ مفعول لہٗ بن جائے گا۔"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) { فَمَا ظَنُّكُمْ بِرَبِّ الْعٰلَمِيْنَ :} یعنی رب العالمین جو پوری کائنات کا مالک ہے اور تمام جہانوں کے ایک ایک ذرے کی پرورش کر رہا ہے، اس کے متعلق تمھارا کیا گمان ہے؟ کیا تم نے اس میں کوئی نقص یا عیب پایا کہ اپنے گھڑے ہوئے معبودوں کی عبادت کرنے لگے اور اس کی گرفت سے بالکل بے خوف ہو گئے؟"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) {فَنَظَرَ نَظْرَةً فِي النُّجُوْمِ:} ابراہیم علیہ السلام نے جب دیکھا کہ محض زبانی نصیحت سے وہ بتوں کے بے بس اور بے اختیار ہونے کو ماننے کے لیے تیار نہیں بلکہ اس مقصد کے لیے عملاً انھیں توڑنا پڑے گا تو انھوں نے پہلے تو اعلان کیا کہ اللہ کی قسم! جب تم کہیں گئے تو میں تمھارے بتوں کی کوئی تدبیر ضرور کروں گا۔ (دیکھیے انبیاء : ۵۷) پھر مناسب موقع کا انتظار کرنے لگے، کیونکہ ان کی موجودگی میں یہ کام نہیں ہو سکتا تھا۔ اسی دوران ان کی قوم کے ایک جشن یا میلے کا دن آ گیا، انھوں نے ابراہیم علیہ السلام کو اس میں شرکت کی دعوت دی۔ ابراہیم علیہ السلام چاہتے تھے کہ جب وہ لوگ اپنے میلے میں چلے جائیں اور ان کے بتوں کے پاس کوئی نہ رہے تو اطمینان کے ساتھ انھیں توڑ دیں، اس لیے انھوں نے پہلے تو ستاروں میں ایک نگاہ ڈالی۔ ستاروں میں نگاہ ڈالنے کا مقصد کیا تھا؟ بعض مفسرین نے فرمایا کہ یہ محاورہ ہے جو غوروفکر کے معنی میں استعمال ہوتا ہے، کیونکہ جب کوئی غور طلب معاملہ سامنے آتا ہے تو آدمی آسمان کی طرف دیکھتا ہے، یعنی ابراہیم علیہ السلام نے ستاروں میں ایک نگاہ ڈالی، کچھ سوچا اور کہا کہ میں تو بیمار ہوں، اور بعض مفسرین نے فرمایا کہ ابراہیم علیہ السلام کی قوم بتوں کے علاوہ سورج، چاند اور ستاروں کی پرستش بھی کرتی تھی اور ستاروں کو حوادث زمانہ میں مؤثر سمجھتی تھی، اس لیے ابراہیم علیہ السلام نے انھیں مغالطہ دینے کے لیے کہا کہ میں تو بیمار ہوں، یا بیمار ہونے والا ہوں، تاکہ وہ سمجھیں کہ انھوں نے یہ بات ستاروں کو دیکھ کر معلوم کی ہے۔"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 89) {فَقَالَ اِنِّيْ سَقِيْمٌ :} یہ ایسی بات تھی جو درحقیقت سچی تھی، کیونکہ عموماً آدمی کی طبیعت کچھ نہ کچھ خراب ہوتی ہے، مگر قوم نے اس کا مطلب کچھ اور سمجھا (کہ وہ جانے کے قابل نہیں ہیں) جس سے ابراہیم علیہ السلام اپنا مقصد حاصل کرنے میں کامیاب ہو گئے۔ ایسی باتوں کو جن میں کہنے والے کی نیت کچھ ہو اور سننے والا کچھ اور سمجھے ’’معاریض‘‘ کہتے ہیں، جن کے ساتھ آدمی صریح جھوٹ سے بچ جاتا ہے۔ صحیح بخاری (۳۳۵۸) میں ابراہیم علیہ السلام کی {’’ثَلَاثَ كَذِبَاتٍ‘‘} والی حدیث پر مفصل بحث کے لیے دیکھیے سورۂ انبیاء کی آیت (۶۲، ۶۳) کی تفسیر۔"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت 90) {فَتَوَلَّوْا عَنْهُ مُدْبِرِيْنَ :} تو وہ لوگ انھیں وہیں چھوڑ کر چلے گئے۔"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت 91) { فَرَاغَ اِلٰۤى اٰلِهَتِهِمْ … : ’’رَاغَ يَرُوْغُ‘‘} (ن) کا معنی خفیہ طور پر جانا، حیلہ کرتے ہوئے تیزی سے جانا، مائل ہونا۔ ابراہیم علیہ السلام چپکے سے ان کے بتوں کی طرف گئے اور ان کا مذاق اڑاتے ہوئے ان سے کہنے لگے : ’’کیا تم کھاتے نہیں؟‘‘ اس سے صاف ظاہر ہے کہ مندر میں بتوں کے سامنے طرح طرح کے کھانے، مٹھائیاں اور پھل وغیرہ رکھے ہوئے تھے۔ مقصد یہ کہ معمولی جانور بھی کم از کم کھاتے تو ہیں، یہ بے جان پتھر جو کھاتے بھی نہیں، انسان ان کی پوجا کیسے کرنے لگا؟"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت 92) {مَا لَكُمْ لَا تَنْطِقُوْنَ :} جب بتوں کی طرف سے جواب نہ ملا تو کہنے لگے، تمھیں کیا ہے کہ تم بولتے نہیں! ناک نقشہ اور تمام اعضا تو تمھارے انسانوں جیسے ہیں، مگر تم نہ کھا سکتے ہو، نہ بول سکتے ہو، پھر تعجب ہے کہ وہ انسان تمھیں پوجنے لگے جو کھاتے پیتے بھی ہیں اور بولتے بھی ہیں؟"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت 93) { فَرَاغَ عَلَيْهِمْ ضَرْبًۢا بِالْيَمِيْنِ : ’’يَمِيْنٌ‘‘} کا معنی دایاں ہاتھ بھی ہے اور قوت بھی۔ تفصیل کے لیے دیکھیے سورۂ انبیاء کی آیت (۵۸) کی تفسیر۔"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت 94) {فَاَقْبَلُوْۤا اِلَيْهِ يَزِفُّوْنَ : ’’ زَفَّ يَزِفُّ زَفًّا وَ زُفُوْفًا وَ زَفِيْفًا ‘‘} (ض) تیزی سے جانا، دوڑنا۔ یعنی بتوں کا یہ حال دیکھ کر قوم کو یہ جاننے میں کوئی مشکل پیش نہیں آئی کہ ان کا یہ حال کس نے کیا ہے، کیونکہ ابراہیم علیہ السلام انھیں پہلے ہی اپنے ارادے سے آگاہ کر چکے تھے، اس لیے وہ سب دوڑتے ہوئے ان کے پاس آئے اور انھیں پکڑ کر مجمع میں لے آئے۔ تفصیل کے لیے دیکھیے سورۂ انبیاء (۵۹ تا ۶۱)۔"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت 95) {قَالَ اَتَعْبُدُوْنَ مَا تَنْحِتُوْنَ :} کیا تم اپنے تراشے ہوئے بتوں کی عبادت کرتے ہو؟"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت 96) {وَ اللّٰهُ خَلَقَكُمْ وَ مَا تَعْمَلُوْنَ : ’’ مَا تَعْمَلُوْنَ ‘‘} کے دو معنی ہو سکتے ہیں، {’’ مَا ‘‘} موصولہ ہو تو مطلب یہ ہے کہ کیا تم اس کی عبادت کرتے ہو جسے خود تراشتے ہو، حالانکہ اللہ تعالیٰ نے تمھیں پیدا کیا اور ان چیزوں کو بھی جو تم بناتے ہو، یعنی تم اور تمھارے بت دونوں اللہ کی مخلوق ہیں، پھر خالق کو چھوڑ کر مخلوق کی عبادت کیوں کرتے ہو؟ اور {’’ مَا ‘‘} مصدریہ ہو تو معنی یہ ہے کہ اللہ تعالیٰ نے تمھیں پیدا کیا اور جو عمل تم کرتے ہو وہ بھی اللہ تعالیٰ نے پیدا کیا۔ اس سے معلوم ہوا کہ بندے کے تمام افعال کا خالق بھی اللہ تعالیٰ ہے، بندہ صرف کاسب اور عامل ہے، اس کے عمل کا خالق وہ خود نہیں بلکہ اللہ تعالیٰ ہے اور یہی اہلِ سنت کا عقیدہ ہے۔ امام بخاری رحمہ اللہ نے اس مسئلے پر کتاب {’’خَلْقُ أَفْعَالِ الْعِبَادِ‘‘} لکھی ہے۔"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت 97) {قَالُوا ابْنُوْا لَهٗ بُنْيَانًا … : ’’ بُنْيَانًا ‘‘} کی تنوین تعظیم کی ہے۔ {’’ الْجَحِيْمِ ‘‘} خوب بھڑکائی ہوئی آگ، یہ {’’حَجَمَ فُلَانٌ النَّارَ‘‘ } (ف) (فلاں نے آگ خوب بھڑکائی) سے مشتق ہے۔ دلیل میں لاجواب ہونے پر انھوں نے فیصلہ کیا کہ ابراہیم( علیہ السلام ) کے لیے ایک بڑی عمارت بناؤ، اسے ایندھن سے بھر کر آگ لگاؤ اور جب وہ خوب بھڑک اٹھے تو ابراہیم( علیہ السلام ) کو اس میں پھینک دو۔ اس چار دیواری یا عمارت کا بلند اور بڑا ہونا تو {’’ بُنْيَانًا ‘‘} کے لفظ اور اس کی تنوین سے ظاہر ہو رہا ہے، مگر اس کی پیمائش کسی معتبر ذریعے سے ہم تک نہیں پہنچی۔"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت 98) {فَاَرَادُوْا بِهٖ كَيْدًا … :} اس کی تفصیل کے لیے دیکھیے سورۂ انبیاء (۷۰)۔"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت 99) ➊ { وَ قَالَ اِنِّيْ ذَاهِبٌ اِلٰى رَبِّيْ … :} قرطبی نے فرمایا : ’’یہ آیت ہجرت اور کفار سے علیحدگی اختیار کرنے میں اصل ہے۔‘‘ آگ سے سلامتی کے ساتھ نکلنے کے عظیم معجزے کے بعد بھی جب لوط علیہ السلام کے سوا کوئی شخص ایمان نہ لایا تو ابراہیم علیہ السلام نے وہاں سے ہجرت کا فیصلہ فرمایا اور کہنے لگے، میں اپنی قوم اور اپنے وطن سے، جہاں کفر کا تسلط ہے، اپنے رب کی طرف جاتا ہوں، جہاں آزادی سے اپنے رب کی عبادت کر سکوں اور اس کے دین کی دعوت دے سکوں۔ ان کے ساتھ ان کی بیوی سارہ اور بھتیجے لوط علیھما السلام تھے۔ اس آیت سے معلوم ہوا کہ آدمی جب کسی جگہ اپنے دین پر پوری طرح عمل نہ کر سکے تو اسے وہاں سے ہجرت کرنی چاہیے۔ ¤ ➋ { سَيَهْدِيْنِ :} یہ اصل میں {’’سَيَهْدِيْنِيْ‘‘} ہے، یہاں ’’سین‘‘ تاکید کے لیے ہے، اس لیے ترجمہ ’’وہ مجھے ضرور راستہ دکھائے گا‘‘ کیا گیا ہے۔ ابراہیم علیہ السلام جب اپنے وطن سے نکلے تو انھیں معلوم نہ تھا کہ کہاں جانا ہے، مگر انھیں اپنے رب پر بھروسے کی وجہ سے یقین تھا کہ وہ ضرور ان کی راہ نمائی فرمائے گا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اِحْفَظِ اللّٰهَ يَحْفَظْكَ ] [ ترمذي، صفۃ القیامۃ والرقائق، باب : ۲۵۱۶ ] ’’تو اللہ تعالیٰ کا دھیان رکھ وہ تیرا دھیان رکھے گا۔‘‘ اور یہ بات یقینی ہے کہ جو شخص اللہ کی خاطر کوئی چیز چھوڑتا ہے تو اللہ تعالیٰ اسے اس سے بہتر چیز عطا فرماتا ہے۔ چنانچہ اللہ تعالیٰ نے ان کی راہ نمائی مبارک سرزمین شام کی طرف فرمائی۔"
    },
    {
      "ayah": 100,
      "tafsir": "(آیت 100) {رَبِّ هَبْ لِيْ مِنَ الصّٰلِحِيْنَ :} اس سے ظاہر ہے کہ اس وقت ابراہیم علیہ السلام ککی اولاد نہیں تھی۔ چنانچہ جب وہ اپنی قوم سے مایوس ہوئے تو انھوں نے اللہ تعالیٰ سے دعا کی کہ پروردگارا! مجھے اپنی قوم اور خاندان کے عوض صالح اولاد عطا فرما، جو غریب الوطنی میں میری مونس و غم خوار اور مددگار ہو۔ واضح رہے، صالح ہونا بندے کے مقامات میں سے بہت اونچا مقام ہے، جس کی ابراہیم علیہ السلام نے اپنے لیے دعا کی : « رَبِّ هَبْ لِيْ حُكْمًا وَّ اَلْحِقْنِيْ بِالصّٰلِحِيْنَ» [ الشعراء : ۸۳ ] ’’اے میرے رب! مجھے حکم عطا کر اور مجھے نیک لوگوں کے ساتھ ملا۔‘‘ اور اس جگہ ابراہیم علیہ السلام نے اپنے بیٹے کے لیے دعا کی : «رَبِّ هَبْ لِيْ مِنَ الصّٰلِحِيْنَ » یوسف علیہ السلام نے اپنے لیے دعا کی : « تَوَفَّنِيْ مُسْلِمًا وَّ اَلْحِقْنِيْ بِالصّٰلِحِيْنَ » [ یوسف : ۱۰۱ ] ’’مجھے مسلم ہونے کی حالت میں فوت کر اور مجھے نیک لوگوں کے ساتھ ملا دے۔‘‘ اور سلیمان علیہ السلام نے دعا کی : « وَ اَدْخِلْنِيْ بِرَحْمَتِكَ فِيْ عِبَادِكَ الصّٰلِحِيْنَ » [ النمل : ۱۹ ] ’’اور اپنی رحمت سے مجھے اپنے نیک بندوں میں داخل فرما۔‘‘ کیونکہ مکمل صالح وہ ہے جس کا ہر کام درست ہو۔"
    },
    {
      "ayah": 101,
      "tafsir": "(آیت 101) {فَبَشَّرْنٰهُ بِغُلٰمٍ حَلِيْمٍ :} یعنی ہم نے ان کی دعا قبول کی اور انھیں ایک بہت حلم والے لڑکے کی بشارت دی۔ حلم میں صبر، حسنِ خلق، حوصلے کی وسعت اور زیادتی کرنے والوں سے درگزر شامل ہے۔ عموماً اس کا ترجمہ بردباری کیا جاتا ہے۔ یہ بیٹا اسماعیل علیہ السلام تھا۔ ابراہیم علیہ السلام نے یا تو یہ دعا کافی عمر ہونے کے بعد کی، یا ان کی دعا اور اس کی قبولیت میں کئی سال کا وقفہ ہوا، کیونکہ انھوں نے اللہ تعالیٰ کا شکر ادا کرتے ہوئے کہا : « اَلْحَمْدُ لِلّٰهِ الَّذِيْ وَهَبَ لِيْ عَلَى الْكِبَرِ اِسْمٰعِيْلَ وَ اِسْحٰقَ» [ إبراہیم : ۳۹ ] ’’سب تعریف اس اللہ کی ہے جس نے مجھے بڑھاپے کے باوجود اسماعیل اور اسحاق عطا کیے۔‘‘ ابراہیم علیہ السلام نے اسماعیل علیہ السلام اور ان کی والدہ کو وادی غیر ذی زرع (مکہ) میں چھوڑا، جہاں اللہ تعالیٰ نے ان کے لیے آب زم زم مہیا فرمایا اور قبیلہ بنو جرہم کو لابسایا۔"
    },
    {
      "ayah": 102,
      "tafsir": "(آیت 102) ➊ { فَلَمَّا بَلَغَ مَعَهُ السَّعْيَ …: ’’ يٰبُنَيَّ ‘‘ ’’اِبْنٌ‘‘} کی تصغیر ہے، اے میرے چھوٹے بیٹے! مراد ہے اے میرے پیارے بیٹے! ابراہیم علیہ السلام وقتاً فوقتاً شام سے اسماعیل علیہ السلام اور ان کی والدہ کی خبر گیری کے لیے آتے رہتے تھے۔ جب بیٹا اس کے ساتھ دوڑ دھوپ کی عمر کو پہنچ گیا، یعنی اس قابل ہو گیا کہ باپ کا ہاتھ بٹا سکے تو اللہ تعالیٰ کی طرف سے ابراہیم علیہ السلام کو ایک نیا امتحان پیش آیا۔ وہ یہ کہ انھوں نے خواب میں دیکھا کہ وہ بڑی دعاؤں اور آرزؤوں کے بعد بڑھاپے میں ملنے والے نہایت عزیز بیٹے کو ذبح کر رہے ہیں۔ نبی کا خواب بھی وحی ہوتا ہے، اس لیے انھوں نے اسے اللہ کا حکم سمجھ کر کسی بھی تردّد کے بغیر اس پر عمل کا پکا ارادہ کر لیا اور بر بیٹے سے کہا، اے میرے پیارے بیٹے! میں خواب میں دیکھتا ہوں کہ میں تجھے ذبح کر رہا ہوں، سو دیکھ، تو کیا خیال کرتا ہے۔ ¤ ➋ { فَانْظُرْ مَا ذَا تَرٰى:} بیٹے کی رائے پوچھنے کا مطلب یہ نہ تھا کہ اگر وہ نہ مانتا تو وہ اللہ کے حکم پر عمل نہ کرتے، بلکہ وہ اپنے ساتھ بیٹے کو اللہ کے حکم کی اطاعت میں شریک کرنا چاہتے تھے اور انھیں امید تھی کہ بیٹا اللہ کے حکم کی تعمیل کے لیے ضرور آمادگی کا اظہار کرے گا، کیونکہ اللہ تعالیٰ نے انھیں حلیم لڑکے کی بشارت دی تھی اور واقعی بیٹے نے یہ کہہ کر حلیم ہونے کا ثبوت دیا جو اگلے جملے میں مذکور ہے۔ ¤ ➌ { قَالَ يٰۤاَبَتِ افْعَلْ مَا تُؤْمَرُ:’’ يٰۤاَبَتِ ‘‘} کی وضاحت کے لیے دیکھیے سورۂ یوسف (۴) اس سے معلوم ہوا کہ اسماعیل علیہ السلام نے اسے محض خواب نہیں بلکہ اللہ کا حکم سمجھا اور کہا اے میرے باپ! آپ کو جو حکم دیا جا رہا ہے وہ کیجیے۔ یہ صاف دلیل ہے کہ انبیاء کا خواب وحی ہوتا ہے۔ ابراہیم اور اسماعیل علیھما السلام دونوں نے یہی سمجھا اور دونوں اسے اللہ کا حکم سمجھ کر اس کی تعمیل کے لیے تیار ہو گئے۔ ¤ ➍ { سَتَجِدُنِيْۤ اِنْ شَآءَ اللّٰهُ مِنَ الصّٰبِرِيْنَ :} اس  میں اسماعیل علیہ السلام کی کمال اطاعت کے ساتھ ان کا کمال صبر ظاہر ہو رہا ہے، جو ان کے{’’ غُلَامٌ حَلِيْمٌ ‘‘} ہونے کا نتیجہ تھا۔ اطاعت اور صبر کے ساتھ ان کا اللہ تعالیٰ کے لیے حسنِ ادب بھی ظاہر ہو رہا ہے کہ انھوں نے اپنی اطاعت اور قربانی کو اللہ تعالیٰ کی مشیّت کے تابع قرار دیا کہ اگر اس نے چاہا تو میں اس آزمائش پر صبر کروں گا۔"
    },
    {
      "ayah": 103,
      "tafsir": "(آیت 103) ➊ {فَلَمَّاۤ اَسْلَمَا وَ تَلَّهٗ لِلْجَبِيْنِ :} عام طور پر مفسرین نے {’’اَلْجَبِيْنُ‘‘} کا ترجمہ پیشانی یا ماتھا کیا ہے اور کہا گیا ہے کہ ابراہیم علیہ السلام نے بیٹے کو اوندھا اس لیے لٹایا کہ ذبح کرتے وقت اس کا چہرہ دیکھ کر کہیں دل میں رِقّت اور ہاتھ میں لرزش پیدا نہ ہو جائے۔ بعض نے کچھ آثار بھی نقل کیے ہیں کہ اسماعیل علیہ السلام نے خود ابراہیم علیہ السلام کو ایسا کرنے کی وصیت کی۔ بعض نے لکھا ہے کہ ابراہیم علیہ السلام نے بیٹے کے کہنے پر اس کے دونوں ہاتھ گردن کے ساتھ باندھ دیے اور اسے الٹا لٹا لیا اور چاہتے تھے کہ نیچے سے گردن پر چھری پھیریں۔ مگر یہ سب اسرائیلیات ہیں اور ان میں سے کوئی بات بھی ثابت نہیں۔ اس مقام پر جبین سے مراد ماتھا لینا بہت بعید ہے، کیونکہ جبین کا معنی {’’جَبْهَةٌ‘‘} (ماتھے) کی ایک جانب ہے۔ ہر آدمی کی دو جبینیں ہوتی ہیں۔ طبری نے اس قسم کی روایتیں نقل کرنے کے باوجود خود {’’ وَ تَلَّهٗ لِلْجَبِيْنِ ‘‘} کی تفسیر کرتے ہوئے لکھا ہے : {’’وَ صَرَعَهُ لِلْجَبِيْنِ وَالْجَبِيْنَانِ مَا عَنْ يَمِيْنِ  الْجَبْهَةِ وَ عَنْ شِمَالِهَا وَلِلْوَجْهِ جَبِيْنَانِ وَالْجَبْهَةُ بَيْنَهُمَا‘‘} یعنی ابراہیم علیہ السلام نے اسے جبین پر گرا لیا اور دو جبینیں وہ ہیں جو {’’جَبْهَةٌ‘‘} (پیشانی) کے دائیں اور بائیں طرف ہوتی ہیں اور چہرے کی دو جبینیں ہوتی ہیں اور {’’جَبْهَةٌ‘‘} (پیشانی) ان دونوں کے درمیان ہوتی ہے۔‘‘ قاموس میں ہے : {’’اَلْجَبِيْنَانِ حَرْفَانِ مَكْتَنِفَا الْجَبْهَةِ مِنْ جَانِبَيْهَا‘‘} ’’یعنی ماتھے کے دونوں جانبوں والے کناروں کو دو جبینیں کہتے ہیں۔‘‘ اس لیے میں نے اس کا ترجمہ کیا ہے کہ ’’اس نے اسے پیشانی کی ایک جانب پر گرا دیا۔‘‘ ذبح کرتے وقت کسی بھی جانور کو اسی طرح گرایا جاتا ہے، تاکہ حلق پر چھری پھر سکے۔ ¤ ➋ { ’’ فَلَمَّاۤ اَسْلَمَا وَ تَلَّهٗ لِلْجَبِيْنِ ‘‘} (تو جب دونوں نے حکم مان لیا اور اس نے اسے پیشانی کی ایک جانب پر گرا دیا) تو پھر کیا ہوا؟ صاحب کشف نے فرمایا : ’’جواب یہ ہے کہ ({كَانَ مَا كَانَ}) یعنی پھر ہوا جو ہوا۔‘‘ اس سوال کا جواب یہاں ذکر نہیں کیا گیا، کیونکہ یہ بات بیان میں آنا مشکل ہے کہ اس وقت باپ کے دل پر کیا گزری تھی، فرشتوں کی حیرانی کا کیا عالم تھا اور اللہ تعالیٰ، جس کے حکم پر وہ عزیز بیٹے کو ذبح کر رہے تھے، کس قدر خوش اور مہربان ہو رہا تھا۔ ¤ ➌ اس مقام پر مفسرین نے بعض صحابہ اور تابعین سے مختلف آثار نقل کیے ہیں، جن میں سے اکثر کی تو سند ہی صحیح نہیں۔ اگر صحیح ہو بھی تو ظاہر ہے وہ حضرات واقعہ کے وقت موجود نہیں تھے، نہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے وہ باتیں روایت کی ہیں اور نہ ہی اپنی معلومات کا کوئی اور معتبر ذریعہ بتایا ہے۔ حافظ ابن کثیر رحمہ اللہ نے {’’البداية والنهاية‘‘} میں اسماعیل علیہ السلام کے قصے کا ذکر کرتے ہوئے لکھا ہے : {’’غَالِبُ مَا هٰهُنَا مِنَ الْآثَارِ مَأْخُوْذٌ مِنَ الْإِسْرَائِيْلِيَاتِ وَفِي الْقُرْآنِ كِفَايَةٌ عَمَّا جَرٰي مِنَ الْأَمْرِ الْعَظِيْمِ وَالْاِخْتِبَارِ الْبَاهِرِ وَأَنَّهُ فُدِيَ بِذِبْحٍ عَظِيْمٍ وَ قَدْ وَرَدَ فِي الْحَدِيْثِ أَنَّهُ كَانَ كَبَشًا ‘‘} ’’یعنی یہاں ذکر کیے جانے والے اکثر آثار اسرائیلیات سے لیے گئے ہیں اور قرآن مجید میں جو کچھ مذکور ہے وہ اس عظیم الشان معاملے اور طاقت سے اونچے امتحان کے بیان کے لیے کافی ہے اور یہ کہ ان کا فدیہ عظیم ذبیحے کے ساتھ دیا گیا اور حدیث میں آیا ہے کہ وہ ایک مینڈھا تھا۔ ‘‘"
    },
    {
      "ayah": 104,
      "tafsir": "(آیت 105،104) ➊ { وَ نَادَيْنٰهُ اَنْ يّٰۤاِبْرٰهِيْمُ … :} جب ان دونوں نے حکم مان لیا اور اس نے اسے پیشانی کی ایک جانب پر گرا دیا ( تو ہوا جو ہوا) اور ہم نے اسے آواز دی کہ اے ابراہیم! یقینا تو نے خواب سچا کر دکھایا۔ مفسر سلیمان الجمل نے فرمایا : ’’اگر تم کہو کہ اللہ تعالیٰ نے ابراہیم علیہ السلام کو کیسے فرمایا کہ تو نے خواب سچا کر دکھایا، حالانکہ انھوں نے خواب دیکھا تھا کہ وہ اپنے بیٹے کو ذبح کر رہے ہیں، خواب سچا تو اسی صورت میں ہونا تھا کہ اسے ذبح کر دیتے؟ تو میں کہوں گا کہ اللہ تعالیٰ نے خواب سچا کر دکھانے والا اس لیے فرمایا کہ انھوں نے اپنی پوری کوشش اور طاقت صرف کر دی، جو کچھ کر سکتے تھے کیا، ذبح کرنے والا جو کچھ کرتا ہے وہ سب کیا، تو اللہ تعالیٰ کو جو مطلوب تھا وہ انھوں نے ادا کر دیا اور وہ تھا اللہ تعالیٰ کے حکم کے لیے پوری طرح مطیع اور فرماں بردار ہو جانا۔‘‘ بقاعی نے اس سوال کے جواب میں فرمایا : {’’قَالَ اللّٰهُ قَدْ صَدَّقْتَ الرُّؤْيَا فِيْ أَنَّكَ تَذْبَحُهُ فَإِنَّكَ قَدْ عَلَجْتَ وَ بَذَلْتَ الْوُسْعَ فِيْهِ وَ فَعَلْتَ مَا رَأَيْتَ فِي الْمَنَامِ فَمَا انْذَبَحَ لِأَنَّكَ مَا رَأَيْتَ أَنَّكَ ذَبَحْتَهُ فَاكْفُفْ عَنْ مُعَالَجَةِ الذِّبْحِ بِأَزْيَدَ مِنْ هٰذَا ‘‘} ’’اللہ تعالیٰ نے فرمایا، تو نے اپنا خواب سچا کر دیا کہ تو اسے ذبح کر رہا ہے، کیونکہ تو نے کوشش کی اور اپنی پوری طاقت اس میں صرف کی اور جو کچھ خواب میں دیکھا تھا وہ کیا، مگر وہ ذبح نہیں ہوا، کیونکہ تو نے یہ نہیں دیکھا تھا کہ تو نے اسے ذبح کر دیا ہے (بلکہ یہ دیکھا تھا کہ ذبح کر رہے ہو) اس لیے اس سے زیادہ ذبح کی کوشش سے رک جا۔‘‘ بقاعی کے علاوہ اور کئی مفسرین نے یہی توجیہ فرمائی ہے کہ خواب {’’ اَنِّيْۤ اَذْبَحُكَ ‘‘} تھا، {’’أَنِّيْ ذَبَحْتُكَ‘‘} نہیں تھا اور ابراہیم علیہ السلام نے جو کچھ کیا اس کے ساتھ وہ خواب سچا ہو گیا۔ ¤ ➋ { اِنَّا كَذٰلِكَ نَجْزِي الْمُحْسِنِيْنَ :} یعنی ہمارا دستور ہے کہ ہم نیکو کاروں کو ایسے مشکل حکم کر کے آزماتے ہیں، پھر انھیں ثابت قدم رکھتے ہیں۔ جب وہ اس آزمائش میں پورے اترتے ہیں تو ان کے درجات بلند کرتے ہیں اور جس آزمائش میں ہم انھیں ڈالتے ہیں اس سے نکلوا بھی دیتے ہیں، جیسے ابراہیم علیہ السلام کو آگ کی آزمائش میں ڈالا اور وہاں سے سلامت نکال بھی لائے اور ان کا درجہ بلند کر دیا۔ اسی طرح بیٹے کی قربانی کی آزمائش میں بیٹے کو بچا لیا اور درجات بھی بلند کر دیے۔"
    },
    {
      "ayah": 105,
      "tafsir": "(آیت 105،104) ➊ { وَ نَادَيْنٰهُ اَنْ يّٰۤاِبْرٰهِيْمُ … :} جب ان دونوں نے حکم مان لیا اور اس نے اسے پیشانی کی ایک جانب پر گرا دیا ( تو ہوا جو ہوا) اور ہم نے اسے آواز دی کہ اے ابراہیم! یقینا تو نے خواب سچا کر دکھایا۔ مفسر سلیمان الجمل نے فرمایا : ’’اگر تم کہو کہ اللہ تعالیٰ نے ابراہیم علیہ السلام کو کیسے فرمایا کہ تو نے خواب سچا کر دکھایا، حالانکہ انھوں نے خواب دیکھا تھا کہ وہ اپنے بیٹے کو ذبح کر رہے ہیں، خواب سچا تو اسی صورت میں ہونا تھا کہ اسے ذبح کر دیتے؟ تو میں کہوں گا کہ اللہ تعالیٰ نے خواب سچا کر دکھانے والا اس لیے فرمایا کہ انھوں نے اپنی پوری کوشش اور طاقت صرف کر دی، جو کچھ کر سکتے تھے کیا، ذبح کرنے والا جو کچھ کرتا ہے وہ سب کیا، تو اللہ تعالیٰ کو جو مطلوب تھا وہ انھوں نے ادا کر دیا اور وہ تھا اللہ تعالیٰ کے حکم کے لیے پوری طرح مطیع اور فرماں بردار ہو جانا۔‘‘ بقاعی نے اس سوال کے جواب میں فرمایا : {’’قَالَ اللّٰهُ قَدْ صَدَّقْتَ الرُّؤْيَا فِيْ أَنَّكَ تَذْبَحُهُ فَإِنَّكَ قَدْ عَلَجْتَ وَ بَذَلْتَ الْوُسْعَ فِيْهِ وَ فَعَلْتَ مَا رَأَيْتَ فِي الْمَنَامِ فَمَا انْذَبَحَ لِأَنَّكَ مَا رَأَيْتَ أَنَّكَ ذَبَحْتَهُ فَاكْفُفْ عَنْ مُعَالَجَةِ الذِّبْحِ بِأَزْيَدَ مِنْ هٰذَا ‘‘} ’’اللہ تعالیٰ نے فرمایا، تو نے اپنا خواب سچا کر دیا کہ تو اسے ذبح کر رہا ہے، کیونکہ تو نے کوشش کی اور اپنی پوری طاقت اس میں صرف کی اور جو کچھ خواب میں دیکھا تھا وہ کیا، مگر وہ ذبح نہیں ہوا، کیونکہ تو نے یہ نہیں دیکھا تھا کہ تو نے اسے ذبح کر دیا ہے (بلکہ یہ دیکھا تھا کہ ذبح کر رہے ہو) اس لیے اس سے زیادہ ذبح کی کوشش سے رک جا۔‘‘ بقاعی کے علاوہ اور کئی مفسرین نے یہی توجیہ فرمائی ہے کہ خواب {’’ اَنِّيْۤ اَذْبَحُكَ ‘‘} تھا، {’’أَنِّيْ ذَبَحْتُكَ‘‘} نہیں تھا اور ابراہیم علیہ السلام نے جو کچھ کیا اس کے ساتھ وہ خواب سچا ہو گیا۔ ¤ ➋ { اِنَّا كَذٰلِكَ نَجْزِي الْمُحْسِنِيْنَ :} یعنی ہمارا دستور ہے کہ ہم نیکو کاروں کو ایسے مشکل حکم کر کے آزماتے ہیں، پھر انھیں ثابت قدم رکھتے ہیں۔ جب وہ اس آزمائش میں پورے اترتے ہیں تو ان کے درجات بلند کرتے ہیں اور جس آزمائش میں ہم انھیں ڈالتے ہیں اس سے نکلوا بھی دیتے ہیں، جیسے ابراہیم علیہ السلام کو آگ کی آزمائش میں ڈالا اور وہاں سے سلامت نکال بھی لائے اور ان کا درجہ بلند کر دیا۔ اسی طرح بیٹے کی قربانی کی آزمائش میں بیٹے کو بچا لیا اور درجات بھی بلند کر دیے۔"
    },
    {
      "ayah": 106,
      "tafsir": "(آیت 106) { اِنَّ هٰذَا لَهُوَ الْبَلٰٓؤُا الْمُبِيْنُ :} یعنی بوڑھے باپ کو اکلوتا بیٹا ذبح کرنے کا حکم، جو کام کاج میں اس کا مددگار بننے کی عمر کو پہنچ چکا ہے، یقینا یہ باپ بیٹے دونوں کے لیے کھلی آزمائش اور بہت سخت امتحان ہے۔"
    },
    {
      "ayah": 107,
      "tafsir": "(آیت 107) {وَ فَدَيْنٰهُ بِذِبْحٍ عَظِيْمٍ : ’’ذِبْحٌ‘‘} (ذال کے کسرہ کے ساتھ) بمعنی {’’مَذْبُوْحٌ‘‘} یعنی ہم نے اسماعیل علیہ السلام کے فدیے اور بدلے میں ایک عظیم ذبیحہ دیا۔ یہ ایک مینڈھا تھا جو ابراہیم علیہ السلام نے اللہ کے حکم سے قربان کر دیا۔ اسے عظیم اس لیے فرمایا کہ وہ اسماعیل علیہ السلام جیسے عظیم شخص کا فدیہ تھا اور اس لیے کہ اس کی قربانی عظیم عبادت تھی، جو قیامت تک کے مسلمانوں کے لیے سنت قرار پائی۔ تفسیری روایات میں اس مینڈھے کا جنت سے آنے کا ذکر ہے اور یہ بھی کہ یہ وہی مینڈھا تھا جو آدم علیہ السلام کے بیٹے نے بطور قربانی دیا تھا۔ وہ جنت میں پلتا رہا اور اس موقع پر ابراہیم علیہ السلام کے لیے اتارا گیا۔ بعض نے کہا کہ یہ ایک پہاڑی بکرا تھا جو پہاڑ سے اتارا گیا تھا۔ مگر یہ تمام روایات اسرائیلی ہیں، رسول اللہ صلی اللہ علیہ وسلم سے ایک بھی ثابت نہیں۔ ہاں ! یہ ثابت ہے کہ وہ سینگوں والا مینڈھا تھا، جیسا کہ مسند احمد میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے (کعبہ کے چابی بردار) عثمان بن طلحہ رضی اللہ عنہ کو بلایا اور فرمایا : [ إِنِّيْ كُنْتُ رَأَيْتُ قَرْنَيِ الْكَبْشِ حِيْنَ دَخَلْتُ الْبَيْتَ، فَنَسِيْتُ أَنْ آمُرَكَ أَنْ تُخَمِّرَهُمَا، فَخَمِّرْهُمَا فَإِنَّهُ لاَ يَنْبَغِيْ أَنْ يَكُوْنَ فِي الْبَيْتِ شَيْءٌ يَشْغَلُ الْمُصَلِّيَ، قَالَ سُفْيَانُ لَمْ تَزَلْ قَرْنَا الْكَبْشِ فِي الْبَيْتِ حَتَّي احْتَرَقَ الْبَيْتُ فَاحْتتَرَقَا ] [ مسند أحمد : 68/4، ح : ۱۶۶۳۷۔ مسند احمد کے محققین نے اس کی سند کو صحیح کہا ہے ] ’’میں جب بیت اللہ میں داخل ہوا تو میں نے اس مینڈھے کے سینگ دیکھے تھے، تو میں تمھیں ان کو ڈھانپنے کا حکم دینا بھول گیا۔ سو انھیں ڈھانپ دو، کیونکہ یہ مناسب نہیں کہ بیت اللہ میں کوئی ایسی چیز ہو جو نمازی کو مشغول کرے۔‘‘ سفیان نے فرمایا : ’’وہ سینگ بیت اللہ میں رہے، حتیٰ کہ بیت اللہ کو آگ لگ گئی تو وہ بھی جل گئے۔‘‘"
    },
    {
      "ayah": 108,
      "tafsir": "(آیت 108تا111) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ … :} ان آیات کی تفسیر کے لیے دیکھیے اسی سورت کی آیات (۷۸ تا ۸۱)۔"
    },
    {
      "ayah": 109,
      "tafsir": "(آیت 108تا111) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ … :} ان آیات کی تفسیر کے لیے دیکھیے اسی سورت کی آیات (۷۸ تا ۸۱)۔"
    },
    {
      "ayah": 110,
      "tafsir": "(آیت 108تا111) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ … :} ان آیات کی تفسیر کے لیے دیکھیے اسی سورت کی آیات (۷۸ تا ۸۱)۔"
    },
    {
      "ayah": 111,
      "tafsir": "(آیت 108تا111) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ … :} ان آیات کی تفسیر کے لیے دیکھیے اسی سورت کی آیات (۷۸ تا ۸۱)۔"
    },
    {
      "ayah": 112,
      "tafsir": "(آیت 112) {وَ بَشَّرْنٰهُ بِاِسْحٰقَ نَبِيًّا مِّنَ الصّٰلِحِيْنَ :} اہلِ کتاب کا کہنا ہے کہ ذبح کا یہ واقعہ اسماعیل علیہ السلام کے ساتھ نہیں بلکہ اسحاق علیہ السلام کے ساتھ پیش آیا۔ بعض مسلم مفسرین نے بھی یہی بات کہی ہے، مگر یہ درست نہیں، کیونکہ یہاں اللہ تعالیٰ نے ابراہیم علیہ السلام کی دعا سے ملنے والے بیٹے کو ذبح کرنے کے حکم کے ساتھ آزمائش کے بعد اسحاق علیہ السلام کی خوش خبری کا ذکر فرمایا اور اس بات پر مسلمانوں کا اور اہلِ کتاب کا اتفاق ہے کہ اسماعیل علیہ السلام پہلے پیدا ہوئے تھے۔ ایک اور نہایت مضبوط دلیل اس کی یہ ہے کہ جب فرشتوں نے ابراہیم علیہ السلام کی بیوی کو اسحاق علیہ السلام کی خوش خبری دی تو اس کے ساتھ ہی فرمایا : «وَ مِنْ وَّرَآءِ اِسْحٰقَ يَعْقُوْبَ » [ ھود : ۷۱ ] کہ اسحاق( علیہ السلام ) کے بعد ان کے بیٹے یعقوب( علیہ السلام ) ہوں گے، ظاہر ہے یہ وہ بیٹا ہو ہی نہیں سکتا جسے دوڑ دھوپ کی عمر کو پہنچتے ہی ذبح کا حکم دیا جانے والا تھا، کیونکہ ان کے متعلق تو اتنی عمر تک زندہ رہنے کی بشارت تھی کہ پورے جوان ہو کر ان کی شادی ہو گی، پھر اولاد ہو گی۔ اس کے علاوہ تورات میں اکلوتے بیٹے کی قربانی کا ذکر ہے (دیکھیے پیدائش :۲۲۔۲) اور اس بات پر سب کا اتفاق ہے کہ اکلوتے بیٹے اسماعیل علیہ السلام تھے۔ اس کے باوجود اہلِ کتاب نے تحریف کر کے اسحاق علیہ السلام کو ذبیح لکھ دیا۔ پھر اس مینڈھے کے سینگوں کا کعبہ میں مدت تک رہنا بھی اس بات کی دلیل ہے کہ یہ واقعہ مکہ میں ہوا۔ اگر یہ واقعہ اسحاق علیہ السلام سے متعلق ہوتا تو شام میں ہوتا، مکہ سے اس کا تعلق نہ ہوتا۔"
    },
    {
      "ayah": 113,
      "tafsir": "(آیت 113) ➊ { وَ بٰرَكْنَا عَلَيْهِ وَ عَلٰۤى اِسْحٰقَ : ’’ عَلَيْهِ ‘‘} سے مراد ابراہیم اور اسماعیل علیھما السلام میں سے کوئی بھی ہو سکتا ہے۔ برکت میں یہ چیز بھی شامل ہے کہ انھیں بہت اولاد عطا فرمائی اور ان کی اولاد میں نبوت کا سلسلہ رکھا۔ شاہ عبدالقادر لکھتے ہیں : ’’دونوں‘‘ کہا دونوں بیٹوں کو، دونوں سے بہت اولاد پھیلی، اسحاق علیہ السلام کی اولاد میں نبی گزرے بنی اسرائیل کے اور اسماعیل علیہ السلام کی اولاد ہیں عرب، جن میں ہمارے پیغمبر صلی اللہ علیہ وسلم ہوئے۔‘‘ (موضح) ¤ ➋ { وَ مِنْ ذُرِّيَّتِهِمَا مُحْسِنٌ وَّ ظَالِمٌ … :} یعنی ان کی اولاد میں سے نیک بھی ہوں گے، بد بھی، عدل کرنے والے بھی ہوں گے اور اپنی جان پر صاف ظلم کرنے والے بھی۔ شیخ عبدالرحمان السعدی نے فرمایا : ’’شاید یہ کہنے کا مقصد یہ وہم دور کرنا ہو جو بعض لوگوں کو {’’ وَ بٰرَكْنَا عَلَيْهِ وَ عَلٰۤى اِسْحٰقَ ‘‘} سے پیدا ہو سکتا تھا کہ اس کا تقاضا ہے کہ ان کی اولاد میں بھی وہ برکت جاری رہے اور برکت مکمل تب ہوتی جب ساری اولاد نیک ہو، تو اللہ تعالیٰ نے بتایا کہ اولاد میں سے نیک و بد ہر قسم کے لوگ ہوں گے۔‘‘ یعنی محض خاندان اور باپ دادا کے ساتھ نسبت اللہ تعالیٰ کے ہاں کچھ حیثیت نہیں رکھتی۔ اس کی مثال امتِ مسلمہ میں بعض لوگوں کا اہلِ بیت کے متعلق یہ خیال ہے کہ سید بادشاہ جو کچھ بھی کرتے رہیں نبی صلی اللہ علیہ وسلم اور حسن و حسین رضی اللہ عنھما کی اولاد ہونے کی وجہ سے بخشے بخشائے ہیں، جب کہ یہ خیال باطل ہے۔ کیونکہ اگر نبی کی اولاد ہونا ہی بخشش کے لیے کافی ہو تو سارے انسان ہی آدم و نوح علیھما السلام جیسے جلیل القدر پیغمبروں کی اولاد ہیں، اس لیے سب ہی بخشے ہوئے ہونے چاہییں۔"
    },
    {
      "ayah": 114,
      "tafsir": "(آیت 114) {وَ لَقَدْ مَنَنَّا عَلٰى مُوْسٰى وَ هٰرُوْنَ :} یعنی انھیں نبوت عطا کی اور دوسرے بے شمار احسانات فرمائے، جن میں سے بعض احسانات کا ذکر آگے فرمایا۔"
    },
    {
      "ayah": 115,
      "tafsir": "(آیت 115) {وَ نَجَّيْنٰهُمَا وَ قَوْمَهُمَا مِنَ الْكَرْبِ الْعَظِيْمِ :} بہت بڑی مصیبت سے مراد فرعون کی غلامی، لڑکوں کا قتل اور عورتوں کا باقی رکھنا ہے۔ علاوہ ازیں سمندر میں غرق ہونے سے نجات بھی کرب عظیم سے نجات ہے۔"
    },
    {
      "ayah": 116,
      "tafsir": "(آیت 116) {وَ نَصَرْنٰهُمْ فَكَانُوْا هُمُ الْغٰلِبِيْنَ : ’’هُمْ‘‘} ضمیر جمع لانے کی وجہ یہ ہے کہ فرعون سے نجات اور اس پر اور اس کی آل یعنی قبطیوں پر فتح و نصرت صرف موسیٰ اور ہارون علیھما السلام کو نہیں بلکہ تمام بنی اسرائیل کو حاصل ہوئی۔"
    },
    {
      "ayah": 117,
      "tafsir": "(آیت 117) {وَ اٰتَيْنٰهُمَا الْكِتٰبَ الْمُسْتَبِيْنَ: ’’اَلْمُبِيْنُ‘‘} باب افعال سے اسم فاعل ہے، معنی ہے ’’واضح‘‘ اور {’’ الْمُسْتَبِيْنَ ‘‘} باب استفعال سے اسم فاعل ہے، اس میں حروف زیادہ ہونے کی وجہ سے معنی میں مبالغہ ہے، اس لیے ترجمہ ’’نہایت واضح‘‘ کیا گیا ہے، مراد تورات ہے۔"
    },
    {
      "ayah": 118,
      "tafsir": "(آیت 118) { وَ هَدَيْنٰهُمَا الصِّرَاطَ الْمُسْتَقِيْمَ :} صراط مستقیم کی ہدایت بہت بڑا احسان ہے، کیونکہ اسی پر نجاتِ اُخروی کا دارو مدار ہے۔"
    },
    {
      "ayah": 119,
      "tafsir": "(آیت 119تا122) {وَ تَرَكْنَا عَلَيْهِمَا فِي الْاٰخِرِيْنَ …:} ان آیات کی تفسیر کے لیے دیکھیے اسی سورت کی آیات (۷۸ تا ۸۱)۔"
    },
    {
      "ayah": 120,
      "tafsir": "(آیت 119تا122) {وَ تَرَكْنَا عَلَيْهِمَا فِي الْاٰخِرِيْنَ …:} ان آیات کی تفسیر کے لیے دیکھیے اسی سورت کی آیات (۷۸ تا ۸۱)۔"
    },
    {
      "ayah": 121,
      "tafsir": "(آیت 119تا122) {وَ تَرَكْنَا عَلَيْهِمَا فِي الْاٰخِرِيْنَ …:} ان آیات کی تفسیر کے لیے دیکھیے اسی سورت کی آیات (۷۸ تا ۸۱)۔"
    },
    {
      "ayah": 122,
      "tafsir": "(آیت 119تا122) {وَ تَرَكْنَا عَلَيْهِمَا فِي الْاٰخِرِيْنَ …:} ان آیات کی تفسیر کے لیے دیکھیے اسی سورت کی آیات (۷۸ تا ۸۱)۔"
    },
    {
      "ayah": 123,
      "tafsir": "(آیت 124،123) {وَ اِنَّ اِلْيَاسَ لَمِنَ الْمُرْسَلِيْنَ …: ’’ اَلَا تَتَّقُوْنَ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ شعراء کی آیت (۱۰۶)۔"
    },
    {
      "ayah": 124,
      "tafsir": "(آیت 124،123) {وَ اِنَّ اِلْيَاسَ لَمِنَ الْمُرْسَلِيْنَ …: ’’ اَلَا تَتَّقُوْنَ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ شعراء کی آیت (۱۰۶)۔"
    },
    {
      "ayah": 125,
      "tafsir": "(آیت 125) ➊ { اَتَدْعُوْنَ بَعْلًا :} قرآن کے متعدد مقامات پر لفظ {’’ بَعْلًا ‘‘} شوہر کے معنی میں آیا ہے۔ دیکھیے سورۂ بقرہ (۲۲۸) اور نساء (۱۲۷) اس کا معنی مالک اور آقا بھی ہے۔ مشرک اقوام اس لفظ کو رب یا معبود کے معنی میں استعمال کرتی ہیں، اس لیے الیاس علیہ السلام کی قوم نے اپنے سب سے بڑے بت کا نام ’’بعل‘‘ رکھا ہوا تھا۔ الیاس علیہ السلام نے انھیں سمجھایا کہ کیا تم ’’بعل‘‘ نامی بت کو پوجتے ہو؟ ¤ ➋ { وَ تَذَرُوْنَ اَحْسَنَ الْخَالِقِيْنَ :} اور بنانے والوں میں سب سے بہتر یعنی اللہ تعالیٰ کو چھوڑ دیتے ہو۔ یہاں سوال پیدا ہوتا ہے کہ کیا اور بھی کوئی پیدا کرنے والا ہے کہ اللہ تعالیٰ کو سب پیدا کرنے والوں سے بہتر فرمایا؟ جواب اس کا یہ ہے کہ بعض اوقات اللہ تعالیٰ کی پیدا کردہ اشیاء کو جوڑ کر کوئی چیز بنانے پر بھی {’’خلق‘‘} کا لفظ بولا جاتا ہے، مثلاً انسان لوہے وغیرہ سے مشینیں اور موٹریں وغیرہ بنا لیتا ہے، مگر ان سب میں وہ اللہ کے بنائے ہوئے مادے کا محتاج ہے۔ اس لیے اس کی بنائی ہوئی ہر چیز بھی اللہ ہی کی (خلق) پیدا کردہ ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «وَ اللّٰهُ خَلَقَكُمْ وَ مَا تَعْمَلُوْنَ » [ الصافات : ۹۶ ] ’’حالانکہ اللہ ہی نے تمھیں پیدا کیا اور اسے بھی جو تم کرتے ہو۔‘‘ البتہ ابتدا میں کسی چیز کو پیدا کرنا یا چیزیں جوڑ کر ان میں روح ڈال دینا صرف اس پاک پروردگار کا کام ہے۔ (دیکھیے حج : ۷۳) اس لیے اسے {’’ اَحْسَنَ الْخَالِقِيْنَ ‘‘} فرمایا۔"
    },
    {
      "ayah": 126,
      "tafsir": "(آیت 126) {اللّٰهَ رَبَّكُمْ وَ رَبَّ اٰبَآىِٕكُمُ الْاَوَّلِيْنَ … :} الیاس علیہ السلام نے ان کی توجہ اس طرف مبذول کروائی کہ یہ بعل دیوتا کابت تو تم نے خود گھڑا ہے، یہ بے جان بت ہے، جس کے خالق تم خود ہو۔ اس کی حفاظت بھی تم ہی کرتے ہو، پھر اس کی عبادت بھی کرنے لگتے ہو۔ تمھیں تو لازم تھا کہ اس کی عبادت کرتے جس نے تمھیں بنایا ہے، پھر تمھیں صرف بنایا ہی نہیں بلکہ تمھاری پرورش بھی کرتا ہے، تمھارے آبا و اجداد کا بھی وہی خالق و رازق ہے۔ ایسے بہترین خالق کو چھوڑ کر اپنے گھڑے ہوئے بے جان بت کے سامنے سربسجود ہوتے ہوئے تمھیں شرم نہیں آتی!؟ (کیلانی)"
    },
    {
      "ayah": 127,
      "tafsir": "(آیت 127) {فَكَذَّبُوْهُ فَاِنَّهُمْ لَمُحْضَرُوْنَ :} یعنی وہ جھٹلانے کی پاداش میں جہنم میں حاضر کیے جانے والے ہیں، جہاں انھیں جھٹلانے کی سزا مل کر رہے گی۔"
    },
    {
      "ayah": 128,
      "tafsir": "(آیت 128) { اِلَّا عِبَادَ اللّٰهِ الْمُخْلَصِيْنَ :} یعنی الیاس علیہ السلام کی ساری قوم نے انھیں جھٹلایا، مگر اللہ کے چنے ہوئے بندوں نے نہیں جھٹلایا، بلکہ وہ ان پر ایمان لے آئے، اس لیے وہ عذاب سے محفوظ رہے اور رہیں گے۔"
    },
    {
      "ayah": 129,
      "tafsir": "(آیت 129تا132) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ …:} ان آیات کی تفسیر پیچھے آیات (۷۸ تا ۸۱) کے تحت گزر چکی ہے۔ {’’ اِلْ يَاسِيْنَ ‘‘} الیاس علیہ السلام ہی کا دوسرا نام ہے، جیسے ایک ہی پہاڑ کو قرآن میں ’’طور سینا‘‘ بھی کہا گیا ہے اور ’’طور سينين‘‘ بھی۔"
    },
    {
      "ayah": 130,
      "tafsir": "(آیت 129تا132) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ …:} ان آیات کی تفسیر پیچھے آیات (۷۸ تا ۸۱) کے تحت گزر چکی ہے۔ {’’ اِلْ يَاسِيْنَ ‘‘} الیاس علیہ السلام ہی کا دوسرا نام ہے، جیسے ایک ہی پہاڑ کو قرآن میں ’’طور سینا‘‘ بھی کہا گیا ہے اور ’’طور سينين‘‘ بھی۔"
    },
    {
      "ayah": 131,
      "tafsir": "(آیت 129تا132) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ …:} ان آیات کی تفسیر پیچھے آیات (۷۸ تا ۸۱) کے تحت گزر چکی ہے۔ {’’ اِلْ يَاسِيْنَ ‘‘} الیاس علیہ السلام ہی کا دوسرا نام ہے، جیسے ایک ہی پہاڑ کو قرآن میں ’’طور سینا‘‘ بھی کہا گیا ہے اور ’’طور سينين‘‘ بھی۔"
    },
    {
      "ayah": 132,
      "tafsir": "(آیت 129تا132) {وَ تَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ …:} ان آیات کی تفسیر پیچھے آیات (۷۸ تا ۸۱) کے تحت گزر چکی ہے۔ {’’ اِلْ يَاسِيْنَ ‘‘} الیاس علیہ السلام ہی کا دوسرا نام ہے، جیسے ایک ہی پہاڑ کو قرآن میں ’’طور سینا‘‘ بھی کہا گیا ہے اور ’’طور سينين‘‘ بھی۔"
    },
    {
      "ayah": 133,
      "tafsir": "(آیت 133تا136) {وَ اِنَّ لُوْطًا لَّمِنَ الْمُرْسَلِيْنَ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ ہود (۷۷ تا ۸۳) اور سورۂ حجر (۵۷ تا ۷۷)۔"
    },
    {
      "ayah": 134,
      "tafsir": "(آیت 133تا136) {وَ اِنَّ لُوْطًا لَّمِنَ الْمُرْسَلِيْنَ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ ہود (۷۷ تا ۸۳) اور سورۂ حجر (۵۷ تا ۷۷)۔"
    },
    {
      "ayah": 135,
      "tafsir": "(آیت 133تا136) {وَ اِنَّ لُوْطًا لَّمِنَ الْمُرْسَلِيْنَ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ ہود (۷۷ تا ۸۳) اور سورۂ حجر (۵۷ تا ۷۷)۔"
    },
    {
      "ayah": 136,
      "tafsir": "(آیت 133تا136) {وَ اِنَّ لُوْطًا لَّمِنَ الْمُرْسَلِيْنَ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ ہود (۷۷ تا ۸۳) اور سورۂ حجر (۵۷ تا ۷۷)۔"
    },
    {
      "ayah": 137,
      "tafsir": "(آیت 138،137) {وَ اِنَّكُمْ لَتَمُرُّوْنَ عَلَيْهِمْ مُّصْبِحِيْنَ …:} یعنی تم تجارت کے لیے شام و فلسطین کی طرف جاتے اور آتے ہوئے دن رات اور صبح و شام قوم لوط کی تباہ شدہ بستیوں کے پاس سے گزرتے ہو، تو کیا تم عقل نہیں کرتے اور تمھیں ان کے انجام سے عبرت نہیں ہوتی؟"
    },
    {
      "ayah": 138,
      "tafsir": "(آیت 138،137) {وَ اِنَّكُمْ لَتَمُرُّوْنَ عَلَيْهِمْ مُّصْبِحِيْنَ …:} یعنی تم تجارت کے لیے شام و فلسطین کی طرف جاتے اور آتے ہوئے دن رات اور صبح و شام قوم لوط کی تباہ شدہ بستیوں کے پاس سے گزرتے ہو، تو کیا تم عقل نہیں کرتے اور تمھیں ان کے انجام سے عبرت نہیں ہوتی؟"
    },
    {
      "ayah": 139,
      "tafsir": "(آیت 139) {وَ اِنَّ يُوْنُسَ لَمِنَ الْمُرْسَلِيْنَ:} ان کا نام حدیث میں یونس بن مَتّٰی آیا ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ يَنْبَغِيْ لِعَبْدٍ أَنْ يَّقُوْلَ أَنَا خَيْرٌ مِنْ يُوْنُسَ بْنِ مَتّٰی] [بخاري، أحادیث الأنبیاء، باب قول اللہ تعالٰی : «و إن یونس لمن المرسلین » : ۳۴۱۶ ] ’’کسی بندے کے لائق نہیں کہ وہ کہے کہ میں یونس بن مَتّٰی سے بہتر ہوں۔‘‘"
    },
    {
      "ayah": 140,
      "tafsir": "(آیت 140) ➊ { اِذْ اَبَقَ : ’’أَبَقَ } (ض، ن، س) {إِبَاقًا وَ أَبْقًا وَ أَبَقًا، الْعَبْدُ‘‘ } غلام کے اپنے مالک کے پاس سے بھاگ جانے کو کہتے ہیں۔ یونس علیہ السلام چونکہ اپنے مالک (اللہ تعالیٰ) کے حکم کا انتظار کیے بغیر اپنی قوم کو چھوڑ کر چلے گئے تھے، اس لیے ان کے جانے کے لیے {’’ اَبَقَ ‘‘} کا لفظ استعمال کیا گیا۔ یونس علیہ السلام اپنی قوم کو کب اور کیوں چھوڑ کر چلے گئے تھے؟ اس کے لیے دیکھیے سورۂ یونس (۹۸) اور سورۂ انبیاء (۸۷)۔ ¤ ➋ { اِلَى الْفُلْكِ الْمَشْحُوْنِ :} بھری ہوئی کشتی سے مراد سامان اور مسافروں سے بھری ہوئی کشتی ہے۔"
    },
    {
      "ayah": 141,
      "tafsir": "(آیت 141) ➊ { فَسَاهَمَ فَكَانَ مِنَ الْمُدْحَضِيْنَ:’’سَاهَمَ‘‘} (مفاعلہ) قرعہ میں حصہ لینا۔ {{’’ الْمُدْحَضِيْنَ ‘‘ ’’أَدْحَضَ يُدْحِضُ‘‘} (افعال) میں سے اسم مفعول ہے، پھسلانا، باطل کرنا۔ ان آیات سے واقعہ کی یہ صورت سمجھ میں آتی ہے کہ یونس علیہ السلام جس کشتی میں سوار ہوئے وہ اپنی گنجائش سے زیادہ بھرئی ہوئی تھی۔ دوران سفر طوفان یا کسی خطرے کی صورت میں زائد بوجھ کم کرنے کے لیے پہلے سامان سمندر میں پھینکا جاتا ہے، اس کے بعد بھی اگر خطرہ باقی رہے تو کچھ آدمیوں کو پھینک دیا جاتا ہے، تاکہ سب لوگ غرق نہ ہوں۔ یونس علیہ السلام جس کشتی میں سوار ہوئے اس کے ساتھ بھی ایسا ہی معاملہ پیش آیا۔ چنانچہ فیصلہ ہوا کہ قرعہ ڈالا جائے اور جن لوگوں کا نام پھینکنے کے لیے نکلے، انھیں سمندر میں پھینک دیا جائے۔ قرعہ ڈالا گیا تو یونس علیہ السلام کا نام بھی ان لوگوں میں نکلا جو سمندر میں پھینکے جانے والے تھے۔ {’’ فَكَانَ مِنَ الْمُدْحَضِيْنَ ‘‘} (تو وہ قرعہ ہارنے والوں یا پھسلائے گئے آدمیوں میں سے ہو گیا) کے الفاظ سے ظاہر ہے کہ قرعہ میں یونس علیہ السلام کے ساتھ اور لوگوں کا نام بھی نکلا، اللہ بہتر جانتا ہے کہ وہ کتنے تھے۔ مختصر یہ کہ سب کو اٹھا کر سمندر میں پھینک دیا گیا۔ ¤ ➋ اس مقام پر بعض تفاسیر میں لکھا ہے : ’’جب یونس علیہ السلام کشتی میں سوار ہو گئے اور کشتی گہرے پانی میں پہنچی تو آگے بڑھنے کے بجائے چکر کھانے لگی۔ کشتی والوں نے کشتی میں سوار لوگوں سے کہا کہ ایسا معاملہ ہمیں اس وقت پیش آتا ہے جب کوئی بھاگا ہوا غلام کشتی میں سوار ہو۔ انھوں نے قرعہ ڈالا کہ جس کا نام قرعہ میں نکلے اسے سمندر میں پھینک دیا جائے۔ تین بار قرعہ ڈالا گیا، لیکن وہ ہر بار یونس علیہ السلام ہی کے نام پر نکلا۔ بار بار قرعہ اس لیے ڈالا گیا کہ وہ لوگ یونس علیہ السلام کی نیکی دیکھ کر انھیں سمندر میں پھینکنا نہیں چاہتے تھے۔ جب تین بار قرعہ انھی کے نام پر نکلا تو وہ خود ہی یہ کہہ کر سمندر میں کودنے کے لیے تیار ہو گئے کہ وہ بھاگا ہوا غلام میں ہوں۔‘‘ اس حکایت میں وہ باتیں ہیں جو قرآن و حدیث میں نہیں ہیں اور نہ ہی کسی معتبر ذریعے سے ثابت ہیں، اس لیے ان کا اعتبار مشکل ہے۔"
    },
    {
      "ayah": 142,
      "tafsir": "(آیت 142) {فَالْتَقَمَهُ الْحُوْتُ وَ هُوَ مُلِيْمٌ: ’’ الْحُوْتُ ‘‘ } مچھلی۔ اکثر بڑی مچھلی کو {’’حُوت‘‘} کہا جاتا ہے۔ {’’ مُلِيْمٌ ‘‘ ’’أَلَامَ يُلِيْمُ‘‘} (افعال) ملامت والا کام کرنا، ملامت کا مستحق ہونا۔ {’’ مُلِيْمٌ ‘‘} ملامت کا مستحق، خواہ اسے ملامت کی جائے یا نہ کی جائے۔ جب یونس علیہ السلام کو سمندر میں پھینکا گیا تو اللہ کے حکم سے ایک بڑی مچھلی نے انھیں سالم نگل لیا۔ مستحق ملامت اس لیے کہ وہ اللہ تعالیٰ کی اجازت کے بغیر قوم سے نکل آئے تھے۔"
    },
    {
      "ayah": 143,
      "tafsir": "(آیت 144،143) ➊ {فَلَوْ لَاۤ اَنَّهٗ كَانَ مِنَ الْمُسَبِّحِيْنَ… :} ’’اگر یہ بات نہ ہوتی کہ وہ تسبیح کرنے والوں میں سے تھا‘‘ میں دو چیزیں شامل ہیں، ایک تو یہ کہ وہ اس سے پہلے بھی ہمیشہ اللہ تعالیٰ کی تسبیح اور اس کا ذکر کرنے والے تھے اور دوسری یہ کہ اس وقت بھی انھوں نے اللہ تعالیٰ کی تسبیح کرتے ہوئے کہا : « لَاۤ اِلٰهَ اِلَّاۤ اَنْتَ سُبسُبْحٰنَكَ اِنِّيْ كُنْتُ مِنَ الظّٰلِمِيْنَ»  [ الأنبیاء : ۸۷ ] ’’تیرے سوا کوئی معبود نہیں، تو پاک ہے، یقینا میں ظلم کرنے والوں سے ہو گیا ہوں۔‘‘ اگر وہ تسبیح کرنے والوں میں سے نہ ہوتے تو وہیں فوت ہو جاتے اور مچھلی کا پیٹ ہی ان کی قبر بن جاتا۔ ¤ ➋ اس سے معلوم ہوا کہ جس طرح اللہ تعالیٰ مصیبت کے وقت پکارنے پر مدد فرماتا ہے، خوش حالی میں اپنی تسبیح اور ذکر کرنے والوں کا مصیبت میں زیادہ خیال رکھتا ہے۔ عبداللہ بن عباس رضی اللہ عنھما سے ایک لمبی حدیث میں مروی ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پیچھے سواری پر سوار تھا، آپ صلی اللہ علیہ وسلم نے فرمایا : ’’لڑکے! میں تمھیں چند باتیں نہ سکھاؤں جن کے ساتھ تمھیں اللہ تعالیٰ نفع دے گا؟‘‘ میں نے کہا : ’’کیوں نہیں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ اِحْفَظِ اللّٰهَ يَحْفَظْكَ، اِحْفَظِ اللّٰهَ تَجِدْهُ أَمَامَكَ، تَعَرَّفْ إِلَيْهِ فِي الرَّخَاءِ، يَعْرِفْكَ فِي الشِّدَّةِ ] [مسند أحمد : 307/1، ح : ۲۸۰۷، قال المحقق حدیث صحیح ] ’’اللہ کا دھیان رکھ، وہ تیرا دھیان رکھے گا۔ اللہ کا دھیان رکھ تو اسے اپنے سامنے پائے گا۔ خوش حالی میں اس سے جان پہچان رکھ، وہ سختی میں تیری پہچان رکھے گا۔‘‘ جو خوش حالی میں ایمان نہ لائے اور اللہ تعالیٰ کو یاد نہ رکھے سختی میں اس کا ایمان اور اس کی فریاد کام نہیں دیتی، جیساکہ فرعون نے غرق ہوتے وقت کہا : « اٰمَنْتُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا الَّذِيْۤ اٰمَنَتْ بِهٖ بَنُوْۤا اِسْرَآءِيْلَ» [ یونس : ۹۰ ] ’’میں ایمان لایا کہ حق یہ ہے کہ اس کے سوا کوئی معبود نہیں جس پر بنی اسرائیل ایمان لائے ہیں۔‘‘ تو اسے کہا گیا : «آٰلْـٰٔنَ وَ قَدْ عَصَيْتَ قَبْلُ وَ كُنْتَ مِنَ الْمُفْسِدِيْنَ » [ یونس : ۹۱ ] ’’کیا اب؟ حالانکہ بے شک تو نے اس سے پہلے نافرمانی کی اور تو فساد کرنے والوں سے تھا۔‘‘"
    },
    {
      "ayah": 144,
      "tafsir": "(آیت 144،143) ➊ {فَلَوْ لَاۤ اَنَّهٗ كَانَ مِنَ الْمُسَبِّحِيْنَ… :} ’’اگر یہ بات نہ ہوتی کہ وہ تسبیح کرنے والوں میں سے تھا‘‘ میں دو چیزیں شامل ہیں، ایک تو یہ کہ وہ اس سے پہلے بھی ہمیشہ اللہ تعالیٰ کی تسبیح اور اس کا ذکر کرنے والے تھے اور دوسری یہ کہ اس وقت بھی انھوں نے اللہ تعالیٰ کی تسبیح کرتے ہوئے کہا : « لَاۤ اِلٰهَ اِلَّاۤ اَنْتَ سُبسُبْحٰنَكَ اِنِّيْ كُنْتُ مِنَ الظّٰلِمِيْنَ»  [ الأنبیاء : ۸۷ ] ’’تیرے سوا کوئی معبود نہیں، تو پاک ہے، یقینا میں ظلم کرنے والوں سے ہو گیا ہوں۔‘‘ اگر وہ تسبیح کرنے والوں میں سے نہ ہوتے تو وہیں فوت ہو جاتے اور مچھلی کا پیٹ ہی ان کی قبر بن جاتا۔ ¤ ➋ اس سے معلوم ہوا کہ جس طرح اللہ تعالیٰ مصیبت کے وقت پکارنے پر مدد فرماتا ہے، خوش حالی میں اپنی تسبیح اور ذکر کرنے والوں کا مصیبت میں زیادہ خیال رکھتا ہے۔ عبداللہ بن عباس رضی اللہ عنھما سے ایک لمبی حدیث میں مروی ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پیچھے سواری پر سوار تھا، آپ صلی اللہ علیہ وسلم نے فرمایا : ’’لڑکے! میں تمھیں چند باتیں نہ سکھاؤں جن کے ساتھ تمھیں اللہ تعالیٰ نفع دے گا؟‘‘ میں نے کہا : ’’کیوں نہیں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ اِحْفَظِ اللّٰهَ يَحْفَظْكَ، اِحْفَظِ اللّٰهَ تَجِدْهُ أَمَامَكَ، تَعَرَّفْ إِلَيْهِ فِي الرَّخَاءِ، يَعْرِفْكَ فِي الشِّدَّةِ ] [مسند أحمد : 307/1، ح : ۲۸۰۷، قال المحقق حدیث صحیح ] ’’اللہ کا دھیان رکھ، وہ تیرا دھیان رکھے گا۔ اللہ کا دھیان رکھ تو اسے اپنے سامنے پائے گا۔ خوش حالی میں اس سے جان پہچان رکھ، وہ سختی میں تیری پہچان رکھے گا۔‘‘ جو خوش حالی میں ایمان نہ لائے اور اللہ تعالیٰ کو یاد نہ رکھے سختی میں اس کا ایمان اور اس کی فریاد کام نہیں دیتی، جیساکہ فرعون نے غرق ہوتے وقت کہا : « اٰمَنْتُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا الَّذِيْۤ اٰمَنَتْ بِهٖ بَنُوْۤا اِسْرَآءِيْلَ» [ یونس : ۹۰ ] ’’میں ایمان لایا کہ حق یہ ہے کہ اس کے سوا کوئی معبود نہیں جس پر بنی اسرائیل ایمان لائے ہیں۔‘‘ تو اسے کہا گیا : «آٰلْـٰٔنَ وَ قَدْ عَصَيْتَ قَبْلُ وَ كُنْتَ مِنَ الْمُفْسِدِيْنَ » [ یونس : ۹۱ ] ’’کیا اب؟ حالانکہ بے شک تو نے اس سے پہلے نافرمانی کی اور تو فساد کرنے والوں سے تھا۔‘‘"
    },
    {
      "ayah": 145,
      "tafsir": "(آیت 145) { فَنَبَذْنٰهُ بِالْعَرَآءِ وَ هُوَ سَقِيْمٌ: ’’اَلْعَرَآءُ‘‘} چٹیل میدان، جس میں کوئی درخت اور سائے کی چیز نہ ہو۔ مچھلی نے اللہ تعالیٰ کے حکم سے انھیں سمندر سے باہر ایک چٹیل میدان میں اسی طرح صحیح سالم اگل دیا جس طرح نگلا تھا، مگر مچھلی کے پیٹ میں رہنے کی وجہ سے ان کی جلد نہایت نرم و نازک ہو گئی تھی اور وہ اس وقت سخت کمزور اور بیمار تھے۔ البتہ اللہ تعالیٰ کے خاص احسان سے توبہ کی قبولیت کی وجہ سے ان کا مرتبہ پہلے سے بلند ہو چکا تھا۔ دیکھیے سورۂ قلم (۴۹، ۵۰) یونس علیہ السلام مچھلی کے پیٹ میں کتنے دن رہے، تھوڑی دیر رہے یا تین دن یا سات دن یا چالیس دن، جیسا کہ مفسرین کہتے ہیں، اللہ تعالیٰ نے یہ بات بیان نہیں فرمائی، کیونکہ جتنی مدت بھی رہے ہوں، تھوڑی ہو یا زیادہ، مچھلی کے پیٹ میں ان کا زندہ رہ جانا اور صحیح سلامت نکل آنا ہی بہت بڑا معجزہ ہے۔"
    },
    {
      "ayah": 146,
      "tafsir": "(آیت 146) { وَ اَنْۢبَتْنَا عَلَيْهِ شَجَرَةً مِّنْ يَّقْطِيْنٍ : ’’قَطَنَ بِالْمَكَانِ‘‘} (ن) کسی جگہ اقامت اختیار کرنے کو کہتے ہیں۔ {’’ يَقْطِيْنٍ ‘‘} اس میں سے {’’يَفْعِيْلٌ‘‘} کے وزن پر ہے۔ یہ لفظ ہر ایسے پودے پر بولا جاتا ہے جس کا تنا نہ ہو، مثلاً کدو، ککڑی، تربوز اور خربوزہ وغیرہ۔ زیادہ تر پیٹھے کدو کو {’’ يَقْطِيْنٍ ‘‘} کہتے ہیں، کیونکہ وہ زمین پر پڑا رہتا ہے۔ {’’ عَلَيْهِ ‘‘ } کے لفظ سے معلوم ہوتا ہے کہ اللہ تعالیٰ نے اس بیل کا تنا معجزانہ طور پر اونچا کر دیا، جس سے یونس علیہ السلام پر سایہ ہو گیا، یا وہ بیل کسی اور بلند چیز پر چڑھ کر انھیں سایہ اور غذا مہیا کرتی رہی۔"
    },
    {
      "ayah": 147,
      "tafsir": "(آیت 147) {وَ اَرْسَلْنٰهُ اِلٰى مِائَةِ اَلْفٍ اَوْ يَزِيْدُوْنَ :} تندرست ہونے کے بعد اللہ تعالیٰ نے انھیں پھر ایک لاکھ یا اس سے زیادہ افراد پر مشتمل آبادی کی طرف پیغام حق پہنچانے کے لیے بھیج دیا۔ اکثر مفسرین کا کہنا ہے کہ یہ وہی آبادی تھی جہاں سے وہ ناراض ہو کر گئے تھے اور جن کی توبہ کی وجہ سے اللہ تعالیٰ نے ان کو عذاب سے محفوظ رکھا تھا۔ یہاں ایک سوال ہے کہ اللہ تعالیٰ نے یہاں جو لفظ {’’ اَوْ ‘‘} استعمال فرمایا ہے کہ ہم نے اسے ایک لاکھ کی طرف بھیجا ’’یا‘‘ وہ زیادہ ہوں گے، یہ لفظ تو شک کے لیے استعمال ہوتا ہے، جب کہ اللہ تعالیٰ کے لیے شک کا سوال ہی پیدا نہیں ہوتا۔ اس کا ایک جواب یہ ہے کہ یہ دیکھنے والوں کے لحاظ سے ہے کہ اگر کوئی انھیں دیکھے تو کہے گا کہ ایک لاکھ ہیں یا اس سے زیادہ ہیں۔ دوسرا جواب یہ ہے کہ یہاں {’’ اَوْ ‘‘} بمعنی {’’بَلْ‘‘} ہے، اور اسی کے مطابق ترجمہ کیا گیا ہے ’’بلکہ وہ زیادہ ہوں گے۔‘‘"
    },
    {
      "ayah": 148,
      "tafsir": "(آیت 148) ➊ { فَاٰمَنُوْا :} شاہ عبدالقادر لکھتے ہیں : ’’وہی قوم جس سے بھاگے تھے، ان پر ایمان لا رہی تھی۔ (وہ انھیں) ڈھونڈتی تھی کہ یہ جا پہنچے، (اس سے) ان کو بڑی خوشی ہوئی۔‘‘ (موضح) ¤ ➋ { فَمَتَّعْنٰهُمْ اِلٰى حِيْنٍ :} یعنی انھیں عذاب سے بیک وقت ہلاک کرنے کے بجائے ہر ایک کو اس کی مقررہ عمر تک فائدہ اٹھانے کا موقع عطا فرمایا۔"
    },
    {
      "ayah": 149,
      "tafsir": "(آیت 149) {فَاسْتَفْتِهِمْ اَلِرَبِّكَ الْبَنَاتُ … :} پچھلی آیات کے ساتھ ان آیات کی مناسبت یہ ہے کہ مشرکین کے بد ترین عقائد میں سے ایک قیامت کا انکار تھا اور ایک شرک تھا، جس کی ایک صورت فرشتوں کو اللہ تعالیٰ کی بیٹیاں قرار دے کر ان کے بت بنا کر ان کی پرستش کرنا تھی۔ قرآن میں متعدد مقامات پر ان کے اس عقیدے کا ذکر کر کے اس کی تردید کی گئی ہے۔ دیکھیے سورۂ نساء (۱۱۷)، نحل (۵۷، ۵۸)، بنی اسرائیل (۴۰)، زخرف (۱۶ تا۱۹) اور نجم (۲۱ تا ۲۷) یہاں سورت کے شروع میں ان کے انکارِ قیامت پر فرمایا : « فَاسْتَفْتِهِمْ اَهُمْ اَشَدُّ خَلْقًا اَمْ مَّنْ خَلَقْنَا اِنَّا خَلَقْنٰهُمْ مِّنْ طِيْنٍ لَّازِببٍ » [ الصافات : ۱۱ ] ’’سو ان سے پوچھ کیا یہ پیدا کرنے کے اعتبار سے زیادہ مشکل ہیں، یا وہ جنھیں ہم نے پیدا کیا؟ بے شک ہم نے انھیں ایک چپکتے ہوئے گارے سے پیدا کیا ہے۔‘‘ ¤ اب دوسرے عقیدے کی تردید کرتے ہوئے فرماما : « فَاسْتَفْتِهِمْ اَلِرَبِّكَ الْبَنَاتُ وَ لَهُمُ الْبَنُوْنَ » ’’پس ان سے پوچھ کیا تیرے رب کے لیے بیٹیاں ہیں اور ان کے لیے بیٹے؟‘‘ زمخشری نے فرمایا : ’’اس کا عطف سورت کے شروع میں {’’ فَاسْتَفْتِهِمْ اَهُمْ اَشَدُّ خَلْقًا ‘‘} پر ہے، اگرچہ ان کے درمیان بہت فاصلہ ہے۔‘‘ فرشتوں کو اللہ کی بیٹیاں قرار دیتے ہوئے وہ تین ظلم کر رہے تھے، ایک یہ کہ وہ اللہ تعالیٰ کی اولاد قرار دے رہے تھے، حالانکہ وہ اس سے پاک ہے، کیونکہ یہ عجز اور محتاجی کی دلیل ہے۔ دوسرا یہ کہ انھوں نے اللہ تعالیٰ کے لیے بیٹیاں قرار دیں، جب کہ اپنے لیے بیٹے پسند کرتے ہیں۔ تیسرا یہ کہ انھوں نے اللہ کے مقرب فرشتوں کو مؤنث قرار دیا، حالانکہ وہ مذکر و مؤنث کی تفریق سے پاک ہیں۔ اللہ تعالیٰ نے ان سب باتوں پر ان کا رد فرمایا اور سخت غصے کا اظہار فرمایا، چنانچہ فرمایا : ’’ان سے پوچھو کہ کیا تیرے رب کے لیے بیٹیاں اور ان کے لیے بیٹے ہیں؟‘‘ ان کا اپنا حال یہ ہے کہ بیٹی کی خبر پر ان کا چہرہ سیاہ ہو جاتاہے اور اسے زندہ درگور کرنے کی فکر کرنے لگتے ہیں اور اپنے لیے اتنی ناگوار بات کی نسبت اللہ تعالیٰ کی طرف کرتے ہیں۔"
    },
    {
      "ayah": 150,
      "tafsir": "(آیت 150) { اَمْ خَلَقْنَا الْمَلٰٓىِٕكَةَ اِنَاثًا وَّ هُمْ شٰهِدُوْنَ :} اس میں فرشتوں کے مؤنث ہونے کی تردید فرمائی کہ انھیں کیسے معلوم ہوا کہ فرشتے مؤنث ہیں، کیا جب ہم نے فرشتوں کو پیدا کیا تو یہ موجود تھے کہ انھوں نے دیکھا ہو کہ ہم نے انھیں مؤنث بنایا ہے؟"
    },
    {
      "ayah": 151,
      "tafsir": "(آیت 152،151) { اَلَاۤ اِنَّهُمْ مِّنْ اِفْكِهِمْ لَيَقُوْلُوْنَ … :} فرمایا، سن لو! ان کا یہ کہنا کہ اللہ نے اولاد جنی ہے صاف بہتان ہے اور یہ یقینا جھوٹے ہیں۔"
    },
    {
      "ayah": 152,
      "tafsir": "(آیت 152،151) { اَلَاۤ اِنَّهُمْ مِّنْ اِفْكِهِمْ لَيَقُوْلُوْنَ … :} فرمایا، سن لو! ان کا یہ کہنا کہ اللہ نے اولاد جنی ہے صاف بہتان ہے اور یہ یقینا جھوٹے ہیں۔"
    },
    {
      "ayah": 153,
      "tafsir": "(آیت 153تا155){ اَصْطَفَى الْبَنَاتِ عَلَى الْبَنِيْنَ … : ’’ اَصْطَفَى ‘‘} اصل میں {’’أَ اِصْطَفٰي‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی حذف کر دیا۔ {’’ تَذَكَّرُوْنَ ‘‘} اصل میں {’’تَتَذَكَّرُوْنَ‘‘} ہے۔"
    },
    {
      "ayah": 154,
      "tafsir": "(آیت 153تا155){ اَصْطَفَى الْبَنَاتِ عَلَى الْبَنِيْنَ … : ’’ اَصْطَفَى ‘‘} اصل میں {’’أَ اِصْطَفٰي‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی حذف کر دیا۔ {’’ تَذَكَّرُوْنَ ‘‘} اصل میں {’’تَتَذَكَّرُوْنَ‘‘} ہے۔"
    },
    {
      "ayah": 155,
      "tafsir": "(آیت 153تا155){ اَصْطَفَى الْبَنَاتِ عَلَى الْبَنِيْنَ … : ’’ اَصْطَفَى ‘‘} اصل میں {’’أَ اِصْطَفٰي‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی حذف کر دیا۔ {’’ تَذَكَّرُوْنَ ‘‘} اصل میں {’’تَتَذَكَّرُوْنَ‘‘} ہے۔"
    },
    {
      "ayah": 156,
      "tafsir": "(آیت 157،156) { اَمْ لَكُمْ سُلْطٰنٌ مُّبِيْنٌ … :} دعوے کو ثابت کرنے کے لیے یا عینی شہادت ہوتی ہے یا کوئی نقلی دلیل۔ عینی شہادت کا رد یہ کہہ کر فرمایا کہ جب ہم نے فرشتوں کو پیدا کیا تو کیا تم موجود تھے؟ ظاہر ہے موجود نہیں تھے۔ اب کسی معتبر نقلی دلیل کا مطالبہ فرمایا کہ کیا تمھارے پاس اللہ تعالیٰ کی طرف سے کوئی ایسی کتاب ہے جس میں لکھا ہے کہ فرشتے اللہ کی بیٹیاں ہیں؟ جب یہ بھی نہیں تو صاف ظاہر ہے کہ تمھارے عقائد من گھڑت اور جھوٹ ہیں۔"
    },
    {
      "ayah": 157,
      "tafsir": "(آیت 157،156) { اَمْ لَكُمْ سُلْطٰنٌ مُّبِيْنٌ … :} دعوے کو ثابت کرنے کے لیے یا عینی شہادت ہوتی ہے یا کوئی نقلی دلیل۔ عینی شہادت کا رد یہ کہہ کر فرمایا کہ جب ہم نے فرشتوں کو پیدا کیا تو کیا تم موجود تھے؟ ظاہر ہے موجود نہیں تھے۔ اب کسی معتبر نقلی دلیل کا مطالبہ فرمایا کہ کیا تمھارے پاس اللہ تعالیٰ کی طرف سے کوئی ایسی کتاب ہے جس میں لکھا ہے کہ فرشتے اللہ کی بیٹیاں ہیں؟ جب یہ بھی نہیں تو صاف ظاہر ہے کہ تمھارے عقائد من گھڑت اور جھوٹ ہیں۔"
    },
    {
      "ayah": 158,
      "tafsir": "(آیت 158) ➊ { وَ جَعَلُوْا بَيْنَهٗ وَ بَيْنَ الْجِنَّةِ نَسَبًا … :} اللہ تعالیٰ اور جنّوں کے  درمیان نسب بنانے سے کیا مراد ہے؟ ابن کثیر رحمہ اللہ نے اس کی تفسیر میں دو قول ذکر کیے ہیں، پہلا مجاہد کا قول کہ مشرکین نے کہا، فرشتے اللہ کی بیٹیاں ہیں۔ تو ابوبکر رضی اللہ عنہ نے پوچھا، تو ان کی مائیں کون ہیں؟ انھوں نے کہا {’’بَنَاتُ سَرَوَاتِ الْجِنِّ‘‘} ’’سردار جننیوں کی بیٹیاں۔‘‘ مگر اس تفسیر میں اللہ تعالیٰ اور جنّوں کے درمیان نسبی رشتہ قائم نہیں ہوتا، بلکہ صہری یعنی سسرالی رشتہ قائم ہوتا ہے، کیونکہ جننیوں کی بیٹیاں (نعوذ باللہ) اللہ کی بیویاں ہوں تو جنّ سسر ہوں گے۔ علاوہ ازیں مجاہد کی ابوبکر رضی اللہ عنہ سے ملاقات بھی نہیں، اس لیے یہ منقطع ہے۔ دوسرا قول ابن عباس رضی اللہ عنھما کا نقل کیا ہے کہ اللہ کے ان دشمنوں نے اللہ تعالیٰ اور ابلیس کو دو بھائی قرار دیا۔ مفسرین نے اس تشریح میں فرمایا کہ یہ ایرانیوں کا عقیدہ تھا کہ خالق دو ہیں، ایک خالق خیر، جسے ’’یزداں‘‘ کہتے ہیں اور ایک خالقِ شر، جسے ’’اہرمن‘‘ کہتے ہیں۔ مگر اس تفسیر میں بھی دو خرابیاں ہیں، ایک تو اس کی سند ثابت نہیں، کیونکہ یہ طبری نے عوفی عن ابن عباس کے طریق سے بیان کی ہے، جو ضعیف ہے، دوسرے اس میں اللہ تعالیٰ اور ابلیس کے درمیان بھائی ہونے کے رشتے کا بیان ہے، جب کہ آیت میں عام جنّوں کا ذکر ہے۔ ¤ بعض مفسرین نے فرمایا کہ یہاں {’’ الْجِنَّةِ ‘‘} سے مراد فرشتے ہیں، کیونکہ جنّات کو ان کے چھپے ہوئے ہونے کی وجہ سے ’’جنّ ‘‘ کہتے ہیں، جیسا کہ جنین، جنون وغیرہ الفاظ میں یہی مفہوم پایا جاتا ہے اور فرشتے بھی چھپے ہوتے ہیں، اس لیے یہاں مراد یہ ہے کہ انھوں نے فرشتوں اور اللہ کے درمیان نسبی رشتہ قرار دیا ہے، اس طرح کہ انھیں اللہ کی بیٹیاں قرار دیا۔ مگر اس میں بھی دو خرابیاں ہیں، ایک تو فرشتوں کو ’’جنّ‘‘ کہنا بہت بڑا تکلف ہے، کیونکہ جنّ آگ سے پیدا ہوئے ہیں اور فرشتے نور سے۔ دوسری خرابی یہ ہے کہ یہ بات تو اوپر آیت (۱۵۳) میں گزر چکی ہے : « اَصْطَفَى الْبَنَاتِ عَلَى الْبَنِيْنَ» اسے بلا ضرورت دوبارہ ذکر کرنے کا کیا فائدہ؟ میں نے اس مسئلے میں بہت سی تفاسیر کا مطالعہ کیا، سب کا خلاصہ یہ ہے جو میں نے اوپر بیان کر دیا۔ آخر میں مجھے مولانا ثناء اللہ امرتسری کی تفسیر سے اطمینان ہوا، وہ یہ کہ مشرکین جس طرح فرشتوں کو اللہ کی بیٹیاں کہتے تھے جنّوں کو اللہ کے بیٹے (یا اولاد) کہتے تھے۔ دلیل اس کی اللہ تعالیٰ کا یہی فرمان ہے کہ انھوں نے اللہ کے درمیان اور جنّوں کے درمیان نسب قرار دیا۔ ظاہر ہے نسب کا اطلاق سب سے پہلے بیٹوں اور بیٹیوں پر ہوتا ہے۔ مشرکوں سے یہ بات کچھ بعید نہیں اور اللہ سے زیادہ سچا راوی کون ہو سکتا ہے؟ (واللہ اعلم) ¤ ➋ { وَ لَقَدْ عَلِمَتِ الْجِنَّةُ اِنَّهُمْ لَمُحْضَرُوْنَ : ’’مُحْضَرُوْنَ‘‘} (حاضر کیے گئے) انھی کے متعلق کہا جاتا ہے جو خود آنا نہ چاہتے ہوں۔ یعنی یقینا جنّوں کو معلوم ہے کہ وہ حساب کے لیے حاضر کیے جانے والے ہیں۔ کیا باپ کا اولاد کے ساتھ یہ معاملہ ہوتا ہے؟"
    },
    {
      "ayah": 159,
      "tafsir": "(آیت 159) {سُبْحٰنَ اللّٰهِ عَمَّا يَصِفُوْنَ :} یعنی اللہ تعالیٰ ان سب باتوں سے پاک ہے جو یہ مشرکین بیان کرتے ہیں۔"
    },
    {
      "ayah": 160,
      "tafsir": "(آیت 160) { اِلَّا عِبَادَ اللّٰهِ الْمُخْلَصِيْنَ :} اس کی دو توجیہیں ہیں اور دونوں بیک وقت بھی مراد ہو سکتی ہیں، ایک یہ کہ اللہ کے مخلص بندے ایسی باتیں نہیں کہتے، یہ مشرکین ہی کا شیوہ ہے۔ دوسری یہ کہ جنّ جانتے ہیں کہ وہ نہ چاہتے ہوئے بھی حاضر کیے جانے والے ہیں، مگر اللہ کے وہ بندے جو چنے ہوئے ہیں، جنّ ہوں یا انسان، وہ اس گرفتاری سے آزاد رہیں گے، کیونکہ ان کے لیے اللہ تعالیٰ نے جنت تیار کر رکھی ہے۔ وہ نہایت اعزاز کے ساتھ بلائے جائیں گے۔"
    },
    {
      "ayah": 161,
      "tafsir": "(آیت 161تا163) {فَاِنَّكُمْ وَ مَا تَعْبُدُوْنَ …:’’ عَلَيْهِ ‘‘} میں ضمیر اللہ تعالیٰ کی طرف لوٹتی ہے۔ {’’فَاتِنِيْنَ‘‘} فتنے میں ڈالنے والے، بہکانے والے۔ {’’صَالٍ‘‘ صَلِيَ يَصْلٰي صِلِيًّا‘‘} (س) (داخل ہونا) سے اسم فاعل ہے۔ یعنی اے گروہ کفار و مشرکین! تم اور تمھارے باطل معبود کسی کو اللہ تعالیٰ کے خلاف بہکا کر گمراہ نہیں کر سکتے، سوائے اس کے جس نے خود ہی جہنم میں جانے کا تہیہ کر رکھا ہو۔ اس کے مخلص بندوں کا تم کچھ نہیں بگاڑ سکتے۔ شاہ عبد القادر لکھتے ہیں : ’’یعنی تم انسان اور تمھارے شیطان اللہ کی مرضی کے بغیر گمراہ نہیں کر سکتے، گمراہ وہی ہو گا جس کو اس نے دوزخی لکھ دیا۔‘‘ (موضح)"
    },
    {
      "ayah": 162,
      "tafsir": "(آیت 161تا163) {فَاِنَّكُمْ وَ مَا تَعْبُدُوْنَ …:’’ عَلَيْهِ ‘‘} میں ضمیر اللہ تعالیٰ کی طرف لوٹتی ہے۔ {’’فَاتِنِيْنَ‘‘} فتنے میں ڈالنے والے، بہکانے والے۔ {’’صَالٍ‘‘ صَلِيَ يَصْلٰي صِلِيًّا‘‘} (س) (داخل ہونا) سے اسم فاعل ہے۔ یعنی اے گروہ کفار و مشرکین! تم اور تمھارے باطل معبود کسی کو اللہ تعالیٰ کے خلاف بہکا کر گمراہ نہیں کر سکتے، سوائے اس کے جس نے خود ہی جہنم میں جانے کا تہیہ کر رکھا ہو۔ اس کے مخلص بندوں کا تم کچھ نہیں بگاڑ سکتے۔ شاہ عبد القادر لکھتے ہیں : ’’یعنی تم انسان اور تمھارے شیطان اللہ کی مرضی کے بغیر گمراہ نہیں کر سکتے، گمراہ وہی ہو گا جس کو اس نے دوزخی لکھ دیا۔‘‘ (موضح)"
    },
    {
      "ayah": 163,
      "tafsir": "(آیت 161تا163) {فَاِنَّكُمْ وَ مَا تَعْبُدُوْنَ …:’’ عَلَيْهِ ‘‘} میں ضمیر اللہ تعالیٰ کی طرف لوٹتی ہے۔ {’’فَاتِنِيْنَ‘‘} فتنے میں ڈالنے والے، بہکانے والے۔ {’’صَالٍ‘‘ صَلِيَ يَصْلٰي صِلِيًّا‘‘} (س) (داخل ہونا) سے اسم فاعل ہے۔ یعنی اے گروہ کفار و مشرکین! تم اور تمھارے باطل معبود کسی کو اللہ تعالیٰ کے خلاف بہکا کر گمراہ نہیں کر سکتے، سوائے اس کے جس نے خود ہی جہنم میں جانے کا تہیہ کر رکھا ہو۔ اس کے مخلص بندوں کا تم کچھ نہیں بگاڑ سکتے۔ شاہ عبد القادر لکھتے ہیں : ’’یعنی تم انسان اور تمھارے شیطان اللہ کی مرضی کے بغیر گمراہ نہیں کر سکتے، گمراہ وہی ہو گا جس کو اس نے دوزخی لکھ دیا۔‘‘ (موضح)"
    },
    {
      "ayah": 164,
      "tafsir": "(آیت 164) {وَ مَا مِنَّاۤ اِلَّا لَهٗ مَقَامٌ مَّعْلُوْمٌ :} یہاں سے اللہ تعالیٰ نے فرشتوں کی زبانی ان کا اعتراف ذکر فرمایا ہے کہ وہ اللہ تعالیٰ کی اولاد نہیں بلکہ اس کے کامل اطاعت گزار بندے اور ہر وقت اس کی عبادت اور تسبیح کرنے والے ہیں۔ یعنی تمھارے اس شرکیہ عقیدے کے مقابلے میں فرشتوں کا اپنا بیان یہ ہے کہ ہم میں سے ہر ایک فرشتے کا ایک مقرر درجہ اور مقام ہے، جس سے آگے ہم نہیں بڑھ سکتے۔ ابوذر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنِّي أَرٰی مَا لاَ تَرَوْنَ وَأَسْمَعُ مَا لاَ تَسْمَعُوْنَ، أَطَّتِ السَّمَاءُ وَحُقَّ لَهَا أَنْ تَئِطَّ مَا فِيْهَا مَوْضِعُ أَرْبَعِ أَصَابِعَ إِلاَّ وَمَلَكٌ وَاضِعٌ جَبْهَتَهُ سَاجِدًا لِلّٰهِ، وَاللّٰهِ! لَوْ تَعْلَمُوْنَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيْلاً وَلَبَكَيْتُمْ كَثِيْرًا ] [ ترمذي، الزھد، باب قول النبي صلی االلہ علیہ وسلم لو تعلمون ما أعلم… : ۲۳۱۲، و صححہ الألباني، أنظر تراجعات الألباني، ح : ۳۳ ] ’’میں وہ دیکھتا ہوں جو تم نہیں دیکھتے اور وہ سنتا ہوں جو تم نہیں سنتے۔ آسمان چر چرا رہا ہے اور اس کا حق ہے کہ چر چرائے۔ اس میں چار انگلیوں کے برابر جگہ نہیں مگر کوئی نہ کوئی فرشتہ اس میں اپنی پیشانی اللہ کے لیے سجدے میں رکھے ہوئے ہے۔ قسم ہے اللہ کی! اگر تم وہ جان لو جو میں جانتا ہوں تو تم ہنسو کم اور روؤ زیادہ۔‘‘"
    },
    {
      "ayah": 165,
      "tafsir": "(آیت 165) {وَ اِنَّا لَنَحْنُ الصَّآفُّوْنَ :} اور ہم سب اللہ تعالیٰ کی عبادت کے لیے صفیں بنانے والے ہیں۔ جابر بن سمرہ رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَلاَ تَصُفُّوْنَ كَمَا تَصُفُّ الْمَلاَئِكَةُ عِنْدَ رَبِّهَا؟ فَقُلْنَا يَا رَسُوْلَ اللّٰهِ! وَكَيْفَ تَصُفُّ الْمَلاَئِكَةُ عِنْدَ رَبِّهَا؟ قَالَ يُتِمُّوْنَ الصُّفُوْفَ الْأُوَلَ، وَيَتَرَاصُّوْنَ فِي الصَّفِّ ] [ مسلم، الصلاۃ، باب الأمر بالسکون في الصلاۃ… : ۴۳۰۔ أبوداوٗد : ۶۶۱ ] ’’تم لوگ اس طرح صفیں کیوں نہیں بناتے جس طرح فرشتے اپنے رب کے پاس صفیں بناتے ہیں؟‘‘ ہم نے عرض کیا : ’’اے اللہ کے رسول! فرشتے اپنے رب کے پاس کس طرح صفیں بناتے ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ (پہلے) پہلی صفیں مکمل کرتے ہیں اور صفوں میں چونا گچ ہو کر کھڑے ہوتے ہیں۔‘‘"
    },
    {
      "ayah": 166,
      "tafsir": "(آیت 166) { وَ اِنَّا لَنَحْنُ الْمُسَبِّحُوْنَ۠ :} اللہ تعالیٰ نے فرمایا : « وَ لَهٗ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ وَ مَنْ عِنْدَهٗ لَا يَسْتَكْبِرُووْنَ عَنْ عِبَادَتِهٖ وَ لَا يَسْتَحْسِرُوْنَ (19) يُسَبِّحُوْنَ الَّيْلَ وَ النَّهَارَ لَا يَفْتُرُوْنَ» [ الأنبیاء : ۱۹، ۲۰ ] ’’اور اسی کا ہے جو کوئی آسمانوں اور زمین میں ہے اور جو اس کے پاس ہیں وہ نہ اس کی عبادت سے تکبر کرتے ہیں اور نہ تھکتے ہیں۔ وہ رات اور دن تسبیح کرتے ہیں، وقفہ نہیں کرتے۔‘‘"
    },
    {
      "ayah": 167,
      "tafsir": "(آیت 167تا170){’’ وَ اِنْ كَانُوْا لَيَقُوْلُوْنَ ‘‘} اصل میں {’’وَ إِنَّهُمْ كَانُوْا يَقُوْلُوْنَ‘‘} تھا۔ دلیل اس کی {’’ لَيَقُوْلُوْنَ ‘‘} پر آنے والا لام ہے، جس کی وجہ سے {’’إِنَّ‘‘} کو {’’إِنْ‘‘} کر دیا اور {’’هُمْ‘‘} کو حذف کر دیا۔ ان آیات کی تفسیر کے لیے دیکھیے سورۂ فاطر (۴۲) اور سورۂ انعام (۱۵۶، ۱۵۷) یعنی یہ لوگ کہا کرتے تھے کہ گزشتہ لوگوں کی طرح ہمارے پاس کوئی پیغمبر آتا، یا ہم پر اللہ کی طرف سے کوئی کتاب نازل ہوتی تو ہم اللہ کے چنے ہوئے بندے ہوتے۔ مگر جب یہ کتاب ان کے پاس آ گئی تو انھوں نے اسے قبول کرنے سے انکار کر دیا۔ اب اس انکار کا نتیجہ وہ بہت جلدی جان لیں گے۔"
    },
    {
      "ayah": 168,
      "tafsir": "(آیت 167تا170){’’ وَ اِنْ كَانُوْا لَيَقُوْلُوْنَ ‘‘} اصل میں {’’وَ إِنَّهُمْ كَانُوْا يَقُوْلُوْنَ‘‘} تھا۔ دلیل اس کی {’’ لَيَقُوْلُوْنَ ‘‘} پر آنے والا لام ہے، جس کی وجہ سے {’’إِنَّ‘‘} کو {’’إِنْ‘‘} کر دیا اور {’’هُمْ‘‘} کو حذف کر دیا۔ ان آیات کی تفسیر کے لیے دیکھیے سورۂ فاطر (۴۲) اور سورۂ انعام (۱۵۶، ۱۵۷) یعنی یہ لوگ کہا کرتے تھے کہ گزشتہ لوگوں کی طرح ہمارے پاس کوئی پیغمبر آتا، یا ہم پر اللہ کی طرف سے کوئی کتاب نازل ہوتی تو ہم اللہ کے چنے ہوئے بندے ہوتے۔ مگر جب یہ کتاب ان کے پاس آ گئی تو انھوں نے اسے قبول کرنے سے انکار کر دیا۔ اب اس انکار کا نتیجہ وہ بہت جلدی جان لیں گے۔"
    },
    {
      "ayah": 169,
      "tafsir": "(آیت 167تا170){’’ وَ اِنْ كَانُوْا لَيَقُوْلُوْنَ ‘‘} اصل میں {’’وَ إِنَّهُمْ كَانُوْا يَقُوْلُوْنَ‘‘} تھا۔ دلیل اس کی {’’ لَيَقُوْلُوْنَ ‘‘} پر آنے والا لام ہے، جس کی وجہ سے {’’إِنَّ‘‘} کو {’’إِنْ‘‘} کر دیا اور {’’هُمْ‘‘} کو حذف کر دیا۔ ان آیات کی تفسیر کے لیے دیکھیے سورۂ فاطر (۴۲) اور سورۂ انعام (۱۵۶، ۱۵۷) یعنی یہ لوگ کہا کرتے تھے کہ گزشتہ لوگوں کی طرح ہمارے پاس کوئی پیغمبر آتا، یا ہم پر اللہ کی طرف سے کوئی کتاب نازل ہوتی تو ہم اللہ کے چنے ہوئے بندے ہوتے۔ مگر جب یہ کتاب ان کے پاس آ گئی تو انھوں نے اسے قبول کرنے سے انکار کر دیا۔ اب اس انکار کا نتیجہ وہ بہت جلدی جان لیں گے۔"
    },
    {
      "ayah": 170,
      "tafsir": "(آیت 167تا170){’’ وَ اِنْ كَانُوْا لَيَقُوْلُوْنَ ‘‘} اصل میں {’’وَ إِنَّهُمْ كَانُوْا يَقُوْلُوْنَ‘‘} تھا۔ دلیل اس کی {’’ لَيَقُوْلُوْنَ ‘‘} پر آنے والا لام ہے، جس کی وجہ سے {’’إِنَّ‘‘} کو {’’إِنْ‘‘} کر دیا اور {’’هُمْ‘‘} کو حذف کر دیا۔ ان آیات کی تفسیر کے لیے دیکھیے سورۂ فاطر (۴۲) اور سورۂ انعام (۱۵۶، ۱۵۷) یعنی یہ لوگ کہا کرتے تھے کہ گزشتہ لوگوں کی طرح ہمارے پاس کوئی پیغمبر آتا، یا ہم پر اللہ کی طرف سے کوئی کتاب نازل ہوتی تو ہم اللہ کے چنے ہوئے بندے ہوتے۔ مگر جب یہ کتاب ان کے پاس آ گئی تو انھوں نے اسے قبول کرنے سے انکار کر دیا۔ اب اس انکار کا نتیجہ وہ بہت جلدی جان لیں گے۔"
    },
    {
      "ayah": 171,
      "tafsir": "(آیت 171تا173) ➊ { وَ لَقَدْ سَبَقَتْ كَلِمَتُنَا …:} پچھلی آیت میں کفار کو ان کے انکار کا نتیجہ بہت جلدی دیکھ لینے کی دھمکی دی تھی، اب رسول اللہ صلی اللہ علیہ وسلم کو حوصلہ اور تسلی دینے کے لیے فرمایا کہ ہمارے ان بندوں کے لیے، جنھیں ہم اپنا رسول بنا کر بھیجتے ہیں، ہماری یہ بات پہلے طے ہو چکی ہے کہ انھی کی مدد کی جائے گی اور صرف انھی کی نہیں بلکہ ان کے اور ان کے پیروکاروں کی صورت میں ہمارا جو بھی لشکر ہو گا وہی غالب رہیں گے۔ اس کی دلیل اللہ تعالیٰ کا یہ فرمان بھی ہے : «كَتَبَ اللّٰهُ لَاَغْلِبَنَّ اَنَا وَ رُسُلِيْ اِنَّ اللّٰهَ قَوِيٌّ عَزِيْزٌ » [ المجادلۃ : ۲۱ ] ’’اللہ نے لکھ دیا ہے کہ ضرور بالضرور میں غالب رہوں گا اور میرے رسول، یقینا اللہ بڑی قوت والا، سب پر غالب ہے۔‘‘ اور فرمایا : « اِنَّا لَنَنْصُرُ رُسُلَنَا وَ الَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَ يَوْمَ يَقُوْمُ الْاَشْهَادُ» [ المؤمن : ۵۱ ] ’’بے شک ہم اپنے رسولوں کی اور ان لوگوں کی جو ایمان لائے ضرور مدد کرتے ہیں دنیا کی زندگی میں اور اس دن بھی جب گواہ کھڑے ہوں گے۔‘‘ ¤ ➋ { اِنَّهُمْ لَهُمُ الْمَنْصُوْرُوْنَ : } اس آیت میں صرف اللہ کے رسولوں کے منصور ہونے کی تاکید کئی طرح سے فرمائی ہے، پہلے ضمیر {’’هُمْ‘‘} کی تاکید دوبارہ {’’هُمْ‘‘} لا کر فرمائی، پھر اس پر ’’لام‘‘ کے ساتھ مزید تاکید فرمائی، پھر خبر پر الف لام لا کر {’’ الْمَنْصُوْرُوْنَ ‘‘} فرمایا، اس سے بھی کلام میں حصر پیدا ہوتا ہے۔ خلاصہ یہ کہ ہر حال میں انھی کی نصرت ہو گی، ان کے مقابلے میں دوسروں کی نہیں اور ہر حال میں رسول اور ان کے پیروکار ہی غالب رہیں گے۔ ¤ ➌ یہاں سوال پیدا ہوتا ہے کہ بعض اوقات انبیاء اور اہل ایمان پر کفار بھی غالب آ جاتے ہیں، جیسا کہ صحیح بخاری میں ابوسفیان سے ہرقل کا سوال مذکور ہے کہ نبوت کا دعویٰ کرنے والے اس آدمی سے کبھی تمھاری جنگ بھی ہوئی ہے، اگر ہوئی ہے تو اس کا نتیجہ کیا رہا؟ تو اس نے جواب دیا : [ كَانَتْ دُوَلاً وَ سِجَالاً، يُدَالُ عَلَيْنَا الْمَرَّةَ وَنُدَالُ عَلَيْهِ الْأُخْرٰی] ’’جنگ باریوں کی صورت میں رہی، کبھی وہ ہم پر غالب رہا اور کبھی ہم اس پر غالب رہے۔‘‘ اس سوال کا بہترین جواب تو وہ ہے جو ہرقل نے تمام سوالوں کا جواب سننے کے بعد اپنے تبصرے میں دیا، اس نے کہا : [ وَ سَأَلْتُكَ هَلْ قَاتَلْتُمُوْهُ وَ قَاتَلَكُمْ فَزَعَمْتَ أَنْ قَدْ فَعَلَ، وَ أَنَّ حَرْبَكُمْ وَ حَرْبَهُ تَكُوْنُ دُوَلاً، وَ يُدَالُ عَلَيْكُمُ الْمَرَّةَ وَ تُدَالُوْنَ عَلَيْهِ الْأُخْرٰی، وَكَذٰلِكَ الرُّسُلُ تُبْتَلٰی، وَ تَكُوْنُ لَهَا الْعَاقِبَةُ ] [ بخاري، الجہاد والسیر، باب دعاء النبي صلی اللہ علیہ وسلم إلی الإسلام والنبوۃ… : ۲۹۴۱، ۴۵۵۳، عن ابن عباس رضی اللہ عنھما ] ’’اور میں نے تم سے پوچھا کہ کیا تم نے اس سے اور اس نے تم سے جنگ کی ہے، تو تم نے بتایا کہ ہاں کی ہے اور تمھاری اور اس کی لڑائی باریوں کی صورت میں رہی، کسی بار وہ تم پر غالب آ تا رہا اور کسی دوسری بار تم غالب آتے رہے اور رسولوں کی اسی طرح آزمائش کی جاتی ہے اور آخری نتیجہ انھی کے حق میں ہوتا ہے۔‘‘ ¤ حقیقت یہ ہے کہ نصرت و غلبہ دنیا میں بعض اوقات دلیل اور حجت کے لحاظ سے ہوتا ہے، بعض اوقات فتح اور حکومت ملنے کے ساتھ اور کبھی اپنے موقف پر ثابت اور قائم رہنے کے ساتھ۔ چنانچہ اگر مومن بعض اوقات اپنے دنیوی حالات کی کمزوری کی وجہ سے مغلوب ہو جائے تب بھی دلیل میں اور اپنے ایمان پر ثابت رہنے کی وجہ سے غالب وہی ہے اور آخری نتیجہ اسی کے حق میں ہو گا، جیسا کہ ہرقل نے کہا۔ وہ شہید بھی ہو جائے تو ہمیشہ نعمت کی زندگی کے حصول میں کامیاب ہو گیا اور یقینا ایک وقت آنے والا ہے جب اہل ایمان کی کفار پر برتری سامنے آ جائے گی، فرمایا : « فَالْيَوْمَ الَّذِيْنَ اٰمَنُوْا مِنَ الْكُفَّارِ يَضْحَكُوْنَ (34) عَلَى الْاَرَآىِٕكِ يَنْظُرُوْنَ (35) هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوْا يَفْعَلُوْنَ» [ المطففین : ۳۴ تا ۳۶ ] ’’ سو آج وہ لوگ جو ایمان لائے، کافروں پر ہنس رہے ہیں۔ تختوں پر (بیٹھے) نظارہ کر رہے ہیں۔ کیا کافروں کو اس کا بدلا دیا گیا جو وہ کیا کرتے تھے؟‘‘ اور اللہ تعالیٰ نے بھی دنیا اور آخرت دونوں کا ذکر فرمایا ہے : « اِنَّا لَنَنْصُرُ رُسُلَنَا وَ الَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَ يَوْمَ يَقُوْمُ الْاَشْهَادُ » [ المؤمن  : ۵۱ ] ’’ بے شک ہم اپنے رسولوں کی اور ان لوگوں کی جو ایمان لائے ضرور مدد کرتے ہیں دنیا کی زندگی میں اور اس دن بھی جب گواہ کھڑے ہوں گے۔‘‘ رہا دنیا میں مسلمانوں کا بعض اوقات شکست سے دو چار ہونا، تو جیسا کہ ہرقل نے کہا، یہ اللہ تعالیٰ کی ابتلا اور آزمائش کی حکمت کی وجہ سے ہے۔ اگر دنیا میں ہمیشہ مسلمان ہی فتح یاب ہوں تو امتحان کا معاملہ ہی ختم ہو جاتا ہے۔ دیکھیے سورۂ بقرہ (124)، آل عمران (۱۴۲) اور سورۂ توبہ (۱۶)۔"
    },
    {
      "ayah": 172,
      "tafsir": "(آیت 171تا173) ➊ { وَ لَقَدْ سَبَقَتْ كَلِمَتُنَا …:} پچھلی آیت میں کفار کو ان کے انکار کا نتیجہ بہت جلدی دیکھ لینے کی دھمکی دی تھی، اب رسول اللہ صلی اللہ علیہ وسلم کو حوصلہ اور تسلی دینے کے لیے فرمایا کہ ہمارے ان بندوں کے لیے، جنھیں ہم اپنا رسول بنا کر بھیجتے ہیں، ہماری یہ بات پہلے طے ہو چکی ہے کہ انھی کی مدد کی جائے گی اور صرف انھی کی نہیں بلکہ ان کے اور ان کے پیروکاروں کی صورت میں ہمارا جو بھی لشکر ہو گا وہی غالب رہیں گے۔ اس کی دلیل اللہ تعالیٰ کا یہ فرمان بھی ہے : «كَتَبَ اللّٰهُ لَاَغْلِبَنَّ اَنَا وَ رُسُلِيْ اِنَّ اللّٰهَ قَوِيٌّ عَزِيْزٌ » [ المجادلۃ : ۲۱ ] ’’اللہ نے لکھ دیا ہے کہ ضرور بالضرور میں غالب رہوں گا اور میرے رسول، یقینا اللہ بڑی قوت والا، سب پر غالب ہے۔‘‘ اور فرمایا : « اِنَّا لَنَنْصُرُ رُسُلَنَا وَ الَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَ يَوْمَ يَقُوْمُ الْاَشْهَادُ» [ المؤمن : ۵۱ ] ’’بے شک ہم اپنے رسولوں کی اور ان لوگوں کی جو ایمان لائے ضرور مدد کرتے ہیں دنیا کی زندگی میں اور اس دن بھی جب گواہ کھڑے ہوں گے۔‘‘ ¤ ➋ { اِنَّهُمْ لَهُمُ الْمَنْصُوْرُوْنَ : } اس آیت میں صرف اللہ کے رسولوں کے منصور ہونے کی تاکید کئی طرح سے فرمائی ہے، پہلے ضمیر {’’هُمْ‘‘} کی تاکید دوبارہ {’’هُمْ‘‘} لا کر فرمائی، پھر اس پر ’’لام‘‘ کے ساتھ مزید تاکید فرمائی، پھر خبر پر الف لام لا کر {’’ الْمَنْصُوْرُوْنَ ‘‘} فرمایا، اس سے بھی کلام میں حصر پیدا ہوتا ہے۔ خلاصہ یہ کہ ہر حال میں انھی کی نصرت ہو گی، ان کے مقابلے میں دوسروں کی نہیں اور ہر حال میں رسول اور ان کے پیروکار ہی غالب رہیں گے۔ ¤ ➌ یہاں سوال پیدا ہوتا ہے کہ بعض اوقات انبیاء اور اہل ایمان پر کفار بھی غالب آ جاتے ہیں، جیسا کہ صحیح بخاری میں ابوسفیان سے ہرقل کا سوال مذکور ہے کہ نبوت کا دعویٰ کرنے والے اس آدمی سے کبھی تمھاری جنگ بھی ہوئی ہے، اگر ہوئی ہے تو اس کا نتیجہ کیا رہا؟ تو اس نے جواب دیا : [ كَانَتْ دُوَلاً وَ سِجَالاً، يُدَالُ عَلَيْنَا الْمَرَّةَ وَنُدَالُ عَلَيْهِ الْأُخْرٰی] ’’جنگ باریوں کی صورت میں رہی، کبھی وہ ہم پر غالب رہا اور کبھی ہم اس پر غالب رہے۔‘‘ اس سوال کا بہترین جواب تو وہ ہے جو ہرقل نے تمام سوالوں کا جواب سننے کے بعد اپنے تبصرے میں دیا، اس نے کہا : [ وَ سَأَلْتُكَ هَلْ قَاتَلْتُمُوْهُ وَ قَاتَلَكُمْ فَزَعَمْتَ أَنْ قَدْ فَعَلَ، وَ أَنَّ حَرْبَكُمْ وَ حَرْبَهُ تَكُوْنُ دُوَلاً، وَ يُدَالُ عَلَيْكُمُ الْمَرَّةَ وَ تُدَالُوْنَ عَلَيْهِ الْأُخْرٰی، وَكَذٰلِكَ الرُّسُلُ تُبْتَلٰی، وَ تَكُوْنُ لَهَا الْعَاقِبَةُ ] [ بخاري، الجہاد والسیر، باب دعاء النبي صلی اللہ علیہ وسلم إلی الإسلام والنبوۃ… : ۲۹۴۱، ۴۵۵۳، عن ابن عباس رضی اللہ عنھما ] ’’اور میں نے تم سے پوچھا کہ کیا تم نے اس سے اور اس نے تم سے جنگ کی ہے، تو تم نے بتایا کہ ہاں کی ہے اور تمھاری اور اس کی لڑائی باریوں کی صورت میں رہی، کسی بار وہ تم پر غالب آ تا رہا اور کسی دوسری بار تم غالب آتے رہے اور رسولوں کی اسی طرح آزمائش کی جاتی ہے اور آخری نتیجہ انھی کے حق میں ہوتا ہے۔‘‘ ¤ حقیقت یہ ہے کہ نصرت و غلبہ دنیا میں بعض اوقات دلیل اور حجت کے لحاظ سے ہوتا ہے، بعض اوقات فتح اور حکومت ملنے کے ساتھ اور کبھی اپنے موقف پر ثابت اور قائم رہنے کے ساتھ۔ چنانچہ اگر مومن بعض اوقات اپنے دنیوی حالات کی کمزوری کی وجہ سے مغلوب ہو جائے تب بھی دلیل میں اور اپنے ایمان پر ثابت رہنے کی وجہ سے غالب وہی ہے اور آخری نتیجہ اسی کے حق میں ہو گا، جیسا کہ ہرقل نے کہا۔ وہ شہید بھی ہو جائے تو ہمیشہ نعمت کی زندگی کے حصول میں کامیاب ہو گیا اور یقینا ایک وقت آنے والا ہے جب اہل ایمان کی کفار پر برتری سامنے آ جائے گی، فرمایا : « فَالْيَوْمَ الَّذِيْنَ اٰمَنُوْا مِنَ الْكُفَّارِ يَضْحَكُوْنَ (34) عَلَى الْاَرَآىِٕكِ يَنْظُرُوْنَ (35) هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوْا يَفْعَلُوْنَ» [ المطففین : ۳۴ تا ۳۶ ] ’’ سو آج وہ لوگ جو ایمان لائے، کافروں پر ہنس رہے ہیں۔ تختوں پر (بیٹھے) نظارہ کر رہے ہیں۔ کیا کافروں کو اس کا بدلا دیا گیا جو وہ کیا کرتے تھے؟‘‘ اور اللہ تعالیٰ نے بھی دنیا اور آخرت دونوں کا ذکر فرمایا ہے : « اِنَّا لَنَنْصُرُ رُسُلَنَا وَ الَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَ يَوْمَ يَقُوْمُ الْاَشْهَادُ » [ المؤمن  : ۵۱ ] ’’ بے شک ہم اپنے رسولوں کی اور ان لوگوں کی جو ایمان لائے ضرور مدد کرتے ہیں دنیا کی زندگی میں اور اس دن بھی جب گواہ کھڑے ہوں گے۔‘‘ رہا دنیا میں مسلمانوں کا بعض اوقات شکست سے دو چار ہونا، تو جیسا کہ ہرقل نے کہا، یہ اللہ تعالیٰ کی ابتلا اور آزمائش کی حکمت کی وجہ سے ہے۔ اگر دنیا میں ہمیشہ مسلمان ہی فتح یاب ہوں تو امتحان کا معاملہ ہی ختم ہو جاتا ہے۔ دیکھیے سورۂ بقرہ (124)، آل عمران (۱۴۲) اور سورۂ توبہ (۱۶)۔"
    },
    {
      "ayah": 173,
      "tafsir": "(آیت 171تا173) ➊ { وَ لَقَدْ سَبَقَتْ كَلِمَتُنَا …:} پچھلی آیت میں کفار کو ان کے انکار کا نتیجہ بہت جلدی دیکھ لینے کی دھمکی دی تھی، اب رسول اللہ صلی اللہ علیہ وسلم کو حوصلہ اور تسلی دینے کے لیے فرمایا کہ ہمارے ان بندوں کے لیے، جنھیں ہم اپنا رسول بنا کر بھیجتے ہیں، ہماری یہ بات پہلے طے ہو چکی ہے کہ انھی کی مدد کی جائے گی اور صرف انھی کی نہیں بلکہ ان کے اور ان کے پیروکاروں کی صورت میں ہمارا جو بھی لشکر ہو گا وہی غالب رہیں گے۔ اس کی دلیل اللہ تعالیٰ کا یہ فرمان بھی ہے : «كَتَبَ اللّٰهُ لَاَغْلِبَنَّ اَنَا وَ رُسُلِيْ اِنَّ اللّٰهَ قَوِيٌّ عَزِيْزٌ » [ المجادلۃ : ۲۱ ] ’’اللہ نے لکھ دیا ہے کہ ضرور بالضرور میں غالب رہوں گا اور میرے رسول، یقینا اللہ بڑی قوت والا، سب پر غالب ہے۔‘‘ اور فرمایا : « اِنَّا لَنَنْصُرُ رُسُلَنَا وَ الَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَ يَوْمَ يَقُوْمُ الْاَشْهَادُ» [ المؤمن : ۵۱ ] ’’بے شک ہم اپنے رسولوں کی اور ان لوگوں کی جو ایمان لائے ضرور مدد کرتے ہیں دنیا کی زندگی میں اور اس دن بھی جب گواہ کھڑے ہوں گے۔‘‘ ¤ ➋ { اِنَّهُمْ لَهُمُ الْمَنْصُوْرُوْنَ : } اس آیت میں صرف اللہ کے رسولوں کے منصور ہونے کی تاکید کئی طرح سے فرمائی ہے، پہلے ضمیر {’’هُمْ‘‘} کی تاکید دوبارہ {’’هُمْ‘‘} لا کر فرمائی، پھر اس پر ’’لام‘‘ کے ساتھ مزید تاکید فرمائی، پھر خبر پر الف لام لا کر {’’ الْمَنْصُوْرُوْنَ ‘‘} فرمایا، اس سے بھی کلام میں حصر پیدا ہوتا ہے۔ خلاصہ یہ کہ ہر حال میں انھی کی نصرت ہو گی، ان کے مقابلے میں دوسروں کی نہیں اور ہر حال میں رسول اور ان کے پیروکار ہی غالب رہیں گے۔ ¤ ➌ یہاں سوال پیدا ہوتا ہے کہ بعض اوقات انبیاء اور اہل ایمان پر کفار بھی غالب آ جاتے ہیں، جیسا کہ صحیح بخاری میں ابوسفیان سے ہرقل کا سوال مذکور ہے کہ نبوت کا دعویٰ کرنے والے اس آدمی سے کبھی تمھاری جنگ بھی ہوئی ہے، اگر ہوئی ہے تو اس کا نتیجہ کیا رہا؟ تو اس نے جواب دیا : [ كَانَتْ دُوَلاً وَ سِجَالاً، يُدَالُ عَلَيْنَا الْمَرَّةَ وَنُدَالُ عَلَيْهِ الْأُخْرٰی] ’’جنگ باریوں کی صورت میں رہی، کبھی وہ ہم پر غالب رہا اور کبھی ہم اس پر غالب رہے۔‘‘ اس سوال کا بہترین جواب تو وہ ہے جو ہرقل نے تمام سوالوں کا جواب سننے کے بعد اپنے تبصرے میں دیا، اس نے کہا : [ وَ سَأَلْتُكَ هَلْ قَاتَلْتُمُوْهُ وَ قَاتَلَكُمْ فَزَعَمْتَ أَنْ قَدْ فَعَلَ، وَ أَنَّ حَرْبَكُمْ وَ حَرْبَهُ تَكُوْنُ دُوَلاً، وَ يُدَالُ عَلَيْكُمُ الْمَرَّةَ وَ تُدَالُوْنَ عَلَيْهِ الْأُخْرٰی، وَكَذٰلِكَ الرُّسُلُ تُبْتَلٰی، وَ تَكُوْنُ لَهَا الْعَاقِبَةُ ] [ بخاري، الجہاد والسیر، باب دعاء النبي صلی اللہ علیہ وسلم إلی الإسلام والنبوۃ… : ۲۹۴۱، ۴۵۵۳، عن ابن عباس رضی اللہ عنھما ] ’’اور میں نے تم سے پوچھا کہ کیا تم نے اس سے اور اس نے تم سے جنگ کی ہے، تو تم نے بتایا کہ ہاں کی ہے اور تمھاری اور اس کی لڑائی باریوں کی صورت میں رہی، کسی بار وہ تم پر غالب آ تا رہا اور کسی دوسری بار تم غالب آتے رہے اور رسولوں کی اسی طرح آزمائش کی جاتی ہے اور آخری نتیجہ انھی کے حق میں ہوتا ہے۔‘‘ ¤ حقیقت یہ ہے کہ نصرت و غلبہ دنیا میں بعض اوقات دلیل اور حجت کے لحاظ سے ہوتا ہے، بعض اوقات فتح اور حکومت ملنے کے ساتھ اور کبھی اپنے موقف پر ثابت اور قائم رہنے کے ساتھ۔ چنانچہ اگر مومن بعض اوقات اپنے دنیوی حالات کی کمزوری کی وجہ سے مغلوب ہو جائے تب بھی دلیل میں اور اپنے ایمان پر ثابت رہنے کی وجہ سے غالب وہی ہے اور آخری نتیجہ اسی کے حق میں ہو گا، جیسا کہ ہرقل نے کہا۔ وہ شہید بھی ہو جائے تو ہمیشہ نعمت کی زندگی کے حصول میں کامیاب ہو گیا اور یقینا ایک وقت آنے والا ہے جب اہل ایمان کی کفار پر برتری سامنے آ جائے گی، فرمایا : « فَالْيَوْمَ الَّذِيْنَ اٰمَنُوْا مِنَ الْكُفَّارِ يَضْحَكُوْنَ (34) عَلَى الْاَرَآىِٕكِ يَنْظُرُوْنَ (35) هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوْا يَفْعَلُوْنَ» [ المطففین : ۳۴ تا ۳۶ ] ’’ سو آج وہ لوگ جو ایمان لائے، کافروں پر ہنس رہے ہیں۔ تختوں پر (بیٹھے) نظارہ کر رہے ہیں۔ کیا کافروں کو اس کا بدلا دیا گیا جو وہ کیا کرتے تھے؟‘‘ اور اللہ تعالیٰ نے بھی دنیا اور آخرت دونوں کا ذکر فرمایا ہے : « اِنَّا لَنَنْصُرُ رُسُلَنَا وَ الَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَ يَوْمَ يَقُوْمُ الْاَشْهَادُ » [ المؤمن  : ۵۱ ] ’’ بے شک ہم اپنے رسولوں کی اور ان لوگوں کی جو ایمان لائے ضرور مدد کرتے ہیں دنیا کی زندگی میں اور اس دن بھی جب گواہ کھڑے ہوں گے۔‘‘ رہا دنیا میں مسلمانوں کا بعض اوقات شکست سے دو چار ہونا، تو جیسا کہ ہرقل نے کہا، یہ اللہ تعالیٰ کی ابتلا اور آزمائش کی حکمت کی وجہ سے ہے۔ اگر دنیا میں ہمیشہ مسلمان ہی فتح یاب ہوں تو امتحان کا معاملہ ہی ختم ہو جاتا ہے۔ دیکھیے سورۂ بقرہ (124)، آل عمران (۱۴۲) اور سورۂ توبہ (۱۶)۔"
    },
    {
      "ayah": 174,
      "tafsir": "(آیت 175،174) {فَتَوَلَّ عَنْهُمْ حَتّٰى حِيْنٍ …:} ’’ایک وقت‘‘ سے مراد یہ بھی ہو سکتا ہے کہ جب تک ہم آپ کو جنگ کی اجازت نہیں دیتے آپ انھیں ان کے حال پر چھوڑے رکھیں، بس زبانی طور پر دعوت و تبلیغ کا کام کرتے رہیں اور انھیں دیکھتے جائیں، بہت جلد یہ اپنا انجام دیکھ لیں گے۔ یاد رہے، یہ آیات مکی دور کی ہیں۔ اور ’’ایک وقت‘‘ سے ’’یوم بدر‘‘ بھی مراد ہو سکتا ہے اور فتح مکہ بھی۔ چنانچہ ایسا ہی ہوا، ہجرت کے بعد جب جہاد شروع ہوا تو کچھ زیادہ مدت نہ گزری تھی کہ کفار نے اپنی شکست اور مسلمانوں کی فتح کو اپنی آنکھوں سے دیکھ لیا اور ان آیات کے اترنے کے بعد چودہ، پندرہ سال ہی گزرے تھے کہ رسول اللہ صلی اللہ علیہ وسلم جس مکہ سے چھپ کر نکلے تھے، اسی مکہ میں دن کی روشنی میں دس ہزار قدوسیوں کے ساتھ فاتحانہ شان سے داخل ہوئے اور کوئی مقابلے میں نہ ٹھہر سکا۔ پھر چند سال بعد ہی ساری دنیا نے اپنی آنکھوں سے دیکھ لیا کہ مسلمان صرف عرب ہی نہیں بلکہ روم، مصر اور ایران وغیرہ پر بھی غالب آ گئے۔"
    },
    {
      "ayah": 175,
      "tafsir": "(آیت 175،174) {فَتَوَلَّ عَنْهُمْ حَتّٰى حِيْنٍ …:} ’’ایک وقت‘‘ سے مراد یہ بھی ہو سکتا ہے کہ جب تک ہم آپ کو جنگ کی اجازت نہیں دیتے آپ انھیں ان کے حال پر چھوڑے رکھیں، بس زبانی طور پر دعوت و تبلیغ کا کام کرتے رہیں اور انھیں دیکھتے جائیں، بہت جلد یہ اپنا انجام دیکھ لیں گے۔ یاد رہے، یہ آیات مکی دور کی ہیں۔ اور ’’ایک وقت‘‘ سے ’’یوم بدر‘‘ بھی مراد ہو سکتا ہے اور فتح مکہ بھی۔ چنانچہ ایسا ہی ہوا، ہجرت کے بعد جب جہاد شروع ہوا تو کچھ زیادہ مدت نہ گزری تھی کہ کفار نے اپنی شکست اور مسلمانوں کی فتح کو اپنی آنکھوں سے دیکھ لیا اور ان آیات کے اترنے کے بعد چودہ، پندرہ سال ہی گزرے تھے کہ رسول اللہ صلی اللہ علیہ وسلم جس مکہ سے چھپ کر نکلے تھے، اسی مکہ میں دن کی روشنی میں دس ہزار قدوسیوں کے ساتھ فاتحانہ شان سے داخل ہوئے اور کوئی مقابلے میں نہ ٹھہر سکا۔ پھر چند سال بعد ہی ساری دنیا نے اپنی آنکھوں سے دیکھ لیا کہ مسلمان صرف عرب ہی نہیں بلکہ روم، مصر اور ایران وغیرہ پر بھی غالب آ گئے۔"
    },
    {
      "ayah": 176,
      "tafsir": "(آیت 176) {اَفَبِعَذَابِنَا يَسْتَعْجِلُوْنَ:} قرآن مجید میں کفار کو جب بھی عذاب کی دھمکی دی جاتی وہ جھٹلانے کے لیے اسے فوراً لانے کا مطالبہ کرتے، جیسا کہ سورۂ یونس میں ہے : « مَتٰى هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ» [ یونس : ۴۸ ] ’’یہ وعدہ کب پورا ہو گا، اگر تم سچے ہو؟‘‘ بلکہ اللہ تعالیٰ سے دعا کرنے لگے کہ اگر اسلام واقعی اس کی طرف سے حق ہے تو وہ ان پر پتھر برسائے یا عذاب الیم لے آئے۔ (دیکھیے سورۂ انفال : ۳۳) اس لیے فرمایا کہ پھر کیا یہ لوگ سرکشی اور جہالت میں اس حد تک پہنچ گئے اور اس قدر بے خوف ہو گئے ہیں کہ ہمارا عذاب جلدی لانے کا مطالبہ کر رہے ہیں۔"
    },
    {
      "ayah": 177,
      "tafsir": "(آیت 177) {فَاِذَا نَزَلَ بِسَاحَتِهِمْ … :} یعنی یہ عذاب ہر حال میں ان پر آکر رہے گا۔ پھر جب وہ ان کے صحن میں اتر آیا تو جن لوگوں کو عذاب سے ڈرایا جا رہا ہے اور وہ جھٹلا رہے ہیں ان کی صبح بری ہو گی۔ صبح کا لفظ خاص طور پر اس لیے ذکر فرمایا کہ عرب عموماً صبح کے وقت حملہ کرتے تھے اور رسول اللہ صلی اللہ علیہ وسلم کا معمول بھی یہی تھا۔ چنانچہ انس رضی اللہ عنہ بیان کرتے ہیں : [ أَنَّ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ خَرَجَ إِلٰی خَيْبَرَ فَجَاءَهَا لَيْلاً، وَ كَانَ إِذذَا جَاءَ قَوْمًا بِلَيْلٍ لاَ يُغِيْرُ عَلَيْهِمْ حَتّٰی يُصْبِحَ، فَلَمَّا أَصْبَحَ، خَرَجَتْ يَهُوْدُ بِمَسَاحِيْهِمْ وَ مَكَاتِلِهِمْ، فَلَمَّا رَأَوْهُ قَالُوْا مُحَممَّدٌ وَاللّٰهِ! مُحَمَّدٌ وَ الْخَمِيْسُ فَقَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ اَللّٰهُ أَكْبَرُ، خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِيْنَ ] [بخاري، الجہاد والسیر، باب دعاء النبي صلی اللہ علیہ وسلم إلی الإسلام… : ۲۹۴۵ ] ’’نبی صلی اللہ علیہ وسلم خیبر کی طرف نکلے اور رات وہاں پہنچے اور آپ جب کسی قوم کے پاس رات کو پہنچتے تو صبح ہونے تک حملہ نہیں کرتے تھے۔ جب صبح ہوئی تو یہودی اپنی بیلچے اور ٹوکریاں لے کر نکلے۔ جب انھوں نے آپ صلی اللہ علیہ وسلم کو دیکھا تو کہنے لگے : ’’محمد، اللہ کی قسم! محمد اپنے لشکر کے ساتھ (آ گئے)۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ اکبر! خیبر برباد ہو گیا، ہم لوگ جب کسی قوم کے صحن میں اترتے ہیں تو ان لوگوں کی صبح بری ہوتی ہے جنھیں پہلے ڈرایا جا چکا ہوتا ہے۔‘‘ اللہ تعالیٰ کی طرف سے بھی عذاب عموماً صبح کے وقت آتا تھا، جیسے قومِ لوط کے متعلق فرمایا : « اِنَّ مَوْعِدَهُمُ الصُّبْحُ اَلَيْسَ الصُّبْحُ بِقَرِيْبٍ » [ ھود : ۸۱ ] ’’بے شک ان کے وعدے کا وقت صبح ہے، کیا صبح واقعی قریب نہیں؟‘‘"
    },
    {
      "ayah": 178,
      "tafsir": "(آیت 179،178) {وَ تَوَلَّ عَنْهُمْ حَتّٰى حِيْنٍ … :} تاکید کے لیے بات دوبارہ دہرائی، تاکہ آپ صلی اللہ علیہ وسلم کو تسلی ہو اور شاید کفار عبرت حاصل کرلیں۔ یہاں صرف {’’ اَبْصِرْ ‘‘} فرمایا، {’’أَبْصِرْهُمْ‘‘} نہیں فرمایا، اس لیے کہ پہلے ان کا ذکر ہو چکا ہے، یا اس لیے کہ پہلے صرف کفار مکہ کو دیکھنے کا حکم ہے، اب عموم کے لیے {’’هُمْ‘‘} کو حذف کر دیا کہ صرف کفار قریش ہی کو نہیں بلکہ سب جھٹلانے والوں کو اور ان کے ہر حال کو دیکھتے جاؤ، بہت جلد وہ بھی انجام دیکھ لیں گے۔"
    },
    {
      "ayah": 179,
      "tafsir": "(آیت 179،178) {وَ تَوَلَّ عَنْهُمْ حَتّٰى حِيْنٍ … :} تاکید کے لیے بات دوبارہ دہرائی، تاکہ آپ صلی اللہ علیہ وسلم کو تسلی ہو اور شاید کفار عبرت حاصل کرلیں۔ یہاں صرف {’’ اَبْصِرْ ‘‘} فرمایا، {’’أَبْصِرْهُمْ‘‘} نہیں فرمایا، اس لیے کہ پہلے ان کا ذکر ہو چکا ہے، یا اس لیے کہ پہلے صرف کفار مکہ کو دیکھنے کا حکم ہے، اب عموم کے لیے {’’هُمْ‘‘} کو حذف کر دیا کہ صرف کفار قریش ہی کو نہیں بلکہ سب جھٹلانے والوں کو اور ان کے ہر حال کو دیکھتے جاؤ، بہت جلد وہ بھی انجام دیکھ لیں گے۔"
    },
    {
      "ayah": 180,
      "tafsir": "(آیت 180تا182) {سُبْحٰنَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُوْنَ … :} چونکہ اس سورت میں اللہ تعالیٰ کے متعلق کفار کے برے اقوال، مثلاً اس کی اولاد یا اس کے شرکاء بنانے کا ذکر ہے، اس لیے آخر میں ان کی ایسی تمام باتوں سے اللہ تعالیٰ کے پاک ہونے کا ذکر فرمایا۔ گویا یہ ان کے شرکیہ عقائد و اقوال کی تردید اور انبیاء اور ان کی اقوام کے احوال کے ذکر کے بعد پوری سورت کا خلاصہ ہے کہ اللہ تعالیٰ کی ذات و صفات کے متعلق ان لوگوں نے جو باتیں گھڑ رکھی ہیں، جن سے اللہ تعالیٰ کی ذات یا صفات میں کوئی عیب یا نقص لازم آتا ہے، اللہ کی ذات ایسے تمام عیوب اور نقائص سے پاک ہے، کیونکہ وہ ساری عزت کا مالک ہے اور رسولوں پر سلام ہے کہ وہ اپنی اپنی قوموں سے تکالیف برداشت کرکے بھی مسلسل اللہ کی توحید پیش کرتے رہے۔ اور ہر بات اس پر ختم ہوتی ہے کہ جو خوبی اور جو تعریف بھی ہے وہ اللہ کی ہے، کیونکہ وہی تمام جہانوں کی پرورش کرنے والا ہے۔ کسی اور میں کوئی خوبی ہے تو بھی اسی کی ہے، کیونکہ وہ اسی کی عطا کردہ ہے۔"
    },
    {
      "ayah": 181,
      "tafsir": "(آیت 180تا182) {سُبْحٰنَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُوْنَ … :} چونکہ اس سورت میں اللہ تعالیٰ کے متعلق کفار کے برے اقوال، مثلاً اس کی اولاد یا اس کے شرکاء بنانے کا ذکر ہے، اس لیے آخر میں ان کی ایسی تمام باتوں سے اللہ تعالیٰ کے پاک ہونے کا ذکر فرمایا۔ گویا یہ ان کے شرکیہ عقائد و اقوال کی تردید اور انبیاء اور ان کی اقوام کے احوال کے ذکر کے بعد پوری سورت کا خلاصہ ہے کہ اللہ تعالیٰ کی ذات و صفات کے متعلق ان لوگوں نے جو باتیں گھڑ رکھی ہیں، جن سے اللہ تعالیٰ کی ذات یا صفات میں کوئی عیب یا نقص لازم آتا ہے، اللہ کی ذات ایسے تمام عیوب اور نقائص سے پاک ہے، کیونکہ وہ ساری عزت کا مالک ہے اور رسولوں پر سلام ہے کہ وہ اپنی اپنی قوموں سے تکالیف برداشت کرکے بھی مسلسل اللہ کی توحید پیش کرتے رہے۔ اور ہر بات اس پر ختم ہوتی ہے کہ جو خوبی اور جو تعریف بھی ہے وہ اللہ کی ہے، کیونکہ وہی تمام جہانوں کی پرورش کرنے والا ہے۔ کسی اور میں کوئی خوبی ہے تو بھی اسی کی ہے، کیونکہ وہ اسی کی عطا کردہ ہے۔"
    },
    {
      "ayah": 182,
      "tafsir": "(آیت 180تا182) {سُبْحٰنَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُوْنَ … :} چونکہ اس سورت میں اللہ تعالیٰ کے متعلق کفار کے برے اقوال، مثلاً اس کی اولاد یا اس کے شرکاء بنانے کا ذکر ہے، اس لیے آخر میں ان کی ایسی تمام باتوں سے اللہ تعالیٰ کے پاک ہونے کا ذکر فرمایا۔ گویا یہ ان کے شرکیہ عقائد و اقوال کی تردید اور انبیاء اور ان کی اقوام کے احوال کے ذکر کے بعد پوری سورت کا خلاصہ ہے کہ اللہ تعالیٰ کی ذات و صفات کے متعلق ان لوگوں نے جو باتیں گھڑ رکھی ہیں، جن سے اللہ تعالیٰ کی ذات یا صفات میں کوئی عیب یا نقص لازم آتا ہے، اللہ کی ذات ایسے تمام عیوب اور نقائص سے پاک ہے، کیونکہ وہ ساری عزت کا مالک ہے اور رسولوں پر سلام ہے کہ وہ اپنی اپنی قوموں سے تکالیف برداشت کرکے بھی مسلسل اللہ کی توحید پیش کرتے رہے۔ اور ہر بات اس پر ختم ہوتی ہے کہ جو خوبی اور جو تعریف بھی ہے وہ اللہ کی ہے، کیونکہ وہی تمام جہانوں کی پرورش کرنے والا ہے۔ کسی اور میں کوئی خوبی ہے تو بھی اسی کی ہے، کیونکہ وہ اسی کی عطا کردہ ہے۔"
    }
  ]
}