{
  "surah": "Saad",
  "surah_number": 38,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { صٓ وَ الْقُرْاٰنِ ذِي الذِّكْرِ: ’’ صٓ ‘‘} حروف مقطعات میں سے ہے، اس کی وضاحت کے لیے دیکھیے سورۂ بقرہ کی پہلی آیت۔ ¤ ➋ { وَ الْقُرْاٰنِ ذِي الذِّكْرِ:’’ الْقُرْاٰنِ ‘‘} میں الف لام عہد کا ہے، اس لیے ترجمہ ’’اس قرآن‘‘ کیا ہے۔ {’’ الذِّكْرِ ‘‘} کا معنی عزّ و شرف بھی ہو سکتا ہے، نصیحت بھی اور اللہ تعالیٰ کا اور ان تمام چیزوں کا ذکر بھی جن کی انسان کو نجات کے لیے ضرورت ہے۔ یہاں تینوں معانی بیک وقت مراد ہو سکتے ہیں، کیونکہ یہ قرآن کمال عزّو شرف والا بھی ہے، نصیحت والا بھی ہے اور اس میں ان تمام چیزوں کا ذکر بھی ہے جن کی ضرورت ہے۔ مزید تفصیل کے لیے دیکھیے سورۂ انبیاء کی آیت (۱۰) : « لَقَدْ اَنْزَلْنَاۤ اِلَيْكُمْ كِتٰبًا فِيْهِ ذِكْرُكُمْ» کی تفسیر۔ ¤ ➌ ’’اس نصیحت والے قرآن کی قسم‘‘ اس کا جوابِ قسم یہاں ذکر نہیں ہوا۔ اگلے جملے {’’ بَلِ الَّذِيْنَ كَفَرُوْا ‘‘} سے نئی بات شروع ہو گئی ہے، جس سے قسم کا جواب سمجھ میں آ رہا ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {بَلِ الَّذِيْنَ كَفَرُوْا فِيْ عِزَّةٍ وَّ شِقَاقٍ:’’ عِزَّةٍ ‘‘} سے مراد خود ساختہ عزت، یعنی تکبّر ہے، جیسا کہ فرمایا : « وَ اِذَا قِيْلَ لَهُ اتَّقِ اللّٰهَ اَخَذَتْهُ الْعِزَّةُ بِالْاِثْمِ» [ البقرۃ : ۲۰۶ ] ’’اور جب اس سے کہا جاتا ہے اللہ سے ڈر تو اس کی عزت اسے گناہ میں پکڑے رکھتی ہے۔‘‘ {’’ شِقَاقٍ ‘‘ ’’شَقٌّ‘‘} سے باب مفاعلہ کا مصدر ہے، کسی کا دوسرے کے مقابلے میں اس طرح آنا کہ یہ ایک شق (طرف) میں ہو اور وہ دوسری شق میں، یعنی شدید مخالفت اور عداوت۔ اس جملے سے {’’ وَ الْقُرْاٰنِ ذِي الذِّكْرِ ‘‘} کا جواب قسم ظاہر ہو رہا ہے : {’’أَيْ إِنَّ كُفْرَهُمْ لَيْسَ بِبُرْههَانٍ بَلْ هُوَ بِسَبَبِ عِزَّةٍ وَّ شِقَاقٍ‘‘} کہ اس عزّو شرف والے، نصیحت سے بھرپور اور نجات کے لیے ضروری ہر بات پر مشتمل قرآن کی قسم ہے کہ کفار کا کفر کسی دلیل یا معقول وجہ سے نہیں، بلکہ محض تکبرّ اور شدید مخالفت کی وجہ سے ہے۔ قسم عموماً جواب قسم کی دلیل ہوتی ہے، مطلب یہ کہ ان اوصاف والا «ذِي الذِّكْرِ» قرآن شاہد اور دلیل ہے کہ اسے نہ ماننے والوں کے کفر کا باعث کوئی دلیل یا معقول وجہ نہیں بلکہ اس کی وجہ محض عزت و شقاق ہے۔ {’’ عِزَّةٍ ‘‘} اور {’’ شِقَاقٍ ‘‘} پر تنوین تکبر اور مخالفت کی شدت کے اظہار کے لیے ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {كَمْ اَهْلَكْنَا مِنْ قَبْلِهِمْ مِّنْ قَرْنٍ :} اس آیت میں قریش اور اس امت کے تمام کفار کو پہلی امتوں کے تکبرّ اور انکار کے انجام بد سے ڈرایا ہے۔ {’’ اَهْلَكْنَا ‘‘} جمع متکلم کا لفظ اپنی عظمت کے اظہار کے لیے لائے ہیں۔ {’’ قَرْنٍ ‘‘} زمانے کی اتنی مدت جس میں ایک دوسرے سے ملنے والی ایک نسل ختم ہو جائے۔ راجح قول کے مطابق یہ مدت سو سال ہے، مراد ایک زمانے کے لوگ ہیں۔ {’’ كَمْ ‘‘} خبریہ ہے، مطلب یہ ہے کہ ہم نے ان سے پہلے بہت سی نسلوں اور قوموں کو ہلاک کر دیا۔ ¤ ➋ { فَنَادَوْا وَّ لَاتَ حِيْنَ مَنَاصٍ : ’’ لَاتَ ‘‘ ’’لَا‘‘} نافیہ ہی ہے، جس پر مبالغہ کے لیے ’’تاء‘‘ کا اضافہ کیا گیا ہے۔ یہ ہمیشہ لفظ {’’ حِيْنَ ‘‘} یا وقت کا معنی دینے والے الفاظ پر آتا ہے۔ اس کا اسم محذوف ہے اور {’’ حِيْنَ مَنَاصٍ ‘‘} اس کی خبر ہے۔ گویا عبارت یہ ہے : {’’وَلَاتَ الْحِيْنُ حِيْنَ مَنَاصٍ۔‘‘ ’’ مَنَاصٍ ‘‘ ’’نَاصَ يَنُوْصُ نَوْصًا‘‘} سے مصدر میمی ہے۔ اس کا معنی {”فَرَّ مِنْ فُلَانٍ“} کسی سے بھاگ جانا بھی ہے اور {’’نَجَا وَ فَاتَ‘‘} (بچ کر نکل جانا بھی) مطلب یہ ہے کہ جب ان قوموں نے ہماری طرف سے آنے والی ہلاکت اور عذاب کی نشانیوں  کو دیکھا تو انھوں نے پکارا، یعنی مدد کے لیے اور ہلاکت سے بچانے کے لیے پکارا اور ایمان لانے کا اقرار کیا مگر وہ وقت ہمارے عذاب سے بھاگنے یا بچ نکلنے کا نہیں تھا، کیونکہ ہمارا قاعدہ ہے کہ جب ہمارا عذاب آ جائے تو پھر ایمان لانے یا توبہ کرنے کا کوئی فائدہ نہیں ہوتا۔ اس آیت کی ہم معنی آیات کے لیے دیکھیے سورۂ مؤمنون (۶۴، ۶۵)، مؤمن (۸۴، ۸۵) اور انبیاء (۱۱ تا ۱۳)۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {وَ عَجِبُوْۤا اَنْ جَآءَهُمْ مُّنْذِرٌ مِّنْهُمْ :} یعنی انھیں اس بات پر تعجب ہو رہا ہے کہ ان کے پاس ڈرانے اور خبردار کرنے کے لیے اسے بھیجا گیا جو ان کی جنس انسان سے ہے، ان کی قوم عرب سے ہے اور ان کے قبیلے قریش سے ہے، حالانکہ عجیب بات تو اس وقت ہوتی جب کوئی فرشتہ یا عجمی ان کی طرف بھیجا جاتا۔ تفصیل کے لیے دیکھیے سورۂ آل عمران (۱۶۴)، توبہ (۱۲۸) اور سورۂ یونس (۲) کی تفسیر۔ ¤ ➋ {وَ قَالَ الْكٰفِرُوْنَ هٰذَا سٰحِرٌ كَذَّابٌ: ’’كَفَرَ يَكْفُرُ‘‘} کا معنی انکار بھی ہے اور چھپانا بھی۔ یہاں {’’وَقَالُوْا‘‘} (اور انھوں نے کہا) کے بجائے {’’ وَ قَالَ  الْكٰفِرُوْنَ ‘‘} (اور کافروں نے کہا) کہنے کا مطلب یہ ہے کہ ان لوگوں کا رسول اللہ صلی اللہ علیہ وسلم کو ساحر اور کذّاب کہنا محض ان کے حق کو چھپانے اور جانتے بوجھتے ہوئے اس کے انکار کی وجہ سے ہے، ورنہ یہ تو آپ کو صادق اور امین کہتتے تھے۔ دیکھیے سورۂ یونس کی آیت (۱۶) : « فَقَدْ لَبِثْتُ فِيْكُمْ عُمُرًا مِّنْ قَبْلِهٖ» اور سورۂ انعام (۳۳) کی تفسیر۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { اَجَعَلَ الْاٰلِهَةَ اِلٰهًا وَّاحِدًا :} یعنی کیا ایک ’’اللہ‘‘ ہی ساری کائنات کا نظام چلا رہا ہے اور وہ ایک ہی عبادت کا مستحق ہے، یہ کیسے ہو سکتا ہے؟ اس نے تو وہ سارے دیوتا اور داتا و دستگیر ہی ختم کر دیے جنھیں دنیا مانتی چلی آئی ہے۔ ¤ ➋ {اِنَّ هٰذَا لَشَيْءٌ عُجَابٌ:’’ عُجَابٌ ‘‘} عجیب کے معنی میں ہے، مگر اس میں مبالغہ زیادہ ہے، جیسا کہ لمبے آدمی کو ’’طویل‘‘ کہتے ہیں اور زیادہ ہی لمبا ہو تو اسے ’’طُوال‘‘ کہتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم کا ایک اللہ کی عبادت کی دعوت دینا ان کی نظر میں حد سے زیادہ عجیب بات تھی، کیونکہ ان کے نزدیک اپنے آباء سے سنی ہوئی بات کے خلاف کوئی بات انتہائی عجیب بات تھی، جیسا کہ ان کی زبانی آگے آ رہا ہے۔ ان لوگوں کو عقیدۂ توحید عجیب معلوم ہو رہا تھا، حالانکہ تعجب کی چیز عقیدۂ شرک ہے، جس پر نہ کوئی عقلی دلیل موجود ہے نہ نقلی۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {وَ انْطَلَقَ الْمَلَاُ مِنْهُمْ …: ’’ الْمَلَاُ ‘‘} کی وضاحت کے لیے دیکھیے سورۂ بقرہ (۲۴۶) یعنی کفار کے سرکردہ اور بڑے لوگ توحید کی دعوت سن کر آپ کی مجلس سے یہ کہہ کر چل کھڑے ہوئے کہ اپنے دین اور طریقے پر چلتے رہو اور اپنے معبودوں پر ڈٹے رہو، جیسا کہ قوم نوح نے کہا تھا : «لَا تَذَرُنَّ اٰلِهَتَكُمْ وَ لَا تَذَرُنَّ وَدًّا وَّ لَا سُوَاعًا وَّ لَا يَغُوْثَ وَ يَعُوْقَ وَ نَسْرًا » [ نوح : ۲۳ ] ’’تم ہرگز اپنے معبودوں کو نہ چھوڑنا اور نہ کبھی وَدّ کو چھوڑنا اور نہ سُواع کو اور نہ یغوث اور یعوق اور نسر کو۔‘‘ ¤ ➋ بعض مفسرین نے فرمایا کہ یہ لوگ ایک دوسرے کو باطل اور شرک پر ڈٹے رہنے کی اتنی تاکید کر رہے ہیں، اہلِ حق کو تو اس سے زیادہ حق پر قائم رہنا چاہیے اور ایک دوسرے کو قائم رہنے کی تاکید کرنی چاہیے، جیسا کہ اللہ تعالیٰ نے فرمایا : «وَ الْعَصْرِ (1) اِنَّ الْاِنْسَانَ لَفِيْ خُسْرٍ (2) اِلَّا الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ وَ تَوَاصَوْا بِالْحَقِّ وَ تَوَاصَوْا بِالصَّبْرِ» [ العصر : ۱ تا ۳ ] ’’زمانے کی قسم! کہ بے شک ہر انسان یقینا گھاٹے میں ہے۔ سوائے ان لوگوں کے جو ایمان لائے اور انھوں نے نیک اعمال کیے اور ایک دوسرے کو حق کی وصیت کی اور ایک دوسرے کو صبر کی وصیت کی۔‘‘ ¤ ➌ { اِنَّ هٰذَا لَشَيْءٌ يُّرَادُ :} یعنی اس نے ہمارے سامنے جو کلمہ توحید پیش کیا ہے یہ ایسی چیز ہے جس کے اعلان کا اور اسے ہر حال میں نافذ کرنے کا ارادہ کیا جا چکا ہے، اب اسے اس سے باز رکھنے کی کوئی صورت نہیں، اس لیے اسے اس کے حال پر چھوڑو اور اپنے معبودوں پر جمے رہو۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {مَا سَمِعْنَا بِهٰذَا فِي الْمِلَّةِ الْاٰخِرَةِ:} آخری ملت سے مراد ان کے قریب کے آبا و اجداد ہیں، کیونکہ اصل دینِ ابراہیم( علیہ السلام ) تو توحید پر قائم تھا۔ یہ عمرو بن لحی خزاعی تھا جس نے عرب میں بت پرستی کو رواج دیا، حتیٰ کہ عین کعبہ میں ابراہیم اور اسماعیل علیھما السلام کی مورتیوں کے ہاتھ میں فال کے تیر رکھ دیے گئے۔ شاہ عبد القادر لکھتے ہیں : ’’پچھلا دین (آخری ملت) کہتے تھے اپنے باپ دادوں کو، یعنی آگے تو سنے ہیں کہ اگلے لوگ ایسی باتیں کہتے، پر ہمارے بزرگ تو یوں نہیں کہہ گئے۔‘‘ (موضح) بعض مفسرین نے فرمایا کہ آخری ملت سے مراد عیسائی ہیں، کیونکہ آپ صلی اللہ علیہ وسلم سے پہلے سب سے آخر میں آنے والے نبی عیسیٰ علیہ السلام ہی تھے، یعنی ہم نے نصاریٰ میں بھی توحید کی بات نہیں سنی، بلکہ وہ بھی تین خداؤں کے قائل ہیں۔ ¤ ➋ { اِنْ هٰذَاۤ اِلَّا اخْتِلَاقٌ : ’’ اخْتِلَاقٌ ‘‘} مصدر بمعنی اسم مفعول برائے مبالغہ ہے، یعنی یہ محض گھڑی ہوئی بات ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {ءَاُنْزِلَ عَلَيْهِ الذِّكْرُ مِنْۢ بَيْنِنَا:} یہ ہے وہ اصل بات جس سے ان کے نبی صلی اللہ علیہ وسلم کی نبوت تسلیم نہ کرنے کی وجہ ظاہر ہو رہی ہے اور وہ ہے آپ صلی اللہ علیہ وسلم پر حسد اور حسد کی وجہ سے عداوت کہ اللہ تعالیٰ نے ہم سرداروں اور چودھریوں کو چھوڑ کر آپ صلی اللہ علیہ وسلم کو اس بلند منصب کے لیے کیوں چنا؟ اللہ تعالیٰ نے ان کے اس حسد اور عداوت کا کئی جگہ ذکر فرمایا اور اس کا رد فرمایا، جیسا کہ فرمایا : « وَ اِذَا جَآءَتْهُمْ اٰيَةٌ قَالُوْا لَنْ نُّؤْمِنَ حَتّٰى نُؤْتٰى مِثْلَ مَاۤ اُوْتِيَ رُسُلُ اللّٰهِ اَللّٰهُ اَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهٗ» [ الأنعام : ۱۲۴ ] ’’اور جب ان کے پاس کوئی نشانی آتی ہے تو کہتے ہیں ہم ہر گز ایمان نہیں لائیں گے، یہاں تک کہ ہمیں اس جیسا دیا جائے جو اللہ کے رسولوں کو دیا گیا، اللہ زیادہ جاننے والا ہے جہاں وہ اپنی رسالت رکھتا ہے۔‘‘ اور فرمایا : «وَ قَالُوْا لَوْ لَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيْمٍ (31) اَهُمْ يَقْسِمُوْنَ رَحْمَتَ رَبِّكَ» [ الزخرف : ۳۱، ۳۲ ] ’’ اور انھوں نے کہا یہ قرآن ان دو بستیوں میں سے کسی بڑے آدمی پر کیوں نازل نہ کیا گیا؟ کیا وہ تیرے رب کی رحمت تقسیم کرتے ہیں؟‘‘ اسی حسد کا اظہار قوم ثمود نے صالح علیہ السلام پر کیا تھا : « ءَاُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْۢ بَيْنِنَا بَلْ هُوَ كَذَّابٌ اَششِرٌ (25) سَيَعْلَمُوْنَ غَدًا مَّنِ الْكَذَّابُ الْاَشِرُ » [ القمر : ۲۵، ۲۶ ] ’’کیا یہ نصیحت ہمارے درمیان میں سے اسی پر نازل کی گئی ہے؟ بلکہ وہ بہت جھوٹا ہے، متکبر ہے۔ عنقریب وہ کل جان لیں گے کہ بہت جھوٹا، متکبّر کون ہے؟‘‘ ¤ ➋ { بَلْ هُمْ فِيْ شَكٍّ مِّنْ ذِكْرِيْ: ’’ شَكٍّ ‘‘} سے مراد ذہن کی وہ کیفیت ہے جس میں آدمی دو چیزوں میں سے کسی ایک چیز کو ترجیح نہ دے سکے۔ اللہ تعالیٰ نے اس جملے میں ان کے دل کی حالت بیان فرمائی ہے کہ ان کے پاس میرے ذکر کو جھٹلانے کی کوئی معقول وجہ نہیں مگر وہ حسد کی وجہ سے اس پر غور کرنے کے لیے تیار نہیں، اس لیے وہ اس کے بارے میں شک میں مبتلا ہیں۔ اگر حسد چھوڑ کر تھوڑا سا غور کریں تو انھیں یقین کی نعمت حاصل ہو جائے۔ اللہ تعالیٰ نے صالح علیہ السلام کی قوم کا حال خود ان کی زبانی یہی بیان فرمایا ہے۔ دیکھیے سورۂ ہود (۶۲)۔ ¤ ➌ {بَلْ لَّمَّا يَذُوْقُوْا عَذَابِ : ’’لَمْ يَذُوْقُوْا‘‘} انھوں نے نہیں چکھا اور {’’ لَمَّا يَذُوْقُوْا ‘‘} انھوں نے ابھی تک نہیں چکھا۔ {’’ عَذَابِ ‘‘} اصل میں {’’عَذَابِيْ‘‘} (میرا عذاب) ہے۔ آیات کے فواصل کی موافقت کے لیے یاء حذف کرکے کسرہ باقی رہنے دیا ہے۔ یعنی ان کے ایسی باتیں کرنے کی وجہ یہ نہیں کہ ان میں کوئی حقیقت ہے، بلکہ اس کی وجہ یہ ہے کہ انھوں نے ابھی تک میری مار نہیں چکھی۔ جب میری مار پڑی تو ان کے سب کَس بَل نکل جائیں گے اور انھیں ایسی باتیں کرنے کا ہوش نہیں رہے گا۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { اَمْ عِنْدَهُمْ خَزَآىِٕنُ رَحْمَةِ رَبِّكَ … :} یہ ان کی اس بات کا جواب ہے کہ ہم میں سے اسی پر یہ ذکر کیوں نازل کیا گیا۔ فرمایا، کیا تیرے عزیز و وہّاب رب کی رحمت کے خزانے ان کے پاس ہیں کہ جس کو جو نعمت چاہیں دیں، جسے چاہیں نہ دیں اور جسے یہ چاہیں اسے نبوت کا بلند منصب عطا کریں؟ نہیں، ہر گز نہیں! بلکہ اللہ تعالیٰ اپنی رحمت کے خزانوں کا اکیلا خود مالک ہے، اپنی رسالت کے لیے جسے چاہتا ہے چُن لیتا ہے اور جسے چاہتا ہے محروم رکھتا ہے۔ اب اگر اس نے اپنی نعمت رسالت کے لیے آپ کو چُنا ہے تو یہ حسد کیوں کرتے ہیں؟ اس اعتراض کا یہی جواب سورۂ انعام (۱۲۴) اور زخرف (۳۱، ۳۲) میں دیا گیا ہے، جیسا کہ اس سے پہلی آیت کے پہلے فائدے میں گزر چکا ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {اَمْ لَهُمْ مُّلْكُ السَّمٰوٰتِ وَ الْاَرْضِ … : ’’ لَهُمْ ‘‘} پہلے آنے سے حصر پیدا ہو گیا ہے۔ یعنی یا پھر اللہ تعالیٰ کے بجائے زمین و آسمان کی سلطنت کے مالک یہی ہیں کہ جسے جو چاہیں دیں، جو چاہیں نہ دیں؟ تو پھر زمین پر کیوں پھرتے ہیں، آسمان کی سیڑھیوں پر چڑھیں، زمین و آسمان کی ساری سلطنت سنبھالیں اور اللہ تعالیٰ کے بجائے خود جسے چاہیں نبوت دیں جسے چاہیں نہ دیں؟ ظاہر ہے ایسا نہیں، تو پھر ایسی بے ہودہ باتیں کیوں کرتے ہیں؟"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {جُنْدٌ مَّا هُنَالِكَ مَهْزُوْمٌ مِّنَ الْاَحْزَابِ : ’’ جُنْدٌ ‘‘} پر تنوین تقلیل و تحقیر کے لیے ہے اور {’’ مَا ‘‘} اس کی مزید تاکید کے لیے ہے، جیسے کہا جاتا ہے : {’’أَكَلْتُ شَيْئًا مَا، أَيْ شَيْئًا قَلِيْلًا‘‘} ’’میںں نے تھوڑی سی چیز کھائی۔‘‘ {’’ جُنْدٌ مَّا ‘‘} ایک حقیر سا لشکر۔ {’’ هُنَالِكَ ‘‘} وہاں، اس جگہ، یعنی اللہ تعالیٰ کے رسول کے مقابلے میں۔ {’’ الْاَحْزَابِ ‘‘ ’’حِزْبٌ‘‘} کی جمع ہے، یعنی مختلف لشکر، جماعتیں۔ یعنی خدائی اختیارات کی ڈینگیں مارنے والے اور مختلف جماعتوں اور لشکروں سے جمع ہونے والے اس حقیر سے لشکر کی بساط ہی کیا ہے۔ یہ تو جب بھی میدان میں آ یا شکست کھانے والا ہے، جیسا کہ سورۂ قمر میں فرمایا : « سَيُهْزَمُ الْجَمْعُ وَ يُوَلُّوْنَ الدُّبُرَ » [ القمر : ۴۵ ] ’’عنقریب یہ جماعت شکست کھائے گی اور یہ لوگ پیٹھیں پھیر کر بھاگیں گے۔‘‘ بدر کے دن آپ صلی اللہ علیہ وسلم {’’ سَيُهْزَمُ الْجَمْعُ وَ يُوَلُّوْنَ الدُّبُرَ ‘‘} کہتے ہوئے میدان کی طرف بڑھے، پھر احد، خندق، فتح مکہ ہر موقع پر ایسا ہی ہوا کہ لشکر کفار نے منہ کی کھائی۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 13،12) ➊ {كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّ عَادٌ …:} یعنی ان بے چارے قریش اور ان کی ہمنوا جماعتوں کی کیا حیثیت ہے، ان سے پہلے تعداد اور قوت و شوکت میں ان سے کہیں زیادہ اقوام، یعنی قومِ نوح، میخوں والا فرعون، عاد، ثمود، قومِ لوط اور اصحاب الایکہ وہ بڑے بڑے لشکر تھے جن میں سے ہر ایک نے رسولوں کو جھٹلایا تو ان پر میرا عذاب واقع ہو گیا۔ ¤ ➋ { وَ فِرْعَوْنُ ذُو الْاَوْتَادِ : ’’ الْاَوْتَادِ ‘‘ ’’وَتَدٌ‘‘} کی جمع ہے، میخ۔ فرعون کو میخوں والا کہنے کا مطلب یا تو یہ ہے کہ وہ جس سے ناراض ہوتا تھا اس کے ہاتھ پاؤں میں میخیں ٹھکوا کر سزا دیا کرتا تھا، یا یہ کہ اس کی سلطنت ایسی مضبوط تھی گویا زمین میں میخیں ٹھکی ہوئی ہیں، یا اس کا لشکر اتنا زیادہ تھا کہ جہاں ٹھہرتا ہر طرف خیموں کی میخیں ہی میخیں نظر آتیں۔ یہ بھی ہو سکتا ہے کہ اس کی بنائی ہوئی عمارتیں زمین میں میخوں کی طرح ٹھکی ہوئی ہوں، جیسا کہ اہرام مصر ہزاروں سال سے زمین کے اندر گڑے ہوئے ہیں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13،12) ➊ {كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّ عَادٌ …:} یعنی ان بے چارے قریش اور ان کی ہمنوا جماعتوں کی کیا حیثیت ہے، ان سے پہلے تعداد اور قوت و شوکت میں ان سے کہیں زیادہ اقوام، یعنی قومِ نوح، میخوں والا فرعون، عاد، ثمود، قومِ لوط اور اصحاب الایکہ وہ بڑے بڑے لشکر تھے جن میں سے ہر ایک نے رسولوں کو جھٹلایا تو ان پر میرا عذاب واقع ہو گیا۔ ¤ ➋ { وَ فِرْعَوْنُ ذُو الْاَوْتَادِ : ’’ الْاَوْتَادِ ‘‘ ’’وَتَدٌ‘‘} کی جمع ہے، میخ۔ فرعون کو میخوں والا کہنے کا مطلب یا تو یہ ہے کہ وہ جس سے ناراض ہوتا تھا اس کے ہاتھ پاؤں میں میخیں ٹھکوا کر سزا دیا کرتا تھا، یا یہ کہ اس کی سلطنت ایسی مضبوط تھی گویا زمین میں میخیں ٹھکی ہوئی ہیں، یا اس کا لشکر اتنا زیادہ تھا کہ جہاں ٹھہرتا ہر طرف خیموں کی میخیں ہی میخیں نظر آتیں۔ یہ بھی ہو سکتا ہے کہ اس کی بنائی ہوئی عمارتیں زمین میں میخوں کی طرح ٹھکی ہوئی ہوں، جیسا کہ اہرام مصر ہزاروں سال سے زمین کے اندر گڑے ہوئے ہیں۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) { اِنْ كُلٌّ اِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ:’’ عِقَابِ ‘‘} اصل میں {’’عِقَابِيْ‘‘} ہے، میرا عذاب، میری سزا۔ سورۂ عنکبوت میں ان تمام اقوام کے جھٹلانے کا ذکر کرنے کے بعد فرمایا : « فَكُلًّا اَخَذْنَا بِذَنْۢبِهٖ فَمِنْهُمْ مَّنْ اَرْسَلْنَا عَلَيْهِ حَاصِبًا  وَ مِنْهُمْ مَّنْ اَخَذَتْهُ الصَّيْحَةُ وَ مِنْهُمْ مَّنْ خَسَفْنَا بِهِ الْاَرْضَ وَ مِنْهُمْ مَّنْ اَغْرَقْنَا وَ مَا كَانَ اللّٰهُ لِيَظْلِمَهُمْ وَ لٰكِنْ كَانُوْۤا اَنْفُسَهُمْ يَظْلِمُوْنَ» [ العنکبوت : ۴۰ ] ’’تو ہم نے ہر ایک کو اس کے گناہ میں پکڑ لیا، پھر ان میں سے کوئی وہ تھا جس پر ہم نے پتھراؤ والی ہوا بھیجی اور ان میں سے کوئی وہ تھا جسے چیخ نے پکڑ لیا اور ان میں سے کوئی وہ تھا جسے ہم نے زمین میں دھنسا دیا اور ان میں سے کوئی وہ تھا جسے ہم نے غرق کر دیا اور اللہ ایسا نہ تھا کہ ان پر ظلم کرے اور لیکن وہ خود اپنے آپ پر ظلم کرتے تھے۔‘‘"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) {وَ مَا يَنْظُرُ هٰۤؤُلَآءِ اِلَّا صَيْحَةً …:’’ يَنْظُرُ ‘‘} یہاں {’’يَنْتَظِرُ‘‘} کے معنی میں ہے۔ {’’ صَيْحَةً وَّاحِدَةً ‘‘} (ایک سخت چیخ) سے مراد دوسری دفعہ صور کے نفخہ سے پیدا ہونے والی آواز ہے، کیونکہ پہلے نفخہ کے وقت تک زندہ و موجود رہنے کا انتظار تو کوئی بھی نہیں کرتا۔ {’’ فَوَاقٍ ‘‘ مَا بَيْنَ الْحَلْبَتَيْنِ مِنَ الْوَقْتِ أَوْ مَا بَيْنَ فَتْحِ يَدِكَ وَ قَبْضِهَا عَلَي الضَّرْعِ‘‘} (قاموس) ’’دو دفعہ دودھ دوہنے کے درمیان کا وقفہ یا دودھ دوہتے وقت تھن کو پکڑنے اور چھوڑنے کا درمیانی وقفہ۔‘‘ مراد تھوڑا سا وقفہ ہے۔ مطلب یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو جھٹلانے والے یہ لوگ ایک سخت چیخ کے انتظار میں ہیں، جو شروع ہو گی تو اس میں اس وقت تک کوئی وقفہ نہیں ہو گا جب تک تمام لوگ زندہ ہو کر اللہ کے حضور پیش نہیں ہو جائیں گے، فرمایا : « اِنْ كَانَتْ اِلَّا صَيْحَةً وَّاحِدَةً فَاِذَا هُمْ جَمِيْعٌ لَّدَيْنَا مُحْضَرُوْنَ » [ یٰسٓ : ۵۳ ] ’’نہیں ہو گی وہ مگر ایک ہی چیخ، تو اچانک وہ سب ہمارے پاس حاضر کیے ہوئے ہوں گے۔‘‘ اس میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {وَ قَالُوْا رَبَّنَا عَجِّلْ لَّنَا قِطَّنَا …:’’ قَطَّ يَقُطُّ قَطًّا ‘‘} (ن) قلم وغیرہ کا سرا کاٹنا۔ {’’قِطٌّ‘‘} حصے کو کہتے ہیں، کیونکہ ہر ایک کو اس کا حصہ کاٹ کر دیا جاتا ہے۔ انعام کے لیے کاغذ کا جو ٹکڑا لکھ کر دیا جاتا ہے اسے بھی {’’قِطٌّ‘‘} کہتے ہیں۔ مراد عذاب میں سے ان کا حصہ ہے، بعض نے اعمال نامہ مراد لیا ہے۔ یعنی کفار قیامت کو ناممکن سمجھ کر اس کا انکار کرتے ہوئے اور اس کا مذاق اڑاتے ہوئے جرأت کی اس حد تک پہنچ گئے کہ اللہ تعالیٰ سے اس کی ربوبیت کے واسطے سے دعا کرتے ہوئے کہنے لگے، اے ہمارے رب! عذاب میں سے ہمارا جو حصہ ہے وہ ہمیں یوم حساب سے پہلے ابھی جلدی دے دے، جیسا کہ ابوجہل وغیرہ نے نہایت دیدہ دلیری سے کہا تھا : « اللّٰهُمَّ اِنْ كَانَ هٰذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَاَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَآءِ اَوِ ائْتِنَا بِعَذَابٍ اَلِيْمٍ » [ الأنفال : ۳۲ ] ’’اے اللہ! اگر صرف یہی تیری طرف سے حق ہے تو ہم پر آسمان سے پتھر برسا، یا ہم پر کوئی دردناک عذاب لے آ۔‘‘"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { اِصْبِرْ عَلٰى مَا يَقُوْلُوْنَ:} اس سورت میں یہاں تک کفار کی جو باتیں ذکر ہوئی ہیں، مثلاً آپ کو ساحر و کذّاب کہنا اور ان کا یہ اعتراض کہ کیا ہم سب میں سے رسول بنانے کے لیے یہی ایک شخص رہ گیا تھا؟ اور یہ کہ اس دعوت کے پیچھے کوئی سوچی سمجھی سازش ہے اور قیامت کا مذاق اڑاتے ہوئے انھوں نے جو کچھ کہا، اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو ان سب باتوں پر صبر کا حکم دیا اور تسلی کے لیے داؤد علیہ السلام اور چند دوسرے پیغمبروں کو یاد کرنے کا حکم دیا۔ ¤ ➋ {وَ اذْكُرْ عَبْدَنَا دَاوٗدَ ذَا الْاَيْدِ : ’’ الْاَيْدِ ‘‘} کا معنی قوت ہے۔ {’’آدَ الرَّجُلُ يَئِيْدُ أَيْدًا‘‘} (ض) جب کوئی آدمی قوی ہو جائے تو کہتے ہیں : {’’فَهُوَ أَيِّدٌ‘‘} جیسے فرمایا : « وَ اَيَّدْنٰهُ بِرُوْحِ الْقُدُسِ» [ البقرۃ : ۸۷ ] ’’اور ہم نے اسے روح القدس کے ساتھ قوت بخشی۔‘‘ داؤد علیہ السلام بڑی قوت والے تھے، اللہ تعالیٰ نے انھیں کئی قوتوں سے نوازا تھا، مثلاً جسمانی قوت جس کے ساتھ انھوں نے جالوت کو قتل کیا، قلبی شجاعت و قوت جس کی وجہ سے وہ کبھی دشمن کے مقابلے میں پیٹھ نہیں دکھاتے تھے، عبادت کی قوت جس کا اظہار روزانہ تہائی رات کی نماز اور ہمیشہ ایک دن کے ناغے کے ساتھ روزے سے ہوتا ہے، فرماں روائی کی قوت جس کے ساتھ انھوں نے گرد و پیش کی تمام مشرک قوتوں کو زیر کرکے ایک مضبوط سلطنت قائم کی۔ صحیح فیصلے کی قوت (حکم)، فیصلہ کن خطاب کی قوت، حُسن صوت کی نعمت جس کی وجہ سے پہاڑ اور پرندے بھی ان کے ساتھ تسبیح و تلاوت میں شریک ہو جاتے تھے، لوہے کو موم کرنے اور زرہیں بنانے کی قوت جس کے ذریعے سے وہ صرف اپنے ہاتھ کی کمائی کھاتے تھے۔ مزید تفصیل سورۂ بقرہ (۲۵۱)، انبیاء (۷۸، ۷۹)، نمل (۱۵، ۱۶) اور سورۂ سبا (۱۰ تا ۱۳) میں ملاحظہ فرمائیں۔ ¤ ➌ { اِنَّهٗۤ اَوَّابٌ :} یعنی وہ اپنے تمام معاملات میں اللہ تعالیٰ کی طرف بہت رجوع کرنے والے تھے، کوئی قدم اپنی مرضی سے نہیں اٹھاتے تھے۔ ہر وقت نماز، دعا، امید و خوف، ذکر و تلاوت اور جہاد کے ساتھ اسی کی طرف توجہ رکھتے، کبھی کوئی کمی ہو جاتی تو فوراً توبہ و استغفار کے ساتھ اس کی طرف رجوع کرتے تھے۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 19،18) {اِنَّا سَخَّرْنَا الْجِبَالَ مَعَهٗ يُسَبِّحْنَ بِالْعَشِيِّ وَ الْاِشْرَاقِ … :} اللہ تعالیٰ نے داؤد علیہ السلام کو نہایت خوب صورت آواز عطا کر رکھی تھی اور پہاڑوں اور پرندوں کو ان کے ساتھ پابند کر دیا تھا کہ جب وہ ترنم کے ساتھ تسبیح کرتے تو پہاڑ بھی ان کے ساتھ تسبیح کرتے اور اڑتے ہوئے پرندے سن کر آگے جانے کے بجائے ان کے گرد جمع ہو کر ان کے ساتھ تسبیح میں مشغول ہو جاتے۔ مزید دیکھیے سورۂ انبیاء (۷۹) اور سورۂ سبا (۱۰)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19،18) {اِنَّا سَخَّرْنَا الْجِبَالَ مَعَهٗ يُسَبِّحْنَ بِالْعَشِيِّ وَ الْاِشْرَاقِ … :} اللہ تعالیٰ نے داؤد علیہ السلام کو نہایت خوب صورت آواز عطا کر رکھی تھی اور پہاڑوں اور پرندوں کو ان کے ساتھ پابند کر دیا تھا کہ جب وہ ترنم کے ساتھ تسبیح کرتے تو پہاڑ بھی ان کے ساتھ تسبیح کرتے اور اڑتے ہوئے پرندے سن کر آگے جانے کے بجائے ان کے گرد جمع ہو کر ان کے ساتھ تسبیح میں مشغول ہو جاتے۔ مزید دیکھیے سورۂ انبیاء (۷۹) اور سورۂ سبا (۱۰)۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {وَ شَدَدْنَا مُلْكَهٗ وَ اٰتَيْنٰهُ الْحِكْمَةَ … : ’’ الْحِكْمَةَ ‘‘} کے مفہوم میں  نبوت، کتاب اللہ کا علم اور معاملات کی فہم و فراست، سب چیزیں شامل ہیں اور {’’ فَصْلَ الْخِطَابِ ‘‘} سے مراد ہے مقدمہ سن کر صحیح، واضح اور دو ٹوک فیصلہ کرنا۔ {’’ فَصْلَ الْخِطَابِ ‘‘} میں یہ بھی شامل ہے کہ لمبی بات کو مختصر الفاظ میں ایسے طریقے سے بیان کیا جائے کہ ہر شخص کو پوری طرح سمجھ میں آ جائے۔ ان دونوں چیزوں کے لیے اعلیٰ درجے کی عقل اور فہم و فراست کے ساتھ قادر الکلام ہونا بھی ضروری ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21تا23) ➊ { وَ هَلْ اَتٰىكَ نَبَؤُا الْخَصْمِ …: ’’ نَبَؤُا ‘‘} کسی اہم خبر کو کہتے ہیں۔ {’’ الْخَصْمِ ‘‘} واحد، تثنیہ اور جمع سب پر بولا جاتا ہے۔ {’’ تَسَوَّرُوا ‘‘ ’’سُوْرٌ‘‘} دیوار کو کہتے ہیں اور {’’ تَسَوَّرُوا ‘‘} کے ضمن میں {’’دَخَلُوْا‘‘} کا معنی شامل ہونے کی وجہ سے {’’ الْمِحْرَابَ ‘‘} کو اس کا مفعول بنایا گیا ہے، یعنی دیوار پھاند کر ’’محراب‘‘ میں داخل ہوئے۔ {’’ الْمِحْرَابَ ‘‘} عبادت کے لیے مخصوص کمرہ۔ {’’ لَا تُشْطِطْ ‘‘} بے انصافی نہ کر۔ {’’شَطَطٌ‘‘} زیادتی، ظلم۔ {’’أَشَطَّ الْحَاكِمُ إِذَا جَارَ‘‘} (افعال) حاکم نے بے انصافی کی۔ {’’ نَعْجَةً ‘‘ ’’أُنْثٰي مِنَ الضَّأْنِ‘‘} بھیڑ یا دنبی۔ {’’عَزَّ يَعِزُّ‘‘} (ض) غالب آنا۔ {’’ الْخُلَطَآءِ ‘‘ ’’خَلِيْطٌ‘‘} کی جمع ہے، شریک۔ مگر {’’خَلِيْطٌ‘‘} عام ہے، اس میں وہ لوگ بھی آ جاتے ہیں جنھوں نے اپنا مال ملایا ہوا ہو، مگر ہر ایک اپنے اپنے مال کا الگ الگ مالک ہو۔ {’’ قَلِيْلٌ ‘‘} بہت کم۔ {’’ مَا ‘‘} کے ساتھ تاکید کی وجہ سے ’’بہت ہی کم۔‘‘ ¤ ➋ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو صبر کی تلقین کرتے ہوئے داؤد علیہ السلام کو یاد کرنے کا حکم دیا اور یہ واقعہ بیان کرتے ہوئے بات کا آغاز اس طرح کیا کہ کیا تیرے پاس ان جھگڑنے والوں کی خبر آئی ہے؟ مقصد اسے سننے کا شوق دلانا ہے۔ ¤ ➌ { اِذْ تَسَوَّرُوا الْمِحْرَابَ :} جب وہ جھگڑنے والے دیوار پھاند کر داؤد علیہ السلام کے پاس ان کے عبادت کے لیے مخصوص کمرے میں آ گئے۔ اس سے ظاہر ہے کہ وہ پہرے وغیرہ کی وجہ سے دروازے کی طرف سے داخل نہیں ہو سکے، ورنہ انھیں دیوار پھاندنے کی ضرورت نہیں تھی۔ ¤ ➍ {اِذْ دَخَلُوْا عَلٰى دَاوٗدَ فَفَزِعَ مِنْهُمْ :} داؤد علیہ السلام ان کے اس طرح دیوار پھاند کر اچانک آ دھمکنے سے گھبرا گئے کہ یہ دشمن نہ ہوں، جو قتل کرنے یا نقصان پہنچانے کے لیے آئے ہیں، خصوصاً اس لیے کہ بنی اسرائیل کا اپنے انبیاء کو قتل کرنا معروف تھا۔ ¤ ➎ { قَالُوْا لَا تَخَفْ … :} انھوں نے آتے ہی سب سے پہلے تسلی دی کہ ڈرو نہیں، ہم کسی بری نیت سے نہیں آئے، بلکہ دونوں آپس کا ایک جھگڑا لے کر آپ کے پاس آئے ہیں، اس لیے آپ ہمارے درمیان حق کے ساتھ فیصلہ کریں اور بے انصافی نہ کریں اور ہماری راہ نمائی سیدھے راستے کی طرف کریں۔ ¤ ➏ { اِنَّ هٰذَاۤ اَخِيْ لَهٗ تِسْعٌ وَّ تِسْعُوْنَ نَعْجَةً … :} یہ میرا حقیقی یا دینی بھائی ہے، اس کے پاس ننانوے دنبیاں ہیں اور میرے پاس ایک دنبی ہے۔ تو اس نے مجھے کہا ہے کہ وہ ایک بھی میں اس کے سپرد کر دوں اور بات کرنے میں اس نے مجھ پر بہت سختی کی اور مجھے دبا لیا ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 21تا23) ➊ { وَ هَلْ اَتٰىكَ نَبَؤُا الْخَصْمِ …: ’’ نَبَؤُا ‘‘} کسی اہم خبر کو کہتے ہیں۔ {’’ الْخَصْمِ ‘‘} واحد، تثنیہ اور جمع سب پر بولا جاتا ہے۔ {’’ تَسَوَّرُوا ‘‘ ’’سُوْرٌ‘‘} دیوار کو کہتے ہیں اور {’’ تَسَوَّرُوا ‘‘} کے ضمن میں {’’دَخَلُوْا‘‘} کا معنی شامل ہونے کی وجہ سے {’’ الْمِحْرَابَ ‘‘} کو اس کا مفعول بنایا گیا ہے، یعنی دیوار پھاند کر ’’محراب‘‘ میں داخل ہوئے۔ {’’ الْمِحْرَابَ ‘‘} عبادت کے لیے مخصوص کمرہ۔ {’’ لَا تُشْطِطْ ‘‘} بے انصافی نہ کر۔ {’’شَطَطٌ‘‘} زیادتی، ظلم۔ {’’أَشَطَّ الْحَاكِمُ إِذَا جَارَ‘‘} (افعال) حاکم نے بے انصافی کی۔ {’’ نَعْجَةً ‘‘ ’’أُنْثٰي مِنَ الضَّأْنِ‘‘} بھیڑ یا دنبی۔ {’’عَزَّ يَعِزُّ‘‘} (ض) غالب آنا۔ {’’ الْخُلَطَآءِ ‘‘ ’’خَلِيْطٌ‘‘} کی جمع ہے، شریک۔ مگر {’’خَلِيْطٌ‘‘} عام ہے، اس میں وہ لوگ بھی آ جاتے ہیں جنھوں نے اپنا مال ملایا ہوا ہو، مگر ہر ایک اپنے اپنے مال کا الگ الگ مالک ہو۔ {’’ قَلِيْلٌ ‘‘} بہت کم۔ {’’ مَا ‘‘} کے ساتھ تاکید کی وجہ سے ’’بہت ہی کم۔‘‘ ¤ ➋ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو صبر کی تلقین کرتے ہوئے داؤد علیہ السلام کو یاد کرنے کا حکم دیا اور یہ واقعہ بیان کرتے ہوئے بات کا آغاز اس طرح کیا کہ کیا تیرے پاس ان جھگڑنے والوں کی خبر آئی ہے؟ مقصد اسے سننے کا شوق دلانا ہے۔ ¤ ➌ { اِذْ تَسَوَّرُوا الْمِحْرَابَ :} جب وہ جھگڑنے والے دیوار پھاند کر داؤد علیہ السلام کے پاس ان کے عبادت کے لیے مخصوص کمرے میں آ گئے۔ اس سے ظاہر ہے کہ وہ پہرے وغیرہ کی وجہ سے دروازے کی طرف سے داخل نہیں ہو سکے، ورنہ انھیں دیوار پھاندنے کی ضرورت نہیں تھی۔ ¤ ➍ {اِذْ دَخَلُوْا عَلٰى دَاوٗدَ فَفَزِعَ مِنْهُمْ :} داؤد علیہ السلام ان کے اس طرح دیوار پھاند کر اچانک آ دھمکنے سے گھبرا گئے کہ یہ دشمن نہ ہوں، جو قتل کرنے یا نقصان پہنچانے کے لیے آئے ہیں، خصوصاً اس لیے کہ بنی اسرائیل کا اپنے انبیاء کو قتل کرنا معروف تھا۔ ¤ ➎ { قَالُوْا لَا تَخَفْ … :} انھوں نے آتے ہی سب سے پہلے تسلی دی کہ ڈرو نہیں، ہم کسی بری نیت سے نہیں آئے، بلکہ دونوں آپس کا ایک جھگڑا لے کر آپ کے پاس آئے ہیں، اس لیے آپ ہمارے درمیان حق کے ساتھ فیصلہ کریں اور بے انصافی نہ کریں اور ہماری راہ نمائی سیدھے راستے کی طرف کریں۔ ¤ ➏ { اِنَّ هٰذَاۤ اَخِيْ لَهٗ تِسْعٌ وَّ تِسْعُوْنَ نَعْجَةً … :} یہ میرا حقیقی یا دینی بھائی ہے، اس کے پاس ننانوے دنبیاں ہیں اور میرے پاس ایک دنبی ہے۔ تو اس نے مجھے کہا ہے کہ وہ ایک بھی میں اس کے سپرد کر دوں اور بات کرنے میں اس نے مجھ پر بہت سختی کی اور مجھے دبا لیا ہے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 21تا23) ➊ { وَ هَلْ اَتٰىكَ نَبَؤُا الْخَصْمِ …: ’’ نَبَؤُا ‘‘} کسی اہم خبر کو کہتے ہیں۔ {’’ الْخَصْمِ ‘‘} واحد، تثنیہ اور جمع سب پر بولا جاتا ہے۔ {’’ تَسَوَّرُوا ‘‘ ’’سُوْرٌ‘‘} دیوار کو کہتے ہیں اور {’’ تَسَوَّرُوا ‘‘} کے ضمن میں {’’دَخَلُوْا‘‘} کا معنی شامل ہونے کی وجہ سے {’’ الْمِحْرَابَ ‘‘} کو اس کا مفعول بنایا گیا ہے، یعنی دیوار پھاند کر ’’محراب‘‘ میں داخل ہوئے۔ {’’ الْمِحْرَابَ ‘‘} عبادت کے لیے مخصوص کمرہ۔ {’’ لَا تُشْطِطْ ‘‘} بے انصافی نہ کر۔ {’’شَطَطٌ‘‘} زیادتی، ظلم۔ {’’أَشَطَّ الْحَاكِمُ إِذَا جَارَ‘‘} (افعال) حاکم نے بے انصافی کی۔ {’’ نَعْجَةً ‘‘ ’’أُنْثٰي مِنَ الضَّأْنِ‘‘} بھیڑ یا دنبی۔ {’’عَزَّ يَعِزُّ‘‘} (ض) غالب آنا۔ {’’ الْخُلَطَآءِ ‘‘ ’’خَلِيْطٌ‘‘} کی جمع ہے، شریک۔ مگر {’’خَلِيْطٌ‘‘} عام ہے، اس میں وہ لوگ بھی آ جاتے ہیں جنھوں نے اپنا مال ملایا ہوا ہو، مگر ہر ایک اپنے اپنے مال کا الگ الگ مالک ہو۔ {’’ قَلِيْلٌ ‘‘} بہت کم۔ {’’ مَا ‘‘} کے ساتھ تاکید کی وجہ سے ’’بہت ہی کم۔‘‘ ¤ ➋ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو صبر کی تلقین کرتے ہوئے داؤد علیہ السلام کو یاد کرنے کا حکم دیا اور یہ واقعہ بیان کرتے ہوئے بات کا آغاز اس طرح کیا کہ کیا تیرے پاس ان جھگڑنے والوں کی خبر آئی ہے؟ مقصد اسے سننے کا شوق دلانا ہے۔ ¤ ➌ { اِذْ تَسَوَّرُوا الْمِحْرَابَ :} جب وہ جھگڑنے والے دیوار پھاند کر داؤد علیہ السلام کے پاس ان کے عبادت کے لیے مخصوص کمرے میں آ گئے۔ اس سے ظاہر ہے کہ وہ پہرے وغیرہ کی وجہ سے دروازے کی طرف سے داخل نہیں ہو سکے، ورنہ انھیں دیوار پھاندنے کی ضرورت نہیں تھی۔ ¤ ➍ {اِذْ دَخَلُوْا عَلٰى دَاوٗدَ فَفَزِعَ مِنْهُمْ :} داؤد علیہ السلام ان کے اس طرح دیوار پھاند کر اچانک آ دھمکنے سے گھبرا گئے کہ یہ دشمن نہ ہوں، جو قتل کرنے یا نقصان پہنچانے کے لیے آئے ہیں، خصوصاً اس لیے کہ بنی اسرائیل کا اپنے انبیاء کو قتل کرنا معروف تھا۔ ¤ ➎ { قَالُوْا لَا تَخَفْ … :} انھوں نے آتے ہی سب سے پہلے تسلی دی کہ ڈرو نہیں، ہم کسی بری نیت سے نہیں آئے، بلکہ دونوں آپس کا ایک جھگڑا لے کر آپ کے پاس آئے ہیں، اس لیے آپ ہمارے درمیان حق کے ساتھ فیصلہ کریں اور بے انصافی نہ کریں اور ہماری راہ نمائی سیدھے راستے کی طرف کریں۔ ¤ ➏ { اِنَّ هٰذَاۤ اَخِيْ لَهٗ تِسْعٌ وَّ تِسْعُوْنَ نَعْجَةً … :} یہ میرا حقیقی یا دینی بھائی ہے، اس کے پاس ننانوے دنبیاں ہیں اور میرے پاس ایک دنبی ہے۔ تو اس نے مجھے کہا ہے کہ وہ ایک بھی میں اس کے سپرد کر دوں اور بات کرنے میں اس نے مجھ پر بہت سختی کی اور مجھے دبا لیا ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 25،24) ➊ { قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ اِلٰى نِعَاجِهٖ :} داؤد علیہ السلام نے فرمایا کہ اس نے تمھاری دنبی اپنی دنبیوں کے ساتھ ملا لینے کا مطالبہ کرکے یقینا تم پر ظلم کیا ہے۔ یہاں قابل توجہ بات یہ ہے کہ یہ لوگ دیوار پھاند کر آئے، پھر انھوں نے مقدمہ پیش کرتے ہوئے اس بات کا خیال نہیں رکھا کہ وہ اس شخص سے ہم کلام ہیں جسے اللہ تعالیٰ نے نبوت کے ساتھ حکومت کا شرف بھی عطا فرمایا ہے اور جس سے حق کے خلاف یا بے انصافی پر مبنی فیصلہ کرنے کی توقع نہیں۔ اس کے باوجود وہ کہہ رہے ہیں کہ ہمارے درمیان حق کے ساتھ فیصلہ کریں اور بے انصافی نہ کریں۔ یہ دونوں جملے ہی کسی شخص کا غصہ بھڑکانے کے لیے کافی ہیں، کجا یہ کہ ایسا کہنے والے پہلے دیوار پھاند کر آنے کی گستاخی بھی کر چکے ہوں۔ اگر کوئی دنیا دار بادشاہ ہوتا تو یہ لوگ قتل کر دیے جاتے، یا کوئی اور عبرت ناک سزا پاتے، تاکہ آئندہ کسی کو ایسی جرأت نہ ہو، مگر داؤد علیہ السلام کا صبر اور حلم دیکھیے کہ پہلے کچھ خوف زدہ ہونے کے باوجود نہ غصے میں آئے اور نہ انھیں ملامت کا ایک لفظ بھی کہا، بلکہ ان کے اس طرح آنے اور نامناسب الفاظ کہنے کو صبر سے برداشت کیا اور وہ جس مقصد کے لیے آئے تھے اسے پورا کرتے ہوئے ان کے مقدمے کا فیصلہ فرما دیا۔ یہ نبیوں ہی کا حوصلہ ہو سکتا ہے، جس کے لیے رسول اللہ صلی اللہ علیہ وسلم کوو تلقین کی گئی کہ کفار کی باتوں پر صبر کریں اور ہمارے بندے داؤد علیہ السلام کو یاد کریں۔ ¤ ➋ {وَ اِنَّ كَثِيْرًا مِّنَ الْخُلَطَآءِ … :} مظلوم کو تسلی دیتے ہوئے داؤد علیہ السلام نے بہت سے لوگوں کے اس کی طرح مظلوم ہونے کا ذکر فرمایا کہ تم اکیلے مظلوم اور یہ اکیلا ظالم نہیں ہے، بلکہ بہت سے شریک ایک دوسرے پر ظلم کرتے ہیں، کیونکہ جب آدمی دیکھتا ہے کہ اس کے ساتھ اور لوگ بھی مظلوم ہیں تو اسے کچھ حوصلہ ہو جاتا ہے، {’’لِأَنَّ الْمُصِيْبَةَ إِذَا عَمَّتْ طَابَتْ‘‘} ’’کیونکہ جب مصیبت عام ہوتی ہے تو برداشت ہو جاتی ہے۔‘‘ ساتھ ہی یہ بھی بتایا کہ ایمان اور عمل صالح والے لوگ ایسا نہیں کرتے، بلکہ وہ اپنے شریک پر ظلم سے اجتناب کرتے ہیں۔ اس میں ننانوے دنبیوں والے کے لیے نصیحت بھی ہے کہ وہ ظلم سے باز آ جائے اور انبیاء علیھم السلام کا یہی طریقہ ہوتا ہے۔ ¤ ➌ { وَ قَلِيْلٌ مَّا هُمْ:} یعنی ایمان اور عمل صالح والے لوگ، جو اپنے شریک پر ظلم نہ کریں، وہ بہت ہی کم ہیں، اکثریت کا حال اس کے خلاف ہے۔ جمہوریت کے علم برداروں کو اس پر غور کرنا چاہیے۔ اس مفہوم کی مزید آیات کے لیے دیکھیے سورۂ سبا (۱۳)، بقرہ (۲۴۳)، انعام (۱۱۷)، ہود (۱۷)، یوسف (۱۰۳، ۱۰۶)، زخرف (۷۸)، اور سورۂ مائدہ (۱۰۰)۔ ¤ ➍ { وَ ظَنَّ دَاوٗدُ:’’ ظَنَّ ‘‘} راجح گمان کو کہتے ہیں، قرائن سے حاصل ہونے والے یقین پر بھی ’’ظن‘‘ کا لفظ بولا جاتا ہے، جیسا کہ فرمایا : «وَ ظَنُّوْۤا اَنْ لَّا مَلْجَاَ مِنَ اللّٰهِ اِلَّاۤ اِلَيْهِ » [ التوبۃ : ۱۱۸ ] ’’اور انھوں نے یقین کر لیا کہ اللہ سے پناہ کی کوئی جگہ اس کی جناب کے سوا نہیں۔‘‘ اور فرمایا : « الَّذِيْنَ يَظُنُّوْنَ اَنَّهُمْ مُّلٰقُوْا رَبِّهِمْ وَ اَنَّهُمْ اِلَيْهِ رٰجِعُوْنَ» [ البقرۃ : ۴۶ ] ’’جو یقین رکھتے ہیں کہ وہ اپنے رب سے ملنے والے ہیں اور یہ کہ وہ اسی کی طرف لوٹنے والے ہیں۔‘‘ یہاں {’’ ظَنَّ ‘‘} کا معنی {’’شَعُرَ‘‘} (سمجھ گیا) ہے، یا {’’أَيْقَنَ‘‘} (یقین کر لیا) ہے، کیونکہ اس کے بعد {’’أَنَّ‘‘} حرف تاکید آ رہا ہے۔ ¤ ➎ { اَنَّمَا فَتَنّٰهُ :} یعنی داؤد علیہ السلام کو یقین ہو گیا کہ ان لوگوں کا اس طرح دیوار پھلانگ کر آنا میری آزمائش ہے کہ میں اپنی کوتاہی پر متنبّہ ہو کر اسے ترک کرتا اور اس کی معافی مانگتا ہوں یا نہیں۔ ¤ ➏ {فَاسْتَغْفَرَ رَبَّهٗ :} تو انھوں نے اپنے رب سے معافی مانگی اور بخشش کی دعا کی۔ ¤ ➐{ وَ خَرَّ رَاكِعًا وَّ اَنَابَ :} رکوع کا معنی جھکنا یا سر جھکانا ہے۔ {’’ خَرَّ ‘‘} زمین پر گر پڑا۔ یعنی وہ رکوع کرتے ہوئے نیچے گر گئے، مراد یہ ہے کہ وہ جھکتے ہوئے سجدے میں گر گئے۔ اس لیے بعض مفسرین نے فرمایا کہ یہاں رکوع سے مراد سجدہ ہے۔ {’’ وَ اَنَابَ ‘‘} (اور انھوں نے اللہ کی طرف رجوع کیا) بعض مفسرین نے لکھا ہے کہ ’’داؤد علیہ السلام چالیس دن سجدے میں پڑے روتے رہے، حتیٰ کہ ان کے آنسوؤں سے زمین پر سبزہ اُگ آیا۔‘‘ ایسی باتیں تردید کے بغیر لکھنے والوں پر افسوس ہوتا ہے کہ وہ ایسی باتیں لکھ رہے ہیں جو نہ صرف یہ کہ قرآن یا حدیث میں نہیں آئیں بلکہ صاف عقل کے خلاف ہیں۔ چالیس دن ان کے کھانے پینے اور دوسری ضروریات زندگی، نماز اور امور مملکت کی نگرانی وغیرہ کا کیا بنا؟ یہ نتیجہ ہے سنی سنائی بات اندھا دھند نقل کرنے کا، خواہ وہ اسرائیلی روایت ہو یا کسی اور کی بنائی ہوئی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَفٰي بِالْمَرْئِ كَذِبًا أَنْ يُّحَدِّثَ بِكُلِّ مَا سَمِعَ ] [ مسلم، المقدمۃ : ۵، عن أبي ھریرۃ رضی اللہ عنہ ] ’’آدمی کو جھوٹا ہونے کے لیے یہی کافی ہے کہ وہ ہر سنی ہوئی بات آگے بیان کر دے۔‘‘ ¤ ➑ ان آیات کو سمجھنے میں اکثر لوگوں نے ٹھوکر کھائی ہے، جس کی وجہ مسلمانوں کا قرآن کی تفسیر میں اسرائیلی روایات پر اعتماد ہے، حالانکہ یہود کی اللہ کے پیغمبروں خصوصاً داؤد و سلیمان علیھما السلام سے دشمنی سب کو معلوم ہے۔ اگر کوئی شخص ان روایات سے ذہن کو صاف کر لے تو آیات کا مطلب سمجھنا کچھ مشکل نہیں۔ اس لیے پہلے آیات کا مطلب بیان کیا جاتا ہے، اس کے بعد ان روایات کے متعلق مختصر سی بات ہو گی۔ ان آیات کو سمجھنے کے لیے ان سے پہلی آیات پر ایک نظر ڈالنا ضروری ہے: (۱) یہ بات بالکل واضح ہے کہ آیات کے اس سلسلہ میں قرآن مجید داؤد علیہ السلام کی تعریف بیان فرما رہا ہے۔ (3) قرآن کے الفاظ یا مفہوم میں کوئی اشارہ بھی نہیں کہ یہ کوئی رمز یا کنایہ کی بات ہے، جو اللہ تعالیٰ نے داؤد علیہ السلام کے کسی ایسے فعل پر ناراضی کے اظہار کے لیے فرمائی ہے جو شریعت کے خلاف یا فضیلت کے خلاف تھا۔ (3) اللہ تعالیٰ نے اس مقام پر نبی صلی اللہ علیہ وسلم کو اپنی قوم کی باتوں پر صبر کا حکم دیتے ہوئے داؤد علیہ السلام کو نمونے کے طور پر پیش فرمایا ہے۔ آیات کا خلاصہ یہ ہے کہ اللہ تعالیٰ نبی صلی اللہ علیہ وسلم کو فرما رہے ہیں کہ اگر آپ کا سینہ اپنی قوم کے کفر سے تنگ ہوتا ہے تو صبر کریں اور ہمارے بندے داؤد کو یاد کریں۔ ساتھ ہی داؤد علیہ السلام کا ذکر نہایت عزت و تکریم کے ساتھ کیا ہے اور ان کی تعریف بہت بلند اوصاف کے ساتھ فرمائی ہے :(1) انھیں {’’ عَبْدَنَا ‘‘} (ہمارا بندہ) کہا ہے، یہ اکیلا لفظ ہی سب اوصاف پر بھاری ہے، جیسا کہ ہمارے نبی کریم صلی اللہ علیہ وسلم کے متعلق فرمایا : « سُبْحٰنَ الَّذِيْۤ اَسْرٰى بِعَبْدِهٖ لَيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ اِلَى الْمَسْجِدِ الْاَقْصَا الَّذِيْ بٰرَكْنَا حَوْلَهٗ » [ بني إسرائیل : ۱ ] ’’پاک ہے وہ جو رات کے ایک حصے میں اپنے بندے کو حرمت والی مسجد سے بہت دور کی اس مسجد تک لے گیا جس کے ارد گرد کو ہم نے برکت دی۔‘‘ (2) پھر بتایا کہ وہ {’’ ذَا الْاَيْدِ ‘‘} (حق کی قوت والے تھے) (3) {’’ اَوَّابٌ ‘‘} (اللہ کی طرف بہت رجوع کرنے والے) تھے۔ (4) {’’ اِنَّا سَخَّرْنَا الْجِبَالَ مَعَهٗ يُسَبِّحْنَ بِالْعَشِيِّ ووَ الْاِشْرَاقِ ‘‘} (ہماری طرف سے پہاڑ ان کے ہمراہ مسخر تھے، صبح و شام تسبیح کرتے تھے) (5) {’’ وَ الطَّيْرَ مَحْشُوْرَةً ‘‘} (جمع کیے پرندے بھی ان کے ہمراہ تسبیح کے لیے مسخر تھے) (6) {’’ وَ شَدَدْنَا مُلْكَهٗ ‘‘} (اور ہم نے اس کی سلطنت مضبوط کر دی) (7) {’’ وَ اٰتَيْنٰهُ الْحِكْمَةَ ‘‘} (اور انھیں حکمت عطا فرمائی) (8) {’’ وَ فَصْلَ الْخِطَابِ ‘‘} (اور فیصلہ کن گفتگو عطا فرمائی) (9) اس کے بعد یہ واقعہ ذکر فرمایا، جس کے بعد پہلے دنیا میں انھیں عطا ہونے والا مقام ذکر فرمایا : {’’ يٰدَاوٗدُ اِنَّا جَعَلْنٰكَ خَلِيْفَةً فِي الْاَرْضِ ‘‘} (اے داؤد! ہم نے تجھے زمین میں خلیفہ بنایا) (10) پھر اپنے ہاں ان کا مرتبہ اور آخرت میں ان کا مقام بیان فرمایا : {’’ وَ اِنَّ لَهٗ عِنْدَنَا لَزُلْفٰى ‘‘} (اور بلاشبہ اس کے لیے ہمارے پاس یقینا بڑا قرب ہے) (11) {’’ وَ حُسْنَ مَاٰبٍ ‘‘} (اور اچھا ٹھکانا ہے)۔ ان اوصاف سے ظاہر ہے کہ داؤد علیہ السلام اللہ تعالیٰ کے نہایت مقرّب اور محبوب پیغمبر تھے اور ایسی تمام روایات ان پر صریح بہتان اور ظلم ہیں جن سے وہ ایک عام شریف آدمی سے بھی فرو تر نظر آتے ہیں، تو پھر ان آیات کا مطلب کیا ہے اور ان دو جھگڑنے والوں کا مقصد کیا ہے؟ ¤ حقیقت یہ ہے کہ داؤد علیہ السلام نبی تھے اور بادشاہ بھی اور یہ دونوں بہت بھاری ذمہ داریاں ہیں۔ ان کے علاوہ انھیں اللہ تعالیٰ کی عبادت یعنی تسبیح، ذکر الٰہی، تلاوت، قیام اللیل اور روزوں کا بہت شوق تھا، اس لیے اس کے بغیر چارہ ہی نہ تھا کہ وہ تسبیح و ذکر، نبوت کے فرائض اور بادشاہت کی ذمہ داریوں کی ادائیگی کے لیے اپنے اوقات تقسیم کریں۔ اس کے ساتھ یہ بھی شامل کر لیں کہ وہ صرف اپنے ہاتھ کی کمائی کھاتے تھے، جس کے لیے انھیں لوہے کی زرہیں بنانے کا مشکل اور باریک کام کرنا پڑتا تھا، سورۂ سبا کی آیت (۱۱) : « اَنِ اعْمَلْ سٰبِغٰتٍ وَّ قَدِّرْ فِي السَّرْدِ » ( کہ کشادہ زرہیں بنا اور کڑیاں جوڑنے میں اندازہ رکھ) سے ان کے کام کی مشقت اور باریکی کا اندازہ ہوتا ہے۔ اب نبوت، سلطنت، عبادت اور کمائی کے لیے وقت کیسے تقسیم کریں؟ اس کے لیے انھوں نے کچھ اوقات نبوت و سلطنت اور کمائی کے امور کے لیے رکھے اور کچھ وقت عبادت کے لیے خاص کر لیا، جس میں وہ اپنے محراب (عبادت خانے) سے نہیں نکلتے تھے۔ اللہ تعالیٰ نے چاہا کہ داؤد علیہ السلام کو اس بات کا پتا چل جائے کہ جب وہ عبادت کے لیے خلوت اختیار کرتے ہیں اس وقت بھی لوگوں کے ایک دوسرے پر ایسے ظلم واقع ہوتے ہیں جن کے لیے داؤد علیہ السلام کے عدل کی ضرورت ہے۔ چنانچہ اللہ تعالیٰ نے ان دو جھگڑنے والوں کے لیے یہ آسانی پیدا فرمائی کہ دروازے بند ہونے اور پہرے داروں کی موجودگی کے باوجود وہ دیوار پھاند کر ان کے عبادت خانے میں داخل ہو گئے اور ان میں سے ایک نے اپنا قصہ سنایا اور وہ ظلم بیان کیا جو اس کے بھائی نے اس پر کیا تھا کہ کس طرح وہ بہت دولت مند اور ننانوے دنبیوں کا مالک ہونے کے باوجود اپنے فقیر بھائی سے، جو صرف ایک دنبی کا مالک ہے، اس کی واحد ملکیت بھی بہت سختی کے ساتھ اپنے سپرد کرنے کا مطالبہ کر رہا ہے۔ داؤد علیہ السلام ان کے اس طرح آنے پر پہلے گھبرائے، مگر جب حقیقت حال معلوم ہوئی تو نہ ان سے ناراض ہوئے اور نہ انھیں پھر آنے کی تاریخ دی، بلکہ ان کا مقدمہ سن کر فوراً فیصلہ فرما دیا۔ ساتھ ہی سمجھ گئے کہ عبادت والے دن بھی لوگوں کے درمیان جھگڑے اور ایک دوسرے پر ظلم ہوتے ہیں، مگر ان کے عبادت میں مصروف ہونے کی وجہ سے مظلوم ان کے پاس فریاد لے کر نہیں پہنچ سکتے، حالانکہ لوگوں کے درمیان صلح اور مظلوم کی مدد عبادت خانے کی خلوت سے افضل ہے اور انھیں یقین ہو گیا کہ ان لوگوں کے اس طرح آنے سے اللہ تعالیٰ نے میری آزمائش کی ہے کہ میں یہ بات سمجھتا ہوں یا نہیں کہ عبادت میں ایسی مصروفیت نہیں ہونی چاہیے کہ مظلوم کو عدالت تک رسائی نہ ہو سکے۔ اس لیے انھوں نے اپنی اس کوتاہی پر اپنے رب سے معافی مانگی اور اس کی طرف رجوع کرتے ہوئے سجدے میں گر گئے، تو ہم نے انھیں معاف کر دیا۔ ¤ ➒ اکثر مفسرین نے داؤد علیہ السلام کی کوئی ایسی غلطی تلاش کرنے کی کوشش کی ہے جو ننانوے دنبیوں اور ایک دنبی کے واقعہ سے ملتی جلتی ہو۔ حالانکہ یہ واقعہ انتہائی ظلم اور مظلومیت کی ایک تصویر ہے کہ ایک بہت دولت مند شخص اپنے فقیر بھائی سے اس کی ایک دنبی بھی چھین لینا چاہتا ہے اور حاکم وقت دروازے بند کرکے عبادت میں مصروف ہے، اب مظلوم کیا کرے؟ بعض لوگوں نے کہا، وہ دوسرے دن پیش ہو سکتے تھے، مگر سب جانتے ہیں کہ انصاف میں تاخیر بھی ظلم کے مترادف ہوتی ہے۔ دیوار پھاند کر جانے سے اور قصہ سنانے سے داؤد علیہ السلام پر یہ حقیقت منکشف ہوئی کہ آپ کو اللہ تعالیٰ نے خلیفہ بنایا ہے، جس کا کام لوگوں کے فیصلے کرنا ہے۔ عبادت کریں، مگر اس طرح نہیں کہ فریادی آپ کی عدالت میں بار نہ پا سکیں، فرمایا : « يٰدَاوٗدُ اِنَّا جَعَلْنٰكَ خَلِيْفَةً فِي الْاَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ ب بِالْحَقِّ وَ لَا تَتَّبِعِ الْهَوٰى فَيُضِلَّكَ عَنْ سَبِيْلِ اللّٰهِ اِنَّ الَّذِيْنَ يَضِلُّوْنَ عَنْ سَبِيْلِ اللّٰهِ لَهُمْ عَذَابٌ شَدِيْدٌۢ بِمَا نَسُوْا يَوْمَ الْحِسَابِ » [ صٓ : ۲۶ ] ’’اے داؤد! بے شک ہم نے تجھے زمین میں خلیفہ بنایا ہے، سو تو لوگوں کے درمیان حق کے ساتھ فیصلہ کر اور خواہش کی پیروی نہ کر، ورنہ وہ تجھے اللہ کی راہ سے بھٹکا دے گی۔ یقینا وہ لوگ جو اللہ کی راہ سے بھٹک جاتے ہیں، ان کے لیے سخت عذاب ہے، اس لیے کہ وہ حساب کے دن کو بھول گئے۔‘‘ ’’خلیفہ‘‘ سے مراد حاکم ہے، جو پہلے لوگوں کی جگہ حکمران بنتا ہے، ’’اللہ کا خلیفہ‘‘ کہنا درست نہیں۔ دیکھیے سورۂ بقرہ (۳۰)۔ ¤ ➓ بعض لوگوں نے ان دو جھگڑنے والوں کو فرشتے بتایا ہے اور لکھا ہے کہ داؤد علیہ السلام نے فیصلہ کیا تو وہ ہنس پڑے اور غائب ہو گئے۔ یہ ساری بات ہی بے اصل ہے، جس کا قرآن و حدیث میں کوئی وجود نہیں۔ ¤ ⓫ داؤد علیہ السلام کی غلطی نکالتے ہوئے اکثر مفسرین نے لکھا ہے کہ وہ ایک عورت کو نہاتے ہوئے دیکھ کر اس پر عاشق ہو گئے اور اس کے خاوند ’’اوریاہ‘‘ کو جہاد میں ایسی جگہ مقرر کرنے کا حکم دیا جہاں وہ قتل ہو گیا تو اس کی بیوی سے نکاح کر لیا، حالانکہ ان کی ننانوے بیویاں موجود تھیں۔ بعض نے کہا، اس سے طلاق دینے کا تقاضا کیا، جسے وہ ٹھکرا نہ سکا، تو اس سے نکاح کر لیا۔ یہودی ملعون یہاں تک پہنچ گئے کہ انھوں نے داؤد علیہ السلام پر بہتان باندھتے ہوئے تورات میں بھی تحریف کر دی اور کہا کہ انھوں نے اوریاہ کی بیوی کو نہاتے ہوئے دیکھ کر اٹھوا لیا اور (نعوذ باللہ) اس سے ہم بستر ہوئے، جس سے وہ حاملہ ہو گئی، پھر اس کے خاوند کو جنگ میں بھیج کر مروا دیا اور اس کی عدت ختم ہونے کے بعد اسے اپنی بیوی بنا لیا، جس سے لڑکا پیدا ہوا، جس سے اللہ تعالیٰ اس پر ناراض ہوا۔ (خلاصہ سموئیل دوم، باب ۱۱، فقرہ ۲ سے ۲۷ تک) ¤ بعض حضرات نے داؤد علیہ السلام کی یہ غلطی نکالی ہے کہ انھوں نے صرف مدّعی کی بات سن کر فیصلہ کر دیا، جب کہ انھیں دوسرے فریق کی بات سننا بھی ضروری تھا۔ حالانکہ وہاں اختصار کے لیے دوسرے فریق کی بات کا ذکر نہیں ہوا۔ کسی بات کے ذکر نہ ہونے سے اس کی نفی نہیں ہوتی اور یہ بھی ہو سکتا ہے کہ اس نے خاموش رہ کر مظلوم کے دعویٰ کو قبول کر لیا ہو۔ یہ اور اس جیسی کئی فضول باتیں بعض مفسرین نے داؤد علیہ السلام پر بہتان باندھتے ہوئے لکھی ہیں، جب کہ اسرائیلی روایات پر اعتماد جائز ہی نہیں، خصوصاً جب ان سے کسی پیغمبر کی عزت و عصمت پر حرف آتا ہو۔ اس معاملے میں مفسر ابن کثیر رحمہ اللہ کا کلام بہت عمدہ ہے، وہ لکھتے ہیں : {’’ قَدْ ذَكَرَ الْمُفَسِّرُوْنَ هَاهُنَا قِصَّةً أَكْثَرُهَا مَأْخُوْذٌ مِّنَ الإِْسْرَائِيْلِيَّاتِ وَلَمْ يَثْبُتْ فِيْهَا عَنِ الْمَعْصُوْمِ حَدِيْثٌ يَجِبُ اتِّبَاعُهُ وَلٰكِنْ رَوَي ابْنُ أَبِيْ حَاتِمٍ هُنَا حَدِيْثًا لَا يَصِحُّ سَنَدُهُ، لِأَنَّهُ مِنْ رِوَايَةِ يَزِيْدَ الرُّقَاشِيِّ عَنْ أَنَسٍ رَضِيَ اللّٰهُ عَنْهُ، وَ يَزِيْدُ وَ إِنْ كَانَ مِنَ الصَّالِححِيْنَ، لٰكِنَّهُ ضَعِيْفُ الْحَدِيْثِ عِنْدَ الْأَئِمَّةِ، فَالْأَوْلٰي أَنْ يُّقْتَصَرَ عَلٰي مُجَرَّدِ تِلَاوَةِ هٰذِهِ الْقِصَّةِ وَ أَنْ يُّرَدَّ عِلْمُهَا إِلَي اللّٰهِ عَزَّ وَجَلَّ فَإِنَّ الْقُرْآنَ حَقٌّ وَمَا تُضَمِّنُ فَهُوَ حَقٌّ أَيْضًا ‘‘} ’’مفسرین نے یہاں ایک قصہ ذکر کیا ہے، جس کا اکثر حصہ اسرائیلیات سے لیا گیا ہے اور اس کے متعلق معصوم (نبی کریم صلی اللہ علیہ وسلم ) سے کوئی حدیث ثابت نہیں، جس کی پیروی واجب ہو۔ لیکن ابن ابی حاتم نے یہاں ایک حدیث بیان کی ہے جس کی سند صحیح نہیں، کیونکہ وہ یزید رقاشی کی روایت سے ہے، جو وہ انس رضی اللہ عنہ سے بیان کرتے ہیں۔ یزید اگرچہ نیک لوگوں سے ہے، لیکن وہ ائمہ حدیث کے نزدیک ضعیف الحدیث ہے۔ سو بہتر یہ ہے کہ اس قصے کی صرف تلاوت پر اکتفا کیا جائے اور اس کا علم اللہ عز و جل کی طرف لوٹا دیا جائے، کیونکہ قرآن حق ہے اور جو کچھ اس میں ہے، وہ بھی حق ہے۔‘‘"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25،24) ➊ { قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ اِلٰى نِعَاجِهٖ :} داؤد علیہ السلام نے فرمایا کہ اس نے تمھاری دنبی اپنی دنبیوں کے ساتھ ملا لینے کا مطالبہ کرکے یقینا تم پر ظلم کیا ہے۔ یہاں قابل توجہ بات یہ ہے کہ یہ لوگ دیوار پھاند کر آئے، پھر انھوں نے مقدمہ پیش کرتے ہوئے اس بات کا خیال نہیں رکھا کہ وہ اس شخص سے ہم کلام ہیں جسے اللہ تعالیٰ نے نبوت کے ساتھ حکومت کا شرف بھی عطا فرمایا ہے اور جس سے حق کے خلاف یا بے انصافی پر مبنی فیصلہ کرنے کی توقع نہیں۔ اس کے باوجود وہ کہہ رہے ہیں کہ ہمارے درمیان حق کے ساتھ فیصلہ کریں اور بے انصافی نہ کریں۔ یہ دونوں جملے ہی کسی شخص کا غصہ بھڑکانے کے لیے کافی ہیں، کجا یہ کہ ایسا کہنے والے پہلے دیوار پھاند کر آنے کی گستاخی بھی کر چکے ہوں۔ اگر کوئی دنیا دار بادشاہ ہوتا تو یہ لوگ قتل کر دیے جاتے، یا کوئی اور عبرت ناک سزا پاتے، تاکہ آئندہ کسی کو ایسی جرأت نہ ہو، مگر داؤد علیہ السلام کا صبر اور حلم دیکھیے کہ پہلے کچھ خوف زدہ ہونے کے باوجود نہ غصے میں آئے اور نہ انھیں ملامت کا ایک لفظ بھی کہا، بلکہ ان کے اس طرح آنے اور نامناسب الفاظ کہنے کو صبر سے برداشت کیا اور وہ جس مقصد کے لیے آئے تھے اسے پورا کرتے ہوئے ان کے مقدمے کا فیصلہ فرما دیا۔ یہ نبیوں ہی کا حوصلہ ہو سکتا ہے، جس کے لیے رسول اللہ صلی اللہ علیہ وسلم کوو تلقین کی گئی کہ کفار کی باتوں پر صبر کریں اور ہمارے بندے داؤد علیہ السلام کو یاد کریں۔ ¤ ➋ {وَ اِنَّ كَثِيْرًا مِّنَ الْخُلَطَآءِ … :} مظلوم کو تسلی دیتے ہوئے داؤد علیہ السلام نے بہت سے لوگوں کے اس کی طرح مظلوم ہونے کا ذکر فرمایا کہ تم اکیلے مظلوم اور یہ اکیلا ظالم نہیں ہے، بلکہ بہت سے شریک ایک دوسرے پر ظلم کرتے ہیں، کیونکہ جب آدمی دیکھتا ہے کہ اس کے ساتھ اور لوگ بھی مظلوم ہیں تو اسے کچھ حوصلہ ہو جاتا ہے، {’’لِأَنَّ الْمُصِيْبَةَ إِذَا عَمَّتْ طَابَتْ‘‘} ’’کیونکہ جب مصیبت عام ہوتی ہے تو برداشت ہو جاتی ہے۔‘‘ ساتھ ہی یہ بھی بتایا کہ ایمان اور عمل صالح والے لوگ ایسا نہیں کرتے، بلکہ وہ اپنے شریک پر ظلم سے اجتناب کرتے ہیں۔ اس میں ننانوے دنبیوں والے کے لیے نصیحت بھی ہے کہ وہ ظلم سے باز آ جائے اور انبیاء علیھم السلام کا یہی طریقہ ہوتا ہے۔ ¤ ➌ { وَ قَلِيْلٌ مَّا هُمْ:} یعنی ایمان اور عمل صالح والے لوگ، جو اپنے شریک پر ظلم نہ کریں، وہ بہت ہی کم ہیں، اکثریت کا حال اس کے خلاف ہے۔ جمہوریت کے علم برداروں کو اس پر غور کرنا چاہیے۔ اس مفہوم کی مزید آیات کے لیے دیکھیے سورۂ سبا (۱۳)، بقرہ (۲۴۳)، انعام (۱۱۷)، ہود (۱۷)، یوسف (۱۰۳، ۱۰۶)، زخرف (۷۸)، اور سورۂ مائدہ (۱۰۰)۔ ¤ ➍ { وَ ظَنَّ دَاوٗدُ:’’ ظَنَّ ‘‘} راجح گمان کو کہتے ہیں، قرائن سے حاصل ہونے والے یقین پر بھی ’’ظن‘‘ کا لفظ بولا جاتا ہے، جیسا کہ فرمایا : «وَ ظَنُّوْۤا اَنْ لَّا مَلْجَاَ مِنَ اللّٰهِ اِلَّاۤ اِلَيْهِ » [ التوبۃ : ۱۱۸ ] ’’اور انھوں نے یقین کر لیا کہ اللہ سے پناہ کی کوئی جگہ اس کی جناب کے سوا نہیں۔‘‘ اور فرمایا : « الَّذِيْنَ يَظُنُّوْنَ اَنَّهُمْ مُّلٰقُوْا رَبِّهِمْ وَ اَنَّهُمْ اِلَيْهِ رٰجِعُوْنَ» [ البقرۃ : ۴۶ ] ’’جو یقین رکھتے ہیں کہ وہ اپنے رب سے ملنے والے ہیں اور یہ کہ وہ اسی کی طرف لوٹنے والے ہیں۔‘‘ یہاں {’’ ظَنَّ ‘‘} کا معنی {’’شَعُرَ‘‘} (سمجھ گیا) ہے، یا {’’أَيْقَنَ‘‘} (یقین کر لیا) ہے، کیونکہ اس کے بعد {’’أَنَّ‘‘} حرف تاکید آ رہا ہے۔ ¤ ➎ { اَنَّمَا فَتَنّٰهُ :} یعنی داؤد علیہ السلام کو یقین ہو گیا کہ ان لوگوں کا اس طرح دیوار پھلانگ کر آنا میری آزمائش ہے کہ میں اپنی کوتاہی پر متنبّہ ہو کر اسے ترک کرتا اور اس کی معافی مانگتا ہوں یا نہیں۔ ¤ ➏ {فَاسْتَغْفَرَ رَبَّهٗ :} تو انھوں نے اپنے رب سے معافی مانگی اور بخشش کی دعا کی۔ ¤ ➐{ وَ خَرَّ رَاكِعًا وَّ اَنَابَ :} رکوع کا معنی جھکنا یا سر جھکانا ہے۔ {’’ خَرَّ ‘‘} زمین پر گر پڑا۔ یعنی وہ رکوع کرتے ہوئے نیچے گر گئے، مراد یہ ہے کہ وہ جھکتے ہوئے سجدے میں گر گئے۔ اس لیے بعض مفسرین نے فرمایا کہ یہاں رکوع سے مراد سجدہ ہے۔ {’’ وَ اَنَابَ ‘‘} (اور انھوں نے اللہ کی طرف رجوع کیا) بعض مفسرین نے لکھا ہے کہ ’’داؤد علیہ السلام چالیس دن سجدے میں پڑے روتے رہے، حتیٰ کہ ان کے آنسوؤں سے زمین پر سبزہ اُگ آیا۔‘‘ ایسی باتیں تردید کے بغیر لکھنے والوں پر افسوس ہوتا ہے کہ وہ ایسی باتیں لکھ رہے ہیں جو نہ صرف یہ کہ قرآن یا حدیث میں نہیں آئیں بلکہ صاف عقل کے خلاف ہیں۔ چالیس دن ان کے کھانے پینے اور دوسری ضروریات زندگی، نماز اور امور مملکت کی نگرانی وغیرہ کا کیا بنا؟ یہ نتیجہ ہے سنی سنائی بات اندھا دھند نقل کرنے کا، خواہ وہ اسرائیلی روایت ہو یا کسی اور کی بنائی ہوئی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَفٰي بِالْمَرْئِ كَذِبًا أَنْ يُّحَدِّثَ بِكُلِّ مَا سَمِعَ ] [ مسلم، المقدمۃ : ۵، عن أبي ھریرۃ رضی اللہ عنہ ] ’’آدمی کو جھوٹا ہونے کے لیے یہی کافی ہے کہ وہ ہر سنی ہوئی بات آگے بیان کر دے۔‘‘ ¤ ➑ ان آیات کو سمجھنے میں اکثر لوگوں نے ٹھوکر کھائی ہے، جس کی وجہ مسلمانوں کا قرآن کی تفسیر میں اسرائیلی روایات پر اعتماد ہے، حالانکہ یہود کی اللہ کے پیغمبروں خصوصاً داؤد و سلیمان علیھما السلام سے دشمنی سب کو معلوم ہے۔ اگر کوئی شخص ان روایات سے ذہن کو صاف کر لے تو آیات کا مطلب سمجھنا کچھ مشکل نہیں۔ اس لیے پہلے آیات کا مطلب بیان کیا جاتا ہے، اس کے بعد ان روایات کے متعلق مختصر سی بات ہو گی۔ ان آیات کو سمجھنے کے لیے ان سے پہلی آیات پر ایک نظر ڈالنا ضروری ہے: (۱) یہ بات بالکل واضح ہے کہ آیات کے اس سلسلہ میں قرآن مجید داؤد علیہ السلام کی تعریف بیان فرما رہا ہے۔ (3) قرآن کے الفاظ یا مفہوم میں کوئی اشارہ بھی نہیں کہ یہ کوئی رمز یا کنایہ کی بات ہے، جو اللہ تعالیٰ نے داؤد علیہ السلام کے کسی ایسے فعل پر ناراضی کے اظہار کے لیے فرمائی ہے جو شریعت کے خلاف یا فضیلت کے خلاف تھا۔ (3) اللہ تعالیٰ نے اس مقام پر نبی صلی اللہ علیہ وسلم کو اپنی قوم کی باتوں پر صبر کا حکم دیتے ہوئے داؤد علیہ السلام کو نمونے کے طور پر پیش فرمایا ہے۔ آیات کا خلاصہ یہ ہے کہ اللہ تعالیٰ نبی صلی اللہ علیہ وسلم کو فرما رہے ہیں کہ اگر آپ کا سینہ اپنی قوم کے کفر سے تنگ ہوتا ہے تو صبر کریں اور ہمارے بندے داؤد کو یاد کریں۔ ساتھ ہی داؤد علیہ السلام کا ذکر نہایت عزت و تکریم کے ساتھ کیا ہے اور ان کی تعریف بہت بلند اوصاف کے ساتھ فرمائی ہے :(1) انھیں {’’ عَبْدَنَا ‘‘} (ہمارا بندہ) کہا ہے، یہ اکیلا لفظ ہی سب اوصاف پر بھاری ہے، جیسا کہ ہمارے نبی کریم صلی اللہ علیہ وسلم کے متعلق فرمایا : « سُبْحٰنَ الَّذِيْۤ اَسْرٰى بِعَبْدِهٖ لَيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ اِلَى الْمَسْجِدِ الْاَقْصَا الَّذِيْ بٰرَكْنَا حَوْلَهٗ » [ بني إسرائیل : ۱ ] ’’پاک ہے وہ جو رات کے ایک حصے میں اپنے بندے کو حرمت والی مسجد سے بہت دور کی اس مسجد تک لے گیا جس کے ارد گرد کو ہم نے برکت دی۔‘‘ (2) پھر بتایا کہ وہ {’’ ذَا الْاَيْدِ ‘‘} (حق کی قوت والے تھے) (3) {’’ اَوَّابٌ ‘‘} (اللہ کی طرف بہت رجوع کرنے والے) تھے۔ (4) {’’ اِنَّا سَخَّرْنَا الْجِبَالَ مَعَهٗ يُسَبِّحْنَ بِالْعَشِيِّ ووَ الْاِشْرَاقِ ‘‘} (ہماری طرف سے پہاڑ ان کے ہمراہ مسخر تھے، صبح و شام تسبیح کرتے تھے) (5) {’’ وَ الطَّيْرَ مَحْشُوْرَةً ‘‘} (جمع کیے پرندے بھی ان کے ہمراہ تسبیح کے لیے مسخر تھے) (6) {’’ وَ شَدَدْنَا مُلْكَهٗ ‘‘} (اور ہم نے اس کی سلطنت مضبوط کر دی) (7) {’’ وَ اٰتَيْنٰهُ الْحِكْمَةَ ‘‘} (اور انھیں حکمت عطا فرمائی) (8) {’’ وَ فَصْلَ الْخِطَابِ ‘‘} (اور فیصلہ کن گفتگو عطا فرمائی) (9) اس کے بعد یہ واقعہ ذکر فرمایا، جس کے بعد پہلے دنیا میں انھیں عطا ہونے والا مقام ذکر فرمایا : {’’ يٰدَاوٗدُ اِنَّا جَعَلْنٰكَ خَلِيْفَةً فِي الْاَرْضِ ‘‘} (اے داؤد! ہم نے تجھے زمین میں خلیفہ بنایا) (10) پھر اپنے ہاں ان کا مرتبہ اور آخرت میں ان کا مقام بیان فرمایا : {’’ وَ اِنَّ لَهٗ عِنْدَنَا لَزُلْفٰى ‘‘} (اور بلاشبہ اس کے لیے ہمارے پاس یقینا بڑا قرب ہے) (11) {’’ وَ حُسْنَ مَاٰبٍ ‘‘} (اور اچھا ٹھکانا ہے)۔ ان اوصاف سے ظاہر ہے کہ داؤد علیہ السلام اللہ تعالیٰ کے نہایت مقرّب اور محبوب پیغمبر تھے اور ایسی تمام روایات ان پر صریح بہتان اور ظلم ہیں جن سے وہ ایک عام شریف آدمی سے بھی فرو تر نظر آتے ہیں، تو پھر ان آیات کا مطلب کیا ہے اور ان دو جھگڑنے والوں کا مقصد کیا ہے؟ ¤ حقیقت یہ ہے کہ داؤد علیہ السلام نبی تھے اور بادشاہ بھی اور یہ دونوں بہت بھاری ذمہ داریاں ہیں۔ ان کے علاوہ انھیں اللہ تعالیٰ کی عبادت یعنی تسبیح، ذکر الٰہی، تلاوت، قیام اللیل اور روزوں کا بہت شوق تھا، اس لیے اس کے بغیر چارہ ہی نہ تھا کہ وہ تسبیح و ذکر، نبوت کے فرائض اور بادشاہت کی ذمہ داریوں کی ادائیگی کے لیے اپنے اوقات تقسیم کریں۔ اس کے ساتھ یہ بھی شامل کر لیں کہ وہ صرف اپنے ہاتھ کی کمائی کھاتے تھے، جس کے لیے انھیں لوہے کی زرہیں بنانے کا مشکل اور باریک کام کرنا پڑتا تھا، سورۂ سبا کی آیت (۱۱) : « اَنِ اعْمَلْ سٰبِغٰتٍ وَّ قَدِّرْ فِي السَّرْدِ » ( کہ کشادہ زرہیں بنا اور کڑیاں جوڑنے میں اندازہ رکھ) سے ان کے کام کی مشقت اور باریکی کا اندازہ ہوتا ہے۔ اب نبوت، سلطنت، عبادت اور کمائی کے لیے وقت کیسے تقسیم کریں؟ اس کے لیے انھوں نے کچھ اوقات نبوت و سلطنت اور کمائی کے امور کے لیے رکھے اور کچھ وقت عبادت کے لیے خاص کر لیا، جس میں وہ اپنے محراب (عبادت خانے) سے نہیں نکلتے تھے۔ اللہ تعالیٰ نے چاہا کہ داؤد علیہ السلام کو اس بات کا پتا چل جائے کہ جب وہ عبادت کے لیے خلوت اختیار کرتے ہیں اس وقت بھی لوگوں کے ایک دوسرے پر ایسے ظلم واقع ہوتے ہیں جن کے لیے داؤد علیہ السلام کے عدل کی ضرورت ہے۔ چنانچہ اللہ تعالیٰ نے ان دو جھگڑنے والوں کے لیے یہ آسانی پیدا فرمائی کہ دروازے بند ہونے اور پہرے داروں کی موجودگی کے باوجود وہ دیوار پھاند کر ان کے عبادت خانے میں داخل ہو گئے اور ان میں سے ایک نے اپنا قصہ سنایا اور وہ ظلم بیان کیا جو اس کے بھائی نے اس پر کیا تھا کہ کس طرح وہ بہت دولت مند اور ننانوے دنبیوں کا مالک ہونے کے باوجود اپنے فقیر بھائی سے، جو صرف ایک دنبی کا مالک ہے، اس کی واحد ملکیت بھی بہت سختی کے ساتھ اپنے سپرد کرنے کا مطالبہ کر رہا ہے۔ داؤد علیہ السلام ان کے اس طرح آنے پر پہلے گھبرائے، مگر جب حقیقت حال معلوم ہوئی تو نہ ان سے ناراض ہوئے اور نہ انھیں پھر آنے کی تاریخ دی، بلکہ ان کا مقدمہ سن کر فوراً فیصلہ فرما دیا۔ ساتھ ہی سمجھ گئے کہ عبادت والے دن بھی لوگوں کے درمیان جھگڑے اور ایک دوسرے پر ظلم ہوتے ہیں، مگر ان کے عبادت میں مصروف ہونے کی وجہ سے مظلوم ان کے پاس فریاد لے کر نہیں پہنچ سکتے، حالانکہ لوگوں کے درمیان صلح اور مظلوم کی مدد عبادت خانے کی خلوت سے افضل ہے اور انھیں یقین ہو گیا کہ ان لوگوں کے اس طرح آنے سے اللہ تعالیٰ نے میری آزمائش کی ہے کہ میں یہ بات سمجھتا ہوں یا نہیں کہ عبادت میں ایسی مصروفیت نہیں ہونی چاہیے کہ مظلوم کو عدالت تک رسائی نہ ہو سکے۔ اس لیے انھوں نے اپنی اس کوتاہی پر اپنے رب سے معافی مانگی اور اس کی طرف رجوع کرتے ہوئے سجدے میں گر گئے، تو ہم نے انھیں معاف کر دیا۔ ¤ ➒ اکثر مفسرین نے داؤد علیہ السلام کی کوئی ایسی غلطی تلاش کرنے کی کوشش کی ہے جو ننانوے دنبیوں اور ایک دنبی کے واقعہ سے ملتی جلتی ہو۔ حالانکہ یہ واقعہ انتہائی ظلم اور مظلومیت کی ایک تصویر ہے کہ ایک بہت دولت مند شخص اپنے فقیر بھائی سے اس کی ایک دنبی بھی چھین لینا چاہتا ہے اور حاکم وقت دروازے بند کرکے عبادت میں مصروف ہے، اب مظلوم کیا کرے؟ بعض لوگوں نے کہا، وہ دوسرے دن پیش ہو سکتے تھے، مگر سب جانتے ہیں کہ انصاف میں تاخیر بھی ظلم کے مترادف ہوتی ہے۔ دیوار پھاند کر جانے سے اور قصہ سنانے سے داؤد علیہ السلام پر یہ حقیقت منکشف ہوئی کہ آپ کو اللہ تعالیٰ نے خلیفہ بنایا ہے، جس کا کام لوگوں کے فیصلے کرنا ہے۔ عبادت کریں، مگر اس طرح نہیں کہ فریادی آپ کی عدالت میں بار نہ پا سکیں، فرمایا : « يٰدَاوٗدُ اِنَّا جَعَلْنٰكَ خَلِيْفَةً فِي الْاَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ ب بِالْحَقِّ وَ لَا تَتَّبِعِ الْهَوٰى فَيُضِلَّكَ عَنْ سَبِيْلِ اللّٰهِ اِنَّ الَّذِيْنَ يَضِلُّوْنَ عَنْ سَبِيْلِ اللّٰهِ لَهُمْ عَذَابٌ شَدِيْدٌۢ بِمَا نَسُوْا يَوْمَ الْحِسَابِ » [ صٓ : ۲۶ ] ’’اے داؤد! بے شک ہم نے تجھے زمین میں خلیفہ بنایا ہے، سو تو لوگوں کے درمیان حق کے ساتھ فیصلہ کر اور خواہش کی پیروی نہ کر، ورنہ وہ تجھے اللہ کی راہ سے بھٹکا دے گی۔ یقینا وہ لوگ جو اللہ کی راہ سے بھٹک جاتے ہیں، ان کے لیے سخت عذاب ہے، اس لیے کہ وہ حساب کے دن کو بھول گئے۔‘‘ ’’خلیفہ‘‘ سے مراد حاکم ہے، جو پہلے لوگوں کی جگہ حکمران بنتا ہے، ’’اللہ کا خلیفہ‘‘ کہنا درست نہیں۔ دیکھیے سورۂ بقرہ (۳۰)۔ ¤ ➓ بعض لوگوں نے ان دو جھگڑنے والوں کو فرشتے بتایا ہے اور لکھا ہے کہ داؤد علیہ السلام نے فیصلہ کیا تو وہ ہنس پڑے اور غائب ہو گئے۔ یہ ساری بات ہی بے اصل ہے، جس کا قرآن و حدیث میں کوئی وجود نہیں۔ ¤ ⓫ داؤد علیہ السلام کی غلطی نکالتے ہوئے اکثر مفسرین نے لکھا ہے کہ وہ ایک عورت کو نہاتے ہوئے دیکھ کر اس پر عاشق ہو گئے اور اس کے خاوند ’’اوریاہ‘‘ کو جہاد میں ایسی جگہ مقرر کرنے کا حکم دیا جہاں وہ قتل ہو گیا تو اس کی بیوی سے نکاح کر لیا، حالانکہ ان کی ننانوے بیویاں موجود تھیں۔ بعض نے کہا، اس سے طلاق دینے کا تقاضا کیا، جسے وہ ٹھکرا نہ سکا، تو اس سے نکاح کر لیا۔ یہودی ملعون یہاں تک پہنچ گئے کہ انھوں نے داؤد علیہ السلام پر بہتان باندھتے ہوئے تورات میں بھی تحریف کر دی اور کہا کہ انھوں نے اوریاہ کی بیوی کو نہاتے ہوئے دیکھ کر اٹھوا لیا اور (نعوذ باللہ) اس سے ہم بستر ہوئے، جس سے وہ حاملہ ہو گئی، پھر اس کے خاوند کو جنگ میں بھیج کر مروا دیا اور اس کی عدت ختم ہونے کے بعد اسے اپنی بیوی بنا لیا، جس سے لڑکا پیدا ہوا، جس سے اللہ تعالیٰ اس پر ناراض ہوا۔ (خلاصہ سموئیل دوم، باب ۱۱، فقرہ ۲ سے ۲۷ تک) ¤ بعض حضرات نے داؤد علیہ السلام کی یہ غلطی نکالی ہے کہ انھوں نے صرف مدّعی کی بات سن کر فیصلہ کر دیا، جب کہ انھیں دوسرے فریق کی بات سننا بھی ضروری تھا۔ حالانکہ وہاں اختصار کے لیے دوسرے فریق کی بات کا ذکر نہیں ہوا۔ کسی بات کے ذکر نہ ہونے سے اس کی نفی نہیں ہوتی اور یہ بھی ہو سکتا ہے کہ اس نے خاموش رہ کر مظلوم کے دعویٰ کو قبول کر لیا ہو۔ یہ اور اس جیسی کئی فضول باتیں بعض مفسرین نے داؤد علیہ السلام پر بہتان باندھتے ہوئے لکھی ہیں، جب کہ اسرائیلی روایات پر اعتماد جائز ہی نہیں، خصوصاً جب ان سے کسی پیغمبر کی عزت و عصمت پر حرف آتا ہو۔ اس معاملے میں مفسر ابن کثیر رحمہ اللہ کا کلام بہت عمدہ ہے، وہ لکھتے ہیں : {’’ قَدْ ذَكَرَ الْمُفَسِّرُوْنَ هَاهُنَا قِصَّةً أَكْثَرُهَا مَأْخُوْذٌ مِّنَ الإِْسْرَائِيْلِيَّاتِ وَلَمْ يَثْبُتْ فِيْهَا عَنِ الْمَعْصُوْمِ حَدِيْثٌ يَجِبُ اتِّبَاعُهُ وَلٰكِنْ رَوَي ابْنُ أَبِيْ حَاتِمٍ هُنَا حَدِيْثًا لَا يَصِحُّ سَنَدُهُ، لِأَنَّهُ مِنْ رِوَايَةِ يَزِيْدَ الرُّقَاشِيِّ عَنْ أَنَسٍ رَضِيَ اللّٰهُ عَنْهُ، وَ يَزِيْدُ وَ إِنْ كَانَ مِنَ الصَّالِححِيْنَ، لٰكِنَّهُ ضَعِيْفُ الْحَدِيْثِ عِنْدَ الْأَئِمَّةِ، فَالْأَوْلٰي أَنْ يُّقْتَصَرَ عَلٰي مُجَرَّدِ تِلَاوَةِ هٰذِهِ الْقِصَّةِ وَ أَنْ يُّرَدَّ عِلْمُهَا إِلَي اللّٰهِ عَزَّ وَجَلَّ فَإِنَّ الْقُرْآنَ حَقٌّ وَمَا تُضَمِّنُ فَهُوَ حَقٌّ أَيْضًا ‘‘} ’’مفسرین نے یہاں ایک قصہ ذکر کیا ہے، جس کا اکثر حصہ اسرائیلیات سے لیا گیا ہے اور اس کے متعلق معصوم (نبی کریم صلی اللہ علیہ وسلم ) سے کوئی حدیث ثابت نہیں، جس کی پیروی واجب ہو۔ لیکن ابن ابی حاتم نے یہاں ایک حدیث بیان کی ہے جس کی سند صحیح نہیں، کیونکہ وہ یزید رقاشی کی روایت سے ہے، جو وہ انس رضی اللہ عنہ سے بیان کرتے ہیں۔ یزید اگرچہ نیک لوگوں سے ہے، لیکن وہ ائمہ حدیث کے نزدیک ضعیف الحدیث ہے۔ سو بہتر یہ ہے کہ اس قصے کی صرف تلاوت پر اکتفا کیا جائے اور اس کا علم اللہ عز و جل کی طرف لوٹا دیا جائے، کیونکہ قرآن حق ہے اور جو کچھ اس میں ہے، وہ بھی حق ہے۔‘‘"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ {يٰدَاوٗدُ اِنَّا جَعَلْنٰكَ خَلِيْفَةً فِي الْاَرْضِ … :} یہاں لفظ {’’قُلْنَا‘‘} (ہم نے کہا) محذوف ہے، یعنی ہم نے کہا اے داؤد! تمھارا مقام دوسرے لوگوں سے بہت بلند ہے، تم خلیفہ ہو اور وہ رعایا ہیں، تم حاکم ہو اور وہ محکوم ہیں۔ اس لیے لوگوں کے درمیان حق کے ساتھ فیصلہ کرو اور اس میں اپنی یا کسی دوسرے کی خواہش کا دخل نہ آنے دو، کیونکہ یہی چیز اللہ کی راہ سے بہکانے والی ہوتی ہے۔ ¤ ➋ { اِنَّ الَّذِيْنَ يَضِلُّوْنَ عَنْ سَبِيْلِ اللّٰهِ لَههُمْ عَذَابٌ شَدِيْدٌۢ … :} یعنی انسان بہکتا اسی وقت ہے جب اپنی یا کسی کی خواہش نفس کے پیچھے لگتا ہے اور یہ کام وہ تبھی کرتا ہے جب اسے حساب کا دن یاد نہ رہے۔ اگر اللہ کے سامنے جواب دہی کا تصور آنکھوں کے سامنے رہے تو انسان اپنی یا کسی کی خواہش کی پروا نہیں کرتا اور جو شخص یوم حساب کو بھول جائے وہ اپنی ہر جائز و ناجائز خواہش کے پیچھے چلے گا اور شتر بے مہار کی طرح زندگی گزارے گا۔ جس کا نتیجہ اسے شدید عذاب کی صورت میں بھگتنا پڑے گا۔ ¤ ➌ بعض لوگوں نے اللہ تعالیٰ کے داؤد علیہ السلام سے خطاب {’’ وَ لَا تَتَّبِعِ الْهَوٰى ‘‘} (خواہش کی پیروی نہ کر) سے نکالا ہے کہ داؤد علیہ السلام کسی خواہش کی پیروی کر بیٹھے تھے، اس پر یہ حکم ہوا۔ حالانکہ خواہش کی پیروی سے تو ہمارے نبی صلی اللہ علیہ وسلم کو بھی منع کیا گیا ہے، تو کیا آپ صلی اللہ علیہ وسلم بھی کسی خواہش کی پیروی کر بیٹھے تھے۔ کسی کام سے منع کرنے کا مطلب یہ نہیں ہوتا کہ مخاطب وہ کام کر چکا ہے یا کر رہا ہے، بلکہ آئندہ محتاط رہنے کی تاکید کے لیے بھی حکم ہوتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کو مخاطب کرتے ہوئے فرمایا : « وَ اَنِ احْكُمْ بَيْنَهُمْ بِمَاۤ اَنْزَلَ اللّٰهُ وَ لَا تَتَّبِعْ اَهْوَآءَهُمْ » [ المائدۃ : ۴۹ ] ’’اور یہ کہ ان کے درمیان اس کے ساتھ فیصلہ کر جو اللہ نے نازل کیا ہے اور ان کی خواہشوں کی پیروی نہ کر۔‘‘ اسی طرح اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم کو مخاطب کرتے ہوئے فرمایا : « اَلْحَقُّ مِنْ رَّبِّكَ فَلَا تَكُوْنَنَّ مِنَ الْمُمْتَرِيْنَ » [ البقرۃ : ۱۴۷ ] ’’یہی تیرے رب کی طرف سے حق ہے، پس تو ہرگز شک کرنے والوں میں سے نہ ہو۔‘‘ اور فرمایا : «فَلَا تَكُوْنَنَّ مِنَ الْجٰهِلِيْنَ » [ الأنعام : ۳۵ ] ’’پس تو جاہلوں میں سے ہرگز نہ ہو۔‘‘ سورۂ قصص میں ہے : « فَلَا تَكُوْنَنَّ ظَهِيْرًا لِّلْكٰفِرِيْنَ» [ القصص : ۸۶ ] ’’سو تو ہرگز کافروں کا مددگار نہ بن۔‘‘ اور اس سے اگلی آیت میں ہے : « وَ لَا تَكُوْنَنَّ مِنَ الْمُشْرِكِيْنَ » [ القصص : ۸۷ ] ’’اور ہر گز مشرکوں سے نہ ہو۔‘‘ تو کیا ان آیات سے یہ سمجھا جائے کہ (نعوذ باللہ) رسول اللہ صلی اللہ علیہ وسلم کو ان کاموں سے اس لیے روکا گیا کہ آپ یہ سب کچھ کر رہے تھے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ {وَ مَا خَلَقْنَا السَّمَآءَ وَ الْاَرْضَ وَ مَا بَيْنَهُمَا بَاطِلًا:} پچھلی آیت میں خواہش پرستی کا اصل سبب یومِ حساب کو بھولنا بتایا ہے، اب یومِ حساب کے حق ہونے کی چند دلیلیں ذکر فرمائیں۔ سب سے پہلی دلیل یہ ہے کہ کوئی شخص اپنا معمولی سا کھیت بھی کسی نوکر کے حوالے کرے تو ممکن نہیں کہ اس سے باز پرس نہ کرے، تو یہ کیسے ہو سکتا ہے کہ اللہ تعالیٰ نے اتنے عظیم الشّان آسمان و زمین اور ان کے مابین کی چیزیں پیدا کیں، پھر زمین پر انسان کو بسایا اور اس کی ہر چیز اس کے لیے پیدا فرمائی، جیسا کہ فرمایا : « هُوَ الَّذِيْ خَلَقَ لَكُمْ مَّا فِي الْاَرْضِ جَمِيْعًا» [ البقرۃ : ۲۹ ] ’’ وہی ہے جس نے زمین میں جو کچھ ہے سب تمھارے لیے پیدا کیا۔‘‘ آسمان کو اس کے لیے چھت بنایا، اس کی ہر ضرورت کا بندوبست فرمایا، پھر وہ اس سے اس کی کارکردگی کے متعلق سوال نہ کرے۔ اس کا مطلب تو یہ ہوا کہ یہ سب کچھ اس نے باطل اور بے مقصد ہی پیدا کیا ہے اور یہ سب کچھ محض کھیل ہے جو اللہ تعالیٰ کھیل رہا ہے۔ نہیں! تم سب کو ہر حال میں اللہ تعالیٰ کے سامنے پیش ہونا ہے۔ یہی بات اللہ تعالیٰ نے قرآن مجید میں کئی طریقوں سے بیان فرمائی ہے، جیسا کہ فرمایا : « اَفَحَسِبْتُمْ اَنَّمَا خَلَقْنٰكُمْ عَبَثًا وَّ اَنَّكُمْ اِلَيْنَا لَا تُرْجَعُوْنَ» [ المؤمنون : ۱۱۵ ] ’’تو کیا تم نے گمان کر لیا کہ ہم نے تمھیں بے مقصد ہی پیدا کیا ہے اور یہ کہ تم ہماری طرف نہیں لوٹائے جاؤ گے؟‘‘ اور فرمایا : « وَ مَا خَلَقْنَا السَّمٰوٰتِ وَ الْاَرْضَ وَ مَا بَيْنَهُمَا لٰعِبِيْنَ (38) مَا خَلَقْنٰهُمَاۤ اِلَّا بِالْحَقِّ وَ لٰكِنَّ اَككْثَرَهُمْ لَا يَعْلَمُوْنَ (39) اِنَّ يَوْمَ الْفَصْلِ مِيْقَاتُهُمْ اَجْمَعِيْنَ » [ الدخان : ۳۸ تا ۴۰ ] ’’اور ہم نے آسمانوں اور زمین کو اور جو کچھ ان کے درمیان ہے کھیلتے ہو ئے نہیں بنایا۔ ہم نے ان دونوں کو حق ہی کے ساتھ پیدا کیا ہے اور لیکن ان کے اکثر نہیں جانتے۔ یقینا فیصلے کا دن ان سب کا مقرر وقت ہے۔‘‘ ¤ ➋ {ذٰلِكَ ظَنُّ الَّذِيْنَ كَفَرُوْا :} یعنی اس آسمان و زمین اور ان کے درمیان جو کچھ ہے اس کے باطل اور بے مقصد ہونے کا خیال ان لوگوں کا ہے جو توحید و آخرت کے منکر ہیں۔ ¤ ➌ { فَوَيْلٌ لِّلَّذِيْنَ كَفَرُوْا مِنَ النَّارِ:} یہاں {’’فَوَيْلٌ لَّهُمْ‘‘} (تو ان کے لیے بڑی ہلاکت ہے) کہنے کے بجائے {’’ فَوَيْلٌ لِّلَّذِيْنَ كَفَرُوْا ‘‘} (سو ان لوگوں کے لیے جنھوں نے کفر کیا آگ کی صورت میں بڑی ہلاکت ہے)کہنے کا مطلب یہ ہے کہ اس ویل (بڑی ہلاکت) کا باعث ان لوگوں کا کفر ہے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) { اَمْ نَجْعَلُ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ كَالْمُفْسِدِيْنَ … :} یہ یومِ حساب حق ہونے کی دوسری دلیل ہے کہ اگر یومِ حساب نہ ہو تو اس کا مطلب یہ ہوا کہ ایمان اور عمل صالح والے اور زمین میں فساد کرنے والے ہمارے ہاں ایک جیسے ہیں، اس طرح ہم سے ڈرنے والے اور ڈھیٹ بن کر نافرمانی کرنے والے دونوں یکساں ہیں۔ خود ہی سوچو، کیا عدل و حکمت کا تقاضا یہ ہے اور کیا ہم ایسا ہونے دیں گے؟ دنیا میں تو امتحان کی وجہ سے اور مختصر مدت ہونے کی وجہ سے نیک و بد کی جزا و سزا پوری طرح ممکن نہیں، یہ سب کچھ یومِ حساب میں ہو گا۔ اس کی ہم معنی سورۂ جاثیہ کی آیت (۲۱) بھی ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ {كِتٰبٌ اَنْزَلْنٰهُ اِلَيْكَ مُبٰرَكٌ:} یعنی جب نیک و بد ایک جیسے نہیں ہو سکتے تو اللہ تعالیٰ کی طرف سے نیکی اور بدی کی راہ نمائی ضروری ہے۔ اس کے لیے یہ کتاب ہے جو ہم نے آپ کی طرف نازل کی ہے، یہ بہت برکت والی ہے، یعنی اس میں بہت زیادہ خیر کی باتیں جمع ہیں۔ ¤ ➋ {لِيَدَّبَّرُوْۤا اٰيٰتِهٖ …: ’’ لِيَدَّبَّرُوْۤا ‘‘} اصل میں {’’لِيَتَدَبَّرُوْا‘‘} (تفعّل) ہے۔ یعنی یہ کتاب نازل کرنے کا مقصد یہ ہے کہ لوگ اس کی آیات میں غور و فکر کریں اور عقلوں والے لوگ اس سے نصیحت حاصل کریں، کیونکہ نصیحت وہی حاصل کیا کرتے ہیں، جیسا کہ فرمایا : « اِنَّمَا يَتَذَكَّرُ اُولُوا الْاَلْبَابِ» [ الرعد : ۱۹ ] ’’نصیحت تو صرف عقلوں والے ہی قبول کرتے ہیں۔‘‘ آیات میں تدبّر کا فائدہ تب ہے جب آدمی ان پر عمل کرے۔ ابنِ کثیر رحمہ اللہ نے حسن بصری کا قول نقل فرمایا ہے : ’’اللہ کی قسم! قرآن کا تدبّر صرف یہ نہیں کہ اس کے الفاظ حفظ کر لیے جائیں اور اس کی حدود و احکام کو ضائع کر دیا جائے، یہاں تک کہ کچھ لوگ کہتے ہیں، میں نے پورا قرآن پڑھ لیا ہے، حالانکہ قرآن کا کوئی اثر نہ ان کے اخلاق و عادات میں نظر آتا ہے نہ ان کے اعمال اور کاموں میں۔‘‘ اسے ابنِ ابی حاتم نے روایت کیا۔ ( ابن کثیر)"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { وَ وَهَبْنَا لِدَاوٗدَ سُلَيْمٰنَ :} داؤد علیہ السلام پر انعامات کا ذکر کرتے ہوئے فرمایا کہ ہم نے انھیں سلیمان جیسا بلند مرتبے والا بیٹا عطا کیا۔ جو ان کی طرح نبی تھا اور ایسا بادشاہ تھا کہ اس کے بعد ایسا بادشاہ نہیں ہوا۔ سلیمان علیہ السلام کے واقعات کے لیے دیکھیے سورۂ انبیاء (۷۸ تا ۸۱)، نمل (۱۵ تا ۴۴) اور سبا (۱۲)۔ ¤ ➋ { نِعْمَ الْعَبْدُ اِنَّهٗۤ اَوَّابٌ : ’’ اَوَّابٌ ‘‘ آبَ يَؤُوْبُ أَوْبًا} (ن) سے مبالغے کا صیغہ ہے، بہت رجوع کرنے والا۔ یعنی وہ اللہ کے بہت اچھے بندے تھے اور اپنے ہر معاملے میں اللہ کی طرف بہت رجوع کرنے والے تھے اور کوئی قدم اپنی خواہش کی بنا پر نہیں اٹھاتے تھے۔ آگے ان کے اللہ تعالیٰ کا اچھا بندہ اور اس کی طرف بہت رجوع کرنے والا ہونے کی مثال کے طور پر ان کے دو واقعات بیان فرمائے ہیں۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت31 ) {اِذْ عُرِضَ عَلَيْهِ بِالْعَشِيِّ الصّٰفِنٰتُ الْجِيَادُ : ’’اَلْعَشِيُّ‘‘} ظہر سے لے کر شام تک کا وقت، بعض ساری رات بھی اس میں شامل کرتے ہیں۔ {’’ الصّٰفِنٰتُ ‘‘ ’’صَافِنٌ‘‘} کی جمع ہے، وہ گھوڑا جو کھڑا ہو تو تین پاؤں کو پوری طرح زمین پر رکھے اور چوتھے سُم کا سرا زمین کے ساتھ لگا رہے۔ یہ صفت عموماً اعلیٰ نسل کے گھوڑوں میں پائی جاتی ہے۔ {’’ الْجِيَادُ ‘‘ ’’جَوَادٌ‘‘} کی جمع ہے، تیز رفتار۔ یہ دونوں الفاظ مذکر و مؤنث دونوں گھوڑوں پر بولے جاتے ہیں۔ دو صفتیں اس لیے بیان فرمائیں کہ کھڑے ہونے کی حالت میں وہ گھوڑے ’’صافنات‘‘ تھے اور چلنے میں ’’جواد‘‘ (تیز رفتار) تھے۔ یعنی پچھلے پہر اعلیٰ نسل کے تیز رفتار گھوڑے ان کے سامنے معائنے کے لیے پیش کیے گئے۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ {فَقَالَ اِنِّيْۤ اَحْبَبْتُ حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّيْ : ’’ الْخَيْرِ ‘‘} کا معنی تو بھلائی ہے، مگر عموماً اس سے مراد مال ہوتا ہے، جیسا کہ انسان کے متعلق فرمایا : «وَ اِنَّهٗ لِحُبِّ الْخَيْرِ لَشَدِيْدٌ » [ العادیات : ۸ ] ’’اور بے شک وہ مال کی محبت میں یقینا بہت سخت ہے۔‘‘ یہ لفظ عموماً زیادہ مال پر بولا جاتا ہے۔ یہاں {’’ الْخَيْرِ ‘‘} سے مراد وہ اصیل اور تیز رفتار گھوڑے ہیں جو پچھلے پہر ان کے سامنے پیش کیے گئے۔ {’’ الْخَيْرِ ‘‘} پر الف لام عہد کا ہے، اس لیے {’’ حُبَّ الْخَيْرِ ‘‘} کا ترجمہ ’’اس مال کی محبت‘‘ کیا گیا ہے۔ {’’ عَنْ ‘‘} یہاں سببیہ ہے، جس کا معنی ’’کی وجہ سے‘‘ ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : « وَ مَا كَانَ اسْتِغْفَارُ اِبْرٰهِيْمَ لِاَبِيْهِ اِلَّا عَنْ مَّوْعِدَةٍ وَّعَدَهَاۤ اِيَّاهُ » [ التوبۃ : ۱۱۴ ] ’’اور ابراہیم کا اپنے باپ کے لیے بخشش مانگنا نہیں تھا مگر اس وعدے کی وجہ سے جو اس نے اس سے کیا تھا۔‘‘ ¤ ➋ اس آیت میں سلیمان علیہ السلام کی جہاد سے محبت اور اس کے لیے گھوڑے پالنے اور ان کی تربیت کا ذکر فرمایا ہے، اس مقصد کے لیے انھوں نے بڑی تعداد میں اعلیٰ نسل کے تیز رفتار گھوڑے پال رکھے تھے۔ ایک دن پچھلے پہر ان کے سامنے اعلیٰ نسل کے وہ اصیل گھوڑے پیش کیے گئے جو کھڑے ہونے کی حالت میں اپنی طبیعت کی نفاست اور نزاکت کی وجہ سے تین ٹانگوں پر کھڑے ہوتے تھے، جبکہ چوتھی ٹانگ کے صرف کُھر کا کنارہ زمین پر لگتا تھا، مگر دوڑنے میں بہت تیز رفتار تھے، تو سلیمان علیہ السلام نے اتنے قیمتی گھوڑے رکھنے اور اپنے اوقاتِ عزیزہ ان کے معائنے اور دوڑانے میں صرف کرنے کی وجہ بیان کرنا ضروری سمجھا، تاکہ کوئی یہ خیال نہ کرے کہ یہ محض شاہانہ شان و شوکت کے اظہار کے لیے ہے۔ چنانچہ فرمایا کہ میں نے اس مال یعنی گھوڑوں کی محبت کو دوست رکھا ہے اور اختیار کیا ہے تو اپنے رب کے ذکر کی وجہ سے کہ ان کے ساتھ جہاد کرکے اپنے رب کا ذکر دنیا بھر میں پھیلاؤں اور اس کا بول سب پر بالا کروں۔ ¤ ➌ { حَتّٰى تَوَارَتْ بِالْحِجَابِ : ’’ تَوَارَتْ ‘‘} اصل میں {’’تَوَارَيَتْ‘‘} ہے، {’’تَوَارٰي يَتَوَارٰي تَوَارِيًا‘‘} (تفاعل) (چھپ جانا) سے واحد مؤنث غائب ماضی معلوم کا صیغہ ہے، جو گھوڑوں کی جماعت پر بولا گیا ہے۔ یعنی گھوڑوں کی وہ جماعت نگاہ سے پردے میں چھپ گئی۔ {’’ حَتّٰى ‘‘} (یہاں تک کہ) کا لفظ بتا رہا ہے کہ اس سے پہلے کچھ عبارت محذوف ہے، جو یہ ہے کہ سلیمان علیہ السلام کے حکم پر ان کی دوڑ لگوائی گئی، یہاں تک کہ وہ نگاہ سے پردے میں چھپ گئے۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ { رُدُّوْهَا عَلَيَّ فَطَفِقَ مَسْحًۢا … :} تو انھوں نے حکم دیا کہ انھیں میرے پاس واپس لاؤ۔ جب وہ واپس لائے گئے تو سلیمان علیہ السلام محبت کے ساتھ ان کی پنڈلیوں اور گردنوں پر ہاتھ پھیرنے لگے۔ ¤ ➋ گھوڑوں کی دوڑ لگوانا اور ان کے جسم پر محبت سے ہاتھ پھیرنا دونوں کام جہاد کا حصہ اور باعث اجر و ثواب ہیں۔ اس لیے اللہ تعالیٰ نے سلیمان علیہ السلام کے دونوں عمل ان کے {’’ نِعْمَ الْعَبْدُ اِنَّهٗۤ اَوَّابٌ ‘‘} ہونے کی مثال کے طور پر ذکر فرمائے ہیں۔ ہمارے نبی صلی اللہ علیہ وسلم بھی گھوڑوں کی دوڑ کا مقابلہ کروایا کرتے تھے، عبد اللہ بن عمر رضی اللہ عنھما فرماتے ہیں : [ سَابَقَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ بَيْنَ الْخَيْلِ الَّتِيْ قَدْ أُضْمِرَتْ فَأَرْسَلَهَا مِنَ الْحَفْيَاءِ، وَكَانَ أَمَدُهَا ثَنِيَّةَ الْوَدَاعِ فَقُلْتُ لِمُوْسٰی فَكَمْ كَانَ بَيْنَ ذٰلِكَ؟ قَالَ سِتَّةُ أَمْيَالٍ أَوْ سَبْعَةٌ وَ سَابَقَ بَيْنَ الْخَيْلِ الَّتِيْ لَمْ تُضَمَّرْ، فَأَرْسَلَهَا مِنْ ثَنِييَّةِ الْوَدَاعِ، وَكَانَ أَمَدُهَا مَسْجِدَ بَنِيْ زُرَيْقٍ، قُلْتُ فَكَمْ بَيْنَ ذٰلِكَ؟ قَالَ مِيْلٌ أَوْ نَحْوُهُ وَ كَانَ ابْنُ عُمَرَ مِمَّنْ سَابَقَ فِيْهَا ] [ بخاري، الجہاد، باب غایۃ السبق  للخیل المضمرۃ : ۲۸۷۰ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے تضمیرشدہ گھوڑوں کے درمیان دوڑ کا مقابلہ کروایا۔ چنانچہ انھیں ’’حفیاء‘‘ سے دوڑایا اور ان کی آخری جگہ ’’ثنیۃ الوداع‘‘ تھی۔ (ابواسحاق کہتے ہیں کہ) میں نے موسیٰ بن عقبہ سے پوچھا : ’’ان کے درمیان کتنا فاصلہ تھا؟‘‘ تو انھوں نے فرمایا : ’’ان دونوں کے درمیان چھ یا سات میل کا فاصلہ تھا۔‘‘ اور ان گھوڑوں کو جو تضمیرشدہ نہیں تھے ثنیۃ الوداع سے دوڑایا اور ان کی آخری جگہ مسجد ببنی زریق تھی۔ میں نے پوچھا : ’’ان کے درمیان کتنا فاصلہ ہے؟‘‘ تو موسیٰ بن عقبہ نے فرمایا : ’’ان دونوں کے درمیان ایک میل یا اس کے قریب فاصلہ ہے۔‘‘ اور ابن عمر رضی اللہ عنھما بھی اس مقابلے میں شامل تھے۔‘‘ (تضمیر کا لفظی معنی لاغر کرنا ہے۔ یہ گھوڑوں کی خاص طریقے سے تیاری کو کہتے ہیں، جس میں پہلے انھیں خوب کھلا پلا کر موٹا کیا جاتا ہے، پھر آہستہ آہستہ ان کی خوراک کم کرکے کچھ وقت کے لیے بند کر دی جاتی ہے۔ اس کے دوران ان کے جسم کی مالش اور تیاری کی جاتی ہے، جس سے وہ بھوک پیاس برداشت کرنے اور زیادہ دیر تک دوڑنے کے قابل ہو جاتے ہیں) اور آپ صلی اللہ علیہ وسلم گھوڑوں کی پیشانیوں کے بالوں پر محبت سے ہاتھ بھی پھیرا کرتے تھے، چنانچہ جریر بن عبد اللہ رضی اللہ عنہ فرماتے ہیں : [ رَأَيْتُ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ يَلْوِيْ نَاصِيَةَ فَرَسٍ بِإِصْبَعِهِ وَ هُوَ يَقُووْلُ الْخَيْلُ مَعْقُوْدٌ بِنَوَاصِيْهَا الْخَيْرُ إِلٰی يَوْمِ الْقِيَامَةِ : الْأَجْرُ وَ الْغَنِيْمَةُ ] [مسلم، الإمارۃ، باب فضیلۃ الخیل و أن الخیر معقود بنواصیھا : ۱۸۷۲ ] ’’میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا آپ ایک گھوڑے کی پیشانی کے بالوں کو اپنی انگلی کے ساتھ مروڑ رہے تھے اور فرما رہے تھے : ’’گھوڑوں کی پیشانیوں کے ساتھ قیامت کے دن تک خیر باندھ دی گئی ہے، یعنی اجر اور غنیمت۔‘‘ یہ ہے وہ تفسیر جس پر دل کو اطمینان ہوتا ہے، کیونکہ اس میں کوئی تکلّف نہیں۔ امام طبری، رازی، ابن حزم اور بہت سے ائمہ نے اسے ہی صحیح قرار دیا ہے، ترجمان القرآن ابن عباس رضی اللہ عنھما نے بھی یہی تفسیر فرمائی ہے۔ چنانچہ طبری نے علی ابن ابی طلحہ کی معتبر سند کے ساتھ آیت : « فَطَفِقَ مَسْحًۢا بِالسُّوْقِ وَ الْاَعْنَاقِ» کے متعلق ان کا قول نقل فرمایا ہے : {’’يَقُوْلُ جَعَلَ يَمْسَحُ أَعْرَافَ الْخَيْلِ وَ عَرَاقِبَهَا حُبًّا لَهَا‘‘} یعنی آیت کا مطلب یہ ہے کہ سلیمان علیہ السلام ان کی گردنوں کے بالوں پر اور ان کی ٹانگوں کے پچھلے حصوں پر محبت سے ہاتھ پھیرنے لگے۔ ¤ تنبیہ : بہت سے مفسرین نے ان آیات کی تفسیر ایک اور طریقے سے کی ہے۔ ان کے مطابق ترجمہ و تفسیر یہ ہے کہ سلیمان علیہ السلام کے سامنے پچھلے پہر اصیل تیز رفتار گھوڑے پیش کیے گئے۔ (یہاں عبارت محذوف ہے کہ انھوں نے ان کی دوڑ کا مقابلہ کروایا، جس کی وجہ سے ان کی عصر کی نماز فوت ہو گئی تو) انھوں نے کہا، میں نے مال کی محبت کو اپنے رب کے ذکر پر ترجیح دی، یہاں تک سورج پردے میں چھپ گیا۔ (تو انھوں نے حکم دیا) انھیں میرے پاس واپس لاؤ، تو وہ ان کی پنڈلیاں اور گردنیں تلوار سے کاٹنے لگے۔ مگر اس تفسیر کی صورت میں کئی ایسی چیزیں محذوف ماننا پڑتی ہیں جن کی کوئی دلیل نہیں، مثلاً یہ کہ ان کی عصر کی نماز فوت ہو گئی، یا سورج پردے میں چھپ گیا، پھر تلوار کا اور اس کے ساتھ پنڈلیاں اور گردنیں کاٹنے کا یہاں نہ کوئی ذکر ہے نہ قرینہ ہے اور نہ ہی ایک پیغمبر سے جہادی گھوڑوں کو اس طرح کاٹنے کی توقع ہو سکتی ہے جن کا کوئی جرم نہ تھا۔ نہ ہی سلیمان علیہ السلام کی ان سے محبت کا باعث مال کی محبت تھا، بلکہ اس محبت کا اصل باعث جہاد سے محبت تھا اور نہ ہی یہ تفسیر رسول اللہ صلی اللہ علیہ وسلم یا کسی صحابی سے منقول ہے، جب کہ پہلی تفسیر صحیح سند کے ساتھ ابن عباس رضی اللہ عنھما سے مروی ہے، جیسا کہ اوپر گزرا ہے۔ مفسر رازی نے اور خصوصاً ابن حزم نے گھوڑوں کو کاٹنے والی تفسیر کی سخت تردید کی ہے۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ {وَ لَقَدْ فَتَنَّا سُلَيْمٰنَ …:} روح المعانی کے مصنف آلوسی کے کہنے کے مطابق اس آزمائش سے سب سے زیادہ ظاہر مراد وہ واقعہ ہے جس کا ذکر حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ قَالَ سُلَيْمَانُ بْنُ دَاوٗدَ لَأَطُوْفَنَّ اللَّيْلَةَ عَلٰی سَبْعِيْنَ امْرَأَةً تَحْمِلُ كُلُّ امْرَأَةٍ فَارِسًا يُجَاهِدُ فِيْ سَبِيْلِ اللّٰهِ، فَقَالَ لَهُ صَاحِبُهُ إِنْ شَاءَ االلّٰهُ فَلَمْ يَقُلْ، وَلَمْ تَحْمِلْ شَيْئًا إِلاَّ وَاحِدًا سَاقِطًا أَحَدُ شِقَّيْهِ فَقَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ لَوْ قَالَهَا لَجَاهَدُوْا فِيْ سَبِيْلِ اللّٰهِ، قَالَ شُعَييْبٌ وَ ابْنُ أَبِي الزِّنَادِ تِسْعِيْنَ وَ هُوَ أَصَحُّ ] [بخاري، أحادیث الأنبیاء، باب قول اللہ تعالٰی: « و وھبنا لداوٗد سلیمان نعم العببد…» : ۳۴۲۴ ] ’’سلیمان بن داؤد علیھما السلام نے کہا : ’’میں آج رات (اپنی) ستر (۷۰) عورتوں کے پاس چکر لگاؤں گا اور ہر عورت ایک شہ سوار کے ساتھ حاملہ ہو گی، جو اللہ کے راستے میں جہاد کرے گا۔‘‘ تو ان کے ساتھی (فرشتے) نے کہا : ’’ان شاء اللہ (کہہ لیجیے)۔‘‘ مگر انھوں نے نہیں کہا، چنانچہ کسی کو حمل نہ ہوا سوائے ایک کے اور اس کے بھی دو پہلوؤں میں سے ایک ساقط تھا۔‘‘ نبی صلی اللہ علیہ وسلم نے فرمایا : ’’اگر وہ ’’ان شاء اللہ‘‘ کہہ لیتے تو وہ سب اللہ کے راستے میں جہاد کرتے۔‘‘ شعیب اور ابن ابی الزناد نے ’’نوے (۹۰) عورتیں‘‘ کہا اور یہی زیادہ صحیح ہے۔‘‘ گویا سلیمان علیہ السلام کی آزمائش یہ تھی کہ ان کی خواہش کے مطابق نوے شہسوار مجاہد بیٹوں کے بجائے ان کی کرسی کا وارث بھی ایک جسد کے سوا کوئی نہ ہوا۔ جسد سے مراد وہ بچہ ہے جس کا ایک پہلو ساقط تھا۔ اہلِ علم فرماتے ہیں کہ سلیمان علیہ السلام کی تمنا مجاہد شہسوار بیٹوں کی تھی اور یہ تمنا بہت اچھی تمنا ہے، مگر ان شاء اللہ نہ کہنے کی وجہ سے ان کی آزمائش ہوئی اور ساقط پہلو والا صرف ایک بیٹا پیدا ہوا۔ یہ کوتاہی اگرچہ بھول کی وجہ سے ہوئی تھی مگر پیغمبروں کے بلند مرتبہ کی وجہ سے بھول پر بھی ان کی آزمائش ہو جاتی ہے، جس پر وہ معافی مانگتے ہیں۔ جیسا کہ آدم علیہ السلام کے متعلق اللہ تعالیٰ نے صریح الفاظ میں فرمایا کہ انھوں نے بھول کر وہ پودا چکھا : « فَنَسِيَ وَ لَمْ نَجِدْ لَهٗ عَزْمًا » [ طٰہٰ : ۱۱۵ ] ’’پھر وہ بھول گیا اور ہم نے اس میں ارادے کی کچھ پختگی نہ پائی۔‘‘ مگر ان کا لباس اتر گیا اور انھوں نے معافی مانگی :ـ « رَبَّنَا ظَلَمْنَاۤ اَنْفُسَنَا وَ اِنْ لَّمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ» [ الأعراف : ۲۳ ] ’’اے ہمارے رب ! ہم نے اپنی جانوں پر ظلم کیا اور اگر تو نے ہمیں نہ بخشا اور ہم پر رحم نہ کیا تو یقینا ہم ضرور خسارہ پانے والوں سے ہو جائیں گے۔‘‘ اسی طرح جب سلیمان علیہ السلام کی بھول کی وجہ سے ان کی تمنا پوری نہ ہوئی تو انھوں نے اللہ تعالیٰ کی طرف رجوع کیا اور اس سے مغفرت کی دعا کی، فرمایا : « قَالَ رَبِّ اغْفِرْ لِيْ وَهَبْ لِيْ مُلْكًا لَّا يَنْۢبَغِيْ لِاَحَدٍ مِّنْۢ بَعْدِيْ اِنَّكَ اَنْتَ الْوَهَّابُ » [ صٓ : ۳۵ ] ’’اس نے کہا اے میرے رب! مجھے بخش دے اور مجھے ایسی بادشاہی عطا فرماجو میرے بعد کسی کے لائق نہ ہو، یقینا تو ہی بہت عطا کرنے والا ہے۔‘‘ میری دانست میں اس آیت کی یہ تفسیر درست ہے، کیونکہ بخاری و مسلم وغیرہ میں مذکور واقعہ اس کے مطابق ہے اور اس میں انبیاء علیھم السلام کی شان کے خلاف بھی کوئی بات نہیں۔ ¤ ➋ بعض علماء نے فرمایا، ہو سکتا ہے کہ آیات میں جس فتنے کا ذکر ہے اس سے مراد اس حدیث میں مذکور واقعہ ہو اور جسد سے مراد ساقط پہلو والا بچہ ہو، اگرچہ یہ قوی احتمال ہے، مگر جو بات ہم یقین سے کہہ سکتے ہیں وہ یہ ہے کہ یہ اللہ تعالیٰ کی طرف سے سلیمان علیہ السلام کی کوئی آزمائش تھی، جس کی وضاحت اللہ تعالیٰ نے نہیں فرمائی اور نہ ہی اس نے ان کی کرسی پر ڈالے جانے والے جسد کی وضاحت فرمائی ہے۔ اس لیے اسی پر اکتفا کرنا چاہیے کہ اللہ تعالیٰ نے سلیمان علیہ السلام کی کوئی آزمائش فرمائی، جس پر متنبّہ ہو کر انھوں نے اللہ تعالیٰ سے بخشش کی دعا کی۔ (واللہ اعلم) ¤ ➌ ان آیات کی تفسیر میں مفسرین نے کئی ایسی باتیں لکھ دی ہیں جن کا کوئی ثبوت نہیں اور جو انبیاء کے مقام کے سراسر خلاف ہیں۔ ان میں سے ایک یہ ہے کہ کچھ عرصہ کے لیے اللہ تعالیٰ نے صخر نامی ایک جنّ کو سلیمان علیہ السلام کے تخت پر قابض کر دیا تھا۔ اس کے مختلف اسباب میں سے ایک سبب یہ تھا کہ سلیمان علیہ السلام کی ایک بیوی بت پرست تھی، اس کی یہ سزا ملی کہ جتنی مدت اس بیوی نے بت پرستی کی تھی اتنی مدت کے لیے سلیمان علیہ السلام تخت سلطنت سے محروم کر دیے گئے اور ان کی انگوٹھی، جس میں اسم اعظم تھا، ایک لونڈی کے واسطے سے صخر کے ہاتھ پڑ گئی، پھر اس کے ہاتھ سے وہ انگوٹھی دریا میں گر گئی اور ایک مچھلی نے اسے نگل لیا، پھر وہ مچھلی شکار ہو کر سلیمان علیہ السلام کے پاس آئی اور اس طرح انھوں نے اس کے پیٹ سے انگوٹھی کو نکال کر اپنا تخت واپس لے لیا۔ مگر یہ سارا قصّہ اہلِ کتاب سے لیا گیا ہے اور اہلِ کتاب میں سے اکثر وہ ہیں جو سلیمان علیہ السلام کو اللہ کا نبی نہیں مانتے اور ان کا مقصد انھیں زیادہ سے زیادہ بدنام کرنا ہے۔ (ابن کثیر) اس طرح کی کئی اور فضول کہانیاں جو نہ نقل سے ثابت ہیں اور نہ عقل انھیں تسلیم کرتی ہے، بے احتیاط لوگوں نے کتابوں میں بلا ثبوت لکھ دی ہیں اور واعظ اور قصّہ گو حضرات انھیں بیان کرتے رہتے ہیں۔ ¤ مفسر ابوحیان نے فرمایا : ’’مفسرین نے اس فتنے اور اس جسد کے ڈالے جانے کے متعلق کئی ایسی باتیں نقل کی ہیں جن سے انبیاء کو پاک سمجھنا واجب ہے، وہ باتیں ان کی کتابوں میں دیکھی جا سکتی ہیں اور وہ ایسی ہیں جنھیں نقل کرنا جائز نہیں۔ وہ یا تو یہودیوں نے گھڑی ہیں یا زندیقوں نے۔ اللہ تعالیٰ نے بیان نہیں فرمایا کہ وہ فتنہ کیا تھا اور نہ ہی یہ کہ سلیمان علیہ السلام کی کرسی پر جو جسد ڈالا گیا وہ کیا تھا۔ سب سے قریب بات جو اس کے متعلق کہی گئی ہے وہ یہ ہے کہ فتنے سے مراد حدیث میں مذکور ستر (۷۰) عورتوں والے واقعہ میں سلیمان علیہ السلام کا ان شاء اللہ نہ کہنا ہے اور جسد سے مراد پیدا ہونے والا ادھورا بچہ ہے۔‘‘"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) { قَالَ رَبِّ اغْفِرْ لِيْ وَهَبْ لِيْ مُلْكًا … :} یعنی شہسواروں کی فوج پیدا ہونے کی آرزو میری کوتاہی کی وجہ سے اور تیری حکمت و مشیّت کے تحت پوری نہیں ہوئی، تو تُو مجھے ایسی بااختیار بادشاہی عطا فرما دے کہ ویسی بادشاہی میرے سوا یا میرے بعد کسی کے پاس نہ ہو، تاکہ پھر اولاد کی ضرورت ہی نہ رہے۔ یہ دعا بھی اللہ کے دین کے غلبے کے لیے تھی۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {فَسَخَّرْنَا لَهُ الرِّيْحَ تَجْرِيْ بِاَمْرِهٖ … :} یعنی ہم نے سلیمان علیہ السلام کی دعا قبول کر لی اور ایسی بادشاہی عطا کی جس میں ہوا ان کے تابع کر دی، وہ جہاں کا ارادہ کرتے ادھر نرم ہو کر چل پڑتی۔ سورۂ انبیاء (۸۱) میں اسے {’’ عَاصِفَةً ‘‘} (تند) بیان کیا ہے۔ ان دونوں میں کوئی تضاد نہیں کہ ہوا نہایت تند و تیز ہو، مگر ایسی ہموار کہ جسے اٹھایا ہے اسے کوئی جھٹکا تک محسوس نہ ہو، جیسا کہ آج کل ہوائی جہازوں کا حال ہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) {وَ الشَّيٰطِيْنَ كُلَّ بَنَّآءٍ وَّ غَوَّاصٍ : ’’ بَنَّآءٍ ‘‘} اور {’’ غَوَّاصٍ ‘‘} مبالغہ کے صیغے ہیں، اس لیے ان کا ترجمہ ماہر معمار اور ماہر غوطہ خور کیا ہے۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) { وَ اٰخَرِيْنَ مُقَرَّنِيْنَ فِي الْاَصْفَادِ: ’’ الْاَصْفَادِ ‘‘ ’’صَفَدٌ‘‘} (صاد اور فاء کے فتحہ کے ساتھ) کی جمع ہے، وہ زنجیر یا طوق جس سے کسی کو باندھا جائے۔ یعنی ان میں سے جو سرکشی یا شرارت کرتے انھیں ایک دوسرے کے ساتھ جکڑ کر قید کر دیا جاتا۔ ان چاروں آیات کی مفصل تفسیر کے لیے دیکھیے سورۂ انبیاء (۸۱، ۸۲)، سبا (۱۲، ۱۳) اور سورۂ نمل (۱۵ تا ۴۴) کی تفسیر۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) {هٰذَا عَطَآؤُنَا فَامْنُنْ … :} یعنی ہم نے تمھاری دعا کے مطابق تمھیں عظیم بادشاہی عطا کر دی، اب تم جسے چاہو دو جسے چاہو نہ دو اور جتنا چاہو دو، تم سے کوئی حساب بھی نہیں لیا جائے گا۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) {وَ اِنَّ لَهٗ عِنْدَنَا لَزُلْفٰى وَ حُسْنَ مَاٰبٍ :} یعنی دنیوی بادشاہی کے علاوہ اسے ہمارے ہاں خاص قرب حاصل ہے اور ان کے لیے آخرت کا بہترین ٹھکانا یعنی سب سے بلند مقام جنت الفردوس تیار ہے۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41تا44) ➊ {وَ اذْكُرْ عَبْدَنَاۤ اَيُّوْبَ … :} اس کا عطف اس سے پہلے {’’ وَ اذْكُرْ عَبْدَنَا دَاوٗدَ ذَا الْاَيْدِ ‘‘} پر ہے۔ لفظ {’’ عَبْدَنَا ‘‘ } میں اللہ تعالیٰ کے ان سے تعلق کا اظہار ہو رہا ہے۔ اس سورت میں مذکور قصّوں میں سے یہ تیسرا قصّہ ہے کہ داؤد اور سلیمان علیھما السلام پر اللہ تعالیٰ کی نعمتوں کا اور دونوں کی آزمائش کا ذکر فرمایا اور ایوب علیہ السلام پر آنے والی مصیبتوں اور تکلیفوں کا اور انھیں دور کرنے کی نعمت کا ذکر فرمایا، مقصد سب سے عبرت دلانا ہے۔ ¤ ➋ { اَنِّيْ مَسَّنِيَ الشَّيْطٰنُ بِنُصْبٍ وَّ عَذَابٍ: ’’نُصْبٌ‘‘} تھکاوٹ اور مشقت کو کہتے ہیں اور {’’ عَذَابٍ ‘‘} شدید بدنی تکلیف کو۔ یعنی مجھے دو قسم کی تکلیف پہنچی ہے، ایک شدید دکھ جو مال و اولاد اور عافیت نہ رہنے کی وجہ سے تھا اور دوسری جسمانی تکلیف جو بیماری کی وجہ سے تھی۔ ¤ ➌ اس دعا میں ایوب علیہ السلام کا حُسن ادب دیکھیے کہ انھوں نے دکھ اور تکلیف کی نسبت اللہ تعالیٰ کی طرف نہیں کی بلکہ شیطان کی طرف کی ہے۔ حالانکہ رنج ہو یا راحت، برائی ہو یا بھلائی، سب اللہ تعالیٰ کی مشیّت کے تحت ہے اور وہی سب کا خالق ہے، مگر چونکہ اکثر ان کا تعلق کسی قریب یا بعید وجہ سے شیطان کے ساتھ ہوتا ہے، اس لیے اللہ کے مقرّب بندے شر کی نسبت اپنی طرف کرتے ہیں یا شیطان کی طرف، اللہ تعالیٰ کی طرف نہیں کرتے، جیسا کہ ابراہیم علیہ السلام نے مرض کی نسبت اپنی طرف اور شفا کی نسبت اللہ تعالیٰ کی طرف کی، فرمایا : « وَ اِذَا مَرِضْتُ فَهُوَ يَشْفِيْنِ» [ الشعرآء : ۸۰ ] ’’اور جب میں بیمار ہوتا ہوں تو وہی مجھے شفا دیتا ہے۔‘‘ اور موسیٰ اور خضر علیھما السلام کے قصے میں یوشع بن نون علیہ السلام نے بھلانے کی نسبت شیطان کی طرف کی، فرمایا : «وَ مَاۤ اَنْسٰىنِيْهُ اِلَّا الشَّيْطٰنُ اَنْ اَذْكُرَهٗ » [ الکہف : ۶۳ ] ’’اور مجھے وہ نہیں بھلائی مگر شیطان نے کہ میں اس کا ذکر کروں۔‘‘ صحیح مسلم میں نماز کے شروع میں پڑھی جانے والی ایک لمبی دعا رسول اللہ صلی اللہ علیہ وسلم سے مروی ہے، جو {’’ وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمٰوَاتِ وَالْأَرْضَ‘‘} سے شروع ہوتی ہے، اس میں یہ الفاظ ہیں : [ لَبَّيْكَ وَسَعْدَيْكَ وَ الْخَيْرُ كُلُّهُ فِيْ يَدَيْكَ وَالشَّرُّ لَيْسَ إِلَيْكَ ] [ مسلم، صلاۃ المسافرین، باب الدعاء في صلاۃ اللیل و قیامہ : ۷۷۱، عن علي بن أبي طالب رضی اللہ عنہ ] ’’حاضر ہوں اور حاضر ہوں اور خیر ساری تیرے ہاتھ میں ہے اور شر تیری طرف نہیں ہے۔‘‘ ¤ ➍ ایوب علیہ السلام کی اس دعا میں اور سورۂ انبیاء (۸۳) میں مذکور دعا : « اَنِّيْ مَسَّنِيَ الضُّرُّ وَ اَنْتَ اَرْحَمُ الرّٰحِمِيْنَ» (بے شک میں، مجھے بیماری لگ گئی ہے اور تو رحم کرنے والوں میں سب سے زیادہ رحم والا ہے) میں ایوب علیہ السلام کے دعا کے سلیقے کا اظہار ہو رہا ہے کہ انھوں نے صریح لفظوں میں اپنے مقصد کے اظہار کے بجائے اپنی حالتِ زار اور رب تعالیٰ کی مہربانی کا ذکر ایسے لفظوں میں کیا کہ اللہ تعالیٰ نے خود ہی ان پر رحم فرما کر شفا دے دی۔ ¤ ➎ ان چاروں آیات کی مفصّل تفسیر کے لیے دیکھیے سورۂ انبیاء کی آیت (۸۳، ۸۴) کی تفسیر۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 41تا44) ➊ {وَ اذْكُرْ عَبْدَنَاۤ اَيُّوْبَ … :} اس کا عطف اس سے پہلے {’’ وَ اذْكُرْ عَبْدَنَا دَاوٗدَ ذَا الْاَيْدِ ‘‘} پر ہے۔ لفظ {’’ عَبْدَنَا ‘‘ } میں اللہ تعالیٰ کے ان سے تعلق کا اظہار ہو رہا ہے۔ اس سورت میں مذکور قصّوں میں سے یہ تیسرا قصّہ ہے کہ داؤد اور سلیمان علیھما السلام پر اللہ تعالیٰ کی نعمتوں کا اور دونوں کی آزمائش کا ذکر فرمایا اور ایوب علیہ السلام پر آنے والی مصیبتوں اور تکلیفوں کا اور انھیں دور کرنے کی نعمت کا ذکر فرمایا، مقصد سب سے عبرت دلانا ہے۔ ¤ ➋ { اَنِّيْ مَسَّنِيَ الشَّيْطٰنُ بِنُصْبٍ وَّ عَذَابٍ: ’’نُصْبٌ‘‘} تھکاوٹ اور مشقت کو کہتے ہیں اور {’’ عَذَابٍ ‘‘} شدید بدنی تکلیف کو۔ یعنی مجھے دو قسم کی تکلیف پہنچی ہے، ایک شدید دکھ جو مال و اولاد اور عافیت نہ رہنے کی وجہ سے تھا اور دوسری جسمانی تکلیف جو بیماری کی وجہ سے تھی۔ ¤ ➌ اس دعا میں ایوب علیہ السلام کا حُسن ادب دیکھیے کہ انھوں نے دکھ اور تکلیف کی نسبت اللہ تعالیٰ کی طرف نہیں کی بلکہ شیطان کی طرف کی ہے۔ حالانکہ رنج ہو یا راحت، برائی ہو یا بھلائی، سب اللہ تعالیٰ کی مشیّت کے تحت ہے اور وہی سب کا خالق ہے، مگر چونکہ اکثر ان کا تعلق کسی قریب یا بعید وجہ سے شیطان کے ساتھ ہوتا ہے، اس لیے اللہ کے مقرّب بندے شر کی نسبت اپنی طرف کرتے ہیں یا شیطان کی طرف، اللہ تعالیٰ کی طرف نہیں کرتے، جیسا کہ ابراہیم علیہ السلام نے مرض کی نسبت اپنی طرف اور شفا کی نسبت اللہ تعالیٰ کی طرف کی، فرمایا : « وَ اِذَا مَرِضْتُ فَهُوَ يَشْفِيْنِ» [ الشعرآء : ۸۰ ] ’’اور جب میں بیمار ہوتا ہوں تو وہی مجھے شفا دیتا ہے۔‘‘ اور موسیٰ اور خضر علیھما السلام کے قصے میں یوشع بن نون علیہ السلام نے بھلانے کی نسبت شیطان کی طرف کی، فرمایا : «وَ مَاۤ اَنْسٰىنِيْهُ اِلَّا الشَّيْطٰنُ اَنْ اَذْكُرَهٗ » [ الکہف : ۶۳ ] ’’اور مجھے وہ نہیں بھلائی مگر شیطان نے کہ میں اس کا ذکر کروں۔‘‘ صحیح مسلم میں نماز کے شروع میں پڑھی جانے والی ایک لمبی دعا رسول اللہ صلی اللہ علیہ وسلم سے مروی ہے، جو {’’ وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمٰوَاتِ وَالْأَرْضَ‘‘} سے شروع ہوتی ہے، اس میں یہ الفاظ ہیں : [ لَبَّيْكَ وَسَعْدَيْكَ وَ الْخَيْرُ كُلُّهُ فِيْ يَدَيْكَ وَالشَّرُّ لَيْسَ إِلَيْكَ ] [ مسلم، صلاۃ المسافرین، باب الدعاء في صلاۃ اللیل و قیامہ : ۷۷۱، عن علي بن أبي طالب رضی اللہ عنہ ] ’’حاضر ہوں اور حاضر ہوں اور خیر ساری تیرے ہاتھ میں ہے اور شر تیری طرف نہیں ہے۔‘‘ ¤ ➍ ایوب علیہ السلام کی اس دعا میں اور سورۂ انبیاء (۸۳) میں مذکور دعا : « اَنِّيْ مَسَّنِيَ الضُّرُّ وَ اَنْتَ اَرْحَمُ الرّٰحِمِيْنَ» (بے شک میں، مجھے بیماری لگ گئی ہے اور تو رحم کرنے والوں میں سب سے زیادہ رحم والا ہے) میں ایوب علیہ السلام کے دعا کے سلیقے کا اظہار ہو رہا ہے کہ انھوں نے صریح لفظوں میں اپنے مقصد کے اظہار کے بجائے اپنی حالتِ زار اور رب تعالیٰ کی مہربانی کا ذکر ایسے لفظوں میں کیا کہ اللہ تعالیٰ نے خود ہی ان پر رحم فرما کر شفا دے دی۔ ¤ ➎ ان چاروں آیات کی مفصّل تفسیر کے لیے دیکھیے سورۂ انبیاء کی آیت (۸۳، ۸۴) کی تفسیر۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 41تا44) ➊ {وَ اذْكُرْ عَبْدَنَاۤ اَيُّوْبَ … :} اس کا عطف اس سے پہلے {’’ وَ اذْكُرْ عَبْدَنَا دَاوٗدَ ذَا الْاَيْدِ ‘‘} پر ہے۔ لفظ {’’ عَبْدَنَا ‘‘ } میں اللہ تعالیٰ کے ان سے تعلق کا اظہار ہو رہا ہے۔ اس سورت میں مذکور قصّوں میں سے یہ تیسرا قصّہ ہے کہ داؤد اور سلیمان علیھما السلام پر اللہ تعالیٰ کی نعمتوں کا اور دونوں کی آزمائش کا ذکر فرمایا اور ایوب علیہ السلام پر آنے والی مصیبتوں اور تکلیفوں کا اور انھیں دور کرنے کی نعمت کا ذکر فرمایا، مقصد سب سے عبرت دلانا ہے۔ ¤ ➋ { اَنِّيْ مَسَّنِيَ الشَّيْطٰنُ بِنُصْبٍ وَّ عَذَابٍ: ’’نُصْبٌ‘‘} تھکاوٹ اور مشقت کو کہتے ہیں اور {’’ عَذَابٍ ‘‘} شدید بدنی تکلیف کو۔ یعنی مجھے دو قسم کی تکلیف پہنچی ہے، ایک شدید دکھ جو مال و اولاد اور عافیت نہ رہنے کی وجہ سے تھا اور دوسری جسمانی تکلیف جو بیماری کی وجہ سے تھی۔ ¤ ➌ اس دعا میں ایوب علیہ السلام کا حُسن ادب دیکھیے کہ انھوں نے دکھ اور تکلیف کی نسبت اللہ تعالیٰ کی طرف نہیں کی بلکہ شیطان کی طرف کی ہے۔ حالانکہ رنج ہو یا راحت، برائی ہو یا بھلائی، سب اللہ تعالیٰ کی مشیّت کے تحت ہے اور وہی سب کا خالق ہے، مگر چونکہ اکثر ان کا تعلق کسی قریب یا بعید وجہ سے شیطان کے ساتھ ہوتا ہے، اس لیے اللہ کے مقرّب بندے شر کی نسبت اپنی طرف کرتے ہیں یا شیطان کی طرف، اللہ تعالیٰ کی طرف نہیں کرتے، جیسا کہ ابراہیم علیہ السلام نے مرض کی نسبت اپنی طرف اور شفا کی نسبت اللہ تعالیٰ کی طرف کی، فرمایا : « وَ اِذَا مَرِضْتُ فَهُوَ يَشْفِيْنِ» [ الشعرآء : ۸۰ ] ’’اور جب میں بیمار ہوتا ہوں تو وہی مجھے شفا دیتا ہے۔‘‘ اور موسیٰ اور خضر علیھما السلام کے قصے میں یوشع بن نون علیہ السلام نے بھلانے کی نسبت شیطان کی طرف کی، فرمایا : «وَ مَاۤ اَنْسٰىنِيْهُ اِلَّا الشَّيْطٰنُ اَنْ اَذْكُرَهٗ » [ الکہف : ۶۳ ] ’’اور مجھے وہ نہیں بھلائی مگر شیطان نے کہ میں اس کا ذکر کروں۔‘‘ صحیح مسلم میں نماز کے شروع میں پڑھی جانے والی ایک لمبی دعا رسول اللہ صلی اللہ علیہ وسلم سے مروی ہے، جو {’’ وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمٰوَاتِ وَالْأَرْضَ‘‘} سے شروع ہوتی ہے، اس میں یہ الفاظ ہیں : [ لَبَّيْكَ وَسَعْدَيْكَ وَ الْخَيْرُ كُلُّهُ فِيْ يَدَيْكَ وَالشَّرُّ لَيْسَ إِلَيْكَ ] [ مسلم، صلاۃ المسافرین، باب الدعاء في صلاۃ اللیل و قیامہ : ۷۷۱، عن علي بن أبي طالب رضی اللہ عنہ ] ’’حاضر ہوں اور حاضر ہوں اور خیر ساری تیرے ہاتھ میں ہے اور شر تیری طرف نہیں ہے۔‘‘ ¤ ➍ ایوب علیہ السلام کی اس دعا میں اور سورۂ انبیاء (۸۳) میں مذکور دعا : « اَنِّيْ مَسَّنِيَ الضُّرُّ وَ اَنْتَ اَرْحَمُ الرّٰحِمِيْنَ» (بے شک میں، مجھے بیماری لگ گئی ہے اور تو رحم کرنے والوں میں سب سے زیادہ رحم والا ہے) میں ایوب علیہ السلام کے دعا کے سلیقے کا اظہار ہو رہا ہے کہ انھوں نے صریح لفظوں میں اپنے مقصد کے اظہار کے بجائے اپنی حالتِ زار اور رب تعالیٰ کی مہربانی کا ذکر ایسے لفظوں میں کیا کہ اللہ تعالیٰ نے خود ہی ان پر رحم فرما کر شفا دے دی۔ ¤ ➎ ان چاروں آیات کی مفصّل تفسیر کے لیے دیکھیے سورۂ انبیاء کی آیت (۸۳، ۸۴) کی تفسیر۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 41تا44) ➊ {وَ اذْكُرْ عَبْدَنَاۤ اَيُّوْبَ … :} اس کا عطف اس سے پہلے {’’ وَ اذْكُرْ عَبْدَنَا دَاوٗدَ ذَا الْاَيْدِ ‘‘} پر ہے۔ لفظ {’’ عَبْدَنَا ‘‘ } میں اللہ تعالیٰ کے ان سے تعلق کا اظہار ہو رہا ہے۔ اس سورت میں مذکور قصّوں میں سے یہ تیسرا قصّہ ہے کہ داؤد اور سلیمان علیھما السلام پر اللہ تعالیٰ کی نعمتوں کا اور دونوں کی آزمائش کا ذکر فرمایا اور ایوب علیہ السلام پر آنے والی مصیبتوں اور تکلیفوں کا اور انھیں دور کرنے کی نعمت کا ذکر فرمایا، مقصد سب سے عبرت دلانا ہے۔ ¤ ➋ { اَنِّيْ مَسَّنِيَ الشَّيْطٰنُ بِنُصْبٍ وَّ عَذَابٍ: ’’نُصْبٌ‘‘} تھکاوٹ اور مشقت کو کہتے ہیں اور {’’ عَذَابٍ ‘‘} شدید بدنی تکلیف کو۔ یعنی مجھے دو قسم کی تکلیف پہنچی ہے، ایک شدید دکھ جو مال و اولاد اور عافیت نہ رہنے کی وجہ سے تھا اور دوسری جسمانی تکلیف جو بیماری کی وجہ سے تھی۔ ¤ ➌ اس دعا میں ایوب علیہ السلام کا حُسن ادب دیکھیے کہ انھوں نے دکھ اور تکلیف کی نسبت اللہ تعالیٰ کی طرف نہیں کی بلکہ شیطان کی طرف کی ہے۔ حالانکہ رنج ہو یا راحت، برائی ہو یا بھلائی، سب اللہ تعالیٰ کی مشیّت کے تحت ہے اور وہی سب کا خالق ہے، مگر چونکہ اکثر ان کا تعلق کسی قریب یا بعید وجہ سے شیطان کے ساتھ ہوتا ہے، اس لیے اللہ کے مقرّب بندے شر کی نسبت اپنی طرف کرتے ہیں یا شیطان کی طرف، اللہ تعالیٰ کی طرف نہیں کرتے، جیسا کہ ابراہیم علیہ السلام نے مرض کی نسبت اپنی طرف اور شفا کی نسبت اللہ تعالیٰ کی طرف کی، فرمایا : « وَ اِذَا مَرِضْتُ فَهُوَ يَشْفِيْنِ» [ الشعرآء : ۸۰ ] ’’اور جب میں بیمار ہوتا ہوں تو وہی مجھے شفا دیتا ہے۔‘‘ اور موسیٰ اور خضر علیھما السلام کے قصے میں یوشع بن نون علیہ السلام نے بھلانے کی نسبت شیطان کی طرف کی، فرمایا : «وَ مَاۤ اَنْسٰىنِيْهُ اِلَّا الشَّيْطٰنُ اَنْ اَذْكُرَهٗ » [ الکہف : ۶۳ ] ’’اور مجھے وہ نہیں بھلائی مگر شیطان نے کہ میں اس کا ذکر کروں۔‘‘ صحیح مسلم میں نماز کے شروع میں پڑھی جانے والی ایک لمبی دعا رسول اللہ صلی اللہ علیہ وسلم سے مروی ہے، جو {’’ وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمٰوَاتِ وَالْأَرْضَ‘‘} سے شروع ہوتی ہے، اس میں یہ الفاظ ہیں : [ لَبَّيْكَ وَسَعْدَيْكَ وَ الْخَيْرُ كُلُّهُ فِيْ يَدَيْكَ وَالشَّرُّ لَيْسَ إِلَيْكَ ] [ مسلم، صلاۃ المسافرین، باب الدعاء في صلاۃ اللیل و قیامہ : ۷۷۱، عن علي بن أبي طالب رضی اللہ عنہ ] ’’حاضر ہوں اور حاضر ہوں اور خیر ساری تیرے ہاتھ میں ہے اور شر تیری طرف نہیں ہے۔‘‘ ¤ ➍ ایوب علیہ السلام کی اس دعا میں اور سورۂ انبیاء (۸۳) میں مذکور دعا : « اَنِّيْ مَسَّنِيَ الضُّرُّ وَ اَنْتَ اَرْحَمُ الرّٰحِمِيْنَ» (بے شک میں، مجھے بیماری لگ گئی ہے اور تو رحم کرنے والوں میں سب سے زیادہ رحم والا ہے) میں ایوب علیہ السلام کے دعا کے سلیقے کا اظہار ہو رہا ہے کہ انھوں نے صریح لفظوں میں اپنے مقصد کے اظہار کے بجائے اپنی حالتِ زار اور رب تعالیٰ کی مہربانی کا ذکر ایسے لفظوں میں کیا کہ اللہ تعالیٰ نے خود ہی ان پر رحم فرما کر شفا دے دی۔ ¤ ➎ ان چاروں آیات کی مفصّل تفسیر کے لیے دیکھیے سورۂ انبیاء کی آیت (۸۳، ۸۴) کی تفسیر۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) { وَ اذْكُرْ عِبٰدَنَاۤ اِبْرٰهِيْمَ وَ اِسْحٰقَ … :} پہلے تین انبیاء کے تفصیلی ذکر کے بعد چند انبیاء کا اجمالی ذکر فرمایا۔ {’’ الْاَيْدِيْ ‘‘ ’’يَدٌ‘‘} کی جمع ہے، جو عربی زبان میں نعمت کے معنی میں استعمال ہوتا ہے اور قوت کے معنی میں بھی۔ اس لحاظ سے ان انبیاء کے {’’ اُولِي الْاَيْدِيْ ‘‘} (ہاتھوں والے) ہونے کا مطلب یہ ہے کہ وہ عبادت کی اور امر بالمعروف اور نہی عن المنکرکی بڑی قوت رکھتے تھے اور یہ بھی کہ ان پر اللہ تعالیٰ کے بہت سے انعامات تھے۔ {’’ الْاَبْصَارِ ‘‘} (آنکھوں) کی تفسیر میں تمام مفسرین کا اتفاق ہے کہ اس سے مراد دینی بصیرت اور اللہ تعالیٰ کی معرفت ہے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) {اِنَّاۤ اَخْلَصْنٰهُمْ بِخَالِصَةٍ ذِكْرَى الدَّارِ :} ان انبیاء میں پائی جانے والی خاص صفت کو پہلے مبہم رکھا کہ ’’ہم نے انھیں ایک خاص صفت کے ساتھ چُن لیا‘‘ تاکہ شوق اور تجسّس پیدا ہو کہ وہ خاص صفت کیا ہے، پھر بتایا کہ وہ صفت اصل گھر کی یاد ہے۔ اصل گھر سے مراد آخرت ہے، کیونکہ دنیا گھر نہیں بلکہ گزر گاہ ہے۔ ان انبیاء کا خاص وصف یہ تھا کہ وہ ہر وقت آخرت کو یاد رکھتے تھے اور ہر معاملہ میں اسی کو پیش نظر رکھتے تھے، دنیا کی ہوس کا ان میں کوئی شائبہ نہ تھا اور لوگوں کو بھی وہ ہمیشہ آخرت یاد دلاتے رہتے تھے۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 48،47) {وَ اِنَّهُمْ عِنْدَنَا لَمِنَ الْمُصْطَفَيْنَ الْاَخْيَارِ … : ’’ الْمُصْطَفَيْنَ ‘‘ ’’مُصْطَفٰي‘‘} کی جمع ہے، جو باب افتعال سے اسم مفعول ہے اور اصل میں {’’مُصْتَفٰي‘‘} ہے، صاد کی وجہ سے تاء کو طاء میں بدل دیا ’’چُنے ہوئے۔‘‘ {’’ الْاَخْيَارِ ‘‘ ’’خَيْرٌ‘‘} کی جمع ہے جو اسم تفضیل کا صیغہ ہے اور اصل میں {’’أَخْيَرُ‘‘} ہے، اس لیے اس کی جمع {’’ الْاَخْيَارِ ‘‘} آئی ہے ’’سب سے بہتر لوگ۔‘‘"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48،47) {وَ اِنَّهُمْ عِنْدَنَا لَمِنَ الْمُصْطَفَيْنَ الْاَخْيَارِ … : ’’ الْمُصْطَفَيْنَ ‘‘ ’’مُصْطَفٰي‘‘} کی جمع ہے، جو باب افتعال سے اسم مفعول ہے اور اصل میں {’’مُصْتَفٰي‘‘} ہے، صاد کی وجہ سے تاء کو طاء میں بدل دیا ’’چُنے ہوئے۔‘‘ {’’ الْاَخْيَارِ ‘‘ ’’خَيْرٌ‘‘} کی جمع ہے جو اسم تفضیل کا صیغہ ہے اور اصل میں {’’أَخْيَرُ‘‘} ہے، اس لیے اس کی جمع {’’ الْاَخْيَارِ ‘‘} آئی ہے ’’سب سے بہتر لوگ۔‘‘"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) {هٰذَا ذِكْرٌ وَ اِنَّ لِلْمُتَّقِيْنَ لَحُسْنَ مَاٰبٍ :} یعنی یہ تو ایک نصیحت انبیاء کے بیان میں ہوئی، اب عام متقین کا انجام سنو! یقینا ان کے لیے بہت اچھا ٹھکانا ہے۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 51،50) {جَنّٰتِ عَدْنٍ …:’’مَفْتُوْحَةٌ‘‘} کھولے ہوئے،{’’ مُفَتَّحَةً ‘‘} (تفعیل) میں مبالغہ کی وجہ سے ترجمہ ’’پورے کھولے ہوئے‘‘ کیا گیا ہے۔ متعدد صحیح احادیث میں بیان ہوا ہے کہ جنت کے آٹھ دروازے ہیں۔ سورۂ زمر (۷۱) میں ہے کہ جہنم کے دروازے کفار کے آنے پر کھولے جائیں گے اور آیت (۷۳) میں ہے کہ جنت کے دروازے متقین کی آمد پر پہلے سے کھولے ہوئے ہوں گے۔ {’’ مُفَتَّحَةً لَّهُمُ الْاَبْوَابُ ‘‘} میں وہ بشارت بھی داخل ہے جو رسوول اللہ صلی اللہ علیہ وسلم نے بیان فرمائی، آپ صلی اللہ علیہ وسلم نے فرمایا : [ يَخْلُصُ الْمُؤْمِنُوْنَ مِنَ النَّارِ، فَيُحْبَسُوْنَ عَلٰی قَنْطَرَةٍ بَيْنَ الْجَنَّةِ  وَ النَّارِ، فَيُقَصُّ لِبَعْضِهِمْ مِنْ بَعْضٍ مَظَالِمُ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا، حَتّٰی إِذَا هُذِّبُوْا وَ نُقُّوْا أُذِنَ لَهُمْ فِيْ دُخُوْلِ الْجَنَّةةِ، فَوَ الَّذِيْ نَفْسُ مُحَمَّدٍ بِيَدِهِ! لَأَحَدُهُمْ أَهْدٰی بِمَنْزِلِهِ فِي الْجَنَّةِ مِنْهُ بِمَنْزِلِهِ كَانَ فِي الدُّنْيَا ] [ بخاري، الرقاق، باب القصاص یوم القیامۃ : ۶۵۳۵ ] ’’مومن آگ سے گزر جائیں گے تو انھیں جنت اور جہنم کے درمیان ایک پل پر روک لیا جائے گا تو وہ ایک دوسرے سے ان زیادتیوں کا بدلا لیں گے جو ان کے درمیان دنیا میں ہوئیں، حتیٰ کہ جب وہ خوب پاک صاف کر دیے جائیں گے، تو انھیں جنت میں داخلے کی اجازت دی جائے گی۔ تو اس ذات کی قسم جس کے ہاتھ میں محمد( صلی اللہ علیہ وسلم ) کی جان ہے! ان میں سے ہر ایک کو اپنے گھر کا راستہ اس سے زیادہ معلوم ہو گا جتنا اسے دنیا میں اپنے گھر کا راستہ معلوم تھا۔‘‘"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51،50) {جَنّٰتِ عَدْنٍ …:’’مَفْتُوْحَةٌ‘‘} کھولے ہوئے،{’’ مُفَتَّحَةً ‘‘} (تفعیل) میں مبالغہ کی وجہ سے ترجمہ ’’پورے کھولے ہوئے‘‘ کیا گیا ہے۔ متعدد صحیح احادیث میں بیان ہوا ہے کہ جنت کے آٹھ دروازے ہیں۔ سورۂ زمر (۷۱) میں ہے کہ جہنم کے دروازے کفار کے آنے پر کھولے جائیں گے اور آیت (۷۳) میں ہے کہ جنت کے دروازے متقین کی آمد پر پہلے سے کھولے ہوئے ہوں گے۔ {’’ مُفَتَّحَةً لَّهُمُ الْاَبْوَابُ ‘‘} میں وہ بشارت بھی داخل ہے جو رسوول اللہ صلی اللہ علیہ وسلم نے بیان فرمائی، آپ صلی اللہ علیہ وسلم نے فرمایا : [ يَخْلُصُ الْمُؤْمِنُوْنَ مِنَ النَّارِ، فَيُحْبَسُوْنَ عَلٰی قَنْطَرَةٍ بَيْنَ الْجَنَّةِ  وَ النَّارِ، فَيُقَصُّ لِبَعْضِهِمْ مِنْ بَعْضٍ مَظَالِمُ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا، حَتّٰی إِذَا هُذِّبُوْا وَ نُقُّوْا أُذِنَ لَهُمْ فِيْ دُخُوْلِ الْجَنَّةةِ، فَوَ الَّذِيْ نَفْسُ مُحَمَّدٍ بِيَدِهِ! لَأَحَدُهُمْ أَهْدٰی بِمَنْزِلِهِ فِي الْجَنَّةِ مِنْهُ بِمَنْزِلِهِ كَانَ فِي الدُّنْيَا ] [ بخاري، الرقاق، باب القصاص یوم القیامۃ : ۶۵۳۵ ] ’’مومن آگ سے گزر جائیں گے تو انھیں جنت اور جہنم کے درمیان ایک پل پر روک لیا جائے گا تو وہ ایک دوسرے سے ان زیادتیوں کا بدلا لیں گے جو ان کے درمیان دنیا میں ہوئیں، حتیٰ کہ جب وہ خوب پاک صاف کر دیے جائیں گے، تو انھیں جنت میں داخلے کی اجازت دی جائے گی۔ تو اس ذات کی قسم جس کے ہاتھ میں محمد( صلی اللہ علیہ وسلم ) کی جان ہے! ان میں سے ہر ایک کو اپنے گھر کا راستہ اس سے زیادہ معلوم ہو گا جتنا اسے دنیا میں اپنے گھر کا راستہ معلوم تھا۔‘‘"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52تا54) {وَ عِنْدَهُمْ قٰصِرٰتُ الطَّرْفِ اَتْرَابٌ …:} یعنی جن کی نظریں اپنے خاوندوں سے آگے بڑھنے والی نہیں ہوں گی۔ {’’ اَتْرَابٌ ‘‘ ’’تِرْبٌ‘‘} کی جمع ہے جو {’’تُرَابٌ‘‘} (مٹی) سے مشتق ہے، ہم عمر جو بچپن میں مل کر مٹی کے ساتھ کھیلتے رہے ہوں۔ یعنی وہ بیویاں خاوندوں کی ہم عمر اور ہم مزاج ہوں گی۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 52تا54) {وَ عِنْدَهُمْ قٰصِرٰتُ الطَّرْفِ اَتْرَابٌ …:} یعنی جن کی نظریں اپنے خاوندوں سے آگے بڑھنے والی نہیں ہوں گی۔ {’’ اَتْرَابٌ ‘‘ ’’تِرْبٌ‘‘} کی جمع ہے جو {’’تُرَابٌ‘‘} (مٹی) سے مشتق ہے، ہم عمر جو بچپن میں مل کر مٹی کے ساتھ کھیلتے رہے ہوں۔ یعنی وہ بیویاں خاوندوں کی ہم عمر اور ہم مزاج ہوں گی۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 52تا54) {وَ عِنْدَهُمْ قٰصِرٰتُ الطَّرْفِ اَتْرَابٌ …:} یعنی جن کی نظریں اپنے خاوندوں سے آگے بڑھنے والی نہیں ہوں گی۔ {’’ اَتْرَابٌ ‘‘ ’’تِرْبٌ‘‘} کی جمع ہے جو {’’تُرَابٌ‘‘} (مٹی) سے مشتق ہے، ہم عمر جو بچپن میں مل کر مٹی کے ساتھ کھیلتے رہے ہوں۔ یعنی وہ بیویاں خاوندوں کی ہم عمر اور ہم مزاج ہوں گی۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 56،55) { هٰذَا وَ اِنَّ لِلطّٰغِيْنَ لَشَرَّ مَاٰبٍ … : ’’ هٰذَا ‘‘} یعنی یہ تو متقین کی جزا ہوئی، اب کفار کا انجام سنو جو اللہ کی حدود سے آگے بڑھنے والے اور اس کے احکام سے سرکشی کرنے والے ہیں کہ ان کے لیے ایک بدترین ٹھکانا ہے، جو جہنم ہے۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56،55) { هٰذَا وَ اِنَّ لِلطّٰغِيْنَ لَشَرَّ مَاٰبٍ … : ’’ هٰذَا ‘‘} یعنی یہ تو متقین کی جزا ہوئی، اب کفار کا انجام سنو جو اللہ کی حدود سے آگے بڑھنے والے اور اس کے احکام سے سرکشی کرنے والے ہیں کہ ان کے لیے ایک بدترین ٹھکانا ہے، جو جہنم ہے۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) {هٰذَا فَلْيَذُوْقُوْهُ حَمِيْمٌ وَّ غَسَّاقٌ : ’’ هٰذَا ‘‘} یعنی یہ ہے عذاب، سو وہ اسے چکھیں۔ {’’ حَمِيْمٌ ‘‘} انتہائی گرم پانی۔ {’’ غَسَّاقٌ ‘‘ } جہنمیوں کے چمڑوں سے بہنے والی پیپ۔ (مفردات) {’’غَسَقَ الْجُرْحُ } (ض، س) {غَسَقَانًا‘‘} جب اس سے پیپ وغیرہ نکلے۔ قاموس اور لغت کی دوسری کتابوں میں {’’غَسَّاقٌ‘‘} کا معنی {’’اَلْبَارِدُ وَ الْمُنْتِنُ‘‘} لکھا ہے، نہایت ٹھنڈا اور بدبو دار۔ قرآن مجید میں دو مقامات پر یہ لفظ {’’ حَمِيْمٌ ‘‘} کے مقابلہ میں آیا ہے، ایک یہاں اور ایک سورۂ نبا (۲۵) میں، جس سے معلوم ہوتا ہے کہ یہاں اس کا معنی شدید ٹھنڈا اور بدبودار کرنا زیادہ مناسب ہے، کیونکہ جہنم میں گرمی (آگ) کا عذاب بھی ہے اور سردی (زمہریر) کا بھی۔ ابن کثیر نے فرمایا {’’اَلْحَمِيْمُ‘‘} انتہا کو پہنچا ہوا گرم اور {’’غَسَّاقٌ‘‘ } ایسا ٹھنڈا جس کی ٹھنڈک برداشت نہ ہو سکے۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) {وَ اٰخَرُ مِنْ شَكْلِهٖۤ اَزْوَاجٌ : ’’ اٰخَرُ ‘‘} مبتدا ہے، {’’ مِنْ شَكْلِهٖۤ ‘‘ ’’كَائِنٌ‘‘} کے متعلق ہو کر اس کی صفت ہے اور {’’ اَزْوَاجٌ ‘‘} خبر ہے۔ یعنی ان کا عذاب صرف حمیم و غسّاق ہی نہیں ہو گا، بلکہ حمیم و غسّاق سے ملتی جلتی کئی شکلوں کا اور عذاب بھی ہو گا، مثلاً زمہریر، سموم، زقّوم اور صعود وغیرہ۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) {هٰذَا فَوْجٌ مُّقْتَحِمٌ مَّعَكُمْ …:} ابن کثیر نے فرمایا، یہاں اللہ تعالیٰ نے جہنمیوں کی ایک دوسرے سے کی جانے والی باتوں کا ذکر فرمایا ہے، جیسا کہ فرمایا : « كُلَّمَا دَخَلَتْ اُمَّةٌ لَّعَنَتْ اُخْتَهَا » [ الأعراف : ۳۸ ] ’’جب بھی کوئی جماعت داخل ہو گی اپنے ساتھ والی کو لعنت کرے گی۔‘‘ یعنی وہ سلام کے بجائے ایک دوسرے پر لعنت کریں گے اور ایک دوسرے کو جھوٹا اور کافر کہیں گے۔ چنانچہ وہ جماعت جو دوسری جماعت سے پہلے داخل ہو گی جب اس کے بعد والی جماعت جہنم کے دربان فرشتوں کے ساتھ داخل ہو گی تو پہلے والی جماعت فرشتوں سے کہے گی، یہ ایک گروہ ہے جو تمھارے ساتھ گھستا چلا آ رہا ہے، انھیں کوئی خوش آمدید نہیں، یقینا وہ آگ میں داخل ہونے والے ہیں۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) {قَالُوْا بَلْ اَنْتُمْ لَا مَرْحَبًۢا بِكُمْ …:} بعد میں داخل ہونے والے ان سے کہیں گے، بلکہ تمھارے لیے کوئی خوش آمدید نہیں، تمھی نے ہمیں اس کام کی دعوت دی جس نے ہمیں اس انجام تک پہنچایا، سو یہ ہمارا اور تمھارا بہت برا ٹھکانا ہے۔ یہ بات وہ محض دل ٹھنڈا کرنے کے لیے کہیں گے۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) {قَالُوْا رَبَّنَا مَنْ قَدَّمَ لَنَا هٰذَا …:} جب اس سے دل ٹھنڈا نہ ہو گا تو اللہ تعالیٰ سے دعا کریں گے، اے ہمارے پروردگار! جو بھی اس عذاب کو ہمارے آگے لایا ہے تو اسے آگ میں دگنا عذاب کر، ایک خود گمراہ ہونے کا اور دوسرا ہمیں گمراہ کرنے کا، جیسا کہ اللہ تعالیٰ نے فرمایا : « وَ قَالَتْ اُوْلٰىهُمْ لِاُخْرٰىهُمْ فَمَا كَانَ لَكُمْ عَلَيْنَا مِنْ فَضْلٍ فَذُوْقُواا الْعَذَابَ بِمَا كُنْتُمْ تَكْسِبُوْنَ » [ الأعراف : ۳۸ ] ’’تو ان کی پچھلی جماعت اپنے سے پہلی جماعت کے متعلق کہے گی اے ہمارے رب! ان لوگوں نے ہمیں گمراہ کیا، تو انھیں آگ کا دگنا عذاب دے۔ فرمائے گا سبھی کے لیے دگنا ہے اور لیکن تم نہیں جانتے۔‘‘ اس آیت سے ملتی جلتی آیت کے لیے دیکھیے سورۂ احزاب (۶۷، ۶۸)۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) {وَ قَالُوْا مَا لَنَا لَا نَرٰى رِجَالًا … : ’’ الْاَشْرَارِ ‘‘ ’’شَرٌّ‘‘} کی جمع ہے، جو اصل میں {’’أَشَرُّ‘‘} اسم تفضیل ہے، بدترین لوگ۔ یعنی جہنمی آگ میں چاروں طرف نگاہ ڈالیں گے تو انھیں اپنے چودھری، سردار اور پیشوا تو نظر آئیں گے مگر وہ مومن نظر نہیں آئیں گے جنھیں وہ دنیا میں مذاق کیا کرتے تھے۔ اس پر وہ حسرت و افسوس اور تعجب سے کہیں گے، ہمیں کیا ہے کہ ہم جہنم میں اپنے ساتھ ان ایمان والوں کو نہیں دیکھ رہے جنھیں ہم دنیا میں بد ترین لوگوں میں شمار کرتے تھے؟"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) { اَتَّخَذْنٰهُمْ سِخْرِيًّا … :} یعنی اب دو ہی صورتیں ہیں، یا تو ہم غلطی پر تھے کہ انھیں ناحق مذاق کا نشانہ بناتے رہے، یا وہ بھی یہیں کہیں جہنم میں ہیں، مگر ہماری نگاہیں ان سے پھر گئی ہیں، جو وہ ہمیں نظر نہیں آ رہے۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) { اِنَّ ذٰلِكَ لَحَقٌّ … :} یعنی اگرچہ یہ بات تمھاری سمجھ میں آنا مشکل ہے کہ اتنے شدید عذاب اور نفسا نفسی میں ایک دوسرے سے جھگڑیں گے، مگر سن لو ! یہ بات بالکل حق ہے کہ آگ میں جلنے والے ایک دوسرے سے سخت جھگڑیں گے اور یہ بھی ان کے عذاب کا ایک حصہ ہو گا۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) ➊ { قُلْ اِنَّمَاۤ اَنَا مُنْذِرٌ …:} سورت کی ابتدا میں رسول اللہ صلی اللہ علیہ وسلم کے رسول ہونے اور اللہ تعالیٰ کے ایک معبود برحق ہونے پر کفار کے تعجب اور انکار کا ذکر تھا اور ان کے یہ کہنے کا کہ کیا یہ ہمیں ہمارے اتنے معبودوں کے بجائے ایک ہی معبود کی عبادت کی دعوت دیتا ہے اور یہ کہ ہم تمام سرداروں کے ہوتے ہوئے اس پر وحی کیسے نازل ہو گئی؟ بلکہ یہ ساحر اور کذّاب ہے۔ کفار کی ان باتوں اور ان کے قیامت کے جھٹلانے اور اس کا مذاق اڑانے پر رسول اللہ صلی اللہ علیہ وسلم کو صبر کا حکم دیا۔ اب سورت کے آخر میں پھر اسی مضمون کو دہرایا جا رہا ہے کہ آپ ان سے کہہ دیں کہ میں تو بس ایک ڈرانے والا ہوں، نہ ساحر ہوں، نہ کذّاب، نہ کچھ اور۔ صرف ڈرانے والا اس لیے کہ بشارت ماننے والوں کے لیے ہوتی ہے، منکروں کو ڈرایا ہی جاتا ہے۔ ¤ ➋ { وَ مَا مِنْ اِلٰهٍ اِلَّا اللّٰهُ الْوَاحِدُ الْقَهَّارُ :} عبادت کے لائق صرف اللہ تعالیٰ ہے۔ لفظ {’’ اللّٰهُ ‘‘} میں اگرچہ اللہ تعالیٰ کی تمام صفات آ جاتی ہیں، کیونکہ یہ معبود برحق کا عَلم (نام) ہے، مگر یہاں اس کے واحد معبود ہونے کی دلیل کے طور پر اس کی پانچ صفات کا خاص طور پر ذکر فرمایا، پہلی صفت {’’ الْوَاحِدُ ‘‘} ہے، یعنی اس کے علاوہ ہر چیز جوڑا ہے، اکیلا وہی ہے۔ {’’ الْقَهَّارُ ‘‘} بڑے دبدبے والا، کوئی اس کے قہر کے سامنے ٹھہر نہیں سکتا۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) {رَبُّ السَّمٰوٰتِ وَ الْاَرْضِ وَ مَا بَيْنَهُمَا … :} اس آیت میں اللہ تعالیٰ کی تین صفات بیان ہوئی ہیں جو اللہ کے سوا کسی میں نہیں پائی جاتیں، پھر کسی اور کی عبادت کیوں، جو نہ واحد ہے نہ قہر اور دبدبے کا مالک، نہ آسمان و زمین اور ان کے مابین کا رب ہے، نہ ہی اس کے ہاتھ میں قوت و اقتدار ہے اور نہ ہی گناہوں کو بخشنے کا اختیار؟"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 68،67) {قُلْ هُوَ نَبَؤٌا عَظِيْمٌ … :} پچھلی آیت میں رسول اللہ صلی اللہ علیہ وسلم کو یہ کہنے کا حکم دیا کہ میں تو صرف ڈرانے والا ہوں اور معبود صرف اللہ ہے جو مذکورہ صفات کا مالک ہے۔ رسول اللہ صلی اللہ علیہ وسلم انھیں اللہ کے عذاب سے اور قیامت سے ڈراتے تھے، جس پر وہ فوراً مطالبہ کرتے کہ وہ عذاب لاؤ، قیامت لے آؤ، یہ وعدہ کب پورا ہو گا؟ یہاں ان کا سوال ذکر کیے بغیر اس کا جواب دینے کا حکم دیا کہ ان سے کہہ دیجیے کہ وہ قیامت بہت بڑی خبر اور بہت بڑا واقعہ ہے جس سے تم منہ موڑنے والے ہو۔ رہا مجھ سے یہ سوال کہ وہ کب آئے گی؟ تو یہ بتانا میرا کام نہیں، قیامت تو بہت دور کی بات ہے، مجھے تو آسمانوں پر فرشتوں کی مجلس میں ہونے والی بات چیت اور بحث کا بھی کبھی علم نہیں ہوتا، سوائے اس کے جو میری طرف وحی کی جائے۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68،67) {قُلْ هُوَ نَبَؤٌا عَظِيْمٌ … :} پچھلی آیت میں رسول اللہ صلی اللہ علیہ وسلم کو یہ کہنے کا حکم دیا کہ میں تو صرف ڈرانے والا ہوں اور معبود صرف اللہ ہے جو مذکورہ صفات کا مالک ہے۔ رسول اللہ صلی اللہ علیہ وسلم انھیں اللہ کے عذاب سے اور قیامت سے ڈراتے تھے، جس پر وہ فوراً مطالبہ کرتے کہ وہ عذاب لاؤ، قیامت لے آؤ، یہ وعدہ کب پورا ہو گا؟ یہاں ان کا سوال ذکر کیے بغیر اس کا جواب دینے کا حکم دیا کہ ان سے کہہ دیجیے کہ وہ قیامت بہت بڑی خبر اور بہت بڑا واقعہ ہے جس سے تم منہ موڑنے والے ہو۔ رہا مجھ سے یہ سوال کہ وہ کب آئے گی؟ تو یہ بتانا میرا کام نہیں، قیامت تو بہت دور کی بات ہے، مجھے تو آسمانوں پر فرشتوں کی مجلس میں ہونے والی بات چیت اور بحث کا بھی کبھی علم نہیں ہوتا، سوائے اس کے جو میری طرف وحی کی جائے۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 70،69) {مَا كَانَ لِيَ مِنْ عِلْمٍۭ …:} سب سے اونچی مجلس سے مراد آسمانوں پر فرشتوں کی مجلس ہے۔ {’’ كَانَ ‘‘} ہمیشگی کا معنی دیتا ہے، اس پر نفی آنے سے نفی کی ہمیشگی مراد ہوتی ہے، یعنی فرشتوں کی مجلس میں جو بحث ہوتی ہے مجھے اس کا کبھی کچھ علم نہیں ہوتا، میں عالم الغیب نہیں، اس کے متعلق میں جو کچھ تمھیں بتاتا ہوں وہ وحی الٰہی کے ذریعے سے مجھے معلوم ہوتا ہے اور وہ بھی صرف ان بحثوں کے متعلق کہ جن کا تعلق لوگوں کی ہدایت اور انھیں خبردار کرنے اور ڈرانے سے ہوتا ہے۔ یہ وحی الٰہی میری نبوت کی بھی دلیل ہے، کیونکہ اگر وحی نہ ہوتی تو میں ملأ اعلیٰ میں ہونے والی کوئی بات تمھیں نہ بتا سکتا۔ ¤ ایک حدیث میں رسول اللہ صلی اللہ علیہ وسلم نے ملأ اعلیٰ کی ایک مجلس کی گفتگو کا ذکر فرمایا، معاذ بن جبل رضی اللہ عنہ بیان کرتے ہیں کہ ایک صبح رسول اللہ صلی اللہ علیہ وسلم ہم سے صبح کی نماز سے رکے رہے، یہاں تک کہ قریب تھا کہ ہم سورج کی ٹکیہ دیکھ لیں، پھر آپ جلدی سے نکلے، نماز کی اقامت کہی گئی اور رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھائی اور اس میں اختصار سے کام لیا، جب سلام پھیرا تو آواز کے ساتھ ہمیں فرمایا، اپنی اپنی جگہ اسی طرح بیٹھے رہو، پھر فرمایا : [ أَمَا إِنِّيْ سَأُحَدِّثُكُمْ مَا حَبَسَنِيْ عَنْكُمُ الْغَدَاةَ إِنِّيْ قُمْتُ مِنَ اللَّيْلِ فَتَوَضَّأْتُ فَصَلَّيْتُ مَا قُدِّرَ لِيْ فَنَعَسْتُ فِيْ صَلاَتِيْ حَتَّی اسْتَثْقَلْتُ فَإِذَا أَنَا بِرَبِّيْ تَبَارَكَ وَ تَعَالٰی فِيْ أَحْسَنِ صُوْرَةٍ فَقَالَ يَا مُحَمَّدُ! قُلْتُ لَبَّيْكَ رَبِّ قَالَ فِيْمَ يَخْتَصِمُ الْمَلَأُ الْأَعْلٰی؟ قُلْتُ لَا أَدْرِيْ قَالَهَا ثَلاَثًا قَالَ فَرَأَيْتُهُ وَضَعَ كَفَّهُ بَيْنَ كَتِفَيَّ حَتّٰی وَجَدْتُّ بَرْدَ أَنَامِلِهِ بَيْنَ ثَدْيَيَّ فَتَجَلّٰی لِيْ كُلُّ شَيْءٍ وَ عَرَفْتُ فَقَالَ يَاا مُحَمَّدُ! قُلْتُ لَبَّيْكَ رَبِّ قَالَ فِيْمَ يَخْتَصِمُ الْمَلَأُ الْأَعْلٰی؟ قُلْتُ فِي الْكَفَّارَاتِ قَالَ مَا هُنَّ؟ قُلْتُ مَشْيُ الْأَقْدَامِ إِلَی الْجَمَاعَاتِ وَ الْجُلُوْسُ فِي االْمَسَاجِدِ بَعْدَ الصَّلَوَاتِ وَ إِسْبَاغُ الْوُضُوْءِ فِي الْمَكْرُوْهَاتِ قَالَ ثُمَّ فِيْمَ؟ قُلْتُ إِطْعَامُ الطَّعَامِ وَ لِيْنُ الْكَلاَمِ وَ الصَّلاَةُ بِاللَّيْلِ وَ النَّاسُ نِيَامٌ، قَالَ سَلْ قُلْتُ اللّٰهُمَّ إِنِّيْ أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ وَ تَرْكَ الْمُنْكَرَاتِ وَ حُبَّ الْمَسَاكِيْنِ وَ أَنْ تَغْفِرَ لِيْ وَ تَرْحَمَنِيْ وَ إِذَا أَرَدْتَّ فِتْنَةً فِيْ قَوْمٍ فَتَوَفَّنِيْ غَيْرَ مَفْتُوْنٍ وَأَسْأَلُكَ حُبَّكَ وَ حُببَّ مَنْ يُّحِبُّكَ وَحُبَّ عَمَلٍ يُقَرِّبُ إِلٰی حُبِّكَ قَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ إِنَّهَا حَقٌّ فَادْرُسُوْهَا ثُمَّ تَعَلَّمُوْهَا ] [ترمذي، التفسیر، باب سورۃ صٓ  : ۳۲۳۵ ] ’’سنو! میں تمھیں بتاؤں گا کہ آج صبح مجھے تم سے کس چیز نے روکے رکھا، میں رات کو اٹھا، وضو کیا اور جتنی نماز قسمت میں تھی وہ پڑھی، نماز میں مجھے نیند آگئی، حتیٰ کہ میں بوجھل ہو گیا تو اچانک میں اپنے رب کو بہترین صورت میں دیکھتا ہوں۔ اس نے فرمایا : ’’اے محمد !‘‘ میں نے کہا : ’’حاضر ہوں، اے میرے رب!‘‘ فرمایا : ’’ملأ اعلیٰ کس چیز میں بحث کر رہے ہیں؟‘‘ میں نے کہا : ’’میں نہیں جانتا۔‘‘ اللہ تعالیٰ نے یہ بات تین دفعہ کہی، تو میں نے اسے دیکھا کہ اس نے اپنی ہتھیلی میرے کندھوں کے درمیان رکھی، یہاں تک کہ میں نے اس کے پوروں کی ٹھنڈک اپنے سینے کے درمیان محسوس کی، تو میرے لیے ہر چیز روشن ہو گئی اور میں نے پہچان لی۔ پھر فرمایا : ’’اے محمد!‘‘ میں نے کہا : ’’حاضر ہوں اے میرے رب!‘‘ فرمایا : ’’ملأ اعلیٰ کس چیز میں بحث کر رہے ہیں؟‘‘ میں نے کہا : ’’کفارات کے بارے میں۔‘‘ فرمایا : ’’وہ کیا ہیں؟‘‘ میں نے کہا: ’’پیدل چل کر جماعت (کے ساتھ نماز) کے لیے جانا اور نمازوں کے بعد مسجدوں میں بیٹھنا اور ناپسندیدہ وقتوں میں وضو کرنا۔‘‘ فرمایا : ’’پھر کس چیز میں؟‘‘ میں نے کہا : ’’کھانا کھلانے میں اور نرم کلام میں اور رات کو نماز کے بارے میں جب لوگ سوئے ہوئے ہوں۔‘‘ فرمایا : ’’مانگ۔‘‘ تو میں نے یہ دعا کی : ’’( {اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ} ‘‘ سے لے کر {’’ يُقَرِّبُ إِلٰي حُبِّكَ‘‘} تک) اے اللہ! میں تجھ سے نیکیاں کرنے کا سوال کرتا ہوں اور برائیاں ترک کرنے کا اور مسکینوں کی محبت کا اور یہ کہ تو مجھے بخش دے اور مجھ پر رحم کرے اور جب تو کسی قوم میں فتنے کا ارادہ کرے تو مجھے فتنے میں مبتلا ہوئے بغیر فوت کر لے، اور میں تجھ سے تیری محبت کا سوال کرتا ہوں اور اس شخص کی محبت کا جو تجھ سے محبت کرتا ہے اور اس عمل کی محبت کا جو تیری محبت کے قریب کر دے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ دعا حق ہے، اسے پڑھو، پھر اسے اچھی طرح سیکھو۔‘‘ ترمذی نے فرمایا : ’’یہ حدیث حسن صحیح ہے، میں نے محمد بن اسماعیل (بخاری) سے اس حدیث کے بارے میں پوچھا تو انھوں نے فرمایا، یہ حدیث حسن صحیح ہے۔‘‘ شیخ البانی رحمہ اللہ نے بھی اس حدیث کو صحیح کہا ہے۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70،69) {مَا كَانَ لِيَ مِنْ عِلْمٍۭ …:} سب سے اونچی مجلس سے مراد آسمانوں پر فرشتوں کی مجلس ہے۔ {’’ كَانَ ‘‘} ہمیشگی کا معنی دیتا ہے، اس پر نفی آنے سے نفی کی ہمیشگی مراد ہوتی ہے، یعنی فرشتوں کی مجلس میں جو بحث ہوتی ہے مجھے اس کا کبھی کچھ علم نہیں ہوتا، میں عالم الغیب نہیں، اس کے متعلق میں جو کچھ تمھیں بتاتا ہوں وہ وحی الٰہی کے ذریعے سے مجھے معلوم ہوتا ہے اور وہ بھی صرف ان بحثوں کے متعلق کہ جن کا تعلق لوگوں کی ہدایت اور انھیں خبردار کرنے اور ڈرانے سے ہوتا ہے۔ یہ وحی الٰہی میری نبوت کی بھی دلیل ہے، کیونکہ اگر وحی نہ ہوتی تو میں ملأ اعلیٰ میں ہونے والی کوئی بات تمھیں نہ بتا سکتا۔ ¤ ایک حدیث میں رسول اللہ صلی اللہ علیہ وسلم نے ملأ اعلیٰ کی ایک مجلس کی گفتگو کا ذکر فرمایا، معاذ بن جبل رضی اللہ عنہ بیان کرتے ہیں کہ ایک صبح رسول اللہ صلی اللہ علیہ وسلم ہم سے صبح کی نماز سے رکے رہے، یہاں تک کہ قریب تھا کہ ہم سورج کی ٹکیہ دیکھ لیں، پھر آپ جلدی سے نکلے، نماز کی اقامت کہی گئی اور رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھائی اور اس میں اختصار سے کام لیا، جب سلام پھیرا تو آواز کے ساتھ ہمیں فرمایا، اپنی اپنی جگہ اسی طرح بیٹھے رہو، پھر فرمایا : [ أَمَا إِنِّيْ سَأُحَدِّثُكُمْ مَا حَبَسَنِيْ عَنْكُمُ الْغَدَاةَ إِنِّيْ قُمْتُ مِنَ اللَّيْلِ فَتَوَضَّأْتُ فَصَلَّيْتُ مَا قُدِّرَ لِيْ فَنَعَسْتُ فِيْ صَلاَتِيْ حَتَّی اسْتَثْقَلْتُ فَإِذَا أَنَا بِرَبِّيْ تَبَارَكَ وَ تَعَالٰی فِيْ أَحْسَنِ صُوْرَةٍ فَقَالَ يَا مُحَمَّدُ! قُلْتُ لَبَّيْكَ رَبِّ قَالَ فِيْمَ يَخْتَصِمُ الْمَلَأُ الْأَعْلٰی؟ قُلْتُ لَا أَدْرِيْ قَالَهَا ثَلاَثًا قَالَ فَرَأَيْتُهُ وَضَعَ كَفَّهُ بَيْنَ كَتِفَيَّ حَتّٰی وَجَدْتُّ بَرْدَ أَنَامِلِهِ بَيْنَ ثَدْيَيَّ فَتَجَلّٰی لِيْ كُلُّ شَيْءٍ وَ عَرَفْتُ فَقَالَ يَاا مُحَمَّدُ! قُلْتُ لَبَّيْكَ رَبِّ قَالَ فِيْمَ يَخْتَصِمُ الْمَلَأُ الْأَعْلٰی؟ قُلْتُ فِي الْكَفَّارَاتِ قَالَ مَا هُنَّ؟ قُلْتُ مَشْيُ الْأَقْدَامِ إِلَی الْجَمَاعَاتِ وَ الْجُلُوْسُ فِي االْمَسَاجِدِ بَعْدَ الصَّلَوَاتِ وَ إِسْبَاغُ الْوُضُوْءِ فِي الْمَكْرُوْهَاتِ قَالَ ثُمَّ فِيْمَ؟ قُلْتُ إِطْعَامُ الطَّعَامِ وَ لِيْنُ الْكَلاَمِ وَ الصَّلاَةُ بِاللَّيْلِ وَ النَّاسُ نِيَامٌ، قَالَ سَلْ قُلْتُ اللّٰهُمَّ إِنِّيْ أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ وَ تَرْكَ الْمُنْكَرَاتِ وَ حُبَّ الْمَسَاكِيْنِ وَ أَنْ تَغْفِرَ لِيْ وَ تَرْحَمَنِيْ وَ إِذَا أَرَدْتَّ فِتْنَةً فِيْ قَوْمٍ فَتَوَفَّنِيْ غَيْرَ مَفْتُوْنٍ وَأَسْأَلُكَ حُبَّكَ وَ حُببَّ مَنْ يُّحِبُّكَ وَحُبَّ عَمَلٍ يُقَرِّبُ إِلٰی حُبِّكَ قَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ إِنَّهَا حَقٌّ فَادْرُسُوْهَا ثُمَّ تَعَلَّمُوْهَا ] [ترمذي، التفسیر، باب سورۃ صٓ  : ۳۲۳۵ ] ’’سنو! میں تمھیں بتاؤں گا کہ آج صبح مجھے تم سے کس چیز نے روکے رکھا، میں رات کو اٹھا، وضو کیا اور جتنی نماز قسمت میں تھی وہ پڑھی، نماز میں مجھے نیند آگئی، حتیٰ کہ میں بوجھل ہو گیا تو اچانک میں اپنے رب کو بہترین صورت میں دیکھتا ہوں۔ اس نے فرمایا : ’’اے محمد !‘‘ میں نے کہا : ’’حاضر ہوں، اے میرے رب!‘‘ فرمایا : ’’ملأ اعلیٰ کس چیز میں بحث کر رہے ہیں؟‘‘ میں نے کہا : ’’میں نہیں جانتا۔‘‘ اللہ تعالیٰ نے یہ بات تین دفعہ کہی، تو میں نے اسے دیکھا کہ اس نے اپنی ہتھیلی میرے کندھوں کے درمیان رکھی، یہاں تک کہ میں نے اس کے پوروں کی ٹھنڈک اپنے سینے کے درمیان محسوس کی، تو میرے لیے ہر چیز روشن ہو گئی اور میں نے پہچان لی۔ پھر فرمایا : ’’اے محمد!‘‘ میں نے کہا : ’’حاضر ہوں اے میرے رب!‘‘ فرمایا : ’’ملأ اعلیٰ کس چیز میں بحث کر رہے ہیں؟‘‘ میں نے کہا : ’’کفارات کے بارے میں۔‘‘ فرمایا : ’’وہ کیا ہیں؟‘‘ میں نے کہا: ’’پیدل چل کر جماعت (کے ساتھ نماز) کے لیے جانا اور نمازوں کے بعد مسجدوں میں بیٹھنا اور ناپسندیدہ وقتوں میں وضو کرنا۔‘‘ فرمایا : ’’پھر کس چیز میں؟‘‘ میں نے کہا : ’’کھانا کھلانے میں اور نرم کلام میں اور رات کو نماز کے بارے میں جب لوگ سوئے ہوئے ہوں۔‘‘ فرمایا : ’’مانگ۔‘‘ تو میں نے یہ دعا کی : ’’( {اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ} ‘‘ سے لے کر {’’ يُقَرِّبُ إِلٰي حُبِّكَ‘‘} تک) اے اللہ! میں تجھ سے نیکیاں کرنے کا سوال کرتا ہوں اور برائیاں ترک کرنے کا اور مسکینوں کی محبت کا اور یہ کہ تو مجھے بخش دے اور مجھ پر رحم کرے اور جب تو کسی قوم میں فتنے کا ارادہ کرے تو مجھے فتنے میں مبتلا ہوئے بغیر فوت کر لے، اور میں تجھ سے تیری محبت کا سوال کرتا ہوں اور اس شخص کی محبت کا جو تجھ سے محبت کرتا ہے اور اس عمل کی محبت کا جو تیری محبت کے قریب کر دے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ دعا حق ہے، اسے پڑھو، پھر اسے اچھی طرح سیکھو۔‘‘ ترمذی نے فرمایا : ’’یہ حدیث حسن صحیح ہے، میں نے محمد بن اسماعیل (بخاری) سے اس حدیث کے بارے میں پوچھا تو انھوں نے فرمایا، یہ حدیث حسن صحیح ہے۔‘‘ شیخ البانی رحمہ اللہ نے بھی اس حدیث کو صحیح کہا ہے۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71تا74) ➊ { اِذْ قَالَ رَبُّكَ لِلْمَلٰٓىِٕكَةِ… :} یہ ملأ اعلیٰ میں ہونے والی ایک بحث کا ذکر ہے جو آدم علیہ السلام کی پیدائش کے متعلق ہوئی۔ اس مجلس میں فرشتوں کے ساتھ ابلیس بھی تھا اور اسے بھی آدم علیہ السلام کو سجدہ کرنے کا حکم دیا گیا تھا۔ تفصیل سورۂ اعراف (۱۱) میں دیکھیے۔ مفسر رازی نے فرمایا : ’’اس قصّے کے یہاں خاص طور پر ذکر کی مناسبت یہ ہے کہ کفار کو رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے سے روکنے والی چیز ان کا حسد اور کبر تھا، ابلیس پر لعنت کا سبب بھی اس کا آدم علیہ السلام پر حسد اور کبر تھا، اس لیے کفار کو یہ قصّہ سنایا۔‘‘ ¤ ➋ اللہ تعالیٰ کے آدم علیہ السلام کو مٹی سے بنانے، اس میں اپنی روح پھونکنے، فرشتوں کو آدم کے سامنے سجدے کا حکم دینے اور شیطان کے سجدے سے انکار اور اس کے نتیجے کے متعلق تفصیل پہلے کئی مقامات پر گزر چکی ہے۔ مثلاً دیکھیے سورۂ بقرہ (۳۰ تا ۳۸)، حجر (۲۵ تا ۴۳)، اعراف (۱۱ تا ۲۵)، بنی اسرائیل (۶۱ تا ۶۵)، کہف (۵۰) اور سورۂ طٰہٰ (۱۱۶ تا ۱۲۳)۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 71تا74) ➊ { اِذْ قَالَ رَبُّكَ لِلْمَلٰٓىِٕكَةِ… :} یہ ملأ اعلیٰ میں ہونے والی ایک بحث کا ذکر ہے جو آدم علیہ السلام کی پیدائش کے متعلق ہوئی۔ اس مجلس میں فرشتوں کے ساتھ ابلیس بھی تھا اور اسے بھی آدم علیہ السلام کو سجدہ کرنے کا حکم دیا گیا تھا۔ تفصیل سورۂ اعراف (۱۱) میں دیکھیے۔ مفسر رازی نے فرمایا : ’’اس قصّے کے یہاں خاص طور پر ذکر کی مناسبت یہ ہے کہ کفار کو رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے سے روکنے والی چیز ان کا حسد اور کبر تھا، ابلیس پر لعنت کا سبب بھی اس کا آدم علیہ السلام پر حسد اور کبر تھا، اس لیے کفار کو یہ قصّہ سنایا۔‘‘ ¤ ➋ اللہ تعالیٰ کے آدم علیہ السلام کو مٹی سے بنانے، اس میں اپنی روح پھونکنے، فرشتوں کو آدم کے سامنے سجدے کا حکم دینے اور شیطان کے سجدے سے انکار اور اس کے نتیجے کے متعلق تفصیل پہلے کئی مقامات پر گزر چکی ہے۔ مثلاً دیکھیے سورۂ بقرہ (۳۰ تا ۳۸)، حجر (۲۵ تا ۴۳)، اعراف (۱۱ تا ۲۵)، بنی اسرائیل (۶۱ تا ۶۵)، کہف (۵۰) اور سورۂ طٰہٰ (۱۱۶ تا ۱۲۳)۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 71تا74) ➊ { اِذْ قَالَ رَبُّكَ لِلْمَلٰٓىِٕكَةِ… :} یہ ملأ اعلیٰ میں ہونے والی ایک بحث کا ذکر ہے جو آدم علیہ السلام کی پیدائش کے متعلق ہوئی۔ اس مجلس میں فرشتوں کے ساتھ ابلیس بھی تھا اور اسے بھی آدم علیہ السلام کو سجدہ کرنے کا حکم دیا گیا تھا۔ تفصیل سورۂ اعراف (۱۱) میں دیکھیے۔ مفسر رازی نے فرمایا : ’’اس قصّے کے یہاں خاص طور پر ذکر کی مناسبت یہ ہے کہ کفار کو رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے سے روکنے والی چیز ان کا حسد اور کبر تھا، ابلیس پر لعنت کا سبب بھی اس کا آدم علیہ السلام پر حسد اور کبر تھا، اس لیے کفار کو یہ قصّہ سنایا۔‘‘ ¤ ➋ اللہ تعالیٰ کے آدم علیہ السلام کو مٹی سے بنانے، اس میں اپنی روح پھونکنے، فرشتوں کو آدم کے سامنے سجدے کا حکم دینے اور شیطان کے سجدے سے انکار اور اس کے نتیجے کے متعلق تفصیل پہلے کئی مقامات پر گزر چکی ہے۔ مثلاً دیکھیے سورۂ بقرہ (۳۰ تا ۳۸)، حجر (۲۵ تا ۴۳)، اعراف (۱۱ تا ۲۵)، بنی اسرائیل (۶۱ تا ۶۵)، کہف (۵۰) اور سورۂ طٰہٰ (۱۱۶ تا ۱۲۳)۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 71تا74) ➊ { اِذْ قَالَ رَبُّكَ لِلْمَلٰٓىِٕكَةِ… :} یہ ملأ اعلیٰ میں ہونے والی ایک بحث کا ذکر ہے جو آدم علیہ السلام کی پیدائش کے متعلق ہوئی۔ اس مجلس میں فرشتوں کے ساتھ ابلیس بھی تھا اور اسے بھی آدم علیہ السلام کو سجدہ کرنے کا حکم دیا گیا تھا۔ تفصیل سورۂ اعراف (۱۱) میں دیکھیے۔ مفسر رازی نے فرمایا : ’’اس قصّے کے یہاں خاص طور پر ذکر کی مناسبت یہ ہے کہ کفار کو رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے سے روکنے والی چیز ان کا حسد اور کبر تھا، ابلیس پر لعنت کا سبب بھی اس کا آدم علیہ السلام پر حسد اور کبر تھا، اس لیے کفار کو یہ قصّہ سنایا۔‘‘ ¤ ➋ اللہ تعالیٰ کے آدم علیہ السلام کو مٹی سے بنانے، اس میں اپنی روح پھونکنے، فرشتوں کو آدم کے سامنے سجدے کا حکم دینے اور شیطان کے سجدے سے انکار اور اس کے نتیجے کے متعلق تفصیل پہلے کئی مقامات پر گزر چکی ہے۔ مثلاً دیکھیے سورۂ بقرہ (۳۰ تا ۳۸)، حجر (۲۵ تا ۴۳)، اعراف (۱۱ تا ۲۵)، بنی اسرائیل (۶۱ تا ۶۵)، کہف (۵۰) اور سورۂ طٰہٰ (۱۱۶ تا ۱۲۳)۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 75تا85) ➊ { قَالَ يٰۤاِبْلِيْسُ مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ:} اس آیت سے آدم علیہ السلام کا شرف اور ان کی فضیلت ثابت ہوتی ہے، کیونکہ اللہ تعالیٰ نے صاف لفظوں میں فرمایا کہ میں نے اسے اپنے دو ہاتھوں سے بنایا۔ بعض لوگ اللہ تعالیٰ کے ہاتھوں کا انکار کرتے ہیں اور اس کی تاویل کرتے ہیں، مگر جب خود اس نے اپنے ہاتھوں کا ذکر فرمایا ہے تو اس کا انکار کیسے کیا جا سکتا ہے؟ تفصیل سورۂ مائدہ کی آیت (۶۴) میں اللہ تعالیٰ کے فرمان : « بَلْ يَدٰهُ مَبْسُوْطَتٰنِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ { اَسْتَكْبَرْتَ اَمْ كُنْتَ مِنَ الْعَالِيْنَ : ’’ اَسْتَكْبَرْتَ  ‘‘} اصل میں {’’أَ اِسْتَكْبَرْتَ‘‘} تھا، ہمزہ استفہام آنے کے بعد ہمزہ وصلی کی ضرورت نہ رہی، اس لیے اسے حذف کر دیا۔ تفصیل سورۂ حجر (۳۲ تا ۴۰) میں دیکھیے۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86) ➊ {قُلْ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ … :} یعنی آپ ان سے کہہ دیں کہ میں دین کی تبلیغ پر تم سے کسی اجرت کا سوال نہیں کرتا، نہ میرا مقصود اس سے کوئی دنیوی فائدہ حاصل کرنا ہے اور نہ ہی میں تکلّف کرنے والوں سے ہوں کہ اللہ تعالیٰ نے نازل نہ کیا ہو اور میں اپنے پاس سے بنا لوں، یا کسی دوسرے کی بات کو اپنی طرف منسوب کر لوں۔ انس رضی اللہ عنہ نے فرمایا، ہم عمر رضی اللہ عنہ کے پاس تھے تو انھوں نے فرمایا : [ نُهِيْنَا عَنِ التَّكَلُّفِ ] [ بخاري، الإعتصام بالکتاب والسنۃ، باب ما یکرہ من کثرۃ السؤال و من تکلف… : ۷۲۹۳ ] ’’ہمیں تکلّف سے منع کر دیا گیا ہے۔‘‘ ¤ ➋ { ’’ الْمُتَكَلِّفِيْنَ ‘‘} کا مطلب عبد اللہ بن مسعود رضی اللہ عنہ کے اس قول سے بھی معلوم ہوتا ہے جو امام بخاری رحمہ اللہ نے اس سورت کی تفسیر میں نقل فرمایا ہے، مسروق کہتے ہیں عبد اللہ بن مسعود رضی اللہ عنہ ہمارے پاس آئے اور انھوں نے فرمایا : [ يَا أَيُّهَا النَّاسُ! مَنْ عَلِمَ شَيْئًا فَلْيَقُلْ بِهِ، وَ مَنْ لَّمْ يَعْلَمْ فَلْيَقُلِ اللّٰهُ أَعْلَمُ، فَإِنَّ مِنَ الْلْعِلْمِ أَنْ يَّقُوْلَ لِمَا لَا يَعْلَمُ اللّٰهُ أَعْلَمُ، قَالَ اللّٰهُ عَزَّوَجَلَّ لِنَبِيِّهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ : « قُلْ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ وَّ مَاۤ اَنَا مِنَ الْمُتَكَلِّفِيْنَ » ] [ بخاري، التفسیر، باب، قولہ : « وما أنا من المتکلفین » : ۴۸۰۹ ] ’’لوگو! جو شخص کوئی چیز جانتا ہے وہ اسے بیان کرے اور جو نہیں جانتا وہ کہہ دے ’’اللہ اعلم‘‘ کہ اللہ تعالیٰ بہتر جانتا ہے، کیونکہ یہ بھی علم میں داخل ہے کہ جو بات نہ جانتا ہو اس کے متعلق کہہ دے ’’اللہ اعلم‘‘ کہ اللہ تعالیٰ بہتر جانتا ہے۔ اللہ عز و جل نے اپنے نبی سے فرمایا : « قُلْ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ  وَّ مَاۤ اَنَا مِنَ الْمُتَكَلِّفِيْنَ» ’’کہہ دے میں تم سے اس پر کوئی اجرت نہیں مانگتا اور نہ ہی میں بناوٹ کرنے والوں سے ہوں۔‘‘"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) {اِنْ هُوَ اِلَّا ذِكْرٌ لِّلْعٰلَمِيْنَ :} اس آیت کی تفسیر کے لیے دیکھیے سورۂ یوسف (۱۰۴)۔"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) {وَ لَتَعْلَمُنَّ نَبَاَهٗ بَعْدَ حِيْنٍ :} یعنی قرآن مجید میں جو وعدے یا وعید آئے ہیں، یا اس نے آئندہ کے متعلق جو کچھ بتایا ہے ان کا حق ہونا کچھ وقت کے بعد دنیا میں دیکھ لو گے، جیسا کہ بدر اور دوسرے مواقع پر کفار نے دیکھ لیا، یا پھر موت کے بعد قیامت کے دن ہر حال میں دیکھ لو گے۔"
    }
  ]
}