{
  "surah": "Al-Nisa",
  "surah_number": 4,
  "tafsir": [
    {
      "Ayah": 1,
      "tafsir": "سورۂ نساء مدنی ہے، ام المومنین عائشہ رضی اللہ عنہاسے مروی ہے کہ سورۂ بقرہ اور سورۂ نساء ایسے زمانے میں نازل ہوئیں جب میں (رخصتی کے بعد) رسول اللہ صلی اللہ علیہ وسلم کے گھر آ چکی تھی۔ [ بخاری، فضائل القرآن، باب تألیف القرآن : ۴۹۹۳ ] اس سورت میں عورتوں سے متعلقہ مسائل کی وجہ سے اس کا نام سورۂ نساء ہے۔ ¤ (آیت 1) ➊ {خَلَقَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ:} یعنی پوری نوع انسانی آدم علیہ السلام کی نسل سے ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’(قیامت کے دن) لوگ آدم علیہ السلام کے پاس جائیں گے اور کہیں گے، اے آدم ! آپ انسانوں کے باپ ہیں، آپ کو اللہ تعالیٰ نے اپنے ہاتھوں سے بنایا۔‘‘ [ بخاری، أحادیث الأنبیاء، باب قول اللہ تعالٰی : «و لقد أرسلنا …» : ۳۳۴۰، عن أبی ھریرۃ رضی اللہ عنہ ] ایک جان سے پیدا کرنے سے یہ توجہ دلانا بھی مقصود ہے کہ تم تمام انسان ایک شخص کی اولاد ہو، کوئی اور رشتہ داری نہ ہو تو یہ رشتہ داری کیا کم ہے، اس کا خیال ہی رکھو اور اپنے کمزوروں کی مدد کرتے رہو۔ ¤ ➋ {وَ خَلَقَ مِنْهَا زَوْجَهَا:} رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’عورت کو پسلی سے پیدا کیا گیا ہے اور پسلی میں سب سے ٹیڑھا حصہ اوپر کا ہوتا ہے، سو اگر تم اسے سیدھا کرنا چاہو گے تو توڑ بیٹھو گے اور اگر اس سے فائدہ اٹھانا چاہو تو اس طرح فائدہ اٹھا ؤ گے کہ اس میں برابر ٹیڑھا پن ہو گا۔‘‘ [ بخاری، أحادیث الأنبیاء، باب خلق آدم و ذریتہ : ۳۳۳۱، ۵۱۸۴، عن أبی ھریرۃ رضی اللہ عنہ ] بعض روایات میں ہے : [وَ كَسْرُهَا طَلاَقُهَا ] ’’ اور اس کا توڑنا اسے طلاق دینا ہے۔‘‘ [ مسلم، الرضاع، باب الوصیۃ بالنساء : 715/59 بعد ح : ۱۴۶۶۔ بخاری : ۵۱۸۴ ] قرآن کی آیت سے معلوم ہوا کہ حواء علیھا السلام آدم علیہ السلام سے پیدا ہوئیں۔ حدیث سے ثابت ہوا کہ پسلی سے پیدا ہوئیں، اس کی کیفیت رسول اللہ صلی اللہ علیہ وسلم نے بیان نہیں کی۔ بعض لوگ اس کا مطلب یہ بیان کرتے ہیں کہ عورت میں کچھ ٹیڑھا پن رہتا ہی ہے، اس لیے اسے پسلی سے تشبیہ دی گئی ہے، مگر قرآن کے صریح الفاظ کہ آدم سے اس کی بیوی کو پیدا کیا، ان کے ساتھ حدیث ملائیں تو اس کا پسلی سے پیدا ہونا ثابت ہوتا ہے۔ ہاں، اس کی کجی بھی اپنی جگہ درست ہے۔ ¤ ➌ {تَسَآءَلُوْنَ بِهٖ وَ الْاَرْحَامَ:} یعنی جس اللہ کا نام لے کر تم ایک دوسرے سے سوال کرتے ہو، اس اللہ سے ڈرو۔ { ”وَ الْاَرْحَامَ“ } اس کا عطف لفظ {’’ اللّٰهَ ‘‘} پر ہے، یعنی {’’وَاتَّقُوا الْأَرْحَامَ‘‘} کہ قطع رحمی اور رشتہ داروں کے ساتھ بدسلوکی سے بچو۔ { ”الْاَرْحَامَ“ } کو میم کے کسرہ سے پڑھنا غلط ہے اور قواعد نحویہ کی رو سے بھی ٹھیک نہیں، ہاں معنی کے اعتبار سے صحیح ہے، یعنی جس رشتہ داری کے نام پر ایک دوسرے سے سوال کرتے ہو۔ (قرطبی) شوکانی رحمہ اللہ فرماتے ہیں کہ تمام علمائے شریعت و لغت کا اتفاق ہے کہ {”الْاَرْحَامَ“} سے محرم اور غیر محرم تمام رشتے مراد ہیں۔ قرآن و حدیث میں قطع رحمی کی بہت مذمت آئی ہے۔ دیکھیے سورۂ محمد (۲۲،۲۳) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’رشتے داری کو توڑنے والا جنت میں نہیں جائے گا۔‘‘ [ بخاری، الأدب، باب إثم القاطع : ۵۹۸۴، عن جبیر بن مطعم رضی اللہ عنہ ] اور فرمایا : ’’جو شخص چاہے کہ اس کے رزق میں فراخی ہو اور اس کے نشانِ( قدم) دیر تک رکھے جائیں وہ اپنی رشتے داری کو ملائے۔‘‘ [ بخاری، الأدب، باب فضل صلۃ الرحم… : ۵۹۸۳، عن أبی أیوب الأنصاری رضی اللہ عنہ ] ¤ ➍ {رَقِيْبًا:} رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ کی عبادت کر گویا تو اسے دیکھ رہا ہے، سو اگر تو اسے نہیں دیکھ رہا تو وہ تجھے دیکھ رہا ہے۔‘‘ [ بخاری، الإیمان، باب سؤال جبریل النبی صلی اللہ علیہ وسلم : ۵۰ ۔ مسلم : ۸، عن أبی ہریرۃ و عمر رضی اللہ عنہما ]"
    },
    {
      "Ayah": 2,
      "tafsir": "(آیت 2){وَ اٰتُوا الْيَتٰمٰۤى اَمْوَالَهُمْ … : } یعنی جب یتیم بالغ ہو جائیں تو ان کے اموال ان کے سپرد کر دو اور یہ نہ کرو کہ یتیم کے مال سے اچھی چیز (طیب) لے کر اس کی جگہ ردی چیز (خبیث) رکھ دو۔ طیب اور خبیث حلال اور حرام کے معنی میں بھی آتے ہیں، اس لیے بعض نے یہ معنی کیا ہے کہ اپنا حلال مال چھوڑ کر دوسرے کا مال مت کھاؤ جو تمھارے لیے حرام ہے۔ آیت میں { ”اِلٰى“ } بمعنی {”مَعَ“} ہے، یعنی ان کے اموال کو ناجائز طریقے سے کھانے کے لیے اپنے مالوں کے ساتھ مت ملا ؤ ، ایسا کرنا کبیرہ گناہ ہے۔ ہاں، اصلاح کی نیت سے ملانا جائز ہے۔ دیکھیے سورۂ بقرہ (۲۲۰)۔"
    },
    {
      "Ayah": 3,
      "tafsir": "(آیت 3) ➊ {وَ اِنْ خِفْتُمْ اَلَّا تُقْسِطُوْا … :} اس آیت کی شان نزول یہ ہے کہ عروہ بن زبیر رحمہ اللہ کے ایک سوال کے جواب میں ام المومنین عائشہ رضی اللہ عنہا نے فرمایا : ’’بعض یتیم لڑکیاں کچھ لوگوں کی پرورش میں ہوتیں، وہ ان لڑکیوں کے مال اور جمال کی وجہ سے ان سے نکاح کر لیتے، لیکن انھیں اپنے گھر کی لڑکیاں سمجھ کر پرائے گھر کی لڑکیوں جیسا نہ تو مہر دیتے اور نہ ان کے دوسرے حقوق ویسے ادا کرتے، تو اللہ تعالیٰ نے اس آیت میں انھیں ایسا کرنے سے منع فرمایاکہ اگر تم یتیم لڑکیوں سے ان کے مہر اور نفقات میں انصاف نہیں کر سکتے تو ان کے علاوہ دوسری عورتوں سے، جو تمھیں پسند ہوں، نکاح کر لو۔‘‘ [ بخاری، التفسیر، باب : «و إن خفتم ألا تقسطوا فی الیتمٰی» : ۴۵۷۴ ] ¤ ➋ {مَثْنٰى وَ ثُلٰثَ وَ رُبٰعَ :} اس آیت سے دلیل لیتے ہوئے ابن عباس رضی اللہ عنہما اور جمہور علماء نے لکھا ہے کہ ایک شخص کے لیے بیک وقت چار سے زیادہ بیویاں اپنے حرم میں رکھنا جائز نہیں، یہ صرف رسول اللہ صلی اللہ علیہ وسلم کا خاصہ ہے۔ امام شافعی رحمہ اللہ فرماتے ہیں کہ سنت سے بصراحت یہ مسئلہ ثابت ہے۔ ابن کثیر رحمہ اللہ فرماتے ہیں کہ شافعی رحمہ اللہ نے جو فرمایا اس پر علماء کا اجماع ہے۔ غیلان بن سلمہ ثقفی رضی اللہ عنہ جب مسلمان ہوئے تو ان کے نکاح میں دس عورتیں تھیں، نبی کریم صلی اللہ علیہ وسلم نے فرمایا : ’’ان میں سے چار کا انتخاب کر لو۔‘‘ [ أحمد : 14/2، ح : ۴۶۳۰۔ ابن ماجہ، النکاح، باب الرجل یسلم و عندہ … : ۱۹۵۳، عن ابن عمر رضی اللہ عنہما و قال الألبانی صحیح ] مزید صحابہ کے واقعات ابن کثیر میں ملاحظہ فرمائیں۔ قرطبی رحمہ اللہ لکھتے ہیں : ’’رافضی (شیعہ) اور بعض دوسرے لوگ اس آیت سے استدلال کرتے ہیں کہ شادیاں چار سے زائد بھی جائز ہیں، مگر یہ لغت اور سنت سے جہالت کا نتیجہ ہے۔‘‘ ¤ ➌ {فَاِنْ خِفْتُمْ اَلَّا تَعْدِلُوْا … :} اس سے بعض لوگوں نے ایک سے زیادہ شادیوں کے ناجائز ہونے پر استدلال کیا ہے کہ اگر تمھیں خوف ہو کہ عدل نہیں کرو گے تو ایک بیوی پر اکتفا کرو یا لونڈی پر۔ اس کے ساتھ وہ دوسری آیت بھی ملاتے ہیں کہ اللہ تعالیٰ نے فرمایا : «وَ لَنْ تَسْتَطِيْعُوْۤا۠ اَنْ تَعْدِلُوْا بَيْنَ النِّسَآءِ وَ للَوْ حَرَصْتُمْ» [ النساء : ۱۲۹ ] ’’اور تم ہر گز نہ کر سکو گے کہ عورتوں کے درمیان برابری (عدل) کرو، خواہ تم حرص بھی کرو۔‘‘ خلاصہ دونوں کا یہ نکالا کہ جب عدل ہو ہی نہیں سکتا تو مرد ایک سے زیادہ بیویاں نہیں رکھ سکتا۔ ان حضرات نے وہی کام کیا ہے جو «لَا تَقْرَبُوا الصَّلٰوةَ » والے حضرات کرتے ہیں کہ آگے «وَ اَنْتُمْ سُكٰرٰى» [ النساء : ۴۳ ] پڑھتے ہی نہیں۔ یہاں بھی اللہ تعالیٰ کا پورا فرمان یوں ہے : ’’ اور تم ہرگز نہ کر سکو گے کہ عورتوں کے درمیان برابری کرو، خواہ تم حرص بھی کرو، پس مت جھک جا ؤ (ایک کی طرف) مکمل جھک جانا کہ اس (دوسری) کو لٹکائی ہوئی کی طرح چھوڑ دو، اور اگر تم اصلاح کرو اور ڈرتے رہو تو بے شک اللہ ہمیشہ سے بے حد بخشنے والا، بے حد مہربان ہے۔‘‘ [ النساء : ۱۲۹ ] معلوم ہوا وہ عدل جو انسان کر ہی نہیں سکتا، یعنی دلی میلان، وہ واجب ہی نہیں۔ زیادہ بیویاں ہمارے نبی اور اصحاب کی سنت ہے۔ ¤ ➍ {ذٰلِكَ اَدْنٰۤى اَلَّا تَعُوْلُوْا:} یعنی اگر کسی کو خوف ہے کہ وہ اتنا عدل بھی نہیں کر سکتا جتنا واجب ہے کہ رات رہنے اور نان و نفقہ میں بھی برابری نہیں کر سکتا، کیونکہ دلی محبت اور میلان و صحبت میں تو برابری ممکن ہی نہیں، تو ایک بیوی رکھے یا لونڈیاں، یہ زیادہ قریب ہے کہ تم انصاف سے نہ ہٹو۔ بعض لوگوں نے اس کا ترجمہ کیا ہے : ’’یہ زیادہ قریب ہے کہ تمھارے عیال زیادہ نہ ہو جائیں اور تم فقیر نہ ہو جاؤ ‘‘ اور پھر اس پر برتھ کنٹرول کی بنیاد رکھ دی ہے کہ بچے کم پیدا کرو۔ حالانکہ بچے تو لونڈیوں سے بھی پیدا ہوتے ہیں اور لونڈیوں کی تعداد بھی مقرر نہیں اور رسول اللہ صلی اللہ علیہ وسلم نے زیادہ بچے پیدا کرنے کا حکم دیا، چنانچہ فرمایا : ’’ان عورتوں سے نکاح کرو جو بہت بچے جننے والی اور بہت محبت کرنے والی ہوں، کیونکہ میں ( قیامت کے دن) تمھاری کثرت پر فخر کروں گا۔‘‘ [ أبو داوٗد، النکاح، باب النھی عن تزویج من لم یلد من النساء : ۲۰۵۰، عن معقل بن یسار رضی اللہ عنہ، قال الألبانی حسن صحیح] ¤ پھر {”اَلَّا تَعُوْلُوْا“} کا معنی خود رسول اللہ صلی اللہ علیہ وسلم نے بیان فرمایا : ’’یہ زیادہ قریب ہے کہ تم ظلم نہ کرو، انصاف سے نہ ہٹو۔‘‘ [ ابن حبان : ۴۰۲۹، عن عائشۃ رضی اللہ عنہا، و صححہ الألبانی الصحیحۃ : ۳۲۲۲ ]"
    },
    {
      "Ayah": 4,
      "tafsir": "(آیت 4) جاہلیت میں عورتوں کا مہر لوگ خود لے لیتے اور انھیں کچھ بھی نہیں دیتے تھے، اللہ تعالیٰ نے اس سے منع فرمایا اور حکم دیا کہ عورتوں کو ان کا مہر خوش دلی سے دو، پھر اگر کوئی عورت خوش دلی سے مہر کاکچھ حصہ یا سارا شوہر کو دے دے تو وہ خاوند کے لیے جائز ہے اور خوش دلی سے کھا سکتا ہے، لیکن اگر عورت شوہر کی بد اخلاقی یا برے برتا ؤ کی وجہ سے معاف کرے اور شوہر قبول کرے تو یہ اس آیت کے خلاف ہے۔ اسی طرح اگر دھوکا دے کر مہر معاف کروالے، پھر طلاق دے دے تو وہ بھی جائز نہیں ہو گا، بلکہ مہر دینا پڑے گا، کیونکہ وہ خوش دلی کے خلاف ہے۔"
    },
    {
      "Ayah": 5,
      "tafsir": "(آیت 5)یہاں بے سمجھوں سے مراد وہ لوگ ہیں جو مال کے انتظام کی صلاحیت نہ رکھتے ہوں۔ اس میں چھوٹے بچے اور ناتجربہ کار بیوی بھی آجاتی ہے اور نادان یتیم بھی، یعنی اگر یتیم ناتجربہ کار اور کم عقل ہوں تو وصی یا متولی کو چاہیے کہ یتیم کے مال سے اس کے کھانے پینے اور لباس کا انتظام کرتا رہے، مگر وہ مال اس کے سپرد نہ کرے۔ ابوموسیٰ رضی اللہ عنہ نبی صلی اللہ علیہ وسلم سے بیان کرتے ہیں کہ تین آدمی اللہ تعالیٰ سے دعا کرتے ہیں مگر ان کی دعا قبول نہیں ہوتی، ایک وہ آدمی جس کی بیوی بدخلق تھی پھر اس نے اسے طلاق نہیں دی اور ایک وہ آدمی جس کا کسی شخص کے ذمے مال تھا مگر اس نے اس پر کوئی گواہ نہیں بنایا اور ایک وہ آدمی جس نے کسی سفیہ (بے وقوف) کو اپنا مال دے دیا جب کہ اللہ تعالیٰ نے فرمایا ہے تم بے وقوفوں کو اپنے مال مت دو۔‘‘ [ صحیح الجامع : ۳۰۷۵ ] اس آیت سے علماء نے سفیہ (کم عقل) پر {’’حجر‘‘ } (پابندی) کا حکم اخذ کیا ہے کہ حاکم وقت اس کے لین دین پر پابندی لگا سکتا ہے۔ (قرطبی)"
    },
    {
      "Ayah": 6,
      "tafsir": "(آیت 6) ➊ {وَ ابْتَلُوا الْيَتٰمٰى … :} بلوغت کے لیے مرد کی علامت احتلام اور عورت کی حیض ہے، علی رضی اللہ عنہ نے فرمایا : ’’میں نے (بلوغت کے سلسلے میں) رسول اللہ صلی اللہ علیہ وسلم سے سن کر یہ یاد رکھا ہے کہ احتلام کے بعد یتیمی نہیں اور دن سے لے کر رات تک خاموشی نہیں۔‘‘ [ أبو داوٗد، الوصایا، باب ما جاء متی ینقطع الیتم : ۲۸۷۳، و قال الألبانی صحیح ] ¤ عطیہ قرظی رضی اللہ عنہ بیان کرتے ہیں : ’’قریظہ کے دن ہمیں نبی صلی اللہ علیہ وسلم کی خدمت میں پیش کیا گیا تو جس کے (زیر ناف) بال اگے تھے اسے قتل کر دیا گیا اور جس کے بال نہیں اگے تھے اسے قتل نہیں کیا گیا، میں ان میں سے تھا جن کے بال ابھی نہیں اگے تھے، لہٰذا مجھے چھوڑ دیا گیا۔‘‘ [ أبو داوٗد، الحدود، باب فی الغلام یصیب الحد : ۴۴۰۴، و قال الألبانی صحیح ] ¤ جنگ میں شرکت کے لیے رسول اللہ صلی اللہ علیہ وسلم نے ابن عمر رضی اللہ عنہما کو چودہ سال کی عمر میں احد میں شرکت کی اجازت نہیں دی۔ خندق میں جائزہ لیا گیا تو پندرہ سال کے تھے، آپ نے اجازت دے دی۔ نافع نے عمر بن عبد العزیز رحمہ اللہ کو یہ حدیث پہنچائی تو انھوں نے کہا : ’’بچے اور بڑے کا یہی فرق ہے۔‘‘ [ بخاری، الشہادات، باب بلوغ الصبیان… : ۲۶۶۴ ] مگر ظاہر ہے کہ یہ فرق بچے اور اس بڑے کا ہے جسے جنگ میں شرکت کی اجازت ہے۔ محض بلوغت کی علامت احتلام ہے، اگر اس کا علم نہ ہو سکے تو زیر ناف بال اگنا ہے۔ ¤ ➋ {فَاِنْ اٰنَسْتُمْ مِّنْهُمْ رُشْدًا:} یعنی یتیموں کا امتحان اور ان کی تربیت کرتے رہو، جس کی ایک صورت یہ بھی ہے کہ پہلے تھوڑا سا مال دے کر ان کو کسی کام پر لگا کر دیکھو کہ آیا وہ مال کو بڑھاتے ہیں یا نہیں، پھر جب وہ بالغ ہو جائیں اور ان میں رشد ہو تو بلا توقف مال ان کے حوالے کر دو۔ {’’ رُشْدًا ‘‘ } سے مراد عقلی اور دینی صلاحیت ہے، پس بالغ ہونے کے علاوہ مال کی سپرد داری کے لیے رشد بھی شرط ہے، اگر کسی شخص میں رشد نہیں ہے تو خواہ وہ بوڑھا ہی کیوں نہ ہو جائے متولی یا وصی کو چاہیے کہ وہ مال اس کے حوالے نہ کرے۔ ( قرطبی، ابن کثیر ) ¤ ➌ { ”فَلْيَسْتَعْفِفْ“ ”عَفَّ يَعِفُّ (ض)“ } کا معنی بچنا ہے، { ”فَلْيَسْتَعْفِفْ“ } کا باب استفعال میں حروف کی زیادتی کی وجہ سے ترجمہ ’’بہت بچے‘‘ کیا گیا ہے۔ ¤ ➍ {وَ مَنْ كَانَ فَقِيْرًا … :} جانا پہچانا طریقہ یہی ہے کہ اس کے اموال کی نگرانی کی اجرت جو معروف ہے، لے لے۔ دوسرا یہ کہ زیادہ سے زیادہ اتنا لے لے جس سے اس کی ضرورت پوری ہو سکے۔ ¤ ➎ {فَاَشْهِدُوْا عَلَيْهِمْ:} یتیم کے متولی یا وصی کو حکم ہے کہ گواہوں کے رو بررو مال واپس کرے، تاکہ کل کو اس پر کوئی الزام نہ آئے۔ {”وَ كَفٰى بِاللّٰهِ حَسِيْبًا“} کا مطلب یہ ہے کہ تم لوگوں کو تو مطمئن کر لو گے، مگر اصل حساب تو اللہ تعالیٰ نے لینا ہے، اس کا خاص خیال رکھو۔"
    },
    {
      "Ayah": 7,
      "tafsir": "(آیت 7) {لِلرِّجَالِ نَصِيْبٌ …:} اس آیت میں ایک اصولی حکم دیا ہے کہ ماں باپ اور رشتے داروں کی چھوڑی ہوئی جائداد میں، چاہے وہ کسی نوعیت کی ہو، جس طرح مردوں کا حق ہے اسی طرح عورتوں اور چھوٹے بچوں، حتیٰ کہ جنین کا بھی حق ہے۔ اس سے عرب کے جاہلی دستور کی تردید مقصود ہے۔ جس کے مطابق عورتوں اور بچوں کو میت کے متروکہ مال اور جائداد سے محروم کر دیا جاتا اور صرف بالغ لڑکے ہی جائدادپر قبضہ کر لیتے تھے۔ اس آیت کی شان نزول اور مردوں اور عورتوں کے حصوں کی تعیین بعد کی آیات میں آرہی ہے۔ (ابن کثیر)"
    },
    {
      "Ayah": 8,
      "tafsir": "(آیت 8)یعنی وارثوں کو چاہیے کہ متروکہ مال میں سے کچھ حصہ بطور صدقہ و خیرات ان رشتے داروں، یتیموں اور مسکینوں کو بھی دیں جو خاندان میں موجود ہوں اور تقسیم کے وقت موقع پر پہنچ جائیں اور اگر وہ لوگ زیادہ حرص کریں تو ’’ان سے اچھی بات کہو‘‘ یعنی معذرت کرو کہ یہ وارثوں کا مال ہے، تمھارا حق نہیں ہے۔ بعض اہل علم کہتے ہیں کہ یہ حکم ’’ فرائض‘‘ یعنی وارثوں کے حصے مقرر ہونے سے پہلے تھا۔ اب اللہ تعالیٰ نے ہر صاحب حق کو اس کا حق دے دیا ہے، اس لیے اب یہ بخشش نہیں ہے، اب صدقہ و خیرات میت کی وصیت ہی سے ہو سکتا ہے، لیکن بخاری میں ابن عباس رضی اللہ عنہما سے مروی ہے کہ یہ آیت محکم ہے، منسوخ نہیں اور وارثوں کو حکم ہے کہ تقسیم ترکہ کے وقت ان رشتہ داروں سے صلہ رحمی کریں۔ جن کا میراث میں حصہ نہیں جب وہ تقسیم کے وقت آ جائیں۔ [ بخاری، التفسیر، باب قول اللہ عزو جل : «و إذا حضر القسمۃ …» : ۲۷۵۹ ]"
    },
    {
      "Ayah": 9,
      "tafsir": "(آيت 9) {وَ لْيَخْشَ الَّذِيْنَ لَوْ تَرَكُوْا … :} یہ حکم میت کی وصیت سن کر نافذ کرنے والوں کو ہے اور ان لوگوں کو بھی جو یتیموں کے سر پرست اور وصی مقرر ہوں۔ ان سب کو ہدایت کی جا رہی ہے کہ وہ اللہ تعالیٰ سے ڈرتے ہوئے میت کی اولاد اور یتیموں کے مفاد کا اسی طرح خیال رکھیں جس طرح وہ چاہتے ہیں کہ ان کے مرنے کے بعد ان کی چھوٹی اور بے بس اولاد کے مفاد کا خیال رکھا جائے، لہٰذا انھیں یتیموں سے بہتر سلوک کرنا چاہیے اور ان کی عمدہ سے عمدہ تعلیم و تربیت کرنی چاہیے۔ یتیموں کے اولیاء سے اس آیت کا تعلق زیادہ مناسب معلوم ہوتا ہے، کیونکہ بعد میں یتامیٰ کی حق تلفی کرنے والوں کے متعلق جو وعید آ رہی ہے اولیاء کی اس کے ساتھ زیادہ مناسبت پائی جاتی ہے۔ ویسے عام مسلمانوں کو بھی یتیموں کے ساتھ خاص احسان اور سلوک کرنے کا حکم ہے۔"
    },
    {
      "Ayah": 10,
      "tafsir": "(آیت 10)اس آیت میں یتیموں کے مال کی حفاظت اور اس سے اجتناب کی مزید تاکید کی گئی ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ سات تباہ کن چیزوں سے اجتناب کرو۔‘‘ صحابہ نے عرض کیا : ’’یا رسول اللہ! وہ کیا ہیں ؟‘‘ فرمایا : ’’ اللہ کے ساتھ شرک کرنا، جادو، اس جان کو ناحق قتل کرنا جسے اللہ نے حرام قرار دیا ہے، سود کھانا، یتیم کا مال کھانا، جنگ کے دن پیٹھ پھیرنا اور پاک دامن، بھولی بھالی عورتوں پر تہمت لگانا۔‘‘ [ بخاری، الحدود، باب رمی المحصنات : ۶۸۵۷، عن أبی ھریرۃ رضی اللہ عنہ ]"
    },
    {
      "Ayah": 11,
      "tafsir": "(آیت 11) ➊ {يُوْصِيْكُمُ اللّٰهُ فِيْۤ اَوْلَادِكُمْ:} اب یہاں سے وارثوں کے تفصیلی حصوں کا بیان شروع ہو رہا ہے۔ حافظ ابن کثیر رحمہ اللہ لکھتے ہیں کہ یہ دونوں آیات اور اس سورت کی آخری آیت علم وراثت میں اصول کی حیثیت رکھتی ہیں۔ وراثت کے تفصیلی حصے ان تین آیات سے مستنبط ہیں اور وراثت کے حصوں سے متعلقہ احادیث بھی ان آیات ہی کی تفسیر ہیں۔ (ابن کثیر) ایک حدیث میں ہے کہ جب جابر بن عبد اللہ رضی اللہ عنہما بیمار ہوئے تو رسول اللہ صلی اللہ علیہ وسلم اور ابو بکر رضی اللہ عنہ ان کی عیادت کے لیے تشریف لے گئے۔ جابر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم سے اپنے مال کے بارے میں دریافت کیا، اس پر یہ آیت نازل ہوئی : «يُوْصِيْكُمُ اللّٰهُ فِيْۤ اَوْلَادِكُمْ» [ بخاری، التفسیر، باب : «یوصیکم اللہ فی أولادکم» : ۴۵۷۷ ] ایک حدیث میں ہے کہ سعد بن ربیع رضی اللہ عنہ وفات پا گئے اور ان کی بیٹیوں کے چچا نے سارا ورثہ سنبھال لیا۔ سعد رضی اللہ عنہ کی دو لڑکیاں تھیں۔ ان کی بیوی نے آپ صلی اللہ علیہ وسلم سے ورثے کا سوال کیا تو یہ آیت نازل ہوئی۔ آپ صلی اللہ علیہ وسلم نے لڑکیوں کے چچا کو پیغام بھیجا کہ سعد کی دو بیٹیوں کو دو تہائی اور ان کی ماں کو آٹھواں حصہ دے دو اور جو بچ جائے وہ تمھارے لیے ہے۔ [ أبو داوٗد، الفرائض، باب ما جاء فی میراث الصلب : ۲۸۹۱۔ عن جابر بن عبد اللہ رضی اللہ عنہما۔ ترمذی : ۲۰۹۲۔ أحمد : 352/3، ح : ۱۴۸۱۰، و قال الألبانی حسن ] ¤ ➋ {لِلذَّكَرِ مِثْلُ حَظِّ الْاُنْثَيَيْنِ :} مطلب یہ ہے کہ جب اولاد میں لڑکے اور لڑکیاں دونوں موجود ہوں تو لڑکے کو لڑکی سے دگنا ملے گا۔ اسے دو حصے دینے کی وجہ یہ ہے کہ مرد پر عورت کی نسبت معاشی ذمہ داریاں بہت زیادہ ہوتی ہیں۔ (مہر ہی کو لے لیجیے کہ مرد دیتا ہے، عورت لیتی ہے، اسی طرح عورت کا نان و نفقہ بھی خاوند کے ذمے ہوتا ہے) اس بنا پر مرد کے لیے عورت سے دگنا حصہ دینا عین قرین انصاف ہے۔ (قرطبی، ابن کثیر) ¤ ➌ {فَاِنْ كُنَّ نِسَآءً فَوْقَ اثْنَتَيْنِ …:} دو سے زیادہ ہی کا نہیں دو عورتوں کا بھی یہی حکم ہے، جیسا کہ اس آیت کے پہلے فائدے میں سعد بن ربیع رضی اللہ عنہ کی دو بیٹیوں کو دو تہائی دینے کا ذکر ہوا ہے، پھر اس سورت کی آخری آیت میں جب دو بہنوں کو دو تہائی حصہ دیا گیا ہے تو دو بیٹیوں کو بدرجۂ اولیٰ دیا جانا چاہیے۔ کیونکہ بیٹی بہن کے مقابلہ میں آدمی کے زیادہ قریب ہے، لہٰذا ہم کہہ سکتے ہیں کہ دو لڑکیوں کا دو تہائی حصہ قرآن و حدیث دونوں سے ثابت ہے۔ (ابن کثیر) ¤ ➍ اس حکم سے چند صورتیں مستثنیٰ ہیں :(1) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا نُوْرَثَ مَا تَرَكْنَا صَدَقَةٌ ] [ بخاری، فرض الخمس، باب فرض الخمس : ۳۰۹۳ ] ’’ہمارا کوئی وارث نہیں ہوتا، ہم جو چھوڑ جائیں وہ صدقہ ہے۔‘‘ لہٰذا آپ صلی اللہ علیہ وسلم کی میراث تقسیم نہیں ہوئی۔ دیکھیے سورۂ مریم آیت (۶) کی تفسیر۔ (2) جان بوجھ کر قتل کرنے والا اپنے مقتول کا وارث نہیں ہو گا۔ یہ حکم سنت سے ثابت ہے اور اس پر اجماع ہے۔ [ ابن ماجہ، الفرائض، باب میراث القاتل : ۲۷۳۵، و قال الألبانی صحیح ] (3) اسامہ بن زید رضی اللہ عنہما راوی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’کافر مسلمان کا وارث نہیں ہوتا اور نہ مسلمان کافر کا وارث ہوتا ہے۔‘‘ [بخاری، الفرائض، باب لا یرث المسلم الکافر… : ۶۷۶۴] لہٰذا کافر مسلمان کی وراثت سے محروم ہو گا بیٹا ہو یا بیٹی، باپ ہو یا ماں، بھائی ہو یا بہن، خاوند ہو یا بیوی، یا کوئی اور رشتہ دار، اسی طرح مسلمان کافر کی وراثت سے محروم ہو گا، اسی طرح وہ وارث جو غلام لونڈی ہو وہ آزاد کا وارث نہیں ہو گا اور آزاد غلام کا وارث نہیں ہو گا۔(4) اسی طرح وہ وارث جو غلام لونڈی ہو وہ آزاد کا وارث نہیں ہو گا اور آزاد غلام کا وارث نہیں ہو گا۔¤ ➎ {وَ اِنْ كَانَتْ وَاحِدَةً فَلَهَا النِّصْفُ :} اس سے بھی معلوم ہوا کہ جب ایک بیٹی کا نصف ہے تو دو یا دو سے زیادہ بیٹیوں کا دو تہائی ہونا چاہیے۔ ¤ ➏ {وَ لِاَبَوَيْهِ لِكُلِّ وَاحِدٍ … :} یعنی میت کی اولاد ہونے کی صورت میں ماں باپ دونوں میں سے ہر ایک کو کل ترکے کا چھٹا حصہ ملے گا، مثلا میت کی ایک بیٹی اور ماں باپ ہیں تو ترکہ کے چھ مساوی حصے کر لیے جائیں۔ بیٹی کو تین حصے (نصف) ماں کو ایک حصہ (سدس) باپ کو ایک حصہ (سدس) مقررشدہ اور ایک حصہ (سدس) عصبہ ہونے کی وجہ سے ملے گا اور اگر میت کی دو یا زیادہ بیٹیاں ہیں تو ترکہ کے چھ حصوں میں سے چار حصے (دو ثلث) بیٹیوں کے اور ایک ایک حصہ (سدس) ماں باپ کا ہو گا اور اگر ماں باپ کے ساتھ لڑکے لڑکیاں دونوں ہیں تو ماں باپ میں سے ہر ایک کو چھٹا حصہ دینے کے بعد جو باقی بچے اس میں سے لڑکے کے دو حصے اور لڑکی کا ایک حصہ ہو گا۔ ¤ ➐ {فَاِنْ لَّمْ يَكُنْ لَّهٗ وَلَدٌ … :} یہ ماں باپ کی دوسری حالت ہے، یعنی اگر میت کی کوئی اولاد نہ ہو اور اس کے ماں باپ زندہ ہوں تو ماں کو ایک تہائی ملے گا اور بقیہ دو تہائی حصہ باپ کو مل جائے گا اور اگر ماں باپ کے ساتھ میت کے مرد ہونے کی صورت میں بیوی اور عورت ہونے کی صورت میں اس کا شوہر بھی زندہ ہو تو شوہر یا بیوی کا حصہ، جس کا ذکر آگے آ رہا ہے، پہلے نکالنے کے بعد باقی ماندہ سے ماں کو ایک تہائی اور باپ کو دو تہائی ملے گا۔ والدین کی مذکورہ دونوں صورتیں قرآن مجید ہی سے واضح ہو رہی ہیں، کیونکہ پہلی صورت میں ساتھ یہ ہے {”وَرِثَهٗۤ اَبَوٰهُ“} یعنی اس کے وارث صرف ماں باپ ہوں، بیوی یا خاوند موجود ہونے کی صورت دوسری ہے۔ اس میں والدہ کو باقی کا ثلث اس لیے دیا جائے گا کہ عورت (ماں) کا حصہ، مرد (باپ) کے نصف سے زیادہ نہ ہو جائے۔ ابن کثیر رحمہ اللہ لکھتے ہیں کہ یہی قول فقہائے سبعہ، ائمہ اربعہ اور جمہور اہل علم کا ہے۔ ¤ ➑ {فَاِنْ كَانَ لَهٗۤ اِخْوَةٌ … :} یہ ماں باپ کی تیسری حالت کا بیان ہے، یعنی اگر میت کی کوئی اولاد نہ ہو، ماں باپ کے علاوہ بھائی بھی ہوں ( خواہ ماں باپ دونوں سے یا صرف ماں سے یا صرف باپ سے) تو باپ کی موجودگی میں انھیں حصہ تو نہیں ملے گا، البتہ وہ ماں کا حصہ تہائی سے چھٹا کر دیں گے اور اگر ماں کے ساتھ سوائے باپ کے کوئی دوسرا وارث نہ ہو تو بقیہ سارا ۶؍۵ حصہ باپ کو مل جائے گا۔ یاد رہے کہ {’’ اِخْوَةٌ ‘‘} کا لفظ جمع ہے اور یہ جمہور علماء کے نزدیک دو کو بھی شامل ہے، لہٰذا اگر صرف ایک بھائی ہو تو وہ ماں کا تہائی سے چھٹا حصہ نہیں کر سکتا۔( ابن کثیر) ¤ ➒ {مِنْۢ بَعْدِ وَصِيَّةٍ … :} میت کے مال میں سے اول کفن دفن پر صرف کیا جائے، پھر باقی ماندہ سے حسب مراتب قرض ادا کیا جائے، سب سے زیادہ ادا کیے جانے کا حق دار اللہ تعالیٰ کا قرض ہے، مثلاً اگر زکاۃ یا حج اس کے ذمے ہے تو وہ ادا کیا جائے، پھر دوسرے قرض اد اکیے جائیں، پھر مال کے تہائی حصے سے وصیت پوری کی جائے، اس کے بعد وارثوں کے درمیان باقی ترکے کے حصے کیے جائیں۔ (قرطبی) قرآن میں گو قرض کا ذکر وصیت کے بعد ہے، مگر سلف و خلف کا اس پر اجماع ہے کہ ادائے قرض وصیت پر مقدم ہے، لہٰذا پہلے قرض ادا کیا جائے، پھر وصیت کا نفاذ ہونا چاہیے۔ غور سے دیکھیں تو آیت کے معنی و مفہوم سے بھی یہی معلوم ہوتا ہے۔ آیت میں وصیت کو قرض سے پہلے ذکر کرنے کی اہل علم نے کئی حکمتیں بیان فرمائی ہیں جن میں سے ایک یہ ہے کہ عام طور پر وصیت پر عمل میں کوتاہی کی جاتی ہے، اس لیے اللہ تعالیٰ نے تاکید کے لیے اسے پہلے ذکر فرمایا۔ ¤ ➓ {اِنَّ اللّٰهَ كَانَ عَلِيْمًا حَكِيْمًا:} یعنی اللہ تعالیٰ ہمیشہ سے علیم و حکیم ہے، اس نے خود میراث کا یہ قانون اس لیے مقرر فرمایا کہ تم اپنے نفع و نقصان کو نہیں سمجھتے، اگر تم اپنے اجتہاد سے ورثہ تقسیم کرتے توحصوں کا ضبط میں لانا مشکل تھا۔ (قرطبی، ابن کثیر) شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ یعنی ان حصوں میں عقل کا دخل نہیں، اللہ تعالیٰ نے مقرر فرمائے ہیں، وہ سب سے دانا ہے۔‘‘ (موضح)"
    },
    {
      "Ayah": 12,
      "tafsir": "(آیت 12) ➊ {وَ لَكُمْ نِصْفُ مَا تَرَكَ اَزْوَاجُكُمْ … :} اللہ تعالیٰ نے شوہروں کو خطاب کر کے فرمایا کہ اگر تمھاری بیویاں مال چھوڑ کر مریں اور ان کی کوئی اولاد نہ ہو تو تمھیں آدھا مال ملے گا اور اگر ان کی اولاد ہے، ایک یا زائد بیٹے بیٹیاں یا پوتے یا پڑپوتے، خواہ تم سے یا کسی اور خاوند سے تو تمھیں چوتھا حصہ ملے گا اور اگر تمھاری اولاد نہ ہو تو تمھاری بیویوں کو چوتھا حصہ ملے گا اور تمھارے فوت ہونے کی صورت میں اگر تمھاری وارث بننے والی اولاد یا اولا کی فرع ہے، پھر وہ خواہ ان بیویوں سے ہے یا کسی اور سے، بہرحال بیویوں کو آٹھواں حصہ ملے گا، قرض اور وصیت کی ادائیگی کے بعد، پھر بیوی ایک ہو یا زیادہ سب چوتھائی یا آٹھویں حصے میں شریک ہوں گی، اس پر اجماع ہے۔ ¤ ➋ {يُوْرَثُ كَلٰلَةً:} اگر کوئی مرد یا عورت مر جائے، اس کا نہ والد ہو اور نہ وارث بننے والی اولاد ہو تو اسے ’’کلالہ‘‘ کہتے ہیں۔ بعض ایسی میت کے وارثوں کو ’’کلالہ‘‘ کہتے ہیں۔ بہرحال دونوں پر یہ لفظ بولا جاتا ہے۔ ¤ ➌ {وَ لَهٗۤ اَخٌ اَوْ اُخْتٌ:} بھائی بہن تین طرح کے ہوتے ہیں : (1) عینی یعنی جن کے ماں باپ ایک ہوں۔ (2) علاتی، یعنی جن کا باپ ایک ہو، مائیں مختلف ہوں۔ (3) اخیافی، جن کی ماں ایک ہو اور باپ مختلف ہوں۔ یہاں بالاتفاق اخیافی بھائی بہن مراد ہیں، جیسا کہ ایک قراء ت میں بھی ہے۔ ¤ ➍ اخیافی بھائی چار احکام میں دوسرے وارثوں سے مختلف ہیں : (1) یہ صرف ماں کی جہت سے ورثہ لیتے ہیں۔ (2) ان میں سے مرد اور عورت کو مساوی حصہ دیا جاتا ہے۔ (3) ان کو صرف میت کے کلالہ ہونے کی صورت میں حصہ ملتا ہے۔ (4) خواہ کتنے ہی ہوں ان کا حصہ ثلث سے زیادہ نہیں ہوتا، مثلاً ایک میت کا شوہر، ماں ، دو اخیافی اور دو عینی بھائی موجود ہوں تو جمہور اہل علم کے نزدیک شوہر کو نصف (۲؍۱) ملے گا، ماں کو سدس(۶؍۱) ملے گا اور بقیہ تہائی حصے میں اخیافی بھائیوں کے ساتھ عینی بھائی بھی شریک ہوں گے۔ عمر رضی اللہ عنہ نے ایک مقدمہ میں یہی فیصلہ صادر فرمایا تھا۔ صحابہ میں سے عثمان، ابن مسعود، ابن عباس اور زید بن ثابت رضی اللہ عنہم اور ائمہ میں سے امام مالک اور امام شافعی رحمھما اللہ کا یہی مسلک ہے، البتہ علی رضی اللہ عنہ اخیافی بھائیوں کے اصحاب الفروض ہونے کی وجہ سے دوسرے سگے بھائیوں کو عصبہ ہونے کی وجہ سے محروم قرار دیتے ہیں۔ امام شوکانی رحمہ اللہ نے اس دوسرے مسلک کو ترجیح دی ہے۔ (ابن کثیر، فتح القدیر) ¤ ➎ {فَهُمْ شُرَكَآءُ فِي الثُّلُثِ:} اخیافی بھائی بہن ایک سے زیادہ ہوں تو مرد ہو یا عورتیں، یا مرد اور عورتیں ملے ہوئے ہوں، سب میں تیسرا حصہ برابر تقسیم کر دیا جائے گا، یعنی یہاں مرد کو عورت پر فضیلت نہیں ہو گی، جیسا کہ آیت میں «شُرَكَآءُ فِي الثُّلُثِ» سے معلوم ہوتا ہے۔ عمر رضی اللہ عنہ نے اسی کے مطابق فیصلہ فرمایا اور ظاہر ہے کہ ایسا فیصلہ محض اجتہاد سے نہیں کیا جا سکتا۔ (ابن کثیر) ¤ ➏ {غَيْرَ مُضَآرٍّ:} یہ حال ہونے کی بنا پر منصوب ہے اور اس کا تعلق وصیت اور قرض دونوں سے ہے۔ وصیت میں نقصان پہنچانا ایک تو یہ ہے کہ تہائی مال سے زیادہ وصیت کرے، اس صورت میں تہائی سے زائد وصیت کا نفاذ نہیں ہوگا۔ مگر یہ کہ ورثاء اجازت دے دیں۔ دوسری صورت یہ ہے کہ کسی وارث کو مزید رعایت سے زائد مال دلوایا جائے، اس کا بھی اعتبار نہیں ہو گا، الا یہ کہ تمام وارث برضا و رغبت اسے قبول کر لیں۔ قرض میں نقصان پہنچانا یہ ہے کہ محض وارثوں کا حق تلف کرنے کے لیے مرنے والا اپنے ذمے کسی ایسے قرض کا اقرار کرے جو حقیقت میں اس کے ذمے نہ ہو۔ ابن عباس رضی اللہ عنہما فرماتے ہیں : ’’وصیت میں نقصان پہنچانا کبیرہ گناہ ہے۔‘‘ [ السنن الکبرٰی للنسائی : 60/10، ح : ۱۱۰۲۶، و سندہ صحیح ]"
    },
    {
      "Ayah": 13,
      "tafsir": "(آیت 14،13) {تِلْكَ حُدُوْدُ اللّٰهِ … :} اللہ تعالیٰ نے وراثت کو حدود اللہ قرار دیا اور اس حکم کی اطاعت پر جنت اور فوز عظیم کا وعدہ فرمایا ہے اور نافرمانی اور حدود اللہ کی پامالی کی صورت میں ہمیشہ کی آگ اور عذاب مہین کی سزا سنائی ہے۔ افسوس کہ بڑے بڑے بظاہر متقی لوگ بھی بہنوں کو ان کا حصہ نہیں دیتے، اکثر لوگ کوشش کرتے ہیں کہ جائداد بیٹوں کو دے دیں اور بیٹیوں کو محروم کر دیں۔ اسی طرح اگر کوئی وارث کمزور ہو تو اسے بھی وراثت سے حصہ نہیں دیتے، ان سب کو اللہ تعالیٰ کے سامنے پیش ہونے اور اس کے رسوا کن عذاب اور ہمیشہ کی آگ سے ڈرنا چاہیے۔"
    },
    {
      "Ayah": 14,
      "tafsir": "(آیت 14،13) {تِلْكَ حُدُوْدُ اللّٰهِ … :} اللہ تعالیٰ نے وراثت کو حدود اللہ قرار دیا اور اس حکم کی اطاعت پر جنت اور فوز عظیم کا وعدہ فرمایا ہے اور نافرمانی اور حدود اللہ کی پامالی کی صورت میں ہمیشہ کی آگ اور عذاب مہین کی سزا سنائی ہے۔ افسوس کہ بڑے بڑے بظاہر متقی لوگ بھی بہنوں کو ان کا حصہ نہیں دیتے، اکثر لوگ کوشش کرتے ہیں کہ جائداد بیٹوں کو دے دیں اور بیٹیوں کو محروم کر دیں۔ اسی طرح اگر کوئی وارث کمزور ہو تو اسے بھی وراثت سے حصہ نہیں دیتے، ان سب کو اللہ تعالیٰ کے سامنے پیش ہونے اور اس کے رسوا کن عذاب اور ہمیشہ کی آگ سے ڈرنا چاہیے۔"
    },
    {
      "Ayah": 15,
      "tafsir": "(آیت 16،15) ➊ { وَ الّٰتِيْ يَاْتِيْنَ الْفَاحِشَةَ … :} اوپر کی آیات میں عورتوں کے ساتھ احسان اور ان کے مہر ادا کرنے اور مردوں کے ساتھ ان کو وراثت میں شریک قرار دے کر ان کے حقوق کی حفاظت کا بیان تھا، اب یہاں سے عورتوں کی تادیب اور ان پر سختی کا بیان ہے، تاکہ عورت اپنے آپ کو بالکل ہی آزاد نہ سمجھے۔ (قرطبی) پہلی آیت میں زنا کار عورتوں کی سزا بیان کی کہ زنا شہادت سے ثابت ہو جائے تو انھیں تاعمر گھر میں محبوس رکھا جائے، یہاں تک کہ وہ مرجائیں، یا اللہ تعالیٰ ان کے بارے میں کوئی دوسری سزا نازل فرما دے۔ اسلام میں زنا کار عورتوں کے لیے یہ پہلی سزا ہے جو بعد میں حد زنا نازل ہونے سے منسوخ ہو گئی۔ سورۂ نور میں جو سو کوڑوں کی سزا نازل ہوئی ہے، یہاں {”سَبِيْلًا“} سے اسی طرف اشارہ ہے۔ دوسری آیت میں زانی مرد اورزنا کار عورت کے متعلق یہ حکم دیا گیا کہ ان کو اذیت دی جائے اور ذلیل کیا جائے، حتیٰ کہ تائب ہو جائیں، یہ سزا پہلی سزا کے ساتھ ہی ہے، بعد میں یہ دونوں سزائیں منسوخ ہو گئیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھ سے (احکام دین) لو، اللہ تعالیٰ نے ان عورتوں کے لیے سبیل پیدا فرما دی ہے کہ کنوارا کنواری کے ساتھ (زنا کرے) تو اس کے لیے سو کوڑے اور ایک سال کی جلا وطنی اور شادی شدہ شادی شدہ کے ساتھ (زنا کرے) تو ان کے لیے سو کوڑے اور سنگسار ہے۔‘‘ [ مسلم، الحدود، باب حد الزنی : ۱۶۹۰، عن عبادۃ بن الصامت رضی اللہ عنہ ] مزید دیکھیے سورۂ نور (۲)۔ (ابن کثیر، قرطبی) ¤ ➋ {اَرْبَعَةً مِّنْكُمْ:} چونکہ زنا کی سزا نہایت سخت ہے، اس لیے اس پر گواہی بھی زیادہ مضبوط رکھی۔ عربی زبان کا قااعدہ ہے کہ جو چیز شمار کی جا رہی ہے، وہ مذکر ہو تو عدد مؤنث ہوتا ہے، اس لیے { ”اَرْبَعَةً“ } کی وجہ سے ترجمہ ’’چار مرد‘‘ کیا ہے۔ ¤ ➌ {وَ الَّذٰنِ يَاْتِيٰنِهَا …:} بعض علماء نے اس سے مراد قوم لوط کا عمل کرنے والے دو مرد لیے ہیں، اگرچہ { ”وَ الَّذٰنِ“ } کے لفظ میں، جو تثنیہ مذکر کے لیے آتا ہے، اس کی گنجائش ہے، مگر یہ مطلب نہ رسول اللہ صلی اللہ علیہ وسلم سے منقول ہے، نہ کسی صحابی سے، بلکہ طبری اور ابن ابی حاتم نے اپنی حسن سند کے ساتھ علی بن ابی طلحہ سے، انھوں نے ابن عباس رضی اللہ عنھما سے نقل کیا ہے کہ عورت جب زنا کرتی تو گھر میں بیٹھی رہتی یہاں تک کہ فوت ہو جاتی اور ابن عباس رضی اللہ عنہما نے «وَ الَّذٰنِ يَاْتِيٰنِهَا مِنْكُمْ فَاٰذُوْهُمَا» کے متعلق فرمایا کہ مرد جب زنا کرتا تو اسے تعزیر اور جوتے مارنے کے ساتھ ایذا دی جاتی تو اللہ تعالیٰ نے اس کے بعد یہ آیات نازل فرمائیں : «اَلزَّانِيَةُ وَ الزَّانِيْ فَاجْلِدُوْا كُلَّ وَاحِدٍ مِّنْهُمَا مِائَةَ جَلْدَةٍ» [ النور : ۲ ] یعنی زنا کرنے والی عورت اور زنا کرنے والے مرد کو سو سو کوڑے مارو۔ پھر اگر وہ شادی شدہ ہوں تو رسول اللہ صلی اللہ علیہ وسلم کی سنت کے مطابق انھیں رجم کر دیا جائے گا۔ یہ ہے وہ ’’سبیل‘‘ جو اللہ نے فرمایا : «اَوْ يَجْعَلَ اللّٰهُ لَهُنَّ سَبِيْلًا » (یہاں تک کہ انھیں موت اٹھا لے جائے یا اللہ ان کے لیے کوئی راستہ بنا دے) اسی طرح طبری نے صحیح سند کے ساتھ مجاہد سے نقل کیا ہے کہ «وَ الَّذٰنِ يَاْتِيٰنِهَا مِنْكُمْ » سے مراد زنا کرنے والے مرد و عورت ہیں۔ علاوہ ازیں {”يَاْتِيٰنِهَا“} میں {’’ها‘‘} کی ضمیر پچھلی آیت میں مذکور {’’ الْفَاحِشَةَ ‘‘} کی طرف جا رہی ہے جس سے اس مقام پر مراد زنا ہے۔ اس فاحشہ سے مراد قوم لوط کا عمل ہو ہی نہیں سکتا۔ رہا { ”الَّذٰنِ“ } تثنیہ مذکر کا لفظ تو دو افراد اگر مذکر و مؤنث ہوں تو ان کے لیے تثنیہ مذکر کی ضمیر عام استعمال ہوتی ہے، اس میں کوئی قباحت نہیں۔"
    },
    {
      "Ayah": 16,
      "tafsir": "(آیت 16،15) ➊ { وَ الّٰتِيْ يَاْتِيْنَ الْفَاحِشَةَ … :} اوپر کی آیات میں عورتوں کے ساتھ احسان اور ان کے مہر ادا کرنے اور مردوں کے ساتھ ان کو وراثت میں شریک قرار دے کر ان کے حقوق کی حفاظت کا بیان تھا، اب یہاں سے عورتوں کی تادیب اور ان پر سختی کا بیان ہے، تاکہ عورت اپنے آپ کو بالکل ہی آزاد نہ سمجھے۔ (قرطبی) پہلی آیت میں زنا کار عورتوں کی سزا بیان کی کہ زنا شہادت سے ثابت ہو جائے تو انھیں تاعمر گھر میں محبوس رکھا جائے، یہاں تک کہ وہ مرجائیں، یا اللہ تعالیٰ ان کے بارے میں کوئی دوسری سزا نازل فرما دے۔ اسلام میں زنا کار عورتوں کے لیے یہ پہلی سزا ہے جو بعد میں حد زنا نازل ہونے سے منسوخ ہو گئی۔ سورۂ نور میں جو سو کوڑوں کی سزا نازل ہوئی ہے، یہاں {”سَبِيْلًا“} سے اسی طرف اشارہ ہے۔ دوسری آیت میں زانی مرد اورزنا کار عورت کے متعلق یہ حکم دیا گیا کہ ان کو اذیت دی جائے اور ذلیل کیا جائے، حتیٰ کہ تائب ہو جائیں، یہ سزا پہلی سزا کے ساتھ ہی ہے، بعد میں یہ دونوں سزائیں منسوخ ہو گئیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھ سے (احکام دین) لو، اللہ تعالیٰ نے ان عورتوں کے لیے سبیل پیدا فرما دی ہے کہ کنوارا کنواری کے ساتھ (زنا کرے) تو اس کے لیے سو کوڑے اور ایک سال کی جلا وطنی اور شادی شدہ شادی شدہ کے ساتھ (زنا کرے) تو ان کے لیے سو کوڑے اور سنگسار ہے۔‘‘ [ مسلم، الحدود، باب حد الزنی : ۱۶۹۰، عن عبادۃ بن الصامت رضی اللہ عنہ ] مزید دیکھیے سورۂ نور (۲)۔ (ابن کثیر، قرطبی) ¤ ➋ {اَرْبَعَةً مِّنْكُمْ:} چونکہ زنا کی سزا نہایت سخت ہے، اس لیے اس پر گواہی بھی زیادہ مضبوط رکھی۔ عربی زبان کا قااعدہ ہے کہ جو چیز شمار کی جا رہی ہے، وہ مذکر ہو تو عدد مؤنث ہوتا ہے، اس لیے { ”اَرْبَعَةً“ } کی وجہ سے ترجمہ ’’چار مرد‘‘ کیا ہے۔ ¤ ➌ {وَ الَّذٰنِ يَاْتِيٰنِهَا …:} بعض علماء نے اس سے مراد قوم لوط کا عمل کرنے والے دو مرد لیے ہیں، اگرچہ { ”وَ الَّذٰنِ“ } کے لفظ میں، جو تثنیہ مذکر کے لیے آتا ہے، اس کی گنجائش ہے، مگر یہ مطلب نہ رسول اللہ صلی اللہ علیہ وسلم سے منقول ہے، نہ کسی صحابی سے، بلکہ طبری اور ابن ابی حاتم نے اپنی حسن سند کے ساتھ علی بن ابی طلحہ سے، انھوں نے ابن عباس رضی اللہ عنھما سے نقل کیا ہے کہ عورت جب زنا کرتی تو گھر میں بیٹھی رہتی یہاں تک کہ فوت ہو جاتی اور ابن عباس رضی اللہ عنہما نے «وَ الَّذٰنِ يَاْتِيٰنِهَا مِنْكُمْ فَاٰذُوْهُمَا» کے متعلق فرمایا کہ مرد جب زنا کرتا تو اسے تعزیر اور جوتے مارنے کے ساتھ ایذا دی جاتی تو اللہ تعالیٰ نے اس کے بعد یہ آیات نازل فرمائیں : «اَلزَّانِيَةُ وَ الزَّانِيْ فَاجْلِدُوْا كُلَّ وَاحِدٍ مِّنْهُمَا مِائَةَ جَلْدَةٍ» [ النور : ۲ ] یعنی زنا کرنے والی عورت اور زنا کرنے والے مرد کو سو سو کوڑے مارو۔ پھر اگر وہ شادی شدہ ہوں تو رسول اللہ صلی اللہ علیہ وسلم کی سنت کے مطابق انھیں رجم کر دیا جائے گا۔ یہ ہے وہ ’’سبیل‘‘ جو اللہ نے فرمایا : «اَوْ يَجْعَلَ اللّٰهُ لَهُنَّ سَبِيْلًا » (یہاں تک کہ انھیں موت اٹھا لے جائے یا اللہ ان کے لیے کوئی راستہ بنا دے) اسی طرح طبری نے صحیح سند کے ساتھ مجاہد سے نقل کیا ہے کہ «وَ الَّذٰنِ يَاْتِيٰنِهَا مِنْكُمْ » سے مراد زنا کرنے والے مرد و عورت ہیں۔ علاوہ ازیں {”يَاْتِيٰنِهَا“} میں {’’ها‘‘} کی ضمیر پچھلی آیت میں مذکور {’’ الْفَاحِشَةَ ‘‘} کی طرف جا رہی ہے جس سے اس مقام پر مراد زنا ہے۔ اس فاحشہ سے مراد قوم لوط کا عمل ہو ہی نہیں سکتا۔ رہا { ”الَّذٰنِ“ } تثنیہ مذکر کا لفظ تو دو افراد اگر مذکر و مؤنث ہوں تو ان کے لیے تثنیہ مذکر کی ضمیر عام استعمال ہوتی ہے، اس میں کوئی قباحت نہیں۔"
    },
    {
      "Ayah": 17,
      "tafsir": "(آیت 17) ➊ {اِنَّمَا التَّوْبَةُ عَلَى اللّٰهِ:} یہاں { ”عَلَى اللّٰهِ“ } کے معنی یہ ہیں کہ ایسے لوگوں کی توبہ قبول کرنا اللہ تعالیٰ نے اپنے فضل و کرم سے اپنے ذمے لے لیا ہے، ورنہ اللہ تعالیٰ پر کوئی چیز لازم نہیں ہے۔ (قرطبی) ¤ ➋ { ”بِجَهَالَةٍ“ } یعنی اگر کبھی نادانی اور جذبات سے مغلوب ہو کر گناہ کر بھی لیتے ہیں تو { ”مِنْ قَرِيْبٍ“ } یعنی جلد ہی توبہ کر لیتے ہیں۔ یہاں ایک سوال ہے کہ اگر اللہ تعالیٰ صرف ان لوگوں کی توبہ قبول کرتا ہے جو جہالت سے گناہ کرتے ہیں تو اس کا مطلب یہ ہوا کہ اگر کوئی جہالت سے گناہ نہ کرے بلکہ دیدہ و دانستہ علم رکھتے ہوئے گناہ کرے تو اس کی توبہ قبول ہی نہیں۔ جواب اس کا یہ ہے کہ یہاں { ”بِجَهَالَةٍ“ } کی قید احتراز کے لیے نہیں ہے، بلکہ بیان واقعہ کے لیے ہے، یہاں جہالت سے مراد بے خبری اور نا واقفیت نہیں بلکہ بے وقوفی اور سفاہت ہے، کیونکہ ہر گناہ ہوتا ہی جہالت اور بے وقوفی کی وجہ سے ہے۔ گناہ کرنے والا اس کے انجام سے بے پروا ہو کر ہی گناہ کی جرأت کرتا ہے، اگر وہ اس کا انجام پوری طرح اپنی آنکھوں کے سامنے رکھے تو وہ کبھی گناہ کا ارتکاب نہ کر سکے۔ {”مِنْ قَرِيْبٍ“} کا مفہوم یہ ہے کہ موت کے آثار مشاہدہ کرنے سے پہلے پہلے تائب ہو جاتے ہیں۔ ان دو شرطوں کے ساتھ اللہ تعالیٰ ان کی توبہ قبول فرما لیتا ہے۔ (قرطبی، ابن کثیر)"
    },
    {
      "Ayah": 18,
      "tafsir": "(آیت 18) ➊ {وَ لَيْسَتِ التَّوْبَةُ … :} یعنی ایسے لوگوں کی توبہ قبول نہیں ہوتی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ اللہ تعالیٰ اپنے بندے کی توبہ کو اس وقت تک قبول کرتا ہے جب تک کہ موت کے وقت اس کی روح حلق تک نہ پہنچ جائے۔‘‘ [ ترمذی، الدعوات، باب إن اللہ یقبل… : ۳۵۳۷ ، عن ابن عمر رضی اللہ عنہما وقال الألبانی حسن ] آخری وقت میں تو فرعون نے بھی توبہ کر لی تھی مگر اللہ تعالیٰ نے فرمایا : «آٰلْـٰٔنَ وَ قَدْ عَصَيْتَ قَبْلُ وَ كُنْتَ مِنَ الْمُفْسِدِيْن» [ یونس : ۹۱ ] ’’کیا اب؟ حالانکہ بے شک تو نے اس سے پہلے نافرمانی کی اور تو فساد کرنے والوں سے تھا۔‘‘ ¤ ➋ {وَ لَا الَّذِيْنَ يَمُوْتُوْنَ وَ هُمْ كُفَّارٌ:} یعنی جو لوگ مرتے دم تک کفر و شرک میں مبتلا رہتے ہیں اور موت کے آثار دیکھ کر توبہ کرنا چاہتے ہیں، ان کی توبہ بھی قبول نہیں ہوتی، اللہ تعالیٰ نے فرمایا : «فَلَمَّا رَاَوْا بَاْسَنَا قَالُوْۤا اٰمَنَّا بِاللّٰهِ وَحْدَهٗ وَ كَفَرْنَا بِممَا كُنَّا بِهٖ مُشْرِكِيْنَ(84) فَلَمْ يَكُ يَنْفَعُهُمْ اِيْمَانُهُمْ لَمَّا رَاَوْا بَاْسَنَا سُنَّتَ اللّٰهِ الَّتِيْ قَدْ خَلَتْ فِيْ عِبَادِهٖ وَ خَسِرَ هُنَالِكَ الْكٰفِرُوْنَ» [ المؤمن : ۸۴، ۸۵ ] ’’پھر جب انھوں نے ہمارا عذاب دیکھا تو انھوں نے کہا ہم اس اکیلے اللہ پر ایمان لائے اور ہم نے ان کا انکار کیا جنھیں ہم اس کے ساتھ شریک ٹھہرانے والے تھے۔ پھر یہ نہ تھا کہ ان کا ایمان انھیں فائدہ دیتا، جب انھوں نے ہمارا عذاب دیکھ لیا۔ یہ اللہ کا طریقہ ہے جو اس کے بندوں میں گزر چکا اور اس موقع پر کافر خسارے میں رہے۔‘‘ نیز دیکھیے سورۂ انعام (۱۵۸)"
    },
    {
      "Ayah": 19,
      "tafsir": "(آیت 19) ➊ {لَا يَحِلُّ لَكُمْ اَنْ تَرِثُوا النِّسَآءَ كَرْهًا:} زنا وغیرہ کے سلسلہ میں ضمناً توبہ کے احکام بیان فرمانے کے بعد اب یہاں سے پھر عورتوں کے حقوق کا بیان ہو رہا ہے اور اس سے مقصد عورتوں کو اس ظلم وزیادتی سے نجات دلانا ہے جو جاہلیت میں ان پر روا رکھی جاتی تھی۔ اس کے مخاطب یا تو شوہر کے اولیاء ہیں، جیسا کہ امام بخاری رحمہ اللہ اور دوسرے محدثین نے اس آیت کی شان نزول میں ابن عباس رضی اللہ عنہما سے نقل کیا ہے کہ زمانۂ جاہلیت میں میت کے اولیاء دوسری چیزوں کی طرح اس کی بیوی کے بھی مالک ہوتے تھے، ان میں سے اگر کوئی چاہتا تو خود اس سے شادی کر لیتا، یا کسی دوسرے سے شادی کر دیتے( اور مہر خود لے لیتے) اور اگر چاہتے تو عورت کو کلیتاً شادی ہی سے روک دیتے( حتیٰ کہ وہ مر جاتی اور اس کے مال کے وارث خود بن جاتے) عورت کے اولیاء کو اس سلسلہ میں کوئی اختیار نہ ہوتا، اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی اور عورت پر ان کے تسلط کو ختم کر دیا۔ [ بخاری، التفسیر، باب : «لا یحل لکم …» : ۴۵۷۹ ] اور یہ بھی ہو سکتا ہے کہ اس کے مخاطب شوہر ہوں، چنانچہ بعض علماء نے اس کی شان نزول میں لکھا ہے کہ وہ عورتوں کو طلاق نہ دیتے بلکہ تنگ کرتے رہتے، تاکہ اگر مر جائیں تو ان کے وارث بن جائیں اور اگر طلاق لینا چاہیں تو جو کچھ انھیں دیا ہے اس میں سے کچھ واپس کریں، اس پر یہ آیت نازل ہوئی۔ پہلی صورت میں اس کا حاصل یہ ہے کہ خاوند کے مرنے کے بعد اسے نکاح سے روکنا جائز نہیں، بلکہ وہ جہاں چاہے نکاح کر سکتی ہے اور خاوند کے اولیاء اس طرح زبردستی اس کے وارث نہیں بن سکتے۔ دوسری صورت میں، یعنی جب شوہر مخاطب ہوں، تو خلاصہ یہ ہو گا کہ شوہر کے لیے جائز نہیں کہ عورت سے مہر واپس لینے کی غرض سے اسے تنگ کرتا رہے اور طلاق نہ دے، حتیٰ کہ وہ خلع پر مجبور ہو جائے۔ یہ دوسری صورت زیادہ صحیح معلوم ہوتی ہے اور ابن عطیہ وغیرہ نے اسی کو پسند کیا ہے، اس لیے کہ آیت کے بقیہ حصے کا تعلق بلا شک و شبہ شوہروں ہی کے ساتھ ہے، کیونکہ واضح بے حیائی کے ارتکاب کی صورت میں خاوند ہی کو یہ حق پہنچتا ہے کہ وہ اسے روک رکھے، تاکہ اسے مہر وغیرہ، جو کچھ دیا ہے، واپس لے کر طلاق دے، شوہر کے اولیاء کو یہ اختیار نہیں ہے۔ (فتح القدیر، قرطبی) اور یہ بھی ہو سکتا ہے کہ خطاب عام مسلمانوں سے ہو، جس میں شوہر، میت کے اولیاء اور دوسرے مسلمان سبھی آ جاتے ہوں۔ (فتح القدیر) ¤ ➋ {اِلَّاۤ اَنْ يَّاْتِيْنَ بِفَاحِشَةٍ مُّبَيِّنَةٍ:} ابن کثیر رحمہ اللہ کا قول ہے کہ ابن عباس رضی اللہ عنہما ، عکرمہ اور ضحاک رحمھما اللہ نے {”بِفَاحِشَةٍ مُّبَيِّنَةٍ“} سے مراد سرکشی اور نافرمانی لی ہے، مگر ابن جریر رحمہ اللہ نے اس بات کو ترجیح دی ہے کہ اسے عام رکھا جائے اور یہ فحش کلامی، بد خلقی، ایذا رسانی، زنا اور اس قسم کے جملہ رذائل کو شامل ہو اور مطلب یہ ہو گا کہ اگر زیادتی عورت کی طرف سے ہو تو تم اسے خلع لینے پر مجبور کر سکتے ہو، تاکہ وہ لیا ہوا مال واپس کر دے۔ ¤ ➌ {وَ عَاشِرُوْهُنَّ بِالْمَعْرُوْفِ:} یہ عورتوں سے متعلق تیسرا حکم ہے کہ ان کے ساتھ اچھے طریقے سے رہو، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [خَيْرُكُمْ خَيْرُكُمْ لِأَهْلِهِ وَأَنَا خَيْرُكُمْ لِأَهْلِيْ ] [ ابن ماجہ، النکاح، باب حسن معاشرۃ النساء : ۱۹۷۷، عن ابن عباس رضی اللہ عنہما۔ ترمذی : ۳۸۹۵۔ الصحیحۃ : ۲۸۵ ]’’تم میں سب سے بہتر وہ شخص ہے جو اپنے گھر والوں کے لیے بہترہے اور میں تم میں سے اپنے گھر والوں کے لیے سب سے بہتر ہوں۔‘‘ ¤ ➍ {فَاِنْ كَرِهْتُمُوْهُنَّ فَعَسٰۤى …:} یہ بھی ان کے ساتھ اچھے طریقے سے رہنے کی بات کی تکمیل ہے، یعنی اگر کسی اخلاقی کمزوری یا بد صورت ہونے کی وجہ سے تمھیں ان سے نفرت ہو جائے اور ان کو طلاق دینا چاہو تو بھی فوراً طلاق نہ دو، بلکہ بہتر طریقے سے انھیں اپنے پاس رکھو، ہو سکتا ہے کہ ان کی صحبت سے خیر کثیر، یعنی صالح اولاد حاصل ہو جائے یا مال میں برکت ہو جائے اور تمھاری نفرت محبت میں تبدیل ہو جائے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’کوئی مومن اپنی مومنہ بیوی سے بغض نہ رکھے، اگر اسے اس کی کوئی ایک عادت ناپسند ہو گی تو دوسری پسند بھی ہو گی۔‘‘ [ مسلم، الرضاع، باب الوصیۃ بالنساء : ۱۴۶۷، عن أبی ھریرۃ رضی اللہ عنہ ] اس کے دوسرے معنی یہ بھی ہو سکتے ہیں کہ اگر نفرت کے سبب تم ان سے علیحدگی اختیار کرنا چاہو تو ہو سکتا ہے کہ اس علیحدگی میں ان کے لیے خیر کثیر مضمر ہو، مثلاً ان کو بہتر خاوند مل جائے۔ دیکھیے سورۂ نساء (۱۳۰)۔"
    },
    {
      "Ayah": 20,
      "tafsir": "(آیت 21،20) ➊ {وَ اِنْ اَرَدْتُّمُ اسْتِبْدَالَ زَوْجٍ …:} یہ عورتوں سے متعلق چوتھا حکم ہے۔ جب پہلی آیات میں بیان فرمایا کہ اگر صحیح طریقے سے ساتھ نہ رہنے کی وجہ عورت کی جانب سے ہو تو مہر واپس لینے کے لیے اسے تنگ کرنا جائز ہے، یہاں بتایا کہ جب زیادتی شوہر کی جانب سے ہو تو پھر عورت سے فدیۂ طلاق لینا ممنوع اور حرام ہے۔ یعنی بلاوجہ تنگ کر کے ان سے مہر واپس لو گے تو یہ ایسا ہی ہے جیسے کوئی بہتان باندھ کر مہر واپس لے رہا ہے اور اس صورت میں تم ان پر دوہرا ظلم کرو گے، ایک بلاوجہ تنگ کرنا اور دوسرا مہر واپس لینا، اس لیے اسے {”اِثْمًا مُّبِيْنًا“} فرمایا۔ ¤ ➋ {وَ اٰتَيْتُمْ اِحْدٰىهُنَّ قِنْطَارًا:} اس سے معلوم ہوتا ہے کہ زیادہ مہر کی کوئی حد معین نہیں ہے، خاوند اپنی حیثیت کے مطابق جتنا مہر دینا چاہے دے سکتا ہے۔ اس مقام پر امیر المومنین عمر بن خطاب رضی اللہ عنہ کے مہر زیادہ رکھنے سے منع کرنے پر ایک عورت کا واقعہ بیان کیا جاتا ہے جس نے زیادہ مہر کے جواز کے لیے یہ آیت پڑھی تو عمر رضی اللہ عنہ نے فرمایا کہ عمر سے ہر شخص زیادہ سمجھ دار ہے اور اس سے کئی دشمنان صحابہ عمر رضی اللہ عنہ پر طعن کرتے ہیں۔ عورت کا واقعہ کسی صحیح سند سے ثابت نہیں، تفصیل کے لیے دیکھیں ارواء الغلیل (۱۹۲۷)۔ ¤ ➌ {وَ كَيْفَ تَاْخُذُوْنَهٗ وَ قَدْ اَفْضٰى …:} اس سے معلوم ہوا کہ جماع کے بعد دیا ہوا مہرر واپس نہیں ہو سکتا۔ چنانچہ آپ نے لعان کرنے والے مرد کے مہر واپس لینے کے مطالبے پر فرمایا تھا : ’’اگر تم نے اپنی بیوی پر زنا کی بات سچ کہی ہے تو مہر اس کے عوض ہے جو تم نے اس کی شرم گاہ اپنے لیے حلال کی اور اگر اس پر جھوٹ کہا ہے تو پھر تو (مہر کی واپسی) زیادہ ہی بعید ہے۔‘‘ [ بخاری، الطلاق، باب قول الإمام للمتلاعنین… ۵۳۱۲۔ مسلم : ۵؍۱۴۹۳، عن ابن عمر رضی اللہ عنہما ] ¤ ➍ {وَ اَخَذْنَ مِنْكُمْ مِّيْثَاقًا غَلِيْظًا:} ’’ پختہ عہد‘‘ سے مراد عقد نکاح ہے، یعنی تمھارا یہ کہنا کہ میں نے فلاں عورت سے نکاح قبول کیا۔ اب طلاق کی صورت میں دو ہی راستے ہیں : «فَاِمْسَاكٌۢ بِمَعْرُوْفٍ اَوْ تَسْرِيْحٌۢ بِاِحْسَانٍ » [ البقرۃ : ۲۲۹ ] اور ظاہر ہے کہ طلاق دے کر مہر نہ دینا ان دونوں میں سے ایک بھی نہیں۔"
    },
    {
      "Ayah": 21,
      "tafsir": "(آیت 21،20) ➊ {وَ اِنْ اَرَدْتُّمُ اسْتِبْدَالَ زَوْجٍ …:} یہ عورتوں سے متعلق چوتھا حکم ہے۔ جب پہلی آیات میں بیان فرمایا کہ اگر صحیح طریقے سے ساتھ نہ رہنے کی وجہ عورت کی جانب سے ہو تو مہر واپس لینے کے لیے اسے تنگ کرنا جائز ہے، یہاں بتایا کہ جب زیادتی شوہر کی جانب سے ہو تو پھر عورت سے فدیۂ طلاق لینا ممنوع اور حرام ہے۔ یعنی بلاوجہ تنگ کر کے ان سے مہر واپس لو گے تو یہ ایسا ہی ہے جیسے کوئی بہتان باندھ کر مہر واپس لے رہا ہے اور اس صورت میں تم ان پر دوہرا ظلم کرو گے، ایک بلاوجہ تنگ کرنا اور دوسرا مہر واپس لینا، اس لیے اسے {”اِثْمًا مُّبِيْنًا“} فرمایا۔ ¤ ➋ {وَ اٰتَيْتُمْ اِحْدٰىهُنَّ قِنْطَارًا:} اس سے معلوم ہوتا ہے کہ زیادہ مہر کی کوئی حد معین نہیں ہے، خاوند اپنی حیثیت کے مطابق جتنا مہر دینا چاہے دے سکتا ہے۔ اس مقام پر امیر المومنین عمر بن خطاب رضی اللہ عنہ کے مہر زیادہ رکھنے سے منع کرنے پر ایک عورت کا واقعہ بیان کیا جاتا ہے جس نے زیادہ مہر کے جواز کے لیے یہ آیت پڑھی تو عمر رضی اللہ عنہ نے فرمایا کہ عمر سے ہر شخص زیادہ سمجھ دار ہے اور اس سے کئی دشمنان صحابہ عمر رضی اللہ عنہ پر طعن کرتے ہیں۔ عورت کا واقعہ کسی صحیح سند سے ثابت نہیں، تفصیل کے لیے دیکھیں ارواء الغلیل (۱۹۲۷)۔ ¤ ➌ {وَ كَيْفَ تَاْخُذُوْنَهٗ وَ قَدْ اَفْضٰى …:} اس سے معلوم ہوا کہ جماع کے بعد دیا ہوا مہرر واپس نہیں ہو سکتا۔ چنانچہ آپ نے لعان کرنے والے مرد کے مہر واپس لینے کے مطالبے پر فرمایا تھا : ’’اگر تم نے اپنی بیوی پر زنا کی بات سچ کہی ہے تو مہر اس کے عوض ہے جو تم نے اس کی شرم گاہ اپنے لیے حلال کی اور اگر اس پر جھوٹ کہا ہے تو پھر تو (مہر کی واپسی) زیادہ ہی بعید ہے۔‘‘ [ بخاری، الطلاق، باب قول الإمام للمتلاعنین… ۵۳۱۲۔ مسلم : ۵؍۱۴۹۳، عن ابن عمر رضی اللہ عنہما ] ¤ ➍ {وَ اَخَذْنَ مِنْكُمْ مِّيْثَاقًا غَلِيْظًا:} ’’ پختہ عہد‘‘ سے مراد عقد نکاح ہے، یعنی تمھارا یہ کہنا کہ میں نے فلاں عورت سے نکاح قبول کیا۔ اب طلاق کی صورت میں دو ہی راستے ہیں : «فَاِمْسَاكٌۢ بِمَعْرُوْفٍ اَوْ تَسْرِيْحٌۢ بِاِحْسَانٍ » [ البقرۃ : ۲۲۹ ] اور ظاہر ہے کہ طلاق دے کر مہر نہ دینا ان دونوں میں سے ایک بھی نہیں۔"
    },
    {
      "Ayah": 22,
      "tafsir": "(آیت 22) {وَ لَا تَنْكِحُوْا مَا نَكَحَ …:} جاہلیت کے دستور میں بیٹے کے لیے اپنے باپ کی منکوحہ (سوتیلی ماں) سے شادی کر لینا جائز تھا، ابن عباس رضی اللہ عنہما نے فرمایا : ’’اہل جاہلیت ان رشتوں کو حرام سمجھتے تھے جنھیں اللہ تعالیٰ نے حرام کیا، سوائے باپ کی بیوی اور دو بہنوں کو جمع کرنے کے، اس پر اللہ تعالیٰ نے یہ آیات نازل کیں : «وَ لَا تَنْكِحُوْا مَا نَكَحَ اٰبَآؤُكُمْ مِّنَ النِّسَآءِ» [النساء : ۲۲ ] اور «وَ اَنْ تَجْمَعُوْا بَيْنَ الْاُخْتَيْنِ» [ النساء : ۲۳ ] [ ابن جریر : 369/4 صحیح ] اللہ تعالیٰ نے اسے سخت حرام قرار دیا، حتیٰ کہ اگر باپ نے صرف عقد ہی کیا ہو تو بھی بیٹے کا اس سے نکاح حرام ہے۔ یہ سخت بے حیائی اور اللہ کی سخت ناراضگی کا باعث اور برا راستہ ہے کہ آج تم نے اپنے باپ کی منکوحہ سے نکاح کیا ہے، کل تمھاری منکوحہ سے تمھارا بیٹا نکاح کرے گا، اللہ تعالیٰ نے یہ راستہ ہی بند کر دیا۔ براء بن عازب رضی اللہ عنھما سے روایت ہے، وہ اپنے ماموں ابو بردہ رضی اللہ عنہ سے بیان کرتے ہیں کہ انھیں رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کی طرف بھیجا جس نے اپنے باپ کے بعد اس کی بیوی سے نکاح کر لیا تھا کہ اسے قتل کر دیں اور اس کا مال لے لیں۔ [ أبو داوٗد، الحدود، باب فی الرجل یزنی بحریمہ : ۴۴۵۷۔ ترمذی : ۱۳۶۲۔ نسائی : ۳۳۳۴۔ ابن ماجہ : ۲۶۰۷ و قال الألبانی صحیح ] معلوم ہوا ایسا شخص واجب القتل ہے۔"
    },
    {
      "Ayah": 23,
      "tafsir": "(آیت 23) ➊ {حُرِّمَتْ عَلَيْكُمْ اُمَّهٰتُكُمْ …:} جن عورتوں سے نکاح کرنا حرام ہے ان کی تفصیل بیان کی جا رہی ہے، ایک تو پچھلی آیت میں بیان ہوا کہ باپ کی منکوحہ سے نکاح کرنا حرام ہے، اب یہاں نسب کے سات حرام رشتوں کا ذکر ہے : (1) ماں: اس کے حکم میں نانی اور دادی اوپر تک، مثلاً، پڑدادی، پڑنانی شامل ہیں۔ (2) بیٹی : اس کے حکم میں پوتی اور نواسی نیچے تک آ جاتی ہیں۔ (3) بہن : سگی ہو یا علاتی یا اخیافی، بہرحال حرام ہے۔ (4) پھوپھی : اس میں دادا کی بہن اور نانا کی بہن بھی داخل ہے۔ (5) خالہ : یہ لفظ ماں، نانی اور دادی سب کی بہنوں کو شامل ہے۔ (7،6) بھتیجی اور بھانجی کے حکم میں ان کی بیٹیاں نیچے تک آ جاتی ہیں۔ (قرطبی) ¤ ➋ {وَ اُمَّهٰتُكُمُ الّٰتِيْۤ اَرْضَعْنَكُمْ … :} یعنی نسبی ماں اور بہن کی طرح دودھ کی ماں اور بہن بھی حرام ہیں۔ یہاں دو رشتوں کا ذکر ہے، مگر حدیث کی رو سے وہ ساتوں رشتے جو نسب سے حرام ہیں، دودھ سے بھی حرام ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’رضاعت سے بھی وہ رشتے حرام ہو جاتے ہیں جو نسب سے حرام ہیں۔‘‘ [ بخاری، النکاح، باب : «و أمہاتکم التی أرضعنکم» : ۵۰۹۹، عن عائشۃ رضی اللہ عنہا ] ¤ قرآن مجید نے دودھ پینے کو حرمت کا سبب قرار دیا ہے، یہ وضاحت نہیں فرمائی کہ کم از کم کتنی دفعہ دودھ پیا ہو، مگر مسلم میں ام الفضل اور عائشہ رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ایک یا دو دفعہ دودھ پینا حرمت کا باعث نہیں ہوتا۔‘‘ [ مسلم، الرضاع، باب فی المصۃ والمصتان : ۱۴۵۰، ۱۴۵۱ ] عائشہ رضی اللہ عنہاسے مروی ہے کہ قرآن میں اترنے والے حکم میں تھا کہ دس دفعہ دودھ پینا جو معلوم ہو، حرام کرتا ہے، پھر وہ پانچ کے ساتھ منسوخ ہو گیا، تو نبی صلی اللہ علیہ وسلم فوت ہوئے اور وہ قرآن میں پڑھے جاتے تھے۔ [ مسلم، الرضاع، باب التحریم بخمس رضعات : ۱۴۵۲ ] یاد رہے کہ یہ دودھ پلانا اسی وقت معتبر ہو گا، جب دودھ پلانے کی مدت، یعنی دو سال کے اندر ہو۔ دیکھیے سورۂ بقرہ (۲۳۳)۔ ¤ ➌ {وَ اُمَّهٰتُ نِسَآىِٕكُمْ:} اس میں بیویوں کی نانیاں اور دادیاں بھی اوپر تک شامل ہیں۔ بیوی کی ماں(ساس) حرام ہے، خواہ بیوی کو جماع سے پہلے طلاق دے دی ہو، یا اس کا انتقال ہو گیا ہو۔ ¤ ➍ {وَ رَبَآىِٕبُكُمُ الّٰتِيْ فِيْ حُجُوْرِكُمْ: ”رَبَائِبُ“ } یہ{’’ رَبِيْبَةٌ ‘‘ } کی جمع ہے، یعنی بیوی کی دوسرے خاوند سے جو لڑکی ہو وہ بھی حرام ہے، بشرطیکہ اپنی بیوی (اس لڑکی کی ماں) سے جماع کر لیا ہو، اگر قبل از جماع طلاق دے دی تو عورت کی لڑکی سے نکاح جائز ہے، اس پر علماء کا اتفاق ہے۔ (قرطبی، ابن کثیر) ¤ { ”فِيْ حُجُوْرِكُمْ“ } (تمھاری گود میں) کی قید شرط کے طور پر نہیں، بلکہ اتفاقی ہے یعنی عام حالات ممیں ایسا ہوتا ہے، ورنہ اگر اس کی پرورش کسی اور جگہ ہوئی ہو تو بھی وہ حرام ہے۔ ¤ ➎ {وَحَلَاۤئِلُ أَبْنَاۤئِكُمْ: ”حَلَاۤئِلُ“ } یہ ”{حَلِيْلَةٌ“ } کی جمع ہے، یعنی صلبی بیٹوں کی بیویاں نہ کہ منہ بولے بیٹوں کی بیویاں۔ دیکھیے سورۂ احزاب (37)۔ ¤ ➏ {وَ اَنْ تَجْمَعُوْا بَيْنَ الْاُخْتَيْنِ.....:} یہ محل رفع میں ہے، یعنی { ”حُرِّمَ عَلَیْکُمُ الْجَمْعُ بَیْنَ الْاُخْتَیْنِ“ } کہ دو بہنوں کو، صلبی ہوں یا رضاعی، ایک وقت میں نکاح میں جمع رکھنا حرام ہے۔ قرآن مجید میں صرف دو بہنوں کو جمع کرنا منع ہے، مگر حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پھوپھی بھتیجی اور خالہ بھانجی کو ایک نکاح میں جمع نہ کیا جائے۔“ [بخاری، النکاح، باب: لا تنکح المرأۃ علی عمتھا: 5109، عن أبی ھریرۃ رضی اللہ عنہ] اس سے معلوم ہوا کہ قرآن کے علاوہ سنت بھی شریعت کا مستقل مأخذ ہے، قرآن میں صرف دو بہنوں کو جمع کرنا منع آیا ہے اور حدیث میں پھوپھی بھتیجی اور خالہ بھانجی کو جمع کرنا بھی منع آیا ہے، یہ بھی ماننا پڑے گا۔ ¤ ➐{ اِلَّا مَا قَدْ سَلَفَ:} یعنی پہلے جو رشتے ایسے ہو چکے ان کا کچھ گناہ نہیں، اس کے یہ معنی نہیں کہ ان کو برقرار رکھا جائے گا۔"
    },
    {
      "Ayah": 24,
      "tafsir": "(آیت 24) ➊ {وَ الْمُحْصَنٰتُ مِنَ النِّسَآءِ …:} اوپر کی آیت میں حرام رشتوں کا ذکر تھا، وہ تو بہر صورت حرام ہیں، خواہ ان میں سے کوئی عورت کسی کی لونڈی بن کر آ جائے۔ اس بنا پر علماء نے لکھا ہے کہ دو بہنوں کو جمع کرنا صرف نکاح ہی میں نہیں بلکہ ایک مالک کی لونڈیاں ہوں تب بھی اسے دونوں سے صحبت حرام ہے۔(ابن کثیر) اب یہاں فرمایا کہ جن عورتوں کے شوہر موجود ہوں ان سے نکاح بھی حرام ہے، ہاں جنگ کی صورت میں دارالحرب سے جو عورتیں قیدی بن کر آئیں تو اموال غنیمت کی تقسیم کے بعد جن کے حصہ میں آئیں گی ان کے لیے ’’استبراء‘‘ کے بعد ان سے صحبت جائز ہے، خواہ پیچھے ان کے خاوند موجود ہی کیوں نہ ہوں۔ {’’استبراء‘‘} یہ ہے کہ وہ عورت ایک حیض سے پاک ہو جائے، یا اگر حاملہ ہے تو وضع حمل ہو جائے۔ ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے (۸ھ میں) حنین کے دن اوطاس کی طرف ایک لشکر روانہ فرمایا، ان کا مقابلہ دشمن سے ہوا تو انھوں نے مقابلہ کیا اور فتح پائی، بہت سے قیدی ان کے ہاتھ آئے، (تقسیم کے بعد جو لونڈیاں حصے میں آئیں) صحابہ کرام رضی اللہ عنھم نے ان قیدی عورتوں سے صحبت کو گناہ سمجھا، اس لیے کہ ان کے مشرک شوہر موجود تھے، چنانچہ اللہ تعالیٰ نے یہ آیت نازل فرمائی : «{ وَ الْمُحْصَنٰتُ مِنَ النِّسَآءِ اِلَّا مَا مَلَكَتْ اَيْمَانُكُمْ }» یعنی عدت کے بعد وہ تمھارے لیے حلال کر دی گئی ہیں۔ [ مسلم، الرضاع، باب جواز وطیٔ المسبیۃ… : ۱۴۵۶ ] ¤ ➋ احصان کا لفظی معنی محفوظ کرنا ہے، قرآن مجید میں یہ لفظ چند معانی میں آیا ہے : (1) شادی شدہ عورتوں کے معنی میں، جیسے اس آیت کے شروع میں {”الْمُحْصَنٰتُ“} ( صاد کے فتحہ کے ساتھ) اسم مفعول کا صیغہ ہے۔ (2) آزاد عورتوں کے معنی میں، جیسے اگلی آیت میں ہے۔ (3) پاک دامن عورتوں کے معنی میں، جیسے اس سے اگلی آیت میں اور سورۂ مائدہ(۵) میں ہے۔ ¤ ➌ { كِتٰبَ اللّٰهِ عَلَيْكُمْ:} یعنی جن حرام رشتوں کا اوپر ذکر ہوا ہے، ان سے نکاح نہ کرنا اللہ تعالیٰ کا حکم ہے جس کا ماننا تم پر لازم ہے۔ (ابن کثیر) ¤ ➍ {وَ اُحِلَّ لَكُمْ مَّا وَرَآءَ ذٰلِكُمْ:} اور ان کے علاوہ جو عورتیں ہیں وہ تمھارے لیے حلال کی گئی ہیں، بشرطیکہ حدیث میں ان کی حرمت نہ آئی ہو، مثلاً رسول اللہ صلی اللہ علیہ وسلم نے کسی عورت کے ساتھ اس کی خالہ یا پھوپھی کو بیک وقت نکاح میں رکھنے سے منع فرمایا۔ ایسی ہی چند اور صورتیں بھی ہیں، مثلاً چار سے زیادہ عورتیں بیک وقت نکاح میں رکھنا، یا نکاح متعہ کرنا یا حلالہ کرنا، یا بنت رسول صلی اللہ علیہ وسلم اور بنت عدو اللہ (ابوجہل) کو ایک نکاح میں جمع کرنا یا ولی کی اجازت کے بغیر نکاح کرنا، یا نکاح شغار یعنی وٹہ سٹہ کا نکاح جس میں یہ شرط ہو کہ اگر تم رشتہ دو گے تو میں رشتہ دوں گا، اس شرط کے بعد مہر مقرر ہو تب بھی نکاح حرام ہے۔ جیسا کہ ابوداوٗد میں ہے کہ عباس بن عبد اللہ بن عباس نے عبد الرحمان بن حکم سے اپنی بیٹی کا نکاح کر دیا اور عبد الرحمان بن حکم نے اپنی بیٹی کا نکاح اس سے کر دیا تو معاویہ رضی اللہ عنہ نے مروان کی طرف خط لکھا اور اسے حکم دیا کہ ان دونوں کے درمیان علیحدگی کروا دیں اور دونوں نے مہر بھی مقرر کیا تھا۔ [ أبوداوٗد، النکاح، باب فی الشغار : ۲۰۷۵۔ و صححہ الألبانی ] ¤ ➎ { اَنْ تَبْتَغُوْا بِاَمْوَالِكُمْ … :} موضح میں ہے کہ ان مذکورہ محارم کے سوا سب حلال ہیں، مگر چار شرطوں کے ساتھ، اول یہ کہ طلب کرو، یعنی دونوں طرف سے زبانی ایجاب و قبول ہو، دوسرے یہ کہ مال یعنی مہر دینا قبول کرو، تیسرے یہ کہ ان عورتوں کو قید (دائمی قبضہ) میں لانا غرض ہو، ( صرف) مستی نکالنے کی غرض نہ ہو ( جیسے زنا میں ہوتا ہے) یعنی وہ عورت اس مرد کی بندی ہو جائے، چھوڑے بغیر نہ چھوٹے، یعنی کسی مہینے یا برس (مدت) کا ذکر نہ آئے۔ اس سے معلوم ہوا کہ متعہ حرام ہے( اور حلالہ بھی، کیونکہ اس میں بھی جماع کے بعد طلاق کی نیت ہوتی ہے۔) چوتھی یہ کہ چھپی یاری نہ ہو، مراد لوگ نکاح کے شاہد ہوں، کم سے کم دو مرد یا ایک مرد اور دو عورتیں، یہی چار شرطیں اس آیت سے سمجھ میں آ رہی ہیں۔ اس چوتھی شرط میں یہ بھی شامل ہے کہ نکاح ولی کرکے دے، کیونکہ ولی کے بغیر نکاح چھپی یاری میں داخل ہے۔ اسلام نے ولی کے بغیر نکاح کو باطل قرار دیا قرآن و حدیث کے دلائل کے لیے دیکھیے صحیح بخاری میں {’’کتاب النكاح، باب من قال لا نكاح إلا بولي: ۵۱۲۷‘‘} ¤ ➏ {فَمَا اسْتَمْتَعْتُمْ بِهٖ:} یعنی نکاح کے بعد جن عورتوں سے فائدہ اٹھاؤ، یعنی صحبت کرو ان کے پورے مہر ان کے حوالے کرو۔ اکثر پہلے اور پچھلے مفسرین نے یہی معنی کیے ہیں کہ استمتاع سے مراد نکاح شرعی (جس کی چار شرطوں کا اوپر ذکر آیا ہے) کے بعد صحبت ہے۔ رافضیوں نے اس سے متعہ کا جواز ثابت کیا ہے، مگر علمائے اہل سنت بالاجماع اس کی حرمت کے قائل ہیں۔ ہجرت کے ابتدائی برسوں میں بے شک رسول اللہ صلی اللہ علیہ وسلم نے (اس آیت کی رو سے نہیں بلکہ) اس رواج کی بنیاد پر جو اسلام سے پہلے چلا آ رہا تھا (جسے استصحابِ حال کہتے ہیں) بعض مواقع پر حسب ضرورت متعہ کی اجازت دی، مگر بعد میں نبی صلی اللہ علیہ وسلم نے نہایت واضح الفاظ میں اسے قیامت تک کے لیے حرام کر دیا۔ سبرہ بن معبد جہنی رضی اللہ عنہ بیان کرتے ہیں کہ وہ فتح مکہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے، اس موقع پر آپ صلی اللہ علیہ وسلم نے فرمایا : ’’لوگو ! میں نے تمھیں عورتوں سے متعہ کی اجازت دی تھی مگر اب اللہ تعالیٰ نے اسے قیامت کے دن تک کے لیے حرام قرار دے دیا ہے، سو اب جن کے پاس متعہ والی عورتیں ہیں وہ انھیں چھوڑ دیں اور جو مال تم نے انھیں دیا ہے وہ ان سے واپس نہ لو۔‘‘ [ مسلم، النکاح، باب نکاح المتعۃ… : 1406/21 ] نیز متعہ والی عورتیں نہ لونڈیاں ہیں نہ بیویاں تو ان سے متعہ کیسے جائز ہو سکتا ہے۔ دیکھیے سورۂ مومنون (۵ تا ۷)۔ ¤ ➐ {وَ لَا جُنَاحَ عَلَيْكُمْ …:} یعنی اگر خاوند اور بیوی باہمی رضا مندی سے طے شدہ مہر میں کمی بیشی کر لیں تو کچھ حرج نہیں ہے۔"
    },
    {
      "Ayah": 25,
      "tafsir": "(آیت 25) ➊ { وَ مَنْ لَّمْ يَسْتَطِعْ مِنْكُمْ … :} یعنی اگر کسی شخص کی مالی حالت اس امر کی اجازت نہیں دیتی کہ آزاد مسلمان عورتوں سے نکاح کرے تو کسی دوسرے مسلمان کی لونڈی سے نکاح کر لے، بشرطیکہ وہ لونڈی مسلمان ہو۔ یہاں کسی شخص کو اپنی لونڈی سے نکاح کرنے کی اجازت کا بیان نہیں، کیونکہ اس کا لونڈی ہونا ہی مالک کے لیے اس سے صحبت کے جواز کا باعث ہے، اس کے علاوہ کوئی اور اس سے صحبت نہیں کر سکتا اور اس کی اولاد جائز اولاد سمجھی جائے گی، ہاں اگر نکاح ہی کرنا چاہتا ہے تو پھر اسے آزاد کر دے اور آزاد کر کے نکاح کر لے۔ (فتح القدیر) ¤ ➋ { بَعْضُكُمْ مِّنْ بَعْضٍ :} یعنی تم سب آدم علیہ السلام کی اولاد ہو اور تمھاری ملت بھی ایک ہے، پھر محض لونڈی ہونے کی وجہ سے اس سے نکاح میں تردد نہ کرو۔ (شوکانی) ¤ ➌ { فَانْكِحُوْهُنَّ۠ بِاِذْنِ اَهْلِهِنَّ:} یعنی جیسے آزاد مسلمان عورت سے نکاح کے لیے ولی (سرپرست) کی اجازت ضروری ہے، اسی طرح لونڈی سے نکاح کے لیے بھی اس کے مالک کی اجازت ضروری ہے۔ اسی طرح غلام بھی اپنے مالک کی اجازت کے بغیر نکاح نہیں کر سکتا۔ ¤ ➍ { وَ اٰتُوْهُنَّ اُجُوْرَهُنَّ :} ان الفاظ سے بعض نے سمجھا ہے کہ مہر لونڈی کا حق ہے، لیکن اکثر علمائے سلف کے نزدیک یہ مہر لونڈی کے مالک کا ہو گا، لونڈی کی طرف مہر کی اضافت مجازی ہے۔ (فتح القدیر) ¤ ➎ { وَ لَا مُتَّخِذٰتِ اَخْدَانٍ: ”اَخْدَانٍ“ ’’خِدْنٌ ‘‘} کی جمع ہے ’’خفیہ آشنا۔‘‘ چھپی یاری سے منع فرمایا تو نکاح میں گواہ لازم ہوئے۔ ¤ ➏ { نِصْفُ مَا عَلَى الْمُحْصَنٰتِ مِنَ الْعَذَابِ: ”الْمُحْصَنٰتُ“ }میں الف لام عہدکا ہے، اس سے مخصوص محصنات  یعنی کنواری آزاد عورتیں مراد ہیں، کیونکہ ان کی سزا سو کوڑے ہے جس کا نصف ہو سکتا ہے، شادی شدہ آزاد عورتوں کی سزا رجم ہے، اس کا نہ نصف ہو سکتا ہے نہ یہاں {”الْمُحْصَنٰتُ“} سے وہ مراد ہیں یعنی لونڈیاں اگر شادی شدہ ہونے کے بعد زنا کریں تو انھیں کنواری آزاد عورتوں کی سزا سے نصف سزا دی جائے گی جو پچاس کوڑے ہے۔ جن لوگوں نے اس آیت کو رجم کے انکار کی دلیل بنایا ہے کہ چونکہ رجم کا نصف ہو نہیں سکتا ہے، اس لیے رجم شریعت میں ہے ہی نہیں، انھوں نے اپنی کم علمی سے الف لام کا مفہوم سمجھا ہی نہیں، نہ {’’ الْمُحْصَنٰتُ ‘‘} کی صحیح مراد سمجھی ہے۔ عبد اللہ بن عیاش مخزومی فرماتے ہیں کہ عمر رضی اللہ عنہ نے مجھے اور قریش کے چند نوجوانوں کو حکم دیا تو ہم نے حکومتی لونڈیوں میں سے کچھ لونڈیوں کو زنا کرنے کی وجہ سے پچاس پچاس کوڑے لگائے۔ [ الموطأ، الحدود، باب ما جاء فی حد الزنا : ۱۶ ] ¤ ➐ { ذٰلِكَ لِمَنْ خَشِيَ:} یعنی مذکورہ شرطوں کے ساتھ لونڈی سے نکاح صرف اسی صورت میں جائز ہے جب بدکاری میں مبتلا ہونے کا اندیشہ ہو۔ (قرطبی) ¤ ➑ { وَ اَنْ تَصْبِرُوْا خَيْرٌ لَّكُمْ:} اس سے اکثر علمائے سلف نے استدلال کیا ہے کہ لونڈی سے نکاح نہ کرنا ہی بہتر ہے، کیونکہ ایسی منکوحہ لونڈی کی اولاد بھی اس کے مالک کی غلام ہوتی ہے۔ (ابن کثیر)"
    },
    {
      "Ayah": 26,
      "tafsir": "(آیت 26) { يُرِيْدُ اللّٰهُ لِيُبَيِّنَ لَكُمْ … :} یعنی اللہ تعالیٰ اپنے احکام اس لیے بیان فرما رہا ہے کہ تم کو حلال و حرام کا پتا چل جائے اور پہلے لوگوں کے عمدہ طریق کی ہدایت ہو جائے، پہلے لوگوں سے مراد انبیاء اور ان کی امتوں کے نیک لوگ ہیں۔ (ابن کثیر، شوکانی)"
    },
    {
      "Ayah": 27,
      "tafsir": "(آیت 27) {وَ اللّٰهُ يُرِيْدُ اَنْ يَّتُوْبَ عَلَيْكُمْ … : } یعنی اللہ تعالیٰ چاہتا ہے کہ تم فسق و فجور کے بجائے پاکیزگی اپناؤ، مگر خواہشات کا اتباع کرنے والے بدکار چاہتے ہیں کہ مسلمان بھی ان کی طرح ہر حد سے آزاد ہو کر حق سے بہت دور ہٹ جائیں، لہٰذا تم شہوت پرستوں کے کہنے میں نہ آؤ۔ مراد یہود و نصاریٰ، مجوسی اور کمیونسٹ ہیں، جو حرام رشتوں سے بھی نکاح جائز سمجھتے ہیں، بلکہ بعض تو نکاح کا طریقہ ہی ختم کر کے جانور بن چکے ہیں، حتیٰ کہ قوم لوط کے عمل کو قانوناً جائز کر چکے ہیں۔"
    },
    {
      "Ayah": 28,
      "tafsir": "(آیت 28) {يُرِيْدُ اللّٰهُ اَنْ يُّخَفِّفَ عَنْكُمْ … :} یعنی اللہ تعالیٰ کو انسان کی کمزوری کا خوب علم ہے کہ عورتوں کے معاملے میں یہ کس قدر کمزور ہے، اس لیے احکام شریعت میں اس کی سہولت کا خیال رکھا گیا ہے اور دین میں سختی نہیں برتی گئی، فرمایا : { « وَ مَا جَعَلَ عَلَيْكُمْ فِي الدِّيْنِ مِنْ حَرَجٍ }» [ الحج : ۷۸ ] ’’اور اس نے دین میں تم پر کوئی تنگی نہیں رکھی۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’بے شک دین آسان ہے۔‘‘ [ بخاری، الإیمان، باب الدین یسر : ۳۹، عن أبی ہریرۃ رضی اللہ عنہ ] اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’میں تمھارے پاس نہایت آسان حنیفی شریعت لے کر آیا ہوں۔ ‘‘ [ مسند أحمد، 266/5، ح : ۲۲۳۵۴۔ بخاری، الإیمان، باب الدین یسر، قبل ح : ۳۹ ] ¤ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ دین اسلام میں کوئی تنگی نہیں کہ کوئی حلال کو چھوڑے اور حرام کو دوڑے۔‘‘ (موضح)"
    },
    {
      "Ayah": 29,
      "tafsir": "(آیت 29) ➊ { لَا تَاْكُلُوْۤا اَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ: } کمائی کے جتنے بھی ناجائز طریقے ہیں سب کے سب {’’ بِالْبَاطِلِ ‘‘} میں آجاتے ہیں، حتیٰ کہ حیلہ سازی کے ساتھ کسی کا مال کھانا بھی حرام ہے اور اپنے مال کو غلط طریقے سے اڑانا بھی اسی میں داخل ہے۔ (رازی، ابن کثیر) ¤ ➋ {اِلَّاۤ اَنْ تَكُوْنَ تِجَارَةً عَنْ تَرَاضٍ مِّنْكُمْ :} یعنی وہ تجارت اور لین دین (صنعت و حرفت وغیرہ) جس میں حقیقی باہمی رضا مندی ہو، اس کے ذریعے سے کماؤ اور کھاؤ۔ آپس کی رضا مندی میں یہ بھی ضروری ہے کہ وہ شرع کے خلاف نہ ہو، کیونکہ وہ حقیقی رضا مندی ہوتی ہی نہیں، مجبوری کی رضا مندی ہوتی ہے، مثلاً رشوت اور سود میں بظاہر رضا مندی ہے مگر حقیقی نہیں، کیونکہ ایک فریق دوسرے کی مجبوری سے فائدہ اٹھاتا ہے۔ اسی طرح جوئے اور لاٹری وغیرہ کا معاملہ ہے کہ یہ دونوں فریق نفع کی موہوم امید کے فریب میں آکر یہ کام کر رہے ہیں، اس فریب کو حقیقی رضا مندی نہیں کہا جا سکتا۔ پورے طور پر باہمی رضا مندی میں یہ چیز بھی داخل ہے کہ جب تک بیچنے والا اور خریدنے والا مجلس بیع سے الگ نہ ہوں اس وقت تک دونوں کو ایک دوسرے کی بیع رد کرنے کا حق ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’خرید و فروخت کرنے والوں میں سے ہر ایک کو (بیع فسخ کرنے کا ) اس وقت تک اختیار ہے جب تک وہ آپس میں ایک دوسرے سے جدا نہ ہو جائیں، سوائے اس تجارت کے جس میں یہ اختیار باقی رکھا جائے۔‘‘ [ بخاری، البیوع، باب البیعان بالخیار ما لم یتفرقا : ۲۱۱۱، عن ابن عمر رضی اللہ عنھما ] ¤ ➌ { وَ لَا تَقْتُلُوْۤا اَنْفُسَكُمْ:} اس کے تین معانی ہو سکتے ہیں اور تینوں مراد ہیں، پہلا یہ کہ شریعت کی مخالفت کرتے ہوئے حقیقی باہمی رضا مندی کے بغیر اگر لین دین کرو گے تو اس کا نتیجہ آپس میں قتل و غارت ہو گا، جیسا کہ جوئے کے نتیجے میں ہارنے والے کے ہاتھوں کئی جیتنے والے قتل ہو جاتے ہیں، لہٰذا یہ کام مت کرو۔ دوسرا یہ کہ ایک دوسرے کو قتل مت کرو، کیونکہ یہ اپنے آپ ہی کو قتل کرنا ہے اور تیسرا یہ کہ خود کشی مت کرو۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جس شخص نے چھری کے ساتھ اپنے آپ کو قتل کیا تو جہنم میں چھری اس کے ہاتھ میں ہو گی اور وہ اس کے ساتھ اپنے پیٹ کو پھاڑے گا، ہمیشہ ہمیشہ کے لیے اسی میں رہے گا اور جس نے اپنے آپ کو زہر سے قتل کیا تو جہنم میں اس کا زہر اس کے ہاتھ میں ہو گا، جسے وہ گھونٹ گھونٹ کر کے پیے گا، ہمیشہ ہمیشہ کے لیے اسی میں رہے گا اور جس نے پہاڑ سے گرا کر اپنے آپ کو قتل کیا تو وہ جہنم کی آگ میں گرتا رہے گا، ہمیشہ ہمیشہ کے لیے اس میں رہے گا۔ ‘‘ [ مسلم، الإیمان، باب بیان غلظ تحریم… : ۱۰۹۔ بخاری : ۵۷۷۸، عن أبی ہریرۃ رضی اللہ عنہ ]"
    },
    {
      "Ayah": 30,
      "tafsir": "(آیت 30) ➊ {وَ مَنْ يَّفْعَلْ ذٰلِكَ … : ”ذٰلِكَ“} کا اشارہ قتل نفس کی طرف بھی ہو سکتا ہے، دوسروں کا مال باطل طریقے سے کھانے کی طرف بھی اور سورت کی ابتدا سے یہاں تک جتنی چیزیں منع کی گئی ہیں ان سب کی طرف بھی۔ ¤ ➋ { وَ كَانَ ذٰلِكَ عَلَى اللّٰهِ يَسِيْرًا:} یہ انداز بیان ڈانٹنے میں مبالغے پر دلالت کر رہا ہے۔ (رازی) موضح میں ہے : ’’ یعنی مغرور نہ ہوں کہ ہم مسلمان دوزخ میں کیوں کر جائیں گے؟ اللہ تعالیٰ پر یہ آسان ہے۔‘‘"
    },
    {
      "Ayah": 31,
      "tafsir": "(آیت 31) ➊ {اِنْ تَجْتَنِبُوْا كَبَآىِٕرَ …:} کبیرہ گناہ وہ ہیں جن کے متعلق قرآن یا حدیث میں صاف طور پر دوزخ کی وعید آئی ہو، یا اللہ کے غصے کا اظہار ہوتا ہو، یا شریعت میں ان پر حد مقرر کی گئی ہو اور { ”سَيِّئَاتٌ“ } سے مراہ یہاں صغیرہ گناہ ہیں جن سے صرف منع کیا گیا ہو اور ان پر وعید وارد نہ ہوئی ہو۔ (رازی، ابن کثیر) ¤ ➋ {نُكَفِّرْ عَنْكُمْ سَيِّاٰتِكُمْ: } یعنی اگر تم کبائر سے اجتناب کرتے رہو گے تو ہم تمھارے صغیرہ گناہ تمھارے نیک اعمال کی وجہ سے معاف فرما دیں گے۔ بعض روایات میں کبائر کا شمار بھی آیا ہے، مثلاً اللہ تعالیٰ کے ساتھ شرک کرنا، کسی جان کو ناحق قتل کرنا، جوا، شراب نوشی اور پاک دامن عورتوں پر تہمت لگانا وغیرہ، مگر ان کی کوئی تحدید نہیں ہے، یہ سات سے ستر بلکہ سات سو تک بھی ہو سکتے ہیں اور بعض علماء نے اپنی کتابوں میں کبیرہ گناہوں کو جمع بھی کیا ہے، جن کا ذکر قرآن یا حدیث میں آیا ہے، جیسے امام ذہبی رحمہ اللہ کی {”اَلْكَبَائِرُ“} اور امام ہیثمی رحمہ اللہ کی{ ’’اَلزَّوَاجِرُ عَنِ اقْتَرِافِ الْكَبَائِرِ‘‘} مزید دیکھیے سورۂ نجم (۳۲)۔"
    },
    {
      "Ayah": 32,
      "tafsir": "(آیت 32){ وَ لَا تَتَمَنَّوْا مَا فَضَّلَ اللّٰهُ … :} یعنی یہ نہ کہو کہ کاش ! یہ درجہ یا مال مجھے مل جائے، یہ تقدیر پر راضی نہ ہونے کی دلیل ہے اور اگر یہ بھی ہو کہ اس کے پاس یہ نعمت نہ رہے تو حسد ہے، جس کی بہت مذمت آئی ہے، ام سلمہ رضی اللہ عنھا نے رسول اللہ صلی اللہ علیہ وسلم سے دریافت کیا کہ مرد لوگ جہاد کرتے ہیں، ہم اس سے محروم ہیں، میراث میں بھی ہمارا نصف حصہ ہے تو اس پر یہ آیت نازل ہوئی : « { وَ لَا تَتَمَنَّوْا مَا فَضَّلَ اللّٰهُ بِهٖ بَعْضَكُمْ عَلٰى بَعْضٍ }» [ أحمد : 322/6 ح : ۲۶۷۹۲ ] یعنی اللہ تعالیٰ کے ہاں تقرب نیک اعمال سے ہے، مرد کو محض مرد ہونے کی وجہ سے عورت پر عمل میں فضیلت نہیں ہے اور عورت محض عورت ہونے کی وجہ سے نیک عمل کے ثواب سے محروم نہیں ہے، لہٰذا تم بجائے حسد کے اللہ تعالیٰ کا فضل چاہا کرو۔ (ابن کثیر، بغوی)"
    },
    {
      "Ayah": 33,
      "tafsir": "(آیت 33) {وَ لِكُلٍّ جَعَلْنَا مَوَالِيَ … :} اس آیت کریمہ کے پہلے حصے میں اللہ تعالیٰ نے یہ خبر دی ہے کہ مرد ہو یا عورت ہر ایک کے ورثا اور رشتے دار ہوتے ہیں، جو اس کے مرنے کے بعد اس کے وارث بنتے ہیں۔ آیت کے دوسرے حصے «{وَ الَّذِيْنَ عَقَدَتْ اَيْمَانُكُمْ فَاٰتُوْهُمْ نَصِيْبَهُمْ}» کا مفہوم یہ ہے کہ تم نے جو حلف یا معاہدہ کسی کے ساتھ کیا ہوا ہے تو اس کا حصہ اسے دو۔ ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ یہ اس وقت کی بات ہے جب مہاجرین مدینہ آئے تھے اور رسول اللہ صلی اللہ علیہ وسلم نے مہاجرین و انصار میں بھائی چارہ قائم کر دیا تھا، انصاری کا وارث اس کے رشتے داروں کے بجائے مہاجر ہوتا تھا، پھر جب یہ آیت نازل ہوئی : « {وَ لِكُلٍّ جَعَلْنَا مَوَالِيَ} » تو وہ (وراثت جو مہاجرین اور انصار کے درمیان قائم کی گئی تھی) منسوخ ہو گئی، پھر فرمایا : «{وَ الَّذِيْنَ عَقَدَتْ اَيْمَانُكُمْ}» سے مراد یہ ہے کہ نصرت، اعانت اور نصیحت کی صورت میں انھیں ان کا حصہ دو، کیونکہ میراث سے ان کا تعلق ختم ہو گیا ہے، ہاں! البتہ ان کے لیے وصیت کی جا سکتی ہے۔ [بخاری، التفسیر، باب : « ولکل جعلنا موالی …» : ۴۵۸۰ ] نیز دیکھیے سورۂ انفال کی آخری آیت۔ ¤ مولانا محمد عبدہ رحمہ اللہ لکھتے ہیں کہ آیت میں {’’ مَوَالِيَ ‘‘} سے مراد عصبہ ہیں اور عصبہ کی وراثت میں { ”اَلْأَقْرَبُ فَالْأَقْرَبُ“ } کا اصول مقرر ہے، یعنی اول سب سے قریبی، پھر دوسرا اور ایک حدیث میں بھی [ فَلِأَوْلٰي رَجُلٍ ذَكَرٍ ] کے الفاظ ہیں، یعنی اصحاب فروض سے جو کچھ بچ جائے گا وہ عصبہ میں سے اس شخص کو ملے گا جو میت کے مردوں میں سب سے زیادہ قریب ہو گا اور اس پر علماء کا اجماع بھی ہو چکا ہے۔ [ دیکھیے فتح الباری : 294/6۔ المحلٰی : 271/9۔ أحکام القرآن للجصاص : 224/2 ]"
    },
    {
      "Ayah": 34,
      "tafsir": "(آیت 34) ➊ {اَلرِّجَالُ قَوّٰمُوْنَ …:} شریعت نے گھر کے بندوبست اور انتظام کے لیے مرد کو گھر کا قوام (نگران، ذمہ دار) قرار دیا ہے اور عورت کو اس کے ماتحت رکھا ہے۔ قرآن نے اس کی دو وجہیں بیان کی ہیں، ایک تو یہ کہ مرد کو طبعی طور پر امتیاز حاصل ہے کہ وہ منتظم بنے اور دوسرے یہ کہ گھر کے سارے اخراجات بیوی کے نفقہ سمیت مرد کے ذمے ہیں۔ اس بنا پر گھر کا نگران بننے کا حق مرد کو ہے عورت کو نہیں۔ یہی حال حکومتی امور کا ہے کہ مسلمانوں کا خلیفہ یا امیر عورت نہیں ہو سکتی، بلکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمُ امْرَأَةً ] ’’وہ قوم ہر گز کامیاب نہیں ہو گی جس نے اپنا حاکم عورت کو بنا لیا۔‘‘ [ بخاری، المغازی، باب کتاب النبی صلی اللہ علیہ وسلم إلی کسریٰ و قیصر : ۴۴۲۵ ] ¤ ➋ {فَالصّٰلِحٰتُ قٰنِتٰتٌ …:} اس آیت کی تشریح وہ حدیث کرتی ہے جس میں نبی صلی اللہ علیہ وسلم کا ارشاد ہے : ’’ بہترین بیوی وہ ہے جسے اگر تم دیکھو تو تمھیں خوش کرے، اگر تم اسے کسی بات کا حکم دو تو وہ تمھاری اطاعت کرے اور جب تم گھر میں نہ ہو تو تمھارے پیچھے وہ تمھارے مال کی اور اپنے نفس کی حفاظت کرے۔‘‘ پھر رسول للہ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «{ اَلرِّجَالُ قَوّٰمُوْنَ عَلَى النِّسَآءِ }» [ مسند أبی داوٗد الطیالسی : ۲۴۴۴۔ ابن جریر : 62/4، و صححہ صاحب ہدایۃ المستنیر ] ¤ ➌ { حٰفِظٰتٌ لِّلْغَيْبِ بِمَا حَفِظَ اللّٰهُ:} یعنی چونکہ اللہ تعالیٰ نے خاوندوں کو عورتوں کے ساتھ حسن معاشرت کا حکم دے کر ان کے حقوق محفوظ کر دیے ہیں، اس کے بدلے میں وہ خاوندوں کی غیر موجودگی میں ان کے مال اور عزت و آبرو کی حفاظت رکھتی ہیں۔ [ دیکھیے نسائی، النکاح، باب أی النساء خیر : ۳۲۳۳ ] یا یہ کہ اللہ تعالیٰ کے حکم کے موافق ان کے مال و عزت اور حقوق کی حفاظت کرتی ہیں اور خیانت سے کام نہیں لیتیں۔ (شوکانی) ¤ ➍ { وَ الّٰتِيْ تَخَافُوْنَ نُشُوْزَهُنَّ …:} نشوز کا لفظی معنی ’’اونچا ہونا، چڑھائی کرناہے‘‘ اور عورت کے نشوز کا معنی ’’خاوند سے بغض رکھنا اور اس کی اطاعت سے اپنے آپ کو اونچا سمجھنا ہے۔‘‘( مفردات) عورت پر مرد کا بہت بڑا حق ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اگر میں کسی کو حکم دیتا کہ وہ (اللہ کے سوا) کسی دوسرے کو سجدہ کرے تو میں عورت کو حکم دیتا کہ وہ اپنے شوہر کو سجدہ کرے۔‘‘ [ ترمذی، الرضاع ، باب ما جاء فی حق… : ۱۱۵۹، عن أبی ہریرۃ رضی اللہ عنہ ۔ أبو داوٗد : ۲۱۴۰ ] ¤ عورت نافرمانی کا رویہ اختیار کرے تو خاوند کو حالات کے مطابق تین چیزوں کا اختیار دیا گیا ہے، تینوں یکے بعد دیگرے اور اکٹھی بھی ہو سکتی ہیں، نصیحت کرنا، گھر میں رہ کر بستر الگ کر لینا اور انھیں مارنا۔ رسول اللہ صلی اللہ علیہ وسلم نے بعض ناگزیر حالات میں مارنے کی اجازت دی، مگر فرمایا : ’’چہرے پر مت مارو، اسے بد صورت نہ کہو اور اسے مت چھوڑو مگر گھر میں۔‘‘ [ أبو داوٗد، النکاح، باب فی حق المرأۃ علی زوجھا : ۲۱۴۲، عن حکیم بن معاویۃ رضی اللہ عنہ ] اسی طرح ایسی مار سے بھی منع کیا جس سے سخت چوٹ آئے۔ [ مسلم، الحج، باب حجۃ النبی صلی اللہ علیہ وسلم : ۱۲۱۸، عن جابر رضی اللہ عنہ ] اور فرمایا : ’’تم میں سے کوئی اپنی بیوی کو اس طرح نہ مارے جس طرح غلام کو مارتے ہیں، پھر دن کے آخر حصے میں اس سے جماع کرے گا۔‘‘ [ بخاری، النکاح، باب ما یکرہ من ضرب النساء :۵۲۰۴ ] ¤ ➎ { فَلَا تَبْغُوْا عَلَيْهِنَّ سَبِيْلًا :} یعنی اگر وہ تمھاری مطیع ہو جائیں تو ان پر زیادتی کا کوئی راستہ تلاش نہ کرو، مثلاً طلاق دینا، تنگ کر کے خلع پر مجبور کرنا وغیرہ۔"
    },
    {
      "Ayah": 35,
      "tafsir": "(آیت 35) {وَ اِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا …:} پہلے صرف عورت کی طرف سے نشوز کا ذکر تھا اب اگر دونوں کی طرف سے نفرت اور مخالفت کا سلسلہ چل نکلے اور جدائی کا اندیشہ ہو تو حاکم کو چاہیے کہ میاں بیوی دونوں کی طرف ان کے خاندان کا ایک ایک سمجھدار آدمی بطور حکم (پنچ یا منصف) مقرر کر دیں، اگر وہ دونوں اصلاح کرانے میں مخلص ہوں گے تو اللہ تعالیٰ دونوں میں موافقت پیدا کر دے گا۔ اگر اصلاح کی کوئی صورت نہ بنے تو کیا انھیں علیحدگی کا فیصلہ کرنے کا اختیار ہے یا نہیں؟بعض علماء نے فرمایا کہ اگر میاں بیوی دونوں اسے صلح یا جدائی کا اختیار دیں کہ تم جو فیصلہ کرو ہمیں منظور ہو گا تو اسے علیحدگی کے فیصلے کا بھی اختیار ہے اور بعض نے فرمایا کہ اگر وہ حاکم جس نے اسے حکم مقرر کیا ہے اسے صلح یا جدائی دونوں کے فیصلے کا اختیار دیتا ہے تو اسے علیحدگی کے فیصلے کا اختیار ہے ورنہ نہیں۔ مگر جمہور علماء کا کہنا ہے کہ حکم مقرر کرنے کا مطلب ہی یہ ہے کہ حکم دونوں فریقوں کے معاملات کا جائزہ لے کر صلح یا تفریق کا جو فیصلہ کر دیں نافذ ہو گا۔ اس کے لیے میاں بیوی یا حاکم کے اسے الگ اختیار دینے کی ضرورت نہیں۔ قرآن کریم میں زیادہ زور موافقت کرانے کی کوشش پر دیا گیا ہے۔"
    },
    {
      "Ayah": 36,
      "tafsir": "(آیت 36) ➊ {وَ اعْبُدُوا اللّٰهَ :} میاں بیوی کے معاملات کے بعد دوسرے حقوق والوں کے ساتھ احسان کا ذکر ہے، مگر ابتدا اللہ تعالیٰ کی عبادت کے حکم اور شرک سے منع کرنے سے کی ہے، کیونکہ ہر کام کی ابتدا اس سے ہوتی ہے، جیسا کہ اس سورت کا موضوع عموماً عورتوں کے مسائل ہیں، مگر سورت کی ابتدا «{ اتَّقُوْا رَبَّكُمُ الَّذِيْ خَلَقَكُمْ }» سے کی ہے۔ (ابن عاشور) ¤ ➋ { وَ لَا تُشْرِكُوْا بِهٖ شَيْـًٔا:} یعنی کسی چیز کو کسی صورت میں اس کا شریک نہ بنانا۔ اس کا شریک نہ بنانا یہ ہے کہ اللہ تعالیٰ کو ہر چیز کا مالک و مختار تسلیم کیا جائے اور اس کی کسی صفت میں کسی زندہ یا مردہ مخلوق کو شریک قرار نہ دیا جائے، تمام مرادیں اور حاجات اسی سے مانگی جائیں کہ وہی عالم میں متصرف ہے، کوئی اور نہیں۔ ¤ ➌ {وَ بِالْوَالِدَيْنِ۠ اِحْسَانًا:} توحید کا حکم دینے کے بعد درجہ بدرجہ رشتہ داروں اور دوسرے لوگوں کے حقوق بیان فرمائے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اول حق اللہ تعالیٰ کا، پھر ماں باپ کا اور پھر ان سب کا درجہ بدرجہ۔‘‘(موضح) انسان کے عدم سے وجود میں آنے کا ذریعہ اللہ تعالیٰ کے بعد ماں باپ بنتے ہیں، اس لیے ان کا حق پہلے رکھا۔ ¤ ➍ {وَ بِذِي الْقُرْبٰى:} رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مسکین پر صدقہ صرف صدقہ ہے اور رشتے دار پر صدقہ، صدقہ بھی ہے اور صلہ رحمی بھی۔‘‘ [ ترمذی، الزکاۃ، باب ما جاء فی الصدقۃ… :۶۵۸ ] اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’جو شخص پسند کرے کہ اس کے لیے اس کا رزق فراخ کیا جائے اور اس کے نشان قدم میں تاخیر کی جائے تو چاہیے کہ وہ اپنی رشتے داری کو ملائے۔‘‘ [ مسلم، البر والصلۃ، باب صلۃ الرحم… : 2557/21 ] ¤ ➎ { وَ الْيَتٰمٰى:} رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’میں اور یتیم کی کفالت کرنے والا جنت میں اس طرح ہوں گے۔‘‘ آپ نے اپنی شہادت کی اور درمیانی انگلی کو ملا کر بتایا۔ [ بخاری، الأدب، باب فضل من یعول یتیمًا : ۶۰۰۵، عن أبی ہریرۃ رضی اللہ عنہ ] ¤ ➏ مسکین کی تشریح کے لیے دیکھیے سورۂ توبہ کی آیت (۶۰)۔ ¤ ➐ { وَ الْجَارِ ذِي الْقُرْبٰى وَ الْجَارِ الْجُنُبِ:} قرابت والے ہمسائے سے مراد رشتے دار ہمسایہ ہے اور اجنبی ہمسائے سے مراد غیر رشتے دار ہمسایہ ہے۔ ہمسائیگی کے حقوق کی نگہداشت میں متعدد احادیث وارد ہیں، ایک حدیث میں ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : ’’جبریل علیہ السلام مجھے ہمیشہ پڑوسی کے متعلق وصیت کرتے رہے، یہاں تک کہ میں نے گمان کیا کہ وہ پڑوسی کو وارث قرار دے دیں گے۔‘‘ [ بخاری، الأدب، باب الوصاءۃ بالجار : ۶۰۱۵، عن ابن عمر رضی اللہ عنھما ] اور رسول اللہ صلی اللہ علیہ وسلم نے تین دفعہ فرمایا : ’’اللہ کی قسم! وہ شخص مومن نہیں ہو سکتا۔‘‘ صحابہ نے پوچھا : ’’کون شخص ؟‘‘ فرمایا : ’’وہ شخص جس کی ایذا رسانیوں سے اس کا ہمسایہ بے خوف نہ ہو۔‘‘ [ بخاری، الأدب ، باب إثم من لا یأمن جارہ بوائقہ : ۶۰۱۶، عن أبی شریح رضی اللہ عنہ ] ¤ ➑ { وَ الصَّاحِبِ بِالْجَنْۢبِ:} پہلو کے ساتھی سے ہم نشین دوست، سفر کا ساتھی، بیوی، علم سیکھنے کے لیے آنے والے یا کاروباری سلسلے میں پاس آ بیٹھنے والے سب مراد ہیں۔ ¤ ➒ { وَ ابْنِ السَّبِيْلِ:} مسافر سے مراد اکثر سلف کے نزدیک مہمان بھی ہے، رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے : ’’جو شخص اللہ تعالیٰ اور یوم آخرت پر ایمان رکھتا ہے وہ اپنے مہمان کا اکرام ( عزت افزائی) کرے۔‘‘ [ بخاری، الأدب، باب من کان یؤمن… : ۶۰۱۸، عن أبی ہریرۃ رضی اللہ عنہ ] ¤ ➓ {وَ مَا مَلَكَتْ اَيْمَانُكُمْ:} اس سے مراد غلام اور لونڈیاں ہیں، کیونکہ وہ ملکیت میں ہونے کی وجہ سے بالکل ہی بے بس ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے آخری وصیت کرتے ہوئے فرمایا : ’’نماز اور تمھارے غلام (ان دونوں کا خاص خیال رکھنا)۔‘‘ [ أبو داوٗد، الأدب، باب فی حق المملوک : ۵۱۵۶، عن علی رضی اللہ عنہ ] آج کل اگرچہ کفار نے زنا پھیلانے اور دوسرے مذموم مقاصد کے لیے غلامی کو ختم کر دیا ہے اور جنگوں میں گرفتار ہونے والی عورتوں کو غلامی کی صورت میں ایک ایک آدمی کی ملکیت میں دینے کی بجائے کیمپوں میں رکھ کر ان پر فوجیوں کے ظلم و جبر اور آبرو ریزی کا دروازہ کھولا ہے، پھر نہ ان بیچاریوں کا کوئی غم خوار یا ذمہ دار ہوتا ہے نہ ان کی اولاد کا کوئی باپ، جب کہ غلامی کی صورت میں وہ ایک مالک کی غلامی میں رہ کر اس کی اولاد کی ماں بن کر عزت حاصل کرتی ہیں۔ مگر اس آیت پر عمل کرنے کے لیے آدمی کے ماتحت افراد جو اگرچہ غلام نہیں، حسن سلوک کے حق دار ہیں، مثلاً گھر، دکان اور کارخانوں کے ملازم اور نوکر چاکر وغیرہ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’آدمی کو اتنا ہی گناہ کافی ہے کہ وہ جن لوگوں کی خوراک کا مالک ہے ان کی خوراک روک لے۔‘‘ [ مسلم، الزکوٰۃ، باب فضل النفقۃ… : ۹۹۶، عن ابن عمرو رضی اللہ عنھما ] ¤ ⓫ { مُخْتَالًا فَخُوْرًا: ”مُخْتَالًا“ } جو خرچ کرنے سے پہلے متکبر ہو اور {”فَخُوْرًا“} جو خرچ کرنے کے بعد فخر کرے۔ معلوم ہوا متکبر اور فخر کرنے والا نام و نمود کے لیے خرچ کرے گا، مگر اللہ کی خاطر خرچ نہیں کر سکتا، اس لیے اللہ تعالیٰ بھی اس سے محبت نہیں رکھتا اور یہ بھی معلوم ہوا کہ اکڑنے والے، شیخی باز بخیل ہوتے ہیں، کسی کو اپنے برابر نہیں سمجھتے کہ اس پر خرچ کریں۔ حقیقی سخی متواضع ہوتے ہیں۔ جابر بن سلیم رضی اللہ عنہ بیان کرتے ہیں کہ میں نے عرض کیا : ’’اے اللہ کے رسول! مجھے کوئی وصیت فرمائیے۔‘‘ تو آپ نے (چند اہم امور کا تذکرہ کرنے کے بعد) فرمایا : ’’تہ بند کو نیچے نہ لٹکاؤ، کیونکہ تہ بند کا (ٹخنوں سے نیچے) لٹکانا تکبر کی علامت ہے اور اللہ تعالیٰ تکبر کو پسند نہیں کرتا۔‘‘ [ أحمد : 64/5، ح : ۲۰۶۶۳ ]"
    },
    {
      "Ayah": 37,
      "tafsir": "(آیت 37) اس آیت میں بخل کی مذمت کی گئی ہے اور بخیل کے لیے کافر کا لفظ استعمال کیا ہے، کیونکہ کافر کا معنی چھپانے والا ہے اور بخیل بھی اللہ کی نعمت کو چھپانے والا ہوتا ہے۔ بعض سلف نے اس آیت میں بخل کے لفظ کو یہودیوں کے بخل پر محمول کیا ہے جو رسول اللہ صلی اللہ علیہ وسلم کی صفات اور علامات کو لوگوں سے چھپاتےتے تھے۔ غرض بخل مال کا ہو یا علم کا شدید مذموم ہے۔ (ابن کثیر)"
    },
    {
      "Ayah": 38,
      "tafsir": "(آیت 38) بخیلوں کی مذمت کے بعد اب ریا کاری سے خرچ کرنے والوں کی مذمت کی جا رہی ہے اورانھیں شیطان کا ساتھی قرار دیا گیا ہے۔ حدیث میں ہے کہ تین آدمیوں کو سب سے پہلے آگ میں جھونکا جائے گا اور وہ ہیں : (1) ریا کار عالم (2) ریا کار مجاہد (3) اور ریا کار سخی۔‘‘ [ مسلم، الإمارۃ، باب من قاتل للریاء… : ۱۹۰۵ ] شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’مال دینے میں بخل کرنا جیسا اللہ کے نزدیک برا ہے ویسا ہی خلق کے دکھانے کو دینا۔ قبول وہ ہے جو ان حق داروں کو دے جن کا پہلے ذکر ہو چکا ہے اور پھر اللہ کے یقین اور آخرت کی توقع سے دے۔‘‘ (موضح)"
    },
    {
      "Ayah": 39,
      "tafsir": "(آیت 40،39) بخل اور ریا کاری کی مذمت کے بعد ایمان و طاعت اور صدقہ و خیرات کی ترغیب دلائی، پھر مزید ترغیب کے لیے فرمایا کہ جب ذرا ذرا سی چیز کا اللہ تعالیٰ کئی گنا اجر دیتے ہیں، پھر لوگ کیوں نیک کاموں میں سستی کرتے اور ریا کاری سے کام لے کر اپنے اجر کو ضائع کرتے ہیں۔ اس آیت کریمہ میں اللہ تعالیٰ نے بندوں کو خبر دی ہے کہ وہ کسی پر ایک ذرہ کے برابر بھی ظلم نہیں کرے گا، بلکہ ایک نیکی ہو گی تو اسے بھی بڑھا چڑھا کر اپنے پاس سے اجر عظیم دے کر نجات کا باعث بنا دے گا۔ ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ( ایک طویل حدیث) میں فرمایا : ’’اللہ تعالیٰ ( فرشتوں سے) فرمائے گا، تم جاؤ اور جس کے دل میں رائی کے دانے کے برابر بھی خیر ( یعنی ایمان) کو پاؤ اسے بھی جہنم سے نکال لاؤ، چنانچہ وہ بہت سی مخلوق کو نکال لائیں گے۔‘‘ یہ حدیث بیان کرنے کے بعد ابو سعید رضی اللہ عنہ فرمایا کرتے تھے : ’’اگر تم مجھے اس حدیث میں سچا نہ جانو تو یہ آیت پڑھو : «{ اِنَّ اللّٰهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ وَ اِنْ تَكُ حَسَنَةً يُّضٰعِفْهَا }» [ مسلم، الإیمان، باب معرفۃ الطریق الرؤیۃ : ۱۸۳ ] بے شک اللہ ایک ذرے کے برابر ظلم نہیں کرتا اور اگر ایک نیکی ہو گی تو اسے دگنا کر دے گا اور اپنے پاس سے بہت بڑا اجر عطا کرے گا، یعنی دنیا میں بھی اور آخرت میں بھی۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے قسم کھائی ہے۔"
    },
    {
      "Ayah": 40,
      "tafsir": "(آیت 40،39) بخل اور ریا کاری کی مذمت کے بعد ایمان و طاعت اور صدقہ و خیرات کی ترغیب دلائی، پھر مزید ترغیب کے لیے فرمایا کہ جب ذرا ذرا سی چیز کا اللہ تعالیٰ کئی گنا اجر دیتے ہیں، پھر لوگ کیوں نیک کاموں میں سستی کرتے اور ریا کاری سے کام لے کر اپنے اجر کو ضائع کرتے ہیں۔ اس آیت کریمہ میں اللہ تعالیٰ نے بندوں کو خبر دی ہے کہ وہ کسی پر ایک ذرہ کے برابر بھی ظلم نہیں کرے گا، بلکہ ایک نیکی ہو گی تو اسے بھی بڑھا چڑھا کر اپنے پاس سے اجر عظیم دے کر نجات کا باعث بنا دے گا۔ ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ( ایک طویل حدیث) میں فرمایا : ’’اللہ تعالیٰ ( فرشتوں سے) فرمائے گا، تم جاؤ اور جس کے دل میں رائی کے دانے کے برابر بھی خیر ( یعنی ایمان) کو پاؤ اسے بھی جہنم سے نکال لاؤ، چنانچہ وہ بہت سی مخلوق کو نکال لائیں گے۔‘‘ یہ حدیث بیان کرنے کے بعد ابو سعید رضی اللہ عنہ فرمایا کرتے تھے : ’’اگر تم مجھے اس حدیث میں سچا نہ جانو تو یہ آیت پڑھو : «{ اِنَّ اللّٰهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ وَ اِنْ تَكُ حَسَنَةً يُّضٰعِفْهَا }» [ مسلم، الإیمان، باب معرفۃ الطریق الرؤیۃ : ۱۸۳ ] بے شک اللہ ایک ذرے کے برابر ظلم نہیں کرتا اور اگر ایک نیکی ہو گی تو اسے دگنا کر دے گا اور اپنے پاس سے بہت بڑا اجر عطا کرے گا، یعنی دنیا میں بھی اور آخرت میں بھی۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے قسم کھائی ہے۔"
    },
    {
      "Ayah": 41,
      "tafsir": "(آیت 41) اوپر کی آیتوں میں قیامت کے دن ظلم کی نفی اور کئی گنا اجر کا وعدہ فرمایا، اب یہاں بیان فرمایا جا رہا ہے کہ اچھا یا برا بدلہ پیغمبروں یا ان لوگوں کی گواہی سے ملے گا جن کے ذریعے سے اللہ تعالیٰ نے اپنا پیغام اپنی مخلوق تک پہنچایا ہے، تفصیل کے لیے دیکھیے سورۂ بقرہ (۱۴۳) اور رسول اللہ صلی اللہ علیہ وسلم اپنی امت پر اور پہلی امتوں پر دین پہنچانے کی گواہی دیں گے۔"
    },
    {
      "Ayah": 42,
      "tafsir": "(آیت 42) ➊ { يَوْمَىِٕذٍ يَّوَدُّ الَّذِيْنَ كَفَرُوْا …:} اس سے مقصود کفار کو وعید سنانا ہے جو اس موقع پر آرزو کریں گے کہ کاش ! ہم انسان نہ ہوتے بلکہ زمین میں مل کر خاک ہو جاتے۔ دیکھیے سورۂ نبا کی آخری آیت۔ (ابن کثیر) ¤ ➋ { وَ لَا يَكْتُمُوْنَ اللّٰهَ حَدِيْثًا:} کفار کے متعلق قرآن میں یہ بھی ہے کہ وہ اپنے شرک سے انکار کر دیں گے کہ ہم نے شرک کیا ہی نہیں۔ (انعام : ۲۳ ) مگر یہ آیت اس کے خلاف نہیں ہے، کیونکہ وہ پہلے واقعی شرک کرنے سے انکار کریں گے مگر جب ان کے ہاتھ پاؤں ان کے خلاف گواہی دیں گے (حٰمٓ السجدۃ : ۲۱ تا ۲۳) تو پھر وہ اللہ تعالیٰ سے کوئی چیز چھپا نہ سکیں گے۔ ابن عباس رضی اللہ عنھما نے فرمایا : ’’قیامت کا دن بہت لمبا دن ہے، کسی موقع پر وہ انکار کریں گے اور دوسرے موقع پر اپنے شرک اور بد اعمالی پر افسوس کریں گے۔‘‘ (رازی، ابن کثیر)"
    },
    {
      "Ayah": 43,
      "tafsir": "(آیت 43) ➊ {لَا تَقْرَبُوا الصَّلٰوةَ وَ اَنْتُمْ سُكٰرٰى …:} شراب کی مذمت اور قباحت کے سلسلے میں سب سے پہلے سورۂ بقرہ کی آیت (۲۱۹) نازل ہوئی، جس میں شراب اور جوئے کے گناہ کو ان کے نفع سے بڑا قرار دیا، اس پر بہت سے مسلمانوں نے شراب چھوڑ دی، تاہم بعض بدستور پیتے رہے کہ ہم اس سے نفع اٹھاتے ہیں۔ علی رضی اللہ عنہ بیان کرتے ہیں کہ عبد الرحمن بن عوف رضی اللہ عنہ نے ہمارے لیے کھانا پکایا، پھر ہمیں بلایا اور ہمیں شراب پلائی، شراب نے ہمیں مدہوش کر دیا، اتنے میں نماز کا وقت آ گیا اور انھوں نے مجھے امام بنا دیا، میں نے پڑھا : {”قُلْ يَا أَيُّهَا الْكَافِرُوْنَ لاَ اَعْبُدُ مَا تَعْبُدُوْنَ، وَ نَحْنُ نَعْبُدُ مَا تَعْبُدُوْنَ“} ’’کہہ دے اے کافرو ! میں اس کی عبادت نہیں کرتا جس کی تم کرتے ہو اور ہم اس کی عبادت کرتے ہیں جس کی تم عبادت کرتے ہو۔‘‘ (ظاہر ہے اس سے آیت کے معنی کچھ سے کچھ ہو گئے) تو اس وقت اللہ تعالیٰ نے یہ آیت نازل فرمائی : «{ لَا تَقْرَبُوا الصَّلٰوةَ وَ اَنْتُمْ سُكٰرٰى }» [ ترمذی، تفسیر القرآن، باب و من سورۃ النساء : ۳۰۲۶ و قال حسن صحیح غریب ] اس پر لوگوں نے نماز کے اوقات میں شراب ترک کر دی، یہاں تک کہ سورۂ مائدہ کی آیات (۹۰، ۹۱) نازل ہوئیں، جس سے شراب قطعی طور پر حرام کر دی گئی۔ ( ابن کثیر) بعض علماء نے یہاں { ”وَ اَنْتُمْ سُكٰرٰى“ } (جمع سکران) سے نیند کا غلبہ مراد لیا ہے اور اس کے مناسب صحیح بخاری کی وہ حدیث ذکر کی ہے جس میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے نیند کی حالت میں نماز سے منع فرمایا کہ معلوم نہیں کیا پڑھے اور کیا نہ پڑھے، مگر صحیح یہ ہے کہ اس سے شراب کا نشہ مراد ہے اور یہی جمہور صحابہ و تابعین کا قول ہے، نیز تمام مفسرین اس پر متفق ہیں کہ یہ آیت شراب نوشی سے متعلق نازل ہوئی۔ ¤ ➋ { وَ لَا جُنُبًا اِلَّا عَابِرِيْ سَبِيْلٍ:} بعض مفسرین نے اس سے مراد سفر لیا ہے مگر سفر کا ذکر { ”اَوْ عَلٰى سَفَرٍ“ } آگے آ رہا ہے اس تفسیر کی بنا پر سفر کے ذکر میں تکرار لازم آتا ہے، اس لیے اکثر سلف نے اس کا مفہوم یہ بیان کیا ہے کہ { ”الصَّلٰوةَ“ } سے مراد نماز کی جگہ یعنی مسجد ہے، مطلب یہ ہے کہ جنابت کی حالت میں {’’ الصَّلٰوةَ ‘‘} یعنی نماز کی جگہوں (مسجدوں) میں نہ جاؤ۔ ہاں، اگر مسجد سے گزرنا پڑے تو مجبوری کی صورت میں گزر سکتے ہو ( ٹھہر نہیں سکتے)۔ ابن جریر رحمہ اللہ نے اسے راجح قرار دیا ہے، پس یہاں مضاف محذوف ہے، یعنی { ”لَا تَقْرَبُوْا مَوَاضِعَ الصَّلاَةِ“ } (طبری) اور یہی جمہور علماء کا مسلک ہے کہ جنبی یا حائضہ کے لیے مسجد سے گزرنا جائز ہے، ٹھہرنا جائز نہیں، کیونکہ بہت سے صحابہ کے گھروں کے دروازے مسجد کی طرف کھلتے تھے، ان کے لیے غسل کر کے گزرنا مشکل تھا تو اس پر یہ آیت نازل ہوئی۔ مگر آخر میں رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر صدیق رضی اللہ عنہ کے دریچے کے سوا مسجد میں کھلنے والے تمام دریچے بند کروا دیے۔ [ بخاری، الصلاۃ، باب الخوخۃ … : ۴۶۷، عن ابن عباس رضی اللہ عنھما ] بعض لوگوں نے علی رضی اللہ عنہ کا دروازہ کھلا رکھنے کی روایت بھی بیان کی ہے، مگر اہل علم نے اسے ضعیف کہا ہے۔ (ابن کثیر) خلاصہ یہ کہ مراد اس سے یہ ہے کہ جنبی مسجد سے گزر سکتا ہے، ٹھہر نہیں سکتا۔ گویا آیت کے دو حصے ہیں، پہلے حصے : «{ لَا تَقْرَبُوا الصَّلٰوةَ وَ اَنْتُمْ سُكٰرٰى }» اس میں { ”الصَّلٰوةَ“ } سے مراد نماز ہی ہے کہ نشہ کی حالت میں نماز کے قریب نہ جاؤ اور دوسرے حصے : «{ وَ لَا جُنُبًا اِلَّا عَابِرِيْ سَبِيْلٍ حَتّٰى تَغْتَسِلُوْا }» میں { ”لَا تَقْرَبُوا الصَّلٰوةَ“ } سے مراد نماز کی جگہ ہے، یعنی اس جنبی ہونے کی حالت میں مسجد کے قریب نہ جاؤ، الا یہ کہ راستہ عبور کر کے گزر جانے والے ہو۔ (طنطاوی) ¤ ➌ { وَ اِنْ كُنْتُمْ مَّرْضٰۤى اَوْ عَلٰى سَفَرٍ … : } سفر سے مراد مطلق سفر ہے، اکثر علماء کے نزدیک تیمم کے جواز کے لیے اتنے سفر کی کوئی شرط نہیں جس میں نماز قصر پڑھی جا سکتی ہے۔ ’’ یا تم میں سے کوئی قضائے حاجت سے آیا ہو‘‘ کے تحت ہر وہ چیز آ جاتی ہے جس سے وضو ٹوٹ جاتا ہے۔ عورتوں کو چھونے یا مباشرت سے مراد (راجح مسلک کی بنا پر) جماع ہے، ورنہ صرف چھونے سے وضو نہیں ٹوٹتا، چنانچہ عائشہ رضی اللہ عنھا سے روایت ہے کہ میں گھر میں لیٹی ہوتی، آپ صلی اللہ علیہ وسلم نفل نماز پڑھتے تو سجدہ کے وقت آپ صلی اللہ علیہ وسلم اپنے ہاتھ سے میرے پاؤں سامنے سے ہٹا دیتے۔ [ بخاری، الصلوۃ، باب التطوع خلف المرأۃ : ۵۱۳، ۵۱۴۔ مسلم : ۴۸۶ ] { ”اَوْ عَلٰى سَفَرٍ“ } کا مقصد ہے کہ سفر میں پینے کے لیے تو پانی ہے مگر وضو یا غسل کے لیے نہیں۔ بیماری کا مطلب یہ ہے کہ پانی کے استعمال سے بیمار ہونے یا بیماری بڑھنے کا خطرہ ہے۔ عمرو بن عاص رضی اللہ عنہ کو ایک سرد رات میں احتلام ہوگیا، انھوں نے تیمم کر لیا اور یہ آیت پڑھی : «{ وَ لَا تَقْتُلُوْۤا اَنْفُسَكُمْ اِنَّ اللّٰهَ كَانَ بِكُمْ رَحِيْمًا }» [النساء : ۲۹ ] ’’ اور اپنے آپ کو قتل نہ کرو، بے شک اللہ تم پر ہمیشہ سے بے حد مہربان ہے۔‘‘ نبی صلی اللہ علیہ وسلم سے اس کا ذکر کیا گیا تو آپ نے کوئی ڈانٹ ڈپٹ نہیں کی۔ [ بخاری، التیمم، باب إذا خاف الجنب علی نفسہ المرض…، قبل ح : ۳۴۵، تعلیقاً ] ¤ ➍ { فَلَمْ تَجِدُوْا مَآءً:} پانی نہ پانے میں یہ صورت بھی شامل ہے کہ پانی میسر ہی نہ ہو اور یہ بھی کہ بیماری یا عذر کی بنا پر پانی استعمال نہ کیا جا سکے۔ ¤ ➎ {فَتَيَمَّمُوْا صَعِيْدًا طَيِّبًا …:} تیمم کا معنی ہے قصد کرنا۔ { ”صَعِيْدًا طَيِّبًا“ } سے مراد پاک مٹی ہے، خواہ کپڑے، کاغذ یا کسی جگہ کی گرد سے حاصل ہو جائے۔ اس کی تائید صحیح مسلم کی اس حدیث سے ہوتی ہے کہ جس میں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہمیں تین باتوں میں لوگوں پر فضیلت دی گئی ہے، جن میں سے ایک یہ ہے : [ وَ جُعِلَتْ تُرْبَتُهَا لَنَا طَهُوْرًا إِذَا لَمْ نَجِدِ الْمَاءَ] ’’جب ہمیں پانی نہ ملے تو زمین کی مٹی ہمارے لیے پاک کرنے والی بنا دی گئی ہے۔‘‘ [ مسلم، المساجد، باب المساجد ومواضع الصلٰوۃ : ۵۲۲ ] تیمم خواہ وضو کے لیے ہو یا غسل کے لیے، دونوں کا ایک ہی طریقہ ہے، صرف نیت مختلف ہو گی۔ عمار بن یاسر رضی اللہ عنھما سے روایت ہے کہ ایک جہادی سفر میں انھیں احتلام ہو گیا تو انھوں نے زمین پر لوٹ پوٹ ہو کر نماز پڑھ لی، جب رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوئے تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ تمھیں اتنا ہی کافی تھا۔‘‘ چنانچہ آپ صلی اللہ علیہ وسلم نے اپنے ہاتھوں کو زمین پر مارا، پھر ان میں پھونک مار کر انھیں اپنے چہرے اور دونوں ہتھیلیوں پر مل لیا۔ [ بخاری، التیمم ، باب المتیمم ھل ینفخ فیھما ؟ : ۳۳۸ ] ¤ اس سے معلوم ہوا کہ خود رسول اللہ صلی اللہ علیہ وسلم کا بتایا ہوا تیمم کا طریقہ یہی ہے کہ صرف ایک دفعہ زمین پر ہاتھ مار کر اس میں پھونک مار کر چہرے اور ہتھیلیوں پر مل لیا جائے۔ بعض احادیث میں دو دفعہ زمین پر ہاتھ مارنے کا اور کہنیوں تک ملنے کا ذکر ہے، مگر وہ احادیث یا تو صحابہ کا اجتہاد ہیں یا کمزور ہیں، رسول اللہ صلی اللہ علیہ وسلم سے صحیح ترین حدیث وہی ہے جو عمار بن یاسر رضی اللہ عنھما سے آئی ہے۔"
    },
    {
      "Ayah": 44,
      "tafsir": "(آیت 45،44) ➊ { اَلَمْ تَرَ اِلَى الَّذِيْنَ اُوْتُوْا نَصِيْبًا:} اس سے پہلے «{ وَ اعْبُدُوا اللّٰهَ وَ لَا تُشْرِكُوْا بِهٖ شَيْـًٔا }» میں مشرکین کے طرزکے طرزِ عمل سے متنبہ کرنے کے بعد درمیان میں ضرورت کے کچھ مسائل، مثلاً شراب، نماز اور تیمم وغیرہ ذکر کرنے کے بعد یہود کے فریب اور ان کی دشمنی کا ذکر تفصیل سے شروع ہو گیا ہے۔ یہود کو تیمم میں بھی مسلمانوں سے حسد تھا۔ اسی حسد کی بنا پر وہ خود مسلمان ہونے کے بجائے چاہتے تھے کہ مسلمان بھی کافر ہو جائیں۔ چنانچہ اللہ تعالیٰ نے فرمایا : «{ وَدَّ كَثِيْرٌ مِّنْ اَهْلِ الْكِتٰبِ لَوْ يَرُدُّوْنَكُمْ مِّنْۢ بَعْدِ اِيْمَانِكُمْ كُفَّارًا حَسَدًا مِّنْ عِنْدِ اَنْفُسِهِمْ }» [ البقرۃ : ۱۰۹ ] ’’بہت سے اہل کتاب چاہتے ہیں کہ کاش! وہ تمھیں تمھارے ایمان کے بعد پھر کافر بنا دیں، اپنے دلوں کے حسد کی وجہ سے۔‘‘ ¤ ➋ { اُوْتُوْا نَصِيْبًا مِّنَ الْكِتٰبِ:} یعنی انھیں کتاب کا کچھ حصہ ہی ملا ہے، باقی ضائع کر بیٹھے ہیں اور یہ بھی مراد ہے کہ جو حصہ ملا ہے اس کے الفاظ ملے ہیں، عمل کا حصہ عطا نہیں ہوا اور یہ بھی کہ تورات میں انھوں نے موسیٰ علیہ السلام کی نبوت تو معلوم کر لی مگر رسول اللہ صلی اللہ علیہ وسلم کی نبوت معلوم نہ کر سکے۔"
    },
    {
      "Ayah": 45,
      "tafsir": "(آیت 45،44) ➊ { اَلَمْ تَرَ اِلَى الَّذِيْنَ اُوْتُوْا نَصِيْبًا:} اس سے پہلے «{ وَ اعْبُدُوا اللّٰهَ وَ لَا تُشْرِكُوْا بِهٖ شَيْـًٔا }» میں مشرکین کے طرزکے طرزِ عمل سے متنبہ کرنے کے بعد درمیان میں ضرورت کے کچھ مسائل، مثلاً شراب، نماز اور تیمم وغیرہ ذکر کرنے کے بعد یہود کے فریب اور ان کی دشمنی کا ذکر تفصیل سے شروع ہو گیا ہے۔ یہود کو تیمم میں بھی مسلمانوں سے حسد تھا۔ اسی حسد کی بنا پر وہ خود مسلمان ہونے کے بجائے چاہتے تھے کہ مسلمان بھی کافر ہو جائیں۔ چنانچہ اللہ تعالیٰ نے فرمایا : «{ وَدَّ كَثِيْرٌ مِّنْ اَهْلِ الْكِتٰبِ لَوْ يَرُدُّوْنَكُمْ مِّنْۢ بَعْدِ اِيْمَانِكُمْ كُفَّارًا حَسَدًا مِّنْ عِنْدِ اَنْفُسِهِمْ }» [ البقرۃ : ۱۰۹ ] ’’بہت سے اہل کتاب چاہتے ہیں کہ کاش! وہ تمھیں تمھارے ایمان کے بعد پھر کافر بنا دیں، اپنے دلوں کے حسد کی وجہ سے۔‘‘ ¤ ➋ { اُوْتُوْا نَصِيْبًا مِّنَ الْكِتٰبِ:} یعنی انھیں کتاب کا کچھ حصہ ہی ملا ہے، باقی ضائع کر بیٹھے ہیں اور یہ بھی مراد ہے کہ جو حصہ ملا ہے اس کے الفاظ ملے ہیں، عمل کا حصہ عطا نہیں ہوا اور یہ بھی کہ تورات میں انھوں نے موسیٰ علیہ السلام کی نبوت تو معلوم کر لی مگر رسول اللہ صلی اللہ علیہ وسلم کی نبوت معلوم نہ کر سکے۔"
    },
    {
      "Ayah": 46,
      "tafsir": "(آیت 46) ➊ { مِنَ الَّذِيْنَ هَادُوْا يُحَرِّفُوْنَ …:} اوپر کی آیت میں فرمایا کہ وہ گمراہی مول لیتے ہیں، اب اس آیت میں چند امور کے ساتھ اس گمراہی کی تشریح فرمائی۔ یعنی وہ تورات کے احکام میں تحریف کرتے ہیں۔ دیکھیے سورۂ مائدہ (۱۳، 41)۔سورۂ مائدہ میں { ”عَنْ مَّوَاضِعِهٖ“ } کے علاوہ { ”مِنْ بَعْدِمَّوَاضِعِهٖ“ } بھی ہے، جس کا معنی تحریف لفظی ہے، یہاں { ”عَنْ مَّوَاضِعِهٖ“ } ہے، اس سے مراد تحریف معنوی ہے، یعنی تاویلات فاسدہ سے کام لیتے ہیں،، مثلاً قصۂ ذبیح کا تعلق اسماعیل علیہ السلام کے بجائے اسحاق علیہ السلام کے ساتھ جوڑنا۔ (رازی، شوکانی) ہمارے زمانے میں بھی تمام بدعتیوں کا شیوہ ہو گیا ہے کہ جو آیت یا حدیث امام، مجتہد یا پیرو مرشد کے قول کے خلاف نظر آتی ہے، اس کی تاویل کرتے ہیں اور اللہ تعالیٰ سے حیا نہیں کرتے کہ پیرو مرشد اور امام و مجتہد تو معصوم نہ تھے، بخلاف پیغمبر کے کہ خطا سے ان کی حفاظت خود اللہ تعالیٰ فرماتا تھا۔ (وحیدی) ¤ ➋ { لَيًّۢا بِاَلْسِنَتِهِمْ: ”لَيًّۢا“ } یہ {’’ لَوَي يَلْوِيْ لَيًّا ‘‘} سے ہے، بمعنی توڑنا مروڑنا، یعنی زبان کو توڑ مروڑ کر { ”رَاعِيْنَا“ } کہتے، جو توہین کا کلمہ ہے۔ دیکھیے بقرہ (۱۰۴) ان کی ایک گمراہی یہ ہے کہ جب رسول اللہ صلی اللہ علیہ وسلم سے کوئی حکم سنتے ہیں تو ظاہر میں {’’ سَمِعْنَا ‘‘} کہتے ہیں (یعنی ہم نے سنا) مگر ساتھ ہی بے حد عداوت کی وجہ سے {”عَصَيْنَا“ } (نہیں مانا) بھی کہہ دیتے ہیں۔ اسی طرح آپ صلی اللہ علیہ وسلم سے کوئی بات کرتے تو کہتے {’’ اسْمَعْ غَيْرَ مُسْمَعٍ ‘‘} (سنو، تمھیں کوئی نہ سنائے) ظاہر میں یہ نیک دعا ہے کہ تم ہمیشہ غالب رہو، کوئی تمھیں بری بات نہ سنا سکے اور دل میں نیت رکھتے کہ تو بہرا ہو جائے، سن نہ سکے، ایسی شرارت کرتے۔ (رازی، ابن کثیر) ¤ ➌ { وَ طَعْنًا فِي الدِّيْنِ:} یعنی یہ سب حرکتیں کر رہے ہیں اور پھر دین میں طعن کی غرض سے کہتے ہیں کہ اگر یہ شخص نبی ہوتا تو ہمارا فریب معلوم کر لیتا، اس پر اللہ تعالیٰ نے ان کے خبث باطن کو ظاہر فرما دیا اور وہی طعن الٹا رسول اللہ صلی اللہ علیہ وسلم کی نبوت کے سچا ہونے کی پختہ دلیل بن گیا۔ (رازی) ¤ ➍ { وَ لَوْ اَنَّهُمْ قَالُوْا سَمِعْنَا وَ اَطَعْنَا … :} یعنی یہ اگر اس قسم کی حرکات اور طعن کے بجائے ایسے کلمات استعمال کرتے جن میں شرارت کی آمیزش نہیں ہو سکتی اور اخلاص سے پیش آتے، مثلاً { ”عَصَيْنَا“ } کے بجائے { ”اَطَعْنَا“ } اور { ”غَيْرَ مُسْمَعٍ“ } کے بجائے صرف { ”اسْمَعْ“ } اور { ”رَاعِنَا“ } کے بجائے { ”انْظُرْنَا“ } تو ان کے حق میں بہتر ہوتا، مگر افسوس کہ یہ بہت ہی تھوڑے احکام پر ایمان رکھتے ہیں۔ پس {”قَلِيْلًا“} یہاں مصدر محذوف { ”إِيْمَانًا“ } کی صفت ہے اور یہ معنی بھی ہے کہ ان میں سے بہت ہی کم لوگ ایمان لاتے ہیں، حتیٰ کہ یہودیوں میں سے دس بھی بمشکل ایمان لائے ہوں گے۔"
    },
    {
      "Ayah": 47,
      "tafsir": "(آیت 47) { يٰۤاَيُّهَا الَّذِيْنَ اُوْتُوا الْكِتٰبَ … :} یہود کی شرارتوں کو بیان کرنے کے بعد اب اس آیت میں انھیں ایمان کی دعوت دی اور ہٹ دھرمی سے احکام خداوندی بجا نہ لانے پر وعید سنائی، کیونکہ یہود عالم تھے اور علم و معرفت کے باوجود ہٹ دھرمی سے کام لے رہے تھے۔ (رازی) اس وعید کا تعلق یا تو قیامت کے دن سے ہے، یا دنیا میں چہروں کو مسخ کر دینا مراد ہے اور اصحاب سبت جیسی لعنت سے مراد یہ ہے کہ جس طرح ان کو بندر اور خنزیر بنا دیا تھا، تمھیں بھی ویسا ہی بنا دیا جائے۔ اصحاب سبت کے قصہ کے لیے دیکھیے سورۂ اعراف (۱۶۳)۔ اس وقت یہودی ہوں یا نصرانی یا مسلمان سب رسول اللہ صلی اللہ علیہ وسلم کی امت ہیں، کلمہ پڑھنے والے امت اجابت، یعنی قبول کر لینے والے ہیں اور دوسرے امت دعوت، یعنی جو آپ کی دعوت کے مخاطب ہیں۔ رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے : [ بَيْنَ يَدَيِ السَّاعَةِ مَسْخٌ وَ خَسْفٌ وَ قَذْفٌ ] [ ابن ماجہ، الفتن، باب الخسوف : ۴۰۵۹، عن ابن مسعود رضی اللہ عنہ ۔ صحیح الجامع للألبانی : ۲۸۵۶ ] ’’قیامت سے پہلے شکلوں کے بدل جانے، زمین میں دھنس جانا اور پتھروں کی بارش کے واقعات رونما ہوں گے۔‘‘ اور سہل بن سعد رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ سَيَكُوْنُ فِيْ آخِرِ الزَّمَانِ خَسْفٌ وَ قَذْفٌ وَ مَسْخٌ، قِيْلَ وَ مَتٰي ذٰلِكَ يَا رَسُوْلَ اللّٰهِ !؟ قَالَ إِذَا ظَهَرَتِ الْمَعَازِفُ وَالْقَيْنَاتُ وَاسْتُحِلَّتتِ الْخَمْرُ ] [ المعجم الکبیر : ۶؍۱۵۰، ح : ۵۸۱۰۔ صحیح الجامع للألبانی : ۳۶۶۵ ] ’’ آخر زمانے میں زمین میں دھنسنا، پتھروں کی بارش اور شکلوں کا بدل جانا واقع ہو گا۔‘‘ پوچھا گیا : ’’اے اللہ کے رسول! یہ کب ہو گا؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا ـ: ’’جب باجے گاجے اور گانے والیاں عام ہو جائیں گی اور شراب حلال کر لی جائے گی۔‘‘ اب بھی اہل کتاب اور ان کی روش پر چلنے والے مسلمانوں کو ان عذابوں سے ڈر کر توبہ کرنی چاہیے۔"
    },
    {
      "Ayah": 48,
      "tafsir": "(آیت 48) ➊ {اِنَّ اللّٰهَ لَا يَغْفِرُ … :} یہود کو وعید اور ڈانٹ سنانے کے بعد اب اس آیت میں اشارہ فرمایا کہ یہ وعید ایمان نہ لانے اور کفر و شرک کی وجہ سے ہے، ورنہ دوسرے گناہ تو قابل معافی ہیں اور اللہ تعالیٰ کی مرضی کے تحت ہیں، جسے اللہ چاہے گا معاف فرما دے گا، جسے چاہے گا سزا دے کر چھوڑ دے گا، مگر شرک کی معافی نہیں، کیونکہ مشرک پر اللہ تعالیٰ نے جنت حرام کر دی ہے۔ (دیکھیے مائدہ : ۷۲) یہود و نصاریٰ کی طرح نام کے مسلمان، جو ایسے شرک کا ارتکاب کرتے ہیں جس سے انسان ملت اسلام سے خارج ہو جاتا ہے، جو مصیبت کے وقت غیر اللہ کو پکارتے، اٹھتے بیٹھتے ان کے نام کا وظیفہ کرتے ہیں، ان کے نام کا روزہ رکھتے، ان کی قبروں کو پوجتے، ان کے نام پر جانور ذبح کرتے اور ان کی منتیں مانتے ہیں، وہ بھی اس وعید کے مصداق ہیں۔ مزید دیکھیے سورۂ حج(۳۱)، سورۂ لقمان(۱۳)، سورۂ انعام (۸۸)، سورۂ زمر (۶۵) اور سورۂ نساء (۱۱۶)۔ ¤ ➋ { فَقَدِ افْتَرٰۤى اِثْمًا عَظِيْمًا:} اس سے بڑا جھوٹ کیا ہو گا کہ اللہ تعالیٰ کا بھی کوئی شریک ہے، فرمایا : «{ اِنَّ الشِّرْكَ لَظُلْمٌ عَظِيْمٌ }» [ لقمان: ۱۳] ’’بے شک شرک یقینا بہت بڑا ظلم ہے۔‘‘"
    },
    {
      "Ayah": 49,
      "tafsir": "(آیت 49) {”فَتِيْلًا“} اس پتلے دھاگے کو کہتے ہیں جو کھجور کی گٹھلی کے کٹاؤ میں نظر آتا ہے۔ یہ محاورہ ہے جس کے معنی یہ ہیں کہ ان پر ذرہ برابر ظلم نہیں ہو گا۔ (طبری) یہود اپنے آپ کو پاک باز اور مقدس کہتے، کبھی کہتے جنت میں ہم ہی جائیں گے : «{ لَنْ يَّدْخُلَ الْجَنَّةَ اِلَّا مَنْ كَانَ هُوْدًا اَوْ نَصٰرٰى }» [ البقرۃ : ۱۱۱ ] ’’جنت میں ہر گز داخل نہیں ہوں گے مگر جو یہودی ہوں گے یا نصاریٰ۔‘‘ کبھی اپنے آپ کو اللہ کے بیٹے اور اس کے محبوب بتاتے۔ (دیکھیے مائدہ :۱۸) اللہ تعالیٰ نے ان کی تردید فرمائی کہ کسی کو پاک باز قرار دینا تو اللہ کا کام ہے، اپنی تعریف آپ کرنا انسان کے لیے مہلک ہے، چنانچہ اللہ تعالیٰ نے فرمایا : «{ فَلَا تُزَكُّوْۤا اَنْفُسَكُمْ هُوَ اَعْلَمُ بِمَنِ اتَّقٰى }» [ النجم : ۳۲ ] ’’اپنے آپ کو پاک مت قرار دو، وہ زیادہ جانتا ہے کون متقی ہے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے ایک دوسرے کی تعریف سے بھی، خصوصاً جب کوئی سامنے ہو یا مبالغہ کے ساتھ ہو منع فرمایا۔ مقداد بن اسود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا: [ أَنْ نَحْثِيَ فِيْ وُجُوْهِ الْمَدَّاحِيْنَ التُّرَابَ ] [ مسلم، الزھد، باب النھی عن المدح… : ۳۰۰۲ ] ’’ہم زیادہ تعریف کرنے والوں کے منہ میں مٹی ڈال دیں۔‘‘ اور فرمایا : [ إِيَّاكُمْ وَالتَّمَادُحَ فَإِنَّهُ ذَبْحٌ ] [ ابن ماجہ، الأدب، باب المدح : ۳۷۴۳ ] ’’باہمی مدح گوئی سے بچو کیونکہ یہ ذبح کرنا ہے۔‘‘ ایک حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو دوسرے کی تعریف کرتے ہوئے سنا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ وَيْحَكَ قَطَعْتَ عُنُقَ صَاحِبِكَ ] ’’تجھ پر افسوس! تو نے اپنے ساتھی کی گردن کاٹ دی۔‘‘ پھر فرمایا : ’’ اگر تم میں سے کسی کو کسی کی لا محالہ تعریف کرنی ہے تو اس طرح کہا کرے کہ میں اسے اس طرح گمان کرتا ہوں، اللہ کے سامنے کسی کا تزکیہ نہ کرے (پاک قرار نہ دے)۔‘‘ [ بخاری، الأدب، باب ما یکرہ من التمادح : ۶۰۶۱ ]"
    },
    {
      "Ayah": 50,
      "tafsir": "(آیت 50) {وَ كَفٰى بِهٖۤ اِثْمًا مُّبِيْنًا:} یعنی ان کے یہ جھوٹے دعوے اور اللہ تعالیٰ پر افترا ہی ان کے سخت گناہ گار ہونے کے لیے کافی ہے۔"
    },
    {
      "Ayah": 51,
      "tafsir": "(آیت 52،51) ➊ { اَلَمْ تَرَ اِلَى الَّذِيْنَ اُوْتُوْا نَصِيْبًا مِّنَ الْكِتٰبِ … :} عمر فاروق رضی اللہ عنہ نے فرمایا : ’’جبت سے مراد جادو اور طاغوت سے مراد شیطان ہے۔‘‘ [ بخاری، التفسیر، باب قولہ : «و إن کنتم مرضی أو علی سفر» قبل ح : ۴۵۸۳، معلقًا ] جوہری نے الصحاح میں فرمایا : جبت کا لفظ بت، کاہن، جادوگر اور اس قسم کی دوسری چیزوں پر استعمال ہوتا ہے۔‘‘ اسی طرح ایک حدیث میں آیا ہے کہ پرندوں کو اڑا کر شگون لینا اور زمین پر لکیریں کھینچ کرفال گیری کرنا جبت میں شامل ہے۔ [ أبو داوٗد، الطب، باب فی الخط وزجر الطیر : ۳۹۰۷ ] اور طاغوت سے مراد شیطان ہے اور ہر وہ شخص جو گناہ کی دعوت دے اس پر یہ لفظ بولا جاتا ہے۔ عرب میں بتوں کے ترجمان ہوتے تھے، جو ان کی زبان سے جھوٹ نقل کرتے اور لوگوں کو گمراہ کرتے، ان کو طاغوت کہا جاتا تھا۔ مزید دیکھیے سورۂ بقرہ (۲۵۲)۔ ¤ ➋ یہودیوں کی رسول اللہ صلی اللہ علیہ وسلم سے مخالفت ہوئی تو انھوں نے مشرکین مکہ سے رابطہ قائم کر لیا اور ان سے کہنے لگے کہ تمھارا دین مسلمانوں کے دین سے بہتر ہے۔ یہ سب کچھ اس حسد کی وجہ سے تھا کہ نبوت اور ریاستِ دینی ہمارے سوا دوسروں کو کیوں مل گئی، اللہ تعالیٰ نے ان آیات میں ان کو الزام دیا۔"
    },
    {
      "Ayah": 52,
      "tafsir": "(آیت 52،51) ➊ { اَلَمْ تَرَ اِلَى الَّذِيْنَ اُوْتُوْا نَصِيْبًا مِّنَ الْكِتٰبِ … :} عمر فاروق رضی اللہ عنہ نے فرمایا : ’’جبت سے مراد جادو اور طاغوت سے مراد شیطان ہے۔‘‘ [ بخاری، التفسیر، باب قولہ : «و إن کنتم مرضی أو علی سفر» قبل ح : ۴۵۸۳، معلقًا ] جوہری نے الصحاح میں فرمایا : جبت کا لفظ بت، کاہن، جادوگر اور اس قسم کی دوسری چیزوں پر استعمال ہوتا ہے۔‘‘ اسی طرح ایک حدیث میں آیا ہے کہ پرندوں کو اڑا کر شگون لینا اور زمین پر لکیریں کھینچ کرفال گیری کرنا جبت میں شامل ہے۔ [ أبو داوٗد، الطب، باب فی الخط وزجر الطیر : ۳۹۰۷ ] اور طاغوت سے مراد شیطان ہے اور ہر وہ شخص جو گناہ کی دعوت دے اس پر یہ لفظ بولا جاتا ہے۔ عرب میں بتوں کے ترجمان ہوتے تھے، جو ان کی زبان سے جھوٹ نقل کرتے اور لوگوں کو گمراہ کرتے، ان کو طاغوت کہا جاتا تھا۔ مزید دیکھیے سورۂ بقرہ (۲۵۲)۔ ¤ ➋ یہودیوں کی رسول اللہ صلی اللہ علیہ وسلم سے مخالفت ہوئی تو انھوں نے مشرکین مکہ سے رابطہ قائم کر لیا اور ان سے کہنے لگے کہ تمھارا دین مسلمانوں کے دین سے بہتر ہے۔ یہ سب کچھ اس حسد کی وجہ سے تھا کہ نبوت اور ریاستِ دینی ہمارے سوا دوسروں کو کیوں مل گئی، اللہ تعالیٰ نے ان آیات میں ان کو الزام دیا۔"
    },
    {
      "Ayah": 53,
      "tafsir": "(آیت 53) اوپر کی آیت میں یہود کی جہالت بیان کی کہ وہ بتوں کی پوجا کو اللہ واحد کی عبادت پر ترجیح دیتے ہیں، اس آیت میں ان کے بخل اور حسد کو بیان فرمایا۔ بخل تو یہ ہے کہ جو نعمت اللہ تعالیٰ نے کسی کو دی ہو دوسروں سے اسے روک لینا اور حسد یہ ہے کہ جو نعمت اللہ تعالیٰ نے دوسروں کو دی ہے اس پر جلے بھنے اور آرزو کرے کہ اس سے چھن جائے، پھر خواہ مجھے ملے یا نہ ملے۔ پس حسد اور بخل دونوں میں یہ بات قدرے مشترک ہے کہ دوسروں سے نعمت کو روکنا اور یہ گوارا نہ کرنا کہ اپنی ذات کے سوا دوسروں کو بھی فائدہ پہنچے۔ (کبیر، قرطبی) یہود میں یہ دونوں صفتیں اتم اور اکمل طور پر پائی جاتی تھیں، قرآن نے بتایا کہ یہ مسلمانوں سے حسد کرتے ہیں اور ان کے بخل کا یہ حال ہے کہ اگر اللہ تعالیٰ کے ملک و سلطنت میں ان کو کچھ اختیار ہوتا تو کسی کو ’’تل برابر‘‘ بھی نہ دیتے۔ {”نَقِيْرًا“} دراصل اس نقطے کو کہتے ہیں جو گٹھلی کی پشت پر ہوتا ہے اور یہ قلت میں ضرب المثل ہے۔"
    },
    {
      "Ayah": 54,
      "tafsir": "(آیت 54) مطلب یہ ہے کہ ابراہیم علیہ السلام کے بیٹے اسحاق علیہ السلام کی اولاد میں مدت دراز تک نبوت اور بادشاہت رہی ہے اور داؤد و سلیمان علیھما السلام اور دوسرے اولوا العزم پیغمبر ہو گزرے ہیں، اب بنو اسماعیل میں سے رسول اللہ صلی اللہ علیہ وسلم کو نبوت و رسالت سے سرفراز فرما دیا گیا ہے تو یہ کیوں حسد کر رہے ہیں؟! یہاں { ”مِنْ فَضْلِهٖ“ } سے مراد نبوت اور دین و دنیا کی وہ عزت ہے جو نبوت کی برکت سے حاصل ہوئی۔ { ”الْكِتٰبَ“ } سے مراد کتاب الٰہی اور { ”وَ الْحِكْمَةَ“ } سے اس کا فہم اور اس پر عمل کرنا مراد ہے اور {”مُلْكًا عَظِيْمًا“} سے مراد سلطنت اور غلبہ و اقتدار ہے۔ (رازی، ابن کثیر)"
    },
    {
      "Ayah": 55,
      "tafsir": "(آیت 55) { ”اٰمَنَ بِهٖ“ } میں { ”بِهٖ“ } کی ضمیر{’’ اِيْتَاءٌ ‘‘} کی طرف بھی راجع ہو سکتی ہے جو {”اٰتَيْنَاۤ“} سے مفہوم ہوتا ہے، یعنی بعض تو اس ایتائے انعام (انعام دینے) پر ایمان لے آئے اور بعض اس سے منہ موڑ گئے اور لوگوں کو بھی روکنے کی کوشش کی ( {صَدَّ عَنْهُ} کے دونوں معنی ہیں، منہ موڑنا اور روکنا) لہٰذا آپ ان کے کفر سے دل گیر نہ ہوں۔ (ابن کثیر) اگر اس ضمیر کا مرجع رسول اللہ صلی اللہ علیہ وسلم کو مانا جائے تو معنی یہ ہوں گے کہ یہ سب کچھ دیکھ لینے کے باوجود یہود میں سے کچھ لوگ تو آپ صلی اللہ علیہ وسلم پر ایمان لے آئے، لیکن اکثر نہ صرف خود ایمان نہیں لائے بلکہ جو ایمان لانا چاہتے ہیں انھیں بھی روکنا چاہتے ہیں، ایسے لوگوں کی سزا کے لیے جہنم کافی ہے۔ ( فتح القدیر، کبیر)"
    },
    {
      "Ayah": 56,
      "tafsir": "(آیت 56) {اِنَّ الَّذِيْنَ كَفَرُوْا بِاٰيٰتِنَا …:} یہاں بتایا کہ یہ سزا اہل کتاب کے ایک گروہ کے ساتھ مخصوص نہیں ہے، بلکہ سب کفار کو ملے گی۔ (رازی) «{ بَدَّلْنٰهُمْ جُلُوْدًا غَيْرَهَا }» سے اہل جہنم کے عذاب کی سختی بیان کرنا مقصود ہے، اللہ ہی بہتر جانتا ہے کہ اتنی تیز آگ میں ان کے چمڑے ایک ایک لمحے میں کتنی کتنی بار جل کر دوبارہ تبدیل ہوں گے، البتہ یہ تو صحیح احادیث سے ثابت ہے کہ جہنمیوں کا جسم بہت بڑھا دیا جائے گا، حدیث میں ہے : ’’کافر کے کان کی کونپل اور کندھے کے درمیان ستر سال کا فاصلہ ہو گا۔‘‘ [ أحمد : ۶؍۱۱۶، ۱۱۷، ح : ۲۴۹۰۹ و سندہ صحیح۔ ہدایۃ المستنیر ] اور اسی طرح فرمایا : ’’کافر کی داڑھ احد پہاڑ کے برابر ہو گی اور اس کی جلد کی موٹائی تین دن کے فاصلے کے برابر ہو گی۔‘‘ [ مسلم، الجنۃ و صفۃ نعیمھا و أھلھا : ۲۸۵۱ ]اس طرح انھیں دائمی عذاب ہوتا رہے گا۔"
    },
    {
      "Ayah": 57,
      "tafsir": "(آیت 57) ➊ {وَ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ …: } قرآن پاک میں عموماً وعدہ اور وعید کو ایک ساتھ بیان فرمایا گیا ہے اور اس اسلوب کی وجہ سے قرآن کو {”كِتٰبًا مُّتَشَابِهًا“} فرمایا ہے اور وعظ و تذکیر کا یہ مؤثر ترین انداز ہے۔ بعض نے اس آیت سے سمجھا ہے کہ عمل صالح ایمان سے الگ چیز ہے، کیونکہ یہ دونوں عطف کے ساتھ آئے ہیں، مگر قرآن نے متعدد آیات میں عمل صالح پر زور دینے کے لیے عمل صالح کو الگ عطف کے ساتھ بیان کر دیا ہے، ورنہ یہ بھی ایمان میں داخل ہے۔ (دیکھیے سورۂ عصر کی تفسیر) جنت کی نہروں کا بیان سورۂ محمد کی آیت (۱۵) میں دیکھیے { ”اَزْوَاجٌ مُّطَهَّرَةٌ“ } کے لیے سورۂ رحمن کا آخری حصہ اور سورۂ بقرہ کی آیت(۲۵) کی تفسیر ملاحظہ فرمائیں۔ ¤ ➋ { وَ نُدْخِلُهُمْ ظِلًّا ظَلِيْلًا:} اسی سائے کو دوسری آیت میں { ”ظِلٍّ مَّمْدُوْدٍ“ } فرمایا ہے۔ (دیکھیے سورۂ واقعہ : ۲۷ تا ۳۰) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ جنت میں ایک درخت ایسا ہے جس کے سائے میں سوار سو برس تک چلے گا پھر بھی اسے طے نہ کر پائے گا۔ ‘‘ [ بخاری، بدء الخلق، باب ما جاء فی صفۃ الجنۃ… : ۳۲۵۱، عن أبی ہریرۃ رضی اللہ عنہ ] ایک حدیث میں اس درخت کا نام ’’شجرۃ الخلد ‘‘ آیا ہے۔ [ أحمد : 455/2 ح : ۹۸۸۳ ]"
    },
    {
      "Ayah": 58,
      "tafsir": "(آیت 58) ➊ {اِنَّ اللّٰهَ يَاْمُرُكُمْ اَنْ تُؤَدُّوا … :} درمیان میں کفار کے احوال اور ان کے حق میں وعید کا ذکر آگیا تھا، اب دوبارہ سلسلۂ احکام شروع ہو رہا ہے۔ یہود امانت میں خیانت کرتے اور فیصلہ میں رشوت لے کر ظلم وجور کرتے، اللہ تعالیٰ نے مسلمانوں کو ان باتوں سے دور رہنے کا حکم دیا۔ یہاں امانت سے مراد گو ہر قسم کی امانت ہے، اس کا تعلق مذہب و دیانت سے ہو یا دنیاوی معاملات سے، لیکن یہود حق کو چھپا کر علمی امانت میں خیانت کے مرتکب بھی تھے۔ رسول اللہ صلی اللہ علیہ وسلم نے منافق کی تین نشانیاں بیان فرمائی ہیں، جب بات کرے تو جھوٹ بولے، جب وعدہ کرے تو اس کی خلاف ورزی کرے، جب اس کے پاس امانت رکھی جائے تو اس میں خیانت کرے۔ امانت میں خیانت اتنا بڑا گناہ ہے کہ شہادت سے بھی معاف نہیں ہوتا۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ خیبر سے واپسی پر رسول اللہ صلی اللہ علیہ وسلم وادی القریٰ کی طرف روانہ ہوئے۔ جب وہاں پہنچے تو آپ صلی اللہ علیہ وسلم کا غلام ’’مدعم‘‘ آپ صلی اللہ علیہ وسلم کی اونٹنی سے پالان اتار رہا تھا کہ اسے ایک اندھا تیر لگا جس نے اسے قتل کر دیا، لوگوں نے کہا، اسے جنت مبارک ہو تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ہر گز نہیں، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! وہ چادر جو اس نے خیبر کے دن غنیمتوں میں سے لی تھی، جو ابھی تقسیم نہیں ہوئی تھیں، اس پرآگ بن کر شعلے مار رہی ہے۔‘‘ [ بخاری، المغازی، باب غزوۃ خیبر : ۴۲۳۴ ] شہادت سے اس گناہ کے معاف نہ ہونے کی وجہ یہ معلوم ہوتی ہے کہ یہ لوگوں کے حقوق ہیں۔ عبد اللہ بن عمررضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’شہید کے لیے ہر گناہ معاف کر دیا جاتا ہے سوائے قرض کے۔‘‘ [ مسلم، الإمارۃ، باب من قتل فی سبیل اللہ… ۱۸۸۵ ] البتہ ایک حدیث میں ایک بشارت ہے، ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جو شخص لوگوں کے اموال لے اور ان کی ادائیگی کا ارادہ رکھتا ہو تو اللہ تعالیٰ اس کی طرف سے ادا کر دے گا اور جو شخص لوگوں کے اموال لے اور انھیں تلف کرنے کا ارادہ رکھتا ہو تو اللہ تعالیٰ اسے تلف کرے گا۔‘‘ [ بخاری، الاستقراض، باب من أخذ أموال الناس… ۲۳۸۷ ] اس سے معلوم ہوا کہ اگر شہید ہونے والے کا ارادہ ادائیگی کا تھا تو اگر وارث ادا نہ کریں تو اللہ تعالیٰ اپنے پاس سے ادا کر دے گا، لیکن ظاہر ہے کہ خیانت والے کا تو یہ ارادہ ہوتا ہی نہیں۔ امانت میں لوگوں سے لی ہوئی امانتیں بھی شامل ہیں اور عہدوں اور مناصب کی تقسیم بھی، جب ذمہ دار شخص کو معلوم ہو کہ فلاں صاحب اس منصب کا اہل نہیں تو پھر اپنے ذاتی تعلق یا خاندانی یا کسی دنیوی مقصد کے لیے یا کوٹہ سسٹم کی وجہ سے اہل کو چھوڑ کر نااہل شخص کو وہ منصب دیا جائے تو یہ بہت بڑی خیانت ہے۔ سورۂ احزاب (۷۲)، سورۂ مومنون (۸) اور سورۂ بقرہ (۲۸۳) میں بھی امانت داری کی تاکید فرمائی گئی ہے۔ ¤ ➋ { وَ اِذَا حَكَمْتُمْ بَيْنَ النَّاسِ اَنْ تَحْكُمُوْا بِالْعَدْلِ:} قرآن مجید میں کئی مقامات پر عدل کی تاکید فرمائی، خواہ وہ اپنے خلاف ہی کیوں نہ ہو، دیکھیے سورۂ نساء (۱۳۵) اور کسی دشمنی کی بنا پر عدل نہ کرنے سے بھی منع فرمایا۔ دیکھیے سورۂ مائدہ (۸)، سورۂ نحل (۹۰) اور سورۂ حجرات(۹) وہ سات خوش قسمت لوگ جنھیں روزِ قیامت اللہ تعالیٰ کا سایہ ملے گا، ان میں پہلا شخص عادل حکمران ہو گا۔ [ بخاری، الأذان، باب من جلس فی المسجد… : ۶۶۰ ] ¤ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’بے شک انصاف کرنے والے جو اپنے فیصلے میں، اپنے اہل و عیال میں اور رعایا میں انصاف کرتے ہیں، وہ اللہ تعالیٰ کے پاس نور کے منبروں پر ہوں گے، رحمان عزوجل کے دائیں طرف ہوں گے اور رحمان کے دونوں ہاتھ ہی دائیں ہیں۔‘‘ [ مسلم، الإمارۃ، باب فضیلۃ الأمیر العادل…: ۱۸۲۷، عن عبد اللہ بن عمرو رضی اللہ عنھما ] اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یقینا اللہ تعالیٰ قاضی اور حاکم کے ساتھ ہوتا ہے جب تک وہ ظلم نہ کرے اور جب وہ ظلم کرے تو اللہ تعالیٰ اسے اس کے نفس کے حوالے کر دیتا ہے۔‘‘ [ ابن ماجہ، الأحکام، باب التغلیظ فی الحیف والرشوۃ : ۲۳۱۲،عن عبد اللہ بن أوفٰی رضی اللہ عنہ وصححہ الألبانی ]"
    },
    {
      "Ayah": 59,
      "tafsir": "(آیت 59) ➊ {اَطِيْعُوا اللّٰهَ وَ اَطِيْعُوا الرَّسُوْلَ …:} اس آیت میں اللہ تعالیٰ نے رعایا کو، چاہے فوج کے افراد ہوں یا عام لوگ، انھیں اپنی، اپنے رسول صلی اللہ علیہ وسلم کی اور حکام و امراء کی اطاعت کا حکم دیا ہے، الا یہ کہ حکام اللہ کی نا فرمانی کا حکم دیں تو ان کی بات نہیں مانی جائے گی۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اختیار والے بادشاہ، قاضی اور جو کسی کام پر مقرر ہو اس کے حکم پر چلنا ضروری ہے، جب تک وہ اللہ اور اس کے رسول کے حکم کے خلاف حکم نہ کرے، اگر صریح خلاف کرے تو وہ حکم نہ مانیے۔‘‘ (موضح) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوْفِ ] ’’اطاعت صرف نیکی کے امور میں ہے۔‘‘ [ بخاری، الأحکام، باب السمع والطاعۃ للإمام… : ۷۱۴۵، عن علی رضی اللہ عنہ ] ¤ عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ ہر مسلمان کو لازم ہے کہ وہ ہر کام میں، خواہ اسے پسند ہو یا نا پسند، سمع و طاعت بجا لائے، بشرطیکہ اسے کسی معصیت کا حکم نہ دیا گیا ہو اور اگر اسے کسی معصیت کے کام کا حکم دیا گیا ہو تو اس میں سمع و طاعت نہیں۔ ‘‘ [ بخاری، الفتن، باب السمع والطاعۃ للإمام : ۷۱۴۴ ] ¤ ➋ { فَاِنْ تَنَازَعْتُمْ فِيْ شَيْءٍ فَرُدُّوْهُ … :} اس آیت میں ایک نہایت اہم حکم دیا ہے کہ باہمی نزاع اور جھگڑے کی صورت میں اللہ اور رسول کی طرف رجوع شرط ایمان ہے۔ اللہ تعالیٰ کی اطاعت تو قرآن کی اطاعت ہے اور رسول اللہ صلی اللہ علیہ وسلم کی اطاعت آپ صلی اللہ علیہ وسلم کی زندگی کے بعد آپ کی سنت کی اطاعت ہے اور یہ اطاعتیں اصل اور مستقل ہیں۔ اس سے ثابت ہوتا ہے کہ قرآن کی طرح رسول اللہ صلی اللہ علیہ وسلم کی حدیث بھی اسلامی قانون کا مستقل ماخذ ہے۔ نواب صدیق حسن خان رحمہ اللہ لکھتے ہیں : ’’اس آیت سے مقلدین تقلید کے واجب ہونے پر دلیل لیتے ہیں لیکن یہ دلیل نہیں ہو سکتی، کیونکہ ’’اولی الامر ‘‘ سے بادشاہ اور حکام مراد ہیں۔ (دیکھیے فوائد موضح) اگر بعض اہل علم کے مطابق اس سے علمائے دین مراد ہیں تو اس میں اول تو کسی عالم کی تخصیص نہیں ہے، دوسرے بہ فرض تسلیم عالم کی تقلید کا حکم ہے تو وہ اسی وقت تک ہے کہ اس کا حکم قرآن و حدیث کے موافق ہو(اگرچہ یہ تقلید نہیں بلکہ قرآن و حدیث پر عمل ہے) پھر خود چاروں اماموں نے اپنی تقلید سے منع فرمایا ہے اور قرآن کریم نے حکم دیا ہے کہ ائمہ کے اتباع میں جھگڑا ہو تو اللہ اور رسول کی طرف رجوع ہونا چاہیے۔‘‘ (ترجمان) اس سے یہ بھی معلوم ہوا کہ صحابہ، تابعین یا ائمہ میں اگر کسی مسئلے پر نزاع ہو تو کسی کا قول بھی حجت نہیں، بلکہ وہاں صرف قرآن و حدیث پر عمل ہو گا۔ ¤ ➌ { ذٰلِكَ خَيْرٌ وَّ اَحْسَنُ تَاْوِيْلًا:} اگر دو مسلمان جھگڑتے ہیں اور ایک نے کہا، چل شرع کی طرف رجوع کریں، دوسرے نے کہا، میں شرع کو (کچھ) نہیں سمجھتا یا مجھے شرع سے کام نہیں وہ بے شک کافر ہوا۔ (موضح)"
    },
    {
      "Ayah": 60,
      "tafsir": "(آیت60،61) اوپر کی آیات میں مسلمانوں پر واجب کیا ہے کہ وہ اللہ تعالیٰ اور اس کے رسول کی اطاعت کریں، یہاں فرمایا کہ منافق ہمیشہ رسول اللہ صلی اللہ علیہ وسلم کی نافرمانی کرتے ہیں اور کبھی آپ صلی اللہ علیہ وسلم کے فیصلے اور حکم پر راضی نہیں ہوتے، بلکہ ان کی کوشش ہوتی ہے کہ کسی مشرک سردار یا یہودی یا نصرانی عدالت یا کسی کاہن سے فیصلہ کروایا جائے، حالانکہ اسلام ان سب کے انکار کا حکم دیتا ہے اور اللہ اور اس کے رسول کے حکم پر عمل نہ کرنے والی ہر عدالت کو طاغوت قرار دیتا ہے۔ مومن کا کام اللہ اور اس کے رسول صلی اللہ علیہ وسلم کا فیصلہ سننا اور ماننا ہے۔ (دیکھیے نور : ۵۱) اور منافقوں کا حال اس کے برعکس ہے ( دیکھیے نور : ۴۸۔ لقمان : ۲۱) افسوس کہ اس وقت اکثر مسلمان ملکوں کی عدالتوں میں قرآن وسنت کا نظام عدل نافذ ہی نہیں، بلکہ کفار کے بنائے ہوئے قانون نافذ ہیں۔ حقیقت یہ ہے کہ جب تک قرآن و سنت کا کوئی متبع حکمران کفار کے اس نظام کو بزور بازو نکال باہر نہیں کرتا اس وقت تک عدالتوں میں قرآن و سنت کی رسائی مشکل ہے۔"
    },
    {
      "Ayah": 61,
      "tafsir": "(آیت60،61) اوپر کی آیات میں مسلمانوں پر واجب کیا ہے کہ وہ اللہ تعالیٰ اور اس کے رسول کی اطاعت کریں، یہاں فرمایا کہ منافق ہمیشہ رسول اللہ صلی اللہ علیہ وسلم کی نافرمانی کرتے ہیں اور کبھی آپ صلی اللہ علیہ وسلم کے فیصلے اور حکم پر راضی نہیں ہوتے، بلکہ ان کی کوشش ہوتی ہے کہ کسی مشرک سردار یا یہودی یا نصرانی عدالت یا کسی کاہن سے فیصلہ کروایا جائے، حالانکہ اسلام ان سب کے انکار کا حکم دیتا ہے اور اللہ اور اس کے رسول کے حکم پر عمل نہ کرنے والی ہر عدالت کو طاغوت قرار دیتا ہے۔ مومن کا کام اللہ اور اس کے رسول صلی اللہ علیہ وسلم کا فیصلہ سننا اور ماننا ہے۔ (دیکھیے نور : ۵۱) اور منافقوں کا حال اس کے برعکس ہے ( دیکھیے نور : ۴۸۔ لقمان : ۲۱) افسوس کہ اس وقت اکثر مسلمان ملکوں کی عدالتوں میں قرآن وسنت کا نظام عدل نافذ ہی نہیں، بلکہ کفار کے بنائے ہوئے قانون نافذ ہیں۔ حقیقت یہ ہے کہ جب تک قرآن و سنت کا کوئی متبع حکمران کفار کے اس نظام کو بزور بازو نکال باہر نہیں کرتا اس وقت تک عدالتوں میں قرآن و سنت کی رسائی مشکل ہے۔"
    },
    {
      "Ayah": 62,
      "tafsir": "(آیت 63،62) یعنی جب اپنے کرتوتوں کے سبب عتاب الٰہی کا شکار ہو کر مصیبتوں میں پھنستے ہیں تو پھر آکر کہتے ہیں کہ کسی دوسری جگہ جانے سے مقصد یہ نہیں تھا کہ وہاں سے ہم فیصلہ کروائیں گے، یا آپ سے زیادہ ہمیں وہاں سے انصاف ملے گا، بلکہ مقصد صلح اور ملاپ کرانا تھا۔ اللہ تعالیٰ نے فرمایا کہ اگرچہ ہم ان کے دلوں کے بھیدوں سے واقف ہیں، جس پر ہم انھیں جزا دیں گے، لیکن اے پیغمبر ! آپ ان کے ظاہر کو سامنے رکھتے ہوئے در گزر ہی فرمائیے اور وعظ و نصیحت اور قول بلیغ کے ذریعے سے ان کے باطن کی اصلاح کی کوشش جاری رکھیے۔ اس سے معلوم ہوا کہ ایسے دشمنوں کی سازش کو عفو و درگزر، وعظ و نصیحت اور قول بلیغ ہی کے ذریعے سے ناکام بنانے کی سعی کی جانی چاہیے۔ یاد رہے! یہ اس وقت کی بات ہے کہ جب منافق مغلوب تھے اور اسلام اور اس کے احکام اور عدالتیں غالب تھیں اور منافق دوسرے لوگوں سے فیصلہ کرانے پر پشیمان ہو کر عذر معذرتیں کرتے تھے۔«وَمَآ اَرْسَلْنَا مِنْ رَّسُوْلٍ ۔۔» : اطاعت رسول کی دوبارہ ترغیب دی ہے۔ یعنی اللہ کے رسول دنیا میں اس لیے آتے ہیں کہ تمام معاملات میں اللہ کے حکم کے مطابق ان کی اطاعت کی جائے۔ ﴿باذن اللہ﴾ کا معنی اللہ کی توفیق و اعانت بھی کیا گیا ہے، وہ بھی درست ہے، معلوم ہوا ہر رسول واجب الاطاعت ہوتا ہے۔ ¤ ¤ «وَلَوْ اَنَّھُمْ اِذْ ظَّلَمُوْٓا» : اپنی جان پر ظلم کرنے کے بعد رسول اللہ صلی اللہ علیہ وسلم کے پاس آنا اور آپ سے استغفار کروانا آپ کی زندگی کے ساتھ خاص تھا، آپ کی وفات کے بعد کسی صحابی سے ثابت نہیں کہ وہ آپ کی قبر مبارک پر آیا ہو اور آپ سے دعا کرنے کی درخواست کی ہو۔ حافظ ابن کثیر رضی اللہ عنہ نے یہاں ایک بدوی کی حکایت نقل کی ہے، جس نے رسول اللہ صلی اللہ علیہ وسلم کی قبر کے پاس آکر یہ آیت پڑھتے ہوئے کچھ شعر پڑھے اور کہا کہ میں اللہ سے استغفار کرتا ہوں اور آپ کو سفارشی بناتا ہوں، اس پر قبر انور کے پاس بیٹھنے والے ایک شخص نے کہا، خواب میں آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا ہے: ”اس بدوی کو بخش دیا گیا ہے۔“ لیکن یہ ایک حکایت ہے جو آیت کی مناسبت سے ذکر کر دی گئی ہے، یہ نہ آیت کی تفسیر ہے نہ حدیث ہے۔ ا[لصارم المنکی ص: ٢٣٨] میں لکھا ہے کہ اس حکایت کی سند نہایت کمزور ہے۔ اور نبی کے خواب کے علاوہ کسی کا خواب دین میں دلیل بھی نہیں بنتا۔ آیت سے یہ تو ثابت ہوتا ہے کہ آپ صلی اللہ علیہ وسلم کی حیات مبارکہ میں آپ سے دعائے مغفرت کروائی جا سکتی تھی، مگر آپ کی وفات کے بعد اس آیت کی رو سے قبر پر جا کر سفارش اور دعا کی درخواست کرنا کسی طرح صحیح نہیں۔ ¤ ¤ «جَاۗءُوْكَ فَاسْتَغْفَرُوا اللّٰهَ وَاسْتَغْفَرَ لَھُمُ الرَّسُوْلُ» : اللہ تعالیٰ کی بخشش حاصل کرنے کے لیے اللہ تعالیٰ کی جناب میں توبہ و استغفار ضروری اور کافی ہے، لیکن یہاں جو کہا گیا ہے کہ اے پیغمبر ! وہ تیرے پاس آتے اور اللہ سے بخشش مانگتے اور تو بھی ان کے لیے مغفرت طلب کرتا، تو یہ اس لیے کہ چونکہ انہوں نے جھگڑے کے فیصلے کے لیے دوسروں کی طرف رجوع کر کے آپ کی شان کے نا مناسب حرکت کی تھی، اس لیے اس کے ازالے کے لیے انہیں آپ صلی اللہ علیہ وسلم کے پاس آنے کی تاکید فرمائی۔"
    },
    {
      "Ayah": 63,
      "tafsir": "(آیت 63،62) یعنی جب اپنے کرتوتوں کے سبب عتاب الٰہی کا شکار ہو کر مصیبتوں میں پھنستے ہیں تو پھر آکر کہتے ہیں کہ کسی دوسری جگہ جانے سے مقصد یہ نہیں تھا کہ وہاں سے ہم فیصلہ کروائیں گے، یا آپ سے زیادہ ہمیں وہاں سے انصاف ملے گا، بلکہ مقصد صلح اور ملاپ کرانا تھا۔ اللہ تعالیٰ نے فرمایا کہ اگرچہ ہم ان کے دلوں کے بھیدوں سے واقف ہیں، جس پر ہم انھیں جزا دیں گے، لیکن اے پیغمبر ! آپ ان کے ظاہر کو سامنے رکھتے ہوئے در گزر ہی فرمائیے اور وعظ و نصیحت اور قول بلیغ کے ذریعے سے ان کے باطن کی اصلاح کی کوشش جاری رکھیے۔ اس سے معلوم ہوا کہ ایسے دشمنوں کی سازش کو عفو و درگزر، وعظ و نصیحت اور قول بلیغ ہی کے ذریعے سے ناکام بنانے کی سعی کی جانی چاہیے۔ یاد رہے! یہ اس وقت کی بات ہے کہ جب منافق مغلوب تھے اور اسلام اور اس کے احکام اور عدالتیں غالب تھیں اور منافق دوسرے لوگوں سے فیصلہ کرانے پر پشیمان ہو کر عذر معذرتیں کرتے تھے۔«وَمَآ اَرْسَلْنَا مِنْ رَّسُوْلٍ ۔۔» : اطاعت رسول کی دوبارہ ترغیب دی ہے۔ یعنی اللہ کے رسول دنیا میں اس لیے آتے ہیں کہ تمام معاملات میں اللہ کے حکم کے مطابق ان کی اطاعت کی جائے۔ ﴿باذن اللہ﴾ کا معنی اللہ کی توفیق و اعانت بھی کیا گیا ہے، وہ بھی درست ہے، معلوم ہوا ہر رسول واجب الاطاعت ہوتا ہے۔ ¤ ¤ «وَلَوْ اَنَّھُمْ اِذْ ظَّلَمُوْٓا» : اپنی جان پر ظلم کرنے کے بعد رسول اللہ صلی اللہ علیہ وسلم کے پاس آنا اور آپ سے استغفار کروانا آپ کی زندگی کے ساتھ خاص تھا، آپ کی وفات کے بعد کسی صحابی سے ثابت نہیں کہ وہ آپ کی قبر مبارک پر آیا ہو اور آپ سے دعا کرنے کی درخواست کی ہو۔ حافظ ابن کثیر رضی اللہ عنہ نے یہاں ایک بدوی کی حکایت نقل کی ہے، جس نے رسول اللہ صلی اللہ علیہ وسلم کی قبر کے پاس آکر یہ آیت پڑھتے ہوئے کچھ شعر پڑھے اور کہا کہ میں اللہ سے استغفار کرتا ہوں اور آپ کو سفارشی بناتا ہوں، اس پر قبر انور کے پاس بیٹھنے والے ایک شخص نے کہا، خواب میں آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا ہے: ”اس بدوی کو بخش دیا گیا ہے۔“ لیکن یہ ایک حکایت ہے جو آیت کی مناسبت سے ذکر کر دی گئی ہے، یہ نہ آیت کی تفسیر ہے نہ حدیث ہے۔ ا[لصارم المنکی ص: ٢٣٨] میں لکھا ہے کہ اس حکایت کی سند نہایت کمزور ہے۔ اور نبی کے خواب کے علاوہ کسی کا خواب دین میں دلیل بھی نہیں بنتا۔ آیت سے یہ تو ثابت ہوتا ہے کہ آپ صلی اللہ علیہ وسلم کی حیات مبارکہ میں آپ سے دعائے مغفرت کروائی جا سکتی تھی، مگر آپ کی وفات کے بعد اس آیت کی رو سے قبر پر جا کر سفارش اور دعا کی درخواست کرنا کسی طرح صحیح نہیں۔ ¤ ¤ «جَاۗءُوْكَ فَاسْتَغْفَرُوا اللّٰهَ وَاسْتَغْفَرَ لَھُمُ الرَّسُوْلُ» : اللہ تعالیٰ کی بخشش حاصل کرنے کے لیے اللہ تعالیٰ کی جناب میں توبہ و استغفار ضروری اور کافی ہے، لیکن یہاں جو کہا گیا ہے کہ اے پیغمبر ! وہ تیرے پاس آتے اور اللہ سے بخشش مانگتے اور تو بھی ان کے لیے مغفرت طلب کرتا، تو یہ اس لیے کہ چونکہ انہوں نے جھگڑے کے فیصلے کے لیے دوسروں کی طرف رجوع کر کے آپ کی شان کے نا مناسب حرکت کی تھی، اس لیے اس کے ازالے کے لیے انہیں آپ صلی اللہ علیہ وسلم کے پاس آنے کی تاکید فرمائی۔"
    },
    {
      "Ayah": 64,
      "tafsir": "(آیت 64) ➊ {وَ مَاۤ اَرْسَلْنَا مِنْ رَّسُوْلٍ … :} اطاعت رسول کی دوبارہ ترغیب دی ہے، یعنی اللہ کے رسول دنیا میں اس لیے آتے ہیں کہ تمام معاملات میں اللہ کے حکم کے مطابق ان کی اطاعت کی جائے۔ {”بِاِذْنِ اللّٰهِ“} کا معنی اللہ کی توفیق و اعانت بھی کیا گیا ہے، وہ بھی درست ہے، معلوم ہوا ہر رسول واجب الاطاعت ہوتا ہے۔ ¤ ➋ { وَ لَوْ اَنَّهُمْ اِذْ ظَّلَمُوْۤا......:} اپنی جان پر ظلم کرنے کے بعد رسول اللہ صلی اللہ علیہ وسلم کے پاس آنا اور آپ سے استغفار کروانا آپ کی زندگی کے ساتھ خاص تھا، آپ کی وفات کے بعد کسی صحابی سے ثابت نہیں کہ وہ آپ کی قبر مبارک پر آیا ہو اور آپ سے دعا کرنے کی درخواست کی ہو۔ حافظ ابن کثیر رحمہ اللہ نے یہاں ایک بدوی کی حکایت نقل کی ہے، جس نے رسول اللہ صلی اللہ علیہ وسلم کی قبر کے پاس آکر یہ آیت پڑھتے ہوئے کچھ شعر پڑھے اور کہا کہ میں اللہ سے استغفار کرتا ہوں اور آپ کو سفارشی بناتا ہوں، اس پر قبر انور کے پاس بیٹھنے والے ایک شخص نے کہا، خواب میں آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا ہے : ’’اس بدوی کو بخش دیاگیا ہے۔‘‘ لیکن یہ ایک حکایت ہے جو آیت کی مناسبت سے ذکر کر دی گئی ہے، یہ نہ آیت کی تفسیر ہے نہ حدیث ہے۔ ’’الصارم المنکی (ص : ۲۳۸)‘‘ میں لکھا ہے کہ اس حکایت کی سند نہایت کمزور ہے اور نبی کے خواب کے علاوہ کسی کا خواب دین میں دلیل بھی نہیں بنتا۔ آیت سے یہ تو ثابت ہوتا ہے کہ آپ صلی اللہ علیہ وسلم کی حیات مبارکہ میں آپ سے دعائے مغفرت کروائی جا سکتی تھی، مگر آپ کی وفات کے بعد اس آیت کی رو سے قبر پر جا کر سفارش اور دعا کی درخواست کرنا کسی طرح صحیح نہیں۔ ¤ ➌ { جَآءُوْكَ فَاسْتَغْفَرُوا اللّٰهَ وَ اسْتَغْفَرَ لَهُمُ الرَّسُوْلُ:} اللہ تعالیٰ کی بخشش حاصل کرنے کے لیے اللہ تعالیٰ کی جناب میں توبہ و استغفار ضروری اور کافی ہے، لیکن یہاں جو کہا گیا ہے کہ اے پیغمبر ! وہ تیرے پاس آتے اور اللہ سے بخشش مانگتے اور تو بھی ان کے لیے مغفرت طلب کرتا، تو یہ اس لیے کہ چونکہ انھوں نے جھگڑے کے فیصلے کے لیے دوسروں کی طرف رجوع کر کے آپ کی شان کے نا مناسب حرکت کی تھی، اس لیے اس کے ازالے کے لیے انھیں آپ صلی اللہ علیہ وسلم کے پاس آنے کی تاکید فرمائی۔"
    },
    {
      "Ayah": 65,
      "tafsir": "(آیت 65) ➊ { فَلَا وَ رَبِّكَ لَا يُؤْمِنُوْنَ …:} اس آیت کی شان نزول میں ایک مسلمان اور یہودی کا واقعہ بیان کیا جاتا ہے جو رسول اللہ صلی اللہ علیہ وسلم سے فیصلہ کروانے کے بعد عمر رضی اللہ عنہ سے فیصلہ کروانے گیا تھا، جس پر عمر رضی اللہ عنہ نے اس مسلمان کی گردن اڑا دی تھی۔ مگر یہ واقعہ سنداً صحیح نہیں ہے، جیسا کہ حافظ ابن کثیر رحمہ اللہ نے بھی وضاحت کی ہے، رسول اللہ صلی اللہ علیہ وسلم صحابہ کے اصرار کے باوجود منافقوں کی بڑی بڑی گستاخیوں پر نہ انھیں قتل کرتے، نہ قتل کی اجازت دیتے اور وجہ یہ بتاتے تھے کہ لوگ کہیں گے کہ محمد( صلی اللہ علیہ وسلم ) اپنے ہی ساتھیوں کو قتل کرتے ہیں۔ [ مسلم، الزکوٰۃ، باب ذکر الخوارج : ۱۰۶۳ ] ¤ ➋ عبد اللہ بن زبیر رضی اللہ عنھما راوی ہیں کہ زبیر رضی اللہ عنہ اور ایک انصاری کے درمیان حرہ کی نالیوں میں جھگڑا ہو گیا۔ زبیر رضی اللہ عنہ کی زمین اوپر کی جانب تھی ، جہاں سے پانی آتا تھا، رسول اللہ صلی اللہ علیہ وسلم نے زبیر رضی اللہ عنہ سے انصاری کے حق میں رعایت کی سفارش کی اور فرمایا : ’’اپنے باغ کو پانی دے کر اپنے پڑوسی کے لیے چھوڑ دو۔‘‘ اس پر انصاری نے کہا : ’’ یہ اس لیے کہ زبیر ( رضی اللہ عنہ ) آپ کے پھوپھی زاد بھائی ہیں۔‘‘ مطلب یہ تھا کہ آپ نے اس رشتے کی رعایت کی ہے، اس پر آپ صلی اللہ علیہ وسلم کو تکلیف محسوس ہوئی اور فرمایا : ’’ زبیر ! اپنے باغ کو اتناپانی دو کہ منڈیروں تک چڑھ جائے، پھر اس کے لیے چھوڑ دو۔‘‘ پہلے آپ نے انصاری کی سفارش کی تھی، اب جب اس نے آپ کو غصہ دلایا تو آپ نے سفارش کے بجائے فیصلہ کیا اور زبیر رضی اللہ عنہ کو ان کا پورا حق دلوایا۔ زبیر رضی اللہ عنہ فرماتے ہیں کہ میرا خیال ہے کہ یہ آیت : «{ فَلَا وَ رَبِّكَ لَا يُؤْمِنُوْنَ }» اس بارے میں نازل ہوئی۔ [ مسلم،الفضائل، باب وجوب اتباعہ صلی اللہ علیہ وسلم : ۲۳۵۷۔ بخاری : ۴۵۸۵ ] ¤ ➌ { حَتّٰى يُحَكِّمُوْكَ فِيْمَا … :} اس آیت میں اللہ تعالیٰ نے قسم کھا کر مومن ہونے کی تین شرطیں بیان کی ہیں، پہلی یہ کہ کسی بھی جھگڑے کا فیصلہ رسول اللہ صلی اللہ علیہ وسلم کے علاوہ کسی اور کے پاس نہ لے جایا جائے۔ ( دیکھیے نور : ۵۱۔ احزاب : ۳۶) دوسری یہ کہ رسول اللہ صلی اللہ علیہ وسلم کے فیصلے پر دل میں کسی قسم کی تنگی محسوس نہ کی جائے اور تیسری یہ کہ صاف اعلان کر کے اس فیصلے کو تسلیم کرتے ہوئے اس پر عمل کیا جائے۔ اب آپ صلی اللہ علیہ وسلم کی وفات کے بعد قرآن و سنت سے فیصلہ طلب کیا جائے گا۔ اس سے منکرین حدیث کے ایمان کی حقیقت پوری طرح کھل جاتی ہے۔ یہ آیت منکرین حدیث کے علاوہ ان لوگوں کے لیے بھی لمحہ فکریہ ہے جن کے امام یا پیر کے خلاف کوئی آیت یا حدیث آ جائے تو وہ صرف دل میں تنگی ہی محسوس نہیں کرتے بلکہ ماننے سے صاف انکار کر دیتے ہیں کہ کیا ہمارے امام کو اس آیت و حدیث کا علم نہ تھا، یا پھر اس کی تاویل کرنے یا اسے منسوخ قرار دینے کے لیے اپنی ساری قوت صرف کر دیتے ہیں۔ حقیقت یہ ہے کہ آیت کے صریح الفاظ کے مطابق نبی صلی اللہ علیہ وسلم کے فیصلے کے خلاف دل میں ذرہ بھر تنگی یا نا پسندیدگی محسوس کی جائے تو یہ ایمان کے منافی ہے۔"
    },
    {
      "Ayah": 66,
      "tafsir": "(آیت 66تا68) ➊ ان آیات کا تعلق بھی منافقین سے ہے، ان میں انھیں اخلاص اور ترک نفاق کی ترغیب دی گئی ہے۔ یعنی چاہیے تو یہ کہ اللہ تعالیٰ کا حکم ماننے میں جان دینے سے بھی دریغ نہ کیا جائے، (مگر یہ ایسے ہیں کہ ) اگر کہیں ان کو اللہ تعالیٰ اپنی جانیں ہلاک کر ڈالنے یا اپنے گھر چھوڑ دینے کا حکم دے دیتا تو یہ اسے کب بجا لانے والے تھے، جو حکم ہم نے انھیں دیے ہیں وہ نہایت آسان اور محض ان کی خیر خواہی کے لیے ہیں، نصیحت مانیں اور ان احکام پر چلیں، نفاق جاتا رہے گا، ایمان کامل نصیب ہو گا، اس کو غنیمت سمجھیں۔ (موضح) ¤ ➋ ابن عاشور فرماتے ہیں کہ میرے خیال میں یہ تمہید ہے جہاد کے ان احکام کی جو ساتھ ہی شروع ہو رہے ہیں : «{ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا خُذُوْا حِذْرَكُمْ فَانْفِرُوْا ثُبَاتٍ اَوِ انْفِرُوْا جَمِيْعًا }» [ النساء : ۷۱ ] اور ان آیات کے ساتھ مناسبت یہ بھی ہے کہ اگر ہم ان پر ہجرت یا قتال یعنی «{ اَنِ اقْتُلُوْۤا اَنْفُسَكُمْ اَوِ اخْرُجُوْا مِنْ دِيَارِكُمْ }» فرض کر دیتے تو بہت کم لوگ اس پر عمل کرتے، لیکن اگر وہ ایسا کرتے تو ان کے لیے بہتر ہوتا اور بے شمار اجر کا باعث ہوتا۔ یعنی ابھی تو ایمان کے اعلیٰ مدارج جو اسلام کی کوہان کی چوٹی ہیں، ان کا حکم بھی آنے والا ہے، کجا یہ کہ یہ لوگ فیصلے بھی کہیں اور سے کروانا چاہتے ہیں۔ [ التحریر والتنویر ]"
    },
    {
      "Ayah": 67,
      "tafsir": "(آیت 66تا68) ➊ ان آیات کا تعلق بھی منافقین سے ہے، ان میں انھیں اخلاص اور ترک نفاق کی ترغیب دی گئی ہے۔ یعنی چاہیے تو یہ کہ اللہ تعالیٰ کا حکم ماننے میں جان دینے سے بھی دریغ نہ کیا جائے، (مگر یہ ایسے ہیں کہ ) اگر کہیں ان کو اللہ تعالیٰ اپنی جانیں ہلاک کر ڈالنے یا اپنے گھر چھوڑ دینے کا حکم دے دیتا تو یہ اسے کب بجا لانے والے تھے، جو حکم ہم نے انھیں دیے ہیں وہ نہایت آسان اور محض ان کی خیر خواہی کے لیے ہیں، نصیحت مانیں اور ان احکام پر چلیں، نفاق جاتا رہے گا، ایمان کامل نصیب ہو گا، اس کو غنیمت سمجھیں۔ (موضح) ¤ ➋ ابن عاشور فرماتے ہیں کہ میرے خیال میں یہ تمہید ہے جہاد کے ان احکام کی جو ساتھ ہی شروع ہو رہے ہیں : «{ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا خُذُوْا حِذْرَكُمْ فَانْفِرُوْا ثُبَاتٍ اَوِ انْفِرُوْا جَمِيْعًا }» [ النساء : ۷۱ ] اور ان آیات کے ساتھ مناسبت یہ بھی ہے کہ اگر ہم ان پر ہجرت یا قتال یعنی «{ اَنِ اقْتُلُوْۤا اَنْفُسَكُمْ اَوِ اخْرُجُوْا مِنْ دِيَارِكُمْ }» فرض کر دیتے تو بہت کم لوگ اس پر عمل کرتے، لیکن اگر وہ ایسا کرتے تو ان کے لیے بہتر ہوتا اور بے شمار اجر کا باعث ہوتا۔ یعنی ابھی تو ایمان کے اعلیٰ مدارج جو اسلام کی کوہان کی چوٹی ہیں، ان کا حکم بھی آنے والا ہے، کجا یہ کہ یہ لوگ فیصلے بھی کہیں اور سے کروانا چاہتے ہیں۔ [ التحریر والتنویر ]"
    },
    {
      "Ayah": 68,
      "tafsir": "(آیت 66تا68) ➊ ان آیات کا تعلق بھی منافقین سے ہے، ان میں انھیں اخلاص اور ترک نفاق کی ترغیب دی گئی ہے۔ یعنی چاہیے تو یہ کہ اللہ تعالیٰ کا حکم ماننے میں جان دینے سے بھی دریغ نہ کیا جائے، (مگر یہ ایسے ہیں کہ ) اگر کہیں ان کو اللہ تعالیٰ اپنی جانیں ہلاک کر ڈالنے یا اپنے گھر چھوڑ دینے کا حکم دے دیتا تو یہ اسے کب بجا لانے والے تھے، جو حکم ہم نے انھیں دیے ہیں وہ نہایت آسان اور محض ان کی خیر خواہی کے لیے ہیں، نصیحت مانیں اور ان احکام پر چلیں، نفاق جاتا رہے گا، ایمان کامل نصیب ہو گا، اس کو غنیمت سمجھیں۔ (موضح) ¤ ➋ ابن عاشور فرماتے ہیں کہ میرے خیال میں یہ تمہید ہے جہاد کے ان احکام کی جو ساتھ ہی شروع ہو رہے ہیں : «{ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا خُذُوْا حِذْرَكُمْ فَانْفِرُوْا ثُبَاتٍ اَوِ انْفِرُوْا جَمِيْعًا }» [ النساء : ۷۱ ] اور ان آیات کے ساتھ مناسبت یہ بھی ہے کہ اگر ہم ان پر ہجرت یا قتال یعنی «{ اَنِ اقْتُلُوْۤا اَنْفُسَكُمْ اَوِ اخْرُجُوْا مِنْ دِيَارِكُمْ }» فرض کر دیتے تو بہت کم لوگ اس پر عمل کرتے، لیکن اگر وہ ایسا کرتے تو ان کے لیے بہتر ہوتا اور بے شمار اجر کا باعث ہوتا۔ یعنی ابھی تو ایمان کے اعلیٰ مدارج جو اسلام کی کوہان کی چوٹی ہیں، ان کا حکم بھی آنے والا ہے، کجا یہ کہ یہ لوگ فیصلے بھی کہیں اور سے کروانا چاہتے ہیں۔ [ التحریر والتنویر ]"
    },
    {
      "Ayah": 69,
      "tafsir": "(آیت 70،69) ➊ { ”الصِّدِّيْقِيْنَ“ } یہ صدق سے مبالغہ ہے، یعنی جو بہت سچا ہو۔ بعض نے کہا، جو کبھی جھوٹ نہ بولے۔ بعض نے کہا، صدیق وہ ہے کہ صدق کی عادت کی وجہ سے اس سے جھوٹ نا ممکن ہو اور بعض نے کہا کہ جو اپنے اعتقاد اور قول میں سچا ہو اور اپنے فعل کے ساتھ اپنے صدق کو ثابت کرے۔ ( مفردات) استاد محمد عبدہ رحمہ اللہ لکھتے ہیں کہ صدیق صدق سے مبالغے کا صیغہ ہے، یعنی جو جملہ امور دین کی تصدیق کرنے والا ہو اور کبھی کسی معاملے میں خلجان اور شک اس کے دل میں پیدا نہ ہو، یا وہ جو رسول اللہ صلی اللہ علیہ وسلم کی تصدیق میں سبقت کرنے کی وجہ سے دوسروں کے لیے اسوہ بنے، اس اعتبار سے اس امت کے صدیق ابو بکر رضی اللہ عنہ ہی ہو سکتے ہیں، کیونکہ ابو بکر صدیق رضی اللہ عنہ دوسرے افاضل صحابہ کے لیے نمونہ بنے ہیں۔ علی رضی اللہ عنہ بھی اول مسلمانوں میں شمار ہوتے ہیں، مگر چھوٹے بچے ہونے کی وجہ سے دوسروں کے لیے نمونہ نہیں بن سکے۔ چونکہ نبی کے بعد صدیق کا درجہ ہے، اس لیے علمائے اہل سنت کا اجماع ہے کہ ابو بکر صدیق رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کے بعد سب سے افضل ہیں۔ { ”الشُّهَدَآءِ“ } یہ شہید کی جمع ہے، اس سے مراد وہ لوگ ہیں جنھوں نے اللہ تعالیٰ کے راستے میں جان دی اور امت محمد صلی اللہ علیہ وسلم کو بھی شہداء ہونے کا شرف حاصل ہے۔ {”الصّٰلِحِيْنَ“} اس سے مراد وہ لوگ ہیں جو ہر طرح عقیدہ و عمل کے اعتبار سے صالح اور درست رہے اور ہر قسم کے فساد سے محفوظ رہے۔ (رازی) ¤ ➋ { مَعَ الَّذِيْنَ اَنْعَمَ اللّٰهُ عَلَيْهِمْ … : } یہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی اطاعت کے انعام کا ذکر ہے کہ انھیں انبیاء، صدیقین، شہداء اور صالحین کی معیت، یعنی ان کا ساتھ نصیب ہو گا۔ احادیث سے معلوم ہوتا ہے کہ صحابہ کرام رضی اللہ عنھم کو رسول صلی اللہ علیہ وسلم کے ساتھ رہنے کا شوق بہت زیادہ تھا، دنیا میں بھی وہ اس کے بہت مشتاق تھے اور انھیں جنت میں آپ کی معیت کا شوق تو حد سے زیادہ تھا۔ ربیعہ بن کعب اسلمی رضی اللہ عنہ بیان کرتے ہیں کہ میں نبی کریم صلی اللہ علیہ وسلم کے پاس رات بسر کیا کرتا تھا اور آپ کے لیے پانی اور دیگر ضروریات کا اہتمام کر دیا کرتا تھا، ایک دن آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ کچھ مانگ لو!‘‘ میں نے عرض کی : ’’میں آپ سے جنت میں آپ کی مرافقت (ساتھ) کا سوال کرتا ہوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ کوئی اور سوال؟‘‘ میں نے عرض کی : ’’وہ بھی یہی ہے۔‘‘ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ پھر سجدوں کی کثرت کے ساتھ اپنے بارے میں میری مدد کرو۔ ‘‘ [مسلم، الصلاۃ، باب فضل السجود والحث علیہ : ۴۸۹ ] یہ رسول اللہ صلی اللہ علیہ وسلم سے خالص محبت اور اطاعت کی برکت ہے کہ اگر عمل میں کچھ کمی ہوئی تب بھی اطاعت و اخلاص کی وجہ سے اتنے اونچے لوگوں کا ساتھ مل جائے گا۔ عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : ’’آپ اس شخص کے متعلق کیا فرماتے ہیں جو کچھ لوگوں سے محبت رکھتا ہے، مگر ابھی تک ( اعمال میں) ان سے نہیں مل سکا۔‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’آدمی اس کے ساتھ ہو گا جس سے اسے محبت ہو گی۔‘‘ [ بخاری، الأدب، باب علامۃ الحب فی اللہ…: ۶۱۶۹ ] حقیقت یہ ہے کہ اطاعت اور محبت لازم و ملزوم ہیں، وہ محبت جس میں اطاعت نہ ہو جھوٹی ہے اور وہ اطاعت جس کی بنیاد محبت نہ ہو، دکھاوا ہے۔ ہاں، محبت و اخلاص کے ساتھ عمل و اطاعت میں کچھ کمی ہو گی تو اللہ تعالیٰ اسے اپنے فضل سے پورا کر دے گا، انبیاء، صدیقین، شہداء اور صالحین سے زیادہ اچھا ساتھی کوئی نہیں اور اللہ کے فضل سے بڑی نعمت کوئی نہیں اور اللہ تعالیٰ لوگوں کے دلوں کے حالات خوب جانتا ہے کہ کسے کس کے ساتھ رکھنا ہے۔ ¤ انس رضی اللہ عنہ فرماتے ہیں : ’’مجھے رسول اللہ صلی اللہ علیہ وسلم سے محبت ہے، ابو بکر و عمر رضی اللہ عنھما سے محبت ہے، لہٰذا مجھے امید ہے کہ ان کے ساتھ محبت کی وجہ سے اللہ تعالیٰ مجھے ان کے ساتھ ہی اٹھائیں گے، گو میں ان جیسے عمل نہیں کر سکا۔‘‘ [ بخاری، فضائل أصحاب النبی صلی اللہ علیہ وسلم ، باب مناقب عمر بن الخطاب رضی اللہ عنہ … : ۳۶۸۸ ]"
    },
    {
      "Ayah": 70,
      "tafsir": "(آیت 70،69) ➊ { ”الصِّدِّيْقِيْنَ“ } یہ صدق سے مبالغہ ہے، یعنی جو بہت سچا ہو۔ بعض نے کہا، جو کبھی جھوٹ نہ بولے۔ بعض نے کہا، صدیق وہ ہے کہ صدق کی عادت کی وجہ سے اس سے جھوٹ نا ممکن ہو اور بعض نے کہا کہ جو اپنے اعتقاد اور قول میں سچا ہو اور اپنے فعل کے ساتھ اپنے صدق کو ثابت کرے۔ ( مفردات) استاد محمد عبدہ رحمہ اللہ لکھتے ہیں کہ صدیق صدق سے مبالغے کا صیغہ ہے، یعنی جو جملہ امور دین کی تصدیق کرنے والا ہو اور کبھی کسی معاملے میں خلجان اور شک اس کے دل میں پیدا نہ ہو، یا وہ جو رسول اللہ صلی اللہ علیہ وسلم کی تصدیق میں سبقت کرنے کی وجہ سے دوسروں کے لیے اسوہ بنے، اس اعتبار سے اس امت کے صدیق ابو بکر رضی اللہ عنہ ہی ہو سکتے ہیں، کیونکہ ابو بکر صدیق رضی اللہ عنہ دوسرے افاضل صحابہ کے لیے نمونہ بنے ہیں۔ علی رضی اللہ عنہ بھی اول مسلمانوں میں شمار ہوتے ہیں، مگر چھوٹے بچے ہونے کی وجہ سے دوسروں کے لیے نمونہ نہیں بن سکے۔ چونکہ نبی کے بعد صدیق کا درجہ ہے، اس لیے علمائے اہل سنت کا اجماع ہے کہ ابو بکر صدیق رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کے بعد سب سے افضل ہیں۔ { ”الشُّهَدَآءِ“ } یہ شہید کی جمع ہے، اس سے مراد وہ لوگ ہیں جنھوں نے اللہ تعالیٰ کے راستے میں جان دی اور امت محمد صلی اللہ علیہ وسلم کو بھی شہداء ہونے کا شرف حاصل ہے۔ {”الصّٰلِحِيْنَ“} اس سے مراد وہ لوگ ہیں جو ہر طرح عقیدہ و عمل کے اعتبار سے صالح اور درست رہے اور ہر قسم کے فساد سے محفوظ رہے۔ (رازی) ¤ ➋ { مَعَ الَّذِيْنَ اَنْعَمَ اللّٰهُ عَلَيْهِمْ … : } یہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی اطاعت کے انعام کا ذکر ہے کہ انھیں انبیاء، صدیقین، شہداء اور صالحین کی معیت، یعنی ان کا ساتھ نصیب ہو گا۔ احادیث سے معلوم ہوتا ہے کہ صحابہ کرام رضی اللہ عنھم کو رسول صلی اللہ علیہ وسلم کے ساتھ رہنے کا شوق بہت زیادہ تھا، دنیا میں بھی وہ اس کے بہت مشتاق تھے اور انھیں جنت میں آپ کی معیت کا شوق تو حد سے زیادہ تھا۔ ربیعہ بن کعب اسلمی رضی اللہ عنہ بیان کرتے ہیں کہ میں نبی کریم صلی اللہ علیہ وسلم کے پاس رات بسر کیا کرتا تھا اور آپ کے لیے پانی اور دیگر ضروریات کا اہتمام کر دیا کرتا تھا، ایک دن آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ کچھ مانگ لو!‘‘ میں نے عرض کی : ’’میں آپ سے جنت میں آپ کی مرافقت (ساتھ) کا سوال کرتا ہوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ کوئی اور سوال؟‘‘ میں نے عرض کی : ’’وہ بھی یہی ہے۔‘‘ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ پھر سجدوں کی کثرت کے ساتھ اپنے بارے میں میری مدد کرو۔ ‘‘ [مسلم، الصلاۃ، باب فضل السجود والحث علیہ : ۴۸۹ ] یہ رسول اللہ صلی اللہ علیہ وسلم سے خالص محبت اور اطاعت کی برکت ہے کہ اگر عمل میں کچھ کمی ہوئی تب بھی اطاعت و اخلاص کی وجہ سے اتنے اونچے لوگوں کا ساتھ مل جائے گا۔ عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : ’’آپ اس شخص کے متعلق کیا فرماتے ہیں جو کچھ لوگوں سے محبت رکھتا ہے، مگر ابھی تک ( اعمال میں) ان سے نہیں مل سکا۔‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’آدمی اس کے ساتھ ہو گا جس سے اسے محبت ہو گی۔‘‘ [ بخاری، الأدب، باب علامۃ الحب فی اللہ…: ۶۱۶۹ ] حقیقت یہ ہے کہ اطاعت اور محبت لازم و ملزوم ہیں، وہ محبت جس میں اطاعت نہ ہو جھوٹی ہے اور وہ اطاعت جس کی بنیاد محبت نہ ہو، دکھاوا ہے۔ ہاں، محبت و اخلاص کے ساتھ عمل و اطاعت میں کچھ کمی ہو گی تو اللہ تعالیٰ اسے اپنے فضل سے پورا کر دے گا، انبیاء، صدیقین، شہداء اور صالحین سے زیادہ اچھا ساتھی کوئی نہیں اور اللہ کے فضل سے بڑی نعمت کوئی نہیں اور اللہ تعالیٰ لوگوں کے دلوں کے حالات خوب جانتا ہے کہ کسے کس کے ساتھ رکھنا ہے۔ ¤ انس رضی اللہ عنہ فرماتے ہیں : ’’مجھے رسول اللہ صلی اللہ علیہ وسلم سے محبت ہے، ابو بکر و عمر رضی اللہ عنھما سے محبت ہے، لہٰذا مجھے امید ہے کہ ان کے ساتھ محبت کی وجہ سے اللہ تعالیٰ مجھے ان کے ساتھ ہی اٹھائیں گے، گو میں ان جیسے عمل نہیں کر سکا۔‘‘ [ بخاری، فضائل أصحاب النبی صلی اللہ علیہ وسلم ، باب مناقب عمر بن الخطاب رضی اللہ عنہ … : ۳۶۸۸ ]"
    },
    {
      "Ayah": 71,
      "tafsir": "(آیت 71) اوپر کی آیات میں اللہ تعالیٰ اور اس کے رسول کی اطاعت کا حکم فرمایا اور اس کی ترغیب کے سلسلہ میں یہ بھی بتایا کہ اس اطاعت سے انبیاء، صدیقین، شہداء اور صالحین کی رفاقت حاصل ہو گی۔ اب اس آیت میں جہاد کا حکم فرمایا، جو سب سے مشکل اطاعت ہے اور کفار و منافقین سے پورا بچاؤ رکھنے کا حکم دیا اور فرمایا کہ حالات کے مطابق الگ الگ دستوں یا اکٹھے لشکر کی صورت نکلنے میں سے جو بہتر ہو اختیار کرو۔"
    },
    {
      "Ayah": 72,
      "tafsir": "(آیت 73،72) یہ مسلمانوں میں منافقوں کے کردار کا تذکرہ ہے، یعنی ان میں سے کچھ لوگ ایسے ہیں جو دیدہ و دانستہ اور حیلوں بہانوں سے جہاد پر نکلنے میں دیر کرتے ہیں اور پیچھے رہ جانے کی کوشش کرتے ہیں، پھر اگر اس سفر جہاد میں مسلمانوں کو کچھ تکلیف پہنچے تو بڑے خوش ہوتے ہیں اور کہتے ہیں کہ اللہ کا شکر ہے کہ میں پیچھے رہ گیا، ورنہ مجھے بھی وہ دکھ اٹھانا پڑتا جو دوسرے مسلمانوں نے اٹھایا ہے اور اگر مسلمانوں کو فتح و خوشی نصیب ہو اور غنیمت کا مال ہاتھ لگے تو حسرت سے کہتے ہیں کہ اگر ہم بھی ان میں شامل ہوتے تو ہمارا بھی کام بن جاتا۔ یہ جملہ وہ اس انداز سے ادا کرتے جیسے پہلے ان کا اور مسلمانوں کا کوئی تعلق تھا ہی نہیں۔ ان دونوں صورتوں میں انھیں محض دنیاوی تکلیف اور دنیاوی مفادات ہی کا احساس ہوتا ہے، اخروی زندگی یا رضائے الٰہی سے انھیں کبھی غرض نہیں ہوتی اور یہی ان کے منافق ہونے اور اللہ اور آخرت پر ایمان نہ رکھنے کی دلیل ہے۔"
    },
    {
      "Ayah": 73,
      "tafsir": "(آیت 73،72) یہ مسلمانوں میں منافقوں کے کردار کا تذکرہ ہے، یعنی ان میں سے کچھ لوگ ایسے ہیں جو دیدہ و دانستہ اور حیلوں بہانوں سے جہاد پر نکلنے میں دیر کرتے ہیں اور پیچھے رہ جانے کی کوشش کرتے ہیں، پھر اگر اس سفر جہاد میں مسلمانوں کو کچھ تکلیف پہنچے تو بڑے خوش ہوتے ہیں اور کہتے ہیں کہ اللہ کا شکر ہے کہ میں پیچھے رہ گیا، ورنہ مجھے بھی وہ دکھ اٹھانا پڑتا جو دوسرے مسلمانوں نے اٹھایا ہے اور اگر مسلمانوں کو فتح و خوشی نصیب ہو اور غنیمت کا مال ہاتھ لگے تو حسرت سے کہتے ہیں کہ اگر ہم بھی ان میں شامل ہوتے تو ہمارا بھی کام بن جاتا۔ یہ جملہ وہ اس انداز سے ادا کرتے جیسے پہلے ان کا اور مسلمانوں کا کوئی تعلق تھا ہی نہیں۔ ان دونوں صورتوں میں انھیں محض دنیاوی تکلیف اور دنیاوی مفادات ہی کا احساس ہوتا ہے، اخروی زندگی یا رضائے الٰہی سے انھیں کبھی غرض نہیں ہوتی اور یہی ان کے منافق ہونے اور اللہ اور آخرت پر ایمان نہ رکھنے کی دلیل ہے۔"
    },
    {
      "Ayah": 74,
      "tafsir": "(آیت 74) ➊ {فَلْيُقَاتِلْ فِيْ سَبِيْلِ اللّٰهِ … :} اوپر کی دو آیتوں میں جہاد سے پیچھے رہنے والوں اور دوسروں کو روکنے والوں، یعنی {’’ مُبَطِّئِيْنَ‘‘} کی مذمت کے بعد اب مخلصین کو ترغیب دی جا رہی ہے۔{’’ شَرَي يَشْرِيْ ‘‘} کے معنی بیچنا اور خریدنا دونوں آتے ہیں، یہاں ترجمہ بیچنے کا کیا گیا ہے اور اکثر مفسرین نے اسے ترجیح دی ہے، لیکن اگر اسے خریدنے کے معنی میں لیا جائے تو آیت کا مطلب یہ ہو گا کہ جو منافق گھر میں بیٹھے رہنے کی وجہ سے آخرت کے بدلے دنیا خرید رہے ہیں ان پر لازم ہے کہ اللہ تعالیٰ کی راہ میں جہاد کے لیے نکلیں اور آخرت کا نقصان کر کے دنیا حاصل نہ کریں۔ (فتح القدیر، طبری) ¤ ➋ { فَسَوْفَ نُؤْتِيْهِ اَجْرًا عَظِيْمًا:} یعنی مسلمانوں پر لازم ہے کہ دنیا کی زندگی پر نظر نہ رکھیں، بلکہ آخرت کی خواہش رکھیں اور سمجھیں کہ اللہ تعالیٰ کے حکم میں ہر طرح نفع ہے۔ (موضح) مطلب یہ کہ اللہ تعالیٰ کی راہ میں جنگ کے دو ہی نتیجے ہو سکتے ہیں، شہادت یا فتح اور دونوں مسلمانوں کے حق میں خوش کن ہیں، کیونکہ دونوں ہی میں اللہ تعالیٰ کی طرف سے اجر عظیم کا وعدہ ہے۔ اللہ تعالیٰ نے فرمایا : «{ قُلْ هَلْ تَرَبَّصُوْنَ بِنَاۤ اِلَّاۤ اِحْدَى الْحُسْنَيَيْنِ }» [ التوبۃ : ۵۲ ] ’’کہہ دے تم ہمارے بارے میں دو بہترین چیزوں میں سے ایک کے سوا کس کا انتظار کرتے ہو۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے اپنے راستے میں جہاد کرنے والے اس شخص کے لیے ضمانت دی ہے جسے اس کے راستے میں جہاد اور اس کے کلمات کی تصدیق کے سوا کوئی چیز نہیں نکالتی کہ وہ اسے جنت میں داخل کرے گا، یا اس کی رہائش گاہ پر لائے گا جہاں سے وہ نکلا تھا، ساتھ وہ اجر اور غنیمت بھی ہو گی جو اس نے حاصل کی۔‘‘ [ بخاری، فرض الخمس، باب قول النبی صلی اللہ علیہ وسلم : أحلت لکم الغنائم : ۳۱۲۳، عن أبی ھریرۃ رضی اللہ عنہ ]"
    },
    {
      "Ayah": 75,
      "tafsir": "(آیت 75) {وَ مَا لَكُمْ لَا تُقَاتِلُوْنَ … :} اس آیت کا تعلق بھی ترغیب جہاد سے ہے، یعنی دو وجوہ کی بنا پر تمھارے لیے کفار سے لڑنا ضروری ہے، اول اعلائے کلمۃ اللہ، یعنی اللہ کے دین کی سر بلندی کے لیے، دوم ان مظلوم مسلمانوں کو نجات دلانے کے لیے جو کفار کے چنگل میں بے بس پڑے ہیں۔ (قرطبی) مکہ معظمہ میں بہت سے لوگ ایسے رہ گئے تھے جو رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہجرت نہ کر سکے تھے اور ان کے اقارب ان پر تشدد کرنے لگے تھے، تاکہ انھیں اسلام سے پھیر کر پھر کافر بنا لیں۔ پس { ”الْقَرْيَةِ الظَّالِمِ اَهْلُهَا“ } سے مراد مکہ ہے اور مشرک ہونے کی وجہ سے یا مظلوم مسلمانوں کو ستانے کی وجہ سے اس کے باشندوں کو ظالم فرمایا ہے۔ ابن عباس رضی اللہ عنھما فرماتے ہیں کہ میں اور میری والدہ بھی ان { ”الْمُسْتَضْعَفِيْنَ“ } (بے بس مسلمانوں) میں شامل تھے (جنھیں اللہ تعالیٰ نے معذور قرار دیا)۔ [ بخاری، التفسیر، باب : «إلا المستضعفین من… » : ۴۵۹۷ ] مدینہ میں رسول اللہ صلی اللہ علیہ وسلم ان ”مستضعفين“ کے حق میں نام لے کر دعا فرمایا کرتے تھے : [ اَللّٰهُمَّ اَنْجِ الْوَلِيْدَ بْنَ الْوَلِيْدِ وَ سَلَمَةَ بْنَ هِشَامٍ وَ عَيَّاشَ بْنَ أَبِيْ رَبِيْعَةَ وَالْمُسْتَضْعَفِيْنَ مِنَ الْمُؤْمِنِيْنَ ] ’’یا اللہ! ولید بن ولید، سلمہ بن ہشام، عیاش بن ابی ربیعہ اور (مکہ میں گھرے ہوئے) دوسرے بے بس مسلمانوں کو رہائی دلا۔‘‘ [ بخاری، الأذان، باب یھوی بالتکبیر حین یسجد : ۸۰۴، عن أبی ھریرۃ رضی اللہ عنہ ] افسوس کہ اس وقت مسلمان کفار کے مختلف ممالک کی غلامی میں بے بس ہیں، وہ انھیں نہ آزادی دیتے ہیں، نہ نکلنے دیتے ہیں اور نہ کوئی مسلمان ملک انھیں قبول کرنے کے لیے تیار ہے، بتائیں اس وقت سے بڑھ کر جہاد کب فرض ہو گا؟ آیت میں مسلمانوں کو تمام مظلوم اور بے بس مردوں، عورتوں اور بچوں کو ظلم سے نجات دلانے کے لیے لڑنے کا حکم ہے، خواہ وہ مسلم ہوں یا غیر مسلم، جیسے اس وقت بھارت میں مسلمان اور شودر ہندو دونوں ظلم کا شکار ہیں۔"
    },
    {
      "Ayah": 76,
      "tafsir": "(آیت 76) {اَلَّذِيْنَ اٰمَنُوْا يُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ … :} جہاد کی فرضیت اور ترغیب کے بعد اس آیت میں بتایا کہ جہاد کی ظاہری صورت کا اعتبار نہیں ہے، بلکہ جہاد اپنے مقصد کے اعتبار سے جہاد ہے، مومن ہمیشہ اعلائے کلمۃ اللہ کے لیے جہاد کرتا ہے اور کافر کسی طاغوتی طاقت کو بچانے یا مضبوط کرنے کے لیے لڑتے ہیں، لہٰذا تم ان سے خوب لڑو۔ شیطان خواہ اپنے دوستوں کو کتنے ہی مکر و فریب سمجھائے، مگر تمھارے خلاف وہ کامیاب نہیں ہو سکتے۔"
    },
    {
      "Ayah": 77,
      "tafsir": "(آیت 77) ➊ { اَلَمْ تَرَ اِلَى الَّذِيْنَ قِيْلَ لَهُمْ …:} یعنی جب تک مسلمان مکہ میں تھے اور کافر انھیں ایذا دیتے تھے اللہ تعالیٰ نے انھیں لڑنے سے روکے رکھا اور صبر کا حکم فرمایا، اب جو ( مدینہ منورہ میں) لڑائی کا حکم آیا ہے تو ان کو سمجھنا چاہیے کہ ہماری مراد ملی، لیکن کچے مسلمان کنارہ کرتے ہیں اور موت سے ڈرتے ہیں اور اللہ کے برابر آدمیوں سے خطرہ کرتے ہیں۔ (موضح) متعدد روایات میں ہے کہ مسلمانوں نے مکی زندگی میں کئی دفعہ چاہا کہ ظالموں سے دو بدو نمٹیں مگر اللہ تعالیٰ کی طرف سے ان کو حکم ہوتا کہ ابھی نماز اور زکوٰۃ (مال خرچ کرنے) کا جو تمھیں حکم ہوا ہے اس کی خوب عادت ڈالو، تاکہ تمھاری تربیت ہو جائے، مدینہ منورہ میں بھی ہجرت کے ابتدائی برسوں میں مسلمانوں کی خواہش یہی تھی، لیکن جب اللہ تعالیٰ کی طرف سے لڑائی کی اجازت آگئی تو اب بعض خام قسم کے مسلمان اس سے ہچکچانے لگے، تو اس پر یہ آیت نازل ہوئی۔ (ابن کثیر، قرطبی) ¤ ➋ { لَوْ لَاۤ اَخَّرْتَنَاۤ اِلٰۤى اَجَلٍ قَرِيْبٍ:} شاہ عبد القادر رحمہ اللہ کا ترجمہ یہ ہے : ’’کیوں نہ جینے دیا ہم کو تھوڑی سی عمر‘‘ جواب آگے ہے۔ بعض نے ترجمہ کیا ہے : ’’قتال کی فرضیت کا یہ حکم نازل کرنے میں تو نے ہمیں کچھ مہلت کیوں نہ دی؟‘‘ ¤ ➌ { قُلْ مَتَاعُ الدُّنْيَا قَلِيْلٌ:} لڑائی سے ہچکچانے والے کمزور ایمان والوں اور منافقین کا حوصلہ دو باتوں سے بلند فرمایا ہے، پہلی تو یہ کہ دنیا کی بے ثباتی کا ذکر کر کے جہاد کی ترغیب دی ہے، دنیا جتنی بھی ہو فانی ہے اور فانی جتنی بھی ہو قلیل (بہت تھوڑی) ہے۔ فانی اور باقی کا مقابلہ ہی کیا ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جس طرح کوئی شخص سمندر میں انگلی ڈبو کر نکالے اور اس کی انگلی میں تھوڑی سی نمی رہ جائے، ایسی ہی مثال دنیا اور آخرت کی ہے۔ ‘‘ [ مسلم، الجنۃ و صفۃ نعیمہا، باب فناء الدنیا … : ۲۸۵۸، عن المستورد الفھری رضی اللہ عنہ ] اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’میری اور دنیا کی مثال ایک مسافر کی سی ہے جو ایک درخت کے سائے میں آرام کرتا ہے اور پھر اسے چھوڑ کر روانہ ہو جاتا ہے۔‘‘ [ترمذی، الزھد، باب حدیث ’’ ما الدنیا الإکراکب استظل‘‘ : ۲۳۷۷، عن ابن مسعود رضی اللہ عنہ ]"
    },
    {
      "Ayah": 78,
      "tafsir": "(آیت 78) ➊ {اَيْنَ مَا تَكُوْنُوْا يُدْرِكْكُّمُ الْمَوْتُ: ”بُرُوْجٍ“ } یہ {’’بُرْجٌ‘‘} کی جمع ہے، مضبوط عمارت، قلعہ۔ { ”مُشَيَّدَةٍ“ } جو {’’ اَلشِّيْدُ ‘‘} یعنی چونے سے بنے ہوئے ہوں۔ یہ جہاد کے لیے حوصلہ بڑھانے والی دوسری بات ہے کہ جب موت سے تمھیں کسی حال میں چھٹکارا نہیں تو پھر اللہ کی راہ میں جہاد سے کیوں ہچکچاتے ہو۔ اس مطلب کی آیات قرآن کریم میں بہت ہیں، چنانچہ فرمایا : «{ قُلْ لَّنْ يَّنْفَعَكُمُ الْفِرَارُ اِنْ فَرَرْتُمْ مِّنَ الْمَوْتِ اَوِ الْقَتْلِ }» [ الأحزاب : ۱۶ ] ’’کہہ دے تمھیں بھاگنا ہرگز نفع نہ دے گا اگر تم مرنے یا قتل ہونے سے بھاگو گے۔‘‘ اور فرمایا : «{ قُلْ اِنَّ الْمَوْتَ الَّذِيْ تَفِرُّوْنَ مِنْهُ فَاِنَّهٗ مُلٰقِيْكُمْ }» [الجمعۃ : ۸ ] ’’کہہ دے بلاشبہ وہ موت جس سے تم بھاگتے ہو سو یقینا وہ تم سے ملنے والی ہے۔‘‘ اور فرمایا : «{ كُلُّ نَفْسٍ ذَآىِٕقَةُ الْمَوْتِ }» [آل عمران : ۱۸۵ ] ’’ہر جان موت کو چکنے والی ہے۔‘‘ ¤ ➋ {وَ اِنْ تُصِبْهُمْ سَيِّئَةٌ … :} اوپر منافقین کی دو مذموم خصلتیں بتائیں، ایک جہاد سے جی چرانا دوسری موت سے ڈرنا، اب یہاں ان کی ایک اور مذموم خصلت کا ذکر فرمایا جو پہلی دونوں سے بری ہے، یعنی نحوست کی نسبت رسول اللہ صلی اللہ علیہ وسلم کی طرف کرنا۔ یہاں {”حَسَنَةٌ“} (بھلائی) سے مراد فتح، نصرت، غلبہ اور خوش حالی وغیرہ ہے اور {’’ سَيِّئَةٌ ‘‘} سے مراد لڑائی میں نقصان، مصیبت، قتل اور ہزیمت وغیرہ ہے۔ ¤ ➌ {قُلْ كُلٌّ مِّنْ عِنْدِ اللّٰهِ:} یہ ان کے کلام کا جواب ہے کہ برائی اور بھلائی دونوں اسی کی طرف سے اور اسی کے حکم سے ہیں، ہر چیز کا پیدا کرنے والا وہی ہے، بلا اور مصیبت کو کسی کی نحوست قرار دینا قطعی غلط اور پہلے کافروں کا طریقہ ہے، جیسا کہ قوم ثمود کا کہنا : «{ قَالُوا اطَّيَّرْنَا بِكَ وَ بِمَنْ مَّعَكَ }» [ النمل : ۴۷ ]’’انھوں نے کہا ہم نے تیرے ساتھ اور ان لوگوں کے ساتھ جو تیرے ہمراہ ہیں، بد شگونی پکڑی ہے۔‘‘ اور سورۂ یٰس میں ہے : «{ اِنَّا تَطَيَّرْنَا بِكُمْ }» [ یٰسٓ : ۱۸ ] ’’بے شک ہم نے تمھیں منحوس پایا ہے۔‘‘ اور فرعون کی قوم کے بارے میں ہے : «{ وَ اِنْ تُصِبْهُمْ سَيِّئَةٌ يَّطَّيَّرُوْا بِمُوْسٰى وَ مَنْ مَّعَهٗ }» [ الأعراف : ۱۳۱ ] ’’اور اگر انھیں کوئی تکلیف پہنچتی تو موسیٰ اور اس کے ساتھ والوں کے ساتھ نحوست پکڑتے۔‘‘ ¤ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’یہ منافقوں کا ذکر ہے کہ اگر تدبیر جنگ درست آئی اور فتح اور غنیمت ملی توکہتے ہیں کہ اللہ کی طرف سے ہوئی، یعنی اتفاقاً بن گئی۔ آپ صلی اللہ علیہ وسلم کی تدبیر کے قائل نہ ہوتے تھے اور اگر بگڑ گئی تو الزام رکھتے نبی صلی اللہ علیہ وسلم کی تدبیر پر۔ اللہ تعالیٰ نے فرمایا کہ سب اللہ کی طرف سے ہے، یعنی پیغمبر کی تدبیر اللہ کا الہام ہے، غلط نہیں اور اگر بگڑی تو اس کو بگڑا نہ بوجھو، یہ اللہ تم کو سدھاتا ہے تمھاری تقصیر پر۔ اگلی آیت میں کھول کر بیان فرما دیا۔‘‘ (موضح) ¤ ➍ {فَمَالِ هٰۤؤُلَآءِ الْقَوْمِ …:} یعنی تعجب ہے کہ کسی غور و فکر کے بغیر سمجھ میں آنے والی حقیقت بھی ان کی سمجھ میں نہیں آتی۔ (رازی)"
    },
    {
      "Ayah": 79,
      "tafsir": "(آیت 79) ➊ { مَاۤ اَصَابَكَ مِنْ حَسَنَةٍ …:} اس میں برائی اور بھلائی کا ایک قانون بیان فرما دیا ہے کہ بھلائی تو اللہ تعالیٰ کی طرف سے ہے اور جو برائی پہنچتی ہے اس کا بھیجنے والا بھی گو اللہ تعالیٰ ہی ہوتا ہے مگر اس کا سبب تمھارے گناہ ہوتے ہیں۔ (دیکھیے سورۂ شوریٰ : ۳۰) اس لیے سلف صالحین کا عام قاعدہ تھا کہ جب کوئی اجتہادی رائے پیش کرتے تو کہتے، اگر یہ صحیح ہے تو اللہ تعالیٰ کی طرف سے اور اسی کی توفیق سے ہے اور اگر غلط ہے تو ہماری طرف سے اور شیطان کی طرف سے ہے۔ ( ابن کثیر) اوپر کی آیت میں پیدا کرنے اور وجود میں لانے کے اعتبار سے {”حَسَنَةٍ“} اور { ”سَيِّئَةٍ“ } دونوں کو { ”مِنْ عِنْدِ اللّٰهِ“ } ( اللہ کی طرف سے) قرار دیا ہے کہ دونوں چیزیں اسی نے پیدا کی ہیں، لیکن یہاں سبب اور کسب کی مناسبت سے برائی کی نسبت انسان کی طرف کر دی ہے، لہٰذا کوئی تعارض نہیں ہے۔ (رازی) موضح میں ہے : ’’بندہ کو چاہیے کہ نیکی اللہ کا فضل سمجھے اور تکلیف اپنی تقصیر سے۔ تقصیروں سے اللہ واقف ہے اور وہی جزا دیتا ہے۔‘‘ ¤ ➋ { وَ اَرْسَلْنٰكَ لِلنَّاسِ رَسُوْلًا …:} یعنی آپ کا اصل منصب رسالت اور تبلیغ ہے اور اللہ گواہ ہے کہ آپ نے اس امانت کے ادا کرنے میں کسی قسم کی کوتاہی نہیں کی اور وہ کافی گواہ ہے، پھر اس کے بعد بھی اگر کسی کو ہدایت نہیں ہوتی تو آپ کا اس میں کوئی قصور نہیں۔ (رازی) نیز یہ آپ صلی اللہ علیہ وسلم کی عمومی رسالت کا بیان بھی ہے کہ آپ تمام لوگوں کی طرف بھیجے گئے ہیں۔دیکھیے سورۂ اعراف (۱۰۸) اور سورۂ سبا (۲۸)۔"
    },
    {
      "Ayah": 80,
      "tafsir": "(آیت 80) ➊ {مَنْ يُّطِعِ الرَّسُوْلَ …:} چونکہ نبی کریم صلی اللہ علیہ وسلم اللہ کے رسول اور مبلغ ہیں، اس لیے ان کی اطاعت اللہ کی اطاعت ہے، نماز، روزہ، حج، زکوٰۃ اور دوسرے شریعت کے احکام سب ایسے ہیں جنھیں آپ صلی اللہ علیہ وسلم کی توضیح کے بغیر سمجھنا ممکن نہیں، لہٰذا قرآن مجید سمجھنے کے لیے کوئی شخص سنت سے بے نیاز نہیں ہو سکتا۔ جس سے ثابت ہوتا ہے کہ آپ صلی اللہ علیہ وسلم کی اطاعت عین اللہ کی اطاعت ہے۔ [ تفصیل کے لیے ملاحظہ ہو الرسالۃ للشافعی رقم : (۵۷، ۵۸) أیضًابحث البیان الرابع ] ¤ ➋ {وَ مَنْ تَوَلّٰى فَمَاۤ اَرْسَلْنٰكَ عَلَيْهِمْ:} یعنی اس کے بعد بھی اگر لوگ گمراہ ہوتے ہیں تو اس کی ذمہ داری آپ پر نہیں، اس میں آپ صلی اللہ علیہ وسلم کو تسلی دی ہے۔ (رازی)"
    },
    {
      "Ayah": 81,
      "tafsir": "(آیت 81) {وَ يَقُوْلُوْنَ طَاعَةٌ …:} یہاں منافقین کی ایک اور مذموم خصلت بیان فرمائی ہے اور ان کو سرزنش کی ہے اور آپ صلی اللہ علیہ وسلم کو ان کی حرکات سیئہ سے چشم پوشی اور اللہ تعالیٰ پر توکل کا حکم فرمایا ہے۔ {”بَيَّتَ“} کا لفظ اصل میں{ ’’ بَيْتٌ ‘‘ } (گھر) سے ہے اور انسان چونکہ عموماً رات کو گھر میں رہتا ہے، اس لیے { ”بَاتَ“ } کے معنی رات گزارنے کے ہیں، پھر چونکہ رات کے فارغ اوقات میں آدمی اپنے معاملات پر غور و فکر کرتا ہے، اس لیے { ”بَيَّتَ“ } کا لفظ کسی معاملہ میں نہایت غور و فکر کے معنی میں استعمال ہونے لگا ہے۔ (رازی) یعنی دن کو وہ آپ کے سامنے اطاعت کا یقین دلاتے ہیں مگر رات کو ان کے بعض گروہ اس کے برعکس مشورے کرتے ہیں جو وہ دن کو آپ کے سامنے کہہ رہے تھے۔ اس ’’ طائفة‘‘ سے مراد لیڈر ہیں، کیونکہ عام لوگ تو ان کے پیچھے چلنے والے ہیں۔"
    },
    {
      "Ayah": 82,
      "tafsir": "(آیت 82) {اَفَلَا يَتَدَبَّرُوْنَ الْقُرْاٰنَ … : } منافقین کے مکر و فریب اور مذموم خصائل کے ضمن میں قرآن کی حقانیت کے اثبات کی ضرورت اس لیے پیش آئی کہ منافقین یہ سب مکر و فریب اور سازشیں اس بنا پر کر رہے تھے کہ وہ آپ کو سچا نبی نہیں سمجھتے تھے، لہٰذا یہاں آپ صلی اللہ علیہ وسلم کے صدقِ نبوت پر بطور دلیل کے قرآن کو پیش کیا اور قرآن حکیم آپ صلی اللہ علیہ وسلم کے صدق نبوت کی تین وجہوں سے دلیل بنتا ہے، اول اپنی فصاحت و بلاغت کے اعتبار سے۔ (دیکھیے بقرہ : ۲۳) دوم امور غیب کی خبروں پر مشتمل ہونے کی وجہ سے اور سوم اختلاف و تناقض سے پاک اور مبرا ہونے کی بنا پر۔ یہاں اسی تیسری چیز کو بیان فرمایا ہے۔ (رازی) مطلب یہ ہے کہ ایسا ممکن نہیں کہ ایک انسان برس ہا برس تک مختلف حالتوں میں مختلف موضوعات پر، خصوصاً امورِ غیب سے متعلق اس قدر تفصیل سے گفتگو کرتا رہے اور اس کی ایک بات بھی دوسری سے متصادم نہ ہو۔ یہ خصوصیت صرف قرآن میں پائی جاتی ہے، جو غور و فکر کرنے والے کے لیے اس کے کلام الٰہی ہونے کی دلیل ہے۔ (شوکانی) اختلاف سے پاک ہونا درجۂ فصاحت و بلاغت کے اعتبار سے بھی ہو سکتا ہے، کیونکہ کوئی انسان خواہ کتنا ہی فصیح و بلیغ کیوں نہ ہو، جب اتنی بڑی کتاب لکھے گا تو اس کے کلام میں قدرے تفاوت ضرور ہو گا اور ساری کتاب بلاغت میں یکساں مرتبہ کی نہیں ہو گی۔ پھر یہ منافقین خفیہ طور پر سازشیں کرتے رہتے ہیں اور وحی کے ذریعے سے رسول اللہ صلی اللہ علیہ وسلم کو ان کے بھید من و عن بتا دیے جاتے ہیں اور کبھی یہ نہیں ہوا کہ کسی راز کے افشا کرنے میں قرآن نے تھوڑی بہت بھی غلطی کی ہو اور یہی اس کے کلام الٰہی ہونے کی دلیل ہے۔ (رازی) ¤ معلوم ہوا کہ قرآن پاک میں تدبر کے بغیر انسان کے شکوک و شبہات دور نہیں ہو سکتے اور نہ قرآن صحیح طور پر سمجھ میں آ سکتا ہے۔ قرآنِ کریم اگر غیر اللہ کی طرف سے ہوتا تو اس میں اختلافِ کثیر ہوتا، اب یہ چونکہ اللہ تعالیٰ کی طرف سے ہے اس لیے اختلافِ کثیر کجا، سرے سے اس میں اختلاف ہے ہی نہیں۔"
    },
    {
      "Ayah": 83,
      "tafsir": "(آیت 83) ➊ { وَ اِذَا جَآءَهُمْ اَمْرٌ مِّنَ الْاَمْنِ اَوِ الْخَوْفِ …:} امن کی خبر یہ کہ مسلمانوں کو فتح ہوئی، یا دشمن کا لشکر واپس چلا گیا، جس سے مسلمان بے فکر ہو کر تیاری کم کر دیں وغیرہ اور خوف کی خبر یہ کہ فلاں مقام پر مسلمانوں کو شکست ہوئی، یا دشمن بہت بڑی تعداد میں حملہ آور ہونے والا ہے، جس سے مسلمانوں میں خوف و ہراس پھیلے۔ رسول اللہ صلی اللہ علیہ وسلم مسلمانوں کے مختلف سرایا (جنگی دستے) لڑائی کے لیے بھیجتے رہتے تھے، اس لیے اس قسم کی افواہیں مدینہ میں اکثر پہنچتی رہتی تھیں، لیکن منافقین اور بے احتیاط قسم کے مسلمان بجائے اس کے کہ انھیں سب سے پہلے آپ صلی اللہ علیہ وسلم یا آپ صلی اللہ علیہ وسلم کے ذمے دار اصحاب تک پہنچائیں، از خود ان افواہوں کی تشہیر شروع کر دیتے، ان کے اسی طرزِ عمل کی یہاں مذمت کی جا رہی ہے۔ (فتح القدیر، قرطبی) ¤ ➋ { يَسْتَنْۢبِطُوْنَهٗ:} اس کا مادہ {’’ نَبْطٌ ‘‘} ہے۔{ ’’ نَبْطٌ ‘‘} وہ پانی ہے جو کنواں کھودتے وقت سب سے پہلے نکلتا ہے، اس لیے{ ’’استنباط ‘‘} تحقیق اور بات کی تہ تک پہنچنے کو کہا جاتا ہے، اسی طرح مخفی بات کی حقیقت معلوم اور ظاہر کرنے کو بھی {’’ نَبْطٌ ‘‘ } اور { ”اِسْتِنْبَاطٌ“ } کہا جاتا ہے۔ کان کی گہرائی سے کوئی معدن نکالنے کو بھی {”اِسْتِنْبَاطٌ“} کہتے ہیں۔ «{ لَعَلِمَهُ الَّذِيْنَ يَسْتَنْۢبِطُوْنَهٗ مِنْهُمْ}» مسلمانوں سے کہا جا رہاہے کہ اگر امن یا خوف کی وہ خبر بلاتحقیق پھیلانے کے بجائے اللہ کے رسول اور مسلمانوں کے امراء کو پہنچاتے تو سب سے پہلے وہ غور و خوض اور تحقیق کر کے معلوم کرتے کہ خبر صحیح بھی ہے یا غلط، کیونکہ بلا تحقیق آگے بات کرنے کو رسول اللہ صلی اللہ علیہ وسلم نے جھوٹ قرار دیا ہے، چنانچہ فرمایا : [كَفٰي بِالْمَرْءِ كَذِبًا أَنْ يُّحَدِّثَ بِكُلِّ مَّا سَمِعَ ] [ مسلم، المقدمۃ، باب النھی عن الحدیث بکل ما سمع : ۵ ]’’آدمی کو جھوٹا ہونے کے لیے اتنا ہی کافی ہے کہ جو کچھ سنے (بلاتحقیق) آگے بیان کر دے۔‘‘ پھر وہ ذمے دار حضرات فیصلہ کرتے کہ اس خبر کی اشاعت کرنی چاہیے یا نہیں، اس کے بعد اگر وہ قابل اشاعت ہوتی تو اسے نشر کرتے، ورنہ روک دیتے۔ انفرادی زندگی میں عموماً اور اجتماعی زندگی میں خصوصاً اس ہدایت پر عمل نہایت ضروری ہے، ورنہ اس بے احتیاطی کے بے حد نقصانات ہو سکتے ہیں، بالخصوص جنگ کے ایام میں، جب خبریں اور افواہیں فوجی کارروائیوں سے بڑھ کر تاثیر رکھتی ہیں، خبروں کے محاذ کو بھی جنگ کا زبردست محاذ سمجھ کر اس کے مطابق معاملہ کرنا چاہیے۔ ¤ ➌ { اِلَّا قَلِيْلًا:} شاہ عبد القادر رحمہ اللہ لکھتے ہیں کہ یہ جو فرمایا : ’’ اگر اللہ کا فضل تم پر نہ ہوتا تو شیطان کے پیچھے چلتے مگر تھوڑے‘‘ یعنی ہر وقت احکام تربیت کے نہ پہنچتے رہیں تو کم لوگ ہدایت پر قائم رہیں۔ (موضح)"
    },
    {
      "Ayah": 84,
      "tafsir": "(آیت 84) ➊ {فَقَاتِلْ فِيْ سَبِيْلِ اللّٰهِ لَا تُكَلَّفُ اِلَّا نَفْسَكَ … :} اوپر کی آیات میں جہاد کی ترغیب دی، اس کے بعد منافقین کی سر گرمیوں کا ذکر کیا اور اب اس آیت میں فرمایا کہ آپ ان منافقین کے ساتھ ہونے یا نہ ہونے کی پروا نہ کریں، آپ کی ذمہ داری ہے کہ آپ خود جہاد کے لیے نکلیں اور دوسرے مومنوں کو بھی ترغیب دیں۔ ابو اسحاق بیان کرتے ہیں کہ میں نے براء بن عازب رضی اللہ عنہ سے پوچھا : ’’جو شخص مشرکوں پر حملہ کرتا ہے تو کیا وہ اپنے آپ کو ہلاکت میں ڈالتا ہے ؟‘‘ انھوں نے جواب دیا : ’’نہیں، کیونکہ اللہ تعالیٰ نے اپنے رسول کو مبعوث کیا اور ان سے فرمایا : «{ فَقَاتِلْ فِيْ سَبِيْلِ اللّٰهِ لَا تُكَلَّفُ اِلَّا نَفْسَكَ }» اور جس آیت کا آپ حوالہ دے رہے ہیں : «{ وَ لَا تُلْقُوْا بِاَيْدِيْكُمْ اِلَى التَّهْلُكَةِ }» [ البقرۃ : ۱۹۵ ] اس کا تعلق تو اللہ کے راستے میں خرچ کرنے ( اور نہ کرنے) سے ہے۔‘‘ [ مسند أحمد : 281/4، ح : ۱۸۵۰۶ ] اس سے معلوم ہوا کہ جہاد کے لیے کئی شرطیں لوگ اپنے پاس ہی سے بنا لیتے ہیں۔ ¤ ➋ { عَسَى اللّٰهُ اَنْ يَّكُفَّ بَاْسَ الَّذِيْنَ كَفَرُوْا: } اللہ تعالیٰ کے لیے {”عَسَى“} کا لفظ یقین کے معنی میں استعمال ہوتا ہے، پس آیت میں وعدہ کیا جا رہا ہے کہ عنقریب کفار کا زور ٹوٹ جائے گا اور مسلمانوں کو غلبہ نصیب ہو گا۔"
    },
    {
      "Ayah": 85,
      "tafsir": "(آیت 85) { مَنْ يَّشْفَعْ شَفَاعَةً حَسَنَةً … :} اوپر کی آیت میں رسول اللہ صلی اللہ علیہ وسلم کو حکم دیا کہ مومنوں کو جہاد کی ترغیب دو، جو اعمالِ حسنہ میں سے ہے، یہاں بتایا کہ آپ صلی اللہ علیہ وسلم کو اس پر اجر عظیم ملے گا۔ پس یہاں شفاعت حسنہ سے ترغیب جہاد مراد ہے اور شفاعت سیئہ سے مراد اس کارخیر سے روکنا ہے، دوسرے کاموں کے لیے سفارش کا بھی یہی حکم ہے۔ نبی صلی اللہ علیہ وسلم نے فرمایا : ’’تم سفارش کرو تمھیں اجر دیا جائے گا اور اللہ تعالیٰ اپنے نبی کی زبان پر جو چاہے گا فیصلہ فرمائے گا۔‘‘ [ بخاری، الزکاۃ، باب التحریض علی الصدقۃ… : ۱۴۳۲، عن أبی موسٰی رضی اللہ عنہ ]"
    },
    {
      "Ayah": 86,
      "tafsir": "(آیت 86){ وَ اِذَا حُيِّيْتُمْ بِتَحِيَّةٍ فَحَيُّوْا بِاَحْسَنَ مِنْهَاۤ … :} جہاد کا حکم دینے کے بعد اب صلح کے بعض احکام بیان فرمائے، چنانچہ فرمایا کہ اگر کفار کی طرف سے جنگ ختم کرنے اور صلح کرنے کی کوئی پیش کش کی جاتی ہے تو تم اس سے اچھا جواب دو یا کم از کم اتنی پیش کش ضرور قبول کرو۔ دوسری جگہ فرمایا : «{ وَ اِنْ جَنَحُوْا لِلسَّلْمِ فَاجْنَحْ لَهَا وَ تَوَكَّلْ عَلَى اللّٰهِ }» [ الأنفال : ۶۱ ] ’’اور اگر وہ صلح کی طرف مائل ہوں تو تو بھی اس کی طرف مائل ہو جا اور اللہ پر بھروسا کر۔‘‘ ایک مصداق اس آیت کا یہ ہے کہ جہاد کے سفر کے دوران کوئی شخص اگر اطاعت کے اظہار کے لیے یا اسلام قبول کرنے کے اظہار کے لیے سلام کہے تو یہ کہہ کر اسے قتل مت کرو کہ تو مومن نہیں۔ (دیکھیے نساء : ۹۴) اور ایک مصداق وہ ہے جو آیت کے صریح الفاظ سے واضح ہو رہا ہے کہ جب کوئی شخص تمھیں سلام کہے تو اسے اس سے بہتر الفاظ میں جواب دو۔ { ”تَحِیَّۃٌ“ ’’حَيَاةٌ‘‘} میں سے باب تفعیل کا مصدر ہے، زندگی کی یا سلامتی کی دعا دینا، مراد سلام ہے۔ بہتر جواب دینے کی تفسیر حدیث میں اس طرح آئی ہے کہ{’’اَلسَّلاَمُ عَلَيْكُمْ‘‘} کے جواب میں {’’ وَ رَحْمَةُ اللّٰهِ ‘‘} کا اضافہ اور {’’ اَلسَّلاَمُ عَلَيْكُمْ وَ رَحْمَةُ اللّٰهِ ‘‘} کے جواب میں {’’ وَ بَرَكَاتُهٗ ‘‘} کا اضافہ کر دیا جائے، لیکن اگر کوئی شخص یہ سارے الفاظ بول دے تو انھی کے ساتھ جواب دیا جائے۔ {”وَمَغْفِرَتُهُ وَ رِضْوَانُهُ“} وغیرہ کا اضافہ صحیح حدیث سے ثابت نہیں۔ ہر لفظ کے اضافے کے ساتھ دس نیکیاں زیادہ ہوتی جائیں گی۔ [ أحمد : 439/4، ۴۴۰، ح : ۱۹۹۷۰ ] گویا کوئی شخص جتنا سلام کہے اتنا جواب دینا فرض ہے، زائد مستحب ہے۔"
    },
    {
      "Ayah": 87,
      "tafsir": ""
    },
    {
      "Ayah": 88,
      "tafsir": "(آیت 88) یعنی تم ان منافقین کے بارے میں دو گروہ کیوں ہو گئے، تمھیں تو ان کے متعلق ایک رائے پر متفق ہونا چاہیے۔ زید بن ثابت رضی اللہ عنہ سے روایت ہے کہ جب نبی صلی اللہ علیہ وسلم غزوۂ احد کے لیے نکلے توکچھ لوگ آپ کا ساتھ چھوڑ کر راستے ہی سے واپس ہو گئے، ان کے بارے میں مسلمانوں کے دو گروہ ہو گئے، ایک گروہ کہنے لگا، آپ انھیں قتل کریں اور دوسرا گروہ اس کے خلاف تھا، تو یہ آیت اتری : «{ فَمَا لَكُمْ فِي الْمُنٰفِقِيْنَ فِئَتَيْنِ }» اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ طیبہ ہے، یہ گند کو اس طرح دور کر دیتا ہے جیسے آگ چاندی کے گند کو۔‘‘ [ بخاری، التفسیر، باب : { فما لکم فی المنافقین… } : ۴۵۸۹ ] شوکانی رحمہ اللہ نے فرمایا، یہ حدیث اس آیت کے اسباب نزول میں سب سے زیادہ صحیح ہے۔"
    },
    {
      "Ayah": 89,
      "tafsir": "(آیت 89) {وَدُّوْا لَوْ تَكْفُرُوْنَ كَمَا كَفَرُوْا فَتَكُوْنُوْنَ سَوَآءً … : } معلوم ہوتا ہے کہ یہ منافقوں کی وہ قسم تھی جو مدینہ کے ارد گرد پھیلے ہوئے قبائل سے تعلق رکھتی تھی، دلیل اس کی یہ الفاظ ہیں : «{ فَلَا تَتَّخِذُوْا مِنْهُمْ اَوْلِيَآءَ حَتّٰى يُهَاجِرُوْا فِيْ سَبِيْلِ اللّٰهِ }» ’’تو ان میں سے کسی طرح کے دوست نہ بناؤ، یہاں تک کہ وہ اللہ کے راستے میں ہجرت کریں۔‘‘ یہ لوگ مسلمانوں سے خیر خواہی اور محبت کا اظہار ضرور کرتے تھے مگر عملی طور پر اپنے ہم وطن کافروں کا ساتھ دیتے تھے، یا ساتھ دینے پر مجبور تھے۔ ان کے لیے معیار یہ مقرر کیا گیا کہ اگر وہ ہجرت کر کے تمھارے پاس مدینہ آ جائیں اور تمھیں ان کے ایمان کا یقین ہو جائے تو اس صورت میں تم انھیں سچا بھی سمجھو اور ہمدرد بھی اور اگر وہ ہجرت کرنے سے انکار کریں تو اگرچہ وہ اسلام کا اظہار کریں ان سے کافروں جیسا سلوک کرو، کیونکہ دارالکفرمیں چلے جانے کے بعد ان کا کفر کھل کر سامنے آ گیا، اس لیے انھیں گرفتار کرو اور حل و حرم میں جہاں پاؤ انھیں قتل کرو اور انھیں اپنا دوست نہ بناؤ۔"
    },
    {
      "Ayah": 90,
      "tafsir": "(آیت 90) { اِلَّا الَّذِيْنَ يَصِلُوْنَ اِلٰى قَوْمٍۭ … :} منافقین کے سلسلے میں جو اوپر حکم بیان ہوا اس سے دو قسم کے لوگوں کو اللہ تعالیٰ نے اس آیت میں مستثنیٰ کر دیا اور فرمایا کہ انھیں نہ قید کرو اور نہ ان سے قتال ( لڑائی) کرو۔ ایک تو وہ منافقین جو کسی ایسی قوم کے پاس جا کر پناہ لے لیں یا حلیف بن جائیں جن کے ساتھ مسلمانوں کا صلح اور امن کا معاہدہ ہو تو وہ انھی کے حکم میں ہو جائیں گے، ورنہ عہد ٹوٹ جائے گا اور جنگ چھڑ جائے گی اور دوسرے وہ لوگ جو اپنی صلح جوئی کی وجہ سے نہ مسلمانوں سے جنگ کرنا چاہتے ہیں اور نہ مسلمانوں کے ساتھ مل کر اپنی قوم سے جنگ کرنا چاہتے ہیں۔"
    },
    {
      "Ayah": 91,
      "tafsir": "(آیت 91) {سَتَجِدُوْنَ اٰخَرِيْنَ …:} اس آیت کریمہ میں ایک تیسری قسم کے لوگوں کا حال بیان کیا گیا ہے جو بہت ہی بد ترین قسم کے منافق ہیں، جو ڈھنڈورا تو اپنی امن پسندی کا پیٹتے ہیں مگر جب داؤ لگ جائے تو اسلام دشمنی میں کوئی کسر اٹھا نہیں رکھتے۔ ان کا امن پسندی کا دعویٰ سچا ہونے کی تین ہی صورتیں ممکن ہیں، ایک یہ کہ مسلمانوں سے صلح کر لیں، دوسرے یہ کہ لشکر کفار میں شامل نہ ہوں اور تیسرے یہ کہ اگر انھیں مجبوراً شامل ہونا ہی پڑے تو پھر اپنے ہاتھ روکے رکھیں، یعنی عملاً لڑائی میں شامل نہ ہوں، جیسا کہ جنگ بدر میں عباس رضی اللہ عنہ کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ انھیں قتل نہ کیا جائے، کیونکہ وہ مجبور کر کے لائے گئے ہیں۔ اگر یہ تینوں باتیں نہ پائی جائیں تو اس کا مطلب ہے کہ ان کی نیتوں میں فتور ہے اور وہ امن پسندی کی آڑ میں دھوکا دے کر مسلمانوں سے انتقام لینا چاہتے ہیں، لہٰذا ایسے منافقوں کا علاج یہ ہے کہ انھیں پکڑو اور جہاں ملیں قتل کر دو۔"
    },
    {
      "Ayah": 92,
      "tafsir": "(آیت 92) ➊ { وَ مَا كَانَ لِمُؤْمِنٍ اَنْ يَّقْتُلَ مُؤْمِنًا اِلَّا خَطَـًٔا:} کفار کے ساتھ جنگ کی اجازت نازل ہوئی تو یہ عین ممکن تھا کہ کسی شخص کو کافر حربی ( جس سے جنگ ہو) سمجھ کر مسلمان قتل کر دیں اور بعد میں معلوم ہو کہ وہ مسلمان تھا، اس لیے اس آیت میں اللہ تعالیٰ نے مسلمان کے قتل خطا کے احکام بیان فرما دیے۔ (رازی) آیت میں {”اِلَّا“} بمعنی { ”لٰكِنْ“ } ہے اور مستثنیٰ منقطع ہے، یعنی کسی بھی حال میں مسلمان کو قتل کرنا جائز نہیں ہے، لیکن اگر غلطی سے مارا جائے تو اس پر کفارہ ہے، جس کا بعد میں ذکر ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’کسی آدمی کا خون، جو یہ گواہی دیتا ہو کہ اللہ کے سوا کوئی معبود برحق نہیں اور میں اللہ کا رسول ہوں، تین صورتوں میں سے کسی ایک کے سوا حلال نہیں : (1) جان کے بدلے جان۔ (2) شادی شدہ بدکار۔ (3) اسلام کو چھوڑنے والا (مرتد) جماعت سے علیحدگی اختیار کرنے والا۔‘‘ [ بخاری، الدیات، باب قول اللہ تعالٰی : «أن النفس بالنفس والعین بالعین» : ۶۸۷۸، عن عبد اللہ رضی اللہ عنہ ] ¤ ➋ { وَ مَنْ قَتَلَ مُؤْمِنًا خَطَـًٔا فَتَحْرِيْرُ … :} یعنی جب کوئی مسلمان غلطی سے کسی مسلمان کو قتل کر دے تو اس کے دو حکم ہیں، ایک کفارہ دوسرا دیت یعنی خون بہا۔ کفارہ تو یہ ہے کہ وہ ایک مسلمان غلام ( مرد یا عورت) کو آزاد کرے اور اگر اس کی طاقت نہ ہو تو دو ماہ کے مسلسل روزے رکھے اوراس کے وارثوں کو دیت ادا کرے، کفارہ تو کسی حال میں ساقط نہیں ہوتا، ہاں، دیت اگر وارث معاف کر دیں تو ساقط ہو سکتی ہے، مگر یہ اس وقت ہے کہ جب مقتول کے وارث بھی مسلمان ہوں یا کافر ہوں لیکن ان سے معاہدہ ہو یا ذمی ہوں، جیسے آگے آ رہا ہے۔ ¤ ➌ { فَاِنْ كَانَ مِنْ قَوْمٍ عَدُوٍّ لَّكُمْ … :} لیکن اگر اس کے وارث حربی کافر ہوں تو پھر قاتل کے ذمے صرف کفارہ ہے، یعنی ایک مسلمان گردن آزاد کرنا، اگر نہ ہو سکے تو دو ماہ کے مسلسل روزے رکھنا۔ مقتول کے وارثوں کو خون بہا ادا کرنے کی ضرورت نہیں ہے، کیونکہ وہ دشمن ہیں۔ (قرطبی) ¤ ➍ { وَ اِنْ كَانَ مِنْ قَوْمٍۭ بَيْنَكُمْ وَ بَيْنَهُمْ مِّيْثَاقٌ …:} اس جملے کا مطلب یہ ہے کہ اگر وہ مقتول مسلمان ایسی قوم سے تعلق رکھتا ہے جن سے تمھارا معاہدہ ہے، یا ذمی ہیں تو اس صورت میں بھی دو چیزیں واجب ہوں گی، دیت ( خون بہا) اور کفارہ۔ یہاں دیت کو کفارہ سے پہلے ذکر فرمایا ہے کہ اسے غیر مسلم قوم کا فرد سمجھ کر دیت کی ادائیگی میں کوتاہی نہ کی جائے۔ بعض نے لکھا ہے کہ اس سے مراد یہ ہے کہ وہ مقتول معاہد یا ذمی ہو (مسلمان نہ ہو) تو اس صورت میں بھی کفارہ اور وارثوں کو خون بہا ادا کرنا پڑے گا، مگر زیادہ صحیح بات یہی معلوم ہوتی ہے کہ یہاں بھی مسلمان مقتول ہی کی بات ہو رہی ہے۔ دیت ایک سو اونٹ یا اس کے اندازے کے ساتھ قیمت ہو گی، جو خطا کی نوعیت کے لحاظ سے مختلف ہو گی۔ ¤ ➎ { شَهْرَيْنِ مُتَتَابِعَيْنِ:} اگر کوئی کسی شرعی عذر یعنی مرض، حیض، نفاس وغیرہ کے بغیر ایک روزہ بھی چھوڑے گا تو نئے سرے سے دوبارہ دو ماہ کے روزے رکھنے پڑیں گے۔ (قرطبی)"
    },
    {
      "Ayah": 93,
      "tafsir": "(آیت 93){ وَ مَنْ يَّقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا … :} قتلِ خطا کا حکم بیان کرنے کے بعد اب اس آیت میں قتلِ عمد ( قصداً قتل کرنے) کا حکم بیان فرمایا ہے، اس کا ایک حکم تو بیان ہو چکا ہے، یعنی اس صورت میں قصاص یا دیت واجب ہے، یا مقتول کے وارث کچھ معاف کر دیں۔ (دیکھیے بقرہ : ۱۷۸) یہاں صرف اس کے گناہ اور وعید کا ذکر ہے۔ متعدد آیات میں اللہ تعالیٰ نے اس جرم کو اشراک باللہ کے ساتھ ذکر کیا ہے، یہاں فرمایا کہ اس کی جزا جہنم ہے جس میں ہمیشہ رہے اور اللہ تعالیٰ اس پر غصے ہو گیا اور اس پر لعنت کی اور اس کے لیے عذاب عظیم تیار کیا ہے۔ اتنی سخت سزائیں یکجا ذکر کرنے سے اس گناہ کی شدت کا اندازہ ہوتا ہے اور بظاہر یہی سمجھ میں آتا ہے کہ مومن کو قصداً قتل کرنے والا ابدی جہنمی ہے اور اس کی توبہ بھی قبول نہیں۔ مگر سورۂ فرقان (۶۸) میں قتل عمد کی توبہ قبول ہونے کا ذکر ہے۔ اب بعض مفسرین کا کہنا تو یہ ہے کہ جان بوجھ کر کسی مومن کو قتل کرنے کی توبہ اس وقت قبول ہے جب اس نے حالت کفر میں یہ قتل کیا ہو، مسلمان ہونے کے بعد کسی مسلم کو قتل کرے تو اس کی توبہ قبول نہیں، بلکہ {”خٰلِدًا فِيْهَا“} کے الفاظ سے اس کا ابدی جہنمی ہونا ثابت ہوتا ہے۔ ابن عباس رضی اللہ عنھما کا رجحان بھی اسی طرف ہے۔ [ بخاری، التفسیر، باب قولہ : «والذین لایدعون…» : ۴۷۶۲ ] مگر اکثر سلف اس کی توبہ قبول ہونے کے قائل ہیں، کیونکہ (1) شرک باللہ سے بڑا کوئی گناہ نہیں، وہ توبہ سے معاف ہو سکتا ہے تو یہ بھی معاف ہو سکتا ہے۔ (2) اس آیت میں یہ نہیں فرمایا کہ وہ آگ میں ہمیشہ رہے گا، بلکہ فرمایا یہ ہے (کہ یہ جرم اتنا بڑا ہے) کہ اس کی جزا جہنم میں ہمیشہ رہنا ہے، باقی اللہ معاف کرنا چاہے تو توبہ کے بعد یا توبہ کے بغیر بھی معاف کر سکتا ہے، جیسا کہ فرمایا : «{ اِنَّ اللّٰهَ لَا يَغْفِرُ اَنْ يُّشْرَكَ بِهٖ وَ يَغْفِرُ مَا دُوْنَ ذٰلِكَ لِمَنْ يَّشَآءُ }» [ النساء : ۴۸ ] ’’بے شک اللہ اس بات کو نہیں بخشے گا کہ اس کا شریک بنایا جائے اور بخش دے گا جو اس کے علاوہ ہے، جسے چاہے گا۔‘‘ لہٰذا یہ اللہ کی مشیت پر ہے چاہے تو سزا دے کر معاف کر دے، چاہے تو ویسے ہی معاف کر دے۔ خصوصاً توبہ کے بعد تو واضح بشارت موجود ہے : «{ لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ اِنَّ اللّٰهَ يَغْفِرُ الذُّنُوْبَ جَمِيْعًا }» [ الزمر : ۵۳ ] ’’اللہ کی رحمت سے ناامید نہ ہو جاؤ، بے شک اللہ سب کے سب گناہ بخش دیتا ہے۔‘‘ (3) بنی اسرائیل کا وہ مسلمان جس نے سو آدمی قتل کیے تھے، اس کا واقعہ بھی قتل عمد کی توبہ کے قبول ہو سکنے کی دلیل ہے۔ [بخاری، أحادیث الأنبیاء، باب : ۳۴۷۰ ] ¤ بعض اہل علم نے فرمایا کہ وہ قاتلِ عمد ابدی جہنمی ہے جو اس عمل کو جائز سمجھے، کیونکہ شریعت کے حرام کام کو حلال سمجھنا کفر ہے اور جنت کی نعمتیں کفار پر حرام ہیں، فرمایا : «{ اِنَّ اللّٰهَ حَرَّمَهُمَا عَلَى الْكٰفِرِيْنَ}» [ الأعراف : ۵۰ ] ’’بے شک اللہ نے یہ دونوں چیزیں کافرو ں پر حرام کر دی ہیں۔‘‘ بے شک اللہ تعالیٰ نے (جنت کا پانی اور رزق) دونوں چیزیں کافروں پر حرام کر دی ہیں مگر اس صورت میں اس کے ہمیشہ جہنم میں رہنے کا باعث قتل عمد نہیں بلکہ کفر ہو گا۔"
    },
    {
      "Ayah": 94,
      "tafsir": "(آیت 94) ➊ {فَتَبَيَّنُوْا وَ لَا تَقُوْلُوْا …:} ابن عباس رضی اللہ عنھما فرماتے ہیں کہ ایک شخص اپنی تھوڑی سی بکریوں کے پاس تھا، کچھ مسلمان وہاں سے گزرے، اس نے {’’اَلسَّلاَمُ عَلَيْكُمْ‘‘} کہا لیکن مسلمانوں نے اسے قتل کر ڈالا اور اس کی بکریاں لے لیں، اس پر اللہ تعالیٰ نے یہ آیت اتاری، جس میں ہے : «{ تَبْتَغُوْنَ عَرَضَ الْحَيٰوةِ الدُّنْيَا }» ’’تم دنیا کا سامان چاہتے ہو ؟‘‘ اس سے مراد وہ تھوڑی سی بکریاں ہیں۔ [ بخاری، التفسیر، باب : { ولا تقولوا لمن ألقیٰ… }: ۴۵۹۱ ] ¤ ➋ {فَتَبَيَّنُوْا :} یہاں تبین یعنی تحقیق کر لینے کا حکم سفر کے ساتھ ذکر کیا ہے، مگر یہاں سفر کی قید بیان واقعہ کے لیے ہے، یعنی یہ حادثہ جس سے متعلق آیت نازل ہوئی ہے، سفر میں پیش آیا تھا، ورنہ تحقیق کا حکم جس طرح سفر میں ہے اسی طرح حضر میں بھی ہے۔ (قرطبی) ¤ ➌ { كَذٰلِكَ كُنْتُمْ مِّنْ قَبْلُ:} یعنی یہی حالت پہلے تمھاری تھی، تم کافروں کے شہر میں رہتے تھے اور اپنے ایمان کو چھپاتے تھے، اللہ تعالیٰ نے دین کو غالب کر کے تم پر احسان کیا۔ (قرطبی)"
    },
    {
      "Ayah": 95,
      "tafsir": "(آیت 95) ➊ { لَا يَسْتَوِي الْقٰعِدُوْنَ مِنَ الْمُؤْمِنِيْنَ …:} جہاد کے فرضِ عین ہونے کی صورت میں تو کسی شخص کو بلا عذر گھر میں بیٹھ رہنے کی اجازت ہی نہیں بلکہ ایسی صورت میں جہاد میں شامل نہ ہونا صریح نفاق ہے، مگر جب نفیر عام (سب کے نکلنے) کا حکم نہ ہو اور امام کی طرف سے یہ اعلان کیا جائے کہ جو شخص جہاد کے لیے نکل سکتا ہو نکلے اور جو اپنے کام کی وجہ سے نہیں نکل سکتا اسے اپنے گھر میں بیٹھے رہنے کی اجازت ہے، تو ایسی صورت میں جو شخص جہاد کے لیے نکلے اس آیت میں اس کی فضیلت کا ذکر ہے یعنی جہاد کے لیے نکلنا لازم نہ ہونے کے باوجود جو لوگ جہاد کے لیے نکلتے ہیں اور جو گھروں میں بیٹھے رہتے ہیں دونوں برابر نہیں ہو سکتے۔ زید بن ثابت رضی اللہ عنہ سے روایت ہے کہ جب یہ آیت نازل ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے مجھے بلایا، میں کتابت کے لیے حاضر ہوا تو عبد اللہ بن ام مکتوم رضی اللہ عنہ، جو نابینا تھے، آ گئے اور کہنے لگے، اللہ کی قسم ! اے اللہ کے رسول ! اگر میں آپ کے ہمراہ جہاد کر سکتا ہوتا تو ضرور کرتا، تو اسی وقت اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم پر وحی نازل فرمائی اور {”غَيْرُ اُولِي الضَّرَرِ“} ( جو کسی تکلیف والے نہیں) کا کلمہ نازل ہوا اور آپ صلی اللہ علیہ وسلم نے مجھے لکھوا دیا۔ [ بخاری، التفسیر، باب : « لا یستوی القاعدون من المؤمنین » : ۴۵۹۲ ] معلوم ہوا کہ جس شخص کی نیت جہاد کی ہو مگر اسے کوئی تکلیف ہو اور وہ کسی عذر کی بنا پر جہاد میں شریک نہ ہو سکے وہ مجاہدین کے برابر ہو سکتا ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مدینہ میں کچھ لوگ ایسے بھی ہیں کہ تم نے جس قدر سفر کیا اور جتنی وادیاں طے کیں وہ تمھارے ساتھ تھے۔‘‘ صحابہ نے عرض کیا : ’’اے اللہ کے رسول! وہ تو مدینہ میں ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ (ہاں) اگرچہ وہ مدینہ میں ہیں، لیکن انھیں کسی عذر نے جہاد میں شرکت سے روکا ہے۔‘‘ [ بخاری، المغازی، بابٌ : ۴۴۲۳، عن أنس رضی اللہ عنہ ] کئی دوسری روایات سے بھی اس کی تائید ہوتی ہے، عبد اللہ بن عمرو رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مسلمانوں میں سے کسی شخص کو بھی اس کے جسم میں کوئی آزمائش آتی ہے تو اللہ تعالیٰ ان محافظ فرشتوں کو حکم دیتا ہے جو اس کی حفاظت کرتے ہیں کہ میرے بندے کے لیے اسی طرح عمل لکھ دو جس طرح وہ اس وقت عمل کرتا تھا جب وہ تندرست تھا جب تک وہ میری گرفت میں رہے۔ [ أحمد، ۲؍۱۹۴، ح : ۶۸۲۵، صحیح علی شرط مسلم ] ¤ ➋ { وَ كُلًّا وَّعَدَ اللّٰهُ الْحُسْنٰى:} یعنی جان و مال سے جہاد کرنے والوں کو جو فضیلت حاصل ہو گی، جہاد میں حصہ نہ لینے والے اگرچہ اس سے محروم رہیں گے، تاہم اللہ تعالیٰ نے دونوں کے ساتھ ہی بھلائی کا وعدہ کیا ہے۔ اس سے علماء نے استدلال کیا ہے کہ عام حالات میں جہاد کے لیے نکلنا فرض عین نہیں، فرض کفایہ ہے، یعنی اگر بقدر ضرورت آدمی جہاد میں حصہ لے لیں تو اس علاقے کے دوسرے لوگوں کی طرف سے بھی یہ فرض ادا شدہ سمجھا جائے گا، لیکن اگر بقدر ضرورت نہ نکلیں تو تمام لوگ گناہ گار ہوں گے۔"
    },
    {
      "Ayah": 96,
      "tafsir": ""
    },
    {
      "Ayah": 97,
      "tafsir": "(آیت 97) ➊ { اِنَّ الَّذِيْنَ تَوَفّٰىهُمُ الْمَلٰٓىِٕكَةُ ظَالِمِيْۤ اَنْفُسِهِمْ:} یہ آیت ان لوگوں کے بارے میں نازل ہوئی ہے جو مکہ اور اس کے قرب و جوار میں مسلمان تو ہو چکے تھے لیکن انھوں نے اپنے آبائی علاقے اور خاندان کو چھوڑ کر ہجرت کرنے سے گریز کیا، (حالانکہ انھیں ہجرت میں کوئی رکاوٹ بھی نہ تھی) جب کہ مسلمانوں کی قوت کو ایک جگہ مجتمع کرنے کے لیے ہجرت کا نہایت تاکیدی حکم دیا جا چکا تھا، اس لیے جن لوگوں نے ہجرت کے حکم پر عمل نہیں کیا ان کو یہاں ظالم قرار دیا گیا ہے اور ان کا ٹھکانا جہنم بتلایا گیا ہے، جس سے ایک تو یہ معلوم ہوا کہ حالات اور موقع کے لحاظ سے اسلام کے بعض احکام کفر یا اسلام کے مترادف بن جاتے ہیں۔ جیسے اس موقع پر ہجرت کو اسلام اور اس سے گریز کو کفر کے مترادف قرار دیا۔ دوسرے یہ معلوم ہوا کہ ایسے دارالکفر سے ہجرت کرنا فرض ہے جہاں اسلام کی تعلیمات پر عمل مشکل اور وہاں رہنا کفر اور اہل کفر کی حوصلہ افزائی کا باعث ہو۔ ¤ ➋ {قَالُوْا فِيْمَ كُنْتُمْ … :} یعنی فرشتے ڈانٹ ڈپٹ کے انداز میں ان سے پوچھتے ہیں کہ تم مسلمان تھے یا کافر ؟ یا دارالکفر میں پڑے کیا کرتے رہے اور مدینہ کی طرف ہجرت کیوں نہیں کی؟ اس سے معلوم ہوا کہ ایسے لوگ مسلمان ہونے کے باوجود بلا عذر ترک ہجرت کی بنا پر ظالم کی موت مرتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ جَامَعَ الْمُشْرِكَ وَ سَكَنَ مَعَهُ فَإِنَّهُ مِثْلُهُ ] [ أبو داوٗد ، الجھاد، باب فی الإقامۃ بأرض الشرک : ۲۷۸۷، عن سمرۃ بن جندب رضی اللہ عنہ ] ’’جو شخص مشرک کے ساتھ اکٹھا رہے اور اس کے ساتھ سکونت رکھے تو یقینا وہ اسی جیسا ہے۔‘‘"
    },
    {
      "Ayah": 98,
      "tafsir": "(آیت 98) ➊ {اِلَّا الْمُسْتَضْعَفِيْنَ … : } اس آیت میں ان لوگوں کو مستثنیٰ قرار دیا ہے جو واقعی بے بس اور معذور تھے اور ہجرت نہیں کر سکتے تھے۔ ابن عباس رضی اللہ عنھما فرماتے ہیں : ’’میں اور میری والدہ ان لوگوں میں سے تھے جنھیں اللہ تعالیٰ نے معذور قرار دیا۔‘‘ [ بخاری، التفسیر، باب : «وما لکم لا تقاتلون… » : ۴۵۸۸ ] ان لوگوں میں عیاش بن ابی ربیعہ اور سلمہ بن ہشام وغیرہ بھی شامل ہیں جن کے حق میں رسول اللہ صلی اللہ علیہ وسلم کفار کے پنجے سے نجات کے لیے دعا کیا کرتے تھے۔ [ بخاری، التفسیر، باب قولہ : «فاولٰئک عسی اللہ…» : ۴۵۹۸ ] ¤ ➋ ابن عباس رضی اللہ عنھما کی والدہ ام الفضل بنت الحارث رضی اللہ عنھا ہیں اور ان کا نام لبابہ ہے، جو ام المومنین میمونہ بنت الحارث رضی اللہ عنھا کی بہن تھیں۔ ’’بنات حارث ‘‘ نو بہنیں تھیں، ان میں سے ایک اسماء بنت عمیس خثعمیہ رضی اللہ عنھا تھیں جو ماں کی طرف سے میمونہ رضی اللہ عنھا کی بہن تھیں اور جعفر بن ابی طالب رضی اللہ عنہ کی بیوی۔ جعفر رضی اللہ عنہ کے بعد ابو بکر صدیق رضی اللہ عنہ نے ان سے نکاح کر لیا اور ابو بکر رضی اللہ عنہ کے بعد علی رضی اللہ عنہ کے نکاح میں آ گئیں۔ (قرطبی)"
    },
    {
      "Ayah": 99,
      "tafsir": "(آیت 99) {فَاُولٰٓىِٕكَ عَسَى اللّٰهُ اَنْ يَّعْفُوَ عَنْهُمْ:} اللہ تعالیٰ کے لیے {”عَسَى“} کا لفظ یقین کے لیے ہوتا ہے، اس لیے اگر کوئی شخص واقعی ہجرت نہیں کر سکتا، وہ کفار کی قید میں ہے، یا اسے راستے کا علم نہیں، یا اس کے پاس زاد راہ نہیں، غرض کوئی بھی صحیح عذر ہے تو یقینا اللہ تعالیٰ اسے معاف فرمائے گا، مگر اللہ تعالیٰ کی طرف سے امید کے انداز میں بات کرنے میں حکمت بھی ہے کہ بندے بے خوف نہ ہو جائیں۔"
    },
    {
      "Ayah": 100,
      "tafsir": "(آیت 100) ➊ {مُرٰغَمًا:} یہ اسم ظرف ہے، یعنی {’’مَوْضِعُ رَغْمِ الْاَعْدَاءِ‘‘} دشمنوں کی ناک خاک آلود ہونے کی جگہ، جس سے دشمن ذلیل ہوں۔ { ”مُرٰغَمًا“ } کے معنی جگہ، جائے قیام اور جائے پناہ بھی آتے ہیں۔ ہجرت کر کے نکلنے کے بعد حاصل ہونے والی جائے قیام کو {”مُرٰغَمًا“} اس لیے فرمایا کہ وہ تمام دشمنوں کی ناک کو خاک آلود کر دیتی ہے۔ (قرطبی) اس آیت میں اگرچہ ان لوگوں کو مدینہ کی طرف ہجرت کرنے کی ترغیب دی گئی ہے جو مکہ اور دوسرے مقامات پر دارالکفرمیں زندگی بسر کر رہے تھے اور ہجرت نہیں کر رہے تھے، لیکن یہ آیت عام ہے اور متعدد احادیث میں ہجرت کی ترغیب دی گئی ہے اور وعدہ ہے کہ اللہ تعالیٰ دشمنوں کو ذلیل و خوار کرے گا اور اس کی طرف سے بڑی وسعت بھی ملے گی۔ ¤ ➋ {وَ مَنْ يَّخْرُجْ مِنْۢ بَيْتِهٖ … :} اس میں وہ تمام لوگ شامل ہیں جو خلوص نیت سے ہجرت کرتے ہیں مگر راستے میں ان کا وقت آخر آجاتا ہے تو ان کا اجر اللہ پر ثابت ہو جاتا ہے، کیونکہ اصل مدار نیت پر ہے، جیسا کہ مشہور حدیث ہے : [ إِنَّمَا الْاَعْمَالُ بِالنِّيَّاتِ ] [ بخاری، بدء الوحی، باب کیف کان بدء الوحی … : ۱] ’’تمام اعمال کا دارو مدار نیتوں پر ہے۔‘‘ چنانچہ خالد بن حزام رضی اللہ عنہ حبشہ کی طرف ہجرت کر کے نکلے، انھیں ایک سانپ نے ڈس لیا تو ان کے بارے میں یہ آیت اتری : «{ وَ مَنْ يَّخْرُجْ مِنْۢ بَيْتِهٖ }» [ ابن أبی حاتم : 328/4، ح : ۵۸۸۸، حسن ] سو آدمیوں کو قتل کر کے ہجرت کرنے والے شخص کا قصہ بھی اس کی دلیل ہے۔ ¤ ➌ ہجرت کے معنی ہیں دارالحرب سے دار السلام کی طرف منتقل ہونا، یہ رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں فرض تھی اور اس کی فرضیت تا قیامت باقی ہے۔ جس ہجرت کو رسول اللہ صلی اللہ علیہ وسلم نے [ لاَ هِجْرَةَ بَعْدَ الْفَتْحِ] (فتح کے بعد ہجرت نہیں) فرما کر منسوخ فرمایا ہے، وہ مکہ یا کسی بھی جگہ سے مدینہ کی طرف ہجرت تھی۔ اسی طرح اہل بدعت کی آبادی سے بھی ہجرت کرنی چاہیے، امام مالک رحمہ اللہ فرماتے ہیں : ’’کسی شخص کے لیے ایسے مقام پر رہنا جائز نہیں جہاں سلف کو گالیاں دی جاتی ہوں۔‘‘ علی ہذا القیاس جس علاقے میں حلال روزی نہ ملتی ہو، یا دین میں فتنے کا خوف ہو وہاں سے بھی ہجرت کرنی چاہیے۔ (قرطبی) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَنَا بَرِيْءٌ مِنْ كُلِّ مُسْلِمٍ يُقِيْمُ بَيْنَ أَظْهُرِ الْمُشْرِكِيْنَ ] ’’میں ہر اس مسلمان سے بری ہوں جو مشرکین کے درمیان مقیم ہو۔‘‘ [ أبو داوٗد، الجہاد، باب النھی عن قتل من اعتصم بالسجود : ۲۶۴۵ ]"
    },
    {
      "Ayah": 101,
      "tafsir": "(آیت 101) ➊ { وَ اِذَا ضَرَبْتُمْ فِي الْاَرْضِ … :} قصر کا معنی کمی ہے، یہ کمی رکعات کی تعداد میں بھی مسنون ہے اور اگر خوف زیادہ ہو تو نماز کی ہیئت و شکل میں بھی کمی ہو سکتی ہے، مثلاً پیدل جاتے جاتے نماز پڑھ لینا۔ ظاہر ہے اس میں سجدہ اور رکوع تو پوری طرح ممکن نہیں، یا سواری پر اشارے سے نماز پڑھ لینا۔ دیکھیے سورۂ بقرہ (۲۳۹)۔ رسول اللہ صلی اللہ علیہ وسلم نے عبد اللہ بن انیس رضی اللہ عنہ کو خالد بن سفیان کے قتل کے لیے بھیجا، کیونکہ وہ رسول اللہ صلی اللہ علیہ وسلم سے جنگ کے لیے لشکر تیار کر رہا تھا۔ عبد اللہ وہاں پہنچے تو عصر کا وقت قریب تھا، انھوں نے جاتے جاتے ہی نماز پڑھ لی۔ [ أبو داوٗد، صلاۃ السفر، باب صلاۃ الطالب : ۱۲۴۹ ] حافظ ابن حجر رحمہ اللہ نے فتح الباری میں اس کی سند کو حسن اور ابن کثیر نے جید کہا ہے۔ [ ہدایۃ المستنیر ] عبد اللہ بن عباس رضی اللہ عنھما نے فرمایا : ’’اللہ تعالیٰ نے تمھارے نبی کی زبان سے حضر میں چار، سفر میں دو اور خوف میں ایک رکعت فرض کی ہے۔‘‘ [ مسلم، صلاۃ المسافرین ، باب صلاۃ المسافرین و قصرھا : ۶۸۷ ] ¤ عام سفر میں مغرب اور صبح کی نماز کے علاوہ دوسری نمازوں میں چار کے بجائے دو رکعت پڑھنا قصر ہے۔ ’’ تم پر کچھ گناہ نہیں‘‘ کے الفاظ سے ثابت ہوتا ہے کہ حالت سفر میں قصر واجب نہیں، اس کی صرف اجازت ہے اور یہی اکثر علمائے سلف کا مسلک ہے، مگر چونکہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیشہ سفر میں قصر پڑھی ہے، لہٰذا آپ کی سنت کو دیکھتے ہوئے امام شافعی، امام احمد ابن حنبل اور اکثر محدثین رحمۃ اللہ علیھم کے نزدیک قصر افضل ہے۔ ¤ ➋ سفر سے مراد بظاہر تو عام سفر ہے، جسے عرف میں سفر کہا جاتا ہو، اب رہی میلوں یا دنوں کی مقدار کی تعیین تو نہ قرآن کی کسی آیت میں اس کا صاف ذکر ہے اور نہ نبی صلی اللہ علیہ وسلم کی کسی صریح حدیث میں۔ اس بنا پر جن ائمہ اور علماء نے کسی مقدار کی تعیین کی ہے، انھوں نے عموماً نبی صلی اللہ علیہ وسلم کے سفروں کو دیکھتے ہوئے اپنے اجتہاد سے کی ہے، تاہم سب سے قوی دلیل سفر کی مقدار کی تعیین میں صحیح مسلم(۶۹۱) میں مروی حدیث انس ہے، جس کی رو سے تین فرسخ ( ۹ کوس) تقریباً اکیس کلو میٹر سفر کرنا ہو تو شہر سے نکل کر قصر کر سکتے ہیں۔ ¤ ➌ کسی صحیح حدیث میں نبی صلی اللہ علیہ وسلم سے یہ ثابت نہیں کہ آپ نے کسی سفر میں فرض نماز سے پہلے یا بعد میں سنتیں ادا کی ہوں، ہاں رات کے وتر اور صبح کی سنتیں آپ صلی اللہ علیہ وسلم ہر سفر میں پڑھا کرتے تھے اور کبھی نہیں چھوڑتے تھے۔ (زاد المعاد : ۱؍۴۵۶) صحابہ میں سے ابو بکر، عمر اور ابن عمر رضی اللہ عنھم کا اسی پر عمل تھا۔ [ بخاری، التقصیر، باب من لم یتطوع فی السفر دبر الصلاۃ : ۱۱۰۲ ] ¤ ➍ مسافر اگر مقیم کے پیچھے نماز پڑھے گا تو قصر نہیں کرے گا۔ موسیٰ بن سلمہ فرماتے ہیں کہ ہم ابن عباس رضی اللہ عنھماکے ساتھ مکہ میں تھے تو میں نے کہا جب ہم آپ کے ساتھ ہوتے ہیں تو چار رکعت پڑھتے ہیں اور جب اپنی رہائش کی جگہوں میں جاتے ہیں تو دو رکعت پڑھتے ہیں تو انھوں نے فرمایا : ’’یہ ابوالقاسم صلی اللہ علیہ وسلم کی سنت ہے۔‘‘ [ أحمد : 216/1، ح : ۱۸۶۷ ] اس کی ہم معنی روایت صحیح ابی عوانہ (۲؍۳۴۰) میں ہے۔ [ إرواء الغلیل، تحت الحدیث : ۵۷۱ ] ¤ ➎ {اِنْ خِفْتُمْ اَنْ يَّفْتِنَكُمُ الَّذِيْنَ كَفَرُوْا … :} یہ آیت چونکہ جہاد کے سلسلہ میں نازل ہوئی ہے، اس لیے اس میں نماز قصر کی اجازت کے ساتھ’’اگر تمھیں ڈر ہو کہ کافر تمھیں فتنے میں ڈال دیں گے‘‘ کے الفاظ بھی استعمال ہوئے ہیں۔ باقی رہا عام سفر، جس میں دشمن کا خوف نہ ہو تو اس میں قصر کے حکم کے بارے میں یہ آیت خاموش ہے، اسے نبی صلی اللہ علیہ وسلم نے اپنے قول و فعل سے واضح فرمایا ہے۔ عمر رضی اللہ عنہ سے ایک شخص نے سوال کیا : ’’ کیا وجہ ہے کہ لوگ ہر سفر میں قصر کر رہے ہیں، حالانکہ قرآن مجید میں یہ حکم خوف کے ساتھ مقید ہے؟‘‘ تو عمر رضی اللہ عنہ نے فرمایا : ’’خود مجھے بھی اس سے تعجب ہوا تھا اور میں نے نبی صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ ایک صدقہ ہے، جو اللہ نے تم پر کیا ہے، لہٰذا تم اس کا صدقہ قبول کرو۔‘‘ [ مسلم، صلاۃ المسافرین، باب صلاۃ المسافرین و قصرھا : ۶۸۶ ] ابن عباس رضی اللہ عنھما فرماتے ہیں : ’’نبی کریم صلی اللہ علیہ وسلم مدینہ سے مکہ تشریف لے گئے اور اس وقت رب العالمین کے سوا کسی کا خوف نہ تھا مگر آپ نے دو ہی رکعت نماز پڑھی۔‘‘ [ نسائی، تقصیر الصلاۃ فی السفر، بابٌ : ۱۴۳۶ ] ¤ انس رضی اللہ عنہ بیان کرتے ہیں : ’’ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ سے مکہ روانہ ہوئے تو آپ نماز کی دو دو رکعتیں ادا فرماتے رہے، حتیٰ کہ ہم مدینہ واپس آ گئے۔‘‘ حدیث کے راوی کہتے ہیں کہ میں نے پوچھا : ’’آپ لوگوں نے مکہ میں کتنی دیر قیام کیا تھا؟‘‘ تو انھوں نے جواب دیا : ’’ہم نے دس دن قیام کیا تھا۔‘‘ [ بخاری، التقصیر، باب ما جاء فی التقصیر… : ۱۰۸۱ ] ¤ ایک مرتبہ آپ نے مکہ میں انیس(۱۹) دن بھی قیام کیا تھا۔ [ بخاری، المغازی، باب مقام النبی صلی اللہ علیہ وسلم بمکۃ زمن الفتح : ۴۲۹۸ ] جابر رضی اللہ عنہ فرماتے ہیں کہ نبی صلی اللہ علیہ وسلم تبوک میں بیس دن ٹھہرے رہے اور نماز قصر کرتے رہے۔ [ أحمد : ۳؍۲۹۵، ح : ۱۴۱۳۹، و صححہ الألبانی فی الإرواء ] نبی کریم صلی اللہ علیہ وسلم سے یہ مدت صراحت کے ساتھ نہیں آئی کہ کتنے دن کسی جگہ ٹھہرنے کا ارادہ ہو تو قصر کر سکتا ہے۔ علماء کے اجتہادات مختلف ہیں، بعض نے فرمایا انیس دن ٹھہرنے کا ارادہ ہو تو نماز پوری پڑھے، اس سے کم ہو تو قصر کرے۔ بعض نے یہ مدت پندرہ دن بیان فرمائی، بعض نے چار دن، مگر راجح بات یہی معلوم ہوتی ہے کہ جب تک کسی جگہ اقامت کا ارادہ نہ کرے قصر کر سکتا ہے۔ ثمامہ بن شراحیل فرماتے ہیں کہ میں ابن عمر رضی اللہ عنھما کے پاس گیا تو ہم نے عرض کیا : ’’مسافر کی نماز کیسے ہے؟‘‘ انھوں نے فرمایا : ’’دو دو رکعتیں سوائے مغرب کے کہ وہ تین رکعتیں ہے۔‘‘ میں نے کہا ’’یہ بتائیں اگر ہم ذوالمجاز میں ہوں؟‘‘ انھوں نے فرمایا : ’’ذوالمجاز کیا ہے؟‘‘ میں نے کہا : ’’ایک جگہ ہے جس میں ہم جمع ہوتے ہیں اور خرید و فروخت کرتے ہیں اور بیس راتیں یا پندرہ راتیں ٹھہرتے ہیں۔‘‘ تو انھوں نے فرمایا : ’’اے آدمی! میں آذربائیجان میں رہا، میں نہیں جانتا کہ انھوں نے چار مہینے کہا یا دو ماہ، تو میں نے انھیں دیکھا کہ وہ دو دو رکعت پڑھتے تھے اور میں نے اپنی آنکھوں کے سامنے نبی صلی اللہ علیہ وسلم کو دو دو رکعت پڑھتے دیکھا۔‘‘ پھر انھوں نے یہ آیت پڑھی : «{ لَقَدْ كَانَ لَكُمْ فِيْ رَسُوْلِ اللّٰهِ اُسْوَةٌ حَسَنَةٌ }» [ الأحزاب : ۲۱ ] [ أحمد : 83/2، ح : ۵۵۵۲، و حسنہ شعیب الأرنؤوط ]"
    },
    {
      "Ayah": 102,
      "tafsir": "(آیت 102) ➊ { وَ اِذَا كُنْتَ فِيْهِمْ … :} اس آیت میں صلاۃ الخوف کی اجازت بلکہ حکم دیا جا رہا ہے۔ یہ خوف کی نماز کا وہ موقع ہے کہ جب دشمن موجود ہو اور اس کے حملے کا خطرہ ہو، عملاً جنگ نہ ہو رہی ہو، لیکن ذرا سی غفلت بڑے نقصان کا باعث بن سکتی ہو، ایسے حالات میں اگر نماز کا وقت ہو جائے تو صلاۃ الخوف پڑھنے کا حکم ہے، جس کی مختلف صورتیں حدیث میں بیان کی گئی ہیں، مثلاً فوج دو حصوں میں تقسیم ہو گئی، ایک حصہ (گروہ) دشمن کے بالمقابل کھڑا رہا، تاکہ کافروں کو حملہ کرنے کی جسارت نہ ہو اور ایک حصے نے آ کر نبی صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی، جب یہ حصہ نماز سے فارغ ہو گیا تو یہ پہلے کی جگہ مورچہ زن ہو گیا اور مورچہ زن حصہ نماز کے لیے آ گیا۔ بعض روایات میں آتا ہے کہ آپ صلی اللہ علیہ وسلم نے دونوں حصوں کو ایک ایک رکعت پڑھائی، اس طرح آپ صلی اللہ علیہ وسلم کی دو رکعت اور باقی فوجیوں کی ایک ایک رکعت ہوئی۔ بعض روایات میں آتا ہے کہ دو، دو رکعات پڑھائیں، اس طرح آپ کی چار رکعت اور فوجیوں کی دو، دو رکعت ہوئیں۔ نیز بعض میں آتا ہے کہ ایک رکعت پڑھ کر التحیات کی طرح بیٹھے رہے، فوجیوں نے کھڑے ہو کر اپنے طور پر ایک رکعت اور پڑھ کر دو رکعات پوری کیں اور دشمن کے سامنے ڈٹ گئے، دوسرے حصے (گروہ) نے آ کر نبی صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی، آپ نے انھیں بھی ایک رکعت پڑھائی اور التحیات میں بیٹھ گئے اور اس وقت تک بیٹھے رہے جب تک فوجیوں نے دوسری رکعت پوری نہیں کر لی، پھر ان کے ساتھ آپ صلی اللہ علیہ وسلم نے سلام پھیر دیا، اس طرح آپ کی بھی دو رکعت اور فوج کے دونوں حصوں کی بھی دو رکعات ہوئیں۔ ¤ ➋ ابن العربی رحمہ اللہ لکھتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے چودہ مرتبہ صلاۃ الخوف پڑھی ہے اور امام احمد ابن حنبل رحمہ اللہ فرماتے ہیں کہ صلاۃ الخوف میں تمام احادیث صحیح اور ثابت ہیں، لہٰذا جس صورت میں نماز ادا کر لی جائے جائز ہے۔ حافظ ابن القیم رحمہ اللہ فرماتے ہیں کہ سب احادیث کا مرجع چھ سات صورتوں کی طرف ہے، جن میں سے ہر صورت پر حسب موقع عمل کیا جا سکتا ہے۔( زاد المعاد : ۱؍۵۱۲) امام ابو داؤد رحمہ اللہ نے صلاۃ الخوف کی صورتیں صحیح سندوں کے ساتھ بہت تفصیل سے ذکر فرمائی ہیں۔ یہ تمام صورتیں اس وقت ہیں کہ جب جماعت ممکن ہو، اگر ممکن نہ ہو تو اکیلا پڑھ لے، پیادہ یا سوار یا اشارے سے، جس طرح ہو سکے «{ فَاِنْ خِفْتُمْ فَرِجَالًا اَوْ رُكْبَانًا }» [ البقرۃ : ۲۳۹ ] ’’پھر اگر تم ڈرو تو پیدل پڑھ لو یا سوار۔‘‘ اگر جنگ جاری ہو اور اشارے سے بھی نہ پڑھ سکے تو بعد میں قضا کر کے پڑھ لے۔ صحیح بخاری میں ہے، انس رضی اللہ عنہ فرماتے ہیں کہ میں تُستر قلعے کی فتح کے وقت موجود تھا، جب فجر روشن ہو رہی تھی اور لڑائی شدید بھڑک اٹھی تھی تو ہم نماز پڑھ ہی نہ سکے، چنانچہ دن بلند ہونے کے بعد ہی نماز پڑھی۔ ہم نے وہ نماز ابو موسیٰ رضی اللہ عنہ کے ساتھ پڑھی، اللہ تعالیٰ نے فتح عطا فرمائی۔ انس رضی اللہ عنہ نے فرمایا : ’’مجھے دنیا و مافیہا مل جائے تب بھی اتنی خوشی نہ ہو، جتنی اس نماز سے ہوئی۔‘‘ [ بخاری، صلاۃ الخوف، باب الصلاۃ عند مناھضۃ الحصون و لقاء العدو، قبل ح : ۹۴۵ ]"
    },
    {
      "Ayah": 103,
      "tafsir": "(آیت 103) ➊{ فَاِذَا قَضَيْتُمُ الصَّلٰوةَ …:} یعنی صلاۃ الخوف میں نماز کی حالت میں اذکار پورے نہیں ہو سکتے، اس لیے نماز پوری ہونے پر کھڑے، بیٹھے، لیٹے ہر حال میں اللہ کو یاد کرو، تاکہ تلافی ہو جائے، اس کے علاوہ ہر حال میں ذکر کی کثرت ہونی چاہیے۔ جنگ کے موقع پر تو اللہ تعالیٰ نے اس کا خاص حکم دیا، فرمایا : «{ اِذَا لَقِيْتُمْ فِئَةً فَاثْبُتُوْا وَ اذْكُرُوا اللّٰهَ كَثِيْرًا لَّعَلَّكُمْ تُفْلِحُوْنَ }» [ الأنفال : ۴۵ ] ’’جب تم کسی گروہ کے مقابل ہو تو جمے رہو اور اللہ کو بہت زیادہ یاد کرو، تاکہ تم فلاح پاؤ۔‘‘ ¤ ➋ { فَاِذَا اطْمَاْنَنْتُمْ فَاَقِيْمُوا الصَّلٰوةَ:} یعنی جب خوف کی حالت ختم ہو جائے اور دشمن کا کوئی خطرہ نہ رہے تو نماز کو اس کے پورے ارکان و شرائط اور حدود کے ساتھ مقررہ اوقات پر ادا کرو۔ ہاں سفر میں رسول اللہ صلی اللہ علیہ وسلم نے ظہر و عصر اور مغرب و عشاء جمع کر کے پڑھی ہیں، جیسا کہ عرفات، مزدلفہ اور دوسرے سفروں میں جمع کیا ہے، تو سفر میں جمع کرنے کی رعایت بھی اللہ ہی کی طرف سے ہے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کو اپنے پاس سے تو وقت مقرر کرنے کا اختیار ہی نہ تھا۔ اس لیے اس کا وقت وہی ہے۔"
    },
    {
      "Ayah": 104,
      "tafsir": "(آیت 104) { وَ لَا تَهِنُوْا فِي ابْتِغَآءِ الْقَوْمِ …:} یہ آیت اس آیت سے ملتی جلتی ہے : «{ اِنْ يَّمْسَسْكُمْ قَرْحٌ فَقَدْ مَسَّ الْقَوْمَ قَرْحٌ مِّثْلُهٗ }» [ آل عمران : ۱۴۰ ] ’’اگر تمھیں کوئی زخم پہنچے تو یقینا ان لوگوں کو بھی اس جیسا زخم پہنچا ہے۔‘‘ قرطبی نے جنگ احد میں زخم کھانے کے باوجود کفار کا پیچھا کرنے کو اس آیت کی شان نزول بتایا ہے، مگر الفاظ عام ہیں، اس لیے اس واقعہ کے علاوہ ہر ایسے موقع پر یہی حکم ہے اور اللہ تعالیٰ کی طرف سے ہمت افزائی ہے کہ درد و الم میں تو تم یکساں ہو مگر اللہ سے اجر کی امید میں تمھارا اور ان کا کوئی مقابلہ ہی نہیں، تو پھر ان کا پیچھا کرنے میں کیوں ہمت ہارتے ہو؟"
    },
    {
      "Ayah": 105,
      "tafsir": "(آیت 105) ➊ {اِنَّاۤ اَنْزَلْنَاۤ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ … :} جمہور مفسرین نے ان آیات (۱۰5 سے ۱۱4 تک) کی شان نزول چوری کا ایک واقعہ بتایا ہے، جو ترمذی میں تفصیل کے ساتھ مذکور ہے اور شیخ ناصر الدین البانی رحمہ اللہ نے اسے حسن کہا ہے۔ خلاصہ اس کا یہ ہے کہ بشر، بشیر اور مبشر تین بھائی تھے، جو ابیرق یا طعمہ بن ابیرق کے بیٹے تھے۔ بعض نے کہا کہ ان میں سے بشیر کی کنیت ابو طعمہ تھی، یہ لوگ مدینہ کے قبیلہ بنو ظفر سے تھے۔ ان میں بشیر سب سے بد تر تھا، یہ شخص منافق تھا اور مسلمانوں کی ہجو کر کے وہ شعر دوسروں کے نام لگا دیتا تھا۔ یہ غریب فاقہ زدہ لوگ تھے اور رفاعہ بن زید کے ہمسائے تھے۔ ایک دفعہ شام سے ایک قافلہ میدہ لے کر آیا تو رفاعہ بن زید نے اس میں سے ایک بوری خرید لی۔ مدینہ کے لوگ آٹا کھاتے تھے، رہا میدہ تو وہ گھر کے بڑے آدمیوں کے لیے سنبھال کر رکھ لیا جاتا تھا۔ رفاعہ نے وہ میدہ اپنے اسلحہ کے سٹور میں اسلحہ کے ساتھ محفوظ کر دیا۔ ابیرق کے بیٹوں نے سٹور میں نقب لگا کر میدہ اور اسلحہ چرا لیا۔ صبح ہوئی تو رفاعہ نے اپنا اسلحہ اور میدہ نقب لگا کر چرانے کی بات اپنے بھتیجے قتادہ بن نعمان کے ساتھ کی۔ اب اس نے تفتیش شروع کی تو معلوم ہوا کہ اس رات ابیرق کے بیٹوں نے آگ جلائی تھی اور شاید انھوں نے رفاعہ کے میدہ ہی سے کھانا تیار کیا ہو۔ جب ابیرق کے بیٹوں کا راز فاش ہو گیا تو انھوں نے چوری کا وہ اسلحہ وغیرہ ایک یہودی کے گھر پھینک دیا اور ان کے قبیلے بنو ظفر کے کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر شکایت کی کہ رفاعہ بن زید اور اس کے بھتیجے نے ہمارے ایک گھر والوں پر، جو ایمان دار اور نیک لوگ ہیں، چوری کا الزام لگا دیا ہے۔ قتادہ کہتے ہیں، میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آ یا تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تم نے بلا دلیل ایمان دار نیک لوگوں پر چوری کا الزام لگا دیا ہے۔‘‘ ان لوگوں نے مشہور کر دیا کہ مسروقہ سامان یہودی کے گھر سے نکلا ہے، تو اس پر یہ آیات اتریں۔ [ ترمذی، التفسیر، باب ومن سورۃ النساء : ۳۰۳۶ ] اللہ تعالیٰ نے معاملے کی حقیقت کھول دی، تاکہ کوئی یہ نہ کہے کہ جرم تو بنو ابیرق کا تھا، مگر مجرم یہودی کو بنا دیا گیا،کیونکہ وہ اپنا نہیں تھا۔ اس سے رسول اللہ صلی اللہ علیہ وسلم کے انصاف پر بہت بڑا دھبا آ سکتا تھا۔ ¤ ➋ {وَ لَا تَكُنْ لِّلْخَآىِٕنِيْنَ خَصِيْمًا: } اس سے مراد ابیرق کے بیٹے ہیں کہ آپ ان کی حمایت نہ کریں، اس سے معلوم ہوا کہ آپ عالم الغیب نہیں تھے، ورنہ اللہ تعالیٰ کو یہ فرمانے کی ضرورت نہ تھی کہ ’’آپ ان خیانت کرنے والوں کی طرف سے جھگڑا نہ کریں۔‘‘"
    },
    {
      "Ayah": 106,
      "tafsir": "(آیت 106){ وَ اسْتَغْفِرِ اللّٰهَ … :} یعنی جو حمایت آپ نے کی اس کی مغفرت طلب کریں۔ ایک معنی مفسرین نے یہ بھی کیا ہے کہ ان گناہ گاروں کے لیے اللہ تعالیٰ سے معافی مانگیں۔ اس سے معلوم ہوا کہ بعض اوقات قاضی ایک فریق کی چرب زبانی کی وجہ سے اس کے حق میں فیصلہ دے دے تو وہ اللہ تعالیٰ کے ہاں صحیح نہیں ہو جائے گا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’خبر دار! میں ایک انسان ہی ہوں اور جس طرح سنتا ہوں اس کے مطابق فیصلہ کر دیتا ہوں، ممکن ہے ایک شخص اپنی دلیل و حجت پیش کرنے میں تیز طرار اور ہوشیار ہو اور میں اس کی گفتگو سے متاثر ہو کر اس کے حق میں فیصلہ کر دوں، حالانکہ وہ حق پر نہ ہو اور اس طرح میں دوسرے مسلمان کا حق اسے دے دوں، اسے یاد رکھنا چاہیے کہ وہ آگ کا ٹکڑا ہے، اب یہ اس کی مرضی ہے کہ اسے لے لے یا چھوڑ دے۔‘‘ [ بخاری، المظالم، باب إثم من خاصم… : ۲۴۵۸ ]"
    },
    {
      "Ayah": 107,
      "tafsir": "(آیت 107) {وَ لَا تُجَادِلْ عَنِ الَّذِيْنَ … :} مطلب یہ کہ یہ لوگ جنھوں نے دوسروں کی خیانت کی ہے، در حقیقت سب سے پہلے انھوں نے اپنی جانوں سے خیانت کی ہے، کیونکہ دوسروں سے دغا کرنے والا پہلے اپنے آپ سے دغا کرتا ہے۔"
    },
    {
      "Ayah": 108,
      "tafsir": "(آیت 108) {يَسْتَخْفُوْنَ مِنَ النَّاسِ … :} یعنی ان لوگوں کا حال یہ ہے کہ گناہوں کا ارتکاب کرنے میں لوگوں سے چھپاؤ تو کرتے ہیں مگر اللہ تعالیٰ سے چھپاؤ نہیں کرتے، جو اس وقت بھی ان کے ساتھ ہوتا ہے جب وہ رات کی گھڑیوں میں نامناسب کاموں کے مشورے کر رہے ہوتے ہیں، وہ ہر چیز کو گھیرے ہوئے ہے، اس سے بچ کر کہاں جائیں گے؟ اللہ تعالیٰ کے ساتھ ہونے کے مطلب کے لیے دیکھیے سورۂ حدید (۴) اور سورۂ مجادلہ (۷)۔"
    },
    {
      "Ayah": 109,
      "tafsir": "(آیت 109) {هٰۤاَنْتُمْ هٰۤؤُلَآءِ جٰدَلْتُمْ … : } یہ ان لوگوں سے کہا جا رہا ہے جو ابیرق کے بیٹوں کی طرف سے وکالت اور بحث کرتے تھے۔"
    },
    {
      "Ayah": 110,
      "tafsir": "(آیت 110) {وَ مَنْ يَّعْمَلْ سُوْٓءًا اَوْ يَظْلِمْ نَفْسَهٗ … :} مزید آیات دیکھیے سورۂ زمر(۵۳، ۵۴) سورۂ فرقان (۶۸ تا ۷۱) اور سورۂ آل عمران (۱۳۵) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’کوئی آدمی جب جو کوئی گناہ کرے، پھر اٹھ کر اچھی طرح وضو کرے، پھر اللہ سے معافی مانگے تو اللہ تعالیٰ اسے معاف کر دیتا ہے۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «{ وَ الَّذِيْنَ اِذَا فَعَلُوْا فَاحِشَةً اَوْ ظَلَمُوْۤا اَنْفُسَهُمْ ذَكَرُوا اللّٰهَ فَاسْتَغْفَرُوْا۠ لِذُنُوْبِهِمْ وَ مَنْ يَّغْفِرُ الذُّنُوْبَ اِلَّا اللّٰهُ }» [ آل عمران : ۱۳۵ ]’’اور وہ لوگ جب کوئی بے حیائی کرتے ہیں، یا اپنی جانوں پرظلم کرتے ہیں تو اللہ کو یاد کرتے ہیں، پس اپنے گناہ کی بخشش مانگتے ہیں اور اللہ کے سوا کون بخشتا ہے۔‘‘ [ ترمذی، الصلاۃ، باب ما جاء فی الصلاۃ عند التوبۃ : ۴۰۶ ] ¤ اس آیت میں ہر قسم کے گناہوں کے نتائج بد سے محفوظ رہنے کا طریقہ بتایا گیا ہے اور وہ یہ ہے کہ اللہ تعالیٰ سے توبہ و استغفار کی جائے۔ { ”سُوْٓءًا“ } وہ گناہ جن سے انسان اپنے علاوہ دوسروں کو بھی نقصان پہنچاتا ہے، جیسے جھوٹی شہادت اور بے گناہ کو متہم کرنا اور {”اَوْ يَظْلِمْ نَفْسَهٗ“} سے ان گناہوں کی طرف اشارہ ہے جن سے انسان صرف اپنے آپ کو نقصان پہنچاتا ہے، جیسے نماز چھوڑنا اور شراب پینا وغیرہ۔"
    },
    {
      "Ayah": 111,
      "tafsir": "(آیت 111) {”كَسَبَ“} کا لفظ کسی شخص کے اس فعل پر بولا جاتا ہے جس سے اسے کوئی نفع یا نقصان حاصل ہو، جبکہ اللہ تعالیٰ نفع و نقصان سے غنی ہے، اس بنا پر اللہ تعالیٰ کی طرف {’’كَسَبَ‘‘} کی نسبت نہیں ہو سکتی۔ (قرطبی) یعنی جو گناہ کرے گا وہی اس کی سزا بھگتے گا، کوئی دوسرا اس گناہ میں نہیں پکڑا جائے گا، دوسری جگہ فرمایا : «{ وَ لَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰى }» [ بنی إسرائیل : ۱۵ ] ’’اور کوئی بوجھ اٹھانے والی (جان) کسی دوسری (جان) کا بوجھ نہیں اٹھاتی۔‘‘"
    },
    {
      "Ayah": 112,
      "tafsir": "(آیت 112) {”خَطِيْٓئَةً“} کا لفظ غیر ارادی گناہ پر بولا جاتا ہے اور اس کے برعکس { ”اِثْمًا“ } وہ گناہ ہے جو ارادی طور پر کیا جائے۔ مطلب یہ ہے کہ خود گناہ کا ارتکاب کرنے کے بعد کسی بے قصور آدمی کو اس میں ملوث کرنے کی کوشش کرنا بہت بڑا گناہ ہے اور کسی بے گناہ شخص پر تہمت لگانے کو بہتان کہا جاتا ہے۔ (قرطبی)"
    },
    {
      "Ayah": 113,
      "tafsir": "(آیت 113) ➊ {وَ لَوْ لَا فَضْلُ اللّٰهِ … :} اللہ تعالیٰ کا فضل اور اس کی رحمت آپ پر یہ تھی کہ آپ کو وحی کے ذریعے سے اصل واقعہ کی حقیقت سے آگاہ کر دیا۔ ورنہ وہ طائفہ جو بنو ابیرق کا حامی تھا، آپ کو قائل کر کے انھیں بری کرانے ہی والا تھا، اس کا نتیجہ صرف یہی نہ تھا کہ ایک مجرم بچ جاتا اور ایک بے گناہ مجرم بن جاتا، بلکہ اس کے نتائج بہت دور رس تھے، جس سے مسلمانوں کی ساکھ اور کردار مجروح ہو جاتا۔ فرمایا ایسے لوگ درحقیقت اپنی عاقبت برباد کر کے اپنا ہی نقصان کر رہے تھے، آپ کا محافظ خود اللہ تعالیٰ تھا، آپ کو وہ نہ دھوکا دے سکتے تھے نہ آپ کا کچھ نقصان کر سکتے تھے۔ ¤ ➋ {وَ عَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ:} یعنی آپ کو وحی کے ذریعے سے وہ کچھ سکھایا جو آپ جانتے نہ تھے، بلکہ جس کی آپ امید بھی نہ رکھتے تھے۔ دیکھیے سورۂ عنکبوت (۴۸، ۴۹)، سورۂ قصص (۸۶)، سورۂ شوریٰ (۵۲) اور سورۂ ہود (۴۹) یہ ہے اللہ کا آپ پر فضل عظیم۔ بعض لوگ اس سے رسول اللہ صلی اللہ علیہ وسلم کے عالم الغیب ہونے کی دلیل پکڑتے ہیں، حالانکہ یہی الفاظ اللہ نے ہر انسان کے متعلق ارشاد فرمائے ہیں : «{ عَلَّمَ الْاِنْسَانَ مَا لَمْ يَعْلَمْ }» [ العلق : ۵ ] ’’اس نے انسان کو وہ سکھایا جو وہ نہیں جانتا تھا۔‘‘ پھر ہر انسان کا عالم الغیب ہونا بھی ثابت ہو جائے گا۔"
    },
    {
      "Ayah": 114,
      "tafsir": "(آیت 114) ➊ {لَا خَيْرَ فِيْ كَثِيْرٍ مِّنْ نَّجْوٰىهُمْ …: ”نَجْوَی“ } کچھ لوگوں سے علیحدہ ہو کر صلاح مشورہ کو کہتے ہیں، یہ مصدر ہے اور مبالغہ کے طور پر {’’ عَدْلٌ ‘‘} اور {’’ رِضًي‘‘} کی طرح جمع پر بھی بولا جاتا ہے اور {’’ اِلَّا ‘‘ } کے بعد {’’ نَجْوَي‘‘} محذوف ہے، یعنی { ”إِلاَّ نَجْوَي مَنْ أَمَرَ بِصَدَقَةٍ“ } یعنی ان کی بہت سی سرگوشیوں میں کوئی خیر نہیں، سوائے اس شخص کی سر گوشی کے جو صدقے کا حکم دے۔ ¤ { ”بِصَدَقَةٍ“ } صدقہ اس مال کو کہتے ہیں جو اللہ تعالیٰ سے ثواب حاصل کرنے کے لیے خرچ کیا جائے۔ یہ اصل میں نفل پر بولا جاتا ہے لیکن بعض اوقات فرض پر بھی بول دیتے ہیں، جیسے : «{ اِنَّمَا الصَّدَقٰتُ لِلْفُقَرَآءِ }» [ التوبۃ : ۶۰ ] مقصد یہ ہوتا ہے کہ یہ عمل دل کے صدق سے ادا ہو رہا ہے۔ (راغب) { ”مَعْرُوْفٍ“ } یہ لفظ نیکی کے تمام کاموں کو شامل ہے، حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تمھارا اپنے بھائی کو کھلے چہرے سے ملنا بھی معروف میں سے ہے۔‘‘ [ ترمذی، البر والصلۃ، باب ما جاء فی طلاقۃ الوجہ … : ۱۹۷۰، عن جابر رضی اللہ عنہ و صححہ الألبانی ] ¤ {”اِصْلَاحٍۭ بَيْنَ النَّاسِ“} کے الفاظ مسلمانوں کے درمیان ہر قسم کے اختلافات ختم کرنے کو شامل ہیں، اللہ تعالیٰ نے فرمایا : «{ فَاتَّقُوا اللّٰهَ وَ اَصْلِحُوْا ذَاتَ بَيْنِكُمْ }» [ الأنفال : ۱ ] ’’سو اللہ سے ڈرو اور اپنے آپس کے تعلقات درست کرو۔‘‘ ¤ ام کلثوم رضی اللہ عنھا فرماتی ہیں کہ میں نے سنا رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے : ’’وہ شخص جھوٹا نہیں جو لوگوں کے درمیان صلح کرانے کی کوشش کرتا ہے اور ( اس مقصد کے لیے) کوئی اچھی بات دوسرے تک پہنچاتا ہے یا اچھی بات کہتا ہے۔‘‘ [ بخاری، الصلح، باب لیس الکاذب الذی یصلح بین الناس : ۲۶۹۲ ] ¤ ➋ منافق لوگ جو راتوں کو الگ بیٹھ کر مشورہ کرتے ہیں، وہ اکثر اوقات بری باتیں ہی سوچتے ہیں، جو خیر سے خالی ہوتی ہیں، کیونکہ بھلائی کی بات اور صاف ستھری بات کو چھپانے کی ضرورت ہی نہیں ہوتی۔ البتہ کچھ کام چھپا کر کرنا بہتر ہوتے ہیں، مثلاً کسی کو صدقہ دے تو چھپا کر دے، تاکہ لینے والا شرمندہ نہ ہو، یا صدقہ دینے سے متعلق الگ مشورہ بھی اچھا کام ہے۔ اسی طرح بھلائی کے کاموں اور بالخصوص لوگوں کے درمیان صلح کرانے سے متعلق اگر خفیہ مشورہ بھی کیا جائے تو یہ بھی ایک نیکی کا عمل ہے، لیکن افسوس ہے کہ یہ لوگ ان امور میں سے تو کسی بات کا مشورہ نہیں کرتے، بلکہ ایسے مشورے کرتے ہیں جن سے شر پیدا ہو اور دوسروں کو نقصان پہنچے اور جو شخص مذکورہ بالا امور سے متعلق محض اللہ کی رضا کے لیے مشورہ کرے تو یہ بڑی نیکی کے کام ہیں۔"
    },
    {
      "Ayah": 115,
      "tafsir": "(آیت 115) ➊ {وَ مَنْ يُّشَاقِقِ الرَّسُوْلَ …: ”يُشَاقِقِ“ ’’شق‘‘} سے باب مفاعلہ کا فعل مضارع معلوم ہے۔ {’’ شق‘‘} کا معنی طرف، کنارہ ہے، یعنی جو شخص یا گروہ رسول اللہ صلی اللہ علیہ وسلم کی اس طرح مخالفت کرے کہ آپ کے مقابلے میں آجائے، ایک طرف اللہ کے رسول ہوں دوسری طرف یہ شخص یا گروہ ہو اور حق معلوم ہو جانے کے باوجود مومنوں کے سیدھے اور صاف راستے سے ( جو ہر حال میں اتباع رسول ہے) ہٹ جائے، تو ہم بھی اسے اسی طرف پھیر دیں گے جدھر وہ پھرے گا اور اسی ٹیڑھی راہ پر جانے دیں گے جو اسے لے جا کر جہنم میں ڈال دے گی اور وہ بہت برا راستہ ہے۔ ¤ ➋ ہدایت کے واضح ہو جانے کے بعد رسول اللہ صلی اللہ علیہ وسلم کی مخالفت اور مومنین کا راستہ چھوڑ کر کسی اور راستے کی پیروی کرنا در حقیقت دین اسلام ہی سے نکل جانا ہے، جس پر یہاں جہنم کی وعید بیان فرمائی گئی ہے۔ مومنین سے مراد صحابہ کرام رضی اللہ عنھم ہیں جو دین اسلام کے سب سے پہلے پیرو کار اور اس کی تعلیم کا مکمل نمونہ تھے اور ان آیات کے نزول کے وقت جن کے سوا کوئی اور گروہ مومنین کا موجود نہ تھا، جو یہاں مراد ہو سکے۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم کی مخالفت اور غیر سبیل المومنین کی پیروی دونوں حقیقت میں ایک ہی چیز کا نام ہے اس لیے صحابہ کرام رضی اللہ عنھم کے راستے سے ہٹنا بھی کفر اور گمراہی ہے۔ بعض علماء نے {’’ سَبِيْلِ الْمُؤْمِنِيْنَ“ } سے مراد اجماع امت لیا ہے، یعنی پوری امت کے اجماع سے انحراف بھی کفر ہے۔ اجماع امت کا مطلب ہے کسی مسئلے میں امت کے تمام علماء و فقہاء کا اتفاق، یا کسی مسئلے پر صحابہ کرام رضی اللہ عنھم کا اتفاق ہو، یہ دونوں صورتیں اجماع امت کی ہیں۔ صحابہ کرام رضی اللہ عنھم کا اتفاق تو بہت سے مسائل میں ملتا ہے، یعنی اجماع کی یہ صورت تو ملتی ہے لیکن اجماع صحابہ کے بعد کسی مسئلے میں پوری امت کے اجماع و اتفاق کے دعوے تو بہت مسائل میں کیے گئے ہیں، لیکن ایسے اجماعی مسائل بہت کم ہیں جن میں فی الواقع امت کے تمام علماء و فقہاء میں اتفاق ہو، پھر ایسے مسائل پر سب علماء و فقہاء کے اتفاق کا پتا چلانا اور بھی مشکل ہے۔ پھر امت میں بہت سے فرقوں کے بن جانے نے یہ نتیجہ دکھایا ہے کہ ہر گروہ اپنی بات کو مضبوط بنانے کے لیے اجماع کا دعویٰ کر دیتا ہے، خواہ وہ صریحاً قرآن و حدیث کے خلاف ہو، مثلاً قبروں پر عمارت بنانا، ان پر غلاف چڑھانا، چراغ جلانا، غیر اللہ کے نام پر جانور ذبح کرنا، تعزیہ نکالنا، انبیاء کو انسان نہ سمجھنا، انھیں خدائی اوصاف دینا، میلاد، گیارھویں، تیجہ، ساتواں، دسواں، چالیسواں، عرس، میلے، پیر کا تصور باندھنا، اس کی ہر صحیح و غلط بات ماننا، الغرض! صریح شرک و بدعت کے کاموں کو اجماع کا نام دے دیا گیا ہے۔ البتہ اس بات میں کوئی شک نہیں کہ ایسے مسائل جن پر فی الواقع پوری امت کے علماء و فقہاء کا اجماع ہو ان کا انکار بھی صحابہ کے اجماع کے انکار کی طرح کفر ہے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : ’’اللہ تعالیٰ میری امت کو گمراہی پر اکٹھا نہیں کرے گا اور جماعت پر اللہ کا ہاتھ ہے۔‘‘ [ ترمذی، الفتن، باب ما جاء فی لزوم الجماعۃ : ۲۱۶۷، و صححہ الألبانی ] ¤ ➌ {وَ سَآءَتْ مَصِيْرًا:} اس آیت میں ان لوگوں کے لیے سخت وعید ہے جو نبی صلی اللہ علیہ وسلم کی سنت اور سلف صالحین کے مسلک سے منہ موڑ کر دوسروں کی پیروی کرتے ہیں اور آئے دن نئی بدعات ایجاد کرتے رہتے ہیں۔ یہ بتانے کی ضرورت نہیں کہ تقلید کی ایجاد بھی بعد کی صدیوں میں ہوئی، سلف صالحین کے دور میں اس کا قطعاً کوئی ثبوت نہیں ہے اور نہ کتاب و سنت کی دلیل سے اس کی کوئی گنجائش نکلتی ہے۔ ـ"
    },
    {
      "Ayah": 116,
      "tafsir": "(آیت 116) ➊ { اِنَّ اللّٰهَ لَا يَغْفِرُ اَنْ يُّشْرَكَ بِهٖ …:} پچھلی آیت میں اس شخص کا ذکر ہے جو رسول کی مخالفت کرتا ہے اور مومنوں کے راستے کے سوا کسی اور راستے کی پیروی کرتا ہے۔ ایسا وہی شخص ہو سکتا ہے جو اپنے کفر پر اصرار کرے اور دین اسلام قبول نہ کرے۔ اس آیت میں اللہ تعالیٰ نے اس کے کفر پر اڑنے کو شرک قرار دیا اور صراحت فرما دی کہ اس کی بخشش کی کوئی صورت نہیں۔ ہاں اگر کوئی شخص دین سلام قبول کرلے، اللہ کی توحید اور رسول اللہ صلی اللہ علیہ وسلم کی رسالت کی شہادت دے، اس کا عملی ثبوت دے اور ایسے فعل سے بچا رہے جس سے آدمی ملت اسلام سے خارج ہو جاتا ہے، تو پھر کبیرہ گناہوں کا ارتکاب کر بیٹھے تو اللہ تعالیٰ کی مرضی ہے چاہے تو ویسے ہی معاف کر دے یا سزا دے کر جنت میں داخل کر دے۔ مگر جو شخص اسلام ہی قبول نہ کرے، یا اسلام لا کر صریح ارتداد والے اعمال کا ارتکاب کرے تو اس کے لیے اللہ تعالیٰ کے ہاں معافی نہیں، کیونکہ اسے معافی دینے کا مقصد باغی اور غدار کو معافی دینا ہے جو اپنی بغاوت اور غدر پر قائم ہو۔ بغاوت کو کوئی معمولی سے معمولی بادشاہ بھی برداشت نہیں کرتا، تو بادشاہوں کا بادشاہ، جس کی غیرت بے پناہ ہے، وہ بغاوت کو کیسے معاف کر سکتا ہے؟ معلوم ہوا ابدی جہنمی صرف کفار و مشرکین ہوں گے، مسلمان گناہ گار ہمیشہ جہنم میں نہیں رہیں گے۔ اس سے ان لوگوں کا رد نکلتا ہے جو کبیرہ گناہ کے مرتکب مسلم کو دائمی جہنمی کہتے ہیں۔ مزید دیکھیے اسی سورت کی آیت (۴۸)۔ ¤ ➋ اوپر سے منافقوں کا ذکر آ رہا ہے جو پیغمبر صلی اللہ علیہ وسلم کے فیصلوں کو پسند نہ کرتے اور جدا راستے پر چلتے تھے۔ اس آیت میں فرمایا کہ اللہ تعالیٰ شرک کو نہیں بخشتا، تو معلوم ہوا کہ اسلام کے سوا کسی دوسرے دین ( طریقہ) کو محبوب رکھا جائے اور اس کو معمول بنایا جائے تو یہ شرک ہے، کیونکہ اسلام کے سوا جو دین بھی ہے شرک ہے، اگرچہ پرستش کا شرک نہ بھی کیا جائے۔ (موضح)"
    },
    {
      "Ayah": 117,
      "tafsir": "(آیت 117) ➊ {”اِنٰثًا“ ”أُنْثَي“} کی جمع ہے، یعنی مؤنث۔ ان سے مراد یا تو بت ہیں جن کے اکثر نام (لات، مناۃ، عزیٰ وغیرہ) مؤنث تھے یا فرشتے ہیں۔ کیونکہ مشرکین انھیں اللہ تعالیٰ کی بیٹیاں قرار دے کر ان کی عبادت کیا کرتے تھے۔ یونانیوں اور ہندوؤں نے بھی عبادت کے لیے دیویاں بنا رکھی ہیں۔ مسلمانوں نے ان کی دیکھا دیکھی ایسی ہستیوں میں ایسے اوصاف مشہور کر رکھے ہیں جیسے وہ نعوذ باللہ اللہ تعالیٰ کی محبوبائیں ہوں، بلکہ ان کے خیال میں جو پہنچے ہوئے ہیں وہ اپنی وضع قطع بھی عورتوں والی بنا کر رکھتے ہیں، وہی چوڑیاں وہی زیور وغیرہ۔ حالانکہ رسول اللہ صلی اللہ علیہ وسلم نے اس مرد پر لعنت فرمائی جو عورت کا لباس پہنے اور اس عورت پر جو مرد کا سا لباس پہنے۔ [ صحیح ابن حبان : ۵۷۵۲، عن أبی ہریرۃ رضی اللہ عنہ و صححہ محققہ ] ¤ ➋ { وَ اِنْ يَّدْعُوْنَ …:} اس آیت میں اللہ تعالیٰ نے شرک کی وضاحت اللہ کے سوا کسی دوسرے کو پکارنے کے ساتھ کی ہے، کیونکہ عبادت میں اصل ہے ہی پکارنا، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلدُّعَاءُ هُوَ الْعِبَادَةُ ] ’’ پکارنا ہی تو عبادت ہے ‘‘ [ ترمذی، الدعوات، باب منہ [ الدعاء مخ العبادۃ ] : ۳۳۷۲۔ أبوداوٗد : ۱۴۷۹ ] اور دیکھیے سورۂ مومن (۶۰) جو شخص بھی غیبی مدد کے لیے کسی کو اللہ کے سوا پکارتا ہے وہ مشرک ہے، کیونکہ عبادت اسی پکارنے ہی کا نام ہے، بلکہ عبادت کی جتنی بھی صورتیں ہیں، یعنی قیام، رکوع، سجدہ، نذرو نیاز اور پکارنا وغیرہ، ان سب کا اصل مقصد کسی کو غیبی قوتوں کا مالک جان کر مانگنا ہی ہوتا ہے، کوئی اللہ کے ساتھ یہ معاملہ کرتا ہے تو اس سے مانگتا ہے، غیر اللہ کے ساتھ کرتا ہے تو اس سے مانگتا ہے۔ ¤ ➌ { شَيْطٰنًا مَّرِيْدًا:} بتوں، فرشتوں، دیوی دیوتاؤں اور دوسری ہستیوں کی عبادت کرنے والے اپنے خیال میں جس کی بھی عبادت کرتے رہیں حقیقت میں وہ سرکش شیطان ہی کی عبادت کر رہے ہیں، کیونکہ شیطان ہی انھیں اللہ کے دروازے سے ہٹا کر دوسروں کے آستانوں اور چوکھٹوں پر جھکاتا ہے، جیسا کہ اگلی آیت میں ہے۔ جن لوگوں کی یہ پوجا کرتے ہیں، انھیں تو خبر ہی نہیں کہ کوئی ہمیں پکار رہا ہے۔ دیکھیے سورۂ احقاف (۵، ۶) اور یونس (۲۸، ۲۹) یہ لوگ صرف شیطان کے کہنے پر اپنے وہم و گمان سے بنائی ہوئی ہستیوں کو پوج رہے ہیں۔ دیکھیے سورۂ نجم (۲۳) اور یونس (۶۶)۔"
    },
    {
      "Ayah": 118,
      "tafsir": "(آیت 118) {نَصِيْبًا مَّفْرُوْضًا:} یعنی تیرے بندوں میں سے ایک گروہ کو اپنی راہ پر ڈال لوں گا، وہ اپنے مال میں میرا حصہ مقرر رکھیں گے، جیسے بتوں اور قبروں کے نام کی نذر و نیاز نکالی جاتی ہے۔ (موضح) جتنے گمراہ دوزخی ہیں سب نصیب شیطان (شیطان کے حصے) میں شامل ہیں۔ (قرطبی) شیطان ملعون اپنی سرکشی سے خود بھی گمراہ ہوا اور انسانوں کو گمراہ کرنے پر بھی ایسی کمر باندھی کہ نہ دشمنی چھپاتا ہے اور نہ دشمنی سے باز آتا ہے۔"
    },
    {
      "Ayah": 119,
      "tafsir": "(آیت 119) ➊ { وَ لَاُمَنِّيَنَّهُمْ … :} یہ وہ باطل امیدیں ہیں جو شیطان انسان کے دل میں پیدا کرتا ہے کہ گناہ کرتے رہو اللہ تعالیٰ بڑا غفور و رحیم ہے، ایمان مسلمان کے دل میں ہونا چاہیے، نماز پڑھنے اور دوسرے نیک اعمال کی کیا ضرورت ہے، یا ابھی جلدی کیا ہے، مرتے وقت توبہ کر لیں گے، یا جن بزرگوں اور پیروں کا تم دم بھرتے ہو ان کا اللہ پر بڑا زور ہے، تم ان کا دامن تھام لینا وہ تمھیں سیدھے جنت میں لے جائیں گے وغیرہ۔ اس قسم کے تمام خیالات اور گمان شیطانی آرزوؤں میں داخل ہیں۔(قرطبی، ابن کثیر) ¤ ➋ { فَلَيُبَتِّكُنَّ اٰذَانَ الْاَنْعَامِ : ’’ بَتْكٌ ‘‘} کا معنی قطع کرنا ہے، یعنی غیر اللہ کے نام پر جانوروں کے کان کاٹ کر ان پر سواری کرنا حرام سمجھیں گے، جنھیں بحیرہ و سائبہ وغیرہ کہتے تھے۔ دیکھیے سورۂ مائدہ (۱۰۳)۔ ¤ ➌ {فَلَيُغَيِّرُنَّ خَلْقَ اللّٰهِ …:} یعنی اللہ تعالیٰ نے جو چیزیں پیدا کی ہیں ان کی شکل و صورت تبدیل کریں گے اور ان کے حلال و حرام ہونے کے احکام بھی بدل دیں گے۔ اس میں رہبانیت( دنیا میں اپنی ذمہ داریوں سے فرار اختیار کرکے جنگل میں جا رہنا)، قوم لوط کا عمل، مردوں کا خصی ہو کر ہیجڑا بن جانا، عورتوں کو بانجھ بنانا، برتھ کنٹرول کے نام پر مردوں کی نس بندی اور عورتوں کے آپریشن کر کے بچے پیدا ہونے میں رکاوٹیں ڈالنا، عورتوں کو گھروں سے نکال کر ان کے فطری فرائض سے سبکدوش کر کے مردوں کی صف میں کھڑا کر دینا، عورتوں کو مملکت کی سربراہ بنا دینا، خوب صورتی کے لیے ابروؤں کے بال اکھاڑنا، جلد میں نیل وغیرہ بھر کر نقش و نگار بنانا، دانت باریک کروانا، سر پر مصنوعی بال لگوانا، مردوں کا داڑھی منڈوانا، عورتوں کا لباس کم از کم کر کے انھیں ننگا کرنے کی کوشش کرنا، یہ سب شیطانی کام ہیں اور اللہ تعالیٰ کی لعنت کا موجب ہیں۔ عبد اللہ بن مسعود رضی اللہ عنہ نے فرمایا : ’’اللہ تعالیٰ نے لعنت کی گودنے والیوں اور گدوانے والیوں پر (جلد میں نیل یا سرمہ بھر کر نقش بنوانے والیوں)، چہرے کے بال صاف کرنے والیوں اور کروانے والیوں پر اور حسن کے لیے دانتوں میں فاصلہ کروانے والیوں پر جو اللہ عزوجل کی خلق (پیدائش) کو بدلتی ہیں۔‘‘ پھر فرمایا : ’’میں اس پر لعنت کیوں نہ کروں جس پر اللہ کے رسول صلی اللہ علیہ وسلم نے لعنت کی اور وہ اللہ کی کتاب میں بھی ہے ‘‘ اور یہ آیت پڑھی : «وَ مَاۤ اٰتٰىكُمُ الرَّسُوْلُ فَخُذُوْهُ وَ مَا نَهٰىكُمْ عَنْهُ فَانْتَهُوْا» [ الحشر : ۷ ] ’’جو کچھ رسول تمھیں دے وہ لے لو، جس سے منع کر دے اس سے باز آ جاؤ۔‘‘ [ بخاری ، التفسیر، باب : « وما آتاکم الرسول فخذوہ » : ۴۸۸۶ ]"
    },
    {
      "Ayah": 120,
      "tafsir": "(آیت 121،120) ابلیس کے پاس جھوٹے وعدوں، غلط آرزوؤں اور وسوسوں کے سوا کچھ نہیں، حالانکہ اس کے سب وعدے جھوٹے اور سراسر دھوکا ہیں، بظاہر خوش نما، اندر سے مہلک ہیں۔ دیکھیے سورۂ فاطر (6،5) اور سورۂ ابراہیم (۲۳) اور ظاہر ہے کہ اپنے دشمن کو پہچانتے ہوئے پھر اس کے وعدوں پر اعتبار اور غلط آرزوؤں کو سچ سمجھنے کا نتیجہ جہنم کے سوا کیا ہو سکتا ہے۔"
    },
    {
      "Ayah": 121,
      "tafsir": "(آیت 121،120) ابلیس کے پاس جھوٹے وعدوں، غلط آرزوؤں اور وسوسوں کے سوا کچھ نہیں، حالانکہ اس کے سب وعدے جھوٹے اور سراسر دھوکا ہیں، بظاہر خوش نما، اندر سے مہلک ہیں۔ دیکھیے سورۂ فاطر (6،5) اور سورۂ ابراہیم (۲۳) اور ظاہر ہے کہ اپنے دشمن کو پہچانتے ہوئے پھر اس کے وعدوں پر اعتبار اور غلط آرزوؤں کو سچ سمجھنے کا نتیجہ جہنم کے سوا کیا ہو سکتا ہے۔"
    },
    {
      "Ayah": 122,
      "tafsir": "(آیت 122) جس طرح شیطان اپنی پیروی کرنے والوں سے وعدے کرتا ہے اسی طرح اللہ تعالیٰ بھی اپنے نیک بندوں سے جنت اور بلند درجات کے وعدے فرماتا ہے اور اللہ سے بڑھ کر اپنے وعدے اور بات میں کون سچا ہو سکتا ہے، جیسا کہ فرمایا : «{ وَ مَنْ اَصْدَقُ مِنَ اللّٰهِ حَدِيْثًا }» [ النساء : ۸۷ ] ’’اور اللہ سے زیادہ بات میں کون سچا ہے۔‘‘"
    },
    {
      "Ayah": 123,
      "tafsir": "(آیت 123) ➊ { لَيْسَ بِاَمَانِيِّكُمْ … :} اہل کتاب کا خیال تھا کہ ہم خاص بندے ہیں، جن گناہوں پر لوگ پکڑے جائیں گے ہم نہیں پکڑے جائیں گے، ہمارے پیغمبر ہماری حمایت کریں گے، ہم صرف چند دن جہنم میں رہیں گے۔ ( دیکھیے بقرہ : ۸۰) جنت میں صرف ہم جائیں گے۔ (دیکھیے بقرہ : ۱۱۱) آج کل کچھ نادان مسلمان بھی اپنے حق میں یہ خیال رکھتے ہیں، سو اللہ نے فرمایا کہ برا کام جو کرے گا، کوئی ہو، سزا پائے گا، کسی کی حمایت کام نہیں آئے گی۔ اللہ کا پکڑا وہی چھوڑے تو چھوٹے۔ دنیا کی مصیبت پر آدمی قیاس کر لے۔ ¤ ➋ { مَنْ يَّعْمَلْ سُوْٓءًا يُّجْزَ بِهٖ …:} خوش فہمیاں اور خام خیالیاں سزا کو دفع نہیں کر سکتیں، سزا ضرور ملے گی، خواہ دنیا میں ملے یا آخرت میں، یہ الگ بات ہے کہ اللہ تعالیٰ توبہ کی وجہ سے، یا کسی نیک عمل کی وجہ سے، یا دنیا میں آنے والی مصیبتوں کی وجہ سے معاف فرما دے۔ خلاصہ یہ کہ کوئی یہ نہ سمجھے کہ وہاں اسے کوئی اپنے زور سے چھڑوا لے گا : «{ وَ لَا يَجِدْ لَهٗ مِنْ دُوْنِ اللّٰهِ وَلِيًّا وَّ لَا نَصِيْرًا }» ’’اور وہ اللہ کے سوا اپنے لیے نہ کوئی دوست پائے گا اور نہ کوئی مدد گار‘‘ ہاں، اللہ تعالیٰ خود ہی دنیا کی تکلیفوں کو اس کے لیے کفارہ بنا دے، یا اس کے توحید و سنت پر گامزن ہونے کی وجہ سے اس سے درگزر کر دے تو وہ مالک و مختار ہے۔"
    },
    {
      "Ayah": 124,
      "tafsir": "(آیت 124) {نَقِيْرًا:} نقیر اس چھوٹے سے گڑھے کو کہتے ہیں جو کھجور کی گٹھلی کی پشت پر ہوتا ہے، یعنی مرد ہو یا عورت اگر ایمان اور عمل صالح موجود ہے تو جنت میں جائیں گے اور ان پر تھوڑے سے تھوڑا ظلم بھی نہیں کیا جائے گا۔"
    },
    {
      "Ayah": 125,
      "tafsir": "(آیت 125) ➊ {وَ مَنْ اَحْسَنُ دِيْنًا …: } اس آیت میں اللہ تعالیٰ نے عمل کی قبولیت کی شرطیں بیان کی ہیں، پہلی یہ کہ اپنا چہرہ اللہ تعالیٰ کے تابع کر دے۔ دوسری یہ کہ وہ محسن ہو، تیسری یہ کہ ملت ابراہیم کی پیروی کرے، جو حنیف تھے۔ چہرہ تابع کرنے کا مطلب یہ ہے کہ اپنے آپ کو مکمل طور پر اللہ کے سپرد کر دے، اپنی مرضی ختم کر کے اس کی مرضی پر چلے، یہ ایمان ہے۔ محسن ہونے کا مطلب ہے کہ ہر عمل خالص اللہ کے لیے کرے ، جیسا کہ آپ صلی اللہ علیہ وسلم نے احسان کے بارے میں فرمایا : [ أَنْ تَعْبُدَ اللّٰهَ كَأَنَّكَ تَرَاهُ ] [ بخاری، الإیمان، باب سؤال جبریل النبیّ صلی اللہ علیہ وسلم : ۵۰ ]اور ملت ابراہیم کی پیروی کا مطلب یہ ہے کہ نبی کریم صلی اللہ علیہ وسلم کا پوری طرح فرماں بردار ہو جائے، کیونکہ اب قیامت تک ملت ابراہیم پر قائم صرف امت مسلمہ ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اِنَّ اَوْلَى النَّاسِ بِاِبْرٰهِيْمَ لَلَّذِيْنَ اتَّبَعُوْهُ وَ هٰذَا النَّبِيُّ وَ الَّذِيْنَ اٰمَنُوْا }» [ آل عمران : ۶۸ ] ’’بے شک سب لوگوں سے ابراہیم کے قریب یقینا وہی لوگ ہیں جنھوں نے اس کی پیروی کی اور یہ نبی اور وہ لوگ جو ایمان لائے۔‘‘ اور دیکھیے سورۂ نحل (۱۲۳) اگر ایمان نہیں تو کوئی عمل قبول نہیں، احسان و خلوص نہیں تو ریا ہے، جو شرک ہے اور نبی کے طریقے پر نہیں تو سنت نہیں، بلکہ بدعت ہے۔ ¤ ➋ { خَلِيْلًا:} جس کی دوستی دل کے درمیان پہنچ جائے اور اس میں کسی پہلو سے بھی کوئی خامی نہ رہے۔ نبی صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے مجھے بھی خلیل بنایا ہے جس طرح اس نے ابراہیم علیہ السلام کو خلیل بنایا۔‘‘ [ مسلم، المساجد، باب النھی عن بناء المساجد علی القبور… : ۵۳۲ ]"
    },
    {
      "Ayah": 126,
      "tafsir": "(آیت 126) یعنی اللہ تعالیٰ کے ابراہیم علیہ السلام اور نبی کریم صلی اللہ علیہ وسلم کو دوست بنانے کا مطلب یہ نہیں کہ جس طرح دوست برابر ہوتے ہیں، ان کی ملکیت بھی ایک ہی سمجھی جاتی ہے، اسی طرح ابراہیم علیہ السلام اللہ کے خلیل تھے، نہیں بلکہ آسمان و زمین کی ملکیت اب بھی اللہ ہی کے پاس ہے اور ہر شے کا احاطہ بھی اسی کے پاس ہے، یہ تو اس کا فضل و کرم ہے کہ اپنے ان خاص بندوں کو اپنا خلیل قرار دے کر ان کی عزت افزائی فرمائی۔ دلیل چاہو تو ابراہیم علیہ السلام کے والد آزر اور نبی صلی اللہ علیہ وسلم کے چچا ابو طالب کا معاملہ دیکھ لو۔"
    },
    {
      "Ayah": 127,
      "tafsir": "(آیت 127) ➊ {وَ يَسْتَفْتُوْنَكَ فِي النِّسَآءِ … :} گو یہاں یہ صراحت نہیں ہے کہ عورتوں کے بارے میں کیا سوال کر رہے تھے، لیکن اگلی چار آیات میں جو فتویٰ دیا گیا ہے اس سے اس سوال کا خود بخود پتا چل جاتا ہے۔ ¤ ➋ { قُلِ اللّٰهُ يُفْتِيْكُمْ فِيْهِنَّ وَ مَا يُتْلٰى عَلَيْكُمْ … :} یہاں دراصل کچھ سوالوں کے جواب کے لیے پچھلی آیات کا حوالہ دیا ہے کہ کتاب کی اسی سورت میں جو کچھ پڑھا جاتا ہے وہ اسی سے متعلق ہے، مثلاً آیت (۳) اور اس کے بعد کی آیات یتیم لڑکیوں کے نکاح سے متعلق ہیں، پھر عورتوں کے حقوق اور نا بالغ بچوں کی نگہداشت اور ان کا مال کھانے سے اجتناب اور ان کا ورثہ دینا یہ سب اسی کے بارے میں ہے۔ ¤ ➌ {وَ تَرْغَبُوْنَ اَنْ تَنْكِحُوْهُنَّ:} ’’اور رغبت رکھتے ہو کہ ان سے نکاح کر لو ‘‘ یہ ترجمہ اس صورت میں ہے کہ جب {”تَرْغَبُوْنَ“} کا صلہ {’’ فِيْ ‘‘} محذوف مانا جائے، جس کا معنی رغبت کرنا ہے اور اگر اس کا صلہ{ ’’ عَنْ ‘‘ } محذوف مانا جائے تو ترجمہ یوں ہو گا کہ تم ان سے نکاح کرنا پسند نہیں کرتے۔ عائشہ رضی اللہ عنھا کی حدیث سے اس دوسرے ترجمے کی تائید ہوتی ہے۔ زمانۂ جاہلیت میں یتیم بچیوں پر دونوں طرح کا ظلم کیا جاتا تھا۔ ابتدا سورت میں اس کی تفصیل گزر چکی ہے۔ (قرطبی) اس آیت کے مطلب میں شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اس سورت کے اول میں یتیم کے حق کا ذکر تھا اور فرمایا تھا کہ یتیم لڑکی، جس کا کوئی ولی نہ ہو مگر اس کا چچا زاد، سو وہ اگر سمجھے کہ میں اس کا حق ادا نہ کر سکوں گا تو وہ اسے اپنے نکاح میں نہ لائے، کسی دوسرے سے اس کا نکاح کر دے اور خود اس کا ولی بن جائے۔ اب مسلمانوں نے ایسی عورتوں کو نکاح میں لانا موقوف کر دیا، پھر دیکھا گیا کہ بعض اوقات لڑکی کے ولی ہی کے لیے اسے اپنے نکاح میں رکھنا بہتر ہوتا ہے، اس بنا پر رسول اللہ صلی اللہ علیہ وسلم سے رخصت مانگی گئی تو اس پر یہ آیت نازل ہوئی اور اجازت مل گئی اور فرمایا کہ وہ جو کتاب میں منع کیا گیا تھا وہ اس وقت ہے کہ اس کا حق پورا نہ دو، اگر ان کے حق کی بہتری کی سوچو تو رخصت ہے۔‘‘ (موضح) ¤ ➍ { وَ الْمُسْتَضْعَفِيْنَ :} یعنی ان کے بارے میں بھی اپنے احکام یاد دلاتا ہے جو اس سورت کے شروع میں میراث کے تحت دیے گئے ہیں۔ دیکھیے سورۂ نساء (۱۰، ۱۱)۔"
    },
    {
      "Ayah": 128,
      "tafsir": "(آیت 128) ➊ { وَ اِنِ امْرَاَةٌ خَافَتْ … : ”نُشُوْزًا“ } کا مطلب ہے زیادتی، لڑائی جھگڑا، اعراض، بے رخی۔ نشوز یا اعراض یہ ہے کہ اس سے بدسلوکی کرے، اس کو حقیر سمجھے، اس کے پاس سونا بیٹھنا چھوڑ دے، اسے نان و نفقہ نہ دے، مارنے کے لیے بہانے تراشے، یا اس کے پاس اور بیوی ہے جسے وہ زیادہ چاہتا ہے، اس لیے اس کی طرف توجہ کم ہے، تو اس صورت میں دو ہی صورتیں ہو سکتی ہیں، ایک تو یہ کہ عورت سمجھے کہ میں اسی شخص کے نکاح میں رہوں تو میرے حق میں بہتر ہے، خواہ مجھے اپنے کچھ حقوق چھوڑنے پڑیں۔ دوسری یہ کہ وہ اس سے علیحدہ ہو جائے، آیت (۱۲۸) میں پہلی صورت کا ذکر ہے اور آیت (۱۳۰) میں دوسری صورت کا ذکر ہے۔ ¤ ➋ { اَنْ يُّصْلِحَا بَيْنَهُمَا صُلْحًا: ”صُلْحًا“ } کی تنکیر ( کسی طرح کی صلح) سے معلوم ہوتا ہے کہ میاں بیوی آپس میں کسی طریقے سے بھی صلح کر لیں تو ان پر کوئی گناہ نہیں۔ عائشہ رضی اللہ عنھا بیان کرتی ہیں : ’’کسی مرد کے پاس کوئی عورت ہوتی اور اب وہ اسے مزید نہ رکھنا چاہتا اور طلاق دینے کا ارادہ کرتا تو وہ عورت کہہ دیتی کہ ( مجھے طلاق نہ دے، اپنے نکاح میں رہنے دے) میں اپنی باری کے بارے میں تمھیں اجازت دیتی ہوں (کہ تو جس بیوی کے پاس چاہے رہے) چنانچہ یہ آیت اس سلسلے میں نازل ہوئی۔‘‘ [ بخاری، التفسیر، باب : «و إن امرأۃ خافت… » : ۴۶۰۱ ] ¤ عبد اللہ بن عباس رضی اللہ عنھما بیان کرتے ہیں کہ سودہ رضی اللہ عنھا کو اندیشہ لاحق ہوا کہ رسول اللہ صلی اللہ علیہ وسلم انھیں طلاق دے دیں گے تو انھوں نے عرض کیا : ’’اے اللہ کے رسول ! میری باری کا دن عائشہ کو دے دیں مگر مجھے طلاق نہ دیں، تو آپ صلی اللہ علیہ وسلم نے اسی طرح کیا، اس پر یہ آیت اتری : «{ وَ اِنِ امْرَاَةٌ خَافَتْ مِنْۢ بَعْلِهَا نُشُوْزًا اَوْ اِعْرَاضًا }» ابن عباس رضی اللہ عنھما نے فرمایا : ’’وہ دونوں جس چیز پر صلح کر لیں وہ جائز ہے۔‘‘ [ ترمذی، تفسیر القرآن، باب و من سورۃ النساء : ۳۰۴۰ ] عائشہ رضی اللہ عنھا سے روایت ہے کہ جب سودہ بنت زمعہ رضی اللہ عنھا عمر رسیدہ ہو گئیں تو انھوں نے اپنا دن عائشہ کو ہبہ کر دیا تو نبی صلی اللہ علیہ وسلم ان کا دن بھی عائشہ کے پاس گزارتے تھے۔ [ بخاری، النکاح، باب المرأۃ تہب یومہا من زوجھا… : ۵۲۱۲ ] ¤ ➌ { وَ الصُّلْحُ خَيْرٌ:} یعنی صلح ہر حال میں بہتر ہے، کیونکہ شیطان اپنے کارندوں میں سے اس کارندے کو اپنے قریب کر کے شاباش دیتا ہے جو میاں بیوی کے درمیان علیحدگی کروا دے۔ [ مسلم، صفات المنافقین و أحکامھم، باب تحریش الشیطان … : 2813/67 ] ¤ ➍ { وَ اُحْضِرَتِ الْاَنْفُسُ الشُّحَّ: ”الشُّحَّ“} کا معنی ہے بخل، جس کے ساتھ حرص بھی ہو، یعنی انسان کا بخل اور لالچ تو فطری امر ہے، مرد کا شح یہ ہے کہ عورت سے فائدہ اٹھائے مگر اس کے پورے حقوق ادا نہ کرے اور عورت کا شح یہ ہے کہ مہر اور نان و نفقہ تو پورا وصول کرے مگر حقوق ادا کرنے میں کوتاہی کرے۔ ¤ ➎ { وَ اِنْ تُحْسِنُوْا وَ تَتَّقُوْا … : } یعنی اس لالچ کے جذبے کے باوجود اگر میاں بیوی ایک دوسرے سے احسان اور فیاضی کا سلوک کریں اور اللہ سے ڈرتے رہیں تو اللہ کے ہاں اس کا اجر ضرور پائیں گے، جو ان کے ہر عمل سے پورا با خبر ہے۔"
    },
    {
      "Ayah": 129,
      "tafsir": "(آیت 129) ➊ { وَ لَنْ تَسْتَطِيْعُوْۤا۠ اَنْ تَعْدِلُوْا … : } یعنی دو یا دو سے زیادہ بیویوں کے درمیان ہر لحاظ سے پوری پوری مساوات برتنا انسانی طاقت سے باہر ہے، کیونکہ عورتوں میں اپنی طبیعتوں، اخلاق و عادات، حسن صورت اور عمر وغیرہ میں ایک دوسری سے فرق ہوتا ہے۔ ایسی صورت میں اگر مرد کا میلان ایک کی طرف زیادہ اور دوسری کی طرف کم ہو تو یہ ایک فطری امر ہے، جس پر وہ چاہے بھی تو قابو نہیں پا سکتا۔ لہٰذا قرآن نے اس بات پر زور دیا کہ ایک سے زیادہ بیویاں ہونے کی صورت میں ایک کی طرف اس طرح جھک جانا کہ دوسری معلق (لٹکی ہوئی) ہو کر رہ جائے، گویا اس کا کوئی شوہر ہی نہیں اور نہ وہ غیر شادی شدہ ہے کہ کہیں اور نکاح کر لے، تو یہ حرام ہے، ظاہری حقوق میں عورتوں سے مساوی سلوک کیا جائے، دل کے میلان پر گرفت نہیں ہے۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم فرمایا کرتے تھے : ’’ یا اللہ ! یہ میری بیویوں کے درمیان اس چیز کی تقسیم ہے جس کا میں اختیار رکھتا ہوں ( یعنی کھانا پینا، کپڑا، سونا بیٹھنا وغیرہ) لہٰذا تو مجھے اس چیز پر ملامت نہ فرما جس کا میں اختیار نہیں رکھتا( یعنی دلی میلان اور محبت)۔‘‘ [ أبو داوٗد، النکاح، باب فی القسم بین النساء : ۲۱۳۴۔ ترمذی : ۱۱۴۰ ] ¤ ➋ بعض لوگوں نے اس آیت اور اس سورت کی آیت (۳) دونوں کو ملا کر نتیجہ نکالا ہے کہ ایک سے زیادہ بیویوں کے درمیان عدل ممکن ہی نہیں۔ دوسرا حکم ہے کہ اگر عدل نہ کر سکنے کا خوف ہو تو بس ایک بیوی یا لونڈی رکھو۔ معلوم ہوا کہ ایک سے زیادہ نکاح جائز نہیں۔ اس کے جواب کے لیے سورۂ نساء کی آیت (۳) کا حاشیہ ملاحظہ فرمائیں۔ بلکہ زیر تفسیر آیت میں تو عورتوں کے درمیان عدل میں اتنی رعایت دی ہے کہ اگر اللہ تعالیٰ نے منع نہ کیا ہوتا تو آدمی چار سے زیادہ بیویاں بھی رکھ سکتا تھا، بشرطیکہ کوئی عورت ایسی لٹکی ہوئی نہ ہوتی کہ خاوند اس کے پاس چکر ہی نہ لگاتا، نہ اس کے کھانے پینے کی فکر کرتا۔ اگر آدمی اصلاح کرے اور ڈرے تو جو کمی بیشی ہے وہ اللہ معاف کر دے گا۔"
    },
    {
      "Ayah": 130,
      "tafsir": "(آیت 130) ➊ { وَ اِنْ يَّتَفَرَّقَا يُغْنِ اللّٰهُ كُلًّا مِّنْ سَعَتِهٖ:} یہ دوسری صورت ہے کہ میاں بیوی کے درمیان صلح کی کوئی صورت باقی ہی نہیں رہی تو اچھے طریقے سے علیحدگی اختیار کر لیں۔ اللہ تعالیٰ دونوں کو اپنے فضل سے غنی کر دے گا۔ مرد کو دوسری بیوی مل جائے گی، جو اسے پسند ہو اور عورت کو دوسرا شوہر مل جائے گا جو اس سے محبت کرے اور اس کی ضرورتوں کا خیال رکھے۔ (قرطبی) اس سے اسلام کے احکام کی حکمت، وسعت اور رحمت کا اندازہ ہوتا ہے۔ بعض مذاہب میں طلاق کو حرام قرار دیا گیا ہے، ایک دفعہ جب نکاح ہو گیا اب وہ خواہ ایک دوسرے سے کتنے متنفر ہو جائیں، خواہ ان کی زندگی جہنم کا نمونہ بن جائے، طلاق نہیں دے سکتے ۔ نہیں ہر گز نہیں، جب تعلق روگ بن جائے تو اس کا ٹوٹنا ہی اچھا ہے۔ اسلام نے دونوں کے لیے علیحدگی کا راستہ رکھا ہے، جس کے ذریعے سے وہ نئی زندگی شروع کر کے امن و اطمینان سے زندگی بسر کر سکتے ہیں، رہی وہ حدیث جس میں ہے : [ أَبْغَضُ الْحَلاَلِ عِنْدَ اللّٰهِ الطَّلاَقُ ] ( اللہ کے نزدیک حلال میں سب سے نا پسندیدہ طلاق ہے) تو یہ حدیث صحیح سند سے رسول اللہ صلی اللہ علیہ وسلم سے ثابت نہیں۔ شیخ ناصر الدین البانی رحمہ اللہ نے بھی اسے ضعیف قرار دیا ہے۔ [ دیکھیے إرواء الغلیل : 106/7، ح : ۲۰۴۰ ] ¤ ➋ {وَ كَانَ اللّٰهُ وَاسِعًا حَكِيْمًا:} یعنی کوئی یہ نہ سمجھے کہ کسی کا رزق میرے ہاتھ میں ہے، اگر میں نہ دوں گا تو وہ بھوکا مر جائے گا۔ اللہ تعالیٰ رازق مطلق ہے اور اس کے انتظامات انسانی سمجھ سے بالاتر ہیں، اس نے جس طرح ملاپ میں حکمت رکھی ہے، جدائی میں بھی رکھی ہے۔"
    },
    {
      "Ayah": 131,
      "tafsir": "(آیت 132،131) ➊ { وَ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ:} گزشتہ آیات میں عورتوں اور یتیم بچوں سے متعلق احکام بیان کیے گئے تھے، اب جو یہ فرمایا کہ زمین و آسمان کی ہر شے اللہ کی ہے، تو اس سے لوگوں کو یہ بتانا مقصود ہے کہ ان احکام پر عمل کرنے میں تمھارا ہی فائدہ ہے، اللہ تعالیٰ کسی کے فائدے اور نقصان سے بے نیاز ہے۔ ¤ ➋ {وَ لَقَدْ وَصَّيْنَا الَّذِيْنَ اُوْتُوا الْكِتٰبَ … :} یعنی تم سے پہلے لوگوں کو اور تم سب کو اس بات کا تاکیداً حکم دیا گیا کہ اللہ سے ڈرو، یعنی اس کے دیے گئے احکام پر عمل کرو۔ یہ جملہ {”اتَّقُوا اللّٰهَ“} قرآن کی تمام آیات کے لیے بمنزلہ رحی (چکی) کے ہے کہ اسی کی لٹھ پر تمام آیات گھومتی ہیں۔ ابن عاشور رحمہ اللہ نے فرمایا : ’’قرآن مجید میں اللہ کے اسماء کے بعد سب سے زیادہ اسی کا ذکر ہوا ہے۔‘‘ ¤ ➌ شاہ عبدالقادر رحمہ اللہ لکھتے ہیں : ’’تین بار فرمایا کہ اللہ کا ہے جو کچھ آسمان و زمین میں ہے، پہلی بار کشائش( کھلا رزق دینے) کا بیان ہے (کہ علیحدگی کی صورت میں اللہ تعالیٰ دونوں کو غنی کر دے گا، کیونکہ جو کچھ بھی ہے اللہ ہی کا ہے، جسے جس طرح چاہے دیتا ہے) دوسری دفعہ اس کی بے پروائی کا بیان ہے کہ اگر تم کفر کرو، منکر بنو (تو اللہ بھی بے پروا ہے، کیونکہ سبھی کچھ اس کا ہے) اور تیسری بار اللہ کے کارساز ہونے کا بیان ہے کہ اگر تم تقویٰ اختیار کرو (تو وہ کافی وکیل ہے)۔‘‘ (موضح)"
    },
    {
      "Ayah": 132,
      "tafsir": "(آیت 132،131) ➊ { وَ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ:} گزشتہ آیات میں عورتوں اور یتیم بچوں سے متعلق احکام بیان کیے گئے تھے، اب جو یہ فرمایا کہ زمین و آسمان کی ہر شے اللہ کی ہے، تو اس سے لوگوں کو یہ بتانا مقصود ہے کہ ان احکام پر عمل کرنے میں تمھارا ہی فائدہ ہے، اللہ تعالیٰ کسی کے فائدے اور نقصان سے بے نیاز ہے۔ ¤ ➋ {وَ لَقَدْ وَصَّيْنَا الَّذِيْنَ اُوْتُوا الْكِتٰبَ … :} یعنی تم سے پہلے لوگوں کو اور تم سب کو اس بات کا تاکیداً حکم دیا گیا کہ اللہ سے ڈرو، یعنی اس کے دیے گئے احکام پر عمل کرو۔ یہ جملہ {”اتَّقُوا اللّٰهَ“} قرآن کی تمام آیات کے لیے بمنزلہ رحی (چکی) کے ہے کہ اسی کی لٹھ پر تمام آیات گھومتی ہیں۔ ابن عاشور رحمہ اللہ نے فرمایا : ’’قرآن مجید میں اللہ کے اسماء کے بعد سب سے زیادہ اسی کا ذکر ہوا ہے۔‘‘ ¤ ➌ شاہ عبدالقادر رحمہ اللہ لکھتے ہیں : ’’تین بار فرمایا کہ اللہ کا ہے جو کچھ آسمان و زمین میں ہے، پہلی بار کشائش( کھلا رزق دینے) کا بیان ہے (کہ علیحدگی کی صورت میں اللہ تعالیٰ دونوں کو غنی کر دے گا، کیونکہ جو کچھ بھی ہے اللہ ہی کا ہے، جسے جس طرح چاہے دیتا ہے) دوسری دفعہ اس کی بے پروائی کا بیان ہے کہ اگر تم کفر کرو، منکر بنو (تو اللہ بھی بے پروا ہے، کیونکہ سبھی کچھ اس کا ہے) اور تیسری بار اللہ کے کارساز ہونے کا بیان ہے کہ اگر تم تقویٰ اختیار کرو (تو وہ کافی وکیل ہے)۔‘‘ (موضح)"
    },
    {
      "Ayah": 133,
      "tafsir": "(آیت 133) یعنی اگر تم تقویٰ اختیار نہ کرو تو مت بھولو کہ وہ اس بات پر بھی قادر ہے کہ تم سب کو فنا کر دے اور تمھاری جگہ اور لوگوں کو یہاں بسا دے، جیسا کہ فرمایا : «{ وَ اِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُوْنُوْۤا اَمْثَالَكُمْ }» [ محمد : ۳۸ ] ’’ اور اگر تم پھر جاؤ گے تو وہ تمھاری جگہ تمھارے سوا اور لوگوں کو لے آئے گا، پھر وہ تمھاری طرح نہیں ہوں گے۔‘‘"
    },
    {
      "Ayah": 134,
      "tafsir": "(آیت 134) یعنی جس شخص کا مطلوب و مقصود صرف دنیا ہی ہے اسے یاد رکھنا چاہیے کہ اللہ کے پاس دنیا اور آخرت دونوں کا ثواب موجود ہے تو تم صرف فانی کی طلب میں کیوں بیٹھے ہو، دنیا اور آخرت دونوں کیوں طلب نہیں کرتے۔ اللہ کے احکام پر عمل کرو گے تو دنیا بھی تمھاری اور آخرت بھی۔ صرف دنیا کی طلب تو خسارا ہی خسارا ہے۔ رہا یہ کہ تمھارا عمل دنیا کے لیے ہے یا آخرت کے لیے، تو اسے اللہ تعالیٰ خوب سنتا ہے، دیکھتا ہے۔ (دیکھیے ہود : ۱۵، ۱۶۔ بقرہ : ۲۰۰ تا ۲۰۲۔ بنی اسرائیل : ۱۸ تا ۲۱)"
    },
    {
      "Ayah": 135,
      "tafsir": "(آیت 135) ➊ {كُوْنُوْا قَوّٰمِيْنَ بِالْقِسْطِ … :} یعنی انصاف پر پوری طرح قائم رہ کر اللہ کے لیے گواہی دو، چاہے وہ تمھارے خلاف ہی پڑے، یا والدین یا قرابت داروں کے اور اس میں تمھارا ذاتی نقصان ہی کیوں نہ ہو۔ (ابن کثیر) ¤ ➋ اس آیت سے ثابت ہوتا ہے کہ اولاد کی شہادت ماں باپ کے خلاف قبول ہو گی اور یہ ان کے ساتھ {”بِرٌّ“} یعنی احسان کے منافی نہیں ہے۔ والدین اور بھائی کی شہادت بھی سلف کے نزدیک مقبول ہے، مگر یہ اسی صورت میں ہے کہ جب وہ عادل ہوں اور ان پر تہمت نہ ہو۔ اسی تہمت کے پیش نظر بعض ائمہ نے میاں بیوی کی ایک دوسرے کے حق میں شہادت کو جائز رکھا ہے اور بعض نے رد کیا ہے۔ (قرطبی ) ¤ ➌ { اِنْ يَّكُنْ غَنِيًّا اَوْ فَقِيْرًا … : } یعنی جس کے خلاف تمھاری گواہی پڑ رہی ہے وہ دولت مند ہے تب اور غریب ہے تب، تم اللہ تعالیٰ اور اس کی شریعت سے بڑھ کر اس کے خیر خواہ نہیں ہو سکتے، لہٰذا نہ تم دولت مند کی دولت مندی کی وجہ سے اس کی بے جا حمایت یا مخالفت کرو اور نہ غریب پر ترس کھا کر اس کی بے جا رعایت کرو، بلکہ ہر صورت میں اللہ تعالیٰ کے حکم کے مطابق سچی گواہی دو۔ ایسا نہیں ہونا چاہیے کہ غریب کی غربت تمھیں اس کی بے جا حمایت پر آمادہ کر دے، تم اللہ تعالیٰ سے بڑھ کر اس کے بندوں کے، خواہ وہ امیر ہوں یا غریب، نہ زیادہ خیر خواہ ہو سکتے ہو اور نہ زیادہ ان پر حق رکھنے والے۔ ¤ ➍ {وَ اِنْ تَلْوٗۤا …:} ’’{لَوَي يَلْوِيْ لَيًّا } (ض)‘‘ پیچ دینا، یعنی اگر تم زبان کو پیچ دے کر اس طرح بات بنا کر پیش کرو کہ جس کے خلاف گواہی پڑنی چاہیے وہ بچ جائے، یا {’’ تُعْرِضُوْا ‘‘} یعنی گواہی دینے ہی سے پہلو بچاؤ، بلکہ چھپا جاؤ تو بے شک تم جو کچھ کرتے ہو اللہ تعالیٰ ہمیشہ سے اس سے پوری طرح با خبر ہے، اس کی پوری سزا اللہ کے ہاں پاؤ گے۔ یہ نہ سمجھنا کہ ہم نے صاف جھوٹ نہیں بولا تو جھوٹی گواہی کے گناہ سے بچ جائیں گے۔"
    },
    {
      "Ayah": 136,
      "tafsir": "(آیت 136) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اٰمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ … : } یہاں ایمان والوں کو ایمان لانے کا حکم دیا جا رہا ہے، یعنی ایمان پر ثابت قدم رہو، یا اپنے ایمان میں اخلاص پیدا کرو، اس کے مخاطب تمام مومنین ہیں۔ بعض نے لکھا ہے کہ اس کے مخاطب اہل کتاب کے مومن ہیں، لیکن پہلی بات زیادہ صحیح ہے۔ (فتح القدیر) قرطبی لکھتے ہیں، بعض کا خیال ہے کہ یہ خطاب منافقین سے ہے، ان کے بظاہر مسلمان ہونے کی وجہ سے ایمان والے فرما دیا اور معنی یہ ہے کہ جب تک دل میں کامل یقین پیدا نہیں کرو گے اور خالص اللہ کو نہیں مانو گے تو اللہ کے ہاں مسلمان نہیں ہو سکتے۔ ¤ ➋ پہلی کتابوں پر ایمان رکھنے کا مطلب یہ ہے کہ ان کے متعلق یہ عقیدہ رکھا جائے کہ وہ بھی قرآن کی طرح اللہ تعالیٰ کی طرف سے نازل ہوئی تھیں۔ باقی رہا عمل! تو وہ ان پر نہیں بلکہ قرآن مجید اور نبی صلی اللہ علیہ وسلم کی سنت پر کیا جائے گا۔ ان کتابوں میں جو چیز کتاب و سنت کے مطابق ہو گی اس کی تصدیق کی جائے گی اور جو ان کے خلاف ہو گی اسے رد کر دیا جائے گا۔ ¤ ➌ { وَ مَنْ يَّكْفُرْ بِاللّٰهِ … :} یعنی اگر ان میں سے کسی ایک چیز کا بھی انکار کیا تو گویا تمام چیزوں کا انکار کر دیا۔"
    },
    {
      "Ayah": 137,
      "tafsir": "(آیت 137) {اِنَّ الَّذِيْنَ اٰمَنُوْا ثُمَّ كَفَرُوْا … : } ان لوگوں سے مراد منافقین ہیں جو مسلمان تو ہو گئے مگر جب کوئی فائدہ دیکھتے تو ایمان کی طرف بڑھ جاتے اور اگر کوئی تکلیف پہنچتی تو کافر ہو جاتے۔ یہ لوگ مشرکین اوس و خزرج میں سے بھی تھے اور یہود مدینہ سے بھی۔ اب بھی بے شمار مسلمانوں کا یہی حال ہے، فرمایا : «{ وَ مِنَ النَّاسِ مَنْ يَّعْبُدُ اللّٰهَ عَلٰى حَرْفٍ }» [ الحج : ۱۱ ] ’’اور لوگوں میں سے کوئی وہ ہے جو اللہ کی عبادت ایک کنارے پر کرتا ہے۔‘‘ پھر ’’کفر میں بڑھ گئے‘‘ یعنی پھر وہ کفر پر قائم رہے اور اسی پر مر گئے، کیونکہ کفر کا یہی وہ درجہ ہے جس کی بخشش نہیں ہوتی، لیکن اگر کوئی شخص تائب ہو جائے اور ایمان لے آئے تو اس کے تمام گناہ بخش دیے جاتے ہیں۔ یہاں بات ان لوگوں کی ہو رہی ہے جنھوں نے ایمان قبول کیا، پھر اسے چھوڑ دیا، پھر اسے قبول کر لیا، پھر اسے چھوڑ کر گمراہی کو قبول کر لیا اور پھر گمراہی میں بڑھتے ہی گئے، حتیٰ کہ کفر کی حالت میں مر گئے، تو مرنے کے بعد ایسے لوگوں کی توبہ قبول نہیں، اللہ انھیں معاف نہیں کرے گا، کیونکہ اس صورت حال تک پہنچنے کے بعد اس سے نکلنے کی کوئی صورت ہی نہیں کہ اب انھیں نکلنے کی کوئی صورت مل سکے۔ انھی لوگوں کا ذکر سورۂ آل عمران (۷۲)، سورۂ منافقون(۳) اور سورۂ نساء (۱۸) میں کیا گیا ہے۔"
    },
    {
      "Ayah": 138,
      "tafsir": "(آیت 139،138) {بَشِّرِ الْمُنٰفِقِيْنَ … :} بشارت خوشی کی خبر کو کہتے ہیں، یہاں بطور طنز کہا ہے کہ منافقوں کو عذاب الیم کی خوش خبری دے دو، جو مسلمانوں کے بجائے کافروں کو اس لیے دوست بناتے ہیں کہ اس سے انھیں عزت حاصل ہو گی، اللہ تعالیٰ نے فرمایا کہ عزت کافروں کی دوستی میں نہیں بلکہ وہ تو سب کی سب اللہ کے ہاتھ میں ہے۔ یہی بات سورۂ فاطر (۱۰) اور سورۂ منافقون(۸) میں بیان فرمائی، بلکہ سورۂ منافقون میں فرمایا : ’’ لیکن منافق نہیں جانتے‘‘ کہ اللہ کے ہاں عزت تو کفر کی وجہ سے گئی اور کفار کے پاس عزت تھی ہی نہیں جو انھیں ملتی، اگر بظاہر کچھ تھی بھی تو ان کے دوغلے پن کی وجہ سے ان کا اعتبار بھی اٹھ گیا۔ [ خَسِرَ الدُّنْیَا وَالْآخِرَۃَ ]"
    },
    {
      "Ayah": 139,
      "tafsir": "(آیت 139،138) {بَشِّرِ الْمُنٰفِقِيْنَ … :} بشارت خوشی کی خبر کو کہتے ہیں، یہاں بطور طنز کہا ہے کہ منافقوں کو عذاب الیم کی خوش خبری دے دو، جو مسلمانوں کے بجائے کافروں کو اس لیے دوست بناتے ہیں کہ اس سے انھیں عزت حاصل ہو گی، اللہ تعالیٰ نے فرمایا کہ عزت کافروں کی دوستی میں نہیں بلکہ وہ تو سب کی سب اللہ کے ہاتھ میں ہے۔ یہی بات سورۂ فاطر (۱۰) اور سورۂ منافقون(۸) میں بیان فرمائی، بلکہ سورۂ منافقون میں فرمایا : ’’ لیکن منافق نہیں جانتے‘‘ کہ اللہ کے ہاں عزت تو کفر کی وجہ سے گئی اور کفار کے پاس عزت تھی ہی نہیں جو انھیں ملتی، اگر بظاہر کچھ تھی بھی تو ان کے دوغلے پن کی وجہ سے ان کا اعتبار بھی اٹھ گیا۔ [ خَسِرَ الدُّنْیَا وَالْآخِرَۃَ ]"
    },
    {
      "Ayah": 140,
      "tafsir": "(آیت 140) {وَ قَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتٰبِ … :} اس سے پہلے سورۂ انعام (۶۸) میں یہ حکم نازل ہو چکا تھا، چنانچہ فرمایا : «وَ اِذَا رَاَيْتَ الَّذِيْنَ يَخُوْضُوْنَ فِيْۤ اٰيٰتِنَا فَاَعْرِضْ عَنْهُمْ حَتّٰى يَخُوْضُوْا فِيْ حَدِيْثٍ غَيْرِهٖ وَ اِمَّا يُنْسِيَنَّكَ الشَّيْطٰنُ فَلَا تَقْعُدْ بَعْدَ الذِّكْرٰى مَعَ الْقَوْمِ الظّٰلِمِيْنَ» [ الأنعام : ۶۸ ] ’’اور جب تو ان لوگوں کو دیکھے جو ہماری آیات کے بارے میں (فضول) بحث کرتے ہیں تو ان سے کنارہ کر، یہاں تک کہ وہ اس کے علاوہ بات میں مشغول ہو جائیں اور اگر کبھی شیطان تجھے ضرور ہی بھلا دے تو یاد آنے کے بعد ایسے ظالم لوگوں کے ساتھ مت بیٹھ۔‘‘ حدیث میں ایسی مجلس میں بیٹھنے سے بھی منع کیا گیا ہے جہاں اللہ کے حکم کی صریح نافرمانی ہو، چنانچہ فرمایا : ’’جو شخص اللہ اور یوم آخرت پر ایمان رکھتا ہو وہ اس دسترخوان پر نہ بیٹھے جس پر شراب کا دور چلتا ہو۔‘‘ [ أحمد: 20/1، ح : ۱۲۶ ، و حسنہ الألبانی فی غایۃ المرام ] ایسے واضح احکام کے باوجود منافقین کی یہ روش تھی کہ مسلمانوں کی مجلسوں کو چھوڑ کر یہودیوں اور مشرکوں کی مجلسوں میں شریک ہوتے جہاں آیات الٰہی کا مذاق اڑایا جاتا۔ زیر تفسیر آیت میں ان کی اسی روش کی طرف اشارہ ہے، ویسے آیت عام ہے اور ہر ایسی مجلس میں شرکت حرام ہے جہاں قرآن و سنت کا مذاق اڑایا جاتا ہو، چاہے وہ کفار و مشرکین کی مجلس ہو یا اہل بدعت اور فساق و فجار کی۔ جب برائی کو ہاتھ سے بھی نہ روک سکے، نہ زبان سے تو پھر خاموش بیٹھ کر سنتے رہنا اور دل میں برا بھی نہ جاننا تو کمزور ترین ایمان کے بھی منافی ہے، بلکہ فرمایا : ’’تم بھی اس وقت ان جیسے ہو گے۔‘‘ اسی لیے شاہ عبد القادر رحمہ اللہ نے فرمایا : ’’ جو شخص ایک مجلس میں اپنے دین کے عیب سنے، پھر انھی میں بیٹھے، اگرچہ آپ نہ کہے وہی منافق ہے۔‘‘ (موضح)"
    },
    {
      "Ayah": 141,
      "tafsir": "(آیت 141) ➊ { الَّذِيْنَ يَتَرَبَّصُوْنَ بِكُمْ … : } یعنی یہ منافقین تمھارے بارے میں تاک اور انتظار میں رہتے ہیں، اگر اللہ کی طرف سے تمھیں فتح مل جائے توکہتے ہیں، کیا ہم تمھارے ساتھ نہ تھے، یعنی اس فتح میں ہمارا بھی حصہ ہے اور اگر کسی وقت کافروں کو کوئی حصہ مل جائے تو ان سے کہتے ہیں، کیا ہم تم پر غالب نہیں آ گئے تھے، پھر یہ ہمارا ہی کام تھا کہ ہم نے ایسے وسائل اختیار کیے جن سے مسلمانوں کے حوصلے پست ہو گئے اور ہم نے تمھیں مسلمانوں سے بچا لیا، یعنی منافقین دونوں طرف اپنا احسان چڑھاتے رہتے تھے۔ ¤ ➋ { فَاللّٰهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيٰمَةِ:} یعنی دنیا میں تو ان منافقین نے بظاہر کلمہ پڑھ کر اپنے آپ کو بچا لیا، لیکن آخرت میں ان کی حقیقت کھول دی جائے گی اور پتا چل جائے گا کہ کون مومن تھا اور کون منافق ؟ ¤ ➌ {وَ لَنْ يَّجْعَلَ اللّٰهُ … :} اگر کوئی کہے کہ اللہ کا وعدہ ہے کہ اللہ کافروں کے لیے مومنوں پر ہر گز کوئی راستہ نہیں بنائے گا، مگر اس وقت معاملہ اس کے برعکس ہے تو اس کا جواب یہ ہے کہ تاریخ شاہد ہے کہ ان مومنوں پر جن کا یہاں ذکر ہے، کفار کو کبھی غلبہ حاصل نہیں ہوا، اب اگر مومن ہی وہ مومن نہ رہیں اور جہاد چھوڑ بیٹھیں تو اس میں اللہ کے وعدے کا کیا قصور ہے؟"
    },
    {
      "Ayah": 142,
      "tafsir": "(آیت 142) ➊ {اِنَّ الْمُنٰفِقِيْنَ يُخٰدِعُوْنَ اللّٰهَ وَ هُوَ خَادِعُهُمْ:} اس جملے کی تشریح سورۂ بقرہ کی آیت (۹) اور (۱۵) میں ہو چکی ہے۔ اللہ تعالیٰ کا انھیں دھوکا دینا بھی اسی طرح ہو گا جس طرح اس کی شان کے لائق ہے۔ ¤ ➋ { وَ اِذَا قَامُوْۤا اِلَى الصَّلٰوةِ قَامُوْا كُسَالٰى … :} اس آیت سے معلوم ہوتا ہے کہ منافقین کو اپنے اسلام کا ثبوت پیش کرنے کے لیے مسجد میں آنا پڑتا تھا۔ اگر کوئی مسجد میں نماز نہ پڑھتا تو مسلمان شمار نہیں ہوتا تھا، منافقین کی یہ نمازیں صرف مسلمانوں کے دکھلاوے کے لیے تھیں، اس لیے جن نمازوں میں چھپنے کی گنجائش ہوتی اس میں وہ غیر حاضر رہتے، جیسے صبح اور عشاء کی نماز۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’منافقین پر صبح اور عشاء کی نماز تمام نمازوں سے زیادہ بھاری ہے، حالانکہ اگر وہ جانتے کہ ان کا کیا ثواب ہے تو وہ ان میں حاضر ہوتے، چاہے انھیں ان میں گھسٹ کر آنا پڑتا۔‘‘ [ بخاری، الأذان، باب فضل فی صلوۃ العشاء… : ۶۵۷۔ مسلم : 652،651 ] ¤ ➌ {لَا يَذْكُرُوْنَ اللّٰهَ اِلَّا قَلِيْلًا:} یعنی جلدی جلدی، جیسے کوئی بیگار ٹالنا مقصود ہے۔ انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ منافق کی نماز ہے، بیٹھا سورج کا انتظار کرتا رہتا ہے، یہاں تک کہ جب وہ شیطان کے دو سینگوں کے درمیان ( یعنی غروب کے بالکل قریب) ہو جاتا ہے، تو اٹھتا ہے اور چار ٹھونگے مار لیتا ہے، ان میں اللہ کو یاد نہیں کرتا مگر بہت کم۔‘‘ [ مسلم، المساجد، باب استحباب التبکیر : ۶۲۲ ] معلوم ہوا کہ عصر کی نماز دیر سے پڑھنا بھی نفاق ہے اور جلدی جلدی اکٹھے دو سجدے بھی، جن میں وقفہ نہ ہو، ایک ہی سجدہ ہوتے ہیں، ورنہ آپ چار کے بجائے آٹھ ٹھونگے فرماتے۔"
    },
    {
      "Ayah": 143,
      "tafsir": "(آیت 143) ➊ { مُذَبْذَبِيْنَ بَيْنَ ذٰلِكَ…:} نبی کریم صلی اللہ علیہ وسلم نے فرمایا : ’’منافق کی مثال اس بکری کی سی ہے جو دو ریوڑوں کے درمیان ماری ماری پھرتی ہے، کبھی اس ریوڑ کی طرف اور کبھی اس ریوڑ کی طرف اور نہیں جانتی کہ ان دونوں میں سے کس کے پیچھے لگے۔‘‘ [ مسلم، صفات المنافقین، باب صفات المنافقین : ۲۷۸۴ ] ¤ ➋ یعنی جو شخص سب کچھ جاننے اور سمجھنے کے باوجود خود گمراہی میں پڑا ہو اور باطل پرستی کی طرف راغب ہو تو اسے راہِ راست پر لانے کے لیے کوئی انسانی نصیحت اور کوشش کارگر نہیں ہو سکتی، بلکہ وہ تو اللہ تعالیٰ کی طرف سے دی ہوئی سزا کے طور پر گمراہی اور باطل پرستی میں پختہ سے پختہ تر ہوتا چلا جائے گا۔"
    },
    {
      "Ayah": 144,
      "tafsir": "(آیت 144) ➊ {لَا تَتَّخِذُوا الْكٰفِرِيْنَ اَوْلِيَآءَ … :} اللہ تعالیٰ نے قرآن کریم میں کافروں کو دوست بنانے کی جگہ جگہ ممانعت کی ہے، دیکھیے سورۂ آل عمران (۲۸)، سورۂ مائدہ (۵۱)، سورۂ مجادلہ (۲۲) اور سورۂ ممتحنہ(۱)۔ ¤ ➋ { اَتُرِيْدُوْنَ اَنْ تَجْعَلُوْا … :} یعنی اس کے حکم کی خلاف ورزی کر کے عذاب الٰہی کے لیے ایسی واضح اور کھلی دلیل اپنے اوپر قائم کرنا چاہتے ہو کہ اس کے بعد مستحق عذاب ہونے میں کسی قسم کا شک و شبہ نہ رہے۔"
    },
    {
      "Ayah": 145,
      "tafsir": "(آیت 145) { اِنَّ الْمُنٰفِقِيْنَ فِي الدَّرْكِ الْاَسْفَلِ … :} جس طرح جنت کے درجات ہیں، سب سے اونچا درجہ فردوس سب سے افضل ہے، اسی طرح جہنم کے بھی درکات ہیں، جو جتنا نیچا ہے اتنا ہی سخت ہے۔ منافقین جہنم کے سب سے نچلے طبقے میں ہوں گے، کیونکہ نفاق صریح کفر سے بھی زیادہ خطرناک ہے۔"
    },
    {
      "Ayah": 146,
      "tafsir": "(آیت 146) {اِلَّا الَّذِيْنَ تَابُوْا وَ اَصْلَحُوْا … :} جن منافقین کی اوپر مذمت کی ہے ان کی نجات کے لیے بطور استثنا چار باتیں فرمائیں، ایک یہ کہ اپنے پچھلے رویے پر نادم ہوں، دوسرے یہ کہ آئندہ کے لیے اپنی پوری طرح اصلاح کر لیں، تیسری یہ کہ اللہ کی رسی مضبوط پکڑیں، چوتھا یہ کہ دین کا جو کام کریں خالص اللہ کی رضا مندی حاصل کرنے کے لیے کریں۔ (احسن التفاسیر) یہ چاروں کام درجہ بدرجہ اور ایک دوسرے کی ترتیب پر قائم ہوں گے۔"
    },
    {
      "Ayah": 147,
      "tafsir": "(آیت 147) { مَا يَفْعَلُ اللّٰهُ بِعَذَابِكُمْ … :} مقصد یہ بتانا ہے کہ عذاب کا باعث تمھارا شکر نہ کرنا اور ایمان نہ لانا ہے، ورنہ اللہ تعالیٰ کو کیا ضرورت ہے کہ تمھیں عذاب دے، سو اگر تم دل سے ایمان لے آؤ اور قول و فعل سے اللہ کی فرماں برداری کر کے اس کا شکر ادا کرو تو اللہ قدر دان ہے اور سب کچھ جانتا بھی ہے۔"
    },
    {
      "Ayah": 148,
      "tafsir": "(آیت 148) ➊ {لَا يُحِبُّ اللّٰهُ الْجَهْرَ بِالسُّوْٓءِ ……:} یعنی اگر کسی شخص میں کوئی دینی یا دنیوی عیب پایا جاتا ہے تو اسے سر عام ذلیل کرنا جائز نہیں اور نہ ہر شخص کو بتانا جائز ہے، کیونکہ یہ غیبت ہے اور غیبت قطعی حرام ہے، البتہ جب کوئی شخص ظلم پر اتر آئے تو مظلوم کو حق حاصل ہے کہ وہ اس کی زیادتی کے خلاف آواز بلند کرے، خصوصاً جہاں آواز بلند کرنے سے اس پر ظلم رک سکتا ہو، یا اس کا مداوا ہو سکتا ہو۔ اسی طرح لوگوں کو اس کے ظلم سے بچانے کے لیے اس کا عیب بیان کرنا بھی جائز ہے۔ حدیث کے راویوں پر جرح بھی اسی ضمن میں آتی ہے، کیونکہ ضعیف روایت بیان کرنا امت پر ظلم ہے۔ کوئی شخص باوجود وسعت کے دوسرے کا حق نہ دیتا ہو تو اس کو طعن و ملامت کرنا بھی جائز ہے، رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’غنی آدمی کا حق ادا کرنے میں دیر کرنا، یا ٹال مٹول کرنا اس کی سزا اور اس کی عزت کو حلال کر دیتا ہے۔‘‘ [ بخاری، الاستقراض، باب لصاحب الحق مقال، قبل ح : ۲۴۰۱ ] اسی طرح جو زیادتی میں پہل کرے اسے جواب دینا جائز ہے، آپ صلی اللہ علیہ وسلم نے فرمایا : ’’آپس میں گالی گلوچ کرنے والے، وہ دونوں جو کچھ بھی کہیں، سب گناہ پہل کرنے والے پر ہے، جب تک مظلوم زیادتی نہ کرے۔‘‘ [ مسلم، البر والصلۃ، باب النھی عن السباب : ۲۵۸۷ ] اس آیت کے تحت مفسرین نے لکھا ہے کہ ظالم کے حق میں بددعا کرنا جائز ہے۔ مزید دیکھیے سورۂ شوریٰ (۴۱) کوئی شخص زبردستی اس کے منہ سے برا کلمہ نکلوائے تو وہ بھی اس کے تحت جائز ہے۔ (ابن کثیر، شوکانی) ایک شخص نے رسول اﷲ صلی اللہ علیہ وسلم کے پاس ہمسائے کی زیادتیوں کی شکایت کی، آپ نے اسے اپنا سامان گھر کے باہر راستے میں نکال کر رکھ دینے کا مشورہ دیا، اب جو گزرتا پوچھتا تو وہ ہمسائے کا ظلم بتاتا۔ ہمسائے نے یہ دیکھ کر معذرت کرلی اور آئندہ ایذا نہ پہنچانے کا وعدہ کیا اور سامان اندر رکھنے کی درخواست کی۔ [أبو داوٗد، الأدب، باب فی حق الجوار : ۵۱۵۳ ] ¤ ➋ گزشتہ آیات میں منافقین کے عیوب کا بیان تھا، یہاں بات مکمل کرنے کے لیے فرمایا کہ یہ چونکہ ظالم ہیں، اس لیے ان کے عیب ظاہر کرنا جائز ہے۔ (کبیر) تاہم حتی الوسع نام لے کر بیان نہ کرے۔ (موضح) «وَ كَانَ اللّٰهُ سَمِيْعًا عَلِيْمًا» یعنی اگر مظلوم زیادتی کرے گا تو اﷲ تعالیٰ کو وہ بھی معلوم ہے۔"
    },
    {
      "Ayah": 149,
      "tafsir": "(آیت 149) {اِنْ تُبْدُوْا خَيْرًا اَوْ تُخْفُوْهُ اَوْ تَعْفُوْا ……:} اس آیت میں معاف کر دینے کی ترغیب ہے، یعنی اگرچہ ظالم کا شکوہ یا اس کے حق میں بد دعا جائز ہے، تاہم عفو و درگزر سے کام لینا بہتر ہے، کیونکہ اﷲ تعالیٰ خود پوری قدرت رکھنے کے باوجود بہت معاف کرنے والا ہے، رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’ مال صدقے سے کم نہیں ہوتا اور معاف کر دینے سے اﷲ تعالیٰ بندے کی عزت میں اضافہ ہی کرتا ہے اور کوئی شخص اﷲ کے لیے نیچا نہیں ہوتا مگر اﷲ تعالیٰ اسے اونچا کر دیتا ہے۔‘‘ [ مسلم، البر والصلۃ، باب استحباب العفو والتواضع : ۲۵۸۸ ]"
    },
    {
      "Ayah": 150,
      "tafsir": "(آیت 150) ➊{ اِنَّ الَّذِيْنَ يَكْفُرُوْنَ بِاللّٰهِ وَ رُسُلِهٖ :} منافقین کے قبیح اعمال و اقوال بیان کرنے کے بعد اب یہاں سے اہل کتاب ( یہود و نصاریٰ) کے خیالات و شبہات اور ان کی تردید کا بیان شروع ہو رہا ہے اور یہ سلسلہ سورت کے آخر تک چلا گیا ہے۔ (رازی) اﷲ تعالیٰ کو ماننا اور رسالت و نبوت کو نہ ماننا کفر ہے۔ (قرطبی) اس لیے کہ اﷲ کا ماننا یہی ہے کہ زمانے کے پیغمبرکا حکم مانے، اس کے بغیر اﷲ کا ماننا غلط ہے۔ (موضح) نیز اﷲ کے احکام ماننے سے انکار اس کا بندہ ہونے سے انکار ہے اور بندگی (عبادت) سے انکار کا مطلب کائنات کو بنانے والے کا انکار ہے۔ ¤ ➋ {وَ يُرِيْدُوْنَ اَنْ يُّفَرِّقُوْا بَيْنَ اللّٰهِ وَ رُسُلِهٖ …… :} مراد اہل کتاب ہی ہیں اور بعد والے جملے انھی کی خصلتوں کی تفسیر ہیں۔ (قرطبی، رازی) یہود موسیٰ علیہ السلام پر ایمان رکھتے لیکن عیسیٰ علیہ السلام اور محمد صلی اللہ علیہ وسلم کا انکار کرتے تھے اور نصاریٰ موسیٰ اور عیسیٰ علیہما السلام کو مانتے مگر محمد صلی اللہ علیہ وسلم کا انکار کرتے۔ (ابن کثیر) ¤ ➌ {وَ يُرِيْدُوْنَ اَنْ يَّتَّخِذُوْا بَيْنَ ذٰلِكَ سَبِيْلًا :} یعنی سب کو ماننا ایمان ہے، کسی ایک کا انکار کفر ہے، جب کہ یہ لوگ بعض پر ایمان لا کر اور بعض سے انکار کر کے ایک تیسری راہ اختیار کرنا چاہتے ہیں اور اس کا نام یہودیت یا نصرانیت رکھتے ہیں، جیسا کہ ہمارے زمانے کے مادہ پرستوں نے مسجدوں میں نماز، بازاروں میں سود، غم و شادی اور عام رہن سہن میں غیر مسلموں کی نقالی اور عدالتوں اور حکومت کے شعبوں میں کفریہ قوانین، سب کچھ کو ملا کر اس کا نام اسلام رکھ دیا ہے اور بعض نے کہا کہ قرآن کو تو مانیں گے مگر نبی صلی اللہ علیہ وسلم کے فرمان کو نہیں مانیں گے۔ یہ منکرینِ حدیث بھی انھی لوگوں میں شامل ہیں۔"
    },
    {
      "Ayah": 151,
      "tafsir": "(آیت 151) {اُولٰٓىِٕكَ هُمُ الْكٰفِرُوْنَ حَقًّا:} یعنی ان لوگوں کے کافر ہونے میں کسی قسم کا شک و شبہ نہیں۔ {”حَقًّا“} مصدر محذوف کی تاکید ہے۔ (کبیر)"
    },
    {
      "Ayah": 152,
      "tafsir": "(آیت 152) {وَ الَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَ رُسُلِهٖ ……:} مراد امت محمد صلی اللہ علیہ وسلم ہے جو تمام پیغمبروں پر ایمان رکھتی ہے، لہٰذا ان کے لیے بشارت ہے۔ (قرطبی)"
    },
    {
      "Ayah": 153,
      "tafsir": "(آیت 153) ➊ {يَسْـَٔلُكَ اَهْلُ الْكِتٰبِ …… :} اس آیت میں یہود کی ایک اور جہالت کا بیان ہے اور اس کا مقصد ان کی سرکشی اور طبعی ضد و عناد کو بیان کرنا ہے۔ (کبیر) ان کا مقصد آپ صلی اللہ علیہ وسلم پر ایمان لانا تو تھا نہیں، محض شرارت کے لیے اور لاجواب کرنے کے لیے نت نئے اعتراضات پیش کرتے رہتے۔ ان میں سے ان کی ایک فرمائش یہ تھی کہ موسیٰ علیہ السلام کو اﷲ تعالیٰ کی طرف سے تختیاں ملی تھیں، لہٰذا آپ بھی اﷲ تعالیٰ کے پاس سے اسی طرح کی کتاب لا کر دکھائیں، تاکہ ہم آپ کی تصدیق کریں اور آپ پر ایمان لائیں۔ قرآن نے اس اعتراض کے جواب میں پہلے تو ان پر ان کی گزشتہ کارستانیاں بطور الزام پیش کیں (کیونکہ اصل خاموش کرانے والا جواب الزامی ہوتا ہے کہ پہلے اپنے گھر کی خبر لو، پھر اعتراض کرو) اور پھر آیت (۱۶۳) «اِنَّاۤ اَوْحَيْنَاۤ اِلَيْكَ كَمَاۤ اَوْحَيْنَاۤ » سے اس اعتراض کا تحقیقی جواب دیا ہے۔ (کبیر) اور یہ سلسلۂ بیان آیت (۱۷۰) تک چلا گیا ہے۔ اس کے بعد «يٰۤاَهْلَ الْكِتٰبِ لَا تَغْلُوْا فِيْ دِيْنِكُمْ» سے نصاریٰ سے خطاب ہے۔ (فتح الرحمن) ¤ ➋ {فَقَدْ سَاَلُوْا مُوْسٰۤى اَكْبَرَ مِنْ ذٰلِكَ :} فرمایا ( تمھاری اس فرمائش کے عین مطابق) موسیٰ علیہ السلام کتاب لائے تو تم نے اس سے بڑا مطالبہ پیش کر دیا، یعنی یہ کہ ہمیں واضح طور پر سامنے اﷲ تعالیٰ کا دیدار کراؤ۔ ( دیکھیے بقرہ : ۵۵) پھر اس سے بھی بڑی گستاخی کی کہ بچھڑے کو معبود بنا لیا، مگر ہم نے تمھیں معاف کر دیا اور تمھاری اس ضد، عناد اور جہل کے باوجود موسیٰ علیہ السلام کو ہم نے غلبہ اور اقتدار عطا فرما دیا اور تم لوگ ان کے حکم کی مخالفت نہ کر سکے۔ اس آیت میں رسول اﷲ صلی اللہ علیہ وسلم کے لیے بھی بشارت ہے کہ آخر کار یہ ضد اور عناد رکھنے والے مغلوب ہوں گے۔ اس کے بعد ان کی دوسری جہالتوں کا بیان ہے۔ (کبیر)"
    },
    {
      "Ayah": 154,
      "tafsir": "(آیت 154) ➊ { ”وَ رَفَعْنَا فَوْقَهُمُ الطُّوْرَ“ } کی تفسیر کے لیے دیکھیے سورۂ بقرہ (۶۳) اور { ”ادْخُلُوا الْبَابَ سُجَّدًا“ } کی تفسیر کے لیے دیکھیے سورۂ بقرہ(۵۸، ۵۹)۔ ¤ ➋ {وَ قُلْنَا لَهُمْ لَا تَعْدُوْا فِي السَّبْتِ :} ’’اصحاب سبت‘‘ جنھیں ہفتے کے دن مچھلی کے شکار سے منع کیا گیا تھا، ان کے قصے کے لیے دیکھیے سورۂ بقرہ (۶۵) اور سورۂ اعراف (۱۶۳)۔"
    },
    {
      "Ayah": 155,
      "tafsir": "(آیت 155) ➊ {فَبِمَا نَقْضِهِمْ مِّيْثَاقَهُمْ :} اس میں {’’مَا‘‘} تاکید کے لیے بڑھایا گیا ہے، یعنی ان کے اپنے پختہ عہد کو توڑنے ہی کی وجہ سے۔ یہاں کچھ الفاظ محذوف ہیں جو آیت پڑھنے والے کی سمجھ پر چھوڑ دیے گئے ہیں، چنانچہ اکثر مفسرین نے تو لکھا ہے کہ وہ الفاظ ہیں : { ”لَعَنَّاهُمْ“ } یعنی ہم نے ان پر لعنت کی، اس کی دلیل یہ ہے کہ دوسری جگہ اﷲ تعالیٰ نے فرمایا : «فَبِمَا نَقْضِهِمْ مِّيْثَاقَهُمْ لَعَنّٰهُمْ » [ المائدۃ : ۱۳ ] ’’ان کے اپنے پختہ عہد کو توڑنے کی وجہ سے ہم نے ان پر لعنت کی‘‘ اور بعض نے کہا کہ جس طرح اﷲ تعالیٰ نے بات کو عام رکھا ہے اسے عام رکھنا ہی بہتر ہے یعنی ان کے عہد کو توڑنے ہی کی وجہ سے { ”فَعَلْنَا بِهِمْ مَّا فَعَلْنَا“ } (ہم نے ان کے ساتھ کیا جو کیا) یعنی جو ہم نے ان کے ساتھ کیا وہ تمھارے اندازے سے باہر ہے۔ ¤ ➋ { ”وَ قَتْلِهِمُ الْاَنْۢبِيَآءَ۠ بِغَيْرِ حَقٍّ“ } کی تفسیر کے لیے دیکھیے سورۂ بقرہ (۶۱) اور { ”غُلْفٌ“ } کی تفسیر کے لیے دیکھیے سورۂ بقرہ (۸۸)۔ ¤ ➌ {فَلَا يُؤْمِنُوْنَ اِلَّا قَلِيْلًا:} یعنی بہت کم لوگ، جیسے عبد اﷲ بن سلام رضی اللہ عنہ اور ان کے چند ساتھی۔ دوسرا مطلب یہ بھی ہو سکتا ہے کہ {”قَلِيْلًا“} مصدر محذوف کی صفت ہو یعنی { ”اِيْمَانًا قَلِيْلاً“ } (وہ ایمان نہیں لائیں گے مگر تھوڑا) یعنی صرف موسیٰ علیہ السلام اور تورات پر۔ یہ ان کے گمان کے اعتبار سے فرمایا، ورنہ ایک نبی کو بھی جھٹلایا تو گویا سب کو جھٹلا دیا۔ (رازی)"
    },
    {
      "Ayah": 156,
      "tafsir": "(آیت 156) {وَ بِكُفْرِهِمْ وَ قَوْلِهِمْ عَلٰى مَرْيَمَ ……:} کے معنی یہ ہیں کہ انھوں نے عیسیٰ علیہ السلام کے معجزات دیکھنے کے باوجود ان کی نبوت کاانکار کر کے صریح کفر کا ارتکاب کیا اور پھر مریم علیھا السلام کی طرف زنا کی نسبت کر کے مزید بہتان باندھا۔"
    },
    {
      "Ayah": 157,
      "tafsir": "(آیت 157 )➊ {وَقَوْلِهِمْ اِنَّا قَتَلْنَا الْمَسِيْحَ عِيْسَى ابْنَ مَرْيَمَ رَسُوْلَ اللّٰهِ :} یہاں سوال پیدا ہوتا ہے کہ یہود خود مسیح علیہ السلام کی رسالت کا اقرار کر کے اپنے گمان میں انھیں قتل کرنے کا دعویٰ اور اس پر فخر کر رہے ہیں، یہ کیسے ہو سکتا ہے؟ مفسرین نے اس کے چند جواب دیے ہیں، پہلا یہ کہ وہ جو اپنے آپ کو ’’رسول اﷲ ‘‘ سمجھتا تھا، ہم نے اسے قتل کر دیا۔ دوسرا یہ کہ وہ بطور طنز انھیں ’’رسول اﷲ ‘‘ کہہ رہے تھے۔ تیسرا یہ کہ یہودیوں کا عیسیٰ علیہ السلام کے قتل کو بطور فخر ذکر کرنے پر اﷲ تعالیٰ نے عیسیٰ علیہ السلام کے اکرام اور شرف کے اظہار کے لیے اپنے پاس سے لفظ ’’رسول اﷲ‘‘ کا اضافہ کر دیا کہ ان ظالموں نے کتنی بڑی ہستی کو قتل کرنے کا دعویٰ کیا۔ چوتھا یہ کہ یہودیوں کو نہ مریم علیھا اسلام کے پاکباز ہونے میں کوئی شک تھا، نہ عیسیٰ علیہ السلام کے رسول ہونے میں، کیونکہ پیدائش کے دن ہی بطور معجزہ اﷲ تعالیٰ نے مسیح علیہ السلام کی زبانی تمام یہودیوں کے سامنے مریم علیھا السلام کی پاکبازی اور مسیح علیہ السلام کی رسالت ثابت فرما دی تھی، مگر قوم یہود کو جب مسیح علیہ السلام نے ان کے کفر و شرک، ریا کاری اور سود خوری پر ٹوکا تو وہ ان کی جان کے درپے ہو گئے اور گناہوں نے ان کے دل اس طرح مسخ کر دیے تھے کہ جس عظیم خاتون کو وہ تیس سال تک پاکباز سمجھتے رہے اس پر زنا کی تہمت لگا دی اور جسے دل سے رسول مانتے رہے گناہوں سے ٹوکنے پر اسے قتل کرنے کے درپے ہو گئے، حتیٰ کہ اپنے خیال میں قتل میں کامیاب ہو گئے اور اس پر فخر بھی کرنے لگے۔ انسانی طبائع جب مسخ ہوتی ہیں تو ان کی شقاوت کہاں تک پہنچ جاتی ہے، یہ اس کی مثال ہے۔ اس سے پہلے بھی وہ کئی رسولوں کو قتل کر چکے تھے۔ ¤ ➋ {وَ مَا قَتَلُوْهُ وَ مَا صَلَبُوْهُ وَ لٰكِنْ شُبِّهَ لَهُمْ:} قرآن پاک نے یہودیوں کے دعویٰ کی صاف نفی کی اور فرمایا کہ نہ انھوں نے مسیح علیہ السلام کو قتل کیا اور نہ سولی دی، بلکہ ان کے لیے کسی اور آدمی کو مسیح علیہ السلام کی شبیہ (ان جیسا) بنا دیا گیا۔ وہ اسے سولی دے کر سمجھتے رہے کہ ہم نے مسیح کو صلیب پر چڑھا دیا۔ یہ آدمی کون تھا اور کیسے شبیہ بنایا گیا، قرآن مجید یا حدیث رسول میں اس کی تفصیل بیان نہیں ہوئی، ہاں اگلی آیت میں آ رہا ہے کہ (عیسیٰ علیہ السلام کو نہ انھوں نے قتل کیا نہ سولی دیا بلکہ) اﷲ تعالیٰ نے انھیں اپنی طرف اٹھا لیا۔عیسیٰ علیہ السلام کی شبیہ بنائے جانے کی کیفیت کی ایک روایت ابن عباس رضی اللہ عنہما سے صحیح سند کے ساتھ امام ابن کثیر اور ابن جریر نے بیان فرمائی ہے کہ جب یہودی مسیح علیہ السلام کو پکڑنے کے لیے گئے تو آپ نے اپنے حواریوں سے فرمایا کہ تم میں سے کون شخص اس بات پر راضی ہے کہ اسے میرا شبیہ بنا دیا جائے؟ ایک حواری اس پر راضی ہو گیا، چنانچہ مسیح علیہ السلام کو اﷲ تعالیٰ نے آسمان کی طرف اٹھا لیا اور اس نوجوان کو مسیح علیہ السلام کی شکل و صورت میں تبدیل کر دیا گیا، یہودی آئے اور اس نوجوان کو سولی دے دی۔ ¤ ➌ {وَ اِنَّ الَّذِيْنَ اخْتَلَفُوْا فِيْهِ لَفِيْ شَكٍّ مِّنْهُ:} عیسیٰ علیہ السلام کے ہم شکل کو قتل کرنے کے بعد وہ لوگ خود تردد میں پڑ گئے کہ جسے ہم نے سولی دی ہے، کون ہے! بعض نے کہا، مسیح ہی قتل ہوئے ہیں اور بعض نے کہا کہ یہ مسیح تو نہیں بلکہ کوئی اور ہے۔ خود انھیں بھی یقین نہ ہو سکا کہ واقعی ہم نے انھی کو صلیب پر چڑھایا ہے، بس ایک گمان کی پیروی کے سوا ان کے پاس کچھ نہیں۔ یقینی علم تو بہت دور ہے، خود وہ بھی اختلاف کا شکار ہیں اور شک میں مبتلا ہیں کہ کون قتل ہوا۔ یہ اختلاف یہود میں بھی تھا اور نصاریٰ کے فرقوں میں بھی ہے، جن میں سے بعض کہتے ہیں کہ عیسیٰ علیہ السلام کے ناسوت (انسانی جسم) کو سولی دی گئی اور لاہوت (ان کا وہ حصہ جو خدا تھا) اوپر اٹھا لیا گیا۔ بعض دونوں کی سولی کے قائل ہیں وغیرہ، قرآن مجید نے ان سب کو جھوٹا قرار دیا۔"
    },
    {
      "Ayah": 158,
      "tafsir": "(آیت 158) {بَلْ رَّفَعَهُ اللّٰهُ اِلَيْهِ وَ كَانَ اللّٰهُ عَزِيْزًا حَكِيْمًا:} یہ صاف و صریح دلیل ہے کہ اﷲ تعالیٰ نے اپنی قدرت کاملہ سے عیسیٰ علیہ السلام کو آسمان پر زندہ اٹھا لیا۔ صحیح احادیث سے بھی یہ بات ثابت ہے۔ یہ احادیث بخاری و مسلم سمیت حدیث کی اکثر کتابوں میں موجود ہیں۔ [ دیکھیے بخاری، أحادیث الأنبیاء، باب نزول عیسی ابن مریم علیھما السلام : ۳۴۴۸۔ مسلم : ۱۵۵ ] ان احادیث میں آسمان پر اٹھائے جانے کے علاوہ قیامت کے قریب ان کے نزول اور دوسری بہت سی باتوں کا ذکر ہے۔ ابن کثیر رحمہ اللہ یہ تمام روایات ذکر کر کے آخر میں تحریر فرماتے ہیں کہ یہ احادیث رسول اﷲ صلی اللہ علیہ وسلم سے متواتر ہیں، ان کے راویوں میں ابوہریرہ، عبد اﷲ بن مسعود، عثمان بن ابی العاص، ابو امامہ، نواس بن سمعان، عبد اﷲ بن عمرو بن عاص، مجمع بن جاریہ، ابو سریحہ اور حذیفہ بن اسید رضی اللہ عنہم شامل ہیں۔ ان احادیث میں آپ کے نزول کی کیفیت اور جگہ کا بیان ہے۔ آپ دمشق میں منارۂ شرقیہ کے پاس اس وقت اتریں گے جب فجر کی نماز کے لیے اقامت ہو رہی ہو گی۔ آپ خنزیر کو قتل کریں گے، صلیب توڑ دیں گے، جزیہ ختم کر دیں گے، ان کے دور میں سب مسلمان ہو جائیں گے، دجال کا قتل بھی آپ کے ہاتھوں سے ہو گا اور یا جوج ماجوج کا ظہور و فساد بھی آپ کی موجودگی میں ہو گا، بالآخر آپ ہی کی بد دعا سے ان کی ہلاکت واقع ہو گی۔ مسیح علیہ السلام کا اپنے جسم کے ساتھ اٹھایا جانا، وہاں ان کا زندہ موجود ہونا، دوبارہ دنیا میں آ کر کئی سال رہنا اور دجال کو قتل کرنے کے بعد اپنی طبعی موت مرنا امت مسلمہ کا متفقہ عقیدہ ہے، جس کی بنیاد قرآنی تصریحات اور ان تفصیلات پر ہے جو احادیث میں بیان ہوئی ہیں۔ حافظ ابن حجر رحمہ اللہ فرماتے ہیں : [اِتَّفَقَ أَصْحَابُ الْأَخْبَارِ وَالتَّفْسِيْرِ عَلٰي أَنَّ عِيْسٰي رُفِعَ بِبَدَنِهٖ] [التلخیص الحبیر ] ’’ تمام اصحاب تفسیر اور ائمۂ حدیث اس پر متفق ہیں کہ عیسیٰ علیہ السلام اپنے بدن سمیت آسمان پر زندہ اٹھائے گئے۔‘‘ لہٰذا حیاتِ مسیح کے انکار سے قرآن وحدیث کا انکار لازم آتا ہے جو سراسر گمراہی ہے۔ {”عَزِيْزًا حَكِيْمًا“} کا لفظ بھی اس پر دلالت کرتا ہے کہ مسیح علیہ السلام کا آسمان پر اٹھایا جانا عام فوت ہونے والوں کی طرح نہیں تھا۔"
    },
    {
      "Ayah": 159,
      "tafsir": "(آیت 159) ➊ {وَ اِنْ مِّنْ اَهْلِ الْكِتٰبِ اِلَّا لَيُؤْمِنَنَّ بِهٖ قَبْلَ مَوْتِهٖ :} اس آیت کے دو مطلب ہیں اور دونوں درست ہیں، پہلا تو یہ ہے کہ یہود و نصاریٰ کا ہر شخص اپنے مرنے سے پہلے عیسیٰ علیہ السلام کی نبوت اور ان کے زندہ اٹھائے جانے پر ایمان لے آئے گا، مگر یہ اس وقت کی بات ہے جب موت سامنے آ جاتی ہے، جیسا کہ فرعون مرتے وقت ایمان لے آیا تھا، مگر اس وقت ایمان لانے کا کوئی فائدہ نہیں ہو گا۔ دوسرا مطلب یہ ہے کہ جب عیسیٰ علیہ السلام قیامت کے قریب عادل حاکم کی صورت میں اتریں گے اور دجال اور دوسرے تمام کفار سے جہاد کریں گے، تو ان کی موت سے پہلے پہلے تمام دنیا میں اسلام غالب ہو جائے گا۔ یہود و نصاریٰ یا تو مقابلے میں قتل ہو جائیں گے، یا اسلام لے آئیں گے۔ عیسیٰ علیہ السلام صلیب توڑ دیں گے، جزیہ ختم کر دیں گے، خنزیر کو قتل کریں گے، چنانچہ جب عیسیٰ علیہ السلام فوت ہوں گے تو ان کی وفات سے پہلے ہر موجود یہودی اور نصرانی ان کی نبوت اور ان کے آسمان پر زندہ اٹھائے جانے اور دوبارہ اترنے پر ایمان لا چکا ہو گا۔ چنانچہ بخاری اور مسلم میں مذکور اس حدیث کے آخر میں ہے کہ ابوہریرہ رضی اللہ عنہ یہ حدیث بیان کر کے فرماتے : ’’اگر چاہو تو یہ آیت پڑھو : « وَ اِنْ مِّنْ اَهْلِ الْكِتٰبِ اِلَّا لَيُؤْمِنَنَّ بِهٖ قَبْلَ مَوْتِهٖ » ’’اور اہل کتاب میں سے کوئی نہیں مگر اس کی موت سے پہلے ضرور اس پر ایمان لائے گا۔‘‘ ¤ ➋ {وَ يَوْمَ الْقِيٰمَةِ يَكُوْنُ عَلَيْهِمْ شَهِيْدًا:} اس جملے کی تفسیر کے لیے دیکھیے سورۂ مائدہ (۱۱۷)۔"
    },
    {
      "Ayah": 160,
      "tafsir": "(آیت 160 )➊ {فَبِظُلْمٍ مِّنَ الَّذِيْنَ هَادُوْا: ”فَبِظُلْمٍ“ } میں تنوین تعظیم کے لیے ہے اور جار مجرور پہلے آنے کی وجہ سے تخصیص پیدا ہو گئی، اس لیے ترجمہ ’’ان کے بڑے ظلم ہی کی وجہ سے‘‘ کیا گیا ہے۔ ¤ ➋ یہود کی سرکشی اور شرارتیں ذکر کرنے کے بعد اب ان پر سختی کا ذکر ہے۔ (کبیر) ¤ ➌ {حَرَّمْنَا عَلَيْهِمْ طَيِّبٰتٍ اُحِلَّتْ لَهُمْ ……:} پاکیزہ چیزوں کی یہ حرمت کچھ تو ان کی سرکشی کی بنا پر اﷲ تعالیٰ کی طرف سے تھی، کیونکہ وہ گناہ پر بہت دلیر تھے، تاکہ ان کی سرکشی کچھ ٹوٹے، یہ شرعی حرمت تھی، جیسا کہ سورۂ انعام (۱۴۶) میں ہے اور کچھ چیزیں انھوں نے اپنے احبار و رہبان کو حلال و حرام کا اختیار دے کر ان کے حرام قرار دینے کی وجہ سے حرام کر لیں، گویا یہ اﷲ کی تقدیر میں ان کے بڑے ظلم شرک ( احبار و رہبان کو رب بنانے) کی سزا کے طور پر حرام ہوئیں، جیسا کہ اب مسلمانوں میں سے بھی بعض نے اپنے اماموں کے کہنے پر کئی حلال چیزیں حرام اور کئی حرام چیزیں حلال قرار دے رکھی ہیں۔ ¤ ➍ شاہ ولی اﷲ رحمہ اللہ نے ایک اور نفیس مطلب بیان کیا ہے کہ یہاں {”طَيِّبٰتٍ“} سے مراد ان انعامات کا موقوف کر دینا ہے جو بادشاہی اور نبوت و نصرت کی شکل میں حاصل تھے، جیسا کہ اﷲ تعالیٰ نے فرمایا : «وَ ضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَ الْمَسْكَنَةُ » [البقرۃ : ۶۱ ] ’’اور ان پر ذلت اور محتاجی مسلط کر دی گئی۔‘‘(فتح الرحمان) حقیقت میں تینوں معنی مراد ہو سکتے ہیں۔"
    },
    {
      "Ayah": 161,
      "tafsir": "(آیت 161 )➊ {وَ اَخْذِهِمُ الرِّبٰوا وَ قَدْ نُهُوْا عَنْهُ :} اس وقت جو تورات موجود ہے اس میں بھی متعدد مقامات پر سود کو حرام قرار دیا گیا ہے۔ (دیکھیے کتاب خروج، باب ۲۲، فقرہ ۲۵ تا ۲۷) ۔ ¤ ➋ {وَ اَكْلِهِمْ اَمْوَالَ النَّاسِ بِالْبَاطِلِ:} یعنی رشوت، جوئے، دھوکے اور دوسرے ناجائز ذرائع سے لوگوں کے اموال کھانا۔ گناہوں کی دو قسمیں ہیں، مخلوق پر ظلم اور حق سے اعراض۔ اوپر کی آیت : «وَ بِصَدِّهِمْ عَنْ سَبِيْلِ اللّٰهِ» ( ان کے اﷲ کے راستے سے بہت زیادہ روکنے کی وجہ سے) سے مخلوق پر ظلم کی طرف اشارہ ہے، باقی کا تعلق {’’اعراض عن الحق‘‘} سے ہے۔ (کبیر)"
    },
    {
      "Ayah": 162,
      "tafsir": "(آیت 162) ➊ {لٰكِنِ الرّٰسِخُوْنَ فِي الْعِلْمِ ……:} علم میں پختہ وہ لوگ ہیں جو اﷲ کی طرف سے آنے والی وحی کے متلاشی ہوں اور اسی سے دلیل اور رہنمائی حاصل کریں، نہ لکیر کے فقیر ہوں نہ تقلید آباء کے اور {”الْمُؤْمِنُوْنَ“} سے مراد تورات پر صحیح ایمان رکھنے والے ہیں، یعنی یہ مومن اس پر ایمان لاتے ہیں جو آپ کی طرف نازل کیا گیا اور جو آپ سے پہلے نازل کیا گیا۔ یہ اہل کتاب کے مومنوں کو بشارت ہے جو موسیٰ علیہ السلام کے بعد رسول اﷲ صلی اللہ علیہ وسلم پر بھی ایمان لے آئے، مثلاً عبد اﷲ بن سلام رضی اللہ عنہ وغیرہ۔ ¤ ➋ {وَ الْمُقِيْمِيْنَ الصَّلٰوةَ:} اس سے پہلے اور بعد والی تمام صفات مرفوع ہیں اور یہ منصوب ہے، اسے ’’منصوب علی المدح‘‘ یا ’’علی الاختصاص‘‘ کہا جاتا ہے۔ گویا یہ {’’اَخُصُّ‘‘ } کا مفعول ہے، اس لیے ترجمہ کیا گیا ہے ’’اور جو خاص کر نماز ادا کرنے والے ہیں۔‘‘"
    },
    {
      "Ayah": 163,
      "tafsir": "(آیت 163) ➊ {اِنَّاۤ اَوْحَيْنَاۤ اِلَيْكَ …… :} یہ ان کے اس اعتراض اور مطالبے کا اصل جواب ہے کہ آپ تورات کی طرح آسمان سے اکٹھی کتاب نازل کروائیں، یعنی وحی اور دعوت الی الحق میں رسول اﷲ صلی اللہ علیہ وسلم کا معاملہ دوسرے انبیاء سے مختلف نہیں ہے، نوح علیہ السلام سے لے کر جتنے انبیاء و رسل ہوئے ہیں سب کو الگ الگ معجزات ملے اور تورات کے علاوہ کسی کو بھی یک بارگی کتاب نہیں دی گئی، پھر جب یک بارگی کتاب ان پر نازل نہ کرنے سے ان کی نبوت پر حرف نہیں آتا تو آپ صلی اللہ علیہ وسلم کی نبوت کے لیے باعث اعتراض کیوں ہے؟ نوح علیہ السلام سے پہلے بھی بہت سے انبیاء ہوئے ہیں مگر اولو العزم اور صاحب شریعت نبی سب سے پہلے نوح علیہ السلام تھے اور نوح علیہ السلام ہی وہ نبی ہیں جن کی قوم پر عذاب نازل ہوا اور رد شرک کا وعظ بھی نوح علیہ السلام سے شروع ہوا، اس لیے سب سے پہلے ان کا نام ذکر کیا ہے۔ ( قرطبی، کبیر) وحی کے اصل معنی تو ’’ کسی مخفی ذریعے سے کوئی بات سمجھا دینا‘‘ کے ہیں اور {’’ اِيْحَاءٌ ‘‘} (افعال) بمعنی الہام بھی آ جاتا ہے۔ مزید دیکھیے سورۂ شوریٰ (۵۱)۔ ¤ ➋ {وَ اٰتَيْنَا دَاوٗدَ زَبُوْرًا} : یعنی تم زبور کو تو اﷲ تعالیٰ کی کتاب تسلیم کرتے ہو، حالانکہ وہ بھی داؤد علیہ السلام پر تورات کی طرح تختیوں کی شکل میں نازل نہیں ہوئی تھی، پھر قرآن مجید کے اﷲ تعالیٰ کی طرف سے نازل شدہ ہونے سے کیوں انکار کرتے ہو؟ (کبیر) موجودہ زبور میں ایک سو پچاس سورتیں ہیں، جن میں دعائیں نصیحتیں اور تمثیلیں مذکور ہیں، حلت و حرمت کے احکام مذکور نہیں ہیں۔"
    },
    {
      "Ayah": 164,
      "tafsir": "(آیت 164) ➊ {وَ رُسُلًا قَدْ قَصَصْنٰهُمْ عَلَيْكَ مِنْ قَبْلُ :} جن رسولوں کے اسمائے گرامی اور واقعات قرآن کریم میں بیان کیے گئے ہیں ان کی تعداد چوبیس (۲۴) یا پچیس (۲۵) ہے۔ آدم، ادریس، نوح، ہود، صالح، ابراہیم، لوط، اسماعیل، اسحاق، یعقوب، یوسف، ایوب، شعیب، موسیٰ، ہارون، یونس، داؤد، سلیمان، الیاس، یسع، زکریا، یحییٰ، عیسیٰ، ذوالکفل (اکثر مفسرین کے نزدیک) اور محمد صلوات اﷲ و سلامہ علیہم اجمعین۔ ¤ ➋ {وَ رُسُلًا قَدْ قَصَصْنٰهُمْ عَلَيْكَ:} جن انبیاء و رسل کے نام قرآن میں ذکر نہیں ہوئے ان کی تعداد کتنی ہے، اﷲ تعالیٰ ہی بہتر جانتا ہے۔ ایک حدیث میں ہے، جو بہت مشہور ہے کہ ایک لاکھ چوبیس ہزار اور ایک حدیث میں آٹھ ہزار بتائی گئی ہے، مگر ان احادیث میں کلام ہے۔ ¤ ➌ {وَ كَلَّمَ اللّٰهُ مُوْسٰى تَكْلِيْمًا:} یعنی موسیٰ علیہ السلام کو اﷲ تعالیٰ نے اپنی ہم کلامی کا شرف بخشا، جو کسی اور کو حاصل نہیں ہوا۔ مزید دیکھیے سورۂ بقرہ (۲۵۳) پھر اگر موسیٰ علیہ السلام کے اس شرف سے دوسرے انبیاء پر طعن نہیں آ سکتا تو تورات کا یک بارگی نزول دوسرے انبیاء کے لیے موجب طعن کیسے ہو سکتا ہے۔ (رازی) ¤ ➍ اس آیت سے اﷲ تعالیٰ کا کلام کرنا بھی ثابت ہوا، جو لوگ یونانی فلسفے سے متاثر ہو کر اﷲ تعالیٰ کے کلام کا انکار کرتے ہیں وہ قیامت کے دن ان آیات و احادیث کا کیا جواب دیں گے جن میں صاف لفظوں میں اﷲ تعالیٰ کے کلام کا ذکر ہے۔ اﷲ کے ان بندوں نے اﷲ تعالیٰ کو انسان سے بھی عاجز یعنی گونگا بنا دیا اور اپنے خیال میں اسے اﷲ تعالیٰ کی خوبی سمجھ رہے ہیں۔ امام احمد ابن حنبل رحمہ اللہ ایسے ہی لوگوں سے مطالبہ کرتے تھے کہ قرآن یا حدیث میں کہیں دکھاؤ کہ قرآن اﷲ کا کلام نہیں بلکہ مخلوق ہے مگر نہ اس وقت ان کے مخالف یہ دکھا سکے نہ اب کوئی دکھا سکتا ہے۔"
    },
    {
      "Ayah": 165,
      "tafsir": "(آیت 165) {رُسُلًا مُّبَشِّرِيْنَ وَ مُنْذِرِيْنَ …… :} یعنی انبیاء کی بعثت کا مقصد تو صرف یہ ہے کہ جو لوگ ایمان لے آئیں اور اپنی اصلاح کر لیں انھیں جنت کی خوش خبری دیں اور جو کفر اور نادانی پرجمے رہیں انھیں ان کے غلط رویے کے انجامِ بد سے ڈرائیں، تاکہ اس طرح ان پر اتمامِ حجت ہو جائے اور وہ اﷲ کے ہاں کوئی عذر پیش نہ کر سکیں کہ ہمارے پاس تو تیری طرف سے کوئی خوش خبری دینے والا یا ڈرانے والا آیا ہی نہیں اور یہ مقصد کتاب وشریعت کے نازل کرنے سے حاصل ہو جاتا ہے (اﷲ تعالیٰ کی طرف سے حجت بس یہ دونوں چیزیں ہیں، اﷲ تعالیٰ نے کسی امام یا مجتہد کو دین میں حجت نہیں بنایا) عام اس سے کہ وہ کتاب یک بارگی دے دی جائے یا تدریجاً نازل ہو۔ بعثت کے اس اصلی مقصد پر اس سے کوئی اثر نہیں پڑتا بلکہ کتاب کے حسب ضرورت تدریجاً نازل کرنے سے تو یہ مقصد زیادہ کامل طریقے سے پورا ہوتا ہے، پھر ان کا یہ کہنا کہ موسیٰ علیہ السلام کی طرح یک بارگی کتاب لائیں گے تو مانیں گے ورنہ نہیں، یہ محض ضد اور عناد ہے۔ (کبیر)"
    },
    {
      "Ayah": 166,
      "tafsir": "(آیت 166){ لٰكِنِ اللّٰهُ يَشْهَدُ بِمَاۤ اَنْزَلَ اِلَيْكَ ……:} یعنی وحی ہر پیغمبر پر آتی رہی ہے، کچھ نیا کام نہیں، پر اس کلام (قرآن مجید) میں اﷲ تعالیٰ نے اپنا خاص علم اتارا اور اﷲ تعالیٰ اس حق کو ظاہر کر دے گا، چنانچہ ظاہر ہوا کہ جس قدر ہدایت اس نبی سے ہوئی اور کسی سے نہ ہوئی۔ (موضح) یہ آیت بھی یہود کے مذکورہ سوال کے جواب میں ہے کہ اگر یہود قرآن کے کتابِ الٰہی ہونے کا انکار کرتے ہیں تو اس سے قرآن کا سچا ہونا مجروح نہیں ہوتا، کیونکہ اﷲ تعالیٰ یہ گواہی دیتا ہے کہ اس نے قرآن اپنے علم اور حکمت بالغہ کے ساتھ نازل کیا ہے، جو اس کے انتہائی کامل ہونے کی دلیل ہے، کیونکہ اس کا علم ماضی، حال اور مستقبل سب کو محیط ہے۔ یہ مطلب بھی ہو سکتا ہے کہ اس نے یہ قرآن اپنے علم سے، یعنی خوب جانتے ہوئے اتارا ہے کہ دنیا بھر کے انسانوں سے بڑھ کر آپ ہی اس چیز کے اہل تھے کہ آپ پر یہ قرآن نازل کیا جاتا۔"
    },
    {
      "Ayah": 167,
      "tafsir": "(آیت 167){ اِنَّ الَّذِيْنَ كَفَرُوْا وَ صَدُّوْا عَنْ سَبِيْلِ اللّٰهِ …… :} ان لوگوں سے مراد یہودی ہیں جو نبی صلی اللہ علیہ وسلم پر خود بھی ایمان نہ لاتے اور لوگوں کو بھی یہ کہہ کر روکا کرتے تھے کہ اس شخص کی کوئی صفت ہماری کتاب میں مذکور نہیں، یا یہ کہ نبوت کا دائرہ تو ہارون اور داؤد علیہما السلام کی اولاد تک محدود ہے، یا یہ کہ موسیٰ علیہ السلام کی لائی ہوئی شریعت منسوخ نہیں ہو سکتی، ان کی اسی قسم کی کوششوں کو قرآن نے دور کی گمراہی قرار دیا ہے۔"
    },
    {
      "Ayah": 168,
      "tafsir": "(آیت 168) {اِنَّ الَّذِيْنَ كَفَرُوْا وَ ظَلَمُوْا …… :} ان کی گمراہی کی کیفیت بیان کرنے کے بعد اب ان کو وعید سنائی جا رہی ہے۔ (کبیر) یعنی گناہوں کا ارتکاب کرکے اپنی جانوں پر ظلم کیا، یا آخری نبی صلی اللہ علیہ وسلم کی صفات کو چھپا کر ان پر ظلم کیا، یا دوسرے لوگوں کو اسلام سے برگشتہ کر کے ان پر ظلم کیا۔ (قرطبی)"
    },
    {
      "Ayah": 169,
      "tafsir": "(آیت 169) {اِلَّا طَرِيْقَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَاۤ اَبَدًا ……:} یعنی جب کفر ہی کی حالت میں مر جائیں گے اور مرنے سے پہلے توبہ نہیں کریں گے تو سیدھے جہنم میں جائیں گے اور اس میں ہمیشہ رہیں گے اور ان کو جہنم میں لے جانا اور پھر ہمیشہ وہاں رکھنا اﷲ تعالیٰ پر کچھ مشکل نہیں ہے، لہٰذا اب بھی ان کے لیے موقع ہے کہ کفر و عناد سے باز آ جائیں اور آپ صلی اللہ علیہ وسلم کا اتباع اختیار کر لیں۔"
    },
    {
      "Ayah": 170,
      "tafsir": "(آیت 170) {يٰۤاَيُّهَا النَّاسُ قَدْ جَآءَكُمُ الرَّسُوْلُ بِالْحَقِّ ……:} متعدد طریقوں سے یہود کے اعتراضات و شبہات کی تردید اور قرآن کی حقانیت ثابت کرنے کے بعد اب سب لوگوں کو آپ صلی اللہ علیہ وسلم کی رسالت اور قرآن پر ایمان لانے کی دعوت دی جا رہی ہے، جن میں یہود بھی شامل ہیں کہ جب یہ رسول برحق ہے اور قرآن بھی اﷲ کی سچی کتاب ہے تو تمھیں لازم ہے کہ اس دعوت کو قبول کر لو، اس میں تمھارا بھلا ہے اور انجام کے لحاظ سے بھی بہتر ہے، ورنہ یاد رکھو کہ زمین و آسمان میں جتنی مخلوق ہے سب کا مالک اﷲ تعالیٰ ہے، اس کا تمھارے ایمان نہ لانے سے کچھ نہیں بگڑتا۔ دیکھیے سورۂ ابراہیم(۸)۔"
    },
    {
      "Ayah": 171,
      "tafsir": "(آیت 171) ➊ {يٰۤاَهْلَ الْكِتٰبِ لَا تَغْلُوْا فِيْ دِيْنِكُمْ ……:} رازی لکھتے ہیں، یہود کے شبہات کا جواب دینے کے بعد اب اس آیت میں نصاریٰ کے شبہ کی تردید کی جا رہی ہے۔ (کذا فی فتح الرحمن) مگر بعض علماء نے لکھا ہے کہ یہ خطاب یہود و نصاریٰ دونوں سے ہے، اس لیے کہ ’’ غلو‘‘ راہ اعتدال کے چھوڑ دینے کا نام ہے اور یہ افراط و تفریط (زیادتی اور کمی) دونوں صورتوں میں ہے۔ ایک طرف نصاریٰ نے مسیح علیہ السلام کے بارے میں افراط سے کام لے کر ان کو اﷲ کا بیٹا قرار دے رکھا تھا، تو دوسری طرف یہود نے مسیح علیہ السلام سے متعلق یہاں تک تفریط برتی کہ ان کی رسالت کا بھی انکار کر دیا، قرآن نے بتایا کہ یہ دونوں فریق غلو کر رہے ہیں۔ اعتدال کی راہ یہ ہے کہ عیسیٰ علیہ السلام نہ تو اﷲ کے بیٹے ہیں کہ ان کو معبود بنا لیا جائے اور نہ جھوٹے نبی ہیں، بلکہ وہ اﷲ کے بندے اور رسول ہیں۔ (قرطبی) آج کل اسی قسم کا غلو مسلمانوں میں بھی آ گیا ہے اور ایسے لوگ موجود ہیں جو نبی صلی اللہ علیہ وسلم اور اولیائے امت کا درجہ اس قدر بڑھا دیتے ہیں کہ انھیں خدا کی خدائی میں شریک قرار دیتے ہیں اور پھر رسول اﷲ صلی اللہ علیہ وسلم کو بشر سمجھنا انتہائی درجے کی گستاخی شمار کرتے ہیں، حالانکہ آپ صلی اللہ علیہ وسلم نے اس غلو سے سختی سے منع فرمایا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ تُطْرُوْنِيْ كَمَا أَطْرَتِ النَّصَارٰي ابْنَ مَرْيَمَ، فَإِنَّمَا أَنَا عَبْدُهُ فَقُوْلُوْا عَبْدُ اللّٰهِ وَرَسُوْلُهُ ] [بخاری، أحادیث الأنبیاء، باب قول اﷲ تعالٰی: «واذكر في الكتاب مريم ……» : ۳۴۴۵ ] ’’مجھے اس طرح حد سے نہ بڑھاؤ جس طرح نصاریٰ نے عیسیٰ ابن مریم کو بڑھایا۔ میں تو اس کا بندہ ہوں، لہٰذا تم مجھے صرف اﷲ تعالیٰ کا بندہ اور اس کا رسول ہی کہا کرو۔‘‘ ¤ ➋ {وَ كَلِمَتُهٗ اَلْقٰىهَاۤ اِلٰى مَرْيَمَ:} یعنی انھیں کلمۂ { ”كُنْ“ } سے بنایا اور اس طرح ان کی پیدائش بن باپ کے ہوئی، یہ معنی نہیں کہ وہ کلمہ ہی عیسیٰ علیہ السلام بن گیا، ورنہ آدم علیہ السلام تو ماں باپ دونوں کے بغیر کلمۂ { ”كُنْ“ } سے پیدا ہوئے تھے۔ پھر انھیں بھی رب ماننا پڑے گا، دیکھیے سورۂ آل عمران(۵۹)۔ ¤ ➌ {وَ رُوْحٌ مِّنْهُ:} یعنی اس کی پیدا کردہ روح، اس اضافت سے عیسیٰ علیہ السلام کی عظمت کا اظہار مقصود ہے، ورنہ تمام روحیں اﷲ تعالیٰ ہی کی پیدا کردہ ہیں، فرمایا : « {هَلْ مِنْ خَالِقٍ غَيْرُ اللّٰهِ} » [ فاطر : ۳ ] ’’کیا اﷲ کے سوا بھی کوئی پیدا کرنے والا ہے؟‘‘ جیسے فرمایا : { ”ھٰذِہٖ نَاقَةُ اللّٰهِ“ } ’’یہ اﷲ کی اونٹنی ہے‘‘ اور { ”طَھِّرْ بَيْتِيَ“ } ’’ میرے گھر کو پاک کر‘‘ حالانکہ تمام اونٹنیوں اور تمام گھروں کا مالک اﷲ ہے۔ یہ {’’ مِنْ ‘‘} تبعیضیہ نہیں ہے بلکہ ابتدائے غایت کے لیے ہے۔ (ابن کثیر) ¤ ➍ {فَاٰمِنُوْا بِاللّٰهِ وَ رُسُلِهٖ:} یعنی عیسیٰ علیہ السلام بھی اﷲ کے رسول ہیں، پس تم دوسرے پیغمبروں کی طرح ان کو اﷲ کا رسول ہی مانو اور انھیں الوہیت (خدائی) کا مقام مت دو۔ (کبیر) ¤ ➎ {وَ لَا تَقُوْلُوْا ثَلٰثَةٌ: ”ثَلٰثَةٌ“} مبتدا محذوف کی خبر ہے، یعنی {’’ اٰلِهَتُنَا ثَلاَثَةٌ ‘‘} یا {’’اَلْاَقَانِيْمُ ثَلاَثَةٌ ‘‘} کہ ہمارے معبود تین ہیں، یا اقانیم تین ہیں۔ مبتدا اس لیے حذف کیا ہے کہ نصرانیوں کے اقوال بہت ہی مختلف ہیں، اگرچہ خلاصہ ان کا ایک ہے کہ خدا تین ہیں مگر وہ تین نہیں ایک ہیں۔ اب ایک ذات اور اس کی بے شمار صفات تو ہو سکتی ہیں، مگر اﷲ تعالیٰ، مریم اور عیسیٰ علیہما السلام یہ تو تین مستقل شخصیتیں اور ذاتیں ہیں، یہ ایک ذات کیسے ہو گئے ! نصرانی بیک وقت خدا کو ایک بھی تسلیم کرتے ہیں اور پھر اقانیم ثلاثہ کے بھی قائل ہیں۔ یہ اقانیم ثلاثہ کا چکر بھی نہایت پر پیچ اور ناقابل فہم ہے۔ (کبیر) جس طرح بعض مسلمانوں میں [ نُوْرٌ مِّنْ نُوْرِ اللّٰهِ] کا عقیدہ نہایت گمراہ کن ہے، جو واضح طور پر سورۂ اخلاص اور پورے قرآن کے خلاف ہے۔ نصرانی کبھی تو ان تین سے مراد وجود، علم اور حیات بتاتے ہیں اور کبھی انھیں باپ، بیٹا اور روح القدس سے تعبیر کر لیتے ہیں، حالانکہ وجود، علم اور حیات تو ایک ذات کی صفات ہوتی ہیں مگر باپ، بیٹا اور روح القدس تو تین شخصیتیں ہیں، یہ ایک کیسے بن گئے ؟ پھر ان کی کور فہمی دیکھو کہ کبھی کہتے ہیں کہ باپ سے وجود، روح سے حیات اور بیٹے سے مراد مسیح علیہ السلام ہیں اور یہ بھی کہتے ہیں کہ اقانیم ثلاثہ سے مراد اﷲ تعالیٰ، مریم اور عیسیٰ علیہما السلام ہیں۔ قرآن نے بھی اس آخری قول کا ذکر کیا ہے۔ دیکھیے سورۂ مائدہ (۷۳، ۷۵، ۷۶، ۱۱۶) الغرض نصرانیوں کے عقیدۂ تثلیث سے زیادہ بعید از عقل کوئی عقیدہ نہیں اور اس بارے میں ان میں اس قدر انتشار و افتراق ہے کہ دنیا کے کسی عقیدہ میں نہیں، اس لیے قرآن نے انھیں دعوت دی کہ تم تین خداؤں کے گورکھ دھندے کو چھوڑ کر خالص توحید کا عقیدہ اختیار کر لو۔ ¤ ➏ {اِنَّمَا اللّٰهُ اِلٰهٌ وَّاحِدٌ :} یعنی نہ کوئی اس کا شریک ہے، نہ بیوی اور نہ کوئی رشتے دار، نہ اس نے کسی کو جنا اور نہ کسی نے اس کو جنا۔ ¤ ➐ {لَهٗ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ:} اور جسے تم نے اس کا شریک ٹھہرایا ہے وہ بھی دوسرے انسانوں کی طرح اس کا مملوک اور مخلوق ہے اور جو شخص مملوک یا مخلوق ہو وہ خالق یا مالک کا بیٹا یا شریک کیسے ہو سکتا ہے ؟ ¤ ➑ {وَ كَفٰى بِاللّٰهِ وَكِيْلًا :} یعنی اس کو بیٹے کی کیا ضرورت ہے، وکیل یعنی سارے کام بنانے والا تو وہ خود ہی ہے۔ (موضح)"
    },
    {
      "Ayah": 172,
      "tafsir": "( آیت 172) {لَنْ يَّسْتَنْكِفَ الْمَسِيْحُ ……:} اس آیت میں نصاریٰ اور مشرکین دونوں کے غلط عقیدے کی تردید ہے، کیونکہ نصرانی مسیح علیہ السلام کو اﷲ کا بیٹا اور مشرکین فرشتوں کو اﷲ کی بیٹیاں کہتے تھے۔ اﷲ تعالیٰ فرما رہے ہیں کہ یہ دونوں اﷲ کی بندگی کا اقرار کرتے ہیں اور اس کا بندہ ہونے پر کچھ بھی عار اور شرم محسوس نہیں کرتے۔ یہی حال ہمارے نبی صلی اللہ علیہ وسلم کا تھا کہ جب کوئی شخص آپ کو اﷲ کا بندہ کہتا تو آپ کو بے انتہا خوشی ہوتی۔ کیونکہ اس مالک الملک اور شہنشاہِ مطلق کا بندہ ہونا انتہائی عزت و شرف کا مقام ہے، نہ کہ کسی ذلت و رسوائی کا۔ ابن قیم رحمہ اللہ نے اپنی کتاب ’’انوار القلوب‘‘ میں لکھا ہے کہ آدمی کے لیے بندگی کے مقام سے زیادہ عزت کا کوئی مقام نہیں، اکرم الخلق محمد صلی اللہ علیہ وسلم کو تین مقامات پر، جو نہایت عزت کے مقامات ہیں، لفظ ’’عبد‘‘ یعنی بندہ کہہ کر ذکر کیا گیا ہے، وہ تین مقام یہ ہیں : (1) نزول وحی۔ دیکھیے کہف : ۱۔ فرقان : ۱۔ نجم : ۱۰۔ حدید : ۹۔ (2) اسراء و معراج۔ دیکھیے بنی اسرائیل : ۱ (3) دعا۔ (دیکھیے جن : ۱۹)"
    },
    {
      "Ayah": 173,
      "tafsir": ""
    },
    {
      "Ayah": 174,
      "tafsir": "(آیت 174) {يٰۤاَيُّهَا النَّاسُ قَدْ جَآءَكُمْ بُرْهَانٌ ……:} جب اﷲ تعالیٰ نے تمام گمراہ فرقوں کفار، منافقین، یہود و نصاریٰ پر دلائل قائم کر دیے اور ان کے شکوک و شبہات کی بھی مکمل تردید فرما دی تو اب اس آیت میں رسول اﷲ صلی اللہ علیہ وسلم کی رسالت پر ایمان لانے کی عام دعوت دی کہ تمھارے پاس رسول اﷲ صلی اللہ علیہ وسلم کے نبی برحق ہونے کی واضح دلیل آ چکی اور ہم نے حق کو واضح کرنے والا نور، یعنی قرآن مجید نازل فرما دیا جو انسان کو ضلالت کے اندھیروں سے نکال کر ہدایت کی روشنی کی طرف لاتا ہے اور دل میں نور ایمان پیدا کرنے کا سبب بنتا ہے۔"
    },
    {
      "Ayah": 175,
      "tafsir": "(آیت 176،175 )➊ {يَسْتَفْتُوْنَكَ:} سورت کی ابتدا تقویٰ کے حکم کے بعد اموال کے احکام سے ہوئی تھی، اب آخر میں انھی احکام کے ساتھ سورت کا اختتام ہے۔ درمیان سورت میں مخالفین سے مجادلہ اور ان کی تردید ہے۔ (رازی) کلالہ پر بحث اس سورت کی آیت (۱۱) میں گزر چکی ہے۔ جابربن عبد اﷲ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اﷲ صلی اللہ علیہ وسلم میرے پاس تشریف لائے تو میں اس وقت بیمار اور بے ہوش تھا، آپ نے وضو کیا، پھر وضو کے بچے ہوئے پانی سے مجھ پر چھینٹے مارے، یا فرمایا : ’’اس پر چھینٹے مارو۔‘‘ جس سے مجھے ہوش آ گیا، میں نے عرض کی کہ میں کلالہ ہوں، میری میراث کیسے تقسیم ہو گی، تو اس پر یہ آیت نازل ہوئی۔ [ بخاری، المرض، باب وضوء العائد للمریض : ۵۶۷۶۔ مسلم : ۱۶۱۶ ] ¤ ➋ {لَيْسَ لَهٗ وَلَدٌ وَّ لَهٗۤ اُخْتٌ …… :} بعض نے اس سے استدلال کیا ہے کہ جس کی اولاد نہ ہو، خواہ اس کا باپ زندہ ہی ہو، اسے کلالہ کہا جائے گا، مگر یہ صحیح نہیں، صحیح معنی وہی ہے جو پہلے گزرا، یعنی کلالہ اس مرنے والے کو کہا جاتا ہے جس کا باپ یا دادا نہ ہو اور اولاد بھی نہ ہو، کیونکہ باپ کی موجودگی میں بہن سرے سے وارث نہیں ہوتی، باپ اس کے حق میں حاجب بن جاتا ہے لیکن یہاں اﷲ تعالیٰ فرما رہا ہے کہ اگر اس کی بہن ہو تو وہ اس کے نصف مال کی وارث ہو گی، جس سے صاف معلوم ہوتا ہے کہ کلالہ وہ ہے کہ اولاد نہ ہونے کے ساتھ ساتھ باپ دادا بھی نہ ہوں۔ یوں اولاد کی نفی تو الفاظ سے واضح ثابت ہو گئی اور باپ کی نفی اشارے سے۔ ¤ ➌ اولاد سے مراد بیٹا، بیٹی اور بیٹے کی اولاد ہے، اسی طرح بہن سے مراد یہاں سگی بہن یا علاتی ( باپ شریک) بہن ہے، کیونکہ اخیافی بہن، جو صرف ماں کی طرف سے ہو، اس کا حکم پہلے سورۂ نساء (۱۲) میں گزر چکا ہے۔ (ابن کثیر) ¤ ➍ {”وَلَدٌ“} کا لفظ بیٹا بیٹی دونوں پر بولا جاتا ہے، اس بنا پر بعض نے کہا کہ بیٹی ہونے کی صورت میں بہن محروم رہے گی، مگر صحیح بخاری (۶۷۴۱) میں معاذ رضی اللہ عنہ کا فیصلہ ہے کہ اگر ایک شخص فوت ہو جائے اور اس کے ورثاء میں صرف بیٹی اور بہن ہے تو بیٹی کو نصف اور باقی بہن کو (بوجہ عصبہ ہونے کے ) دیا جائے گا۔ اور بخاری ہی میں ابن مسعود رضی اللہ عنہ نے رسول اﷲ صلی اللہ علیہ وسلم سے نقل کیا ہے کہ آپ صلی اللہ علیہ وسلم نے مرنے والے کی ایک بہن، ایک بیٹی اور ایک پوتی کے بارے میں فیصلہ فرمایا کہ بیٹی کے لیے نصف ہے، پوتی کے لیے چھٹا حصہ، تاکہ دو ثلث پورے ہو جائیں اور جو باقی بچے گا وہ بہن کے لیے ہے۔ [ بخاری، الفرائض، باب میراث ابنۃ ابن مع ابنۃ : ۶۷۳۶ ] ¤ ➎ {فَاِنْ كَانَتَا اثْنَتَيْنِ فَلَهُمَا ……:} اور یہی حکم دو سے زیادہ بہنوں کا ہے، انھیں بھی دو ثلث ہی ملے گا اور اگر کلالہ کے وارث بھائی اور بہن دونوں ہوں تو ایک مرد کو دو عورتوں کے برابر حصہ ملے گا۔ ¤ ➏ {يُبَيِّنُ اللّٰهُ لَكُمْ اَنْ تَضِلُّوْا …… :} یعنی اﷲ تعالیٰ نے میراث کے یہ حصے خود اس لیے واضح فرمائے ہیں کہ اگر یہ تم پر چھوڑ دیے جائیں تو تم کبھی صحیح فیصلہ نہ کر سکو، کیونکہ تمھیں ہر بات کا علم نہیں، جب کہ اﷲ تعالیٰ کو ہر بات کا خوب علم ہے، اس لیے اس کے فیصلے میں کبھی غلطی نہیں ہو سکتی۔ ¤ اس سورت کے مدنی ہونے میں کوئی اختلاف نہیں، ام المومنین عائشہ رضی اللہ عنہا نے فرمایا : ’’ یہ سورت سب سے آخر میں نازل ہوئی، لہٰذا اس کے حلال کو حلال اور حرام کو حرام سمجھو۔‘‘ [ أحمد : 188/6، ح : ۲۵۶۰۲۔ ترمذی : ۳۰۶۳، عن عبد اﷲ بن عمرو رضی اللہ عنہما و حسنہ الہلالی فی الاستیعاب ] سورۂ بقرہ کے شروع میں اس کی کچھ فضیلت بیان ہو چکی ہے۔"
    },
    {
      "Ayah": 176,
      "tafsir": "(آیت 176،175 )➊ {يَسْتَفْتُوْنَكَ:} سورت کی ابتدا تقویٰ کے حکم کے بعد اموال کے احکام سے ہوئی تھی، اب آخر میں انھی احکام کے ساتھ سورت کا اختتام ہے۔ درمیان سورت میں مخالفین سے مجادلہ اور ان کی تردید ہے۔ (رازی) کلالہ پر بحث اس سورت کی آیت (۱۱) میں گزر چکی ہے۔ جابربن عبد اﷲ رضی اللہ عنہما بیان کرتے ہیں کہ رسول اﷲ صلی اللہ علیہ وسلم میرے پاس تشریف لائے تو میں اس وقت بیمار اور بے ہوش تھا، آپ نے وضو کیا، پھر وضو کے بچے ہوئے پانی سے مجھ پر چھینٹے مارے، یا فرمایا : ’’اس پر چھینٹے مارو۔‘‘ جس سے مجھے ہوش آ گیا، میں نے عرض کی کہ میں کلالہ ہوں، میری میراث کیسے تقسیم ہو گی، تو اس پر یہ آیت نازل ہوئی۔ [ بخاری، المرض، باب وضوء العائد للمریض : ۵۶۷۶۔ مسلم : ۱۶۱۶ ] ¤ ➋ {لَيْسَ لَهٗ وَلَدٌ وَّ لَهٗۤ اُخْتٌ …… :} بعض نے اس سے استدلال کیا ہے کہ جس کی اولاد نہ ہو، خواہ اس کا باپ زندہ ہی ہو، اسے کلالہ کہا جائے گا، مگر یہ صحیح نہیں، صحیح معنی وہی ہے جو پہلے گزرا، یعنی کلالہ اس مرنے والے کو کہا جاتا ہے جس کا باپ یا دادا نہ ہو اور اولاد بھی نہ ہو، کیونکہ باپ کی موجودگی میں بہن سرے سے وارث نہیں ہوتی، باپ اس کے حق میں حاجب بن جاتا ہے لیکن یہاں اﷲ تعالیٰ فرما رہا ہے کہ اگر اس کی بہن ہو تو وہ اس کے نصف مال کی وارث ہو گی، جس سے صاف معلوم ہوتا ہے کہ کلالہ وہ ہے کہ اولاد نہ ہونے کے ساتھ ساتھ باپ دادا بھی نہ ہوں۔ یوں اولاد کی نفی تو الفاظ سے واضح ثابت ہو گئی اور باپ کی نفی اشارے سے۔ ¤ ➌ اولاد سے مراد بیٹا، بیٹی اور بیٹے کی اولاد ہے، اسی طرح بہن سے مراد یہاں سگی بہن یا علاتی ( باپ شریک) بہن ہے، کیونکہ اخیافی بہن، جو صرف ماں کی طرف سے ہو، اس کا حکم پہلے سورۂ نساء (۱۲) میں گزر چکا ہے۔ (ابن کثیر) ¤ ➍ {”وَلَدٌ“} کا لفظ بیٹا بیٹی دونوں پر بولا جاتا ہے، اس بنا پر بعض نے کہا کہ بیٹی ہونے کی صورت میں بہن محروم رہے گی، مگر صحیح بخاری (۶۷۴۱) میں معاذ رضی اللہ عنہ کا فیصلہ ہے کہ اگر ایک شخص فوت ہو جائے اور اس کے ورثاء میں صرف بیٹی اور بہن ہے تو بیٹی کو نصف اور باقی بہن کو (بوجہ عصبہ ہونے کے ) دیا جائے گا۔ اور بخاری ہی میں ابن مسعود رضی اللہ عنہ نے رسول اﷲ صلی اللہ علیہ وسلم سے نقل کیا ہے کہ آپ صلی اللہ علیہ وسلم نے مرنے والے کی ایک بہن، ایک بیٹی اور ایک پوتی کے بارے میں فیصلہ فرمایا کہ بیٹی کے لیے نصف ہے، پوتی کے لیے چھٹا حصہ، تاکہ دو ثلث پورے ہو جائیں اور جو باقی بچے گا وہ بہن کے لیے ہے۔ [ بخاری، الفرائض، باب میراث ابنۃ ابن مع ابنۃ : ۶۷۳۶ ] ¤ ➎ {فَاِنْ كَانَتَا اثْنَتَيْنِ فَلَهُمَا ……:} اور یہی حکم دو سے زیادہ بہنوں کا ہے، انھیں بھی دو ثلث ہی ملے گا اور اگر کلالہ کے وارث بھائی اور بہن دونوں ہوں تو ایک مرد کو دو عورتوں کے برابر حصہ ملے گا۔ ¤ ➏ {يُبَيِّنُ اللّٰهُ لَكُمْ اَنْ تَضِلُّوْا …… :} یعنی اﷲ تعالیٰ نے میراث کے یہ حصے خود اس لیے واضح فرمائے ہیں کہ اگر یہ تم پر چھوڑ دیے جائیں تو تم کبھی صحیح فیصلہ نہ کر سکو، کیونکہ تمھیں ہر بات کا علم نہیں، جب کہ اﷲ تعالیٰ کو ہر بات کا خوب علم ہے، اس لیے اس کے فیصلے میں کبھی غلطی نہیں ہو سکتی۔ ¤ اس سورت کے مدنی ہونے میں کوئی اختلاف نہیں، ام المومنین عائشہ رضی اللہ عنہا نے فرمایا : ’’ یہ سورت سب سے آخر میں نازل ہوئی، لہٰذا اس کے حلال کو حلال اور حرام کو حرام سمجھو۔‘‘ [ أحمد : 188/6، ح : ۲۵۶۰۲۔ ترمذی : ۳۰۶۳، عن عبد اﷲ بن عمرو رضی اللہ عنہما و حسنہ الہلالی فی الاستیعاب ] سورۂ بقرہ کے شروع میں اس کی کچھ فضیلت بیان ہو چکی ہے۔"
    }
  ]
}