{
  "surah": "Muhammad",
  "surah_number": 47,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "اس سورت کا نام سورۂ محمد( صلی اللہ علیہ وسلم ) ہے، کیونکہ اس میں آپ کا اسم گرامی آیا ہے۔ اس کے علاوہ اس کا نام سورۂ قتال بھی ہے، کیونکہ اس میں لفظ قتال دو مرتبہ آیا ہے اور اس کا مرکزی مضمون کفار کے ساتھ قتال ہے۔ ¤ (آیت 1) ➊ {اَلَّذِيْنَ كَفَرُوْا وَ صَدُّوْا عَنْ سَبِيْلِ اللّٰهِ … :} چونکہ اس سورت کا اکثر حصہ مشرکین کے خلاف جنگ کے لیے ابھارنے پر مشتمل ہے اس لیے اللہ تعالیٰ نے سورت کا آغاز کفار پر اپنے غضب اور ایمان والوں پر اپنی رحمت کے اظہار کے ساتھ کیا ہے، تاکہ ان کے کفر اور اللہ کی راہ سے روکنے کے جرم کی بنا پر مسلمانوں کو ان سے لڑنے کی ترغیب دی جا سکے۔ چنانچہ اس تمہید کے بعد فرمایا : « فَاِذَا لَقِيْتُمُ الَّذِيْنَ كَفَرُوْا فَضَرْبَ الرِّقَابِ» [ محمد : ۴ ] ’’تو جب تم ان لوگوں سے ملو جنھوں نے کفر کیا تو خوب گردنیں مارنا ہے۔‘‘ ¤ ➋ {صَدُّوْا عَنْ سَبِيْلِ اللّٰهِ اَضَللَّ اَعْمَالَهُمْ: ’’ صَدُّوْا ‘‘ ’’صَدَّ يَصُدُّ ‘‘} (ن) لازم بھی آتا ہے ’’اعراض کرنا‘‘ اس کا مصدر{’’ صُدُوْدًا‘‘} ہے اور متعدی بھی ’’روکنا‘‘ اس کا مصدر {’’صَدًّا ‘‘} ہے، ، یہاں دوسرا معنی مراد ہے، کیونکہ خود اعراض کرنے کی بات تو {’’ الَّذِيْنَ كَفَرُوْا ‘‘} میں آ گئی، بلکہ کفر اعراض سے زیادہ سخت ہے۔ اس لیے مطلب یہ ہے کہ جن لوگوں نے ایمان لانے سے انکار کر دیا اور دوسرے لوگوں کو بھی اللہ کے راستے یعنی اسلام قبول کرنے سے روکا تو اللہ تعالیٰ نے ان کے اعمال ضائع اور برباد کر دیے۔ یعنی کافر رہتے ہوئے ان لوگوں نے جو بظاہر اچھے کام کیے تھے، جیسے صدقہ و خیرات، مہمان نوازی، صلہ رحمی، خانہ کعبہ کی مرمت اور اس کا حج، مظلوم کی مدد وغیرہ، ان پر اللہ تعالیٰ کے ہاں ان کو کوئی اجر نہیں ملے گا، کیونکہ ایمان کے بغیر کسی عمل کی کوئی قیمت نہیں۔ مزید دیکھیے سورۂ فرقان (۲۳) کی تفسیر۔ کافروں کے اعمال برباد کرنے کا ایک مطلب یہ بھی ہے کہ اللہ تعالیٰ نے ان کے وہ تمام اعمال یعنی سازشیں اور منصوبے ناکام کر دیے جو وہ اسلام کو نیچا دکھانے کے لیے کام میں لاتے تھے۔ ¤ ➌ { صَدُّوْا عَنْ سَبِيْلِ اللّٰهِ اَضَلَّ اَعْمَالَهُمْ:} اللہ تعالیٰ کے راستے سے روکنے کی کئی صورتیں ہیں، جن میں سے ایک یہ ہے کہ آدمی کسی کو زبردستی ایمان لانے سے روک دے۔ دوسری یہ کہ وہ ایمان لانے والوں پر ایسا ظلم و ستم ڈھائے کہ ان کے لیے ایمان پر قائم رہنا مشکل ہو جائے اور ان کی حالت زار دیکھ کر ایمان لانے کا ارادہ رکھنے والے ایمان لانے کی جرأت نہ کریں۔ اللہ تعالیٰ نے اس کے لیے لفظ ’’فتنہ‘‘ استعمال فرمایا ہے۔ تیسری یہ کہ وہ مختلف طریقوں سے اسلام کے خلاف لوگوں کو ورغلائے اور ان کے دلوں میں ایسے وسوسے ڈالے کہ وہ دین اسلام سے بدظن ہو جائیں۔ چوتھی یہ کہ ہر کافر اپنے بچوں اور زیر کفالت لوگوں کی تربیت کفر پر کرتا ہے جس سے ان کے لیے دینِ حق قبول کرنا مشکل ہوتا ہے، اس طرح وہ اللہ کے راستے سے روکنے کا مجرم بنتا ہے۔ اللہ کے راستے سے روکنے کی ان تمام صورتوں کو ختم کرنے کے لیے کفار سے لڑنے کا حکم دیا۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ {وَ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ … : ’’ اٰمَنُوْا ‘‘} میں اگرچہ عمل صالح بھی شامل ہے، کیونکہ عمل بھی ایمان کا جزو ہے، مگر اس کی اہمیت کا احساس دلانے کے لیے اسے علیحدہ بھی ذکر فرمایا۔ دیکھیے سورۂ عصر کی تفسیر۔ اسی طرح {’’اٰمَنُوْا‘‘} میں اگرچہ دوسری ایمانیات کے ساتھ محمد صلی اللہ علیہ وسلم اور آپ پر نازل شدہ وحی پر ایمان بھی شامل ہے مگر اس کا شرف نمایاں کرنے کے لیے اس کا الگ بھی ذکر فرمایا۔ خصوصاً اس لیے کہ مدینہ میں کچھ ایسے یہود موجود تھے جو ایمان بالغیب کی تمام جزئیات پر ایمان رکھتے تھے اور نیک اعمال بھی بجا لاتے تھے مگر نبی کریم صلی اللہ علیہ وسلم کو نبی ماننے کے باوجود یہ کہہ کر ایمان لانے سے انکار کر دیتے تھے کہ آپ اُمیوں کے نبی ہیں۔ اب بھی کئی لوگ کہتے ہیں کہ کوئی یہودی رہے یا نصرانی یا مسلمان، اگر اللہ پر ایمان رکھتے ہیں اور اچھے عمل کرتے ہیں تو سب ٹھیک ہیں۔ اللہ تعالیٰ نے فرمایا، اب ایمان وہی معتبر ہو گا جس میں ہمارے نبی محمد صلی اللہ علیہ وسلم پر ایمان اور آپ کی اطاعت کا عہد شامل ہو۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَالَّذِيْ نَفْسُ مُحَمَّدٍ بِيَدِهِ! لَا يَسْمَعُ بِيْ أَحَدٌ مِنْ هٰذِهِ الْأُمَّةِ يَهُوْدِيٌّ وَلَا نَصْرَانِيٌّ ثُمَّ  يَمُوْتُ وَلَمْ يُؤْمِنْ بِالَّذِيْ أُرْسِلْتُ بِهِ إِلَّا كَانَ مِنْ أَصْحَابِ النَّارِ ] [ مسلم، الإیمان، باب وجوب الإیمان برسالۃ نبینا محمد صلی اللہ علیہ وسلم : ۱۵۳ ] ’’قسم اس ذات کی جس کے ہاتھ میں محمد ( صلی اللہ علیہ وسلم ) کی جان ہے! اس امت میں سے کوئی بھی شخص، یہودی ہو یا نصرانی، جو میرے بارے میں سنے، پھر اس حال میں فوت ہو کہ مجھے جو کچھ دے کر بھیجا گیا ہے اس پر ایمان نہ لایا ہو تو وہ آگ والوں میں سے ہو گا۔‘‘ مزید دیکھیے سورۂ سبا (۲۸)۔ ¤ ➋ {وَ هُوَ الْحَقُّ مِنْ رَّبِّهِمْ: ’’ الْحَقُّ ‘‘} جو واقع میں ثابت ہو اور کسی چیز کے اصل کے عین مطابق ہو۔ {’’ الْحَقُّ ‘‘} خبر پر الف لام لانے سے حصر پیدا ہو گیا۔ {’’ وَ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ وَ اٰمَنُوْا بِمَا نُزِّلَ عَلٰى مُحَمَّدٍ ‘‘} مبتدا ہے اور {’’ كَفَّرَ عَنْهُمْ سَيِّاٰتِهِمْ وَ اَصْلَحَ بَالَهُمْ ‘‘} اس کی خبر ہے اور {’’ وَ هُوَ الْحَقُّ مِنْ رَّبِّهِمْ ‘‘} درمیان میں جملہ معترضہ ہے جو محمد صلی اللہ علیہ وسلم پر نازل شدہ وحی پر ایمان کی مزید تاکید کے لیے لایا گیا ہے۔ یعنی محمد صلی اللہ علیہ وسلم پر نازل کردہ وحی ہی کامل حق ہے جو رب تعالیٰ کی طرف سے آیا ہے۔ ¤ ➌ { كَفَّرَ عَنْهُمْ سَيِّاٰتِهِمْ:} ایمان اور عمل صالح کی بدولت اللہ تعالیٰ پہلے تمام گناہ معاف فرما دیتا ہے۔ عمرو بن عاص رضی اللہ عنہ بیان کرتے ہیں : [ فَلَمَّا جَعَلَ اللّٰهُ الْإِسْلَامَ فِيْ قَلْبِيْ أَتَيْتُ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ ابْسُطْ يَمِيْنَكَ فَلِأُبَايِعْكَ فَبَسَطَ يَمِيْنَهُ قَالَ فَقَبَضْتُ يَدِيْ، قَالَ مَا لَكَ يَا عَمْرُو!؟ قَالَ قُلْتُ أَرَدْتُ أَنْ أَشْتَرِطَ قَالَ تَشْتَرِطُ بِمَاذَا؟ قُلْتُ أَنْ يُغْفَرَ لِيْ قَالَ أَمَا عَلِمْتَ أَنَّ الْإِسْلَامَ يَهْدِمُ مَا كَانَ قَبْلَهُ ؟ وَ أَنَّ الْهِجْرَةَ تَهْدِدِمُ مَا كَانَ قَبْلَهَا ؟ وَ أَنَّ الْحَجَّ يَهْدِمُ مَا كَانَ قَبْلَهُ؟ ] [ مسلم، الإیمان، باب کون الإسلام یہدم ما قبلہ… : ۱۲۱ ] ’’جب اللہ تعالیٰ نے میرے دل میں اسلام کا خیال ڈالا تو میں نبی صلی اللہ علیہ وسلم کے پاس آیا اور میں نے کہا : ’’اپنا دایاں ہاتھ آگے بڑھائیں تاکہ میں آپ سے بیعت کروں۔‘‘ آپ صلی اللہ علیہ وسلم نے اپنا دایاں ہاتھ آگے بڑھایا تو میں نے اپنا ہاتھ کھینچ لیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’عمرو! تمھیں کیا ہوا؟‘‘ میں نے کہا : ’’میں شرط کرنا چاہتا ہوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’کس بات کی شرط کرتے ہو؟‘‘ میں نے کہا : ’’یہ کہ مجھے بخش دیا جائے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’کیا تمھیں معلوم نہیں کہ اسلام اسے مٹا دیتا ہے جو اس سے پہلے ہو اور ہجرت اسے مٹا دیتی ہے جو اس سے پہلے ہو اور حج اسے مٹا دیتا ہے جو اس سے پہلے ہو۔‘‘ ¤ ➍ {وَ اَصْلَحَ بَالَهُمْ:} طبری نے فرمايا : {’’ بَالٌ ‘‘} مصدر کی طرح ہے، جیسا کہ {’’شَأْنٌ‘‘} ہے، اس سے کوئی فعل نہیں بنایا جاتا۔ ضرورت شعری کے بغیر عرب اس کی جمع استعمال نہیں کرتے، اگر جمع بنائیں تو {’’بَالَاتٌ‘‘} بناتے ہیں۔‘‘ شہاب نے فرمایا: {’’ بَالٌ‘‘} حال اور شان کے معنی میں ہوتا ہے، بعض اوقات کسی عظیم معاملے کے ساتھ خاص ہوتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كُلُّ أَمْرٍ ذِيْ بَالٍ ] [ابن ماجہ: ۱۸۹۴] ’’ہر بڑی شان والا کام۔‘‘ اور کبھی دلی خیال کے لیے آتا ہے، مجازاً دل کو بھی کہہ لیا جاتا ہے۔‘‘ اگر یہاں اس کی یہ تفسیر کی جائے تو یہ بھی اچھی تفسیر ہے۔ سفاقسی نے اس کی تفسیر فکر (سوچ) کے ساتھ کی ہے، کیونکہ جب دل اور سوچ درست ہو جائیں تو عقیدہ اور عمل سب درست ہو جاتے ہیں۔‘‘ (تفسیر قاسمی) ¤ مطلب یہ ہے کہ کفار کے اعمال کو اللہ تعالیٰ ضائع اور برباد کر دیتا ہے، اس کے بر عکس ایمان اور عمل صالح والوں کے گناہ معاف کر دیتا ہے، ان کا حال درست کر دیتا ہے اور ان کے دل اور سوچ کی اصلاح کر دیتا ہے اور انھیں شرک کے بجائے توحید کی، نافرمانی کے بجائے اتباعِ سنت کی اور گناہوں کے بجائے اعمالِ صالحہ کی توفیق سے نوازتا ہے، حتیٰ کہ ان کے گزشتہ گناہوں کو بھی نیکیوں میں بدل دیتا ہے۔ دیکھیے سورۂ فرقان (۷۰)۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { ذٰلِكَ بِاَنَّ الَّذِيْنَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ … :} یعنی کفار کے اعمال برباد کرنے اور ایمان والوں کے گناہ دور کرنے اور ان کا حال درست کرنے کی وجہ یہ ہے کہ کفار نے باطل کی پیروی اختیار کی اور اس کے پیچھے چل پڑے، جبکہ ایمان والے اس حق پر چلتے رہے جو ان کا اپنا طے کردہ نہیں تھا، بلکہ ان کے رب کی طرف سے نازل کیا ہوا تھا۔ دونوں کے راستے مختلف تھے، اس لیے ان کا انجام بھی مختلف ہوا۔ ¤ ➋ { كَذٰلِكَ يَضْرِبُ اللّٰهُ لِلنَّاسِ اَمْثَالَهُمْ: ’’ أَمْثَالٌ‘‘ ’’مَثَلٌ‘‘} کی جمع ہے، اس کا معنی مثال بھی ہے اور کسی چیز کا حال اور وصف بھی، جیسا کہ آگے آ رہا ہے، فرمایا : «مَثَلُ الْجَنَّةِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَ فِيْهَاۤ اَنْهٰرٌ مِّنْ مَّآءٍ غَيْرِ اٰاٰسِنٍ » [ محمد : ۱۵] ’’اس جنت کا حال اور وصف جس کا متقی لوگوں سے وعدہ کیا گیا ہے، یہ ہے کہ اس میں کئی نہریں ایسے پانی کی ہیں جو بگڑنے والا نہیں۔‘‘ یعنی اللہ تعالیٰ ایسے ہی سب لوگوں کے احوال بیان فرماتا ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { فَاِذَا لَقِيْتُمُ الَّذِيْنَ كَفَرُوْا فَضَرْبَ الرِّقَابِ: ’’ فَاِذَا ‘‘} میں فاء کا تعلق پہلے کلام سے ہے کہ جب کفار باطل کے پیروکار اور مومن حق کے پیروکار ہیں تو اس کا تقاضا یہ ہے کہ حق کے پیروکار باطل کے پیروکاروں کو یہ موقع نہ دیں کہ وہ زمین میں فساد پھیلاتے پھریں، لہٰذا جب تم (میدانِ جنگ میں) ان لوگوں سے ملو جنھوں نے کفر کیا تو ان کی گردنیں خوب اڑاؤ۔ ¤ ➋ {’’ فَاِذَا لَقِيْتُمْ‘‘} کا لفظی معنی اگرچہ ’’جب تم ملو‘‘ ہے، مگر اس سے مراد یہ ہے کہ جب تمھارا ان سے مقابلہ ہو۔ یہ مطلب نہیں کہ جب کوئی کافر سامنے آ جائے تو اسے قتل کر دو، کیونکہ قرآن مجید اور کلامِ عرب میں ’’لقاءِ عدو‘‘ سے مراد دشمن سے مقابلہ لیا جاتا ہے، جیسا کہ فرمایا : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِذَا لَقِيْتُمْ فِئَةً فَاثْبُتُووْا وَ اذْكُرُوا اللّٰهَ كَثِيْرًا لَّعَلَّكُمْ تُفْلِحُوْنَ » [ الأنفال : ۴۵ ]’’اے لوگو جو ایمان لائے ہو! جب تم کسی گروہ کے مقابل ہو تو جمے رہو اور اللہ کو بہت زیادہ یاد کرو، تاکہ تم فلاح پاؤ۔ ‘‘ ¤ ➌ {’’ فَضَرْبَ الرِّقَابِ ‘‘} اصل میں {’’فَاضْرِبُوا الرِّقَابَ ضَرْبًا‘‘} ہے، فعل امر {’’فَاضْرِبُوْا‘‘} کو حذف کرکے مفعول مطلق {’’ضَرْبًا‘‘} کو اس کے قائم مقام کر دیا اور اسے مفعول بہ {’’ الرِّقَابِ ‘‘} کی طرف مضاف کر دیا۔ اس سے اختصار کے علاوہ کلام میں ہیبت اور زور بھی پیدا ہو گیا کہ کفار سے مقابلے کی صورت میں بس ایک ہی کام ہے اور وہ ہے گردنیں مارنا۔ ’’ضرب‘‘ کا لفظ عربی زبان میں تلوار کی کاٹ کے لیے استعمال ہوتا ہے، نیزے کے لیے ’’طعن‘‘ اور تیر کے لیے ’’رمي‘‘ کا لفظ آتا ہے۔ ان میں سب سے زیادہ قوت و شجاعت اور ہیبت کا مظاہرہ آمنے سامنے تیغ زنی میں ہے، خصوصاً جب تلوار گردن پر پڑے، اس لیے {’’ فَضَرْبَ الرِّقَابِ ‘‘} فرمایا، کیونکہ جو زورِ بیان اس لفظ میں ہے کسی اور میں نہیں۔ ورنہ مراد کسی بھی طریقے سے قتل کرنا ہے، تلوار سے ہو یا تیر سے یا نیزے سے یا کسی جدید اسلحہ سے اور اس اسلحے کی چوٹ خواہ گردن پر پڑے یا جسم کے کسی اور حصے پر۔ یا بلا اسلحہ ہی دشمن کو قتل کر دیا جائے، خواہ گلا گھونٹ کر، مکا مار کر یا جسم کے کسی نازک حصے پر چوٹ مار کر، غرض مقصد دشمن کو کسی بھی طریقے سے قتل کرنا ہے۔ ¤ ➍ {حَتّٰۤى اِذَاۤ اَثْخَنْتُمُوْهُمْ فَشُدُّوا الْوَثَاقَ: ’’ أَثْخَنَ يُثْخِنُ إِثْخَانًا‘‘} (افعال) قتل اور خون ریزی میں مبالغہ کرنا۔ {’’شَدَّ يَشُدُّ شَدًّا‘‘ (ن) ’’اَلشَّيْءَ‘‘ } کسی چیز کو باندھنا۔ {’’شَدَّ الْعُقْدَةَ أَوِ الْوَثَاقَ‘‘} گرہ یا رسی کو مضبوطی سے باندھنا۔ {’’ الْوَثَاقَ ‘‘} رسی وغیرہ جس کے ساتھ باندھا جائے۔ یعنی جنگ کا اصل ہدف دشمن کی جنگی قوت کو توڑنا ہے، اس لیے جنگ کی ابتدا ہی میں دشمن کے آدمیوں کو گرفتار کرنے میں نہیں لگ جانا چاہیے، بلکہ زیادہ سے زیادہ خونریزی اور قتل کے بعد جب ان کا اچھی طرح قلع قمع ہو جائے اور لڑائی اختتام کو پہنچ چکی ہو تو پھر بچے کھچے لوگوں کو قیدی بنانا چاہیے، تاکہ ان میں دوبارہ مقابلے کی سکت باقی نہ رہے۔ جنگِ بدر میں مسلمانوں نے دشمن کو اچھی طرح تہ تیغ کرنے سے پہلے ہی اس کے آدمیوں کو قیدی بنایا تو اللہ تعالیٰ نے اس پر ناراضی کا اظہار کرتے ہوئے فرمایا: « مَا كَانَ لِنَبِيٍّ اَنْ يَّكُوْنَ لَهٗۤ اَسْرٰى حَتّٰى يُثْخِنَ فِي الْاَرْضِ تُرِيْدُوْنَ عَرَضَ الدُّنْيَا وَ اللّٰهُ يُرِيْدُ الْاٰخِرَةَ وَ اللّٰهُ عَزِيْزٌ حَكِيْمٌ » [ الأنفال:۶۷]’’کبھی کسی نبی کے لائق نہیں کہ اس کے ہاں قیدی ہوں، یہاں تک کہ وہ زمین میں خوب خون بہا لے، تم دنیا کا سامان چاہتے ہو اور اللہ آخرت کو چاہتا ہے اور اللہ سب پر غالب، کمال حکمت والا ہے۔‘‘ ¤ ➎ {فَاِمَّا مَنًّۢا بَعْدُ وَ اِمَّا فِدَآءً: ’’ مَنًّا ‘‘} اور {’’ فِدَآءً ‘‘} مفعول مطلق ہیں جن کا فعل حذف کر دیا گیا ہے اور تنوین تنکیر کے لیے ہے : {’’ أَيْ إِمَّا تَمُنُّوْنَ عَلَيْهِمْ مَنًّا بَعْدَ ذٰلِكَ وَ إِمَّا تُفَادُوْنَهُمْ فِدَاءً ‘‘} ’’یعنی اس کے بعد یا تو ان پر احسان کر دو، کسی طرح احساان کرنا یا ان سے فدیہ لے لو، کسی طرح فدیہ لینا۔‘‘ ¤ کسی طرح احسان کرنے کی ایک صورت یہ ہے کہ انھیں قتل نہ کیا جائے، بلکہ ان کی جان بخشی کرکے انھیں لونڈی و غلام بنا کر مسلمان افراد کے حوالے کر دیا جائے۔ حقیقت یہ ہے کہ دائمی قید یا قتل کے مقابلے میں غلام بنا لینا کوئی کم احسان نہیں، خصوصاً اسلام میں لونڈی و غلام سے جس حسن سلوک کی تاکید کی گئی ہے اس کے ہوتے ہوئے دائمی قید یا قتل کے مقابلے میں یہ بہت بڑی نعمت ہے، کیونکہ بہت سے کاموں کے کفارے کی صورت میں اور مکاتبت یعنی کمائی کرکے اپنی قیمت ادا کرنے کی صورت میں ان کی آزادی کے مواقع موجود ہیں۔ رسول اللہ صلی اللہ علیہ وسلم اور خلفائے راشدین رضی اللہ عنھم سے مفتوح لوگوں کو لونڈی و غلام بنانا تواتر سے ثابت ہے اور قرآن مجید میں متعدد مقامات پر لونڈیوں اور غلاموں کا ذکر موجود ہے۔ دیکھیے سورۂ نساء (۳،۲۴، ۳۶)، مومنون (۵، ۶)، احزاب (۵۰)، نحل (۷۱)، روم (۲۸)، نور (۳۱ تا ۳۳،۵۸) اور دوسری متعدد آیات۔ ان آیات و احادیث اور خلفائے راشدین کے عمل کے ہوتے ہوئے اسلام میں غلامی سے انکار کوئی ملحد ہی کر سکتا ہے، یا کوئی جاہل جسے کتاب اللہ اور سنت رسول صلی اللہ علیہ وسلم کا علم نہ ہو۔ ¤ قیدیوں پر کسی طرح احسان کرنے کی ایک صورت یہ ہے کہ انھیں بلامعاوضہ رہا کر دیا جائے۔ یہ اس وقت ہوتا ہے جب ایسا کرنا مصلحت کا تقاضا ہو، مثلاً امید ہو کہ وہ مسلمان ہو جائیں گے، یا اسلام اور مسلمانوں کے خلاف سرگرمیوں سے باز آ جائیں گے، جیسا کہ آپ صلی اللہ علیہ وسلم نے نجد کے سردار ثمامہ بن اثال رضی اللہ عنہ کو بلامعاوضہ رہا کر دیا۔ (دیکھیے بخاری : ۴۳۷۲) جنگ حنین کے کئی ہزار قیدیوں کو احسان فرما کر رہا کر دیا۔ (دیکھیے بخاری : ۴۳۱۸، ۴۳۱۹) صلح حدیبیہ کے موقع پر اسّی (۸۰) آدمی تنعیم کی طرف سے آئے اور فجر کی نماز کے قریب انھوں نے آپ صلی اللہ علیہ وسلم پر شب خون مارنے کا ارادہ کیا، مگر وہ سب کے سب پکڑ لیے گئے، پھر آپ نے سب کو چھوڑ دیا، تاکہ یہ معاملہ لڑائی کا باعث نہ بن جائے۔ اس موقع پر یہ آیت نازل ہوئی: «وَ هُوَ الَّذِيْ كَفَّ اَيْدِيَهُمْ عَنْكُمْ وَ اَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْۢ بَعْدِ اَنْ اَظْفَرَكُمْ عَلَيْهِمْ » [الفتح : ۲۴ ] ’’اور وہی ہے جس نے مکہ کی وادی میں ان کے ہاتھ تم سے اور تمھارے ہاتھ ان سے روک دیے، اس کے بعد کہ تمھیں ان پر فتح دے دی۔‘‘ [ دیکھیے مسلم، الجہاد، باب قول اللہ تعالٰی : { وھو الذی کف أیدیہم عنکم }: ۱۸۰۸ ] فتح مکہ کے موقع پر آپ صلی اللہ علیہ وسلم نے چند آدمیوں کو مستثنیٰ کرکے تمام اہلِ مکہ کو بطور احسان معاف فرما دیا۔ غزوۂ بنی مصطلق کے بعد جب اس قبیلے کے قیدی لائے گئے اور لوگوں میں تقسیم کر دیے گئے، تو اس وقت جویریہ رضی اللہ عنھا جس شخص کے حصے میں آئی تھیں اسے ان کا معاوضہ ادا کرکے آپ صلی اللہ علیہ وسلم نے خریدا اور آزاد کرکے ان سے نکاح کر لیا۔ اس پر تمام مسلمانوں نے اپنے حصے کے قیدی یہ کہہ کر رہا کر دیے کہ یہ اب رسول اللہ صلی اللہ علیہ وسلم کے سسرالی رشتہ دار بن چکے ہیں۔ [ دیکھیے مسند أحمد : 277/6، ح : ۲۶۴۱۹ ] ¤ قیدیوں کے ساتھ احسان کی ایک صورت یہ ہے کہ ان پر جزیہ لگا کر انھیں مسلمانوں کا ذمی بنا لیا جائے، جیسا کہ فرمایا: «حَتّٰى يُعْطُوا الْجِزْيَةَ عَنْ يَّدٍ وَّ هُمْ صٰغِرُوْنَ» [ التوبۃ : ۲۹ ] ’’یہاں تک کہ وہ ہاتھ سے جزیہ دیں اور وہ حقیر ہوں۔ ‘‘ ¤ قیدیوں پر احسان میں یہ بھی شامل ہے کہ جب تک وہ قید میں رہیں ان سے اچھا سلوک کیا جائے، ان کے کھانے پینے، لباس اور صحت وغیرہ کا خیال رکھا جائے۔ اللہ تعالیٰ نے اس کی بہت تاکید فرمائی ہے۔ دیکھیے سورۂ دہر کی آیت (۸) : «وَ يُطْعِمُوْنَ الطَّعَامَ عَلٰى حُبِّهٖ مِسْكِيْنًا وَّ يَتِيْمًا وَّ اَسِيْرًا » کی تفسیر۔ ¤ {’’ وَ اِمَّا فِدَآءً ‘‘} فدیہ لینے کی ایک صورت یہ ہے کہ ان سے کچھ مال لے کر انھیں آزاد کر دیا جائے، جیسا کہ بدر کے قیدیوں سے فدیہ لیا گیا۔ تفصیل کے لیے دیکھیے سورۂ انفال (۷۰) کی تفسیر۔ اور فدیے کی ایک صورت یہ ہے کہ رہائی کی شرط کے طور پر کوئی خاص خدمت لینے کے بعد ہی انھیں رہا کیا جائے، مثلاً وہ ان لوگوں کو لکھنا پڑھنا سکھا دیں جو ان کے سپرد کیے جائیں۔ اور فدیے کی ایک صورت یہ ہے کہ کفار کے ہاتھوں گرفتار کسی مسلم قیدی کی رہائی کے بدلے میں انھیں رہا کر دیا جائے، جیسا کہ سلمہ بن اکوع رضی اللہ عنہ نے بیان فرمایا کہ بنو فزارہ پر حملے میں جو قیدی آئے امیرِ لشکر ابوبکر رضی اللہ عنہ نے ان میں سے ایک نہایت حسین لونڈی انھیں زائد عطیہ کے طور پر دی، جب وہ مدینہ آئے تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے وہ لونڈی اصرار کے ساتھ ہبہ کے طورپر مانگ لی، انھوں نے وہ آپ صلی اللہ علیہ وسلم کو دے دی، تو : [ فَبَعَثَ بِهَا رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ إِلٰی أَهْلِ مَكَّةَ فَفَدٰی بِهَا نَاسًا مِّنَ الْمُسْلِمِيْنَ كَانُوْا أُسِرُوْا بِمَكَّةَ ] [مسلم، الجہاد و السیر، باب التنفیل و فداء المسلمین بالأسارٰی : ۱۷۵۵ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے اس لونڈی کو کچھ مسلمانوں کے فدیے کے طور پر اہل مکہ کی طرف بھیج دیا، جو مکہ میں قید کیے ہوئے تھے۔‘‘ ¤ ➏ اس آیت کے الفاظ سے ظاہر یہی ہوتا ہے کہ کفار کو قیدی بنا لینے کے بعد احسان یا فدیہ ہی میں سے کوئی ایک صورت اختیار کی جائے گی، انھیں قتل نہیں کیا جائے گا۔ مگر حقیقت یہ ہے کہ مسلمانوں کے امیر کو انھیں قتل کرنے کا بھی اختیار ہے، جیسا کہ حدیث اور سیرت کی کتابوں میں مذکور ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بدر کے قیدیوں میں سے نضر بن حارث اور عقبہ بن ابی معیط کو قتل کیا۔ بنو قریظہ کے قیدیوں کو، جو سعد بن معاذ رضی اللہ عنہ کے فیصلے پر اپنے قلعوں سے نیچے اترے انھیں قتل کیا۔ فتح مکہ کے دن ابن خطل اور مقیس بن صبابہ کو قتل کیا اور اُحد کے بعد ابوعزہ شاعر کو قتل کیا۔ رسول اللہ صلی اللہ علیہ وسلم سے ثابت شدہ عمل کے بعد کسی کو یہ کہنے کا اختیار نہیں کہ کافر کو قید کرنے کے بعد کسی صورت قتل نہیں کیا جا سکتا، کیونکہ آپ سے بڑھ کر کوئی شخص قرآن مجید کا مطلب نہیں سمجھ سکتا۔ اگر کوئی شخص آیت کے الفاظ پر غور کرے تو خود اس میں قیدیوں کو قتل کرنے کا اختیار موجود ہے، کیونکہ اللہ تعالیٰ نے قیدیوں کو مضبوطی سے باندھنے کے حکم کے بعد فرمایا : « فَاِمَّا مَنًّۢا بَعْدُ وَ اِمَّا فِدَآءً » { ’’ مَنًّا ‘‘} کا معنی انعام و احسان ہے، جیسا کہ اللہ تعالیٰ کے اسمائے حسنیٰ میں سے ایک {’’اَلْمَنَّانُ‘‘} بھی ہے اور یہ سب جانتے ہیں کہ انعام کرنے والے پر لازم نہیں ہوتا کہ وہ انعام کرے۔ اللہ تعالیٰ نے اپنے بندوں پر جو انعام کیے ہیں وہ نہ اللہ پر واجب تھے نہ بندوں کا حق تھے، جسے ادا کرنا اللہ کے ذمے لازم ہو۔ اس لفظ {’’ مَنًّا ‘‘} (انعام و احسان) سے یہ بات ثابت ہوتی ہے کہ مسلمانوں کا قیدیوں کو زندہ رکھنا ان کی طرف سے قیدیوں کے لیے انعام ہے۔ اگر انھیں قتل کرنے کا اختیار ہی نہ ہو بلکہ انھیں ہر حال میں زندہ رکھنا ان پر واجب ہو تو انھیں چھوڑ دینا ان پر کوئی احسان و انعام نہیں ہو گا، بلکہ انھیں چھوڑ کر ان کا حق ادا کیا جائے گا جو مسلمانوں کے ذمے واجب تھا۔ اس لیے {’’ مَنًّا ‘‘} اور {’’ فِدَآءً ‘‘} کے دو الفاظ میں وہ چاروں صورتیں آ جاتی ہیں جن کا مسلمانوں کے امیر کو اختیار ہے اور وہ ہے قتل کرنا یا غلام بنانا یا بلامعاوضہ چھوڑنا یا فدیہ لے کر چھوڑنا۔ (بقاعی) صحیح بخاری میں ثمامہ بن اثال رضی اللہ عنہ کے قول سے بھی یہ بات ثابت ہوتی ہے کہ قیدی کو چھوڑنا اس کا استحقاق نہیں، اس پر انعام ہے۔ چنانچہ اس نے کہا : [ إِنْ تَقْتُلْنِيْ تَقْتُلْ ذَا دَمٍ، وَإِنْ تُنْعِمْ تُنْعِمْ عَلٰی شَاكِرٍ، وَإِنْ  كُنْتَ تُرِيْدُ الْمَالَ فَسَلْ مِنْهُ مَا شِئْتَ ] [ بخاري، المغازي، باب وفد بني حنیفۃ… : ۴۳۷۲۔ مسلم : ۱۷۶۴ ] ’’(اے محمد!) اگر تم مجھے قتل کرو تو ایک خون والے کو قتل کرو گے اور اگر انعام کرو تو ایک شکر گزار پر انعام کرو گے اور اگر مال چاہتے ہو تو مانگو جتنا چاہتے ہو۔‘‘ ¤ ➐ {حَتّٰى تَضَعَ الْحَرْبُ اَوْزَارَهَا: ’’ اَوْزَارَهَا ‘‘ ’’وِزْرٌ‘‘} کی جمع ہے جس کا معنی بوجھ ہے، مراد اس سے لڑائی کے ہتھیار ہیں، کیونکہ جب تک لڑائی باقی رہے ہتھیار اٹھانا پڑتے ہیں جو اٹھانے والوں کے لیے بوجھ ہوتے ہیں، یعنی کفار کی گردنیں مارتے رہو اور ان سے لڑائی جاری رکھو، حتیٰ کہ لڑائی ختم ہو جائے اور کسی کافر میں مسلمانوں کے ساتھ لڑنے کی جرأت اور طاقت نہ رہے۔ یہ اسی وقت ہو سکتا ہے جب مسلمان پوری زمین پر غالب ہوں اور کفار میں ان کے مقابل آنے کی اور ان کے حکم سے سر پھیرنے کی جرأت و ہمت باقی نہ رہے، جیسا کہ فرمایا : «وَ قَاتِلُوْهُمْ حَتّٰى لَا تَكُوْنَ فِتْنَةٌ وَّ يَكُوْنَ الدِّيْنُ كُلُّهٗ لِلّٰهِ » [ الأنفال : ۳۹] ’’اور ان سے لڑو، یہاں تک کہ کوئی فتنہ نہ رہے اور دین سب کا سب اللہ کے لیے ہو جائے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق کفر و اسلام کا یہ معرکہ قیامت تک جاری رہے گا۔ جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَنْ يَبْرَحَ هٰذَا الدِّيْنُ قَائِمًا، يُقَاتِلُ عَلَيْهِ عِصَابَةٌ مِّنَ الْمُسْلِمِيْنَ حَتّٰي تَقُوْمَ السَّاعَةُ ] [ مسلم، الإمارۃ، باب  قولہ صلی اللہ علیہ وسلم : ’’ لا تزال طائفۃ من أمتي ظاھرین علی الحق… ‘‘ : ۱۹۲۲ ] ’’یہ دین ہمیشہ قائم رہے گا، مسلمانوں کی ایک جماعت اس پر لڑتی رہے گی، یہاں تک کہ قیامت قائم ہو۔‘‘ ¤ ➑ {ذٰلِكَ:} یہ مبتدا محذوف کی خبر ہے : {’’ أَيْ اَلْأَمْرُ ذٰلِكَ‘‘} یعنی بات یہی ہے جو گردنیں مارنے، قید کرنے، احسان کرنے اور فدیہ لینے کی تفصیل کے ساتھ بیان ہوئی، یا یہ فعل محذوف کا مفعول بہ ہے : {’’ أَيْ اِفْعَلُوْا ذٰلِكَ‘‘} یعنی یہ کام کرو۔ یہ مختصر سا لفظ گزشتہ پوری تفصیل کو ذہن میں پختہ کرنے اور اس کی تاکید کے لیے لایا گیا ہے۔ ¤ ➒ {وَ لَوْ يَشَآءُ اللّٰهُ لَانْتَصَرَ مِنْهُمْ:} یہ اس سوال کا جواب ہے کہ اگر کفار اتنے ہی برے ہیں تو اللہ تعالیٰ خود انھیں سزا کیوں نہیں دیتا؟ یعنی اللہ تعالیٰ نے گردنیں مارنے اور دوسری باتوں کا حکم تمھیں دیا ہے، حالانکہ اگر اللہ تعالیٰ چاہے تو وہ خود کفار سے انتقام لے سکتا ہے۔ اس کے لیے اس کی طرف سے زلزلے کا ایک جھٹکا، بجلی کی ایک کڑک، سیلاب کا ایک ریلا یا آندھی کا ایک جھونکا کافی ہے، جیسا کہ اس نے گزشتہ کئی کافر اقوام کے ساتھ کیا۔ (دیکھیے عنکبوت:۴۰) لیکن اگر وہ ایسا کرتا تو سب لوگ ہلاکت سے بچنے کے لیے ایمان لے آتے جو جبری اور اضطراری ہوتا، اپنی مرضی اور اختیار سے نہ ہوتا، اس طرح آزمائش اور امتحان کا مقصد فوت ہو جاتا۔ ¤ ➓ { وَ لٰكِنْ لِّيَبْلُوَاْ بَعْضَكُمْ بِبَعْضٍ: ’’ لِيَبْلُوَاْ‘‘} فعل محذوف کے متعلق ہے : {’’ أَيْ وَلٰكِنَّهُ أَمَرَكُمْ بِالْجِهَادِ لِيَبْلُوَ بَعْضَكُمْ بِبَعْضٍ‘‘} ’’یعنی لیکن اس نے تمھیں جہاد کا حکم اس لیے دیا ہے کہ تمھارے بعض کو بعض کے ساتھ آزمائے‘‘ اور ظاہر ہو جائے کہ کون مخلص مومن ہے اور کون منافق، جیسا کہ فرمایا : « اَمْ حَسِبْتُمْ اَنْ تَدْخُلُوا الْجَنَّةَ وَ لَمَّا يَعْلَمِ اللّٰهُ الَّذِيْنَ جٰهَدُوْا مِنْكُمْ وَ يَعْلَمَ الصّٰبِرِيْنَ » [ آل عمران : ۱۴۲ ] ’’یا تم نے گمان کر لیا کہ تم جنت میں داخل ہو جاؤ گے، حالانکہ ابھی تک اللہ نے ان لوگوں کو نہیں جانا جنھوں نے تم میں سے جہاد کیا اور تاکہ وہ صبر کرنے والوں کو جان لے۔‘‘ ایمان والوں کو جہاد کا حکم دینے میں اللہ تعالیٰ کی بے شمار حکمتوں میں سے چند حکمتیں اس آیت میں بیان ہوئی ہیں، فرمایا : «قَاتِلُوْهُمْ يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ وَ يُخْزِهِمْ وَ يَنْصُرْكُمْ عَلَيْهِمْ وَ يَشْفِ صُدُوْرَ قَوْمٍ مُوؤْمِنِيْنَ (14) وَ يُذْهِبْ غَيْظَ قُلُوْبِهِمْ وَ يَتُوْبُ اللّٰهُ عَلٰى مَنْ يَّشَآءُ وَ اللّٰهُ عَلِيْمٌ حَكِيْمٌ » [ التوبۃ : ۱۴،۱۵ ] ’’ان سے لڑو، اللہ انھیں تمھارے ہاتھوں سے عذاب دے گا اور انھیں رسوا کرے گا اور ان کے خلاف تمھاری مدد کرے گا اور مومن لوگوں کے سینوں کو شفا دے گا۔ اور ان کے دلوں کا غصہ دور کرے گا اور اللہ توبہ کی توفیق دیتا ہے جسے چاہتا ہے اور اللہ سب کچھ جاننے والا، کمال حکمت والا ہے۔‘‘ اس کی تفصیل سورۂ توبہ کی مذکورہ بالا آیات میں ملاحظہ فرمائیں۔ ¤ ⓫ {وَ الَّذِيْنَ قُتِلُوْا فِيْ سَبِيْلِ اللّٰهِ فَلَنْ يُّضِلَّ اَعْمَالَهُمْ:} یعنی شہداء کے اللہ کی راہ میں قتل کیے جانے کا یہ مطلب نہیں کہ وہ اپنی جان سے گئے، انھیں کچھ بھی نہ ملا اور ان کی قربانی سے فائدہ ان لوگوں نے اٹھایا جو اس دنیا میں زندہ رہے۔ فرمایا ایسا ہر گز نہیں، اللہ تعالیٰ ان کے اعمال ہر گز ضائع نہیں کرے گا، بلکہ اس سودے کا اصل نفع خود انھی کو حاصل ہو گا۔ مزید دیکھیے سورۂ توبہ (۱۱۱) کی تفسیر۔ شہداء کو ملنے والی چند نعمتوں کا ذکر اس آیت کے بعد متصل آیات میں بھی آ رہا ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {سَيَهْدِيْهِمْ وَ يُصْلِحُ بَالَهُمْ:} یعنی اللہ تعالیٰ ان کی محنت ٹھکانے لگائے گا، انھیں جنت کے راستے پر لے جائے گا اور آخرت میں پیش آنے والے تمام مراحل میں ان کی حالت کو درست رکھے گا۔ عبد اللہ بن عمروبن العاص رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُغْفَرُ لِلشَّهِيْدِ كُلُّ ذَنْبٍ إِلَّا الدَّيْنَ ] [ مسلم، الإمارۃ، باب من قتل في سبیل اللہ کفرت خطایاہ إلا الدین: ۱۸۸۶ ] ’’قرض کے سوا شہید کے تمام گناہ بخش دیے جاتے ہیں۔‘‘ شہادت اور شہداء کے مزید بہت سے فضائل کی تفصیل کے لیے کتبِ احادیث میں سے جہاد کے ابواب ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {وَ يُدْخِلُهُمُ الْجَنَّةَ عَرَّفَهَا لَهُمْ:} یعنی اللہ تعالیٰ انھیں اس جنت میں داخل کرے گا جس کی پہچان اس نے قرآن کی آیات اور رسول اللہ صلی اللہ علیہ وسلم کی زبانی بہت اچھی طرح کروا دی ہے۔ اس سورت کی آیت (۱۵) میں بھی اس کی کچھ شناخت آ رہی ہے۔ جب وہ اس جنت میں جائیں گے تو وہ ان کے لیے اجنبی نہیں ہو گی، بلکہ عین اس وعدے اور شناخت کے مطابق ہو گی جو اللہ تعالیٰ نے انھیں کروا رکھی ہے۔ {’’ عَرَّفَهَا لَهُمْ ‘‘} میں یہ بات بھی شامل ہے کہ کسی جنتی کو جنت میں اپنے گھر جانے کے لیے کسی سے پوچھنے کی ضرورت نہیں پڑے گی۔ ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَخْلُصُ الْمُؤْمِنُوْنَ مِنَ النَّاارِ، فَيُحْبَسُوْنَ عَلٰی قَنْطَرَةٍ بَيْنَ الْجَنَّةِ وَالنَّارِ، فَيُقَصُّ لِبَعْضِهِمْ مِّنْ بَعْضٍ مَظَالِمُ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا، حَتّٰی إِذَا هُذِّبُوْا وَنُقُّوْا أُذِنَ لَهُمْ فِيْ دُخُووْلِ الْجَنَّةِ، فَوَالَّذِيْ نَفْسُ مُحَمَّدٍ بِيَدِهِ! لَأَحَدُهُمْ أَهْدٰی بِمَنْزِلِهِ فِی الْجَنَّةِ مِنْهُ بِمَنْزِلِهِ كَانَ فِي الدُّنْيَا ] [بخاری، الرقاق، باب القصاص یوم القیامۃ:۶۵۳۵ ] ’’مومن آگ سے بچ کر نکلیں گے تو انھیں ایک پل پر روک لیا جائے گا، جو جنت اور آگ کے درمیان ہے، پھر انھیں ایک دوسرے سے ان زیادتیوں کا قصاص دلایا جائے گا جو دنیا میں ہوئیں، یہاں تک کہ جب وہ خوب صاف ستھرے ہو جائیں گے تو انھیں جنت میں داخل ہونے کی اجازت دی جائے گی۔ سو اس ذات کی قسم جس کے ہاتھ میں محمد ( صلی اللہ علیہ وسلم ) کی جان ہے ! ان میں سے ہر ایک کو جنت میں اپنے گھر کا راستہ اس سے زیادہ معلوم ہو گا جتنا اسے دنیا میں اپنے گھر کا راستہ معلوم تھا۔‘‘"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنْ تَنْصُرُوا اللّٰهَ:} اللہ کی مدد کرنے سے مراد اللہ کے دین اور اللہ کے دوستوں کی مدد کرنا ہے، کیونکہ اللہ تعالیٰ تو غنی ہے، اسے کسی کی مدد کی ضرورت نہیں، جیسا کہ اس سے پہلی آیت میں فرمایا : «وَ لَوْ يَشَآءُ اللّٰهُ لَانْتَصَرَ مِنْهُمْ » [ محمد : ۴ ] ’’اور اگر اللہ چاہے تو ضرور ان سے انتقام لے لے۔‘‘ اللہ کے دین کی مدد اس کی راہ میں جہاد اور جان و مال کی قربانی سے بھی ہوتی ہے اور اس کے دشمنوں پر دینِ حق کے دلائل و براہین قائم کرنے کے ساتھ بھی۔ ¤ ➋ { يَنْصُرْكُمْ:} اللہ تعالیٰ کی مدد دو طرح سے آتی ہے، ایک یہ کہ وہ ہمیں دنیا میں دشمنوں پر فتح اور غلبہ عطا فرما دے، مگر ایسا کبھی ہوتا ہے کبھی نہیں ہوتا۔ دوسری یہ کہ وہ ہمیں آخرت عطا فرما دے، خواہ دنیا میں کسی موقع پر شکست سے بھی دو چار ہونا پڑے۔ ¤ ➌ {وَ يُثَبِّتْ اَقْدَامَكُمْ:} یعنی وہ تمھیں دین پر قائم رکھے گا، کسی شک و شبہ کا شکار نہیں ہونے دے گا، جنگ میں ثابت قدمی عطا فرمائے گا کبھی فرار کا خیال تک نہیں آنے دے گا، خواہ دشمن کتنی زیادہ تعداد میں ہوں اور قیامت کے دن ’’صراط‘‘ پر تمھارے قدم جمائے رکھے گا اور پھسلنے اور جہنم میں گرنے سے محفوظ رکھے گا، جب سب لوگ {’’ اَللّٰهُمَّ سَلِّمْ سَلِّمْ‘‘} (اے اللہ! سلامت رکھنا، سلامت رکھنا) کہہ رہے ہوں گے۔ [ دیکھیے بخاري: ۶۵۷۳ ]"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {وَ الَّذِيْنَ كَفَرُوْا فَتَعْسًا لَّهُمْ وَ اَضَلَّ اَعْمَالَهُمْ: ’’ تَعْسًا ‘‘} کا معنی ٹھوکر کھا کر گرنا اور پھر اٹھ نہ سکنا ہے، یا کسی گڑھے میں گر کر ہلاک ہو جانا ہے۔ (مفردات) گویا اللہ کے دین کی مدد کرنے والوں کے تو اللہ تعالیٰ پاؤں جما دیتا ہے، اس کے برعکس منکروں کو منہ کے بل گرا کر ہلاک کر دیا جاتا ہے اور مومنوں کی تو مدد کی جاتی ہے جب کہ کافروں کے تمام اعمال برباد اور ان کے کیے کرائے پر پانی پھیر دیا جاتا ہے۔ (کیلانی) ¤ ➋ {’’ تَعْسًا‘‘} کا فعل {’’ مَنَعَ ‘‘} اور {’’سَمِعَ‘‘} دونوں سے آتا ہے۔ {’’تَعْسًا‘‘} مصدر مفعول مطلق ہے جس کا فعل حذف ہونا واجب ہے : {’’ أَيْ تَعِسُوْا تَعْسًا۔‘‘} پھر {’’ تَعِسُوْا ‘‘} کو حذف کرکے {’’تَعْسًا‘‘} مصدر کو اس کے قائم مقام کر دیا اور فعل کے فاعل جمع مذکر غائب کی ضمیر کو ظاہر کر دیا۔ ابن ہشام نے فرمایا کہ {’’ لَهُمْ ‘‘} میں لام تبیین کا ہے جو {’’ تَعْسًا‘‘} کے فاعل کے بیان کے لیے ہے۔ معنی یہی ہے کہ وہ ہلاک ہوئے، بری طرح ہلاک ہونا۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {ذٰلِكَ بِاَنَّهُمْ كَرِهُوْا مَاۤ اَنْزَلَ اللّٰهُ …:} یعنی اس انجام کا سبب یہ ہے کہ انھوں نے اللہ تعالیٰ کی نازل کردہ ہدایت کو ناپسند کیا تو اللہ تعالیٰ نے ان کے اعمال برباد کر دیے، کیونکہ اعمال کے بار آور ہونے کی شرط ان کا اللہ کی نازل کردہ ہدایت کے مطابق ہونا ہے۔ مزید دیکھیے اسی سورت کی پہلی آیت کی تفسیر۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {اَفَلَمْ يَسِيْرُوْا فِي الْاَرْضِ … :} یہ {’’ فَتَعْسًا لَّهُمْ ‘‘} ہی کی وضاحت ہے کہ کیا ان لوگوں نے زمین میں چل پھر کر پہلی تباہ شدہ قوموں کے آثار دیکھ کر ان کی ہلاکت کو اپنی آنکھوں سے نہیں دیکھا؟ نزولِ قرآن کے وقت ان میں سے بہت سے آثار موجود تھے اور بعض اب بھی باقی ہیں۔ {’’ اَفَلَمْ يَسِيْرُوْا ‘‘} کی وضاحت کے لیے دیککھیے سورۂ روم (۹) اور سورۂ مومن (۲۱)۔ ¤ ➋ {دَمَّرَ اللّٰهُ عَلَيْهِمْ: ’’ دَمَّرَ ‘‘} ہلاک کر دیا۔ {’’اَلدَّمَارُ‘‘} ہلاکت۔ {’’ دَمَّرَ ‘‘} خود بھی متعدی ہے، اصل میں {’’دَمَّرَهُمُ اللّٰهُ‘‘} تھا کہ اللہ تعالیٰ نے انھیں ہلاک کر دیا۔ مگر {’’ عَلَيْهِمْ ‘‘} لانے سے ہلاک کرنے میں مبالغے کا اظہار مقصود ہے : {’’ أَيْ أَلْقٰي عَلَيْهِمُ الدَّمَارَ ‘‘} یعنی اللہ تعالیٰ نے ان پر ہلاکت اور تباہی ڈال دی۔ ¤ ➌ {وَ لِلْكٰفِرِيْنَ اَمْثَالُهَا:’’ اَمْثَالُهَا ‘‘} میں ضمیر{’’هَا‘‘ ’’ عَاقِبَةُ ‘‘} کی طر ف لوٹ رہی ہے۔ {’’أَمْثَالٌ‘‘} کو جمع اس لیے لایا گیا ہے کہ اللہ تعالیٰ کے پاس اس جیسے بے شمار عذاب موجود ہیں۔ {’’ اَفَلَمْ يَسِيْرُوْا ‘‘} کے دو مطلب ہو سکتے ہیں، ایک یہ کہ پہلی قوموں نے پیغمبروں کو جھٹلایا اور سرکشی کی راہ اختیار کی تو اللہ تعالیٰ نے مختلف قسم کے عذاب بھیج کر انھیں تباہ و برباد کر دیا اور ان موجودہ کافروں کے لیے بھی سرکشی اختیار کرنے کی صورت میں اس جیسے بے شمار عذاب تیار ہیں۔ دوسرا مطلب یہ ہے کہ اللہ تعالیٰ نے گزشتہ اقوام پر رسولوں کی نافرمانی کی پاداش میں دنیا میں تباہی اور بربادی نازل کی، جس کا سبب ان کا کفر تھا اور ان کافروں کے لیے دنیا کے علاوہ آخرت میں بھی ایسے کئی عذاب تیار ہیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {ذٰلِكَ بِاَنَّ اللّٰهَ مَوْلَى الَّذِيْنَ اٰمَنُوْا … :} یعنی کافروں پر ہلاکت نازل کرنے کا باعث یہ ہے کہ اللہ تعالیٰ ایمان والوں کا مدد گار ہے اور کافروں کا کوئی مددگار نہیں جو انھیں ہلاکت سے بچا سکے۔ جب جنگِ اُحد میں ابوسفیان نے اپنی عارضی فتح پر مغرور ہو کر نعرہ لگایا : {’’ إِنَّ لَنَا الْعُزَّي وَلاَ عُزَّي لَكُمْ ‘‘} (ہماری مددگار عزیٰ ہے اور تمھارا کوئی بھی مدد گار نہیں) تو رسول اللہ صلی اللہ علیہ وسلم نے جواب میں یہ کہنے کا حکم دیا: [ اَللّٰهُ مَوْلَانَا وَلَا مَوْلٰی لَكُمْ ] [ بخاري، الجہاد، باب ما یکرہ من التنازع … : ۳۰۳۹ ] ’’اللہ ہمارا مددگار ہے اور تمھارا کوئی مدد گار نہیں۔‘‘ یہ جواب اسی آیت سے ماخوذ ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { اِنَّ اللّٰهَ يُدْخِلُ الَّذِيْنَ اٰمَنُوْا … :} دنیا میں پہلی قوموں پر آنے والے عذابوں کا اور ایمان والوں کی نصرت کا ذکر فرمانے کے بعد آخرت میں دونوں کا انجام ذکر فرمایا۔ چونکہ مومن اپنے ایمان اور عمل صالح کے تقاضوں کے پابند رہے، انھوں نے دنیا کی نعمتوں اور لذتوں سے فائدہ اپنی مرضی اور خواہش کے مطابق نہیں بلکہ اللہ تعالیٰ کے احکام کا پابند رہ کر اٹھایا۔ وہی کھایا اور پہنا جو ان کے رب نے ان کے لیے حلال فرمایا، وہ تمام حرام کردہ اشیاء سے بچے۔ شراب، ریشم اور سونے کے استعمال سے پرہیز کرتے رہے۔ زنا، چوری، دوسرے کا حق کھانے، غرض ہر معصیت سے اجتناب کیا۔ ان کی لذتیں اٹھانے کی بے شمار حسرتیں ان کے دل میں رہ گئیں اور انھوں نے یہاں ایک قیدی کی سی زندگی گزاری، جو صرف انھی سہولتوں سے فائدہ اٹھا سکتا ہے جو انھیں قید کرنے والا مہیا کرے۔ اس کے صلے میں اللہ تعالیٰ انھیں عظیم الشان باغات میں داخل کرے گا جن کے تلے نہریں بہتی ہیں اور فرمائے گا کہ یہاں تمھارے دل کی ہر خواہش اور ہر طلب پوری ہو گی، بلکہ وہ کچھ ملے گا جو نہ تمھاری آنکھوں نے دیکھا نہ کانوں نے سنا اور نہ ہی کسی انسان کے دل میں اس کا خیال ہی آیا۔ یاد رہے کہ اللہ تعالیٰ نے یہاں اور اکثر جگہ باغات اور نہروں ہی کا ذکر فرمایا ہے، اس لیے کہ دنیا کے مکانوں اور کوٹھیوں کا ایک حصہ گھر کے چمن پر مشتمل ہوتا ہے، اس لیے کہ پودوں، چشموں اور نہروں سے انسان کو فطری طور پر محبت ہے، مگر اصل مکان ان سے کہیں وسیع، خوبصورت اور قیمتی ہوتا ہے۔ مطلب یہ ہے کہ ان مکانات اور ان میں موجود رہنے سہنے، کھانے پینے، بیوی بچوں اور دوسری بے شمار اشیاء کی عظمت و شوکت کا اندازہ ان باغوں اور نہروں سے لگا لو جو بطورِ چمن ان مکانوں کے ساتھ ہیں۔ ¤ ➋ {وَ الَّذِيْنَ كَفَرُوْا يَتَمَتَّعُوْنَ وَ يَاْكُلُوْنَ كَمَا تَاْكُلُ الْاَنْعَامُ:} ایمان والوںں کے برعکس کفار کھانے پینے اور دنیا کی لذتیں اٹھانے میں کسی پابندی کی پروا نہیں کرتے، انھیں حلال و حرام، اپنے یا دوسرے کے حق سے کوئی غرض نہیں، وہ خنزیر، مردار اور ہر حرام چیز کھاتے، شراب پیتے، زنا کرتے غرض دل کا ہر ارمان پورا کرتے ہیں۔ یہ الگ بات ہے کہ مہیا نہ ہو سکنے کی وجہ سے وہ کسی لذت سے فائدہ نہ اٹھا سکیں، کیونکہ دنیا میں ہر شخص کو اتنا ہی ملتا ہے جو مالک نے لکھ دیا ہے، مگر اپنی حسرتیں پوری کرنے میں وہ کوئی کسر باقی نہیں رہنے دیتے۔ دنیا ان کے لیے جنت ہے جہاں وہ ہر قید اور پابندی سے آزاد زندگی گزار رہے ہیں۔ ان کاحال ہو بہو جانوروں جیسا ہے جو کھانے پینے، رہنے سہنے اور اپنی جنسی خواہش کی تکمیل میں کسی قید کے پابند نہیں ہیں، ان میں سے ہر طاقتور کمزور سے اس کا حق بھی چھین لیتا ہے۔ انھیں نہ عاقبت یاد ہے نہ باز پرس کی کوئی فکر ہے ۔ ¤ ➌ {وَ النَّارُ مَثْوًى لَّهُمْ:} چونکہ انھوں نے اپنے رب سے کفر کیا، نہ ایمان لائے نہ عمل صالح کیا، نہ اس کے احکام کی پابندی کی، اس لیے ان کا مستقل ٹھکانا آگ ہے۔ ¤ ➍ بعض لوگ اس آیت کا مطلب یہ بیان کرتے ہیں کہ جانور کھڑے ہو کر کھاتے پیتے ہیں، اس لیے کھڑے ہو کر کھانا پینا منع ہے، مگر اس مقصد کے لیے اس آیت کے بجائے احادیث سے استدلال کرنا چاہیے اور اس مسئلے میں اتنی ہی سختی کرنی چاہیے جتنی احادیث سے ثابت ہے، کیونکہ ضرورت کے وقت سنت سے اس کی اجازت بھی ثابت ہے۔ ¤ ➎ چونکہ جانوروں کی ساری جدوجہد ہی کھانے پینے کے لیے ہوتی ہے اس لیے رسول اللہ صلی اللہ علیہ وسلم نے ان کی مشابہت سے بچنے کے لیے کم کھانے پر زور دیا ہے۔ عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْمُؤْمِنُ يَأْكُلُ فِيْ مِعًی وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِيْ سَبْعَةِ أَمْعَاءٍ] [ بخاري، الأطعمۃ، باب المؤمن یأکل في معی واحد …: ۵۳۹۳ ] ’’مومن ایک آنت میں کھاتا ہے اور کافر سات آنتوں میں کھاتا ہے۔‘‘ اور مقدام بن معدیکرب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا مَلَأَ آدَمِيٌّ وِعَاءً شَرًّا مِنْ بَطْنٍ، بِحَسْبِ ابْنِ آدَمَ أُكُلاَتٌ يُقِمْنَ صُلْبَهُ، فَإِنْ كَانَ لَا مَحَالَةَ فَثُلُثٌ لِطَعَامِهِ وَثُلُثٌ لِشَرَابِهِ وَثُلُثٌ لِنَفَسِهِ ] [ ترمذي، الزھد، باب ما جاء في کراھیۃ کثرۃ الأکل : ۲۳۸۰، و قال الألباني صحیح ] ’’کسی آدمی نے پیٹ سے برا برتن نہیں بھرا۔ ابنِ آدم کو چند لقمے کافی ہیں جو اس کی پیٹھ کو سیدھا رکھیں۔ سو اگر کوئی چارہ نہیں تو تیسرا حصہ اس کے کھانے کے لیے، تیسرا اس کے پینے کے لیے اور تیسرا سانس کے لیے ہے۔‘‘ جس طرح شریعت نے ہر بات میں انسانی فطرت کا خیال رکھا ہے اسی طرح یہاں بھی اگر کبھی پیٹ بھر کر کھا لے تو اس کی گنجائش ہے، جیسا کہ ابوہریرہ رضی اللہ عنہ کا رسول اللہ صلی اللہ علیہ وسلم کے بار بار اصرار پر دودھ پینا ہے، حتیٰ کہ انھیں کہنا پڑا کہ اب میرے پیٹ میں اس کی گنجائش نہیں۔ [ دیکھیے بخاري، الرقاق، باب کیف کان عیش النبي صلی اللہ علیہ وسلم … : ۶۴۵۲ ]"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ {وَ كَاَيِّنْ مِّنْ قَرْيَةٍ هِيَ اَشَدُّ قُوَّةً …:} اس کا عطف {’’ اَفَلَمْ يَسِيْرُوْا فِي الْاَرْضِ فَيَنْظُرُوْا ‘‘} پر ہے، درمیان میں بات سے بات نکلتی گئی ہے، دوبارہ پھر وہی سلسلۂ کلام شروع فرمایا ہے۔ اس میں کفارِ مکہ کے لیے وعید اور رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی ہے کہ اہلِ مکہ جنھوں نے آپ کو اپنی بستی سے نکلنے پر مجبور کر کر دیا، اپنی قوت و شوکت پر مغرور نہ ہوں اور آپ ان کی قوت دیکھ کر دل برداشتہ نہ ہوں، ان بے چاروں کی کیا حیثیت ہے۔ ان سے پہلے کتنی ہی بستیاں تھیں جو قوت میں ان سے کہیں زیادہ تھیں، ہم نے انھیں ہلاک کر دیا، پھر ان کی مدد کرنے والا کوئی نہ تھا۔ دیکھیے سورۂ روم (۹، ۱۰) اور سورۂ مومن (۲۱)۔ ¤ ➋ { ’’ قَرْيَةٍ ‘‘} سے مراد قریہ والے ہیں، جیسا کہ یوسف علیہ السلام کے بھائیوں نے اپنے والد ماجد سے کہا : « وَ سْـَٔلِ الْقَرْيَةَ الَّتِيْ كُنَّا ففِيْهَا وَ الْعِيْرَ الَّتِيْۤ اَقْبَلْنَا فِيْههَا » [ یوسف:۸۲ ] ’’اور اس بستی سے پوچھ لے جس میں ہم تھے اور اس قافلے سے بھی جس میں ہم آئے ہیں۔‘‘ اس لیے آگے {’’أَهْلَكْنَا هَا‘‘} کے بجائے {’’ اَهْلَكْنٰهُمْ ‘‘} (ہم نے انھیں ہلاک کر دیا) فرمایا، یعنی اس بستی والوں کو ہلاک کر دیا۔ پوری بستی کو نکالنے والا قرار دینے میں ناراضی کا اظہار ہے، کیونکہ کچھ نکالنے والے تھے اور کچھ خاموش رہ کر ان کا ساتھ دینے والے، جیسا کہ قومِ عاد کے متعلق فرمایا : « فَكَذَّبُوْهُ فَعَقَرُوْهَا » [الشمس: ۱۴] ’’تو انھوں نے اسے جھٹلا دیا، پس اس (اونٹنی) کی کونچیں کاٹ دیں۔‘‘ حالانکہ اونٹنی کو کاٹنے والا تو ایک ہی شخص تھا۔ ¤ ➌ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو یہ تسلی اس لیے بھی دی کہ آپ صلی اللہ علیہ وسلم کو مکہ سے نکلنے کا شدید رنج اور صدمہ تھا۔ عبد اللہ بن عدی بن حمراء الزہری رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو {’’حزوَرَه‘‘} مقام پر کھڑے ہوئے دیکھا، آپ صلی اللہ علیہ وسلم نے فرمایا: [ وَاللّٰهِ! إِنَّكِ لَخَيْرُ أَرْضِ اللّٰهِ وَأَحَبُّ أَرْضِ اللّٰهِ إِلَی اللّٰهِ وَ لَوْ لَا أَنِّيْ أُخْرِجْتُ مِنْكِ مَا خَرَجْتُ ] [ ترمذي، المناقب، باب في فضل مکۃ: ۳۹۲۵، و قال الألباني صحیح ] ’’ اللہ کی قسم! تو اللہ کی زمین میں سب سے بہتر ہے اور اللہ کی زمین میں سے اللہ کے ہاں سب سے زیادہ محبوب ہے اور اگر یہ بات نہ ہوتی کہ مجھے تجھ سے نکال دیا گیا تو میں نہ نکلتا۔‘‘"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ {اَفَمَنْ كَانَ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّهٖ … :} اس آیت میں مومن و کافر کے درمیان ایک اور فرق بیان فرمایا ہے جس کی بنا پر اللہ تعالیٰ ایمان اور عمل صالح والوں کو جنت میں داخل فرمائے گا اور کفر کرنے والوں کا ٹھکانا آگ ہو گا۔ {’’ بَيِّنَةٍ مِّنْ رَّبِّهٖ ‘‘} ( اپنے رب کی طرف سے دلیل) سے مراد ایک تو انسانی فطرت میں رکھی ہوئی اللہ تعالیٰ کی معرفت اور اس کی توحید ہے اور اس کے ساتھ اللہ تعالیٰ کی نازل کردہ کتاب سے حاصل ہونے والی ہدایت اور علم ہے جس کی وجہ سے مومن کو اپنے حق پر ہونے کا پورا یقین ہوتا ہے۔ وہ زندہ رہتا ہے تو اس یقین کے ساتھ کہ میں حق پر ہوں اور دشمن کے مقابلے میں لڑتا اور شہید ہوتا ہے تو اسی یقین کے ساتھ۔ وہ جس راستے پر چل رہا ہے اس کی رات بھی دن کی طرح روشن ہے۔ فرمایا کیا یہ شخص اس شخص کی طرح ہو سکتا ہے جس کے لیے اس کے برے اعمال خوش نما بنا دیے گئے ہیں، حتیٰ کہ رسول اور مسلمانوں کو ان کے گھروں سے نکالنا بھی اسے اچھا کام نظر آتا ہے اور وہ وحی اور ہدایت کے نور سے منہ موڑ کر کفر و شرک اور اندھا دھند اپنی خواہش کی پیروی کی راہ پر چل نکلا ہے جس سے اس کا نورِ فطرت بھی بجھ چکا ہے؟ جواب ظاہر ہے کہ یہ دونوں ہر گز برابر نہیں ہو سکتے۔ تو ظاہر ہے کہ ان کا انجام بھی کسی صورت ایک جیسا نہیں ہو سکتا۔ یہ بات اللہ تعالیٰ نے متعدد مقامات پر بیان فرمائی ہے، دیکھیے سورۂ رعد (۱۹)، سورۂ ص (۲۸) اور سورۂ جاثیہ (۲۱)۔ ¤ ➋ احسن التفاسیر میں ہے: ’’حاصل مطلب ان آیتوں کا یہ ہے کہ جو لوگ خالص اللہ کی عبادت کرتے ہیں ان کے پاس یہ سند (بینہ اور دلیل) ہے کہ انسان کو اور انسان کی سب ضرورتوں کو اس طرح اللہ تعالیٰ نے پیدا کیا ہے کہ اس میں کوئی اس کا شریک نہیں ہے تو لائق تعظیم و عبادت بھی وہی وحدہٗ لا شریک لہ ہے اور جو لوگ اللہ کی عبادت میں غیروں کو شریک کرتے ہیں ان کے پاس کوئی شرعی یا عقلی دلیل نہیں ہے۔ بت پرستی جیسی بری چیز کو شیطان نے ان کی نظر میں اچھا کرکے دکھا دیا ہے، اس لیے وہ لوگ اسی شیطانی وسوسے کے سبب اپنی خواہش پر چلتے ہیں۔ اسی کو {’’ وَ اتَّبَعُوْۤا اَهْوَآءَهُمْ ‘‘} فرمایا۔‘‘ (مختصراً) ¤ ➌ { ’’ كَمَنْ زُيِّنَ لَهٗ سُوْٓءُ عَمَلِهٖ ‘‘} (اس کے لیے اس کے برے اعمال مزین کر دیے گئے) میں برے اعمال مزین کرنے والے کا ذکر مجہول رکھا ہے، کیونکہ آدمی کے لیے اس کے اعمال بد کو مزین کرنے والی بہت سی چیزیں ہوتی ہیں جن میں اس کی خواہش نفس بھی ہے، انسانی اور جنی شیطان بھی اور اس کے اعمالِ بد کی نحوست بھی۔ فعل مجہول (مزین کر دیے گئے) میں مزین کرنے والی یہ سب اشیاء آ جاتی ہیں۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { مَثَلُ الْجَنَّةِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَ… : ’’ مَثَلُ ‘‘} کا معنی یہاں حالل یا صفت ہے۔ اس سے پہلے مومنوں کو جنتوں میں داخل کرنے کا ذکر فرمایا، جن کے تلے نہریں بہتی ہیں اور کفار کا ٹھکانا آگ بیان فرمایا۔ اب اس جنت اور جہنم کا کچھ مزید حال بیان فرمایا، خصوصاً جنت کی نہروں کا، کیونکہ قرآن مجید میں اکثر جنت کے ساتھ اس کی نہروں کا ذکر بھی آتا ہے۔ اس آیت میں جنت کی چار قسم کی نہروں کا ذکر فرمایا ہے۔ واضح رہے کہ جنت کی تمام نہروں کا سرچشمہ عرش کے نیچے جنت الفردوس ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فَإِذَا سَأَلْتُمُ اللّٰهَ فَسَلُوْهُ الْفِرْدَوْسَ، فَإِنَّهُ أَوْسَطُ الْجَنَّةِ  وَأَعْلَی الْجَنَّةِ، وَ فَوْقَهُ عَرْشُ الرَّحْمٰنِ، وَمِنْهُ تَفَجَّرُ أَنْهَارُ الْجَنَّةِ ] [ بخاري، التوحید، باب : « و کان عرشہ علی الماء»… : ۷۴۲۳ ] ’’تو جب تم اللہ تعالیٰ سے سوال کرو تو فردوس کا سوال کرو، کیونکہ وہ جنت کا افضل اور جنت کا سب سے بلند مقام ہے اور اس سے اوپر رحمان کا عرش ہے اور اسی سے جنت کی نہریں پھوٹتی ہیں۔‘‘ اور معاویہ بن حیدہ قشیری رضی اللہ عنہ بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ فِي الْجَنَّةِ بَحْرَ الْمَاءِ وَ بَحْرَ الْعَسَلِ وَبَحْرَ اللَّبَنِ وَبَحْرَ الْخَمْرِ ثُمَّ تُشَقَّقُ الْأَنْهَارُ بَعْدُ ] [ ترمذي، صفۃ الجننۃ، باب ما جاء في صفۃ أنھار الجنۃ : ۲۵۷۱، و قال الترمذي و الألباني صحیح ] ’’جنت میں پانی کا سمندر ہے اور شہد کا سمندر ہے اور دودھ کا سمندر ہے اور شراب کا سمندر ہے، پھر بعد میں نہریں پھوٹتی ہیں۔‘‘ ¤ ➋ { فِيْهَاۤ اَنْهٰرٌ مِّنْ مَّآءٍ غَيْرِ اٰسِنٍ: ’’ اٰسِنٍ ‘‘ ’’أَسِنَ يَأْسَنُ‘‘} سے اسم فاعل ہے، جس طرح {’’أَمِنَ يَأْمَنُ‘‘} سے {’’آمِنٌ‘‘} اسم فاعل ہے۔ یہ باب {’’ضَرَبَ‘‘} اور {’’ نَصَرَ‘‘} کے وزن پر بھی آتا ہے : {’’أَيْ مُتَغَيَّرُ اللَّوْنِ وَالرِّيْحِ وَالطَّعْمِ‘‘} ’’جس کا رنگ، بو اور ذائقہ بدلا ہوا ہو۔‘‘ یعنی جنت میں ایسے پانی کی نہریں ہیں جو ایسا صاف ہے کہ اس کے ذائقے یا رنگ یا بو میں کبھی کوئی تبدیلی نہیں آتی، بخلاف دنیا کے پانی کے جو کچھ عرصہ گزرنے پر اپنے رنگ، ذائقہ اور بو کی صفائی کھو بیٹھتا ہے، اس پر کائی آ جاتی ہے، گرد و غبار کے ساتھ گندا ہو جاتا ہے اور اس میں پیدا ہونے والے جراثیم اور دوسری چیزیں اسے پینے کے قابل نہیں چھوڑتیں۔ ¤ ➌ { وَ اَنْهٰرٌ مِّنْ لَّبَنٍ لَّمْ يَتَغَيَّرْ طَعْمُهٗ:} دنیا میں جانوروں کے تھنوں سے جو دودھ نکلتا ہے اس میں کچھ تو تھنوں کی آلائش کی آمیزش ہو جاتی ہے اور کچھ دوہنے والے کے ہاتھوں اور ماحول کے گرد و غبار کی، پھر اگر دودھ کچھ دیر پڑا رہے تو پھٹ جاتا ہے، اس کا ذائقہ ترش اور بد مزہ ہو جاتا ہے اور اس میں سے بدبو آنے لگتی ہے۔ جنت میں دودھ تھنوں سے نہیں نکلے گا بلکہ پانی کی طرح چشموں سے رواں ہو گا اور اپنی اصلی حالت میں بدستور قائم رہے گا، اس کے ذائقے میں کوئی تبدیلی نہیں آئے گی۔ ¤ ➍ { وَ اَنْهٰرٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشّٰرِبِيْنَ: ’’ لَذَّةٍ ‘‘ ’’لَذٌّ‘‘} کی مؤنث ہے، کیونکہ یہ {’’ خَمْرٍ ‘‘} کی صفت ہے جو مؤنث سماعی ہے۔ {’’ لَذٌّ‘‘} اور {’’لَذِيْذٌ‘‘} دونوں صفت مشبّہ ہیں اور دونوں کا معنی ایک ہے۔ دنیا میں لوگ شراب صرف اس سرور کے لیے پیتے ہیں جو اس کے پینے سے حاصل ہوتا ہے اور وہ اس سرور کی خاطر شراب کی ان تمام قباحتوں کو برداشت کرتے ہیں جو اس میں پائی جاتی ہیں، جن میں سے چند یہ ہیں کہ وہ نہایت بدبو دار ہوتی ہے، تلخ اور بدذائقہ ہوتی ہے۔ اس کے پینے سے آدمی عقل کھو بیٹھتا ہے، الٹیاں آتی ہیں اور جب نشہ ٹوٹتا ہے تو سر چکرانا اور درد شروع ہو جاتا ہے۔ جنت کی شراب میں دنیا کی شراب کی کوئی خرابی نہیں ہو گی، نہ درد سر، نہ چکر، نہ بدبو اور نہ ذائقے کی تلخی، بلکہ وہ نہایت لذیذ ہو گی اور فرحت و سرور لائے گی، عقل پر پردہ یا کوئی اور خرابی نہیں لائے گی۔ ¤ ➎ { وَ اَنْهٰرٌ مِّنْ عَسَلٍ مُّصَفًّى:} دنیا کا شہد مکھی کے پیٹ سے نکلتا ہے، اسے حاصل کرتے وقت مکھیوں اور اس کے بچوں کے کچھ اجزا، موم، گرد و غبار اور تنکے وغیرہ لازماً شامل ہو جاتے ہیں، پھر دیر تک پڑا رہنے سے کھٹا ہو جاتا ہے، اس میں خمیر پیدا ہو جاتا ہے۔ غرض اس کے پوری طرح صاف ہونے اور رہنے کی کوئی صورت ہی نہیں، جب کہ جنت کی نہروں کا شہد مکھیوں کے پیٹ کا مرہونِ منت نہیں بلکہ براہ راست شہد کے سمندر سے نکل کر ہر جنتی کے گھر پہنچتا ہے اور ہمیشہ نہایت صاف شفاف اور ہر قسم کی کدورت سے پاک رہتا ہے۔ ¤ صاحب احسن التفاسیر لکھتے ہیں : ’’اگرچہ جنت میں کھانے پینے، پہننے، برتنے کی جتنی چیزیں ہیں ان کے فقط نام دنیا کی چیزوں سے ملتے ہیں، لیکن جنت کی چیزوں اور دنیا کی چیزوں میں بڑا فرق ہے۔ مثلاً دنیا میں ایسا دودھ کہاں ہے جس کی ہمیشہ نہر بہتی ہو اور پھر دوسرے دن ہی وہ کھٹا نہ ہو جائے۔ وہ شہد کہاں ہے جس کی نہر بہتی ہو اور مکھیوں کی بھنکار اس میں جم جم کر نہ مرے اور ہوا سے خاک اور کوڑا کرکٹ اس پر نہ پڑے۔ وہ شراب کہاں ہے جس کی نہر ہو اور بدبو کے سبب اس نہر کے آس پاس کا راستہ کچھ دنوں میں بند نہ ہو جائے۔‘‘ ¤ ➏ { وَ لَهُمْ فِيْهَا مِنْ كُلِّ الثَّمَرٰتِ:} پینے کی چیزوں کے بعد کھانے کی چیزوں کا اختصار کے ساتھ ذکر فرمایا اور ان میں سے بھی اناج وغیرہ کے بجائے پھلوں کا ذکر فرمایا، کیونکہ جنت کے کھانے بھوک مٹانے کے لیے نہیں بلکہ محض لذت کے لیے ہوں گے، فرمایا: « اِنَّ لَكَ اَلَّا تَجُوْعَ فِيْهَا وَ لَا تَعْرٰى » [طٰہٰ: ۱۱۸] ’’بے شک تیرے لیے یہ ہے کہ تو اس میں نہ بھوکا ہو گا اور نہ ننگا ہوگا۔ ‘‘ اور لذت میں پھلوں کا مقام سب جانتے ہیں۔ ¤ ➐ {وَ مَغْفِرَةٌ مِّنْ رَّبِّهِمْ: ’’ مَغْفِرَةٌ ‘‘} میں تنوین تعظیم کے لیے ہے، اس لیے ترجمہ ’’بڑی یا عظیم مغفرت‘‘ ہو گا۔ اور اللہ تعالیٰ کی بہت بڑی نعمت یہ ہو گی کہ انھیں عظیم مغفرت سے نوازا جائے گا۔ {’’غَفَرَ يَغْفِرُ‘‘} کا اصل معنی پردہ ڈالنا ہے، یعنی جنت میں ان کے گناہوں پر ان کے رب کی طرف سے ایسا عظیم پردہ ڈالا جائے گا کہ ان کا ذکر تک ان کے سامنے نہیں آئے گا کہ وہ کہیں شرمندہ نہ ہوں۔ ¤ ➑ { كَمَنْ هُوَ خَالِدٌ فِي النَّارِ:} یہ مبتدا محذوف کی خبر ہے جو پچھلی آیت : « اَفَمَنْ كَانَ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّهٖ كَمَنْ زُيِّنَ لَهٗ سُوْٓءُ عَمَلِهٖ وَ اتَّبَعُوْۤا اَهْوَآءَهُمْ» سے سمجھ میں آ رہا ہے : {’’ أَيْ أَفَممَنْ هُوَ مِنْ أَهْلِ هٰذِهِ الْجَنَّةِ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ‘‘} ’’یعنی تو کیا وہ شخص جو ان اوصاف والی ی جنت والوں میں سے ہے اس شخص کی طرح ہو سکتا ہے جو ہمیشہ آگ میں رہنے والا ہے؟‘‘ ¤ ➒ { وَ سُقُوْا مَآءً حَمِيْمًا:} اور جنھیں کھولتا ہوا پانی پلایا جائے گا۔ اس سے پہلے جملے {’’ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ ‘‘} میں لفظ {’’مَنْ‘‘} کے مفرد ہونے کی وجہ سے اس کے ساتھ واحد کا صیغہ {’’ هُوَ ‘‘} استعمال ہوا ہے اور اس جملے میں {’’مَنْ‘‘} کے معنی کے عام ہونے کو ملحوظ رکھتے ہوئے جمع کا صیغہ {’’ سُقُوْا ‘‘} استعمال ہوا ہے۔ ¤ ➓ { فَقَطَّعَ اَمْعَآءَهُمْ: ’’قَطَعَ يَقْطَعُ قَطْعًا‘‘} (ف) کاٹنا۔{ ’’ قَطَّعَ يُقَطِّعُ تَقْطِيْعًا ‘‘} (تفعیل) میں مبالغہ ہے، ٹکڑے ٹکڑے کرنا۔ {’’ اَمْعَآءَهُمْ ‘‘ ’’مِعًي‘‘} کی جمع ہے جو اصل میں {’’مِعَيٌ‘‘} بروزن {’’عِنَبٌ‘‘} ہے۔ یاء پر ضمہ ثقیل ہونے کی وجہ سے گرا دیا، یاء اور نونِ تنوین دو ساکن جمع ہونے کی وجہ سے یاء کو گرا دیا تو {’’مِِعًي‘‘} ہو گیا، جس کا تثنیہ {’’مِعَيَانِ‘‘} اور {’’مِعَيَيْنِ‘‘} آتا ہے۔ اس جیسا ایک اور لفظ {’’ آنَاءٌ‘‘} ہے جو {’’ إِنًي‘‘} کی جمع ہے۔ {’’ آنَاءَ اللَّيْلِ وَالنَّهَارِ‘‘} ’’دن رات کی گھڑیاں۔‘‘ یعنی جہنمیوں کو انتہا درجے کا گرم کھولتا ہوا پانی پلایا جائے گا جو ان کی انتڑیوں کو ٹکڑے ٹکڑے کر دے گا۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { وَ مِنْهُمْ مَّنْ يَّسْتَمِعُ اِلَيْكَ:} مشرکین اور ان کے انجامِ بد کے ذکر کے بعد اہل کتاب کفار اور کفار کی بدترین قسم منافقین کا ذکر فرمایا جو آپ صلی اللہ علیہ وسلم کی مجلس میں حاضر ہوتے، آپ کی باتیں کان لگا کر سنتے، مگر ماننے کے لیے نہیں، بلکہ اپنی مفید مطلب باتیں ڈھونڈنے کے لیے، جن کے ساتھ وہ لوگوں کو اسلام سے بدظن کرتے۔ چونکہ ان کے دل و دماغ پر کفر حاوی تھا، قیامت پر ایمان وہ نہیں رکھتے تھے، اس لیے ان کے لیے رسول اللہ صلی اللہ علیہ وسلم کی باتیں اجنبی تھیں، ان کے دل میں وہ مفہوم بیٹھتا ہی نہیں تھا جو رسول اللہ صلی اللہ علیہ وسلم کی زبان سے ادا ہوتا تھا۔ وہ سمجھ ہی نہیں سکتے تھے کہ کوئی شخص ان کے خیال میں موہوم آخرت کے لیے اپنی دنیا کا نقصان بھی کر سکتا ہے۔ حقیقت یہ ہے کہ جس شخص کی ساری تگ و دو ہی دنیا کے لیے ہو وہ پیغمبروں کی بات سمجھ ہی نہیں سکتا، جیسا کہ شعیب علیہ السلام کی قوم نے کہا تھا: « يٰشُعَيْبُ مَا نَفْقَهُ كَثِيْرًا مِّمَّا تَقُوْلُ» [ھود : ۹۱] ’’اے شعیب! ہم اس میں سے بہت سی باتیں نہیں سمجھتے جو تو کہتا ہے۔‘‘ ¤ ➋ {حَتّٰۤى اِذَا خَرَجُوْا مِنْ عِنْدِكَ قَالُوْا لِلَّذِيْنَ اُوْتُوا الْعِلْمَ … : ’’ اُوْتُوا الْعِلْمَ ‘‘} سے مراد صحابہ کرام رضی اللہ عنھم ہیں، کیونکہ اللہ تعالیٰ نے انھیں اپنی ذات و صفات، اپنے پیغمبروں، اپنی کتابوں، اپنے فرشتوں، یوم آخرت اور تقدیر کے علم اور ان سب پر ایمان کی روشنی عطا فرما رکھی تھی۔ یعنی جب وہ آپ صلی اللہ علیہ وسلم کی مجلس سے نکلتے ہیں تو آپ کی باتوں کی تحقیر کرتے ہوئے اور ان کا مذاق اڑاتے ہوئے علم و ایمان سے آراستہ صحابہ کرام رضی اللہ عنھم سے کہتے ہیں کہ ہماری سمجھ میں تو کچھ نہیں آیا کہ ابھی ابھی اس نے کیا کہا ہے، کیا آپ لوگوں کی سمجھ میں کچھ آیا ہے ؟ ¤ ➌ { اُولٰٓىِٕكَ الَّذِيْنَ طَبَعَ اللّٰهُ عَلٰى قُلُوْبِهِمْ:} فرمایا ان کے نہ سمجھنے کی دو وجہیں ہیں، ایک تو یہ کہ ان کے کفر پر اصرار اور عناد کی وجہ سے اللہ نے ان کے دلوں پر مہر کر دی ہے، اس لیے وہ سمجھ سکتے ہی نہیں، جیسا کہ فرمایا: « وَّ قَوْلِهِمْ قُلُوْبُنَا غُلْفٌ بَلْ طَبَعَ  اللّٰهُ عَلَيْهَا بِكُفْرِهِمْ فَلَا يُؤْمِنُووْنَ اِلَّا قَلِيْلًا » [النساء: ۱۵۵] ’’اور ان کے یہ کہنے کی وجہ سے کہ ہمارے دل غلاف میں محفوظ ہیں، بلکہ اللہ نے ان پر ان کے کفر کی وجہ سے مہر کر دی تو وہ ایمان نہیں لاتے مگر بہت کم۔ ‘‘ ¤ ➍ {وَ اتَّبَعُوْۤا اَهْوَآءَهُمْ:} یہ نہ سمجھنے کی دوسری وجہ ہے کہ وہ کوئی عقلی دلیل سننے کے لیے تیار نہیں، بلکہ صرف وہ کام کرنا چاہتے ہیں جو ان کی خواہش کے مطابق ہوں اور مرضی کے خلاف وہ کوئی پابندی قبول کرنے کے لیے تیار نہیں ہیں۔ جب کسی کی یہ حالت ہو جائے تو فی الواقع اس کی خواہش کے خلاف کوئی بات اس کی سمجھ میں نہیں آتی، نہ ہی وہ اسے ماننے کے لیے تیار ہوتا ہے، خواہ وہ کتنی اچھی ہو۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {وَ الَّذِيْنَ اهْتَدَوْا زَادَهُمْ هُدًى …:} یعنی وہ لوگ جو اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے بتائے ہوئے سیدھے راستے پر چل پڑتے ہیں تو وہی باتیں ان کی ہدایت میں اضافے کا باعث بن جاتی ہیں جو منافقین کی سمجھ میں نہیں آتیں اور اللہ تعالیٰ ان کے ذریعے سے انھیں مزید ہدایت عطا فرماتا ہے اور انھیں ان کاموں کی توفیق عطا فرماتا ہے جن کے ذریعے سے وہ جہنم کی آگ سے بچ جاتے ہیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { فَهَلْ يَنْظُرُوْنَ اِلَّا السَّاعَةَ اَنْ تَاْتِيَهُمْ بَغْتَةً:} یعنی کون سی نصیحت اور کون سی وعید ہے جو انھیں نہیں سنائی گئی اور کون سی دلیل ہے جو ان کے سامنے پیش نہیں کی گئی، مگر وہ اتنے بدبخت ہیں کہ جب تک قیامت کو اپنی آنکھوں سے نہ دیکھ لیں ایمان لانے کے لیے تیار نہیں۔ اس لیے گویا اسی کا انتظار کر رہے ہیں کہ وہ اچانک ان کے سامنے آ کھڑی ہو، نہ پہلے علم ہونے کی وجہ سے اس پر ایمان لا سکیں نہ اس کی تیاری کر سکیں۔ ¤ ➋ { فَقَدْ جَآءَ اَشْرَاطُهَا:} یعنی جس قیامت کا انتظار کر رہے ہیں اس کے آنے میں دیر بھی کیا رہ گئی ہے، اس کی نشانیاں تو آ ہی چکی ہیں، اب اس کے آنے میں کیا شبہ باقی ہے؟ شاہ عبد القادر لکھتے ہیں: ’’بڑی نشانی قیامت کی ہمارے نبی صلی اللہ علیہ وسلم کا پیدا ہونا ہے۔ سب نبی خاتم النّبیین کی راہ دیکھتے تھے، جب وہ آ چکے تو قیامت ہی آنی رہ گئی ہے۔‘‘ (موضح) ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ بُعِثْتُ أَنَا وَالسَّاعَةُ كَهَاتَيْنِ ] [ بخاري، الرقاق، باب قول النبي صلی اللہ علیہ وسلم : ’’ بعثت أنا والساعۃ کھاتین… ‘‘ : ۶۵۰۵ ] ’’میں اور قیامت اس طرح بھیجے گئے ہیں جس طرح یہ دو انگلیاں ہیں۔‘‘ یعنی جس طرح شہادت کی انگلی اور درمیانی انگلی ایک دوسری سے ملی ہوئی ہیں اسی طرح قیامت میرے بعد متصل آ رہی ہے۔ قیامت کی بڑی نشانیوں میں سے شقِ قمر کی نشانی بھی رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں ظاہر ہو چکی تھی، جیسا کہ فرمایا: « اِقْتَرَبَتِ السَّاعَةُ وَ انْشَقَّ الْقَمَرُ» [ القمر : ۱ ] ’’قیامت بہت قریب آگئی اور چاند پھٹ گیا۔ ‘‘ آلوسی نے فرمایا : ’’ظاہر یہ ہے کہ ان نشانیوں سے وہی نشانیاں مراد ہیں جو اس آیت کے نزول کے وقت نمودار ہو چکی تھیں۔‘‘ ¤ ➌ {فَاَنّٰى لَهُمْ اِذَا جَآءَتْهُمْ ذِكْرٰىهُمْ: ’’ ذِكْرٰىهُمْ ‘‘} مبتدا ہے اور {’’ فَاَنّٰى لَهُمْ ‘‘} اسم استفہام خبر مقدم ہے۔ {’’ فَاَنّٰى لَهُمْ اِذَا جَآءَتْهُمْ ذِكْرٰىهُمْ ‘‘} (پھر جب وہ ان کے پاس آ گئی تو ان کے لیے ان کی نصیحت کیسے ممکن ہو گی)، {’’ اِذَا جَآءَتْهُمْ ‘‘} میں {’’جَاءَتْ‘‘} کا فاعل {’’ السَّاعَةَ ‘‘} کی ضمیر ہے۔ (التسہیل) یعنی جب ان کے پاس قیامت آ گئی تو نصیحت قبول کرنے یا مان لینے کا کوئی فائدہ نہیں ہو گا۔ یہی بات اس آیت میں بیان ہوئی ہے: « يَوْمَىِٕذٍ يَّتَذَكَّرُ الْاِنْسَانُ وَ اَنّٰى لَهُ الذِّكْرٰى» [ الفجرجر : ۲۳] ’’اس دن انسان نصیحت حاصل کرے گا اور ( اس وقت) اس کے لیے نصیحت کہاں۔‘‘ مزید دیکھیے سورۂ سبا (۵۱، ۵۲) اور سورۂ مومن (۸۴، ۸۵)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { فَاعْلَمْ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا اللّٰهُ:} اس فاء کو فصیحہ (اظہار کرنے والی) کہتے ہیں، یعنی اس سے اس شرط کا اظہار ہوتا ہے جو گزشتہ کلام سے معلوم ہوتی ہے۔ اس آیت کا تعلق سورت کی گزشتہ تمام آیات کے ساتھ ہے، یعنی جب تم کفار اور ایمان والوں کا حال جان چکے اور یہ بھی کہ بھلائی اور کامیابی کا دارومدار توحید اور اطاعت پر ہے اور برائی اور ناکامی کا دار ومدار شرک اور نافرمانی پر ہے تو یہ بات بھی جان لو کہ اللہ کے سوا کوئی عبادت کے لائق نہیں۔ (ابو السعود) ابوالعالیہ اور ابن عیینہ نے فرمایا کہ اس کا تعلق اس سے پہلی آیت کے ساتھ ہے، یعنی جب ان کے پاس قیامت آ گئی تو جان لو کہ اس کے قائم ہونے پر اللہ کے سوا بھاگنے یا پناہ حاصل کرنے کی کوئی جگہ نہیں (کیونکہ معبود برحق وہی ہے)۔ (بغوی) ¤ ➋ یہاں ایک سوال ہے کہ رسول اللہ صلی اللہ علیہ وسلم تو اس حقیقت کو پہلے ہی جانتے تھے کہ اللہ کے سوا کوئی عبادت کے لائق نہیں، جیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَتْقَاكُمْ وَ أَعْلَمَكُمْ بِاللّٰهِ أَنَا ] [ بخاري، الإیمان، باب قول النبي صلی اللہ علیہ وسلم : ’’ أنا أعلمکم باللّٰہ …‘‘ : ۲۰ ] ’’یقینا میں تم سب سے زیادہ اللہ تعالیٰ سے ڈرنے والا اور تم سب سے زیادہ اللہ تعالیٰ کا علم رکھنے والا ہوں۔‘‘ پھر یہ کہنے کا کیا مطلب ہے کہ ’’جان لو کہ اللہ کے سوا کوئی معبود نہیں۔‘‘ اہل علم نے اس کے متعدد جوابات دیے ہیں اور وہ سب درست ہیں۔ ایک یہ کہ {’’ فَاعْلَمْ ‘‘} کے مخاطب اگرچہ بظاہر رسول اللہ صلی اللہ علیہ وسلم ہیں مگر خطاب امت کے ہر فرد کو ہے۔ دلیل اس کی آیت کے آخری الفاظ ہیں جن میں صراحتاً سب کو مخاطب فرمایا ہے : «وَ اللّٰهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَ مَثْوٰىكُمْ » ’’اور اللہ تمھارے چلنے پھرنے کو اور تمھارے ٹھہرنے کو جانتا ہے۔‘‘ جیسا کہ سورۂ طلاق کے شروع میں فرمایا : « يٰۤاَيُّهَا النَّبِيُّ اِذَا طَلَّقْتُمُ النِّسَآءَ فَطَلِّقُوْهُنَّ لِعِدَّتِهِنَّ وَ اَحْصُوا الْعِدَّةَ وَ اتَّقُوا اللّٰهَ رَبَّكُمْ لَا تُخْرِجُوْهُنَّ مِنْۢ بُيُوْتِهِنَّ وَ لَا يَخْرُجْنَ اجْنَ اِلَّاۤ اَنْ يَّاْتِيْنَ بِفَاحِشَةٍ مُّبَيِّنَةٍ » [ الطلاق : ۱ ] ’’اے نبی! جب تم عورتوں کو طلاق دو تو انھیں ان کی عدت کے وقت طلاق دو اور عدت کو گنو اور اللہ سے ڈرو جو تمھارا رب ہے، نہ تم انھیں ان کے گھروں سے نکالو اور نہ وہ نکلیں مگر یہ کہ کوئی کھلی بے حیائی (عمل میں) لائیں۔‘‘ ¤ دوسرا جواب یہ ہے کہ {’’ فَاعْلَمْ ‘‘} کا معنی یہ ہے کہ {’’ لَاۤ اِلٰهَ اِلَّا اللّٰهُ ‘‘} کے علم پر ثابت اور قائم رہو، جیسا کہ فرمایا: « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اٰمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ وَ الْكِتٰبِ الَّذِيْ نَزَّلَ عَلٰى رَسُوْلِهٖ وَ الْكِتٰبِ الَّذِيْۤ اَنْزَلَ مِنْ قَبْلُ » [النساء: ۱۳۶] ’’اے لوگو جو ایمان لائے ہو! ایمان لاؤ اللہ پر اور اس کے رسول پر اور اس کتاب پر جو اس نے اپنے رسول پر نازل کی اور اس کتاب پر جو اس نے اس سے پہلے نازل کی۔‘‘ اکثر مفسرین نے یہاں {’’ فَاعْلَمْ ‘‘} کا یہی معنی بیان فرمایا ہے۔ تیسرا جواب یہ ہے کہ کسی حقیقت کے علم کی ابتدا اس کی معرفت سے ہوتی ہے کہ دل اسے جان لے، پھر اس کے یقین کا مرتبہ آتا ہے اور اس علم کی تکمیل اس سے ہوتی ہے کہ اس کے تقاضے کے مطابق عمل کرے۔ مطلب یہ ہے کہ {’’لا الٰه الا الله‘‘} کی معرفت اور اس کا یقین حاصل کرو اور اس کے تقاضوں پر عمل کرو۔ ظاہر ہے کہ علم اور یقین کے بے شمار درجے ہیں اور عمل کے لحاظ سے درجوں کا بھی کوئی شمار نہیں۔ ابراہیم علیہ السلام کا قول: « وَ لٰكِنْ لِّيَطْمَىِٕنَّ قَلْبِيْ » [البقرۃ: ۲۶۰] (اور لیکن اس لیے کہ میرا دل پوری تسلی حاصل کر لے) اس کی دلیل ہے۔ اسی لیے اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیا : « وَ قُلْ رَّبِّ زِدْنِيْيْ عِلْمًا » [طٰہٰ : ۱۱۴ ] ’’اور تو کہہ اے میرے رب! مجھے علم میں زیادہ کر۔‘‘ اور کہنے والے نے کیا خوب کہا ہے : ¤ چومی گویم مسلمانم بلرزم ¤ کہ دانم مشکلات لا الٰہ را ¤ ’’جب میں کہتا ہوں کہ میں مسلمان ہوں تو لرز جاتا ہوں، کیونکہ میں {’’لا الٰه‘‘} کی مشکلات کو جانتا ہوں۔‘‘ ¤ سورۂ نساء کی آیت (۱۳۶) : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اٰمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ » کا ایک معنی یہ بھی کیا گیا ہے کہ اپنے ایمان کے تقاضے کے مطابق عمل کرو۔ خلاصہ یہ کہ ہر لمحے {’’لا الٰه الا الله‘‘} کی معرفت، اس کے یقین اور اس پر عمل میں اضافے کی کوشش کرتے رہو۔ چوتھا یہ کہ ہر وقت اس حقیقت کو یاد اور نظر کے سامنے رکھو کہ اللہ کے سوا کوئی عبادت کے لائق نہیں، گویا {’’اِعْلَمْ‘‘} بمعنی {’’ اُذْكُرْ‘‘} ہے۔ ¤ ➌ اس آیت سے علم کی فضیلت ثابت ہوتی ہے، کیونکہ ہر قول اور عمل سے پہلے علم کا حصول لازم ہے، جیسا کہ فرمایا: «اِعْلَمُوْۤا اَنَّمَا الْحَيٰوةُ الدُّنْيَا لَعِبٌ وَّ لَهْوٌ » [ الحدید : ۲۰ ] ’’جان لو کہ دنیا کی زندگی اس کے سوا کچھ نہیں کہ ایک کھیل ہے۔‘‘ اس کے بعدفرمایا : « سَابِقُوْۤا اِلٰى مَغْفِرَةٍ مِّنْ رَّبِّكُمْ وَ جَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَآءِ وَ الْاَرْضِ » [ الحدید : ۲۱ ] ’’اپنے رب کی بخشش اور اس جنت کی طرف ایک دوسرے سے آگے بڑھو جس کی چوڑائی آسمان اور زمین کی چوڑائی کی طرح ہے۔‘‘ اور امام بخاری رحمہ اللہ نے صحیح بخاری میں فرمایا: {’’بَابُ الْعِلْمِ قَبْلَ الْقَوْلِ وَالْعَمَلِ لِقَوْلِ اللّٰهِ تَعَالٰي : « فَاعْلَمْ اَنَّهٗ لَاۤ ااِلٰهَ اِلَّا اللّٰهُ» فَبَدَأَ بِالْعِلْمِ‘‘} [ بخاري، العلم، قبل ح : ۶۸ ] ’’علم مقدم ہے قول اور عمل پر، کیونکہ اللہ تعالیٰ نے (سورۂ محمد میں) فرمایا : ’’پس تو جان لے کہ حقیقت یہ ہے کہ اللہ کے سوا کوئی معبود نہیں۔‘‘ اس آیت میں اللہ نے علم کو پہلے بیان کیا ہے۔‘‘ ¤ ➍ {وَ اسْتَغْفِرْ لِذَنْۢبِكَ :} قرآن مجید میں متعدد مقامات پر اللہ تعالیٰ نے استغفار کا حکم دیا ہے۔ رسول اللہ صلی اللہ علیہ وسلم ہمیشہ اللہ تعالیٰ کے اس حکم پر عمل کرتے رہے اور امت کو بھی اس کی تاکید فرماتے رہے۔ چنانچہ اس سے متعلق یہاں دو احادیث نقل کی جاتی ہیں، ابو موسیٰ اشعری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا کیا کرتے تھے: [ اَللّٰهُمَّ اغْفِرْ لِيْ خَطِيْئَتِيْ وَجَهْلِيْ وَ إِسْرَافِيْ فِيْ أَمْرِيْ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّيْ، اَللّٰهُمَّ اغْفِررْ لِيْ جِدِّيْ وَهَزْلِيْ وَخَطَئِيْ وَعَمْدِيْ وَكُلُّ ذٰلِكَ عِنْدِيْ، اَللّٰهُمَّ اغْفِرْ لِيْ مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّيْ، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلٰی كُلِّ شَيْءٍ قَدِيْرٌ ] [ مسلم، الذکر و الدعاء، باب في الأدعیۃ : ۲۷۱۹ ] ’’اے اللہ! میری خطا کو، میرے جہل کو، میرے کام میں میری زیادتی کو اور ان تمام گناہوں کو میرے لیے بخش دے جنھیں تو مجھ سے زیادہ جانتا ہے۔ اے اللہ! میرے سنجیدگی سے کیے ہوئے کاموں کو، میرے مذاق سے کیے ہوئے کاموں کو، میرے بھول کر کیے ہوئے اور جان بوجھ کر کیے ہوئے گناہوں کو میرے لیے بخش دے اور یہ سب میرے پاس موجود ہیں۔ اے اللہ! تو مجھے وہ سب گناہ بخش دے جو میں نے پہلے کیے اور جو میں نے بعد میں کیے اور جو چھپا کر کیے اور جو علانیہ کیے اور جنھیں تو مجھ سے زیادہ جاننے والا ہے۔ تو ہی آگے کرنے والا ہے اور تو ہی پیچھے کرنے والا ہے اور تو ہر چیز پر پوری طرح قادر ہے۔‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنا : [ وَاللّٰهِ! إِنِّيْ لَأَسْتَغْفِرُ اللّٰهَ وَ أَتُوْبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِيْنَ مَرَّةً ] [ بخاري، الدعوات، باب استغفار النبي صصلی اللہ علیہ وسلم في الیوم واللیلۃ:۶۳۰۷ ] ’’اللہ کی قسم! میں دن میں ستر (۷۰) بار سے زیادہ اللہ سے استغفار کرتا ہوں اور اس کی طرف توبہ کرتا ہوں۔‘‘ ¤ ➎ { وَ لِلْمُؤْمِنِيْنَ وَ الْمُؤْمِنٰتِ:} یہ حکم نبی صلی اللہ علیہ وسلم کو بھی ہے اور امت کے تمام افراد کو بھی کہ وہ اپنے علاوہ دوسرے تمام مومن مردوں اور عورتوں کے لیے بھی استغفار کریں۔ اس سے معلوم ہوا کہ ایمان والوں پر اپنے مومن بھائیوں کے لیے استغفار واجب ہے۔ پہلے جلیل القدر انبیاء علیھم السلام کا بھی یہی عمل رہا ہے، جیسا کہ نوح علیہ السلام نے دعا کی : «رَبِّ اغْفِرْ لِيْ وَ لِوَالِدَيَّ وَ لِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَّ لِلْمُؤْمِنِيْنَ وَ الْمُؤْممِنٰتِ وَ لَا تَزِدِ الظّٰلِمِيْنَ اِلَّا تَبَارًا » [ نوح : ۲۸ ] ’’اے میرے رب ! مجھے بخش دے اور میرے ماں باپ کو اور اس کو جو مومن بن کر میرے گھر میں داخل ہو اور ایمان والے مردوں اور ایمان والی عورتوں کو اور ظالموں کو ہلاکت کے سوا کسی چیز میں نہ بڑھا۔‘‘ اور ابراہیم علیہ السلام نے دعا کی : «رَبَّنَا اغْفِرْ لِيْ وَ لِوَالِدَيَّ وَ لِلْمُؤْمِنِيْنَ يَوْمَ يَقُوْمُ الْحِسَابُ » [ إبراہیم : ۴۱ ] ’’اے ہمارے رب! مجھے بخش دے اور میرے ماں باپ کو اور ایمان والوں کو، جس دن حساب قائم ہوگا۔‘‘ ¤ ➏ اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم اور تمام ایمان والوں کو مومن مردوں اور عورتوں کے لیے استغفار کا جب خود حکم دیا تو یہ دلیل ہے کہ وہ اسے قبول بھی فرمائے گا۔ ظاہر ہے کہ ہر مومن، مرد ہو یا عورت، زندہ ہو یا فوت شدہ، استغفار کی ان دعاؤں میں شامل ہے جو رسول اللہ صلی اللہ علیہ وسلم سے لے کر امت کے آخری آدمی نے ایمان والوں کے حق میں کی ہیں اور جس کے حق میں نبی کریم صلی اللہ علیہ وسلم اور اللہ تعالیٰ کے بے شمار مقبول بندوں کی مغفرت کی دعائیں ہوتی ہوں اس کی مغفرت سے ناامید ہونے کی کوئی وجہ نہیں۔ اس لیے کسی بھی مومن کے متعلق یہ کہنا درست نہیں کہ وہ جہنمی ہے، یا اللہ تعالیٰ اسے معاف نہیں کرے گا، خواہ وہ کتنا زیادہ گناہ گار ہو۔ شرط یہ ہے کہ وہ ایمان کی دولت اپنے دامن میں رکھتا ہو اور شرک کی نجاست سے آلودہ نہ ہو۔ ¤ ➐ { وَ اللّٰهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَ مَثْوٰىكُمْ: ’’ مُتَقَلَّبٌ‘‘} اور {’’مَثْوٰي‘‘ ’’ تَقَلَّبَ يَتَقَلَّبُ‘‘} (تفعل) اور {’’ ثَوَي يَثْوِيْ‘‘} (ض) سے مصدر میمی بھی ہو سسکتے ہیں اور ظرف مکان بھی ۔ پہلی صورت میں معنی ہے تمھارا چلنا پھرنا اور تمھارا ٹھہرنا اور دوسری صورت میں معنی ہے تمھارے چلنے پھرنے کی جگہ اور تمھارے ٹھہرنے کی جگہ۔ مطلب یہ ہے کہ اللہ تعالیٰ تمھاری نقل و حرکت کو اور تمھارے ٹھہرنے کو اور تمھارے چلنے پھرنے کے اور تمھارے ٹھہرنے کے مقامات کو خوب جانتا ہے۔ اس میں کفار اور نافرمانوں کے لیے وعید ہے اور اللہ کے فرماں بردار بندوں کے لیے بشارت ہے کہ اللہ تعالیٰ تمھاری جائز یا ناجائز ہر حرکت و سکون سے واقف ہے اور واقف ہونے کا مطلب ہی یہ ہے کہ وہ فرماں برداروں کو انعام دے گا اور نافرمانوں کو سزا دے گا۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { وَ يَقُوْلُ الَّذِيْنَ اٰمَنُوْا لَوْ لَا نُزِّلَتْ سُوْرَةٌ:} اس سے پہلے اللہ تعالیٰ نے منافقوں اور ایمان والوں کا حال ان آیات کو سننے کے وقت فرمایا جو توحید، قیامت اور دوسرے اعتقادی معاملات سے تعلق رکھتی ہیں۔ چنانچہ {’’ وَ مِنْهُمْ مَّنْ يَّسْتَمِعُ اِلَيْكَ ‘‘} میں منافقین کا حال بیان فرمایا اور {’’ وَ الَّذِيْنَ اهْتَدَوْا زَادَهُمْ هُدًى ‘‘} میں ایمان والوں کا حال بیان فرمایا۔ اب عمل سے تعلق رکھنے والی آیات مثلاً جہاد، نماز اور زکوٰۃ وغیرہ کے متعلق ان کا طرزِ عمل بیان فرمایا۔ وہ یہ کہ مخلص مومن ہمیشہ ایسے کاموں کے بارے میں وحی کے نزول کے منتظر اور امیدوار رہتے، تاکہ ان پر عمل کرکے زیادہ سے زیادہ اللہ تعالیٰ کا قرب حاصل کر سکیں، جب اس کے نزول میں تاخیر ہوتی تو کہتے کہ ایسی کوئی آیت یا سورت کیوں نازل نہیں کی گئی اور منافقین کا یہ حال تھا کہ جب مشقت والی ایسی کوئی سورت یا آیت اترتی تو ان پر بہت شاق گزرتی، خصوصاً جہاد کا ذکر آنے پر تو خوف اور دہشت کے مارے ان کی آنکھیں کھلی رہ جاتیں۔ ¤ ➋ { وَ يَقُوْلُ الَّذِيْنَ اٰمَنُوْا لَوْ لَا نُزِّلَتْ سُوْرَةٌ:} ہجرت کے بعد اگرچہ سورۂ حج کی آیت (۳۹) : « اُذِنَ لِلَّذِيْنَ يُقٰتَلُوْنَ بِاَنَّهُمْ ظُلِمُوْا » (ان لوگوں کو جن سے لڑائی کی جاتی ہے، اجازت دے دی گئی ہے، اس لیے کہ ان پر ظلم کیا گیا)کے ساتھ کفار سے قتال کی اجازت ہو چکی تھی، مگر اس کی فرضیت کا واضح حکم ابھی نہیں آیا تھا۔ مخلص مومن جو کفار کے ظلم و ستم سے شدید تنگ دل تھے اور فتح یا شہادت کے متمنی تھے، کہتے رہتے تھے کہ جہاد کے حکم والی کوئی سورت کیوں نازل نہیں کی گئی۔ ¤ ➌ { فَاِذَاۤ اُنْزِلَتْ سُوْرَةٌ مُّحْكَمَةٌ وَّ ذُكِرَ فِيْهَا الْقِتَالُ:} محکم سورت سے مراد ایسی سورت ہے جس میں دیا جانے والا حکم واضح ہو، جس میں کوئی تاویل نہ کی جا سکے اور نہ وہ منسوخ ہو۔ مراد اس سے یہی سورۂ محمد( صلی اللہ علیہ وسلم ) ہے جس کا نام سورۂ قتال بھی ہے، کیونکہ اس میں {’’جَاهِدُوْا‘‘} (جہاد کرو) یا {’’ قَاتِلُوْا ‘‘} (لڑو) کے بجائے قتال کا حکم {’’ فَضَرْبَ الرِّقَابِ ‘‘} کے بالکل صریح الفاظ کے ساتھ دیا گیا کہ کفار سے مڈ بھیڑ ہو تو ان کی گردنیں اڑا دو اور خوب خون ریزی کے بعد انھیں قیدی بناؤ وغیرہ۔ ¤ ➍ { رَاَيْتَ الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ … :} یعنی جب قتال کے واضح حکم والی سورت نازل کی گئی تو منافقین کا یہ حال ہوا۔ شاہ عبد القادر لکھتے ہیں : ’’مسلمان سورت مانگتے تھے، یعنی کافروں کی ایذا سے عاجز ہو کر آرزو کرتے کہ اللہ جہاد کا حکم دے تو جو ہم سے ہو سکے کر گزریں۔ جب جہاد کا حکم آیا تو منافق اور کچے لوگوں پر بھاری ہوا، خوف زدہ اور بے رونق آنکھوں سے پیغمبر کی طرف دیکھنے لگے کہ کاش! ہم کو اس حکم سے معاف رکھیں۔ بے حد خوف میں بھی آنکھ کی رونق نہیں رہتی، جیسے مرتے وقت آنکھوں کا نور جاتا رہتا ہے۔‘‘ (موضح) اس مضمون کی آیات کے لیے دیکھیے سورۂ نساء (۷۷) اور سورۂ احزاب (۱۹)۔ ¤ ➎ { فَاَوْلٰى لَهُمْ:} مفسرین نے اس لفظ کی مختلف تفسیریں کی ہیں جن میں سب سے واضح اور تکلف سے خالی یہ ہے کہ یہ {’’ وَلِيَ يَلِيْ وَلْيًا ‘‘} (س) سے اسم تفضیل ہے، جس کا معنی ہے زیادہ لائق، زیادہ قریب، بہتر۔ اب اس کی ترکیب دو طرح سے ہو سکتی ہے، ایک یہ کہ یہ مبتدا محذوف کی خبر ہے جو اس سے پہلے جملے سے معلوم ہو رہا ہے، یعنی {’’فَالْمَوْتُ أَوْلٰي لَهُمْ‘‘} ’’پس موت ہی ان کے لیے بہتر ہے، یا موت ہی ان کے لائق ہے۔‘‘ دوسری تفسیر حافظ ابن کثیر نے فرمائی ہے کہ {’’ فَاَوْلٰى لَهُمْ ‘‘} خبر مقدم ہے اور اگلی آیت میں {’’ طَاعَةٌ وَّ قَوْلٌ مَّعْرُوْفٌ ‘‘} مبتدا مؤخر ہے۔ ان کے الفاظ میں عبارت یوں ہے : {’’ طَاعَةٌ وَّ قَوْلٌ مَّعْرُوْفٌ أَوْلٰي لَهُمْ، أَيْ وَكَانَ الْأَوْلٰي لَهُمْ أَنْ يَّسْمَعُوْا وَ يُطِيْعُوْا ‘‘} یعنی ان کے لیے بہتر تھا کہ وہ سنتے اور اطاعت کرتے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ {طَاعَةٌ وَّ قَوْلٌ مَّعْرُوْفٌ:} اس کا تعلق یا تو پچھلی آیت کے آخری لفظ {’’ فَاَوْلٰى لَهُمْ ‘‘} کے ساتھ ہے، جیسا کہ گزرا اور اگر اسے نیا جملہ سمجھا جائے تو اس کی ترکیب دو طرح سے ہو سکتی ہے، ایک یہ کہ یہ مبتدا ہے اور اس کی خبر {’’ خَيْرٌ لَّهُمْ‘‘} محذوف ہے، یعنی حکم ماننا اور اچھی بات کہنا ان کے لیے بہتر ہے۔ دوسرا یہ کہ یہ مبتدا محذوف {’’أَمْرُنَا‘‘} کی خبر ہے، یعنی وہ کہتے ہیں کہ ہمارا کام تو اطاعت کرنا اور اچھی بات کہنا ہے۔ ¤ ➋ {فَاِذَا عَزَمَ الْاَمْرُ فَلَوْ صَدَقُوا اللّٰهَ … :} یعنی کہتے تو وہ یہی ہیں کہ ہمارا کام {’’سَمِعْنَا وَ أَطَعْنَا‘‘} یعنی حکم ماننا اور اچھی بات کہنا ہے، مگر جب جہاد کا قطعی اور لازمی حکم آ جائے تو وہ اپنی بات میں جھوٹے نکلتے ہیں، اگر وہ اس وقت اپنی بات میں اللہ سے سچے رہیں تو یقینا ان کے لیے بہتر ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) {فَهَلْ عَسَيْتُمْ اِنْ تَوَلَّيْتُمْ … : ’’هَلْ‘‘} کے معنی کی تحقیق کے لیے دیکھیے سورۂ دہر کی پہلی آیت: « هَلْ اَتٰى عَلَى الْاِنْسَانِ حِيْنٌ مِّنَ الدَّهْرِ » کی تفسیر۔ یہاں یہ {’’ قَدْ ‘‘} (یقینا) کے معنی میں ہے۔ {’’ عَسَيْتُمْ ‘‘} تم قریب ہو، تم سے امید ہے۔ {’’ تَوَلَّيْتُمْ ‘‘} یا تو {’’تَوَلَّي الْوِلاَيَةَ‘‘} سے ہے، حاکم یا صاحب اقتدار ہونا، یا {’’ تَوَلّٰي عَنْهُ‘‘} سے ہے، منہ موڑنا، اعراض کرنا۔ اگر حاکم ہونے سے ہو تو آیت کا مطلب یہ ہے کہ تمھارے لیے بہتر یہی ہے کہ طاعت اور قول معروف اختیار کرو، کیونکہ اگر تم اسی نفاق کی حالت میں حکومت پر متمکن ہو جاؤ تو یقینا تم قریب ہو کہ ایمان سے خالی ہونے کی وجہ سے اسلام سے پہلے والی حالت کی طرف پلٹ جاؤ گے، اپنی خواہشاتِ نفس پوری کرنے کے لیے زمین میں فساد کرو گے اور اپنی رشتہ داریاں بری طرح قطع کر دو گے۔ اور اگر {’’ تَوَلَّيْتُمْ ‘‘} کا معنی اعراض اور منہ موڑنا ہو تو مطلب یہ ہے کہ تمھارے لیے بہتر یہی ہے کہ جب جہاد کا حکم قطعی اور لازمی ہو جائے تو اپنا صدق ثابت کرتے ہوئے اللہ کی راہ میں جہاد کرو، کیونکہ اگر تم نے جہاد سے منہ موڑا تو ہر گز امن و امان سے نہیں رہو گے، بلکہ نافرمانی اور قطع رحمی کرو گے، جس کے نتیجے میں خانہ جنگی، نافرمانی اور لوٹ مار کی وہی حالت لوٹ آئے گی جو اسلام سے پہلے تھی۔ {’’ تُقَطِّعُوْۤا ‘‘} (تفعیل) میں مبالغہ ہے، یعنی تم اپنی رشتہ داریاں بری طرح قطع کرو گے، یا بالکل قطع کر دو گے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) { اُولٰٓىِٕكَ الَّذِيْنَ لَعَنَهُمُ اللّٰهُ …:} یعنی یہ لوگ جو قریب تھے کہ حکومت میں آ جائیں تو اندھے بہرے ہو کر ظلم و فساد پھیلائیں اور قطع رحمی کرنے لگیں، یا قریب تھے کہ اطاعت اور جہاد سے منہ موڑیں تو زمین میں فساد پھیلائیں اور رشتہ داریوں کو بری طرح قطع کر دیں، اللہ تعالیٰ نے ان پر لعنت کی اور انھیں ایسا بہرا، اندھا اور سنگ دل بنا دیا کہ وہ جہاد کی برکات سمجھ ہی نہ سکے کہ اس کی بدولت مسلمانوں کی پریشانیاں اور مصیبتیں ختم ہوتی ہیں، انھیں عزت اور سربلندی ملتی ہے، فتنہ و فساد اور شرک و کفر ختم ہوتا ہے اور زمین امن کا گہوارہ بن جاتی ہے۔ دوسری جگہ اللہ تعالیٰ نے فرمایا : «ذٰلِكَ بِاَنَّهُمْ اٰمَنُوْا ثُمَّ كَفَرُوْا فَطُبِعَ عَلٰى قُلُوْبِهِمْ فَهُمْ لَا يَفْقَهُوْنَ » [ المنافقون : ۳ ] ’’یہ اس لیے کہ وہ ایمان لائے، پھر انھوں نے کفر کیا تو ان کے دلوں پر مہر لگا دی گئی، سو وہ نہیں سمجھتے۔ ‘‘"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) { اَفَلَا يَتَدَبَّرُوْنَ الْقُرْاٰنَ … :} اوپر کی آیت کے سیاق کو ملحوظ رکھا جائے تو مطلب یہ ہو گا کہ یہ لوگ ملعون ہونے کی وجہ سے یا تو قرآن پر غور و تدبر ہی نہیں کرتے، یا کرتے ہیں تو اس کے معانی و مطالب ان کی سمجھ میں نہیں آتے، کیونکہ ان کے دلوں پر کفر و نفاق کے قفل چڑھے ہوتے ہیں۔ ہاں، اگر صدقِ نیت سے غور کرتے تو ضرور سمجھ لیتے کہ جہاد میں کس قدر دنیوی اور اخروی فوائد ہیں۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ { اِنَّ الَّذِيْنَ ارْتَدُّوْا عَلٰۤى اَدْبَارِهِمْ … :} ان سے مراد منافقین ہی ہیں جنھوں نے راہِ حق واضح ہونے اور اسلام کا اقرار کرنے کے بعد جہاد سے گریز کرتے ہوئے کفر و ارتداد کی راہ اختیار کی۔ ¤ ➋ { الشَّيْطٰنُ سَوَّلَ لَهُمْ وَ اَمْلٰى لَهُمْ:} یعنی شیطان نے ان کے لیے ان کے کفر و ارتداد اور جہاد سے فرار کو خوش نما بنا دیا اور ان کے لیے مہلت لمبی بتائی، یعنی ان کے دلوں میں ڈال دیا کہ اگر جہاد نہ کرو گے تو لمبی مدت تک زندہ رہو گے اور دنیا کے عیش و آرام سے فائدہ اٹھاؤ گے۔ شیطان کا کام ہی خواہش اور آرزوئیں دلا کر گمراہ کرنا ہے۔ (دیکھیے نساء : ۱۱۹، ۱۲۰) حالانکہ انھیں سمجھنا چاہیے تھا کہ موت اپنے وقت پر آتی ہے، اس میں لمحہ بھر تقدیم و تاخیر نہیں ہوتی، پھر جہاد سے بھاگنے کا کیا فائدہ؟"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ {ذٰلِكَ بِاَنَّهُمْ قَالُوْا لِلَّذِيْنَ كَرِهُوْا مَا نَزَّلَ اللّٰهُ:’’ لِلَّذِيْنَ كَرِهُوْا مَا نَزَّلَ اللّٰهُ ‘‘} سے مراد کفار ہیں، جیسا کہ اسی سورت کے شروع میں اللہ تعالیٰ نے کفار کے متعلق فرمایا : « ذٰلِكَ بِاَنَّهُمْ كَرِهُوْا مَاۤ اَنْزَلَ اللّٰهُ فَاَحْبَطَ اَعْمَالَهُمْ » [محمد : ۹] ’’یہ اس لیے کہ انھوں نے اس چیز کو نا پسند کیا جو اللہ نے نازل کی تو اس نے ان کے اعمال ضائع کر دیے۔ ‘‘ ¤ ➋ { سَنُطِيْعُكُمْ فِيْ بَعْضِ الْاَمْرِ:} بعض کاموں سے مراد رسول اللہ صلی اللہ علیہ وسلم کی مخالفت اور عداوت ہے اور یہ کہ جب جنگ کا موقع آئے مسلمانوں کو دھوکا دیا جائے اور ہر طریقے سے ان کے دشمنوں کی مدد کی جائے۔ یعنی ان کے ایمان قبول کرنے کے بعد کفر و ارتداد کی طرف پلٹنے، جہاد سے فرار اور منافقت اختیار کرنے کی وجہ یہ ہے کہ بجائے اس کے کہ دوسرے مخلص مسلمانوں کی طرح وہ تمام کاموں میں رسول اللہ صلی اللہ علیہ وسلم کی اطاعت کرتے، انھوں نے اللہ تعالیٰ کے نازل کردہ دین کو ناپسند کرنے والے کفار سے کہا کہ ہم اسلام قبول کرنے اور مسلمانوں میں رہنے کی وجہ سے تمھاری ہر بات نہیں مان سکتے، نہ کھلم کھلا اپنے کفر کا اظہار کر سکتے ہیں، مگر ہم کچھ کاموں میں تمھاری اطاعت ضرور کریں گے۔ وہ اس طرح کہ جنگ کے موقع پر تمھاری مدد کریں گے، جیسا کہ رئیس المنافقین عبد اللہ بن اُبی اُحد کے موقع پر عین میدانِ جنگ سے تین سو آدمیوں کو واپس لے گیا اور جس طرح منافقین نے بنو نضیر کے یہودیوں کو ہلاشیری دی کہ رسول اللہ صلی اللہ علیہ وسلم کے خلاف ڈٹے رہو، اگر تمھیں نکالا گیا تو ہم تمھارے ساتھ نکلیں گے اور اگر تم سے جنگ کی گئی تو ہم تمھارے ساتھ مل کر لڑیں گے۔ دیکھیے سورۂ حشر (۱۱)۔ ¤ ➌ { وَ اللّٰهُ يَعْلَمُ اِسْرَارَهُمْ:} اور اللہ تعالیٰ ان کی سرگوشیوں اور سازشوں کو جو وہ چھپ کر کرتے ہیں خوب جانتا ہے۔ مطلب یہ ہے کہ وہ انھیں اس کی سزا ضرور دے گا۔ اس آیت کا مضمون سورۂ نساء کی آیت (۸۱) میں بھی بیان ہوا ہے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 28،27) ➊ {فَكَيْفَ اِذَا تَوَفَّتْهُمُ الْمَلٰٓىِٕكَةُ … :} یعنی دنیا میں تو انھوں نے اسلام قبول کرنے کے بعد کفار کا ساتھ اس لیے دیا کہ کفر و اسلام کی جنگ میں دونوں جانب سے مفادات حاصل کر سکیں، اپنے آپ کو جنگ کے نقصانات اور خطرات سے بچائیں اور اپنے چہروں اور پیٹھوں کو تیر و تلوار کی مار سے بچائے رکھیں، مگر مرتے وقت ان کے چہروں اور پیٹھوں کو فرشتوں کی مار سے کون بچائے گا؟ ¤ ➋ { فَاَحْبَطَ اَعْمَالَهُمْ:} یعنی وہ تمام اعمال جو مسلمان بن کر وہ انجام دیتے رہے، مثلاً ان کی نماز، ان کے روزے، زکوٰۃ اور تمام عبادتیں جو بظاہر نیکیاں تھیں، اللہ تعالیٰ نے برباد کر دیے، کیونکہ یہ سب کچھ تب قبول ہوتا جب وہ اللہ تعالیٰ کو راضی کرنے کے لیے ہوتا۔ جب اسلام اور مسلمانوں سے بے وفائی اور غداری کرکے وہ چل ہی اس راستے پر پڑے جو اللہ تعالیٰ کو ناراض کرنے والا ہے اور انھیں اللہ تعالیٰ کو راضی کرنا ہی پسند نہ رہا تو ان کے نماز روزے، صدقات اور دوسری نیکیوں سے کیا حاصل۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28،27) ➊ {فَكَيْفَ اِذَا تَوَفَّتْهُمُ الْمَلٰٓىِٕكَةُ … :} یعنی دنیا میں تو انھوں نے اسلام قبول کرنے کے بعد کفار کا ساتھ اس لیے دیا کہ کفر و اسلام کی جنگ میں دونوں جانب سے مفادات حاصل کر سکیں، اپنے آپ کو جنگ کے نقصانات اور خطرات سے بچائیں اور اپنے چہروں اور پیٹھوں کو تیر و تلوار کی مار سے بچائے رکھیں، مگر مرتے وقت ان کے چہروں اور پیٹھوں کو فرشتوں کی مار سے کون بچائے گا؟ ¤ ➋ { فَاَحْبَطَ اَعْمَالَهُمْ:} یعنی وہ تمام اعمال جو مسلمان بن کر وہ انجام دیتے رہے، مثلاً ان کی نماز، ان کے روزے، زکوٰۃ اور تمام عبادتیں جو بظاہر نیکیاں تھیں، اللہ تعالیٰ نے برباد کر دیے، کیونکہ یہ سب کچھ تب قبول ہوتا جب وہ اللہ تعالیٰ کو راضی کرنے کے لیے ہوتا۔ جب اسلام اور مسلمانوں سے بے وفائی اور غداری کرکے وہ چل ہی اس راستے پر پڑے جو اللہ تعالیٰ کو ناراض کرنے والا ہے اور انھیں اللہ تعالیٰ کو راضی کرنا ہی پسند نہ رہا تو ان کے نماز روزے، صدقات اور دوسری نیکیوں سے کیا حاصل۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) { اَمْ حَسِبَ الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ … : ’’ أَضْغَانٌ‘‘ ’’ضِغْنٌ‘‘} کی جمع ہے، شدید کینہ، مراد اس سے وہ شدید حسد اور عداوت ہے جو منافقین رسول اللہ صلی اللہ علیہ وسلم اور مسلمانوں کے خلاف دلوں میں رکھتے تھے۔ یعنی کیا ان منافقین نے گمان کر رکھا ہے کہ انھوں نے اپنے دل میں مسلمانوں کے خلاف جو شدید حسد اور بغض کی بے شمار باتیں چھپا رکھی ہیں اللہ تعالیٰ انھیں ظاہر نہیں کرے گا اور ان پر پردہ ہی پڑا رہے گا؟ نہیں، ایسا نہیں ہو گا، بلکہ اللہ تعالیٰ ان کے خبثِ باطن کو ضرور ظاہر کرے گا۔ چنانچہ سورۂ توبہ میں منافقین کی سازشوں، عداوتوں اور اسلام اور مسلمانوں کے خلاف ان کی زہریلی باتوں کو {’’ وَ مِنْهُمْ ‘‘، ’’ وَ مِنْهُمْ ‘‘} کہہ کر اس طرح کھول کر رکھ دیا کہ ان کی پہچان میں کوئی مشکل باقی نہ رہی۔ اس لیے سورۂ توبہ کا نام سورۂ فاضحہ یعنی منافقین کو رسوا کرنے والی سورت بھی ہے۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ {وَ لَوْ نَشَآءُ لَاَرَيْنٰكَهُمْ فَلَعَرَفْتَهُمْ بِسِيْمٰىهُمْ: ’’سِيْمَا‘‘} علامت۔ پچھلی آیت سے ظاہر ہوتا تھا کہ اللہ تعالیٰ منافقین کی دلی عداوتوں اور ان کے نفاق کو ظاہر کر دے گا۔ اس پر سوال پیدا ہوا کہ پھر اس نے منافقین کا نام لے کر یا ان پر کوئی علامت لگا کر انھیں کیوں ظاہر نہیں کیا؟ اس کے جواب میں فرمایا کہ اس کی وجہ منافقین کا خوف یا کوئی اور خطرہ نہیں بلکہ محض ہماری مشیت ہے۔ اللہ تعالیٰ نے یہ بات لفظ {’’ لَوْ ‘‘} کے ساتھ بیان فرمائی ہے، جس کا استعمال ایسی شرط کے لیے ہوتا ہے جو واقع نہیں ہوتی، اس لیے اس کی جزا بھی واقع نہیں ہوتی۔ یعنی اگر ہم چاہتے تو ہر منافق کا نام لے کر یا اس پر خاص نشانی لگا کر اسے شخصی طور پر آپ کو دکھا دیتے، جس کے ساتھ آپ ان سب کو صاف پہچان لیتے، مگر ہم نے یہ چاہا نہ کوئی ایسی علامت مقرر کرکے شخصی طور پر آپ کو ان کی پہچان کروائی، کیونکہ ہماری مصلحت و حکمت اور ہمارے ستر و حلم کا تقاضا یہی تھا کہ ان کو اس طرح رسوا نہ کیا جائے کہ کوئی توبہ کرنا چاہے تو نہ کر سکے، کیونکہ ہمارے ہاں منافقین کے لیے بھی توبہ کا دروازہ کھلا ہے، جیسا کہ فرمایا : « لِيَجْزِيَ اللّٰهُ الصّٰدِقِيْنَ بِصِدْقِهِمْ وَ يُعَذِّبَ الْمُنٰفِقِيْنَ اِنْ شَآءَ اَوْ يَتُوْبَ عَلَيْهِممْ اِنَّ اللّٰهَ كَانَ غَفُوْرًا رَّحِيْمًا» [الأحزاب : ۲۴ ] ’’تاکہ اللہ سچوں کو ان کے سچ کا بدلا دے اور منافقوں کو عذاب دے اگر چاہے، یا ان کی توبہ قبول فرمائے۔ بلاشبہ اللہ ہمیشہ سے بے حد بخشنے والا، نہایت رحم والا ہے۔ ‘‘ اور اس میں اللہ تعالیٰ کی یہ بھی حکمت تھی کہ لوگ ظاہر کے مطابق فیصلہ کریں اور باطن کا معاملہ اللہ تعالیٰ کے سپرد کر دیں۔ ¤ ➋ {وَ لَتَعْرِفَنَّهُمْ فِيْ لَحْنِ الْقَوْلِ: ’’ وَ لَتَعْرِفَنَّهُمْ ‘‘} تاکید کا لام اور نون ثقیلہ قسم کے جواب میں آتا ہے، یعنی اگرچہ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو منافقین کا نام لے کر یا ان کے چہروں پر کوئی نشانی لگا کر ان کی اطلاع نہیں دی مگر اس کا یہ مطلب نہیں کہ آپ انھیں بالکل نہیں پہچانتے تھے، اللہ تعالیٰ نے قسم کھا کر فرمایا کہ آپ ان کی بات کے لہجے اور انداز میں یقینا انھیں پہچان لیں گے۔ سورۂ توبہ میں منافقین کے بہت سے اقوال و احوال اور افعال ذکر فرمائے ہیں جن سے ان کی شناخت میں کچھ مشکل پیش نہیں آتی۔ ایسی ہی باتوں کا حوالہ دے کر عمر بن خطاب رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کو عبد اللہ بن اُبی کا جنازہ پڑھنے سے روکنے کی کوشش کی تھی، جس کے بعد اللہ تعالیٰ نے منافقین کا جنازہ پڑھنے یا ان کی قبر پر کھڑے ہونے سے صراحت کے ساتھ منع فرما دیا۔ منافقین کی یہ پہچان بھی اللہ تعالیٰ نے ان کا نام لے کر یا ان پر نشانی لگا کر نہیں کروائی بلکہ بلا عذر جنگ تبوک سے پیچھے رہنے کو ان کی شناخت بنا دیا۔ چنانچہ جہاں ان پر جنازہ پڑھنے یا ان کی قبر پر کھڑا ہونے سے منع فرمایا ہے اس سے پہلے ان کا جرم بیان فرمایا ہے : «فَرِحَ الْمُخَلَّفُوْنَ۠ بِمَقْعَدِهِمْ خِلٰفَ رَسُوْلِ اللّٰهِ وَ كَرِهُوْۤا اَنْ يُّجَاهِدُوْا بِاَمْوَالِهِمْ وَ اَنْفُسِهِمْ فِيْ سَبِيْلِ اللّٰهِ وَ قَالُوْا  لَا تَنْفِرُوْا فِي الْحَرِّ » [ التوبۃ : ۸۱ ] ’’وہ لوگ جو پیچھے چھوڑ دیے گئے وہ اللہ کے رسول کے پیچھے اپنے بیٹھ رہنے پر خوش ہوئے اور انھوں نے ناپسند کیا کہ اپنے مالوں اور اپنی جانوں کے ساتھ اللہ کے راستے میں جہاد کریں اور انھوں نے کہا اس گرمی میں مت نکلو۔‘‘ پھر فرمایا : «فَاِنْ رَّجَعَكَ اللّٰهُ اِلٰى طَآىِٕفَةٍ مِّنْهُمْ فَاسْتَاْذَنُوْكَ لِلْخُرُوْجِ فَقُلْ لَّنْ تَخْرُجُوْا مَعِيَ اَبَدًا وَّ لَنْ تُقَاتِلُوْا مَعِيَ عَدُوًّا اِنَّكُمْ رَضِيْتُمْ بِالْقُعُوْدِ اَوَّلَ مَرَّةٍ فَاقْعُدُوْا مَعَ الْخٰلِفِيْ (83) وَ لَا تُصَلِّ عَلٰۤى اَحَدٍ مِّنْهُمْ مَّاتَ اَبَدًا وَّ لَا تَقُمْ عَلٰى قَبْرِهٖ اِنَّهُمْ كَفَرُوْا بِاللّٰهِ وَ رَسُوْلِهٖ وَ مَاتُوْا وَ هُمْ فٰسِقُوْنَ » [ التوبۃ : 84،83 ] ’’پس اگر اللہ تجھے ان میں سے کسی گروہ کی طرف واپس لے آئے، پھر وہ تجھ سے (جنگ کے لیے) نکلنے کی اجازت طلب کریں تو کہہ دے تم میرے ساتھ کبھی نہیں نکلو گے اور میرے ساتھ مل کر کبھی کسی دشمن سے نہیں لڑو گے۔ بے شک تم پہلی مرتبہ بیٹھ رہنے پر خوش ہوئے، سو پیچھے رہنے والوں کے ساتھ بیٹھے رہو۔ اور ان میں سے جو کوئی مر جائے اس کا کبھی جنازہ نہ پڑھنا اور نہ اس کی قبر پر کھڑے ہونا، بے شک انھوں نے اللہ اور اس کے رسول کے ساتھ کفر کیا اور اس حال میں مرے کہ وہ نافرمان تھے۔ ‘‘ منافقین کی ایسی ہی حرکتوں اور باتوں سے رسول اللہ صلی اللہ علیہ وسلم کو ان کی پہچان ہو جاتی تھی اور کئی مواقع پر آپ نے صحابہ کرام رضی اللہ عنھم کو بعض منافقین کے بارے میں آگاہ بھی فرمایا۔ صحیح مسلم کی {’’كِتَابُ صِفَاتِ الْمُنَافِقِيْنَ وَ أحْكَامِهِمْ ‘‘} میں مذکور احادیث میں ایسے کئی منافقین کا ذکر ہے۔ ¤ ➌ رسول اللہ صلی اللہ علیہ وسلم نے صحابہ کو بعض منافقین کے بارے میں جو آگاہ فرمایا مولانا ثناء اللہ امرتسری رحمہ اللہ نے اس کی اور توجیہ فرمائی ہے، وہ لکھتے ہیں : ’’اس آیت کے نزول تک آں حضرت صلی اللہ علیہ وسلم کو منافقین کی تشخیص کا علم نہ تھا، بعد اس کے کرایا گیا، جیسا کہ حدیثوں سے ثابت ہے کہ آں حضرت صلی اللہ علیہ وسلم نے حضرت حذیفہ صحابی کو بتا دیا تھا۔‘‘ (تفسیر ثنائی) ¤ ➍ {وَ اللّٰهُ يَعْلَمُ اَعْمَالَكُمْ:} یعنی ممکن ہے بندوں کو کسی کے نفاق کا علم نہ ہو سکے مگر اللہ تعالیٰ تمھارے سب کام جانتا ہے، اس سے کوئی بات مخفی نہیں رہ سکتی۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { وَ لَنَبْلُوَنَّكُمْ حَتّٰى نَعْلَمَ الْمُجٰهِدِيْنَ مِنْكُمْ …:} یہ مسلمانوں سے عام خطاب ہے کہ منافقوں کے ذکر سے یہ خیال نہ کرنا کہ تم امتحان سے مستثنیٰ ہو۔ ہر گز نہیں، بلکہ ہم ہر حال میں مختلف احکام کے ساتھ تمھاری آزمائش کریں گے، حتیٰ کہ تم میں سے جہاد کرنے والوں اور صبر کرنے والوں کو جان لیں اور تمھارے حالات کی خوب جانچ پڑتال کر لیں۔ ¤ ➋ یہاں ایک سوال ہے کہ اس بات میں کوئی شک نہیں کہ اللہ تعالیٰ کو جس طرح گزشتہ اور موجودہ کاموں کا علم ہے وہ ان کاموں کو بھی جانتا ہے جو آئندہ ہونے والے ہیں، پھر اس بات کا کیا مطلب کہ یہاں تک کہ ہم تم میں سے جہاد کرنے والوں اور صبر کرنے والوں کو جان لیں؟ حافظ ابن کثیر نے فرمایا: ’’مراد یہ ہے کہ ہم اس بات کا واقع ہونا جان لیں۔ اس لیے ابن عباس رضی اللہ عنھما نے اس جیسے الفاظ کے بارے میں فرمایا کہ{’’ نَعْلَمَ ‘‘} کا معنی {’’ نَرٰي ‘‘} ہے، یعنی حتیٰ کہ ہم دیکھ لیں۔‘‘ (ابن کثیر) یعنی بے شک اللہ تعالیٰ پہلے جانتا ہے کہ آئندہ کیا ہو گا، مگر یہ بات کہ وہ کام واقع ہو چکا ہے اس کے علم میں اسی وقت آتی ہے جب وہ کام واقع ہو اور اس وقت ہی وہ اس کے واقع ہونے کو جانتا اور دیکھتا ہے۔ جو کام واقع ہی نہیں ہوا اس کے متعلق کیسے کہا جا سکتا ہے کہ اللہ تعالیٰ جانتا ہے کہ وہ واقع ہو چکا ہے۔ مزید دیکھیے سورۂ آلِ عمران (۱۴۲)۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) { اِنَّ الَّذِيْنَ كَفَرُوْا وَ صَدُّوْا عَنْ سَبِيْلِ اللّٰهِ … :} یعنی منافقین اور یہود جنھیں یہ معلوم ہو چکا کہ آپ صلی اللہ علیہ وسلم واقعی اللہ کے رسول ہیں اور یہ بھی جانتے ہیں کہ پہلی کتابوں میں آپ صلی اللہ علیہ وسلم کی بشارتیں موجود ہیں مگر انھوں نے ضد اور عناد کی وجہ سے آپ کی مخالفت کی، وہ اللہ کا کچھ نہیں بگاڑ سکیں گے، نہ اللہ کے رسول اور اللہ کے بندوں کا کچھ نقصان کر سکیں گے، بلکہ وہ سراسر اپنا ہی نقصان کر رہے ہیں، کیونکہ اپنے خیال میں وہ جو اچھے کام کر رہے ہیں اللہ تعالیٰ انھیں برباد کر دے گا اور مسلمانوں کو نقصان پہنچانے اور لوگوں کو اللہ کے دین سے روکنے کے لیے وہ جو سازشیں اور منصوبے تیار کرتے ہیں اللہ تعالیٰ انھیں ناکام بنا دے گا۔ مزید دیکھیے اسی سورت کی پہلی آیت میں {’’ اَضَلَّ اَعْمَالَهُمْ ‘‘} کی تفسیر۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اَطِيْعُوا اللّٰهَ وَ اَطِيْعُوا الرَّسُوْلَ … :} یعنی اعمال کے قبول ہونے کی شرط یہ ہے کہ آدمی اللہ اور اس کے رسول کی اطاعت کا پابند رہے۔ اگر کوئی شخص اطاعت سے نکل کر مخالفت پر اتر آئے اور دشمنوں کے ساتھ ساز باز شروع کر دے تو اس کے سارے اعمال باطل ہیں، خواہ وہ اپنے خیال میں کتنے اچھے عمل کرتا رہے، جیسا کہ منافقین تھے کہ انھوں نے ایمان لانے کے بعد کفر اور عہدِ اطاعت کے بعد مخالفت کا راستہ اختیار کیا۔ یہاں آیت سے یہی مراد ہے، کیونکہ اس سے پہلے بھی منافقین کا ذکر ہے اور بعد میں بھی۔ گویا آیت کا مطلب یہ ہوا: ’’اے لوگو جو ایمان لائے ہو! اللہ کی اطاعت کرو اور رسول کی اطاعت کرو اور ان لوگوں کی طرح اپنے اعمال باطل مت کرو جن کے اعمال ان کے کفر اور اللہ کے راستے سے روکنے اور رسول کی مخالفت کی وجہ سے اللہ تعالیٰ نے برباد کر دیے۔‘‘ آیت کا یہ مطلب نہیں کہ اگر آدمی کسی نافرمانی یا کبیرہ گناہ کا ارتکاب کر بیٹھے تو اس کے پہلے تمام اعمال باطل ہوگئے، کیونکہ یہ اس آیت کے خلاف ہے: «اِنَّ اللّٰهَ لَا يَغْفِرُ اَنْ يُّشْرَكَ بِهٖ وَ يَغْفِرُ مَا دُوْنَ ذٰلِكَ لِمَنْ يَّشَآءُ وَ مَنْ يُّششْرِكْ بِاللّٰهِ فَقَدِ افْتَرٰۤى اِثْمًا عَظِيْمًا » [النساء:۴۸] ’’بے شک اللہ اس بات کو نہیں بخشے گا کہ ااس کا شریک بنایا جائے اور وہ بخش دے گا جو اس کے علاوہ ہے، جسے چاہے گا اور جو اللہ کا شریک بنائے تو یقینا اس نے بہت بڑا گناہ گھڑا۔‘‘ ہاں آیت کا یہ مطلب ضرور ہو سکتا ہے کہ ہر عمل جس میں اللہ اور اس کے رسول کی اطاعت نہ ہو اور وہ ان کے بتائے ہوئے طریقے پر نہ ہو وہ باطل ہے، کیونکہ عمل کی قبولیت کے لیے اخلاص اور اتباع سنت شرط ہے، جیسا کہ عائشہ رضی اللہ عنھا نے بیان کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ ] [ مسلم، الأقضیۃ، باب نقض الأحکام الباطلۃ و رد محدثات الأمور : ۱۸ /۱۷۱۸ ] ’’جو شخص وہ عمل کرے جس پر ہمارا عمل نہیں وہ مردود ہے۔‘‘ بعض لوگوں نے اس آیت سے یہ بات نکالی ہے کہ کوئی نفلی عمل، نماز ہو یا روزہ یا کوئی اور، اگر شروع کرے تو اسے پورا کرنا واجب ہے، کیونکہ اگر اسے پہلے چھوڑ دے گا تو اس نے عمل باطل کر دیا مگر یہ بات درست نہیں نہ آیت سے اس کا کوئی تعلق ہے۔ نفل پہلے بھی نفل ہوتا ہے بعد میں بھی۔ جس کا شروع کرنا واجب نہیں اسے پورا کرنا بھی واجب نہیں۔ تفصیل امہات الکتب میں دیکھیں۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) { اِنَّ الَّذِيْنَ كَفَرُوْا وَ صَدُّوْا عَنْ سَبِيْلِ اللّٰهِ … :} اس آیت میں کفار وو منافقین کے لیے ترغیب ہے کہ کفر و نفاق اور اسلام کی مخالفت سے مرنے سے پہلے پہلے توبہ کر لو تو اللہ تعالیٰ تمھارے گزشتہ گناہ معاف کر دے گا، ورنہ اگر اسی حالت میں موت آگئی تو تمھاری بخشش کی کوئی صورت نہیں۔ یہ بات اللہ تعالیٰ نے متعدد آیات میں دہرائی ہے، دیکھیے سورۂ آل عمران (۹۱)، بقرہ (۱۶۱، ۱۶۲، ۲۱۷) اور سورۂ نساء (۱۸)۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ { فَلَا تَهِنُوْا: ’’ فَلَا تَهِنُوْا ‘‘} کی فاء فصیحہ کہلاتی ہے۔ دیکھیے اسی سورت کی آیت : (۱۹) «فَاعْلَمْ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا اللّٰهُ» کی تفسیر۔ یعنی جب تم منافقین کا جہاد سے فرار اختیار کرنا اور دوسروں کو بھی اس سے روکنا، کفار کے ساتھ دوستی اور اسلام اور مسلمانوں سے بے وفائی کرنا، رسول اللہ صلی اللہ علیہ وسلم کی مخالفت کرنا، اس کے نتیجے میں ان پر لعنت ہونا اور ان کے اعمال برباد ہونا جان چکے تو تم وہ کام نہ کرنا جن کے نتیجے میں ان کا یہ انجام ہوا۔ ¤ ➋ { فَلَا تَهِنُوْا وَ تَدْعُوْۤا اِلَى السَّلْمِ:} منافقین چونکہ بزدلی اور موت کے خوف کی وجہ سے جنگ کا حوصلہ نہیں رکھتے تھے اس لیے صلح اور سمجھوتے کی باتیں بہت کرتے تھے، وہ مسلمانوں کو بھی مشورہ دیتے رہتے تھے کہ جنگ کے بجائے صلح سے معاملات طے کرنے چاہییں۔ حالانکہ ان کی صلح جوئی کے پیچھے ان کی بے ہمتی، بزدلی اور کمزوری کے سوا کچھ نہیں تھا، اس لیے اللہ تعالیٰ نے مسلمانوں کو ان کی راہ اختیار کرنے سے منع فرما دیا۔ یہاں یہ بات یاد رکھنی چاہیے کہ یہ آیات اس زمانے میں نازل ہوئیں جب مدینہ ایک چھوٹی سی بستی تھی، جس میں مہاجرین و انصار کی مٹھی بھر جماعت اسلام کا جھنڈا اٹھائے ہوئے تھی اور اس کا مقابلہ صرف عرب کے سب سے طاقتور قبیلے قریش کے ساتھ نہیں تھا بلکہ پورے عرب کے کفار و مشرکین اور یہود کے ساتھ تھا۔ اس حالت میں فرمایا کہ ہمت ہار کر دشمنوں سے صلح کی درخواست مت کرو، بلکہ سر دھڑ کی بازی لگا دینے کے لیے تیار ہو جاؤ۔ چنانچہ تاریخ گواہ ہے کہ بدر و احد اور خندق میں تعداد کی کمی، بے حد کمزوری اور بے سرو سامانی کے باوجود مسلمانوں نے نہ ہمت ہاری، نہ کمزوری دکھائی، نہ صلح کی پیش کش کی، بلکہ ڈٹ کر لڑے، یہاں تک کہ جب جنگِ خندق کی گرد چھٹی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْآنَ نَغْزُوْهُمْ وَلَا يَغْزُوْنَنَا، نَحْنُ نَسِيْرُ إِلَيْهِمْ ] [ بخاري، المغازي، باب غزوۃ الخندق وھي الأحزاب : ۴۱۱۰ ] ’’اب ہم ان پر حملے کے لیے جائیں گے، وہ ہم پر حملے کے لیے نہیں آئیں گے، ہم ہی ان پر فوج کشی کیا کریں گے۔‘‘ طالوت و جالوت کی جنگ بھی اس کی واضح مثال ہے۔‘‘ ¤ ➌ {’’ فَلَا تَهِنُوْا ‘‘} کے بعد {’’ تَدْعُوْۤا ‘‘} بھی نہی کے اس {’’لَا‘} ‘ کی وجہ سے مجزوم ہے جو {’’ تَهِنُوْا ‘‘} پر آیا ہے اور اسی کی وجہ سے اس سے نون اعرابی گرا ہے، کیونکہ یہ اصل میں {’’ تَدْعُوْنَ‘‘} تھا، لائے نہی کی وجہ سے نون گر گیا تو {’’ تَدْعُوْۤا ‘‘} رہ گیا۔ گویا اصل کلام {’’فَلاَ تَهِنُوْا وَلاَ تَدْعُوْا إِلَي السَّلْمِ ‘‘} ہے، واؤ عطف کی وجہ سے {’’لَا‘‘} کو دوبارہ لانے کی ضرورت نہ رہی، اس لیے ترجمہ ہو گا : ’’پس تم نہ کمزور بنو (نہ ہمت ہارو) اور نہ صلح کی طرف دعوت دو۔‘‘ اس کی ایک مثال یہ آیت ہے : «وَ لَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ وَ تَكْتُمُوا الْحَقَّ وَ اَنْتُمْ تَعْلَمُوْنَ» [البقرۃ: ۴۲]’’اور حق کو باطل کے ساتھ خلط ملط نہ کرو اور نہ حق کو چھپاؤ، جب کہ تم جانتے ہو۔ ‘‘مطلب یہ ہے کہ دشمن سے جنگ میں ہمت نہ ہارو اور نہ ان کا خوف تم پر مسلط ہو بلکہ صبر کرو، ثابت قدم رہو، اپنے آپ کو لڑائی اور مقابلے پر جمائے رکھو اور صلح اور جنگ بندی کے سمجھوتے کی دعوت مت دو۔ ¤ ➍ {وَ اَنْتُمُ الْاَعْلَوْنَ وَ اللّٰهُ مَعَكُمْ … : ’’ وَ لَنْ يَّتِرَكُمْ ‘‘ ’’وَتَرَ يَتِرُ‘‘ ({وَعَدَ يَعِدُ}) وَتْرًا وَ تِرَةً ‘‘} کسی کا حق مارنا، اس میں کمی کرنا۔ اللہ تعالیٰ نے ہمت نہ ہارنے اور دشمن کو صلح کی دعوت نہ دینے کی تین وجہیں بیان فرمائی ہیں، جن میں سے پہلی وجہ اللہ تعالیٰ کا وعدہ ہے کہ اگر تم نے ہمت نہ ہاری تو تم ہی غالب رہو گے، جیسا کہ دوسری جگہ فرمایا : « وَ لَا تَهِنُوْا وَ لَا تَحْزَنُوْا وَ اَنْتُمُ الْاَعْلَوْنَ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ» [ آل عمران : ۱۳۹ ] ’’اور نہ کمزور بنو اور نہ غم کرو اور تم ہی غالب ہو، اگر تم مومن ہو۔ ‘‘ دوسری وجہ {’’ وَ اللّٰهُ مَعَكُمْ ‘‘} ہے کہ اللہ تمھارے ساتھ ہے اور جس کے ساتھ اللہ ہو کوئی وجہ نہیں کہ وہ ہمت ہارے اور صلح کی پیش کش کرے۔ اسی حوصلے پر رسول اللہ صلی اللہ علیہ وسلم نے کفارِ مکہ کے مقابلے میں اس وقت بھی ہمت نہیں ہاری جب آپ صلی اللہ علیہ وسلم دو میں سے دوسرے تھے۔ اللہ تعالیٰ نے فرمایا : « اِلَّا تَنْصُرُوْهُ فَقَدْ نَصَرَهُ اللّٰهُ اِذْ اَخْرَجَهُ الَّذِيْنَ كَفَرُوْا ثَانِيَ اثْنَيْنِ اِذْ هُمَا فِي الْغَارِ اِذْ يَقُوْلُ لِصَاحِبِهٖ لَا تَحْزَنْ اِنَّ اللّٰهَ مَعَنَا فَاَنْزَلَ اللّٰهُ سَكِيْنَتَهٗ عَلَيْهِ وَ اَيَّدَهٗ بِجُنُوْدٍ لَّمْ تَرَوْهَا وَ جَعَلَ كَلِممَةَ الَّذِيْنَ كَفَرُوا السُّفْلٰى وَ كَلِمَةُ اللّٰهِ هِيَ الْعُلْيَا وَ اللّٰهُ عَزِيْزٌ حَكِيْمٌ » [ التوبۃ : ۴۰ ] ’’اگر تم اس کی مدد نہ کرو تو بلاشبہ اللہ نے اس کی مدد کی، جب اسے ان لوگوں نے نکال دیا جنھوں نے کفر کیا، جب کہ وہ دو میں دوسرا تھا، جب وہ دونوں غار میں تھے، جب وہ اپنے ساتھی سے کہہ رہا تھا غم نہ کر، بے شک اللہ ہمارے ساتھ ہے۔ تو اللہ نے اپنی سکینت اس پر اتار دی اور اسے ان لشکروں کے ساتھ قوت دی جو تم نے نہیں دیکھے اور ان لوگوں کی بات نیچی کر دی جنھوں نے کفر کیا اور اللہ کی بات ہی سب سے اونچی ہے اور اللہ سب پر غالب، کمال حکمت والا ہے۔ ‘‘ تیسری وجہ {’’ وَ لَنْ يَّتِرَكُمْ اَعْمَالَكُمْ ‘‘} ہے کہ وہ ہر گز تم سے تمھارے اعمال کم نہیں کرے گا۔ مطلب یہ ہے کہ جہاد میں تم جو عمل بھی سرانجام دو گے تمھیں اس کا پورا پورا اجر ملے گا، اس میں کسی قسم کی کمی نہیں کی جائے گی۔ تمھارے اور تمھارے دشمن کے درمیان یہ بنیادی فرق ہے کہ تمھیں اس پر اللہ تعالیٰ سے اجر و ثواب، شہادت اور جنت کی امید ہے جب کہ کفار اس سے محروم ہیں۔ پھر ہمت ہارنے یا صلح کی پیش کش کا کیا مطلب ہے؟ اللہ تعالیٰ نے فرمایا : « وَ لَا تَهِنُوْا فِي ابْتِغَآءِ الْقَوْمِ اِنْ تَكُوْنُوْا تَاْلَمُوْنَ فَاِنَّهُمْ يَاْلَمُوْنَ كَمَا تَاْلَمُوْنَ وَ تَرْجُوْنَ مِنَ اللّٰهِ مَا لَا يَرْجُوْنَ » [ النساء : ۱۰۴ ] ’’اور اس قوم کا پیچھا کرنے میں ہمت نہ ہارو، اگر تم تکلیف اٹھاتے ہو تو یقینا وہ بھی تکلیف اٹھاتے ہیں، جیسے تم تکلیف اٹھاتے ہو اور تم اللہ سے وہ امید رکھتے ہو جو وہ امید نہیں رکھتے۔ ‘‘ اور فرمایا : « مَا كَانَ لِاَهْلِ الْمَدِيْنَةِ وَ مَنْ حَوْلَهُمْ مِّنَ الْاَعْرَابِ اَنْ يَّتَخَلَّفُوْا عَنْ رَّسُوْلِ اللّٰهِ وَ لَا يَرْغَبُوْا بِاَنْفُسِهِمْ عَنْ نَّفْسِهٖ ذٰلِكَ بِاَنَّهُمْ لَا يُصِيْبُهُمْ ظَمَاٌ وَّ لَا نَصَبٌ وَّ لَا مَخْمَصَةٌ فِيْ سَبِيْلِ اللّٰهِ وَ لَا يَطَـُٔوْنَ مَوْطِئًا يَّغِيْظُ الْكُفَّارَ وَ لَا يَنَالُوْنَ مِنْ عَدُوٍّ نَّيْلًا اِلَّا كُتِبَ لَهُمْ بِهٖ عَمَلٌ صَالِحٌ اِنَّ اللّٰهَ لَا يُضِيْعُ اَجْرَ الْمُحْسِنِيْنَ (120) وَ لَا يُنْفِقُوْنَ نَفَقَةً صَغِيْرَةً وَّ لَا كَبِيْرَةً وَّ لَا يَقْطَعُوْنَ وَادِيًا اِلَّا كُتِبَ لَهُمْ لِيَجْزِيَهُمُ اللّٰهُ اَحْسَنَ مَا كَانُوْا يَعْمَلُوْنَ » [ التوبۃ : ۱۲۰، ۱۲۱ ] ’’مدینہ والوں کا اور ان کے ارد گرد جو بدوی ہیں، ان کا حق نہ تھا کہ وہ رسول اللہ سے پیچھے رہتے اور نہ یہ کہ اپنی جانوں کو اس کی جان سے زیادہ عزیز رکھتے۔ یہ اس لیے کہ وہ، اللہ کے راستے میں انھیں نہ کوئی پیاس پہنچتی ہے اور نہ کوئی تکان اور نہ کوئی بھوک اور نہ کسی ایسی جگہ پر قدم رکھتے ہیں جو کافروں کو غصہ دلائے اور نہ کسی دشمن سے کوئی کامیابی حاصل کرتے ہیں، مگر اس کے بدلے ان کے لیے ایک نیک عمل لکھ دیا جاتا ہے۔ یقینا اللہ نیکی کرنے والوں کا اجر ضائع نہیں کرتا۔اور نہ وہ خرچ کرتے ہیں کوئی چھوٹا خرچ اور نہ کوئی بڑا اور نہ کوئی وادی طے کرتے ہیں، مگر وہ ان کے لیے لکھ لیا جاتا ہے، تاکہ اللہ انھیں اس عمل کی بہترین جزا دے جو وہ کیا کرتے تھے۔ ‘‘ ¤ ➎ اس آیت میں اللہ تعالیٰ نے دشمن کو صلح کی دعوت دینے سے منع فرمایا ہے، جبکہ دوسری جگہ فرمایا: « وَ اِنْ جَنَحُوْا لِلسَّلْمِ فَاجْنَحْ لَهَا وَ تَوَكَّلْ عَلَى اللّٰهِ» [ الأنفال : ۶۱ ] ’’اور اگر وہ صلح کی طرف مائل ہوں تو تو بھی اس کی طرف مائل ہو جا اور اللہ پر بھروسا کر۔‘‘ ان دونوں آیات میں کوئی تعارض نہیں، اللہ تعالیٰ نے ہمت ہار کر دشمن کو صلح کی پیش کش کرنے سے منع فرمایا ہے اور اگر دشمن صلح کی طرف مائل ہوں تو اس کی طرف مائل ہو جانے کا حکم دیا ہے، کیونکہ یہ پیش کش دشمن کی طرف سے ہے۔ ¤ ➏ ابن کثیر رحمہ اللہ نے اس آیت کی تفسیر میں لکھا ہے: ’’پھر اللہ تعالیٰ نے اپنے مومن بندوں کو حکم دیا: « فَلَا تَهِنُوْا » یعنی دشمن کے مقابلے میں کمزور مت بنو اور : « وَ تَدْعُوْۤا اِلَى السَّلْمِ » یعنی کفار کو صلح کی اور ایک دوسرے سے جنگ ترک کرنے کی دعوت مت دو، اس حال میں کہ تمھاری قوت، تعداد اور تیاری دشمن سے زیادہ ہو۔ اسی لیے فرمایا : « فَلَا تَهِنُوْا وَ تَدْعُوْۤا اِلَى السَّلْمِ وَ اَنْتُمُ الْاَعْلَوْنَ » یعنی دشمن پر تمھارے غلبے کی حالت میں انھیں صلح کی دعوت مت دو۔ لیکن جب کفار تمام مسلمانوں کے مقابلے میں قوت و کثرت میں زیادہ ہوں اور امام صلح اور جنگ بندی میں مصلحت دیکھے تو وہ ایسا کر سکتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس وقت کیا جب کفارِ قریش نے آپ کو مکہ جانے سے روک دیا اور انھوں نے آپ صلی اللہ علیہ وسلم کو صلح کی اور آپس میں دس سال تک جنگ ختم کرنے کی دعوت دی تو آپ صلی اللہ علیہ وسلم نے ان کی دعوت قبول فرمائی۔‘‘ (ابن کثیر) مفسر شنقیطی نے اضواء البیان میں وہ تفسیر جو پہلے ذکر ہوئی ہے، بیان کرنے کے بعد فرمایا : ’’یہ معنی جو ہم نے اس آیت کا بیان کیا ہے اس تفسیر سے بہتر اور زیادہ درست ہے جو ابن کثیر نے کی ہے کہ اس وقت صلح اور سمجھوتے کی دعوت مت دو جب تم غالب ہو، یعنی تم جہاد کی قوت و طاقت رکھتے ہو۔ یعنی اگر تم کمزور ہو اور طاقت نہیں رکھتے تو اس بات سے کوئی مانع نہیں کہ تم صلح اور سمجھوتے کی دعوت دو۔‘‘ ¤ شنقیطی کے ابنِ کثیر سے اتفاق نہ کرنے کی کئی وجہیں ہیں، ان میں سے ایک یہ ہے کہ ابن کثیر نے صرف {’’ وَ اَنْتُمُ الْاَعْلَوْنَ ‘‘} کو حال بنایا ہے، حالانکہ یہاں تین چیزیں بیان ہوئی ہیں : « وَ اَنْتُمُ الْاَعْلَوْنَ وَ اللّٰهُ مَعَكُمْ وَ لَنْ يَّتِرَكُمْ اَعْمَالَكُمْ » دوسری یہ ہے کہ حدیبیہ کے زمانے میں مسلمان قوت میں کفار پر غالب تھے، جیسا کہ پیچھے صحیح بخاری کی حدیث {’’ اَلْآنَ نَغْزُوْهُمْ‘‘} گزری۔ آپ نے انھیں صلح کی پیش کش اپنے کمزور ہونے کی وجہ سے نہیں کی تھی، ورنہ آپ اس سے بہت پہلے بدر و احد اور خندق میں صلح کی پیش کش کرتے۔ رسول اللہ صلی اللہ علیہ وسلم کا انھیں صلح کی پیش کش کا مطلب یہ تھا کہ آپس کے میل جول سے اسلام کی تعلیم پھیلے گی تو یہ لوگ اسلام لے آئیں گے۔ کفار پہلے لڑائی پر آمادہ تھے مگر جب انھوں نے بیعتِ رضوان کے متعلق سنا تو ڈر گئے اور صلح پر آمادہ ہو گئے، جیسا کہ صحیح بخاری کی مفصل حدیث میں ہے۔ تیسری وجہ یہ ہے کہ ابن کثیر نے فرمایا کہ صلح کی دعوت کفار کی طرف سے تھی جو رسول اللہ صلی اللہ علیہ وسلم نے قبول فرمائی۔ اگر ایسا ہو تو پھر یہ واقعہ اس مقصد کی دلیل کے طور پر پیش نہیں کیا جا سکتا کہ مسلمان کمزور ہوں تو ان کا امام صلح کی دعوت دے سکتا ہے، کیونکہ ابنِ کثیر کے اس قول کے مطابق توصلح کی دعوت کفار کی طرف سے تھی، رسول اللہ صلی اللہ علیہ وسلم نے صرف اسے قبول فرمایا تھا، حالانکہ حقیقت یہی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے خود صلح کا پیغام بھیجا تھا۔ تفصیل کے لیے دیکھیے صحیح بخاری کی {’’كِتَابُ الشُّرُوْطِ، بَابُ الشُّرُوْطِ فِي الْجِهَادِ وَالْمُصَالَحَةِ مَعَ أَهْلِ الْحَرْبِ وَ كِتَابَةِ الشُّرُوْطِ‘‘} کی حدیث (۲۷۳۱،۲۷۳۲)۔ ¤ ➐ یہاں ایک سوال ہے کہ آیت میں اللہ تعالیٰ نے حکم دیا ہے کہ ’’تم صلح کے لیے دعوت مت دو‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے حدیبیہ کے موقع پر صلح کی دعوت کیوں دی؟ جواب اس کا یہ ہے کہ صلح کی دعوت دینے کی ممانعت اس وقت ہے جب مسلمان ہمت ہارتے ہوئے اور بزدلی اور کمینگی اختیار کرتے ہوئے صلح کی دعوت دیں، جیسا کہ {’’ فَلَا تَهِنُوْا وَ تَدْعُوْۤا اِلَى السَّلْمِ  ‘‘} (پس ہمت نہ ہارو اور نہ صلح کی طرف دعوت دو) کے الفاظ سے ظاہر ہے۔ حدیبیہ کی صلح کی دعوت دشمن کی طاقت توڑنے کے بعد اسلام اور مسلمانوں کی مصلحت کی خاطر دی گئی اور اللہ تعالیٰ نے اسے فتح مبین قرار دیا، جیسا کہ آگے سورئہ فتح میں آ رہا ہے۔ بھلا جو صلح دشمن کے غالب اور مسلمانوں کے مغلوب ہونے کی صورت میں کی جائے اسے فتح مبین کہا جا سکتا ہے؟ اگر ایسا کرنا فتح مبین ہوتا تو یہ کام رسول اللہ صلی اللہ علیہ وسلم بدر و احد سے بہت پہلے کر لیتے۔ پھر نہ ہجرت کی نوبت آتی، نہ جنگیں لڑنا پڑتیں اور نہ ہی اتنی شہادتیں ہوتیں، مگر یاد رکھیں! پھر مشرق سے مغرب تک اسلام کا پھر یرا بھی نہیں لہرا سکتا تھا۔ ¤ ➑ ان آیات میں ان مسلمانوں کا ذکر ہے جو میدانِ قتال میں اتر چکے ہیں، جو مسلمان کفار کے نرغے سے نکل ہی نہ سکیں کہ ہجرت کے بعد جہاد کر سکیں، اللہ تعالیٰ نے انھیں مستضعفین کہہ کر معذور قرار دیا ہے۔ (دیکھیے نساء: ۹۷ تا ۹۹) اور ایسے مستضعفین کو آزادی دلانے کے لیے تمام مسلمانوں کو لڑنے کا حکم دیا ہے۔ دیکھیے سورئہ نساء (۷۵)۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) ➊ { اِنَّمَا الْحَيٰوةُ الدُّنْيَا لَعِبٌ وَّ لَهْوٌ …:} اس کی تفصیل کے لیے دیکھیے سورۂ عنکبوت کی آیت (۶۴) کی تفسیر۔ جہاد سے روکنے والی سب سے بڑی چیز دنیا کی زندگی، اس کے مال و دولت اور اس کی دل فریبیوں سے محبت ہے، کیونکہ جہاد میں جان و مال دونوں کی قربانی دینا پڑتی ہے۔ اس لیے اللہ تعالیٰ نے فرمایا کہ آخرت کے مقابلے میں دنیا کی حقیقت اس سے زیادہ نہیں کہ یہ چند دن کا کھیل اور دل لگی ہے، اس کی محبت میں پھنس کر اللہ کی راہ میں جان و مال کی قربانی سے دریغ نہ کرو اور یقین رکھو کہ اگر تم ایمان اور تقویٰ اختیار کرو گے، جس میں جان و مال پیش کر دینا بھی شامل ہے تو اللہ تعالیٰ تمھیں تمھارے اجر پورے پورے دے گا اور تم سے تمھارے سارے اموال کا مطالبہ نہیں کرے گا بلکہ ان میں سے معمولی حصے پر اکتفا کرے گا۔ مثلاً سال کے بعد اموال میں سے چالیسواں حصہ، کھیتی میں سے بیسواں یا دسواں حصہ، جنگ کے بعد غنیمت میں سے پانچواں حصہ اور دوسرے پیش آنے والے مواقع پر ضرورت کے مطابق مال کا کچھ حصہ۔ لیکن اگر تم نے ایمان و تقویٰ کے بجائے کفر و عناد پر اصرار کیا تو وہ اپنے مجاہد بندوں کے ذریعے سے تم سے تمھارے سارے اموال چھین لے گا۔ ایمان و تقویٰ کے تقاضے کے مطابق وہ معمولی حصہ جو تم نے خرچ کیا ہے اس کا بھی پورا پورا بدلا وہ تمھیں دنیا اور آخرت میں دے دے گا۔ شاہ عبد القادر لکھتے ہیں: ’’ حق تعالیٰ نے ملک فتح کر دیے، مسلمانوں کو تھوڑے ہی دن مال خرچ کرنا پڑا، سو جتنا خرچ کیا تھا اس سے سو سو گنا ہاتھ لگا۔ اسی لیے (قرآن کریم میں کئی جگہ) فرمایا ہے کہ اللہ کو قرض دو۔‘‘ ¤ ➋ { وَ لَا يَسْـَٔلْكُمْ اَمْوَالَكُمْ:} ’’اور تم سے تمھارے اموال نہیں مانگے گا‘‘ کا مطلب یہ ہے کہ وہ تم سے تمھارے اموال پورے کے پورے نہیں مانگے گا۔ ہاں، وہ تمھارے اموال میں سے ایک حصہ خرچ کرنے کی دعوت ضرور دیتا ہے۔ اس مطلب کے کئی قرینے ان آیات میں موجود ہیں جن میں سے ایک قرینہ {’’ أَمْوَالٌ‘‘} کی اضافت ضمیر {’’كُمْ‘‘} کی طرف ہے۔ ظاہر ہے ’’تمھارے اموال‘‘ میں وہ تمام اموال آ جاتے ہیں جو تمھاری ملکیت ہیں۔ دوسرا قرینہ {’’ يُؤْتِكُمْ اُجُوْرَكُمْ ‘‘} ہے، کیونکہ اس سے مراد یہ ہے کہ وہ تمھیں تمھارے اجر پورے پورے دے گا۔ تو جس طرح {’’ اُجُوْرَكُمْ ‘‘} سے پورے اجر مراد ہیں اسی طرح {’’ اَمْوَالَكُمْ ‘‘} سے بھی پورے اموال مراد ہیں۔ تیسرا قرینہ اس آیت سے اگلی آیت میں لفظ {’’ فَيُحْفِكُمْ ‘‘} ہے، جس سے ظاہر ہے کہ اللہ تعالیٰ بندوں سے ان کے اموال کا {’’إِحْفَاءٌ‘‘} نہیں چاہتا، یعنی پورے نہیں مانگنا۔ ان تمام قرائن کی وجہ سے {’’ لَا يَسْـَٔلْكُمْ اَمْوَالَكُمْ ‘‘} کا واضح مطلب یہ ہے کہ وہ تم سے تمھارے سارے اموال نہیں مانگے گا۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) { اِنْ يَّسْـَٔلْكُمُوْهَا فَيُحْفِكُمْ تَبْخَلُوْا … : ’’ فَيُحْفِكُمْ ‘‘ ’’ أَحْفٰي يُحْفِيْ إِحْفَاءً ‘‘} (افعال) کا معنی کسی چیز کو سمیٹ کر پوری کی پوری لے لینا، یا کسی چیز کا اصرار کے ساتھ مطالبہ کرنا ہے۔ یعنی اللہ تعالیٰ تم سے تمھارے سارے اموال مانگ لے تو یہ اس کا حق ہے، کیونکہ وہ سب اسی کے دیے ہوئے ہیں مگر یہ اس کا کرم ہے کہ وہ تم سے تمھارے اموال پورے کے پورے نہیں مانگتا، کیونکہ اگر وہ سب کے سب اصرار کے ساتھ مانگ لے تو تم بخل کرو گے اور تمھارا بخل تمھارے دل میں پیدا ہونے والے تمام کینے ظاہر کر دے گا، جو سارا مال مانگنے کی وجہ سے تمھارے دل میں پیدا ہوں گے، کیونکہ مال تمھارا محبوب ہے اور جس کے محبوب کو اس سے مانگا جائے اس کے دل میں مانگنے والے کے خلاف کینہ پیدا ہو جاتا ہے۔ اس لیے اللہ تعالیٰ نے تم سے مطالبہ ہی اتنا کیا ہے جس سے تم اتنی سخت آزمائش میں نہ پڑو اور اگر کسی دل میں نفاق یا اسلام اور مسلمانوں کے خلاف کینے کی کوئی بات ہو بھی تو اس پر پردہ پڑا رہے۔ آیات کا مقصد اللہ کی راہ میں خرچ کرنے کی ترغیب اور یہ حوصلہ دلانا ہے کہ تم سے کوئی مشکل مطالبہ نہیں کیا جا رہا جو تم پورا نہ کر سکو، اس لیے خوش دلی کے ساتھ جہاد میں اپنے اموال خرچ کرو۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ {هٰۤاَنْتُمْ هٰۤؤُلَآءِ تُدْعَوْنَ لِتُنْفِقُوْا … : ’’هَا‘‘} حرف تنبیہ ہے، خبردار، یاد رکھو، سن لو۔ {’’ أَنْتُمْ ‘‘} مبتدا اور {’’ هٰۤؤُلَآءِ ‘‘} اس کی خبر ہے جو {’’ اَلَّذِيْنَ ‘‘} کے معنی میں ہے اور {’’ تُدْعَوْنَ لِتُنْفِقُوْا فِيْ سَبِيْلِ اللّٰهِ ‘‘ ’’ هٰۤؤُلَآءِ ‘ ‘‘} کا صلہ ہے۔ یعنی یاد رکھو! تم وہ لوگ ہو کہ تمھیں دعوت دی جاتی ہے کہ اللہ کے راستے میں خرچ کرو تو تم میں سے کچھ وہ ہیں جو بخل کرتے ہیں۔ ¤ ➋ { وَ مَنْ يَّبْخَلْ فَاِنَّمَا يَبْخَلُ عَنْ نَّفْسِهٖ:} یعنی جو شخص اللہ کے راستے میں خرچ کرنے سے بخل کرتا ہے وہ اپنے خیال میں سمجھتا ہے کہ میں نے اللہ تعالیٰ سے بخل کیا ہے اور اسے مال نہیں دیا، حالانکہ درحقیقت وہ اپنے آپ ہی سے بخل کر رہا ہے اور اپنے آپ پر وہ مال خرچ نہیں کر رہا، کیونکہ اگر وہ اللہ تعالیٰ کے کہنے پر خرچ کرتا تو اس کا سارا فائدہ اسی کو ہونا تھا۔ اب اس نے بخل کیا تو اپنی ذات سے بخل کیا اور خود ہی محروم رہا۔ ¤ ➌ { وَ اللّٰهُ الْغَنِيُّ وَ اَنْتُمُ الْفُقَرَآءُ: ’’ الْغَنِيُّ ‘‘} اور {’’ الْفُقَرَآءُ ‘‘} پر الف لام آنے سے حصر پیدا ہو گیا، یعنی اللہ ہی غنی ہے اور کوئی غنی نہیں اور تم ہی محتاج ہو اللہ تعالیٰ کو کوئی محتاجی نہیں۔ مطلب یہ ہے کہ اللہ تعالیٰ نے تمھیں خرچ کرنے کا حکم اپنی کسی ضرورت کے لیے نہیں دیا، وہ تو غنی ہے، محتاج تم ہی ہو اور تم جو کچھ خرچ کرو گے وہ بے حساب اضافے کے ساتھ تمھی کو لوٹا دے گا، جیسا کہ فرمایا: « مَنْ ذَا الَّذِيْ يُقْرِضُ اللّٰهَ ققَرْضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗۤ اَضْعَافًا كَثِيْرَةً وَ اللّٰهُ يَقْبِضُ وَ يَبْصُۜطُ وَ اِلَيْهِ تُرْجَعُوْنَ» [ البقرۃ : ۲۴۵ ] ’’کون ہے وہ جو اللہ کو قرض دے، اچھا قرض، پس وہ اسے اس کے لیے بہت زیادہ گنا بڑھا دے اور اللہ بند کرتا اور کھولتا ہے اور تم اسی کی طرف لوٹائے جاؤ گے۔ ‘‘ ¤ ➍ {وَ اِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُوْنُوْۤا اَمْثَالَكُمْ:} اس کی تفصیل کے لیے دیکھیے سورۂ مائدہ کی آیت (۵۴) کی تفسیر۔"
    }
  ]
}