{
  "surah": "Al-Fath",
  "surah_number": 48,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "سورۃ الفتح یہ سورت اس وقت نازل ہوئی جب رسول اللہ صلی اللہ علیہ وسلم حدیبیہ سے واپس آ رہے تھے۔ یہ ذوالقعدہ سنہ ۶ ہجری کی بات ہے، آپ صلی اللہ علیہ وسلم چودہ سو صحابہ کے ساتھ عمرہ کے لیے روانہ ہوئے، حدیبیہ کے مقام پر پہنچے تو مشرکین نے آپ کو عمرہ ادا کرنے سے روک دیا۔ قصہ لمبا ہے، مختصر یہ کہ دونوں طرف سے بار بار سفیروں کی آمد و رفت کے بعد دس سال کے لیے صلح اور جنگ بندی کا معاہدہ ہو گیا۔ اس کی کچھ شروط مسلمانوں کو پسند نہیں تھیں، مگر رسول اللہ صلی اللہ علیہ وسلم نے صلح کی مصلحتوں کے پیشِ نظر انھیں قبول فرمایا۔ بعد میں مسلمانوں نے صلح کے خوشگوار اثرات دیکھے تو وہ بھی مطمئن ہو گئے۔ ¤ (آیت 1) ➊ {اِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا:} لفظ {’’ فَتْحًا ‘‘} سے بظاہر یہ معلوم ہوتا ہے کہ اس سے مراد فتح مکہ اور اس کے قریب ہونے والی فتوحات ہیں اور یقینا یہ الفاظ فتح مکہ پر بھی صادق آتے ہیں، مگر صحابہ کرام اور محقق اہل علم نے اس کا سبب نزول صلح حدیبیہ بیان فرمایا ہے۔ چنانچہ قتادہ بیان کرتے ہیں کہ انس رضی اللہ عنہ نے {’’ اِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا ‘‘} کے متعلق فرمایا کہ اس سے مراد صلح حدیبیہ ہے۔ [ بخاري، التفسیر، سورۃ الفتح : ۴۸۳۴ ] اور براء بن عازب رضی اللہ عنہما نے فرمایا: ’’تم فتح مکہ کو فتح سمجھتے ہو اور واقعی فتح مکہ فتح تھی مگر ہم حدیبیہ کے دن بیعتِ رضوان کو فتح شمار کرتے ہیں۔‘‘ [ بخاري، المغازي، باب غزوۃ الحدیبیۃ : ۴۱۵۰ ] زید بن اسلم اپنے والد سے بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اپنے ایک سفر میں چل رہے تھے، رات کو عمر بن خطاب رضی اللہ عنہ بھی آپ کے ساتھ چل رہے تھے۔ عمر بن خطاب رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم سے کسی چیز کے متعلق سوال کیا تو آپ صلی اللہ علیہ وسلم نے انھیں جواب نہ دیا، انھوں نے پھر سوال کیا تو آپ صلی اللہ علیہ وسلم نے جواب نہ دیا، انھوں نے پھر آپ صلی اللہ علیہ وسلم سے سوال کیا تو آپ صلی اللہ علیہ وسلم نے جواب نہ دیا۔ عمر بن خطاب رضی اللہ عنہ نے کہا : ’’عمر! تیری ماں تجھے گم پائے، تو نے اصرار کے ساتھ رسول اللہ صلی اللہ علیہ وسلم سے تین مرتبہ سوال کیا، لیکن ہر بار آپ نے جواب نہیں دیا۔‘‘ عمر رضی اللہ عنہ فرماتے ہیں، چنانچہ میں اپنی اونٹنی کو حرکت دے کر مسلمانوں سے آگے نکل گیا، اس خوف سے کہ کہیں میرے بارے میں قرآن نازل نہ ہو جائے۔ کچھ دیر بعد ہی اچانک سنا تو ایک اعلان کرنے والا میررا نام لے کر بلانے کے لیے اعلان کر رہا تھا، میں واپس رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا اور میں یہی سمجھ رہا تھا کہ میرے بارے میں قرآن نازل ہوا ہے۔ میں نے سلام کہا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَقَدْ أُنْزِلَتْ عَلَيَّ اللَّيْلَةَ سُوْرَةٌ لَهِيَ أَحَبُّ إِلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ، ثُمَّ قَرَأَ : « اِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا »] [ بخاري، المغازي، باب غزوۃ الحدیبیۃ : ۴۱۷۷ ] ’’رات مجھ پر وہ سورت اتری ہے جو مجھے ہر اس چیز سے زیادہ محبوب ہے جس پر سورج طلوع ہوتا ہے۔ پھر آپ صلی اللہ علیہ وسلم نے پڑھا : « اِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا » ’’بے شک ہم نے تجھے فتح دی، ایک کھلی فتح۔‘‘ ¤ سہل بن حنیف رضی اللہ عنہ سے مروی ایک لمبی حدیث کے آخر میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم پر سورۂ فتح نازل ہوئی تو آپ صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ کی طرف پیغام بھیجا اور انھیں سورۂ فتح پڑھوائی۔ انھوں نے کہا : [ يَا رَسُوْلَ اللّٰهِ! أَوَ فَتْحٌ هُوَ ؟ ] ’’اے اللہ کے رسول! کیا یہ فتح ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [نَعَمْ ] ’’ہاں!‘‘ تو ان کا دل خوش ہو گیا اور وہ چلے گئے۔ [ مسلم، الجہاد والسیر، باب صلح الحدیبیۃ … : ۱۷۸۵] ¤ ➋ حقیقت یہ ہے کہ صلح حدیبیہ اسلام اور مسلمانوں کی عظیم فتح تھی، کیونکہ اس کے ساتھ مسلمانوں کو بے شمار فوائد حاصل ہوئے۔ جن میں سے ایک یہ تھا کہ قریش نے مسلمانوں کا وجود تسلیم کر لیا، جو اس سے پہلے وہ کسی صورت تسلیم کرنے کے لیے تیار نہیں تھے۔ ایک یہ کہ دشمن کی حقیقی قوت کا اندازہ ہو گیا اور یہ کہ وہ کس حد تک مزاحمت کر سکتے ہیں۔ ایک یہ کہ اس میں مخلص ایمان والوں اور منافقین کی پہچان ہو گئی، کیونکہ منافقین رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلنے کی جرأت ہی نہیں کر سکے تھے، جیسا کہ آگے {’’ سَيَقُوْلُ لَكَ الْمُخَلَّفُوْنَ‘‘} میں آ رہا ہے۔ ایک یہ کہ جزیرۂ عرب میں امن قائم ہو جانے سے کفار اور مسلمانوں کا ایک دوسرے سے میل جول شروع ہو گیا۔ کفار نے رسول اللہ صلی اللہ علیہ وسلم اور مسلمانوں کی بات سنی، ان کے اخلاق دیکھے، آپس میں بحث و مناظرہ ہوا اور دعوت کا دائرہ وسیع ہوا، جس کے نتیجے میں بہت بڑی تعداد نے اسلام قبول کر لیا۔ اسی کا نتیجہ تھا کہ اس سے پہلے حدیبیہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چودہ سو صحابہ آئے تھے، لیکن صرف دو سال بعد فتح مکہ کے سال آپ صلی اللہ علیہ وسلم دس ہزار صحابہ کے ساتھ فاتحانہ شان سے مکہ میں داخل ہوئے۔ ¤ ➌ اس آیت میں اللہ تعالیٰ نے تین طرح کی تاکید کے ساتھ اس فتح کی اہمیت بیان فرمائی، ایک اس کی عظمت کے اظہار کے لیے اس کی نسبت اپنی طرف دو دفعہ جمع متکلم کے صیغے کے ساتھ فرمائی، ایک {’’ اِنَّا ‘‘} اور دوسرا {’’ فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا ‘‘} اور دوسری یہ کہ {’’ فَتَحْنَا ‘‘} کی تاکید مفعول مطلق {’’ فَتْحًا مُّبِيْنًا ‘‘} کے ساتھ فرمائی اور تیسری یہ کہ اسے {’’ فَتْحًا مُّبِيْنًا ‘‘} (فتح مبین) قرار دیا، یعنی بے شک ہم نے تیرے لیے فتح دی، ایک کھلی فتح۔ ¤ ➍ {’’ اِنَّا فَتَحْنَا لَكَ ‘‘} میں {’’ لَكَ ‘‘} (تیرے لیے) کے الفاظ میں رسول اللہ صلی اللہ علیہ وسلم کی تکریم و تشریف کا اظہار ہو رہا ہے، جس سے امت کو آپ صلی اللہ علیہ وسلم کی قدر پہچاننے اور آپ صلی اللہ علیہ وسلم کی اطاعت اور اتباع کی تعلیم دینا مقصود ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { لِيَغْفِرَ لَكَ اللّٰهُ مَا تَقَدَّمَ مِنْ ذَنْۢبِكَ وَ مَا تَاَخَّرَ:’’ لِيَغْفِرَ ‘‘} کا لام ’’لامِ عاقبت‘‘ ہے، یعنی ہم نے آپ کو یہ فتح مبین عطا فرمائی تاکہ آپ کو اس کے نتیجے میں چار عظیم نعمتیں حاصل ہوں۔ گویا اللہ تعالیٰ اپنے رسول صلی اللہ علیہ وسلم کو فرما رہے ہیں کہ آپ نے اپنی رسالت کا حق ادا کیا، میرا پیغام پہنچایا، جان مار کر محنت کی، اپنی زبان اور تلوار کے ساتھ جہاد کیا، مسلمانوں کی ایک مخلص ترین جماعت تیار کی، سختی کے موقع پر سختی اور نرمی کے موقع پر نرمی کی اور مختصر سے عرصے میں وہ کامیابی حاصل کی جو طویل مدتوں میں کوئی حاصل نہ کر سکا، حتیٰ کہ وہ کام پورا کر دکھایا جو ہم نے آپ کے ذمے لگایا تھا۔ اب آپ اپنی محنت کا پھل اٹھائیں گے، جس سے دنیا اور آخرت میں آپ کی آنکھیں ٹھنڈی ہوں گی، چنانچہ ہم نے آپ کے لیے واضح فتح عطا کی، جس کے نتیجے میں پہلی نعمت آپ کو یہ ملی کہ نبوت سے پہلے اور بعد کے گناہ اللہ تعالیٰ نے آپ کو بخش دیے۔ ¤ ➋ یہاں ایک مشہور سوال ہے کہ کیا نبی سے بھی گناہ کا صدور ہو سکتا ہے؟ بعض حضرات نے انبیائے کرام علیھم السلام سے گناہ صادر ہونے کو ناممکن قرار دیا ہے ،کیونکہ ان کے نزدیک نبی سے گناہ کا صادر ہونا اس کی شان کے خلاف ہے، مگر اس کا کیا کیا جائے کہ قرآن مجید نے آپ صلی اللہ علیہ وسلم کے متعلق لفظ {’’ذَنْبٌ‘‘} استعمال کیا ہے، جس کا معروف و مشہور معنی گناہ ہے۔ اس لیے فارسی اور اردو تقریباً تمام مترجمین نے یہاں {’’ذَنْبٌ‘‘} کا معنی گناہ کیا ہے۔ رہی یہ بات کہ آپ کی طرف لفظ گناہ کی نسبت سے آپ کی شان میں کمی کا اظہار ہوتا ہے، تو جو لوگ ایسا سمجھتے ہیں اس کی وجہ یہ ہے کہ وہ انبیاء کے گناہوں کو اپنے گناہوں کی طرح سمجھ لیتے ہیں۔ اصل معاملہ یہ ہے کہ اللہ تعالیٰ نے انبیاء علیھم السلام کو جتنا عظیم اور بلند مرتبہ عطا فرمایا ہے اسے ملحوظ رکھتے ہوئے وہ اپنی معمولی کوتاہیوں اور لغزشوں کو گناہ قرار دیتے ہیں اور اللہ تعالیٰ بھی انھیں {’’ذنوب‘‘} کہہ کر ان سے استغفار کا حکم دیتا ہے، اسی لیے وہ اللہ تعالیٰ کی جناب میں استغفار کرتے ہیں جس سے ان کا مرتبہ پہلے سے بھی بلند ہو جاتا ہے۔ مثلاً موسیٰ علیہ السلام سے خطا کے ساتھ قبطی قتل ہو گیا تو انھوں نے دعا کی : «رَبِّ اِنِّيْ ظَلَمْتُ نَفْسِيْ فَاغْفِرْ لِيْ فَغَفَرَ لَهٗ » [ القصص : ۱۶ ] ’’اے میرے ر ب! میں نے اپنی جان پر ظلم کیا، سو تو مجھے بخش دے، تو اللہ نے اسے بخش دیا۔‘‘ آدم علیہ السلام منع کرنے کے باوجود بھول کر اس پودے میں سے کھا بیٹھے تو کہا : « رَبَّنَا ظَلَمْنَاۤ اَنْفُسَنَا وَ اِنْ لَّمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ » [ الأعرراف : ۲۳ ] ’’اے ہمارے رب ! ہم نے اپنی جانوں پر ظلم کیا اور اگر تو نے ہمیں نہ بخشا اور ہم پر رحم نہ کیا تو یقینا ہم ضرور خسارہ پانے والوں سے ہو جائیں گے۔‘‘ تو اللہ تعالیٰ نے اس استغفار کے نتیجے میں انھیں {’’مجتبيٰ‘‘} بنا لیا، فرمایا : « ثُمَّ اجْتَبٰهُ رَبُّهٗ فَتَابَ عَلَيْهِ وَ هَدٰى» [ طٰہٰ : ۱۲۲ ] ’’پھر اس کے رب نے اسے چن لیا، تو اس پر مہربانی فرمائی اور ہدایت دی۔ ‘‘ یونس علیہ السلام بغیر اجازت قوم کو چھوڑ کر چلے گئے تو مچھلی کے پیٹ سے اللہ تعالیٰ کو پکارا: «لَاۤ اِلٰهَ اِلَّاۤ اَنْتَ سُبْحٰنَكَ اِنِّيْ كُنْتُ مِنَ الظّٰلِمِيْنَ » [الأنبیاء: ۸۷] ’’تیرے سوا کوئی معبود نہیں، تو پاک ہے، یقینا میں ظلم کرنے والوں سے ہو گیا ہوں۔ ‘‘ اس استغفار کے نتیجے میں انھیں وہ مقام حاصل ہوا جو خطا نہ ہونے اور استغفار نہ کرنے کی صورت میں کبھی حاصل نہ ہوتا، فرمایا : « فَاجْتَبٰىهُ رَبُّهٗ فَجَعَلَهٗ مِنَ الصّٰلِحِيْنَ » [ القلم : ۵۰ ] ’’پھر اس کے رب نے اسے چن لیا، پس اسے نیکوں میں شامل کردیا۔ ‘‘ ¤ بنی آدم کا فرشتوں سے یہی فرق ہے کہ فرشتوں سے نہ خطا ہوتی ہے، نہ انھیں استغفار کی ضرورت ہوتی ہے اور نہ وہ استغفار سے حاصل ہونے والا بلند مقام حاصل کر سکتے ہیں۔ انبیائے کرام علیھم السلام ہماری طرح کبیرہ گناہوں کا ارتکاب یا دیدہ و دانستہ نافرمانی نہیں کرتے، کیونکہ وہ اللہ تعالیٰ کے چنے ہوئے فرماں بردار بندے ہوتے ہیں، البتہ ان سے بشری تقاضوں کے پیشِ نظر کوئی معمولی کوتاہی یا اجتہادی خطا ہو جاتی ہے۔ انبیاء کی خصوصیت یہ ہے کہ اللہ تعالیٰ انھیں اس خطا یا کوتاہی پر قائم نہیں رہنے دیتا، بلکہ وحی کے ذریعے سے فوراً اصلاح فرما دیتا ہے، انبیاء کے معصوم ہونے کا یہی مطلب ہے۔ کسی امتی کو، خواہ وہ کتنے بلند منصب پر فائز ہو یہ امتیاز حاصل نہیں کہ اس کی خطا کی اللہ تعالیٰ کی طرف سے وحی کے ذریعے سے اصلاح کی جائے۔ انبیاء سے سرزد ہونے والی یہ معمولی کوتاہیاں یا اجتہادی خطائیں بھی ان کے مقام کے پیشِ نظر خود انھیں اتنی بڑی نظر آتی ہیں کہ وہ بار بار اللہ تعالیٰ سے مغفرت کی دعا کرتے ہیں۔ ہمارے نبی مکرم صلی اللہ علیہ وسلم کو اللہ تعالیٰ نے اپنے ’’ذنوب‘‘ سے مغفرت مانگنے کا حکم دیا، جس پر عمل کرتے ہوئے آپ بے حد استغفار کرتے تھے۔ دیکھیے سورۂ محمد کی آیت (۱۹) کی تفسیر۔ استغفار کی وہ مختلف دعائیں جو رسول اللہ صلی اللہ علیہ وسلم اللہ کی جناب میں کیا کرتے تھے ان تمام دعاؤں میں لفظ ’’ذنب‘‘ استعمال ہوا ہے۔ ہم یہی کہہ سکتے ہیں کہ یہ اللہ تعالیٰ کا اور اس کے رسول کا معاملہ ہے کہ آپ صلی اللہ علیہ وسلم ذنوب کا اقرار کر کے استغفار کر رہے ہیں اور اللہ تعالیٰ آپ صلی اللہ علیہ وسلم کو پہلے اور پچھلے ذنوب کی مغفرت کی خوش خبری دے رہے ہیں۔ صحابہ کرام رضی اللہ عنھم بھی اس بات کا حوالہ دیا کرتے تھے کہ اللہ تعالیٰ نے آپ کے لیے آپ کے پہلے اور پچھلے ذنوب معاف فرما دیے ہیں، جیسا کہ ام المومنین عائشہ رضی اللہ عنھا بیان کرتی ہیں : [ أَنَّ نَبِيَّ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُوْمُ مِنَ اللَّيْلِ حَتّٰی تَتَفَطَّرَ قَدَمَاهُ، فَقَالَتْ عَائِشَةُ لِمَ تَصْنَعُ هٰذَا يَا رَسُوْلَ اللّٰهِ! وَقَدْ غَفَرَ اللّٰهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ؟ قَالَ أَفَلاَ أُحِبُّ أَنْ أَكُوْنَ  عَبْدًا شَكُوْرًا؟ ] [ بخاري، التفسیر، باب قولہ : «لیغفر لک اللہ ما تقدم…» : ۴۸۳۷ ] ’’نبی صلی اللہ علیہ وسلم رات اتنا قیام کرتے حتیٰ کہ آپ کے قدم پھٹ جاتے تو عائشہ رضی اللہ عنھا نے کہا: ’’یا رسول اللہ! آپ اس طرح کیوں کرتے ہیں، حالانکہ اللہ تعالیٰ نے آپ کے لیے آپ کے پہلے اور پچھلے گناہ بخش دیے ہیں؟‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ’’تو کیا میں شکر گزار بندہ بننا پسند نہ کروں ؟‘‘ ¤ یہی وجہ ہے کہ پہلے تقریباً سبھی ترجمہ کرنے والوں نے ’’ذنب ‘‘ کا معنی گناہ کیا ہے۔ یہ ترجمہ کرنے والے قرآن مجید کے یہ سب خدام کیا نعوذ باللہ رسول اللہ صلی اللہ علیہ وسلم کے گستاخ اور رسول اللہ صلی اللہ علیہ وسلم کے مقام سے ناآشنا تھے؟ بعض لوگوں کا کہنا ہے کہ اس سے تو رسول اللہ صلی اللہ علیہ وسلم گناہ گار ٹھہرتے ہیں۔ آپ ان حضرات سے پوچھیں کہ آپ ’’ذنب‘‘ کا ترجمہ کرکے بتایے، ان میں سے ایک صاحب نے {’’ لِيَغْفِرَ لَكَ اللّٰهُ مَا تَقَدَّمَ مِنْ ذَنْۢبِكَ وَ مَا تَاَخَّرَ ‘‘} کا ترجمہ کیا ہے : ’’تاکہ اللہ تعالیٰ آپ کی اگلی پچھلی سب خطائیں معاف فرما دے۔‘‘ ایک اور صاحب نے ترجمہ کیا ہے : ’’تاکہ اللہ تعالیٰ تمھاری اگلی پچھلی ہر کوتاہی سے درگزر فرمائے۔‘‘ اپنے خیال میں ان حضرات نے نبی صلی اللہ علیہ وسلم کو گناہ گار ہونے سے تو بچا لیا مگر انھیں خطا کار اور کوتاہی کا مرتکب ہونے سے تو نہ بچا سکے، بتائیے آپ نے کون سا معرکہ سر کیا؟ حقیقت یہ ہے کہ ایک آدھ معمولی گناہ و خطا سے آدمی نہ گناہ گار کے لقب کا حق دار بنتا ہے اور نہ ہی اسے خطا کار یا کوتاہ کار کہہ سکتے ہیں۔ ¤ بعض حضرات نے یہاں ذنب کا معنی الزام کیا ہے اور ترجمہ کیا ہے : ’’تاکہ اللہ تعالیٰ آپ پر لگائے گئے پہلے پچھلے تمام الزامات دور کر دے۔‘‘ ان حضرات سے کوئی پوچھے کہ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کی جن کاموں پر باز پرس فرمائی اور ساتھ ہی انھیں معاف کر دینے کی بشارت بھی دے دی، کیا وہ سب الزامات تھے جو اللہ تعالیٰ نے غلط قرار دے کر دور فرما دیے؟ مثلاً فرمایا : « يٰۤاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ لَككَ تَبْتَغِيْ مَرْضَاتَ اَزْوَاجِكَ وَ اللّٰهُ غَفُوْرٌ رَّحِيْمٌ » [ التحریم : ۱ ] ’’اے نبی! تو کیوں حرام کرتا ہے جو اللہ نے تیرے لیے حلال کیا ہے؟ تو اپنی بیویوں کی خوشی چاہتا ہے، اور اللہ بہت بخشنے والا، نہایت رحم والا ہے۔‘‘ اور فرمایا : « عَفَا اللّٰهُ عَنْكَ لِمَ اَذِنْتَ لَهُمْ حَتّٰى يَتَبَيَّنَ لَكَ الَّذِيْنَ صَدَقُوْا وَ تَعْلَمَ الْكٰذِبِيْنَ » [التوبۃ : ۴۳ ] ’’اللہ نے تجھے معاف کردیا، تو نے انھیں کیوں اجازت دی، یہاں تک کہ تیرے لیے وہ لوگ صاف ظاہر ہو جاتے جنھوں نے سچ کہا اور تو جھوٹوں کو جان لیتا۔ ‘‘ اور فرمایا : « مَا كَانَ لِنَبِيٍّ اَنْ يَّكُوْنَ لَهٗۤ اَسْرٰى حَتّٰى يُثْخِنَ فِي الْاَرْضِ تُرِيْدُوْنَ عَرَضَ الدُّنْيَا وَ اللّٰهُ يُرِيْدُ الْاٰخِرَةَ وَ اللّٰهُ عَزِيْزٌ حَكِيْمٌ» [ الأنفال : ۶۷ ] ’’کبھی کسی نبی کے لائق نہیں کہ اس کے ہاں قیدی ہوں، یہاں تک کہ وہ زمین میں خوب خون بہا لے، تم دنیا کا سامان چاہتے ہو اور اللہ آخرت کو چاہتا ہے اور اللہ سب پر غالب، کمال حکمت والا ہے۔‘‘ اور فرمایا : « وَ تَخْشَى النَّاسَ وَ اللّٰهُ اَحَقُّ اَنْ تَخْشٰىهُ» [ الأحزاب : ۳۷ ] ’’اور تو لوگوں سے ڈرتا تھا، حالانکہ اللہ زیادہ حق دار ہے کہ تو اس سے ڈرے۔‘‘ ¤ اصل بات یہ ہے کہ ایسے حضرات غلو کی وجہ سے ہر اس شخص کو گستاخِ رسول قرار دینے پر تلے ہوئے ہیں جو ان کی طرح نبی صلی اللہ علیہ وسلم کو خدائی صفات کا مالک قرار نہ دے، آپ کو عالم الغیب نہ مانے، مختارِ کل تسلیم نہ کرے، یا یہ نہ مانے کہ آپ صلی اللہ علیہ وسلم سے خطا ہو سکتی ہی نہیں۔ ان میں سے بعض حضرات نے اس مقام پر ذنب کا معنی تو گناہ ہی کیا ہے، مگر اس آیت کے ترجمے میں تحریفِ قرآن کے اتنے بڑے جرم کا ارتکاب کیا ہے کہ اگر اللہ تعالیٰ کا اس امت کو مہلت دینے کا فیصلہ نہ ہوتا تو ان کانام و نشان مٹا دیا جاتا۔ چنانچہ ان میں سے ایک صاحب نے {’’ لِيَغْفِرَ لَكَ اللّٰهُ مَا تَقَدَّمَ مِنْ ذَنْۢبِكَ وَ مَا تَاَخَّرَ ‘‘} کا ترجمہ کیا ہے : ’’تاکہ اللہ تمھارے سبب سے گناہ بخشے تمھارے اگلوں کے اور تمھارے پچھلوں کے۔‘‘ ایک اور صاحب نے ترجمہ کیا ہے : ’’تاکہ آپ کی خاطر اللہ آپ کی امت (کے ان تمام افراد) کی اگلی پچھلی خطائیں معاف فرما دے (جنھوں نے آپ کے حکم پر جہاد کیے اور قربانیاں دیں)۔‘‘ ان لوگوں کی تحریف پر جرأت دیکھیے، لفظ {’’ ذَنْۢبِكَ ‘‘} کا معنی ’’تیرے گناہ‘‘ کے علاوہ ہو ہی نہیں سکتا، مگر یہ لوگ اس کا ترجمہ ’’تیری امت کے اگلے پچھلے گناہ‘‘ کر رہے ہیں اور حبِ رسول کے اتنے بڑے اجارہ دار بنے ہوئے ہیں کہ جو ان کی طرح تحریف نہ کرے، یا ان کی تحریف پر شاباش نہ کہے وہ ان کی نظر میں حبِ رسول سے آشنا ہی نہیں۔ ان لوگوں کے ترجمے کے مطابق تو تمام امتیوں کے اگلے پچھلے گناہ معاف ہو چکے ہیں، اب اگر کوئی قتل یا زنا یا چوری کرتا ہے تو اس پر حد کیسی؟ اسے تو اللہ تعالیٰ کی طرف سے معافی مل چکی ہے۔ یہ سب نتیجہ اسی غلو کا ہے جس سے رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا ہے۔ عمر بن خطاب رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر یہ فرماتے ہوئے سنا : [ لاَ تُطْرُوْنيْ كَمَا أَطْرَتِ النَّصَارَی ابْنَ مَرْيَمَ، فَإِنَّمَا أَنَا عَبْدُهُ ، فَقُوْلُوْا عَبْدُ اللّٰهِ وَرَسُوْلُهُ ] [بخارري، أحادیث الأنبیاء، باب قول اللّٰہ تعالٰی : « واذکر فی الکتاب مریم… » : ۳۴۴۵ ] ’’مجھے حد سے مت بڑھاؤ جس طرح نصاریٰ نے مسیح ابن مریم کو حد سے بڑھا دیا، کیونکہ میں تو صرف اس کا بندہ ہوں، سو تم ’’اللہ کا بندہ اور اس کا رسول ‘‘ کہو۔‘‘ ¤ ➌ اس مقام پر اکثر مفسرین نے نبی کریم صلی اللہ علیہ وسلم کے متعلق لفظ ذنب کی توجیہ کرتے ہوئے ایک جملہ مسلّم قول کے طور پر ذکر فرمایا ہے : {’’ حَسَنَاتُ الْأَبْرَارِ سَيِّئَاتُ الْمُقَرَّبِيْنَ ‘‘} ’’نیک لوگوں کی نیکیاں مقرب لوگوں کی برائیاں ہوتی ہیں۔‘‘ یہ جملہ اللہ تعالیٰ یا اس کے رسول صلی اللہ علیہ وسلم کا تو ہر گز نہیں، اللہ تعالیٰ بہتر جانتا ہے کہ یہ بات کہنے والا کون ہے، مگر اکثر مفسر اور مصنف اسے اندھا دھند بیان کرتے چلے جاتے ہیں۔ نہ یہ سوچتے ہیں کہ نیکی بدی کیسے بن سکتی ہے اور نہ یہ خیال فرماتے ہیں کہ قرآن مجید کے مطابق ابرار و مقربین کی یہ تقسیم سرے سے غلط ہے۔ رسول اللہ صلی اللہ علیہ وسلم سے بڑھ کر کون مقرب ہو گا؟ اور آپ صلی اللہ علیہ وسلم پچھلی رات اٹھ کر جن آیات کی تلاوت کیا کرتے تھے ان میں مذکور دعاؤں میں سے ایک دعا یہ ہے : « وَ تَوَفَّنَا مَعَ الْاَبْرَارِ» [آل عمران : ۱۹۳ ] ’’ اور ہمیں ابرار کے ساتھ فوت کر۔‘‘ پھر وہ کون سے ابرار ہیں جن کی نیکیاں مقربین کی بدیاں ہیں؟ ¤ ➍ {وَ يُتِمَّ نِعْمَتَهٗ عَلَيْكَ:} یہ دوسری نعمت ہے جو صلح حدیبیہ کے نتیجے میں حاصل ہونے کی خوش خبری دی گ گئی۔ اس سے مراد وہ بہت سی نعمتیں عطا کرنا ہے جو اس سے پہلے آپ کو عطا نہیں کی گئی تھیں، مثلاً قریش، اہلِ مکہ اور دوسرے لوگوں کا فوج در فوج اسلام میں داخل ہونا، تمام دشمنوں اور مخالفوں کا زیر ہو جانا، پورے ملک عرب کا آپ کے زیر نگیں ہو جانا اور دین کی تکمیل وغیرہ، جن کا اس موقع پر آپ صلی اللہ علیہ وسلم سے وعدہ کیا گیا اور کچھ ہی عرصہ بعد پورا کر دیا گیا اور اعلان ہو گیا : « اَلْيَوْمَ اَكْمَلْتُ لَكُمْ دِيْنَكُمْ وَ اَتْمَمْتُ عَلَيْكُمْ نِعْمَتِيْ وَ رَضِيْتُ لَكُمُ الْاِسْلَامَ دِيْنًا » [ المائدۃ : ۳ ] ’’آج میں نے تمھارے لیے تمھارا دین کامل کردیا اور تم پر اپنی نعمت پوری کر دی اور تمھارے لیے اسلام کو دین کی حیثیت سے پسند کر لیا۔‘‘ ¤ ➎ {وَ يَهْدِيَكَ صِرَاطًا مُّسْتَقِيْمًا:} یہ تیسری نعمت کا وعدہ ہے کہ  اللہ تعالیٰ اپنے احکام پر عمل، ان کی تبلیغ و جہاد، سلطنت کے معاملات اور فتح و کامرانی کے حصول کے بارے میں آپ کو بالکل سیدھے راستے پر چلائے گا۔ اگرچہ یہ سب کچھ پہلے بھی آپ کو حاصل تھا، مگر اس کے بعد جس وسعت کے ساتھ حاصل ہوا وہ پہلے حاصل نہ تھا۔ مزید دیکھیے سورۂ فاتحہ کی آیت : « اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ » کی تفسیر۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {وَ يَنْصُرَكَ اللّٰهُ نَصْرًا عَزِيْزًا:} چوتھی اور آخری نعمت یہ ہے کہ ’’ نصرِ عزیز‘‘کا ذکر اپنے سب سے باعظمت نام ’’اللہ‘‘ کے ساتھ فرمایا، تاکہ اس کی اہمیت واضح ہو۔ یعنی اللہ تعالیٰ آپ کی ایسی مدد فرمائے گا جس سے آپ کو عزت و قوت اور غلبہ حاصل ہو گا اور آپ کے دشمن عاجز اور مغلوب ہو جائیں گے۔ یہاں مبالغے کے لیے ’’عزیز‘‘ کی نسبت ’’نصر‘‘ کی طرف فرمائی ہے، ورنہ عزیز تو اس کے نتیجے میں رسول اللہ صلی اللہ علیہ وسلم نے ہونا ہی ہے۔ یہ ایسے ہی ہے جیسے کہتے ہیں: {’’ فُلاَنٌ نَهَارُهُ صَائِمٌ وَلَيْلُهُ قَائِمٌ ‘‘} ’’فلاں کا دن روزہ رکھنے والا اور رات قیام کرنے والی ہے۔‘‘"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {هُوَ الَّذِيْۤ اَنْزَلَ السَّكِيْنَةَ فِيْ قُلُوْبِ الْمُؤْمِنِيْنَ: ’’ السَّكِيْنَةةَ ‘‘} سے مراد وہ سکون و اطمینان اور ثباتِ قلب ہے جس کا اتارنا اللہ تعالیٰ نے مدینہ سے نکلنے سے لے کر اس فتح مبین کے حصول تک مومنوں کے دلوں پر مسلسل جاری رکھا اور جو اس فتح کا اہم سبب بنا، ورنہ اگر مسلمان مدینہ سے عمرہ کے لیے نکلتے وقت منافقین کی طرح سوچنے لگتے کہ یہ تو صریحاً موت کے منہ میں جانا ہے، یا راستے میں جب اطلاع ملی کہ قریش لڑنے مرنے پر تلے ہوئے ہیں تو ہمت ہار جاتے، یا حدیبیہ میں پہنچنے پر جس طرح کفار نے مسلمانوں کو مسجد حرام سے روکا اور چھاپے اور شب خون مار مار کر انھیں اشتعال دلانے کی کوشش کی، پھر جب عثمان رضی اللہ عنہ کی شہادت کی خبر پھیلی، ان میں سے کسی موقع پر اگر مسلمان اپنے آپ پر قابو نہ رکھتے اور رسول اللہ صلی اللہ علیہ وسلم کی اطاعت پر قائم نہ رہتے تو یہ فتح مبین کبھی حاصل نہ ہوتی۔ یہ اللہ تعالیٰ کی نازل کردہ سکینت ہی تھی جس نے ہر موقع پر انھیں اطاعت پر ثابت قدم رکھا۔ پھر جب صلح کی وہ شرائط ان کے سامنے آئیں جو مسلمانوں کو سخت ناپسند اور ان کے خیال میں ان کی ذلت کا باعث تھیں، خصوصاً ابوجندل رضی اللہ عنہ مظلومیت کی تصویر بنے ہوئے مجمع عام میں آ کھڑے ہوئے، اس موقع پر اس سکینت ہی کی برکت تھی کہ سب نے رسول اللہ صلی اللہ علیہ وسلم کے فیصلے پر سرِتسلیم خم کر دیا۔ ¤ ➋ { لِيَزْدَادُوْۤا اِيْمَانًا مَّعَ اِيْمَانِهِمْ:} یعنی ایمان انھیں پہلے بھی حاصل تھا مگر ان تمام آزمائشوں میں ثابت قدم رہنے کی وجہ سے ان کے ایمان میں اضافہ ہوتا چلاگیا اور جب اس ثابت قدمی کے خوش گوار نتائج سامنے آئے تو ان کا ایمان مزید بڑھ گیا۔ یہ آیت بھی ان بہت سی آیات و احادیث میں سے ایک ہے جو ایمان میں زیادتی اور کمی کی دلیل ہیں۔ امام بخاری رحمہ اللہ نے متعدد آیات و احادیث کے ساتھ اس مسئلے کو مدلل ذکر فرمایا ہے۔ روح المعانی میں ہے : ’’بخاری نے فرمایا، میں بہت سے شہروں میں ایک ہزار سے زائد علماء سے ملا، میں نے ان میں سے ایک شخص بھی نہیں دیکھا جو اس بات سے اختلاف کرتا ہو کہ ایمان قول اور عمل ہے اور اس میں زیادتی اور کمی ہوتی ہے اور انھوں نے اس کی عقلی اور نقلی دلیلیں بیان کی ہیں۔ عقلی دلیل تو یہ ہے کہ ایمان کی حقیقت میں تفاوت نہ ہو تو امت کے عام آدمیوں کا ایمان، جو فسق و فجور میں منہمک رہتے ہیں، انبیاء کے ایمان کے برابر ہو گا اور یہ لازم باطل ہے، سو ملزوم بھی ایسا ہی ہے اور نقلی دلیل یہ کہ اس مفہوم کی آیات و احادیث بہت زیادہ ہیں جن میں سے ایک یہ آیت ہے جو زیر تفسیر ہے۔‘‘‘ (ملخصاً) یہ بھی معلوم ہوا کہ ایمان میں زیادتی کا مطلب اعمال کے لحاظ سے زیادتی ہی نہیں بلکہ دل کی تصدیق اور اس کے یقین میں بھی زیادتی اور کمی ہوتی ہے۔ کبھی یقین کا یہ حال ہوتا ہے کہ آدمی اپنی جان، مال اور ہر چیز اللہ کی راہ میں لٹانے پر تیار ہو جاتا ہے اور کبھی اس یقین میں ایسی کمی ہوتی ہے کہ اسلام قبول کرتے وقت ایمان کا جو سرمایہ اسے حاصل ہوا تھا وہ بھی خطرے میں پڑ جاتا ہے۔ تعجب اور افسوس ہے ان بڑے بڑے شیوخ الحدیث پر جو اتنی صریح آیات و احادیث کے باوجود یہ ماننے کے لیے تیار نہیں کہ ایمان میں زیادتی اور کمی ہوتی ہے، ان کے علم کا کمال یہی ہے کہ وہ تاویل کے ذریعے سے ثابت کر دیتے ہیں کہ تمام مسلمانوں کا ایمان برابر ہے۔ وجہ صرف یہ ہے کہ ان کے دھڑے کے کسی بزرگ نے کہہ دیا ہے کہ ایمان میں نہ زیادتی ہوتی ہے نہ کمی۔ ¤ ➌ { وَ لِلّٰهِ جُنُوْدُ السَّمٰوٰتِ وَ الْاَرْضِ:} یعنی آپ کو ظاہری اسباب کی کمی کے باوجود یہ فتح مبین آپ کی جد و جہد یا ذاتی کمال کی وجہ سے نہیں بلکہ اللہ تعالیٰ کی مدد کی بدولت حاصل ہوئی، کیونکہ وہی آسمانوں کے اور زمین کے بے شمار لشکروں کا مالک ہے، جس کی چاہتا ہے جس لشکر کے ساتھ چاہتا ہے مدد کر دیتا ہے۔ آسمانوں کے لشکروں کی مثال بدر میں نازل ہونے والے فرشتے، احزاب میں آنے والی آندھی اور بدر میں اترنے والی بارش ہیں اور زمین کے لشکروں کی مثال فتح مکہ کے موقع پر آنے والے دس ہزار مجاہدین کا عظیم الشان لشکر ہے۔ {’’ لِلّٰهِ ‘‘} کو پہلے لانے سے حصر پیدا ہوا، جس کا مطلب ہوا کہ اللہ تعالیٰ مانتا ہی نہیں کہ آسمانوں اور زمین میں اس کے علاوہ بھی کسی کے پاس کوئی لشکر ہے، کیونکہ اس کے سامنے کسی کی کوئی حیثیت نہیں۔ ¤ ➍ { وَ كَانَ اللّٰهُ عَلِيْمًا حَكِيْمًا:} یعنی اللہ تعالیٰ آسمانوں اور زمین  کے لشکروں کا اکیلا مالک ہے اور لشکر بھی ایسے کہ ان میں سے کسی لشکر کا ایک فرد اگر اللہ کا حکم ہو تو تمام کفار کو نیست و نابود کر دے، مگر اس نے یہ فتح مبین اور نصر عزیز صلح کی صورت میں عطا فرمائی، کیونکہ اللہ تعالیٰ سب کچھ جاننے والا، کمال حکمت والا ہے۔ اس کے علم میں یہ بات تھی اور اس کی حکمت کا تقاضا تھا کہ اب کفار کو تلوار کی مار کے بجائے اسلام اور مسلمانوں کو سمجھنے اور ان کی دعوت سننے کا موقع دیا جائے، تاکہ کافر مسلمان ہو جائیں اور دشمن دوست بن جائیں۔ واضح رہے، یہاں {’’ عَلِيْمًا حَكِيْمًا ‘‘} فرمایا ہے، جبکہ آگے جہاںکفار و منافقین کے لیے عذاب اور لعنت کا ذکر فرمایا ہے وہاں {’’ عَزِيْزًا حَكِيْمًا ‘‘} فرمایا ہے، کیونکہ عذاب و غضب کے ذکر کے مناسب صفت علم کے بجائے صفت عزیز ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {لِّيُدْخِلَ الْمُؤْمِنِيْنَ … :} سب سے واضح اور صحیح بات یہی ہے کہ {’’ لِيُدْخِلَ ‘‘} کا لام {’’ هُوَ الَّذِيْۤ اَنْزَلَ السَّكِيْنَةَ ‘‘} کے متعلق ہے۔ مطلب یہ ہے کہ ’’وہی ہے جس نے مومنوں کے دلوں میں سکینت نازل فرمائی، تاکہ وہ اپنے ایمان کے ساتھ ایمان میں اور زیادہ ہو جائیں (اور) تاکہ اس سکینت اور ایمان کی زیادتی کے ذریعے سے اللہ تعالیٰ مومن مردوں اور مومن عورتوں کو ان باغوں میں داخل کرے جن کے تلے نہریں چلتی ہیں۔‘‘ ¤ ➋ { وَ الْمُؤْمِنٰتِ:} مومن عورتوں کا ذکر خاص طور پر یہاں اس لیے فرمایا کہ جہاد کا اجر صرف مردوں کے ساتھ خاص نہ سمجھ لیا جائے، کیونکہ مومن عورتیں بھی جہاد میں شریک ہوتی ہیں۔ وہ اپنے بھائیوں، خاوندوں، بیٹوں، باپوں اور دوسرے عزیزوں کے جہاد پر نکلنے میں رکاوٹ نہیں بنتیں، بلکہ ان کی حوصلہ افزائی کرتی ہیں، ان کی عدم موجودگی میں تنہائی اور دوسری پریشانیوں پر صبر کرتی ہیں اور ان کی شہادت کی صورت میں بیوہ ہونے اور بچوں کے یتیم ہونے پر صبر کرتی ہیں۔ ان میں سے کئی لشکر کے ساتھ جا کر کھانا پکانے، کپڑے دھونے، صفائی کرنے کی اور دوسری خدمات سرانجام دیتی ہیں۔ لڑائی کی صورت میں مجاہدوں کو پانی پلانے، زخمیوں کی مرہم پٹی اور بیماروں کی تیمار داری کا اہتمام کرتی ہیں۔ (ابن عاشور) ¤ ➋ { جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ …:} جنتوں میں داخل کرنے سے مراد یہاں خاص داخلہ ہے جو مجاہدین کے ساتھ خاص ہے، وہ داخلہ نہیں جو محض ایمان اور عمل صالح کی بدولت حاصل ہوتا ہے۔ اس لیے ساتھ ہی فرمایا : « وَ يُكَفِّرَ عَنْهُمْ سَيِّاٰتِهِمْ » ’’اور تاکہ وہ ان سے ان کی برائیاں دور کرے۔‘‘(ابن عاشور) ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ فِی الْجَنَّةِ مِائَةَ دَرَجَةٍ أَعَدَّهَا اللّٰهُ لِلْمُجَاهِدِيْنَ فِيْ سَبِيْلِ اللّٰهِ مَا بَيْنَ الدَّرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ فَإِذَا سَأَلْتُمُ اللّٰهَ فَاسْأَلُوْهُ الْفِرْدَوْسَ فَإِنَّهُ أَوْسَطُ الْجَنَّةِ وَأَعْلَی الْجَنَّةِ أُرَاهُ قَالَ وَ فَوْقَهُ عَرْشُ الرَّحْمٰنِ، وَمِنْهُ تَفَجَّرُ أَنْهَارُ الْجَنَّةِ ] [بخاري، الجھاد والسیر، باب درجات المجاہدین  في سبیل اللّٰہ : ۲۷۹۰ ] ’’جنت میں سو درجے ہیں جو اللہ نے مجاہدین فی سبیل اللہ کے لیے تیار فرمائے ہیں، ہر دو درجوں کے درمیان اتنا فاصلہ ہے جتنا آسمان و زمین کے درمیان ہے، تو جب تم اللہ تعالیٰ سے مانگو تو فردوس کا سوال کرو، کیونکہ وہ جنت کا افضل اور جنت کا اعلیٰ حصہ ہے۔ (یحییٰ بن صالح نے کہا ) میں سمجھتا ہوں یوں کہا کہ اس کے اوپر رحمان کا عرش ہے اور اسی سے جنت کی نہریں پھوٹتی ہیں۔‘‘"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { وَ يُعَذِّبَ الْمُنٰفِقِيْنَ وَ الْمُنٰفِقٰتِ … :} اللہ تعالیٰ کی نازل کردہ سکینت کی بدولت ایمان والے مجاہد مردوں اور عورتوں کے جنت میں داخلے کے ذکر کے بعد ان لوگوں کو عذاب دینے کا ذکر فرمایا جو اس غزوہ کے نتیجے میں اللہ کے غضب اور لعنت کا نشانہ بنے اور جہنم ان کا ٹھکانا بنی۔ منافقین و کفار کو یہ عذاب مسلمانوں کی تلواروں کے ساتھ بھی دیا گیا، جیسا کہ فرمایا: « قَاتِلُوْهُمْ يُعَذِّبْهُمُ اللّٰهُ » [ التوبۃ : ۱۴] ’’ان سے لڑو، اللہ انھیں تمھارے ہاتھوں سے عذاب دے گا۔‘‘ اور مسلسل خوف اور رسوائی کے ساتھ بھی اور مسلمانوں کی کامیابیاں اپنی آنکھوں کے ساتھ دیکھنے کی صورت میں بھی۔ آخرت کا عذاب اس کے علاوہ اور ان سب سے بڑھ کر ہے۔ یہاں منافقین کا ذکر کفار سے پہلے کرنے کا مقصد مسلمانوں کو آگاہ کرنا ہے کہ منافقین کا کفر پوشیدہ ہے، اس لیے وہ زیادہ نقصان پہنچا سکتے ہیں، لہٰذا مسلمانوں کو نہ انھیں بھولنا چاہیے اور نہ ان سے کبھی غافل ہونا چاہیے۔ منافق اور مشرک مردوں کے ساتھ منافق اور مشرک عورتوں کا ذکر اس لیے فرمایا کہ وہ بھی ان کی پوری طرح راز دار، ہر طرح سے معاون اور تمام سازشوں میں شریک ہیں۔ ¤ ➋ { الظَّآنِّيْنَ بِاللّٰهِ ظَنَّ السَّوْءِ:} ’’منافقین‘‘ سے مراد مدینہ منورہ کے منافقین ہیں اور ’’مشرکین‘‘ سے مراد مکہ معظمہ کے مشرکین۔ اللہ تعالیٰ نے ان دونوں کو ذلت و رسوائی کا عذاب دیا، اس لیے کہ منافقین کا اللہ تعالیٰ کے متعلق یہ غلط گمان تھا کہ رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنھم جو عمرۂ حدیبیہ ادا کرنے کے لیے آپ کے ساتھ گئے ہیں وہ واپس مدینہ نہیں آ سکیں گے، مشرکین انھیں وہیں تباہ و برباد کر دیں گے اور مشرکین نے یہ سمجھ رکھا تھا کہ اللہ تعالیٰ ہر گز اپنے دین کو مٹنے سے نہیں بچا سکے گا اور کفر کا کلمہ بلند ہو کر رہے گا۔ (قرطبی وغیرہ) ¤ ➌ { عَلَيْهِمْ دَآىِٕرَةُ السَّوْءِ:} اس جملے کی تفسیر کے لیے دیکھیے سورۂ توبہ کی آیت (۹۸) کی تفسیر۔ یہاں کچھ عبارت محذوف ہے جو خود بخود سمجھ میں آ رہی ہے : {’’ أَيْ اَلظَّانِّيْنَ بِاللّٰهِ ظَنَّ السَّوْءِ وَالْمُتَرَبِّصِيْنَ لَكُمُ الدَّوَائِرَ، عَلَيْهِمْ دَائِرَةُ السَّوْءِ‘‘} ’’(تاکہ ان منافقین و منافقات اور مشرکین و مشرکات کو عذاب دے) جو اللہ کے متعلق برا گمان کرنے والے اور تم پر زمانے کی گردشوں کا انتظار کرنے والے ہیں، بری گردش خود انھی پر آنے والی ہے۔‘‘"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {وَ لِلّٰهِ جُنُوْدُ السَّمٰوٰتِ وَ الْاَرْضِ … :} یہ جملہ پہلے بھی گزر چکا ہے، یہاں اللہ کے جنود سے ڈرانا اور کفار و منافقین کو عذاب، غضب اور لعنت کی وعید سنانا مقصود ہے، جس کے ساتھ عزیز کی صفت مناسبت رکھتی ہے، یعنی اللہ تعالیٰ جسے عذاب دینا چاہے یا ذلیل و رسوا کرنا چاہے کوئی اسے روک نہیں سکتا اور نہ ہی کوئی اس کے مقابلے میں غالب آ سکتا ہے، مگر وہ حکیم بھی ہے، اس لیے اپنی حکمت کے تقاضے کے مطابق نافرمانوں کو فوراً نہیں پکڑتا، بلکہ انھیں مہلت دیتا ہے، تاکہ وہ باز آ جائیں، مگر جب پکڑتا ہے تو اس کی گرفت بہت سخت ہوتی ہے جس سے بچ کر کوئی نکل نہیں سکتا۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) {اِنَّاۤ اَرْسَلْنٰكَ شَاهِدًا وَّ مُبَشِّرًا وَّ نَذِيْرًا:} سورت کے شروع سے یہاں تک رسول اللہ صلی اللہ علیہ وسلم اور مومنوں کے لیے فتح و نصرت، مغفرت، تکفیر سیئات اور جنت میں داخلے کی بشارت اور وعدے کا بیان ہے، جس کے ساتھ منافقین و کفار کے لیے عذاب، غضب، لعنت اور جہنم میں داخلے کی وعید کا بیان ہے۔ اب یہاں سے اس فتح مبین کے مختلف پہلوؤں کی تفصیل کا آغاز ہوتا ہے جس کی تمہید کے طور پر رسول اللہ صلی اللہ علیہ وسلم کا مقام و منصب بیان فرمایا، تاکہ مسلمان اسے پہچانیں اور آپ صلی اللہ علیہ وسلم کی اطاعت اور جاں نثاری میں کوئی دریغ نہ کریں۔ چنانچہ فرمایا کہ ہم نے آپ کو دنیا میں لوگوں کے سامنے حق کی شہادت دینے والا، اسے تمام لوگوں تک پہنچا دینے والا، آخرت میں ان پر پیغام حق پہنچا دینے کی شہادت دینے والا، فرماں برداروں کو بشارت دینے والا اور نافرمانوں کو اللہ کے عذاب سے ڈرانے والا بنا کر بھیجا ہے۔ اس مقام پر اصل مقصود فتح کی بشارت اور اس سے متعلقہ معاملات ہیں، اس لیے آپ صلی اللہ علیہ وسلم کی تعریف میں صرف تین الفاظ {’’ شَاهِدًا ‘‘، ’’ مُبَشِّرًا ‘‘ } اور {’’ نَذِيْرًا ‘‘} بیان فرمائے، جبکہ سورۂ احزاب میں مقصود رسول اللہ صلی اللہ علیہ وسلم کے اپنے متبنیّٰ زید رضی اللہ عنہ کی مطلقہ زینب رضی اللہ عنھا سے نکاح اور دوسرے معاملات پر منافقین کی اڑائی ہوئی گرد سے آپ صلی اللہ علیہ وسلم کا دامن پاک کرنا ہے، اس لیے وہاں سورۂ احزاب (۴۶) میں آپ صلی اللہ علیہ وسلم کی زیادہ تعریف فرمائی اور ان تینوں ا اوصاف کے ساتھ {’’ وَ دَاعِيًا اِلَى اللّٰهِ بِاِذْنِهٖ وَ سِرَاجًا مُّنِيْرًا ‘‘} (اور اللہ کی طرف بلانے والا اس کے اذن سے اور روشنی کرنے والا چراغ) بھی فرمایا۔ (ابن عاشور) {’’ شَاهِدًا ‘‘} کی تفسیر کے لیے مزید دیکھیے سورۂ احزاب (۴۵)، بقرہ (۱۴۳) اور سورۂ نساء (۴۱) ۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {لِتُؤْمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ وَ تُعَزِّرُوْهُ وَ تُوَقِّرُوْهُ …:} ’’تعزیر‘‘ کا معنی ہے تعظیم کے ساتھ مدد کرنا۔ (راغب) اور ’’توقیر‘‘ وقار سے نکلا ہے، تعظیم کرنا۔اس بات پر تمام مفسرین کا اتفاق ہے کہ {’’ تُسَبِّحُوْهُ ‘‘} (اس کی تسبیح کرو) سے مراد اللہ تعالیٰ کی تسبیح ہے، کیونکہ تسبیح اللہ کے سوا کسی کی ہو ہی نہیں سکتی۔ اکثر مفسرین کے مطابق اس سے پہلے دونوں الفاظ {’’ تُعَزِّرُوْهُ ‘‘} اور {’’ تُوَقِّرُوْهُ ‘‘} میں بھی ضمیر غائب کا مرجع اللہ تعالیٰ کی ذات ہی ہونا چاہیے، تاکہ تمام ضمیروں میں موافقت رہے۔ مطلب یہ ہو گا : ’’تاکہ تم اللہ اور اس کے رسول پر ایمان لاؤ اور اس (اللہ) کی مدد کرو اور اس کی تعظیم کرو اور دن کے شروع اور آخر میں اس کی تسبیح کرو۔‘‘ اللہ کی مدد سے مراد اس کے دین کی مدد ہے، جیسا کہ فرمایا : « اِنْ تَنْصُرُوا اللّٰهَ يَنْصُرْكُمْ » [ محمد :۷ ] ’’اگر تم اللہ کی مدد کرو گے تو وہ تمھاری مدد کرے گا۔‘‘ ¤ بعض مفسرین نے فرمایا کہ {’’ وَ تُعَزِّرُوْهُ وَ تُوَقِّرُوْهُ ‘‘} میں ضمیر غائب اس سے پہلے {’’ لِتُؤْمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ ‘‘} میں مذکور {’’ رَسُوْلِهٖ ‘‘} کی طرف لوٹ رہی ہے، کیونکہ وہ {’’ تُعَزِّرُوْهُ ‘‘} کے قریب تر ہے، اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کے ذکر کے ساتھ آپ کی تعزیر و توقیر کا حکم دے کر آخر میں اپنی تسبیح کا حکم دیا۔ اس مقام پر رسول اللہ صلی اللہ علیہ وسلم کی توقیر و تعزیر کے بیان کی مناسبت بالکل واضح ہے کہ آگے آپ پ کی بیعت کو اللہ تعالیٰ سے بیعت قرار دیا۔ مطلب یہ ہو گا : ’’تاکہ تم اللہ اور اس کے رسول پر ایمان لاؤ اور اس (رسول) کی مدد کرو اور اس کی تعظیم کرو اور دن کے شروع اور آخر میں اس (اللہ) کی تسبیح کرو۔‘‘ یہ معنی بھی درست ہے، اگرچہ اس میں ضمیروں میں موافقت نہیں رہتی، مگر قرینہ موجود ہو تو ضمیروں کا اتفاق ضروری نہیں ہوتا۔ اس معنی کی تائید سورۂ اعراف کی آیت سے ہوتی ہے جس میں تعزیر کا لفظ رسول اللہ صلی اللہ علیہ وسلم کے لیے آیا ہے، فرمایا : « فَالَّذِيْنَ اٰمَنُوْا بِهٖ وَ عَزَّرُوْهُ وَ نَصَرُوْهُ وَ اتَّبَعُوا النُّوْرَ الَّذِيْۤ اُنْزِلَ مَعَهٗۤ اُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ » [ الأعراف :۱۵۷ ] ’’سو وہ لوگ جو اس پر ایمان لائے اور اسے قوت دی اور اس کی مدد کی اور اس نور کی پیروی کی جو اس کے ساتھ اتارا گیا، وہی لوگ فلاح پانے والے ہیں۔ ‘‘ قرآن و حدیث میں لفظ ’’تعزیر‘‘ قوت دینے یا مدد کرنے کے معنی میں اللہ تعالیٰ کے لیے استعمال نہیں ہوا۔ ہاں ’’توقیر‘‘ کا مادہ {’’ وَقَارٌ ‘‘} اللہ تعالیٰ کے لیے سورۂ نوح میں آیا ہے، فرمایا : «مَا لَكُمْ لَا تَرْجُوْنَ لِلّٰهِ وَقَارًا » [نوح : ۱۳ ] ’’تمھیں کیا ہے کہ تم اللہ کی عظمت سے نہیں ڈرتے؟‘‘ اس لیے سیاق کے لحاظ سے دوسرا معنی درست ہے، اگرچہ اتحاد ضمائر کی جو خوبی پہلی تفسیر میں موجود ہے وہ دوسری میں نہیں۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {اِنَّ الَّذِيْنَ يُبَايِعُوْنَكَ اِنَّمَا يُبَايِعُوْنَ اللّٰهَ:} سیاق کے لحاظ سے اس بیعت سے مراد بیعت رضوان ہے اور مفسرین نے اس کا مصداق اسی کو قرار دیا ہے، اگرچہ {’’ يُبَايِعُوْنَكَ ‘‘} کے لفظ میں ہر وہ بیعت شامل ہے جو رسول اللہ صلی اللہ علیہ وسلم سے کی گئی، خواہ بیعت رضوان ہو یا اس سے پہلے یا بعد کی کوئی بیعت۔ اسے بیعت اس لیے کہتے ہیں کہ مسلمان اس عہد کے ذریعے سے اپنی جان اور اپنا مال جنت کے بدلے میں فروخت کر دیتا ہے۔ اسلام کا مطلب بھی یہی ہے کہ جس نے اسلام قبول کیا وہ اپنی جان اور اپنا مال اللہ تعالیٰ کے ہاتھ فروخت کر چکا، جیسا کہ فرمایا : « اِنَّ اللّٰهَ اشْتَرٰى مِنَ الْمُؤْمِنِيْنَ اَنْفُسَهُمْ وَ اَمْوَالَهُمْ بِاَنَّ لَهُمُ الْجَنَّةَ يُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ فَيَقْتُلُوْنَ وَ يُقْتَلُوْنَ وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرٰىةِ وَ الْاِنْجِيْلِ وَ الْقُرْاٰنِ وَ مَنْ اَوْفٰى بِعَهْدِهٖ مِنَ اللّٰهِ فَاسْتَبْشِرُوْا بِبَيْعِكُمُ الَّذِيْ بَايَعْتتُمْ بِهٖ وَ ذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُ » [ التوبۃ : ۱۱۱ ] ’’بے شک اللہ نے مومنوں سے ان کی جانیں اور ان کے اموال خرید لیے ہیں، اس کے بدلے کہ ان کے لیے جنت ہے، وہ اللہ کے راستے ے میں لڑتے ہیں، پس قتل کرتے ہیں اور قتل کیے جاتے ہیں، یہ تورات اور انجیل اور قرآن میں اس کے ذمے پکا وعدہ ہے اور اللہ سے زیادہ اپنا وعدہ پورا کرنے والا کون ہے؟ تو اپنے اس سودے پر خوب خوش ہو جاؤ جو تم نے اس سے کیا ہے اور یہی بہت بڑی کامیابی ہے۔‘‘ ¤ اس آیت میں اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کی تعظیم و تکریم اور اس کا شرف بیان کرنے کے لیے فرمایا : «اِنَّ الَّذِيْنَ يُبَايِعُوْنَكَ اِنَّمَا يُبَايِعُوْنَ اللّٰهَ » ’’بے شک وہ لوگ جو تجھ سے بیعت کرتے ہیں وہ درحقیقت اللہ ہی سے بیعت کرتے ہیں۔‘‘ یہ ایسے ہی ہے جیسے فرمایا : « مَنْ يُّطِعِ الرَّسُوْلَ فَقَدْ اَطَاعَ اللّٰهَ» [ النساء : ۸۰ ] ’’اور جو رسول کی اطاعت کرے تو بے شک اس نے اللہ کی اطاعت کی۔‘‘ کیونکہ رسول، اللہ تعالیٰ کا مقرر کردہ ہے، اس لیے اس کی اطاعت اللہ تعالیٰ کی اطاعت ہے اور اس کے ہاتھ پر بیعت اس کے واسطے سے اللہ تعالیٰ سے بیعت ہے۔ ¤ ➋ {يَدُ اللّٰهِ فَوْقَ اَيْدِيْهِمْ: ’’ يَدُ اللّٰهِ ‘‘} کا لفظی معنی ہے ’’اللہ کا ہاتھ‘‘ اور اللہ کے ہاتھ کی کیفیت مخلوق کے علم و ادراک سے بلند ہے، اس لیے اللہ تعالیٰ کے فرمائے ہوئے الفاظ پر اکتفا کرنا چاہیے کہ ’’اللہ کا ہاتھ ان کے ہاتھوں کے اوپر ہے۔‘‘ رہی یہ بات کہ کیسے ہے؟ تو یہ بات اللہ تعالیٰ ہی جانتا ہے۔ مفسرین نے یہاں مختلف تاویلیں کی ہیں اور سب تاویلوں کا باعث یہ ہے کہ انھوں نے اللہ کے ہاتھ کو اپنے ہاتھوں جیسا سمجھا اور اس کا ہاتھ اوپر ہونے کو اپنا ہاتھ اوپر ہونے کی طرح سمجھا، اس لیے اس کا انکار کر دیا یا تاویل کر دی۔ حالانکہ یہ بات بہت سی آیات و احادیث سے ثابت ہے کہ اللہ تعالیٰ کا ہاتھ ہے اور یہ بھی طے شدہ بات ہے کہ اس کی مثل کوئی چیز نہیں۔ صحابہ کرام رضی اللہ عنھم نے بھی یہ آیات سنیں، کسی نے تاویل کی ضرورت محسوس نہیں فرمائی، نہ کسی نے انکار کیا، جو الفاظ جس طرح آئے اسی طرح مان لیے۔ ہمیں بھی اس چکر میں نہیں پڑنا چاہیے کہ اللہ کا ہاتھ کیسا ہے اور ان کے ہاتھوں کے اوپر کس طرح ہے۔ ¤ ➌ بیعتِ رضوان وہ بیعت ہے جو حدیبیہ کے مقام پر صحابہ کرام رضی اللہ عنھم نے ایک درخت کے نیچے رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ پر کی تھی۔ ان کی تعداد اکثر صحیح روایات کے مطابق چودہ سو تھی، بعض صحابہ نے پندرہ سو بھی بیان کی ہے۔ جابر رضی اللہ عنہ سے صحیح سند کے ساتھ چودہ سو اور پندرہ سو دونوں روایتیں موجود ہیں۔ حافظ ابن حجر رحمہ اللہ نے تطبیق یہ دی ہے کہ ان کی تعداد چودہ سو اور پندرہ سو کے درمیان تھی، بعض اوقات زائد کو چھوڑ کر چودہ سو بیان کر دیے اور بعض اوقات درمیان کا عدد پورا کرکے پندرہ سو بیان کر دیے۔ احادیث میں ہے کہ ان تمام صحابہ نے یہ بیعت کی، صرف جد بن قیس نامی شخص نے بیعت نہیں کی۔ ¤ اس بیعت کا باعث یہ ہوا کہ رسول اللہ صلی اللہ علیہ وسلم نے عثمان بن عفان رضی اللہ عنہ کو حدیبیہ سے اہلِ مکہ کی طرف بات چیت کے لیے بھیجا کہ وہ مسلمانوں کو بیت اللہ کا عمرہ ادا کرنے سے نہ روکیں۔ عثمان رضی اللہ عنہ کے واپس آنے میں دیر ہوئی تو افواہ پھیل گئی کہ انھیں قتل کر دیا گیا ہے، اس پر رسول اللہ صلی اللہ علیہ وسلم نے لڑنے کا پختہ ارادہ فرما لیا اور صحابہ کو بیعت کی دعوت دی۔ سلمہ بن اکوع رضی اللہ عنہ نے حدیبیہ میں درخت کے نیچے رسول اللہ صلی اللہ علیہ وسلم سے دو دفعہ بیعت کرنے کا ذکر کیا تو (ان کے شاگرد) یزید نے پوچھا : ’’ اے ابو مسلم! آپ اس دن کس چیز پر بیعت کرتے تھے؟‘‘ انھوں نے فرمایا : ’’موت پر۔‘‘ [ بخاري، الجہاد والسیر، باب البیعۃ في الحرب علٰی أن لا یفروا:۲۹۶۰ ] جبکہ جابر بن عبد اللہ رضی اللہ عنھما نے فرمایا : ’’ہم نے آپ صلی اللہ علیہ وسلم سے موت پر بیعت نہیں کی بلکہ اس بات پر بیعت کی کہ ہم بھاگیں گے نہیں۔‘‘ [ مسلم، الإمارۃ، باب استحباب مبایعۃ الإمام الجیش… : ۶۸ /۱۸۵۶ ] اس سے معلوم ہوتا ہے کہ بعض صحابہ نے موت پر بیعت کی اور بعض نے اس بات پر کہ ہم کسی صورت میدان سے فرار اختیار نہیں کریں گے اور دونوں کی حقیقت ایک ہی ہے، کیونکہ کسی صورت نہ بھاگنے کا مطلب موت کے لیے تیار رہنا ہی ہے۔ چونکہ عثمان رضی اللہ عنہ کی شہادت کی خبر یقینی نہیں تھی، بلکہ ان کے زندہ ہونے کا بھی امکان تھا، اس لیے رسول اللہ صلی اللہ علیہ وسلم نے ان کو بھی اس بیعت میں شریک فرما لیا۔ چنانچہ عبداللہ بن عمر رضی اللہ عنھما نے فرمایا : [ فَلَوْ كَانَ أَحَدٌ أَعَزَّ بِبَطْنِ مَكَّةَ مِنْ عُثْمَانَ لَبَعَثَهُ مَكَانَهُ، فَبَعَثَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ عُثْمَانَ وَكَانَتْ بَيْعَةُ الرِّضْوَانِ بَعْدَ مَا ذَهَبَ عُثْمَانُ إِلٰی مَكَّةَ، فَقَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ ب بِيَدِهِ الْيُمْنٰی هٰذِهِ يَدُ عُثْمَانَ فَضَرَبَ بِهَا عَلٰی يَدِهِ، فَقَالَ هٰذِهِ لِعُثْمَانَ ] [بخاري، فضائل أصحاب النبي صلی اللہ علیہ وسلم ، باب مناقب عثمان بن عفان أبي عمرو القرشي رضی اللہ عنہ : ۳۶۹۹ ] ’’اگر وادیٔ مکہ میں عثمان رضی اللہ عنہ سے زیادہ کوئی شخص عزت والا ہوتا تو رسول اللہ صلی اللہ علیہ وسلم اس کے بجائے اسے بھیجتے۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے عثمان رضی اللہ عنہ کو مکہ بھیجا اور بیعتِ رضوان عثمان رضی اللہ عنہ کے مکہ جانے کے بعد ہوئی، تو رسول اللہ صلی اللہ علیہ وسلم نے اپنے دائیں ہاتھ کی طرف اشارہ کرکے فرمایا: ’’یہ عثمان کا ہاتھ ہے۔‘‘ پھر اسے دوسرے ہاتھ پر مار کر فرمایا: ’’یہ عثمان کی بیعت ہے۔‘‘ کفار کو جب اس بیعت کے متعلق پتا چلا تو وہ ڈر گئے اور انھوں نے عثمان رضی اللہ عنہ کو واپس بھیج دیا اور صلح کی کوششیں شروع کر دیں جس کے نتیجے میں صلح حدیبیہ ہوئی۔ ¤ ➍ {فَمَنْ نَّكَثَ فَاِنَّمَا يَنْكُثُ عَلٰى نَفْسِهٖ:} یہ بات مسلم ہے کہ ان صحابہ میں سے کسی نے اس بیعت میں کیا ہوا عہد نہیں توڑا، خصوصاً اس لیے کہ یہ بیعت خونِ عثمان کے قصاص کے لیے لڑائی کے متعلق لی گئی تھی اور اس کا دورانیہ بیعت سے لے کر صلح ہونے تک تھا۔ اس بیعت سے حاصل شدہ رضوانِ الٰہی کے لیے اتنا ہی کافی ہے، اگرچہ بعدمیں بھی ان صحابہ میں سے کسی سے میدان جہاد سے فرار ثابت نہیں۔ ¤ ➎ { وَ مَنْ اَوْفٰى بِمَا عٰهَدَ عَلَيْهُ اللّٰهَ …:} اللہ تعالیٰ کے اس عہد کو پورا کرنے والوں کے لیے اجرِ عظیم ہے، جیسا کہ آگے آ رہا ہے۔ اللہ تعالیٰ کے راضی ہو جانے کی بشارت کے بعد جو لوگ ان مبارک ہستیوں سے بغض یا عداوت رکھیں ان کی بدنصیبی میں کیا شک ہے۔ ¤ ➏ {بِمَا عٰهَدَ عَلَيْهُ اللّٰهَ:} جمہور قراء نے {’’ عَلَيْهُ ‘‘} کی ’’ہاء‘‘ پر کسرہ پڑھا ہے، اس کی وجہ یہ ہے کہ یہ ضمیر اصل میں {’’هُوَ‘‘} ہے، واؤ حذف کرنے کے بعد بھی یہ مضموم ہی رہتی ہے، جیسے {’’ لَهُ ‘‘} اور {’’ ضَرَبَهُ ‘‘} میں ہے، البتہ اس سے پہلے ’’یاء‘‘ ہو تو اس کی رعایت سے اس پر کسرہ پڑھا جاتا ہے، جیسے {’’فِيْهِ، إِلَيْهِ، عَلَيْهِ‘‘} وغیرہ میں ہے۔ یہاں حفص نے جو اس پر ضمہ پڑھا ہے آلوسی نے اس کی دو مناسبتیں بیان کی ہیں، ان میں سے ایک کی تفصیل یہ ہے کہ اس مقام پر اللہ تعالیٰ کے ساتھ بیعت اور عہد کا ذکر ہے جو لفظ {’’ اللّٰهَ ‘‘} کو ایسے طریقے سے ادا کرنے کا تقاضا کرتا ہے جس سے اس کی عظمت اور جلال کا اظہار ہوتا ہو کہ کتنی عظیم ہستی سے عہد کیا گیا ہے اور معلوم ہے کہ لفظ {’’ اَللّٰهُ ‘‘} سے پہلے اگر کسرہ ہو تو اس کے لام کو باریک پڑھاجاتا ہے، اسے تفخیم کے ساتھ (پر کر کے) نہیں پڑھا جاتا۔ اس لیے {’’ عَلَيْهُ ‘‘} کی ’’ہاء‘‘ پر کسرہ کے بجائے ضمہ لایا گیا ہے، تاکہ لفظ {’’ اللّٰهَ ‘‘} کی ادائیگی پوری شان و شوکت اور جلال و عظمت کے اظہار کے ساتھ ہو۔ دوسری مناسبت یہ ہے کہ {’’ عَلَيْهُ ‘‘} میں ’’ہاء‘‘ اصل میں {’’هُوَ‘‘} ہے، جیسا کہ پیچھے گزرا، لہٰذا اس کا اصل اعراب ضمہ ہے نہ کہ کسرہ، اس لیے اصل ضمہ کو باقی رکھنا اصل عہد کے قائم رکھنے اور پورا کرنے کے ساتھ زیادہ مناسبت رکھتا ہے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {سَيَقُوْلُ لَكَ الْمُخَلَّفُوْنَ مِنَ الْاَعْرَابِ:} رسول اللہ صلی اللہ علیہ وسلم نے جب عمرہ کے لیے جانے کا ارادہ فرمایا تو مدینہ کے اردگرد کے اعراب کو ساتھ چلنے کے لیے کہا، تاکہ اہلِ مکہ مسلمانوں کی تعداد دیکھ کر انھیں عمرہ سے نہ روکیں، مگر ان میں سے اکثر لوگ جان بوجھ کر پیچھے رہ گئے۔ یہ لوگ اگرچہ منافق نہیں تھے مگر ابھی تک ایمان ان کے دلوںمیں پوری طرح جاگزیں نہیں ہوا تھا۔ اس کی دلیل آگے آنے والی آیات {’’ قُلْ لِّلْمُخَلَّفِيْنَ مِنَ الْاَعْرَابِ … ‘‘} ہیں۔ جب رسول اللہ صلی اللہ علیہ وسلم مظفر و منصور واپس روانہ ہوئے تو ان لوگوں نے اپنے دلوں میں عذر بہانے تیار کیے جو وہ آپ کی آمد پر آپ کے سامنے پیش کرنے والے تھے۔ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو پہلے ہی راستے میں ان کے بہانوں کی اطلاع دے دی جو وہ پیش کرنے والے تھے اور ان کے پیچھے رہنے کا حقیقی سبب بھی بتا دیا۔ یہ قرآن مجید کے معجزات میں سے ہے کہ اس نے وہ بات پہلے ہی بتا دی جو بعد میں ہونے والی تھی۔ ¤ ➋ {’’ الْمُخَلَّفُوْنَ‘‘} کا لفظی معنی ’’پیچھے چھوڑ دیے جانے والے‘‘ ہے، جبکہ یہ لوگ جان بوجھ کر خود پیچھے رہے تھے، تو بظاہر ان کے لیے لفظ {’’مُتَخَلِّفُوْنَ‘‘} (پیچھے رہنے والے) استعمال ہونا چاہیے تھا، مگر اللہ تعالیٰ نے ان کے لیے {’’ الْمُخَلَّفُوْنَ‘‘} کا لفظ استعمال فرمایا۔ یعنی ان کی بدنیتی اور شامتِ اعمال کی وجہ سے اللہ تعالیٰ نے انھیں ساتھ جانے کی توفیق ہی نہیں دی، بلکہ انھیں پیچھے چھوڑ دیا۔ اس سے ثابت ہوتا ہے کہ آدمی کا نیک اعمال سے محروم رہنا اللہ تعالیٰ کے ناراض ہونے کی وجہ سے ہوتا ہے، کیونکہ وہ اس کے اعمالِ بد کی وجہ سے نیک اعمال کی توفیق سلب کر لیتا ہے۔ اللہ تعالیٰ نے جنگِ تبوک کے مخلّفین کے متعلق فرمایا : «وَ لَوْ اَرَادُوا الْخُرُوْجَ لَاَعَدُّوْا لَهٗ عُدَّةً وَّ لٰكِنْ كَرِهَ اللّٰهُ انْۢبِعَاثَهُمْ فَثَبَّطَهُمْ وَ قِيْلَ اقْعُدُوْا مَعَ الْقٰعِدِيْنَ» [التوبۃ : ۴۶ ] ’’ اور اگر وہ نکلنے کا ارادہ رکھتے تو اس کے لیے کچھ سامان ضرور تیار کرتے اور لیکن اللہ نے ان کا اٹھنا ناپسند کیا تو انھیں روک دیا اور کہہ دیا گیا کہ بیٹھنے والوں کے ساتھ بیٹھے رہو۔‘‘ مزید دیکھیے سورۂ توبہ (۸۱)۔ ¤ ➌ { شَغَلَتْنَاۤ اَمْوَالُنَا وَ اَهْلُوْنَا فَاسْتَغْفِرْ لَنَا:} یعنی یہ اعراب کہیں گے کہ ہمارے مال مویشی اور بیوی بچے ہمارے آپ کے ساتھ چلنے کی راہ میں رکاوٹ بن گئے، کیونکہ ان کی دیکھ بھال اور حفاظت کرنے والا کوئی نہ تھا، اس لیے ہماری اس کوتاہی پر آپ ہمارے لیے اللہ تعالیٰ سے دعا کیجیے کہ وہ ہمیں معاف فرما دے۔ ¤ ➍ { يَقُوْلُوْنَ بِاَلْسِنَتِهِمْ مَّا لَيْسَ فِيْ قُلُوْبِهِمْ:} یعنی یہ لوگ تمھارے مدینہ پہنچنے پر اپنی زبانوں سے وہ باتیں کہیں گے جو ان کے دلوں میں نہیں ہیں۔ مال مویشی اور اہل و عیال کی رکاوٹ ان کا جھوٹا بہانہ ہے۔ اسی طرح ان کا استغفار کے لیے کہنا محض بناوٹ ہے، ورنہ گناہ کا ایسا ہی احساس ہوتا تو ساتھ کیوں نہ جاتے۔ ان کے نہ جانے کا اصل سبب اللہ علام الغیوب نے اگلی آیت میں بیان فرمایا ہے۔ ¤ ➎ {قُلْ فَمَنْ يَّمْلِكُ لَكُمْ مِّنَ اللّٰهِ شَيْـًٔا … :} یہ ان کی دونوں باتوں کا جواب ہے، فرمایا تم جو اپنے کہنے کے مطابق اپنے مال و اہل کی دیکھ بھال اور حفاظت کی وجہ سے ساتھ نہیں گئے، بتاؤ اگر اللہ تعالیٰ تمھیں کوئی نقصان پہنچانا چاہے اور تمھارے جہاد سے پیچھے رہنے پر گھر میں موجود ہونے کے باوجود تمھارے اموال اور گھر والوں کو تباہ و برباد کر دے تو تمھیں اس سے کون بچا سکتا ہے؟ یا اگر وہ تمھیں کوئی فائدہ پہنچانا چاہے اور تمھارے جہاد پر جانے کے باوجود تمھارے اموال اور گھر والوں کی حفاظت کرے اور ان میں برکت اور اضافہ فرما دے توکون اسے روک سکتا ہے؟ جب نفع و نقصان کو کوئی روک نہیں سکتا تو اللہ اور اس کے رسول کے حکم کے مقابلے میں ان چیزوں کی پروا کیوں کرتے ہو؟ اور تم نے جو استغفار کے لیے کہا ہے، اگر تم فی الواقع اپنے کیے پر نادم ہو اور اللہ تعالیٰ تمھیں معاف کرنا چاہے تو کون اسے روک سکتا ہے؟ پھر اگر میں تمھارے لیے استغفار نہ بھی کروں تو تمھارا کچھ نقصان نہیں اور اگر تم نادم نہیں ہو، صرف بناوٹ کے طور پر استغفار کے لیے کہہ رہے ہو تو اس صورت میں اگر میں تمھارے لیے استغفار کر بھی دوں اور اللہ تعالیٰ تمھیں معاف نہ کرنا چاہے، بلکہ سزا دینا چاہے تو کون اسے روک سکتا ہے؟ ¤ ➏ {بَلْ كَانَ اللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرًا:} یعنی بات وہ نہیں جو تم نے سمجھ رکھی ہے کہ ہم زبان سے جو کچھ کہہ دیں گے مان لیا جائے گا اور ہمارے دل کا حال چھپا رہے گا، بلکہ حقیقت یہ ہے کہ اللہ تعالیٰ صرف موجود وقت ہی میں نہیں بلکہ ہمیشہ سے ان تمام اعمال سے پورا باخبر ہے جو تم کرتے ہو۔ ہمیشگی کا مفہوم {’’ كَانَ ‘‘} ادا کر رہا ہے۔ مفسر طبری کے الفاظ ہیں: {’’ بَلْ لَمْ يَزَلِ اللّٰهُ بِمَا يَعْمَلُوْنَ مِنْ خَيْرٍ وَ شَرٍّ خَبِيْرًا ‘‘} ’’بلکہ اللہ تعالیٰ ہمیشہ ان کے تمام اچھے اور برے اعمال کی پوری خبر رکھنے والا رہا ہے۔‘‘"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { بَلْ ظَنَنْتُمْ اَنْ لَّنْ يَّنْقَلِبَ الرَّسُوْلُ وَ الْمُؤْمِنُوْنَ … :} یعنی تمھارے پیچھے رہنے کی اصل وجہ یہ تھی کہ تم نے سمجھا تھا کہ رسول اللہ صلی اللہ علیہ وسلم اور مسلمان، جو احرام باندھ کر جا رہے ہیں، پورا اسلحہ بھی ساتھ لے کر نہیں جا رہے اور اس دشمن کے پاس جا رہے ہیں جس نے سیکڑوں میل دور سے آکر مدینہ میں ان کے کئی آدمی قتل کر دیے اور سخت نقصان پہنچایا، یہ وہیں کاٹ ڈالے جائیں گے، کوئی بچ کر واپس نہیں آئے گا۔ ¤ ➋ { وَ زُيِّنَ ذٰلِكَ فِيْ قُلُوْبِكُمْ:} یعنی تمھیں اپنے پیچھے رہنے پر کوئی ندامت بھی نہ تھی، بلکہ دل میں خوش تھے کہ ہم نے بہت اچھا کیا کہ ساتھ نہیں گئے۔ ’’یہ بات تمھارے دلوںمیں مزین کر دی گئی‘‘ اللہ تعالیٰ نے اس کے لیے فعل مجہول {’’ زُيِّنَ ‘‘} کا لفظ استعمال فرمایا۔ مزین کس نے کیا، اس کی صراحت نہیں فرمائی، کیونکہ وہ متعدد چیزیں ہیں، مثلاً دنیا کی مرغوبات، آدمی کا نفس، شیطان اور برے ساتھی وغیرہ۔ ¤ ➌ {وَ كُنْتُمْ قَوْمًۢا بُوْرًا: ’’ بُوْرًا ‘‘ ’’بَائِرٌ‘‘} کی جمع ہے جو {’’بَارَ يَبُوْرُ بَوْرًا‘‘} (ن) سے اسم فاعل ہے، ہلاک ہونے والے۔ یعنی اصل بات یہ ہے کہ تم شروع سے اپنی نامردی اور بزدلی کی وجہ سے تھے ہی ہلاک ہونے والے، کیونکہ بہادر مومن تو ایک دفعہ مرتا ہے جبکہ بزدل منافق ہر گھڑی مرتا ہے، جیسا کہ فرمایا: « يَحْسَبُوْنَ كُلَّ صَيْحَةٍ عَلَيْهِمْ» [ المنافقون : ۴ ] ’’(ایسے بزدل ہیں کہ) ہر اونچی آواز کو اپنے آپ پر آنے والی (آفت) ہی سمجھتے ہیں۔‘‘"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {وَ مَنْ لَّمْ يُؤْمِنْۢ بِاللّٰهِ وَ رَسُوْلِهٖ … :} اس سے معلوم ہوا کہ جو شخص اللہ اور اس کے رسول کے متعلق برا گمان رکھے، مسلمان ہونے کے باوجود مسلمانوں کے نقصان پر اور اپنی جان بچانے پر خوش ہو وہ مومن نہیں بلکہ کافر ہے اور اللہ تعالیٰ نے ایسے کافروں کے لیے بھڑکتی ہوئی آگ تیار کر رکھی ہے۔ یہ الگ بات ہے کہ کلمۂ اسلام کہنے اور مسلمانوں کے ساتھ مسلمان بن کر رہنے کی وجہ سے دنیوی احکام میں انھیں مسلمان ہی سمجھا جائے گا، مگر آخرت میں ان کے لیے کھلے کافروں سے بھی سخت عذاب تیار ہے، فرمایا: « اِنَّ الْمُنٰفِقِيْنَ فِي الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِ » [ النساء : ۱۴۵ ] ’’بے شک منافق لوگ آگ کے سب سے نچلے درجے میں ہوں گے ۔‘‘"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { وَ لِلّٰهِ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ:} یہ ان پیچھے چھوڑ دیے جانے والے اعراب کو فرمایا جن کا اوپر ذکر ہے کہ آسمانوں اور زمین کی بادشاہی کا مالک صرف اللہ تعالیٰ ہے، اگر تم نے نفاق پر اور رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جہاد پر جانے سے گریز پر اصرار کیا تو کسی میں طاقت نہیں کہ وہ جو عذاب دینا چاہے اس سے تمھیں بچا سکے، یا اگر وہ تمھاری ندامت اور توبہ پر تمھیں معاف کر دے تو کوئی اسے روک نہیں سکتا۔ ¤ ➋ { يَغْفِرُ لِمَنْ يَّشَآءُ وَ يُعَذِّبُ مَنْ يَّشَآءُ … :} اس میں ان اعراب کو توبہ کی اور رسول اللہ صلی اللہ علیہ وسلم کی اطاعت کی طرف پلٹ آنے کی ترغیب دی ہے کہ اب بھی وقت ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے پیچھے بیٹھ رہنے سے توبہ کر لو، کیونکہ اللہ تعالیٰ توبہ کرنے والوں کو معاف کرنے والا اور ان پر رحم کرنے والا ہے اور اس کی یہ صفت آج نہیں بلکہ ہمیشہ سے ہے اور ہمیشہ کے لیے ہے۔ ¤ ➌ { ’’ يَغْفِرُ لِمَنْ يَّشَآءُ وَ يُعَذِّبُ مَنْ يَّشَآءُ ‘‘} کی تقسیم سے معلوم ہوا کہ پیچھے رہنے والوں میں سے کچھ ایسے ہوں گے جو نفاق سے توبہ کرکے اخلاص کی نعمت سے سرفراز ہوں گے اور اللہ تعالیٰ کی مغفرت و رحمت سے فیض یاب ہوں گے اور کچھ ایسے بھی ہوں گے جو نفاق سے توبہ نہیں کریں گے اور اللہ تعالیٰ انھیں عذاب دے گا۔ آگے آیت : « قُلْ لِّلْمُخَلَّفِيْنَ مِنَ الْاَعْرَابِ …» سے بھی یہ بات واضح ہو رہی ہے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { سَيَقُوْلُ الْمُخَلَّفُوْنَ اِذَا انْطَلَقْتُمْ اِلٰى مَغَانِمَ … :} اللہ تعالیٰ نے بیعتِ رضوان میں شریک صحابہ پر اپنے بہت سے انعامات کے علاوہ، جن کا ذکر آیت (۱۸، ۱۹) میں آ رہا ہے، انھیں ایک بہت جلدی حاصل ہونے والی فتح کا وعدہ بھی فرمایا جس میں انھیں بہت سی غنیمتیں حاصل ہوں گی۔ مقصد ان کی اس دل شکنی کا ازالہ تھا جو حدیبیہ کے موقع پر ہوئی، اس کے علاوہ اس اطاعت، وفا داری اور جاں فروشی کا انعام دینا بھی تھا جس کا مظاہرہ انھوں نے اس سارے غزوہ کے دوران کیا۔ ان غنیمتوں سے مراد خیبر ہے جس کا فتح کرنا یہودیوں کی مسلسل شرارتوں اور عہد شکنیوں کی وجہ سے نہایت ضروری تھا، مگر قریش کی حمایت کی وجہ سے اس میں مشکلات در پیش تھی۔ اب قریش کی طرف سے بے فکری ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے خیبر پر چڑھائی کا ارادہ فرمایا۔ اس مہم میں مسلمانوں کی فتح اور بے شمار غنیمتوں کا حصول سب کو صاف نظر آ رہا تھا اور ایسے ہی ہوا کہ صلح حدیبیہ کے تین ماہ بعد ہی رسول اللہ صلی اللہ علیہ وسلم نے خیبر پر چڑھائی کی اور بڑی آسانی سے اسے فتح فرما لیا، بلکہ خیبر کے اردگرد کی یہودیوں کی بہت سی بستیاں بھی کسی خاص مزاحمت کے بغیر مسلمانوں کے ہاتھ آ گئیں۔ اللہ تعالیٰ نے پہلے ہی آگاہ فرما دیا کہ جب تم خیبر کی طرف غنیمتیں حاصل کرنے کے لیے روانہ ہو گے تو یہ پیچھے رہنے والے کہیں گے، ہمیں بھی اپنے ساتھ چلنے کی اجازت دو۔ ¤ ➋ { يُرِيْدُوْنَ اَنْ يُّبَدِّلُوْا كَلٰمَ اللّٰهِ:} یعنی اللہ تعالیٰ نے تو ان غنیمتوں کا وعدہ اس درخت کے نیچے بیعت کرنے والوں سے کیا تھا اور یہ چاہتے ہیں کہ وہ غنیمتیں ان لوگوں کو بھی مل جائیں جو رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جانے کے لیے گھر ہی سے نہیں نکل سکے، بیعت انھوں نے خاک کرنا تھی۔ اب ان کی بات مان لی جائے تو اللہ کی بات تو اپنی جگہ نہ رہی ۔ ¤ ➌ { قُلْ لَّنْ تَتَّبِعُوْنَا:} آپ ان سے کہیے، تم ہمارے ساتھ ہر گز نہیں جاؤ گے، کیونکہ یہ ان لوگوں کا حق ہے جنھوں نے اس وقت رسول اللہ صلی اللہ علیہ وسلم کا ساتھ دیا جب موت آنکنکھوں کے سامنے نظر آ رہی تھی۔ ¤ ➍ {كَذٰلِكُمْ قَالَ اللّٰهُ مِنْ قَبْلُ:} یعنی اللہ تعالیٰ نے یہ فیصلہ پہلے ہی کر دیا ہے کہ فتح کے ثمرات کے حق دار بھی صرف وہ ہیں جنھوں نے اس وقت ساتھ دیا جب جان و مال کی بازی لگانے کا وقت تھا۔ ¤ ➎ { فَسَيَقُوْلُوْنَ بَلْ تَحْسُدُوْنَنَا:} فرمایا، یہ لوگ ساتھ جانے کی اجازت نہ ملنے پر کہیں گے، بلکہ تم لوگ ہم پر حسد کرتے ہو کہ ان غنیمتوں کے حصول سے ہماری مالی حالت اچھی نہ ہو جائے۔ ¤ ➏ { بَلْ كَانُوْا لَا يَفْقَهُوْنَ اِلَّا قَلِيْلًا:} فرمایا، مسلمانوں کو ان پر کوئی حسد نہیں اور نہ ان کی پاک فطرت میں اس کی گنجائش ہے، بلکہ حقیقت یہ ہے کہ یہ لوگ مسلمانوں کو خواہ مخواہ مورد الزام ٹھہرا رہے ہیں، اپنے قصور کی سمجھ نہ انھیں پہلے آئی نہ اب تک اسے سمجھ رہے ہیں ({كَانُوْا} میں استمرار ہے) کہ جب اس سے پہلے وہ کوئی جانی و مالی خطرہ مول لینے کے لیے تیار نہیں ہوئے تو اب آسانی سے ہاتھ آنے والے مالِ غنیمت میں انھیں کیسے حصے دار بنایا جا سکتا ہے اور جب پہلے ان کے اموال اور گھر والوں نے انھیں گھر سے نکلنے سے روکے رکھا تو اب وہ انھیں نکلنے سے کیوں نہیں روک رہے؟ بہت کم سمجھنے کا مطلب یہ ہے کہ وہ بالکل نہیں سمجھتے۔ قرآن مجید اور کلامِ عرب میں قلیل کا لفظ مطلق نفی کے لیے عام استعمال ہوا ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { قُلْ لِّلْمُخَلَّفِيْنَ مِنَ الْاَعْرَابِ … :} اس آیت میں پیچھے رہنے والے اعراب کو تسلی دلائی ہے کہ آئندہ غزوات میں انھیں شرکت کا اور غنیمتیں حاصل کرنے کا پورا پورا موقع دیا جائے گا، تاکہ انھیں اطمینان ہو جائے کہ انھیں اسلامی لشکر کے ساتھ خیبر میں جانے سے اس لیے منع نہیں کیا گیا کہ وہ اسلام سے نکل گئے ہیں، بلکہ اس کا ایک خاص سبب ہے جس کا ذکر پیچھے گزر چکا ہے۔ چنانچہ آئندہ جس طرح دوسرے مسلمانوں کو کفار سے لڑنے کی دعوت دی جائے گی انھیں بھی دی جائے گی۔ اس آیت میں ان کی اس دل شکنی کا مداوا فرمایا ہے جو خیبر میں شریک نہ کیے جانے سے ہوئی اور ان کے حق میں یہ عظیم خوش خبری بھی دی کہ وہ خیبر سے پیچھے رہ جانے کی کوتاہی کی تلافی کر سکتے ہیں اور تاریخ شاہد ہے کہ حدیبیہ سے پیچھے رہنے والے اعراب کے یہ قبائل آئندہ جنگوں مثلاً فتح مکہ، جنگ حنین، جنگ تبوک اور جنگ یمامہ میں شریک ہوئے، ان میں سے کم ہی کوئی شخص ان جنگوں سے پیچھے رہا۔ یہ آیت اس بات کی بھی دلیل ہے کہ یہ لوگ ایمان سے محروم نہیں ہوئے تھے، کیونکہ اس کے بعد جنگ تبوک سے پیچھے رہنے والے منافقین، جو دل میں کفر چھپائے ہوئے تھے، ان کے ساتھ یہ معاملہ نہیں کیا گیا، نہ انھیں آئندہ کسی جنگ میں شرکت کی دعوت دی گئی اور نہ ان کے حق میں یہ اجازت ملی، بلکہ اللہ تعالیٰ نے فرمایا : « فَاِنْ رَّجَعَكَ اللّٰهُ اِلٰى طَآىِٕفَةٍ مِّنْهُمْ فَاسْتَاْذَنُوْكَ لِلْخُرُوْجِ فَقُلْ لَّنْ تَخْرُجُوْا مَعِيَ اَبَدًا وَّ لَنْ تُقَاتِلُوْا مَعِيَ عَدُوًّا اِنَّكُمْ رَضِيْتُمْ بِالْقُعُوْدِ  اَوَّلَ مَرَّةٍ فَاقْعُدُوْا مَعَ الْخٰلِفِيْنَ (83) وَ لَا تُصَلِّ عَلٰۤى اَحَدٍ مِّنْهُمْ مَّاتَ اَبَدًا وَّ لَا تَقُمْ عَلٰى قَبْرِهٖ اِنَّهُمْ كَفَرُوْا بِاللّٰهِ وَ رَسُوْلِهٖ وَ مَاتُوْا وَ هُمْ فٰسِقُوْنَ» [ التوبۃ : 84،83] ’’پس اگر اللہ تجھے ان میں سے کسی گروہ کی طرف واپس لے آئے، پھر وہ تجھ سے (جنگ کے لیے) نکلنے کی اجازت طلب کریں تو کہہ دے تم میرے ساتھ کبھی نہیں نکلو گے اور میرے ساتھ مل کر کبھی کسی دشمن سے نہیں لڑو گے۔ بے شک تم پہلی مرتبہ بیٹھ رہنے پر خوش ہوئے، سو پیچھے رہنے والوں کے ساتھ بیٹھے رہو۔ اور ان میں سے جو کوئی مر جائے اس کا کبھی جنازہ نہ پڑھنا اور نہ اس کی قبر پر کھڑے ہونا، بے شک انھوں نے اللہ اور اس کے رسول کے ساتھ کفر کیا اور اس حال میں مرے کہ وہ نافرمان تھے۔ ‘‘ ¤ ➋ { سَتُدْعَوْنَ اِلٰى قَوْمٍ اُولِيْ بَاْسٍ شَدِيْدٍ:} جنگ تبوک سے پیچھے رہنے والے منافقین کے برعکس غزوۂ حدیبیہ سے پیچھے رہنے والے اعراب کے متعلق فرمایا کہ آئندہ تمھیں سخت لڑائی والے لوگوں سے جنگ کے لیے بلایا جائے گا۔ {’’ سَتُدْعَوْنَ ‘‘} (عنقریب تمھیں بلایا جائے گا) کا لفظ عام ہے، تاکہ اس میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کے خلفاء کا جنگ کے لیے دعوت دینا بھی شامل ہو جائے۔ ان سخت لڑائی والے لوگوں کے بارے میں مفسرین کے چار اقوال ہیں، ایک یہ کہ اس سے مراد ثقیف و ہوازن ہیں جن کے ساتھ جنگِ حنین ہوئی۔ دوسرا یہ کہ اس سے مراد رومی ہیں جن سے جنگ کے لیے رسول اللہ صلی اللہ علیہ وسلم نے غزوۂ تبوک میں سب لوگوں کو ساتھ جانے کی دعوت دی اور بعد میں ابوبکر و عمر رضی اللہ عنھما کے زمانے میں بھی ان سے جنگ ہوئی۔ تیسرا یہ کہ اس سے مراد بنو حنیفہ کے مرتدین ہیں جن سے ابوبکر صدیق رضی اللہ عنہ نے جنگ کی اور چوتھا قول یہ ہے کہ اس سے مراد اہلِ فارس ہیں جن کے ساتھ ابوبکر صدیق اور عمر فاروق رضی اللہ عنھما کے زمانے میں جنگ ہوئی۔ امام طبری رحمہ اللہ نے فرمایا : ’’اللہ تعالیٰ نے اعراب کے ان مخلفین کے متعلق فرمایا کہ انھیں سخت لڑائی والے اور بہادر لوگوں سے لڑنے کی دعوت دی جائے گی اور کسی عقلی یا نقلی دلیل سے ثابت نہیں ہوتا کہ اس سے مراد خاص ہوازن ہیں یا بنو حنیفہ یا فارس یا روم۔ ہو سکتا ہے ان سے مراد ان میں سے بعض ہوں اور یہ بھی ہو سکتا ہے کہ ان کے علاوہ کوئی اور لوگ ہوں۔ اور اس قول سے زیادہ کوئی قول صحیح نہیں ہو سکتا جو اللہ تعالیٰ نے فرمایا ہے کہ انھیں ایک سخت لڑنے والی قوم کی طرف بلایا جائے گا، سو اسی پر اکتفا ہونا چاہیے۔‘‘ ¤ ➌ { تُقَاتِلُوْنَهُمْ اَوْ يُسْلِمُوْنَ:} یعنی تم ان سے لڑو گے یا وہ لڑائی کے نتیجے میں یا لڑائی کے بغیر ہی تابع فرمان ہو جائیں گے، یا جزیہ دینا قبول کر لیں گے۔ بعض مفسرین نے {’’ اَوْ يُسْلِمُوْنَ ‘‘} کا معنی کیا ہے ’’یا وہ مسلمان ہو جائیں گے۔‘‘ ان کے مطابق اس آیت میں ان لوگوں سے جنگ کی پیش گوئی ہے جن سے جزیہ لینے کی اجازت نہیں تھی، بلکہ ان کے لیے دو ہی راستے تھے کہ یا مسلمان ہو جائیں یا جنگ کے لیے تیار رہیں۔ یہود و نصاریٰ سے بالاتفاق جزیہ لینا درست ہے، ہجر کے مجوس سے بھی رسول اللہ صلی اللہ علیہ وسلم کا جزیہ لینا ثابت ہے۔ البتہ مشرکین عرب کے متعلق سورۂ توبہ(۵) میں یہ حکم اترا کہ ان سے اس وقت تک جنگ کی جائے جب تک وہ مسلمان نہ ہو جائیں، ان میں سے کسی سے رسول اللہ صلی اللہ علیہ وسلم نے جزیہ نہیں لیا۔ ان مفسرین کے قول کے مطابق اس آیت سے مراد ثقیف و ہوازن ہو سکتے ہیں جو جنگ حنین میں قتل ہو گئے یا گرفتار ہونے کے بعد سب کے سب مسلمان ہو گئے، یا بنو حنیفہ کے مرتدین ہیں جن سے اس وقت تک جنگ کی گئی جب تک وہ دوبارہ مسلمان نہیں ہو گئے۔ البتہ پہلے قول کے مطابق {’’ تُقَاتِلُوْنَهُمْ اَوْ يُسْلِمُوْنَ ‘‘} (تم ان سے لڑو گے یا وہ تابع فرمان ہو جائیں گے) سےے مراد ہوازن، روم و فارس، مرتدین اور وہ تمام کفار ہو سکتے ہیں جن سے مسلمان آئندہ جنگ کرنے والے تھے اور یہ قول زیادہ جامع ہے۔ ¤ ➍ {فَاِنْ تُطِيْعُوْا يُؤْتِكُمُ اللّٰهُ اَجْرًا حَسَنًا:} یعنی اگر تم ان جنگجو لوگوں سے لڑنے کے حکم کی اطاعت کرو گے تو اللہ تعالیٰ تمھیں بہت اچھا بدلا دے گا، دنیا میں فتح و نصرت اور عزت و غنیمت سے نوازے گا اور آخرت میں جنت عطا کرے گا۔ ¤ ➎ {وَ اِنْ تَتَوَلَّوْا كَمَا تَوَلَّيْتُمْ مِّنْ قَبْلُ يُعَذِّبْكُمْ عَذَابًا اَلِيْمًا:} اور اگرگر اطاعت سے پھر جاؤ گے، جیسا کہ اس سے پہلے حدیبیہ کے موقع پر پھر گئے تھے تو تمھیں درد ناک سزا دے گا کہ دنیا میں ذلت کی زندگی بسر کرو گے اور آخرت میں جہنم میں جاؤ گے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { لَيْسَ عَلَى الْاَعْمٰى حَرَجٌ … :} ان تینوں میں سے اندھے اور لنگڑے کا عذر دائمی ہے اور بیمار کا عارضی، جو بیماری ختم ہونے پر ختم ہو جاتا ہے۔ جہاد سے پیچھے رہنے والوں پر عتاب کے بعد فرمایا کہ نابینا، لنگڑا اور بیمار اگر جہاد کے لیے نہ نکلیں تو ان پر کوئی حرج نہیں۔ ¤ ➋ { وَ مَنْ يُّطِعِ اللّٰهَ وَ رَسُوْلَهٗ … :} جو شخص واقعی عذر کی وجہ سے جہاد کے لیے نہ نکل سکے مگر خلوص دل کے ساتھ اللہ اور اس کے رسول کا مطیع اور خیر خواہ ہو تو اللہ تعالیٰ اسے بھی ان جنتوں میں داخل کرے گا جن کے تلے نہریں بہتی ہیں۔ ایسے لوگ پیچھے رہنے کے باوجود جہاد میں شریک ہی سمجھے جائیں گے۔ مزید دیکھیے سورۂ توبہ کی آیت (۹۱) : « مَا عَلَى الْمُحْسِنِيْنَ مِنْ سَبِيْلٍ » کی تفسیر میں مذکور حدیث۔ ¤ ➌ { وَ مَنْ يُّطِعِ اللّٰهَ وَ رَسُوْلَهٗ … :} بقاعی نے اس کی تفسیر یہ فرمائی ہے کہ واؤ عطف کا مطلب یہ ہے کہ اس سے پہلے ایک جملہ محذوف ہے : {’’ أَيْ فَمَنْ تَخَلَّفَ مِنَ الضُّعَفَاءِ فَلَا حَرَجَ عَلَيْهِ وَمَنْ يُّطِعِ اللّٰهَ وَ رَسُوْلَهُ…‘‘} یعنی پھر اندھے، لنگڑے اور مریض میں سے جو شخص پیچھے رہ جائے اس پر کوئی حرج نہیں اور جو پیچھے نہ رہے بلکہ اللہ اور اس کے رسول کی اطاعت کرتے ہوئے عذر کے باوجود نکل پڑے تو اللہ تعالیٰ اسے ان جنتوں میں داخل کرے گا جن کے تلے نہریں بہتی ہیں اور جو عذر کی وجہ سے نہیں بلکہ اطاعت سے جی چراتے ہوئے جہاد سے منہ پھیرے گا اللہ تعالیٰ اسے عذاب الیم دے گا۔ جہاد کے لیے نہ نکلنے کے بعض مقبول عذر اس سے پہلے سورۂ توبہ (۹۱، ۹۲) میں بیان ہو چکے ہیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ {لَقَدْ رَضِيَ اللّٰهُ عَنِ الْمُؤْمِنِيْنَ … :} اس سے پہلے {’’ اِنَّ الَّذِيْنَ يُبَايِعُوْنَكَ اِنَّمَا يُبَايِعُوْنَ اللّٰهَ ‘‘} میں ححدیبیہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ پر بیعت کو اللہ تعالیٰ سے بیعت قرار دینے کے بعد اس سے پیچھے رہنے والوں کا حال بیان فرمایا، اب دوبارہ بیعت کرنے والوں پر اپنی رضا کا اور دوسری بشارتوں کا ذکر فرمایا۔ ¤ ➋ اس درخت کے نیچے بیعت کرنے والے صحابہ کرام کو بیعت کے وقت ہی کائنات کی سب سے بڑی نعمت مل گئی اور وہ ہے اللہ تعالیٰ کی رضا اور خوشنودی، کیونکہ اس سے بڑی نعمت کوئی نہیں، جیسا کہ فرمایا : « وَ رِضْوَانٌ مِّنَ اللّٰهِ اَكْبَرُ» [ التوبۃ : ۷۲ ] ’’اور اللہ کی طرف سے تھوڑی سی خوشنودی سب سے بڑی ہے۔‘‘ کیونکہ اللہ تعالیٰ نے فرمایا : « لَقَدْ رَضِيَ اللّٰهُ عَنِ الْمُؤْمِنِيْنَ اِذْ يُبَايِعُوْنَكَ تَحْتَ الشَّجَرَةِ » ’’بلاشبہ یقینا اللہ  ایمان والوں سے اس وقت راضی ہو گیا جب وہ اس درخت کے نیچے تجھ سے بیعت کر رہے تھے۔‘‘ اس رضا ہی کی وجہ سے اس کا نام بیعتِ رضوان ہو گیا۔ اللہ تعالیٰ کی رضا اور جنت کا داخلہ لازم و ملزوم ہیں۔ (دیکھیے مجادلہ: ۲۲۔ توبہ: ۷۲) جب ان صحابہ کرام رضی اللہ عنھم کے بارے میں اللہ تعالیٰ نے شہادت دے دی کہ وہ ان پر راضی ہو گیا تو کس قدر بد نصیب ہے وہ گروہ جو ان مقبول بندوں سے ناراض اور ان سے بغض و عداوت رکھے اور کہے کہ وہ بعد میں نعوذ باللہ مرتد ہو گئے۔ کیا اللہ تعالیٰ کو آئندہ کا علم نہیں تھا اور وہ رضا کیسی ہے جس کے باوجود وہ بندے مرتد ہو جائیں جن پر وہ راضی ہے ؟ اللہ تعالیٰ کی رضا کے حصول کے علاوہ مزید حاصل ہونے والی نعمتوں کا بیان آگے آ رہا ہے۔ ¤ قرآن مجید کے علاوہ صحیح احادیث میں بھی بیعت رضوان میں شریک صحابہ کی بہت زیادہ فضیلت آئی ہے۔ عمرو بن دینار کہتے ہیں کہ میں نے جابر بن عبد اللہ رضی اللہ عنھما سے سنا، وہ بیان کرتے ہیں : ’’حدیبیہ کے دن رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا : [ أَنْتُمْ خَيْرُ أَهْلِ الْأَرْضِ ] ’’تم زمین والوں میں سب سے بہتر ہو۔‘‘ اور (اس وقت) ہم چودہ سو تھے اور اگر آج مجھے دکھائی دیتا ہوتا تو میں تمھیں اس درخت کی جگہ دکھاتا۔‘‘ [ بخاري، المغازي، باب غزوۃ الحدیبیۃ : ۴۱۵۴ ] ام مبشر رضی اللہ عنھا بیان کرتی ہیں کہ انھوں نے حفصہ رضی اللہ عنھا کے پاس رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنا : [ لَا يَدْخُلُ النَّارَ، إِنْ شَاءَ اللّٰهُ مِنْ أَصْحَابِ الشَّجَرَةِ أَحَدٌ الَّذِيْنَ بَايَعُوْا تَحْتَهَا ] [ مسلم، فضائل الصحابۃ، باب من فضائل أصحاب الشجرۃ… : ۲۴۹۶ ] ’’ان شاء اللہ اس درخت والوں میں سے کوئی بھی آگ میں داخل نہیں ہو گا جنھوں نے اس کے نیچے بیعت کی۔‘‘ جابر رضی اللہ عنہ بیان کرتے ہیں کہ حاطب رضی اللہ عنہ کا ایک غلام حاطب رضی اللہ عنہ کی شکایت لے کر آیا اور کہنے لگا : ’’یا رسول اللہ! حاطب ضرور آگ میں داخل ہو گا۔‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَذَبْتَ لَا يَدْخُلُهَا فَإِنَّهُ شَهِدَ بَدْرًا وَالْحُدَيْبِيَةَ ] [ مسلم، فضائل الصححابۃ، باب من فضائل حاطب بن أبي بلتعۃ… : ۲۴۹۵ ] ’’تو نے غلط کہا، وہ آگ میں داخل نہیں ہو گا، کیونکہ اس نے تو بدر اور حدیبیہ میں شرکت کی ہے۔‘‘ ¤ ➌ جابر رضی اللہ عنہ بیان کرتے ہیں : [ كُنَّا يَوْمَ الْحُدَيْبِيَةِ أَلْفًا وَ أَرْبَعَ مِائَةٍ فَبَايَعْنَاهُ وَعُمَرُ آخِذٌ بِيَدِهِ تَحْتَ الشَّجَرَةِ وَهِيَ سَمُرَةٌ ] [ مسلم، الإمارۃ، باب استحباب مبایعۃ الإمام الجیش… : ۱۸۵۶ ] ’’ہم حدیبیہ کے دن چودہ سو تھے، ہم نے آپ صلی اللہ علیہ وسلم سے بیعت کی اور عمر رضی اللہ عنہ درخت کے نیچے آپ صلی اللہ علیہ وسلم کا ہاتھ پکڑے ہوئے تھے اور وہ کیکر کا درخت تھا۔‘‘ ¤ ➍ طارق بن عبد اللہ نے بیان کیا کہ میں حج کرنے کے لیے گیا تو میں نے کچھ لوگوں کو دیکھا کہ نماز پڑھ رہے ہیں، میں نے پوچھا: ’’کیا یہ نماز کی جگہ ہے؟‘‘ انھوں نے کہا: ’’یہ وہ درخت ہے جہاں رسول اللہ صلی اللہ علیہ وسلم نے بیعتِ رضوان لی تھی۔‘‘ میں سعید بن مسیب کے پاس آیا اور انھیں بتایا تو سعید نے فرمایا :’’ میرے والد نے مجھے بتایا کہ وہ بھی ان لوگوں میں شامل تھے جنھوں نے درخت کے نیچے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی، تو جب ہم اگلے سال آئے تو ہمیں وہ درخت بھلا دیا گیا، ہم اسے پا ہی نہ سکے۔‘‘ سعید نے فرمایا : ’’اصحاب محمد صلی اللہ علیہ وسلم کو تو وہ معلوم نہ ہوا اور تم نے اسے جان لیا، پھر تم زیادہ جاننے والے ہوئے؟‘‘ [ بخاري، المغازي، باب غزوۃ الحدیبیۃ : ۴۱۶۳ ] عبد اللہ بن عمر رضی اللہ عنھما نے فرمایا : [ رَجَعْنَا مِنَ الْعَامِ الْمُقْبِلِ فَمَا اجْتَمَعَ مِنَّا اثْنَانِ عَللَی الشَّجَرَةِ الَّتِيْ بَايَعْنَا تَحْتَهَا، كَانَتْ رَحْمَةً مِّنَ اللّٰهِ ] [ بخاري، الجھاد والسیر، باب البیعۃ في الحرب أن لا یفروا : ۲۹۵۸ ] ’’ہم آئندہ سال دوبارہ آئے تو ہم میں سے دو شخص بھی اس درخت پر متفق نہ ہو سکے جس کے نیچے ہم نے بیعت کی تھی، یہ اللہ کی طرف سے رحمت تھی۔‘‘ فتح الباری میں اس کی شرح کرتے ہوئے حافظ ابن حجر رحمہ اللہ نے فرمایا : ’’اس میں حکمت یہ تھی کہ اس درخت کے نیچے خیر کے اس کام کی وجہ سے لوگ فتنے میں مبتلا نہ ہو جائیں، کیونکہ اگر اس کی پہچان باقی رہتی تو بعض جاہل لوگوں سے اس کی تعظیم کا خطرہ تھا، حتیٰ کہ ممکن تھا کہ وہ یہ عقیدہ رکھ لیتے کہ اس درخت میں نفع اور نقصان پہنچانے کی طاقت ہے، جیسا کہ اب اس سے بھی معمولی چیزوں میں اس کا مشاہدہ ہو رہا ہے۔‘‘ ابن حجر نے اپنے زمانے کی بات کی ہے، ہمارے دور میں تو آثار پرستی کا معاملہ اس سے بھی کہیں دور پہنچ چکا ہے۔ آج کل جو لوگ پیروں فقیروں کے آستانوں کے درختوں، پتھروں اور قبروں کو پوجنے سے نہیں چوکتے اگر انھیں وہ درخت مل جاتا تو وہ کیا کچھ نہ کرتے۔ ¤ ➎ { فَعَلِمَ مَا فِيْ قُلُوْبِهِمْ فَاَنْزَلَ السَّكِيْنَةَ عَلَيْهِمْ:} یعنی اللہ تعالیٰ نے اس صدق، اخلاص اور سمع و طاعت کو جان لیا جس کی وجہ سے انھوں نے دشمن کے اعتبار سے تعداد میں بہت کم ہونے اور تقریباً نہتے ہونے کے باوجود آخر دم تک میدان میں جمے رہنے کی بیعت کی اور اس سخت اضطراب اور بے قراری کو بھی جو ان کے دل میں صلح کی ناگوار شرطوں پر پیدا ہوئی، جس کا باعث کوئی نافرمانی نہ تھی بلکہ اللہ تعالیٰ، اس کے رسول صلی اللہ علیہ وسلم اور اسلام کی محبت اور ان کی عزت اور سربلندی کا جذبہ تھا۔ تو اللہ تعالیٰ نے ان کے صدق و اخلاص کی بدولت ان کے دل پر سکینت نازل فرمائی، جس کی بدولت انھیں رسول اللہ صلی اللہ علیہ وسلم کے ہر حکم پر دلی اطمینان اور سکون حاصل ہوگیا اور وہ جس طرح موت تک لڑنے کے لیے تیار تھے رسول اللہ صلی اللہ علیہ وسلم کی قبول کردہ شرطوں پر صلح کے لیے بھی تیار ہو گئے۔ ¤ ➏ یہ آیت بیعتِ رضوان والے صحابہ کے مخلص مومن ہونے کی واضح دلیل ہے، کیونکہ اللہ تعالیٰ نے خود ان کے دلوں کے اخلاص کی شہادت دی ہے۔ نہایت بدنصیب ہیں وہ لوگ جو ایسے مخلص ایمان والوں کے متعلق کہتے ہیں کہ وہ منافق تھے۔ [ نَعُوْذُ بِاللّٰہِ مِنْ ذٰلِکَ ] ¤ ➐ { وَ اَثَابَهُمْ فَتْحًا قَرِيْبًا:} عام مفسرین اس ’’فتح قریب‘‘ سے مراد فتح خیبر لیتے ہیں اور یہ کچھ بعید بھی نہیں، مگر اہلِ علم کا ایک قول اس کے بارے میں یہ بھی ہے کہ اس سے مراد صلح حدیبیہ ہے، کیونکہ بیعتِ رضوان کے بعد یہی وہ بنیادی اور اہم فتح تھی جس سے مسلمانوں کے لیے دوسری تمام فتوحات کے راستے کھل گئے اور اس کے کچھ ہی عرصہ بعد خیبر فتح ہوا، پھر مکہ مکرمہ کی فتح ہوئی، حتیٰ کہ پورا جزیرۂ عرب رسول اللہ صلی اللہ علیہ وسلم کی زندگی ہی میں اسلام کے زیر نگیں آ گیا۔ اس سورت کی ابتدا میں اس صلح ہی کو فتح مبین فرمایا ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ {وَ مَغَانِمَ كَثِيْرَةً يَّاْخُذُوْنَهَا:} اس سے مراد خیبر اور یہود کی دوسری بستیاں ہیں جو کسی خاص مزاحمت کے بغیر مسلمانوں کو حاصل ہوئیں۔ صفی الرحمن مبارک پوری لکھتے ہیں : ’’خیبر مدینہ سے شمال کی طرف اسّی (۸۰) میل کے فاصلے پر ایک بہت بڑا شہر تھا، جس میں کئی قلعے اور بہت سے باغات تھے۔ ابن اسحاق نے فرمایا، رسول اللہ صلی اللہ علیہ وسلم حدیبیہ سے واپس آ کر مدینہ میں ذوالحجہ اور محرم کا کچھ حصہ ٹھہرے، پھر محرم کے باقی دنوں میں خیبر کی طرف نکلے۔‘‘ (الرحیق المختوم) ابوہریرہ رضی اللہ عنہ فرماتے ہیں : [ اِفْتَتَحْنَا خَيْبَرَ، وَلَمْ نَغْنَمْ ذَهَبًا وَلاَ فِضَّةً، إِنَّمَا غَنِمْنَا الْبَقَرَ وَالْإِبِلَ وَالْمَتَاعَ وَالْحَوَائِطَ ] [ بخاري، المغازي، باب غزوۃ خیبر: ۴۲۳۴ ] ’’ہم نے خیبر فتح کیا اور ہمیں سونا چاندی غنیمت میں نہیں ملا، ہمیں صرف گائے بیل، اونٹ، سامان اور باغات غنیمت میں ملے۔‘‘ خیبر کی فتح کے نتیجے میں مسلمانوں کو حاصل ہونے والی غنیمتوں کا اندازہ ابن عمر رضی اللہ عنھما کی ایک روایت سے ہوتا ہے، انھوں نے فرمایا : [ مَا شَبِعْنَا حَتّٰي فَتَحْنَا خَيْبَرَ ] [ بخاري، المغازي، باب غزوۃ خیبر : ۴۲۴۳ ] ’’ہم نے سیر ہو کر نہیں کھایا حتیٰ کہ خیبر فتح کیا۔‘‘ اور عائشہ رضی اللہ عنھا نے فرمایا : [ لَمَّا فُتِحَتْ خَيْبَرُ قُلْنَا الْآنَ نَشْبَعُ مِنَ التَّمْرِ ] [ بخاري، المغازي، باب غزوۃ خیبر : ۴۲۴۲ ] ’’جب خیبر فتح ہوا تو ہم نے کہا، اب ہم کھجوریں پیٹ بھر کر کھائیں گے۔‘‘ الرحیق المختوم میں ہے : ’’اس فتح کے نتیجے میں مہاجرین کے حصے میں اتنی زمین اور باغات آئے کہ انھوں نے کھجوروں کے وہ درخت انصار کو واپس کر دیے جو انصار نے مدینہ میں انھیں دے رکھے تھے۔‘‘ ¤ ➋ { وَ كَانَ اللّٰهُ عَزِيْزًا حَكِيْمًا:} چونکہ کفار کی تعداد اور سازو سامان کی کثرت اور مسلمانوں کی قلت کے پیش نظریہ بات ممکن نظر نہیں آتی تھی، اس جملے کے ساتھ اس فتح و غنیمت کا سبب بیان فرمایا۔ بقاعی نے فرمایا: ’’اس واؤ کے ساتھ مقدر جملے پر عطف ہے : {’’أَيْ بِعِزَّةِ اللّٰهِ وَ حِكْمَتِهِ وَكَانَ اللّٰهُ عَزِيْزًا حَكِيْمًا‘‘} یعنی یہ سب کچھ اللہ تعالیٰ کی عزت و حکمت کی بدولت ہوا اور اللہ تعالیٰ ہمیشہ سے سب پر غالب، کمال حکمت والا ہے۔ نہ اس پر کوئی غالب آ سکتا ہے، نہ اس کی تدبیر میں کسی خطا کی نشان دہی کر سکتا ہے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { وَعَدَكُمُ اللّٰهُ مَغَانِمَ كَثِيْرَةً تَاْخُذُوْنَهَا:} ان بہت سی غنیمتوں سے مراد صلح حدیبیہ، خیبر اور اس کے اردگرد کے علاقوں اور بستیوں کی فتح ہے، کیونکہ اس سے پہلے گزر چکا ہے : « سَيَقُوْلُ الْمُخَلَّفُوْنَ اِذَا انْطَلَقْتُمْ اِلٰى مَغَانِمَ لِتَاْخُذُوْهَا ذَرُوْنَا نَتَّبِعْكُمْ يُرِيْدُوْنَ اَنْ يُّبَدِّلُوْا كَلٰمَ اللّٰهِ قُلْ لَّنْ تَتَّبِعُوْنَا كَذٰلِكُمْ قَالَ اللّٰهُ مِنْ قَبْلُ فَسَيَقُوْلُوْنَ بَلْ تَحْسُدُوْنَنَاا بَلْ كَانُوْا لَا يَفْقَهُوْنَ اِلَّا قَلِيْلًا» [ الفتح : ۱۵ ] ’’عنقریب پیچھے چھوڑ دیے جانے والے لوگ کہیں گے جب تم کچھ غنیمتوںکی طرف چلو گے، تا کہ انھیں لے لو ،ہمیں چھوڑو کہ ہم تمھارے ساتھ چلیں۔ وہ چاہتے ہیں کہ اللہ کے کلام کو بدل دیں۔ کہہ دے تم ہمارے ساتھ کبھی نہیں جاؤ گے، اسی طرح اللہ نے پہلے سے کہہ دیا ہے۔ تو وہ ضرور کہیں گے بلکہ تم ہم سے حسد کرتے ہو۔ بلکہ وہ نہیں سمجھتے تھے مگر بہت تھوڑا۔ ‘‘ ¤ ➋ {فَعَجَّلَ لَكُمْ هٰذِهٖ:} تو اس نے تمھیں ان غنیمتوں میں سے یہ صلح حدیبیہ جلدی عطا فرما دی جس میں تمھارے اور قریش کے درمیان معاہدہ ہو گیا کہ دس سال تک جنگ بند رہے گی اور مسلمان آئندہ سال اسی ماہ آ کر عمرہ ادا کریں گے۔ اس کے نتیجے میں مسلمانوں اور قریش کا ایک دوسرے کے پاس آنا جانا، ملنا جلنا شروع ہو گیا اور بے شمار لوگ مسلمان ہوئے، خیبر اور دوسرے علاقوں کی فتح کا دروازہ کھل گیا، غرض یہ صلح فتح بھی تھی اور اپنے بے شمار فوائد کے لحاظ سے غنیمت بھی۔ بعض مفسرین نے اس سے مراد فتح خیبر لی ہے، یہ بھی ممکن ہے، مگر پہلی تفسیر زیادہ واضح ہے، کیونکہ یہ آیات حدیبیہ سے واپسی پر اتری ہیں۔ ¤ ➌ {وَ كَفَّ اَيْدِيَ النَّاسِ عَنْكُمْ:} مسلمانوں سے لوگوں کے ہاتھ روک دینے میں مسلمانوں کی قلت کے باوجود قریش مکہ کو لڑائی سے روک دینا بھی شامل ہے اور خیبر اور دوسرے علاقوں کے یہود کو مدینہ پر حملہ آور ہونے سے روک دینا بھی۔ یہ اللہ تعالیٰ کی طرف سے عطا کر دہ رعب تھا کہ جب مسلمانوں کی پوری جنگی قوت مدینہ سے باہر تھی، اگر اس وقت یہود اپنے حلیفوں اور منافقین کے ساتھ مل کر مدینہ پر حملہ آور ہوتے تو ان کے لیے میدان خالی تھا، کیونکہ وہاں عورتوں، بچوں اور معذوروں کے سوا کوئی موجود نہ تھا، مگر یہ اللہ تعالیٰ کی قدرت کا کرشمہ تھا کہ کسی کو یہ جرأت ہی نہیں ہونے دی۔ ¤ ➍ { وَ لِتَكُوْنَ اٰيَةً لِّلْمُؤْمِنِيْنَ:} اس جملے کا واؤ کے ساتھ مقدر جملے پر عطف ہے اور اسے مقدر اس لیے رکھا گیا ہے کہ وہ کئی جملوں میں سے کوئی ایک جملہ ہو سکتا ہے، مثلاً : {’’ فَعَجَّلَ لَكُمْ هٰذِهٖ وَ كَفَّ أَيْدِيَ النَّاسِ عَنْكُمْ لِتَشْكُرُوْهُ وَ لِتَكُوْنَ الْمُعَجَّلَةَ وَ كَفَّ أَيْدِيَ النَّاسِ عَنْكُمْ آيَةً لِّلْمُؤْمِنِيْنَ ‘‘} ’’یعنی اس نے یہ غنیمت تمھیں جلدی دے دی اور لوگوں کے ہاتھ تم سے روک دیے، تاکہ تم اس کا شکر ادا کرو اور تاکہ جلد عطا کی جانے والی یہ غنیمت اور لوگوں کے ہاتھوں کا تم سے روک دیا جانا ایمان والوں کے لیے ایک نشانی بن جائے (کہ آئندہ بھی اللہ تعالیٰ اسی طرح ہماری مدد فرمائے گا)۔‘‘ {’’لِتَشْكُرُوْهُ‘‘} کے بجائے مقدر جملہ {’’لِيَحْصُلَ لَهُمُ السَّكِيْنَةُ‘‘} یا {’’لِيَزْدَادُوْا إِيْمَانًا‘‘} وغیرہ بھی ہو سکتا ہے اور اسے حذف اسی لیے کیا گیا ہے کہ اگر ذکر کیا جاتا تو ایک آدھ بات ذکر ہو سکتی تھی، حالانکہ وہ بہت سی چیزیں ہیں جن کے لیے اللہ تعالیٰ نے یہ غنیمت پہلے عطا کر دی۔ ¤ ➎ { وَ يَهْدِيَكُمْ صِرَاطًا مُّسْتَقِيْمًا:} یہ جملہ بھی قرآن مجید کے معجزات میں سے ایک معجزہ ہے، کیونکہ اہل حدیبیہ میں سے کوئی ایک شخص بھی صراطِ مستقیم سے ادھر ادھر نہیں ہوا، بلکہ سب کے سب آخر دم تک اسلام پر قائم رہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { وَ اُخْرٰى لَمْ تَقْدِرُوْا عَلَيْهَا … : ’’ اُخْرٰى ‘‘ ’’مَغَانِمَ‘‘} کی صفت ہے جو یہاں محذوف ہے اور اس کا عطف {’’ مَغَانِمَ كَثِيْرَةً ‘‘} پر ہے۔ یعنی اللہ تعالیٰ نے ان غنیمتوں کے علاوہ، جن کا اوپر ذکر ہوا، کئی اور غنیمتوں کا بھی وعدہ فرمایا ہے جن پر تم قادر نہیں ہوئے، مگر اللہ تعالیٰ نے انھیں گھیرے میں لے لیا ہے۔ اس سے مراد سب سے پہلے فتح مکہ ہے جو فتح الفتوح تھی۔ مسلمان حدیبیہ والے سال اور اس سے اگلے سال اسے حاصل نہیں کر سکے مگر اللہ تعالیٰ کے علم میں اس کا فیصلہ ہو چکا تھا، چنانچہ صلح حدیبیہ ہی اس کا پیش خیمہ بنی۔ اس صلح کی ایک شرط یہ تھی کہ جو قبیلہ چاہے مسلمانوں کا حلیف بن جائے اور جو چاہے قریش مکہ کا حلیف بن جائے اور کوئی کسی کے خلاف یا اس کے حلیف کے خلاف جنگ نہ کرے۔ اس موقع پر بنو خزاعہ رسول اللہ صلی اللہ علیہ وسلم کے حلیف اور بنو بکر قریش مکہ کے حلیف بن گئے۔ مشرکین صلح کے بعد صرف دو سال تک معاہدہ پر قائم رہے، پھر ان کے حلیف قبیلہ بنو بکر نے رسول اللہ صلی اللہ علیہ وسلم کے حلیف بنو خزاعہ پر حملہ کر دیا، جس میں قریش نے اسلحے اور آدمیوں کے ساتھ ان کی مدد کی اور کعبہ میں پناہ لینے کے باوجود انھیں قتل کیا۔ رسول اللہ صلی اللہ علیہ وسلم کو ان کے معاہدہ توڑنے کی اطلاع ملی تو آپ نے نہایت اخفا کے ساتھ دس ہزار صحابہ کرام کے ساتھ مکہ کی طرف کوچ فرمایا اور اللہ تعالیٰ نے مکہ فتح فرما دیا۔ لفظ عام ہونے کی وجہ سے فتح مکہ کے علاوہ وہ تمام فتوحات {’’ وَ اُخْرٰى لَمْ تَقْدِرُوْا عَلَيْهَا ‘‘} میں داخل ہیں جو اس کے بعد مسلمانوں کو حاصل ہوئیں، جن میں ثقیف و ہوازن کی فتح اور تبوک وغیرہ کی فتح بھی شامل ہیں۔ روم و فارس، مصر و شام، ہند و سندھ اور زمین کے مشرق و مغرب کے وہ تمام ممالک بھی جو قیامت تک مسلمانوں کے قبضے میں آنے والے تھے۔ ¤ ➋ {قَدْ اَحَاطَ اللّٰهُ بِهَا وَ كَانَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ قَدِيْرًا:} یہ اس سوال کا جواب ہے جو یہاں پیدا ہو سکتا تھا کہ مدینہ کی بستی کے یہ چودہ پندرہ سو آدمی، جن کے پاس اسلحہ اور دوسری ضروریات حتیٰ کہ سامانِ خورد و نوش کی بھی کمی ہے، اتنی کثیر فتوحات اور غنیمتیں کیسے حاصل کر سکتے ہیں، جب کہ پورا عرب ان کے خلاف ہے، جن کے پاس آدمیوں، اسلحے اور ساز و سامان کی فراوانی ہے؟ فرمایا یہ لوگ واقعی وہ فتوحات اور غنیمتیں حاصل نہیں کر سکتے، مگر جب اللہ تعالیٰ نے ان کا گھیرا کر لیا ہو اور انھیں مسلمانوں کو عطا فرمانا چاہتا ہو تو پھر کون ہے جو اسے روک سکے؟ اور اللہ تعالیٰ تو ہمیشہ سے ہر چیز پر پوری طرح قدرت رکھنے والا ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ { وَ لَوْ قٰتَلَكُمُ الَّذِيْنَ كَفَرُوْا لَوَلَّوُا الْاَدْبَارَ:} اس سے پہلے اللہ تعالیٰ نے ذکر فرمایا کہ اس نے کفار کے ہاتھ تم سے روک دیے کہ وہ لڑائی سے باز رہے، اب فرمایا کہ حدیبیہ کے مقام پر بظاہر دب کر جو صلح کی جا رہی تھی وہ بزدلی کی بنا پر یا اس خطرے کے پیش نظر نہیں تھی کہ مسلمانوں کو شکست ہو جائے گی، بلکہ اس میں بہت سی حکمتیں ملحوظ تھیں، جن میں بعض کا ذکر گزر چکا اور کچھ آگے بیان ہو رہی ہیں۔ چنانچہ فرمایا کہ اگر اس موقع پر کفار تم سے لڑ پڑتے تو یقینا پیٹھیں پھیر کر بھاگ جاتے اور مکہ اسی وقت فتح ہو جاتا مگر یہ مصلحت کے خلاف تھا۔ ¤ ➋ { ثُمَّ لَا يَجِدُوْنَ وَلِيًّا وَّ لَا نَصِيْرًا:’’ ثُمَّ ‘‘} (پھر) کے لفظ کا مطلب یہ ہے کہ اس کے بعد خواہ کتنی مدت گزر جائے اور خواہ ان مشرکین کی تعداد کتنی ہو جائے کسی وقت بھی انھیں کوئی حمایتی ملے گا نہ کوئی مددگار۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) { سُنَّةَ اللّٰهِ الَّتِيْ قَدْ خَلَتْ مِنْ قَبْلُ … : } مراد اللہ تعالیٰ کی وہ سنت ہے جو ے جو اس کے انبیاء کو جھٹلانے والی اقوام کے بارے میں ہمیشہ سے جاری ہے کہ جب وہ حد سے گزر جاتی ہیں تو انھیں ایسی سزا دی جاتی ہے کہ انھیں کوئی حمایتی ملتا ہے نہ مددگار اور اللہ تعالیٰ کی اس سنت میں کوئی تبدیلی نہیں ہو گی۔ ہاں عذاب کئی طرح سے آ سکتا ہے، قدرتی آفات کے ساتھ بھی، جیسا کہ قومِ نوح، عاد و ثمود اور آلِ فرعون پر آیا اور مومن بندوں کے ہاتھوں بھی، جیسا کہ فرمایا : « قَاتِلُوْهُمْ يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ» [ التوبۃ: ۱۴ ]’’ان سے لڑو، اللہ انھیں تمھارے ہاتھوں سے عذاب دے گا۔‘‘"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ {وَ هُوَ الَّذِيْ كَفَّ اَيْدِيَهُمْ عَنْكُمْ وَ اَيْدِيَكُمْ عَنْهُمْ … :} جب رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنھم حدیبیہ میں تھے تو صلح کی بات چیت کے دوران اور صلح ہو جانے کے بعد بھی مشرکین نے کوششیں کیں کہ کسی طرح لڑائی چھڑ جائے اور صلح نہ ہو سکے۔ ان کے متعدد گروہ چھپ کر رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کے خلاف کارروائی کے لیے آئے، مگر کوئی نقصان نہ پہنچا سکے، بلکہ ہر مرتبہ مسلمانوں کے ہاتھوں گرفتار ہوئے۔ انھیں قتل بھی کیا جا سکتا تھا مگر رسول اللہ صلی اللہ علیہ وسلم نے انھیں چھوڑ دیا، کیونکہ سزا دینے کی صورت میں جنگ ناگزیر ہو جاتی جب کہ مسلمانوں کی مصلحت صلح میں تھی۔ اللہ تعالیٰ نے اس آیت میں اپنے اس احسان کی یاد دہانی کروائی ہے۔ یہاں کفار کی ان کوششوں کے تین واقعات درج کیے جاتے ہیں : ¤ (1) سلمہ بن اکوع رضی اللہ عنہ کہتے ہیں، میں طلحہ بن عبید اللہ رضی اللہ عنہ کے ساتھ رہتا تھا، ان کے گھوڑے کو پانی پلاتا، اس کی مالش کرتا، ان کی خدمت کرتا اور انھی کے ہاں کھانا کھایا کرتا تھا اور میں اللہ اور اس کے رسول کی طرف ہجرت کرتے ہوئے اپنا اہل و مال چھوڑ آیا تھا۔ پھر جب ہماری اور اہلِ مکہ کی صلح ہو گئی اور ہم ایک دوسرے سے ملنے جلنے لگے تو میں ایک درخت کے نیچے کانٹے وغیرہ صاف کرکے اس کے سائے میں لیٹ گیا۔ اہلِ مکہ میں سے چار مشرک میرے پاس آئے اور رسول اللہ صلی اللہ علیہ وسلم کے متعلق بد زبانی کرنے لگے۔ میں ان سے نفرت کی وجہ سے ایک اور درخت کے نیچے چلا گیا اور وہ اپنا اسلحہ درخت کے ساتھ لٹکا کر لیٹ گئے۔ اسی دوران وادی کے نیچے سے کسی نے آواز دی : ’’او مہاجرو! ابن زُنیم کو قتل کر دیا گیا۔‘‘ میں نے اپنی تلوار لی اور ان چاروں پر حملہ کر دیا، وہ سوئے ہوئے تھے، میں نے ان کا اسلحہ لے کر اپنی مٹھی میں اکٹھا کر لیا اور ان سے کہا:’’قسم اس ذات کی جس نے محمد صلی اللہ علیہ وسلم کے چہرے کو عزت بخشی ہے! تم میں سے جو بھی سر اٹھائے گا میں اس کا سر اڑا دوں گا جس میں اس کی آنکھیں ہیں۔‘‘ خیر میں انھیں ہانکتا ہوا رسول اللہ صلی اللہ علیہ وسلم کے پاس لے آیا اور میرا چچا عامر عَبَلات میں سے ’’مِکرز‘‘ نامی ایک مشرک کو کھینچتا ہوا لایا۔ یہاں تک کہ ہم نے انھیں ستر (۷۰) مشرکین سمیت رسول اللہ صلی اللہ علیہ وسلم کے سامنے لا کھڑا کیا۔ آپ صلی اللہ علیہ وسلم نے ان کی طرف دیکھا اور فرمایا : [ دَعُوْهُمْ يَكُنْ لَهُمْ بَدْءُ الْفُجُوْرِ وَ ثِنَاهُ ] ’’انھیں چھوڑ دو، تاکہ عہد شکنی کی ابتدا اور دہرائی انھی کے ذمے رہے۔‘‘ غرض رسول اللہ صلی اللہ علیہ وسلم نے انھیں معاف کر دیا اور اللہ تعالیٰ نے یہ آیت اتاری : « وَ هُوَ الَّذِيْ كَفَّ اَيْدِيَهُمْ عَنْكُمْ وَ اَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْۢ بَعْدِ اَنْ اَظْفَرَكُمْ عَلَيْهِمْ» [ الفتح : ۲۴ ] ’’اور وہی ہے جس نے مکہ کی وادی میں ان کے ہاتھ تم سے اور تمھارے ہاتھ ان سے روک دیے، اس کے بعد کہ تمھیں ان پر فتح دے دی۔‘‘ [ مسلم، الجہاد، باب غزوۃ ذي قرد وغیرھا : ۱۸۰۷ ] ¤ (2) انس رضی اللہ عنہ بیان کرتے ہیں کہ اہلِ مکہ میں سے اسّی (۸۰) مسلح آدمی جبل تنعیم سے اتر کر آئے۔ وہ رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحابہ کی غفلت سے فائدہ اٹھانا چاہتے تھے، مگر آپ نے انھیں زندہ سلامت گرفتار کر لیا۔ پھر انھیں زندہ ہی رہنے دیا تو اللہ عز و جل نے یہ آیت اتاری : «وَ هُوَ الَّذِيْ كَفَّ اَيْدِيَهُمْ عَنْكُمْ وَ اَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْۢ بَعْدِ اَنْ اَظْفَرَكُمْ عَلَيْهِمْ » [ الفتح:۲۴]’’اور وہی ہے جس نے مکہ کی وادی میں ان کے ہاتھ تم سے اور تمھارے ہاتھ ان سے روک دیے، اس کے بعد کہ تمھیں ان پر فتح دے دی۔‘‘ [ مسلم، الجہاد، باب قول اللّٰہ تعالٰی : «وھو الذی کف أیدیہم عنکم» : ۱۸۰۸ ] ¤ (3) عبد اللہ بن مغفل مزنی رضی اللہ عنہ بیان کرتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کےے ساتھ حدیبیہ میں اس درخت کے نیچے موجود تھے جس کا ذکر اللہ تعالیٰ نے قرآن میں فرمایا ہے۔ اس کی ٹہنیاں رسول اللہ صلی اللہ علیہ وسلم کی کمر سے لگ رہی تھیں اور علی بن ابی طالب رضی اللہ عنہ اور سہیل بن عمرو آپ کے سامنے تھے۔ رسول اللہ صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ سے فرمایا: ’’لکھو، بسم اللہ الرحمن الرحیم۔‘‘ تو سہیل نے ان کا ہاتھ پکڑ لیا اور کہا: ’’ہم نہیں جانتے رحمان کیا ہوتا ہے، ہمارے معاملے میں وہی لکھو جو ہمارے ہاں معروف ہے۔‘‘ اس نے کہا : ’’یہ لکھو : {’’ بِسْمِكَ اللّٰهُمَّ۔‘‘} پھر انھوں نے لکھا : ’’یہ وہ ہے جس پر محمد رسول اللہ صلی اللہ علیہ وسلم نے اہلِ مکہ سے صلح کی ہے۔‘‘ تو سہیل بن عمرو نے ان کا ہاتھ پکڑ لیا اور کہا : ’’اللہ کی قسم! اگر آپ اللہ کے رسول ہوں تو ہم نے آپ پر ظلم کیا، ہمارے معاملے میں وہ لکھو جو ہمارے ہاں معروف ہے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’لکھو، یہ وہ ہے جس پر محمد بن عبد اللہ بن عبد المطلب نے صلح کی ہے اور میں اللہ کا رسول بھی ہوں۔‘‘ یہ معاملہ ہو رہا تھا کہ تیس مسلح نوجوان نکل کر ہمارے سامنے آ گئے اور ہمارے سامنے آ کر مشتعل ہو گئے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے ان پر بددعا کی تو اللہ تعالیٰ نے انھیں اندھا کر دیا، ہم نے بڑھ کر انھیں گرفتار کر لیا۔ آپ صلی اللہ علیہ وسلم نے ان سے پوچھا : ’’کیا تم کسی کے عہد میں آئے ہو یا کسی نے تمھیں امان دی ہے؟‘‘ انھوں نے کہا : ’’نہیں!‘‘ تو آپ صلی اللہ علیہ وسلم نے انھیں رہا کر دیا، اس پر اللہ عز و جل نے یہ آیت نازل فرمائی : « وَ هُوَ الَّذِيْ كَفَّ اَيْدِيَهُمْ عَنْكُمْ وَ اَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْۢ بَعْدِ اَنْ اَظْفَرَكُمْ عَلَيْهِمْ» [ الفتح : ۲۴ ] ’’اور وہی ہے جس نے مکہ کی وادی میں ان کے ہاتھ تم سے اور تمھارے ہاتھ ان سے روک دیے، اس کے بعد کہ تمھیں ان پر فتح دے دی اور اللہ اس کو جو تم کرتے ہو، ہمیشہ سے خوب دیکھنے والا ہے۔ ‘‘ [ مسند أحمد:۴ /۸۶،۸۷،ح:۱۶۸۰۵ ] مسند احمد کے محققین نے اسے صحیح کہا ہے۔ ¤ ➋ یہاں بیت اللہ والے شہر کا نام ’’مکہ‘‘ بیان فرمایا ہے، جب کہ سورۂ آلِ عمران (۹۶) میں اس کا نام ’’بکہ‘‘ قرار دیا ہے، معلوم ہوا اس شہر کے دونوں نام ہیں۔ ¤ ➌ { وَ كَانَ اللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرًا:} یعنی اللہ تعالیٰ کفار کی سرا سر زیادتی اور تمھارے صبر اور اطاعت کو خوب دیکھ رہا تھا، اس کے باوجود اس نے بہت سی مصلحتوں کے پیشِ نظر ان کے ہاتھ تم سے اور تمھارے ہاتھ ان سے روک دیے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ {هُمُ الَّذِيْنَ كَفَرُوْا وَ صَدُّوْكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ:} اس سے اہلِ مکہ کی اس زیادتی کا بیان مقصود ہے جسے اللہ تعالیٰ نے ان کے لیے عار قرار دیا اور وہ یہ کہ اللہ کے رسول پر ایمان لانے کے بجائے کفر پر اڑ گئے اور انھوں نے مسلمانوں کو مسجد حرام میں داخلے اور اس کے طواف سے اور عمرہ کے دوسرے ارکان ادا کرنے سے روک دیا اور لڑائی پر آمادہ ہو گئے، حالانکہ رسول اللہ صلی اللہ علیہ وسلم اور مسلمان لڑنے کی نیت سے نہیں آئے تھے، نہ وہ پوری طرح ہتھیار لائے تھے، بلکہ وہ حالت احرام میں تھے۔ لڑنا تو ایک طرف رہا وہ اس حالت میں کسی کو ایذا بھی نہیں دے سکتے تھے۔ ¤ ➋ {وَ الْهَدْيَ مَعْكُوْفًا اَنْ يَّبْلُغَ مَحِلَّهٗ: ’’ الْهَدْيَ ‘‘} مصدر بمعنی اسم مفعول : {’’أَيْ اَلْأَنْعَامُ الْمَهْدِيَّةُ‘‘} وہ چوپائے جو کعبہ میں قربانی کے لیے لائے جاتے ہیں۔ یہ لفظ مصدر ہونے کی وجہ سے واحد جمع اور مذکر و مؤنث سب پر استعمال ہوتا ہے۔ {’’ مَعْكُوْفًا ‘‘ ’’عَكَفَ يَعْكُفُ‘‘} (ن) سے اسم مفعول ہے۔ {’’عَكَفَ‘‘} لازم بھی آتا ہے جس کا معنی ’’ایک جگہ ٹھہرنے کو لازم کر لینا ‘‘ ہے، جیسا کہ فرمایا : « وَ اَنْتُمْ عٰكِفُوْنَ فِي الْمَسٰجِدِ » [ البقرۃ : ۱۸۷ ] ’’جب کہ تم مسجدوں میں معتکف ہو۔‘‘ یہاں متعدی استعمال ہوا ہے : {’’عَكَفَهُ أَيْ حَبَسَهُ۔‘‘ ’’ مَعْكُوْفًا ‘‘} جسے ایک جگہ روک کر رکھا گیا ہو۔ {’’ الْهَدْيَ ‘‘} پر نصب اس لیے آیا ہے کہ اس کا عطف {’’ صَدُّوْكُمْ ‘‘} میں ضمیر مخاطب پر ہے اور {’’ مَعْكُوْفًا ‘‘ ’’ الْهَدْيَ ‘‘} سے حال ہونے کی وجہ سے منصوب ہے، یعنی یہ وہ لوگ ہیں جنھوں نے کفر کیا اور تمھیں مسجد حرام سے روکا اور قربانی کے جانوروں کو بھی روک دیا، اس حال میں کہ وہ اپنے حلال ہونے کی جگہ پہنچنے سے روکے ہوئے تھے۔ یعنی قربانیوں کو بھی مکہ میں داخل نہیں ہونے دیا جو عمرہ اور حج کی قربانیوں کے حلال ہونے. کی اصل جگہ ہے۔ رسول اللہ صلی اللہ علیہ وسلم اپنے ساتھ ہدی یعنی قربانی کے اونٹ لے کر آئے تھے، جب کفار نے اس سال مکہ میں داخلے اور عمرہ کرنے کی اجازت دینے سے انکار کر دیا اور اسے آئندہ سال کے لیے مؤخر کر دیا تو رسول اللہ صلی اللہ علیہ وسلم نے حدیبیہ کے مقام پر وہ جانور قربان کر دیے اور سر منڈا کر احرام کھول دیا۔ ¤ ➌ {وَ لَوْ لَا رِجَالٌ مُّؤْمِنُوْنَ وَ نِسَآءٌ مُّؤْمِنٰتٌ …: ’’ تَطَـُٔوْهُمْ ‘‘ ’’وَطِئَ يَطَأُ وَطْأً‘‘} (س) روندنا، پامال کرنا۔ یہ مضارع معلوم سے جمع مذکر حاضر ہے۔ {’’ مَعَرَّةٌ‘‘} عیب، گناہ، نقصان۔ اللہ تعالیٰ نے اس آیت میں اس موقع پر جنگ نہ ہونے دینے کی دو وجہیں بیان فرمائی ہیں : ایک یہ کہ مکہ میں مشرکین کے ساتھ کئی مومن مرد اور مومن عورتیں بھی موجود تھیں، جن کا مسلمانوں کو علم نہیں تھا۔ ان میں سے کچھ وہ تھے جو مسلمان ہو چکے تھے مگر انھوں نے اپنا ایمان چھپا رکھا تھا اور کچھ وہ تھے جو کھلم کھلا مسلمان ہو چکے تھے مگر بے بسی کی وجہ سے مدینہ منورہ کی طرف ہجرت نہیں کر سکتے تھے اور کفار کے ظلم و ستم کا نشانہ بنے ہوئے تھے۔ اگر مکہ پر حملہ ہوتا تو مشرکین کے ساتھ وہ مومن مرد اور مومن عورتیں بھی روند دیے جاتے جو مسلمانوں کے لیے عیب کا باعث ہوتا کہ انھوں نے اپنے ہی بھائی بہنوں کو قتل کر دیا، حالانکہ ان کا یہ قتل لاعلمی کی بنا پر ہوتا۔ عیب کا باعث ہونے سے مراد کفار کی طرف سے عیب لگانا ہے کہ مسلمانوں نے اپنے ہی بھائی مار دیے اور وہ رنج و الم بھی جو اپنے بھائیوں کو قتل کرنے سے مسلمانوں کے دلوں میں پیدا ہوتا، ورنہ جنگ کے دوران کفار میں رہنے والے کسی مسلمان کو قتل کرنے پر نہ دیت ہے نہ کفارہ اور نہ ہی ملامت۔ اللہ تعالیٰ نے جنگ روک کر یہ نوبت ہی نہ آنے دی کہ مسلمانوں پر کوئی الزام آ سکے۔ واضح رہے کہ {’’ وَ لَوْ لَا رِجَالٌ مُّؤْمِنُوْنَ ‘‘} سے {’’ بِغَيْرِ عِلْمٍ ‘‘} تک جملہ شرط ہے، جزا اس کی محذوف ہے، کیونکہ وہ خود واضح ہو رہی ہے، یعنی اگر یہ مانع نہ ہوتا ’’تو تمھارے ہاتھ نہ روکے جاتے، بلکہ اہلِ مکہ پر حملہ کر دیا جاتا۔‘‘ ¤ ➍ { لِيُدْخِلَ اللّٰهُ فِيْ رَحْمَتِهٖ مَنْ يَّشَآءُ:} یہ اس وقت جنگ سے مسلمانوں کے ہاتھ روک دینے کی دوسری وجہ ہے کہ اللہ تعالیٰ مشرکین میں سے بہت سے لوگوں کو ایمان کی توفیق عطا فرما کر اپنی رحمت میں داخل کرنا چاہتا تھا، جو کفار اور مسلمانوں کی صلح اور باہمی میل جول ہی سے ممکن تھا۔ اگر لڑائی ہو جاتی تو انھیں سوچنے سمجھنے اور اسلام قبول کرنے کا موقع ہی نہ ملتا اور نہ معلوم کتنے ہی کفر کی حالت میں مارے جاتے۔ پھر واقعی اس صلح کی بدولت بے شمار لوگ اسلام میں داخل ہوئے، سنہ ۶ہجری میں آنے والے مسلمان صرف چودہ سو تھے، دو سال کے قلیل عرصے میں مکہ فتح کرنے کے لیے آنے والوں کی تعداد دس ہزار تھی اور مکہ فتح ہونے اور مشرکین کو عام معافی کے اعلان پر پورا مکہ مسلمان ہو گیا۔ (والحمد للہ) ¤ ➎ {لَوْ تَزَيَّلُوْا لَعَذَّبْنَا الَّذِيْنَ كَفَرُوْا … : ’’ تَزَيَّلُوْا ‘‘ ’’ تَزَيَّلَ يَتَزَيَّلُ تَزَيُّلاً ‘‘} (تفعّل) ایک دوسرے سے جدا ہونا۔ یعنی اگر اس موقع پر مکہ میں رہنے والے مسلم و کافر کی پوری طرح تمیز ہوتی اور وہ لوگ جو مسلمان ہو چکے تھے یا آئندہ ان کی قسمت میں مسلمان ہونا لکھا تھا، کفار سے الگ اور نمایاں ہوتے تو ہم اہلِ مکہ کے کفار کو ایسی درد ناک سزا دیتے کہ یا تو لڑائی میں مارے جاتے یا قید ہو کر ذلیل و خوار ہوتے۔ ¤ ➏ اس آیت سے ظاہر ہے کہ ایمان والوں کا وجود دنیا میں کفار کے لیے بھی باعث رحمت ہے، اس طرح کہ ان کی موجودگی کی وجہ سے بعض اوقات کفار بھی عذاب سے بچ جاتے ہیں۔ مزید دیکھیے سورۂ انفال (۳۳)۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ {اِذْ جَعَلَ الَّذِيْنَ كَفَرُوْا فِيْ قُلُوْبِهِمُ الْحَمِيَّةَ:} لفظ {’’ اِذْ ‘‘} پچھلی آیت کے آخر میں {’’ لَعَذَّبْنَا ‘‘} کا ظرف ہے، یعنی اگر وہ مومن مرد اور مومن عورتیں کفار سے الگ ہو گئے ہوتے ’’تو ہم ان لوگوں کو جنھوں نے کفر کیا، دردناک سزا دیتے، جب ان کفر کرنے والوں نے اپنے دل میں ضد رکھ لی تھی…۔‘‘ اور فعل محذوف {’’اُذْكُرْ‘‘} کا مفعول بہ بھی ہو سکتا ہے، یعنی اس وقت کو یاد کر جب … ۔ ¤ ➋ { حَمِيَّةَ الْجَاهِلِيَّةِ:} جاہلیت کی ضد سے مراد یہ ہے کہ انھوں نے وہ بات ماننے سے بھی انکار کر دیا جو تمام عرب کے ہاں مسلّم تھی کہ اللہ کے گھر سے کسی طواف یا عمرہ یا حج ادا کرنے والے کو روکا نہیں جا سکتا اور حرمت والے مہینوں میں لڑنے کی اجازت نہیں۔ بلکہ وہ لڑنے پر تیار ہو گئے اور کہنے لگے، ہم یہ عار برداشت نہیں کر سکتے کہ ہم سے زبردستی کوئی مکہ میں داخل ہو، اس لیے اس سال مسلمان واپس چلے جائیں، آئندہ سال آ کر عمرہ ادا کر لیں، وہ بھی صرف تین دن ٹھہریں اور اسلحہ میں صرف تلوار لا سکتے ہیں جو نیام میں ہو۔ اس کے علاوہ ان کا بات بات پر رسول اللہ صلی اللہ علیہ وسلم سے الجھنا اور صلح کے لیے ناروا شرطیں لگانا بھی جاہلیت کی ضد تھی، مثلاً یہ کہنا کہ {’’بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ‘‘} کے بجائے {’’بِاسْمِكَ اللّٰهُمَّ‘‘} لکھو اور ’’محمد رسول اللہ‘‘ کے بجائے ’’محمد بن عبد اللہ‘‘ لکھو اور کوئی شخص مسلمان ہو کر تمھارے پاس جائے تو اسے واپس کرو، لیکن اگر کوئی مرتد ہو کر ہمارے پاس آئے تو ہم اسے واپس نہیں کریں گے۔ اسی طرح سہیل بن عمرو کا اپنے مسلمان ہو جانے والے بیٹے ابوجندل کو عین معاہدے کے درمیان آ کر اپنی حالت زار دکھانے کے باوجود مسلمانوں کے ساتھ جانے کی اجازت دینے سے انکار اور سب کے سامنے اس پر تشدد بھی جاہلیت کی ضد تھی۔ ¤ ➌ { فَاَنْزَلَ اللّٰهُ سَكِيْنَتَهٗ عَلٰى رَسُوْلِهٖ وَ عَلَى الْمُؤْمِنِيْنَ:} سکینت سے مراد وہ تحمل و حوصلہ اور صبر و وقار ہے جس کے ساتھ نبی صلی اللہ علیہ وسلم اور مسلمانوں نے کفارِ مکہ کی جاہلانہ حمیت کا مقابلہ کیا کہ نہ مشتعل ہوئے، نہ کوئی ناحق بات زبان سے کہی اور نہ اپنے کسی عمل سے کفار کو لڑائی چھیڑنے کا موقع دیا۔ ¤ ➍ اس آیت کے الفاظ پر غور کریں تو کفار اور مسلمانوں کے طرزِ عمل کے درمیان اور اللہ تعالیٰ کے ان کے ساتھ معاملے کے درمیان فرق کا اندازہ ہوتا ہے : (1)کفار نے اپنے دلوں میں حمیت یعنی ضد رکھ لی، سوچے سمجھے بغیر یہ ضد رکھنے والے وہ خود تھے۔ اس کے مقابلے میں رسول اللہ صلی اللہ علیہ وسلم اور مومنوں کے دلوں میں سکینت تھی، جو اپنے خزانے سے نازل کرنے والا اللہ تعالیٰ تھا۔ (2)کفار کے دلوں میں موجود ضد جاہلیت کی ضد تھی، جبکہ رسول اللہ صلی اللہ علیہ وسلم اور مومنوں کے دلوںمیں سکینت ربانی سکینت تھی۔ ¤ ➎ {وَ اَلْزَمَهُمْ كَلِمَةَ التَّقْوٰى:} وہ تقویٰ کی بات یہ تھی کہ مسلمان تنگی ترشی، جوش، غضب، غرض ہر طرح کے حالات میں اپنے آپ کو اللہ اور اس کے رسول کی اطاعت کا پابند بنائے رکھیں۔ یہ اللہ تعالیٰ کا خاص فضل تھا کہ اس نے اپنے رسول صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنھم کے مشتعل جذبات کو سکون بخش کر اور اپنے حکم کی پابندی پر قائم رکھ کر صلح کا کام پایۂ تکمیل تک پہنچا دیا۔ ¤ ➏ { وَ كَانُوْۤا اَحَقَّ بِهَا وَ اَهْلَهَا:} اور وہ اس کے زیادہ حق دار اور اس کے اہل تھے، کیونکہ وہ اللہ اور اس کے رسول پر ایمان رکھتے تھے اور انھیں رسول اللہ صلی اللہ علیہ وسلم کی صحبت اور آپ کی تربیت پانے کا شرف حاصل تھا۔ ¤ ➐ { وَ كَانَ اللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمًا:} اور اللہ تعالیٰ ہمیشہ سے ہر چیز کو پوری طرح جاننے والا ہے۔ اس علم ہی کے ساتھ اس نے ان پاکیزہ ہستیوں کو تقویٰ کے سب سے زیادہ حق دار اور اہل جان کر اپنے رسول کی صحبت کے لیے چنا، اس کی اطاعت کی توفیق بخشی اور انھیں تقویٰ کی بات پر قائم رکھا۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { لَقَدْ صَدَقَ اللّٰهُ رَسُوْلَهُ الرُّءْيَا بِالْحَقِّ:} اس کی ترکیب دو طرح سے کی  جاتی ہے، ایک یہ کہ {’’ صَدَقَ اللّٰهُ ‘‘} فعل اور فاعل ہے، {’’ رَسُوْلَهُ ‘‘} اس کا مفعول بہ ہے اور {’’ الرُّءْيَا ‘‘} سے پہلے حرف جار {’’فِيْ‘‘} محذوف ہے، جس کے حذف کی وجہ سے {’’ الرُّءْيَا ‘‘} منصوب ہے، اسے منصوب بنزع الخافض کہتے ہیں : {’’أَيْ فِي الرُّؤْيَا۔‘‘} ترجمہ اسی ترکیب کے مطابق کیا گیا ہے کہ بلاشبہ یقینا اللہ نے اپنے رسول کو خواب میں حق کے ساتھ سچی خبر دی یا سچ کہا۔ اس کی مثال یہ آیت ہے : « مِنَ الْمُؤْمِنِيْنَ رِجَالٌ صَدَقُوْا مَا عَاهَدُوا اللّٰهَ عَلَيْهِ » [الأحزاب: ۲۳] {’’أَيْ فِيْ مَا عَاهَدُوا اللّٰهَ عَلَيْهِ‘‘} ’’مومنوں میں سے کچھ مرد ایسے ہیں جنھوں نے اس بات میں سچ کہا جس پر انھوں نے اللہ سے عہد کیا۔‘‘ دوسری ترکیب یہ ہے کہ {’’ صَدَقَ اللّٰهُ ‘‘} فعل و فاعل ہے، {’’ رَسُوْلَهُ ‘‘} پہلا مفعول ہے اور {’’ الرُّءْيَا ‘‘} دوسرا مفعول ہے۔ یعنی بلاشبہ یقینا اللہ نے اپنے رسول کو حق کے ساتھ سچا خواب دکھایا۔ اس صورت میں {’’ صَدَقَ ‘‘} دو مفعولوں کی طرف متعدی ہو گا۔ {’’ بِالْحَقِّ ‘‘} کا مطلب ہے واقع کے عین مطابق۔ ¤ ➋ { لَتَدْخُلُنَّ الْمَسْجِدَ الْحَرَامَ …:} حدیبیہ روانہ ہونے سے پہلے مدینہ منورہ میں رسول اللہ صلی اللہ علیہ وسلم نے خواب دیکھا کہ آپ صلی اللہ علیہ وسلم اپنے صحابہ سمیت امن و اطمینان کے ساتھ کسی خوف کے بغیر مکہ میں داخل ہوتے ہیں، بیت اللہ کا طواف اور عمرہ کے دوسرے ارکان ادا کر رہے ہیں، پھر کوئی سر منڈوا رہا ہے اور کوئی کتروا رہا ہے۔ پیغمبر کا خواب چونکہ وحی ہوتا ہے اور کسی صورت جھوٹا نہیں ہو سکتا، اس لیے مسلمان بہت خوش ہوئے اور عموماً انھوں نے سمجھا کہ اسی سال مکہ میں داخلہ ہو گا، مگر جب مکہ میں داخل ہوئے بغیر حدیبیہ سے واپس پلٹے تو بعض صحابہ کے دلوں میں اس کے متعلق کچھ تردّد پیدا ہوا کہ خواب پورا نہیں ہوا۔ تو اس وقت اللہ تعالیٰ نے یہ آیت نازل کرکے واضح فرمایا کہ پیغمبر صلی اللہ علیہ وسلم کو یہ خواب ہم نے دکھایا اور یہ بالکل سچ ہے جو یقینا پورا ہو گا۔ چنانچہ اس کے مطابق آپ صلی اللہ علیہ وسلم اگلے سال مکہ معظمہ میں داخل ہوئے اور امن و اطمینان کے ساتھ عمرہ ادا کرکے واپس آئے۔ حقیقت یہ ہے کہ خود خواب میں اس کے پورا ہونے کا وقت نہیں بتایا گیا تھا، جب کہ خواب کی تعبیر بعض اوقات کئی سال بعد جا کر ظاہر ہوتی ہے، جیسا کہ یوسف علیہ السلام نے خواب دیکھنے کے کئی سال بعد والدین اور بھائیوں کے مصر میں آنے پر کہا: « يٰۤاَبَتِ هٰذَا تَاْوِيْلُ رُءْيَايَ مِنْ قَبْلُ قَدْ جَعَلَهَا رَبِّيْ حَقًّا » [ یوسف : ۱۰۰ ] ’’اے میرے باپ! یہ میرے پہلے کے خواب کی تعبیر ہے، بے شک میرے رب نے اسے سچا کر دیا۔‘‘ یہاں بعض مسلمانوں نے اپنے طور پر سمجھ لیا تھا کہ اسی سال مکہ معظمہ میں داخلہ ہو گا۔ چنانچہ صحیح بخاری کی ایک لمبی حدیث میں ہے کہ جب صلح طے ہو چکی، تو عمر بن خطاب رضی اللہ عنہ کہتے ہیں: [ فَأَتَيْتُ نَبِيَّ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ أَلَسْتَ نَبِيَّ اللّٰهِ حَقًّا؟ قَالَ بَلٰی، قُلْتُ أَلَسْنَا عَلَی الْحَقِّ وَعَدُوُّنَا عَلَی الْبَاطِلِ؟ قَالَ بَلٰی، قُلْتُ فَلِمَ نُعْطَی الدَّنِيَّةَ فِيْ دِيْنِنَا إِذًا؟ قَالَ إِنِّيْ رَسُوْلُ اللّٰهِ، وَلَسْتُ أَعْصِيْهِ ووَهُوَ نَاصِرِيْ، قُلْتُ أَوَ لَيْسَ كُنْتَ تُحَدِّثُنَا أَنَّا سَنَأْتِي الْبَيْتَ فَنَطُوْفُ بِهٖ؟ قَالَ بَلٰی، فَأَخْبَرْتُكَ أَنَّا نَأْتِيْهِ الْعَامَ؟ قَالَ قُلْتُ لاَ، قَالَ فَإِنَّككَ آتِيْهِ وَمُطَّوِّفٌ بِهٖ، قَالَ فَأَتَيْتُ أَبَا بَكْرٍ فَقُلْتُ يَا أَبَا بَكْرٍ! أَلَيْسَ هٰذَا نَبِيَّ اللّٰهِ حَقًّا ؟ قَاللَ بَلٰی، قُلْتُ أَلَسْنَا عَلَی الْحَقِّ وَعَدُوُّنَا عَلَی الْبَاطِلِ ؟ قَالَ بَلٰی قُلْتُ فَلِمَ نُعْطَی الدَّنِيَّةَ فِيْ دِيْنِنَا إِذًا ؟ قَالَ أَيُّهَا الرَّجُلُ! إِنَّهُ لَرَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَلَيْسَ يَعْصِيْ رَبَّهُ وَهُوَ ننَاصِرُهُ ، فَاسْتَمْسِكْ بِغَرْزِهِ، فَوَاللّٰهِ ! إِنَّهُ عَلَی الْحَقِّ، قُلْتُ أَلَيْسَ كَانَ يُحَدِّثُنَا أَنَّا سَنَأْتِي الْبَيْتَ وَنَطُوْفُ بِهٖ ؟ قَالَ بَلٰی، أَفَأَخْبَرَكَ أَنَّكَ تَأْتِيْهِ الْعَامَ؟ قُلْتُ لاَ، قَالَ فَإِنَّكَ آتِيْهِ وَمُطَّوِّفٌ بِهٖ، قَالَ الزُّهْرِيُّ قَالَ عُمَرُ فَعَمِلْتُ لِذٰلِكَ أَعْمَالاً ] [بخاري، الشروط، باب الشروط في الجہاد… : ۲۷۳۱،۲۷۳۲ ] ’’تو میں نبی صلی اللہ علیہ وسلم کے پاس آیا، میں نے کہا، کیا آپ اللہ کے سچے نبی نہیں ہیں؟‘‘ آپ نے فرمایا : ’’کیوں نہیں!‘‘ میں نے کہا : ’’کیا ہم حق پر اور ہمارے دشمن باطل پر نہیں؟‘‘ فرمایا : ’’کیوں نہیں!‘‘ میں نے کہا: ’’تو ایسے میں ہمیں اپنے دین میں ذلت کی بات کیوں قبول کروائی جاتی ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یقینا میں اللہ کا رسول ہوں اور میں اس کی نافرمانی نہیں کرتا اور وہ میری مدد کرنے والا ہے۔‘‘ میں نےنے کہا : ’’کیا آپ ہمیں بیان نہیں کیا کرتے تھے کہ ہم بیت اللہ میں جائیں گے اور اس کا طواف کریں گے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’تو کیا میں نے تمھیں یہ بتایا تھا کہ ہم اسی سال اس میں جائیں گے؟‘‘ میں نے کہا : ’’نہیں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تم یقینا اس میں جانے والے اور اس کا طواف کرنے والے ہو۔‘‘ عمر رضی اللہ عنہ نے کہا، پھر میں ابوبکر رضی اللہ عنہ کے پاس گیا، میں نے کہا : ’’اے ابوبکر! کیا یہ اللہ کے سچے نبی نہیں ہیں؟‘‘ انھوں نے کہا : ’’کیوں نہیں!‘‘ میں نے کہا: ’’کیا ہم حق پر اور ہمارے دشمن باطل پر نہیں؟‘‘ کہا : ’’کیوں نہیں!‘‘ میں نے کہا : ’’تو پھر ہمیں اپنے دین میں ذلت کی بات کیوں قبول کروائی جاتی ہے؟‘‘ انھوں نے کہا : ’’اے (اللہ کے) بندے! آپ صلی اللہ علیہ وسلم یقینا اللہ کے رسول ہیں اور آپ اپنے رب کی نافرمانی نہیں کرتے اور وہ آپ کی مدد کرنے والا ہے، اس لیے آپ صلی اللہ علیہ وسلم کی رکاب کو مضبوطی سے تھامے رکھو۔‘‘ میں نے کہا: ’’کیا آپ ہمیں بیان نہیں کیا کرتے تھے کہ ہم بیت اللہ میں جائیں گے اور اس کا طواف کریں گے؟‘‘ انھوں نے کہا : ’’تو کیا آپ صلی اللہ علیہ وسلم نے تمھیں بتایا تھا کہ تم اسی سال وہاں جاؤ گے؟‘‘ میں نے کہا : ’’نہیں!‘‘ انھوں نے کہا : ’’تو تم یقینا اس میں جاؤ گے اور اس کا طواف کرو گے۔‘‘ زہری کہتے ہیں کہ عمر رضی اللہ عنہ نے کہا : ’’پھر میں نے اس (جلد بازی کے کفارے) کے لیے کئی اعمال کیے۔‘‘ ¤ صحیح بخاری میں ایک اور جگہ سہل بن حنیف رضی اللہ عنہ سے عمر رضی اللہ عنہ کی رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کے ساتھ یہ گفتگو اور ان کا یہی جواب مروی ہے، اس کے آخر میں ہے : [ فَنَزَلَتْ سُوْرَةُ الْفَتْحِ فَقَرَأَهَا رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ عَلٰی عُمَرَ إِلٰی آخِرِهَا، فَقَالَ عُمَرُ يَا رَسُوْلَ اللّٰهِ ! أَوَ فَتْحٌ هُوَ؟ قَالَ نَعَمْ ] [بخاري، الجزیۃ والموادعۃ، باب إثم من عاھد ثم غدر : ۳۱۸۲ ] ’’اس موقع پر سورۂ فتح اتری تو رسول اللہ صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ کو یہ سورت آخر تک پڑھ کر سنائی۔ عمر رضی اللہ عنہ نے کہا : ’’اے اللہ کے رسول! کیا یہ فتح ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہاں (یہ فتح ہے)۔‘‘ ¤ ➌ { اِنْ شَآءَ اللّٰهُ:} یہاں ایک مشہور سوال ہے کہ ’’ان شاء الله ‘‘ تو استثنا کے لیے کہا جاتا ہے کہ اگر اللہ نے چاہا تو یہ کام ہو جائے گا ورنہ نہیں، حتیٰ کہ قسم کے بعد اگر ’’ان شاء الله ‘‘ کہہ لیا جائے تو قسم بھی واقع نہیں ہوتی، کیونکہ اس میں جزم اور پختگی نہیں ہوتی، جبکہ اللہ تعالیٰ کے کلام میں شک یا استثنا کا سوال ہی پیدا نہیں ہوتا تو یہاں {’’ اِنْ شَآءَ اللّٰهُ ‘‘} کہنے کا کیا مطلب ہے؟ اہلِ علم نے اس کے کئی جواب دیے ہیں۔ ابن کثیر رحمہ اللہ نے فرمایا : ’’یہ {’’ اِنْ شَآءَ اللّٰهُ ‘‘} اس خبر کی تاکید اور اس کا یقین دلانے کے لیے ہے، استثنا کے لیے کسی طرح بھی نہیں۔‘‘ (ابن کثیر) ابن تیمیہ رحمہ اللہ نے تاتاریوں کے مقابلے پر مسلمانوں کو ان کی فتح کا یقین دلاتے ہوئے اللہ کی قسم کھائی اور ان شاء اللہ کہا، ساتھ ہی فرمایا: {’’إِنْ شَاءَ اللّٰهُ تَحْقِيْقًا لَا تَعْلِيْقًا۔‘‘} ابن عاشور نے فرمایا: {’’إِنْ شَآءَ اللّٰهُ‘‘} کا ایک استعمال یہ ہے کہ یہ کسی چیز کے متعلق اس وقت بولا جاتا ہے جب وہ آئندہ دیر سے واقع ہونے والی ہو، جیسے کسی سے کہا جائے کہ یہ کام کر دو تو وہ کہے، میں ’’ان شاء الله ‘‘ یہ کام کر دوں گا۔ تو اس سے یہ نہیں سمجھا جاتا کہ وہ اس کام کو ابھی یا مستقبل قریب میں کرے گا بلکہ یہ سمجھا جاتا ہے کہ وہ اسے کچھ مدت بعد کرے گا، لیکن کرے گا ضرور۔‘‘ ¤ ابن جزی صاحب التسہیل کی بیان کردہ توجیہوں میں سے تین توجیہیں یہ ہیں، ایک یہ کہ یہ اللہ تعالیٰ کی طرف سے بندوں کو ادب سکھانے کے لیے ہے کہ وہ اپنے آئندہ ہر کام کے لیے ’’ان شاء اللہ ‘‘کہا کریں۔ (جیسا کہ سورۂ کہف (24،23) میں فرمایا : «وَ لَا تَقُوْلَنَّ لِشَايْءٍ اِنِّيْ فَاعِلٌ ذٰلِكَ غَدًا (23) اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ» ) دوسری یہ کہ یہ استثنا ہر انسان کو الگ الگ پیشِ نظر رکھ کر کیا گیا ہے، کیونکہ ممکن ہے ان میں سے کوئی شخص اس داخلے سے پہلے فوت ہو جائے، یا بیمار ہونے کی وجہ سے نہ جا سکے۔ تیسری یہ کہ یہاں {’’ اِنْ شَآءَ اللّٰهُ ‘‘ ’’إِذَا شَاءَ اللّٰهُ‘‘} کے معنی میں ہے کہ یقینا تم مسجد حرام میں داخل ہو گے جب اللہ چاہے گا۔ آلوسی نے اس کی ایک مثال {’’ إِنَّا إِنْ شَاءَ اللّٰهُ بِكُمْ لَلَاحِقُوْنَ ‘‘} دی ہے۔ یہ تمام جواب ہی درست، پختہ اور مضبوط ہیں۔ ¤ ➍ { اٰمِنِيْنَ مُحَلِّقِيْنَ:} حج اور عمرہ میں احرام کھولنے پر سر منڈوایا یا کترایا جاتا ہے۔ {’’ مُحَلِّقِيْنَ ‘‘} کو پہلے لانے میں اس کے افضل ہونے کی طرف اشارہ ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے سر منڈوانے والوں کے حق میں تین دفعہ دعا کی اور کتروانے والوں کے حق میں ایک دفعہ دعا کی۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَللّٰهُمَّ اغْفِرْ لِلْمُحَلِّقِيْنَ، قَالُوْا وَلِلْمُقَصِّرِيْنَ، قَالَ اللّٰهُمَّ اغْفِرْ لِلْمُحَلِّقِيْنَ … قَالَهَا ثَلاَثًا قَالَ وَ لِلْمُقَصِّرِيْنَ ] [ بخاري، الحج، باب الحلق والتقصیر عند الإحلال: ۱۷۲۸ ] ’’اے اللہ ! منڈوانے والوں کو بخش دے۔‘‘ صحابہ نے کہا: ’’اور کتروانے والوں کو بھی۔‘‘ آپ نے فرمایا : ’’اے اللہ ! منڈوانے والوں کو بخش دے۔‘‘ آپ صلی اللہ علیہ وسلم نے (صحابہ کے بار بار سوال پر) تین دفعہ پہلی دعا ہی کی، پھر فرمایا : ’’اور کتروانے والوں کو بھی بخش دے۔‘‘ ¤ ➎ { مُحَلِّقِيْنَ رُءُوْسَكُمْ وَ مُقَصِّرِيْنَ:} اپنے سروں کو منڈوانے والے اور کتروانے والے۔ {’’ رُءُوْسَكُمْ ‘‘} کا لفظ دلیل ہے کہ سر کو منڈوانا یا کتروانا ہے، ڈاڑھی کو نہیں۔ ¤ ➏ { لَا تَخَافُوْنَ:} یہاں ایک سوال ہے کہ {’’ اٰمِنِيْنَ ‘‘} ان لوگوں کو کہتے ہیں جنھیں کوئی خوف نہ ہو، پھر {’’ لَا تَخَافُوْنَ ‘‘} دوبارہ لانے کی کیا ضرورت تھی؟ جواب یہ ہے کہ {’’ اٰمِنِيْنَ ‘‘ ’’ لَتَدْخُلُنَّ ‘‘} کی ضمیر سے حال ہے، یعنی تم داخلے کے وقت امن کی حالت میں ہو گے اور {’’ لَا تَخَافُوْنَ ‘‘} آئندہ کے لیے وعدہ ہے کہ آئندہ بھی تمھیں دشمن کے حملے یا اس کی کسی سازش کا خوف نہیں ہو گا۔ ¤ ➐ { فَعَلِمَ مَا لَمْ تَعْلَمُوْا:} یعنی اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو خواب میں جو دکھایا تھا کہ تم ضرور مسجد حرام میں داخل ہو گے وغیرہ وہ بالکل سچ فرمایا تھا۔ تمھارے خیال میں یہ داخلہ اسی سال ہونا چاہیے تھا، مگر اُسے تمھارے اس سال مکہ میں داخل نہ ہونے میں وہ حکمتیں معلوم تھیں جو تم نہیں جانتے تھے۔ ان حکمتوں سے مراد کچھ وہ حکمتیں ہیں جن کا پیچھے ذکر ہوا، مثلاً صلح کی بدولت بے شمار لوگوں کا مسلمان ہونا، مکہ میں موجود ان مومن مردوں اور مومن عورتوں کو نقصان سے محفوظ رکھنا، جن کا مسلمانوں کو علم نہیں تھا، مکہ میں داخلے سے پہلے پہلے فتوحات اور غنائم کے ذریعے سے مسلمانوں کی مالی اور عددی حالت کو مستحکم کرنا وغیرہ اور کچھ وہ حکمتیں مراد ہیں جنھیں علیم و حکیم ہی جانتا ہے۔ ¤ ➑ { فَجَعَلَ مِنْ دُوْنِ ذٰلِكَ فَتْحًا قَرِيْبًا:} تو اس نے تمھارے مکہ میں داخل ہونے اور بیت اللہ کا طواف کرنے سے پہلے ایک قریب فتح رکھ دی۔ اس فتح قریب سے مراد بعض نے فتح خیبر لی ہے اور بعض نے صلح حدیبیہ۔ زیادہ درست یہی ہے کہ مراد صلح حدیبیہ ہے، کیونکہ عمر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا : [ يَا رَسُوْلَ اللّٰهِ! أَوَ فَتْحٌ هُوَ؟ ] ’’یا رسول اللہ! کیا وہ فتح ہے؟‘‘ تو آپ صلی اللہ  علیہ وسلم نے فرمایا : [ نَعَمْ ] ’’ہاں!‘‘ [مسلم، الجہاد و السیر، باب صلح الحدیبیۃ: ۱۷۸۵] جیسا کہ اس سے پہلے گزر چکا ہے اور {’’ اِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا ‘‘} سے مراد بھی یہی ہے۔ دونوں بھی مراد ہو سکتی ہیں، البتہ فتح مکہ مراد نہیں ہو سکتی، کیونکہ مکہ میں داخلہ اس فتح سے پہلے بھی ہونے والا تھا۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) {هُوَ الَّذِيْۤ اَرْسَلَ رَسُوْلَهٗ بِالْهُدٰى … :} اس سے پہلی آیت : « لَقَدْ صَدَقَ اللّٰهُ رَسُوْلَهُ الرُّءْيَا بِالْحَقِّ» اور یہ آیتت : « هُوَ الَّذِيْۤ اَرْسَلَ رَسُوْلَهٗ بِالْهُدٰى وَ دِيْنِ الْحَقِّ» دونوں آیتوں میں{’’ رَسُوْلَهٗ ‘‘} کا لفظ واضح کر رہا ہے کہ یہی نہیں کہ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو مسجد حرام میں امن و اطمینان کے ساتھ داخل ہونے کا خواب سچا دکھایا ہے، بلکہ اس نے اپنے رسول کو ہدایت اور دین حق دے کر بھیجا ہی اس لیے ہے کہ وہ صرف مکہ نہیں بلکہ اس دین کو پوری زمین پر اور صرف جزیرئہ عرب کے ادیان یہودیت، نصرانیت اور بت پرستی پر نہیں بلکہ دنیا کے تمام دینوں پر غالب کر دے اور یقینا آپ امن و اطمینان کے ساتھ مسجد حرام میں داخل ہوں گے، مکہ اور جزیرۂ عرب فتح ہو گا، پھر زمین کے مشرق و مغرب پر اللہ کا یہ دین چھا جائے گا۔ تفسیر قاسمی میں ہے، ابنِ تیمیہ نے فرمایا : ’’بلاشبہ اللہ تعالیٰ نے اس دین کو علم، حجت اور بیان کے ساتھ ہر دین پر غالب فرما دیا، جیسا کہ اسے قوت، نصرت اور تائید کے ساتھ غالب فرمایا اور پوری زمین اس دین سے اور آپ صلی اللہ علیہ وسلم کی امت سے مشرق و مغرب تک بھر گئی۔ اہلِ اسلام کی سلطنت دائمی ہے، کوئی اسے اس طرح ختم نہیں کر سکتا جس طرح یہود کی سلطنت ختم ہو گئی اور ان کے بعد کتنی ہی قوموں کا اقتدار زمین کے بہترین علاقوں سے مٹ گیا۔‘‘ یہ آیت اس سے پہلے سورۂ توبہ (۳۳) میں گزر چکی ہے، وہاں اس کی تفسیر ملاحظہ فرمائیں۔ تیسری بار سورۂ صف (۹) میں آئے گی۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ {مُحَمَّدٌ رَّسُوْلُ اللّٰهِ:} ابن کثیر رحمہ اللہ نے فرمایا : ’’ لفظ {’’ مُحَمَّدٌ ‘‘} مبتدا اور {’’ رَسُوْلُ اللّٰهِ ‘‘} خبر ہے۔ محمد صلی اللہ علیہ وسلم کو ’’رسول اللہ‘‘ کہنے کے بعد اور کسی تعریف کی ضرورت نہیں سمجھی، کیونکہ اس میں تمام انسانی کمال اور خوبیاں آ جاتی ہیں۔ اس لیے آگے {’’ وَ الَّذِيْنَ مَعَهٗۤ ‘‘} کی صفت بیان فرمائی ہے۔‘‘ اس مقام پر اس جملے سے کئی باتیں واضح ہو رہی ہیں، ایک یہ کہ قرآن مجید میں عموماً آپ صلی اللہ علیہ وسلم سے خطاب یا آپ کا ذکرِ خیر آپ کے نام کے بجائے آپ کے القاب کے ساتھ ہوا ہے، مثلاً {’’ يٰۤاَيُّهَا النَّبِيُّ ‘‘، ’’ يٰۤاَيُّهَا الرَّسُوْلُ ‘‘، ’’ شَاهِدًا ‘‘، ’’ مُبَشِّرًا ‘‘، ’’ نَذِيْرًا ‘‘،’’ دَاعِيًا اِلَي اللّٰهِ ‘‘} اور{’’ سِرَاجًا مُّنِيْرًا ‘‘} وغیرہ۔ آپ صلی اللہ علیہ وسلم کا اسم گرامی ’’محمد‘‘ صرف چار جگہ آیا ہے، دیکھیے سورئہ آل عمران (۱۴۴)، احزاب (۴۰)، سورۂ محمد(۲) اور زیر تفسیر آیت۔ ان چاروں مقامات میں آپ کا نام لانے میں کوئی نہ کوئی حکمت ہے۔ یہاں حکمت یہ ہے کہ اس بات کا اعلان کر دیا جائے کہ اگر کفارِ مکہ نے حمیتِ جاہلیت میں آ کر اصرار کیا ہے کہ معاہدے میں ’’محمد رسول اللہ‘‘ نہ لکھو اوران کے اصرار پر صلح کی خاطر ’’محمد بن عبد اللہ بن عبدالمطلب‘‘ لکھ دیا گیا ہے تو اس کا یہ مطلب نہیں کہ آپ اللہ کے رسول نہیں، بلکہ حقیقت یہ ہے کہ ’’محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، کفار کے نہ ماننے سے حقیقت نہیں بدل سکتی۔ دوسرا مقصد اس سوال کا جواب دینا ہے کہ تمام ادیان پر یہ دین کیسے غالب ہو گا؟ فرمایا محمد صلی اللہ علیہ وسلم کا تمام دینوں پر غلبہ اپنے ذاتی کمال یا ذاتی جد و جہد کی وجہ سے نہیں ہو گا بلکہ اس لیے ہو گا کہ محمد صلی اللہ علیہ وسلم ’’رسول اللہ‘‘ ہیں، یعنی اللہ تعالیٰ کے بھیجے ہوئے ہیں، جنھیں اس نے بھیجا ہی اس دین کو تمام دینوں پر غالب کرنے کے لیے ہے، پھر اللہ کے بھیجے ہوئے کو غالب آنے سے کون روک سکتا ہے؟ ¤ ➋ { وَ الَّذِيْنَ مَعَهٗۤ:} اس میں ان پاکباز ہستیوں کا ذکر فرمایا جن کے ذریعے سے اللہ تعالیٰ اس ہدایت اور دین حق کو روئے زمین پر غالب کرنے والا تھا۔ {’’ وَ الَّذِيْنَ مَعَهٗۤ ‘‘} (وہ لوگ جو آپ کے ساتھ ہیں) اس لفظ میں تمام صحابہ کرام شامل ہیں،، خواہ انھیں آپ کے ساتھ رہنے کی لمبی مدت ملی ہو یا تھوڑی۔ حدیبیہ میں جو لوگ آپ کے ساتھ تھے وہ اس لفظ کا اوّلین مصداق ہیں۔ نبی کریم صلی اللہ علیہ وسلم کی صحبت ایسی اکسیر تھی کہ جس مومن کو حاصل ہو گئی اس کی طبیعت کا رنگ ہی بدل گیا۔ اللہ تعالیٰ نے انھیں شہادت اور جنت کا ایسا شوق عطا فرمایا، انھیں ایسی شجاعت بخشی اور ان میں ایسی برکت رکھی کہ جب وہ حملہ آور ہوتے تو دشمن چند لمحوں میں بھاگ کھڑا ہوتا، کسی لشکر میں ایک صحابی کی موجودگی اس کی فتح کی ضمانت سمجھی جاتی۔ ان سے ملنے والوں میں بھی یہی برکت تھی۔ ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَأْتِيْ زَمَانٌ يَغْزُوْ فِئَامٌ مِنَ النَّاسِ، فَيُقَالُ فِيْكُمْ مَنْ صَحِبَ النَّبِيَّ صَلَّی اللّٰهُ عَللَيْهِ وَسَلَّمَ؟ فَيُقَالُ نَعَمْ، فَيُفْتَحُ عَلَيْهِ، ثُمَّ يَأْتِيْ زَمَانٌ فَيُقَالُ فِيْكُمْ مَنْ صَحِبَ أَصْحَابَ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ؟ فَيُقَالُ نَععَمْ، فَيُفْتَحُ، ثُمَّ يَأْتِيْ زَمَانٌ فَيُقَالُ فِيْكُمْ مَنْ صَحِبَ صَاحِبَ أَصْحَابِ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ؟ فَييُقَالُ نَعَمْ، فَيُفْتَحُ ] [بخاري، الجھاد والسیر، باب من استعان بالضعفاء والصالحین في الحرب : ۲۸۹۷ ] ’’لوگوں پر ایک زمانہ آئے گا کہ لوگوں کی ایک جماعت جنگ کرے گی تو کہا جائے گا : ’’کیا تم میں کوئی شخص ہے جو رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رہا ہو؟‘‘ وہ کہیں گے : ’’ہاں!‘‘ تو انھیں فتح عطا کی جائے گی۔ پھر لوگوں پر ایک زمانہ آئے گا کہ لوگوں کی ایک جماعت جنگ کرے گی تو کہا جائے گا : ’’کیا تم میں کوئی ہے جو رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں کے ساتھ رہا ہو؟‘‘ وہ کہیں گے : ’’ہاں!‘‘ تو انھیں فتح عطا کی جائے گی۔ پھر لوگوں پر ایک زمانہ آئے گا کہ لوگوں کی ایک جماعت جنگ کرے گی تو کہا جائے گا : ’’کیا تم میں کوئی ہے جو اس کے ساتھ رہا ہو جو اصحاب رسول صلی اللہ علیہ وسلم کے ساتھ رہا ہو؟‘‘ وہ کہیں گے : ’’ہاں!‘‘ تو انھیں فتح عطا کی جائے گی۔‘‘ ¤ ➌ { وَ الَّذِيْنَ مَعَهٗۤ:} جیسا کہ پچھلے فائدے میں گزرا کہ {’’ وَ الَّذِيْنَ مَعَهٗۤ ‘‘} (وہ لوگ جو اس کے ساتھ ہیں) سے مراد سب سے پہلے وہ صحابہ ہیں جنھوں نے بیعتِ رضوان کی، پھر تمام صحابہ کرام رضی اللہ عنھم ہیں خواہ انھیں ایک لمحہ کے لیے آپ صلی اللہ علیہ وسلم کے ساتھ رہنے کا شرف حاصل ہوا ہو۔ مفسر بقاعی نے فرمایا : {’’ وَ الَّذِيْنَ مَعَهٗۤ ‘‘} میں وہ تمام مسلمان بھی شامل ہیں جنھیں احسان اور نیکی کے ساتھ آپ صلی اللہ علیہ وسلم کی اتباع کرنے کی وجہ سے آپ کے ساتھ ہونے کا شرف حاصل ہے۔‘‘ پچھلے فائدے میں مذکور حدیث سے مفسر بقاعی کی اس بات کی تائید ہوتی ہے اور قرآن مجید میں صاف الفاظ میں احسان اور نیکی کے ساتھ اتباع کرنے والوں کو سابقون اوّلون کے ساتھ اللہ تعالیٰ کی رضا اور جنت میں داخلے کی بشارت دی ہے۔ مزید وضاحت کے لیے سورۂ توبہ کی آیت (۱۰۰) : « وَ السّٰبِقُوْنَ الْاَوَّلُوْنَ مِنَ الْمُهٰجِرِيْنَ وَ الْاَنْصَارِ وَ الَّذِيْنَ اتَّبَعُوْهُمْ بِاِحْسَانٍ رَّضِيَ اللّٰهُ عَنْهُمْ وَ رَضُوْا عَنْهُ » کی تفسیر پر نظر ڈال لیں۔ زیر تفسیر آیت میں کھیتی کی مثال صحابہ کے ساتھ قیامت تک ان کے پیروکاروں کو بھی ملانے سے پوری طرح مکمل ہوتی ہے۔ ¤ ➍ { اَشِدَّآءُ عَلَى الْكُفَّارِ رُحَمَآءُ بَيْنَهُمْ:} ان الفاظ میں صحابہ کرام اور امتِ مسلمہ کی تعریف فرمائی ہے کہ ان کا اللہ اور اس کے رسول پر ایسا ایمان ہے کہ ان کی دوستی اور دشمنی کے جذبات بھی ان کے ایمان کے تابع ہو گئے ہیں۔ کوئی کافر ہے تو وہ اس کے دشمن اور اس کے مقابلے میں نہایت سخت ہیں اور اگر کوئی مومن ہے تو وہ اس کے دلی دوست اور اس پر بے حد مہربان ہیں۔ اللہ تعالیٰ نے ہمارے نبی کریم صلی اللہ علیہ وسلم کو کفار پر سختی کرنے اور ان کے ساتھ جہاد کا حکم دیا، فرمایا: « يٰۤاَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَ الْمُنٰفِقِيْننَ وَ اغْلُظْ عَلَيْهِمْ وَ مَاْوٰىهُمْ جَهَنَّمُ » [ التوبۃ : ۷۳ ] ’’اے نبی! کافروں اور منافقوں سے جہاد کر اور ان پر سختی کر اور ان کا ٹھکانا جہنم ہے۔‘‘ اور مسلمانوں کو بھی یہی حکم دیا، فرمایا : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا قَاتِلُوا الَّذِيْنَ يَلُوْنَكُمْ مِّنَ الْكُفَّارِ وَ لْيَجِدُوْا فِيْكُمْ غِلْظَةً » [ التوبۃ : ۱۲۳ ] ’’اے لوگو جو ایمان لائے ہو! ان لوگوں سے لڑو جو کافروں میں سے تمھارے قریب ہیں اور لازم ہے کہ وہ تم میں کچھ سختی پائیں۔‘‘ اور اللہ تعالیٰ نے فیصلہ فرما دیا کہ ایمان والوں کا کفار کے ساتھ تعلق ان کے ایمان لانے تک ابدی عداوت و بغض کا ہے، خواہ وہ کفار ان کے باپ، بیٹے، بھائی یا قریبی رشتہ دار ہوں۔ دیکھیے سورۂ ممتحنہ کی پہلی چار آیات اور سورۂ مجادلہ کی آخری آیت۔ ¤ اس کے مقابلے میں ایمان والوں پر ہمارے نبی صلی اللہ علیہ وسلم بے حد مہربان اور شفیق تھے، جیسا کہ فرمایا: «لَقَدْ جَآءَكُمْ رَسُوْلٌ مِّنْ اَنْفُسِكُمْ عَزِيْزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيْصٌ عَلَيْكُمْ بِالْمُؤْمِنِيْنَ رَءُوْفٌ رَّحِيْمٌ » [ التوبۃ : ۱۲۸]’’بلاشبہ یقینا تمھارے پاس تمھی سے ایک رسول آیا ہے، اس پر بہت شاق ہے کہ تم مشقت میں پڑو، تم پر بہت حرص رکھنے والا ہے، مومنوں پر بہت شفقت کرنے والا، نہایت مہربان ہے۔‘‘ اور ایمان والوں کی صفت بھی یہی ہے، فرمایا: « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا مَنْ يَّرْتَدَّ مِنْكُمْ عَنْ دِيْنِهٖ فَسَوْفَ يَاْتِي اللّٰهُ بِقَوْمٍ يُّحِبُّهُمْ وَ يُحِبُّوْنَهٗۤ اَذِلَّةٍ عَلَى الْمُؤْمِنِيْنَ اَعِزَّةٍ عَلَى الْكٰفِرِيْنَ يُجَاهِدُوْنَ فِيْ سَبِيْلِ اللّٰهِ وَ لَا يَخَافُوْنَ لَوْمَةَ لَآىِٕمٍ ذٰلِكَ فَضْلُ اللّٰهِ يُؤْتِيْيْهِ مَنْ يَّشَآءُ وَ اللّٰهُ وَاسِعٌ عَلِيْمٌ » [ المائدۃ : ۵۴ ] ’’اے لوگو جو ایمان لائے ہو! تم میں سے جو کوئی اپنے دین سے پھر جائے تو اللہ عنقریب ایسے لوگ لائے گا کہ وہ ان سے محبت کرے گا اور وہ اس سے محبت کریں گے، مومنوں پر بہت نرم ہوں گے، کافروں پر بہت سخت، اللہ کے راستے میں جہاد کریں گے اور کسی ملامت کرنے والے کی ملامت سے نہیں ڈریں گے۔ یہ اللہ کا فضل ہے، وہ اسے دیتا ہے جس کو چاہتا ہے اور اللہ وسعت والا، سب کچھ جاننے والا ہے۔‘‘ نعمان بن بشیر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ تَرَی الْمُؤْمِنِيْنَ فِيْ تَرَاحُمِهِمْ وَتَوَادِّهِمْ وَتَعَاطُفِهِمْ كَمَثَلِ الْجَسَدِ إِذَا اشْتَكٰی عُضْوًا تَدَاعٰی لَهُ سَائِرُ جَسَدِهِ بِالسَّهَرِ وَالْحُمّٰی] [بخاري، الأدب، باب رحمۃ الناس والبہائم: ۶۰۱۱ ] ’’تو ایمان والوں کو ان کے ایک دوسرے پر رحم، ایک دوسرے سے دوستی اور ایک دوسرے پر شفقت میں ایک جسم کی طرح دیکھے گا، جب اس کا کوئی عضو بیمار ہوتا ہے تو سارا جسم اس کی وجہ سے بیداری اور بخار میں مبتلا ہو جاتا ہے۔‘‘ اور ابوموسیٰ اشعری رضی اللہ عنہ نے بیان فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا ] [ بخاري، المظالم، باب نصر المظلوم: ۲۴۴۶ ] ’’مومن مومن کے لیے ایک دیوار کی طرح ہے، جس کا ایک حصہ دوسرے حصے کو مضبوط کرتا ہے۔‘‘ ¤ ➎ واضح رہے کہ کافروں پر سخت ہونے کا یہ مطلب نہیں کہ وہ کبھی کسی کافر پر رحم نہیں کرتے، بلکہ مطلب یہ ہے کہ جس موقع پر اللہ اور اس کے رسول کا حکم کفار پر سختی کرنے کا ہوتا ہے وہاں ان کو رشتے ناتے یا دوستی وغیرہ کے علاقے اس کام میں مانع نہیں ہوتے اور جہاں تک ان کے ساتھ رحم و کرم کے معاملے کا تعلق ہے تو خود قرآن نے اس کا فیصلہ کر دیا ہے، فرمایا: « لَا يَنْهٰىكُمُ اللّٰهُ عَنِ الَّذِيْنَ لَمْ يُقَاتِلُوْكُمْ فِي الدِّيْنِ وَ لَمْ يُخْرِجُوْكُمْ مِّنْ دِيَارِكُمْ اَنْ تَبَرُّوْهُمْ وَ تُقْسِطُوْۤا اِلَيْهِمْ اِنَّ اللّٰهَ يُحِبُّ الْمُقْسِطِيْنَ (8) اِنَّمَا يَنْهٰىكُمُ اللّٰهُ عَنِ الَّذِيْنَ قٰتَلُوْكُمْ فِي الدِّيْنِ وَ اَخْرَجُوْكُمْ مِّنْ دِيَارِكُمْ وَ ظٰهَرُوْا عَلٰۤى اِخْرَاجِكُمْ اَنْ تَوَلَّوْهُمْ وَ مَنْ يَّتَوَلَّهُمْ فَاُولٰٓىِٕكَ هُمُ الظّٰللِمُوْنَ » [ الممتحنۃ : 9،8 ] ’’اللہ تمھیں ان لوگوں سے منع نہیں کرتا جنھوں نے نہ تم سے دین کے بارے میں جنگ کی اور نہ تمھیں تمھارے گھروں سے نکالا کہ تم ان سے نیک سلوک کرو اور ان کے حق میں انصاف کرو، یقینا اللہ انصاف کرنے والوں سے محبت کرتا ہے۔ اللہ تو تمھیں انھی لوگوں سے منع کرتا ہے جنھوں نے تم سے دین کے بارے میں جنگ کی اور تمھیں تمھارے گھروں سے نکالا اور تمھارے نکالنے میں ایک دوسرے کی مدد کی کہ تم ان سے دوستی کرو۔ اور جو ان سے دوستی کرے گا تو وہی لوگ ظالم ہیں۔‘‘ یعنی جو کفار مسلمانوں کے لیے باعث آزار اور ان کے ساتھ برسر جنگ نہیں ان کے ساتھ احسان اور حسن سلوک کرنے سے اللہ تعالیٰ منع نہیں کرتا۔ چنانچہ نبی صلی اللہ علیہ وسلم اور صحابہ کرام کے بے شمار واقعات ہیں جن میں ضعیف و مجبور یا ضرورت مند کفار کے ساتھ احسان و کرم کے معاملات کیے گئے ہیں۔ ان کے معاملہ میں عدل و انصاف کو برقرار رکھنا تو اسلام کا عام حکم ہے، عین میدان کار زار میں بھی عدل و انصاف کے خلاف کوئی کار روائی جائز نہیں۔ ¤ ➏ {تَرٰىهُمْ رُكَّعًا سُجَّدًا:} پچھلے جملے {’’ اَشِدَّآءُ عَلَى الْكُفَّارِ رُحَمَآءُ بَيْنَهُمْ ‘‘} میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں کا لوگوں کے ساتھ معاملہ ذکر فرمایا اور اس جملے میں ان کا اللہ کے ساتھ تعلق بیان فرمایا کہ تو انھیں رکوع کرتے ہوئے اور سجدہ کرتے ہوئے دیکھے گا۔ ان کے اکثر اوقات نماز کے مبارک عمل میں گزرتے ہیں جو آدمی کو اللہ تعالیٰ کے سب سے زیادہ قریب کرنے والا عمل ہے، کیونکہ ان کے نبی صلی اللہ علیہ وسلم نے فرمایا ہے: [ أَقْرَبُ مَا يَكُوْنُ الْعَبْدُ مِنْ رَّبِّهِ وَهُوَ سَاجِدٌ فَأَكْثِرُوا الدُّعَاءَ] [مسلم، الصلاۃ، باب ما یقال في  الرکوع والسجود؟ : ۴۸۲] ’’بندہ اپنے رب کے سب سے قریب اس وقت ہوتا ہے جب وہ سجدے میں ہوتا ہے۔ تو بہت زیادہ دعا کیا کرو۔‘‘ ان کے دل مسجد کے ساتھ ہی معلق ہوتے ہیں، روزانہ پانچ مرتبہ اللہ کے گھر میں آ کر یہ فریضہ سرانجام دیتے ہیں اور وہاں سے نکلتے ہیں تو دھیان ادھر ہی رہتا ہے، پھر رات کو بھی قیام کرتے ہیں۔ ¤ ➐ { يَبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَ رِضْوَانًا:} چونکہ رکوع و سجود ریا کے لیے بھی ہو سکتے ہیں اس لیے اس جملے میں صحمیں صحابہ کرام اور رسول اللہ صلی اللہ علیہ وسلم کے پیروکار ساتھیوں کے اخلاص کی شہادت دی ہے کہ ان کے رکوع و سجود ریا یا دکھلاوے کے لیے نہیں بلکہ اللہ تعالیٰ کی مزید نعمتوں اور اس کی رضا کی طلب کے لیے ہوتے ہیں۔ اس میں ان کی ہمت کی بلندی کا بھی بیان ہے کہ وہ اعلیٰ چیز کے طلب گار ہیں جس سے بڑی کوئی چیز نہیں، جیسا کہ فرمایا : « وَ رِضْوَانٌ مِّنَ اللّٰهِ اَكْبَرُ » [ التوبۃ : ۷۲ ]’’اور اللہ کی طرف سے تھوڑی سی خوشنودی و رضا سب سے بڑی چیز ہے۔‘‘ دنیائے دنی یا دوسری ادنیٰ چیزیں ان کی بلند نگاہ میں کوئی حیثیت ہی نہیں رکھتیں۔ ¤ ➑ { سِيْمَاهُمْ فِيْ وُجُوْهِهِمْ مِّنْ اَثَرِ السُّجُوْدِ:} بعض لوگوں نے سجدے کے اثر سے مراد پیشانی پر پڑنے والا گٹا لیا ہے، جسے عام طور پر محراب کہا جاتا ہے۔ کسی مخلص مسلمان کے ماتھے پر سجدے کی رگڑ سے پڑنے والا نشان بھی یقینا اس شناخت میں شامل ہے، مگر یہاں اس سے مراد وہ رونق اور حسن و شرافت کے آثار ہیں جو اخلاص، حسن نیت، خشیت و خشوع اور نماز کی کثرت سے چہرے پر نمایاں ہوتے ہیں۔ اگر دو آدمی رات بھر بیدار رہیں، ایک شراب نوشی اور گناہ کے کاموں میں مصروف رہے، دوسرا نماز یا قرآن کی تلاوت اور ذکر میں مصروف رہے تو صبح دونوں کے چہروں میں صاف فرق نظر آئے گا۔ یہی فرق سچے و جھوٹے، دغا باز و باوفا، ظالم و عادل، بدکار و پاک دامن اور متکبر و متواضع کے چہروں پر نمایاں ہوتا ہے۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل کیا ہے : [ {’’ سِيْمَاهُمْ فِيْ وُجُوْهِهِمْ ‘‘} يَعْنِي السَّمْتَ الْحَسَنَ ] [ طبری : ۳۱۸۹۱ ] ’’یعنی اس سے مراد خوب صورت انداز اور ہیئت ہے۔‘‘ ابن کثیر میں ہے، منصور نے مجاہد سے سنا کہ اس سے مراد خشوع ہے۔ منصور کہتے ہیں، میں نے کہا، میں تو اس سے مراد وہی نشان سمجھتا تھا جو چہرے پر پڑ جاتا ہے، تو انھوں نے فرمایا: ’’وہ نشان تو بعض اوقات ایسے لوگوں کے ماتھے پر بھی ہوتا ہے جو فرعون سے بھی زیادہ سنگ دل ہوتے ہیں۔‘‘ خلاصہ یہ کہ محمد رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں کے چہروں پر، صحابہ ہوں یا ان کے متبعین، خاص قسم کا نور اور رونق ہوتی ہے جس سے وہ دوسرے تمام لوگوں سے الگ پہچانے جاتے ہیں۔ یہاں بعض مفسرین نے ایک روایت رسول اللہ صلی اللہ علیہ وسلم کے حوالے سے نقل کی ہے : [ مَنْ كَثُرَ صَلَاتُهُ بِاللَّيْلِ حَسُنَ وَجْهُهُ بِالنَّهَارِ ] ’’جو شخص رات کو کثرت سے نماز پڑھے دن کو اس کا چہرہ خوبصورت ہو گا۔‘‘ مگر اہلِ علم کا اتفاق ہے کہ یہ بات رسول اللہ صلی اللہ علیہ وسلم سے ثابت نہیں، بلکہ یہ ایک راوی شریک کا قول ہے۔ ¤ ➒ { ذٰلِكَ مَثَلُهُمْ فِي التَّوْرٰىةِ: ’’مَثَلٌ‘‘} کا معنی مثال بھی ہوتا ہے اور وصف بھی، یہاں مراد وصف ہے، یعنی ان کا یہ وصف کہ سجدے اور عبادت کی تاثیر سے ان کی شناخت ان کے چہروں سے ظاہر ہوتی ہے، یہ تورات میں بیان ہوا ہے۔ اس وقت یہود و نصاریٰ کے ہاتھ میں جو تورات ہے اگرچہ انھوں نے اس میں کئی طرح کی تحریف کی ہے، رسول اللہ صلی اللہ علیہ وسلم اور آپ کی امت کی صفات اکثر حذف کر دی ہیں اور بعض میں تبدیلی کر دی ہے، اس کے باوجود اس کی پانچویں کتاب ’’استثنا‘‘ کے باب (۳۳) اور فقرہ (۲) میں ہے : ’’خداوند سینا سے آیا اور سعیر سے ان پر طلوع ہوا، فاران ہی کے پہاڑ سے وہ جلوہ گر ہوا، دس ہزار قدوسیوں کے ساتھ آیا اور اس کے داہنے ہاتھ میں ایک آتشیں شریعت ان کے لیے تھی۔‘‘ اس پیش گوئی کا مصداق رسول اللہ صلی اللہ علیہ وسلم کے سوا کوئی ہو ہی نہیں سکتا، کیونکہ اس میں جبل فاران سے جلوہ گر ہونے اور دس ہزار قدوسیوں کے ساتھ آنے کا صاف حوالہ موجود ہے اور یہ مسلّم بات ہے کہ فاران حجاز کے ایک پہاڑ کا نام ہے اور فتح مکہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم دس ہزار صحابہ کے ساتھ آئے تھے۔ ظاہر ہے قدوسیوں سے مراد اللہ تعالیٰ کے پاکیزہ صفات اور عبادت گزار بندے ہیں، قرآن مجید میں اس کی جگہ {’’ تَرٰىهُمْ رُكَّعًا سُجَّدًا يَّبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَ رِضْوَانًا سِيْمَاهُمْ فِيْ وُجُوْهِهِمْ مِّنْ اَثَرِ  السُّجُوْدِ ‘‘} کے الفاظ ہیں۔ اور آتشیں شریعت کے بجائے {’’ اَشِدَّآءُ عَلَى الْكُفَّارِ‘‘} کہہ کر جہادی شریعت کا ذکر فرمایا ہے۔ ¤ تنبیہ : ’’دس ہزار‘‘ کے الفاظ بائبل کے سابقہ ایڈیشنوں میں موجود ہیں، حالیہ ایڈیشنوں میں تحریف کر کے بعض سے یہ عدد نکال دیا گیا ہے اور بعض میں اسے ’’لاکھوں‘‘ میں تبدیل کر دیا گیا ہے۔ ¤ ➓ { وَ مَثَلُهُمْ فِي الْاِنْجِيْلِ كَزَرْعٍ اَخْرَجَ …:} تورات میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں کے تقویٰ و تقدس، جہادی شریعت اور ان کے غلبہ و اقتدار کی صفت بیان ہوئی ہے اور انجیل میں امتِ محمد صلی اللہ علیہ وسلم کے بتدریج قلت سے کثرت کی طرف اور کمزوری سے قوت کی طرف بڑھنے کو مثال کے ساتھ واضح فرمایا ہے کہ ان کی ابتدا اگرچہ کمزور ہو گی لیکن آخر کار وہ ایسے تناور درخت کی شکل اختیار کر جائیں گے جس کے سائے میں بڑی بڑی قومیں پناہ لیں گی۔ چنانچہ انجیل متی، باب (۱۳)، فقرہ (۳ تا ۹) میں یہ مثال اس طرح بیان ہوئی ہے : ’’اس (مسیح) نے ایک اور تمثیل ان کے سامنے پیش کرکے کہا کہ آسمان کی بادشاہت اس رائی کے دانے کی مانند ہے جسے کسی آدمی نے لے کر اپنے کھیت میں بو دیا، وہ سب بیجوں سے چھوٹا تو ہے لیکن جب بڑھ جاتا ہے تو سب ترکاریوں سے بڑا ہوتا ہے اور ایسا درخت ہو جاتا ہے کہ ہوا کے پرندے اس کی ڈالیوں پر بسیرا کرتے ہیں۔‘‘ یہی مثال الفاظ کی معمولی تبدیلی کے ساتھ انجیل مرقس، باب (۴)، فقرہ (۳۔۹) اور انجیل لوقا، باب (۱۳)، فقرہ (۱۸۔ ۲۱) میں بھی آئی ہے۔ (منقول از تفسیر ثنائی) ¤ قرآن مجید میں کھیتی کی مثال دینے کا مطلب یہ ہے کہ اگر حدیبیہ والے سال تم مکہ میں داخل نہیں ہو سکے تو اس میں بہت سی حکمتیں پوشیدہ ہیں اور تمھیں یہ سبق سکھانا بھی مقصود ہے کہ اسلام کا عروج و کمال یک لخت نہیں بلکہ تدریج کے ساتھ ہو گا، جیسا کہ کھیتی بتدریج کمال کو پہنچتی ہے۔ پہلے وہ بیج سے نازک سی کونپل یا سوئی نکالتی ہے، پھر اسے مضبوط کرتی ہے، پھر خوب موٹی ہو جاتی ہے، پھر اس کا پودا اپنے تنے پر سیدھا کھڑا ہو جاتا ہے، پھر اس کے ساتھ اور پودے اگتے چلے جاتے ہیں اور کھیت بھر جاتا ہے جس سے کاشت کرنے والوں کا دل خوش ہو جاتا ہے۔ اسی طرح ایک دن آنے والا ہے کہ ہدایت اور دین حق کی یہ کھیتی جو اوّل اوّل سر زمین عرب میں کاشت کی گئی، اپنے کمال کو پہنچے گی، مشرق و مغرب اس سے بھر جائیں گے، اپنی آبیاری اور دیکھ بھال کرنے والوں کے دلوں کو خوش کرے گی اور ان لوگوں کے دلوں کو غم و غصہ سے جلائے گی جنھوں نے اس کی نشوونما کو روکنے کے لیے ایڑی چوٹی کا زور لگایا۔ ¤ ⓫ { لِيَغِيْظَ بِهِمُ الْكُفَّارَ: ’’ لِيَغِيْظَ ‘‘} کا لام فعل مقدر کے متعلق ہے جو گزشتہ عبارت سے خود بخود سمجھ میں آ رہا ہے : {’’ أَيْ جَعَلَهُمُ اللّٰهُ كَذٰلِكَ لِيَغِيْظَ بِهِمُ الْكُفَّارَ‘‘} یعنی اللہ تعالیٰ صحابہ کرام اور ان کے متبعین کو اس طرح بتدریج کمال و عروج تک پہنچائے گا، تاکہ ان کے ساتھ کفار کو غصہ دلائے اور ان کے دلوں کو جلائے۔ تاریخ شاہد ہے کہ رسول اللہ صلی اللہ علیہ وسلم جو دعوتِ حق لے کر آئے اسے قبول کرنے والے اور اسے پوری دنیا پر غالب کرنے کے لیے اپنی جان، اپنا مال اور سب کچھ قربان کرنے والے صحابہ کرام تھے اور ان کے بعد ان سے محبت رکھنے والے اور ان کے نقشِ قدم پر چلنے والے تابعین اور بعد کے لوگ تھے جن کے ذریعے سے یہ دین حق ساری دنیا میں پھیلا اور غالب ہوا۔ ایمان والوں کے دل صحابہ کرام اور ان کے متبعین کے حالات دیکھ کر اور سن کر خوش ہوتے ہیں اور کفار کے دل انھیں دیکھ کر اور ان کے حالات سن کر غصے سے بھر جاتے ہیں اور جل اٹھتے ہیں۔ تفسیر التحریر والتنویر (۲۶؍۱۷۷) میں ہے کہ امام مالک رحمہ اللہ نے فرمایا : [ مَنْ أَصْبَحَ مِنَ النَّاسِ فِيْ قَلْبِهِ غَيْظٌ عَلٰی أَحَدٍ مِّنْ أَصْحَابِ رَسُوْلِ اللّٰهِ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقَدْ أَصَابَتْهُ هٰذِهِ الْآيَةُ ] ’’لوگوں ممیں سے جس شخص کے دل میں اصحاب رسول صلی اللہ علیہ وسلم میں سے کسی ایک پر بھی غصہ اور جلن ہو، یہ آیت اس پر یقینا لاگو ہوتی ہے۔‘‘ ابنِ عاشور نے فرمایا : ’’اللہ تعالیٰ امام مالک پر رحم کرے، ان کا استنباط کس قدر باریک ہے۔ ‘‘ ¤ ⓬ {وَعَدَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ مِنْهُمْ …:} شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اور کھیتی کی کہاوت یہ کہ اوّل ایک آدمی تھا اس دین پر، پھر دو ہوئے پھر قوت بڑھتی گئی حضرت صلی اللہ علیہ وسلم کے وقت اور خلیفوں کے اور یہ وعدہ دیا ان کو جو ایمان لائے اور بھلے کام کرتے ہیں۔ حضرت صلی اللہ علیہ وسلم کے سب اصحاب ایسے ہی تھے، مگر خاتمہ کا اندیشہ رکھا۔ حق تعالیٰ بندوں کو ایسی خوش خبری نہیں دیتا کہ نڈر ہو جائیں، مالک سے اتنی شاباش بھی غنیمت ہے۔‘‘"
    }
  ]
}