{
  "surah": "Al-Hujuraat",
  "surah_number": 49,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا:} رازی نے فرمایا : ’’اس سورت میں اللہ تعالیٰ نے ایمان والوں کو مکارمِ اخلاق کا سبق دیا ہے، ان کا تعلق یا تو اللہ تعالیٰ کے ساتھ معاملے میں ہو گا یا اس کے رسول کے ساتھ یا فاسق لوگوں کے ساتھ یا ان ایمان والوں کے ساتھ جو حاضر ہوں یا ان ایمان والوں کے ساتھ جو غائب ہوں اور پانچوں قسموں میں سے ہر ایک کی ابتدا {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا ‘‘} کے ساتھ کی ہے۔‘‘ ¤ ➋ {لَا تُقَدِّمُوْا بَيْنَ يَدَيِ اللّٰهِ وَ رَسُوْلِهٖ: ’’ لَا تُقَدِّمُوْا ‘‘} باب تفعیل ہے، جس کا مجرد {’’قَدَمَ يَقْدُمُ‘‘} (ن) آتا ہے، جس کا معنی ’’دوسرے کے آگے چلنا‘‘ ہے، جیسا کہ اللہ تعالیٰ نے فرعون کے متعلق فرمایا : «يَقْدُمُ قَوْمَهٗ يَوْمَ الْقِيٰمَةِ » [ ھود : ۹۸ ] ’’وہ قیامت کے دن اپنی قوم کے آگے ہو گا۔‘‘ {’’ تَقَدَّمَ يَتَقَدَّمُ ‘‘} (تفعّل) کا معنی بھی ’’آگے بڑھنا‘‘ ہے۔ باب تفعیل کے لحاظ سے اس کا معنی ’’آگے کرنا‘‘ ہو گا، یعنی اپنی کوئی بات یا کوئی فعل اللہ اور اس کے رسول سے آگے نہ کرو۔ بعض اوقات {’’قَدَّمَ‘‘ ’’تَقَدَّمَ‘‘} کے معنی میں بھی آ جاتا ہے، یعنی وہ آگے بڑھا، جیسے {’’ كَأَنَّهُ قَدَّمَ نَفْسَهُ ‘‘} ’’گویا اس نے اپنے آپ کو آگے بڑھا لیا۔‘‘ اس صورت میں آیت کا معنی ہو گا : ’’اللہ اور اس کے رسول سے آگے مت بڑھو۔‘‘ اور یہاں یہی معنی راجح ہے۔ اسی سے {’’مُقَدِّمَةُ الْجَيْشِ‘‘} (لشکر کا سب سے اگلا حصہ) ہے۔ باب تفعیل باب تفعّل کے معنی میں بھی استعمال ہوتا ہے، جیسے {’’وَجَّهَ أَيْ تَوَجَّهَ‘‘} اور {’’ بَيَّنَ أَيْ تَبَيَّنَ۔‘‘} آیت میں اس شخص کو جو اللہ اور اس کے رسول کی اجازت یا حکم کے بغیر کوئی کام یا بات کرتا ہے اس شخص کی حالت کے ساتھ تشبیہ دی ہے جو کسی دوسرے کو پیچھے چھوڑ کر اس سے آگے بڑھ جاتا ہے۔ (ابن عاشور) ¤ ➌ { ’’ لَا تُقَدِّمُوْا بَيْنَ يَدَيِ اللّٰهِ وَ رَسُوْلِهٖ ‘‘} میں اللہ اور اس کے رسول کو اکٹھا ذکر کرنے کا مطلب یہ ہے کہ رسول سے آگے بڑھنا درحقیقت اللہ تعالیٰ سے آگے بڑھنا ہے، کیونکہ رسول وہی کہتا اور کرتا ہے جس کی وحی اسے اللہ تعالیٰ کی طرف سے ہوتی ہے، فرمایا: «وَ مَا يَنْطِقُ عَنِ الْهَوٰى (3) اِنْ هُوَ اِلَّا وَحْيٌ يُّوْحٰى » [ النجم: ۳،۴ ]’’اور نہ وہ اپنی خواہش سے بولتا ہے۔ وہ تو صرف وحی ہے جو نازل کی جاتی ہے۔‘‘ ¤ ➍ اس آیت میں اللہ اور اس کے رسول پر ایمان لانے کا بنیادی تقاضا بیان کیا گیا ہے کہ جب تم اللہ کو اپنا رب اور رسول کو اپنا ہادی اور رہبر مانتے ہو تو پھر ان کے پیچھے چلو، آگے مت بڑھو! اپنے فیصلے خود ہی نہ کر لو، بلکہ پہلے یہ دیکھو کہ اللہ اور اس کے رسول کا حکم کیا ہے۔ یہ حکم سورۂ احزاب میں موجود حکم سے بھی ایک قدم آگے ہے، فرمایا : «وَ مَا كَانَ لِمُؤْمِنٍ وَّ لَا مُؤْمِنَةٍ اِذَا قَضَى اللّٰهُ وَ رَسُوْلُهٗۤ اَمْرًا اَنْ يَّكُوْنَ لَهُمُ الْخِيَرَةُ مِنْ اَمْرِهِمْ وَ مَنْ يَّعْصِ اللّٰهَ وَ رَسُوْلَهٗ فَقَدْ ضَلَّ ضَلٰلًا مُّبِيْنًا » [ الأحزاب : ۳۶ ] ’’اور کبھی بھی نہ کسی مومن مرد کا حق ہے اور نہ کسی مومن عورت کا کہ جب اللہ اور اس کا رسول کسی معاملے کا فیصلہ کر دیں کہ ان کے لیے ان کے معاملے میں اختیار ہو اور جو کوئی اللہ اور اس کے رسول کی نافرمانی کرے سو یقینا وہ گمراہ ہوگیا، واضح گمراہ ہونا۔ ‘‘ یعنی سورۂ احزاب میں ہے کہ جب اللہ اور اس کا رسول کسی معاملے کا فیصلہ کر دیں تو کسی ایمان والے مرد یا ایمان والی عورت کو خود کوئی فیصلہ کرنے کا اختیار باقی نہیں رہتا اور یہاں فرمایا کہ ایمان والوں کو پہل کرتے ہوئے اپنے فیصلے خود نہیں کر لینے چاہییں، بلکہ پہلے یہ دیکھنا چاہیے کہ ان کے متعلق اللہ اور اس کے رسول کا حکم کیا ہے۔ یہ حکم مسلمانوں کے انفرادی معاملات میں بھی ہے اور اجتماعی معاملات میں بھی۔ کسی بھی شخص کو خواہ وہ کوئی عالم ہو یا امام یا پیر فقیر، یہ حق حاصل نہیں اور نہ ہی کسی جماعت یا پارلیمنٹ کا حق ہے کہ وہ اپنی طرف سے شریعت بنائے، کسی کام کو حلال یا حرام کہے، یا باعثِ ثواب یا گناہ قرار دے۔ اگر کوئی کسی کو یہ حق دیتا ہے تو وہ اسے اپنا رب بناتا ہے۔ مزید دیکھیے سورۂ توبہ کی آیت (۳۱) : « اِتَّخَذُوْۤا اَحْبَارَهُمْ وَ رُهْبَانَهُمْ اَرْبَابًا مِّنْ دُوْنِ اللّٰهِ » کی تفسیر۔ ¤ ➎ اللہ اور اس کے رسول سے آگے نہ بڑھنے کا مطلب یہ ہے کہ کتاب و سنت سے آگے مت بڑھو، ان کے پیچھے پیچھے چلو۔ چنانچہ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کی تفسیر نقل فرمائی ہے : [ « لَا تُقَدِّمُوْا بَيْنَ يَدَيِ اللّٰهِ وَ رَسُوْلِهٖ » يَقُوْلُ لَا تَقُقُوْلُوْا خِلاَفَ الْكِتَابِ وَالسُّنَّةِ ] [ طبري : ۳۱۹۲۷ ] یعنی اس آیت کا مطلب یہ ہے کہ کتاب و سنت کے خلاف کوئی بات نہ کہو۔ بعض مفسرین نے اس آیت کی شان نزول رمضان سے ایک دو دن پہلے روزہ رکھنا بیان کی ہے اور بعض نے عید الاضحی کی نماز سے پہلے قربانی کرنا۔ حقیقت یہ ہے کہ اس قسم کے تمام کام اس آیت کے مضمون میں شامل ہیں، البتہ یہ بات ثابت نہیں کہ یہ آیت خاص ان کے بارے میں اتری ہے۔ ¤ ➏ {وَ اتَّقُوا اللّٰهَ اِنَّ اللّٰهَ سَمِيْعٌ عَلِيْمٌ:’’ اِنَّ ‘‘} تعلیل یعنی پہلی بات کی وجہ بیان کرنے کے لیے ہوتا ہے۔ یعنی اللہ سے ڈرتے رہو، کیونکہ اللہ تعالیٰ ہر بات کو سننے والا اور ہر کام کو جاننے والا ہے، خواہ وہ سب کے سامنے کیا جائے یا چھپ کر، عمل میں آ چکا ہو یا دل میں اس کا ارادہ ہو، اگر تم اللہ اور اس کے رسول سے آگے بڑھو گے تو اُس سے تمھارا جرم چھپا نہیں رہے گا اور وہ تمھیں اس کی سزا دے گا۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَرْفَعُوْۤا اَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ:} آلوسی نے فرمایا کہ پچھلی آیت میں ایمان والوں کو اپنے قول یا فعل میں رسول اللہ صلی اللہ علیہ وسلم سے آگے بڑھنے سے منع فرمایا، اس آیت میں آپ کے سامنے بولنے کی کیفیت میں بھی آپ سے بڑھنے کو منع فرما دیا۔ چنانچہ فرمایا کہ آپ صلی اللہ علیہ وسلم کی موجودگی یا آپ کی مجلس میں ایک دوسرے سے بات کرتے ہوئے بھی اپنی آوازیں آپ صلی اللہ علیہ وسلم کی آواز سے اونچی نہ کریں۔ صحیح بخاری میں اس آیت کا سبب نزول بیان ہوا ہے، ابن ابی مُلیکہ فرماتے ہیں: [ كَادَ الْخَيِّرَانِ أَنْ يَهْلِكَا، أَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللّٰهُ عَنْهُمَا، رَفَعَا أَصْوَاتَهُمَا عِنْدَ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّممَ حِيْنَ قَدِمَ عَلَيْهِ رَكْبُ بَنِيْ تَمِيْمٍ، فَأَشَارَ أَححَدُهُمَا بِالْأَقْرَعِ بْنِ حَابِسٍ أَخِيْ بَنِيْ مُجَاشِعٍ وَأَشَارَ الْآخَرُ بِرَجُلٍ آخَرَ قَالَ نَافِعٌ لاَ أَحْفَظُ اسْمَهُ، فَقَالَ أَبُوْ بَكْرٍ لِعُمَرَ مَا أَرَدْتَ إِلاَّ خِلاَفِيْ ققَالَ مَا أَرَدْتُ خِلاَفَكَ، فَارْتَفَعَتْ أَصْوَاتُهُمَا فِيْ ذٰلِكَ فَأَنْزَلَ اللّٰهُ : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَرْفَعُوْۤا اَصْوَاتَكُمْ » اَلْآيَةَ، قَالَ ابْنُ الزُّبَيْرِ فَمَا كَانَ عُمَرُ يُسْمِعُ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ بَعْدَ هٰذِهِ الْآيَةِ حَتّٰی يَسْتَفْهِمَهُ ] [ بخاري، کتاب التفسیر، باب : «لا ترفعوا أصواتکم فوق صوت النبي » : ۴۸۴۵ ] ’’دو سب سے بہتر آدمی قریب تھے کہ ہلاک ہو جاتے، ابوبکر اور عمر رضی اللہ عنھما ، دوننوں نے اپنی آوازیں بلند کیں جب بنو تمیم کے شتر سوار آپ صلی اللہ علیہ وسلم کے پاس آئے۔ تو ان دونوں (بہترین آدمیوں) میں سے ایک نے بنی مجاشع کے اقرع بن حابس (کو بنو تمیم کا امیر مقرر کرنے) کا اشارہ کیا اور دوسرے نے ایک اور کا اشارہ کیا۔ نافع نے کہا، مجھے اس کا نام یاد نہیں۔ تو ابوبکر رضی اللہ عنہ نے عمر رضی اللہ عنہ سے کہا : ’’تم نے صرف میری مخالفت کا ارادہ کیا ہے۔‘‘ انھوں نے کہا : ’’میں نے آپ کی مخالفت کا ارادہ نہیں کیا۔‘‘ اس میں دونوں کی آوازیں بلند ہو گئیں تو اللہ تعالیٰ نے یہ آیت نازل فرمائی: « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَرْفَعُوْۤا اَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ » ’’اے لوگو جو ایمان لائے ہو! اپنی آوازیں نبی کی آواز کے اوپر بلند نہ کرو۔‘‘ ابن زبیر رضی اللہ عنھما نے فرمایا، پھر اس آیت کے بعد عمر رضی اللہ عنہ کی آواز رسول اللہ صلی اللہ علیہ وسلم کو سنائی نہیں دیتی تھی جب تک کہ آپ صلی اللہ علیہ وسلم ان سے دوبارہ پوچھتے نہیں تھے۔‘‘ ¤ ➋ کسی مجلس میں رسول اللہ صلی اللہ علیہ وسلم کی حدیث بیان ہو تو آپ صلی اللہ علیہ وسلم کے ادب کا تقاضا ہے کہ اس کے مقابلے میں کسی شخص کا قول ذکر نہ کیا جائے اور نہ اسے ردّ کرنے کے لیے کسی قسم کے عقلی ڈھکوسلے پیش کیے جائیں، کیونکہ یہ بھی آپ صلی اللہ علیہ وسلم کی آواز سے اپنی آواز کو اونچا کرنا ہے، بلکہ مخالفت کی وجہ سے یہ اس سے بھی سنگین بے ادبی ہے۔ ¤ ➌ بعض لوگوں کا معاملہ بڑا عجیب ہے کہ وہ لوگوں کو باور کرواتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ان کی مجلس میں موجود ہیں، پھر اتنی اونچی آواز سے بولتے ہیں کہ سننے والوں کے کانوں کے پردے پھٹنے کے قریب ہوتے ہیں، اس کے باوجود رسول اللہ صلی اللہ علیہ وسلم سے محبت کے واحد اجارہ دار بھی بنے ہوئے ہیں۔ حالانکہ نہ رسول اللہ صلی اللہ علیہ وسلم اب کسی مجلس میں موجود ہوتے یا تشریف لاتے ہیں اور نہ ہی آپ کو موجود سمجھتے ہوئے آپ کی محبت یا ادب میں اتنی بلند آواز کے ساتھ بولنے کی کوئی گنجائش ہے۔ ¤ ➍ { وَ لَا تَجْهَرُوْا لَهٗ بِالْقَوْلِ:} اللہ تعالیٰ نے ایمان والوں کو اس ادب کی تعلیم اس لیے دی کہ بعض اکھڑ اعرابی آپ سے اسی طرح اونچی آواز میں بات کرتے اور آپ کو اسی طرح نام لے کر خطاب کرتے جس طرح وہ ایک دوسرے کے ساتھ بات کرتے یا مخاطب کرتے تھے۔ چنانچہ فرمایا، اور نہ آپ صلی اللہ علیہ وسلم سے اس طرح اونچی آواز میں بات کرو جس طرح ایک دوسرے سے اونچی آواز میں بات کرتے ہو اور نہ ہی اس طرح آپ کو نام لے کر مخاطب کرو جس طرح ایک دوسرے کو مخاطب کرتے ہو، بلکہ ’’ اے محمد ‘‘کہنے کے بجائے ’’اے اللہ کے رسول‘‘ یا ’’اے اللہ کے نبی‘‘ وغیرہ کہا کرو۔ یہ ادب سورۂ نور میں بھی سکھایا گیا ہے، فرمایا : « لَا تَجْعَلُوْا دُعَآءَ الرَّسُوْلِ بَيْنَكُمْ كَدُعَآءِ بَعْضِكُمْ بَعْضًا » [ النور : ۶۳ ] ’’رسول کے بلانے کو اپنے درمیان اس طرح نہ بنالو جیسے تمھارے بعض کا بعض کو بلانا ہے۔‘‘ خود اللہ تعالیٰ نے پورے قرآن مجید میں کسی جگہ آپ صلی اللہ علیہ وسلم کو نام کے ساتھ مخاطب نہیں فرمایا، بلکہ مختلف القاب کے ساتھ ہی مخاطب فرمایا ہے، جیسے {’’ يٰۤاَيُّهَا الرَّسُوْلُ ‘‘، ’’ يٰۤاَيُّهَا النَّبِیُّ ‘‘، ’’ يٰۤاَيُّهَا الْمُزَّمِّلُ ‘‘} اور{’’ يٰۤاَيُّهَا الْمُدَّثِّرُ ‘‘} وغیرہ۔ حالانکہ دوسرے انبیاء کو نام لے کر خطاب فرمایا ہے، جیسے{’’ يٰۤاٰدَمُ ‘‘، ’’ يَا نُوْحُ ‘‘، ’’ يٰۤاِبْرٰهِيْمُ ‘‘، ’’ يَا مُوْسٰي ‘‘، ’’ يٰعِيْسَي ابْنَ مَرْيَمَ ‘‘} اور{’’ يٰۤدَاوٗدُ ‘‘} وغیرہ۔ اس کے باوجود اکثر جاہل ’’یا محمد‘‘ کہنے اور لکھنے پر اصرار کرتے ہیں اور دعویٰ آپ صلی اللہ علیہ وسلم سے محبت کا رکھتے ہیں۔ اس آیت سے آپ صلی اللہ علیہ وسلم کی توقیر و تعظیم کا اندازہ ہوتا ہے۔ ¤ ➎ { اَنْ تَحْبَطَ اَعْمَالُكُمْ وَ اَنْتُمْ لَا تَشْعُرُوْنَ:} اس سے معلوم ہوا کہ نبی صلی اللہ علیہ وسلم کی موجودگی میں آپ کی آواز سے آواز اونچی کرنا یا آپ سے ایسے لہجے میں بات کرنا جس سے آپ کی توقیر و تکریم میں فرق آتا ہو اعمال ضائع ہو جانے کا موجب ہے، خواہ یہ کام کوئی مومن ہی کیوں نہ کرے، کیونکہ ساتھ ہی فرمایا : «وَ اَنْتُمْ لَا تَشْعُرُوْنَ» ’’اور تم شعور نہ رکھتے ہو۔‘‘ منافقین تو ایمان سے خالی تھے، اس لیے وہ جان بوجھ کر آپ سے گستاخی کے ساتھ پیش آتے تھے اور انھیں اپنے اعمال کے ضائع ہونے کی کوئی فکر بھی نہیں تھی۔ اس آیت سے یہ بھی معلوم ہوا کہ بعض اعمال ایسے منحوس ہیں کہ وہ اعمال صالحہ کو بھی ضائع کرنے کا باعث بن جاتے ہیں، خصوصاً جن میں اللہ تعالیٰ یا رسول کریم صلی اللہ علیہ وسلم کی بے ادبی پائی جائے، کیونکہ وہ اللہ تعالیٰ کے غضب کا موجب ہوتے ہیں۔ ابن کثیر نے فرمایا : ’’ « اَنْ تَحْبَطَ اَعْمَالُكُمْ وَ اَنْتُمْ لَا تَشْعُرُوْنَ» یعنی ہم نے تمھیں آپ صلی اللہ علیہ وسلم کے پاس آواز بلند کرنے سے اس لیے منع کیا ہے کہ ایسا نہ ہو کہ اس کی وجہ سے آپ صلی اللہ علیہ وسلم غصے ہو جائیں تو آپ کے غصے کی وجہ سے اللہ تعالیٰ بھی غصے ہو جائے اور اس شخص کے اعمال برباد کر دے جس نے آپ کو غصہ دلایا اور اسے معلوم بھی نہ ہو، جیسا کہ صحیح حدیث ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ رِضْوَانِ اللّٰهِ لاَ يُلْقِيْ لَهَا بَالاً يَرْفَعُ اللّٰهُ  بِهَا دَرَجَاتٍ وَ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ سَخَطِ اللّٰهِ لاَ يُلْقِيْ لَهَا بَالاً يَهْوِيْ بِهَا فِيْ جَهَنَّمَ ] [ بخاري، الرقاق، باب حفظ اللسان : ۶۴۷۸ ] ’’بندہ اللہ کو راضی کرنے والی کوئی بات کرتا ہے، جس کا وہ کوئی دھیان نہیں کرتا، تو اللہ تعالیٰ اس کی وجہ سے اسے کئی درجے بلند کر دیتا ہے اور بندہ اللہ کو غصہ دلانے والی کوئی بات کرتا ہے، جس کا وہ کوئی دھیان نہیں کرتا، تو اس کی وجہ سے وہ جہنم میں گر جاتا ہے۔‘‘ ¤ ➏ اس آیت کے بعد صحابہ کرام رضی اللہ عنھم آپ صلی اللہ علیہ وسلم کے پاس آواز بلند کرنے سے کس قدر ڈرتے اور اس سے بچتے تھے اس کا اندازہ ایک تو عمر بن خطاب رضی اللہ عنہ کے عمل سے ہوتا ہے جس کا تذکرہ اسی آیت کی تفسیر کے پہلے فائدے میں ہوا ہے، اس کے علاوہ رسول اللہ صلی اللہ علیہ وسلم کے خطیب ثابت بن قیس رضی اللہ عنہ کا رویہ بھی اس کی ایک مثال ہے۔ انس بن مالک رضی اللہ عنہ فرماتے ہیں : ’’جب یہ آیت اتری : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَرْفَعُوْۤا اَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَ لَا تَجْهَرُوْا لَهٗ بِالْقَوْلِ كَجَهْرِ بَععْضِكُمْ لِبَعْضٍ اَنْ تَحْبَطَ اَعْمَالُكُمْ وَ اَنْتُمْ لَا تَشْعُرُوْنَ» اب ثابت بن قیس بن شماس رضی اللہ عنہ کی آواز بہت بلند تھی تو وہ کہنے لگے : ’’میں ہی اپنی آواز رسول اللہ صلی اللہ علیہ وسلم کی آواز سے بلند کیا کرتا تھا، میرا عمل تو ضائع ہو گیا، میں اہلِ نار سے ہوں۔‘‘ اور وہ غمگین ہو کر گھر میں بیٹھ گئے۔ رسول اللہ صلی اللہ علیہ وسلم نے انھیں نہ دیکھا تو ان کے بارے میں پوچھا۔ کچھ لوگ ان کے پاس گئے اور ان سے کہا : ’’رسول اللہ صلی اللہ علیہ وسلم تمھیں تلاش کر رہے تھے، تمھیں کیا ہوا؟‘‘ کہنے لگے : ’’میں ہی ہوں جو اپنی آواز نبی صلی اللہ علیہ وسلم کی آواز سے بلند کرتا تھا اور اونچی آواز سے بات کرتا تھا، میرا عمل ضائع ہو گیا اور میں اہلِ نار سے ہوں۔‘‘ لوگوں نے آ کر رسول اللہ صلی اللہ علیہ وسلم کو ان کی بات بتائی تو نبی صلی اللہ علیہ وسلم نے فرمایا : [ لاَ، بَلْ هُوَ مِنْ أَهْلِ الْجَنَّةِ ] ’’نہیں، بلکہ وہ اہلِ جنت سے ہے۔‘‘ انس رضی اللہ عنہ نے فرمایا : ’’پھر ہم انھیں اپنے درمیان چلتا پھرتا دیکھتے تھے اور جانتے تھے کہ وہ جنتی ہیں۔ تو جب یمامہ (مسیلمہ کذاب سے جنگ) کا دن ہوا تو ہم میں پیچھے ہٹنے کے کچھ آثار ظاہر ہوئے۔ ایسے میں ثابت بن قیس بن شماس رضی اللہ عنہ آئے، انھوں نے میت والی خوشبو لگا رکھی تھی اور کفن پہنا ہوا تھا۔ کہنے لگے : ’’تم نے اپنے ساتھیوں کو (پیچھے ہٹنے کی) بہت بری عادت ڈال دی ہے۔‘‘ یہ کہہ کر لڑنے لگے، حتیٰ کہ قتل کر دیے گئے۔‘‘ [ مسند أحمد : 137/3، ح : ۱۲۴۰۸ ] اس کی سند صحیح ہے۔ تفسیر ابن کثیر کے محقق لکھتے ہیں کہ ثابت بن قیس رضی اللہ عنہ کو یہ خیال اس لیے ہوا کہ بنو تمیم (جن کے بارے میں یہ آیات اتریں) ان کے سامنے (رسول اللہ صلی اللہ علیہ وسلم کی طرف سے) انھوں نے ہی خطبہ دیا تھا۔ دیکھیے البدایہ والنہایہ (۵؍۴۲) اور فتح الباری (۸؍۵۹۱)۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) { اِنَّ الَّذِيْنَ يَغُضُّوْنَ اَصْوَاتَهُمْ … :} اس میں ان لوگوں کی تعریف ہے جو رسول اللہ صلی اللہ علیہ وسلم کی تعظیم و تکریم کا خیال رکھتے ہوئے آپ کے پاس اپنی آوازیں پست رکھتے تھے، جیسا کہ عمر رضی اللہ عنہ کے متعلق گزرا۔ یعنی اللہ تعالیٰ نے ان کے دلوں کے تقویٰ کا امتحان کر کے دیکھ لیا کہ وہ پرہیز گاری کے امتحان میں پوری طرح کامیاب ہیں، جیسے سونے کو آگ میں ڈال کر دیکھا جاتا ہے اور وہ خالص نکلتا ہے، تو کہا جاتا ہے کہ ہم نے اس کے خالص ہونے کی آزمائش کر لی ہے۔ اس سے معلوم ہوا کہ جو شخص رسول اللہ صلی اللہ علیہ وسلم کے سامنے اپنی آواز پست نہیں رکھتا اس کا دل تقویٰ سے خالی ہے، پھر جو شخص آپ صلی اللہ علیہ وسلم کی حدیث سننے کے بعد اس کے خلاف آواز اٹھائے وہ تقویٰ اور ایمان سے کس قدر دور ہو گا۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {اِنَّ الَّذِيْنَ يُنَادُوْنَكَ مِنْ وَّرَآءِ الْحُجُرٰتِ: ’’حُجْرَةٌ ‘‘} زمین کا وہ قطعہ جس کے گرد دیوار بنی ہوئی ہو، گھر کے صحن کی چار دیواری۔ طبری نے فرمایا: {’’حُجْرَةٌ ‘‘} کی جمع {’’حُجَرٌ‘‘} ہے اور اس کی جمع {’’حُجُرَاتٌ‘‘} ہے۔‘‘ روح المعانی میں ان حجرات کی کیفیت بیان کی گئی ہے : ’’یہ نو حجرے تھے، ہر بیوی کے پاس ایک حجرہ تھا اور جیسا کہ ابن سعد نے عطاء خراسانی سے روایت کی ہے، یہ کھجور کی ٹہنیوں سے بنے ہوئے تھے، ان کے دروازوں پر سیاہ بالوں کے ٹاٹ کے پردے تھے۔ بخاری نے ’’الادب المفرد‘‘ میں اور ابن ابی الدنیا اور بیہقی نے داؤد بن قیس سے بیان کیا ہے، انھوں نے فرمایا: ’’میں نے وہ حجرے دیکھے ہیں، کھجور کی ٹہنیوں سے بنے ہوئے تھے، جنھیں باہر کی جانب سے بالوں کے ٹاٹوں سے ڈھانپا ہوا تھا اور میرا گمان ہے کہ صحن کے دروازے سے کمرے کے دروازے تک چھ یا سات ہاتھ (نو یا ساڑھے دس فٹ) کا فاصلہ تھا اور کمرے کا اندرونی حصہ دس ہاتھ (پندرہ فٹ) تھا اور میرا گمان ہے کہ گھر کی چوڑائی سات آٹھ ہاتھ (ساڑھے دس بارہ فٹ) کے درمیان تھی۔‘‘ اور حسن سے بیان کرتے ہیں کہ انھوں نے فرمایا : ’’میں عثمان بن عفان رضی اللہ عنہ کی خلافت میں نبی صلی اللہ علیہ وسلم کی بیویوں کے کمروں میں جایا کرتا تھا تو ان کی چھت کو ہاتھ لگا لیتا تھا۔ ولید بن عبد الملک رحمہ اللہ کے عہد میں ان کے حکم سے ان گھروں کو مسجد نبوی میں شامل کر دیا گیا جس پر لوگ بہت روئے۔‘‘ اور سعید بن مسیب نے فرمایا : ’’اللہ کی قسم! مجھے پسند تھا کہ ان حجروں کو ان کی حالت پر رہنے دیا جاتا، تاکہ اہلِ مدینہ کے بچے بڑے ہوتے اور تمام دنیا سے آنے والے آتے تو دیکھتے کہ اللہ کے رسول صلی اللہ علیہ وسلم نے اپنی زندگی میں کیسے گھروں پر اکتفا کیا ہے۔ اس سے ان کے دلوں میں ایک دوسرے سے بڑھ کر دنیا حاصل کرنے کی حرص اور اس پر فخر کے بجائے زہد اور دنیا سے بے رغبتی پیدا ہوتی۔‘‘ اور ابوامامہ بن سہل بن حنیف نے بھی ایسی ہی بات فرمائی۔‘‘ (روح المعانی) ¤ گزشتہ آیات میں رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں آپ کے ادب کا بیان تھا، ان آیات میں اس وقت آپ صلی اللہ علیہ وسلم کے ادب کو ملحوظ رکھنے کا بیان ہے جب آپ گھر میں ہوں۔ آیت کے الفاظ سے ظاہر ہے کہ کچھ اعرابی لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کے گھروں کی چار دیواری کے باہر کھڑے ہو کر آپ کو بلانے کے لیے آوازیں دیں، تو اللہ تعالیٰ نے ایسے لوگوں کو {’’ لَا يَعْقِلُوْنَ ‘‘} قرار دیا۔ {’’ لَا يَعْقِلُوْنَ ‘‘} قرار دینے سے مقصود انھیں ڈانٹنا اور تمام مسلمانوں کو آپ کے ادب کی تعلیم دینا ہے۔ ¤ ➋ { اَكْثَرُهُمْ لَا يَعْقِلُوْنَ:} ابن جزی (صاحب التسہیل) نے فرمایا: ’’اس میں ددو وجہیں ہیں، ایک یہ کہ ان میں کچھ لوگ عقل رکھنے والے بھی تھے، اس لیے ان کے اکثر کو {’’ لَا يَعْقِلُوْنَ ‘‘} فرمایا، سب کو نہیں۔ دوسری یہ کہ مراد سب ہی کو {’’ لَا يَعْقِلُوْنَ ‘‘} قرار دینا ہے، عقل والوں کو کم قرار دینے سے مراد ان کی نفی ہے۔ الفاظ کے مطابق پہلی وجہ زیادہ ظاہر ہے، دوسری میں زیادہ بلیغ طریقے سے سب کی مذمت کا بیان ہے۔‘‘"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { وَ لَوْ اَنَّهُمْ صَبَرُوْا حَتّٰى تَخْرُجَ اِلَيْهِمْ …:} یعنی اگر وہ آوازیں دینے کے بجائے صبر کرتے اور آپ صلی اللہ علیہ وسلم کے تشریف لانے کا انتظار کرتے تو ان کے لیے بہتر ہوتا، کیونکہ اس صبر و انتظار میں اور آپ صلی اللہ علیہ وسلم کا ادب ملحوظ رکھنے میں انھیں اجر و ثواب ملتا، رسول اللہ صلی اللہ علیہ وسلم زیادہ خوش دلی کے ساتھ ان سے ملتے اور زیادہ بہتر طریقے سے ان کی ضرورتیں پوری فرماتے۔ ظاہر ہے جس شخص پر پوری امت کی ذمہ داری کا بوجھ ہے اور وہ ہر وقت اسی فکر و عمل میں مصروف ہے، اگر اس وقت جب وہ گھر میں ہے یہ خیال کیے بغیر کہ اس وقت وہ آرام کر رہا ہے یا گھر کے کسی کام میں مصروف ہے، آوازیں دینا شروع کر دیا جائے تو اس خیر کی توقع نہیں رکھی جا سکتی جو صبر و انتظار کے ساتھ اس سے حاصل ہونا تھی۔ اس سے اساتذہ کرام، اہلِ علم اور مسلمانوں کے امراء و اکابر کے اکرام کی بھی تعلیم ملتی ہے۔ ¤ ➋ { وَ اللّٰهُ غَفُوْرٌ رَّحِيْمٌ:} یعنی حق تو یہ تھا کہ ان لوگوں کو ان کی اس بے ادبی پر اللہ تعالیٰ کی طرف سے کوئی نہ کوئی سزا ملتی، مگر چونکہ ان سے یہ فعل بے عقلی کی وجہ سے سرزد ہوا تھا، بدنیتی کی وجہ سے نہیں، اس لیے آخر میں اپنے غفور و رحیم ہونے کا تذکرہ کرتے ہوئے ان کی مغفرت کا اشارہ فرما دیا۔ ¤ ➌ رسول اللہ صلی اللہ علیہ وسلم جب زندہ تھے اور دیوار کے باہر سے آپ تک آواز بھی پہنچتی تھی اس وقت آپ کو آواز دینے والوں کو اللہ تعالیٰ نے بے عقل قرار دیا تو اب جبکہ رسول اللہ صلی اللہ علیہ وسلم فوت ہو چکے اور یہ ممکن ہی نہ رہا کہ آپ صلی اللہ علیہ وسلم ہماری بات سنیں یا ہم آپ صلی اللہ علیہ وسلم کی بات سنیں، جیسا کہ فرمایا: « وَ مِنْ وَّرَآىِٕهِمْ بَرْزَخٌ اِلٰى يَوْمِ يُبْعَثُوْنَ» [المؤمنون: ۱۰۰] ’’اور ان کے پیچھے اس دن تک جب وہ اٹھائے جائیں گے، ایک پردہ ہے۔ ‘‘ تو جو لوگ اب ہزاروں میل دور سے آپ صلی اللہ علیہ وسلم کو آوازیں دیتے ہیں اور آوازیں بھی اس مقصد کے لیے دیتے ہیں جو اللہ تعالیٰ کے سوا کوئی پورا نہیں کر سکتا، تو ان کے {’’ لَا يَعْقِلُوْنَ ‘‘} (بے عقل) ہونے میں کیا شبہ ہے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنْ جَآءَكُمْ فَاسِقٌۢ بِنَبَاٍ فَتَبَيَّنُوْۤا: ’’ فَاسِقٌ‘‘} جو دین کی کسی حد سے یا تمام حدوں سے نکل جائے، جن کی پابندی لازم ہے۔ اس کا اشتقاق {’’فَسَقَ الرُّطَبُ‘‘} (تازہ کھجور چھلکے سے باہر نکل گئی، یعنی پھٹ گئی) سے ہے۔ اس کا اکثر استعمال نافرمانی کے مرتکب مسلمان پر ہوتا ہے، کافر پر بھی یہ لفظ بول لیا جاتا ہے، جیسا کہ فرمایا : «اَفَمَنْ كَانَ مُؤْمِنًا كَمَنْ كَانَ فَاسِقًا لَا يَسْتَوٗنَ » [السجدۃ: ۱۸] ’’تو کیا وہ شخص جو مومن ہو وہ اس کی طرح ہے جو نافرمان ہو؟ برابر نہیں ہوتے۔‘‘ {’’نَبَأٌ‘‘} کوئی اہم خبر۔ راغب نے فرمایا: ’’خبر کو ’’نبا‘‘ اس وقت کہتے ہیں جب اس سے کوئی عظیم فائدہ حاصل ہوتا ہو، ایسی ہی خبر سے کسی بات کا یقین یا غلبۂ ظن حاصل ہوتا ہے۔‘‘ {’’ فَتَبَيَّنُوْۤا ‘‘ ’’تَبَيَّنَ يَتَبَيَّنُ ‘‘} (تفعّل) لازم بھی آتا ہے، یعنی کسی چیز کا خوب واضح ہو جانا اور متعدی بھی، یعنی کسی چیز پر پوری طرح غور و فکر اور اس کی تحقیق کرنا، اس کی حقیقت معلوم کر لینا، یہاں متعدی کے معنی میں ہے۔ اکثر قراء توں میں {’’ فَتَبَيَّنُوْۤا ‘‘} ہے، حمزہ اور کسائی کی قراء ت میں {’’فَتَثَبَّتُوْا‘‘} ہے، معنی دونوں کا ایکک ہی ہے۔ ¤ ➋ اس آیت میں اللہ تعالیٰ نے مسلمانوں کو ایسے ادب کی تعلیم دی ہے جس کا اہتمام ان کے دین و دنیا کے معاملات میں نہایت ضروری ہے اور جس کی پابندی نہ کرنے سے بے پناہ نقصان کا اندیشہ ہے۔ وہ یہ کہ جب ان کے پاس کوئی فاسق، جو کھلم کھلا دین کی حد پامال کرنے والا ہے، کوئی اہم خبر لے کر آئے تو اسے سنتے ہی سچا نہ سمجھ لیں اور نہ ہی پوری تحقیق کے بغیر اس کی بات کا اعتبار کریں، کیونکہ جو فسق سے پرہیز نہیں کرتا وہ جھوٹ بھی بول سکتا ہے۔ ¤ ➌ { اَنْ تُصِيْبُوْا قَوْمًۢا بِجَهَالَةٍ:} اس سے معلوم ہوا کہ فاسق کی خبر پر بلاتحقیق عمل کرنا جہالت ہے، جو خطا سے بڑھ کر ہے، کیونکہ مجتہد اگر غلطی کرے تو اسے مخطی کہہ سکتے ہیں، جاہل نہیں، جب کہ بلاتحقیق فاسق کے قول پر فیصلہ کرنے والا اگر غلط فیصلہ کرے تو وہ جاہل ہے۔ (رازی) یعنی ایسا نہ ہو کہ تم کسی فاسق کی خبر پر بلاتحقیق کوئی کارروائی کر گزرو اور لاعلمی میں کچھ لوگوں کو نقصان پہنچا دو، ان پر حملہ کر کے انھیں زخمی یا قتل کر دو، ان کی غیبت کر بیٹھو یا ان سے قطع تعلق کر لو، غرض تمھاری طرف سے انھیں کوئی بھی نقصان پہنچ سکتا ہے۔ کتنے ہی فتنے اور فساد ہیں جو بلاتحقیق ایسی خبروں پر عمل کے نتیجے میں پیدا ہوتے ہیں اور بات بگڑ کر کہیں سے کہیں پہنچ جاتی ہے۔ ¤ ➍ { فَتُصْبِحُوْا عَلٰى مَا فَعَلْتُمْ نٰدِمِيْنَ:} پھر تم اس پر پشیمان ہو جاؤ، کیونکہ جلد بازی اور بلاتحقیق کام کا نتیجہ پشیمانی ہی ہے۔ ¤ ➎ یہ آیت اس عظیم الشان علم کی بنیاد ہے جسے اصولِ حدیث کہا جاتا ہے، جو ہماری امت کی خصوصیت ہے اور جس کی وجہ سے رسول اللہ صلی اللہ علیہ وسلم کے افعال و اقوال اور احوال و تقریرات محفوظ طریقے سے ہم تک پہنچے ہیں اور قیامت تک پہنچتے جائیں گے۔ اس علم کی تکمیل کے لیے امت مسلمہ نے ایک لاکھ سے زیادہ راویوں کے حالاتِ زندگی، ان کا صدق و کذب، عدالت و فسق، حافظ ہونا یا نہ ہونا وغیرہ سب کچھ محفوظ کر دیا ہے۔ اس میں سب سے پہلے دیکھا جاتا ہے کہ کوئی خبر بیان کرنے والا فاسق ہے یا عادل، اگر فاسق ہے تو اس کی خبر کی تحقیق کی جائے گی، اگر کسی دوسرے ذریعے سے اس کا درست ہونا ثابت ہو جائے تو اسے مان لیا جائے گا ورنہ اسے قبول نہیں کیا جائے گا اور اگر خبر دینے والا عادل ہے تو مزید تحقیق کی ضرورت نہیں اور اس کی خبر قبول کی جائے گی، خواہ خبر دینے والا ایک ہی ہو۔ اصطلاح میں کہا جاتا ہے کہ خبر واحد حجت ہے۔ اس سے یہ بھی معلوم ہوا کہ مجہول آدمی کی خبر بھی بلاتحقیق قبول نہیں کی جائے گی، کیونکہ اس کے فاسق ہونے کا احتمال ہے۔ ¤ ➏ آیت کے الفاظ میں {’’ فَاسِقٌ‘‘} اور {’’ بِنَبَاٍ ‘‘} دونوں نکرہ ہیں، اس میں کسی خاص شخص کو متعین نہیں کیا گیا، بلکہ ایک عام قاعدہ بیان کیا گیا ہے کہ کوئی فاسق شخص کوئی بھی خبر لے کر تمھارے پاس آئے تو اس کی تحقیق کر لو۔ بہت سے مفسرین نے لکھا ہے کہ یہ آیت ولید بن عقبہ رضی اللہ عنہ کے بارے میں نازل ہوئی، جنھیں رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ بنو مصطلق سے زکوٰۃ وصول کرنے کے لیے بھیجا۔ یہ عثمان بن عفان رضی اللہ عنہ کے ماں کی طرف سے بھائی تھے۔ بنو مصطلق اور ان کے قبیلہ میں اسلام سے پہلے سے دشمنی چلی آ رہی تھی، وہ لوگ مسلح ہو کر استقبال کے لیے آئے، تو یہ ڈر گئے کہ شاید یہ لوگ مجھے قتل کرنا چاہتے ہیں اور وہیں سے واپس آ کر ررسول اللہ صلی اللہ علیہ وسلم سے شکایت کی کہ بنو مصطلق نے زکوٰۃ دینے سے انکار کر دیا ہے، بلکہ وہ مجھے قتل کرنا چاہتے تھے۔ آپ صلی اللہ علیہ وسلم نے یہ سن کر بنو مصطلق کی طرف ایک لشکر روانہ فرمایا، ابھی یہ لشکر راستے میں تھا کہ ادھر سے بنو مصطلق کے سردار حارث بن ضرار رضی اللہ عنہ (ام المومنین جویریہ رضی اللہ عنھا کے والد) اپنے چند ساتھیوں کے ساتھ آتے نظر آئے۔ قریب پہنچ کر انھوں نے لشکر والوں سے دریافت کیا کہ آپ لوگ کدھر جا رہے ہیں؟ انھوں نے جواب دیا کہ تمھاری طرف ہی جا رہے ہیں۔ انھوں نے سبب پوچھا تو لشکر والوں نے بتایا کہ آپ صلی اللہ علیہ وسلم نے ولید بن عقبہ رضی اللہ عنہ کو تمھارے پاس بھیجا اور تم نے زکوٰۃ دینے سے انکار کر دیا، بلکہ اسے قتل کرنے پر آمادہ ہو گئے۔ انھوں نے کہا، اس ذات کی قسم جس نے آپ صلی اللہ علیہ وسلم کو حق دے کر مبعوث کیا ہے! ولید نہ ہمارے پاس آیا اور نہ ہم نے اس کی شکل دیکھی۔ پھر یہی بات انھوں نے آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر کہی اور مزید کہا کہ ہم تو خود آپ کی خدمت میں اس لیے حاضر ہوئے ہیں کہ آپ کی طرف سے کوئی زکوٰۃ وصول کرنے نہیں پہنچا اور ہم ڈر گئے کہ کہیں آپ ہم سے ناراض نہ ہو گئے ہوں۔ اس پر یہ آیت نازل ہوئی۔ یہ ان روایات کا خلاصہ ہے جو ابنِ کثیر وغیرہ نے نقل فرمائی ہیں۔ ¤ ➐ عام مفسرین نے اس واقعہ کو بنیاد بنا کر ولید بن عقبہ رضی اللہ عنہ کو فاسق اور ان کی خبر کو تحقیق کے بغیر ناقابل قبول قرار دیا ہے۔ بعض کج دماغوں نے اسے اس مسلم قاعدے پر طعن کا ذریعہ بنایا ہے کہ اصحابِ رسول صلی اللہ علیہ وسلم سب کے سب عادل ہیں اور کسی سے رسول اللہ صلی اللہ علیہ وسلم پر جھوٹ ثابت نہیں، اس لیے رسول اللہ صلی اللہ علیہ وسلم کا صحابی کوئی بھی ہو اس کی بیان کردہ ہر روایت معتبر ہے۔ ¤ حقیقت یہ ہے کہ اس آیت کو ولید بن عقبہ رضی اللہ عنہ سے متعلق قرار دینے والی کسی بھی روایت کی سند صحیح نہیں۔ ابن کثیر رحمہ اللہ نے اس مقام پر چار روایتیں نقل کی ہیں اور ان میں سب سے بہتر حارث بن ضرار خزاعی رضی اللہ عنہ کی روایت کو قرار دیا ہے۔ اس کی سند یہ ہے : {’’ قَالَ الْإِمَامُ أَحْمَدُ فِيْ مُسْنَدِهِ حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ حَدَّثَنَا عِيْسَي بْنُ دِيْنَارٍ حَدَّثَنَا أَبِيْ أَنَّهُ سَمِعَ الْحَارِثَ بْنَ ضِرَارٍ الْخُزَاعِيَّ قَالَ ‘‘} [ مسند أحمد : 279/4، ح : ۱۸۴۵۹ ] تفسیر ابن کثیر کے محقق سامی بن محمد سلامہ لکھتے ہیں : ’’بہت سے مفسرین اس قول کی طرف گئے ہیں (کہ یہ آیت ولید بن عقبہ رضی اللہ عنہ کے بارے میں نازل ہوئی ہے) حالانکہ اس قول میں نظر ہے، کیونکہ جتنی بھی روایات میں یہ قصہ بیان ہوا ہے وہ سب معلول ہیں (ان میں خرابی ہے)، ان میں سب سے بہتر امام احمد کی حارث بن ضرار خزاعی رضی اللہ عنہ سے روایت ہے۔ اس کی سند میں ایک مجہول راوی ہے اور قاضی ابوبکر بن العربی نے اپنی کتاب ’’العواصم من القواصم (ص : ۱۰۲)‘‘ میں اس قصے کا انکار کیا ہے۔‘‘ ¤ تفسیر ابن کثیرکی تخریج {’’هداية المستنير‘‘} (تالیف ابو عبد الرحمن عادل بن یوسف العزازی) میں ہے : ’’اس روایت میں دینار کوفی ہے، حافظ نے فرمایا، مقبول ہے، یعنی جب اس کی کوئی متابعت موجود ہو۔‘‘ ظاہر ہے یہاں کسی نے اس کی متابعت نہیں کی، اس لیے اس کی یہ روایت قبول نہیں۔ مسند احمد کے محققین نے اس روایت پر لکھا ہے: ’’حارث بن ضرار کے اسلام کا قصہ چھوڑ کر باقی روایت اپنے شواہد کی وجہ سے حسن ہے اور یہ سند ضعیف ہے، کیونکہ عیسیٰ کا والد دینار مجہول ہے۔ وہ کوفے کا رہنے والا ہے اور عمرو بن حارث کا مولیٰ ہے، اس سے اس کے بیٹے عیسیٰ نے اکیلے ہی یہ روایت بیان کی ہے اور ابن المدینی نے فرمایا : {’’لَا أَعْرِفُهُ‘‘} (میں اسے نہیں پہچانتا) اس کے باوجود ابن حبان نے اس کا ذکر ’’الثقات‘‘ میں کیا ہے۔‘‘ ¤ اس آیت کے ولید بن عقبہ رضی اللہ عنہ کے متعلق نازل ہونے کی دوسری روایت ابن کثیر نے ام سلمہ رضی اللہ عنھا کی بیان کی ہے۔ ابن کثیر (طبع دار ابن الجوزی) کے محقق دکتور حکمت بن بشیر نے فرمایا: ’’اس کی سند موسیٰ بن عبیدہ کے ضعیف ہونے کی وجہ سے ضعیف ہے۔‘‘ ابن کثیر میں اس مفہوم کی تیسری روایت ابن عباس رضی اللہ عنھما سے مروی ہے، جو عوفی کی وجہ سے ضعیف ہے۔ چوتھی روایت مجاہد اور قتادہ نے بیان کی ہے جو تابعی ہیں اور ان کی روایت مرسل ہے جو حجت نہیں۔ آپ غور فرمائیں ! یہ ایک ایسا واقعہ ہے جس کی سب سے بہتر روایت کو حسن کہنے والے بھی اس کی سند کے ضعیف ہونے کا اعتراف کرتے ہیں، حسن صرف شواہد کی وجہ سے کہتے ہیں اور شواہد بھی ایسے کہ سب کی سند ضعیف ہے۔ ایسی کمزور روایت کے ساتھ ایک صحابی کو فاسق قرار دینا کیسے درست ہو سکتا ہے، جو اس جماعت کا فرد ہے جسے اللہ تعالیٰ کی رضا کی سند حاصل ہو چکی ہے۔ ¤ ➑ اگر اس قصے کو درست مان لیا جائے تو بھی اس سے ولید بن عقبہ رضی اللہ عنہ کا فاسق ہونا لازم نہیں آتا۔ سب سے پہلے تو رسول اللہ صلی اللہ علیہ وسلم کا صدقات کی وصولی کے لیے ان کا انتخاب ان کے فاسق ہونے کی نفی کرتا ہے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم ایسے عمال کو صدقات وغیرہ کی وصولی پر مقرر فرماتے تھے جو نہایت امین ہوتے تھے، جیسا کہ ابوعبیدہ امین ہذہ الامہ کو یمن کی طرف بھیجنے سے ظاہر ہے۔ پھر ولید رضی اللہ عنہ کا یہ کہنا کہ بنو مصطلق نے زکوٰۃ دینے سے انکار کر دیا ہے اور میرے قتل کا ارادہ کیا ہے، اس کی وجہ خود اس روایت میں موجود ہے کہ ان کے درمیان سابقہ دشمنی موجود تھی اور مسلح افراد کی بہت بڑی تعداد کو دیکھ کر ان کے دل میں یہ خیال پیدا ہو گیا کہ یہ مجھے قتل کرنے آئے ہیں اور زکوٰۃ دینے کے لیے تیار نہیں ہیں۔ ایسا گمان پیدا ہونا فطری بات ہے۔ آپ اسے گمان کی غلطی کہہ سکتے ہیں مگر جھوٹ یا فسق نہیں کہہ سکتے۔ رہا آیت کا نزول تو ا س میں نہ اللہ تعالیٰ نے فرمایا کہ ولید فاسق ہے نہ اس کے رسول صلی اللہ علیہ وسلم نے یہ فرمایا۔ آیت میں مسلمانوں کو ایک حکم دیا گیا ہے کہ ان کے پاس کوئی فاسق کوئی خبر لے کر آئے تو اس کی تحقیق کر لیا کریں، اندھا دھند اس پر کارروائی نہ کریں۔ ¤ ➒ شیخ عبد الرحمان معلمی یمانی نے ’’الانوار الکاشفہ (ص : ۲۶۳)‘‘ میں ولید بن عقبہ رضی اللہ عنہ کے بارے میں گفتگو کرتے ہوئے ثابت کیا ہے کہ ولید بن عقبہ رضی اللہ عنہ سے نبی صلی اللہ علیہ وسلم کی کوئی حدیث منقول ہی نہیں، اس لیے اس واقعہ سے کسی صحابی کی نقل کردہ روایت کا مردود ہونا لازم ہی نہیں آتا، کیونکہ انھوں نے آپ صلی اللہ علیہ وسلم سے کوئی روایت نقل ہی نہیں کی۔ شیخ معلمی نے ان سے مروی دوسری روایات کے علاوہ اس روایت کی بھی نفی کی ہے جو مسند احمد میں ہے کہ ولید رضی اللہ عنہ بیان کرتے ہیں : [ لَمَّا فَتَحَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ جَعَلَ أَهْلُ مَكَّةَ يَأْتُوْنَهُ بِصِبْيَانِهِمْ فَيَمْسَحُ عَلٰی رُؤؤُوْسِهِمْ وَيَدْعُوْ لَهُمْ، فَجِيْئَ بِيْ إِلَيْهِ وَ إِنِّيْ مُططَيَّبٌ بِالْخَلُوْقِ، فَلَمْ يَمْسَحْ عَلٰی رَأْسِيْ، وَلَمْ يَمْنَعْهُ مِنْ ذٰلِكَ إِلاَّ أَنَّ أُمِّيْ خَلَّقَتْنِيْ بِالْخَلُوْقِ ففَلَمْ يَمَسَّنِيْ مِنْ أَجْلِ الْخَلُوْقِ ] [مسند أحمد : 32/4، ح : ۱۶۳۷۹ ] ’’جب رسول اللہ صلی اللہ علیہ وسلم نے مکہ فتح کیا تو اہلِ مکہ اپنے بچے لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آنے لگے، آپ ان کے سر پر ہاتھ پھیرتے اور ان کے لیے برکت کی دعا کرتے۔ مجھے بھی آپ کے پاس لایا گیا مگر آپ نے میرے سر پر ہاتھ نہیں پھیرا اور آپ کے ہاتھ نہ پھیرنے کی وجہ یہی بنی کہ میری ماں نے مجھے خلوق (زعفران سے مرکب ایک خوشبو) لگائی تھی تو آپ صلی اللہ علیہ وسلم نے خلوق کی وجہ سے مجھے ہاتھ نہیں لگایا۔‘‘ مسند احمد کے محققین نے لکھا ہے: ’’اس کی سند عبد اللہ ہمدانی کے مجہول ہونے کی وجہ سے ضعیف ہے، کنیت اس کی ابوموسیٰ ہے۔ اس سے روایت میں ثابت بن حجاج الکلابی منفرد ہے اور ذہبی اور ابنِ حجر نے تقریب میں اسے مجہول کہا ہے۔ بخاری نے ’’تاریخ کبیر‘‘ (۵؍۲۲۴) میں کہا ہے: {’’لَا يَصِحُّ حَدِيْثُهُ‘‘} (اس کی حدیث صحیح نہیں) اور ابن عبد البر نے کہا ہے کہ یہ ابوموسیٰ مجہول ہے اور یہ خبر منکر ہے، صحیح نہیں۔‘‘ اگر اس روایت کو صحیح مانا جائے تو ولید بن عقبہ رضی اللہ عنہ کو فاسق کہنے کی بنیاد ہی ختم ہو جاتی ہے، کیونکہ اس سے فتح مکہ کے موقع پر ولید کا بچہ ہونا ثابت ہوتا ہے، جسے صدقات کا عامل بنا کر بھیجنے کا سوال ہی پیدا نہیں ہوتا۔ ¤ ➓ بعض لوگوں نے صحیح مسلم (۱۷۰۷) وغیرہ کی اس روایت کی وجہ سے ولید بن عقبہ رضی اللہ عنہ کو فاسق قرار دیا ہے جس میں ہے کہ انھوں نے شراب پی کر صبح کی جماعت دو رکعتیں پڑھانے کے بعد کہا کہ مزید پڑھاؤں، جس پر عثمان رضی اللہ عنہ نے ان پر شراب کی حد لگائی۔ واضح رہے کہ بعض روایات میں دو کے بجائے چار رکعتیں پڑھانے کا ذکر ہے مگر ان میں سے کوئی روایت بھی صحیح نہیں۔ بعض اہلِ علم نے لکھا ہے : ’’علامہ آلوسی نے روح المعانی میں فرمایا : ’’اس معاملے میں حق بات وہ ہے جس کی طرف جمہور علماء گئے ہیں کہ صحابہ کرام معصوم نہیں ہیں، ان سے گناہ کبیرہ بھی سرزد ہو سکتا ہے جو فسق ہے اور اس گناہ کے وقت ان کے ساتھ وہی معاملہ کیا جائے گا جس کے وہ مستحق ہیں، یعنی شرعی سزا جاری کی جائے گی، لیکن اہلِ سنت والجماعہ کا عقیدہ قرآن و سنت کی نصوص کی بنا پر یہ ہے کہ صحابی سے گناہ تو ہو سکتا ہے مگر کوئی صحابی ایسا نہیں جو گناہ سے توبہ کرکے پاک نہ ہو گیا ہو۔ قرآن کریم نے علی الاطلاق ان کے بارے میں اللہ تعالیٰ کی رضا کا فیصلہ فرما دیا ہے، فرمایا: «رَضِيَ اللّٰهُ عَنْهُمْ وَ رَضُوْا عَنْهُ وَ اَعَدَّ لَهُمْ جَنّٰتٍ تَجْرِيْ تَحْتَهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَاۤ اَبَدًا ذٰلِكَ الْفَوْزُ الْعَظِيْمُ » [التوبۃ : ۱۰۰ ] ’’اللہ ان سے راضی ہوگیا اور وہ اس سے راضی ہوگئے اور اس نے ان کے لیے ایسے باغات تیار کیے ہیں جن کے تلے نہریں بہتی ہیں، ان میں ہمیشہ رہنے والے ہیں ہمیشہ۔ یہی بہت بڑی کامیابی ہے۔‘‘ اور اللہ تعالیٰ کی رضا گناہ کے معاف ہونے کے بغیر نہیں ہوتی، جیسا کہ قاضی ابو یعلی نے فرمایا: ’’رضا اللہ تعالیٰ کی ایک صفت قدیمہ ہے، وہ اپنی رضا کا اعلان صرف انھی کے لیے فرماتے ہیں جن کے متعلق وہ جانتے ہیں کہ ان کی وفات ان کاموں پر ہو گی جن پر اللہ تعالیٰ راضی ہے۔‘‘ [ کَذَا فِي الصَّارِمِ الْمَسْلُوْلِ لاِبْنِ تَیْمِیَۃَ ] خلاصہ یہ ہے کہ صحابہ کرام رضی اللہ عنھم کی عظیم الشان جماعت میں سے اگر کسی سے کبھی کوئی گناہ سرزد ہوا بھی ہے تو ان کو فوراً توبہ کی توفیق نصیب ہوئی ہے۔ حق تعالیٰ نے ان کو رسول کریم صلی اللہ علیہ وسلم کی صحبت کی برکت سے ایسا بنا دیا تھا کہ شریعت ان کی طبیعت بن گئی تھی، خلافِ شرع کوئی کام یا گناہ سرزد ہونا انتہائی شاذ و نادر تھا۔ ان کے اعمال صالحہ، نبی کریم صلی اللہ علیہ وسلم اور اسلام پر اپنی جانیں قربان کرنا اور ہر کام میں اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کے اتباع کو وظیفۂ زندگی بنانا اور اس کے لیے ایسے مجاہدات کرنا جن کی نظیر پچھلی امتوں میں نہیں ملتی، ان بے شمار اعمال صالحہ اور فضائل و کمالات کے مقابلے میں عمر بھر میں کسی گناہ کا سرزد ہو جانا اس کو خود ہی کالعدم کر دیتا ہے۔ دوسرے اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کی محبت و عظمت اور ادنیٰ سے گناہ کے وقت ان کا خوف، خشیت اور فوراً توبہ کرنا بلکہ اپنے آپ کو سزا کے لیے خود پیش کر دینا روایاتِ حدیث میں مشہور و معروف ہے اور بحکمِ حدیث گناہ سے توبہ کرنے والا ایسا ہو جاتا ہے جیسے گناہ کیا ہی نہیں۔ تیسرے قرآن کے ارشاد کے مطابق اعمال صالحہ اور حسنات خود بھی گناہوں کا کفارہ ہو جاتے ہیں، جیسا کہ فرمایا: « اِنَّ الْحَسَنٰتِ يُذْهِبْنَ السَّيِّاٰتِ » [ہود: ۱۱۴] ’’بے شک نیکیاں برائیوں کو لے جاتی ہیں۔‘‘ خصوصاً جب ان کی حسنات عام لوگوں کی طرح نہیں، بلکہ ان کا حال وہ ہے جو ابوداؤد اور ترمذی نے سعید بن زید رضی اللہ عنہ سے (جو عشرہ مبشرہ میں سے ایک ہیں) نقل کیا ہے، وہ فرماتے ہیں : [ لَمَشْهَدُ رَجُلٍ مِّنْهُمْ مَعَ رَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يَغْبَرُّ فِيْهِ وَجْهُهُ خَيْرٌ مِّنْ عَمَلِ أَحَدِكُمْ عُمُرَهُ وَلَوْ عُمِّرَ عُمُرَ نُوْحٍ ] [ أبوداوٗد، السنۃ، باب في الخلفاء : ۴۶۵۰، قال الألبانی صحیح ] ’’اللہ کی قسم! ان میں سے کسی شخص کا نبی کریم صلی اللہ علیہ وسلم کے ساتھ کسی جہاد میں شریک ہونا جس میں ان کے چہرے پر غبار پڑ گیا ہو، تم میں سے کسی شخص کی عمر بھر کی عبادت و اطاعت سے افضل ہے۔ اگرچہ اس کو نوح علیہ السلام کی عمر دے دی گئی ہو۔‘‘ اس لیے ان سے صدورِ گناہ کے وقت اگرچہ سزا وغیرہ میں معاملہ وہی کیا گیا جو اس جرم کے لیے مقرر تھا، مگر اس کے باوجود بعد میں کسی کے لیے جائز نہیں کہ ان میں سے کسی کو فاسق قرار دے۔ اس لیے اگر نبی کریم صلی اللہ علیہ وسلم کے عہد میں کسی صحابی سے کوئی گناہ موجب فسق سرزد بھی ہو اور اس وقت ان کو فاسق کہا بھی گیا ہو تو اس سے یہ جائز نہیں ہو جاتا کہ اس فسق کو ان کے لیے ہمیشہ کا حکم سمجھ کر معاذ اللہ فاسق کہا جائے۔‘‘ (کذا فی الروح)"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { وَ اعْلَمُوْۤا اَنَّ فِيْكُمْ رَسُوْلَ اللّٰهِ:} ظاہر ہے کہ ہر صحابی یہ جانتا تھا کہ اللہ کا رسول ہم میں موجود ہے، اس کے باوجود فرمایا: ’’اور جان لو کہ تم میں اللہ کا رسول ہے۔‘‘ اس کی وجہ یہ ہے کہ زندگی میں رسول اللہ صلی اللہ علیہ وسلم کے بنفس نفیس موجود ہونے اور آپ کی وفات کے بعد کتاب و سنت کے موجود ہونے کے باوجود جو شخص اپنی رائے پر اصرار کرتا ہے اور آپ صلی اللہ علیہ وسلم اور آپ کی حدیث سے رہنمائی حاصل کرنے کے بجائے اپنی بات منوانا چاہتا ہے درحقیقت وہ اس بات سے جاہل ہے کہ ہم میں اللہ کا رسول موجود ہے، ہمیں ہر معاملے میں ان کی بات ماننا چاہیے، کیونکہ اگر اسے یہ بات معلوم ہوتی تو وہ رسول کی اطاعت کرتا اور رسول کو اپنی اطاعت کروانے کی کوشش نہ کرتا۔ سو جس طرح وہ شخص جاہل ہے جو چار دیواری کے باہر سے آپ کو آوازیں دیتا ہے اور وہ شخص جاہل ہے جو کسی فاسق کی لائی ہوئی خبر پر بلاتحقیق کارروائی کر گزرتا ہے، اسی طرح وہ شخص بھی جاہل ہے جو رسول اللہ صلی اللہ علیہ وسلم اور آپ کی حدیث کے ہوتے ہوئے اپنی بات منوانا چاہتا ہے۔ اس لیے اسے یہ بتانے کی شدید ضرورت ہے کہ جان لو! تم میں اللہ کا رسول موجود ہے۔ ¤ ➋ { لَوْ يُطِيْعُكُمْ فِيْ كَثِيْرٍ مِّنَ الْاَمْرِلَعَنِتُّمْ:} یعنی رسول کے احکام چونکہ اللہ تعالیٰ کی طرف سے وحی ہوتے ہیں اور اللہ تعالیٰ علیم و حکیم ہے اور اس کا ہر حکم علم و حکمت اور رحمت و مصلحت پر مبنی ہے اس لیے رسول کی اطاعت کرنے سے تم ہر طرح کی مشقت اور مصیبت سے بچے رہو گے، کیونکہ اللہ تعالیٰ تمھارے لیے آسانی چاہتا ہے، جیسا کہ فرمایا: «يُرِيْدُ اللّٰهُ بِكُمُ الْيُسْرَ وَ لَا يُرِيْدُ بِكُمُ الْعُسْرَ» [البقرۃ: ۱۸۵] ’’اللہ تمھارے ساتھ آسانی کا ارادہ رکھتا ہے اورتمھارے ساتھ تنگی کا ارادہ نہیں رکھتا۔‘‘ اور رسول کو بھی تمھارا مشقت میں پڑنا کسی صورت گوارا نہیں، فرمایا: « عَزِيْزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيْصٌ عَلَيْكُمْ » [التوبۃ: ۱۲۸] ’’اس پر بہت شاق ہے کہ تم مشقت میں پڑو، تم پر بہت حرص رکھنے والا ہے۔‘‘ اس کے برعکس اگر رسول تمھاری اطاعت کرے تو تم مشقت میں پڑ جاؤ گے، کیونکہ اوّل تو تمھاری سب کی بات ایک نہیں ہو گی، ہر شخص وہ بات منوانے کی کوشش کرے گا جو اس کے خیال میں اس کے فائدے کی ہے، تو رسول کس کس کی بات مانے گا اور کس کی بات کا امت کو حکم دے گا؟ پھر تمھارا علم ناقص ہے، نہ تمھیں مستقبل کی کوئی خبر ہے نہ تم غیب کا علم رکھتے ہو، تمھیں کیا معلوم کہ تم جسے اپنے لیے فائدہ مند سمجھ رہے ہو وہ انجام کے لحاظ سے کس قدر نقصان دہ ہے ۔ اس لیے جس طرح کائنات کا نظام درست اس لیے چل رہا ہے کہ وہ ایک اللہ کے حکم کے مطابق چل رہا ہے اسی طرح شریعت کا نظام بھی صرف رسول کی اطاعت سے صحیح چل سکتا ہے، کیونکہ اس کی اطاعت درحقیقت اللہ تعالیٰ کی اطاعت ہے، فرمایا: « وَ لَوِ اتَّبَعَ الْحَقُّ اَهْوَآءَهُمْ لَفَسَدَتِ السَّمٰوٰتُ وَ الْاَرْضُ وَ مَنْ فِيْهِنَّ » [المؤمنون : ۷۱ ] ’’اور اگر حق ان کی خواہشوں کے پیچھے چلے تو سب آسمان اور زمین اور جو کوئی ان میں ہے، یقینا بگڑ جائیں۔‘‘ ¤ ➌ { ’’ لَوْ يُطِيْعُكُمْ فِيْ كَثِيْرٍ مِّنَ الْاَمْرِ ‘‘} میں اس بات کی طرف بھی اشارہ ہے کہ رسول بعض تدبیری امور میں تمھارا مشورہ مان بھی لیتا ہے، کیونکہ اسے اللہ کی طرف سے مشورے کا حکم دیا گیا ہے، چنانچہ فرمایا : « فَاعْفُ عَنْهُمْ وَ اسْتَغْفِرْ لَهُمْ وَ شَاوِرْهُمْ فِي الْاَمْرِ » [ آل عمران : ۱۵۹ ] ’’سو ان سے درگزر کر اور ان کے لیے بخشش کی دعا کر اور کام میں ان سے مشورہ کر۔‘‘ مگر یاد رکھو! تمھارا کام حکم دینا نہیں، مشورہ دینا ہے، رسول مناسب سمجھے تو مان لے مناسب نہ سمجھے تو نہ مانے، آخری فیصلہ اللہ تعالیٰ کی راہنمائی کے ساتھ اسی نے کرنا ہے، جیسا کہ فرمایا : «فَاِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللّٰهِ » [ آل عمران : ۱۵۹ ] ’’پھر جب تو پختہ ارادہ کرے تو اللہ پر بھروسا کر۔‘‘ ¤ ➍ { وَ لٰكِنَّ اللّٰهَ حَبَّبَ اِلَيْكُمُ الْاِيْمَانَ:} ایمان سے مراد یہاں رسول اللہ صلی اللہ علیہ وسلم کی اطاعت ہے جس میں تصدیق بالقلب، اقرار باللسان اور عمل بالارکان تینوں شامل ہیں۔ یعنی اگر رسول بہت سی باتوں میں تمھاری اطاعت کرے تو یقینا تم مشکل میں پڑ جاؤ، لیکن اللہ تعالیٰ نے(تمھیں مشکل میں پڑنے سے بچا لیا اور) ایمان یعنی رسول صلی اللہ علیہ وسلم کی اطاعت کو تمھارے لیے محبوب بنا دیا اور اسے تمھارے دلوں میں ایسا مزین کر دیا کہ تم خوش دلی سے رسول کی اطاعت پر کار بند ہو گئے۔ اس لیے بعض اوقات بتقاضائے بشریت تم سے غلطی ہو جاتی ہے مگر ایمان کی محبت اور کفر سے نفرت کی بدولت تم جلد ہی اللہ تعالیٰ کی طرف رجوع کرتے ہو اور گناہوں سے باز رہتے ہو۔ ¤ ➎ { وَ كَرَّهَ اِلَيْكُمُ الْكُفْرَ وَ الْفُسُوْقَ وَ الْعِصْيَانَ:} یعنی کفر، فسوق اور عصیان کو تمھارے لیے ناپسندیدہ بنا دیا۔ رازی نے فرمایا: ’’ایمان میں تصدیق بالقلب، اقرار باللسان اور عمل بالارکان تینوں شامل ہیں۔ کفر دل کی تصدیق نہ ہونا ہے، فسوق زبان سے اقرار نہ کرنا ہے اور عصیان عمل نہ کرنا ہے۔‘‘ شیخ عبد الرحمان السعدی نے فرمایا: ’’(کفر کا معنی تو ظاہر ہے) فسوق سے مراد بڑے گناہ (کبائر) اور عصیان سے مراد ان سے کم تر درجے کے گناہ ہیں۔‘‘ (واللہ اعلم) ¤ ➏ {اُولٰٓىِٕكَ هُمُ الرّٰشِدُوْنَ:} یعنی یہ لوگ جن کے لیے اللہ تعالیٰ نے ایمان کو محبوب بنا دیا ہے اور اسے ان کے دلوں میں مزین کر دیا ہے اور کفر و فسوق و عصیان کو ان کے لیے ناپسندیدہ بنا دیا ہے، یہی لوگ ہیں جو کامل ہدایت والے ہیں۔ ’’الف لام‘‘ بیانِ کمال کے لیے ہے اور حصر کا فائدہ بھی دے رہا ہے کہ صحابہ ہی ہدایت پر ہیں، ان کے دشمن اور مخالف گمراہ ہیں۔ اس آیت میں صحابہ کرام کی بے حد فضیلت بیان ہوئی ہے، کیونکہ اللہ تعالیٰ نے پہلے ان کے وہ اوصاف حمیدہ بیان کیے جو اس نے انھیں عطا فرمائے اور آخر میں صریح الفاظ میں ان کے راہِ راست پر ہونے کی شہادت دی۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {فَضْلًا مِّنَ اللّٰهِ وَ نِعْمَةً:} یہ {’’ الرّٰشِدُوْنَ ‘‘} کا مفعول لہ ہے، یعنی یہہ لوگ اللہ کے فضل اور اس کی نعمت کی وجہ سے کامل ہدایت والے ہیں۔ یہ {’’ حَبَّبَ ‘‘} اور {’’ كَرَّهَ ‘‘} کا مفعول لہ بھی ہو سکتا ہے۔ ¤ ➋ {وَ اللّٰهُ عَلِيْمٌ حَكِيْمٌ:} یعنی اللہ تعالیٰ نے اندھا دھند نہیں بلکہ اپنے کمال علم و حکمت کی بنا پر انھیں اپنے نبی صلی اللہ علیہ وسلم کی صحبت کے لیے منتخب فرمایا۔ ان کے دلوں میں ایمان کو محبوب و مزین کر دیا، کفر و فسوق اور عصیان کو ناپسندیدہ بنا دیا اور انھیں راہِ راست پر گامزن فرما دیا، کیونکہ وہ ان کی استعداد و اہلیت پوری طرح جانتا تھا اور اس کی حکمت کا تقاضا تھا کہ وہ انھیں اس مقام پر فائز فرمائے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {وَ اِنْ طَآىِٕفَتٰنِ مِنَ الْمُؤْمِنِيْنَ اقْتَتَلُوْا فَاَصْلِحُوْا بَيْنَهُمَا:} فاسق لوگوں کی خبر پر بلاتحقیق اعتماد کر لینے سے کئی دفعہ آپس میں لڑائی ہو جاتی ہے اور کئی دفعہ ہر قسم کی پیش بندی کے باوجود لڑائی ہو جاتی ہے۔ اس آیت میں یہ بتایا کہ مسلمانوں کی باہمی لڑائی کے موقع پر ان لوگوں پر لازم ہے جو اس لڑائی میں شریک نہیں کہ لڑنے والوں کے درمیان صلح کروا دیں۔ ان کے لیے جائز نہیں کہ مسلمانوں کو لڑتے ہوئے ان کے حال پر چھوڑ دیں اور تماشا دیکھتے رہیں۔ ¤ ➋ سہل بن سعد رضی اللہ عنہ سے روایت ہے : [ أَنَّ أَهْلَ قُبَاءٍ اقْتَتَلُوْا حَتّٰی تَرَامَوْا بِالْحِجَارَةِ فَأُخْبِرَ رَسُوْلُ اللّٰهِ صصَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ بِذٰلِكَ فَقَالَ اذْهَبُوْا بِنَا نُصْلِحْ بَيْنَهُمْ ] [بخاري، الصلح، باب قول الإمام لأصحابہ اذھبوا…: ۲۶۹۳ ] ’’قبا میں رہنے والے لڑ پڑے، حتیٰ کہ انھوں نے ایک دوسرے پر پتھر پھینکے۔ رسول اللہ صلی اللہ علیہ وسلم کو خبر ملی تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہمارے ساتھ چلو، تاکہ ہم ان کے درمیان صلح کروائیں۔‘‘ اور انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا گیا کہ اگر آپ عبد اللہ بن اُبی کے پاس جائیں تو بہتر ہے، تو آپ صلی اللہ علیہ وسلم گدھے پر سوار ہو کر گئے، مسلمان بھی آپ کے ساتھ پیدل چلنے لگے۔ وہ زمین شور والی تھی، جب رسول اللہ صلی اللہ علیہ وسلم اس کے پاس آئے تو وہ کہنے لگا: ’’مجھ سے دور رہو، اللہ کی قسم! تمھارے گدھے کی بدبو سے مجھے تکلیف ہو رہی ہے۔‘‘ ایک انصاری صحابی نے کہا : ’’اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم کے گدھے کی خوشبو تجھ سے اچھی ہے۔‘‘ عبد اللہ بن اُبی کی طرف سے اس کی قوم کا ایک آدمی غصے میں آ گیا اور دونوں نے ایک دوسرے کو برا بھلا کہا، پھر دونوں طرف سے دونوں کے حمایتی مشتعل ہو گئے اور چھڑی، ہاتھا پائی اور جوتوں کے ساتھ ایک دوسرے کو مارنے لگے۔ ہمیں یہ بات پہنچی ہے کہ یہ آیت اس موقع پر نازل ہوئی: « وَ اِنْ طَآىِٕفَتٰنِ مِنَ الْمُؤْمِنِيْنَ اقْتَتَلُوْا فَاَصْلِحُوْا بَيْنَهُمَا » [ بخاري، الصلح، باب ما جاء في الإصلاح بین الناس : ۲۶۹۱ ] ¤ ➌ قرطبی نے فرمایا: ’’طائفہ کا لفظ ایک آدمی پر، دو پر اور زیادہ پر بھی بولا جاتا ہے۔ {’’ طَآىِٕفَتٰنِ ‘‘} میں لڑنے والے دو آدمی بھی شامل ہیں اور دو جماعتیں بھی، چھوٹی ہوں یا بڑی۔ آیت میں لڑنے والے فریقوں کے درمیان صلح کروانے کا حکم ہے، خواہ دو مسلمان آپس میں لڑ رہے ہوں یا زیادہ۔‘‘ ¤ ➍ بعض احادیث میں کسی مسلمان سے لڑنے کو کفر اور لڑنے والوں کو کافر کہا گیا ہے، جیسا کہ عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ سِبَابُ الْمُسْلِمِ فُسُوْقٌ وَ قِتَالُهُ كُفْرٌ ] [ بخاري، الإیمان، باب خوف المؤمن من أن یحبط عملہ …: ۴۸ ] ’’مسلمان کو گالی دینا فسق ہے اور اس سے لڑنا کفر ہے۔‘‘ اور عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ انھوں نے نبی صلی اللہ علیہ وسلم سے سنا : [ لاَ تَرْجِعُوْا بَعْدِيْ كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ] [ بخاري، الفتن، باب قول النبي صلی اللہ علیہ وسلم : ’’ لا ترجعوا بعدي کفارا… ‘‘ : ۷۰۷۷ ] ’’میرے بعد پھر کافر نہ ہو جانا کہ ایک دوسرے کی گردنیں مارنے لگو۔‘‘ ¤ امام بخاری اور دوسرے ائمہ کرام نے فرمایا کہ آیت : «وَ اِنْ طَآىِٕفَتٰنِ مِنَ الْمُؤْمِنِيْنَ » دلیل ہے کہ مسلمان ایک دوسرے سے لڑنے کے باوجود مسلمان ہی رہتے ہیں، اسلام سے خارج یا مرتد نہیں ہو جاتے، کیونکہ اللہ تعالیٰ نے لڑنے والے دونوں فریقوں کو مومن قرار دیا ہے اور اس سے اگلی آیت میں بھی فرمایا : « اِنَّمَا الْمُؤْمِنُوْنَ اِخْوَةٌ فَاَصْلِحُوْا بَيْنَ اَخَوَيْكُمْ» [ الحجرات : ۱۰ ] ’’مومن تو (آپس میں) بھائی ہی ہیں، سو اپنے دو بھائیوں کے درمیان صلح کرا دو۔‘‘ اسی طرح آیت قصاص میں قاتل کو مقتول کے وارث کا بھائی قرار دیا، فرمایا : «فَمَنْ عُفِيَ لَهٗ مِنْ اَخِيْهِ شَيْءٌ فَاتِّبَاعٌۢ بِالْمَعْرُوْفِ وَ اَدَآءٌ اِللَيْهِ بِاِحْسَانٍ » [ البقرۃ : ۱۷۸] ’’پھر جسے اس کے بھائی کی طرف سے کچھ بھی معاف کر دیا جائے تو معروف طریقے سے پیچھا کرنا اور اچھے طریقے سے اس کے پاس پہنچا دینا (لازم) ہے۔‘‘ رہا حدیث میں مسلمان سے لڑائی کو کفر قرار دینا تو اس سے وہ کفر مراد نہیں جس کی وجہ سے آدمی اسلام سے خارج ہو جاتا ہے، بلکہ اس سے مراد ’’کفر دون کفر‘‘ یعنی کفر اکبر (جس سے انسان اسلام سے خارج ہوتا ہے) سے کم تر درجے کا کفر ہے، کیونکہ گناہ کے تمام کام کفر اور جاہلیت ہیں اور ایسے شخص کو کافر کہنے کا مطلب یہ ہے کہ اس نے کفر کے کام کا ارتکاب کیا ہے، اس کا ایمان کامل نہیں بلکہ وہ ناقص الایمان مومن ہے، یہ نہیں کہ وہ ملت اسلام سے خارج ہو گیا۔ دلیل اس کی زیر تفسیر آیت اور دوسری بہت سی آیات و احادیث ہیں جو امام بخاری نے اپنی صحیح کی ’’کتاب الایمان‘‘ میں اور دوسرے ائمہ نے اپنی تصانیف میں بیان فرمائی ہیں۔ اس آیت سے خوارج کے عقیدے کی نفی ہوتی ہے جو کسی بھی کبیرہ گناہ کے مرتکب کو، جس نے توبہ نہ کی ہو، کافر اور ابدی جہنمی سمجھتے ہیں اور معتزلہ کے عقیدے کی بھی جو کہتے ہیں کہ کبیرہ گناہ کا مرتکب نہ مومن ہے نہ کافر۔ انجام کے لحاظ سے وہ بھی اسے ابدی جہنمی قرار دیتے ہیں۔ ¤ ➎ {فَاِنْۢ بَغَتْ اِحْدٰىهُمَا عَلَى الْاُخْرٰى: ’’ بَغَتْ ‘‘ ’’ بَغٰي يَبْغِيْ بَغْيًا ‘‘} (ض) سے واحد مؤنث غائب ماضی معلوم ہے۔ اگر ان دو فریقوں میں سے ایک دوسرے پر زیادتی کرے، یعنی وہ کتاب و سنت کے فیصلے کے مطابق صلح پر اور اختلاف دور کرنے پر آمادہ ہی نہ ہو، بلکہ دوسرے پر چڑھتا چلا جائے اور ظلم و زیادتی پر کمر باندھ لے۔ ¤ ➏ { فَقَاتِلُوا الَّتِيْ تَبْغِيْ:} تو اس گروہ سے لڑو جو زیادتی کرتا ہے، کیونکہ اس لڑائی کا حکم اللہ نے دیا ہے، اس لیے یہ واجب ہے اور جہاد کے حکم میں ہے۔ اس حکم کے مخاطب وہ لوگ ہیں جو طاقت استعمال کرکے زیادتی کا ازالہ کرنے پر قادر ہوں۔ ¤ ➐ { حَتّٰى تَفِيْٓءَ اِلٰۤى اَمْرِ اللّٰهِ: ”تَفِيْءَ “ ’’فَائَ يَفِيْئُ فَيْئًا ‘‘} (ض) لوٹنا، پلٹنا۔ یہ واحد مؤنث غائب مضارع معلوم ہے۔ اللہ کے حکم کی طرف پلٹ آنے کا مطلب یہ ہے کہ جو بات کتاب و سنت کی رو سے حق ہے باغی گروہ اسے قبول کرنے پر آمادہ ہو جائے۔ اس سے یہ بھی معلوم ہوا کہ باغی گروہ سے لڑتے وقت یہ بات مدنظر رکھنی چاہیے کہ لڑنے سے مقصود انھیں صلح پر مجبور کرنا ہے، انھیں ختم کرنا یا ان کا نام و نشان مٹانا مقصود نہیں۔ ¤ ➑ یہ آیت مسلمانوں کی باہمی جنگ کے بارے میں شرعی فیصلوں کی بنیاد ہے۔ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں مسلمانوں کی آپس میں کوئی بڑی لڑائی نہیں ہوئی، چند موقعوں پر جھگڑا ہوا مگر نوبت ہاتھا پائی اور چھڑی جوتے سے آگے نہیں بڑھی۔ ان آیات کی عملی تفسیر اس وقت سامنے آئی جب علی رضی اللہ عنہ کے عہد خلافت میں مسلمانوں کی آپس میں لڑائیاں ہوئیں۔ اس وقت چونکہ رسول اللہ صلی اللہ علیہ وسلم کے تربیت یافتہ صحابہ کرام کثیر تعداد میں موجود تھے، جو قرآن و سنت کا علم بعدمیں آنے والے کسی بھی شخص سے زیادہ رکھتے تھے، اس لیے ان کے عمل اور ان کے بیان کردہ احکام سے قیامت تک کے مسلمانوں کے لیے ایک اسوہ اور ضابطہ مرتب ہو گیا۔ اس طرح یہ جنگیں ناگوار اور نہایت تکلیف دہ ہونے کے باوجود خیر سے خالی نہیں رہیں، کیونکہ اگر یہ نہ ہوتیں تو اللہ بہتر جانتا ہے کہ بعد میں آنے والے مسلمان آپس کی لڑائیوں میں ایک دوسرے پر کیا کیا ظلم و ستم کرتے۔ اس ضابطے کا ضروری خلاصہ یہ ہے : ¤ (1) جب لڑنے والے دو گروہ کسی مسلم حکومت کی رعایا ہوں اور عام مسلمان انھیں صلح پر آمادہ نہ کر سکیں تو ان کے درمیان صلح کرانا یا یہ فیصلہ کرنا کہ ان میں زیادتی کرنے والا گروہ کون ہے، پھر طاقت کے ذریعے سے اس کو حق پر مجبور کرنا حکومت کا فریضہ ہے۔ ¤ (2) لڑنے والے دونوں فریق بہت بڑے طاقتور گروہ ہوں، یا دو مسلمان حکومتیں ہوں اور دونوں کی لڑائی دنیا کی خاطر ہو تو اس صورت میں اہلِ ایمان کا کام یہ ہے کہ اس فتنے میں حصہ لینے سے قطعی اجتناب کریں اور دونوں فریقوں کو اللہ کا خوف دلا کر جنگ سے باز رکھنے کی کوشش کرتے رہیں۔ ¤ (3) مسلم حکومت کا تختہ الٹنے کے لیے رعایا کا کوئی گروہ اگر اس کے خلاف خروج کرے تو اس کی کئی قسمیں ہو سکتی ہیں، ایک یہ کہ مسلمانوں کا متفقہ حکمران موجود ہو اور اس کے خلاف خروج کرنے والوں کے پاس خروج کے لیے شرعی دلیل اور حکمرا ن کا کفر بواح یعنی کھلم کھلا کافر ہو جانا موجود نہ ہو، ایسے گروہ کے خلاف حکومت کی جنگ بالاتفاق جائز ہے اور اس کا ساتھ دینا ایمان والوں پر واجب ہے۔ قطع نظر اس سے کہ حکومت عادل ہو یا نہ ہو، کیونکہ عادل نہ ہونے کا بہانہ بنا کر کوئی بھی گروہ کسی بھی وقت حکومت کے خلاف خروج کر سکتا ہے، جس کا نتیجہ افتراق و انتشار اور کفار کو مسلمانوں پر حملے کی جرأت دلانے کے سوا کچھ نہیں ہوتا۔ ¤ دوسری قسم ظالم حکمران کے خلاف خروج ہے، جس کی امارت جبراً قائم ہوئی ہو اور جس کے امراء فاسق ہوں اور خروج کرنے والا گروہ عدل اور حدود اللہ کی اقامت کے لیے اٹھا ہو اور اس کا ظاہر حال یہ بتا رہا ہو کو وہ نیک لوگ ہیں۔ اہلِ سنت کا موقف یہ ہے کہ جس امیر کی امارت ایک دفعہ قائم ہو چکی ہو اور مملکت کا امن و امان اور نظم و نسق اس کے انتظام میں چل رہا ہو اس کے خلاف خروج کرنا حرام ہے، الا یہ کہ وہ کفرِ بواح کا ارتکاب کرے، یعنی کھلم کھلا کافر ہو جائے۔ امام نووی نے اس پر اجماع کا ذکر فرمایا ہے۔ بعض لوگ ایسے حکمران کے خلاف خروج کو جائز قرار دینے کی کوشش کرتے ہیں اور اس سلسلے میں اہلِ بیت کے بعض خروج کرنے والے حضرات کو بطور دلیل پیش کرتے ہیں اور بعض فقہاء کا نام بھی لیا جاتا ہے جنھوں نے مسلم حکمرانوں کے خلاف تلوار اٹھانے کو جائز قرار دیا، مگر محدثین اور جمہور فقہاء ان کے اس موقف کو غلط قرار دیتے ہیں، بلکہ اسے یہ موقف رکھنے والوں کے لیے باعثِ طعن قرار دیتے ہیں کہ {’’فُلَانٌ كَانَ يَرَي السَّيْفَ‘‘} کہ فلاں صاحب مسلمانوں کے خلاف تلوار اٹھانے کو جائز قرار دیتے تھے۔ امام احمد ابن حنبل اور دوسرے محدثین نے حکمرانوں کے بے حد ظلم و ستم کے باوجود ان کے خلاف نہ خروج کیا نہ خروج کو جائز رکھا۔ حقیقت یہ ہے کہ آپ پوری تاریخ اسلام پڑھ جائیں کسی خروج کے نتیجے میں مسلمانوں کو تَشتُّت و انتشار اور کفار سے جہاد کے رک جانے کے سوا کچھ حاصل نہیں ہوا، خواہ حکمران عادل تھا یا ظالم۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے حکمرانوں کے سامنے حق کہنے اور ان کو نصیحت کرنے کی تلقین فرمائی، مگر ان کے خلاف خروج سے سختی کے ساتھ منع فرما دیا۔ چند احادیث ملاحظہ فرمائیں، ابن عباس رضی اللہ عنھما روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ رَأٰی مِنْ أَمِيْرِهِ شَيْئًا يَكْرَهُهُ فَلْيَصْبِرْ، فَإِنَّهُ لَيْسَ أَحَدٌ يُفَارِقُ الْجَمَاعَةَ  شِبْرًا فَيَمُوْتُ إِلاَّ مَاتَ مِيْتَةً جَاهِلِيَّةً ] [بخاري، الأحکام، باب السمع والطاعۃ للإمام ما لکم تکن معصیۃ : ۷۱۴۳ ] ’’جو شخص اپنے امیر میں کوئی چیز دیکھے جو اسے بری لگے تو وہ صبر کرے، کیونکہ جو بھی شخص جماعت سے ایک بالشت جدا ہوا پھر فوت ہو تو وہ جاہلیت کی موت مرے گا۔‘‘ عبادہ بن صامت رضی اللہ عنہ بیان کرتے ہیں : [ دَعَانَا النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْنَاهُ فَقَالَ فِيْمَا أَخَذَ عَلَيْنَا أَنْ بَايَعَنَا عَلَی السَّمْعِ وَالطَّاعَةِ فِيْ مَنْشَطِنَا وَمَكْرَهِنَا وَعُسْرِنَا وَيُسْرِنَا وَأَثَرَةً عَلَيْنَا، وَ أَنْ لَا نُنَازِعَ الْأَمْرَ أَهْلَهُ إِلاَّ أَنْ تَرَوْا كُفْرًا بَوَاحًا عِنْدَكُمْ مِنَ اللّٰهِ فِيْهِ بُرْهَانٌ ] [بخاري، الفتن، باب قول النبي صلی اللہ علیہ وسلم : ’’ سترون بعدي أمور تنکرونھا ‘‘ : ۷۰۵۵،۷۰۵۶ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے ہمیں دعوت دی تو ہم نے آپ سے بیعت کی۔ آپ نے ہم سے جو عہد لیا اس میں یہ تھا کہ ہم نے بیعت کی سننے اور اطاعت کرنے پر، اپنی خوشی اور ناخوشی میں اور اپنی تنگی اور آسانی میں اور اپنے آپ پر دوسروں کو ترجیح دیے جانے پر بھی اور اس بات پر کہ ہم صاحب امر (حکمران) سے امارت میں جھگڑا نہیں کریں گے، الا یہ کہ تم صریح کفر دیکھو، جس کے متعلق تمھارے پاس اللہ کے ہاں واضح دلیل ہو۔‘‘ ¤ (4) علی رضی اللہ عنہ کا عمل اپنے خلاف جنگ کرنے والوں کو باغی سمجھنے اور ان سے لڑنے کے باوجود یہ تھا کہ وہ مسلمان ہیں، ان کے زخمیوں کو قتل نہیں کیا جائے گا، ان کے بھاگنے والوں کا پیچھا نہیں کیا جائے گا، ان کے اسیروں کو قتل نہیں کیا جائے گا، ان کی عورتوں اور بچوں کو لونڈی و غلام نہیں بنایا جائے گا، بلکہ ان کی آبرو کی حفاظت کی جائے گی اور ان کا مال غنیمت کے طور پر تقسیم نہیں کیا جائے گا۔ جنگِ جمل اور جنگِ صفین میں دونوں فریق ایک دوسرے کو مسلمان سمجھتے اور ایک دوسرے کا جنازہ پڑھتے تھے۔ احکام کی تفصیل اور دلائل کے لیے دیکھیے ’’المغنی‘‘ از ابن قدامہ میں {’’كِتَابُ قِتَالِ أَهْلِ الْبَغْيِ‘‘} اور دوسری کتب فقہ۔ ¤ ➒ { فَاِنْ فَآءَتْ فَاَصْلِحُوْا بَيْنَهُمَا بِالْعَدْلِ:} زیادتی کرنے والے گروہ کے اللہ کے حکم کی طرف پلٹ آنے پر دونوں گروہوں کے درمیان عدل کے ساتھ صلح کروانے کا حکم دیا، یہ نہیں کہ کسی فریق کی بے جا رعایت کرکے اور دوسرے کو دبا کر صرف لڑائی روکنے کے لیے صلح کروائی جائے، کیونکہ ایسی صلح نہ پائیدار ہوتی ہے، نہ اس سے آئندہ کے لیے لڑائی کا دروازہ بند ہوتا ہے۔ اس لیے ایک فریق پر دوسرے کا جو حق ثابت ہوتا ہے وہ اسے دلا کر عدل کے ساتھ صلح کروانی چاہیے۔ ¤ ➓ {وَ اَقْسِطُوْا:} یہاں ایک سوال ہے کہ اس سے پہلے فرمایا، دونوں کے درمیان انصاف کے ساتھ صلح کروا دو، پھر دوبارہ {’’ اَقْسِطُوْا ‘‘} کہنے میں کیا حکمت ہے؟ اس کا ایک جواب تو یہ ہے کہ لڑائی کے موقع پر بعض لڑنے والوں کے خلاف دل میں شدید نفرت پیدا ہو جاتی ہے، جس کی وجہ سے انسان درست فیصلہ نہیں کر سکتا، اس لیے تاکید کے لیے دوبارہ انصاف کا حکم دیا اور انصاف کرنے والوں کے لیے اللہ تعالیٰ کی محبت کی نوید سنائی۔ دوسرا جواب یہ ہے کہ پہلے جملے میں لڑنے والوں کے درمیان عدل کے ساتھ صلح کروانے کا حکم ہے اور {’’ اَقْسِطُوْا ‘‘} میں اپنے تمام معاملات میں انصاف سے کام لینے کا حکم ہے۔ انصاف کیا ہے؟ اس کے لیے دیکھیے سورۂ نحل (۹۰) کی تفسیر۔ ¤ ⓫ { اِنَّ اللّٰهَ يُحِبُّ الْمُقْسِطِيْنَ:} ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ سَبْعَةٌ يُظِلُّهُمُ اللّٰهُ تَعَالٰی فِيْ ظِلِّهِ يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ، إِمَامٌ عَدْلٌ… ] [ بخاري، الزکوٰۃ، باب الصدقۃ بالیمین : ۱۴۲۳ ] ’’سات آدمی ہیں جنھیں اللہ تعالیٰ اپنے سائے میں جگہ دے گا جس دن اس کے سائے کے سوا کوئی سایہ نہیں ہو گا۔ (سب سے پہلے جس کا ذکر فرمایا وہ ہے) عادل حکمران…۔‘‘ عبد اللہ بن عمرو رضی اللہ عنھما بیان کرتے ہہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ الْمُقْسِطِيْنَ عِنْدَ اللّٰهِ عَلٰی مَنَابِرَ مِنْ نُوْرٍ عَنْ يَمِيْنِ الرَّحْمٰنِ عَزَّ وَجَلَّ وَكِلْتَا يَدَيْهِ يَمِيْنٌ الَّذِيْنَ يَعْدِلُوْنَ فِيْ حُكْمِهِمْ وَأَهْلِيْهِمْ وَمَا وَلُوْا ] [ مسلم، الإمارۃ، باب فضیلۃ الإمام العادل… : ۱۸۲۷ ] ’’انصاف کرنے والے اللہ کے پاس نور کے منبروں پر رحمان عز و جل کی دائیں جانب ہوں گے اور اس کے دونوں ہاتھ دائیں ہیں۔ یہ وہ لوگ ہیں جو اپنے فیصلوں میں اور اپنے گھر والوں میں اور جس کے ذمہ دار ہیں سب میں انصاف کرتے ہیں۔‘‘"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {اِنَّمَا الْمُؤْمِنُوْنَ اِخْوَةٌ :} لڑائی سے باز رکھنے کا سب سے مؤثر ذریعہ لڑنے والوں کو قرابت کا احساس دلانا ہے کہ دیکھو تم کس سے لڑ رہے ہو؟ اپنے ہی بھائی سے، یہ کتنی بری بات ہے۔ اس لیے اللہ تعالیٰ نے مسلمانوں کو ان کی دینی قرابت کا احساس دلایا، جو نسبی قرابت سے بھی زیادہ مضبوط ہے۔ اسلام کی آمد سے پہلے جو لوگ نسبی قرابت کے باوجود ایک دوسرے کے شدید دشمن تھے، جیسا کہ اوس اور خزرج کا معاملہ تھا، اللہ کی نعمت سے اسلام کی بدولت بھائی بھائی بن گئے۔ (دیکھیے آل عمران :۱۰۳) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: [ اَلْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ، وَلاَ يُسْلِمُهُ ] [ بخاري، المظالم، باب لا یظلم المسلم المسلم ولایسلمہ : ۲۴۴۲، عن ابن عمر رضی اللہ عنھما ] ’’مسلمان مسلمان کا بھائی ہے، نہ اس پر ظلم کرتا ہے اور نہ اسے بے یار و مددگار چھوڑتا ہے۔‘‘ ¤ ➋ {فَاَصْلِحُوْا بَيْنَ اَخَوَيْكُمْ: ’’أَخٌ‘‘} کا تثنیہ {’’أَخَوَانِ‘‘} اور {’’أَخَوَيْنِ‘‘} ہے جو {’’كُمْ‘‘} کی طرف مضاف ہوا تو نون اعرابی گر گیا اور {’’أَخَوَيْ‘‘} باقی رہا جو {’’كُمْ‘‘} کے ساتھ مل کر {’’ اَخَوَيْكُمْ ‘‘} ہو گیا، سو اپنے دو بھائیوں کے درمیان صلح کروا دو، وہ دو خواہ ایک ایک فرد ہوں یا ایک ایک جماعت ہوں۔ ¤ ➌ { وَ اتَّقُوا اللّٰهَ لَعَلَّكُمْ تُرْحَمُوْنَ:} یعنی صلح کرواتے وقت اس بات کو ملحوظ رکھو کہ تم اپنے دو بھائیوں کے درمیان صلح کروا رہے ہو، جن کا تمھارے ساتھ بھی اخوت کا رشتہ ہے۔ لہٰذا اس رشتے کا خیال رکھو اور پوری طرح عدل و انصاف کے ساتھ اللہ تعالیٰ سے ڈرتے ہوئے اس طرح صلحح کرواؤ کہ نہ کسی فریق کی حق تلفی ہو اور نہ کسی پر زیادتی ہو۔ اگر تم اللہ سے ڈرتے ہوئے یہ فریضہ سرانجام دو گے تو یقینا اللہ تعالیٰ تم پر رحم فرمائے گا۔ {’’لَعَلَّ‘‘} کا لفظ امید دلانے کے لیے ہوتا ہے، مگر بڑے لوگوں کے کلام میں اس سے یقین حاصل ہوتا ہے، کیونکہ امید دلا کر اسے پورا نہ کرنا ان کی شان کے لائق نہیں ہوتا۔ پھر جو شاہوں کا شاہ اور ساری کائنات کا مالک ہے وہ امید دلائے تو اس کے یقینی ہونے میں کیا شبہ ہے؟ اس کے علاوہ {’’لَعَلَّ‘‘} کا لفظ ’’تاکہ‘‘ کے معنی میں بھی آتا ہے۔ مطلب یہ کہ اللہ تعالیٰ کا رحم انھی لوگوں پر ہوتا ہے جو اس سے ڈرتے ہیں، اس لیے بھائیوں کے درمیان صلح کرواتے ہوئے اللہ تعالیٰ سے ڈرو اور عدل کے ساتھ صلح کرواؤ، تاکہ تم پر اللہ کا رحم ہو۔ ¤ ➍ یہ آیت دنیا بھر کے مسلمانوں کو ایک برادری میں منسلک کر دیتی ہے۔ مسلمان خواہ دنیا کے کسی دوسرے کونے میں ہو، دوسرے سب مسلمان اسے بھائی سمجھتے ہیں۔ اسلام کے سوا ایسا رشتہ اور کہیں نہیں پایا جاتا۔ (کیلانی)"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا … :} گزشتہ آیات میں مسلمانوں کے آپس میں لڑنے کی صورت میں ان کے درمیان صلح کروانے کا حکم دیا، اس سے پہلے بلاتحقیق خبر پر عمل سے منع فرمایا تھا، کیونکہ اس سے لڑائی پیدا ہو سکتی ہے اور لاعلمی میں نقصان پہنچانے کا باعث بن سکتی ہے۔ یہاں سے مزید ان چیزوں سے منع فرمایا جو اسلامی اخوت کو نقصان پہنچاتی ہیں اور باہمی عداوت اور لڑائی کا باعث بنتی ہیں۔ اس آیت میں ایسی تین چیزیں ذکر فرمائیں : (1) کسی کا مذاق اڑانا۔ (2) کسی پر عیب لگانا۔ (3) کسی کو برے لقب سے پکارنا۔ ¤ ➋ { لَا يَسْخَرْ قَوْمٌ مِّنْ قَوْمٍ: ’’سَخِرَ يَسْخَرُ سَخَرًا وَسَخْرًا وَ سُخْرًا وَ سِخْرًا وَ سُخْرَةً و مَسْخَرًا بِهٖ وَ مِنْهُ ‘‘} (ع) استہزا، مذاق اڑانا، ٹھٹھا کرنا، وہ ہنسی جس سے دوسرے کی تحقیر اور دل آزاری ہو۔ وہ ہنسی جس سے دوسرے کا دل خوش ہو وہ مزاح کہلاتی ہے، وہ جائز ہے بلکہ مسنون ہے۔ کشاف میں ہے : ’’قوم کا لفظ مردوں کے ساتھ خاص ہے، کیونکہ مرد عورتوں کے ’’قوام‘‘ ہوتے ہیں، جیسا کہ شاعر نے کہا ہے: ¤ {وَلَا أَدْرِيْ وَ سَوْفَ إِخَالُ أَدْرِيْ ¤ أَقَوْمٌ آلُ حِصْنٍ أَمْ نِسَاءُ} ¤ ’’اور میں نہیں جانتا اور میرا خیال ہے کہ میں جلد ہی جان لوں گا کہ آلِ حصن قوم (یعنی مرد) ہیں یا عورتیں۔‘‘ ¤ یہ آیت بھی اس بات کی دلیل ہے، کیونکہ قوم کو ٹھٹھا کرنے سے منع کرنے کے بعد عورتوں کو اس سے منع فرمایا ہے۔ رہی یہ بات کہ قرآن میں مذکور قومِ فرعون اور قومِ ثمود وغیرہ میں مرد اور عورتیں دونوں شامل ہیں تو اصل یہ ہے کہ وہاں مردوں کے ذکر پر اکتفا کیا گیا ہے، کیونکہ عورتیں ان کے تابع ہیں۔ ¤ ➌ پہلی چیز جس سے منع فرمایا وہ کسی کا مذاق اڑانا یا تمسخر ہے، کیونکہ اس سے دلوں میں شدید بغض پیدا ہوتا ہے۔ جس کا مذاق اڑایا جائے وہ اسے اپنی تذلیل سمجھ کر ہر وقت انتقام کے موقع کی تلاش میں رہتا ہے اور ظاہر ہے انتقام میں بات کہاں سے کہاں تک جا پہنچتی ہے۔ کوئی شخص کسی کا ٹھٹھا اسی وقت اڑاتا ہے جب وہ اپنے آپ کو اس سے بہتر اور اس کو اپنے سے حقیر اور کمتر سمجھتا ہے اور یہ سمجھنا تکبر ہے، جس پر شدید وعید آئی ہے۔ عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِيْ قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ، قَالَ رَجُلٌ إِنَّ الرَّجُلَ يُحِبُّ أَنْ يَكُوْنَ ثَوْبُهُ حَسَنًا وَنَعْلُهُ حَسَنَةً، ، قَالَ إِنَّ اللّٰهَ جَمِيْلٌ يُحِبُّ الْجَمَالَ، الْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ ] [ مسلم، الإیمان، باب تحریم الکبر و و بیانہ : ۹۱ ] ’’وہ شخص جنت میں داخل نہیں ہو گا جس کے دل میں ذرہ برابر تکبر ہو گا۔‘‘ ایک آدمی نے کہا: ’’آدمی پسند کرتا ہے کہ اس کا کپڑا اچھا ہو اور اس کا جوتا اچھا ہو(تو کیا یہ بھی تکبر ہے)؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’بے شک اللہ جمیل ہے اور جمال کو پسند کرتا ہے۔ تکبر تو حق کے انکار اور لوگوں کو حقیر جاننے کا نام ہے۔‘‘ یہاں قوم کو قوم کا مذاق اڑانے سے منع فرمایا، کیونکہ عموماً کسی مجلس ہی میں کسی کا مذاق اڑایا جاتا ہے، ورنہ اکیلے کا مذاق اڑانا بھی منع ہے۔ ¤ ➍ { عَسٰۤى اَنْ يَّكُوْنُوْا خَيْرًا مِّنْهُمْ:} مذاق اڑانے سے منع کرنے کی وجہ بیان فرمائی کہ جسے تم حقیر سمجھ کر ذلیل کر رہے ہو، ہو سکتا ہے وہ اللہ کے ہاں تم سے بہتر ہو، کیونکہ اچھا یا برا ہونے کا دارومدار ظاہری شکل و صورت پر نہیں، بلکہ دل کے تقویٰ پر ہے اور اس کا علم صرف اللہ تعالیٰ کو ہے۔ پھر دار و مدار موجودہ حالت پر نہیں بلکہ خاتمے پر ہے، تمھیں کیا معلوم کہ اس کا خاتمہ تم سے اچھا ہو جسے تم حقیر سمجھ کر ذلیل کر رہے ہو۔ ¤ ➎ { وَ لَا نِسَآءٌ مِّنْ نِّسَآءٍ عَسٰۤى اَنْ يَّكُنَّ خَيْرًا مِّنْهُنَّ:} قرآن مجید میں عموماً احکام کے لیے مردوں ہی کو مخاطب کیا گیا ہے، عورتوں کا ذکر تابع ہونے کی وجہ سے الگ نہیں کیا گیا۔ یہاں عورتوں کو الگ بھی خطاب فرمایا، اس سے ظاہر ہے کہ عورتوں کو اس گناہ سے روکنے کی خاص ضرورت ہے۔ یہاں ایک سوال ہے کہ اس آیت میں مردوں کو مردوں سے اور عورتوں کو عورتوں سے ٹھٹھا کرنے سے منع فرمایا تو کیا مرد عورتوں سے یا عورتیں مردوں سے ٹھٹھا کر سکتی ہیں؟ جواب اس کا یہ ہے کہ مسلم معاشرہ میں مردوں اور عورتوں کے ملے جلے معاشرے کی گنجائش ہی نہیں، جس میں وہ ایک دوسرے کا بے تکلف مذاق اڑا سکیں۔ یہاں مردوں اور عورتوں کی مجلسیں الگ الگ ہوتی ہیں، اس لیے دونوں کو الگ الگ منع فرمایا۔ ¤ ➏ مذاق خواہ زبان کے ساتھ اڑایا جائے یا کسی کے نقص کی طرف اشارہ کرکے یا نقل اتار کر، ہر طرح کا مذاق حرام ہے۔ عائشہ رضی اللہ عنھا بیان کرتی ہیں کہ میں نے نبی صلی اللہ علیہ وسلم سے کہا : [ حَسْبُكَ مِنْ صَفِيَّةَ كَذَا وَكَذَا، قَالَ غَيْرُ مُسَدَّدٍ تَعْنِيْ قَصِيْرَةً، فَقَالَ لَقَدْ قُلْتِ كَلِمَةً لَوْ مُزِجَتْ بِمَاءِ الْبَحْرِ لَمَزَجَتْهُ قَالَتْ وَحَكَيْتُ  لَهُ إِنْسَانًا فَقَالَ مَا أُحِبُّ أَنِّيْ حَكَيْتُ إِنْسَانًا وَ إِنَّ لِيْ كَذَا وَكَذَا] [ أبوداوٗد، الأدب، باب في الغیبۃ : ۴۸۷۵، وقال الألباني صحیح ] ’’آپ کو صفیہ سے یہی کچھ کافی ہے کہ وہ ایسے ایسے ہے۔‘‘ مسدد کے علاوہ دوسرے راوی نے وضاحت کی کہ مراد ان کے قد کا چھوٹا ہونا تھا۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یقینا تم نے ایسی بات کی ہے کہ اگر سمندر کے پانی میں ملا دی جائے تو سارے پانی کو خراب کر دے۔‘‘ عائشہ رضی اللہ عنھا نے بیان کیا: ’’اور میں نے آپ کے سامنے کسی انسان کی نقل اتاری ( تو اس کا کیا حکم ہے)؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’میں پسند نہیں کرتا کہ میں کسی انسان کی نقل اتاروں، خواہ مجھے یہ یہ کچھ مل جائے۔‘‘ ¤ ➐ { وَ لَا تَلْمِزُوْۤا اَنْفُسَكُمْ: ’’لَمَزَ يَلْمِزُ لَمْزًا‘‘} (ض،ن)کسی پر عیب لگانا، خفی کلام کے ساتھ آنکھ کا اشارہ کرنا، دھکا دینا، مارنا۔ مزید دیکھیے سورۂ ہمزہ کی آیت (۱) : « وَيْلٌ لِّكُلِّ هُمَزَةٍ لُّمَزَةٍ» کی تفسیر۔ اللہ تعالیٰ نے یہ کہنے کے بجائے کہ کسی پر عیب نہ لگاؤ، یہ فرمایا کہ اپنے آپ پر عیب نہ لگاؤ، جیسا کہ فرمایا : « وَ لَا تَقْتُلُوْۤا اَنْفُسَكُمْ» [النساء: ۲۹] ’’اپنے آپ کو قتل نہ کرو۔‘‘ اس کی ایک وجہ یہ ہے کہ تمام مسلمان {’’كَالْجَسَدِ الْوَاحِدِ‘‘} (ایک جسم کی مانند) ہیں، عیب لگانے والے کو یہ بات یاد رکھنی چاہیے کہ جب وہ کسی مسلم بھائی پر عیب لگا رہا ہے تو درحقیقت وہ اپنے آپ ہی پر عیب لگا رہا ہے، سو اسے ایسا نہیں کرنا چاہیے۔ دوسری وجہ یہ ہے کہ جب یہ دوسروں پر عیب لگائے گا تو عیب سے خالی تو یہ بھی نہیں اور دوسروں کی آنکھیں بھی ہیں اور زبان بھی، پھر اس کے عیوب بھی ظاہر کیے جائیں گے، اس لیے اللہ تعالیٰ نے فرمایا: ’’اپنے آپ پر عیب مت لگاؤ۔‘‘ اس آیت میں لوگوں کے سامنے کسی کے عیب ظاہر کرنے اور ان کا طعنہ دینے سے منع فرمایا، اگلی آیت میں کسی کی عدم موجودگی میں اس کے عیب ذکر کرنے یعنی غیبت سے بھی منع کیا۔ صرف ایک بات کی اجازت ہے اور وہ ہے نصیحت کہ اپنے بھائی کو الگ لے جا کر اسے اس کی غلطی بتا کر درست کرنے کی نصیحت کرے، جس طرح آئینہ غلطی بتاتا ہے مگر شور نہیں ڈالتا۔ لوگوں کے سامنے کسی مسلم کے منہ پر یا اس کی عدم موجودگی میں اس کے عیب کا اظہار کرنے کے بجائے اس پر پردہ ڈالنے کا حکم ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْمُسْلِمُ أَخُو الْمُسْلِمِ، لاَ يَظْلِمُهُ وَلاَ يُسْلِمُهُ، وَمَنْ كَانَ فِيْ حَاجَةِ أَخِيْهِ كَانَ اللّٰهُ فِيْ حَاجَتِهِ، وَمَنْ فَرَّجَ عَنْ مُّسْلِمٍ كُرْبَةً فَرَّجَ اللّٰهُ عَنْهُ كُرْبَةً مِّنْ كُرُبَاتِ يَوْمِ الْقِيَامَةِ، وَ مَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللّٰهُ يَوْمَ الْقِيَامَةِ ] [ بخاري، المظالم، باب لا یظلم المسلم المسلم ولایسلمہ : ۲۴۴۲، عن ابن عمر رضی اللہ عنھما ] ’’مسلمان مسلمان کا بھائی ہے، نہ اس پر ظلم کرتا ہے اور نہ اسے بے یارو مددگار چھوڑتا ہے اور جو شخص اپنے بھائی کے کام میں ہو اللہ اس کے کام میں ہوتا ہے اور جو کسی مسلم سے کوئی تکلیف دور کرے اللہ تعالیٰ قیامت کی تکلیفوں میں سے کوئی تکلیف اس سے دور فرمائے گا اور جو کسی مسلم پر پردہ ڈالے، اللہ تعالیٰ اس پر پردہ ڈالے گا۔‘‘ ¤ ➑ { وَ لَا تَنَابَزُوْا بِالْاَلْقَابِ: ’’اَلنَّبَزُ‘‘} (نون اور باء کے فتحہ کے ساتھ) برے لقب کو کہتے ہیں، مثلاً لنگڑا، لولا، اندھا، کالا، ٹھگنا، کبڑا، گدھا، لومڑ یا کوئی بھی نام جس سے کسی کو تکلیف ہوتی ہو، مثلاً کسی سے کوئی گناہ ہوا ہو، تائب ہونے کے بعد عار دلانے کے لیے اسے چور یا زانی یا شرابی کہہ کر پکارنا۔ لقب ایسے نام کو کہتے ہیں جس سے کسی خوبی یا خامی کا اظہار ہوتا ہو، خواہ آدمی نے خود اپنے لیے رکھ لیا ہو یا کسی دوسرے نے رکھ دیا ہو۔ یہاں {’’ وَ لَا تَنَابَزُوْا ‘‘} کے قرینے سے لقب سے مراد برا نام ہے، کیونکہ اچھے القاب سے پکارنا تو قابلِ تعریف ہے، جیسے ابوبکر صدیق، عمر فاروق، حمزہ اسد اللہ، خالد سیف اللہ، ابوعبیدہ امین الامت، حذیفہ صاحب سر رسول اللہ، عبد اللہ بن مسعود صاحب المطہرۃ والوسادۃ والنعلین( رضی اللہ عنھم )۔ اس کے علاوہ عرب کا طریقہ اکرام کرتے ہوئے کنیت کے ساتھ پکارنے کا تھا، جسے اسلام نے برقرار رکھا۔ مومن کا حق یہ ہے کہ اسے اس نام سے پکارا جائے جو اسے اپنے لیے سب سے زیادہ پسند ہو، کیونکہ یہ محبت پیدا کرنے اور اسے قائم رکھنے کا باعث ہے۔ {’’ وَ لَا تَنَابَزُوْا بِالْاَلْقَابِ ‘‘} یعنی کوئی شخص کسی دوسرے کا برا نام نہ رکھے جس سے وہ ناراض ہو، یا اس کی توہین و تذلیل ہوتی ہو اور نہ ایسے نام کے ساتھ اسے آواز دے کر پکارے۔ جاہلیت میں یہ بات عام تھی کہ ایک شخص نے دوسرے کا برا لقب رکھا تو اس نے اس کا رکھ دیا۔ اللہ تعالیٰ نے اس سے منع فرما دیا۔ ¤ ابوجبیرہ بن ضحاک رضی اللہ عنہ بیان کرتے ہیں : ’’آیت : « وَ لَا تَنَابَزُوْا بِالْاَلْقَابِ بِئْسَ الِاسْمُ الْفُسُوْقُ بَعْدَ الْاِيْمَانِ » ہم بنو سلمہ  کے بارے میں نازل ہوئی۔ رسول اللہ صلی اللہ علیہ وسلم مدینہ میں آئے تو ہم میں سے ہر آدمی کے دو دو، تین تین نام تھے۔ نبی صلی اللہ علیہ وسلم کسی کو کوئی نام لے کر بلاتے تو لوگ کہتے: ’’یا رسول اللہ! اسے اس نام سے نہ بلائیں، کیونکہ وہ اس سے ناراض ہوتا ہے۔‘‘ تو اس پر یہ آیت : « وَ لَا تَنَابَزُوْا بِالْاَلْقَابِ » اتری۔‘‘ [ أبوداوٗد، الأدب، باب في الألقاب :۴۹۶۲ ] ¤ ➒ اس حکم سے وہ القاب مستثنیٰ ہیں جو کسی کی پہچان بن چکے ہوں، نہ اس نام والا اسے برا سمجھتا ہو اور نہ اس سے مقصود تحقیر یا تذلیل ہو، بلکہ مقصود صرف تعارف ہو، جیسے سلیمان الاعمش (چندھیائی ہوئی آنکھوں والا)، واصل الاحدب (کبڑا)، حمید الطویل (لمبا)، ابوہریرہ اور ذوالیدین وغیرہ۔ ¤ ➓ { بِئْسَ الِاسْمُ الْفُسُوْقُ بَعْدَ الْاِيْمَانِ:} اس سے معلوم ہوا کہ اوپر جن چیزوں سے روکا گیا ہے وہ سب فسوق ہیں۔ مقصد یہ ہے کہ جو شخص ان کاموں کا ارتکاب کرے وہ مومن ہونے کے باوجود فاسق ہے اور یہ بہت بری بات ہے کہ آدمی کا نام فاسق رکھا جائے، اس کے بعد کہ اس کا نام مومن ہے۔ {’’ بَعْدَ الْاِيْمَانِ ‘‘} (ایمان کے بعد) اس لیے فرمایا کہ اگر تم ایمان کا شرف حاصل نہ کر چکے ہوتے تو فاسق یا بدمعاش کہلانے میں عار کی کوئی خاص بات نہ تھی، لیکن اب ایمان لے آنے کے بعد یہ نام تم پر آنا بہت بری بات ہے۔ تمھیں یہ بات مدنظر رکھنی چاہیے کہ اب تم وہ ہو جن کے متعلق اللہ تعالیٰ نے فرمایا : « وَ لٰكِنَّ اللّٰهَ حَبَّبَ اِلَيْكُمُ الْاِيْممَانَ وَ زَيَّنَهٗ فِيْ قُلُوْبِكُمْ وَ كَرَّهَ اِلَيْكُمُ الْكُفْرَ وَ الْفُسُوْقَ وَ الْعِصْيَانَ » [ الحجرات : ۷ ] ’’اور لیکن اللہ نے تمھارے لیے ایمان کو محبوب بنا دیا اور اسے تمھارے دلوں میں مزین کر دیا اور اس نے کفر اور گناہ اور نافرمانی کو تمھارے لیے ناپسندیدہ بنا دیا۔‘‘ تو تمھیں ہر ایسے کام سے اجتناب کرنا چاہیے جس سے تم پر فسق کا نام آئے۔ ¤ ⓫ {وَ مَنْ لَّمْ يَتُبْ فَاُولٰٓىِٕكَ هُمُ الظّٰلِمُوْنَ:} ’’الف لام‘‘ کمال کا ہے، یعنی اگرچہ جو بھی گناہ کرے ظالم ہے مگر توبہ سے اس ظلم کی تلافی ہو جاتی ہے۔ اصل ظالم وہی ہیں جو گناہوں پر اصرار کرتے ہیں اور توبہ کیے بغیر فوت ہو جاتے ہیں۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا اجْتَنِبُوْا … :} پچھلی آیت میں مسلمانوں کے باہمی تعلقات خراب کرنے والی ایسی چیزوں سے منع فرمایا تھا جو ایک دوسرے کے سامنے ظاہر ہوتی ہیں، یعنی مذاق اڑانا، عیب لگانا اور برے نام سے پکارنا، اب ان تین چیزوں سے منع فرمایا جو دوسرے بھائیوں سے تعلق رکھتی ہیں مگر انھیں ان کی خبر ہی نہیں ہوتی۔ وہ ہیں بدگمانی، جاسوسی اور غیبت۔ یہ تینوں کام انتہائی کمینگی اور بزدلی کے کام ہیں، کیونکہ انھیں کرنے والے میں جرأت ہی نہیں ہوتی کہ وہ لوگوں کے سامنے آ سکے۔ یہ اس سورت کی پانچویں آیت ہے جس کا آغاز {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا ‘‘} سے ہوا ہے۔ مقصد یہ ہے کہ یہ تینوں کام ایمان اور اس کے دعوے کے منافی ہیں، اس لیے ان سے بچ جاؤ۔ ¤ ➋ { اجْتَنِبُوْا كَثِيْرًا مِّنَ الظَّنِّ … :} پہلی بات یہ فرمائی کہ اس چیز سے بچو کہ کسی کے متعلق جو سنو یا دیکھو اس سے اس کے متعلق برا گمان ہی قائم کر لو، بلکہ جہاں تک ہو سکے مومن کے تمام اقوال و اعمال کے متعلق اچھا گمان رکھنے کی کوشش کرو، کیونکہ بعض گمان بالکل بے بنیاد اور گناہ ہوتے ہیں۔ اس لیے زیادہ گمان سے بچو، کیونکہ اس کا نتیجہ ایسے گمانوں میں پڑ جانا ہے جو گناہ ہیں۔ یہاں اللہ تعالیٰ نے بعض گمانوں کو گناہ قرار دیا ہے، سب گمانوں کو نہیں، کیونکہ ظن کی کئی قسمیں ہیں۔ ایک ظن غالب ہے، جو کسی دلیل یا مضبوط علامت کے ساتھ قوی ہو جائے، اس پر عمل کرنا درست ہے۔ شریعت کے اکثر احکام اس پر مبنی ہیں اور دنیا کے تقریباً تمام کام اسی پر چلتے ہیں، مثلاً عدالتوں کے فیصلے، گواہوں کی گواہی، باہمی تجارت، ٹیلی فون اور خطوط کے ذریعے سے اطلاعات اور خبرِ واحد کے راویوں کی روایات۔ ان سب چیزوں میں غور وفکر، جانچ پڑتال اور پوری کوشش سے حاصل ہونے والا علم بھی ظن غالب ہے، مگر اس پر عمل واجب ہے۔ اسے ظن اس لیے کہتے ہیں کہ اس کی مخالف جانب کا یعنی اس کے درست نہ ہونے کا نہایت ادنیٰ سا امکان رہتا ہے، مثلاً ہو سکتا ہے کہ گواہ کی گواہی درست نہ ہو، اطلاع دینے والا جھوٹ بول رہا ہو، یا راوی کو غلطی لگی ہو، مگر اس امکان کا کوئی اعتبار نہیں۔ اس امکان پر جائیں تو دنیا کا کوئی کام ہو ہی نہ سکے۔ اس لیے اپنی پوری کوشش کے بعد دلائل سے جو علم حاصل ہو اس پر بھی اگرچہ ظن کا لفظ بول لیا جاتا ہے مگر درحقیقت یہ علم ہی ہے اور اس پر عمل واجب ہے۔ ¤ ظن کی ایک قسم یہ ہے کہ کسی وجہ سے دل میں ایک خیال آ کر ٹھہر جاتا ہے مگر اس کی کوئی دلیل نہیں ہوتی۔ دلیل نہ ہونے کی وجہ سے دل میں اس کے ہونے یا نہ ہونے کا امکان برابر ہوتا ہے، اسے شک بھی کہتے ہیں، یا اس کے ہونے کا امکان اس کے نہ ہونے کے امکان سے کم ہوتا ہے، یہ وہم کہلاتا ہے۔ ظن کی یہ صورتیں مذموم ہیں اور ان سے اجتناب واجب ہے۔ {’’ اِنَّ بَعْضَ الظَّنِّ اِثْمٌ ‘‘} (بے شک بعض گمان گناہ ہیں) سے یہی مراد ہیں اور اللہ تعالیٰ کے فرمان: « اِنَّ الظَّنَّ لَا يُغْنِيْ مِنَ الْحَقِّ شَيْـًٔا » [  یونس : ۳۶ ] (بے شک گمان حق کے مقابلے میں کچھ فائدہ نہیں دیتا) اور اللہ کے فرمان : « اِنْ يَّتَّبِعُوْنَ اِلَّا الظَّنَّ وَ مَا تَهْوَى الْاَنْفُسُ» [ النجم : ۲۳ ] ( یہ لوگ صرف اپنے گمان کی اور اپنی خواہشات کی پیروی کر رہے ہیں) میں اسی ظن کا ذکر ہے اور اسی کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِيَّاكُمْ وَالظَّنَّ، فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيْثِ ] [ بخاري، الأدب، باب : «یأیھا الذین آمنوا اجتنبوا کثیرا من الظن…» : ۶۰۶۶ ] ’’گمان سے بچو! کیونکہ گمان سب سے جھوٹی بات ہے۔‘‘ اسے سب سے جھوٹی بات اس لیے کہا گیا کہ جب کوئی شخص کسی کے متعلق بدگمانی کرتا ہے تو وہ دلیل کے بغیر فیصلہ کر لیتا ہے کہ وہ شخص ایسا ایسا ہے۔ چونکہ حقیقت میں وہ شخص ایسا نہیں ہوتا، اس لیے اس کے اس فیصلے کو جھوٹ کہا گیا ہے اور سب سے بڑا جھوٹ اس لیے کہ اس نے بغیر کسی قرینے یا سبب کے محض نفس یا شیطان کے کہنے پر اسے براقرار دے لیا، جب کہ اس کے برے ہونے کی کوئی بنیاد ہی نہیں۔ ¤ ➌ آیت میں ایسے گمان سے بچنے کا حکم دیا گیا ہے جو بے دلیل ہو، مثلاً ایک آدمی جو ظاہر میں صالح ہے، اس کے عیوب پر اللہ کی طرف سے پردہ پڑا ہوا ہے، عام مشاہدہ میں وہ عفیف اور امانت دار ہے اور اس کے بددیانت یا گناہ گار ہونے کی کوئی دلیل یا علامت موجود نہیں، اس کے متعلق بدگمانی کرنا حرام ہے۔ ہاں، اگر گمان کرنے کی کوئی واقعی دلیل یا علامت موجود ہے تو اس وقت گمان منع نہیں۔ مثلاً ایک شخص کا اٹھنا بیٹھنا ہی ان لوگوں کے ساتھ ہے جو چوری یا زنا کے ساتھ معروف ہیں، یا رات کو وہاں پھرتا ہے جہاں اس کا کوئی کام نہیں، اس کے متعلق گمان پیدا ہونا فطری بات ہے، اس لیے اللہ تعالیٰ نے ہر گمان سے منع نہیں فرمایا، بلکہ فرمایا : «اجْتَنِبُوْا كَثِيْرًا مِّنَ الظَّنِّ اِنَّ بَعْضَ الظَّنِّ اِثْمٌ » ’’بہت سے گمان سے بچو، کیونکہ بعض گمان گناہ ہیں۔‘‘ امام بخاری رحمہ اللہ نے اپنی صحیح بخاری میں فرمایا : {’’بَابُ مَا يَجُوْزُ مِنَ الظَّنِّ‘‘} ’’وہ گمان جو جائز ہیں۔‘‘ اور اس باب میں عائشہ رضی اللہ عنھا سے حدیث ذکر کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا أَظُنُّ فُلاَنًا وَ فُلاَنًا يَعْرِفَانِ مِنْ دِيْنِنَا شَيْئًا قَالَ اللَّيْثُ كَانَا رَجُلَيْنِ مِنَ الْمُنَافِقِيْنَ ] [ بخاري، الأدب، باب ما یجوز من الظن … : ۶۰۶۷ ] ’’میں فلاں اور فلاں کے متعلق گمان نہیں کرتا کہ وہ ہمارے دین میں سے کچھ بھی جانتے ہیں۔‘‘ لیث نے فرمایا : ’’یہ دونوں آدمی منافق تھے۔‘‘ اس جائز گمان سے مراد وہ گمان ہے جس کی علامات یا دلیلیں واضح ہوں۔ ¤ ➍ جس طرح دوسرے مسلمان کے حق میں بدگمانی کرنا منع ہے اسی طرح خود مسلمان کو بھی لازم ہے کہ ایسے ہر کام سے اجتناب کرے جس سے کسی کے دل میں اس کے متعلق برا گمان پیدا ہو۔ علی بن حسین بیان کرتے ہیں کہ انھیں رسول اللہ صلی اللہ علیہ وسلم کی بیوی صفیہ رضی اللہ عنھا نے خبر دی کہ نبی صلی اللہ علیہ وسلم مسجد میں تھے اور آپ صلی اللہ علیہ وسلم کی بیویاں بھی آپ کے پاس تھیں۔ وہ جانے لگیں تو آپ صلی اللہ علیہ وسلم نے صفیہ رضی اللہ عنھا سے فرمایا : ’’جلدی نہ کرنا، یہاں تک کہ میں تمھارے ساتھ جاؤں۔‘‘ ان کا مکان اسامہ کی حویلی میں تھا۔ چنانچہ نبی صلی اللہ علیہ وسلم ان کے ساتھ نکلے تو آپ کو دو انصاری ملے، انھوں نے نبی صلی اللہ علیہ وسلم کو دیکھا اور آگے بڑھ گئے۔ آپ صلی اللہ علیہ وسلم نے ان دونوں سے فرمایا: [ تَعَالَيَا إِنَّهَا صَفِيَّةُ بِنْتُ حُيَيٍّ ] ’’ادھر آؤ! یہ (میری بیوی) صفیہ بنت حیی ہے۔‘‘ انھوں نے کہا : ’’سبحان اللہ! یا رسول اللہ! (بھلا ہم آپ کے متعلق برا گمان کر سکتے ہیں)۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ الشَّيْطَانَ يَجْرِيْ مِنَ الْإِنْسَانِ مَجْرَی الدَّمِ، وَ إِنِّيْ خَشِيْتُ أَنْ يُلْقِيَ فِيْ أَنْفُسِكُمَا شَيْئًا ] [ بخاري، االاعتکاف، باب زیارۃ المرأۃ زوجھا في اعتکافہ : ۲۰۳۸ ] ’’شیطان انسان میں خون کے پھرنے کی طرح پھرتا ہے، تو میں ڈرا کہ وہ تمھارے دلوں میں کوئی بات ڈال دے۔‘‘ ¤ ➎ { وَ لَا تَجَسَّسُوْا:’’جَسَّ يَجُسُّ جَسًّا‘‘} (ن) کسی چیز کو معلوم کرنے کے لیے ہاتھ سے ٹٹولنا، تجسس، جاسوسی کرنا، خفیہ باتیں معلوم کرنے کی کوشش کرنا۔ جاسوسی برے گمان کا لازمی نتیجہ ہے، کیونکہ آدمی جب کسی کے متعلق دل میں برا گمان قائم کر لیتا ہے تو اسے ثابت کرنے کے لیے اس کی جاسوسی کرتا ہے اور اس کے ان عیوب کی ٹوہ میں رہتا ہے جن پر اللہ تعالیٰ نے پردہ ڈال رکھا ہے، تاکہ یہ اپنے گمان کو سچا ثابت کر سکے۔ یہ ایمانی مودّت و اخوت کے سراسر خلاف ہے۔ جب مسلمان بھائی کے ان عیوب پر بھی پردہ ڈالنے کا حکم ہے جو آدمی کو معلوم ہوں تو ان عیوب کی ٹوہ لگانا کیسے جائز ہو سکتا ہے جو محض اس کے گمان کی پیداوار ہیں، یا جن پر اللہ نے پردہ ڈال رکھا ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِيَّاكُمْ وَالظَّنَّ فَإِإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيْثِ، وَلاَ تَحَسَّسُوْا، وَلاَ تَجَسَّسُوْا، وَلاَ تَنَاجَشُوْا، وَلاَ تَحَاسَدُوْا، وَلاَ تَبَاغَضُوْا، وَلاَ تَدَابَرُوْا، وَكُوْنُوْا عِبَادَ اللّٰهِ إِخْوَانًا ] [ بخاري، الفرائض، باب تعلیم الفرائض :۶۰۶۶، ۶۷۲۴ ] ’’گمان سے بچو! کیونکہ گمان سب سے جھوٹی بات ہے اور نہ ٹوہ لگاؤ، نہ جاسوسی کرو، نہ دھوکے سے (خرید و فروخت میں) بولی بڑھاؤ، نہ ایک دوسرے پر حسد کرو، نہ ایک دوسرے سے دل میں کینہ رکھو، نہ ایک دوسرے سے قطع تعلق کرو اور اللہ کے بندو! بھائی بھائی بن جاؤ۔‘‘ ابوبرزہ اسلمی رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَا مَعْشَرَ مَنْ آمَنَ بِلِسَانِهِ وَلَمْ يَدْخُلِ الْإِيْمَانُ قَلْبَهُ ! لاَ تَغْتَاابُوا الْمُسْلِمِيْنَ وَلاَ تَتَّبِعُوْا عَوْرَاتِهِمْ فَإِنَّهُ مَنِ اتَّبَعَ عَوْرَاتِهِمْ يَتَّبِعِ اللّٰهُ عَوْرَتَهُ، وَ مَنْ يَتَّبِعِ اللّٰهُ عَوْرَتَهُ يَفْضَحْهُ فِيْ بَييْ بَيْتِهٖ ] [ أبوداوٗد، الأدب، باب في الغیبۃ : ۴۸۸۰، قال الألباني حسن صحیح ] ’’اے ان لوگوں کی جماعت جو اپنی زبان کے ساتھ ایمان لائے ہیں اور ایمان ان کے دلوں میں داخل نہیں ہوا ! مسلمانوں کی غیبت مت کرو اور نہ ہی ان کے چھپے ہوئے عیبوں کا پیچھا کرو، کیونکہ جو شخص مسلمانوں کے عیبوں کا پیچھا کرے گا اللہ تعالیٰ اس کے عیبوں کا پیچھا کرے گا اور جس کے عیبوں کا پیچھا اللہ تعالیٰ کرے وہ اسے اس کے گھر میں رسوا کر دے گا۔‘‘ بعض اوقات آدمی اصلاح کی نیت سے جاسوسی کرتا ہے، مگر یہ اصلاح کا طریقہ نہیں، اس سے باہمی عداوت پیدا ہوتی ہے اور خرابی بڑھتی ہے، اصلاح نہیں ہوتی۔ معاویہ رضی اللہ عنہ نے فرمایا، میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرماتے تھے : [ إِنَّكَ إِنِ اتَّبَعْتَ عَوْرَاتِ النَّاسِ أَفْسَدْتَهُمْ أوْكِدْتَ أَنْ تُفْسِدَهُمْ ] ’’یقینا جب تو لوگوں کے عیبوں کا پیچھا کرے گا تو انھیں خراب کر دے گا ‘‘ یا فرمایا : ’’قریب ہے تو انھیں خراب کر دے۔‘‘ ابوالدرداء رضی اللہ عنہ نے فرمایا: ’’یہ ایسی بات تھی جو معاویہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے سنی اور اللہ تعالیٰ نے انھیں اس کے ساتھ نفع دیا (کہ انھوں نے بیس سال شام کی امارت کی اور بیس سال پورے عالمِ اسلام پر خلافت کی اور رعایا کو ان سے کوئی خاص شکایت پیدا نہیں ہوئی)۔‘‘ [ أبوداوٗد، الأدب، باب في النھي عن التجسس : ۴۸۸۸، و قال الألباني صحیح ] ¤ ➏ جس طرح کوئی دلیل یا قرینہ موجود ہو تو بدگمانی کی گنجائش ہے اسی طرح اسلام کے دشمنوں کی جاسوسی یا امن و امان کی خرابی کا باعث بننے والوں کی جاسوسی بھی جائز ہے، بلکہ مسلم حکمران پر لازم ہے کہ وہ اپنی رعایا کے حالات سے واقف رہے اور اللہ کی حدود کو پامال کرنے والوں کا سدِباب کرتا رہے، مگر اس کے لیے کسی طرح جائز نہیں کہ محض گمان کی بنا پر تجسس یا کوئی کارروائی کرے۔ ¤ ➐ { وَ لَا يَغْتَبْ بَّعْضُكُمْ بَعْضًا:’’ لَا يَغْتَبْ ‘‘} (غ، ی، ب) سے باب افتعال ہے : {’’اِغْتَابَ يَغْتَابُ اِغْتِيَابًا ‘‘} کسی کے غائب ہونے کی حالت میں اس کی وہ بات کرنا جس کا ذکر اسے ناپسند ہو۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَتَدْرُوْنَ مَا الْغِيْبَةُ ؟ ] ’’کیا تم جانتے ہو غیبت کیا ہے؟‘‘ انھوں نے کہا: ’’اللہ اور اس کا رسول بہتر جانتے ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ ذِكْرُكَ أَخَاكَ بِمَا يَكْرَهُ ] ’’تمھارا اپنے بھائی کا ذکر ایسی چیز کے ساتھ کرنا جسے وہ ناپسند کرتا ہے۔‘‘ عرض کیا گیا: ’’آپ یہ بتائیں کہ اگر میرے بھائی میں وہ چیز موجود ہو جو میں کہہ رہا ہوں (تو کیا پھر بھی غیبت ہے)؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنْ كَانَ فِيْهِ مَا تَقُوْلُ فَقَدِ اغْتَبْتَهُ وَ إِنْ لَمْ يَكُنْ فِيْهِ فَقَدْ بَهَتَّهُ ] [ مسلم، البر والصلۃ، باب تحریم الغیبۃ : ۲۵۸۹ ] ’’اگر اس میں وہ چیز موجود ہے جو تم کہہ رہے ہو تو تم نے اس کی غیبت کی اور اگر وہ چیز اس میں موجود نہیں تو تم نے اس پر بہتان لگایا۔‘‘ ¤ ➑ { اَيُحِبُّ اَحَدُكُمْ اَنْ يَّاْكُلَ لَحْمَ اَخِيْهِ مَيْتًا فَكَرِهْتُمُوْهُ:} اس جملے میں غیبت سے کئی طریقوں سے شدید نفرت دلائی گئی ہے۔ چنانچہ اس میں غیبت کے ساتھ کسی بھائی کی عزت و آبرو تار تار کرنے کو انسان کا گوشت کھانا قرار دیا، پھر کسی دوسرے انسان کا نہیں بلکہ اپنے بھائی کا اور وہ بھی زندہ کا نہیں بلکہ مردہ بھائی کا۔ پھر ایسی شدید قابل نفرت چیز سے محبت کرنے کی عار دلاتے ہوئے پوچھا کہ اتنی گندی اور مکروہ چیز سے تو شدید نفرت ہونی چاہیے تھی، تو کیا تم نفرت کے بجائے اس سے محبت کرتے ہو۔ پھر {’’ اَحَدُكُمْ ‘‘} فرمایا کہ کیا تم میں سے کوئی ایک یہ پسند کرتا ہے؟ مطلب یہ کہ لاکھوں کروڑوں میں سے کوئی ایک بھی یہ پسند نہیں کرے گا تو تم میں سے کوئی ایک یہ کام کیوں کرے!؟ ¤ ➒ { فَكَرِهْتُمُوْهُ:} یعنی اگر تمھارے سامنے یہ چیز پیش کی جائے تو یقینا تم اس سے نفرت کرو گے۔ ¤ ➓ غیبت کو مردہ بھائی کا گوشت کھانے کے ساتھ تشبیہ اس لیے دی ہے کہ جس طرح مردہ اپنا گوشت کھانے سے کسی کو ہٹا نہیں سکتا اسی طرح جس کی غیبت کی جا رہی ہے وہ پاس موجود نہ ہونے کی وجہ سے اپنا دفاع نہیں کر سکتا۔ ¤ ⓫ جس طرح غیبت کرنا حرام ہے اسے سننا بھی حرام ہے، کیونکہ سننے والا بھی غیبت میں برابر کا شریک ہے، اگر وہ خاموش رہ کر تائید نہ کرے تو غیبت کرنے والے کو اس کام کی جرأت ہو ہی نہیں سکتی۔ دونوں ہی اپنے مردہ بھائی کے گوشت سے لذت حاصل کر رہے ہیں، ایک غیبت کر کے اور دوسرا اسے سن کر۔ اس لیے غیبت سننے سے بھی بہت پرہیز کرنا چاہیے، بلکہ اپنے مسلم بھائی کی عزت کا دفاع کرتے ہوئے غیبت کرنے والے کو اس سے منع کرنا چاہیے۔ ¤ ⓬ { وَ اتَّقُوا اللّٰهَ اِنَّ اللّٰهَ تَوَّابٌ رَّحِيْمٌ:} یعنی اللہ کا ڈر ہی ہے جو ان کاموں سے آدمی کو باز رکھ سکتا ہے جن سے ان آیات میں منع فرمایا گیا ہے، وہ نہ ہو تو کچھ بھی نہیں۔ اس لیے اللہ سے ڈرو اور ان تمام گناہوں سے توبہ کرو، یقینا اللہ بہت توبہ قبول کرنے والا اور نہایت رحم والا ہے۔ ¤ ⓭ نووی نے ’’الاذکار‘‘ میں غیبت کی تفصیل بیان کرتے ہوئے فرمایا: ’’خواہ وہ چیز اس کے بدن سے تعلق رکھتی ہو یا دین سے یا دنیا سے، اس کی شکل و صورت کے بارے میں ہو یا اخلاق کے، اس کے مال، اولاد، والدین اور بیوی بچوں کے متعلق ہو یا اس کے لباس، چال ڈھال، بول چال، خندہ پیشانی یا ترش روئی کے متعلق، غرض اس سے تعلق رکھنے والی کسی بھی چیز کا ذکر جو اسے ناپسند ہو غیبت ہے۔ پھر خواہ یہ ذکر زبان سے کیا جائے یا تحریر سے، اشارے سے ہو یا کنائے سے، تمام صورتوں میں غیبت ہے۔ اشارہ خواہ آنکھ سے ہو یا ہاتھ سے، سر کے ساتھ ہو یا جسم کے کسی حصے کے ساتھ، غیبت میں شامل ہے۔‘‘ ¤ بدن کی غیبت مثلاً اس کی تنقیص کے لیے اندھا، لنگڑا، کانا، گنجا، ٹھگنا، لمبوترا، کالا، کبڑا یا اس قسم کا کوئی اور لفظ استعمال کرے۔ دین کے بارے میں غیبت یہ ہے کہ اسے فاسق، چور، خائن، ظالم، نمازمیں سست، پلید، ماں باپ کا نافرمان یا بدمعاش وغیرہ کہے۔ دنیا کے بارے میں مثلاً اسے نکما، باتونی، پیٹو وغیرہ کہے۔ اخلاق کے متعلق مثلاً اسے بدخلق، متکبر، ریا کار، جلد باز، بزدل یا سٹریل قرار دے۔ اس کے والد کے متعلق مثلاً جولاہا، موچی، کالا، حبشی وغیرہ کہہ کر اس کی تنقیص کرے۔ پھر زبان، ہاتھ اور جسم کے ساتھ غیبت کی ایک صورت اس کی نقل اتارنا ہے، مثلاً اس کے اٹک اٹک کر بات کرنے یا ناک میں بولنے کی، لنگڑا کر چلنے کی، کبڑا ہونے کی یا چھوٹے قد کا ہونے کی نقل اتارے۔ غرض قاعدہ یہ ہے کہ کوئی بھی حرکت جس کا مقصد کسی مسلم بھائی کی تنقیص ہو غیبت ہے اور حرام ہے۔ ¤ ⓮ بعض اوقات کسی مسلم بھائی کی غیبت جائز بھی ہو جاتی ہے اور اس کی عدم موجودگی میں اس کا عیب بیان کیا جا سکتا ہے۔ قاعدہ اس کا یہ ہے کہ جب دین کا کوئی ضروری مقصد اس کے بغیر حاصل نہ ہو سکتا ہو تو اس وقت یہ جائز ہے۔ نووی نے اور ان سے پہلے غزالی نے غیبت کے جواز کے چھ مواقع گنوائے ہیں : (1) ظلم پر فریاد، یعنی مظلوم کو حق ہے کہ ظالم کے خلاف بات کرے۔ اللہ تعالیٰ نے فرمایا : « لَا يُحِبُّ اللّٰهُ الْجَهْرَ بِالسُّوْٓءِ مِنَ الْقَوْلِ اِلَّا مَنْ ظُلِمَ » [ النساء : ۱۴۸ ] ’’اللہ بری بات کے ساتھ آواز بلند کرنا پسند نہیں کرتا سوائے اس کے جس پر ظلم کیا جائے۔‘‘ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: [ فَإِنَّ لِصَاحِبِ الْحَقِّ مَقَالاً ] [ بخاري، الاستقراض، باب استقراض الإبل : ۲۳۹۰ ] ’’یقینا حق والے کو بات کرنے کی گنجائش ہے۔‘‘ بہتر یہ ہے کہ وہ بادشاہ یا قاضی یا کسی ایسے شخص کے پاس اپنی مظلومیت کا تذکرہ کرے جو اس کی مدد کر سکتا ہو۔ (2) کسی گناہ یا برے کام سے روکنے کے لیے ایسے لوگوں کو اطلاع دینا جو اس کے ساتھ مل کر یا خود اسے روک سکیں۔ اگر مقصد صرف اس کام کرنے والے کی تذلیل ہو تو یہ جائز نہیں۔ امر بالمعروف اور نہی عن المنکر کی آیات و احادیث اس کی دلیل ہیں۔ (3) فتویٰ لینے کے لیے مفتی کے سامنے کسی کا نقص ذکر کرے تو یہ جائز ہے، مثلاً ہند بنت عتبہ رضی اللہ عنھا نے اپنے خاوند ابوسفیان رضی اللہ عنہ کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے پوچھا تھا : ’’ابو سفیان بخیل آدمی ہے ( مجھے اتنا خرچ نہیں دیتا جو میرے اور میرے بچوں کے لیے کافی ہو) تو کیا مجھ پر کوئی گناہ تو نہیں اگر میں اس کے علم کے بغیر اس کے مال میں سے کچھ لے لوں؟‘‘ آپ نے فرمایا : [ خُذِيْ أَنْتِ وَ بَنُوْكِ مَا يَكْفِيْكِ بِالْمَعْرُوْفِ ] [ بخاري، البیوع، باب من أجری أمر الأمصار… : ۲۲۱۱،۵۳۶۴ ] ’’تمھارے اور تمھارے بچوں کے لیے جتنا کافی ہو معروف طریقے کے ساتھ لے لیا کرو۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے ہند رضی اللہ عنھا کو اپنے خاوند کا عیب بیان کرنے پر منع نہیں فرمایا، کیونکہ اس کا مقصد مسئلہ پوچھنا تھا۔ ¤ (4) مسلمانوں کی خیر خواہی کے لیے اور انھیں شر سے بچانے کے لیے کسی کی برائی سے آگاہ کرے تو یہ جائز ہے۔ عائشہ رضی اللہ عنھا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک شخص آیا، آپ نے فرمایا: [ اِئْذَنُوْا لَهُ، بِئْسَ أَخُو الْعَشِيْرَةِ ] [ بخاري، الأدب، باب ما یجوز من اغتیاب … : ۶۰۵۴ ] ’’اسے اجازت دے دو، یہ خاندان کا برا آدمی ہے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنھا کو اس شخص کی برائی سے آگاہ کرنا ضروری خیال کیا۔ مسلمانوں کی خیر خواہی میں اور انھیں شر سے بچانے میں بہت سی چیزیں آ جاتی ہیں، مثلاً حدیث کے راویوں پر اور مقدمے کے گواہوں پر جرح جائز بلکہ واجب ہے اور اس پر امت کا اتفاق ہے۔ دوسرے جب کوئی شخص کسی کے ساتھ رشتہ کرنے یا امانت رکھنے یا مشارکت کرنے یا ہمسائیگی اختیار کرنے، کاروبار یا کوئی اور معاملہ کرنے کے متعلق مشورہ پوچھے تو صحیح صحیح بات بتا دے۔ فاطمہ بنت قیس رضی اللہ عنھا نے معاویہ اور ابوجہم رضی اللہ عنھما میں سے کسی ایک کے ساتھ نکاح کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَمَّا أَبُوْ جَهْمٍ فَلاَ يَضَعُ عَصَاهُ عَنْ عَاتِقِهِ، وَأَمَّا مُعَاوِيَةُ فَصُعْلُوْكٌ لَا مَالَ لَهُ، انْكِحِيْ أُسَامَةَ بْنَ زَيْدٍ ] [ مسلم، الطلاق، المطلقۃ البائن لا نفقۃ لھا : ۱۴۸۰ ] ’’ابوجہم تو عورتوں کو بہت مارتا ہے اور معاویہ کنگال آدمی ہے، اس کے پاس کچھ نہیں ہے، تم اسامہ بن زید سے نکاح کر لو۔‘‘ اور صحیح مشورہ دینا مومن کا حق ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَ إِذَا اسْتَنْصَحَكَ فَانْصَحْ لَهُ ] [ مسلم، السلام، باب من حق المسلم للمسلم ردّ السلام : 2162/5 ] ’’اور جب وہ تم سے مشورہ مانگے تو اس کی خیر خواہی کر۔‘‘ ¤ (5) جو شخص کھلم کھلا اللہ کی نافرمانی کرتا ہو، لوگوں کو لوٹتا ہو، علانیہ شراب پیتا ہو تو اس کے ان گناہوں کا ذکر جائز ہے جن کو چھپانے کی وہ ضرورت ہی محسوس نہیں کرتا اور جن کا ذکر کیا جائے تو اسے برا محسوس ہی نہیں ہوتا، کیونکہ غیبت ان چیزوں کا ذکر ہے جسے وہ ناپسند کرے۔ (6) کوئی شخص کسی لقب کے ساتھ مشہور ہو، اس کے بغیر اس کی پہچان نہ ہوتی ہو اور وہ اسے برا بھی نہ جانتا ہو تو اسے اس لقب سے ذکر کرنا جائز ہے، خواہ اس میں اس کا کوئی نقص ہی بیان ہو رہا ہو، مثلاً اعمش (جس کی آنکھیں چندھیائی ہوئی ہوں)، اعرج (لنگڑا)، اصمّ (بہرا) اور اعمیٰ (نابینا) وغیرہ۔ شرط یہ ہے کہ مقصد اس کی تنقیص نہ ہو۔ ¤ ⓯ قرآن مجید کی اس آیت میں اللہ تعالیٰ نے فرمایا : « وَ لَا يَغْتَبْ بَّعْضُكُمْ بَعْضًا » کہ مسلمان ایک دوسرے کی غیبت نہ کریں۔ اسی طرح {’’ذِكْرُكَ أَخَاكَ بِمَا يَكْرَهُ‘‘} سے بھی ظاہر ہے کہ صرف مسلمان کی غیبت ناجائز ہے، کیونکہ کافر ہمارا دینی بھائی نہیں، اس لیے اس کی غیبت میں کوئی گناہ نہیں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ {يٰۤاَيُّهَا النَّاسُ اِنَّا خَلَقْنٰكُمْ مِّنْ ذَكَرٍ وَّ اُنْثٰى:} پچھلی آیات میں جن چھ گناہوں سے منع فرمایا ان کا بنیادی سبب اپنے آپ کو اونچا اور دوسروں کو نیچا سمجھنا ہے۔ جاہلیت میں اپنے قبیلے کی خوبیوں پر فخر اور دوسروں کو حقیر سمجھنے کی بیماری عام تھی۔ اس کی وجہ سے ہر قبیلے کے شاعر اور خطیب اپنے قبیلے کی برتری ثابت کرنے کے لیے دوسرے قبیلے کو استہزا، تمسخر اور طعن و تشنیع کا نشانہ بناتے، اس کے لیے وہ ان کے عیب تلاش کرتے، جاسوسی کرتے، غیبت، بہتان اور ہجو کا بازار گرم رکھتے تھے، حتیٰ کہ انھوں نے کئی قبیلوں کو بالکل ہی لوگوں کی نگاہوں سے گرا دیا۔ دنیا میں اپنی برتری پر فخر کا باعث کسی خاص قبیلے یا قوم میں پیدا ہونا ہی نہیں رہا، اس کے علاوہ بھی کئی چیزوں کو اپنے لیے باعثِ فخر اور دوسروں پر برتری کی دلیل قرار دیا گیا۔ چنانچہ رنگ، نسل، وطن اور زبان کی بنا پر نوعِ انسان تقسیم ہوئی اور ہر طبقے نے اپنے آپ کو دوسروں سے برتر اور دوسروں کو حقیر قرار دیا، جس کے نتیجے میں بے شمار جنگیں ہوئیں اور لاکھوں کروڑوں لوگ ہلاک یا زخمی ہوئے۔ وطن سے بے وطن ہوئے، غربت، بیماری اور بے آبروئی کا نشانہ بنے۔ اس لیے اللہ تعالیٰ نے پانچ آیات میں {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا ‘‘} کے ساتھ خطاب کے بعد یہاں تمام انسانوں کو مخاطب کرکے فرمایا {’’ يٰۤاَيُّهَا النَّاسُ ‘‘} کہ اے لوگو! ہم نے تمھیں ایک مرد اور ایک عورت (آدم و حوا علیھما السلام ) سے پیدا کیا ہے، اس لیے انسان ہونے میں تم سب برابر ہو۔ کسی خاص قوم، قبیلے یا ملک میں پیدا ہونے کی وجہ سے، یا کسی رنگ یا زبان کی وجہ سے کسی کو کسی پر کوئی برتری حاصل نہیں، کیونکہ اصل سب کی ایک ہے۔ پھر کسی قوم، ملک یا قبیلے میں پیدا ہونے یا کسی رنگ یا زبان والا ہونے میں کسی کا اپنا کوئی دخل یا اختیار نہیں، یہ سب کچھ صرف اللہ تعالیٰ کے اختیار میں ہے۔ اس لیے ان میں سے کوئی چیز اللہ تعالیٰ کی نعمت یا عطیہ تو ہو سکتی ہے، جس پر اسے اللہ کا شکر ادا کرنا چاہیے، مگر دوسروں پر برتری کا باعث نہیں ہو سکتی، کیونکہ برتری اس چیز میں کامیابی کی بدولت حاصل ہوتی ہے جس کا اللہ تعالیٰ نے اسے اختیار دے کر دنیا میں بھیجا ہے اور وہ ہے اللہ کا تقویٰ۔ اس لیے سب سے زیادہ عزت والا وہ ہے جو اللہ تعالیٰ کے ہاں عزت والا ہے اور اللہ تعالیٰ کے ہاں سب سے زیادہ عزت والا وہ ہے جو سب سے زیادہ تقویٰ والا ہے۔ اس کے بغیر کسی عربی کو عجمی پر یا گورے کو کالے پر یا آزاد کو غلام پر کوئی برتری حاصل نہیں۔ ہاں، تقویٰ کے ساتھ فضیلت کی کوئی اور وجہ بھی جمع ہو جائے تو اسے برتری حاصل ہو گی، جیسے کسی کو متقی ہونے کے ساتھ قریشی یا ہاشمی ہونے کا شرف بھی حاصل ہو، یا ایسی قوم کا فرد ہونے کا جو شجاعت یا ذہانت یا کسی اور خوبی میں معروف ہیں۔ یہ ایسے ہی ہے جیسے دو آدمی قرآن کی قراء ت میں برابر ہوں تو امامت کے وقت ان میں سے بڑی عمر والے کو جوان پر مقدم کیا جائے گا۔ ¤ ➋ { وَ جَعَلْنٰكُمْ شُعُوْبًا وَّ قَبَآىِٕلَ: ’’ شُعُوْبًا ‘‘ ’’شَعْبٌ‘‘} (شین کے فتحہ کے ساتھ) کی  جمع ہے، بہت بڑا قبیلہ، جیسے ربیعہ، مضر، اوس اور خزرج وغیرہ ۔ یہ ان چھ طبقوں میں سب سے پہلا طبقہ ہے جن میں عرب تقسیم ہوتے ہیں۔ وہ چھ طبقے یہ ہیں: (1) شعب (2) قبیلہ (3) عمارہ (4) بطن (5) فخذ (6) فصیلہ۔ شعب میں کئی قبائل ہوتے ہیں، قبیلہ میں کئی عمائر، عمارہ میں کئی بطون، بطن میں کئی افخاذ، اور فخذ میں کئی فصائل ہوتے ہیں۔ چنانچہ عرب میں خزیمہ شعب، کنانہ قبیلہ، قریش عمارہ، قصی بطن، ہاشم فخذ اور عباس فصیلہ ہیں۔ بعض اوقات ان میں سے ایک لفظ دوسرے کی جگہ بھی استعمال کر لیا جاتا ہے۔ شعب کا معنی شاخ ہے، اسے شعب اس لیے کہا جاتا ہے کہ ان سے قبائل کی شاخیں نکلتی ہیں۔ قرآن مجید میں ان چھ طبقوں میں سے تین کا ذکر آیا ہے، دو کا اس آیت میں اور ایک کا سورئہ معارج میں، فرمایا : « وَ فَصِيْلَتِهِ الَّتِيْ تُـْٔوِيْهِ» [ المعارج : ۱۳ ] ’’اور اپنے خاندان کو جو اسے جگہ دیا کرتا تھا۔‘‘ (قرطبی و شنقیطی) ¤ ➌ { لِتَعَارَفُوْا:} یعنی قوموں، قبیلوں یا خاندانوں میں تقسیم کا مطلب کسی کی برتری نہیں، بلکہ ہم نے یہ تقسیم تمھاری ایک دوسرے سے پہچان کے لیے بنائی ہے۔ مثلاً عبد اللہ نام کے کئی آدمی ہیں، ان میں سے ایک کی تعیین قریشی، اس کے بعد ہاشمی اور اس کے بعد عباسی کے ساتھ ہو سکتی ہے۔ اس پہچان ہی کے ذریعے سے آدمی اپنی رشتہ داری سے آگاہ ہوتا ہے اور رشتہ داروں کے حقوق ادا کرتا اور صلہ رحمی کرتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ تَعَلَّمُوْا مِنْ أَنْسَابِكُمْ مَا تَصِلُوْنَ بِهِ أَرْحَامَكُمْ، فَإِنَّ صِلَةَ الرَّحِمِ مَحَبَّةٌ فِي الْأَهْلِ، مَثْرَاةٌ فِي الْمَالِ، مَنْسَأَةٌ فِي الْأَثَرِ ] [ ترمذي، البر والصلۃ، باب ما جاء في تعلیم النسب : ۱۹۷۹، عن أبي ھریرۃ رضی اللہ عنہ ، وقال الألباني صحیح ] ’’اپنے نسب سیکھو، جن کے ذریعے سے تم اپنی رشتہ داریاں ملاؤ، کیونکہ رشتہ داری کو ملانا رشتہ داروں میں محبت، مال میں ثروت اور زندگی میں اضافے کا باعث ہے۔‘‘ ¤ ➍ { اِنَّ اَكْرَمَكُمْ عِنْدَ اللّٰهِ اَتْقٰىكُمْ:} رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ قَدْ أَذْهَبَ عَنْكُمْ عُبِّيَّةَ الْجَاهِلِيَّةِ وَفَخْرَهَا بِالْآبَاءِ، مُؤْمِنٌ تَقِيٌّ وَ فَاجِرٌ شَقِيٌّ، أَنْتُمْ بَنُوْ آدَمَ وَآدَمُ مِنْ تُرَابٍ لَيَدَعَنَّ رِجَالٌ فَخْرَرَهُمْ بِأَقْوَامٍ إِنَّمَا هُمْ فَحْمٌ مِنْ فَحْمِ جَهَنَّمَ، أَوْ لَيَكُوْنُنَّ أَهْوَنَ عَلَی اللّٰهِ مِنَ الْجِعْلاَنِ الَّتِيْ تَدْفَعُ بِأَنْفِهَا النَّتْنَ ] [ أبو داوٗد، الأدب، باب في التفاخر بالأحساب : ۵۱۱۶، عن أبي ھریرۃ رضی اللہ عنہ و قال الألباني صحیح ] ’’اللہ تعالیٰ نے تم سے جاہلیت کی نخوت اور اس کے آبا و اجداد پر فخر کو ختم کر دیا ہے۔ (آدمی دو ہی قسم کے ہیں) متقی مومن ہے یا بدبخت فاجر۔ تم سب آدم کی اولاد ہو اور آدم مٹی سے تھے۔ کچھ آدمی ایسے لوگوں پر اپنا فخر ترک کر دیں گے جو جہنم کے کوئلوں میں سے محض ایک کوئلہ ہیں، یا پھر وہ (فخر کرنے والے) اللہ تعالیٰ کے سامنے پاخانے کے کیڑوں سے بھی زیادہ ذلیل ہوں گے، جو گندگی کو اپنی ناک کے ساتھ دھکیلتے رہتے ہیں۔‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا : [ أَيُّ النَّاسِ أَكْرَمُ؟ ] ’’لوگوں میں سب سے عزت والا کون ہے ؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَكْرَمُهُمْ عِنْدَ اللّٰهِ أَتْقَاهُمْ ] ’’ان میں سب سے زیادہ عزت والا اللہ کے نزدیک وہ ہے جو ان میں سب سے زیادہ تقویٰ والا ہے۔‘‘ انھوں نے کہا : ’’ہم آپ سے اس کے متعلق نہیں پوچھ رہے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ فَأَكْرَمُ النَّاسِ يُوْسُفُ نَبِيُّ اللّٰهِ ابْنُ نَبِيِّ اللّٰهِ ابْنِ نَبِيِّ اللّٰهِ ابْنِ خَلِيْلِ اللّٰهِ ] ’’تو سب سے زیادہ عزت والے یوسف علیہ السلام ہیں جو اللہ کے نبی ہیں، نبی کے بیٹے ہیں، دادا بھی نبی ہے اور پردادا اللہ کا خلیل ہے۔‘‘ انھوں نے کہا: ’’ہم آپ سے اس کے متعلق بھی نہیں پوچھ رہے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُوْنِّيْ؟ ] ’’تو پھر تم مجھ سے عرب کے خاندانوں کے متعلق پوچھ رہے ہو؟‘‘ انھوں نے کہا: ’’جی ہاں!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ فَخِيَارُكُمْ فِي الْجَاهِلِيَّةِ خِيَارُكُمْ فِي الْإِسْلاَمِ  إِذَا فَقِهُوْا ] [ بخاري، التفسیر، باب قولہ : « لقد کان في یوسف و إخوتہ…» : ۴۶۸۹ ] ’’تو جاہلیت میں جو تم میں سب سے بہتر تھے وہی اسلام میں تم سب سے بہتر ہیں، جب وہ (دین کی) سمجھ حاصل کر لیں۔‘‘ ابونضرہ کہتے ہیں کہ مجھے اس صحابی نے بیان کیا جس نے ایام تشریق کے درمیان والے دن میں رسول اللہ صلی اللہ علیہ وسلم کا خطبہ سنا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ يَا أَيُّهَا النَّاسُ! أَلاَ إِنَّ رَبَّكُمْ وَاحِدٌ، وَ إِنَّ أَبَاكُمْ وَاحِدٌ، أَلاَ لاَ فَضْلَ لِعَرَبِيٍّ عَلٰی أَعْجَجَمِيٍّ، وَلاَ لِعَجَمِيٍّ عَلٰی عَرَبِيٍّ، وَلاَ لِأَحْمَرَ عَلٰی أَسْوَدَ، وَلاَ أَسْوَدَ عَلٰی أَحْمَرَ، إِلاَّ بِالتَّقْوٰی ] [مسند أحمد : 411/5، ح : ۲۳۴۸۹، قال شعیب الأرنؤوط إسنادہ صحیح ] ’’اے لوگو! سن لو! تمھارا رب ایک ہے اور تمھارا باپ ایک ہے۔ سن لو! نہ کسی عربی کو کسی عجمی پر کوئی برتری حاصل ہے اور نہ کسی عجمی کو کسی عربی پر، نہ کسی سرخ کو کسی کالے پر اور نہ کسی کالے کو کسی سرخ پر، مگر تقویٰ کی بنا پر۔‘‘ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ لَا يَنْظُرُ إِلٰی صُوَرِكُمْ وَ أَمْوَالِكُمْ وَ لٰكِنْ يَنْظُرُ إِلٰی قُلُوْبِكُمْ وَأَعْمَالِكُمْ ] [مسلم، البر والصلۃ، باب تحرییم ظلم المسلم … : ۳۴ /۲۵۶۴ ] ’’اللہ تعالیٰ تمھاری صورتوں اور تمھارے مالوں کو نہیں دیکھتا، بلکہ وہ تمھارے دلوں اور تمھارے عملوں کو دیکھتا ہے۔‘‘ عیاض بن حمار مجاشعی رضی اللہ عنہ نے ایک لمبی حدیث میں بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَ إِنَّ اللّٰهَ أَوْحٰی إِلَيَّ أَنْ تَوَاضَعُوْا حَتّٰی لَا يَفْخَرَ أَحَدٌ عَلٰی أَحَدٍ وَلَا يَبْغِيْ أَحَدٌ عَلٰیی أَحَدٍ ] [ مسلم، الجنۃ و صفۃ نعیمھا، باب الصفات التي یعرف بہا… : ۶۴؍۲۸۶۵ ] ’’اللہ تعالیٰ نے میری طرف وحی فرمائی کہ آپس میں تواضع اختیار کرو، حتیٰ کہ نہ کوئی کسی پر فخر کرے اور نہ کوئی کسی پر زیادتی کرے۔‘‘ ¤ ➎ اہل علم نے اس آیت سے استدلال کیا ہے کہ نکاح میں کفو (جوڑ) ہونے کے لیے اسلام کے علاوہ کوئی شرط معتبر نہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے اپنی پھوپھی کی بیٹی زینب بنت جحش رضی اللہ عنھا کا نکاح اپنے آزاد کردہ غلام زید بن حارثہ رضی اللہ عنہ سے کر دیا۔ اس لیے یہ جو مشہور ہے کہ سید لڑکی کا نکاح غیر سید سے نہیں ہو سکتا، درست نہیں۔ ویسے فاطمہ رضی اللہ عنھا کی اولاد کو لفظ ’’سید‘‘ کے ساتھ خاص کرنا بھی محض رواج ہے۔ یہاں رسول اللہ صلی اللہ علیہ وسلم کا چچا ہونے کے باوجود ابولہب جہنمی ہے اور غلام ہونے کے باوجود بلال رضی اللہ عنہ کے جوتوں کی آواز جنت میں رسول اللہ صلی اللہ علیہ وسلم کے آگے (بطور خادم) سنائی دے رہی ہے اور جابر رضی اللہ عنہ نے بیان کیا کہ عمر رضی اللہ عنہ فرمایا کرتے تھے: [ أَبُوْ بَكْرٍ سَيِّدُنَا، وَأَعْتَقَ سَيِّدَنَا يَعْنِيْ بِلاَلاً  ] [ بخاري، فضائل أصحاب النبي صلی اللہ علیہ وسلم ، باب مناقب بلال بن رباح … : ۳۷۵۴ ] ’’ابو بکر ہمارا سید ہے اور اس نے ہمارے سید بلال کو آزاد کیا۔‘‘ ¤ ➏ { اِنَّ اللّٰهَ عَلِيْمٌ خَبِيْرٌ:} یعنی اللہ تعالیٰ سب کچھ جاننے والا، پوری خبر رکھنے والا ہے۔ وہی جانتا ہے کہ کس کے دل میں تقویٰ زیادہ ہے، جس کی وجہ سے اسے سب سے زیادہ معزز ہونے کا شرف حاصل ہے۔ تو جب کسی کو دلوں کا حال معلوم ہی نہیں تو کوئی کسی پر فخر کیسے کر سکتا ہے اور کسی کو حقیر کیوں جانتا ہے!؟"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { قَالَتِ الْاَعْرَابُ: ’’ الْاَعْرَابُ ‘‘} کی تشریح کے لیے دیکھیں سورۂ توبہ (۹۷) کی تفسیر۔ یہاں {’’ الْاَعْرَابُ ‘‘} پر الف لام جنس کا نہیں بلکہ عہد کا ہے اور اس سے مراد تمام اعراب نہیں، کیونکہ ان میں کئی مخلص مومن بھی تھے۔ (دیکھیے توبہ : ۹۹) بلکہ مراد وہ بعض اعراب ہیں جو مدینہ کے گرد رہتے تھے اور اسلام کی قوت کو دیکھ کر مسلمان ہو گئے تھے، دل میں تکذیب بھی نہیں تھی کہ انھیں منافق کہا جا سکے، مگر ابھی تک کچھ تردّد باقی تھا اور ایمان و یقین پوری طرح دل میں داخل نہیں ہوا تھا، اس لیے یہ عمرۂ حدیبیہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نہیں گئے۔ ان کا ذکر اس سے پہلے سورۂ فتح کی آیت (۱۱) : « سَيَقُوْلُ لَكَ الْمُخَلَّفُوْنَ مِنَ الْاَعْرَابِ» میں بھی گزرا ہے۔ ¤ ➋ { اٰمَنَّا:} سورت کی ابتدا میں ان اعراب کا ذکر ہے جو نئے نئے مسلمان ہوئے تھے اور ابھی تک رسول اللہ صلی اللہ علیہ وسلم کے آداب اور اسلام کے دوسرے احکام سے پوری طرح واقف نہیں تھے۔ چنانچہ اللہ تعالیٰ نے ان آداب و احکام کی تلقین فرمائی اور جاہلیت کے فخر و غرور اور اس سے پیدا ہونے والی قباحتوں سے منع فرمایا۔ اس سلسلے میں واضح فرمایا کہ آدمی کو دوسروں پر فخر کا حق ہی نہیں، کیونکہ وہ عزت جو دوسروں پر برتری دلاتی ہے وہ صرف تقویٰ سے حاصل ہوتی ہے، جس کا تعلق دل سے ہے اور دل کا حال صرف علیم و خبیر جانتا ہے۔ یہاں سے ان اعراب کے کچھ دعوے ذکر فرما کر، جن سے ان کے فخر کا اظہار ہوتا تھا، ان کی تردید فرمائی۔ سب سے پہلے ان کے اس دعوے کا ذکر فرما کر کہ ہم ایمان لے آئے ہیں، اس کی نفی فرمائی۔ ¤ ➌ { قُلْ لَّمْ تُؤْمِنُوْا وَ لٰكِنْ قُوْلُوْۤا اَسْلَمْنَا:} اللہ تعالیٰ نے فرمایا، ان سے کہو کہ تم ایمان نہیں لائے بلکہ یوں کہو کہ ہم اسلام لے آئے۔ واضح رہے کہ قرآن و حدیث میں عام طور پر ایمان اور اسلام ایک ہی معنی میں استعمال ہوئے ہیں، جس میں دل کا یقین اور ظاہری فرماں برداری دونوں شامل ہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے بنو عبد القیس کو ایمان کی تشریح کرتے ہوئے بتایا کہ ایمان کلمۂ شہادت، نماز، روزے، زکوٰۃ، حج اور غنیمت میں سے خمس ادا کرنے کا نام ہے اور اللہ تعالیٰ نے {’’ اِنَّ الدِّيْنُ عِنْدَ اللّٰهِ الْاِسْلَامُ ‘‘} کہہ کر اپنی جناب میں معتبر دین اسلام کو قرار دیا اور ظاہر ہے وہاں وہی دین معتبر ہے جو دل کے یقین سے ہو، صرف ظاہری اعمال تو وہاں کچھ حیثیت نہیں رکھتے۔ بعض اوقات اسلام سے مراد ظاہری احکام کی پابندی اور ایمان سے مراد قلبی یقین ہوتا ہے، جیسا کہ حدیث جبریل میں ہے۔ یہاں بھی ایسا ہی ہے، مگر اس کا یہ مطلب نہیں کہ ہمیشہ ایمان سے مراد دلی یقین اور اسلام سے مراد ظاہری اعمال ہوتے ہیں، بلکہ بعض اوقات اسلام سے مراد دل سے مان لینا ہوتا ہے، جیسا کہ فرمایا : « فَمَنْ يُّرِدِ اللّٰهُ اَنْ يَّهْدِيَهٗ يَشْرَحْ صَدْرَهٗ لِلْاِسْلَامِ » [الأنعام: ۱۲۵] ’’تو وہ شخص جسے اللہ چاہتا ہے کہ اسے ہدایت دے، اس کا سینہ اسلام کے لیے کھول دیتا ہے۔‘‘ جس طرح بعض اوقات ایمان سے مراد صرف زبانی کلمہ پڑھنا ہوتا ہے، جیسا کہ فرمایا : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اٰمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ » [النساء:۱۳۶] ’’اے لوگو جو ایمان لائے ہو! (یعنی جنھوں نے ایمان کا اقرار کیا ہے) ایمان لے آؤ (یعنی دل سے مان لو)۔‘‘ یہاں فرمایا، ان سے کہو کہ تم ایمان نہیں لائے، بلکہ یوں کہو کہ ہم اسلام لے آئے ہیں۔ یعنی ہم کلمہ پڑھ کر اسلام میں داخل ہو گئے ہیں اور اس کے ظاہری احکام پر عمل شروع کر دیا ہے۔ یہاں الفاظ پر غور فرمائیں، اللہ تعالیٰ نے یہ نہیں فرمایا کہ {’’ قُلْ لَمْ تُؤْمِنُوْا وَ لٰكِنْ أَسْلَمْتُمْ ‘‘} ’’ان سے کہو کہ تم ایمان نہیں لائے، بلکہ تم مسلم ہو گئے ہو۔‘‘ بلکہ فرمایا : «لَمْ تُؤْمِنُوْا وَ لٰكِنْ قُوْلُوْۤا اَسْلَمْنَا » ’’تم ایمان نہیں لائے، بلکہ یوں کہو کہ ہم اسلام لے آئے ہیں۔‘‘ یعنی اللہ تعالیٰ نے ان کے مومن ہونے کی نفی کے بعد ان کے مسلم ہونے کو تسلیم نہیں کیا، بلکہ یہ فرمایا کہ تم مسلم ہونے کا دعویٰ کر سکتے ہو، کیونکہ اللہ تعالیٰ کے ہاں مسلم وہی تسلیم ہو سکتا ہے جو مومن بھی ہو۔ اس کے ہاں اگر کسی کے دل میں یقین نہیں تو ظاہری اعمال کا بھی کچھ اعتبار نہیں۔ ہاں ظاہری طور پر اسلامی احکام کی پابندی کرنے والے کو اللہ تعالیٰ کی طرف سے اسلام کا دعویٰ کرنے کی اجازت ہے۔ ¤ ➍ { وَ لَمَّا يَدْخُلِ الْاِيْمَانُ فِيْ قُلُوْبِكُمْ:} ’’اور ابھی تک ایمان تمھارے دلوں میں داخل نہیں ہوا‘‘ اس جملے سے ظاہر ہے کہ یہ لوگ اگرچہ پکے مومن نہیں تھے مگر منافق بھی نہیں تھے، کیونکہ وہ دل سے رسول اللہ صلی اللہ علیہ وسلم کو جھوٹا نہیں جانتے تھے۔ ان کے شک کی وجہ سے ان کے ایمان کی نفی کی گئی اور اگلی آیت میں مومن ان لوگوں کو قرار دیا جو ایمان لائے پھر انھوں نے شک نہیں کیا۔ {’’ لَمَّا ‘‘} کے لفظ سے ظاہر ہے کہ اگرچہ وہ ابھی تک ایمان نہیں لائے تھے، مگر آئندہ ان کے دلوں کے اندر ایمان داخل ہونے کی امید تھی۔ ¤ ➎ {وَ اِنْ تُطِيْعُوا اللّٰهَ وَ رَسُوْلَهٗ لَا يَلِتْكُمْ …:’’ لاَ يَلِتْ ‘‘} اصل میں {’’ لاَ يَلِيْتُ ‘‘} تھا، {’’ وَ اِنْ تُطِيْعُوْا ‘‘} شرط کا جواب ہونے کی وجہ سے تاء پر جزم آ گئی، تو یاء اور تاء دو ساکن جمع ہونے کی وجہ سے یاء گر گئی۔ {’’لَاتَ يَلِيْتُ‘‘} کسی کے حق میں کمی کرنا۔ یعنی اگر تم اللہ اور اس کے رسول کی اطاعت کرو گے تو اللہ تعالیٰ تمھارے اعمال میں کچھ کمی نہیں کرے گا۔ ظاہر ہے ان دونوں کی اطاعت کی شرط اوّل ان پر سچے دل سے ایمان و یقین رکھنا ہے۔ اس میں انھیں اخلاص و یقین کی ترغیب دلائی ہہے، یعنی اسلام کے احکام پر ثواب کی امید بھی اس وقت ہو سکتی ہے جب ظاہر و باطن سے اللہ اور اس کے رسول کی اطاعت ہو۔ یہاں یہ بات قابل توجہ ہے کہ اللہ اور اس کے رسول کی اطاعت کے بعد اعمال کا پورا ثواب دینا اور اس میں کمی نہ کرنا صرف اللہ کا کام ہے، رسول کا نہیں۔ اس لیے {’’لاَ يَلِتْ‘‘} واحد کا صیغہ استعمال فرمایا۔ ¤ ➏ { اِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ:} یعنی اطاعت کے بعد پہلی کوتاہیوں کو اللہ معاف کر دے گا، کیونکہ وہ گناہوں پر بے حد پردہ ڈالنے والا اور نہایت رحم والا ہے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) { اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ …: ’’ لَمْ يَرْتَابُوْا ‘‘ ’’رَيْبٌ‘‘} سے باب افتعال ہے۔ اعراب (بدویوں) کے ایمان کے دعوے کی نفی کے بعد اللہ تعالیٰ نے ایمان کی ایک باطنی اور ایک ظاہری شرط بیان فرمائی۔ چنانچہ فرمایا مومن تو صرف وہ لوگ ہیں جو ایمان لائے، پھر شک میں مبتلا نہیں ہوئے اور انھوں نے اپنے ایمان و یقین کا ثبوت مال و جان کے ساتھ اللہ کے راستے میں جہاد کرنے کے ساتھ دیا۔ یہی لوگ ہیں جو ایمان کے دعوے میں سچے ہیں۔ رہے وہ لوگ جو دعویٰ ایمان کا کرتے ہیں مگر جب جہاد کا موقع آتا ہے تو اس سے جان بچاتے ہیں، وہ اپنے دعویٰ میں جھوٹے ہیں۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {قُلْ اَتُعَلِّمُوْنَ اللّٰهَ بِدِيْنِكُمْ …: ’’ تُعَلِّمُوْنَ ‘‘ ’’عَلَّمَ يُعَلِّمُ تَعْلِيْمًا‘‘} (تفعیل) کا معنی سکھانا پڑھانا ہے۔ تعلیم کسی کو کوئی بات بتانے کا سب سے مضبوط اور پختہ طریقہ ہوتا ہے۔ چونکہ وہ بار بار اپنے ایمان کا اور دین دار ہونے کا دعویٰ کرتے تھے، ان کے بار بار دعوے کو اللہ تعالیٰ نے سکھانا پڑھانا قرار دیتے ہوئے فرمایا کہ کیا تم اللہ تعالیٰ کو سکھانے چلے ہو کہ تم پکے مومن اور دین دار ہو اور یہ سمجھے بیٹھے ہو کہ اسے تمھارے دل کا حال معلوم نہیں، حالانکہ اللہ تعالیٰ تو آسمانوں کی ہر چیز کو اور زمین کی ہر چیز کو جانتا ہے اور اللہ ہر چیز کو پوری طرح جاننے والا ہے۔ اس آیت میں قابلِ توجہ بات لفظ {’’ اللّٰهَ ‘‘} کا بار بار ذکر ہے : «قُلْ اَتُعَلِّمُوْنَ اللّٰهَ بِدِيْنِكُمْ وَ اللّٰهُ يَعْلَمُ مَا فِي السَّمٰوٰوٰتِ وَ مَا فِي الْاَرْضِ وَ اللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ » اپنا نام بار بار ذکر کرنے سے مقصود اپنی ہیبت اور عظمت کا احساس دلانا ہے کہ سوچو تم بار بار ایمان کا دعویٰ کرکے کسی عام ہستی کو نہیں بلکہ کائنات کے خالق و مالک کو سکھانے جا رہے ہو، جس کا نام ’’الله‘‘ ہے اور جس سے کوئی چیز مخفی نہیں۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { يَمُنُّوْنَ عَلَيْكَ اَنْ اَسْلَمُوْا:} اعراب یہ کہتے ہوئے کہ{’’ اٰمَنَّا ‘‘} (ہم ایمان لے آئے) دراصل رسول اللہ صلی اللہ علیہ وسلم پر اپنے مسلمان ہونے کا احسان جتلا رہے تھے۔ ان کے خیال میں یہ ان کا رسول اللہ صلی اللہ علیہ وسلم پر احسان تھا جس کا آپ صلی اللہ علیہ وسلم کو خیال رکھنا چاہیے تھا اور اس کے بدلے میں ان کے تقاضے اور فرمائشیں پوری کرنی چاہیے تھیں، جیسے چودھری اور سردار کسی سیاسی پارٹی میں شامل ہو کر اس پر احسان رکھتے ہیں اور پارٹی کے سربراہ سے اپنے مفادات حاصل کرتے ہیں۔ ¤ ➋ { قُلْ لَّا تَمُنُّوْا عَلَيَّ اِسْلَامَكُمْ:} اللہ تعالیٰ نے فرمایا، ان سے کہہ دیجیے کہ اپنے اسلام کا مجھ پر احسان مت رکھو، کیونکہ کوئی مسلمان ہوتا ہے تو اس کا فائدہ اسی کو ہے، اگر نہیں ہوتا تو اس کا نقصان بھی اسی کو ہے، جیسا کہ فرمایا : «مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهٖ وَ مَنْ اَسَآءَ فَعَلَيْهَا » [ حٰمٓ السجدۃ : ۴۶ ] ’’جس نے کوئی نیک عمل کیا تو وہ اس کے لیے ہے اور جس نے برائی کی تو وہ اسی پر ہے۔‘‘ تمھارے اسلام لانے یا نہ لانے سے میرا کوئی مفاد وابستہ نہیں۔ ¤ ➌ { بَلِ اللّٰهُ يَمُنُّ عَلَيْكُمْ اَنْ هَدٰىكُمْ:} یہاں بظاہر یہ کہنا چاہیے تھا کہ تم مجھ پر اپنے اسلام کا احسان مت رکھو، بلکہ میرا تم پر احسان ہے کہ میری وجہ سے تم اسلام لائے، مگر اللہ تعالیٰ  نے یہ کہنے کی تعلیم دی کہ اللہ تعالیٰ تم پر اپنا احسان جتلاتا اور یاد کرواتا ہے کہ اس نے تمھیں ایمان لانے کی ہدایت دی، یعنی اس کی توفیق بخشی، کیونکہ رسول اللہ صلی اللہ علیہ وسلم بھی اگرچہ ہدایت دیتے ہیں، جیسا کہ فرمایا: «وَ اِنَّكَ لَتَهْدِيْۤ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ » [ الشورٰی : ۵۲ ] ’’اور بلاشبہ تو یقینا سیدھے راستے کی طرف رہنمائی کرتا ہے۔‘‘ مگر آپ صرف صراط مستقیم کی راہنمائی کر سکتے ہیں، وہ ہدایت جو صراطِ مستقیم پر چلنے کا نام ہے اس کی توفیق صرف اللہ تعالیٰ کے ہاتھ میں ہے، اس لیے فرمایا : « اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ وَ لٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَآءُ» [القصص: ۵۶]’’بے شک تو ہدایت نہیں دیتا جسے تو دوست رکھے اور لیکن اللہ ہدایت دیتا ہے جسے چاہتا ہے۔‘‘ اور اگر اللہ تعالیٰ نے تمھیں ایمان کی توفیق دی تو اس میں سراسر تمھارا فائدہ ہے، اللہ تعالیٰ کو تم کوئی فائدہ نہیں پہنچا سکتے، نہ نقصان پہنچا سکتے ہو۔ تم ہی کیا، اگر ساری مخلوق بھی جمع ہو جائے تو نہ اللہ تعالیٰ کو کوئی فائدہ پہنچا سکتی ہے اور نہ اسے کوئی نقصان پہنچا سکتی ہے، پھر اس پر یا اس کے رسول پر احسان رکھنے کا کیا مطلب؟ ¤ ➍ {اِنْ كُنْتُمْ صٰدِقِيْنَ:} یعنی اللہ تعالیٰ کا ایمان کی ہدایت دینے کا احسان بھی تم پر اسی صورت میں ہے اگر تم اپنے ایمان کے دعوے میں سچے ہو، ورنہ ابھی تک تمھارے دعوے کی تصدیق نہیں ہوئی۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) { اِنَّ اللّٰهَ يَعْلَمُ غَيْبَ السَّمٰوٰتِ وَ الْاَرْضِ … :} اس سے پہلے یہ ذکر ہو چکا ہے کہ اللہ تعالیٰ وہ تمام چیزیں جانتا ہے جو آسمانوں میں ہیں اور جو زمین میں ہیں اور اللہ تعالیٰ ہر چیز کو پوری طرح جاننے والا ہے۔ اس آیت میں اسی کی مزید تاکید فرمائی کہ یہ نہ سمجھنا کہ وہ آسمان و زمین کی انھی اشیاء کو جانتا ہے جو ظاہر ہیں، بلکہ وہ ان اشیاء کو بھی جانتا ہے جو نگاہوں سے غائب ہیں، خواہ پہلے گزر چکی ہیں یا اب موجود ہیں یا آئندہ ہوں گی اور تم جو کچھ کر رہے ہو یا آئندہ کرو گے اللہ تعالیٰ اسے خوب دیکھنے والا ہے۔ نظم الدرر میں ہے، قشیری نے کہا : ’’جو شخص یہاں ٹھہر کر تھوڑا سا غور و فکر کرے گا اس کا عیش مکدّر ہو جائے گا، کیونکہ کسی کو خبر نہیں کہ اس کے غیب میں کیا لکھا ہے اور اس کا انجام کیا ہونے والا ہے اور ایمان کی نعمت اس کے پاس موت تک رہے گی یا نہیں۔ پھر دعویٰ کس بات کا اور احسان کیسا؟ یہی معنی اس شعر میں ادا ہوا ہے: ¤ {أَبْكِيْ وَ هَلْ تَدْرِيْنَ مَا يُبْكِيْنِيْ ¤ أَبْكِيْ حَذَرًا أَنْ تُفَارِقِيْنِيْ  ¤ وَ تَقْطَعِيْ حَبْلِيْ وَ تَهْجُرِيْنِيْ} ¤ ’’میں روتا ہوں اور کیا تو جانتی ہے کہ مجھے کیا چیز رلاتی ہے؟ میں اس ڈر سے روتا ہوں کہ تو مجھ سے جدا نہ ہو جائے، مجھ سے قطع تعلق نہ کر لے اور مجھے چھوڑ نہ دے۔‘‘"
    }
  ]
}