{
  "surah": "Qaaf ",
  "surah_number": 50,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "ابن کثیر رحمہ اللہ نے فرمایا : ’’رسول اللہ صلی اللہ علیہ وسلم بڑے مجمعوں کے مواقع پر عموماً اس سورت کی تلاوت فرمایا کرتے تھے، مثلاً عید اور جمعہ۔ اس کے علاوہ فجر کی نماز میں بھی اس کی قراء ت فرمایا کرتے تھے، کیونکہ یہ ابتدائے خلق، بعث، نشور، معاد، قیام، حساب، جنت، جہنم، ثواب، عقاب اور ترغیب و ترہیب پر مشتمل ہے۔‘‘ (ابن کثیر) عبید اللہ بن عبد اللہ بیان کرتے ہیں کہ عمر بن خطاب رضی اللہ عنہ نے ابو واقد لیثی رضی اللہ عنہ سے پوچھا : ’’رسول اللہ صلی اللہ علیہ وسلم عید الاضحی اور عید الفطر میں کیا پڑھا کرتے تھے؟‘‘ تو انھوں نے کہا : ’’آپ صلی اللہ علیہ وسلم ان دونوں نمازوں میں {’’ قٓ وَ الْقُرْاٰنِ الْمَجِيْدِ ‘‘} اور {’’ اِقْتَرَبَتِ السَّاعَةُ ‘‘} پڑھا کرتے تھے۔‘‘ [ مسلم، صلاۃ العیدین، باب ما یقرأ بہ في صلاۃ العیدین : ۸۹۱ ] ام ہشام بنت حارثہ بن نعمان رضی اللہ عنھا فرماتی ہیں : ’’میں نے سورۂ ق رسول اللہ صلی اللہ علیہ وسلم کی زبان مبارک سے سن کر ہی یاد کی ہے، آپ ہر جمعہ کو منبر پر خطبہ دیتے ہوئے اسے پڑھا کرتے تھے۔‘‘ [ مسلم، الجمعۃ، باب تخفیف الصلاۃ و الخطبۃ : ۸۷۳ ] جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں : [ إِنَّ النَّبِيَّ صَلّی اللّٰهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْفَجْرِبِ « قٓ وَ الْقُرْاٰنِ الْمَجِيْدِ» وَكَانَ صَلَاتُهُ بَعْدُ تَخْفِيْفًا ] [ مسلم، الصلاۃ، باب القراءۃ في الصبح : ۴۵۸ ] ’’رسول اللہ صلی اللہ علیہ وسلم فجر کی نماز میں سورۂ ق پڑھا کرتے تھے، اس کے باوجود آپ صلی اللہ علیہ وسلم کی نماز ہلکی ہوتی تھی۔‘‘ بعض علماء نے {’’ وَكَانَ صَلَاتُهُ بَعْدُ تَخْفِيْفًا ‘‘} کا ترجمہ یہ کیا ہے کہ اس کے بعد کی باقی نمازیں ہلکی ہوتی تھیں۔ ¤ (آیت 1) ➊ { قٓ:} مفسر ابن کثیر نے فرمایا : {’’ قٓ ‘‘} ان حروف تہجی میں سے ہے جو سورتوں کی ابتدا میں مذکور ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا {’’ صٓ ‘‘، ’’ نٓ ‘‘، ’’ الٓمّٓ ‘‘، ’’ حٰمٓ ‘‘، ’’ طٰسٓ ‘‘} وغیرہ۔ یہ مجاہد کا قول ہے۔ ہم سورۂ بقرہ کے شروع میں اس پر کلام کر چکے ہیں جسے دہرانے کی ضرورت نہیں۔ (ہماری اس تفسیر میں بھی سورۂ بقرہ کے شروع میں اس پر کلام گزر چکا ہے ) بعض سلف سے مروی ہے کہ انھوں نے کہا {’’ قٓ ‘‘} ایک پہاڑ ہے جو ساری زمین کو گھیرے ہوئے ہے، اسے جبل قاف کہتے ہیں۔ معلوم ہوتا ہے (واللہ اعلم) کہ یہ بنی اسرائیل کی خرافات سے ہے جو بعض لوگوں نے یہ سمجھ کر لے لی ہیں کہ بنی اسرائیل سے وہ روایات لینا جائز ہیں جنھیں ہم نہ سچا کہیں نہ جھوٹا۔ میرے نزدیک یہ اور اس جیسی دوسری باتیں بنی اسرائیل کے دشمنِ دین اور زندیق لوگوں کی گھڑی ہوئی ہیں، جن کے ذریعے سے وہ لوگوں کے دلوں میں ان کے دین کے بارے میں شکوک پیدا کرنا چاہتے تھے۔ جیسا کہ ہماری امت میں بڑے بڑے جلیل القدر علماء و حفاظ اور ائمہ کی موجودگی کے باوجود نبی صلی اللہ علیہ وسلم سے جھوٹی روایات گھڑ کر بیان کی گئی ہیں، حالانکہ کوئی زیادہ مدت بھی نہیں گزری۔ تو اتنی لمبی مدت میں بنی اسرائیل کا کیا حال ہو گا جن میں تنقید کرنے والے حفاظ بہت کم تھے، شرابیں پی جاتی تھیں اور ان کے علماء اللہ کے کلام اور اس کی آیات میں لفظی اور معنوی تحریف اور تبدیلی کیا کرتے تھے۔ شارع نے یہ کہہ کر کہ {’’حَدِّثُوْا عَنْ بَنِيْ إِسْرَائِيْلَ وَلاَ حَرَجَ‘‘} (بنی اسرائیل سے بیان کرو اور کوئی حرج نہیں) صرف ان روایات کی اجازت دی ہے جنھیں عقل ممکن قرار دیتی ہو، رہی وہ باتیں جو عقلاً محال اور واضح طور پر باطل ہیں، وہ اس فرمان میں شامل نہیں ہیں۔‘‘(ابن کثیر) {’’ حَدِّثُوْا عَنْ بَنِيْ إِسْرَائِيْلَ وَلاَ حَرَجَ ‘‘} } کی تفسیر جو ابنِ حبان رحمہ اللہ نے فرمائی ہے، اس تفسیر کے مقدمہ میں اسرائیلیات پر کلام میں ملاحظہ فرمائیں۔ ¤ اس کے بعد ابن کثیر نے ابن ابی حاتم کے حوالے سے ایک روایت نقل فرما کر اس کی تردید کی ہے، جس کا خلاصہ یہ ہے کہ اللہ تعالیٰ نے اس زمین کے پیچھے ایک سمندر پیدا فرمایا ہے جو اسے گھیرے ہوئے ہے، پھر اس کے پیچھے ایک پہاڑ پیدا فرمایا ہے جسے کوہِ قاف کہا جاتا ہے، جس کے اوپر آسمان دنیا ہے۔ اسی طرح سات زمینیں ہیں جن میں ہر ایک کے پیچھے ایک سمندر اور ایک کوہِ قاف ہے۔ غرض لمبی روایت ہے جو عقل و نقل اور مشاہدے کے صریح خلاف ہے۔ اگر واقعی قاف کسی پہاڑ کا نام بھی ہوتا تو اسے {’’ قٓ ‘‘} کے بجائے ’’قاف‘‘ لکھا جاتا۔ معلوم ہوتا ہے مسلمانوں میں کوہِ قاف اور اس کی پریوں کے افسانے ایسی ہی روایتوں سے رائج ہوئے ہیں اور کتبِ تفسیر میں نقل ہونے کی وجہ سے ملحد اور بے دین لوگوں کو اسلام اور قرآن و سنت پر اعتراض کا موقع مل گیا ہے، حالانکہ قرآن و سنت دونوں ایسی فضول باتوں سے پاک ہیں۔ غیر محتاط اور مکھی پر مکھی مارنے والے مفسرین کی باتوں کو لے کر اسلام پر اعتراض صرف بدباطن اور بدنیت لوگ ہی کرتے ہیں، اہلِ تحقیق کا یہ شیوہ نہیں۔ ¤ ➋ { وَ الْقُرْاٰنِ الْمَجِيْدِ:} قسم کسی بات کی تاکید کے لیے اٹھائی جاتی ہے، وہ تاکید یا تو اس چیز کی عظمت کی بنا پر ہوتی ہے جس کی قسم اٹھائی گئی ہے، جیسے اللہ تعالیٰ اور اس کے اسمائے حسنیٰ کی قسم ہے، یا قسم کے اس بات کی دلیل اور شاہد ہونے کی بنا پر ہوتی ہے جو قسم کے جواب میں آ رہی ہو۔ یہاں اللہ تعالیٰ نے قرآن کی قسم اس کے عظیم مجد و شرف کی بنا پر اٹھائی ہے اور اس بنا پر بھی کہ قرآن آپ صلی اللہ علیہ وسلم کے رسول برحق ہونے کی دلیل ہے۔ اس کا جوابِ قسم محذوف ہے جو اگلی آیت : « بَلْ عَجِبُوْۤا اَنْ جَآءَهُمْ مُّنْذِرٌ مِّنْهُمْ فَقَالَ الْكٰفِرُوْنَ هٰذَا شَيْءٌ عَجِيْبٌ » سے سمجھ میں آ رہا ہے۔ اگلی آیت میں پہلی بات جس پر کفار کے تعجب کا ذکر ہے، یہ ہے کہ ان کی طرف خود ان میں سے ایک پیغمبر کیسے مبعوث ہو گیا؟ وہ تو کوئی فرشتہ ہونا چاہیے تھا۔ جواب قسم اس مفہوم کا جملہ ہو گا : {’’ إِنَّكَ رَسُوْلُ اللّٰهِ حَقًّا وَ مَا رَدُّوْا أَمْرَكَ بِحُجَّةٍ وَلَا كَذَّبُوْكَ بِبُرْهَانٍ ‘‘} یعنی یہ عظیم الشان قرآن اس بات کی دلیل ہے کہ آپ اللہ کے سچے رسول ہیں اور کفار نے آپ کی نبوت کا انکار کسی دلیل یا حجت کی بنا پر نہیں کیا بلکہ محض اس تعجب کی بنا پر کیا ہے کہ ان کے پاس ان میں سے ایک ڈرانے والا کیسے آ گیا؟ سورۂ یٰس میں اس قسم کا جواب محذوف نہیں بلکہ مذکور ہے، فرمایا: «يٰسٓ (1) وَ الْقُرْاٰنِ الْحَكِيْمِ (2) اِنَّكَ لَمِنَ الْمُرْسَلِيْنَ » [ یٰسٓ :۱ تا ۳ ] ’’ {يٰسٓ۔} اس حکمت سے بھرے ہوئے قرآن کی قسم! بلاشبہ تو یقینا بھیجے ہوئے لوگوں میں سے ہے۔‘‘ اللہ تعالیٰ نے متعدد مقامات پر کفار کے اس تعجب اور شبہے کا ذکر فرما کر اس کا ردّ فرمایا ہے۔ (دیکھیے بنی اسرائیل : ۹۴) سورۂ ص میں بھی {’’ وَ الْقُرْاٰنِ ذِي الذِّكْرِ ‘‘} کا جواب محذوف ہے جو اس سے اگلی آیت : « بَلِ االَّذِيْنَ كَفَرُوْا فِيْ عِزَّةٍ وَّ شِقَاقٍ» سے معلوم ہو رہا ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { بَلْ عَجِبُوْۤا اَنْ جَآءَهُمْ مُّنْذِرٌ مِّنْهُمْ: ’’ عَجِبُوْۤا ‘‘} (انھوں نے تعجب کیا) میں ضمیر کفارِ قریش کے لیے ہے اور ڈرانے والے سیدنا محمد صلی اللہ علیہ وسلم ہیں۔ بعض نے کہا کہ ضمیر سے مراد تمام لوگ ہیں اور ’’ان میں سے‘‘ ہونے کا مطلب یہ ہے کہ آپ صلی اللہ علیہ وسلم ان کی جنس سے ایک انسان ہیں۔ اور آپ صلی اللہ علیہ وسلم کی صفات میں سے {’’ مُنْذِرٌ ‘‘} کا ذکر اس لیے فرمایا کہ آپ انھیں دوبارہ زندہ کیے جانے، اللہ تعالیٰ کے سامنے پیش ہونے اور اس کے عذاب سے ڈراتے تھے۔ ¤ ➋ {فَقَالَ الْكٰفِرُوْنَ هٰذَا شَيْءٌ عَجِيْبٌ:} یہ دوسری بات ہے جسے کفار نے عجیب قرار دیا اور وہ ہے مرنے کے بعد دوبارہ زندہ ہونا۔ یہاں {’’فَقَالُوْا‘‘} کہنے کے بجائے جو یہ فرمایا {’’ فَقَالَ الْكٰفِرُوْنَ ‘‘} تو لفظ {’’ الْكٰفِرُوْنَ ‘‘} ان کی مذمت کے اظہار کے لیے ہے کہ اس تعجب کی بھی کوئی معقول وجہ نہیں، کیونکہ جس نے پہلی دفعہ انھیں پیدا کیا، جب ان کا نام و نشان تک نہ تھا، وہ دوبارہ بھی پیدا کر سکتا ہے، بلکہ یہ تعجب محض ان کے کفر اور ’’میں نہ مانوں‘‘ کی ضد کی وجہ سے ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { ءَاِذَا مِتْنَا وَ كُنَّا تُرَابًا: ’’ اِذَا ‘‘} فعل محذوف کا ظرف ہے : {’’أَيْ أَ نَرْجِعُ إِذَا مِتْنَا وَكُنَّا تُرَابًا ‘‘} ’’یعنیی کیا ہم اس وقت دوبارہ لوٹیں گے جب ہم مر گئے اور مٹی ہو گئے۔‘‘ مزید دیکھیے سورۂ رعد (۵) اور سورئہ صافات (۱۶)۔ ¤ ➋ { ذٰلِكَ رَجْعٌۢ بَعِيْدٌ:} یہ لوٹنا تو عقل سے بہت دور ہے، یعنی ان کے خیال میں ممکن ہی نہیں۔ ¤ ➌ حقیقت یہ ہے کہ کفار نے جن باتوں کو باعث تعجب قرار دیا وہ قابل تعجب نہیں، بلکہ قابل تعجب کفار کی باتیں ہیں۔ چنانچہ انھوں نے اس بات کو قابل تعجب قرار دیا کہ انھیں خبردار کرنے اور ڈرانے والا خود ان میں سے آیا، حالانکہ اپنی جنس کا فرد ڈرانے اور آگاہ کرنے میں زیادہ مخلص اور خیر خواہ ہوتا ہے۔ تعجب کی بات یہ تھی کہ انسانوں کو خبردار کرنے کے لیے کوئی فرشتہ آتا، یا عربوں کی طرف کوئی چینی آتا۔ پھر وہ اس بات پر تعجب کر رہے ہیں کہ انسان رسول کیسے ہو گیا اور انھیں اس بات پر کوئی تعجب نہیں ہوتا کہ وہ پتھر کو رب مان کر اس کی پرستش کر رہے ہیں۔ پھر وہ مٹی ہو جانے کے بعد دوبارہ زندہ کیے جانے کو عجیب کہہ رہے ہیں اور انھیں اس بات پر تعجب نہیں ہوتا کہ پہلی مرتبہ اسی مٹی سے انھیں پیدا کیا گیا اور زندگی عطا کی گئی۔ اس لیے اللہ تعالیٰ نے ان کے قیامت کے انکار کی بات کو عجیب قرار دیا، فرمایا : «وَ اِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ ءَاِذَا كُنَّا تُرٰبًا ءَاِنَّا لَفِيْ خَلْقٍ جَدِيْدٍ » [ الرعد : ۵ ] ’’اور اگر تو تعجب کرے تو ان کا یہ کہنا بہت عجیب ہے کہ کیا جب ہم مٹی ہو جائیں گے تو کیا واقعی ہم یقینا ایک نئی پیدائش میں ہوں گے۔‘‘ (بقاعی)"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { قَدْ عَلِمْنَا مَا تَنْقُصُ الْاَرْضُ مِنْهُمْ:} وہ دوبارہ زندہ ہونے کو اس لیے بعید کہہ رہے تھے کہ مٹی ہونے کے بعد اس کے ذرّات تو سب ایک جیسے ہو جاتے ہیں، پھر جب ان کی مٹی کی دوسری مٹی سے پہچان ہی ختم ہو گئی تو وہ دوبارہ کیسے زندہ ہو سکتے ہیں؟ اللہ تعالیٰ نے ان کے اس شبہے کو ردّ کرتے ہوئے فرمایا : « قَدْ عَلِمْنَا » ’’یقینا ہم جان چکے‘‘ یعنی ہمیں پہلے ہی سے معلوم ہے کہ مرنے کے بعد زمین ان کے جسم میں سے جن جن اجزا کو کم کرے گی اور انھیں مٹی میں بدلتی جائے گی وہ کہاں کہاں ہوں گے، ہمارے علم سے ایک ذرّہ بھی باہر نہیں ہے۔ {’’ مِنْهُمْ ‘‘} میں لفظ {’’مِنْ‘‘} تبعیض کے لیے ہے، اس میں اشارہ ہے کہ انسان کے تمام اجزا مٹی نہیں ہوتے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ مِنَ الْإِنْسَانِ شَيْءٌ إِلَّا يَبْلٰي إِلَّا عَظْمًا وَاحِدًا وَ هُوَ عَجْبُ الذَّنَبِ وَ مِنْهُ يُرَكَّبُ الْخَلْقُ يَوْمَ الْقِيَامَةِ ] [ مسلم، الفتن، باب ما بین النفختین : ۲۹۵۵، عن أبي ھریرۃ رضی اللہ عنہ ] ’’انسان کی ہر چیز بوسیدہ ہو جاتی ہے سوائے ایک ہڈی کے جو دُم کی ہڈی ہے اور قیامت کے دن مخلوق کو اسی سے جوڑا جائے گا۔‘‘ ¤ ➋ { وَ عِنْدَنَا كِتٰبٌ حَفِيْظٌ:’’ حَفِيْظٌ ‘‘} مبالغے کا صیغہ ہے۔ چونکہ لوگ لکھی ہوئی بات کو زیادہ معتبر سمجھتے ہیں اس لیے ان کی عام عادت کو مدنظر رکھتے ہوئے فرمایا، ان کا ذرّہ ذرّہ ہمارے علم میں ہونے کے علاوہ اس کتاب میں بھی درج ہے جو خوب محفوظ رکھنے والی ہے۔ پھر ہمارے لیے ان ذرّات کو دوبارہ زندہ کرنا کیا مشکل ہے؟ {’’ كِتٰبٌ حَفِيْظٌ ‘‘} سے اکثر مفسرین نے لوحِ محفوظ مراد لی ہے جس میں اللہ تعالیٰ نے پہلے ہی وہ سب کچھ لکھ دیا ہے جو آئندہ ہونے والا ہے، اس میں ان کے ہر ذرے کے متعلق بھی درج ہے کہ وہ کہاں ہو گا۔ {’’ كِتٰبٌ حَفِيْظٌ ‘‘} سے مراد ایسی کتاب بھی ہو سکتی ہے جس میں ہر انسان کا نام، اس کے اعمال اور اس پر زندگی میں اور موت کے بعد گزرنے والے تمام احوال ساتھ ساتھ درج ہوتے جاتے ہوں، حتیٰ کہ یہ بھی کہ مرنے کے بعد اس کے جسم کا کوئی بھی ذرہ کہاں کہاں منتقل ہوا اور کہاں موجود ہے۔ اس لیے قیامت کا انکار اس بنا پر درست نہیں کہ مٹی ہو جانے کے بعد وہ ذرّات کیسے جمع کیے جائیں گے۔ کفار کو دوبارہ زندگی کا یقین دلانے کے لیے {’’ كِتٰبٌ حَفِيْظٌ ‘‘} کا یہ مفہوم الفاظ کے زیادہ قریب ہے۔ (واللہ اعلم)"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { بَلْ كَذَّبُوْا بِالْحَقِّ لَمَّا جَآءَهُمْ:} یعنی صرف یہی نہیں کہ ان لوگوں نے اپنی جنس میں سے رسول کی آمد کو اور دوبارہ زندہ کیے جانے کو عجیب قرار دیا، بلکہ اس سے بھی بڑھ کر یہ کہ جب ان کے پاس حق آیا تو اسے سنتے ہی کسی غور و فکر کے بغیر جھٹلا دیا۔ ¤ ➋ { فَهُمْ فِيْۤ اَمْرٍ مَّرِيْجٍ: ’’مَرَجَ الْأَمْرُ، أَيْ اِضْطَرَبَ وَالْتَبَسَ وَ فَسَدَ‘‘ ’’ اَمْرٍ مَّرِيْجٍ ‘‘} الجھا ہوا معاملہ۔ یعنی سوچے سمجھے بغیر جھٹلا دینے کے بعد اب رسول اللہ صلی اللہ علیہ وسلم اور قرآن کے بارے میں ان کی سمجھ ہی میں نہیں آتا کہ وہ انھیں جھٹلانے کا کیا جواز پیش کریں، اس لیے وہ کبھی ایک بات کرتے ہیں کبھی دوسری۔ ایک بات پر انھیں قرار نہیں ہے اور وہ سخت ذہنی الجھن میں پڑے ہوئے ہیں۔ کبھی رسول اللہ صلی اللہ علیہ وسلم کو شاعر کہتے ہیں، کبھی کاہن، کبھی مجنون (پاگل) اور کبھی ساحر۔ اسی طرح قرآن کو کبھی نبی صلی اللہ علیہ وسلم کا اپنا تصنیف کیا ہوا کلام کہتے ہیں، کبھی کہتے ہیں کہ کوئی عجمی شخص انھیں سکھا جاتا ہے اور کبھی اسے جادو کہہ دیتے ہیں۔ الغرض، ہر موقع پر کوئی نہ کوئی بات گھڑ لیتے ہیں۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {اَفَلَمْ يَنْظُرُوْۤا اِلَى السَّمَآءِ:} کفار نے جن چیزوں کو جھٹلایا ان میں سے ایک اہم چیز دوبارہ زندگی تھی، اس لیے یہاں سے اس کے کچھ مزید دلائل بیان فرمائے۔ {’’ اَفَلَمْ يَنْظُرُوْۤا ‘‘} میں ’’نظر‘‘ کا معنی اگرچہ غور و فکر بھی ہے، مگر اوّلین معنی دیکھنا ہے اور اس میں زیادہ زور ہے کہ ان مخلوقات کے دوبارہ زندگی پر دلالت کے لیے انھیں صرف آنکھوں کے ساتھ دیکھ لینا ہی کافی ہے۔ یعنی آسمانوں کا بنانا، انھیں ستاروں کے ساتھ سجانا اور زمین کو پیدا کرنا اس بات کی دلیل ہے کہ انھیں بنانے والا انسان کو دوبارہ پیدا کرنے پر بھی قادر ہے۔ دوسری جگہ یہی بات زیادہ صریح الفاظ میں بیان فرمائی ہے: «اَوَ لَمْ يَرَوْا اَنَّ اللّٰهَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ وَ لَمْ يَعْيَ بِخَلْقِهِنَّ بِقٰدِرٍ عَلٰۤى اَنْ ي يُّحْيَِۧ الْمَوْتٰى بَلٰۤى اِنَّهٗ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ » [ الأحقاف : ۳۳ ] ’’اور کیا انھوں نے نہیں دیکھا کہ وہ اللہ جس نے آسمانوں اور زمین کو پیدا کیا اور وہ ان کے پیدا کرنے سے تھکا نہیں، وہ اس بات پر قادر ہے کہ مردوں کو زندہ کر دے؟ کیوں نہیں! یقینا وہ ہر چیز پر پوری طرح قادر ہے۔‘‘ ¤ ➋ { فَوْقَهُمْ:} یہ {’’ السَّمَآءِ ‘‘} سے حال ہے، یعنی ان کے لیے آسمان کو دیکھنا کچھ مشکل نہیں، نہ اس کے لیے کسی سفر کی ضرورت ہے، نہ دوربین یا کسی آلے کی، بس اوپر سر اٹھائیں اور اللہ تعالیٰ کی اس عظیم مخلوق کو اپنی آنکھوں سے دیکھ لیں۔ ¤ ➌ { كَيْفَ بَنَيْنٰهَا وَ زَيَّنّٰهَا: ’’ السَّمَآءِ ‘‘} سے مراد پورا عالم بالا ہے، جس میں فضا، چاند، تارے، سورج اور خیمے کی طرح چاروں طرف سے زمین کو گھیرے میں لیے ہوئے نیلا آسمان سبھی کچھ شامل ہے۔ {’’ كَيْفَ ‘‘} کے ساتھ انھیں بنانے اور مزین کرنے کی کیفیت کی طرف توجہ دلائی ہے۔ ان کی بلندی، ان کی عظمت، ان کی مضبوطی، خوب صورتی اور ان کا کسی بھی خرابی یا خامی سے پاک ہونا سب ایسی چیزیں ہیں جنھیں دیکھ کر آدمی حیران رہ جاتا ہے اور اسے یقین ہو جاتا ہے کہ انھیں بنانے والا ہر چیز پر قادر ہے، وہ جو چاہے کر سکتا ہے۔ پھر آسمان، سورج ، چاند اور ستاروں کے اس نظام کو دیکھنے اور ان پر غور و فکر کرنے میں لوگوں کے اپنی عقل اور علم کے لحاظ سے مختلف درجے ہیں، آیت میں تمام طبقات کے لیے ہدایت کی روشنی موجود ہے۔ ¤ تفہیم القرآن میں ہے: ’’اس نظام کو آدمی کسی آلے کے بغیر اپنی آنکھ ہی سے دیکھ لے تو اس پر حیرت طاری ہو جاتی ہے، لیکن اگر دور بین لگا لے تو ایک ایسی وسیع و عریض کائنات اس کے سامنے آتی ہے جو ناپیداکنار ہے۔ ہماری زمین سے لاکھوں گنا بڑے سیارے اس کے اندر گیندوں کی طرح گھوم رہے ہیں۔ ہمارے سورج سے ہزاروں درجہ زیادہ روشن تارے اس میں چمک رہے ہیں۔ ہمارا یہ پورا نظام شمسی اس کی صرف ایک کہکشاں (Galaxy) کے ایک کونے میں پڑا ہوا ہے۔ تنہا اسی ایک کہکشاں میں ہمارے سورج جیسے کم از کم تین ارب دوسرے تارے (ثوابت) موجود ہیں اور اب تک کا انسانی مشاہدہ ایسی دس لاکھ کہکشاؤں کا پتا دے رہا ہے۔ ان لاکھوں کہکشاؤں میں سے ہماری قریب ترین ہمسایہ کہکشاں اتنے فاصلے پر واقع ہے کہ اس کی روشنی ایک لاکھ چھیاسی ہزار میل فی سیکنڈ کی رفتار سے چل کر دس لاکھ سال میں زمین تک پہنچتی ہے۔ یہ تو کائنات کے صرف اس حصے کی وسعت کا حال ہے جو اب تک انسان کے علم اور مشاہدے میں آئی ہے، خدا کی خدائی کس قدر وسیع ہے اس کا کوئی اندازہ ہم نہیں کر سکتے۔ ہو سکتا ہے کہ انسان کی معلوم کائنات اس کے مقابلے میں وہ نسبت بھی نہ رکھتی ہو جو قطرے کو سمندر سے ہے۔ اس عظیم کارگاہ ہست و بود کو جو خدا وجود میں لایا ہے اس کے بارے میں زمین پر رینگنے والا یہ چھوٹا سا حیوان ناطق، جس کا نام انسان ہے، اگر یہ حکم لگائے کہ وہ اسے مرنے کے بعد دوبارہ پیدا نہیں کر سکتا تو یہ اس کی اپنی ہی عقل کی تنگی ہے، کائنات کے خالق کی قدرت اس سے کیسے تنگ ہو جائے گی؟‘‘ ¤ ➍ {وَ مَا لَهَا مِنْ فُرُوْجٍ: ’’ فُرُوْجٍ ‘‘ ’’فَرْجٌ‘‘} کی جمع ہے، شگاف، دراڑ، درز۔ تفصیل کے لیے دیکھیے سورۂ ملک (۳، ۴) کی تفسیر۔ تفہیم القرآن میں ہے : ’’یعنی اپنی اس حیرت انگیز وسعت کے باوجود یہ عظیم الشان نظامِ کائنات ایسا مسلسل اور مستحکم ہے اور اس کی بندش اتنی چست ہے کہ اس میں کسی جگہ کوئی دراڑ یا شگاف نہیں اور اس کا تسلسل کہیں جا کر ٹوٹ نہیں جاتا۔ اس چیز کو ایک مثال سے اچھی طرح سمجھا جا سکتا ہے۔ جدید زمانے کے ریڈیائی ہیئت دانوں نے ایک کہکشانی نظام کا مشاہدہ کیا ہے جسے وہ ’’منبع ۳ ج ۲۹۵‘‘ (Source3c,285) کے نام سے تعبیر کرتے ہیں۔ ان کے متعلق ان کا اندازہ یہ ہے کہ اس کی جو شعائیں اب ہم تک پہنچ رہی ہیں وہ چار ارب سال سے بھی زیادہ مدت پہلے اس میں سے روانہ ہوئی ہوں گی۔ اس بعید ترین فاصلے سے ان شعاعوں کا زمین تک پہنچنا آخر کیسے ممکن ہوتا اگر زمین اور اس کہکشاں کے درمیان کائنات کا تسلسل کسی جگہ سے ٹوٹا ہوا ہوتا اور اس کی بندش میں کہیں شگاف پڑا ہوا ہوتا۔ اللہ تعالیٰ اس حقیقت کی طرف اشارہ کرکے دراصل یہ سوال آدمی کے سامنے پیش کرتا ہے کہ میری کائنات کے اس نظام میں جب تم ایک ذرا سے رخنے کی نشاندہی بھی نہیں کر سکتے تو میری قدرت میں اس کمزوری کا تصور تمھارے دماغ میں کہاں سے آ گیا کہ تمھاری مہلتِ امتحان ختم ہو جانے کے بعد تم سے حساب لینے کے لیے میں تمھیں پھر زندہ کرکے اپنے سامنے حاضر کرنا چاہوں تو نہ کر سکوں گا۔ یہ صرف امکانِ آخرت ہی کا ثبوت نہیں ہے بلکہ توحید کا ثبوت بھی ہے۔‘‘"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) { وَ الْاَرْضَ مَدَدْنٰهَا … : ’’ بَهِيْجٍ ‘‘ ’’بَهْجَةٌ‘‘} سے صفت کا صیغہ ہے، خوبی والی۔ اس آیت کی تفسیر کے لیے دیکھیے سورۂ حجر (۱۹)، نحل (۱۵)، طٰہٰ (۵۳)، نمل (۶۰، ۶۱)، لقمان (۱۰)، زخرف (۱۰ تا ۱۴) اور مرسلات (۲۵ تا ۲۷)۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { تَبْصِرَةً وَّ ذِكْرٰى …: ’’ تَبْصِرَةً ‘‘} اور {’’ ذِكْرٰى ‘‘} یہ دونوں مفعول لہ ہیں، یعنی ہم نے یہ سب کچھ بنایا اور اس کا یہاں ذکر کیا ہے ہر اس آدمی کو دکھانے اور یاد دلانے کے لیے جو اللہ تعالیٰ کی طرف رجوع کرنے والا ہے، کیونکہ وہی ان سے نصیحت حاصل کرتا ہے۔ جو دھیان ہی نہ کرے اس کے لیے یہ سب کچھ بے فائدہ ہے: ¤ انّہے نوں بازار پھرایا، سارا شہر وکھایا ¤ آخر اُتے آکھن لگا کجھ نہیں نظری آیا ¤ ’’یعنی اندھے کو بازار دکھایا اور سارے شہر کی سیر کروائی، مگر اس نے آخر میں یہی کہا کہ مجھے کچھ دکھائی نہیں دیا۔‘‘"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {وَ نَزَّلْنَا مِنَ السَّمَآءِ مَآءً مُّبٰرَكًا:’’ مَآءً مُّبٰرَكًا ‘‘} وہ پانی جس میں بہت برکت یعنی خیرِ کثیر رکھی گئی ہے۔ یہاں باب مفاعلہ مشارکت کے لیے نہیں بلکہ مبالغہ کے لیے ہے۔ جس پانی کو اللہ تعالیٰ مبارک فرمائے اس کی خیر کی کثرت کا کیا اندازہ ہو سکتا ہے۔ موت کے بعد زندگی کے اثبات کے لیے زمین و آسمان اور ان کے درمیان کی چیزوں کی پیدائش کا ذکر کرنے کے بعد اب بارش کا اور اس کی برکت سے زمین سے پیدا ہونے والی چیزوں کا ذکر فرمایا۔ مقصود اس سے بھی موت کے بعد زندگی کا اثبات ہے، چنانچہ آخر میں فرمایا : «كَذٰلِكَ الْخُرُوْجُ » [ قٓ : ۱۱ ] ’’اسی طرح (دوبارہ زندہ ہو کر ) نکلنا ہے۔‘‘ آسمان سے پانی اتارنے کے لیے باب تفعیل {’’ نَزَّلْنَا ‘‘} استعمال فرمایا جس میں تدریج ہوتی ہے۔ اگر اللہ تعالیٰ بارش کے قطروں کے بجائے کروڑوں اربوں ٹن پانی دفعتاً گرا دے تو زمین پر کوئی چیز باقی ہی نہ رہے۔ ¤ ➋ {فَاَنْۢبَتْنَا بِهٖ جَنّٰتٍ وَّ حَبَّ الْحَصِيْدِ: ’’حَصَدَ يَحْصُدُ حَصْدًا وَ حِصَادًا‘‘} (ن) کھیتی کاٹنا۔ {’’ الْحَصِيْدِ ‘‘} بمعنی {’’اَلْمَحْصُوْدُ‘‘} کاٹی ہوئی کھیتی۔ بارش سے پیدا ہونے والی چیزیں دو قسم کی ہیں، کچھ وہ جن کے درخت باقی رہتے ہیں اور ان کے پھل پھول، گوند، پتوں، ٹہنیوں اور لکڑی وغیرہ سے فائدہ اٹھایا جاتا ہے اور کچھ وہ جنھیں کاٹ کر ان سے غلہ، دالیں، سبزیاں، ادویات اور بے شمار مفید چیزیں حاصل کی جاتی ہیں۔ یہاں خصوصاً پھل دار درختوں اور غلہ جات کا ذکر فرمایا، کیونکہ یہ دوسری اشیاء پر برتری رکھتے ہیں اور انسان اور اس کے پالتو جانوروں کی خوراک بنتے ہیں، جیسا کہ فرمایا: « مَتَاعًا لَّكُمْ وَ لِاَنْعَامِكُمْ » [ النازعات : ۳۳ ] ’’تمھاری اور تمھارے چوپاؤں کی زندگی کے سامان کے لیے۔ ‘‘"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ { وَ النَّخْلَ بٰسِقٰتٍ: ’’ النَّخْلَ ‘‘} اسم جنس ہے جو کھجور کے درختوں پر بولا جاتا ہے، زیادہ ہوں یا ایک۔ اگر کھجور کا ایک درخت ہو تو اسے {’’نَخْلَةٌ‘‘} کہتے ہیں، جیسا کہ فرمایا: «فَاَجَآءَهَا الْمَخَاضُ اِلٰى جِذْعِ النَّخْلَةِ» [ مریم :۲۳ ] ’’پھر دردزہ اسے کھجور کے تنے کی طرف لے آیا۔‘‘ {’’بَسَقَ يَبْسُقُ بُسُوْقًا‘‘(ن) ’’اَلنَّخْلُ‘‘} کھجور کے درختوں کا لمبا اور بلند ہونا۔ چنانچہ زمین پر پڑے ہوئے کھجور کے لمبے تنے کو ’’باسق‘‘ نہیں کہتے۔ ¤ ➋ { لَهَا طَلْعٌ نَّضِيْدٌ: ’’ طَلْعٌ ‘‘} کھجور کے پھل کا خوشہ جو شروع میں طلوع ہوتا ہے اور اس پر پردہ ہوتا ہے۔ {’’ نَضِيْدٌ ‘‘} بمعنی {’’مَنْضُوْدٌ‘‘} تہ بہ تہ۔ یعنی پردے کے اندر انار کے دانوں کی طرح کھجور کے دانوں کی ابتدا تہ بہ تہ قطاروں کی شکل میں ہوتی ہے، جب غلاف سے باہر نکل آئیں تو {’’ نَضِيْدٌ ‘‘} نہیں رہتے، بلکہ الگ الگ ہو جاتے ہیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) { وَ اَحْيَيْنَا بِهٖ بَلْدَةً مَّيْتًا كَذٰلِكَ الْخُرُوْجُ:} یعنی مرنے کے بعد دوبارہ زندہ اٹھنے میں تعجب کی کون سی بات ہے؟ کیا تم اپنی آنکھوں سے نہیں دیکھتے کہ ایک زمین بارش نہ ہونے کی وجہ سے بنجر پڑی ہوتی ہے، جیسے اس میں زندگی کے کوئی آثار ہی نہیں، پھر یکایک بارش ہوتی ہے تو اس میں کھیتیاں لہلہانے لگتی ہیں اور درخت اگتے ہیں، گویا مرنے کے بعد دوبارہ زندہ ہو جاتی ہے۔ اسی طرح تم مرنے کے بعد دوبارہ زندہ کیے جاؤ گے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12تا14) ➊ { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ … :} یعنی یہ آپ کو جھٹلانے والے پہلے لوگ نہیں جنھوں نے ہمارے کسی رسول کو جھٹلایا ہو، بلکہ اس سے پہلے کئی اقوام نے ہمارے رسولوں کو جھٹلایا اور ہمارے عذاب کا نشانہ بنے۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی اور آپ صلی اللہ علیہ وسلم کو جھٹلانے والوں کے لیے تنبیہ ہے۔ آیت میں مذکور اکثر اقوام کا ذکر متعدد مقامات پر گزر چکا ہے۔ اصحاب الرس کا ذکر سورۂ فرقان (۳۸) میں، اصحاب الایکہ کا ذکر سورۂ حجر (۷۸) اور سورئہ شعراء (۱۷۶) میں اور قوم تبع کا ذکر سورۂ دخان (۳۷) میں دیکھیے۔ ¤ ➋ { كُلٌّ كَذَّبَ الرُّسُلَ:} ان سب قوموں نے تمام رسولوں کو جھٹلا دیا، کیونکہ یہ سب نہ اپنی طرح کے کسی انسان کو رسول ماننے کے لیے تیار تھے اور نہ دوبارہ زندہ ہو کر اللہ تعالیٰ کے سامنے پیش ہونے کو۔ اس لیے ان میں سے ہر ایک کو تمام رسولوں کو جھٹلانے والا قرار دیا۔ ¤ ➌ { فَحَقَّ وَعِيْدِ: ’’ وَعِيْدِ ‘‘} اصل میں {’’وَعِيْدِيْ‘‘} ہے۔ آیات کے فواصل کی مطابقت کے لیے یاء کو حذف کر دیا، دال پر کسرہ یاء کے حذف ہونے کی دلیل ہے، ورنہ {’’حَقَّ‘‘} کا فاعل ہونے کی وجہ سے {’’ وَعِيْدِ ‘‘} کے دال پر ضمہ ہونا چاہیے تھا۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 12تا14) ➊ { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ … :} یعنی یہ آپ کو جھٹلانے والے پہلے لوگ نہیں جنھوں نے ہمارے کسی رسول کو جھٹلایا ہو، بلکہ اس سے پہلے کئی اقوام نے ہمارے رسولوں کو جھٹلایا اور ہمارے عذاب کا نشانہ بنے۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی اور آپ صلی اللہ علیہ وسلم کو جھٹلانے والوں کے لیے تنبیہ ہے۔ آیت میں مذکور اکثر اقوام کا ذکر متعدد مقامات پر گزر چکا ہے۔ اصحاب الرس کا ذکر سورۂ فرقان (۳۸) میں، اصحاب الایکہ کا ذکر سورۂ حجر (۷۸) اور سورئہ شعراء (۱۷۶) میں اور قوم تبع کا ذکر سورۂ دخان (۳۷) میں دیکھیے۔ ¤ ➋ { كُلٌّ كَذَّبَ الرُّسُلَ:} ان سب قوموں نے تمام رسولوں کو جھٹلا دیا، کیونکہ یہ سب نہ اپنی طرح کے کسی انسان کو رسول ماننے کے لیے تیار تھے اور نہ دوبارہ زندہ ہو کر اللہ تعالیٰ کے سامنے پیش ہونے کو۔ اس لیے ان میں سے ہر ایک کو تمام رسولوں کو جھٹلانے والا قرار دیا۔ ¤ ➌ { فَحَقَّ وَعِيْدِ: ’’ وَعِيْدِ ‘‘} اصل میں {’’وَعِيْدِيْ‘‘} ہے۔ آیات کے فواصل کی مطابقت کے لیے یاء کو حذف کر دیا، دال پر کسرہ یاء کے حذف ہونے کی دلیل ہے، ورنہ {’’حَقَّ‘‘} کا فاعل ہونے کی وجہ سے {’’ وَعِيْدِ ‘‘} کے دال پر ضمہ ہونا چاہیے تھا۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 12تا14) ➊ { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ … :} یعنی یہ آپ کو جھٹلانے والے پہلے لوگ نہیں جنھوں نے ہمارے کسی رسول کو جھٹلایا ہو، بلکہ اس سے پہلے کئی اقوام نے ہمارے رسولوں کو جھٹلایا اور ہمارے عذاب کا نشانہ بنے۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی اور آپ صلی اللہ علیہ وسلم کو جھٹلانے والوں کے لیے تنبیہ ہے۔ آیت میں مذکور اکثر اقوام کا ذکر متعدد مقامات پر گزر چکا ہے۔ اصحاب الرس کا ذکر سورۂ فرقان (۳۸) میں، اصحاب الایکہ کا ذکر سورۂ حجر (۷۸) اور سورئہ شعراء (۱۷۶) میں اور قوم تبع کا ذکر سورۂ دخان (۳۷) میں دیکھیے۔ ¤ ➋ { كُلٌّ كَذَّبَ الرُّسُلَ:} ان سب قوموں نے تمام رسولوں کو جھٹلا دیا، کیونکہ یہ سب نہ اپنی طرح کے کسی انسان کو رسول ماننے کے لیے تیار تھے اور نہ دوبارہ زندہ ہو کر اللہ تعالیٰ کے سامنے پیش ہونے کو۔ اس لیے ان میں سے ہر ایک کو تمام رسولوں کو جھٹلانے والا قرار دیا۔ ¤ ➌ { فَحَقَّ وَعِيْدِ: ’’ وَعِيْدِ ‘‘} اصل میں {’’وَعِيْدِيْ‘‘} ہے۔ آیات کے فواصل کی مطابقت کے لیے یاء کو حذف کر دیا، دال پر کسرہ یاء کے حذف ہونے کی دلیل ہے، ورنہ {’’حَقَّ‘‘} کا فاعل ہونے کی وجہ سے {’’ وَعِيْدِ ‘‘} کے دال پر ضمہ ہونا چاہیے تھا۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { اَفَعَيِيْنَا بِالْخَلْقِ الْاَوَّلِ:} یہ خلاصہ اور نتیجہ ہے اس دلیل کا جس کی تفصیل سورت کے شروع سے آ رہی ہے کہ جب ہم نے اس وقت جب کچھ بھی نہیں تھا آسمان و زمین، بارش اور اوپر مذکور تمام چیزیں پیدا کر لیں اور ہمیں ان کے پیدا کرنے سے کوئی تھکاوٹ لاحق نہیں ہوئی تو کیا یہ بے چارہ انسان ضعیف البنیان ہی ایسی مخلوق ہے جسے پہلی دفعہ پیدا کرکے ہم تھک گئے ہیں اور اسے دوبارہ زندہ نہیں کر سکتے، حالانکہ ہمارا تخلیق کا عمل مسلسل جاری ہے اور دوبارہ زندگی تو پہلی دفعہ کے مقابلے میں معمولی بات ہے۔ یہ بات اللہ تعالیٰ نے مختلف انداز سے کئ کئی جگہ بیان فرمائی ہے، دیکھیے سورۂ روم (۲۷)، یٰس (۷۸، ۷۹)، نازعات (۲۷) اور سورۂ ق (۳۸)۔ ¤ ➋ {بَلْ هُمْ فِيْ لَبْسٍ مِّنْ خَلْقٍ جَدِيْدٍ:} یعنی یہ اس چیز کے منکر نہیں ہیں کہ ان کو پہلی بار ہم نے ہی پیدا کیا اور یہ کہ پہلی بار پیدا کرکے ہم تھک کر نہیں رہ گئے، لیکن اس کے باوجود انھیں شک ہے کہ ہم دوبارہ بھی پیدا کر سکیں گے یا نہیں، حالانکہ معمولی غور و فکر سے یہ بات سمجھی جا سکتی ہے کہ اگر ہمیں دشواری پیش آتی تو پہلی دفعہ آتی، دوسری بار پیدا کرنے کا کام تو پہلی بار کی بہ نسبت کہیں آسان ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { وَ لَقَدْ خَلَقْنَا الْاِنْسَانَ وَ نَعْلَمُ مَا تُوَسْوِسُ بِهٖ نَفْسُهٗ:} وسوسہ کا اصل معنی وہ ہلکی یا دبی ہوئی حرکت یا آواز ہے جو عام طور پر محسوس نہ ہوتی ہو۔ اس سے مراد وہ بات بھی ہوتی ہے جو بالکل آہستہ آواز سے کسی کے کان میں کہی جائے اور صرف اسی کو سنائی دے اور وہ بات بھی جو بغیر آواز کے کسی کے دل میں ڈال دی جائے، جیسے شیطان یا نفس انسان کے دل میں وسوسہ ڈالتا ہے۔ قیامت کے منکروں کے اس شبہ کا جواب کہ جب ہم مر کر مٹی ہو گئے تو دوبارہ کیسے زندہ کیے جائیں گے، اس سے پہلے گزر چکا ہے کہ ہم انسان کے مٹی ہو جانے والے ہر ذرے کو جانتے ہیں کہ وہ کہاں ہے، وہ نہ ہمارے علم سے باہر ہے اور نہ ہماری دسترس اور قدرت سے، ہم جب چاہیں گے اسے دوبارہ زندہ کر دیں گے، اب فرمایا خاک کے ذرّات کا وجود تو پھر بھی باقی رہتا ہے اور نظر آتا ہے، ہم تو انسان کی وہ چیزیں بھی جانتے ہیں جو اس سے بھی زیادہ مخفی ہیں اور بظاہر ان کا وجود بھی باقی نہیں رہتا، کیونکہ ہم نے انسان کو پیدا کیا ہے تو ہم سے بڑھ کر اسے کون جان سکتا ہے؟ فرمایا: « اَلَا يَعْلَمُ مَنْ خَلَقَ وَ هُوَ اللَّطِيْفُ الْخَبِيْرُ» [الملک: ۱۴] ’’کیا وہ نہیں جانتا جس نے پیدا کیا ہے اور وہی تو ہے جو نہایت باریک بین ہے، کامل خبر رکھنے والا ہے۔‘‘ چنانچہ ہم اس کے اقوال و افعال ہی کو نہیں اس کی ان باتوں کو بھی جانتے ہیں جن کا خیال اور وسوسہ اس کا نفس اس کے دل میں ڈالتا ہے۔ سو ہم صرف اسے زندہ ہی نہیں کریں گے، بلکہ زندہ کرنے کے بعد اس کے تمام اعمال کا محاسبہ بھی کریں گے اور محاسبے کے لیے اگرچہ ہمارا علم ہی کافی ہے، مگر ہم نے حجت پوری کرنے کے لیے اس کے ہر قول و فعل کو فرشتوں کے ذریعے سے لکھ کر محفوظ کرنے کا بھی بندوبست کیا ہے۔ ¤ ➋ {وَ نَحْنُ اَقْرَبُ اِلَيْهِ مِنْ حَبْلِ الْوَرِيْدِ: ’’ الْوَرِيْدِ ‘‘} دل سے نکلنے والی رگ جس کے کٹنے سے انسان مر جاتا ہے۔ دل میں اس کا نام ’’وتین‘‘ ہے، جیسا کہ فرمایا: «ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِيْنَ » [ الحاقۃ : ۴۶ ] ’’پھر ہم اس کی جان کی رگ کاٹ دیتے۔‘‘ اور گردن میں اس کا نام ’’وريد ‘‘ ہے، جو {’’وَرَدَ يَرِدُ‘‘} سے {’’فَعِيْلٌ‘‘} کے وزن پر ہے، کیونکہ خون دل سے اس میں وارد ہوتا ہے۔ {’’ حَبْلِ ‘‘} کا معنی بھی رگ ہے۔ {’’ حَبْلِ ‘‘} کی اضافت {’’ الْوَرِيْدِ ‘‘} کی طرف بیانیہ ہے، یعنی وہ رگ جو ورید ہے، جیسا کہ مسجد الجامع کی اضافت ہے۔ شاہ عبد القادر لکھتے ہیں : ’’گردن کی رگ مراد ہے جس میں جان پھرتی ہے دل سے دماغ تک۔ اس کے کٹنے سے موت ہے۔‘‘ ¤ ➌ ’’ہم اس کی رگِ جاں سے بھی زیادہ اس کے قریب ہیں‘‘ کیونکہ انسان کے جسم کے حصے تو ایک دوسرے کو چھپائے ہوئے ہوتے ہیں مگر اللہ تعالیٰ سے کوئی چیز چھپ نہیں سکتی۔ مفسر ابنِ کثیر نے یہاں {’’ نَحْنُ ‘‘} سے مراد فرشتے لیے ہیں، جیسا کہ سورۂ واقعہ کی آیت (۸۵) : «وَ نَحْنُ اَقْرَبُ اِلَيْهِ مِنْكُمْ وَ لٰكِنْ لَّا تُبْصِرُوْنَ » (اور ہم تم سے زیادہ اس کے قریب ہوتے ہیں اور لیکن تم نہیں دیکھتے) میں بعض ائمہ نے فرشتوں کا قریب ہونا مراد لیا ہے۔ اگرچہ اس معنی کی بھی گنجائش ہے، مگر الفاظ کے ظاہر کا تقاضا یہی ہے کہ یہ بات اللہ تعالیٰ اپنے متعلق فرما رہے ہیں اور اس بات کا یقین اور احساس کہ میرا رب میری رگِ جاں سے بھی زیادہ مجھ سے قریب ہے، انسان کو گناہوں کے ارتکاب سے زیادہ باز رکھنے والا اور اس سے محبت پیدا کرنے کا زیادہ باعث ہے۔ فتح البیان میں ہے، قشیری نے فرمایا : {’’ فِيْ هٰذِهِ الْآيَةِ هَيْبَةٌ وَ فَزَعٌ وَ خَوْفٌ لِقَوْمٍ وَ رَوْحٌ وَ أُنْسٌ وَ سُكُوْنُ قَلْبٍ لِقَوْمٍ ‘‘} ’’اس آیت  میں کچھ لوگوں کے لیے ہیبت، گھبراہٹ اور خوف کا اور کچھ لوگوں کے لیے راحت، انس اور سکونِ قلب کا سامان موجود ہے۔‘‘ ¤ ➍ قرآن مجید نے صریح الفاظ میں اللہ تعالیٰ کا عرش پر ہونا بیان فرمایا ہے : «اَلرَّحْمٰنُ عَلَى الْعَرْشِ اسْتَوٰى » [ طٰہٰ : ۵ ] ’’وہ بے حد رحم والا عرش پر بلند ہوا۔ ‘‘ پھر اس کا انسان کے قریب ہونے کا کیا مطلب ہے؟ یہ بحث ان شاء اللہ سورۂ حدید کی آیت (۴) : « وَ هُوَ مَعَكُمْ اَيْنَ مَا كُنْتُمْ » میں آئے گی۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {اِذْ يَتَلَقَّى الْمُتَلَقِّيٰنِ عَنِ الْيَمِيْنِ:’’تَلَقّٰي يَتَلَقّٰي‘‘} (تفعّل) لینا، استقبال کرنا۔ {’’ يَتَلَقَّى ‘‘} اور {’’ الْمُتَلَقِّيٰنِ‘‘} کا مفعول محذوف ہے : {’’أَيْ جَمِيْعَ أَقْوَالِهٖ وَ أَفْعَالِهٖ۔‘‘ ’’ اِذْ ‘‘} پچھلی آیت میں {’’ اَقْرَبُ ‘‘} کا ظرف ہے۔ مطلب یہ ہے کہ جب انسان کے دائیں اور بائیں جانب بیٹھے ہوئے دو فرشتے اس کے ہر قول و فعل کو لے کر لکھ رہے ہوتے ہیں تو اس وقت ہم اس کی رگِ جاں سے بھی زیادہ اس کے قریب ہوتے ہیں اور اس کے دل میں آنے والے وسوسے اور سینے کے راز بھی خوب جانتے ہوتے ہیں۔ ¤ ➋ { ’’ قَعِيْدٌ ‘‘} بمعنی {’’مُقَاعِدٌ‘‘} ہے، جیسے {’’جَلِيْسٌ‘‘} بمعنی {’’مُجَالِسٌ‘‘} ہے۔ یعنی وہ انسان کے ساتھ لازم رہتے ہیں۔ {’’ قَعِيْدٌ ‘‘} (ساتھ بیٹھے ہوئے) کا لفظ ان کے بیدار اور ہشیار رہنے کی کیفیت کے بیان کے لیے ہے کہ وہ انسان سے سرزد ہونے والے کسی بھی قول یا فعل کو لکھنے کے لیے ہر وقت تیار بیٹھے ہیں، کسی لمحے بھی ان کے الگ ہونے یا غفلت یا نیند کا سوال پیدا نہیں ہوتا۔ ¤ ➌ یہاں ایک سوال ہے کہ فرشتے تو دو ہیں مگر ان کی کیفیت بیان کرنے کے لیے لفظ {’’ قَعِيْدٌ ‘‘} لایا گیا ہے جو واحد ہے، اسے تثنیہ بنا کر {’’قَعِيْدَانِ‘‘} کیوں نہیں کہا گیا؟ مفسرین نے اس کے دو جواب دیے ہیں، ایک یہ کہ اس سے مراد {’’كُلُّ وَاحِدٍ مِّنْهُمَا ‘‘} ہے، یعنی ان دونوں میں سے ہر ایک تیار بیٹھا ہے۔ دوسرا یہ کہ {’’ قَعِيْدٌ ‘‘ ’’فَعِيْلٌ‘‘} کے وزن پر صفت کا صیغہ ہے اور {’’فَعِيْلٌ‘‘ } اور {’’فَعُوْلٌ‘‘} واحد، تثنیہ، جمع اور مذکر و مؤنث سب کے لیے اسی طرح استعمال کر لیا جاتا ہے۔ دونوں جواب درست ہیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) { مَا يَلْفِظُ مِنْ قَوْلٍ اِلَّا لَدَيْهِ رَقِيْبٌ عَتِيْدٌ: ’’ رَقِيْبٌ ‘‘} نگرانی کرنے والا اور {’’ عَتِيْدٌ ‘‘} تیار۔ اس آیت کے مفہوم کے قریب یہ آیات ہیں : « وَ اِنَّ عَلَيْكُمْ لَحٰفِظِيْنَ (10) كِرَامًا كَاتِبِيْنَ (11) يَعْلَمُوْنَ مَا تَفْعَلُوْنَ» [ الانفطار : ۱۰ تا ۱۲ ] ’’حالانکہ بلاشبہ تم پر یقینا نگہبان (مقرر) ہیں۔ جو بہت عزت والے ہیں، لکھنے والے ہیں۔ وہ جانتے ہیں جو تم کرتے ہو۔ ‘‘ اگرچہ انسان کا ہر قول و فعل اور ارادہ اللہ تعالیٰ کے علم میں ہے، مگر فرشتوں کے ذریعے سے کتابِ اعمال کی تیاری قیامت کے دن اس پر حجت قائم کرنے کے لیے ہے، فرمایا: «وَ نُخْرِجُ لَهٗ يَوْمَ الْقِيٰمَةِ كِتٰبًا يَّلْقٰىهُ مَنْشُوْرًا (13) اِقْرَاْ كِتٰبَكَ كَفٰى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيْبًا » [ بني إسرائیل:۱۳، ۱۴ ] ’’اور قیامت کے دن ہم اس کے لیے ایک کتاب نکالیں گے، جسے وہ کھولی ہوئی پائے گا۔اپنی کتاب پڑھ، آج تو خود اپنے آپ پر بطور محاسب بہت کافی ہے۔ ‘‘ آج کل آڈیو اور وڈیو کے ذریعے سے انسان کے تقریباً ہر قول و فعل کا مکمل نقشہ محفوظ کر لیا جاتا ہے۔ انسانی ایجادات کی اللہ تعالیٰ کی طرف سے فرشتوں کو عطا کردہ صلاحیتوں کے ساتھ کوئی نسبت ہی نہیں ہو سکتی۔ اس کتاب کو دیکھ کر بندوں کا جو حال ہوگا وہ اللہ تعالیٰ نے سورۂ کہف میں بیان فرمایا ہے : «وَ وُضِعَ الْكِتٰبُ فَتَرَى الْمُجْرِمِيْنَ مُشْفِقِيْنَ مِمَّا فِيْهِ وَ يَقُوْلُوْنَ يٰوَيْلَتَنَا مَالِ هٰذَا الْكِتٰبِ لَا يُغَادِرُ صَغِيْرَةً وَّ لَا كَبِيْرَةً اِلَّاۤ اَحْصٰىهَا وَ وَجَدُوْا مَا عَمِلُوْا حَاضِرًا وَ لَا يَظْلِمُ رَبُّكَ اَحَدًا » [ الکھف : ۴۹ ] ’’اور کتاب رکھی جائے گی، پس تو مجرموں کو دیکھے گا کہ اس سے ڈرنے والے ہوں گے جو اس میں ہوگا اور کہیں گے ہائے ہماری بربادی! اس کتاب کو کیا ہے، نہ کوئی چھوٹی بات چھوڑتی ہے اور نہ بڑی مگر اس نے اسے ضبط کر رکھا ہے، اور انھوں نے جو کچھ کیا اسے موجود پائیں گے اور تیرا رب کسی پر ظلم نہیں کرتا۔ ‘‘"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { وَ جَآءَتْ سَكْرَةُ الْمَوْتِ:} یہ ذکرکرنے کے بعد کہ انسان جو کچھ کرتا ہے سب اللہ کو معلوم ہے اور انسان کی کتابِ اعمال میں بھی لکھا ہوا اور محفوظ ہے اور اس کے سامنے پیش آنے والا ہے، اب اس حقیقت کے انسان کے سامنے آنے کے دو وقت بیان فرمائے، پہلا موت کا وقت اور دوسرا قیامت کا وقت۔ اس آیت میں موت کا ذکر ہے، موت کی بے ہوشی سے مراد اس کی سختی اور شدت ہے۔ اللہ تعالیٰ نے یہاں موت اور قیامت کے لیے ماضی کے صیغے استعمال فرمائے ہیں، یعنی {’’ وَ جَآءَتْ سَكْرَةُ الْمَوْتِ ‘‘} (اور موت کی بے ہوشی آ گئی) اور {’’ وَ نُفِخَ فِي الصُّوْرِ ‘‘} (اور صور میں پھونکا گیا) حالانکہ یہ کام آئندہ ہونے والے ہیں، تو مقصد وہ نقشہ سامنے لانا اور یہ باور کروانا ہے کہ ان کا آنا اتنا یقینی ہے کہ سمجھو وہ آ چکے۔ ¤ ➋ عائشہ رضی اللہ عنھا نے رسول اللہ صلی اللہ علیہ وسلم کے آخری وقت کا حال بیان کرتے ہوئے فرمایا کہ آپ صلی اللہ علیہ وسلم کے سامنے پانی کا ایک پیالہ تھا، آپ صلی اللہ علیہ وسلم اپنے دونوں ہاتھ اس میں ڈالتے اور انھیں چہرے پر پھیرتے جاتے تھے اور ساتھ یہ فرماتے تھے : [ لاَ إِلٰهَ إِلاَّ اللّٰهُ ، إِنَّ لِلْمَوْتِ سَكَرَاتٍ ] [ بخاري، المغازي، باب مرض النبي صلی اللہ علیہ وسلم و وفاتہ : ۴۴۴۹ ] ’’لا الٰہ الا اللہ، یقینا موت کی بہت سختیاں ہیں۔ ‘‘ ¤ ➌ { بِالْحَقِّ:} موت کی بے ہوشی کے حق کو لے کر آنے کا مطلب یہ ہے کہ جان نکلنے کی سختی کے ساتھ ہی وہ حقیقت سامنے آ جائے گی جس پر دنیا میں پردہ پڑا ہوا ہے اور آدمی آنکھوں سے دیکھ لے گا کہ رسولوں نے جو بات بتائی تھی وہ حق اور سچ تھی۔ ¤ ➍ { ذٰلِكَ مَا كُنْتَ مِنْهُ تَحِيْدُ: ’’حَادَ يَحِيْدُ حَيْدَةً‘‘} ({ بَاعَ يَبِيْعُ})کسی چیز سے کنی کترانا، بچ کر نکلنا، دور بھاگنا۔ ہر انسان ہی طبعی طور پر موت سے بھاگتا ہے، مگر اس سے چارہ نہیں اور نہ ہی انسان کی سدا زندہ رہنے کی خواہش پوری ہو سکتی ہے۔ دیکھیے سورئہ جمعہ (۸) اور احزاب (۱۶) کی تفسیر۔ یعنی یہ وہ حقیقت ہے جس کا سامنا کرنے سے تو پہلو تہی کرتا اور کنی کتراتا تھا اور چاہتا تھا کہ اس سے بچ کر اپنی من مانی کرتا رہے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {وَ نُفِخَ فِي الصُّوْرِ …:} موت کے بعد یہ دوسرا موقع ہے جب انسان کے سامنے یہ حقیقت کھل کر آ جائے گی کہ وہ جو کچھ کرتا تھا سب اللہ تعالیٰ کے علم میں تھا اور کرامًا کاتبین کے ذریعے سے محفوظ ہو رہا تھا۔ یہاں صور میں پھونکے جانے سے مراد دوسری دفعہ پھونکا جانا ہے، جب ہر آدمی قبر سے نکل کر اللہ تعالیٰ کے حضور پیش ہو جائے گا۔ ’’وعيد‘‘ دھمکی اور سزا کے وعدے کو کہتے ہیں، یعنی تمھیں نافرمانی پر جو وعید سنائی گئی تھی یہ اس کے پورے ہونے کا دن ہے۔ ’’نفخ صور‘‘ کے لیے دیکھیے سورۂ ابراہیم (۴۷ تا ۵۱)، طٰہٰ (۱۰۲)، حج (۱)، یٰس (۵۱) اور سورۂ زمر (۶۸)۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {وَ جَآءَتْ كُلُّ نَفْسٍ مَّعَهَا سَآىِٕقٌ وَّ شَهِيْدٌ:’’ سَآىِٕقٌ ‘‘ ’’ سَاقَ يَسُوْقُ سَوْقًا ‘‘} سے اسم فاعل ہے، ہانکنے والا جو جانوروں کو یا کسی گروہ کو ہانک کر کسی جگہ پہنچاتا ہے۔ {’’ شَهِيْدٌ ‘‘} شہادت دینے والا۔ یعنی قبر سے نکلتے ہی ہر کافر کے ساتھ ایک فرشتہ ہانکنے والا ہو گا جو اسے ہانک کر محشر کی طرف لے جائے گا اور ایک اس کے اعمالِ بد کی شہادت دینے والا ہو گا۔ یہ فرشتہ کراماً کاتبین میں سے بھی ہو سکتا ہے جو اس کا نامۂ اعمال لے کر شہادت کے لیے حاضر ہو گا۔ گویا مجرم بھی حاضر ہو گا اور اس کے خلاف مکمل شہادتیں بھی حاضر ہوں گی۔ {’’ كُلُّ نَفْسٍ ‘‘} سے مراد یہاں ہر کافر و مشرک ہے، کیونکہ اس اہانت اور تذلیل کے ساتھ کفار ہی کو لے جایا جائے گا۔ بعد کی آیات سے بھی یہ بات واضح ہو رہی ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {لَقَدْ كُنْتَ فِيْ غَفْلَةٍ مِّنْ هٰذَا: ’’ غَفْلَةٍ ‘‘} میں تنوین تعظیم کے لیے ہے، اس لیے ترجمہ ’’بڑی غفلت‘‘ کیا گیا ہے۔ یہاں یہ الفاظ محذوف ہیں کہ ’’ہر کافر و مشرک سے کہا جائے گا کہ…۔‘‘ یہ آیت بھی دلیل ہے کہ {’’ كُلُّ نَفْسٍ ‘‘} سے مراد کفار ہیں، کیونکہ وہی آخرت سے غافل ہیں، مومن تو آخرت کا یقین رکھتے ہیں اور اس کی فکر میں رہتے ہیں۔ کفار کو یہ بات ذلیل کرنے کے لیے طنز کے طور پر کہی جائے گی۔ ¤ ➋ { فَكَشَفْنَا عَنْكَ غِطَآءَكَ … :} یعنی تیری آنکھوں پر پڑا ہوا غفلت کا پردہ، جس کی وجہ سے تو آخرت کا انکار کرتا تھا، وہ پردہ اب ہم نے دور کر دیا ہے، اس لیے تیری نظر تیز ہو چکی ہے اور تو اپنی آنکھوں کے ساتھ ان تمام حقیقتوں کو دیکھ سکتا ہے جن کا انکار کر تا تھا۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23){ وَ قَالَ قَرِيْنُهٗ هٰذَا مَا لَدَيَّ عَتِيْدٌ: ’’قَرِيْنٌ‘‘} ساتھی۔ یعنی وہ فرشتہ جو اسے ہانک کر محشر میں لانے پر مقرر تھا کہے گا، اے رب! وہ مجرم جسے لانے پر تو نے مجھے مقرر فرمایا تھا یہ میرے پاس حاضری کے لیے تیار ہے اور وہ فرشتہ جو شہادت کے لیے ساتھ تھا کہے گا، اس کے متعلق جس جس شہادت کی ضرورت ہے وہ یہ ہے جو میرے پاس تیار ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24تا26) {اَلْقِيَا فِيْ جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيْدٍ … :} اللہ تعالیٰ ان دونوں فرشتوں سے فرمائے گا کہ ہر ایسے شخص کو جہنم میں پھینک دو جو سخت ناشکرا، بہت عناد رکھنے والا، خیر کو بہت روکنے والا، حد سے گزرنے والا اور شک کرنے والا ہے، جس نے اللہ کے ساتھ اور معبود بنا رکھا تھا، سو اسے شدید عذاب میں پھینک دو۔ اس میں اسے جہنم میں پھینکنے کے فیصلے کے ساتھ اس فیصلے کی وجہ اور اس کے دلائل بھی بیان فرما دیے ہیں اور یہ بھی کہ صرف ایک کو نہیں بلکہ ان جرائم کے مرتکب تمام مجرموں کو جہنم میں پھینک دو۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 24تا26) {اَلْقِيَا فِيْ جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيْدٍ … :} اللہ تعالیٰ ان دونوں فرشتوں سے فرمائے گا کہ ہر ایسے شخص کو جہنم میں پھینک دو جو سخت ناشکرا، بہت عناد رکھنے والا، خیر کو بہت روکنے والا، حد سے گزرنے والا اور شک کرنے والا ہے، جس نے اللہ کے ساتھ اور معبود بنا رکھا تھا، سو اسے شدید عذاب میں پھینک دو۔ اس میں اسے جہنم میں پھینکنے کے فیصلے کے ساتھ اس فیصلے کی وجہ اور اس کے دلائل بھی بیان فرما دیے ہیں اور یہ بھی کہ صرف ایک کو نہیں بلکہ ان جرائم کے مرتکب تمام مجرموں کو جہنم میں پھینک دو۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 24تا26) {اَلْقِيَا فِيْ جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيْدٍ … :} اللہ تعالیٰ ان دونوں فرشتوں سے فرمائے گا کہ ہر ایسے شخص کو جہنم میں پھینک دو جو سخت ناشکرا، بہت عناد رکھنے والا، خیر کو بہت روکنے والا، حد سے گزرنے والا اور شک کرنے والا ہے، جس نے اللہ کے ساتھ اور معبود بنا رکھا تھا، سو اسے شدید عذاب میں پھینک دو۔ اس میں اسے جہنم میں پھینکنے کے فیصلے کے ساتھ اس فیصلے کی وجہ اور اس کے دلائل بھی بیان فرما دیے ہیں اور یہ بھی کہ صرف ایک کو نہیں بلکہ ان جرائم کے مرتکب تمام مجرموں کو جہنم میں پھینک دو۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) {قَالَ قَرِيْنُهٗ رَبَّنَا مَاۤ اَطْغَيْتُهٗ … :} کافر جب یہ حکم سنے گا تو کہے گا، اے میرے رب! میرا کوئی گناہ نہیں، مجھے تو میرے قرین (ساتھی) نے گمراہ کیا۔ اس کے جواب میں اس کا قرین (ساتھی) کہے گا، اے ہمارے رب! میں نے اسے سرکش نہیں بنایا، بلکہ یہ خود ہی بہت دور کی گمراہی میں مبتلا تھا، میں نے اس پر کوئی زبردستی نہیں کی۔اگر یہ خود انتہائی گمراہ نہ ہوتا تو میرے کہنے سے کبھی سرکشی اختیار نہ کرتا۔ ’’قرین‘‘ سے مراد وہ شیطان بھی ہے جو انسان کے ساتھ رہ کر اسے گمراہ کرتا رہتا ہے اور انسانوں میں سے برے ساتھی بھی جو اسے برائی کا درس دیتے اور اس پر ابھارتے رہتے ہیں۔ قیامت کے دن جب مجرم یہ بہانہ بنائے گا کہ ان لوگوں نے مجھے گمراہ کیا تو وہ اس سے صاف براء ت کا اظہار کر دیں گے۔ ان گمراہ کرنے والے شیاطین الانس و الجن کے اپنے گمراہ کردہ لوگوں سے بری ہونے کی تفصیل کے لیے دیکھیے سورۂ بقرہ (۱۶۷)، اعراف، (۳۸، ۳۹)، ابراہیم (۲۱)، سبا (۳۱ تا ۳۳) اور سورۂ ص (۵۵ تا ۶۱)۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) {قَالَ لَا تَخْتَصِمُوْا لَدَيَّ وَ قَدْ قَدَّمْتُ اِلَيْكُمْ بِالْوَعِيْدِ:} اللہ تعالیٰ ان کا جھگڑا سن کر فرمائے گا، اب یہاں میرے پاس مت جھگڑو، اس جھگڑے سے تمھیں کچھ حاصل نہیں ہو گا، کیونکہ میں نے تو تمھیں پہلے ہی رسول بھیج کر نافرمانی کی سزا سے آگاہ کر دیا تھا، مگر تم نے پروا نہیں کی، اب اپنے کفر و عناد کی سزا بھگتو۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ:} یعنی میں نے جو تمھیں جہنم میں ڈالنے کا فیصلہ کر دیا ہے وہ اب بدل نہیں سکتا۔ مزید دیکھیے سورئہ ص (۸۴، ۸۵) کی تفسیر۔ اس کی ایک تفسیر یہ بھی ہے کہ میرے پاس کوئی بات کو بدل نہیں سکتا اور نہ یہاں کسی کا جھوٹ چل سکتا ہے، کیونکہ میں تمام باتیں جانتا ہوں۔ اس کے مطابق اشارہ قرین کے یہ کہنے کی طرف ہو گا : «مَاۤ اَطْغَيْتُهٗ » ’’میں نے اسے سرکش نہیں بنایا۔‘‘ (التسہیل) یعنی یہاں نہ مجرم کا جھوٹ چل سکتا ہے نہ اس کے قرین کا، دونوں ’’کفار عنید‘‘ ہیں اور ’’کفار عنید‘‘ جو بھی ہے اسے جہنم میں ڈالا جائے گا۔ ¤ ➋ { وَ مَاۤ اَنَا بِظَلَّامٍ لِّلْعَبِيْدِ:} یعنی اگر میں نے پہلے نہ بتایا ہوتا اور تمھیں جہنم میں ڈالتا تو یہ شدید ظلم ہوتا جو میں اپنے بندوں پر کسی صورت کرنے والا نہیں۔ مزید دیکھیے سورۂ آلِ عمران (۱۸۲) اور سورئہ حج (۱۰)۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {يَوْمَ نَقُوْلُ لِجَهَنَّمَ هَلِ امْتَلَاْتِ … :} یعنی یہ سب کچھ اس دن واقع ہو گا جب ہم جہنم سے کہیں گے کیا تو بھر گئی۔ اس کی سب سے صحیح تفسیر وہ ہے جو انس رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے نقل کی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا : [ يُلْقٰی فِي النَّارِ وَ تَقُوْلُ هَلْ مِنْ مَّزِيْدٍ حَتّٰی يَضَعَ قَدَمَهُ فَتَقُوْلُ قَطْ قَطْ ] [ بخاري، التفسیر، سورۃ قٓ، باب قولہ : « وتقول ھل من مزید» : ۴۸۴۸ ] ’’جہنم میں لوگ ڈالے جائیں گے اور وہ یہی کہتی رہے گی، کیا کچھ اور بھی ہے؟ یہاں تک کہ اللہ تعالیٰ اس میں اپنا قدم رکھ دے گا تو وہ کہہ اٹھے گی، بس بس۔‘‘ بعض لوگوں کے کہنے کے مطابق جہنم یہ بات زبان حال سے کہے گی، مگر اس تاویل کی ضرورت وہاں ہوتی ہے جہاں حقیقت ممکن نہ ہو اور یہاں تو ہر چیز کو اللہ تعالیٰ نے زبان دے رکھی ہے جس کی بولی اگر ہم نہیں سمجھتے تو پیدا کرنے والا خوب سمجھتا ہے، جیسا کہ فرمایا : « وَ اِنْ مِّنْ شَيْءٍ اِلَّا يُسَبِّحُ بِحَمْدِهٖ وَ لٰكِنْ لَّا تَفْقَهُوْنَ تَسْبِيْحَهُمْ» [ بني إسرائیل : ۴۴ ] ’’اور کوئی بھی چیز نہیں مگر اس کی حمد کے ساتھ تسبیح کرتی ہے اور لیکن تم ان کی تسبیح نہیں سمجھتے۔‘‘ اور فرمایا : «وَ قَالُوْا لِجُلُوْدِهِمْ لِمَ شَهِدْتُّمْ عَلَيْنَا١ؕ قَالُوْۤا اَنْطَقَنَا اللّٰهُ الَّذِيْۤ اَنْطَقَ كُلَّ شَيْءٍ » [ حٰمٓ السجدۃ : ۲۱ ] ’’اور وہ اپنے چمڑوں سے کہیں گے تم نے ہمارے خلاف شہادت کیوں دی؟ وہ کہیں گے ہمیں اس اللہ نے بلوا دیا جس نے ہر چیز کو بلوایا۔‘‘"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) {وَ اُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِيْنَ غَيْرَ بَعِيْدٍ:} قرآن کے عام اُسلوب کے مطابق جہنمیوں کے ساتھ اہلِ جنت کا ذکر بھی فرمایا۔ یعنی متقی لوگوں کی تکریم کے لیے جنت ان کے قریب لائی جائے گی، تاکہ انھیں چلنے کی تکلیف نہ اٹھانا پڑے۔ ¤ {’’ غَيْرَ بَعِيْدٍ ‘‘} کا لفظ تاکید کے لیے ہے، جیسے فرمایا : « وَ اَضَلَّ فِرْعَوْنُ قَوْمَهٗ وَ مَا هَدٰى » [ طٰہٰ : ۷۹ ] ’’اور فرعون نے اپنی قوم کو گمراہ کیا اور سیدھے راستے پر نہ ڈالا۔ ‘‘ اور رسول اللہ صلی اللہ علیہ وسلم نے بارش کی دعا میں فرمایا : [ نَافِعًا غَيْرَ ضَارٍّ عَاجِلاً غَيْرَ آجِلٍ ] [ أبو داوٗد، صلاۃ الاستسقاء، باب رفع الیدین في الاستسقاء : ۱۱۶۹ ] ’’(اے اللہ! وہ بارش) نفع آور ہو، کسی ضرر کا باعث نہ بنے اور جلدی آئے، دیر نہ کرے۔‘‘"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) {هٰذَا مَا تُوْعَدُوْنَ لِكُلِّ اَوَّابٍ حَفِيْظٍ:’’ اَوَّابٍ ‘‘ ’’آبَ يَؤُوْبُ أَوْبًا‘‘} (ن) سے مبالغے کا صیغہ ہے، بہت رجوع کرنے والا، جو ہر معاملے میں اللہ کی طرف بہت رجوع کرے اور کوئی قدم اپنی خواہش کی بنا پر نہ اٹھائے، اسی طرح ہر لغزش کے بعد اللہ کی طرف رجوع کرکے توبہ و استغفار کرے۔ {’’ حَفِيْظٍ ‘‘} جو اللہ کے احکامات کی خوب حفاظت اور پابندی کرنے والا ہو۔ یعنی جنتیوں سے کہا جائے گا کہ یہ ہے وہ جنت جس کا تم سے ہر ایسے شخص کے لیے وعدہ کیا جاتا تھا جو اللہ کی طرف بہت رجوع کرنے والا، اس کے احکام کی خوب پابندی کرنے والا ہو۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ { مَنْ خَشِيَ الرَّحْمٰنَ بِالْغَيْبِ:} یعنی رحمان کو دیکھے بغیر اس سے ڈرتا ہے اور اس وقت بھی ڈرتا ہے جب وہ لوگوں سے غائب ہوتا ہے، کوئی اس کے پاس نہیں ہوتا۔ یہاں ایک سوال ہے کہ خشیت کے ساتھ لفظ ’’رحمان‘‘ لانے میں کیا حکمت ہے؟ جواب اس کا یہ ہے کہ رحمان کا لفظ لانے میں اس شخص کی تعریف مقصود ہے کہ وہ اللہ کی رحمت اور اس کے معاف کر دینے کی صفت کا علم رکھنے کے باوجود اس سے ڈرتا ہے۔ (زمخشری) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: [ سَبْعَةٌ يُظِلُّهُمُ اللّٰهُ تَعَالٰی فِيْ ظِلِّهِ يَوْمَ لَا ظِلَّ إِلاَّ ظِلُّهُ ] ’’سات آدمی ہیں جنھیں اللہ تعالیٰ اپنے سائے میں جگہ دے گا جب اس کے سائے کے سوا کوئی سایہ نہ ہوگا۔‘‘ ان میں سے پانچویں کے بارے میں فرمایا : [ وَ رَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ فَقَالَ إِنِّيْ أَخَافُ اللّٰهَ ] ’’اور وہ آدمی ہے جسے اونچے حسب اور جمال والی عورت نے دعوت دی تو اس نے کہا میں اللہ سے ڈرتا ہوں۔‘‘ اور آخر میں فرمایا : [ وَ رَجُلٌ ذَكَرَ اللّٰهَ خَالِيًا فَفَاضَتْ عَيْنَاهُ ] [ بخاري، الزکاۃ، باب الصدقۃ بالیمین : ۱۴۲۳ ] ’’اور ایک وہ آدمی جس نے اکیلے ہونے کی حالت میں اللہ کو یاد کیا تو اس کی آنکھیں بہ پڑیں۔‘‘ ¤ ➋ { وَ جَآءَ بِقَلْبٍ مُّنِيْبٍ:} یعنی اس کے دل کا رجوع اللہ ہی کی طرف رہتا ہے۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) { ادْخُلُوْهَا بِسَلٰمٍ …:} یعنی ان کی عزت افزائی کے لیے کہا جائے گا کہ سلام کے ساتھ اس میں داخل ہو جاؤ۔ سلام کا مطلب یہ ہے کہ ہر قسم کے خوف، غم اور فکر سے سلامت رہ کر اس میں داخل ہو جاؤ اور یہ مطلب بھی ہو سکتا ہے کہ اس میں اس حال میں داخل ہو جاؤ کہ تم پر فرشتوں اور پروردگار کی طرف سے سلام ہے، جیسا کہ فرمایا : « سَلٰمٌ قَوْلًا مِّنْ رَّبٍّ رَّحِيْمٍ» [ یٰسٓ : ۵۸ ] ’’سلام ہو۔ اس رب کی طرف سے کہا جائے گا جو بے حد مہربان ہے۔ ‘‘ اب تم ہمیشہ یہاں رہو گے، کبھی اس سے نکالے نہیں جاؤ گے۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ {لَهُمْ مَّا يَشَآءُوْنَ فِيْهَا:} اس کی تفسیر کے لیے دیکھیے سورۂ حم السجدہ (۳۱) اور سورئہ زخرف (۷۱)۔ ¤ ➋ { وَ لَدَيْنَا مَزِيْدٌ:} یعنی جو کچھ وہ چاہیں گے وہ بھی ملے گا اور ہمارے پاس مزید بھی بہت کچھ ہے، جس میں وہ چیزیں ہیں جن کا خیال تک کسی کو نہیں آیا۔ (دیکھیے سجدہ : ۱۷) اور سب سے بڑھ کر اللہ تعالیٰ کا دیدار بھی۔ دیکھیے سورۂ یونس (۲۶)۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) ➊ {وَ كَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍ …:’’ فَنَقَّبُوْا ‘‘} نقب کا معنی سوراخ ہے۔ {’’نَقَبَ (ن) فِي الْأَرْضِ‘‘} زمین میں گھوما پھرا۔ {’’نَقَّبَ تَنْقِيْبًا‘‘} (تفعیل) میں حروف زیادہ ہونے کی وجہ سے معنی میں مبالغہ ہے، خوب گھوما پھرا۔ نقب (سوراخ) کی مناسبت سے {’’ فَنَقَّبُوْا فِي الْبِلَادِ ‘‘} کا ترجمہ کیا گیا ہے : ’’پس انھوں نے شہروں کو چھان مارا۔‘‘ اس سے پہلے کفار کو آخرت میں دیے جانے والے عذاب کا ذکر فرمایا، درمیان میں ایمان والوں کے حسن انجام کا ذکر کرنے کے بعد اب کفار کو دنیا میں دیے جانے والے ہولناک عذابوں کا ذکر فرمایا۔ مقصود کفار کو ڈرانا اور رسول اللہ صلی اللہ علیہ وسلم اور ایمان والوں کو تسلی دلانا ہے کہ وہ کفار کی شان و شوکت سے مرعوب نہ ہوں۔ ¤ ➋ یعنی ہم نے ان کفار سے پہلے بہت سی نسلیں ہلاک کر دیں جو گرفت میں ان سے بہت سخت اور ان سے زیادہ قوت والی تھیں، جیسا کہ قومِ نوح، عاد، ثمود اور قومِ فرعون وغیرہ۔ تو ان کے مقابلے میں ان بے چاروں کی کیا بساط ہے؟ مزید دیکھیے سورۂ روم (۹)۔ ¤ ➌ {فَنَقَّبُوْا فِي الْبِلَادِ:} یعنی وہ اہلِ مکہ سے تجارت اور کاروبار میں بھی بہت آگے تھے، چنانچہ انھوں نے اس مقصد کے لیے دنیا کے شہروں کو چھان مارا تھا۔ بعض اہلِ علم نے اس کا مطلب یہ بیان کیا ہے کہ وہ اپنے ملک ہی پر قوت و گرفت نہیں رکھتے تھے بلکہ دنیا کے دوسرے ملکوں میں بھی جاگھسے تھے۔ ¤ ➍ {هَلْ مِنْ مَّحِيْصٍ: ’’ مَحِيْصٍ ‘‘ ’’حَاصَ يَحِيْصُ حَيْصًا‘‘} سے ظرف ہے، بھاگنے کی جگہ۔ یعنی جب ان پر عذاب آیا تو وہ اس سے بھاگنے کی جگہ ڈھونڈتے پھرے کہ کیا بھاگنے کی کوئی جگہ ہے، مگر انھیں کہیں جائے پناہ نہ ملی۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) { اِنَّ فِيْ ذٰلِكَ لَذِكْرٰى لِمَنْ كَانَ لَهٗ قَلْبٌ …:’’ قَلْبٌ ‘‘} نکرہ ہے، اس لیے ترجمہ ’’کوئی دل‘‘ کیا گیا ہے۔ نصیحت حاصل کرنے کے دو ہی ذریعے ہیں، یا تو آدمی خود غور و فکر کرے اور عقل سے کام لے یا کسی خیر خواہ کی بات توجہ سے سن کر اس پر عمل کر لے۔ یعنی اس سورت میں جو کچھ بیان کیا گیا ہے اس سے نصیحت وہی حاصل کر سکتا ہے جو کوئی دل رکھتا ہو جس کے ساتھ اس پر غور و فکر کرے۔ ’’کوئی دل‘‘ کا مطلب یہ ہے کہ وہ دل کے ساتھ معمولی سا غور و فکر بھی کرے، یا دل کی حاضری کے ساتھ ان آیات کو سن لے۔ مگر کفار کا حال یہ ہے : «لَهُمْ قُلُوْبٌ لَّا يَفْقَهُوْنَ بِهَا وَ لَهُمْ اَعْيُنٌ لَّا يُبْصِرُوْنَ بِهَا وَ لَهُمْ اٰذَانٌ لَّا يَسْمَعُوْنَ بِهَا» [ الأعراف : ۱۷۹ ] ’’ان کے دل ہیں جن کے ساتھ وہ سمجھتے نہیں اور ان کی آنکھیں ہیں جن کے ساتھ وہ دیکھتے نہیں اور ان کے کان ہیں جن کے ساتھ وہ سنتے نہیں۔‘‘ اور قیامت کے دن وہ خود تسلیم کریں گے : « لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ مَا كُنَّا فِيْۤ اَصْحٰبِ السَّعِيْرِ» [ الملک: ۱۰ ] ’’اگر ہم سنتے ہوتے یا سمجھتے ہوتے تو ہم بھڑکتی ہوئی آگ والوں میں سے نہ ہوتے ۔ ‘‘"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ {وَ لَقَدْ خَلَقْنَا السَّمٰوٰتِ وَ الْاَرْضَ وَ مَا بَيْنَهُمَا فِيْ سِتَّةِ اَيَّامٍ … :} قیامت کی دلیل کے طور پر آسمان و زمین کے پیدا کرنے کا دوبارہ ذکر فرمایا کہ بلاشبہ یقینا ہم نے یہ سارے آسمان اور زمین چھ دن میں پیدا کیے اور ہمیں کسی قسم کی تھکاوٹ نے چھوا تک نہیں، تو ہم انسان کو دوبارہ کیوں زندہ نہیں کر سکتے؟ یہی بات پہلے فرمائی تھی : « اَفَعَيِيْنَا بِالْخَلْقِ الْاَوَّلِ » [ قٓ : ۱۵ ] ’’تو کیا ہم پہلی دفعہ پیدا کرنے کے ساتھ تھک کر رہ گئے ہیں؟‘‘ دوبارہ اس لیے ذکر فرمائی کہ بار بار دہرانے سے بات ذہن میں بیٹھ جاتی ہے۔ ¤ ➋ {وَ مَا مَسَّنَا مِنْ لُّغُوْبٍ:} اس میں یہود و نصاریٰ کا ردّ بھی ہے جنھوں نے اللہ تعالیٰ پر بہتان باندھا کہ اس نے آسمانوں اور زمین کو چھ دنوں میں پیدا فرمایا اور ساتویں دن آرام کیا۔ کتاب مقدس میں تورات کے سفر التکوین (۲:۲) کے الفاظ ہیں : {’’فَاسْتَرَاحَ فِي الْيَوْمِ السَّابِعِ‘‘} یعنی ’’ساتویں دن میں آرام کیا۔‘‘"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 40،39) ➊ {فَاصْبِرْ عَلٰى مَا يَقُوْلُوْنَ وَ سَبِّحْ بِحَمْدِ رَبِّكَ …:} اس کی تفسیر کے لیے دیکھیے سورۂ طہٰ (۱۳۰) کی تفسیر۔ ¤ ➋ {وَ اَدْبَارَ السُّجُوْدِ:} صحیح بخاری میں ہے کہ ابن عباس رضی اللہ عنھما نے فرمایا : [ أَمَرَهُ أَنْ يُسَبِّحَ فِيْ أَدْبَارِ الصَّلَوَاتِ كُلِّهَا يَعْنِيْ قَوْلَهُ: «وَ اَدْبَارَ السُّجُوْدِ » ] [ بخاري، التفسیر، باب قولہ : « و سبح بحمد ربک…» : ۴۸۵۲ ] {’’ وَ اَدْبَارَ السُّجُوْدِ ‘‘} کا مطلب یہ ہے کہ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو حکم دیا کہ آپ تمام نمازوں کے بعد تسبیح پڑھا کریں۔‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جو شخص ہر نماز کے بعد تینتیس(۳۳) دفعہ سبحان اللہ، تینتیس(۳۳) دفعہ الحمد للہ اور تینتیس (۳۳) دفعہ اللہ اکبر کہے تو یہ ننانوے(۹۹) ہو گئے اور سو (۱۰۰) پورا کرنے کے لیے کہے: [ لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلٰی كُلِّ شَيْءٍ قَدِيْرٌ ] تو اس کے گناہ بخش دیے جاتے ہیں، خواہ سمندر کی جھاگ کے برابر ہوں۔‘‘ [ مسلم، المساجد، باب استحباب الذکر بعد الصلاۃ… : ۵۹۷ ]"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40،39) ➊ {فَاصْبِرْ عَلٰى مَا يَقُوْلُوْنَ وَ سَبِّحْ بِحَمْدِ رَبِّكَ …:} اس کی تفسیر کے لیے دیکھیے سورۂ طہٰ (۱۳۰) کی تفسیر۔ ¤ ➋ {وَ اَدْبَارَ السُّجُوْدِ:} صحیح بخاری میں ہے کہ ابن عباس رضی اللہ عنھما نے فرمایا : [ أَمَرَهُ أَنْ يُسَبِّحَ فِيْ أَدْبَارِ الصَّلَوَاتِ كُلِّهَا يَعْنِيْ قَوْلَهُ: «وَ اَدْبَارَ السُّجُوْدِ » ] [ بخاري، التفسیر، باب قولہ : « و سبح بحمد ربک…» : ۴۸۵۲ ] {’’ وَ اَدْبَارَ السُّجُوْدِ ‘‘} کا مطلب یہ ہے کہ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو حکم دیا کہ آپ تمام نمازوں کے بعد تسبیح پڑھا کریں۔‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جو شخص ہر نماز کے بعد تینتیس(۳۳) دفعہ سبحان اللہ، تینتیس(۳۳) دفعہ الحمد للہ اور تینتیس (۳۳) دفعہ اللہ اکبر کہے تو یہ ننانوے(۹۹) ہو گئے اور سو (۱۰۰) پورا کرنے کے لیے کہے: [ لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلٰی كُلِّ شَيْءٍ قَدِيْرٌ ] تو اس کے گناہ بخش دیے جاتے ہیں، خواہ سمندر کی جھاگ کے برابر ہوں۔‘‘ [ مسلم، المساجد، باب استحباب الذکر بعد الصلاۃ… : ۵۹۷ ]"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ {وَ اسْتَمِعْ … :} پچھلی آیت میں اللہ تعالیٰ نے کفار کی بے ہودہ گوئی پر صبر اور اپنی تسبیح و تحمید کا حکم دیا، اس آیت میں آپ کی تسلی کے لیے قیامت کے دن کا ذکر فرمایا کہ تھوڑا صبر کریں ان کی جزا کے لیے قیامت کا دن آیا ہی چاہتا ہے۔ ابن عطیہ نے {’’ اسْتَمِعْ ‘‘} کا معنی {’’ اِنْتَظِرْ ‘‘} کیا ہے، یعنی صبر کے ساتھ اس دن کا انتظار کریں…۔ اگر اس کا لفظی معنی ’’کان لگا کر سن‘‘ کیا جائے تو اس سے مراد بھی آپ کو تسلی دینا ہے کہ قیامت اتنی قریب ہے گویا اس میں پکارنے والے کی منادی کی آواز آپ کے کانوں میں آ رہی ہے۔ زمخشری نے فرمایا : {’’ وَ اسْتَمِعْ يَوْمَ يُنَادِ الْمُنَادِ ‘‘} کا مطلب یہ ہے کہ کان لگا کر سن قیامت کے دن کا حال جو میں تمھیں بتانے لگا ہوں۔‘‘ ¤ ➋ { يَوْمَ يُنَادِ الْمُنَادِ:} اس سے مراد صور میں دوسری دفعہ پھونکے جانے کا وقت ہے، جب فرشتہ صور میں پھونک مار کر سب لوگوں کو قبروں سے نکل کر محشر میں جمع ہو جانے کے لیے آواز دے گا۔ دیکھیے سورۂ قمر (۶ تا ۸)۔ ¤ ➌ { مِنْ مَّكَانٍ قَرِيْبٍ:} یعنی قبروں میں پڑے ہوئے ہر شخص کو وہ آواز بالکل قریب سے آتی ہوئی سنائی دے گی۔ موجودہ سائنسی ایجادات سے یہ بات سمجھنا بہت آسان ہو گیا ہے۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) { يَّوْمَ يَسْمَعُوْنَ الصَّيْحَةَ بِالْحَقِّ …:} یعنی تمام لوگ وہ ہولناک آواز سنیں گے۔ {’’ بِالْحَقِّ ‘‘} کا مطلب یہ ہے کہ یہ بات مجازاً نہیں کہی جا رہی بلکہ وہ اس ہولناک چیخ کو حقیقتاً، فی الواقع اور یقینا سنیں گے۔ یہ بات اتنی تاکید کے ساتھ اس لیے فرمائی کہ کفار اس کا انکار کرتے تھے اور اسے ناممکن قرار دیتے تھے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) { اِنَّا نَحْنُ نُحْيٖ وَ نُمِيْتُ … :} یعنی دنیا میں مسلسل زندگی اور موت کا سلسلہ صرف ہمارے ہاتھ میں ہے، کسی اور کا اس میں کوئی دخل نہیں۔ چنانچہ ہم بے شمار لوگوں کو زندگی بخشتے ہیں اور موت دے دیتے ہیں، پھر اور لوگوں کو زندگی عطا کرتے ہیں اور موت بھی دیتے ہیں۔ اسی طرح لاتعداد مخلوقات پیدا ہوتی اور مرتی چلی جا رہی ہیں اور آخر کار ان سب کو ہماری طرف ہی واپس آنا ہے۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ {يَوْمَ تَشَقَّقُ الْاَرْضُ عَنْهُمْ سِرَاعًا: ’’ سِرَاعًا ‘‘ ’’سَرِيْعٌ‘‘} کی جمع ہے۔ {’’ يَوْمَ ‘‘ ’’ وَ اِلَيْنَا الْمَصِيْرُ ‘‘} کا ظرف ہے، یعنی ہماری ہی طرف لوٹ کر آنا ہے اس دن جب زمین ان سے پھٹے گی اور وہ اس سے نکل کر تیزی سے دوڑتے ہوئے نکلیں گے۔ ¤ ➋ { ذٰلِكَ حَشْرٌ عَلَيْنَا يَسِيْرٌ:} یہ کفار کی اس بات کا جواب ہے کہ جب ہم مر کر مٹی ہو چکے تو کیا اس وقت ہمیں زندہ کرکے اٹھا کھڑا کیا جائے گا؟ یہ تو عقل سے بعید اور ناممکن ہے۔ فرمایا یہ حشر یعنی سب اگلے پچھلے انسانوں کو ایک آواز کے ساتھ اکٹھا کر لینا ہمارے لیے بالکل آسان ہے۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ { نَحْنُ اَعْلَمُ بِمَا يَقُوْلُوْنَ:} یہ جملہ کفار کے لیے وعید اور دھمکی ہے اور رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی و تشفی کا باعث ہے۔ ¤ ➋ { وَ مَاۤ اَنْتَ عَلَيْهِمْ بِجَبَّارٍ:} یعنی آپ کا کام یہ نہیں کہ انھیں زبردستی مسلمان بنا لیں، آپ کا کام صرف پیغام پہنچانا ہے، جیسا کہ فرمایا : « اِنَّمَاۤ اَنْتَ مُذَكِّرٌ (21) لَسْتَ عَلَيْهِمْ بِمُصَۜيْطِرٍ» [ الغاشیۃ : 22،21 ]’’ تو صرف نصیحت کرنے والا ہے۔ تو ہرگز ان پر کوئی مسلط کیا ہوا نہیں ہے۔ ‘‘ ¤ ➌ {فَذَكِّرْ بِالْقُرْاٰنِ مَنْ يَّخَافُ وَعِيْدِ: ’’ وَعِيْدِ ‘‘} اصل میں {’’وَعِيْدِيْ‘‘} ہے، میری وعید۔ اس کا مطلب یہ نہیں کہ آپ دوسروں کو نصیحت نہ کریں، بلکہ مطلب یہ ہے کہ آپ کی نصیحت سے فائدہ وہی اٹھائے گا جو میری وعید سے ڈرتا ہے، جیسا کہ فرمایا : « اِنَّمَا تُنْذِرُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ وَ اَقَامُوا الصَّلٰوةَ » [ فاطر : ۱۸ ] ’’تو تو صرف ان لوگوں کو ڈراتا ہے جو دیکھے بغیر اپنے رب سے ڈرتے ہیں اور نماز قائم کرتے ہیں۔‘‘"
    }
  ]
}