{
  "surah": "Adh-Dhaariyat",
  "surah_number": 51,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { وَ الذّٰرِيٰتِ ذَرْوًا:} قسم کا مقصد کسی بات کی تاکید اور اسے سچا ثابت کرنا ہوتا ہے۔ قرآن مجید کی قسمیں دراصل اپنے جواب قسم کی دلیل اور شاہد ہیں جنھیں قسم کی صورت میں لایا گیا ہے۔ یہاں اللہ تعالیٰ نے قیامت کے حق ہونے کی دلیل کے طور پر چار قسمیں کھائی ہیں۔ ¤ ➋ {وَ الذّٰرِيٰتِ ذَرْوًا: ’’ الذّٰرِيٰتِ ‘‘ ’’ذَرَا يَذْرُوْ ذَرْوًا ‘‘} سے اسم فاعل {’’ذَارِيَةٌ‘‘} کی جمع ہے۔ اس کا معنی ’’ہوا کا کسی چیز کو اڑانا اور بکھیرنا‘‘ ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «فَاَصْبَحَ هَشِيْمًا تَذْرُوْهُ الرِّيٰحُ » [ الکہف : ۴۵ ] ’’پھر وہ چورا بن گئی، جسے ہوائیں اڑائے پھرتی ہیں۔‘‘ {’’ ذَرْوًا ‘‘} مفعول مطلق ہے جو {’’ الذّٰرِيٰتِ ‘‘} کی تاکید کے لیے لایا گیا ہے۔ {’’ الذّٰرِيٰتِ ‘‘} کا لفظی معنی ہے اڑانے والیاں۔ اب ان اڑانے والیوں سے مراد کیا ہے؟ مفسرین کا اتفاق ہے کہ ان سے مراد ہوائیں ہیں جو تیز چلتی ہیں تو گرد و غبار اور خس و خاشاک کو اڑا کر بکھیرتی چلی جاتی ہیں۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) { فَالْحٰمِلٰتِ وِقْرًا: ’’ وِقْرًا ‘‘} بوجھ، اس پر تنوین تعظیم کے لیے ہے، بھاری بوجھ۔ یہ بھی ہواؤں ہی کی صفت ہے کہ پھر وہ ہوائیں سورج کی حرارت کے ساتھ سمندر سے اٹھنے والے آبی بخارات سے بننے والے کروڑوں اربوں ٹن وزنی بھاری بادلوں کو اٹھاتی ہیں۔ اس کی دلیل یہ ہے کہ عربی زبان میں عام طور پر جب صفات کا عطف فاء کے ساتھ ہو تو ایک تو وہ سب ایک ہی موصوف کی صفتیں ہوتی ہیں، دوسرا ان میں ترتیب ہوتی ہے، جیسا کہ سورۂ عادیات میں ہے : « وَ الْعٰدِيٰتِ ضَبْحًا (1) فَالْمُوْرِيٰتِ قَدْحًا (2) فَالْمُغِيْرٰتِ صُبْحًا (3) فَاَثَرْنَ بِهٖ نَقْعًا (4) فَوَسَطْنَ بِهٖ جَمْعًا» [ العادیات : ۱ تا ۵ ]’’قسم ہے ان ( گھوڑوں) کی جو پیٹ اور سینے سے آواز نکالتے ہوئے دوڑنے والے ہیں! پھر جو سم مار کر چنگاریاں نکالنے والے ہیں! پھر جو صبح کے وقت حملہ کرنے والے ہیں! پھر اس کے ساتھ غبار اڑاتے ہیں۔ پھر وہ اس کے ساتھ بڑی جماعت کے درمیان جا گھستے ہیں۔ ‘‘ یہاں فاء کے ساتھ عطف سے ظاہر ہے کہ یہ اور اس کے بعد آیات میں مذکور سب صفات ہواؤں ہی کی ہیں۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) { فَالْجٰرِيٰتِ يُسْرًا:} یہ بھی ان ہواؤں ہی کی صفت ہے کہ پھر وہ اتنے بے حساب وزنی بادلوں کو اٹھا کر آسانی کے ساتھ چلتی ہیں، انھیں اس بوجھ کی وجہ سے چلنے میں کوئی رکاوٹ پیش نہیں آتی۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {فَالْمُقَسِّمٰتِ اَمْرًا:} یہ بھی وہ ہوائیں ہی ہیں جو بھاری بادلوں کا بوجھ اٹھائے ہوئے انھیں اللہ کے حکم سے زمین کے مختلف حصوں میں لے جا کر ان کے حصے کی بارش برساتی ہیں، جس سے مردہ زمین زندہ ہوتی ہے اور ہر علاقے کے لوگوں میں ان کا رزق تقسیم ہوتا ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 6،5) ➊ {اِنَّمَا تُوْعَدُوْنَ لَصَادِقٌ … :} یہاں {’’ اِنَّمَا ‘‘} اکٹھا لفظ نہیں جو کلمہ حصر ہے اور جس کا معنی ہے ’’اس کے سوا نہیں‘‘ بلکہ اس میں {’’إِنَّ‘‘} حرف تاکید الگ ہے اور {’’مَا ‘‘} الگ ہے جو اسم موصول ہے اور اس کا معنی ہے ’’وہ جو۔‘‘ صحابہ کرام رضی اللہ عنھم کے زمانے میں رسم الخط پوری طرح ضبط نہیں ہوا تھا، انھوں نے ان دونوں کو اکٹھا لکھ دیا، تو بعد میں امت نے قرآن مجید کی حفاظت کا اتنا زبردست اہتمام کیا کہ صحابہ نے جو لفظ جس طرح لکھا تھا قرآن مجید کے رسم الخط میں اسے اسی طرح باقی رکھا گیا۔ ¤ ➋ یعنی ان چاروں صفات کی حامل ہوائیں شاہد ہیں کہ تم سے دوبارہ زندہ کیے جانے اور قبروں سے نکل کر اللہ کے سامنے پیش ہونے کا جو وعدہ کیا جاتا ہے وہ یقینا سچا ہے اور ہر عمل کی جزا بلاشبہ یقینا واقع ہونے والی ہے۔ اللہ تعالیٰ نے ان ہواؤں کی مُردوں کے زندہ کرنے پر دلالت کو ایک اور آیت میں خوب واضح فرمایا ہے، فرمایا : «وَ هُوَ الَّذِيْ يُرْسِلُ الرِّيٰحَ بُشْرًۢا بَيْنَ يَدَيْ رَحْمَتِهٖ حَتّٰۤى اِذَاۤ اَقَلَّتْ سَحَابًا ثِقَالًا سُقْنٰهُ لِبَلَدٍ مَّيِّتٍ فَاَنْزَلْنَا بِهِ الْمَآءَ فَاَخْرَجْنَا بِهٖ مِنْ كُلِّ الثَّمَرٰتِ كَذٰلِكَ نُخْرِجُ الْمَوْتٰى لَعَلَّكُمْ تَذَكَّرُوْنَ » [ الأعراف : ۵۷ ]’’اور وہی ہے جو ہواؤں کو اپنی رحمت سے پہلے بھیجتا ہے، اس حال میں کہ خوش خبری دینے والی ہیں، یہاں تک کہ جب وہ بھاری بادل اٹھاتی ہیں تو ہم اسے کسی مردہ شہر کی طرف ہانکتے ہیں، پھر اس سے پانی اتارتے ہیں، پھر اس کے ساتھ ہر قسم کے کئی پھل پیدا کرتے ہیں۔ اسی طرح ہم مُردوں کو نکالیں گے، تاکہ تم نصیحت حاصل کرو۔‘‘ قرآن مجید نے بارش کے ساتھ مردہ زمین کے زندہ کرنے کو قیامت کے دن مردوں کو زندہ کرنے کی دلیل کے طور پر بار بار بیان فرمایا ہے، مثلاً دیکھیے سورۂ فاطر (۹) اور سورۂ روم (۴۸ تا ۵۰)۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6،5) ➊ {اِنَّمَا تُوْعَدُوْنَ لَصَادِقٌ … :} یہاں {’’ اِنَّمَا ‘‘} اکٹھا لفظ نہیں جو کلمہ حصر ہے اور جس کا معنی ہے ’’اس کے سوا نہیں‘‘ بلکہ اس میں {’’إِنَّ‘‘} حرف تاکید الگ ہے اور {’’مَا ‘‘} الگ ہے جو اسم موصول ہے اور اس کا معنی ہے ’’وہ جو۔‘‘ صحابہ کرام رضی اللہ عنھم کے زمانے میں رسم الخط پوری طرح ضبط نہیں ہوا تھا، انھوں نے ان دونوں کو اکٹھا لکھ دیا، تو بعد میں امت نے قرآن مجید کی حفاظت کا اتنا زبردست اہتمام کیا کہ صحابہ نے جو لفظ جس طرح لکھا تھا قرآن مجید کے رسم الخط میں اسے اسی طرح باقی رکھا گیا۔ ¤ ➋ یعنی ان چاروں صفات کی حامل ہوائیں شاہد ہیں کہ تم سے دوبارہ زندہ کیے جانے اور قبروں سے نکل کر اللہ کے سامنے پیش ہونے کا جو وعدہ کیا جاتا ہے وہ یقینا سچا ہے اور ہر عمل کی جزا بلاشبہ یقینا واقع ہونے والی ہے۔ اللہ تعالیٰ نے ان ہواؤں کی مُردوں کے زندہ کرنے پر دلالت کو ایک اور آیت میں خوب واضح فرمایا ہے، فرمایا : «وَ هُوَ الَّذِيْ يُرْسِلُ الرِّيٰحَ بُشْرًۢا بَيْنَ يَدَيْ رَحْمَتِهٖ حَتّٰۤى اِذَاۤ اَقَلَّتْ سَحَابًا ثِقَالًا سُقْنٰهُ لِبَلَدٍ مَّيِّتٍ فَاَنْزَلْنَا بِهِ الْمَآءَ فَاَخْرَجْنَا بِهٖ مِنْ كُلِّ الثَّمَرٰتِ كَذٰلِكَ نُخْرِجُ الْمَوْتٰى لَعَلَّكُمْ تَذَكَّرُوْنَ » [ الأعراف : ۵۷ ]’’اور وہی ہے جو ہواؤں کو اپنی رحمت سے پہلے بھیجتا ہے، اس حال میں کہ خوش خبری دینے والی ہیں، یہاں تک کہ جب وہ بھاری بادل اٹھاتی ہیں تو ہم اسے کسی مردہ شہر کی طرف ہانکتے ہیں، پھر اس سے پانی اتارتے ہیں، پھر اس کے ساتھ ہر قسم کے کئی پھل پیدا کرتے ہیں۔ اسی طرح ہم مُردوں کو نکالیں گے، تاکہ تم نصیحت حاصل کرو۔‘‘ قرآن مجید نے بارش کے ساتھ مردہ زمین کے زندہ کرنے کو قیامت کے دن مردوں کو زندہ کرنے کی دلیل کے طور پر بار بار بیان فرمایا ہے، مثلاً دیکھیے سورۂ فاطر (۹) اور سورۂ روم (۴۸ تا ۵۰)۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {وَ السَّمَآءِ ذَاتِ الْحُبُكِ: ’’حَبَكَ يَحْبُكُ حَبْكًا‘‘} (ن، ض) کسی چیز کو باندھنا، مضبوط بنانا، جولاہے کا کپڑے کو مضبوطی اور خوبصورتی کے ساتھ بننا۔ {’’ الْحُبُكِ ‘‘ ’’حَبِيْكَةٌ‘‘} کی جمع ہے۔ {’’حُبُكُ الرَّمْلِ وَالْمَاءِ وَالشَّعْرِ‘‘} ٹھہرے ہوئے پانی یا ریت پر ہوا سے جو لہریں سی بن جاتی ہیں، گھونگھریالے بالوں کی لہریں۔ {’’حُبُكُ السَّمَاءِ‘‘} آسمان میں ستاروں کے راستے۔ (قاموس)"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { اِنَّكُمْ لَفِيْ قَوْلٍ مُّخْتَلِفٍ:} یعنی یہ آسمان جو نہایت مضبوط و مستحکم اور بے حد خوبصورت ہے، جس میں ستاروں کے راستے ہیں اور جو بادلوں کی لہروں سے آراستہ ہے، شاہد ہے کہ تم ایسی بات میں پڑے ہوئے ہو جس میں تمھارا بہت اختلاف ہے۔ یہاں سوال یہ ہے کہ اس میں آسمان کی شہادت کیسے ہے اور یہ کہنے سے حاصل کیا ہے کہ تم ایسی بات میں پڑے ہوئے ہو جس میں بہت اختلاف ہے؟ جواب اس کا یہ ہے کہ اتنا مستحکم و مضبوط، بلند و بالا، خوبصورت اور مزین آسمان شاہد ہے کہ اس کے بنانے والے کے لیے قیامت برپا کرنا اور تمھیں دوبارہ زندہ کرنا کچھ مشکل نہیں، جیسا کہ فرمایا : « ءَاَنْتُمْ اَشَدُّ خَلْقًا اَمِ السَّمَآءُ بَنٰىهَا » [ النازعات : ۲۷ ] ’’کیا پیدا کرنے میں تم زیادہ مشکل ہو یا آسمان؟ اس نے اسے بنایا۔ ‘‘ رہا یہ سوال کہ جواب قسم {’’ اِنَّكُمْ لَفِيْ قَوْلٍ مُّخْتَلِفٍ ‘‘} کی مناسبت قسم کے ساتھ کیا ہے؟ تو جواب اس کا یہ ہے کہ دراصل یہاں بات مختصر کی گئی ہے، تفصیل اس کی یہ ہے کہ اللہ تعالیٰ نے اپنے مضبوط و مستحکم آسمان کی قسم کھا کر فرمایا کہ اے گروہ کفار! اس آسمان کی قسم ہے کہ قیامت کے متعلق اللہ کا قول حق اور تمھارا قول باطل ہے، کیونکہ تم ایسے قول میں پڑے ہوئے ہو جو باہم مختلف اور متناقض ہے، جب کہ حق میں اختلاف نہیں ہوتا، جیسا کہ فرمایا : « وَ لَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللّٰهِ لَوَجَدُوْا فِيْهِ اخْتِلَافًا كَثِيْرًا» [ النساء : ۸۲ ] ’’اور اگر وہ غیر اللہ کی طرف سے ہوتا تو وہ اس میں بہت زیادہ اختلاف پاتے۔‘‘ چنانچہ تم میں سے کوئی تو کہتا ہے کہ یہ دنیا ایسے ہی چلی آئی ہے، کچھ لوگ مرتے ہیں اور دوسرے پیدا ہوتے ہیں، نہ آج تک کوئی دوبارہ آیا نہ کوئی دوبارہ زندگی ہے۔ کوئی تناسخ کا قائل ہے اور کہتا ہے کہ اچھے اور برے اعمال کا بدلا تو لازم ہے مگر اس کے لیے کوئی دن مقرر نہیں، بلکہ انسان دنیا میں بار بار اچھی یا بری مخلوق کی صورت میں جنم لیتا رہتا ہے۔ کوئی آخرت کو تو مانتا ہے مگر کچھ ہستیوں کے متعلق یہ عقیدہ رکھتا ہے کہ وہ ایسی زور آور ہیں کہ اپنی شفاعت کے ساتھ اس دن اپنے نام لیواؤں کو زبردستی چھڑا لیں گی۔ یہ اختلاف دلیل ہے کہ قیامت کے متعلق تمھارا قول باطل ہے۔ قیامت کے متعلق کفار کے اختلاف کا ذکر سورۂ نبا کے شروع میں بھی فرمایا : «عَمَّ يَتَسَآءَلُوْنَ (1) عَنِ النَّبَاِ الْعَظِيْمِ (2) الَّذِيْ هُمْ فِيْهِ مُخْتَلِفُوْنَ » [ النبا : ا تا ۳ ] ’’کس چیز کے بارے میں وہ آپس میں سوال کر رہے ہیں؟ (کیا) اس بڑی خبر کے بارے میں؟ وہ کہ جس میں وہ اختلاف کرنے والے ہیں۔‘‘"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {یُؤْفَكُ عَنْهُ مَنْ اُفِكَ: ’’ عَنْهُ ‘‘} کی ضمیر کا مرجع یا تو {’’ اِنَّ الدِّيْنَ لَوَاقِعٌ ‘‘} میں لفظ {’’ الدِّيْنَ ‘‘} ہے۔ اس صورت میں مطلب یہ ہے کہ اس (قیامت) سے وہی بہکایا جاتا ہے جو (پہلے ہی) بہکایا گیا ہو، کسی صحیح الدماغ آدمی کو اس سے پھیرا اور بہکایا نہیں جا سکتا۔ یا {’’ عَنْهُ ‘‘} کی ضمیر کا مرجع {’’ قَوْلٍ مُّخْتَلِفٍ ‘‘} ہے، اس صورت میں {’’عَنْ‘‘} تعلیل کے معنی میں ہے۔ مطلب یہ ہو گا کہ یقینا تم ایک اختلاف والی بات میں پڑے ہوئے ہو جس کی وجہ سے وہی آدمی بہکایا جاتا ہے جو (پہلے ہی) بہکایا گیا ہو، ایسی مختلف باتوں کی وجہ سے کسی صحیح دماغ والے کو بہکایا نہیں جا سکتا ہے۔ یاد رہے کہ {’’عَنْ‘‘} کے معانی میں سے تعلیل مسلّم معنی ہے، اس معنی کی مثال یہ آیت ہے : «وَ مَا نَحْنُ بِتَارِكِيْۤ اٰلِهَتِنَا عَنْ قَوْلِكَ» [ ھود : ۵۳ ] ’’اور ہم اپنے معبودوں کو تیرے کہنے کی وجہ سے ہر گز چھوڑنے والے نہیں۔‘‘"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) { قُتِلَ الْخَرّٰصُوْنَ: ’’خَرَصَ يَخْرُصُ خَرْصًا‘‘} (ن) اندازہ لگانا، اٹکل لگانا، جیسا کہ فرمایا : « اِنْ هُمْ اِلَّا يَخْرُصُوْنَ» [ الزخرف : ۲۰ ] ’’وہ تو صرف اٹکلیں دوڑا رہے ہیں۔‘‘ {’’خَرَّاصٌ‘‘} مبالغے کا صیغہ ہے، بہت اٹکل لگانے والا۔ کفا رکے پاس آسمانی ہدایت کی روشنی نہیں اس لیے وہ علم اور یقین سے محروم ہیں، ان کا سارا دار و مدار ظن و تخمین اور وہم و گمان پر ہے۔ چنانچہ شرک کی بنیاد سراسر گمان اور اندازوں پر ہے (دیکھیے نجم : ۲۳، ۲۸) اور قیامت کا انکار بھی محض خرص و تخمین (اٹکل اور اندازوں) پر ہے۔ ظاہر ہے اٹکل اور اندازوں کا انجام ہلاکت کے سوا کچھ نہیں، اس لیے فرمایا، اٹکل لگانے والے مارے گئے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {الَّذِيْنَ هُمْ فِيْ غَمْرَةٍ سَاهُوْنَ:’’غَمَرَ يَغْمُرُ غَمْرًا ‘‘} (ن) {’’ اَلْمَاءُ ‘‘} کا معنی ’’پانی کا کسی چیز کو ڈھانپ لینا‘‘ ہے، اس لیے گہرے پانی کو {’’غَمْرَةٌ‘‘} کہتے ہیں۔ سختی اور موت کو اور جہالت و غفلت کو بھی {’’غَمْرَةٌ‘‘} کہتے ہیں، کیونکہ وہ بھی آدمی کی عقل کو ڈھانپ لیتی ہیں۔ {’’ غَمْرَةٍ ‘‘} پر تنوین تعظیم کے لیے ہے، اس لیے ترجمہ ’’بڑی غفلت‘‘ کیا گیا ہے۔ {’’ سَاهُوْنَ ‘‘ ’’سَهَا يَسْهُوْ سَهْوًا‘‘} (ن) سے اسم فاعل کی جمع ہے، بھولے ہوئے۔ یعنی انھوں نے آخرت کا انکار محض خیال اور اندازے کی بنا پر کیا ہے، جس کی وجہ سے وہ اس کی تیاری سے بہت بڑی غفلت میں مبتلا ہو کر اپنے خوفناک انجام کو بھولے ہوئے ہیں۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) {يَسْـَٔلُوْنَ اَيَّانَ يَوْمُ الدِّيْنِ:} یعنی جب انھیں قیامت کے انکار کی کوئی معقول دلیل نہیں ملتی تو وہ کہتے ہیں، اچھا یہ بتاؤ جزا کا دن کب ہے؟ ظاہر ہے ان کا یہ سوال محض انکار اور استہزا کے لیے ہے، کیونکہ تاریخ کا تعین کوئی دلیل نہیں جس سے کوئی منکر اقرار پر آمادہ ہو جائے، بلکہ اس کے بعد ان کا اگلا سوال یہ ہو گا کہ اس کے آنے سے پہلے آخر ہم یہ یقین کیسے کر لیں کہ اس دن وہ واقعی آ جائے گی؟ اس لیے اللہ تعالیٰ نے قیامت کا وقت نہیں بتایا۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {يَوْمَ هُمْ عَلَى النَّارِ يُفْتَنُوْنَ: ’’فَتَنَ يَفْتُنُ‘‘} (ن،ض) کا معنی آزمانا بھی ہے اور جلانا بھی۔ کھرے یا کھوٹے کی پہچان کے لیے سونے کو آگ میں پگھلایا جائے تو کہتے ہیں : {’’فَتَنْتُ الذَّهَبَ۔‘‘} فرمایا، وہ روزِ جزا اس دن ہو گا جب انھیں آگ پر رکھ کر تپایا اور جلایا جائے گا۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) {ذُوْقُوْا فِتْنَتَكُمْ … :} یہ بات انھیں ذلیل کرنے کے لیے بطور طنز کہی جائے گی۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) { اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّ عُيُوْنٍ:} مکذبین کے بعد متقین کا ذکر فرمایا۔ اس کی تفسیر کے لیے دیکھیے سورۂ حجر کی آیت (۴۵) کی تفسیر۔ آیت کے الفاظ بتا رہے ہیں کہ جنتوں میں داخلے کا سبب تقویٰ ہے، جیسا کہ فرمایا : « تِلْكَ الْجَنَّةُ الَّتِيْ نُوْرِثُ مِنْ عِبَادِنَا مَنْ كَانَ تَقِيًّا » [ مریم : ۶۳ ] ’’یہ ہے وہ جنت جس کا وارث ہم اپنے بندوں میں سے اسے بناتے ہیں جو بہت بچنے والا ہو۔‘‘"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {اٰخِذِيْنَ مَاۤ اٰتٰىهُمْ رَبُّهُمْ:} اس کے لفظی معنی اگرچہ یہی ہیں کہ ’’وہ لینے والے ہوں گے جو ان کا رب انھیں دے گا‘‘ مگر موقع و محل کی مناسبت اور {’’ اٰتٰىهُمْ رَبُّهُمْ ‘‘} کے لفظ کے تقاضے سے ظاہر ہے کہ یہاں صرف لینا ہی مراد نہیں بلکہ مراد ان کے رب کا انھیں بے حساب دینا اور ان کا اس سے جی بھر کر خوشی خوشی لینا ہے۔ ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ يَقُوْلُ لِأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ! فَيَقُوْلُوْنَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ وَالْخَيْرُ فِيْ يَدَيْكَ، فَيَقُوْلُ هَلْ رَضِيْتُمْ؟ فَيَقُوْلُوْنَ وَ مَا لَنَا لاَ نَرْضٰی يَا رَبِّ! وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِّنْ خَلْقِكَ؟ فَيَقُوْلُ أَلاَ أُعْطِيْكُمْ أَفْضَلَ مِنْ ذٰلِكَ ؟ فَيَقُوْلُوْنَ يَا رَبِّ! وَ أَيُّ شَيْءٍ أَفْضَلُ مِنْ ذٰلِكَ ؟ فَيَقُوْلُ أُحِلُّ عَلَيْكُمْ رِضْوَانِيْ فَلاَ أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا ] [ بخاري، التوحید، باب کلام الرب مع أھل الجنۃ : ۷۵۱۸] ’’اللہ تعالیٰ اہلِ جنت سے کہے گا : ’’اے جنت والو!‘‘ وہ کہیں گے : ’’ہم حاضر ہیں اے ہمارے پروردگار! ہم حاضر ہیں اور ساری خیر تیرے ہی ہاتھ میں ہے۔‘‘ فرمائے گا : ’’کیا تم راضی ہو گئے؟‘‘ وہ کہیں گے : ’’ہمیں کیا ہے کہ ہم راضی نہ ہوں جب کہ تو نے ہمیں وہ کچھ عطا فرمایا جو اپنی مخلوق میں سے کسی کو عطا نہیں کیا۔‘‘ فرمائے گا : ’’کیا میں تمھیں اس سے بھی افضل چیز نہ دوں؟‘‘ وہ کہیں گے : ’’اے ہمارے رب! بھلا اس سے افضل چیز کیا ہے؟‘‘ فرمائے گا : ’’میں تمھیں اپنی رضا اور خوشنودی عطا کرتا ہوں، سو اس کے بعد میں کبھی تم پر ناراض نہیں ہوں گا۔‘‘ ¤ ➋ {اِنَّهُمْ كَانُوْا قَبْلَ ذٰلِكَ مُحْسِنِيْنَ: ’’إِنَّ‘‘} تعلیل کے لیے ہوتا ہے، یعنی یہ نعمت انھیں اس لیے ملے گی کہ وہ اس سے پہلے دنیا میں احسان کرنے والے تھے۔ احسان کی تعریف رسول اللہ صلی اللہ علیہ وسلم نے یہ فرمائی ہے : [ أَنْ تَعْبُدَ اللّٰهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ] [ بخاري، الإیمان، باب سؤال جبریل النبي صلی اللہ علیہ وسلم … : ۵۰ ] ’’(احسان یہ ہے) کہ تو اللہ کی عبادت اس طرح کرے گویا تو اسے دیکھ رہا ہے، سو اگر تو اسے نہیں دیکھتا تو یقینا وہ تجھے دیکھ رہا ہے۔‘‘ {’’ مُحْسِنِيْنَ ‘‘} کا لفظی معنی {’’عَامِلِيْنَ الْحَسَنَاتِ‘‘} ہے، یعنی وہ نیکیاں کرنے والے تھے۔ آگے ان نیکیوں کی کچھ تفصیل ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {كَانُوْا قَلِيْلًا مِّنَ الَّيْلِ مَا يَهْجَعُوْنَ: ’’هَجَعَ يَهْجَعُ هُجُوْعًا‘‘} (ف) سونا، رات کا سونا، ہلکا سا سونا، تینوں معنوں میں آتا ہے۔ {’’ مَا يَهْجَعُوْنَ ‘‘} کے دو معنی کیے گئے ہیں، ایک یہ کہ {’’ مَا ‘‘} مصدریہ ہے اور مطلب یہ ہے کہ وہ رات میں سے بہت تھوڑا حصہ سوتے تھے۔ ابن کثیر نے یہ مطلب احنف بن قیس، حسن بصری اور زہری سے نقل فرمایا ہے۔ اللہ تعالیٰ نے سورۂ مزمل میں فرمایا : « يٰۤاَيُّهَا الْمُزَّمِّلُ (1) قُمِ الَّيْلَ اِلَّا قَلِيْلًا (2) نِّصْفَهٗۤ اَوِ انْقُصْ مِنْهُ قَلِيْلًا (3) اَوْ زِدْ عَلَيْهِ وَ رَتِّلِ الْقُرْاٰنَ تَرْتِيْلًا » [ المزمل : ۱ تا ۴ ] ’’اے کپڑے میں لپٹنے والے! رات کو قیام کر مگر تھوڑا۔ آدھی رات (قیام کر)، یا اس سے تھوڑا کم کر لے۔ یا اس سے زیادہ کرلے اور قرآن کو خوب ٹھہر ٹھہر کر پڑھ۔‘‘ ان آیات کے نازل ہونے پر آپ صلی اللہ علیہ وسلم اور آپ کے صحابہ میں سے کچھ لوگ ایک سال تک اس پر عمل کرتے رہے، پھر اللہ تعالیٰ نے سورۂ مزمل کا آخری حصہ نازل کیا، جس میں فرمایا : « اِنَّ رَبَّكَ يَعْلَمُ اَنَّكَ تَقُوْمُ اَدْنٰى مِنْ ثُلُثَيِ الَّيْلِ وَ نِصْفَهٗ وَ ثُلُثَهٗ وَ طَآىِٕفَةٌ مِّنَ الَّذِيْنَ مَعَكَ وَ اللّٰهُ يُقَدِّرُ الَّيْلَ وَ النَّهَارَ عَلِمَ اَنْ لَّنْ تُحْصُوْهُ فَتَابَ عَلَيْكُمْ فَاقْرَءُوْا مَا تَيَسَّرَ مِنَ الْقُرْاٰنِ عَلِمَ اَنْ سَيَكُوْنُ مِنْكُمْ مَّرْضٰى وَ اٰخَرُوْنَ يَضْرِبُوْنَ فِي الْاَرْضِ يَبْتَغُوْنَ مِنْ فَضْلِ اللّٰهِ وَ اٰخَرُوْنَ يُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ فَاقْرَءُوْا مَا تَيَسَّرَ مِنْهُ » [ المزمل : ۲۰ ] ’’بلاشبہ تیرا رب جانتا ہے کہ تو رات کے دو تہائی کے قریب اور اس کا نصف اور اس کا تیسرا حصہ قیام کرتا ہے اور ان لوگوں کی ایک جماعت بھی جو تیرے ساتھ ہیں اور اللہ رات اور دن کا اندازہ رکھتا ہے۔ اس نے جان لیا کہ تم ہرگز اس کی طاقت نہیں رکھو گے، سو اس نے تم پر مہربانی فرمائی تو قرآن میں سے جو میسر ہو پڑھو، اس نے جان لیا کہ یقینا تم میں سے کچھ بیمار ہوں گے اور کچھ دوسرے زمین میں سفر کریں گے، اللہ کا فضل تلاش کریں گے اور کچھ دوسرے اللہ کی راہ میں لڑیں گے، پس اس میں سے جو میسر ہو پڑھو۔‘‘ تو صحیح مسلم (۷۴۶) میں مذکور عائشہ رضی اللہ عنھا کی حدیث کے مطابق قیام اللیل جو فرض تھا، نفل ہو گیا اور اس میں تخفیف ہو گئی اور رات کے اکثر حصے کے بجائے حکم ہوا : « فَاقْرَءُوْا مَا تَيَسَّرَ مِنَ الْقُرْاٰنِ» کہ جتنا قیام آسانی سے کر سکتے ہو کر لو۔ اس آیت کی تفسیر اور قیام اللیل کی فضیلت کے لیے سورۂ مزمل کی ابتدائی اور آخری آیات کی تفسیر ملاحظہ فرمائیں۔ ¤ {’’ كَانُوْا قَلِيْلًا مِّنَ الَّيْلِ مَا يَهْجَعُوْنَ ‘‘} کا مطلب اگر یہ کیا جائے کہ جنت میں وہ متقی جائیں گے جو رات کا تھوڑا حصہ سوتے تھے تو رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنھم کے دائمی عمل سے اس مطلب کی تائید نہیں ہوتی۔ ہاں مندرجہ ذیل حدیث کو سامنے رکھا جائے تو {’’ مَا يَهْجَعُوْنَ ‘‘} کا یہ مطلب بالکل درست ہے۔ عثمان بن عفان رضی اللہ عنہ نے فرمایا، میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : [ مَنْ صَلَّی الْعِشَاءَ فِيْ جَمَاعَةٍ فَكَأَنَّمَا قَامَ نِصْفَ اللَّيْلِ، وَ مَنْ صَلَّی الصُّبْحَ فِيْ جَمَاعَةٍ فَكَأَنَّمَا صَلَّی اللَّيْلَ كُلَّهُ ] [ مسلم، المساجد و مواضع الصلاۃ، باب فضل صلاۃ العشاء والصبح في جماعۃ : ۶۵۶ ] ’’جو شخص عشاء کی نماز جماعت کے ساتھ پڑھے تو گویا اس نے نصف رات قیام کیا اور جو شخص صبح کی نماز جماعت کے ساتھ پڑھے تو گویا اس نے ساری رات قیام کیا۔‘‘ مزید بحث سورۂ سجدہ کی آیت (۱۶) : « تَتَجَافٰى جُنُوْبُهُمْ عَنِ الْمَضَاجِعِ » کی تفسیر میں ملاحظہ فرمائیں۔ ¤ {’’ مَا يَهْجَعُوْنَ ‘‘} کا دوسرا معنی یہ ہے کہ اس میں {’’ مَا ‘‘} نافیہ ہے۔ ابن کثیر نے یہ مطلب ابن عباس، مطرف بن عبد اللہ اور مجاہد سے نقل فرمایا ہے اور تفسیر ابن کثیر کے محقق دکتور حکمت بن بشیر نے طبری اور دوسری کتابوں میں مذکور ان کی سندوں کو حسن یا صحیح قرار دیا ہے۔ انس رضی اللہ عنہ اور ابوجعفر باقر کے اقوال بھی اسی پر مبنی ہیں کہ {’’ مَا ‘‘} نافیہ ہے۔ ابن عباس رضی اللہ عنھما نے فرمایا : [ لَمْ تَكُنْ تَمْضِيْ عَلَيْهِمْ لَيْلَةٌ إِلاَّ يَأْخُذُوْنَ مِنْهَا وَ لَوْ شَيْئًا ] [ ابن کثیر : 417/7 ] ’’یعنی ان پر جو رات بھی گزرتی تھی اس میں سے کچھ نہ کچھ حصہ لیتے تھے خواہ تھوڑا ہی ہو۔‘‘ مطرف بن عبد اللہ نے فرمایا : {’’ قَلَّ لَيْلَةٌ لاَ تَأْتِيْ عَلَيْهِمْ إِلاَّ يُصَلُّوْنَ فِيْهَا لِلّٰهِ عَزَّوَجَلَّ، إِمَّا مِنْ أَوَّلِهَا وَ إِمَّا مِنْ أَوْسَطِهَا ‘‘} [ ابن کثیر : 417/7 ] ’’ان پر کم ہی کوئی رات آتی تھی مگر وہ اس میں اللہ عز و جل کے لیے نماز پڑھتے تھے، یا اس کے شروع میں یا اس کے درمیان میں۔‘‘ مجاہد نے فرمایا : {’’ قَلَّ مَا يَرْقُدُوْنَ لَيْلَةً حَتَّي الصِّبَاحَ لاَ يَتَهَجَّدُوْنَ ‘‘} [ ابن کثیر : 417/7 ] ’’کم ہی کوئی رات ہوتی تھی جس میں وہ صبح تک سوئے رہیں اور تہجد نہ پڑھیں۔‘‘ انس بن مالک اور ابوالعالیہ نے فرمایا : {’’ كَانُوْا يُصَلُّوْنَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ‘‘} [ ابن کثیر : ۷؍۴۱۷ ] ’’وہ مغرب اور عشاء کے درمیان نماز پڑھتے تھے۔‘‘ اور ابوجعفر باقر نے فرمایا : {’’ كَانُوْا لاَ يَنَامُوْنَ حَتّٰي يُصَلُّوا الْعَتَمَةَ ‘‘} [ ابن کثیر : 417/7 ] ’’وہ جب تک عشاء نہ پڑھ لیتے سوتے نہیں تھے۔‘‘ ¤ {’’ مَا يَهْجَعُوْنَ ‘‘} میں {’’ مَا ‘‘} کو نافیہ ماننے کی صورت میں ترجمہ ہو گا ’’وہ سوتے نہیں تھے‘‘ یعنی جاگتے تھے۔ اس کے مطابق آیت کا ترجمہ، تفسیر اور اس پر حاشیہ تفسیر ثنائی سے نقل کیے جاتے ہیں۔ ترجمہ ہے : ’’یہ لوگ راتوں کو کسی قدر جاگا کرتے اور صبح کے وقت خدا سے بخشش مانگا کرتے تھے۔‘‘ تفسیر ہے : ’’ان کی نیکی کا نمونہ یہ ہے کہ یہ لوگ راتوں کو بغرض عبادت کسی قدر جاگا کرتے اور تہجد کے بعد یا شب خیزی کے بعد صبح کے وقت خدا سے بخشش مانگا کرتے تھے۔ یعنی صبح سے پہلے تھوڑی رات رہتے اٹھتے تھے اور خدا کی یاد جتنی بھی ہو سکے کرکے صبح سویرے اپنے لیے اور اپنے ماں باپ کے لیے بلکہ جملہ مومنین کے لیے استغفار کرتے تھے۔‘‘ حاشیہ ہے : {’’ مَا يَهْجَعُوْنَ ‘‘} میں دو لفظ ہیں۔ {’’هَجَعَ‘‘} کے معنی ہیں رات کی نیند۔ قاموس میں ہے : {’’ اَلْهُجُوْعُ النَّوْمُ لَيْلًا۔‘‘ ’’ مَا ‘‘} نافیہ ہے، پس معنی یہ ہیں ’’رات کو تھوڑا سا وقت نیند ترک کر دیتے تھے۔‘‘ وہ تھوڑا سا وقت چاہے نماز تہجد کا ہو، جیسے سورۂ بنی اسرائیل میں ہے : « وَ مِنَ الَّيْلِ فَتَهَجَّدْ بِهٖ » [ بني إسرائیل : ۷۹ ] یا نماز عشاء کا ہو، جیسے « وَ اَقِمِ الصَّلٰوةَ طَرَفَيِ النَّهَارِ وَ زُلَفًا مِّنَ الَّيْلِ» [ ھود : ۱۱۴ ] میں {’’ زُلَفًا ‘‘} سے مراد عشاء کی نماز ہے، ممکن ہے یہی مراد {’’ مَا يَهْجَعُوْنَ ‘‘} سے ہو۔ (واللہ اعلم)‘‘ (ثنائی) ¤ معارف القرآن میں ہے : ’’ «كَانُوْا قَلِيْلًا مِّنَ الَّيْلِ مَا يَهْجَعُوْنَ » میں {’’ يَهْجَعُوْنَ ‘‘ ’’هُجُوْعٌ‘‘} سے مشتق ہے، جس کے معنی رات کو سونے کے آتے ہیں۔ اس میں مومنین متقین کی یہ صفت بیان فرمائی ہے کہ وہ رات کو اللہ تعالیٰ کی عبادت میں گزارتے ہیں، سوتے کم ہیں، جاگتے زیادہ ہیں اور یہ وقت نماز و عبادت میں گزارتے ہیں۔ یہ تفسیر ابن جریر نے اختیار کی ہے اور حسن بصری سے یہی منقول ہے کہ متقین حضرات رات کو جاگنے اور عبادت کرنے کی مشقت اٹھاتے ہیں اور بہت کم سوتے ہیں۔ اور ابن عباس اور قتادہ وغیرہ ائمۂ تفسیر نے اس جملے کا مطلب حرفِ {’’ مَا ‘‘} کو اس میں نفی کے لیے قرار دے کر یہ بتلایا ہے کہ ’’رات کو تھوڑا سا حصہ ان پر ایسا بھی آتا ہے جس میں وہ سوتے نہیں، بلکہ عبادت و نماز وغیرہ میں مشغول رہتے ہیں۔ اس مفہوم کے اعتبار سے وہ سب لوگ اس کا مصداق ہو جاتے ہیں جو رات کے کسی بھی حصہ میں عبادت کر لیں، خواہ شروع میں یا آخر میں یا درمیان میں۔ اسی لیے انس اور ابوالعالیہ نے اس کا مصداق ان لوگوں کو قرار دیا جو مغرب و عشاء کے درمیان نماز پڑھتے ہیں اور امام ابوجعفر باقر نے فرمایا کہ جو لوگ عشاء کی نماز سے پہلے نہ سوویں وہ بھی اس میں داخل ہیں۔ (ابن کثیر)‘‘"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) {وَ بِالْاَسْحَارِ هُمْ يَسْتَغْفِرُوْنَ: ’’أَسْحَارٌ‘‘ ’’سَحَرٌ‘‘} (سین اور حاء کے فتحہ کے ساتھ) رات کا آخری حصہ۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَنْزِلُ رَبُّنَا تَبَارَكَ وَ تَعَالٰی كُلَّ لَيْلَةٍ إِلَی السَّمَاءِ الدُّنْيَا حِيْنَ يَبْقٰی ثُلُثُ اللَّيْلِ الْآخِرُ يَقُوْلُ مَنْ يَدْعُوْنِيْ فَأَسْتَجِيْبَ لَهُ؟ مَنْ يَسْأَلُنِيْ فَأُعْطِيَهُ؟ مَنْ يَسْتَغْفِرُنِيْ فَأَغْفِرَ لَهُ؟ ] [ بخاري، التھجد، باب الدعاء والصلاۃ من آخر اللیل : ۱۱۴۵ ] ’’ہمارا رب تبارک و تعالیٰ ہر رات، جب رات کا آخری ثلث باقی رہ جاتا ہے، آسمان دنیا کی طرف اترتا ہے اور فرماتا ہے : ’’کون ہے جو مجھ سے دعا کرے تو میں اس کی دعا قبول کروں؟ کون ہے جو مجھ سے مانگے تو میں اسے عطا کروں؟ کون ہے جو مجھ سے بخشش مانگے تو میں اسے بخشوں؟‘‘"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) { وَ فِيْۤ اَمْوَالِهِمْ حَقٌّ لِّلسَّآىِٕلِ وَ الْمَحْرُوْمِ:} اس کی تفسیر کے لیے دیکھیے سورۂ معارج (۲۴، ۲۵) کی تفسیر۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { وَ فِي الْاَرْضِ اٰيٰتٌ لِّلْمُوْقِنِيْنَ:} شروع سورت میں چار طرح کی ہواؤں کی قسم اٹھا کر فرمایا کہ قیامت حق ہے، پھر اس پر آسمان کی قسم اٹھائی۔ اب ’’واؤ‘‘ کے ذریعے سے اسی کے ساتھ سلسلہ کلام جوڑ کر فرمایا : ’’اور زمین میں بھی یقین کرنے والوں کے لیے بہت سی نشانیاں ہیں۔‘‘ یہ وہی استدلال ہے جو قرآن میں قیامت حق ہونے کے لیے جا بجا موجود ہے۔ مثلاً فرمایا : «وَ مِنْ اٰيٰتِهٖۤ اَنَّكَ تَرَى الْاَرْضَ خَاشِعَةً فَاِذَاۤ اَنْزَلْنَا عَلَيْهَا الْمَآءَ اهْتَزَّتْ وَ رَبَتْ اِنَّ الَّذِيْۤ اَحْيَاهَا لَمُحْيِ الْمَوْتٰى » [ حٰمٓ السجدۃ : ۳۹ ] ’’اور اس کی نشانیوں میں سے ایک یہ ہے کہ تو زمین کو دبی ہوئی (بنجر) دیکھتا ہے، پھر جب ہم اس پر پانی اتارتے ہیں تو وہ لہلہاتی ہے اور پھولتی ہے۔ بے شک وہ جس نے اسے زندہ کیا، یقینا مردوں کو زندہ کرنے والا ہے۔‘‘ مطلب یہ ہے کہ زمین کی پہلی ساری کھیتی چورا بن کر ختم ہوجاتی ہے، پھر دوبارہ نئی پیدا ہو جاتی ہے۔ یہ ایسی چیز ہے جو ہر شخص کے مشاہدے میں آتی ہے، اس پر بہت زیادہ غور و فکر کی ضرورت نہیں، صرف یقین کی ضرورت ہے۔ اس لیے اس آیت میں غور و فکر کی دعوت نہیں دی، جس طرح اس کے بعد والی آیت میں {’’ اَفَلَا تُبْصِرُوْنَ ‘‘} فرمایا ہے، بلکہ فرمایا : ’’زمین میں یقین کرنے والوں کے لیے بہت سی نشانیاں ہیں۔‘‘ یہ اس لیے فرمایا کہ ان نشانیوں سے فائدہ وہی اٹھاتے ہیں جو یقین کرتے ہیں۔ ¤ ➋ { ’’ وَ فِي الْاَرْضِ اٰيٰتٌ لِّلْمُوْقِنِيْنَ ‘‘} (اور زمین میں یقین کرنے والوں کے لیے بہت سی نشانیاں ہیں) اس میں صریح الفاظ میں یہ نہیں بتایا کہ کس چیز کی نشانیاں ہیں، کیونکہ اس میں صرف قیامت حق ہونے ہی کی نشانیاں نہیں بلکہ اللہ تعالیٰ کے وجود، اس کی وحدانیت اور اس کی لامحدود قدرت کی بھی بے شمار نشانیاں ہیں۔ زمخشری نے فرمایا : ’’اور زمین میں بہت سی نشانیاں ہیں جو صانع اور اس کی قدرت و حکمت اور تدبیر پر دلالت کرتی ہیں، چنانچہ زمین اپنے اوپر والی چیزوں کے لیے بچھونے کی طرح ہے، جیسا کہ فرمایا : « الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ مَهْدًا » [ طٰہٰ : ۵۳ ] ’’وہ جس نے تمھارے لیے زمین کو بچھونا بنایا۔‘‘ اور چلنے والوں کے لیے اس میں راستے اور وسیع شاہراہیں ہیں جو اس کے کندھوں پر چلتے پھرتے ہیں اور اس کے مختلف حصے ہیں، جیسے میدان، پہاڑ، ریگستان، سمندر وغیرہ اور کئی ٹکڑے ہیں، مثلاً سخت، نرم، زرخیز، شور وغیرہ۔ وہ حاملہ جانور کی طرح ہے جس کے پیٹ سے بے شمار پودے، درخت اور پھل پیدا ہوتے ہیں، جن کے رنگ، خوشبو اور ذائقے مختلف ہیں، حالانکہ سبھی ایک ہی پانی سے سیراب ہوتے ہیں۔ اس کے باوجود وہ ایک دوسرے پر برتری رکھتے ہیں اور یہ سب کچھ زمین پر رہنے والوں کی ضروریات، ان کی صحت و بیماری کی مصلحتوں کے عین موافق ہے۔ پھر اس میں پھوٹنے والے چشمے، رنگا رنگ معدنیات اور خشکی، ہوا اور سمندر میں پھیلے ہوئے مختلف شکلوں، صورتوں اور کاموں والے وحشی، پالتو، مفید اور زہریلے جانور اور اس کے علاوہ شمار سے باہر چیزیں ہیں جن میں یقین کرنے والوں کے لیے بہت سی نشانیاں ہیں، کیونکہ وہی دیکھنے والی آنکھوں سے دیکھتے ہیں۔‘‘"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { وَ فِيْۤ اَنْفُسِكُمْ اَفَلَا تُبْصِرُوْنَ:} یعنی خود تمھارے نفسوںمیں دوبارہ زندہ ہونے کی بے شمار نشانیاں موجود ہیں کہ مٹی اور نطفے سے لے کر موت تک ہر لمحہ موت کے بعد زندگی کا شاہد ہے، کیونکہ جسم کا ہر خلیہ جو موجود ہوتا ہے فنا ہوتا اور اس کی جگہ نیا خلیہ وجود میں آتا رہتا ہے اور یہ عمل مسلسل جاری رہتا ہے، جس کے دوران انسان بچپن، جوانی اور بڑھاپے کی طرف بھی منتقل ہوتا رہتا ہے، مگر موت و حیات کے اس سلسلے پر غور کرنے والے بہت ہی کم ہیں۔ یہ بحث تفصیل کے ساتھ سورۂ مومنون (۱۲ تا ۱۶) کی تفسیر میں ملاحظہ فرمائیں۔ ¤ ➋ انسان کی ذات میں قیامت کے علاوہ اللہ تعالیٰ کے وجود، اس کی وحدانیت، حکمت، تدبیر، صنعت، قدرت اور دوسری صفات کی بھی بے شمار نشانیاں موجود ہیں۔ مفسر کیلانی لکھتے ہیں : ’’انسان کا اپنا وجود اور اس کی مشینری کائنات اصغر ہے اور اس میں جو نشانیاں ہیں وہ کائنات اکبر کی نشانیوں سے کسی طرح کم نہیں۔ انسان کا معدہ ایک چکی کی طرح دن رات کام میں لگا رہتا ہے، جو غذا کو پیس کر ایک ملغوبہ تیار کرنے میں مصروف رہتا ہے۔ جب یہ فارغ ہو جائے تو اور غذا طلب کرتا ہے جسے ہم بھوک کہتے ہیں۔ اس ملغوبہ کی تیاری میں اگر پانی کی کمی ہو تو ہمیں پیاس لگ جاتی ہے اور ہم کھانے پینے پر مجبور ہو جاتے ہیں۔ پھر اس کے اندر چھلنی بھی ہے جس سے چھن کر یہ ملغوبہ جگر میں چلا جاتا ہے، جہاں اچھالنے والی، دفع کرنے والی، صاف کرنے والی، کھینچنے والی مشینیں اور قوتیں کام کر رہی ہیں۔ یہیں دوسری اخلاط بنتی ہیں۔ فالتو پانی کو گردے پیشاب کے راستے خارج کر دیتے ہیں۔ قوت دافعہ فالتو مواد یا فضلہ کو خارج کرنے کا کام کرتی ہے اور جس طرح انسان کھانے پینے پر مجبور ہوتا ہے اسی طرح رفع حاجت پر مجبور ہو جاتا ہے اور اگر روکے تو بیمار پڑ جاتا ہے۔ پھر انسان کے جسم میں اتنی باریک نالیاں ہیں جن کا سوراخ خورد بین کے بغیر نظر ہی نہیں آ سکتا، انھی کے ذریعے انسان کے جسم کے ہر حصے کو خون پہنچتا ہے۔ اس سلسلہ میں انسان کا دل پمپ کا کام کرتا ہے جو ایک منٹ بھی ٹھہر جائے تو موت واقع ہو جاتی ہے۔ پھر انسان کا سانس لینا بھی ایک الگ پورا نظام ہے۔ سب سے زیادہ باریک آنکھ کے طبقے اور جھلیاں ہیں جو ایسی لطافت کے ساتھ بنائی گئی ہیں کہ اگر ذرا سا فتور آ جائے تو بینائی جواب دے جاتی ہے۔ (پھر سننے، سونگھنے، چکھنے، سوچنے، سمجھنے، یاد رکھنے، محسوس کرنے، سونے، جاگنے، بولنے اور دوسرے بے شمار افعال کے نظام ہیں جن میں سے ہر ایک پر غور کیا جائے تو آدمی حیرت کے سمندر میں غرق ہو جاتا ہے) انسان کا جسم ابتدا ہی سے حکیموں اور ڈاکٹروں کی تحقیق کا مرکز بنا ہوا ہے، مگر اس کے بیشتر اسرار آج تک پردۂ راز ہی میں ہیں۔‘‘ [ تیسیر القرآن ] ¤ ➌ { ’’ وَ فِي الْاَرْضِ اٰيٰتٌ ‘‘} میں آفاقی آیات کا ذکر ہے اور {’’ وَ فِيْۤ اَنْفُسِكُمْ ‘‘} میں انفسی آیات کا۔ مزید دیکھیے حم السجدہ (۵۳)۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {وَ فِي السَّمَآءِ رِزْقُكُمْ:} اکثر مفسرین نے یہاں رزق سے مراد بارش لی ہے، جیسا کہ فرمایا : « هُوَ الَّذِيْ يُرِيْكُمْ اٰيٰتِهٖ وَ يُنَزِّلُ لَكُمْ مِّنَ السَّمَآءِ رِزْقًا» [ المؤمن : ۱۳ ] ’’وہی ہے جو تمھیں اپنی نشانیاں دکھاتا ہے اور تمھارے لیے آسمان سے رزق اتارتا ہے۔‘‘ مگر لفظ عام ہیں، اس لیے رزق سے مراد وہ سب کچھ ہے جو دنیا میں انسان کو جینے، کھانے پینے اور کام کرنے کے لیے دیا جاتا ہے۔ یعنی تمھیں جو کچھ دیا جا رہا ہے وہ آسمان میں اللہ تعالیٰ ہی کے پاس ہے اور تمھیں وہیں سے عطا ہوتا ہے۔ {’’ وَ فِي السَّمَآءِ ‘‘} مقدم لانے سے کلام میں حصر پیدا ہو گیا، اس لیے ترجمہ کیا گیا ہے ’’تمھارا رزق آسمان ہی میں ہے۔‘‘ تو جب تمھارا رزق آسمان ہی میں ہے تو پھر کمائی کے لیے اتنی فکر کیوں کہ جائز و ناجائز کی تمیز بھی نہ کی جائے اور حق والوں کو حق بھی نہ دیا جائے؟ پھر سائل اور محروم پر خرچ کرنے میں بخل اور دریغ کیسا؟ اور جب آتا آسمان سے ہے تو کسی پر خرچ کرکے اپنا احسان جتلانے کی کیا وجہ؟ ¤ ➋ { وَ مَا تُوْعَدُوْنَ:} یعنی حشر و نشر، جزا و سزا اور جنت و دوزخ وغیرہ، جن کے رونما ہونے کا وعدہ تمام انبیاء کی زبانی اور تمام آسمانی کتابوں کے ذریعے سے کیا گیا ہے، ان سب کا حکم آسمان ہی سے ہے۔ شاہ عبد القادر لکھتے ہیں : ’’آنے والی جو بات ہے اس کا حکم آسمان ہی سے اترتا ہے۔‘‘ (موضح) ¤ ➌ اس مقام پر بعض مفسرین نے کچھ لوگوں کے واقعات لکھے ہیں جنھوں نے یہ آیت سن کر کمائی ترک کر دی اور اللہ پر بھروسا کرتے ہوئے جنگل بیابان کی راہ لی اور وہاں اللہ تعالیٰ کی طرف سے انھیں تازہ کھجوریں اور رزق ملنے لگا۔ چنانچہ طبری نے سفیان ثوری کی زبانی نقل کیا ہے کہ واصل احدب نے یہ آیت {’’ وَ فِي السَّمَآءِ رِزْقُكُمْ وَ مَا تُوْعَدُوْنَ ‘‘} پڑھی تو کہنے لگے : ’’میرا رزق تو مجھے آسمان میں نظر آ رہا ہے اور میں اسے زمین میں ڈھونڈتا پھرتا ہوں۔‘‘ یہ کہہ کر وہ ایک خرابے میں چلے گئے۔ تین دن تک کھانے کو کچھ نہ ملا، جب تیسرا دن ہوا تو اچانک ان کے پاس تازہ کھجوروں کی ایک ٹوکری آ گئی۔ ان کا ایک بھائی تھا، جو ان سے بھی اچھی نیت والا تھا، وہ بھی اس خرابے میں ان کے ساتھ آ گیا تو ٹوکریاں دو ہو گئیں۔ ان کا یہی حال رہا، یہاں تک کہ موت نے ان کے درمیان جدائی ڈال دی۔ ¤ حقیقت یہ ہے کہ ایسی ہی کہانیوں نے اسلام کا رخِ روشن مسخ کیا ہے۔ آسمان میں رزق ہونے کا مطلب یہ ہر گز نہیں کہ آدمی کمانا ترک کر دے۔ یہ رہبانیت ہے جس کی اسلام میں گنجائش ہی نہیں، یہاں تو محنت کرکے کمانے اور دوسروں پر خرچ کرنے کی تلقین ہے، جنگلوں، بیابانوں یا خانقاہوں میں بیٹھ کر لوگوں کی طرف سے یا غیب سے آنے والے رزق کے انتظار کے بجائے جہاد فی سبیل اللہ کے ذریعے سے پاکیزہ ترین رزق حاصل کرنے کی ترغیب ہے۔ رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنھم کی پوری زندگی اس کی شاہد ہے۔ آسمان میں رزق ہونے کا یقین دلانے کا مطلب صرف یہ ہے کہ آدمی اپنی ساری جد و جہد کے باوجود بھروسا صرف آسمان والے پر رکھے اور ایک لمحہ کے لیے بھی رزق کی خاطر اس کے حکم سے سرتابی نہ کرے۔ تعجب اس بات پر ہوتا ہے کہ ابن کثیر رحمہ اللہ جیسے محقق نے کسی تنقید کے بغیر یہ کہانی نقل کر دی ہے، حالانکہ طبری میں اس روایت کے راوی طبری کے استاذ محمد بن حمید رازی ہیں، جن کا ضعیف ہونا معروف ہے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) {فَوَرَبِّ السَّمَآءِ وَ الْاَرْضِ اِنَّهٗ لَحَقٌّ … :} کسی بات کا یقین دلانے کے لیے اس کی تشبیہ ایسی چیز کے ساتھ دی جاتی ہے جو مخاطب کے نزدیک یقینی ہو، مثلاً کہا جاتا ہے : {’’كَمَا أَنَّكَ هٰهُنَا‘‘} کہ یہ بات ایسے ہی یقینی ہے جیسے تم یہاں موجود ہو، یا {’’كَمَا أَنَّكَ تَسْمَعُ وَ تَرٰي‘‘} جیسے یہ یقینی ہے کہ تم سن رہے ہو اور دیکھ رہے ہو۔ یہاں اللہ تعالیٰ نے ان باتوں کا یقین دلانے کے لیے جو اس سے پہلے گزری ہیں آسمان و زمین کے رب کی قسم کھا کر فرمایا کہ یہ سب کچھ ایسے ہی حق اور یقینی ہے جیسے تمھیں یقین ہے کہ تم بولتے ہو۔ اس سے پہلے مذکور چیزوں میں سب سے قریب یہ ہے کہ تمھارا رزق اور وہ تمام چیزیں جن کا تم سے وعدہ کیا جاتا ہے آسمان ہی میں ہیں۔ اس لیے مطلب یہ ہوا کہ تمھارے رزق کا اور تم سے وعدہ کردہ چیزوں کا آسمان ہی میں ہونا ایسے ہی یقینی ہے جیسے تمھارا بولنا یقینی ہے اور تمھیں کوئی شک نہیں کہ تم واقعی بولتے ہو۔ {’’ اِنَّهٗ لَحَقٌّ ‘‘} (بلاشبہ یقینا یہ حق ہے) سے مراد سورت کے شروع سے یہاں تک مذکور تمام چیزیں بھی ہو سکتی ہیں کہ بلاشبہ یقینا تم سے کیے گئے وعدے، قیامت، جزا و سزا، جنت و جہنم، تمھارے رزق کا اور تم سے وعدہ کردہ چیزوں کا آسمان ہی میں ہونا ایسے ہی حق ہے جیسے یہ حق ہے کہ تم بول رہے ہو اور تمھیں اپنے بولنے میں شک نہیں۔ اللہ تعالیٰ نے سننے یا دیکھنے وغیرہ کے بجائے بولنے کا ذکر اس لیے فرمایا کہ سننے یا دیکھنے میں بعض اوقات شبہ بھی پڑ جاتا ہے، مگر آدمی کو اپنے بولنے میں کبھی شبہ نہیں ہوتا کہ میں بول رہا ہوں اور بات کر رہا ہوں۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { هَلْ اَتٰىكَ حَدِيْثُ ضَيْفِ اِبْرٰهِيْمَ … :} یہاں سے رسول اللہ صلی اللہ علیہ وسلم کی تسلی کے لیے چند انبیاء کی مدد کا اور انھیں جھٹلانے والی اقوام پر آنے والے عذابوں کا ذکر فرمایا۔ ابراہیم اور لوط علیھما السلام کے واقعات اور ان کے تفسیری فوائد سورۂ ہود (۶۹ تا ۸۳)، حجر (۵۱ تا ۷۷) اور عنکبوت (۱۶ تا ۳۵) میں تفصیل سے گزر چکے ہیں۔ اس مقام سے تعلق رکھنے والی چند باتیں یہاں ذکر کی جاتی ہیں۔ ¤ ➋ کیا تیرے پاس ابراہیم کے معزز مہمانوں کی خبر آئی ہے؟ سوال سے مقصود اس واقعہ کی عظمت و شان اور اہمیت کا احساس دلانا ہے اور یہ بھی کہ آپ کو اس بات کی خبر نہ تھی، یہ ہم ہیں جو وحی کے ذریعے سے آپ کو اس سے آگاہ کر رہے ہیں۔ ¤ ➌ { ’’ الْمُكْرَمِيْنَ ‘‘} (معزز) اس لیے فرمایا کہ فرشتے اللہ تعالیٰ کے ہاں معزز ہیں، جیسا کہ فرمایا : « بَلْ عِبَادٌ مُّكْرَمُوْنَ » [ الأنبیاء : ۲۶ ] ’’بلکہ وہ بندے ہیں جنھیں عزت دی گئی ہے۔‘‘ اور ہمارے نبی صلی اللہ علیہ وسلم کا بھی حکم ہے : [ مَنْ كَانَ يُؤْمِنُ بِاللّٰهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ ] [ بخاري، الأدب، باب من کان یؤمن باللّٰہ… : ۶۰۱۸ ] ’’جو شخص اللہ اور یومِ آخرت پر ایمان رکھتا ہے وہ اپنے مہمان کا اکرام کرے۔‘‘"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ { اِذْ دَخَلُوْا عَلَيْهِ فَقَالُوْا …:’’ سَلٰمًا ‘‘} اور {’’ سَلٰمٌ ‘‘} کے فرق کے لیے دیکھیے سورۂ ہود (۶۹) کی تفسیر۔ ¤ ➋ { قَوْمٌ مُّنْكَرُوْنَ:} یہ بات دل میں کہی یا گھر والوں سے کہی اور ممکن ہے انسانی شکل میں آنے والے فرشتوں سے کہی ہو کہ آپ اس علاقے میں نئے تشریف لائے ہیں، پہلے کبھی آپ کو یہاں نہیں دیکھا۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ {فَرَاغَ اِلٰۤى اَهْلِهٖ: ’’رَاغَ يَرُوْغُ رَوْغًا‘‘} (ن) کا معنی خفیہ طور پر جانا، حیلے کے ساتھ تیزی سے نکل جانا ہے۔ یہ {’’رَوْغَانُ الثَّعْلَبِ‘‘} سے ہے، لومڑی کا خفیہ طریقے سے آنا جانا۔ مطلب یہ ہے کہ ابراہیم علیہ السلام مہمانوں کے لیے کھانے کا انتظام کرنے کے لیے خاموشی سے گئے، تاکہ انھیں خبر نہ ہو سکے اور وہ جاتے ہوئے دیکھ کر مہمانی لانے سے منع نہ کر دیں۔ اس سے معلوم ہوا کہ مہمانوں سے پوچھنا کہ کیا آپ کھانا کھائیں گے تو ایک طرف، انھیں تو مہمانی کے اہتمام کا حتیٰ الوسع پتا بھی نہیں لگنے دینا چاہیے۔ ¤ ➋ { فَجَآءَ بِعِجْلٍ سَمِيْنٍ:} سورۂ ہود میں {’’ بِعِجْلٍ حَنِيْدٍ ‘‘} (بھنا ہوا بچھڑا) آیا ہے۔ معلوم ہوا موٹا تازہ بچھڑا بھون کر لائے تھے۔ بعض مفسرین نے {’’ سَمِيْنٍ ‘‘} کا معنی ’’گھی میں تلا ہوا‘‘ کیا ہے، کیونکہ ’’سمن ‘‘ کا معنی موٹاپا بھی ہے اور گھی بھی۔ اس کے مطابق {’’ سَمِيْنٍ ‘‘} کا معنی موٹا بھی ہو سکتا ہے اور گھی میں تلا ہوا بھی۔ مگر {’’ حَنِيْدٍ ‘‘} کے ساتھ {’’ سَمِيْنٍ ‘‘} کا معنی ’’موٹا‘‘ زیادہ مناسب ہے، کیونکہ {’’ حَنِيْدٍ ‘‘ } گرم پتھروں یا کوئلے پر بھنے ہوئے کو کہتے ہیں۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) {فَقَرَّبَهٗۤ اِلَيْهِمْ قَالَ اَلَا تَاْكُلُوْنَ:} اس سے معلوم ہوا کہ یہ بھی مہمان نوازی کے آداب میں سے ہے کہ جہاں تک ہو سکے مہمانوں کو کھانے تک جانے کی زحمت دینے کے بجائے اسے ان کی خدمت میں پیش کرنا چاہیے اور یہ بھی کہ اگر وہ کھانے میں تامل کریں تو شائستہ طریقے سے کھانے کی درخواست کرنی چاہیے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ {فَاَوْجَسَ مِنْهُمْ خِيْفَةً …:} اس کی تفصیل کے لیے دیکھیے سورۂ ہود (۷۰) کی تفسیر۔ ¤ ➋ { وَ بَشَّرُوْهُ بِغُلٰمٍ عَلِيْمٍ:} سورۂ ہود میں اس لڑکے کا نام اسحاق آیا ہے، وہ ’’غلام عليم‘‘ تھے اور اسماعیل علیہ السلام ’’غلام حلیم۔‘‘ ان کا ذکر سورۂ صافات (۱۰۱) میں ہے۔ اسحاق علیہ السلام کو {’’ بِغُلٰمٍ عَلِيْمٍ ‘‘} فرمایا، حالانکہ {’’ عَلِيْمٍ ‘‘} تو انھوں نے جوانی میں بننا تھا۔ اس سے ظاہر ہے کہ جو بچے حفظ شروع کر دیں انھیں آئندہ کا لحاظ کرتے ہوئے حافظ کہا جا سکتا ہے۔ (و اللہ اعلم)"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { فَاَقْبَلَتِ امْرَاَتُهٗ فِيْ صَرَّةٍ …:’’ صَرَّةٍ ‘‘} صیحہ، چیخ۔ {’’صَرَّ يَصُرُّ‘‘ (ن) ’’صَرِيْرُ الْقَلَمِ‘‘} (قلم کی آواز) اور {’’صَرِيْرُ الْبَابِ‘‘ } (دروازے کی آواز) بھی اسی سے مشتق ہے۔ {’’ صَرَّةٍ ‘‘} میں تنوین تعظیم کی ہے : {’’أَيْ صَيْحَةٌ عَظِيْمَةٌ وَ رَنَّةٌ۔‘‘} ابن کثیر نے فرمایا : {’’ صَرَّةٍ ‘‘} سے مراد اس کا {’’ يٰوَيْلَتٰۤي ‘‘} کہنا ہے جو سورۂ ہود(۷۲) میں مذکور ہے، یہاں اس کا قول مختصر ذکر فرمایا ہے۔ {’’ عَجُوْزٌ عَقِيْمٌ ‘‘ ’’أَيْ أَنَا عَجُوْزٌ عَقِيْمٌ‘‘} یعنی یہ بشارت سن کر اپنی عمر کو دیکھتے ہوئے حیرت و مسرت کے جذبات سے بے اختیار چیختی ہوئی فرشتوں کی طرف آئی۔ ¤ ➋ { فَصَكَّتْ وَجْهَهَا: ’’صَكَّ يَصُكُّ صَكًّا‘‘} (ن) چہرے پر زور سے ہاتھ مارنا، جیسا کہ عورتیں تعجب کے وقت کرتی ہیں۔ یعنی تعجب سے چہرے کو پیٹ کر کہنے لگی کہ میں تو بوڑھی ہوں، جوانی کی عمر سے بانجھ ہوں، اب خاک بچہ جنوں گی۔ ¤ ➌ بعض لوگوں نے اس سے ماتم اور سینہ کوبی کی دلیل کشید کی ہے، مگر یہ نہیں سوچا کہ کیا خوشی کی خبر پر بھی ماتم ہوتا ہے!؟"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {قَالُوْا كَذٰلِكِ قَالَ رَبُّكِ … :} فرشتوں نے کہا بے شک آپ ایسی ہی ہیں، مگر ہم بھی اپنی طرف سے نہیں کہہ رہے بلکہ آپ کے رب کی بات بتا رہے ہیں، اس نے ایسے ہی فرمایا ہے، یقینا وہ کمال حکمت اور علم والا ہے، نہ اس کے علم سے کوئی چیز باہر ہے اور نہ اس کے کسی کام میں کوئی خامی یا غلطی ہے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { قَالَ فَمَا خَطْبُكُمْ اَيُّهَا الْمُرْسَلُوْنَ:} جب ابراہیم علیہ السلام مہمانوں کے کھانا نہ کھانے پر خوف زدہ ہوئے اور صاف اظہار بھی کر دیا : « اِنَّا مِنْكُمْ وَ جِلُوْنَ» [ الحجر : ۵۲ ] ’’ہم تو تم سے ڈرنے والے ہیں۔‘‘ کیونکہ انھیں ان کے فرشتہ ہونے کا اندازہ ہو گیا تھا اور وہ یہ بھی جانتے تھے کہ فرشتوںکا اس طرح آنا معمولی بات نہیں ہوتی، جیسا کہ فرمایا : « مَا نُنَزِّلُ الْمَلٰٓىِٕكَةَ اِلَّا بِالْحَقِّ وَ مَا كَانُوْۤا اِذًا مُّنْظَرِيْنَ» [ الحجر : ۸ ] ’’ہم فرشتوں کو نہیں اتارتے مگر حق (عذاب) کے ساتھ اور اس وقت وہ مہلت دیے گئے نہیں ہوتے۔‘‘ اس لیے وہ شدید ڈر گئے، تو فرشتوں نے ان کا خوف دور کرنے کے لیے ان سے دو باتیں کہیں، ایک یہ : « لَا تَخَفْ اِنَّاۤ اُرْسِلْنَاۤ اِلٰى قَوْمِ لُوْطٍ» [ ہود : ۷۰ ] ’’ڈرو نہیں، کیونکہ ہم لوط کی قوم کی طرف بھیجے گئے ہیں۔‘‘ یعنی آپ کو ڈرنے کی ضرورت نہیں، ہماری منزل مقصود دوسری ہے۔ دوسری بات انھوں نے یہ کی کہ ہم آپ کو بیٹے اور پوتے اسحاق و یعقوب کی بشارت دینے آئے ہیں۔ (دیکھیے ہود : ۷۱) جب ابراہیم علیہ السلام کو اطمینان ہو گیا تو انھوں نے پوچھا، تو اے بھیجے جانے والے فرشتو! (قومِ لوط کے ساتھ) تمھارا معاملہ کیا ہے اور تم ان کے متعلق کیا کرنا چاہتے ہو؟ یاد رہے ! {’’خَطْبٌ‘‘} کا لفظ عموماً کسی اہم یا سخت معاملے کے متعلق ہی استعمال کیا جاتا ہے۔ ¤ ➋ اس سارے واقعہ سے یہ بات ثابت ہوتی ہے کہ انبیاء علیھم السلام عالم الغیب نہیں ہوتے۔ تفصیل کے لیے دیکھیے سورۂ حجر (۶۲) کی تفسیر۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32تا34) {قَالُوْۤا اِنَّاۤ اُرْسِلْنَاۤ اِلٰى قَوْمٍ مُّجْرِمِيْنَ … :} ان آیات کی تفصیل کے لیے دیکھیے سورۂ ہود (۸۳)، حجر (۵۸، ۷۴) اور سورۂ عنکبوت (۳۱ تا ۳۵)۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 32تا34) {قَالُوْۤا اِنَّاۤ اُرْسِلْنَاۤ اِلٰى قَوْمٍ مُّجْرِمِيْنَ … :} ان آیات کی تفصیل کے لیے دیکھیے سورۂ ہود (۸۳)، حجر (۵۸، ۷۴) اور سورۂ عنکبوت (۳۱ تا ۳۵)۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 32تا34) {قَالُوْۤا اِنَّاۤ اُرْسِلْنَاۤ اِلٰى قَوْمٍ مُّجْرِمِيْنَ … :} ان آیات کی تفصیل کے لیے دیکھیے سورۂ ہود (۸۳)، حجر (۵۸، ۷۴) اور سورۂ عنکبوت (۳۱ تا ۳۵)۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) {فَاَخْرَجْنَا مَنْ كَانَ فِيْهَا مِنَ الْمُؤْمِنِيْنَ:} عذاب آنے سے پہلے لوط علیہ السلام کے گھر والوں کو اس بستی سے نکالنے کی تفصیل کے لیے دیکھیے سورۂ ہود (۸۱) اور سورۂ حجر (۶۵)۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {فَمَا وَجَدْنَا فِيْهَا غَيْرَ بَيْتٍ مِّنَ الْمُسْلِمِيْنَ:} یعنی اس بستی میں مسلمانوں کا صرف ایک گھر تھا اور وہ لوط علیہ السلام کا گھر تھا، جنھیں بیوی کے سوا اس کے تمام افراد کو ساتھ لے کر نکل جانے کا حکم ہوا۔ ¤ ان دونوں آیات سے اس بات کی تائید ہوتی ہے کہ جب اسلام حقیقی اور سچا ہو تو وہی ایمان بھی ہے، اس صورت میں اسلام و ایمان اور مسلم و مومن ایک ہی چیز ہیں۔ ہاں جب اسلام حقیقی نہ ہو، بلکہ صرف ظاہری اعمال پر مشتمل ہو تو اسلام اور ایمان میں فرق ہے۔ امام بخاری رحمہ اللہ اور محدثین یہی فرماتے ہیں۔ مزید دیکھیے سورۂ حجرات (۱۴، ۱۵) کی تفسیر۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) { وَ تَرَكْنَا فِيْهَاۤ اٰيَةً لِّلَّذِيْنَ يَخَافُوْنَ الْعَذَابَ الْاَلِيْمَ:} اس بستی کو عذاب الیم سے ڈرنے والوں کے لیے نشانی اس لیے قرار دیا کہ وہی اس سے عبرت حاصل کرتے اور فائدہ اٹھاتے ہیں۔ رہے وہ لوگ جو ڈرنے کے بجائے سرکشی اختیار کرتے اور خواہش نفس کے پیچھے چلتے ہیں ان کے لیے ہر نشانی کفر اور سرکشی میں اضافے کا باعث ہی بنتی ہے۔ مزید دیکھیے سورۂ حجر (۷۵ تا ۷۷) اور سورۂ عنکبوت (۳۵)۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) {وَ فِيْ مُوْسٰۤى اِذْ اَرْسَلْنٰهُ اِلٰى فِرْعَوْنَ بِسُلْطٰنٍ مُّبِيْنٍ:} یعنی لوط علیہ السلام کی بستی کے علاوہ موسیٰ علیہ السلام کے واقعہ میں بھی ان لوگوں کے لیے بڑی عبرت ہے جو عذاب الیم سے ڈرتے ہیں، جب ہم نے انھیں صریح معجزات دے کر بھیجا، جو ان کے اللہ کا پیغمبر ہونے کی واضح دلیل تھے۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) {فَتَوَلّٰى بِرُكْنِهٖ وَ قَالَ سٰحِرٌ اَوْ مَجْنُوْنٌ: ’’ بِرُكْنِهٖ ‘‘} میں ’’باء‘‘ سببیہ ہے۔ {’’رُكْنٌ‘‘} کسی چیز کا سہارا اور آسرا، قوت۔ یعنی اس نے اپنی سلطنت اور فوجوں کی قوت کی وجہ سے ان واضح دلائل سے منہ پھیر لیا اور حق پہچان لینے کے باوجود ایمان لانے سے انکار کر دیا اور لوگوں کو موسیٰ علیہ السلام سے برگشتہ کرنے کے لیے کہنے لگا کہ یہ جادوگر ہے یا دیوانہ ہے۔ موسیٰ علیہ السلام کا واقعہ اور ان کی فرعون کے ساتھ تفصیلی گفتگو، جس میں فرعون نے انھیں دیوانہ اور پھر جادوگر قرار دیا سورۂ شعراء (۱۰ تا ۳۵) میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) {فَاَخَذْنٰهُ وَ جُنُوْدَهٗ فَنَبَذْنٰهُمْ فِي الْيَمِّ … : ’’أَلَامَ يُلِيْمُ‘‘} (افعال) ایسا کام کرنا جس پر ملامت کی جائے۔ {’’ مُلِيْمٌ ‘‘} مستحق ملامت، ایسا کام کرنے والا جس پر اسے ملامت کی جائے۔ یعنی وہ ایسا ظالم و سرکش تھا کہ اس کے سمندر میں لشکر سمیت غرق ہونے پر کسی نے اس کے حق میں کوئی کلمۂ خیر نہیں کہا، بلکہ ہر شخص کے منہ سے اس کے لیے ملامت اور پھٹکار ہی نکلی، جس نے سنا یہی کہا کہ ان کے ساتھ ایسے ہی ہونا چاہیے تھا۔ خس کم جہاں پاک۔ اللہ تعالیٰ نے فرمایا : « فَمَا بَكَتْ عَلَيْهِمُ السَّمَآءُ وَ الْاَرْضُ» [ الدخان : ۲۹ ] ’’پھر نہ آسمان ان پر رویا نہ زمین۔‘‘ سمندر میں پھینکے جانے کی تفصیل کے لیے دیکھیے سورۂ یونس (۹۰ تا ۹۲)، طٰہٰ (۷۷، 78) اور شعراء (۵۲ تا ۶۷)۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) {وَ فِيْ عَادٍ اِذْ اَرْسَلْنَا عَلَيْهِمُ الرِّيْحَ الْعَقِيْمَ:} یعنی قوم عاد میں بھی ہم نے ایک نشانی اور بڑی عبرت چھوڑی۔ {’’ الْعَقِيْمَ ‘‘} وہ رحم یا عورت جس سے بچہ پیدا نہ ہو، ایسے مرد کو بھی {’’عقيم‘‘} کہتے ہیں، پھر ہر اس چیز کو بھی جو خیر و برکت سے خالی ہو۔ قوم عاد پر جو آندھی مسلط کی گئی وہ بھی ہر خیر و برکت سے خالی اور سراسر بربادی اور تباہی تھی، اس لیے اسے {’’ الْعَقِيْمَ ‘‘} فرمایا۔ اس کی تفصیل کے لیے دیکھیے سورۂ حاقہ (۶ تا ۸)، قمر (۱۹، ۲۰) اور سورۂ احقاف (۲۴، ۲۵)۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) {مَا تَذَرُ مِنْ شَيْءٍ اَتَتْ عَلَيْهِ … : ’’اَلرَّمِيْمُ‘‘} بوسیدہ، پرانی، گلی ہوئی ہڈی۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 44،43) {وَ فِيْ ثَمُوْدَ اِذْ قِيْلَ لَهُمْ تَمَتَّعُوْا حَتّٰى حِيْنٍ … :} اس کی تفسیر میں دو قول ہیں، ایک یہ کہ جب انھوں نے اونٹنی کو کاٹ دیا تو ان سے کہا گیا کہ تین دن تک خوب فائدہ اٹھا لو، اس کے بعد تم پر عذاب آ جائے گا۔ ان تین دنوں میں وہ تائب ہو سکتے تھے، مگر وہ اپنی سرکشی پر اور صالح علیہ السلام کی تکذیب پر اڑے رہے، تو تیسرے دن ان کے دیکھتے دیکھتے ایک ہولناک چیخ بلند ہوئی (ہود : ۶۷) جس کے ساتھ نہایت خوفناک کڑک والی بجلی گری، جس نے انھیں بھسم کر دیا اور وہ اس طرح نیست و نابود ہوئے جیسے کبھی ان کا وجود ہی نہ تھا۔ فرمایا : «كَاَنْ لَّمْ يَغْنَوْا فِيْهَا » [ ھود : ۶۸ ] ’’جیسے وہ ان میں رہے ہی نہ تھے۔‘‘ دوسرا قول یہ ہے کہ اس {’’ تَمَتَّعُوْا حَتّٰى حِيْنٍ ‘‘} (ایک وقت تک خوب فائدہ اٹھا لو) کہنے سے مراد صالح علیہ السلام کا ان کی طرف مبعوث ہونے کے وقت کا خطاب ہے کہ دنیا میں تمھیں موت تک مہلت ہے، اس میں خوب فائدہ اٹھا لو، مگر اس اونٹنی کو نقصان نہ پہنچانا ورنہ تم پر عذاب آ جائے گا، مگر انھوں نے اپنے رب کے حکم سے سرکشی کی اور اونٹنی کو کاٹ دیا تو انھیں صاعقہ نے پکڑ لیا۔ آیت کے الفاظ میں دونوں معنوں کی گنجائش ہے اور دونوں بیک وقت بھی مراد ہو سکتے ہیں۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44،43) {وَ فِيْ ثَمُوْدَ اِذْ قِيْلَ لَهُمْ تَمَتَّعُوْا حَتّٰى حِيْنٍ … :} اس کی تفسیر میں دو قول ہیں، ایک یہ کہ جب انھوں نے اونٹنی کو کاٹ دیا تو ان سے کہا گیا کہ تین دن تک خوب فائدہ اٹھا لو، اس کے بعد تم پر عذاب آ جائے گا۔ ان تین دنوں میں وہ تائب ہو سکتے تھے، مگر وہ اپنی سرکشی پر اور صالح علیہ السلام کی تکذیب پر اڑے رہے، تو تیسرے دن ان کے دیکھتے دیکھتے ایک ہولناک چیخ بلند ہوئی (ہود : ۶۷) جس کے ساتھ نہایت خوفناک کڑک والی بجلی گری، جس نے انھیں بھسم کر دیا اور وہ اس طرح نیست و نابود ہوئے جیسے کبھی ان کا وجود ہی نہ تھا۔ فرمایا : «كَاَنْ لَّمْ يَغْنَوْا فِيْهَا » [ ھود : ۶۸ ] ’’جیسے وہ ان میں رہے ہی نہ تھے۔‘‘ دوسرا قول یہ ہے کہ اس {’’ تَمَتَّعُوْا حَتّٰى حِيْنٍ ‘‘} (ایک وقت تک خوب فائدہ اٹھا لو) کہنے سے مراد صالح علیہ السلام کا ان کی طرف مبعوث ہونے کے وقت کا خطاب ہے کہ دنیا میں تمھیں موت تک مہلت ہے، اس میں خوب فائدہ اٹھا لو، مگر اس اونٹنی کو نقصان نہ پہنچانا ورنہ تم پر عذاب آ جائے گا، مگر انھوں نے اپنے رب کے حکم سے سرکشی کی اور اونٹنی کو کاٹ دیا تو انھیں صاعقہ نے پکڑ لیا۔ آیت کے الفاظ میں دونوں معنوں کی گنجائش ہے اور دونوں بیک وقت بھی مراد ہو سکتے ہیں۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) { فَمَا اسْتَطَاعُوْا مِنْ قِيَامٍ … : ’’ مُنْتَصِرِيْنَ ‘‘ ’’اِنْتِصَارٌ‘‘} کے لفظ میں اپنے آپ کو کسی سے بچانے کا مفہوم بھی شامل ہے اور بدلا لینے کا بھی۔ یعنی جب وہ عذاب کے تھپیڑے سے زمین پر گرے تو پھر نہ کسی طرح اٹھ سکے اور نہ اس سے بچاؤ کر سکے، بدلا لینا تو بہت دور کی بات ہے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) {وَ قَوْمَ نُوْحٍ مِّنْ قَبْلُ … :} رازی نے یہاں ایک نکتہ بیان فرمایا ہے کہ ان پانچ اقوام کے ذکر میں اشارہ ہے کہ اللہ تعالیٰ نے انھیں انھی چیزوں کے ساتھ عذاب دیا جو ان کے وجود اور قیام کا باعث تھیں۔ وہ چار چیزیں ہیں، مٹی، پانی، ہوا اور آگ۔ قومِ لوط کھنگر مٹی کے پتھروں کے ساتھ ہلاک ہوئی، فرعون اور قومِ نوح پانی کے ساتھ، عاد ہوا کے ساتھ اور ثمود آگ کے ساتھ تباہ و برباد کیے گئے۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ { وَ السَّمَآءَ بَنَيْنٰهَا بِاَيْىدٍ:} سورت کی ابتدا سے قیامت اور جزا و سزا کے حق ہونے کا بیان چلا آ رہا ہے، اس کے لیے اللہ تعالیٰ نے کئی قسمیں کھائیں اور دوبارہ زندہ کرنے پر اپنے قادر ہونے کے بہت سے دلائل پیش فرمائے، جن میں آسمان و زمین کا خصوصاً ذکر فرمایا۔ درمیان میں رسول اللہ صلی اللہ علیہ وسلم کی تسلی اور کفار کو تنبیہ کے لیے قیامت اور پیغمبروں کو جھٹلانے والی اقوام کے انجامِ بد کا ذکر فرمایا۔ منکرینِ قیامت کا سب سے بڑا شبہ یہ ہے کہ مرنے اور بوسیدہ ہو جانے کے بعد دوبارہ زندگی کیسے ممکن ہے؟ اس لیے اللہ تعالیٰ اس شبہے کے ردّ کے لیے آسمان و زمین کا خاص طور پر ذکر فرماتے ہیں، کیونکہ انسان کو نظر آنے والی مخلوقات میں یہ سب سے بڑے ہیں، جیسا کہ فرمایا : « لَخَلْقُ السَّمٰوٰتِ وَ الْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ » [ المؤمن : ۵۷ ] ’’یقینا آسمانوں اور زمین کو پیدا کرنا لوگوں کو پیدا کرنے سے بہت بڑا ہے اور لیکن اکثر لوگ نہیں جانتے۔‘‘ یہاں آخرت کے حق میں تاریخی دلائل ذکر کرنے کے بعد دوبارہ پھر اس کے ثبوت میں آفاقی دلائل پیش کیے جا رہے ہیں۔ قرآن مجید اسی طرح بات کو مختلف انداز سے پھیر پھیر کر بیان کرتا ہے، تاکہ وہ اچھی طرح ذہن نشین ہو جائے۔ ¤ ➋ {’’ أَيْدٍ ‘‘ ’’يَدٌ‘‘} کی جمع کے طور پر بھی آتا ہے جس کا معنی ہاتھ ہے اور اگر یہ معنی کیا جائے کہ ’’ہم نے آسمان کو ہاتھوں کے ساتھ بنایا‘‘ تو اس سے کوئی خرابی لازم نہیں آتی، کیونکہ قرآن و حدیث سے ثابت ہے کہ اللہ تعالیٰ کے ہاتھ ہیں اور اس طرح ہیں جس طرح اس کی شان کے لائق ہے، ہم نہیں جانتے نہ جان سکتے ہیں کہ کیسے ہیں۔ اللہ تعالیٰ نے ابلیس سے فرمایا : « مَا مَنَعَكَ اَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ » [ صٓ : ۷۵ ] ’’تجھے کس چیز نے روکا کہ تو اس کے لیے سجدہ کرے جسے میں نے اپنے دونوں ہاتھوں سے بنایا؟‘‘ مگر یہاں {’’ بِاَيْىدٍ ‘‘ ’’آدَ يَئِيْدُ‘‘} (قوی ہونا) کا مصدر ہے اور معنی اس کا ’’قوت‘‘ ہے، تنوین اس میں تعظیم کی ہے اور « وَ اَيَّدْنٰهُ بِرُوْحِ الْقُدُسِ » [ البقرۃ : ۲۵۳ ] (اور ہم نے اسے روح القدس کے ساتھ قوت بخشی) بھی اسی سے مشتق ہے۔ اس مقام پر {’’ بِاَيْىدٍ ‘‘} کا یہ معنی طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ترجمان القرآن ابن عباس رضی اللہ عنھما سے نقل کیا ہے۔ اللہ تعالیٰ نے فرمایا : «وَ اذْكُرْ عَبْدَنَا دَاوٗدَ ذَا الْاَيْدِ » [ صٓ : ۱۷ ] ’’اور ہمارے بندے داؤد کو یاد کر جو قوت والا تھا۔‘‘ یعنی اتنا عظیم آسمان بنانا معمولی کام نہیں، یہ ہماری ہی قوت ہے جس کے ساتھ ہم نے اسے اس وقت بنایا جب کچھ بھی نہیں تھا، تو ہم تمھیں دوبارہ کیوں نہیں بنا سکتے؟ آسمان کے لیے {’’خَلَقْنَاهَا‘‘} کے بجائے {’’ بَنَيْنٰهَا ‘‘} کا لفظ استعمال فرمایا، کیونکہ دیکھنے میں وہ ایک خیمے کی مانند نظر آتا ہے، جس کے لیے لفظ {’’ بِنَاءٌ‘‘} استعمال کیا جاتا ہے۔ پھر لفظ {’’ بِنَاءٌ‘‘} میں بناوٹ پر غور کرنے کی دعوت بھی ہے کہ اتنے عظیم آسمان کو ستونوں کے بغیر بنانے والے کے متعلق تم نے یہ گمان کر رکھا ہے کہ وہ انسان ضعیف البنیان کو دوبارہ نہیں بنا سکے گا۔ پھر یہ کہنے کے بجائے کہ{’’وَ بَنَيْنَا السَّمَاءَ‘‘} (اور ہم نے آسمان کو بنایا) یہ فرمایا : « وَ السَّمَآءَ بَنَيْنٰهَا» (اور آسمان، ہم نے اسے بنایا) اتنے سے لفظوں میں آسمان کا ذکر دو دفعہ فرما دیا۔ ایک لفظ {’’ السَّمَآءَ ‘‘} کے ساتھ اور دوسرا اس کی ضمیر {’’هَا‘‘} کے ساتھ، مقصد آسمان اور اس کی بناوٹ کی طرف اچھی طرح متوجہ کرنا ہے۔ ¤ ➌ { وَ اِنَّا لَمُوْسِعُوْنَ:’’مُوْسِعٌ ‘‘ ’’ أَوْسَعَ يُوْسِعُ‘‘} (افعال) سے اسم فاعل ہے، جب کوئی وسعت والا ہو، جیسا کہ فرمایا : «عَلَى الْمُوْسِعِ قَدَرُهٗ وَ عَلَى الْمُقْتِرِ قَدَرُهٗ » [ البقرۃ : ۲۳۶ ] ’’وسعت والے پر اس کی طاقت کے مطابق اور تنگی والے پر اس کی طاقت کے مطابق ہے۔‘‘ وسعت کا لفظ قدرت اور فراخی دونوںمعنوں کے لیے آتا ہے۔ اللہ تعالیٰ کے اسماء میں سے {’’وَاسِعٌ‘‘} بھی ہے، فرمایا : « اِنَّ اللّٰهَ وَاسِعٌ عَلِيْمٌ» [ البقرۃ : ۱۱۵ ] ’’بے شک اللہ وسعت والا، سب کچھ جاننے والا ہے۔‘‘ اللہ تعالیٰ کی ذات و صفات کی وسعت کی کوئی حد نہیں، اس کا وجود، حیات، علم، قدرت، حکمت وغیرہ سب لا محدود ہیں۔ {’’ اِنَّا لَمُوْسِعُوْنَ ‘‘ ’’إِنَّ‘‘} اور ’’لام‘‘ (تاکید کے دو حرفوں) کے ساتھ اس لیے فرمایا کہ قیامت کا منکر دراصل اللہ تعالیٰ کی قدرت و وسعت کا منکر ہے اور بلاغت کا قاعدہ ہے کہ مخاطب جس قدرکسی بات کا منکر ہو اتنی ہی زیادہ تاکید کے ساتھ بات کی جاتی ہے۔ ¤ ➍ { ’’أَوْسَعَ يُوْسِعُ‘‘} کا ایک معنی وسیع کرنا بھی ہے۔ اس صورت میں معنی یہ ہو گا کہ ’’آسمان، ہم نے اسے بنایا اور یقینا ہم وسیع کرنے والے ہیں۔‘‘ مفسر کیلانی لکھتے ہیں : ’’کائنات میں بے شمار چیزیں ایسی ہیں جن میں آج تک تخلیق اور توسیع کا عمل جاری ہے اور آئندہ بھی جاری رہے گا۔ (بلکہ ہر چیز کا یہی حال ہے) سب سے پہلے انسان ہی کو لیجیے، اس کی نسل بڑھ رہی ہے، تعداد میں اضافہ ہو رہا ہے اور یہی کائنات کا شاہکار ہے۔ پھر زمین کی پیداوار بھی اللہ تعالیٰ اسی نسبت سے بڑھاتے جا رہے ہیں۔ اس آیت میں بالخصوص آسمان کا ذکر ہے، تو آسمان کی پیدائش کا بھی یہی حال ہے، آسمان میں لاتعداد مجمع النجوم اور کہکشائیں ہیئت دانوں کو ورطۂ حیرت میں ڈال کر ان کے علم کو ہر آن چیلنج کر رہی ہیں۔ مزید حیرت کی بات یہ ہے کہ ہیئت دان جوں جوں پہلے سے زیادہ طاقت ور اور جدید قسم کی دور بینیں ایجاد کر رہے ہیں توں توں اس بات کا بھی انکشاف ہو رہا ہے کہ کائنات میں ہر آن مزید وسعت پیدا ہو رہی ہے۔ سیاروں کے درمیانی فاصلے بھی بڑھ رہے ہیں اور نئے نئے اجرام بھی مشاہدہ میں آ رہے ہیں۔‘‘"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ {وَ الْاَرْضَ فَرَشْنٰهَا:} آسمان بنانے کی طرح زمین بچھانے کو بھی دوبارہ زندہ کرنے پر قادر ہونے کی دلیل کے طور پر ذکر فرمایا ہے اور {’’وَفَرَشْنَا الْأَرْضَ‘‘} کے بجائے {’’ وَ الْاَرْضَ فَرَشْنٰهَا ‘‘} میں بھی وہی بات ملحوظ ہے جو {’’ وَ السَّمَآءَ بَنَيْنٰهَا ‘‘} میں ملحوظ ہے۔ زمین کی پیدائش میں اس کے گول ہونے کے ذکر کے بجائے، جو ہر ایک کی سمجھ میں آنے والی بات نہیں تھی، اس بات کا ذکر فرمایا جو ہر شخص کے مشاہدے اور استعمال میں ہے اور جس سے سب فائدہ اٹھاتے ہیں، کیونکہ اگر وہ ناہموار اور اونچی نیچی ہوتی تو اس پر ان کا اور ان کے جانوروں کا رہنا ہی ممکن نہ ہوتا، نہ وہ اس پر بیٹھ سکتے، نہ لیٹ سکتے اور نہ چل پھر سکتے اور اس خوشگوار زندگی اور آسائش کا تصور تک نہ ہوتا جو زمین کو بچھا کر اللہ تعالیٰ نے بندوں کو عطا فرما رکھی ہے۔ ¤ ➋ { فَنِعْمَ الْمٰهِدُوْنَ: ’’أَيْ نَحْنُ‘‘} یعنی ہم بہت اچھے بچھانے والے ہیں۔ ان آیات میں جمع متکلم (ہم) کا صیغہ اللہ تعالیٰ کی عظمت کے اظہار کے لیے استعمال کیا گیا ہے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { وَ مِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ:} آسمان و زمین کی پیدائش کے بعد تمام موجودات کو پیدا کرنے کی کیفیت بیان فرمائی کہ جس طرح آسمان کے مقابلے میں زمین ہے اسی طرح ہم نے ہر چیز کی دو دو قسمیں بنائی ہیں، ہر ایک کے مقابلے میں دوسری چیز موجود ہے۔ چنانچہ آسمان و زمین، دن رات، خشکی و تری، اندھیرا و اجالا، موت و حیات، نیکی و بدی، جنت و دوزخ، یہاں تک کہ نباتات و حیوانات کے بھی جوڑے ہیں۔ ¤ ➋ { لَعَلَّكُمْ تَذَكَّرُوْنَ:} تاکہ تم نصیحت حاصل کرو، توحید کو سمجھو اور جان لو کہ مخلوق جو بھی ہے اس کے مقابلے میں دوسری موجود ہے، مگر ان سب کا خالق ایک اللہ ہے، اس کا کوئی جوڑ ہے نہ ہمسر، نہ شریک اور نہ اس کے مقابلے میں کوئی ہستی ہے اور یہ بھی سمجھ لو کہ اتنی عظیم الشان کائنات کو بنانے والا تمھیں دوبارہ پیدا کرنے پر بھی قادر ہے اور تمھیں دوبارہ زندہ ہو کر اس کے حضور پیش ہونا ہے۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ {فَفِرُّوْۤا اِلَى اللّٰهِ:} یعنی جب آسمان و زمین اور کائنات کی ہر چیز اللہ تعالیٰ کے ایک ہونے پر اور تمھیں دوبارہ پیدا کرنے کی قدرت پر دلالت کر رہی ہے تو تم پر لازم ہے کہ اللہ کی طرف دوڑو، کفر کو ترک کرکے توحید کی طرف آؤ اور گناہوں سے توبہ کرکے اس کی رحمت کی پناہ میں آ جاؤ۔ ¤ ➋ { اِنِّيْ لَكُمْ مِّنْهُ نَذِيْرٌ مُّبِيْنٌ:} ابوموسیٰ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَثَلِيْ وَ مَثَلُ مَا بَعَثَنِيَ اللّٰهُ كَمَثَلِ رَجُلٍ أَتٰی قَوْمًا فَقَالَ رَأَيْتُ الْجَيْشَ بِعَيْنَيَّ، وَ إِنِّيْ أَنَا النَّذِيْرُ الْعُرْيَانُ فَالنَّجَاءَ النَّجَاءَ فَأَطَاعَتْهُ طَائِفَةٌ فَأَدْلَجُوْا عَلٰی مَهْلِهِمْ فَنَجَوْا، وَكَذَّبَتْهُ طَائِفَةٌ فَصَبَّحَهُمُ الْجَيْشُ فَاجْتَاحَهُمْ ] [بخاري، الرقاق، باب الانتہاء عن المعاصي : ۶۴۸۲ ] ’’میری مثال اور اللہ تعالیٰ نے جو کچھ دے کر مجھے بھیجا ہے اس کی مثال اس آدمی کی سی ہے جو ایک قوم کے پاس آیا اور کہنے لگا، میں نے لشکر اپنی آنکھوں سے دیکھا ہے اور میں ننگا ڈرانے والا ہوں، (عرب کا قدیم دستور تھا کہ دشمن کے حملے سے خبردار کرنے والا شخص کپڑے اتار دیتا اور ننگا ہو کر چیخ چیخ کر حملے سے ڈراتا) اس لیے دوڑو، دوڑو۔ تو ایک گروہ نے اس کی بات مان لی اور آرام کے ساتھ اندھیرے میں چل پڑے اور بچ کر نکل گئے اور ایک گروہ نے اسے جھٹلا دیا تو لشکر نے صبح صبح ان پر حملہ کیا اور انھیں تباہ و برباد کر دیا۔‘‘"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) {وَ لَا تَجْعَلُوْا مَعَ اللّٰهِ اِلٰهًا اٰخَرَ … :} یعنی صرف اللہ کی طرف رجوع کافی نہیں بلکہ اس کے سوا ہر معبود سے براء ت بھی ضروری ہے، اس لیے اس کے ساتھ کسی اور کو معبود مت بناؤ۔ تاکید کے لیے دوبارہ فرمایا کہ میں اس کی طرف سے تمھیں کھلا ڈرانے والا ہوں۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) {كَذٰلِكَ مَاۤ اَتَى الَّذِيْنَ مِنْ قَبْلِهِمْ مِّنْ رَّسُوْلٍ … :} اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو تسلی دیتے ہوئے فرمایا کہ یہ معاملہ آپ ہی کے ساتھ پیش نہیں آیا کہ توحید اور آخرت کی دعوت سن کر جھٹلایا گیا ہو اور جادوگر یا دیوانہ کہا گیا ہو، بلکہ آپ سے پہلے جس قوم کے پاس بھی کوئی رسول آیا اس کے جاہلوں نے یہی کہا کہ یہ جادوگر ہے یا دیوانہ ہے۔ وہ سب جب معجزوں کے سامنے لاجواب ہوتے تو انھیں جادو کہہ کر جھٹلا دیتے، جب رسول کے کلام کی بے پناہ تاثیر دیکھتے تو اسے جادوگر کہہ کر لوگوں کو اس سے دور رکھنے کی کوشش کرتے اور جب دیکھتے کہ اکیلا شخص پوری قوم کے خلاف توحید اور آخرت کی بات کر رہا ہے، نہ اپنے کسی دنیوی مفاد کی پروا کرتا ہے اور نہ ساری قوم کی مخالفت، استہزا اور اذیت رسانی کے باوجود اپنی دعوت سے باز آتا ہے تو اسے دیوانہ قرار دیتے۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ {اَتَوَاصَوْا بِهٖ:’’ تَوَاصٰي يَتَوَاصٰي تَوَاصِيًا ‘‘} باب تفاعل میں تشارک پایا جاتا ہے، ایک دوسرے کو وصیت کرنا۔ یعنی جب سب نے ایک ہی بات کہی تو سوال پیدا ہوتا ہے کہ کیا وہ سب ایک دوسرے کو اس بات کی وصیت کر گئے ہیں؟ ¤ ➋ {بَلْ هُمْ قَوْمٌ طَاغُوْنَ:} یعنی یہ تو ممکن نہیں کہ انھوں نے ایک دوسرے کو اس بات کی وصیت کی ہو، کیونکہ ان کے درمیان مدتوں کا فاصلہ ہے، علاقے بھی ایک نہیں، تو اصل بات یہ ہے کہ یہ سرکش لوگ ہیں، پہلے لوگ بھی سرکش تھے اور اپنی خواہشِ نفس پر کوئی پابندی قبول کرنے کے لیے تیار نہیں تھے۔ دونوں کی سرکشی ان کے لیے رسول کی اطاعت اور حق بات تسلیم کرنے کی راہ میں رکاوٹ بنی، اس لیے پچھلوں نے بھی وہی بات کہی جو ان کے پہلوں نے کہی۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) { فَتَوَلَّ عَنْهُمْ فَمَاۤ اَنْتَ بِمَلُوْمٍ:} یعنی جب وہ سرکشی پر اڑے ہوئے ہیں اور حق واضح ہونے کے باوجود اسے قبول کرنے پر تیار نہیں تو آپ کی ذمہ داری یہ نہیں کہ انھی کے پیچھے پڑے رہیں، بلکہ آپ ان سے کنارہ کشی اختیار کریں۔ آپ کا کام حق کا پیغام پہنچا دینا ہے، وہ آپ نے پہنچا دیا، اب اگر وہ اسے قبول نہیں کرتے تو آپ پر کوئی ملامت نہیں۔ دیکھیے سورۂ شوریٰ (۴۸) کی تفسیر۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) {وَ ذَكِّرْ فَاِنَّ الذِّكْرٰى تَنْفَعُ الْمُؤْمِنِيْنَ: ’’ذَكَّرَ يُذَكِّرُ تَذْكِرَةً‘‘} کا معنی نصیحت بھی ہے اور یاد دہانی بھی۔ یعنی سرکشوں سے منہ پھیرنے کا مطلب یہ نہیں کہ آپ انھیں یاد دہانی اور نصیحت کرنا بھی چھوڑ دیں، بلکہ آپ انھیں یاد دہانی اور نصیحت کرتے رہیں، کیونکہ نصیحت ایمان والوں کو نفع دیتی ہے اور چونکہ آپ کو معلوم نہیں کہ کون ہے جو ایمان لے آئے گا اور کون ہے جو اس سے محروم رہے گا، اس لیے آپ ایمان لانے والی سعید روحوں کی تلاش میں ہر نیک و بد، موافق و مخالف کو نصیحت جاری رکھیں، بالآخر وہ لوگ جن کی فطرت مسخ نہیں ہوئی، اس نصیحت سے فائدہ اٹھائیں گے، جیسا کہ فرمایا : «سَيَذَّكَّرُ مَنْ يَّخْشٰى (10) وَ يَتَجَنَّبُهَا الْاَشْقَى » [ الأعلٰی : ۱۰،۱۱ ] ’’عنقریب نصیحت حاصل کرے گا جو ڈرتا ہے۔ اور اس سے علیحدہ رہے گا جو سب سے بڑا بدنصیب ہے۔‘‘"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ { وَ مَا خَلَقْتُ الْجِنَّ وَ الْاِنْسَ اِلَّا لِيَعْبُدُوْنِ:} اس آیت میں بتایا کہ نصیحت کیا کرنی ہے اور کون سی بات یاد دلانی ہے۔ فرمایا انھیں یاد دلاؤ کہ میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا ہے کہ وہ میری عبادت کریں۔ ¤ ➋ عبادت کا معنی بندگی ہے۔ غلام کو عربی میں عبد اور فارسی میں بندہ کہتے ہیں۔ عبادت وہ تعلق ہے جو غلام کا اپنے مالک یا عبد کااپنے رب کے ساتھ ہوتا ہے۔ ¤ ➌ کائنات کی ہر چیز رب تعالیٰ کے حکم کی پابند ہے، کسی کی مجال نہیں کہ ذرہ برابر سرتابی کر سکے۔ وہ جب کسی چیز کا ارادہ کرتا ہے تو اسے {’’كُنْ‘‘} کہتا ہے اور وہ ہو جاتی ہے۔ اس ارادے کو ارادۂ کونیہ اور اس حکم کو تکوینی حکم کہتے ہیں، فرمایا : « اِنَّمَااَمْرُهٗۤ اِذَاۤ اَرَادَ شَيْـًٔا اَنْ يَّقُوْلَ لَهٗ كُنْ فَيَكُوْنُ » [ یٰسٓ : ۸۲ ] ’’اس کا حکم تو، جب وہ کسی چیز کا ارادہ کرتا ہے، اس کے سوا نہیں ہوتا کہ اسے کہتا ہے ’’ہو جا‘‘ تو وہ ہو جاتی ہے۔‘‘ ¤ ➍ اکثر معاملات میں انسان اور جن بھی اللہ تعالیٰ کے اس ارادۂ کونیہ اور تکوینی حکم کے اسی طرح پابند ہیں جس طرح دوسری تمام چیزیں، ان کی پیدائش، عمر، رزق، صحت، مرض اور ان کے اعضا کے افعال اور صلاحیتوں میں ان کی مرضی کا کچھ دخل نہیں۔ البتہ ان دونوں کو امتحان کے لیے اللہ تعالیٰ نے ایک حد تک اختیار عطا فرمایا ہے اور زندگی گزارنے کے لیے اپنے رسولوں کے ذریعے سے کچھ احکام دیے ہیں کہ میں تمھارا رب ہوں اور تم میرے بندے ہو، میں تمھارا مالک ہوں اور تم میرے غلام ہو، لہٰذا تم نے میری غلامی اور بندگی میں زندگی بسر کرنی ہے۔ اللہ تعالیٰ کے اس حکم کو حکم شرعی اور اس ارادے کو ارادۂ شرعیہ کہتے ہیں۔ انسان اس حکم کی تعمیل اور اس ارادے کو پورا بھی کر سکتا ہے اور اسے اس حکم کی نافرمانی اور اس ارادے کو پورا نہ کرنے کا بھی اختیار ہے۔ اسی اختیار پر اس سے باز پرس ہو گی اور وہ ثواب یا عذاب کا مستحق بنے گا، فرمایا : «الَّذِيْ خَلَقَ الْمَوْتَ وَ الْحَيٰوةَ لِيَبْلُوَكُمْ اَيُّكُمْ اَحْسَنُ عَمَلًا » [ الملک : ۲ ] ’’وہ جس نے موت اور زندگی کو پیدا کیا، تاکہ تمھیں آزمائے کہ تم میں سے کون عمل میں زیادہ اچھا ہے۔‘‘ اللہ تعالیٰ نے اس کی یاد دہانی کے لیے پیغمبر بھیجے اور فرمایا : « وَ مَا خَلَقْتُ الْجِنَّ وَ الْاِنْسَ اِلَّا لِيَعْبُدُوْنِ» ’’اور میں نے جنوں اور انسانوں کو پیدا نہیں کیا مگر اس لیے کہ وہ میری عبادت کریں۔‘‘ یعنی ان دونوں کو پیدا کرنے سے میرا مقصد اور ارادۂ شرعیہ یہی ہے کہ وہ میری عبادت اور میری بندگی و غلامی کریں اور اپنی پوری زندگی میرے احکام کے مطابق گزاریں۔ ¤ ➎ بعض لوگوں نے رکوع و سجود، قیام، ذکر، نماز، روزے ، زکوٰۃ اور حج وغیرہ ہی کو عبادت سمجھ رکھا ہے، بے شک یہ بھی عبادت ہیں، مگر صرف یہی عبادت نہیں، بلکہ اللہ تعالیٰ نے جو حکم بھی دیا ہے اس کی اطاعت کرنا عبادت ہے، کیونکہ بندگی اور عبادت کا مطلب ہی مالک کے حکم بلکہ اشارے پر چلنا ہے۔ جو مالک کا حکم نہ مانے وہ غلام کیسا اور جو اپنے رب کے حکم پر نہ چلے وہ عبد کیسا؟ جو شخص مسجد میں تو نماز پڑھتا ہے مگر گھر، بازار اور عدالت میں اپنی مرضی پر چلتا ہے وہ نہ رب کا بندہ ہے اور نہ اس کا عبد۔ ہاں اگر وہ ہر کام میں اس کے حکم پر چلتا ہے تو اس کا ہر کام عبادت ہے، حتیٰ کہ نماز ہی نہیں، اس کا کھانا پینا، سونا اور بیوی سے صحبت بھی عبادت ہے، کیونکہ رب کے حکم پر عمل کرتے ہوئے اس نے مالک کے منع کیے ہوئے حرام سے اجتناب کیا اور اپنی خواہش پوری کی تو اپنے مالک کے حکم پر چلتے ہوئے پوری کی، یہی بندگی اور یہی عبادت ہے۔ ¤ ➏ رب تعالیٰ کا اپنے بندوں سے سب سے پہلا تقاضا یہ ہے کہ وہ اس اکیلے کو اپنا رب اور مالک مانیں، اس کے ساتھ کسی اور کو شریک نہ کریں۔ اس لیے عبد اللہ بن عباس رضی اللہ عنھما نے سورۂ بقرہ کی آیت (۲۱) : « يٰۤاَيُّهَا النَّاسُ اعْبُدُوْا رَبَّكُمُ» کی تفسیر فرمائی : {’’أَيْ وَحِّدُوْا رَبَّكُمْ‘‘} ’’یعنی اپنے رب کو ایک مانو۔‘‘ (طبری بسند حسن) اور اللہ تعالیٰ نے فرمایا : « وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ » [ الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔‘‘"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) { مَاۤ اُرِيْدُ مِنْهُمْ مِّنْ رِّزْقٍ …:} یہ کلام انسان کی عام عادت کے مطابق کیا گیا ہے، کیونکہ انسان جو کچھ بناتا ہے اپنے کسی فائدے کے لیے بناتا ہے اور جو غلام خریدتا اور اپنی ملکیت میں رکھتا ہے اس سے مقصد اپنی ضروریات کے لیے ان سے کام لینا اور ان کی کمائی کھانا ہوتا ہے۔ فرمایا جن و انس سے نہ میں کسی طرح کا رزق چاہتا ہوں اور نہ میرا یہ مقصد ہے کہ وہ مجھے کھانے کو کچھ دیں۔ ان کے پیدا کرنے سے میرا اپنا کوئی نفع مقصود نہیں، میں تو صرف یہ چاہتا ہوں کہ وہ میری بندگی کریں، میرے غلام بن کر رہیں اور اس میں انھی کا فائدہ ہے۔ آیت میں اپنے لیے پہلے رزق کی نفی کی جس میں انسان کی ہر ضرورت آتی ہے، اس کے بعد رزق میں سے انسان کے لیے سب سے ضروری چیز کھانے کی نفی فرمائی۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) ➊ { اِنَّ اللّٰهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِيْنُ: ’’ هُوَ ‘‘} ضمیر فصل لانے سے اور {’’ الرَّزَّاقُ ‘‘} خبر پر ’’الف لام‘‘ لانے سے کلام میں حصر پیدا ہو گیا کہ رزاق صرف اللہ تعالیٰ ہے، اور کوئی نہیں۔ {’’ الرَّزَّاقُ ‘‘} مبالغے کا صیغہ ہے، بے حد رزق دینے والا۔ {’’ اِنَّ ‘‘} تعلیل (علت بیان کرنے) کے لیے ہوتا ہے، اس میں پچھلی بات کی علت بیان فرمائی۔ یعنی میں نہ جن و انس سے کسی طرح کا رزق چاہتا ہوں اور نہ یہ چاہتا ہوں کہ وہ مجھے کھلائیں، کیونکہ رزق دینے والا تو صرف میں ہوں، میرے سوا کوئی رزق دینے والا ہے ہی نہیں اور میں کھانے پینے اور ہر ضرورت سے غنی ہوں، تو میں جن و انس سے رزق کا یا کھلانے کا ارادہ کیوں کروں گا؟ دوسری جگہ فرمایا : «قُلْ اَغَيْرَ اللّٰهِ اَتَّخِذُ وَلِيًّا فَاطِرِ السَّمٰوٰتِ وَ الْاَرْضِ وَ هُوَ يُطْعِمُ وَ لَا يُطْعَمُ » [الأنعام : ۱۴ ] ’’کہہ دے کیا میں اللہ کے سوا کوئی مالک بناؤں جو آسمانوں اور زمین کو پیدا کرنے والا ہے، حالانکہ وہ کھلاتا ہے اور اسے نہیں کھلایا جاتا۔‘‘ ¤ ➋ سیاق کا تقاضا یہ تھا کہ کہا جاتا : {’’إِنِّيْ أَنَا الرَّزَّاقُ ذُوالْقُوَّةِ الْمَتِيْنُ‘‘} کہ (نہ میں ان سے کسی رزق کا ارادہ کرتا ہوں اور نہ یہ ارادہ رکھتا ہوں کہ وہ مجھے کھلائیں) کیونکہ میں ہی تو بے حد رزق دینے والا، طاقت والا، نہایت مضبوط ہوں۔ رسول اللہ صلی اللہ علیہ وسلم سے اس طرح پڑھنا بھی ثابت ہے، چنانچہ عبداللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے اس طرح پڑھایا : [ إِنِّيْ أَنَا الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِيْنُ ] [ أبو داوٗد، الحروف والقرائات ، باب : ۳۹۹۳۔ ترمذي : ۲۹۴۰، و صححہ الألباني ] مصحف امام میں {’’ اِنَّ اللّٰهَ هُوَ الرَّزَّاقُ ‘‘} ہے اور متواتر قراء ت یہی ہے۔ {’’إِنِّيْ أَنَا الرَّزَّاقُ‘‘} کے بجائے {’’ اِنَّ اللّٰهَ هُوَ الرَّزَّاقُ ‘‘} کہنے میں لفظ {’’ اللّٰهَ ‘‘} میں آنے والی تمام صفات، مثلاً اس کے جلال، اس کی کبریائی اور عظمت کا اظہار مقصود ہے۔ ¤ ➌ { ذُو الْقُوَّةِ الْمَتِيْنُ: ’’ ذُو الْقُوَّةِ ‘‘ ’’ ذُو ‘‘} کا لفظ کسی اہم چیز کا مالک ہونے کے لیے آتا ہے، مثلاً {’’ذُوْ مَالٍ‘‘} اور {’’ ذُوْ شَرَفٍ‘‘} یعنی ساری قوت کا مالک۔ {’’ الْمَتِيْنُ ‘‘} نہایت مضبوط۔ جسے کوئی نہ اس کے ارادے سے ہٹا سکتا ہے اور نہ اس کا مقابلہ کر سکتا ہے۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) ➊ {فَاِنَّ لِلَّذِيْنَ ظَلَمُوْا ذَنُوْبًا … : ’’ ذَنُوْبًا ‘‘} (ذال کے فتحہ کے ساتھ) اصل میں بڑے ڈول کو کہتے ہیں اور {’’ذُنُوْبٌ‘‘} (ذال کے ضمہ کے ساتھ) {’’ذَنْبٌ‘‘} کی جمع ہے، گناہ۔ پہلے لوگ ایک ہی کنوئیں سے پانی لینے کے لیے آتے تو ہر ایک اپنا ڈول ساتھ لاتا تھا، پھر باری باری اپنا ڈول ڈالتے اور پانی بھر کر لے جاتے، اس لیے {’’ذَنُوْبٌ‘‘} (ڈول) کا لفظ باری کے معنی میں استعمال ہونے لگا۔ سورت کے آخر میں کفار قریش کے متعلق فرمایا کہ جس طرح ان سے پہلے ان کے ساتھیوں پر عذاب باری باری آیا اسی طرح ان مشرکین پر عذاب کی نوبت (باری) بھی آ رہی ہے جنھوں نے ظلم کیا۔ ظلم سے مراد اللہ کے ساتھ شرک ہے۔ باری آنے میں کچھ انتظار کرنا پڑتا ہے۔ ¤ ➋ { فَلَا يَسْتَعْجِلُوْنِ:} یہ اصل میں {’’ فَلَا يَسْتَعْجِلُوْنِيْ‘‘} تھا، ’’یاء‘‘ حذف ہو گئی، نون وقایہ پر کسرہ یہ بتانے کے لیے باقی رہا کہ یہاں سے ’’یاء‘‘ حذف ہوئی ہے۔ سو وہ مجھ سے عذاب جلدی لانے کا مطالبہ نہ کریں، باری آنے پر ان کا یہ مطالبہ بھی پورا ہو جائے گا۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) {فَوَيْلٌ لِّلَّذِيْنَ كَفَرُوْا … : ’’ فَوَيْلٌ ‘‘} پر تنوین تہویل کے لیے ہے، اس لیے ترجمہ ’’بڑی ہلاکت‘‘ کیا گیا ہے۔ ’’جس دن کا وہ وعدہ دیے جاتے ہیں‘‘ سے مراد قیامت کا دن ہے، جس کا سورت کے شروع میں ذکر ہے، فرمایا : « اِنَّمَا تُوْعَدُوْنَ لَصَادِقٌ (5) وَّ اِنَّ الدِّيْنَ لَوَاقِعٌ » [ الذاریات : ۵، ۶ ] ’’کہ بلاشبہ جو تم سے وعدہ کیا جاتا ہے یقینا سچا ہے۔ اور بلاشبہ جزا یقینا واقع ہونے والی ہے ۔‘‘ سورۂ معارج میں قبروں سے نکلنے کے دن کے متعلق فرمایا : « ذٰلِكَ الْيَوْمُ الَّذِيْ كَانُوْا يُوْعَدُوْنَ » [ المعارج : ۴۴ ] ’’یہی وہ دن ہے جس کا ان سے وعدہ کیا جاتا تھا۔‘‘"
    }
  ]
}