{
  "surah": "Ar-Rahmaan",
  "surah_number": 55,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "اس سورت کی فضیلت میں ایک حدیث مشہور ہے : [ لِكُلِّ شَيْءٍ عَرُوْسٌ وَ عَرُوْسُ الْقُرْآنِ الرَّحْمٰنُ ] ’’ہر چیز کا ایک دولہا ہوتا ہے اور قرآن کا دولہا سورۂ رحمن ہے۔‘‘ (عروس کا معنی دولہا بھی ہے اور دلہن بھی) سیوطی نے اسے {’’ اَلْجَامِعُ الصَّغِيْرُ ‘‘} میں {’’ شُعَبُ الْإِيْمَانِ لِلْبَيْهَقِيْ ‘‘} کے حوالے سے علی رضی اللہ عنہ سے روایت کیا ہے۔علامہ البانی نے اسے ضعیف لکھا ہے۔ دیکھیے ضعیف الجامع (۴۷۲۹)۔ ¤ (آیت 2،1) ➊ {اَلرَّحْمٰنُ( 1) عَلَّمَ الْقُرْاٰنَ:} اس سورت کا آغاز اللہ کے مبارک نام {’’ اَلرَّحْمٰنُ ‘‘} کے ساتھ ہوا ہے اور پوری سورت اس کی بے حد و بے حساب رحمت کی تفصیل ہے۔ اس میں اللہ تعالیٰ نے اپنی ہر ہر نعمت کا ذکر کر کے بار بار اپنا احسان یاد دلایا ہے۔ ان نعمتوں میں وہ نعمتیں بھی ہیں جو دنیا میں تمام لوگوں پر کی گئی ہیں اور وہ بھی جو صرف ایمان والوں پر ہیں۔ ان میں سے سب سے بڑی نعمت دین کا ذکر سب سے پہلے فرمایا ہے، کیونکہ دنیا و آخرت دونوں میں کامیابی اسی پر موقوف ہے اور دین کا مدار قرآن مجید پر ہے، اس لیے فرمایا : «اَلرَّحْمٰنُ (1) عَلَّمَ الْقُرْاٰنَ » ’’اس بے حد رحم والے نے۔ یہ قرآن سکھایا۔‘‘ ¤ ➋ {’’ اَلرَّحْمٰنُ (1) عَلَّمَ الْقُرْاٰنَ ‘‘} میں نعمت کے بیان کے ساتھ کفار کے اس بہتان کا ردّ بھی ہے کہ « اِنَّمَا يُعَلِّمُهٗ بَشَرٌ » [ النحل : ۱۰۳ ] یعنی آپ( صلی اللہ علیہ وسلم ) کو کوئی بشر ہی سکھاتا ہے۔ فرمایا، آپ کو سکھلانے والا کوئی بشر یا کوئی اور ہستی نہیں، بلکہ وہ رحمن ہی ہے جس نے آپ کو قرآن سکھایا۔ ابنِ عاشور نے اس کی وضاحت اس طرح فرمائی ہے کہ مسند کو فعل کی صورت میں مسند الیہ کے بعد تخصیص کا فائدہ دینے کے لیے لایا گیا ہے۔ کیونکہ کفار کا کہنا تھا کہ قرآن کسی اور نے آپ کو سکھایا ہے، گویا وہ یہ مان گئے کہ یہ آپ نے خود نہیں بنایا بلکہ کسی اور نے آپ کو سکھایا ہے، مگر وہ یہ نہیں مانتے تھے کہ آپ کو قرآن سکھانے والا اللہ تعالیٰ ہے، اس لیے فرمایا : ’’اس رحمان ہی نے (آپ کو) یہ قرآن سکھایا ہے۔‘‘ {’’ عَلَّمَ الْقُرْاٰنَ ‘‘ ’’ اَلرَّحْمٰنُ ‘‘} مبتدا کی پہلی خبر ہے، اس کے بعد مسلسل تین خبریں ہیں جو حرفِ عطف کے بغیر لائی گئی ہیں۔ ان نعمتوں کے اس انداز میں ذکر کرنے سے جہاں ان نعمتوں کا اظہار ہو رہا ہے وہاں یہ بات بھی واضح ہو رہی ہے کہ یہ نعمتیں رحمان ہی نے عطا کی ہیں، انھیں عطا کرنے میں کسی اور کا نہ کوئی دخل ہے نہ کسی قسم کی شرکت ہے۔ مشرکین یہاں تک تو مانتے تھے، مگر اس سے لازم آنے والی بات ماننے کے لیے تیار نہیں تھے کہ جب یہ سب نعمتیں رحمان ہی کی ہیں تو عبادت بھی اسی کی ہے۔ گویا نعمتوں کے شمار کرنے میں مشرکین کو ان کی غلطی پر تنبیہ اور اکیلے اللہ تعالیٰ کی عبادت کی طرف توجہ دلانا مقصود ہے۔ ¤ ➌ {’’ عَلَّمَ الْقُرْاٰنَ ‘‘} میں {’’ عَلَّمَ ‘‘} کا ایک مفعول {’’ الْقُرْاٰنَ ‘‘} ذکر فرمایا ہے کہ اس رحمن نے یہ قرآن سکھایا، دوسرا مفعول ذکر نہیں فرمایا کہ کسے سکھایا؟ یہ حذف فرما دیا ہے، تاکہ عام رہے۔ بعض مفسرین نے فرمایا، اس محذوف سے مراد نبی کریم صلی اللہ علیہ وسلم ہی ہیں، مگر بہتر ہے کہ اسے عام رکھا جائے۔ اس میں شبہ نہیں کہ اللہ تعالیٰ نے سب سے پہلے نبی کریم صلی اللہ علیہ وسلم کو قرآن کی تعلیم دی، مگر ظاہر ہے کہ آپ کے واسطے سے اور بعد میں قرآن کے معلّمین کے واسطے سے تمام لوگوں کو قرآن کی تعلیم دینے والی اصل ذات گرامی اللہ تعالیٰ کی ہے، وہ تعلیم نہ دے تو نہ نبی صلی اللہ علیہ وسلم تعلیم دے سکتے ہیں، نہ صحابہ اور نہ ہی بعد کا کوئی معلم۔ اس لیے تعلیمِ قرآن کو خاص اللہ تعالیٰ کی نعمت کے طور پر ذکر فرمایا ہے۔ ¤ ➍ اکثر مفسرین نے چونکہ یہاں {’’ الْقُرْاٰنَ ‘‘} سے مراد رسول کریم صلی اللہ علیہ وسلم پر نازل شدہ قرآن کریم لیا ہے، اس لیے اوپر تفسیر اس کے مطابق کی گئی ہے۔ آیت کے الفاظ میں ایک اور تفسیر کی بھی گنجائش ہے، وہ یہ کہ {’’ الْقُرْاٰنَ ‘‘} کا لفظی معنی {’’قِرَاءَةٌ‘‘} (پڑھنا) ہے، جیسا کہ سورۂ قیامہ (۱۸) میں فرمایا : « فَاِذَا قَرَاْنٰهُ فَاتَّبِعْ قُرْاٰنَهٗ » ’’تو جب ہم اسے پڑھیں تو تو اس کے پڑھنے کی پیروی کر۔‘‘ اس تفسیر کے مطابق اللہ تعالیٰ انسان کو پڑھنے کی تعلیم کی نعمت یاد دلا رہے ہیں ، یعنی {’’ اَلرَّحْمٰنُ (1) عَلَّمَ الْقُرْاٰنَ ‘‘} کا معنی ہے:’’اس رحمن ہی نے پڑھنا سکھایا۔‘‘ یاد رہے کہ رسول اللہ صلی اللہ علیہ وسلم پر نازل ہونے والی سب سے پہلی وحی میں لکھنے کی تعلیم کی نعمت کا ذکر خاص طور پر فرمایا تھا، فرمایا : « اِقْرَاْ وَ رَبُّكَ الْاَكْرَمُ (3) الَّذِيْ عَلَّمَ بِالْقَلَمِ» [ العلق :۳،۴] ’’پڑھ اور تیرا رب ہی سب سے زیادہ کرم والا ہے۔ وہ جس نے قلم کے ساتھ سکھایا۔‘‘ تو سورۂ رحمن میں پڑھنے کی تعلیم کی نعمت کا ذکر فرمایا۔ اس تفسیر کے مطابق یہ نعمت مزید عام ہو جاتی ہے، جس میں قرآن کا پڑھنا بھی شامل ہے۔ حقیقت یہ ہے کہ لکھنا، پڑھنا اور بیان تینوں انسان پر اللہ تعالیٰ کی ان عظیم نعمتوں میں سے ہیں جو اسے جانوروں سے ممتاز کرتی ہیں۔ انھی کے ذریعے سے وہ دور و نزدیک دوسرے انسانوں سے رابطہ کرتا ہے، وحی الٰہی سے حاصل ہونے والے علوم کو اور انسانی عقل اور تجربے سے حاصل ہونے والے علوم و فنون کو سیکھتا سکھاتا ہے، لکھ کر محفوظ کرتا ہے اور آنے والی نسلوں کو پہنچاتا ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": ""
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {خَلَقَ الْاِنْسَانَ:} یہ بھی لفظ {’’ اَلرَّحْمٰنُ ‘‘} کی خبر ہے اور اسے فعل کی صورت میں لانے سے تخصیص کا فائدہ حاصل ہو رہا ہے۔ چنانچہ اس آیت میں بھی دو باتیں بیان ہوئی ہیں، ایک یہ کہ رحمان ہی نے انسان کو پیدا کیا ہے، سو عبادت بھی اس اکیلے کی ہے۔ دوسری انسان کو پیدا کرنے کی نعمت کا بیان ہے۔ زمین و آسمان میں موجود دوسری تمام نعمتوں کا ذکر اس کے بعد فرمایا ہے، کیونکہ وہ سب انسان کی پیدائش کے بعد ہیں، اگر وہ موجود ہی نہ ہو تو کسی نعمت کا اسے کیا فائدہ۔ البتہ تعلیم قرآن کی نعمت کا ذکر اس کی اہمیت کی طرف توجہ دلانے کے لیے اس سے بھی پہلے فرما دیا۔ ’’رحمن ہی نے انسان کو پیدا فرمایا‘‘ یہ ایسی بات نہیں جسے مشرکین نہ مانتے ہوں، مگر اسے صریح لفظوں میں کہنے کا مطلب یہ ہے کہ مشرکین فی الحقیقت یہ بات نہیں مانتے، کیونکہ اگر مانتے ہوتے تو کسی غیر کی پرستش کیوں کرتے؟"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {عَلَّمَهُ الْبَيَانَ:} سکھانے میں بہت سی چیزیں شامل ہیں، یعنی اس میں بیان کی صلاحیت رکھی، اسے اپنے مطلب کے اظہار کے لیے مختلف زبانوں کے الفاظ وضع کرنے اور ان کے استعمال کا سلیقہ بخشا، جس سے ہزاروں زبانیں وجود میں آئیں اور اسے قدرت دی کہ اپنا ما فی الضمیرنہایت وضاحت اور حسن و خوبی کے ساتھ ادا کر سکے اور دوسروں کی بات سمجھ سکے۔ اپنی اس صفت کی بدولت وہ خیر و شر، ہدایت و ضلالت، ایمان و کفر اور دنیا و آخرت کی باتیں سمجھتا اور سمجھاتا ہے اور اس کو کام میں لا کر فائدہ اٹھاتا ہے۔ مزید دیکھیے سورۂ بقرہ کی آیت (۳۱) : « وَ عَلَّمَ اٰدَمَ الْاَسْمَآءَ كُلَّهَا» اور سورۂ روم کی آیت (۲۲): « وَ اخْتِلَافُ اَلْسِنَتِكُمْ وَ اَلْوَانِكُمْ » کی تفسیر۔ یہ جملہ بھی لفظ{ ’’ اَلرَّحْمٰنُ ‘‘} کی خبر ہے اور فعل کی صورت میں آنے سے اس میں بھی پچھلے جملوں کی طرح تخصیص پیدا ہو رہی ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) { اَلشَّمْسُ وَ الْقَمَرُ بِحُسْبَانٍ: ’’حُسْبَانٌ‘‘ ’’حَسِبَ يَحْسِبُ‘‘} کا مصدر ہے، جس میں ’’الف نون‘‘ زیادہ کر دیا گیا ہے، جس سے معنی میں اضافہ ہو گیا ہے، جیسے {’’طُغْيَانٌ‘‘ ’’رُجْحَانٌ‘‘} اور {’’كُفْرَانٌ‘‘} وغیرہ میں ہے۔ یعنی سورج اور چاند نہایت محکم اور باریک حساب کے ساتھ چل رہے ہیں، آسمان کے نیچے ثوابت و سیار ستاروں کا کوئی شمار نہیں، جن میں سے بعض سورج اور چاند سے بھی ہزاروں گنا بڑے ہیں۔ ان کی پیدائش اور گردش میں اللہ تعالیٰ کی بے حساب حکمتوں کا بھی کچھ شمار نہیں، مگر خاص طور پر سورج اور چاند کا ذکر اس لیے فرمایا کہ نمایاں نظر آنے کی وجہ سے زمین کے رہنے والوں کے معاملات کا ان دونوں کے ساتھ زیادہ تعلق ہے۔ مفسر کیلانی لکھتے ہیں: ’’سورج اور چاند کا ایک مقررہ رفتار کے مطابق چلنا، پھر اس میں ایک لحظہ کی بھی تاخیر نہ ہونا انسان کے لیے ایک بہت بڑی نعمت ہے۔ سورج سے دن رات ادل بدل کر آتے رہتے ہیں اور موسموں میں بتدریج تبدیلی ہوتی رہتی ہے۔ نمازوں کے اوقات کا تعلق بھی سورج سے ہے، فصلوں کے پکنے کا انحصار بھی سورج سے ہے۔ چاند سے ہمیں رات کو روشنی حاصل ہوتی ہے، ہم مہینوں اور سالوں کا حساب رکھ سکتے ہیں اور یہی حقیقی اور فطری تقویم (کیلنڈر) ہے۔ اسی لیے رمضان کے روزے، حج، عیدین اور دوسری قابلِ شمار مدتوں، مثلاً مدتِ حمل، مدتِ رضاعت و عدت وغیرہ کا تعلق چاند سے ہوتا ہے۔ پھر سورج اور زمین کے درمیان ایسا مناسب فاصلہ رکھا گیا ہے کہ اس میں کمی بیشی سے اس زمین پر انسان اور دوسرے سب جانداروں کی زندگی ہی ناممکن ہے اور سب فائدے اسی صورت میں حاصل ہو رہے ہیں کہ اللہ تعالیٰ نے ان عظیم الجثہ کروں کو ایسے طبعی قوانین میں جکڑ رکھا ہے جس سے وہ ادھر ادھر ہو ہی نہیں سکتے اور اپنے مقرر مداروں پر مقررہ رفتار سے ہمہ وقت محو گردش رہتے ہیں۔‘‘( تیسیر القرآن) مزید دیکھیے سورۂ انعام (۹۶) اور سورۂ بنی اسرائیل (۱۲)۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) { وَ النَّجْمُ وَ الشَّجَرُ يَسْجُدٰنِ:’’ النَّجْمُ ‘‘} کا معنی ستارا بھی ہے اور وہ پودے بھی جو تنے کے بغیر ہوتے ہیں، جیسے گندم، جو، چنے، جڑی بوٹیاں، بیلیں، سبزیاں وغیرہ۔ یہاں دوسرا معنی زیادہ مناسبت رکھتا ہے، کیونکہ یہ {’’ الشَّجَرُ ‘‘} کے مقابلے میں آیا ہے۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما سے یہی معنی نقل فرمایا اور اسے ترجیح دی ہے۔ ان کے سجدہ کرنے کی تفسیر کے لیے دیکھیے سورۂ حج (۱۸)۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {وَ السَّمَآءَ رَفَعَهَا:} یہاں بھی {’’ رَفَعَ السَّمَاءَ‘‘} کے بجائے {’’ وَ السَّمَآءَ رَفَعَهَا ‘‘} میں آسمان کو پہلے لا کر اس کی اہمیت کی طرف اور اس بات کی طرف توجہ دلائی ہے کہ اسے بلند کرنا اس اکیلے کا کام ہے، کسی اور کا اس میں کوئی دخل نہیں، پھر کسی اور کی پرستش کیوں ہو؟ آسمان کو اونچا اٹھانے میں اس کے پیدا کرنے کا ذکر خود بخود آ گیا۔ اونچا اٹھانے کا ذکر خاص طور پر اس لیے فرمایا کہ اتنے بڑے آسمان کو اس طرح ستونوں کے بغیر پیدا کرنا اور اسے اتنا بلند بنانا بے حد تعجب انگیز ہے کہ اس کے نیچے سورج، چاند اور ان سے ہزاروں گنا بڑے سیاروں پر مشتمل کہکشائیں محوِ گردش ہیں، نہ انھیں راستے میں کسی ستون کی رکاوٹ پیش آتی ہے، نہ ہزاروں نوری سالوں کے فاصلے سے ان کی روشنی زمین پر آنے کے درمیان کوئی چیز حائل ہوتی ہے۔ ¤ ➋ { وَ وَضَعَ الْمِيْزَانَ: ’’ الْمِيْزَانَ ‘‘ ’’وَزَنَ‘‘} سے {’’مِفْعَالٌ‘‘} کے وزن پر ہے جو اصل میں {’’مِوْزَانٌ‘‘} ہے، وزن کا آلہ۔ ’’وزن‘‘ چیزوں کے ایک دوسرے کے مقابلے میں برابر یا کم و بیش ہونے کے اندازے کا نام ہے۔ اللہ تعالیٰ کی نعمتوں میں سے ایک بہت بڑی نعمت یہ ہے کہ اس نے انسان کو ہر چیز کی مقدار معلوم کرنے کے لیے میزان کا طریقہ سکھایا۔ اس میزان میں ہر قسم کے پیمانے آ جاتے ہیں، وزن، کیل، مساحت، حرارت، برودت، دباؤ، نمی، غرض ہزارہا قسم کے پیمانے بنانے کا سلیقہ عطا فرمایا، جن سے وہ اپنے معاملات درست اور بہتر سے بہتر طریقے کے ساتھ چلاتا ہے۔ اس کے بغیر کوئی کام بھی درست انجام نہیں پا سکتا، پھر انھی پیمانوں کے ساتھ وہ ایک دوسرے سے لین دین کرتا ہے۔ اگر یہ نہ ہوتے تو دلی اطمینان کے ساتھ باہمی لین دین ممکن نہیں تھا۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { اَلَّا تَطْغَوْا فِي الْمِيْزَانِ:} اس سے پہلے ’’لام‘‘ جارہ محذوف ہے : {’’أَيْ لِئَلَّا تَطْغَوْا‘‘} یعنی اس نے میزان اس لیے بنایا ہے کہ تم ہر معاملے میں وزن کرتے ہوئے صحیح وزن کرو، کمی بیشی مت کرو، کیونکہ یہ حد سے تجاوز ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {وَ اَقِيْمُوا الْوَزْنَ بِالْقِسْطِ … : ’’ اَلْقِسْطُ‘‘} عدل، انصاف۔ ان آیات میں {’’ الْمِيْزَانَ ‘‘} کا لفظ تین دفعہ آیا ہے، پہلا آلہ (ترازو) کے معنی میں ہے، دوسرا مصدر (وزن) کے معنی میں اور تیسرا اسم مفعول ({مَوْزُوْنٌ}) کے معنی میں۔ (ابن عادل، اللباب) اس سے ماپ تول اور دوسرے پیمانوں میں انصاف کی تاکید مقصود ہے۔ اللہ تعالیٰ نے شعیب علیہ السلام کی قوم پر عذاب کا ایک بہت بڑا باعث ماپ تول میں کمی بیشی کو قرار دیا ہے اور قرآن مجید کی ایک سورت کا نام ’’مطففين‘‘ ہے جس میں کمی بیشی کرنے والوں کے لیے ’’ویل‘‘ کی وعید سنائی ہے۔ ¤ ➋ بہت سے مفسرین نے فرمایا کہ {’’ وَ وَضَعَ الْمِيْزَانَ ‘‘} میں {’’ وَ اَقِيْمُوا الْوَزْنَ ‘‘} سے مراد عدل ہے، جس کی ایک شاخ ماپ تول میں عدل ہے۔ اس لیے {’’ وَ وَضَعَ الْمِيْزَانَ ‘‘} میں عام عدل کا ذکر ہے اور ماپ تول کی اہمیت کے پیش نظر {’’ اَقِيْمُوا الْوَزْنَ ‘‘} (تول سیدھا رکھو) میں عدل کی صورتوں میں وزن کا خاص طور پر الگ ذکر فرمایا ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) { وَ الْاَرْضَ وَ ضَعَهَا لِلْاَنَامِ: ’’ اَلْأَنَامُ‘‘} کا معنی ہر جاندار مخلوق ہے، یعنی اللہ تعالیٰ نے زمین کو اس طرح بنایا اور بچھایا ہے کہ مخلوق کی تمام ضروریات اس سے پوری ہوتی ہیں، ان کا پیدا ہونا، کھاناپینا، پہننا، رہنا سہنا، چلنا پھرنا، زندہ رہنا اور دفن ہونا غرض ہر ضرورت اور ہر سہولت اسی سے وابستہ ہے۔{’’ اَلْأَنَامُ‘‘} کے لفظ میں اگرچہ تمام مخلوق شامل ہے، مگر یہاں اس سے مراد جن و انس ہیں، کیونکہ محاسبہ انھی دو کا ہونا ہے اور آگے انھی پر احسانات کا ذکر ہے۔ دوسری جگہ اللہ تعالیٰ نے فرمایا کہ اس نے زمین کی ہر چیز انسانوں کی خاطر بنائی ہے، فرمایا : «هُوَ الَّذِيْ خَلَقَ لَكُمْ مَّا فِي الْاَرْضِ جَمِيْعًا » [ البقرۃ:۲۹] ’’ وہی ہے جس نے زمین میں جو کچھ ہے سب تمھارے لیے پیدا کیا۔‘‘ اور فرمایا : « وَ سَخَّرَ لَكُمْ مَّا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ جَمِيْعًا » [ الجاثیۃ : ۱۳ ] ’’ اور اس نے تمھاری خاطر ان تمام چیزوں کو مسخر کر دیا جو آسمانوں میں ہیں اور جو زمین میں ہیں۔‘‘ زمین کو انسان کے لیے بنانے اور بچھانے کے متعلق دیکھیے سورۂ رعد (۳)، نمل (۶۰، ۶۱)، یٰس (۳۳ تا ۳۵)، حم السجدہ (۹، ۱۰)، زخرف (۹، ۱۰)، جاثیہ (4،3)، ق (8،7)، ملک (۱۵)، مرسلات (26،25)، نبا (۶) اور سورۂ نازعات (۳۰ تا ۳۳)۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) { فِيْهَا فَاكِهَةٌ وَّ النَّخْلُ ذَاتُ الْاَكْمَامِ: ’’ فَاكِهَةٌ ‘‘} ان پھلوں اور چیزوں کا نام ہے جو بطورِ خوراک نہیں بلکہ لذت اور خوشی کے لیے کھائی جاتی ہیں۔ یہ {’’فَكِهَ يَفْكَهُ‘‘} ({فَرِحَ يَفْرَحُ}) سے مشتق ہے، جس کا معنی باتوں اور ہنسی وغیرہ کے ساتھ خوش وقت ہونا ہے۔ {’’ فَاكِهَةٌ ‘‘} پر تنوین تکثیر و تعظیم کے اظہار کے لیے ہے۔ {’’ النَّخْلُ ‘‘} کھجور کے درخت، یہ اسم جنس ہے، ایک درخت کہنا ہو تو {’’نَخْلَةٌ‘‘} کہتے ہیں۔ {’’ الْاَكْمَامِ ‘‘ ’’كِمٌّ‘‘} (کاف پر کسرہ) کی جمع ہے، کھجور کے خوشے کے اوپر والا غلاف۔ یہ غلاف کھایا نہیں جاتا، اس لیے مراد خوشوں کے حسن کا بیان ہے۔ اللہ تعالیٰ نے درختوں کے اوپر اور درختوں سے اترنے کے بعد بھی پھلوں کی جس طرح پیکنگ کی ہے ان میں سے ہر ایک اپنی جگہ اللہ تعالیٰ کی عظیم صناعی کا نمونہ ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) {وَ الْحَبُّ ذُو الْعَصْفِ وَ الرَّيْحَانُ: ’’ الْحَبُّ ‘‘} دانے، جیسے گندم، چنے، چاول وغیرہ،یعنی غلّہ جو انسان کی خوراک بنتا ہے۔ {’’ الْعَصْفِ ‘‘} دانوں کے اوپر کا چھلکا، بھوسا، جو جانوروں کی خوراک بنتا ہے، سورۂ فیل میں ہے : « فَجَعَلَهُمْ كَعَصْفٍ مَّاْكُوْلٍ» [ الفیل : ۵ ] ’’کھائے ہوئے بھوسے کی طرح۔‘‘ {’’ الرَّيْحَانُ ‘‘} خوشبودار پودے اور پھول جو آدمی کے دماغ کو معطر کرتے ہیں۔ {’’ فَاكِهَةٌ ‘‘} سے وہ پھل مراد ہیں جو صرف لذت کے لیے کھائے جاتے ہیں اور {’’ النَّخْلُ ‘‘} سے وہ پھل مراد ہیں جو لذت اور خوراک دونوں کے لیے استعمال ہوتے ہیں اور {’’ الْحَبُّ ‘‘} سے مراد غلے وغیرہ ہیں جو خوراک کے لیے استعمال ہوتے ہیں اور {’’ الرَّيْحَانُ ‘‘} سے مراد جو خوشبو کے لیے استعمال ہوتے ہیں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ {فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ:’’ اٰلَآءِ ‘‘ ’’إِلًي‘‘} کی جمع ہے جو اصل میں {’’إِلَيٌ‘‘} ہے، جیسے {’’مِعًي‘‘} (انتڑی) کی جمع {’’ أَمْعَاءٌ ‘‘} ہے۔ اس کا ایک معنی نعمت ہے۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کی تفسیر نقل فرمائی ہے : {’’فَبِأَيِّ نِعْمَةِ اللّٰهِ تُكَذِّبَانِ‘‘} ’’تم دونوں اللہ تعالیٰ کی کس کس نعمت کو جھٹلاؤ گے؟‘‘ اور ایک معنی قدرت ہے، چنانچہ طبری ہی نے ابنِ زید کی تفسیر نقل فرمائی ہے، انھوں نے فرمایا : {’’ اَلْآلَاءُ اَلْقُدْرَةُ، فَبِأَيِّ قُدْرَةِ اللّٰهِ تُكَذِّبَانِ‘‘} یعنی ’’تم دونوں اللہ کی کس کس قدرت کو جھٹلاؤ گے؟‘‘ ¤ ➋ مفسر سلیمان الجمل نے فرمایا ، نعمتوں کے بیان اور ان کی یاد دہانی کے لیے یہ آیت یہاں اکتیس (۳۱) مرتبہ دہرائی گئی ہے۔ یہ ایسے ہی ہے جیسے کسی آدمی نے کسی پر احسان کیے ہوں اور وہ ان احسانوں کو نہ مانتا ہو تو اسے کہتا ہے، کیا تو فقیر نہیں تھا؟ میں نے تجھے مال دیا، کیا تو اس کا انکار کرتا ہے؟ کیا تو ننگا نہیں تھا؟ میں نے تمھیں لباس پہنایا، کیا تو اس کا انکار کرتا ہے…؟ اللہ تعالیٰ نے آٹھ مرتبہ یہ آیت ان آیات کے بعد دہرائی جن میں اس کی مخلوق کے عجائب اور ان کی ابتدا و انتہا کا ذکر ہے، پھر جہنم کے دروازوں کی تعداد کے مطابق سات مرتبہ ان آیات کے بعد دہرائی ہے جن میں آگ اور اس کی ہولناکیوں کا بیان ہے۔ پھر جنت کے دروازوں کی تعداد کے مطابق آٹھ مرتبہ دو جنتوں کے وصف میں اسے دہرایا ہے۔ پھر ان دو جنتوں کے علاوہ دوسری دو جنتوں کے وصف میں آٹھ مرتبہ دہرایا ہے۔ تو جو شخص پہلی آٹھ چیزوں کا عقیدہ و یقین رکھے گا اور ان کے تقاضے پر عمل کرے گا وہ اللہ کی طرف سے ان آٹھ نعمتوں کا مستحق ہو گا اور اللہ تعالیٰ اپنے فضل و کرم کے ساتھ اسے پہلی ساتوں سے محفوظ رکھیں گے۔ (ملخصاً) ¤ ➌ یہاں ایک سوال ہے کہ اس سورت کی کئی آیات میں جہنم اور عذاب کا بھی ذکر ہے، تو ان کے بعد {’’ فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ ‘‘} کہنے میں کون سی نعمت یاد دلائی جا رہی ہے؟ اس کا ایک جواب یہ ہے کہ {’’ اٰلَآءِ ‘‘} کا معنی قدرت بھی ہے، جیسا کہ اوپر گزرا۔ تو اللہ تعالیٰ کی صفات اور جہنم و عذاب کے بیان کے بعد کہا جا رہا ہے کہ تم دونوں اللہ تعالیٰ کی کون کون سی قدرت کو جھٹلاؤ گے؟ اور ایک جواب یہ ہے کہ عذاب آنے سے پہلے اس کے متعلق خبردار کر دینا بہت بڑی نعمت ہے، کیونکہ اس سے بندہ اس سے بچنے کی جدوجہد کر سکتا ہے، اس لیے فرمایا کہ تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) {خَلَقَ الْاِنْسَانَ مِنْ صَلْصَالٍ كَالْفَخَّارِ: ’’صَلْصَلَةٌ‘‘} وہ آواز جو کسی چیز کو بجانے یا کھڑکانے سے پیدا ہوتی ہے، جیسا کہ صحیح بخاری کی حدیث (۲) میں {’’صَلْصَلَةُ الْجَرْسِ‘‘} کا ذکر ہے۔ {’’ صَلْصَالٍ ‘‘} بجنے والی، کھنکھنانے والی (مٹی)۔ بعض کہتے ہیں یہ {’’ صِلُّ اللَّحْمِ‘‘} سے مشتق ہے، جس کا معنی گوشت کا بدبودار ہونا ہے۔ مراد بدبودار مٹی ہے۔ آیت کی مزید تفسیر کے لیے دیکھیے سورۂ حجر (۲۶)۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) {وَ خَلَقَ الْجَآنَّ مِنْ مَّارِجٍ مِّنْ نَّارٍ :} طبری نے فرمایا {’’ مَارِجٍ مِّنْ نَّارٍ ‘‘} ایک دوسرے سے ملی جلی سرخ، زرد اور سبز رنگ کی آگ۔ مراد آگ کا شعلہ اور اس کی نوک ہے۔ یہ {’’مَرَجَ أَمْرُ الْقَوْمِ‘‘} سے ہے، جس کا معنی ہے ’’قوم کا معاملہ مل جل گیا۔‘‘ اسی طرح یہ نبی صلی اللہ علیہ وسلم کے اس فرمان سے ہے جو آپ صلی اللہ علیہ وسلم نے عبداللہ بن عمرو رضی اللہ عنھما کو فرمایا : [ يَا عَبْدَ اللّٰهِ ابْنَ عَمْرٍو! كَيْفَ بِكَ إِذَا بَقِيْتَ فِيْ حُثَالَةٍ مِّنَ النَّاسِ وَ فِيْ أَبِيْ دَاوٗدَ : قَدْ مَرِجَتْ عُهُوْدُهُمْ وَ أَمَانَاتُهُمْ ] [ بخاري، الصلاۃ، باب تشبیک الأصابع…: ۴۸۰۔ أبو داوٗد : ۴۳۴۲ ] ’’ اے عبد اللہ بن عمرو ! تمھارا کیا حال ہو گا جب تم چھان بورے جیسے لوگوں میں باقی رہ جاؤ گے۔‘‘ ابوداؤد میں ہے :’’ جن کے عہد اور امانتیں مل جل گئے ہوں گے۔‘‘ اور طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ {’’ مَارِجٍ مِّنْ نَّارٍ ‘‘} کا معنی {’’خَالِصُ النَّارِ‘‘} نقل فرمایا ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ:} جن و انس کی پیدائش میں اللہ تعالیٰ کی قدرت بھی ہے اور ان دونوں پر نعمت بھی۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {رَبُّ الْمَشْرِقَيْنِ وَ رَبُّ الْمَغْرِبَيْنِ:} سورج ہمیشہ مشرقی سمت کے درمیان سے طلوع نہیں ہوتا، بلکہ گرمیوں میں اس کا مشرق شمال کی طرف سرکتا جاتا ہے اور سردیوں میں جنوب کی طرف اور ہر روز سورج کے طلوع ہونے کی جگہ الگ ہوتی ہے۔ اس لحاظ سے سال بھر میں سورج کے ۳۶۵ مشرق ہوتے ہیں، یہی حال اس کے مغربوں کا ہے۔ اس کے مطابق اللہ تعالیٰ نے سورۂ صافات (۵) میں اپنی صفت {’’ رَبُّ الْمَشَارِقِ ‘‘} اور سورۂ معارج (۴۰) میں {’’ بِرَبِّ الْمَشٰرِقِ وَ الْمَغٰرِبِ ‘‘} بیان فرمائی ہے۔ یہاں سردی اور گرمی کے آخری دو مقامات کے اعتبار سے {’’ رَبُّ الْمَشْرِقَيْنِ وَ رَبُّ الْمَغْرِبَيْنِ ‘‘} فرمایا ہے۔ مزید دیکھیے سورۂ صافات (۵)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) {فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ:} سورج کے طلوع و غروب، اس کی گردش اور اس کے متعدد مطالع و مغارب میں اللہ تعالیٰ کی بے شمار قدرتیں ہیں اور اس سے موسموں کے بدلنے، بارشیں برسنے، برف گرنے، بے شمار قسم کی فصلیں اُگنے اور انسان کی راحت و آرام کے بے حساب سامان مہیا کرنے کی بے شمار نعمتیں ہیں، جنھیں اللہ تعالیٰ یاد دلا رہے ہیں۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19تا21) {مَرَجَ الْبَحْرَيْنِ يَلْتَقِيٰنِ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ فرقان (۵۳)کی تفسیر۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 19تا21) {مَرَجَ الْبَحْرَيْنِ يَلْتَقِيٰنِ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ فرقان (۵۳)کی تفسیر۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 19تا21) {مَرَجَ الْبَحْرَيْنِ يَلْتَقِيٰنِ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ فرقان (۵۳)کی تفسیر۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) {يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ وَ الْمَرْجَانُ:} مفسر کیلانی لکھتے ہیں : ’’مرجان دراصل جمادات اور نباتات کے درمیان برزخی پیدائش ہے ، جس طرح سب موتی پتھروں ہی کی قسم ہوتے ہیں، مرجان بھی پتھر ہی کی قسم ہے، لیکن یہ نباتات کی طرح بڑھتا ہے، جمادات کی طرح جامد نہیں۔ مرجان کا ایک چھوٹا سا پودا ہوتا ہے جس کی شاخیں بھی ہوتی ہیں۔ موتی اور مرجان عموماً کھاری پانی کی پیداوار ہیں، مگر اسی کھاری پانی کے نیچے اللہ کی قدرت سے میٹھے پانی کے چشمے بھی ابل رہے ہوتے ہیں، یا ساتھ ساتھ رواں دواں ہوتے ہیں، اس لیے {’’ مِنْهُمَا ‘‘} کا لفظ ارشاد فرمایا، یعنی یہ چیزیں اللہ تعالیٰ کے حیرت انگیز تخلیقی کارناموں کے نتیجے میں پیدا ہوتی ہیں جن سے انسان فائدہ اٹھا رہا ہے۔‘‘ (تیسیر القرآن)مزید دیکھیے سورۂ نحل (۱۴)۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) { فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ:} ان آیات میں اللہ تعالیٰ کی قدرتوں کا بیان بھی ہے اور نعمتوں کا بھی۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 25،24) {وَ لَهُ الْجَوَارِ الْمُنْشَـٰٔتُ فِي الْبَحْرِ كَالْاَعْلَامِ …: ’’ الْمُنْشَـٰٔتُ ‘‘ ’’أَنْشَأَ يُنْشِئُ‘‘} (افعال) (بنانا) سے اسم مفعول ہے، پہاڑوں جیسے لمبے چوڑے اور کئی منزلہ اونچے بحری جہاز ’’جو بنائے گئے ہیں۔‘‘ اس میں بحری جہاز بنانے کا طریقہ سکھانے کی نعمت کی یاد دہانی ہے کہ اللہ تعالیٰ کے سکھانے سے انسان چھوٹے چھوٹے ٹکڑے جوڑتے ہوئے کتنا بڑا بحری جہاز بنا لیتا ہے۔ طبری نے صحیح سند کے ساتھ مجاہد سے {’’ الْمُنْشَـٰٔتُ ‘‘} کا ایک اور معنی بھی نقل فرمایا ہے : {’’مَا رُفِعَ قِلَعُهٗ مِنَ السُّفُنِ فَهِيَ مُنْشَئَاتٌ وَ إِذَا لَمْ يُرْفَعْ قِلَعُهَا فَلَيْسَتْ بِمُنْشَئَاتٍ‘‘} ’’وہ جہاز جن کے بادبان اٹھائے ہوئے ہوں وہ {’’ مُنْشَئَاتٌ‘‘} ہیں اور جب ان کے بادبان اٹھائے ہوئے نہ ہوں تو وہ {’’ مُنْشَئَاتٌ‘‘} نہیں ہیں۔‘‘ ¤ واضح رہے کہ انجن کی ایجاد سے پہلے بحری جہازوں کا سفر موافق ہواؤں کے ذریعے سے ہوتا تھا۔ چنانچہ اونچے اونچے ستونوں کے ساتھ کپڑے باندھ دیے جاتے، ہوا انھیں دھکیلتی ہوئی منزلِ مقصود پر پہنچا دیتی، انھیں بادبان کہا جاتا تھا۔ ’’باد‘‘ ہوا کو کہتے ہیں۔ اگر کہیں رکنا مقصود ہوتا تو وہ کپڑے اکٹھے کر دیے جاتے، اسے بادبان گرانا کہا جاتا تھا۔ اس معنی کے لحاظ سے بحری جہازوں پر اللہ تعالیٰ کی ایک اور نعمت کا ذکر ہے۔ مزید تفصیل کے لیے دیکھیے سورۂ شوریٰ (۳۳) کی تفسیر۔ {’’ وَ لَهُ الْجَوَارِ ‘‘} میں {’’ لَهُ ‘‘} کو پہلے لانے سے تخصیص پیدا ہو گئی کہ یہ جہاز، ان کے بنانے کا طریقہ سکھانا، ہزاروں ٹن وزنی ہونے کے باوجود انھیں سمندر کے سینے پر قائم رکھنا اور ڈوبنے نہ دینا اور لوگوں کو اور ان کے سامان کو دور دراز ملکوں تک پہنچانا وغیرہ صرف اور صرف اللہ تعالیٰ کا کام ہے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25،24) {وَ لَهُ الْجَوَارِ الْمُنْشَـٰٔتُ فِي الْبَحْرِ كَالْاَعْلَامِ …: ’’ الْمُنْشَـٰٔتُ ‘‘ ’’أَنْشَأَ يُنْشِئُ‘‘} (افعال) (بنانا) سے اسم مفعول ہے، پہاڑوں جیسے لمبے چوڑے اور کئی منزلہ اونچے بحری جہاز ’’جو بنائے گئے ہیں۔‘‘ اس میں بحری جہاز بنانے کا طریقہ سکھانے کی نعمت کی یاد دہانی ہے کہ اللہ تعالیٰ کے سکھانے سے انسان چھوٹے چھوٹے ٹکڑے جوڑتے ہوئے کتنا بڑا بحری جہاز بنا لیتا ہے۔ طبری نے صحیح سند کے ساتھ مجاہد سے {’’ الْمُنْشَـٰٔتُ ‘‘} کا ایک اور معنی بھی نقل فرمایا ہے : {’’مَا رُفِعَ قِلَعُهٗ مِنَ السُّفُنِ فَهِيَ مُنْشَئَاتٌ وَ إِذَا لَمْ يُرْفَعْ قِلَعُهَا فَلَيْسَتْ بِمُنْشَئَاتٍ‘‘} ’’وہ جہاز جن کے بادبان اٹھائے ہوئے ہوں وہ {’’ مُنْشَئَاتٌ‘‘} ہیں اور جب ان کے بادبان اٹھائے ہوئے نہ ہوں تو وہ {’’ مُنْشَئَاتٌ‘‘} نہیں ہیں۔‘‘ ¤ واضح رہے کہ انجن کی ایجاد سے پہلے بحری جہازوں کا سفر موافق ہواؤں کے ذریعے سے ہوتا تھا۔ چنانچہ اونچے اونچے ستونوں کے ساتھ کپڑے باندھ دیے جاتے، ہوا انھیں دھکیلتی ہوئی منزلِ مقصود پر پہنچا دیتی، انھیں بادبان کہا جاتا تھا۔ ’’باد‘‘ ہوا کو کہتے ہیں۔ اگر کہیں رکنا مقصود ہوتا تو وہ کپڑے اکٹھے کر دیے جاتے، اسے بادبان گرانا کہا جاتا تھا۔ اس معنی کے لحاظ سے بحری جہازوں پر اللہ تعالیٰ کی ایک اور نعمت کا ذکر ہے۔ مزید تفصیل کے لیے دیکھیے سورۂ شوریٰ (۳۳) کی تفسیر۔ {’’ وَ لَهُ الْجَوَارِ ‘‘} میں {’’ لَهُ ‘‘} کو پہلے لانے سے تخصیص پیدا ہو گئی کہ یہ جہاز، ان کے بنانے کا طریقہ سکھانا، ہزاروں ٹن وزنی ہونے کے باوجود انھیں سمندر کے سینے پر قائم رکھنا اور ڈوبنے نہ دینا اور لوگوں کو اور ان کے سامان کو دور دراز ملکوں تک پہنچانا وغیرہ صرف اور صرف اللہ تعالیٰ کا کام ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) { كُلُّ مَنْ عَلَيْهَا فَانٍ:’’ فَانٍ ‘‘’’فَنِيَ يَفْنٰي فَنَاءً‘‘} (س) سے اسم فاعل ہے۔ اس سے پہلے آیت (۱۰) میں زمین کا تذکرہ فرمایا ہے، اس کے بعد زمین پرموجود چیزوں کا ذکر فرمایا، جس میں جن و انس بھی شامل ہیں اور اللہ تعالیٰ کی قدرت اور نعمت کے رنگا رنگ نمونے بھی۔ اس کے بعد بتایا کہ ان میں سے کسی کو بھی بقا و دوام حاصل نہیں، سب فنا ہونے والے ہیں۔ بقا و دوام صرف اللہ تعالیٰ کی ذات پاک کے لیے ہے۔ (دیکھیے آلِ عمران : ۱۸۵۔ فرقان : ۵۸) آیت کی تفسیر کے لیے دیکھیے سورۂ قصص (۸۸) کی تفسیر۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) {وَ يَبْقٰى وَجْهُ رَبِّكَ ذُو الْجَلٰلِ وَ الْاِكْرَامِ: ’’ الْجَلٰلِ ‘‘} کا معنی عظمت و کبریائی ہے اور {’’ الْاِكْرَامِ ‘‘ ’’أَكْرَمَ يُكْرِمُ ‘‘} (افعال) کا مصدر ہے۔ اللہ تعالیٰ کے {’’ذُوالإِْكْرَامِ‘‘} ہونے کا ایک مطلب یہ ہے کہ عزت دینے والا وہی ہے، کوئی اور نہیں، جیسے فرمایا : «وَ مَنْ يُّهِنِ اللّٰهُ فَمَا لَهٗ مِنْ مُّكْرِمٍ » [ الحج : ۱۸ ] ’’اور جسے اللہ ذلیل کر دے پھر اسے کوئی عزت دینے والا نہیں۔‘‘ اور دوسرا مطلب یہ ہے کہ اس کا حق ہے کہ اس کا اکرام کیا جائے، اس کے بندے اس کی توحید و تسبیح اور عبادت کے ساتھ اس کا اکرام کرتے ہیں۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) {فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ:} زمین پر موجود ہر شخص کے فنا میں اللہ تعالیٰ کی قدرت تو ظاہر ہی ہے، اس میں اس کی نعمت بھی ہے ،کیونکہ مرنے کے بغیر کوئی شخص اس کی جنت کا وارث نہیں بن سکتااور نہ اس کا دیدار حاصل کر سکتا ہے۔ ایک فارسی شاعر نے کیا خوب کہا ہے : ¤ بے فنائے خود میسر نیست دیدار شما ¤ مے فروشد خویش را اوّل خریدار شما ¤ ’’اپنے فنا کے بغیر تمھارا دیدار میسر نہیں ہوتا، تمھیں خریدنے والے کو پہلے اپنا آپ بیچنا پڑتا ہے۔‘‘"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ {يَسْـَٔلُهٗ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ:} یہ ہر چیز کے فانی ہونے اور اللہ تعالیٰ کے باقی ہونے کی دلیل ہے۔ یعنی اللہ تعالیٰ ہمیشہ باقی ہے، کیونکہ وہ غنی ہے، اپنے وجود یا بقا یا کسی بھی چیز میں کسی دوسرے کا محتاج نہیں، مگر اس کے سوا جو بھی ہے خواہ آسمان ہوں یا زمین یا جو ان دونوں میں ہے، سب اپنے وجود، اپنی بقا اور اپنی ہر ضرورت کے لیے ہر لمحے اس کے محتاج ہیں۔ اپنی ہر ضرورت اسی سے مانگ رہے ہیں، کوئی زبانِ قال سے مانگ رہا ہے، کوئی زبانِ حال سے اور کوئی دونوں سے۔ جس کی زندگی کا ہر لمحہ مانگنے پر موقوف ہے وہ کیا خاک باقی رہے گا۔ ¤ ➋ { كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ: ’’ كُلَّ يَوْمٍ ‘‘} سے مراد ہر وقت ہے۔ {’’ شَاْنٍ ‘‘} میں تنوین تنکیر کے لیے ہے، یعنی وہ ہر لمحے ایک نئی سے نئی شان میں ہے، کسی کو پیدا کر رہا ہے اور کسی کو مار رہا ہے، کسی کو اٹھا رہا ہے اور کسی کو گرا رہا ہے، کسی کو بیمار کر رہا ہے اور کسی کو شفا بخش رہا ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَدُ اللّٰهِ مَلَاٰی لاَ تَغِيْضُهَا نَفَقَةٌ سَحَّاءُ اللَّيْلَ وَالنَّهَارَ وَ قَالَ أَرَأَيْتُمْ مَا أَنْفَقَ مُنْذُ خَلَقَ السَّمَاءَ وَالْأَرْضَ فَإِنَّهُ لَمْ يَغِضْ مَا فِيْ يَدِهِ وَكَانَ عَرْشُهُ عَلَی الْمَاءِ وَبِيَدِهِ الْمِيْزَانُ يَخْفِضُ وَ يَرْفَعُ ] [ بخاري، التفسیر، سورۃ ہود، باب قولہ : « وکان عرشہ علی الماء» : ۴۶۸۴ ] ’’اللہ کا ہاتھ بھرا ہوا ہے، کسی قسم کا خرچ کرنا اس میں کمی نہیں لاتا، رات دن بے حساب برسنے والا ہے۔ تم نے دیکھا اس نے جب سے آسمان و زمین پیدا کیے، کیا کچھ خرچ کیا، تو اس (خرچ کرنے)نے اس میں کوئی کمی نہیں کی جو اس کے ہاتھ میں ہے اور اس کا عرش پانی پر تھا اور اس کے ہاتھ میں ترازو ہے۔ نیچے کرتا ہے اور اونچا کرتا ہے۔‘‘ اور ابو الدرداء رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے {’’ كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ ‘‘} کی تفسیر کے بیان میں روایت کیا کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مِنْ شَأْنِهٖ أَنْ يَغْفِرَ ذَنْبًا وَ يُفَرِّجَ كَرْبًا وَ يَرْفَعَ قَوْمًا وَ يَخْفِضَ آخَرِيْنَ ] [ ابن ماجہ، المقدمۃ، باب فیما أنکرت الجھمیۃ : ۲۰۲، و قال الألباني حسن ] ’’اس کی شان سے ہے کہ وہ کوئی نہ کوئی گناہ بخش رہا ہے، کوئی نہ کوئی مصیبت دور کر رہا ہے اور کسی قوم کو اونچا کر رہا ہے اور کسی کو نیچا کر رہا ہے۔‘‘ ¤ ➌ اس میں یہود کا بھی ردّ ہے جنھوں نے کہا کہ اللہ تعالیٰ نے چھ دنوں میں زمین و آسمان پیدا فرمائے اور ہفتہ کے دن آرام کیا۔ فرمایا وہ ہر دن ہی نئی شان میں ہے، اسے نہ تھکاوٹ ہوتی ہے نہ آرام کی ضرورت ہے۔ ¤ ➍ یونان کے فلسفی آسمانی ہدایت سے محروم تھے، انھوں نے اللہ تعالیٰ کا وجود ماننے کے باوجود اپنے دیوتاؤں کی گنجائش نکالنے کے لیے ایک قاعدہ وضع کیا ، جو یہ تھا کہ ’’ہر محل حوادث حادث ہوتا ہے۔ چونکہ اللہ تعالیٰ قدیم ہے، ہمیشہ سے ہے، اس لیے اس پر حوادث نہیں آ سکتے۔‘‘ افسوس ! بعض مسلمان متکلمین نے بھی ان کا یہ قاعدہ تسلیم کر لیا۔ نتیجہ اس کا یہ نکلا کہ انھوں نے اللہ تعالیٰ کی صفات کا انکار کر دیا۔ بعض نے تاویل کی اور ایسی تاویل کی جو درحقیقت بدترین تحریف ہے۔ مثلاً اللہ کی صفت کلام ہے، جیسا کہ فرمایا : «وَ كَلَّمَ اللّٰهُ مُوْسٰى تَكْلِيْمًا » [ النساء : ۱۶۴ ] ’’اور اللہ نے موسیٰ سے کلام کیا، خود کلام کرنا۔‘‘ اور فرمایا : «وَ اِنْ اَحَدٌ مِّنَ الْمُشْرِكِيْنَ اسْتَجَارَكَ فَاَجِرْهُ حَتّٰى يَسْمَعَ كَلٰمَ اللّٰهِ » [ التوبۃ : ۶ ] ’’اور اگر مشرکوں میں سے کوئی تجھ سے پناہ مانگے تو اسے پناہ دے دے، یہاں تک کہ وہ اللہ کا کلام سنے۔‘‘ اور فرمایا : « اِنَّمَااَمْرُهٗۤ اِذَاۤ اَرَادَ شَيْـًٔا اَنْ يَّقُوْلَ لَهٗ كُنْ فَيَكُوْنُ» [ یٰسٓ : ۸۲ ] ’’اس کا حکم تو، جب وہ کسی چیز کا ارادہ کرتا ہے، اس کے سوا نہیں ہوتا کہ اسے کہتا ہے ’’ہو جا‘‘ تو وہ ہو جاتی ہے۔ ‘‘ یہ ساری کائنات اس کے کلمۂ کن سے وجود میں آئی ہے۔ ظاہر ہے کلام کا ہر لفظ حادث ہے، پہلے موجود نہیں ہوتا، پھر وجود میں آتا ہے، اس لیے متکلمین نے اللہ تعالیٰ کے کلام کا انکار کر دیا۔ اللہ تعالیٰ دیکھتا ہے، سنتا ہے، اترتا ہے، بلند ہوتا ہے، خوش ہوتا ہے، ناراض ہوتا ہے۔ ظاہر ہے یہ صفات اور اس جیسی دوسری صفات اللہ تعالیٰ میں ہمیشہ سے ہیں، ان کی انواع قدیم ہیں مگر افراد حادث ہیں، ان کا اظہار مختلف اوقات میں ہوتا رہتا ہے۔ چنانچہ اللہ تعالیٰ جب چاہے کلام کرتا ہے، نیچے اترتا ہے، بلند ہوتا ہے، پیدا کرتا ہے، مارتا ہے، ہر ایک کو ہر لمحے روزی بخشتا ہے، ہر لمحے ہر ایک کو دیکھتا ہے، اس کی سنتا ہے، اس کی ضرورت پوری کرتا ہے، مگر یونانی فلسفیوں کی تقلید میں متکلمین نے اللہ تعالیٰ کو سننے، دیکھنے، بولنے، خوش ہونے، ناراض ہونے، غرض اس طرح کی تمام صفات سے عاری قرار دیا۔ اس مقام پر بھی اللہ تعالیٰ نے اپنی یہ صفت بیان فرمائی ہے کہ وہ آسمان و زمین کی ہر چیز کے سوال کو سنتا ہے اور ہر لمحے نئی سے نئی شان میں ہے؟ اب ہم یونان کے کافر فلاسفر اور ان کے مقلد بعض متکلمین کی بات مانیں کہ اللہ تعالیٰ پر کوئی نئی شان وارد نہیں ہو سکتی یا اللہ تعالیٰ کی بات پر ایمان رکھیں کہ وہ ہر لمحے ایک نئی سے نئی شان میں ہے ؟ ظاہر ہے جس کے دل میں ایمان ہے وہ تو اللہ تعالیٰ ہی کی بات مانے گا، خواہ کوئی فلسفی اسے مانے یا نہ مانے۔"
    },
    {
      "ayah": 30,
      "tafsir": ""
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) {سَنَفْرُغُ لَكُمْ اَيُّهَ الثَّقَلٰنِ: ’’ الثَّقَلٰنِ ‘‘ ’’ ثَقَلٌ‘‘} کی جمع ہے، بھاری اور وزنی چیز۔ مراد زمین پر آباد جاندار مخلوق میں سے دو بھاری اور کثیر التعداد جماعتیں جن و انس ہیں۔ مخلوقات میں سے شرعی احکام کی تکلیف ان دونوں ہی کو دی گئی ہے، اس لیے انھی کو مخاطب فرمایا۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ {’’ سَنَفْرُغُ لَكُمْ اَيُّهَ الثَّقَلٰنِ ‘‘} کے بارے میں ابن عباس رضی اللہ عنھما کی تفسیر نقل کی ہے : {’’ وَعِيْدٌ مِّنَ اللّٰهِ لِلْعِبَادِ وَلَيْسَ بِاللّٰهِ شُغُلٌ وَ هُوَ فَارِغٌ‘‘} یعنی ’’یہ الفاظ اللہ تعالیٰ کی طرف سے بندوں کے لیے وعید ہیں، ورنہ اللہ تعالیٰ کو دوسرے کسی کام سے روکنے والی کوئی مشغولیت نہیں اور وہ فارغ ہے۔‘‘ امام بخاری نے فرمایا : {’’سَنَفْرُغُ لَكُمْ سَنُحَاسِبُكُمْ لاَ يَشْغَلُهُ شَيْءٌ عَنْ شَيْءٍ وَهُوَ مَعْرُوْفٌ فِيْ كَلاَمِ الْعَرَبِ يُقَالُ لَأَتَفَرَّغَنَّ لَكَ وَمَا بِهِ شُغْلٌ يَقُوْلُ لَآخُذَنَّكَ عَلٰي غِرَّتِكَ‘‘} [ بخاري، التفسیر، سورۃ الرحمٰن، قبل الحدیث : ۴۸۷۸ ]یعنی {’’ سَنَفْرُغُ لَكُمْ ‘‘} (ہم جلد ہی تمھارے لیے فارغ ہوں گے) کا مطلب یہ ہے کہ ہم جلد ہی تمھارا حساب لیں گے، کیونکہ اللہ تعالیٰ کے لیے کوئی چیز دوسری چیز سے رکاوٹ نہیں بنتی اور یہ کلامِ عرب میں معروف ہے۔ کہا جاتا ہے، میں تمھارے لیے فارغ ہوں گا، حالانکہ اسے کوئی مشغولیت نہیں ہوتی۔ مطلب یہ ہوتا ہے کہ میں تمھاری غفلت میں تمھیں پکڑوں گا۔ ‘‘ {’’ سَنَفْرُغُ لَكُمْ ‘‘} کا ایک مطلب یہ بھی ہے کہ اے جنو اور انسانو! ہم نے تمھارے لیے ایک نظام الاوقات طے کر دیا ہے، دنیا میں تمھارے پاس عمل کی مہلت ہے، یہاں ہم ہر لمحے تمھاری ضرورتیں پوری کر رہے ہیں، جو مانگتے ہو دے رہے ہیں، بہت جلد ہم اس مرحلے سے فارغ ہوں گے، پھر قیامت قائم ہو گی اور تمھارے محاسبے کا مرحلہ شروع ہو جائے گا۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) {فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ:} اس نظام عالم کو درہم برہم کر کے قیامت برپا کرنا، ان دونوں جماعتوں سے حساب لینا، پھر اس کے مطابق جزا و سزا دینا اللہ تعالیٰ کے عدل اور اس کی عظیم قدرت کا اظہار بھی ہے اور اہلِ ایمان کے لیے بہت بڑی نعمت بھی، جس کے متعلق فرمایا : «فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ » ’’کہ تم دونوں اپنے رب کی نعمتوں میں سے کس کس کو جھٹلاؤ گے؟‘‘"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) { يٰمَعْشَرَ الْجِنِّ وَ الْاِنْسِ اِنِ اسْتَطَعْتُمْ …:’’مَعْشَرٌ‘‘ ’’عَشْرٌ‘‘} سے {’’مَفْعَلٌ‘‘} کے وزن پر ہے، کثیر التعداد جماعت کو کہتے ہیں، کیونکہ اس میں بہت سے عشرات پائے جاتے ہیں، جن کا شمار یکے بعد دیگرے دہائیوں میں ہوتا ہے۔ {’’ اَقْطَارِ ‘‘ ’’قَطْرٌ‘‘} کی جمع ہے، کنارا۔ {’’سُلْطَانٌ‘‘} قدرت اور غلبہ۔ یعنی اے جنوں اور انسانوں کی جماعت! دنیا میں اگر تم موت سے بچنے کے لیے آسمانوں اور زمین کے کناروں سے نکل کر بھاگ سکتے ہو تو بھاگ جاؤ، مگر تم اللہ تعالیٰ پر غالب آ کر ہی نکل سکو گے، جس کا سوال ہی پیدا نہیں ہوتا، جیسا کہ فرمایا : « اَيْنَ مَا تَكُوْنُوْا يُدْرِكْكُّمُ الْمَوْتُ وَ لَوْ كُنْتُمْ فِيْ بُرُوْجٍ مُّشَيَّدَةٍ » [ النساء : ۷۸ ] ’’تم جہاں کہیں بھی ہو گے موت تمھیں پا لے گی، خواہ تم مضبوط قلعوں میں ہو۔‘‘ اور قیامت کے دن اللہ تعالیٰ کے محاسبے اور اس کی گرفت سے بچنے کے لیے اگر تم آسمانوں اور زمین کے کناروں سے نکل کر بھاگ سکتے ہو تو بھاگ جاؤ…۔ اس سے ملتا جلتا مفہوم اس آیت کا ہے، فرمایا : « فَاِذَا بَرِقَ الْبَصَرُ (7) وَ خَسَفَ الْقَمَرُ (8) وَ جُمِعَ الشَّمْسُ وَ الْقَمَرُ (9) يَقُوْلُ الْاِنْسَانُ يَوْمَىِٕذٍ اَيْنَ الْمَفَرُّ (10) كَلَّا لَا وَزَرَ (11) اِلٰى رَبِّكَ يَوْمَىِٕذِ الْمُسْتَقَرُّ» [ القیامۃ : ۷ تا ۱۲ ] ’’پھر جب آنکھ پتھرا جائے گی۔ اور چاند گہنا جائے گا۔ اور سورج اور چاند اکٹھے کر دیے جائیں گے۔ انسان اس دن کہے گا کہ بھاگنے کی جگہ کہاں ہے؟ ہرگز نہیں، پناہ کی جگہ کوئی نہیں۔ اس دن تیرے رب ہی کی طرف جا ٹھہرنا ہے۔‘‘ آج کل راکٹ یا خلائی گاڑی کے ذریعے سے چاند پر یا کسی اور کُرے پر جانے کے تجربات ہو رہے ہیں، بعض لوگ اس کے متعلق کہتے ہیں کہ {’’ لَا تَنْفُذُوْنَ اِلَّا بِسُلْطٰنٍ ‘‘} (تم غلبے کے بغیر نہیں نکل سکو گے) سے مراد یہ ہے کہ ان مشینوں کے ذریعے سے {’’ اَقْطَارِ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} سے نکلنا ممکن ہے، حالانکہ ان کوششوں کی آیت کے مفہوم کے ساتھ کوئی نسبت ہی نہیں۔ یہ بے چارے تو زمین و آسمان کے درمیان خلا میں پھر رہے ہیں، آسمان و زمین کے کناروں تک رسائی تو بہت دور ہے۔ پھر وہ ذرۂ بے مقدار، جس کا ایک سانس بھی اس کے اپنے اختیار میں نہیں، وہ اپنی قوت کے ساتھ {’’ اَقْطَارِ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} سے نکلنے کی بات کرے تو یہی کہا جا سکتا ہے: ¤ بت کریں آرزو خدائی کی ¤ شان ہے تیری کبریائی کی"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) {فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ:} یہاں{ ’’ اٰلَآءِ ‘‘} کا معنی ’’قدرتیں‘‘ واضح ہے اور وعید گناہوں سے باز آنے کا باعث ہونے کی وجہ سے عظیم نعمت بھی ہے۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) {يُرْسَلُ عَلَيْكُمَا شُوَاظٌ مِّنْ نَّارٍ …:’’ شُوَاظٌ ‘‘} آگ کا شعلہ جس میں دھواں نہ ہو اور {’’ نُحَاسٌ ‘‘} دھواں۔ {’’ نُحَاسٌ ‘‘} کا معنی تانبا بھی ہے، مراد پگھلا ہوا تانبا ہے۔ {’’ اِنْتَصَرَ يَنْتَصِرُ اِنْتِصَارًا ‘‘} اپنا بچاؤ کرنا، انتقام لینا۔ یعنی تم ہمارے قبضے سے کسی صورت بھی نکل کر بھاگ نہیں سکتے، اگر تم یہ ارادہ کرو گے تو تم پر خالص آگ کے شعلے برسائے جائیں گے، جو تمھیں جلا کر بھسم کر دیں گے اور دھواں جو تمھارے سانس تک بند کر دے گا، پھر نہ تم اپنا بچاؤ کر سکو گے اور نہ کسی طرح انتقام لے سکو گے۔ یہ معنی بھی ہو سکتا ہے کہ تم پر آگ کے شعلوں کے ساتھ پگھلا ہوا تانبا پھینکا جائے گا، جو دونوں تمھیں جلا کر راکھ بنا دیں گے۔"
    },
    {
      "ayah": 36,
      "tafsir": ""
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) {فَاِذَا انْشَقَّتِ السَّمَآءُ … : ’’ وَرْدَةً ‘‘} گلاب کے پھول کی طرح گلابی۔{’’اَلدِّهَانُ‘‘} میں علماء کے دو قول ہیں، ایک سرخ چمڑا اور دوسرا ’’تیل ‘‘جو ملا جاتا ہے۔ اس معنی میں بعض کہتے ہیں : {’’اَلدِّهَانُ‘‘ ’’دُهْنٌ‘‘} کی جمع ہے اور بعض کہتے ہیں مفرد ہے۔ تیل کو {’’ دُهْنٌ‘‘} بھی کہتے ہیں اور {’’دِهَانٌ‘‘} بھی۔ {’’ فَاِذَا انْشَقَّتِ السَّمَآءُ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ حاقہ (۱۶)، فرقان (۲۵) اور سورۂ انشقاق( 2،1)۔ ¤ اگر {’’اَلدِّهَانُ‘‘} کا معنی سرخ چمڑا کریں تو اس وقت آیت میں آسمان کے ایک وصف کا بیان ہے کہ آسمان جو آج نیلگوں ہے اس وقت سرخ چمڑے کی طرح لال گلابی ہو جائے گا اور اگر {’’اَلدِّهَانُ‘‘} کا معنی تیل کیا جائے تو آیت میں آسمان کے پھٹنے کے وقت اس کے دو وصفوں کا بیان ہو گا، ایک یہ کہ وہ حرارت کی شدت سے سرخ ہو گا اور دوسرا یہ کہ پگھل کر تیل کی طرح ہو جائے گا، جیسا کہ فرمایا : « يَوْمَ تَكُوْنُ السَّمَآءُ كَالْمُهْلِ » [ المعارج : ۸ ] ’’جس دن آسمان پگھلے ہوئے تانبے ( یا تلچھٹ) کی طرح ہو جائے گا۔‘‘ (شنقیطی)"
    },
    {
      "ayah": 38,
      "tafsir": ""
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) {فَيَوْمَىِٕذٍ لَّا يُسْـَٔلُ عَنْ ذَنْۢبِهٖۤ اِنْسٌ وَّ لَا جَآنٌّ:} یعنی اس دن یہ معلوم کرنے کے لیے کہ کون مجرم ہے اور اس نے کیا گناہ کیا ہے، کسی انسان یا جن سے پوچھنے کی ضرورت ہی نہیں ہو گی، کیونکہ تمام مجرم اپنی علامت ہی سے پہچانے جائیں گے، جیسا کہ اگلی آیت میں آ رہا ہے : « يُعْرَفُ الْمُجْرِمُوْنَ بِسِيْمٰهُمْ » ’’مجرم اپنی علامت سے پہچانے جائیں گے۔‘‘ اور جیساکہ سورئہ قصص میں فرمایا : «وَ لَا يُسْـَٔلُ عَنْ ذُنُوْبِهِمُ الْمُجْرِمُوْنَ » [ القصص:۷۸] ’’اور مجرموں سے ان کے گناہوں کے بارے میں پوچھا نہیں جائے گا۔‘‘ ہاں ڈانٹنے، ذلیل کرنے اور ملامت کرنے کے لیے ضرور پوچھا جائے گا، جیسا کہ فرمایا : « فَوَرَبِّكَ لَنَسْـَٔلَنَّهُمْ اَجْمَعِيْنَ (92) عَمَّا كَانُوْا يَعْمَلُوْنَ » [ الحجر : ۹۲،۹۳ ] ’’سو تیرے رب کی قسم ہے ! یقینا ہم ان سب سے ضرور سوال کریں گے۔ اس کے بارے میں جو وہ کیا کرتے تھے۔‘‘ اور فرمایا : « وَ قِفُوْهُمْ اِنَّهُمْ مَّسْـُٔوْلُوْنَ» [ الصافات :۲۴ ] ’’اور انھیں ٹھہراؤ، بے شک یہ سوال کیے جانے والے ہیں۔ ‘‘"
    },
    {
      "ayah": 40,
      "tafsir": ""
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ {يُعْرَفُ الْمُجْرِمُوْنَ بِسِيْمٰهُمْ …:’’اَلنَّوَاصِيْ‘‘ ’’ نَاصِيَةٌ ‘‘} کی جمع ہے، پیشانی کے بال۔ (دیکھیے ہود : ۵۶) یعنی ان کے چہرے سیاہ ہوں گے، جیسا کہ فرمایا : « يَّوْمَ تَبْيَضُّ وُجُوْهٌ وَّ تَسْوَدُّ وُجُوْهٌ » [ آل عمران : ۱۰۶ ] ’’جس دن کچھ چہرے سفید ہوں گے اور کچھ چہرے سیاہ ہوں گے۔‘‘ آنکھیں نیلی ہوں گی، جیسا کہ فرمایا : «وَ نَحْشُرُ الْمُجْرِمِيْنَ يَوْمَىِٕذٍ زُرْقًا» [ طٰہٰ : ۱۰۲ ] ’’اور ہم مجرموں کو اس دن اس حال میں اکٹھا کریں گے کہ نیلی آنکھوں والے ہوں گے۔‘‘ اور اعمال نامے پیٹھ کے پیچھے بائیں ہاتھ میں پکڑ رکھے ہوں گے۔ دیکھیے سورۂ انشقاق (۱۰) اور سورۂ حاقہ (۲۵)۔ ¤ ➋ { فَيُؤْخَذُ بِالنَّوَاصِيْ وَ الْاَقْدَامِ:} یعنی ہر مجرم کو پیشانی کے بالوں اور قدموں سے پکڑ کر جہنم میں پھینک دیا جائے گا۔"
    },
    {
      "ayah": 42,
      "tafsir": ""
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) { هٰذِهٖ جَهَنَّمُ الَّتِيْ يُكَذِّبُ بِهَا الْمُجْرِمُوْنَ:} یہ بات مجرموں سے کہی جائے گی (دیکھیے طور : ۱۴) اور یہ بھی ہے کہ ہمیں سمجھانے کے لیے یہ بات بتائی جا رہی ہے۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) {يَطُوْفُوْنَ بَيْنَهَا وَ بَيْنَ حَمِيْمٍ اٰنٍ: ’’ اٰنٍ ‘‘ ’’أَنٰي يَأْنِيْ إِنًي‘‘} (ض) سے اسم فاعل ہے، جیسا کہ {’’ قَاضٍ‘‘} ہے، انتہائی گرم، کھولنے والا۔ سورۂ غاشیہ میں ہے: «تُسْقٰى مِنْ عَيْنٍ اٰنِيَةٍ » [الغاشیۃ:۵] ’’وہ ایک کھولتے ہوئے چشمے سے پلائے جائیں گے۔‘‘ {’’ إِنًي‘‘} کھانے کا پک کر تیار ہونا، جیسے فرمایا : « غَيْرَ نٰظِرِيْنَ اِنٰىهُ» [ الأحزاب : ۵۳ ] ’’اس حال میں کہ اس کے پکنے کا انتظار کرنے والے نہ ہوں۔‘‘ {’’ يَطُوْفُوْنَ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ صافات (۶۶ تا ۶۸)۔"
    },
    {
      "ayah": 45,
      "tafsir": ""
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { وَ لِمَنْ خَافَ مَقَامَ رَبِّهٖ جَنَّتٰنِ: ’’ مَقَامَ ‘‘ ’’قَامَ يَقُوْمُ قِيَامًا‘‘} (ن) سے ظرف بھی ہو سکتا ہے ’’کھڑا ہونے کی جگہ یا وقت‘‘ اور مصدر میمی بھی ہو سکتا ہے ’’کھڑا ہونا۔‘‘ جہنم اور اہلِ جہنم کے تذکرے کے بعد اہلِ جنت کا ذکر فرمایا۔ {’’ مَقَامَ رَبِّهٖ ‘‘} کے دو مطلب ہو سکتے ہیں اور دونوں قرآن مجید کی آیات میں ملتے ہیں، ایک یہ کہ جو شخص اپنے رب کے سامنے کھڑا ہونے سے ڈر گیا اس کے لیے دو باغ ہیں۔ اس صورت میں {’’ مَقَامَ رَبِّهٖ ‘‘} سے مراد بندے کا اپنے رب کے سامنے کھڑا ہونا ہے۔ اس کی تائید اس آیت سے ہوتی ہے، فرمایا : « يَوْمَ يَقُوْمُ النَّاسُ لِرَبِّ الْعٰلَمِيْنَ» [ المطففین : ۶ ] ’’جس دن لوگ رب العالمین کے لیے کھڑے ہوں گے۔‘‘ دوسرا یہ کہ جو شخص اپنے رب کے (اپنے اوپر ہر وقت) قائم (نگران) ہونے سے ڈر گیا۔ اس معنی کی تائید اس آیت سے ہوتی ہے، فرمایا : « اَفَمَنْ هُوَ قَآىِٕمٌ عَلٰى كُلِّ نَفْسٍۭ بِمَا كَسَبَتْ » [ الرعد : ۳۳ ] ’’تو کیا وہ جو ہر جان پر اس کا نگران ہے جو اس نے کمایا( کوئی دوسرا اس کے برابر ہو سکتا ہے)؟‘‘ آیت سے دونوں معنی بیک وقت مراد ہو سکتے ہیں اور یہ بھی قرآن مجید کا ایک کمال ہے کہ اس کا ایک ایک لفظ متعدد معانی کا حامل ہے۔ یعنی جو شخص اس بات سے ڈر گیا کہ اس نے قیامت کے دن اپنے رب کے سامنے کھڑا ہونا ہے اور اس بات سے بھی ڈرتا رہا کہ اس کا رب اس کی ہرچھوٹی بڑی حرکت کو دیکھ رہا ہے، تو اس کے لیے دو باغ ہیں۔ اس سے یہ حقیقت واضح ہو رہی ہے کہ جنت کی وراثت کی بنیاد اللہ تعالیٰ کا ڈر ہے، کیونکہ یہی وہ جوہر ہے جو انسان کو صراطِ مستقیم پر قائم رکھتا ہے اور اسے اللہ تعالیٰ کی نافرمانی سے بچاتا ہے۔ اگر یہ نہ ہو تو موقع میسر ہونے پر انسان کو کوئی بھی چیز کسی بھی جرم کے ارتکاب سے نہیں روک سکتی اور جب یہ موجود ہو تو آدمی کے قدم مشکل سے مشکل مقام پر نہیں ڈگمگاتے۔ صحیح بخاری(۶۶۰) میں قیامت کے دن جن سات آدمیوں کو عرش کا سایہ ملنے کی بشارت دی گئی ہے ان سب کے اعمال میں اصل اللہ تعالیٰ کا ڈر ہی ہے اور اس کفن چور کی مغفرت کا باعث بھی اللہ کا ڈر تھا جس نے وصیت کی تھی کہ مجھے جلا کر میری کچھ راکھ کو ہوا میں اڑا دیا جائے اور کچھ کو پانی میں بہا دیا جائے۔(دیکھیے بخاری: ۳۴۵۲) {’’ مَقَامَ رَبِّهٖ ‘‘} کے لفظ میں خوف کے ساتھ محبت کا پہلو بھی نمایاں ہے کہ وہ کسی اجنبی یا ظالم سے نہیں ڈر رہا، بلکہ اپنے مالک سے ڈر رہا ہے جس نے اسے پیدا کیا، پھر ہر لمحے اس کی پرورش کر رہا ہے اور اس کی ہر ضرورت پوری کر رہا ہے۔ ¤ ➋ { جَنَّتٰنِ: ’’جَنَّةٌ‘‘} کا اصل معنی باغ ہے۔ قرآن مجید میں کہیں یہ لفظ مفرد آیا ہے اور تمام اہلِ ایمان کے ایک ہی جنت میں داخلے کا ذکر ہے، جیسا کہ فرمایا : « وَ مَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُنْثٰى وَ هُوَ مُؤْمِنٌ فَاُولٰٓىِٕكَ يَدْخُلُوْنَ الْجَنَّةَ يُرْزَقُوْنَ فِيْهَا بِغَيْرِ حِسَابٍ » [ المؤمن : ۴۰ ] ’’اور جس نے کوئی نیک عمل کیا، مرد ہو یا عورت اور وہ مومن ہوا تو یہ لوگ جنت میں داخل ہوں گے، اس میں بے حساب رزق دیے جائیں گے۔‘‘ اور کہیں جمع آیا ہے، جیسا کہ فرمایا : «وَ بَشِّرِ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ » [ البقرۃ : ۲۵ ] ’’اور ان لوگوں کو خوش خبری دے دے جو ایمان لائے اور انھوں نے نیک اعمال کیے کہ ان کے لیے ایسے باغات ہیں جن کے تلے نہریں بہتی ہیں۔‘‘ اس سے معلوم ہوا کہ اس بڑے باغ میں بے شمار باغات ہیں، جن میں سے ہر مومن کو دو دو باغ عطا کیے جائیں گے، جن کا وہ مالک ہو گا (لام تملیک کے لیے ہے) اور جن میں وہ سب کچھ ہو گا جس کا آگے ذکر ہو رہا ہے۔ ¤ ➌ ان آیات میں ہر اس شخص کو دو دو باغ ملنے کا ذکر ہے جو اپنے رب کے سامنے کھڑا ہونے سے ڈر گیا۔ چند آیات کے بعد اور دو باغوں کا ذکر ہے، فرمایا : «وَ مِنْ دُوْنِهِمَا جَنَّتٰنِ » جس کا معنی یہ بھی ہو سکتا ہے کہ ان دونوں کے علاوہ بھی دو باغ ہیں اور یہ بھی کہ ان دونوں سے کم درجے والے بھی دو باغ ہیں۔ دونوں آیات کو ملائیں تو مطلب یہ ہے کہ ان دونوں کے علاوہ دو اور باغ ہیں جو پہلے باغوں سے کم درجے کے ہیں۔ تحقیق یہی ہے کہ پہلے دو باغ اعلیٰ ہیں جو مقربین کے لیے ہیں اور دوسرے دو باغ ان سے کم درجے والے ہیں جو اصحاب الیمین کے لیے ہیں۔ سورۂ واقعہ میں بھی سابقین کو مقربین قرار دے کر انھیں ملنے والی نعمتوں کا پہلے الگ ذکر فرمایا ہے، اس کے بعد اصحاب الیمین کا ذکر کر کے انھیں ملنے والی نعمتوں کا الگ ذکر فرمایا، یہاں بھی ایسے ہی ہے، تقریباً ہر نعمت میں دونوں کا فرق نمایاں ہے، تفسیر میں اس فرق کی طرف اشارہ آ رہا ہے۔ امام بخاری رحمہ اللہ نے صحیح بخاری میں یہ حدیث ذکر فرمائی ہے کہ عبداللہ بن قیس (ابو موسیٰ اشعری) رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ جَنَّتَانِ مِنْ فِضَّةٍ ، آنِيَتُهُمَا وَمَا فِيْهِمَا، وَجَنَّتَانِ مِنْ ذَهَبٍ آنِيَتُهُمَا وَمَا فِيْهِمَا، وَمَا بَيْنَ الْقَوْمِ وَ بَيْنَ أَنْ يَّنْظُرُوْا إِلٰی رَبِّهِمْ إِلاَّ رِدَاءَ الْكِبْرِ عَلٰی وَجْهِهِ فِيْ جَنَّةِ عَدْنٍ ] [ بخاری التفسیر، باب قولہ : « ومن دونھما جنتان » : ۴۸۷۸ ] ’’دو باغ ایسے ہیں جن کے برتن اور جو کچھ ان دونوں میں ہے چاندی کا ہے اور دو باغ ایسے ہیں جن کے برتن اور جو کچھ ان میں ہے سونے کا ہے۔ اور جنت عدن میں جنتیوں کے درمیان اور ان کے اپنے رب کو دیکھنے کے درمیان کبریائی کی چادر کے سوا کوئی رکاوٹ نہیں جو اس کے چہرے پر ہے۔‘‘ صحیح بخاری میں اس کی سند اس طرح ہے : {’’حَدَّثَنَا عَبْدُ اللّٰهِ بْنُ أَبِي الْأَسْوَدِ، حَدَّثَنَا عَبْدُ الْعَزِيْزِ بْنُ عَبْدِ الصَّمَدِ الْعَمِّيُّ، حَدَّثَنَا أَبُوْ عِمْرَانَ الْجَوْنِيُّ عَنْ أَبِيْ بَكْرِ بْنِ عَبْدِ اللّٰهِ بْنِ قَيْسٍ عَنْ أَبِيْهِ أَنَّ رَسُوْلَ اللّٰهِ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ قَالَ…۔‘‘} فتح الباری (۸؍۶۲۴) میں ہے کہ اسی حدیث کو ابن مردویہ نے (عبد العزیز کے بجائے) {’’حَمَّادٌ عَنْ أَبِيْ عِمْرَانَ‘‘} بیان کیا ہے، اس میں یہ لفظ ہیں : [ مِنْ ذَهَبٍ لِلسَّابِقِيْنَ وَ مِنْ فِضَّةٍ لِلتَّابِعِيْنَ ] یعنی سابقین کے لیے سونے والے اور تابعین کے لیے چاندی والے باغ ہوں گے۔ اور ابوبکر سے ثابت کی روایت میں یہ الفاظ ہیں : [ مِنْ ذَهَبٍ لِلْمُقَرَّبِيْنَ وَ مِنْ فِضَّةٍ لِأَصْحَابِ الْيَمِيْنِ ] یعنی سونے والے باغ مقربین کے لیے اور چاندی والے اصحاب الیمین کے لیے ہیں۔ اس حدیث کے طرق سے واضح ہے کہ پہلے دو باغ مقربین کے لیے ہیں اور دوسرے دو باغ اصحاب الیمین کے لیے ہیں۔"
    },
    {
      "ayah": 47,
      "tafsir": ""
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) {ذَوَاتَاۤ اَفْنَانٍ: ’’ اَفْنَانٍ ‘‘ ’’فَنَنٌ‘‘} کی جمع ہے، سیدھی لمبی شاخ اور {’’ فَنٌّ ‘‘} کی جمع بھی ہے جس کا معنی نوع ہے۔ بہت شاخوں والے سے مراد شاخوں، پتوں اور پھلوں کی کثرت ہے، ورنہ باغوں کی ٹہنیاں تو ہوتی ہی ہیں اور اگر {’’ اَفْنَانٍ ‘‘ ’’فَنٌّ‘‘} کی جمع ہو تو مطلب یہ ہے کہ وہ دونوں باغ بہت سی قسموں کے پودوں اور درختوں والے ہیں۔"
    },
    {
      "ayah": 49,
      "tafsir": ""
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) { فِيْهِمَا عَيْنٰنِ تَجْرِيٰنِ:} چشمے دو قسم کے ہوتے ہیں، ایک وہ جن سے اتنا پانی نکلتا ہے جو آگے بہنے لگتا ہے اور ندی نالے کی صورت اختیار کر لیتا ہے اور ایک وہ جن سے پانی نکلتا ہے مگر اتنا ہی جتنا ان میں سے نکالا جاتا ہے، جیسا کہ زمزم کا چشمہ پھوٹ کر نکلا اور ہاجرہ علیھا السلام نے اس کے گرد ریت وغیرہ کی منڈیر بنا دی تو وہ وہیں رک گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ امِ اسماعیل پر رحم فرمائے، اگر وہ اس کے گرد منڈیر نہ بناتی تو وہ ندی کی صورت میں جاری ہو جاتا۔‘‘ (دیکھیے، بخاری: ۲۳۶۸) مطلب یہ ہے کہ ان دونوں چشموں کا پانی ایک جگہ ٹھہرا ہوا نہیں بلکہ بہ رہا ہے۔"
    },
    {
      "ayah": 51,
      "tafsir": ""
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) {فِيْهِمَا مِنْ كُلِّ فَاكِهَةٍ زَوْجٰنِ:} ہر پھل کی دو قسموں سے مراد یا تو ایک وہ ہے جو دنیا میں تھی اور دوسری وہ جو نہ کسی نے سنی، نہ دیکھی اور نہ کسی کے دل میں اس کا خیال گزرا۔ یا اس سے مراد یہ ہے کہ ایک ہی پھل میں متعدد ذائقے ہوں گے، جیسا کہ دنیا میں آم ہی کو لے لیجیے، ہر آم کا ذائقہ جدا ہے۔ دنیا کے پھلوں کی جنت کے پھلوں سے کوئی نسبت ہی نہیں۔ معلوم ہوتا ہے کہ {’’ زَوْجٰنِ ‘‘} تثنیہ کا لفظ جمع اور کثرت کے معنی کے لیے استعمال ہوا ہے۔ کلامِ عرب میں اس کی بہت سی مثالیں ملتی ہیں۔ {’’التحرير والتنوير‘‘} میں اس کے کئی شواہد ذکر کیے گئے ہیں۔"
    },
    {
      "ayah": 53,
      "tafsir": ""
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ { مُتَّكِـِٕيْنَ عَلٰى فُرُشٍ …: ’’ مُتَّكِـِٕيْنَ ‘‘ ’’وَكِئَ‘‘} سے {’’اِتَّكَأَ يَتَّكِئُ اِتِّكَاءً ‘‘} (افتعال) سے اسم فاعل {’’مُتَّكِئٌ‘‘} کی جمع ہے، پہلو پر کہنی کے سہارے لیٹے ہوئے یا ٹیک لگا کر بیٹھے ہوئے شخص کو کہتے ہیں۔{ ’’ فُرُشٍ‘‘ ’’فِرَاشٌ‘‘} کی جمع ہے، جیسے {’’كِتَابٌ‘‘} کی جمع {’’ كُتُبٌ‘‘} ہے۔ {’’بَطَائِنٌ‘‘ ’’ بِطَانَةٌ ‘‘} کی جمع ہے، گدے کے بیرونی حصے کو {’’ ظِهَارَةٌ ‘‘} اور اندرونی حصے کو {’’بِطَانَةٌ ‘‘} کہتے ہیں۔ اردو میں {’’ بِطَانَةٌ ‘‘} کو استر اور {’’ظِهَارَةٌ ‘‘} کو ابرا کہتے ہیں۔ {’’ اِسْتَبْرَقٍ ‘‘} موٹا ریشم جس میں سونے کی تاریں ہوں۔ یعنی اپنے رب سے ڈرنے والے یہ جنتی بے فکری کے ساتھ ایسے بستروں پر ٹیک لگا کر بیٹھے یا لیٹے ہوں گے جن کے استر موٹے ریشم کے ہوں گے۔ جب استر ایسے ہوں گے تو ابرے کس شان کے ہوں گے۔ ¤ ➋ { وَ جَنَا الْجَنَّتَيْنِ دَانٍ:’’ جَنَا ‘‘ ’’جَنٰي يَجْنِيْ‘‘} (ض) (پھل چننا) سے مصدر بمعنی اسم مفعول ہے، پھل۔ {’’ دَانٍ ‘‘ ’’دَنَا يَدْنُوْ دُنُوًّا ‘‘} (ن) سے اسم فاعل ہے، قریب۔ یعنی دونوں باغوں کا پھل قریب ہو گا، کھڑے، بیٹھے اور لیٹے جب چاہیں گے چن سکیں گے۔"
    },
    {
      "ayah": 55,
      "tafsir": ""
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ { فِيْهِنَّ قٰصِرٰتُ الطَّرْفِ:’’ فِيْهِنَّ ‘‘} کی ضمیر {’’ فُرُشٍ ‘‘} کی طرف جا رہی ہے۔ {’’ قٰصِرٰتُ ‘‘ ’’قَصَرَ يَقْصُرُ قَصْرًا‘‘} (روکنا) سے اسم فاعل ہے، آنکھوں کو خاوندوں پر روک کر رکھنے والیاں۔ جنت کے محلوں، چشموں اور باغوں میں بچھے ہوئے بستروں میں جنتیوں کا دل لگانے والی عورتوں کے ظاہری و باطنی اوصاف اور ان کے کمال و جمال کا بیان ہے۔ اللہ تعالیٰ نے پہلے ان کا معنوی حسن بیان فرمایا کہ ان کی آنکھیں خاوندوں کے سوا کسی اور کی طرف نہیں اٹھیں گے اور نہ ہی ان کی نگاہ میں ان کے خاوندوں سے بڑھ کر کوئی ہو گا۔ حقیقت یہ ہے کہ یہ ایک وصف ہی ہزاروں اوصاف پر بھاری ہے، کوئی عورت کتنی ہی حسین و جمیل ہو، اس وصف سے عاری ہو تو مرد غیور کی نگاہ میں اس کی کچھ قدر و قیمت نہیں رہتی۔ عرب کا ایک شاعر کہتا ہے : ¤ {وَ أَتْرُكُ حُبَّهَا مِنْ غَيْرِ بُغْضٍ ¤ وَ ذَاكَ لِكَثْرَةِ الشُّرَكَاءِ فِيْهِ ¤ إِذَا وَقَعَ الذُّبَابُ عَلٰي طَعَامٍ ¤ رَفَعْتُ يَدِيْ وَ نَفْسِيْ تَشْتَهِيْهِ ¤ وَ تَجْتَنِبُ الْأُسُوْدُ وُرُوْدَ مَاءٍ ¤ إِذَا كَانَ الْكِلَابُ وَلَغْنَ فِيْهِ} ¤ ’’میں اس کی محبت کسی بغض کے بغیر ترک کر رہا ہوں، کیونکہ اس محبت میں اور بھی کئی شریک ہیں۔ جب مکھی کھانے پر آ گرے تو میں اپنا ہاتھ اٹھا لیتا ہوں، حالانکہ میرا دل اسے چاہ رہا ہوتا ہے۔ اور شیر پانی پر آنے سے اجتناب کرتے ہیں، جب کتوں نے اس میں منہ ڈال دیا ہو۔‘‘ ¤ ➋ { لَمْ يَطْمِثْهُنَّ اِنْسٌ قَبْلَهُمْ وَ لَا جَآنٌّ: ’’طَمَثَ يَطْمِثُ طَمْثًا‘‘} (ض) چھونا۔ یعنی وہ عورتیں کنواری ہوں گی، اگر دنیا میں خاوندوں کے پاس رہی ہوں گی تب بھی جنت میں آ کر نئے سرے سے کنواری ہو جائیں گی اور جنت میں ملنے والے خاوندوں سے پہلے کسی نے انھیں چھوا تک نہ ہو گا۔ اصحاب الیمین کو ملنے والی عورتوں کے متعلق اللہ تعالیٰ نے فرمایا : « اِنَّاۤ اَنْشَاْنٰهُنَّ اِنْشَآءً (35) فَجَعَلْنٰهُنَّ اَبْكَارًا (36) عُرُبًا اَتْرَابًا (37) لِّاَصْحٰبِ الْيَمِيْنِ» [ الواقعۃ : ۳۵ تا ۳۸ ] ’’بلاشبہ ہم نے ان( بستروں والی عورتوں) کو پیدا کیا، نئے سرے سے پیدا کرنا۔ پس ہم نے انھیں کنواریاں بنا دیا۔جو خاوندوں کی محبوب، ان کی ہم عمر ہیں۔ دائیں ہاتھ والوں کے لیے۔ ‘‘ پھر مقربین کو ملنے والی بیویوں کامعاملہ تو ان سے کہیں بڑھ کر ہو گا۔ ¤ ➌ اس آیت سے معلوم ہوا کہ انسانوں کی طرح جن بھی جنت میں جائیں گے، وہاں انسانوں کو ان کی جنس سے بیویاں ملیں گی اور جنوں کو ان کی جنس سے، کیونکہ دوسری جنس سے نہ موافقت ہوتی ہے نہ انس،پھر{’’ اَتْرَابًا ‘‘} (مٹی میں کھیلنے والے ہم جولی ) ہونے کا تو سوال ہی پیدا نہیں ہوتا۔"
    },
    {
      "ayah": 57,
      "tafsir": ""
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) {كَاَنَّهُنَّ الْيَاقُوْتُ وَ الْمَرْجَانُ: ’’ الْيَاقُوْتُ ‘‘} سرخ رنگ کا پتھر جو اتنا صاف شفاف ہوتا ہے کہ اس کے درمیان سوراخ میں دھاگا ڈالا جائے تو باہر سے نظر آتا ہے۔ {’’ الْمَرْجَانُ ‘‘} مونگے (چھوٹے موتی) کو کہتے ہیں۔ جنتی عورتوں کی سرخ و سفید رنگت، دلکشی، صفائی اور شفافیت میں انھیں یاقوت اور مرجان سے تشبیہ دی ہے۔ محمد (ابن سیرین)کہتے ہیں : [ إِمَّا تَفَاخَرُوْا وَ إِمَّا تَذَاكَرُوا الرِّجَالُ فِي الْجَنَّةِ أَكْثَرُ أَمِ النِّسَاء ؟ فَقَالَ أَبُوْ هُرَيْرَةَ أَوَ لَمْ يَقُلْ أَبُو الْقَاسِمِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوَّلَ زُمْرَةٍ تَدْخُلُ الْجَنَّةَ عَلٰی صُوْرَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَالَّتِيْ تَلِيْهَا عَلٰی أَضْوَإِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاء ِ لِكُلِّ امْرِءٍ مِّنْهُمْ زَوْجَتَانِ اثْنَتَانِ يُرٰی مُخُّ سُوْقِهِمَا مِنْ وَّرَاءِ اللَّحْمِ وَمَا فِي الْجَنَّةِ عَزَبٌ] [مسلم، الجنۃ و صفۃ نعیمھا، باب أول زمرۃ تدخل الجنۃ : ۲۸۳۴ ] ’’یا تو اس بات پر کہ لوگوں نے عورتوں اور مردوں کے مابین فخر کا ذکر کیا، یا ویسے ہی گفتگو ہوئی کہ جنت میں مرد زیادہ ہوں گے یا عورتیں؟ تو ابوہریرہ رضی اللہ عنہ نے کہا : ’’کیا ابو القاسم صلی اللہ علیہ وسلم نے یہ نہیں فرمایا کہ پہلی جماعت جو جنت میں داخل ہو گی چودھویں کے چاند کی طرح ہو گی اور اس کے بعد والی جماعت آسمان کے سب سے زیادہ روشن چمکدار ستارے کی طرح ہو گی، ان میں سے ہر مرد کی دو بیویاں ہوں گی، جن کی پنڈلیوں کا مغز گوشت کے پار سے نظر آ رہا ہو گا اور جنت میں کوئی شخص بیوی کے بغیر نہیں ہو گا۔ ‘‘انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: [ لَرَوْحَةٌ فِيْ سَبِيْلِ اللّٰهِ أَوْ غَدْوَةٌ خَيْرٌ مِّنَ الدُّنْيَا وَمَا فِيْهَا ، وَلَقَابُ قَوْسِ أَحَدِكُمْ مِّنَ الْجَنَّةِ أَوْ مَوْضِعُ قِيْدٍ يَعْنِيْ سَوْطَهُ خَيْرٌ مِّنَ الدُّنْيَا وَمَا فِيْهَا وَلَوْ أَنَّ امْرَأَةً مِّنْ أَهْلِ الْجَنَّةِ اطَّلَعَتْ إِلٰی أَهْلِ الْأَرْضِ لَأَضَاعَتْ مَا بَيْنَهُمَا وَلَمَلَأَتْهُ رِيْحًا ، وَلَنَصِيْفُهَا عَلٰی رَأْسِهَا خَيْرٌ مِّنَ الدُّنْيَا وَمَا فِيْهَا ] [بخاري، الجھاد و السیر، باب حور العین وصفتہن: ۲۷۹۶ ] ’’اللہ کے راستے میں ایک شام یا ایک صبح دنیا و مافیہا سے بہتر ہے اور جنت میں تمھارے کسی ایک کی ایک کمان یا ایک کوڑے کے برابر جگہ دنیا و مافیہا سے بہتر ہے اور اگر اہلِ جنت کی کوئی عورت زمین والوں کی طرف جھانک لے تو زمین و آسمان کے درمیان کا سارا حصہ روشن ہو جائے اور یہ سارا خلا خوشبو سے بھر جائے اور اس کے سر کا دوپٹا دنیا ومافیہا سے بہتر ہے۔‘‘"
    },
    {
      "ayah": 59,
      "tafsir": ""
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) { هَلْ جَزَآءُ الْاِحْسَانِ اِلَّا الْاِحْسَانُ:} پہلے احسان کا معنی نیکی اور دوسرے احسان کا معنی اس نیکی کا نیک صلہ یعنی جنت ہے۔ حدیثِ جبریل میں رسول اللہ صلی اللہ علیہ وسلم نے احسان کا مطلب یہ بیان فرمایا : [ أَنْ تَعْبُدَ اللّٰهَ كَأَنَّكَ تَرَاهُ ، فَإِنَّكَ إِنْ لَا تَرَاهُ فَإِنَّهُ يَرَاكَ ] [مسلم ، الإیمان ، باب الإیمان ما ھو ؟ … : ۹ ] ’’تو اللہ کی عبادت اس طرح کر گویا تو اسے دیکھ رہا ہے، پھر اگر تو اسے نہیں دیکھتا تو وہ یقینا تجھے دیکھ رہا ہے۔‘‘ ظاہر ہے جس شخص نے اپنی زندگی اپنے پروردگار کو ہر وقت اپنے اوپر نگران ہونے کے یقین اور احتیاط کے ساتھ گزاری اس کا بدلا بھی ایسا ہی اچھا اور خوبصورت ہونا چاہیے، جس کا بیان ان آیات میں ہے۔ اللہ تعالیٰ نے یہاں حصر کے ساتھ جو فرمایا کہ ’’نیکی کا بدلا نیکی کے سوا کیا ہے؟‘‘ تو اس سے عدل و انصاف کے تقاضے کے مطابق بدلا مراد ہے، ورنہ مشرک اور ظالم تو نیکی کا بدلا برائی سے دیتے ہیں، گویا یہ ایک طرح ان پر طنز بھی ہے۔ کفار کے طرزِ عمل کی مثالوں کے لیے دیکھیے سورۂ عنکبوت (66،65)، اعراف (۱۹۰) اور سورۂ واقعہ (۸۲)۔"
    },
    {
      "ayah": 61,
      "tafsir": ""
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) {وَ مِنْ دُوْنِهِمَا جَنَّتٰنِ:} جیسا کہ {’’ وَ لِمَنْ خَافَ مَقَامَ رَبِّهٖ جَنَّتٰنِ ‘‘} کی تفسیر میں گزر چکا ہے کہ پہلی دو جنتیں جن کا ذکر اوپر گزرا، اللہ سے ہمیشہ ڈرنے والے مقربین کے لیے ہیں اور یہاں سے عام اہلِ ایمان یعنی اصحاب الیمین کو ملنے والی جنتوں کا ذکر ہوتا ہے، جو کئی باتوں میں پہلی دونوں جنتوں کے ساتھ مشترک اور کئی باتوں میں ان سے کم تر ہیں۔"
    },
    {
      "ayah": 63,
      "tafsir": ""
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) { مُدْهَآمَّتٰنِ: ’’اِدْهَمَّ يَدْهَمُّ اِدْهِمَامًا‘‘} (افعلال) سیاہ ہونا اور {’’اِدْهَامَّ يَدْهَامُّ اِدْهِيْمَامًا‘‘} (افعیلال) بہت سیاہ ہونا۔ یعنی وہ دونوں باغ گہرے سبز ہوں گے جیسے بہت سیاہ ہوں۔ پہلے دو باغوں میں شاخوں اور پتوں کی کثرت کا ذکر ہے جن کے ضمن میں ان کا گہرا سبز ہونا خود بخود آ جاتا ہے اور یہاں صرف ان کے گہرے سبز رنگ کا ذکر ہے۔"
    },
    {
      "ayah": 65,
      "tafsir": ""
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) { فِيْهِمَا عَيْنٰنِ نَضَّاخَتٰنِ:’’ نَضَخَ يَنْضَخُ نَضْخًا‘‘} (ف) {’’اَلْمَاءُ‘‘} پانی کا جوش سے نکلنا۔ یعنی ان دونوں جنتوں میں دو جوش مارنے والے چشمے ہوں گے۔ {’’ عَيْنٰنِ تَجْرِيٰنِ ‘‘} اور {’’ عَيْنٰنِ نَضَّاخَتٰنِ ‘‘} کے تقابل کے لیے دیکھیے اسی سورت کی آیت (۵۰) کی تفسیر۔"
    },
    {
      "ayah": 67,
      "tafsir": ""
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) { فِيْهِمَا فَاكِهَةٌ وَّ نَخْلٌ وَّ رُمَّانٌ: ”فَاكِهَةٌ“} اسم جنس ہے، اس میں ہر پھل آ جاتا ہے۔ کھجور اور انار بھی {’’ فَاكِهَةٌ ‘‘} میں شامل ہیں، مگر عرب میں ان کی کثرت اور ان کے پسندیدہ پھل ہونے کی وجہ سے ان کا الگ ذکر فرمایا ہے۔ مقربین کے لیے {’’ مِنْ كُلِّ فَاكِهَةٍ زَوْجٰنِ ‘‘} اور اصحاب الیمین کے لیے {’’ فَاكِهَةٌ وَّ نَخْلٌ وَّ رُمَّانٌ ‘‘} فرمایا۔ دونوں کا فرق واضح ہے۔"
    },
    {
      "ayah": 69,
      "tafsir": ""
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) ➊ {فِيْهِنَّ خَيْرٰتٌ حِسَانٌ: ’’ خَيْرٰتٌ ‘‘ ’’خَيْرَةٌ‘‘} کی جمع ہے جو اصل میں ’’یاء‘‘ کی تشدید کے ساتھ {’’خَيِّرَةٌ‘‘} ہے۔ مذکر اس کا {’’خَيِّرٌ‘‘} (بروزن{ فَيْعِلٌ}) ہے، جس میں ’’یاء‘‘ کو تخفیف کے لیے حذف کر دیا ہے، جیسے {’’هَيِّنٌ، لَيِّنٌ ‘‘} اور{’’مَيِّتٌ‘‘} کو {’’هَيْنٌ، لَيْنٌ‘‘} اور {’’مَيْتٌ‘‘} کر دیتے ہیں۔ یہ تفضیل والا {’’خَيْرٌ‘‘} نہیں جو {’’شَرٌّ‘‘} کے مقابلے میں آتا ہے، کیونکہ اس کا اصل {’’ أَخْيَرُ ‘‘} ({ أَفْعَلُ}) ہے۔ {’’ حِسَانٌ ‘‘ ’’حَسْنَاءُ ‘‘} کی جمع ہے۔ {’’ خَيْرٰتٌ ‘‘} نیک، یعنی خوب سیرت اور {’’ حِسَانٌ ‘‘} خوبصورت عورتیں۔ ¤ ➋ یہاں یہ بات زیرِ نظر رہنا ضروری ہے کہ اس جگہ یہ نہیں فرمایا کہ «فِيْهِمَا خَيْرَاتٌ حِسَانٌ» (ان دونوں باغوں میں خوب سیرت و خوبصورت عورتیں ہیں) بلکہ فرمایا : « فِيْهِنَّ خَيْرٰتٌ حِسَانٌ » یعنی ان سب جنتوں میں جن کا ذکر گزرا ہے خوب سیرت اور خوبصورت عورتیں ہیں۔ اس سے ظاہر ہے کہ یہاں جو اوصاف مذکور ہوئے ہیں وہ چاروں جنتوں میں سابقون اور اصحاب الیمین دونوں کو ملنے والی عورتوں میں مشترک ہیں۔"
    },
    {
      "ayah": 71,
      "tafsir": ""
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) ➊ {’’ حُوْرٌ ‘‘ ’’حَوْرَاء‘‘} کی جمع ہے، مادہ اس کا {’’حَوَرٌ‘‘} ہے، ’’گورے رنگ کی عورتیں‘‘ جنھیں دیکھ کر آنکھ حیران رہ جائے اور جن کی آنکھ کی سفیدی بہت سفید اور سیاہی بہت سیاہ ہو۔ [ دیکھیے بخاري : الجھاد والسیر، باب الحور العین و صفتھن، قبل ح: ۲۱۷۵] ¤ ➋ {مَقْصُوْرٰتٌ فِي الْخِيَامِ:} لفظ {’’ حُوْرٌ ‘‘} میں ان کی صورت کا حسن بیان ہوا ہے اور {’’ مَقْصُوْرٰتٌ فِي الْخِيَامِ ‘‘} میں ان کی سیرت کا حسن بیان ہوا ہے۔ معلوم ہوا کہ عورت کی خوبی گھر رکے رہنے میں ہے۔ ان الفاظ میں ان عورتوں کے لیے ہر طرح کی خوش حالی اور نعمت میسر ہونے کا اشارہ بھی ہے، کیونکہ دنیا میں سردار عورتوں کو کسی کی نوکری یا خدمت یا کھیتوں وغیرہ میں کام کرنے کے لیے گھر سے باہر نہیں جانا پڑتا، حتیٰ کہ میل ملاقات کے لیے بھی دوسری عورتیں ہی ان کے پاس آتی ہیں۔ مطلب یہ ہے کہ وہ نہایت معزز اور مخدوم ہیں، جیسا کہ ابو قیس بن الاسلت نے کہا ہے : ¤ {وَيُكْرِمُهَا جَارَاتُهَا فَيَزُرْنَهَا ¤ وَ تَعْتَلُّ عَنْ إِتْيَانِهُنَّ فَتُعْذَرُ} ¤ ’’اس کی پڑوسنیں اس کا اکرام کرتی ہیں، اس لیے اس سے ملنے کے لیے خود آتی ہیں اور یہ ان کے پاس آنے سے کوئی نہ کوئی بہانہ کر دیتی ہے تو اسے قبول کر لیا جاتا ہے۔‘‘ [ التحریر و التنویر ] ¤ ➌ {فِي الْخِيَامِ: ’’ الْخِيَامِ ‘‘ ’’خَيْمَةٌ‘‘} کی جمع ہے، جو عموماً پشم یا بالوں کے بنے ہوئے کپڑے سے بنایا جاتا ہے۔ پھر جتنے خوشحال لوگوں کا ہو اتنا ہی قیمتی، اونچا اور شاندار بنایا جاتا ہے۔ جنت کے خیموں کا وصف رسول اللہ صلی اللہ علیہ وسلم نے بیان فرمایا، عبداللہ بن قیس (ابو موسیٰ اشعری) رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ فِي الْجَنَّةِ خَيْمَةً مِنْ لُؤْلُؤَةٍ مُجَوَّفَةٍ عَرْضُهَا سِتُّوْنَ مِيْلاً فِيْ كُلِّ زَاوِيَةٍ مِّنْهَا أَهْلٌ مَا يَرَوْنَ الْآخَرِيْنَ يَطُوْفُ عَلَيْهِمُ الْمُؤْمِنُوْنَ ] [ بخاري، التفسیر، باب: «حور مقصورات في الخیام » : ۴۸۷۹ ] ’’جنت میں ایک خولدار موتی کا خیمہ ہے جس کا عرض ساٹھ میل ہے، اس کے ہر کونے میں ایک گھر والے ہیں جو دوسروں کو نہیں دیکھتے، مومن ان پر چکر لگائیں گے۔‘‘"
    },
    {
      "ayah": 73,
      "tafsir": ""
    },
    {
      "ayah": 74,
      "tafsir": ""
    },
    {
      "ayah": 75,
      "tafsir": ""
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76) {مُتَّكِـِٕيْنَ عَلٰى رَفْرَفٍ خُضْرٍ وَّ عَبْقَرِيٍّ حِسَانٍ: ’’ رَفْرَفٍ ‘‘} اسم جنس یا اسم جمع ہے، مفرد اس کا {’’رَفْرَفَةٌ‘‘} ہے، منقش قالین جو بستر پر بچھایا جائے۔ {’’ عَبْقَرِيٍّ ‘‘} کوئی بھی چیز جو اپنی جنس میں سب سے فائق اور نادر الوجود ہو۔ اس کی نسبت {’’عَبْقَرٌ‘‘} کی طرف ہے جو جاہلیت کے افسانوں میں جنوں کا شہر تھا، جسے اردو میں پرستان کہتے ہیں۔ عرب میں فوق العادت خوبصورت یا باکمال چیز کی نسبت اس کی طرف کر دیتے تھے، گویا یہ انسانوں کی سرزمین کی نہیں بلکہ جنوں اور پریوں کی سرزمین کی چیز ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے اپنے کنویں سے پانی کھینچنے والے خواب کے ذکر میں فرمایا : [ ثُمَّ أَخَذَهَا عُمَرُ، فَاسْتَحَالَتْ بِيَدِهِ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا فِي النَّاسِ يَفْرِيْ فَرِيَّهُ ] [ بخاري، المناقب، باب علامات النبوۃ في الإسلام : ۳۶۳۴ ] ’’پھر وہ ڈول عمر ( رضی اللہ عنہ ) نے پکڑا تو وہ ایک بڑے ڈول کی شکل میں بدل گیا۔ تو میں نے کوئی نادر قوت والا شخص نہیں دیکھا جو اس جیسی کاٹ کاٹتا ہو۔ ‘‘ اس لیے اس کا ترجمہ شاہ رفیع الدین رحمہ اللہ نے ’’نادر‘‘ کیا ہے اور {’’ حِسَانٍ ‘‘} کا ترجمہ ’’نفیس‘‘ کیا ہے۔ {’’ رَفْرَفٍ ‘‘} کا لفظ مفرد ہے، اس کے مطابق {’’ عَبْقَرِيٍّ ‘‘} صفت مفرد لائی گئی ہے اور اسم جنس یا اسم جمع ہونے کی وجہ سے اس میں جمع کا مفہوم پایا جاتا ہے، اس لیے اس کی صفات {’’ خُضْرٍ ‘‘} اور {’’ حِسَانٍ ‘‘} جمع لائی گئی ہیں۔"
    },
    {
      "ayah": 77,
      "tafsir": ""
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) {تَبٰرَكَ اسْمُ رَبِّكَ ذِي الْجَلٰلِ وَ الْاِكْرَامِ:’’ تَبٰرَكَ ‘‘} باب تفاعل ہے، جب اس میں تشارک مقصود نہ ہو تو مبالغہ مراد ہوتا ہے، یعنی بہت برکت والا ہے تیرے رب کا نام۔ پھر جب اس کا نام بہت برکت والا ہے تو اس کی ذات پاک کس قدر بابرکت ہو گی۔ ثوبان رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز سے فارغ ہوتے تو تین دفعہ استغفار کرتے اور یوں کہتے : [ اَللّٰهُمَّ أَنْتَ السَّلَامُ وَ مِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإِْكْرَامِ ] [ مسلم، المساجد، باب استحباب الذکر بعد الصلاۃ …:۵۹۱ ] ’’اے اللہ! تو ہی سلامتی والا ہے اور تجھی سے سلامتی ہے اے جلال اور اکرام والے!‘‘ اس دعا میں کئی لوگ ان الفاظ کا اضافہ کرتے ہیں : {’’ وَإِلَيْكَ يُرْجَعُ السَّلاَمُ حَيِّنَا رَبَّنَا بِالسَّلاَمِ وَ أَدْخِلْنَا دَارَ السَّلاَمِ ۔‘‘} یہ الفاظ حدیث سے ثابت نہیں ہیں۔ ¤ {’’ ذِي الْجَلٰلِ وَ الْاِكْرَامِ ‘‘} اللہ تعالیٰ کا ایسا بابرکت نام ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اسے کثرت سے پڑھنے کی تاکید فرمائی ہے۔ انس رضی اللہ عنہ فرماتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ أَلِظُّوْا بِيَا ذَا الْجَلاَلِ وَالإِْكْرَامِ ] [ ترمذي، الدعوات، باب : ۳۵۲۴، وقال الألباني صحیح ] {’’ يَا ذَا الْجَلَالِ وَ الإِْكْرَامِ ‘‘} سے چمٹ جاؤ، اسے لازم پکڑ لو۔‘‘ {’’أَلِظُّوْا‘‘ ’’أَلَظَّ يُلِظُّ إِلْظَاظًا‘‘} سے ہے جس کا معنی ’’چمٹ جانا‘‘ ہے۔ رسول اللہ صلی اللہ علیہ وسلم کے اس کو لازم پکڑنے کے حکم سے ظاہر ہو رہا ہے کہ یہ کس قدر بابرکت نام ہے۔"
    }
  ]
}