{
  "surah": "Al-Mujaadila",
  "surah_number": 58,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { قَدْ سَمِعَ اللّٰهُ قَوْلَ الَّتِيْ تُجَادِلُكَ فِيْ زَوْجِهَا :} یہ آیات خولہ بنت ثعلبہ رضی اللہ عنھا کے بارے میں اتریں۔ بعض روایات میں ان کا نام خویلہ اور بعض میں جمیلہ آیا ہے۔ ان کے خاوند اوس بن صامت انصاری رضی اللہ عنہ تھے جو عبادہ بن صامت رضی اللہ عنہ کے بھائی تھے، بوڑھے تھے اور خولہ کے ان سے بچے بھی تھے۔ انھوں نے کسی بات پر ناراض ہو کر ان سے ظہار کر لیا، یعنی یہ کہہ دیا : {’’أَنْتِ عَلَيَّ كَظَهْرِ أُمِّيْ‘‘} ’’تو مجھ پر میری ماں کی پیٹھ کی طرح ہے۔‘‘ جاہلیت میں جو شخص بیوی سے ظہار کرتا وہ اسے ماں ہی کی طرح ہمیشہ کے لیے حرام سمجھ لیتا تھا۔ خولہ کے سامنے تو دنیا اندھیر ہو گئی، اس عمر میں کہاں رہوں گی، بچوں کا کیا کروں گی؟ باپ کے پاس رہے تو ضائع ہو جائیں گے، میرے پاس رہے تو انھیں کہاں سے کھلاؤں گی؟ وہ یہ شکایت لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں۔ سنن ابو داؤد میں ہے کہ خویلہ بنت مالک بن ثعلبہ رضی اللہ عنھا نے کہا کہ میرے خاوند اوس بن صامت رضی اللہ عنہ نے مجھ سے ظہار کر لیا تو میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی، میں آپ صلی اللہ علیہ وسلم کے پاس شکایت کرتی تھی اور رسول اللہ صلی اللہ علیہ وسلم اس کے بارے میں مجھ سے جھگڑتے تھے اور فرماتے تھے : [ اِتَّقِي اللّٰهَ فَإِنَّهُ ابْنُ عَمِّكِ ] ’’اس کے بارے میں اللہ سے ڈر، کیونکہ وہ تمھارا چچا زاد ہے۔‘‘ مگر میں نہیں ٹلی، حتیٰ کہ {’’ قَدْ سَمِعَ اللّٰهُ قَوْلَ الَّتِيْ تُجَادِلُكَ فِيْ زَوْجِهَا ‘‘} سے لے کر کفارہ کے فرض کے بیان تک قرآن نازل ہوا۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَعْتِقُ رَقَبَةً ] ’’وہ ایک گردن آزاد کرے۔‘‘ اس نے کہا : ’’وہ تو اس کے پاس ہے نہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا: [ فَيَصُوْمُ شَهْرَيْنِ مُتَتَابِعَيْنِ ] ’’پھر دو ماہ پے در پے روزے رکھے۔‘‘ اس نے کہا : ’’اے اللہ کے رسول! وہ بڑا بوڑھا ہے، روزے رکھ نہیں سکتا۔‘‘ فرمایا : [ فَلْيُطْعِمْ سِتِّيْنَ مِسْكِيْنًا ] ’’پھر ساٹھ (۶۰) مسکینوں کو کھانا کھلائے۔‘‘ اس نے کہا : ’’اس کے پاس کوئی چیز نہیں جس کا صدقہ کرے۔‘‘ کہتی ہیں کہ اس وقت کھجوروں کا ایک ٹوکرا لایا گیا، میں نے کہا : ’’یا رسول اللہ! میں ایک اور ٹوکرے کے ساتھ اس کی مدد کر دیتی ہوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ قَدْ أَحْسَنْتِ اِذْهَبِيْ فَأَطْعِمِيْ بِهَا عَنْهُ سِتِّيْنَ مِسْكِيْنًا وَارْجِعِيْ إِلٰی ابْنِ عَمِّكِ ] [ أبو داوٗد، الطلاق، باب في الظہار:۲۲۱۴، وقال الألباني حسن ] ’’تم نے بہت اچھا کیا، جاؤ اس کی طرف سے ساٹھ مسکینوں کو کھانا کھلاؤ اور اپنے چچا زاد کے پاس واپس چلی جاؤ۔‘‘ ¤ ➋ { قَدْ سَمِعَ اللّٰهُ:} حرف {’’ قَدْ ‘‘} تحقیق کے لیے آتا ہے اور اس کام کے واقع ہونے کے لیے بھی جس کی توقع کی جا رہی ہو۔ یہاں پہلے معنی کا تو محل نہیں، کیونکہ اللہ تعالیٰ کے سننے میں کسی کو شک نہیں کہ اس کا یقین دلانے کے لیے حرف تحقیق لایا جائے، تو مطلب یہ کہ نبی صلی اللہ علیہ وسلم سے جھگڑا کرنے والی عورت اپنی فریاد سنے جانے کی جو توقع کر رہی تھی اللہ تعالیٰ نے پوری فرما دی۔ سننے سے مراد یہاں صرف سن لینا ہی نہیں بلکہ سننا اور سن کر مراد پوری کرنا ہے، جیسے کہا جاتا ہے کہ اللہ تعالیٰ نے دعا سن لی، یعنی سن کر قبول فرمائی۔ ¤ ➌ { تُجَادِلُكَ فِيْ زَوْجِهَا :} وہ جھگڑا یہی تھا کہ وہ کہتی تھی میرے بارے میں کوئی گنجائش نکالیں، میرے خاوند نے مجھے طلاق نہیں دی، صرف {’’أَنْتِ عَلَيَّ كَظَهْرِ أُمِّيْ‘‘} کہا ہے۔ اب میں بڑھاپے میں کہاں جاؤں اور بچوں کا کیا کروں؟ رسول اللہ صلی اللہ علیہ وسلم اللہ تعالیٰ کی طرف سے کوئی واضح حکم نہ ہونے کی وجہ سے انھیں اکٹھے رہنے کی اجازت نہیں دے رہے تھے۔ ¤ ➍ { وَ تَشْتَكِيْۤ اِلَى اللّٰهِ: ’’ شَكَا يَشْكُوْ شَكْوًي وَشِكَايَةً ‘‘} اپنے دکھ تکلیف کا اظہار کرنا۔ {’’ تَشْتَكِيْۤ ‘‘} (افتعال) میں حروف زیادہ ہونے کی وجہ سے معنی میں مبالغہ ہے، یعنی وہ جھگڑنے والی اللہ تعالیٰ کی جناب میں بہت شکایت کر رہی تھی اور اپنے دکھ درد کا شدت سے اظہار کر رہی تھی۔ ¤ ➎ {وَ اللّٰهُ يَسْمَعُ تَحَاوُرَكُمَا اِنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ: ’’ اِنَّ  ‘‘} تعلیل کے لیے ہوتا ہے۔ اور اللہ تم دونوں کی گفتگو سن رہا تھا، کیونکہ اللہ تو سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔ ’’سمع‘‘ (سننا) وہ صفت ہے جس کے ساتھ آوازوں کا علم ہوتا ہے اور ’’ بصر‘‘ (دیکھنا) وہ صفت ہے جس کے ساتھ نظر آنے والی چیزوں کا علم ہوتا ہے۔ یونان کے مشرک فلاسفہ سے متاثر ہو کر بعض مسلم متکلمین نے ان کا یہ قاعدہ مان لیا کہ محل حوادث حادث ہوتا ہے۔ اس کا نتیجہ یہ ہوا کہ ان کے لیے اللہ تعالیٰ کو سمیع و بصیر ماننا ممکن نہ رہا، کیونکہ اگر مانا جائے کہ اللہ تعالیٰ تمام آوازوں کو سنتا ہے اور تمام چیزوں کو دیکھتا ہے تو سنائی دینے والی اور نظر آنے والی چیزیں تو حادث ہیں، نئی سے نئی وجود میں آتی ہیں، اگر اللہ تعالیٰ سنتا اور دیکھتا ہو تو وہ محل حوادث ہوگا اور ان کے قاعدے کے مطابق خود بھی حادث ہو گا، ہمیشہ سے اور قدیم نہیں ہوگا، اس لیے انھوں نے اللہ تعالیٰ کے سننے، دیکھنے، کلام کرنے اور ایسی تمام صفات کا یا تو انکار کر دیا جن میں حدوث پایا جاتا ہے یا ان کی ایسی تاویل کردی جو درحقیقت انکار ہی ہے۔ اکثر مفسرین نے یہی روش اختیار کی ہے۔ تفسیر جلالین کو دیکھ لیجیے، وہ لکھتے ہیں: {’’ اِنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ ‘‘ عَالِمٌ ‘‘} حالانکہ سب جانتے ہیں کہ سننا، دیکھنا اور جاننا تینوں الگ الگ صفات ہیں، صرف عالم مان لینے سے سمیع و بصیر نہیں مانا جا سکتا اور یہ قاعدہ کہ ’’محل حوادث حادث ہوتا ہے‘‘ قرآن مجید کے صریح الفاظ سے ٹکراتا ہے، اس لیے غلط ہے۔ مزید تفصیل کے لیے دیکھیے سورۂ رحمن کی آیت (۲۹) : «كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ » کی تفسیر۔ اگر کوئی کہے کہ اگر اللہ تعالیٰ کو سمیع و بصیر مانیں تو وہ بندوں کی مثل ٹھہرتا ہے تو اس کا جواب یہ ہے کہ جب {’’عليم‘‘} ماننے سے وہ بندوں جیسا نہیں ٹھہرتا، حالانکہ اللہ تعالیٰ نے ’’علیم ‘‘ کا لفظ بندوں پر بھی بولا ہے : « اِنَّا نُبَشِّرُكَ بِغُلٰمٍ عَلِيْمٍ» [ الحجر : ۵۳ ] (بے شک ہم تجھے ایک علیم لڑکے کی خوش خبری دیتے ہیں) تو سمیع و بصیر ماننے سے بندوں کی مثل کیسے بن جائے گا؟ مزید دیکھیے سورۂ شوریٰ کی آیت (۱۱) : « لَيْسَ كَمِثْلِهٖ شَيْءٌ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ » کی تفسیر۔ ¤ ➏ ام المومنین عائشہ رضی اللہ عنھا نے فرمایا : [ اَلْحَمْدُ لِلّٰهِ الَّذِيْ وَسِعَ سَمْعُهُ الْأَصْوَاتَ، لَقَدْ جَاءَتِ الْمُجَادِلَةُ إِلَی النَّبِيِّ صَللَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَ أَنَا فِيْ نَاحِيَةِ الْبَيْتِ، تَشْكُوْ زَوْجَهَا وَمَا أَسْمَعُ مَا تَقُوْلُ فَأَنْزَلَ اللّٰهُ : « قَدْ سَمِعَ اللّٰهُ قَوْلَ الَّتِيْ تُجَادِلُكَ فِيْ زَوْجِهَا» ] [ ابن ماجہ، المقدمۃ، باب فیما أنکرت الجھمیۃ : ۱۸۸ ] ’’سب تعریف اللہ کے لیے ہے جس کی سماعت تمام آوازوں پر وسیع ہے، وہ جھگڑنے والی عورت نبی صلی اللہ علیہ وسلم کے پاس آئی جب کہ میں گھر کے ایک طرف موجود تھی، وہ اپنے خاوند کی شکایت کر رہی تھی اور میں وہ نہیں سنتی تھی جو وہ کہہ رہی تھی، تو اللہ تعالیٰ نے یہ آیات نازل فرمائیں : « قَدْ سَمِعَ اللّٰهُ قَوْلَ الَّتِيْ تُجَادِلُكَ فِيْ زَوْجِهَا » ’’یقینا اللہ نے اس عورت کی بات سن لی جو تجھ سے اپنے خاوند کے بارے میں جھگڑ رہی تھی۔‘‘ اس حدیث سے ظاہر ہے کہ صحابہ کرام اللہ تعالیٰ کے سننے کا کیا مطلب سمجھتے تھے۔ اس لیے امام ابن ماجہ نے اپنی سنن کے شروع ہی میں یہ حدیث اس باب میں ذکر فرمائی ہے جس کا عنوان ہے : {’’ بَابٌ فِيْمَا أَنْكَرَتِ الْجَهْمِيَّةُ‘‘} ’’یہ باب ان چیزوں کو ثابت کرنے کے لیے ہے جن کا جہمیہ نے انکار کیا ہے۔‘‘ اور امام بخاری نے اپنی صحیح بخاری کی {’’ كِتَابُ التَّوْحِيْدِ‘‘} کے {’’بَابُ قَوْلِ اللّٰهِ تَعْالٰي : « وَ كَانَ اللّٰهُ سَمِيْعًۢا بَصِيْرًا » ‘‘} کے تحت اسے اللہ تعالیٰ کی صفت سمع و بصر ثابت کرنے کے لیے ذکر فرمایا ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { اَلَّذِيْنَ يُظٰهِرُوْنَ مِنْكُمْ مِّنْ نِّسَآىِٕهِمْ مَّا هُنَّ اُمَّهٰتِهِمْ …: ’’ يُظٰهِرُوْنَ ‘‘ ’’ظَهْرٌ‘‘} سے نکلا ہے جس کا معنی ’’پیٹھ ‘‘ ہے۔ عرب سواری کو {’’ظَهْرٌ‘‘} کہتے ہیں۔ یہ استعارہ ہے، جس میں بیوی سے جماع کو گھوڑے وغیرہ کی پشت پر سوار ہونے کے ساتھ تشبیہ دی گئی ہے۔ {’’أَنْتِ عَلَيَّ كَظَهْرِ أُمِّيْ‘‘} (تو مجھ پر میری ماں کی پپیٹھ کی طرح ہے) کا مطلب یہ ہے کہ جس طرح میرے لیے اپنی ماں پر سوار ہونا اور اس سے جماع حرام ہے، اسی طرح تم بھی میرے لیے میری ماں کی طرح ہو۔ جاہلیت میں لوگ بیوی کو ماں کہہ دیتے تو اسے ماں کی طرح حرام قرار دے لیتے تھے، اللہ تعالیٰ نے اس رسمِ بد کو ختم کر دیا، فرمایا منہ کے ساتھ بیوی کو ماں کہنے سے وہ ماں نہیں بن جاتی، آدمی کی ماں وہی ہے جس نے اسے جنم دیا ہے۔ مزید دیکھیے سورۂ احزاب (۴) کی تفسیر۔ ¤ ➋ { وَ اِنَّهُمْ لَيَقُوْلُوْنَ مُنْكَرًا مِّنَ الْقَوْلِ وَ زُوْرًا: ’’ مُنْكَرًا ‘‘ ’’أَنْكَرَ يُنْكِرُ‘‘} (افعال) سے اسم مفعول ہے، وہ بات جسے انسانی طبیعت یا عقل یا شرع نہ پہچانتی ہو بلکہ اس کا انکار کرتی ہو۔ {’’ زُوْرًا ‘‘} جھوٹ۔ یعنی بیوی کو ماں کی طرح کہنے والے ایسی بات کہتے ہیں جو نہ انسانی طبیعت مانتی ہے، نہ عقل اور نہ ہی شرع، کیونکہ ماں کے ساتھ بیٹے کا رشتہ اکرام و احترام کا ہے، جبکہ بیوی کے ساتھ خاوند کا رشتہ ایک خاص تعلق کا ہے جو ماں کے ساتھ سوچا بھی نہیں جا سکتا۔ پھر جس عورت نے آدمی کو جنم ہی نہیں دیا بلکہ اس کا اس کے ساتھ مباشرت کا تعلق رہا، اسے ماں کہنا بری بات اور کتنا بڑا جھوٹ ہے۔ ¤ ➌ { وَ اِنَّ اللّٰهَ لَعَفُوٌّ غَفُوْرٌ:} یعنی اللہ تعالیٰ تمھاری کوتاہیوں اور غلطیوں کے باوجود ان سے بہت درگزر کرنے والا اور ان پر پردہ ڈالنے والا ہے۔ خصوصاً جب غلطی کرنے والا پلٹ آئے اور توبہ کر کے آئندہ ایسی باتوں سے باز رہے۔ ¤ ➍ اس آیت میں کئی چیزیں ظہار کے حرام ہونے پر دلالت کر رہی ہیں، پہلی اللہ تعالیٰ کا یہ کہنا کہ {’’ مَا هُنَّ اُمَّهٰتِهِمْ ‘‘} (وہ ان کی مائیں نہیں)، اس میں ظہار کرنے والے کو جھوٹا قرار دیا ہے، دوسری اور تیسری یہ کہ اللہ نے ان کا نام منکراور زُور رکھا ہے اور چوتھی اللہ تعالیٰ کا فرمان {’’ اِنَّ اللّٰهَ لَعَفُوٌّ غَفُوْرٌ ‘‘} ہے، کیونکہ عفو و مغفرت گناہ ہی سے ہوتی ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {وَ الَّذِيْنَ يُظٰهِرُوْنَ مِنْ نِّسَآىِٕهِمْ ثُمَّ يَعُوْدُوْنَ لِمَا قَالُوْا … : ’’ ثُمَّ يَعُوْدُوْنَ لِمَا قَالُوْا ‘‘} کی تفسیر میں بعض حضرات نے فرمایا کہ اس کا مطلب یہ ہے کہ جو لوگ اپنی بیویوں سے ظہار کریں ان پر پہلی بار کوئی مؤاخذہ نہیں، البتہ اگر یہی بات دوبارہ کریں تو ان پر یہ کفارہ ہے، مگر یہ بات اس لیے درست نہیں کہ آیت جس واقعہ پر نازل ہوئی اس میں خاوند نے خولہ رضی اللہ عنھا کو ایک ہی بار {’’ أَنْتِ عَلَيَّ كَظَهْرِ أُمِيِّ ‘‘} کہا تھا۔ دوسری مرتبہ یا بار بار ایسا کہنے کا کہیں ذکر نہیں، اس لیے آیت کا وہی مطلب درست ہو گا جو صحیح حدیث کے مطابق ہو۔ چنانچہ {’’ يَعُوْدُوْنَ لِمَا قَالُوْا ‘‘} کا مطلب فراء اور بعض مفسرین نے تویہ لیا ہے کہ یہاں ’’لام‘‘ بمعنی {’’ عَنْ ‘‘} ہے، یعنی پھر وہ اپنی اس بات سے رجوع کریں جو انھوں نے کہی ہے، تو ان پر یہ کفارہ ہے اور بعض نے فرمایا کہ یہاں ’’ لام ‘‘ {’’إِلٰی‘‘} کے معنی میں ہے، کلام میں کچھ عبارت حذف بھی ہے اور {’’ مَا قَالُوْا ‘‘} کامطلب {’’ مَا حَرَّمُوْا ‘‘} ہے : {’’ أَيْ ثُمَّ يَعُوْدُوْنَ إِلٰي تَحْلِيْلِ مَا حَرَّمُوْا‘‘} ’’یعنی پھر دوبارہ لوٹیں اس کو حلال کرنے کی طرف جسے انھوں نے حرام کہا ہے۔‘‘ رہی یہ بات کہ اللہ تعالیٰ نے یہاں الفاظ میں ابہام کیوں رکھا ہے تو اس کا جواب یہ ہے کہ ماں کہنے کے بعد پھر اس سے بیوی والا معاملہ کرنا ایک قسم کی کراہت رکھتا ہے، اس لیے اس کا ذکر کرتے ہوئے اللہ تعالیٰ نے صراحت کے بجائے کنایہ سے کام لیا ہے۔ ¤ ➋ ظہار کا کفارہ مقرر کرنے سے ظاہر ہے کہ یہ طلاق نہیں بلکہ بیوی کو اپنے آپ پر حرام قرار دینے کے قبیل سے ہے۔ عام معاملات میں حلال کو اپنے آپ پر حرام کرنے کا کفارہ وہی ہے جو قسم کا کفارہ ہے (دیکھیے تحریم : 2،1) مگر منکر و زور بات ہونے کی وجہ سے ظہار کا کفارہ سخت ہے۔ اب ظہار کرنے والے کے سامنے دو ہی صورتیں ہیں، اگر وہ بیوی سے قطع تعلق پر مصر ہے تو زیادہ سے زیادہ چار ماہ تک اس کا انتظار کیا جائے گا کہ کفارہ ادا کر کے دوبارہ تعلق استوار کر لے (دیکھیے بقرہ : ۲۲۶) پھر اسے کہا جائے گا کہ یا اسے طلاق دو یا کفارہ ادا کر کے اسے بیوی بنا کر رکھو۔ پھر اگر وہ اپنی بات سے رجوع پر تیار ہو تو کفارہ بالترتیب تین چیزوں میں سے ایک چیز ہے، اگر آدمی کے پاس طاقت ہو تو ہاتھ لگانے یعنی جماع سے پہلے ایک گردن آزاد کرے۔ یہ شرط اس لیے لگائی ہے کہ بیوی کے پاس جانے کی رغبت میں اس کے لیے اتنا بھاری جرمانہ آسان ہو جائے گا۔ ¤ ➌ {فَتَحْرِيْرُ رَقَبَةٍ مِّنْ قَبْلِ اَنْ يَّتَمَآسَّا: ’’ رَقَبَةٍ ‘‘} کا معنی گردن ہے، مراد لونڈی یا غلام ہے، یعنی جز بول کر کل مراد لیا گیا ہے، تو ظہار کا کفارہ یہ ہے کہ اگر آدمی کے پاس طاقت ہو تو ایک دوسرے کو ہاتھ لگانے سے پہلے ایک لونڈی یا غلام آزاد کرے۔ پہلے کی شرط اس لیے لگائی ہے کہ بیوی کے پاس جانے کی رغبت میں اس کے لیے اتنا بھاری جرمانہ آسان ہو جائے گا۔ ¤ ➍ { ذٰلِكُمْ تُوْعَظُوْنَ بِهٖ:} یعنی ہاتھ لگانے سے پہلے گردن آزاد کرنے کا حکم اس لیے دیا ہے کہ اس سے تمھیں آئندہ کے لیے نصیحت ہوگی کہ ایسا کام نہیں کیا کرتے۔ ¤ ➎ { وَ اللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ:} یعنی اگر تم ظہار کے بعد گردن آزاد کیے بغیر ایک دوسرے کو ہاتھ لگاؤ گے تو کسی اور کو خبر ہو یا نہ ہو اللہ تعالیٰ تمھارے ہر کام سے پوری طرح باخبر ہے، تم نہ اس سے چھپ سکتے ہو اور نہ اس کی گرفت سے بچ سکتے ہو۔ ¤ ➏ بیوی کو ماں کی طرح اپنے آپ پر حرام ٹھہرانے پر جو کفارہ ہے اگر اسے بہن یا بیٹی یا کسی بھی ایسی عورت کی طرح حرام کہہ دے جس سے نکاح حرام ہے تو اس پر بھی وہی کفارہ ہے، کیونکہ نکاح کی حرمت میں ان کے درمیان کوئی فرق نہیں، اس لیے جو حکم ماں کہنے کا ہے وہی سب کا ہو گا۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {فَمَنْ لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِنْ قَبْلِ اَنْ يَّتَمَآسَّا:} اس سے معلوم ہوا کہ اگر گردن آزاد کرنے کی طاقت ہے تو روزوں سے یا کھانا کھلانے سے کفارہ ادا نہیں ہوگا۔ ¤ ➋ { فَمَنْ لَّمْ يَسْتَطِعْ:} پھر جو شخص ہاتھ لگانے سے پہلے دو ماہ کے پے در پے روزے رکھنے کی طاقت نہ رکھے وہ ساٹھ مسکینوں کو کھانا کھلائے۔ ظہار کرنے والا خواہ کمزوری کی وجہ سے پے در پے اتنے روزے نہ رکھ سکتا ہو یا شدت شہوت کی وجہ سے اتنے دن صبر نہ کر سکتا ہو، {’’ فَمَنْ لَّمْ يَسْتَطِعْ ‘‘} میں دونوں شامل ہیں، جیسا کہ سلمہ بن صخر بیاضی رضی اللہ عنہ نے اپنی بیوی کو ماہِ رمضان گزرنے تک کے لیے ماں کہہ دیا، پھر کسی رات اس سے جماع کر بیٹھے اور رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ حَرِّرْ رَقَبَةً ] ’’ایک گردن آزاد کرو۔‘‘ انھوں نے اپنی گردن پر ہاتھ مار کر کہا : ’’اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث فرمایا! میرے پاس اس گردن کے سوا کوئی گردن نہیں۔‘‘ فرمایا : [ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ ] ’’پھر دو ماہ پے در پے روزے رکھ۔‘‘ انھوں نے کہا : ’’مجھ پر روزوں ہی کی وجہ سے تو یہ مصیبت آئی ہے۔‘‘ فرمایا : [ فَأَطْعِمْ وَ سَقًا مِنْ تَمْرٍ بَيْنَ سِتِّيْنَ مِسْكِيْنًا ] [ أبو داوٗد، کتاب الطلاق، باب في الظہار : ۲۲۱۳ ] ’’پھر ساٹھ مسکینوں میں ایک وسق کھجور تقسیم کر دو۔‘‘ ¤ ➌ { فَاِطْعَامُ سِتِّيْنَ مِسْكِيْنًا:} اس سے معلوم ہواکہ ایک ہی مسکین کو ساٹھ دن کھا نا کھلانے سے یا ساٹھ دنوں کا کھانا دینے سے یہ کفارہ ادا نہیں ہوگا، بلکہ ساٹھ مسکینوں کو کھانا کھلانا پڑے گا، خواہ ایک وقت میں کھلا دے یا مختلف وقتوں میں۔ آیت کے الفاظ کے مطابق اس کا بلا تکلف مطلب یہ ہے کہ ساٹھ مسکینوں کو ایک دفعہ پیٹ بھر کر کھانا کھلا دے۔ (شوکانی) ¤ ➍ { ذٰلِكَ لِتُؤْمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ:} اللہ اور اس کے رسول پر ایمان سے مراد ان کے احکام کے سچا ہونے پر یقین رکھنا اور ان پر عمل کرنا ہے، کیونکہ ایمان میں تصدیق، اقرار اور عمل تینوں چیزیں شامل ہیں۔ ¤ ➎ { وَ تِلْكَ حُدُوْدُ اللّٰهِ:} یعنی ظہار کا حرام ہونا اور اس سے رجوع کی صورت میں اس پر کفارہ لازم ہونا اللہ تعالیٰ کی مقرر کردہ حدود ہیں، جن سے تجاوز حرام ہے۔ ¤ ➏ { وَ لِلْكٰفِرِيْنَ عَذَابٌ اَلِيْمٌ: ’’اَلْكَافِرِيْنَ‘‘} انکار کرنے والے۔ معلوم ہوا کہ جو لوگ اللہ کے حکموں کو نہیں مانتے وہ حقیقت میں کافر ہیں، چاہے دنیوی احکام میں اور مردم شماری کی رُو سے مسلمانوں میں شمار ہوتے ہوں۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { اِنَّ الَّذِيْنَ يُحَآدُّوْنَ اللّٰهَ وَ رَسُوْلَهٗ …: ’’ يُحَآدُّوْنَ ‘‘ ’’حَدٌّ‘‘} سے مشتق ہے جس کا معنی جانب ہے۔ باب مفاعلہ عموماً مقابلہ کے معنی کے لیے آتا ہے، یعنی جو لوگ اللہ اور اس کے رسول کی مخالفت کرتے ہیں، اللہ اور اس کے رسول ایک جانب ہوں تو وہ ان کے مقابلے میں دوسری جانب ہوتے ہیں۔ {’’ كُبِتُوْا ‘‘ ’’كَبَتَ يَكْبِتُ كَبْتًا‘‘} (ض) ذلیل کرنا، ہلاک کرنا، لعنت کرنا، دھکے دے کر نکال دینا۔ اللہ تعالیٰ نے شروع سورت سے یہاں تک ظہار کی حرمت اور اس کے کفارہ کے احکام بیان فرمائے اور بتایا کہ یہ احکام اس لیے مقرر کیے گئے ہیں کہ لوگ ظہار اور اس جیسی بری رسوم سے باز آ جائیں جن کے وہ جاہلیت میں عادی تھے، تاکہ وہ اللہ اور اس کے رسول کی پیروی کے خوگر ہو جائیں اور ان کے احکام پر اخلاص کے ساتھ عمل کریں۔ اس کے بعد فرمایا کہ جو لوگ اللہ اور اس کے رسول کی مخالفت کریں گے، ان کے احکام کی نافرمانی کریں گے اور ان کے مقابلے پر اتر آئیں گے انھیں دنیا میں ذلیل کیا جائے گا، جس طرح ان قوموں کو ذلیل کیا گیا جنھوں نے ان سے پہلے اللہ اور اس کے رسولوں کی مخالفت کی اور یہ احکام اللہ کی مقرر کردہ حدود ہیں اور ان کا انکار کرنے والوں کے لیے ذلیل کرنے والا عذاب ہے۔ ¤ ➋ { ’’ كُبِتُوْا ‘‘} ماضی مجہول کا صیغہ ہے، لفظی معنی ہے ’’ذلیل کیے گئے۔‘‘ مراد یہ ہے کہ ’’ذلیل کیے جائیں گے۔‘‘ آئندہ ہونے والی بات کو ماضی کے صیغے کے ساتھ اس لیے فرمایا کہ اس کا ہونا اتنا یقینی ہے کہ سمجھو یہ کام ہو ہی چکا ہے۔ اس میں کفار کے لیے وعید اور مسلمانوں کے لیے خوش خبری ہے۔ چنانچہ ایسا ہی ہوا کہ بدر اور دوسرے معرکوں میں کفار اور ان کے مددگار یہود و منافقین بری طرح ذلیل ہوئے، انھیں شکستوں پر شکستیں ہوئیں اورانھیں قتل، قید، مال و اولاد سے محرومی، غلامی اور جلا وطنی کی ذلتیں اٹھانا پڑیں، حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم کی زندگی ہی میں مکہ فتح ہو گیا۔ پھر پورے جزیرۂ عرب پر اسلام کے مکمل غلبے کے ساتھ کفار و منافقین پر ذلت و رسوائی کی مہر ثبت ہو گئی اور آپ صلی اللہ علیہ وسلم کی وفات کے بعد آپ کے خلفاء کے ہاتھوں مشرق سے مغرب تک اسلام غالب ہوا اور کفار و منافقین ذلیل و رسوا ہوئے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {يَوْمَ يَبْعَثُهُمُ اللّٰهُ جَمِيْعًا …:} اس کا تعلق پچھلی آیت کے آخری جملے {’’ وَ لِلْكٰفِرِيْنَ عَذَابٌ مُّهِيْنٌ ‘‘} سے ہے، یعنی ان کافروں کے لیے اس دن بھی رسوا کرنے والا عذاب ہے جب اللہ تعالیٰ ان سب کو جمع فرمائے گا، پھر وہ جو کرتے رہے اس سے انھیں آگاہ کرے گا، تاکہ وہ اس کا نتیجہ بھگتنے کے لیے تیار ہو جائیں۔ ¤ ➋ { اَحْصٰىهُ اللّٰهُ وَ نَسُوْهُ :} یہ اس سوال کا جواب ہے کہ ہزاروں لاکھوں سالوں کے بعد اگر سب لوگوں کو زندہ کر بھی لیا گیا تو انھوں نے جو کچھ کیا اسے مدتیں گزر چکی ہوں گی، اللہ تعالیٰ اتنی بے شمار مخلوق کے بے شمار اعمال انھیں کیسے بتائے گا؟ فرمایا وہ اپنا کیا ہوا بے شک بھول چکے ہوں، مگر اللہ تعالیٰ نے وہ سب کچھ محفوظ کر رکھا ہے۔ مزید دیکھیے سورۂ کہف (۴۹) کی تفسیر۔ ¤ ➌ { وَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ شَهِيْدٌ:} کیو نکہ اللہ تعالیٰ سے کوئی چیز چھپی نہیں رہ سکتی، وہ ہر چیز کا مشاہدہ کر رہا ہے۔ (دیکھیے مائدہ : ۱۱۷۔ نجم : ۱۷) اگلی آیت میں اس کی مزید تاکید ہے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { اَلَمْ تَرَ:} اس کے لیے دیکھیے سورۂ فیل کی پہلی آیت اور سورۂ نور کی آیت (۴۱) کی تفسیر۔ ¤ ➋ { اَنَّ اللّٰهَ يَعْلَمُ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ:} یعنی اللہ تعالیٰ ان کے اعمال ہی کو نہیں بلکہ آسمان و زمین کی ہر چھوٹی بڑی چیز کو جانتا ہے۔ ¤ ➌ یہاں سے آیت (۱۹) تک مسلسل منافقین کے طرز عمل پر گرفت کی گئی ہے۔ ¤ ➍ {مَا يَكُوْنُ مِنْ نَّجْوٰى ثَلٰثَةٍ اِلَّا هُوَ رَابِعُهُمْ …: ’’ نَجَا يَنْجُوْ نَجْوًا وَنَجْوٰي وَ نَاجٰي مُنَاجَاةً وَ نِجَاءً، الرَّجُلَ ‘‘} کسی آدمی سے اپنے دل کی بات دوسروں سے چھپا کر کرنا۔ {’’ نَجْوٰى ‘‘} اس سے اسم مصدر ہے، سرگوشی۔ زیادہ تر اس کا استعمال برے کاموں کی سرگوشیوں اور سازشوں کے لیے ہوتا ہے، مثلاً چوری، ڈاکے، قتل یا کسی کو نقصان پہنچانے کے لیے خفیہ مشورہ کرنا۔ خیر کے کاموں میں اس کا استعمال کم ہوتا ہے، کیونکہ عموماً انھیں چھپانے کی ضرورت نہیں ہوتی۔یعنی تھوڑے سے تھوڑے یا زیادہ سے زیادہ لوگوں کی کوئی مجلس، کوئی سرگوشی اور کوئی خفیہ سے خفیہ مشورہ نہیں ہوتا جو اللہ تعالیٰ سے مخفی ہو اور اللہ تعالیٰ ان کے ساتھ نہ ہو، بلکہ جو بھی تین آدمی چھپ کر مشورہ کر رہے ہوں ان ان کے ساتھ چوتھا اللہ تعالیٰ ہوتا ہے اور جو بھی پانچ آدمی چھپ کر مشورہ کر رہے ہوں ان کے ساتھ چھٹا اللہ تعالیٰ ہوتا ہے اور اس سے کم یا زیادہ جہاں بھی ہوں اللہ ان کے ساتھ ہوتا ہے اور اللہ تعالیٰ ہر چیز کو پوری طرح جاننے والا ہے۔ {’’ اِلَّا هُوَ مَعَهُمْ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ حدید (۴)کی تفسیر۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { اَلَمْ تَرَ اِلَى الَّذِيْنَ نُهُوْا عَنِ النَّجْوٰى …:} یہاں سے یہود اور منافقین کے طرز عمل پر گرفت کا آغاز ہو رہا ہے، جو انھوں نے اختیار کر رکھا تھا۔ یہود نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ صلح کا معاہدہ کر رکھا تھا اور آپ کی مجلسوں میں آتے جاتے تھے اور منافقین بظاہر ایمان لا چکے تھے اور مسلمانوں کی جماعت کے فرد تھے، مگر ان کی دوستی یہود ہی کے ساتھ تھی۔ منافقین اور یہود نے اندر ہی اندر اپنا الگ جتھا بنا رکھا تھا، انھیں جب بھی موقع ملتا خفیہ مجالس میں مسلمانوں کے اندر پھوٹ ڈالنے، فتنہ برپا کرنے اور مشرکین سے مل کر مسلمانوں کو نقصان پہنچانے کے منصوبے بناتے۔ اگر رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں آتے تو آپس میں کھسر پھسر کرتے رہتے، جس سے مجلس کی بے وقعتی ہوتی اور اس بات کا اظہار ہوتا کہ انھیں رسول اللہ صلی اللہ علیہ وسلم اور آپ کے ساتھیوں کی باتوں سے کوئی دلچسپی نہیں۔ بعض اوقات وہ آپس میں سرگوشی کرتے ہوئے کسی مسلمان کو دیکھ کر آپس میں آنکھ مارتے، تاکہ وہ سمجھے کہ وہ اس کے متعلق کوئی بات کر رہے ہیں۔ مسلمانوں کو ان کے اس رویے سے سخت تکلیف ہوتی۔ رسول اللہ صلی اللہ علیہ وسلم نے انھیں ایسی مجالس سے منع کیا جن میں وہ اسلام اور مسلمانوں کے خلاف خفیہ مشورے اور سازشیں کرتے تھے اور مسلمانوں کی مجلسوں میں علیحدہ سرگوشیوں سے بھی منع کیا، مگر وہ باز نہ آئے تو اللہ تعالیٰ نے قرآن مجید میں یہ آیات نازل فرما کر ان پر اپنی ناراضی کا اظہار فرمایا۔ ¤ ➋ { وَ يَتَنٰجَوْنَ بِالْاِثْمِ وَ الْعُدْوَانِ وَ مَعْصِيَتِ الرَّسُوْلِ:} اللہ تعالیٰ نے بتایا کہ ان کے خفیہ مشورے اور سرگوشیاں یا تو ایسے گناہوں پر مشتمل ہوتی تھیں جن کا تعلق ان کی ذات سے تھا یا ایسے گناہوں پر جن میں دوسروں پر ظلم و زیادتی ہوتی، یا پھر ان کی سرگوشیاں رسول اللہ صلی اللہ علیہ وسلم کی نافرمانی پر مشتمل ہوتی تھیں۔ ¤ ➌ { وَ اِذَا جَآءُوْكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللّٰهُ: ’’حَيِيَ يَحْيٰ حَيَاةً‘‘} ({خَشِيَ يَخْشٰي}) زندہ ہونا۔ {’’ حَيّٰي يُحَيِّيْ تَحِيَّةً ‘‘} (تفعیل) زندگی اور سلامتی کی دعا دینا، سلام کہنا۔ (دیکھیے نساء : ۸۶) یعنی جب یہ یہودی اور ان کے ہم نوا منافقین آپ صلی اللہ علیہ وسلم کے پاس آتے ہیں تو ایسے الفاظ کے ساتھ آپ کو سلام کہتے ہیں جن کے ساتھ اللہ تعالیٰ نے آپ کو سلام نہیں کہا۔ اللہ تعالیٰ کے آپ صلی اللہ علیہ وسلم کو سلام کا ذکرِ خاص اس آیت میں ہے : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا صَلُّوْا عَلَيْهِ وَ سَلِّمُوْا تَسْلِيْمًا» [الأحزاب : ۵۶ ] ’’اے لوگو جو ایمان لائے ہو! اس پر صلوٰۃ بھیجو اور سلام بھیجو، خوب سلام بھیجنا۔‘‘ اور ذکرِ عام اس آیت میں ہے : « قُلِ الْحَمْدُ لِلّٰهِ وَ سَلٰمٌ عَلٰى عِبَادِهِ الَّذِيْنَ اصْطَفٰى » [ النمل : ۵۹ ] ’’کہہ دے سب تعریف اللہ کے لیے ہے اور سلام ہے اس کے ان بندوں پر جنھیں اس نے چن لیا۔‘‘ یہودی آپ کو {’’اَلسَّلاَمُ عَلَيْكُمْ‘‘} کے بجائے {’’اَلسَّامُ عَلَيْكُمْ‘‘} (تم پر موت ہو) کہتے۔ آیت سے معلوم ہوتا ہے کہ منافقین نے بھی یہود کی دیکھا دیکھی یہ کام شروع کر دیا تھا، جیسا کہ انھوں نے یہود سے سیکھ کر آپ صلی اللہ علیہ وسلم کو متوجہ کرنے کے لیے استعمال ہونے والا لفظ {’’ رَاعِنَا ‘‘} گالی کے طور پر استعمال کرنا شروع کر دیا تھا، جس سے اللہ تعالیٰ نے منع فرما دیا اور اس کے بجائے {’’ انْظُرْنَا ‘‘} کہنے کا حکم دیا۔ (دیکھیے بقرہ : ۱۰۴) عائشہ رضی اللہ عنھا بیان کرتی ہیں کہ کچھ یہودی لوگ نبی صلی اللہ علیہ وسلم کے پاس آئے اور انھوں نے کہا : [ اَلسَّامُ عَلَيْكَ يَا أَبَا الْقَاسِمِ ! ] ’’اے ابو القاسم! تجھ پر موت ہو۔‘‘آپ صلی اللہ علیہ وسلم نے فرمایا : [ وَعَلَيْكُمْ ] ’’اور وہ تمھی پر ہو۔‘‘ عائشہ رضی اللہ عنھا کہتی ہیں میں نے کہا : [ بَلْ عَلَيْكُمُ السَّامُ وَالذَّامُ ] ’’بلکہ تم پر موت اور مذمت ہو۔‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَا عَائِشَةُ! لَا تَكُوْنِيْ فَاحِشَةً ] ’’اے عائشہ! نازیبا الفاظ کہنے والی نہ بن۔‘‘ عائشہ رضی اللہ عنھا نے کہا : ’’آپ نے وہ نہیں سنا جو انھوں نے کہا ہے؟‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَوَ لَيْسَ قَدْ رَدَدْتُ عَلَيْهِمُ الَّذِيْ قَالُوْا، قُلْتُ وَعَلَيْكُمْ ] ’’تو کیا میں نے وہ بات انھی پر لوٹا نہیں دی جو انھوں نے کہی ہے؟ میں نے کہہ دیا {’’وَعَلَيْكُمْ ‘‘} کہ ’’وہ تمھی پر ہو۔‘‘ تو اللہ عزوجل نے یہ آیت نازل فرما دی : «وَ اِذَا جَآءُوْكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللّٰهُ» ’’اور جب تیرے پاس آتے ہیں تو (ان لفظوں کے ساتھ) تجھے سلام کہتے ہیں جن کے ساتھ اللہ نے تجھے سلام نہیں کہا۔‘‘ [ مسلم، السلام، باب النھي عن ابتداء أھل الکتاب بالسلام… : ۱۱ /۲۱۶۵۔ مسند أحمد : ۶ /۲۲۹، ۲۳۰، ح : ۲۵۹۷۸ ] ¤ ➍ {وَ يَقُوْلُوْنَ فِيْۤ اَنْفُسِهِمْ لَوْ لَا يُعَذِّبُنَا اللّٰهُ بِمَا نَقُوْلُ …:} اور وہ اپنے دل میں یا آپس کی مجلس میں اسے رسول اللہ صلی اللہ علیہ وسلم کے رسول نہ ہونے کی دلیل قرار دیتے تھے کہ اگر یہ رسول ہوتے تو یہ الفاظ کہتے ہوئے ہم پر عذاب آ جاتا۔ حالانکہ رسول اللہ صلی اللہ علیہ وسلم کے سچا ہونے کے لیے یہی دلیل کافی تھی کہ اللہ تعالیٰ نے آپ کو ان کی اس حرکت سے آگاہ کر دیا۔ رہا عذاب، تو اللہ تعالیٰ کا یہ طریقہ نہیں کہ وہ گناہ پر اسی وقت گرفت فرمائے، اس نے تو ان لوگوں کو بھی مہلت دے رکھی ہے جو اسے گالی دیتے ہیں، تاکہ وہ یہ نہ کہہ سکیں کہ ہمیں مہلت نہیں ملی اور اس نے ہر کام کی طرح ان کے عذاب کے لیے بھی ایک وقت مقرر کر رکھا ہے۔ چنانچہ مرنے کے بعد ان کے لیے جہنم کا عذاب تیار ہے اور وہ انھیں کافی ہے، اس کے ہوتے ہوئے کسی اور سزا کی ضرورت نہ رہے گی۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِذَا تَنَاجَيْتُمْ … :} جیسا کہ آیت (۷) کے فوائد میں گزرا کہ {’’نَجْوٰی‘‘} کا لفظ عموماً برے مقاصد کے لیے سرگوشیوں پر استعمال ہوتا ہے جو حرام ہیں، لیکن بعض اوقات{ ’’نَجْوٰي‘‘} (خفیہ مشورہ) اچھے مقاصد کے لیے بھی ہو سکتا ہے، اس کی اجازت ہے بلکہ اس کی ترغیب دی گئی ہے اور یہ باعث اجر ہے۔ (دیکھیے نساء : ۱۱۴) اس آیت میں ایمان کا دعویٰ کرنے والوں کو گناہ، زیادتی اور رسول اللہ صلی اللہ علیہ وسلم  کی نافرمانی والی سرگوشیوں اور خفیہ مجلسوں سے منع فرمایا، کیونکہ یہ ایمان کے دعویٰ کے خلاف ہے اور نیکی اور تقویٰ والی سرگوشیوں کی اجازت بلکہ نصیحت فرمائی۔ رسول اللہ صلی اللہ علیہ وسلم نے سرگوشی کی ہر ایسی صورت سے منع فرمایا جس سے کسی مسلمان کی دل آزاری ہوتی ہو۔ عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا كُنْتُمْ ثَلاَثَةً فَلاَ يَتَنَاجٰی رَجُلاَنِ دُوْنَ الْآخَرِ حَتّٰی تَخْتَلِطُوْا بِالنَّاسِ، أَجْلَ أَنْ يُّحْزِنَهُ ]] [بخاري، الاستئذان، باب إذا کانوا أکثر من ثلاثۃ فلا بأس بالمسارّۃ المناجاۃ : ۶۲۹۰۔ مسلم : ۲۱۸۴ ] ’’جب تم تین آدمی ہو تو دو آدمی تیسرے کے بغیر آپس میں سرگوشی نہ کریں، یہاں تک کہ تم دوسرے لوگوں کے ساتھ مل جاؤ، کیونکہ یہ چیز اسے غمگین کرے گی۔‘‘ اس حدیث سے معلوم ہوا کہ اگر تین سے زیادہ آدمی ہوں تو کوئی دو آدمی آپس میں سرگوشی کر سکتے ہیں۔ البتہ چار یا پانچ یا زیادہ آدمی ایک شخص کو اکیلے چھوڑ کر الگ سرگوشی کریں تو اس اکیلے کا غمگین اور پریشان ہونا تو لازمی بات ہے، اس لیے اس حدیث کے مطابق وہ بھی ناجائز ہے۔ تین آدمیوں میں سے دو اگر ایسی زبان میں بات شروع کر دیں جو تیسرا نہیں جانتا تو اس حدیث کے مطابق وہ بھی جائز نہیں۔ ہاں، اگر دو آدمی تیسرے سے اجازت لے کر آپس میں سرگوشی کر لیں تو یہ جائز ہے، جیسا کہ ابن عمر رضی اللہ عنھما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا كُنْتُمْ ثَلاَثَةً فَلاَ يَتَنَاجَ اثْنَانِ دُوْنَ الثَّالِثِ إِلاَّ بِإِذْنِهِ فَإِنَّ ذٰلِكَ يُحْزِنُهُ  ] [مسند أحمد: 146/2، ح : ۶۳۳۸۔ مصنف عبد الرزاق، ح : ۱۹۸۰۶، وسندہ صحیح ] ’’جب تم تین آدمی ہو تو دو آدمی تیسرے کے بغیر سرگوشی نہ کریں، مگر اس کی اجازت کے ساتھ، کیونکہ یہ چیز اسے غمگین کرے گی۔‘‘"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) { اِنَّمَا النَّجْوٰى مِنَ الشَّيْطٰنِ لِيَحْزُنَ الَّذِيْنَ اٰمَنُوْا … : ’’حَزِنَ يَحْزَنُ‘‘} (س) غمگین ہونا اور {’’حَزَنَ يَحْزُنُ ‘‘} (ن) غمگین کرنا۔ اس میں مسلمانوں کو تسلی دلائی ہے کہ یہود و منافقین کی یہ سرگوشیاں دراصل شیطان کی کار ستانی ہے، جس سے وہ ایمان والوں کو غمگین کرنا چاہتا ہے۔ اگر تم ایسی کوئی بات دیکھو تو زیادہ پریشان ہونے کی ضرورت نہیں، کیونکہ اللہ تعالیٰ کا حکم نہ ہو تو شیطان تمھارا کچھ نہیں بگاڑ سکتا اور نہ ان سرگوشیوں سے تمھارا کچھ نقصان ہو سکتا ہے، اس لیے اللہ ہی پر توکل رکھو اور غمگین ہو کر شیطان کو خوش ہونے کا موقع نہ دو۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِذَا قِيْلَ لَكُمْ تَفَسَّحُوْا … :} پچھلی آیات میں مجلس کے آداب میں سے سرگوشی سے ممانعت کا ادب بیان ہوا، اس آیت میں اس کے مزید کچھ آداب بیان ہوئے ہیں۔ ان آداب کی ضرورت اس لیے پڑی کہ رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں ہر شخص آپ کے زیادہ سے زیادہ قریب رہنے کی خواہش رکھتا تھا، جس سے مجلس میں تنگی پیش آتی تھی۔ اللہ تعالیٰ نے یہ ادب سکھایا کہ جب حاضرینِ مجلس کی سہولت کے لیے کہا جائے کہ کھل جاؤ، تاکہ سب لوگ آسانی سے کھلے ہو کر بیٹھ سکیں تو کھل جاؤ، صرف میر مجلس کے قرب کے پیش نظر ایک دوسرے کے اوپر چڑھ کر بیٹھے رہنے پر اصرار نہ کرو۔ اسی طرح اگر مجلس میں کچھ اور لوگ آجائیں اور ان کی جگہ بنانے کے لیے کھل جانے کے لیے کہا جائے تو کھل جاؤ اور دل میں تنگی محسوس نہ کرو۔ ¤ ➋ { يَفْسَحِ اللّٰهُ لَكُمْ: ’’ يَفْسَحِ ‘‘} فعل مضارع معلوم ہے جو {’’ تَفَسَّحُوْا ‘‘} امر کا جواب ہونے کی وجہ سے مجزوم ہے، آگے ملانے کے لیے اسے کسرہ دیا گیا ہے، یعنی تم مجلس میں کشادگی کرو گے تو اللہ تعالیٰ تمھارے لیے فراخی کر دے گا، اس فراخی میں سب سے پہلی فراخی تودل کی فراخی ہے کہ خوش دلی سے کھل جاؤ گے تو دلوں کی تنگی دور ہوگی اور ان میں بھائیوں کے لیے وسعت پیدا ہوگی۔ اس کے علاوہ بھی اللہ تعالیٰ دنیا و آخرت کے ہر معاملے میں تمھیں فراخی عطا فرمائے گا، کیونکہ ہر عمل کا بدلا اسی جیسا ہوتا ہے، جیسا کہ عثمان بن عفان رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ بَنٰی مَسْجِدًا لِلّٰهِ بَنَی اللّٰهُ لَهُ فِي الْجَنَّةِ مِثْلَهُ ] [مسلم، المساجد، باب فضل بناء المساجد والحث علیھا: ۲۵ /۵۳۳۔ بخاري: ۴۵۰ ] ’’جو شخص اللہ کے لیے مسجد بنائے اللہ اس کے لیے اس کی مثل جنت میں (گھر) بنائے گا۔‘‘ اور ابو ہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ نَفَّسَ عَنْ مُّؤْمِنٍ كُرْبَةً مِّنْ كُرَبِ الدُّنْيَا نَفَّسَ اللّٰهُ عَنْهُ كُرْبَةً مِّنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ يَسَّرَ عَلٰی مُعْسِرٍ يَسَّرَ اللّٰهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ وَمَننْ سَتَرَ مُسْلِمًا سَتَرَهُ اللّٰهُ فِي الدُّنْيَا وَالْآخِرَةِ وَاللّٰهُ فِيْ عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِيْ عَوْنِ أَخِييْهِ ] [مسلم، الذکر، باب فضل الاجتماع علی تلاوۃ القرآن وعلی الذکر : ۲۶۹۹ ] ’’جو شخص کسی مومن سے دنیا کی مصیبتوں میں سے کوئی مصیبت دور کرے اللہ تعالیٰ اس سے قیامت کے دن کی مصیبتوں میں سے کوئی مصیبت دور فرمائے گا۔ اور جو کسی تنگی والے پر آسانی کرے اللہ تعالیٰ اس پر دنیا اور آخرت میں آسانی کرے گا اور جو شخص کسی مسلم (کے عیبوں) پر پردہ ڈالے اللہ تعالیٰ دنیا اور آخرت میں اس (کے عیبوں) پر پردہ ڈالے گا اور اللہ تعالیٰ بندے کی مدد میں ہوتا ہے جب تک بندہ اپنے بھائی کی مدد میں ہوتا ہے۔‘‘ ¤ ➌ {وَ اِذَا قِيْلَ انْشُزُوْا فَانْشُزُوْا: ’’ نَشَزَ يَنْشِزُ نَشْزًا‘‘ (ض،ن) ’’اَلرَّجُلُ عَنْ مَّكَانِهٖ‘‘} آدمی کا اپنی جگہ سے اٹھ کھڑے ہونا۔ جب کہا جائے اٹھ کھڑے ہو جاؤ تو اٹھ کھڑے ہو جاؤ، یعنی جب مجلس کا امیر یا مجلس کے منتظمین حاضرین میں سے کسی کے علم و فضل اور شرف و مرتبہ کے پیش نظر اسے امیر کے قریب لانے کے لیے کسی کو اس کی جگہ سے اٹھ جانے کے لیے کہیں تو اسے چاہیے کہ اٹھ جائے اور اپنے دل میں کوئی تنگی یا ملال نہ لائے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لِيَلِنِيْ مِنْكُمْ أُوْلُو الْأَحْلَامِ وَالنُّهٰی ثُمَّ االَّذِيْنَ يَلُوْنَهُمْ ثُمَّ الَّذِيْنَ يَلُوْنَهُمْ ] [مسلم، الصلاۃ، باب تسویۃ الصفوف و إقامتہا …: ۴۳۲ ] ’’تم میں سے میرے قریب وہ لوگ ہوں جو سمجھ اور عقل والے ہوں، پھر جو ان سے (سمجھ اور عقل میں) قریب ہوں۔‘‘ اسی طرح اگر امیر کسی شخص سے یا کچھ لوگوں سے مشورہ کرنے کے لیے یا ان کی بات سننے کے لیے کسی کو اس کی جگہ سے اٹھ جانے کے لیے کہے تو اسے کسی ملال کے بغیر اٹھ جانا چاہیے۔ یہ ادب اس لیے مقرر فرمایا کہ بعض اوقات عام سمجھ والے مسلمان رسول اللہ صلی اللہ علیہ وسلم سے محبت کی وجہ سے یا منافقین اپنے خبثِ باطن کی وجہ سے رسول اللہ صلی اللہ علیہ وسلم کے قریب ساری جگہ گھیر لیتے، پھر کوئی بزرگ صحابی مثلاً ابوبکر و عمر رضی اللہ عنھما وغیرہ آتے تو ان کے لیے جگہ نہ چھوڑتے اور اگر اٹھنے کے لیے کہا جاتا تو برا مناتے۔ ظاہر ہے اگر اس ادب کا خیال نہ رکھا جائے تو کسی امیر کی کوئی مجلس صحیح طریقے سے چل ہی نہیں سکتی۔ اسی طرح اگر امیر مجلس کو برخاست کر دے اور سب کو اٹھ جانے کے لیے کہے تو انھیں اٹھ جانا چاہیے اور اس میں اپنی توہین محسوس نہیں کرنی چاہیے۔ ¤ ➍ {يَرْفَعِ اللّٰهُ الَّذِيْنَ اٰمَنُوْا …: ’’ يَرْفَعِ ‘‘} فعل مضارع ہے جو {’’ فَانْشُزُوْا ‘‘} امر کا جواب ہونے کی وجہ سے مجزوم ہے، کسرہ اسے آگے ملانے کے لیے دیا گیا ہے۔ یعنی جب تم سے کہا جائے کہ اٹھ کھڑے ہو جاؤ تو اٹھ کھڑے ہو جاؤ۔ جب تم اللہ کا حکم سمجھ کر تواضع اختیار کرو گے اور اٹھنے میں کسی طرح کی توہین یا کسرِ شان کا خیال دل میں نہیں لاؤ گے تو اللہ تعالیٰ تم میں سے ان لوگوں کو درجوں میں بلند کر دے گا جو ایمان لائے، کیونکہ ایمان کا تقاضا تواضع ہے اور ایمان اور کبر کبھی جمع نہیں ہو سکتے۔ عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِيْ قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِّنْ كِبْرٍ وَلاَ يَدْخُلُ النَّارَ مَنْ كَانَ فِيْ قَلْبِهِ مِثْقَالُ خَرْدَلٍ مِّنْ إِيْمَانٍ ] [ أبو داوٗد، اللباس، باب ما جاء في الکبر : ۴۰۹۱، وقال الألباني صحیح ] ’’وہ شخص جنت میں داخل نہیں ہو گا جس کے دل میں رائی کے دانے کے برابر کبر ہوگا اور وہ شخص آگ میں داخل نہیں ہو گا جس کے دل میں رائی کے برابر ایمان ہوگا۔‘‘ ¤ ➎ {يَرْفَعِ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ:} بظاہر یہاں الفاظ یہ ہونے چاہییں تھے کہ {’’يَرْفَعِ اللّٰهُ الَّذِيْنَ نَشَزُوْا مِنْكُمْ‘‘} یعنی ’’(جب تمھیں کہا جائے کہ اٹھ کھڑے ہو جاؤ تو اٹھ کھڑے ہو جاؤ) تو اللہ تعالیٰ ان لوگوں کو جو اٹھ کھڑے ہوں گے درجات میں بلند کر دے گا‘‘ مگر اللہ تعالیٰ نے منافقین کو نکالنے کے لیے {’’ اٰمَنُوْا مِنْكُمْ ‘‘} کی قید لگا دی کہ منافقین اس حکم پر اٹھ کھڑے ہوں تب بھی انھیں رفع درجات کا شرف حاصل نہیں ہو سکتا، ان کا ٹھکانا {’’الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِ ‘‘} (آگ کا سب سے نچلا درجہ) ہی ہے۔ دیکھیے سورۂ نساء ( ۱۴۵)۔ ¤ ➏ {وَ الَّذِيْنَ اُوْتُوا الْعِلْمَ دَرَجٰتٍ:} یہ {’’ الَّذِيْنَ اٰمَنُوْا ‘‘} ہی کی صفت ہے، کیونکہ اللہ تعالیٰ نے تمام صحابہ کرام رضی اللہ عنھم کو {’’ الَّذِيْنَ اُوْتُوا الْعِلْمَ ‘‘} قرار دیا ہے۔ دیکھیے سورۂ محمد (۱۶) کی تفسیر اور ایمان کا ادنیٰ سے ادنیٰ درجہ بھی علم کے بغیر حاصل نہیں ہو سکتا، جیسا کہ فرمایا: « فَاعْلَمْ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا اللّٰهُ  » [ محمد : ۱۹ ] ’’پس جان لے کہ حقیقت یہ ہے کہ اللہ کے سوا کوئی معبود نہیں۔‘‘ہاں علم اور ایمان کے مدارج میں کمی بیشی ہوتی ہے۔ اسی طرح جنت میں علم کے لحاظ سے اہلِ ایمان کے مدارج میں بلندی ہوگی۔ عبداللہ بن عمرو رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُقَالُ لِصَاحِبِ الْقُرْآنِ اقْرَأْ وَارْتَقِ وَ رَتِّلْ كَمَا كُنْتَ تُرَتِّلُ فِي الدُّنْيَا فَإِنَّ مَنْزِلَكَ عِنْدَ آخِرِ آيَةٍ تَقْرَؤُهَا ] [ أبو داوٗد، الوتر، باب کیف یستحب الترتیل في القراء ۃ : ۱۴۶۴، وقال الألباني حسن صحیح ] ’’قرآن والے شخص سے کہا جائے گا پڑھ اور چڑھتا جا اور ٹھہر ٹھہر کر پڑھ جس طرح تو دنیا میں ٹھہر ٹھہر کر پڑھتا تھا، تیرا مقام آخری آیت کے پاس ہے جسے تو پڑھے گا۔ ‘‘ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ يَرْفَعُ بِهٰذَا الْكِتَابِ أَقْوَامًا وَيَضَعُ بِهِ آخَرِيْنَ ] [ مسلم، صلاۃ المسافرین، باب فضل من یقوم بالقرآن ویعلمہ… : ۸۱۷، عن عمر رضی اللہ عنہ ] یعنی اللہ تعالیٰ ان لوگوں کو جو ایمان لائے اور جنھیں علم دیا گیا درجات میں بلندی عطا فرمائے گا، وہ جس قدر ایمان اور علم میں زیادہ ہوں گے اتنے ہی درجوں میں بلند ہوں گے۔ اس آیت سے علم کی فضیلت ثابت ہوتی ہے۔ ¤ ➐ یہاں ایک سوال ہے کہ اللہ تعالیٰ نے {’’ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ ‘‘} اور {’’ وَ الَّذِيْنَ اُوْتُوا الْعِلْمَ ‘‘} کو عطف کے ساتھ ذکر فرمایا ہے، جو مغایرت کے لیے ہوتا ہے، تو یہ دونوں ایک ہی موصوف کی صفت کیسے ہو سکتے ہیں؟ جواب اس کا یہ ہے کہ یہاں موصوف میں مغایرت مراد نہیں صفات میں مغایرت مراد ہے اور بعض اوقات ایک ہی موصوف کی صفات اس طرح بھی لائی جاتی ہیں، جیسا کہ سورۂ اعلیٰ میں ہے: « سَبِّحِ اسْمَ رَبِّكَ الْاَعْلَى (1) الَّذِيْ خَلَقَ فَسَوّٰى (2) وَ الَّذِيْ قَدَّرَ فَهَدٰى (3) وَ الَّذِيْۤ اَخْرَجَ الْمَرْعٰى » [ الأعلٰی : ۱ تا ۴ ] ’’اپنے رب کے نام کی تسبیح کر جو سب سے بلند ہے۔ وہ جس نے پیدا کیا، پس درست بنایا۔ اور وہ جس نے اندازہ ٹھہرایا، پھر ہدایت کی۔ اور وہ جس نے چارا اُگایا۔‘‘ ¤ ➑ {وَ اللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ:} یعنی اللہ تعالیٰ تمھارے تمام اعمال سے پوری طرح باخبر ہے کہ تم اٹھنے کا حکم ملنے پر خوش دلی سے اٹھ کھڑے ہوتے ہو یا نفاق اور کبر کی وجہ سے مجبوراً اٹھتے ہو اور وہ تمھیں تمھارے عمل کے مطابق ہی جزا دے گا۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِذَا نَاجَيْتُمُ الرَّسُوْلَ …:} ہر مسلمان نبی صلی اللہ علیہ وسلم سے مناجات اور خلوت میں گفتگو کی خواہش رکھتا تھا، جس سے نبی صلی اللہ علیہ وسلم کو مشقت اٹھانا پڑتی تھی۔ اس پر مزید منافقین کا رویہ تھا کہ انھوں نے محض اپنی بڑائی جتانے کے لیے نبی صلی اللہ علیہ وسلم سے سرگوشیاں شروع کر دیں۔ ایک ایک آدمی آپ کا خاصا وقت لے جاتا، اس سے دوسرے لوگوں کو تکلیف ہوتی، کیونکہ انھیں عام فائدہ اٹھانے کا موقع نہ ملتا، خود نبی صلی اللہ علیہ وسلم پر بھی ان کا یہ طرز عمل شاق گزرتا، مگر آپ مروّت و اخلاق کی وجہ سے کسی کو منع نہ فرماتے۔ اس پر اللہ تعالیٰ نے حکم دیا کہ جو شخص بھی آپ صلی اللہ علیہ وسلم سے علیحدگی میں گفتگو کرنا چاہے وہ اس سے پہلے صدقہ دے کر آئے، البتہ نادار مسلمانوں کے لیے گنجائش رکھی کہ اگر صدقہ کرنے کے لیے تمھارے پاس کچھ نہ ہو اور تمھیں علیحدگی میں گفتگو کرنا ضروری ہو تو اللہ تعالیٰ غفور و رحیم ہے۔ منافقین عموماً مال دار تھے مگر سخت بخیل تھے،لہٰذا انھوں نے بخل کی وجہ سے علیحدگی میں گفتگو کر کے آپ کا وقت ضائع کرنا ترک کر دیا۔ ¤ ➋ { ذٰلِكَ خَيْرٌ لَّكُمْ وَ اَطْهَرُ:} یعنی اس حکم کا مقصد صرف رسول اللہ صلی اللہ علیہ وسلم سے مشقت ہٹانا نہیں بلکہ تمھاری تربیت بھی ہے کہ جب بھی تمھیں رسول اللہ صلی اللہ علیہ وسلم سے علیحدگی میں گفتگو کی خواہش ہوگی اور ہر بار اس سے پہلے تم صدقہ کرو گے تو اس سے فقراء کا فائدہ ہو گا اور تمھیں خرچ کرنے کی عادت پڑے گی، بخل کی کمینگی دور ہو گی، مال میں برکت ہوگی، آفات و مصائب اور جہنم سے حفاظت ہوگی اور اموال و قلوب کو طہارت حاصل ہوگی۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ { ءَاَشْفَقْتُمْ اَنْ تُقَدِّمُوْا بَيْنَ يَدَيْ نَجْوٰىكُمْ صَدَقٰتٍ:} اس سے ظاہر ہے کہ اس حکم کے بعد رسول اللہ صلی اللہ علیہ وسلم کے ساتھ علیحدگی میں گفتگو کا رجحان، جو بہت بڑھ گیا تھا، رک گیا۔ منافقین اپنے بخل کی وجہ سے رک گئے اور مخلص مسلمان، جو نادار تھے، غربت کی وجہ سے محتاط ہو گئے۔ ¤ ➋ { فَاِذْ لَمْ تَفْعَلُوْا وَ تَابَ اللّٰهُ عَلَيْكُمْ:} اس سے معلوم ہوتا ہے کہ اس حکم کے نزول کے بعد کسی نے نہ تو رسول اللہ صلی اللہ علیہ وسلم سے کوئی رازدارانہ بات کرنے کی جرأت کی اور نہ اس مقصد کے لیے صدقہ دینے کی نوبت آئی، بلکہ انھیں احساس ہوگیا کہ رسول اللہ صلی اللہ علیہ وسلم سے رازدارانہ گفتگو کے بارے میں ان کی روش اللہ تعالیٰ کو پسند نہیں آئی، اس لیے وہ اس پر نادم ہوئے اور اپنے رویے سے باز آگئے۔ {’’ وَ تَابَ اللّٰهُ عَلَيْكُمْ ‘‘} یعنی اللہ تعالیٰ نے بھی ان پر مہربانی فرمائی اور آپ سے مناجات سے پہلے صدقے کا حکم منسوخ کر دیا۔ ¤ ➌ {فَاَقِيْمُوا الصَّلٰوةَ وَ اٰتُوا الزَّكٰوةَ … :} یعنی جب یہ وقتی حکم تم سے اٹھا لیا گیا تو ان احکام کی پابندی کرتے رہو جن پر عمل تمھارے لیے ہمیشہ لازم ہے۔ ان میں سب سے اہم نماز اور زکوٰۃ ہے، اس کے ساتھ اللہ اور اس کے رسول کے ہر حکم کی اطاعت پر کار بند رہو اور یہ بات ہمیشہ پیشِ نظر رکھو کہ اللہ تعالیٰ تمھارے ہر عمل سے پوری طرح باخبر ہے۔ ¤ ➍ یہ حکم اگرچہ منسوخ ہو گیا مگر اس سے جو مقصود تھا وہ حاصل ہوگیا، مسلمان تو آپ صلی اللہ علیہ وسلم سے محبت اور آپ کے ادب کی وجہ سے علیحدگی میں لمبی گفتگو سے اجتناب کرنے لگے اور منافقین اس خوف سے کہ ہم نے ایسا کیا تو ہمارا نفاق کھل جائے گا اور ہم پہچان لیے جائیں گے۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { اَلَمْ تَرَ اِلَى الَّذِيْنَ تَوَلَّوْا قَوْمًا غَضِبَ اللّٰهُ عَلَيْهِمْ:} اس آیت میں منافقین کے تین اوصاف بیان کرتے ہوئے ان کی حالت پر تعجب کا اظہار کیا گیا ہے، ان میں سے پہلا وصف یہ ہے کہ ایمان کے دعوے کے باوجود ان کی دوستی ان لوگوں کے ساتھ ہے جو ایمان والوں کے بد ترین دشمن ہیں اور جن پر اللہ کا غضب ہوا ہے۔ اگرچہ تمام کفار ہی پر اللہ کا غضب ہے اور منافقین تمام کفار سے دوستی کرتے تھے، مگر {’’مَغْضُوْبٌ عَلَيْهِمْ‘‘} خاص طور پر یہود کا لقب ہے، جیسا کہ {’’ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ ‘‘} کی تفسیر میں گزر چکا ہے۔ مزید دیکھیے سورۂ بقرہ (۶۱،۹۰)، آل عمران (۱۱۲)، اعراف (۱۵۲)، مائدہ (۶۰) اور سورۂ ممتحنہ (۱۳) حالانکہ اللہ تعالیٰ نے ایمان والوں کو یہود و نصاریٰ اور کفار کی دوستی سے صریح الفاظ میں منع فرمایا ہے۔ تفصیل کے لیے دیکھیے سورۂ آل عمران (۲۸)، نساء (۱۴۴)، مائدہ (۵۱)اور سورہ توبہ (۲۳) ۔ ¤ ➋ { مَا هُمْ مِّنْكُمْ وَ لَا مِنْهُمْ:} یہ منافقین کا دوسرا وصف ہے کہ بظاہر مسلمان ہونے کے باوجود فی الواقع وہ تم میں سے نہیں ہیں، کیونکہ اگر وہ حقیقی مومن ہوتے تو کفار کو کبھی دوست نہ بناتے۔ (دیکھیے مائدہ : ۸۱) اور اسی طرح وہ یہود میں سے بھی نہیں، کیونکہ وہ انھیں بھی حق پر نہیں سمجھتے، ان کی دوستی محض غرض کی دوستی ہے کہ اگر مسلمانوں پر کوئی گردش آئی تو ان کی دوستی کام آئے گی۔ دیکھیے سورۂ نساء (143،142) کی تفسیر۔ ¤ ➌ { وَ يَحْلِفُوْنَ عَلَى الْكَذِبِ وَ هُمْ يَعْلَمُوْنَ:} یعنی یہ جانتے ہوئے بھی کہ وہ جھوٹ بول رہے ہیں جھوٹ بولتے ہیں اور اس پر قسمیں بھی کھاتے ہیں۔ اس جھوٹ سے مراد ایک تو مومن ہونے کا دعویٰ ہے۔ (دیکھیے منافقون: ۱۔ توبہ : ۵۶) پھر مختلف اوقات میں اللہ اور اس کے رسول اور مسلمانوں کے خلاف ان کے کسی قول یا فعل پر جب گرفت کی جاتی تو وہ جھوٹ بول دیتے کہ ہم نے یہ بات نہیں کہی، نہ یہ کام کیا ہے اور اس پر قسمیں کھا جاتے۔ (دیکھیے توبہ : ۶۲، ۷۴، 96،95۔ منافقون : 7،6) سیرت کی کتابوں میں ایسے بہت سے واقعات مذکور ہیں۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) { اَعَدَّ اللّٰهُ لَهُمْ عَذَابًا شَدِيْدًا … :} عذابِ شدید سے مراد {’’ الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِ ‘‘} ہے۔ دیکھیے سورۂ نساء (۱۴۵)۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {اِتَّخَذُوْۤا اَيْمَانَهُمْ جُنَّةً … :} یعنی ایک طرف انھوں نے اپنی جانیں اور اپنے مال بچانے کے لیے مسلمان ہونے کی جھوٹی قسموں کو ڈھال بنا رکھا ہے اور دوسری طرف وہ مسلمانوں کے اندر رہ کر جب موقع ملتا ہے شکوک و شبہات پیدا کر کے بہت سے لوگوں کو جہاد فی سبیل اللہ سے روک دیتے ہیں۔ مزید دیکھیے سورۂ آل عمران (168،156)، نساء (۷۲) اور سورۂ احزاب (۱۸) ۔ ¤ ➋ { فَلَهُمْ عَذَابٌ مُّهِيْنٌ:} دنیا میں یہ رسوائی کہ نہ مسلمانوں میں ان کی کوئی عزت ہے اور نہ کفار میں سے کوئی ان پر اعتماد کرتا ہے اور قیامت کے دن ان کے لیے {’’ الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِ ‘‘} کی شکل میں عذاب تیار ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {لَنْ تُغْنِيَ عَنْهُمْ اَمْوَالُهُمْ وَ لَاۤ اَوْلَادُهُمْ … :} نفاق کا بڑا باعث مال و اولاد کی محبت ہے، اس لیے فرمایا قیامت کے دن یہ اموال و اولاد ان کے کسی کام نہیں آئیں گے۔ مزید دیکھیے سورۂ آلِ عمران (117،116)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) {يَوْمَ يَبْعَثُهُمُ اللّٰهُ جَمِيْعًا فَيَحْلِفُوْنَ لَهٗ … :} یعنی منافقین کی جھوٹ بولنے اور اس پر قسم کھانے کی عادت اتنی پکی ہے کہ موت اور حشر و نشر کے بعد بھی نہیں جائے گی اور وہ اللہ تعالیٰ کے سامنے اسی طرح جھوٹی قسمیں کھا جائیں گے جس طرح دنیا میں مسلمانوں کے سامنے کھاتے ہیں اور سمجھیں گے کہ قسم کی صورت میں ان کے پاس کچھ نہ کچھ بنیاد موجود ہے، جس پر وہ قائم ہیں۔ فرمایا سن لو، وہی اصل اور کامل جھوٹے ہیں کہ علام الغیوب کے سامنے بھی جھوٹ بولنے سے باز نہیں آتے۔ دیکھیے سورہ انعام ( ۲۲ تا ۲۴)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ {اِسْتَحْوَذَ عَلَيْهِمُ الشَّيْطٰنُ فَاَنْسٰىهُمْ ذِكْرَ اللّٰهِ … :} یعنی منافقین کے ان اعمال کی وجہ سے ان پر شیطان غالب آگیا اور اس طرح مسلط ہو گیا ہے کہ اس نے انھیں اللہ کی یاد تک بھلا دی ہے۔ یہ لوگ شیطانی گروہ ہیں اور شیطان کا گروہ ہی کامل خسارے والے لوگ ہیں۔ ¤ ➋ اس سے معلوم ہوا کہ بعض اعمال کے نتیجے میں شیطان کا آدمی پر غلبہ ہو جاتا ہے، ان اعمال میں سے ایک نماز باجماعت کا ترک ہے۔ ابو درداء رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا مِنْ ثَلاَثَةٍ فِيْ قَرْيَةٍ وَلاَ بَدْوٍ لاَ تُقَامُ فِيْهِمُ الصَّلاَةُ إِلاَّ قَدِ اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطَانُ فَعَلَيْكَ بِالْجَمَاعَةِ فَإِنَّمَا يَأْكُلُ الذِّئْبُ الْقَاصِيَةَ ] [ أبو داوٗد، الصلاۃ، باب التشدید في ترک الجماعۃ : ۵۴۷ ] ’’کوئی بھی بستی یا بادیہ نہیں جس میں تین آدمی (ہی) ہوں اور ان میں نماز باجماعت نہ ہوتی ہو مگر اس پر شیطان غالب آچکا ہے، اس لیے تم جماعت کو لازم پکڑو، کیونکہ بھیڑیا صرف اسی بکری کو کھاتا ہے جو ریوڑ سے دور جانے والی ہو۔‘‘ قرآن مجید میں بھی اس کی طرف اشارہ موجود ہے، فرمایا : « وَ اِذَا قَامُوْۤا اِلَى الصَّلٰوةِ قَامُوْا كُسَالٰى » [ النساء : ۱۴۲ ] ’’اور جب وہ (منافق)نماز کے لیے کھڑے ہوتے ہیں توسست ہو کر کھڑے ہوتے ہیں۔‘‘"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) { اِنَّ الَّذِيْنَ يُحَآدُّوْنَ اللّٰهَ وَ رَسُوْلَهٗۤ … :} یہ حزب الشیطان کے اس خساررے کا بیان ہے جو پچھلی آیت میں مذکور ہے اور وہ یہ ہے کہ جو لوگ اللہ اور اس کے رسول کی مخالفت کرتے ہیں وہ دنیا اور آخرت میں سب سے زیادہ ذلیل ہونے والوں میں سے ہیں۔ مزید دیکھیے اسی سورت کی آیت (6،5) اور سورۂ توبہ کی آیت (۲۳) کی تفسیر۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { كَتَبَ اللّٰهُ لَاَغْلِبَنَّ اَنَا وَ رُسُلِيْ:} کفار کے {’’ الْاَذَلِّيْنَ ‘‘} ہونے کے مقابلے میں اللہ تعالیٰ کے رسولوں اور اہلِ ایمان کی عزت اور ان کے غلبے کا بیان فرمایا۔ تفسیر کے لیے دیکھیے سورۂ صافات (۱۷۱ تا ۱۷۳) کی تفسیر۔ ¤ ➋ { اِنَّ اللّٰهَ قَوِيٌّ عَزِيْزٌ:} یہ اللہ اور اس کے رسولوں کے غالب آنے کی علت ہے کہ اللہ تعالیٰ بہت قوت والا اور سب پر غالب ہے، پھر اس پر غالب کون آ سکتا ہے؟"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ { لَا تَجِدُ قَوْمًا يُّؤْمِنُوْنَ بِاللّٰهِ وَ الْيَوْمِ الْاٰخِرِ يُوَآدُّوْنَ ……:} یعنی اللہ اور یوم آخرت پر ایمان اور اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے دشمنوں سے دوستی دو ایسی چیزیں ہیں جو ایک ساتھ جمع نہیں ہو سکتیں، خواہ وہ آدمی کے کتنے قریبی رشتہ دار ہوں، اس لیے منافقین جو ایمان کے دعوے کے باوجود کفار سے دوستی رکھتے ہیں ان کا ایمان کا دعویٰ غلط ہے۔ مزید دیکھیے سورۂ آلِ عمران (۲۸) اور سورۂ توبہ (24،23)۔ ¤ ➋ { اُولٰٓىِٕكَ كَتَبَ فِيْ قُلُوْبِهِمُ الْاِيْمَانَ:} یعنی یہ لوگ جو اللہ اور اس کے رسول سے دشمنی رکھنے والوں سے دوستی نہیں رکھتے، خواہ وہ کتنے قریبی رشتہ دار ہوں، اللہ تعالیٰ نے ان کے دلوں میں ایمان نقش کر دیا ہے۔ اس کا مصداق صحابہ کرام رضی اللہ عنھم ہیں، کیونکہ انھوں نے ان تمام لوگوں سے دوستی اور دلی تعلق کا رشتہ کاٹ پھینکا تھا جو اللہ اور اس کے رسو ل سے مخالفت اور دشمنی رکھتے تھے، خواہ وہ ان کے باپ تھے یا بیٹے یا بھائی یا خاندان کے لوگ۔ تاریخ اور سیرت کی کتابوں میں ایسی بہت سی مثالیں موجود ہیں کہ صحابہ کرام رضی اللہ عنھم نے کفر کی حمایت میں مسلمانوں سے لڑنے والے قریب ترین رشتہ داروں کو بھی قتل یا قید کرنے سے دریغ نہیں کیا، خواہ وہ ان کے باپ یا بیٹے یا بھائی تھے یا کوئی اور رشتہ دار۔ جنگِ بدر میں جب قیدیوں کے متعلق مشورہ ہوا کہ ان کو فدیہ لے کر چھوڑ دیا جائے یا قتل کر دیا جائے تو عمر رضی اللہ عنہ نے مشورہ دیا تھا کہ ان کافر قیدیوں میں سے ہر ایک کو اس کے رشتہ دار کے سپرد کیا جائے، جسے وہ خود اپنے ہاتھوں سے قتل کرے اور اللہ تعالیٰ کو عمر رضی اللہ عنہ ہی کا مشورہ پسند آیا تھا۔ تفصیل کے لیے دیکھیے سورۂ انفال (۶۷) کی تفسیر۔ پھر رسول اللہ صلی اللہ علیہ وسلم کے چچا عباس اور عقیل بن ابی طالب( رضی اللہ عنھما ) اسیر ہوئے تو دوسرے قیدیوں کی طرح فدیہ دے کر رہا ہوئے۔ اسی طرح آپ کے داماد ابو العاص اس شرط پر رہا ہوئے کہ آپ کی بیٹی زینب رضی اللہ عنھا کو واپس بھجوا دیں گے۔ ¤ ➌ { وَ اَيَّدَهُمْ بِرُوْحٍ مِّنْهُ:} یعنی انھیں اپنی طرف سے ایک عظیم روحانی قوت عطا فرما کر ان کی مدد فرمائی۔ ¤ ➍ { وَ يُدْخِلُهُمْ جَنّٰتٍ تَجْرِيْ  مِنْ تَحْتِهَا الْاَنْهٰرُ …:} یہ ہے جنتوں میں داخلے، اس میں ابدی قیام اور اللہ تعالیٰ کی رضا کا وہ تصدیق نامہ جو صحابہ کرام رضی اللہ عنھم کو اللہ تعالیٰ کی جانب سے حاصل ہوا۔ پھر ان لوگوں کی بدنصیبی کا کیا عالم ہو سکتا ہے جو ان سے دشمنی رکھتے اور ان کے بارے میں بدزبانی کرتے ہیں۔ ¤ ➎ {اُولٰٓىِٕكَ حِزْبُ اللّٰهِ …: ’’ حِزْبُ اللّٰهِ ‘‘} خبر معرفہ ہونے سے حصر کا مفہوم پیدا ہو رہا ہے، یعنی اللہ کی جماعت اور گروہ صرف یہ لوگ ہیں جنھوں نے اللہ کو اپنا بنا لیا اور اپنے ان عزیزوں سے بیگانہ ہو گئے جو اس سے اور اس کے رسول سے دشمنی رکھتے تھے۔ یاد رکھو! صرف اللہ کا گروہ ہی وہ لوگ ہیں جو کامیاب ہونے والے ہیں۔"
    }
  ]
}