{
  "surah": "Al-Hashr",
  "surah_number": 59,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "اس سورت کا نام ’’الحشر‘‘ اس کی دوسری آیت میں مذکور لفظ {’’ لِاَوَّلِ الْحَشْرِ ‘‘} کی وجہ سے ہے۔ عبد اللہ بن عباس رضی اللہ عنھما سے سوال ہوا کہ سورۂ حشر کس کے بارے میں نازل ہوئی، تو انھوں نے فرمایا : [ نَزَلَتْ فِيْ بَنِي النَّضِيْرِ ] [ بخاري، التفسیر، سورۃ الحشر : ۴۸۸۲ ] ’’یہ سورت (مشہور یہودی قبیلے) بنو نضیر کے بارے میں اتری۔‘‘ صحیح بخاری ہی میں سعید بن جبیر سے مروی ہے کہ میں نے ابن عباس رضی اللہ عنھما کے پاس (اسے) سورۂ حشر کہا تو انھوں نے فرمایا: ’’(اسے) سورۂ نضیر کہو۔‘‘ [ بخاري، التفسیر، سورۃ الحشر : ۴۸۸۳ ] ابن عباس رضی اللہ عنھما نے یہ بات یا تو اس لیے فرمائی کہ کوئی شخص لفظ حشر سے یہاں قیامت مراد نہ لے لے، بلکہ یہ بات پیشِ نظر رہے کہ اس میں مرکزی مضمون بنو نضیر کا معاملہ ہے، یا پھر انھوں نے یہ بتانے کے لیے یہ بات کہی کہ اس سورت کا نام سورۂ حشر کے علاوہ سورۂ نضیر بھی ہے۔ ¤ (آیت 1) {سَبَّحَ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ … :} اس آیت کی تفسیر سورۂ حدید کی پہلی آیت اور سورۂ بنی اسرائیل کی آیت (۴۴) میں گزر چکی ہے، یہاں صرف چند باتوں کا ذکر کیا جاتا ہے جو اس مقام سے متعلق ہیں : (1) سورۂ حدید میں {’’ مَا فِي السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} ہے، جب کہ یہاں {’’ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ ‘‘} ہے۔ ابن عاشور رحمہ اللہ نے اس کی توجیہ یہ فرمائی ہے کہ سورۂ ححدید کی ابتدا میں زمین و آسمان کی ہر چیز کے اللہ تعالیٰ کی تسبیح بیان کرنے کو بطور دلیل بیان کیا گیا ہے اللہ تعالیٰ کی توحید اور ان صفات کے ثبوت کے لیے جو بعد کی آیات میں بیان ہوئی ہیں۔ چونکہ وہ سب کچھ جو زمین و آسمان میں پایا جاتا ہے مجموعی طور پر اس کی دلیل ہے، اس لیے {’’ مَا فِي السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} میں اسے اکٹھا کر دیا ہے۔ جب کہ سورۂ حشر کی ابتدا میں اللہ کی تسبیح کا ذکر مسلمانوں پر اس احسان کی یاد دلانے کے لیے ہے جو زمین پر پیش آنے والے ایک واقعہ کی صورت میں ہوا اور وہ ہے بنو نضیر کی جلا وطنی اور مسلمانوں کا ان کی اراضی اور اموال کا مالک بن جانا۔ اس لیے اس میں زمین والوں کو خاص طور پر الگ ذکر کرنے کے لیے {’’ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ ‘‘} فرمایا۔ یہی معاملہ سورۂ صف، سورۂ جمعہ اور سورۂ تغابن کا ہے، ان سب میں {’’ مَا فِي السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} کے بجائے {’’ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ ‘‘} کہا گیا ہے، کیونکہ ان کے بعد مذکور چیزوں کا تعلق خاص طور پر زمین والوں کے ساتھ ہے۔ ¤ (2) بنو نضیر کے واقعہ کے ذکر سے پہلے {’’ سَبَّحَ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ ‘‘} لانے کا مقصد یہ ہے کہ اس جیسے طاقتور قبیلے کے ساتھ جو معاملہ پیش آیا وہ مسلمانوں کی طاقت کا نہیں بلکہ اللہ تعالیٰ کی قدرت کا کرشمہ تھا، جو ہر عیب اور عجز سے پاک ہے۔ یہ کام جو مسلمانوں کی تعداد اور قوت کے لحاظ سے ممکن ہی نہ تھا، اللہ تعالیٰ کے لیے بالکل معمولی ہے، کیونکہ وہ سبحان ہے۔ اللہ تعالیٰ کی صفات {’’ الْعَزِيْزُ الْحَكِيْمُ ‘‘} لانے میں بھی یہی حکمت ہے کہ جب وہ کسی کو غالب کرنا چاہے تو کوئی اسے روک نہیں سکتا اور اس واقعہ میں بھی اس کی بے شمار حکمتیں ہیں۔ اس کے علاوہ اس میں مسلمانوں کے لیے سبق بھی ہے کہ جب آسمانوں کی ہر چیز اور زمین کی ہر چیز اللہ کی تسبیح کرتی ہے تو تمھیں بھی اس کی بے شمار نعمتوں پر، جن میں بنو نضیر کی جلاوطنی کی نعمت بھی ہے اس کی تسبیح کرنی چاہیے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ {هُوَ الَّذِيْۤ اَخْرَجَ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ مِنْ دِيَارِهِمْ : : ’’ هُوَ ‘‘} مبتدا کے بعد {’’ الَّذِيْ ‘‘} خبر معرفہ لانے سے کلام میں حصر پیدا ہو رہا ہے، یعنی اللہ تعالیٰ جس کی تسبیح ہر وہ چیز کرتی ہے جو آسمانوں میں ہے اور ہر وہ چیز بھی جو زمین میں ہے اور جو اکیلا ہی عزیز و حکیم ہے، اسی نے اہل کتاب میں سے ان لوگوں کو ان کے گھروں سے نکال باہر کیا جنھوں نے کفر کیا، اس کے سوا انھیں نکالنے والا اور کوئی نہیں۔ یہ اس لیے فرمایا کہ مسلمان جنگ کے بغیر ان کے جلا وطن ہو جانے کو اپنی بہادری نہ سمجھیں، بلکہ اللہ کا انعام سمجھ کر اس کی تسبیح و تحمیدکریں اور اسی کا شکر بجا لائیں۔ ابن کثیر رحمہ اللہ نے {’’ هُوَ الَّذِيْۤ اَخْرَجَ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ ‘‘} کے متعلق فرمایا کہ اس سے مراد بنو نضیر کے یہود ہیں۔ یہ بات ابن عباس، مجاہد، زہری اور بہت سے لوگوں نے کہی ہے۔ رسول اللہ صلی اللہ علیہ وسلم جب مدینہ تشریف لائے تو آپ نے ان سے صلح کر لی اور معاہدہ کیا کہ نہ آپ ان سے لڑیں گے اور نہ وہ آپ سے لڑیں گے، مگر انھوں نے آپ کے ساتھ کیے ہوئے اس عہد کو توڑ دیا تو اللہ تعالیٰ نے ان پر اپنا وہ عذاب نازل فرمایا جو ہٹایا نہیں جا سکتا اور ان پر اپنا وہ فیصلہ جاری فرمایا جسے ٹالا نہیں جاسکتا۔ چنانچہ نبی صلی اللہ علیہ وسلم نے انھیں جلا وطن کر دیا اور انھیں ان کے ان مضبوط و محفوظ قلعوں سے نکال باہر کیا جن کے حاصل ہونے کا مسلمانوں کو کبھی طمع تک پیدا نہ ہوا تھا اور جن کے متعلق یہود یہ سمجھتے تھے کہ وہ انھیں اللہ تعالیٰ کے عذاب سے بچا لینے والے ہیں، مگر وہ ان کے کسی کام نہ آئے اور اللہ کی طرف سے ان پر ایسی گرفت آئی جو ان کے وہم و گمان میں نہ تھی۔ ¤ حدیث اور سیرت کی کتابوں میں اس واقعہ کی تفصیلات مذکور ہیں جن میں ان کے عہد توڑنے کے متعدد واقعات کا ذکر ہے۔ ان میں سے ایک وہ ہے جو سنن ابو داؤد میں مروی ہے، عبدالرحمن بن کعب بن مالک نے نبی صلی اللہ علیہ وسلم کے اصحاب رضی اللہ عنھم میں سے ایک صحابی سے بیان کیا : ’’رسول اللہ صلی اللہ علیہ وسلم مدینہ میں تھے، ابھی بدر کا معرکہ نہیں ہوا تھا کہ کفار قریش نے عبداللہ بن اُبی کی طرف اور اوس و خزرج میں سے اس کے بت پرست ساتھیوں کی طرف خط لکھا کہ تم نے ہمارے ساتھی کو جگہ دے رکھی ہے، ہم اللہ کی قسم کھا کر کہتے ہیں کہ تم ہر حال میں اس سے لڑوگے یا اسے نکال دو گے یا ہم سب اکٹھے ہو کر تم پر حملہ آور ہوں گے، تمھارے لڑنے والوں کو قتل کریں گے اور تمھاری عورتیں لوٹ کر لے جائیں گے۔ جب یہ خط عبد اللہ بن اُبی اور اس کے بت پرست ساتھیوں کے پاس پہنچا تو وہ رسول اللہ صلی اللہ علیہ وسلم سے جنگ کے لیے جمع ہوگئے۔ رسول اللہ صلی اللہ علیہ وسلم کو اطلاع ملی تو آپ ان سے ملے اور فرمایا : [ لَقَدْ بَلَغَ وَعِيْدُ قُرَيْشٍ مِّنْكُمُ الْمَبَالِغَ مَا كَانَتْ تَكِيْدُكُمْ بِأَكْثَرَ مِمَّا تُرِيْدُوْنَ  أَنْ تَكِيْدُوْا بِهِ أَنْفُسَكُمْ تُرِيْدُوْنَ أَنْ تُقَاتِلُوْا أَبْنَاءَكُمْ وَ إِخْوَانَكُمْ ] ’’قریش کی دھمکی تم پر بہت گہرا اثر کر گئی ہے، وہ تمھارے نقصان کی اس سے زیادہ کوئی تدبیر نہیں کر سکتے تھے جتنی تم خود اپنے خلاف کر رہے ہو کہ تم اپنے ہی بیٹوں اور بھائیوں سے جنگ کرنا چاہتے ہو۔‘‘ جب انھوں نے نبی صلی اللہ علیہ وسلم سے یہ بات سنی تو وہ منتشر ہوگئے۔ کفارِ قریش کو بھی یہ خبر پہنچ گئی، چنانچہ انھوں نے بدر کے واقعہ کے بعد یہود کو خط لکھا کہ تم اسلحے اور قلعوں والے لوگ ہو، تمھیں ہر حال میں ہمارے ساتھی سے لڑنا ہوگا، یا ہم یہ کر دیں گے اور وہ کر دیں گے اور ہمارے درمیان اور تمھاری عورتوں کی پازیبوں کے درمیان کوئی چیز رکاوٹ نہیں بن سکے گی۔ جب یہ خط بنو نضیر کو پہنچا تو انھوں نے عہد توڑنے پر اتفاق کر لیا اور رسول اللہ صلی اللہ علیہ وسلم کو پیغام بھیجا کہ آپ اپنے ساتھیوں میں سے تیس آدمیوں کے ساتھ ہماری طرف آئیں، ہم میں سے بھی تیس علماء آپ کی طرف آئیں گے اور ہم ایک درمیانی جگہ میں ملیں گے۔ وہ آپ کی بات سنیں گے، اگر انھوں نے آپ کی تصدیق کر دی اور آپ پر ایمان لے آئے تو ہم بھی آپ پر ایمان لے آئیں گے۔ چنانچہ صحابی نے ان کا واقعہ بیان کیا کہ جب اگلا دن ہوا تو نبی صلی اللہ علیہ وسلم نے لشکروں کو لے جا کر ان کا محاصرہ کر لیا اور انھیں فرمایا : [ إِنَّكُمْ وَاللّٰهِ ! لاَ تَأْمَنُوْنَ عِنْدِيْ إِلاَّ بِعَهْدٍ تُعَاهِدُوْنِيْ عَلَيْهِ ] ’’اللہ کی قسم! تمھیں میرے ہاں امن نہیں ہوگا جب تک تم نئے سرے سے میرے ساتھ کوئی عہد نہیں کرو گے۔‘‘ انھوں نے آپ کو کسی قسم کا عہد و پیماں دینے سے انکار کر دیا، تو آپ صلی اللہ علیہ وسلم نے اس دن ان سے جنگ جاری رکھی، پھر اگلے دن لشکروں کو لے کر بنی قریظہ کی طرف گئے اور بنو نضیر کو چھوڑ دیا اور انھیں بھی معاہدہ کرنے کی دعوت دی تو انھوں نے آپ صلی اللہ علیہ وسلم سے معاہدہ کر لیا۔ آپ انھیں چھوڑ کر واپس آگئے اور لشکر لے کر بنو نضیر کے پاس پہنچ گئے اور ان سے جنگ جاری رکھی، حتیٰ کہ وہ جلا وطنی کی شرط پر قلعوں سے اتر آئے۔ چنانچہ بنو نضیر جلا وطن ہوگئے اور اپنے سازو سامان، گھروں کے دروازوں اور ان کی لکڑیوں میں سے جو اونٹوں پر لاد کر لے جا سکتے تھے لے گئے۔ بنو نضیر کے کھجوروں کے درخت صرف رسول اللہ صلی اللہ علیہ وسلم کے لیے خاص تھے، وہ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو عطا فرمائے تھے اور صرف آپ کے لیے مخصوص فرمائے تھے، جیساکہ اللہ تعالیٰ نے فرمایا : «وَ مَاۤ اَفَآءَ اللّٰهُ عَلٰى رَسُوْلِهٖ مِنْهُمْ فَمَاۤ اَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَّ لَا رِكَابٍ » [ الحشر : ۶ ] ’’اور جو (مال) اللہ نے ان سے اپنے رسول پر لوٹایا تو تم نے اس پر نہ کوئی گھوڑے دوڑائے اور نہ اونٹ۔‘‘ یعنی وہ لڑائی کے بغیر حاصل ہوئے۔ تو نبی صلی اللہ علیہ وسلم نے ان کا زیادہ تر حصہ مہاجرین کو دے دیا اور اسے ان کے درمیان تقسیم کر دیا اور ان میں سے کچھ حصہ دو انصاریوں کو بھی دیا جو ضرورت مند تھے۔ ان دو کے سوا انصار میں سے کسی کو اس میں سے نہیں دیا اور اس میں سے رسول اللہ صلی اللہ علیہ وسلم کا صدقہ باقی رہ گیا جو بنو فاطمہ کے پاس رہا۔‘‘ [ أبو داوٗد، الخراج والفيء والإمارۃ، باب في خبر النضیر : ۳۰۰۴، قال الألباني صحیح الإسناد ] اس حدیث سے معلوم ہوا کہ بنو نضیر نے نہ صرف عہد توڑ دیا تھا بلکہ معاہدے کی تجدید سے بھی صاف انکار کر دیا تھا اور رسول اللہ صلی اللہ علیہ وسلم نے عہد توڑنے کی وجہ سے ان کا محاصرہ کیا اور آخر کار انھیں جلا وطن کر دیا۔ ¤ ابن کثیر رحمہ اللہ نے یہ حدیث نقل کرنے کے بعد فرمایا : ’’اصحاب سیر و مغازی نے غزوۂ بنو نضیر کا قصہ اور اس کا سبب جو بیان کیا ہے وہ اختصار کے ساتھ اس طرح ہے کہ جب بئر معونہ پر رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کو شہید کر دیا گیا، جن کی تعداد ستر (۷۰) تھی، تو ان میں سے ایک عمرو بن امیہ ضمری رضی اللہ عنہ بچ کر بھاگ نکلے، مدینہ کی طرف واپس آتے ہوئے انھوں نے موقع پا کر قبیلہ بنو عامر کے دو آدمیوں کو قتل کر دیا (اور یہ سمجھے کہ وہ بئر معونہ کے شہداء کا کچھ بدلا لے رہے ہیں)، حالانکہ یہ قبیلہ نبی صلی اللہ علیہ وسلم سے معاہدہ کر چکا تھا اور آپ نے انھیں امن و امان دے رکھا تھا، لیکن اس کی خبر عمرو رضی اللہ عنہ کو نہیں تھی۔ جب وہ مدینہ پہنچے اور رسول اللہ صلی اللہ علیہ وسلم سے ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ’’تم نے انھیں قتل کر ڈالا، اب میں ہر صورت ان کی دیت دوں گا۔‘‘ بنو نضیر اور بنو عامر میں بھی حلف و عقد اور آپس میں مصالحت تھی، اس لیے رسول اللہ صلی اللہ علیہ وسلم ان کی طرف چلے تاکہ کچھ وہ دیں اور کچھ آپ صلی اللہ علیہ وسلم دیں اور بنو عامر کو راضی کر لیا جائے۔ قبییلہ بنو نضیر کے قلعے مدینہ کے مشرق کی جانب کئی میل کے فاصلے پر تھے، جب آپ صلی اللہ علیہ وسلم ان کی دیت کے سلسلے میں تعاون حاصل کرنے کے لیے وہاں پہنچے تو انھوں نے کہا: ’’ہاں، اے ابو القاسم! جیسے آپ پسند فرمائیں گے، ہم ہر طرح سے آپ کی مدد کریں گے۔‘‘ ادھر آپ سے ہٹ کر انھوں نے آپس میں مشورہ کیا کہ اس سے بہتر موقع کب ہاتھ لگے گا، اس وقت آپ( صلی اللہ علیہ وسلم ) قبضے میں ہیں، آؤ کام تمام کر ڈالو۔ چنانچہ یہ مشورہ ہوا کہ جس دیوار سے آپ لگے بیٹھے ہیں اس گھر پر کوئی چڑھ جائے اور وہاں سے بڑا سا پتھر آپ پر پھینک دے اور ہماری جان ان سے چھڑا دے۔ عمرو بن جحاش بن کعب نے اس کام کا بیڑا اٹھایا اور چھت پر چڑھ گیا۔ چاہتا تھا کہ پتھر لڑھکا دے، اتنے میں اللہ تعالیٰ نے جبریل علیہ السلام کو نبی صلی اللہ علیہ وسلم کے پاس بھیجا اور حکم دیا کہ آپ صلی اللہ علیہ وسلم یہاں سے اٹھ کھڑے ہوں۔ چنانچہ آپ صلی اللہ علیہ وسلم فوراً اٹھ گئے، آپ کے ساتھ اس وقت آپ کے صحابہ کی ایک جماعت بھی تھی، جن میں ابو بکر و عمر اور علی رضی اللہ عنھم بھی تھے۔ آپ صلی اللہ علیہ وسلم وہاں سے فوراً مدینہ کی طرف چل پڑے۔ ادھر جو صحابہ آپ کے ساتھ نہیں تھے اور مدینہ میں آپ کے منتظر تھے، وہ آپ کے دیر کر دینے کی وجہ سے آپ صلی اللہ علیہ وسلم کو ڈھونڈنے کے لیے نکل کھڑے ہوئے۔ اس دوران انھیں مدینہ سے آنے والے ایک آدمی نے بتایا کہ آپ صلی اللہ علیہ وسلم مدینہ پہنچ گئے ہیں، چنانچہ وہ صحابہ واپس پلٹ آئے اور رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچ گئے۔ آپ صلی اللہ علیہ وسلم نے انھیں اپنے ساتھ یہود کے غدر کی بات بتائی اور ان کے ساتھ جنگ کی تیاری کا حکم دے دیا اور صحابہ کو لے کر ان کی طرف چل پڑے۔ یہود لشکروں کو دیکھ کر اپنے قلعوں میں قلعہ بند ہوگئے۔ آپ صلی اللہ علیہ وسلم نے ان کا محاصرہ کر لیا، پھر حکم دیا کہ ان کے کھجور کے درخت جو آس پاس ہیں، وہ کاٹ دیے جائیں۔ اب تو یہود چیخنے لگے کہ یہ کیا ہو رہا ہے؟ آپ تو زمین میں فساد کرنے سے اوروں کو روکتے تھے اور فسادیوں کو برا کہتے تھے، پھر یہ کیا ہونے لگا؟ پس ادھر تو درخت کٹنے کا غم اور ادھر جو کمک آنے والی تھی اس کی طرف سے مایوسی، ان دونوں چیزوں نے ان یہودیوں کی کمر توڑ دی۔‘‘ (ابن کثیر) ¤ ➋ { لِاَوَّلِ الْحَشْرِ : ’’ الْحَشْرِ ‘‘} کا معنی ’’اکٹھا کرنا‘‘ ہے۔ {’’أَوَّلٌ‘‘} صفت ہے جو اپنے موصوف کی طرف مضاف ہے۔ گویا اصل میں {’’ لِلْحَشْرِ الْأَوَّلِ‘‘} ہے، یعنی اللہ تعالیٰ نے بنو نضیر کو پہلے ہی اکٹھ پر ان کے گھروں سے نکال باہر کیا۔ یا {’’أَوَّلٌ‘‘} کا لفظ {’’ الْحَشْرِ ‘‘} کی طرف مضاف حقیقی ہے اور معنی یہ ہے کہ اللہ تعالیٰ نے انھیں اکٹھ کے اوّل (شروع) ہی میں نکال باہر کیا، لڑنے کی نوبت ہی نہیں آئی اور اللہ تعالیٰ کی قدرت سے وہ خود ہی جلا وطنی پر آمادہ ہوگئے۔ شاہ ولی اللہ نے اس کا ترجمہ کیا ہے : ’’در اوّل جمع کردن لشکر۔‘‘ اور شاہ عبدالقادر نے ترجمہ کیا ہے : ’’پہلے ہی بھیڑ (ٹکراؤ) ہوتے۔‘‘ ¤ ➌ { مَا ظَنَنْتُمْ اَنْ يَّخْرُجُوْا :} بنو نضیر مدینہ سے دو میل کے فاصلے پر آباد تھے، یہ لوگ صنعت و حرفت اور تجارت کے علاوہ سود خوری کی وجہ سے بہت مال دار تھے، ان کے پاس ہر قسم کا سامانِ حرب موجود تھا اور انھوں نے نہایت مستحکم قلعے بنا رکھے تھے۔ تعداد میں بھی وہ مسلمانوں سے کم نہ تھے، بنو قریظہ اور خیبر کے یہودی ان کی پشت پر تھے اور انھیں عبد اللہ بن اُبی اور منافقین کی اشیرباد بھی حاصل تھی کہ ہم لڑائی میں ہر طرح سے تمھاری مدد کریں گے۔ اس لیے مسلمانوں کے وہم و گمان میں بھی نہ تھا کہ وہ مڈبھیڑ ہوتے ہی لڑائی کے بغیر نکل جائیں گے۔ ¤ ➍ {وَ ظَنُّوْۤا اَنَّهُمْ مَّانِعَتُهُمْ حُصُوْنُهُمْ مِّنَ اللّٰهِ : ’’ظَنٌّ‘‘} کا معنی گمان بھی ہے اور یقین بھی، جیسا کہ سورۂ بقرہ کی آیت (۴۶) : «الَّذِيْنَ يَظُنُّوْنَ اَنَّهُمْ مُّلٰقُوْا رَبِّهِمْ » میں ہے۔ یعنی یہود کو گمان بلکہ یقین تھا کہ وہ اتنے محفوظ ہیں کہ ان کے قلعے انھیں اللہ سے بھی بچا لینے والے ہیں۔ ¤ ➎ { فَاَتٰىهُمُ اللّٰهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوْا : ’’حَسِبَ يَحْسِبُ‘‘} گمان کرنا۔ {’’اِحْتَسَبَ ‘‘} میں حروف زیادہ ہونے کی وجہ سے مبالغہ ہے، یعنی اللہ تعالیٰ ان کے پاس وہاں سے آیا جہاں سے انھیں ادنیٰ گمان بھی نہ تھا۔ ¤ ➏ {وَ قَذَفَ فِيْ قُلُوْبِهِمُ الرُّعْبَ : ’’ قَذَفَ ‘‘} کا معنی پتھر وغیرہ پھینکنا ہے، مطلب یہ ہے کہ اللہ تعالیٰ نے دفعتاً اچانک شدت کے ساتھ ان کے دلوں میں رعب ڈال دیا۔ اس میں بتایا ہے کہ اللہ تعالیٰ کہاں سے ان کے پاس آیا، یعنی وہ اپنے قلعے، ان کی دیواریں، دروازے اور چھتیں مضبوط کرتے رہے اور گلی کوچوں سے داخل ہونے کے راستے بند کرتے رہے، مگر اللہ تعالیٰ نے براہِ راست ان کے دلوں میں مسلمانوں کا رعب یعنی شدید خوف ڈال دیا۔ جب دل ہی قائم نہ رہا تو ان کے قلعے انھیں کیا بچاتے؟ جتنے حمایتی تھے سب انھی کی طرح شدید خوف زدہ ہو کر انھیں چھوڑ گئے۔ چنانچہ انھوں نے خود ہی اس شرط پر اتر آنے کی درخواست کی کہ ہمیں جان و مال کی امان دی جائے، ہم یہاں سے نکل جاتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے اسلحہ کے سوا جو چیز بھی وہ لے جا سکیں ساتھ لے جانے کی اجازت دی اور انھیں جلا وطن کر دیا۔ چنانچہ ان میں سے کچھ لوگ خیبر میں جا آباد ہوئے اور کچھ شام کی طرف چلے گئے۔ دشمن کے دل میں رعب ڈال دینا اللہ تعالیٰ کی بہت بڑی مدد ہے اور ہمارے نبی کریم صلی اللہ علیہ وسلم کی اس کے ساتھ جتنی مدد کی گئی اتنی کسی اور پیغمبر کی نہیں کی گئی۔ جابر بن عبداللہ رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أُعْطِيْتُ خَمْسًا لَمْ يُعْطَهُنَّ أَحَدٌ قَبْلِيْ، نُصِرْتُ بِالرُّعْبِ مَسِيْرَةَ شَهْرٍ ] [ بخاري، التیمم، باب : ۳۳۵ ] ’’مجھے پانچ چیزیں عطا کی گئی ہیں، جو مجھ سے پہلے کسی کو عطا نہیں کی گئیں (وہ یہ کہ) ایک مہینے کے فاصلے سے رعب کے ساتھ میری مدد کی گئی ہے۔‘‘ آگے باقی چار چیزیں بیان فرمائیں۔ قرآن مجید میں اللہ تعالیٰ نے کفار کے دلوں میں ان کے شرک کرنے کی وجہ سے رعب ڈالنے کے ساتھ مسلمانوں کی مدد کا بھی وعدہ فرمایا ہے، دیکھیے سورۂ آلِ عمران (151،150)۔ ¤ ➐ {يُخْرِبُوْنَ بُيُوْتَهُمْ بِاَيْدِيْهِمْ :} جب انھیں یقین ہوگیا کہ اب جانا ہی جانا ہے تو انھوں نے اندر ہی اندر اپنے ہاتھوں سے اپنے گھروں کو گرانا شروع کر دیا۔ اس کا باعث ایک تو مسلمانوں پر حسد تھا کہ وہ ان کے کام نہ آسکیں اور دوسرا یہ کہ ان کے دروازے، کھڑکیاں، شہتیر اور بالے وغیرہ ساتھ لے جاسکیں۔ ¤ ➑ { وَ اَيْدِي الْمُؤْمِنِيْنَ :} وہ لوگ محاصرے کے اندر اپنے مکان گرا رہے تھے اور مسلمان باہر سے ان کی فصلیں، دیواریں اور مکان گرا رہے تھے، تاکہ اندر داخلے کا راستہ کھلا ہو جائے اور لڑائی ہو تو وسیع میدان میسر ہو سکے۔ اور یہ بھی ہو سکتا ہے کہ وہ جتنی چیزیں لے جا سکتے تھے نکال کر لے جا رہے تھے اور مسلمان ان کے گرائے ہوئے گھروں سے باقی سامان نکالنے کے لیے انھیں مزید تہ و بالا کر رہے تھے۔ ¤ ➒ { فَاعْتَبِرُوْا يٰۤاُولِي الْاَبْصَارِ :} تو اے آنکھوں والو! عبرت حاصل کرو کہ کفر و سرکشی اور بدعہدی کا انجام کیا ہوتا ہے، کیونکہ سعادت مند وہی ہے جو دوسروں کو دیکھ کر عبرت حاصل کر لے۔ ابن جزی نے اپنی تفسیر{’’اَلتَّسْهِيْلُ لِعُلُوْمِ التَّنْزِيْلِ‘‘} میں فرمایا : ’’جو لوگ فقہ میں قیاس کو ثابت کرتے ہیں انھوں نے اس آیت سے استدلال کیا ہے، حالانکہ ان کا اس آیت سے استدلال ضعیف ہے اور آیت کے مفہوم سے خارج ہے۔‘‘"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {وَ لَوْ لَاۤ اَنْ كَتَبَ اللّٰهُ عَلَيْهِمُ الْجَلَآءَ … : ’’جَلَا يَجْلُوْ جَلاَءً‘‘ (ن) ’’اَلرَّجُلَ‘‘} آدمی کو اس کے شہر سے نکال دینا۔ یعنی اللہ تعالیٰ کا ان کے متعلق پہلے سے فیصلہ انھیں جلا وطن کرنے پر اکتفا کا تھا، تاکہ انھیں عبرت ہو اور وہ اپنی اصلاح کر سکیں۔ اگر اس نے پہلے یہ نہ لکھا ہوتا تو انھیں دنیا ہی میں عذاب دیتا، ان کے مرد قتل کیے جاتے اور ان کی عورتوں اور بچوں کو لونڈی اور غلام بنا لیا جاتا، جیسے بعد میں بنو قریظہ کو عبرت حاصل نہ کرنے کی وجہ سے عذاب دیا گیا۔ (دیکھیے بخاری : ۴۰۳۲) یہاں ایک سوال ہے کہ جلا وطنی بھی تو عذاب ہے؟ جواب اس کا یہ ہے کہ عذاب سے مراد جسمانی سزا ہے، جس کا احساس واضح اور شدید ہوتا ہے۔ ¤ ➋ { وَ لَهُمْ فِي الْاٰخِرَةِ عَذَابُ النَّارِ :} یعنی اگر وہ جلا وطنی کی وجہ سے دنیا کے عذاب، قتل، اسیری اور غلامی سے بچ گئے تو بے فکر نہ ہوں، اگر وہ اسی طرح کفر پر قائم رہے تو ان کے لیے آخرت میں آگ کا عذاب تیار ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {ذٰلِكَ بِاَنَّهُمْ شَآقُّوا اللّٰهَ وَ رَسُوْلَهٗ … :} اس کی تفصیل کے لیے دیکھیے سورۂ انفال (۱۳) کی تفسیر۔ یہاں قابل توجہ بات یہ ہے کہ اس آیت میں {’’ وَ مَنْ يُّشَآقِّ اللّٰهَ ‘‘} کے بعد {’’وَرَسُوْلَهُ ‘‘} کو حذف کر دیا ہے، اس سے یہ سمجھانا مقصود ہے کہ رسول کی مخالفت اللہ تعالیٰ ہی کی مخالفت ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ +{مَا قَطَعْتُمْ مِّنْ لِّيْنَةٍ … : ’’ لِيْنَةٍ ‘‘} کے متعلق تین قول ہیں،ایک یہ کہ اس سے مراد کھجور کا درخت ہے۔ ابن جریر نے اسے ترجیح دی ہے۔ دوسرا قول یہ کہ {’’ لِيْنَةٍ ‘‘} برنی اور عجوہ کے سوا کھجور کا درخت ہے اور تیسرا قول یہ کہ ہر درخت کو {’’ لِيْنَةٍ ‘‘} کہا جاتا ہے، کیونکہ جب تک وہ زندہ ہے اس میں {’’ لَيُوْنَةٌ ‘‘} (نرمی) پائی جاتی ہے۔ (شنقیطی) بنونضیر کی بستیوں کے ساتھ ان کا ایک نہایت خوب صورت باغ تھا جسے ’’بویرہ‘‘ کہتے تھے، اس میں کھجوروں کے بہت سے درخت تھے۔ (یہ آج کل بھی بویرہ کے نام سے معروف ہے جو مسجد قبا کے جنوب مغرب میں واقع ہے۔ شنقیطی) رسول اللہ صلی اللہ علیہ وسلم نے ان کا محاصرہ کیا تو بعض ضرورتوں اور حکمتوں کے پیشِ نظر بعض درختوں کو کاٹنے کا اور بعض کو جلانے کا حکم دیا اور بعض اسی طرح رہنے دیے، جیسا کہ ابنِ عمر رضی اللہ عنھما نے فرمایا : [ حَرَّقَ رَسُوْلُ اللّٰهِ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ نَخْلَ بَنِي النَّضِيْرِ وَقَطَعَ وَهِيَ الْبُوَيْرَةُ فَنَزَلَتْ : « مَا قَطَعْتُمْ مِّنْ لِّيْنَةٍ اَوْ تَرَكْتُمُوْهَا قَآىِٕمَةً عَلٰۤى اُصُوْلِهَا فَبِاِذْنِ اللّٰهِ » ] [ بخاري،، المغازي، باب حدیث بني النضیر… : ۴۰۳۱ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے بنو نضیر کے کھجوروں کے درخت جلوا دیے اور کٹوا دیے۔ یہی بویرہ جگہ ہے (جس کا حسان رضی اللہ عنہ نے ذکر کیا ہے، جیسا کہ آگے آئے گا) تو یہ آیت اتری : « مَا قَطَعْتُمْ مِّنْ لِّيْنَةٍ اَوْ تَرَكْتُمُوْهَا قَآىِٕمَةً عَلٰۤى اُصُوْلِهَا فَبِاِذْنِ اللّٰهِ» [ الحشر : ۵ ] ’’جو بھی کھجور کا درخت تم نے کاٹا یا اسے اس کی جڑوں پر کھڑا چھوڑا تو وہ اللہ کی اجازت سے تھا۔‘‘ ¤ درختوں کے کاٹنے اور جلانے پر یہود اور منافقین نے شور مچایا کہ محمد ( صلی اللہ علیہ وسلم ) درختوں کو کاٹ کر فساد فی الارض کا ارتکاب کر رہے ہیں، جب کہ ان کا دعویٰ اصلاح کا ہے۔ اس پر اللہ تعالیٰ نے مسلمانوں کو تسلی دلائی کہ تم نے جو بھی درخت کاٹا یا اسے اس کی جڑوں پر قائم رہنے دیا تو یہ سب کچھ اللہ کے اذن سے تھا، یعنی اگرچہ جنگ کے موقع پر عام حکم یہی ہے کہ درخت اور کھیت جلانے اور کاٹنے سے اجتناب کیا جائے، مگر اس موقع پر جو درخت جلائے گئے یا کاٹے گئے یا باقی رہنے دیے گئے یہ سب کچھ اللہ تعالیٰ کے اذن سے ہوا، اس لیے مخالفین کی باتوں سے پریشان ہونے کی ضرورت نہیں۔ ¤ ➋ { وَ لِيُخْزِيَ الْفٰسِقِيْنَ : ’’ الْفٰسِقِيْنَ ‘‘} میں بنو نضیر کے علاوہ انھیں عہد توڑنے اور لڑائی کے لیے ابھارنے والے یہودی، مکہ کے مشرکین اور مدینہ کے منافقین سبھی شامل ہیں۔ یعنی کھجوروں کے درخت کاٹنے، جلانے یا باقی رکھنے کا عمل دوسری بہت سی مصلحتوں کے علاوہ اس لیے بھی تھا کہ اللہ تعالیٰ اس کے ساتھ فاسقوں کو ذلیل کرے۔ کاٹنے اور جلانے میں ان کی تذلیل تو ظاہر ہے کہ ان کی آنکھوں کے سامنے ان کی زندگی بھر کی کمائی کو جلایا اور کاٹا گیا مگر وہ کاٹنے اور جلانے والوں کا ہاتھ نہ روک سکے۔ اس میں بنو نضیر، دوسرے یہودیوں، منافقینِ مدینہ اور مشرکینِ مکہ سب کی تذلیل تھی کہ انھوں نے یہ سب کچھ ٹھنڈے پیٹوں برداشت کر لیا اور اُف تک نہ کر سکے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کے شاعر حسان بن ثابت رضی اللہ عنہ نے مشرکینِ مکہ پر طنز وتشنیع کے تیر برساتے ہوئے کہا : ¤ {وَهَانَ عَلٰي سَرَاةِ بَنِيْ لُؤَيٍّ ¤ حَرِيْقٌ بِالْبُوَيْرَةِ مُسْتَطِيْرُ} ¤ ’’بنولؤ ی (قریش) کے سرداروں نے وہ آگ آسانی سے برداشت کر لی جو بویرہ کے مقام پر پھیل رہی تھی (یعنی انھیں اس پر کوئی غصہ آیا نہ غیرت اور نہ ہی وہ حسبِ وعدہ بنو نضیر کی مدد کو پہنچے)۔‘‘ [ بخاري، المغازي، باب حدیث بني النضیر… : ۴۰۳۲ ] اور جو درخت باقی رہے ان میں ان سب کی تذلیل یہ تھی کہ وہ مسلمانوں کے قبضے میں آئے اور کسی کو جرأت نہ ہوئی کہ ان کے قبضے سے چھڑا سکیں۔ ¤ ➌ { ’’ وَ لِيُخْزِيَ الْفٰسِقِيْنَ ‘‘} (اور تاکہ وہ نافرمانوں کو ذلیل کرے) میں حرفِ عطف واؤ سے ظاہر ہے کہ اس سے پہلے کچھ عبارت محذوف ہے، یعنی اللہ تعالیٰ نے یہ اذن اس لیے دیا تاکہ بنو نضیر کے محاصرے کے لیے راستہ صاف ہو جائے، ان کے لیے کوئی چھپاؤ باقی نہ رہے، محاصرے میں سختی پیدا کی جائے، انھیں قلعوں سے نکل کر میدان میں آ کر لڑنے پر ابھارا جائے اور تاکہ مسلمانوں کو عزت عطا فرمائے اور تاکہ نافرمانوں کو ذلیل کرے۔ ¤ ➍ اس واقعہ سے ثابت ہوتا ہے کہ اگر جنگی ضرورت کا تقاضا ہو تو درختوں اور کھیتوں کو کاٹا، جلایا اور عمارتوں کو گرایا جا سکتا ہے، بلا ضرورت یہ کام جائز نہیں۔ ¤ ➎ اس آیت سے معلوم ہوا کہ اللہ تعالیٰ کی طرف سے رسول اللہ صلی اللہ علیہ وسلم کو قرآن کے علاوہ اور احکام بھی دیے گئے، کیونکہ یہاں جس کے متعلق فرمایا کہ ’’وہ اللہ کے اذن سے تھا‘‘ وہ ’’اذن‘‘ قرآن میں نہیں بلکہ وحی خفی کے ذریعے سے دیا گیا ہے، جسے حدیث کہتے ہیں۔ خلاصہ یہ کہ وحیٔ الٰہی صرف قرآن تک محدود نہیں۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {وَ مَاۤ اَفَآءَ اللّٰهُ عَلٰى رَسُوْلِهٖ مِنْهُمْ … : ’’فَاءَ يَفِيْءُ فَيْئًا‘‘} (ض) لوٹنا، جیسا کہ فرمایا : « حَتّٰى تَفِيْٓءَ اِلٰۤى اَمْرِ اللّٰهِ » [ الحجرات : ۹ ] ’’یہاں تک کہ وہ اللہ کے حکم کی طرف لوٹ آئے۔‘‘ {’’أَفَاءَ يُفِيْءُ‘‘} (افعال)لوٹانا۔ ’’فے‘‘ ان اموال کو کہا جاتا ہے جو جنگ کے بغیر دشمن سے حاصل ہوں اور جو اموال جنگ کے ساتھ حاصل ہوں انھیں غنیمت کہا جاتا ہے (بعض اوقات غنیمت پر بھی فے کا لفظ بول دیا جاتا ہے)۔ ان اموال کو ’’فے‘‘ اس لیے کہتے ہیں کہ دنیا کے تمام اموال حقیقت میں مسلمانوں کی ملکیت ہیں اور ان پر کفار کا قبضہ ناجائز ہے، جب مسلمان انھیں حاصل کرتے ہیں تو وہ اپنے اموال واپس لیتے ہیں۔ {’’ اَوْجَفْتُمْ ‘‘ ’’وَجَفَ يَجِفُ وَجْفًا وَ وَجِيْفًا‘‘} (ض) {’’ اَلْفَرَسُ‘‘} گھوڑے کا دوڑنا۔ {’’أَوْجَفَ يُوْجِفُ إِيْجَافًا‘‘} دوڑانا۔ {’’ خَيْلٍ ‘‘} گھوڑوں کی جماعت۔ {’’ رِكَابٍ ‘‘} سواری کے اونٹوں کے لیے اسم جمع ہے۔ ¤ ➋ { ’’ وَ مَاۤ اَفَآءَ اللّٰهُ عَلٰى رَسُوْلِهٖ مِنْهُمْ ‘‘} اس جملے کا عطف {’’ مَا قَطَعْتُمْ مِّنْ لِّيْنَةٍ …‘‘} پر ہے اور مقصد غزوۂ بنی نضیر میں مسلمانوں کو عطا ہونے والی نعمتوں میں سے ایک اور نعمت کا بیان ہے۔ ¤ ➌ بنو نضیر اپنی جلا وطنی کے ساتھ جو مکان، باغات اور زمینیں چھوڑ گئے ان کے متعلق فرمایا کہ ان کے جو اموال اللہ تعالیٰ نے اپنے رسول کو واپس لوٹائے ہیں ان پر تمھارا کوئی حق نہیں، کیونکہ تم نے انھیں گھوڑے یا اونٹ دوڑا کر یعنی جنگ کر کے حاصل نہیں کیا، بلکہ اللہ تعالیٰ نے محض اپنے فضل کے ساتھ کسی قابل ذکر لڑائی کے بغیر وہ سب اپنے رسول کو عطا فرما دیے ہیں۔ یاد رہے کہ بنو نضیر کی بستیاں مدینہ سے صرف دو میل کے فاصلے پر تھیں اور مسلمانوں نے پیدل جا کر ہی ان کا محاصرہ کر لیا تھا، صرف رسول اللہ صلی اللہ علیہ وسلم سوار ہو کر گئے اور انھوں نے اس رعب کی وجہ سے جو اللہ تعالیٰ نے ان کے دلوں میں ڈالا، جنگ کیے بغیر ہی ہتھیار ڈال دیے اور اپنے آپ کو نبی صلی اللہ علیہ وسلم کے فیصلے کے حوالے کر دیا۔ ¤ ➍ {وَ لٰكِنَّ اللّٰهَ يُسَلِّطُ رُسُلَهٗ عَلٰى مَنْ يَّشَآءُ … : } یعنی بنو نضیر کے اموال پر قبضہ تمھارے گھوڑے یا اونٹ دوڑانے کے نتیجے میں نہیں ہوا بلکہ اللہ تعالیٰ اپنے رسولوں کو اپنے دشمنوں میں سے جن پر چاہتا ہے مسلط کر دیتا ہے، وہ اس کے ڈالے ہوئے رعب کی وجہ سے لڑائی کے بغیر ہی اپنے آپ کو حوالے کر دیتے ہیں اور اللہ تعالیٰ ہر چیز پر پوری طرح قدرت رکھنے والا ہے۔ ¤ ➎ یہ پہلے اموال تھے جو جنگ کے بغیر محض محاصرے کے نتیجے میں حاصل ہوئے۔ انھیں اصطلاح میں ’’فے ‘‘کہا جاتا ہے۔ اس سے پہلے بدر میں لڑائی کے نتیجے میں جو اموال حاصل ہوئے انھیں ’’غنیمت ‘‘کہا جاتا ہے۔ ان کی تقسیم کا قاعدہ اللہ تعالیٰ نے سورۂ انفال میں بیان فرما دیا : « وَ اعْلَمُوْۤا اَنَّمَا غَنِمْتُمْ مِّنْ شَيْءٍ فَاَنَّ لِلّٰهِ خُمُسَهٗ وَ لِلرَّسُوْلِ وَ لِذِی الْقُرْبٰی وَ الْيَتٰمٰى وَ الْمَسٰكِيْنِ وَ ابْنِ السَّبِيْلِ » [ الأنفال :۴۱ ] ’’اور جان لو کہ تم جو کچھ بھی غنیمت حاصل کرو تو بے شک اس کا پانچواں حصہ اللہ کے لیے اور رسول کے لیے اور قرابت دار اور یتیموں اور مسکینوں اور مسافر کے لیے ہے۔ ‘‘ یعنی اس میں سے پانچواں حصہ اللہ، اس کے رسول، ذوی القربیٰ، یتامیٰ، مساکین اور ابنِ سبیل کے لیے ہو گا اور باقی چار حصے لڑنے والوں میں تقسیم کر دیے جائیں گے۔ رہے اموال فے جو بنو نضیر سے حاصل ہوئے، ان کے متعلق اللہ تعالیٰ نے فرمایا کہ ان پر تمھارا کوئی حق نہیں، بلکہ وہ سب اللہ تعالیٰ نے اپنے رسول کو عطا فرمائے ہیں۔ یہی معاملہ ان تمام بستیوں کا ہے جو بعد میں جنگ کے بغیر حاصل ہوئیں، مثلاً بنو قریظہ کی بستیاں اور خیبر کے وہ علاقے جو جنگ کے بغیر فتح ہوئے، مثلاً فدک وغیرہ، ان سب کو مکمل طور پر رسول اللہ صلی اللہ علیہ وسلم کے اختیار میں دے دیا گیا کہ آپ جس کو جتنا چاہیں دے دیں یا اپنے پاس رکھیں۔ البتہ مستحقین کی چند اقسام متعین کر دی گئیں کہ مال کی تقسیم انھی میں رہنی چاہیے۔ ان مستحقین کا بیان اگلی آیت میں فرمایا۔ عمر بن خطاب رضی اللہ عنہ نے فرمایا : [ كَانَتْ أَمْوَالُ بَنِي النَّضِييْرِ مِمَّا أَفَاءَ اللّٰهُ عَلٰی رَسُوْلِهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ مِمَّا لَمْ يُوْجِفِ الْمُسْلِمُوْنَ عَلَيْهِ بِخَيْلٍ وَلاَ رِكَابٍ، فَكَانَتْ لِرَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّممَ خَاصَّةً، يُنْفِقُ عَلٰی أَهْلِهِ مِنْهَا نَفَقَةَ سَنَتِهِ، ثُمَّ يَجْعَلُ مَا بَقِيَ فِي السِّلاَحِ وَالْكُرَاعِ، عُدَّةً فِيْ سَبِيْلِ اللّٰهِ ] [بخاري، التفسیر، باب قولہ : « ما أفاء اللہ  علٰی رسولہ» :۴۸۸۵ ] ’’بنو نضیر کے اموال ان اموال میں سے تھے جو اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو بطور فے عطا فرمائے تھے، جن پر مسلمانوں نے نہ گھوڑے دوڑائے تھے اور نہ اونٹ، چنانچہ وہ رسول اللہ صلی اللہ علیہ وسلم کے لیے خاص تھے۔ آپ ان میں سے اپنے گھر والوں کو ایک سال کا خرچ دیتے، پھر جو باقی ہوتا اسے جہاد فی سبیل اللہ کی تیاری کے لیے اسلحے اور گھوڑوں میں صرف کر دیتے تھے۔‘‘"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {مَاۤ اَفَآءَ اللّٰهُ عَلٰى رَسُوْلِهٖ مِنْ اَهْلِ الْقُرٰى : ’’ الْقُرٰى ‘‘} میں الف لام عہد کا ہے، اس لیے ترجمہ ’’ان بستیوں‘‘ کیا گیا ہے۔ ¤ ➋ { فَلِلّٰهِ وَ لِلرَّسُوْلِ وَ لِذِي الْقُرْبٰى …:} اس آیت میں ایک عام اصول بیان کیا گیا ہے کہ جو اموال بھی جنگی کار روائیوں کے بغیر مسلمانوں کے ہاتھ لگ جائیں وہ بیت المال کی ملکیت تصور ہوں گے، ان میں سے مجاہدین کو کچھ نہیں ملے گا، کیونکہ یہ ان کی محنت کا نتیجہ نہیں بلکہ یہ اس اجتماعی قوت کا نتیجہ ہے جو اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم ، اس کی امت اور اس کے قائم کردہ نظام کو عطا فرمائی ہے۔ لہٰذا یہ اموال اموالِ غنیمت سے بالکل جداگانہ حیثیت رکھتے ہیں، انھیں اموال فے کہا جاتا ہے اور ان کا اطلاق منقولہ اور غیر منقولہ دونوں قسم کے اموال پر ہوگا۔ اموال فے میں جزیہ و خراج کی آمدنی بھی شامل ہے جو ایک اسلامی ریاست کو غیر مسلموں سے حاصل ہوتی ہے۔ ان کی تقسیم کا مکمل اختیار رسول اللہ صلی اللہ علیہ وسلم کو عطا کیا گیا اور آپ کے بعد یہ اختیار مسلمانوں کے امیر کو حاصل ہوتا ہے، جسے وہ اللہ تعالیٰ کی مقرر کردہ مدّات میں خرچ کرنے کے لیے استعمال کرتا ہے۔ اس آیت میں اللہ تعالیٰ نے اموال فے کی وہ مدّات بھی بیان فرما دیں جہاں انھیں خرچ کیا جائے گا۔ یہ وہی مدّات ہیں جن میں اموالِ غنیمت کا خمس خرچ کیا جاتا ہے، اموالِ فے کا خمس نہیں بلکہ وہ پورے کے پورے انھی میں خرچ کیے جائیں گے۔ تفصیل کے لیے دیکھیے سورۂ انفال ( ۴۱ )کی تفسیر۔ ¤ ➌ {كَيْ لَا يَكُوْنَ دُوْلَةًۢ بَيْنَ الْاَغْنِيَآءِ مِنْكُمْ : ’’ دُوْلَةً ‘‘ ’’دَالَ يَدُوْلُ دَوْلَةً ‘‘ (ن)’’اَلزَّمَانُ‘‘} زمانے کا ایک حالت سے دوسری حالت میں بدلنا، جیسا کہ فرمایا : «وَ تِلْكَ الْاَيَّامُ نُدَاوِلُهَا بَيْنَ النَّاسِ » [ آل عمران : ۱۴۰] ’’اور یہ تو دن ہیں، ہم انھیں لوگوں کے درمیان باری باری بدلتے رہتے ہیں۔‘‘ {’’ دُوْلَةً ‘‘} وہ چیز جو ایک دوسرے سے لی جائے، کبھی اس کے پاس ہو کبھی اس کے پاس۔ ¤ ’’تاکہ مال فے تم میں سے مال داروں کے درمیان ہی گردش کرنے والا نہ ہو‘‘ ربطِ مضمون کے لحاظ سے تو اس کا مطلب اتنا ہی ہے کہ اموال فے کو مجاہدین پر تقسیم نہ کیا جائے، جن کے اکثر پہلے ہی غنی ہو چکے ہیں، محتاج اور مسکین نہیں رہے، بلکہ انھیں نادار لوگوں تک پہنچایا جائے، تاہم اس میں اسلام کے معاشی نظام کی بنیاد بھی بیان کر دی گئی ہے کہ مسلمانوں میں دولت کا بہاؤ فقراء سے اغنیاء کی طرف نہیں ہوتا کہ دولت مند زیادہ سے زیادہ دولت مند اور غریب زیادہ سے زیادہ غریب ہوتے چلے جائیں، بلکہ دولت کا بہاؤ اغنیاء سے فقراء کی طرف ہوتا ہے اور اس سے پورے معاشرے کو فائدہ اٹھانے کا موقع ملتا ہے۔ دولت کے چند ہاتھوں میں جمع ہونے کا سب سے بڑا ذریعہ سود ہے، اللہ تعالیٰ نے اسے حرام قرار دے دیا۔ دولت کی تقسیم کے لیے زکوٰۃ فرض کی گئی، اموال غنیمت میں سے خمس نکالنے کا حکم دیا گیا، مال فے سارا ہی پانچ مدّات میں تقسیم کرنے کا حکم دیا گیا،نفلی صدقات کی بار بار تلقین کی گئی ،بہت سی فروگزاشتوں پر کفارے رکھے گئے اور میراث کا ایسا قانون بنا دیا کہ ہر مرنے والے کی دولت یکجا رہنے کے بجائے پھیل جائے۔ بخل کی شدید مذمت کی گئی اور اللہ کی راہ میں خرچ کرنے کی بار بار تاکید کی گئی اور اس کی فضیلت بیان کی گئی۔ ان احکام پر عمل کیا جائے تو دولت چند ہاتھوں میں جمع ہو ہی نہیں سکتی۔ ¤ ➍ {وَ مَاۤ اٰتٰىكُمُ الرَّسُوْلُ فَخُذُوْهُ وَ مَا نَهٰىكُمْ عَنْهُ فَانْتَهُوْا :} سلسلۂ کلام کے لحاظ سے اس کا مطلب یہ ہے کہ اموالِ فے میں سے رسول تمھیں جو کچھ دے وہ لے لو اور جس سے روک دے اس سے رک جاؤ۔ آپ کے فیصلے کو کسی چون و چرا اور ملال کے بغیر تسلیم کر لو۔ چونکہ رسول اللہ صلی اللہ علیہ وسلم کا ارادہ یہ تھا کہ بنو نضیر کے اموال مہاجرین ہی میں تقسیم کر دیے جائیں، تاکہ وہ اپنے پاؤں پر کھڑے ہو جائیں، تو گویا انصار سے کہا جا رہا ہے کہ اگر رسول کسی موقع پر تمھیں نہ دے تو مطالبہ نہ کرو، یہ رسول کی صواب دید پر ہے کہ وہ تمام مستحقین کو دے یا بعض کو زیادہ مستحق سمجھ کر دے اور دوسروں کو نہ دے۔ سیاق کے مطابق آیت کا مطلب یہ ہے، مگر آیت کے الفاظ عام ہیں، اس لیے یہ صرف اموال کی تقسیم تک محدود نہیں بلکہ اس میں حکم دیا گیا ہے کہ ہر معاملے میں آپ صلی اللہ علیہ وسلم کی اطاعت کرو۔ اس کی وضاحت اس بات سے بھی ہوتی ہے کہ اللہ تعالیٰ نے یہ نہیں فرمایا : {’’ مَا أَتَاكُمُ الرَّسُوْلُ فَخُذُوْهُ وَمَا مَنَعَكُمْ فَلَا تَأْخُذُوْهُ‘‘} کہ رسول تمھیں جو دے وہ لے لو اور جو نہ دے وہ نہ لو، بلکہ فرمایا جس سے روک دے اس سے رک جاؤ، جس سے منع کر دے اس سے باز آ جاؤ۔ اس سے معلوم ہوا کہ آیت کا مقصد آپ کے حکم کی اطاعت ہے۔ چنانچہ اس آیت نے آپ صلی اللہ علیہ وسلم کے حکم کو مستقل قانون کی حیثیت دے دی ہے اور یہ شرط نہیں رکھی کہ وہی حکم مانو جو قرآن مجید میں ہو، اس لیے آپ صلی اللہ علیہ وسلم کا جو حکم بھی صحیح حدیث سے ثابت ہو واجب العمل ہے۔ اس کی تائید اس حدیث سے ہوتی ہے جو ابو ہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ دَعُوْنِيْ مَا تَرَكْتُكُمْ ، إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِسُؤَالِهِمْ وَاخْتِلاَفِهِمْ عَلٰی أَنْبِيَاهمْ ، فَإِذَا نَهَيْتُكُمْ عَنْ شَيْءٍ فَاجْتَنِبُوْهُ ، وَ إِذَا أَمَرْتُكُمْ بِأَمْرٍ فَأْتُوْا مِنْهُ مَا اسْتَطَععْتُمْ ] [ بخاري، الاعتصام بالکتاب والسنۃ، باب الاقتداء بسنن رسول اللّٰہ صلی اللہ علیہ وسلم : ۷۲۸۸ ] ’’مجھے اس وقت تک رہنے دو جب تک میں تمھیں چھوڑے رکھوں، کیونکہ تم سے پہلے لوگ اپنے انبیاء سے سوال اور ان سے اختلاف کی وجہ سے ہلاک ہوگئے۔ تو جب میں تمھیں کسی چیز سے منع کر دوں تو اس سے دور رہو اور جب میں تمھیں کسی کام کا حکم دوں تو اس میں سے جتنا کر سکتے ہو کرو۔‘‘ اور جلیل القدر صحابی عبداللہ بن مسعود رضی اللہ عنہ نے بھی اس آیت سے یہی بات سمجھی ہے۔ چنانچہ ان کے شاگرد علقمہ بیان کرتے ہیں کہ ایک دفعہ انھوں نے فرمایا : [ لَعَنَ اللّٰهُ الْوَاشِمَاتِ وَالْمُوْتَشِمَاتِ وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ، الْمُغَيِّرَاتِ خَلْقَ اللّٰهِ ] ’’اللہ تعالیٰ نے ان عورتوں پر لعنت کی ہے جو جلد میں سوئی کے ساتھ نیل بھر کر نقش و نگار بنانے والی ہیں اور جو بنوانے والی ہیں اور جو چہرے کے بال اکھاڑنے والی ہیں اور جو خوب صورتی کے لیے سامنے کے دانتوں میں فاصلہ بنانے والی ہیں، اللہ کی پیدا کردہ شکل کو بدلنے والی ہیں۔‘‘ بنو اسد کی ایک عورت ام یعقوب کو یہ بات پہنچی تو وہ آئی اور کہنے لگی : ’’مجھے پتا چلا ہے کہ آپ نے فلاں فلاں کام کرنے والی عورتوں پر لعنت کی ہے؟‘‘ تو انھوں نے فرمایا : ’’میں اس پر لعنت کیوں نہ کروں جس پر اللہ کے رسول صلی اللہ علیہ وسلم نے لعنت کی ہے اور جو اللہ کی کتاب میں موجود ہے؟‘‘ اس عورت نے کہا : ’’میں نے دو تختیوں کے درمیان جتنا قرآن ہے سارا پڑھا ہے، مگر مجھے اس میں یہ بات نہیں ملی جو آپ کہہ رہے ہیں۔‘‘ عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا : ’’اگر تم اسے پڑھتی تو تمھیں ضرور مل جاتی، کیا تم نے یہ نہیں پڑھا : «وَ مَاۤ اٰتٰىكُمُ الرَّسُوْلُ فَخُذُوْهُ وَ مَا نَهٰىكُمْ عَنْهُ فَانْتَهُوْا » [ الحشر : ۷ ] ’’ اور رسول تمھیں جو کچھ دے تو وہ لے لو اور جس سے تمھیں روک دے تو رک جاؤ ۔‘‘ اس نے کہا : ’’کیوں نہیں؟‘‘ فرمایا : ’’تو آپ صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے۔‘‘ اس نے کہا : ’’میرا خیال تو یہ ہے کہ آپ کے گھر والے یہ کام کرتے ہیں۔‘‘ فرمایا : ’’جاؤ اور دیکھو۔‘‘ وہ گئی، دیکھا مگر اسے اپنے مطلب کی کوئی چیز دکھائی نہ دی، تو (ابن مسعود رضی اللہ عنہ نے) فرمایا : ’’اگر وہ (میری بیوی) ایسی ہوتی تو ہمارے ساتھ نہ رہتی۔‘‘ [ بخاري، التفسیر، باب : «وما آتاکم الرسول فخذوہ» : ۴۸۸۶ ] ¤ ➎ {وَ اتَّقُوا اللّٰهَ اِنَّ اللّٰهَ ش شَدِيْدُ الْعِقَابِ :} یعنی اللہ سے ڈرتے رہو اور یاد رکھو! اگر تم نے آپ صلی اللہ علیہ وسلم کے حکم کی تعمیل نہ کی یا آپ کے منع کردہ سے باز نہ آئے تو اللہ کی سزا بہت سخت ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { لِلْفُقَرَآءِ :} یہ پچھلی آیت میں مذکور {’’ وَ لِذِي الْقُرْبٰى وَ الْيَتٰمٰى وَ الْمَسٰكِيْنِ وَ ابْنِ السَّبِيْلِ ‘‘} سے بدل ہے۔ گویا یہ کہا جا رہا ہے کہ ان چاروں سے مراد فقراء مہاجرین ہیں اور انصار اور ان کے بعد آنے والے جو ان کے نقشِ قدم پر چلنے والے، ان سے محبت کرنے والے اور ان کے لیے دعا کرنے والے ہیں۔ ¤ ➋ { الْمُهٰجِرِيْنَ الَّذِيْنَ اُخْرِجُوْا مِنْ دِيَارِهِمْ وَ اَمْوَالِهِمْ :} یعنی ایک تو وہ فقراء ہیں پھر مہاجر ہیں۔ مراد ان سے وہ لوگ ہیں جو اس وقت مکہ معظمہ اور عرب کے دوسرے علاقوں سے صرف اس جرم میں نکال دیے گئے تھے کہ انھوں نے اسلام قبول کر لیا تھا۔ یہ لوگ اپنے وطن میں گھر بار اور جائداد وغیرہ سب کچھ رکھتے تھے مگر اب خالی ہاتھ تھے، نہ ان کے پاس رہنے کے لیے گھر تھے نہ ضرورت کے لیے مال۔ بنو نضیر کا علاقہ فتح ہونے سے پہلے ان کی رہائش اور معاش کا کوئی مستقل بندوبست نہ تھا۔ انصار نے انھیں اپنے ساتھ اپنے گھروں میں رکھا ہوا تھا اور انھیں اپنے باغات اور زمینوں کی آمدنی میں بھی شریک کر رکھا تھا۔ اس آیت میں فرمایا کہ یہ لوگ مالِ فے کے حق دار ہیں، تاکہ اپنے پاؤں پر کھڑے ہو سکیں۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے انصار کے مشورے سے بنو نضیر کے باغات اور زمینیں فقراء مہاجرین میں تقسیم کر دیں اور ان کے پاس انصار کی جو زمینیں اور باغات تھے وہ انصار کو واپس کر دیے گئے۔ صرف دو انصاریوں کو ان اموال میں سے کچھ نہ کچھ دیا گیا۔ اس کا یہ مطلب نہیں کہ مال فے میں صرف اس زمانے کے مہاجرین کا حصہ تھا، بلکہ قیامت تک جو لوگ مسلمان ہونے کی وجہ سے اپنے ملک سے نکال دیے جائیں انھیں جگہ دینا اور اپنے پاؤں پر کھڑا ہونے کے قابل بنانا مسلمان ملکوں کا فرض ہے۔ اس کے لیے زکوٰۃ کے علاوہ اموال فے بھی خرچ کیے جائیں گے۔ ¤ ➌ { يَبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَ رِضْوَانًا :} یعنی ہجرت سے ان کا مقصد دنیا کی کوئی چیز نہیں، بلکہ انھوں نے محض اللہ کا فضل یعنی جنت اور اس کی رضا کی تلاش کے لیے ہجرت کی ہے جس کا اللہ تعالیٰ نے ایمان والوں سے وعدہ فرمایا ہے۔ مزید دیکھیے سورۂ توبہ کی آیت (۷۲) کی تفسیر۔ ¤ ➍ { وَ يَنْصُرُوْنَ اللّٰهَ وَ رَسُوْلَهٗ :} اور وہ اپنی جانوں اور مالوں کے ساتھ اللہ اور اس کے رسول کی یعنی ان کے دین کی مدد کرتے ہیں۔ ¤ ➎ { اُولٰٓىِٕكَ هُمُ الصّٰدِقُوْنَ :} یعنی یہی وہ لوگ ہیں جنھوں نے اپنے عمل کے ساتھ اپنے قول میں سچے ہونے کو ثابت کر دیا۔ اس آیت میں اللہ تعالیٰ نے مہاجرین کے صادق ہونے کی شہادت دی ہے، اگلی آیت میں انصار کے بھی {’’ الْمُفْلِحُوْنَ ‘‘} ہونے کی شہادت دی ہے۔ سورۂ انفال میں دونوں کے متعلق فرمایا : « اُولٰٓىِٕكَ هُمُ الْمُؤْمِنُوْنَ حَقًّا » [ الأنفال : ۷۳ ] ’’وہی سچے مومن ہیں۔‘‘ اب اس سے بڑا ظالم کون ہوگا جو ان کے صدق یا ایمان میں شک کرے یا ان کے متعلق زبان درازی کرے!؟"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {وَ الَّذِيْنَ تَبَوَّؤُ الدَّارَ وَ الْاِيْمَانَ مِنْ قَبْلِهِمْ : ’’ بَوَّأَ يُبَوِّءُ‘‘} (تفعیل)جگہ دینا، ٹھکانا دینا،جیسا کہ فرمایا : «وَ لَقَدْ بَوَّاْنَا بَنِيْۤ اِسْرَآءِيْلَ مُبَوَّاَ صِدْقٍ» [ یونس : ۹۳ ] ’’اور بلاشبہ یقینا ہم نے بنی اسرائیل کو ٹھکانا دیا، باعزت ٹھکانا۔‘‘ {’’ تَبَوَّأَ يَتَبَوَّأُ ‘‘} کسی جگہ میں ٹھکانا بنانا، مقیم ہونا۔ {’’ الدَّارَ ‘‘} میں الف لام عہد کا ہے، اس گھر میں جہاں مہاجرین ہجرت کر کے پہنچے۔ ’’دارِ ہجرت‘‘ مدینہ منورہ کا لقب ہے، امام مالک رحمہ اللہ کو اسی لیے {’’إِمَامُ دَارِ الْهِجْرَةِ ‘‘} کہا جاتا ہے کہ وہ مدینہ منورہ میں رہتے تھے۔ یعنی اموالِ فے فقراء مہاجرین کے لیے ہیں اور ان لوگوں کے لیے جنھوں نے مہاجرین کے آنے سے پہلے ہی دار ہجرت اور ایمان میں جگہ بنالی تھی، یعنی پہلے ہی مدینہ میں رہتے تھے اور ایمان لے آئے تھے۔ ایمان لانے کے لیے یہاں ایمان میں جگہ اور ٹھکانا بنانے کا لفظ استعمال فرمایا ہے۔ یہ استعارہ ہے جس میں ایمان کو ایک مضبوط پناہ گاہ اور ٹھکانے کے ساتھ تشبیہ دی ہے، جس میں وہ پہلے ہی داخل ہو چکے تھے۔ ان لوگوں سے مراد تمام انصار ہیں جن میں وہ لوگ بھی شامل ہیں جو اس وقت ایمان لائے جب کوئی مہاجر مدینہ میں نہیں آیا تھا، یعنی بیعتِ عقبہ اولیٰ والے انصار اور وہ بھی جو رسول اللہ صلی اللہ علیہ وسلم کی تشریف آوری سے پہلے ایمان لا چکے تھے جب کچھ مہاجرین آچکے تھے اور کچھ آنے والے تھے اور مکہ فتح ہونے تک مسلمان ہونے والے تمام انصار بھی، کیونکہ وہ بھی کئی مہاجرین سے پہلے ایمان لے آئے تھے۔ ¤ ➋ { يُحِبُّوْنَ مَنْ هَاجَرَ اِلَيْهِمْ :} یہ انصار کی دوسری فضیلت ہے کہ وہ ہجرت کر کے اپنے پاس آنے والوں سے محبت رکھتے ہیں۔ حقیقت یہ ہے کہ جس طرح انصار نے ہجرت کر کے آنے والوں کو گلے لگایا اس کی مثال نہیں ملتی۔ انھوں نے مہاجرین کو اپنی جائداد، گھر بار، زمینوں اور باغوں میں شریک کر لیا اور اتنے اصرار کے ساتھ ان میں سے ہر ایک کو اپنے گھروں میں ٹھہرانے کی کوشش کی کہ مہاجرین کو قرعہ ڈال کر ان کے گھروں میں تقسیم کیا گیا، جیسا کہ ام علاء انصاریہ رضی اللہ عنھا نے فرمایا : [ أَنَّهُمُ اقْتَسَمُوا الْمُهَاجِرِيْنَ قُرْعَةً، قَالَتْ فَطَارَ لَنَا عُثْمَانُ بْنُ مَظْعُوْنٍ، وَأَنْزَلْنَاهُ فِيْ أَبْيَاتِنَا ] [ بخاري، االتعبیر، باب رؤیا النساء : ۷۰۰۳ ] ’’انصار نے مہاجرین کو قرعہ کے ساتھ تقسیم کیا، ہمارے حصے میں عثمان بن مظعون آئے، تو ہم نے انھیں اپنے گھروں میں ٹھہرا لیا۔‘‘ ¤ اس محبت کا ایک مظہر مواخات تھی، جس کی وجہ سے سعد بن ربیع انصاری رضی اللہ عنہ نے عبدالرحمن بن عوف رضی اللہ عنہ کو اپنی ساری جائداد اور تمام مکانوں میں سے نصف کی اور دو بیویوں میں سے ایک کو طلاق کے بعد ان کے نکاح میں دینے کی پیش کش کی، جس پر انھوں نے انھیں برکت کی دعا دی مگر یہ پیش کش قبول نہ کی۔ (دیکھیے بخاری : ۲۰۴۹) انس رضی اللہ عنہ بیان کرتے ہیں کہ مہاجرین نے کہا : [ يَا رَسُوْلَ اللّٰهِ! مَا رَأَيْنَا مِثْلَ قَوْمٍ قَدِمْنَا عَلَيْهِمْ أَحْسَنَ مُوَاسَاةً فِيْ قَلِيْلٍ، وَلاَ أَحْسَنَ بَذْلاً فِيْ كَثِيْرٍ، لَقَدْ كَفَوْنَا الْمَؤنَةَ، وَأَشْرَكُوْنَا فِي الْمَهْنَأِ، حَتّٰی لَقَدْ حَسِبْنَا أَنْ يَذْهَبُوْا بِالْأَجْرِ كُلِّهِ، قَالَ لاَ، مَا أَثْنَيْتُمْ عَلَيْهِمْ، وَدَعَوْتُمُ اللّٰهَ عَزَّوَجَلَّ لَهُمْ ] [ [مسند أحمد : ۳ /۲۰۰، ۲۰۱، ح : ۱۳۰۷۵، قال المحقق إسنادہ صحیح علی شرط الشیخین۔ ترمذي : ۲۴۸۷ ] ’’اے اللہ کے رسول! ہم نے ان جیسے لوگ نہیں دیکھے جن کے پاس ہم آئے ہیں، جو تھوڑے میں اچھی سے اچھی غم خواری کرتے ہوں اور زیادہ میں بہتر سے بہتر خرچ کرتے ہوں۔ وہ ہماری جگہ خود محنت مشقت کر رہے ہیں اور انھوں نے آمدنی میں ہمیں شریک کر رکھا ہے ، یہاں تک کہ ہمیں گمان ہوتاہے کہ سارا اجر وہی لے جائیں گے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’ نہیں، جب تک تم ان کی تعریف کرتے رہو گے اور اللہ تعالیٰ سے ان کے لیے دعا کرتے رہو گے۔‘‘ انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے انصار کو بلایا تاکہ بحرین کا علاقہ بطور جاگیر ان کے لیے لکھ دیں۔ انھوں نے کہا : ’’جب تک ہمارے مہاجر بھائیوں کو بھی اتنا ہی نہ دیں ہم نہیں لیں گے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِمَّا لاَ، فَاصْبِرُوْا حَتّٰی تَلْقَوْنِيْ، فَإِنَّهُ سَيُصِيْبُكُمْ بَعْدِيْ أَثَرَةٌ ] [ بخاري، مناقب الأنصار، باب قول النبي صلی اللہ علیہ وسلم للأنصار : ’’اصبروا حتٰی تلقوني علی الحوض ‘‘ : ۳۷۹۴ ] ’’اگر تم نہیں لیتے تو صبر کرو، یہاں تک کہ مجھ سے آ ملو، کیونکہ میرے بعد تم پر دوسروں کو ترجیح دی جائے گی۔‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ انصار نے نبی صلی اللہ علیہ وسلم سے کہا : ’’اے اللہ کے رسول! ہمارے کھجوروں کے درخت ہمارے اور ہمارے مہاجر بھائیوں کے درمیان تقسیم کر دیجیے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’نہیں۔‘‘ تو انصار نے (مہاجرین سے) کہا : ’’تم ہماری جگہ محنت کرو گے اور ہم تمھیں پھلوں کی پیداوار میں شریک کر لیں گے۔‘‘ مہاجرین نے کہا: ’’ہم نے تمھاری بات سنی اور مان لی۔‘‘ [ بخاري، الحرث والمزارعۃ، باب إذا قال اکفني مؤونۃ النخل… : ۲۳۲۵ ] ¤ ➌ { وَ لَا يَجِدُوْنَ فِيْ صُدُوْرِهِمْ حَاجَةً مِّمَّاۤ اُوْتُوْا :} یعنی انصار کے دل میں مہاجرین کی ایسی محبت اور ہمدردی ہے کہ مہاجرین کو کوئی چیز دی جائے تو انصار کے دل میں اپنے لیے اس کی خواہش تک پیدا نہیں ہوتی، اس کا مطالبہ تو بہت دور کی بات ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے بنو نضیر کی چھوڑی ہوئی تمام زمینیں اور باغات مہاجرین کو دے دیے اور انصار نے بخوشی اسے قبول کیا۔ ¤ ➍ {وَ يُؤْثِرُوْنَ عَلٰۤى اَنْفُسِهِمْ وَ لَوْ كَانَ بِهِمْ خَصَاصَةٌ: ’’خَصَّ يَخَصُّ خَصَاصَةً وَخَصَاصًا وَخَصَاصَاءً (ع )‘‘ ’’اِفْتَقَرَ‘‘} محتاج ہونا۔ {’’ خَصَاصَةٌ ‘‘} فقر و فاقہ۔ اپنی ضرورت سے زائد چیز خرچ کرنا بھی اگرچہ خوبی ہے، مگر وہ تھوڑا بہت جو آدمی کے پاس ہو، خود فقرو فاقہ برداشت کرتے ہوئے اسے دوسرے پر خرچ کر دینا بہت ہی اونچی بات ہے۔ ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ انھوں نے پوچھا : ’’یا رسول اللہ! کون سا صدقہ سب سے بہتر ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ جُهْدُ الْمُقِلِّ وَابْدَأْ بِمَنْ تَعُوْلُ ] [ أبو داوٗد، الزکاۃ، باب الرخصۃ في ذٰلک : ۱۶۷۷، وقال الألباني صحیح ] ’’کم مال والے کی کوشش اور ابتدا اس سے کرو جس کی تم پرورش کر رہے ہو۔‘‘ ¤ ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی نبی صلی اللہ علیہ وسلم کے پاس آیا، آپآپ صلی اللہ علیہ وسلم نے اپنی بیویوں کے پاس پیغام بھیجا، ان کی طرف سے جواب آیا کہ ہمارے پاس پانی کے سوا کچھ نہیں تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ يَضُمُّ أَوْ يُضِيْفُ هٰذَا؟ ] ’’اس مہمان کو اپنے ساتھ  کون لے جائے گا؟‘‘ انصار میں سے ایک آدمی نے کہا: ’’میں لے جاؤں گا۔‘‘ چنانچہ وہ اسے لے کر اپنی بیوی کے پاس گیا اور اس سے کہا : ’’رسول اللہ صلی اللہ علیہ وسلم کے مہمان کی خاطر تواضع کرو۔‘‘ اس نے کہا: ’’ہمارے پاس بچوں کے کھانے کے سوا کچھ نہیں۔‘‘ اس نے کہا: ’’کھانا تیار کر لو، چراغ جلا لو اور بچے جب کھانا مانگیں تو انھیں سلا دو۔‘‘ اس نے کھانا تیار کر لیا، چراغ جلا دیا اور بچوں کو سلا دیا۔ پھر وہ اس طرح اٹھی جیسے چراغ درست کرنے لگی ہے اور اس نے چراغ بجھا دیا۔ میاں بیوی دونوں اس کے سامنے یہی ظاہر کرتے رہے کہ وہ کھا رہے ہیں، مگر انھوں نے وہ رات خالی پیٹ گزار دی۔ جب صبح ہوئی اور وہ انصاری رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ ضَحِكَ اللّٰهُ اللَّيْلَةَ أَوْ عَجِبَ مِنْ فَعَالِكُمَا ] ’’آج رات تم دونوں میاں بیوی کے کامم پر اللہ تعالیٰ ہنس پڑا یا فرمایا کہ اس نے تعجب کیا۔‘‘ تو اللہ تعالیٰ نے یہ آیت نازل فرمائی : « وَ يُؤْثِرُوْنَ عَلٰۤى اَنْفُسِهِمْ وَ لَوْ كَانَ بِهِمْ خَصَاصَةٌ وَ مَنْ يُّوْقَ شُحَّ نَفْسِهٖ فَاُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ » [ الحشر: ۹ ] ’’اور اپنے آپ پر ترجیح دیتے ہیں، خواہ انھیں سخت حاجت ہو اور جو کوئی اپنے نفس کی حرص سے بچا لیا گیا تو وہی لوگ ہیں جو کامیاب ہیں۔‘‘ [ بخاري، مناقب الأنصار، باب قول اللّٰہ عزوجل: «و یؤثرون علی أنفسہم …» : ۳۷۹۸۔ مسلم : ۲۰۵۴ ] صحیح مسلم میں اس انصاری کا نام بھی مذکور ہے کہ وہ ابو طلحہ رضی اللہ عنہ تھے۔ ¤ ➎ {وَ مَنْ يُّوْقَ شُحَّ نَفْسِهٖ … : ’’ يُوْقَ ‘‘ ’’وَقٰي يَقِيْ وِقَايَةً‘‘} (ض) (بچانا) سے فعل مضارع مجہول ہے، اصل میں {’’يُوْقٰي‘‘} تھا، {’’ مَنْ ‘‘} کے جزم دینے کی وجہ سے الف گر گیا۔ راغب نے فرمایا : {’’اَلشُّحُّ بُخْلٌ مَعَ حِرْصٍٍٍ وَذٰلِكَ فِيْمَا كَانَتْ عَادَةً۔‘‘} ’’شح‘‘ ’’وہ بخل ہے جس کے ساتھ حرص بھی ہو اور یہ آدمی کی عادت ہو۔‘‘ یعنی ’’شح‘‘ یہ نہیں کہ آدمی کسی وقت بخل کر جائے یا حرص سے کام لے لے، بلکہ یہ دونوں چیزیں اس کی عادت ہوں۔ بعض اہلِ علم نے فرمایا کہ ’’شح‘‘ یہ ہے کہ جو آدمی کے پاس ہو اس پر بخل کرے اور جو نہیں اس کی حرص رکھے۔ {’’ وَ مَنْ يُّوْقَ شُحَّ نَفْسِهٖ ‘‘} سے ظاہر ہے کہ ہر انسان میں یہ عادت پائی جاتی ہے، بچتا وہی ہے جسے اللہ تعالیٰ بچائے اور جنھیں اس بری خصلت سے بچا لیا جائے وہی کامیاب ہیں۔ آیت میں ’’شح ‘‘ سے بچنے کی تاکید اور فضیلت کا بیان ہے، پھر جو کوشش کرے اللہ تعالیٰ اسے بچا لیتا ہے، جیسا کہ فرمایا : «وَالَّذِیْنَ جَاھَدُوْْا فِیْنَا لَنَھْدِیَنَّھُمْ سُبُلَنَاا وَاِنَّ اللہ لَمَعَ الْمُحْسِنِیْنَ» [ العنکبوت : ۶۹ ] ’’اور وہ لوگ جنھوں نے ہمارے بارے میں پوری کوشش کی ہم ضرور ہی انھیں اپنے راستے دکھا دیں گے اور بلاشبہ اللہ یقینا نیکی کرنے والوں کے ساتھ ہے۔‘‘ اور ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَمَنْ يَّسْتَعْفِفْ يُعِفَّهُ اللّٰهُ،، وَمَنْ يَّسْتَغْنِ يُغْنِهِ اللّٰهُ، وَمَنْ يَّتَصَبَّرْ يُصَبِّرْهُ اللّٰهُ، وَمَا أُعْطِيَ أَحَدٌ عَطَاءً خَيْرًا وَ أَوْ سَعَ مِنَ الصَّبْرِ ] [بخاري، الزکاۃ، باب الاستعفاف عن المسئلۃ : ۱۴۶۹ ] ’’اور جو (سوال سے) بچے گا اللہ تعالیٰ اسے بچالے گا اور جو غنی بننے کی کوشش کرے گا اللہ تعالیٰ اسے غنی بنا دے گا اور جو صبر کی کوشش کرے گا اللہ تعالیٰ اسے صبر عطا کر دے گا اور کسی شخص کو کوئی ایسا عطیہ نہیں دیا گیا جو صبر سے اچھا اور زیادہ وسیع ہو۔‘‘ اور جابر بن عبداللہ رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اِتَّقُوا الظُّلْمَ فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ وَاتَّقُوا الشُّحَّ فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ، حَمَلَهُمْ عَلٰی أَنْ سَفَكُوْا دِمَاءَهُمْ وَاسْتَحَلُّوْا مَحَارِمَهُمْ ] [مسلم، البروالصلۃ، باب تحریم الظلم : ۲۵۷۸ ] ’’ظلم سے بچو، کیونکہ ظلم قیامت کے دن بہت سی تاریکیاں ہوگا اور {’’شُحَّ‘‘} (بخل و حرص) سے بچو، کیونکہ شح نے ان لوگوں کو ہلاک کر دیا جو تم سے پہلے تھے۔ اس نے انھیں اس بات پر ابھارا کہ انھوں نے اپنے خون بہائے اور اپنے اوپر حرام چیزوں کو حلال کر لیا۔‘‘ ¤ ➏ اس آیت میں انصار کی جو صفات بیان ہوئی ہیں اس کا یہ مطلب نہیں کہ وہ انھی کے ساتھ خاص ہیں بلکہ وہ مہاجرین میں بھی بدرجہ اتم موجود تھیں۔ ان کی ہجرت ہی ان تمام صفات کی جامع ہے، کیونکہ آدمی کے لیے ممکن ہی نہیں کہ وہ اللہ، اس کے رسول اور ایمان والوں کی محبت اور انھیں اپنے جان و مال پر ترجیح دیے بغیر ہجرت کر سکے۔ پھر ہر موقع پر انصار کی طرح مہاجرین نے بھی جس طرح اپنے مال و جان کو اللہ کی راہ میں قربان کیا وہ سب کے سامنے ہے۔ جنگ تبوک کے موقع پر ابو بکر صدیق رضی اللہ عنہ گھر میں جو کچھ تھا سب لے آئے اور عمر رضی اللہ عنہ آدھا سامان لے آئے۔ یہ شح سے محفوظ ہونے اور ایثار کی بلند ترین مثالیں ہیں۔ اسی طرح پہلی آیت میں مہاجرین کے جو اوصاف بیان ہوئے ہیں ان کا یہ مطلب نہیں کہ وہ صرف انھی کے ساتھ خاص ہیں، بلکہ وہ انصار میں بھی موجود تھے۔ دلیل اس کی یہ ہے کہ اللہ تعالیٰ نے دونوں کا ذکر اکٹھا فرمایا ہے اور دونوں کو ایک دوسرے کے دوست اور سچے مومن قرار دیا ہے۔ چنانچہ فرمایا : «اِنَّ الَّذِيْنَ اٰمَنُوْا وَ هَاجَرُوْا وَ جٰهَدُوْا بِاَمْوَالِهِمْ وَ اَنْفُسِهِمْ فِيْ سَبِيْلِ اللّٰهِ وَ الَّذِيْنَ اٰوَوْا وَّ نَصَرُوْۤا اُولٰٓىِٕكَ بَعْضُهُمْ اَوْلِيَآءُ بَعْضٍ » [ الأنفال : ۷۲ ] ’’بے شک جو لوگ ایمان لائے اور انھوں نے ہجرت کی اور اپنے مالوں اور اپنی جانوں کے ساتھ اللہ کے راستے میں جہاد کیا اور وہ لوگ جنھوں نے جگہ دی اور مدد کی، یہ لوگ! ان کے بعض بعض کے دوست ہیں۔‘‘ اور اس کے بعد فرمایا : «وَ الَّذِيْنَ اٰمَنُوْا وَ هَاجَرُوْا وَ جٰهَدُوْا فِيْ سَبِيْلِ اللّٰهِ وَ الَّذِيْنَ اٰوَوْا وَّ  نَصَرُوْۤا اُولٰٓىِٕكَ هُمُ الْمُؤْمِنُوْنَ حَقًّا » [ الأنفال : ۷۴ ] ’’اور جو لوگ ایمان لائے اور انھوں نے ہجرت کی اور اللہ کی راہ میں جہاد کیا اور وہ لوگ جنھوں نے جگہ دی اور مدد کی وہی سچے مومن ہیں۔‘‘ غرض مہاجرین و انصار میں سے کوئی بھی فضیلت میں کم نہیں، تاہم مہاجرین کو اپنی ہجرت کی وجہ سے انصار پر ایک قسم کی برتری حاصل ہے، اس لیے ان آیات میں ان کا ذکر پہلے آیا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے حنین کی غنیمتوں کی تقسیم کے موقع پر انصار کو مخاطب کرتے ہوئے فرمایا : [ أَتَرْضَوْنَ أَنْ يَّذْهَبَ النَّاسُ بِالشَّاةِ وَالْبَعِيْرِ، وَتَذْهَبُوْنَ بِالنَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ إِلٰی رِحَالِكُمْ؟ لَوْلاَ الْهِجْرَةُ لَكُنْتُ امْرَأً مِنَ الْأَنْصَارِ، وَلَوْ سَلَكَ النَّاسُ وَادِيًا وَشِعْبًا لَسَلَكْتُ وَادِيَ الْأَنْصَارِ وَشِعْبَهَا، الْأَنْصَارُ شِعَارٌ وَالنَّاسُ دِثَارٌ ] [بخاري، المغازي، باب غزوۃ الطائف في شوال سنۃ ثمان : ۴۳۳۰ ] ’’کیا تم پسند کرتے ہو کہ لوگ بھیڑ بکریاں اور اونٹ لے جائیں اور تم نبی صلی اللہ علیہ وسلم کو اپنے گھروں کی طرف لے جاؤ؟ اگر ہجرت نہ ہوتی تو میں انصار میں سے ایک آدمی ہوتا اور اگر لوگ کسی وادی اور گھاٹی میں چلیں تو میں انصار کی وادی اور ان کی گھاٹی میں چلوں گا۔ انصار شعار (جسم کے ساتھ ملا ہوا کپڑا ) ہیں اور دوسرے لوگ (اوپر لیا جانے والا کپڑا )ہیں۔‘‘"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ { وَ الَّذِيْنَ جَآءُوْ مِنْۢ بَعْدِهِمْ :} اس کا عطف مہاجرین و انصار پر ہے جن کا ذکر پچھلی دو آیات میں گزرا۔ یعنی اموال فے مہاجرین و انصار کے فقراء کے لیے ہیں اور ان فقراء کے لیے جو ان کے بعد آئے۔ یہ اموال فے کے مستحقین کی تیسری قسم ہے۔ ان میں تابعین، تبع تابعین اور قیامت تک آنے والے تمام مسلمان شامل ہیں، اگر ان میں وہ صفات موجود ہوں جن کا اس آیت میں ذکر ہے۔ ¤ ➋ {يَقُوْلُوْنَ رَبَّنَا اغْفِرْ لَنَا وَ لِاِخْوَانِنَا  الَّذِيْنَ سَبَقُوْنَا بِالْاِيْمَانِ … :} ان میں سے پہلی صفت جو {’’ الَّذِيْنَ سَبَقُوْنَا بِالْاِيْمَانِ ‘‘} سے ظاہر ہے، یہ ہے کہ وہ مہاجرین و انصار کو مومن مانتے ہوں اور انھی چیزوں پر ایمان رکھتے ہوں جن پر ان کا ایمان تھا۔ دوسری صفت یہ ہے کہ وہ ان کے لیے دعائے مغفرت کرتے ہوں۔ تیسری صفت یہ ہے کہ وہ مہاجرین و انصار صحابہ اور ان کے پیروکاروں سے نہ صرف محبت رکھتے ہوں بلکہ دعا بھی کرتے ہوں کہ اللہ تعالیٰ ان کے دلوں میں ان کے بارے میں کوئی کینہ یا دشمنی باقی نہ رہنے دے اور نہ ہی پیدا ہونے دے۔ مفسر ابن کثیر رحمہ اللہ نے فرمایا کہ امام مالک رحمہ اللہ نے اس آیت سے کیا ہی خوب صورت استنباط کیا ہے کہ رافضی جو صحابہ کو گالی دیتا ہو، اس کا مال فے میں کوئی حصہ نہیں، کیونکہ اس میں وہ اوصاف نہیں جو اللہ تعالیٰ نے اپنے اس فرمان {’’ وَ الَّذِيْنَ جَآءُوْ مِنْۢ بَعْدِهِمْ يَقُوْلُوْنَ رَبَّنَا اغْفِرْ لَنَا وَ لِاِخْوَانِنَا الَّذِيْنَ سَبَقُوْنَا بِالْاِيْمَاانِ وَ لَا تَجْعَلْ فِيْ قُلُوْبِنَا غِلًّا لِّلَّذِيْنَ اٰمَنُوْا رَبَّنَاۤ اِنَّكَ رَءُوْفٌ رَّحِيْمٌ ‘‘} میں ذکر فرمائے ہیں۔ ام المومنین عائشہ رضی اللہ عنھا نے اس آیت کے مفہوم کے پیشِ نظر اپنے بھانجے عروہ بن زبیر سے فرمایا : [ يَا ابْنَ أُخْتِيْ! أُمِرُوْا أَنْ يَّسْتَغْفِرُوْا لِأَصْحَابِ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَسَبُّوْهُمْ ] [ مسلم، التفسیر، باب في تفسیر آیات متفرقۃ : ۳۰۲۲ ] ’’اے میرے بھانجے! ان لوگوں کو حکم دیا گیا تھا کہ نبی صلی اللہ علیہ وسلم کے صحابہ کے لیے مغفرت کی دعا کریں، لیکن وہ انھیں گالیاں دینے لگے۔‘‘ بعض نے فرمایا، جس کے دل میں کسی صحابی کے متعلق کینہ ہو اور وہ تمام صحابہ کے لیے رحم کی دعا نہ کرتا ہو وہ ان لوگوں میں شامل نہیں جن کا اللہ تعالیٰ نے اس آیت میں ذکر فرمایا ہے، کیونکہ اللہ تعالیٰ نے بالترتیب ایمان والوں کے تین مراتب بیان فرمائے ہیں، مہاجرین، انصار اور ان کے وہ پیروکار جن میں وہ اوصاف ہوں جو آیت میں مذکور ہیں، سو جو شخص ان صفات والے پیروکاروں میں سے نہ ہو وہ مومنوں کی اقسام سے خارج ہے۔ حقیقت یہ ہے کہ رافضی لوگوں سے، جو صحابہ کو گالی دیتے ہیں، یہود و نصاریٰ ہی اچھے رہے، کیونکہ یہود سے پوچھا گیا کہ تمھاری ملت میں سب سے بہتر لوگ کون ہیں؟ انھوں نے کہا، موسیٰ علیہ السلام کے اصحاب۔ نصاریٰ سے پوچھا گیا، تمھاری ملت میں سب سے بہتر لوگ کون ہیں؟ انھوں نے کہا، عیسیٰ علیہ السلام کے اصحاب۔ رافضیوں سے پوچھا گیا کہ تمھاری ملت میں سب سے برے لوگ کون ہیں؟ تو انھوں نے کہا، محمد صلی اللہ علیہ وسلم کے اصحاب۔ [ نَعُوْذُ بِاللّٰہِ مِنْ ذٰلِکَ ] ¤ ➌ { رَبَّنَاۤ اِنَّكَ رَءُوْفٌ رَّحِيْمٌ :} اپنے سے پہلے ایمان والوں کے لیے مغفرت کی دعا اور اپنے سینوںں کو ان کے کینے سے پاک رکھنے کی دعا کے آخر میں اللہ تعالیٰ کو اس کے ان دو اسمائے حسنیٰ کا واسطہ دیا، کیونکہ یہ دونوں چیزیں اس کی رافت و رحمت ہی سے حاصل ہو سکتی ہیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {اَلَمْ تَرَ اِلَى الَّذِيْنَ نَافَقُوْا … :} اکثر مفسرین نے لکھا ہے کہ یہ آیات عبداللہ بن اُبی اور اس کے دوسرے منافق ساتھیوں کے بارے میں اتریں کہ انھوں نے بنو نضیر کے یہود کی طرف پیغام بھیجا کہ اپنے قلعوں میں ڈٹ جاؤ، اگر تمھیں نکالا گیا تو ہم تمھارے ساتھ نکلیں گے۔ اس پر اللہ تعالیٰ نے فرمایا کہ یقینا یہ لوگ جھوٹے ہیں، اگر انھیں نکالا گیا تو یہ ان کے ساتھ نہیں نکلیں گے۔ مفسر آلوسی نے لکھا ہے کہ اس کا مطلب تو یہ ہوا کہ یہ سورت بنو نضیر کے واقعہ سے پہلے اتری ہے، جب کہ محدثین اور سیرت نگاروں کے مطابق یہ سورت بنو نضیر کے واقعہ کے بعد اتری ہے، جب وہ جلا وطن کیے جا چکے تھے۔ آلوسی نے اشارے ہی پر اکتفا کیا ہے کہ ان آیات کو بنو نضیر کے متعلق سمجھنا درست نہیں۔ ابن عاشور نے اپنی تفسیر ’’التحریر والتنویر‘‘ میں لکھا ہے کہ منافقین نے جن کفار اہل کتاب کو یہ بات کہی تھی وہ بنو نضیر نہیں بلکہ بنو قریظہ اور خیبر کے یہودی تھے، کیونکہ بنو نضیر کا قصہ تو اس سے پہلے تمام ہو چکا تھا۔ اب وہ منافقین باقی ماندہ یہودیوں کو مسلمانوں کے مقابلے میں ڈٹ جانے کی تلقین کر رہے تھے اور انھیں یقین دلا رہے تھے کہ ہم ہر حال میں تمھارا ساتھ دیں گے۔ اللہ تعالیٰ نے ان آیات میں مسلمانوں کو حوصلہ دلایا کہ فکر مت کرو، یہ کسی صورت میں بھی ان کا ساتھ نہیں دیں گے۔ ¤ ابنِ عاشور کی بات ہی درست ہے۔ ان آیات کو طبری میں مذکور ابن عباس رضی اللہ عنھما کے جس قول کے مطابق بنو نضیر کے متعلق قرار دیا گیا ہے اس کی سند ثابت نہیں، اس میں طبری کے شیخ محمد بن حمید رازی ضعیف ہیں۔ ¤ ➋ { ’’ اَلَمْ تَرَ ‘‘ ’’أَلَمْ تَعْلَمْ‘‘} کے معنی میں ہے۔ نبی کریم صلی اللہ علیہ وسلم کی نبوت کے بہت سے دلائل میں سے یہ بھی ایک دلیل ہے کہ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو منافقین کی اس بات سے آگاہ کر دیا جو ان کے درمیان انتہائی راز کی بات تھی۔ ¤ ➌ { يَقُوْلُوْنَ لِاِخْوَانِهِمُ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ :} جیسا کہ اوپر گزرا کہ ان کفار اہل کتاب سے مراد بنو قریظہ اور خیبر کے یہودی ہیں، انھیں منافقین کے بھائی قرار دینے سے ظاہر ہے کہ جس طرح ایمان والے آپس میں دوست اور بھائی ہیں (دیکھیے حجرات : ۱۰۔ انفال : ۷۲) اسی طرح کفار بھی کفر میں ایک دوسرے کے دوست اور بھائی ہیں،جیسا کہ فرمایا : «وَ الَّذِيْنَ كَفَرُوْا بَعْضُهُمْ اَوْلِيَآءُ بَعْضٍ» [ الأنفال :۷۳] ’’اور جن لوگوں نے کفر کیا ان کے بعض بعض کے دوست ہیں۔‘‘ بھائی ہونے سے مراد نسبی اخوت نہیں ہے، کیونکہ عبداللہ بن ابی اور دوسرے اکثر منافقین اوس و خزرج کے مشرکین میں سے تھے، اہلِ کتاب سے ان کی اخوت کفر ہی میں تھی۔ ¤ ➍ { لَىِٕنْ اُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَ لَا نُطِيْعُ فِيْكُمْ اَحَدًا اَبَدًا :} اس میں منافقین یہود کے دل میں آنے والے اس خطرے کا تدارک کر رہے ہیں کہ یہ لوگ اپنے قبیلوں اوس و خزرج میں سے مسلمان ہونے والوں کے رشتہ دار ہیں، ان مسلمانوں نے انھیں ہماری مدد سے منع کیا تو یہ مدد سے ہاتھ کھینچ لیں گے، اس لیے منافقین کہہ رہے ہیں کہ فکر مت کرو، ہم تمھارے بارے میں کسی کی بات نہیں مانیں گے۔ ¤ ➎ { وَ اللّٰهُ يَشْهَدُ اِنَّهُمْ لَكٰذِبُوْنَ :} اللہ تعالیٰ کی طرف سے اتنی ہی بات کافی تھی کہ قسم کھا کر فرما دیا کہ بلاشبہ وہ یقینا جھوٹے ہیں، مگر اللہ تعالیٰ نے اگلی آیت میں ان کی ایک ایک بات ذکر کر کے فرمایا کہ وہ ان میں سے کوئی وعدہ پورا نہیں کریں گے۔ علم بلاغت میں اسے اطناب کہتے ہیں، یعنی کسی جگہ مختصر بات کا موقع ہوتا ہے، کسی جگہ توسط کا اور کہیں ضرورت ہوتی ہے کہ بات کو خوب لمبا کر کے بیان کیا جائے۔ یہاں منافقین کے جھوٹ کو واضح کرنے اور انھیں ذلیل کرنے کے لیے اللہ تعالیٰ نے بات کو لمبا کیا ہے۔ (ابن عاشور)"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { لَىِٕنْ اُخْرِجُوْا لَا يَخْرُجُوْنَ مَعَهُمْ وَ لَىِٕنْ قُوْتِلُوْا لَا يَنْصُرُوْنَهُمْ:} اور ایسا ہی ہوا جیسے اللہ تعالیٰ نے فرمایا ہے، بنو قریظہ تہ تیغ کر دیے گئے اور خیبر والوں کو آخر کار جلا وطن ہونا پڑا مگر کوئی منافق ان کی مدد کو نہ پہنچ سکا۔ ¤ ➋ {وَ لَىِٕنْ نَّصَرُوْهُمْ لَيُوَلُّنَّ الْاَدْبَارَ:} یہ بات بطور فرض کہی گئی ہے۔ ¤ ➌ {ثُمَّ لَا يُنْصَرُوْنَ:} عربوں کا عام طریقہ تھا کہ بعض اوقات وہ میدان سے بھاگ جاتے اور پلٹ کر پھر حملہ آور ہوتے۔ اللہ تعالیٰ نے فرمایا کہ اگر بالفرض یہ منافقین ان کی مدد کے لیے آئے بھی تو پیٹھ دے کر بھاگ جائیں گے اور ایسے بھاگیں گے کہ ان اہلِ کتاب کی مدد کے لیے دوبارہ کوئی نہیں آئے گا۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ {لَاَانْتُمْ اَشَدُّ رَهْبَةً فِيْ صُدُوْرِهِمْ مِّنَ اللّٰهِ :} اس میں مسلمانوں کا حوصلہ بڑھایا ہے، کیونکہ جب انھیں معلوم ہوگا کہ دشمن ان سے شدید خوف زدہ ہے تو وہ بڑھ چڑھ کر حملے کریں گے۔ ¤ ➋ { ذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا يَفْقَهُوْنَ :} کیونکہ اگر وہ سمجھ دار ہوتے تو مخلوق کے بجائے خالق سے ڈرتے۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { لَا يُقَاتِلُوْنَكُمْ جَمِيْعًا اِلَّا فِيْ قُرًى مُّحَصَّنَةٍ … : ’’حِصْنٌ‘‘} کا معنی قلعہ ہے۔ {’’ مُحَصَّنَةٍ ‘‘} قلعہ بنائی ہوئی محفوظ بستیاں۔ {’’ جُدُرٍ ‘‘ ’’جِدَارٌ ‘‘} کی جمع ہے، دیواریں۔ یعنی یہ یہودی ایسے نامرد اور بزدل ہیں کہ کبھی اکٹھے ہو کر میدان میں تمھارا سامنا نہیں کریں گے، بلکہ قلعہ بند بستیوں میں یا دیواروں کے پیچھے رہ کر ہی لڑیں گے۔ اس طرح لڑنے والے ہمیشہ ذلیل ہی ہوتے ہیں، کیونکہ جو میدان میں نکلنے کی جرأت نہیں رکھتا اسے قلعے اور دیواریں بھی نہیں بچا سکتیں۔ تاریخ شاہد ہے کہ اصحاب رسول صلی اللہ علیہ وسلم کھلے میدان میں لڑنا پسند کرتے تھے اور چونکہ وہ شہادت کی تلاش میں لڑتے تھے، اس لیے دشمن پہلی چوٹ ہی میں پیٹھ پھیر کر بھاگ اٹھتا تھا۔ یہودی چونکہ موت سے بچتے تھے اس لیے وہ میدان میں آنے کے بجائے قلعوں اور دیواروں کی پناہ کے ذریعے سے زندگی بچانے کی کوشش میں رہتے تھے۔ یہ الگ بات ہے کہ ان کی قلعہ بند بستیاں بھی انھیں ذلت اور موت سے نہ بچا سکیں۔ ¤ ➋ { بَاْسُهُمْ بَيْنَهُمْ شَدِيْدٌ :} یعنی یہ یہودی اور منافقین تمھارے مقابلے میں تبھی آ سکتے تھے جب وہ آپس میں ایک ہوتے، جبکہ ان کا حال یہ ہے کہ وہ صرف اسلام دشمنی میں اکٹھے ہیں، ورنہ ان کی آپس کی لڑائی بہت سخت ہے۔ منافقین و یہود اور مشرکین کا ایک دوسرے سے یہی معاملہ ہے۔ پھر ان میں سے ہر ایک گروہ کے افراد آپس میں بھی ایک نہیں بلکہ ایک دوسرے سے شدید دشمنی رکھتے ہیں، ایسے لوگوں میں یہ حوصلہ کہاں کہ وہ تمھارے مقابلے میں اکٹھے ہو کر میدان میں نکلیں۔ ¤ ➌ {تَحْسَبُهُمْ جَمِيْعًا وَّ قُلُوْبُهُمْ شَتّٰى:’’ شَتّٰى ‘‘ ’’شَتِيْتٌ‘‘} کی جمع ہے، جیسے{’’ قَتِيْلٌ‘‘} کی جمع {’’ قَتْلٰي‘‘} ہے، یعنی تم انھیں گمان کرو گے کہ وہ اکٹھے ہیں، حالانکہ ان کے دل الگ الگ ہیں۔ ¤ ➍ {ذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا يَعْقِلُوْنَ :} اس کی وجہ یہ ہے کہ وہ ایسے لوگ ہیں جو کام کے انجام کو نہیں سوچتے اور عقل سے کام نہیں لیتے، بلکہ اپنی خواہشوں کے پیچھے چلتے ہیں، جس کا نتیجہ باہمی اختلاف اور عداوت ہی ہے۔ {’’ قَوْمٌ ‘‘} کے لفظ سے ظاہر ہے کہ یہ ان کے ایک آدھ آدمی کا معاملہ نہیں بلکہ پوری قوم کا مزاج ہی یہ ہے۔ ¤ ➎ ان آیات میں مسلمانوں کی تربیت ہے کہ وہ ایک دوسرے کی مخالفت، عناد اور دشمنی سے بہت زیادہ اجتناب کریں اور اچھی طرح سمجھ لیں کہ کوئی بھی قوم دشمن پر اسی وقت غالب ہو سکتی ہے جب ان کے دل ایک دوسرے کے کینے اور عداوت سے پاک اور ایک دوسرے سے جڑے ہوئے ہوں اور وہ قومی و اجتماعی مفاد کو اپنے ذاتی مفادات پر ترجیح دیتے ہوئے یک زبان و یک جان ہوں۔ ¤ ➏ مفسر ثناء اللہ امرتسری لکھتے ہیں : ’’اس آیت کے حکیمانہ مضمون کو اور مسلمانوں کی اندرونی حالت نوعی و صنفی، پھر صنفی در صنفی کو دیکھیں تو بے ساختہ منہ سے نکلتا ہے کہ یہ آیت ہمارے ہی حق میں اتری ہے۔ خواجہ حالی نے اس حالت کا نقشہ یوں کھینچا ہے: ¤ نہ سنی میں اور جعفری میں ہو ملت ¤ نہ نعمانی و شافعی میں ہو الفت ¤ وہابی سے صوفی کی کم نہ ہو نفرت ¤ مقلد کرے نامقلد پہ لعنت ¤ رہے اہل قبلہ میں جنگ ایسی باہم ¤ کہ دین خدا پر ہنسے سارا عالم ¤ کسی ایک غرضِ عام کے لیے ایک جگہ جمع نہیں ہو سکتے، ابتدا میں اگر ہوتے ہیں تو انتہا میں بگڑ جاتے ہیں۔ کچھ شک نہیں کہ یہ اطوار انھی لوگوں میں ہوتے ہیں جو قومی اغراض عامہ سے ناواقف ہوتے ہیں، اس لیے ان کے حق میں یہ الٰہی فیصلہ بالکل حق اور بجا ہے : «ذٰلِكَ بِاَنَّهُمْ قَوْمٌ لَّا يَعْقِلُوْنَ » ’’یہ اس لیے کہ وہ ایسے لوگ ہیں جو عقل نہیں رکھتے۔ (ثنائی)"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) {كَمَثَلِ الَّذِيْنَ مِنْ قَبْلِهِمْ قَرِيْبًا ذَاقُوْا وَبَالَ اَمْرِهِمْ … : ’’ كَمَثَلِ الَّذِيْنَ ‘‘} سے پہلے مبتدا محذوف ہے : {’’أَيْ مَثَلُهُمْ‘‘} یعنی ان بنو قریظہ کا حال جنھیں منافقین لڑنے پر ابھار رہے ہیں اور اپنی ہر طرح کی مدد کا یقین دلا رہے ہیں ان لوگوں کے حال جیسا ہے جو ان سے پہلے قریب ہی تھے۔ مراد ان سے بنو نضیر ہیں جنھوں نے اپنی بدعہدی کا وبال چکھا، وہ اپنی تمام تر قلعہ بندیوں، فوجی تیاریوں، بہادری کے دعوؤں اور منافقین و مشرکین کی امداد کے وعدوں کے باوجود پہلی چوٹ بھی نہ سہ سکے اور اپنی زمینیں، باغات اور مکانات مسلمانوں کے لیے چھوڑ کر ذلیل و رسوا ہو کر جلا وطن ہو گئے اور ان کے لیے آئندہ بھی دنیا اور آخرت میں درد ناک سزا ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {كَمَثَلِ الشَّيْطٰنِ اِذْ قَالَ لِلْاِنْسَانِ اكْفُرْ … :} یعنی بنو قریظہ کو لڑنے پر ابھارنے والے منافقوں کا حال شیطان کے حال جیسا ہے اور وہ انھیں اسی طرح بے یار و مددگار چھوڑ دیں گے جیسے شیطان انسان کے ساتھ معاملہ کرتا ہے کہ وہ انسان کو گمراہ کرتا ہے، پھر جب وہ اس کے پیچھے لگ کر کفر کا ارتکاب کر لیتا ہے تو شیطان کہہ دیتا ہے کہ میرا تجھ سے کوئی تعلق نہیں، میں تو اللہ رب العالمین سے ڈرتا ہوں۔ اللہ بہتر جانتا ہے کہ اس نے کتنے انانسانوں کو اس طرح گمراہ کیا اور گمراہ کرنے کے بعد ان سے بری ہو گیا۔ قرآن مجید میں اس کی مثال دنیا میں بدر کے موقع پر شیطان کی کفارِ قریش کو اپنی حمایت کا یقین دلا کر عین موقع پر فرار اختیار کرنا اور ان سے براء ت کا اظہار کرنا بیان ہوئی ہے (دیکھیے انفال : ۴۸) اور قیامت کے دن اس کا اپنے تمام پیروکاروں سے براء ت کا اعلان سورۂ ابراہیم (۲۲) میں مذکور ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {فَكَانَ عَاقِبَتَهُمَاۤ اَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيْهَا … :} یعنی قیامت کے دن نہ شیطان اور دوسرے گمراہ کرنے والے آگ سے یہ کہہ کر بچ سکیں گے کہ ہم نے انھیں کفر کی صرف دعوت دی تھی، اس پر مجبور نہیں کیا تھا، اب ہمارا ان سے کوئی تعلق نہیں اور نہ ہی کفار یہ کہہ کر بچ سکیں گے کہ ہمیں تو شیطان نے یا ان لوگوں نے گمراہ کیا تھا، اس لیے ہمارے بجائے انھیں عذاب دیا جائے، بلکہ گمراہی کی دعوت دینے والے بھی جہنم میں جائیں گے اور ان کے کہنے پر گمراہ ہونے والے سب لوگ بھی اور تمام ظالموں کی یہی جزا ہے۔ مزید دیکھیے سورۂ اعراف (39،38)، عنکبوت (13،12)، سبا (32،31)اور سورۂ ق (۲۳ تا ۲۹)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ :} غزوۂ بنو نضیر میں مسلمانوں پر اللہ تعالیٰ کے انعامات، یہود کی عہد شکنی کی سزا اور منافقین کی ریشہ دوانیوں اور ان کے انجام کے ذکر کے بعد تمام مسلمانوں کو نصیحت کی جا رہی ہے۔ {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا ‘‘} کے الفاظ کے ساتھ مخلص مسلمانوں کو بھی خطاب ہے اور منافق مسلمانوں کو بھی جو یہود سے دوستی رکھتے اور انھیں اپنی مدد کا یقین دلاتے تھے۔ دونوں کو اللہ تعالیٰ سے ڈرنے اور قیامت کے دن کی تیاری کی نصیحت کی گئی ہے، تاکہ مخلص مسلمان د نیا میں ملنے والی فتوحات اور نعمتوں کی خوشی میں آخرت کی تیاری کو نہ بھول جائیں اور منافقین میں سے جن کے دلوں میں ایمان کی کوئی رمق باقی ہے وہ اپنی روش پر نادم ہوں اور اللہ سے ڈر کر نفاق سے باز آجائیں اور آنے والے وقت کی فکر کرلیں۔ ¤ ➋ {وَ لْتَنْظُرْ نَفْسٌ : ’’ اتَّقُوا اللّٰهَ ‘‘} پر {’’وَانْظُرُوْا ‘‘} کے ساتھ عطف کے بجائے {’’ وَ لْتَنْظُرْ نَفْسٌ ‘‘} کے ساتھ عطف یہ احساس دلانے کے لیے ڈالا گیا ہے کہ یہ حکم ہرشخص کے لیے ہے۔ {’’ نَفْسٌ ‘‘} کو نکرہ لانے سے بھی عموم مراد ہے۔ گویا {’’ نَفْسٌ ‘‘} یہاں {’’ كُلُّ نَفْسٍ‘‘} کے معنی میں ہے، کیونکہ جس طرح نکرہ نفی کے سیاق میں آئے تو عموم مراد ہوتا ہے، اسی طرح اگر نکرہ امر، دعا اور ان جیسی چیزوں مثلاً شرط کے سیاق میں آئے تو وہاں بھی عموم مراد ہوتا ہے، جیسا کہ فرمایا : « وَ اِنْ اَحَدٌ مِّنَ الْمُشْرِكِيْنَ اسْتَجَارَكَ فَاَجِرْهُ » [ التوبۃ : ۶ ] ’’اور اگر مشرکین میں سے کوئی ایک تجھ سے پناہ طلب کرے تو اسے پناہ دے دے۔‘‘ (ابن عاشور) ¤ ➌ {مَا قَدَّمَتْ لِغَدٍ : ’’غَدٌ‘‘} (کل) سے مراد آخرت ہے۔ دنیا آج ہے اور آخرت کل، جو مرنے کے ساتھ ہی شروع ہو جاتی ہے۔ دور ہونے کے باوجود اسے {’’غَدٌ‘‘} کہنے میں یہ سبق ہے کہ اسے دور مت سمجھو، کیونکہ جو آنے والا ہے وہ قریب ہی ہے، خصوصاً جس کا علم ہی نہ ہو کہ کب آئے گا اور جو اگلے لمحے ہی آ سکتا ہو اس کے {’’ غَدٌ ‘‘} ہونے میں کیا شبہ ہے۔ ¤ ➍ { وَ اتَّقُوا اللّٰهَ اِنَّ اللّٰهَ خَبِيْرٌۢ بِمَا تَعْمَلُوْنَ :} یہاں {’’ اتَّقُوا اللّٰهَ ‘‘ } کو دوبارہ لایا گیا ہے، اس کی تین توجیہیں یہاں ذکر کی جاتی ہیں، ایک یہ کہ تکرار کا مقصد اللہ تعالیٰ کے تقویٰ کی تاکید ہے۔ دوسری توجیہ یہ ہے کہ پہلے {’’ اتَّقُوا اللّٰهَ ‘‘} کے ساتھ اللہ سے ڈرنے کا اور آخرت کی تیاری کا حکم دیا، اس کے بعد {’’ اِنَّ اللّٰهَ خَبِيْرٌۢ بِمَا تَعْمَلُوْنَ ‘‘} کے ساتھ اس کی وجہ بیان کرنا تھی، کیونکہ {’’إِنَّ‘‘} تعلیل کے لیے ہوتا ہے، لیکن چونکہ پہلے {’’ اتَّقُوا اللّٰهَ ‘‘} کے بعد فاصلہ زیادہ ہو رہا تھا، اس لیے {’’ اتَّقُوا اللّٰهَ ‘‘} کو دوبارہ لا کر اس کی وجہ بیان فرما دی کہ اللہ سے ڈر جاؤ، کیونکہ اللہ تعالیٰ اس سے پوری طرح باخبر ہے جو تم کرتے ہو۔ تمھارا کوئی کام اس سے مخفی نہیں جس پر تم اس کی گرفت سے بچ جاؤ، یا اچھا ہے تو اس کے انعام سے محروم رہو۔ تیسری توجیہ یہ ہے کہ پہلے {’’ اتَّقُوا اللّٰهَ ‘‘} سے مراد تقویٰ یعنی اللہ سے ڈرنے کا حکم ہے جس کی بدولت آدمی نیکی کرتا ہے اور گناہ سے بچتا ہے اور دوسرے {’’ اتَّقُوا اللّٰهَ ‘‘} سے مراد اس پر دوام ہے، یعنی ہمیشہ اللہ سے ڈرتے رہو، کیونکہ تم جو کچھ کرتے ہو یا کرو گے اللہ تعالیٰ اس سے پوری طرح باخبر ہے۔ اس معنی کی تائید اس بات سے ہوتی ہے کہ بعد میں فرمایا : « وَ لَا تَكُوْنُوْا كَالَّذِيْنَ نَسُوا اللّٰهَ » اور ان لوگوں یعنی منافقین کی طرح نہ ہو جاؤ جو (ایمان لانے کے بعد) اللہ کو بھول گئے، بلکہ ہمیشہ اللہ سے ڈرتے رہو۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { وَ لَا تَكُوْنُوْا كَالَّذِيْنَ نَسُوا اللّٰهَ … :} ایمان والوں کو اللہ کے تقویٰ اور آخرت کی تیاری کے حکم کے بعد اس کے احکام سے بے توجہی اور غفلت سے منع فرمایا، کیونکہ اس کا نتیجہ فسق اور نافرمانی ہوتا ہے اور اس کے لیے یہ اسلوب اختیار فرمایا کہ انھیں ان لوگوں کی طرح ہو جانے سے منع فرمایا جنھوں نے اللہ کے احکام پر عمل کو ترک کر دیا، تاکہ ایسے لوگ اور ان کا انجام ان کے سامنے رہے اور وہ ان کے نقش قدم پر چلنے سے بچتے رہیں۔ یہ ایسے ہی ہے جیسے{’’ صِرَاطَ الَّذِيْنَ اَنْعَمْتَ عَلَيْهِمْ ‘‘} کے بعد {’’ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَ لَا الضَّآلِّيْنَ ‘‘} فرمایا ہے۔ ¤ رہی یہ بات کہ وہ کون لوگ ہیں جن کے متعلق اللہ تعالیٰ فرما رہے ہیں : « نَسُوا اللّٰهَ » کہ وہ اللہ کو بھول گئے، تو قرآن مجید میں یہ الفاظ منافقین کے متعلق آئے ہیں، جیسا کہ فرمایا : « اَلْمُنٰفِقُوْنَ وَ الْمُنٰفِقٰتُ بَعْضُهُمْ مِّنْۢ بَعْضٍ يَاْمُرُوْنَ بِالْمُنْكَرِ وَ يَنْهَوْنَ ع عَنِ الْمَعْرُوْفِ وَ يَقْبِضُوْنَ اَيْدِيَهُمْ نَسُوا اللّٰهَ فَنَسِيَهُمْ اِنَّ الْمُنٰفِقِيْنَ هُمُ االْفٰسِقُوْنَ » [ التوبۃ : ۶۷ ]’’منافق مرد اور منافق عورتیں، ان کے بعض بعض سے ہیں، وہ برائی کا حکم دیتے ہیں اور نیکی سے منع کرتے ہیں اور اپنے ہاتھ بند رکھتے ہیں۔ وہ اللہ کو بھول گئے تو اس نے انھیں بھلا دیا۔ یقینا منافق لوگ ہی نافرمان ہیں۔‘‘ ان کے علاوہ یہود و نصاریٰ اور مشرکین کے متعلق بھی یہ الفاظ آئے ہیں۔ چنانچہ یہود کے متعلق فرمایا : « يُحَرِّفُوْنَ الْكَلِمَ عَنْ مَّوَاضِعِهٖ وَ نَسُوْا حَظًّا مِّمَّا ذُكِّرُوْا بِهٖ » [ المائدۃ : ۱۳ ] ’’ وہ کلام کو اس کی جگہوں سے پھیر دیتے ہیں اور وہ اس میں سے ایک حصہ بھول گئے جس کی انھیں نصیحت کی گئی تھی۔‘‘ اور نصاریٰ کے متعلق فرمایا : «وَ مِنَ الَّذِيْنَ قَالُوْۤا اِنَّا نَصٰرٰۤى اَخَذْنَا مِيْثَاقَهُمْ فَنَسُوْا حَظًّا مِّمَّا ذُككِّرُوْا بِهٖ » [ المائدۃ : ۱۴ ] ’’اور ان لوگوں سے جنھوں نے کہا بے شک ہم نصاریٰ ہیں، ہم نے ان کا پختہ عہد لیا، پھر وہ اس کا ایک حصہ بھول گئے جس کی انھیں نصیحت کی گئی تھی ۔‘‘ اور مشرکین کے متعلق فرمایا : « الَّذِيْنَ اتَّخَذُوْا دِيْنَهُمْ لَهْوًا وَّ لَعِبًا وَّ غَرَّتْهُمُ الْحَيٰوةُ الدُّنْيَا فَالْيَوْمَ نَنْسٰىهُمْ كَمَا نَسُوْا لِقَآءَ يَوْمِهِمْ هٰذَا » [ الأعراف : ۵۱ ] ’’وہ جنھوں نے اپنے دین کو دل لگی اور کھیل بنا لیا اور انھیں دنیا کی زندگی نے دھوکا دیا تو آج ہم انھیں بھلا دیں گے، جیسے وہ اپنے اس دن کی ملاقات کو بھول گئے۔‘‘ اس سورت میں چونکہ اس سے پہلے بنو نضیر کے یہود کا اور انھیں بدعہدی پر ابھارنے والے منافقین کا ذکر ہے، اس لیے بظاہر یہاں {’’ كَالَّذِيْنَ نَسُوا اللّٰهَ ‘‘} سے یہی دونوں مراد ہیں، اگرچہ الفاظ کے عموم میں ہر کافر و منافق داخل ہے۔ ¤ ➋ {فَاَنْسٰىهُمْ اَنْفُسَهُمْ اُولٰٓىِٕكَ هُمُ الْفٰسِقُوْنَ :} یعنی اللہ تعالیٰ کو بھلانے اور اس کی عبادت ترک کرنے کی پاداش میں اللہ تعالیٰ نے انھیں ان کی اپنی جانوں کی فکر بھی فراموش کروا دی۔ چنانچہ وہ اپنے اچھے برے کی فکر سے بھی بے پروا ہوگئے، نہ دنیا میں اپنی جانوں کی بھلائی کا اہتمام کیا اور نہ ہی آخرت کے عذاب سے انھیں بچانے کی کوشش کی، اس بنا پر گناہوں اور نافرمانیوں میں پڑے رہے۔ ¤ ➌ نسیان سے مراد یہاں اللہ کے احکام پر عمل ترک کرنا ہے۔ دیکھیے سورۂ طٰہٰ (۱۱۵،۱۲۶)۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {لَا يَسْتَوِيْۤ اَصْحٰبُ النَّارِ وَ اَصْحٰبُ الْجَنَّةِ … :} یہ اوپر کی آیات کا خلاصہ ہے کہ اللہ سے ڈرنے والے اور آخرت کی تیاری کرنے والے جنتی ہیں اور اسے بھولنے والے اور گناہ اور نافرمانی کی زندگی بسر کرنے والے جہنمی ہیں اور جہنمی اور جنتی دونوں برابر نہیں ہیں۔ مزید دیکھیے سورۂ ص (۲۸)، سجدہ (۱۸) اور سورۂ جاثیہ (۲۱)کی تفسیر۔ {’’ اَصْحٰبُ النَّارِ ‘‘} سے مراد کفار ہیں، جیسا کہ فرمایا : «وَ الَّذِيْنَ كَفَرُوْا وَ كَذَّبُوْا بِاٰيٰتِنَاۤ اُولٰٓىِٕكَ اَصْحٰبُ النَّارِ هُمْ فِيْهَا خٰلِدُوْنَ » [ البقرۃ : ۳۹ ] ’’اور جنھوں نے کفر کیا اور ہماری آیات کو جھٹلایا یہ لوگ آگ والے ہیں، وہ اس میں ہمیشہ رہنے والے ہیں۔‘‘ اور{ ’’ اَصْحٰبُ الْجَنَّةِ ‘‘ } سے مراد مومن ہیں۔ (دیکھیے احقاف : 14،13) {’’ اَصْحٰبُ النَّارِ ‘‘} اور {’’ اَصْحٰبُ الْجَنَّةِ ‘‘} دونوں کا ایک ہی جگہ ذکر دیکھنے کے لیے دیکھیے سورۂ بقرہ (82،81)۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { لَوْ اَنْزَلْنَا هٰذَا الْقُرْاٰنَ عَلٰى جَبَلٍ … :} یعنی یہ یہود اور منافقین قرآن مجید کی آیات سننے کے باوجود اللہ تعالیٰ سے نہیں ڈرتے، حالانکہ وہ تو ایسی عظیم الشان اور پر تاثیر کتاب ہے کہ اگر ہم اسے کسی پہاڑ پر نازل کرتے تو وہ بھی اللہ کے ڈر سے دب جاتا اور ٹکڑے ٹکڑے ہو جاتا، جیسا کہ فرمایا : « ثُمَّ قَسَتْ قُلُوْبُكُمْ مِّنْۢ بَعْدِ ذٰلِكَ فَهِيَ كَالْحِجَارَةِ اَوْ اَشَدُّ قَسْوَةً » [ البقرۃ : ۷۴ ] ’’پھر اس کے بعد تمھارے دل سخت ہوگئے تو وہ پتھروں جیسے ہیں یا سختی میں ان سے بھی بڑھ کر ہیں۔‘‘ اس سے معلوم ہوا کہ پہاڑوں میں بھی اللہ تعالیٰ نے ادراک اور سوجھ بوجھ رکھی ہے۔ ان کے سامنے امانت پیش کی گئی، مگر وہ اس سے ڈر گئے اور انھوں نے اسے اٹھانے سے انکار کر دیا۔ (دیکھیے احزاب : ۷۲) پہاڑوں اور جمادات میں ادراک کے وجود کے لیے سورۂ بقرہ (۷۳)، بنی اسرائیل (۴۴)، نحل (49،48) اور سورۂ ص (۱۸) کی تفا سیر پر نظر ڈال لیں۔ ¤ ➋ { وَ تِلْكَ الْاَمْثَالُ نَضْرِبُهَا لِلنَّاسِ …:} یعنی ہم یہ مثالیں لوگوں کے سامنے اس لیے بیان کرتے ہیں کہ وہ غور و فکر کریں کہ ایسی زبردست تاثیر والی چیز بھی ان کے دلوں پر اثر انداز نہیں ہو رہی تو اس کا سبب کیا ہے، پھر اس سبب کو دور کرنے کی کوشش کریں۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {هُوَ اللّٰهُ الَّذِيْ لَاۤ اِلٰهَ اِلَّا هُوَ :} اس سورت میں اللہ تعالیٰ کے نام اور اس کی ضمیروں اور صفات کا ذکر چالیس (۴۰) مرتبہ آیا ہے، چوبیس (۲۴) بار لفظ {’’ اللّٰهُ ‘‘} کے ساتھ اور سولہ (۱۶) مرتبہ ضمیر ظاہر یا صفات عالیہ کے ساتھ۔ غرض پوری سورت ہی اللہ تعالیٰ کی عظیم قدرت اور اس کے عجیب و غریب تصرفات کے ذکر سے بھری ہوئی ہے، اس لیے اس کی ابتدا اللہ تعالیٰ کی تسبیح اور اس کی صفات عزیز و حکیم کے ساتھ ہوئی ہے اور اختتام بھی اس کی ایسی صفات کے ساتھ ہوا ہے جن کے ذکر سے ایمان والوں کے دلوں میں اس کی خشیت و محبت میں اضافہ ہو اور سرکشوں کو اس کی گرفت اور ہیبت و جلال سے خوف دلایا جائے۔ ساتھ ہی ان صفات میں توحید کے حق ہونے اور شرک کے باطل ہونے کے دلائل بھی موجود ہیں۔ اس کے علاوہ ہر صفت کا سورت میں مذکور واقعات و مضامین میں سے کسی نہ کسی کے ساتھ تعلق بھی ہے۔ (ابن عاشور، ملخص) ¤ ➋ { هُوَ اللّٰهُ الَّذِيْ لَاۤ اِلٰهَ اِلَّا هُوَ :} اللہ تعالیٰ کی صفات میں سب سے پہلے اس کے ’’الٰہ واحد‘‘ ہونے کی صفت بیان فرمائی، کیونکہ یہ دوسری تمام صفات کی اصل ہے۔ دوسری تمام صفات اس صفت کی دلیل ہیں کہ عبادت اس اکیلے کا حق ہے، اس لیے قرآن مجید میں اسم مبارک {’’ اللّٰهُ ‘‘} کے بعد اکثر اس صفت کا ذکر آتا ہے، جیسا کہ آیت الکرسی میں اور سورۂ آلِ عمران کے شروع میں فرمایا : « اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ الْحَيُّ الْقَيُّوْمُ » ’’اللہ (وہ ہے کہ) اس کے سوا کوئی معبود نہیں، زندہ ہے، ہر چیز کو قائم رکھنے والا ہے۔‘‘ ¤ ➌ {عٰلِمُ الْغَيْبِ وَ الشَّهَادَةِ: ’’ الْغَيْبِ ‘‘} اور {’’ الشَّهَادَةِ ‘‘} مصدر ہیں جو اسم فاعل کے معنی میں ہیں، یعنی غائب و شاہد۔ مبالغے کے لیے اسم فاعل کی جگہ مصدر کا لفظ استعمال کیا گیا، جیسا کہ{’’ زَيْدٌ عَادِلٌ ‘‘} کے بجائے مبالغے کے لیے {’’ زَيْدٌ عَدْلٌ ‘‘} کہہ دیتے ہیں کہ زید سراپا عدل ہے۔ {’’ الْغَيْبِ وَ الشَّهَادَةِ ‘‘} پر الف لام استغراق کا ہے، یعنی وہ ہر غائب و حاضر کو جاننے والا ہے۔ وحدانیت کے بعد دوسری صفت علم بیان فرمائی، کیونکہ معبود ہونے کا لازمی تقاضا ہے کہ وہ ہر چیز کا علم رکھتا ہو اور اس کا علم کامل ہو۔ وہ معبود کیسا جسے معلوم ہی نہیں کہ کوئی میری عبادت کر رہا ہے۔ (دیکھیے احقاف : 6،5) {’’ الْغَيْبِ وَ الشَّهَادَةِ ‘‘} دوسروں کے اعتبار سے فرمایا، ورنہ اللہ تعالیٰ سے تو کوئی چیز غائب نہیں۔ اگر کوئی کہے کہ ’’عالم الغیب‘‘ تو واقعی صرف اللہ تعالیٰ ہے مگر ’’عالم الشہادت‘‘ تو اور لوگ بھی ہیں تو اس کا جواب یہ ہے کہ ہر ’’الشہادت‘‘ کا علم بھی اس کے سوا کسی کے پاس نہیں، چند چیزیں جاننے والے کو ’’عالم الشہادت ‘‘ نہیں کہا جا سکتا۔ مزید دیکھیے سورۂ رعد (10،9) اورسورۂ اعلیٰ (۷) کی تفسیر۔ ¤ ➍ { هُوَ الرَّحْمٰنُ الرَّحِيْمُ :} اس کی تفصیل کے لیے دیکھیے سورۂ فاتحہ کی تفسیر۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ {هُوَ اللّٰهُ الَّذِيْ لَاۤ اِلٰهَ اِلَّا هُوَ :} مزید صفات کے بیان کے لیے یہ جملہ دوبارہ ذکر فرمایا۔ تکرار سے مقصود اللہ تعالیٰ کے اسم مبارک {’’ اللّٰهُ ‘‘} کی عظمت اور اس کی وحدانیت کا خاص اہتمام ہے۔ ¤ ➋ { اَلْمَلِكُ:} یہ دوسری خبر ہے، اس پر الف لام کا مطلب یہ ہے کہ بادشاہ وہی ہے، کوئی اور نہیں، کیونکہ دوسرا کوئی اگر بادشاہ ہے تو چند لوگوں کا ہے، سب کا نہیں اور کچھ وقت کے لیے ہے، ہمیشہ کے لیے نہیں، جب کہ اللہ تعالیٰ سب کا بادشاہ اور ہمیشہ کے لیے بادشاہ ہے، جیسا کہ کسی شاعر نے کہا ہے : ¤ سروری زیبا فقط اس ذات بے ہمتا کو ہے ¤ حکمران ہے اک وہی باقی بتان آزری ¤ مزید دیکھیے سورۂ ملک کی پہلی آیت کی تفسیر۔ قرآن مجید میں اکیلے اللہ تعالیٰ کی بادشاہی کا ذکر متعدد مقامات پر ہے، دیکھیے سورۂ روم (۲۶)، حدید (۵)، فرقان (۲)، یس (۸۳) اور آلِ عمران (۲۶)۔ ¤ ➌ {الْقُدُّوْسُ:} نہایت پاک۔ {’’ اَلْمَلِكُ ‘‘} کے بعد {’’ الْقُدُّوْسُ ‘‘} لانے میں ایک مناسبت یہ ہے کہ بادشاہ ہونے کے باوجود وہ دنیا کے حکمرانوں میں پائے جانے والے عیوب اور خامیوں سے بالکل پاک ہے۔ ¤ ➍ { السَّلٰمُ :} سراسر سلامتی ہے، یعنی سلامتی والا ہے۔ خود ہر آفت اور مصیبت سے سالم ہے اور سب کو سلامتی دینے والا اور محفوظ رکھنے والا ہے، دوسرے صاحبِ قوت لوگوں کی طرح ناحق تباہی و بربادی پھیلانے والا نہیں۔ ایک دعا میں یہ الفاظ ہیں : [ اَللّٰهُمَّ أَنْتَ السَّلَامُ وَ مِنْكَ السَّلَامُ ] [ مسلم، المساجد، باب استحباب الذکر بعد الصلاۃ و بیان صفتہ : ۵۹۲ ] ’’اے اللہ! تو ہی سراسر سلامتی والا ہے اور تجھی سے سلامتی ملتی ہے۔‘‘ ¤ ➎ { الْمُؤْمِنُ :} امن دینے والا۔ جسے بھی امن ملتا ہے اسی سے ملتا ہے۔ ¤ ➏ { الْمُهَيْمِنُ :} نگران، نگہبان۔ تیسیر القرآن میں ہے : {’’ الْمُهَيْمِنُ ‘‘} کہتے ہیں : {’’ هَيْمَنَ الطَّائِرُ عَلٰي فِرَاخِهِ ‘‘} یعنی پرندے نے اپنے پر اپنے بچوں پر بچھا دیے، جیسے مرغی خطرے کے وقت اپنے چوزوں کو اپنے پروں کے نیچے چھپا لیتی ہے۔ لہٰذا {’’ الْمُهَيْمِنُ ‘‘} وہ ذات ہے جو (1)کسی کو خوف سے امن دے، (2) ہر وقت نگہبانی رکھے اور (3)کسی کا کوئی حق ضائع نہ ہونے دے۔ (منتہی الارب) ¤ ➐ { الْعَزِيْزُ الْجَبَّارُ: ’’ الْجَبَّارُ ‘‘} اپنی مرضی منوانے والا، جو دوسرے کو اپنا کام کرنے پر مجبور کر دے۔ اللہ تعالیٰ ساری مخلوق پر جبار ہے، کیونکہ ان میں سے کسی کی جرأت نہیں کہ وہ اس سے جو کروانا چاہے وہ نہ کرے، جیسا کہ فرمایا: «ثُمَّ اسْتَوٰۤى اِلَى السَّمَآءِ وَ هِيَ دُخَانٌ فَقَالَ لَهَا وَ لِلْاَرْضِ ائْتِيَا طَوْعًا اَوْ كَرْهًا قَالَتَاۤ اَتَيْنَا طَآىِٕعِيْنَ » [ حٰمٓ السجدۃ : ۱۱ ] ’’پھر وہ آسمان کی طرف متوجہ ہو ا اور وہ ایک دھواں تھا تو اس نے اس سے اور زمین سے کہا کہ آؤ خوشی سے یا مجبوری سے۔ دونوں نے کہا ہم خوشی سے آگئے۔‘‘کوئی اس حد سے تجاوز نہیں کر سکتا جو اللہ تعالیٰ نے اس کے لیے مقرر کر دی ہے، جیسا کہ انسان ایک ٹانگ تو اٹھا کر کھڑا ہو سکتا ہے مگر دونوں نہیں۔ جبر کا ایک معنی ٹوٹی ہوئی ہڈی جوڑنا اور نقصان پورا کرنا بھی ہے، یعنی وہی ہے جو ہر ایک کا نقصان پورا کرنے والا ہے۔ ¤ ➑ { الْمُتَكَبِّرُ:} اس کے دو مفہوم ہیں، ایک یہ کہ کوئی شخص فی الحقیقت بڑا نہ ہو مگر بڑا بننے کی کوشش کرے، خواہ وہ کوئی جن ہو یا انسان اور یہ صفت انتہائی مذموم ہے۔ دوسرا وہ جو فی الحقیقت بڑا ہو اور بڑا ہی ہو کر رہے اور یہ صفت صرف اللہ تعالیٰ ہی کے لیے سزاوار ہے اور اس کے حق میں یہ ایک خوبی ہے جو دوسری کسی مخلوق میں نہیں پائی جاتی۔ کائنات کی باقی تمام چیزیں خواہ جاندار ہوں یا بے جان اس کے مقابلے میں چھوٹی اور حقیر ہیں۔ (تیسیر القرآن) ¤ ➒ {سُبْحٰنَ اللّٰهِ عَمَّا يُشْرِكُوْنَ :} یعنی یہ صفات دلیل ہیں کہ اللہ تعالیٰ ان تمام چیزوں سے پاک ہے جنھیں مشرکین نے اس کا شریک بنا رکھا ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { هُوَ اللّٰهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ :} خلق، برء اور تصویر پیدائش کے تین مراحل ہیں، پہلا مرحلہ یہ کہ کوئی چیز بنانے سے پہلے اس کا پورا اندازہ لگانا اور نقشہ و خاکہ بنانا ہوتا ہے، یہ خلق ہے۔ اللہ تعالیٰ نے ہر چیز کا پہلے ہی ایک اندازہ اور نقشہ طے کر دیا ہے کہ وہ کیسی ہوگی، مثلاً انسان کی کیا شکل ہوگی، درخت کیسا ہو گا وغیرہ۔ دوسرا مرحلہ ان چیزوں کو وجود میں لانا ہے جن سے اسے بنایا جانا ہے اور انھیں تراش خراش اور ڈھال کر وہ صورت قبول کرنے کے قابل بنانا جو اس کے لیے طے کی گئی ہے۔ یہ ’’برء‘‘ ہے۔ مثلاً انسان کو مٹی سے بنایا، مٹی کو گارا بنایا، پھر آدم علیہ السلام کا ڈھانچہ بنایا۔ تیسرا اور آخری مرحلہ تصویر ہے جس کے ساتھ کوئی چیز مکمل ہو کر وجود میں آ جاتی ہے۔ کائنات کی ہر بڑی سے بڑی اور چھوٹی سے چھوٹی چیز کو اللہ تعالیٰ نے تصویر عطا فرمائی ہے، زمین و آسمان ہوں یا چیونٹی اور ذرہ، ہر چیز کو پیدا کرنے کے تمام مراحل اسی کے ہاتھ میں ہیں، انسان اگر کچھ بناتا بھی ہے تو اس کے ہر کام کا خالق بھی اللہ تعالیٰ ہی ہے، جیسا کہ فرمایا : « وَ اللّٰهُ خَلَقَكُمْ وَ مَا تَعْمَلُوْنَ» [ الصافات : ۹۶ ] ’’اور اللہ ہی نے تمھیں پیدا کیا اور اسے بھی جو تم کرتے ہو۔‘‘ ان تینوں اسماء میں سے ہر ایک مطلق بنانے اور پیدا کرنے کے معنی میں بھی استعمال ہوتا ہے۔ مزید دیکھیے سورۂ اعراف (۱۱ ) کی تفسیر۔ ¤ ➋ { لَهُ الْاَسْمَآءُ الْحُسْنٰى :} یعنی ان آیات میں جو اسماء اور صفات بیان ہوئی ہیں اللہ تعالیٰ صرف انھی کے ساتھ متصف نہیں، بلکہ ہر بہترین اسم و صفت کا وہی مستحق ہے۔ دیکھیے سورۂ اعراف (۱۸۰) کی تفسیر۔ ¤ ➌ {يُسَبِّحُ لَهٗ مَا فِي السَّمٰوٰتِ وَ الْاَرْضِ وَ هُوَ الْعَزِيْزُ الْحَكِيْمُ:} سورت کی ابتدا بھی اسی بات سے ہوئی ہے اور انتہا بھی۔ ابتدا میں{’’ سَبَّحَ لِلّٰهِ ‘‘} ہے اور انتہا میں {’’ يُسَبِّحُ لَهٗ ‘‘} ہے۔ اس میں ماضی، حال اور مستقبل تینوں زمانے آگئے۔ آیت کی تفسیر کے لیے دیکھیے سورۂ حدید کی پہلی آیت اور سورۂ بنی اسرائیل (۴۴) کی تفسیر۔ ¤ ➍ معقل بن یسار رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ جو شخص صبح کے وقت تین مرتبہ {’’ أَعُوْذُ بِاللّٰهِ السَّمِيْعِ الْعَلِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ ‘‘} کہے، پھر سورۂ حشر کی آخری تین آیتیں پڑھے، تو اللہ تعالیٰ اس کے ساتھ ستر ہزار (70,000) فرشتے مقرر کر دیتے ہیں جو شام تک اس کے لیے دعا کرتے رہتے ہیں۔ اگر وہ اس دن فوت ہو جائے تو شہید فوت ہوگا اور جو شام کو انھیں پڑھ لے اسے بھی یہ مرتبہ ملے گا۔‘‘ [ ترمذي، فضائل القرآن، باب في فضل قراء ۃ آخر سورۃ الحشر : ۲۹۲۲۔ مسند أحمد : 26/5، ح : ۲۰۳۰۶ ] مسند احمد کے محققین اور شیخ ناصر الدین البانی نے اس حدیث کو ضعیف کہا ہے۔ تفصیل مسند احمد کی تحقیق میں ملاحظہ فرمائیں۔"
    }
  ]
}