{
  "surah": "Al-Anaam",
  "surah_number": 6,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "یہ سورت اسلام کے بنیادی عقائد توحید و آخرت وغیرہ کے ثبوت اور مشرکین اور اہل بدعت کے رد کے دلائل پر مشتمل ہے، سورۂ بقرہ کے ساتھ اس کی فضیلت ذکر ہو چکی ہے۔ ¤ (آیت 1) ➊ {اَلْحَمْدُ لِلّٰهِ:} اس آیت میں اکیلے اللہ تعالیٰ کے تمام خوبیوں کا مالک اور معبود ہونے کی دلیل بیان کی گئی ہے اور کفار کے شرک پر تعجب کا اظہار کیا گیا ہے۔ ¤ ➋ {خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ … :} اللہ تعالیٰ نے یہاں دو قسم کی چیزوں کا ذکر فرمایا ہے، ایک زمین و آسمان کا جو جوہر ہیں، یعنی اپنا الگ وجود رکھتے ہیں اور دوسرے اندھیروں اور اجالے کا جو عرض ہیں، یعنی دوسری چیزوں کے ذریعے سے قائم ہیں۔ مطلب یہ ہے کہ کائنات میں کوئی جوہر یا عرض ایسا نہیں جسے اللہ تعالیٰ نے پیدا نہ کیا ہو۔ اندھیروں اور اجالے سے یہی رات اور دن مراد ہیں، یا پھر ایمان کا نور اور کفر کے اندھیرے۔ (قرطبی) {’’ النُّوْرَ ‘‘} کو واحد اور {’’الظُّلُمٰتِ ‘‘} کو جمع بیان کرنے میں یہ حکمت معلوم ہوتی ہے کہ ایمان کا نور ایک ہی ہے، جبکہ کفر کی گمراہیاں بے شمار ہیں۔ سیدھا راستہ ایک ہے اور غلط راستوں کا شمار ہی نہیں۔ ¤ ➌ {ثُمَّ الَّذِيْنَ كَفَرُوْا بِرَبِّهِمْ يَعْدِلُوْنَ:} یعنی جب ہر چیز کا خالق و مالک صرف اللہ تعالیٰ ہے اور یہ مشرکین اسے اپنا رب ( پالنے والا) بھی تسلیم کرتے ہیں تو ان پر لازم تھا کہ عبادت بھی اسی کی کرتے، مگر یہ پھر بھی دوسروں کو اس کے برابر گردانتے ہیں، ان کے سامنے سجدے کرتے ہیں، ان کے نام کی نذریں چڑھاتے اور منتیں مانتے ہیں اور مشکلات میں ان سے مدد طلب کرتے ہیں۔ کس قدر بے عقلی ہے کہ پیدا اللہ تعالیٰ کرے، روزی بھی وہی دے، پھر مانگا غیرسے جائے اور اسے اپنے رب کے برابر ٹھہرایا جائے۔ دیکھیے سورۂ لقمان (۱۰، ۱۱) اور سورۂ عنکبوت(۶۱ تا ۶۳)۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2 )➊ {هُوَ الَّذِيْ خَلَقَكُمْ مِّنْ طِيْنٍ:} تمھیں مٹی سے پیدا کیا، یعنی آدم علیہ السلام کو، باقی سب لوگ چونکہ آدم ہی کی اولاد ہیں، اس لیے گویا سبھی مٹی سے پیدا ہوئے۔ {’’ طِيْنٍ ‘‘} میں تنوین تحقیر کے لیے ہے، اس لیے اس کا ترجمہ ’’ حقیر مٹی‘‘ کہا گیا ہے۔ ¤ ➋ {ثُمَّ قَضٰۤى اَجَلًا:} پھر ایک مدت مقرر کی، یعنی موت کا وقت اور ایک اور مدت اس کے ہاں مقرر ہے، یعنی قیامت کا وقت، جسے صرف وہ جانتا ہے، اس کے سوا کسی کو اس کا علم نہیں۔ پھر بھی تم شک کرتے ہو، یعنی اتنا بھی نہیں سمجھتے کہ جس نے مٹی کی ایک مٹھی سے تمھیں پیدا کیا، وہ دوبارہ بھی تمھیں زندہ کر سکتا ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3){وَ هُوَ اللّٰهُ فِي السَّمٰوٰتِ وَ فِي الْاَرْضِ …:} اوپر کی آیات میں اللہ تعالیٰ کی قدرت کے کمال کو ثابت کیا ہے، اس آیت میں اس کے علم کا کامل ہونا ثابت فرمایا ہے، یعنی وہی ہستی ہے جسے آسمانوں اور زمین میں اللہ کے نام سے پکارا جاتا ہے۔ یہ آیت تقریباً اس آیت کی ہم معنی ہے : «وَ هُوَ الَّذِيْ فِي السَّمَآءِ اِلٰهٌ وَّ فِي الْاَرْضِ اِلٰهٌ وَ هُوَ الْحَكِيْمُ الْعَلِيْممُ » [الزخرف : ۸۴]’’اور وہی ہے جو آسمانوں میں معبود ہے اور زمین میں بھی معبود ہے اور وہی کمال حکمت والا، سب کچھ جاننے والا ہے۔‘‘ یعنی آسمانوں اور زمین میں ایک ہی ذات ہے جسے ’’اللہ ‘‘ کہہ کر پکارا جاتا ہے، جس کی آسمانوں اور زمین دونوں میں حکومت ہے اور دونوں میں اس اکیلے ہی کی عبادت کی جاتی ہے، کیونکہ وہ تمھاری ہر چھپی یا کھلی بات کو اور تمھارے ہر عمل کو جانتا ہے۔ اس سے اللہ تعالیٰ کے علم کا کمال ثابت ہوتا ہے اور یہ کمال اس کے معبود برحق ہونے کی ایک دلیل ہے۔ ¤ بعض لوگ اس آیت کو اللہ تعالیٰ کے عرش پر ہونے کے خلاف بطور دلیل پیش کرتے ہیں اور کہتے ہیں کہ اللہ تعالیٰ کی ذات ہر جگہ ہے اور کوئی عرش وغیرہ نہیں، جس پر اللہ تعالیٰ بلند ہو، حالانکہ اس آیت کا یہ مطلب ہر گز نہیں، کیونکہ آیت میں اس کی ذات یا شخصیت کے آسمان و زمین میں ہونے کا بیان نہیں بلکہ زمین و آسمان میں اس کے ’’الله‘‘ یعنی معبود برحق ہونے کا بیان ہے، رہی اس کی ذات تو قرآن مجید میں اس کے عرش کا اور اللہ تعالیٰ کے اس کے اوپر ہونے کا واضح بیان ہے۔ قرآن کریم میں تقریباً اٹھارہ جگہ اللہ تعالیٰ کے عرش کا ذکر ہے، اور آٹھ جگہ اللہ تعالیٰ کے عرش پر مستوی ہونے کا ذکر ہے، اس لیے اس میں کوئی شک نہیں کہ اللہ تعالیٰ کی ذات عرش کے اوپر ہے، البتہ اپنے علم اور قدرت کے اعتبار سے وہ ہر جگہ ہے۔ اس لیے یہاں اس کے زمین و آسمان میں اللہ اور الٰہ ہونے کا مطلب یہی ہے کہ دونوں جگہ عبادت اسی کی کرنا لازم ہے اور دونوں جگہ وہی ہے جو کمال علم کی وجہ سے معبود برحق ہونے کا حق دار ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {وَ مَا تَاْتِيْهِمْ مِّنْ اٰيَةٍ … :} ان آیات سے مراد وہ احکام بھی ہیں جو آیات کی صورت میں انبیاء علیہم السلام پر اترتے رہے اور وہ معجزات بھی جو نبوت کی دلیل کے طور پر اترتے رہے۔ اس کے علاوہ زمین و آسمان میں موجود وہ بے شمار نشانیاں بھی جو اللہ کے وجود اور اس کی وحدانیت کی دلیل ہیں، مثلاً دیکھیے سورۂ بقرہ (۱۶۴)، یوسف (۱۰۵) اور ذاریات (۲۰ تا ۲۳)۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {فَقَدْ كَذَّبُوْا بِالْحَقِّ … :} اوپر کی آیات میں توحید اور آخرت کو ثابت کیا ہے، اس آیت میں تقلید کا باطل ہونا ثابت ہو رہا ہے ۔( رازی) حق سے مراد رسول اللہ صلی اللہ علیہ وسلم اور آپ پر اترنے والی کتاب ہیں۔ کفار جس چیز پر ہنستے تھے وہ آخرت اور اس میں پیش آنے والے معاملات تھے اور اللہ تعالیٰ کے وہ وعدے بھی جو اس نے قرآن میں دین اسلام کے غالب اور دشمنوں کے مغلوب ہونے سے متعلق کیے تھے۔ مطلب یہ ہے کہ اب تو یہ کفار اس وعدے کو محض مذاق سمجھتے ہوئے اس پر ہنستے اور ان کا مذاق اڑاتے ہیں، لیکن عنقریب مسلمانوں کو مدینہ منورہ کی طرف ہجرت کرنے کا حکم دیا جائے گا اور پھر ایسے واقعات پیش آئیں گے کہ جن سے یہ وعدہ حقیقت بن کر ان کے سامنے آجائے گا اور آنکھیں بند ہونے کی دیر ہے کہ آخرت بھی، جس کا وہ مذاق اڑاتے تھے ان کے سامنے آجائے گی۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {اَلَمْ يَرَوْا كَمْ اَهْلَكْنَا …:} کفار کو متنبہ کیا جا رہا ہے کہ کیا انھیں معلوم نہیں کہ ان سے پہلے کئی اقوام، مثلاً قوم نوح، عاد و ثمود اور آل فرعون جو قوت و اقتدار میں ان سے کہیں بڑھ کر تھے اور بارشوں اور نہروں کی وجہ سے ان کے باغ اور کھیت سر سبز و شاداب تھے اور عیش و خوشحالی کا دور دورہ تھا، جب انھوں نے بغاوت اور سرکشی پر کمر باندھی تو ہم نے ان کا نام و نشان مٹا دیا، پھر ان کے بعد اور قومیں پیدا کر دیں۔ جب تم سے زیادہ طاقت ور قوموں کو ہم نے ان کے گناہوں کی وجہ سے ہلاک کر دیا تو تمھاری کیا حیثیت ہے۔ مزید دیکھیے سورۂ احقاف (۲۶، ۲۷) اس آیت سے یہ بھی معلوم ہوا کہ دنیوی ترقی اللہ تعالیٰ کے راضی ہونے کی دلیل نہیں، بلکہ ان پر حجت قائم کرنے کے لیے استدراج (رسی ڈھیلی کرنا) بھی ہو سکتا ہے۔ اس امتحان کا نتیجہ آخرت کو سامنے آئے گا۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {وَ لَوْ نَزَّلْنَا عَلَيْكَ كِتٰبًا …:} اب ان لوگوں کا ذکر ہے جو انبیاء کے معجزات کی کوئی الٹی سیدھی تاویل کر کے انھیں جھٹلا دیتے تھے۔ ( رازی) اس آیت میں کفار مکہ کی نبی کریم صلی اللہ علیہ وسلم کو جھٹلانے کے لیے پیش کردہ فرمائشوں میں سے ایک فرمائش (بنی اسرائیل : ۹۳) کا جواب ہے کہ ہم اس وقت تک تمھارے آسمان پر چڑھنے کا یقین نہیں کریں گے جب تک تم ہم پر ایسی کتاب نازل نہیں کرتے جسے ہم خود پڑھیں۔ یہ لوگ اپنی سرکشی اور کفر کی روش میں اس قدر پختہ ہیں کہ اگر ہم ان پر آسمان سے لکھی لکھائی کتاب بھی اتار دیتے، جسے یہ اپنے ہاتھوں سے چھو کر صاف معلوم کر لیتے کہ یہ کوئی خیالی اور نظر بندی جیسی چیز نہیں، بلکہ حقیقت ہے، تب بھی یہ لوگ اسے کھلا جادو قرار دیتے، پھر اگر یہ بد بخت قرآن کو جادو قرار دیتے ہیں تو کیا تعجب ہے ؟ (قرطبی) شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’جس کی قسمت میں ہدایت نہیں اس کا شبہ نہیں مٹتا۔‘‘ (موضح) مزید دیکھیے سورۂ حجر (۱۴، ۱۵) اور طور (۴۴)۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { وَ قَالُوْا لَوْ لَاۤ اُنْزِلَ عَلَيْهِ مَلَكٌ:} یہ نبوت کے منکرین کا ایک اور اعتراض ہے کہ اگر اللہ تعالیٰ کو مخلوق کی طرف رسول بھیجنا ہی تھا تو وہ انسان کے بجائے فرشتہ ہونا چاہیے تھا، یا فرشتہ اس کے ساتھ ساتھ پھرتا اور کہتا کہ یہ اللہ کا رسول ہے، اس پر ایمان لے آؤ، ورنہ تمھیں سزا دی جائے گی۔ ¤ ➋ { وَ لَوْ اَنْزَلْنَا مَلَكًا لَّقُضِيَ الْاَمْرُ … :} یہ پہلا جواب ہے۔ (رازی) کیونکہ اللہ تعالیٰ کا یہ طریقہ چلا آیا ہے کہ جب کوئی قوم اپنے نبی سے معجزہ طلب کرے اور وہ اسے دکھا دیا جائے، لیکن اس کے بعد بھی وہ ایمان نہ لائے تو اسے ہلاک کر دیا جاتا ہے، اس لیے اگر فرشتے اصل صورت میں نازل ہوتے تو ان کے پاس عذاب لے کر آتے اور ان کا قصہ ہی تمام ہو جاتا۔ دیکھیے سورۂ حجر (۶ تا ۸) اور سورۂ فرقان (22،21)۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {وَ لَوْ جَعَلْنٰهُ مَلَكًا … :} یہ کفار کے اعتراض کا دوسرا جواب ہے، یعنی ان کے مطالبے کو مانتے ہوئے ہم فرشتہ اتارنا منظور کر بھی لیتے تو وہ بھی انسانی صورت میں آتا، کیونکہ یہ اسے اس کی اصل شکل میں تو دیکھ ہی نہیں سکتے اور جب وہ آدمی کی شکل میں ہوتا تو پھر یہی اعتراض کرتے جو اب کر رہے ہیں۔ اس وقت کے کافر کسی انسان کو نبی ماننے کے لیے تیار نہیں تھے، کیونکہ آپ صلی اللہ علیہ وسلم ان کی قوم سے تھے، ان کے سامنے جوان ہوئے اور انھی میں زندگی گزاری، اس لیے وہ آپ صلی اللہ علیہ وسلم کے بشر ہونے کا انکار نہیں کر سکتے تھے، لہٰذا آپ کے نبی ہونے کا انکار کر دیا۔ اب کچھ لوگ آپ صلی اللہ علیہ وسلم کو نبی تو مانتے ہیں، مگر آپ صلی اللہ علیہ وسلم کو انسان ماننے کے لیے تیار نہیں۔ گویا ایک ہی عقیدے کی دو شکلیں ہیں اور دونوں باطل ہیں، حالانکہ اللہ نے اپنا احسان جتلایا ہے کہ میں نے انسانوں میں انھی کے اندر سے رسول بھیجا ہے۔ دیکھیے سورۂ آل عمران (۱۶۴)۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {وَ لَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّنْ قَبْلِكَ …:} اس آیت میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ آپ کو جھٹلانے اور اللہ کے عذاب کا مذاق اڑانے کا جو معاملہ آپ کے ساتھ ہو رہا ہے، پہلے رسولوں کے ساتھ بھی ہوا، آخر کار اسی عذاب نے کفار کو آگھیرا جس کا مذاق اڑاتے ہوئے وہ کہا کرتے تھے کہ کوئی عذاب نہیں آئے گا، یہ محض دھمکی ہے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {قُلْ سِيْرُوْا فِي الْاَرْضِ …:} اس سے کفار کو ڈرانا مقصود ہے، یعنی دنیا کے مختلف خططوں میں جو قومیں پائی گئی ہیں ذرا ان کے حالات اور تاریخ پر غور کرو، تمھیں خود معلوم ہو جائے گا کہ جن قوموں نے اللہ کے رسولوں کو جھٹلایا اور ان کی اطاعت سے انکار کیا انھیں کیسے عبرت ناک انجام سے دو چار ہونا پڑا، پھر اس سے اندازہ کر لو کہ اب جو تم ہمارے آخری رسول صلی اللہ علیہ وسلم اور آخری کتاب کا مذاق اڑا رہے ہو تمھارا انجام کیا ہو سکتا ہے اور کیا ہونا چاہیے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {قُلْ لِّمَنْ مَّا فِي السَّمٰوٰتِ وَ الْاَرْضِ … :} وعظ و نصیحت اور ڈرانے کے بعد انھی تینوں اصولوں (کائنات کی ابتدا، اسے دوبارہ زندہ کرنے اور انبیاء کی نبوت) کو ثابت کرنے پر دلیل قائم کی ہے۔ نبی صلی اللہ علیہ وسلم کو حکم دیا گیا کہ آپ ان کافروں سے پوچھیے کہ آسمانوں اور زمین کا مالک کون ہے؟ اس سوال کا مقصد ڈانٹ اور پھٹکار ہے۔ پھر اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو حکم دیا کہ آپ خود ہی جواب دے دیجیے کہ اللہ کے سوا کون ہو سکتا ہے اور یہ جملہ بھی رسول اللہ صلی اللہ علیہ وسلم ہی کی زبانی ادا کیا گیا ہے کہ آپ یہ بھی کہہ دیجیے کہ اللہ تعالیٰ نے اپنے بندوں پر رحم کرنا لازم کر لیا ہے، وہ توبہ واستغفار قبول کرتا ہے اور اسی صفت رحمت کا تقاضا ہے کہ اس نے تمھیں دنیا میں مہلت دی ہے، فوراً نہیں پکڑتا، لیکن قیامت کے دن تم سب کو اکٹھا کرے گا۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جب اللہ تعالیٰ نے مخلوق کو پیدا فرمایا تو اس نے اپنے پاس کتاب میں، جو اس کے پاس عرش کے اوپر ہے، اپنے متعلق لکھ دیا کہ میری رحمت میرے غضب پر غالب ہے۔‘‘[ بخاری، التوحید، باب قول اللہ تعالٰی: «ویحذرکم اللہ نفسہ…» : ۷۴۰۴ ] ¤ لیکن یہ رحمت قیامت کے دن صرف اہل ایمان کے لیے ہو گی، کافروں کے لیے اللہ تعالیٰ سخت غضب ناک ہو گا۔ دنیا میں اس رحمت سے مسلم اور کافر، نیک اور بد سب فائدہ اٹھا رہے ہیں، اللہ تعالیٰ نے فرمایا : «وَ رَحْمَتِيْ وَ سِعَتْ كُلَّ شَيْءٍ فَسَاَكْتُبُهَا لِلَّذِيْنَ يَتَّقُوْنَ وَ يُؤْتُوْنَ الزَّكٰوةَ  وَ الَّذِيْنَ هُمْ بِاٰيٰتِنَا يُؤْمِنُوْنَ» [ الأعراف : ۱۵۶] ’’اور میری رحمت نے ہر چیز کو گھیر رکھا ہے، سو میں اسے ان لوگوں کے لیے ضرور لکھ دوں گا جو ڈرتے ہیں اور زکوٰۃ دیتے ہیں اور ( ان کے لیے) جو ہماری آیات پر ایمان لاتے ہیں۔‘‘ مزید دیکھیے سورۂ بقرہ (۲۱۸) رہا دنیا میں تو اللہ تبارک و تعالیٰ نے فرمایا : «كُلًّا نُّمِدُّ هٰۤؤُلَآءِ وَ هٰۤؤُلَآءِ مِنْ عَطَآءِ رَبِّكَ وَ مَا  كَانَ عَطَآءُ رَبِّكَ مَحْظُوْرًا» [ بنی إسرائیل : ۲۰ ] ’’ہم ہر ایک کی مدد کرتے ہیں، ان کی بھی اور ان کی بھی، تیرے رب کی بخشش سے اور تیرے رب کی بخشش کبھی بند کی ہوئی نہیں۔‘‘ ¤ ➋ {لَيَجْمَعَنَّكُمْ اِلٰى يَوْمِ الْقِيٰمَةِ لَا رَيْبَ فِيْهِ …:} یعنی قیامت کا آنا ایسی حقیقت ہے جس سے کوئی سمجھ دار آدمی انکار نہیں کر سکتا، اس سے انکار اگر کوئی کر سکتا ہے تو وہی جو اپنی عقل و فطرت سے کام نہیں لیتا اور خسارے کے سودے پر اڑا ہوا ہے، نفع کے سودے کی خواہش ہی نہیں رکھتا، حالانکہ اللہ نے فرمایا : «فَمَنْ زُحْزِحَ عَنِ النَّارِ وَ اُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ» [ آل عمران : ۱۸۵ ] ’’پھر جو شخص آگ سے دور کر دیا گیا اور جنت میں داخل کر دیا گیا تو یقینا وہ کامیاب ہو گیا۔‘‘"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {وَ لَهٗ مَا سَكَنَ فِي الَّيْلِ وَ النَّهَارِ …:} گزشتہ آیت : «قُلْ لِّمَنْ مَّا فِي السَّمٰوٰتِ وَ الْاَرْضِ » میں مکان (جگہ) کے اعتبار سے اللہ تعالیٰ کے ہر جگہ بادشاہ ہونے کا بیان تھا، اس آیت میں زمان اور وقت کے اعتبار سے اس کی بادشاہی عام ہونے کا ذکر ہے۔ کیونکہ آسمان و زمین کے سوا کوئی مکان ( جگہ) نہیں اور رات اور دن کے سوا کوئی زمانہ ( وقت) نہیں، گویا ہر جگہ اور ہر وقت اسی کی حکومت اور اسی کا قبضہ و اقتدار ہے۔ پھر یہ ثابت کرنے کے بعد کہ اللہ تعالیٰ تمام جگہوں اور تمام اوقات اور زمانوں کا مالک ہے، فرمایا : «وَ هُوَ السَّمِيْعُ الْعَلِيْمُ» یعنی وہ ہر چیز کی دعا اور پکار سنتا ہے۔ {’’الْعَلِيْمُ ‘‘} ہر چیز کے عمل اور اس کی ضرورت سے آگاہ ہے تو پھر کسی اور کو پکارنے کی ضرورت کیا ہے۔ یاد رہے کہ یہاں {’’ مَا سَكَنَ ‘‘} میں سکون سے مراد حلول، یعنی رہنا ہے اور سکون جو حرکت کی ضد ہے وہ مراد نہیں۔ اس لیے ٹھہرا ہوا ہے کا معنی بھی یہی ہے کہ جو بھی رات اور دن میں بس رہا ہے۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ {قُلْ اَغَيْرَ اللّٰهِ اَتَّخِذُ وَلِيًّا:} ’’ولی‘‘ کا معنی دوست بھی آتا ہے، مالک و مدد گار اور معبود و کارساز بھی، یہاں اس کا معنی مالک و مدد گار اور معبود و کارساز ہے، یعنی وہ زمان و مکاں کا خالق ہی نہیں بلکہ اسے باقی رکھنے والا اور چلانے والا بھی وہی ہے، اسے کسی سے کچھ لینے کی ضرورت نہیں، باقی سب اسی کا دیا ہوا کھانے والے اور ہر لحاظ سے اس کے محتاج ہیں۔ اس ایک جملے سے مشرکین نے اللہ کے سوا جتنے معبود بنا رکھے تھے ان سب کی نفی ہو جاتی ہے۔ مزید دیکھیے سورۂ ذاریات (۵۶ تا ۵۸)۔ ¤ ➋ {قُلْ اِنِّيْۤ اُمِرْتُ اَنْ اَكُوْنَ اَوَّلَ مَنْ اَسْلَمَ …:} کیونکہ میں اس کا رسول ہوں اور رسول کا کام یہ ہے کہ تمام بندوں سے پہلے اور سب سے بڑھ کر اپنے مالک کے احکام کو مانے اور «وَ لَا تَكُوْنَنَّ مِنَ الْمُشْرِكِيْنَ» کا مطلب یہ ہے کہ کوئی شرک میں مبتلا ہوتا ہے تو ہوتا پھرے، آپ کا یہ کام نہیں کہ اس کا خیال بھی اپنے ذہن میں لائیں۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) {قُلْ اِنِّيْۤ اَخَافُ … :} رسول اللہ صلی اللہ علیہ وسلم کی زبان سے یہ اعلان کروا کر دوسرے سب لوگوں کو بتایا گیا ہے کہ اگر بفرض محال ہمارے معصوم اور سب سے زیادہ نیک بندے سے بھی نافرمانی کا ارتکاب ہو جائے تو وہ بھی ہمارے عذاب سے نہیں بچ سکتا، پھر دوسروں کے لیے کیسے ممکن ہے کہ انبیاء کو جھٹلانے جیسے جرائم کرنے کے باوجود ہمارے عذاب سے بے فکر ہو کر بیٹھ رہیں۔ مزید دیکھیے سورۂ انعام (۸۱ تا ۸۸ اور سورۂ زمر (۶۴، ۶۵)۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {مَنْ يُّصْرَفْ عَنْهُ …:} یعنی بلند مقام حاصل کرنا تو بہت بڑی بات ہے، اگر کسی سے آخررت کا عذاب ہی ٹل جائے تو اپنی جگہ یہی بہت واضح کامیابی ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {وَ اِنْ يَّمْسَسْكَ اللّٰهُ بِضُرٍّ … :} اس آیت سے شرک کی جڑ کٹ گئی۔ کیونکہ جس انسان کا یہ عقیدہ پختہ ہو جائے کہ دکھ اور تکلیف کو دور کرنے والا اور ہر قسم کی خیر کا مالک صرف اللہ تعالیٰ ہے تو پھر وہ دوسروں کے آگے سجدے کرنا اور ان کی قبروں پر نذرانے چڑھانا اور سمجھنا کہ وہ حاجتیں پوری کر سکتے ہیں، بہت بڑی حماقت سمجھے گا۔ قرآن نے اس بات پر خصوصی زور دیا ہے کہ ہر قسم کا نفع و ضرر اللہ کے ہاتھ میں ہے، اس پر عقیدہ پختہ ہو جائے تو انسان شرک میں مبتلا نہیں ہوتا۔ مزید دیکھیے سورۂ اعراف (۱۸۸)، یونس (۱۰۴ تا ۱۰۷)، فاطر (۲)، سورۂ زمر (۳۸) اور سورۂ جن (۲۱)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) {وَ هُوَ الْقَاهِرُ فَوْقَ عِبَادِهٖ …: } یہ بھی اس بات کی دلیل ہے کہ اس کے سوا کسی کو ولی نہیں بنانا چاہیے۔( رازی) مطلب یہ ہے کہ سب لوگ، خواہ بڑے سے بڑے جابر ہوں، اس کے سامنے بے بس ہیں، تمام گردنیں اس کے آگے جھکی ہوئی ہیں، وہ ہر ایک پر غالب ہے اور ساری کائنات اس کی مطیع ہے۔ اللہ تعالیٰ کی دو صفات کمال قدرت اور علم میں سے پہلے جملے «وَ هُوَ الْقَاهِرُ فَوْقَ عِبَادِهٖ» میں کمال قدرت کی طرف اشارہ ہے اور دوسرے جملے «وَ هُوَ الْحَكِيْمُ الْخَبِيْرُ» سے کمال علم ثابت ہوتا ہے، یعنی وہ اپنے احکام میں کمال حکمت والا اور اپنے بندوں کے معاملات کی پوری خبر رکھنے والا ہے۔ (رازی) اس لیے غلبہ و تسلط کے باوجود اپنی مخلوق کے معاملے میں حکمت اور آگاہی کے تقاضوں کو پوری طرح ملحوظ رکھتا ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19 )➊ {قُلْ اَيُّ شَيْءٍ اَكْبَرُ شَهَادَةً … :} کفار مکہ کے بعد جب یہود و نصاریٰ کی اکثریت نے بھی آپ کو جھٹلا دیا تو کفار کہنے لگے، بتاؤ اب تمھاری رسالت کی گواہی کون دیتا ہے؟ تو اللہ تعالیٰ نے آپ کو حکم دیا کہ آپ ان کافروں سے کہیے کہ اللہ کی ہستی سے بڑی ہستی کون سی ہے؟ جب کوئی نہیں تو بتاؤ سب سے بڑا شہادت دینے والا کون ہو گا ؟ آپ خود ہی ان کے سامنے واضح فرما دیجیے کہ وہ تو اللہ ہی ہے اور اللہ تعالیٰ کی گواہی یہ ہے کہ اس نے مجھ پر قرآن اتارا، جو قیامت تک کے لیے زندہ معجزہ ہے کہ کوئی بھی اس کی کسی ایک سورت جیسی کوئی سورت نہیں لا سکا اور نہ لا سکے گا۔ یہ قرآن معجزہ ہونے کے اعتبار سے میرے سچے نبی ہونے کی صریح دلیل ہے، اسی کے پیش نظر فرمایا : «وَ اُوْحِيَ اِلَيَّ هٰذَا الْقُرْاٰنُ » ’’اور میری طرف یہ قرآن وحی کیا گیا ہے۔‘‘ (رازی ) شاہ عبد القادر رحمہ اللہ لکھتے ہیں کہ یہاں گواہی فرمایا قسم کو، یعنی میں قسم کھاتا ہوں اللہ کی، اس سے زیادہ کیا قسم ہو گی۔ (موضح) اس آیت میں اللہ کے لیے {’’ شَيْءٍ ‘‘} ہونے کو ثابت کیا جا رہا ہے کہ وہ ایک موجود، زندۂ جاوید ہستی ہے، محض ایک خیالی و تصوراتی ہستی نہیں ہے۔ ¤ ➋ {لِاُنْذِرَكُمْ بِهٖ وَ مَنْ بَلَغَ:} یعنی میری طرف یہ قرآن اس لیے وحی کیا گیا ہے تاکہ میں تمھیں اس سے ڈراؤں اور اسے بھی جس تک یہ پہنچے۔ اس سے مراد قیامت تک آنے والے تمام عرب و عجم اور جن و انس ہیں اور مقصد یہ ہے کہ میری رسالت عالم گیر اور قیامت تک کے لیے ہے۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے اس کے مطابق روم، ایران، حبشہ اور کئی ممالک کو دین اسلام کی دعوت دی اور اپنی امت کے ہر فرد کو حکم دیا : [ بَلِّغُوْا عَنِّيْ وَلَوْ آيَةً] ’’میری طرف سے پہنچا دو خواہ ایک آیت ( مسئلہ) ہو۔‘‘ [ بخاری، أحادیث الأنبیاء، باب ما ذکر عن بنی إسرائیل : ۳۴۶۱، عن عبد اللہ بن عمرو رضی اللہ عنہما ] اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’میری بات سننے والوں میں سے ہر شخص اسے پہنچا دے جو یہاں موجود نہیں۔‘‘ [ بخاری، الحج، باب الخطبۃ أیام منًی : ۱۷۴۱ ] ¤ اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ ہر اس بندے ( کے چہرے) کو تروتازہ رکھے جو میری بات یاد رکھے اور آگے پہنچا دے۔‘‘ [ ترمذی، العلم، باب ما جاء فی الحث علی تبلیغ السماع : ۲۶۵۶ تا ۲۶۵۸ ] ان احادیث اور آیات سے معلوم ہوا کہ قرآن و حدیث کے احکام تمام لوگوں کے لیے اور قیامت تک کے لیے ہیں، ان میں تبدیلی نہیں ہو سکتی۔ ہر زمانے کے لوگوں پر لازم ہے کہ وہ اسے اگلے زمانے کے لوگوں تک پہنچائیں۔ قرآن کے احکام کو صرف نبی صلی اللہ علیہ وسلم کے زمانے تک محدود رکھنا اور حالات کی تبدیلی کے بہانے قرآن و حدیث کے احکام میں تبدیلی کرنا قرآن کے احکام سے جان چھڑانے کی کوشش ہے اور صریح تحریف ہے، جس کی وجہ سے یہودی ملعون ٹھہرے۔ ¤ ➌ {اَىِٕنَّكُمْ لَتَشْهَدُوْنَ …:} یعنی قرآن میں مذکور توحید کے واضح اور قطعی دلائل کے باوجود کیا تم گواہی دیتے ہو کہ اللہ تعالیٰ کے ساتھ کوئی اور معبود بھی ہیں۔ آپ کہہ دیجیے تم جو چاہو کہو، میں یہ شہادت کبھی نہیں دے سکتا۔ کہہ دیجیے کہ معبود تو صرف ایک اللہ ہے، میں کسی اور کو معبود نہیں مانتا اور صاف کہتا ہوں کہ میں ان تمام ہستیوں سے جنھیں تم شریک ٹھہراتے ہو، بری ہوں ’’مَا‘‘ مصدریہ ہو تو معنی ہو گا، میں تمھارے شرک سے جو تم کرتے ہو، بری ہوں۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ {اَلَّذِيْنَ اٰتَيْنٰهُمُ الْكِتٰبَ يَعْرِفُوْنَهٗ …:} یعنی یہود و نصاریٰ کو رسول اللہ صلی اللہ علیہ وسلم کے سچے رسول ہونے میں کوئی شک نہیں، کیونکہ ان کی اپنی کتابوں میں رسول اللہ صلی اللہ علیہ وسلم کا ذکر خیر موجود ہے۔ دیکھیے سورۂ بقرہ (۱۴۶)، سورۂ اعراف (۱۵۷) اور سورۂ صف (۶)۔ ¤ ➋ کفار مکہ نے اہل کتاب ( یہو د و نصاریٰ) سے رسول اللہ صلی اللہ علیہ وسلم کے متعلق پوچھا تو انھوں نے آپ کی نبوت سے انکار کیا اور کہا کہ تورات و انجیل میں آپ کا کوئی ذکر نہیں۔ اس پر کفار نے آپ صلی اللہ علیہ وسلم سے پوچھا کہ اہل کتاب تو آپ کی نبوت کا انکار کر رہے ہیں، پھر آپ کی نبوت کی شہادت کون دیتا ہے؟ اس کا جواب اس سے پہلی آیت میں دیا گیا ہے، اس آیت میں بتایا گیا ہے کہ اہل کتاب جھوٹ بولتے ہیں کہ آپ صلی اللہ علیہ وسلم کا ذکر تورات و انجیل میں نہیں۔ حقیقت یہ ہے کہ یہ لوگ آپ صلی اللہ علیہ وسلم کی نبوت کے سچا ہونے کو پورے یقین سے جانتے ہیں مگر ضد اور ہٹ دھرمی کی بنا پر انکاار کر کے اپنے آپ کو خسارے میں ڈال رہے ہیں، ایسے لوگوں سے ایمان کی امید نہیں، ہاں جن لوگوں کے دلوں میں اخلاص ہے وہ ضرور ایمان لے آئیں گے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {وَ مَنْ اَظْلَمُ مِمَّنِ افْتَرٰى …:} یعنی اگر میں نے جھوٹ بولا تو مجھ سے بڑا ظالم کوئی نہیں اور اگر میں نے سچ پہنچایا اور تم نے جھٹلایا تو تم سے زیادہ گناہ گار کوئی نہیں، پس اپنی فکر کرو۔ (موضح) اب اس آیت میں ان کے خسارے کا سبب بیان فرمایا۔ (رازی) خسارے کا پہلا سبب افتراء علی اللہ، یعنی اللہ تعالیٰ پر جھوٹ باندھنا قرار دیا ہے اور اہل علم جانتے ہیں کہ کفار مکہ کے دین کی بنیاد ہی جھوٹ گھڑنے پر تھی۔ بتوں کو اللہ کا شریک قرار دینا، فرشتوں کو اللہ کی بیٹیاں کہنا اور بحیرہ و سائبہ وغیرہ کو حرام قرار دینا، یہ سب چیزیں جھوٹ گھڑنے پر مبنی تھیں۔ اسی طرح یہود و نصاریٰ کے دین میں بہت سے افترا شامل ہوگئے تھے، مثلاً وہ تورات و انجیل کو ناقابل نسخ قرار دیتے، اپنے آپ کو اللہ کے بیٹے اور اس کے حبیب کہتے، اسی طرح اللہ تعالیٰ کے متعلق بہت سی جہالت کی باتیں کرتے تھے۔ خسارے کا دوسرا سبب اللہ تعالیٰ کی آیات کو جھٹلانا ہے، جس میں معجزات و احکام کو جھٹلانا بھی شامل ہے۔ ¤ اللہ تعالیٰ پر جھوٹ باندھنے والوں میں نبوت کے جھوٹے دعوے دار وہ تیس کذاب بھی شامل ہیں جن کی نبی صلی اللہ علیہ وسلم نے پیش گوئی فرمائی تھی۔ [ مسلم، الفتن، باب لا تقوم الساعۃ … : ۸۴؍۲۹۲۳ ] جن میں مرزا قادیانی اور اسے نبی کہنے والے بھی شامل ہیں، اس کے علاوہ رسول اللہ صلی اللہ علیہ وسلم کے ذمے کوئی جھوٹی حدیث لگانے والے بھی، کیونکہ آپ کے ذمے کوئی بات لگانے والا درحقیقت وہ بات اللہ کے ذمے لگا رہا ہوتا ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 23،22) {وَ يَوْمَ نَحْشُرُهُمْ جَمِيْعًا … :} اس آیت سے ثابت ہوتا ہے کہ قیامت کے دن جب انن سے ان کے بنائے ہوئے شریکوں سے متعلق باز پرس ہو گی تو ان کے پاس کوئی بہانہ یا فریب اس کے سوا نہ ہو گا کہ وہ قسم کھا کر اپنے شرک کرنے ہی سے انکار کر دیں گے۔ دیکھیے سورۂ مجادلہ (۱۸)۔ ¤ دوسری آیت میں ہے کہ وہ اللہ تعالیٰ سے کوئی بات نہیں چھپائیں گے۔ دیکھیے سورۂ نساء (۴۲) دونوں باتوں میں تطبیق یہ ہے کہ پہلے وہ اہل توحید کو جنت میں داخل ہوتا دیکھیں گے تو اپنے شرک کا انکار کریں گے، پھر جب ان کے مونہوں پر مہر لگے گی اور ان کے ہاتھ، پاؤں اور جسم کا ہر حصہ بول کر گواہی دے گا تو پھر ان کی کوئی بات چھپ نہیں سکے گی۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23،22) {وَ يَوْمَ نَحْشُرُهُمْ جَمِيْعًا … :} اس آیت سے ثابت ہوتا ہے کہ قیامت کے دن جب انن سے ان کے بنائے ہوئے شریکوں سے متعلق باز پرس ہو گی تو ان کے پاس کوئی بہانہ یا فریب اس کے سوا نہ ہو گا کہ وہ قسم کھا کر اپنے شرک کرنے ہی سے انکار کر دیں گے۔ دیکھیے سورۂ مجادلہ (۱۸)۔ ¤ دوسری آیت میں ہے کہ وہ اللہ تعالیٰ سے کوئی بات نہیں چھپائیں گے۔ دیکھیے سورۂ نساء (۴۲) دونوں باتوں میں تطبیق یہ ہے کہ پہلے وہ اہل توحید کو جنت میں داخل ہوتا دیکھیں گے تو اپنے شرک کا انکار کریں گے، پھر جب ان کے مونہوں پر مہر لگے گی اور ان کے ہاتھ، پاؤں اور جسم کا ہر حصہ بول کر گواہی دے گا تو پھر ان کی کوئی بات چھپ نہیں سکے گی۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) {اُنْظُرْ كَيْفَ كَذَبُوْا …:} یعنی وہاں ان کا شرک ان کے کچھ کام نہ آئے گا اور نہ ان کے بنائے ہوئے حاجت روا اور مشکل کشا کہیں نظر آئیں گے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {وَ مِنْهُمْ مَّنْ يَّسْتَمِعُ اِلَيْكَ … :} یعنی کان لگا لگا کر سنتے ہیں، جب قیامت کے دن گزشتہ کافروں پر گزرنے والے کچھ احوال بیان فرمائے تو موجودہ کافروں کا بھی کچھ حال بیان فرمایا۔ ( رازی) فرمایا کہ مشرکین آپ کے پاس آکر بڑے غور سے قرآن سنتے ہیں، لیکن ضد اور عناد کی وجہ سے ہدایت حاصل کرنا ان کا مقصد ہی نہیں ہوتا، اس لیے انھیں سننے سے کوئی فائدہ نہیں ہوتا، کیونکہ ان کے حق کو پہچان کر نہ ماننے اور ان کی بدنیتی کی وجہ سے ہم نے انھیں یہ سزا دی ہے کہ ان کے دلوں پر پردے ڈال دیے ہیں اور ان کے کانوں میں ڈاٹ لگا دیے ہیں، جن کی وجہ سے وہ کان لگا کر سننے کے باوجود نہ سمجھتے ہیں، نہ سنتے ہیں۔ مزید دیکھیے سورۂ اعراف (۱۷۹) اب قرآن جیسا عظیم معجزہ دیکھ کر وہ ایمان نہیں لائے تو یہ امید مت رکھیں کہ وہ کوئی بھی معجزہ دیکھ کر ایمان لے آئیں گے۔ رسول اللہ صلی اللہ علیہ وسلم اور قرآن کو برحق جاننے کے باوجود ان کی ضد اور عناد یہاں تک پہنچ گیا ہے کہ آپ کے پاس آکر جب وہ آپ سے جھگڑتے ہیں اور ان انکار کرنے والوں کو آپ صلی اللہ علیہ وسلم کے واضح دلائل کا کوئی جواب نہیں سوجھتا تو کہہ دیتے ہیں کہ یہ پہلے لوگوں کی فرضی کہانیاں ہیں، حالانکہ قرآن مجید میں اخلاق، حکمت اور شریعت کی باتیں ہیں اور اس میں جو قصے بیان کیے گئے ہیں وہ سب سچے واقعات ہیں اور صرف عبرت و نصیحت کے لیے بیان کیے گئے ہیں۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26 )➊ {وَ هُمْ يَنْهَوْنَ عَنْهُ وَ يَنْـَٔوْنَ عَنْهُ:} یعنی صرف قرآن پر طعن کرنے ہی پر اکتفا نہیں کرتے بلکہ قرآن سننے سے اور لوگوں کو آپ صلی اللہ علیہ وسلم کے پاس جانے سے بھی روکتے ہیں اور خود بھی دور رہتے ہیں۔ آج کل مسلمانوں میں سے بہت سے شرک و بدعت میں مبتلا مولوی بھی اہل توحید کی تقریریں سننے سے لوگوں کو منع کرتے ہیں اور خود بھی نہیں سنتے، بلکہ قرآن مجید کا ترجمہ پڑھنے سے لوگوں کو روکتے ہیں کہ کہیں حق واضح ہو جانے کے بعد اسے قبول کر کے ہمارے چنگل سے نہ نکل جائیں۔ ¤ ➋ {وَ اِنْ يُّهْلِكُوْنَ اِلَّاۤ اَنْفُسَهُمْ:} یعنی ایسا کرنے سے وہ اللہ تعالیٰ اور اس کے دین کا کچھ نہیں بگاڑ سکیں گے، بلکہ اپنی ہی ہلاکت کا سامان کر رہے ہیں اور یہ سمجھتے ہی نہیں کہ ایسا کرنے سے ہم اپنا ہی نقصان کر رہے ہیں۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) {وَ لَوْ تَرٰۤى اِذْ وُقِفُوْا عَلَى النَّارِ …:} جب قیامت کا عذاب دیکھ لیں گے تو اس کی ہلاکت اور تباہی سے بچنے کے لیے اس خواہش کا اظہار کریں گے کہ اے کاش! ہمیں دنیا میں دوبارہ جانے کا موقع ملے تو ہم اس تکذیب سے جس کی بنا پر ہم عذاب سے دو چار ہو رہے ہیں، باز آ جائیں اور توحید و نبوت پر یقین کر لیں، لیکن یہ ان کی محض ایک خواہش ہو گی جس کا حقیقت سے کوئی تعلق نہیں ہو گا۔ اس لیے اگلی آیت میں بتا دیا کہ وہ اس خواہش میں جھوٹ بول رہے ہیں۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ {بَلْ بَدَا لَهُمْ مَّا كَانُوْا … :} اس سے پہلے ( اللہ تعالیٰ کے سامنے) جس کفر و شرک اور نفاق کو وہ جھوٹی قسمیں کھا کر چھپانے کی کوشش کر رہے تھے اس کی حقیقت کھل جائے گی۔ بعض نے {’’ مِنْ قَبْلُ ‘‘} سے دنیا میں چھپانا مراد لیا ہے اور لکھا ہے کہ یہ آیت منافقین کے بارے میں ہے، یا پھر اس سے کفار کے سردار مراد ہیں، یعنی وہ قرآن اور رسول اللہ صلی اللہ علیہ وسلم کا سچا ہونا جانتے تھے، مگر اپنے پیروکاروں سے چھپاتے تھے۔ قیامت کے دن یہ حقیقت ان کے پیروکاروں پر کھل جائے گی اور انھیں معلوم ہو جائے گا کہ یہ ہمیں دھوکا دیتے رہے ہیں۔ ¤ ➋ {وَ لَوْ رُدُّوْا لَعَادُوْا لِمَا نُهُوْا عَنْهُ:} یعنی پھر کفر و شرک اور نفاق کی راہ اختیار کریں گے، کیونکہ ان کی یہ آرزو ایمان لے آنے کی وجہ سے نہیں بلکہ کسی طرح جہنم سے بچنے کے لیے ہے۔ ¤ ➌ {وَ اِنَّهُمْ لَكٰذِبُوْنَ:} اس لیے آخرت میں اس آرزو کے اظہار میں بھی جھوٹ ہی سے کام لیں گے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) {وَ قَالُوْۤا اِنْ هِيَ اِلَّا حَيَاتُنَا الدُّنْيَا … :} یعنی زندگی بس وہی ہے جو دنیا میں ہم گزار رہے ہیں، کوئی آخرت نہیں، نہ کچھ ثواب و عذاب ہے، یہ محض لوگوں کو الّو بنانے کے لیے ڈھکوسلا ہے۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ {وَ لَوْ تَرٰۤى اِذْ وُقِفُوْا …:} پچھلی آیت میں کفار کا وہ قول بیان کیا ہے جو وہ دنیا میں کہا کرتے تھے اور اب آخرت میں ان کی حالت کا ذکر ہے۔ ¤ ➋ {قَالَ اَلَيْسَ هٰذَا بِالْحَقِّ … :} کاش! آپ وہ منظر دیکھیں جب انھیں ان کے رب کے سامنے کھڑا کر کے ان سے پوچھا جائے گا کہ کیا یہ (آخرت اور جزا و سزا) حق نہیں ہے۔ اب وہ اپنا قول بالکل ہی بدل لیں گے اور قسم کھا کر قیامت کے دن کے حق ہونے کا اقرار کریں گے، مگر اس وقت کا اقرار انھیں کچھ فائدہ نہیں دے گا، بلکہ اللہ تعالیٰ فرمائے گا کہ پھر اپنے کفر کی وجہ سے عذاب کا مزہ چکھو۔ قرآن مجید میں قیامت کے دن ان کی اس خواہش کا اور اسے ٹھکرا دیے جانے کا کئی جگہ ذکر ہے۔ دیکھیے سورۂ مومنون(۱۰۷، ۱۰۸) اور سورۂ سجدہ (۱۲)۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) {عَلٰى مَا فَرَّطْنَا فِيْهَا:} یہاں {’’ فِيْهَا ‘‘} کی ضمیر یا تو {’’ الْحَيٰوةُ الدُّنْيَاۤ ‘‘} کی طرف جا رہی ہے، یا {’’ السَّاعَةُ ‘‘} کی طرف، یعنی ہائے ہمارا افسوس ! اس کوتاہی پر جو ہم نے دنیا میں کی، یا اس کوتاہی پر جو ہم نے قیامت کے بارے میں کی۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32 )➊ {وَ مَا الْحَيٰوةُ الدُّنْيَاۤ … :} دنیوی زندگی کے بہت جلد ختم ہونے کے اعتبار سے اس کو لہو و لعب فرمایا ہے۔ (رازی) یعنی آخرت کی حقیقی اور ہمیشہ رہنے والی زندگی کے مقابلے میں دنیا کی زندگی اور اس کی لذتیں ایسی ہی ہیں جیسے بچوں کا کھیل تماشا جو تھوڑی دیر میں ختم ہو جاتا ہے۔ دیکھیے سورۂ حدید (۲۰) انس رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ کے راستے میں ایک شام نکلنا یا ایک صبح نکلنا دنیا وما فیہا سے بہتر ہے اور جنت میں تمھارے کسی شخص کی ایک کمان کی مقدار کے برابر یا اس کے کوڑے کے برابر جگہ دنیا وما فیہا سے بہتر ہے، اور اگر اہل جنت میں سے کوئی عورت زمین والوں کی طرف جھانک لے تو آسمان و زمین کے درمیان کی جگہ کو روشن کر دے اور اسے خوشبو سے بھر دے اور اس کے سر کا دوپٹا دنیا ومافیہا سے بہتر ہے۔‘‘ [ بخاری، الجہاد والسیر، باب الحورالعین و صفتھن : ۲۷۹۶ ] ¤ ➋ {وَ لَلدَّارُ الْاٰخِرَةُ خَيْرٌ … :} یعنی آخرت کا گھر دنیا سے کہیں بہتر ہے، مگر ان کے لیے جو کفر و شرک، نفاق اور کبائر سے بچتے ہیں، ورنہ کافر کے لیے تو دنیا کی زندگی ہی بہتر ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلدُّنْيَا سِجْنُ الْمُؤْمِنِ وَ جَنَّةُ الْكَافِرِ ] [ مسلم، الزھد، باب الدنیا سجن…:۲۹۵۶ ]’’دنیا مومن کے لیے قید خانہ ہے اور کافر کے لیے جنت۔‘‘"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) {قَدْ نَعْلَمُ اِنَّهٗ لَيَحْزُنُكَ … :} نبی کریم صلی اللہ علیہ وسلم نے جب تک نبوت کا دعویٰ نہیں کیا تھا آپ کی قوم کے تمام لوگ آپ کو صادق اور امین کہتے تھے، لیکن جونہی آپ نے اپنی نبوت کا اعلان کیا اور انھیں اللہ کی آیات سنانا شروع کیں تو ان میں سے اکثر آپ کی مخالفت پر کمر بستہ ہو گئے اور آپ کو ( نعوذ باللہ) جھوٹا قرار دینے لگے۔ ابو سفیان جو بدر، احد اور خندق کی جنگ کا باعث تھا، اس سے رومی بادشاہ ہرقل نے پوچھا کہ محمد ( صلی اللہ علیہ وسلم ) نے کبھی جھوٹ بولا ہے، تو اس نے کافر ہونے کے باوجود جواب دیا کہ محمد( صلی اللہ علیہ وسلم ) نے کبھی جھوٹ نہیں بولا۔ اس لحاظ سے اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ یہ لوگ جو آپ کو جھٹلا رہے ہیں، وہ حقیقت میں آپ کو نہیں بلکہ ہماری آیات کو جھٹلا رہے ہیں، کیونکہ شخصی لحاظ سے تو آپ کو جھٹلا ہی نہیں سکتے، آپ کے نبوت سے پہلے کے چالیس سال اس کا ثبوت ہیں۔ ان سے مراد دراصل وہ کفار ہیں جو بشر کے نبی اور رسول ہونے کو محال سمجھتے تھے۔ (ابن کثیر، رازی)"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ {وَ لَقَدْ كُذِّبَتْ رُسُلٌ … :} اس آیت میں ایک دوسرے طریقے سے آپ صلی اللہ علیہ وسلمم کو تسلی دی ہے کہ صرف آپ ہی کو نہیں، بلکہ آپ سے پہلے کئی انبیاء و رسل کو بھی جھٹلایا گیا، اس لیے آپ بھی اسی طرح صبر و استقامت سے کام لیں جس طرح انھوں نے لیا۔ ¤ ➋ {وَ لَا مُبَدِّلَ لِكَلِمٰتِ اللّٰهِ:} {’’ لِكَلِمٰتِ اللّٰهِ ‘‘} سے مراد یہ ہے کہ اللہ تعالیٰ نے جو آپ کی نصرت اور آپ کو غالب اور کفار کو مغلوب کرنے کا وعدہ کیا ہے، جیسے : «اِنَّا لَنَنْصُرُ رُسُلَنَا وَ الَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَ يَوْمَ يَقُوْمُ الْاَشْهَادُ» [المؤمن : ۵۱ ] ’’بے شک ہم اپنے رسولوں کی اور ان لوگوں کی جو ایمان لائے ضرور مدد کرتے ہیں دنیا کی زندگی میں اور اس دن بھی جب گواہ کھڑے ہوں گے۔‘‘ اور فرمایا : «كَتَبَ اللّٰهُ لَاَغْلِبَنَّ اَنَا وَ رُسُلِيْ» [ المجادلۃ : ۲۱ ] ’’اللہ نے لکھ دیا کہ ضرور بالضرور میں غالب رہوں گا اور میرے رسول۔‘‘ اور فرمایا : «هُوَ الَّذِيْۤ اَرْسَلَ رَسُوْلَهٗ بِالْهُدٰى وَ دِيْنِ الْحَقِّ لِيُظْهِرَهٗ عَلَى الدِّيْنِ كُلِّهٖ» [ الفتح : ۲۸ ] ’’وہی ہے جس نے اپنا رسول بھیجا ہدایت اور دین حق کے ساتھ، تاکہ اسے ہر دین پر غالب کر دے۔‘‘ تو یہ وعدہ ہر حال میں پورا ہو گا، لہٰذا آپ اطمینان رکھیں کہ اللہ کی باتوں کو کوئی نہیں بدل سکتا، جس طرح انھوں نے صبر و استقامت کا مظاہرہ کیا اسی طرح آپ بھی صبر و استقامت سے اپنی دعوت پیش کرتے رہیں اور کسی بے چینی کو اپنے اندر راہ نہ پانے دیں۔ یقینا آپ کی بھی اسی طرح نصرت و تائید کی جائے گی۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ {وَ اِنْ كَانَ كَبُرَ عَلَيْكَ اِعْرَاضُهُمْ …:} نبی کریم صلی اللہ علیہ وسلم کو کفار کے جھٹلانے سے جو تکلیف اور دل شکنی ہوتی تھی اس کے متعلق اللہ تعالیٰ فرما رہا ہے کہ ان لوگوں کی بے رخی اگر بہت زیادہ ہی آپ پر شاق گزر رہی ہے تو زمین میں سرنگ نکال کر یا آسمان پر سیڑھی کے ذریعے سے چڑھ کر آپ کوئی معجزہ لا کر ان لوگوں کو اسلام قبول کرنے پر آمادہ کر سکتے ہیں، تو آپ ایسا بھی کر کے دیکھ لیجیے، لیکن یہ چونکہ آپ سے ہو نہیں سکتا تو رنجیدہ ہونے سے کیا فائدہ، بہتر ہے کہ انجام کار ہم پر چھوڑتے ہوئے پورے اطمینان اور پورے سکون کے ساتھ اپنی دعوت کے کام میں لگے رہیں۔ کفار کس طرح کے معجزات کا تقاضا کرتے تھے، اس کے لیے دیکھیے سورۂ بنی اسرائیل (۹۰ تا ۹۷)۔ ¤ ➋ {وَ لَوْ شَآءَ اللّٰهُ لَجَمَعَهُمْ … :} یعنی ایسا خیال مت کیجیے کہ کوئی نشانی ( معجزہ) لانے سے یہ راہِ ہدایت پر ضرور ہی آ جائیں گے، کیونکہ ہدایت سراسر اللہ تعالیٰ کی مشیت پر موقوف ہے، آپ کے ذمے صرف پیغام پہنچا دینا ہے۔ اس حقیقت کو پیش نظر رکھیں اور ان لوگوں کے ایمان نہ لانے پر ہر گز کوئی غم یا افسوس نہ کریں۔ اگر اللہ تعالیٰ کی حکمت ہوتی کہ سب لوگ ایمان لے آئیں تو اسے یہ کام کچھ مشکل نہ تھا، اس نے صرف {’’ كُنْ‘‘} کہنا تھا کہ سب لوگ ایمان لے آتے اور ہدایت پر جمع ہو جاتے۔ دیکھیے یونس (۹۹) مگر ایسا کرنا اس کی مشیت اور حکمت کے خلاف ہے، جو بظاہر یہ ہے کہ اس سے اختیار دے کر آزمانے کا سلسلہ ختم ہو جاتا۔ بہر حال اپنے کاموں کی حقیقی حکمت و مصلحت وہی جانتا ہے، لہٰذا اس قسم کے نظریے کو اپنے دل میں جگہ نہ دیجیے، بلکہ اللہ تعالیٰ کی مشیت و تقدیر اور اس کی مصلحتوں پر ایمان رکھ کر تسلی حاصل کریں۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {اِنَّمَا يَسْتَجِيْبُ الَّذِيْنَ …:} اس آیت میں اللہ تعالیٰ نے ان کافروں کو مردوں کے مشابہ قرار دیا ہے جن کو جتنا بھی پکارا جائے وہ کوئی جواب نہیں دے سکتے، یعنی ان کفار کے ضمیر مردہ ہو چکے ہیں اور ان مردوں کو اگر عقل آئے گی تو اسی وقت جب اللہ تعالیٰ ان کو دنیا سے اٹھائے گا اور ان کا محاسبہ کرے گا۔ سورۂ نمل کی آیات(۸۰، ۸۱) اس کی ہم معنی ہیں۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37 )➊ {وَ قَالُوْا لَوْ لَا نُزِّلَ عَلَيْهِ … :} منکرین نبوت یہ شبہ بھی پیش کرتے تھے کہ اگر یہ اللہ کے رسول ہیں تو اپنے ساتھ نظر آنے والا ایسا معجزہ کیوں نہیں لاتے جسے دیکھ کر ہر شخص کو معلوم ہو جائے کہ یہ واقعی اللہ تعالیٰ کی طرف سے آنے والا رسول ہے۔ ¤ ➋ اللہ تعالیٰ نے اس کا جواب دیا کہ اللہ ایسا کرنے پر قادر ہے، مگرا س کی حکمت اور مصلحت یہ ہے کہ اگر صاف کھلی نشانی آجائے، جیسے اونٹنی جو صالح علیہ السلام کے عہد میں بھیجی گئی تو اللہ تعالیٰ کے قانون کے مطابق ان کی مدت مہلت ختم ہو جائے گی اور فوراً عذاب آجائے گا، لیکن اللہ تعالیٰ کی رحمت کا تقاضا ہے کہ ان کو ہلاک نہ کیا جائے، مگر ان کے اکثر اس بات کو نہیں جانتے۔ (رازی) دیکھیے سورۂ بنی اسرائیل (۵۹)۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ {وَ مَا مِنْ دَآبَّةٍ فِي الْاَرْضِ …:} یعنی زمین پر چلنے والا کوئی جانور ( دیکھیے سورۂ نور : ۴۵) اور کوئی دو پروں سے اڑنے والا پرندہ نہیں، مگر سب تمھاری طرح امتیں ہیں۔ یہاں ایک سوال ہے کہ طائر کا معنی ہی پرندہ ( اڑنے والا) ہے، پھر ان الفاظ کی کیا ضرورت تھی کہ جو اپنے دو پروں سے اڑتا ہے؟ تو جواب اس کا یہ ہے کہ بعض اوقات تیز دوڑنے والے کو بھی پرندہ کہہ دیا جاتا ہے، جیسے کہہ دیا جائے کہ گھوڑا اڑتا جا رہا تھا۔ ’’دو پروں‘‘ کے لفظ نے یہ احتمال ختم کر دیا اور بتا دیا کہ یہاں مراد حقیقی پرندہ ہے، جو پروں سے اڑتا ہے، صرف تیز رفتار مراد نہیں۔ ¤ ➋ {اِلَّاۤ اُمَمٌ اَمْثَالُكُمْ:} یعنی زمین پر چلنے والے اور اڑنے والے تمام جانور تمھاری طرح کی امتیں ہیں، تمھاری طرح پیدا ہوتی ہیں، جوانی کو پہنچتی ہیں، پھر مر جاتی ہیں، تمھاری طرح ان کا پیدا کرنا، ان کی روزی کا سامان اور ہر ضرورت پوری کرنا اور ان کی مصلحتوں کا اہتمام کرنا سب اللہ تعالیٰ کے ذمے ہے۔ (دیکھیے سورۂ ہود : ۶) جس طرح اللہ تعالیٰ ان کی مصلحتوں کی رعایت کرتا ہے اسی طرح تمھاری تمام مصلحتوں کا بھی خیال رکھتا ہے، ان لوگوں کے مطالبے کے مطابق نشانیاں اور معجزے نازل کرنا خود ان کی مصلحت کے خلاف ہے۔ ¤ ➌ {مَا فَرَّطْنَا فِي الْكِتٰبِ مِنْ شَيْءٍ:} {’’ الْكِتٰبِ ‘‘} سے مراد لوح محفوظ ہے، جو مخلوقات کے تمام احوال پر حاوی ہے، کوئی چیز ایسی نہیں جس کے بیان کی اس میں کمی رہ گئی ہو۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’قلم خشک ہو چکا ہے اس پر جو تم کرنے والے ہو۔‘‘ [بخاری، القدر، باب جف القلم علی علم اللہ… قبل ح : ۶۵۹۶ ] {’’ الْكِتٰبِ ‘‘} سے مراد یہاں قرآن کریم بھی ہو سکتا ہے۔ رازی نے فرمایا ( یہی معنی زیادہ ظاہر ہے) اس لحاظ سے کہ اللہ تعالیٰ نے اس میں دین کے متعلق تمام اصول (بنیادی امور) بیان کر دیے اور جن جزئیات کا ذکر نہیں وہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے قول و عمل سے بیان فرما دی ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا : «وَ نَزَّلْنَا عَلَيْكَ الْكِتٰبَ تِبْيَانًا لِّكُلِّ شَيْءٍ » [ النحل : ۸۹ ] ’’ہم نے تجھ پر یہ کتاب نازل کی، اس حال میں کہ وہ ہر چیز کا واضح بیان ہے۔‘‘ اور مسلمانوں کو حکم دیا کہ پیغمبر جس چیز کا حکم دیں اسے بجا لاؤ اور جس چیز سے منع کر دیں اس سے رک جاؤ، فرمایا : «وَ مَاۤ اٰتٰىكُمُ الرَّسُوْلُ فَخُذُوْهُ وَ مَا نَهٰىكُمْ عَنْهُ فَانْتَهُوْا » [ الحشر : ۷ ] خلاصہ یہ کہ حدیث نبوی بھی کتاب الٰہی ہے اور دین کی کوئی ایسی بات نہیں جو {’’ الْكِتٰبِ ‘‘ } ( قرآن و حدیث) میں بیان نہ کر دی گئی ہو۔ ¤ ➍ {ثُمَّ اِلٰى رَبِّهِمْ يُحْشَرُوْنَ:} کفار کو متنبہ کیا ہے کہ جب اللہ تعالیٰ زمین کے کسی جانور یا پرندے کے حالات سے نا واقف نہیں ہے اور اس کا نامۂ اعمال محفوظ ہے اور اس کا بدلہ بھی اسے ملے گا تو تم اپنے بارے میں یہ کیوں سمجھ رہے ہو کہ تمھیں تمھارے اعمال کا بدلہ نہیں دیا جائے گا۔ (رازی) ¤ ➎ اس آیت : «ثُمَّ اِلٰى رَبِّهِمْ يُحْشَرُوْنَ» اور ایک دوسری آیت : «وَ اِذَا الْوُحُوْشُ حُشِرَتْ» [ التکویر : ۵ ]( اور جب جنگلی جانور اکٹھے کیے جائیں گے) سے معلوم ہوتا ہے کہ جانوروں کا بھی قیامت کے دن حشر ہو گا۔ ان سے کفر و شرک اور ایمان و اعمال کا محاسبہ تو نہیں ہو گا، مگر جو ظلم کسی جانور نے دوسرے پر کیا ہو گا اس کا بدلہ ضرور دلوایا جائے گا، جیسا کہ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ضرور بالضرور حق داروں کے حقوق ادا کروائے جائیں گے، حتیٰ کہ بے سینگ بکری کا بدلہ سینگ والی بکری سے لیا جائے گا۔‘‘ [ مسلم، البر والصلۃ، باب تحریم الظلم : ۲۵۸۲ ] بعض علماء کا خیال ہے کہ یہ بات بطور تمثیل بیان کی گئی ہے، کیونکہ جانور تو مکلف ہی نہیں ہیں، مگر حدیث میں ’’بدلے‘‘ کے صریح الفاظ اس خیال کی نفی کرتے ہیں۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ {وَ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا …:} یعنی ہماری آیات کو جھٹلانے والے چونکہ حق بات نہ سنتے ہیں، نہ ان کی زبانوں سے حق بات نکلتی ہے، اس لیے وہ بہرے اور گونگے ہیں اور کفر و شرک اور نفس کی بے جا خواہشوں کے اندھیروں میں پھنسے ہوئے ہیں۔ یہی بات سورۂ بقرہ (۱۷، ۱۸) اور سورۂ نور (۴۶) میں بیان ہوئی ہے۔ ¤ ➋ {مَنْ يَّشَاِ اللّٰهُ يُضْلِلْهُ … :} مگر وہ گمراہ انھی کو کرتا ہے جو اپنی صلاحیتوں کو صحیح استعمال نہیں کرتے۔ دیکھیے سورۂ بقرہ (۲۶، ۲۷) اور سورۂ اعراف (۱۷۶) اور ہدایت انھی کو دیتا ہے جو اپنی صلاحیتوں کا صحیح استعمال کرتے ہوئے، اس کی طرف رجوع کرتے ہیں۔ دیکھیے سورۂ شوریٰ (۱۱)۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 41،40) {قُلْ اَرَءَيْتَكُمْ اِنْ اَتٰىكُمْ عَذَابُ اللّٰهِ …:} اس مضمون کو بھی اللہ تعالیٰ نے کئی جگہ بیان کیا ہے۔ دیکھیے سورۂ بنی اسرائیل (۶۷)، سورۂ زمر (۳۸)، سورۂ مومنون (۸۴ تا ۸۹)، سورۂ لقمان (۳۲) اور سورۂ یونس (۲۲) ان آیات میں اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم کے زمانے کے مشرکین کا طرزِ عمل بیان فرمایا، مطلب یہ ہے کہ توحید انسان کی فطرت میں رکھ دی گئی ہے، وہ ماحول کے اثر سے یا آباء و اجداد کی تقلید سے شرک میں گرفتار ہوتا ہے اور غیر اللہ کو اپنا حاجت روا اور مشکل کشا سمجھتا رہتا ہے، نذر و نیاز بھی ان کے نام کی نکالتا ہے، لیکن جب آزمائش سے دو چار ہوتا ہے تو پھر سب کو بھول جاتا ہے اور فطرت ان سب پر غالب آ جاتی ہے، پھر بے بس انسان سب کچھ بھول جاتا ہے اور صرف اسی ایک ذات کو پکارتا ہے جسے پکارنا چاہیے۔ یہاں بھی اللہ تعالیٰ نے ان کے اسی طرزِ عمل کو بطور ثبوت توحید کی دلیل کے طور پر بیان کیا، یعنی اگر اپنے اس دعویٰ میں کہ جنھیں تم اللہ کے سوا پکارتے ہو، وہ تم پر آئی ہوئی بلا ٹال سکتے ہیں تو یہ بتاؤ کہ اللہ کا عذاب آنے کی صورت میں، یا قیامت آنے پر بھی کیا تم غیر اللہ کو پکارو گے؟ نہیں بلکہ تم صرف اسی کو پکارو گے، باقی مشکل کشا تمھیں بھول جائیں گے۔ یہ تو ان کفار و مشرکین کا حال تھا لیکن آج خود مسلمانوں کے اندر ایسے لوگ پائے جاتے ہیں جن کی فطرت اس قدر مسخ ہو چکی ہے کہ وہ سخت سے سخت مصیبت میں بھی فریاد کرتے ہیں تو اپنے کسی خود ساختہ داتا سے یا علی ( رضی اللہ عنہ ) سے، یا شیخ عبد القادر جیلانی سے، انھیں غوث اعظم، یعنی سب سے بڑا مدد گار کہہ کر، یا رسول اللہ صلی اللہ علیہ وسلم سے، یا فاطمہ، حسین اور حسن رضی اللہ عنہم سے۔ نعرے بھی ان سے مدد مانگنے کے الفاظ کے ساتھ لگاتے ہیں، جیسا کہ یا رسول اللہ، یا علی، یا غوث اعظم وغیرہ، گویا ان کی حالت عملی طور پر ان پہلے کفار و مشرکین سے بھی بد تر ہے۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41،40) {قُلْ اَرَءَيْتَكُمْ اِنْ اَتٰىكُمْ عَذَابُ اللّٰهِ …:} اس مضمون کو بھی اللہ تعالیٰ نے کئی جگہ بیان کیا ہے۔ دیکھیے سورۂ بنی اسرائیل (۶۷)، سورۂ زمر (۳۸)، سورۂ مومنون (۸۴ تا ۸۹)، سورۂ لقمان (۳۲) اور سورۂ یونس (۲۲) ان آیات میں اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم کے زمانے کے مشرکین کا طرزِ عمل بیان فرمایا، مطلب یہ ہے کہ توحید انسان کی فطرت میں رکھ دی گئی ہے، وہ ماحول کے اثر سے یا آباء و اجداد کی تقلید سے شرک میں گرفتار ہوتا ہے اور غیر اللہ کو اپنا حاجت روا اور مشکل کشا سمجھتا رہتا ہے، نذر و نیاز بھی ان کے نام کی نکالتا ہے، لیکن جب آزمائش سے دو چار ہوتا ہے تو پھر سب کو بھول جاتا ہے اور فطرت ان سب پر غالب آ جاتی ہے، پھر بے بس انسان سب کچھ بھول جاتا ہے اور صرف اسی ایک ذات کو پکارتا ہے جسے پکارنا چاہیے۔ یہاں بھی اللہ تعالیٰ نے ان کے اسی طرزِ عمل کو بطور ثبوت توحید کی دلیل کے طور پر بیان کیا، یعنی اگر اپنے اس دعویٰ میں کہ جنھیں تم اللہ کے سوا پکارتے ہو، وہ تم پر آئی ہوئی بلا ٹال سکتے ہیں تو یہ بتاؤ کہ اللہ کا عذاب آنے کی صورت میں، یا قیامت آنے پر بھی کیا تم غیر اللہ کو پکارو گے؟ نہیں بلکہ تم صرف اسی کو پکارو گے، باقی مشکل کشا تمھیں بھول جائیں گے۔ یہ تو ان کفار و مشرکین کا حال تھا لیکن آج خود مسلمانوں کے اندر ایسے لوگ پائے جاتے ہیں جن کی فطرت اس قدر مسخ ہو چکی ہے کہ وہ سخت سے سخت مصیبت میں بھی فریاد کرتے ہیں تو اپنے کسی خود ساختہ داتا سے یا علی ( رضی اللہ عنہ ) سے، یا شیخ عبد القادر جیلانی سے، انھیں غوث اعظم، یعنی سب سے بڑا مدد گار کہہ کر، یا رسول اللہ صلی اللہ علیہ وسلم سے، یا فاطمہ، حسین اور حسن رضی اللہ عنہم سے۔ نعرے بھی ان سے مدد مانگنے کے الفاظ کے ساتھ لگاتے ہیں، جیسا کہ یا رسول اللہ، یا علی، یا غوث اعظم وغیرہ، گویا ان کی حالت عملی طور پر ان پہلے کفار و مشرکین سے بھی بد تر ہے۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 43,42){ وَ لَقَدْ اَرْسَلْنَاۤ اِلٰۤى اُمَمٍ مِّنْ قَبْلِكَ … :} ان آیات میں اللہ تعالیٰ نے ان قوموں کا ذکر فرمایا ہے جن کے دل ایسے سخت ہو گئے اور شیطان نے ان کے بداعمال کو ان کے لیے ایسا خوبصورت بنا دیا کہ وہ اللہ کا عذاب آنے پر بھی اللہ تعالیٰ کی طرف رجوع کرنے کے بجائے دنیاوی اسباب ہی کو اس عذاب کا نتیجہ قرار دیتے رہے۔ حالانکہ مصائب و آفات بھیجنے کا مقصد لوگوں کو اپنی روش سے باز آنے کا موقع فراہم کرنا ہوتا ہے، لیکن وہ اس موقع کو بھی گنوا دیتے ہیں۔ کیا آج کل ہم مسلمانوں کی اکثریت کا یہ حال نہیں ہو گیا کہ جب کوئی جنگ یا قحط یا سیلاب یا زلزلہ یا کوئی دوسری اجتماعی آفت ہم پر نازل ہوتی ہے تو ہم میں سے کئی افراد اسے محض مادی اسباب کا نتیجہ سمجھتے ہیں اور اسے اللہ تعالیٰ کی طرف سے تنبیہ اور سزا سمجھنے کو جہالت اور بے وقوفی قرار دیتے ہیں، خصوصاً منکرین حدیث اور کفار سے مرعوب لوگوں کا یہی حال ہے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43,42){ وَ لَقَدْ اَرْسَلْنَاۤ اِلٰۤى اُمَمٍ مِّنْ قَبْلِكَ … :} ان آیات میں اللہ تعالیٰ نے ان قوموں کا ذکر فرمایا ہے جن کے دل ایسے سخت ہو گئے اور شیطان نے ان کے بداعمال کو ان کے لیے ایسا خوبصورت بنا دیا کہ وہ اللہ کا عذاب آنے پر بھی اللہ تعالیٰ کی طرف رجوع کرنے کے بجائے دنیاوی اسباب ہی کو اس عذاب کا نتیجہ قرار دیتے رہے۔ حالانکہ مصائب و آفات بھیجنے کا مقصد لوگوں کو اپنی روش سے باز آنے کا موقع فراہم کرنا ہوتا ہے، لیکن وہ اس موقع کو بھی گنوا دیتے ہیں۔ کیا آج کل ہم مسلمانوں کی اکثریت کا یہ حال نہیں ہو گیا کہ جب کوئی جنگ یا قحط یا سیلاب یا زلزلہ یا کوئی دوسری اجتماعی آفت ہم پر نازل ہوتی ہے تو ہم میں سے کئی افراد اسے محض مادی اسباب کا نتیجہ سمجھتے ہیں اور اسے اللہ تعالیٰ کی طرف سے تنبیہ اور سزا سمجھنے کو جہالت اور بے وقوفی قرار دیتے ہیں، خصوصاً منکرین حدیث اور کفار سے مرعوب لوگوں کا یہی حال ہے۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ { فَلَمَّا نَسُوْا مَا ذُكِّرُوْا بِهٖ …:} جب انھوں نے اللہ تعالیٰ اور اس کے فرامین کو فراموش ہی کر دیا تو اللہ تعالیٰ نے ان پر حجت قائم کرنے کے لیے ان کی رسی دراز کر دی اور ان پر ہر قسم کی نعمتوں کے دروازے کھول دیے، پھر جب وہ عیش و آرام میں پوری طرح مگن ہو گئے تو اللہ نے اچانک انھیں پکڑ لیا، یعنی اچانک ایسا عذاب آیا کہ وہ اپنا تمام عیش و آرام بھول گئے اور انھیں بچنے کی کوئی امید نہ رہی اور اسی یاس اور ناامیدی کی حالت میں تباہ و برباد کر دیے گئے۔ عقل مند آدمی کو چاہیے کہ جب سختی اور مصیبت آئے تو اسے اللہ کی طرف سے تنبیہ سمجھ کر برے کاموں سے توبہ کر لے، ورنہ غفلت بڑھتی جائے گی اور اچانک ایسی سخت پکڑ ہو گی کہ توبہ کا موقع بھی نہیں ملے گا۔ {’’ مُّبْلِسُوْنَ ‘‘} یہ {’’ مُبْلِسٌ‘‘} کی جمع ہے، یعنی جس کی امید ختم ہو جائے۔ ¤ ➋ {فَتَحْنَا عَلَيْهِمْ اَبْوَابَ كُلِّ شَيْءٍ:} اس آیت سے معلوم ہوا کہ اگر کفر و شرک اور اللہ کی نافرمانی کے باوجود کوئی قوم دنیوی مال کے لحاظ سے نہایت ترقی یافتہ اور خوش حال ہے تو یہ نہیں سمجھنا چاہیے کہ اللہ تعالیٰ اس پر خوش ہے، نہیں، بلکہ یہ استدراج ہے اور ان کے حق میں نہایت خطرناک ہے۔ دیکھیے سورۂ آل عمران ( ۱۷۸)۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) {فَقُطِعَ دَابِرُ الْقَوْمِ الَّذِيْنَ ظَلَمُوْا… :} یعنی وہ سب نیست و نابود کر دیے گئے اور ان کی ہلاکت بھی اللہ تعالیٰ کی نعمتوں میں سے ایک نعمت تھی، جس پر ہر چیز نے سکھ کا سانس لیا اور ان کا نام و نشان مٹنے پر اللہ تعالیٰ کی حمد و ثنا کی، جس نے رب العالمین ہونے کی وجہ سے اپنی مخلوق پر رحم فرما کر زمین کو ان کے وجود سے پاک کیا۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46){ قُلْ اَرَءَيْتُمْ اِنْ اَخَذَ اللّٰهُ …:} فرمایا، اب تو تمھارے کان، آنکھیں اور دل موجود ہیں، اللہ تعالیٰ کی نشانیاں اور آیات سن کر، دیکھ کر اور ان سے متعلق سوچ کر کفر سے نجات حاصل کر سکتے ہو۔ اگر اللہ تعالیٰ ان کو لے ہی جائے اور دلوں پر مہر لگا دے تو بتاؤ اللہ تعالیٰ کے سوا کوئی ہے جو یہ نعمتیں واپس دے دے؟ اس لیے ان کے جانے سے پہلے پہلے توبہ کر لو اور اس میں ہر گز دیر نہ کرو۔ اللہ تعالیٰ مختلف طریقوں سے حقائق بیان کرتا ہے، تاکہ لوگ حقائق سے آگاہ ہو جائیں لیکن اس کے باوجود وہ اپنی روش سے باز نہیں آتے اور اللہ کی آیات سے بے رخی پر قائم رہتے ہیں۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) {قُلْ اَرَءَيْتَكُمْ اِنْ اَتٰىكُمْ … :}{ ’’ بَغْتَةً ‘‘} اچانک، بغیر کسی پیشگی اطلاع کے، یعنی رات کو اور {’’ جَهْرَةً ‘‘} کھلم کھلا، سب کے دیکھتے ہوئے، یعنی دن کو، جیسا کہ سورۂ یونس کی آیت (۵۰) میں ہے : «بَيَاتًا اَوْ نَهَارًا » ’’رات کو یا دن کو۔‘‘ پہلی آیت میں صرف ان کے کانوں، آنکھوں اور دلوں کو لے جانے یا مہر لگا کر بند کر دینے کی بات کی تھی، اب اس آیت میں عام عذاب کے ساتھ ڈرایا جا رہا ہے، یعنی اگر اللہ تعالیٰ کا عذاب آیا تو تم کسی صورت بچ نہیں سکو گے۔ باقی رہے رسول کریم صلی اللہ علیہ وسلم اور آپ کے ساتھی تو اللہ تعالیٰ انھیں ضرور بچائے گا، کیونکہ پہلے جتنی بھی قومیں تباہ کی گئیں ان کے بارے میں اللہ تعالیٰ کا مستقل طریقہ یہی رہا ہے کہ پہلے رسول اور اس کے پیروکاروں کو ظالم قوم کی بستی سے نکل جانے کا حکم دیا گیا، جب وہ نکل گئے تو ظالم لوگوں کو تباہ کر دیا گیا۔"
    },
    {
      "ayah": 48,
      "tafsir": ""
    },
    {
      "ayah": 49,
      "tafsir": ""
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ {قُلْ لَّاۤ اَقُوْلُ لَكُمْ عِنْدِيْ خَزَآىِٕنُ اللّٰهِ:} وہ لوگ نبی کریم صلی اللہ علیہ وسلم سے کہتے تھے کہ اگر تم اللہ کے رسول ہو تو اللہ تعالیٰ سے مطالبہ کرو کہ ہمیں دنیا کا ساز و سامان اور فراوانی حاصل ہو جائے، تو اس آیت میں اس کا جواب دیا گیا۔ اس سے معلوم ہوا کہ اگر یہ عقیدہ رکھا جائے کہ فلاں مرید کو فلاں پیر نے ایک خزانہ بخش دیا، یا مال دار کر دیا تو یہ عقیدہ شرک کے ذیل میں آئے گا۔ ¤ ➋ {وَ لَاۤ اَعْلَمُ الْغَيْبَ:} اور نہ میں غیب جانتا ہوں کہ آئندہ کی جو بات مجھ سے پوچھتے جاؤ میں تمھیں بتلاتا جاؤں۔ غیب کا جاننا صرف اللہ تعالیٰ کی صفت ہے، مجھے جو اور جتنا علم ہے اس کی اسی نے اطلاع دی ہے، وہ چاہتا تو مجھے اتنا علم بھی نہ دیتا اور چاہتا تو اس سے بھی زیادہ دے دیتا۔ اس سے ثابت ہوا کہ جس کا یہ عقیدہ ہو کہ انبیاء علیہم السلام کو علم غیب ہوتا ہے تو وہ مشرک ہے۔ جب سید الرسل صلی اللہ علیہ وسلم کو علم غیب نہ ہوا تو دوسروں کا ذکر کیا ہے اور جب رسول غیب دان نہ ٹھہرے تو پھر کوئی پیر، شہید، ولی یا عالم و عابد کیسے غیب دان ہو سکتا ہے؟ اور کاہن، نجومی اور رمل والے کس شمار و قطار میں ہیں؟ دیکھیے سورۂ نمل (۶۵) اور سورۂ لقمان (۳۴)۔ ¤ ➌ {وَ لَاۤ اَقُوْلُ لَكُمْ اِنِّيْ مَلَكٌ:} اور نہ میں تم سے یہ کہتا ہوں کہ میں فرشتہ ہوں، بلکہ تمھاری طرح کا ایک بشر ہوں، تو پھر تم مجھ سے آسمان پر چڑھنے کا مطالبہ کیوں کرتے ہو۔ دیکھیے سورۂ اعراف (۱۸۸) اور سورۂ ہود(۳۱)۔ ¤ ➍ {اِنْ اَتَّبِعُ اِلَّا مَا يُوْحٰۤى اِلَيَّ:} یعنی میں تمھی جیسا انسان  ہوں، فرشتہ نہیں، البتہ یہ فرق ضرور ہے کہ میرے پاس وحی آتی ہے اور تمھارے پاس نہیں آتی (دیکھیے کہف : ۱۱۰) اور میں کسی معاملے میں اپنی خواہش کی پیروی نہیں کرتا، بلکہ اللہ تعالیٰ کی وحی کے مطابق عمل کرتا ہوں۔ اس سے معلوم ہوا کہ نبی صلی اللہ علیہ وسلم نے بندوں تک جتنے احکام پہنچائے، چاہے قرآن کی شکل میں یا احادیث کی صورت میں، وہ سب اللہ کی طرف سے تھے، لہٰذا قرآن کی طرح سنت کی پیروی بھی ضروری ہے، بلکہ سنت کے بغیر قرآن کی پیروی ممکن ہی نہیں ہے۔ جو لوگ سنت کو چھوڑ کر صرف قرآن کی پیروی پر زور دیتے ہیں وہ دراصل اپنی من مانی تاویلات کرنا چاہتے ہیں، جن کی راہ میں حدیث حائل ہے۔ ¤ ➎ {قُلْ هَلْ يَسْتَوِي الْاَعْمٰى وَ الْبَصِيْرُ:} یہ بظاہر سوال ہے مگر حقیقت میں اس بات کا انکار ہے کہ اندھا اور دیکھنے والا برابر ہو سکتے ہیں۔ اسے استفہام انکاری کہتے ہیں، اندھے اور دیکھنے والے سے مراد باطل پرست اور حق پرست، یا کافر اور مسلمان، یا جاہل اور عالم ہیں۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں کہ پیغمبر آدمی کے سوا کچھ اور نہیں ہو جاتے کہ ان سے محال باتیں طلب کی جائیں۔ ایک اندھے اور ایک دیکھتے کا یہی فرق ہے۔ (موضح)"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ {وَ اَنْذِرْ بِهِ الَّذِيْنَ …:} اوپر کی آیت میں پیغمبروں کے متعلق فرمایا کہ وہ مبشر (خوشخبری دینے والے) اور منذر ( ڈرانے والے) ہوتے ہیں، اب اس آیت میں رسول اللہ صلی اللہ علیہ وسلم کو انذار ( ڈرانے) کا حکم دیا۔ (رازی) یعنی ڈرانے کا فائدہ انھی کو ہو سکتا ہے جنھیں دوبارہ زندہ ہو کر اللہ تعالیٰ کے حضور پیش ہونے کا خوف ہے۔ جہاں اللہ تعالیٰ کے سوا نہ ان کی حمایت کرنے والا کوئی مدد گار ہو گا اور نہ سفارشی۔ جو لوگ حشر اور قیامت کو مانتے ہی نہیں اور انکار پر اڑے ہوئے ہیں انھیں آپ کے ڈرانے سے کوئی فائدہ نہیں ہو گا، فرمایا : « سَوَآءٌ عَلَيْهِمْ ءَاَنْذَرْتَهُمْ اَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُوْنَ » [ البقرۃ : ۶ ] ’’ان پر برابر ہے، خواہ تو نے انھیں ڈرایا ہو، یا انھیں نہ ڈرایا ہو، ایمان نہیں لائیں گے۔‘‘ ¤ ➋ {لَعَلَّهُمْ يَتَّقُوْنَ :} یعنی ان لوگوں کو ڈرانے کا یہ فائدہ ہو گا کہ آپ کے ڈرانے سے ان میں اللہ کا خوف اور زیادہ ہو جائے گا اور وہ گناہوں سے باز آجائیں گے۔ اس آیت سے ان کافروں کا رد بھی مقصود ہے جو یہ گمان رکھتے تھے کہ ان کے معبود اور ٹھاکر وغیرہ اللہ تعالیٰ سے سفارش کر کے انھیں بچا لیں گے۔ اسی طرح ان لوگوں کے لیے بھی اس میں عبرت ہے جو اپنے بزرگوں کی سفارش پر تکیہ کر کے بے فکر ہو کر بے کھٹکے گناہ کرتے رہتے ہیں، کیونکہ قیامت کے دن اللہ تعالیٰ کے حکم کے بغیر کوئی سفارش نہیں چل سکے گی۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52 )➊ {وَ لَا تَطْرُدِ الَّذِيْنَ يَدْعُوْنَ …:} سعد رضی اللہ عنہ بیان کرتے ہیں کہ ہم چھ آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے تھے۔ مشرکین نے کہا، ان لوگوں کو اپنی مجلس سے نکال دیں، تاکہ یہ ہم پر جرأت نہ کر سکیں۔ ان لوگوں میں میں تھا، ابن مسعود، ہذیل کا ایک آدمی اور دو اور جن کا میں نام نہیں لیتا، تو رسول اللہ صلی اللہ علیہ وسلم کے دل میں اللہ نے جو چاہا خیال آیا، آپ ابھی سوچ ہی رہے تھے کہ اللہ عزوجل نے یہ آیت نازل فرما دی : «وَ لَا تَطْرُدِ الَّذِيْنَ يَدْعُوْنَ رَبَّهُمْ بِالْغَدٰوةِ وَ الْعَشِيِّ يُرِيْدُوْنَ وَجْهَهٗ» [ مسلم، الفضائل، باب فی فضل سعد بن أبی وقاص رضی اللہ عنہ : ۴۶؍۲۴۱۳ ] یعنی اللہ کے طالب اگرچہ غریب ہیں انھی کی خاطر داری مقدم ہے۔ (موضح) ¤ ➋ {مَا عَلَيْكَ مِنْ حِسَابِهِمْ … :} یعنی نہ ان کا حساب آپ کے ذمے ہے، نہ آپ کا ان کے ذمے، تو ان کا کیا قصور ہے کہ آپ انھیں اپنے سے دور کریں، جس کے نتیجے میں آپ ظالم ٹھہریں۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) {وَ كَذٰلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ …:} جیسا کہ معلوم ہے ابتدا میں ایمان لانے والوں کی اکثریت کمزور مردوں، عورتوں، لونڈیوں اور غلاموں کی تھی، دولت مند بہت کم تھے اور یہی چیز کافر سرداروں کی آزمائش کا ذریعہ بن گئی۔ وہ ان غریبوں کا مذاق بھی اڑاتے اور جن پر ان کا بس چلتا انھیں زیادہ سے زیادہ اذیت بھی پہنچاتے اور کہتے کیا یہی لوگ ہیں جن پر اللہ تعالیٰ نے احسان فرمایا ہے!؟ مقصد ان کا یہ تھا کہ ایمان اور اسلام اگر واقعی اللہ کا احسان ہوتا تو سب سے پہلے ہم پر ہوتا (دیکھیے احقاف : ۱۱) کیونکہ دنیوی زندگی میں اس نے ہم کو برتری دی ہے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یعنی دولت مندوں کو غریبوں سے آزمایا ہے کہ ان کو ذلیل دیکھتے ہیں اور تعجب کرتے ہیں کہ یہ لائق ہیں اللہ کے فضل کے اور اللہ دل دیکھتا ہے کہ اللہ کا حق مانتے ہیں۔‘‘ (موضح) دراصل اللہ کے ہاں قدر و منزلت ہے تو انھی لوگوں کی جو اخلاص سے اللہ کا شکر بجا لاتے ہیں، چاہے وہ کتنے ہی غریب اور محتاج ہوں۔ اللہ تعالیٰ کے نزدیک خالی دنیوی حسب نسب اور خوشحالی کی کوئی قدر نہیں، جیسے فرمایا : «اِنَّ اَكْرَمَكُمْ عِنْدَ اللّٰهِ اَتْقٰىكُمْ» [ الحجرات : ۱۳ ] ’’ تم میں سے اللہ کے نزدیک سب سے زیادہ با عزت وہ آدمی ہے جو سب سے زیادہ پرہیز گار ہے۔‘‘"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54 )➊ {وَ اِذَا جَآءَكَ الَّذِيْنَ …:} پہلی آیت میں کمزور اہل ایمان کو اپنے پاس سے دور ہٹانے سے منع فرمایا، اب اس آیت میں ان کے اکرام اور عزت افزائی کا حکم دیا۔ (رازی) یعنی جو لوگ کفر و شرک کے غلبے کے باوجود اس پر آشوب دور میں آپ کی دعوت قبول کر کے مسلمان ہو رہے ہیں انھیں امن اور سلامتی کی خوش خبری دے دیجیے، یعنی یہ کہ اسلام لانے کے بعد وہ اللہ کے عذاب سے امن والے ہو گئے، اب ان کی ان اعمال پر پکڑ نہیں ہو گی جو وہ کفر کی زندگی میں کرتے رہے ہیں۔ ( المنار) اس سے معلوم ہوا کہ نیک لوگوں کا احترام کرنا چاہیے اور انھیں ناراض نہیں کرنا چاہیے۔ ¤ ➋ {كَتَبَ رَبُّكُمْ عَلٰى نَفْسِهِ الرَّحْمَةَ:} اس جملے کی تفسیر کے لیے دیکھیے اسی سورت کی آیت (۱۲) کی تفسیر۔ ¤ ➌ {اَنَّهٗ مَنْ عَمِلَ مِنْكُمْ سُوْٓءًۢا بِجَهَالَةٍ …:} جہالت کے ساتھ گناہ کا مطلب اس کے برے انجام کو نہ سمجھنا ہے۔ دیکھیے سورۂ نساء (۱۷) پہلے انذار ( ڈرانا) تھا، اب تبشیر (خوش خبری) ہے، یعنی یہ اس کی رحمت کا اثر ہے کہ وہ اعمال سیئہ کو چھوڑ کر اعمال حسنہ کرنے والوں کی توبہ قبول فرماتا ہے اور اپنی آیات کھول کر بیان کرتا ہے، تاکہ اصلاح کاروں سے مجرموں کا راستہ ممتاز اور خوب واضح ہو جائے۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55 )➊ {وَ كَذٰلِكَ نُفَصِّلُ الْاٰيٰتِ … :} اللہ تعالیٰ فرماتے ہیں کہ ہم نے یہ باتیں اس لیے کھول کر بیان کی ہیں تاکہ حق ظاہر ہو جائے اور اس پر عمل کیا جا سکے اور مجرموں کا راستہ خوب واضح ہو جائے، تاکہ اس سے بچا جا سکے۔ (جلالین) اس آیت سے معلوم ہوا کہ جو لوگ دعوت و تبلیغ کا کام کرتے ہیں انھیں مخالفین ( مجرمین) کے ہتھکنڈوں سے پوری طرح باخبر ہونا چاہیے، تاکہ ان کی تردید کر سکیں۔ صحابہ کرام رضی اللہ عنہم میں یہی خوبی تھی کہ ایک طرف تو وہ اسلام کو خوب سمجھتے تھے اور دوسری طرف جاہلیت کے رسم و رواج اور قوانین سے پوری واقفیت رکھتے تھے، کیونکہ وہ جاہلیت سے گزر کر آئے تھے۔ یہ مضمون حافظ ابن قیم رحمہ اللہ کی کتاب الفوائد میں خوب بیان ہوا ہے۔ ¤ ➋ {وَ لِتَسْتَبِيْنَ :} {’’ بَانَ يَبِيْنُ ‘‘} کا معنی ہے الگ ہونا، واضح ہونا، تو باب استفعال میں حروف کی کثرت کی وجہ سے ’’ اور تاکہ خوب واضح ہو جائے‘‘ ترجمہ کیا ہے۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ {قُلْ اِنِّيْ نُهِيْتُ …:} اوپر کی آیت میں تو یہ بیان ہوا کہ اللہ تعالیٰ آیات کو کھوول کھول کر بیان کرتے ہیں، تاکہ حق واضح ہو اور مجرموں کا راستہ ظاہر ہو جائے، اب اس آیت میں مجرموں کے راستے پر چلنے سے منع فرمایا، جس سے یہ بھی معلوم ہو جائے گا کہ مجرموں کا راستہ کیا ہے، جس پر چلنے سے تمھیں منع کیا گیا ہے؟ آیت کا مطلب یہ ہے کہ آپ ان سے کہہ دیجیے کہ میں تمھاری خواہشوں کے پیچھے نہیں چلوں گا، اگر میں ایسا کروں تو میں گمراہوں میں شامل ہو جاؤں گا اور میں ہدایت پانے والوں میں سے نہیں ہوں گا۔ اللہ کی ہدایت کے مخالف قول کو کتنا ہی حکیمانہ اور دانشمندانہ سمجھا جائے وہ محض خواہش پر مبنی ہے اور سراسر ضلالت و گمراہی ہے۔ کیونکہ کسی کے پاس حکم کا اختیار سمجھنا اس کی عبادت ہے اور غیر اللہ کی عبادت شرک ہے، جو سب سے بڑا گناہ ہے۔ ¤ ➋ {قُلْ اِنِّيْ نُهِيْتُ اَنْ اَعْبُدَ الَّذِيْنَ تَدْعُوْنَ :} یعنی آپ ان سے کہہ دیں کہ مجھے اللہ کے سوا ان تمام چیزوں کی عبادت سے منع کیا گیا ہے جنھیں تم پکارتے ہو۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) ➊ {قُلْ اِنِّيْ عَلٰى بَيِّنَةٍ …:} کہہ دیجیے کہ میرے پاس میرے رب کی طرف سے واضح دلیل، یعنی وحی الٰہی موجود ہے، جس کا اصل الاصول توحید ہے، اسے تم نے جھٹلایا۔ اب جس عذاب کے جلدی لانے کا تم مطالبہ کر رہے ہو وہ میرے اختیار میں نہیں۔ عذاب لانے یا نہ لانے کا فیصلہ اللہ تعالیٰ ہی کے اختیار میں ہے۔ ¤ ➋ {اِنِ الْحُكْمُ اِلَّا لِلّٰهِ:} معلوم ہوا کہ انبیاء کو معجزات پر کوئی اختیار نہیں ہوتا، یہ اختیار صرف اللہ عزوجل کے پاس ہے۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) ➊ {لَقُضِيَ الْاَمْرُ بَيْنِيْ وَ بَيْنَكُمْ:} یعنی اگر عذاب کا لانا میرے اختیار میں ہوتا تو میں تمھارے جھٹلانے کی وجہ سے اب تک تمھیں ہلاک کر چکا ہوتا۔ (رازی) ¤ ➋ {وَ اللّٰهُ اَعْلَمُ بِالظّٰلِمِيْنَ:} یعنی اللہ ہی جانتا ہے کہ کب عذاب لانا ہے اور کب تک انھیں مہلت دینی ہے۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) ➊{ وَ عِنْدَهٗ مَفَاتِحُ الْغَيْبِ … :} یعنی خلق میں سے کسی ایک کو بھی غیبی امور کا علم نہیں ہے، یہ اللہ تعالیٰ کا خاصہ ہے۔ اس سے معلوم ہوا کہ نجومی یا پنڈت یا رمال اور جفار جو اپنی غیب دانی کا دعویٰ کرتے ہیں اور لوگوں کو آئندہ پیش آنے والی باتیں بتاتے ہیں، وہ سب جھوٹے اور ٹھگ ہیں اور ان کے پاس جانا کسی مسلمان کا کام نہیں ہے۔ مزید دیکھیے سورۂ نمل (۶۵)۔ عبد اللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’غیب کی کنجیاں پانچ ہیں، انھیں اللہ تعالیٰ کے سوا کوئی نہیں جانتا : «اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةِ وَ يُنَزِّلُ الْغَيْثَ وَ  يَعْلَمُ مَا فِي الْاَرْحَامِ وَ مَا تَدْرِيْ نَفْسٌ مَّا ذَا تَكْسِبُ غَدًا وَ مَا تَدْرِيْ نَفْسٌۢ بِاَيِّ اَرْضٍ تَمُوْتُ » [ لقمان : ۳۴ ] ’’بے شک اللہ اسی کے پاس قیامت کا علم ہے اور وہی بارش اتارتا ہے اور وہ جانتا ہے جو کچھ ماؤں کے پیٹوں میں ہے اور کوئی شخص نہیں جانتا کہ وہ کل کیا کرے گا اور کوئی شخص نہیں جانتا کہ وہ کس زمین میں مرے گا۔‘‘ [ بخاری، التفسیر، باب : «وعندہ مفاتح الغیب…» : ۴۶۲۷ ] ¤ ➋ {اِلَّا فِيْ كِتٰبٍ مُّبِيْنٍ:} یعنی اس کائنات کی چھوٹی سے چھوٹی اور پوشیدہ سے پوشیدہ چیز لوح محفوظ میں درج ہے۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60 )➊ {يَتَوَفّٰىكُمْ بِالَّيْلِ:} یہاں قبض کرنے سے مراد نیند ہے۔ {’’ تَوَفِّيْ‘‘} کی تشریح کے لیے دیکھیے سورۂ زمر (42)۔ ¤ ➋ {ثُمَّ يَبْعَثُكُمْ فِيْهِ:} یعنی دن کے وقت تمھاری روح لوٹا دیتا ہے، معلوم ہوا کہ نیند بھیی ایک طرح کی موت ہے۔ ¤ ➌ {لِيُقْضٰۤى اَجَلٌ مُّسَمًّى:} یعنی تم میں سے ہر ایک کے لیے جو رزق اور عمر متعین ہے وہ پوری کی جاتی ہے۔ ¤ ➍ {ثُمَّ اِلَيْهِ مَرْجِعُكُمْ … :} یعنی دن میں تمھاری روح لوٹا کر زندہ کر دیتا ہے اور اسے معلوم ہے کہ تم نے اچھے عمل کیے یا برے، پھر اچھا کام کیا ہو گا تو اچھا بدلہ دے گا اور برا کیا ہو گا تو برا بدلہ دے گا۔ اوپر کی آیت میں کمال علم کا بیان تھا اور اس سے کمال قدرت ثابت ہوتی ہے۔ (رازی)"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) ➊ {وَ هُوَ الْقَاهِرُ فَوْقَ عِبَادِهٖ:} {’’ هُوَ ‘‘} اس جملے میں مبتدا ہے، {’’ الْقَااهِرُ ‘‘} خبر پر الف لام آنے کی وجہ سے ترجمہ ’’وہی‘‘ کیا ہے۔ {’’ الْقَاهِرُ ‘‘} کے معنی غالب ہیں اور یہ {’’ اَلْقَادِرُ ‘‘} سے زائد صفت ہے، یعنی خود قادر ہونے کے ساتھ ساتھ دوسرے کو مراد حاصل کرنے سے روک دینے والا بھی ہے۔ (بغوی) اللہ تعالیٰ کی صفت قہاریت یہ ہے کہ وہ کائنات کو عدم سے وجود میں لایا، پھر وجود پر فنا اور خرابی طاری کرتا رہتا ہے، تو کائنات میں جس قدر بھی پیدا کرنے اور فنا کرنے کا کام ہو رہا ہے سب اللہ تعالیٰ کی قہاریت کا مظہر ہے۔ سورۂ آل عمران کی آیات (۲۶، ۲۷) اس صفت کی پوری تشریح کر رہی ہیں۔ ¤ ➋ {وَ يُرْسِلُ عَلَيْكُمْ حَفَظَةً:} حفاظت کرنے والے کچھ فرشتے تو وہ ہیں جو انسان کی آفات سے حفاظت کرتے ہیں، جیسا کہ فرمایا : «لَهٗ مُعَقِّبٰتٌ مِّنْۢ بَيْنِ يَدَيْهِ وَ مِنْ خَلْفِهٖ يَحْفَظُوْنَهٗ مِنْ اَمْرِ اللّٰهِ» [[ الرعد : ۱۱ ] ’’اس کے لیے اس کے آگے اور اس کے پیچھے یکے بعد دیگرے آنے والے کئی پہرے دار ہیں، جو اللہ کے حکم سے اس کی حفاظت کرتے ہیں۔‘‘ اور کچھ وہ ہیں جو انسان کا عمل لکھتے ہیں، جیسا کہ فرمایا : «وَ اِنَّ عَلَيْكُمْ لَحٰفِظِيْنَ(10)كِرَامًا كَاتِبِيْنَ(11)يَعْلَمُوْنَ مَا تَفْعَلُوْنَ» [ الانفطار : ۱۰ تا ۱۲ ] ’’حالانکہ بلاشبہ تم پر یقینا نگہبان ( مقرر) ہیں۔ جو بہت عزت والے لکھنے والے ہیں۔ وہ جانتے ہیں جو تم کرتے ہو۔‘‘ ¤ ➌ {حَتّٰۤى اِذَا جَآءَ اَحَدَكُمُ الْمَوْتُ …:} فوت کرنے والے فرشتے کا نام عزرائیل مشہور ہے، لیکن شیخ البانی رحمہ اللہ نے ایسی تمام روایات کو ضعیف قرار دیا ہے۔ [ أحکام الجنائز، باب بدع الجنائز، حاشیہ بدعۃ، رقم : ۹۲ ] قرآن مجید میں اسے ملک الموت کہا گیا ہے، فرمایا : «قُلْ يَتَوَفّٰىكُمْ مَّلَكُ الْمَوْتِ » [ السجدۃ : ۱۱] ’’کہہ دے تمھیں موت کا فرشتہ قبض کر لے گا۔‘‘ ¤ {’’ تَوَفَّتْهُ رُسُلُنَا ‘‘} سے معلوم ہوتا ہے کہ موت والے کئی فرشتے ہیں اور کئی آیات میں اللہ تعالیٰ کے روح قبض کرنے کا ذکر ہے، جیسے فرمایا : «اَللّٰهُ يَتَوَفَّى الْاَنْفُسَ حِيْنَ مَوْتِهَا» [ الزمر : ۴۲ ] ’’اللہ جانوں کو ان کی موت کے وقت قبض کرتا ہے۔‘‘ ان تمام آیات کو مد نظر رکھیں تو صحیح یہی معلوم ہوتا ہے کہ روح قبض کرنے والا تو اللہ تعالیٰ ہی ہے، جس کے حکم سے سب کچھ ہوتا ہے، پھر ملک الموت ہے، جو اکثر علماء کے نزدیک ایک ہی ہے، البتہ اس کے معاون رحمت اور عذاب کے فرشتے کئی ہیں، جیسا کہ زیر تفسیر آیت اور براء بن عازب رضی اللہ عنھما کی حدیث میں آیا ہے کہ ملک الموت کے ساتھ رحمت اور عذاب کے فرشتے بھی ہوتے ہیں۔ ¤ ➍ {وَ هُمْ لَا يُفَرِّطُوْنَ:} یعنی جس کی جان قبض کرتے ہیں اللہ کے حکم سے اس کے مقررہ وقت پر کرتے ہیں، نہ اس سے پہلے اور نہ اس کے بعد ۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) {ثُمَّ رُدُّوْۤا اِلَى اللّٰهِ مَوْلٰىهُمُ الْحَقِّ:} پھر اللہ تعالیٰ جو ان کا سچا مالک ہے، جس نے اپنے حکم سے انھیں دنیا میں بھیجا تھا، اس کی طرف لوٹائے جائیں گے۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 64,63) {قُلْ مَنْ يُّنَجِّيْكُمْ …:} یہ حالت ان مشرکوں کی تھی جو رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں تھے، ہمارے زمانے میں مسلمان کہلانے والے کئی ایسے لوگ ہیں جو مشکل میں پھنسے ہوئے بھی دوسروں کو پکارتے ہیں۔ [ إِنَّا لِلّٰہِ وَ إِنَّا إِلَیْہِ رَاجِعُوْنَ ]"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64,63) {قُلْ مَنْ يُّنَجِّيْكُمْ …:} یہ حالت ان مشرکوں کی تھی جو رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں تھے، ہمارے زمانے میں مسلمان کہلانے والے کئی ایسے لوگ ہیں جو مشکل میں پھنسے ہوئے بھی دوسروں کو پکارتے ہیں۔ [ إِنَّا لِلّٰہِ وَ إِنَّا إِلَیْہِ رَاجِعُوْنَ ]"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) {قُلْ هُوَ الْقَادِرُ …:} اوپر سے عذاب جیسے بارش کی کثرت، طوفان، آسمانی بجلی، اولے اور آندھی وغیرہ، یا ظالم حکمران، یا عورت کے لیے اس پر ظلم کرنے والا خاوند اور نیچے سے عذاب، جیسے زلزلہ، قحط، زمین میں دھنس جانا، یا ایسے ماتحت جو خائن اور بد دیانت ہوں، مرد کے لیے ناموافق بیوی۔ {’’ اَوْ يَلْبِسَكُمْ شِيَعًا ‘‘} یعنی مختلف گروہ بنا کر انھیں آپس میں گتھم گتھا کر دے، یہ لڑائی بھی خوفناک عذاب ہے۔ جابر رضی اللہ عنہ سے روایت ہے کہ جب یہ آیت نازل ہوئی ’’کہہ دے وہی اس پر قادر ہے کہ تم پر تمھارے اوپر سے عذاب بھیج دے ‘‘ تو آپ نے دعا کی : ’’ میں تیرے چہرے کی پناہ چاہتا ہوں۔‘‘ پھر یہ نازل ہوا : ’’یا تمھارے نیچے سے‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے دعا کی : ’’میں تیرے چہرے کی پناہ چاہتا ہوں۔‘‘ پھر یہ نازل ہوا :’’یا تمھیں گروہ بنا کر آپس میں گتھم گتھا کر دے ‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ ان دونوں سے ہلکا عذاب ہے۔‘‘ [ بخاری، التفسیر، باب: «قل ھو القادر علٰی…» : ۴۶۲۸ ] ¤ سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : ’’میں نے اپنے رب سے تین دعائیں کی ہیں :(1) میں نے اللہ تعالیٰ سے دعا کی کہ میری ساری امت کو غرق کر کے ہلاک نہ کرے، تو اللہ تعالیٰ نے میری یہ دعا قبول فرمائی۔ (2) میں نے دعا کی کہ اللہ تعالیٰ میری ساری امت کو قحط میں مبتلا نہ کرے، تو اللہ تعالیٰ نے میری اس دعا کو بھی قبول فرما لیا۔ (3) میں نے دعا کی کہ میری امت کو آپس میں اختلاف اور انتشار سے بچائے تو اللہ تعالیٰ نے میری اس دعا کو قبول نہیں فرمایا۔‘‘ [ مسلم، الفتن، باب ہلاک ہذہ الأمۃ بعضھم ببعض : ۲۸۹۰ ]"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) {وَ كَذَّبَ بِهٖ قَوْمُكَ:} تیری قوم نے اسے جھٹلا دیا۔ اس{ ’’ بِهٖ ‘‘} کی ضمیر سے مراد قرآن بھی ہو سکتا ہے اور اوپر کی آیات میں مذکور عذاب بھی۔ «قُلْ لَّسْتُ عَلَيْكُمْ بِوَكِيْلٍ» یعنی میرا یہ کام نہیں ہے کہ تمھارے جھٹلا دینے اور بد تمیزی کرنے پر خود عذاب نازل کر دوں، میرا کام تو صرف یہ ہے کہ تمھیں اللہ تعالیٰ کا پیغام پہنچا دوں اور نہ ماننے والوں کو اس کی سزا بتا دوں، اس کے بعد عذاب بھیجنا یا نہ بھیجنا اللہ کے اختیار میں ہے اور اس سے بچنے کی فکر کرنا تمھارا کام ہے۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) {لِكُلِّ نَبَاٍ مُّسْتَقَرٌّ … :} اس آیت میں کفار کے لیے دھمکی ہے۔ (رازی) یعنی اللہ کی دی ہوئی خبر غلط نہیں ہو سکتی، لیکن اس کا ایک وقت متعین ہے۔ چنانچہ جس عذاب کا تم مطالبہ کر رہے ہو، جب اس کا وقت آئے گا تو وہ بھی نازل ہو جائے گا۔ اس وقت تم جان لو گے کہ جس چیز سے میں تمھیں بار بار ڈرا رہا تھا وہ کہاں تک سچی تھی۔ اس عذاب سے مراد آخرت کا عذاب بھی ہے اور وہ عذاب بھی جو دنیا میں کفار پر لڑائی، خوف اور قحط کی صورت میں نازل ہوا۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) {وَ اِذَا رَاَيْتَ الَّذِيْنَ يَخُوْضُوْنَ … :} یعنی جب تم ایسے لوگوں کی مجلس دیکھو جو اللہ تعالیٰ اور اس کے رسول کے احکام کا مذاق اڑا رہے ہوں، یا عملاً ان کی بے قدری کر رہے ہوں، یا وہ اہل بدعت ہوں جو اپنی بے جا تاویلوں اور تحریفات سے آیات الٰہی کو توڑ مروڑ رہے ہوں، یا ان پر نکتہ چینی کر رہے ہوں اور الٹے سیدھے معنی پہنا کر ان کا مذاق اڑا رہے ہوں، تو اس مجلس سے اس وقت تک کنارہ کرو جب تک وہ دوسری باتوں میں مشغول نہ ہو جائیں اور اگر شیطان کے بھلانے سے اس مجلس میں بیٹھ ہی جاؤ تو یاد آنے کے بعد ان ظالموں کی مجلس میں بیٹھے نہ رہو۔ سورۂ نساء (۱۴۰) میں یہ حکم پہلے بھی گزر چکا ہے، اس میں یہ بھی ہے : «اِنَّكُمْ اِذًا مِّثْلُهُمْ» ’’بے شک اس وقت تم بھی ان جیسے ہو گے۔‘‘ اہل بدعت کی صحبت اس صحبت سے بھی کئی درجے بدتر ہے جس میں گناہوں کا علانیہ ارتکاب ہو رہا ہو، خصوصاً اس شخص کے لیے جو علمی اور ذہنی طور پر پختہ نہ ہو اور بدعتیوں کی غلط تاویلوں کی غلطی سمجھنے کی اہلیت نہ رکھتا ہو۔ ہاں، اہل علم ان کی غلط باتوں پر تنقید کے لیے اور کلمۂ حق بلند کرنے کے لیے ایسی مجلسوں میں شریک ہو سکتے ہیں۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) {وَ مَا عَلَى الَّذِيْنَ يَتَّقُوْنَ …:} شاہ عبد القادر رحمہ اللہ لکھتے ہیں، یعنی اگر کوئی متقی شخص چاہے کہ ایسے جاہلوں کے پاس نصیحت کے لیے بھی نہ بیٹھے تو اس کے متعلق فرمایا کہ اگر وہ نہ بیٹھے تو اس پر ان کے گمراہ رہنے کا کوئی گناہ نہیں، البتہ انھیں نصیحت کرے تو بہتر ہے، کیونکہ ہو سکتا ہے کہ وہ ڈر جائیں تو اسے نصیحت کرنے کا ثواب مل جائے۔(موضح) اور یہ معنی بھی ہو سکتے ہیں کہ پرہیز گار لوگ اگر ان کی مجلس میں نصیحت کے لیے بیٹھ جائیں تو کچھ حرج نہیں ہے، لیکن ہم نے جو کنارہ کرنے کا حکم دیا ہے تو اس نصیحت کے پیش نظر کہ شاید تمھارے کنارہ کرنے کی وجہ سے وہ اس قسم کی بے ہودگی سے باز آ جائیں۔ واللہ اعلم ! (ابن کثیر)"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) {وَ ذَرِ الَّذِيْنَ اتَّخَذُوْا … :} اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم کو حکم دیا کہ جو لوگ دین اسلام کا مذاق اڑاتے ہیں اور دنیا کی زندگی نے انھیں دھوکے میں ڈال رکھا ہے، آپ انھیں ان کے حال پر چھوڑ دیں اور اس قرآن کے ذریعے سے لوگوں کو نصیحت کرتے رہیں، ایسا نہ ہو کہ کوئی شخص اپنے برے اعمال کی وجہ سے جو اس نے کمائے، ہلاک کر دیا جائے، پھر آخرت میں اس کے چھوٹنے کی کوئی صورت ہی نہ رہے، کیونکہ اللہ تعالیٰ کے سوا ان کا نہ کوئی حمایتی ہو گا اور نہ کوئی سفارش کرنے والا اور وہ کوئی بھی فدیہ دیں ان سے قبول نہیں کیا جائے گا۔ یہ وہ لوگ ہیں جو اپنی کمائی اور بد اعمال کی وجہ سے ہلاک کر دیے گئے۔ ان کے پینے کے لیے سخت گرم پانی ہو گا اور ان کے کفر کی وجہ سے ان کے لیے دردناک عذاب ہو گا۔ دیکھیے سورۂ بقرہ (۴۸)۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آيت72،71) {قُلْ اَنَدْعُوْا مِنْ دُوْنِ اللّٰهِ …:} آپ ان سے کہہ دیں کہ کیا ہم توحید کی سیدھی سڑک چھوڑ کر پھر شرک میں مبتلا ہو جائیں، اگر ہم ایسا کریں تو ہماری مثال اس شخص کی طرح ہو گی جو اپنے ساتھیوں کے ساتھ کسی صحرا سے گزر رہا ہو اور شیطانوں کے نرغے میں آ جائے، جو اسے سیدھے راستے سے بھٹکا کر کسی اور طرف لے جائیں اور وہ حیران و پریشان نہ سمجھ سکے کہ کیا کرے اور اس کے ساتھی اسے پکار رہے ہوں کہ ہماری طرف آجاؤ، سیدھی راہ ادھر ہے، لیکن وہ شیطانوں کے چکر میں ایسا پھنس گیا ہے کہ نہ وہ ساتھیوں کی پکار کا جواب دیتا ہے اور نہ ان کی طرف جاتا ہے۔ مطلب یہ ہے کہ کفر و شرک اختیار کر کے جو گمراہ ہو گیا ہے، وہ بھٹکے ہوئے راہی کی طرح ہدایت کی طرف نہیں آسکتا۔ ہاں، اگر اللہ تعالیٰ نے اس کے لیے ہدایت مقدر کر دی ہے تو یقینا اللہ کی توفیق سے وہ راہ یاب ہو جائے گا، کیونکہ سیدھے راستے پر چلانا اسی کا کام ہے، ہمارے لیے یہ حکم ہے کہ ہم اللہ رب العالمین کے سامنے سر تسلیم خم کر دیں اور نماز قائم کریں اور اللہ سے ڈرتے رہیں، اس یقین کے ساتھ کہ قیامت کے دن سب کو اسی کے سامنے جمع ہونا ہے۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آيت72،71) {قُلْ اَنَدْعُوْا مِنْ دُوْنِ اللّٰهِ …:} آپ ان سے کہہ دیں کہ کیا ہم توحید کی سیدھی سڑک چھوڑ کر پھر شرک میں مبتلا ہو جائیں، اگر ہم ایسا کریں تو ہماری مثال اس شخص کی طرح ہو گی جو اپنے ساتھیوں کے ساتھ کسی صحرا سے گزر رہا ہو اور شیطانوں کے نرغے میں آ جائے، جو اسے سیدھے راستے سے بھٹکا کر کسی اور طرف لے جائیں اور وہ حیران و پریشان نہ سمجھ سکے کہ کیا کرے اور اس کے ساتھی اسے پکار رہے ہوں کہ ہماری طرف آجاؤ، سیدھی راہ ادھر ہے، لیکن وہ شیطانوں کے چکر میں ایسا پھنس گیا ہے کہ نہ وہ ساتھیوں کی پکار کا جواب دیتا ہے اور نہ ان کی طرف جاتا ہے۔ مطلب یہ ہے کہ کفر و شرک اختیار کر کے جو گمراہ ہو گیا ہے، وہ بھٹکے ہوئے راہی کی طرح ہدایت کی طرف نہیں آسکتا۔ ہاں، اگر اللہ تعالیٰ نے اس کے لیے ہدایت مقدر کر دی ہے تو یقینا اللہ کی توفیق سے وہ راہ یاب ہو جائے گا، کیونکہ سیدھے راستے پر چلانا اسی کا کام ہے، ہمارے لیے یہ حکم ہے کہ ہم اللہ رب العالمین کے سامنے سر تسلیم خم کر دیں اور نماز قائم کریں اور اللہ سے ڈرتے رہیں، اس یقین کے ساتھ کہ قیامت کے دن سب کو اسی کے سامنے جمع ہونا ہے۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت73) ➊ {وَ هُوَ الَّذِيْ خَلَقَ … :} یعنی اللہ تعالیٰ ہی نے زمین و آسمان کو پیدا کیا، لیکن بے مقصد اور کھیل کے لیے نہیں بلکہ حق، یعنی خاص مقصد کے لیے پیدا فرمایا ہے، وہ مقصد کیا ہے، اللہ تعالیٰ نے زمین و آسمان کی تخلیق کا مقصد یہ بیان فرمایا : «لِيَبْلُوَكُمْ اَيُّكُمْ اَحْسَنُ عَمَلًا» [الملک : ۶] ’’تاکہ وہ تمھیں آزمائے کہ تم میں سے کون عمل میں زیادہ اچھا ہے۔‘‘ اور انسان اور جن کی تخلیق کا مقصد یہ بیان فرمایا : «وَ مَا خَلَقْتُ الْجِنَّ وَ الْاِنْسَ اِلَّا لِيَعْبُدُوْنِ» [الذاریات : ۵۶] ’’اور میں نے جنوں اور انسانوں کو پیدا نہیں کیا، مگر اس لیے کہ وہ میری عبادت کریں۔‘‘ دوسری آیت میں فرمایا : «وَ سَخَّرَ لَكُمْ مَّا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ جَمِيْعًا مِّنْهُ» [ الجاثیۃ : ۱۳] ’’ اور اس نے تمھاری خاطر جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے سب کو اپنی طرف سے مسخر کر دیا۔‘‘ اور فرمایا : «هُوَ الَّذِيْ خَلَقَ لَكُمْ مَّا فِي الْاَرْضِ جَمِيْعًا» [ البقرۃ : ۲۹ ] ’’وہی ہے جس نے زمین میں جو کچھ بھی ہے سب تمھارے لیے پیدا فرمایا۔‘‘ معلوم ہوا کہ یہ سب کچھ انسان کے فائدے اور اس کی آزمائش کے لیے ہے اور انسان کو اللہ تعالیٰ نے اپنی عبادت کے لیے پیدا فرمایا ہے۔ ¤ ➋ {وَ يَوْمَ يَقُوْلُ كُنْ فَيَكُوْنُ:} یعنی حشر کے دن جب وہ تمام مردوں کو زندہ کرنا چاہے گا تو اللہ تعالیٰ کے لفظ {’’ كُنْ ‘‘} کہنے سے تمام مردے زندہ ہو جائیں گے۔ ¤ ➌ {وَ لَهُ الْمُلْكُ يَوْمَ يُنْفَخُ فِي الصُّوْرِ:} یعنی دنیا میں مجازی طور پر جن کو بادشاہ کہا جاتا تھا ان کی مجازی بادشاہت بھی ختم ہو جائے گی، اللہ فرمائے گا : «لِمَنِ الْمُلْكُ الْيَوْمَ لِلّٰهِ الْوَاحِدِ الْقَهَّارِ » [المؤمن : ۱۶ ] ’’آج کس کی بادشاہی ہے، صرف اللہ کی جو ایک ہے، زبردست ہے۔‘‘ نیز دیکھیے سورۂ فاتحہ میں {’’ مٰلِكِ يَوْمِ الدِّيْنِ‘‘} کی تفسیر۔ {’’ الصُّوْرِ ‘‘} کیا چیز ہے ؟ عبد اللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک اعرابی آیا، اس نے عرض کیا : ’’اے اللہ کے رسول ! صور کیا ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اس سے مراد وہ سینگ ہے جس میں پھونکا جائے گا۔‘‘ [ أحمد : 162/2، ح : ۶۵۱۴۔ ترمذی، صفات المؤمنین، باب صفۃ القیامۃ… : ۲۴۳۰ ] اس لیے عام طور پر اس کا ترجمہ نرسنگا کیا جاتا ہے۔ ¤ دوسری حدیث میں ہے : ’’صور پھونکنے والا فرشتہ اس وقت سے تیار عرش کی طرف دیکھ رہا ہے جب سے اسے صور دیا گیا ہے اور وہ آنکھ بھی نہیں جھپک رہا کہ کہیں اسی اثنا میں اسے حکم نہ دے دیا جائے۔‘‘ [ مستدرک حاکم : 558/4، ح : ۸۶۷۶۔ الصحیحۃ : 65/2، ح : ۱۰۷۸ ] پس صحیح یہی ہے کہ صور ایک قرن ( نرسنگا) ہے۔ جو لوگ کہتے ہیں کہ {’’ الصُّوْرِ ‘‘ ’’ صُوْرَةٌ ‘‘} کی جمع ہے اور اس سے مراد مخلوق کی صورتیں ہیں تو یہ قول قرآن و سنت کی رو سے مردود ہے۔ مزید دیکھیے سورۂ نمل (۸۷) پہلے ایک صور پھونکا جائے گا، ساری خلقت گھبرا جائے گی، پھر دوبارہ پھونکا جائے گا تو ساری خلقت فنا ہو جائے گی، پھر تیسری دفعہ پھونکا جائے گا تو ساری خلقت زندہ ہو کر ایک جگہ جمع ہو جائے گی۔ بعض نے لکھا ہے کہ نفخہ اصل میں دو بار ہو گا، پہلے کو نفخۂ فزع یا صعق کہا جاتا ہے، گویا پہلے گھبراہٹ پھر بے ہوشی اور نتیجتاً فنا، یعنی دونوں ایک ہی ہیں اور دوسرے کو نفخۂ قیام۔ واللہ اعلم! (ابن کثیر، قرطبی) ¤ ➍ {عٰلِمُ الْغَيْبِ وَ الشَّهَادَةِ:} {’’ الْغَيْبِ ‘‘} سے مراد بندوں کے اعتبار سے غیب (پوشیدہ) اور {’’ الشَّهَادَةِ ‘‘} کا معنی حاضر ہے، ورنہ اللہ تعالیٰ کے لیے تو کوئی بھی چیز پوشیدہ نہیں، سب حاضر ہی حاضر ہے۔ ¤ ➎ {وَ هُوَ الْحَكِيْمُ الْخَبِيْرُ:} یعنی جو رب یہ صفات رکھتا ہے وہی اس لائق ہے کہ تم اس کی فرماں برداری اختیار کرو، اس کے بندے بن کر رہو اور سمجھو کہ تمھیں اللہ کے حضور پیش ہونا ہے اور اچھے یا برے ہر عمل کا بدلہ پانا ہے۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) ➊ {وَ اِذْ قَالَ اِبْرٰهِيْمُ لِاَبِيْهِ اٰزَرَ … :} اوپر کی آیات میں توحید کے حق ہونے اور شرک کے باطل ہونے کے دلائل بیان کرتے ہوئے مشرکین مکہ کے غلط عقائد پر تنقید کی گئی اور اب شرک کی تردید کے لیے ابراہیم علیہ السلام کا قصہ بطور تائید بیان فرمایا کہ وہ توحید کے سب سے بڑے داعی اور شرک سے بے زار تھے اور مسلمانوں کو سمجھایا کہ دیکھو انھوں نے کس طرح قوم سے علیحدگی اختیار کی۔ مشرکین مکہ ابراہیم علیہ السلام کے دین پر ہونے کے دعوے دار تھے، جب ابراہیم علیہ السلام موحد تھے تو اب شرک کے جواز پر تمھارے پاس کیا دلیل رہ جاتی ہے۔ ¤ ➋ اس آیت سے معلوم ہوا کہ ابراہیم علیہ السلام کے والد کا نام آزر تھا۔ اب پہلی کتابوں میں اگر ان کا نام آرخ یا تارخ لکھا ہو تو قرآن کی بات ہی حق ہو گی۔ زیادہ سے زیادہ یہ کہا جا سکتا ہے کہ آرخ یا تارخ اس کا لقب ہو گا، مگر یہ کہنا کہ ان کے باپ کا نام آزر نہیں تھا بلکہ یہ نام چچا کا تھا، بالکل ہی بے دلیل ہے۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) {مَلَكُوْتَ: ’’ مُلْكٌ ‘‘} کے آخر میں واؤ اور تاء کا اضافہ کر کے {’’ مَلَكُوْتَ ‘‘} فرمایا، مقصد حروف بڑھانے کا معنی میں زیادتی ہے، اس لیے اس کا ترجمہ ’’عظیم سلطنت ‘‘ کیا گیا ہے۔ مطلب یہ ہے کہ جیسے ہم نے پچھلی آیات میں شرک کی تردید کی ہے اسی طرح ہم نے ابراہیم علیہ السلام کو آسمان و زمین کی عظیم سلطنت کا مشاہدہ کروایا، جس کے کئی مقاصد کے ساتھ ایک یہ بھی تھا کہ انھیں توحید کا آنکھوں دیکھا یقین حاصل ہو جائے۔ ایسے ہی انھیں یہ مشاہدہ بھی کروایا گیا تھا کہ اللہ تعالیٰ مردوں کو کس طرح زندہ کرتا ہے۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76تا79) {فَلَمَّا جَنَّ عَلَيْهِ الَّيْلُ … :} ابراہیم علیہ السلام کی قوم کئی معبودوں کی پرستش کرتی تھی، جن میں بت، سورج، چاند اور ستارے بھی تھے بلکہ بادشاہ بھی ان کا رب تھا۔ ابراہیم علیہ السلام نے ان سب چیزوں کے معبود نہ ہونے کے ایسے زبردست دلائل پیش کیے، جن کا کوئی جواب ان کے پاس نہ تھا۔ بتوں کے معبود نہ ہونے کو انھوں نے بت توڑ کر ثابت کیا۔ بادشاہ سے ایسی مدلل بات کی کہ آخر وہ {’’ فَبُهِتَ الَّذِيْ كَفَر ‘‘} بالکل لاجواب ہو گیا۔ یہاں زیر تفسیر آیات میں ان کا اپنی قوم کے ساتھ سورج، چاند اور ستاروں کے معبود نہ ہونے پر مناظرے کا ذکر ہے۔ چنانچہ ایک رات ابراہیم علیہ السلام نے ایک بہت چمکتا ہوا ستارہ دیکھ کر کہا : ’’یہ میرا رب ہے۔‘‘ یقینا وہ لوگ ابراہیم علیہ السلام کی زبان سے یہ بات سن کر بہت خوش ہوئے ہوں گے، مگر یہ تو توحید کے منکروں کو گھیر کر مارنے کی عظیم تدبیر تھی۔ یعنی ابراہیم علیہ السلام نے ایک محال چیز کو مفروضہ کے طور پر تسلیم کیا، تاکہ دل نشین طریقے سے انھیں قائل کیا جائے۔ چنانچہ جب وہ غروب ہوا تو ابراہیم علیہ السلام نے فرمایا : ’’میں غروب ہونے والوں سے محبت نہیں کرتا۔‘‘ پھر چاند کو اپنا رب کہا، جب وہ بھی غروب ہو گیا تو فرمایا : ’’میرے رب نے اگر مجھے ہدایت نہ دی تو یقینا میں بھی گمراہوں سے ہو جاؤں گا۔‘‘ اس میں اس طرف اشارہ فرمایا کہ میں جس ہدایت پر ہوں وہ میری ذاتی سوچ اور فکر نہیں ہے اور نہ یہ میری ذاتی اور شخصی دعوت ہے، یہ میرے رب کی عنایت اور اسی کا احسان ہے، اس لیے میں اسی کی طرف دعوت دیتا ہوں۔ پھر سورج کو چمکتے ہوئے دیکھا اور کہا : ’’یہ سب سے بڑا ہے، اس لیے یہی میرا رب ہے۔‘‘ قوم کو امید پیدا ہوئی ہوگی کہ چلو ہمارے کسی معبود کو ماننے پر تو تیار ہو گیا ہے، مگر سورج کے غروب ہونے پر ان کے تمام معبودوں سے بے زاری کا اور زمین و آسمان کو پیدا کرنے والے ایک ہی معبود برحق کا اعلان کیا تو قوم جھگڑے پر اتر آئی، جھگڑے کے ساتھ اپنے خداؤں کے غضب سے ڈرانے لگی۔ ابراہیم علیہ السلام نے فرمایا : ’’میں تمھارے شریکوں سے نہیں ڈرتا، ہاں، اللہ تعالیٰ کوئی نقصان پہنچانا چاہے تو وہ پہنچا سکتا ہے۔‘‘ ¤ بعض لوگ کہتے ہیں کہ ابراہیم علیہ السلام کی ولادت اور پرورش ایک غار کے اندر ہوئی تھی، تاکہ بادشاہ اپنے ایک خواب کی وجہ سے انھیں قتل نہ کر دے۔ جب باہر آئے تو اپنا رب ڈھونڈنے کے لیے غور و فکر کے یہ مراحل طے کیے اور آخر کار اللہ تعالیٰ تک پہنچ گئے، حالانکہ ان آیات میں صاف ذکر ہے کہ قوم کی مجلس میں یہ سب باتیں ہوئی ہیں جن کے ساتھ ابراہیم علیہ السلام نے قوم کو لاجواب کیا ہے۔ پھر دیکھیں کہ اللہ تعالیٰ نے خود یہاں فرمایا : «وَ تِلْكَ حُجَّتُنَاۤ اٰتَيْنٰهَاۤ اِبْرٰهِيْمَ عَلٰى قَوْمِهٖ » [ الأنعام : ۸۳ ] ’’یہ تمام باتیں ہم نے دلیل کے طور پر ابراہیم کو قوم کے مقابلے میں عطا فرمائی تھیں۔‘‘ اور جب انھوں نے اللہ کے حکم کے مطابق قوم کو اس دلیل کے ذریعے سے سورج، چاند اور ستارے کے رب نہ ہو سکنے کی بات سمجھائی تو وہ جھگڑے پر اتر آئے، جو ان کے لاجواب ہونے کی دلیل تھی۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 76تا79) {فَلَمَّا جَنَّ عَلَيْهِ الَّيْلُ … :} ابراہیم علیہ السلام کی قوم کئی معبودوں کی پرستش کرتی تھی، جن میں بت، سورج، چاند اور ستارے بھی تھے بلکہ بادشاہ بھی ان کا رب تھا۔ ابراہیم علیہ السلام نے ان سب چیزوں کے معبود نہ ہونے کے ایسے زبردست دلائل پیش کیے، جن کا کوئی جواب ان کے پاس نہ تھا۔ بتوں کے معبود نہ ہونے کو انھوں نے بت توڑ کر ثابت کیا۔ بادشاہ سے ایسی مدلل بات کی کہ آخر وہ {’’ فَبُهِتَ الَّذِيْ كَفَر ‘‘} بالکل لاجواب ہو گیا۔ یہاں زیر تفسیر آیات میں ان کا اپنی قوم کے ساتھ سورج، چاند اور ستاروں کے معبود نہ ہونے پر مناظرے کا ذکر ہے۔ چنانچہ ایک رات ابراہیم علیہ السلام نے ایک بہت چمکتا ہوا ستارہ دیکھ کر کہا : ’’یہ میرا رب ہے۔‘‘ یقینا وہ لوگ ابراہیم علیہ السلام کی زبان سے یہ بات سن کر بہت خوش ہوئے ہوں گے، مگر یہ تو توحید کے منکروں کو گھیر کر مارنے کی عظیم تدبیر تھی۔ یعنی ابراہیم علیہ السلام نے ایک محال چیز کو مفروضہ کے طور پر تسلیم کیا، تاکہ دل نشین طریقے سے انھیں قائل کیا جائے۔ چنانچہ جب وہ غروب ہوا تو ابراہیم علیہ السلام نے فرمایا : ’’میں غروب ہونے والوں سے محبت نہیں کرتا۔‘‘ پھر چاند کو اپنا رب کہا، جب وہ بھی غروب ہو گیا تو فرمایا : ’’میرے رب نے اگر مجھے ہدایت نہ دی تو یقینا میں بھی گمراہوں سے ہو جاؤں گا۔‘‘ اس میں اس طرف اشارہ فرمایا کہ میں جس ہدایت پر ہوں وہ میری ذاتی سوچ اور فکر نہیں ہے اور نہ یہ میری ذاتی اور شخصی دعوت ہے، یہ میرے رب کی عنایت اور اسی کا احسان ہے، اس لیے میں اسی کی طرف دعوت دیتا ہوں۔ پھر سورج کو چمکتے ہوئے دیکھا اور کہا : ’’یہ سب سے بڑا ہے، اس لیے یہی میرا رب ہے۔‘‘ قوم کو امید پیدا ہوئی ہوگی کہ چلو ہمارے کسی معبود کو ماننے پر تو تیار ہو گیا ہے، مگر سورج کے غروب ہونے پر ان کے تمام معبودوں سے بے زاری کا اور زمین و آسمان کو پیدا کرنے والے ایک ہی معبود برحق کا اعلان کیا تو قوم جھگڑے پر اتر آئی، جھگڑے کے ساتھ اپنے خداؤں کے غضب سے ڈرانے لگی۔ ابراہیم علیہ السلام نے فرمایا : ’’میں تمھارے شریکوں سے نہیں ڈرتا، ہاں، اللہ تعالیٰ کوئی نقصان پہنچانا چاہے تو وہ پہنچا سکتا ہے۔‘‘ ¤ بعض لوگ کہتے ہیں کہ ابراہیم علیہ السلام کی ولادت اور پرورش ایک غار کے اندر ہوئی تھی، تاکہ بادشاہ اپنے ایک خواب کی وجہ سے انھیں قتل نہ کر دے۔ جب باہر آئے تو اپنا رب ڈھونڈنے کے لیے غور و فکر کے یہ مراحل طے کیے اور آخر کار اللہ تعالیٰ تک پہنچ گئے، حالانکہ ان آیات میں صاف ذکر ہے کہ قوم کی مجلس میں یہ سب باتیں ہوئی ہیں جن کے ساتھ ابراہیم علیہ السلام نے قوم کو لاجواب کیا ہے۔ پھر دیکھیں کہ اللہ تعالیٰ نے خود یہاں فرمایا : «وَ تِلْكَ حُجَّتُنَاۤ اٰتَيْنٰهَاۤ اِبْرٰهِيْمَ عَلٰى قَوْمِهٖ » [ الأنعام : ۸۳ ] ’’یہ تمام باتیں ہم نے دلیل کے طور پر ابراہیم کو قوم کے مقابلے میں عطا فرمائی تھیں۔‘‘ اور جب انھوں نے اللہ کے حکم کے مطابق قوم کو اس دلیل کے ذریعے سے سورج، چاند اور ستارے کے رب نہ ہو سکنے کی بات سمجھائی تو وہ جھگڑے پر اتر آئے، جو ان کے لاجواب ہونے کی دلیل تھی۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 76تا79) {فَلَمَّا جَنَّ عَلَيْهِ الَّيْلُ … :} ابراہیم علیہ السلام کی قوم کئی معبودوں کی پرستش کرتی تھی، جن میں بت، سورج، چاند اور ستارے بھی تھے بلکہ بادشاہ بھی ان کا رب تھا۔ ابراہیم علیہ السلام نے ان سب چیزوں کے معبود نہ ہونے کے ایسے زبردست دلائل پیش کیے، جن کا کوئی جواب ان کے پاس نہ تھا۔ بتوں کے معبود نہ ہونے کو انھوں نے بت توڑ کر ثابت کیا۔ بادشاہ سے ایسی مدلل بات کی کہ آخر وہ {’’ فَبُهِتَ الَّذِيْ كَفَر ‘‘} بالکل لاجواب ہو گیا۔ یہاں زیر تفسیر آیات میں ان کا اپنی قوم کے ساتھ سورج، چاند اور ستاروں کے معبود نہ ہونے پر مناظرے کا ذکر ہے۔ چنانچہ ایک رات ابراہیم علیہ السلام نے ایک بہت چمکتا ہوا ستارہ دیکھ کر کہا : ’’یہ میرا رب ہے۔‘‘ یقینا وہ لوگ ابراہیم علیہ السلام کی زبان سے یہ بات سن کر بہت خوش ہوئے ہوں گے، مگر یہ تو توحید کے منکروں کو گھیر کر مارنے کی عظیم تدبیر تھی۔ یعنی ابراہیم علیہ السلام نے ایک محال چیز کو مفروضہ کے طور پر تسلیم کیا، تاکہ دل نشین طریقے سے انھیں قائل کیا جائے۔ چنانچہ جب وہ غروب ہوا تو ابراہیم علیہ السلام نے فرمایا : ’’میں غروب ہونے والوں سے محبت نہیں کرتا۔‘‘ پھر چاند کو اپنا رب کہا، جب وہ بھی غروب ہو گیا تو فرمایا : ’’میرے رب نے اگر مجھے ہدایت نہ دی تو یقینا میں بھی گمراہوں سے ہو جاؤں گا۔‘‘ اس میں اس طرف اشارہ فرمایا کہ میں جس ہدایت پر ہوں وہ میری ذاتی سوچ اور فکر نہیں ہے اور نہ یہ میری ذاتی اور شخصی دعوت ہے، یہ میرے رب کی عنایت اور اسی کا احسان ہے، اس لیے میں اسی کی طرف دعوت دیتا ہوں۔ پھر سورج کو چمکتے ہوئے دیکھا اور کہا : ’’یہ سب سے بڑا ہے، اس لیے یہی میرا رب ہے۔‘‘ قوم کو امید پیدا ہوئی ہوگی کہ چلو ہمارے کسی معبود کو ماننے پر تو تیار ہو گیا ہے، مگر سورج کے غروب ہونے پر ان کے تمام معبودوں سے بے زاری کا اور زمین و آسمان کو پیدا کرنے والے ایک ہی معبود برحق کا اعلان کیا تو قوم جھگڑے پر اتر آئی، جھگڑے کے ساتھ اپنے خداؤں کے غضب سے ڈرانے لگی۔ ابراہیم علیہ السلام نے فرمایا : ’’میں تمھارے شریکوں سے نہیں ڈرتا، ہاں، اللہ تعالیٰ کوئی نقصان پہنچانا چاہے تو وہ پہنچا سکتا ہے۔‘‘ ¤ بعض لوگ کہتے ہیں کہ ابراہیم علیہ السلام کی ولادت اور پرورش ایک غار کے اندر ہوئی تھی، تاکہ بادشاہ اپنے ایک خواب کی وجہ سے انھیں قتل نہ کر دے۔ جب باہر آئے تو اپنا رب ڈھونڈنے کے لیے غور و فکر کے یہ مراحل طے کیے اور آخر کار اللہ تعالیٰ تک پہنچ گئے، حالانکہ ان آیات میں صاف ذکر ہے کہ قوم کی مجلس میں یہ سب باتیں ہوئی ہیں جن کے ساتھ ابراہیم علیہ السلام نے قوم کو لاجواب کیا ہے۔ پھر دیکھیں کہ اللہ تعالیٰ نے خود یہاں فرمایا : «وَ تِلْكَ حُجَّتُنَاۤ اٰتَيْنٰهَاۤ اِبْرٰهِيْمَ عَلٰى قَوْمِهٖ » [ الأنعام : ۸۳ ] ’’یہ تمام باتیں ہم نے دلیل کے طور پر ابراہیم کو قوم کے مقابلے میں عطا فرمائی تھیں۔‘‘ اور جب انھوں نے اللہ کے حکم کے مطابق قوم کو اس دلیل کے ذریعے سے سورج، چاند اور ستارے کے رب نہ ہو سکنے کی بات سمجھائی تو وہ جھگڑے پر اتر آئے، جو ان کے لاجواب ہونے کی دلیل تھی۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 76تا79) {فَلَمَّا جَنَّ عَلَيْهِ الَّيْلُ … :} ابراہیم علیہ السلام کی قوم کئی معبودوں کی پرستش کرتی تھی، جن میں بت، سورج، چاند اور ستارے بھی تھے بلکہ بادشاہ بھی ان کا رب تھا۔ ابراہیم علیہ السلام نے ان سب چیزوں کے معبود نہ ہونے کے ایسے زبردست دلائل پیش کیے، جن کا کوئی جواب ان کے پاس نہ تھا۔ بتوں کے معبود نہ ہونے کو انھوں نے بت توڑ کر ثابت کیا۔ بادشاہ سے ایسی مدلل بات کی کہ آخر وہ {’’ فَبُهِتَ الَّذِيْ كَفَر ‘‘} بالکل لاجواب ہو گیا۔ یہاں زیر تفسیر آیات میں ان کا اپنی قوم کے ساتھ سورج، چاند اور ستاروں کے معبود نہ ہونے پر مناظرے کا ذکر ہے۔ چنانچہ ایک رات ابراہیم علیہ السلام نے ایک بہت چمکتا ہوا ستارہ دیکھ کر کہا : ’’یہ میرا رب ہے۔‘‘ یقینا وہ لوگ ابراہیم علیہ السلام کی زبان سے یہ بات سن کر بہت خوش ہوئے ہوں گے، مگر یہ تو توحید کے منکروں کو گھیر کر مارنے کی عظیم تدبیر تھی۔ یعنی ابراہیم علیہ السلام نے ایک محال چیز کو مفروضہ کے طور پر تسلیم کیا، تاکہ دل نشین طریقے سے انھیں قائل کیا جائے۔ چنانچہ جب وہ غروب ہوا تو ابراہیم علیہ السلام نے فرمایا : ’’میں غروب ہونے والوں سے محبت نہیں کرتا۔‘‘ پھر چاند کو اپنا رب کہا، جب وہ بھی غروب ہو گیا تو فرمایا : ’’میرے رب نے اگر مجھے ہدایت نہ دی تو یقینا میں بھی گمراہوں سے ہو جاؤں گا۔‘‘ اس میں اس طرف اشارہ فرمایا کہ میں جس ہدایت پر ہوں وہ میری ذاتی سوچ اور فکر نہیں ہے اور نہ یہ میری ذاتی اور شخصی دعوت ہے، یہ میرے رب کی عنایت اور اسی کا احسان ہے، اس لیے میں اسی کی طرف دعوت دیتا ہوں۔ پھر سورج کو چمکتے ہوئے دیکھا اور کہا : ’’یہ سب سے بڑا ہے، اس لیے یہی میرا رب ہے۔‘‘ قوم کو امید پیدا ہوئی ہوگی کہ چلو ہمارے کسی معبود کو ماننے پر تو تیار ہو گیا ہے، مگر سورج کے غروب ہونے پر ان کے تمام معبودوں سے بے زاری کا اور زمین و آسمان کو پیدا کرنے والے ایک ہی معبود برحق کا اعلان کیا تو قوم جھگڑے پر اتر آئی، جھگڑے کے ساتھ اپنے خداؤں کے غضب سے ڈرانے لگی۔ ابراہیم علیہ السلام نے فرمایا : ’’میں تمھارے شریکوں سے نہیں ڈرتا، ہاں، اللہ تعالیٰ کوئی نقصان پہنچانا چاہے تو وہ پہنچا سکتا ہے۔‘‘ ¤ بعض لوگ کہتے ہیں کہ ابراہیم علیہ السلام کی ولادت اور پرورش ایک غار کے اندر ہوئی تھی، تاکہ بادشاہ اپنے ایک خواب کی وجہ سے انھیں قتل نہ کر دے۔ جب باہر آئے تو اپنا رب ڈھونڈنے کے لیے غور و فکر کے یہ مراحل طے کیے اور آخر کار اللہ تعالیٰ تک پہنچ گئے، حالانکہ ان آیات میں صاف ذکر ہے کہ قوم کی مجلس میں یہ سب باتیں ہوئی ہیں جن کے ساتھ ابراہیم علیہ السلام نے قوم کو لاجواب کیا ہے۔ پھر دیکھیں کہ اللہ تعالیٰ نے خود یہاں فرمایا : «وَ تِلْكَ حُجَّتُنَاۤ اٰتَيْنٰهَاۤ اِبْرٰهِيْمَ عَلٰى قَوْمِهٖ » [ الأنعام : ۸۳ ] ’’یہ تمام باتیں ہم نے دلیل کے طور پر ابراہیم کو قوم کے مقابلے میں عطا فرمائی تھیں۔‘‘ اور جب انھوں نے اللہ کے حکم کے مطابق قوم کو اس دلیل کے ذریعے سے سورج، چاند اور ستارے کے رب نہ ہو سکنے کی بات سمجھائی تو وہ جھگڑے پر اتر آئے، جو ان کے لاجواب ہونے کی دلیل تھی۔"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) ➊ {وَ حَآجَّهٗ قَوْمُهٗ … :} قوم کے ساتھ یہ مناظرہ ہوا تو ان کی قوم نے اپنے عقیدے کے صحیح ہونے کے بہت سے دلائل پیش کیے، مثلاً انھوں نے ایک دلیل یہ پیش کی : «اِنَّا وَجَدْنَاۤ اٰبَآءَنَا عَلٰۤى اُمَّةٍ » [ الزخرف : ۲۲ ] ’’بے شک ہم نے اپنے باپ دادا کو اسی طریقے پر پایا ہے۔‘‘ نیز ابراہیم علیہ السلام کو دھمکی دی کہ یہ بت تمھیں آفات اور مصیبتوں میں مبتلا کر دیں گے۔ ابراہیم علیہ السلام نے یہ فرما کر {’’ وَ قَدْ هَدٰىنِ ‘‘} (اللہ نے مجھے سیدھا  راستہ بتا دیا ہے) ان کی پہلی دلیل کا جواب دیا کہ یقینی دلیل کے مقابلے میں تمھارے باپ دادا کا دین بے معنی ہے اور ان کی دھمکی کے جواب میں فرمایا کہ پروردگار کی طرف سے کوئی تکلیف پہنچنی ہو تو پہنچ سکتی ہے مگر یہ تمھارے بت اور جھوٹے پروردگار میرا کچھ نہیں بگاڑ سکتے۔ (رازی) ¤ ➋ {وَسِعَ رَبِّيْ كُلَّ شَيْءٍ عِلْمًا:} ہر چیز کی حقیقت و اصلیت کا علم میرے رب کو ہے، اس لیے وہی بتا سکتا ہے کہ ہدایت کیا ہے اور ضلالت کیا ہے، جب اس نے مجھے ہدایت کا علم عطا فرما دیا ہے تو پھر ہدایت کوئی اور چیز کیسے ہو سکتی ہے، تو کیا تم اتنا بھی نہیں سوچتے؟"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) ➊ {وَ كَيْفَ اَخَافُ … :} یہ اوپر کی آیت میں دوسرے جواب کو مکمل کیا ہے، یعنی میں تمھارے ان معبودوں سے کیوں ڈروں، جب کہ مجھے یقین ہے کہ یہ مجھے نفع یا نقصان نہیں پہنچا سکتے، ڈرنا تو تمھیں چاہیے جو بلا دلیل اللہ تعالیٰ کے ساتھ شریک بنا کر ظلم عظیم کر رہے ہو۔ ¤ ➋ {فَاَيُّ الْفَرِيْقَيْنِ اَحَقُّ بِالْاَمْنِ … :} ہم دونوں میں سے کون امن ( بے خوف ہونے) کا زیادہ حق دار ہے؟ کیا تم مشرکین، جو ان بتوں کے متعلق محض وہم پرستی کی راہ سے یہ سمجھ رہے ہو کہ شاید یہ نفع و نقصان پہنچا سکتے ہیں، یا ہم خالص توحید پرست، جنھیں یہ یقین و اطمینان حاصل ہے کہ اللہ ہی ہر نفع و نقصان پر قادر ہے اور اس کے سوا دنیا کی کوئی مردہ یا زندہ ہستی ہمارا ذرہ بھر نقصان نہیں کر سکتی۔ اس امت کے کلمہ گو پیر پرست بھی اہل توحید سے کہتے ہیں کہ جو شخص بڑے پیر کی گیارھویں چھوڑ دے اس کا بیٹا یا بھینس مر جاتی ہے، یا کوئی اور نقصان پہنچ سکتا ہے، تو ان کے لیے بھی یہی جواب ہے جو ابراہیم علیہ السلام نے فرمایا ہے۔"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) ➊ {اَلَّذِيْنَ اٰمَنُوْا وَ لَمْ يَلْبِسُوْۤا … :} یہ آیت اللہ تعالیٰ کا ارشاد بھی ہو سکتا ہے اور ابراہیم علیہ السلام کی بات کو مکمل کرنے والا حصہ بھی۔ ¤ ➋ تنوین اکثر تنکیر کے لیے ہوتی ہے، اس سے لفظ عام ہو جاتا ہے اور اس کا ہر فرد اس میں شامل ہو جاتا ہے، جیسے اس آیت میں مذکور {’’ بِظُلْمٍ ‘‘} کی تنوین کو تنکیر کے لیے لیں تو معنی ہو گا : ’’وہ لوگ جو ایمان لائے اور انھوں نے اپنے ایمان کو کسی ظلم کے ساتھ نہیں ملایا‘‘ اور بعض اوقات وہ دوسرے معانی کے لیے بھی ہوتی ہے، جن میں سے ایک معنی تعظیم بھی ہے، جس سے اس لفظ کا بڑا فرد مراد ہوتا ہے۔ جیسے اسی آیت میں {’’ بِظُلْمٍ ‘‘} کی تنوین کو تعظیم کے معنی میں لیا جائے تو مطلب ہو گا : ’’وہ لوگ جو ایمان لائے اور انھوں نے اپنے ایمان کو بہت بڑے ظلم کے ساتھ نہیں ملایا۔‘‘ عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ جب یہ آیت اتری : «اَلَّذِيْنَ اٰمَنُوْا وَ لَمْ يَلْبِسُوْۤا اِيْمَانَهُمْ بِظُلْمٍ» [ الأنعام : ۸۲ ] تو صحابہ کرام رضی اللہ عنہم پر اس آیت کا مضمون شاق گزرا۔ انھوں نے عرض کیا: ’’ہم میں سے کون ہے جس نے اپنے نفس پر ( کوئی) ظلم ( یعنی گناہ ) نہیں کیا؟‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جو تم سمجھ رہے ہو وہ بات نہیں، کیا تم نے لقمان کا قول نہیں سنا، جو وہ ا اپنے بیٹے سے کہہ رہے تھے : «اِنَّ الشِّرْكَ لَظُلْمٌ عَظِيْمٌ» [ لقمان : ۱۳ ] ’’یقینا شرک ظلم عظیم ہے۔‘‘ [ بخاری، التفسیر، باب : «ولم یلبسوا إیمانھم بظلم» : ۴۶۲۹۔ مسلم : ۱۲۴ ] ¤ آپ دیکھیں کہ صحابہ کرام رضی اللہ عنہم اہل زبان ہونے کے باوجود {’’ بِظُلْمٍ ‘‘} کی تنوین کو تنکیر کے لیے سمجھ کر پریشان ہو گئے کہ کون ہے جس نے کوئی گناہ نہ کیا ہو تو رسول اللہ صلی اللہ علیہ وسلم نے لقمان کا قول ذکر کر کے انھیں بتایا کہ یہ تنوین تعظیم کے لیے ہے، نہ کہ تنکیر کے لیے اور معنی یہ نہیں کہ کسی ظلم کے ساتھ نہیں ملایا، بلکہ معنی یہ ہے کہ بہت بڑے ظلم، یعنی شرک کے ساتھ نہیں ملایا۔ اس سے صاف ظاہر ہو رہا ہے کہ قرآن سمجھنے کے لیے صرف عربی زبان جاننا کافی نہیں، کئی مقامات پر رسول اللہ صلی اللہ علیہ وسلم کی تفسیر بھی ضروری ہے، اس لیے قرآن کو حدیث کے بغیر سمجھنے کا دعویٰ کرنے والے واضح گمراہ ہیں۔ ¤ ➌ اس آیت مبارکہ سے ثابت ہوا کہ امن و سکون اور ہدایت ایسے خالص ایمان ہی سے حاصل ہو سکتے ہیں جس میں توحید کے ساتھ کسی قسم کے شرک کی آمیزش نہ کی گئی ہو، جو قوم خالص ایمان اور خالص توحید سے محروم اور کسی بھی قسم کے شرک میں مبتلا ہو اسے کسی صورت امن و چین اور ہدایت نصیب نہیں ہو سکتی۔ افسوس کہ مسلمانوں نے خالص توحید کو چھوڑا اور قبروں اور آستانوں کی پرستش شروع کر دی (الا ما شاء اللہ) جس کے نتیجے میں پورا عالم اسلام ذلت و مسکنت کا نشانہ بن گیا۔ اب نہ کہیں امن ہے نہ ہدایت جو اللہ تعالیٰ کی توحید اور اس کے احکام کی حکمرانی کا نام ہے۔ اس کا علاج اس کے سوا کچھ نہیں کہ امت مسلمہ دوبارہ خالص توحید کی طرف پلٹے اور صرف اپنے رب کے آستانے پر جمی رہے۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) ➊ {وَ تِلْكَ حُجَّتُنَاۤ … :} اس حجت سے مراد توحید کے وہ دلائل ہیں جو قوم کے مقابلے میں ابراہیم علیہ السلام نے پیش کیے، یہ دلائل اللہ تعالیٰ نے قوم کے مقابلے میں ابراہیم علیہ السلام کو عطا فرمائے تھے۔ اس سے بھی اس بات کی تائید ہوتی ہے کہ یہ باتیں ان کے بچپن کے زمانے کی نہیں کہ آپ شرک سے درجہ بہ درجہ توحید کی طرف بڑھے ہوں، کیونکہ اللہ کا نبی اللہ تعالیٰ کی توحید سمجھنے میں کبھی غلطی نہیں کرتا۔ ¤ ➋ {نَرْفَعُ دَرَجٰتٍ مَّنْ نَّشَآءُ:} یعنی چونکہ ابراہیم علیہ السلام نے اپنی جان کی پروا نہیں کی اور اپنے آپ کو توحید کی دعوت دینے کے لیے وقف کر دیا، اس لیے ہم نے بھی ان پر بڑے بڑے احسانات فرمائے۔ دنیا ہی میں انھیں یہ انعام دیا کہ بڑھاپے میں انھیں نیک اولاد سے نوازا، ان کے بعد ان کی اولاد میں نبوت اور کتاب اتارنے کا سلسلہ جاری کر دیا اور اسی سلسلے کے آخری نبی محمد صلی اللہ علیہ وسلم ہیں۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84) ➊ {كُلًّا هَدَيْنَا:} یعنی ابراہیم علیہ السلام کی راہ پر لگایا اور نبوت عطا کی۔ دیکھیے سورۂ مریم (۴۹)۔ ¤ ➋ {وَ مِنْ ذُرِّيَّتِهٖ دَاوٗدَ وَ سُلَيْمٰنَ … : ’’ ذُرِّيَّتِهٖ ‘‘} میں موجود ضمیر سے مراد نوح علیہ السلام بھی ہو سکتے ہیں، اس لیے کہ مذکور نبیوں میں سب سے قریب نوح علیہ السلام ہی ہیں،امام ابن جریر رحمہ اللہ نے اسی کو اختیار کیا ہے۔ یہ ضمیر ابراہیم علیہ السلام کی طرف بھی لوٹ سکتی ہے اور کلام کے سیاق کے پیش نظر اس کو ترجیح دی جا سکتی ہے، مگر اس کے تحت مذکور انبیاء میں سے لوط علیہ السلام کے ذکر سے اشکال پیدا ہوتا ہے کہ وہ ابراہیم علیہ السلام کی اولاد میں سے نہیں تھے، بلکہ ان کے بھتیجے تھے، مگر ہو سکتا ہے کہ بھتیجے کو بھی اولاد میں شمار کر لیا ہو، جیسا کہ سورۂ بقرہ (۱۳۳) میں اسماعیل علیہ السلام کو یعقوب علیہ السلام کی اولاد کے آباء میں ذکر کیا ہے۔ (ابن کثیر) ¤ ➌ عیسیٰ علیہ السلام کو نوح علیہ السلام اور دوسرے قول کے مطابق ابراہیم علیہ السلام کی اولاد میں سے شمار کرنا اس بات کی دلیل ہے کہ بیٹیوں کی اولاد بھی آدمی کی اولاد میں سے شمار ہوتی ہے، کیونکہ عیسیٰ علیہ السلام کی نسبت صرف ماں کی طرف سے ہے، ان کا باپ نہیں تھا۔ (ابن کثیر)"
    },
    {
      "ayah": 85,
      "tafsir": ""
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86) {وَ كُلًّا فَضَّلْنَا عَلَى الْعٰلَمِيْنَ:} یعنی اپنے اپنے زمانے کے تمام لوگوں پر فضیلت بخشی۔"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) {وَ مِنْ اٰبَآىِٕهِمْ…:} یعنی ان کے باپ دادا اور پڑدادا اوپر تک اور ان کے بیٹوں، پوتوں، پرپوتوں نیچے تک اور ان کے بھائیوں میں سے جو بھی ایمان دار تھے انھیں بھی ہم نے ہدایت پر لگایا اور بزرگی دی۔ ( ابن کثیر)"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) {وَ لَوْ اَشْرَكُوْا لَحَبِطَ عَنْهُمْ … :} اٹھارہ پیغمبروں کا نام لے کر، ان کے ساتھ ان کے آباء، اولاد اور اخوان کا ذکر کر کے فرمایا کہ اگر بفرض محال نبی یا اس کے قرابت دار بھی شرک کر بیٹھتے تو ان کا کیا کرایا سب ضائع ہو جاتا۔ کیونکہ شرک کے ساتھ کوئی بڑے سے بڑا عمل بھی قبول نہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کو مخاطب کر کے فرمایا : «لَىِٕنْ اَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ» [ الزمر : ۶۵ ] ’’ اگر آپ نے شرک کیا تو آپ کا بھی تمام عمل ضائع ہو جائے گا۔‘‘ پیغمبر سے شرک ہونا تو ممکن نہیں، یہ سب کچھ امتیوں کو سنایا جا رہا ہے۔"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 89) {فَاِنْ يَّكْفُرْ بِهَا هٰۤؤُلَآءِ … :} یعنی اگر یہ لوگ اس کتاب، حکم اور نبوت کو نہ مانیں ( اس سے مراد رسول اللہ صلی اللہ علیہ وسلم کی نبوت کو نہ ماننے والے کفار اور مشرکین ہیں) تو ہم نے ان(کتاب اور نبوت) کے لیے ایسے لوگ مقرر کیے ہیں ( اس سے مراد مہاجرین، انصار اور قیامت تک آنے والے ایمان دار ہیں) جو ان نعمتوں کا انکار نہیں کرتے۔"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت 90) ➊ {فَبِهُدٰىهُمُ اقْتَدِهْ:} یعنی توحید اور عقائد میں ان کی راہ پر قائم رہیے، کیونکہ تتمام انبیاء ان باتوں میں متفق ہیں، باقی احکام میں سے بھی جو منسوخ نہیں ہوئے ان کی بھی پیروی کیجیے۔ یا مطلب یہ ہے کہ ان انبیاء کی طرح آپ بھی دشمنوں کی ایذا رسانی پر صبر کیجیے۔ اس آیت میں اس بات کی دلیل ہے کہ جن کاموں میں کوئی نیا حکم نہیں آیا ان میں نبی صلی اللہ علیہ وسلم کو پہلے انبیاء کے طریق پر رہنے کا حکم تھا۔ مجاہد رحمہ اللہ بیان کرتے ہیں کہ انھوں نے عبد اللہ بن عباس رضی اللہ عنہما سے پوچھا : ’’کیا سورۂ ص میں سجدہ ہے؟‘‘ تو انھوں نے «وَ وَهَبْنَا لَهٗۤ اِسْحٰقَ وَ يَعْقُوْبَ» سے لے کر «فَبِهُدٰىهُمُ اقْتَدِهْ» تک تلاوت کر کے فرمایا : ’’ہاں، وہ (داؤد علیہ السلام ) بھی ان لوگوں میں سے تھے جن کی پیروی کا آپ کو اس آیت میں حکم دیا گیا ہے اور اس آیت میں داؤد علیہ السلام کے سجدے کا ذکر ہے اور آپ صلی اللہ علیہ وسلم کو ان انبیاء کی پیروی کا حکم ہے۔‘‘ [بخاری، التفسیر، باب قولہ: «أولئك الذين هدي الله … » : ۴۶۳۲ ] ¤ ➋ {اِنْ هُوَ اِلَّا ذِكْرٰى لِلْعٰلَمِيْنَ:} اس سے معلوم ہوا کہ نبی صلی اللہ علیہ وسلم جن و انس دونوں کی طرف بھیجے گئے اور آپ کی رسالت قیامت تک کے لیے ہے۔"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت 91) {وَ مَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖۤ … :} یہ خطاب یہود کو ہے، جنھوں نے رسول اللہ صلی اللہ علیہ وسلم سے دشمنی اور بغض و عناد کی بنا پر ایسی حقیقت کا انکار کر دیا جسے وہ خود بھی مانتے تھے۔ وہ کہتے تھے کہ اللہ تعالیٰ نے کسی بشر پر کوئی کتاب نازل نہیں فرمائی۔ اس آیت میں ان کے اعتراض کا دو طرح سے جواب دیا گیا، ایک یہ کہ انھوں نے اللہ تعالیٰ کی قدر اور اسے پہچاننے کا جو حق تھا اس کے مطابق انھوں نے اسے پہچانا ہی نہیں، کیونکہ اللہ تعالیٰ نہ خود لوگوں سے کلام کرتا ہے اور نہ اس کام کے لیے کوئی فرشتہ بھیجتا ہے۔ اس کی ممکن صورت یہی ہے کہ اللہ تعالیٰ اپنا کلام فرشتوں کے ذریعے سے صرف نبی پر نازل فرمائے۔ دوسرا جواب یہ ہے کہ یہ تو تم بھی مانتے ہو کہ موسیٰ علیہ السلام بشر تھے، آدم علیہ السلام کی اولاد سے تھے، ان کے ماں باپ بھی تھے، تو ان پر جو کتاب اتاری گئی تھی وہ کس نے اتاری تھی ؟ اگر یہ کتاب اللہ تعالیٰ نے نہیں اتاری تھی تو پھر تم اسے اتنا سنبھال سنبھال کر کیوں رکھتے ہو؟ اور اس کتاب میں جو ہدایت کی باتیں اور علم کی روشنی ہے کیا اللہ تعالیٰ کے علاوہ کوئی اور ایسی باتیں بتا سکتا ہے ؟ جو ہدایت کی باتیں اس کتاب میں موجود ہیں انھیں نہ تم جانتے تھے اور نہ تمھارے آباء و اجداد، پھر تمھارا اس کتاب کا کچھ حصہ لوگوں کو بتانا اور اپنی خواہشات کے مطابق کچھ حصہ چھپانا، یہ سب کچھ اس بات پر دلالت کرتا ہے کہ یہ کتاب اللہ کی طرف سے نازل ہوئی ہے اور تمھارے لیے حجت ہے، ورنہ اگر یہ کسی انسان کی تصنیف ہوتی تو تمھیں ایسا کرنے کی ضرورت ہی نہ تھی۔ اس کے بعد اللہ تعالیٰ نے فرمایا کہ آپ کہہ دیجیے کہ موسیٰ علیہ السلام پر تورات اللہ تعالیٰ نے نازل فرمائی ہے اور محمد صلی اللہ علیہ وسلم کو وہ علوم اور معارف اللہ تعالیٰ کی طرف سے بذریعہ وحی ملے ہیں۔ جب یہ بات ثابت ہو گئی تو پھر رسولوں پر بالعموم اور نبی کریم صلی اللہ علیہ وسلم پر بالخصوص وحی کے نازل ہونے کا انکار تم کیسے کر سکتے ہو ؟ یہ سارا خطاب کفارِ مکہ کو بھی ہو سکتا ہے، کیونکہ موسیٰ علیہ السلام کے نبی ہونے کو وہ بھی مانتے تھے۔ {’’ قَرَاطِيْسَ ‘‘} یہ {’’ قِرْطَاسٌ‘‘} کی جمع ہے، یعنی ورق، کاغذ، یعنی یہودی تورات کو ایک کتاب کی طرح جمع کرنے کے بجائے الگ الگ ورقوں کی صورت میں رکھتے تھے اور اپنے مطلب کا ورق نکال کر دکھا دیتے تھے۔"
    },
    {
      "ayah": 92,
      "tafsir": "آیت 92: (1) {وَ لِتُنْذِرَ اُمَّ الْقُرٰى وَ مَنْ حَوْلَهَا:} اس آیت میں مکہ کو ’’ام القریٰ‘‘ کہا گیا ہے، جس کا معنی ہے تمام بستیوں کی جڑ یا ان کا مرکز اور {’’ وَ مَنْ حَوْلَهَا ‘‘} سے مراد قبائل عرب اور آدم علیہ السلام کی اولاد ہیں، خواہ عرب ہوں یا عجم۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ بُعِثْتُ إِلَي النَّاسِ كَافَّةً ] [بخاری، الصلاۃ، باب قول النبی صلی اللہ علیہ وسلم : [جعلت لي الأرض… ] : ۴۳۸ ] ’’مجھے تمام لوگوں کی طرف بھیجا گیا ہے۔‘‘ نیز دیکھیے سورۂ انعام (۹)، سورۂ اعراف (۱۵۸) اور سورۂ سبا( ۲۸)۔ ¤ ➋ {وَ الَّذِيْنَ يُؤْمِنُوْنَ بِالْاٰخِرَةِ: } کیونکہ قرآن مجید آخرت کی راہ بتلاتا ہے۔ ¤ ➌ { وَ هُمْ عَلٰى صَلَاتِهِمْ يُحَافِظُوْنَ:} کیونکہ نماز تمام عبادتوں کی اصل اور آخرت میں کامیابی کی کنجی ہے۔ اس آیت مبارکہ سے ثابت ہوا کہ اس شخص کا ایمان آخرت پر صحیح اور درست ہے جو قرآن مجید پر ایمان رکھتا ہے اور نماز کی نگہداشت اور نگرانی کرتا ہے، جو شخص قرآن پر ایمان نہیں رکھتا یا نماز کی حفاظت نہیں کرتا اس کا آخرت پر ایمان رکھنے کا دعویٰ بلا دلیل ہے۔"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت 93) ➊ {وَ مَنْ اَظْلَمُ مِمَّنِ افْتَرٰى … :} اس آیت کریمہ میں تین قسم کے لوگوں کا ذکر کر کے یہ بتایا گیا ہے کہ ان سے زیادہ اپنے حق میں کون ظالم ہو سکتا ہے، ایک تو وہ لوگ جو اللہ پر جھوٹ باندھتے ہوئے غیروں کو اللہ کا شریک بناتے ہیں، یا جو اپنی طرف سے حلال و حرام کے احکام وضع کرتے ہیں، دوسرے وہ لوگ جو نبوت کا جھوٹا دعویٰ کرتے ہیں اور کہتے ہیں کہ ہم پر اللہ کی جانب سے وحی کی جاتی ہے، جیسے اسود عنسی، مسیلمہ کذاب اور قادیانی دجال وغیرہ اور تیسرے وہ لوگ جو دعویٰ کرتے ہیں کہ وہ قرآن جیسا کلام پیش کر سکتے ہیں، جیسا کہ قرآن میں ہے کہ کچھ مشرکوں نے کہا تھا : «لَوْ نَشَآءُ لَقُلْنَا مِثْلَ هٰذَاۤ » [الأنفال :۳۱ ] اگر ہم چاہیں تو یقینا اس جیسا ہم بھی کہہ دیں، حالانکہ یہ ممکن نہیں۔ تین ہی وعیدیں ان کے حق میں بیان کی گئی ہیں، ایک سب سے بڑے ظالم ہونا، دوسری فرشتوں کا ان کی روح قبض کرتے وقت سختی کرنا اور تیسری ذلت کا عذاب۔ ¤ ➋ {اَخْرِجُوْۤا اَنْفُسَكُمْ:} نکالو اپنی جانیں اور انھیں ہمارے حوالے کرو کہ سزا دیں، یا انھیں موت کی سختیوں اور عذاب سے بچا کر تو دکھاؤ۔ (فتح القدیر) ¤ ➌ {اَلْيَوْمَ تُجْزَوْنَ …:} آج سے مراد وہ دن ہے جس میں ان کی روح قبض کی جائے گی اور عذاب قبر کی ابتدا ہو گی۔ اس آیت میں واضح عذاب قبر کی طرف اشارہ ہے، کیونکہ قیامت تو جب اللہ چاہے گا قائم ہو گی، درمیان کا وقفہ یعنی برزخ ہم سے پردے میں ہے۔ انسان کا کوئی جز کسی بھی جگہ میں ہو یا راکھ بن جائے، اسے وہیں عذاب قبر ہو گا۔"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت 94) {وَ لَقَدْ جِئْتُمُوْنَا فُرَادٰى … : } یعنی ان سے کہا جائے گا کہ آج تم ہمارے پاس اکییلے اکیلے ہو کر آئے ہو اور جو مال و اولاد تمھارے پاس تھا وہیں چھوڑ آئے ہو اور ہم تمھارے ساتھ وہ سفارشی بھی نہیں دیکھتے جن کے متعلق تم کہتے تھے کہ جس طرح اللہ تعالیٰ اس بات کا حق دار ہے کہ ہم اس کی عبادت کریں یہ بھی حق رکھتے ہیں۔ لاؤ دکھاؤ، یہ ڈانٹنے کے لیے کہا جائے گا۔"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت 95) ➊ {اِنَّ اللّٰهَ فَالِقُ الْحَبِّ وَ النَّوٰى … :} اللہ تعالیٰ کی توحید اور اس سے تعلق رکھنے والی کچھ چیزیں بیان کرنے کے بعد دوبارہ اللہ تعالیٰ کے وجود، اس کی توحید اور کمال قدرت و علم کا بیان شروع کیا جو اس سورت کا اصل موضوع ہے۔ ¤ ➋ {’’ النَّوٰى ‘‘} یہ {’’ نَوَاةٌ ‘‘} کی جمع ہے، اس لیے ترجمہ ’’گٹھلیاں‘‘ کیا ہے۔ یعنی اللہ تعالیٰ زمین کے اندر دانے کو پھاڑ کر لہلہاتا ہوا پودا اور گٹھلی کو پھاڑ کر کھجور کا ہرا بھرا درخت نکالتا ہے۔ اس کی کاری گری دیکھیے کہ مردہ کو زندہ سے نکالتا ہے، نطفے اور انڈے سے جان دار، دانے اورگٹھلی سے زندہ درخت اور کافر سے مسلمان کو پیدا کرتا ہے اور زندہ سے مردہ کو نکالتا ہے، جیسے حیوان اور پرندے سے نطفہ اور انڈا، پودوں اور درختوں سے دانے اور گٹھلیاں اور مسلمان سے کافر پیدا کرتا ہے۔ یہ ہے اللہ جو تمھاری عبادت کا حق دار ہے، پھر کیسی عجیب بات ہے کہ تم شیطان کے بہکاوے میں آکر اس کے غیر کی عبادت کرنے لگتے ہو۔"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت 96) {فَالِقُ الْاِصْبَاحِ …:} وہی رات کی تاریکی کو پھاڑ کر صبح روشن نکالنے والا ہے، پھر اس نے رات کا اندھیرا طاری کر کے سب کو سکون اور آرام کا موقع فراہم کیا اور سورج اور چاند کو حساب کا ذریعہ بنایا، جس سے وقت، دن، رات، مہینوں اور سالوں کا حساب وجود میں آتا ہے۔ {’’ الْعَزِيْزِ ‘‘} سے مراد کمال قدرت والا اور {’’ الْعَلِيْمِ ‘‘} سے مراد کمال علم والا ہے۔ جس کا علم اور قدرت آسمان و زمین کے ذرّے ذرّے کو محیط ہے۔ عموماً قرآن میں رات دن اور سورج چاند کے پیدا کرنے اور مسخر کرنے کو اسمائے حسنیٰ میں سے ان دو صفاتی ناموں کے ساتھ ختم کیا ہے۔"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت 97) {وَ هُوَ الَّذِيْ جَعَلَ لَكُمُ النُّجُوْمَ …:} یہ ستاروں کا ایک فائدہ ہے، دوسری آیات میں تاروں کو آسمان کی زینت اور شیطانوں کے لیے سنگ باری ( رجوم) کا سامان فرمایا ہے۔ دیکھیے سورۂ صافات (7،6) اور سورۂ ملک (۵) اللہ ہی بہتر جانتا ہے کہ ان میں اور کتنے فوائد ہیں، مگر ان کے ذریعے سے غیب معلوم ہونے یا ان کا قدرت کے کارخانے میں کوئی اختیار ہونے کا عقیدہ صاف گمراہی اور شرک ہے، جیسا کہ قرآن مجید میں بار بار علم اور قدرت کا مالک صرف ایک اللہ کو قرار دیا گیا ہے۔"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت 98) ➊ {وَ هُوَ الَّذِيْۤ اَنْشَاَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ … :} یعنی اسی نے تمھیں ایک جان آدم علیہ السلام سے پیدا کیا، پھر اس کے لیے ٹھہرنے کی جگہ بنائی اور سونپے جانے کی جگہ بنائی۔ ٹھہرنے کی جگہ ماں کا رحم اور سونپے جانے کی جگہ باپ کی پشت۔ مفسرین کی ایک جماعت سے اس کے برعکس بھی منقول ہے، یعنی {’’ فَمُسْتَقَرٌّ ‘‘} باپ کی پشت اور {’’مُسْتَوْدَعٌ ‘‘} ماں کا رحم۔ بعض نے ان سے دنیا اور آخرت یا قبر مراد لی ہے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں کہ اول ماں کے پیٹ میں سپرد ہوتا ہے، تاکہ آہستہ آہستہ دنیا میں رہنے کی صلاحیت حاصل کر لے، پھر دنیا میں آکر ٹھہرتا ہے، پھر سپرد ہو گا قبر میں تاکہ آہستہ آہستہ آخرت کا اثر قبول کر سکے، پھر جا ٹھہرے گا جنت یا دوزخ میں ۔ (موضح) ¤ ➋ {لِقَوْمٍ يَّفْقَهُوْنَ:} پہلے آفاقی دلائل بیان فرمائے، جو انسان کی ذات سے باہر کی دنیا ہے، دوسری آیت میں انفسی دلائل کی طرف اشارہ ہے، جو انسان کی ذات میں موجود ہیں۔ دلائل آفاقی سے دلائل انفسی کا سمجھنا ذرا زیادہ غور کا محتاج ہے، اس لیے یہاں سمجھ کا لفظ فرمایا اور پہلے کے متعلق علم کا۔ (واللہ اعلم)"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت 99) ➊ {وَ هُوَ الَّذِيْۤ اَنْزَلَ مِنَ السَّمَآءِ مَآءً … : ’’ قِنْوَانٌ ‘‘} یہ {’’ قِنْوٌ ‘‘} کی جمع ہے بمعنی خوشے۔ {’’ دَانِيَةٌ ‘‘} یہ {’’دَنَا يَدْنُوْ ‘‘} سے اسم فاعل ہے، یعنی قریب، مراد نیچے جھکے ہوئے۔ {’’ مُشْتَبِهًا وَّ غَيْرَ مُتَشَابِهٍ ‘‘} یعنی پتے ملتے ہیں، مگر پھل مختلف ہیں، یا ایک ہی درخت، مثلاً آم کو لے لیں کہ ان کے پودے ملتے جلتے ہیں، مگر ہر پودے کے پھل کی لذت الگ ہے۔ ¤ ➋ یہاں اللہ تعالیٰ نے اپنی قدرتوں میں سے ایک عظیم قدرت اور نعمت کا ذکر فرمایا ہے، اللہ تعالیٰ نے آسمان سے پانی اتارا، پھر اس کے ذریعے سے نرم و نازک انگوری نکالی، جس سے تہ بہ تہ دانوں سے بھرے ہوئے خوشے نکالے اور کھجور کو دیکھو کہ پہلے ایک سُوا سا نکلا، پھر وہ درخت بن گیا، پھر اس سے کچا پھل بنایا، پھر اس کا رنگ بدلتا جاتا ہے اور وہ بڑا بھی ہو جاتا ہے۔ ان کے پھل دینے کو اور ان کے پکنے کو دیکھو، جب کچا ہوتا ہے تو اس کی کچھ حیثیت نہیں اور پک کر کس قدر لذیذ ہو جاتا ہے۔ یہی حال انگور، زیتون اور انار کا ہے۔"
    },
    {
      "ayah": 100,
      "tafsir": "(آیت 100) {وَ جَعَلُوْا لِلّٰهِ شُرَكَآءَ الْجِنَّ …:} اوپر کی آیات میں اللہ تعالیٰ نے اپنے معبود برحق ہونے کے لیے آسمان و زمین اور ان کے درمیان والی چیزوں میں سے پانچ دلائل بیان فرمائے، اب بتایا کہ بعض لوگ پھر بھی اللہ کے لیے جنوں کو شریک بناتے ہیں، حالانکہ انھیں بھی اللہ ہی نے پیدا کیا ہے، پھر مخلوق کو خالق کا شریک ٹھہرانا سرا سر جہالت نہیں تو کیا ہے ؟ (رازی) ¤ عرب میں بعض فرقے ایسے بھی تھے جو جنات اور خبیث شیطانوں کی عبادت کرتے تھے اور مصیبت کے وقت ان کے نام کی دہائی دیتے اور کائنات میں ان کا تصرف مانتے تھے۔ ان سب کی اس آیت میں تردید فرمائی کہ بے سمجھے انھوں نے جنوں کو اللہ کا شریک ٹھہرا لیا اور اس کے لیے بیٹے اور بیٹیاں گھڑ لیں۔ چنانچہ عرب کے مشرکین فرشتوں کو اللہ تعالیٰ کی بیٹیاں کہا کرتے تھے۔ فرمایا، اللہ تعالیٰ ان گھڑی ہوئی باتوں سے پاک ہے۔ بعض سلف نے فرمایا کہ یہ آیت ان زندیقوں اور مجوسیوں کے بارے میں نازل ہوئی جو اللہ تعالیٰ کو انسانوں، جانوروں اور ہر اچھی چیز کا خالق سمجھتے اور اسے ’’یزداں‘‘ کہتے تھے اور شیطان ( ابلیس) کو درندوں، سانپوں اور ہر قسم کے شر کا خالق سمجھتے تھے اور اسے ’’اہرمن‘‘ کہتے تھے اور ان دونوں کو کائنات کے پیدا کرنے میں اللہ کا شریک بناتے تھے، حالانکہ ان کا اور ہر چیز کا خالق اللہ تعالیٰ ہی ہے۔ اس لیے اہل علم نے مجوس کو زنادقہ (بالکل بے دین) قرار دیا ہے۔ امام رازی لکھتے ہیں کہ زیر تفسیر آیت کی مذکورہ توجیہات میں سے یہ بہترین توجیہ ہے۔"
    },
    {
      "ayah": 101,
      "tafsir": "(آیت 101 )➊ {بَدِيْعُ السَّمٰوٰتِ وَ الْاَرْضِ:} بدیع کا معنی ہے کسی چیز کو بغیر نمونے کے پیدا کرنے والا، یعنی ان کا پہلے کوئی نمونہ موجود نہ تھا، اس نے ان کو ایجاد فرمایا۔ ¤ ➋ {اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ … :} مشرکین کی تردید کے بعد اب ان کی تردید کی ہے جو اللہ کی اولاد مانتے تھے۔ فرمایا، اللہ کی اولاد کیسے ہو سکتی ہے، جب کہ اولاد تو وہ ہوتی ہے جو بیوی کے ذریعے سے پیدا ہو اور اگر کسی کو بیوی کے بغیر بنایا جائے تو وہ مخلوق ہوتی ہے نہ کہ اولاد، جیسا کہ آسمان و زمین کی پیدائش یا آدم علیہ السلام کی پیدائش۔ (رازی)"
    },
    {
      "ayah": 102,
      "tafsir": "(آیت 102) {ذٰلِكُمُ اللّٰهُ رَبُّكُمْ … :} یعنی صرف اللہ وحدہ لا شریک لہ کی عبادت کرو اور اس کی وحدانیت کا اقرار کرتے ہوئے یقین رکھو کہ ایک اللہ کے سوا کوئی معبود نہیں، وہی ہر چیز کا خالق، حفیظ اور رقیب ہے۔ (ترجمان)"
    },
    {
      "ayah": 103,
      "tafsir": "(آیت 103) {لَا تُدْرِكُهُ الْاَبْصَارُ … : ’’ اَدْرَكَ يُدْرِكُ ‘‘} کا معنی کسی چیز کو پالینا ہے، اس لیے اس کا معنی دیکھنا بھی ہو سکتا ہے اور کسی چیز کی حقیقت کو پا لینا بھی۔ ادراک کا معنی اگر آنکھوں سے دیکھنا ہو تو اس کے متعلق ام المومنین عائشہ رضی اللہ عنھا فرماتی ہیں : ’’جو تمھیں بیان کرے کہ محمد( صلی اللہ علیہ وسلم ) نے اپنے رب کو دیکھا تو اس نے یقینا جھوٹ کہا۔‘‘ پھر انھوں نے یہ آیت پڑھی : «لَا تُدْرِكُهُ الْاَبْصَارُ وَ هُوَ يُدْرِكُ ا الْاَبْصَارَ …» پھر فرمایا : ’’لیکن آپ نے جبریل علیہ السلام کو ان کی اصلی صورت میں دو دفعہ دیکھا ہے۔‘‘ [ بخاری، التفسیر، سورۃ والنجم : ۴۸۵۵ ] عبد اللہ بن مسعود رضی اللہ عنہ نے بھی فرمایا ( سورۂ نجم میں مذکور آیات) «فَكَانَ قَابَ قَوْسَيْنِ اَوْ اَدْنٰى (9) فَاَوْحٰۤى اِلٰى عَبْدِهٖ مَاۤ اَوْحٰى » سے مراد یہ ہے کہ آپ صلی اللہ علیہ وسلم نے جبریل علیہ السلام کو دیکھا کہ ان کے چھ سو پر تھے۔ [ بخاری، التفسیر، باب : {فکان قاب قوسین أو أدنی} : ۴۸۵۶ ] ¤ صحابہ کرام رضی اللہ عنہم میں سے کسی سے بھی ثابت نہیں کہ آپ صلی اللہ علیہ وسلم نے دنیا میں رب تعالیٰ کو دیکھا ہے۔ یہی صحیح معلوم ہوتا ہے، صرف ابن عباس رضی اللہ عنہما دیکھنے کے قائل ہیں، مگر وہ کبھی ساتھ یہ بھی فرماتے تھے کہ آپ صلی اللہ علیہ وسلم نے اپنے دل کی آنکھ سے دو مرتبہ اللہ تعالیٰ کو دیکھا ہے۔ مزید تفصیل سورۂ نجم میں آئے گی۔ یہ تمام بحث دنیا میں نہ دیکھ سکنے کی ہے، مگر قرآن مجید کی متعدد آیات اور صحیح احادیث سے ثابت ہے کہ قیامت کے دن انبیاء کے علاوہ مومنوں کو بھی اللہ تعالیٰ کا دیدار ہو گا اور وہ بغیر کسی تکلیف کے اپنی اپنی جگہ اللہ تعالیٰ کو دیکھیں گے، جیسے چاند کے دیکھنے میں کسی کو کوئی تکلیف نہیں ہوتی اور جنت کی سب سے بڑی نعمت یہی ہو گی۔ چنانچہ اللہ تعالیٰ نے فرمایا : «وُجُوْهٌ يَّوْمَىِٕذٍ نَّاضِرَةٌ(22) اِلٰى رَبِّهَا نَاظِرَةٌ» [ القیامۃ : 23،22] ’’کئی چہرے اس دن تروتازہ ہوں گے۔ اپنے رب کی طرف دیکھ رہے ہوں گے۔‘‘ لیکن ادراک کا معنی اگر حقیقت کو پالینا ہو تو یہ تو قیامت کے دن بھی نہ کسی فرشتے کے لیے ممکن ہے نہ رسول کے لیے، کیونکہ محدود مخلوق لا محدود کی حقیقت کو کیسے پا سکتی ہے۔ پھر زیر تفسیر آیت کے مطابق دنیا اور آخرت کسی جگہ بھی آنکھیں اللہ تعالیٰ کی حقیقت کو نہیں پاسکتیں۔"
    },
    {
      "ayah": 104,
      "tafsir": "(آیت 104){ قَدْ جَآءَكُمْ بَصَآىِٕرُ مِنْ رَّبِّكُمْ … : ’’ بَصَآىِٕرُ ‘‘} یہ{ ’’ بَصِيْرَةٌ ‘‘ } کی جمع ہے، جو دل کی روشنی کا نام ہے، جیسا کہ بصارت آنکھوں سے دیکھنے کو کہتے ہیں، یعنی مالک کی طرف سے تمھارے پاس دل اور آنکھوں کو روشن کرنے والے دلائل تو پہنچ چکے، جو اوپر کی آیات میں مذکور ہیں، اب ان پر غور و فکر کر کے جو ایمان لے آئے تو اس کا اپنا ہی فائدہ ہے اور جو ان پر غور نہ کرے اور ایمان نہ لائے تو اپنا ہی برا کرے گا۔ میں تم پر کوئی محافظ نہیں کہ تمھارے چاہنے یا نہ چاہنے کے باوجود تمھیں سیدھی راہ پر ڈال سکوں، ہدایت دینا یا نہ دینا تو اللہ ہی کا کام ہے۔"
    },
    {
      "ayah": 105,
      "tafsir": "(آیت 105) ➊ {وَ كَذٰلِكَ نُصَرِّفُ الْاٰيٰتِ:} یہاں تک اللہ تعالیٰ کے معبود برحق ہونے کا اثبات تھا، اب نبوت کو ثابت کرنے کا بیان شروع ہوتا ہے۔ اس آیت میں فرمایا کہ ہم ایسے ہی مختلف طریقوں کے ساتھ بار بار دھراتے ہیں، کبھی مومنوں کو خوش خبری، کبھی کافروں کو تنبیہ، کبھی گزشتہ قوموں کے واقعات کے ذریعے سے نصیحت اور کبھی کوئی کام کرنے یا نہ کرنے کے احکام، تاکہ جو لوگ عقل و فہم رکھتے ہیں، وہ ان کے ذریعے سے راہ ہدایت پائیں اور مخالفین پر حجت ہو۔ ¤ ➋ {وَ لِيَقُوْلُوْا دَرَسْتَ:} یعنی ہم آیات کو پھیر پھیر کر اس لیے بیان فرماتے ہیں کہ اگر ایک طرف ان آیات کے ذریعے سے عقل و فہم والے راہِ ہدایت پائیں گے تو دوسری طرف ضدی اور آباء و اجداد کے رسم و رواج سے چمٹے رہنے والے کافر و مشرک آپ سے یہ کہہ کر گمراہ ہوں گے کہ یہ قرآن جسے تم ہمارے سامنے پڑھ رہے ہو، تم پر اللہ تعالیٰ کی طرف سے نازل نہیں ہوا، بلکہ تم نے کسی سے پڑھا اور سیکھا ہے۔ مشرکین کے اسی قسم کے اقوال کئی دوسری آیات میں مذکور ہیں، مثلاً سورۂ فرقان (۴، ۵) اور سورۂ مدثر (۱۸ تا ۲۵) ( رازی، قرطبی) {’’ وَ لِيَقُوْلُوْا دَرَسْتَ ‘‘} کی واؤ سے دیگر حکمتوں کی طرف اشارہ ہے جنھیں قصداً حذف کر دیا گیا ہے، کیونکہ ان سب کا بیان بہت طویل تھا۔ واؤ کے بعد ایک حکمت بیان فرما دی گئی۔ ¤ ➌ {وَ لِنُبَيِّنَهٗ لِقَوْمٍ يَّعْلَمُوْنَ:} آیات کو پھیر پھیر کر بیان کرنے کی پہلی حکمت یہ بیان فرمائی کہ کفار اور عناد رکھنے والے یہ کہیں کہ تم نے یہ قرآن کسی سے پڑھ لکھ کر سیکھ لیا ہے، تاکہ اس طرح زیادہ گمراہ ہوں، یہاں دوسری حکمت بیان کی ہے ’’تاکہ اہل علم کے لیے بیان اور فہم حاصل ہو۔‘‘ (رازی)"
    },
    {
      "ayah": 106,
      "tafsir": "(آیت 106) {اِتَّبِعْ مَاۤ اُوْحِيَ اِلَيْكَ … :} یعنی ان کے اس قسم کے بے بنیاد شبہات سے متاثر ہو کر دعوت و تبلیغ ترک نہ کرو۔ اس سے مقصود آپ صلی اللہ علیہ وسلم کو تسلی دینا ہے۔"
    },
    {
      "ayah": 107,
      "tafsir": "(آیت 107) {وَ لَوْ شَآءَ اللّٰهُ مَاۤ اَشْرَكُوْا …:} یعنی آپ ان کی حماقتوں اور کفر سے متاثر نہ ہوں، کیونکہ اللہ تعالیٰ نے انسانوں کے اندر ایمان و کفر دونوں کی استعداد رکھی ہے اور اس سے ان کا امتحان مقصود ہے کہ شکر گزار بنتے ہیں یا کفر اختیار کرتے ہیں۔ اگر اللہ تعالیٰ چاہتا تو ان کو فرشتوں کی طرح بھی بنا سکتا تھا کہ وہ فطری طور پر مومن ہونے کے ساتھ کفر یا نافرمانی کر ہی نہیں سکتے، بلکہ ہر طرح فرماں بردار ہیں، لیکن یہ اس کی حکمت کے خلاف ہے۔"
    },
    {
      "ayah": 108,
      "tafsir": "(آیت 108) ➊ {وَ لَا تَسُبُّوا الَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ …:} یہ آیت سد ذرائع کی دلیل ہے، یعنی اگر ایک جائز کام کسی بڑی خرابی کا ذریعہ بنتا ہو تو اس جائز کام کو بھی چھوڑنا ضروری ہے۔ یعنی اگر تم مشرکین کے معبودوں کو گالی دو گے تو وہ جہالت سے اللہ تعالیٰ کو گالی دیں گے اور تم اس کا سبب بنو گے۔ جبکہ رسول اللہ صلی اللہ علیہ وسلم نے کسی کے ماں باپ کو گالی دینے سے منع فرمایا کہ اس طرح تم خود اپنے والدین کو گالی دینے کا سبب بن جاؤ گے۔ [ بخاری، الأدب، باب لا یسب الرجل والدیہ : ۵۹۷۳ ] ¤ ➋ {كَذٰلِكَ زَيَّنَّا لِكُلِّ اُمَّةٍ … :} یعنی انسان کی  عادت ہی یہ ہے کہ وہ اپنے ہر کام کو، چاہے وہ در حقیقت اچھا ہو یا برا، اچھا ہی سمجھتا ہے، یعنی : «كُلُّ حِزْبٍۭ بِمَا لَدَيْهِمْ فَرِحُوْنَ» [ المؤمنون : ۵۳ ] ’’ہر گروہ کے لوگ اسی پر خوش ہیں جو ان کے پاس ہے۔‘‘ لیکن انسان میں غور و فکر کی صلاحیت بھی رکھی ہے کہ وہ برے کام کو پوری آزادی سے چھوڑ کر نیک راستہ اختیار کر سکتا ہے، دنیا کا ہر کام اللہ کے چاہنے سے ہوتا ہے، وہ نہ چاہے تو نہیں ہوتا۔ انسانوں کو امتحان کے لیے اچھے برے دونوں کاموںکا اختیار دینا بھی اس کی مرضی اور حکمت سے ہے، مگر وہ اپنے بندوں کے لیے کفر اور برے کاموں کو پسند نہیں کرتا۔ دیکھیے سورۂ زمر (۷)۔"
    },
    {
      "ayah": 109,
      "tafsir": "(آیت 109) {لَىِٕنْ جَآءَتْهُمْ اٰيَةٌ …:} مثلاً صفا پہاڑی کو سونے کا بنا دیا جائے یا ان مطالبوں کو پورا کیا جائے جو ان کی طرف سے اللہ تعالیٰ نے سورۂ بنی اسرائیل(۹۰ تا ۹۳) میں ذکر فرمائے ہیں۔ فرمایا ان سے کہہ دو کہ نشانیاں تو اللہ تعالیٰ ہی کے پاس ہیں، میرے اختیار میں نہیں اور تمھیں کیا خبر کہ نیا معجزہ یا نشانی آ بھی جائے تو یہ ایمان نہیں لائیں گے۔"
    },
    {
      "ayah": 110,
      "tafsir": "(آیت 110) {وَ نُقَلِّبُ اَفْـِٕدَتَهُمْ وَ اَبْصَارَهُمْ …:} یعنی اس سے پہلے معجزے دیکھ کر جب یہ ایمان نہیں لائے تو اب کیسے لائیں گے؟ جو شخص حق واضح ہونے کے بعد ہٹ دھرمی سے ایک دفعہ انکار کر دیتا ہے، پھر وہ مسلسل انکار ہی کرتا رہتا ہے۔ اس کے اس بد عمل کی وجہ سے آئندہ اس سے ایمان لانے کی توفیق چھین لی جاتی ہے۔ دیکھیے سورۂ یونس (۷۴) اور سورۂ انفال (۲۴) شاہ عبد القادر رحمہ اللہ لکھتے ہیں، یعنی جن کو اللہ ہدایت دیتا ہے وہ پہلی دفعہ ہی حق کی بات سن کر انصاف سے قبول کر لیتے ہیں اور جس شخص نے پہلے ہی ضد سے ٹھان رکھی ہے کہ مانے گا ہی نہیں، وہ معجزہ دیکھ کر بھی کوئی حیلہ بنا لیتا ہے، مثلاً فرعون نے کتنے ہی معجزے دیکھے پر وہ ایمان نہ لایا۔ (موضح)"
    },
    {
      "ayah": 111,
      "tafsir": "(آیت 111) ➊ {وَ لَوْ اَنَّنَا نَزَّلْنَاۤ اِلَيْهِمُ الْمَلٰٓىِٕكَةَ ……:} پچھلی آیت : «وَ مَا يُشْعِرُكُمْ اَنَّهَاۤ اِذَا جَآءَتْ لَا يُؤْمِنُوْنَ» مییں جو بات مختصر بیان کی گئی تھی یہاں اسی کی تفصیل ہے، یعنی اگر ہم ان کے تمام مطالبات پورے کر دیں، جیسے فرشتوں کو نازل کرنا اور مُردوں کا کلام کرنا وغیرہ، بلکہ اس سے بھی بڑھ کر ہم ہر چیز گروہ در گروہ یا آمنے سامنے لا کھڑی کر دیں تو پھر بھی یہ ایمان نہیں لائیں گے۔ ہر چیز سے مراد ان کے مطالبات میں سے ہر چیز ہے، کیونکہ {’’كُلَّ‘‘} کے لفظ سے موقع کے مناسب ہر چیز مراد ہوتی ہے، جیسا کہ ہدہد نے ملکۂ سبا سے متعلق کہا : «وَ اُوْتِيَتْ مِنْ كُلِّ شَيْءٍ » [النمل : ۲۳ ] ’’اور اسے ہر چیز دی گئی ہے۔‘‘ ظاہر ہے کہ ہر چیز تو اسے نہیں دی گئی تھی، حکومت و سلطنت سے متعلقہ اشیاء ہی عنایت کی گئی تھیں۔ ¤ ➋{ اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ :} مگر اﷲ چاہے تو ضدی سے ضدی منکر کو بھی ایمان سے نواز سکتا ہے، جیسا کہ بعد میں عرب کے بے شمار عناد رکھنے والے کافر بھی مکہ فتح ہونے پر مسلمان ہو گئے۔ یہ مسلمانوں کے لیے بشارت کے الفاظ ہیں۔ ¤ ➌ { وَ لٰكِنَّ اَكْثَرَهُمْ يَجْهَلُوْنَ:} یہاں وہ جہل مراد نہیں جو علم کے مقابلے میں ہوتا ہے، بلکہ وہ جہل ہے جو حلم کے مقابلے میں ہوتا ہے، یعنی اکھڑ پن یعنی بعض حلم والے بھی ان میں موجود ہیں۔"
    },
    {
      "ayah": 112,
      "tafsir": "(آیت 112) ➊ {وَ كَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا ……: } یعنی جس طرح جن و انس کے شیطان آپ سے دشمنی کر رہے ہیں، یہ صرف آپ کا حال نہیں، بلکہ اسی طرح ہم نے آپ سے پہلے تمام انبیاء کے لیے بھی جن و انس شیطان دشمن بنائے تھے، لہٰذا آپ کو گھبرانے کی ضرورت نہیں، بلکہ جس طرح پہلے انبیاء نے اپنے شریر دشمنوں کے مقابلے میں صبر و استقامت سے کام لیا، آپ بھی ان کی ایذا رسانی پر صبر کیجیے، مایوسی اور گھبراہٹ کو اپنے اندر راہ نہ دیجیے۔ ¤ ➋ {يُوْحِيْ بَعْضُهُمْ اِلٰى بَعْضٍ …… :} وحی کا معنی خفیہ طریقے سے اطلاع دینا ہے، یعنی وہ انسان اور جن جو شیطان ہیں، وہ اپنوں میں سے سیدھے سادے لوگوں کو دھوکا دینے کے لیے چوری چھپے طرح طرح کے مزین اور ملمع کیے ہوئے حیلے اور مکر سکھاتے ہیں۔ {’’ غُرُوْرًا ‘‘} مفعول لہ ہے، یعنی دھوکا دینے کے لیے۔ ¤ ➌ {وَ لَوْ شَآءَ رَبُّكَ مَا فَعَلُوْهُ:} مگر وہ چونکہ حجت پوری کرنے کے لیے انھیں امتحان کا پورا پورا موقع دینا چاہتا ہے اور کسی کو زبردستی اپنی نافرمانی سے باز رکھنا اس کی حکمت اور تکوینی نظام کے خلاف ہے، اس لیے وہ انھیں ڈھیل دے رہا ہے۔ ¤ ➍ {فَذَرْهُمْ وَ مَا يَفْتَرُوْنَ:} یعنی ان کی کوئی پروا نہ کریں، انھیں اور ان کے جھوٹ گھڑنے کو اﷲ پر چھوڑ دیں، وہ خود ان سے نمٹ لے گا۔"
    },
    {
      "ayah": 113,
      "tafsir": "(آیت 113) ➊ {وَ لِتَصْغٰۤى اِلَيْهِ …… :} اس کا عطف {’’ غُرُوْرًا ‘‘} پر ہے، یعنی {’’ لِيَغُرُّوْا بِذٰلِكَ وَ لِتَصْغٰي‘‘} ’’تاکہ وہ اس کے ساتھ دھوکا دیں اور تاکہ ان لوگوں کے دل جو آخرت پر ایمان نہیں رکھتے اس (جھوٹ) کی طرف مائل ہوں۔‘‘ یہ توجیہ ان تمام توجیہوں سے بہتر ہے جو یہاں کی گئی ہیں۔ (رازی) ¤ ➋ {وَ لِيَرْضَوْهُ وَ لِيَقْتَرِفُوْا …… :} { ’’اِكْتَسَبَ يَكْتَسِبُ ‘‘} اچھی یا بری دونوں کمائیوں کو کہتے ہیں، جبکہ {’’ اِقْتَرَفَ يَقْتَرِفُ ‘‘} برے اعمال کمانے کو کہتے ہیں، یعنی ان شیاطین کے پیشِ نظر اس وحی سے یہ سب مقاصد ہیں۔ (رازی) شاہ عبد القادر رحمہ اللہ لکھتے ہیں کہ یہ کئی آیتیں اس وقت نازل ہوئیں جب کفار کہنے لگے کہ مسلمان اپنا مارا ہوا جانور کھاتے ہیں اور اﷲ کے مارے ہوئے کو حرام سمجھتے ہیں۔ فرمایا کہ ایسی فریب کی باتیں شیطان کرتے ہیں، تاکہ انسانوں کو شبہات میں ڈالا جائے۔ عقل کا حکم نہیں، حکم اﷲ کا ہے۔ آگے پھر واضح طور پر سمجھایا گیا کہ ہر جانور کو مارنے والا اﷲ ہی ہے اور اس کے نام میں برکت ہے، سو جو اس کے نام پر ذبح ہوا وہ حلال ہے اور جو اس کے نام کے بغیر مر گیا وہ مردار ہے۔ (موضح)"
    },
    {
      "ayah": 114,
      "tafsir": "(آیت 114) ➊ {اَفَغَيْرَ اللّٰهِ اَبْتَغِيْ حَكَمًا …… :} اوپر کی آیات میں یہ بتا دیا کہ یہ کفار کسی صورت ایمان نہیں لائیں گے، لہٰذا ان کے لیے آیات کا نازل کرنا بے فائدہ ہے۔ اب یہاں بتایا کہ اﷲ تعالیٰ نے جو مفصل کتاب نازل فرمائی ہے وہ آپ کی نبوت کے سچا ہونے پر دلیل کے لیے کافی ہے۔ کفار مکہ یہ چاہتے تھے کہ ان کے اور نبی صلی اللہ علیہ وسلم کے درمیان جو مخالفت ہے اس کے بارے میں اہل کتاب یا کسی اور کو حکم بنا لیا جائے، پھر جو فیصلہ وہ دیں اسے تسلیم کر لیا جائے، اس آیت میں ان کی اس تجویز کا جواب دیا جا رہا ہے کہ کیا میں اﷲ کے علاوہ کوئی اور منصف تلاش کروں۔ ¤ ➋ {يَعْلَمُوْنَ اَنَّهٗ مُنَزَّلٌ مِّنْ رَّبِّكَ بِالْحَقِّ: } کیونکہ ان کے انبیاء بھی انھیںں نبی صلی اللہ علیہ وسلم کی بشارت دیتے رہے ہیں اور ان کی کتابوں میں بھی آپ کی علامات موجود ہیں۔ ¤ ➌ { فَلَا تَكُوْنَنَّ مِنَ الْمُمْتَرِيْنَ: } یعنی اس بارے میں کہ اہل کتاب کے دلوں میں قرآن کے سچا ہونے کا یقین ہے۔ خطاب تو آپ صلی اللہ علیہ وسلم سے ہے، مگر اس سے مراد سارے مسلمان ہیں۔ (رازی)"
    },
    {
      "ayah": 115,
      "tafsir": "(آیت 115) ➊ { وَ تَمَّتْ كَلِمَتُ رَبِّكَ …… :} یہاں کلمہ اور کلمات سے مراد قرآن ہے، یعنی قرآن معجزہ ہونے اور آپ صلی اللہ علیہ وسلم کی نبوت کے سچا ہونے کی دلیل کے لیے کافی ہے۔ کیونکہ قرآن کے تمام مضامین دو ہی قسم کے ہیں، خبریں یا احکام۔ یہاں {’’ صِدْقًا ‘‘} کا تعلق خبروں سے ہے اور {’’ عَدْلًا ‘‘} کا تعلق احکام سے ہے اور مطلب یہ ہے کہ قرآن مجید کی تمام خبریں، خواہ ان کا تعلق اﷲ تعالیٰ کی ذات و صفات سے ہو یا گزشتہ واقعات یا مستقبل کے وعدے اور حوادث سے، وہ سب پورے طور پر سچے ہیں اور اس میں جتنے احکام ہیں وہ سب عدل و انصاف پر مشتمل ہیں، ان میں کسی قسم کی تبدیلی یا ترمیم کی گنجائش نہیں ہے۔ ایسی کامل کتاب کی موجودگی میں ان شیطانی وساوس یا عقلی شکوک و شبہات کی کوئی گنجائش باقی نہیں ہے۔ (رازی) پھر ذبیحہ جیسے اہم مسئلے میں یہ اپنی کج فہمی سے کیوں دخل دے رہے ہیں۔ ¤ ➋ { لَا مُبَدِّلَ لِكَلِمٰتِهٖ: } یعنی نہ تو اس قسم کے شبہات قرآن کے معجزہ ہونے پر اثرانداز ہو سکتے ہیں اور نہ اس کے اوامر و نواہی میں کوئی ترمیم جائز ہے اور نہ جیسے تورات و انجیل میں تحریف ہوئی، قرآن میں ہو سکے گی۔ (رازی)"
    },
    {
      "ayah": 116,
      "tafsir": "(آیت 116) {وَ اِنْ تُطِعْ اَكْثَرَ مَنْ فِي الْاَرْضِ ……: } اﷲ تعالیٰ نے اس آیت کریمہ میں اپنے نبی کو متنبہ کیا ہے کہ کثرت آپ کے نزدیک حق کی دلیل نہیں ہونی چاہیے اور محض کثرت کی بنیاد پر آپ کو اہل زمین کا اتباع نہیں کرنا چاہیے، ورنہ آپ راہ حق سے ہٹ جائیں گے۔ یہ کفار جو کثیر تعداد میں ہیں، اس جھوٹے گمان میں مبتلا ہیں کہ ان کے آباء و اجداد حق پر تھے، اس لیے ان کی تقلید کرتے ہیں۔ ان کے پاس اس کے سوا کوئی دلیل موجود نہیں ہے کہ لوگوں کی اکثریت اسی دین پر قائم ہے جو ان کا بھی دین ہے۔ یہ لوگ اﷲ تعالیٰ کے بارے میں اٹکل پچو باتیں کرتے ہیں، کبھی کسی کو اﷲ کا بیٹا کہتے ہیں تو کبھی بتوں کو اﷲ کے پاس اپنا سفارشی بناتے ہیں اور کبھی مردوں اور غیر اﷲ کے نام پر ذبح کیے ہوئے جانوروں کو حلال قرار دیتے ہیں۔ اس آیت سے موجودہ جمہوریت کی حقیقت بھی خوب واضح ہوتی ہے، جس میں اکثریت ہی کو فیصلہ کن سمجھا جاتا ہے۔ اکثریت سے متعلق اﷲ تعالیٰ نے اس آیت کے علاوہ بھی حق پر نہ ہونے کا ذکر فرمایا ہے : «وَ مَاۤ اَكْثَرُ النَّاسِ وَ لَوْ حَرَصْتَ بِمُؤْمِنِيْنَ » [یوسف : ۱۰۳ ] ’’اور اکثر لوگ خواہ تو حرص کرے ہرگز ایمان لانے والے نہیں ہیں۔‘‘ اور فرمایا : «وَ لٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ » [ یونس : ۵۵ ] ’’اور لیکن ان کے اکثر نہیں جانتے۔‘‘ اور فرمایا: «وَ قَلِيْلٌ مِّنْ عِبَادِيَ الشَّكُوْرُ » [سبا : ۱۳ ] ’’اور بہت تھوڑے میرے بندوں میں سے پورے شکر گزار ہیں۔‘‘ اور فرمایا : «اِلَّا الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ وَ قَلِيْلٌ مَّا هُمْ» [ ص : ۲۴ ] ’’مگر وہ لوگ جو ایمان لائے اور انھوں نے نیک اعمال کیے اور یہ لوگ بہت ہی کم ہیں۔‘‘ ¤ اب ایک طرف اﷲ کا حکم ہو جس سے پکی دلیل کوئی ہو نہیں سکتی اور ایک طرف اکثریت ہو جن کی بنیاد محض ان کے گمان اور اٹکل پر ہے اور اس اٹکل کی بنیاد پر انھوں نے بے شمار حرام چیزوں، مثلاً شرک، سود، زنا، قوم لوط کے عمل وغیرہ کو حلال کر لیا اور بے شمار حلال چیزوں کو حرام قرار دے دیا ہے تو بتائیے حق کس طرف ہو گا؟ اس لیے اس آیت میں اﷲ کے حکم کے مقابلے میں اہل زمین کی اکثریت کی اطاعت سے منع فرمایا۔"
    },
    {
      "ayah": 117,
      "tafsir": ""
    },
    {
      "ayah": 118,
      "tafsir": "(آیت 118) {فَكُلُوْا مِمَّا ذُكِرَ اسْمُ اللّٰهِ عَلَيْهِ ……:} یعنی وہ حلال جانورجسے ذبح یا شکار کرتے وقت اﷲ کا نام یعنی{ ’’ بِسْمِ اللّٰهِ وَاللّٰهُ اَكْبَرُ ‘‘} لیا جائے اسے کھاؤ، اگر تم اس کی آیات پر ایمان رکھتے ہو، یعنی صرف ایسا ذبیحہ کھانا ایمان کا تقاضا ہے۔"
    },
    {
      "ayah": 119,
      "tafsir": "(آیت 119) ➊ {وَ قَدْ فَصَّلَ لَكُمْ مَّا حَرَّمَ عَلَيْكُمْ:} یعنی جب اﷲ تعالیٰ نے تمھارے لیے حرام چیزوں کو خوب کھول کر بیان کر دیا ہے، جن کی تفصیل آگے اسی سورت میں آ رہی ہے اور سورۂ بقرہ اور سورۂ مائدہ میں بھی ہے اور بعض کا ذکر احادیث میں ہے، تو ان کے علاوہ سب جانور حلال ہیں اور اﷲ کے نام پر ذبح یا شکار کیا ہوا جانور ان حرام چیزوں میں شامل نہیں ہے، تو پھر کیا وجہ ہے کہ تم اسے نہ کھاؤ اور اﷲ کے نام کے بغیر یا غیر اﷲ کے نام پر ذبح یا شکار کیا ہوا جانور کھاؤ۔ ¤ ➋ { اِلَّا مَا اضْطُرِرْتُمْ:} یعنی اضطرار اور مجبوری میں حرام کھانا جائز ہے۔ دیکھیے سورۂ بقرہ (۱۷۳)، سورۂ مائدہ (۳) اور اسی سورت کی آیت(۱۴۵)۔ ¤ ➌ { اِنَّ رَبَّكَ هُوَ اَعْلَمُ بِالْمُعْتَدِيْنَ :} مراد وہ لوگ ہیں جو حرام کو حلال اور حلال کو حرام قرار دیتے ہیں۔ مقصود اس سے ڈرانا ہے۔ (رازی)"
    },
    {
      "ayah": 120,
      "tafsir": "(آیت 120) {وَ ذَرُوْا ظَاهِرَ الْاِثْمِ وَ بَاطِنَهٗ …… :} یعنی حلال و حرام صرف کھانے کی چیزوں میں منحصر نہیں ہے، بلکہ ہر ظاہر و باطن گناہ کو چھوڑنا ضروری ہے۔ شاہ عبدالقادر رحمہ اللہ لکھتے ہیں : ’’یعنی کافروں کے بہکانے پر نہ ظاہر میں عمل کرو اور نہ دل میں شبہ رکھو۔‘‘(موضح) علماء نے لکھا ہے کہ ظاہر گناہ وہ ہیں جو ہاتھ پاؤں سے کیے جائیں، جیسے چوری، زنا وغیرہ اور چھپے گناہ وہ ہیں جن کے کرنے کا دل میں عزم ہو، یا جو عقیدے سے تعلق رکھتے ہوں، جیسے کفر و شرک اور نفاق وغیرہ، یا جن گناہوں کا نقصان عام لوگوں پر واضح ہو وہ ظاہر گناہ کہلاتے ہیں اور جن کے نقصان سے چند مخصوص آدمیوں کے سوا دوسرے واقف نہ ہوں وہ باطن کہلاتے ہیں۔ (المنار )"
    },
    {
      "ayah": 121,
      "tafsir": "(آیت 121) ➊ { وَ لَا تَاْكُلُوْا مِمَّا لَمْ يُذْكَرِ اسْمُ اللّٰهِ عَلَيْهِ:} پہلے اﷲ نے یہ بیان فرمایا کہ اﷲ کے نام کا ذبیحہ حلال ہے۔ اب اس آیت میں بیان فرمایا کہ جس ذبیحہ پر اﷲ کا نام نہ لیا گیا ہو اس کا کھانا حرام ہے، اس میں مردار اور وہ جانور تو آیت کے صاف الفاظ میں داخل ہیں جو غیر اﷲ کے نام پر ذبح کیے گئے ہوں اور آیت گو لفظ عام ہونے کی وجہ سے ہر اس چیز کو شامل ہے جس پر اﷲ کا نام نہ لیا گیا ہو، خواہ وہ کھانے کی کوئی بھی چیز ہو، مگر فقہاء نے اس سے بالاجماع ذبیحہ مراد لیا ہے۔ (رازی) یاد رہے ! اگر کسی ذبیحہ پر جان بوجھ کر اﷲ کا نام ترک کر دیا جائے تو وہ اکثر فقہاء کے نزدیک حرام ہے، مگر جب مسلمان ذبح کرتے وقت {’’ بِسْمِ اللّٰهِ اَللّٰهُ اَكْبَرُ ‘‘} بھول جائے تو اس کا کھانا جائز ہے، کیونکہ اﷲ تعالیٰ نے اس امت سے خطا اور نسیان معاف کر دیا ہے۔ ¤ ➋ {وَ اِنَّهٗ لَفِسْقٌ:} یعنی جانور کو غیر اﷲ کے نام پر ذبح کرنا فسق ہے یا ایسے ذبیحہ کو کھانا فسق ہے۔ دونوں معنیٰ بھی مراد ہو سکتے ہیں۔ دیکھیے سورۂ انعام (۱۴۵)۔ ¤ ➌ {وَ اِنَّ الشَّيٰطِيْنَ لَيُوْحُوْنَ ……:} دیکھیے اسی سورت آیت کی (۱۱۳) کا حاشیہ(۲)۔ ¤ ➍ {وَ اِنْ اَطَعْتُمُوْهُمْ۠ اِنَّكُمْ لَمُشْرِكُوْنَ:} اﷲ تعالیٰ کی حلال کی ہوئی چیزوں کو حرام اور حرام کی ہوئی چیزوں کو حلال قرار دینے والا بھی مشرک ہے، کیونکہ اس نے اﷲ تعالیٰ کے سوا دوسرے کو حاکم بنا لیا، یعنی تحلیل و تحریم کا حق کسی اور کے لیے تسلیم کر لیا، جب کہ یہ صرف اﷲ کا حق ہے۔ (رازی) شاہ عبد القادر رحمہ اللہ لکھتے ہیں کہ شرک فقط یہی نہیں کہ کسی کو سوائے اﷲ کے پوجے، بلکہ شرک حکم میں بھی ہے کہ کسی اور کا مطیع ہووے۔ (موضح)"
    },
    {
      "ayah": 122,
      "tafsir": "(آیت 122) ➊ { اَوَ مَنْ كَانَ مَيْتًا فَاَحْيَيْنٰهُ …… : } یعنی وہ کافر تھا اسے مسلمان بنایا۔ (شوکانی) اوپر جانوروں کے مُردوں کا ذکر تھا، یہاں کافر پر وہی مثال فرمائی، یعنی جب کافر تھے تو جہل اور کفر و شرک کے باعث سب مُردے تھے، پھر جس کو ایمان ملا وہ زندہ ہوا اور روشنی اور راہِ ہدایت پائی اور اس کے چہرے پر سب لوگ ایمان کی روشنی دیکھتے ہیں اور جس کو ایمان نہ ملا وہ اندھیروں میں پڑا رہا۔ (موضح) مسلمان اور کافر کے زندہ اور مردہ ہونے کا مضمون دیکھیے سورۂ بقرہ(۲۵۷)، سورۂ ہود(۲۴) اور سورۂ فاطر (۱۹ تا ۲۲) میں۔ ¤ ➋ {كَذٰلِكَ زُيِّنَ لِلْكٰفِرِيْنَ مَا كَانُوْا يَعْمَلُوْنَ:} یعنی شیطان اپنے وسوسوں کے ذریعے سے ان کافروں کی نگاہ میں ان کے اعمال کو خوبصورت کر کے پیش کرتا ہے۔"
    },
    {
      "ayah": 123,
      "tafsir": "(آیت 123) ➊ { وَ كَذٰلِكَ جَعَلْنَا فِيْ كُلِّ قَرْيَةٍ …… : ’’ اَكٰبِرَ ‘‘} یہ {’’ اَكْبَرُ ‘‘} کی جمع ہے، {’’ مُجْرِمِيْنَ ‘‘} کا نون {’’ هَا ‘‘} کی طرف اضافت کی وجہ سے گر گیا، یعنی مکہ کی طرح پہلے بھی ہم نے ہر بستی کے اکابر اور چودھری اور کھڑپینچ اس کے مجرموں کو بنا دیا، جس کے نتیجے میں وہ اپنے مکر و فریب اور قوت و اقتدار کے ذریعے سے لوگوں کو ایمان سے روکتے رہے اور فسق و فجور میں پڑے رہے۔ انبیاء کے مقابلے میں بھی یہی لوگ آتے رہے، مگر آخر انجام ایمان والوں کے غلبے پر ہوا۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں، ہمیشہ کافروں کے سردار حیلے نکالتے ہیں، تاکہ عوام الناس پیغمبر کے مطیع نہ ہو جائیں، جیسے فرعون نے معجزہ دیکھا تو حیلہ نکالا کہ جادو کے زور سے سلطنت لینا چاہتا ہے۔ (موضح) ¤ ➋ {وَ مَا يَمْكُرُوْنَ اِلَّا بِاَنْفُسِهِمْ:} یعنی اس کا وبال خود ان پر پڑے گا، تو گویا اپنے آپ کو فریب دے رہے ہیں۔"
    },
    {
      "ayah": 124,
      "tafsir": "(آیت 124) ➊ {وَ اِذَا جَآءَتْهُمْ اٰيَةٌ …… :} یعنی ان کفار کے مکر و فریب کا یہ عالم ہے کہ جب بھی ان کے سامنے نبی صلی اللہ علیہ وسلم کے صدق کی دلیل کے طور پر کوئی معجزہ ظاہر ہوتا ہے تو کہہ دیتے ہیں کہ جب تک ہم خود اس منصب پر فائز نہ ہوں اور ہمیں یہ معجزہ نہ ملے ہم ایمان نہیں لا سکتے۔ ¤ ➋ { اَللّٰهُ اَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهٗ:} یعنی نبوت و رسالت محض وہبی چیز ہے، اﷲ تعالیٰ جسے چاہتا ہے نبوت کی امانت اس کے سپرد کر دیتا ہے اور وہی بہتر جانتا ہے کہ یہ نعمت کسے عطا کرنی ہے، مکہ کے ایک یتیم کو یا مکہ اور طائف کے کسی متکبر سردار کو۔ دیکھیے سورۂ زخرف (۳۱، ۳۲)۔"
    },
    {
      "ayah": 125,
      "tafsir": "(آیت 125) ➊ {فَمَنْ يُّرِدِ اللّٰهُ اَنْ يَّهْدِيَهٗ ……:} ’’اسلام ‘‘ کا لفظی معنی ہے تابع ہو جانا، اپنے آپ کو سپرد کر دینا۔ {’’ حَرَجًا ‘‘} نہایت تنگ، گھٹا ہوا، درختوں کا وہ جھنڈ جس میں کوئی چیز داخل نہ ہو سکے۔ {’’ يَصَّعَّدُ ‘‘} یہ {’’ صَعِدَ يَصْعَدُ ‘‘} (س) سے باب تفعل کا مضارع ہے، یعنی {’’ يَصَّعَّدُ ‘‘} اصل میں {’’يَتَصَعَّدُ‘‘} تھا، حروف زیادہ ہونے سے معنی میں ایک لفظ کا اضافہ کیا ہے، یعنی مشکل سے چڑھ رہا ہے۔ ¤ ➋ اس آیت میں اﷲ تعالیٰ نے بتایا ہے کہ رسالت کی طرح ہدایت و گمراہی بھی اس کے ہاتھ میں ہے، وہ اپنے نظام عدل کے مطابق جسے ہدایت دینا چاہتا ہے اس کا سینہ صحیح بات تسلیم کرنے کے لیے کھول دیتا ہے، اس کے لیے ہدایت کے راستے آسان کر دیتا ہے، اسے حق قبول کرنے میں کوئی دشواری نہیں ہوتی اور وہ آسانی سے اپنے آپ کو اﷲ اور اس کے رسول کے تابع فرمان کر دیتا ہے اور جسے اس کی سرکشی کے باعث ہدایت نہیں دینا چاہتا اس کا سینہ حق قبول کرنے کے لیے تنگ اور نہایت گھٹا ہوا کر دیتا ہے، جیسا کہ وہ بلندی کی طرف مشکل سے چڑھ رہا ہے، جوں جوں اوپر چڑھتا ہے، ایک تو چڑھائی کی وجہ سے دوسرے آکسیجن کے کم اور پھر ختم ہونے کی وجہ سے سانس ہی نہیں لے سکتا۔ جو لوگ حق سمجھ کر انکار کا راستہ اختیار کرنے والے ہیں ان پر ایمان کی طہارت حاصل نہ ہونے کی وجہ سے کفر کی گندگی چڑھتی چلی جاتی ہے۔ دیکھیے سورۂ بقرہ (۶، ۷)، سورۂ توبہ (۱۲۵)، سورۂ لیل (۵ تا ۱۰) اور سورۂ یونس(۱۰۰)۔ ¤ ➌ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اوپر فرمایا تھا کہ کافر قسمیں کھاتے ہیں کہ ایک آیت ( نشانی) دیکھیں تو ضرور یقین لے آئیں گے، اب فرمایا کہ ہم نہ دیں گے ایمان تو کیونکر لائیں گے۔ بیچ میں مردہ حلال کرنے کے حیلے ذکر کیے، اب اس بات کا جواب فرمایا کہ جس کی عقل اس طرف چلے کہ اپنی بات کو نہ چھوڑے، جو دلیل دیکھے کچھ حیلہ بنا لے، وہ نشان ہے گمراہی کا اور جس کی عقل چلے انصاف پر اور حکم برداری پر وہ نشان ہدایت ہے۔ ان لوگوں میں نشان ہیں گمراہی کے، ان کو کوئی آیت اثر نہ کرے گی۔‘‘ (موضح)"
    },
    {
      "ayah": 126,
      "tafsir": "(آیت 126){ وَ هٰذَا صِرَاطُ رَبِّكَ …… : ’’ هٰذَا ‘‘} یعنی حکم برداری میں عقل کو راہ نہ دینا سیدھی راہ ہے۔ (موضح)"
    },
    {
      "ayah": 127,
      "tafsir": ""
    },
    {
      "ayah": 128,
      "tafsir": "(آیت 128) ➊ {وَ يَوْمَ يَحْشُرُهُمْ جَمِيْعًا:} جنوں سے مراد یہاں شیطان جن ہیں۔ ان کا بہت سے انسانوں کو اپنا بنا لینے کا مطلب انھیں گمراہ کر کے اپنے راستے پر لگا لینا ہے اور جنوں کا انسانوں سے فائدہ اٹھانا یہ ہے کہ انھوں نے ان کو گمراہی کی دعوت دی اور انھوں نے اسے قبول کر لیا اور ان کی تعظیم و تکریم اور مصیبتوں کے وقت ان کو پکارنا شروع کر دیا اور یہی شیاطین کی کامیابی ہے اور انسانوں کے جنوں سے فائدہ اٹھانے سے مراد ان سے آسمان کے فرشتوں سے سنی ہوئی خبریں، جو وہ جھوٹ ملا کر بتاتے ہیں، سن کر اپنی جھوٹی غیب دانی کا بازار چمکانا، جادو ٹونے میں ان سے مدد لینا وغیرہ ہے اور پھر لوگوں سے پیسے بٹورنا، مزید کئی فوائد حاصل کرنا اور انھیں گمراہ کرنا ہے۔ ¤ ➋ {قَالَ النَّارُ مَثْوٰىكُمْ: } یہ آیت اس بات کی دلیل ہے کہ سلیمان علیہ السلام کے بعد جو شخص بھی کسی جن سے کوئی فائدہ اٹھائے یا قید کر کے اس سے کوئی مقصد حاصل کرے تو اس شخص اور جن دونوں کا ٹھکانا جہنم ہے، اسی لیے رسول اﷲ صلی اللہ علیہ وسلم نے ایک شیطان جن کو نماز کے دوران آپ پر حملہ کرنے پر گرفتار کر لیا اور مسجد کے ستون سے باندھنے کا ارادہ کیا تو سلیمان علیہ السلام کی دعا یاد کر کے اسے چھوڑ دیا کہ انھوں نے دعا کی تھی : «رَبِّ اغْفِرْ لِيْ وَهَبْ لِيْ مُلْكًا لَّا يَنْۢبَغِيْ لِاَحَدٍ مِّنْۢ بَعْدِيْ ……» [صٓ : ۳۴ تا ۴۰ ] مزید دیکھیے : سورۂ شعراء (۲۲۱ تا ۲۲۳) اور سورۂ جن(۶)۔ ¤ ➌ { اِلَّا مَا شَآءَ اللّٰهُ:} اس لفظ سے جو شبہ پیدا ہوتا ہے کہ جہنم آخر ختم ہو جائے گی اس کے جواب میں شاہ عبد القادر رحمہ اللہ فرماتے ہیں کہ جو فرمایا کہ آگ میں رہا کریں گے مگر جو چاہے اﷲ تو یہ اس لیے کہ اگر دوزخ کا عذاب دائمی ہے تو اسی کے چاہنے سے ہے، وہ چاہے تو موقوف کرے مگر وہ چاہ چکا۔ (موضح)"
    },
    {
      "ayah": 129,
      "tafsir": "(آیت 129){ وَ كَذٰلِكَ نُوَلِّيْ بَعْضَ الظّٰلِمِيْنَ بَعْضًۢا …… : } یعنی جس طرح ہم نے جنات اور بعض انسانوں کو ایک دوسرے کا دوست بنا دیا اسی طرح ہم ظالم اور فاسق و فاجر انسانوں کو ان کے اعمال کے سبب ایک دوسرے کا دوست بنا دیتے ہیں، جیسا کہ دیکھیے سورۂ توبہ( ۶۷، ۷۱)۔ ایک ترجمہ یہ بھی ہو سکتا ہے کہ اسی طرح ہم ( آخرت میں) ظالموں کو ایک دوسرے کا ساتھی بنا دیں گے کہ جس طرح وہ دنیا میں گناہوں کے ارتکاب میں ایک دوسرے کے ساتھی اور مددگار تھے اسی طرح آخرت کا عذاب بھگتنے میں بھی وہ ایک دوسرے کے شریک حال ہوں گے۔ بعض نے {’’ نُوَلِّيْ ‘‘ } کا ایک معنی یہ کیا ہے کہ ہم ظالموں میں سے بعض کو بعض پر والی اور حاکم بنا دیتے ہیں کہ جس طرح ہم نے جنوں اور انسانوں میں سے بعض کو بعض پر مسلط کر دیا، اسی طرح دنیا میں ہم ظالموں کو بھی ایک دوسرے پر مسلط کر دیتے ہیں کہ ظالم ماتحت پر ظلم کرتا ہے اور کمزور زبردست کا ظلم سہتا ہے، مگر آیات کے سیاق اور الفاظ{ ’’ اَوْلِيٰٓؤُهُمْ مِّنَ الْاِنْسِ ‘‘} کی یہاں حاکم کے معنی کے ساتھ مناسبت محل نظر ہے۔"
    },
    {
      "ayah": 130,
      "tafsir": "(آیت 130) ➊ { يٰمَعْشَرَ الْجِنِّ وَ الْاِنْسِ اَلَمْ يَاْتِكُمْ رُسُلٌ مِّنْكُمْ:} ’’ تم میں سسے رسول‘‘ کا مطلب یہ ہے کہ وہ رسول جن و انس میں سے انسان ہی ہوئے ہیں۔ افضل مخلوق فرشتے ہیں یا انسان اس کے لیے دیکھیے سورۂ یوسف (۱۰۹) اور سورۂ فرقان(۲۰) جنوں کا نبی ہونا ثابت نہیں، علمائے سلف و خلف کی اکثریت کا یہی قول ہے کہ کسی جن کو رسول نہیں بنایا گیا، البتہ ان میں سے کئی منذرین گزرے ہیں، یعنی اپنی قوم کو خبردار کرنے والے، جو انسانوں کی طرف آنے والے رسولوں پر ایمان لاکر اپنی قوم کو پیغام پہنچاتے تھے۔ دیکھیے سورۂ احقاف (۲۹ تا ۳۲) اور سورۂ جن۔ دونوں میں جنوں نے رسول اﷲ صلی اللہ علیہ وسلم پر ایمان لانے کا اقرار کیا ہے اور اپنی قوم کو ایمان لانے کی دعوت دی ہے، بلکہ سورۂ احقاف سے معلوم ہوتا ہے کہ وہ جن پہلے موسیٰ علیہ السلام پر ایمان رکھتے تھے۔ ¤ ➋ { اَنَّهُمْ كَانُوْا كٰفِرِيْنَ:} شاہ عبد القادر رحمہ اللہ لکھتے ہیں کہ اس سورت میں اوپر مذکور ہوا کہ اول کافر اپنے کفر کا انکار کریں گے، پھر حق تعالیٰ تدبیر سے ان کو قائل کرے گا۔ (موضح) دیکھیے سورۂ انعام (۲۳ اور ۲۷ تا ۳۰)، سورۂ حٰم السجدۃ (۲۰، ۲۱) اور سورۂ یٰسٓ(۶۵)۔"
    },
    {
      "ayah": 131,
      "tafsir": "(آیت 131){ ذٰلِكَ اَنْ لَّمْ يَكُنْ رَّبُّكَ:} یعنی ان کے پاس کوئی پیغمبر یا اس کا نائب نہ پہنچا ہو اور اس نے انھیں حقیقت حال سے آگاہ نہ کر دیا ہو۔ دیکھیے سورۂ بنی اسرائیل (۱۵)۔"
    },
    {
      "ayah": 132,
      "tafsir": "(آیت 132){ وَ لِكُلٍّ دَرَجٰتٌ مِّمَّا عَمِلُوْا ……:} اس سے معلوم ہوا کہ جنوں میں سے بھی جو نیک ہیں وہ جنت میں اور جو بدکار ہیں وہ جہنم میں جائیں گے۔ سورۂ رحمن میں اس کی تفصیل موجود ہے اور جنت اور جہنم میں بھی ان کے درجات و دَرکات مختلف ہوں گے۔"
    },
    {
      "ayah": 133,
      "tafsir": "(آیت 133) ➊ {وَ رَبُّكَ الْغَنِيُّ:} یہاں {’’ الْغَنِيُّ ‘‘} خبر معرفہ ہونے اور {’’ الرَّحْمَةِ ‘‘} پر ’’الف لام‘‘ ہونے کی وجہ سے ترجمہ کیا ہے ’’اور تیرا رب ہی ہر طرح بے پروا، کمال رحمت والا ہے‘‘ اس کے سوا کوئی اور نہ ہی بے پروا ہے نہ کمال رحمت والا، یعنی اسے مخلوق سے کوئی حاجت نہیں، پھر بھی بطور احسان کمال رحمت والا ہے۔ اس میں یہ بھی ہے کہ پہلے جو نعمتیں ذکر ہوئی ہیں، مثلاً رسولوں کا بھیجنا وغیرہ، محض رحمت کی بنا پر ہیں، اپنے کسی فائدے کے لیے نہیں۔ ¤ ➋ { ذُو الرَّحْمَةِ:} رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’اﷲ تعالیٰ کی سو رحمتیں ہیں، ایک رحمت اس نے جنوں، آدمیوں، جانوروں اور کیڑوں مکوڑوں میں اتاری ہے، وہ اسی ایک رحمت کی وجہ سے ایک دوسرے پر مہربانی کرتے ہیں اور رحم کرتے ہیں اور اسی ایک رحمت کی وجہ سے وحشی جانور اپنے بچوں سے محبت کرتے ہیں اور ننانویں رحمتیں اﷲ تعالیٰ نے اٹھا رکھی ہیں جو اپنے بندوں پر قیامت کے دن کرے گا۔‘‘ [ مسلم، التوبۃ، باب فی سعۃ رحمۃ اﷲ تعالٰی …… : 2752/19 ] ¤ ➌ { اِنْ يَّشَاْ يُذْهِبْكُمْ …… :} یعنی جس طرح تمھیں پہلے لوگوں کا جانشین بنایا اسی طرح تمھیں تباہ کر کے دوسروں کو تمھارا جانشین بنا سکتا ہے، یا یہ کہ اس کی قدرت جن و انس کو پیدا کرنے ہی پر منحصر نہیں، بلکہ وہ ان کے بجائے کوئی تیسری قسم کی مخلوق بھی پیدا کر سکتا ہے۔ (رازی) دیکھیے سورۂ نساء(۱۳۳)، سورۂ ابراہیم (20،19) اور سورۂ فاطر (۱۵ تا ۱۷)"
    },
    {
      "ayah": 134,
      "tafsir": "(آیت 134){ وَ مَاۤ اَنْتُمْ بِمُعْجِزِيْنَ:} باء تاکید کی وجہ سے ترجمہ میں ’’کسی صورت ‘‘ کا اضافہ کیا گیا ہے۔ مطلب یہ کہ تم اس سے بچ کر کہیں جا نہیں سکتے کہ وہ تمھیں پکڑنے سے عاجز رہ جائے۔"
    },
    {
      "ayah": 135,
      "tafsir": "(آیت 135) ➊ { قُلْ يٰقَوْمِ اعْمَلُوْا عَلٰى مَكَانَتِكُمْ:} مطلب یہ نہیں کہ تمھیں اجازت ہے کہ جو چاہو کرو، بلکہ ڈانٹنا مقصود ہے، جیسے کوئی شخص کہتا ہے کہ اچھا جو کچھ تم کر رہے ہو کرتے رہو، میں عنقریب تم سے نمٹ لوں گا۔ ¤ ➋ {مَنْ تَكُوْنُ لَهٗ عَاقِبَةُ الدَّارِ:} ابن کثیر رحمہ اللہ نے فرمایا کہ اﷲ تعالیٰ نے اپنے رسول سے وعدہ پورا فرمایا اور انھیں تمام ملک پر قبضہ عطا فرمایا، مخالفین ان کے رحم و کرم پر رہ گئے، مکہ فتح کروا دیا اور یہ سب کچھ آپ کی زندگی میں ہو گیا، پھر آپ کی وفات کے بعد مشرق سے مغرب تک ملک فتح ہو گئے۔ آخرت میں اس سے بھی کہیں بڑھ کر اچھا انجام ہو گا۔ دیکھیے سورۂ مومن(۵۱، ۵۲) ¤ ➌ { اِنَّهٗ لَا يُفْلِحُ الظّٰلِمُوْنَ:} ’’بلاشبہ ‘‘{ ”اِنَّ““ } کا اور ’’ حقیقت یہ ہے‘‘ ضمیر شان { ”هٗ“} کا ترجمہ ہے۔"
    },
    {
      "ayah": 136,
      "tafsir": "(آیت 136) {وَ جَعَلُوْا لِلّٰهِ مِمَّا ذَرَاَ مِنَ الْحَرْثِ......:} قیامت اور جزا و سزا کے متعلق ان کے خیالات کی تردید کے بعد یہاں سے ان کی دوسری اعتقادی اور عملی حماقتوں اور جہالتوں کا بیان شروع ہو رہا ہے جو مدت سے چلی آئی تھیں۔ عبد اﷲ بن عباس رضی اللہ عنہما نے فرمایا کہ جب تم عربوں کی جہالت معلوم کرنا چاہو تو سورۂ انعام کی آیت (۱۳۰) سے لے کر «قَدْ خَسِرَ الَّذِيْنَ قَتَلُوْۤا » یعنی آیت(۱۴۰) تک پڑھ لو۔ [ بخاری، المناقب، باب قصۃ زمزم و جہل العرب : ۳۵۲۴ ] ان میں سے پہلی جہالت یہ تھی کہ اپنی کھیتی اور چوپاؤں میں سے ایک حصہ انھوں نے اﷲ تعالیٰ کے لیے، یعنی مہمان نوازی، صلہ رحمی اور اﷲ کو خوش کرنے والے کاموں کے لیے مقرر کیا ہوا تھا اور ایک حصہ اپنے داتاؤں، مشکل کشاؤں، ان کی شکل پر بنائے ہوئے بتوں، ان کے پروہتوں اور کاہنوں کے لیے۔ اگر کسی وجہ سے بتوں اور کاہنوں کا حصہ کم پڑ جاتا تو اﷲ تعالیٰ کے حصے میں سے لے کر اس میں ڈال دیتے اور کہتے کہ اﷲ تو غنی ہے، اس کو زیادہ مال کی کیا ضرورت ہے اور اگر اﷲ تعالیٰ کا حصہ کم پڑ جاتا تو اس میں بتوں کے حصے میں سے کچھ نہ ڈالتے۔ اب بتائیے کہ اﷲ تعالیٰ کے مقابلے میں شریک بنانا کون سی کم جہالت تھی کہ اس سے بڑھ کر ان شرکاء کو خوش کرنے کے لیے کھیتی اور چوپاؤں کے حصے میں ان کو اﷲ پر ترجیح دینے کی جہالت اختیار کرتے ! یہ اسی طرح ہے جیسے آج کل بعض مسلمان اﷲ کا فرض زکوٰۃ اور عشر نہیں نکالیں گے، مگر اپنے فوت شدہ داتاؤں اور غریب نوازوں کی نیاز میں کبھی ناغہ نہیں آنے دیں گے اور عقیدہ یہ رکھیں گے کہ اگر اس میں کمی ہو گئی تو جانوروں کے تھنوں میں سے دودھ کے بجائے خون آئے گا۔ نام اس کا ایصال ثواب رکھیں گے، مگر ایصال ثواب تو اﷲ کے نام پر صدقہ کرنے سے ہوتا ہے، نہ کہ بزرگوں کی قبروں پر چڑھاوے چڑھا کر اور اگر اﷲ ہی کو خوش کرنا ہو تو غیر اﷲ کی نذر و نیاز کے بجائے عشر اور زکوٰۃ نکالیں۔"
    },
    {
      "ayah": 137,
      "tafsir": "(آیت 137) ➊ {وَ كَذٰلِكَ زَيَّنَ لِكَثِيْرٍ مِّنَ الْمُشْرِكِيْنَ ……:} یہ ان کی دوسری جہالت اور گمراہی تھی، اس کا عطف {’’جَعَلُوْا‘‘} پر ہے، یعنی جیسے کھیتی اور جانوروں میں سے انھوں نے اپنے شرکاء کا حصہ مقرر کیا، اسی طرح بہت سے مشرکین کے لیے ان کے شرکاء نے اپنی اولاد کو قتل کرنا بھی خوش نما بنا دیا اور عام طور پر ان کے سامنے تین چیزیں جواز کے بہانے کے طور پر رکھ دیں، ایک یہ کہ انھیں کہاں سے کھلاؤ گے، یعنی : «خَشْيَةَ اِمْلَاقٍ » [ بنی إسرائیل : ۳۱ ] ’’مفلسی کے ڈر سے۔‘‘ جیسا کہ آج کل کے نام نہاد مسلمان بھی منصوبہ بندی کے نام پر یہ کام کر رہے ہیں، کفار کا تو کہنا ہی کیا ہے۔ دوسرا لڑکی کا باعثِ عار ہونا، جیسا کہ فرمایا : «{يَتَوَارٰى مِنَ الْقَوْمِ مِنْ سُوْٓءِ مَا بُشِّرَ بِهٖ } » [ النحل : ۵۹ ] ’’وہ لوگوں سے چھپتا پھرتا ہے اس خوش خبری کی برائی کی وجہ سے جو اسے دی گئی۔‘‘ اور تیسرا اپنے شریکوں کو خوش کرنے کے لیے اولاد کو ان کے نام پر ذبح کر دینا جسے ہندو بھینٹ چڑھانا کہتے ہیں اور ان پروہتوں اور بت خانوں کے پجاریوں کو شریک اس لیے کہا کہ وہ انھیں اپنے نفع و نقصان میں دخیل سمجھتے تھے اور انھی کی ترغیب پر بچوں کو بھینٹ چڑھاتے تھے، جیسا کہ آج کل کئی قبروں کے پجاری یہ کام کرتے ہیں اور اس لیے بھی کہ اﷲ کے حکم کے مقابلے میں کسی اور کا حکم ماننا بھی اسے شریک بنانا ہے اور سب سے بڑا شریک تو شیطان ہے جس کے خوش نما بنانے پر وہ اﷲ کے ساتھ شرک اور اپنی جان پر ظلم کرتے ہیں۔ ¤ ➋ {لِيُرْدُوْهُمْ وَ لِيَلْبِسُوْا عَلَيْهِمْ دِيْنَهُمْ :’’ لِيُرْدُوْهُمْ ‘‘} باب افعال سے {’’ اَرْدٰي يُرْدِيْ ‘‘} کا معنی ہے۔ ہلاک کرنا۔{ ’’ لِيَلْبِسُوْا ‘‘} اگر ’’{لَبَسَ يَلْبِسُ} (ض)‘‘ ہو تو خلط ملط کرنا اور{ ’’ لَبِسَ يَلْبَسُ ‘‘} (س) ہو تو پہننا۔ اہل عرب اصل میں ابراہیم علیہ السلام کے دین پر ہونے کے مدعی تھے، لیکن شیطان نے آہستہ آہستہ بت پرستی، قتل اولاد اور بہت سی غلط باتیں ان کے دین میں داخل کر دی تھیں۔ فرمایا کہ ان کے شرکاء نے یہ سب کچھ انھیں برباد کرنے اور ان کے دین کو خلط ملط کرنے کے لیے کیا۔ ¤ ➌ {وَ لَوْ شَآءَ اللّٰهُ مَا فَعَلُوْهُ ……:} مگر یہ جبر ہوتا اور اس اختیار کے خلاف ہوتا جو اﷲ تعالیٰ اپنے بندوں کو دے کر امتحان لے رہا تھا، اس لیے آپ ان کو ان کے حال پر چھوڑ دیں، ان کی ان تمام حرکتوں کو افترا ( جھوٹ باندھنا ) قرار دیا۔"
    },
    {
      "ayah": 138,
      "tafsir": "(آیت 138) ➊ {’’ حِجْرٌ ‘‘} بمعنی {’’ مَحْجُوْرٌ ‘‘} ہے، یعنی ممنوع۔ اس میں ان کی جاہلیت کی تین اور صورتیں بیان فرمائی ہیں، پہلی صورت یہ کہ فلاں جانور یا کھیت کا استعمال ممنوع ہے، مگر اس کے لیے جسے ہم اجازت دیں گے اور یہ اجازت بت خانوں کے مجاوروں اور خادموں کے لیے ہوتی تھی۔ ¤ ➋ {حُرِّمَتْ ظُهُوْرُهَا:} یہ دوسری صورت ہے کہ وہ مختلف قسم کے جانوروں کو اپنے بتوں کے نام پر آزاد چھوڑ دیتے اور ان سے سواری یا بوجھ اٹھوانے کا کام نہ لیتے، جیسے بحیرہ، سائبہ وغیرہ۔ دیکھیے سورۂ مائدہ(۱۰۳)۔ ¤ ➌ { وَ اَنْعَامٌ لَّا يَذْكُرُوْنَ اسْمَ اللّٰهِ عَلَيْهَا …… : } یہ تیسری صورت ہے کہ وہ کچھ جانوروں کو بت خانوں کے مجاوروں کے لیے خاص کرتے ہوئے انھیں ذبح کرتے وقت یا سوار ہوتے وقت صرف اپنے بت کا نام لیتے، اﷲ کا نام نہ لیتے، بلکہ ان پر حج کے لیے بھی نہ جاتے، تاکہ ان مجاوروں کے سوا کوئی انھیں استعمال نہ کر سکے۔ بہرحال یہ ساری صورتیں گھڑی ہوئی تو ان کی اپنی تھیں مگر وہ اﷲ پر جھوٹ باندھتے اور باور کرواتے کہ یہ اﷲ کا حکم ہے۔"
    },
    {
      "ayah": 139,
      "tafsir": "(آیت 139){ وَ قَالُوْا مَا فِيْ بُطُوْنِ هٰذِهِ الْاَنْعَامٌ …… :} یہ ایک اور شکل تھی کہ جو جانور وہ اپنے بتوں کے نام پر وقف کرتے ان میں سے بعض کے بارے میں کہتے کہ ان کا دودھ اور ان کے پیٹ سے پیدا ہونے والا زندہ بچہ صرف ہمارے مردوں کے لیے حلال ہے، عورتوں کے لیے حرام ہے، ہاں اگر بچہ مردہ پیدا ہو تو پھر مرد اور عورت اس کے کھانے میں برابر کے شریک ہیں۔ اﷲ تعالیٰ نے فرمایا کہ وہ ان کی ان غلط بیانیوں پر عنقریب انھیں بدلہ دے گا اور اپنی کامل حکمت اور علم کے مطابق دے گا۔"
    },
    {
      "ayah": 140,
      "tafsir": "(آیت 140){ قَدْ خَسِرَ الَّذِيْنَ قَتَلُوْۤا اَوْلَادَهُمْ:} فرمایا جن لوگوں نے یہ کام کیے انھوں نے دنیا اور آخرت میں خسارا اٹھایا، دنیا میں اپنی بے وقوفی اور جہالت سے اپنی اولاد کو قتل کرنے کی وجہ سے اولاد سے محروم ہوئے اور اپنے اموال میں سے کچھ چیزوں کو خود ہی حرام قرار دے کر اپنے آپ کو تنگی اور مشکل میں ڈال لیا اور آخرت میں اﷲ تعالیٰ پر جھوٹ اور بہتان باندھنے کی وجہ سے بدترین انجام سے دوچار ہوں گے۔"
    },
    {
      "ayah": 141,
      "tafsir": "(آیت 141) ➊ {وَ هُوَ الَّذِيْۤ اَنْشَاَ جَنّٰتٍ مَّعْرُوْشٰتٍ وَّ غَيْرَ مَعْرُوْشٰتٍ …… :} { ’’ مَعْرُوْشٰتٍ ‘‘} کا مادہ ’’ عرش ‘‘ (ن، ض) ہے۔ جب اس کا ذکر کسی پودے کی بیل کے ساتھ ہو تو اس کا معنی اس کی ٹہنیوں کو لکڑیوں وغیرہ پر اوپر اٹھانا ہے۔ {’’عَرَشَ الْكَرْمَ‘‘} یعنی اس نے انگور کی بیل کو لکڑی وغیرہ پر چڑھایا۔ ¤ ➋ { مُتَشَابِهًا وَّ غَيْرَ مُتَشَابِهٍ:} اس جملے کی تفسیر کے لیے دیکھیے اس سورت کی آیت (۹۹) کا حاشیہ۔ ¤ ➌ اس آیت میں اﷲ تعالیٰ نے زمین سے پیدا ہونے والی ہر کھیتی، پھل، سبزی اور درخت کا ذکر فرما کر حکم دیا ہے کہ کٹائی کے دن اس کا حق ادا کرو، اس لیے زمین سے پیدا ہونے والے ہر پھل اور کھیتی میں سے اﷲ کا حق ادا کرنا ضروری ہے، خواہ وہ {’’مَعْرُوْشٰتٍ ‘‘ } ہوں، یعنی جن کی بیلیں چھتوں پر چڑھائی جاتی ہیں، مثلاً انگور، توری وغیرہ، یا ایسے باغات ہوں جن کی بیلیں زمین پر پھیلتی ہیں، مثلاً خربوزہ، تربوز، گرما وغیرہ، یا ایسے پھل دار درخت ہوں جو اپنے تنے پر قائم ہوں، مثلاً کھجور، زیتون اور انار وغیرہ، یا کوئی بھی کھیتی ہو، زمین سے پیدا ہونے والے ہر پھل اور کھیتی میں سے اﷲ تعالیٰ کا حق نکالنا فرض ہے اور مال میں اﷲ کا سب سے بڑا حق زکوٰۃ و عشر ہے۔ رسول اﷲ صلی اللہ علیہ وسلم کے فرمان کے مطابق بارش، چشموں اور نہروں سے سیراب ہونے والی ہر فصل میں عشر، یعنی دس من میں سے ایک من اور پانی کھینچ کر سیراب کی جانے والی ہر فصل میں نصف العشر، یعنی بیس من میں سے ایک من ہے۔ رسول اﷲ صلی اللہ علیہ وسلم نے اس میں سے کسی فصل کو مستثنیٰ قرار نہیں دیا۔ مفصل احکام کتب احادیث میں ملاحظہ فرمائیں۔ ¤ بعض علماء فرماتے ہیں کہ سبزیوں میں اور ان پھلوں میں عشر نہیں ہے جن کا ذخیرہ نہ ہو سکتا ہو، مثلاً مالٹا، انار وغیرہ، دلیل کے طور پر ترمذی کی حدیث بیان کرتے ہیں کہ سبزیوں میں صدقہ نہیں ہے، مگر خود امام ترمذی رحمہ اللہ نے فرمایا کہ نہ اس حدیث کی سند صحیح ہے اور نہ اس مطلب کی کوئی اور حدیث نبی صلی اللہ علیہ وسلم سے ثابت ہے۔ اس آیت میں ہر کھیتی، زیتون اور انار کا ذکر ہے، حالانکہ انار کا ذخیرہ نہیں ہوتا۔ دورِ رسالت کے عمل کو دیکھتے ہوئے زیادہ سے زیادہ یہ کہا جا سکتا ہے کہ حکومت ایسی چیزوں کے عشر لینے کا اہتمام کرے جن کا ذخیرہ کر سکے، باقی باغوں اور کھیتوں والے اﷲ کا حق خود مستحقین میں تقسیم کر دیں۔ فتاویٰ علمائے حدیث کی ساتویں جلد میں متعدد جلیل القدر علماء کے مقالات میں ہر پھل اور کھیتی میں سے عشر کی بات نہایت مفصل اور مدلل بیان کی گئی ہے۔ ¤ ➍ {’’ وَ لَا تُسْرِفُوْا ‘‘} سے مراد ناجائز جگہ خرچ کرنا بھی ہے اور اعتدال سے بڑھ کر خرچ کرنا بھی، اسی طرح کھانے میں زیادتی بھی منع ہے، جیسا کہ فرمایا : «وَ كُلُوْا وَ اشْرَبُوْا وَ لَا تُسْرِفُوْا» [ الأعراف : ۳۱ ] ’’اور کھاؤ اور پیو اور حد سے نہ گزرو۔‘‘ حافظ ابن کثیر رحمہ اللہ کے مطابق یہ آخری معنی یہاں زیادہ موزوں ہے، اس لیے بھی کہ یہ جسم اور عقل دونوں کے لیے نقصان دہ ہے۔ اتنا صدقہ کرنا بھی اسراف ہے کہ اس کے بعد آدمی خود محتاج ہو کر مانگنے پر مجبور ہو جائے۔ یہ حکم حکمرانوں کے لیے بھی ہے کہ جتنا کسی کے ذمے بنتا ہے اس سے زیادہ وصول نہ کریں۔"
    },
    {
      "ayah": 142,
      "tafsir": "(آیت 142){ وَ مِنَ الْاَنْعَامِ حَمُوْلَةً وَّ فَرْشًا:} { ’’ حَمُوْلَةً ‘‘} جن پر بوجھ لادا جاتا ہے، مثلاً اونٹ اور بیل اور {’’ فَرْشًا ‘‘} سے مراد زمین سے لگے ہوئے، جیسے بھیڑ اور بکری۔ (موضح) جیسا کہ اگلی آیات میں ان کی تصریح ہے۔ بیل کی پشت پر اگرچہ بوجھ نہیں لادا جاتا مگر وہ بہت بھاری بوجھ کھینچ کر لے جاتے ہیں، اسے بھی بوجھ لادنا کہہ لیتے ہیں۔ اﷲ تعالیٰ نے یہ کھیت اور چوپائے جو تمھیں عطا کیے ہیں تمھارے لیے حلال ہیں، انھیں کھاؤ اور شیطان کی پیروی مت کرو، جس کے بہکانے پر جاہل مشرکوں نے ان میں سے کئی قسموں کو حرام کر رکھا ہے، جیسا کہ اوپر گزرا۔"
    },
    {
      "ayah": 143,
      "tafsir": "(آیت 144،143) ➊ {ثَمٰنِيَةَ اَزْوَاجٍ:} یہ آیت (۱۴۱) میں {’’ اَنْشَاَ ‘‘} کا مفعول بہ ہے۔ {’’ اَزْوَاجٍ ‘‘’’ زَوْجٌ ‘‘} کی جمع ہے۔ عربی میں جوڑے کے دو افراد میں سے ہر ایک کو زوج کہتے ہیں، نر ہو یا مادہ۔ اس لیے زوجین کا معنی ( نر اور مادہ دو قسمیں) ایک جوڑا ہو گا نہ کہ دو جوڑے۔ اسی کے مطابق ترجمہ آٹھ قسمیں کیا گیا ہے۔ ¤ ➋ {قُلْ ءٰٓالذَّكَرَيْنِ۠ حَرَّمَ …… : } جب مشرکین نے اونٹوں، گائیوں اور بھیڑ بکریوں میں سے بعض مخصوص جانوروں کو حرام اور ان کے پیٹ کے بچوں میں سے زندہ بچوں کو عورتوں کے لیے حرام اور مردہ کو سب کے لیے حلال قرار دیا تو اﷲ تعالیٰ اب ان سے اس کی دلیل کا مطالبہ فرما رہے ہیں کہ اگر وہ دلیل عقلی ہے تو بتاؤ کہ حرام ہونے کی وجہ ان دونوں کا نر ہونا ہے، اگر یہ وجہ ہے تو پھر ان میں سے کئی نر تم کیوں کھاتے ہو؟ یا مادہ ہونا ہے تو پھر تم ان میں سے کئی مادہ جانور حلال کیوں سمجھتے ہو؟ یا پیٹ کا بچہ ہونا ہے تو تم کئی پیٹ کے بچے خود کیوں کھاتے ہو اور اگر دلیل نقلی ہے تو اﷲ تعالیٰ کا کوئی حکم لاؤ جس میں اس نے ان جانوروں کے کسی نر یا مادہ یا رحم میں موجود بچے کو تمھارے کہنے کے مطابق حلال یا حرام کہا ہو، یا تم خود اس وقت موجود تھے جب اﷲ تعالیٰ نے حلال یا حرام کرنے کا یہ حکم جاری فرمایا؟ پھر بتاؤ اس سے بڑا ظالم کون ہے جس نے نہ خود سنا، نہ کسی رسول کے واسطے سے سنا بلکہ اپنی طرف سے اﷲ تعالیٰ پر جھوٹ باندھ رہا ہے۔ نبی صلی اللہ علیہ وسلم نے فرمایا : ’’میں نے عمرو بن لُحَیّ کو جہنم میں اپنی انتڑیاں کھینچتے ہوئے دیکھا، سب سے پہلے بتوں کے نام پر جانور (بحیرہ، سائبہ، وصیلہ اور حامی) اسی نے چھوڑے تھے۔‘‘[ بخاری، التفسیر، باب : « ما جعل اﷲ من بحيرة ولا سائبة……» : ۴۶۲۳ ] ¤ مقصود مشرکین کے خود ساختہ حرام کیے ہوئے جانوروں کی حرمت کی تردید ہے کہ بحیرہ اور سائبہ وغیرہ جانوروں کو انھوں نے اپنی طرف سے حرام کر رکھا ہے، ورنہ اﷲ تعالیٰ نے یہ جانور حلال کیے ہیں۔ ¤ ➌ { وَ مِنَ الْاِبِلِ اثْنَيْنِ وَ مِنَ الْبَقَرِ اثْنَيْنِ :} ہرن بکری کی جنس میں داخل ہے اور بھینس، نیل گائے اور گورخر (جنگلی گدھا) یہ گائے اور بیل کی جنس ہیں۔ یہ جانور عرب میں اتنے نہیں ہوتے۔ چوپاؤں کی مشہور چار قسمیں وہی ہیں جو یہاں مذکور ہیں۔"
    },
    {
      "ayah": 144,
      "tafsir": "(آیت 144،143) ➊ {ثَمٰنِيَةَ اَزْوَاجٍ:} یہ آیت (۱۴۱) میں {’’ اَنْشَاَ ‘‘} کا مفعول بہ ہے۔ {’’ اَزْوَاجٍ ‘‘’’ زَوْجٌ ‘‘} کی جمع ہے۔ عربی میں جوڑے کے دو افراد میں سے ہر ایک کو زوج کہتے ہیں، نر ہو یا مادہ۔ اس لیے زوجین کا معنی ( نر اور مادہ دو قسمیں) ایک جوڑا ہو گا نہ کہ دو جوڑے۔ اسی کے مطابق ترجمہ آٹھ قسمیں کیا گیا ہے۔ ¤ ➋ {قُلْ ءٰٓالذَّكَرَيْنِ۠ حَرَّمَ …… : } جب مشرکین نے اونٹوں، گائیوں اور بھیڑ بکریوں میں سے بعض مخصوص جانوروں کو حرام اور ان کے پیٹ کے بچوں میں سے زندہ بچوں کو عورتوں کے لیے حرام اور مردہ کو سب کے لیے حلال قرار دیا تو اﷲ تعالیٰ اب ان سے اس کی دلیل کا مطالبہ فرما رہے ہیں کہ اگر وہ دلیل عقلی ہے تو بتاؤ کہ حرام ہونے کی وجہ ان دونوں کا نر ہونا ہے، اگر یہ وجہ ہے تو پھر ان میں سے کئی نر تم کیوں کھاتے ہو؟ یا مادہ ہونا ہے تو پھر تم ان میں سے کئی مادہ جانور حلال کیوں سمجھتے ہو؟ یا پیٹ کا بچہ ہونا ہے تو تم کئی پیٹ کے بچے خود کیوں کھاتے ہو اور اگر دلیل نقلی ہے تو اﷲ تعالیٰ کا کوئی حکم لاؤ جس میں اس نے ان جانوروں کے کسی نر یا مادہ یا رحم میں موجود بچے کو تمھارے کہنے کے مطابق حلال یا حرام کہا ہو، یا تم خود اس وقت موجود تھے جب اﷲ تعالیٰ نے حلال یا حرام کرنے کا یہ حکم جاری فرمایا؟ پھر بتاؤ اس سے بڑا ظالم کون ہے جس نے نہ خود سنا، نہ کسی رسول کے واسطے سے سنا بلکہ اپنی طرف سے اﷲ تعالیٰ پر جھوٹ باندھ رہا ہے۔ نبی صلی اللہ علیہ وسلم نے فرمایا : ’’میں نے عمرو بن لُحَیّ کو جہنم میں اپنی انتڑیاں کھینچتے ہوئے دیکھا، سب سے پہلے بتوں کے نام پر جانور (بحیرہ، سائبہ، وصیلہ اور حامی) اسی نے چھوڑے تھے۔‘‘[ بخاری، التفسیر، باب : « ما جعل اﷲ من بحيرة ولا سائبة……» : ۴۶۲۳ ] ¤ مقصود مشرکین کے خود ساختہ حرام کیے ہوئے جانوروں کی حرمت کی تردید ہے کہ بحیرہ اور سائبہ وغیرہ جانوروں کو انھوں نے اپنی طرف سے حرام کر رکھا ہے، ورنہ اﷲ تعالیٰ نے یہ جانور حلال کیے ہیں۔ ¤ ➌ { وَ مِنَ الْاِبِلِ اثْنَيْنِ وَ مِنَ الْبَقَرِ اثْنَيْنِ :} ہرن بکری کی جنس میں داخل ہے اور بھینس، نیل گائے اور گورخر (جنگلی گدھا) یہ گائے اور بیل کی جنس ہیں۔ یہ جانور عرب میں اتنے نہیں ہوتے۔ چوپاؤں کی مشہور چار قسمیں وہی ہیں جو یہاں مذکور ہیں۔"
    },
    {
      "ayah": 145,
      "tafsir": "(آیت 145) ➊ {قُلْ لَّاۤ اَجِدُ فِيْ مَاۤ اُوْحِيَ …… :} مردہ سے مراد ہر وہ حلال جانور ہے جو بغیر ذبح کیے طبعی طور پر یا حادثے سے ( جس کی تفصیل مائدہ کی آیت ۳ میں ہے) مر جائے یا شرعی طریقے کے خلاف ذبح کیا گیا ہو، مثلاً جان بوجھ کر تیز دھار آلے کی ایک ہی ضرب سے گردن جدا کر دی جائے، یا سخت گرم پانی میں ڈبو کر مار دیا جائے، یا کرنٹ وغیرہ کے ذریعے سے غرض شرعی ذبیحہ یا شکار کے علاوہ سب مردار ہیں اور حرام ہیں۔ خون جو بہایا جائے، زندہ کا یا ذبیحہ کا، حرام ہے، البتہ جسم کے ساتھ لگا رہ جانے والا خون یا کلیجی اور تلی بہایا ہوا خون نہ ہونے کی وجہ سے حلال ہیں۔ خنزیر کا گوشت کہ وہ گندگی ہے، یعنی صحت کے لحاظ سے بے شمار بیماریوں کا باعث ہونے اور بے غیرتی میں بد ترین جانور ہونے کی وجہ سے کھانے والوں میں اس کی تاثیر کی بنا پر معنوی طور پر سراسر گندگی ہے۔ {’’ اَوْ فِسْقًا ‘‘} اس کا عطف {’’ لَحْمَ خِنْزِيْرٍ ‘‘} پر ہے، یعنی یہ بھی اسی طرح حرام ہے۔ {’’ فِسْقًا ‘‘} کا معنی اﷲ کی فرماں برداری سے نکل جانا ہے۔ اﷲ کا حکم ہے کہ جانور اﷲ کے نام پر ذبح کیا جائے، اس لیے وہ جانور جس پر ذبح کرتے وقت غیر اﷲ کا نام پکارا جائے، حرام ہے۔{ ’’ اُهِلَّ ‘‘} کا معنی آواز بلند کرنا ہے، کسی جانور پر اگر کسی غیر اﷲ کانام مشہور کر دیا جائے کہ یہ داتا کا بکرا ہے، یا بری امام کی گائے ہے، یا فلاں پیر یا امام کی نذر و نیاز ہے، اس سے مقصود چونکہ غیر اﷲ کو راضی کرنا ہے کہ وہ راضی ہو کر ہمارے کام سنوار دیں گے، اس لیے ایسے جانور کو ان کی رضا کے لیے ذبح کرتے وقت اس پر ’’ بسم اﷲ ‘‘ بھی پڑھی جائے تو بھی حرام ہے، کیونکہ اعتبار نیت کا ہے اور نیت کا اظہار خود ان کی زبانی ہو چکا ہے اور عرس اور قبر کا ماحول بھی اس پر دلالت کرتا ہے۔ ¤ ➋ { فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ …… : } یعنی جو شخص مجبوری کی بنا پر ان حرام چیزوں کو کھا لے بشرطیکہ نہ انھیں حلال سمجھے اور نہ ضرورت سے آگے بڑھے تو تیرا رب نہایت بخشنے والا بے حد رحم والا ہے۔ سورۂ بقرہ میں صراحت ہے : «فَلَاۤ اِثْمَ عَلَيْهِ » [البقرۃ : ۱۷۳ ] ’’اس پر کوئی گناہ نہیں۔ ‘‘ ¤ ➌ اس آیت پر ایک اشکال وارد ہوتا ہے کہ حرام چیزیں تو ان کے علاوہ بھی ہیں، پھر یہ فرمانے کا کیا مطلب کہ میں اپنی طرف کی ہوئی وحی میں ان کے علاوہ کسی کھانے والے پر کوئی چیز حرام نہیں پاتا؟ اس کا جواب سورۂ بقرہ کی آیت(۱۷۳) کی تفسیر میں گزر چکا ہے، خلاصہ یہ ہے کہ دراصل اس زمانے کے مشرکین کے لحاظ سے بات ہو رہی ہے کہ انھوں نے بحیرہ، سائبہ وغیرہ کو حرام کر رکھا تھا اور مذکورہ بالا چاروں چیزیں وہ حلال سمجھتے اور کھاتے تھے، اس لیے فرمایا کہ میری وحی میں تو تمھاری حرام کردہ چیزیں حرام نہیں، صرف یہ چار چیزیں، جو تم بے دریغ کھاتے ہو، حرام ہیں۔ دوسرا جواب اس کا یہ ہے کہ ان آیات کے اترنے تک یہی چیزیں حرام تھیں، بعد میں رسول اﷲ صلی اللہ علیہ وسلم نے مزید کئی چیزیں حرام فرمائیں، جیسے قرآن مجید میں وہ رشتے مذکور ہیں جن سے نکاح حرام ہے، باقی سب کو حلال فرمایا، مگر رسول اﷲ صلی اللہ علیہ وسلم نے حدیث میں ان دو عورتوں کو جو آپس میں خالہ اور بھانجی یا پھوپھی اور بھتیجی ہوں، ایک شخص کے نکاح میں جمع کرنے سے منع فرمایا۔ اسی طرح نبی صلی اللہ علیہ وسلم سے صحیح احادیث میں مزید کئی جانوروں کو حرام قرار دینا ثابت ہے۔ دیکھیے سورۂ بقرہ (۱۷۳) کے حواشی۔"
    },
    {
      "ayah": 146,
      "tafsir": "(آیت 146) ➊ {وَ عَلَى الَّذِيْنَ هَادُوْا حَرَّمْنَا كُلَّ ذِيْ ظُفُرٍ ……:} ہر ناخن والے جانور سے مراد وہ جانور یا پرندہ ہے جس کی انگلیاں پھٹی ہوئی، یعنی الگ الگ نہ ہوں، مثلاً اونٹ، شتر مرغ، بطخ وغیرہ، یعنی صرف وہ پرندے یا جانور حلال تھے جن کے پنجے کھلے ہوں۔ ¤ ➋ { اَوِ الْحَوَايَاۤ :} یہ {’’حَوِيَّةٌ ‘‘} کی جمع ہے جیسے {’’عِطْيَةٌ‘‘} کی جمع {’’عَطَايَا‘‘} اور {’’خَطِيَّةٌ‘‘} کی جمع {’’خَطَايَا‘‘} ہے، یا یہ {’’ حَاوِيَةٌ ‘‘} کی جمع ہے، جیسے{ ’’ ضَارِبَةٌ ‘‘ } کی جمع{ ’’ ضَوَارِبٌ ‘‘} مطلب وہ انتڑیاں جن میں مینگنیاں ہوتی ہیں۔ ¤ ➌ { ذٰلِكَ جَزَيْنٰهُمْ بِبَغْيِهِمْ وَ اِنَّا لَصٰدِقُوْنَ:} یعنی یہ چیزیں جس طرح اب شریعت محمدی صلی اللہ علیہ وسلم میں حرام نہیں ہیں اس سے پہلے بھی حرام نہ تھیں، البتہ یہودیوں کو ان کی سرکشی کی سزا دینے کے لیے ہم نے انھیں وقتی طور پر حرام کر دیا تھا۔ (دیکھیے نساء : ۱۶۰) مقصد یہودیوں کے اس دعوے کی تردید ہے کہ اﷲ تعالیٰ نے ہم پر کوئی چیز حرام نہیں کی، سوائے ان چیزوں کے جو اسرائیل (یعقوب علیہ السلام ) نے خود اپنے آپ پر حرام کر لی تھیں۔ (قرطبی۔ ابن کثیر) اور {’’ اِنَّا لَصٰدِقُوْنَ ‘‘} (بلاشبہ ہم یقینا سچے ہیں) کا مطلب یہ ہے کہ یہود کا یہ دعویٰ غلط ہے اور صحیح بات وہ ہے جو ہم نے بیان کی ہے، نیز دیکھیے سورۂ آل عمران (۹۳)۔ ¤ مگر یہودیوں نے حیلے سے چربی کی ایک صورت حلال کر ہی لی۔ جابر رضی اللہ عنہ فرماتے ہیں کہ میں نے رسول اﷲ صلی اللہ علیہ وسلم سے فتح مکہ کے سال مکہ میں سنا، آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اﷲ یہود کو برباد کرے، جب ان کے لیے چربیوں کو حرام کیا گیا تو انھوں نے انھیں پگھلایا اور پپھر ان کی قیمت کھا گئے۔‘‘ [ بخاری، البیوع، باب بیع المیتۃ والأصنام : ۲۲۳۶ ] یہ ایسے ہی ہے جیسے آج کل کئی مسلمان شراب خود نہیں پیتے اور خنزیر کا گوشت وغیرہ خود نہیں کھاتے، مگر کفار کے ہاتھوں بیچ کر قیمت کھا جاتے ہیں۔"
    },
    {
      "ayah": 147,
      "tafsir": "(آیت 147) {فَإِنْ كَذَّبُوكَ …… :} یعنی اگر تم اب بھی نافرمانی کی روش چھوڑ کر حق کی سیدھی راہ اختیار کر لو تو اپنے رب کے دامنِ رحمت کو اپنے لیے کھلا پاؤ گے، لیکن اگر اپنی موجودہ روش پر اڑے رہے تو یہ مت سمجھو کہ اﷲ کا عذاب تم پر سے ٹل گیا ہے، جب اس کا عذاب آتا ہے تو مجرموں اور سرکشوں کو کوئی چیز اس سے بچا نہیں سکتی۔ اﷲ تعالیٰ کے ہاں دیر ہے اندھیر نہیں۔ آیت کے پہلے حصے {’’ ذُوْ رَحْمَةٍ وَّاسِعَةٍ ‘‘} میں ترغیب (شوق دلانا) ہے اور آخری حصہ {’’ وَ لَا يُرَدُّ بَاْسُهٗ ‘‘} میں ترہیب ( ڈرانا) ہے اور یہ قرآن کا خاص اندازِ نصیحت ہے۔ (ابن کثیر)"
    },
    {
      "ayah": 148,
      "tafsir": "(آیت 148) ➊ { سَيَقُوْلُ الَّذِيْنَ اَشْرَكُوْا …… :} یعنی جب وہ اپنے شرک اور مجرمانہ روش پر قائم رہنے کی دلیل نہیں پاتے تو تقدیر کا سہارا لے کر کہتے ہیں کہ ہمارے حق میں خود اﷲ کی مرضی اور ارادہ یہ ہے کہ ہم شرک کریں اور جو چیزیں ہم نے حرام ٹھہرائی ہیں انھیں حرام ٹھہرائیں، کیونکہ اگر اﷲ تعالیٰ کی مرضی نہ ہوتی تو ہم سے یہ کام ہو ہی نہیں سکتے تھے، یہ دلیل ہے کہ ہم جو کچھ کر رہے ہیں اس پر اﷲ تعالیٰ خوش ہے، لہٰذا یہ صحیح اور حق ہے۔ مطلب یہ کہ انھوں نے اﷲ کی مشیت، مرضی اور ارادے کو شرک کے اور بعض حلال چیزوں کو حرام ٹھہرا لینے کے صحیح اور حق ہونے کے لیے دلیل کے طور پر پیش کیا، گویا ان کے کہنے کے مطابق اﷲ تعالیٰ کے ارادے اور مشیت کا مطلب یہ ہے کہ اﷲ تعالیٰ ان کاموں پر خوش ہے اور انھیں پسند کرتا ہے اور وہ درست ہیں، حالانکہ یہ دونوں چیزیں لازم و ملزوم نہیں، اﷲ تعالیٰ نے فرمایا : «اِنْ تَكْفُرُوْا فَاِنَّ اللّٰهَ غَنِيٌّ عَنْكُمْ وَ لَا يَرْضٰى لِعِبَادِهِ الْكُفْرَوَ اِنْ تَشْكُرُوْا يَرْضَهُ لَكُمْ » [ الزمر: ۷ ]’’ اگر تم ناشکری کرو تو یقینا اﷲ تم سے بہت بے پروا ہے اور وہ اپنے بندوں کے لیے ناشکری پسند نہیں کرتا اور اگر تم شکر کرو تو وہ اسے تمھارے لیے پسند کرے گا۔‘‘ یعنی کفر اور ناشکری اﷲ کے ارادے کے بغیر نہیں ہو سکتی مگر وہ نہ اس پر راضی ہے نہ اسے پسند کرتا ہے۔ مشیت و ارادہ اور رضا و محبت ایک دوسرے کو لازم نہیں، دنیا میں جو کچھ ہو رہا ہے وہ اﷲ تعالیٰ کی مشیت اور ارادے کے تحت ہو رہا ہے لیکن وہ ہر چیز پر راضی نہیں ہے رضا اس کی شریعت کی پابندی کا نام ہے اور ارادہ و مشیت اس کی تکوین ہے یعنی اس کا کائنات کو چلانے کا نظام ہے۔ تکوینی طور پر وہ کیا چاہتا ہے اسے کوئی نہیں جانتا اور نہ جان سکتا ہے، تشریعی طور پر وہ کس چیز کو پسند کرتا ہے یہ بتانے کے لیے اس نے پیغمبر بھیجے اور ہر شخص اسے جان سکتا ہے اس لیے ہم شریعت پر عمل کے پابند ہیں۔ ¤ ➋ {كَذٰلِكَ كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ:} یعنی در حقیقت یہ بات کہنا اور اﷲ کی تقدیر اور مشیت کو اس کے خوش ہونے کی دلیل قرار دینا اﷲ تعالیٰ اور اس کے رسولوں کی تکذیب (جھٹلانا) ہے۔ ان سے پہلے لوگ بھی اسی بہانے کو بنیاد بنا کر رسولوں کو جھٹلاتے آئے ہیں۔ ¤ ➌ { حَتّٰى ذَاقُوْا بَاْسَنَا:} یعنی ان کا یہ عذر قطعی غلط اور بے بنیاد ہے۔ اگر یہ صحیح ہوتا تو ان سے پہلے لوگوں پر ان کے جرائم اور تکذیب کی وجہ سے اﷲ تعالیٰ اپنا عذاب کیوں نازل کرتا؟ (ابن کثیر) ¤ ➍ {قُلْ هَلْ عِنْدَكُمْ مِّنْ عِلْمٍ …… : } یعنی تم جو یہ عذر پیش کر رہے ہو وہ کسی عقلی یا علمی بنیاد پر قائم نہیں ہے، اگر تمھارے پاس علم کی کوئی بات ہے تو لاؤ اور پیش کرو۔ کبھی دنیا کی کسی چیز کے حاصل کرنے کے لیے بھی تم نے تقدیر کو بہانہ بنا کر جدوجہد کو ترک کیا ہے، یا اﷲ تعالیٰ نے تمھیں پہلے بتا دیا ہے کہ میں نے آئندہ اس طرح کرنا ہے۔ جب تمھیں معلوم ہی نہیں کہ تقدیر میں کیا ہے تو یہ بہانہ یا شبہ محض تمھارا وہم و گمان ہے اور تم لوگ صرف اٹکل لگا کر اﷲ تعالیٰ پر بہتان باندھ رہے ہو، جب کہ حقیقت کی دنیا میں وہم و گمان کی کچھ حیثیت نہیں۔ دیکھیے سورۂ نجم(۲۳ اور ۲۸)۔"
    },
    {
      "ayah": 149,
      "tafsir": "(آیت 149){ قُلْ فَلِلّٰهِ الْحُجَّةُ الْبَالِغَةُ …… :} آپ ان سے کہہ دیں کہ پھر کامل دلیل تو اﷲ تعالیٰ ہی کی ہے جو واقع کے عین مطابق ہے کہ اس کی مشیت، ارادہ اور اختیار الگ چیز ہے اور کسی کام پر راضی اور خوش ہونا الگ چیز ہے اور اس میں اس کی حکمت ہے کہ اس نے تمھیں ہدایت اور گمراہی کا اختیار دے کر آزمایا ہے، اگر وہ چاہتا تو تم سب کو ہدایت دے دیتا، پھر کوئی گمراہ ہو ہی نہیں سکتا تھا، مگر یہ جبر ہوتا، جو اس کی حکمت کا تقاضا نہیں ہے۔ دیکھیے سورۂ ھود (۱۱۸، ۱۱۹) اور سورۂ یونس(۹۹)۔"
    },
    {
      "ayah": 150,
      "tafsir": "(آیت 150) ➊ {فَلَا تَشْهَدْ مَعَهُمْ:} کیونکہ جو بھی یہ گواہی دے گا وہ کبھی سچا نہیں ہو سکتا۔ ¤ ➋ {وَ هُمْ بِرَبِّهِمْ يَعْدِلُوْنَ:} یعنی وہ مخلوق کو رب کے برابر ٹھہرا کر شرک جیسے ظلم عظیم کے مرتکب ہوتے ہیں، خواہ کسی طرح برابر ٹھہرائیں، حالانکہ رب تعالیٰ کے ساتھ کسی کی برابری ہو ہی نہیں سکتی، نہ ذات میں، نہ صفات میں، نہ علم میں، نہ حقوق و اختیار میں اور نہ کسی اور چیز میں، تو پھر ایسے جاہلوں کی خواہشات کی پیروی آپ کیوں اختیار کریں؟ دیکھیے سورۂ رعد (۱۶) اور سورۂ شعراء (۹۱ تا ۹۸)۔"
    },
    {
      "ayah": 151,
      "tafsir": "(آیت 151) ➊ { قُلْ تَعَالَوْا اَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ:} اب اﷲ تعالیٰ تفصیل سے بیان فرماتے ہیں کہ حرام وہ نہیں جو تم نے اپنی مرضی سے حرام بنا لیا، بلکہ وہ ہے جو تمھیں پیدا کرنے والے اور ہر لمحے پالنے والے نے تم پر حرام کیا ہے، آؤ! میں خود وہ تم سے بیان کرتا ہوں۔ یہ دس احکام ہیں جو اسلام کا خلاصہ ہیں۔ ¤ ➋ { اَلَّا تُشْرِكُوْا بِهٖ شَيْـًٔا: } یہاں بیان تو وہ چیزیں کرنی تھیں جو اﷲ تعالیٰ نے حرام فرمائی ہیں، مگر بیان وہ چیزیں فرمائی ہیں جن کا نہایت تاکید کے ساتھ حکم ہے۔ مطلب یہ ہے کہ اﷲ تعالیٰ کے حرام کرنے سے تمھارے لیے جو حکم تاکید کے ساتھ ثابت ہوتے ہیں وہ یہ ہیں۔ گویا یہ مفہوم {’’ حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ‘‘} کے ضمن ہی میں شامل ہے کہ یہاں {’’ وَصَّاكُمْ بِهِ ‘‘} محذوف ہے، یعنی اس نے تمھیں تاکیداً حکم دیا ہے کہ اس کے ساتھ کسی چیز کو شریک نہ کرو، اس کی دلیل یہاں مذکور تینوں آیات کے آخری الفاظ ہیں : «ذٰلِكُمْ وَصّٰىكُمْ بِهٖ » یعنی یہ ہے جس کا تاکیدی حکم اس نے تمھیں دیا ہے۔ اگر مراد ہوتا کہ یہ چیزیں حرام کی ہیں تو آخر میں یہ الفاظ ہونے چاہیے تھے : {’’ ذٰلِكُمْ حَرَّمَ عَلَيْكُمْ ‘‘ } یعنی یہ ہیں وہ چیزیں جو اس نے تم پر حرام کی ہیں۔ اﷲ تعالیٰ نے سب سے پہلا تاکیدی حکم یہ دیا کہ اس کے ساتھ کسی چیز کو شریک نہ ٹھہراؤ، نہ کسی انسان کو، نہ کسی جن کو، نہ کسی فرشتے کو، نہ کسی پہاڑ، پتھر، دریا یا درخت کو۔ غرض کوئی چیز کتنی بھی عظیم الشان ہو اسے اﷲ کا کسی بھی چیز میں شریک مت بناؤ، کیونکہ سب اﷲ کے پیدا کردہ ہیں۔ رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’سب سے بڑا گناہ یہ ہے کہ تم اﷲ کا شریک بناؤ، حالانکہ اس نے تمھیں پیدا کیا۔‘‘ [ بخاری، التفسیر، باب : ۴۴۷۷ ] ¤ اﷲ تعالیٰ نے فرمایا : ’’بے شک اﷲ اس بات کو نہیں بخشے گا کہ اس کا شریک بنایا جائے اور بخش دے گا جو اس کے علاوہ ہے جسے چاہے گا۔‘‘ [ النساء : ۱۱۶ ] اور اﷲ تعالیٰ نے مسیح علیہ السلام کا قول ذکر فرمایا کہ جو بھی اﷲ کے ساتھ شریک بنائے سو یقینا اﷲ نے اس پر جنت حرام کر دی۔ [ المائدۃ : ۷۲ ] ¤ ➌ { وَ بِالْوَالِدَيْنِ۠ اِحْسَانًا: ’’ اِحْسَانًا ‘‘} فعل محذوف {’’ اَحْسِنُوْا ‘‘ } کا مفعول مطلق ہے جس سے مقصود تاکید ہے، اس لیے ترجمہ ’’خوب احسان کرو‘‘ کیا ہے۔ قرآن مجید کی متعدد آیات میں جہاں اﷲ تعالیٰ کی عبادت کرنے اور شرک سے بچنے کا حکم دیا گیا ہے وہاں والدین کے ساتھ نیک سلوک کرنے کی بھی تاکید کی گئی ہے، کیونکہ والدین کو اﷲ تعالیٰ نے تکلیف پر تکلیف اٹھا کر ولادت اور دلی محبت کے ساتھ پالنے کا ذریعہ بنایا ہے۔ ان آیات سے صاف ظاہر ہوتا ہے کہ اﷲ اور اس کے رسول صلی اللہ علیہ وسلم کے بعد بندوں کے حقوق میں سے سب سے مقدم حق انسان پر اس کے والدین کا ہے۔ دیکھیے سورۂ بنی اسرائیل (۲۳) اور سورۂ لقمان (۱۴، ۱۵) ¤ ➍ {وَ لَا تَقْتُلُوْۤا اَوْلَادَكُمْ مِّنْ اِمْلَاقٍ …… : } پیدا ہو چکنے کے بعد یا جب کہ وہ ماؤں کے پیٹ میں ہوں، مثلاً کوئی دوا کھلا کر قبل از وقت حمل گرا دینا۔ سورۂ بنی اسرائیل (۳۱) میں بھی یہی حکم دیا گیا ہے، مگر یہاں اور وہاں دو فرق ہیں، یہاں {’’مِنْ اِمْلَاقٍ‘‘} (مفلسی کی وجہ سے) ہے اور وہاں{’’ خَشْيَةَ اِمْلَاقٍ ‘‘ } (مفلسی کے ڈر سے) ہے۔ اسی طرح یہاں {’’ نَحْنُ نَرْزُقُكُمْ وَ اِيَّاهُمْ ‘‘} (ہم ہی تمھیں رزق دیتے ہیں اور ان کو بھی) ہے اور وہاں{ ’’ نَحْنُ نَرْزُقُهُمْ وَ اِيَّاكُمْ ‘‘} ’’ہم ہی انھیں رزق دیتے ہیں اور تمھیں بھی‘‘ ہے۔ اس کی وجہ یہ معلوم ہوتی ہے کہ اس مقام پر ان لوگوں کی بات ہے جو مفلسی میں گرفتار ہیں۔ فرمایا کہ اس مفلسی میں انھیں قتل مت کرو، ہم مفلسی کے باوجود تمھیں جو روزی دیتے ہیں انھیں بھی دیں گے، جبکہ بنی اسرائیل میں ان لوگوں کا ذکر ہے جو مفلسی میں مبتلا تو نہیں مگر بچوں کے پیدا ہونے پر مفلسی سے ڈر رہے ہیں، فرمایا کہ ڈرو نہیں ہم انھیں بھی روزی دیں گے، تمھیں بھی تو دے رہے ہیں۔ خلاصہ یہ کہ تمھارا یہ سمجھنا کہ روزی کے مالک تم خود ہو، بالکل غلط ہے، یہ ہمارا کام اور ہمارا ذمہ ہے۔ (دیکھیے ہود : ۶) کفار کا تو کہنا ہی کیا ہے، اس وقت مسلم حکومتیں اسی بہانے سے ضبطِ و ولادت یا خاندانی منصوبہ بندی کے نام پر منظم طریقے سے قتل اولاد کا جرم کر رہی ہیں کہ ہمارے پاس وسائل کم ہیں، ہم زیادہ آبادی کی خوراک کا بندوبست نہیں کر سکتے، حالانکہ یہ کفر کا کلمہ ہے۔ خوراک کا بندوبست تو اﷲ تعالیٰ کے ذمے ہے، بلکہ ان حکمرانوں کا تمام عیش ان مفلسوں کی محنت ہی کا نتیجہ ہے، جن کی خوراک کے وہ ذمہ دار بن رہے ہیں۔ ہر بچے کو اﷲ تعالیٰ کھانے کے لیے ایک منہ اور کمانے کے لیے دو ہاتھ دے کر بھیجتا ہے اور جیسے جیسے آبادی بڑھ رہی ہے زمین کے خزانوں کے منہ کھلتے جا رہے ہیں۔ دیکھیے سورۂ حجر (۱۹ تا ۲۲)۔ ¤ ➎ {وَ لَا تَقْرَبُوا الْفَوَاحِشَ …… : ’’ اَلْفَاحِشَةُ ‘‘} ، {’’ اَلْفَحْشَاءُ ‘‘} اور {’’ اَلْفَحْشُ‘‘} کا معنی ہے ہر وہ قول یا فعل جو قباحت میں بہت بڑھا ہوا ہو، مثلاً زنا، شدید بخل وغیرہ۔ (راغب) اس لیے اس کا ترجمہ بے حیائی کرتے ہیں۔ اﷲ تعالیٰ نے ایسے ہر کام کو خواہ ظاہر ہو، جیسے سب کے سامنے زنا یا قوم لوط کی حرکتیں کرنا، یا پوشیدہ، مثلاً چھپ کر زنا اور چوری وغیرہ کرنا، انھیں حرام قرار دیا۔ اس مقام پر ایسے ہر کام کے قریب جانے کو بھی حرام قرار دیا، جیسا کہ سورۂ بنی اسرائیل (۳۲) میں زنا کے قریب جانے سے بھی منع فرمایا، کیونکہ قریب جانا ہی گناہ کے ارتکاب کا باعث بنتا ہے۔ ابن مسعود رضی اللہ عنہ فرماتے ہیں کہ رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’اﷲ تعالیٰ سے بڑھ کر کوئی غیرت والا نہیں، اسی لیے اس نے بے حیائی کی ظاہر اور پوشیدہ تمام شکلوں کو حرام قرار دیا ہے۔‘‘ [ بخاری، التفسیر، باب قولہ تعالٰی : «ولا تقربوا الفواحش …… » : ۴۶۳۴ ] ¤ ➏ {وَ لَا تَقْتُلُوا النَّفْسَ …… :} عبد اﷲ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’کسی مسلمان کا خون، جو اس بات کی شہادت دیتا ہو کہ اﷲ کے سوا کوئی معبود نہیں اور بے شک میں اﷲ کا رسول ہوں، تین صورتوں کے سوا کسی بھی صورت میں حلال نہیں :(1) جان کے بدلے جان (2) شادی شدہ زانی (3) دین سے جدا ہو کر ( مسلمانوں کی) جماعت کو ترک کر دینے والا۔‘‘ [ بخاری، الدیات، باب قول اﷲ تعالٰی : « إن النفس بالنفس والعين بالعين…… » : ۶۸۷۸ ] یا ان تینوں کے علاوہ جس کے قتل کرنے کا واضح حکم قرآن یا حدیث میں موجود ہو، مثلاً محارب (ڈاکو، باغی) یا محرم سے نکاح کرنے والا، انھیں قتل کرنا ناحق نہیں بلکہ حق ہے۔ ¤ ➐ {لَعَلَّكُمْ تَعْقِلُوْنَ:} تاکہ تم سمجھو، عقل کرو، کیونکہ یہ ایسے کام ہیں کہ ان کا ارتکاب عقل کی خست کی دلیل ہے اور ان کاموں کی قباحت عقل بھی محسوس کرتی ہے، نصیحت اس لیے ہے کہ تم عقل کے تقاضے کے مطابق چلو۔"
    },
    {
      "ayah": 152,
      "tafsir": "(آیت 152) ➊ {وَ لَا تَقْرَبُوْا مَالَ الْيَتِيْمِ ……:} ’’سب سے اچھے طریقے‘‘ میں یتیم کے مال کی حفاظت کرنا، اسے بڑھانے کے متعلق سوچنا، یتیموں کی بہتری کے سوا اسے خرچ کرنے سے بچنا وغیرہ سب شامل ہیں۔ {’’ حَتّٰى يَبْلُغَ اَشُدَّهٗ ‘‘} میں جوانی کے ساتھ سمجھ داری بھی شامل ہے کہ اس میں معاملات کو خود نپٹانے کی صلاحیت پیدا ہو جائے۔ دیکھیے سورۂ نساء ( ۶)۔ ¤ ➋ { وَ اَوْفُوا الْكَيْلَ:} اس میں انصاف کو ملحوظ رکھتے ہوئے دیتے وقت ماپ تول میں کمی نہ کرنا اور لیتے وقت زیادہ نہ لینا دونوں شامل ہیں۔ دیکھیے سورۂ مطففین (۱تا۳) سورۂ رحمان (۹) اور سورۂ بنی اسرائیل (۳۵)۔ ¤ ➌ {لَا نُكَلِّفُ نَفْسًا اِلَّا وُسْعَهَا:} یعنی اگر پورا تولنے اور ماپنے کی کوشش کرے مگر بھول چوک کی وجہ سے غلطی کر بیٹھے تو اس سے باز پرس نہیں ہو گی۔ {’’ اِلَّا وُسْعَهَا ‘‘} کا یہی مطلب ہے۔ ¤ ➍ {وَ اِذَا قُلْتُمْ فَاعْدِلُوْا …… :} جب بات کرو، خواہ فیصلہ کر رہے ہو یا حکم دے رہے ہو یا شہادت دے رہے ہو، تو ہر حال میں عدل و انصاف سے کام لو، کوئی رشتہ داری یا قرابت یا دوستی انصاف میں رکاوٹ نہ بننے پائے۔ دیکھیے سورۂ نساء (۱۳۵) اور سورۂ مائدہ (۸)۔ ¤ ➎ { وَ بِعَهْدِ اللّٰهِ اَوْفُوْا:} یعنی تم نے اسلام قبول کر کے اﷲ اور اس کے رسول کی اطاعت کا جو عہد کیا ہے وہ پورا کرو۔ اس سے مراد قرآن و سنت کے تمام احکام پر عمل کرنا ہے۔ لوگوں سے کیے ہوئے عہد پورا کرنے کا بھی اﷲ نے حکم دیا ہے۔ ¤ ➏ { لَعَلَّكُمْ تَذَكَّرُوْنَ:} اس آیت میں مذکور چیزیں ایسی ہیں جو معاشرے میں معروف ہیں، ان کی تاکید اس لیے کی ہے کہ تمھیں یاد آ جائے اور تمھیں نصیحت ہو جائے۔ {’’ ذِكْرٌ ‘‘} کا معنی ’’یاد‘‘ اور ’’نصیحت ‘‘ دونوں ہیں، جیسا کہ رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : [ فَإِذَا نَسِيْتُ فَذَكِّرُوْنِيْ ] [ بخاری، الصلوۃ، باب التوجہ نحو القبلۃ حیث کان : ۴۰۱ ] ’’جب میں بھول جاؤں تو مجھے یاد کروا دو۔‘‘"
    },
    {
      "ayah": 153,
      "tafsir": "(آیت 153) ➊ {وَ اَنَّ هٰذَا صِرَاطِيْ مُسْتَقِيْمًا …… :} یعنی اﷲ تعالیٰ کی راہ ایک ہی ہے اور وہی سیدھی اور جنت تک پہنچانے والی ہے، مگر شیطان نے لوگوں کو گمراہ کرنے کے لیے اس کے اردگرد بہت سی راہیں بنا ڈالی ہیں۔ عبد اﷲ بن مسعود رضی اللہ عنہ اور دیگر صحابہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے ہمارے لیے ایک لکیر کھینچی، اور فرمایا : ’’یہ اﷲ تعالیٰ کا سیدھا راستہ ہے۔‘‘ پھر اس کے دائیں بائیں کئی لکیریں کھینچیں اور فرمایا : ’’یہ الگ الگ راستے ہیں، ان میں سے ہر راہ پر ایک شیطان بیٹھا ہے جو لوگوں کو اپنی طرف بلاتا ہے۔‘‘ اس کے بعد آپ نے سیدھی راہ پر ہاتھ رکھا اور یہ آیت تلاوت فرمائی۔ [ أحمد : 465/1، ح : ۴۴۳۶۔ مستدرک حاکم : 318/2، ح : ۳۲۴۱ ] ¤ تمام دینوں میں سے صراط مستقیم صرف اسلام ہے، باقی سب باطل ہیں، اس آیت میں جس طرح تمام باطل دینوں سے منع فرمایا گیا ہے اسی طرح اسلام میں بھی فرقے بنانے سے روک دیا گیا ہے۔ اسلام میں سیدھی راہ صرف کتاب و سنت کی راہ ہے، جس پر وہ پہلے تین زمانے گزرے ہیں جنھیں رسول اﷲ صلی اللہ علیہ وسلم نے خیر الناس قرار دیا ہے۔ [ بخاری، فضائل أصحاب النبی صلی اللہ علیہ وسلم ، باب فضائل أصحاب النبی صلی اللہ علیہ وسلم : ۳۶۵۱ ] اس کے سوا سب راستے ممنوع ٹھہرے، خواہ وہ مذاہب اربعہ کی تقلید ہو یا اہل بدعت کے بنائے ہوئے اور طریقے ہوں، کیونکہ یہ شروع ہی بعد میں ہوئے ہیں۔ پرانی اور نئی ہر قسم کی بدعات گمراہ کن ہیں، خود ائمۂ دین اور سارے مجتہدینِ سلف و خلف نے یہی وصیت کی ہے کہ کوئی ان کی تقلید نہ کرے، بلکہ سب کے سب کتاب و سنت کی اتباع کریں، یہی صراط مستقیم ہے جس کی طرف اﷲ تعالیٰ نے دعوت دی ہے۔ ¤ ➋ {لَعَلَّكُمْ تَتَّقُوْنَ:} تاکہ تم اﷲ کی نافرمانی، اس کے عذاب اور جہنم سے بچ جاؤ، کیونکہ مختلف راستوں سے بچ کر اس کے سیدھے راستے پر چلنے کے سوا بچنے کی کوئی صورت نہیں، اس لیے تقویٰ کی راہ یہی ہے۔"
    },
    {
      "ayah": 1,
      "tafsir": "(آیت 154) ➊ { ثُمَّ اٰتَيْنَا مُوْسَى الْكِتٰبَ:} ’’پھر ہم نے موسیٰ کو کتاب دی‘‘ میں ’’پھر‘‘ کا لفظ زمانے کی ترتیب کے لیے نہیں کہ موسیٰ علیہ السلام کو کتاب بعد میں ملی، بلکہ بعد میں ذکر کی وجہ سے ہے، اسے ترتیب ذکری کہتے ہیں، مثلاً دیکھیے سورۂ بلد کی آیت (۱۷)۔ متعدد مقامات پر اﷲ تعالیٰ نے قرآن مجید اور تورات کا ذکر اکٹھا کیا ہے۔ (ابن کثیر) ¤ ➋ {تَمَامًا عَلَى الَّذِيْۤ اَحْسَنَ …… : ’’ تَمَامًا ‘‘} یہاں {’’ اِتْمَامًا ‘‘} ( پورا کرنے) کے مععنی میں ہے، یعنی ہم نے تورات ہر اس شخص پر نعمت پوری کرنے کے لیے جو نیکی کرے اور ہر چیز کی تفصیل، رہنمائی اور رحمت کے لیے نازل فرمائی اور اس کا مقصد یہ تھا کہ وہ یعنی بنی اسرائیل اپنے رب کی ملاقات پر ایمان لے آئیں۔"
    },
    {
      "ayah": 155,
      "tafsir": "(آیت 155){ وَ هٰذَا كِتٰبٌ …… :} اس سے مراد قرآن مجید ہے۔"
    },
    {
      "ayah": 156,
      "tafsir": "(آیت 156) {اَنْ تَقُوْلُوْۤا اِنَّمَاۤ اُنْزِلَ ……:} تاکہ تم یہ نہ کہہ سکو کہ ہماری طرف تو کوئی کتاب آئی ہی نہیں، کتاب تو صرف ہم سے پہلے دو گروہوں یہود و نصاریٰ پر اتری اور وہ صرف ان کے لیے تھی اور انھوں نے ہمیں دعوت بھی نہیں دی کہ ہم ان سے پڑھ کر ایمان لے آتے، بلکہ وہ اسے بنی اسرائیل ہی کے لیے قرار دیتے رہے، ہم بھی اسے ان کے ساتھ مخصوص سمجھ کر اور کچھ اپنی غفلت کی وجہ سے اسے پڑھنے سے بے خبر رہے، ورنہ زبان نہ جاننا تو کوئی معقول عذر نہیں کیونکہ جب معلوم ہو جائے کہ اﷲ کا حکم آیا ہے تو آدمی کسی سے سمجھ بھی سکتا ہے۔"
    },
    {
      "ayah": 157,
      "tafsir": "(آیت 157) ➊ {اَوْ تَقُوْلُوْا لَوْ اَنَّاۤ اُنْزِلَ ……:} یعنی یہ عذر بھی نہ کر سکو۔{ ’’ بَيِّنَةٌ ‘‘ } روشن دلیل سے مراد قرآن مجید ہے، جو صرف ہدایت اور رحمت ہی نہیں بلکہ اپنے سچے ہونے کی واضح اور روشن دلیل بھی ہے اور جو صرف عربوں کے لیے ہی نہیں بلکہ قیامت تک کے تمام لوگوں اور تمام اقوام کے لیے ہے اور وہ کسی سے عربی پڑھ کر اﷲ کے احکام معلوم کر سکتے ہیں، جیسا کہ اﷲ کے فضل سے تمام اقوام میں اسلام پھیل چکا ہے۔ ¤ ➋ {صَدَفَ عَنْهَا:} اس کے معنی کنارہ کرنے کے بھی ہیں اور دوسروں کو روکنے کے بھی۔ کفار خود بھی ایمان نہیں لاتے تھے اور دوسروں کو بھی روکتے تھے۔ دیکھیے سورۂ انعام (۲۶، ۲۷)۔"
    },
    {
      "ayah": 158,
      "tafsir": "(آیت 158) ➊ {هَلْ يَنْظُرُوْنَ اِلَّاۤ اَنْ تَاْتِيَهُمُ الْمَلٰٓىِٕكَةُ: } کفار پر اسلام کے حق ہونے کے دلائل تو پوری طرح واضح ہو چکے تھے، مگر وہ صرف لاجواب کرنے کے لیے ایسی چیزیں دکھانے کا مطالبہ کرتے رہتے تھے جن کا دنیا میں ہوتے ہوئے دکھایا جانا ممکن ہی نہیں، کیونکہ ان کے آنے کے بعد اپنے اختیار سے غیب پر ایمان کا موقع ہی باقی نہیں رہتا، نہ ان کے آنے کے بعد کسی کی مجال ہے کہ وہ ایمان نہ لائے، مگر اس وقت ایمان لانے کا کچھ فائدہ نہیں۔ ان مطالبات کا قرآن مجید میں متعدد مقامات پر ذکر کیا گیا ہے، جیسا کہ سورۂ بنی اسرائیل(۹۰ تا ۹۳) میں اکٹھے نو مطالبات پیش کیے گئے ہیں، جن میں نہایت گستاخانہ مطالبہ خود اﷲ تعالیٰ اور فرشتوں کو سامنے لانے کا تھا «اَوْ تَاْتِيَ بِاللّٰهِ وَ الْمَلٰٓىِٕكَةِ قَبِيْلًا» [ بنی إسرائیل : ۹۲ ] ’’یا تو اﷲ اور فرشتوں کو سامنے لے آئے۔‘‘ سورۂ فرقان میں بھی یہ مطالبہ ذکر فرمایا، جیسا کہ فرمایا : «لَوْ لَاۤ اُنْزِلَ عَلَيْنَا الْمَلٰٓىِٕكَةُ اَوْ نَرٰى رَبَّنَا» [ الفرقان : ۲۱ ] ’’ہم پر فرشتے کیوں نہیں اتارے گئے، یا ہم اپنے رب کو دیکھتے؟‘‘ اس مقام پر اﷲ تعالیٰ فرماتے ہیں کہ ان پر حجت تو پوری ہو چکی، یعنی : «فَقَدْ جَآءَكُمْ بَيِّنَةٌ مِّنْ رَّبِّكُمْ وَ هُدًى وَّ رَحْمَةٌ » [ الأنعام : ۱۵۷ ] اب دلیل کی تو نہ انھیں ضرورت ہے نہ ان کا مطالبہ، اب اس کے سوا انھیں کیا انتظار ہے کہ ان کے پاس فرشتے آ جائیں، یا تیرا رب خود آئے، یا تیرے رب کی کوئی نشانی آ جائے۔ مگر فرشتے آئے تو موت یا عذاب لے کر آئیں گے، پھر ایمان کی مہلت کہاں ؟ جیسا کہ فرمایا : «مَا نُنَزِّلُ الْمَلٰٓىِٕكَةَ اِلَّا بِالْحَقِّ وَ مَا كَانُوْۤاا اِذًا مُّنْظَرِيْنَ» [ الحجر : ۸ ] ’’ہم فرشتوں کو نہیں اتارتے مگر حق کے ساتھ اور اس وقت وہ مہلت دیے گئے نہیں ہوتے۔‘‘ اور اﷲ تعالیٰ آئے گا تو قیامت کے دن فیصلے کے لیے فرشتوں کے ساتھ آئے گا : «كَلَّاۤ اِذَا دُكَّتِ الْاَرْضُ دَكًّا دَكًّا(21) وَّ جَآءَ رَبُّكَ وَ الْمَلَكُ صَفًّا صَفًّا» [ الفجر: ۲۱، ۲۲ ] ’’ہرگز نہیں، جب زمین کوٹ کر ریزہ ریزہ کر دی جائے گی اور تیرا رب آئے گا اور فرشتے جو صف در صف ہوں گے۔‘‘ پھر تو دنیا کا کام ہی تمام ہو جائے گا، فرمایا : «هَلْ يَنْظُرُوْنَ اِلَّاۤ اَنْ يَّاْتِيَهُمُ اللّٰهُ فِيْ ظُلَلٍ مِّنَ الْغَمَامِ وَ الْمَلٰٓىِٕكَةُ وَ قُضِيَ الْاَمْرُ » [ البقرۃ : ۲۱۰ ] ’’وہ اس کے سوا کس چیز کا انتظار کر رہے ہیں کہ ان کے پاس اﷲ بادل کے سائبانوں میں آ جائے اور فرشتے بھی اور کام تمام کر دیا جائے۔‘‘ اور تیرے رب کی بعض نشانیوں سے مراد خاص نشانیاں ہیں، جن کی تفصیل آ رہی ہے۔ ¤ ➋ بعض لوگ قیامت کے دن اﷲ تعالیٰ کے آنے کے منکر ہیں اور کہتے ہیں کہ اﷲ تعالیٰ کے آنے کا سوال ہی پیدا نہیں ہوتا۔ اﷲ تعالیٰ کے آنے کا مطلب اس کے حکم کا یا عذاب کا آنا ہے، یہ لوگ اﷲ تعالیٰ کے زمین و آسمان کو پیدا فرما کر عرش پر بلند ہونے کے بھی منکر ہیں اور اس کے آسمان دنیا پر اترنے کے بھی، بلکہ عرش کو بھی نہیں مانتے۔ سورۂ حاقہ (۱۷) میں ہے کہ قیامت کے دن اﷲ کا عرش آٹھ فرشتے اٹھائے ہوں گے۔ یہاں لاجواب ہو کر کہتے ہیں کہ یہ متشابہات سے ہے، مگر اﷲ تعالیٰ کا آنا پھر بھی نہیں مانتے۔ اﷲ کے بندو ! تم نے اﷲ تعالیٰ کو اپنے سے بھی عاجز سمجھ لیا کہ تم اپنی مرضی سے جہاں جانا چاہو جاؤ، مگر اﷲ تعالیٰ کے لیے اپنی مرضی سے آنا جانا ممکن ہی نہیں مانتے۔ یہ سب نتیجہ یونانی فلسفے اور ان کے خدا کے متعلق تصورات سے متاثر ہونے کا ہے۔ قرآن و حدیث کے مطابق ہمارا ایمان ہے کہ اﷲ تعالیٰ عرش پر ہے، ہر رات آسمانِ دنیا پر اترتا ہے، قیامت کے دن زمین پر آئے گا اور زمین اس کے نور سے روشن ہو جائے گی، مگر اس کا آنا مخلوق کی طرح نہیں، بلکہ اس طرح ہے جیسے اس کی شان کے لائق ہے۔ ¤ ➌ {اَوْ يَاْتِيَ بَعْضُ اٰيٰتِ رَبِّكَ:} اس سے مراد صحیح احادیث کے مطابق قیامت کے قریب نمودار ہونے والی چند نشانیاں ہیں، جن میں سے سب سے پہلے ظاہر ہونے والی نشانی سورج کا مغرب کی طرف سے طلوع ہونا ہے۔ ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’قیامت قائم نہیں ہو گی یہاں تک کہ سورج اپنے مغرب سے طلوع ہو گا، جب اسے لوگ دیکھیں گے تو جو بھی زمین پر ہوں گے ایمان لے آئیں گے، تو یہ وہ وقت ہو گا جب کسی جان کو اس کا ایمان فائدہ نہیں دے گا جو اس سے پہلے ایمان نہ لائی ہو گی۔‘‘ [ بخاری، التفسیر، باب «لا ينفع نفسا إيمانها» : ۴۶۳۵ ] ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’ تین نشانیاں جب نمودار ہوں گی تو کسی شخص کو اس کا ایمان فائدہ نہ دے گا جو اس سے پہلے ایمان نہ لایا تھا، یا اپنے ایمان میں کوئی نیکی نہ کمائی تھی، سورج کا مغرب سے طلوع ہونا، دجال کا آنا اور زمین سے جانور کا نکلنا۔‘‘ [ مسلم، الإیمان، باب بیان الزمن الذی لا یقبل فیہ الإیمان : ۱۵۸ ] عبد اﷲ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’قیامت کی نشانیوں میں سے سب سے پہلے نکلنے والی نشانی مغرب سے سورج کا طلوع ہونا ہے اور زمین سے ایک جانور کا دوپہر کے وقت لوگوں کے سامنے نکلنا ہے۔ دونوں میں سے جو بھی پہلے ہوئی دوسری قریب ہی اس کے پیچھے ہو گی۔‘‘ [ مسلم، الفتن، باب فی خروج الدجال و مکثہ فی الأرض……:۲۹۴۱ ] ¤ اس جانور کا ذکر سورۂ نمل(۸۲) میں بھی ہے۔ معلوم یہ ہوتا ہے کہ مراد قیامت کی کوئی بھی بڑی نشانی ہے جس کے بعد اختیار ختم ہو جائے گا اور ایمان لانے اور توبہ کرنے کے بغیر چارہ ہی نہیں رہے گا، البتہ اکثر اہل ایمان کا رجحان مغرب سے سورج طلوع ہونے کی طرف ہے، جیسا کہ ہمارے استاد مولانا محمد عبدہٗ رحمہ اللہ نے صرف اسی کو صحیح قرار دیا ہے۔ ¤ ➍ {يَوْمَ يَاْتِيْ بَعْضُ اٰيٰتِ رَبِّكَ لَا يَنْفَعُ …… :} طبری رحمہ اللہ نے فرمایا کہ آیت کا معنی یہ ہے کہ کسی کافر کو جو سورج کے مغرب سے طلوع ہونے سے پہلے ایمان نہ لایا ہو اس کے طلوع ہونے کے بعد اس کا ایمان لانا اسے کوئی نفع نہیں دے گا اور کسی مومن کو بھی، جس نے طلوع سے پہلے نیک عمل نہ کیا ہو گا طلوع کے بعد وہ اسے نفع نہیں دے گا، کیونکہ اس وقت ایمان اور عمل کا حکم اس شخص کے ایمان و عمل جیسا ہے جو موت کے غرغرہ کے وقت ایمان لائے یا عمل کرے، جبکہ اس کا کوئی فائدہ نہیں، جیسا کہ اﷲ تعالیٰ نے فرمایا : «فَلَمْ يَكُ يَنْفَعُهُمْ اِيْمَانُهُمْ لَمَّا رَاَوْا بَاْسَنَا » [ المؤمن : ۸۵ ] ’’ پھر یہ نہ تھا کہ ان کا ایمان انھیں فائدہ دیتا جب انھوں نے ہمارا عذاب دیکھ لیا۔‘‘ اور جیسا کہ صحیح حدیث میں ثابت ہے کہ اﷲ تعالیٰ بندے کی توبہ اس وقت تک قبول کرتا ہے جب تک اس کا غرغرہ( موت کے وقت گلا بولنا) شروع نہ ہو۔ (ترمذی : ۳۵۳۷) اور ابن کثیر رحمہ اللہ نے فرمایا کہ جب کافر اس دن ایمان لائے گا تو اس سے قبول نہیں ہو گا لیکن جو اس سے پہلے مومن ہو گا تو اگر اپنے عمل میں درست ہو گا تو وہ بہت بڑی بھلائی پر ہو گا اور اگر درست نہیں ہو گا اور اس وقت توبہ کرے گا تو اس کی توبہ قبول نہیں ہو گی، جیسا کہ احادیث سے معلوم ہوتا ہے اور یہی مطلب ہو گا « أَوْ كَسَبَتْ فِي إِيمَانِهَاخَيْرًا» کا، یعنی اس کا نیک عمل اس وقت قبول نہیں ہو گا جب وہ اس سے پہلے اسے کرنے والا نہ ہو گا۔ ¤ ➎ { قُلِ انْتَظِرُوْۤا اِنَّا مُنْتَظِرُوْنَ:} ایمان لانے اور نافرمانی ترک کرنے میں دیر کرنے والوں کے لیے شدید دھمکی ہے۔ دیکھیے سورۂ محمد (۱۸) اور سورۂ مومن (۸۴، ۸۵)۔"
    },
    {
      "ayah": 159,
      "tafsir": "(آیت 159){اِنَّ الَّذِيْنَ فَرَّقُوْا دِيْنَهُمْ …… :} یعنی اصل دین شروع سے ایک ہی ہے جس کی بنیاد اﷲ کی توحید، یوم آخرت اور انبیاء پر ایمان اور ان کی اطاعت پر ہے۔ دیکھیے سورۂ مومنون (۵۲، ۵۳)، سورۂ یونس (۱۹)، سورۂ انعام (۱۵۳) اور سورۂ بقرہ (۲۱۳)۔ اپنے اپنے زمانے کے مطابق احکام میں کچھ فرق ہو سکتا ہے مگر اصل سب کا ایک اسلام ہی ہے۔ نبی آخر الزماں صلی اللہ علیہ وسلم کی آمد پر اﷲ تعالیٰ نے قیامت تک ہر شخص کے لیے آپ پر ایمان لانا اور آپ کے طریقے پر چلنا لازم قرار دے دیا۔ اب جو شخص بھی اپنا کوئی جدا راستہ اختیار کر کے الگ گروہ بنائے، خواہ وہ دہریہ ہو یا مشرک یا یہودی یا نصرانی، اﷲ تعالیٰ اپنے نبی صلی اللہ علیہ وسلم کو حکم دے رہے ہیں کہ آپ ان سے بری ہیں اور آپ کا ان سے کوئی تعلق نہیں۔ اسی طرح آپ کی امت میں سے اسلام قبول کرنے کے بعد جو لوگ اﷲ اور اس کے رسول کے احکام، یعنی قرآن و سنت کے علاوہ کوئی نیا طریقہ یعنی بدعت اختیار کر کے اپنا الگ گروہ بنا لیں، آپ ان سے بری ہیں، آپ کا ان سے کوئی تعلق نہیں۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اﷲ صلی اللہ علیہ وسلم نے فرمایا : ’’یہود ۷۱ یا ۷۲ فرقوں میں اور نصاریٰ بھی اتنے ہی فرقوں میں جدا جدا ہو گئے اور میری امت تہتر(۷۳) فرقوں میں تقسیم ہو جائے گی۔‘‘ [ أبو داوٗد، السنۃ، باب شرح السنۃ : ۴۵۹۶۔ ترمذی : ۲۶۴۰۔ ابن ماجہ: ۳۹۹۲۔ ابن حبان : ۶۷۳۱ ] معاویہ بن ابی سفیان رضی اللہ عنہما سے روایت ہے کہ رسول اﷲ صلی اللہ علیہ وسلم ہم میں کھڑے ہوئے اور فرمایا : ’’یاد رکھو، تم سے پہلے اہل کتاب ۷۲ ملتوں میں فرقہ فرقہ ہو گئے اور یہ ملت ۷۳ ملتوں میں فرقہ فرقہ ہو جائے گی، ۷۲ آگ میں ہوں گے اور ایک جنت میں اور وہ جماعۃ ہے۔‘‘ [ أبو داوٗد، السنۃ، باب شرح السنۃ : ۴۵۹۷۔ أحمد : 102/4، ح : ۱۶۹۴۰ ] عبد اﷲ بن عمرو رضی اللہ عنہما کی روایت میں ہے : ’’وہ سب آگ میں ہوں گے مگر ایک ملت۔‘‘ لوگوں نے پوچھا : ’’یا رسول اﷲ ! وہ کون ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَا أَنَا عَلَيْهِ وَ أَصْحَابِيْ ] ’’جس پر میں اور میرے اصحاب ہیں۔‘‘ [ ترمذی، الإیمان، باب ما جاء فی افتراق ھٰذہ الأمۃ : ۲۶۴۱ ] اس حدیث کے مزید حوالوں اور صحت کے لیے دیکھیے [السلسلة الصحيحة : 402/1 تا ۴۱۴، ح : ۲۰۳، ۲۰۴ ] ¤ یاد رہے کہ سوچ اور اجتہاد کا اختلاف یا علم نہ ہو سکنے کی وجہ سے اختلاف تو صحابہ اور تابعین میں بھی پایا جاتا تھا، مگر وہ سب ایک ہی جماعت تھے، انھوں نے کسی شخصیت کی تقلید کی خاطر فرقے نہیں بنائے تھے۔ مراد وہ لوگ ہیں جنھوں نے اپنا اپنا الگ پیشوا بنا کر اس کی ہر صحیح اور غلط بات کو دین قرار دے کر الگ فرقہ بنا لیا۔ یہ چیز مسلمانوں کے تین بہترین زمانوں میں نہیں تھی، پہلے انبیاء کی امتوں کو اسی چیز نے برباد کیا اور امت محمدیہ صلی اللہ علیہ وسلم کے بگاڑ کا باعث بھی یہی بات بنی کہ قرآن و حدیث کا واضح حکم آنے کے بعد بھی کچھ لوگ اپنے دھڑے کی وجہ سے اپنے امام یا مرشد کی غلط باتوں پر اڑ کر الگ الگ ہو گئے اور مسلمانوں کا شخصیتوں کی بنیاد پر بنے ہوئے فرقوں کو چھوڑ کر کتاب و سنت پر جمع ہونا ایک خواب ہی رہ گیا جس کی تعبیر کسی زبردست خلیفہ یا مہدی یا مسیح علیہ السلام ہی کے ذریعے سے پوری ہوتی نظر آ رہی ہے۔"
    },
    {
      "ayah": 160,
      "tafsir": "(آیت 160) ➊ { مَنْ جَآءَ بِالْحَسَنَةِ فَلَهٗ عَشْرُ اَمْثَالِهَا …… :} اﷲ تعالیٰ ڈرانے کے ساتھ بشارت کا سلسلہ بھی جاری رکھتا ہے، اب اﷲ تعالیٰ کا نیکی کرنے والوں پر اپنے فضل اور برائی کرنے والوں پر عدل کا بیان ہے۔ نیکی کرنے والوں کی نیکی میں دس گنا اضافہ کم از کم ہے، ورنہ وہ سات سو گنا سے لے کر بے حساب تک بھی بڑھایا جاتا ہے، جیسا کہ اﷲ تعالیٰ نے جہاد فی سبیل اﷲ میں خرچ کرنے والے کی مثال ایک دانے کو سات سو دانوں تک بڑھانے کے ساتھ اپنی مرضی کے ساتھ اس سے بھی بڑھانے کی بات فرمائی ہے۔ دیکھیے سورۂ بقرہ (۲۶۱) خوشے کی مثال کا جہاد سے تعلق سمجھنے کے لیے سورۂ بقرہ(۲۷۳) اور سورۂ توبہ(۶۰) ملاحظہ فرمائیں۔ جہاد کے ساتھ دوسری نیکیوں میں سات سو سے بڑھ کر ثواب بھی قرآن میں مذکور ہے، فرمایا : «اِنَّمَا يُوَفَّى الصّٰبِرُوْنَ اَجْرَهُمْ بِغَيْرِ حِسَابٍ » [ الزمر : ۱۰ ] ’’صرف صبر کرنے والوں ہی کو ان کا اجر کسی شمار کے بغیر پورا پورا دیا جائے گا۔‘‘ ¤ ➋ { وَ هُمْ لَا يُظْلَمُوْنَ:} یعنی ایک بدی کا بدلہ ایک سے زیادہ کا نہیں دیا جائے گا۔ ¤ ➌ ابن عباس رضی اللہ عنہما فرماتے ہیں کہ رسول اﷲ صلی اللہ علیہ وسلم نے اﷲ تعالیٰ سے روایت کرتے ہوئے فرمایا : ’’جو شخص نیکی کا ارادہ کرے، پھر اسے نہ کرے اس کے لیے ایک نیکی لکھ دی جاتی ہے، اگر کرے تو دس سے لے کر سات سو گنا سے بہت گنا تک لکھی جاتی ہے اور جو شخص برائی کا ارادہ کرے، پھر اسے نہ کرے تو اس کے لیے ایک پوری نیکی لکھی جاتی ہے اور اگر برائی کا ارادہ کیا اور اسے کر بھی لیا تو اﷲ اس کے لیے ایک ہی برائی لکھتا ہے، یا اﷲ عزوجل اسے بھی مٹا دیتا ہے اور اﷲ کے ہاں ہلاک نہیں ہوتا مگر جو سرے ہی سے ہلاک ہونے والا ہو۔‘‘ [ مسلم، الإیمان، باب إذا ھم العبد بحسنۃ …… :۱۳۱۔ بخاری : ۶۴۹۱ ] اس مقام پر حافظ ابن کثیر رحمہ اللہ نے ایک نفیس بات لکھی ہے کہ برائی چھوڑنے والا لا جو اسے نہیں کرتا، تین طرح کا ہوتا ہے، کبھی تو وہ اسے اﷲ تعالیٰ کی خاطر چھوڑتا ہے، اس پر ایک نیکی لکھی جاتی ہے کہ برائی سے اﷲ کے لیے رک جانا ایک عمل اور نیت ہے، جیسا کہ بعض صحیح احادیث میں ہے کہ اس نے اسے میری خاطر چھوڑا ہے اور کبھی وہ غفلت یا بھول کی وجہ سے برائی نہیں کرتا، اسے نہ گناہ ہے نہ ثواب، کیونکہ اس کی نیت نہ خیر کی ہے نہ شر کی اور کبھی اپنی پوری کوشش کے باوجود بس نہ چلنے کی وجہ سے کر نہیں سکتا، تو یہ اس شخص کی طرح ہے جس نے وہ برائی کی ہو، جیسا کہ صحیح حدیث میں ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : ’’جب دو مسلمان اپنی تلواریں لے کر ایک دوسرے کے مقابلے میں آئیں تو قاتل اور مقتول دونوں آگ میں ہوں گے۔‘‘ لوگوں نے پوچھا : ’’یا رسول اﷲ ! یہ تو قاتل ہے، مقتول کا کیا معاملہ ہے؟‘‘ فرمایا : ’’وہ بھی اپنے ساتھی کے قتل کی حرص رکھتا تھا۔‘‘ [ بخاری، الإیمان، باب : «و إن طائفتان من المؤمنين اقتتلوا …… » : ۳۱۔ مسلم : ۲۸۸۸ ]"
    },
    {
      "ayah": 161,
      "tafsir": "(آیت 161) ➊ {قُلْ اِنَّنِيْ هَدٰىنِيْ رَبِّيْۤ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ …… :} پوری سورت میں توحید کو دلائل سے ثابت کرنے اور مشرکین کی تردید کے بعد آخر میں خلاصہ چند حقائق کی صورت میں بیان فرمایا۔ {’’ قِيَمًا ‘‘} یہ {’’ قِيَامٌ ‘‘ } کے معنی میں مصدر ہے جسے مبالغے کے لیے دین کی صفت قرار دیا ہے، جیسے {’’ زَيْدٌ عَدْلٌ ‘‘} ہے، یعنی زید بہت عادل ہے، گویا سراسر عدل ہے، یعنی یہ دین نہایت قائم، مضبوط اور سیدھا ہے۔ ¤ ➋ {وَ مَا كَانَ مِنَ الْمُشْرِكِيْنَ:} اس میں مشرکین مکہ اور یہود و نصاریٰ کی تردید ہے جو اس زعم میں مبتلا تھے کہ وہ دین ابراہیم پر قائم ہیں۔ اﷲ تعالیٰ نے رسول اﷲ صلی اللہ علیہ وسلم کو حکم دیا کہ آپ ان سے کہہ دیجیے کہ تمھارا دعویٰ غلط ہے، تمھاری اور ان کی کیا نسبت! تم مشرک اور ابراہیم علیہ السلام شرک سے بے زار اور ایک اﷲ کی طرف ہو چکنے والے۔ ان کا دین تو سچا، سیدھا اور نہایت مضبوط دین اسلام تھا، جسے اﷲ تعالیٰ نے اپنے مخلص بندوں کے لیے پسند فرمایا اور جس کی ہدایت میرے رب نے مجھے عطا فرمائی۔"
    },
    {
      "ayah": 162,
      "tafsir": "(آیت 163،162) {قُلْ اِنَّ صَلَاتِيْ وَ نُسُكِيْ …… : ’’ اَلنُّسُكُ ‘‘} کا معنی عبادت ہے، یہ ذبح، قربانی اور حج کے معنی میں بھی آتا ہے، جیسا کہ فرمایا : «وَ لِكُلِّ اُمَّةٍ جَعَلْنَا مَنْسَكًا لِّيَذْكُرُوا اسْمَ اللّٰهِ عَلٰى مَا رَزَقَهُمْ مِّنْۢ بَهِيْمَةِ الْاَنْعَامِ » [ الحج  : ۳۴ ] ’’اور ہم نے ہر امت کے لیے ایک قربانی مقرر کی، تاکہ وہ ان پالتو چوپاؤں پر اﷲ کا نام ذکر کریں جو اس نے انھیں دیے ہیں۔‘‘ اور ابراہیم علیہ السلام نے دعا کی : «وَ اَرِنَا مَنَاسِكَنَا » [ البقرۃ : ۱۲۸] ’’ اور ہمیں ہماری عبادت (یا حج) کے طریقے دکھا۔‘‘ {’’ اَلصَّلاَةُ ‘‘} قلبی، زبانی اور جسم کے تمام اعضاء کی عبادت کا مجموعہ ہے۔ {’’ مَحْيَايَ وَ مَمَاتِيْ ‘‘} مصدر بھی ہو سکتے ہیں اور ظرف زمان بھی، یعنی مشرکین اور یہود و نصاریٰ کی قلبی، زبانی اور جسمانی عبادات، مثلاً قیام، رکوع اور سجود، یہ سب غیر اﷲ کے لیے تھیں، اسی طرح ان کی قربانیاں اور زندگی اور موت کا وقت سب انھی کی نذر تھا، ہاں کبھی اﷲ تعالیٰ کو بھی شامل کر لیتے تھے۔ فرمایا، ان سے صاف کہہ دیجیے کہ میرا تو یہ سب کچھ ایک اﷲ کے لیے ہے، اس کا کوئی شریک نہیں، مجھے یہی حکم ہے اور سب سے پہلے میں اپنے آپ کو ایک اﷲ تعالیٰ کے سپرد کرنے والا اور اس کا فرماں بردار بنانے والا ہوں، میرا جینا اور مرنا بھی اس اکیلے کا کلمہ بلند کرنے اور اس کے ساتھ شرک کو ختم کرنے کے لیے ہے، حتیٰ کہ اسی پر میری موت آ جائے۔"
    },
    {
      "ayah": 163,
      "tafsir": "(آیت 163،162) {قُلْ اِنَّ صَلَاتِيْ وَ نُسُكِيْ …… : ’’ اَلنُّسُكُ ‘‘} کا معنی عبادت ہے، یہ ذبح، قربانی اور حج کے معنی میں بھی آتا ہے، جیسا کہ فرمایا : «وَ لِكُلِّ اُمَّةٍ جَعَلْنَا مَنْسَكًا لِّيَذْكُرُوا اسْمَ اللّٰهِ عَلٰى مَا رَزَقَهُمْ مِّنْۢ بَهِيْمَةِ الْاَنْعَامِ » [ الحج  : ۳۴ ] ’’اور ہم نے ہر امت کے لیے ایک قربانی مقرر کی، تاکہ وہ ان پالتو چوپاؤں پر اﷲ کا نام ذکر کریں جو اس نے انھیں دیے ہیں۔‘‘ اور ابراہیم علیہ السلام نے دعا کی : «وَ اَرِنَا مَنَاسِكَنَا » [ البقرۃ : ۱۲۸] ’’ اور ہمیں ہماری عبادت (یا حج) کے طریقے دکھا۔‘‘ {’’ اَلصَّلاَةُ ‘‘} قلبی، زبانی اور جسم کے تمام اعضاء کی عبادت کا مجموعہ ہے۔ {’’ مَحْيَايَ وَ مَمَاتِيْ ‘‘} مصدر بھی ہو سکتے ہیں اور ظرف زمان بھی، یعنی مشرکین اور یہود و نصاریٰ کی قلبی، زبانی اور جسمانی عبادات، مثلاً قیام، رکوع اور سجود، یہ سب غیر اﷲ کے لیے تھیں، اسی طرح ان کی قربانیاں اور زندگی اور موت کا وقت سب انھی کی نذر تھا، ہاں کبھی اﷲ تعالیٰ کو بھی شامل کر لیتے تھے۔ فرمایا، ان سے صاف کہہ دیجیے کہ میرا تو یہ سب کچھ ایک اﷲ کے لیے ہے، اس کا کوئی شریک نہیں، مجھے یہی حکم ہے اور سب سے پہلے میں اپنے آپ کو ایک اﷲ تعالیٰ کے سپرد کرنے والا اور اس کا فرماں بردار بنانے والا ہوں، میرا جینا اور مرنا بھی اس اکیلے کا کلمہ بلند کرنے اور اس کے ساتھ شرک کو ختم کرنے کے لیے ہے، حتیٰ کہ اسی پر میری موت آ جائے۔"
    },
    {
      "ayah": 164,
      "tafsir": "(آیت 164) ➊ {قُلْ اَغَيْرَ اللّٰهِ اَبْغِيْ رَبًّا …… :} مکہ کے مشرک اﷲ تعالیٰ کو رب مانتے تھے، مگر معبود کئی بنا رکھے تھے جن سے وہ نفع و نقصان کی امید رکھتے اور انھی کی پوجا کرتے اور پکارتے تھے، اﷲ تعالیٰ نے قرآن مجید میں اپنے رب ہونے کو اپنی الوہیت، یعنی معبود ہونے کی دلیل کے طور پر بار بار پیش کیا ہے۔ دیکھیے سورۂ یونس(۳۱)، سورۂ سبا (۲۲) اور سورۂ فاطر (۱۳)۔ یہاں بھی مراد یہی ہے کہ عبادت تو صرف اسی کی ہو سکتی ہے جو رب ہو، اس لیے تمھارا غیر اﷲ کو پکارنا، ان کی عبادت کرنا انھیں رب بنانا ہی ہے، اب اﷲ کے سوا میں کسی اور کی عبادت کر کے اسے رب کیسے بناؤں، جب کہ ہر شے کا رب وہی ہے۔ ¤ ➋ {وَ لَا تَكْسِبُ كُلُّ نَفْسٍ اِلَّا عَلَيْهَا......:} کفار رسول اﷲ صلی اللہ علیہ وسلم اور مسلمانوں سے کہتے کہ تم آبائی دین میں ہماری پیروی اختیار کرو اور گناہ کی فکر مت کرو، اگر یہ گناہ ہوا تو ہم اٹھا لیں گے۔ اﷲ تعالیٰ نے فرمایا کہ وہ ان کے گناہوں میں سے کچھ بھی نہیں اٹھائیں گے، بلکہ وہ صاف جھوٹے ہیں۔ دیکھیے سورۂ العنکبوت ( ۱۲، ۱۳) یہاں بھی ان کے اس فریب اور چکمے کا جواب دیا ہے، فرمایا، کوئی جان بھی کوئی گناہ کماتی ہے تو وہ اسی پر ہوتا ہے، کوئی دوسری جان کسی صورت اسے نہیں اٹھائے گی۔یہ تو اﷲ تعالیٰ کے عدل ہی کے خلاف ہے، جس کے سامنے تم نے لوٹ کر جانا ہے، پھر وہ تمھارے اختلاف کا اور حق و ناحق ہونے کا فیصلہ تمھیں سنائے گا۔ اﷲ تعالیٰ نے اپنے اس فیصلے کا کئی جگہ ذکر فرمایا ہے۔ دیکھیے سورۂ انعام (۳۱) سورۂ فاطر(۱۸) اور سورۂ نجم (۳۸، ۳۹)۔"
    },
    {
      "ayah": 165,
      "tafsir": "(آیت 165) ➊ { وَ هُوَ الَّذِيْ جَعَلَكُمْ خَلٰٓىِٕفَ الْاَرْضِ:} یعنی زمین میں ایک دوسرے کے بعد اقتدار بخشا، یا ایک دوسرے کا جانشین اور وارث بنایا۔ ¤ ➋ {وَ رَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجٰتٍ …… :} یعنی شکل و صورت، مال و جاہ اور علم و عقل میں ایک دوسرے پر برتری بخشنے کا مقصد اپنی دی ہوئی نعمتوں میں تمھارا امتحان ہے، اگر کفر اختیار کر کے ناکام ہو گئے تو بہت جلد سزا مل جائے گی، کیونکہ ہر آنے والی چیز قریب ہے اور موت اور قیامت تو یقینا آنے والی ہیں اور بہت جلد آنے والی ہیں اور اگر ایمان لے آئے، پھر کوئی لغزش بھی ہوئی تو وہ ذات پاک حد سے بڑھ کر بخشنے والی اور بے حد رحم کرنے والی ہے۔"
    }
  ]
}