{
  "surah": "Al-Munaafiqoon",
  "surah_number": 63,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ {اِذَا جَآءَكَ الْمُنٰفِقُوْنَ: ’’ الْمُنٰفِقُوْنَ ‘‘ ’’اَلنَّافِقَاءُ‘‘} سے مشتق ہے جو ’’یربوع‘‘ (چوہے سے ملتے جلتے ایک جنگلی جانور) کے بل کا ایک منہ ہووتا ہے، وہ اسے اس طرح بناتا ہے کہ اس جگہ مٹی کی صرف اتنی تہ رہنے دیتا ہے کہ سر مارے تو کھل جائے، اس منہ کو وہ چھپا کر رکھتا ہے اور دوسرا منہ ظاہر کر دیتا ہے۔ منافق بھی چونکہ اپنا کفر چھپاتا اور ایمان ظاہر کرتا ہے، اس لیے اس کا یہ نام رکھا گیا ہے۔ یہ ایک خالص اسلامی اصطلاح ہے، مراد اس سے عبداللہ بن اُبی اور اس کے ساتھی ہیں۔ ¤ ➋ رسول اللہ صلی اللہ علیہ وسلم کی مدینہ تشریف آوری سے کچھ عرصہ پہلے اوس اور خزرج کے درمیان ہونے والی جنگ بعاث میں ان کے بڑے بڑے سردار مارے گئے، ابھی وہ سوچ ہی رہے تھے کہ وہ اپنا ایک متفقہ سردار مقرر کر لیں، بلکہ طے کر چکے تھے کہ عبداللہ بن اُبی کی باقاعدہ تاج پوشی کر کے اسے اپنا سردار بنا لیں۔ اسی اثنا میں چند سعادت مند حج کے لیے مکہ گئے اور رسول اللہ صلی اللہ علیہ وسلم کی دعوت پر مسلمان ہوگئے۔ اگلے دو سالوں میں مزید لوگوں نے جا کر بیعت کی اور آخری بار انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو مدینہ آنے کی دعوت دی۔ ان سالوں میں مدینہ کے ہر گھر میں اسلام پہنچ چکا تھا، رسول اللہ صلی اللہ علیہ وسلم کی آمد پر اوس و خزرج کے بااثر لوگوں سمیت ان کی اکثریت مسلمان ہوگئی۔ آپ صلی اللہ علیہ وسلم کی وجہ سے عبداللہ بن اُبی اور اس کے حامیوں کی سرداری کی امید ناکام ہوئی تو وہ آپ صلی اللہ علیہ وسلم کے شدید دشمن بن گئے۔ کچھ مدت تک تو وہ کھلم کھلا عداوت کا اظہار کرتے رہے، مگر بدر کی عظیم الشان فتح کے بعد ان کے پاس مدینہ میں رہنے کے لیے مسلمان ہونے کے سوا کوئی چارہ نہ رہا تو وہ مسلمان ہوگئے، حتیٰ کہ عبداللہ بن اُبی بھی مسلمان ہوگیا، مگر ان کا اسلام صرف جان بچانے کے لیے اور وہ فوائد حاصل کرنے کے لیے تھا جو مسلمانوں کو عزت و قوت اور فتح و غنیمت کی صورت میں حاصل تھے۔ یہ لوگ نمازیں پڑھتے، روزے رکھتے، زکوٰۃ دیتے اور جہاں غنیمت کی امید ہوتی جہاد میں بھی جاتے تھے، مگر دل سے اب بھی ایمان نہیں لائے تھے بلکہ ہر موقع پر انھوں نے مسلمانوں کو دھوکا دیا اور نقصان پہنچایا۔ جنگ احد میں یہ لوگ لشکر کا تیسرا حصہ لے کر میدان جنگ سے واپس چلے گئے۔ بنو نضیر، بنو قریظہ اور خیبر والوں کو جنگ پر اور مسلمانوں کے خلاف ڈٹ جانے پر ابھارتے رہے، خندق اور دوسرے مواقع پر انھوں نے کفار کے ساتھ ساز باز رکھی اور جب موقع ملتا رسول اللہ صلی اللہ علیہ وسلم ، مسلمانوں اور اسلام کے متعلق گستاخانہ باتیں کرتے، جیسا کہ اگلی آیات میں آ رہا ہے۔ لیکن جب ایسی باتیں سامنے آنے پر ان سے باز پرس کی جاتی تو وہ قسمیں کھا جاتے کہ ہم مسلمان ہیں اور آپ صلی اللہ علیہ وسلم کو اللہ کا رسول مانتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم ان کی گستاخیوں سے درگزر فرماتے رہے، کیونکہ یہ لوگ کلمہ پڑھ کر مسلمان ہو چکے تھے اور مخلص مسلمانوں کے عزیز اور رشتہ دار بھی تھے۔ اگر آپ انھیں قتل کرتے تو بہت سی بدگمانیاں پیدا ہونے کا اندیشہ تھا، اس لیے آپ سب کچھ برداشت کرتے رہے، حتیٰ کہ آخر کار آپ صلی اللہ علیہ وسلم کے صبر و ضبط اور عفو و حلم کی وجہ سے ان کی حقیقت کھل کر سب کے سامنے آگئی اور وہ مخلص مسلمانوں کی نگاہ میں بالکل بے قدر و قیمت ہو کر رہ گئے، ان کا کوئی اعتبار باقی نہ رہا۔ ان کا کچھ حال سورۂ بقرہ (۸ تا ۲۰)، آل عمران، نساء، مائدہ، توبہ، احزاب اور دوسرے مقامات پر گزر چکا ہے۔ ¤ ➌ {قَالُوْا نَشْهَدُ اِنَّكَ لَرَسُوْلُ اللّٰهِ: ’’إِنَّ‘‘} اور ’’لام تاکید‘‘ عموماً قسم کے جواب میں آتے ہیں اور قسم جیسی تاکید کا فائدہ دیتے ہیں۔ شہادت اس بات کی خبر دینے کو کہتے ہیں جس کا دل سے یقین ہو۔ منافقین کی عادت تھی کہ وہ قسمیں کھا کر اپنی وفاداری کا یقین دلانے کی کوشش کرتے رہتے تھے، جب کہ مخلص مسلمانوں کو اس کی ضرورت ہی نہیں پڑتی تھی۔ مزید دیکھیے سورۂ نساء (۶۲)، توبہ (96،74،62،56) اور سورۂ مجادلہ (۱۸) کی تفسیر۔ ¤ ➍ {وَ اللّٰهُ يَعْلَمُ اِنَّكَ لَرَسُوْلُهٗ … :} یہ منافقین کا قول نہیں بلکہ اللہ تعالیٰ کا فرمان ہے، اس لیے اگر وقف کرنا ہو تو {’’ اِنَّكَ لَرَسُوْلُ اللّٰهِ ‘‘} پر کرنا چاہیے، آیت شروع کر کے {’’ اِنَّكَ لَرَسُوْلُهٗ ‘‘} پر وقف سے وہم پڑھتا ہے کہ یہ دونوں جملے منافقین کا قول ہیں۔ یہاں ایک سوال ہے کہ جب اللہ تعالیٰ نے اس بات کی تصدیق فرمائی کہ آپ یقینا اللہ کے رسول ہیں تو یہ کیوں فرمایا کہ اللہ شہادت دیتا ہے کہ بلاشبہ یہ منافق یقینا جھوٹے ہیں اور منافق جھوٹے کس طرح ہوئے؟ جواب اس کا یہ ہے کہ ان کا یہ کہنا جھوٹ نہیں کہ آپ اللہ کے رسول ہیں، بلکہ یہ سچ ہے اور اللہ تعالیٰ نے یہ کہہ کر اس کی تصدیق فرمائی کہ {’’ وَ اللّٰهُ يَعْلَمُ اِنَّكَ لَرَسُوْلُهٗ ‘‘} یعنی اللہ جانتا ہے کہ بلاشبہ آپ یقینا اس کے رسول ہیں، منافقین کو جھوٹا اس لیے فرمایا کہ انھوں نے کہا کہ ہم شہادت دیتے ہیں کہ آپ اللہ کے رسول ہیں، حالانکہ وہ اس بات کی شہادت نہیں دیتے بلکہ یہ بات صرف زبان سے کہہ رہے ہوتے ہیں، دل سے وہ آپ کو اس کا رسول نہیں مانتے۔ شہادت میں سچے وہ تب ہوتے جب وہ دل اور زبان دونوں سے آپ کی رسالت کا اقرار کرتے۔ ¤ زمخشری نے فرمایا کہ اگر درمیان میں جملہ {’’ وَ اللّٰهُ يَعْلَمُ اِنَّكَ لَرَسُوْلُهٗ ‘‘} نہ ہوتا تو کلام اس طرح ہونا تھا: {’’إِذَا جَاءَكَ الْمُنَافِقُوْنَ قَالُوْا نَشْهَدُ إِنَّكَ لَرَسُوْلُ اللّٰهِ وَ اللّٰهُ يَشْهَددُ إِنَّ الْمُنَافِقِيْنَ لَكَاذِبُوْنَ‘‘} ’’جب تیرے پاس منافق آتے ہیں تو کہتے ہیں ہم شہادت دیتے ہیں کہ بلاشبہ تو یقینا اللہ  کا رسول ہے اور اللہ شہادت دیتا ہے کہ بلاشبہ یہ منافق یقینا جھوٹے ہیں‘‘ لیکن اس سے وہم پڑ سکتا تھا کہ اللہ تعالیٰ انھیں اس بات میں جھوٹا کہہ رہے ہیں کہ آپ اللہ کے رسول ہیں، اس لیے درمیان میں یہ فرمایا کہ اللہ تعالیٰ جانتا ہے کہ آپ یقینا اللہ کے رسول ہیں، پھر فرمایا اور اللہ تعالیٰ شہادت دیتا ہے کہ یہ منافق جھوٹے ہیں، یعنی ان کا یہ کہنا جھوٹ ہے کہ ہم شہادت دیتے ہیں۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) { اِتَّخَذُوْۤا اَيْمَانَهُمْ جُنَّةً …:} اس کی تفصیل کے لیے دیکھیے سورۂ مجادلہ کی آیت (۱۶) کی تفسیر۔ {’’ سَبِيْلِ اللّٰهِ ‘‘} سے مراد اسلام بھی ہے اور جہاد بھی۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { ذٰلِكَ بِاَنَّهُمْ اٰمَنُوْا ثُمَّ كَفَرُوْا:’’ ذٰلِكَ ‘‘} کا مطلب یہ ہے کہ ان لوگوں کا مومن ہونے کی جھوٹی قسمیں کھانا اور اللہ کی راہ سے روکنا وغیرہ اس لیے ہے کہ وہ ایمان لائے، پھر انھوں نے کفر کیا۔ ایمان لا کر کفر تین طرح سے ہے، ایک یہ کہ وہ ظاہر میں ایمان لائے اور مسلمان ہوگئے مگر دل میں کافر ہی رہے۔ ایک یہ کہ مسلمانوں کے پاس آئے تو ایمان کی شہادت دی، پھر کفار کے پاس گئے تو انھیں اپنے کفر کا یقین دلایا، جیسا کہ فرمایا : « وَ اِذَا لَقُوا الَّذِيْنَ اٰمَنُوْا قَالُوْۤا اٰمَنَّا وَ اِذَا خَلَوْا اِلٰى شَيٰطِيْنِهِمْ قَالُوْۤا اِنَّا مَعَكُمْ» [ البقرۃ : ۱۴ ] ’’اور جب وہ ان لوگوں سے ملتے ہیں جو ایمان لائے تو کہتے ہیں ہم ایمان لے آئے اور جب اپنے شیطانوں کی طرف اکیلے ہوتے ہیں تو کہتے ہیں بے شک ہم تمھارے ساتھ ہیں۔‘‘ منافقین کی اکثریت ایسی ہی تھی اور ایک یہ کہ ان میں سے بعض شروع میں تو صحیح ایمان لائے، پھر دنیوی اغراض کی وجہ سے کافر ہوگئے۔ معلوم ہوتا ہے کہ منافقین میں سے جو لوگ تائب ہوئے اور ان کا اسلام خالص ہوا وہ اس گروہ سے تھے۔ ¤ ➋ {فَطُبِعَ عَلٰى قُلُوْبِهِمْ فَهُمْ لَا يَفْقَهُوْنَ:} یعنی ان کے ایمان لانے کے بعد کفر کرنے کی وجہ سے ان کے دلوں پر مہر کر دی گئی تو وہ نہ دنیا اور آخرت میں نفاق کے نقصان کو سمجھتے ہیں نہ انھیں اس پر کوئی شرمندگی ہوتی ہے اور نہ ہی توبہ کی توفیق ملتی ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {وَ اِذَا رَاَيْتَهُمْ تُعْجِبُكَ اَجْسَامُهُمْ:} اکثر منافقین خوش حال، صاحب حیثیت، تیز طرار اور ہوشیار لوگ تھے، ان کی خوش حالی اور مال کی حرص ہی ان کے نفاق کا باعث تھی۔ ان کا سردار عبداللہ بن اُبی معاشی لحاظ سے بھی رئیس تھا اور دیکھنے میں بھی بڑا خوب صورت، لمبے قد والا اور جسیم تھا۔ زید بن ارقم رضی اللہ عنہ نے اس کے اور اس کے ساتھیوں کے متعلق فرمایا : [ كَانُوْا رِجَالاً أَجْمَلَ شَيْءٍ ] [ بخاري : ۴۹۰۳ ] ’’وہ بہت خوبصورت آدمی تھے۔‘‘ مزید تفصیل آگے آیت (۷) کی تفسیر میں دیکھیے۔ جابر رضی اللہ عنہ بیان کرتے ہیں کہ (بدر کے قیدیوں میں سے) عباس مدینہ میں تھے، انصار نے انھیں پہنانے کے لیے کپڑا تلاش کیا مگر انھیں عبداللہ بن اُبی کی قمیص کے علاوہ کوئی قمیص نہ ملی جو ان کے جسم پر پوری آتی ہو، چنانچہ انھوں نے وہی ان کو پہنا دی۔ [ نسائي، الجنائز، باب القمیص في الکفن : ۱۹۰۳، وقال الألباني صحیح ] اہل علم فرماتے ہیں کہ عبداللہ بن اُبی کی وفات پر آپ صلی اللہ علیہ وسلم نے اسے اپنی قمیص جو پہنائی اس پر دوسری مصلحتوں کے علاوہ اس احسان کا بدلا اتارنا بھی مقصود تھا۔ اللہ تعالیٰ نے پچھلی آیت میں {’’ فَهُمْ لَا يَفْقَهُوْنَ ‘‘} کے الفاظ کے ساتھ منافقین کی ناسمجھی بیان کرنے کے ساتھ ہی فرمایا کہ اے مخاطب! جب تو انھیں دیکھے تو ڈیل ڈول اور خوبصورتی کی وجہ سے ان کے جسم تجھے بہت اچھے دکھائی دیں گے اور اگر وہ بات کریں تو ایسے فصیح و بلیغ ہیں کہ تو ان کی بات سنتا ہی رہ جائے۔ ان کی چرب زبانی کا ذکر سورۂ بقرہ (۲۰۴) میں بھی آیا ہے۔ یہاں بعض مفسرین نے{’’ وَ اِذَا رَاَيْتَهُمْ تُعْجِبُكَ اَجْسَامُهُمْ ‘‘} میں مخاطب رسول اللہ صلی اللہ علیہ وسلم کو قرار دیا ہے، مگر بہتر ہے کہ اسے ہر مخاطب کے لیے عام رکھا جائے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم تو شروع سے انھیں دیکھتے آ رہے تھے۔ ¤ ➋ ظاہر ہے کہ {’’ اِذَا رَاَيْتَهُمْ ‘‘} (جب تو انھیں دیکھے) سے عبداللہ بن اُبی اور اس جیسے منافق مراد ہیں، کیونکہ تمام منافق تو حسین و جمیل نہیں تھے اور نہ ہی ایسے فصیح و بلیغ تھے۔ (التسہیل) ¤ ➌ {كَاَنَّهُمْ خُشُبٌ مُّسَنَّدَةٌ: ’’ خُشُبٌ ‘‘ ’’خَشَبَةٌ ‘‘} کی جمع ہے، لکڑیاں۔ اس وزن کی یہ جمع بہت کم آتی ہے۔ مفسرین نے اس کی نظیر {’’ ثَمَرَةٌ ‘‘} کی جمع {’’ ثُمُرٌ ‘‘} لکھی ہے۔ {’’ مُسَنَّدَةٌ ‘‘} باب تفعیل سے اسم مفعول ہے، دیوار کے ساتھ ٹیک لگا کر رکھی ہوئی۔ یعنی جیسے لکڑیوں میں طول و عرض اور خوبصورتی کے باوجود عقل اور سمجھ نہیں ہوتی اسی طرح یہ بھی عقل اور سمجھ سے عاری ہیں۔ جب یہ آپ کی مجلس میں دیوار کے ساتھ ٹیک لگا کر بیٹھے ہوں تو یہ مت سمجھیں کہ یہ آدمی ہیں، بلکہ یوں سمجھیں کہ لکڑیاں ہیں جو ٹیک لگا کر دیوار کے ساتھ رکھی ہوئی ہیں، گو بظاہر خوبصورت نظر آتے ہیں۔ زمخشری نے فرمایا کہ آیت کا مطلب یہ ہے کہ حسین و جمیل اور جسیم و عریض ہونے کے باوجود ان سے کسی نفع کی امید نہیں، جس طرح کار آمد لکڑی چھت، دروازے یا کھڑکیوں میں یا کہیں نہ کہیں استعمال ہوتی ہے، مگر بے کار لکڑیوں کو دیوار کے ساتھ ٹیک لگا کر رکھ دیا جاتا ہے۔ ¤ ➍ { يَحْسَبُوْنَ كُلَّ صَيْحَةٍ عَلَيْهِمْ:} اس میں ان کی بزدلی کا نقشہ کھینچا ہے کہ جوں ہی کوئی آواز بلند ہوتی ہے یا شور اٹھتا ہے تو وہ اسے اپنے آپ پر پڑنے والی اُفتاد ہی سمجھتے ہیں کہ ہو سکتا ہے کفار کا حملہ ہو گیا ہو جس میں ہمیں لڑنا پڑے اور اس میں ہماری موت ہو۔ (دیکھیے احزاب : ۱۹) یا رسول اللہ صلی اللہ علیہ وسلم اور مسلمانوں کو ہمارے خبث باطن کا پتا چل گیا ہو اور ہمارے خلاف کارروائی کا حکم آگیا ہو، یا اللہ تعالیٰ کی طرف سے ہمیں رسوا کرنے والی یا ہمارے قتل کے حکم والی کوئی آیت یا سورت اتری ہو۔ (دیکھیے توبہ : ۶۴) ¤ ➎ { هُمُ الْعَدُوُّ فَاحْذَرْهُمْ: ’’ الْعَدُوُّ ‘‘} خبر پر الف لام لانے سے کلام میں حصر پیدا ہو رہا ہے کہ تمھارے اصل دشمن یہی ہیں، کیونکہ کھلم کھلا کفار کی عداوت ظاہر ہے جس سے بچاؤ آسان ہے، یہ گھر کے بھیدی اور آستین کے سانپ ہیں جو مسلمان بن کر ہر وقت تمھارے ساتھ ہیں۔ ان کی عداوت زیادہ خطر ناک ہے اور اس سے بچنا بہت مشکل ہے، اس لیے ان سے ہوشیار رہیں۔ ¤ ➏ {قٰتَلَهُمُ اللّٰهُ:} یہ بد دعا کا کلمہ ہے، اللہ انھیں ہلاک کرے۔ یہاں ایک سوال ہے کہ اللہ تعالیٰ کو دعا یا بددعا کی کیا ضرورت ہے، وہ تو جو چاہے کر سکتا ہے؟ جواب اس کا یہ ہے کہ یہاں ان کے حق میں لوگوں کی زبان پر آنے والی بد دعا نقل کی گئی ہے۔ مراد ان کی مذمت ہے۔ ¤ ➐ {اَنّٰى يُؤْفَكُوْنَ:} یعنی اتنے واضح دلائل کے باوجود ایمان چھوڑ کر یہ لوگ کہاں بہکائے جا رہے ہیں۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {وَ اِذَا قِيْلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ … : ’’ لَوَّوْا ‘‘ ’’لَوٰي يَلْوِيْ لَيًّا‘‘} (ض) (پھیرنا) سے باب تفعیل ہے، جس سے سر پھیرنے میں مبالغہ یا اس کا تکرار مقصود ہے۔ آیت (۷) میں اس کا سبب نزول آ رہا ہے۔ ¤ ➋ {وَ رَاَيْتَهُمْ يَصُدُّوْنَ وَ هُمْ مُّسْتَكْبِرُوْنَ: ’’صَدَّ يَصُدُّ صَدًّا وَ صُدُوْدًا ‘‘ (ن)’’صَدًّا ‘‘} (لازم) روکنا اور {’’ وَصُدُوْدًا ‘‘} (متعدی) اعراض کرنا، منہ پھیر لینا۔ یعنی رسول اللہ صلی اللہ علیہ وسلم کے پاس جا کر معذرت کر لینے کی ترغیب پر تم انھیں دیکھو گے کہ وہ تکبر کرتے ہوئے منہ پھیر لیں گے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {سَوَآءٌ عَلَيْهِمْ اَسْتَغْفَرْتَ لَهُمْ اَمْ لَمْ تَسْتَغْفِرْ لَهُمْ …: ’’ اَسْتَغْفَرْتَ ‘‘} اصل میں {’’ءَ اِسْتَغْفَرْتَ ‘‘} ہے، ہمزۂ تسویہ آنے کے بعد ہمزۂ وصل کی ضرورت نہ رہی، اس لیے وہ گر گیا۔ اس میں ہمزہ استفہام کا نہیں ہے، بلکہ اسے ہمزۂ تسویہ کہتے ہیں۔ (دیکھیے بقرہ : ۶) آیت کی تفسیر کے لیے دیکھیے سورۂ توبہ (۸۰) کی تفسیر۔ اس سے مقصود آپ صلی اللہ علیہ وسلم کی ان کے لیے معافی کی امید کو ختم کرنا ہے، کیونکہ منافقوں کی تمام شرارتوں اور بے ادبیوں کے باوجود آپ صلی اللہ علیہ وسلم اپنی طبعی رحمت و شفقت کی بنا پر چاہتے تھے کہ ان کے لیے معافی کی دعا فرمائیں۔ اللہ تعالیٰ نے آپ کو ان کے لیے معافی کی دعا سے منع فرما دیا، کیونکہ ان کا فسق حد سے بڑھ چکا تھا۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {هُمُ الَّذِيْنَ يَقُوْلُوْنَ لَا تُنْفِقُوْا عَلٰى مَنْ عِنْدَ رَسُوْلِ اللّٰهِ … :} اس آیت میں اور اس سے اگلی آیت میں ان منافقین کے فسق کے نمونے کے طور پر ان کے کچھ گستاخانہ جملے ذکر فرمائے ہیں، جن سے ان کی اسلام اور مسلمانوں سے شدید نفرت اور دلی بغض کا اظہار ہو رہا ہے۔ گویا بتایا جا رہا ہے کہ یہ ہے ان کا بدترین فسق جس کی وجہ سے اللہ تعالیٰ انھیں ہدایت نہیں دیتا اور جس کی وجہ سے ان کے حق میں رسول اللہ صلی اللہ علیہ وسلم کے استغفار کا بھی کوئی فائدہ نہیں۔ زید بن ارقم رضی اللہ عنہ فرماتے ہیں : [ خَرَجْنَا مَعَ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فِيْ سَفَرٍ أَصَابَ النَّاسَ فِيْهِ شِدَّةٌ، فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ لِأَصْحَابِهِ لاَ تُنْفِقُوْا عَلٰی مَنْ عِنْدَ رَسُوْلِ اللّٰهِ حَتّٰی يَنْفَضُّوْا مِنْ حَوْلِهِ وَقَالَ لَئِنْ رَجَعْنَا إِلَی الْمَدِيْنَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ فَأَتَيْتُ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَأَرْسَلَ إِلٰی عَبْدِ اللّٰهِ بْنِ أُبَيٍّ فَسَأَلَهُ، فَاجْتَهَدَ يَمِيْنَهُ ممَا فَعَلَ، قَالُوْا كَذَبَ زَيْدٌ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَوَقَعَ فِيْ نَفْسِيْ مِمَّا قَالُوْا شِدَّةٌ، حَتّٰی أَنْزَلَ اللّٰهُ عَزَّ وَجَلَّ تَصْدِيْقِيْ فِيْ : « اِذَا جَآءَكَ الْمُنٰفِقُوْنَ» فَدَعَاهُمُ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ لِيَسْتَغْفِرَ لَهُمْ فَلَوَّوْا رُؤُوْسَهُمْ وَقَوْلُهُ : « خُشُبٌ مُّسَنَّدَةٌ » قَالَ كَانُوْا رِجَالاً أَجْمَلَ شَيْءٍ ] [ بخاري، التفسیر، باب : « و إذا رأیتہم تعجبک أجسامہم…» : ۴۹۰۳ ] ’’ہم ایک سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے، اس سفر میں لوگوں کو بہت سخت حالات کا سامنا کرنا پڑا تو عبداللہ بن اُبی نے اپنے ساتھیوں سے کہا : ’’ان لوگوں پر خرچ نہ کرو جو اللہ کے رسول کے پاس ہیں، یہاں تک کہ وہ اس کے گرد سے منتشر ہو جائیں۔‘‘ اور اس نے کہا : ’’اگر ہم مدینہ واپس پہنچے تو جو زیادہ عزت والا ہے وہ ذلیل تر کو اس میں سے ضرور نکال باہر کرے گا۔‘‘ یہ سن کر میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ کو یہ بات بتائی۔ آپ صلی اللہ علیہ وسلم نے عبداللہ بن اُبی کی طرف پیغام بھیج کر اسے بلایا اور اس سے یہ بات پوچھی تو اس نے بہت پکی قسم کھا کر کہا کہ اس نے ایسا نہیں کیا۔ لوگوں نے کہا : ’’زید نے رسول اللہ صلی اللہ علیہ وسلم سے جھوٹ کہا ہے۔‘‘ تو میرے دل میں ان کی بات سے بہت تکلیف پہنچی، یہاں تک کہ اللہ تعالیٰ نے {’’ اِذَا جَآءَكَ الْمُنٰفِقُوْنَ ‘‘} میں میری تصدیق نازل فرما دی۔ تو رسول اللہ صلی اللہ علیہ وسلم نے انھیں بلایا، تاکہ ان کے لیے استغفار کریں تو انھوں نے اپنے سر پھیر لیے۔‘‘ اور (زید رضی اللہ عنہ نے) اللہ کے فرمان {’’ خُشُبٌ مُّسَنَّدَةٌ ‘‘} کے متعلق فرمایا : ’’وہ بہت خوبصورت آدمی تھے۔‘‘ ¤ ➋ { وَ لِلّٰهِ خَزَآىِٕنُ السَّمٰوٰتِ وَ الْاَرْضِ … : ’’ لِلّٰهِ ‘‘} کو پہلے لانے کا مطلب یہ ہے کہ آسمانوں اور زمین کے خزانوں کا مالک صرف ا اللہ تعالیٰ ہے، اور کوئی نہیں۔ منافقین نے خود تو کیا خرچ کرنا تھا، وہ تو پرلے درجے کے حریص اور بخیل تھے، وہ مخلص مسلمانوں کو بھی مہاجرین پر خرچ کرنے سے روک رہے تھے اور سمجھ رہے تھے کہ اگر وہ ان پر خرچ نہیں کریں گے تو وہ بھوک سے مر جائیں گے۔ حالانکہ سارے خزانوں کا مالک تو اللہ تعالیٰ ہے، وہ جس طرح چاہے انھیں رزق دے سکتا ہے، مگر یہ منافقین کی بے سمجھی ہے کہ وہ مہاجرین کا رزق اپنے ہاتھ میں سمجھ رہے ہیں، اس لیے یہاں {’’ لَا يَفْقَهُوْنَ ‘‘} کا لفظ فرمایا کہ ایسا سمجھنے والا بے سمجھ ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {يَقُوْلُوْنَ لَىِٕنْ رَّجَعْنَاۤ اِلَى الْمَدِيْنَةِ لَيُخْرِجَنَّ الْاَعَزُّ مِنْهَا الْاَذَلَّ:} جابر بن عبداللہ رضی اللہ عنھما بیان کرتے ہیں : [كُنَّا فِيْ غَزَاةٍ قَالَ سُفْيَانُ مَرَّةً فِيْ جَيْشٍ فَكَسَعَ رَجُلٌ مِّنَ الْمُهَاجِرِيْنَ رَجُلاً مِّنَ الْأَنْصَارِ فَقَالَ الْأَنْصَارِيُّ يَا لَلْأَنْصَارِ وَقَالَ الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِيْنَ فَسَمِعَ ذٰلِكَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا بَالُ دَعْوٰی جَاهِلِيَّةٍ؟ قَالُوْا يَا رَسُوْلَ اللّٰهِ ! كَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِيْنَ رَجُلاً مِّنَ الْأَنْصَارِ فَقَالَ دَعُوْهَا فَإِنَّهَا مُنْتِنَةٌ، فَسَمِعَ بِذٰلِكَ عَبْدُ اللّٰهِ بْنُ أُبَيٍّ فَقَالَ فَعَلُوْهَا؟  أَمَا وَاللّٰهِ ! لَئِنْ رَجَعْنَا إِلَی الْمَدِيْنَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ فَبَلَغَ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقَامَ عُمَرُ فَقَالَ يَا رَسُوْلَ اللّٰهِ ! دَعْنِيْ  أَضْرِبْ عُنُقَ هٰذَا الْمُنَافِقِ فَقَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ دَعْهُ لاَ يَتَحَدَّثُ النَّاسُ أَنَّ مُحَمَّدًا يَقْتُلُ أَصْحَابَهُ وَكَانَتِ الْأَنْصَارُ أَكْثَرَ مِنَ الْممُهَاجِرِيْنَ حِيْنَ قَدِمُوا الْمَدِيْنَةَ، ثُمَّ إِنَّ الْمُهَاجِرِيْنَ كَثُرُوْا بَعْدُ ] [بخاري، التفسیر، باب قولہ : «سواء علیھم أستغفرت لھم » : ۴۹۰۵ ] ’’ایک بار ہم ایک لشکر میں تھے تو ایک مہاجر آدمی نے ایک انصاری کو اس کے پیچھے کی جانب لات مار دی۔‘‘ تو انصاری نے کہا : ’’او انصاریو!‘‘ اور مہاجر نے کہا : ’’او مہاجرو!‘‘ رسول اللہ صلی اللہ علیہ وسلم نے سنا تو فرمایا : ’’جاہلیت کی اس پکار کا کیا معاملہ ہے؟‘‘ لوگوں نے بتایا کہ ایک مہاجر نے ایک انصاری کے پیچھے کی جانب لات مار دی ہے، تو آپ نے فرمایا : ’’اس (جاہلیت کی پکار) کو چھوڑ دو، کیونکہ یہ بہت بدبو دار ہے۔‘‘ یہ بات عبداللہ بن اُبی نے سنی تو کہنے لگا : ’’انھوں نے ایسا کیا ہے؟ یاد رکھو! اگر ہم مدینہ واپس پہنچے تو جو زیادہ عزت والا ہے وہ ذلیل تر کو اس سے ضرور نکال باہر کرے گا۔‘‘ یہ بات نبی صلی اللہ علیہ وسلم کو پہنچی تو عمر رضی اللہ عنہ کھڑے ہو گئے اور کہا : ’’یا رسول اللہ! مجھے اجازت دیں کہ میں اس منافق کی گردن اڑا دوں۔‘‘ تو نبی صلی اللہ علیہ وسلم نے فرمایا : ’’اسے رہنے دو، لوگ یہ بات نہ کریں کہ محمد اپنے ساتھیوں کو قتل کرتا ہے۔‘‘ اور انصار مہاجرین سے زیادہ تھے جب وہ مدینہ میں آئے، پھر بعد میں مہاجرین زیادہ ہوگئے۔‘‘ ¤ ➋ { وَ لِلّٰهِ الْعِزَّةُ وَ لِرَسُوْلِهٖ وَ لِلْمُؤْمِنِيْنَ۠ وَ لٰكِنَّ الْمُنٰفِقِيْنَ لَا يَعْلَمُوْنَ:} یعنی یہ منافقین جو کہہ رہے ہیں کہ زیادہ عزت والا ذلیل تر کو نکال باہر کرے گا، تو انھیں معلوم نہیں کہ زیادہ عزت والا بلکہ ساری عزت کا مالک کون ہے۔ سو انھیں معلوم ہونا چاہیے کہ عزت کا اصل مالک تو اللہ تعالیٰ ہے، پھر وہ ہے جسے وہ عزت عطا فرمائے۔ (دیکھیے نساء : ۱۳۹۔ آل عمران : ۲۶) اور اس نے عزت اپنے رسول اور مومن بندوں کے لیے مقرر فرمائی ہے۔ سو یہ سوچ لیں کہ اگر عزت والے نے ذلیل تر کو مدینہ سے نکالنے کا ارادہ کر لیا تو اس فیصلے کی زد بھی انھی منافقین پر پڑے گی، مگر ان جاہلوں کو علم ہی نہیں۔ ¤ ➌ جابر بن عبداللہ رضی اللہ عنھما سے جو حدیث اوپر نقل کی گئی ہے، ترمذی میں اس کے آخر میں یہ الفاظ ہیں : [ فَقَالَ لَهُ ابْنُهُ عَبْدُ اللّٰهِ بْنُ عَبْدِ اللّٰهِ : وَاللّٰهِ ! لاَ تَنْقَلِبُ حَتّٰی تُقِرَّ أَنَّكَ الذَّلِيْلُ وَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ الْعَزِيْزُ فَفَعَلَ ] [ [ترمذي، تفسیر القرآن، سورۃ المنافقون : ۳۳۱۵، وقال الألباني صحیح ] ’’تو اس (عبداللہ بن اُبی) کے بیٹے عبداللہ بن عبداللہ رضی اللہ عنہ نے اس سے کہا : ’’اللہ کی قسم! تم واپس نہیں جاؤ گے حتیٰ کہ اقرار کرو کہ تم ہی ذلیل ہو اور رسول اللہ صلی اللہ علیہ وسلم ہی عزیز ہیں۔‘‘ چنانچہ اس نے ایسے ہی کیا۔‘‘"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تُلْهِكُمْ اَمْوَالُكُمْ وَ لَاۤ اَوْلَادُكُمْ: ’’لاَ تُلْهِ‘‘ ’’لَهْوٌ‘‘} میں سے باب افعال {’’أَلْهٰي يُلْهِيْ‘‘} کا نہی مؤنث غائب کا صیغہ ہے، {’’كُمْ‘‘} اس کا مفعول بہ اور {’’ اَمْوَالُكُمْ وَ لَاۤ اَوْلَادُكُمْ ‘‘} فاعل ہے۔ فاعل جمع مکسر ہونے کی وجہ سے فعل واحد مؤنث کا صیغہ لایا گیا ہے۔ ¤ ➋ منافقین کے برے اعمال کا حال بیان کرنے کے بعد تمام ایمان لانے والوں کو خواہ وہ مخلص ہیں یا منافق، ان دو چیزوں سے ہوشیار رہنے کی نصیحت فرمائی جو انسان کے لیے فتنہ ہیں اور نفاق کا باعث بنتی ہیں، جیسا کہ فرمایا : « اَنَّمَااَمْوَالُكُمْ وَ اَوْلَادُكُمْ فِتْنَةٌ » [ التغابن : ۱۵ ] ’’تمھارے مال اور تمھاری اولاد تو محض ایک آزمائش ہیں۔‘‘ اور فرمایا، دیکھنا! تمھارے اموال اور تمھاری اولاد تمھیں اللہ کی یاد سے غافل نہ کر دیں کہ ان کی وجہ سے نماز چھوڑ دو، یا اللہ کی راہ میں خرچ کرنا یا جہاد کے لیے نکلنا چھوڑ دو، یا ان کی وجہ سے جھوٹ اور خیانت کا ارتکاب کرنے لگو۔ اس سے معلوم ہوا کہ اگر آدمی کو اس کے اموال و اولاد اللہ کے ذکر سے غافل نہ کریں تو وہ قابل مذمت نہیں ہیں اور یہ بھی معلوم ہوا کہ اموال و اولاد کے علاوہ کوئی اور چیز اللہ کے ذکر سے غافل کرتی ہے تو وہ بھی مذموم ہے، مثلاً کھیل تماشے، دوستوں کی مجلس اور نام و نمود کی خواہش وغیرہ۔ کعب بن عیاض رضی اللہ عنہ فرماتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : [ إِنَّ لِكُلِّ أُمَّةٍ فِتْنَةً، وَإِنَّ فِتْنَةَ أُمَّتِي الْمَالُ  ] [ مسند أحمد : 160/4، ح : ۱۷۴۷۱، قال المحقق حدیث صحیح ] ’’ہر امت کے لیے کوئی نہ کوئی فتنہ ہے اور میری امت کا فتنہ مال ہے۔‘‘ یعلیٰ عامری رضی اللہ عنہ بیان کرتے ہیں کہ حسن اور حسین رضی اللہ عنھما دوڑتے ہوئے نبی صلی اللہ علیہ وسلم کی طرف آئے، آپ نے انھیں اپنے ساتھ چمٹا لیا اور فرمایا : [ إِنَّ الْوَلَدَ مَبْخَلَةٌ مَججْبَنَةٌ ] [ ابن ماجہ، الأدب، باب بر الوالد و الإحسان إلی البنات : ۳۶۶۶ ]’’بے شک اولاد بخیل بننے اور بزدل بننے کا باعث ہے۔‘‘ مزید دیکھیے سورۂ کہف کی آیت (۴۶) : «اَلْمَالُ وَ الْبَنُوْنَ زِيْنَةُ الْحَيٰوةِ الدُّنْيَا » کی تفسیر۔ ¤ ➌ { عَنْ ذِكْرِ اللّٰهِ: ’’ ذِكْرِ اللّٰهِ ‘‘} سے صرف نماز، روزہ اور زبانی ذکر مراد نہیں، بلکہ ہر کام کے وقت اپنے رب کو یاد رکھنا مراد ہے کہ اگر مالک کی اجازت ہے تو وہ کام کرے، اگر نہیں تو نہ کرے۔ اسی طرح ہر وہ کام کرنے کی حتی الوسع کوشش کرے جس کا اس نے حکم دیا ہے اور اس سے رک جائے جس سے اس نے منع فرمایا ہے۔ ¤ ➍ {وَ مَنْ يَّفْعَلْ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْخٰسِرُوْنَ: ’’ الْخٰسِرُوْنَ ‘‘} پر الف لام لانے اور اس سے پہلے ضمیر فصل سے تاکید اور حصر کا مفہوم پیدا ہوگیا کہ اصل خسارے والے صرف وہ لوگ ہیں جنھیں ان کے اموال و اولاد اللہ کی یاد سے غافل کر دیں۔ اگر اللہ کی یاد پر قائم رہنے کی وجہ سے اموال و اولاد کا نقصان ہو جائے تو اللہ تعالیٰ نے اسے خسارہ تسلیم ہی نہیں فرمایا، کیونکہ اموال و اولاد فانی ہیں اور اللہ کی یاد باقی ہے۔ جو باقی کو چھوڑ کر فانی میں مشغول ہو جائے اصل خسارے میں پڑنے والا وہ ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {وَ اَنْفِقُوْا مِنْ مَّا رَزَقْنٰكُمْ … : ’’ مِنْ مَّا رَزَقْنٰكُمْ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ بقرہ کی تیسری آیت کی تفسیر۔ نفاق سے محفوظ رہنے کے لیے اللہ تعالیٰ کی عطا کردہ نعمتوں میں سے جتنا ہو سکے مرنے سے پہلے خرچ کرنے کا حکم دیا۔ ¤ ➋ { مِنْ قَبْلِ اَنْ يَّاْتِيَ اَحَدَكُمُ الْمَوْتُ فَيَقُوْلَ … :} یعنی مرتے وقت یہ دعا اور تمنا کرنا بے کار ہے، عقل مند کا کام یہ ہے کہ مہلت سے فائدہ اٹھائے اور مرنے سے پہلے آخرت کا سامان تیار کرے۔ دیکھیے سورۂ ابراہیم (۴۴) اور سورۂ مومنون (۹۹، ۱۰۰)۔ ¤ ➌ {فَاَصَّدَّقَ وَ اَكُنْ مِّنَ الصّٰلِحِيْنَ:’’ فَاَصَّدَّقَ ‘‘} اصل میں {’’فَأَتَصَدَّقُ‘‘} ہے، اس پر نصب اس لیے آیا ہے کہ یہ{’’ لَوْ لَاۤ ‘‘} کے جواب میں ہے جو تحضیض کے لیے ہے اور اس میں طلب اور شرط کا مفہوم پایا جاتا ہے اور اس پر ’’فاء‘‘ آ رہی ہے جس کے بعد {’’أَنْ‘‘} ناصبہ مقدر ہے اور {’’ اَكُنْ ‘‘} مجزوم اس لیے ہے کہ اس کا عطف جواب شرط کے محل پر ہے اور اس پر ’’فاء‘‘ نہیں آ رہی، گویا اصل کلام اس طرح ہے : {’’رَبِّ أَخِّرْنِيْ إِلٰی أَجَلٍ قَرِيْبٍ فَإِنْ أَخَّرْتَنِيْ أَتَصَدَّقْ وَ أَكُنْ مِّنَ الصَّالِحِيْنَ۔‘‘}"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {وَ لَنْ يُّؤَخِّرَ اللّٰهُ نَفْسًا اِذَا جَآءَ اَجَلُهَا:} اس کی تفصیل کے لیے دیکھیے سورۂ یونس کی آیت (۴۹) کی تفسیر۔ ¤ ➋ { وَ اللّٰهُ خَبِيْرٌۢ بِمَا تَعْمَلُوْنَ:} اس میں تنبیہ ہے کہ ہر کام کرتے وقت یاد رکھو کہ اللہ تعالیٰ کو تمھارے ہر عمل کی پوری خبر ہے۔ اس کے علاوہ اس میں نیک عمل والوں کے لیے وعدہ ہے اور برے عمل والوں کے لیے وعید ہے۔"
    }
  ]
}