{
  "surah": "At-Taghaabun",
  "surah_number": 64,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { يُسَبِّحُ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ:} اس کی وضاحت کے لیے دیکھیے سورۂ حدید (۱) اور سورۂ حشر (ا) کی تفسیر۔ {’’ يُسَبِّحُ ‘‘} (مضارع) کی وضاحت کے لیے دیکھیے سورۂ جمعہ کی پہلی آیت کی تفسیر اور تسبیح کے مفہوم کے لیے دیکھیے سورۂ بنی اسرائیل کی آیت (۴۴) کی تفسیر۔ ¤ ➋ {’’ لَهُ الْمُلْكُ ‘‘} کے لیے دیکھیے سورۂ ملک کی پہلی آیت کی تفسیر اور {’’ وَ لَهُ الْحَمْدُ ‘‘} کے لیے دیکھیے سورۂ فاتحہ کی پہلی آیت کی تفسیر۔ ¤ ➌ فرمایا آسمان و زمین میں جو بھی چیز ہے وہ زبان قال و حال سے شہادت دے رہی ہے کہ اللہ تعالیٰ ہر عیب اور ہر کمی سے پاک ہے۔ اس کے بعد اللہ تعالیٰ کی متعدد صفات خلق، قدرت اور علم وغیرہ اور ان کے مظاہر بیان فرمائے جن سے اللہ تعالیٰ کے وجود، اس کی توحید، تسبیح، قیامت اور رسالت کا حق ہونا ثابت ہوتا ہے، پھر کفار کے قیامت اور رسولوں کے انکار کا ردّ فرمایا اور انھیں اللہ، اس کے رسول اور اس پر نازل کردہ وحی پر ایمان لانے کا حکم دیا۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ {هُوَ الَّذِيْ خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَّ مِنْكُمْ مُّؤْمِنٌ:} یعنی اتنی صفات کے مالک ہی نے تمھیں پیدا کیا اور دوسری مخلوقات کی طرح تمھیں بھی ہر بات میں اپنے تکوینی حکم کا پابند کر دینے کے بجائے ایمان و کفر دونوں راستے واضح فرما کر تمھیں ان میں سے کسی ایک پر چلنے کا اختیار بخشا۔ اب حق تو یہ تھا کہ تم اپنے پیدا کرنے والے کا شکر ادا کرتے ہوئے اس پر ایمان لاتے، مگر اس کے بجائے تم دو گروہوں میں بٹ گئے۔ چنانچہ تم میں سے کچھ کفر کرنے والے ہیں اور کچھ ایمان لانے والے۔ اب یہ خیال مت کرنا کہ تمھارے اس کفرپر تم سے کوئی بازپرس نہیں ہوگی، یا ایمان لانے پر کوئی جزا نہیں ملے گی، بلکہ تم جو کچھ کر رہے ہو اللہ تعالیٰ اسے پوری طرح دیکھنے والا ہے، وہ ہر ایک کو اس کے عمل کے مطابق سزا یا جزا دے گا۔ یہاں {’’ فَمِنْكُمْ كَافِرٌ ‘‘} کا ذکر پہلے اس لیے فرمایا کہ مقصود ناراضی کا اظہار ہے کہ اتنی صفات کے مالک اور اپنے خالق کے ساتھ بھی تم میں سے کئی کفر کرنے والے ہیں۔ اس کے علاوہ اس بات کا اظہار بھی ہے کہ کفر کرنے والے زیادہ ہیں۔ (دیکھیے بنی اسرائیل : ۸۹۔ سبا : ۲۰) اس آیت میں وہی بات بیان ہوئی ہے جو تفصیل کے ساتھ سورہ دہر کی ان آیات میں ہے، فرمایا : « اِنَّا خَلَقْنَا الْاِنْسَانَ مِنْ نُّطْفَةٍ اَمْشَاجٍ نَّبْتَلِيْهِ فَجَعَلْنٰهُ سَمِيْعًۢا بَصِيْرًا (2) اِنَّا هَدَيْنٰهُ السَّبِيْلَ اِمَّا شَاكِرًا وَّ اِمَّا كَفُوْرًا (3) اِنَّاۤ اَعْتَدْنَا لِلْكٰفِرِيْنَ سَلٰسِلَاۡ وَ اَغْلٰلًا وَّ سَعِيْرًا (4) اِنَّ الْاَبْرَارَ يَشْرَبُوْنَ مِنْ كَاْسٍ كَانَ مِزَاجُهَا كَافُوْرًا » [ الدہر : ۲ تا ۵ ] ’’بلاشبہ ہم نے انسان کو ایک ملے جلے قطرے سے پیدا کیا، ہم اسے آزماتے ہیں، سو ہم نے اسے خوب سننے والا، خوب دیکھنے والا بنا دیا۔بلاشبہ ہم نے اسے راستہ دکھا دیا، خواہ وہ شکر کرنے والا بنے اور خواہ نا شکرا۔یقینا ہم نے کافروں کے لیے زنجیریں اور طوق اور بھڑکتی ہوئی آگ تیار کی ہے۔بلاشبہ نیک لوگ ایسے جام سے پییں گے جس میں کافور ملا ہوا ہو گا۔‘‘ ¤ ➋ اس آیت سے معلوم ہوا کہ خلق کے وقت کوئی کافر نہیں ہوتا، بلکہ پیدا ہوتے وقت ہر انسان فطرت پر ہوتا ہے، پھر بعد میں کفر اختیار کرتاہے یا ایمان پر قائم رہتا ہے ۔ تفصیل کے لیے دیکھیے سورۂ روم (۳۰ تا ۳۲) کی تفسیر۔ ¤ ➌ یہ بھی معلوم ہوا کہ تمام لوگوں کی دو ہی قسمیں ہیں، یا تو مومن ہیں جو اللہ تعالیٰ پر ، اس کے فرشتوں پر، اس کی کتابوں پر، اس کے رسولوں پر ، یوم آخرت پر اور تقدیر پر ایمان رکھتے ہیں یا پھر کافر ہیں، تیسری کوئی قسم نہیں جو نہ مومن ہوں نہ کافر۔ مومن گناہ کرے تو اس کی وجہ سے اسے ایمان سے خارج یا کافر قرار نہیں دیاجائے گا اور نہ ہی یہ کہا جائے گا کہ یہ نہ مومن ہے نہ کافر، بلکہ وہ ناقص ایمان والا مومن ہے اور اسے اس وقت تک مومن ہی کہا جائے گا جب تک وہ ان چیزوں پر ایمان رکھتا ہے جن کا دین ہونا سب کو معلوم ہے۔ اگر وہ ان میں سے کسی چیز کا انکار کرے یا ایسا کام کرے جو مرتد ہونے کی علامت ہے تو پھر وہ مومن نہیں بلکہ کافر ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ بِالْحَقِّ:} حق سے مراد یہاں حکمت و مصلحت ہے اور ان کی پیدائش کی بے شمار حکمتوں میں سے ایک یہ ہے کہ انسان کی پیدائش سے پہلے ہی ا للہ تعالیٰ نے ایسی تمام چیزیں پیدا فرما دیں جو انسان کی بقا کے لیے ضروری تھیں اور انھیں انسان کی خدمت پر مامور کر دیا، جیسا کہ فرمایا : «هُوَ الَّذِيْ خَلَقَ لَكُمْ مَّا فِي الْاَرْضِ جَمِيْعًا » [البقرۃ : ۲۹ ] ’’وہی ہے جس نے زمین میں جو کچھ ہے سب تمھارے لیے پیدا کیا ۔‘‘ مزید دیکھیے سورۂ زمر (۵)۔ ¤ ➋ { وَ صَوَّرَكُمْ فَاَحْسَنَ صُوَرَكُمْ:} اللہ تعالیٰ نے جو چیز پیدا فرمائی اچھی پیدا فرمائی۔ (دیکھیے سجدہ : ۷) یہاں فرمایا کہ اس نے تمھاری صورت بنائی تو تمھاری صورتیں اچھی بنائیں۔ (دیکھیے مومن: ۶۴۔ انفطار: ۶ تا ۸) دوسری جگہ فرمایا کہ ہم نے انسان کو (اچھی ہی نہیں بلکہ) سب سے اچھی بناوٹ میں پیدا فرمایا، جیسا کہ اللہ تعالیٰ کا فرمان ہے : « لَقَدْ خَلَقْنَا الْاِنْسَانَ فِيْۤ اَحْسَنِ تَقْوِيْمٍ » [ التین : ۴ ] ’’بلاشبہ یقینا ہم نے انسان کو سب سے اچھی بناوٹ میں پیدا کیا ہے۔ ‘‘ ظاہری شکل و صورت میں بھی اور ذہنی اور عقلی استعداد کے لحاظ سے بھی انسان کو بہترین بناوٹ عطا ہوئی ہے، کسی دوسری مخلوق میں ایسی عقلی استعداد نہیں ہے۔ کوئی انسان کتنا بھی بدصورت ہو، کبھی نہیں چاہے گا کہ اسے کسی اور مخلوق کی شکل میں تبدیل کر دیا جائے، خواہ وہ کتنی خوبصورت ہو۔ ¤ ➌ { وَ اِلَيْهِ الْمَصِيْرُ:} یعنی ساری کائنات کی پیدائش خصوصاً انسان کو اتنی بہترین بناوٹ میں پیدا کرنا بے مقصد نہیں بلکہ تمھاری آزمائش کے لیے ہے، جیسا کہ فرمایا : « لِيَبْلُوَكُمْ اَيُّكُمْ اَحْسَنُ عَمَلًا » [ ہود : ۷ ] ’’تاکہ وہ تمھیں آزمائے کہ تم میں سے کون عمل میں زیادہ اچھا ہے۔‘‘ اور اس کے لیے تمھیں مرنے کے بعد قیامت کے دن دوبارہ زندہ ہو کر اس کی طرف واپس جانا ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {يَعْلَمُ مَا فِي السَّمٰوٰتِ وَ الْاَرْضِ وَ يَعْلَمُ … :} یہ اس سوال کا جواب ہے کہ جب انسان کے جسم کا ہر ذرہ منتشر ہو جائے گا اور اس نے جو کچھ کیا وہ معدوم ہوچکا ہو گا تو اسے دوبارہ کیسے زندہ کیا جائے گا اور اس کے اعمال کی کسی کو کیا خبر ہو گی کہ ان کے مطابق اسے جزا یا سزا دی جائے۔ فرمایا وہ ہر اس چیز کو جانتا ہے جو آسمانوں میں ہے اور جو زمین میں ہے (اور وہ ہر جاندار کے زندگی میں ٹھکانے کو جانتا ہے اور اس بات کو بھی کہ مرنے کے بعد وہ کہاں ہے۔ دیکھیے ہود: ۶) اس لیے اسے کچھ مشکل نہیں کہ جو جہاں بھی ہے اسے دوبارہ زندہ کر دے اور وہ تمھارے تمام اعمال سے واقف ہے خواہ تم انھیں چھپاتے ہو یا ظاہر کرتے ہو۔ (دیکھیے رعد : ۹، ۱۰) بلکہ وہ سینوں کی بات اور نیتوں کو بھی خوب جاننے والا ہے، سو اس کے لیے تمھارے اعمال کا محاسبہ کچھ مشکل نہیں۔ پچھلی آیات میں مذکور صفات خصوصاً خلق میں اس کی کامل قدرت کا بیان تھا، اس آیت میں اس کے کامل علم کا بیان ہے، پھر جو علیم بھی ہے اور قدیر بھی اور جس نے پہلے ہر چیز کو پیدا کیا اور ہر چیز کا پورا علم رکھتا ہے، وہ تمھیں دوبارہ پید اکیوں نہیں کرسکتا اور محاسبہ کیوں نہیں کرسکتا؟"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { اَلَمْ يَاْتِكُمْ نَبَؤُا الَّذِيْنَ كَفَرُوْا مِنْ قَبْلُ فَذَاقُوْا وَبَالَ اَمْرِهِمْ:} یعنی اگر تم اپنے اس خالق پر ایمان نہ لائے اور اس کے ساتھ کفر پر ڈٹے رہے جو ان صفات کا مالک ہے اور جس کی طرف تمھیں واپس جانا ہے، تو کیا تمھیں ان لوگوں کی خبر نہیں پہنچی جنھوں نے اس سے پہلے اپنے خالق و مالک کے علاوہ اس کے رسولوں اور آخرت کا بھی انکار کیا، مثلاً قوم نوح، عاد و ثمود اور آل فرعون وغیرہ جو مال و دولت اور قوت و شوکت میں تم سے کہیں زیادہ تھے۔ (دیکھیے روم : ۹) قریش مکہ کا گزر اکثر شام اور یمن کی طرف سفر میں ان کی برباد شدہ بستیوں پرہوتا تھا اورعرب میں ان کے واقعات مشہور تھے۔ ¤ ➋ { فَذَاقُوْا وَبَالَ اَمْرِهِمْ وَ لَهُمْ عَذَابٌ اَلِيْمٌ:} یعنی انھوں نے دنیا ہی میں اپنے کفر اور سرکشی کا وبال چکھ لیا، مگر یہ ان کی پوری اور اصل سزا نہ تھی بلکہ یہ صرف دنیا میں ان کے اعمال بد کا نتیجہ تھا جو دوسروں کو عبرت دلانے کے لیے دکھایا گیا تھا، جس سے تمھیں بھی عبرت حاصل کرنی چاہیے۔ اصل سزا کے طور پر ان کے لیے نہایت درد ناک عذاب تیار ہے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { ذٰلِكَ بِاَنَّهٗ كَانَتْ تَّاْتِيْهِمْ رُسُلُهُمْ بِالْبَيِّنٰتِ: ’’ بِاَنَّهٗ ‘‘} میں {’’ هٗ ‘‘} ضمیر کو ضمیر شان کہا جاتا ہے، اس کا مقصد اس بات کی اہمیت کا اظہار ہوتا ہے جو بعد میں آ رہی ہوتی ہے۔’’بینات‘‘ کا لفظی معنی واضح اور روشن چیزیں ہے۔ رسول جو بینات لے کر آئے ان میں وہ معجزے بھی شامل ہیں جو ان کی رسالت کی واضح دلیل تھے اور اللہ تعالیٰ کی نازل کردہ آیات اور عقلی دلائل بھی جو بالکل واضح اور روشن تھے، جنھیں سمجھنے میں کوئی دشواری نہیں تھی، ان بینات کو دیکھ اور سن کر ان کے رسول ہونے کا یقین حاصل ہوتا تھا۔ ¤ ➋ { فَقَالُوْۤا اَبَشَرٌ يَّهْدُوْنَنَا: ’’بَشَرٌ ‘‘} اسم جنس ہے جو جمع پر بھی بولا جاتا ہے، جیسا کہ یہاں {’’ يَهْدُوْنَنَا ‘‘} سے ظاہر ہے اور واحد پر بھی، جیسا کہ فرمایا : « اَبَشَرًا مِّنَّا وَاحِدًا نَّتَّبِعُهٗۤ » [ القمر : ۲۴ ] ’’کیا ایک آدمی جو ہمیں سے ہے اکیلا، ہم اس کے پیچھے لگ جائیں؟ ‘‘کفار کے قول میں {’’ بَشَرٌ ‘‘} کو تحقیر کے لیے بطور نکرہ استعمال کیا گیا ہے، گویا وہ کہہ رہے ہیں ’’کیا یہ عام سے بشرہماری رہنمائی کریں گے؟‘‘وہ کسی بشر کو رسول ماننے کے لیے تیار نہیں تھے، خواہ اس کی رسالت ہر طرح سے ثابت ہوجائے۔ ان کے خیال میں رسول فرشتہ ہوناچاہیے یا خود اللہ تعالیٰ کو ان کے پاس آنا چاہیے۔ (دیکھیے فرقان : ۲۱) یہی وتیرہ پہلے تمام انبیاء کے منکرین کا تھا اور یہی کفار قریش نے اختیار کیا۔ اللہ تعالیٰ نے متعدد مقامات پر ان کے اس باطل خیال کا ذکر کیا اور اس کا ردّ فرمایا۔ دیکھیے بنی اسرائیل(95،94)، ابراہیم (11،10)، کہف (۱۱۰)، مومنون (۳۳)، شعراء (۸۶)، یٰس ( ۱۵) اور سورۂ انعام(۹۱)۔ ¤ ➌ { فَكَفَرُوْا وَ تَوَلَّوْا وَّ اسْتَغْنَى اللّٰهُ… :} جب انھوں نے بشر کی رسالت کو محال قرار دیا تو اس کا واضح نتیجہ یہی تھا کہ انھوں نے رسولوں پر ایمان لانے سے انکار کر دیا اور منہ پھیر لیا اور اللہ تعالیٰ نے بھی کچھ پروا نہ کی، کیونکہ اللہ تعالیٰ کسی کا محتاج نہیں، وہ ساری کائنات سے مستغنی اور بے پروا ہے۔ وہ اکیلا تمام خوبیوں کا مالک ہے، کسی کے کفر سے اسے کوئی نقصان نہیں اور نہ ہی کسی کے ایمان سے اس کا کوئی فائدہ ہے۔ ایمان کا فائدہ اور کفر کا نقصان خود انسان ہی کو ہے۔ مزید دیکھیے سورۂ آلِ عمران( ۹۷) اور سورۂ زمر (۷) کی تفسیر۔ ¤ ➍ کفار کا معاملہ عجیب ہے، وہ بشر کو رسول ماننے کے لیے تیار نہیں مگر پتھر، لکڑی اور دھات کے بتوں کو رب مانتے ہیں، وہ اللہ تعالیٰ کی طرف سے نازل کردہ بینات دیکھ کر بھی یہ کہہ کر ایمان نہیں لاتے کہ’’کیا کوئی بشر ہماری رہنمائی کریں گے؟ ‘‘ گویا انھیں کسی بشر کی رہنمائی قبول نہیں، خواہ وہ کتنی درست اور کتنی عمدہ ہو، جبکہ وہ اپنے بڑوں کی غلط راہ پر اندھا دھند چل رہے ہیں، حالانکہ وہ بھی بشر تھے، جیساکہ فرمایا : « قَالُوْۤا اِنَّا وَجَدْنَاۤ اٰبَآءَنَا عَلٰۤى اُمَّةٍ وَّ اِنَّا عَلٰۤى اٰثٰرِهِمْ مُّهْتَدُوْنَ» [ الزخرف : ۲۲ ] ’’انھوں نے کہا کہ بے شک ہم نے اپنے باپ دادا کو ایک راستے پر پایا ہے اور بے شک ہم انھی کے قدموں کے نشانوں پر راہ پانے والے ہیں۔‘‘ اگر کسی بشر کی راہ پر چلنا انھیں منظور نہیں تو بڑوں کی راہ پر کیوں چلتے ہیں؟ اصل بات یہ ہے کہ وہ اللہ کی راہ پر چلنے کے لیے تیار نہیں، کیونکہ شیطان نے انھیں اور ان کے بڑوں کو اپنی راہ پر لگا رکھا ہے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {زَعَمَ الَّذِيْنَ كَفَرُوْۤا اَنْ لَّنْ يُّبْعَثُوْا: ’’ زَعَمَ ‘‘} کا لفظ گمان کرنے کے معنی میں بھی آتا ہے، کسی بات کا دعویٰ کرنے کے معنی میں بھی اور جھوٹ کہنے کے معنی میں بھی۔ اللہ تعالیٰ نے کفار کا دعویٰ حرف تاکید {’’ لَنْ ‘‘} کے ساتھ ذکر فرمایا، مگر یہ دعویٰ کرنے کو زعم قرار دیا۔ گویا ان کا تاکید کے ساتھ کہنا کہ انھیں ہر گز اٹھایا نہیں جائے گا، سراسر گمان اور جھوٹ ہے۔ گمان اس لیے کہ ان کے پاس کوئی ایسا ذریعۂ علم نہیں جس کی بنیاد پر وہ یقین سے کہہ سکیں کہ دوبارہ زندگی نہیں ہوسکتی۔ انسان کے پاس ایسا ذریعۂ علم نہ کبھی آج سے پہلے تھا، نہ آج ہے اور نہ ہی آئندہ ہو سکتا ہے، پھر اس دعویٰ کو اس زور شور سے بیان کرنا کیا معنی رکھتا ہے؟ انسان زیادہ سے زیادہ یہی کچھ کہہ سکتا ہے کہ مرنے کے بعد جی اٹھنے اور نہ اٹھنے کے دونوں احتمال موجود ہیں، لیکن جی اٹھنے کی تردید میں وہ کوئی دلیل پیش نہیں کرسکتا۔ ¤ ➋ { قُلْ بَلٰى وَ رَبِّيْ لَتُبْعَثُنَّ:} یعنی جب وہ محض گمان کی بنیاد پر اتنی تاکید کے ساتھ قیامت کا انکار کر رہے ہیں تو آپ ان کے ردّ میں اس سے زیادہ تاکید کے ساتھ کہیں کہ میں تمھارے اس دعوے کے مقابلے میں اللہ کی طرف سے وحی کے علم کی بنیاد پر پورے یقین کے ساتھ اپنے رب کی قسم اٹھا کر کہتا ہوں کہ تم ضرور بالضرور اٹھائے جاؤ گے۔ رسول اللہ صلی اللہ علیہ وسلم کے مخاطب مانتے تھے کہ آپ صلی اللہ علیہ وسلم نے کبھی جھوٹ نہیں بولا۔ اللہ تعالیٰ نے آپ کو قسم کے ساتھ یہ بات کہنے کا حکم دیا، تاکہ انھیں اس کا یقین ہو جائے، کیونکہ انسان کی عادت ہے کہ قسم کھا کر بات کی جائے تو اسے یقین ہو جاتا ہے۔یہ تیسری جگہ ہے جہاں اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم کو قسم کھا کر قیامت کا یقین دلانے کا حکم دیا ہے۔ پہلے سورۂ یونس میں فرمایا : «وَ يَسْتَنْۢبِـُٔوْنَكَ اَحَقٌّ هُوَ قُلْ اِيْ وَ رَبِّيْۤ اِنَّهٗ لَحَقٌّ وَ مَاۤ اَنْتُمْ بِمُعْجِزِيْنَ » [ یونس : ۵۳ ]’’ اور وہ تجھ سے پوچھتے ہیں کیا یہ سچ ہی ہے؟ تو کہہ ہاں! مجھے اپنے رب کی قسم ! یقینا یہ ضرور سچ ہے اور تم ہر گز عاجز کرنے والے نہیں ہو۔‘‘ پھر سورۂ سبا میں فرمایا : « وَ قَالَ الَّذِيْنَ كَفَرُوْا لَا تَاْتِيْنَا السَّاعَةُ قُلْ بَلٰى وَ رَبِّيْ لَتَاْتِيَنَّكُمْ» [ سبا : ۳ ]’’اور ان لوگوں نے کہا جنھوں نے کفر کیا ہم پر قیامت نہیں آئے گی۔ کہہ دے کیوں نہیں، قسم ہے میرے رب کی ! وہ تم پر ضرور ہی آئے گی۔ ‘‘ ¤ ➌ { ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ:} اس میں دوبارہ زندہ کیے جانے کا مقصد بیان فرمایا کہ ساری کائنات کو تمھارے فائدے کے لیے مسخر کرنے اور تمھیں ایمان و کفرمیں اختیار دینے کے بعد یہ کیسے ہوسکتا ہے کہ تم سے کوئی بازپرس ہی نہ کی جائے؟ اس لیے اٹھائے جانے کے بعد تمھیں وہ سب کچھ ضرور بالضرور بتایا جائے گا جو تم نے کیا۔ بتانے سے مراد محاسبہ اور سزا دینا ہے، جیسا کہ دھمکی دیتے ہوئے کہا جاتا ہے کہ میں بہت جلد تمھیں بتاؤں گا کہ تم نے کیا کیا۔ ¤ ➍ {وَ ذٰلِكَ عَلَى اللّٰهِ يَسِيْرٌ:} یعنی تمھیں دوبارہ زندہ کرنا اللہ تعالیٰ کے لیے بہت آسان اور بالکل معمولی بات ہے، کیونکہ جس نے تمھیں پہلی دفعہ بنا لیا اس کے لیے دوبارہ بنا لینا تو زیادہ آسان ہے۔ مزید دیکھیے سورۂ یٰس (79،78)، لقمان(۲۸) اور سورۂ روم (۲۷)کی تفسیر۔ کفارِ مکہ جیسا کہ متعدد آیات سے ظاہر ہے، اس بات کے قائل تھے کہ انسانوں کو اللہ تعالیٰ ہی نے پیدا کیا ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {فَاٰمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ وَ النُّوْرِ الَّذِيْۤ اَنْزَلْنَا:} اس ’’فاء‘‘ کو فصیحہ کہتے ہیں، کیو نکہ وہ اس شرط کا اظہار کر رہی ہوتی ہے جو وہاں مقدر ہے، یعنی جب تم یہ سب کچھ جان چکے تو اللہ اور اس کے رسول اور اس نور پر ایمان لے آؤ جو ہم نے نازل کیا ہے، یعنی دل اور زبان سے انھیں سچا مان کر ان کے احکام کی پیروی کرو۔ {’’ النُّوْرِ ‘‘} سے مراد اللہ تعالیٰ کی نازل کردہ وحی ہے، کیونکہ اسی سے اللہ تعالیٰ تک پہنچنے کا راستہ روشن ہوتا ہے، اس میں قرآن و سنت دونوں شامل ہیں۔ دیکھیے سورہ شوریٰ(۵۲) کی تفسیر۔ ¤ ➋ {وَ اللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ:} خبیر ہونے کا مطلب یہ ہے کہ وہ تمھیں تمھارے اعمال کی جزا دے گا۔ اس میں ایمان لانے والوں کے لیے وعدہ اور ایمان نہ لانے والوں کے لیے وعید ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ:} یہ{’’ لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ ‘‘} کا ظرف ہے، قیامت کے دن کو{’’ يَوْمُ الْجَمْعِ ‘‘} اس لیے کہا گیا ہے کہ اس دن تمام پہلے اور پچھلے ایک میدان میں جمع کیے جائیں گے۔ (دیکھیے ہود : ۱۰۳۔ صافات : 50،49۔ شوریٰ : ۷۔ مرسلات : ۳۸) {’’يَوْمُ الْجَمْعِ‘‘} کا معنی یہ بھی ہو سکتا ہے کہ اس دن انسان کے جسم کی ہر ہڈی اور ہر ذرّہ جو منتشر ہوچکا ہوگا جمع کر دیا جائے گا، جیساکہ فرمایا : «اَيَحْسَبُ الْاِنْسَانُ اَلَّنْ نَّجْمَعَ عِظَامَهٗ» [ القیامۃ : ۳ ] ’’کیا انسان گمان کرتا ہے کہ ہم کبھی اس کی ہڈیاں اکٹھی نہیں کریں گے۔‘‘ ¤ ➋ {ذٰلِكَ يَوْمُ التَّغَابُنِ: ’’غَبَنَ‘‘ (ن) ’’فُلَانًا فِي الْبَيْعِ‘‘} بیع میں دوسرے کو نقصان پہنچا کر خود فائدہ حاصل کرلینا۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابنِ عباس رضی اللہ عنھما کا قول نقل فرمایا ہے، انھوں نے {’’ ذٰلِكَ يَوْمُ التَّغَابُنِ ‘‘} کے متعلق فرمایا : [هُوَ اسْمٌ مِّنْ أَسْمَاءِ يَوْمِ الْقِيَامَةِ وَذٰلِكَ أَنَّ أَهْلَ الْجَنَّةِ يَغْبُنُوْنَ أَهْلَ النَّارِ ] ’’ یعنی یوم التغابن قیامت کے ناموں میں سے ایک نام ہے اور یہ نام اس لیے ہے کہ اس دن جنتی جہنمیوں کو نقصان میں رکھ کر خود فائدہ حاصل کریں گے۔‘‘ ابن کثیر رحمہ اللہ نے فرمایا کہ اس نفع و نقصان کی تفصیل خود اللہ تعالیٰ نے آگے بیان فرما دی ہے کہ ایمان اور عمل صالح والوں کو کیا حاصل ہو گا اور کفر و تکذیب والوں کے حصے میں کیا آئے گا۔ ¤ ➌ {وَ مَنْ يُّؤْمِنْۢ بِاللّٰهِ وَ يَعْمَلْ صَالِحًا … :} یہ اس دن کی ہار جیت میں سے جیت والوں کے حصے کا بیان ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {وَ الَّذِيْنَ كَفَرُوْا وَ كَذَّبُوْا بِاٰيٰتِنَاۤ … :} یہ اس دن کی ہار والوں کے حصے کا بیان ہے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {مَاۤ اَصَابَ مِنْ مُّصِيْبَةٍ … :} اس کی تفصیل کے لیے دیکھیے سورۂ حدیدکی آیت (۲۲) کی تفسیر۔ ¤ ➋ { اِلَّا بِاِذْنِ اللّٰهِ:} اس سے پہلی آیات میں اللہ کی توحید، رسولوں کی رسالت اور قیامت کا بیان تھا، اس آیت میں تقدیر پر ایمان کا بیان ہے جس سے آدمی کے دل میں تکلیفیں برداشت کرنے اور ان پر صبر کرنے کی ہمت پیدا ہوتی ہے۔ اس کے علاوہ اس آیت میں ایمان والوں کے لیے تسلی اور کفار کے اس اعتراض کا جواب بھی ہے کہ ایمان والوں پرمصیبتیں کیوں آتی ہیں۔ فرمایا جو مصیبت بھی آتی ہے اللہ کے اذن سے آتی ہے جو اللہ تعالیٰ کے ہاں پہلے سے مقدر ہو چکی ہوتی ہے۔ یہ دنیا میں مومن و کافر سب پر آتی ہے، کیونکہ اس کے بغیر امتحان اور آزمائش کا مقصد حاصل نہیں ہوتا۔ البتہ مومن و کافر پر اس کا اثر اور نتیجہ مختلف ہوتا ہے، مومن اپنے رب پر راضی رہتا ہے جس کے نتیجے میں اللہ تعالیٰ اس کے دل کو ہدایت کی روشنی، یقین اور اطمینان کی نعمت اور آخرت میں جنت عطا فرماتا ہے اور کافر اپنے رب پر ناراض ہوجاتا ہے جس کے نتیجے میں وہ دنیا کے اندر ہر وقت پر یشان اور سراپا شکوہ بنا رہتا ہے اور آخرت میں اس کے لیے جہنم ہے۔ ¤ ➌ یعنی جو بھی مصیبت پہنچتی ہے اللہ کے حکم سے اور اس کے طے شدہ فیصلے اور تقدیر کے مطابق پہنچتی ہے۔ ¤ ➍ { وَ مَنْ يُّؤْمِنْۢ بِاللّٰهِ يَهْدِ قَلْبَهٗ:} یعنی جسے کوئی مصیبت پہنچے اور وہ جان لے کہ یہ اللہ کے فیصلے اور اس کی تقدیر سے ہے، پھر اس پر صبر کرے، ثواب کی نیت رکھے اور اپنے آپ کو پوری طرح اللہ کے فیصلے کے سپرد کر دے تو اللہ تعالیٰ اس کے دل کو ہدایت دیتا ہے اور دنیا میں اس کے ہاتھ سے جو کچھ نکلا یعنی اس سے جو کچھ لیا گیا اس کے بدلے میں اس کے دل میں سیدھی راہ پر چلنے کی توفیق اور سچا یقین عطا فرماتا ہے اور ایسا بھی ہوتا ہے کہ جو کچھ اس سے لیاگیا اس کی جگہ وہی یا اس سے بہتر چیز عطا فرما دیتا ہے۔ اس آیت کی طرح سورۂ بقرہ (۱۵۵ تا ۱۵۷) میں مصیبت پر صبر کرنے والوں کو {’’ الْمُهْتَدُوْنَ ‘‘} (ہدایت والے ) قرار دیا ہے۔ ¤ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ {’’ وَ مَنْ يُّؤْمِنْۢ بِاللّٰهِ يَهْدِ قَلْبَهٗ ‘‘} کے متعلق ابن عباس رضی اللہ عنھما کا قول نقل فرمایا ہے : [يَعْنِيْ يَهْدِ قَلْبَهُ لِلْيَقِيْنِ فَيَعْلَمُ أَنَّ مَا أَصَابَهُ لَمْ يَكُنْ لِيُخْطِه وَمَا أَخْطَأَهُ لَمْ يَكُنْ لِيُصِيْبَهُ ] [ طبري : 12/23، ح : ۳۴۵۰۹ ] ’’یعنی"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {وَ اَطِيْعُوا اللّٰهَ وَ اَطِيْعُوا الرَّسُوْلَ:} سلسلۂ کلام کے مطابق مطلب یہ ہے کہ مصیبت آنے پر اللہ اور اس کے رسول کی اطاعت سے منہ نہ موڑو، بلکہ تمام حالات میں، اچھے ہوں یا برے ، اللہ کا حکم مانو اور اس کے رسول کا حکم مانو۔ {’’ اَطِيْعُوْا ‘‘} کو {’’ الرَّسُوْلَ ‘‘} کے ساتھ دوبارہ لانے سے ظاہر ہے کہ جس طرح اللہ کا حکم مستقل شریعت ہے اسی طرح رسول کا حکم بھی مستقل شریعت ہے، دونوں میں سے کسی کی مخالفت کی گنجائش نہیں۔ دوسرے لوگ جن کا حکم مانا جاتا ہے وہ یہ مقام نہیں رکھتے، ان کا وہی حکم مانا جائے گا جو کتاب و سنت کے خلاف نہ ہو۔ اس نکتے کی وضاحت سورۂ نساء کی آیت (۵۹) : « اَطِيْعُوا اللّٰهَ وَ اَطِيْعُوا الرَّسُوْلَ وَ اُولِي الْاَمْرِ مِنْكُمْ » سے ہوتی ہے کہ{’’ اُولِي الْاَمْرِ ‘‘} کے ساتھ {’’ اَطِيْعُوْا ‘‘} کو دوبارہ نہیں لایا گیا۔ تفصیل کے لیے دیکھیے سورہ نساء(۵۹) کی تفسیر۔ ¤ ➋ { فَاِنْ تَوَلَّيْتُمْ فَاِنَّمَا عَلٰى رَسُوْلِنَا الْبَلٰغُ الْمُبِيْنُ:} پھر اگر مصیبتوں سے گھبرا کر تم نے اطاعت سے منہ موڑ لیا تو اپنا ہی نقصان کروگے، ہمارے رسول کے ذمے صرف یہ ہے کہ وہ اللہ کے احکام صاف صاف تم تک پہنچا دیں، سو وہ اس نے پہنچا دیے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) { اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ وَ عَلَى اللّٰهِ … :} یعنی جس طرح تقدیر اللہ تعالیٰ کے ہاتھ میں ہے اور جو بھی مصیبت یا راحت ہے اسی کے حکم سے آتی ہے، اسی طرح یاد رکھو کہ اللہ تعالیٰ ہی وہ ہستی ہے جو ہر عبادت کی مستحق ہے، اس کے سوا کوئی معبود نہیں، اس لیے رنج ہو یا راحت ہر حال میں اسی کو پکارو اور اسی پر توکل رکھو، کیونکہ پکارنا بھی عبادت ہے اور توکل بھی عبادت ہے اور جو اللہ پر ایمان رکھتا ہو اس کے پاس اس اکیلے پر بھروسا کرنے کے سوا کوئی راستہ نہیں، کیونکہ کسی دوسرے کے ہاتھ میں رنج یا راحت میں سے کچھ ہے ہی نہیں کہ اس پر بھروسا کیا جاسکے۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنَّ مِنْ اَزْوَاجِكُمْ وَ اَوْلَادِكُمْ عَدُوًّاا لَّكُمْ … : ’’ عَدُوًّا ‘‘ ’’فَعُوْلٌ‘‘} کا وزن ہے، واحد اور جمع دونوں کے لیے استعمال ہوتا ہے، {’’ فَاحْذَرُوْهُمْ ‘‘} سے ظاہر ہے کہ یہاں جمع کے لیے استعمال ہوا ہے ۔ {’’ مِنْ اَزْوَاجِكُمْ ‘‘} میں {’’ مِنْ ‘‘} تبعیض کے لیے ہے، یعنی بعض بیویاں اور اولادیں دشمن ہوتی ہیں سب نہہیں، بلکہ بعض دین میں مددگار اور آنکھوں کی ٹھنڈک بھی ہوتی ہیں۔اس سے پہلی آیات میں اللہ کی اطاعت اور اس کے رسول کی اطاعت کا حکم دیا ہے، اب ایک ایسی چیز سے ہوشیار رہنے کاحکم دیاجو عموماً اللہ اور اس کے رسول کی اطاعت کی راہ میں رکاوٹ بن جاتی ہے اور وہ آدمی کی بیوی اور اس کی اولاد ہے۔ اللہ تعالیٰ کو کسی صورت گوارا نہیں کہ اس کا مومن بندہ اس سے بڑھ کر اور اس کے رسول سے بڑھ کر کسی سے محبت کرے، یا کسی عزیز سے عزیز شخص کے تقاضے کو اللہ اور اس کے رسول کے تقاضے پر ترجیح دے۔ (دیکھیے توبہ : ۲۴) یہاں خاص طور پر بعض بیویوں اور بعض اولاد کا ذکر فرمایا، کیونکہ آدمی ہر وقت ان کے ساتھ رہتا ہے اور طبعی طور پر ان سے محبت ہوتی ہے، اس لیے بعض اوقات وہ ان کی محبت میں آکر اللہ اور اس کے رسول کے احکام کو پس پشت پھینک دیتا ہے اور ان کے آرام و آسائش کی خاطر حلال و حرام میں تمیز نہیں کرتا۔ان کے اصرار پر کئی فرائض ترک کر دیتا ہے، کئی ناجائز کاموں کا ارتکاب کرلیتا ہے اور اس طرح اپنی آخرت تباہ کرلیتا ہے، ظاہر ہے جو اہل وعیال آخرت کی بربادی کا باعث بنیں ان سے بڑھ کر آدمی کا کوئی دشمن نہیں ہوسکتا۔ بعض بیویاں اور اولاد ناموافقت یا سرکشی کی وجہ سے فی الواقع بھی اپنے خاوند یا باپ کے ساتھ دشمنی رکھتے ہیں، مگر یہ ایسے دشمن ہیں کہ آدمی ان سے مسلسل دشمنی نہیں رکھ سکتا اور نہ ہی ان سے علیحدگی اختیار کرسکتا ہے، بلکہ ان کے ساتھ گزارا ہی کرنا پڑتا ہے۔ اس لیے فرمایا کہ ان کی دشمنی کا یہ علاج نہیں کہ انھیں مارو پیٹو، خرچہ بند کردو یا ان سے علیحدگی اختیار کر لو، بلکہ مارنے پیٹنے اور سختی کرنے کے بجائے اگر انھیں معاف کردو، ان سے در گزر کرو اور ان کی غلطیوں پر پردہ ڈال دو تو تمھارے لیے بہتر اور اللہ کو پسند ہے، کیونکہ اللہ تعالیٰ بے حد پردہ ڈالنے والا اور نہایت رحم والا ہے۔ البتہ اس عفو و درگزر کے باوجود جتنی طاقت ہے اللہ کے تقویٰ پر قائم رہو اور انھیں اس کی تلقین کرتے رہو۔ اللہ تعالیٰ کے اس حکم میں یقینا بہت سی حکمتیں ہیں، کیونکہ بعض اوقات آدمی کی سختی کی وجہ سے اولاد بغاوت پر اتر آتی ہے، جب کہ عفوو درگزر، مسلسل نصیحت اور خود تقویٰ پر قائم رہنے سے ان کی اصلاح کی توقع زیادہ ہوتی ہے۔ ¤ عکرمہ فرماتے ہیں کہ ایک آدمی نے ابن عباس رضی اللہ عنھما سے اس آیت {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنَّ مِنْ اَزْوَاجِكُمْ وَ  اَوْلَادِكُمْ عَدُوًّا لَّكُمْ فَاحْذَرُوْهُمْ ‘‘} کے  متعلق سوال کیا تو انھوں نے فرمایا : ’’ یہ اہلِ مکہ میں سے کچھ لوگ تھے جو مسلمان ہوگئے اور انھوں نے نبی صلی اللہ علیہ وسلم کے پاس آنے کا ارادہ کر لیا (یاد رہے کہ ان دنوں ہر مسلمان ہونے والے کے لیے مدینہ کی طرف ہجرت کرنا فرض تھا) مگر انھیں ان کی بیویوں اور بچوں نے نہیں چھوڑا کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آتے۔ پھر جب وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو انھوں نے دوسرے لوگوں کو دیکھا کہ وہ دین کی سمجھ حاصل کر چکے تھے تو انھوں نے ارادہ کیا کہ اپنے بیوی بچوں کو سزا دیں تو اللہ تعالیٰ نے یہ آیت نازل فرمائی۔‘‘ [ ترمذي، التفسیر، سورۃ التغابن : ۳۳۱۷ وقال الألباني حسن ]"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) { اَنَّمَا اَمْوَالُكُمْ وَ اَوْلَادُكُمْ فِتْنَةٌ … :} اس کی تفسیر کے لیے دیکھیے سورۂ آل عمران (۱۴)، انفال (۲۸)، کہف (۴۶) اور سورۂ منافقون (۹)۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { فَاتَّقُوا اللّٰهَ مَا اسْتَطَعْتُمْ …:} ما ل و اولاد کے فتنے سے بچنے کے لیے چند چیزوں کی تاکید فرمائی، جن میں سب سے پہلے اللہ تعالیٰ کا حسب استطاعت تقویٰ ہے، پھر سمع و طاعت اور آخر میں فتنہ بننے والے اس مال کو خرچ کرنا ہے اور اس میں بخل سے گریز کرناہے۔ ¤ ➋ { مَا اسْتَطَعْتُمْ:} اس سے معلوم ہوا کہ آدمی کے لیے اللہ کے احکام پر اتنا عمل ہی فرض ہے جتنی اس میں طاقت ہے، اللہ تعالیٰ نے فرمایا : « لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا وُسْعَهَا » [ البقرۃ : ۲۸۶ ]’’اللہ کسی جان کو تکلیف نہیں دیتا مگر اس کی گنجائش کے مطابق۔‘‘ جہاں آدمی بے بس ہو جائے وہاں مؤاخذہ نہیں۔ (دیکھیے بقرہ : ۱۷۳۔ انعام : ۱۱۹۔ نحل : ۱۰۶) مؤاخذہ اسی صورت میں ہے جب آدمی استطاعت کے باوجود اللہ کی اطاعت نہ کرے۔رہی یہ بات کہ آدمی بہانہ بنا لے اور فرض کر لے کہ فلاں کام میری استطاعت سے باہر ہے، حالانکہ وہ اس کی استطاعت میں ہو تو اس پر اس کا ضرور مؤاخذہ ہوگا، کیونکہ اللہ تعالیٰ کو ہر بات کا علم ہے۔ ¤ ➌ { وَ اسْمَعُوْا وَ اَطِيْعُوْا:} یعنی اللہ اور اس کے رسول کے احکام سنو اور ان کی اطاعت کرو۔ رسول اللہ صلی اللہ علیہ وسلم صحابہ کرام رضی اللہ عنھم سے سمع و طاعت کی بیعت لیا کرتے تھے، عبادہ بن صامت رضی اللہ عنہ کی بیعت والی حدیث کے الفاظ ہیں : [ بَايَعْنَا رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ عَلی السَّمْعِ وَالطَّاعَةِ فِي الْمَنْشَطِ وَالْمَكْرَهِ ] [ بخاري، الأحکام، باب کیف یبایع الإمام الناس ؟ : ۷۱۹۹ ] ’’ہم نے رسول اللہ صلی اللہ علیہ وسلم سے خوش دلی اور ناگواری (ہر حال) میں سننے اور فرماں برداری کرنے پر بیعت کی۔‘‘ ¤ ➍ {وَ اَنْفِقُوْا خَيْرًا لِّاَنْفُسِكُمْ: ’’ خَيْرًا ‘‘ ’’يَكُنْ‘‘} کی خبر ہونے کی وجہ سے منصوب ہے جو یہاں {’’ اَنْفِقُوْا ‘‘} کے جواب میں مقدر ہے۔ یعنی خرچ کرو یہ تمھارے لیے بہتر ہوگا۔ یہ مال کے فتنے کا تریاق ہے کہ اسے زیادہ سے زیادہ خرچ کیا جائے، جمع کر کے نہ رکھا جائے۔ ابو ذر رضی اللہ عنہ فرماتے ہیں، میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، آپ اس وقت کعبہ کے سائے میں تھے اور فرما رہے تھے : [ هُمُ الْأَخْسَرُوْنَ وَ رَبِّ الْكَعْبَةِ، هُمُ الْأَخْسَرُوْنَ وَ رَبِّ الْكَعْبَةِ ] ’’وہی سب سے زیادہ خسارے والے ہیں رب کعبہ کی قسم! وہی سب سے زیادہ خسارے والے ہیں رب کعبہ کی قسم!‘‘ میں نے کہا : ’’میرا کیا معاملہ ہے، کیا مجھ میں کوئی (خسارے والی) چیز دکھائی دے رہی ہے ، میرا معاملہ کیا ہے؟‘‘ خیر میں آپ کے پاس بیٹھ گیا اور آپ یہی فرماتے رہے۔ مجھ میں خاموش رہنے کی سکت نہ رہی، اللہ کو جو منظور تھا (یعنی بے قراری اور اضطراب) وہ مجھ پر طاری ہوگیا، تو میں نے پوچھا : ’’وہ کون ہیں یا رسول اللہ! میرے ماں باپ آپ پر قربان؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [هُمُ الْأَكْثَرُوْنَ أَمْوَالًا إِلَّا مَنْ قَالَ هٰكَذَا وَهٰكَذَا وَهٰكَذَا ] [ بخاري، الأیمان والنذور، باب کیف کانت یمین النبي صلی اللہ علیہ وسلم ؟ : ۶۶۳۸۔ مسلم : ۹۹۰ ] ’’وہ لوگ جو بہت زیادہ اموال والے ہیں، سوائے اس کے جو اس طرح اور اس طرح اور اس طرح (بے دریغ ) خرچ کرے۔‘‘ ¤ ➎ { ’’ اَنْفِقُوْا ‘‘} (خرچ کرو)کا مصرف ذکر نہیں فرمایا، تاکہ عام رہے اور فرض و نفل ہر قسم کا خرچ کرتے رہنے کی تاکید ہو جائے۔ اس میں اپنی ذات پر، اہل و عیال پر اور ان لوگوں پر خرچ کرنا بھی شامل ہے جن کی پرورش اس کے ذمے ہے۔ ضرورت کی دوسری جگہوں پر بھی، صدقات کے ان آٹھ مصارف میں بھی جن کا سورۂ توبہ کی آیت (۶۰) {’’ اِنَّمَا الصَّدَقٰتُ لِلْفُقَرَآءِ …‘‘} میں ذکر ہے اور ان میں سے بھی خاص طور پر ان لوگوں پر جو جہاد فی سبیل اللہ کے لیے وقف ہیں۔ دیکھیے سورۂ بقرہ(۲۷۳) کی تفسیر۔ ¤ ➏ {وَ مَنْ يُّوْقَ شُحَّ نَفْسِهٖ … :} اس کی تفصیل کے لیے دیکھیے سورۂ حشر کی آیت ( ۹) کی تفسیر۔ ’’شح‘‘سے بچنے کی تاکید سے ظاہر ہے کہ اہل و عیال پر خرچ بھی اللہ کے ساتھ قرض حسن کے معاملے میں شامل ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { اِنْ تُقْرِضُوا اللّٰهَ قَرْضًا حَسَنًا يُّضٰعِفْهُ لَكُمْ وَ يَغْفِرْ لَكُمْ:} اس کی وضاحت کے لیے دیکھیے سورۂ بقرہ (۲۴۵) کی تفسیر۔ ¤ ➋ { وَ اللّٰهُ شَكُوْرٌ حَلِيْمٌ:} الله {’’ شَكُوْرٌ ‘‘} (بڑا قدر دان) ہے کہ تھوڑا سا خرچ کرنے پر اسے بے حساب بڑ ھاتا ہے اور گناہ بھی بخشتا ہے اور {’’ حَلِيْمٌ ‘‘} (بے حد بردباد) ہے کہ بڑی بڑی غلطیوں پر بھی فوراً نہیں پکڑتا، بلکہ مہلت پر مہلت دیتا چلا جاتا ہے۔ اس میں ازواج و اولاد کے ساتھ معاملے میں ’’شکر و حلم‘‘ اختیار کرنے کی طرف بھی اشارہ ہے کہ میاں بیوی اور والد و اولاد دونوں ایک دوسرے کے معمولی حسن سلوک کی بھی قدر کریں اور ایک دوسرے کی کو تاہیوں پر برد باری سے کام لیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) { عٰلِمُ الْغَيْبِ وَ الشَّهَادَةِ الْعَزِيْزُ الْحَكِيْمُ:} یہ صفات یہاں ذکر کرنے سے یہ احساس دلانا مقصود ہے کہ میاں بیوی اور والد و اولاد کے باہمی معاملات سے پوری طرح واقف اللہ تعالیٰ ہی ہے، لوگوں کو اس کی خبر نہیں ہوسکتی، کیونکہ وہ ان سے الگ رہتے ہیں۔ اس لیے ان میں سے ہر ایک کو ہر وقت اس عالم الغیب والشہادہ کو اپنے سامنے رکھنا چاہیے اور اس کی گرفت سے ڈرتے رہنا چاہیے، کیونکہ وہ عزیز بھی ہے اور حکیم بھی۔"
    }
  ]
}