{
  "surah": "Al-Mulk",
  "surah_number": 67,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { تَبٰرَكَ الَّذِيْ بِيَدِهِ الْمُلْكُ : ’’ تَبٰرَكَ ‘‘ ’’بَرَكَةٌ ‘‘} سے باب تفاعل ہے۔ اس میں مبالغہ پایا جاتا ہے، اسی مناسبت سے ترجمہ ’’بہت برکت والا‘‘ کیا گیا ہے۔ {’’بَرَكَةٌ‘‘} کے معنی ہیں زیادہ ہونا، بڑھا ہونا۔ {’’ تَبٰرَكَ ‘‘} یعنی وہ خیر اور بھلائی میں ساری کائنات سے بے انتہا بڑھا ہوا ہے اور بلندی، بڑائی اور احسان، غرض ہر لحاظ سے اس کی ذات بے حدوحساب خوبیوں اور بھلائیوں کی جامع ہے ۔ مزید دیکھیے سورۂ فرقان کی پہلی آیت کی تفسیر۔ ¤ ➋ { ’’ بِيَدِهِ ‘‘} پہلے لانے سے کلام میں حصر پیدا ہو گیا، اس لیے ترجمہ’’صرف اس کے ہاتھ میں ہے‘‘ کیا گیا ہے۔ ¤ ➌ یہاں ایک سوال پیدا ہوتا ہے کہ دنیا میں بادشاہ تو بہت ہیں، پھر اللہ تعالیٰ نے یہ کیسے فرما دیا کہ تمام بادشاہی صرف اس کے ہاتھ میں ہے؟ جواب یہ ہے کہ دنیا کا سارا نظام ایک دوسرے کی محتاجی پر چل رہا ہے، رعایا اپنی ضروریات مثلاً جان و مال، عزت و آبرو اور دین و ایمان کی حفاظت کے لیے بادشاہ کی محتاج ہے اور بادشاہ اپنے کام چلانے کے لیے رعایا کا محتاج ہے، اگر وہ اس کا ساتھ نہ دیں اور اسے ٹیکس نہ دیں تو وہ ایک لمحہ کے لیے بادشاہ نہیں رہ سکتا۔ سورۂ زخرف میں یہی نکتہ بیان کیا گیا ہے، فرمایا : « لِيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا » [ الزخرف : ۳۲ ] ’’تاکہ ان کا بعض بعض کو تابع بنالے۔‘‘ ایک شاعر نے دنیوی بادشاہوں کی محتاجی کا کیا خوب نقشہ کھینچا ہے: ¤ مانگنے والا گدا ہے، صدقہ مانگے یا خراج ¤ کوئی مانے یا نہ مانے میر و سلطان سب گدا ¤ اس کے علاوہ دنیا میں کوئی بادشاہ ہے یا محکوم، ایک دوسرے کے محتاج ہونے کے باوجود دونوں میں سے کسی کے بھی ہاتھ میں فی الحقیقت کچھ بھی نہیں۔ ان کی اپنی دولت و فقر، صحت و بیماری، عزت و ذلت، فتح و شکست، جوانی و بڑھاپا، نفع و نقصان اور موت و حیات، غرض سب کچھ اللہ مالک الملک کے ہاتھ میں ہے، تو پھر یہ کہنے میں کیا مبالغہ ہے کہ تمام بادشاہی صرف اللہ کے ہاتھ میں ہے؟ دوسرا کوئی بادشاہ ہے بھی تو نام کا ہے۔ حقیقت میں بادشاہ ایک ہی ہے، باقی سب گدا ہیں، جیسا کہ فرمایا : « يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ» [فاطر : ۱۵ ] ’’اے لوگو! تم ہی اللہ کی طرف محتاج ہو۔‘‘ ¤ ➍ { وَ هُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ: ’’ شَيْءٍ ‘‘ ’’شَاءَ يَشَاءُ‘‘} کا مصدر بمعنی اسم مفعول ہے، چاہت۔ یعنی وہ اپنی ہر چاہت اور ہر چیز پر قادر ہے، جو چاہے کر سکتا ہے۔ دنیا کے بادشاہوں کی طرح نہیں کہ جن کی بے شمار چاہتیں پوری ہونے کے بجائے حسرتیں بن کر ان کے ساتھ ہی قبر میں دفن ہو جاتی ہیں۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { الَّذِيْ خَلَقَ الْمَوْتَ وَ الْحَيٰوةَ لِيَبْلُوَكُمْ … :} یہاں سے اللہ تعالیٰ نے اپنی پیدا کی ہوئی چند چیزوں کا ذکر فرمایا جو مخلوق کی قدرت سے باہر ہیں، تاکہ انسان کے دل میں اللہ کی قدرت کا پورا یقین جم جائے ۔ اس مقام پر اپنی قدرتوں میں سے پہلی چیز موت و حیات ذکر فرمائی، کیونکہ موت اور زندگی میں انسان کے تمام احوال پورے پورے آجاتے ہیں۔ ¤ ➋ اللہ تعالیٰ نے انسان کی دنیا میں آنے سے پہلے کی حالت کو موت قرار دیا اور دنیا میں آنے کے بعد یہاں سے جانے کو بھی موت قرار دیا۔ اسی طرح دنیا میں آنے کو زندگی قرار دیا، پھر موت کے بعد اٹھنے کو زندگی قرار دیا، جیسا کہ فرمایا : «كَيْفَ تَكْفُرُوْنَ بِاللّٰهِ وَ كُنْتُمْ اَمْوَاتًا فَاَحْيَاكُمْ ثُمَّ يُمِيْتُكُمْ ثُمَّ يُحْيِيْكُمْ ثُمَّ اِلَيْهِ تُرْجَعُوْنَ » [ البقرۃ : ۲۸ ] ’’تم کیسے اللہ کا انکار کرتے ہو، حالانکہ تم بے جان تھے تو اس نے تمھیں زندگی بخشی، پھر تمھیں موت دے گا، پھر تمھیں زندہ کرے گا، پھر تم اسی کی طرف لوٹائے جاؤ گے۔‘‘ یہاں فرمایا کہ اللہ نے موت و حیات کو پیدا فرمایا۔ معلوم ہوا کہ موت بھی ایک مخلوق ہے، یہ عدم محض(بالکل نہ ہونے) کا نام نہیں، کیونکہ دنیا میں آنے سے پہلے بھی انسان اللہ کے علم اور اس کی تقدیر میں موجود تھا اور اس کے دنیا میں آنے کا وقت مقرر تھا مگر روح و جسم کا اتصال نہیں تھا، اسے موت قرار دیا، پھر دنیا میں آنے کے بعد روح جسم سے جدا ہوئی تو اسے بھی موت قرار دیا ۔ قیامت کے دن موت ایک مینڈھے کی شکل میں لائی جائے گی۔ ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُؤْتٰی بِالْمَوْتِ كَهَيْئَةِ كَبْشٍ أَمْلَحَ فَيُنَادِيْ مُنَادٍ يَا أَهْلَ الْجَنَّةِ! فَيَشْرَئِبُّوْنَ وَ يَنْظُرُوْنَ فَيَقُوْلُ هَلْ تَعْرِفُوْنَ هٰذَا ؟ فَيَقُوْلُوْننَ نَعَمْ، هٰذَا الْمَوْتُ، وَكُلُّهُمْ قَدْ رَآهُ، ثُمَّ يُنَادِيْ يَا أَهْلَ النَّارِ! فَيَشْرَئِبُّوْنَ وَ يَنْظُرُوْنَ، فَيَقُوْلُ هَلْ تَعْرِفُوْنَ هٰذَا؟ فَيَقُوْلُوْنَ نَعَمْ هٰذَا الْممَوْتُ، وَكُلُّهُمْ قَدْ رَآهُ، فَيُذْبَحُ ثُمَّ يَقُوْلُ يَا أَهْلَ الْجَنَّةِ ! خُلُوْدٌ فَلاَ مَوْتَ، وَ يَا أَهْلَ النَّارِ! خُلُوْدٌ فَلاَ مَوْتَ، ثُمَّ قَرَأَ : « وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ» وَهٰؤُلاَءِ فِيْ غَفْلَةٍ أَهْلُ الدُّنْيَا «وَ هُمْ لَا يُؤْمِنُوْنَ » ] [ بخاري، التفسیر، باب قولہ عزوجل : «وأنذرھم یوم الحسرۃ» : ۴۷۳۰ ] ’’موت کو ایک چتکبرے مینڈھے کی شکل میں لایا جائے گا، پھر ایک اعلان کرنے والا اعلان کرے گا : ’’اے اہلِ جنت!‘‘ وہ گردن اٹھا کر دیکھیں گے تو وہ کہے گا : ’’اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں! یہ موت ہے۔‘‘ وہ سب اسے دیکھ چکے ہوں گے، پھر وہ اعلان کرے گا : ’’اے اہل نار !‘‘ وہ گردن اٹھا کر دیکھیں گے تو وہ کہے گا : ’’اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں! یہ موت ہے۔‘‘ وہ سب اسے دیکھ چکے ہوں گے۔ تو اسے ذبح کر دیا جائے گا، پھر کہے گا : ’’اے اہلِ جنت! (اب تمھارے لیے) ہمیشہ زندہ رہنا ہے، موت نہیں اور اے اہلِ نار! (تمھارے لیے بھی) ہمیشہ زندہ رہنا ہے، موت نہیں۔‘‘ پھر یہ آیت پڑھی : « وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ » (اور انھیں پچھتاوے کے دن سے ڈرا جب ہر کام کا فیصلہ کر دیا جائے گا اور وہ سرا سر غفلت میں ہیں) یعنی یہ دنیا والے سراسر غفلت میں ہیں ’’اور وہ ایمان نہیں لا رہے۔‘‘ ¤ ➌ زندگی اور موت دونوں اس امتحان کے لیے پیدا کی گئی ہیں کہ انسانوں میں سے اچھے عمل کون کرتا ہے؟ اگر موت اور موت کے بعد والی زندگی نہ ہوتی تو آدمی اچھے اعمال کے لیے جدو جہد اور برے اعمال سے پرہیز کیوں کرتا؟ اور موت اور حیات بعد الموت نہ ہوتی تو اچھے اور برے اعمال کا بدلا کہاں ملتا اور اگر دنیا میں انسان کو زندگی نہ ملتی اور نہ عمل کا موقع ملتا تو جزا و سزا کس چیز پر ہوتی؟ ¤ ➍ {وَ هُوَ الْعَزِيْزُ الْغَفُوْرُ :} وہ عزیز ہے، ایسا زبردست ہے کہ اعمال کی جزا و سزا پر پورا اختیار رکھتا ہے اور ایسا غالب کہ کوئی اس پر غالب نہیں، مگر اتنی قوت و عزت کے باوجود ظالم یا سخت گیر نہیں بلکہ غفور ہے اور ایسا غفور کہ کوئی توبہ کرے تو جتنے بھی گناہ کیے ہوں بخش دیتا ہے۔ توبہ کے بغیر بھی اگر اس کے ساتھ شرک نہ کیا ہو تو جسے چاہے گا بخش دے گا، فرمایا : « اِنَّ اللّٰهَ لَا يَغْفِرُ اَنْ يُّشْرَكَ بِهٖ وَ يَغْفِرُ مَا دُوْنَ ذٰلِكَ لِمَنْ يَّشَآءُ » [ النساء : ۱۱۶ ] ’’بے شک اللہ اس بات کو نہیں بخشے گا کہ اس کا شریک بنایا جائے اور اس کے علاوہ جو کچھ ہے جسے چاہے گا بخش دے گا۔‘‘ اور شرک اس لیے معاف نہیں کرے گا کہ یہ اس کے عزیز ہونے کے خلاف ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { الَّذِيْ خَلَقَ سَبْعَ سَمٰوٰتٍ طِبَاقًا:’’ طِبَاقًا ‘‘} یعنی تہ بہ تہ اوپر نیچے بنایا، یہ باب مفاعلہ کا مصدر ہے۔ حدیث معراج سے معلوم ہوتا ہے کہ ہر آسمان ایک دوسرے سے جدا ہے، چنانچہ ہر آسمان میں رسول اللہ صلی اللہ علیہ وسلم کی ملاقات کسی نہ کسی رسول سے ہوئی۔ [ دیکھیے بخاري، الصلاۃ، باب کیف فرضت الصلاۃ في الإسراء : ۳۴۹ ] ¤ ➋ { مَا تَرٰى فِيْ خَلْقِ الرَّحْمٰنِ مِنْ تَفٰوُتٍ:} رحمان کے ( آسمانوں کو) پیدا کرنے میں تم کوئی تفاوت نہیں دیکھو گے۔ جب تم آسمانوں جیسی عظیم الشان مخلوق میں کوئی تفاوت نہیں نکال سکتے تو دوسری مخلوق جو اس سے کہیں چھوٹی ہے، اس میں تم کس طرح تفاوت نکال سکو گے؟ {’’ تَفٰوُتٍ ‘‘} کا معنی ہے کہ تم اتنے بڑے آسمان یا کسی بھی مخلوق کی کوئی چیز دوسری چیز سے بے جوڑ یا بے ترتیب نہیں پاؤ گے، بلکہ سب میں ایک توازن و ترتیب اور یکسانی پاؤ گے، جس سے معلوم ہو گا کہ یہ ایک ہی خالق کی پیدا کی ہوئی ہیں۔ {’’ مِنْ تَفٰوُتٍ ‘‘} کا ایک مطلب یہ ہے کہ تم کسی چیز میں کوئی عیب یا کمی نہیں پاؤ گے کہ کہہ سکو کہ اگر اس طرح ہوتا تو بہتر تھا۔ (قاموس) {’’ خَلْقِ الرَّحْمٰنِ ‘‘} کے لفظ سے توجہ دلائی کہ اتنے عظیم الشان آسمان اور دوسری ساری مخلوق اللہ تعالیٰ کی صفت رحمان کا نتیجہ ہے ۔ ¤ ➌ {فَارْجِعِ الْبَصَرَ هَلْ تَرٰى مِنْ فُطُوْرٍ : ’’ فُطُوْرٍ ‘‘ ’’فَطْرٌ‘‘} کی جمع ہے، جیسے {’’فَلْسٌ‘‘} کی جمع {’’ فُلُوْسٌ‘‘} ہے، پھٹی ہوئی جگہ، دراڑ، شگاف۔ یعنی پہلی دفعہ اگر تمھیں رحمان کے پیدا کیے ہوئے آسمان میں کوئی عیب یا کمی بیشی نظر نہیں آئی تو دوبارہ نظر دوڑا کر دیکھ لو، کیا کوئی دراڑیں یا کٹی پھٹی ہوئی جگہیں نظر آتی ہیں؟ مطلب یہ کہ پوری کائنات میں ذرّوں سے لے کر آسمانوں تک اور ستاروں سے لے کر بڑی بڑی کہکشاؤں تک ہر چیز مستحکم اور مربوط ہے، جتنا چاہو تلاش کر لو تمھیں ایک رخنہ بھی نہیں ملے گا۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) { ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ … : ’’ كَرَّتَيْنِ ‘‘} کا لفظی معنی دوو مرتبہ ہے، مگر یہاں مراد صرف دو مرتبہ نہیں بلکہ یہ ہے کہ(دوبارہ غور کرنے سے بھی کوئی خلل نہ ملے تو) بار بار دیکھ! جیسا کہ {’’لَبَّيْكَ‘‘} کا لفظ تثنیہ ہے مگر اس کا معنی یہ نہیں کہ ’’ میں دو دفعہ حاضر ہوں‘‘ بلکہ یہ ہے کہ ’’میں بار بار حاضر ہوں۔‘‘ {’’ خَاسِئًا ‘‘} کسی چیز کو طلب کرنے والا جو اس سے دور ہٹا دیا جائے۔ {’’ حَسِيْرٌ ‘‘} جو تھک کر عاجز رہ جائے۔ بار بار دیکھنے کا حکم ان کی بے بسی واضح کرنے کے لیے ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {وَ لَقَدْ زَيَّنَّا السَّمَآءَ الدُّنْيَا بِمَصَابِيْحَ … : ’’ الدُّنْيَا ‘‘ ’’دَنَاا يَدْنُوْ‘‘} میں سے {’’أَدْنٰي‘‘} کی مؤنث ہے، سب سے قریب۔ اگرچہ سات آسمانوں میں سے ہر آسمان خالق کی کاریگری کا عظیم الشان نمونہ ہے، مگر زمین کے سب سے قریب آسمان کی زینت و حفاظت کا جو اہتمام ہم نے کیا ہے وہ توکچھ کچھ تمھیں بھی نظر آرہا ہے، اس کے لیے تو کسی خاص آلے کی بھی ضرورت نہیں ہے۔ یہاں ستاروں کے تین فائدے بیان فرمائے ہیں، پہلا فائدہ زینت ہے، رات کو چھوٹے بڑے لاتعداد ستاروں کے ساتھ آسمان جس قدر مزین ہوتا ہے اور حسین و جمیل نظر آتا ہے اگر ستارے نہ ہوتے تو اتنا ہی بدصورت دکھائی دیتا اور بے زیب ہوتا۔ دوسرا فائدہ روشنی ہے جو {’’مَصَابِيْحُ‘‘} (چراغوں) کے لفظ سے معلوم ہو رہا ہے۔ اگر یہ چراغ نہ ہوتے تو ہر رات انتہائی تاریک ہوتی۔ تیسرا فائدہ یہ ہے کہ ان ستاروں کے ذریعے سے ان شیطانوں کو مار بھگایا جاتاہے جو فرشتوں کی باتیں سن کر کاہنوں تک پہنچانے کی کوشش کرتے ہیں، تاکہ وہ لوگوں کو غیب دانی کے دعویٰ سے گمراہ کر سکیں۔ تفصیل کے لیے دیکھیے سورۂ صافات (۶ تا ۱۰) کی تفسیر۔ چو تھا فائدہ دوسری جگہ بیان فرمایا : « وَ بِالنَّجْمِ هُمْ يَهْتَدُوْنَ » [ النحل : ۱۶ ] ’’اور ستاروں کے ساتھ وہ راستہ معلوم کرتے ہیں۔‘‘ یعنی ستارے بحر و بر میں راستہ اور سمت معلوم کرنے کے کام آتے ہیں۔ ان کے علاوہ ستاروں میں سعادت یا نحوست سمجھنا یا انھیں کسی اختیار کا مالک سمجھنا شرک ہے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) { وَ لِلَّذِيْنَ كَفَرُوْا بِرَبِّهِمْ عَذَابُ جَهَنَّمَ … :} پہلی پانچ آیات میں اللہ تعالیٰ نے توحید اور قیامت کے دلائل بیان فرمائے ہیں، اب ان لوگوں کا انجام ذکر ہو رہا ہے جنھوں نے اکیلے اللہ کو اپنا رب نہیں مانا کہ ان کے لیے جہنم کا عذاب ہے۔ {’’ لِلَّذِيْنَ كَفَرُوْا ‘‘} خبر پہلے آنے کی وجہ سے ترجمہ ’’خاص ان لوگوں کے لیے‘‘ کیا گیا ہے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) { اِذَاۤ اُلْقُوْا فِيْهَا سَمِعُوْا لَهَا شَهِيْقًا وَّ هِيَ تَفُوْرُ:’’شَهِيْقٌ‘‘} گدھے کے ہینگنے کے آخر کی آواز اور {’’ زَفِيْرٌ ‘‘} شروع کی آواز۔ (قاموس) سورۂ فرقان (۱۲) میں فرمایا کہ جہنم جب انھیں دور سے دیکھے گی تو وہ جہنم کے سخت غصے کی اور گدھے کی طرح چلانے کی آواز سنیں گے۔ ساتھ ہی جہنمیوں کے چیخنے چلانے کی جو آوازیں آرہی ہوں گی وہ بھی گدھے کی آوازوں جیسی ہوں گی، اللہ تعالیٰ نے فرمایا : « فَاَمَّا الَّذِيْنَ شَقُوْا فَفِي النَّارِ لَهُمْ فِيْهَا زَفِيْرٌ وَّ شَهِيْقٌ » [ ھود : ۱۰۶ ] ’’تو وہ لوگ جو بد بخت ہوئے سو وہ آگ میں ہوں گے، ان کے لیے گدھے کی طرح آواز کھینچنا اور نکالنا ہے۔‘‘"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 9،8) { تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ … : ’’ تَمَيَّزُ ‘‘} اصل میں {’’تَتَمَيَّزُ‘‘} (تفعّل) ہے، ایک تاء تخفیف کے لیے حذف کر دی گئی۔ ’’قریب ہے کہ غصے سے پھٹ جائے‘‘ اس سے آگ کا صاحب شعور ہونا اور کفار پر سخت غصے ہونا ظاہر ہو رہا ہے۔ جہنم کے اس وقت کے سخت غصے اور جوش و خروش کا نقشہ اس سے بہتر الفاظ میں نہیں کھینچا جا سکتا۔ جہنم میں جب بھی کسی نئے گروہ کے لوگ پھینکے جائیں گے تو جہنم کے نگران فرشتے ان سے پوچھیں گے، کیا تمھارے پاس کوئی ڈرانے والا نہیں آیا تھا؟ یہ سوال ہر گروہ سے ہوگا اور اس لیے نہیں ہوگا کہ فرشتوں کو معلوم نہیں کہ ان کے پاس ڈرانے والے آئے تھے یا نہیں، بلکہ ایک تو تعجب کے اظہار کے لیے ہو گا کہ اللہ کی طرف سے پیغمبروں اور دین کی دعوت دینے والوں کے ڈرانے کے باوجود تم ایمان نہ لائے اور جان بوجھ کر جہنم کا ایندھن بنے، دوسرا ان پر حجت تمام کرنے کے لیے اور خود ان کے منہ سے نکلوانے کے لیے کہ انھیں نہ تو بے خبری میں جہنم میں پھینکا جا رہا ہے اور نہ بلاجرم، بلکہ وہ فی الواقع اس کے حق دار ہیں۔ چنانچہ وہ خود کہیں گے، کیوں نہیں، ہمارے پاس ڈرانے والے آئے اور انھوں نے اللہ کی اتاری ہوئی پوری تعلیم بھی ہم تک پہنچائی، مگر ہم نے انھیں جھٹلا دیا اور اس بات سے سرے سے انکار کر دیا کہ اللہ تعالیٰ نے کوئی چیز نازل کی ہے، بلکہ الٹا انھی کو بڑی گمراہی میں مبتلا قرار دیا۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9،8) { تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ … : ’’ تَمَيَّزُ ‘‘} اصل میں {’’تَتَمَيَّزُ‘‘} (تفعّل) ہے، ایک تاء تخفیف کے لیے حذف کر دی گئی۔ ’’قریب ہے کہ غصے سے پھٹ جائے‘‘ اس سے آگ کا صاحب شعور ہونا اور کفار پر سخت غصے ہونا ظاہر ہو رہا ہے۔ جہنم کے اس وقت کے سخت غصے اور جوش و خروش کا نقشہ اس سے بہتر الفاظ میں نہیں کھینچا جا سکتا۔ جہنم میں جب بھی کسی نئے گروہ کے لوگ پھینکے جائیں گے تو جہنم کے نگران فرشتے ان سے پوچھیں گے، کیا تمھارے پاس کوئی ڈرانے والا نہیں آیا تھا؟ یہ سوال ہر گروہ سے ہوگا اور اس لیے نہیں ہوگا کہ فرشتوں کو معلوم نہیں کہ ان کے پاس ڈرانے والے آئے تھے یا نہیں، بلکہ ایک تو تعجب کے اظہار کے لیے ہو گا کہ اللہ کی طرف سے پیغمبروں اور دین کی دعوت دینے والوں کے ڈرانے کے باوجود تم ایمان نہ لائے اور جان بوجھ کر جہنم کا ایندھن بنے، دوسرا ان پر حجت تمام کرنے کے لیے اور خود ان کے منہ سے نکلوانے کے لیے کہ انھیں نہ تو بے خبری میں جہنم میں پھینکا جا رہا ہے اور نہ بلاجرم، بلکہ وہ فی الواقع اس کے حق دار ہیں۔ چنانچہ وہ خود کہیں گے، کیوں نہیں، ہمارے پاس ڈرانے والے آئے اور انھوں نے اللہ کی اتاری ہوئی پوری تعلیم بھی ہم تک پہنچائی، مگر ہم نے انھیں جھٹلا دیا اور اس بات سے سرے سے انکار کر دیا کہ اللہ تعالیٰ نے کوئی چیز نازل کی ہے، بلکہ الٹا انھی کو بڑی گمراہی میں مبتلا قرار دیا۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {وَ قَالُوْا لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ … :} اب وہ حسرت و افسوس سے کہیں گے کہ ہم جس گمراہی میں مبتلا رہے، اس سے نکلنے کی دو ہی صورتیں تھیں، پہلی یہ کہ ہم رسولوں اور اہل ایمان کی باتیں سن لیا کرتے تو ایمان کی نعمت مل جاتی، دوسری یہ کہ خود کچھ عقل سے کام لیا کرتے تو توحید و رسالت اور آخرت کے عقائد تک آسانی سے پہنچ سکتے تھے۔ دو نوں صورتوں میں آج جہنمیوں میں شامل نہ ہوتے، مگر ہم اپنی مرضی اور آباو اجداد کے طریقے کے خلاف کوئی بات نہ سنا کرتے تھے اور نہ سمجھنے کی کوشش کیا کرتے تھے۔ واضح رہے کہ رسولوں کی بات دلیل سمعی ہے اور اسے سمجھنا دلیل عقلی ہے، جبکہ اپنی مرضی پر چلنا یا آباو اجدا د کی تقلید نہ دلیل سمعی ہے اور نہ دلیل عقلی، بلکہ دلیل ہے ہی نہیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {فَاعْتَرَفُوْا بِذَنْۢبِهِمْ … :} وہ اپنے گناہ کا اقرار کریں گے، یہ نہیں فرمایا کہ ووہ اپنے گناہوں کا اقرار کریں گے، کیونکہ ان کو جہنم میں لے جانے والا اصل گناہ ایک ہی تھا، یعنی رسولوں کو جان بوجھ کر جھٹلا دینا، مگر ایسے اقرار کا کوئی فائدہ نہیں ہوگا، بلکہ جانتے بوجھتے جہنمی بننے والوں کو یہی کہا جائے گاکہ جہنمی اللہ کی رحمت سے دور ہو جائیں۔ {’’سُحْقًا‘‘ ’’سَحِقَ‘‘} (س، ک) کا مصدر ہے، دور ہونا اور {’’سَحِيْقٌ‘‘} بعید۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) {اِنَّ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ … :} پچھلی آیات میں جہنمیوں کا ذکر تھا جو نہ اپنے رب سے ڈرتے تھے نہ انھیں قیامت کا یا اپنی بداعمالیوں کی سزا کا خوف تھا، کیونکہ نہ وہ اَن دیکھی چیزوں پر ایمان لانے پر تیار تھے اور نہ ان سے ڈرنے پر۔ ان کے مقابلے میں اب ان لوگوں کا ذکرہے جو عقل سلیم کے تقاضے اور اللہ تعالیٰ کے رسولوں اور بر گزیدہ بندوں کے بتانے سے دیکھے بغیر اللہ تعالیٰ پر، اس کے فرشتوں پر، اس کے رسولوں اور یوم آخرت پر ایمان لائے اور دیکھے بغیر اپنے رب سے ڈرتے رہے۔ ان سے اگر کوئی غلطی ہو بھی گئی تو ان کے بن دیکھے ڈرتے رہنے کے صلے میں اللہ تعالیٰ انھیں معاف فرما دے گا اور اسی خشیت بالغیب کی وجہ سے انھوں نے جو نیکیاں کیں ان کا انھیں بہت بڑا اجر عطا فرمائے گا۔ خشیت کا معنی شدتِ خوف ہے۔ حقیقت یہ ہے کہ ہر نیکی کی اصل ایمان بالغیب اور خشیت بالغیب ہے اور گناہ سے بچنے کا اصل باعث بھی یہی ہے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {وَ اَسِرُّوْا قَوْلَكُمْ اَوِ اجْهَرُوْا بِهٖ … :} شروع سورت سے اللہ تعالیٰ کی ان قدرتوں کا بیان ہو رہا تھا جو مخلوق کی استطاعت سے باہر ہیں، درمیان کی سات آیات میں ان سے کفر کرنے والوں اور ان پر ایمان رکھنے والوں کا انجام ذکر فرمایا، اب دوبارہ اللہ کی قدرتوں کا ذکر شروع ہوتا ہے۔ فرمایا تم اپنی بات چھپا کر کرو یا بلند آواز سے کرو اللہ تعالیٰ سب جانتا ہے، بلکہ وہ اس سے بڑھ کر دلوں کے ارادے اور نیتیں جو زبان پر آکر قول بننے کی منزل تک نہیں پہنچیں، انھیں بھی جانتا ہے۔ مخلوق بے چاری نہ چھپی بات کو جانتی ہے اور نہ ایک وقت میں بہت سے لوگوں کی اونچی آواز سے کی ہوئی باتوں کو جان سکتی ہے، دلوں کی بات جاننے کا تو سوال ہی پیدا نہیں ہوتا۔ مزید دیکھیے سورۂ اعلیٰ (۷) کی تفسیر۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) { اَلَا يَعْلَمُ مَنْ خَلَقَ … :} یہ {’’ عَلِيْمٌ‘‘} ہونے کی دلیل ہے کہ جو دل کا خالق اور دل میں چھپی ہوئی چیزوں کا خالق ہے، زبان کا اور اس سے ادا ہونے والے اقوال کا خالق ہے، کیا وہ اپنے ہی پیدا کیے ہوئے اسرار واقوال نہیں جانے گا؟ {’’ اللَّطِيْفُ ‘‘} کے مفہوم میں باریک سے باریک چیز جاننے کے ساتھ ساتھ نہایت مہربان ہونا بھی شامل ہے۔ اس میں ان لوگوں کا بھی ردّ ہے جو کہتے ہیں کہ اللہ تعالیٰ کلیات کو جانتا ہے جزئیات کو نہیں جانتا۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ {هُوَ الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ ذَلُوْلًا … : ’’ ذَلُوْلًا ‘‘} جو تمھارے تابع ہو جائے، سرکشی نہ کرے۔ یہاں زمین کو اس چوپائے کے ساتھ تشبیہ دی ہے جو پوری طرح انسان کے تابع ہوتا ہے، خواہ اس پر سواری کرے یا ہل میں جوت لے۔ یعنی تم اس پر چل پھر سکتے ہو اور اسے کام میں لا سکتے ہو۔ اللہ تعالیٰ نے زمین میں پہاڑ گاڑ کر اسے ہر وقت زلزلے کی حالت میں رہنے سے محفوظ کر دیا، تاکہ تم سکون سے رہ سکو۔ اسے لوہے کی طرح سخت نہیں بنایا، ورنہ نہ اس سے کچھ اُگتا، نہ عمارتیں بنتیں، نہ نہریں یا کنوئیں کھودے جا سکتے اور نہ انسان اور جانوروں کے رزق کا انتظام ہوتا اور اسے ضرورت سے زیادہ نرم بھی نہیں بنایا، ورنہ سب کچھ اس کے اندر دھنس جاتا۔ مشرک اقوام کی کم عقلی دیکھیے کہ اللہ تعالیٰ نے جس چیز کو انسان کے تابع کیا، انھوں نے اسے دھرتی ماتا کے نام سے اپنا معبود بنا لیا۔ {’’مَنَاكِبُ‘‘} کا لفظی معنی کندھے ہے۔ جس طرح بالکل مطیع جانور پیٹھ کے علاوہ کندھوں پر بھی سواری کرلینے دیتا ہے، زمین بھی تمھارے لیے ایسے ہی مسخر ہے، اس پر جہاں چاہو چلو پھرو۔ ¤ ➋ { وَ كُلُوْا مِنْ رِّزْقِهٖ … :} اس کے دیے ہوئے میں سے کھاؤ، مگر آزادی سے نہیں بلکہ یہ سمجھتے ہوئے کہ اس کا دیا ہوا کھا رہے ہو اور آخر کار تمھیں اپنے رب کے سامنے حاضر ہوناہے جو تم سے ایک ایک چیز کا حساب لے گا کہ اسے کن ذرائع سے حاصل کیا اور کہاں خرچ کیا؟(اشرف الحواشی)"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { ءَاَمِنْتُمْ مَّنْ فِي السَّمَآءِ اَنْ يَّخْسِفَ بِكُمُ الْاَرْضَ … : ’’ تَمُوْرُ ‘‘} حرکت کرنے لگے، یعنی زبردست زلزلے سے لرزنے لگے۔ (دیکھیے طور : ۹) پچھلی آیت میں اللہ تعالیٰ نے اپنے انعامات کا ذکر فرمایا تھا اور اس آیت میں اپنی شان قہاریت کا اظہار کیا ہے۔ مطلب یہ ہے کہ زمین اگرچہ تمھارے تابع کر دی گئی ہے کہ تم جیسے چاہو اس میں تصرف کر سکو، لیکن یاد رکھو کہ یہ اسی آسمان والے کی ملکیت ہے، وہ چاہے تو تمھیں اس کے اندر دھنسا دے (جس طرح قارون کو دھنسا دیا۔ دیکھیے قصص : ۸۱) اور چاہے تو بھونچال سے لرزنے لگے۔ لہٰذا اس پر سرکش و خود مختار ہو کر نہیں بلکہ فرماں برداروں کی طرح ڈرتے ہوئے زندگی بسر کرو۔(اشرف الحواشی) اس آیت کا اور اس کے بعد والی آیت کا مفہوم سورۂ انعام (۶۵) اور سورۂ کہف (69،68) میں بیان ہوا ہے۔ ¤ ➋ {ءَاَمِنْتُمْ مَّنْ فِي السَّمَآءِ : ’’ السَّمَآءِ ‘‘ ’’سِمْوٌ‘‘} سے مشتق ہے، جس کا معنی بلندی ہے۔ ہر وہ چیز جو اوپر ہو اسے {’’سَمَاءُ‘‘} کہہ لیتے ہیں۔ ان دونوں آیات سے صاف ظاہر ہے کہ اللہ تعالیٰ کی ذات اوپر کی طرف ہے۔ قرآن مجید نے کئی مقامات پر رحمان کا عرش پر ہونا بیان فرمایا ہے۔ معاویہ بن حکم سلمی رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اپنی لونڈی کے متعلق پوچھا کہ کیا میں اسے آزاد کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا : [ اِئْتِنِيْ بِهَا ] ’’اسے میرے پاس للاؤ۔‘‘ میں اسے آپ کے پاس لے کر آیا تو آپ نے اس سے پوچھا : [ أَيْنَ اللّٰهُ؟ ] ’’اللہ کہاں ہے؟ ‘‘ اس نے کہا : [ فِي السَّمَآءِ] ’’آسمان میں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ أَنَا؟ ] ’’میں کون ہوں؟‘‘ اس نے کہا : [ أَنْتَ رَسُوْلُ اللّٰهِ ] ] ’’آپ اللہ کے رسول ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَعْتِقْهَا فَإِنَّهَا مُؤْمِنَةٌ ] [ مسلم، المساجد، باب تحریم الکلام في الصلاۃ… : ۵۳۷ ] ’’اسے آزاد کر دو، یہ مومنہ ہے۔‘‘ تمام سلف صالحین کا یہی عقیدہ ہے، بعد کے لوگ جو یونانی فلسفے سے متاثر ہو گئے انھوں نے اللہ تعالیٰ کی صفت علو( اوپر ہونے کی صفت) کا انکار کر دیا، کسی نے کہا وہ لا مکان ہے، کسی نے کہا وہ ہر جگہ ہے اور قرآن و حدیث کی صاف نصوص کی تاویل کی۔ بعض لوگ تو یہاں تک پہنچ گئے کہ اللہ تعالیٰ کے متعلق یہ سوال ہی کفر ہے کہ اللہ تعالیٰ کہاں ہے؟ انھوں نے یہ خیال نہ کیاکہ یہ سوال تو خود رسول اللہ صلی اللہ علیہ وسلم نے کیا ہے اور اس کے جواب میں بھی اللہ تعالیٰ کے آسمانوں پر ہونے کے عقیدے کو آپ نے ایمان قرار دیا ہے، (دیکھیے مسلم : ۵۳۷) تو کیا نعوذ باللہ یہ فتویٰ رسول اللہ صلی اللہ علیہ وسلم پر بھی لگایا جائے گا؟ ¤ قرآن مجید {’’’ ءَاَمِنْتُمْ مَّنْ فِي السَّمَآءِ ‘‘} میں اللہ تعالیٰ کا آسمان پر ہونا فرما رہا ہے اور یہ بات انسان کی فطرت میں رکھ دی گئی ہے کہ وہ دعا کرتا ہے تو آسمان کی طرف نگاہ اٹھاتا ہے، مگر فلسفے کے مارے ہوئے یہ حضرات کبھی کہتے ہیں کہ اس کا مطلب تو پھر یہ ہوا کہ وہ آسمانوں پر بیٹھا ہوا ہے، کبھی کہتے ہیں کہ پھر کیا وہ آسمان میں رہتا ہے؟ اس طرح تو وہ آسمان کا محتاج ہوا جبکہ آسمان و زمین خود اس نے پیدا کیے ہیں۔ حالانکہ سلف صالحین کے عقیدہ کے مطابق وہ لفظ اللہ تعالیٰ کے متعلق استعمال کرنا جائز نہیں جو اس نے خود اپنے متعلق استعمال نہ کیا ہو۔ اب یہ کس نے کہا کہ اللہ تعالیٰ کھڑا ہے یا بیٹھا ہے؟ قرآن و حدیث سے اللہ تعالیٰ کا بلندی کی جانب ہونا اور عرش پر ہونا ثابت ہے، اس کی کیفیت کسی کو معلوم نہیں اور وہ عرش کا یا بلندی کا محتاج نہیں بلکہ اس کے عرش پر ہونے کے باوجود عرش خود اس کا محتاج ہے اور اس نے عرش اور آسمان و زمین کو تھام رکھا ہے ۔ مخلوق میں کئی چیزیں ہیں جو اوپر ہیں، مگر ان کے نیچے کی چیزیں اپنے قیام میں ان کی محتاج ہیں، اللہ تعالیٰ کی مثال تو اس سے بہت بلند ہے۔ مومن جب بھی اللہ تعالیٰ کا تصور کرتا ہے یا اس سے دعا کرتا ہے، تو اسے یقین ہوتا ہے کہ اس کا پروردگار آسمانوں کے اوپر عرش پر ہے اور اسے اپنے رب سے تعلق جوڑنے میں کوئی الجھن نہیں ہوتی۔ تاویلوں کی مصیبت میں پھنسے ہوئے لوگ یہ فیصلہ ہی نہیں کرپاتے کہ ان کا رب کہاں ہے جس کی طرف وہ توجہ کریں۔ وہ لا مکان کے چکر ہی سے نہیں نکل سکتے۔ اسلام کے فطری اور سادہ عقائد کو چھوڑ کر فلسفی بھول بھلیاں اختیار کرنے کا یہی انجام ہے۔ مزید تفصیل کے لیے دیکھیے سورۂ فجر ( ۲۲) کی تفسیر۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {اَمْ اَمِنْتُمْ مَّنْ فِي السَّمَآءِ اَنْ يُّرْسِلَ عَلَيْكُمْ حَاصِبًا :} جیسا کہ قوم لوط کے ساتھ ہوا، فرمایا : «اِنَّاۤ اَرْسَلْنَا عَلَيْهِمْ حَاصِبًا اِلَّاۤ اٰلَ لُوْطٍ نَجَّيْنٰهُمْ بِسَحَرٍ » [ القمر : ۳۴ ] ’’بے شک ہم نے ان پر پتھر برسانے والی ایک ہوا بھیجی، سوائے لوط کے گھر والوں کے، انھیں صبح سے کچھ پہلے بچا کر نکال لیا۔‘‘ ¤ ➋ {’’ نَذِيْرِ ‘‘} مصدر ہے، اصل میں {’’ نَذِيْرِيْ‘‘} تھا، میرا ڈرانا۔ یاء حذف کر دی اور راء پر کسرہ باقی رہنے دیا، ورنہ اس پر رفع ہونا تھا۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) {وَ لَقَدْ كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ … :} تاریخ سے عبرت حاصل کرنے کے لیے پہلے لوگوں کا حال دیکھ لو۔ عرب میں عاد و ثمود، فرعون و قارون اور قوم لوط و شعیب کے واقعات معروف تھے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ {اَوَ لَمْ يَرَوْا اِلَى الطَّيْرِ فَوْقَهُمْ صٰٓفّٰتٍ … :} اس آیت میں اللہ تعالیٰ نے اپنی ایک اور قدرت بیان فرمائی کہ عام مشاہدے میں مادی چیزیں جو وزن رکھتی ہیں وہ نیچے کی طرف میلان رکھتی ہیں، مگر پرندے وزن رکھنے کے باوجود فضا میں اڑتے پھرتے ہیں۔ اڑتے وقت اکثر وہ پر پھیلائے ہوئے ہوتے ہیں، کبھی سکیڑ بھی لیتے ہیں، انھیں تھامنے والا اس رحمان (بے حد مہربان) کے علاوہ کوئی نہیں۔ {’’ صٰٓفّٰتٍ ‘‘} اسم فاعل ہے جو دوام پر دلالت کرتا ہے اور {’’ يَقْبِضْنَ ‘‘} فعل مضارع ہے جو تجدد پر دلالت کرتا ہے۔ فضا کی بلندی میں اڑنے والے پرندے اکثر پر پھیلائے ہوئے اڑ رہے ہوتے ہیں، کبھی پر مار بھی لیتے ہیں۔ ¤ ➋ { اِنَّهٗ بِكُلِّ شَيْءٍ بَصِيْرٌ:} یقینا وہ ہر چیز کو خوب دیکھنے والا ہے۔ فضا میں اڑتے ہوئے پرندوں کو وہی تھامے ہوئے ہے، ہوا میں معلق زمین کو گرنے سے بچانے والا وہی ہے اور آسمانوں کو ستونوں کے بغیر ان کی جگہ قائم رکھنے والا بھی وہی ہے۔ غرض اس کائنات کی ہر چیز کی مسلسل نگرانی اور دیکھ بھال وہی کر رہا ہے اور وہی اسے تھامے ہوئے ہے، اگر وہ ایک لمحہ کے لیے توجہ ہٹا لے تو سب کچھ فنا ہو جائے، جیسا کہ فرمایا : « اِنَّ اللّٰهَ يُمْسِكُ السَّمٰوٰتِ وَ الْاَرْضَ اَنْ تَزُوْلَا وَ لَىِٕنْ زَالَتَاۤ اِنْ اَمْسَكَهُمَا مِنْ اَحَدٍ مِّنْۢ بَعْدِهٖ اِنَّهٗ كَانَ حَلِيْمًا غَفُوْرًا » [ فاطر : ۴۱ ] ’’بے شک اللہ ہی آسمانوں کو اور زمین کو تھامے رکھتا ہے، اس سے کہ وہ اپنی جگہ سے ہلیں اور اگر فی الواقع وہ ہٹ جائیں تو اس کے بعد کوئی نہیں جو انھیں تھام لے گا، بے شک وہ ہمیشہ سے نہایت بردبار، بے حد بخشنے والا ہے۔‘‘"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) { اَمَّنْ هٰذَا الَّذِيْ هُوَ جُنْدٌ لَّكُمْ …:} بھلا یہ تو بتاؤ کہ اگر اتنی قدرتوں والا رحمان تمھیں پکڑنے پر آجائے تو وہ کون ہے جو تمھارا لشکر بن کر اس کے مقابلے میں تمھاری مدد کرسکے؟ کوئی نہیں، بالکل نہیں۔ کافر لوگ جن کے دلوں میں یہ بات بیٹھی ہوئی ہے کہ فلاں ہستی اور فلاں مشکل کشا اللہ تعالیٰ کے مقابلے میں ان کی مدد کریں گے اور زبردستی سفارش کر کے چھڑا لیں گے، محض دھوکے میں پڑے ہوئے ہیں، جس میں انھیں شیطان نے مبتلا کر رکھا ہے۔ {’’ مِنْ دُوْنِ الرَّحْمٰنِ ‘‘} کا ایک معنی یہ بھی ہو سکتا ہے کہ رحمان کے علاوہ وہ کون ہے جو کسی مصیبت میں لشکر بن کر تمھاری مدد کر سکے؟"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) { اَمَّنْ هٰذَا الَّذِيْ يَرْزُقُكُمْ اِنْ اَمْسَكَ رِزْقَهٗ … :} یعنی اگر اللہ تعالیٰ بارش ہی روک لے تو وہ کون ہے جو بارش برسا دے؟ یا زمین کو پیداوار سے روک دے یا کسی بھی طریقے سے تمھاری روزی روک دے تو وہ کون ہے جو تمھیں روزی مہیا کر دے؟ صحیح بخاری میں عبد اللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ جب قریش مکہ نے ن نبی صلی اللہ علیہ وسلم کے مقابلے میں نافرمانی کی حد کر دی تو آپ صلی اللہ علیہ وسلم نے ان پر یوسف علیہ السلام جیسی قحط سالی کی بد دعا فرمائی تو ان پر ایسا قحط آیا کہ وہ ہڈیاں تک کھا گئے۔ خلاصہ یہ ہے کہ وہ قحط اس وقت دور ہوا جب رسول اللہ صلی اللہ علیہ وسلم نے ان کے لیے اللہ تعالیٰ سے دعا فرمائی۔ [ دیکھیے بخاری، التفسیر، باب : «یغشی الناس ھذا عذاب ألیم» : ۴۸۲۱ ] لات و منات کے بت بلکہ ابراہیم اور اسماعیل علیھما السلام کے جو بت انھوں نے بنائے ہوئے تھے، ان کے کسی کام نہ آسکے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) { اَفَمَنْ يَّمْشِيْ مُكِبًّا عَلٰى وَجْهِهٖۤ … : ’’ مُكِبًّا ‘‘ ’’أَكَبَّ يُكِبُّ إِكْبَابًا‘‘} (افعال) اُوندھا گرنا۔ مزیدفیہ ہونے کے باوجود یہ باب لازم ہے، اس کا مجرد {’’كَبَّ يَكُبُّ كَبًّا‘‘} (ن) متعدی ہے، جس کا معنی کسی کو اُوندھا گرانا ہے۔ {’’ اَهْدٰۤى ‘‘ ’’هَدٰي يَهْدِيْ هِدَايَةً‘‘} (ض) سے اسم تفضیل ہے جو عموماً اسم فاعل کے معنی میں آتا ہے، مگر کبھی کبھی اسم مفعول کے معنی میں بھی آجاتا ہے اور یہاں یہ اسم مفعول کے معنی میں ہے، اس لیے اس کا معنی زیادہ ہدایت دینے والا نہیں بلکہ زیادہ ہدایت یافتہ ہے۔ یہ موحد مومن اور مشرک کافر کی مثال ہے۔ کافر سیدھے راستے پر چلنے کے بجائے گمراہی کے گڑھوں میں پڑ جانے کی وجہ سے منہ کے بل گرتا پڑتا چلا جا رہا ہوتا ہے۔ ایسا شخص منزل مقصود پر کیسے پہنچ سکتا ہے؟ اس کے برعکس مومن توحید و سنت کے صراطِ مستقیم پر سیدھا ہو کر چل رہا ہوتا ہے، اسے دائیں بائیں اور سامنے ہر طرف سے اپنا راستہ اور اس کا گردو پیش نظر آرہا ہوتا ہے۔ وہ یقینا اپنی منزل مقصود تک پہنچ جائے گا جو جنت ہے، جیسا کہ اللہ تعالیٰ نے ایک جگہ کافروں کے متعلق فرمایا : «وَ نَحْشُرُهُمْ يَوْمَ الْقِيٰمَةِ عَلٰى وُجُوْهِهِمْ عُمْيًا وَّ بُكْمًا وَّ صُمًّا مَاْوٰىهُمْ جَهَنَّمُ » [ بني إسرائیل : ۹۷ ] ’’اور قیامت کے دن ہم انھیں ان کے چہروں پر اندھے اور گونگے اور بہرے اٹھائیں گے، ان کا ٹھکانا جہنم ہے۔‘‘ اور حقیقت یہ ہے کہ آخرت میں ان کے اوندھے منہ اٹھائے جانے کا سبب یہی ہے کہ دنیا میں بھی وہ الٹے ہی چلتے تھے، سیدھے ہو کر راہِ راست پر چلنا انھیں گوارا نہ تھا۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) {قُلْ هُوَ الَّذِيْۤ اَنْشَاَكُمْ … :} اللہ تعالیٰ ہی نے تمھیں پیدا فرمایا اور تمھیں کان، آنکھیں اور دل عطا فرمائے۔ اب پیدا کرنے کا شکر تو یہ تھا کہ صرف اسی کی عبادت کرتے اور کان، آنکھیں اور دل عطا فرمانے کا شکر یہ تھاکہ انھیں وہیں استعمال کرتے جہاں یہ نعمتیں دینے والے کی رضا تھی اور ان کے ذریعے سے اس کی خوشنودی کا راستہ تلاش کرتے، مگر تم نے نہ کانوں سے حق بات سنی، نہ آنکھوں سے اللہ کی قدرتیں دیکھ کر عبرت پکڑی اور نہ دل سے اس کی توحید سمجھنے کی کوشش کی۔ بے شمار نعمتوں میں سے یہ تین نعمتیں اس لیے ذکر فرمائیں کہ یہ تینوں علم کے ذرائع ہیں، انھی کے ذریعے سے آدمی حق تک پہنچ سکتا ہے۔ اس آیت میں خطاب کفار سے ہے اور {’’ قَلِيْلًا مَّا تَشْكُرُوْنَ ‘‘} (کم ہی تم شکر کرتے ہو) سے مراد یہ ہے کہ تم بالکل شکر ادا نہیں کرتے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) {قُلْ هُوَ الَّذِيْ ذَرَاَكُمْ فِي الْاَرْضِ … :} جو تمھیں روئے زمین پر پھیلا سکتا ہے وہ تمھیں دوبارہ اکٹھا بھی کر سکتا ہے اور کرے گا۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {وَ يَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ …:} ان کا یہ پوچھنا معلوم کرنے کے لیے نہیں تھا، وہ تو یہ ماننے کو تیار ہی نہ تھے کہ ایسا ہو سکتا ہے۔مسلمانوں سے ان کایہ پوچھنا صرف طنز و استہزا کے لیے تھا۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) { قُلْ اِنَّمَا الْعِلْمُ عِنْدَ اللّٰهِ … :} یعنی قیامت کا علم صرف اللہ کے پاس ہے، میں نہ قیامت لانے کا اختیار رکھتا ہوں اور نہ مجھے اس کے وقت کا علم ہے، میرا کام صرف یہ ہے کہ وقت سے پہلے تمھیں قیامت کے متعلق آگاہ کر دوں اور اس کی ہولناکیوں سے ڈرا دوں، سو یہ کام میں نے کر دیا ہے۔ قیامت کے علاوہ بھی بہت سی چیزیں ہیں جن کا آنا یقینی ہے مگر وقت معلوم نہیں۔ موت ہی کو دیکھ لو، تو کیا اس لیے قیامت یا موت کی تیاری نہ کی جائے کہ بے شک اس نے آنا ہے مگر اس کا وقت معلوم نہیں؟"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) {فَلَمَّا رَاَوْهُ زُلْفَةً سِيْٓـَٔتْ … : ’’ زُلْفَةً ‘‘ ’’زَلَفَ يَزْلُفُ‘‘} (ن) سے اسم مصدر بمعنی اسم فاعل ہے، قریب۔ {’’ تَدَّعُوْنَ ‘‘ ’’دَعَا يَدْعُوْ‘‘} کے باب افتعال سے فعل مضارع ہے، جس میں تائے افتعال کو دال سے بدل کر دال کو دال میں ادغام کر دیا ہے۔ اب وہ جس قیامت کو مذاق سمجھ رہے ہیں اور جس کا مطالبہ بڑے دھڑلے سے بار بار کر رہے ہیں، جب قریب آتی ہوئی دیکھیں گے تو سب ہنسی مذاق اور شیخی شوخی بھول جائیں گے، خوف اور دہشت سے ان کے چہرے بگڑ جائیں گے اور کہا جائے گا یہی ہے وہ قیامت جس کا تم مطالبہ کیا کرتے تھے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) {قُلْ اَرَءَيْتُمْ اِنْ اَهْلَكَنِيَ اللّٰهُ … : ’’ يُجِيْرُ ‘‘ ’’أَجَارَ يُجِيْرُ إِجَارَةً‘‘} افعال اجوف واوی۔ کفار مکہ اسلام کے پھیلنے سے پریشان ہو کر رسول اللہ صلی اللہ علیہ وسلم اور آپ کے ساتھیوں کے خلاف اپنی تمام کوششوں کا ناکام ہونا دیکھ کر اس امید پر جی رہے تھے کہ کبھی نہ کبھی زمانے کی گردش ان کا کام تمام کر دے گی۔ (دیکھیے طور : ۳۰) اس پر حکم ہوا کہ ان سے کہو مجھے اور میرے ساتھیوں کو اللہ تعالیٰ ہلاک کر دے یا ہم پر رحم کرے، توتمھیں اس سے کیا غرض ہے؟ تم اپنی فکر کرو کہ کفر کے نتیجے میں جو عذاب الیم تم پر آنے والا ہے، تمھیں اس سے کون بچائے گا؟"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) {قُلْ هُوَ الرَّحْمٰنُ اٰمَنَّا بِهٖ … :} یعنی وہ ہمیں ہلاک کرے یا ہم پر رحم کرے، دونوں صورتوں میں ہماری امیدیں اسی سے وابستہ ہیں، وہی رحمان ہے، کوئی اور نہیں جو ہم پر رحم کرسکے۔ ہمارا اس پر ایمان اور اسی پر بھروسا ہے، تم جو اس کے علاوہ بھی کسی سے رحم کے امید وار اور طلب گار ہو، بہت جلد آنکھیں بند ہوتے ہی جان لو گے کہ ہم میں سے صاف گمراہ کون تھا۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ {قُلْ اَرَءَيْتُمْ اِنْ اَصْبَحَ مَآؤُكُمْ غَوْرًا … : ’’ غَوْرًا ‘‘ ’’غَارَ يَغُوْرُ غَوْرًا‘‘} (ن) گہرا چلا جانا۔ مصدر بمعنی اسم فاعل ہے۔ {’’ مَعِيْنٍ ‘‘} کے لیے دیکھیے سورۂ صافات (۴۵)۔ ¤ ➋ اس آیت سے تعلق رکھنے والا ایک عجیب واقعہ صاحبِ کشاف نے ذکر کیا ہے کہ ایک ملحد کے پاس یہ آیت پڑھی گئی تو اس نے کہا کہ (اگر وہ پانی گہرا چلا جائے تو) کسیاں اور بیلچے اسے نکال لائیں گے، تو اس کی آنکھوں کا پانی خشک ہوگیا۔ اللہ تعالیٰ ہمیں اپنی اور اپنی آیات کی گستاخی سے اپنی پناہ میں رکھے۔ (آمین) پچھلی آیات میں فرمایا تھا کہ اگر اللہ تعالیٰ اپنا رزق روک لے اور بارش نہ برسائے تو کون ہے جو تمھیں بارش عطا فرمائے؟ قحط کے وقت اپنے خداؤں کی بے بسی تم دیکھ ہی چکے ہو۔ اب حکم ہوتا ہے ان سے پوچھو کہ یہی پانی جس پر تمھاری زندگی کا دارو مدار ہے، اگر گہرا ہو جائے اور تمھاری دسترس سے باہر ہو جائے تو کون ہے جو بہتا ہوا پانی تمھارے پاس لے آئے؟ ظاہر ہے کہ اللہ کے علاوہ کسی کے پاس یہ قوت نہیں ہے۔"
    }
  ]
}