{
  "surah": "Al-Anfaal",
  "surah_number": 8,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "{سورة الانفال} ¤ (آیت 1) ➊ {يَسْـَٔلُوْنَكَ عَنِ الْاَنْفَالِ: ’’ الْاَنْفَالِ ‘‘} یہ {’’ نَفَلٌ‘‘ } (نون اور فاء کے فتح کے ساتھ) کی جمع ہے، جیسا کہ {’’فَرَسٌ‘‘} کی جمع {’’ اَفْرَاسٌ‘‘} ہے۔ جس کا معنی زائد چیز ہے، جیسا کہ فرمایا : «{ وَ مِنَ الَّيْلِ فَتَهَجَّدْ بِهٖ نَافِلَةً لَّكَ}» [ بنی إسرائیل : ۷۹ ] ’’اور رات کے کچھ حصے میں پھر اس کے ساتھ بیدار رہ، اس حال میں کہ تیرے لیے زائد ہے۔‘‘ یعنی رات کا قیام فرض نمازوں سے زائد ہے۔ یہ لفظ کئی معنوں میں آتا ہے: (1) مال غنیمت، کیونکہ جہاد کا اصل مقصد تو ثواب اور حصولِ جنت ہے، غنیمت تو ایک زائد چیز ہے۔ شاید اسی لیے پہلی امتوںں کے لیے غنیمت حلال نہیں تھی، اس امت کو ثواب پر مزید غنیمت بھی حلال کر دی گئی۔ (2) امیر کسی خاص کارنامے پر غنیمت کے حصے سے زائد کسی انعام کا اعلان کر دے، یا دینا چاہے تو یہ بھی نفل ہے۔ (3) مقتول کے پاس جو بھی سامان اسلحہ یا سواری وغیرہ ہو وہ قاتل کو دیا جائے، اسے ’’سلب‘‘ کہتے ہیں، یہ بھی نفل ہے۔ (4) عام جنگ کے علاوہ کچھ دستے جنگ کے لیے جاتے ہوئے یا واپسی پر کسی بستی پر حملے کے لیے بھیجے جائیں اور وہ غنیمت لے کر آئیں تو وہ پورے لشکر کے لیے ہوگی، مگر اس دستے کو مجموعی غنیمت میں سے الگ زائد حصہ بھی دیا جائے گا جو رسول اللہ صلی اللہ علیہ وسلم جاتے وقت چوتھا حصہ اور واپسی پر تیسرا حصہ عطا فرماتے تھے۔ (5) امیر غنیمت کی تقسیم سے پہلے کوئی ایک چیز اپنے لیے چن لے، مثلاً کوئی اسلحہ یا سواری، یا لونڈی وغیرہ، اسے ’’صفی‘‘ بھی کہتے تھے۔ ¤ زمانۂ جاہلیت میں معمول تھا کہ جنگ میں جو شخص جو کچھ لوٹ لیتا اسی کا ہوتا۔ اسلام میں سب سے پہلا عظیم الشان معرکہ بدر واقع ہوا تو ابھی تک کفار سے حاصل ہونے والے مال کی تقسیم کا طریقہ مقرر نہیں ہوا تھا۔ بدر میں جب بہت سا مالِ غنیمت حاصل ہوا تو یہ مسئلہ پیش آیا۔ چنانچہ عبادہ بن صامت رضی اللہ عنہ فرماتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے تو میں آپ کے ساتھ بدر میں شریک ہوا۔ لوگوں کا باہمی مقابلہ ہوا، اللہ تعالیٰ نے دشمن کو شکست دی، تو ایک گروہ انھیں ہزیمت دیتے اور قتل کرتے ہوئے ان کے پیچھے چل پڑا، ایک گروہ لشکر گاہ پر متوجہ ہو کر اس کی حفاظت اور مال جمع کرنے لگ گیا اور ایک گروہ نے رسول اللہ صلی اللہ علیہ وسلم کے گرد گھیرا ڈالے رکھا کہ دشمن آپ کے متعلق کسی غفلت سے فائدہ نہ اٹھا لے۔ آخر سب لوگ واپس آ کر جمع ہوئے تو جنھوں نے غنیمتیں جمع کی تھیں، کہنے لگے، یہ ہم نے جمع کی ہیں، کسی اور کا ان میں کوئی حصہ نہیں، جو دشمن کے پیچھے گئے تھے انھوں نے کہا تم ہم سے زیادہ اس کے حق دار نہیں ہو، ہم نے دشمن کو ان سے ہٹایا اور انھیں مار بھگایا ہے۔ جنھوں نے رسول اللہ صلی اللہ علیہ وسلم کے گرد گھیر ڈالے رکھا، انھوں نے کہا، ہم نے رسول اللہ صلی اللہ علیہ وسلم کو گھیرے میں رکھا اور اس بات سے ڈرے کہ دشمن کسی طرح کی غفلت میں آپ کو نقصان نہ پہنچائے، چنانچہ ہم اس کام میں مشغول رہے، تو اس وقت یہ آیات اتریں : «{ يَسْـَٔلُوْنَكَ عَنِ الْاَنْفَالِ قُلِ الْاَنْفَالُ لِلّٰهِ وَ الرَّسُوْلِ فَاتَّقُووا اللّٰهَ وَ اَصْلِحُوْا ذَاتَ بَيْنِكُمْ }» تو رسول اللہ صلی اللہ علیہ وسلم نے انھیں مسلمانوں کے درمیان تقسیم کر دیا اور رسول اللہ صلی اللہ علیہ وسلم جب دشمن کی زمین میں حملے کے لیے جاتے تو چوتھا حصہ بطور نفل (زائد) دیتے تھے، پھر جب واپس آتے، لوگ تھکے ہوئے ہوتے تو تیسرا حصہ بطور نفل عطا فرماتے تھے اور آپ خصوصاً زائد حصے دینا پسند نہیں کرتے تھے اور فرماتے تھے : ’’مومنوں کا قوت والا ان کے کمزور پر غنیمت واپس لاتا ہے۔‘‘ [ أحمد : 323/5، ۳۲۴، ح ۲۲۷۶۲، وقال شعیب الأرنؤوط حسن لغیرہ ]ترمذی، ابن ماجہ، ابن حبان اور مستدرک حاکم میں بھی اس حدیث کے بعض اجزا مروی ہیں۔ ¤ ➋ {قُلِ الْاَنْفَالُ لِلّٰهِ وَ الرَّسُوْلِ …:} فرمایا آپ سے غنیمتوں کے بارے میں پوچھتے ہیں کہ یہ کس کا حق ہیں، کس طرح تقسیم ہوں گی، آپ فرما دیں کہ غنیمتیں حقیقت میں تم میں سے کسی کی بھی ملکیت نہیں، یہ اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کی ملکیت ہیں، تمھارا ان میں کچھ دخل نہیں، کیونکہ فتح تمھاری طاقت سے نہیں بلکہ اللہ کی مدد سے ہوئی ہے۔ آگے دور تک یہ بات بیان کی ہے کہ فتح اللہ کی مدد ہی سے ہوئی ہے اور ہوتی ہے، اس لیے تم اللہ سے ڈرو اور ان اموال کی وجہ سے تمھارے باہمی تعلقات میں جو خرابی آئی ہے اسے درست کرو اور اگر تم مومن ہو تو اللہ اور اس کا رسول جو بھی حکم دیں اس کی اطاعت کرو، جسے جتنا دیں یا نہ دیں، وہ اس پر راضی رہے اور اس مال کی بنا پر تمھارے آپس کے تعلقات ہر گز خراب نہیں ہونے چاہییں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تم آپس کے تعلقات بگاڑنے سے بچو، اس لیے کہ یہ چیز (دین) کو مونڈ دینے والی ہے۔‘‘ [ ترمذی، صفۃ القیامۃ، باب فی فضل صلاح ذات البین : ۲۵۰۸، عن أبی ھریرۃ رضی اللہ عنہ ] تفسیر ابن کثیر میں یہاں مسند ابی یعلی کے حوالے سے انس بن مالک رضی اللہ عنہ سے مروی ایک حدیث نقل کی گئی ہے جس میں اپنے بھائی کو معاف کرنے والے کے لیے اپنے بھائی کا ہاتھ پکڑ کر جنت میں جانے کا ذکر ہے، یہ روایت مستدرک میں بھی ہے، جسے امام حاکم نے صحیح کہا ہے، مگر ذہبی نے اس کے ایک راوی عباد کو ضعیف اور اس کے شیخ کو {’’لَا يُعْرَفُ‘‘} کہا ہے۔ ¤ ➌ { اِنْ كُنْتُمْ مُّؤْمِنِيْنَ:} اس آیت میں اللہ تعالیٰ کی اطاعت کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی اطاعت کو بھی ایمان کی شرط قرار دیا گیا ہے اور رسول اللہ صلی اللہ علیہ وسلم کی اطاعت سے مراد (جیسا کہ ظاہر ہے) آپپ کی سنت کی پیروی ہے، لہٰذا جو شخص آپ کی سنت سے منہ موڑ کر صرف قرآن کی اطاعت کرنا چاہتا ہے (جبکہ حدیث کے بغیر قرآن پر عمل کسی صورت ممکن ہی نہیں) وہ قرآن کی واضح تصریح کے مطابق دائرۂ ایمان سے خارج ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2تا4) {اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اِذَا ذُكِرَ اللّٰهُ …:} اوپر فرمایا کہ اطاعت ہے تو ایمان ہے، اب ان آیات میں ایمان والوں کی چند صفات بیان فرمائیں۔ سرفہرست یہ ہے کہ جب ان کے تنازعات کے درمیان اللہ کا ذکر یا اس کا حکم آ جائے تو ان کے دل دہل جاتے ہیں اور وہ اس کی نافرمانی سے کانپ اٹھتے ہیں۔ دوسری علامت یہ ہے کہ جب ان کے سامنے اللہ کے احکام بیان کیے جائیں تو وہ انھیں سچے دل سے مانتے ہوئے ان کی اطاعت کرتے ہیں، جس سے ان کے ایمان میں مزید اضافہ ہوتا رہتا ہے۔ اس سے معلوم ہوا کہ ایمان ایک ہی حالت پر نہیں رہتا بلکہ اس میں کمی بیشی ہوتی رہتی ہے۔ دلائل کو دیکھ کر یقین و تصدیق میں بھی اور اعمال کی کمی بیشی کے لحاظ سے بھی۔ تیسری علامت یہ ہے کہ جس کام کا انھیں حکم دیا جاتا ہے وہ اس کے تمام ذرائع اور اسباب تو اختیار کرتے اور اپنی کوشش پوری کرتے ہیں، مگر ان کا بھروسا ہمیشہ اللہ تعالیٰ پر ہوتا ہے، اپنی تیاری یا اسباب پر نہیں۔ اپنی پوری کوششوں کے بعد وہ اس کے انجام کو اللہ کے سپرد کر دیتے ہیں۔ ان کی چوتھی علامت یہ ہے کہ وہ نماز کو اس کے پورے حقوق اور آداب کے ساتھ ہمیشہ ادا کرتے ہیں اور پانچویں علامت یہ ہے کہ اپنے اموال میں سے اللہ تعالیٰ اور اس کے بندوں کے حقوق بھی ادا کرتے ہیں، جن لوگوں میں یہ پانچ علامات پائی جائیں اللہ تعالیٰ نے صرف انھی کو {’’الْمُؤْمِنُوْنَ حَقًّا‘‘} یعنی پکے سچے مومن قرار دیا ہے، ایسے ہی مومنوں کے لیے اللہ تعالیٰ کے ہاں بلند درجات بھی ہوں گے، بڑی بخشش بھی اور باعزت روزی بھی۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 2تا4) {اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اِذَا ذُكِرَ اللّٰهُ …:} اوپر فرمایا کہ اطاعت ہے تو ایمان ہے، اب ان آیات میں ایمان والوں کی چند صفات بیان فرمائیں۔ سرفہرست یہ ہے کہ جب ان کے تنازعات کے درمیان اللہ کا ذکر یا اس کا حکم آ جائے تو ان کے دل دہل جاتے ہیں اور وہ اس کی نافرمانی سے کانپ اٹھتے ہیں۔ دوسری علامت یہ ہے کہ جب ان کے سامنے اللہ کے احکام بیان کیے جائیں تو وہ انھیں سچے دل سے مانتے ہوئے ان کی اطاعت کرتے ہیں، جس سے ان کے ایمان میں مزید اضافہ ہوتا رہتا ہے۔ اس سے معلوم ہوا کہ ایمان ایک ہی حالت پر نہیں رہتا بلکہ اس میں کمی بیشی ہوتی رہتی ہے۔ دلائل کو دیکھ کر یقین و تصدیق میں بھی اور اعمال کی کمی بیشی کے لحاظ سے بھی۔ تیسری علامت یہ ہے کہ جس کام کا انھیں حکم دیا جاتا ہے وہ اس کے تمام ذرائع اور اسباب تو اختیار کرتے اور اپنی کوشش پوری کرتے ہیں، مگر ان کا بھروسا ہمیشہ اللہ تعالیٰ پر ہوتا ہے، اپنی تیاری یا اسباب پر نہیں۔ اپنی پوری کوششوں کے بعد وہ اس کے انجام کو اللہ کے سپرد کر دیتے ہیں۔ ان کی چوتھی علامت یہ ہے کہ وہ نماز کو اس کے پورے حقوق اور آداب کے ساتھ ہمیشہ ادا کرتے ہیں اور پانچویں علامت یہ ہے کہ اپنے اموال میں سے اللہ تعالیٰ اور اس کے بندوں کے حقوق بھی ادا کرتے ہیں، جن لوگوں میں یہ پانچ علامات پائی جائیں اللہ تعالیٰ نے صرف انھی کو {’’الْمُؤْمِنُوْنَ حَقًّا‘‘} یعنی پکے سچے مومن قرار دیا ہے، ایسے ہی مومنوں کے لیے اللہ تعالیٰ کے ہاں بلند درجات بھی ہوں گے، بڑی بخشش بھی اور باعزت روزی بھی۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 2تا4) {اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اِذَا ذُكِرَ اللّٰهُ …:} اوپر فرمایا کہ اطاعت ہے تو ایمان ہے، اب ان آیات میں ایمان والوں کی چند صفات بیان فرمائیں۔ سرفہرست یہ ہے کہ جب ان کے تنازعات کے درمیان اللہ کا ذکر یا اس کا حکم آ جائے تو ان کے دل دہل جاتے ہیں اور وہ اس کی نافرمانی سے کانپ اٹھتے ہیں۔ دوسری علامت یہ ہے کہ جب ان کے سامنے اللہ کے احکام بیان کیے جائیں تو وہ انھیں سچے دل سے مانتے ہوئے ان کی اطاعت کرتے ہیں، جس سے ان کے ایمان میں مزید اضافہ ہوتا رہتا ہے۔ اس سے معلوم ہوا کہ ایمان ایک ہی حالت پر نہیں رہتا بلکہ اس میں کمی بیشی ہوتی رہتی ہے۔ دلائل کو دیکھ کر یقین و تصدیق میں بھی اور اعمال کی کمی بیشی کے لحاظ سے بھی۔ تیسری علامت یہ ہے کہ جس کام کا انھیں حکم دیا جاتا ہے وہ اس کے تمام ذرائع اور اسباب تو اختیار کرتے اور اپنی کوشش پوری کرتے ہیں، مگر ان کا بھروسا ہمیشہ اللہ تعالیٰ پر ہوتا ہے، اپنی تیاری یا اسباب پر نہیں۔ اپنی پوری کوششوں کے بعد وہ اس کے انجام کو اللہ کے سپرد کر دیتے ہیں۔ ان کی چوتھی علامت یہ ہے کہ وہ نماز کو اس کے پورے حقوق اور آداب کے ساتھ ہمیشہ ادا کرتے ہیں اور پانچویں علامت یہ ہے کہ اپنے اموال میں سے اللہ تعالیٰ اور اس کے بندوں کے حقوق بھی ادا کرتے ہیں، جن لوگوں میں یہ پانچ علامات پائی جائیں اللہ تعالیٰ نے صرف انھی کو {’’الْمُؤْمِنُوْنَ حَقًّا‘‘} یعنی پکے سچے مومن قرار دیا ہے، ایسے ہی مومنوں کے لیے اللہ تعالیٰ کے ہاں بلند درجات بھی ہوں گے، بڑی بخشش بھی اور باعزت روزی بھی۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {كَمَاۤ اَخْرَجَكَ رَبُّكَ مِنْۢ بَيْتِكَ …: } یہاں یہ سوال پیدا ہوتا ہے کہ وہ کون سی بات ہے جس کے متعلق اللہ تعالیٰ فرما رہے ہیں کہ یہ بھی اسی طرح ہے جیسے تیرے رب نے تجھے تیرے گھر سے حق کے ساتھ نکالا۔ مفسرین نے اس {’’ كَمَا ‘‘} (جس طرح) کی کئی توجیہیں کی ہیں، بعض نے وہ بیس تک پہنچا دی ہیں، البتہ صاحب کشاف نے صرف دو توجیہیں کی ہیں، جن میں سے زیادہ واضح یہ ہے کہ یہاں مبتدا محذوف ہے اور عبارت یوں ہو گی {’’ هٰذِهِ الْحَالُ كَحَالِ إِخْرَاجِكَ يَعْنِيْ اَنَّ حَالَهُمْ فِيْ كَرَاهِيَةِ مَا رَأَيْتَ مِنْ تَنْفِيْلِ الْغَزْوَةِ مِثْلُ حَالِهِمْ فِيْ كَرَاهَةِ خُرُوْجِكِ لِلْحَرْبِ ‘‘} یععنی غزوۂ بدر سے حاصل ہونے والی غنیمت کی تقسیم کے بارے میں آپ کی رائے اور فیصلے کو ناگوار سمجھنے میں ان کا حال ایسا ہی ہے جس طرح ان کا حال آپ کے لڑائی کے لیے نکلنے کے بارے میں تھا، حالانکہ دونوں ہی میں آپ کے لیے اور مسلمانوں کے لیے خیر ہی خیر تھی۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’غنیمت کا یہ جھگڑا بھی ویسا ہی ہے جیسا کہ نکلتے وقت عقل سے تدبیریں کرنے لگے اور آخر کار صلاح وہی ٹھہری جو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، تو ہر کام میں یہی اختیار کرو کہ حکم برداری میں اپنی عقل کو دخل نہ دو۔‘‘ (موضح)"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {يُجَادِلُوْنَكَ فِي الْحَقِّ … :} حق سے مراد کفار کا قافلہ نکل جانے کے بعد کفار سے ہر صورت لڑائی ہے، جس کا انجام فتح اور غنائم ہو گا۔ مختصراً واقعہ یہ ہے کہ سن ۲ ھ میں نبی صلی اللہ علیہ وسلم کو اطلاع ملی کہ کفارِ قریش کا ایک بہت بڑا تجارتی قافلہ ابوسفیان کی سرکردگی میں شام سے مکہ جا رہا ہے اور مدینہ کے قریب کے راستے پر پہنچ چکا ہے، آپ صلی اللہ علیہ وسلم مسلمانوں کی مختصر سی جمعیت جو تین سو سے کچھ اوپر تھی، لے کر قافلے کے تعاقب کے لیے نکل کھڑے ہوئے۔ ابوسفیان کو آپ کے نکلنے کی اطلاع ہو گئی، اس نے ایک تیز رفتار سوار کے ذریعے سے مکہ اطلاع بھیج دی اور خود احتیاطاً اصل راستہ چھوڑ کر ساحلی راستہ اختیار کر لیا۔ مکہ میں جب یہ خبر پہنچی تو ابوجہل ایک بڑا مسلح لشکر لے کر قافلے کی حفاظت کے لیے روانہ ہو گیا اور آ کر بدر میں ڈیرے ڈال دیے۔ نبی صلی اللہ علیہ وسلم کو اطلاع ہوئی تو آپ نے مسلمانوں کے سامنے ساری صورت حال رکھ دی کہ ایک طرف تجارتی قافلہ ہے اور دوسری طرف قریش کا لشکر ہے، اللہ کا وعدہ ہے کہ تمھیں دونوں میں سے ایک ضرور ملے گا۔ اس پر بعض صحابہ کو تردد ہوا، وہ چاہتے تھے کہ لشکر کے بجائے قافلے کا تعاقب کیا جائے۔ اس وقت ابوبکر، عمر، سعد بن معاذ اور مقداد بن اسود رضی اللہ عنھم نے اطاعت کی تقریریں کیں، مقداد رضی اللہ عنہ نے کہا کہ آپ ہمیں موسیٰ ( علیہ السلام ) کے ساتھیوں جیسا نہیں پائیں گے، جنھوں نے کہا کہ جا تو اور تیرا رب لڑو، ہم تو یہیں بیٹھے ہیں!! تب آپ بدر کی طرف روانہ ہوئے اور اس وقت بعض صحابہ نے لشکر سے نہ لڑنے کا مشورہ دیا تھا، اسے {’’ يُجَادِلُوْنَكَ ‘‘} (وہ تجھ سے جھگڑتے تھے) سے تعبیر کیا ہے۔ ¤ ➋ {كَاَنَّمَا يُسَاقُوْنَ اِلَى الْمَوْتِ … :} یعنی سمجھتے تھے کہ اتنے بڑے لشکر سے لڑنا اپنے آپ کو موت کے منہ میں ڈالنا ہے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {وَ اِذْ يَعِدُكُمُ اللّٰهُ اِحْدَى الطَّآىِٕفَتَيْنِ اَنَّهَا لَكُمْ:} یعنی قافلے یا کفار پر فتح اور اموال غنیمت۔ ¤ ➋ {وَ تَوَدُّوْنَ اَنَّ غَيْرَ ذَاتِ الشَّوْكَةِ … : ’’ الشَّوْكَةِ ‘‘} کانٹے کو کہتے ہیں، یعنی تمھاری خواہش یہ تھی کہ کسی تکلیف اور جنگ کے بغیر حاصل ہونے والا قافلہ تمھیں مل جائے، جب کہ اللہ تعالیٰ کا ارادہ یہ تھا کہ اپنی باتوں اور وعدوں کے مطابق حق کو سچا ثابت فرمائے اور کافروں کی جڑ کاٹ دے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) {لِيُحِقَّ الْحَقَّ وَ يُبْطِلَ الْبَاطِلَ …:} اس لیے اس نے ایسے اسباب پیدا فرما دیے کہ تمھارا مقابلہ تجارتی قافلے کے بجائے قریش کے لشکر سے ہوا اور تمھیں فتح نصیب ہوئی، جس سے ان کی سیاسی اور فوجی طاقت پر کاری ضرب لگی، یہی اللہ تعالیٰ کی وہ حکمت تھی جسے تم نہیں سمجھ رہے تھے اور تم میں سے بہت سے لوگ یہ چاہ رہے تھے کہ لشکر سے مقابلے کے بجائے تجارتی قافلہ ان کے ہاتھ لگے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {اِذْ تَسْتَغِيْثُوْنَ رَبَّكُمْ … :} اپنی تعداد، تیاری، اسلحہ کی کے تین گنا سے زیادہ اور ہر قسم کے اسلحے سے لیس ہونے کی وجہ سے سب مسلمان ہی اپنے پروردگار سے مدد کے لیے فریاد کر رہے تھے۔ خصوصاً رسول اللہ صلی اللہ علیہ وسلم تو نہایت عجز اور الحاح کے ساتھ دعا فرما رہے تھے۔ عمر بن خطاب رضی اللہ عنہ فرماتے ہیں کہ جب بدر کا دن ہوا تو رسول اللہ صلی اللہ علیہ وسلم نے مشرکین کی طرف دیکھا، وہ ایک ہزار تھے اور آپ کے ساتھی تین سو انیس آدمی تھے، تو اللہ کے نبی صلی اللہ علیہ وسلم نے قبلے کی طرف رخ کرکے ہاتھ پھیلا دیے اور اپنے رب سے بلند آواز سے فریاد کرنے لگے : ’’اے اللہ! تو نے مجھ سے جو وعدہ کیا ہے وہ مجھ سے پورا کر، اے اللہ! تو نے مجھ سے جو وعدہ کیا ہے وہ مجھ سے پورا کر۔ اے اللہ! اگر اہل اسلام کی یہ جماعت ہلاک ہو گئی تو پھر زمین میں تیری عبادت نہیں کی جائے گی۔‘‘ آپ اپنے رب سے بلند آواز سے فریاد کرتے رہے اور ہاتھ پھیلائے ہوئے دعا کرتے رہے، یہاں تک کہ آپ کی چادر کندھوں سے گر گئی تو ابوبکر رضی اللہ عنہ آپ کے پاس آئے، آپ کی چادر پکڑی، اسے آپ کے کندھوں پر ڈالا، پھر پیچھے سے آپ سے چمٹ گئے اور کہا : ’’اے اللہ کے نبی! آپ کا اپنے رب کو قسم دینا آپ کے لیے کافی ہے، کیونکہ یقینا وہ آپ سے کیا ہوا وعدہ پورا کرے گا۔‘‘ تو اللہ تعالیٰ نے یہ آیت اتاری : «{ اِذْ تَسْتَغِيْثُوْنَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ }» پھر اللہ تعالیٰ نے فرشتوں کے ساتھ آپ کی مدد فرمائی۔ [ مسلم، الجہاد، باب الإمداد بالملائکۃ فی غزوۃ بدر… : ۱۷۶۳ ] ابن عباس رضی اللہ عنھما فرماتے ہیں کہ ابوبکر رضی اللہ عنہ کے کہنے کے بعد آپ یہ کہتے ہوئے نکلے : «{ سَيُهْزَمُ الْجَمْعُ وَ يُوَلُّوْنَ الدُّبُرَ }» [ القمر : ۴۵ ] ’’یہ جماعت شکست کھائے گی اور یہ لوگ پیٹھیں پھیر کر بھاگیں گے۔‘‘ [ بخاری، المغازی، باب قول اللہ تعالٰی : « إذ تستغیثون ربکم…» : ۳۹۵۳ ] ¤ ➋ {اَنِّيْ مُمِدُّكُمْ بِاَلْفٍ مِّنَ الْمَلٰٓىِٕكَةِ مُرْدِفِيْنَ:} ایک دوسرے کے پیچھے، یعنی پے در پے آنے والے ہیں۔ چنانچہ بدر میں فرشتے نازل ہوئے، جیسا کہ صحیح بخاری میں ابن عباس رضی اللہ عنھما سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے بدر کے دن فرمایا : ’’یہ جبریل ہیں، اپنے گھوڑے کے سر (لگام) کو پکڑے ہوئے ہیں، لڑائی کے ہتھیار پہنے ہوئے ہیں۔‘‘[ بخاری، المغازی، باب شہود الملائکۃ بدراً: ۳۹۹۵ ] یہاں ایک ہزار فرشتے اترنے کے وعدے کا ذکر ہے جو واقعی اترے۔ رفاعہ بن رافع قرظی بدری رضی اللہ عنہ سے روایت ہے کہ جبریل علیہ السلام نبی صلی اللہ علیہ وسلم کے پاس آئے، پوچھا : ’’تم اہل بدر کو اپنے میں کیسا شمار کرتے ہو؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’مسلمانوں کے سب سے بہتر لوگ۔‘‘ یا اس کے ہم معنی کوئی بات کہی۔ (جبریل علیہ السلام نے) فرمایا : ’’اسی طرح وہ فرشتے بھی (افضل) ہیں جو بدر میں شریک ہوئے تھے۔‘‘ [ بخاری، المغازی، باب شہود الملائکۃ بدرًا : ۳۹۹۲ ] سورۂ آل عمران میں تین ہزار اور پانچ ہزار فرشتوں کے وعدے کا ذکر ہے، تطبیق کے لیے دیکھیے آل عمران (۱۲۴، ۱۲۵)۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {وَ مَا جَعَلَهُ اللّٰهُ اِلَّا بُشْرٰى … :} آیت کے ان الفاظ سے بعض لوگوں کو یہ غلط فہمی ہوئی کہ فرشتوں نے خود لڑنے میں کوئی حصہ نہیں لیا، بلکہ اللہ تعالیٰ نے انھیں مسلمانوں کی مدد کے لیے محض اس لیے بھیجا تھا کہ ان کے حوصلے بلند ہوں اور انھیں اطمینان رہے کہ ان کی مدد کے لیے فرشتے موجود ہیں، لیکن یہ خیال صحیح نہیں۔ صحیح مسلم میں ابن عباس رضی اللہ عنھما سے مروی ہے کہ اس دوران میں کہ ایک مسلمان مشرکین میں سے ایک آدمی کے پیچھے دوڑ رہا تھا کہ اس نے کوڑا مارنے کی ضرب کی آواز سنی اور ایک سوار کی آواز سنی جو کہہ رہا تھا حیزوم! آگے بڑھو۔ اس نے اس مشرک کو دیکھا کہ وہ چت گر گیا ہے، دیکھا تو اس کی ناک پر نشان تھا، چہرہ پھٹ گیا تھا، جس طرح کوڑا مارنے سے ہوتا ہے اور وہ ساری جگہ سبز ہو گئی تھی۔ وہ انصاری آیا اور اس نے رسول اللہ صلی اللہ علیہ وسلم سے یہ بات بیان کی، تو آپ نے فرمایا : ’’تم نے سچ کہا، یہ تیسرے آسمان کی مدد میں سے تھا۔‘‘ [ مسلم، الجھاد، باب الامداد بالملائکۃ فی غزوۃ بدر… : ۱۷۶۳ ] بدر کے بعد بھی اللہ تعالیٰ نے کئی جنگوں میں فرشتوں کے ساتھ مسلمانوں کی مدد فرمائی۔ میں نے بہت سے قابل اعتماد لوگوں سے سنا کہ متحدہ ہندوستان میں حافظ عبد اللہ روپڑی رحمہ اللہ کے حکم پر مسلمانوں نے عید الاضحی کے دن گائیں ذبح کیں، تو ہندوؤں اور سکھوں نے مسلمانوں پر حملہ کر دیا، مسلمانوں نے تھوڑی تعداد میں ہونے کے باوجود مقابلہ کیا تو کفار کثیر تعداد میں قتل ہوئے اور بھاگ گئے۔ جب مقدمہ چلا تو جنگ میں شریک مسلمان اور کافر پیش ہوئے، کفار کو شناخت کے لیے کہا گیا تو انھوں نے کہا، ہم سے تو وہ لوگ لڑے ہیں جو سفید لباس میں ملبوس گھوڑوں پر سوار تھے، حالانکہ مسلمانوں میں سے کوئی بھی اس حالت میں نہ تھا۔ کشمیر میں کفار کے خلاف کار روائیوں کے دوران بھی فرشتوں کی مدد کے کئی واقعات پیش آئے ہیں جو مجلہ الدعوۃ اور غزوہ کے مختلف شماروں میں شائع ہوئے ہیں۔ شاعر نے سچ کہا ہے: ¤ فضائے بدر پیدا کر فرشتے تیری نصرت کو ¤ اتر سکتے ہیں گردوں سے قطار اندر قطار اب بھی ¤ ➋ {وَ مَا النَّصْرُ اِلَّا مِنْ عِنْدِ اللّٰهِ … :} یعنی یہ نہ سمجھو کہ تمھیں جو فتح نصیب ہوئی ہے وہ ان فرشتوں کی وجہ سے ہوئی ہے، بلکہ حقیقت میں مدد اللہ کی طرف سے ہے، وہ چاہتا تو فرشتوں کے بغیر ہی تمھیں فتح عطا کر دیتا، مگر جہاد کو دین کا حصہ بنانے سے تمھارے ایمان کا امتحان، تمھارے ہاتھوں کافروں کو ذلیل اور تم میں سے کچھ لوگوں کو شہادت سے سرفراز کرنا مقصود ہے۔ پہلی امتوں میں سے جو امت اپنے پیغمبر کو جھٹلاتی اس پر اللہ تعالیٰ کی طرف سے کسی نہ کسی طرح کا عذاب نازل ہو جاتا، پانی میں غرق کرنا، خوف ناک چیخ، زلزلہ، پتھروں کی بارش اور شکلیں مسخ کر دینا وغیرہ۔ نوح علیہ السلام کی قوم کے غرق ہونے سے لے کر فرعون کے غرق ہونے تک یہی سلسلہ قائم رہا۔ آخر کار جب موسیٰ علیہ السلام پر تورات نازل ہوئی تو جہاد شروع ہوا اور اس کے بعد یہی طریقہ جاری ہے، اب اللہ تعالیٰ مسلمانوں کے ہاتھوں کفار کو عذاب دینا چاہتا ہے، فرمایا : «{ قَاتِلُوْهُمْ يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ وَ يُخْزِهِمْ … }» [ التوبۃ : ۱۴، ۱۵ ] ان آیات میں اللہ تعالیٰ نے جہاد کے چھ فائدے بیان فرمائے ہیں، تفصیل کے لیے سورۂ توبہ میں ان آیات کی تفسیر دیکھیے۔ اگرچہ موسیٰ علیہ السلام کے بعد بھی آسمان سے عذاب کے بعض واقعات پیش آئے، جیسے اصحاب الفیل کا واقعہ اور رسول اللہ صلی اللہ علیہ وسلم کی پیش گوئی کے مطابق آپ کی امت میں شراب، زنا، ریشم اور باجوں گاجوں کو حلال کرلینے والوں پر زمین میں دھنس جانے اور بندر اور خنزیر بنا دیے جانے کے عذاب آئیں گے۔ [ بخاری، الأشربۃ، باب ما جاء فیمن یستحل الخمر… : ۵۵۹۰، عن أبی مالک الأشعری رضی اللہ عنہ ] مگر وہ عبرت کے لیے ہوں گے اور جزوی، یعنی کہیں کہیں ہوں گے۔ کفار کو کفر سے روکنے اور ان کی سرکشی ختم کرکے انھیں اسلام کے زیر نگیں لانے کی ذمہ داری اب جہاد کے ذریعے سے مسلمانوں ہی پر ہے، جس میں یقینا اللہ تعالیٰ کی مدد بھی شامل ہو گی۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ { اِذْ يُغَشِّيْكُمُ النُّعَاسَ اَمَنَةً مِّنْهُ:} جنگ بدر میں فرشتوں کے ساتھ مدد کے علاوہ یہ دوسری مدد تھی۔ یہ اونگھ دو طرح سے آئی، ایک تو یہ کہ جس رات کی صبح کو لڑائی ہونے والی تھی صحابہ کرام رضی اللہ عنھم خوب سوئے، حالانکہ دشمن کی فکر لگی ہوئی تھی مگر اللہ تعالیٰ نے ان پر نیند بھیج دی، تاکہ وہ تازہ دم ہو جائیں اور دشمن کا ڈٹ کر مقابلہ کریں۔ علی رضی اللہ عنہ فرماتے ہیں : ’’بدر کے دن مقداد رضی اللہ عنہ کے سوا اور کسی کے پاس گھوڑا نہیں تھا، میں نے دیکھا کہ ہم میں سے ہر شخص سو رہا تھا مگر رسول اللہ صلی اللہ علیہ وسلم درخت کے نیچے نماز پڑھتے رہے اور رو رو کر دعائیں کرتے رہے، حتیٰ کہ صبح ہو گئی۔‘‘ [ أحمد : ۱؍۱۲۵، ح : ۱۰۲۳، قال شعیب أرنؤوط إسنادہ صحیح ] اس نیند کے ساتھ مسلمان تازہ دم ہو گئے۔ دوسرا یہ کہ لڑائی سے پہلے میدان میں آنے پر تمام مسلمانوں پر اللہ تعالیٰ نے اونگھ طاری کر دی، حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم پر بھی۔ حافظ ابن کثیر رحمہ اللہ فرماتے ہیں : ’’لڑائی کے دوران میں اونگھ طاری ہونے کا واقعہ جنگ احد میں بھی پیش آیا، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ ثُمَّ اَنْزَلَ عَلَيْكُمْ مِّنْۢ بَعْدِ الْغَمِّ اَمَنَةً نُّعَاسًا يَّغْشٰى طَآىِٕفَةً مِّنْكُمْ }» [ آل عمران : ۱۵۴ ] ’’پھر اس غم کے بعد اس نے تم پر ایک امن نازل فرمایا، جو ایک اونگھ تھی، جو تم میں سے کچھ لوگوں پر چھا رہی تھی۔‘‘ یہاں مذکور آیت : «{ اِذْ يُغَشِّيْكُمُ النُّعَاسَ }» میں یہ معاملہ بدر کے دن پیش آیا، جس سے مسلمانوں کے دلوں سے دشمن کا خوف ختم ہو گیا اور امن و اطمینان کی کیفیت پیدا ہو گئی۔‘‘ سبھی شرکاء پر ایک ہی وقت میں اونگھ طاری کرنا، جس سے وہ بے سدھ ہو کر سو بھی نہ جائیں، بلکہ دشمن کی حرکت پر فوراً متحرک ہو جائیں اور اس اونگھ کی برکت سے انھیں ہر قسم کے خطرے سے بے خوف کرکے امن عطا کرنا، یقینا ایک عظیم معجزہ تھا۔ اہل علم فرماتے ہیں، لڑائی کے دوران میں اونگھ آنا اللہ تعالیٰ کی خاص رحمت ہوتی ہے۔ ¤ ➋ {وَ يُنَزِّلُ عَلَيْكُمْ مِّنَ السَّمَآءِ مَآءً … : } یہ بھی اسی رات کا واقعہ ہے کہ رات کو بارش ہو گئی، جس سے ایک تو ریت جم گئی اور زمین پر پاؤں اچھی طرح جمنے لگے، جس سے فائدہ اٹھا کر مسلمان آگے بڑھے، نقل و حرکت آسان ہو گئی، دوسرے پانی کی کمی دو ر ہو گئی اور وضو اور طہارت کے لیے آسانی ہو گئی، جب کہ کفار کے پڑاؤ کی جگہ نیچی تھی، وہاں بارش کی وجہ سے کیچڑ ہو گئی اور پاؤں پھسلنے لگے۔ تیسرے مسلمانوں کے دلوں سے شیطان کی گندگی، یعنی گھبراہٹ، خوف، اللہ تعالیٰ سے بدگمانی اور مایوسی کی کیفیت دور ہو گئی اور صبح ہوئی تو وہ لڑنے کے لیے چاق چوبند تھے۔ بدر کے موقع پر یہ تیسرا انعام تھا جس سے کفار پر فتح یاب ہونے میں بڑی مدد ملی۔ (ابن کثیر)"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {اِذْ يُوْحِيْ رَبُّكَ اِلَى الْمَلٰٓىِٕكَةِ اَنِّيْ مَعَكُمْ:} اس سے معلوم ہوا کہ فرشتے بھی اپنے طور پر کچھ نہیں کر سکتے۔ ¤ ➋ { سَاُلْقِيْ فِيْ قُلُوْبِ الَّذِيْنَ كَفَرُوا الرُّعْبَ: } یہ چوتھا انعام ہے جو میدان بدر ہی میں نہیں بلکہ تمام جنگوں میں رسول اللہ صلی اللہ علیہ وسلم اور امت مسلمہ کو عطا ہوا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھے پانچ چیزیں دی گئی ہیں جو مجھ سے پہلے کسی کو نہیں دی گئیں۔‘‘ ان میں سے ایک یہ بیان فرمائی : ’’مجھے ایک مہینے کی مسافت پر رعب کے ذریعے سے مدد دی گئی۔‘‘ [ بخاری، التیمم، بابٌ : ۳۳۵ ] اس کا باعث اللہ تعالیٰ نے دوسری آیات میں کفار کا مشرک ہونا بیان فرمایا۔ دیکھیے سورۂ آل عمران (۱۵۱)۔ ¤ ➌ { فَاضْرِبُوْا فَوْقَ الْاَعْنَاقِ … : } گردنوں پر مارو، تاکہ ان کے ناپاک جسموں سے زمین پاک ہو اور ہاتھوں اور پاؤں کے ہر ہر پور پر ضرب لگاؤ، تاکہ وہ ہاتھوں سے لڑ نہ سکیں اور پاؤں سے بھاگ نہ سکیں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13){ ذٰلِكَ بِاَنَّهُمْ شَآقُّوا اللّٰهَ وَ رَسُوْلَهٗ:} یعنی کفار کو بدر کے دن جو ذلت آمیز شکست ہوئی اس کی وجہ یہ تھی کہ انھوں نے اللہ اور اس کے رسول کی اس طرح مخالفت کی کہ صاف مقابلے پر اتر آئے۔ {’’ شَآقُّوا ‘‘} یہ {’’ شِقٌّ ‘‘} سے مفاعلہ ہے کہ ایک طرف ایک ہو اور دوسری طرف دوسرا اس کے مقابلے میں ہو، یعنی مخالفت، مقابلے میں آنا۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) {ذٰلِكُمْ فَذُوْقُوْهُ:’’ ذٰلِكُمْ ‘‘ } یہ مبتدا ہے اور اس کی خبر گزشتہ آیت میں مذکور {’’ الْعِقَابِ ‘‘} ہے، یعنی {’’ذٰلِكُمُ الْعَذَابُ فَذُوْقُوْهُ ‘‘} ’’یہ ہے وہ عذاب سو اسے چکھو۔‘‘"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِذَا لَقِيْتُمُ الَّذِيْنَ كَفَرُوْا زَحْفًا …:’’ زَحَفَ الصَّبِيُّ ‘‘} جب بچہ زمین پر گھسٹتا ہوا چلے۔{’’ زَحَفَ الْجَيْشُ ‘‘} بڑا لشکر بھی چونکہ آہستہ آہستہ آگے بڑھتا ہے، اس لیے لشکر کے بڑھنے کو بھی {’’ زَحَفَ‘‘} کہتے ہیں۔ مراد یہ ہے کہ دشمن جب مقابلے کے لیے میدان میں سامنے آ کھڑا ہو تو بھاگو نہیں۔ یہ حکم صرف بدر ہی میں نہیں تھا بلکہ یہ حکم سب مسلمانوں کو ہمیشہ کے لیے ہے۔ متعدد احادیث میں کفار سے مقابلے کے وقت بھاگنے کو کبیرہ گناہ قرار دیا گیا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’سات ہلاک کرنے والے گناہوں سے بچو۔‘‘ ان میں سے ایک دشمن سے مڈ بھیڑ کے وقت پیٹھ پھیرنا ہے۔ [ بخاری، الوصایا، باب قول اللہ تعالٰی : « إن الذین یأکلون…» : ۲۷۶۶ ] رسول اللہ صلی اللہ علیہ وسلم نے اسی لیے بزدلی سے پناہ کی کئی دعائیں سکھائی ہیں، چنانچہ آپ ہر نماز کے بعد یہ دعا پڑھتے تھے : [ اَللّٰهُمَّ اِنِّيْ اَعُوْذُ بِكَ مِنَ الْجُبْنِ وَاَعُوْذُ بِكَ مِنَ الْبُخْلِ وَأَعُوْذُ بِكَ مِنْ أَنْ اُرَدَّ اِلٰی اَرْذَلِ الْعُمُرِ وَأَععُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ ] [ بخاری، الدعوات، باب الاستعاذۃ من أرذل العمر… : ۶۳۷۴، عن سعد رضی اللہ عنہ ] ¤ انس رضی اللہ عنہ نے فرمایا، رسول اللہ صلی اللہ علیہ وسلم جب کسی منزل پر اترتے تو میں کثرت سے آپ کو یہ پڑھتے ہوئے سنتا : [ اَللّٰهُمَّ اِنِّیْ أَعُوْذُبِكَ مِنَ الْهَمِّ وَالْحُزْنِ وَالْعَجْزِ وَالْكَسَلِ وَالْببُخْلِ وَالْجُبْنِ وَ ضَلَعِ الدَّيْنِ وَ غَلَبَةِ الرِّجَالِ ] [ بخاری، الجھاد والسیر، باب من غذا بصبی للخدمۃ : ۲۸۹۳ ]"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {اِلَّا مُتَحَرِّفًا لِّقِتَالٍ اَوْ مُتَحَيِّزًا اِلٰى فِئَةٍ: ’’ مُتَحَرِّفًا ‘‘ ’’ تَحَرَّفَ ‘‘} سے اسم فاعل ہے، جس کا معنی ایک طرف ہونا ہے، یعنی ایک طرف سے دوسری طرف دشمن کو دھوکا دینے کے لیے پلٹنا، پینترا بدلنا۔ {’’ مُتَحَيِّزًا ‘‘ ’’ تَحَيَّزَ ‘‘ } سے ہے، کسی جگہ اکٹھا ہونا، یعنی دشمن کو گھیرنے کے لیے یا ان کو دھوکا دینے کے لیے ایک طرف سے دوسری طرف پلٹنا یا پیچھے ہٹنا یا مسلمانوں کی بڑی جماعت کی طرف پناہ کے لیے اور دوبارہ حملے کے لیے لوٹ آنا گناہ نہیں، یعنی اللہ کا غضب اور جہنم کا ٹھکانا ہونا تو جنگ سے بھاگنے والے پر ہے، اگر فنون حرب کے تحت میدان چھوڑ کر پیچھے ہٹ جائے تو گناہ نہیں۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {فَلَمْ تَقْتُلُوْهُمْ وَ لٰكِنَّ اللّٰهَ قَتَلَهُمْ … :} صاحب کشاف نے فرمایا، یہاں حرف ’’فاء‘‘ یعنی ’’پس ‘‘ ایک شرط کا جواب ہے کہ اگر تم فخر کرو کہ ہم نے یہ کیا وہ کیا تو درست نہیں، بلکہ حقیقت یہ ہے کہ تم نے انھیں قتل نہیں کیا بلکہ اللہ نے انھیں قتل کیا، کیونکہ نہ تمھاری تعداد زیادہ تھی اور نہ تمھارے پاس اتنا سروسامان تھا کہ تم کافروں کے ہر طرح سے مسلح اور عظیم لشکر کو شکست دے سکتے۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’یہ اس لیے فرمایا کہ مسلمان یہ سمجھیں کہ فتح ہماری قوت سے نہیں بلکہ اللہ تعالیٰ کی مدد سے ہے، لہٰذا ان کو چاہیے کہ کسی بات میں اپنا دخل نہ دیا کریں۔ (موضح) ¤ ➋ { وَ مَا رَمَيْتَ اِذْ رَمَيْتَ:} یعنی وہ مٹھی جو آپ نے پھینکی، درحقیقت آپ نے نہیں پھینکی، کیونکہ اگر وہ آپ کی پھینکی ہوئی ہوتی تو اتنی دور ہی جا سکتی جتنی ایک آدمی کے پھینکنے سے جا سکتی ہے، اس کو اتنا بڑھانا اور ٹھیک نشانے پر پہنچانا کہ ہر مشرک کی آنکھ میں پہنچ جائے صرف اللہ تعالیٰ کا کام تھا۔ یہ اشارہ ہے اس واقعہ کی طرف جو حافظ ابن کثیر نے علی بن طلحہ عن ابن عباس رضی اللہ عنھما کی حسن سند سے بیان کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بدر کے دن دونوں ہاتھ اٹھائے اور کہا : ’’یا رب! اگر یہ جماعت ہلاک ہو گئی تو پھر زمین میں تیری عبادت کبھی نہیں ہوگی۔‘‘ تو جبریل علیہ السلام نے کہا : ’’آپ مٹی کی ایک مٹھی لیں اور ان کے چہروں پر پھینکیں۔‘‘ آپ صلی اللہ علیہ وسلم نے مٹی کی ایک مٹھی پکڑی اور ان کے چہروں کی طرف پھینکی تو جو بھی مشرک تھا اس کی آنکھوں، نتھنوں اور منہ میں اس مٹھی کا کچھ حصہ جا پہنچا تو وہ پیٹھ دے کر بھاگ گئے۔ گویا مٹی پھینکی آپ نے لیکن اس کو نشانے تک اللہ نے پہنچایا، ابتدائی کام پھینکنا آپ کا تھا اور انتہا نشانے پر لگانا اللہ کا فعل تھا۔ اگر درحقیقت خود آپ ہی اللہ تعالیٰ تھے تو دونوں فعل آپ کے ہوئے، آپ سے ایک فعل (نشانے پر لگانے) کی نفی کیوں کی گئی؟ ¤ ➌ بعض لوگ {’’ مَا رَمَيْتَ ‘‘} سے ثابت کرتے ہیں کہ درحقیقت نبی صلی اللہ علیہ وسلم خود ہی پروردگار عالم تھے، اس لیے اللہ تعالیٰ نے ان کے پھینکنے کو اپنا پھینکنا قرار دیا، مگر اس صورت میں تو لازم آئے گا کہ {’’ وَ لٰكِنَّ اللّٰهَ قَتَلَهُمْ ‘‘} سے بدری مسلمان بھی خود اللہ تعالیٰ ہی تھے کہ اللہ تعالیٰ نے ان کے کفار کے قتل کرنے کو اپنا کام قرار دیا ہے۔ مگر یہ نہایت کفریہ بات ہے جس سے دین اسلام کی جڑ ہی کٹ جاتی ہے۔ وہ صحابہ کرام رضی اللہ عنھم کچھ بدر ہی میں شہید ہوئے، کچھ بعد میں فوت یا شہید ہوئے، خود نبی صلی اللہ علیہ وسلم نے زہر کے اثر سے وفات پائی اور اللہ تعالیٰ تو ہمیشہ زندہ حی و قیوم ہے۔ پھر اللہ تعالیٰ کی ہستی تو ایک ہی ہے، فرمایا : «{ قُلْ هُوَ اللّٰهُ اَحَدٌ }» ان لوگوں کا رب عجیب ہے، جو ایک نہیں بلکہ بڑی تعداد میں ہے اور وہ شہید ہوتا اور مرتا بھی ہے، حقیقت یہ ہے کہ یہ لوگ ہندوؤں کی طرح ہر چیز کو رب مانتے ہیں اور اسے وحدت الوجود کہتے ہیں۔ جس کا نتیجہ قرآن و حدیث کے احکام کا خاتمہ اور اسلام و کفر اور جنت و دوزخ سب کے وجود کا انکار ہے۔ [ نَعُوْذُ بِاللّٰہِ مِنْ ذٰلِکَ] ¤ ➍ { وَ لِيُبْلِيَ الْمُؤْمِنِيْنَ مِنْهُ بَلَآءً حَسَنًا: ’’ لِيُبْلِيَ ‘‘} یہ {’’ بَلَاءٌ‘‘} سے مشتق ہے، از باب افعال، آزمانا، جو سختی اور مصیبت کے ساتھ بھی ہوتا ہے اور نعمت عطا فرما کر بھی، اس لیے {’’ بَلَاءٌ‘‘} کا معنی مصیبت بھی ہے اور انعام بھی۔ یہاں مراد انعام یا احسان اور عطا کے ساتھ آزمانا ہے۔ یعنی باوجود یہ کہ مسلمانوں کا سامان اور لشکر کافروں کے مقابلے میں کوئی حقیقت نہیں رکھتا تھا، مگر اللہ تعالیٰ نے انھیں فتح دی، تاکہ وہ اس نعمت کو پہچانیں اور اس کا شکر بجا لائیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) {ذٰلِكُمْ وَ اَنَّ اللّٰهَ مُوْهِنُ كَيْدِ الْكٰفِرِيْنَ:} یعنی یہ بات تو ہے ہی جس کا ذکر گزرا، یعنی فرشتوں کے ساتھ مدد، بارش برسانا، اونگھ ڈالنا، مشرکین کی آنکھوں میں خاک ڈالنا، ان کے ستر آدمیوں کا قتل اور ستر کا قید ہونا اور مسلمانوں کو فتح عظیم عطا ہونا وغیرہ، اس کے ساتھ مزید سنو کہ اللہ آئندہ بھی کفار کی سازشوں کو کمزور کر دے گا اور یہ اپنی کسی سازش میں کامیاب نہیں ہو سکیں گے۔ (ابن کثیر) یا یہ کہ انھوں نے جو یہ منصوبہ بنایا تھا کہ اپنے تجارتی قافلے کو بچا لے جائیں گے اور مسلمانوں کا زور بھی توڑ دیں گے، ان کا منصوبہ خاک میں ملا دیا، وہ خود مارے گئے اور تمھارے ہاتھوں قیدی بن گئے اور بھاری جانی و مالی نقصان اٹھا کر پسپا ہوئے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ {اِنْ تَسْتَفْتِحُوْا فَقَدْ جَآءَكُمُ الْفَتْحُ … :} فتح کا معنی یہاں فیصلہ ہے، جیسا کہ کفار کہتے تھے : «{ مَتٰى هٰذَا الْفَتْحُ اِنْ كُنْتُمْ صٰدِقِيْنَ }» [ السجدۃ : ۲۸ ] ’’یہ فیصلہ کب ہو گا، اگر تم سچے ہو؟‘‘ عبد اللہ بن ثعلبہ رضی اللہ عنہ بیان فرماتے ہیں : ’’جب (بدر کے دن) لوگ ایک دوسرے کے مقابل ہوئے تو ابوجہل نے کہا، اے اللہ! ہم میں سے جو شخص زیادہ رشتوں کو توڑنے والا اور ہمارے سامنے غیر معروف بات پیش کرنے والا ہے اسے آج صبح ہلاک کر دے، تو یہ فیصلہ طلب کرنے والا ابوجہل تھا۔‘‘ [ مستدرک حاکم 328/2، ح : ۳۲۶۴۔ أحمد : 431/5، ح : ۲۳۶۶۱، و صححہ شعیب أرنؤوط۔ السنن الکبریٰ للنسائی : 350/6، ح : ۱۱۲۰۱ ] ’’اگر تم فیصلہ چاہو‘‘ یہ خطاب کفار سے ہے، کیونکہ انھوں نے مکہ سے روانہ ہوتے وقت اور ابوجہل نے معرکۂ بدر سے پہلے یہ دعا کی تھی : ’’اے اللہ! ہم میں سے جو حق پر ہے اسے غالب اور جو باطل پر ہے اسے رسوا کر۔‘‘ گویا یہاں {’’ الْفَتْحُ ‘‘} کا معنی حکم اور فیصلہ ہے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’مکی سورتوں میں ہر جگہ کافروں کا یہ کلام نقل فرمایا کہ ہر گھڑی کہتے ہیں : «{ مَتٰى هٰذَا الْفَتْحُ }» یعنی کب فیصلہ ہو گا، سو اب فرمایا کہ یہ فیصلہ آ پہنچا۔‘‘ (موضح) ¤ ➋ { وَ اِنْ تَعُوْدُوْا نَعُدْ......:} یعنی اگر پھر مسلمانوں کی مخالفت اور ان سے جنگ کرو گے تو ہم پھر تمھارے ساتھ یہی سلوک کریں گے، اگرچہ تمھاری جماعت کتنی ہی بڑی کیوں نہ ہو۔ ¤ ➌ { وَ اَنَّ اللّٰهَ مَعَ الْمُؤْمِنِيْنَ: ’’ اَنَّ ‘‘} سے پہلے کئی الفاظ مقدر مانے جا سکتے ہیں، آسان یہ ہے کہ اس جملے کو {’’ وَاعْلَمُوْا ‘‘} کا مفعول مان لیا جائے، یعنی جان لو کہ یقینا اللہ مومنوں کے ساتھ ہے اور اللہ تعالیٰ جس کے ساتھ ہو کوئی اس کا کیا بگاڑ سکتا ہے؟"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اَطِيْعُوا اللّٰهَ وَ رَسُوْلَهٗ … : } کفار کو تنبیہ کے بعد اب مسلمانوں کو تلقین ہو رہی ہے کہ جب تمھیں کسی معاملے میں رسول اللہ صلی اللہ علیہ وسلم کا حکم معلوم ہو جائے تو اس کے خلاف کسی کی مت سنو، بلکہ اس کی اطاعت کرو۔ پہلے اللہ کی اطاعت بطور تمہید ہے، کیونکہ رسول کی اطاعت بھی اللہ ہی کی اطاعت ہے۔ سورت کے ابتدا میں اموالِ غنیمت کے متعلق اختلاف کو ختم کرنے کے لیے «{ قُلِ الْاَنْفَالُ لِلّٰهِ وَ الرَّسُوْلِ}» کا اعلان فرمایا تھا اور اطاعت رسول کو ایمان کی شرط قرار دیا تھا، پھر درمیان میں اپنے انعامات ذکر فرمائے اور اب پہلے کلام کو پھر اطاعت کی تلقین پر ختم فرمایا۔ ¤ ➋ { وَ اَنْتُمْ تَسْمَعُوْنَ:} اس کا یہ مطلب نہیں کہ جب تم سن رہے ہو اس وقت اس سے منہ نہ پھیرو، دوسرے اوقات میں بے شک پھیر لو، بلکہ مطلب یہ ہے کہ تم ہر وقت اللہ کے احکام قرآن و حدیث کی صورت میں سنتے ہو، اگر نہ سنا ہو، یا علم نہ ہو تو عذر ہو سکتا ہے، مگر حکم سن کر پھر بجا نہ لانا ایمان والوں کو زیب نہیں دیتا۔ جو شخص خود حکم سن کر بجا نہیں لاتا اس تک حکم اگر کسی کے واسطے سے پہنچے گا تو کیسے مانے گا۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {وَ لَا تَكُوْنُوْا كَالَّذِيْنَ قَالُوْا سَمِعْنَا … :} ان سے مراد مشرکین، منافقین اور اہل کتاب ہیں جو کانوں سے تو اللہ اور اس کے رسول کا کلام سنتے ہیں، مگر اس طرح کہ وہ نہیں سنتے، کیونکہ نہ وہ دل سے سنتے ہیں اور نہ قبول کرتے ہیں، ان کا سننا نہ سننے کے برابر ہے۔ دیکھیے سورۂ نساء (۴۶)۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) {اِنَّ شَرَّ الدَّوَآبِّ …: ’’ الدَّوَآبِّ ‘‘ ’’دَابَّةٌ‘‘} کی جمع ہے، {’’ دَبَّ يَدِبُّ (ض)‘‘} زمین پر چلنا۔ انسان کو {’’ الدَّوَآبِّ ‘‘} میں اس لیے شمار کیا کہ کتب لغہ میں ہر جاندار کو دابہ کہہ لیتے ہیں۔ مصباح میں ہے {’’دَابَّةٌ‘‘} زمین کا ہر جاندار، خواہ سمجھ رکھتا ہو یا نہ رکھتا ہو، یعنی کفار و منافقین جو کان سے اچھی بات نہ سنیں، زبان سے اچھی بات نہ نکالیں اور اللہ کی دی ہوئی عقل سے کام نہ لیں وہ اللہ تعالیٰ کے نزدیک تمام جانوروں سے بدتر ہیں، کیونکہ جانور تو اپنے فطری تقاضوں کے مطابق زندگی بسر کرتے ہیں اور ان لوگوں کو عبادت کے لیے پیدا کیا گیا ہے، مگر یہ اس غرض کو بھی پورا نہیں کرتے۔ یہاں پہلے بہرے ہونے کا ذکر ہے، پھر گونگے ہونے کا، کیونکہ حق سن کر ہی اس کی تائید و تبلیغ زبان سے ہوتی ہے، پھر بے عقل ہونے کا، کیونکہ بعض بہرے اور گونگے عقل سے حق کو سمجھتے اور اسے قبول کر لیتے ہیں، مگر یہ لوگ تینوں چیزوں سے خالی ہیں۔ دیکھیے سورۂ اعراف (۱۷۹) اور فرقان (۴۴)۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) {وَ لَوْ عَلِمَ اللّٰهُ فِيْهِمْ خَيْرًا لَّاَسْمَعَهُمْ … :} یعنی اگر ان کے دل میں خیر یعنی حق کی طلب ہوتی تو اللہ تعالیٰ ان کے لیے سننے کو نافع بنا کر ایمان و عمل کی توفیق دے دیتا۔ پہلے {’’ لَاَسْمَعَهُمْ ‘‘} (انھیں ضرور سنوا دیتا) سے مراد وہ سنانا ہے جو دل سے ہو اور فائدہ مند ہو اور {’’ لَوْ اَسْمَعَهُمْ ‘‘} (اور اگر وہ انھیں سنوا دیتا) سے مراد محض کانوں سے سنوانا ہے، یعنی اگر انھیں اسی حال میں کہ ان کے اندر کوئی بھلائی نہیں ہے، سنواتا تو یقینا وہ منہ پھیر کر چل دیتے، یعنی ان لوگوں نے مسلسل گناہوں کا ارتکاب کر کے اپنے اندر سے وہ استعداد ہی ختم کر دی ہے جو ایمان اور راہِ ہدایت کی پیروی کے لیے بیج کی حیثیت رکھتی ہے، پھر جب بیج ہی نہ ہو تو پھل کی امید کیا ہو سکتی ہے، چنانچہ دوسری آیت میں فرمایا : «{ كَلَّا بَلْ رَانَ عَلٰى قُلُوْبِهِمْ مَّا كَانُوْا يَكْسِبُوْنَ }» [ المطففین : ۱۴ ] ’’خبردار رہو کہ ان کے برے اعمال ان کے دلوں پر زنگ بن کر چھا گئے ہیں۔‘‘"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا اسْتَجِيْبُوْا لِلّٰهِ وَ لِلرَّسُوْلِ:’’اَجَابَ يُجِيْبُ‘‘} کا معنی قبول کرنا ہے اور{’’ اسْتَجِيْبُوْا ‘‘} باب استفعال {’’اِسْتَجَابَ يَسْتَجِيْبُ ‘‘ } سے ہے، جس میں عموماً طلب ہوتی ہے، یہاں طلب کا معنی نہیں ہوو سکتا، لہٰذا سین اور تاء کے اضافے سے معنی میں زیادتی مراد ہو گی، اس لیے ’’خوشی سے قبول کرو‘‘ ترجمہ کیا گیا ہے، یعنی اللہ اور اس کے رسول کی دعوت پر خوشی سے لبیک کہنا تم پرلازم ہے۔ ¤ ➋ { اِذَا دَعَاكُمْ:} ’’جب وہ تمھیں دعوت دے‘‘ کا مطلب یہ ہے کہ فوراً قبول کرو، دیر نہ کرو۔ ابی بن کعب رضی اللہ عنہ نماز پڑھ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے انھیں بلایا، وہ نماز پوری کرکے آئے تو آپ نے یہ آیت پڑھ کر فرمایا : ’’تم نے اللہ تعالیٰ کا یہ فرمان نہیں سنا؟‘‘ انھوں نے کہا : ’’آئندہ میں ان شاء اللہ ایسا نہیں کروں گا۔‘‘ [ ترمذی، فضائل القرآن، باب ما جاء فی فضل فاتحۃ الکتاب : ۲۸۷۵ ] صحیح بخاری میں اس آیت کی تفسیر میں ابوسعید بن معلی رضی اللہ عنہ کو نماز پڑھتے ہوئے بلانا اور اسی وقت نہ آنے پر یہی تلقین فرمانا موجود ہے۔ [ بخاری، التفسیر، باب : «یأیھا الذین اٰمنوا استجیبوا… » : ۴۶۴۷ ] ¤ ➌ {لِمَا يُحْيِيْكُمْ:} ’’اس چیز کے لیے جو تمھیں زندگی بخشتی ہے‘‘ اس سے متعلق علمائے سلف کے مختلف اقوال ہیں، بعض نے اسلام و ایمان اور بعض نے قرآن، لیکن اکثر نے اس سے جہاد مراد لیا ہے، کیونکہ جہاد دنیا اور آخخرت میں زندگی کا سب سے بڑا ذریعہ ہے، خصوصاً اس لیے کہ شروع سورت سے یہی بات چلی آ رہی ہے، آیت : «{ اَلَمْ تَرَ اِلَى الَّذِيْنَ خَرَجُوْا مِنْ دِيَارِهِمْ وَ هُمْ اُلُوْفٌ حَذَرَ الْمَوْتِ }» [ البقرۃ : ۲۴۳ ] سے مراد بھی جہاد کی ترغیب ہے۔ ابن عمر رضی اللہ عنھما فرماتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ فرما رہے تھے : ’’جب تم عینہ (حیلے سے سود کی ایک قسم) کے ساتھ بیع کرو گے اور بیلوں کی دمیں پکڑ لو گے اور کاشت کاری پر خوش ہو جاؤ گے اور جہاد کو چھوڑ دو گے تو اللہ تعالیٰ تم پر ایسی بڑی ذلت مسلط کرے گا جسے دور نہیں کرے گا، حتیٰ کہ تم اپنے دین کی طرف لوٹ آؤ۔‘‘ [ أبوداوٗد، البیوع، باب فی النہی عن العینۃ : ۳۴۶۲۔ السلسۃ الصحیحۃ : ۱۱ ] ¤ ➍ {وَ اعْلَمُوْۤا اَنَّ اللّٰهَ يَحُوْلُ بَيْنَ الْمَرْءِ وَ قَلْبِهٖ:} یعنی حق واضح ہو جانے کے بعد بھی اگر کوئی اللہ تعالیٰ اور رسول اللہ صلی اللہ علیہ وسلم کا حکم نہ مانے تو اللہ تعالیٰ کی طرف سے انسان کو یہ سزا ملتی ہے کہ وہ انسان اور اس کے دل کے درمیان حائل ہو جاتا ہے اور اس کے بعد اسے اللہ تعالیٰ اور رسول اللہ صلی اللہ علیہ وسلم کی دعوت پر لبیک کہنے کی توفیق نہیں ملتی، جیسے اللہ تعالیٰ نے فرمایا : «{ فَلَمَّا زَاغُوْۤا اَزَاغَ اللّٰهُ قُلُوْبَهُمْ }» [ الصف : ۵ ] ’’جب وہ خود ٹیڑھے ہو گئے تو اللہ نے ان کے دلوں کو ٹیڑھا کر دیا۔‘‘ آیت کے یہ معنی ابن عباس رضی اللہ عنھما اور جمہو رمفسرین نے بیان فرمائے ہیں۔ سورۂ انعام کی آیت (۱۰۹، ۱۱۰) میں بھی یہی بات بیان ہوئی ہے، جنگ تبوک میں کعب بن مالک رضی اللہ عنہ فوری طور پر نہ نکل سکے تو بعد میں جانے کی توفیق ہی نہیں ملی، یہ الگ بات ہے کہ اللہ تعالیٰ نے ان کے صدق اور انابت کی وجہ سے انھیں توبہ کی توفیق دی اور قرآن میں ان کا ذکر خیر فرمایا۔ شاہ عبد القادر رحمہ اللہ اس آیت کی تشریح یہ فرماتے ہیں : ’’حکم بجا لانے میں دیر نہ کرو، شاید اس وقت دل ایسا نہ رہے، دل اللہ کے ہاتھ میں ہے۔‘‘ (موضح) بعض مفسرین نے اس کی تفسیر یہ فرمائی کہ اللہ کے حائل ہونے سے مراد موت ہے، یعنی موت آنے سے پہلے اطاعت بجا لاؤ، اس کے بعد «{ وَ اَنَّهٗۤ اِلَيْهِ تُحْشَرُوْنَ }» (اور جان لو کہ یہ یقینی حقیقت ہے کہ تم اسی کی طرف لوٹائے جاؤ گے) کے جملے سے بھی اس معنی کی تائید ہوتی ہے۔ اصل یہ ہے کہ دونوں معنی ہی مراد ہو سکتے ہیں اور ان کا آپس میں کوئی تضاد نہیں۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ {وَ اتَّقُوْا فِتْنَةً لَّا تُصِيْبَنَّ الَّذِيْنَ ظَلَمُوْا … : ’’ فِتْنَةً ‘‘} میں تنوین تعظیم کے لیے ہے، اس لیے ’’عظیم فتنہ‘‘ ترجمہ کیا گیا ہے۔ متعدد احادیث صحیحہ سے ثابت ہے کہ جب کسی قوم میں امر بالمعروف اور نہی عن المنکرکا فریضہ سرانجام نہ دیا جائے تو اللہ تعالیٰ اس پر ہمہ گیر عذاب بھیج دیتا ہے۔ (ابن کثیر) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! تم ضرور نیکی کا حکم دو گے اور برائی سے منع کرو گے، یا پھر اللہ تعالیٰ تم پر اپنا عذاب بھیج دے گا، پھر تم اس سے دعا کرو گے مگر وہ تمھاری دعا قبول نہیں کرے گا۔‘‘ [ أحمد : 388/5، ۳۸۹، ح : ۲۳۳۰۱، عن حذیفۃ بن یمان رضی اللہ عنہ وحسنہ شعیب أرنؤوط ] اصحاب سبت یعنی ہفتے کے دن مچھلیاں پکڑنے والوں کا قصہ اس کی ایک مثال ہے۔ دیکھیے سورۂ اعراف (۱۶۴ تا ۱۶۷)۔ ¤ ➋ { وَ اعْلَمُوْۤا اَنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ:} مطلب یہ ہے کہ حکم کی بجا آوری میں کاہلی کرنے سے ایک تو دل ہٹتا ہے، دم بدم مشکل میں پڑتا ہے، دوسرے نیک لوگوں کے عمل میں سستی اختیار کرنے سے گناہ گار بالکل ہی عمل چھوڑ بیٹھیں گے، تو رسم بد پھیلے گی، اس کا وبال سب پر پڑے گا۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) {وَ اذْكُرُوْۤا اِذْ اَنْتُمْ قَلِيْلٌ … :} اس میں مکی زندگی میں مسلمانوں کی قلت تعداد، سختی اور خوف کا، پھر مدینہ میں ان کو اپنا گھر، امن و سکون اور راحت و آرام ملنے کا ذکر ہے۔ ’’اور تمھیں پاکیزہ چیزوں سے رزق دیا‘‘ میں دوسری تمام پاکیزہ نعمتوں کے ساتھ غنیمت کے اموال کا حلال کرنا بھی شامل ہے، کیونکہ یہ پہلی امتوں کے لیے حلال نہیں تھے، بلکہ جلا دیے جاتے تھے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27){ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَخُوْنُوا اللّٰهَ وَ الرَّسُوْلَ …:} امانتوں میں خیانت کا دائرہ بہت وسیع ہے۔ اس سے وہ تمام ذمہ داریاں اور عہد معاہدے مراد ہیں جو اللہ تعالیٰ یا بندوں سے کیے گئے ہوں۔ صلح، جنگ اور نکاح وغیرہ بھی اس میں شامل ہیں، ایک دوسرے کے ذاتی راز اور فوجی راز بھی امانت ہیں۔ حاطب بن ابی بلتعہ رضی اللہ عنہ نے فتح مکہ سے پہلے ایک عورت کو خط دے کر مکہ بھیجا تھا، جس میں اہل مکہ کو رسول اللہ صلی اللہ علیہ وسلم کے حملے کے ارادے سے آگاہ کیا تھا اور اس پر اللہ کی طرف سے تنبیہ ہوئی تھی۔ [ بخاری، ۳۹۸۳۔ مسلم : ۲۴۹۴ ] سورۂ ممتحنہ کے شروع میں اس کی تفصیل ملاحظہ فرمائیں۔ انس رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں کم ہی کوئی خطبہ دیا مگر اس میں فرمایا : [ لاَ اِيْمَانَ لِمَنْ لاَّ أَمَانَةَ لَهُ وَلاَ دِيْنَ لِمَنْ لاَّ عَهْدَ لَهُ ] [ أحمد : 135/3، ح : ۱۲۳۸۳، و حسنہ شعیب الأرنؤوط ۔ ابن حبان : ۱۹۴ ] ’’اس شخص کا کوئی ایمان نہیں جس کی کوئی امانت نہیں اور اس شخص کا کوئی دین نہیں جس کا کوئی عہد نہیں۔‘‘ عبد اللہ بن عمرو اور ابوہریرہ رضی اللہ عنھم سے مروی ہے کہ منافق کی علامات میں سے ایک علامت امانت میں خیانت بھی ہے۔ [ بخاری، الإیمان، باب علامات المنافق : ۳۳۔ مسلم : ۵۹ ]"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) {وَ اعْلَمُوْۤا اَنَّمَاۤ اَمْوَالُكُمْ وَ اَوْلَادُكُمْ فِتْنَةٌ … :} مال اور اولاد کی محبت انسان کے لیے بہت بڑی آزمائش ہے، کیونکہ عام طور پر انھی کے لیے آدمی خیانت اور رسول اللہ صلی اللہ علیہ وسلم کی نافرمانی کا ارتکاب کرتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اِنَّ الْوَلَدَ مَبْخَلَةٌ مَجْبَنَةٌ مَجْهَلَةٌ مَحْزَنَةٌ ] ’’بے شک بچہ بخل، بزدلی، جہالت اور غم کا باعث ہوتا ہے۔‘‘ [ صحیح الجامع الصغیر : ۱۹۹۰۔ مستدرک حاکم : 296/3، ح : ۵۲۸۴، عن الأسود بن خلف ] درحقیقت اللہ تعالیٰ آزمانا چاہتا ہے کہ آدمی اللہ اور اس کے رسول کے احکام کو ترجیح دیتا ہے، یا مال اور اولاد کی ایسی محبت کو جس سے خیانت اور احکامِ الٰہی کی نافرمانی لازم آتی ہو۔ اس ناجائز محبت پر غالب آنے کا طریقہ اس بات کا یقین ہے کہ اللہ تعالیٰ کے پاس بہت ہی بڑا اجر ہے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ {اِنْ تَتَّقُوا اللّٰهَ يَجْعَلْ لَّكُمْ فُرْقَانًا … :} مال اور اولاد کی آزمائش سے خبردار کرنے کے بعد اب تقویٰ کی تعلیم دی ہے اور اس کے فوائد بیان کیے ہیں، تقویٰ کا مادہ ’’و ق ی‘‘ ہے اور یہ اسم مصدر ہے۔ {’’ تَتَّقُوا ‘‘} باب افتعال سے ہے، اس کا معنی بچنا ہے، آدمی اسی چیز سے بچتا ہے جس سے ڈرتا ہو، اس لیے اس کا معنی ڈرنا بھی کر لیا جاتا ہے۔ {’’ فَرْقٌ‘‘} اور {’’ فُرْقَانٌ‘‘} مصدر ہیں، دونوں کا ایک ہی معنی ہے، مگر {’’ فُرْقَانًا ‘‘} کے حروف زیادہ ہونے کی وجہ سے معنی میں اضافہ ہو گیا، یعنی اگر تم ہر حال میں اللہ تعالیٰ سے ڈر کر اس کی نافرمانی سے بچتے رہو گے، خواہ کوئی دوسرا تمھارے پاس ہو یا نہ ہو تو تمھیں چار نعمتیں عطا ہوں گی، پہلی یہ کہ تم میں حق اور باطل کو پہچاننے اور ان کے درمیان فرق کرنے کی بہت بڑی قوت پیدا ہو جائے گی اور اس قوت کی بدولت اللہ تعالیٰ تمھیں کسی بھی شبہے، شک یا تذبذب کا شکار ہونے کے بجائے واضح طور پر ہر کام کے درست یا نا درست ہونے کی پہچان اور پھر اس کے مطابق عمل کرنے کی قوت عطا کرے گا، تم آسانی سے حق کا فیصلہ کرکے اس پر عمل کر سکو گے۔ دیکھیے سورۂ حدید (۲۸) اسی طرح وہ تمھیں فتح و نصرت عطا کرکے تمھارے اور تمھارے دشمنوں کے درمیان فیصلہ کرے گا۔ دوسری یہ کہ وہ تم سے تمھاری برائیاں دور کر دے گا اور تیسری یہ کہ قیامت کے دن وہ تمھارے گناہ بخش دے گا۔ ¤ ➋ { وَ اللّٰهُ ذُو الْفَضْلِ الْعَظِيْمِ:} یہ چوتھی نعمت ہے۔ فضل کا معنی زائد ہے، یعنی اللہ تعالیٰ تمھیں اتنا ہی بدلہ نہیں دے گا جتنا تم عمل کر وگے بلکہ اس سے کہیں زیادہ دے گا، کیونکہ وہ بہت زائد حتیٰ کہ تمھاری سوچ سے بھی بہت زائد عطیہ دینے والا ہے۔ اللہ تعالیٰ نے فرمایا : «{ فَلَا تَعْلَمُ نَفْسٌ مَّاۤ اُخْفِيَ لَهُمْ مِّنْ قُرَّةِ اَعْيُنٍ }» [ السجدۃ : ۱۷ ] ’’پس کوئی شخص نہیں جانتا کہ ان کے لیے آنکھوں کی ٹھنڈک میں سے کیا کچھ چھپا کر رکھا گیا ہے۔‘‘"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {وَ اِذْ يَمْكُرُ بِكَ الَّذِيْنَ كَفَرُوْا … :} جب تقریباً تمام صحابہ ہجرت کرکے مدینہ چلے گئے اور رسول اللہ صلی اللہ علیہ وسلم ، ابوبکر، علی رضی اللہ عنھما اور اکّا دکّا مسلمان مکہ میں رہ گئے تو کفار کو فکر لاحق ہوئی کہ اگر محمد ( صلی اللہ علیہ وسلم ) بھی ہمارے ہاتھ سے نکل گئے تو وہ ہمارے لیے ایسا خطرہ ثابت ہوں گے جو ہمارے قابو سے باہر ہو گا۔ چنانچہ ان کی دار الندوہ میں مجلس ہوئی، جس میں تجاویز و آراء طلب کی گئیں۔ اللہ تعالیٰ نے ان کا خلاصہ بیان فرمایا ہے، ایک رائے یہ تھی کہ آپ کو قید کر دیں اور موت تک وہاں سے نہ نکلنے دیں، اس پر یہ امکان سامنے آیا کہ ان کے ساتھی کار روائی کرکے انھیں چھڑا لیں گے۔ ایک تجویز یہ آئی کہ انھیں قتل کر دیا جائے، اس پر آپ کے خاندان بنو عبد مناف کے ساتھ لڑائی کا خطرہ سامنے آیا اور ایک مشورہ یہ آیا کہ ہم خود ہی انھیں مکہ سے نکال دیں، جہاں چاہیں جائیں، ہماری تو جان چھوٹے گی، اس پر یہ خطرہ سامنے آیا کہ وہ اپنے صدق و امانت، خوش خلقی اور خوش کلامی سے لوگوں کو اکٹھا کرکے تم پر حملہ آور ہوں گے۔ آخر فیصلہ یہ ٹھہرا کہ ہر قبیلے سے ایک نوججوان لیا جائے، وہ سب رات کو آپ کے گھر کا محاصرہ کر لیں، آپ جوں ہی باہر نکلیں وہ سب مل کر حملہ کرکے آپ کا کام تمام کر دیں۔ بنو عبد مناف کس کس سے لڑیں گے، آخر دیت پر راضی ہو جائیں گے۔ جبریل علیہ السلام نے اللہ تعالیٰ کے حکم سے آپ کو ان کی سازش کی اطلاع دے دی اور یہ بھی بتایا کہ اللہ تعالیٰ نے آپ کو ہجرت کی اجازت دے دی ہے۔ آپ اس رات اپنے بستر پر نہیں سوئے، بلکہ علی رضی اللہ عنہ کو اپنے بستر پر سلا دیا۔ کافر ساری رات انتظار میں رہے مگر اللہ تعالیٰ نے اپنی خفیہ تدبیر سے کفار کی سازش کو ناکام کرکے آپ کو بحفاظت نکال لیا، اگلے دن آپ نے ابوبکر رضی اللہ عنہ کی معیت میں ہجرت فرمائی۔ سیرت کی تمام کتابوں میں یہ قصہ مذکور ہے جس کا یہ خلاصہ قرآن مجید کے مطابق ہے۔ ¤ عبد اللہ بن عباس رضی اللہ عنھما بیان کرتے ہیں : ’’ہجرت کی رات علی رضی اللہ عنہ نے اپنی جان کا سودا کیا، وہ یہ کہ انھوں نے نبی صلی اللہ علیہ وسلم کی چادر اوڑھی اور آپ کی جگہ سو گئے۔‘‘ [ أحمد : 330/1، ۳۳۱، ح : ۳۰۶۲۔ مستدرک حاکم : 4/3، ح ۴۲۶۴۔ وصححہ الحاکم و وافقہ الذھبی ] ہجرت کے واقعہ کی تفصیل کے لیے دیکھیے سورۂ توبہ (۴۰)۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { وَ اِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا قَالُوْا … : ’’ اَسَاطِيْرُ ‘‘} یہ {’’اُسْطُوْرَةٌ، اُسْطَارَةٌ، اُسْطِيْرَةٌ‘‘} کی جمع ہے، بے ترتیب کہانیاں۔ (قاموس) ابن جریر نے فرمایا کہ{ ’’سَطْرٌ ‘‘} کی جمع {’’اَسْطُرٌ‘‘} ہے اور اس کی جمع {’’ اَسَاطِيْرُ ‘‘} ہے۔ کفار کہتے تھے کہ یہ قرآن ہے ہی کیا، محض پہلے لوگوں کی بے ترتیب فرضی کہانیاں ہیں۔ یہ انھوں نے محض جہل کی وجہ سے کہا، کیونکہ قرآن ترتیب وار تاریخ اورقصے بیان کرنے کے لیے نہیں، بلکہ نصیحت کے لیے اتارا گیا ہے، اس لیے جس مقام پر جس واقعے کے جس قدر بیان کی ضرورت تھی، بیان فرما دیا ہے۔ اللہ تعالیٰ نے دوسرے مقام پر ان کا یہ اعتراض اور اس کا جواب اس مقام سے کچھ مفصل ذکر فرمایا ہے۔ دیکھیے سورۂ فرقان (۵، ۶)۔ ¤ ➋ {لَوْ نَشَآءُ لَقُلْنَا مِثْلَ هٰذَاۤ:} یہ ان کے عجز کی دلیل ہے، اللہ تعالیٰ نے انھیں پہلے پورے قرآرآن، پھر اس کی دس سورتوں اور پھر صرف ایک سورت کی مثل لانے کے لیے کہا۔ وہ جواب میں کہہ رہے ہیں کہ اگر ہم چاہیں تو اس جیسا ہم بھی کہہ دیں، کوئی ان سے پوچھے اگر واقعی ایسا ہی ہے توتمھیں کس نے اس جیسا کلام لانے سے روکا ہے، تمھاری مقابلے کی غیرت کہاں گئی؟ اس قدر لاجواب ہونے کے باوجود تم کیوں نہیں کہنا چاہتے؟ کچھ تو زبان کھولو، صرف «{ اِنَّاۤ اَعْطَيْنٰكَ الْكَوْثَرَ }» کی تین آیتوں جیسی ہی سورت لے آؤ۔ معلوم ہوا تم صاف جھوٹ کہہ رہے ہو۔ دیکھیے سورۂ بقرہ ( ۲۳، ۲۴)۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) {وَ اِذْ قَالُوا اللّٰهُمَّ اِنْ كَانَ هٰذَا هُوَ الْحَقَّ … :} یہ آیت اس بات کی مثال ہے کہ انسان جب مخالفت اور شدید دشمنی پر اتر آئے تو وہ یہ بھی نہیں سوچتا کہ میں جو کچھ کہہ رہا ہوں یا کر رہا ہوں اس میں خود میرا کس قدر نقصان ہے۔ اب مکہ کے جاہل کافروں کو دیکھیے، اللہ تعالیٰ سے یہ دعا کرنے کے بجائے کہ یا اللہ! اگر یہ دین حق ہے اور تیری طرف سے ہے تو ہمیں اس کے قبول کرنے کی توفیق دے، وہ رسول اللہ صلی اللہ علیہ وسلم کی دشمنی میں کہہ رہے ہیں کہ یا اللہ! اگر یہ دین واقعی تیری طرف سے حق ہے تو ہم پر آسمان سے پتھر برسا یا ہم پر عذاب الیم لے آ۔ اپنے خیال میں انھوں نے یہ بڑی دانش مندی کی بات کی ہو گی، مگر یہ قیامت تک کے لیے ان کی بے عقلی اور جہالت کی دلیل اور ان کے لیے عار کا باعث بن گئی۔ قرآن میں ان کے بار بار عذاب لے آنے کے مطالبے کا کئی مقامات پر ذکر ہے۔ دیکھیے سورۂ عنکبوت (۵۳)، سورۂ ص (۱۶) اور معارج ( ۱ تا ۳) صحیح بخاری میں انس رضی اللہ عنہ سے روایت ہے کہ یہ مطالبہ ابوجہل نے کیا تھا۔ [ بخاری، التفسیر، باب : « و إذ قالوا اللہم إن کان ھذا… » : ۴۶۴۸ ] چونکہ باقی سب نے اسے پسند کیا تھا، اس لیے اسے سب کی طرف منسوب کر دیا گیا۔ التفسیر الوسیط میں سید طنطاوی رحمہ اللہ نے ایک واقعہ لکھا ہے جس کی سند ذکر نہیں کی (واللہ اعلم) مگر واقعہ دلچسپ اور سبق آموز ہے، اگر سنداً ثابت نہ بھی ہو تو بھی بات درست ہے۔ معاویہ رضی اللہ عنہ نے قوم سبا (اصحاب یمن) کے ایک آدمی سے کہا : ’’تیری قوم کس قدر جاہل تھی کہ جنھوں نے ایک عورت کو اپنا بادشاہ بنا لیا۔‘‘ اس نے جواب میں کہا : ’’میری قوم سے آپ کی قوم زیادہ جاہل تھی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی دعوت حق کے جواب میں یہ کہا : «{ اللّٰهُمَّ اِنْ كَانَ هٰذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَاَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَآءِ اَوِ ائْتِنَا بِعَذَابٍ اَلِيْمٍ }» ’’اے اللہ! اگر صرف یہی تیری طرف سے حق ہے تو ہم پر آسمان سے پتھر برسا، یا ہم پر کوئی اور دردناک عذاب لے آ) مگر یہ نہ کہا کہ یا اللہ! اگر یہی حق ہے تو ہمیں اس کے لیے ہدایت عطا فرما۔‘‘"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ {وَ مَا كَانَ اللّٰهُ لِيُعَذِّبَهُمْ وَ اَنْتَ فِيْهِمْ:} یعنی جب تک آپ ان میں موجود ہیں اللہ تعالیٰ ان پر کبھی عذاب بھیجنے والا نہیں، کیونکہ اس کا یہ قاعدہ ہے کہ وہ کسی قوم پر اس وقت تک عذاب نازل نہیں کرتا جب تک ان کا رسول اور ایمان والے ان میں موجود رہتے ہیں۔ چنانچہ نوح، ہود، صالح اور لوط علیھم السلام کے واقعات ہمارے سامنے ہیں۔ قوم لوط کے متعلق فرمایا : «{ فَاَخْرَجْنَا مَنْ كَانَ فِيْهَا مِنَ الْمُؤْمِنِيْنَ }» [ الذاریات : ۳۵ ] ’’ہم نے اس بستی سے جو بھی مومن تھا نکال لیا۔‘‘ اسی طرح نوح علیہ السلام کو حکم ہوا کہ تمام اہل ایمان کو کشتی میں بٹھا لو، پھر عذاب بڑھنا شروع ہوا۔ دیکھیے سورۂ ہود (۴۰) اور سورۂ مومنون (۲۷) ¤ ➋ {وَ مَا كَانَ اللّٰهُ مُعَذِّبَهُمْ … :} یعنی یہ بھی اللہ تعالیٰ کا قاعدہ ہے کہ جب تک کوئی قوم اپنے گناہوں پر نادم ہو کر استغفار کرتی رہتی ہے وہ اسے ہلاک نہیں کرتا۔ یہاں فرمایا : ’’جب کہ وہ بخشش مانگتے ہوں۔‘‘ اس کی دو توجیہیں زیادہ معتبر ہیں، ایک تو یہ کہ نبی صلی اللہ علیہ وسلم کے ہجرت کر جانے کے بعد بھی کچھ مسلمان مجبوراً مکہ میں رہ گئے تھے اور وہ اپنے رب سے استغفار کرتے رہتے تھے، ان کے استغفار کی برکت سے اہل مکہ پر عذاب نہیں آیا، جیسا کہ دوسری جگہ فرمایا : «{ لَوْ تَزَيَّلُوْا لَعَذَّبْنَا الَّذِيْنَ كَفَرُوْا مِنْهُمْ عَذَابًا اَلِيْمًا }» [ الفتح : ۲۵ ] ’’اگر وہ (مومن اور کافر) الگ الگ ہو گئے ہوتے تو ہم ضرور ان لوگوں کو جنھوں نے ان میں سے کفر کیا تھا، عذاب دیتے دردناک عذاب۔‘‘ دوسری توجیہ یہ ہے کہ ان کے اندر اللہ تعالیٰ کے علم میں ایسے لوگ موجود تھے جو آئندہ چل کر مسلمان ہوں گے اور اللہ تعالیٰ سے استغفار کریں گے، اس لیے ان پر ایسا عذاب نہیں آ سکتا تھا جو سب کو سرے سے فنا کر ڈالے۔ اس توجیہہ کی طرف اشارہ بھی سورۂ فتح (۲۵) میں موجود ہے : «{ لِيُدْخِلَ اللّٰهُ فِيْ رَحْمَتِهٖ مَنْ يَّشَآءُ }» ’’تاکہ اللہ تعالیٰ اپنی رحمت میں جسے چاہے داخل کرلے۔‘‘"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) {وَ مَا لَهُمْ اَلَّا يُعَذِّبَهُمُ اللّٰهُ … :} اس آیت میں ان کے عذاب کا مستحق ہونے کی چند وجہیں بیان کی ہیں، ایک تویہ کہ انھوں نے مسلمانوں کے مسجد حرام میں داخلے پر پابندی لگا رکھی ہے۔ دوسری یہ کہ وہ زبردستی مسجد حرام کے مالک اور متولی بنے بیٹھے ہیں، حالانکہ کعبہ کی تولیت صرف موحدین متقین کا حق ہے، مشرکین کا نہیں۔ دیکھیے سورهٔ توبہ (۱۷، ۱۸) تیسری یہ کہ وہ اللہ تعالیٰ کی عبادت اس کی شان کے لائق اور اس کے بتائے ہوئے طریقے سے کرنے کے بجائے تالیاں پیٹ کر اور سیٹیاں بجا کر قوالی کے ذریعے سے کرتے ہیں۔ اس لیے ان پر عذاب کیوں نہ آئے، عذاب آئے گا اور ضرور آئے گا۔ پچھلی آیت میں جس عذاب کی نفی کی تھی وہ تھا جس سے قوموں کا نام و نشان مٹ جاتا تھا، یعنی عذاب استیصال۔ اس آیت میں اس عذاب کا ذکر ہے جو قحط، خوف اور جنگ کی صورت میں عبرت کے لیے ان پر مسلط ہوا، دیکھیے سورۂ نحل (۱۱۲، ۱۱۳)، سورۂ سجدہ (۲۱) اور سورۂ دخان (۱۰ تا ۱۶) یہ عذاب جنگ بدر، قحط، بھوک، خوف اور آخر میں فتح مکہ کی صورت میں اہل مکہ پر مسلط ہوا۔ جس سے ان کے بڑے بڑے سردار مارے گئے، یا قید ہوئے اور جو مرنے سے بچ گئے وہ آخر کار اسلام میں داخل ہو گئے۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ {وَ مَا كَانَ صَلَاتُهُمْ عِنْدَ الْبَيْتِ اِلَّا مُكَآءً وَّ تَصْدِيَةً:’’ مُكَآءً ‘‘ ’’مَكَا يَمْكُوْ مَكْوًا وَ مُكَاءً‘‘} سیٹی بجانا اور {’’ تَصْدِيَةً ‘‘ ’’صَدّٰي يُصَدِّيْ تَصْدِيَةً‘‘} (تفعیل) تالیاں بجانا۔ یعنی وہ لوگ کعبہ کے پاس عین حرم میں تالیاں پیٹتے اور سیٹیاں بجاتے اور اسے اپنی نماز، اللہ کی عبادت اور اس کے قرب کا ذریعہ قرار دیتے۔ افسوس کہ اب مسلمانوں نے بھی نمازیں اور قرآن چھوڑ کر عاشقانہ اشعار، سیٹیوں اور تالیوں کے مجموعے قوالی کو طریقت و معرفت کا نام دے کر روح کی غذا قرار دے رکھا ہے۔ بے شمار لوگ اسے تصوف کا اہم رکن قرار دے کر صرف سیٹیوں اور تالیوں ہی پر اکتفا نہیں کرتے بلکہ باقاعدہ مرشد کے اردگرد طواف اور رقص کرکے اسے اپنی نماز سمجھتے ہیں اور برملا کہتے ہیں ¤ نماز عابداں سجدہ سجود است ¤ نماز عاشقاں کلی وجود است ¤ ’’عابدوں کی نماز سجدہ سجود ہے مگر عاشقوں کی نماز (معشوق کا) پورا وجود ہی ہے۔‘‘ ¤ ایک صوفی نے تو صاف ہی اپنے مرشد کو قبلہ بھی قرار دے دیا ہے، چنانچہ وہ کہتا ہے ¤ ہر قوم راست را ہے، دینے و قبلہ گاہے ¤ من قبلہ راست کردم برسمت کج کلا ہے ¤ ’’ہر قوم کا ایک راستہ، ایک دین اور ایک قبلہ ہوتا ہے، مگر میں نے تو اپنا قبلہ ایک ٹیڑھی ٹوپی والے کی طرف سیدھا کر لیا ہے۔‘‘ اگر ان میں سے کوئی نماز پڑھتا بھی ہے تو ایسے طریقے سے جس طریقے سے پڑھنے والے کو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ دوبارہ نماز پڑھ، تو نے نماز پڑھی ہی نہیں۔ اللہ کی قسم! جب تک مسلمان تصور شیخ کا شرک اور صوفیوں کی عبادت کے یہ خود ساختہ طریقے اور موسیقی و رقص جیسی دل میں نفاق پیدا کرنے والی خرافات ترک نہیں کرتے اور رسول اللہ صلی اللہ علیہ وسلم کے بتائے ہوئے طریقے کے مطابق ارکان اسلام و ایمان کی پابندی، خصوصاً جہاد نہیں کرتے کبھی دنیا میں سر نہیں اٹھا سکتے، ہمیشہ ذلت و خواری ہی ان پر مسلط رہے گی۔ ¤ ➋ {فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُوْنَ:} کفر و شرک کے ارتکاب، سیٹیوں، تالیوں اور رقص کو نماز سمجھنے کا نتیجہ دنیا اور آخرت کے عذاب کی صورت میں چکھو۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {اِنَّ الَّذِيْنَ كَفَرُوْا يُنْفِقُوْنَ اَمْوَالَهُمْ … :} یہاں {’’ عَنْ سَبِيْلِ اللّٰهِ ‘‘} سے مراد اسلام ہے، یعنی کفار خصوصاً اہل مکہ کہ جن کا یہاں ذکر ہو رہا ہے، وہ اپنے اموال لوگوں کو اسلام سے روکنے کے لیے ہر طرح سے خرچ کرتے ہیں، مال کا لالچ دے کر بھی اور جنگ کی تیاری کے لیے خوراک، سواریاں اور اسلحہ و افراد مہیا کرکے بھی۔ انھیں اسلام سے اس قدر دشمنی اور عناد ہے کہ اس سے روکنے کے لیے وہ اپنی محبوب ترین چیز مال خرچ کرنے سے بھی دریغ نہیں کرتے۔ مگر اللہ تعالیٰ نے پہلے ہی خبردار کر دیا کہ آئندہ جب بھی یہ مسلمانوں کے خلاف کوئی کار روائی کریں گے انھیں اسی طرح ناکامی اور حسرت کا سامنا کرنا پڑے گا جس طرح اب بدر میں ان کا حشر ہوا ہے۔ چنانچہ اس کے بعد جنگ احد اور خندق میں بھی انھیں ناکامی کے ساتھ لوٹنا پڑا، نہ مدینہ پر قبضہ کر سکے، نہ مال غنیمت حاصل کرسکے اور نہ ہی کسی کو لونڈی و غلام بنا سکے اور آخرت میں ان کافروں کا انجام یہ ہے کہ وہ جہنم میں دھکیل کر اکٹھے کیے جائیں گے۔ بعد میں بھی جب تک مسلمان اللہ کے احکام پر کاربند رہے اور انھوں نے جہاد کی تیاری میں کوتاہی نہ کی، ان کے خلاف جنگ کے لیے خرچ کیے ہوئے کفار کے اموال ہمیشہ ان کے لیے باعث حسرت ہی بنے اور وہ ہمیشہ مغلوب ہی ہوئے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) { لِيَمِيْزَ اللّٰهُ الْخَبِيْثَ مِنَ الطَّيِّبِ …: } ناپاک کو پاک سے جدا کرنے سے مراد یا تو قیامت کے دن کفار اور مسلمانوں کو جدا جدا کرکے خبیث کفار کو تہ بہ تہ جمع کرکے جہنم میں پھینکنا ہے، یا دنیا ہی میں جہاد فی سبیل اللہ کے ذریعے سے اہل ایمان اور اہل کفر کو جدا جدا کرنے کے بعد خبیث لوگوں یعنی کفار کو تہ تیغ کرکے جہنم میں پھینکنا ہے اور یہی لوگ ہیں جو اصل خسارا اٹھانے والے ہیں۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ {قُلْ لِّلَّذِيْنَ كَفَرُوْۤا اِنْ يَّنْتَهُوْا: ’’ نَهٰي يَنْهَي‘‘} منع کرنا اور {’’ اِنْتَهَي يَنْتَهِيْ‘‘} باز آ جانا۔ اس آیت میں اللہ تعالیٰ نے بتایا کہ عذاب کی ان تمام وعیدوں کے باوجود امید کا دروازہ کھلا ہے۔ چنانچہ نبی رحمت صلی اللہ علیہ وسلم کو حکم ہوا کہ آپ ان منکروں سے کہہ دیں کہ اب بھی اگر وہ عناد اور کفر سے باز آ جائیں، اسلام میں داخل ہو جائیں اور ایک اللہ کی عبادت اور نبی صلی اللہ علیہ وسلم کی اطاعت اختیار کر لیں تو ان کے پہلے قصور معاف کر دیے جائیں گے۔ عمرو بن العاص رضی اللہ عنہ فرماتے ہیں کہ جب اللہ تعالیٰ نے میرے دل کو اسلام کی طرف مائل کیا تو میں نے نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر عرض کیا : ’’اپنا دایاں ہاتھ پھیلائیے کہ میں بیعت کروں۔‘‘ آپ نے اپنا دایاں ہاتھ پھیلایا تو میں نے اپنا ہاتھ پیچھے ہٹا لیا، آپ نے فرمایا : ’’عمرو! تمھیں کیا ہوا؟‘‘ میں نے عرض کیا : ’’میں ایک شرط کرنا چاہتا ہوں؟‘‘ فرمایا : ’’کس چیز کی شرط کرنا چاہتے ہو؟‘‘ میں نے کہا : ’’یہ کہ مجھے بخش دیا جائے۔‘‘ آپ نے فرمایا : ’’کیا تمھیں معلوم نہیں کہ اسلام اپنے سے پہلے گناہ گرا دیتا ہے اور ہجرت اپنے سے پہلے گناہ گرا دیتی ہے اور حج اپنے سے پہلے گناہ گرا دیتا ہے۔‘‘ [ مسلم، الإیمان، باب کون الإیمان یہدم ما قبلہ : ۱۲۱ ] ¤ باز آ جانے میں یہ بھی شامل ہے کہ اسلام لا کر اپنی حالت بھی بدلیں۔ ابن مسعود رضی اللہ عنہ فرماتے ہیں کہ ایک آدمی نے کہا : ’’یارسول اللہ! کیا ہم نے جو کچھ جاہلیت میں کیا اس پر ہمارا مؤاخذہ ہو گا؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’جو اسلام میں اچھے عمل کرے گا تو اس سے جاہلیت میں کیے ہوئے اعمال کا مؤاخذہ نہیں ہو گا اور جس نے اسلام میں برے عمل کیے وہ پہلے اور پچھلے اعمال کے ساتھ پکڑا جائے گا۔‘‘ [ بخاری، استتابۃ المرتدین والمعاندین و قتالہم ، باب إثم من أشرک… : ۶۹۲۱ ] ¤ ➋ {وَ اِنْ يَّعُوْدُوْا فَقَدْ مَضَتْ سُنَّتُ الْاَوَّلِيْنَ:} یعنی اگر پھر اسلام کو اکھیڑنے اور مسلمانوں کی طاقت ختم کرنے کا منصوبہ بنائیں تو جس طرح پہلے لوگ تباہ و برباد ہوئے، جنھوں نے انبیاء کو ستایا اور ان سے جنگ کی اسی طرح یہ بھی تباہ و برباد ہوں گے اور اس سے پہلے جنگ بدر میں ان کا جو حشر ہوا اب بھی وہی ہو گا۔ (ابن کثیر)"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ {وَ قَاتِلُوْهُمْ حَتّٰى لَا تَكُوْنَ فِتْنَةٌ: ’’ فِتْنَةٌ ‘‘} کے لفظی معنی آگ میں تپانے اور آزمانے کے ہیں۔ اس کا مطلب یہ ہے کہ اس وقت تک کفار سے لڑتے رہو جب تک کسی شخص کے اسلام لانے پر مشرکوں کی اسے ستانے اور آزمائش میں ڈالنے کی قوت ختم نہیں ہو جاتی اور تمام دنیا سے شرک کا غلبہ ختم نہیں ہوتا۔ اس لیے صحیح احادیث میں فتنہ کا معنی شرک بھی آیا ہے۔ مگر اس سے مراد زبردستی مسلمان بنانا اور مشرکین و کفار کو ختم کرنا نہیں، فرمایا : «{ لَاۤ اِكْرَاهَ فِي الدِّيْنِ }» [ البقرۃ : ۲۵۶ ] ’’دین میں کوئی زبردستی نہیں۔‘‘ کیونکہ پھر کفار کے جزیہ دینے کی نوبت ہی نہیں آ سکتی، بلکہ اس وقت تک لڑتے رہناہے جب تک ایمان لانے والوں کے راستے میں کفار کے رکاوٹ بننے کی قوت ختم نہیں ہوتی، پوری دنیا پر اسلام کا غلبہ نہیں ہوتا اور کفر پر اصرار کی صورت میں جزیہ دے کر اسلام کی برتری تسلیم نہیں کرتے۔ مزید تفصیل کے لیے دیکھیے سورۂ بقرہ (۱۹۱، ۱۹۳، ۲۱۷) اور توبہ (۲۹)۔ ¤ ➋ { وَ يَكُوْنَ الدِّيْنُ كُلُّهٗ لِلّٰهِ:} یعنی تمام دینوں پر اسلام کا غلبہ ہو جائے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھے حکم دیا گیا ہے کہ میں لوگوں سے جنگ کرتا رہوں، یہاں تک کہ وہ لا الٰہ الا اللہ کی شہادت اور محمد رسول اللہ ( صلی اللہ علیہ وسلم ) کی شہادت دیں اور نماز قائم کریں اور زکوٰۃ دیں، پھر جب وہ یہ کچھ کر لیں تو انھوں نے اپنے خون اور اموال مجھ سے محفوظ کر لیے، مگر اسلام کے حق کے ساتھ اور ان کا حساب اللہ کے ذمے ہے۔‘‘ [ بخاری، الإیمان، باب فإن تابوا و أقاموا… : ۲۵، عن عبد اللہ بن عمرو رضی اللہ عنھما ۔ مسلم : ۲۲ ] ¤ ➌ { فَاِنِ انْتَهَوْا فَاِنَّ اللّٰهَ بِمَا يَعْمَلُوْنَ بَصِيْرٌ:} یعنی اسلام لے آئیں تو تمھارے لیے ان کا ظاہر کافی ہے۔ اگر وہ دل سے مسلمان نہیں ہوئے یا چھپ کر کوئی غلط کام کرتے ہیں تو اللہ تعالیٰ ان کے ظاہری اور باطنی اعمال کو خوب دیکھنے والا ہے، وہ خود نمٹ لے گا۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ {وَ اِنْ تَوَلَّوْا فَاعْلَمُوْۤا اَنَّ اللّٰهَ مَوْلٰىكُمْ:} یعنی اگر وہ مسلمانوں کو ستانا اور ان سے لڑنا ترک نہ کریں تو یقینا اللہ دشمنوں کے خلاف تمھارا دوست اور یارو مددگار ہے۔ ¤ ➋ { نِعْمَ الْمَوْلٰى وَ نِعْمَ النَّصِيْرُ:}  اور جس کا دوست اور یارو مددگار وہ ہو تو وہ بہت اچھا دوست اور بہت اچھا مددگار ہے، پھر اس پر کون غالب آ سکتا ہے؟ دیکھیے سورۂ محمد (۱۰، ۱۱)۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ {وَ اعْلَمُوْۤا اَنَّمَا غَنِمْتُمْ:} غنیمت وہ مال ہے جو کفار سے جنگ کی صورت میں حاصل ہو، اگر ان سے جنگ کے بغیر کوئی مال حاصل ہو تو اسے فے کہتے ہیں، اس کا ذکر سورۂ حشر (۶ تا ۹) میں ہے، مثلاً کفار خود ہی ہتھیار پھینک دیں، یا صلح کی صورت میں ان سے جزیہ وصول ہو، یا زمین کا خراج وغیرہ ہو۔ غنیمت اور فے بعض اوقات ایک دوسرے کے معنی میں بھی آ جاتے ہیں۔ {’’ غَنَمٌ‘‘} کا معنی بھیڑ بکریاں ہے، جو عرب میں اکثر جنگ کے بعد غالب فریق کے قبضے میں آتی تھیں۔ بعد میں قبضے میں آنے والی ہر چیز کو غنیمت کہنے لگے۔ ¤ ➋ سورت کے شروع میں ’’انفال‘‘ کو اللہ اور اس کے رسول کی ملکیت قرار دیا گیا تھا، اب غنیمت کی تقسیم کا طریقہ بیان ہوتا ہے۔ ایک مناسبت یہ ہے کہ اس سے پہلے «وَ قَاتِلُوْهُمْ حَتّٰى لَا تَكُوْنَ فِتْنَةٌ» میں لڑائی کا حکم ہے جس کے نتیجے میں عموماً مالِ غنیمت حاصل ہوتا ہے، اس لیے اب اس کے خرچ کی جگہیں بیان فرمائیں۔ ¤ ➌ { مِنْ شَيْءٍ:} اس کا مطلب یہ ہے کہ کوئی بھی چیز بڑی سے بڑی ہو یا چھوٹی سے چھوٹی، کوئی شخص اپنے پاس نہیں رکھ سکتا، رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق سوئی دھاگا حتیٰ کہ اونٹ کی اون کی گچھی تک جمع کروانا ہو گی، اگر رکھے گا تو یہ غلول (خیانت) شمار ہو گا، جس کی وعید سورۂ آل عمران (۱۶۱) میں ہے۔ ¤ ➍ { فَاَنَّ لِلّٰهِ خُمُسَهٗ وَ لِلرَّسُوْلِ …:} مطلب یہ ہے کہ کل غنیمت کے پانچ حصے کیے جائیں گے، چار حصے ان لوگوں کو ملیں گے جنھوں نے جنگ میں شرکت کی، ان میں بھی پیادے کو ایک حصہ اور سوار کو تین حصے ملیں گے، ایک اس کا اپنا اور دو حصے گھوڑے کے اور خمس ( پانچواں حصہ) ان اغراض کے لیے الگ کر لیا جائے گا جن کا آیت میں ذکر کیا گیا ہے۔ یہ بھی امت محمد ( صلی اللہ علیہ وسلم ) پر احسان ہے، ورنہ پہلی امتوں میں تو اموال غنیمت حلال ہی نہ تھے بلکہ انھیں جلا دیا جاتا تھا۔ یہاں اللہ تعالیٰ کا نام بطور برکت و تمہید آیا ہے، کیونکہ سب مال اللہ ہی کا ہے۔ اصل میں خمس کے مصرف پانچ ہیں، ایک حصہ رسول اللہ صلی اللہ علیہ وسلم اپنی اور اپنی بیویوں کی ضروریات کے بعد عام مسلمانوں کی مصلحت میں خرچ کرتے تھے، مثلاً مجاہدین کے لیے اسلحہ اور سواریاں وغیرہ۔ آپ کے بعد خلیفۂ وقت جہاں مناسب سمجھے خرچ کرنے میں آپ کا جانشین ہو گا۔ خمس کے علاوہ رسول اللہ صلی اللہ علیہ وسلم کو سارے مال غنیمت میں سے کوئی ایک چیز مثلاً کوئی ہتھیار یا گھوڑا یا لونڈی اپنے لیے رکھنے کا اختیار تھا، اسے {’’صَفِيٌّ‘‘} کہتے ہیں۔ {’’ وَ لِذِي الْقُرْبٰى ‘‘} سے مراد رسول اللہ صلی اللہ علیہ وسلم کے قرابت دار ہیں، آپ کے جد اعلیٰ عبد مناف کی اولاد چار قبیلے تھے، بنو ہاشم، بنو مطلب، بنو عبد شمس اور بنو نوفل۔ آپ صلی اللہ علیہ وسلم بنو ہاشم میں سے تھے، مگر آپ نے {’’ ذَوِي الْقُرْبٰي‘‘} میں سے پہلے دو قبیلوں کو خمس میں سے حصہ دیا، بعد والے دو کو نہیں دیا اور ان کے پوچھنے پر بتایا کہ بنو مطلب اسلام لانے سے پہلے بھی بنو ہاشم کے ساتھی رہے ہیں، جبکہ آخری دونوں قبیلے اس وقت مخالفت میں سر گرم رہتے تھے۔ {’’ الْيَتٰمٰى ‘‘} وہ نا بالغ بچے جن کے باپ فوت ہو چکے ہوں۔ {’’ الْمَسٰكِيْنِ ‘‘} وہ ضرورت مند جن کی آمدنی ضرورت سے کم ہو۔ {’’ ابْنِ السَّبِيْلِ ‘‘} راہ گیر مسافر۔ اس خمس کا پانچ حصوں میں تقسیم کا طریقہ کیا ہو گا؟ کیا سب کو برابر دیا جائے گا، یا حسب ضرورت خرچ کیا جائے گا؟ امام مالک اور اکثر سلف رحمہم اللہ کا خیال ہے کہ امام ( خلیفۂ اسلام) کو اختیار ہے کہ مسلمانوں کی اجتماعی مصلحت، مثلاً جہاد کی تیاری، اسلحہ کی خریداری وغیرہ کو پیش نظر رکھتے ہوئے جس طرح چاہے اسے تقسیم یا خرچ کرے۔ اسی پر خلفائے اربعہ رضی اللہ عنہم کا عمل رہا ہے۔ (قرطبی) نسائی کی حدیث سے بھی یہی معلوم ہوتا ہے، عبد اللہ بن عمرو رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک اونٹ کی کوہان سے دو انگلیوں میں تھوڑی سی پشم پکڑی، پھر فرمایا : ’’میرے لیے فے (غنیمت) میں سے کچھ نہیں، حتیٰ کہ یہ ( پشم) بھی نہیں، مگر پانچواں حصہ اور وہ پانچواں حصہ بھی تمھی میں لوٹایا جائے گا۔‘‘ [ نسائی،أول کتاب قسم الفیٔ : ۴۱۴۴، و صححہ الألبانی ] پھر ضروری نہیں کہ پانچ حصوں میں برابر تقسیم کرے، جہاں زیادہ خرچ کرنے کی ضرورت ہو زیادہ کر سکتا ہے۔ حافظ ابن تیمیہ اور ابن کثیر رحمھما اللہ نے اس کو سب سے صحیح قول قرار دیا ہے۔ ¤ ➎ {وَ مَاۤ اَنْزَلْنَا عَلٰى عَبْدِنَا:} یعنی جو فرشتے، آیات و معجزات اور نصرتِ الٰہی بدر میں اللہ تعالیٰ نے اتارے۔ {’’ عَبْدِنَا ‘‘} میں رسول اللہ صلی اللہ علیہ وسلم کو اپنا بندہ کہہ کر خاص اعزاز بخشا، جیسا کہ «سُبْحٰنَ الَّذِيْۤ اَسْرٰى بِعَبْدِهٖ» [ بنی إسرائیل : ۱ ] میں اور «وَ اِنْ كُنْتُمْ فِيْ رَيْبٍ مِّمَّا نَزَّلْنَا عَلٰى عَبْدِنَا» [ البقرۃ : ۲۳ ] میں فرمایا۔ رسول اللہ صلی اللہ علیہ وسلم کو اپنا یہ اعزاز بہت عزیز تھا، آپ کی مشہور دعا ہے : [ اَللّٰهُمَّ إِنِّيْ عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ أَممَتِكَ نَاصِيَتِيْ بِيَدِكَ ] [ أحمد : 391/1، ح : ۳۷۱۱، عن ابن مسعود رضی اللہ عنہ ] ¤ ➏ {يَوْمَ الْفُرْقَانِ: ’’ الْفُرْقَانِ ‘‘} واضح فیصلہ، یعنی بدر کے دن جس میں حق اور باطل کا فیصلہ ہوا، حق کو فتح ہوئی اور باطل مغلوب ہوا۔ (ابن کثیر) حق و باطل کے درمیان یہ پہلی باقاعدہ جنگ تھی جو ۱۷ رمضان بروز جمعہ ( بروایت ابن جریر عن علی) واقع ہوئی۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ {اِذْ اَنْتُمْ بِالْعُدْوَةِ الدُّنْيَا … :} جنگ کا محل وقوع ذکر کرنے سے مقصود یہ ہے کہ تم جس ارادے سے نکلے تھے کہ ہمیں وہ قافلہ مل جائے گا جو نہایت قیمتی ہے اور جس کے محافظ صرف تیس یا چالیس شخص ہیں، اس کے برعکس اللہ تعالیٰ نے تمھیں ایسی جگہ لا کھڑا کیا جہاں لڑائی کے بغیر چارہ نہ تھا۔ {’’ عُدْوَةٌ ‘‘} کنارا۔ {’’ الدُّنْيَا ‘‘ ’’ دُنُوٌّ ‘‘ } ( قریب ہونا) میں سے{’’ أَدْنٰي‘‘} کی مؤنث ہے، قریب ترین، یعنی تم وادی بدر کے اس سرے پر تھے جو مدینہ کے قریب ترین ہے۔ {’’ الْقُصْوٰى ‘‘ ’’ أَقْصٰي‘‘} کی مؤنث ہے دور ترین، یعنی قریش اسی وادی بدر کے مدینہ سے دور والے کنارے پر تھے۔ {’’ وَ الرَّكْبُ اَسْفَلَ مِنْكُمْ ‘‘} یعنی جس قافلے کی خاطر تم نکلے تھے وہ تم سے نیچے ساحل سمندر پر تھا، جہاں تمھارا پہنچنا اس وقت ممکن نہ تھا اور تم اور قریش کسی پیشگی ارادے کے بغیر ایک ہی وادی کے کناروں پر آ جمع ہوئے تھے، نہ انھیں تمھارا علم تھا نہ تمھیں ان کا اور اللہ تعالیٰ یہ چاہتا تھا کہ حق و باطل کا ٹکراؤ کروا کر حق واضح کر دے۔ اگر تم اور قریش وقت اور جگہ طے کر کے لڑائی کے لیے نکلتے تو یقینا طے کردہ وعدے پر پہنچنے میں کمی بیشی ہو جاتی، یا تم اپنی تعداد اور تیاری کی کمی کی وجہ سے نہ پہنچتے، یا کفار رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی طرف سے عطا کردہ رعب سے خائف ہو کر نہ پہنچتے، مگر اللہ تعالیٰ کا تمھیں عین ایک ہی وادی میں لا جمع کرنا اس لیے تھا کہ اللہ تعالیٰ جو کچھ کرنا چاہتا تھا وہ پورا کر دے، یعنی مسلمانوں کو فتح اور کفار کو شکست ہو۔ ¤ ➋ {لِيَهْلِكَ مَنْ هَلَكَ عَنْۢ بَيِّنَةٍ …:} یعنی اس لیے کہ کفار کی اتنی کثرت اور تیاری اور مسلمانوں کی قلت اور بے سروسامانی کے باوجود مسلمانوں کی فتح کے ساتھ کفار پر حجت پوری ہو جائے اور اسلام کی حقانیت واضح ہو جائے، اس کے بعد اگر کوئی کافر رہے تو دلیل دیکھ کر کافر رہے اور ہلاکت میں پڑے اور جو کوئی مسلمان ہو تو وہ بھی دلیل دیکھ کر مسلمان ہو اور ہمیشہ کی زندگی حاصل کرے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ {اِذْ يُرِيْكَهُمُ اللّٰهُ فِيْ مَنَامِكَ قَلِيْلًا:} نبی صلی اللہ علیہ وسلم نے خواب میں دیکھا کہ کافروں کی تعداد زیادہ نہیں ہے، اسی کی خبر آپ صلی اللہ علیہ وسلم نے صحابہ کو دی، جس کا فائدہ یہ ہوا کہ مسلمانوں میں ہمت اور ثابت قدمی پیدا ہو گئی۔ یہاں ایک سوال پیدا ہوتا ہے کہ نبی کا خواب تو وحی ہوتا ہے، پھر آپ کو وہ کم کیوں نظر آئے؟ جواب اس کا یہ ہے کہ آپ کا خواب اس لحاظ سے سچا تھا کہ بعد میں ان کافروں میں سے بہت سے لوگ مسلمان ہو گئے، دوسرے یہ کہ مسلمانوں کے ساتھ فرشتے بھی شامل تھے، اس لیے ان کے مقابلے میں کافروں کی تعداد کم ہی تھی یا معنوی طور پر یعنی اخلاقی اور روحانی طور پر ان میں قوت و طاقت نہ تھی، بظاہر وہ بہت تھے لیکن میدان کار زار میں ثبات و استقلال میں کمزور تھے، اس لیے گویا وہ تعداد میں بھی کم تھے۔ ¤ ➋ {وَ لَتَنَازَعْتُمْ فِي الْاَمْرِ:} یعنی کوئی کہتا لڑو اور کوئی کہتا نہ لڑو، وہ بہت ہیں اور ہم کم۔ ¤ ➌ { وَ لٰكِنَّ اللّٰهَ سَلَّمَ:} یعنی نہ ہمت ہار جانے کا موقع دیا اور نہ آپس میں لڑنے جھگڑنے کا۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ {وَ اِذْ يُرِيْكُمُوْهُمْ اِذِ الْتَقَيْتُمْ فِيْۤ اَعْيُنِكُمْ قَلِيْلًا …:} پہلا واقعہ رسول اللہ صلی اللہ علیہ وسلم کے خواب کا تھا، یہ عین میدان جنگ کا واقعہ ہے، جب جنگ ہونے والی تھی مگر ابھی شروع نہیں ہوئی تھی، کافر مسلمانوں کو تھوڑے نظر آتے تھے، حتیٰ کہ بعض نے دوسرے سے پوچھا، تمھارے خیال میں یہ کتنے ہوں گے؟ اس نے کہا، ستر (۷۰) کے قریب ہوں گے۔ اس سے رسول اللہ صلی اللہ علیہ وسلم کے خواب کی بھی تائید ہو رہی تھی اور یہ بھی کہ مسلمانوں کی ہمت بڑھ جائے اور کفار کی نظر میں مسلمانوں کو کم دکھانے کی حکمت یہ تھی کہ وہ زیادہ تیاری کی ضرورت نہ سمجھیں اور لڑائی سے گریز نہ کریں، بلکہ دونوں فریق ایک دوسرے کو کم سمجھتے ہوئے لڑائی پر آمادہ ہو جائیں۔ یہ شروع کی بات ہے، مگر جب جنگ شروع ہو گئی تو کافروں کو مسلمانوں کی تعداد زیادہ نظر آنے لگی، جیسا کہ آل عمران میں ہے : «وَ اُخْرٰى كَافِرَةٌ يَّرَوْنَهُمْ مِّثْلَيْهِمْ رَاْيَ الْعَيْنِ» [ آل عمران : ۱۳ ] ’’ اور دوسری جماعت کافر تھی جو ان (مسلمانوں) کو آنکھوں سے دیکھتے ہوئے اپنے سے دو گنا دیکھ رہے تھے۔‘‘ اس کا فائدہ یہ ہوا کہ جنگ شروع ہو گئی، پھر شروع ہونے پر کافروں کے حوصلے پست ہو گئے اور وہ جلد ہی شکست کھا کر پیچھے کی طرف بھاگنے لگے اور مسلمانوں کے حوصلے بدستور بڑھتے گئے۔ ¤ ➋ { لِيَقْضِيَ اللّٰهُ اَمْرًا كَانَ مَفْعُوْلًا:} یعنی وہی کہ اسلام کی فتح اور کفر کی شکست ہو اور رسول اللہ صلی اللہ علیہ وسلم کی سچائی پر معجزانہ دلیل قائم ہو جائے۔ ¤ ➌ { وَ اِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ:} یعنی وہی جو چاہتا ہے فیصلہ کرتا ہے اور پھر جب اصل اختیار ہر چیز میں اللہ تعالیٰ کو حاصل ہے تو مسلمان کو چاہیے کہ اسی کو اپنا مقصود بنائے۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 46،45 ) {اِذَا لَقِيْتُمْ فِئَةً فَاثْبُتُوْا … : ’’ لَقِيْتُمْ ‘‘ ’’ لِقَاءٌ‘‘} سے ہے، یعنی ملنا اور آمنے سامنے ہونا، اکثر لڑائی کی ملاقات کے لیے استعمال ہوتا ہے، یہاں بھی یہی مراد ہے۔ {’’ فِئَةً ‘‘} جماعت، گروہ۔ یہ{’’ فَاءَ يَفِيْئُ فَيْئًا ‘‘} (لوٹنا) سے مشتق ہے، کیونکہ ایک جماعت کے لوگ مدد کے لیے ایک دوسرے کی طرف لوٹ کر آتے ہیں۔ (راغب) قرآن مجید میں زیادہ تر یہ لفظ لڑنے والی جماعت کے لیے استعمال ہوا ہے، خواہ وہ کفار کی جماعت ہو یا مسلمانوں کی اور خواہ مستقل جماعت ہو یا کمک کے لیے آنے والی، مثلاً اللہ تعالیٰ نے فرمایا : «كَمْ مِّنْ فِئَةٍ قَلِيْلَةٍ غَلَبَتْ فِئَةً كَثِيْرَةًۢ بِاِذْنِ اللّٰهِ » [ البقرۃ : ۲۴۹ ] ’’کتنی ہی تھوڑی جماعتیں زیادہ جماعتوں پر اللہ کے حکم سے غالب آ گئیں۔‘‘ اور دیکھیے سورۂ آل عمران (۱۳) اور سورۂ کہف (۴۳) اس آیت میں دشمن سے مقابلے کے وقت لڑائی کے آداب اور دلیری و شجاعت حاصل کرنے کے طریقے سکھائے۔ ان میں سے پہلی چیز ثابت قدمی اور ڈٹے رہنا ہے، کیونکہ اس کے بغیر میدانِ جنگ میں ٹھہرنا ممکن ہی نہیں۔ ثابت قدمی سے مراد انتہائی بے جگری سے لڑنا ہے، لہٰذا یہ آیت «اِلَّا مُتَحَرِّفًا لِّقِتَالٍ اَوْ مُتَحَيِّزًا اِلٰى فِئَةٍ» [ الأنفال : ۱۶ ] کے خلاف نہیں، کیونکہ جنگی چال کے طور پر ایک طرف ہونا یا پیچھے ہٹنا فرار نہیں بلکہ ثابت قدمی ہی کی ایک صورت ہے۔ دوسری چیز اللہ کو کثرت سے یاد کرنا ہے، کیونکہ فتح و نصرت کا انحصار ظاہری اسباب پر نہیں بلکہ دل کی استقامت، اللہ کی یاد اور اس کا حکم بجا لانے پر ہے، اسی لیے طالوت کے ساتھیوں نے دشمن سے مڈ بھیڑ کے وقت یہ دعا کی تھی : «رَبَّنَاۤ اَفْرِغْ عَلَيْنَا صَبْرًا وَّ ثَبِّتْ اَقْدَامَنَا وَ انْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِيْنَ» [ البقرۃ : ۲۵۰ ] ’’اے ہمارے رب ! ہم پر صبر انڈیل دے اور ہمارے قدم ثابت رکھ اور ان کافر لوگوں کے خلاف ہماری مدد فرما۔‘‘ نبی کریم صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنہم نے بدر اور دوسرے مقامات پر نہایت عجز و زاری سے اللہ کو یاد کیا اور اس سے مدد مانگی۔ مسلمان تھوڑے ہوں تو اللہ کی مدد طلب کریں اور زیادہ ہوں تو بھی اپنی طاقت اور کثرت کے بجائے صرف اللہ تعالیٰ ہی پر بھروسا رکھیں اور اس کی یاد سے غافل نہ ہوں۔ تیسری ہدایت اللہ اور اس کے رسول کی فرماں برداری ہے جو ہر حال میں لازم ہے، مگر میدان جنگ میں اس کی اہمیت کئی گنا بڑھ جاتی ہے، کیونکہ وہاں تھوڑی سی نافرمانی بھی بعض اوقات نا قابل تلافی نقصان کا باعث بن جاتی ہے، جیسا کہ جنگ اُحد میں ہوا۔ اس میں امیر کی اطاعت بھی شامل ہے کہ وہ بھی اللہ اور اس کے رسول کا حکم ہے۔ چوتھی ہدایت یہ کہ آپس میں جھگڑا اور اختلاف نہ کرو، ورنہ فتح کے بعد شکست نظر آنے لگے گی، جس سے تمھارے دلوں میں بزدلی پیدا ہو جائے گی اور تم ہمت ہار بیٹھو گے اور تمھاری ہوا جاتی رہے گی، یعنی تمھارے درمیان پھوٹ دیکھ کر دشمنوں پر سے رعب اٹھ جائے گا اور وہ تم پر غلبہ پانے کے لیے اپنے اندر جرأت محسوس کرنے لگیں گے۔ پانچویں ہدایت یہ کہ صبر کرو، کیونکہ اللہ تعالیٰ صبر کرنے والوں کے ساتھ ہے، اگر صبر کا دامن ہاتھ سے چھوٹا تو اللہ تعالیٰ کی نصرت و معیت، یعنی خاص مددد اور خصوصی ساتھ بھی حاصل نہیں رہے گا۔ دیکھیے سورۂ آل عمران (۲۰۰)۔ ¤ عبد اللہ بن ابی اوفی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک جنگ کے موقع پر انتظار کیا، یہاں تک کہ سورج ڈھل گیا، پھر لوگوں میں کھڑے ہوئے اور خطبہ دیا، فرمایا : ’’اے لوگو ! دشمن سے مڈ بھیڑ کی تمنا نہ کرو اور اللہ تعالیٰ سے عافیت کا سوال کرتے رہو اور جب دشمن سے مقابلہ ہو جائے تو صبر کرو ( ڈٹے رہو) اور جان لو کہ جنت تلواروں کے سائے تلے ہے۔‘‘ [ بخاری، الجہاد والسیر، باب کان النبی صلی اللہ علیہ وسلم إذا لم یقاتل أول النھار… : ۲۹۶۵، ۲۹۶۶ ] حافظ ابن کثیر رحمہ اللہ نے فرمایا، صحابہ کرام رضی اللہ عنہم میں وہ شجاعت، صبر و ثبات اور اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی ایسی فرماں برداری تھی جو نہ اس سے پہلے کسی کو حاصل ہوئی نہ بعد میں ہو گی، انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی صحبت کی برکت اور آپ کی اطاعت سے شرق و غرب کے ممالک کے ساتھ ساتھ دلوں کو بھی فتح کیا اور روم و فارس کے مقابلے میں نہایت تھوڑی تعداد کے باوجود سب پر غالب آئے، یہاں تک کہ اللہ کا بول سب پر بالا ہو گیا اور اس کا دین سب ادیان پر غالب آ گیا اور صرف تیس سال سے بھی کم عرصے میں اسلامی ممالک مشرق سے مغرب تک پھیل گئے، اللہ تعالیٰ ان سے راضی ہو اور انھیں راضی کرے اور ہمارا حشر بھی ان کے ساتھ کرے، وہ بے حد کرم اور عطا والا ہے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46،45 ) {اِذَا لَقِيْتُمْ فِئَةً فَاثْبُتُوْا … : ’’ لَقِيْتُمْ ‘‘ ’’ لِقَاءٌ‘‘} سے ہے، یعنی ملنا اور آمنے سامنے ہونا، اکثر لڑائی کی ملاقات کے لیے استعمال ہوتا ہے، یہاں بھی یہی مراد ہے۔ {’’ فِئَةً ‘‘} جماعت، گروہ۔ یہ{’’ فَاءَ يَفِيْئُ فَيْئًا ‘‘} (لوٹنا) سے مشتق ہے، کیونکہ ایک جماعت کے لوگ مدد کے لیے ایک دوسرے کی طرف لوٹ کر آتے ہیں۔ (راغب) قرآن مجید میں زیادہ تر یہ لفظ لڑنے والی جماعت کے لیے استعمال ہوا ہے، خواہ وہ کفار کی جماعت ہو یا مسلمانوں کی اور خواہ مستقل جماعت ہو یا کمک کے لیے آنے والی، مثلاً اللہ تعالیٰ نے فرمایا : «كَمْ مِّنْ فِئَةٍ قَلِيْلَةٍ غَلَبَتْ فِئَةً كَثِيْرَةًۢ بِاِذْنِ اللّٰهِ » [ البقرۃ : ۲۴۹ ] ’’کتنی ہی تھوڑی جماعتیں زیادہ جماعتوں پر اللہ کے حکم سے غالب آ گئیں۔‘‘ اور دیکھیے سورۂ آل عمران (۱۳) اور سورۂ کہف (۴۳) اس آیت میں دشمن سے مقابلے کے وقت لڑائی کے آداب اور دلیری و شجاعت حاصل کرنے کے طریقے سکھائے۔ ان میں سے پہلی چیز ثابت قدمی اور ڈٹے رہنا ہے، کیونکہ اس کے بغیر میدانِ جنگ میں ٹھہرنا ممکن ہی نہیں۔ ثابت قدمی سے مراد انتہائی بے جگری سے لڑنا ہے، لہٰذا یہ آیت «اِلَّا مُتَحَرِّفًا لِّقِتَالٍ اَوْ مُتَحَيِّزًا اِلٰى فِئَةٍ» [ الأنفال : ۱۶ ] کے خلاف نہیں، کیونکہ جنگی چال کے طور پر ایک طرف ہونا یا پیچھے ہٹنا فرار نہیں بلکہ ثابت قدمی ہی کی ایک صورت ہے۔ دوسری چیز اللہ کو کثرت سے یاد کرنا ہے، کیونکہ فتح و نصرت کا انحصار ظاہری اسباب پر نہیں بلکہ دل کی استقامت، اللہ کی یاد اور اس کا حکم بجا لانے پر ہے، اسی لیے طالوت کے ساتھیوں نے دشمن سے مڈ بھیڑ کے وقت یہ دعا کی تھی : «رَبَّنَاۤ اَفْرِغْ عَلَيْنَا صَبْرًا وَّ ثَبِّتْ اَقْدَامَنَا وَ انْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِيْنَ» [ البقرۃ : ۲۵۰ ] ’’اے ہمارے رب ! ہم پر صبر انڈیل دے اور ہمارے قدم ثابت رکھ اور ان کافر لوگوں کے خلاف ہماری مدد فرما۔‘‘ نبی کریم صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنہم نے بدر اور دوسرے مقامات پر نہایت عجز و زاری سے اللہ کو یاد کیا اور اس سے مدد مانگی۔ مسلمان تھوڑے ہوں تو اللہ کی مدد طلب کریں اور زیادہ ہوں تو بھی اپنی طاقت اور کثرت کے بجائے صرف اللہ تعالیٰ ہی پر بھروسا رکھیں اور اس کی یاد سے غافل نہ ہوں۔ تیسری ہدایت اللہ اور اس کے رسول کی فرماں برداری ہے جو ہر حال میں لازم ہے، مگر میدان جنگ میں اس کی اہمیت کئی گنا بڑھ جاتی ہے، کیونکہ وہاں تھوڑی سی نافرمانی بھی بعض اوقات نا قابل تلافی نقصان کا باعث بن جاتی ہے، جیسا کہ جنگ اُحد میں ہوا۔ اس میں امیر کی اطاعت بھی شامل ہے کہ وہ بھی اللہ اور اس کے رسول کا حکم ہے۔ چوتھی ہدایت یہ کہ آپس میں جھگڑا اور اختلاف نہ کرو، ورنہ فتح کے بعد شکست نظر آنے لگے گی، جس سے تمھارے دلوں میں بزدلی پیدا ہو جائے گی اور تم ہمت ہار بیٹھو گے اور تمھاری ہوا جاتی رہے گی، یعنی تمھارے درمیان پھوٹ دیکھ کر دشمنوں پر سے رعب اٹھ جائے گا اور وہ تم پر غلبہ پانے کے لیے اپنے اندر جرأت محسوس کرنے لگیں گے۔ پانچویں ہدایت یہ کہ صبر کرو، کیونکہ اللہ تعالیٰ صبر کرنے والوں کے ساتھ ہے، اگر صبر کا دامن ہاتھ سے چھوٹا تو اللہ تعالیٰ کی نصرت و معیت، یعنی خاص مددد اور خصوصی ساتھ بھی حاصل نہیں رہے گا۔ دیکھیے سورۂ آل عمران (۲۰۰)۔ ¤ عبد اللہ بن ابی اوفی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک جنگ کے موقع پر انتظار کیا، یہاں تک کہ سورج ڈھل گیا، پھر لوگوں میں کھڑے ہوئے اور خطبہ دیا، فرمایا : ’’اے لوگو ! دشمن سے مڈ بھیڑ کی تمنا نہ کرو اور اللہ تعالیٰ سے عافیت کا سوال کرتے رہو اور جب دشمن سے مقابلہ ہو جائے تو صبر کرو ( ڈٹے رہو) اور جان لو کہ جنت تلواروں کے سائے تلے ہے۔‘‘ [ بخاری، الجہاد والسیر، باب کان النبی صلی اللہ علیہ وسلم إذا لم یقاتل أول النھار… : ۲۹۶۵، ۲۹۶۶ ] حافظ ابن کثیر رحمہ اللہ نے فرمایا، صحابہ کرام رضی اللہ عنہم میں وہ شجاعت، صبر و ثبات اور اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی ایسی فرماں برداری تھی جو نہ اس سے پہلے کسی کو حاصل ہوئی نہ بعد میں ہو گی، انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی صحبت کی برکت اور آپ کی اطاعت سے شرق و غرب کے ممالک کے ساتھ ساتھ دلوں کو بھی فتح کیا اور روم و فارس کے مقابلے میں نہایت تھوڑی تعداد کے باوجود سب پر غالب آئے، یہاں تک کہ اللہ کا بول سب پر بالا ہو گیا اور اس کا دین سب ادیان پر غالب آ گیا اور صرف تیس سال سے بھی کم عرصے میں اسلامی ممالک مشرق سے مغرب تک پھیل گئے، اللہ تعالیٰ ان سے راضی ہو اور انھیں راضی کرے اور ہمارا حشر بھی ان کے ساتھ کرے، وہ بے حد کرم اور عطا والا ہے۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) {وَ لَا تَكُوْنُوْا كَالَّذِيْنَ خَرَجُوْا مِنْ دِيَارِهِمْ …:} مسلمانوں کو لڑائی میں ثابت قدمی اور ذکر الٰہی کی کثرت کا حکم دینے کے بعد اب کفار کی مشابہت اختیار کرنے سے منع فرمایا ہے۔ (ابن کثیر) ان سے مراد ہیں ابو جہل اور اس کے ساتھی، جو تین مقصد لے کر نکلے تھے، {’’ بَطَرًا ‘‘} اپنی اکڑ اور بڑائی ثابت کرنے کے لیے، {’’ رِئَآءَ النَّاسِ ‘‘} لوگوں کو اپنی شان و شوکت اور شجاعت دکھانے کے لیے اور {’’ يَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ ‘‘} اللہ کے راستے، یعنی اسلام سے لوگوں کو روکنے کے لیے، جبکہ مومن صرف اور صرف اللہ کا دین غالب کرنے اور اس کی رضا حاصل کرنے کے لیے نکلتا ہے۔ نتیجہ یہ ہوا کہ شان و شوکت کا اظہار، فخریہ اشعار اور شراب نوشی کی محفلوں کے بجائے انھیں موت کے پیالے پی کر، ذلت و رسوائی اور دردناک مصیبتوں کے ساتھ واپس لوٹنا پڑا۔ یہ لوگ گویا اپنے رب کے ساتھ مقابلے کے لیے نکلے تھے اور اس قادر و قہار کے احاطے سے تو ان کا کوئی چھوٹا بڑا عمل باہر نہ تھا، اس کے آگے ان کی کیا پیش جا سکتی تھی۔ خندق کے موقع پر کعب بن مالک رضی اللہ عنہ نے کیا خوب کہا تھا : ¤ {جَائَتْ سَخِيْنَةُ كَيْ تُغَالِبَ رَبَّهَا ¤ وَلَيُغْلَبَنَّ مُغَالِبُ الْغَلاَّبِ} ¤ ’’ سخینہ یعنی قریش اپنے رب سے مقابلے کے لیے آئے اور اس زبردست غالب کا مقابلہ کرنے والا یقینا ہر صورت مغلوب ہو گا۔‘‘"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48 ) ➊ {وَ اِذْ زَيَّنَ لَهُمُ الشَّيْطٰنُ اَعْمَالَهُمْ …: ’’ جَارٌ ‘‘} کا معنی یہاں مجیر، معین، ناصر یعنی حمایتی و مدد گار ہے۔ {’’نَكَصَ ‘‘} الٹے پاؤں پیچھے ہٹا۔ شیطان کے ان کے لیے ان کے اعمال کو مزین کرنے، انھیں ان کے غالب ہونے اور اپنی حمایت کا یقین دلانے کی تفسیر بعض مفسرین، مثلاً طبری، ابن کثیر اور قرطبی رحمہم اللہ نے ابن عباس رضی اللہ عنہما سے نقل فرمائی ہے کہ قریش اور بنو کنانہ کی باہم دشمنی تھی اور انھیں ان کی طرف سے خطرہ تھا کہ وہ پیچھے سے ہم پر حملہ نہ کر دیں۔ شیطان نے ان کے سردار سراقہ بن مالک بن جعشم کی شکل میں آکر ان کی طرف سے قریش کو بے فکر ہو جانے کا اور اپنی حمایت کا یقین دلایا اور اپنے لشکر کو بھی لے کر آیا، مگر بدر میں جب مسلمانوں کے ساتھ جبریل علیہ السلام اور فرشتوں کو دیکھا تو الٹے پاؤں یہ الفاظ کہتا ہوا بھاگ گیا جن کا قرآن مجید میں ذکر ہے۔ ¤ بعض مفسرین مثلاً صاحب المنار نے یہ تفسیر کی ہے کہ شیطان انسانی شکل میں نہیں آیا بلکہ یہ تمام باتیں بطور وسوسہ اس نے ان کے دلوں میں ڈالیں کہ میں تمھارا حمایتی ہوں، یعنی جن بتوں اور خداؤں کو تم پوجتے ہو وہ ہر طرح سے تمھاری حمایت اور مدد کریں گے اور اس وقت تم اتنی تعداد اور قوت میں ہو کہ تم پر کوئی غالب نہیں آ سکتا۔ وہ اپنے بتوں اور خداؤں کے بھروسے پر جو درحقیقت شیطان پر بھروسا تھا اور اپنی قوت کے زعم میں شیطان کے ڈالے ہوئے وسوسے پر اپنی فتح کا یقین کر بیٹھے، مگر بدر کے میدان میں لڑائی شروع ہونے کے بعد انھیں مسلمان دگنے نظر آنے لگے تو شیطان کے سارے دلائے ہوئے وسوسے اور یقین باطل ہو گئے۔ سید رشید رضا نے شیطان کے انسانی صورت میں آنے کی روایات کی صحت میں شک پیدا کرنے کی کوشش کی ہے۔ بعض نے کہا ہے کہ یہ روایات ابن عباس رضی اللہ عنہما سے مروی ہیں جو اس وقت پانچ برس کے تھے، انھوں نے کسی اور ہی سے سنی ہوں گی، مگر صحابہ کی مرسلات بھی قبول ہوتی ہیں، کیونکہ انھوں نے کسی نہ کسی صحابی ہی سے سنی ہوتی ہیں جو سب معتبر ہیں۔ ¤ ابن کثیر کی تخریج {’’ هداية المستنير‘‘} میں لکھا ہے کہ ابن کثیر نے ان آیات کے تحت ابن عباس رضی اللہ عنہما سے کئی روایات ذکر کی ہیں جن میں سے کوئی بھی ضعف سے خالی نہیں، مگر ان کو جمع کرنے سے معلوم ہوتا ہے کہ ان واقعات کا اصل ضرور ہے، اس لیے انھیں بیان کرنے میں کوئی مانع نہیں اور {’’ الاستيعاب في بيان الأسباب ‘‘} میں سلیم الہلالی اور محمد بن موسیٰ نے لکھا ہے کہ ابن عباس رضی اللہ عنہما کی ( یہاں مذکور) روایت حسن ہے، اس میں دو علتیں بیان کی گئی ہیں مگر ان کی کچھ حیثیت نہیں۔ چونکہ رسول اللہ صلی اللہ علیہ وسلم سے اس آیت کی کوئی وضاحت صحیح حدیث میں نہیں آئی اور یہ معاملہ غیب سے تعلق رکھتا ہے، اس لیے اگرچہ یقین سے نہیں کہا جا سکتا کہ شیطان نے واقعی انسانی وجود میں آ کر انھیں یہ کہا یا محض دل میں غرور پیدا کر کے انھیں دھوکا دیا، مگر قرآن کے الفاظ {’’ قَالَ لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ ‘‘} اور {’’ نَكَصَ عَلٰى عَقِبَيْهِ ‘‘} سے یہی راجح نظر آتا ہے کہ وہ ظالم انسانی شکل میں آیا تھا اور شیطان کا بعض اوقات انسانی شکل میں آنا کچھ بعید نہیں، جیسا کہ صحیح حدیث میں ہے کہ ایک دفعہ وہ رسول اللہ صلی اللہ علیہ وسلم پر نماز میں حملہ آور ہوا تو آپ نے پکڑ کر اس کا گلا گھونٹا، مگر پھر سلیمان علیہ السلام کی دعا یاد کر کے اسے چھوڑ دیا۔ [ بخاری، الصلاۃ، باب الأسیر أو الغریم یربط فی المسجد : ۴۶۱ ] ابو ہریرہ رضی اللہ عنہ کو بھی تین دن نظر آتا رہا اور وہ گرفتار کر کے اسے چھوڑ دیتے رہے، اس لیے اس اہم موقع پر خود اس کا آنا کوئی بعید نہیں ہے۔ ¤ ➋ {اِنِّيْۤ اَرٰى مَا لَا تَرَوْنَ:} یعنی مجھے وہ فرشتے نظر آ رہے ہیں جو تمھیں نظر نہیں آ رہے۔ ¤ ➌ { اِنِّيْۤ اَخَافُ اللّٰهَ:} ابلیس نے اللہ تعالیٰ سے قیامت تک کے لیے مہلت مانگی تھی، اللہ تعالیٰ نے اسے اس دن تک مہلت دی جو اللہ کے علم میں ہے۔ دیکھیے سورۂ حجر (38،37) اور سورۂ ص (81،80) قیامت تک وعدہ نہیں فرمایا اس لیے ہو سکتا ہے کہ ابلیس نے فرشتوں کو دیکھ کر یہ سمجھا ہو کہ میری مہلت کی مدت ختم ہو چکی ہے، اس لیے اس نے اللہ سے ڈرنے کا ذکرکیا، ورنہ وہ ظالم کب اللہ سے ڈرتا تھا۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49 ) ➊ { اِذْ يَقُوْلُ الْمُنٰفِقُوْنَ وَ الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ:} ’’جن کے دلوں میں بیماری‘‘ سے مراد نئے مسلمان ہیں، جن کے دلوں میں شک ختم ہو کر یقین کی پوری کیفیت پیدا نہیں ہوئی تھی۔ یہودی اور مدمقابل مشرکین بھی مراد ہو سکتے ہیں۔ ¤ ➋ { غَرَّ هٰۤؤُلَآءِ دِيْنُهُمْ:} یعنی ان کے دینی جوش نے ان کو بالکل دیوانہ بنا دیا ہے، دیکھ رہے ہیں کہ ان کی تھوڑی سی تعداد ہے، کوئی سروسامان بھی نہیں ہے، حتیٰ کہ لڑنے کے لیے ایک کے سوا دوسرا گھوڑا بھی نہیں ہے، مگر چلے ہیں قریش کے مسلح اور عظیم الشان لشکر سے مقابلہ کرنے، پاگل ہی تو ہیں جو اپنی موت کو خود دعوت دے رہے ہیں۔ رسولوں اور ان کے ساتھیوں کو پاگل و دیوانہ کہنے کا یہ سلسلہ پہلے رسول سے لے کر ہمارے رسول تک چلا آیا ہے، کیونکہ کفار وہ بات سمجھ ہی نہیں سکتے جو ایمان سے دل میں پیدا ہوتی ہے۔ دیکھیے سورۂ ذاریات (۵۲، ۵۳) شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’مسلمانوں کی دلیری دیکھ کر منافق طعن کرنے لگے، اللہ نے فرمایا، یہ غرور ( دھوکا کھانا) نہیں، توکل ہے۔‘‘ (موضح) ¤ ➌ { وَ مَنْ يَّتَوَكَّلْ عَلَى اللّٰهِ …:} اور جس کا بھروسا اس سب پر غالب اور کمال حکمت والے پر ہو اس کا دل یقینا مضبوط ہو گا، اس لیے مسلمان کفار کے عظیم الشان لشکر کے ساتھ مقابلے کے لیے ہر طرح سے آمادہ اور پر عزم ہیں۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50){ وَ لَوْ تَرٰۤى اِذْ يَتَوَفَّى الَّذِيْنَ كَفَرُوا … :} کفار کی زندگی کے بعض احوال بیان کرنے کے بعد ان کی موت کی حالت بیان کی ہے۔ یہ آیت یہاں اگرچہ واقعۂ بدر کے سلسلے میں آئی ہے، اس لیے بعض مفسرین نے اسے بدر کے کفار کا حال قرار دیا ہے، لیکن لفظ عام ہونے کی وجہ سے یہ ہر کافر کے مرنے کے وقت کا حال بیان ہو رہا ہے ۔ فرمایا کہ کافروں کی روح قبض کرتے وقت فرشتے جس طرح ان کے مونہوں اور پشتوں پر مارتے اور جس طرح جھڑکتے اور سختی کرتے ہیں، کاش! آپ وہ منظر دیکھ لیں، کیونکہ سننے میں وہ بات نہیں جو دیکھنے میں ہے، جیسا کہ اللہ تعالیٰ نے سورۂ انعام (۹۳) اور سورۂ محمد (۲۷، ۲۸) میں یہی بات بیان فرمائی ہے اور احادیث میں کافر کی جان کنی کا منظر بہت ہی ہولناک بیان کیا گیا ہے۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) {ذٰلِكَ بِمَا قَدَّمَتْ اَيْدِيْكُمْ …:} یعنی یہ عذاب عین عدل ہے، کیونکہ اس نے تمھارے سمجھانے کے لیے اپنے رسول بھیجے، کتابیں نازل فرمائیں، مگر تم نے ایک نہ مانی۔ {’’ ظَلَّامٌ‘‘} مبالغے کا صیغہ ہے، یعنی بہت ظلم کرنے والا، مگر یہاں اس پر نفی آئی ہے تو مبالغے کی نفی نہیں کہ معنی یہ ہو کہ اللہ تعالیٰ بندوں پر بہت ظلم کرنے والا نہیں ( گویا تھوڑا کر سکتا ہے) بلکہ یہاں نفی میں مبالغہ مراد ہو گا، یعنی اللہ تعالیٰ بندوں پر ذرہ برابر ظلم کرنے والا بھی نہیں۔ دیکھیے فوائد سورۂ آل عمران (۱۸۲) ایک لمبی حدیث میں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ فرماتا ہے، میرے بندو ! میں نے ظلم اپنے اوپر حرام قرار دے رکھا ہے اور اسے تمھارے درمیان بھی حرام ٹھہرایا ہے، لہٰذا تم ایک دوسرے پر ظلم نہ کرو۔ میرے بندو ! یہ تمھارے اپنے ہی اعمال ہیں جن کو میں محفوظ رکھتا ہوں، پھر تمھیں ان کا پورا بدلہ دوں گا، پھر جو خیر پائے وہ اللہ کا شکر ادا کرے اور جو اس کے سوا پائے وہ اپنے آپ ہی کو ملامت کرے۔‘‘ [ مسلم، البر والصلۃ، باب تحریم الظلم : ۲۵۷۷، عن أبی ذر رضی اللہ عنہ]"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) {كَدَاْبِ اٰلِ فِرْعَوْنَ وَ الَّذِيْنَ مِنْ قَبْلِهِمْ …:} یہاں مبتدا محذوف ہے {’’ دَأْبُهُمْ كَدَأْبِ آلِ فِرْعَوْنَ …‘‘} یعنی ان کا حال اللہ کی آیات کو جھٹلانے اور اس کے نتیجے میں عذاب میں مبتلا ہونے میں آل فرعون اور ان سے پہلے کفاار کی طرح ہے۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ {حَتّٰى يُغَيِّرُوْا مَا بِاَنْفُسِهِمْ :} ’’جو ان کے دلوں میں ہے ‘‘ یعنی اعتقاد اورر نیت جب تک نہ بدلے اللہ کی بخشی ہوئی نعمت چھینی نہیں جاتی۔ (موضح) مطلب یہ ہے کہ اللہ تعالیٰ کسی قوم کو اپنی عطا کردہ نعمت سے اسی صورت میں محروم کرتا ہے جب وہ اپنے عقائد و اعمال اور اخلاق کو بدل کر اپنے متعلق ثابت کر دیتی ہے کہ وہ اس نعمت کی مستحق ہر گز نہیں ہے، مثلاً ایمان کے بجائے کفر، شکر کے بجائے نا شکری اور نیکی کے بجائے گناہ کرنے لگتی ہے، اس وقت اللہ تعالیٰ بھی اس سے اپنی عطا کردہ نعمت واپس لے لیتا ہے اور اسے مختلف قسم کے عذابوں میں مبتلا کر دیتا ہے۔ فرعون کی قوم اور اسی طرح قریش کو اللہ تعالیٰ نے بڑی شان و شوکت اور خوش حالی سے نوازا تھا، لیکن ان سے اپنی نعمتیں چھین لیں۔ اس زمانے میں مسلمان جو ساری دنیا میں ذلت، غلامی اور دوسروں کی حاشیہ برداری کی زندگی بسر کر رہے ہیں وہ بھی ان کی اپنی بد اعمالیوں کی سزا ہے، ورنہ ممکن ہی نہیں کہ ایک قوم کتاب اللہ اور سنت رسول صلی اللہ علیہ وسلم پر ایمان رکھتی ہو اور اس پر عامل ہو، پھر بھی دنیا میں ذلیل و خوار رہے۔ ¤ ➋ {وَ اَنَّ اللّٰهَ سَمِيْعٌ عَلِيْمٌ:} یعنی وہ سب کچھ سننے والا دیکھنے والا ہے، اس کے بندے جیسا طرز عمل اختیار کرتے ہیں ویسا ہی وہ انھیں بدلہ دیتا ہے۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) {كَدَاْبِ اٰلِ فِرْعَوْنَ …:} یعنی آپ سے لڑنے والے ان لوگوں کا حال آل فرعون اور ان سے پہلے کفار جیسا ہے۔ یہ بات دہرانے سے مقصود ایک تو پہلی بات کی تاکید ہے، جیسے فرمایا : «اَوْلٰى لَكَ فَاَوْلٰى (34) ثُمَّ اَوْلٰى لَكَ فَاَوْلٰى» [ القیامۃ : ۳۴، ۳۵] دوسرا اس میں پچھلی آیت کی کچھ تفصیل ہے، اُس میں {’’كَفَرُوْا بِاٰيٰتِ اللّٰهِ ‘‘} یعنی اللہ کی آیات کے انکار اور نہ ماننے کا ذکر تھا، یہاں تفصیل ہے کہ انھوں نے انکار کے ساتھ انھیں جھٹلایا بھی تھا۔ تیسرا اُس میں گناہوں پر گرفت کا ذکر تھا، اس میں آل فرعون پر اس گرفت کی تفصیل، یعنی غرق کا بیان ہے اور عذاب کے سبب کی صاف الفاظ میں وضاحت ہے کہ وہ سب ظالم تھے، جب کہ اس سے پہلے قریب ہی فرمایا کہ اللہ تعالیٰ ذرہ برابر ظلم کرنے والا نہیں، اگر وہ ظالم و گناہ گار نہ ہوتے تو اللہ تعالیٰ کو ان سے کوئی ذاتی بیر نہ تھا کہ انھیں بلاوجہ ہلاک یا غرق کر دیتا۔ واضح رہے کہ اللہ کی آیات سے مراد رسولوں کے لائے ہوئے احکام بھی ہیں اور نشانیاں اور معجزات بھی۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 56،55) {اِنَّ شَرَّ الدَّوَآبِّ عِنْدَ اللّٰهِ … :} اوپر کی آیت میں جب تمام کفار کا یہ وصف بیان فرمایا کہ وہ ظالم ہیں تو اب یہاں کفار کی بعض خاص شرارتوں کا ذکر فرمایا۔ {’’ وَ هُمْ لَا يَتَّقُوْنَ ‘‘} کا مطلب یہ ہے کہ وہ اللہ سے نہیں ڈرتے، یا وہ اپنی بد عہدی کے انجام سے نہیں ڈرتے۔ ان سے مراد خاص طور پر مدینہ منورہ کے یہودی ہیں، جن سے مدینہ منورہ پہنچ کر نبی صلی اللہ علیہ وسلم نے اچھے ہمسایوں کی طرح رہنے اور باہمی تعاون کا معاہدہ کیا تھا، لیکن اسلام کی بڑھتی ہوئی قوت انھیں ایک نظر نہ بھاتی تھی، چنانچہ کبھی وہ اوس و خزرج کے درمیان جاہلی عصبیت ابھار کر ان کو آپس میں لڑانے کی کوشش کرتے اور کبھی اسلام کے دشمنوں کی ہتھیاروں سے مدد کر کے معاہدے کی بار بار خلاف ورزی کرتے اور جب ان سے کہا جاتا تو کہہ دیتے کہ ہمیں معاہدہ یاد نہیں رہا تھا، لیکن جوں ہی موقع ملتا پھر کوئی ایسی حرکت کر گزرتے جو معاہدے کے خلاف ہوتی، حتیٰ کہ اس معاہدے کے ہوتے ہوئے ان کا سردار کعب بن اشرف ( جو بدر میں قریش کی شکست سے انتہائی سیخ پا ہوا تھا) مکہ پہنچا اور وہاں مقتولین کفارِ بدر کے ہیجان انگیز مرثیے پڑھ کر قریش کے نوجوانوں کو مسلمانوں سے انتقام لینے کا جوش دلاتا رہا۔ ایسے ہی لوگ ہیں جنھیں {’’شَرَّ الدَّوَآبِّ ‘‘} (بدترین جانور) فرمایا ہے۔ (ابن کثیر) یہاں انھیں {’’ شَرَّ النَّاسِ‘‘} (سب لوگوں سے برے) کے بجائے {’’ شَرَّ الدَّوَآبِّ ‘‘} کہا گیا ہے، اگرچہ {’’ الدَّوَآبِّ ‘‘} میں انسان بھی آ جاتے ہیں، کیونکہ وہ بھی چلتے پھرتے ہیں، مگر عام طور پر یہ لفظ انسان کے بجائے جانوروں پر بولا جاتا ہے، گویا کفر کی وجہ سے یہ لوگ انسانیت کے شرف سے محروم ہو چکے ہیں۔ دیکھیے سورۂ بینہ (۶)، سورۂ اعراف (۱۷۹) اور سورۂ فرقان (۴۴)۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56،55) {اِنَّ شَرَّ الدَّوَآبِّ عِنْدَ اللّٰهِ … :} اوپر کی آیت میں جب تمام کفار کا یہ وصف بیان فرمایا کہ وہ ظالم ہیں تو اب یہاں کفار کی بعض خاص شرارتوں کا ذکر فرمایا۔ {’’ وَ هُمْ لَا يَتَّقُوْنَ ‘‘} کا مطلب یہ ہے کہ وہ اللہ سے نہیں ڈرتے، یا وہ اپنی بد عہدی کے انجام سے نہیں ڈرتے۔ ان سے مراد خاص طور پر مدینہ منورہ کے یہودی ہیں، جن سے مدینہ منورہ پہنچ کر نبی صلی اللہ علیہ وسلم نے اچھے ہمسایوں کی طرح رہنے اور باہمی تعاون کا معاہدہ کیا تھا، لیکن اسلام کی بڑھتی ہوئی قوت انھیں ایک نظر نہ بھاتی تھی، چنانچہ کبھی وہ اوس و خزرج کے درمیان جاہلی عصبیت ابھار کر ان کو آپس میں لڑانے کی کوشش کرتے اور کبھی اسلام کے دشمنوں کی ہتھیاروں سے مدد کر کے معاہدے کی بار بار خلاف ورزی کرتے اور جب ان سے کہا جاتا تو کہہ دیتے کہ ہمیں معاہدہ یاد نہیں رہا تھا، لیکن جوں ہی موقع ملتا پھر کوئی ایسی حرکت کر گزرتے جو معاہدے کے خلاف ہوتی، حتیٰ کہ اس معاہدے کے ہوتے ہوئے ان کا سردار کعب بن اشرف ( جو بدر میں قریش کی شکست سے انتہائی سیخ پا ہوا تھا) مکہ پہنچا اور وہاں مقتولین کفارِ بدر کے ہیجان انگیز مرثیے پڑھ کر قریش کے نوجوانوں کو مسلمانوں سے انتقام لینے کا جوش دلاتا رہا۔ ایسے ہی لوگ ہیں جنھیں {’’شَرَّ الدَّوَآبِّ ‘‘} (بدترین جانور) فرمایا ہے۔ (ابن کثیر) یہاں انھیں {’’ شَرَّ النَّاسِ‘‘} (سب لوگوں سے برے) کے بجائے {’’ شَرَّ الدَّوَآبِّ ‘‘} کہا گیا ہے، اگرچہ {’’ الدَّوَآبِّ ‘‘} میں انسان بھی آ جاتے ہیں، کیونکہ وہ بھی چلتے پھرتے ہیں، مگر عام طور پر یہ لفظ انسان کے بجائے جانوروں پر بولا جاتا ہے، گویا کفر کی وجہ سے یہ لوگ انسانیت کے شرف سے محروم ہو چکے ہیں۔ دیکھیے سورۂ بینہ (۶)، سورۂ اعراف (۱۷۹) اور سورۂ فرقان (۴۴)۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57){فَاِمَّا تَثْقَفَنَّهُمْ فِي الْحَرْبِ فَشَرِّدْ بِهِمْ …: ’’ تَشْرِيْدٌ ‘‘} کا معنی خوف پیدا کرنے کے ساتھ بھگدڑ مچا کر انھیں منتشر کرنا ہے، یعنی اگر کبھی لڑائی میں آپ انھیں کہیں پا لیں تو انھیں بد عہدی کی ایسی سخت سزا دیں کہ ان کے پیچھے جو دوسرے ایسے کفار ہیں اور جن سے تمھارا معاہدہ ہے وہ بھی مرعوب اور خوف زدہ ہو جائیں اور انھیں ایسی عبرت حاصل ہو کہ معاہدے کی خلاف ورزی کا نام تک نہ لیں۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے اگرچہ اس سے پہلے یہود بنو نضیر اور بنو قینقاع کی جلاوطنی ہی پر اکتفا فرمایا تھا، مگر بنو قریظہ کی مسلسل بد عہدیوں اور عین خندق کے موقع پر معاہدہ توڑنے کے نتیجے میں انھیں ۲۵دن کے محاصرے کے بعد انتہائی عبرت ناک سزا دی کہ ان کے تمام ۶۰۰ بالغ مردوں کو قتل کروا دیا، جن میں ایک جنگی مجرم عورت بھی تھی اور عورتوں اور بچوں کو غلام بنا لیا۔ افسوس کہ اس وقت کفار، بھارت ہو یا امریکہ ویورپ، کوئی بھی مسلمانوں سے کیے ہوئے عہد کو پورا نہیں کر رہے، مگر مسلمان اپنی نا اہلی اور عیش و عشرت کی وجہ سے غیرت و حمیت کے اظہار کے بجائے ذلت اور بے بسی پر قناعت کر رہے ہیں۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58){وَ اِمَّا تَخَافَنَّ مِنْ قَوْمٍ خِيَانَةً … :} یعنی عہد توڑنا خیانت ہے جو مسلمان کے  لیے کسی صورت جائز نہیں، حتیٰ کہ اگر کسی قوم کے ساتھ معاہدہ ہو تو ان کے خلاف کوئی بھی کار روائی جائز نہیں، خواہ وہ لوگ تمھاری ریاست کے اندر ہوں یا باہر۔ اگر فی الواقع ان کی طرف سے عہد توڑنے یا دھوکا دینے کا خطرہ پیدا ہو جائے، جو آثار سے نظر آ جاتا ہے تو پھر بھی آگاہ کیے بغیر ان کے خلاف خفیہ کارروائی یا کھلا حملہ کر دینا جائز نہیں، بلکہ صاف اعلان کر کے واضح کر دو کہ ہمارا تمھارا معاہدہ ختم ہے، تاکہ تم پر عہد توڑنے یا دھوکا دینے کا الزام نہ آئے، کیونکہ اللہ تعالیٰ خیانت کرنے والوں کو پسند نہیں کرتا۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم کے خلفاء کی سیرت بھی یہی رہی کہ کفار کی طرف سے عہد شکنی کے خطرے کی صورت میں معاہدے کے خاتمے کا اعلان فرما دیتے اور پھر حملہ آور ہوتے۔ مگر جب کسی قوم نے بد عہدی کر دی ہو تو اس پر بے خبری میں حملہ بھی جائز ہے، جیسا کہ کفار مکہ نے رسول اللہ صلی اللہ علیہ وسلم کے حلیف بنو خزاعہ پر بنو بکر کے حملے میں شریک ہو کر صلح حدیبیہ کا معاہدہ توڑا تو رسول اللہ صلی اللہ علیہ وسلم نے ان پر خبر دیے بغیر چڑھائی کر دی اور انھیں خبر اس وقت ہوئی جب اسلامی فوجیں مکہ کے قریب آ پہنچیں۔ مسلمان اپنے معاہدوں کی کس قدر پاس داری کرتے تھے، اس کی مثال وہ واقعہ ہے جو سلیم بن عامر بیان کرتے ہیں کہ معاویہ رضی اللہ عنہ رومیوں کی سرزمین کی طرف کوچ کر رہے تھے، جبکہ آپ کے اور ان کے درمیان ایک معاہدہ تھا، آپ چاہتے تھے کہ ان کے قریب پہنچ جائیں اور جب معاہدے کی مدت ختم ہو تو ( اچانک) ان پر حملہ کر دیں، تو انھوں نے دیکھا کہ ایک بزرگ سواری پر سوار ہیں اور کہہ رہے ہیں اللہ اکبر، اللہ اکبر، عہد پورا کرنا ہے، عہد توڑنا نہیں، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : ’’جس کا کسی قوم سے کوئی عہد ہو تو ہر گز نہ کوئی گرہ کھولے اور نہ اسے باندھے یہاں تک کہ اس کی مدت ختم ہو جائے، یا برابری کی بنیاد پر ان کا عہد ان کی طرف پھینک دے۔‘‘ یہ حدیث معاویہ رضی اللہ عنہ کو پہنچی تو واپس آ گئے۔ حدیث بیان کرنے والے یہ بزرگ عمرو بن عبسہ رضی اللہ عنہ تھے۔ [ أحمد : 111/4، ح : ۱۷۰۱۷۔ أبو داوٗد : ۲۷۵۹ ]"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59){وَ لَا يَحْسَبَنَّ الَّذِيْنَ كَفَرُوْا سَبَقُوْا …:} یہاں سب سے پہلے وہ کفار قریش مراد ہیں جو میدانِ بدر سے جان بچا کر بھاگ نکلنے میں کامیاب ہو گئے تھے۔ فرمایا وہ ہر گز نہ سمجھیں کہ وہ اللہ کی گرفت سے بچ کر نکل گئے ہیں، اس کی گرفت سے کون نکل سکتا ہے اور اسے کون عاجز اور بے بس کر کے بھاگ سکتا ہے ؟ ویسے الفاظ کے عموم کا تقاضا اور حقیقت واقعی یہی ہے کہ کافر کوئی بھی ہو وہ اپنے آپ کو اللہ تعالیٰ کی گرفت سے بچ نکلنے میں ہر گز کامیاب نہ سمجھے، اگر دنیا میں اس گرفت کا مظاہرہ نہ ہو تو موت کے وقت اور اس کے بعد وہ بچ کر کہاں جائیں گے ؟ وہ کبھی اللہ کو عاجز نہیں کر سکتے۔ اللہ تعالیٰ جب چاہے جیسا چاہے ان پر عذاب بھیج سکتا ہے۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) ➊ {وَ اَعِدُّوْا لَهُمْ مَّا اسْتَطَعْتُمْ مِّنْ قُوَّةٍ: ’’ قُوَّةٍ ‘‘} کا لفظ نکرہ لایا گیا ہے، {’’ مِنْ ‘‘} کے ساتھ عموم اور زیادہ ہو گیا ہے، یعنی ہر قسم کی قوت، خواہ جو بھی ہو، تاکہ اس میں وہ تمام چیزیں آ جائیں جو جنگ میں قوت کا ذریعہ بن سکتی ہیں۔ عقبہ بن عامر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ نے یہ آیت تلاوت کی : « وَ اَعِدُّوْا لَهُمْ مَّا اسْتَطَعْتُمْ مِّنْ قُوَّةٍ » اور فرمایا: [ أَلاَ إِنَّ الْقُوَّةَ الرَّمْيُ، أَلاَ إِنَّ الْقُوَّةَ الرَّمْيُ، أَلاَ  إِنَّ الْقُوَّةَ الرَّمْيُ ] تین دفعہ فرمایا کہ یاد رکھو! اصل قوت {’’رَمْيٌ‘‘} ہے۔ [ مسلم، الإمارۃ، باب فضل الرمی والحث علیہ… : ۱۹۱۷ ] {’’ رَمْيٌ ‘‘} کا لفظ اگرچہ تیر اندازی کے معنی میں بھی آتا ہے، مگر اس میں تیر کے ساتھ ساتھ وہ تمام چیزیں آ جاتی ہیں جو دور سے پھینکی جاتی ہیں، جیسا کہ اللہ تعالیٰ کے فرمان : «وَ مَا رَمَيْتَ اِذْ رَمَيْتَ » [ الأنفال : ۱۷ ] سے مرادمٹی اور کنکریوں کی مٹھی پھینکنا ہے۔ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں دور سے مار کرنے والی جو بھی چیز تھی آپ نے جنگ میں استعمال فرمائی، حتیٰ کہ منجنیق بھی دشمن کے خلاف استعمال فرمائی، جس کے ساتھ دور سے پتھر پھینک کر قلعوں کی دیواریں توڑ دی جاتی تھیں اور ہمیشہ مسلمانوں نے اپنے غلبے کے زمانے میں ہر جدید ہتھیار مثلاً نِفط (پٹرول وغیرہ) کے ہتھیار استعمال کیے۔ بارود کی ایجاد کے بعد بھی ترک خلفاء توپوں کی تیاری سے غافل نہیں رہے، مگر افسوس! اس کے بعد مسلمانوں نے اس حکم سے اتنی بے پروائی کی کہ دشمن اس میدان، یعنی اسلحہ کی تیاری میں ان سے بہت آگے نکل گیا۔ اب عالم اسلام اللہ تعالیٰ کی دی ہوئی ہر نعمت کے باوجود اسلحے کے لیے غیروں کا محتاج ہے، چھوٹے موٹے ہتھیار تو بنتے ہیں، مگر ہوائی جہاز، ہیلی کاپٹر، گاڑیاں، کمپیوٹر، توپیں، ریڈار وغیرہ تمام چیزوں میں وہ دوسروں کا دست نگر ہے۔ (الا ما شاء اللہ) جس کے نتیجے میں کفار مسلمانوں کی دولت بھی لوٹ رہے ہیں، ان کے وسائل اور دینی اقدار کو بھی چھین رہے ہیں اور جب چاہتے ہیں ان ہتھیاروں اور جہازوں کی ضروریات وغیرہ روک کر بے بس کر دیتے ہیں، حالانکہ پاکستان اگر ایٹم بم بنا سکتا ہے تو وہ کون سی چیز ہے جو مسلم ممالک نہیں بنا سکتے؟ مگر مسلمانوں کی دین سے بے گانگی، دشمن کی چال بازی، اپنوں کی غداری اور طمع و حرص کے نتیجے میں پیدا ہونے والی بزدلی ان میں یہ چیزیں بنانے کی جرأت ہی پیدا نہیں ہونے دیتی۔ حقیقت یہ ہے کہ جب ہم کسی گاڑی، ریل یا ہوائی جہاز پر سوار ہو کر اپنے ملک میں یا بیرون ملک سفر کرتے ہیں تو دل میں سخت تکلیف ہوتی ہے کہ یہ تمام سواریاں ہمارے دشمنوں کی بنائی ہوئی ہیں، ہم اپنے بل بوتے پر کچھ بھی نہیں بنا سکے۔ یہ سب مسلمانوں کے رہنماؤں کا کیا دھرا ہے، جو اپنے عوام ہی کی تصویر ہیں، مگر مایوس ہونا کسی صورت بھی جائز نہیں اور نہ کفار کو نا قابل شکست سمجھ کر ہاتھ توڑ کر بیٹھ جانا چاہیے، کیونکہ اللہ تعالیٰ کے فرمان کے مطابق کفار جتنی بھی کوشش کر لیں کبھی نورِ اسلام کو بجھا نہ سکیں گے، فرمایا : «يُرِيْدُوْنَ لِيُطْفِـُٔوْا نُوْرَ اللّٰهِ بِاَفْوَاهِهِمْ وَ اللّٰهُ مُتِمُّ  نُوْرِهٖ وَ لَوْ كَرِهَ الْكٰفِرُوْنَ» [ الصف : ۸ ]’’وہ چاہتے ہیں کہ اللہ کے نور کو اپنے مونہوں کے ساتھ بجھا دیں اور اللہ اپنے نور کو پورا کرنے والا ہے، اگرچہ کافر لوگ ناپسند کریں۔‘‘ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ دین ہمیشہ قائم رہے گا، مسلمانوں کی ایک جماعت قیامت قائم ہونے تک اس کی خاطر لڑتی رہے گی۔‘‘ [ مسلم، الإمارۃ، باب قولہ صلی اللہ علیہ وسلم : لا تزال طائفۃ من أمتی… : ۱۹۲۲، عن جابر بن سمرۃ رضی اللہ عنہ ] مغیرہ بن شعبہ، جابر بن عبد اللہ اور معاویہ رضی اللہ عنہم سے مروی رسول اللہ صلی اللہ علیہ وسلم کی احادیث میں ان لوگوں کے دین پر قائم رہنے اور غالب رہنے کی خوش خبری بھی آئی ہے۔ [دیکھیے مسلم، الإمارۃ، باب قولہ صلی اللہ علیہ وسلم : لا تزال طائفۃ من أمتی… : ۱۹۲۱، ۱۹۲۳، ۱۰۳۷، بعد ح : ۱۹۲۳ ] اللہ تعالیٰ ہی جانتا ہے کہ اس وقت مجاہدین اسلام اور کفار کے درمیان جو جنگ جاری ہے اس میں اہل اسلام کی کس قدر آزمائش باقی ہے؟ اور کفار اللہ تعالیٰ سے بغاوت کی جس حد تک پہنچ چکے ہیں ان کی سزا میں کتنی دیر ہے؟ اور اللہ تعالیٰ اپنے کن بندوں کے ہاتھوں کفار کو کس طرح کیفر کرداار تک پہنچاتا ہے؟ فرمان الٰہی ہے : «وَ اِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُوْنُوْۤا اَمْثَالَكُمْ» [ محمد : ۳۸ ] ’’اور اگر تم پھر جاؤ گے تو وہ تمھاری جگہ تمھارے سوا اور لوگ لے آئے گا، پھر وہ تمھاری طرح نہیں ہوں گے۔‘‘ اور دیکھیے سورۂ مائدہ ( ۵۴)۔ ¤ ➋ {وَ مِنْ رِّبَاطِ الْخَيْلِ:} اس حکم سے سوار فوج کی اہمیت ظاہر ہے۔{ ’’ قُوَّةٍ ‘‘} اور {’’ رِبَاطِ الْخَيْلِ ‘‘} میں فوجی گاڑیاں، ٹینک، بکتر بند گاڑیاں، جنگی جہاز، آبدوزیں، بحری بیڑے، جاسوسی کے آلات اور ادارے، اعلام کے ذرائع سب آ جاتے ہیں، مگر ان سب کے باوجود قیامت تک جنگ میں گھوڑوں کی ضرورت اور اہمیت کبھی ختم نہیں ہو گی۔ جو کام یہ مبارک جانور سر انجام دے سکتا ہے دنیا کی کوئی چیز نہیں دے سکتی۔ عروہ بارقی اور جریر بن عبد اللہ رضی اللہ عنہما رسول اللہ صلی اللہ علیہ وسلم سے بیان کرتے ہیں کہ آپ نے فرمایا : ’’یہ گھوڑے، ان کی پیشانیوں میں قیامت کے دن تک خیر باندھ دی گئی ہے، اجر اور غنیمت۔‘‘ [ مسلم، الإمارۃ، باب فضیلۃ الخیل … : ۱۸۷۲، ۱۸۷۳ ] اس لیے مسلمانوں کو ڈرائیور، پائلٹ، ملاح، بحری مجاہد، تیراک اور غوطہ خور ہونے کے ساتھ ساتھ گھڑ سوار ہونا بھی لازم ہے۔ ¤ ➌ { تُرْهِبُوْنَ بِهٖ عَدُوَّ اللّٰهِ وَ عَدُوَّكُمْ:} یعنی اس قدر مضبوط تیاری رکھو کہ اللہ کا دشمن اور تمھارا دشمن اور تمھارے ساتھ کد رکھنے والا ہر شخص تم سے خوف زدہ رہے اور لڑنے کی جرأت ہی نہ کر سکے۔ ان واضح دشمنوں میں مشرکین، یہود و نصاریٰ اور جانے پہچانے منافق سب شامل ہیں۔ ¤ ➍ {وَ اٰخَرِيْنَ مِنْ دُوْنِهِمْ:} اس سے مراد مسلمانوں کی صفوں میں کفار کے چھپے ہوئے ہمدرد منافق ہیں۔ دیکھیے سورۂ توبہ (۱۰۱) علاوہ ازیں کئی اقوام جو بظاہر اس وقت تمھارے خلاف نہیں، مگر موقع پانے پر دل میں تم سے لڑائی کا ارادہ رکھتی ہیں، تمھاری مکمل تیاری اور ہر وقت جہاد میں مصروف رہنا سب کو خوف زدہ رکھے گا۔ بعض مفسرین نے اس سے جن و شیاطین کے لشکر مراد لیے ہیں، تمھاری تیاری کی بدولت وہ بھی دشمنوں کے دلوں میں لڑائی کے جذبات نہیں ابھار سکیں گے۔ ¤ ➎ {وَ مَا تُنْفِقُوْا مِنْ شَيْءٍ …:} اس سے جہاد میں مال خرچ کرنے کی ترغیب مقصود ہے۔ فی سبیل اللہ خرچ کی فضیلت کے لیے دیکھیے سورۂ بقرہ (۲۶۱)۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) {وَ اِنْ جَنَحُوْا لِلسَّلْمِ فَاجْنَحْ لَهَا … :} بھر پور جنگی تیاری اور جہاد جاری رکھنے کا لازمی نتیجہ یہ ہے کہ دشمن صلح کی طرف مائل ہو گا۔ اللہ تعالیٰ نے صلح کی طرف مائل ہونے والوں سے صلح کر لینے کا حکم دیا، کیونکہ اسلامی جہاد کا مقصد اللہ کے دین کا غلبہ ہے، ہر حال میں غیر مسلموں کو تہ تیغ کرنا نہیں، نہ انھیں زبردستی مسلمان بنانا ہے۔ اس صلح کے نتیجے میں بہت سی دینی اور دنیوی برکات حاصل ہوں گی، مسلمانوں کے ساتھ میل جول کی وجہ سے کفار اسلام سے واقف ہوں گے، اسلام کی اشاعت بڑھے گی، جس کا نتیجہ اسلام کا غلبہ ہو گا، اسی لیے اللہ تعالیٰ نے صلح حدیبیہ کو ’’فتح مبین‘‘ قرار دیا۔ بعض اوقات جزیے پر صلح ہو گی جو مسلمانوں کی مالی قوت میں اضافے کا باعث ہو گی اور دنیا میں جنگ کے ماحول کے بجائے امن و اطمینان کا دور دورہ ہو گا جو صرف اسلام کے غلبے کی صورت میں ہو سکتا ہے۔ لیکن یاد رہے کہ محض ہمت ہار کر بزدلی کی وجہ سے خود دشمن کو صلح کی پیش کش اللہ تعالیٰ کو پسند نہیں۔ دیکھیے سورۂ محمد(۳۵) صلح کی صورت میں کفار کی عہد شکنی یا سازشوں کے خطرے کی پروا نہ کریں، بلکہ اللہ تعالیٰ پر بھروسا رکھیں، وہ سب کچھ سن رہا ہے، دیکھ رہا ہے۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 63،62){ وَ اِنْ يُّرِيْدُوْۤا اَنْ يَّخْدَعُوْكَ …:} اس جملے میں پچھلی آیت کے جملے {’’ وَ  تَوَكَّلْ عَلَى اللّٰهِ ‘‘} کی مزید تفصیل و تاکید ہے۔ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو یقین دلایا کہ اگر ان کے ارادے میں فتور بھی ہے تب بھی آپ فکر نہ کریں، آپ کو اللہ تعالیٰ ہر طرح کافی ہے۔ آپ دیکھتے نہیں کہ اس نے کس طرح اپنی خاص نصرت کے ساتھ آپ کو قوت بخشی، اہل ایمان ساتھی عطا کیے، ان کی باہمی عداوتیں، جو آپ کے پوری زمین کی ہر چیز خرچ کرنے پر بھی دور نہیں ہو سکتی تھیں، اس نے اپنے خاص فضل سے دور کر کے ایمان کی بدولت ان کے دلوں میں الفت و محبت ڈال دی اور انھیں یک جان کر کے آپ کی پشت پر کھڑا کر دیا۔ وہ ہر چیز پر غالب ہے، مگر اس کا غلبہ اندھے کی لاٹھی نہیں، وہ کمال درجے کی حکمت بھی رکھتا ہے، اس لیے تم صرف اسی پر بھروسا رکھو۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63،62){ وَ اِنْ يُّرِيْدُوْۤا اَنْ يَّخْدَعُوْكَ …:} اس جملے میں پچھلی آیت کے جملے {’’ وَ  تَوَكَّلْ عَلَى اللّٰهِ ‘‘} کی مزید تفصیل و تاکید ہے۔ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو یقین دلایا کہ اگر ان کے ارادے میں فتور بھی ہے تب بھی آپ فکر نہ کریں، آپ کو اللہ تعالیٰ ہر طرح کافی ہے۔ آپ دیکھتے نہیں کہ اس نے کس طرح اپنی خاص نصرت کے ساتھ آپ کو قوت بخشی، اہل ایمان ساتھی عطا کیے، ان کی باہمی عداوتیں، جو آپ کے پوری زمین کی ہر چیز خرچ کرنے پر بھی دور نہیں ہو سکتی تھیں، اس نے اپنے خاص فضل سے دور کر کے ایمان کی بدولت ان کے دلوں میں الفت و محبت ڈال دی اور انھیں یک جان کر کے آپ کی پشت پر کھڑا کر دیا۔ وہ ہر چیز پر غالب ہے، مگر اس کا غلبہ اندھے کی لاٹھی نہیں، وہ کمال درجے کی حکمت بھی رکھتا ہے، اس لیے تم صرف اسی پر بھروسا رکھو۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) {يٰۤاَيُّهَا النَّبِيُّ حَسْبُكَ اللّٰهُ … :} اوپر فرمایا تھا کہ اللہ تعالیٰ آپ کو کافی ہے، اس سے شاید کوئی خیال کرتا کہ اللہ تعالیٰ کی تائید صرف رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خاص ہے، اس لیے یہاں دوبارہ اس جملے کو لا کر ساتھ مومنین کا بھی اضافہ کر دیا کہ اللہ تعالیٰ آپ کو اور آپ کی پیروی کرنے والے تمام مومنوں کو کافی ہے۔ {’’ وَ مَنِ اتَّبَعَكَ ‘‘} میں واؤ کا عطف {’’حَسْبُكَ ‘‘} کے کاف پر ہے، یعنی اللہ تعالیٰ تجھے اور تیرے پیچھے چلنے والے مومنوں کو کافی ہے۔ یہ واؤ بمعنی {’’ مَعَ ‘‘} بھی ہو سکتی ہے، یعنی اللہ تعالیٰ آپ کو مع آپ کے ساتھیوں کے سب کو کافی ہے۔ بعض لوگوں نے اس واؤ کا عطف لفظ {’’ اللّٰهُ ‘‘} پر ڈالا ہے، اس صورت میں ترجمہ ہو گا کہ تجھے اللہ کافی ہے اور وہ مومن کافی ہیں جو تیرے پیروکار ہیں، مگر یہ عطف اور ترجمہ سراسر غلط ہے، کیونکہ پورے قرآن و حدیث میں صرف اللہ تعالیٰ ہی پر توکل کرنے اور اسی کو کافی سمجھنے کا حکم دیا گیا ہے۔ قرآن مجید میں بہت سے مقامات پر صرف اللہ تعالیٰ پر توکل کا حکم ہے، فرمایا : «وَ عَلَى اللّٰهِ فَلْيَتَوَكَّلِ……» توکل کا یہ حکم {’’الْمُؤْمِنُوْنَ ‘‘} اور {’’ الْمُتَوَكِّلُوْنَ ‘‘} کے الفاظ کے ساتھ ۹ جگہ ہے اور فرمایا : «وَ عَلَى اللّٰهِ فَتَوَكَّلُوْۤا اِنْ كُنْتُمْ مُّؤْمِنِيْنَ» [ المائدۃ : ۲۳ ] ’’اور صرف اللہ پر بھروسا کرو، اگر تم مومن ہو۔‘‘ مخلوق تو خود اپنے لیے کافی نہیں، وہ دوسروں کو کیا کفایت کرے گی۔ مولانا ثناء اللہ امرتسری رحمہ اللہ ایسے مواقع پر ایک شعر لکھا کرتے تھے ¤ سنبھلتا نہیں جن سے اپنا دوپٹا ¤ سنبھالیں گے کیا وہ کلیجہ کسی کا ¤ ابراہیم علیہ السلام نے آگ میں پھینکے جانے کے وقت اور رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحابہ رضی اللہ عنہم نے احد کے بعد کفار کے جمع ہو کر دوبارہ حملہ آور ہونے کے موقع پر «حَسْبُنَا اللّٰهُ وَ نِعْمَ الْوَكِيْلُ » [ آل عمران : ۱۷۳ ] کہا۔ [بخاری، التفسیر، سورۃ آل عمران : ۴۵۶۳ ] رسول اللہ صلی اللہ علیہ وسلم نے یہ نہیں فرمایا کہ مجھے اللہ تعالیٰ اور میرے ساتھی کافی ہیں۔ خود اللہ تعالیٰ نے آپ کو حکم دیا : «فَاِنْ تَوَلَّوْا فَقُلْ حَسْبِيَ اللّٰهُ لَاۤ اِلٰهَ  اِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَ هُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ » [ التوبۃ : ۱۲۹ ] ’’پھر اگر وہ منہ موڑیں تو کہہ دے مجھے اللہ ہی کافی ہے، اس کے سوا کوئی معبود نہیں، میں نے اسی پر بھروسا کیا اور وہی عرش عظیم کا رب ہے۔‘‘ بلکہ اللہ تعالیٰ نے فرمایا : «اِنْ يَّنْصُرْكُمُ اللّٰهُ فَلَا غَالِبَ لَكُمْ وَ اِنْ يَّخْذُلْكُمْ فَمَنْ ذَا الَّذِيْ يَنْصُرُكُمْ مِّنْۢ بَعْدِهٖ وَ عَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ » [ آل عمران : ۱۶۰ ] ’’اگر اللہ تمھاری مدد کرے تو کوئی تم پر غالب آنے والا نہیں اور اگر وہ تمھارا ساتھ چھوڑ دے تو وہ کون ہے جو اس کے بعد تمھاری مدد کرے گا؟ اور اللہ ہی پر پھر لازم ہے کہ مومن بھروسا رکھیں۔‘‘"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) ➊ {حَرِّضِ الْمُؤْمِنِيْنَ عَلَى الْقِتَالِ …:} ’’تحریض‘‘ کا معنی خوب رغبت دلا کر کسیی کام پر ابھار دینا ہے۔ بعض اہل علم کا کہنا ہے کہ قرآن مجید میں جہاد کا ذکر تقریباً سات پاروں کے برابر بنتا ہے۔ کتب احادیث میں کتاب الجہاد اس کے فضائل سے بھری ہوئی ہیں۔ یہاں بیس مسلمانوں کو کفار کے دو سو آدمیوں پر غالب آنے کا حکم دیا جا رہا ہے۔ مگر یہ حکم خبر کی صورت میں ہے، کیونکہ یہ بات معروف ہے کہ حکم بہت تاکید کے ساتھ دینا ہو تو وہ خبر کے الفاظ میں دیا جاتا ہے، مثلاً یہ کہنا ہو ’’سب لوگ نماز کے لیے مسجد میں جائیں‘‘ تو کہا جاتا ہے ’’سب لوگ مسجد میں جائیں گے۔‘‘ یہاں بیس مسلمانوں کو کفار کے دو سو آدمیوں پر غالب آنے کا حکم دیا جا رہا ہے مگر خبر کے الفاظ میں کہ اگر تم میں سے بیس صابر ہوں تو وہ دو سو پر غالب آئیں گے۔ مراد یہ ہے کہ غالب آئیں۔ اس کی دلیل اگلی آیت ہے کہ اب اللہ نے تم سے تخفیف کر دی ہے، سو اگر تم میں سے ایک سو صابر ہوں تو وہ دو سو پر غالب آئیں گے۔ مراد یہ ہے کہ دو سو پر غالب آئیں، ظاہر ہے کہ تخفیف امر (حکم) میں ہوتی ہے، خبر میں نہیں۔ ان آیات میں خوش خبری بھی ہے مگر ایمان اور صبر کی شرط کے ساتھ۔ ¤ ➋ {بِاَنَّهُمْ قَوْمٌ لَّا يَفْقَهُوْنَ:} یعنی سمجھ سے کام نہیں لیتے، نہ ثواب یا شہادت کے حصول کی نیت ہوتی ہے، نہ عذاب سے بچنے کی، نہ ہی وہ کسی پائدار اور دائمی مقصد کے لیے لڑتے ہیں، اس لیے ان میں وہ جذبہ اور اخلاقی قوت موجود نہیں ہوتی جو انھیں میدانِ جنگ میں ڈٹے رہنے کا حوصلہ عطا کرے، لہٰذا یہ ان سرفروش مجاہدین کا کیسے مقابلہ کر سکتے ہیں جن کی بڑی تمنا شہادت کی فضیلت حاصل کرنا ہے؟ ¤ ➌ بیس کے دو سو پر غالب آنے کے بعد سو کے ہزار پر غالب آنے کے بیان میں یہ حکمت ہے کہ لشکر چھوٹا ہو یا بڑا، ہر ایک کو یہ حکم ہے اور ہر ایک سے نصرت کا وعدہ ہے۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) {اَلْـٰٔنَ خَفَّفَ اللّٰهُ عَنْكُمْ … :} اس آیت کی تفسیر میں ابن عباس رضی اللہ عنہما سے روایت ہے کہ جب گزشتہ آیت نازل ہوئی تو مسلمانوں کو اپنے سے دس گنا کفار کے مقابلے میں ڈٹے رہنے کا حکم دشوار معلوم ہوا، پھر تخفیف کا حکم آ گیا اور اپنے سے دو گنا کے مقابلے میں ثابت قدم رہنا واجب اور بھاگنا حرام قرار دے دیا گیا۔ [ بخاری، التفسیر، سورۃ الأنفال، باب : «الآن خفف اللہ عنکم … » : ۴۶۵۳ ] اگر کفار دو گنا سے زیادہ ہوں تو بھاگنا گناہ نہیں، لیکن لڑنا اور جمے رہنا بہر حال افضل ہے، جیسا کہ عہد نبوی اور خلفائے راشدین کے عہد کے واقعات سے معلوم ہوتا ہے۔ (ابن کثیر، قرطبی) اس آیت میں یہ خوش خبری بھی ہے کہ مسلمانوں کے لشکر ہزاروں تک جائیں گے۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67){مَا كَانَ لِنَبِيٍّ اَنْ يَّكُوْنَ لَهٗۤ اَسْرٰى …:} کسی نبی کے لیے جائز نہیں کہ وہ قیدی بنائے، پھر انھیں قید رکھے یا احسان کرے یا فدیہ لے، جب تک میدانِ جنگ میں خوب خون ریزی کے بعد کفر کی کمر نہ ٹوٹ جائے اور وہ دوبارہ مقابلے کے قابل نہ رہ جائیں، اس کے بعد قیدی بنانے میں کوئی حرج نہیں، لیکن مسلمانو ! تم نے بدر میں قیدی بنانے میں جلدی سے کام لیا، تم فدیے کی صورت میں دنیا کا سامان چاہتے تھے اور اللہ تعالیٰ تمھارے لیے اعلائے کلمۃ اللہ کے ذریعے سے آخرت کے ثواب کا ارادہ رکھتا تھا اور اللہ سب پر غالب، کمال حکمت والا ہے، تمھارا یہ عمل عزت و حکمت کے مطابق نہیں۔ دوسری جگہ فرمایا : «فَاِذَا لَقِيْتُمُ الَّذِيْنَ كَفَرُوْا فَضَرْبَ الرِّقَابِ حَتّٰۤى اِذَاۤ اَثْخَنْتُمُوْهُمْ فَشُدُّوا الْوَثَاقَ » [ محمد : ۴ ] ’’تو جب ان لوگوں سے ملو جنھوں نے کفر کیا تو گردنیں مارنا ہے، یہاں تک کہ جب انھیں خوب قتل کر چکو تو (ان کو) مضبوط باندھ لو۔‘‘ ¤ سن ۲ ہجری غزوۂ بدر میں قیدی بنانے میں عجلت کے بعد دوسری فر و گزاشت یہ ہوئی کہ قیدیوں کا فیصلہ اس وقت کے حالات کے لحاظ سے اللہ تعالیٰ کو پسند نہ آیا، کیونکہ اس وقت فدیہ لینے کے بجائے انھیں قتل کرنے سے کفر کی کمر مزید ٹوٹتی، اس لیے اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم سمیت تمام مسلمانوں پر ناراضگی کا اظہار فرمایا۔ عبد اللہ بن عباس رضی اللہ عنہما بیان کرتے ہیں کہ (جنگ بدر میں) جب قیدی گرفتار کر لیے گئے تو رسول اللہ صلی اللہ علیہ وسلم نے ابو بکر اور عمر رضی اللہ عنہما سے مشورہ فرمایا کہ ان قیدیوں کے متعلق تمھاری کیا رائے ہے ؟ ابو بکر رضی اللہ عنہ نے کہا : ’’اے اللہ کے نبی ! یہ ہمارے چچا زاد بھائی اور خاندان ہی کے لوگ ہیں، سو میری رائے تو یہ ہے کہ ان سے فدیہ لے لیا جائے، تاکہ ( اس رقم سے) کفار کے مقابلے میں قوت حاصل ہو اور کیا عجب کہ اللہ انھیں اسلام کی ہدایت دے دے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اے ابن خطاب! تمھاری کیا رائے ہے ؟‘‘ عمر رضی اللہ عنہ فرماتے ہیں : ’’میں نے کہا، اے اللہ کے رسول ! میری رائے ابو بکر کی رائے کے مطابق نہیں ہے، میری رائے تو یہ ہے کہ آپ ان کو ہمارے حوالے کیجیے، تاکہ ہم ان کی گردنیں اڑا دیں۔ عقیل کو علی کے حوالے کیجیے، تاکہ وہ اس کی گردن اڑائیں اور میرے حوالے فلاں کو کیجیے، تاکہ میں اس کی گردن اڑاؤں، اس لیے کہ یہ لوگ کفر کے سرغنے اور اس کے سردار ہیں۔ ( اکثر مسلمانوں کی رائے ابو بکر رضی اللہ عنہ کی رائے کے مطابق تھی، کچھ مالی فائدے کے پیش نظر اور کچھ انسانی اور رشتہ داری کی محبت کی وجہ سے) نبی صلی اللہ علیہ وسلم نے ابو بکر رضی اللہ عنہ کی رائے اختیار فرمائی اور میری رائے اختیار نہیں کی، پھر جب دوسرے دن کی صبح ہوئی، میں آیا تو دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم اور ابو بکر رضی اللہ عنہ بیٹھے رو رہے ہیں۔ میں نے کہا اے اللہ کے رسول! مجھے بھی بتائیے آپ اور آپ کے دوست کیوں رو رہے ہیں، تاکہ اگر مجھے رونا آئے تو میں بھی روؤں، ورنہ کم از کم آپ دونوں کے رونے کی وجہ سے رونے والی صورت ہی بنا لوں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’میں اس فیصلے کے مشورے کی وجہ سے رو رہا ہوں جو تمھارے ساتھیوں نے قیدیوں سے فدیہ لے کر چھوڑ دینے کے متعلق دیا تھا، اب میرے سامنے ان کا عذاب پیش کیا گیا جو اس درخت سے بھی قریب تھا۔‘‘ اور آپ کے قریب ایک درخت تھا۔‘‘ اور اللہ تعالیٰ نے یہ آیات نازل فرمائیں : «مَا كَانَ لِنَبِيٍّ اَنْ يَّكُوْنَ لَهٗۤ اَسْرٰى  حَتّٰى يُثْخِنَ فِي الْاَرْضِ» [ الأنفال : ۶۷] [مسلم، الجہاد، باب الإمداد بالملائکۃ فی غزوۃ بدر … : ۱۷۶۳ ] علی رضی اللہ عنہ فرماتے ہیں کہ جبریل علیہ السلام اترے اور آپ صلی اللہ علیہ وسلم سے کہا کہ اپنے ساتھیوں کو بدر کے قیدیوں کے متعلق اختیار دیں کہ انھیں قتل کر دیں یا فدیہ لے لیں، اس شرط پر کہ ان میں سے آئندہ اتنے ہی قتل کیے جائیں گے۔ انھوں نے فدیہ لینا اور آئندہ اپنے آدمیوں کی شہادت اختیار کی۔ [ ترمذی، السیر، باب ما جاء فی قتل الأساری و الفداء : ۱۵۶۷ وقال الألبانی صحیح ] یہ صورت چونکہ بہتر نہ تھی اس لیے اللہ تعالیٰ نے اس پر عتاب فرمایا۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) {لَوْ لَا كِتٰبٌ مِّنَ اللّٰهِ سَبَقَ …:} یہاں ’’ اللہ کی طرف سے لکھی ہوئی کتاب‘‘ سے مراد کئی باتیں ہو سکتی ہیں، ایک یہ کہ اگر اس امت کے لیے غنیمت حلال نہ کر دی گئی ہوتی، جیسا کہ بخاری کی حدیث (۳۳۵) [ وَ أُحِلَّتْ لِيَ الْغَنَائِمُ ] (اور میرے لیے غنیمتیں حلال کر دی گئیں) سے معلوم ہوتا ہے۔ ابن جریر رحمہ اللہ نے اسی کو پسند فرمایا۔ دوسری یہ کہ بدر میں جو صحابہ شریک ہوئے ان کے گناہ بخشے نہ جا چکے ہوتے وغیرہ۔ ( ابن کثیر، فتح القدیر) بعض اہل علم نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کا وجود عذاب نازل ہونے سے مانع تھا، جیسا کہ فرمایا : «وَ مَا كَانَ اللّٰهُ لِيُعَذِّبَهُمْ وَ اَنْتَ فِيْهِمْ» [ الأنفال : ۳۳ ] ’’اور اللہ کبھی ایسا نہیں کہ انھیں عذاب دے جب کہ تو ان میں ہو۔‘‘ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’وہ بات یہ لکھ چکا کہ ان قیدی لوگوں میں بہت سوں کی قسمت تھی مسلمان ہونا۔‘‘ ( موضح) الغرض اگر یہ باتیں پہلے نہ لکھی جا چکی ہوتیں تو تم پر عذاب نازل ہو جاتا۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69){فَكُلُوْا مِمَّا غَنِمْتُمْ حَلٰلًا طَيِّبًا …:} اللہ تعالیٰ کے ناراضگی کے اظہار سے یہ خیال پیدا ہوتا تھا کہ فدیے کا مال لینا اللہ تعالیٰ کو پسند نہیں، اللہ تعالیٰ نے اس شبے کو دور فرمایا کہ یہ بھی مال غنیمت ہے اور اس امت کے لیے حلال اور طیب ہے، سو اسے کسی شک و شبہ کے بغیر کھاؤ۔ اس سے {’’ لَوْ لَا كِتٰبٌ مِّنَ اللّٰهِ ‘‘} کی تفسیر ’’ اس امت کے لیے غنیمت حلال ہونے‘‘ کے قول کو تقویت ملتی ہے۔ {’’ وَ اتَّقُوا اللّٰهَ ‘‘} البتہ یہ اصل مقصود نہیں، بلکہ اصل مقصود اللہ کا تقویٰ ہے، اسے اختیار کرو، یقینا اللہ تعالیٰ بے حد بخشنے والا نہایت مہربان ہے۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) {قُلْ لِّمَنْ فِيْۤ اَيْدِيْكُمْ مِّنَ الْاَسْرٰۤى … :} جب بدر کے قیدی لائے گئے تو بعض نے اسلام کا اظہار کیا اور کہا کہ ہم نے مجبور کیے جانے پر جنگ میں شرکت کی تھی، ان میں عباس رضی اللہ عنہ بھی تھے، اس پر یہ آیت نازل ہوئی اور ان کو فدیے کی معافی نہیں دی گئی، بلکہ دل سے مسلمان ہونے کی صورت میں لیے گئے فدیے سے بہتر عطا اور مغفرت کا وعدہ کیا گیا۔ عباس رضی اللہ عنہ فرماتے ہیں : ’’اللہ کی قسم! یہ آیت میرے بارے میں اتری، جب میں نے رسول اللہ صلی اللہ علیہ وسلم کو اپنے اسلام لانے کی خبر دی اور درخواست کی کہ مجھ سے جو بیس اوقیہ فدیہ لیا گیا ہے اس کے بدلے میں مجھے کچھ دیں، تو آپ نے مجھے ان کے بدلے میں بیس غلام دیے جو سب میرے مال سے میرے لیے تجارت کر رہے ہیں، اس کے ساتھ میں اللہ جل ذکرہٗ سے مغفرت کی بھی امید رکھتا ہوں۔‘‘ [ مسند إسحاق بن راہویہ۔ تفسیر طبری۔ طبرانی وغیرہم ] {’’الاستيعاب في بيان الأسباب‘‘} میں بہت سے حوالے دے کر اسے حسن کہا گیا ہے۔ عباس رضی اللہ عنہ نے اپنے بھتیجے عقیل کا فدیہ بھی اپنے پاس سے دیا تھا۔ [ بخاری، الجہاد والسیر، باب فداء المشرکین : ۳۰۴۹ ]"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71){وَ اِنْ يُّرِيْدُوْا خِيَانَتَكَ … : } یعنی اگر وہ اسلام کا دعویٰ یا آئندہ آپ سے نہ لڑنے کا وعدہ صرف رہائی اور آپ کی ہمدردی حاصل کرنے کے لیے کر رہے ہیں اور ان کے دل میں کھوٹ ہے، تو پہلے انھوں نے اللہ کے ساتھ شرک اور رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جنگ کی خیانت کر کے کیا حاصل کر لیا، یہی کہ اللہ تعالیٰ نے آپ کو ان پر قابو عطا فرمایا، اب بھی ایسا ہی ہو گا۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے خوش خبری اور قیدیوں کے لیے وعید ہے۔ {’’ فَاَمْكَنَ ‘‘} کا مفعول محذوف ہے، یعنی {’’أَمْكَنَكَ مِنْهُمْ‘‘} کہ اس نے آپ کو ان پر قابو دے دیا۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) ➊ سورۂ انفال کے آخر میں ان آیات سے واضح ہوتا ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں مسلمان چار قسم کے تھے، پہلے وہ جو پہلی ہجرت کرنے والے مہاجرین اولین ہیں، دوسرے انصار مدینہ، تیسرے وہ مومن جنھوں نے ہجرت نہیں کی اور چوتھے وہ جنھوں نے صلح حدیبیہ کے بعد ہجرت کی۔ ¤ ➋ { اِنَّ الَّذِيْنَ اٰمَنُوْا وَ هَاجَرُوْا … :} ان سے مراد اولین مہاجر ہیں جو سب سے افضل ہیں۔ ¤ ➌ {وَ الَّذِيْنَ اٰوَوْا وَّ نَصَرُوْۤا:} یہ انصار ہیں، ان کی فضیلت بھی بے شمار ہے، مگر اس بات پر اتفاق ہے کہ مہاجرین انصار سے افضل ہیں۔ عبد اللہ بن زید بن عاصم رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اگر ہجرت ( کی فضیلت) نہ ہوتی تو میں انصار میں سے ایک شخص ہوتا۔‘‘ [ بخاری، المغازی، باب غزوۃ الطائف… : ۴۳۳۰ ] ¤ ➍ { اُولٰٓىِٕكَ بَعْضُهُمْ اَوْلِيَآءُ بَعْضٍ: ’’ اَوْلِيَآءُ ‘‘} سے مراد دوست، حمایتی اور مدد گار بھی ہو سکتے ہیں اور ایک دوسرے کے وارث بھی۔ دوسرے مفہوم کے مطابق اشارہ ہو گا اس مؤاخات ( بھائی چارے) کی طرف جو رسول اللہ صلی اللہ علیہ وسلم نے ہجرت کے بعد مہاجرین و انصار کے درمیان قائم کیا، جس کی بنا پر جاہلیت کے رواج کے مطابق آپس میں بھائی بننے والے ایک دوسرے کے وارث ہوتے تھے، یہاں تک کہ میراث کی آیت : «وَ اُولُوا الْاَرْحَامِ بَعْضُهُمْ اَوْلٰى بِبَعْضٍ فِيْ كِتٰبِ اللّٰهِ » [الأنفال : ۷۵ ] نازل ہوئی تو یہ طریقہ منسوخ ہو گیا۔ ¤ ➎ { وَ الَّذِيْنَ اٰمَنُوْا وَ لَمْ يُهَاجِرُوْا:} یہ اس عہد کے مسلمانوں کی تیسری قسم ہے۔ دار الاسلام قائم ہونے کے باوجود اس کی طرف ہجرت نہ کرنے اور کفار کی غلامی میں رہنے پر قناعت کا مطلب یہ ہے کہ ان کا ایمان کچا ہے، یہ لوگ جہاد میں حصہ لے ہی نہیں سکتے، اس لیے ان کے ساتھ پہلے دو فریقوں جیسی دوستی اور حمایت کسی طرح بھی نہیں ہو سکتی، جب تک ہجرت نہ کریں۔ ¤ ➏ {وَ اِنِ اسْتَنْصَرُوْكُمْ فِي الدِّيْنِ …:} مثلاً کافر ان پر ظلم کر رہے ہوں اور وہ تم سے مدد مانگیں تو تم پر انھیں ظالموں کے پنجے سے چھڑانا فرض ہے، فرمایا : «وَ مَا لَكُمْ لَا تُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ وَ الْمُسْتَضْعَفِيْنَ مِنَ الرِّجَالِ وَ النِّسَآءِ وَ الْوِلْدَانِ الَّذِيْنَ يَقُوْلُوْنَ رَبَّنَاۤ اَخْرِجْنَا مِنْ هٰذِهِ الْقَرْيَةِ الظَّالِمِ اَهْلُهَا » [ النساء : ۷۵ ] ’’اور تمھیں کیا ہے کہ تم اللہ کے راستے میں اور ان بے بس مردوں اور عورتوں اور بچوں کی خاطر نہیں لڑتے جو کہتے ہیں کہ اے ہمارے رب! ہمیں اس بستی سے نکال لے جس کے رہنے والے ظالم ہیں۔‘‘ ¤ ➐ { اِلَّا عَلٰى قَوْمٍۭ بَيْنَكُمْ وَ بَيْنَهُمْ مِّيْثَاقٌ:} یعنی اگر تمھارا کفار سے کوئی معاہدہ ہو کہ آپس میں ایک دوسرے سے جنگ نہیں کریں گے تو تم معاہدے کو پس پشت ڈالتے ہوئے ان کی مدد نہیں کر سکتے، بلکہ ان مسلمانوں سے یہی کہا جائے گا کہ ’’دارالکفر‘‘ کو چھوڑ کر ’’دارالاسلام‘‘ میں چلے آئیں۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) ➊ {وَ الَّذِيْنَ كَفَرُوْا بَعْضُهُمْ اَوْلِيَآءُ بَعْضٍ:} یعنی کافر آپس میں خواہ جتنی بھی دشمنی رکھتے ہوں تمھارے خلاف سب کے سب ایک دوسرے کے مدد گار اور حمایتی ہیں۔ کافر، کافر ہی کا دوست ہے، مسلمان کا نہیں، اس لیے مسلمان اور کافر کا آپس میں موالات (دوستی، حمایت اور مدد) کا رشتہ کسی صورت نہیں ہو سکتا۔ ¤ ➋ { اِلَّا تَفْعَلُوْهُ:} یعنی اگر تم آپس میں محبت، حمایت اور نصرت نہیں کرو گے اور کفار سے ترک موالات نہیں کرو گے، یعنی ان کے ساتھ باہمی محبت، تعاون اور ایک دوسرے کا وارث بننا نہیں چھوڑو گے اور قطع تعلق نہیں کرو گے تو زمین میں بڑا فتنہ اور بہت بڑا فساد ہو گا۔ اسامہ بن زید رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مسلمان کافر کا وارث نہیں بنتا، نہ کافر مسلمان کا وارث بنتا ہے۔‘‘ [ بخاری، الفرائض، باب لا یرث المسلم الکافر … : ۶۷۶۴۔ مسلم : ۱۶۱۴ ] ¤ ➌ {تَكُنْ فِتْنَةٌ فِي الْاَرْضِ وَ فَسَادٌ كَبِيْرٌ:} یعنی مسلمانوں کے راز افشا ہوتے رہیں گے، آئے دن جنگ رہے گی، کفار کے خلاف مسلمانوں کے یک جان نہ ہونے سے اسلام اور مسلمان کمزور ہوں گے، ان کا رعب جاتا رہے گا، کفار غالب آئیں گے، تو ان کے ساتھ رہنے والے مسلمان مجبوراً مرتد ہو جائیں گے، یا ان کے رسوم و رواج، عقائد اور اعمال قبول کریں گے، یا ان پر خاموش رہیں گے، یا شدید آزمائش کا شکار ہوں گے۔ غرض کفار کے غلبے اور ان کے ساتھ رہ کر ان کی غلامی پر قناعت یا ان سے دوستی کی صورت میں اللہ کی زمین پر امن کسی صورت قائم نہیں رہ سکتا، بلکہ ہر طرف فتنہ و فساد، جنگ و جدل، شرک و کفر، بے حیائی اور بدکاری ہی کا دور دورہ ہو گا۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) {وَ الَّذِيْنَ اٰمَنُوْا وَ هَاجَرُوْا … :} اس آیت میں مسلمانوں کے پہلے دو گروہوں، یعنی مہاجرین اولین اور انصار کی تعریف فرمائی ہے، کیونکہ پہلے ان کا ذکر باہمی دوستی اور تعاون کی تاکید کے لیے تھا۔ اس آیت میں ان کی تعریف تین طرح سے کی ہے، پہلا تو یہ کہ یہ لوگ ایمان، ہجرت، جہاد اور اہل ایمان کو جگہ دینے اور نصرت کی وجہ سے پکے مومن ہیں، بخلاف ان کے جو ایمان تو لائے مگر ہجرت نہیں کی، جس کی وجہ ان کے ایمان کی خامی ہے۔ دیکھیے سورۂ نساء (۹۷) حقیقت یہ ہے کہ اللہ تعالیٰ کی طرف سے ان مہاجرین و انصار کے لیے «اُولٰٓىِٕكَ هُمُ الْمُمُؤْمِنُوْنَ حَقًّا» بہت بڑی سند ہے۔ دوسرا ان کے لیے عظیم مغفرت اور بخشش ہے۔ {’’ مَغْفِرَةٌ ‘‘} میں تنوین تعظیم کے لیے ہے۔ تیسرا یہ کہ ان کے لیے رزق کریم ہے، اس میں جنت کی بے شمار نعمتوں کے ساتھ دنیا میں باعزت روزی کا وعدہ ہے۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں کہ دنیا میں عزت کی روزی سے مراد مال غنیمت اور فے ہے، جو خالص ان لوگوں کا حق ہے جو سردار کے ساتھ شریک جنگ ہوں۔ (موضح)"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) ➊ {وَ الَّذِيْنَ اٰمَنُوْا مِنْۢ بَعْدُ … :} اس آیت میں مسلمانوں کے چوتھے گروہ کا ذکر ہے جنھوں نے صلح حدیبیہ کے بعد یا بدر کے بعد، جب اسلام ایک طاقت بن گیا، ایمان لا کر ہجرت کی، یہ لوگ بھی مہاجرین اولین اور انصار کے ساتھی شمار ہوں گے، اگرچہ سبقت کی وجہ سے پہلوں کا درجہ ان سے مقدم ہے، فرمایا : «وَ السّٰبِقُوْنَ السّٰبِقُوْنَ» [ الواقعۃ : ۱۰ ] ’’اور جو پہل کرنے والے ہیں، وہی آگے بڑھنے والے ہیں۔‘‘ مگر بخاری (۶۱۶۸) اور مسلم (۲۶۴۰) کی حدیث [ اَلْمَرْءُ مَعَ مَنْ أَحَبَّ ] (قیامت کے دن انسان اسی کے ساتھ ہو گا جس سے محبت اور دوستی رہی ہے) کی رو سے ان کا شمار انھی میں ہو گا۔ [فَاُولٰٓىِٕكَ مِنْكُمْ] ¤ ➋ { وَ اُولُوا الْاَرْحَامِ بَعْضُهُمْ اَوْلٰى بِبَعْضعْضٍ:} یعنی اب آئندہ سے میراث دینی بھائی چارے کی بنا پر نہیں بلکہ رشتہ داری کی بنا پر تقسیم ہو گی، کیونکہ ایمان، ہجرت اور جہاد کے ساتھ ساتھ رشتہ داری ان کے قرب کی ایک زائد وجہ ہے۔ اس سے وہ طریقہ منسوخ ہو گیا جس میں مہاجرین و انصار ایک دوسرے کے وارث بنتے تھے۔ (ابن کثیر) ¤ ➌ { اِنَّ اللّٰهَ بِكُلِّ شَيْءٍ عَلِيْمٌ:} وہی جانتا ہے کہ کس کا حق پہلے اور کس کا بعد میں ہے، لہٰذا اس کے تمام احکام سراسر علم و حکمت پر مبنی ہیں۔"
    }
  ]
}