{
  "surah": "Al-Tawba",
  "surah_number": 9,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "یہ پوری کی پوری سورت مدنی ہے جو فتح مکہ کے بعد ۹ھ میں نازل ہوئی۔ چونکہ سورۂ توبہ اور انفال میں ذکر ہونے والے واقعات ایک دوسرے سے ملتے جلتے ہیں، اس لیے ان دونوں سورتوں کو ایک سورت کے حکم میں رکھا گیا ہے اور ان دونوں کے درمیان ’’بسم اللہ الرحمن الرحیم‘‘ نہیں لکھی گئی اور یہ سبع طوال ( سات لمبی سورتوں) میں سے ساتویں سورت ہے، جن کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ أَخَذَ السَّبْعَ الْأَوَلَ مِنَ الْقُرْآنِ فَهُوَ حَبْرٌ ] ’’جس نے قرآن مجید کی یہ پہلی سات سورتیں حاصل کر لیں وہ بہت بڑا عالم بن گیا۔‘‘ [ أحمد : 82/6، ح : ۲۴۵۸۵، عن عائشۃ رضی اللہ عنہا] ¤ اس کے کئی نام ہیں جن میں سے ایک ’’توبہ‘‘ اور دوسرا ’’براء ۃ‘‘ ہے۔ ’’ توبہ‘‘ اس اعتبار سے کہ اس میں ایک مقام پر بعض اہل ایمان کی توبہ قبول ہونے کا ذکر ہے اور ’’ براء ۃ ‘‘ اس لحاظ سے کہ اس کے شروع میں مشرکین سے براء ت کا اعلان کیا گیا ہے۔ اس کے علاوہ اس کو ’’سورۃ الفاضحہ‘‘ یعنی ( منافقوں کو) رسوا کرنے والی سورت بھی کہتے ہیں۔ اس سورت کے شروع میں ’’ بسم اللہ الرحمن الرحیم‘‘ نہیں لکھی جاتی، مفسرین نے اس کی متعدد وجوہ بیان کی ہیں، مثلاً یہ کہ اس میں مشرکین سے قطع تعلق اور مسلمان نہ ہونے کی صورت میں ان کے قتل کا حکم ہے اور اہل کتاب کے مسلمان نہ ہونے یا جزیہ نہ دینے کی صورت میں ان سے مسلسل لڑتے رہنے کا حکم ہے وغیرہ، مگر سب سے معقول اور سیدھی سادی بات یہ ہے کہ چونکہ نبی صلی اللہ علیہ وسلم نے اس کے شروع میں ’’بسم اللہ الرحمن الرحیم‘‘ نہیں لکھوائی اس لیے صحابہ کرام رضی اللہ عنہم نے نہیں لکھی۔ ¤ (آیت 1){ بَرَآءَةٌ مِّنَ اللّٰهِ وَ رَسُوْلِهٖۤ …:} اللہ تعالیٰ نے اس آیت میں ان تمام معاہدوں کی تنسیخ کا اعلان فرمایا ہے جو مسلمانوں نے مشرکوں سے کیے تھے۔ منسوخ کرنے کی وجہ یہ تھی کہ مشرکین ان عہد ناموں کو بار بار توڑ دیتے تھے اور ان کی شرائط کو پورا نہیں کرتے تھے، خصوصاً جب آپ صلی اللہ علیہ وسلم فتح مکہ کے بعد تبوک گئے تو کفار نے سمجھا کہ مسلمان رومیوں کی طاقت کے مقابلے میں فنا ہو جائیں گے، اس لیے انھوں نے رسول اللہ صلی اللہ علیہ وسلم اور مسلمامانوں سے کیے ہوئے کسی عہد کا لحاظ رکھا نہ باہمی رشتہ داری کا، فرمایا : «لَا يَرْقُبُوْنَ فِيْ مُؤْمِنٍ اِلًّا وَّ لَا ذِمَّةً» [ التوبۃ : ۱۰ ] ’’یہ لوگ کسی مومن کے بارے میں نہ کسی قرابت کا لحاظ کرتے ہیں اور نہ کسی عہد کا۔‘‘اور فرمایا : «اَلَا تُقَاتِلُوْنَ قَوْمًا نَّكَثُوْۤا اَيْمَانَهُمْ » [ التوبۃ : ۱۳ ] ’’کیا تم ان لوگوں سے نہ لڑو گے جنھوں نے اپنی قسمیں توڑ دیں۔‘‘ مگر اللہ تعالیٰ کا خاص کرم دیکھو کہ ان مشرکین کو اچانک حملہ کر کے برباد کرنے کے بجائے پہلے تمام عہد منسوخ کرنے کا اعلان دنیا کے سب سے بڑے مجمع میں کیا گیا۔ ۹ھ میں ابو بکر صدیق رضی اللہ عنہ کی زیر امارت حج کے دن دس ذوالحجہ یوم نحر کو میدان منیٰ میں دنیا بھر سے آئے ہوئے لوگوں کی موجودگی میں اعلان ہوا اور کئی آدمی مقرر کیے گئے، جنھوں نے اس مجمع کے ہر مقام پر پہنچ کر بلند آواز کے ساتھ یہ اعلان کیا۔ اس سال رسول اللہ صلی اللہ علیہ وسلم کے خود حج پر نہ جانے کی وجہ یہ تھی کہ اس اعلان کے بعد ہی مکہ میں مشرکوں کا داخلہ بند ہوا اور ان کی بے حیائی کی رسمیں ختم ہوئیں۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { فَسِيْحُوْا فِي الْاَرْضِ اَرْبَعَةَ اَشْهُرٍ:} یہ اللہ تعالیٰ کا مزید کرم تھا کہ مشرکین کو اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی طرف سے چار ماہ کی مہلت دی گئی، جس کی ابتدا ۱۰ ذوالحجہ یوم النحرسے ہوئی، کیونکہ اس دن یہ اعلان کیا گیا اور ۱۰ ربیع الثانی کو یہ مدت ختم ہو گئی۔ اس مہلت کا مقصد یہ تھا کہ وہ اتنی مدت میں اپنے بارے میں خوب سوچ سمجھ لیں، پھر یا تو مسلمان ہو جائیں یا سر زمین عرب سے باہر کسی ملک میں اپنا ٹھکانا بنا لیں۔ اگر وہ اس کے بعد بھی باقی رہیں تو انھیں پکڑ کر، گھیر کر، گھات لگا کر جیسے بھی ممکن ہو قتل کر دیا جائے۔ یہ چار ماہ کی مدت ان لوگوں کے لیے تھی جن سے معاہدے کی مدت چار ماہ سے کم باقی تھی، یا معاہدہ تو زیادہ مدت کا تھا مگر انھوں نے اس کی خلاف ورزی کی تھی، یا مدت کے تعین کے بغیر معاہدہ تھا، البتہ وہ قبائل جن سے کسی خاص مدت تک معاہدہ تھا اور انھوں نے معاہدے کی کسی قسم کی مخالفت بھی نہ کی تھی ان کا عہد ان کی مدت تک پورا کرنے کا حکم دیا گیا، فرمایا : «فَاَتِمُّوْۤا اِلَيْهِمْ عَهْدَهُمْ اِلٰى مُدَّتِهِمْ » [ التوبۃ : ۴ ] ’’تو ان کے ساتھ ان کا عہد ان کی مدت تک پورا کرو۔‘‘ ¤ ➋ { وَ اعْلَمُوْۤا اَنَّكُمْ غَيْرُ مُعْجِزِي اللّٰهِ … :} مشرکوں کو مخاطب کر کے فرمایا کہ یہ مہلت مسلمانوں کی کمزوری کی وجہ سے نہیں دی گئی بلکہ اس میں کئی حکمتیں ہیں، ورنہ تم لوگ کبھی بھی اللہ تعالیٰ کو عاجز کرنے والے نہیں، اگر تم کفر پر قائم رہے تو خوب جان لو کہ اللہ تعالیٰ کافروں کو ذلیل و رسوا کرنے والا ہے۔ دیکھیے سورۂ انفال کی آیت (۵۹) کے حواشی۔ غرض صرف بیت اللہ ہی نہیں پورے جزیرۂ عرب کو مشرکین کے نجس وجود سے پاک کر دیا گیا۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {وَ اَذَانٌ مِّنَ اللّٰهِ وَ رَسُوْلِهٖۤ اِلَى النَّاسِ … :} یوم حج اکبر سے مراد ۱۰ ذوالحجہ ہے، جس دن حاجی منیٰ میں آکر قربانی کرتے ہیں۔ ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ابو بکر رضی اللہ عنہ نے مجھے ان لوگوں کے ہمراہ بھیجا جو قربانی کے دن منیٰ میں اعلان کریں کہ اس سال کے بعد کوئی مشرک حج نہیں کر ے گا اور کوئی ننگا شخص بیت اللہ کا طواف نہیں کرے گا اور حج اکبر کا دن یوم النحر(قربانی کا دن) ہے، کیونکہ لوگ ( عمرے کو) حج اصغر کہتے تھے، چنانچہ ابو بکر صدیق رضی اللہ عنہ نے اس سال صاف اعلان کروا دیا، تو حجۃ الوداع جس میں نبی کریم صلی اللہ علیہ وسلم نے حج کیا، کسی مشرک نے حج نہیں کیا۔ [ بخاری، الجزیۃ و الموادعۃ، باب کیف ینبذ إلی أہل العھد ؟ : ۳۱۷۷ ] ¤ اس سے معلوم ہوا کہ بعض لوگ جو اس حج کو حج اکبر کہتے ہیں جو جمعہ کے دن آئے ان کی بات درست نہیں۔ ابوہریرہ رضی اللہ عنہ ہی سے ایک روایت میں مزید اضافہ ہے کہ پہلے آپ صلی اللہ علیہ وسلم نے ابو بکر رضی اللہ عنہ کو یہ اعلان دے کر بھیجا، پھر آپ نے ان کے بعد علی رضی اللہ عنہ کو بھیجا کہ وہ (رسول اللہ صلی اللہ علیہ وسلم کی طرف سے) یہ اعلان کریں، چنانچہ ابو بکر رضی اللہ عنہ ، جو امیر حج تھے، ان کے حکم پر میں نے، میرے ساتھیوں نے اور علی رضی اللہ عنہ نے منیٰ میں یہ اعلان کیا۔ [ بخاری، التفسیر، باب قولہ : « و أذان من اللہ …» : ۴۶۵۶ ] مسند احمد میں ہے کہ چار ماہ کی مہلت دینے، ننگے کو طواف کی اجازت ختم کرنے اور آئندہ سال کسی مشرک کے حج نہ کرنے کے اعلان کے ساتھ ایک اعلان یہ بھی کرتے تھے کہ جنت میں ایمان والوں کے سوا کوئی داخل نہیں ہو گا۔ [ أحمد :299/2، ح : ۷۹۹۶ ] ¤ ➋ { وَ اِنْ تَوَلَّيْتُمْ فَاعْلَمُوْۤا …:} یہ اعلان تاکید کے لیے دوبارہ کیا گیا، تا کہ کافر اپنے آپ کو اللہ کی پکڑ سے کسی طرح بھی بچ نکلنے والے نہ سمجھیں۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4){ اِلَّا الَّذِيْنَ عٰهَدْتُّمْ مِّنَ الْمُشْرِكِيْنَ … :} یعنی معاہدوں کی پاس داری میںں کوئی کمی نہ کرنے والے مشرکوں کے لیے چار ماہ کی مہلت نہیں بلکہ ان کے لیے معاہدے کی طے کردہ مدت پوری کرو، کیونکہ تقوے کا تقاضا عہد پورا کرنا ہے اور اللہ متقین سے محبت رکھتا ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {فَاِذَا انْسَلَخَ الْاَشْهُرُ الْحُرُمُ … :} ان چار مہینوں سے مراد ۱۰ ذوالحجہ سے ۱۰ ربیع الثانی تک کے ایام ہیں۔ بعض لوگوں نے اس سے معروف حرمت والے مہینے مراد لیے ہیں، یعنی رجب، ذوالقعدہ، ذوالحجہ اور محرم۔ ۱۰ ذوالحجہ کو اعلان براء ت ہو تو محرم ختم ہونے تک کل پچاس دن بنتے ہیں، اس لیے حافظ ابن کثیر اور دوسرے مفسرین نے ۱۰ ذوالحجہ سے ۱۰ ربیع الثانی تک ہی چار ماہ مراد لیے ہیں اور انھیں {’’ الْاَشْهُرُ الْحُرُمُ ‘‘} اس لیے کہا گیا کہ اس مہلت میں مشرکین کا قتل حرام کر دیا گیا، یہی تفسیر درست ہے۔ ¤ ➋ { كُلَّ مَرْصَدٍ:} گھات کی جگہ سے مراد وہ راستہ یا جگہ ہے جہاں سے دشمن کے گزرنے کی توقع ہو اور جہاں سے اس پر حملہ کر کے اس کا کام تمام کرنا ممکن ہو۔ مطلب یہ ہے کہ ان مشرکین سے صرف میدان جنگ میں لڑنا ہی کافی نہیں، بلکہ جس طریقے سے بھی تم ان پر قابو پا کر انھیں قتل کر سکتے ہو ضرور کرو۔ ¤ ➌ {فَاِنْ تَابُوْا وَ اَقَامُوا الصَّلٰوةَ … :} شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ جن سے وعدہ ٹھہر گیا تھا اور دغا ان سے نہ دیکھی ان کی صلح قائم رہی اور جن سے کچھ وعدہ نہ تھا ان کو فرصت ملی چار مہینے اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ دل کی خبر اللہ کو ہے، ظاہر میں جو مسلمان ہو وہ سب کے برابر امان میں ہے اور ظاہر مسلمانی کی حد ٹھہرائی ایمان لانا، کفر سے توبہ کرنا اور نماز اور زکوٰۃ۔ اس واسطے جب کوئی شخص نماز چھوڑ دے تو اس سے امان اٹھ گئی۔‘‘ (موضح) یہی وہ حکم ہے جس کی بنا پر ابو بکر صدیق رضی اللہ عنہ نے زکوٰۃ کے منکرین سے جنگ کی اور فرمایا کہ میں اس شخص سے ضرور لڑوں گا جو نماز اور زکوٰۃ میں فرق کرے گا اور عبد اللہ بن عمر رضی اللہ عنہما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھے حکم دیا گیا ہے کہ میں لوگوں سے لڑائی کروں، یہاں تک کہ وہ لا الٰہ الا اللہ اور محمد رسول اللہ کی گواہی دیں اور نماز قائم کریں اور زکوٰۃ ادا کریں، پھر جب وہ یہ ( تین) کام کر لیں تو انھوں نے اپنے خون اور اپنے مال مجھ سے محفوظ کر لیے، مگر اسلام کے حق کے ساتھ اور ان کا حساب اللہ پر ہے۔‘‘ [ بخاری، الإیمان، باب : « فإن تاابوا و أقاموا الصلاۃ…» : ۲۵ ] ¤ یاد رہے کہ رسول اللہ صلی اللہ علیہ وسلم کی رسالت کی شہادت میں آپ کے تمام احکام کی فرماں برداری کا اقرار آ جاتا ہے، اگر ان میں سے کسی حکم کا انکار کرے، جو عام سب کو معلوم ہے کہ وہ اللہ اور اس کے رسول کا حکم ہے تو مرتد ٹھہرے گا اور اگر کسی حکم کا انکار تو نہ کرے مگر عمل نہ کر سکے تو گناہ گار مسلمان ہو گا، کافر نہیں ہو گا۔ البتہ مسلمان ہونے کی ظاہری نشانیاں وہ ہیں جو اوپر ذکر ہوئیں، ان کا صرف اقرار کرنا یا دل میں ماننا کافی نہیں، بلکہ ان پر عمل کرنا خون اور مال کی حفاظت کا ضامن ٹھہرایا گیا ہے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {وَ اِنْ اَحَدٌ مِّنَ الْمُشْرِكِيْنَ اسْتَجَارَكَ … :} یعنی امن کی مدت گزرنے کے بعد اگر کوئی مشرک، جس سے تمھارا کوئی عہد نہیں، تم سے درخواست کرے کہ مجھے اپنے ہاں پناہ دو تو اسے پناہ دے دو، تاکہ وہ اللہ کا کلام سنے اور اگر آیا ہی اسلام کو سمجھنے یا اپنے شبہات دور کرنے کے لیے ہے تو اسے بدرجۂ اولیٰ پناہ دینی چاہیے۔ اب اگر وہ اسلام لانے کے لیے آمادہ نہ ہو اور اپنے ٹھکانے پر واپس جانا چاہے تو تم اسے اس کے ٹھکانے پر پہنچا دو، کیونکہ ان لوگوں کو اسلام کی حقیقت معلوم نہیں، ممکن ہے وہ اللہ اور اس کے رسول کی باتیں سن کر، ان کا معاشرہ اور اخلاق و کردار دیکھ کر مسلمان ہو جائیں، پھر جب وہ اپنے ٹھکانے پر پہنچ جائے تو دوسرے مشرکین کی طرح اسے مارنا اور قتل کرنا جائز ہے، اس سے پہلے جائز نہیں۔ یہ حکم ہمیشہ کے لیے ہے اور کوئی بھی مسلمان ہو وہ کافر کو پناہ دے سکتا ہے، خواہ مسلمانوں میں اس کی حیثیت معمولی ہو اور تمام مسلمانوں پر یہ پناہ پوری کرنا لازم ہے۔ فتح مکہ کے موقع پر ام ہانی رضی اللہ عنہا نے ایک مشرک کو پناہ دی، پھر نبی صلی اللہ علیہ وسلم کی خدمت میں آکر یہ واقعہ بیان کیا تو آپ نے فرمایا : ’’ہم نے اسے پناہ دی جسے تم نے پناہ دی، ہم نے اسے امان دی جسے تم نے امان دی۔‘‘ [ أبو داوٗد، الجہاد، باب فی أمان المرأ ۃ : ۲۷۶۳۔ بخاری : ۳۵۷ ] ¤ ➋ { حَتّٰى يَسْمَعَ كَلٰمَ اللّٰهِ:} اس سے معلوم ہوتا ہے کہ مشرکین کو پناہ دینے سے اصل مقصود دعوت دین، قرآن سنانا اور اسلام کا تعارف کروانا ہے، پھر اگر وہ مسلمان نہ ہوں تو انھیں جلدی رخصت کر دینا چاہیے، یہ نہیں کہ وہ اپنے اڈے بنا کر جاسوسی کریں اور مسلمانوں کو نقصان پہنچائیں۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { كَيْفَ يَكُوْنُ لِلْمُشْرِكِيْنَ۠ عَهْدٌ … :} یعنی وہ لوگ جو ہیں ہی مشرک، جنھوں نے اپنے خالق کی توحید کا عہد ہی پورا نہیں کیا، ان کی طرف سے کوئی عہد پورا ہونا کیسے ممکن ہے، وہ تو جو عہد کرتے ہیں توڑ ڈالتے ہیں۔ ¤ ➋ { اِلَّا الَّذِيْنَ عٰهَدْتُّمْ عِنْدَ الْمَسْجِدِ الْحَرَامِ:} ان سے مراد وہی لوگ ہیں جن کا ذکر پہلے «اِلَّا الَّذِيْنَ عٰهَدْتُّمْ مِّنَ الْمُشْرِكِيْنَ ثُمَّ لَمْ يَنْقُصُوْكُمْ شَيْـًٔا وَّ لَمْ يُظَاهِرُوْا عَلَيْكُمْ اَحَدًا فَاَتِمُّوْۤا اِلَيْهِمْ عَهْدَهُمْ اِلٰى مُدَّتِهِمْ » [ التوبۃ : ۴ ] میں گزر چکا ہے۔ صلح حدیبیہ جو رسول اللہ صلی اللہ علیہ وسلم اور کفار قریش کے درمیان دس سال کے لیے قرار پائی، یہ صلح نامہ چونکہ حدیبیہ کے مقام پر قرار پایا تھا جو حدود حرم کے قریب ہے، اس لیے اسے {’’ عِنْدَ الْمَسْجِدِ الْحَرَامِ ‘‘} فرما دیا۔ (ابن کثیر) مطلب یہ ہے کہ جو لوگ اس عہد پر قائم رہے ان سے قتال مت کرو۔ اس معاہدے میں شرط یہ تھی کہ ایک دوسرے پر حملہ آور نہیں ہوں گے اور نہ دوسرے کے خلاف کسی کی مدد کریں گے۔ اس معاہدے میں بنو خزاعہ مسلمانوں کے ساتھ شامل تھے اور بنو بکر قریش کے حلیف تھے، مگر کچھ عرصہ بعد بنو بکر اور بنو خزاعہ کے درمیان لڑائی چھڑ گئی اور مشرکین نے معاہدے کی خلاف ورزی کرتے ہوئے بنو خزاعہ کے خلاف بنو بکر کی مدد کی، اس لیے رسول اللہ صلی اللہ علیہ وسلم نے رمضان ۸ھ کو مکہ پر حملہ کر کے اسے فتح کر لیا۔ (ابن کثیر) ابن جریر طبری نے اس بات کو ترجیح دی ہے کہ اس سے مراد بنو بکر کے وہ قبائل ہیں جو صلح حدیبیہ والے اپنے عہد پر قائم رہے اور انھوں نے بنو خزاعہ پر نہ حملہ کیا، نہ اس میں مدد کی، کیونکہ ان آیات کے نزول کے وقت فتح مکہ کو ایک سال گزر چکا تھا، قریش کو ان کی بد عہدی کی سزا بھی مل چکی تھی۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’صلح والے تین قسم فرمائے، ایک جن سے مدت نہیں ٹھہری، ان کو جواب دیا (کہ تم کو چار ماہ کی مہلت دی جاتی ہے) مگر جو مکے کی صلح میں شامل تھے (تو) جب تک وہ دغا نہ کرے، یہ ادب ہے مکہ کا اور تیسرے جن سے مدت ٹھہری وہ صلح قائم رہی، لیکن آخر سب مشرک عرب کے ایمان لائے۔‘‘ (موضح) {’’اسْتَقَامُوْا ‘‘} میں حروف ’’سین‘‘ اور ’’تا‘‘ کی زیادتی کی وجہ سے ترجمہ ’’پوری طرح قائم رہیں‘‘ کیا گیا ہے۔ ¤ ➌ {اِنَّ اللّٰهَ يُحِبُّ الْمُتَّقِيْنَ:} اور عہد کا پورا کرنا بھی متقی ہونے کے لیے ضروری شرط ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) {كَيْفَ وَ اِنْ يَّظْهَرُوْا عَلَيْكُمْ لَا يَرْقُبُوْا …:} مشرکین سے ’’ براء ت‘‘ کی وجہ بیان کرتے ہوئے فرمایا کہ ان کے معاہدے کا کوئی اعتبار نہیں، یہ لوگ زبان سے دوستی اور وفاداری کی میٹھی میٹھی باتیں کرتے ہیں اور دل میں یہ ہے کہ اگر کبھی موقع مل جائے تو معاہدے کو پس پشت ڈال کر ان مسلمانوں کو کچا چبا ڈالیں۔ {’’ اَلْاِلُّ ‘‘} کے معنی عہد، حلف، قرابت سبھی آتے ہیں اور یہاں آگے {’’ ذِمَّةً ‘‘} ( عہد) الگ ذکر ہونے کی وجہ سے قرابت مراد ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {اِشْتَرَوْا بِاٰيٰتِ اللّٰهِ ثَمَنًا قَلِيْلًا … :} یعنی یہ وہ لوگ ہیں جنھوں نے دنیا کی چند روزہ زندگی کے مفاد کی خاطر اللہ تعالیٰ کے احکام کو رد کر دیا، پھر اسی پر اکتفا نہیں کیا کہ خود اسلام نہیں لائے، بلکہ دوسروں کو بھی اسلام کی راہ اختیار کرنے سے روکتے رہے۔ (شوکانی)"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت10) ➊ { لَا يَرْقُبُوْنَ فِيْ مُؤْمِنٍ اِلًّا وَّ لَا ذِمَّةً:} ان کی مذمت کی تاکید کے لیے دوبارہ ان کے اس فعل بد کا تذکرہ فرمایا۔ بعض مفسرین نے پہلی آیات سے مراد تمام مشرکین اور ان آیات سے مراد یہود مدینہ لیے ہیں، کیونکہ اللہ کی کتاب انھی کے پاس تھی جس کی آیات پر عمل کر کے مسلمان ہونے کے بجائے وہ دنیا کے مفاد کو ترجیح دیتے تھے، اگرچہ اللہ کے احکام کو رد کر کے دنیا کے مفاد کو ترجیح دینا مشرکین و یہود سب کا وتیرہ ہے۔ اس صورت میں {’’ بِاٰيٰتِ اللّٰهِ ‘‘} سے مراد نبی کریم صلی اللہ علیہ وسلم کی لائی ہوئی آیات ہوں گی۔ ¤ ➋ { وَ اُولٰٓىِٕكَ هُمُ الْمُعْتَدُوْنَ:} یعنی عہد شکنی اور زیادتی جب بھی ہوئی انھی کی طرف سے ہوئی۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت11) ➊ { فَاِنْ تَابُوْا وَ اَقَامُوا الصَّلٰوةَ … :} یعنی ایمانی اخوت، جس کا ذکر اللہ تعالیٰ نے سورۂ حجرات (۱۰) میں کیا ہے : «اِنَّمَا الْمُؤْمِنُوْنَ اِخْوَةٌ » ’’مومن تو سب بھائی ہی ہیں‘‘ وہ ان تین چیزوں کے بغیر حاصل نہیں ہوتی۔ ان تین چیزوں سے انھیں اسلامی معاشرے میں وہ تمام حقوق حاصل ہوں گے جو دوسرے مسلمانوں کو حاصل ہیں۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یہ جو فرمایا بھائی ہیں حکم شرع میں، اس میں سمجھ لیں کہ جو شخص قرائن سے معلوم ہو کہ ظاہر میں مسلمان ہے اور دل سے یقین نہیں رکھتا تو چاہے اسے حکم ظاہری میں مسلمان گنیں، مگر معتمد اور دوست نہ پکڑیں۔‘‘ (موضح) یہ بات پہلے بھی گزری ہے یہاں مزید تاکید ہو گئی کہ نماز اور زکوٰۃ کا محض اقرار ہی اخوت دینی کے لیے کافی نہیں بلکہ عملاً ان کی ادائیگی امت مسلمہ میں شامل ہونے کے لیے ضروری ہے اور مسلمان حاکم پر لازم ہے کہ ان کی عدم ادائیگی پر باز پرس کرے اور سزا دے اور اگر وہ ان کی ادائیگی سے انکار یا ان کا مذاق اڑائیں تو ابو بکر رضی اللہ عنہ کی طرح انھیں مرتد قرار دے کر ان سے جنگ کی جائے۔ ¤ ➋ { وَ نُفَصِّلُ الْاٰيٰتِ لِقَوْمٍ يَّعْلَمُوْنَ:} جاننے والوں سے مراد وہ لوگ ہیں جو اللہ کی نافرمانی کا انجام سمجھتے اور اس کا خوف اپنے دلوں میں رکھتے ہیں، ایسے ہی لوگ ہیں جو اس کی آیات سے فائدہ اٹھا سکتے ہیں۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت12) ➊ {وَ اِنْ نَّكَثُوْۤا اَيْمَانَهُمْ … :} یعنی جن لوگوں کی حالت یہ ہو کہ وہ نہ صرف تم سے معاہدہ کر کے اسے توڑتے ہوں بلکہ تمھارے دین کا مذاق اڑاتے، اس میں طعن کرتے اور عیب نکالتے ہوں تو سمجھ لو کہ یہی {’’ اَىِٕمَّةَ الْكُفْرِ ‘‘} (کفر کے سردار) ہیں۔ ان کی قسموں کا کچھ اعتبار نہیں، لہٰذا تم ان لوگوں کو کسی قسم کا موقع دیے بغیر ان سے جنگ کرو، تاکہ تمھاری تلواروں کی کاٹ سے وہ اپنے کرتوتوں سے باز آ جائیں۔ معلوم ہوا کہ دین اسلام پر طعن کرنے والا اور رسول اللہ صلی اللہ علیہ وسلم کی اہانت کرنے والا واجب القتل ہے۔رسول اللہ صلی اللہ علیہ وسلم نے اگرچہ تمام کفار سے جنگ کی، مگر دین میں طعن، اسلام اور مسلمانوں کی توہین اور آپ صلی اللہ علیہ وسلم کی توہین کرنے والوں کے قتل کا خاص اہتمام فرمایا۔ کعب بن اشرف یہودی اور ابو رافع یہودی وغیرہ کو فدائی حملوں کے ذریعے سے قتل کروانے کے واقعات اس کی واضح مثالیں ہیں۔ فتح مکہ کے موقع پر بد زبانوں کا خون رائگاں قرار دینا بھی اس کی مثال ہے۔ کفار کی طرف سے عہد توڑنے کے بعد اگر ان سے جنگ نہ کی جائے تو یہ مسلمانوں کی طرف سے بے حد کمزوری کا اظہار اور انتہا درجے کی ذلت اور بے غیرتی ہو گی، اس لیے رسول اللہ صلی اللہ علیہ وسلم عہد توڑنے والوں سے در گزر نہیں فرماتے تھے، بلکہ فوراً انھیں ان کے انجام تک پہنچاتے تھے۔ بنو قریظہ اور اہل مکہ کے عہد توڑنے پر رسول اللہ صلی اللہ علیہ وسلم کی کارروائی اس کی روشن مثال ہے، مگر افسوس آج کفار کے اپنے تمام معاہدے توڑنے کے باوجود مسلمان حکام ان سے خوف زدہ اور خاموش ہیں۔ ¤ ➋ { اِنَّهُمْ لَاۤ اَيْمَانَ لَهُمْ:} اللہ تعالیٰ نے کفار کے کسی عہد و پیمان کے معتبر نہ ہونے کا جو ذکر فرمایا یہ واقعی حقیقت ہے جس کا ثبوت نصرانیوں کا اندلس سے مسلمانوں کا نام و نشان مٹا دینا ہے اور وہ سلوک بھی جو تاتاریوں نے مسلمانوں خصوصاً بغداد کے مسلمانوں کے ساتھ ۶۵۶ھ (1258ء) میں کیا اور جو کچھ ہندوؤں اور سکھوں نے پاکستان آنے والے مسلمانوں کے ساتھ کیا اور اب تک کشمیر اور بھارت کے مسلمانوں سے کر رہے ہیں اور جو کچھ روس اور دوسری کمیونسٹ ریاستوں نے اسلام اور مسلمانوں کا نام و نشان مٹانے کے لیے کیا اور اب امریکہ، یورپ اور پورا عالم کفر جس طرح عراق، افغانستان اورپاکستان کے مسلمانوں کے ساتھ کر رہا ہے اور جھوٹے الزام گھڑ کر وہ تمام عہد جو اقوام متحدہ کے ذریعے سے کیے تھے پس پشت ڈال کر اسلام اور مسلمانوں کو برباد کر رہا ہے، یہ سب کفار کے کسی عہد کے عہد نہ ہونے کی واضح مثالیں ہیں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت13) ➊ {اَلَا تُقَاتِلُوْنَ قَوْمًا نَّكَثُوْۤا اَيْمَانَهُمْ … :} اللہ تعالیٰ نے مسلمانوں کو نہایت بلیغ طریقے سے کفار کے خلاف جنگ پر ابھارا ہے اور انھیں جوش اور غیرت دلائی ہے کہ جن لوگوں کے یہ جرائم ہیں کیا تم ان کے خلاف بھی نہیں لڑو گے؟ پھر ان کے تین جرم بیان فرمائے، پہلا یہ کہ انھوں نے اپنے عہد توڑ ڈالے اور وہ قسمیں بھی جو عہد پختہ کرنے کے لیے کھائی تھیں، صلح حدیبیہ ہو جانے کے بعد بھی وہ بنو خزاعہ کے خلاف ( جو مسلمانوں کے حلیف تھے) بنو بکر کی پیٹھ ٹھونکتے اور اسلحہ وغیرہ سے ان کی مدد کرتے رہے، حالانکہ ان کا ایسا کرنا صلح کے معاہدے کی صریح خلاف ورزی تھی۔ دوسرا یہ کہ جب رسول اللہ صلی اللہ علیہ وسلم مکہ میں تھے تو وہ آپ کے خلاف منصوبے سوچتے رہتے، جیسا کہ سورۂ انفال ( ۳۰) میں گزر چکا ہے کہ قتل، قید اور کم از کم یہ کہ آپ کو مکہ سے نکال دیں، یہ الگ بات ہے کہ وہ اپنے کسی ارادے میں کامیاب نہ ہو سکے اور آپ صلی اللہ علیہ وسلم نے خود اللہ کے حکم سے ہجرت کی اور تیسرا یہ کہ پہلی بار لڑنے کی ابتدا انھوں نے کی کہ بدر کے موقع پر جب ان کا تجارتی قافلہ بچ گیا تھا تو انھوں نے واپس جانے کے بجائے خواہ مخواہ جنگ چھیڑی۔ اس کے بعد احد، خندق اور بنو خزاعہ کے خلاف جنگ کی ابتدا بھی انھوں نے کی۔ ان تینوں میں سے ہر جرم ہی ان سے لڑنے کا کافی سبب ہے، اب یہ تین سبب جمع ہونے پر بھی کیا تم ان سے نہیں لڑو گے؟ ¤ ➋ { اَتَخْشَوْنَهُمْ۠ فَاللّٰهُ اَحَقُّ … :} یہ بھی جنگ پر ابھارنے کا ایک زبردست طریقہ ہے کہ کسی کو کہا جائے کہ کیا تم دشمنوں سے ڈرتے ہو ؟ غیرت مند یہی کہے گا اور کر کے دکھائے گا کہ نہیں، میں دشمنوں سے نہیں ڈرتا، پھر مسلمانوں کی ہمت بندھائی کہ تم تو اللہ پر ایمان و یقین رکھنے والے ہو کہ فتح و شکست اور نفع و نقصان اسی کے ہاتھ میں ہے، ایسی صورت میں تو لازماً حق بنتا ہے کہ تم کفار کے بجائے اللہ سے ڈرو اور ان سے قتال کرو۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت15،14) ➊ {قَاتِلُوْهُمْ يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ …:} ان دو آیتوں میں اللہ تعالیٰ نے عہد توڑنے والے کفار سے لڑنے کی صورت میں مسلمانوں کے ساتھ پانچ وعدے کیے ہیں جو سب کے سب پورے فرمائے، پہلا یہ کہ {’’يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ‘‘} یعنی پہلی قوموں پر اللہ کی طرف سے قدرتی آفات کے ذریعے سے عذاب آتا تھا، اب تم ان سے لڑو، اللہ تعالیٰ تمھارے ہاتھوں انھیں عذاب دے گا، جو کفار کے قتل، زخمی، قید ہونے اور ان سے مال غنیمت کے حصول کی صورت میں ہو گا۔ دوسرا یہ کہ {’’ يُخْزِهِمْ ‘‘} انھیں رسوا کرے گا، ان کی فوجی قوتوں کا گھمنڈ توڑ کر ان کی حکومت کی عزت خاک میں ملا کر انھیں ذلیل و رسوا کرے گا۔ تیسرا یہ کہ {’’ وَ يَنْصُرْكُمْ عَلَيْهِمْ ‘‘} ان کے خلاف تمھاری مدد کرے گا اور تمھیں غلبہ عطا کرے گا۔ اسے الگ اس لیے ذکر فرمایا کہ ہو سکتا تھا کہ کفار تو ذلیل ہو جائیں مگر مسلمانوں کے ہاتھ بھی کچھ نہ آئے۔ چوتھا یہ کہ {’’وَ يَشْفِ صُدُوْرَ قَوْمٍ مُؤْمِنِيْنَ‘‘} تمھارے ان سے لڑنے اور غلبہ پانے سے ان مومنوں کے سینوں کو شفا ملے گی جو ان کفار موذیوں کے ہاتھوں ظلم و ستم سہتے رہے۔ ان سے مراد وہ مسلمان ہیں جو مکہ اور دوسری جگہوں میں کفار کی ایذا کا نشانہ بنے۔ بعض نے فرمایا کہ ان سے مراد بنو خزاعہ ہیں جنھیں بنو بکر اور قریش نے بد عہدی کرکے سخت نقصان پہنچایا اور واقعی یہ لوگ بھی کفار کے زخم خوردہ لوگوں میں شامل تھے اور پانچواں یہ کہ {’’ وَ يُذْهِبْ غَيْظَ قُلُوْبِهِمْ ‘‘} ان کے دلوں کے غصے کو دور کرے گا۔ بعض لوگوں نے کہا کہ یہ شفائے صدور ہی کی تاکید ہے، مگر حقیقت یہ ہے کہ یہ ایک الگ نعمت ہے۔ شفائے صدور سے مراد ان ظالموں کا قتل اور ان کی رسوائی ہے اور دلوں کا غصہ دور کرنے سے مراد مسلمانوں کو محکومی کی بے بسی میں جو غصہ کفار پر آتا تھا مگر کچھ کر نہ سکتے تھے، اب فتح و غلبہ کی صورت میں اس غصے کو دور کرنا ہے اور ویسے بھی شفائے قلوب کے بعد بھی ظلم و ستم کے جو آثار غصے کی صورت میں باقی رہتے ہیں الگ حیثیت رکھتے ہیں۔ اس کے علاوہ دنیا بھر کے مسلمانوں پر ظلم و ستم کے واقعات سن کر دل میں غصہ تو آتا ہی ہے، جیسے اب بھارت وکشمیر، فلسطین و فلپائن، برما، عیسائی اور کمیونسٹ ممالک میں مسلمانوں پر ظلم کی داستانیں سن کر دل کو غصہ آتا ہے، کفار پر فتح یاب ہونے سے اس غصے کا بھی مداوا ہوتا ہے۔ ¤ ➋ {وَ يَتُوْبُ اللّٰهُ عَلٰى مَنْ يَّشَآءُ:} اس سے پہلے پانچ الفاظ {’’ يُعَذِّبْهُمْ ‘‘ ’’ يُخْزِهِمْ ‘‘ ’’ يَنْصُرْكُمْ عَلَيْهِمْ ‘‘ ’’ يَشْفِ صُدُوْرَ قَوْمٍ مُؤْمِنِيْنَ‘‘} اور {’’ يُذْهِبْ غَيْظَ قُلُوْبِهِمْ ‘‘} فعل مضارع مجزوم تھے، کیونکہ وہ{ ’’ قَاتِلُوْهُمْ ‘‘} امر کا جواب تھے کہ لڑنے کے نتیجے میں اللہ تعالیٰ تمھیں یہ پانچ انعام عطا فرمائے گا۔ اب {’’يَتُوْبُ‘‘} مجزوم نہیں بلکہ مرفوع ہے۔ معلوم ہوا یہاں سے نئی بات شروع ہو رہی ہے، اس لیے ترجمہ کیا گیا ہے : ’’ اور اللہ توبہ کی توفیق دیتا ہے جسے چاہتا ہے۔‘‘ یہاں اس جملے کے لانے کا مقصد یہ ہے کہ تمھارے جہاد کی صورت میں جب بڑے بڑے سرکشوں کی گردنیں خم ہوں گی، تو وہ اسلام کی حقانیت پر غور کریں گے اور یہ عام مشاہدہ ہے کہ لوگ غالب قوم کے دین اور ان کی تہذیب کو قبول کرتے ہیں، لہٰذا اس کے نتیجے میں اللہ تعالیٰ بہت سے لوگوں کو توبہ کی توفیق بھی دے گا، جیسا کہ فتح مکہ کے بعد عکرمہ بن ابی جہل، ابو سفیان، سہیل بن عمرو اور ان کے علاوہ فوج در فوج لوگ اسلام میں داخل ہوئے۔ مگر اس کو {’’ قَاتِلُوْهُمْ ‘‘} کا جواب بنانے کے بجائے الگ اس لیے ذکر کیا ہے کہ توبہ کی توفیق صرف کفار سے لڑائی ہی پر موقوف نہیں بلکہ اسلام اتنا واضح، روشن، مدلل اور فطرت کے مطابق دین ہے کہ بعض لوگ لڑائی کے بغیر بھی اللہ کی توفیق سے اسے سینے سے لگا لیتے ہیں اور اس میں اتنی کشش اور اتنا حسن ہے کہ اسے مٹانے کی کوشش کرنے والے لوگ اور مسلمانوں پر فتح یاب ہو جانے والے کفار بھی اللہ کی توفیق سے اسے قبول کر لیتے ہیں۔ اس وقت دنیا میں ہر جگہ مسلمان اگرچہ مغلوب ہیں، مگر اسلام تمام ادیان سے زیادہ یورپ، امریکہ اور دنیا بھر کے ممالک میں پھیل رہا ہے۔ تاتاریوں نے بھی بغداد فنا کرنے کے بعد آخر اسی اسلام کی آغوش میں پناہ لی اور اسلام کو مٹانے والے ہی صدیوں تک اس کے محافظ بنے رہے ¤ ہے عیاں یورش تاتار کے افسانے سے ¤ پاسباں مل گئے کعبے کو صنم خانے سے ¤ ➌ {وَ اللّٰهُ عَلِيْمٌ حَكِيْمٌ:} وہ گزشتہ، موجودہ اور آئندہ کی ہر بات جانتا ہے اور اپنی کمال حکمت کے مطابق جسے چاہتا ہے توبہ کی توفیق سے نوازتا ہے۔ ¤ ➍ ان آیات سے معلوم ہوا کہ صحابہ کرام رضی اللہ عنہم اللہ تعالیٰ کے علم میں پکے مومن تھے، تبھی یہ پیش گوئیاں انھی مومنین کے ہاتھوں پوری ہوئیں، انھوں نے ہی مکہ اور جزیرۂ عرب فتح کیا، روم، شام، یمن، ایران، عراق، افریقہ و ایشیا، مشرق سے مغرب تک اللہ تعالیٰ نے انھی کے ہاتھوں اسلام پھیلایا۔ ان کے ذکر سے مومنوں کے دل ٹھنڈے ہوتے ہیں اور کفار کے دل غصے سے بھر جاتے ہیں، دیکھیے سورۂ فتح کی آخری آیت۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت15،14) ➊ {قَاتِلُوْهُمْ يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ …:} ان دو آیتوں میں اللہ تعالیٰ نے عہد توڑنے والے کفار سے لڑنے کی صورت میں مسلمانوں کے ساتھ پانچ وعدے کیے ہیں جو سب کے سب پورے فرمائے، پہلا یہ کہ {’’يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ‘‘} یعنی پہلی قوموں پر اللہ کی طرف سے قدرتی آفات کے ذریعے سے عذاب آتا تھا، اب تم ان سے لڑو، اللہ تعالیٰ تمھارے ہاتھوں انھیں عذاب دے گا، جو کفار کے قتل، زخمی، قید ہونے اور ان سے مال غنیمت کے حصول کی صورت میں ہو گا۔ دوسرا یہ کہ {’’ يُخْزِهِمْ ‘‘} انھیں رسوا کرے گا، ان کی فوجی قوتوں کا گھمنڈ توڑ کر ان کی حکومت کی عزت خاک میں ملا کر انھیں ذلیل و رسوا کرے گا۔ تیسرا یہ کہ {’’ وَ يَنْصُرْكُمْ عَلَيْهِمْ ‘‘} ان کے خلاف تمھاری مدد کرے گا اور تمھیں غلبہ عطا کرے گا۔ اسے الگ اس لیے ذکر فرمایا کہ ہو سکتا تھا کہ کفار تو ذلیل ہو جائیں مگر مسلمانوں کے ہاتھ بھی کچھ نہ آئے۔ چوتھا یہ کہ {’’وَ يَشْفِ صُدُوْرَ قَوْمٍ مُؤْمِنِيْنَ‘‘} تمھارے ان سے لڑنے اور غلبہ پانے سے ان مومنوں کے سینوں کو شفا ملے گی جو ان کفار موذیوں کے ہاتھوں ظلم و ستم سہتے رہے۔ ان سے مراد وہ مسلمان ہیں جو مکہ اور دوسری جگہوں میں کفار کی ایذا کا نشانہ بنے۔ بعض نے فرمایا کہ ان سے مراد بنو خزاعہ ہیں جنھیں بنو بکر اور قریش نے بد عہدی کرکے سخت نقصان پہنچایا اور واقعی یہ لوگ بھی کفار کے زخم خوردہ لوگوں میں شامل تھے اور پانچواں یہ کہ {’’ وَ يُذْهِبْ غَيْظَ قُلُوْبِهِمْ ‘‘} ان کے دلوں کے غصے کو دور کرے گا۔ بعض لوگوں نے کہا کہ یہ شفائے صدور ہی کی تاکید ہے، مگر حقیقت یہ ہے کہ یہ ایک الگ نعمت ہے۔ شفائے صدور سے مراد ان ظالموں کا قتل اور ان کی رسوائی ہے اور دلوں کا غصہ دور کرنے سے مراد مسلمانوں کو محکومی کی بے بسی میں جو غصہ کفار پر آتا تھا مگر کچھ کر نہ سکتے تھے، اب فتح و غلبہ کی صورت میں اس غصے کو دور کرنا ہے اور ویسے بھی شفائے قلوب کے بعد بھی ظلم و ستم کے جو آثار غصے کی صورت میں باقی رہتے ہیں الگ حیثیت رکھتے ہیں۔ اس کے علاوہ دنیا بھر کے مسلمانوں پر ظلم و ستم کے واقعات سن کر دل میں غصہ تو آتا ہی ہے، جیسے اب بھارت وکشمیر، فلسطین و فلپائن، برما، عیسائی اور کمیونسٹ ممالک میں مسلمانوں پر ظلم کی داستانیں سن کر دل کو غصہ آتا ہے، کفار پر فتح یاب ہونے سے اس غصے کا بھی مداوا ہوتا ہے۔ ¤ ➋ {وَ يَتُوْبُ اللّٰهُ عَلٰى مَنْ يَّشَآءُ:} اس سے پہلے پانچ الفاظ {’’ يُعَذِّبْهُمْ ‘‘ ’’ يُخْزِهِمْ ‘‘ ’’ يَنْصُرْكُمْ عَلَيْهِمْ ‘‘ ’’ يَشْفِ صُدُوْرَ قَوْمٍ مُؤْمِنِيْنَ‘‘} اور {’’ يُذْهِبْ غَيْظَ قُلُوْبِهِمْ ‘‘} فعل مضارع مجزوم تھے، کیونکہ وہ{ ’’ قَاتِلُوْهُمْ ‘‘} امر کا جواب تھے کہ لڑنے کے نتیجے میں اللہ تعالیٰ تمھیں یہ پانچ انعام عطا فرمائے گا۔ اب {’’يَتُوْبُ‘‘} مجزوم نہیں بلکہ مرفوع ہے۔ معلوم ہوا یہاں سے نئی بات شروع ہو رہی ہے، اس لیے ترجمہ کیا گیا ہے : ’’ اور اللہ توبہ کی توفیق دیتا ہے جسے چاہتا ہے۔‘‘ یہاں اس جملے کے لانے کا مقصد یہ ہے کہ تمھارے جہاد کی صورت میں جب بڑے بڑے سرکشوں کی گردنیں خم ہوں گی، تو وہ اسلام کی حقانیت پر غور کریں گے اور یہ عام مشاہدہ ہے کہ لوگ غالب قوم کے دین اور ان کی تہذیب کو قبول کرتے ہیں، لہٰذا اس کے نتیجے میں اللہ تعالیٰ بہت سے لوگوں کو توبہ کی توفیق بھی دے گا، جیسا کہ فتح مکہ کے بعد عکرمہ بن ابی جہل، ابو سفیان، سہیل بن عمرو اور ان کے علاوہ فوج در فوج لوگ اسلام میں داخل ہوئے۔ مگر اس کو {’’ قَاتِلُوْهُمْ ‘‘} کا جواب بنانے کے بجائے الگ اس لیے ذکر کیا ہے کہ توبہ کی توفیق صرف کفار سے لڑائی ہی پر موقوف نہیں بلکہ اسلام اتنا واضح، روشن، مدلل اور فطرت کے مطابق دین ہے کہ بعض لوگ لڑائی کے بغیر بھی اللہ کی توفیق سے اسے سینے سے لگا لیتے ہیں اور اس میں اتنی کشش اور اتنا حسن ہے کہ اسے مٹانے کی کوشش کرنے والے لوگ اور مسلمانوں پر فتح یاب ہو جانے والے کفار بھی اللہ کی توفیق سے اسے قبول کر لیتے ہیں۔ اس وقت دنیا میں ہر جگہ مسلمان اگرچہ مغلوب ہیں، مگر اسلام تمام ادیان سے زیادہ یورپ، امریکہ اور دنیا بھر کے ممالک میں پھیل رہا ہے۔ تاتاریوں نے بھی بغداد فنا کرنے کے بعد آخر اسی اسلام کی آغوش میں پناہ لی اور اسلام کو مٹانے والے ہی صدیوں تک اس کے محافظ بنے رہے ¤ ہے عیاں یورش تاتار کے افسانے سے ¤ پاسباں مل گئے کعبے کو صنم خانے سے ¤ ➌ {وَ اللّٰهُ عَلِيْمٌ حَكِيْمٌ:} وہ گزشتہ، موجودہ اور آئندہ کی ہر بات جانتا ہے اور اپنی کمال حکمت کے مطابق جسے چاہتا ہے توبہ کی توفیق سے نوازتا ہے۔ ¤ ➍ ان آیات سے معلوم ہوا کہ صحابہ کرام رضی اللہ عنہم اللہ تعالیٰ کے علم میں پکے مومن تھے، تبھی یہ پیش گوئیاں انھی مومنین کے ہاتھوں پوری ہوئیں، انھوں نے ہی مکہ اور جزیرۂ عرب فتح کیا، روم، شام، یمن، ایران، عراق، افریقہ و ایشیا، مشرق سے مغرب تک اللہ تعالیٰ نے انھی کے ہاتھوں اسلام پھیلایا۔ ان کے ذکر سے مومنوں کے دل ٹھنڈے ہوتے ہیں اور کفار کے دل غصے سے بھر جاتے ہیں، دیکھیے سورۂ فتح کی آخری آیت۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت16) ➊ {اَمْ حَسِبْتُمْ اَنْ تُتْرَكُوْا … : ’’وَلِيْجَةً ‘‘ ’’ وَلَجَ يَلِجُ ‘‘ } ({وَعَدَ} ) سے ہے جس کا معنی داخل ہونا ہے، یعنی دل کے اندر داخل ہو جانے والا، قلبی دوست اور محبوب، جس کے سامنے آدمی اپنے دلی راز بھی رکھ دے۔ مسلمانوں کو حکم ہے کہ کفار کو کسی صورت دلی دوست نہ بناؤ، فرمایا : «لَا تَتَّخِذُوْا بِطَانَةً مِّنْ دُوْنِكُمْ لَا يَاْلُوْنَكُمْ خَبَالًا » [ آل عمران : ۱۱۸ ] ’’اپنے سوا کسی کو دلی دوست نہ بناؤ، وہ تمھیں کسی طرح نقصان پہنچانے میں کمی نہیں کرتے۔‘‘ احکام جہاد کے آخر میں اللہ تعالیٰ نے اس آیت میں جہاد کی ایک حکمت بیان فرمائی ہے کہ اللہ تعالیٰ اس کے ذریعے سے کھرے اور کھوٹے اہل ایمان کو الگ الگ کرنا چاہتا ہے اور ان لوگوں کو خالص کرنا چاہتا ہے جن میں جہاد اور صرف مسلمانوں سے دلی دوستی اور راز داری کا وصف پایا جاتا ہے، کیونکہ یہ چیز لڑائی ہی سے نکھر کر سامنے آتی ہے۔ منافقین بھی بعض اوقات جہاد میں شریک ہو جاتے ہیں، مگر کفار سے دلی دوستی اور راز داری کا تعلق ختم نہیں کرتے، نہ ہی وہ صرف اللہ کی رضا کے لیے لڑتے ہیں، نیز دیکھیے سورۂ عنکبوت (۱تا ۳) اور سورۂ آل عمران (۱۷۹)۔ ¤ ➋ {وَ اللّٰهُ خَبِيْرٌۢ بِمَا تَعْمَلُوْنَ:} اللہ تعالیٰ تمھارے تمام اعمال سے پوری طرح با خبخبر ہے، وہ ظاہر اعمال کے ساتھ دل کا حال بھی جانتا ہے، اس لیے اپنے اعمال درست کرو اور ان کے لیے نیت خالص اللہ کی رضا رکھو۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت17) ➊ { مَا كَانَ لِلْمُشْرِكِيْنَ … :} یہاں تک کفار کے عہد و پیمان سے براء ت کا اعلان، کفار سے جہاد، اس کے فوائد اور حکمتوں کا بیان تھا۔ اب یہ بیان شروع ہوتا ہے کہ اللہ تعالیٰ کی مساجد کی آباد کاری، ان کی نگرانی اور تولیت و خدمت مشرکین کا کسی صورت حق نہیں بنتا، کیونکہ مساجد تو خالص اللہ کے لیے ہیں : «وَاَنَّ الْمَسٰجِدَ لِلّٰهِ فَلَا تَدْعُوْا مَعَ اللّٰهِ اَحَدًا» [ الجن : ۱۸ ] ’’اور یہ کہ بلاشبہ مسجدیں اللہ کے لیے ہیں، پس اللہ کے ساتھ کسی کو مت پکارو۔‘‘ سو ان کی نگرانی اور آباد کاری ان لوگوں کا حق کیسے ہو سکتا ہے جو خود اپنے آپ پر اس اکیلے مالک کے ساتھ کفر کے گواہ اور شاہد ہیں، جو حج اور عمرہ کے وقت بھی ( جو صرف اللہ کے لیے ہیں) لبیک کہتے وقت غیروں کو علی الاعلان اس کا شریک بناتے ہیں۔ چنانچہ عبد اللہ بن عباس رضی اللہ عنہما بیان کرتے ہیں کہ مشرکین کہتے تھے : [ لَبَّيْكَ لَا شَرِيْكَ لَكَ ] ’’حاضر ہوں، تیرا کوئی شریک نہیں۔‘‘ تو رسول اللہ صلی اللہ علیہ وسلم فرماتے : ’’اسی پر بس کر دو، آگے مت کہنا۔‘‘ مگر وہ کہتے : [ إِلاَّ شَرِيْكًا هُوَ لَكَ تَمْلِكُهُ وَمَا مَلَكَ ] ’’مگر ایک شریک جو تیرا ہی ہے جس کا تو مالک ہے، وہ خود مالک نہیں۔‘‘ وہ لوگ یہ الفاظ بیت اللہ کا طواف کرتے ہوئے کہتے تھے۔ [مسلم، الحج، باب التلبیۃ وصفتھا و وقتھا : ۱۱۸۵ ] ان کی اپنے کفر پر شہادت وہ تین سو ساٹھ بت بھی تھے جو انھوں نے کعبہ کے اندر اور اس کے ارد گرد رکھے ہوئے تھے، کعبہ کی دیواروں پر بزرگوں اور دیوی دیوتاؤں کی تصویریں بنا رکھی تھیں۔ ابراہیم اور اسماعیل علیھما السلام کی صورتیں بناکر ان کے ہاتھ میں فال کے تیر پکڑائے ہوئے تھے، ان کی عبادت غیر اللہ کو پکارنا تھا، ان کا بیت اللہ کا احترام انتہائی بے حیائی، یعنی ننگے ہو کر مردوں اور عورتوں کا طواف کرنا تھا اور ان کی نماز تالیاں پیٹ کر اور سیٹیاں بجا کر مشرکانہ قوالیاں کرنا تھا۔ ایسے لوگ اللہ کے سب سے پہلے اور افضل گھر کے تو کجا اس کی کسی مسجد کے متولی، مجاور یا خادم بننے کا بھی کوئی حق نہیں رکھتے، اس لیے ان سے کعبہ اور دوسری مساجد کو آزاد کروانا مسلمانوں پر فرض ہے۔ علامہ اقبال نے یہاں ایک نہایت نفیس نکتہ نکالا ہے کہ اللہ تعالیٰ نے مسلمانوں کے لیے پوری زمین کو مسجد بنایا ہے، جیسا کہ فرمایا : [ جُعِلَتْ لِيَ الْاَرْضُ مَسْجِدًا وَّ طَهُوْرًا ] [ بخاری، التیمم، باب قول اللہ تعالٰی : «فلم تجدوا مآء… » : ۳۳۵۔ مسلم : ۵۲۳ ] اس لیے مسلمانوں کے لیے غیرت اور ڈوب مرنے کا مقام ہے کہ ان کی مسجد پر غیر مسلموں کا قبضہ ہو، نہیں بلکہ یہ ساری مسجد یعنی ساری زمین مسلمانوں کے قبضے میں ہونی چاہیے اور کفار کو ان کے ماتحت ہونا چاہیے۔ ¤ ➋ { اُولٰٓىِٕكَ حَبِطَتْ اَعْمَالُهُمْ:} یعنی انھوں نے اگر کچھ نیک کام کیے بھی ہیں، جیسے مسجد حرام اور حاجیوں کی خدمت وغیرہ، تو ان کے شرک کی وجہ سے وہ سب اکارت گئے۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت18){ اِنَّمَا يَعْمُرُ مَسٰجِدَ اللّٰهِ مَنْ اٰمَنَ بِاللّٰهِ …:} آباد کرنے میں مساجد کی تعمیر، ان میں نمازوں کے لیے آنا، صفائی، روشنی، مرمت اور نگرانی وغیرہ سب چیزیں شامل ہیں اور یہ صرف ان لوگوں کا کام ہے جن میں خصوصاً چار چیزیں پائی جائیں : (1) اللہ اور یوم آخرت پر ایمان (2) ظاہر میں اس ایمان کی شہادت کے لیے نماز کا قیام (3) زکوٰۃ کی ادائیگی (4) اور اللہ کے سوا کسی سے نہ ڈرنا، جبکہ مشرکین ان چاروں صفات سے عاری ہیں۔ مساجد کی تعمیر، آباد کاری اور ان کا ادب و احترام نہایت اعلیٰ درجے کا عمل ہے۔ امیر المومنین عثمان رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جو کوئی مسجد بنائے جس کے ساتھ وہ اللہ کا چہرہ طلب کرتا ہو تو اللہ تعالیٰ اس کے لیے اس جیسا (گھر) جنت میں بنائے گا۔‘‘ [ بخاری، الصلاۃ، باب من بنی مسجدًا : ۴۵۰ ] ابوہریرہ رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ کے نزدیک تمام بلاد (جگہوں) میں سب سے زیادہ محبوب ان کی مسجدیں ہیں اور اللہ تعالیٰ کے ہاں تمام بلاد (جگہوں) سے زیادہ نا پسند ان کے بازار ہیں۔‘‘ [ مسلم، المساجد، باب فضل الجلوس فی مصلاہ… : ۶۷۱ ]"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت19){ اَجَعَلْتُمْ سِقَايَةَ الْحَآجِّ … :} اس آیت کے مخاطب مشرکین اور مسلمان دونوں ہیں، کیونکہ مشرکین کعبہ کی خدمت، تولیت اور حاجیوں کو شربت اور پانی پلانے پر بہت فخر کرتے تھے اور بعض مسلمان بھی اس کو سب سے اعلیٰ عمل سمجھتے تھے۔ نعمان بن بشیر رضی اللہ عنہما فرماتے ہیں کہ میں نبی صلی اللہ علیہ وسلم کے منبر کے پاس آپ کے اصحاب کی ایک جماعت میں بیٹھا ہوا تھا، تو ایک آدمی نے کہا کہ اسلام لانے کے بعد حاجیوں کو پانی پلانے کے علاوہ میں کوئی کام نہ کروں تو مجھے کچھ پروا نہیں۔ دوسرے نے کہا، بلکہ مسجد حرام کی آباد کاری ( افضل ہے)۔ ایک اور نے کہا، بلکہ جہاد فی سبیل اللہ اس سے بہتر ہے جو تم کہہ رہے ہو۔ تو عمر رضی اللہ عنہ نے انھیں ڈانٹا اور فرمایا کہ نبی صلی اللہ علیہ وسلم کے منبر کے پاس آوازیں مت بلند کرو، یہ جمعہ کے دن کی بات ہے، لیکن جب تم جمعہ پڑھ چکو گے تو میں رسول اللہ صلی اللہ علیہ وسلم کے پاس جاؤں گا اور تمھارے اس جھگڑے کا فیصلہ کروا لوں گا، تو اللہ تعالیٰ نے یہ آیت اتاری : «اَجَعَلْتُمْ سِقَايَةَ الْحَآجِّ وَ عِمَارَةَ الْمَسْجِدِ الْحَرَامِ كَمَنْ اٰمَنَ بِاللّٰهِ وَ الْيَوْمِ الْاٰخِرِ » [ مسلم، الإمارۃ، باب فضل الشھادۃ فی سبیل اللّٰہ تعالٰی : ۱۸۷۹] یعنی یہ کام گو فضیلت کے ہیں مگر اللہ اور یوم آخرت پر ایمان اور جہاد فی سبیل اللہ کے مقابلے میں کچھ حیثیت نہیں رکھتے اور پھر یہ ایمان کے بغیر مقبول بھی نہیں۔ «وَ اللّٰهُ لَا يَهْدِي الْقَوْمَ الظّٰلِمِيْنَ » شرک سب سے بڑا ظلم ہے، پھر جو اس پر اصرار کرے اس ظالم کو سیدھی راہ کیسے نصیب ہو ؟"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت20) ➊ {اَلَّذِيْنَ اٰمَنُوْا وَ هَاجَرُوْا: ’’ هَاجَرُوْا ‘‘} یعنی اپنا دین اور جان و مال بچانے کے لیے اپنا گھر بار اور رشتہ داروں کو چھوڑا۔ ¤ ➋ { وَ اُولٰٓىِٕكَ هُمُ الْفَآىِٕزُوْنَ:} اس آیت سے مہاجرین کی بڑی فضیلت ثابت ہوتی ہے جن میں ابو بکر، عمر، عثمان، علی، ابو عبیدہ بن جراح، طلحہ، زبیر اور بہت سے دوسرے صحابہ کرام رضی اللہ عنہم شامل ہیں۔ اللہ تعالیٰ سب پر راضی ہو اور ہمیں ان کے ساتھ اٹھائے۔ قرآن خود ان کے آخرت میں فائز و سرخرو ہونے کی شہادت دے رہا ہے۔ معلوم ہوا کہ جو لوگ انھیں برا بھلا کہتے اور ان پر لعنت بھیجتے ہیں وہ خود لعنتی ہیں۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت22،21) {يُبَشِّرُهُمْ رَبُّهُمْ بِرَحْمَةٍ مِّنْهُ … : ’’ بِرَحْمَةٍ ‘‘} اور {’’ رِضْوَانٍ  ‘‘} پر تنوین تعظیم کی ہے۔ اب اس رحمت اور رضا مندی کا کون اندازہ کر سکتا ہے جسے خود اللہ تعالیٰ خاص اپنی طرف سے اور عظیم قرار دے رہا ہے، اگلی آیت میں دوبارہ اسے اجر عظیم قرار دیا ہے۔ جب مالک خود ان لوگوں سے راضی اور انھیں اپنی رحمت اور جنت کی خوش خبری دے رہا ہے، تو ڈوب مرنا چاہیے ان لوگوں کو جو ان کے خلاف اپنی زبانیں کھولتے ہیں، اگر ان میں ذرہ بھر بھی غیرت اور شرم و حیا ہے۔ ورنہ سیدھی طرح اپنی بد تمیزی اور گستاخی سے توبہ کر کے ان کا وہ مقام تسلیم کرنا چاہیے جو اللہ اور اس کے رسول نے انھیں دیا ہے۔ یاد رہے کہ ایمان، جہاد اور ہجرت کا سلسلہ قیامت تک قائم رہے گا اور وہ سب مجاہدین اس فضیلت میں شامل ہیں جو یہ شرف حاصل کریں گے۔ ابو حیان نے فرمایا کہ اللہ تعالیٰ نے اہل ایمان کے تین وصف ایمان، ہجرت اور مال و جان کے ساتھ جہاد ذکر فرمائے، ان کے مقابلے میں تین ہی انعام ذکر فرمائے، ایمان کے مقابلے میں رحمت، کیونکہ وہ صرف ایمان سے حاصل ہوتی ہے اور سب سے عام ہے۔ جان و مال کے ساتھ جہاد کے مقابلے میں رضوان جو کسی سے حسن سلوک کی انتہا ہے اور ہجرت، یعنی وطن چھوڑنے کے بدلے میں جنت جو دائمی اقامت کا گھر ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت22،21) {يُبَشِّرُهُمْ رَبُّهُمْ بِرَحْمَةٍ مِّنْهُ … : ’’ بِرَحْمَةٍ ‘‘} اور {’’ رِضْوَانٍ  ‘‘} پر تنوین تعظیم کی ہے۔ اب اس رحمت اور رضا مندی کا کون اندازہ کر سکتا ہے جسے خود اللہ تعالیٰ خاص اپنی طرف سے اور عظیم قرار دے رہا ہے، اگلی آیت میں دوبارہ اسے اجر عظیم قرار دیا ہے۔ جب مالک خود ان لوگوں سے راضی اور انھیں اپنی رحمت اور جنت کی خوش خبری دے رہا ہے، تو ڈوب مرنا چاہیے ان لوگوں کو جو ان کے خلاف اپنی زبانیں کھولتے ہیں، اگر ان میں ذرہ بھر بھی غیرت اور شرم و حیا ہے۔ ورنہ سیدھی طرح اپنی بد تمیزی اور گستاخی سے توبہ کر کے ان کا وہ مقام تسلیم کرنا چاہیے جو اللہ اور اس کے رسول نے انھیں دیا ہے۔ یاد رہے کہ ایمان، جہاد اور ہجرت کا سلسلہ قیامت تک قائم رہے گا اور وہ سب مجاہدین اس فضیلت میں شامل ہیں جو یہ شرف حاصل کریں گے۔ ابو حیان نے فرمایا کہ اللہ تعالیٰ نے اہل ایمان کے تین وصف ایمان، ہجرت اور مال و جان کے ساتھ جہاد ذکر فرمائے، ان کے مقابلے میں تین ہی انعام ذکر فرمائے، ایمان کے مقابلے میں رحمت، کیونکہ وہ صرف ایمان سے حاصل ہوتی ہے اور سب سے عام ہے۔ جان و مال کے ساتھ جہاد کے مقابلے میں رضوان جو کسی سے حسن سلوک کی انتہا ہے اور ہجرت، یعنی وطن چھوڑنے کے بدلے میں جنت جو دائمی اقامت کا گھر ہے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت23){ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوْۤا اٰبَآءَكُمْ … :} یعنی بعض لوگ دل سے مسلمان ہیں لیکن برادری سے تعلق توڑ بھی نہیں سکتے کہ اپنے اسلام کا اعلان کر دیں، ان کا حال یہاں سے سمجھو۔ ( موضح) مزید دیکھیے سورۂ مجادلہ (۲۲)، سورۂ ممتحنہ (۱تا۳)، سورۂ آل عمران (۲۸، ۱۱۸) اور سورۂ مائدہ (۵۱)۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت24) ➊ {قُلْ اِنْ كَانَ اٰبَآؤُكُمْ وَ اَبْنَآؤُكُمْ …:} یہ اور اس سے پہلی آیت دونوں مسلمانوں کے کسی خاص گروہ یا واقعہ سے متعلق نہیں بلکہ عام اور ہر زمانے کے لیے ہیں، ان میں تمام مسلمانوں کو یہ تعلیم دی گئی ہے کہ اللہ تعالیٰ اور رسول صلی اللہ علیہ وسلم کی محبت انھیں دنیا کی ہر چیز سے زیادہ ہونی چاہیے، یہ تمام چیزیں جو اللہ تعالیٰ نے شمار فرمائی ہیں ہر انسان کو طبعی طور پر محبوب ہوتی ہیں، فرمایا : «زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوٰتِ مِننَ النِّسَآءِ وَ الْبَنِيْنَ وَ الْقَنَاطِيْررِ الْمُقَنْطَرَةِ مِنَ الذَّهَبِ وَ الْفِضَّةِ وَ الْخَيْلِ الْمُسَوَّمَةِ وَ الْاَنْعَامِ وَ الْحَرْثِ ذٰلِكَ مَتَاعُ الْحَيٰوةِ الدُّنْيَا وَ اللّٰهُ عِنْدَهٗ حُسْننُ الْمَاٰبِ » [ آل عمران : ۱۴ ] ’’لوگوں کے لیے نفسانی خواہشوں کی محبت مزین کی گئی ہے جو عورتیں اور بیٹے اور سونے اور چاندی کے جمع کیے ہوئے خزانے اور نشان لگائے ہوئے گھوڑے اور مویشی اور کھیتی ہیں، یہ دنیا کی زندگی کا سامان ہے اور اللہ ہی ہے جس کے پاس اچھا ٹھکانا ہے۔‘‘ ان چیزوں سے محبت کوئی گناہ بھی نہیں، بلکہ ان سے محبت اور ان کے حقوق کی ادائیگی آدمی کی ذمہ داری ہے، اللہ تعالیٰ کی طرف سے تقاضا صرف یہ ہے کہ ان میں سے کسی چیز کی محبت اللہ اور اس کے رسول صلی اللہ علیہ وسلم سے اور اس کے راستے میں جہاد سے بڑھ کر نہیں ہونی چاہیے۔ پیمانہ اس کا یہ ہے کہ اگر کبھی ایسا ہو کہ ایک طرف اللہ تعالیٰ اور رسول صلی اللہ علیہ وسلم کا حکم ہو اور اسلام کی خاطر جہاد کرتے ہوئے سب کچھ قربان کر دینے کی ضرورت ہو اور دوسری طرف ماں باپ اور خویش و اقارب کی محبت ہو اور دنیا کے دوسرے تعلقات یا مفادات و خطرات اس کی راہ میں رکاوٹ بن رہے ہوں تو مسلمان کا فرض ہے کہ وہ ہر شخص اور ہر مصلحت سے بے پروا ہو کر اللہ تعالیٰ اور رسول صلی اللہ علیہ وسلم کے حکم کی پیروی کرے اور کوئی دنیوی مفاد یا خطرہ ایسا نہیں ہونا چاہیے جو اسے اللہ کا حکم ماننے اور اس کی راہ میں جہاد کرنے سے باز رکھ سکے، ورنہ اللہ تعالیٰ کی طرف سے کسی بھی وقت عذاب آ سکتا ہے۔ یہی مضمون ہے جس کو نبی صلی اللہ علیہ وسلم نے بار بار واضح فرمایا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھے اس ذات کی قسم ہے جس کے ہاتھ میں میری جان ہے! تم میں سے کوئی شخص اس وقت تک مومن نہیں ہو سکتا جب تک میں اسے اس کی جان سے بھی زیادہ محبوب نہ ہو جاؤں۔‘‘ [ بخاری، الإیمان، باب حب الرسول صلی اللہ علیہ وسلم من الإیمان : ۱۵، عن أنس رضی اللہ عنہ] عبد اللہ بن ہشام رضی اللہ عنہ فرماتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جا رہے تھے اور عمر رضی اللہ عنہ کا ہاتھ آپ کے ہاتھ میں تھا۔ عمر رضی اللہ عنہ نے کہا : ’’آپ مجھے دنیا کی ہر چیز سے زیادہ محبوب ہیں سوائے اپنی جان کے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’نہیں، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! جب تک کہ میں تجھے تیری جان سے بھی زیادہ محبوب نہ ہو جاؤں۔‘‘ عمر رضی اللہ عنہ نے عرض کی : ’’اب آپ مجھے میری جان سے بھی زیادہ محبوب ہیں۔‘‘ فرمایا : ’’اب اے عمر ! (تیرے ایمان کا معاملہ درست ہوا)۔‘‘ [ بخاری، الأیمان والنذور، باب کیف کانت یمین النبی صلی اللہ علیہ وسلم : ۶۶۳۲ ] ¤ ➋ { حَتّٰى يَاْتِيَ اللّٰهُ بِاَمْرِهٖ:} ابن عمر رضی اللہ عنہما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جب تم ’’ عینہ ‘‘ (حیلے کے ساتھ سود کی ایک قسم) کے ساتھ بیع کرو گے اور بیلوں کی دمیں پکڑ لو گے اور کھیتی باڑی پر راضی ہو جاؤ گے اور جہاد ترک کر دو گے، تو اللہ تعالیٰ تم پر ایسی ذلت مسلط کرے گا جسے ختم نہیں کرے گا، جب تک تم اپنے دین کی طرف لوٹ نہیں آؤ گے۔‘‘ [ أبوداوٗد، البیوع، باب فی النہی عن العینۃ : ۳۴۶۲، و صححہ الألبانی ] زمخشری رحمہ اللہ نے فرمایا کہ یہ آیت بہت سخت ہے، اس سے سخت آپ کوئی آیت نہیں دیکھیں گے۔ یہ انسان کی دینی کمزوری اور یقین کی کمی کی نشان دہی کرتی ہے۔ اپنے دل میں بہت پرہیز گار اور متقی شخص انصاف سے سوچے کہ کیا واقعی اس میں اتنی دینی پختگی ہے کہ اس آیت میں مذکور تمام چیزوں کو اللہ تعالیٰ کی رضا کے خلاف ہونے کی بنا پر کسی معاملے میں چھوڑ سکتا ہے، یا کسی کی تھوڑی سی ناراضگی یا دنیا کے معمولی سے مفاد کی بنا پر وہ کش مکش میں پڑ جاتا ہے کہ کسے رکھوں اور کسے چھوڑوں؟ پھر اکثر یہی ہوتا ہے کہ اس کی بیوی، اولاد، دوستوں، معاشرے اور تجارتی مفاد کے تقاضے ہی اللہ کے دین کے تقاضوں پر غالب آتے ہیں۔ (الا ما شاء اللہ)"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت26،25) ➊ {لَقَدْ نَصَرَكُمُ اللّٰهُ فِيْ مَوَاطِنَ كَثِيْرَةٍ:} بدر میں اپنے انعامات کے تذکرے، جہاد کی ترغیب، کفار سے دوستی ترک کرنے کی تلقین اور دنیا کی ہر چیز پر اللہ اور اس کے رسول اور جہاد فی سبیل اللہ کی ترجیح کے حکم کے بعد اب اللہ تعالیٰ نے اپنے کچھ مزید انعامات ذکر فرمائے، جن میں حنین کا خاص ذکر فرمایا، مگر حنین کا ذکر کرنے سے پہلے بہت سے گزشتہ مواقع میں «فِيْ مَوَاطِنَ كَثِيْرَةٍ » اپنی مدد کا ذکر فرمایا، ان میں ہجرت «فَقَدْ نَصَرَهُ اللّٰهُ اِذْ اَخْرَجَهُ الَّذِيْنَ كَفَرُوْا» [ التوبۃ : ۴۰ ] بدر «وَ لَقَدْ نَصَرَكُمُ اللّٰهُ بِبَدْرٍ» [ آل عمران : ۱۲۳ ] احد «وَ لَقَدْ صَدَقَكُمُ اللّٰهُ وَعْدَهٗۤ اِذْ تَحُسُّوْنَهُمْ بِاِذْنِهٖ » [ آل عمران : ۱۵۲ ] خندق «يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا اذْكُرُوْا نِعْمَةَ اللّٰهِ عَلَيْكُمْ اِذْ جَآءَتْكُمْ جُنُوْدٌ » [ الأحزاب : ۹ ] حدیبیہ «اِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا » [ الفتح : ۱ ] فتح مکہ «اِذَا جَآءَ نَصْرُ اللّٰهِ وَ الْفَتْحُ» [ النصر : ۱ ] یہودی قبائل «هُوَ الَّذِيْۤ اَخْرَجَ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ مِنْ دِيَارِهِمْ لِاَوَّلِ الْحَشْرِ » [ الحشر : ۲ ] اور منافقین سے معاملات وغیرہ سب شامل ہیں اور سب کا ذکر قرآن و حدیث میں مختلف مقامات پر موجود ہے، مگر ان کو یہاں بطور تمہید ذکر فرما کر اصل تذکرہ حنین کے دن کیے جانے والے انعام کا فرمایا اور اس کی وجہ بھی بیان فرمائی۔ حنین مکہ معظمہ اور طائف کے درمیان ایک وادی ہے، وہاں فتح مکہ (رمضان ۸ھ) کے ایک ماہ بعد شوال ۸ھ میں مسلمانوں کی ہوازن، ثقیف، بنو جشم، بنو سعد اور بعض دوسرے قبائل سے جنگ ہوئی تھی۔ ¤ ➋ { وَ يَوْمَ حُنَيْنٍ اِذْ اَعْجَبَتْكُمْ كَثْرَتُكُمْ …:} نبی صلی اللہ علیہ وسلم کے ساتھ دس ہزار کا لشکر تو ان مہاجرین و انصار کا تھا جو فتح مکہ کے لیے آپ کے ساتھ مدینہ سے آئے تھے اور دو ہزار آدمی آپ کے ساتھ اہل مکہ ( طلقاء) میں سے شامل ہو گئے تھے۔ اس طرح مسلمانوں کا کل لشکر بارہ ہزار لڑنے والوں پر مشتمل تھا، جبکہ اس کے مقابلے میں دشمنوں کی تعداد صرف چار ہزار کے قریب تھی، اس پر بہت سے مسلمانوں میں عجب (خود پسندی) اور ایک قسم کا غرور پیدا ہو گیا، حتیٰ کہ بعض نے کہا آج ہم قلت تعداد کی وجہ سے مغلوب نہیں ہوں گے۔ یہ کلمہ اللہ تعالیٰ کو پسند نہ آیا۔ (ابن کثیر) جابر رضی اللہ عنہ بیان کرتے ہیں کہ جب ہم وادی حنین کی طرف چلے تو ہم تہامہ کی وادیوں میں سے ایک وادی میں اترے، وادی بڑی وسیع و عریض تھی، اس میں اوپر نیچے ٹیلے اور چھوٹی چھوٹی ڈھلوانی پہاڑیاں تھیں، ہم اوپر چڑھتے اور نیچے اترتے ہوئے آگے کی جانب بڑھتے اور لڑھکتے جا رہے تھے، ابھی صبح کا اندھیرا تھا، دشمن ہمارے لیے مختلف گھاٹیوں، کناروں اور تنگ گزر گاہوں میں پورے اتفاق اور مقابلے کی تیاری کے ساتھ چھپے بیٹھے تھے۔ اللہ کی قسم! ہمیں اترتے اترتے پتا ہی نہ چلا کہ دشمن نے مل کر اس طرح حملہ کیا جیسے ایک آدمی کرتا ہے۔ (دوسری روایات میں ہے کہ وہ زبردست نشانہ باز تھے، انھوں نے تیروں کی بوچھاڑ کر دی) لوگ شکست کھا کر واپس پلٹے، وہ بھاگے جاتے تھے اور کوئی کسی کو مڑ کر نہیں دیکھتا تھا، رسول اللہ صلی اللہ علیہ وسلم دائیں طرف ایک جگہ ہو گئے، پھر فرمایا : ’’لوگو ! میری طرف توجہ کرو، میری طرف آؤ، میں رسول اللہ ہوں، میں محمد بن عبد اللہ ہوں۔‘‘ کہیں سے جواب نہیں آ رہا تھا، اونٹ ایک دوسرے پر گرتے پڑتے بھاگ رہے تھے، لوگ ادھر ادھر نکل گئے، سوائے مہاجرین و انصار کے ایک گروہ اور آپ کے خاندان کے لوگوں کے جو زیادہ نہ تھے۔ ابو بکر اور عمر رضی اللہ عنہما آپ کے ساتھ ڈٹے رہے، آپ کے خاندان والوں میں سے علی بن ابو طالب، عباس بن عبدالمطلب، ان کے بیٹے فضل، ابو سفیان بن حارث اور ایمن بن عبید جو ام ایمن کے بیٹے تھے اور اسامہ بن زید رضی اللہ عنہم ۔ [ أحمد : 376/3، ح : ۱۵۰۲۷، وحسنہ شعیب الأرنؤوط۔ ابن حبان : ۴۷۷۴ ] ¤ عباس رضی اللہ عنہ بیان کرتے ہیں کہ میری آواز بڑی بلند تھی، اس وجہ سے اللہ کے رسول صلی اللہ علیہ وسلم نے مجھے حکم دیا : ’’ اے عباس ! کیکر ( کے درخت) والوں کو آواز دو۔‘‘ چنانچہ میں نے بلند آواز سے پکارا کہ کیکر ( تلے بیعت رضوان کرنے) والے کہاں ہیں ؟ اللہ کی قسم! ان لوگوں نے جب میری آواز سنی تو وہ ’’ ہم حاضر ہیں، ہم حاضر ہیں‘‘ کہتے ہوئے اس طرح دوڑے جس طرح گائے اپنے بچے کی طرف دوڑتی ہے۔ عباس رضی اللہ عنہ فرماتے ہیں کہ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے کنکر پکڑے اور دشمنوں کی طرف پھینکے، اس کے ساتھ ہی رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ محمد کے رب کی قسم ! وہ شکست کھا گئے۔‘‘ [ مسلم، الجہاد، باب غزوۃ حنین : ۱۷۷۵ ] یہ وہ وقت ہے جب مسلمان جم گئے اور فرشتے نازل ہوئے : «وَ اَنْزَلَ جُنُوْدًا لَّمْ تَرَوْهَا » ’’اور اس نے ایسے لشکر اتارے جنھیں تم نے نہیں دیکھا۔‘‘ ¤ ➌ { وَ عَذَّبَ الَّذِيْنَ كَفَرُوْا…:} اللہ تعالیٰ نے کفار کو یہ سزا دی کہ انھیں شکست فاش ہوئی، ان کے بچے اور عورتیں لونڈی و غلام اور ان کے اموال مسلمانوں کی غنیمت بنے، بہت سے بڑے بھی اسیر ہوئے اور دنیا میں کفار کی یہی جزا ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت26،25) ➊ {لَقَدْ نَصَرَكُمُ اللّٰهُ فِيْ مَوَاطِنَ كَثِيْرَةٍ:} بدر میں اپنے انعامات کے تذکرے، جہاد کی ترغیب، کفار سے دوستی ترک کرنے کی تلقین اور دنیا کی ہر چیز پر اللہ اور اس کے رسول اور جہاد فی سبیل اللہ کی ترجیح کے حکم کے بعد اب اللہ تعالیٰ نے اپنے کچھ مزید انعامات ذکر فرمائے، جن میں حنین کا خاص ذکر فرمایا، مگر حنین کا ذکر کرنے سے پہلے بہت سے گزشتہ مواقع میں «فِيْ مَوَاطِنَ كَثِيْرَةٍ » اپنی مدد کا ذکر فرمایا، ان میں ہجرت «فَقَدْ نَصَرَهُ اللّٰهُ اِذْ اَخْرَجَهُ الَّذِيْنَ كَفَرُوْا» [ التوبۃ : ۴۰ ] بدر «وَ لَقَدْ نَصَرَكُمُ اللّٰهُ بِبَدْرٍ» [ آل عمران : ۱۲۳ ] احد «وَ لَقَدْ صَدَقَكُمُ اللّٰهُ وَعْدَهٗۤ اِذْ تَحُسُّوْنَهُمْ بِاِذْنِهٖ » [ آل عمران : ۱۵۲ ] خندق «يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا اذْكُرُوْا نِعْمَةَ اللّٰهِ عَلَيْكُمْ اِذْ جَآءَتْكُمْ جُنُوْدٌ » [ الأحزاب : ۹ ] حدیبیہ «اِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا » [ الفتح : ۱ ] فتح مکہ «اِذَا جَآءَ نَصْرُ اللّٰهِ وَ الْفَتْحُ» [ النصر : ۱ ] یہودی قبائل «هُوَ الَّذِيْۤ اَخْرَجَ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ مِنْ دِيَارِهِمْ لِاَوَّلِ الْحَشْرِ » [ الحشر : ۲ ] اور منافقین سے معاملات وغیرہ سب شامل ہیں اور سب کا ذکر قرآن و حدیث میں مختلف مقامات پر موجود ہے، مگر ان کو یہاں بطور تمہید ذکر فرما کر اصل تذکرہ حنین کے دن کیے جانے والے انعام کا فرمایا اور اس کی وجہ بھی بیان فرمائی۔ حنین مکہ معظمہ اور طائف کے درمیان ایک وادی ہے، وہاں فتح مکہ (رمضان ۸ھ) کے ایک ماہ بعد شوال ۸ھ میں مسلمانوں کی ہوازن، ثقیف، بنو جشم، بنو سعد اور بعض دوسرے قبائل سے جنگ ہوئی تھی۔ ¤ ➋ { وَ يَوْمَ حُنَيْنٍ اِذْ اَعْجَبَتْكُمْ كَثْرَتُكُمْ …:} نبی صلی اللہ علیہ وسلم کے ساتھ دس ہزار کا لشکر تو ان مہاجرین و انصار کا تھا جو فتح مکہ کے لیے آپ کے ساتھ مدینہ سے آئے تھے اور دو ہزار آدمی آپ کے ساتھ اہل مکہ ( طلقاء) میں سے شامل ہو گئے تھے۔ اس طرح مسلمانوں کا کل لشکر بارہ ہزار لڑنے والوں پر مشتمل تھا، جبکہ اس کے مقابلے میں دشمنوں کی تعداد صرف چار ہزار کے قریب تھی، اس پر بہت سے مسلمانوں میں عجب (خود پسندی) اور ایک قسم کا غرور پیدا ہو گیا، حتیٰ کہ بعض نے کہا آج ہم قلت تعداد کی وجہ سے مغلوب نہیں ہوں گے۔ یہ کلمہ اللہ تعالیٰ کو پسند نہ آیا۔ (ابن کثیر) جابر رضی اللہ عنہ بیان کرتے ہیں کہ جب ہم وادی حنین کی طرف چلے تو ہم تہامہ کی وادیوں میں سے ایک وادی میں اترے، وادی بڑی وسیع و عریض تھی، اس میں اوپر نیچے ٹیلے اور چھوٹی چھوٹی ڈھلوانی پہاڑیاں تھیں، ہم اوپر چڑھتے اور نیچے اترتے ہوئے آگے کی جانب بڑھتے اور لڑھکتے جا رہے تھے، ابھی صبح کا اندھیرا تھا، دشمن ہمارے لیے مختلف گھاٹیوں، کناروں اور تنگ گزر گاہوں میں پورے اتفاق اور مقابلے کی تیاری کے ساتھ چھپے بیٹھے تھے۔ اللہ کی قسم! ہمیں اترتے اترتے پتا ہی نہ چلا کہ دشمن نے مل کر اس طرح حملہ کیا جیسے ایک آدمی کرتا ہے۔ (دوسری روایات میں ہے کہ وہ زبردست نشانہ باز تھے، انھوں نے تیروں کی بوچھاڑ کر دی) لوگ شکست کھا کر واپس پلٹے، وہ بھاگے جاتے تھے اور کوئی کسی کو مڑ کر نہیں دیکھتا تھا، رسول اللہ صلی اللہ علیہ وسلم دائیں طرف ایک جگہ ہو گئے، پھر فرمایا : ’’لوگو ! میری طرف توجہ کرو، میری طرف آؤ، میں رسول اللہ ہوں، میں محمد بن عبد اللہ ہوں۔‘‘ کہیں سے جواب نہیں آ رہا تھا، اونٹ ایک دوسرے پر گرتے پڑتے بھاگ رہے تھے، لوگ ادھر ادھر نکل گئے، سوائے مہاجرین و انصار کے ایک گروہ اور آپ کے خاندان کے لوگوں کے جو زیادہ نہ تھے۔ ابو بکر اور عمر رضی اللہ عنہما آپ کے ساتھ ڈٹے رہے، آپ کے خاندان والوں میں سے علی بن ابو طالب، عباس بن عبدالمطلب، ان کے بیٹے فضل، ابو سفیان بن حارث اور ایمن بن عبید جو ام ایمن کے بیٹے تھے اور اسامہ بن زید رضی اللہ عنہم ۔ [ أحمد : 376/3، ح : ۱۵۰۲۷، وحسنہ شعیب الأرنؤوط۔ ابن حبان : ۴۷۷۴ ] ¤ عباس رضی اللہ عنہ بیان کرتے ہیں کہ میری آواز بڑی بلند تھی، اس وجہ سے اللہ کے رسول صلی اللہ علیہ وسلم نے مجھے حکم دیا : ’’ اے عباس ! کیکر ( کے درخت) والوں کو آواز دو۔‘‘ چنانچہ میں نے بلند آواز سے پکارا کہ کیکر ( تلے بیعت رضوان کرنے) والے کہاں ہیں ؟ اللہ کی قسم! ان لوگوں نے جب میری آواز سنی تو وہ ’’ ہم حاضر ہیں، ہم حاضر ہیں‘‘ کہتے ہوئے اس طرح دوڑے جس طرح گائے اپنے بچے کی طرف دوڑتی ہے۔ عباس رضی اللہ عنہ فرماتے ہیں کہ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے کنکر پکڑے اور دشمنوں کی طرف پھینکے، اس کے ساتھ ہی رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ محمد کے رب کی قسم ! وہ شکست کھا گئے۔‘‘ [ مسلم، الجہاد، باب غزوۃ حنین : ۱۷۷۵ ] یہ وہ وقت ہے جب مسلمان جم گئے اور فرشتے نازل ہوئے : «وَ اَنْزَلَ جُنُوْدًا لَّمْ تَرَوْهَا » ’’اور اس نے ایسے لشکر اتارے جنھیں تم نے نہیں دیکھا۔‘‘ ¤ ➌ { وَ عَذَّبَ الَّذِيْنَ كَفَرُوْا…:} اللہ تعالیٰ نے کفار کو یہ سزا دی کہ انھیں شکست فاش ہوئی، ان کے بچے اور عورتیں لونڈی و غلام اور ان کے اموال مسلمانوں کی غنیمت بنے، بہت سے بڑے بھی اسیر ہوئے اور دنیا میں کفار کی یہی جزا ہے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت27) ➊ {ثُمَّ يَتُوْبُ اللّٰهُ مِنْۢ بَعْدِ ذٰلِكَ عَلٰى مَنْ يَّشَآءُ:} چنانچہ غزوۂ حنین کے تقریباً بیس روز بعد ہوازن کے بقیہ لوگ مسلمان ہو کر جعرانہ کے مقام پر نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے، رسول اللہ صلی اللہ علیہ وسلم کا ان لوگوں سے رضاعی رشتہ بھی تھا، کیونکہ آپ کی رضاعی ماں حلیمہ رضی اللہ عنہا انھی سے تھیں۔ اللہ تعالیٰ نے ان سب کو مسلمان ہونے کی توفیق بخشی، یہ اپنے اموال اور قیدی واپس لینے کی درخواست لے کر آئے۔ آپ نے فرمایا : ’’تم نے آنے میں دیر کر دی، میں نے غنیمت تقسیم کرنے سے پہلے تمھارا بہت انتظار کیا، اب دیکھ رہے ہو یہ لشکر میرے ساتھ ہے، اب ایک چیز کا انتخاب کر لو، یا اپنے اموال لے لو یا قیدی۔‘‘ انھوں نے کہا، آپ ہمارے قیدی آزاد کر دیں۔ چنانچہ آپ نے ان کے قیدی جو ابن کثیر کے مطابق (عورتیں بچے ملا کر) چھ ہزار تھے، سب مسلمانوں کو ترغیب دلا کر آزاد کر دیے، البتہ مال غنیمت واپس نہیں کیا۔ [ بخاری، المغازی، باب قول اللہ تعالٰی : { ویوم حنین…} : ۴۳۱۸، ۴۳۱۹ ] ¤ ➋ حافظ ابن قیم رحمہ اللہ نے فرمایا کہ اللہ تعالیٰ نے عرب کے غزوات کاآغاز بدر سے اور خاتمہ حنین سے کیا، اس لیے یہاں دونوں کو یکے بعد دیگرے ملا کر ذکر فرمایا، ان دونوں کے درمیان سات سال کا فاصلہ تھا، اس کے ساتھ ہی رسول اللہ صلی اللہ علیہ وسلم اور مسلمانوں کے مقابلے میں عرب کی جنگ کا انگارا بجھ گیا۔ پہلی جنگ نے انھیں خوف زدہ کرکے ان کی قوت توڑ دی تھی، آخری جنگ نے ان کی قوت کا خاتمہ کر دیا، ان کا اسلحہ بے اثر کر دیا اور ان کی جماعت کو اس طرح پیسا کہ ان کے لیے اسلام میں داخل ہونے کے سوا کوئی چارہ نہ رہا۔ ادھر اس آخری جنگ میں مسلمانوں کو یہ سبق بھی خوب یاد کروا دیا کہ جنگ میں فتح تمھاری کثرت یا اسلحہ کی برتری کی وجہ سے نہیں بلکہ دین کی برکت اور اللہ کی مدد سے حاصل ہوتی ہے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت28) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنَّمَا الْمُشْرِكُوْنَ نَجَسٌ … :} زمخشری نے فرمایا : {’’ نَجَسٌ ‘‘ } مصدر ہے، کہا جاتا ہے {’’ نَجَِسَ نَجَسًا وَ قَذَِرَ قَذَرًا} (ع، ن) ‘‘ گندا، ناپاک، پلید ہونا۔ گویا تمام مشرک اتنے ناپاک ہیں کہ یوں سمجھو کہ وہ سراسر نجاست ہیں۔ ناپاک ہونے سے مراد یہ ہے کہ وہ عقائد و اعمال اور اخلاق کے لحاظ سے گندے ہیں، ان کی نجاست معنوی نجاست ہے، بدن ناپاک ہونا مراد نہیں کہ اسے ہاتھ لگنے یا اس کے ہاتھ لگانے سے کوئی چیز پلید ہو جاتی ہو، اس لیے اہل کتاب عورتوں سے نکاح کرنا، انھیں لونڈی و غلام بنا کر خدمت لینا جائز ہے اور یہ بھی ثابت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک مشرک عورت کے مشکیزوں کا پانی پیا۔ [ بخاری : ۳۵۷۱ ] اور آپ نے خیبر کے یہود کی دعوت قبول فرمائی۔ [ بخاری : ۲۶۱۷ ] اس سے ثابت ہوتا ہے کہ ان کا ہاتھ یا جسم لگنے سے کوئی چیز پلید نہیں ہوتی۔ ویسے اگر دیکھا جائے تو مشرک بدنی طور پر بھی طہارت کا اہتمام نہیں کرتے، نہ استنجا، نہ غسل جنابت، نہ زیر ناف کی صفائی، نہ کسی نجاست سے اجتناب، پھر خنزیر کھانا، سگریٹ اور شراب پینا اور زنا کرنا ان کی عام روش ہے۔ الغرض مشرک جتنا بھی صاف ستھرا ہو، فرانس وغیرہ کی بنی ہوئی خوشبو جتنی بھی لگا لے اس کے جسم اور کپڑوں سے بد بو ختم نہیں ہوگی۔ مسلمان جتنا بھی میلا کچیلا ہو اس سے اس قسم کی بد بو کبھی نہیں آئے گی، بشرطیکہ نماز پڑھتا ہو، اگر نماز ہی نہیں پڑھتا تو مشرک کا اور اس کا معاملہ ایک جیسا ہی ہے۔ یہ عام مشاہدے کی بات ہے، اس لیے کفار کو مسلمان ہونے سے پہلے غسل کی تاکید کی جاتی ہے۔ اللہ تعالیٰ نے مشرکوں کو ناپاک قرار دے کر آئندہ کے لیے مسجد حرام کے قریب آنے سے بھی منع فرما دیا، چنانچہ جیسا کہ پہلے گزرا ہے ۹ھ میں رسول اللہ صلی اللہ علیہ وسلم نے اعلان کروایا کہ اس سال کے بعد کوئی مشرک ہر گز حج نہیں کرے گا۔ قریب آنے سے ممانعت کا صاف مطلب ہے کہ غیر مسلم کا پورے حرم مکہ میں داخلہ منع ہے۔ مسند احمد کی ایک روایت ابن کثیر نے جابر رضی اللہ عنہ سے نقل فرمائی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ہمارے اس سال کے بعد ہماری اس مسجد میں ذمی اور ان کے خادم کے سوا کوئی نہ آئے۔‘‘ مسند احمد میں ایک اور روایت ہے : ’’ہماری اس مسجد میں ہمارے اس سال کے بعد اہل کتاب اور ان کے خادموں کے سوا کوئی داخل نہ ہو۔‘‘ مگر یہ دونوں روایتیں ثابت نہیں۔ شعیب الارنؤوط نے دونوں کی سند کو ضعیف کہا ہے، حسن بصری نے جابر رضی اللہ عنہ سے نہیں سنا اور دو راوی اشعث بن سوار اور شریک ضعیف ہیں، لہٰذا کسی بھی غیر مسلم کو حرم مکہ میں داخلے کی اجازت نہیں، بلکہ اپنی آخری وصیت میں تو آپ صلی اللہ علیہ وسلم نے مشرکین اور یہود و نصاریٰ کو جزیرۂ عرب ہی سے نکال دینے کا حکم دیا تھا، چنانچہ اس وصیت کے مطابق امیر المومنین عمر رضی اللہ عنہ نے یہود و نصاریٰ کو بھی جزیرۂ عرب سے نکال دیا۔ ¤ ➋ مسجد حرام کے سوا دوسری مساجد میں غیر مسلم داخل ہو سکتا ہے، جیسا کہ نبی صلی اللہ علیہ وسلم نے بعض مشرکوں کو اپنی مسجد میں آنے کی اجازت دی اور ثمامہ کو مسجد کے ستون سے باندھنے کا واقعہ تو مشہور ہی ہے۔ ¤ ➌ { وَ اِنْ خِفْتُمْ عَيْلَةً … : } غیر مسلموں کی سال بھر تجارت اور حج و عمرہ کے لیے آمد و رفت بند ہونے سے وہ سامان تجارت جو وہ لایا کرتے تھے اور دوسرے مالی فوائد جوان کی آمد سے اہل مکہ کو حاصل ہوتے تھے، لازماً ختم ہوتے تھے، تو اللہ تعالیٰ نے اس اندیشے کو رفع کرنے اور مسلمانوں کو تسلی دینے کے لیے یہ الفاظ نازل فرمائے کہ تجارت اور کاروبار کی بندش کی فکر مت کرو، اللہ تعالیٰ چاہے گا تو تمھیں ضرور غنی کر دے گا، وہ سب کچھ جانتا ہے، یہ تو اس کے لیے کوئی بات ہی نہیں کہ وہ مسلمانوں کو کیسے غنی کرتا ہے، مگر اس کا ہر کام اور ہر طریقہ حکمت پر مبنی ہے۔ چنانچہ اس کے بعد فتوحات عالم کا وہ سلسلہ شروع ہوا کہ قیصر و کسریٰ کے خزانے مسلمانوں کے ہاتھ آئے اور وہ سب اللہ کے فضل سے غنی ہو گئے، پھر حج و عمرہ کرنے والے مسلمانوں کی اتنی کثرت ہوئی کہ اہل مکہ کے لیے فقر کا مسئلہ ہی نہ رہا۔ اس وقت ۱۴۳۱ھ میں تقریباً ۳۵ یا ۴۰ لاکھ حاجیوں نے حج ادا کیا ہے اور حکومت سعودیہ کا اندازہ ہے کہ چند ہی سال میں یہ تعداد ایک کروڑ تک پہنچ جائے گی اور حکومت اس کے مطابق باقاعدہ حرم کی عمارات اور رہائشی عمارات کی توسیع کے منصوبے پر نہایت تیزی کے ساتھ عمل کر رہی ہے۔ ¤ ➍ { اِنْ شَآءَ:} یہ بطور شرط نہیں بلکہ بات کو پختہ کرنے کے لیے ہے، کیونکہ ہر معاملہ اللہ کی مشیت پر موقوف ہے ۔تفصیل کے لیے دیکھیے سورۂ فتح (۲۷)۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت29) ➊ {قَاتِلُوا الَّذِيْنَ لَا يُؤْمِنُوْنَ بِاللّٰهِ … :} مشرکین عرب سے قتال ( لڑائی) کا حکم دینے کے بعد اب اہل کتاب سے قتال کا حکم دیا جا رہا ہے اور اس کی چار وجہیں بیان فرمائی ہیں : (1) ان کا اللہ تعالیٰ پر ایمان نہیں ہے۔ رہا ان کا اللہ تعالیٰ پر ایمان کا دعویٰ تو وہ درست نہیں، کیونکہ وہ اس کے مطابق نہیں جو رسول اللہ صلی اللہ علیہ وسلم اور تمام رسولوں نے بتایا، بلکہ وہ اللہ پر ایمان کے بجائے اللہ تعالیٰ کی توہین والا عقیدہ رکھتے ہیں، چنانچہ اللہ تعالیٰ نے اگلی آیت میں فرمایا : «وَ قَالَتِ الْيَهُوْدُ عُزَيْرُ ا۟بْنُ اللّٰهِ وَ قَالَتِ النَّصٰرَى الْمَسِيْحُ ابْنُ اللّٰهِ » [ التوبۃ : ۳۰ ] ’’اور یہودیوں نے کہا عزیر اللہ کا بیٹا ہے اور نصاریٰ نے کہا مسیح اللہ کا بیٹا ہے۔‘‘ یعنی یہود و نصاریٰ اللہ تعالیٰ کا بیٹا قرار دے کر اسے محتاج ثابت کر رہے ہیں اور اس کی وحدانیت کا انکار کر رہے ہیں۔ (2) یوم آخرت پر بھی ان کا ایمان کالعدم ہے، کیونکہ ایک تو وہ خاتم النّبیین صلی اللہ علیہ وسلم پر ایمان نہیں رکھتے اور جو آپ کے بتانے کے مطابق نہ ہو وہ نہ ہونے کے برابر ہے اور پھر بھی وہ اپنے تمام اعمال بد کے باوجود جنت کے ٹھیکیدار ہونے کے دعوے دار ہیں، فرمایا : «وَ قَالُوْا لَنْ يَّدْخُلَ الْجَنَّةَ اِلَّا مَنْ كَانَ هُوْدًا اَوْ نَصٰرٰى » [ البقرۃ : ۱۱۱ ] ’’جنت میں ہر گز داخل نہیں ہوں گے مگر جو یہودی یا نصاریٰ بنیں گے۔‘‘ پھر یہودیوں نے زیادہ سے زیادہ چند دن جہنم میں رہنے کی یعنی : «وَ قَالُوْا لَنْ تَمَسَّنَا النَّارُ اِلَّاۤ اَيَّامًا مَّعْدُوْدَةً » [ البقرۃ : ۸۰ ] اور عیسائیوں نے مسیح علیہ السلام کو اپنے گناہوں کا کفارہ قرار دے کر سرے ہی سے جہنم سے محفوظ رہنے کی آرزوئیں دل میں پال رکھی ہیں۔ کیا کوئی بھی سلیم العقل انسان ایسے یوم آخرت کو یوم جزا سمجھ سکتا ہے؟ اگر کوئی کہے کہ یہ بات تو اب بعض مسلمانوں میں بھی آ چکی ہے کہ وہ رسول اللہ صلی اللہ علیہ وسلم اور اپنے پیشواؤں کے اعتماد پر جہنم سے بے فکر ہو چکے ہیں، تو اس کا جواب یہ ہے کہ یہ لوگ بھی انھی کے نقش قدم پر چل رہے ہیں، جبکہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی امت کو ان کے پیچھے چلنے سے منع فرمایا تھا۔ (3) وہ ان چیزوں کو حرام نہیں سمجھتے جو اللہ اور اس کے رسول نے حرام کی ہیں۔ رسول اللہ صلی اللہ علیہ وسلم پر تو ان کا ایمان ہی نہیں، اس لیے ان کی حرام کردہ کو حرام سمجھنا تو دور کی بات ہے، وہ اپنی کتاب تورات میں مذکور حرام چیزوں کو بھی حرام نہیں سمجھتے۔ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں انھوں نے سود لینا، رشوت اور حرام کھانا اختیار کر رکھا تھا، فرمایا : «وَ اَخْذِهِمُ الرِّبٰوا وَ قَدْ نُهُوْا عَنْهُ وَ اَكْلِهِمْ اَمْوَالَ النَّاسِ بِالْبَاطِلِ » [ النساء : ۱۶۱ ] یعنی ان پر لعنت کا سبب ان کا سود لینا تھا، حالانکہ انھیں اس سے منع کیا گیا تھا اور لوگوں کا مال باطل طریقے سے کھانا بھی لعنت کا سبب تھا۔ نصرانیوں نے ایک نیا دین رہبانیت نکال لیا تھا، فرمایا : «وَ رَهْبَانِيَّةَ اِبْتَدَعُوْهَا مَا كَتَبْنٰهَا عَلَيْهِمْ » [ الحدید  : ۲۷ ] ’’اور رہبانیت، اسے انھوں نے خود ہی ایجاد کر لیا، ہم نے اسے ان پر نہیں لکھا تھا۔‘‘ اور اب تو یہود و نصاریٰ نے مروت و انسانیت کی ہر حد پار کر کے زنا، قوم لوط کے عمل اور بے شمار خلاف فطرت کاموں کو جمہوریت کے نام پر حلال قرار دے دیا ہے اور تمام دنیا کو زور و زبردستی سے ان میں مبتلا کرنے کی جد و جہد شروع کر رکھی ہے۔ (4) وہ دین حق قبول نہیں کرتے، حالانکہ اسے قبول کرنے کے لیے ان کے انبیاء کے صریح احکام موجود ہیں اور اسلام کے حق ہونے کے واضح دلائل ان کے سامنے ہیں۔ ¤ حافظ ابن کثیر رحمہ اللہ نے فرمایا کہ اس آیت میں اللہ تعالیٰ نے مسلمانوں کو اہل کتاب سے لڑنے کا حکم دیا۔ یہ ۹ ھ کی بات ہے، آپ نے رومیوں سے جہاد کی تیاری کی، لوگوں کو اس کے لیے دعوت دی، مدینہ کے ارد گرد سے بھی لوگوں کو بلایا، تقریباً تیس ہزار مجاہد لے کر آپ روانہ ہوئے، مدینہ اور اس کے ارد گرد کے منافقین ہی پیچھے رہ گئے، یا چند مخلص مسلمان۔ آپ نے شام کا رخ کیا، تبوک تک پہنچے، تقریباً بیس دن وہاں ٹھہرے، مگر رومی سامنے نہ آئے اور آپ اس علاقے کے لوگوں سے معاہدے کر کے واپس آ گئے۔ (ملخصاً) اس کے بعد خلفائے راشدین،بنو امیہ، بنو عباس اور دوسرے خلفاء نے یہ سلسلہ جاری رکھا تو مسلمانوں کی عزت اور غلبہ بھی قائم رہا اور مشرق سے مغرب تک ان کی حکومت بھی رہی، مگر افسوس! جب مسلمانوں نے اس حکم کو بھلا دیا تو اللہ تعالیٰ کے شرعی اور کونی نظام کی مخالفت کے نتیجے میں انھیں خود ذلیل ہو کر زندگی گزارنا قبول کرنا پڑا۔ ہاں ایک گروہ ہے جو اس پر اب بھی قائم ہے اور قائم رہے گا اور رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق غالب رہے گا۔ ¤ ➋ {حَتّٰى يُعْطُوا الْجِزْيَةَ عَنْ يَّدٍ وَّ هُمْ صٰغِرُوْنَ:} اس سے معلوم ہوا کہ جہاد کا مقصد ان کو تلوار کے زور سے مسلمان بنانا نہیں، بلکہ اگر وہ اطاعت قبول کر لیں اور جزیہ دیتے رہیں تو وہ اپنے دین پر رہ کر پر امن زندگی گزار سکتے ہیں، اس کے عوض اسلامی حکومت ان کے جان و مال کی حفاظت کی ذمہ دار ہو گی۔ یہاں صرف اہل کتاب سے جزیہ لینے کا ذکر ہے، یعنی اہل کتاب کے سامنے تین راستے ہیں، مسلمان ہو جائیں یا جزیہ دے کر ماتحتی قبول کر لیں یا لڑائی کے لیے تیار ہو جائیں۔ رہے دوسرے کفار تو عرب کے مشرکین کے سامنے دو ہی راستے تھے، اسلام قبول کریں یا قتل ہونے کے لیے تیار ہو جائیں، الا یہ کہ وہ اس سے پہلے ہی جزیرۂ عرب سے نکل جائیں۔ رسول اللہ صلی اللہ علیہ وسلم نے مجوس سے بھی اہل کتاب والا معاملہ کیا۔ [ بخاری، الجزیۃ، باب الجزیۃ والموادعۃ مع أھل الذمۃ والحرب : ۳۱۵۶، عن عبد الرحمن بن عوف رضی اللہ عنہ ] باقی دنیا کے مشرکین کے متعلق تاریخ اسلام میں مشرکین عرب والے سلوک کا کہیں ذکر نہیں، مثلاً ہندو، بدھ اور دوسرے بت پرست وغیرہ، بلکہ مسلمانوں نے انھیں بھی اپنی رعایا بنا کر ان سے بہترین سلوک کیا۔ اگر اسلامی لڑائی کا مقصد لوگوں کو زبردستی مسلمان بنانا ہوتا تو جس طرح عیسائیوں نے اندلس میں اسلام اور مسلمانوں کا نام و نشان عیسائی نہ ہونے پر مٹا دیا، اسی طرح مصر، شام، عراق، ایران، ہند، چین، ترکستان وغیرہ ہر جگہ سے بزور شمشیر کفار کو ختم کر دیا جاتا۔ برصغیر میں مسلمان اقلیت میں نہ ہوتے، بلکہ سارا ہند مسلمان ہوتا اور یہاں کفار کا نام و نشان تک نہ ہوتا، مگر اللہ تعالیٰ نے اس سے منع فرمایا، ارشاد ہوتا ہے : «لَاۤ اِكْرَاهَ فِي الدِّيْنِ» [ البقرۃ : ۲۵۶ ] ’’دین میں زبردستی نہیں۔‘‘ جو مسلمان ہو سوچ سمجھ کر مسلمان ہو۔ ہاں یہ بات حق ہے کہ اللہ تعالیٰ کو یہ کسی طرح قبول نہیں کہ دنیا میں اللہ کے باغی غالب ہوں اور اسلام اور مسلمان مغلوب ہو کر رہیں، کیونکہ اس صورت میں نہ دنیا میں امن قائم ہو سکتا ہے نہ فتنہ و فساد ختم ہو سکتا ہے۔ امن صرف اسلام ہی کے ذریعے سے ممکن ہے، اس لیے تمام دنیا کے کفار سے اسلام قبول کرنے یا جزیہ دینے تک لڑتے رہنے کا حکم دیا گیا اور یہ بھی ضروری قرار دیا گیاکہ کفار میں اتنی قوت کبھی نہ ہونے پائے کہ وہ مسلمانوں کے مقابلے میں آ سکیں، بلکہ لازم ہے کہ وہ اسلام کے مقابلے سے دستبردار ہو کر خود اپنے ہاتھوں سے جزیہ دیں اور حقیر ہو کر رہیں۔ {’’ صٰغِرُوْنَ‘‘ } کا معنی یہی ہے کہ وہ محکوم بن کر اسلام کے سائے میں زندگی بسر کریں۔ اس جزیے کی رقم کا تعین ہر علاقے کے لوگوں کی مالی حالت کو مد نظر رکھ کر کیا جائے گا، جو ان کے ہر شخص کی طرف سے ہر سال ادا کیا جائے گا۔ معاذ رضی اللہ عنہ یمن گئے تو رسول اللہ صلی اللہ علیہ وسلم نے انھیں ہر بالغ سے ایک دینار یا اس کے برابر وہاں کے بنے ہوئے کپڑے وصول کرنے کا حکم دیا۔ [ أبو داوٗد، الخراج، باب فی أخذ الجزیۃ : ۳۰۳۸ ]"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت30) ➊ {وَ قَالَتِ الْيَهُوْدُ عُزَيْرُ اِبْنُ اللّٰهِ …:} پچھلی آیت میں اہل کتاب کے ساتھ قتال کی چار وجوہ بیان فرمائی تھیں، اب ان میں سے بعض کی تفصیل بیان ہوئی ہے۔ فرمایا کہ یہود نے عزیر علیہ السلام کو اور نصاریٰ نے مسیح علیہ السلام کو اللہ کا بیٹا قرار دیا، جب کہ اللہ تعالیٰ نے فرمایا : «قُلْ هُوَ اللّٰهُ اَحَدٌ (1) اَللّٰهُ الصَّمَدُ (2) لَمْ يَلِدْ وَ لَمْ يُوْلَدْ (3) وَ لَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ» [ الإخلاص ] ’’کہہ دے اللہ ایک ہے، اللہ ہی بے نیاز ہے، نہ اس نے کسی کو جنا اور نہ وہ جنا گیا اور نہ کبھی کوئی اس کے برابر کا ہے۔‘‘ ظاہر ہے اللہ تعالیٰ کا بیٹا ماننے کی صورت میں اس کی بیوی بھی ماننا پڑے گی اور خاوند، بیوی، باپ، بیٹا ایک ہی جنس سے ہوتے ہیں، جبکہ اللہ تعالیٰ ان سب چیزوں سے پاک ہے۔ الغرض ان سے قتال کی وجہ یہ ہے کہ وہ اللہ پر ایمان نہیں رکھتے اور اس کے متعلق ان کا عقیدہ سراسر اللہ تعالیٰ کی توہین اور متعدد معبودوں کو ماننا ہے، تثلیث (تین خدا ماننا) ہو یا حلول (کسی انسان یا مخلوق میں اللہ کا اتر آنا) یا اتحاد کسی انسان کا خدا بن جانا، ان سب کو قرآن نے کفر قرار دیا۔ دیکھیے سورۂ مائدہ (۷۲، ۷۳) پھر جو شخص ہر چیز ہی کو اللہ تعالیٰ قرار دے، ’’ ہر میں ہر‘‘ کا نعرہ لگائے، وحدت الوجود کو معرفت قرار دے اس کے کفر میں کیا شک ہے؟ اسی طرح اب اگر کوئی مسلمان بھی یہ عقیدہ رکھے کہ نبی صلی اللہ علیہ وسلم خود اللہ تعالیٰ ہی تھے، یا اس کے نور کا ٹکڑا تھے، یا اولیاء میں اللہ تعالیٰ اتر آتا ہے، یا ترقی کر کے ولی بھی اللہ تعالیٰ بن جاتا ہے اور اس کے اختیارات کا مالک بن جاتا ہے، اس لیے وہ {’’ أَنَا الْحَقُّ ‘‘} (میں ہی حق یعنی اللہ ہوں) کا نعرہ لگاتا ہے اور {’’سُبْحَانِيْ مَ مَا اَعْظَمَ شَانِيْ‘‘} (میں پاک ہوں، میری شان کتنی بڑی ہے) کہتا ہے، تو بے شک یہ مسلمان کہلاتا رہے حقیقت میں یہود و نصاریٰ میں اور اس میں کوئی فرق نہیں اور ہندوؤں کے کروڑوں خداؤں کے عقیدے اور اس کے عقیدے میں بھی کوئی فرق نہیں۔ اس خبیث عقیدے سے تو تمام دین، تمام انبیاء و رسل اور ان کے احکام ہی بے کار ٹھہرتے ہیں۔ ایسے عقیدے والا شخص اپنے آپ کو تصوف یا معرفت یا طریقت کے پردوں میں لاکھ چھپائے، حقیقت میں وہ اللہ تعالیٰ کی تمام شریعتوں، رسولوں، کتابوں اور ان کے احکام کا منکر ہے، جس نے لوگوں کو گمراہ کرنے کے لیے تقدس کا لبادہ اوڑھ رکھا ہے۔ ¤ ➋ { ذٰلِكَ قَوْلُهُمْ بِاَفْوَاهِهِمْ:} یعنی نہ عقل سے اس کی کوئی دلیل پیش کی جا سکتی ہے نہ نقل سے، محض منہ کی بے کار بات ہے، جیسے خواہ مخواہ کوئی شخص مہمل اور بے معنی باتیں کرتا رہے۔ ¤ ➌ { يُضَاهِـُٔوْنَ قَوْلَ الَّذِيْنَ كَفَرُوْا مِنْ قَبْلُ:} یعنی ( یہ لوگ) اہل کتاب ہو کر بھی مشرکوں کی ریس کرنے لگے۔ (موضح) اور پہلی مشرک اور کافر قوموں کی طرح گمراہ ہو گئے۔ صاحب المنار فرماتے ہیں کہ شرق و غرب کے قدیم بت پرستوں کی تاریخ سے معلوم ہوتا ہے کہ ابن اللہ ہونے، حلول اور تثلیث ( اور متعدد معبودوں) کا عقیدہ ہند کے برہمنوں میں معروف تھا (اور اب بھی ہے)، اسی طرح چین، جاپان، قدیم مصریوں اور قدیم ایرانیوں میں بھی یہ عقائد مشہور و معروف تھے۔ اہل کتاب بھی ان کفار کی ریس کرنے لگے اور اب بعض مسلمان بھی ان کے نقش قدم پر چل پڑے۔ ¤ ➍ { قٰتَلَهُمُ اللّٰهُ:} یعنی یہ لوگ اس کے حق دار ہیں کہ ان کے حق میں یہ بددعا کی جائے، ورنہ اللہ تعالیٰ کو دعا یا بددعا کی کیا ضرورت ہے ؟ وہ تو خود جو چاہے کر سکتا ہے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت31) ➊ {اِتَّخَذُوْۤا اَحْبَارَهُمْ وَ رُهْبَانَهُمْ … : ’’حَِبْرٌ‘‘} حاء کی زبر اور زیر دونوں کے ساتھ آتا ہے اور باء ساکن ہے، وہ عالم جو بہت خوب صورت اور پختہ بات کہے۔ یہ {’’تَحْبِيْرٌ‘‘} سے ہے جس کا معنی مزین کرنا ہے۔ رہبان، راہب کی جمع ہے، ڈرنے والا، یعنی جو اللہ کے خوف سے دنیا ترک کر کے لوگوں سے الگ کسی کٹیا میں جا ڈیرہ لگائے۔ ان کے مسیح ابن مریم علیھما السلام کو رب بنانے کا ذکر تو اوپر بھی آ چکا ہے، کیونکہ بیٹا باپ کے اختیارات میں اس کا شریک اور جانشین ہوتا ہے، اس لیے مسیح علیہ السلام کو بیٹا ماننے پر ان کو رب بنانے میں کیا کسر رہ گئی۔ رہے ان کے عالم اور درویش تو انھیں رب بنانے والے کچھ لوگ تو وہ تھے جو واقعی کائنات میں ان کا حکم چلنے کا عقیدہ رکھتے تھے، جس طرح آج کل بعض مسلمان پیروں، فقیروں کو سجدہ کرتے، ان سے اولاد، حاجتیں اور مرادیں مانگتے ہیں اور یہ باطل عقیدہ رکھتے ہیں کہ کائنات کو قطب، ابدال اور اوتاد چلارہے ہیں۔ صاف ظاہر ہے کہ یہ لوگ رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق ان پہلوں ہی کے نقش قدم پر چل رہے ہیں، مگر بعض اہل کتاب نے انھیں ایک اور طریقے سے رب بنا رکھا تھا۔ چنانچہ عدی بن حاتم طائی، جو مسلمان ہو چکے تھے، فرماتے ہیں میں نبی صلی اللہ علیہ وسلم کے پاس آیا اور میری گردن میں سونے کی صلیب تھی، آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ بت اپنے آپ سے اتار کر پھینک دو۔‘‘ اور میں نے آپ سے سنا کہ آپ سورۂ براء ت میں یہ آیت پڑھ رہے تھے : «اِتَّخَذُوْۤا اَحْبَارَهُمْ وَ رُهْبَانَهُمْ اَرْبَابًا مِّنْ دُوْنِ اللّٰهِ » میں نے کہا : ’’احبار و رہبان کو رب تو کوئی نہیں مانتا۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ لوگ ان کی عبادت نہیں کیا کرتے تھے، لیکن وہ جب ان کے لیے کوئی چیز حلال کر دیتے اسے حلال سمجھ لیتے اور جب ان پر کوئی چیز حرام کرتے تو اسے حرام سمجھ لیتے۔‘‘ [ ترمذی، التفسیر، باب و من سورۃ التوبۃ : ۳۰۹۵ و حسنہ الألبانی ] ¤ گویا یہ ان کا دوسرا شرک تھا کہ انھوں نے حلال و حرام قرار دینے کا اختیار اپنے مشائخ و علماء کو دے دیا، حالانکہ یہ صرف اللہ تعالیٰ کا حق ہے اور ان پر لازم تھا کہ اپنے نبی کے بتائے ہوئے طریقے اور فرامین پر قائم رہتے۔ بالکل یہی طرز عمل ہمارے زمانے کے مقلدین کا ہے کہ ان کے امام کا قول صاف قرآن یا صحیح حدیث کے خلاف آ جائے تب بھی وہ قرآن اور صحیح حدیث ماننے کے بجائے اپنے امام کے حلال کردہ کو حلال اور اس کے حرام کردہ کو حرام کہیں گے، پھر اس پر اصرار کریں گے، مثلاً قرآن مجید کا صاف حکم ہے کہ رضاعت کی مکمل مدت دو سال ہے، مگر کچھ لوگوں نے اسے ماننے کے بجائے اپنے امام کے کہنے پر اسے اڑھائی سال قرار دے لیا اور رسول اللہ صلی اللہ علیہ وسلم کے صحیح اور صریح فرمان : ’’ہر نشہ آور حرام ہے‘‘ کے باوجود کھجور اور انگور کے سوا کسی بھی چیز سے بنی ہوئی نشہ آور چیز کو حلال قرار دے لیا، زنا کو حلالہ کہہ کر حلال کر لیا، اجرت پر لائی عورت سے زنا پر حد معاف کر دی، تیز دھار آلے اور آگ کے سوا جان بوجھ کر کسی بھی طریقے سے قتل کر دینے پر قصاص ختم کر دیا، بادشاہِ وقت سے اللہ تعالیٰ کی کئی حدود بالکل ہی معاف کر دیں، چور کے چوری کے مال پر ملکیت کے خالی دعوے سے، جس پر وہ کوئی دلیل بھی نہ دے، چوری کی حد ختم کر دی، گانے بجانے اور رقص کو مشائخ کے کہنے پر معرفت اور روح کی غذا قرار دے لیا اور بعض مشائخ و علماء نے عوام سے یہ بیعت لینا شروع کر دی کہ ہمارا ہر حکم، خواہ وہ قرآن و حدیث کے موافق ہو یا مخالف، تم مانو گے۔ بتائیے! ان مسلمانوں کے احبار و رہبان کو رب بنانے میں کیا کسر رہ گئی!؟ خلاصہ یہ کہ رسول اللہ صلی اللہ علیہ وسلم کا وہ فرمان بالکل پورا ہوا کہ تم ہو بہو پہلے لوگوں کے نشان قدم پر چل پڑو گے، پھر ہر گروہ کے اپنے پیشوا کی غلط باتوں پر ڈٹ جانے سے مسلمانوں میں ایسا شگاف پڑا جو قرآن و حدیث کی طرف واپس آنے کے بغیر کبھی پر نہیں ہو سکتا۔ {’’اِتَّسَعَ الْخَرْقُ عَلَي الرَّاقِعِ‘‘} کی صورت پیدا ہو گئی ہے کہ شگاف پیوند لگانے والے کی بساط سے بھی زیادہ کھلا ہو گیا۔ پہلے (۷۲) گروہ بنے تھے یہ (۷۳) بن گئے۔ [ فَإِنَّا لِلّٰہِ وَ إِنَّا إِلَیْہِ رَاجِعُوْنَ ] ¤ ➋ یہودو نصاریٰ کا اپنے احبار و رہبان کو حلال و حرام کا اختیار دینا انھیں رب بنانا تھا، اب جب یہود و نصاریٰ نے احبار و رہبان کے کرتوتوں کو دیکھ کر ان سے بغاوت کر دی تو عوام کی اکثریت کو حلال و حرام کا اختیار دے کر انھیں رب بنا لیا اور اس نئے دین کا نام جمہوریت رکھا، جس میں حلال و حرام کا فیصلہ اللہ تعالیٰ کے حکم کے بجائے پارلیمنٹ کی اکثریت کرتی ہے، جو صریح شرک ہے۔ افسوس کہ مسلمان اس شرک میں ان کے قدم بہ قدم چل رہے ہیں، بلکہ اسلام سے اس بغاوت پر فخر کرتے اور دن رات اس کی تعریف کرتے ہیں اور یہ کہنے میں کوئی حیا محسوس نہیں کرتے کہ رسول اللہ صلی اللہ علیہ وسلم بھی جمہوریت نافذ کرنے کے لیے آئے تھے۔ ان بے چاروں کو معلوم نہیں کہ جمہوریت صرف ان امور میں مشورے کا نام نہیں جہاں اللہ اور اس کے رسول کا حکم موجود نہ ہو بلکہ یہ ایک الگ دین ہے جس کا رب بھی عوام یا ان کے نمائندے ہیں اور رسول بھی۔ انھی کو حلال و حرام اور جائز و ناجائز قرار دینے کا حق حاصل ہے۔ اس دین میں اللہ تعالیٰ، اس کے رسول یا اس کی کتاب کا کچھ دخل نہیں، ہاں دھوکا دینے کے لیے ان کا نام استعمال ہوتا ہے۔ ¤ ➌ { وَ الْمَسِيْحَ ابْنَ مَرْيَمَ:} مسیح ابن مریم علیھما السلام کو دوبارہ لا کر ان کا رب بنانا اس لیے ذکر فرمایا کہ یہودیوں نے عزیر علیہ السلام یا علماء و رہبان کی پرستش اس طرح نہیں کی تھی جس طرح نصاریٰ نے مسیح علیہ السلام کی کی اور نہ وہ اس معنی میں عزیر علیہ السلام کو اللہ کا بیٹا ماننے کا اقرار کرتے ہیں جن معنوں میں نصاریٰ مسیح علیہ السلام کو بغیر باپ کے پیدا ہونے کی وجہ سے اللہ کا بیٹا قرار دیتے ہیں۔رہے احبار و رہبان تو ان کو یہود ونصاریٰ دونوں نے ایک ہی معنی میں رب بنایا تھا۔ پیچھے اللہ تعالیٰ نے آدم علیہ السلام کا ذکر کرکے ان کی اس دلیل کو بھی بے معنی قرار دیا تھا کہ وہ تو باپ اور ماں دونوں کے بغیر پیدا ہوئے تھے، اگر وہ رب نہیں تو ماں سے پیدا ہونے والا کیسے رب ہو گیا؟ ¤ ➍ {وَ مَاۤ اُمِرُوْۤا اِلَّا لِيَعْبُدُوْۤا اِلٰهًا وَّاحِدًا:} یعنی یہ تمام بے ہودگی یہودو نصاریٰ نے تورات میں موجود واضح احکام کے باوجود اختیار کی کہ تم اللہ کے ساتھ کسی کو شریک نہ بنانا، جو اب بھی تورات کی تحریف کے باوجود مختلف الفاظ کے ساتھ اس میں جا بجا موجود ہیں۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت32){يُرِيْدُوْنَ اَنْ يُّطْفِـُٔوْا نُوْرَ اللّٰهِ بِاَفْوَاهِهِمْ … :} اللہ کے نور سے مراد اسلام اور اس کے صدق کے دلائل ہیں جو بے انتہا روشن ہیں۔ اس آیت میں یہودو نصاریٰ کی تیسری قبیح صفت کا بیان ہے کہ وہ اسلام کے پھیلاؤ کو روکنے اور اسے مٹانے کے لیے ہر قسم کی کوششیں کرتے رہتے ہیں۔ یہاں ان کی اسلام کو روکنے اور مٹانے کی تمام کوششوں کے بے کار ہونے کو استعارے کے رنگ میں پیش کیا گیا ہے کہ ایک طرف بہت ہی بڑا نور مثلاً سورج یا چاند ہو اور دوسری طرف اسے بجھانے کی سب سے کمزور کوشش منہ سے پھونکیں مارنا ہو تو ان پھونکوں کا انجام ہر ایک پر واضح ہے۔ اسی طرح ایک طرف اللہ کا نور، یعنی اسلام ہے، جسے اللہ تعالیٰ ہر حال میں پورا کرنا طے کر چکا ہے، دوسری طرف ان یہود و نصاریٰ کی اسے روکنے اور مٹانے کی حقیر اور بے کار کوششیں ہیں، جو سورج کو نہیں بلکہ کائنات کے سب سے بڑے نور کو سب سے حقیر چیز منہ کی پھونکوں سے بجھانا چاہتے ہیں۔ بھلا اس سے وہ نورِ اسلام کی تکمیل کو روک سکتے ہیں؟"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت33) {هُوَ الَّذِيْۤ اَرْسَلَ رَسُوْلَهٗ بِالْهُدٰى وَ دِيْنِ الْحَقِّ … :} اس سے معلوم ہوا کہ اللہ کا دین اس لیے نہیں آیا کہ وہ کسی دوسرے دین، بت پرستی، دہریت، یہودیت، عیسائیت، جمہوریت یا سوشلزم سے مغلوب ہو کر اس سے مصالحت کرکے دنیا میں زندہ رہے، بلکہ دین اسلام کا اول و آخر مقصد یہ ہے کہ وہ دوسرے تمام ادیان اور نظام ہائے زندگی کو مغلوب کرکے ساری دنیا پر غالب دین اور نظام زندگی کی حیثیت سے زندہ رہے۔ یہاں {’’ لِيُظْهِرَهٗ ‘‘} میں ظہور (غلبہ) سے مراد دلائل و براہین کے ساتھ غلبہ بھی ہے اور حکمرانی کے لحاظ سے بھی۔ پہلی قسم کا غلبہ تو ہمیشہ اور دائمی ہے اور آج تک کوئی شخص قرآن کے چیلنج تین آیتوں کی سورت کا جواب لانے کی جرأت نہیں کر سکا۔ دوسری قسم کا غلبہ ایک مرتبہ ہم دورِ نبوت و خلافت میں دیکھ چکے ہیں اور دوبارہ مزید غلبے کی بشارتیں ضرور پوری ہو کر رہیں گی، لیکن اللہ تعالیٰ نے اس کے لیے صحیح مومن ہونے کی شرط لگائی ہے، فرمایا : «وَ اَنْتُمُ الْاَعْلَوْنَ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ » [ آل عمران : ۱۳۹ ] ’’اور تم ہی غالب ہو اگر تم مومن ہو۔‘‘ الحمد للہ مسلمانوں اور کافروں کے درمیان مختلف مقامات پر جہاد کے ساتھ اس کے آثار شروع ہو چکے ہیں۔ ثوبان رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے میرے لیے زمین لپیٹ دی یہاں تک کہ میں نے اس کے مشرق اور مغرب دیکھے اور میری امت کی حکومت وہاں تک پہنچے گی جو میرے لیے اس میں سے لپیٹا گیا ہے۔‘‘ [ مسلم، الفتن، باب ھلاک ھٰذہ الأمۃ بعضھم ببعض: ۲۸۸۹] مقداد بن اسود رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ زمین کی پشت پر نہ کوئی اینٹ کا مکان اور نہ پشم کا (خیمہ) باقی رہے گا، مگر اللہ تعالیٰ اس میں اسلام کا کلمہ داخل کر دے گا، عزت والے کو عزت بخش کر اور ذلیل کو ذلت دے کر، یا تو انھیں عزت بخشے گا تو وہ اس میں داخل ہو جائیں گے، یا انھیں ذلیل کرے گا تو اس کے تحت ہو جائیں گے۔ [ مستدرک حاکم : 430/4، ح : ۸۳۲۴ و صححہ ھو والذھبی ] یہ پیش گوئی ابھی پوری نہیں ہوئی، پوری ہو کر رہے گی۔ (ان شاء اللہ) جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ دین ہمیشہ قائم رہے گا، اس پر مسلمانوں کی ایک قوی جماعت لڑتی رہے گی، حتیٰ کہ قیامت قائم ہو۔‘‘ [ مسلم، الإمارۃ، باب قولہ صلی اللہ علیہ وسلم : لا تزال طائفۃ من أمتی… : ۱۹۲۲ ]"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت35،34) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنَّ كَثِيْرًا مِّنَ الْاَحْبَارِ وَ الرُّهْبَانِ …:} سلسلۂ کلام کو دیکھیں تو یہاں احبار و رہبان سے مراد اہل کتاب کے عالم اور درویش ہیں، مگر الفاظ عام ہونے کی وجہ سے مسلمانوں کے علماء اور زہاد و صوفیا بھی اس میں شامل ہیں۔ اللہ تعالیٰ کا انصاف ملاحظہ فرمائیں کہ سب احبار و رہبان کو ایک جیسا قرار نہیں دیا بلکہ ان میں سے بہت سے لوگوں کا یہ حال بیان فرمایا کہ وہ لوگوں کا مال باطل طریقے سے کھاتے ہیں اور اللہ تعالیٰ کے راستے سے روکتے ہیں۔ دیکھیے سورۂ مائدہ ( ۶۲، ۵۹) رازی نے فرمایا کہ اللہ تعالیٰ نے جب یہود و نصاریٰ کے بہت سے احبار و رہبان کے فخر و کبر، اللہ کے محبوب ہونے، عام لوگوں سے اونچی مخلوق ہونے اور خدائی اختیارات کے دعوؤں کا ذکر کیا تو اب بتایا کہ ان تمام چیزوں کے اظہار سے ان کا مقصود لوگوں سے رشوت لے کر، غلط مسئلے بتا کر، رسول اللہ صلی اللہ علیہ وسلم کے متعلق بشارتوں کو چھپا کر اور ان کو غلط معنی پہنا کر ان کا مال باطل طریقے سے ہتھیانا اور انھیں اللہ کے راستے، یعنی اسلام سے روکنا ہے۔ اللہ جانتا ہے آپ یہود و نصاریٰ کے بہت سے احبارو رہبان کی جگہ آج کل مسلمانوں کے بہت سے احبار و رہبان کا لفظ لگا دیں تو آپ دونوں میں کوئی فرق نہیں پائیں گے، وہی خدا کے محبوب ہونے اور اس سے ہم کلام ہونے کے دعوے، اسی طرح ترک دنیا کا اظہار جس کے پیچھے بدترین حرص چھپی ہوئی ہے، تقدس کا اظہار جس کے پیچھے کتنی عفیفاؤں کی عزت لوٹنے کی وارداتیں موجود ہیں، دین اسلام کے عالم، ستون اور محقق ہونے کے دعوؤں کے باوجود وہ نہایت ڈھٹائی کے ساتھ اپنے یا اپنے پیشواؤں کے اقوال کو اللہ اور اس کے رسول کا حکم کہہ کر پیش کرتے اور اصل قرآن و سنت سے لوگوں کو روکتے ہیں۔ اگر یقین نہ ہو تو کسی گدی نشین، خانقاہ کے شیخ یا دارالعلوم کے حضرت صاحب (الا ما شاء اللہ) کا تجربہ کر لیں، آپ کو وہی فرشتوں جیسی پاکیزگی اور دنیا سے کامل بے رغبتی کے اظہار کے پیچھے بہت کچھ چھپا ہوا مل جائے گا۔ جس سے رسول اللہ صلی اللہ علیہ وسلم کے اس فرمان کی تصدیق ہو گی، آپ نے فرمایا : ’’یقینا تم اپنے سے پہلے لوگوں کے طریقوں پر (برابر) سوار ہو جاؤ گے، جس طرح ایک بالشت دوسری بالشت کے اور ایک ہاتھ دوسرے ہاتھ کے برابر ہوتا ہے۔‘‘ [ مستدرک حاکم 455/4، ح : ۸۴۰۴ ] ہاں، یہ اللہ کا شکر ہے کہ اس دین کی حفاظت کا ذمہ چونکہ اللہ تعالیٰ نے اٹھایا ہوا ہے، اس لیے آپ ہی کی پیش گوئی کے مطابق مسلمانوں میں اصل دین پر قائم رہنے والے اہل حق ہر طبقہ، مثلاً علماء، زہاد، مجاہدین، تجار وغیرہم میں قیامت تک موجود رہیں گے اور اللہ کی مدد سے غالب و منصور رہیں گے، جیسا کہ چند احادیث پچھلی آیت کی تفسیر میں گزری ہیں۔ اللہ تعالیٰ ہمیں بھی اپنے فضل سے ان لوگوں میں شامل فرمائے۔ ¤ ➋ {وَ الَّذِيْنَ يَكْنِزُوْنَ الذَّهَبَ وَ الْفِضَّةَ …:} اس میں {’’ الَّذِيْنَ ‘‘} (وہ لوگ) سے مراد بعض صحابہ اور مفسرین نے یہود و نصاریٰ کے احبار و رہبان ہی لیے ہیں جن کی پہلی دو کمینگیوں (باطل طریقے سے لوگوں کا مال کھانا اور اللہ کی راہ سے روکنا) کے بعد تیسری کمینگی سونا چاندی جمع کرنا بیان فرمائی ہے، کیونکہ بات انھی کی ہو رہی ہے، لیکن اکثر صحابہ اور مفسرین کے مطابق الفاظ کے عام ہونے کا تقاضا یہ ہے کہ یہود و نصاریٰ ہوں یا مسلمان، یہ کمینگی جس میں بھی پائی جائے وہ اس وعید کا مستحق ہے اور حدیث سے بھی اس کی تائید ہوتی ہے، ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’کوئی بھی شخص جو سونے یا چاندی کا مالک ہو، اس سے اس کا حق ادا نہ کرے، اس کے لیے قیامت کے دن آگ سے (اس سونے یا چاندی کی) سلاخیں یا تختے بنائے جائیں گے، پھر جہنم کی آگ میں انھیں خوب گرم کرکے اس کے پہلو، پیشانی اور پیٹھ کو داغا جائے گا، جب وہ ٹھنڈے ہو جائیں گے تو انھیں دوبارہ گرم کر لیا جائے گا، ایک ایسے دن میں جس کی مقدار پچاس ہزار سال ہو گی، یہاں تک کہ بندوں کے درمیان فیصلہ کیا جائے، تو وہ جنت یا آگ کی طرف اپنا راستہ دیکھے گا۔‘‘ (لمبی حدیث ہے جس میں اونٹوں، بکریوں اور گھوڑوں وغیرہ کا حق ادا نہ کرنے والوں کی وعید بھی مذکور ہے) [ مسلم، الزکاۃ، باب إثم مانع الزکاۃ : 987/24 ] ¤ ➌ { وَ لَا يُنْفِقُوْنَهَا فِيْ سَبِيْلِ اللّٰهِ:} اللہ کی راہ میں خرچ کرنا یہ ہے کہ زکوٰۃ دیتا رہے، اس کے علاوہ بھی ضرورت مندوں پر خرچ کرتا رہے، حاجت مندوں کو قرض دے، حق داروں کا حق ادا کرے، جیسا کہ {’’ لَيْسَ الْبِرَّ اَنْ تُوَلُّوْا ‘‘} والی آیت میں زکوٰۃ کے علاوہ بھی مال دینے کا بیان ہے۔ دیکھیے سورۂ بقرہ (۱۷۷) مثلاً اہل خانہ کے اخراجات، مہمان کی ضیافت، مسجد بنانا، جہاد کی تیاری میں مال خرچ کرنا وغیرہ۔ ¤ ➍ { فَبَشِّرْهُمْ بِعَذَابٍ اَلِيْمٍ:} ابوذر غفاری رضی اللہ عنہ نے اس آیت کی رو سے مطلقاً سونا چاندی جمع کرنے کو حرام قرار دیا ہے، مگر جمہور صحابہ جیسے امیر المومنین عمر، ابن عمر، ابن عباس، جابر اور ابوہریرہ رضی اللہ عنہم اس طرف گئے ہیں کہ جس مال کی زکوٰۃ دے دی جائے وہ یہ کنز نہیں ہے اور نہ ہی وہ اس وعید کے تحت آتا ہے۔ ابن عمر رضی اللہ عنہما نے فرمایا : ’’یہ زکوٰۃ کا حکم نازل ہونے سے پہلے کی بات ہے، جب زکوٰۃ کا حکم اترا تو اللہ تعالیٰ نے اسے اموال کے پاک کرنے کا ذریعہ بنا دیا۔‘‘ [ بخاری، التفسیر، باب قولہ عز و جل : { یوم یحمی علیھا } : ۴۶۶۱ ] اگر ضرورت سے زائد سارا مال خرچ کرنا واجب ہو تو میراث اور وصیت وغیرہ کا کچھ مطلب باقی نہیں رہتا اور ایک صحابی کو رسول اللہ صلی اللہ علیہ وسلم نے ارکانِ اسلام بتاتے ہوئے جب زکوٰۃ کے فرض ہونے کا ذکر فرمایا تو اس نے پوچھا : [ هَلْ عَلَيَّ غَيْرُهَا؟ ] ’’کیا مجھ پر اس کے علاوہ بھی فرض ہے؟‘‘ تو آپ صلی اللہ علیہ وسلم نے جواب دیا : [ لاَ إِلاَّ اَنْ تَطَوَّعَ ] ’’نہیں، مگر یہ کہ تو خوشی سے دے۔‘‘ یعنی اس سے زائد فرض نہیں نفل ہے۔ [ بخاری، الإیمان، باب الزکوٰۃ : ۴۶۔ مسلم : ۱۱ ] ¤ زکوٰۃ جس کی ادائیگی سے مال کنز کے حکم میں نہیں رہتا، پاک ہو جاتا ہے، رسول اللہ صلی اللہ علیہ وسلم نے اس کی مقدار مقرر فرمائی۔ چاندی پانچ اوقیہ (۲۰۰ درہم) سے کم پر زکوٰۃ نہیں۔ جب دو سو درہم ہوں اور ان پر سال گزر جائے تو ان میں پانچ درہم زکوٰۃ ہو گی، یعنی اڑھائی فیصد (چالیس میں سے ایک درہم) اور سونے میں جب تک بیس دینار نہ ہوں زکوٰۃ نہیں، جب بیس دینار ہوں اور ان پر سال گزر جائے تو ان میں نصف دینار زکوٰۃ ہے، جو زیادہ ہو اس کی زکوٰۃ اسی حساب سے ہو گی۔ [ أبوداوٗد، الزکاۃ، باب زکاۃ السائمۃ : ۱۵۷۳، عن علی، عن رسول اللہ صلی اللہ علیہ وسلم و صححہ الألبانی ]"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت35،34) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنَّ كَثِيْرًا مِّنَ الْاَحْبَارِ وَ الرُّهْبَانِ …:} سلسلۂ کلام کو دیکھیں تو یہاں احبار و رہبان سے مراد اہل کتاب کے عالم اور درویش ہیں، مگر الفاظ عام ہونے کی وجہ سے مسلمانوں کے علماء اور زہاد و صوفیا بھی اس میں شامل ہیں۔ اللہ تعالیٰ کا انصاف ملاحظہ فرمائیں کہ سب احبار و رہبان کو ایک جیسا قرار نہیں دیا بلکہ ان میں سے بہت سے لوگوں کا یہ حال بیان فرمایا کہ وہ لوگوں کا مال باطل طریقے سے کھاتے ہیں اور اللہ تعالیٰ کے راستے سے روکتے ہیں۔ دیکھیے سورۂ مائدہ ( ۶۲، ۵۹) رازی نے فرمایا کہ اللہ تعالیٰ نے جب یہود و نصاریٰ کے بہت سے احبار و رہبان کے فخر و کبر، اللہ کے محبوب ہونے، عام لوگوں سے اونچی مخلوق ہونے اور خدائی اختیارات کے دعوؤں کا ذکر کیا تو اب بتایا کہ ان تمام چیزوں کے اظہار سے ان کا مقصود لوگوں سے رشوت لے کر، غلط مسئلے بتا کر، رسول اللہ صلی اللہ علیہ وسلم کے متعلق بشارتوں کو چھپا کر اور ان کو غلط معنی پہنا کر ان کا مال باطل طریقے سے ہتھیانا اور انھیں اللہ کے راستے، یعنی اسلام سے روکنا ہے۔ اللہ جانتا ہے آپ یہود و نصاریٰ کے بہت سے احبارو رہبان کی جگہ آج کل مسلمانوں کے بہت سے احبار و رہبان کا لفظ لگا دیں تو آپ دونوں میں کوئی فرق نہیں پائیں گے، وہی خدا کے محبوب ہونے اور اس سے ہم کلام ہونے کے دعوے، اسی طرح ترک دنیا کا اظہار جس کے پیچھے بدترین حرص چھپی ہوئی ہے، تقدس کا اظہار جس کے پیچھے کتنی عفیفاؤں کی عزت لوٹنے کی وارداتیں موجود ہیں، دین اسلام کے عالم، ستون اور محقق ہونے کے دعوؤں کے باوجود وہ نہایت ڈھٹائی کے ساتھ اپنے یا اپنے پیشواؤں کے اقوال کو اللہ اور اس کے رسول کا حکم کہہ کر پیش کرتے اور اصل قرآن و سنت سے لوگوں کو روکتے ہیں۔ اگر یقین نہ ہو تو کسی گدی نشین، خانقاہ کے شیخ یا دارالعلوم کے حضرت صاحب (الا ما شاء اللہ) کا تجربہ کر لیں، آپ کو وہی فرشتوں جیسی پاکیزگی اور دنیا سے کامل بے رغبتی کے اظہار کے پیچھے بہت کچھ چھپا ہوا مل جائے گا۔ جس سے رسول اللہ صلی اللہ علیہ وسلم کے اس فرمان کی تصدیق ہو گی، آپ نے فرمایا : ’’یقینا تم اپنے سے پہلے لوگوں کے طریقوں پر (برابر) سوار ہو جاؤ گے، جس طرح ایک بالشت دوسری بالشت کے اور ایک ہاتھ دوسرے ہاتھ کے برابر ہوتا ہے۔‘‘ [ مستدرک حاکم 455/4، ح : ۸۴۰۴ ] ہاں، یہ اللہ کا شکر ہے کہ اس دین کی حفاظت کا ذمہ چونکہ اللہ تعالیٰ نے اٹھایا ہوا ہے، اس لیے آپ ہی کی پیش گوئی کے مطابق مسلمانوں میں اصل دین پر قائم رہنے والے اہل حق ہر طبقہ، مثلاً علماء، زہاد، مجاہدین، تجار وغیرہم میں قیامت تک موجود رہیں گے اور اللہ کی مدد سے غالب و منصور رہیں گے، جیسا کہ چند احادیث پچھلی آیت کی تفسیر میں گزری ہیں۔ اللہ تعالیٰ ہمیں بھی اپنے فضل سے ان لوگوں میں شامل فرمائے۔ ¤ ➋ {وَ الَّذِيْنَ يَكْنِزُوْنَ الذَّهَبَ وَ الْفِضَّةَ …:} اس میں {’’ الَّذِيْنَ ‘‘} (وہ لوگ) سے مراد بعض صحابہ اور مفسرین نے یہود و نصاریٰ کے احبار و رہبان ہی لیے ہیں جن کی پہلی دو کمینگیوں (باطل طریقے سے لوگوں کا مال کھانا اور اللہ کی راہ سے روکنا) کے بعد تیسری کمینگی سونا چاندی جمع کرنا بیان فرمائی ہے، کیونکہ بات انھی کی ہو رہی ہے، لیکن اکثر صحابہ اور مفسرین کے مطابق الفاظ کے عام ہونے کا تقاضا یہ ہے کہ یہود و نصاریٰ ہوں یا مسلمان، یہ کمینگی جس میں بھی پائی جائے وہ اس وعید کا مستحق ہے اور حدیث سے بھی اس کی تائید ہوتی ہے، ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’کوئی بھی شخص جو سونے یا چاندی کا مالک ہو، اس سے اس کا حق ادا نہ کرے، اس کے لیے قیامت کے دن آگ سے (اس سونے یا چاندی کی) سلاخیں یا تختے بنائے جائیں گے، پھر جہنم کی آگ میں انھیں خوب گرم کرکے اس کے پہلو، پیشانی اور پیٹھ کو داغا جائے گا، جب وہ ٹھنڈے ہو جائیں گے تو انھیں دوبارہ گرم کر لیا جائے گا، ایک ایسے دن میں جس کی مقدار پچاس ہزار سال ہو گی، یہاں تک کہ بندوں کے درمیان فیصلہ کیا جائے، تو وہ جنت یا آگ کی طرف اپنا راستہ دیکھے گا۔‘‘ (لمبی حدیث ہے جس میں اونٹوں، بکریوں اور گھوڑوں وغیرہ کا حق ادا نہ کرنے والوں کی وعید بھی مذکور ہے) [ مسلم، الزکاۃ، باب إثم مانع الزکاۃ : 987/24 ] ¤ ➌ { وَ لَا يُنْفِقُوْنَهَا فِيْ سَبِيْلِ اللّٰهِ:} اللہ کی راہ میں خرچ کرنا یہ ہے کہ زکوٰۃ دیتا رہے، اس کے علاوہ بھی ضرورت مندوں پر خرچ کرتا رہے، حاجت مندوں کو قرض دے، حق داروں کا حق ادا کرے، جیسا کہ {’’ لَيْسَ الْبِرَّ اَنْ تُوَلُّوْا ‘‘} والی آیت میں زکوٰۃ کے علاوہ بھی مال دینے کا بیان ہے۔ دیکھیے سورۂ بقرہ (۱۷۷) مثلاً اہل خانہ کے اخراجات، مہمان کی ضیافت، مسجد بنانا، جہاد کی تیاری میں مال خرچ کرنا وغیرہ۔ ¤ ➍ { فَبَشِّرْهُمْ بِعَذَابٍ اَلِيْمٍ:} ابوذر غفاری رضی اللہ عنہ نے اس آیت کی رو سے مطلقاً سونا چاندی جمع کرنے کو حرام قرار دیا ہے، مگر جمہور صحابہ جیسے امیر المومنین عمر، ابن عمر، ابن عباس، جابر اور ابوہریرہ رضی اللہ عنہم اس طرف گئے ہیں کہ جس مال کی زکوٰۃ دے دی جائے وہ یہ کنز نہیں ہے اور نہ ہی وہ اس وعید کے تحت آتا ہے۔ ابن عمر رضی اللہ عنہما نے فرمایا : ’’یہ زکوٰۃ کا حکم نازل ہونے سے پہلے کی بات ہے، جب زکوٰۃ کا حکم اترا تو اللہ تعالیٰ نے اسے اموال کے پاک کرنے کا ذریعہ بنا دیا۔‘‘ [ بخاری، التفسیر، باب قولہ عز و جل : { یوم یحمی علیھا } : ۴۶۶۱ ] اگر ضرورت سے زائد سارا مال خرچ کرنا واجب ہو تو میراث اور وصیت وغیرہ کا کچھ مطلب باقی نہیں رہتا اور ایک صحابی کو رسول اللہ صلی اللہ علیہ وسلم نے ارکانِ اسلام بتاتے ہوئے جب زکوٰۃ کے فرض ہونے کا ذکر فرمایا تو اس نے پوچھا : [ هَلْ عَلَيَّ غَيْرُهَا؟ ] ’’کیا مجھ پر اس کے علاوہ بھی فرض ہے؟‘‘ تو آپ صلی اللہ علیہ وسلم نے جواب دیا : [ لاَ إِلاَّ اَنْ تَطَوَّعَ ] ’’نہیں، مگر یہ کہ تو خوشی سے دے۔‘‘ یعنی اس سے زائد فرض نہیں نفل ہے۔ [ بخاری، الإیمان، باب الزکوٰۃ : ۴۶۔ مسلم : ۱۱ ] ¤ زکوٰۃ جس کی ادائیگی سے مال کنز کے حکم میں نہیں رہتا، پاک ہو جاتا ہے، رسول اللہ صلی اللہ علیہ وسلم نے اس کی مقدار مقرر فرمائی۔ چاندی پانچ اوقیہ (۲۰۰ درہم) سے کم پر زکوٰۃ نہیں۔ جب دو سو درہم ہوں اور ان پر سال گزر جائے تو ان میں پانچ درہم زکوٰۃ ہو گی، یعنی اڑھائی فیصد (چالیس میں سے ایک درہم) اور سونے میں جب تک بیس دینار نہ ہوں زکوٰۃ نہیں، جب بیس دینار ہوں اور ان پر سال گزر جائے تو ان میں نصف دینار زکوٰۃ ہے، جو زیادہ ہو اس کی زکوٰۃ اسی حساب سے ہو گی۔ [ أبوداوٗد، الزکاۃ، باب زکاۃ السائمۃ : ۱۵۷۳، عن علی، عن رسول اللہ صلی اللہ علیہ وسلم و صححہ الألبانی ]"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت36) ➊ {اِنَّ عِدَّةَ الشُّهُوْرِ عِنْدَ اللّٰهِ اثْنَا عَشَرَ شَهْرًا …:} سورۂ توبہ میں مشرکین سے براء ت اور ان سے جہاد کے درمیان «قَاتِلُوا الَّذِيْنَ لَا يُؤْمِنُوْنَ بِاللّٰهِ » آیت (۲۹) سے لے کر «فَذُوْقُوْا مَا كُنْتُمْ تَكْنِزُوْنَ» آیت (۳۵) تک سات آیات میں اہل کتاب سے قتال اور ان کے تینوں سربرآور دہ طبقات احبار، رہبان اور مال دار لوگوں کے بگاڑ کا ذکر اور مذمت کرنے کے بعد آگے ان دو آیات میں مشرکین کی کچھ مزید خرابیوں کا ذکر فرمایا۔ ¤ ➋ یہود و نصاریٰ کی طرح مشرکین عرب بھی اللہ کے احکام بدلنے کے لیے حیلہ سازی سے کام لیتے تھے، مثلاً آسمان و زمین کی پیدائش کے دن سے تمام ادیان میں یہ طریقہ چلا آ رہا تھا کہ مہینے اور سال شمسی حساب یعنی سورج کے بجائے قمری حساب یعنی چاند کے لحاظ سے معتبر سمجھے جاتے تھے اور تمام عبادات میں یہی تاریخیں ملحوظ رکھی جاتی تھیں، رسول اللہ صلی اللہ علیہ وسلم نے بھی یہی طریقہ قائم رکھا، کیونکہ چاند کی حالت کا روزانہ بدلنا تاریخ کے تعین میں اتنا واضح اور آسان ہے کہ آبادیوں کے علاوہ جنگلوں، پہاڑوں، صحراؤں اور سمندروں میں رہنے والے لوگ کسی کیلنڈر کی محتاجی کے بغیر مہینوں اور سالوں کا حساب آسانی سے معلوم کر سکتے ہیں۔ چنانچہ فرمایا : «هُوَ الَّذِيْ جَعَلَ الشَّمْسَ ضِيَآءً وَّ الْقَمَرَ نُوْرًا وَّ قَدَّرَهٗ مَنَازِلَ لِتَعْلَمُوْا عَدَدَ السِّنِيْنَ وَ الْحِسَابَ» [ یونس : ۵ ] ’’وہی ہے جس نے سورج کو تیز روشنی اور چاند کو نور بنایا اور اس کی منزلیں مقرر کیں، تاکہ تم سالوں کی گنتی اور حساب معلوم کرو۔‘‘ اللہ تعالیٰ نے تمام شرعی احکام قمری حساب کے مطابق رکھے، جس میں دوسری بے شمار حکمتوں کے ساتھ یہ حکمت بھی ہے کہ یہ عبادات ہر سال ایک ہی موسم میں نہ آئیں بلکہ بدل بدل کر آتی رہیں، ورنہ کسی علاقے میں روزے ہمیشہ گرمی میں آتے، کہیں ہمیشہ سردی میں۔ قمری حساب کی وجہ سے حج بھی مختلف موسموں میں آتا ہے، تاکہ مسلمان سختی اور نرمی دونوں حالتوں میں روزہ و حج اور اللہ کے دوسرے احکام ادا کرنے کی عادت ڈال سکیں۔ قمری مہینا ۲۹ یا ۳۰ دن کا ہوتا ہے، نہ اس سے ایک دن کم نہ زیادہ اور سال بارہ ماہ میں ۳۵۴یا ۳۵۵ دنوں کا ہوتا ہے، جبکہ شمسی سال ۳۶۵ دن اور ایک دن کے چوتھائی حصے کے برابر ہوتا ہے اور اس کے بارہ ماہ میں سے کوئی تیس، کوئی اکتیس دن کا اور فروری ۲۸ دن کا ہوتا ہے جو چوتھے سال ۲۹ دن کا شمار کیا جاتا ہے، شمسی سال کا ہر ماہ اور دن اپنے مقرر موسم ہی میں آتا ہے۔ ¤ ➌ قمری مہینوں میں سے چار ماہ کو دین ابراہیمی میں حرمت والے مہینے قرار دیا گیا تھا، جن میں ہر قسم کی لڑائی حرام تھی، حتیٰ کہ اگر کوئی ان دنوں میں اپنے باپ کے قاتل کو بھی دیکھ لیتا تو قتل نہ کرتا، جن میں سے تین مسلسل تھے ذوالقعدہ، ذوالحجہ اور محرم، تاکہ حج کے ایام اور ان سے ایک ماہ پہلے اور ایک ماہ بعد پورے عرب میں لوگ حج کے لیے بے خوف اور پرامن ہو کر حج کر سکیں اور رجب کا مہینا الگ رکھا، تاکہ لوگ امن کے ساتھ عمرہ کے لیے آنے جانے کا سفر کر سکیں۔ ¤ ➍ اللہ تعالیٰ نے یہاں مہینوں کی گنتی بارہ ماہ ہونے کی صراحت اس لیے فرمائی ہے کہ مشرکین عرب حج کو شمسی سال کی طرح ہر سال ایک ہی دن خوشگوار موسم میں ادا کرنے کے لیے قمری مہینوں کے سال کو شمسی سال کے برابر کرنے کے لیے کبھی قمری سال میں اضافہ کر کے اسے تیرہ یا چودہ ماہ کا کر لیتے تھے اور اسے ’’کبیسہ‘‘ کہتے تھے۔ یہ بھی ’’نسئی‘‘ کی ایک صورت تھی، یعنی حرمت والے مہینے اپنے اصل مقام سے مؤخر ہو جاتے تھے اور حلال مہینوں کو وہ حرمت والا قرار دے لیتے تھے۔ جس سال رسول اللہ صلی اللہ علیہ وسلم نے حج کیا اس سال اتفاق سے حج اپنے اصلی دن، یعنی قمری لحاظ سے ۱۰ ذوالحجہ کو ادا ہوا تھا، اس کے بعد سے لے کر اللہ کے حکم کے مطابق حج اور اسلام کی دوسری تمام عبادات قمری تاریخ کے مطابق اصل وقت ہی پر ادا ہو رہی ہیں۔ یہی مطلب ہے اس حدیث کا جو ابوبکرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے (حجۃ الوداع کے خطبہ میں) فرمایا : ’’زمانہ گھوم پھر کر اپنی اس اصل پر آگیا ہے جو اس دن تھی جس دن اللہ تعالیٰ نے آسمان و زمین کو پیدا کیا تھا۔ سال بارہ ماہ کا ہے، جن میں سے چار حرمت والے ہیں، تین پے در پے ذوالقعدہ، ذوالحجہ اور محرم اور مضر قبیلے کا رجب جو جمادی اور شعبان کے درمیان ہے۔‘‘ [ بخاری، المغازی، باب حجۃ الوداع : ۴۴۰۶ ]آپ صلی اللہ علیہ وسلم نے اسے مضر کا رجب اس لیے فرمایا کہ بنو ربیعہ رمضان کو حرمت کا مہینا قرار دیتے تھے اور بنو مضر اصل رجب کو، اس لیے آپ صلی اللہ علیہ وسلم نے اس کے جمادی الاخریٰ اور شعبان کے درمیان ہونے کی تصریح فرمائی۔ ¤ ➎ { فَلَا تَظْلِمُوْا فِيْهِنَّ اَنْفُسَكُمْ:} اس کا مطلب یہ نہیں کہ دوسرے مہینوں میں بے شک اپنی جانوں پر ظلم کرتے رہو، بلکہ کچھ مقامات اور اوقات جو زیادہ فضیلت رکھتے ہیں، مثلاً مکہ، مدینہ، بیت المقدس، اللہ تعالیٰ کی مساجد، ماہ رمضان، لیلۃ القدر، حرمت والے ماہ وغیرہ، ان میں نیکی کی تاکید زیادہ ہے، جیسا کہ فرمایا : «حٰفِظُوْا عَلَى الصَّلَوٰتِ وَ الصَّلٰوةِ الْوُسْطٰى » [ البقرۃ : ۲۳۸ ] ’’سب نمازوں کی حفاظت کرو اور درمیانی نماز کی۔‘‘ اسی طرح ان میں ظلم سے باز رہنے کی تاکید بھی زیادہ ہے، حتیٰ کہ حرم مکہ میں ظلم کے ساتھ الحاد (کج روی) کے ارادے پر بھی عذاب الیم کی وعید ہے۔ دیکھیے سورۂ حج (۲۵) جب کہ دوسری جگہوں میں ارادے پر یہ مؤاخذہ نہیں۔ ایک مطلب یہ بھی ہے کہ مہینوں کو آگے پیچھے کر کے حلال کو حرام اور حرام کو حلال کرکے اپنے آپ پر ظلم مت کرو۔ ¤ ➏ {وَ قَاتِلُوا الْمُشْرِكِيْنَ كَآفَّةً … : ’’ كَآفَّةً ‘‘} مصدر ہے اور فاعل اور مفعول دونوں سے حال بن سکتا ہے۔ یہ لفظ اسی طرح آتا ہے، اس کا تثنیہ یا جمع نہیں آتا، نہ اس پر ’’الف لام‘‘ آتا ہے اور یہ لازماً مؤنث ہی آتا ہے، جیسا کہ {’’ عَامَةٌ ‘‘} یا {’’خَاصَةٌ ‘‘} ہے۔ {’’ كَآفَّةً ‘‘} کا معنی {’’جَمِيْعًا ‘‘} ہے۔ اس کی دو تفسیریں بیان کی گئی ہیں، ایک تو یہ کہ جس طرح مشرکین تم سے سب کے سب اکٹھے ہو کر لڑتے ہیں تم بھی سب مل کر ان سے اکٹھے ہو کر لڑو۔ دوسرا معنی یہ ہے کہ بے شک یہ چار مہینے حرمت والے ہیں، مگر مشرکین چونکہ اس کی پروا نہیں کرتے اور عین حرمت والے مہینوں میں بھی وہ تم سے لڑنے سے دریغ نہیں کرتے، جیسا کہ صلح حدیبیہ کے موقع پر ذوالقعدہ میں وہ لڑنے پر تیار ہو گئے تھے، اس سے پہلے انھوں نے حرم کی حرمت کو پامال کرتے ہوئے مسلمانوں کو وہاں سے نکال دیا تھا اور پھر وہاں داخلے سے روک دیا تھا، مسلمانوں پر ظلم کرنے میں نہ حرم کا خیال رکھا نہ حرمت والے مہینوں کا، اس لیے تم بھی ان سے تمام مہینوں میں اور ہر حال میں ہر جگہ لڑو، جس طرح وہ تم سے ہر حال میں ہر جگہ اور تمام مہینوں میں لڑتے ہیں۔ تفصیل ’’التحریر والتنویر‘‘ میں دیکھیں۔ شاہ عبد القادر رحمہ اللہ نے اس کا ترجمہ کیا ہے : ’’اور لڑو مشرکوں سے ہر حال، جیسے وہ لڑتے ہیں تم سے ہر حال۔‘‘ اللہ تعالیٰ نے دوسری جگہ صراحت فرمائی ہے : «اَلشَّهْرُ الْحَرَامُ بِالشَّهْرِ الْحَرَامِ وَ الْحُرُمٰتُ قِصَاصٌ » [ البقرۃ : ۱۹۴ ] ’’حرمت والا مہینا حرمت والے مہینے کے بدلے ہے اور سب حرمتیں ایک دوسری کا بدلہ ہیں۔‘‘ اس سے معلوم ہوا کہ اگر مشرکین حرمت والے مہینوں کی حرمت اور حرم مکہ کی حرمت کا پوری طرح پاس کریں اور ان میں کوئی جنگی کارروائی نہ کریں تو مسلمانوں کو بھی اس کا پاس رکھنا چاہیے، ورنہ ہر وقت اور ہر جگہ ان کے خلاف جنگ کی جائے گی، فرمایا : «وَ لَا تُقٰتِلُوْهُمْ عِنْدَ الْمَسْجِدِ الْحَرَامِ حَتّٰى يُقٰتِلُوْكُمْ فِيْهِ » [ البقرۃ : ۱۹۱ ] ’’اور مسجد حرام کے پاس ان سے نہ لڑو، یہاں تک کہ وہ اس میں تم سے لڑیں۔‘‘"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت37) {اِنَّمَا النَّسِيْٓءُ زِيَادَةٌ فِي الْكُفْرِ …: ’’ النَّسِيْٓءُ ‘‘} یہ {’’ فَعِيْلٌ‘‘ } کے وزن پر مصدر ہے۔ {’’نَسَأَ الشَّيْءَ‘‘} کا معنی ہے اس نے فلاں چیز کو مؤخر (پیچھے) کر دیا۔ اونٹوں کو حوض سے ہٹایا جائے تو کہا جاتا ہے :{ ’’نَسَأْتُ الْاِبِلَ عَنِ الْحَوْضِ‘‘} ’’میں نے اونٹوں کو حوض سے پیچھے ہٹا دیا۔‘‘ مشرکین ’’نسیٔ‘‘ دو طرح سے کرتے تھے، ایک تو وہ جو اوپر حاشیہ(۴) میں بیان ہوا ہے، دوسرا یہ کہ وہ لوگ جنگ و جدل اور لوٹ مار کے عادی تھے، مسلسل تین ماہ اس کام سے باز رہنا ان کے لیے مشکل تھا، اس لیے وہ حرمت والے مہینے، مثلاً محرم کو حلال قرار دے کر اس سے اگلے ماہ صفر کو حرمت والا مقرر کر لیتے۔ ان کے ہاں بس چار ماہ حرمت والے پورے کرنے ضروری تھے، رہی ان کی تعیین تو وہ انھوں نے اپنے اختیار میں لے رکھی تھی، اسی کو اللہ تعالیٰ نے کفر میں زیادتی قرار دیا، کیوں کہ حرام کو حلال اور حلال کو حرام قرار دینا تو اللہ تعالیٰ کا اختیار ہے، پھر اللہ تعالیٰ کے ہاں عبادات کے اوقات جو قمری حساب سے بدل بدل کر ہر موسم میں آتے رہتے تھے انھوں نے ان کے اصل اوقات سے ہٹا دیے تھے، یہ بھی کفر پر مزید کفر تھا۔ پھر وہ اپنے اس عمل پر خوش تھے اور شیطان نے ان کے لیے ان کے برے اعمال بھی خوش نما بنا دیے تھے۔ «وَ اللّٰهُ لَا يَهْدِي الْقَوْمَ الْكٰفِرِيْنَ » یعنی اب جو حق کو چھپانے اور اس سے انکار پر تل ہی جائے تو اللہ تعالیٰ اسے سیدھے راستے پر کیوں لائے گا؟ کفر کا معنی چھپانا اور انکار دونوں آتے ہیں۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت38) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا مَا لَكُمْ اِذَا قِيْلَ لَكُمُ انْفِرُوْا …:} سورت کے شروع سے لے کر ۳۷ آیات تک عرب کے مشرکین سے اعلانِ براء ت اور اہل کتاب سے مسلمانوں کے تعلقات اور جہاد کے بنیادی احکام، بدر اور حنین کے واقعات اور ان میں اللہ تعالیٰ کی نصرت اور غیبی مدد کا تفصیلی ذکر کرنے کے بعد اب جنگ تبوک کا تفصیلی ذکر اور اس میں منافقین کے کردار کو کھول کر بیان کیا گیا ہے اور اس جنگ سے پیچھے رہنے والوں پر شدید ناراضگی کا اظہار کیا گیا ہے، اس لیے اس سورت کو فاضحہ یعنی منافقین کو رسوا کرنے والی بھی کہتے ہیں۔ علاوہ ازیں جہاد پر ابھارنے کے لیے وعدہ و وعید، انذار و تبشیر اور ثواب و عذاب وغیرہ کے بیان کے کئی طریقے اختیار کیے گئے ہیں، اس لیے اس کا نام بحوث یعنی نہایت ابھارنے والی سورت بھی ہے۔ ¤ ➋ علمائے تفسیر متفق ہیں کہ یہاں سے ان لوگوں پر عتاب کا آغاز ہوتا ہے جو غزوۂ تبوک میں رسول اللہ صلی اللہ علیہ وسلم سے پیچھے رہے تھے، جب پھل تیار تھے، گرمی شدید تھی اور سائے نہایت خوش گوار محسوس ہو رہے تھے، اس لیے بعض نام نہاد مسلمان جہاد پر روانہ ہونے سے جی چرانے لگے۔ اللہ تعالیٰ نے بات شروع ہی ایمان کو حرکت دینے سے کی ہے کہ اے وہ لوگو جو ایمان لائے ہو! تمھیں کیا ہو گیا؟ اپنے ایمان کے تقاضے ہی پر غور کرو، کیا اس کا تقاضا یہی ہے جو جہاد کے لیے نکلنے کے حکم پر تم اختیار کر رہے ہو۔ {’’ اثَّاقَلْتُمْ ‘‘} اصل میں {’’ تَثَاقَلْتُمْ‘‘} تھا جو باب تفاعل سے ہے۔ {’’ ثَقُلَ‘‘} سے بڑھا کر تفاعل میں لے جا کر بھاری ہونے کے مفہوم کو انتہا تک پہنچانے کے لیے لفظ بھی آخری حد تک بھاری بنا دیا {’’اثَّاقَلْتُمْ ‘‘} یعنی نہایت بھاری اور بوجھل ہو جاتے ہو کہ اٹھانے سے نہیں اٹھتے، اس کا باعث اس کے سوا کیا ہے کہ تم آخرت کے مقابلے میں دنیا کی زندگی کے معمولی، حقیر اور ناپائدار سازو سامان پر جو کسی وقت بھی چھن جائے گا، اس آخرت کے مقابلے میں راضی ہو گئے ہو جو ہمیشہ رہنے والی ہے اور جس میں وہ نعمتیں ہیں جو کسی آنکھ نے دیکھی ہیں نہ کسی کان نے سنیں اور نہ ان کا خیال ہی کسی انسان کے دل میں آیا ہے۔ اگر ایسا ہے تو دنیا کی زندگی کا یہ سازو سامان تو آخرت کے مقابلے میں بہت ہی تھوڑا ہے، کوئی حیثیت ہی نہیں رکھتا۔ اس کی مثال تو سمندر کے مقابلے میں انگلی ڈبونے سے اس پر لگنے والے پانی کی سی ہے، جیسا کہ مستورد رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے نقل فرمایا ہے۔ [ مسلم، الجنۃ و صفۃ نعیمھا، باب فناء الدنیا … : ۲۸۵۸ ] ¤ ➌ تبوک ایک مشہور مقام کا نام ہے جو مدینہ سے شمال کی طرف تقریباً چھ سو کلو میٹر کے فاصلے پر واقع ہے۔ یہ واقعہ فتح مکہ کے بعد ۹ ھ میں پیش آیا۔ اس غزوے کا پس منظر یہ تھا کہ ملک شام پر قبیلہ غسان حکمران تھا، جو شاہِ روم کے تابع تھا، اسے یہ فکر لاحق ہوئی کہ رسول اللہ صلی اللہ علیہ وسلم جزیرۂ عرب سے فارغ ہو چکے ہیں، اب ہماری باری ہے توکیوں نہ شاہِ روم کو بلا کر عرب پر پہلے ہی چڑھائی کر دی جائے۔ رسول اللہ صلی اللہ علیہ وسلم کو اطلاع ملی تو آپ صلی اللہ علیہ وسلم نے فیصلہ فرمایا کہ سرزمین عرب سے نکل کر دشمن کے علاقے، یعنی شام میں جا کر انھیں عرب پر حملے سے روکا جائے، چونکہ سفر بہت مشکل اور لمبا تھا، فصل کی کٹائی کا موسم تھا اور سواریاں اور سامان حرب بھی پوری طرح میسر نہ تھا، اس لیے اسے جیش العسرۃ ’’تنگی کے زمانے کا لشکر‘‘ کہا جاتا ہے۔ اس لیے اگرچہ اس سے پہلے رسول اللہ صلی اللہ علیہ وسلم کا معمول یہی تھا کہ آپ جب کہیں حملہ کرنا چاہتے تو توریہ کرتے، یعنی اصل جگہ کی نشان دہی کے بجائے ادھر ادھر کے متعلق لوگوں سے حالات معلوم کرتے، تاکہ لوگوں کو حملے کے اصل مقام کا پتا نہ چلے، لیکن اب آپ نے لوگوں کو صاف الفاظ میں اپنا ہدف واضح کر دیا اور سب کو نکلنے کا حکم دیا۔ تقریباً تیس ہزار مجاہد تیار ہو گئے۔ آپ نے اس سے پہلے شاہِ روم کو خط بھی لکھا تھا جس میں اسے دین اسلام کی دعوت دی۔ وہ اسلام لانے پر آمادہ بھی ہو گیا، لیکن قوم نے اس کا ساتھ نہ دیا، اس لیے وہ اسلام سے محروم رہا۔ اب رسول اللہ صلی اللہ علیہ وسلم مسلمانوں کو لے کر تبوک پہنچ گئے اور دشمن کا بیس دن تک انتظار کرتے رہے، مگر کسی میں مقابلے پر آنے کی جرأت نہ ہوئی، نہ ہی کوئی جنگ ہوئی، اس علاقے کے اور اردگرد کے لوگوں نے آپ کی خدمت میں حاضر ہو کر اطاعت کا عہد کیا، اگرچہ مسلمان نہیں ہوئے۔ آپ دشمن کو خوف زدہ کرکے اسلام کی دھاک بٹھا کر کامیاب فاتح ہو کر واپس تشریف لائے۔ پھر عمر رضی اللہ عنہ کے زمانے میں سارا ملک شام فتح ہو گیا اور اسرائیل کے مقبوضہ حصے کے سوا اب تک اسلام کے زیر نگین ہے۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت39) {اِلَّا تَنْفِرُوْا يُعَذِّبْكُمْ عَذَابًا اَلِيْمًا … :} عذاب الیم یعنی دنیا میں ذلت  و رسوائی، محکومیت اور غلامی اور آخرت میں آگ کا عذاب جس کی کوئی حد ہی نہیں۔ «وَ يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ» یعنی یہ نہ سمجھو کہ اگر ہم جہاد کے لیے نہ نکلیں گے تو اللہ تعالیٰ کا کام پورا ہونے سے رہ جائے گا، ہر گز نہیں، اگر تم نہ نکلو گے تو وہ تمھاری جگہ اور لوگوں کو لے آئے گا اور انھیں اسلام غالب کرنے کے لیے جہاد کی سعادت سے نوازے گا اور تم اس کا کچھ بھی نہیں بگاڑ سکو گے، کیونکہ وہ تمھاری یا کسی اور کی مدد کے بغیر خود اکیلا ہی ہر چیز پر پوری طرح قادر ہے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت40) ➊ {اِلَّا تَنْصُرُوْهُ فَقَدْ نَصَرَهُ اللّٰهُ … :} یعنی اگر تم تبوک کے لیے نہیں نکلو گے اور اس کی مدد نہیں کرو گے تو وہ خود اکیلا ہی اس کی مدد کے لیے کافی ہے، دیکھ لو جب مکہ کے مشرکوں نے اسے قتل کرنے کا فیصلہ کرکے اسے وطن سے نکلنے پر مجبور کر دیا تھا اور اس کے ساتھ صرف ایک ساتھی تھا، اس وقت بھی اللہ تعالیٰ نے تم میں سے کسی کی مدد کے بغیر خود اس کی مدد کی تھی۔ اب بھی اسے تم میں سے کسی کی ضرورت نہیں، ہاں تمھاری بہتری اسی میں ہے کہ دشمنانِ اسلام کے مقابلے کے لیے نکلو، یہ تمھارے لیے بہتر ہے۔ ¤ ➋ { ثَانِيَ اثْنَيْنِ:} ’’دو میں سے دوسرا‘‘ سے مراد پہلا ہے۔ {’’ ثَانِيَ اثْنَيْنِ ‘‘} میں پہلے رسول اللہ صلی اللہ علیہ وسلم اور دوسرے ابوبکر رضی اللہ عنہ تھے۔ اسی طرح {’’ ثَالِثُ ثَلَاثَةٍ‘‘} یا {’’رَابِعُ اَرْبَعَةٍ‘‘} میں ثالث یا رابع وہ ہو گا جو پہلا ہو گا، باقی بعد میں ہوں گے، ہاں {’’ رَابِعُ ثَلَاثَةٍ‘‘} یا {’’ خَامِسُ اَرْبَعَةٍ ‘‘} میں رابع یا خامس وہ ہو گا جو بعد میں ملے گا اور اس کا نمبر چوتھا یا پانچواں ہو گا۔ [ الوسیط للطنطاوی ] تمام مفسرین کا اتفاق ہے کہ آپ صلی اللہ علیہ وسلم کے ساتھ دوسرے ابوبکر رضی اللہ عنہ تھے اور اکثر دینی منصبوں اور عہدوں پر رسول اللہ صلی اللہ علیہ وسلم کے بعد دوسرے نمبر پر وہی فائز رہے۔ سب سے پہلے مسلمان ہوئے اور لوگوں کو اسلام کی دعوت دی، جس پر بہت سے جلیل القدر صحابہ رضی اللہ عنہم مسلمان ہوئے، جنگوں میں آپ صلی اللہ علیہ وسلم سے الگ نہیں ہوئے۔ مرض الموت میں آپ صلی اللہ علیہ وسلم کے نہایت تاکیدی حکم کے ساتھ اور کسی بھی دوسرے کی امامت سے آپ صلی اللہ علیہ وسلم کے انکار کے بعد آپ کے قائم مقام کی حیثیت سے آپ صلی اللہ علیہ وسلم کے مصلے پر کھڑے ہوئے، پھر آپ کے پہلو میں دفن ہوئے، اس طرح اول و آخر صدیق اکبر رضی اللہ عنہ کو دوسرا ہونے کا شرف حاصل رہا۔ ¤ ➌ { اِذْ يَقُوْلُ لِصَاحِبِهٖ:} یہاں صاحب (ساتھی) ہونے کا شرف بھی ابوبکر رضی اللہ عنہ کو حاصل ہے۔ صاحب کا لفظ اصل میں اکثر اوقات ساتھ رہنے والے کے لیے استعمال ہوتا ہے۔ اسی لیے بیوی کو {’’ صَاحِبَةٌ ‘‘} کہتے ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا : «اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ» [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی جبکہ اس کی کوئی بیوی ہی نہیں۔‘‘ اس سے معلوم ہوا کہ جو شخص ابوبکر رضی اللہ عنہ کے صاحبِ رسول یعنی آپ کے خاص ساتھی اور یار غار ہونے کا منکر ہے وہ درحقیقت قرآن کا منکر ہے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’رفیق غار ابوبکر رضی اللہ عنہ تھے، صرف یہی آپ صلی اللہ علیہ وسلم کے ساتھ تھے، دوسرے اصحاب بعض پہلے نکل گئے تھے بعض بعد میں آئے۔‘‘ ( موضح) ¤ ➍ { اِذْ هُمَا فِي الْغَارِ:} اس غار سے مراد ثور پہاڑ کی چوٹی کے قریب واقع غار ہے، جو مکہ سے جنوب کی طرف تقریباً پانچ میل کے فاصلے پر ہے۔ آپ صلی اللہ علیہ وسلم کو یقین تھا کہ آپ کا تعاقب کیا جائے گا، اس لیے آپ نے مدینے کا راستہ جو شمال کی طرف ہے، چھوڑ کر جنوب کی سمت اختیار کی اور غار ثور میں چھپ گئے، تاکہ تلاش کرنے والے آپ کو آسانی سے پا نہ سکیں۔ تفسیر ماجدی میں ہے : ’’اس غار کا دہانہ اب تک اتنا تنگ ہے کہ اندر صرف لیٹ کر ہی جانا ممکن ہے۔‘‘ شیخ رشید رضا مصری نے تفسیر المنار میں ایک مصری امیر الحج ابراہیم رفعت پاشا (سنِ حج 1318ھ) کے حوالے سے غار کی پیمائش وغیرہ دی ہے اور اس کی تنگی کا ذکر صراحت کے ساتھ کیا ہے۔ آپ صلی اللہ علیہ وسلم وہاں تین دن چھپے رہے، پھر مدینہ کی طرف روانہ ہو گئے، آپ کی گرفتاری پر انعام مقرر ہو چکا تھا، اس لیے دشمنوں نے آپ کی تلاش کے لیے ہر ممکن کوشش کی، حتیٰ کہ بعض قدموں کے نشان پہچاننے والے غار کے سرے پر پہنچ گئے اور آپ صلی اللہ علیہ وسلم کو ان کے قدم نظر آنے لگے، ابوبکر رضی اللہ عنہ کو آپ صلی اللہ علیہ وسلم کے متعلق فکر لاحق ہوئی اور وہ سخت غم زدہ ہو گئے۔ ¤ ➎ {لَا تَحْزَنْ اِنَّ اللّٰهَ مَعَنَا:} انس رضی اللہ عنہ بیان کرتے ہیں کہ ابوبکر رضی اللہ عنہ نے فرمایا، میں نے نبی صلی اللہ علیہ وسلم سے کہا، جب کہ میں اس غار میں تھا : ’’اگر ان میں سے کوئی شخص اپنے قدموں کے نیچے نظر ڈالے تو ہمیں ضرور دیکھ لے گا۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اے ابوبکر! ان دو کے متعلق تمھارا کیا خیال ہے جن کا تیسرا اللہ تعالیٰ ہے۔‘‘ [ بخاری، فضائل أصحاب النبی صلی اللہ علیہ وسلم ، باب مناقب المہاجرین وفضلھم… : ۳۶۵۳ ] {’’ اِنَّ اللّٰهَ مَعَنَا ‘‘} (بے شک اللہ ہمارے ساتھ ہے) اس ’’ساتھ‘‘ سے مراد خاص ساتھ ہے، یعنی اللہ تعالیٰ کی خاص مدد اور نصرت، ورنہ عام معیت (ساتھ) تو ہر شخص کو حاصل ہے، فرمایا : «وَ هُوَ مَعَكُمْ اَيْنَ مَا كُنْتُمْ » [ الحدید : ۴ ] ’’اور وہ تمھارے ساتھ ہے تم جہاں کہیں بھی ہو۔‘‘ اس میں ابوبکر رضی اللہ عنہ کی فضیلت ظاہر ہے کہ موسیٰ علیہ السلام کے سمندر کے کنارے پہنچنے پر اور فرعون کی فوج کو دیکھنے پر ان کی قوم نے اپنے پکڑے جانے کا خطرہ پیش کیا تو موسیٰ علیہ السلام نے فرمایا : « كَلَّا اِنَّ مَعِيَ رَبِّيْ» [ الشعراء : ۶۲ ] ’’ہر گز نہیں، بے شک میرے ساتھ میرا رب ہے۔‘‘ چنانچہ انھوں نے {’’ مَعِيَ ‘‘} یعنی اللہ تعالیٰ کی معیت میں اپنے ساتھ کسی کو شریک نہیں کیا، جبکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : « اِنَّ اللّٰهَ مَعَنَا» ’’بے شک اللہ ہم دونوں کے ساتھ ہے۔‘‘ ¤ ➏ { فَاَنْزَلَ اللّٰهُ سَكِيْنَتَهٗ عَلَيْهِ:} یعنی اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم پر اپنی سکینت نازل فرمائی۔ بعض مفسرین نے مراد ابوبکر رضی اللہ عنہ لیے ہیں، کیونکہ رسول اللہ صلی اللہ علیہ وسلم پر تو اللہ تعالیٰ کی سکینت پہلے ہی نازل تھی، مگر اس سے {’’عَلَيْهِ‘‘} کی ضمیر کی بعد میں آنے والی ضمیر {’’ وَ اَيَّدَهٗ بِجُنُوْدٍ لَّمْ تَرَوْهَا ‘‘} کے ساتھ مطابقت نہیں رہتی اور کچھ بعید نہیں کہ اللہ تعالیٰ نے اپنے رسول پر پہلی سکینت کے علاوہ خاص سکینت نازل فرمائی ہو۔ جس سے آپ کے اطمینان میں مزید اضافہ ہوا ہو، اس لیے یہی راجح معلوم ہوتا ہے کہ {’’ عَلَيْهِ ‘‘} سے مراد رسول اللہ صلی اللہ علیہ وسلم ہیں۔ ¤ ➐ {وَ اَيَّدَهٗ بِجُنُوْدٍ لَّمْ تَرَوْهَا:} یعنی فرشتوں کے لشکروں کے ساتھ جنھیں تم نے نہیں دیکھا کہ انھوں نے تعاقب کرنے والوں کی نگاہیں آپ پر پڑنے ہی نہیں دیں۔ جیسا کہ حنین میں مدد فرمائی (دیکھیے توبہ : ۲۶) اور بدر میں (دیکھیے انفال : ۹۔ آل عمران : ۱۲۴، ۱۲۵)۔ ¤ ➑ بعض لوگ بیان کرتے ہیں کہ عنکبوت (مکڑی) نے جالا بن دیا تھا اور کبوتری نے گھونسلا بنا کر انڈے دے دیے تھے، مگر یہ بات ثابت نہیں، الشیخ علامہ ناصر الدین الالبانی رحمہ اللہ نے سلسلہ ضعیفہ میں عنکبوت کے قصے کو ضعیف قرار دیا ہے۔ ¤ ➒ {وَ جَعَلَ كَلِمَةَ الَّذِيْنَ كَفَرُوا السُّفْلٰى …:} یعنی ہجرت، بدر، احد، خندق، حدیبیہ، فتح مکہ، حنین، تبوک، ہر جگہ کفر کو نیچا دکھایا۔ {’’ وَ كَلِمَةُ اللّٰهِ هِيَ الْعُلْيَا ‘‘} اور اللہ تعالیٰ کا بول ہی سب سے بالا اور اس کی بات ہی سب سے اونچی ہے، اگر کہیں مسلمان نیچے رہے تو اللہ کی بات کے نیچا ہونے کی وجہ سے نہیں بلکہ اپنے ایمان و عمل کی کسی کمی کی وجہ سے، فرمایا : «وَ اَنْتُمُ الْاَعْلَوْنَ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ » [ آل عمران : ۱۳۹ ]’’اور تم ہی غالب ہو، اگر تم مومن ہو۔‘‘ اور دیکھیے سورۂ محمد(۳۵)۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت41) ➊ {اِنْفِرُوْا خِفَافًا وَّ ثِقَالًا … :} اللہ تعالیٰ نے تبوک کے لیے نہ نکلنے کی صورت میں دنیا و آخرت میں عذاب الیم کی وعید سنا کر اور نبی صلی اللہ علیہ وسلم کو اللہ کے سوا کسی کی مدد کا محتاج نہ ہونے کا ذکر فرما کر اب تاکید کے ساتھ تمام مسلمانوں کو جنگ کے لیے نکلنے کا حکم دیا، اسے ’’نفیر عام‘‘ کہا جاتا ہے۔ اس حکم کے بعد ہر مسلمان پر نکلنا فرض ہو جاتا ہے، ماں باپ یا کسی کے اذن (اجازت) کی ضرورت باقی نہیں رہتی۔ ’’ہلکے اور بوجھل‘‘ الفاظ عام ہیں، اس لیے اس میں سب شامل ہیں، یعنی طبیعت چاہتی ہے یا نہیں، خوش حال ہو یا تنگ دست، مجرد ہو یا عیال دار، جوان ہو یا بوڑھے، ہتھیار بند ہو یا بے ہتھیار، ہر حال میں جہاد کے لیے نکلو۔ انس رضی اللہ عنہ فرماتے ہیں کہ ابوطلحہ رضی اللہ عنہ نے قرآن کی یہ آیت پڑھی : «اِنْفِرُوْا خِفَافًا وَّ ثِقَالًا » تو کہنے لگے : ’’میں سمجھتا ہوں کہ اللہ تعالیٰ نے ہم بوڑھوں اور جوانوں سب کو نکلنے کے لیے کہا ہے۔‘‘ ان کی اولاد نے کہا : ’’اباجان! آپ نے رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ جنگیں لڑیں، حتیٰ کہ وہ فوت ہو گئے اور ابوبکر و عمر رضی اللہ عنہما کے ساتھ بھی تو ہم آپ کی جگہ جنگ کریں گے، مگر وہ نہ مانے، چنانچہ انھوں نے سمندر کا سفر اختیار کیا، یہاں تک کہ فوت ہو گئے۔ تو سات دن تک انھیں دفن کرنے کے لیے کوئی جزیرہ نہ ملا اور اس دوران میں ان کے جسم میں کوئی تبدیلی نہیں آئی تھی۔ [ مستدرک حاکم : 353/3، ح : ۵۵۰۸، صححہ الحاکم و سکت عنہ الذھبی ] اسی طرح مقداد بن اسود رضی اللہ عنہ بڑھاپے اور بھاری جسم کے باوجود نکلے، ایک آدمی نے ان سے کہا، کاش! آپ اس سال جنگ کے لیے نہ جائیں تو انھوں نے کہا : ’’سورۂ بحوث (توبہ) ہمیں بیٹھنے کی اجازت نہیں دیتی، اللہ تعالیٰ نے فرمایا ہے : « اِنْفِرُوْا خِفَافًا وَّ ثِقَالًا» ’’نکلو، ہلکے ہو یا بھاری‘‘ اور میں اپنے آپ کو ہلکا ہی پاتا ہوں۔‘‘ [ السنن الکبرٰی للبیہقی : 21/9، ح : ۱۸۲۵۶ ] ¤ ابوایوب انصاری رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بدر میں شریک ہوئے، پھر ایک سال کے سوا کبھی مسلمانوں کی کسی جنگ سے پیچھے نہیں رہے۔ تاریخ کی کتابوں کے مطابق نوے سال کی عمر میں قسطنطنیہ جانے والے لشکر میں آپ شریک ہوئے، ان کے امیر یزید بن معاویہ تھے، بیمار ہوئے تو یزید ان کی بیمار پرسی کے لیے آئے۔ پوچھا : ’’کوئی خواہش ہو تو بتائیں؟‘‘ فرمایا : ’’میری خواہش یہ ہے کہ جب میں فوت ہو جاؤں تو سوار ہو کر دشمن کی سرزمین میں جہاں تک آگے جا سکو جاؤ، جب اس سے آگے بڑھنے کی گنجائش نہ رہے تو مجھے وہاں دفن کر دو، پھر واپس آجاؤ۔‘‘ ابوایوب رضی اللہ عنہ یہ آیت پڑھا کرتے : « اِنْفِرُوْا خِفَافًا وَّ ثِقَالًا » اور فرماتے : ’’تو میں یا تو ہلکا ہوں گا یا بوجھل۔‘‘ یعنی ہر حال میں نکلنے کا حکم ہے۔ [مستدرک حاکم : 458/3، ح : ۵۹۳۰، سکت عنہ الذھبی ] ¤ ➋ جہاد کے لیے نکلنا کسی شخص پر کب ہر حال میں فرض ہوتا ہے اس کی تفصیل کے لیے دیکھیے سورۂ بقرہ کی آیت (۲۱۶) کے حواشی۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت42) {لَوْ كَانَ عَرَضًا قَرِيْبًا … :} یہ آیت غزوۂ تبوک سے پیچھے رہ جانے والوں کے بارے میں نازل ہوئی۔ {’’ عَرَضًا ‘‘} دنیا کا وہ سازو سامان جو انسان کی خواہشوں کے پیش نظر رہتا ہے۔ {’’ قَرِيْبًا ‘‘} جس کا حصول بالکل آسان ہو۔ {’’ قَاصِدًا ‘‘} درمیانہ، یعنی جس میں شدید مشقت درپیش نہ ہوتی۔ {’’ الشُّقَّةُ ‘‘} وہ فاصلہ جو نہایت مشقت اور تھکن سے طے ہو۔ یہ مشقت سے مشتق ہے۔ ابو عبیدہ نے فرمایا {’’ الشُّقَّةُ ‘‘} کا معنی ارضِ بعید کا سفر ہے، یعنی اگر آسانی سے مالِ غنیمت ملنے کی توقع ہوتی اور سفر بہت لمبا نہ ہوتا، جس کا راستہ بھی نہایت کٹھن تھا تو یہ لوگ ضرور آپ کے ساتھ جاتے۔ مگر خالص فی سبیل اللہ جہاد جس میں آسانی سے حصولِ غنیمت کے بجائے مال و جان کی قربانی، بعید سفر اور شہادت کا واضح امکان سامنے ہو، منافق کے لیے نہایت دشوار ہے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت43) {عَفَا اللّٰهُ عَنْكَ …:} ہوا یہ کہ جب نبی صلی اللہ علیہ وسلم تبوک کی طرف روانہ ہونے لگے تو بعض منافقین نے بناوٹی حیلے بہانے پیش کرکے آپ صلی اللہ علیہ وسلم سے مدینہ ہی میں رہنے کی اجازت چاہی، حالانکہ انھوں نے طے کر رکھا تھا کہ اجازت نہ ملی پھر بھی نہیں جائیں گے۔ اب ان کی آزمائش کے لیے انھیں اجازت دینے سے اس وقت تک گریز کرنا چاہیے تھا جب تک واضح نہ ہو جاتا کہ کس کا عذر حقیقی ہے اور کون بہانے باز ہے، مگر آپ صلی اللہ علیہ وسلم نے ان کی حقیقت کھلنے سے پہلے ہی انھیں مدینہ میں رہنے کی اجازت دے دی۔ اس اجازت دینے پر اللہ تعالیٰ نے اپنے ناراض ہونے کا اظہار فرمایا، مگر نہایت لطف و کرم اور مہربانی کے ساتھ کہ اس اظہار سے پہلے معاف کر دینے کی اطلاع دی اور پھر فرمایا کہ آپ نے ایسا کیوں کیا؟ اس میں پیچھے رہنے والوں کی مذمت بھی صاف نمایاں ہے، کیونکہ ان میں کم ہی تھے جن کا عذر صحیح تھا، اکثر جھوٹ ہی بول رہے تھے۔ ¤ اللہ تعالیٰ نے یہاں ان لوگوں کو اجازت دینے پر ناراضی کا اظہار فرمایا جنھوں نے آپ سے اجازت مانگی اور انھیں اللہ اور یوم آخرت پر ایمان نہ رکھنے والے بتایا جو جہاد میں نکلنا ہی نہیں چاہتے تھے اور سورۂ نور میں فرمایا : «اِنَّ الَّذِيْنَ يَسْتَاْذِنُوْنَكَ اُولٰٓىِٕكَ الَّذِيْنَ يُؤْمِنُوْنَ بِاللّٰهِ وَ رَسُوْلِهٖ» [ النور : ۶۳ ] ’’بے شک جو لوگ تجھ سے اجازت مانگتے ہیں وہی لوگ ہیں جو اللہ اور اس کے رسول پر ایمان رکھتے ہیں۔‘‘ وہاں مراد یہ ہے کہ منافقین اجتماعی کام مثلاً جہاد وغیرہ میں آئے ہوئے ہوں تو بغیر پوچھے کھسک جاتے ہیں، اجازت مانگتے ہی نہیں، جب کہ اہل ایمان ضرورت کے وقت بھی آپ سے پوچھے بغیر نہیں جاتے۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت44) {لَا يَسْتَاْذِنُكَ الَّذِيْنَ يُؤْمِنُوْنَ بِاللّٰهِ … :} کیونکہ انھیں تو خود جہاد میں جانے کا شوق ہے اور وہ اس انتظار میں رہتے ہیں کہ کب انھیں اللہ کی راہ میں شہید ہونے کا موقع ملتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’لوگوں کے معاش میں ان کے لیے سب سے بہتر وہ آدمی ہے جو اللہ کی راہ میں اپنے گھوڑے کی باگ پکڑے ہوئے ہے، اس کی پشت پر اڑتا پھر رہا ہے، جب کبھی دشمن کی آمد پر کوئی خوف کی آواز یا گھبراہٹ سنتا ہے تو اڑ کر وہاں پہنچ جاتا ہے، وہ قتل اور موت کو ان جگہوں میں تلاش کرتا ہے جہاں وہ مل سکتی ہیں۔‘‘ [مسلم، الإمارۃ، باب فضل الجہاد والرباط، : ۱۸۸۹، عن أبی ھریرۃ رضی اللہ عنہ]"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت45) { اِنَّمَا يَسْتَاْذِنُكَ الَّذِيْنَ لَا يُؤْمِنُوْنَ …:} پس مومنین اور منافقین کے درمیان فرق یہ ہے کہ جہاد کا اعلان ہونے پر مومن تو بلا تامل نکل کھڑے ہوتے ہیں، مگر جو منافق ہیں وہ بہانے تراشتے ہیں اور ہر ایسے موقع پر مذبذب بھی ہو جاتے ہیں، کبھی دل کہتا ہے چلو! شاید پیغمبر صلی اللہ علیہ وسلم سچ ہی کہتے ہوں اور کبھی دل میں آتا ہے نہیں، یہ سب ڈھکوسلے اور ڈرانے کی باتیں ہیں، بس دنیا میں چند روز جینا ہے، آرام سے دن کاٹ لیں۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت46) ➊ { وَ لَوْ اَرَادُوا الْخُرُوْجَ لَاَعَدُّوْا لَهٗ عُدَّةً … :} اس آیت میں اللہ تعالیٰ نے جنگ تبوک کے موقع پر منافقین اور ان تمام جھوٹے دعوے داروں کی حقیقت کھول دی جو کہتے ہیں کہ ہم بھی مجاہد ہیں اور ہر وقت جہاد کے لیے نکلنے کو تیار ہیں، مگر ساٹھ ستر برس کی عمر تک پہنچ جانے کے باوجود کبھی نہ مجاہدین کے ساتھ نکلے، نہ نشانہ بازی سیکھی، نہ تیراکی، نہ فنون حرب میں سے کوئی فن سیکھا، نہ کسی معرکے میں شریک ہوئے، نہ جہاد کے لیے جسم تیار کیا، نہ جہاد کے لیے درکار سامان جمع کیا۔ بس ڈگریوں کے حصول، ملازمت، کفار کی غلامی، کاروبار اور حلال و حرام ہر طرح دنیا کمانے میں لگے رہے، یا پیری فقیری اور ھُو حق میں لگے رہے۔ اولاد کو بھی اسی پر لگائے رکھا اور جب جہاد کا تذکرہ ہوا تو اللہ کے راستے میں نکلنے والوں پر دو چار طنزیہ فقرے کس کر اپنے آپ کو نفس سے جہاد کرنے والا مجاہد اکبر اور جان قربان کرنے والوں کو جہاد اصغر میں مصروف قرار دے دیا (جو نبی صلی اللہ علیہ وسلم کے ذمے صاف جھوٹ ہے)۔ ان کے جہاد اکبر اور نفس سے جہاد کی حقیقت ان کی جہاد کی تیاری ہی سے ظاہر ہے، اللہ تعالیٰ کو بھی ان کے نفاق اور بدعملی کی وجہ سے مخلص مجاہدین کے ساتھ ان کا نکلنا پسند نہیں ہے، تبھی اس نے انھیں نکلنے کی توفیق ہی سے محروم کر دیا۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص مر گیا اور اس نے نہ جنگ کی اور نہ اپنے دل کے ساتھ کبھی جنگ کرنے کی بات چیت کی تو وہ نفاق کی ایک شاخ پر مرے گا۔‘‘ [ مسلم، الإمارۃ، باب ذم من مات ولم یغز… : ۱۹۱۰ ] ¤ ➋ {فَثَبَّطَهُمْ: ’’ ثَبَّطَهُ تَثْبِيْطًا ‘‘} کسی آدمی کے کام میں رکاوٹ ڈال دینا، یا کسی طریقے سے اسے اس سے باز رکھنا۔ ¤ ➌ { وَ قِيْلَ اقْعُدُوْا مَعَ الْقٰعِدِيْنَ:} اس سے ان کی مذمت مقصود ہے کہ انھوں نے اپنے نفاق، بزدلی اور بے ہمتی کی وجہ سے عورتوں، بچوں، بیماروں اور جنگ میں شرکت سے لاچار بوڑھوں کے ساتھ پیچھے بیٹھ رہنا پسند کر لیا۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت47) ➊ {لَوْ خَرَجُوْا فِيْكُمْ مَّا زَادُوْكُمْ اِلَّا خَبَالًا …:} اس میں مسلمانوں کو تسلی دی ہے کہ ان کا نہ نکلنا ہی تمھارے لیے بہتر تھا، کیونکہ یہ لوگ ساتھ جا کر مزید خرابی ہی پیدا کرتے اور تمھارے درمیان فساد ڈالنے کی نیت سے ہر طرح کی دوڑ دھوپ کرتے، کبھی کسی کی چغلی کھاتے، کبھی ایک مسلمان کو دوسرے سے لڑانے کی کوشش کرتے اور کبھی مسلمانوں کے حوصلے پست کرنے کی تدبیریں سوچتے، انھی وجوہ کی بنا پر اللہ تعالیٰ نے انھیں نکلنے کی توفیق نہیں دی۔ ¤ ➋ { وَ فِيْكُمْ سَمّٰعُوْنَ لَهُمْ …:} تبوک کے لیے نکل آنے والوں میں بعض لوگ منافقین کے بارے میں نرم گوشہ رکھتے تھے، اللہ تعالیٰ نے ان سے دوسرے تمام مجاہدوں کو خبردار کیا ہے کہ تم میں سے بعض سادہ دل ان کی باتیں بڑے غور سے سنتے ہیں، حالانکہ ایسے بددلی پھیلانے والوں کی بات بھی نہیں سننی چاہیے۔ ایک مطلب یہ بھی ہو سکتا ہے کہ تم میں ایسے لوگ بھی ہیں جو ان کے لیے جاسوسی کرتے ہیں، یعنی تمھاری کمزوریاں انھیں پہنچاتے ہیں۔ {’’ بِالظّٰلِمِيْنَ ‘‘} کے الف لام برائے عہد کی وجہ سے ’’ان ظالموں کو‘‘ ترجمہ کیا گیا ہے، یعنی اللہ تعالیٰ ان ظالموں کو خوب جاننے والا ہے جو اس کام کا ارتکاب کرکے اپنے آپ پر بھی ظلم کر رہے ہیں اور دوسروں میں افتراق اور شبہات پیدا کرکے ان پر بھی ظلم کرتے ہیں۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت48) { لَقَدِ ابْتَغَوُا الْفِتْنَةَ مِنْ قَبْلُ …:} اس آیت میں ان کے خبث باطن اور مزید مکاریوں کا پردہ چاک کیا گیا ہے، یعنی آپ صلی اللہ علیہ وسلم کے خلاف مکر و فریب کرنا ان کی پرانی عادت ہے۔ پہلے بھی مسلمانوں میں پھوٹ ڈالنے کی تدبیریں کرتے رہے، مگر جنگ بدر میں اللہ تعالیٰ نے اپنے دین کو ان کے نہ چاہتے ہوئے غلبہ عطا فرمایا تو یہ بظاہر اسلام میں داخل ہوگئے، پھر بھی شرارتوں سے باز نہ آئے، جیسا کہ عبد اللہ بن ابی منافق نے غزوۂ احد کے دن کیا کہ عین میدان جنگ سے اپنے تین سو ساتھیوں کو لے کر لوٹ آیا۔ ہر موقع پر ان کی ہمدردیاں یہودیوں کے ساتھ رہیں، بنو نضیر اور دوسرے کئی یہودیوں کو قتل سے بچایا، بنو قریظہ کو ابھارتے رہے، ام المومنین عائشہ رضی اللہ عنہا پر بہتان لگایا، مسجد ضرار بنا کر مسلمانوں کے خلاف مورچہ تعمیر کیا، تبوک میں جانے پر بددلی پھیلاتے رہے۔ واپسی پر جب موقع ملا تو آپ صلی اللہ علیہ وسلم پر چھپ کر حملہ آور ہونے سے بھی دریغ نہ کیا، یہاں تک کہ اللہ تعالیٰ کی خاص مدد سے مکہ فتح ہونے اور تبوک کی فتح کے بعد سارا عرب اسلام میں داخل ہو گیا اور یہ بے بسی سے ہاتھ ملتے رہ گئے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت49) ➊ {وَ مِنْهُمْ مَّنْ يَّقُوْلُ ائْذَنْ لِّيْ وَ لَا تَفْتِنِّيْ:} فتنے کا معنی یہاں گناہ میں مبتلا ہونا کیا گیا ہے اور ہلاکت بھی۔ اس کی دو تفسیریں کی گئی ہیں، ایک تو یہ کہ ان میں سے بعض یہ کہتے ہیں کہ آپ مجھے اتنی شدید گرمی میں اتنے طویل و پر مشقت سفر اور جنگ کا حکم دے کر گناہ میں نہ ڈالیں، کیونکہ اگر میں آپ کے حکم کے بعد نہ گیا تو گناہ گار ہوں گا اور گیا تو ہلاکت کا خطرہ ہے، ادھر گھر اکیلے رہ جائیں گے اور اہل و عیال ہلاک ہو جائیں گے، اس لیے آپ خود ہی مجھے مدینہ میں رہ جانے کی اجازت دے کر اس فتنے سے بچا لیں۔ یہ تفسیر الفاظ کے قریب ہے، جنگ خندق میں بھی منافقین کے بہانوں میں سے ایک بہانہ گھروں کے غیر محفوظ ہونے کا تھا۔ دیکھیے سورۂ احزاب (۱۳) دوسری تفسیر یہ ہے کہ ایک منافق جد بن قیس نے یہ بہانہ بنایا کہ یا رسول اللہ! رومی عورتیں بہت خوبصورت ہیں، اگر میں وہاں چلا گیا تو اپنے اوپر قابو نہ رکھ سکوں گا، اس لیے آپ مجھے معذور سمجھ کر یہاں رہنے کی اجازت دے دیجیے۔ (ہاں، میں مال خرچ کرکے مدد کروں گا)۔ [ المعجم الکبیر : 275/2، ح : ۲۱۵۴۔ أبونعیم فی المعرفۃ ] اسے {’’هداية المستنير‘‘} والے نے ضعیف کہا ہے اور {’’ الاستيعاب في بيان الأسباب‘‘} والوں نے حسن کہا ہے۔ (واللہ اعلم) ¤ ➋ {اَلَا فِي الْفِتْنَةِ سَقَطُوْا:} یعنی بہانے تو یہ کرتے ہیں کہ ہم فتنے میں نہ پڑ جائیں، مگر حقیقت یہ ہے کہ وہ فتنے ہی میں تو پڑے ہوئے ہیں کہ جہاد پر جانے سے گریز کر رہے ہیں۔ {’’ فِي الْفِتْنَةِ ‘‘} پہلے لانے سے حصر کا معنی حاصل ہوتا ہے۔ آخر اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کے ساتھ کفر سے بڑھ کر بھی دنیا میں کوئی فتنہ ہو گا اور پھر جہاد میں شریک نہ ہونا خود ایک فتنہ ہے، اب تو حیلے بہانے تراش کر یہ نکل جائیں گے، مگر جہنم کے گھیرے سے کیسے نکل پائیں گے؟"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت50){اِنْ تُصِبْكَ حَسَنَةٌ تَسُؤْهُمْ …:} یہاں {’’ حَسَنَةٌ ‘‘} سے مراد کامیابی، فتح، غنیمت اور سلامتی ہے اور {’’ مُصِيْبَةٌ ‘‘} سے مراد فتح حاصل کرنے میں وقتی ناکامی یا مسلمانوں کا زخمی اور شہید ہونا ہے۔ یہ بھی ان کے خبث باطن اور مکر و فریب کی ایک دلیل ہے کہ انھیں مسلمانوں کو کوئی فائدہ حاصل ہونا ناگوار ہوتا ہے اور اگر وہ کسی مصیبت میں مبتلا ہوں تو خوش ہوتے ہیں اور انھیں اپنی ہوش مندی اور سیاست دانی کا پروپیگنڈا کرنے کا موقع مل جاتا ہے اور وہ کہتے ہیں کہ ہم نے تو پہلے ہی بچاؤ کر لیا تھا، جیسے جنگ احد کے بعد عبد اللہ بن ابی منافق نے کہا تھا کہ ہم تو اسی وجہ سے پہلے پلٹ آئے تھے کہ ہمیں معلوم تھا کہ مسلمانوں کو شکست ہو گی اور وہ مارے جائیں گے۔ ایسے ہی وہ منافق جو غزوۂ تبوک کے موقع پر مدینہ میں رہ گئے تھے، نبی صلی اللہ علیہ وسلم اور مسلمانوں کے متعلق مشہور کرتے رہے کہ یہ لوگ رومیوں سے بچ کر نہیں آ سکیں گے، لیکن جب انھیں اطلاع ملی کہ مسلمان صحیح و سالم فتح حاصل کرکے واپس آ رہے ہیں تو انھیں انتہائی غم ہوا۔ (ابن کثیر) ان کی اس بدخصلت کے مزید تذکرے کے لیے دیکھیے سورۂ آل عمران (۱۵۶) اور نساء (۷۲)۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت51) ➊ {قُلْ لَّنْ يُّصِيْبَنَاۤ اِلَّا مَا كَتَبَ اللّٰهُ لَنَا:} یہ اللہ تعالیٰ کی تقدیر پر ایمان و یقین کی برکت کا ذکر ہے، سچ ہے : {’’مَنْ عَلِمَ سِرَّ اللّٰهِ فِي الْقَدَرِ هَانَتْ عَلَيْهِ الْمَصَائِبُ ‘‘} ’’جس نے قضا و قدر میں اللہ تعالیٰ کے راز کو پا لیا اس پر مصیبتیں آسان ہو جاتی ہیں۔‘‘ جیسا کہ اللہ تعالیٰ نے فرمایا : ’’کوئی مصیبت نہ زمین میں پہنچتی ہے اور نہ تمھاری جانوں میں مگر وہ ایک کتاب میں ہے، اس سے پہلے کہ ہم اسے پیدا کریں، یقینا یہ اللہ پر بہت آسان ہے، تاکہ تم نہ اس پر غم کرو جو تمھارے ہاتھ سے نکل جائے اور نہ اس پر پھول جاؤ جو وہ تمھیں عطا فرمائے۔‘‘ [ الحدید : ۲۲، ۲۳ ] ¤ ➋ { هُوَ مَوْلٰىنَا … :} وہی ہمارا مالک، مددگار اور حمایتی ہے۔ ہم اپنے مالک پر خوش ہیں اور ایمان والوں کو تو بس اللہ ہی پر بھروسا رکھنا لازم ہے، نہ دنیا کے سازوسامان پر اور نہ اس کے سوا کسی اور ذات پر۔ {’’ وَ عَلَى اللّٰهِ ‘‘} کے پہلے آنے سے حصر کا مفہوم پیدا ہو گیا اور {’’ فَلْيَتَوَكَّلِ‘‘} میں فاء کا مطلب یہ ہے کہ اگر ان منافقین کے رویے سے پیدا ہونے والی بددلی کا علاج چاہتے ہیں تو ایمان والوں کے ایمان کا تقاضا یہ ہے کہ وہ صرف اللہ پر بھروسا رکھیں اور اس کے سوا کسی کی پروا نہ کریں۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت52){قُلْ هَلْ تَرَبَّصُوْنَ بِنَاۤ اِلَّاۤ اِحْدَى الْحُسْنَيَيْنِ …:’’ اِحْدَى‘‘} کا معنیی ایک اور {’’ الْحُسْنَيَيْنِ ‘‘ ’’ اَلْحُسْنٰي‘‘} کی تثنیہ ہے، جو {’’ اَلْاَحْسَنُ ‘‘} (اسم تفضیل) کی مؤنث ہے، یعنی سب سے اچھی دو چیزوں میں سے ایک۔ مسلمانوں کی مصیبت پر منافقین کی خوشی کا یہ دوسرا جواب ہے کہ ہم ہر حال میں سب لوگوں سے اچھے ہیں، دنیا میں یا تو ہمیں فتح اور غنیمت حاصل ہو گی جو بہترین چیز ہے، یا پھر ہم اللہ کی راہ میں شہید ہوں گے، تو یہ اس سے بھی بڑھ کر ہے اور ہماری عین تمنا ہے کہ ہم جنت کی نعمتوں سے لطف اندوز ہوں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے اس شخص کے لیے ضمانت دی ہے جس نے اس کے راستے میں جہاد کیا۔ اسے اس کے راستے میں جہاد اور اس کی باتوں کو سچا یقین کرنے کے سوا کسی اور چیز نے نہیں نکالا کہ وہ اسے جنت میں داخل کرے گا، یا اسے اس کے گھر جس سے نکل کر گیا ہے، اجر یا غنیمت دے کر واپس لائے گا۔‘‘ [ بخاری، فرض الخمس، باب قول النبی صلی اللہ علیہ وسلم : أحلت لکم الغنائم : ۳۱۲۳، عن أبی ھریرۃ رضی اللہ عنہ] اس کے برعکس منافقین ہیں کہ دنیا میں مسلمانوں کے ہاتھوں یا اللہ کی طرف سے انھیں ذلت و رسوائی کا سامنا کرنا پڑے گا اور آخرت میں اللہ کی طرف سے جہنم کے درک اسفل میں دائمی عذاب میں مبتلا ہوں گے، پس ہم اور تم ایک دوسرے کے متعلق دو حالتوں میں سے ایک کے منتظر ہیں۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت53) ➊ {قُلْ اَنْفِقُوْا طَوْعًا اَوْ كَرْهًا … :} اوپر کی آیت میں بتایا کہ منافقین کے لیے بہرحال عذاب ہے، اب اس آیت میں فرمایا کہ اس عذاب سے کسی طور وہ نجات نہیں پا سکتے، کیونکہ آخرت میں ان کی کوئی نیکی قبول نہیں ہے۔ غزوۂ تبوک کے موقع پر بعض منافقین ایسے بھی تھے جو کہتے تھے کہ ہمیں ساتھ جانے سے معافی دی جائے، اس کے عوض ہم مالی اعانت پر تیار ہیں۔ وہ یہ بات اس لیے کہتے تھے کہ کہیں مسلمانوں میں بالکل ہی بدنام ہو کر نہ رہ جائیں، انھی کا جواب اللہ تعالیٰ نے اس آیت میں دیا کہ جن لوگوں کے دلوں میں نفاق اور اللہ تعالیٰ اور رسول اللہ صلی اللہ علیہ وسلم کی دشمنی بھری ہو ان کی مالی امداد کسی طور قبول نہیں، خواہ خوشی سے دیں یا مجبوراً۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں :’’جد بن قیس نے مال خرچ کرنے کی بابت جو کہا تھا اس کا جواب یہ ہے کہ بے اعتقاد کا مال قبول نہیں۔‘‘ (موضح) ¤ ➋ { اِنَّكُمْ كُنْتُمْ قَوْمًا فٰسِقِيْنَ:} عمل کی قبولیت کے لیے تقویٰ شرط ہے جو تم میں ہے ہی نہیں، فرمایا : «اِنَّمَا يَتَقَبَّلُ اللّٰهُ مِنَ الْمُتَّقِيْنَ» [ المائدۃ : ۲۷ ] ’’بے شک اللہ متقی لوگوں ہی سے قبول کرتا ہے۔‘‘ اور دیکھیے سورۂ حج (۳۷) اور بقرہ ( ۲۶۵)۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت54) {وَ مَا مَنَعَهُمْ اَنْ تُقْبَلَ مِنْهُمْ نَفَقٰتُهُمْ …:} اس آیت میں ان کے صدقات قبول نہ ہونے کے تین اسباب بیان فرمائے ہیں، ایک یہ کہ ان کے دل اللہ اور اس کے رسول پر ایمان سے خالی ہیں، بلکہ وہ دونوں کے منکر ہیں اور ان کا کفر ان کی باتوں سے ظاہر ہوتا رہتا ہے۔ دوسرا یہ کہ ایمان کی بدنی شہادت نماز ہے، وہ بھی یہ لوگ خوشی اور نشاط سے نہیں بلکہ مارے باندھے سستی سے صرف اپنے ایمان کے دکھاوے کے لیے پڑھتے ہیں، ان کا سستی سے آنا اس بات کی دلیل ہے کہ لوگوں کے سامنے ہوئے تو پڑھ لی اکیلے ہوئے تو چھوڑ دی۔ دیکھیے سورۂ نساء (۱۴۲) تیسرا مالی عبادت بھی خوش دلی سے نہیں بلکہ مجبوراً جرمانہ سمجھ کر ادا کرتے ہیں۔ دیکھیے سورۂ بقرہ (۲۶۴) اب ان کا خرچ کیا ہوا مال اللہ تعالیٰ کی جناب میں کیسے قبول ہو؟ پکے مومن تو اپنے مال کی پاکیزگی اور سکون قلب کے حصول کے لیے زکوٰۃ دیتے ہیں، جیسا کہ فرمایا : «خُذْ مِنْ اَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَ تُزَكِّيْهِمْ بِهَا وَصَلِّ عَلَيْهِمْ اِنَّ صَلٰوتَكَ سَكَنٌ لَّهُمْ »» [ التوبۃ : ۱۰۳ ] ’’ان کے مالوں سے صدقہ لے، اس کے ساتھ تو انھیں پاک کرے گا اور انھیں صاف کرے گا اور ان کے لیے دعا کر، بے شک تیری دعا ان کے لیے باعث سکون ہے۔‘‘"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت55) ➊ {فَلَا تُعْجِبْكَ اَمْوَالُهُمْ وَ لَاۤ اَوْلَادُهُمْ :} یعنی آپ ان لوگوں کے مال و دولت، اولاد اور دنیوی چمک دمک سے دھوکے میں نہ پڑیں کہ اگر اللہ تعالیٰ ان سے ناراض ہوتا تو یہ اس قدر مال دار اور صاحب اولاد کیوں ہوتے؟ بلکہ آپ ان کی ان چیزوں کی طرف نگاہ اٹھا کر بھی نہ دیکھیں۔ دیکھیے سورۂ طٰہٰ (۱۳۱) اور مومنون (۵۵، ۵۶)۔ ¤ ➋ { اِنَّمَا يُرِيْدُ اللّٰهُ لِيُعَذِّبَهُمْ بِهَا فِي الْحَيٰوةِ الدُّنْيَا:} یعنی دنیا میں ان چیزوں کو سعادت مندی خیال مت کریں، اللہ تعالیٰ نے انھیں صرف اس لیے ڈھیل دے رکھی ہے کہ دن رات مال جمع کرنے اور اولاد کی حفاظت کی فکر میں لگے رہیں، نہ انھیں دن کا چین نصیب ہو نہ رات کا آرام۔ سکون قلب جو فقط اللہ کی یاد سے حاصل ہوتا ہے، یعنی «اَلَا بِذِكْرِ اللّٰهِ تَطْمَىِٕنُّ الْقُلُوْبُ» [ الرعد : ۲۸ ] اس سے یہ سراسر محروم رہیں۔ ¤ ➌ { تَزْهَقَ اَنْفُسُهُمْ وَ هُمْ كٰفِرُوْنَ:} یعنی آخر دم تک انھیں توبہ کرنے اور سچے دل سے ایمان لانے کی توفیق نصیب نہ ہو، بلکہ جب یہ مریں تو اپنے مال اور اولاد ہی کی طرف ان کا دھیان ہو، نہ آخرت کی فکر نہ اللہ تعالیٰ سے کوئی غرض۔ اگرچہ مومن کو بھی اپنے مال اور اولاد کی فکر ہوتی ہے، مگر چونکہ اللہ تعالیٰ کی رضا اس کے نزدیک ہر چیز سے مقدم ہوتی ہے اس لیے یہ چیزیں اس کے لیے نعمت ہی ہوتی ہیں وبال جان نہیں ہوتیں۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت56){وَ يَحْلِفُوْنَ بِاللّٰهِ …: ’’فَرِقَ يَفْرَقُ} (ع) ‘‘ سخت خوف زدہ ہونا اور گھبرانا، ییعنی یہ منافق تم سے شدید خوف کی وجہ سے اپنے کفر کا اظہار نہیں کر سکتے، نہ مقابلے میں آنے کی جرأت کر سکتے ہیں، کیونکہ اس صورت میں انھیں اپنے قتل اور بیوی بچوں کے لونڈی غلام بننے کا سخت خطرہ ہے، اس لیے قسمیں کھا کھا کر تم میں سے ہونے کا دعویٰ کرتے ہیں۔ نفاق آدمی میں دوسروں کا خوف اور بزدلی پیدا کرتا ہے۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت57) {لَوْ يَجِدُوْنَ مَلْجَاً …:’’ مَلْجَاً ‘‘ ’’لَجَِأَ يَلْجَأُ} (ف، س)‘‘سے اسم ظرف ہے، پناہ لینے کی جگہ۔{’’ مَغٰرٰتٍ ‘‘ ’’مَغَارَةٌ‘‘} کی جمع ہے۔ {’’غَوْرٌ‘‘} گہری جگہ کو کہتے ہیں، پہاڑ یا زمین میں کوئی غار۔ {’’ مُدَّخَلًا ‘‘ ’’دَخَلَ‘‘ } سے باب افتعال میں سے ظرف ہے، حروف بڑھ جانے سے معنی میں اضافہ ہو گیا، یعنی مشکل اور مشقت سے گھس جانے کی کوئی جگہ۔ مطلب یہ ہے کہ انھیں فرار کا کوئی راستہ نظر نہیں آتا، ورنہ اگر انھیں بری سے بری جگہ بھی جانے کے لیے مل جائے تو رسیاں تڑاتے ہوئے اس کی طرف بھاگ جائیں، کیونکہ بری سے بری جگہیں یہی تین ہو سکتی ہیں، جن کی طرف جایا جا سکتا ہے۔ {’’ يَجْمَحُوْنَ ‘‘ ’’جَمَحَ الْفَرَسُ‘‘} اصل میں گھوڑے کے منہ زور ہو کر سوار کے قابو سے نکل کر بھاگ جانے کو کہتے ہیں، یعنی انھیں مسلمانوں سے، ان کی مجالس اور ان کے معاشرے سے بڑا شدید بغض ہے مگر ان کا بس نہیں چلتا، اس لیے مسلم معاشرے میں رہنے اور اس کے فوائد حاصل کرنے کے لیے تمھارے سامنے تمھارا ہونے کی قسمیں کھاتے ہیں۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت58) {وَ مِنْهُمْ مَّنْ يَّلْمِزُكَ فِي الصَّدَقٰتِ …:’’ لَمَزَ } (ض) ‘‘ سامنے عیب نکالنا، طعن کرنا، یہ بھی منافقین کا شیوہ تھا کہ غنائم و صدقات کی تقسیم میں وہ رسول اللہ صلی اللہ علیہ وسلم پر طعن کرنے اور عیب لگانے سے باز نہیں آتے تھے۔ یہ نہیں کہ صرف صدقات کی تقسیم میں طعن کرتے ہوں، بلکہ یہ ان کے لگائے ہوئے الزامات میں سے ایک تھا، چنانچہ آپ غنائم یا صدقات تقسیم فرماتے تو کہتے دیکھو کیسی خویش پروری اور دوست نوازی ہو رہی ہے، انصاف نہیں ہو رہا۔ مطلب یہ کہ ہمیں کیوں نہیں ملا، ان کے ہاں انصاف کا پیمانہ بس اتنا تھا کہ انھیں مل جائے تو وہ خوش ہیں اور آپ صلی اللہ علیہ وسلم زبردست انصاف کرنے والے ہیں، لیکن اگر اسلام کی مصلحت کے پیش نظر یا کسی دوسرے شخص کے زیادہ ضرورت مند ہونے کی وجہ سے انھیں کچھ نہ مل سکے تو وہ سخت ناراض اور ان کے بقول نبی صلی اللہ علیہ وسلم عدل نہ کرنے والے۔ ({نعوذ بالله} ) ابوسعید خدری رضی اللہ عنہ فرماتے ہیں کہ ایک دفعہ رسول اللہ صلی اللہ علیہ وسلم کچھ تقسیم فرما رہے تھے کہ ذوالخویصرہ تمیمی آیا، کہنے لگا : ’’یا رسول اللہ! عدل کیجیے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تمھیں ویل ہو، جب میں عدل نہیں کروں گا تو اور کون عدل کرے گا؟‘‘ عمر بن خطاب رضی اللہ عنہ نے کہا : ’’اجازت دیجیے میں اس کی گردن اتار دوں۔‘‘ فرمایا : ’’رہنے دو، اس کے کچھ ساتھی ہیں (اور ہوں گے) کہ تم میں سے ایک اپنی نماز ان کی نماز کے مقابلے میں اور اپنے روزے ان کے روزوں کے مقابلے میں حقیر سمجھے گا، وہ دین سے اس طرح نکل جائیں گے جیسے تیر شکار سے نکل جاتا ہے۔‘‘ ابوسعید رضی اللہ عنہ فرماتے ہیں کہ ان کے بارے میں یہ آیت اتری : « وَ مِنْهُمْ مَّنْ يَّلْمِزُكَ فِي الصَّدَقٰتِ» [ بخاری، المناقب، باب علامات النبوۃ فی الإسلام : ۳۶۱۰ ] حنین کی غنیمتوں کی تقسیم کے وقت اور دوسرے کئی موقعوں پر بھی ان لوگوں نے اس قسم کی گستاخیاں کیں۔ خالد بن ولید اور عمر بن خطاب رضی اللہ عنہما جیسے صحابہ نے ان کے قتل کی اجازت مانگی، مگر آپ صلی اللہ علیہ وسلم نے فرمایا، رہنے دو۔ بعض موقعوں پر جب انھوں نے مہاجرین و انصار کو بھڑکا کر ایک دوسرے سے لڑا دیا اور آپ نے صلح کروا دی، اس وقت بھی عبد اللہ بن ابی نے اور اس کے ساتھیوں نے بہت بڑی گستاخی کی، جس کا ذکر سورۂ منافقون میں ہے۔ عمر رضی اللہ عنہ کے اجازت مانگنے کے باوجود آپ نے ان کے قتل کی اجازت نہیں دی، یہ کہہ کر کہ لوگ کہیں گے کہ محمد ( صلی اللہ علیہ وسلم ) اپنے ہی ساتھیوں کو قتل کرتے ہیں۔ [ بخاری، التفسیر، باب قولہ : «سواء علیھم أستغفرت لھم » : ۴۹۰۵ ]"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت59) ➊ {وَ قَالُوْا حَسْبُنَا اللّٰهُ سَيُؤْتِيْنَا اللّٰهُ مِنْ فَضْلِهٖ …:} یعنی کاش! وہ طعنہ زنی اور عیب جوئی کے بجائے اس طرح کہتے، کیونکہ ان کے حق میں یہی بہتر تھا اور یقینا اللہ تعالیٰ بھی ان پر فضل کرتا مگر ان ناشکروں کو اتنی توفیق کہاں کہ اس قسم کا کلمۂ خیر کہہ سکیں، یہ تو جب بات کریں گے ایسی ہی کریں گے جس میں اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی برائی کا پہلو نکلتا ہو۔ ¤ ➋ بعض لوگوں نے اس آیت سے زبردستی یہ بات نکالنے کی کوشش کی ہے کہ جس طرح اللہ تعالیٰ رزق دیتا ہے اسی طرح رسول اللہ صلی اللہ علیہ وسلم بھی دیتے ہیں، حالانکہ ان آیات میں آپ کی زندگی میں غنیمت اور صدقات کی تقسیم کا ذکر ہو رہا ہے اور اگر شرک کی نجاست ذہن میں نہ بھری ہو تو اسی آیت میں یہ الفاظ {’’حَسْبُنَا اللّٰهُ ‘‘} (ہمیں اللہ کافی ہے) پھر {’’سَيُؤْتِيْنَا اللّٰهُ ‘‘} اور {’’ رَسُوْلُهٗۤ ‘‘} کے درمیان {’’ مِنْ فَضْلِهٖ ‘‘} اللہ کے فضل کا ذکر کرکے دونوں کو الگ کرنا اور آخر میں {’’ اِنَّاۤ اِلَى اللّٰهِ رٰغِبُوْنَ‘‘} (بے شک ہم تو اللہ ہی کی طرف رغبت رکھنے والے ہیں) کے الفاظ واضح دلالت کر رہے ہیں کہ دینے والا فقط اللہ تعالیٰ ہی ہے۔ اس سے پہلے فرمایا : ’’کاش! وہ اس پر راضی ہو جاتے جو انھیں اللہ اور اس کے رسول نے دیا۔‘‘ اس کے بعد وہ الفاظ ذکر فرمائے جو اوپر ذکر ہوئے ہیں، جن کا معنی یہ ہے کہ اصل دینے والا تو اللہ ہے لیکن اس کے حکم سے تقسیم آپ کرتے تھے، جیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّمَا أَنَا قَاسِمٌ وَاللّٰهُ يُعْطِيْ ] [ بخاری، العلم، باب من یرد اللہ … : ۷۱ ] ’’میں تو صرف تقسیم کرنے والا ہوں، دینے والا تو اللہ ہی ہے۔‘‘ اپنی زندگی میں رسول اللہ صلی اللہ علیہ وسلم اللہ کے حکم کے مطابق تقسیم فرماتے تھے، اب ان کے بتائے ہوئے طریقے کے مطابق امیرا لمومنین تقسیم فرمائیں گے۔ اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو کئی جگہ یہ اعلان فرمانے کا حکم دیا کہ میں نہ اپنے نفع و نقصان کا مالک ہوں نہ تمھارے اور یہ بھی کہ اللہ کے سوا کوئی بھی کسی کی مدد نہیں کر سکتا۔ دیکھیے سورۂ جن (۲۱)، اعراف (۱۸۸، ۱۹۷، ۱۹۸) اور فاطر(۱۳ تا ۱۵) جنگ تبوک میں جب آپ سے سواریاں مانگنے کے لیے بعض مجاہد آپ کے پاس آتے اور آپ فرماتے کہ میرے پاس سواریاں نہیں ہیں جو میں تمھیں دوں، تو سواریاں حاصل نہ کر سکنے والے مجاہد روتے ہوئے واپس جاتے۔ دیکھیے سورۂ توبہ (۹۲)۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت60) ➊ {اِنَّمَا الصَّدَقٰتُ لِلْفُقَرَآءِ وَ الْمَسٰكِيْنِ … :} منافقین کا طعن دور کرنے کے لیے اللہ تعالیٰ نے خود صدقات کے حق دار بیان فرما دیے، تاکہ سب لوگ جان لیں کہ صدقات کی تقسیم کا رسول اللہ صلی اللہ علیہ وسلم کو بھی اختیار نہیں، لہٰذا آپ صلی اللہ علیہ وسلم پر طعن بے سود ہے۔ یہاں صدقات سے مراد فرض صدقات، یعنی زکوٰۃ و عشر ہیں، کیونکہ حکومت کی طرف سے وصولی کے لیے عاملین فرض زکوٰۃ ہی کے لیے بھیجے جاتے تھے، یہ الگ بات ہے کہ کوئی ان کے پاس نفل صدقہ بھی جمع کروا دے۔ صدقے کو صدقہ اس لیے کہتے ہیں کہ اللہ کے لیے مال خرچ کرنے والا عملی طور پر اپنے ایمان کے صدق کا مظاہرہ کرتا ہے۔ یہ لفظ عام طور پر نفلی خرچ پر بولا جاتا ہے، مگر کبھی فرض پر بھی بولا جاتا ہے، جیسا کہ فرمایا : «خُذْ مِنْ اَمْوَالِهِمْ صَدَقَةً» [ التوبۃ : ۱۰۳ ] یہاں فرض صدقات ہی مراد ہیں۔ اس آیت کے آخر میں {’’ فَرِيْضَةً مِّنَ اللّٰهِ ‘‘} سے بھی یہی ثابت ہوتا ہے، کیونکہ نفلی صدقات کو فریضہ نہیں کہا جاتا۔ {’’ اِنَّمَا الصَّدَقٰتُ ‘‘} سے معلوم ہوا کہ ان مقامات کے علاوہ زکوٰۃ و عشر خرچ کرنا جائز نہیں۔ ¤ ➋ {لِلْفُقَرَآءِ وَ الْمَسٰكِيْنِ:} فقیر اور مسکین دونوں لفظ محتاج کے معنی میں آتے ہیں، بعض اہل علم فقیر کو زیادہ بدحال قرار دیتے ہیں، بعض مسکین کو اور بعض دونوں کو ایک ہی قرار دیتے ہیں۔ دلائل کے لحاظ سے راجح بات یہ معلوم ہوتی ہے کہ فقیر مسکین سے زیادہ بدحال ہوتا ہے، کیونکہ یہ ’’ فقر‘‘ سے مشتق ہے، کمر کے مہروں کو {’’ فَقَرَاتُ الظَّهْرِ‘‘} کہتے ہیں۔ فقیر بمعنی مفقور ہے، یعنی ضرورت کی اشیاء نہ ہونے کی وجہ سے گویا اس کی کمر ٹوٹی ہوئی ہے۔ مسکین ’’سکن‘‘ سے مشتق ہے کہ ضرورت مندی نے اس کی حرکت کو سکون میں بدل دیا ہے۔ گویا فقیر کی حالت اس شخص کی سی ہے جس کے پاس کچھ نہیں اور مسکین وہ ہے جس کی آمدنی اس کی ضروریات سے کم ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «اَمَّا السَّفِيْنَةُ فَكَانَتْ لِمَسٰكِيْنَ يَعْمَلُوْنَ فِي الْبَحْرِ » [ الکہف : ۷۹ ] یعنی وہ کشتی چند مساکین کی تھی جو سمندر میں کام کرتے تھے۔ ظاہر ہے کہ کشتی کا مالک جو کام بھی کرتا ہو بالکل خالی ہاتھ نہیں ہوتا۔ ہاں، آمدنی ضرورت سے کم ہونے کی وجہ سے وہ ضرورت مند و محتاج ہوتا ہے۔ زیر تفسیر آیت میں فقراء کو پہلے لانے سے بھی ان کے زیادہ بدحال ہونے کا اشارہ ملتا ہے۔ لیکن یہ بات یاد رہنی چاہیے کہ یہ فرق اس وقت ضروری ہو گا جب فقیر اور مسکین دونوں لفظ اکٹھے آئیں، جیسے ایمان اور اسلام کا فرق ہے، لیکن الگ الگ آئیں تو دونوں ایک ہی ہیں۔ اسی طرح ان میں سے صرف فقیر یا مسکین کا لفظ آئے تو وہ دونوں قسم کے ضرورت مندوں پر بول لیا جاتا ہے، خواہ ان کے پاس کچھ ہو یا نہ ہو۔ یہ دونوں زکوٰۃ کے مستحق ہیں، خواہ وہ بدحال فقیر ہوں یا سفید پوش ضرورت مند۔ ¤ ➌ { وَ الْعٰمِلِيْنَ عَلَيْهَا:} زکوٰۃ و عشر کی وصولی کے لیے رسول اللہ صلی اللہ علیہ وسلم آدمی مقرر فرماتے تھے اورباقاعدہ ان کا محاسبہ فرماتے تھے، جیسا کہ آپ صلی اللہ علیہ وسلم نے ابن اللتبیہ رضی اللہ عنہ کو اس کام پر مقرر فرمایا تھا اور ان کی آمد پر محاسبہ کرتے ہوئے حکومت کے عمال کو ملنے والے تحائف کو ان کے لیے ناجائز قرار دیا تھا۔ امام بخاری رحمہ اللہ نے {’’ كِتَابُ الْاَحْكَامِ‘‘} میں باب قائم فرمایا ہے : {’’ بَابُ رِزْقِ الْحُكَّامِ وَالْعَامِلِيْنَ عَلَيْهَا۔‘‘} ¤ ➍ { وَ الْمُؤَلَّفَةِ قُلُوْبُهُمْ:} اس سے مراد وہ نومسلم ہیں جن کی دل جوئی کرکے انھیں اسلام پر ثابت قدم رکھنا مقصود ہو، یا وہ کفار جن کی دل جوئی سے ان کے اسلام لانے کی امید ہے، یا وہ بااثر لوگ جن پر خرچ کرنے سے کئی لوگوں کے مسلمان ہونے کی امید ہے، یا وہ کافر سردار جن پر خرچ کرنے سے ان کے علاقے میں مسلمانوں کے ظلم و ستم سے محفوظ رہنے کی امید ہے۔ بعض لوگ کہتے ہیں کہ اسلام کے غلبے کے بعد یہ مد ختم ہو گئی، جیسا کہ امیر المومنین عمر بن خطاب رضی اللہ عنہ نے فرمایا، مگر موجودہ زمانے کے حالات کو سامنے رکھیں تو آج کل شاید رسول اللہ صلی اللہ علیہ وسلم کے زمانے سے بھی زیادہ اس کی ضرورت ہے، کیونکہ کفار اسی طریقے سے مسلمانوں کو مرتد کر رہے ہیں۔ ¤ ➎ { وَ فِي الرِّقَابِ:} گردنیں چھڑانے سے مراد غلاموں کو خرید کر آزاد کرنا ہے۔ مکاتب غلاموں کی (جنھوں نے اپنے مالکوں سے اپنی قیمت قسطوں میں ادا کرنے کی شرط پر آزادی کا معاہدہ کیا ہوا ہے) مدد کرنا ہے۔ آج کل عدالتوں کے کفریہ نظام کی وجہ سے بے گناہ لوگ یا وہ گناہ گار جن کی شرعی سزا قید نہیں ہے، مگر کافرانہ قانون کی وجہ سے قید ہیں، یا کفر کی عدالتوں کا عائد کر دہ جرمانہ ادا نہ کر سکنے کی وجہ سے یا مقدمہ کے اخراجات ادا نہ کر سکنے کی وجہ سے جیلوں میں سال ہا سال سے سڑ رہے ہیں ان کو چھڑانے پر زکوٰۃ صرف کرنا بھی اس میں شامل ہے۔ (واللہ اعلم) ¤ ➏ { وَ الْغٰرِمِيْنَ :} وہ مقروض جو قرض ادا نہیں کر سکتے، یا وہ کاروباری لوگ یا زمیندار وغیرہ جو کاروبار یا فصل برباد ہوجانے کی وجہ سے زیر بار ہو گئے، اگر وہ اپنی جائداد میں سے قرض ادا کریں تو فقیر ہو جائیں، یا وہ بااثر لوگ جنھوں نے صلح کروانے کے لیے لوگوں کی دیتیں یا رقوم اپنے ذمے لے لیں، یہ سب غارمین میں آتے ہیں۔ ¤ ➐ {وَ فِيْ سَبِيْلِ اللّٰهِ:} اس لفظ کے دو استعمال ہیں، ایک تو ہر نیکی ہی اللہ کے لیے اور اللہ کے راستے میں ہے اور فقراء و مساکین وغیرہ پر خرچ بھی فی سبیل اللہ ہے، جن کا ذکر اسی آیت میں پہلے ہو چکا ہے۔ دوسرا ان سب سے الگ فی سبیل اللہ ہے۔ اس سے مراد تمام مفسرین کے اتفاق کے ساتھ جہاد فی سبیل اللہ ہے۔ مجاہد غنی بھی ہو تو اس پر جہادی ضروریات کی خاطر خرچ کیا جا سکتا ہے۔ حدیث میں حج و عمرہ کو بھی اس مد میں شامل کیا گیا ہے۔ آپ تفسیر کی کتابیں دیکھ لیں یا فقہ کی {’’ وَ فِيْ سَبِيْلِ اللّٰهِ ‘‘} کی تشریح {’’ هُمُ الْغُزَاةُ ‘‘} ہی پائیں گے کہ اس سے مراد اللہ کی راہ میں لڑنے والے ہیں، بلکہ اہل علم کا فیصلہ ہے کہ اگر ایک طرف فقراء و مساکین ہوں اور ایک طرف غازیانِ اسلام کو ضرورت ہو تو مجاہدین کی مدد کو ترجیح دی جائے گی، کیونکہ شکست کی صورت میں فقر و مسکنت کے ساتھ کفار کی غلامی کی ذلت اور اسلام کی بے حرمتی کی مصیبت بھی جمع ہو جائے گی۔ ¤ ➑ { وَ ابْنِ السَّبِيْلِ:} مسافر خواہ صاحب حیثیت ہو اگر سفر میں اسے ضرورت پڑ جائے تو اس پر زکوٰۃ میں سے خرچ کیا جا سکتا ہے۔ ¤ ➒ { فَرِيْضَةً مِّنَ اللّٰهِ:} معلوم ہوا کہ یہ مصارف فرض صدقات و عشر کے بیان ہوئے ہیں۔ چند اہل علم نے کہا کہ ضروری ہے کہ زکوٰۃ اور عشر میں آنے والا مال آٹھ حصوں میں تقسیم کیا جائے اور لازماً ہر مصرف میں خرچ کیا جائے، مگر رسول اللہ صلی اللہ علیہ وسلم اور خلفاء کے عمل کو سامنے رکھتے ہوئے اکثر اہل علم کا کہنا یہ ہے کہ ان میں سے جس مصرف میں زیادہ ضرورت ہو وہاں زیادہ بلکہ سب کا سب بھی صرف کیا جا سکتا ہے۔ ہاں، ان مصارف کے علاوہ خرچ کرنا جائز نہیں اور یہی بات درست ہے۔ خود رسول اللہ صلی اللہ علیہ وسلم نے اس کی اجازت دی ہے۔ یاد رہے کہ فرض صدقہ صرف مسلمانوں پر خرچ کیا جا سکتا ہے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کو یمن بھیجتے وقت انھیں اہل یمن کو کلمۂ شہادت اور روزانہ پانچ نمازیں تسلیم کر لینے کے بعد زکوٰۃ بتانے کا حکم دیا کہ اللہ تعالیٰ نے ان کے اموال میں صدقہ فرض فرمایا ہے : [ تُؤْخَذُ مِنْ أَغْنِيَاءِ هِمْ فَتُرَدُّ فِيْ فُقَرَاءِ هِمْ ] ’’جو ان کے اغنیاء سے لیا جائے گا اور انھی کے فقراء پر واپس کر دیا جائے گا۔‘‘ [ بخاری، الزکوٰۃ، باب أخذ الزکوٰۃ من الأغنیاء …: ۱۴۹۶ ] مؤلفۃ القلوب پر خرچ بھی دراصل مسلمانوں ہی پر خرچ کی ایک صورت ہے۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت61) ➊ {وَ مِنْهُمُ الَّذِيْنَ يُؤْذُوْنَ النَّبِيَّ … :} زمخشری نے فرمایا {’’ اُذُنٌ ‘‘} (کان) وہ آدمی ہے جو ہر ایک کی بات سن کر اسے سچا سمجھے۔ سنتے چلے جانے کی وجہ سے اس آدمی کا نام ہی کان رکھ دیا، جیسے جاسوس کا کام آنکھ سے تعلق رکھتا ہے، اس کا نام ہی ’’عین‘‘ (آنکھ) رکھ دیا گیا۔ ان منافقین کا مطلب یہ تھا کہ آپ کان کے کچے ہیں، ہر ایک کی بات سن کر اس پر اعتبار کر لیتے ہیں۔ دیکھیے یہ آپ پر کتنا تکلیف دہ تبصرہ ہے۔ رسول اللہ صلی اللہ علیہ وسلم کو ایذا دینے والوں کے لیے سورۂ احزاب (۵۷) میں دنیا اور آخرت میں اللہ تعالیٰ کی لعنت اور رسوا کن عذاب کا ذکر ہے اور یہاں ان کے لیے عذاب الیم بیان فرمایا۔ ¤ ➋ {قُلْ اُذُنُ خَيْرٍ:} یعنی ہاں تمھاری بات اس حد تک صحیح ہے کہ محمد صلی اللہ علیہ وسلم ہر ایک کی بات سن لیتے ہیں اور خاموش رہتے ہیں، مگر یہ الزام صحیح نہیں کہ ہر بات سن کر اس پر اعتبار کر لیتے ہیں۔ اعتبار صرف اسی بات کا کرتے ہیں جو سچی اور حقیقی ہوتی ہے، جو پکے مومن بتاتے ہیں۔ جھوٹی بات کو سن تو لیتے ہیں مگر اس پر صبر اور درگزر سے کام لیتے ہیں، یہ چیز تمھارے حق میں خیر (بہتر) ہے۔ ورنہ آپ جھوٹی بات سن کر اگر اس پر فوراً مؤاخذہ کرنے والے ہوتے تو تم اپنے جھوٹے عذروں کی بنا پر یا تو کب کے قتل کر دیے گئے ہوتے یا مدینہ سے نکال دیے گئے ہوتے۔ ¤ ➌ { وَ رَحْمَةٌ لِّلَّذِيْنَ اٰمَنُوْا مِنْكُمْ:} یہاں ایمان لانے والوں سے مراد وہ لوگ ہیں جو ایمان کا دعویٰ کرتے ہیں، چاہے دل سے ایمان دار نہ ہوں، ایسے لوگوں کے لیے رحمت ہونے کا مطلب یہ ہے کہ آپ ان کے راز کھولتے نہیں بلکہ انھیں اپنی اصلاح کر لینے کا موقع دیتے ہیں۔ (فتح القدیر)"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت62){يَحْلِفُوْنَ بِاللّٰهِ لَكُمْ لِيُرْضُوْكُمْ …:} منافقین جب الگ مجلسوں میں بیٹھتے یا کہیں اکیلے ہوتے تو مسلمانوں اور رسول اللہ صلی اللہ علیہ وسلم پر پھبتیاں کستے۔ مسلمانوں کو یا نبی صلی اللہ علیہ وسلم کو اگر کبھی ان کی اطلاع ہو جاتی تو وہ قسمیں کھا کھا کر مسلمانوں کو راضی کرنے کی کوشش کرتے اور اللہ تعالیٰ اور رسول اللہ صلی اللہ علیہ وسلم کی پروا نہ کرتے۔ اس آیت میں منافقین کی اس حرکت کا ذکر کیا گیا ہے۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت63){ اَلَمْ يَعْلَمُوْۤا اَنَّهٗ مَنْ يُّحَادِدِ اللّٰهَ وَ رَسُوْلَهٗ … :’’ يُحَادِدِ ‘‘}} یہ {’’حَدٌّ‘‘} سے مشتق ہے جس کا معنی ’’جانب‘‘ ہے۔ باب مفاعلہ عموماً مقابلے کے لیے آتا ہے، یعنی اللہ اور اس کے رسول ایک جانب ہوں اور یہ اس کے مقابلے میں دوسری جانب ہوں۔ آگے سوال کے طور پر ان کا انجام ذکر فرمایا کہ کیا انھیں یہ معلوم نہیں؟ سوال کا مقصد پوچھنا نہیں بلکہ بتانا ہے کہ یہ بات اتنی واضح ہے کہ ہر کوئی جانتا ہے کہ اللہ تعالیٰ اور اس کے پیغمبر کے مقابلے کا نتیجہ کیا ہوتا ہے ۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت64) {يَحْذَرُ الْمُنٰفِقُوْنَ … :} اب منافقین کی مزید کمینی حرکتوں کا ذکر ہوتا ہے اور کافی آگے تک چلا جاتا ہے، اس بنا پر اس سورت کو ’’الفاضحہ‘‘ بھی کہتے ہیں، یعنی منافقوں کے راز کھولنے والی اور ان کو رسوا کرنے والی۔ منافقین بظاہر ایمان کے باوجود دل میں رسول اللہ صلی اللہ علیہ وسلم سے کفر رکھتے تھے، ان میں سے بعض رسول اللہ صلی اللہ علیہ وسلم کو سچا سمجھنے کے باوجود ضد اور تعصب کی وجہ سے دل میں آپ سے کفر رکھتے تھے، کچھ شک میں مبتلا تھے، اس لیے ایمان سے خالی تھے اور جو بالکل دل سے آپ کو جھوٹا سمجھتے تھے وہ بھی کئی دفعہ مشاہدہ کر چکے تھے کہ جوں ہی وہ ایسی کوئی بات یا حرکت کرتے تو اللہ تعالیٰ وحی کے ذریعے سے رسول اللہ صلی اللہ علیہ وسلم کو آگاہ کر دیتا، اس لیے وہ اپنے دلی کفر کی وجہ سے کبھی کبھی آپس میں اپنے دلی بغض کا اظہار کر لیتے، مگر ساتھ ہی خوف زدہ رہتے کہ کوئی سورت اترے گی جو ان کے راز اور دلی کیفیت ان کے سامنے اور مسلمانوں کے سامنے کھول کر رکھ دے گی۔ {’’ تُنَبِّئُهُمْ ‘‘} میں {’’ هُمْ ‘‘} کی ضمیر منافقوں کی طرف بھی جا سکتی ہے اور مومنوں کی طرف بھی۔ اللہ تعالیٰ نے فرمایا، تم مذاق اڑا لو، تم جس بات کے ظاہر ہونے سے ڈر رہے ہو اللہ تعالیٰ یقینا اسے سب کے سامنے لے آنے والا ہے۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت65){وَ لَىِٕنْ سَاَلْتَهُمْ لَيَقُوْلُنَّ … :} منافق آپس میں گپیں لگاتے ہوئے اللہ، اس کے رسول اور آیاتِ الٰہی کا مذاق اڑاتے۔ رسول اللہ صلی اللہ علیہ وسلم کو کسی ذریعے سے یا وحی الٰہی سے اطلاع ہوتی اور آپ پوچھتے تو وہ کہتے ہم تو یوں ہی راستہ کاٹنے کے لیے شغل کی باتیں اور دل لگی کر رہے تھے۔ فرمایا ان سے کہیے کہ تمھارے آپس کے شغل اور دل لگی کا اللہ اور اس کے رسول اور اس کی آیات کے ساتھ مذاق سے کیا تعلق اور کیا دل لگی کے لیے تمھیں یہی ملے ہیں؟ وہ لوگ بار بار معذرت کرتے، مگر رسول اللہ صلی اللہ علیہ وسلم یہی فرماتے۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت66) ➊ { لَا تَعْتَذِرُوْا قَدْ كَفَرْتُمْ بَعْدَ اِيْمَانِكُمْ …:} بہانے مت بناؤ، صاف مانو کہ تم نے ایمان لا کر پھر صریح کفر کیا ہے۔ جو شخص دین کی باتوں میں ٹھٹھا کرے اگرچہ دل سے منکر نہ ہو تو وہ کافر ہو گیا، اگر یہ نہ بھی ہو تو تب بھی وہ منافق تو لازماً ہے۔ اصل یہ ہے کہ دین کی باتوں میں ظاہر و باطن کا باادب رہنا ضروری ہے۔ (موضح) ¤ ➋ { اِنْ نَّعْفُ عَنْ طَآىِٕفَةٍ مِّنْكُمْ …:} یعنی جس نے نفاق سے توبہ کر لی اور آئندہ مخلص ہو کر زندگی بسر کی، اسے تو ہم معاف کرتے ہیں مگر جو اپنے کفر پر قائم رہا اسے ضرور عذاب ہو گا۔ اللہ تعالیٰ کی مہربانی دیکھیے منافقین کو بھی اخلاص اختیار کرنے پر معافی کا وعدہ اور اس کی ترغیب دی جا رہی ہے اور بعض روایات سے معلوم ہوتا ہے کہ کئی منافقین بھی بعد میں مخلص مسلمان ہو گئے تھے۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت67) ➊ {اَلْمُنٰفِقُوْنَ وَ الْمُنٰفِقٰتُ بَعْضُهُمْ مِّنْۢ بَعْضٍ …:} یعنی منافق مرد ہوں یا عورتیں سب ایک جیسے ہیں اور سب کی ایک جیسی عادات اور بدخصلتیں ہیں، وہ برے کام کا حکم دیں گے، اچھے کام سے روکیں گے اور بخل کی وجہ سے اپنے ہاتھ بند رکھیں گے، یعنی خرچ نہیں کریں گے۔ یہاں اللہ تعالیٰ کے انھیں بھلا دینے کا ذکر ان کے اللہ تعالیٰ کو بھول جانے کے مقابلے میں فرمایا ہے۔ مقصد یہ ہے کہ اللہ تعالیٰ نے بھی ان سے یہی سلوک کیا کہ ان کی پروا ہی نہیں فرمائی، بلکہ انھیں اپنے فضل و کرم سے محروم کر دیا۔ اس تاویل کی ضرورت اس بنا پر ہے کہ اللہ تعالیٰ نے خود موسیٰ علیہ السلام کی زبانی نقل فرمایا : «لَا يَضِلُّ رَبِّيْ وَ لَا يَنْسَى» [ طٰہٰ : ۵۲ ] ’’میرا رب بھٹکتا ہے اور نہ بھولتا ہے۔‘‘ معلوم ہوا کہ یہاں اللہ تعالیٰ کی بھولنے کی طرف نسبت صرف لفظ کے ہم شکل ہونے تک ہے، ورنہ وہ ذات پاک بھولنے سے ہر طرح پاک ہے ۔ ¤ ➋ { هُمُ الْفٰسِقُوْنَ:} یعنی فسق (نافرمانی) میں حد کمال تک پہنچ چکے ہیں۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’بے اعتقاد کی صلاحیت کیا معتبر ہے، اسے فاسق ہی کہنا چاہیے۔‘‘ (موضح)"
    },
    {
      "ayah": 68,
      "tafsir": ""
    },
    {
      "ayah": 69,
      "tafsir": "(آیت69) {كَالَّذِيْنَ مِنْ قَبْلِكُمْ … :} اس سے پہلے منافقین کا ذکر غائب کے صیغے کے ساتھ ہو رہا تھا، اب مزید تنبیہ کے لیے اللہ تعالیٰ نے انھیں براہِ راست مخاطب فرمایا، یعنی تم بھی ان لوگوں کی طرح ہو اور تمھارے کرتوت بھی ان لوگوں جیسے ہیں جنھوں نے تم سے پہلے رسولوں کے ساتھ کفر کیا۔ اس فرق کے ساتھ کہ وہ قوت میں تم سے زیادہ سخت اور اموال و اولاد میں بہت زیادہ تھے۔ تمھاری ایک دوسرے سے مشابہت دو طرح سے ہے، دنیا میں انھوں نے اپنے لکھے ہوئے حصے سے فائدہ اٹھایا، تم نے بھی اپنے سے پہلے لوگوں کی طرح اپنے نصیب سے فائدہ اٹھایا اور انھوں نے اپنے انبیاء کا مذاق اڑایا اور ان کے متعلق فضول باتیں کیں، تم نے بھی یہی کام کیا۔ اب آخرت میں بھی اعمال ضائع ہونے اور خائب و خاسر ہونے میں تم دونوں ایک جیسے ہو۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت70){ اَلَمْ يَاْتِهِمْ نَبَاُ الَّذِيْنَ مِنْ قَبْلِهِمْ … : ’’ وَ الْمُؤْتَفِكٰتِ ‘‘ ’’اِئْتَفَكَ يَأْتَفِكُ‘‘} باب افتعال سے اسم فاعل ہے، الٹنے والیاں،، یعنی لوط علیہ السلام کی قوم کی بستیاں جن کا مرکز سدوم تھا، جنھیں ان کے اعمال بد کی وجہ سے زمین سے اٹھا کر الٹا گرا دیا گیا اور کھنگروں کی بارش برسائی گئی۔ ان چھ قوموں کا خصوصاً ذکر اس لیے فرمایا کہ یہ عرب کے آس پاس عراق، شام اور یمن میں آباد تھیں۔ انھوں نے اللہ تعالیٰ کی نافرمانی کی اور اس کے انبیاء کو جھٹلایا، اس لیے انھوں نے خود اپنے اوپر عذاب کو دعوت دی۔ سورۂ اعراف میں ان کے واقعات گزر چکے ہیں اور آگے سورۂ ہود میں مزید تفصیل آ رہی ہے۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت71) {وَ الْمُؤْمِنُوْنَ وَ الْمُؤْمِنٰتُ بَعْضُهُمْ اَوْلِيَآءُ بَعْضٍ … :} منافق مردوں اور منافق عورتوں کی بد عادات ذکر کرنے کے بعد اب اہل ایمان مردوں اور اہل ایمان عورتوں کے خصال حمیدہ کاذکر ہے کہ وہ سب ایک دوسرے کے اولیاء، یعنی دوست، محبت رکھنے والے اور مدد کرنے والے ہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تم میں سے کوئی شخص صاحب ایمان نہیں ہو سکتا، حتیٰ کہ وہ اپنے (مسلم) بھائی کے لیے وہی پسند کرے جو اپنے لیے کرتا ہے۔‘‘ [ بخاری، الإیمان، باب من الإیمان أن یحب لأخیہ : ۱۳، عن أنس رضی اللہ عنہ ] نعمان بن بشیر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مومنوں کی مثال آپس کی محبت، ایک دوسرے پر رحم اور شفقت میں ایک جسم کی ہے، جس کے اگر ایک عضو کو تکلیف پہنچتی ہے تو بقیہ سارے اعضا بخار اور بے چینی کی صورت میں اس کا ساتھ دیتے ہیں۔‘‘ [ مسلم، البر والصلۃ، باب تراحم المؤمنین… : ۲۵۸۶ ] اور فرمایا : ’’ایک مومن دوسرے مومن کے لیے عمارت کی مانند ہے جس کی بعض اینٹیں بعض کو سہارا دیتی ہیں۔‘‘ [ مسلم، البر والصلۃ، باب تراحم المؤمنین… : ۲۵۸۵ ] اس کے بعد مومنوں کی مزید صفات جو منافقوں کے بالکل برعکس ہیں، بیان فرمائیں اور ان پر رحم کا وعدہ فرمایا، ساتھ ہی اپنے ہر چیز پر غلبے اور کمال حکمت کا ذکر فرمایا کہ وہ ہر چیز پر غالب ہے مگر اس کا غلبہ اندھا غلبہ نہیں بلکہ کمال حکمت کے ساتھ ملا ہوا ہے ۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت71) {وَ الْمُؤْمِنُوْنَ وَ الْمُؤْمِنٰتُ بَعْضُهُمْ اَوْلِيَآءُ بَعْضٍ … :} منافق مردوں اور منافق عورتوں کی بد عادات ذکر کرنے کے بعد اب اہل ایمان مردوں اور اہل ایمان عورتوں کے خصال حمیدہ کاذکر ہے کہ وہ سب ایک دوسرے کے اولیاء، یعنی دوست، محبت رکھنے والے اور مدد کرنے والے ہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تم میں سے کوئی شخص صاحب ایمان نہیں ہو سکتا، حتیٰ کہ وہ اپنے (مسلم) بھائی کے لیے وہی پسند کرے جو اپنے لیے کرتا ہے۔‘‘ [ بخاری، الإیمان، باب من الإیمان أن یحب لأخیہ : ۱۳، عن أنس رضی اللہ عنہ ] نعمان بن بشیر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مومنوں کی مثال آپس کی محبت، ایک دوسرے پر رحم اور شفقت میں ایک جسم کی ہے، جس کے اگر ایک عضو کو تکلیف پہنچتی ہے تو بقیہ سارے اعضا بخار اور بے چینی کی صورت میں اس کا ساتھ دیتے ہیں۔‘‘ [ مسلم، البر والصلۃ، باب تراحم المؤمنین… : ۲۵۸۶ ] اور فرمایا : ’’ایک مومن دوسرے مومن کے لیے عمارت کی مانند ہے جس کی بعض اینٹیں بعض کو سہارا دیتی ہیں۔‘‘ [ مسلم، البر والصلۃ، باب تراحم المؤمنین… : ۲۵۸۵ ] اس کے بعد مومنوں کی مزید صفات جو منافقوں کے بالکل برعکس ہیں، بیان فرمائیں اور ان پر رحم کا وعدہ فرمایا، ساتھ ہی اپنے ہر چیز پر غلبے اور کمال حکمت کا ذکر فرمایا کہ وہ ہر چیز پر غالب ہے مگر اس کا غلبہ اندھا غلبہ نہیں بلکہ کمال حکمت کے ساتھ ملا ہوا ہے ۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت73) {يٰۤاَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَ الْمُنٰفِقِيْنَ … :} مدینہ آنے پر رسول اللہ صلی اللہ علیہ وسلم طویل مدت تک منافقین سے نرمی برتتے رہے اور ان کی سازشوں اور کمینگیوں سے درگزر فرماتے رہے، مگر اس حسن سلوک سے اصلاح کے بجائے ان کی سرکشی بڑھتی ہی گئی، اس لیے جب یہ سورت اتری جو قرآن کی سب سے آخر میں اترنے والی سورتوں میں سے ہے تو حکم ہوا کہ اب نرمی اور درگزر کے بجائے سختی اور بندوبست کا وقت آگیا ہے، اس لیے اب تک آپ جو نرمی اور چشم پوشی کا معاملہ کرتے رہے اسے ختم کیجیے اور ان کے ہر قصور پر سختی سے گرفت کیجیے۔ اس آیت سے معلوم ہوا کہ منافقین صریح کفر کا اظہار کریں اور اس پر قائم رہیں تو کفار کی طرح ان سے بھی جہاد بالسیف کیا جائے۔ ابن جریر طبری رحمہ اللہ نے اسی کو ترجیح دی ہے۔البتہ اگر وہ کفر کے اظہار کے بعد اس سے مکر جائیں تو ان پر سختی کی جائے اور زبان سے طعن و ملامت کی جائے، تلوار سے قتال نہ کیا جائے۔ ہاں حدودِ الٰہی ان پر ضرور نافذ کی جائیں، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے منافقین سے قتال بالسیف نہیں کیا بلکہ قتل کی اجازت طلب کرنے پر بھی فرمایا : ’’رہنے دو لوگ کہیں گے محمد صلی اللہ علیہ وسلم اپنے ہی ساتھیوں کو قتل کرتا ہے۔‘‘ حافظ ابن کثیر رحمہ اللہ مختلف اقوال نقل کرنے کے بعد لکھتے ہیں : ’’ان اقوال میں اختلاف نہیں، اصل بات یہ ہے کہ مختلف حالات میں حسب موقع سزا دی جا سکتی ہے، یعنی منافقین صریح کفر کے اظہار کی جرأت کریں تو پھر ان سے کفار کی طرح ہی معاملہ ہو گا۔‘‘"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت74) ➊ {يَحْلِفُوْنَ بِاللّٰهِ مَا قَالُوْا:} منافقین اپنی نجی مجلسوں میں کفریہ باتیں کرتے، مگر پردہ چاک اور راز فاش ہونے پر جھوٹی قسمیں کھا کر مکر جاتے، جب گواہیوں سے بات ثابت ہو جاتی تو بہانہ بنا لیتے کہ ہم تو ہنسی مذاق اور دل لگی میں ایسی باتیں کر رہے تھے، آپ نے انھیں سنجیدہ لے لیا ہے اور اپنی قسموں کو بطور ڈھال استعمال کرتے۔ دیکھیے سورۂ نساء ( ۶۲) اور توبہ (۴۲، ۵۶ ، ۱۰۷)۔ ¤ ➋ { وَ لَقَدْ قَالُوْا كَلِمَةَ الْكُفْرِ … :} وہ کفر کی بات کیا تھی جو ان منافقوں نے کہی تھی، قرآن مجید نے یہاں اس کی صراحت نہیں فرمائی، اس لیے کہ یہ کوئی ایک آدھ واقعہ نہیں تھا نہ ہی ایک آدھ شخص کی بات تھی، اکثر منافقین بلکہ سبھی کا یہی وتیرہ تھا اور ان لوگوں نے مختلف موقعوں پر کفر کی باتیں کہی تھیں۔ یہاں مثال کے طور پر صرف ایک واقعہ نقل کیا جاتا ہے جو سورۂ منافقون میں مختصر اور بخاری و مسلم میں کچھ تفصیل سے بیان ہوا ہے۔ زید بن ارقم رضی اللہ عنہ بیان کرتے ہیں کہ میں ایک لڑائی میں تھا تو میں نے عبد اللہ بن ابی سے سنا ، وہ کہہ رہا تھا : ’’ان لوگوں پر خرچ نہ کرو جو اللہ کے رسول کے پاس ہیں، یہاں تک کہ وہ لوگ منتشر ہو جائیں جو آپ کے اردگرد ہیں اور یہ کہ ہم اگر مدینہ واپس پہنچ گئے تو جو زیادہ عزت والا ہے وہ ذلیل تر کو نکال دے گا۔‘‘ میں نے یہ بات اپنے چچا یا عمر رضی اللہ عنہما سے بیان کی، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا، آپ صلی اللہ علیہ وسلم نے مجھے بلایا، میں نے آپ کو یہ بات بیان کر دی۔ رسول اللہ صلی اللہ علیہ وسلم نے عبد اللہ بن ابی اور اس کے ساتھیوں کی طرف پیغام بھیجا، وہ سب قسمیں کھا گئے کہ انھوں نے یہ بات نہیں کہی تو رسول اللہ صلی اللہ علیہ وسلم نے مجھے جھوٹا قرار دے دیا، مجھے ایسی فکر لاحق ہوئی جو مجھے کبھی لاحق نہ ہوئی تھی تو میں گھر میں بیٹھ گیا۔ میرے چچا نے کہا، تم نے یہ کیا چاہا کہ رسول اللہ صلی اللہ علیہ وسلم نے تمھیں جھوٹا قرار دیا اور تم پر ناراض بھی ہوئے تو اللہ تعالیٰ نے سورۂ منافقون نازل فرما دی، رسول اللہ صلی اللہ علیہ وسلم نے میری طرف آدمی بھیجا اور یہ سورت پڑھی اور فرمایا : ’’زید! اللہ تعالیٰ نے تمھیں سچا قرار دیا ہے۔‘‘ [ بخاری، التفسیر، باب قولہ : «إذا جاء ک المنافقون… » : ۴۹۰۰، ۴۹۰۱۔ مسلم : ۲۷۷۲ ] ¤ ➌ { وَ هَمُّوْا بِمَا لَمْ يَنَالُوْا …:} یعنی منافقین نے جو ارادہ کیا تھا وہ اپنی مراد کو نہیں پہنچ سکے اور یہ ناکامی اور نامرادی کوئی ایک مرتبہ نہیں ہوئی، بلکہ وہ ہمیشہ اپنے ناپاک منصوبوں اور سازشوں میں ناکام ہوئے، جن کی چند مثالیں یہ ہیں : (1) وہ رسول اللہ صلی اللہ علیہ وسلم کو قتل کرنا چاہتے تھے اور اسلام کو جڑ سے اکھاڑ پھینکنا چاہتے تھے۔ (2) مجاہدین کے مالی ذرائع بند کرنا چاہتے تھے۔ (3) یہودیوں کو مدینہ میں آباد دیکھنا چاہتے تھے۔ (4) عبد اللہ بن ابی کو تاجِ سلطانی پہنانا چاہتے تھے۔ (5) مسلمانوں کے خلاف مسجد ضرار کا مورچہ بنانا چاہتے تھے۔ (6) تبوک میں رومیوں کے ہاتھوں مسلمانوں کا نام و نشان مٹتا ہوا دیکھنے کی خواہش رکھتے تھے، مگر سب منصوبوں میں ناکام اور نامراد ہوئے۔ آخری حد جس تک وہ پہنچے وہ جنگ تبوک سے واپسی پر آپ کے قتل کا منصوبہ تھا۔ راستے میں عقبہ ایک بلند، دشوار گزاراور تنگ جگہ تھی، رسول اللہ صلی اللہ علیہ وسلم نے اعلان کروا دیا کہ آپ اس راستے سے جائیں گے، اس لیے ادھر سے کوئی نہ جائے۔ چند منافقین نے اس حکم کی خلاف ورزی کرتے ہوئے اس مقام پر آپ کو قتل کرنے کا منصوبہ بنایا۔ چنانچہ صحیح مسلم کی اس حدیث سے اس واقعہ پر روشنی پڑتی ہے، ابو طفیل بیان فرماتے ہیں کہ ’’عقبہ‘‘ والے لوگوں میں سے ایک شخص اور حذیفہ رضی اللہ عنہ (رسول اللہ صلی اللہ علیہ وسلم کے خاص راز دار) کے درمیان کچھ تلخ کلامی ہو گئی، تو وہ کہنے لگا : ’’میں تمھیں قسم دے کر پوچھتا ہوں کہ وہ ’’عقبہ‘‘ والے کتنے آدمی تھے۔‘‘ (حذیفہ رضی اللہ عنہ نے کچھ گریز کیا) تو لوگوں نے کہا : ’’جب وہ پوچھ رہا ہے تو آپ اسے بتا دیں۔‘‘ انھوں نے فرمایا : ’’ہمیں بتایا جاتا تھا کہ وہ چودہ تھے، اگر تو بھی ان میں شامل تھا تو یہ لوگ پندرہ ہو گئے اور میں اللہ کی قسم کھا کر گواہی دیتا ہوں کہ ان میں سے بارہ تو دنیا کی زندگی میں اور اس دن جب گواہ پیش ہوں گے، دونوں (جہاں) میں اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کے دشمن ہیں۔ باقی رہے تین تو انھوں نے معذرت کرتے ہوئے کہا تھا کہ نہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کے اعلان کرنے والے کو سنا تھا اور نہ ہمیں معلوم ہو سکا کہ ان لوگوں کا ارادہ کیا ہے۔‘‘ [ مسلم، صفات المنافقین : 2779/11 ] بیہقی کی دلائل النبوۃ میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں حذیفہ بن یمان اور عمار بن یاسر رضی اللہ عنہما نے انھیں دیکھ کر للکارا تو وہ بھاگ گئے (کیونکہ ان کا منصوبہ خفیہ نہ رہ سکنے کی وجہ سے ناکام ہو گیا)۔ صاحب {’’هداية المستنير‘‘} نے دلائل النبوۃ (۷؍۲۶۰) کا حوالہ دے کر اسے صحیح لغیرہ قرار دیا ہے۔ اس روایت سے صحیح مسلم کی حدیث کی وضاحت ہوتی ہے۔ ¤ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’میری امت میں سے بارہ منافق ایسے ہیں جو نہ جنت میں جائیں گے اور نہ اس کی خوشبو پائیں گے، حتیٰ کہ اونٹ سوئی کے ناکے سے گزر جائے، ان میں سے آٹھ کے لیے تو پھوڑا کافی ہو گا جو آگ کا چراغ ہو گا، جو ان کے کندھوں میں نکلے گا، یہاں تک کہ ان کے سینوں سے نمودار ہو گا۔‘‘ [ مسلم، صفات المنافقین، باب صفات المنافقین… : 2779/10 ]"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75تا77) ➊ {وَ مِنْهُمْ مَّنْ عٰهَدَ اللّٰهَ … : } پہلے یہ لوگ فاقوں مرتے تھے اور ان کے شہر مدینہ جس کا نام ان دنوں یثرب تھا، اس کی بھی کوئی حیثیت نہ تھی، لیکن نبی صلی اللہ علیہ وسلم کی تشریف آوری کے بعد ان کا شہر پورے عرب کا مرکز بن گیا اور ان کی تجارت کا دائرہ بھی وسیع ہو گیا اور جنگوں کی وجہ سے بہت سا مال غنیمت بھی ان کے ہاتھ آیا، جس سے یہ لوگ مال دار ہو گئے۔ آیت میں اسی طرف اشارہ ہے کہ یہ منافقین اتنے احسان فراموش ہیں کہ اللہ اور رسول جن کی بدولت انھیں یہ خوش حالی نصیب ہوئی، انھی کے خلاف بگڑ کر یہ اپنے دلوں کا فساد ظاہر کر رہے ہیں اور انھوں نے اللہ تعالیٰ سے عہد تو یہ کیا تھا کہ اگر اس نے ہمیں اپنا فضل عطا کیا تو ہم صدقہ بھی ضرور کریں گے اور نیک بھی ہو جائیں گے، لیکن اب اللہ تعالیٰ کا فضل ہوا اور اس نے مال و دولت سے نوازا تو انھوں نے اللہ تعالیٰ کا عطا کر دہ مال اسلام کی سربلندی کے لیے خرچ کرنے کے بجائے بخل کرکے اللہ اور اس کے رسول سے منہ ہی موڑ لیا، جس کے نتیجے میں اللہ تعالیٰ نے قیامت تک کے لیے ان کے دلوں میں نفاق رکھ دیا۔ ¤ ➋ بعض مفسرین نے ان آیات کا سبب نزول ثعلبہ بن حاطب کو قرار دیا ہے کہ اس نے رسول اللہ صلی اللہ علیہ وسلم سے مال کے لیے دعا کروائی اور صدقہ کرنے کا وعدہ کیا، جب مال بہت بڑھا تو نماز با جماعت چھوڑنے کے بعد جمعہ بھی چھوڑ دیا اور زکوٰۃ لینے والا اس کے پاس گیا تو کہنے لگا، یہ تو جزیہ ہی ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’افسوس ثعلبہ پر!‘‘ یہ سن کر وہ زکوٰۃ لے کر آیا، مگر آپ نے قبول کرنے سے انکار کر دیا۔ آپ کے بعد ابوبکر، پھر عمر، پھر عثمان رضی اللہ عنہم نے بھی قبول کرنے سے انکار کیا، اسی حالت میں وہ عثمان رضی اللہ عنہ کے عہد میں فوت ہو گیا۔ مگر اہل علم نے اس روایت کا شدید رد کیا ہے اور واضح کیا ہے کہ اس کی کوئی صحیح سند نہیں۔ ابن حزم رحمہ اللہ نے فرمایا، یہ قصہ باطل ہے، کیونکہ ثعلبہ رضی اللہ عنہ بدری صحابی ہیں۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 75تا77) ➊ {وَ مِنْهُمْ مَّنْ عٰهَدَ اللّٰهَ … : } پہلے یہ لوگ فاقوں مرتے تھے اور ان کے شہر مدینہ جس کا نام ان دنوں یثرب تھا، اس کی بھی کوئی حیثیت نہ تھی، لیکن نبی صلی اللہ علیہ وسلم کی تشریف آوری کے بعد ان کا شہر پورے عرب کا مرکز بن گیا اور ان کی تجارت کا دائرہ بھی وسیع ہو گیا اور جنگوں کی وجہ سے بہت سا مال غنیمت بھی ان کے ہاتھ آیا، جس سے یہ لوگ مال دار ہو گئے۔ آیت میں اسی طرف اشارہ ہے کہ یہ منافقین اتنے احسان فراموش ہیں کہ اللہ اور رسول جن کی بدولت انھیں یہ خوش حالی نصیب ہوئی، انھی کے خلاف بگڑ کر یہ اپنے دلوں کا فساد ظاہر کر رہے ہیں اور انھوں نے اللہ تعالیٰ سے عہد تو یہ کیا تھا کہ اگر اس نے ہمیں اپنا فضل عطا کیا تو ہم صدقہ بھی ضرور کریں گے اور نیک بھی ہو جائیں گے، لیکن اب اللہ تعالیٰ کا فضل ہوا اور اس نے مال و دولت سے نوازا تو انھوں نے اللہ تعالیٰ کا عطا کر دہ مال اسلام کی سربلندی کے لیے خرچ کرنے کے بجائے بخل کرکے اللہ اور اس کے رسول سے منہ ہی موڑ لیا، جس کے نتیجے میں اللہ تعالیٰ نے قیامت تک کے لیے ان کے دلوں میں نفاق رکھ دیا۔ ¤ ➋ بعض مفسرین نے ان آیات کا سبب نزول ثعلبہ بن حاطب کو قرار دیا ہے کہ اس نے رسول اللہ صلی اللہ علیہ وسلم سے مال کے لیے دعا کروائی اور صدقہ کرنے کا وعدہ کیا، جب مال بہت بڑھا تو نماز با جماعت چھوڑنے کے بعد جمعہ بھی چھوڑ دیا اور زکوٰۃ لینے والا اس کے پاس گیا تو کہنے لگا، یہ تو جزیہ ہی ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’افسوس ثعلبہ پر!‘‘ یہ سن کر وہ زکوٰۃ لے کر آیا، مگر آپ نے قبول کرنے سے انکار کر دیا۔ آپ کے بعد ابوبکر، پھر عمر، پھر عثمان رضی اللہ عنہم نے بھی قبول کرنے سے انکار کیا، اسی حالت میں وہ عثمان رضی اللہ عنہ کے عہد میں فوت ہو گیا۔ مگر اہل علم نے اس روایت کا شدید رد کیا ہے اور واضح کیا ہے کہ اس کی کوئی صحیح سند نہیں۔ ابن حزم رحمہ اللہ نے فرمایا، یہ قصہ باطل ہے، کیونکہ ثعلبہ رضی اللہ عنہ بدری صحابی ہیں۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 75تا77) ➊ {وَ مِنْهُمْ مَّنْ عٰهَدَ اللّٰهَ … : } پہلے یہ لوگ فاقوں مرتے تھے اور ان کے شہر مدینہ جس کا نام ان دنوں یثرب تھا، اس کی بھی کوئی حیثیت نہ تھی، لیکن نبی صلی اللہ علیہ وسلم کی تشریف آوری کے بعد ان کا شہر پورے عرب کا مرکز بن گیا اور ان کی تجارت کا دائرہ بھی وسیع ہو گیا اور جنگوں کی وجہ سے بہت سا مال غنیمت بھی ان کے ہاتھ آیا، جس سے یہ لوگ مال دار ہو گئے۔ آیت میں اسی طرف اشارہ ہے کہ یہ منافقین اتنے احسان فراموش ہیں کہ اللہ اور رسول جن کی بدولت انھیں یہ خوش حالی نصیب ہوئی، انھی کے خلاف بگڑ کر یہ اپنے دلوں کا فساد ظاہر کر رہے ہیں اور انھوں نے اللہ تعالیٰ سے عہد تو یہ کیا تھا کہ اگر اس نے ہمیں اپنا فضل عطا کیا تو ہم صدقہ بھی ضرور کریں گے اور نیک بھی ہو جائیں گے، لیکن اب اللہ تعالیٰ کا فضل ہوا اور اس نے مال و دولت سے نوازا تو انھوں نے اللہ تعالیٰ کا عطا کر دہ مال اسلام کی سربلندی کے لیے خرچ کرنے کے بجائے بخل کرکے اللہ اور اس کے رسول سے منہ ہی موڑ لیا، جس کے نتیجے میں اللہ تعالیٰ نے قیامت تک کے لیے ان کے دلوں میں نفاق رکھ دیا۔ ¤ ➋ بعض مفسرین نے ان آیات کا سبب نزول ثعلبہ بن حاطب کو قرار دیا ہے کہ اس نے رسول اللہ صلی اللہ علیہ وسلم سے مال کے لیے دعا کروائی اور صدقہ کرنے کا وعدہ کیا، جب مال بہت بڑھا تو نماز با جماعت چھوڑنے کے بعد جمعہ بھی چھوڑ دیا اور زکوٰۃ لینے والا اس کے پاس گیا تو کہنے لگا، یہ تو جزیہ ہی ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’افسوس ثعلبہ پر!‘‘ یہ سن کر وہ زکوٰۃ لے کر آیا، مگر آپ نے قبول کرنے سے انکار کر دیا۔ آپ کے بعد ابوبکر، پھر عمر، پھر عثمان رضی اللہ عنہم نے بھی قبول کرنے سے انکار کیا، اسی حالت میں وہ عثمان رضی اللہ عنہ کے عہد میں فوت ہو گیا۔ مگر اہل علم نے اس روایت کا شدید رد کیا ہے اور واضح کیا ہے کہ اس کی کوئی صحیح سند نہیں۔ ابن حزم رحمہ اللہ نے فرمایا، یہ قصہ باطل ہے، کیونکہ ثعلبہ رضی اللہ عنہ بدری صحابی ہیں۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت78){ اَلَمْ يَعْلَمُوْۤا اَنَّ اللّٰهَ يَعْلَمُ سِرَّهُمْ وَ نَجْوٰىهُمْ …:} اس آیت میں منافقین کو سخت ڈرایا گیا ہے کہ کیا انھیں معلوم نہیں کہ اللہ تعالیٰ ان کے دل کے راز اور سرگوشیاں سب جانتا ہے اور وہ تو تمام غیبوں کو بہت خوب جاننے والا ہے۔ کیا یہ اس سے بھی اپنی دلی حالت چھپا سکیں گے۔ دیکھیے سورۂ زخرف ( ۸۰) اور مجادلہ ( ۷)۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت79) ➊ {اَلَّذِيْنَ يَلْمِزُوْنَ الْمُطَّوِّعِيْنَ …: ’’ الْمُطَّوِّعِيْنَ ‘‘} باب تفعل سے اسم فاعل ہے جو اصل میں {’’مُتَطَوِّعِيْنَ‘‘} تھا۔ جو لوگ فرض زکوٰۃ کے علاوہ مزید مال خوشی سے خرچ کرتے ہیں۔ جہد کا معنی محنت و مشقت ہے، یعنی وہ لوگ جو مال دار نہیں مگر محنت مشقت کرکے کمایا ہوا تھوڑا مال بھی خرچ کرتے ہیں۔ غزوۂ تبوک کے موقع پر جب نبی صلی اللہ علیہ وسلم نے چندے کی اپیل کی تو بڑے بڑے مال دار منافقین ہاتھ سکیڑ کر بیٹھ رہے، لیکن مخلص اہل ایمان چندہ لانے لگے تو یہ ان پر باتیں چھانٹنے لگے، جب کوئی شخص زیادہ چندہ لاتا تو یہ اسے ریا کار کہتے اور جب کوئی تھوڑا مال یا غلہ لا کر پیش کرتا تو یہ کہتے کہ بھلا اللہ کو اس کی کیا ضرورت ہے؟ دونوں صورتوں میں مذاق اڑاتے اور ٹھٹھا کرتے۔ یہ وہ موقع تھا جب عمر رضی اللہ عنہ اپنا نصف مال لے آئے اس خیال سے کہ اگر بڑھ سکا تو آج ابوبکر رضی اللہ عنہ سے بڑھ جاؤں گا، جب ابوبکر رضی اللہ عنہ آئے تو گھر کا سارا مال لے آئے تھے۔ [ ترمذی، المناقب، باب رجاؤہ أن یکون أبوبکر… : ۳۶۷۵، وقال حسن صحیح وحسنہ الألبانی ] ¤ عبد الرحمن بن سمرہ رضی اللہ عنہ کہتے ہیں کہ غزوۂ تبوک کی تیاری کے وقت عثمان رضی اللہ عنہ نے ایک ہزار دینار لا کر رسول اللہ صلی اللہ علیہ وسلم کی جھولی میں رکھ دیے۔ عبد الرحمن رضی اللہ عنہ فرماتے ہیں، میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان دیناروں کو الٹ پلٹ کرتے ہوئے دو مرتبہ فرمایا : ’’آج کے (اس عمل کے) بعد عثمان جو بھی عمل کریں وہ انھیں نقصان نہیں پہنچائے گا۔‘‘ [ ترمذی، المناقب، باب فی عد عثمان تسمیتہ شہیدا… : ۳۷۰۱ ] ابو مسعود رضی اللہ عنہ فرماتے ہیں کہ جب صدقے کی آیت اتری تو ہم اپنی پیٹھوں پر بوجھ اٹھاتے، یعنی اس طرح اجرت حاصل کرتے تو ایک آدمی آیا اس نے بہت زیادہ چیز کا صدقہ کیا تو (منافق) کہنے لگے، یہ دکھاوا چاہتا ہے اور ایک آدمی آیا اور اس نے ایک صاع (دو کلو غلہ) صدقہ کیا تو انھوں نے کہا، اللہ تعالیٰ اس کے صدقے سے بے نیاز ہے (اسے اس کی کیا ضرورت ہے؟) تو یہ آیت اتری۔ [ بخاری، الزکوٰۃ، باب : اتقوا النار ولو بشق تمرۃ … : ۱۴۱۵ ] ابومسعود انصاری رضی اللہ عنہ کی روایت ہے کہ ابوعقیل (مزدوری کرکے) آدھا صاع (ایک کلو غلہ) لائے اور ایک اور صاحب زیادہ مال لائے، تو منافق کہنے لگے، اس (نصف صاع) کی اللہ کو کیا ضرورت تھی اور اس دوسرے نے تو محض دکھاوے کے لیے دیا ہے۔ اس پر یہ آیت اتری : «اَلَّذِيْنَ يَلْمِزُوْنَ الْمُطَّوِّعِيْنَ» [ بخاری، التفسیر، باب قولہ : { الذین یلمزون المطوعین… } : ۴۶۶۹ ] ¤ ➋ { سَخِرَ اللّٰهُ مِنْهُمْ:} اس کی تفسیر کے لیے دیکھیے سورۂ بقرہ کی آیت (۱۵)۔"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت80) ➊ {اِسْتَغْفِرْ لَهُمْ اَوْ لَا تَسْتَغْفِرْ لَهُمْ …:} یعنی آپ کا ان کے لیے استغفار کرنا یا نہ کرنا برابر ہے، یہاں یہ بات امر کے صیغے کے ساتھ آئی ہے، مگر مراد خبر دینا ہی ہے، جیسا کہ دوسری جگہ صاف خبر کے الفاظ میں فرمایا : «سَوَآءٌ عَلَيْهِمْ اَسْتَغْفَرْتَ لَهُمْ اَمْ لَمْ تَسْتَغْفِرْ لَهُمْ لَنْ يَّغْفِرَ اللّٰهُ لَههُمْ » [ المنافقون : ۶ ] ’’ان پر برابر ہے کہ تو ان کے لیے بخشش کی دعا کرے یا ان کے لیے بخشش کی دعا نہ کرے، اللہ انھیں ہر گز معاف نہیں کرے گا۔‘‘اس آیت کی تفسیر کا کچھ حصہ آیت (۸۴) کی تفسیر میں آ رہا ہے۔ ¤ ➋ { ذٰلِكَ بِاَنَّهُمْ كَفَرُوْا بِاللّٰهِ وَ رَسُوْلِهٖ:} یعنی آپ ان کے حق میں کتنا ہی استغفار کریں اللہ تعالیٰ انھیں ہر گز نہیں بخشے گا، کیونکہ اللہ تعالیٰ اور اس کے رسول کے ساتھ کفر کی وجہ سے وہ بخشے جانے کے لائق ہی نہیں ہیں۔ اس آیت کی تشریح میں شاہ عبد القادر رحمہ اللہ لکھتے ہیں کہ یہاں سے فرق نکلتا ہے بے اعتقاد اور گناہ گار کا۔ گناہ ایسا کون سا ہے جو کہ پیغمبر صلی اللہ علیہ وسلم کے بخشانے سے نہ بخشا جائے اور بے اعتقاد کو پیغمبر کا ستر دفعہ استغفار فائدہ نہ کرے۔ اب بے اعتقاد لوگ پیغمبر صلی اللہ علیہ وسلم کی شفاعت پر کس دلیل سے بھروسا کر سکتے ہیں؟ آدمی سے برائی ہو جائے یا عمل میں کوتاہی ہو اور وہ شرمندہ ہے تو وہ گناہ گار ہے اور جو بد کام کو عیب نہ جانے اور اللہ تعالیٰ کے عائد کر دہ فرض کے کرنے اور نہ کرنے کو برابر سمجھے اور کرنے والوں پر طعن کرے، وہ بے اعتقاد ہے۔ ایسے شخص کو پیغمبر صلی اللہ علیہ وسلم کا استغفار بھی فائدہ نہیں پہنچا سکتا۔ (موضح)"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت81) ➊ {فَرِحَ الْمُخَلَّفُوْنَ … :} منافقین کے مختلف احوال اور ان کی سازشوں اور منصوبوں کے طویل ذکر کے بعد اب خصوصاً ان منافقین کا ذکر شروع ہوتا ہے جو جنگ تبوک میں نبی صلی اللہ علیہ وسلم کے ساتھ نہ گئے بلکہ جھوٹے عذر پیش کرکے اجازت لی اور مدینہ منورہ میں ٹھہرے رہے، ان کے لیے اللہ تعالیٰ نے{ ’’ الْمُخَلَّفُوْنَ‘‘} کا لفظ استعمال کیا ہے ’’وہ جو پیچھے چھوڑ دیے گئے‘‘ یعنی وہ خوش نہ ہوں کہ یہ ان کا کارنامہ ہے کہ وہ آپ صلی اللہ علیہ وسلم کے ساتھ نہیں گئے اور آرام کے ساتھ مدینہ کے اندر گھروں میں رہے، بلکہ حقیقت یہ ہے کہ انھیں اللہ کی طرف سے جانے کی توفیق ہی نہیں ملی اور وہ اس کی جناب سے دھکیلے ہوئے پیچھے چھوڑ دیے گئے۔ ان کی حیثیت اس ردی سامان کی ہے جو ساتھ نہیں لے جایا جاتا، بلکہ پھینک دیا جاتا ہے، یا پیچھے چھوڑ دیا جاتا ہے۔ ¤ ➋ { وَ كَرِهُوْۤا اَنْ يُّجَاهِدُوْا بِاَمْوَالِهِمْ وَ اَنْفُسِهِمْ …:} کیونکہ اللہ کی خاطر خوشی سے مال و جان کی قربانی ایمان کے بغیر نہیں دی جا سکتی، جس سے یہ محروم ہیں۔ اس میں نکلنے والے مومنوں کی دلی کیفیت اور ان کی تعریف بھی ظاہر ہے کہ وہ کس خوشی سے نکلے۔ ¤ ➌ {وَ قَالُوْا لَا تَنْفِرُوْا فِي الْحَرِّ … :} یعنی صرف خود ہی نہیں دوسروں کو گرمی کی شدت اور لمبے سفر کی صعوبتوں سے ڈرا کر پیچھے رکھنے کی کوشش کرتے رہے، کیونکہ یہ سفر سخت گرمی کے موسم میں پیش آیا تھا۔ زمخشری رحمہ اللہ نے فرمایا کہ اللہ تعالیٰ نے اسے ان کی جہالت کا نتیجہ قرار دیا کہ وہ جانتے ہی نہیں کہ آدمی تھوڑی سی تکلیف برداشت کرنے سے اگر ہمیشہ کی ناقابل برداشت تکلیف سے بچ رہا ہو تو کوئی جاہل بلکہ اجہل ہی ہو گا جو وہ تھوڑی سی تکلیف برداشت نہ کرے اور ہمیشہ کی سخت ترین تکلیف برداشت کرنا پسند کرلے۔ اسی طرح انھیں معلوم ہی نہیں کہ اصل گرمی کیا ہوتی ہے، ورنہ اگر وہ جہنم کی گرمی سے آگاہ ہوتے اور ان کا اس پر ایمان ہوتا تو وہ دنیا کی شدید سے شدید گرمی کی بھی پروا نہ کرتے۔ {’’لَوْ كَانُوْا يَفْقَهُوْنَ ‘‘} کا یہی مطلب ہے، کیونکہ جہنم کا ایک غوطہ دنیا کی تمام لذتیں بھلا دے گا۔ [ مسلم : ۲۸۰۷ ] اور ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تمھاری آگ جہنم کی آگ کے ستر حصوں میں سے ایک حصہ ہے۔‘‘ آپ سے کہا گیا : ’’یا رسول اللہ! یقینا وہی کافی تھی۔‘‘ فرمایا : ’’وہ ان (آگوں) سے انہتر (۶۹) حصے زیادہ کر دی گئی ہے اور وہ سب اس کی گرمی کی طرح ہیں۔‘‘ [ بخاری، بدء الخلق، باب صفۃ النار و أنہا مخلوقۃ : ۳۲۶۵۔ مسلم : ۲۸۴۳ ]"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت82) {فَلْيَضْحَكُوْا قَلِيْلًا وَّ لْيَبْكُوْا كَثِيْرًا:} کیونکہ دنیا آخرت کے مقابلے میںں بہت ہی کم ہے، فانی اور باقی کا کیا مقابلہ؟ اس لیے ان کا ہنسنا بہت ہی کم عرصے کے لیے اور رونا بے حد وحساب مدت کے لیے ہے جس کی انتہا ہی نہیں۔ یہ بظاہر حکم ہے مگر منافقین حکم ماننے والے کب تھے، اس لیے یہ امر کے الفاظ میں خبر دی جا رہی ہے، یعنی یہ لوگ بہت کم ہنسیں گے اور بہت زیادہ روئیں گے۔ {’’ جَزَآءًۢ بِمَا كَانُوْا يَكْسِبُوْنَ ‘‘} سے اس امر کے بمعنی خبر ہونے کی تائید ہوتی ہے۔ اس میں حکمت یہ معلوم ہوتی ہے کہ خبر میں تو صدق و کذب کا بھی احتمال ہوتا ہے، مگر انشاء (امر و نہی) میں اس کا احتمال ہی نہیں ہوتا، وہ حتمی ہوتی ہے (اگرچہ اللہ تعالیٰ کی خبر میں بھی کذب کا احتمال نہیں)۔ (المنار) اسی آیت کی ہم معنی وہ حدیث ہے کہ اگر تم وہ کچھ جان لو جو میں جانتا ہوں تو یقینا تم بہت کم ہنسو اور بہت زیادہ روؤ۔ [ بخاری، الکسوف، باب الصدقۃ فی الکسوف : ۱۰۴۴ ]"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت83) ➊ {فَاِنْ رَّجَعَكَ اللّٰهُ اِلٰى طَآىِٕفَةٍ مِّنْهُمْ:} ’’اگر اللہ تجھے ان کے کسی گروہ کی طرف واپس لے آئے۔‘‘ {’’رَجَعَ‘‘} لازم اور متعدی دونوں طرح آتا ہے، یعنی لوٹنا اور لوٹانا، یہاں متعدی کے معنی میں ہے۔ ¤ یعنی جو جنگ تبوک کے لیے نہیں نکلے تھے بلکہ گھروں میں بیٹھے رہے، اللہ تعالیٰ نے آپ کو آئندہ انھیں اپنے ساتھ لے جانے اور اپنے ہمراہ لڑانے سے منع فرما دیا، اس لیے کہ ان کا اعتبار اٹھ گیا۔ جب وہ مشکل وقت میں ساتھ نہیں گئے تو آسان وقت میں بھی کیوں جائیں، جیسا کہ سورۂ فتح میں حدیبیہ کے لیے نہ جانے والے اعراب کو خیبر کی فتح میں شرکت سے منع فرما دیا۔ دیکھیے سورۂ فتح (۱۱ تا ۱۵) مگر وہاں ہمیشہ کے لیے منع نہیں فرمایا، جبکہ تبوک سے پیچھے رہنے والے منافقین کو ہمیشہ کے لیے ساتھ لے جانے سے منع فرما دیا۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں کہ یہ جو فرمایا کہ ’’اگر پھر لے جائے تجھے اللہ کسی فرقہ کی طرف‘‘ وہ اس واسطے کہ یہ آیت سفر میں نازل ہوئی۔ یہ لوگ مدینہ میں منافق تھے اور فرقے اس واسطے فرمایا کہ بعض منافق پیچھے مر گئے اور سب بیٹھنے والے منافق نہ تھے، بعض مسلمان بھی تھے، ان کی تقصیر معاف ہوئی۔ (موضح) ¤ ➋ {فَاقْعُدُوْا مَعَ الْخٰلِفِيْنَ:} یعنی پہلی مرتبہ کی طرح اب بھی ان لوگوں کے ساتھ ہی بیٹھے رہو جو بے عذر گھروں میں رہ گئے یا معذوروں کے ساتھ بیٹھے رہے، جیسے عورتیں، بچے، بوڑھے، بیمار اور اپاہج وغیرہ۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت84) {وَ لَا تُصَلِّ عَلٰۤى اَحَدٍ مِّنْهُمْ مَّاتَ اَبَدًا … :} ابن عمر رضی اللہ عنہما سے روایت ہے کہ جب عبد اللہ بن ابی فوت ہوا تو اس کا بیٹا نبی صلی اللہ علیہ وسلم کے پاس آیا کہ مجھے اپنی قمیص دیجیے کہ میں اسے اس میں کفن دوں اور آپ اس پر جنازہ پڑھیں اور اس کے لیے بخشش کی دعا فرمائیں تو نبی صلی اللہ علیہ وسلم نے اسے اپنی قمیص دی اور فرمایا : ’’مجھے اطلاع دینا، تاکہ میں اس کا جنازہ پڑھوں۔‘‘ اس نے اطلاع دی اور جب آپ نے اس پر جنازے کا ارادہ کیا، تو عمر رضی اللہ عنہ نے آپ کو کھینچ لیا اور کہا، کیا اللہ تعالیٰ نے آپ کو منافقین کا جنازہ پڑھنے سے منع نہیں فرمایا؟ آپ نے فرمایا : ’’مجھے دو اختیار ہیں : «اِسْتَغْفِرْ لَهُمْ اَوْ لَا تَسْتَغْفِرْ لَهُمْ » [ التوبۃ : ۸۰ ] (ان کے لیے بخشش مانگ یا ان کے لیے بخشش نہ مانگ)۔‘‘ سو آپ نے اس کا جنازہ پڑھا تو یہ آیت اتری : «وَ لَا تُصَلِّ عَلٰۤى اَحَدٍ مِّنْهُمْ مَّاتَ اَبَدًا » [ بخاری، الجنائز، باب ما یکرہ من الصلوۃ علی المنافقین… : ۱۳۶۶۔ مسلم : ۲۴۰۰ ] اب جو شخص کلمہ پڑھ کر صریح شرک کرتا ہے اور غیر اللہ سے وہ مدد مانگتا ہے جو اللہ کے سوا کسی کے اختیار ہی میں نہیں، یا کلمہ کے بعد مسلمان ہونے کی پہلی شناخت نماز ہی اس میں نہیں پائی جاتی، یا وہ صاف اللہ تعالیٰ کی حدود کو وحشیانہ سزائیں کہتا ہے، یا اللہ تعالیٰ کے احکام کا مذاق اڑاتا ہے، یا اس زمانے میں انھیں ناقابل عمل کہتا ہے، اس کا جنازہ پڑھنا کیسے درست ہو سکتا ہے؟ رسول اللہ صلی اللہ علیہ وسلم میت کو جنازے کے بعد دفن کرکے قبر پر کھڑے ہو کر دعا مانگتے تھے، مختلف دوسرے اوقات میں وہاں جا کر ان کے لیے دعا کرتے تھے، منافقین کے متعلق اللہ تعالیٰ نے آپ کو اس سے بھی منع فرما دیا۔ کیونکہ اس میں منافق، کافر اور مشرک کی تکریم اور عزت افزائی ہے جو اللہ تعالیٰ کو کسی صورت منظور نہیں۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت85) {وَ لَا تُعْجِبْكَ اَمْوَالُهُمْ وَ اَوْلَادُهُمْ … :} اس سے پہلے آیت (۵۵) میں بھی چند الفاظ کے فرق کے ساتھ یہ آیت گزری ہے، یہاں دوبارہ لانے کا مقصد یہ ہے کہ نفاق انھی چیزوں کی محبت اور حرص سے پیدا ہوتا ہے، جیسا کہ سورۂ منافقون میں ان کے اعمال بد کے تذکرے کے بعد آخر میں یہی تلقین فرمائی : «لَا تُلْهِكُمْ اَمْوَالُكُمْ وَ لَاۤ اَوْلَادُكُمْ عَنْ ذِكْرِ  اللّٰهِ» [المنافقون : ۹ ] ’’دیکھنا کہیں تمھارے اموال اور تمھاری اولاد تمھیں اللہ کی یاد سے غافل نہ کر دیں۔‘‘ یہاں بھی گزشتہ آیت کو دوبارہ لانے سے مقصود دنیا کی فراوانی پر رشک سے بچنے کی تاکید اور منافقین کے لیے اموال واولاد کی فراوانی کے ان کے لیے نقصان دہ ہونے کا بیان ہے۔ مزید اسی سورت کی آیت (۵۵) کے حواشی دیکھیے۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت87،86){ وَ اِذَاۤ اُنْزِلَتْ سُوْرَةٌ … : ’’ سُوْرَةٌ ‘‘} آیات کا ایک حصہ، ٹکڑا۔ {’’ الطَّوْلِ ‘‘} کا معنی {’’ اَلْفَضْلُ وَالْقُدْرَةُ وَالْغِنَي وَالسَّعَةُ ‘‘} ہے۔(قاموس) یعنی وسعت و طاقت اور مال و دولت۔ {’’ الْخَوَالِفِ ‘‘} یہ{ ’’خَالِفَةٌ‘‘} کی جمع ہے ’’پیچھے رہنے والی عورتیں۔‘‘{ ’’فَاعِلَةٌ‘‘} کی جمع {’’فَوَاعِلُ‘‘} آتی ہے، جیسے{ ’’قَاطِعَةٌ ‘‘ } کی جمع {’’قَوَاطِعُ‘‘} اور {’’ضَارِبَةٌ ‘‘ } کی جمع {’’ضَوَارِبُ‘‘} اور {’’قَافِلَةٌ‘‘} کی جمع { ’’قَوَافِلُ‘‘} یعنی جہاد کے حکم والی آیات کا کوئی حصہ اترنے پر وہ لوگ عذر کریں جن کے پاس کچھ نہیں اور جو ضروریات جہاد حاصل نہ ہو سکنے کی وجہ سے ساتھ نہیں جا سکتے تو بات سمجھ میں آتی ہے، مگر ان منافقین میں سے وسعت و طاقت والے بھی جہاد میں نہ جانے اور پیچھے رہنے کی اجازت مانگتے ہیں۔ اللہ تعالیٰ نے اس کے اسباب بیان فرمائے کہ بزدلی کی وجہ سے ان میں ایسی کمینگی پیدا ہو چکی ہے کہ انھیں عورتوں کے ساتھ پیچھے رہ جانے میں کوئی عار محسوس نہیں ہوتی، بلکہ وہ اس پر خوش ہیں اور ان کے اعمال بد کی وجہ سے ان کے دلوں پر مہر لگا دی گئی ہے جس کی وجہ سے وہ جہاد کی برکات کو اور بزدلی اور ترک جہاد کی نحوست اور نقصانات کو نہیں سمجھتے۔ نہ ان پر اللہ اور اس کے رسول کی بات کا اثر ہوتا ہے اور نہ کسی سمجھانے والے کی نصیحت کا۔"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت87،86){ وَ اِذَاۤ اُنْزِلَتْ سُوْرَةٌ … : ’’ سُوْرَةٌ ‘‘} آیات کا ایک حصہ، ٹکڑا۔ {’’ الطَّوْلِ ‘‘} کا معنی {’’ اَلْفَضْلُ وَالْقُدْرَةُ وَالْغِنَي وَالسَّعَةُ ‘‘} ہے۔(قاموس) یعنی وسعت و طاقت اور مال و دولت۔ {’’ الْخَوَالِفِ ‘‘} یہ{ ’’خَالِفَةٌ‘‘} کی جمع ہے ’’پیچھے رہنے والی عورتیں۔‘‘{ ’’فَاعِلَةٌ‘‘} کی جمع {’’فَوَاعِلُ‘‘} آتی ہے، جیسے{ ’’قَاطِعَةٌ ‘‘ } کی جمع {’’قَوَاطِعُ‘‘} اور {’’ضَارِبَةٌ ‘‘ } کی جمع {’’ضَوَارِبُ‘‘} اور {’’قَافِلَةٌ‘‘} کی جمع { ’’قَوَافِلُ‘‘} یعنی جہاد کے حکم والی آیات کا کوئی حصہ اترنے پر وہ لوگ عذر کریں جن کے پاس کچھ نہیں اور جو ضروریات جہاد حاصل نہ ہو سکنے کی وجہ سے ساتھ نہیں جا سکتے تو بات سمجھ میں آتی ہے، مگر ان منافقین میں سے وسعت و طاقت والے بھی جہاد میں نہ جانے اور پیچھے رہنے کی اجازت مانگتے ہیں۔ اللہ تعالیٰ نے اس کے اسباب بیان فرمائے کہ بزدلی کی وجہ سے ان میں ایسی کمینگی پیدا ہو چکی ہے کہ انھیں عورتوں کے ساتھ پیچھے رہ جانے میں کوئی عار محسوس نہیں ہوتی، بلکہ وہ اس پر خوش ہیں اور ان کے اعمال بد کی وجہ سے ان کے دلوں پر مہر لگا دی گئی ہے جس کی وجہ سے وہ جہاد کی برکات کو اور بزدلی اور ترک جہاد کی نحوست اور نقصانات کو نہیں سمجھتے۔ نہ ان پر اللہ اور اس کے رسول کی بات کا اثر ہوتا ہے اور نہ کسی سمجھانے والے کی نصیحت کا۔"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت88) {لٰكِنِ الرَّسُوْلُ وَ الَّذِيْنَ اٰمَنُوْا مَعَهٗ … :} لیکن رسول اللہ صلی اللہ علیہ وسلم اور اہل ایمان کا حال منافقین جیسا نہیں، ان میں نہ ان کی طرح بزدلی ہے، نہ جہاد سے گریز، نہ مال و جان کی قربانی میں بخل، نہ اللہ اور اس کے رسول سے کفر، نہ نافرمانی، بلکہ وہ اللہ کا کلمہ بلند کرنے کے لیے اپنے اموال اور جانوں کے ساتھ جہاد یعنی اپنی آخری کوشش کرتے ہیں اور ہر حال میں اطاعت کرتے ہیں۔ انھی کے لیے تمام بھلائیاں، یعنی دنیا کی فتوحات و غنائم اور آخرت کے سب سے بلند درجے ہیں۔ دیکھیے سورۂ حجرات (۱۵) اور صف ( ۱۰ تا ۱۲) انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جنت میں پہنچ جانے والا کوئی ایک شخص بھی ایسا نہیں ہو گا جو پسند کرے کہ دنیا میں واپس آئے، خواہ دنیا کی ہر چیز اسے دے دی جائے، سوائے شہید کے، وہ تمنا کرے گا کہ دنیا کی طرف واپس جائے، پھر دس مرتبہ قتل کیا جائے، اس عزت و کرامت کی وجہ سے جو وہ دیکھے گا۔‘‘ [ بخاری، الجہاد والسیر، باب تمنی المجاہد أن یرجع إلی الدنیا : ۲۸۱۷ ]"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت89){ اَعَدَّ اللّٰهُ لَهُمْ جَنّٰتٍ … :} رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’بے شک جنت میں سو درجے ہیں جو اللہ نے مجاہدین فی سبیل اللہ کے لیے تیار کیے ہیں، ہر دو درجوں کے درمیان اتنا فاصلہ ہے جو زمین و آسمان کے درمیان ہے تو جب تم اللہ تعالیٰ سے مانگو تو اس سے فردوس کا سوال کرو، کیونکہ وہ جنت کا سب سے بہتر اور سب سے بلند حصہ ہے، جس کے اوپر رحمان کا عرش ہے اور اسی سے جنت کی نہریں نکلتی ہیں۔‘‘ [ بخاری، الجہاد والسیر، باب درجات المجاہدین فی سبیل اللہ : ۲۷۹۰، عن أبی ھریرۃ رضی اللہ عنہ ]"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت90){وَ جَآءَ الْمُعَذِّرُوْنَ مِنَ الْاَعْرَابِ … :} اس سے پہلے مدینہ کے منافقین اور اہل ایمان کا ذکر تھا، اب مدینہ کے اردگرد بادیہ نشینوں کا حال ذکر ہوتا ہے، کیونکہ ان میں بھی دونوں قسم کے لوگ موجود تھے، جیسا کہ آگے آیت (۹۸، ۹۹) اور پھر (۱۰۱، ۱۰۲) میں ذکر آ رہا ہے۔ مفسرین نے اس کی تفسیر دو طرح سے کی ہے، کیونکہ عذر کرنے والے سچے بھی ہو سکتے ہیں اور جھوٹے بھی، اس لیے بعض نے تو {’’ الْمُعَذِّرُوْنَ‘‘} سے مراد وہ اعراب لیے ہیں جو صحیح مومن تھے مگر کسی حقیقی عذر کی وجہ سے نہیں جا سکے تھے، یہ لوگ تو اپنا عذر بیان کرنے کے لیے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو گئے اور جنھوں نے اللہ اور اس کے رسول سے جھوٹ بولا تھا اور دل سے مسلمان نہیں ہوئے تھے، وہ گھروں ہی میں بیٹھے رہے، انھوں نے آکر عذر پیش کرنے کی زحمت ہی نہیں کی، چنانچہ ان میں سے کفر کرنے والوں کو عذاب الیم کی وعید سنائی گئی، یعنی دنیا میں قید اور قتل اور آخرت میں جہنم کا ایندھن بنیں گے۔ ابن کثیر رحمہ اللہ نے اس تفسیر کو ترجیح دی ہے۔ ¤ بعض مفسرین نے {’’ الْمُعَذِّرُوْنَ ‘‘} سے مراد جھوٹے بہانے اور باطل عذر پیش کرنے والے لیے ہیں۔ زمخشری رحمہ اللہ نے اس رائے کی تائید کی ہے، وہ کہتے ہیں کہ {’’ الْمُعَذِّرُوْنَ ‘‘} باب تفعیل سے ہو تو {’’عَذَّرَ فِي الْأَمْرِ‘‘} کا معنی ہی یہ ہے کہ اس نے کام میں سستی کی، اس کی کوشش ہی نہیں کی اور ظاہر یہ کیا کہ اس کا عذر تھا، حالانکہ اس کا عذر کوئی نہ تھا اور اگر{’’ الْمُعَذِّرُوْنَ ‘‘} باب افتعال سے ہو اور اس کا اصل {’’مُعْتَذِرُوْنَ‘‘} ہو پھر بھی جھوٹے بہانے ہی مراد ہیں، جیسا کہ آگے صاف آ رہا ہے : «يَعْتَذِرُوْنَ اِلَيْكُمْ اِذَا رَجَعْتُمْ اِلَيْهِمْ» [ التوبۃ : ۹۴ ] ’’تمھارے سامنے عذر پیش کریں گے، جب تم ان کی طرف واپس آؤ گے۔‘‘ پہلی تفسیر کی تائید اس بات سے ہوتی ہے کہ ہر عذر والا جھوٹا نہیں تھا بلکہ اللہ تعالیٰ نے خود اگلی آیت میں کئی عذر والوں کو گناہ سے بری قرار دیا ہے اور اس آیت میں بھی دونوں قسموں میں سے {’’الَّذِيْنَ كَفَرُوْا ‘‘} ہی کو عذاب کی وعید سنائی ہے، اگرچہ ترجمے کا رجحان دوسری تفسیر کی طرف ہے، مگر امام ابن کثیر رحمہ اللہ کی بات میں وزن معلوم ہوتا ہے۔"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت91) ➊ {لَيْسَ عَلَى الضُّعَفَآءِ … :} اس آیت میں ان لوگوں کا ذکر ہے جو واقعی معذور تھے اور ان کا عذر واضح تھا۔ ان میں سب سے پہلے {’’ الضُّعَفَآءِ ‘‘} ہیں، ان سے مراد لنگڑے، لولے، اندھے، بوڑھے، عورتیں اور بچے ہیں۔ دوسرے {’’الْمَرْضٰى‘‘} (مریض کی جمع) جو بیماری کی وجہ سے نہیں جا سکتے، دوسری جگہ فرمایا : «لَيْسَ عَلَى الْاَعْمٰى حَرَجٌ وَّ لَا عَلَى الْاَعْرَجِ حَرَجٌ وَّ لَا عَلَى الْمَرِيْضِ حَرَجٌ » [ الفتح : ۱۷ ] ’’نہیں ہے اندھے پر کوئی تنگی اور نہ لنگڑے پر کوئی تنگی اور نہ مریض پر کوئی تنگی۔‘‘ اور تیسرے وہ تندرست طاقت رکھنے والے جو مالی استطاعت نہیں رکھتے کہ جہاد کے سفر اور اس کے سازو سامان مثلاً سواری اور ہتھیار وغیرہ کی تیاری کر سکیں۔ چنانچہ فرمایا : «لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا وُسْعَهَا» [ البقرۃ : ۲۸۶ ]’’اللہ کسی کو تکلیف نہیں دیتا مگر اس کی گنجائش کے مطابق۔‘‘ ¤ ➋ { اِذَا نَصَحُوْا لِلّٰهِ وَ رَسُوْلِهٖ:} یعنی وہ کام نہ کرتے ہوں جس سے اللہ کے دین، رسول کریم صلی اللہ علیہ وسلم یا مومنوں کو کوئی نقصان اور ان کے دشمنوں کو فائدہ پہنچ سکتا ہو۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلدِّيْنُ النَّصِيْحَةُ] ’’دین خیر خواہی (خلوص) ہی کا نام ہے۔‘‘ ہم نے کہا : ’’کس کے لیے؟‘‘ فرمایا : ’’اللہ کے لیے، اس کی کتاب کے لیے، اس کے رسول کے لیے، مسلمانوں کے حکام کے لیے اور ان کے تمام لوگوں کے لیے۔‘‘ [ مسلم، الإیمان، باب بیان أن الدین النصیحۃ : ۵۵، عن تمیم رضی اللہ عنہ ] عام لوگوں کی خیر خواہی میں یہ چیز بھی شامل ہے کہ جب مجاہدین جہاد پر گئے ہوئے ہوں تو یہ لوگ شہر میں رہیں، ان کے گھروں کی، کاروبار کی اور بال بچوں کی خبر گیری رکھیں، ان کی عزت و آبرو کی ہر طرح سے حفاظت کریں، مجاہدین کی ضروریات بھیجتے رہیں، جھوٹی خبریں یا افواہیں نہ پھیلائیں، کسی قسم کا فساد برپا نہ کریں اور مسلمانوں کے حوصلے پست کرنے والوں کا منہ بند کریں۔ ¤ ➌ { مَا عَلَى الْمُحْسِنِيْنَ مِنْ سَبِيْلٍ:} یعنی یہ لوگ معذور ہیں، اگر جہاد میں شرکت نہ کریں تو ان پر کچھ گناہ نہیں۔ انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم تبوک سے واپس آئے، مدینہ کے قریب پہنچے تو فرمایا : ’’بے شک مدینہ میں کئی لوگ ہیں، تم کسی راستے پر نہیں چلے اور نہ تم نے کوئی وادی طے کی ہے، مگر وہ تمھارے ساتھ رہے ہیں۔‘‘ لوگوں نے پوچھا : ’’یارسول اللہ! اور وہ مدینہ ہی میں تھے؟‘‘ فرمایا : ’’(ہاں) وہ مدینہ ہی میں تھے، انھیں عذر نے روک رکھا تھا۔‘‘ [ بخاری، المغازی، باب : ۴۴۲۳ ]"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت92) ➊ {وَلَا عَلَى الَّذِيْنَ اِذَا مَاۤ اَتَوْكَ … :} یہ مخلص مسلمانوں کے ایک اور گروہ کا ذکر ہے جن کے پاس اپنی سواریاں نہیں تھیں اور وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس سواریاں لینے کے لیے آئے تو آپ صلی اللہ علیہ وسلم نے فرمایا، میرے پاس تمھیں سواری دینے کے لیے کچھ نہیں ہے، اس پر انھیں اتنا صدمہ ہوا کہ وہ رونے لگے اور ایسے روئے گویا آنکھیں پانی کے چشمے بن گئیں، جن سے آنسوؤں کی نالیاں رواں ہوں کہ ہمارے پاس خرچ کرنے کے لیے کچھ نہیں کہ ہم جہاد میں شریک ہو سکیں۔ اللہ تعالیٰ نے انھیں بھی گناہ سے بری قرار دیا کہ ان لوگوں پر اعتراض کا کوئی راستہ اور کوئی گنجائش نہیں، کیونکہ یہ محسنین ہیں۔ ¤ ➋ اس آیت پر ان لوگوں کو خلوص کے ساتھ غور کرنا چاہیے جو کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم دنیا و آخرت کے خزانوں کے مالک اور مختار کل ہیں۔ یہ حضرات آپ کے اس فرمان کا ترجمہ کیا کریں گے : «لَاۤ اَجِدُ مَاۤ اَحْمِلُكُمْ عَلَيْهِ» ’’میں وہ چیز نہیں پاتا جس پر تمھیں سوار کروں۔‘‘ ان بھائیوں کو اللہ کا خوف کرتے ہوئے رسول اللہ صلی اللہ علیہ وسلم کو مالک الملک اور مختار کل کہہ کر اللہ کا شریک بنانے سے توبہ کرنی چاہیے، کیونکہ یہ گناہ اللہ کے ہاں کسی صورت قابل معافی نہیں ہے۔"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت93) ➊ {اِنَّمَا السَّبِيْلُ عَلَى الَّذِيْنَ يَسْتَاْذِنُوْنَكَ …:} اللہ تعالیٰ اکثر مقامات پر ہر چیز کے دونوں پہلو بیان کرتا ہے، فرمایا ان پر تو کچھ اعتراض نہیں جن کا ذکر اوپر گزرا، صرف ان لوگوں پر گناہ کا سارا بوجھ ہے جن کے پاس سواری بھی ہے، زاد راہ بھی اور تندرستی بھی اور پھر اغنیاء ہو کر بھی آپ سے اجازت مانگتے ہیں اور اپنی بزدلی، نفاق اور کفر کی وجہ سے پیچھے رہنے والی عورتوں کے ساتھ رہ جانے میں انھیں کوئی عار نہیں، بلکہ اس پر انھیں فخر اور خوشی ہے کہ ہم گرمی میں سفر اور ہلاکت سے بچ گئے۔ ¤ ➋ { وَ طَبَعَ اللّٰهُ عَلٰى قُلُوْبِهِمْ …:} ان کے نفاق کے نتیجے میں اللہ تعالیٰ نے ان کے دلوں پر مہر لگا کر انھیں ایسا بند کر دیا ہے کہ وہ جانتے ہی نہیں کہ اللہ اور اس کے رسول پر ایمان لانے میں اور جہاد فی سبیل اللہ میں کیا لذت ہے اور ان کی کیا فضیلت اور کیا ثواب ہے۔"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت 94) ➊ {يَعْتَذِرُوْنَ اِلَيْكُمْ …:} جیسا کہ پہلے گزرا کہ یہ سلسلۂ آیات تبوک سے واپسی پر نازل ہوا، اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو پہلے ہی ان کے جھوٹے بہانوں کی اطلاع دے دی اور ساتھ ہی حکم دیا کہ ان سے کہہ دو کہ بہانے مت تراشو، ہم کسی صورت تمھارا اعتبار نہیں کریں گے، کیونکہ اللہ تعالیٰ نے ہمیں تمھاری کچھ خبریں بتا دی ہیں۔ اب دیکھا جائے گا کہ تمھارا آئندہ رویہ کیا رہتا ہے، آیا تم موجودہ روش سے باز آتے ہو یا اسی پر جمے رہتے ہو۔ ¤ ➋ {وَ سَيَرَى اللّٰهُ عَمَلَكُمْ وَ رَسُوْلُهٗ:} یہ عبارت یوں بھی ہو سکتی تھی کہ {’’وَ سَيَرَي اللّٰهُ وَ رَسُوْلُهُ عَمَلَكُمْ‘‘} کہ عنقریب اللہ اور اس کا رسول تمھارا عمل دیکھیں گے، مگر مفعول {’’ عَمَلَكُمْ ‘‘} کو {’’ رَسُوْلُهٗ ‘‘} سے پہلے لانے کا صاف مطلب یہ ہے کہ اصل دیکھنے والا اور نگرانی کرنے والا اللہ تعالیٰ ہی ہے، کیونکہ وہ ظاہر و باطن سے وا واقف ہے۔ اس کے بعد اللہ کے رسول بھی تمھارا عمل جو سامنے ہو گا دیکھیں گے، لیکن رسول اللہ صلی اللہ علیہ وسلم کو اگر ظاہری عمل سے مطمئن کر بھی لو اور تمھاری دلی کیفیت درست نہیں تو پھر تمھیں غائب و حاضر کو جاننے والے کے سامنے بھی حاضر ہونا ہے اور وہ تمھیں تمھاری اصل حقیقت سے آگاہ کرے گا۔ بعض شرک کے بیماروں نے اس آیت سے استدلال کیا ہے کہ اللہ تعالیٰ ہمارے حالات سے واقف ہے اور اس کا رسول بھی، کیونکہ اس آیت کے مطابق وہ دونوں سب کچھ دیکھ رہے ہیں۔ آیت کا مطلب تو اوپر بیان ہو چکا ہے مگر یہ حضرات اسی سورت کی آیت (۱۰۵) کا کیا کریں گے کہ جس میں ہے : ’’اور کہہ دے تم عمل کرو پس عنقریب اللہ تمھارا عمل دیکھے گا اور اس کا رسول اور ایمان والے بھی۔‘‘ تو کیا اللہ کے سوا رسول اور مومنین بھی سب کچھ دیکھ رہے ہیں اور ہر بات سے واقف ہیں؟ مومن ہونے کا خیال تو ان حضرات کا اپنے بارے میں بھی ہو گا، ذرا اپنی حیثیت اور علم کی رسائی پر غور فرما لیں تو بہت جلد بات سمجھ میں آجائے گی۔ سورۂ نمل کی آیت (۶۵) اور اعراف کی آیت (۱۸۸) پر بھی ایک نظر ڈال لیں اور اسی سورۂ توبہ کی آیت (۱۰۱) «{ لَا تَعْلَمُهُمْ نَحْنُ نَعْلَمُهُمْ}» پر بھی غور فرما لیں۔ ¤ ➌ ان آیات میں منافقین کو اخلاص کی طرف پلٹنے کی دعوت بھی ہے، یہ اللہ تعالیٰ کا خاص کرم ہے کہ منافقین کو بھی اسی طرح بار بار بلاتا ہے کہ ہاں عمل کرو ہم تمھاری نگرانی کر رہے ہیں، اگر پلٹ آؤ گے تو ہم معاف کر دیں گے اور فی الواقع کئی منافقین اخلاص کی دولت سے سرفراز بھی ہوئے۔ دیکھیے سورۂ توبہ (۶۶) اور نساء (۴۴، ۴۵)۔"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت 95) {سَيَحْلِفُوْنَ بِاللّٰهِ لَكُمْ اِذَا انْقَلَبْتُمْ اِلَيْهِمْ … :} اللہ تعالیٰ نے بتایا کہ تمھارے سامنے اللہ کی قسم کھانے سے ان کا مقصد یہ ہے کہ تم ان سے اعراض کرو، سو واقعی تم ان سے اعراض کرو۔ پہلے اعراض کا مطلب ہے کہ تم ان سے درگزر اور چشم پوشی کرو اور دوسرے اعراض کا مطلب یہ ہے کہ تم ان سے درگزر اور چشم پوشی کے ساتھ قطع تعلق بھی کرو۔ پھر ان سے قطع تعلق کا سبب بیان فرمایا کہ یہ رجس ہیں، جس کا معنی ’’گندگی‘‘ ہے، یعنی عقائد و اعمال کے لحاظ سے وہ اتنے گندے ہیں کہ سمجھو سراسر گندگی ہیں، گندگی کی پوٹ ہیں۔ گندگی سے تعلق کا نتیجہ آلودگی ہی ہے، اس لیے ان سے بچ جاؤ، تاکہ کہیں ان سے متاثر نہ ہو جاؤ۔ ’’صحبت طالح ترا طالح کند‘‘ پھر ان کا انجام بیان فرمایا۔ چنانچہ اللہ تعالیٰ کے اس حکم کے مطابق رسول اللہ صلی اللہ علیہ وسلم نے ان سے چشم پوشی اور درگزر ہی سے کام لیا۔ چنانچہ کعب بن مالک رضی اللہ عنہ (ان تین مخلص مسلمانوں میں سے ایک جو بلاعذر پیچھے رہ گئے تھے) فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سفر سے واپس آتے تو مسجد سے ابتدا کرتے، چنانچہ آپ لوگوں کے لیے بیٹھ گئے تو پیچھے رہ جانے والے آئے اور عذر پیش کرنے لگے اور آپ کے سامنے قسمیں کھانے لگے، یہ اسی (۸۰) سے کچھ زیادہ لوگ تھے، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کے ظاہر کو قبول فرمایا، ان سے بیعت لی، ان کے لیے استغفار کیا اور ان کے پوشیدہ معاملات اللہ کے سپرد کر دیے۔ [ بخاری، المغازی، باب حدیث کعب بن مالک رضی اللہ عنہ: …۴۴۱۸ ]"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت 96) {يَحْلِفُوْنَ لَكُمْ لِتَرْضَوْا عَنْهُمْ … :} یعنی ان کے قسمیں کھانے اور حیلے بہانے کرنے کا ایک مقصد تو یہ ہے کہ تم ان سے درگزر کرو اور چشم پوشی سے کام لو اور پھر یہ چاہتے ہیں کہ ان سے راضی بھی ہو جاؤ، اگر تم ان کی باتوں سے متاثر ہو کر راضی ہو بھی جاؤ تو اللہ تعالیٰ ان کے فسق کی وجہ سے ان سے کبھی راضی نہیں ہو گا۔ {’’ فَاِنَّ اللّٰهَ لَا يَرْضٰي عَنْهُمْ ‘‘} کے بجائے «{ لَا يَرْضٰى عَنِ الْقَوْمِ الْفٰسِقِيْنَ }» کہنے میں اللہ تعالیٰ کی ناراضی کا سبب بیان ہوا ہے۔ اس میں اشارہ ہے کہ مسلمانوں کے لیے بھی ان کے فسق کی وجہ سے کسی صورت ان سے راضی ہونا جائز نہیں۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’جس شخص کے حالات سے معلوم ہوتا ہو کہ وہ منافق ہے، اس کی طرف سے تغافل تو جائز ہے مگر اس سے دوستی اور محبت روا نہیں۔‘‘ (موضح)"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت 97) ➊ {اَلْاَعْرَابُ اَشَدُّ كُفْرًا وَّ نِفَاقًا … : ’’ اَلْاَعْرَابُ ‘‘} عرب کے صحرا اور بادیہ میں رہنے والوں کے لیے اسم جنس ہے، واحد کے لیے {’’اَعْرَابِي‘‘} اور مؤنث کے لیے{ ’’اَعْرَابِيَّةٌ‘‘} استعمال ہوتا ہے، جمع {’’اَعَارِيْبُ‘‘} ہے {’’ اَلْعَرَبُ ‘‘} اس نسل کے لیے اسم جنس ہے جو عربی زبان بولتی ہے، خواہ شہری ہو یا بادیہ نشیں، اس کا واحد {’’ عَرَبِيٌّ‘‘} آتا ہے۔ یہاں اعراب سے مراد ان کی جنس کے بعض افراد ہیں ہر شخص نہیں، کیونکہ ان میں سے بعض مخلص اہل ایمان کا ذکر آئندہ آیات میں آ رہا ہے۔ ¤ ➋ { ’’ اَلْاَعْرَابُ ‘‘} سے مراد وہ لوگ ہیں جو مدینہ منورہ سے دور دیہاتی اور صحرائی علاقوں میں رہتے تھے، ان میں سے اکثر اسلام کی دعوت کو سمجھ کر سچے دل سے مسلمان نہیں ہوئے تھے، بلکہ محض اسلام کی بڑھتی ہوئی طاقت سے مرعوب ہو کر مسلمان ہو گئے تھے۔ انھیں شہر (مدینہ منورہ) میں آنے، مسلمانوں سے میل جول رکھنے اور آپ صلی اللہ علیہ وسلم کی صحبت سے فیض یاب ہونے کا بہت کم موقع ملا تھا، اس لیے یہ نرے گنوار اور اجڈ قسم کے لوگ تھے، جن کے دلوں میں نہ نرمی پیدا ہوئی تھی اور نہ انھیں علم کی ہوا لگی تھی۔ اس لیے ان میں جو منافق تھے ان کا نفاق بھی اہل مدینہ کے نفاق سے سخت تھا۔ بعض اہل علم نے لکھا ہے کہ بدوی اور شہری لوگوں کی طبیعتوں میں وہی فرق پایا جاتا ہے جو ایک باغ کے میوے اور پہاڑی درخت کے میوے میں محسوس ہوتا ہے۔ اس لیے اللہ تعالیٰ نے رسولوں کو بستیوں سے مبعوث فرمایا : «{ وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ اِلَّا رِجَالًا نُّوْحِيْۤ اِلَيْهِمْ مِّنْ اَهْلِ الْقُرٰى }» [ یوسف : ۱۰۹ ] ’’اور ہم نے تجھ سے پہلے نہیں بھیجے مگر کچھ مرد، جن کی طرف ہم ان بستیوں والوں میں سے وحی کیا کرتے تھے۔‘‘ اور آخری رسول صلی اللہ علیہ وسلم کو تمام بستیوں کی ماں ام القریٰ مکہ میں پیدا فرمایا، تاکہ وہ شہری معاشرے کی شائستگی اور نرم دلی کے حامل ہوں۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’بدویوں کی سرشت میں بے حکمی، مفاد پرستی اور جہالت رچی بسی ہوئی ہے، اس لیے اللہ تعالیٰ نے اپنی کمال حکمت سے نہ ان پر زیادہ ذمہ داری ڈالی اور نہ ان کو درجات کی بلندی عطا ہوئی۔‘‘ (موضح) ¤ لوگوں کے ساتھ میل جول کی کمی کی وجہ سے طبیعت میں سختی پیدا ہو جانا فطری سی بات ہے۔ عبد اللہ بن عباس رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جو بادیہ میں سکونت رکھے وہ سخت دل ہو جاتا ہے، جو شکار کے پیچھے ہی لگ جائے وہ غافل ہو جاتا ہے اور جو سلطان کے پاس آئے وہ آزمائش میں ڈال دیا جاتا ہے۔‘‘ [ أحمد : 357/1، ح : ۳۳۶۱۔ أبوداوٗد : ۲۸۵۹۔ ترمذی : ۲۲۵۶۔ نسائی : ۴۳۱۴، وصححہ الألبانی ] ¤ بعض اعراب کی سخت دلی پر اس حدیث سے کافی روشنی پڑتی ہے جو ام المومنین عائشہ رضی اللہ عنھا نے بیان فرمائی کہ اعراب کے کچھ لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے (انھوں نے آپ کو حسن یا حسین رضی اللہ عنھما کو چومتے دیکھا) تو کہنے لگے : ’’کیا تم لوگ اپنے بچوں کو چومتے ہو؟‘‘ لوگوں نے کہا : ’’ہاں!‘‘ تو وہ کہنے لگے : ’’لیکن اللہ کی قسم! ہم تو نہیں چومتے!‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اور کیا میں اختیار رکھتا ہوں، اگر اللہ نے تم سے رحم کرنا نکال لیا ہے۔‘‘ [ مسلم، الفضائل، باب رحمتہ صلی اللہ علیہ وسلم الصبیان … : ۲۳۱۷۔ بخاری : ۵۹۹۸ ] مفسرین نے اس مقام پر اعراب کی سخت دلی کے کئی واقعات لکھے ہیں۔"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت 98) ➊ {وَ مِنَ الْاَعْرَابِ مَنْ يَّتَّخِذُ … : ’’ مَغْرَمًا ‘‘} سے مراد تاوان، چٹی اور جرمانہ ہے، قرض کو بھی {’’ مَغْرَمًا ‘‘} کہہ لیتے ہیں۔ قرض خواہ کو غریم کہتے ہیں، کیونکہ غرام کا معنی لازم ہونا، چمٹنا بھی ہے۔ تاوان بھی لازم ہو جاتا ہے اور قرض خواہ بھی جان نہیں چھوڑتا، سورۂ فرقان میں ہے : «{ اِنَّ عَذَابَهَا كَانَ غَرَامًا }» [ الفرقان : ۶۵ ] ’’بے شک اس کا عذاب ہمیشہ چمٹ جانے والا ہے۔‘‘ یعنی بعض اعراب ایسے ہیں کہ زکوٰۃ ہو یا جہاد، اس کے لیے جب بھی چندہ دیتے ہیں تو اللہ تعالیٰ کی رضا جوئی کی خاطر نہیں اور نہ دلی جذبہ کے ساتھ، بلکہ محض چٹی یا جرمانہ سمجھ کر بادل ناخواستہ ادا کرتے ہیں کہ اگر ادا نہ کریں گے تو مسلمان انھیں مشتبہ نگاہوں سے دیکھیں گے اور ان کے درمیان زندگی بسر کرنا دو بھر ہو جائے گا۔ ¤ ➋ {وَ يَتَرَبَّصُ بِكُمُ الدَّوَآىِٕرَ: ’’ الدَّوَآىِٕرَ ‘‘ ’’دَائِرَةٌ‘‘} کی جمع ہے، جو {’’دَارَ يَدُوْرُ دَوْرًا‘‘} (گھومنا) سے اسم فاعل ہے، چکر، گھومنے والا، یعنی وہ انتظار کر رہے ہیں کہ تم پر کب کوئی اچانک مصیبت اترتی ہے اور تم کب زمانے کے کسی چکر کے گھیرے میں آ کر زوال کا شکار ہوتے ہو، یا یہ کہ کب پیغمبر صلی اللہ علیہ وسلم فوت ہوتے ہیں اور مشرکین کو تم پر غلبہ ہوتا ہے۔ حقیقت یہ ہے کہ اللہ تعالیٰ ان کی زبانی بدگوئی اور دلی بدخواہی کو ہی نہیں، بلکہ ہر بات کو سننے والا اور ہر چیز کا علم رکھنے والا ہے۔ ¤ ➌ {عَلَيْهِمْ دَآىِٕرَةُ السَّوْءِ: ’’ السَّوْءِ ‘‘ سَاءَهُ يَسُوْءُهُ سَوْءً ‘‘} سین کے فتح کے ساتھ مصدر ہے، جب کسی کے ساتھ ایسا معاملہ کیا جائے جو اسے برا لگے اور سین کے ضمہ کے ساتھ اسم مصدر ہے، یعنی یہ برا چکر انھی پر آنے والا ہے، یا بددعا ہے کہ برا چکر انھی پر آئے، مگر اللہ تعالیٰ کو بددعا کی کیا ضرورت ہے، اس صورت میں مطلب یہ ہو گا کہ ان کی اس بدخواہی کا تقاضا ہے کہ ان پر یہ بددعا کی جائے کہ برا چکر انھی پر چلے۔"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت 99) {وَ مِنَ الْاَعْرَابِ مَنْ يُّؤْمِنُ بِاللّٰهِ … : ’’ قُرُبٰتٍ ‘‘} یہ {’’قُرْبَةٌ‘‘} کی جمع ہے، وہ عمل جسے انسان اپنے خالق کے قریب ہونے کا ذریعہ بنائے۔ {’’ صَلَوٰتِ ‘‘} یہ{ ’’ صَلاَةٌ ‘‘} کی جمع ہے جس کا معنی نماز کے علاوہ دعا بھی آتا ہے۔ یعنی سب اعراب ایک جیسے نہیں، ان میں کئی مخلص مسلمان بھی ہیں، جو خوش دلی سے صدقہ کرتے ہیں اور اسے اللہ کے ہاں قربتوں اور رسول کی دعاؤں کو حاصل کرنے کا ذریعہ سمجھتے ہیں۔ اللہ تعالیٰ نے ان کے حق میں شہادت دی کہ ان کے یہ اعمال یقینا ان کے لیے قرب کا ذریعہ ثابت ہوں گے اور اللہ تعالیٰ انھیں ضرور اپنی رحمت میں داخل فرمائے گا۔ عبد اللہ بن ابی اوفی رضی اللہ عنھما بیان کرتے ہیں کہ جب کوئی گروہ رسول اللہ صلی اللہ علیہ وسلم کے پاس صدقہ لے کر آتا تو آپ اس کے لیے دعا کرتے ہوئے کہتے : [ اَللّٰهُمَّ صَلِّ عَلٰی فُلَانٍ ] ’’اے اللہ! فلاں پر رحم فرما۔‘‘ عبد اللہ بن ابی اوفی رضی اللہ عنھما فرماتے ہیں کہ جب میرے والد زکوٰۃ لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے تو آپ نے انھیں دعا دیتے ہوئے فرمایا : [ اَللّٰهُمَّ صَلِّ عَلىٰ آلِ اَبِيْ اَوْفٰی ] ’’اے اللہ! ابو اوفی کی آل پر رحم فرما۔‘‘ [ بخاری، الزکاۃ، باب صلاۃ الإمام و دعاء ہ لصاحب الصدقۃ … : ۱۴۹۷ ]"
    },
    {
      "ayah": 100,
      "tafsir": "(آیت 100) ➊ {وَ السّٰبِقُوْنَ الْاَوَّلُوْنَ …:} مدینہ کے اندر رہنے والے منافقین کے ذکر کے بعد اس کے اردگرد رہنے والے بعض اعراب منافقین کا ذکر فرمایا، پھر بعض اعراب مومنوں کے اخلاص کا ذکر فرمایا اور انھیں اپنی رحمت کی خوش خبری سنائی، اب ان سے اعلیٰ مراتب والے خوش نصیبوں کا تذکرہ ہے۔ چنانچہ اس آیت میں نبی صلی اللہ علیہ وسلم کے زمانے کے تین گروہوں کی تعریف فرمائی ہے، پہلا گروہ مہاجرین میں سے سبقت کرنے والے پہلے لوگ۔ ان کی تعیین میں مفسرین سے مختلف اقوال منقول ہیں، وہ لوگ جنھوں نے مکہ میں اپنی جائدادیں، گھر بار اور کاروبار چھوڑ کر ہجرت کی، بعض نے دونوں قبلوں کی طرف نماز پڑھنے والے، بعض نے بدری صحابہ، بعض نے بیعت رضوان تک والے اور بعض نے فتح مکہ تک والے صحابہ مراد لیے ہیں۔ بہرحال ان سب کو دوسروں پر یقینا ایک قسم کی سبقت حاصل ہے۔ دوسرا گروہ انصار میں سے سابقون وہ ہیں جنھوں نے مدینہ سے آکر ۱۱ نبوی میں مکہ میں حج کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ پر پہلی بیعت عقبہ کی۔ یہ سات افراد تھے، دوسری بیعت عقبہ جو ۱۲ نبوی میں ہوئی اس میں ستر (۷۰) آدمی اور دو خواتین شامل تھیں، پھر وہ جو ان کے بعد رسول اللہ صلی اللہ علیہ وسلم کی مدینہ ہجرت سے پہلے مصعب بن عمیر رضی اللہ عنہ کے ہاتھ پر مسلمان ہوئے، پھر وہ سب اہل مدینہ جو آپ صلی اللہ علیہ وسلم کی مدینہ آمد کے بعد مسلمان ہوئے، ان سب کو درجہ بدرجہ سبقت حاصل ہے۔ تیسرا گروہ وہ لوگ ہیں جنھوں نے سابقین مہاجرین و انصار کے بعد ایمان لاکر ہجرت یا نصرت کا شرف حاصل کیا، جیسا کہ سورۂ انفال میں مہاجرین و انصار کا تذکرہ کرنے کے بعد فرمایا : «{ وَ الَّذِيْنَ اٰمَنُوْا مِنْۢ بَعْدُ وَ هَاجَرُوْا وَ جٰهَدُوْا مَعَكُمْ }» [ الأنفال : ۷۵ ] ’’اور جو لوگ بعد میں ایمان لائے اور ہجرت کی اور تمھارے ساتھ مل کر جہاد کیا۔‘‘ گویا صلح حدیبیہ کے بعد رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں ایمان لانے والے اور اس پر استقامت اختیار کرنے والے تمام صحابہ کرام رضی اللہ عنھم اس تیسرے گروہ میں شامل ہیں۔ ¤ ➋ آلوسی صاحبِ روح المعانی نے فرمایا : ’’بہت سے مفسرین اس طرف گئے ہیں کہ «{ وَ السّٰبِقُوْنَ الْاَوَّلُوْنَ مِنَ الْمُهٰجِرِيْنَ وَ الْاَنْصَارِ }» سے مراد رسول اللہ صلی اللہ ععلیہ وسلم کے تمام صحابہ کرام رضی اللہ عنھم ہیں، کیونکہ انھیں رسول اللہ صلی اللہ علیہ وسلم کی صحبت کے شرف کی بنا پر بعد والے تمام لوگوں پر سبقت حاصل ہے، جو پھر کسی کو نصیب نہ ہو سکی اور «{ وَ الَّذِيْنَ اتَّبَعُوْهُمْ بِاِحْسَانٍ }» (اور وہ لوگ جو نیکی کے ساتھ ان کے پیچھے آئے) سے قیامت تک آنے والے وہ تمام مسلمان مراد ہیں جو صحابہ کرام رضی اللہ عنھم کے نقش قدم پر چلتے ہوئے صرف قرآن اور سنت رسول پر اخلاص کے ساتھ عمل کرتے رہے۔‘‘ کیونکہ دوسرے کسی بھی فرقے کے لوگ اپنے امام کی تقلید کا دعویٰ تو کر سکتے ہیں، مگر تمام صحابہ کی اچھے طریقے اور نیکی سے پیروی کا دعویٰ نہیں کر سکتے، کیونکہ صحابہ کا عمل صرف قرآن و سنت پر تھا۔ اس وقت نہ فرقے تھے نہ وہ لوگ جن کے نام پر فرقے بنے۔ حقیقت یہ ہے کہ یہ تفسیر بھی بالکل درست ہے، البتہ اس آیت سے صرف اصطلاحی تابعین مراد لینا کہ وہ لوگ جنھوں نے ایمان کی حالت میں صحابہ کی زیارت کی ہو ہر گز درست نہیں، کیونکہ احسان کے ساتھ مہاجرین و انصار کے پیچھے چلنے والے صرف وہی نہیں بلکہ قیامت تک آنے والے سبھی مسلمان ہیں جن کے اخلاص اور قول و عمل میں احسان پایا جاتا ہے۔ ہاں اصطلاحی تابعین بدرجۂ اولی ان میں شامل ہیں۔ ¤ ➌ صحابہ کرام رضی اللہ عنھم میں سب سے افضل ابوبکر رضی اللہ عنہ ہیں جو اسلام میں بھی اول ہیں اور ہجرت میں بھی آپ صلی اللہ علیہ وسلم کے ساتھی ہیں، پھر بالترتیب دوسرے خلفاء رضی اللہ عنھم کے درجے ہیں، ان کے بعد باقی عشرہ مبشرہ جن میں طلحہ، زبیر، سعد بن ابی وقاص، سعید بن زید، عبد الرحمن بن عوف اور ابوعبیدہ بن جراح رضی اللہ عنھم شامل ہیں، پھر بدری اور عقبہ والے صحابہ کا درجہ ہے اور ان کے بعد جو بیعت رضوان میں شریک ہوئے، پھر جو فتح مکہ سے پہلے مسلمان ہوئے اور ہجرت و نصرت کی۔ صحابہ کی فضیلت کی اس ترتیب پر اہل السنۃ والجماعہ متفق ہیں۔ ¤ ➍ {رَضِيَ اللّٰهُ عَنْهُمْ وَ رَضُوْا عَنْهُ:} چونکہ اللہ تعالیٰ کی رضا کے حصول اور جنت میں داخلے کی خو ش خبری کی جو وجہ بیان ہوئی ہے، یعنی ہجرت و نصرت وہ دائمی ہے۔ کوئی شخص ان سے یہ اعزاز نہیں چھین سکتا۔ اس لیے اس پر ملنے والی بشارت بھی دائمی اور ہمیشہ کے لیے ہے، لہٰذا ان صحابہ میں سے (العیاذ باللہ) کسی کے مرتد ہونے کا تصور بھی نہیں ہو سکتا، کیونکہ اللہ تعالیٰ ایسے شخص کو اپنی رضا اور جنت کی خوش خبری دے ہی نہیں سکتا جس کے متعلق اسے علم ہو کہ اس نے مرتد ہو جانا ہے۔ اللہ تعالیٰ کو جس طرح گزشتہ اور موجودہ حالات کا مکمل علم ہے آئندہ آنے والی ہر بات کا بھی اسی طرح مکمل علم ہے۔ وہ کفر پر مرنے والوں کو جنت اور رضا کی بشارت کیسے دے سکتا ہے؟ پھر کتنے بدبخت اور لعنتی ہیں وہ لوگ جو ان حضرات کے خلاف عموماً اور ان میں سے افضل ترین اور رسول اللہ صلی اللہ علیہ وسلم کی محبوب ترین ہستیوں ابوبکر و عمر رضی اللہ عنھما اور آپ صلی اللہ علیہ وسلم کی ازواج مطہرات امہات المومنین رضی اللہ عنھن جو ہجرت و نصرت کا شرف بھی رکھتی ہیں، ان کے خلاف زبان درازی، سب و شتم، تہمت تراشی اور تبرا بازی کا مظاہرہ کرتے رہتے ہیں اور ان کو برے القاب سے یاد کرتے ہیں۔"
    },
    {
      "ayah": 101,
      "tafsir": "(آیت 101) ➊ {وَ مِمَّنْ حَوْلَكُمْ مِّنَ الْاَعْرَابِ مُنٰفِقُوْنَ … :} پہلے اعراب (بدوی) منافقین کا ذکر فرمایا، پھر اعراب میں سے مخلصین کا تذکرہ کیا۔ ان کے بعد سابقین مہاجرین و انصار اور ان کے پیچھے آنے والے صاحب احسان لوگوں کو خوش خبری دی اور ان کے لیے بلند مراتب کا بیان فرمایا (ان کا تذکرہ سورۂ جمعہ کی ابتدائی آیات میں بھی فرمایا ہے) اب ان ضمنی مباحث کے بعد پھر منافقین کے ایک گروہ کا ذکر فرمایا جو مدینہ اور اس کے ماحول میں رہتے ہوئے اپنے نفاق میں {’’ مَرَدُوْا ‘‘} اتنے مشاق اور ماہر ہو گئے تھے کہ رسول اللہ صلی اللہ علیہ وسلم اپنی تیز ترین فراست اور قوی ترین اندازے کے باوجود ان سب کو معین طور پر نہیں پہچان سکے، گو بعض کو ان کے لہجے اور دوسری علامات سے یا اللہ تعالیٰ کی نشان دہی سے پہچانتے ہوں۔ دیکھیے سورۂ محمد (۳۰) لہٰذا جن روایات میں ہے کہ آپ صلی اللہ علیہ وسلم نے بعض منافقین کے نام بھی حذیفہ رضی اللہ عنہ کو بتا دیے تھے وہ اس آیت کے منافی نہیں، کیونکہ یہاں یہ کہا گیا ہے کہ آپ ان تمام کو نہیں جانتے، گویا آپ بعض منافقین کو جانتے تھے اور بعض کو نہیں، جبکہ اللہ تعالیٰ سب کو جانتا ہے، اس سے رسول اللہ صلی اللہ علیہ وسلم کے عالم الغیب ہونے کے غلط دعویٰ کی حقیقت بھی واضح ہو رہی ہے۔ ¤ ➋ {سَنُعَذِّبُهُمْ مَّرَّتَيْنِ:} ایک تو دنیا میں غم و اندوہ اور فکر مندی کا عذاب، جس میں منافقین ہمیشہ مبتلا رہتے ہیں، فرمایا : «{ يَحْسَبُوْنَ كُلَّ صَيْحَةٍ عَلَيْهِمْ }» [ المنافقون : ۴ ]کہ وہ ہر لمحہ اپنے آپ کو خطرہ میں محسوس کرتے ہیں، ہر بلند آواز کو اپنے خلاف گمان کرتے ہیں اور پھر یہ رسوائی بھی کہ کفار اور مسلمانوں میں سے انھیں اپنا سمجھنے کے لیے کوئی تیار نہ تھا اور مرنے کے بعد قبر کے عذاب کو دوسرا عذاب فرمایا۔ یا {’’ مَرَّتَيْنِ ‘‘} سے مراد موت کے وقت فرشتوں کی مار ہے، جیسا کہ فرمایا : «{ يَضْرِبُوْنَ وُجُوْهَهُمْ وَ اَدْبَارَهُمْ }» [ محمد : ۲۷ ] ’’وہ ان کے چہروں اور ان کی پیٹھوں پر مارتے ہوں گے۔‘‘ پھر قبر کا عذاب، اس کے بعد {’’ عَذَابٍ عَظِيْمٍ ‘‘} سے مراد جہنم کا عذاب ہے۔ {’’ مَرَّتَيْنِ ‘‘} کا معنی ’’بار بار‘‘ بھی آتا ہے، جیسا کہ فرمایا : «{ ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ اِلَيْكَ الْبَصَرُ خَاسِئًا وَّ هُوَ حَسِيْررٌ }» [ الملک : ۴ ] ’’پھر بار بار نگاہ لوٹا، نظر ناکام ہو کر تیری طرف پلٹ آئے گی اور وہ تھکی ہوئی ہو گی۔‘‘ یعنی دنیا میں مال و اولاد، پریشانیوں اور ذلتوں کے ذریعے سے، پھر موت کے وقت، پھر قبر کے اندر بار بار عذاب دے کر آخر کار جہنم میں پہنچا دیں گے۔ یہ معنی بہت جامع ہے ۔ ¤ ➌ {ثُمَّ يُرَدُّوْنَ اِلٰى عَذَابٍ عَظِيْمٍ:} شاہ عبد القادر رحمہ اللہ لکھتے ہیں : {’’ مَرَّتَيْنِ ‘‘} یعنی دنیا میں تکلیف پر تکلیف پائیں گے، پھر آخرت میں پکڑے جائیں گے۔‘‘ (موضح)"
    },
    {
      "ayah": 102,
      "tafsir": "(آیت 102) {وَ اٰخَرُوْنَ اعْتَرَفُوْا بِذُنُوْبِهِمْ …: ”وَ السّٰبِقُوْنَ الْاَوَّلُوْنَ“ } والی آیت میں مسلمانوں کے بہترین لوگوں کا ذکر ہے اور «{ وَ مِمَّنْ حَوْلَكُمْ مِّنَ الْاَعْرَابِ مُنٰفِقُوْنَ }» میں مسلمان کہلانے والے بدترین لوگوں کا ذکر ہے، جو آگ کے درک اسفل (سب سے نچلے حصے) کا ایندھن بننے والے ہیں اور اب عام مسلمانوں کا ذکر ہے جن کے صالح اعمال بھی ہیں اور کچھ اعمال سیئہ (برے کام) بھی ساتھ ملے ہوئے ہیں۔ مفسرین نے یہاں ابولبابہ رضی اللہ عنہ وغیرہ کا تذکرہ فرمایا کہ وہ مخلص مسلمان ہونے کے باوجود تبوک پر نہ جا سکے تو انھوں نے اپنے آپ کو مسجد نبوی کے ستونوں سے باندھ لیا کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں خود کھولیں گے تو ہم سمجھیں گے کہ ہماری توبہ قبول ہو گئی۔ آخر کار رسول اللہ صلی اللہ علیہ وسلم نے اللہ کے حکم سے انھیں اپنے ہاتھ سے کھولا اور پہلے ان کا پیش کردہ صدقہ قبول نہیں کیا تھا پھر اگلی آیت «{ خُذْ مِنْ اَمْوَالِهِمْ صَدَقَةً }» اتری تو ان کا صدقہ بھی قبول فرمایا۔ اس مفہوم کی اکثر روایات مرسل یا کمزور ہیں، البتہ {’’الاستيعاب في بيان الأسباب‘‘} میں ابن عباس اور جابر رضی اللہ عنھم کی ایک روایت کو حسن قرار دیا گیا ہے، جس میں ابولبابہ رضی اللہ عنہ اور ان کے ساتھیوں کے پیچھے رہ جانے پر اپنے آپ کو مسجد کے ستونوں سے باندھنے اور آخر کار اللہ کے حکم سے رسول اللہ صلی اللہ علیہ وسلم کے انھیں اپنے ہاتھ سے کھولنے کا اور «{ وَ اٰخَرُوْنَ اعْتَرَفُوْا بِذُنُوْبِهِمْ }» سے «{ اِنَّ صَلٰوتَكَ سَكَنٌ لَّهُمْ }» تک آیات اترنے کا ذکر ہے۔ (واللہ اعلم) البتہ اس بات میں تو کوئی شبہ ہی نہیں کہ جس طرح «{ وَ السّٰبِقُوْنَ الْاَوَّلُوْنَ }» والی آیت میں مذکور افراد «{ وَ الَّذِيْنَ اتَّبَعُوْهُمْ بِاِحْسَانٍ }» میں قیامت تک صحابہ کرام رضی اللہ عنھم کے تمام محسن پیروکار شامل ہیں، اسی طرح یہ آیت قیامت تک آنے والے تمام گناہ گار مخلص مسلمانوں کو شامل ہے، جنھوں نے اپنے اچھے اعمال کے ساتھ کچھ دوسرے برے اعمال بھی ملا جلا رکھے ہیں۔ سند کے لحاظ سے اس کی صحیح ترین تفسیر وہ ہے جو امام بخاری رحمہ اللہ نے اس آیت کی تفسیر میں اپنی صحیح میں درج فرمائی ہے کہ سمرہ بن جندب رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’آج رات دو آنے والے میرے پاس آئے، انھوں نے مجھے اٹھایا، پھر وہ مجھے ایک ایسے شہر میں لے گئے جو سونے اور چاندی کی اینٹوں سے بنایا گیا تھا، وہاں میں نے کچھ لوگوں کو دیکھا جن کا نصف بدن سب سے زیادہ خوبصورت شخص کی طرح تھا جو تم دیکھنے والے ہو اور نصف اس بدصورت ترین شخص کی طرح تھا جو تم دیکھنے والے ہو۔ دونوں فرشتوں نے ان لوگوں سے کہا، اس نہر کے اندر داخل ہو جاؤ، وہ اس میں داخل ہو گئے، پھر ہماری طرف واپس آئے تو ان سے وہ بدصورتی جا چکی تھی اور وہ بہترین صورت میں بدل چکے تھے۔ دونوں (فرشتوں) نے مجھ سے کہا، یہ جنت عدن ہے اور وہ تمھارا گھر ہے۔ دونوں نے کہا کہ وہ لوگ جن کا نصف حصہ خوبصورت اور نصف بدصورت تھا [ فَاِنَّهُمْ خَلَطُوْا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا تَجَاوَزَ اللّٰهُ عَنْهُمْ ] تو یہ وہ لوگ ہیں جنھوں نے نیک عمل کیے اور ان کے ساتھ برے عمل بھی ملا جلا دیے، تو اللہ تعالیٰ نے ان سے درگزر فرما دیا۔‘‘ [ بخاری، التفسیر، باب قولہ : « وآخرون اعترفوا بذنوبہم» : ۴۶۷۴ ]"
    },
    {
      "ayah": 103,
      "tafsir": "(آیت 103) ➊ {خُذْ مِنْ اَمْوَالِهِمْ صَدَقَةً:} ابن عباس رضی اللہ عنھما کی روایت جو پچھلی آیت  کی تفسیر میں ذکر ہوئی، اس میں ہے کہ جب ان لوگوں کی توبہ قبول ہو گئی تو یہ اپنے اموال لے کر آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے کہ ہمارا صدقہ قبول فرمایے اور ہمارے لیے استغفار کیجیے، مگر آپ صلی اللہ علیہ وسلم نے صدقہ قبول کرنے سے انکار فرما دیا کہ مجھے اللہ تعالیٰ نے حکم نہیں دیا، اس پر یہ آیت نازل ہوئی اور آپ نے ان کا صدقہ قبول فرما لیا۔ ¤ ➋ اس حکم میں ان اعتراف گناہ کرنے والوں کا صدقہ قبول کرنے کے ساتھ تمام مسلمانوں سے بھی صدقہ وصول کرنے کا حکم ہے، کیونکہ زکوٰۃ اسلام کے بنیادی ارکان خمسہ میں شامل ہے۔ رسول اللہ صلی اللہ علیہ وسلم کی عدم موجودگی میں ان کے نائب کو صدقہ ادا کرنا ہو گا۔ بعض لوگوں نے اس آیت سے استدلال کیا کہ زکوٰۃ وصول کرنے کا حق صرف رسول اللہ صلی اللہ علیہ وسلم کو تھا، آپ کے بعد کسی کا یہ حق نہیں۔ چنانچہ آپ کی وفات کے بعد بعض لوگوں نے ابوبکر رضی اللہ عنہ کو زکوٰۃ دینے سے انکار کر دیا، مگر ابوبکر رضی اللہ عنہ اور تمام صحابہ نے ان کی تاویل کو رد کیا اور ان سے اس وقت تک جنگ کی جب تک انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے خلیفہ کو زکوٰۃ ادا نہیں کی۔ اس موقع پر ابوبکر رضی اللہ عنہ نے اپنا وہ مشہور قول ارشاد فرمایا تھا کہ اللہ کی قسم! اگر یہ لوگ مجھ سے ایک عناق (بکری کی پٹھوری) اور ایک روایت میں ہے کہ ایک عقال (ایک رسی یا ایک سال کی زکوٰۃ) روکیں گے جو وہ رسول اللہ صلی اللہ علیہ وسلم کو ادا کرتے تھے تو میں ہر صورت ان کے نہ دینے کی وجہ سے ان سے جنگ کروں گا۔ ¤ ➌ { تُطَهِّرُهُمْ وَ تُزَكِّيْهِمْ بِهَا:} اس سے زکوٰۃ اور صدقات کی فضیلت ظاہر ہے کہ اس کے ذریعے سے انسان کے مال کو اور اس کی نیت اور عمل کو طہارت اور پاکیزگی حاصل ہوتی ہے اور دونوں میں اضافہ ہوتا ہے، کیونکہ{ ’’ زَكَا يَزْكُوْ‘‘} جس سے {’’ تُزَكِّيْهِمْ ‘‘ } مشتق ہے، پاک ہونے اور بڑھنے دونوں معنی میں آتا ہے۔ ویسے بھی صدقہ کو صدقہ کہنے کی ایک وجہ یہ بھی ہے کہ یہ ایمان کا دعویٰ کرنے والے کے صدق کو ظاہر کرتا ہے۔ ¤ ➍ {وَصَلِّ عَلَيْهِمْ اِنَّ صَلٰوتَكَ سَكَنٌ لَّهُمْ …: ’’ صَلَاةٌ ‘‘} کا معنی نماز، رحمت اور دعا بھی آتا ہے،، یہاں اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو صدقہ پیش کرنے والوں کے لیے مغفرت و رحمت کی دعا کا حکم دیا کہ اس سے ان کے دل کو سکون حاصل ہوتا ہے، اس لیے آپ صلی اللہ علیہ وسلم کا معمول تھا کہ جب کوئی صدقہ (فرض زکوٰۃ یا نفل صدقہ) لے کر آتا تو آپ اس کے لیے دعا فرماتے، جیسا کہ پیچھے آیت (۹۹) کی تفسیر میں باحوالہ گزرا ہے کہ آپ نے ابو اوفی رضی اللہ عنہ کے زکوٰۃ لانے پر [ اَللّٰهُمَّ صَلِّ عَلٰی آلِ اَبِيْ اَوْفٰی ] کہہ کر ان کے ساتھ ان کے پورے اہل کو بھی دعا میں شامل فرما لیا۔ «{ وَ اللّٰهُ سَمِيْعٌ عَلِيْمٌ }» یعنی اللہ تعالیٰ جو وہ کہہ رہے ہیں یا جو ان کے دل میں ہے سب سے واقف ہے، کیونکہ وہ سمیع بھی ہے علیم بھی۔"
    },
    {
      "ayah": 104,
      "tafsir": "(آیت 104) {اَلَمْ يَعْلَمُوْۤا اَنَّ اللّٰهَ هُوَ يَقْبَلُ التَّوْبَةَ … :} اس آیت میں (گناہ گاروں کو) توبہ اور صدقے پر ابھارا گیا ہے، کیونکہ یہ دونوں چیزیں گناہوں کو مٹا دیتی ہیں اور اللہ تعالیٰ نے فرمایا کہ جو بھی توبہ کرے اور پھر عمل صالح کرے اللہ اس کی توبہ قبول کرتا ہے، بلکہ ساتھ ہی اس کے گناہوں کو نیکیوں میں بدل دیتا ہے۔ دیکھیے سورۂ فرقان (۷۰، ۷۱) بھلا اس کرم کی کوئی حد ہے؟ پھر وہ صدقہ قبول ہی نہیں کرتا، بلکہ اسے بڑھاتا ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’بے شک اللہ تعالیٰ صدقہ قبول کرتا ہے اور اسے اپنے دائیں ہاتھ سے لیتا ہے، پھر اسے تمھارے ایک کے لیے پالتا بڑھاتا ہے، جس طرح تمھارا کوئی شخص اپنے گھوڑی کے بچھیرے کو پالتا ہے، یہاں تک کہ ایک لقمہ احد پہاڑ کے برابر ہو جاتا ہے۔‘‘ پھر اس کی تصدیق میں زیر تفسیر آیت اور یہ آیت پڑھی : «{ يَمْحَقُ اللّٰهُ الرِّبٰوا وَ يُرْبِي الصَّدَقٰتِ }» [ البقرۃ : ۲۷۶ ] ’’اللہ تعالیٰ سود کو مٹاتا ہے اور صدقات کو بڑھاتا ہے۔‘‘ [ ترمذی، الزکوٰۃ، باب ما جاء فی فضل الصدقۃ : ۶۶۲ ] اس کا اصل بخاری اور مسلم میں بھی ہے۔ [ ہدایۃ المستنیر ]"
    },
    {
      "ayah": 105,
      "tafsir": "(آیت 105) ➊ {وَ قُلِ اعْمَلُوْا فَسَيَرَى اللّٰهُ عَمَلَكُمْ … :} یعنی اب اگر قصور ہو گیا تو آئئندہ رسول اللہ صلی اللہ علیہ وسلم اور خلفاء کے دور میں جو جہاد ہونے والے ہیں ان میں خوب کام کر لو۔ (موضح) اللہ تعالیٰ تو پہلے ہی گزشتہ، موجودہ اور آئندہ کے تمام احوال سے پوری طرح باخبر ہے مگر تم عمل کرو، تمھارے عمل کو وجود میں آتا ہوا اللہ تعالیٰ بھی دیکھ لے گا، اس کا رسول بھی اور ان کے زمانے کے مومن اور بعد میں آنے والے خلفاء اور اہل ایمان بھی، کیونکہ آدمی اچھا یا برا جو کام بھی کرتا ہے اس کی اسی طرح کی شہرت ہر طرف پھیل جاتی ہے، خصوصاً مومن اس سے بے خبر نہیں رہتے۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَنْتُمْ شُهَدَاءُ اللّٰهِ فِي الْاَرْضِ ] [ النسائی، الجنائز، باب الثناء : ۱۹۳۴، ۱۹۳۵] ’’تم زمین میں اللہ تعالیٰ کے گواہ ہو۔‘‘ یہ الفاظ آپ صلی اللہ علیہ وسلم نے ایک جنازے کے گزرنے پر لوگوں کی اچھی تعریف اور دوسرے کے گزرنے پر لوگوں کے اس کی بری تعریف کرنے پر ارشاد فرمائے اور پہلے کے لیے جنت کی بشارت دی اور دوسرے کے لیے آگ کی۔ ایک روایت میں ہے : [ اَلْمُؤْمِنُوْنَ شُهَدَاءُ اللّٰهِ فِي الْاَرْضِ ] ’’مومن زمین میں اللہ کے گواہ ہیں۔‘‘ [ بخاری، الجنائز، باب ثناء الناس علی المیت : ۱۳۶۷ ] ¤ ➋ { وَ سَتُرَدُّوْنَ اِلٰى عٰلِمِ الْغَيْبِ وَ الشَّهَادَةِ …:} یعنی اگر بالفرض لوگوں کو تمھاری حقیقت کی خبر نہ ہو سکی تو آخر کار تمھیں واپس عالم الغیب والشہادہ کے پاس جانا ہے، وہاں کچھ مخفی نہیں رہے گا۔"
    },
    {
      "ayah": 106,
      "tafsir": "(آیت 106) {وَ اٰخَرُوْنَ مُرْجَوْنَ لِاَمْرِ اللّٰهِ … :} جو لوگ غزوۂ تبوک میں شریک نہیں ہوئے اور مدینہ سے نہیں نکلے وہ تین طرح کے تھے، ایک منافقین، دوسرے ابولبابہ رضی اللہ عنہ اور ان کے ساتھی، جن کا ذکر اوپر گزر چکا ہے اور تیسرے کعب بن مالک رضی اللہ عنہ اور ان کے دو ساتھی مرارہ بن ربیع اور ہلال بن امیہ رضی اللہ عنھما، جنھوں نے اگرچہ آپ صلی اللہ علیہ وسلم کے سامنے کوئی جھوٹا عذر بنا کر پیش نہیں کیا، لیکن اللہ تعالیٰ نے ان کی توبہ جلدی قبول نہ فرمائی بلکہ ان کے معاملے کو مؤخر رکھا۔ اس آیت میں انھی کا ذکر ہے اور ان کی توبہ کی قبولیت کا ذکر آگے آیت میں آ رہا ہے۔"
    },
    {
      "ayah": 107,
      "tafsir": "(آیت 107) {وَ الَّذِيْنَ اتَّخَذُوْا مَسْجِدًا ضِرَارًا …: } یہ منافقین کے ایک اور قبیح کام کا ذکر ہے کہ انھیں اسلام اور مسلمانوں کے خلاف منصوبے اور سازشیں بنانے کے لیے جمع ہونے اور اپنے راز مخفی رکھنے کے لیے کوئی موزوں جگہ نہیں ملتی تھی، چنانچہ انھوں نے مسجد قبا کے ساتھ ہی ایک مسجد بنائی جس کے بنانے میں اللہ تعالیٰ نے ان کے چار مقصد بیان فرمائے ہیں۔ چاروں مقصد مصدر کے لفظ کے ساتھ آئے ہیں : (1) {’’ ضِرَارًا ‘‘} یعنی یہ مسجد اللہ تعالیٰ کی عبادت کے لیے نہیں بلکہ مومنوں کو نقصان اور تکلیف پہنچانے کے لیے ہے۔ (2) {’’ وَ كُفْرًا ‘‘} یعنی مساجد کی بنیاد تو اللہ اور رسول پر ایمان اور اکیلے اللہ کو پکارنے کے لیے ہوتی ہے، جیسا کہ فرمایا : «{ وَ اَنَّ الْمَسٰجِدَ لِلّٰهِ فَلَا تَدْعُوْا مَعَ اللّٰهِ اَحَدًا }» [ الجن : ۱۸ ] مگر اس کی بنیاد اللہ تعالیٰ اور اس کے رسول کے خلاف دلوں میں چھپا ہوا کفر و شرک اور اس کی اشاعت ہے۔ (3) {’’ وَ تَفْرِيْقًۢا بَيْنَ الْمُؤْمِنِيْنَ ‘‘} مسجد قبا کی موجودگی میں اس کے ساتھ ہی مسجد بنانے کا واضح مطلب مسلمانوں کی وحدت کو پارہ پارہ کرنا تھا کہ وہ ایک جگہ نماز نہ پڑھیں، کیونکہ مسلمانوں کی اسلام کی وجہ سے باہمی محبت اور اتفاق و اتحاد سے منافقین کو شدید حسد تھا۔ (4) {’’ وَ اِرْصَادًا لِّمَنْ حَارَبَ اللّٰهَ وَ رَسُوْلَهٗ ‘‘} اس سے پہلے جو لوگ اللہ اور اس کے رسول کی مخالفت کرتے رہے اور ان سے برسر جنگ رہے، خصوصاً منافقین اور وہ لوگ جو مدینہ سے بھاگ گئے تھے اور دشمنوں کی پناہ میں رہ کر اسلام کے خلاف سازشیں کر رہے تھے ان کے لیے اور ان کے بھیجے ہوئے آدمیوں کے لیے مسجد کے پردے میں چھپاؤ کی جگہ مہیا کرنا۔ مؤرخین نے خصوصاً یہاں ابوعامر راہب (جس کا نام مسلمانوں نے ابوعامر فاسق رکھا ہوا تھا) کا ذکر کیا ہے، جو مشہور صحابی حنظلہ غسیل الملائکہ کا والد تھا اور عیسائی ہو کر ہرقل کے پاس مسلمانوں کے خلاف کمک حاصل کرنے کے لیے گیا تھا، اس کی تجویز پر مسلمانوں سے جنگ کے لیے آنے والوں کے لیے بطور گھات اور کمین گاہ یہ مسجد بنائی گئی تھی۔ ¤ منافقین نے مسلمانوں کے دلوں سے شک دور کرنے کے لیے مسجد بنانے کا بہانہ یہ بنایا کہ ہم نے بیماروں اور کمزوروں کی سہولت کے لیے یہ مسجد بنائی ہے، تاکہ وہ سردی اور بارش میں سہولت سے یہاں نماز پڑھ سکیں اور ساتھ ہی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر آپ سے درخواست کی کہ آپ وہاں چل کر نماز پڑھیں، تاکہ ہمیں برکت حاصل ہو۔ خواہش ان کی یہ تھی کہ آپ کے نماز پڑھنے سے ہماری مسجد تسلیم ہو جائے اور ہم اپنی سرگرمیاں جاری رکھ سکیں۔ آپ اس وقت تبوک کے لیے روانہ ہو رہے تھے، اس لیے آپ نے فرمایا کہ اللہ نے چاہا تو واپپسی پر میں تمھاری مسجد میں آ کر نماز پڑھوں گا۔ جب آپ صلی اللہ علیہ وسلم تبوک سے واپسی پر مدینہ کے بالکل قریب پہنچ گئے تو جبریل علیہ السلام یہ آیات لے کر نازل ہوئے جن میں اس مسجد ضرار کا پول کھولا گیا اور یہ بھی بتایا گیا کہ یہ لوگ یقینا قسمیں کھائیں گے کہ ہمارا ارادہ اس مسجد بنانے سے بھلائی کے سوا کچھ نہ تھا، جب کہ اللہ تعالیٰ کی شہادت یہ ہے کہ بلاشک و شبہ یہ لوگ یقینا جھوٹے ہیں۔"
    },
    {
      "ayah": 108,
      "tafsir": "(آیت 108) ➊ {لَا تَقُمْ فِيْهِ اَبَدًا:} اس کے دو معنی ہو سکتے ہیں، ایک تو یہ کہ آپ اس میں کبھی نماز نہ پڑھیں، کیونکہ قیام نماز کے معنی میں بھی آتا ہے، جیسا کہ حدیث ہے : [مَنْ قَامَ رَمَضَانَ اِيْمَانًا ] دوسرا یہ کہ نماز تو دور کی بات ہے آپ کبھی اس مسجد میں جا کر کھڑے بھی نہ ہوں، کیونکہ اس میں ان کی عزت افزائی ہو گی، جیسا کہ آپ کو منافقین کا جنازہ پڑھنے اور ان کی قبروں پر کھڑے ہونے سے بھی منع فرمایا : «{ وَ لَا تُصَلِّ عَلٰۤى اَحَدٍ مِّنْهُمْ مَّاتَ اَبَدًا وَّ لَا تَقُمْ عَلٰى قَبْرِهٖ }» [ التوبۃ : ۸۴ ] چنانچہ آپ نے راستے ہی سے آدمی بھیج کر اس مسجد کو جلوا کر مسمار کروا دیا۔ ¤ ➋ { لَمَسْجِدٌ اُسِّسَ عَلَى التَّقْوٰى مِنْ اَوَّلِ يَوْمٍ … :} اس مسجد سے کون سی مسجد مراد ہے؟ سیاق و سباق سے واضح طور پر مسجد قبا ہی معلوم ہوتی ہے، کیونکہ اس کی بنیاد مسجد ضرار کے برعکس پہلے دن ہی سے اللہ کے تقویٰ اور اس کی رضا کے حصول پر رکھی گئی تھی اور اس کی خاص فضیلت بھی صحیح احادیث میں آئی ہے۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مسجد قبا میں نماز عمرہ کی طرح ہے۔‘‘ [ ترمذی، الصلاۃ، باب ما جاء فی مسجد قباء : ۳۲۴، عن أسید بن ظہیر رضی اللہ عنہ ] عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہر ہفتہ کے دن مسجد قبا میں سوار ہو کر یا پیدل آیا کرتے تھے اور اس میں دو رکعتیں پڑھا کرتے تھے۔ [ مسلم، الحج، باب فضل مسجد قباء… : ۱۳۹۹ ] ¤ صحیح بخاری میں ہجرت سے متعلق طویل حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم ہجرت کے موقع پر پہلے بنوعمرو بن عوف میں دس سے کچھ زیادہ راتیں ٹھہرے اور اس مسجد کی بنیاد رکھی جو «{ اُسِّسَ عَلَى التَّقْوٰى مِنْ اَوَّلِ يَوْمٍ }» ہے اور آپ نے اس میں نماز پڑھی، پھر اپنی اونٹنی پر سوار ہوئے اور لوگوں کے ساتھ چلتے ہوئے آگے روانہ ہوئے، یہاں تک کہ اونٹنی رسول اللہ صلی اللہ علیہ وسلم کی اس مسجد کے پاس بیٹھ گئی جو مدینہ میں ہے اور وہ سہل اور سہیل رضی اللہ عنھما کی کھجوریں سکھانے کی جگہ تھی۔ [ بخاری، مناقب الأنصار، باب ہجرۃ النبی صلی اللہ علیہ وسلم و أصحابہ إلی المدینۃ : ۳۹۰۶ ] اس سے بھی ظاہر ہے کہ اس سے مراد مسجد قبا ہے، مگر بعض احادیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اس کا مصداق مسجد نبوی کو قرار دیا، چنانچہ ابوسعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ دو آدمیوں کی اس مسجد کے بارے میں بحث ہو گئی کہ وہ کون سی مسجد ہے جو «{ اُسِّسَ عَلَى التَّقْوٰى مِنْ اَوَّلِ يَوْمٍ }» ہے۔ ایک نے کہا، وہ مسجد قبا ہے۔ دوسرے نے کہا، وہ مسجد رسول صلی اللہ علیہ وسلم ، یعنی مسجد نبوی ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ میری یہ مسجد (مسجد نبوی) ہے۔‘‘ [ ترمذی، تفسیر القرآن، سورۃ التوبۃ : ۳۰۹۹ ] اس کی سند بھی صحیح ہے اور احمد، مسلم اور نسائی میں مذکور احادیث میں بھی آپ صلی اللہ علیہ وسلم نے اسے مسجد نبوی ہی قرار دیا ہے۔ اہل علم نے فرمایا، ان دونوں حدیثوں میں کوئی تضاد نہیں، کیونکہ دونوں مسجدوں کی بنیاد پہلے دن ہی سے تقویٰ پر رکھی گئی ہے اور آپ کا مسجد نبوی کی صراحت کرنا اس لیے تھا کہ کوئی شخص یہ نہ سمجھ لے کہ پہلے دن سے تقویٰ پر بنیاد صرف مسجد قبا کی رکھی گئی ہے، بلکہ واضح فرمایا کہ مسجد نبوی کی بنیاد بھی پہلے دن ہی سے تقویٰ پر رکھی گئی ہے اور وہ بالاولیٰ اس آیت کی مصداق ہے۔ ¤ ➌ ہر وہ مسجد جس کی بنیاد مسلمانوں کو نقصان پہنچانے یا تفریق ڈالنے کے لیے رکھی جائے، اس میں نماز جائز نہیں اور اسے ڈھا دینا لازم ہے اور ایک مسجد کے ساتھ ہی دوسری مسجد بنانا درست نہیں، الا یہ کہ آبادی زیادہ ہو جو ایک مسجد میں نماز نہ پڑھ سکیں۔ اسی طرح کوئی بھی مسجد جس کے بنانے والوں نے اس کی بنیاد ہی مشرکانہ عقائد پھیلانے اور توحید اور اہل توحید و سنت کی عداوت اور مخالفت کے لیے رکھی ہو اور اس میں قبر بنا دی ہو یا شرکیہ کلمات لکھے ہوں، اس میں بھی نماز پڑھنے سے گریز کرنا چاہیے۔ ہاں، جس مسجد کی بنیاد پوری بستی نے اللہ تعالیٰ کی عبادت اور نماز ہی کے لیے رکھی ہو بعد میں کوئی مشرکانہ عقیدے والا اس میں شرک کی کوئی علامت نمایاں کر دے، جسے ختم کرنے پر آدمی قدرت نہ رکھتا ہو، یا کوئی قدیم مسجد جس کے متعلق معلوم نہ ہو کہ اس کے بنانے والے نے اس کی بنیاد مشرکانہ عقیدے پر رکھی ہے، وہاں نماز پڑھنا جائز ہے، کیونکہ اس کی بنیاد تقویٰ پر ہے، جیسا کہ مشرکین نے کعبہ کے اندر اور اردگرد بت رکھ دیے تھے، مگر رسول اللہ صلی اللہ علیہ وسلم فتح مکہ سے پہلے اس میں نماز پڑھتے اور طواف کرتے تھے۔ جب اللہ تعالیٰ قوت عطا فرمائے تو ان مساجد کو شرک کے مظاہر و علامات سے پاک کر دیا جائے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے کیا۔ ¤ مسلمانوں کے زوال کے اسباب میں سے بہت بڑا سبب ان کی باہمی تفریق ہے، اس لیے تمام کفار اور منافقین اسے زیادہ سے زیادہ بڑھانے کی کوشش کرتے رہتے ہیں۔ وہ تفریق صوفیانہ فرقوں کی ہو یا فقہی فرقوں کی، یا سیاسی فرقوں کی مسلمانوں کی نجات، ترقی اور غلبہ تمام فرقے ختم کرکے صرف کتاب و سنت پر ایک ہو جانے میں ہے۔ ہماری تاریخ میں ایک ایسا دور بھی گزرا ہے کہ حنفی، مالکی، حنبلی اور شافعی چاروں کی الگ مسجدیں، الگ مدرسے، الگ عدالتیں تھیں، حتیٰ کہ عین مسجد حرام میں چار الگ الگ مصلوں پر جماعتیں ہوتی تھیں۔ اللہ تعالیٰ جزائے خیر دے سلطان عبد العزیز رحمہ اللہ کو جنھوں نے تمام مملکت نجد و حجاز میں اور خانہ کعبہ میں یہ تفریق ختم کرکے سب کو ایک ہی امام پر جمع فرمایا۔ دوسرے ممالک میں ابھی تک ہر فرقے کی الگ الگ مسجدیں ہیں۔ اللہ تعالیٰ سب کو فرقہ بازی چھوڑ کر توحید و سنت پر جمع ہونے کی توفیق عطا فرمائے، جیسا کہ مسلمانوں کا پہلا ایک سو سال کا روشن ترین زمانہ ان فرقوں اور الگ الگ عدالتوں اور مساجد سے پاک تھا اور تمام مسلمانوں کے کتاب و سنت پر متحد ہونے کی وجہ سے پوری دنیا پر ان کا غلبہ تھا۔ یہ تمام فرقے اور جن کے ناموں پر فرقے بنے ہیں سب بعد میں ظہور پذیر ہوئے، خیر القرون میں ان کا نام و نشان بھی نہ تھا۔ ¤ ➍ { فِيْهِ رِجَالٌ يُّحِبُّوْنَ اَنْ يَّتَطَهَّرُوْا … : ’’ يَتَطَهَّرُوْا ‘‘} اور {’’ الْمُطَّهِّرِيْنَ ‘‘} یہ ’’{طَهُرَ } (کرم)‘‘ میں سے باب تفعل یعنی {’’تَطَهَّرَ يَتَطَهَّرَ‘‘} کے صیغے ہیں، اس لیے ان کا معنی حروف میں اضافے کی وجہ سے بہت پاک ہونا اور رہنا ہے۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : ’’یہ آیت : «{ فِيْهِ رِجَالٌ يُّحِبُّوْنَ اَنْ يَّتَطَهَّرُوْا وَ اللّٰهُ يُحِبُّ الْمُطَّهِّرِيْنَ }» اہل قبا کے متعلق اتری، وہ پانی کے ساتھ استنجا کرتے تھے۔‘‘ [ أبوداوٗد، الطھارۃ، باب فی الاستنجاء بالماء : ۴۴۔ ترمذی : ۳۱۰۰۔ ابن ماجہ : ۳۵۵، و صححہ الألبانی ] ¤ ➎ حافظ ابن حجر عسقلانی رحمہ اللہ نے بلوغ المرام میں ابن عباس رضی اللہ عنھما کی روایت نقل کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اہل قبا سے پوچھا کہ اللہ تعالیٰ تمھاری تعریف کرتا ہے (اس کی کیا وجہ ہے؟) انھوں نے کہا کہ ہم پتھروں کے بعد پانی استعمال کرتے ہیں۔ اس حدیث کی وجہ سے بہت سے لوگ جہاں پانی میسر ہو وہاں بھی پہلے ڈھیلے استعمال کرتے ہیں پھر پانی، جس سے گندگی بھی پھیلتی ہے اور گٹر بھی بند ہوتے ہیں۔ کئی لوگ استنجا خانے سے باہر شلوار ہاتھ میں پکڑ کر ڈھیلے سے پیشاب خشک کر رہے ہوتے ہیں جو نہایت بے ہودہ دکھائی دیتے ہیں۔ حقیقت یہ ہے کہ اہل قبا کی تعریف اس لیے تھی کہ وہ پانی کے ساتھ استنجا کرتے تھے، پانی کی موجودگی میں ڈھیلے کی ضرورت نہیں ہے۔ اگر کسی کو صرف پانی کے ساتھ طہارت سے تسلی نہیں ہوتی تو وہ وسوسے کا مریض ہے۔ یہ حدیث جس میں پتھروں کے بعد پانی کا ذکر ہے، اس کے متعلق خود حافظ ابن حجر رحمہ اللہ نے بلوغ المرام میں فرمایا کہ اسے بزار نے ضعیف سند کے ساتھ روایت کیا ہے۔ اصل حدیث ابوداؤد اور ترمذی میں ہے، جسے ابن خزیمہ نے ابوہریرہ رضی اللہ عنہ سے صحیح کہا ہے اور وہ پتھروں کے ذکر کے بغیر ہے۔ حافظ ابن حجر رحمہ اللہ نے {’’ التلخيص الحبير‘‘} میں اس کی وجہ یہ بیان کی ہے کہ اسے صرف محمد بن عبد العزیز راوی نے روایت کیا ہے اور وہ ضعیف ہے۔ اسے ابوحاتم نے ضعیف کہا ہے۔ ہاں استنجا صرف پتھروں سے بھی جائز اور کافی ہے اور اگر کبھی اس کا اتفاق ہو اور اس کے بعد پانی سے مزید صفائی کر لے تو بہتر ہے، ورنہ پانی کی موجودگی میں پتھر استعمال کرنے کی کوئی حدیث صحیح نہیں ہے اور نہ اس کی کوئی ضرورت ہے۔"
    },
    {
      "ayah": 109,
      "tafsir": "(آیت 109) ➊ {اَفَمَنْ اَسَّسَ بُنْيَانَهٗ عَلٰى تَقْوٰى … : ’’ شَفَا ‘‘} کنارا {’’ جُرُفٍ ‘‘} ندی نالے یا دریا کا کنارا جس کے نیچے سے پانی مٹی بہا کر لے گیا ہو اور وہ بس گرنے ہی والا ہو، کیونکہ اس کے نیچے کوئی بنیاد ہی نہیں کہ ٹھہر سکے، صرف مٹی کا نیچے سے کھوکھلا تودا ہے۔ {’’ هَارٍ ‘‘} اسم فاعل ہے {’’هَارَ يَهَارُ ({خَافَ يَخَافُ})‘‘} سے یا {”هَارَ يَهُوْرُ ({قَالَ يَقُوْلُ})“} سے۔ اصل {’’هَائِرٌ‘‘} تھا، جیسا کہ {’’خَائِفٌ‘‘} یا {’’قَائِللٌ‘‘} ، پھر اس میں قلب واقع ہوا تو{ ’’هَارِيٌ‘‘} ہو گیا اور {’’رَاضِيٌ‘‘} سے یاء گرنے کے بعد {’’رَاضٍ‘‘ } کی طرح {’’هَارِيٌ‘‘} سے {’’هَارٍ‘‘} ہو گیا۔ {’’ فَانْهَارَ ‘‘} باب انفعال {’’ اِنْهِيَارٌ ‘‘} سے ماضی معلوم ہے۔ ¤ یہ دو شخصوں کی مثال ہے، ایک وہ جس کے عقیدہ و عمل کی بنیاد اللہ کے تقویٰ اور اس کی رضا پر ہے، دوسرا وہ جس کے عقیدہ وعمل کی بنیاد محض کفر و نفاق پر ہے۔ اول الذکر کی عمارت کی بنیاد مضبوط ومستحکم ہے، وہ کبھی گرنے والی نہیں اور دوسرے کی عمارت ایسی چیز پر ہے جو دکھائی تو دیتی ہے مگر نیچے سے خالی ہے، گویا اس کی بنیاد ہی نہیں۔ اس کا نتیجہ اس کے سوا کیا ہو گا کہ وہ عمارت ہر حال میں اسے بھی لے کر گرے گی اور کفر و نفاق (جس کا انجام آگ ہے) کے اوپر کھڑی ہونے کی وجہ سے جہنم کی آگ میں لے کر گرے گی۔ ¤ ➋ { وَ اللّٰهُ لَا يَهْدِي الْقَوْمَ الظّٰلِمِيْنَ:} یعنی بے انصافی (ظلم) کی یہ شامت پڑتی ہے کہ نیک عمل کرنا بھی چاہیں تو بن نہیں آتا۔ (موضح)"
    },
    {
      "ayah": 110,
      "tafsir": "(آیت 110) {لَا يَزَالُ بُنْيَانُهُمُ الَّذِيْ بَنَوْا رِيْبَةً …: ’’ رِيْبَةً ‘‘} بے چینی، جیسا کہ حسن بن علی رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلصِّدْقُ طُمَانِيْنَةٌ وَالْكِذْبُ رِيْبَةٌ ] [ أ أحمد : 200/1، ح : ۱۷۲۸۔ ترمذی : ۲۵۱۸، و صححہ الألبانی ] ’’سچ اطمینان کا باعث ہے اور جھوٹ بے چینی کا باعث ہے۔‘‘ یعنی یہ مسجد ضرار گرائے جانے کے بعد اس کے بنانے والوں کے دلوں کو بے چین رکھے گی کہ ہمارا نفاق و کفر ظاہر ہو گیا، اب کوئی مسلمان ہمیں دل سے اپنا سمجھنے کے لیے تیار نہیں ہو گا، ان کی یہ حالت موت تک ایسے ہی رہے گی۔ «{ اِلَّاۤ اَنْ تَقَطَّعَ قُلُوْبُهُمْ }» کا یہی معنی ہے، نہ ان کا دل نفاق سے پاک ہو گا نہ انھیں اطمینان نصیب ہو گا۔"
    },
    {
      "ayah": 111,
      "tafsir": "(آیت 111) ➊ {اِنَّ اللّٰهَ اشْتَرٰى مِنَ الْمُؤْمِنِيْنَ اَنْفُسَهُمْ … : ’’ فَاسْتَبْشِرُوْا۠ ‘‘ ’’اَلْاِسْتِبْشَارُ‘‘} ایسی زبردست خوشی جس کے اثرات بشرے یعنی چہرے پر بھی ظاہر ہوں۔ سین اور تاء کے اضافے سے بشریٰ، یعنی خوش خبری کے مفہوم میں بہت اضافہ ہو گیا ہے۔ بعض علماء نے فرمایا کہ جہاد کی اس سے بہتر اور اس سے بڑھ کر مؤثر ترغیب آپ کسی آیت میں نہیں پائیں گے، کیونکہ اسے ایک سودے اور معاہدے کی صورت میں پیش کیا گیا ہے جو سودا رب العزت کے ساتھ ہے۔ سودے کا سامان مومنوں کی جانیں اور مال ہیں اور قیمت اس کی اتنی قیمتی اور بے مثال ہے جو نہ کسی آنکھ نے دیکھی، نہ کسی کان نے سنی اور نہ کسی انسان کے دل میں اس کا خیال تک آیا۔ یہ سودا اور معاہدہ صرف اس پر نہیں کہ وہ قتل کیے جائیں گے تو قیمت ملے گی، بلکہ اللہ کے دین کی نصرت اور اس کا کلمہ بلند کرنے کے لیے وہ کفار کو قتل کریں گے تب بھی یہی قیمت ملے گی۔ پھر اس معاہدے کی باقاعدہ تسجیل (رجسٹری) آسمانی کتابوں تورات، انجیل اور قرآن میں کی گئی، اس سے بڑھ کر سودے کی پختگی کا تحریری ثبوت اور کیا ہو سکتا ہے، پھر اسے اللہ تعالیٰ کا سچا پکا عہد قرار دے کر فرمایا کہ اللہ تعالیٰ سے بڑھ کر اپنا عہد کون پورا کرنے والا ہے۔ سو اس کا ادھار دوسرے تمام نقدوں سے بڑھ کر ہے، پھر اس کا ادھار وعدہ جنت یقینی ہے۔ اس آیت کے علاوہ دیکھیے سورۂ حدید (۲۱)، سورۂ صف (۱۰ تا ۱۲) اور سورۂ توبہ (۲۰ تا ۲۲) اور اگر کچھ زندگی باقی ہے تو وہ بھی اس کے بے پایاں انعام سے خالی نہیں۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نے ضمانت دی ہے کہ جو اس کے راستے میں جہاد کرے اور اسے اس کے راستے میں نکالنے والی چیز اس کی راہ میں جہاد اور اس کی باتوں کو سچا یقین کرنے کے سوا کچھ نہ ہو تو وہ اسے جنت میں داخل فرمائے گا، یا اسے اس کے گھر میں اجر یا غنیمت سمیت واپس لائے گا جس گھر سے وہ نکل کر گیا تھا۔‘‘ [ بخاری، فرض الخمس، باب قول النبی صلی اللہ علیہ وسلم : أحلت لکم الغنائم : ۳۱۲۳ ] ¤ مغیرہ بن شعبہ رضی اللہ عنہ اور ان کے ساتھی مجاہدین ایران میں جہہاد کے لیے گئے تو کسریٰ کے جرنیل نے مسلمانوں کے سفیر مغیرہ بن شعبہ رضی اللہ عنہ سے پوچھا : ’’تم لوگ کیا ہو؟‘‘ انھوں نے رسول اللہ صلی اللہ علیہ وسلم اور اسلام کا تعارف کرانے کے بعد فرمایا : ’’ہمارے نبی صلی اللہ علیہ وسلم نے ہمیں ہمارے رب کا پیغام پہنچایا کہ ہم میں سے جو قتل کر دیا جائے گا وہ جنت کی ایسی نعمتوں میں جائے گا جو کبھی کسی کے دیکھنے میں نہیں آئیں اور جو ہم میں سے باقی رہے گا وہ تمھاری گردنوں کا مالک بنے گا۔‘‘ [ بخاری، الجزیۃ والموادعۃ، باب الجزیۃ والموادعۃ …: ۳۱۵۹ ] جہاد کے بے شمار فضائل کے لیے کتب احادیث ملاحظہ فرمائیں۔ ¤ ➋ {وَ ذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُ:} اس میں حصر کے لیے {’’ هُوَ ‘‘} ضمیر لا کر اور خبر {’’ الْفَوْزُ الْعَظِيْمُ ‘‘} پر الف لام لا کر واضح فرمایا کہ فوزِ عظیم ہے تو بس یہ ہے، اس کے سوا کوئی کامیابی عظیم نہیں، بلکہ معمولی اور بے وقعت ہے۔ ¤ ➌ حسن بصری رحمہ اللہ سے بیان کیا جاتا ہے کہ انھوں نے فرمایا، اللہ تعالیٰ کا کرم دیکھیے، جانیں ہیں تو اسی نے دیں، اموال ہیں تو اس نے عطا فرمائے، پھر وہ ہم ہی سے سودا کر رہا ہے کہ ہم اس کے راستے میں خرچ کریں گے اور وہ ہمیں اس کے بدلے جنت میں داخل ہی نہیں کرے گا بلکہ وہ اسے ہماری ملکیت بنا دے گا۔ {’’ لَهُمُ ‘‘} پہلے آنے سے حصر کا معنی حاصل ہوا {’’ بِاَنَّ لَهُمُ الْجَنَّةَ ‘‘} کہ جنت انھی کی ہے۔"
    },
    {
      "ayah": 112,
      "tafsir": "(آیت 112) ➊ اس آیت میں اللہ تعالیٰ نے سچے مجاہد مومنوں کی نو صفات بیان فرمائی ہیں۔ پہلی چھ صفات میں صرف اللہ تعالیٰ کے ساتھ معاملہ ہے، ساتویں اور آٹھویں صفت کا تعلق مخلوق سے ہے اور آخری کا تعلق دونوں سے ہے۔ ¤ ➋ { اَلتَّآىِٕبُوْنَ:} اپنے گناہوں پر نادم ہو کر ان کو چھوڑنے کا عزم کرکے اللہ تعالیٰ سے معافی مانگنے والے، کیونکہ توبہ ان تینوں کے جمع ہونے سے مکمل ہوتی ہے۔ میدان قتال میں توبہ و استغفار سے زیادہ کوئی چیز مفید نہیں، جیسا کہ اللہ تعالیٰ نے بہت سے نبیوں کے ہمراہ قتال کرنے والوں کی دعا ذکر فرمائی : «{ وَ مَا كَانَ قَوْلَهُمْ اِلَّاۤ اَنْ قَالُوْا رَبَّنَا اغْفِرْ لَنَا ذُنُوْبَنَا وَ اِسْرَافَنَا فِيْۤ اَمْرِنَا وَ ثَبِّتْ اَقْدَامَنَا وَ انْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِيْنَ }» [ آل عمران : 147 ] ’’اور ان کا کہنا اس کے سوا کچھ نہ تھا کہ انھوں نے کہا اے ہمارے رب! ہمارے گناہ بخش دے اور ہمارے کام میں ہماری زیادتی کو بھی اور ہمارے قدم ثابت رکھ اور کافر لوگوں پر ہماری مدد فرما۔‘‘ ¤ ➌ { الْعٰبِدُوْنَ الْحٰمِدُوْنَ:} مشکل اور آسانی، خوشی اور ناخوشی، آرام اور تکلیف ہر حال میں اللہ کی عبادت کرنے والے اور ہر حال میں اس کی تعریف کرنے والے اور اس پر راضی رہنے والے۔ ¤ ➍ { السَّآىِٕحُوْنَ: ’’سَاحَ يَسِيْحُ سِيَاحَةً‘‘} کا معنی پانی کا زمین پر چلنا، پھیل جانا۔ {’’ اَلسِّيَاحَةُ ‘‘ } عبادت کے لیے (گھر بار چھوڑ کر) زمین میں نکل جانا۔ (قاموس) چونکہ اس میں آرام و آسائش کا ترک اور دنیا کا ترک پایا جاتا ہے۔ نصرانیت میں اس نے رہبانیت کی صورت اختیار کی جس سے اللہ تعالیٰ نے منع فرما دیا، چنانچہ فرمایا : «{ وَ رَهْبَانِيَّةَ اِبْتَدَعُوْهَا مَا كَتَبْنٰهَا عَلَيْهِمْ }» [ الحدید : ۲۷ ]’’اور رہبانیت (دنیا سے کنارہ کشی) تو انھوں نے خود ایجاد کر لی، ہم نے اسے ان پر نہیں لکھا تھا۔‘‘ اب اس کی صورت اللہ تعالیٰ کی خاطر ہجرت (وطن چھوڑنا) ہے کہ جہاں اللہ کے دین پر عمل نہ کر سکے، نہ اس کی دعوت دے سکے، اسے چھوڑ کر اللہ کی زمین میں کہیں اور نکل جائے۔ دیکھیے سورۂ نساء (۹۷ تا ۱۰۰)، زمر (۱۰) اور عنکبوت (۵۳) ایک صورت جہاد فی سبیل اللہ ہے جس میں مجاہد گھر سے نکل کر آرام و آسائش ترک کرکے اللہ کا نام بلند کرنے کے لیے اللہ کی زمین کے مشکل سے مشکل اور خوبصورت سے خوبصورت مقامات پر پھرتا ہے اور ہر جگہ اللہ کا بول بالا کرتا ہے۔ ابوامامہ رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے کہا : ’’یا رسول اللہ! مجھے سیاحت کی اجازت دیجیے۔‘‘ نبی صلی اللہ علیہ وسلم نے فرمایا : [ اِنَّ سِيَاحَةَ اُمَّتِي الْجِهَادُ فِيْ سَبِيْلِ اللّٰهِ عَزَّ وَجَلَّ ] [أبوداوٗد، الجھاد، باب فی النھی عن السیاحۃ : ۲۴۸۶، و صححہ الألبانی ]’’میری امت کی سیاحت جہاد فی سبیل اللہ ہے۔‘‘ بعض علماء کے مطابق {’’ السَّآىِٕحُوْنَ‘‘ } میں وہ طالب علم بھی آ جاتے ہیں جو اللہ کا دین سیکھنے کے لیے شہر بہ شہر سفر کرتے ہیں۔ ایک صورت {’’ السَّآىِٕحُوْنَ‘‘} کی روزہ کی ہے کہ اس میں انسان تمام گناہ چھوڑنے کے ساتھ اپنی سب سے زیادہ مرغوب تین چیزیں کھانا پینا اور بیوی سے مباشرت ترک کر دیتا ہے۔ {’’السَّآىِٕحُوْنَ‘‘} کا معنی ’’روزہ رکھنے والے‘‘ ابن عباس، ابن مسعود رضی اللہ عنھم اور کئی تابعین سے آیا ہے۔(ابن کثیر) ابوہریرہ رضی اللہ عنہ سے ایک روایت میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلسَّائِحُوْنَ هُمُ الصَّائِمُوْنَ ] ’’سائحون روزہ دار ہی ہیں۔‘‘ مستدرک وغیرہ مگر شیخ البانی رحمہ اللہ نے سلسلہ ضعیفہ (۳۷۲۹) میں اسے ضعیف قرار دیا ہے۔ ¤ شاہ عبد القادر رحمہ اللہ فرماتے ہیں کہ بے تعلق رہنا روزہ ہے یا ہجرت ہے یا دل نہ لگانا دنیا کے مزوں میں۔ (موضح) {’’ السَّآىِٕحُوْنَ ‘‘} کے لغوی معنی اور صحیح حدیث کو مدنظر رکھیں تو ہجرت یا جہاد اور اعلائے دین کے لیے یا دوسرے نیک مقاصد کے لیے زمین میں پھرنے والے ہی اس کا اصل مصداق ٹھہرتے ہیں۔ پاسپورٹ اور ویزا کا نظام کفار نے مسلمانوں کی اس خصوصیت کو ختم کرنے ہی کے لیے اپنے اور مسلمانوں کے ملکوں میں نافذ کروا دیا ہے، کیونکہ سفر کے ذریعے ہی سے ہجرت، جہاد، طلب علم، تبلیغ دین، تجارت اور بے شمار فوائد حاصل ہوتے ہیں جو اس وقت تک حاصل رہے جب تک مسلمان ساری زمین پر پھرتے رہے اور اس قوت سے سرفراز رہے۔ جب وہ گھروں میں بیٹھ گئے اور آرام طلبی اختیار کی تو کفار کی مراد بر آئی۔ ¤ ➎ {الرّٰكِعُوْنَ السّٰجِدُوْنَ:} اس کے اولین مصداق تو وہ ہیں جو فرض نمازوں کے علاوہ نوافل بھی ادا کرتے ہیں، جن کے متعلق کفار نے بھی شہادت دی : {’’هُمْ بِاللَّيْلِ رُهْبَانٌ وَبِالنَّهَارِ فُرْسَانٌ‘‘} کہ وہ رات کو راہب اور دن کو شاہ سوار ہوتے ہیں۔ ورنہ کم از کم فرض نمازوں کے پابند ہونا تو اس کے لیے بنیادی چیز ہے۔ ترک نماز کے ساتھ اپنے آپ کو جنت کے سوداگر سمجھنا اپنی جان کو دھوکا دینے کے سوا کچھ نہیں۔ ¤ ➏ {الْاٰمِرُوْنَ بِالْمَعْرُوْفِ … :} یعنی دوسروں کو نیکی کا حکم دے کر اور برائی سے منع کرکے کفار کو مسلمان بنانے والے اور مسلمانوں کو اسلام پر عمل کی تاکید کرنے والے اور صرف دوسروں ہی کو نہیں خود بھی اللہ کی ہر حد کی پابندی اور ہر حکم کی اطاعت کرنے والے۔ {’’ الْمُؤْمِنِيْنَ ‘‘} میں الف لام کی وجہ سے ’’ان مومنوں کو‘‘ ترجمہ کیا ہے کہ خوش خبری کے حق دار ان صفات کے حامل مومن ہیں، فقط دعویٰ رکھنے والے نہیں۔"
    },
    {
      "ayah": 113,
      "tafsir": "(آیت 113) ➊ {مَا كَانَ لِلنَّبِيِّ وَ الَّذِيْنَ اٰمَنُوْۤا …:} ابتدائے سورت سے لے کر یہاں تک مشرکین اور منافقین سے کلی طور پر تعلق ختم کرنے کے اعلان و اظہار کا حکم دیا ہے۔ اب یہاں بتایا کہ جس طرح ان کے زندوں سے لاتعلقی کا اظہار ضروری ہے اسی طرح ان کے مردوں سے براء ت کا اظہار بھی لازم ہے اور ان کے لیے بخشش کی دعا کرنا جائز نہیں۔ مسیب بن حزن رضی اللہ عنہ فرماتے ہیں کہ جب ابوطالب کی وفات کا وقت آیا، رسول اللہ صلی اللہ علیہ وسلم اس کے پاس آئے تو اس کے پاس ابوجہل بن ہشام اور عبد اللہ بن ابی امیہ بن مغیرہ کو پایا۔ رسول اللہ صلی اللہ علیہ وسلم نے ابوطالب سے کہا : ’’اے چچا! تو {’’لا اله الا الله‘‘} کہہ دے، میں اللہ کے پاس اس کلمے کی شہادت دوں گا۔‘‘ تو ابوجہل اور عبد اللہ بن ابی امیہ نے ابوطالب سے کہا : ’’کیا تو عبد المطلب کے دین سے منہ موڑ رہا ہے؟‘‘ رسول اللہ صلی اللہ علیہ وسلم اس کے سامنے یہی (کلمہ) پیش کرتے رہے اور وہ دونوں اپنی بات دہراتے رہے، یہاں تک کہ مرتے وقت آخری بات جو اس نے کہی : [عَلٰی مِلَّةِ عَبْدِ الْمُطَّلِبِ ] کہ میں عبد المطلب کے دین پر مر رہا ہووں۔ اس نے ’’لا الٰہ الا اللہ‘‘ کہنے سے انکار کر دیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ کی قسم! میں تیرے لیے استغفار کرتا رہوں گا جب تک مجھے منع نہ کر دیا گیا۔‘‘ اس پر یہ آیت اتری۔ [ بخاری، الجنائز، باب إذا قال المشرک عند الموت لا إلٰہ إلا اللہ : ۱۳۶۰۔ مسلم : ۲۴ ] دوسری کتب حدیث میں بھی یہ حدیث موجود ہے۔ اس حدیث میں ابوطالب کے ’’لا الٰہ الا اللہ‘‘ کہنے سے انکار کی صراحت موجود ہے اور جو لوگ کہتے ہیں کہ دینِ عبد المطلب دینِ ابراہیم ہی تھا، اس لیے ابوطالب مسلمان تھے، ان کی بات کی حقیقت بھی واضح ہوتی ہے۔ ابوطالب کے کفر پر مرنے کی وجہ سے رسول اللہ صلی اللہ علیہ وسلم کو بے حد غم اور صدمہ ہوا، اس پر یہ آیت اتری : «{ اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ وَ لٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَآءُ وَ هُووَ اَعْلَمُ بِالْمُهْتَدِيْنَ }» [ القصص : ۵۶ ] ’’بے شک تو ہدایت نہیں دیتا جسے تو دوست رکھے اور لیکن اللہ ہدایت دیتا ہے جسے چاہتا ہے اور وہ ہدایت پانے والوں کو زیادہ جاننے والا ہے۔‘‘ ¤ عبد اللہ بن عباس رضی اللہ عنھما راوی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جہنم میں سب سے ہلکا عذاب ابوطالب کو ہو گا، اسے (آگ کی) دو جوتیاں پہنائی جائیں گی جن کی وجہ سے اس کا دماغ کھول رہا ہو گا۔“ [ مسلم، الإیمان، باب أھون أہل النار عذابا : ۲۱۲ ] ¤ ➋ { مِنْۢ بَعْدِ مَا تَبَيَّنَ لَهُمْ …:} جب تک کوئی کافر زندہ ہے اس کے ایمان کی امید ہے، اس لیے اس کی ہدایت اور مغفرت کی دعا جائز ہے، اس لیے رسول اللہ صلی اللہ علیہ وسلم کو اس کے لیے دعائے مغفرت سے منع نہیں کیا گیا، البتہ جب کفر پر موت کے بعد صاف واضح ہو گیا کہ وہ جہنمی ہے، اب نبی کریم صلی اللہ علیہ وسلم یا ایمان والوں کو اس کے لیے بخشش کی دعا کرنا جائز نہیں، کیونکہ مشرک پر اللہ نے جنت حرام کر دی ہے۔ دیکھیے سورۂ نساء (۴۸) اور مائدہ (۷۲) ابوہریرہ رضی اللہ عنہ راوی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی والدہ کی قبر کی زیارت کی، آپ خود بھی روئے اور اپنے اردگرد والوں کو بھی رلایا، پھر آپ نے فرمایا : ’’میں نے اپنے رب سے اجازت مانگی کہ اس کے لیے استغفار کروں مگر مجھے اجازت نہیں دی گئی اور میں نے اس سے اجازت مانگی کہ اس کی قبر کی زیارت کر لوں تو مجھے اجازت دے دی گئی، سو تم قبروں کی زیارت کیا کرو، کیونکہ وہ آخرت کی یاد دلاتی ہیں۔‘‘ [ مسلم، الجنائز، باب استئذان النبی صلی اللہ علیہ وسلم ربہ عزوجل… : 976/108 ] مسند احمد وغیرہ میں اس مفہوم کی اور بھی احادیث ہیں۔ حافظ ابن حجر عسقلانی رحمہ اللہ بخاری کی شرح فتح الباری میں لکھتے ہیں کہ یہ سارے واقعات نزول آیت کا سبب بن سکتے ہیں۔ مگر جن روایات میں مذکور ہے کہ آپ صلی اللہ علیہ وسلم کے والدین کو زندہ کیا گیا اور وہ ایمان لا کر پھر فوت ہو گئے ان روایات میں سے کوئی ایک بھی حافظ ابن کثیر اور دوسرے محققین کی تصریح کے مطابق ثابت نہیں۔"
    },
    {
      "ayah": 114,
      "tafsir": "(آیت 114) ➊ {وَ مَا كَانَ اسْتِغْفَارُ اِبْرٰهِيْمَ لِاَبِيْهِ … :} علی رضی اللہ عنہ سے روایت ہہے کہ میں نے ایک آدمی کو سنا کہ وہ اپنے ماں باپ کے لیے استغفار کر رہا تھا، جب کہ وہ مشرک تھے۔ میں نے کہا تم ان کے لیے بخشش کی دعا کر رہے ہو جب کہ وہ مشرک تھے، تو اس نے کہا، کیا ابراہیم علیہ السلام نے اپنے باپ کے لیے استغفار نہیں کیا تھا؟ چنانچہ میں نبی صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے یہ بات ذکر کی تو یہ آیت نازل ہوئی : «{ وَ مَا كَانَ اسْتِغْفَارُ اِبْرٰهِيْمَ لِاَبِيْهِ اِلَّا عَنْ مَّوْعِدَةٍ وَّعَدَهَاۤ اِيَّاهُ }» ’’اور ابراہیم کا اپنے باپ کے لیے بخشش مانگنا نہیں تھا مگر اس وعدہ کی وجہ ہے جو اس نے اس سے کیا تھا۔‘‘ [ نسائی، الجنائز، باب النہی عن الاستغفار للمشرکین : ۲۰۳۸، و حسنہ الألبانی ]ابراہیم علیہ السلام نے اپنے مشرک باپ سے یہ وعدہ اس وقت کیا تھا جب اس نے انھیں توحید کی دعوت کی وجہ سے گھر سے نکال دیا تھا۔ دیکھیے سورۂ مریم (۴۷) چنانچہ حسبِ وعدہ ابراہیم علیہ السلام نے اپنے باپ کے لیے دعائے مغفرت کی۔ دیکھیے سورۂ شعراء (۸۶) قیامت کو بھی سفارش کریں گے کہ یا اللہ! میرے باپ کے جہنم میں ہونے سے زیادہ میری کیا رسوائی ہے تو حکم ہو گا کہ اپنے پاؤں کی طرف دیکھو، دیکھیں گے تو ان کے والد کی شکل گندگی میں آلودہ بجو کی بنا دی جائے گی اور فرشتے اسے پاؤں سے پکڑ کر جہنم میں پھینک دیں گے کہ نہ کوئی اسے پہچانے کہ یہ ابراہیم علیہ السلام کا والد ہے اور نہ ان کی رسوائی ہو۔ اللہ تعالیٰ نے اپنے خلیل کو رسوائی سے بچا لیا مگر مشرک کو جہنم سے نہیں بچایا۔ [دیکھیے بخاری، أحادیث الأنبیاء، باب قول اللہ تعالٰی : «واتخذ اللہ إبراھیم خلیلا … » : ۳۳۵۰ ] ¤ ➋ { فَلَمَّا تَبَيَّنَ لَهٗۤ اَنَّهٗ عَدُوٌّ لِّلّٰهِ تَبَرَّاَ مِنْهُ:} یعنی قیامت کے دن سفارش کے بعد اس کے ساتھ اللہ تعالیٰ کے سلوک کو دیکھ کر جب انھیں اپنے والد کا ابدی جہنمی، شرف انسانیت سے محروم اور اللہ تعالیٰ کا دشمن ہونا خوب واضح ہو گیا تو وہ اس سے بری اور لاتعلق ہو گئے، کیونکہ اللہ تعالیٰ کا خلیل اپنے خلیل کے دشمن سے دوستی یا تعلق کیسے رکھ سکتا ہے، چنانچہ ان کے دل میں جو تعلق باقی تھا وہ بھی ختم ہو گیا۔ ¤ ➌ اگر کسی کا کوئی کافر رشتے دار یا دوست فوت ہو جائے تو مسلمان اس کی تجہیز و تکفین میں شریک تو ہو سکتا ہے، مگر اس کے لیے دعائے مغفرت نہیں کر سکتا۔ (ابن کثیر) ¤ ➍ { اِنَّ اِبْرٰهِيْمَ لَاَوَّاهٌ حَلِيْمٌ: ’’ لَاَوَّاهٌ ‘‘} کا معنی بہت آہ وزاری کرنے والا ہے اور یہ دل کی نرمی کی علامت ہے، یعنی وہ اللہ کے حضور بہت آہیں بھرنے والے، بڑے حلم والے تھے۔ یہ ابتدا میں اپنے والد کے حق میں ان کی نرمی اور استغفار کی وجہ بیان فرمائی ہے کہ ابراہیم علیہ السلام تھے ہی ایسے کہ اگر کوئی سختی سے پیش آتا تو اسے نرمی سے جواب دیتے۔"
    },
    {
      "ayah": 115,
      "tafsir": "(آیت 115) {وَ مَا كَانَ اللّٰهُ لِيُضِلَّ قَوْمًۢا …:} اس میں ان مسلمانوں کو تسلی دی ہے جنھوں نے اوپر کی آیت کے نزول سے پہلے اپنے کافر رشتہ داروں کے لیے دعائے مغفرت کی تھی۔ مطلب یہ ہے کہ اللہ تعالیٰ کسی پر اس کے مسلمان ہونے کے بعد گمراہ ہونے کا حکم نہیں لگاتا جب تک اس کے لیے یہ واضح نہ کر دے کہ فلاں کام منع ہے اس سے بچ جاؤ، اگر پھر بھی وہ اس پر اصرار کرے تو گناہ گار بھی ہے اور شامتِ اعمال کے نتیجے میں اس کا رخ بھی گمراہی کی طرف پھیر دیا جاتا ہے۔ معلوم ہوا جانتے ہوئے نافرمانی گمراہی کا سبب بن سکتی ہے، اگر ابھی کسی کام سے منع ہی نہیں کیا گیا تو اس کے ارتکاب پر اللہ تعالیٰ کبھی گرفت کرنے والا نہیں، کیونکہ وہ خوب جانتا ہے کہ کوئی بھی کام کرنے والا اسے لاعلمی میں کر رہا ہے یا دیدہ و دانستہ، لہٰذا رسول اللہ صلی اللہ علیہ وسلم اور صحابہ نے پہلے جو استغفار مشرکین کے لیے کیا اس پر کوئی مؤاخذہ نہیں۔"
    },
    {
      "ayah": 116,
      "tafsir": "(آیت 116){ اِنَّ اللّٰهَ لَهٗ مُلْكُ السَّمٰوٰتِ … : } کفار سے ان کی زندگی میں اور ان کی موت کے بعد ہر طرح کی دلی لاتعلقی کا سبب بیان فرمایا کہ آسمانوں کا اور زمین کا مالک صرف اللہ، زندگی بخشنے والا اور موت دینے والا صرف ف اللہ، تمھارا والی وارث اور تمھارے تمام کاموں کا متولی اور سنبھالنے والا صرف اللہ، مشکل کے وقت اور دشمن کے مقابلے میں تمھارا مددگار صرف اللہ، اس کے سوا تمھارا نہ کوئی والی نہ مددگار، تو پھر اس کے دشمن سے تمھارا کیا تعلق، کیسی دوستی اور اس کے لیے کیسا استغفار ؟"
    },
    {
      "ayah": 117,
      "tafsir": "(آیت 117) {لَقَدْ تَّابَ اللّٰهُ عَلَى النَّبِيِّ …: ’’ تَابَ ‘‘} کے معانی لوٹ آنا، مہربان ہو جانا، معافی مانگنا، معاف کر دینا، آئندہ غلطی سے باز آنا اور توبہ قبول کر لینا سبھی آتے ہیں۔ اس آیت میں اللہ تعالیٰ کے اپنے رسول صلی اللہ علیہ وسلم پر اور مہاجرین و انصار پر مہربان ہونے اور معاف فرمانے کا مطلب {’’ فِيْ سَاعَةِ الْعُسْرَةِ ‘‘ } کے الفاظ سے سمجھ میں آتا ہے۔ تنگی کی گھڑی سے مراد غزوۂ تبوک پر روانگی کا وقت ہے جب شدید گرمی کا موسم تھا، قحط سالی تھی، فصلیں پکنے والی تھیں اور بے سروسامانی کی حالت تھی، ادھر چھ سو کلو میٹر کا طویل اور پر مشقت سفر سامنے تھا۔ دس آدمیوں کے لیے صرف ایک اونٹ تھا، سواریوں، زادِ راہ اور پانی تینوں کی سخت تنگی تھی۔ چنانچہ اس وقت بعض سچے مخلص مسلمان بھی جہاد پر روانہ ہونے سے گھبرانے لگے، آخر ان کے ایمان کی پختگی ان کے نفس پر غالب آئی اور وہ پورے عزم کے ساتھ جہاد پر نکل کھڑے ہوئے۔ یہاں اللہ کی مہربانی سے مراد یہ ہے کہ اللہ نے اس گھبراہٹ کے عالم میں انھیں روانگی کے لیے ہمت و جرأت عطا فرمائی اور ان کے دل میں آنے والے خطرات بھی معاف فرما دیے اور نبی صلی اللہ علیہ وسلم پر مہربانی سے مراد وہ آیت (۴۳) ہے جس کا آغاز ہی اس طرح ہوا تھا : «{ عَفَا اللّٰهُ عَنْكَ لِمَ اَذِنْتَ لَهُمْ }» کہ اللہ نے آپ کو معاف فرما دیا، آپ نے ایسے ہٹے کٹے، تنومند اور کھاتے پیتے منافقوں کو جہاد سے پیچھے رہنے کی رخصت کیوں دی؟"
    },
    {
      "ayah": 118,
      "tafsir": "(آیت 118) ➊ {وَ عَلَى الثَّلٰثَةِ الَّذِيْنَ خُلِّفُوْا … : ’’ خُلِّفُوْا ‘‘} کا لفظی معنی اگرچہ پیچھے چھوڑے گئے ہے، مگر یہاں مراد یہ ہے کہ جن کا فیصلہ مؤخر کر دیا گیا۔ اسی بات کا تذکرہ اس سے پہلے آیت (۱۰۷) «{ وَ اٰخَرُوْنَ مُرْجَوْنَ لِاَمْرِ اللّٰهِ }» میں گزرا ہے۔ {’’ وَ عَلَى الثَّلٰثَةِ ‘‘} کا عطف {’’ عَلَى النَّبِيِّ ‘‘ } پر ہے (یعنی انصار و مہاجرین پر مہربان ہونے اور انھیں معاف کرنے میں) وہ تین شخص بھی داخل ہوئے جن پر پچاس دن میں ایسی حالت گزری کہ موت سے بھی بدتر۔ (موضح) یہ تین صحابہ تھے کعب بن مالک، مرارہ بن ربیع اور ہلال بن امیہ رضی اللہ عنھم ، اس سے قبل تقریباً ہر غزوے میں یہ شریک ہوتے رہے، اس غزوۂ تبوک میں صرف سستی کی وجہ سے شریک نہیں ہو سکے، بعد میں انھیں اپنی غلطی کا احساس ہوا تو سوچا کہ ایک غلطی (پیچھے رہنے کی) تو ہو ہی گئی ہے، لیکن اب منافقین کی طرح رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں جھوٹا عذر پیش کرنے کی غلطی نہیں کریں گے۔ چنانچہ حاضر خدمت ہو کر اپنی غلطی کا صاف اعتراف کر لیا اور اس کی سزا کے لیے اپنے آپ کو پیش کر دیا۔ نبی صلی اللہ علیہ وسلم نے انن کے معاملے کو اللہ تعالیٰ کے سپرد کر دیا کہ وہی ان کے بارے میں کوئی حکم نازل فرمائے گا، تاہم اس دوران میں آپ نے تمام صحابہ کو ان سے بائیکاٹ کا حکم دے دیا، حتیٰ کہ بات چیت تک سے روک دیا اور چالیس راتوں کے بعد حکم دیا کہ وہ اپنی بیویوں سے بھی دور رہیں۔ یہ وہ وقت تھا جس کا نقشہ اللہ تعالیٰ نے تین جملوں میں کھینچا ہے کہ زمین اپنی وسعت کے باوجود ان پر تنگ ہو گئی اور خود ان کی جانیں ان پر تنگ ہو گئیں اور انھوں نے یقین کر لیا کہ بے شک اللہ سے پناہ کی کوئی جگہ اس کی جناب کے سوا نہیں۔ آخر مزید دس دن گزرنے کے بعد ان کی توبہ قبول کر لی گئی اور مذکورہ آیت اتری۔ کعب بن مالک رضی اللہ عنہ نے یہ واقعہ نہایت فصاحت و بلاغت کے ساتھ اپنی قلبی کیفیت کی بہترین ترجمانی کرتے ہوئے بڑی لمبی حدیث میں بیان فرمایا ہے جو صحیح بخاری کی کتاب المغازی اور مسلم کی کتاب التوبہ میں مذکور ہے۔ تفسیر ابن کثیر میں بھی اسے مفصل نقل کیا گیا ہے۔ ¤ ➋ { اِنَّ اللّٰهَ هُوَ التَّوَّابُ الرَّحِيْمُ:} معلوم ہوا کہ توبہ کا قبول ہونا محض اللہ تعالیٰ کا فضل و کرم ہے، ورنہ اس پر کسی کا زور نہیں۔"
    },
    {
      "ayah": 119,
      "tafsir": "(آیت 119) {وَ كُوْنُوْا مَعَ الصّٰدِقِيْنَ:} یہ صادقین رسول اللہ صلی اللہ علیہ وسلم اور آپ کے مخلص صحابہ کرام رضی اللہ عنھم ہیں۔ صدق نیت، قول اور فعل تینوں میں ہو تو صدق ہے، ورنہ فعل قول کی تکذیب کرے تو یہ بھی صدق نہیں، اس لیے جو لوگ اپنے اخلاص نیت اور قول کے مطابق عملاً تبوک کی طرف نکلے بھی وہی صادقین ٹھہرے اور ان کا ساتھ دینے کا حکم دیا گیا۔ ان تینوں نے بھی سچ کہا، اپنی خطا مانی اس لیے بخشے گئے، نہیں تو منافقین میں ملتے۔ (موضح) اللہ تعالیٰ نے سچے مومن قرار ہی ان لوگوں کو دیا ہے جو ایمان لانے کے بعد شک میں مبتلا نہیں ہوئے اور اپنے مالوں اور جانوں کے ساتھ اللہ کی راہ میں جہاد کیا، فرمایا کہ صادق صرف یہی لوگ ہیں۔ دیکھیے سورۂ حجرات (۱۵) اور سورۂ حشر (۸) کعب بن مالک رضی اللہ عنہ کا بیان ہے کہ مسلمان ہونے کے بعد اللہ تعالیٰ کا سب سے بڑا انعام مجھ پر یہ ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے سچ بولا، ورنہ میں بھی جھوٹ بول کر ہلاک ہو جاتا جس طرح دوسرے ہلاک ہو گئے۔ [بخاری، المغازی، باب حدیث کعب بن مالک رضی اللہ عنہ …: ۴۴۱۸] بلکہ اللہ تعالیٰ نے اس سچ بولنے کے انعام میں ان کی توبہ کا تذکرہ قرآن میں فرمایا جو قیامت تک پڑھا جائے گا۔ عبد اللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’سچ کو لازم پکڑو، کیونکہ سچ نیکی کی طرف لے جاتا ہے اور نیکی جنت کی طرف لے جاتی ہے اور آدمی سچ کہتا رہتا ہے اور سچ بولنے کی کوشش کرتا رہتا ہے، حتیٰ کہ اللہ کے ہاں صدیق لکھ دیا جاتا ہے اور جھوٹ سے بچ جاؤ، کیونکہ جھوٹ نافرمانی کی طرف لے جاتا ہے اور نافرمانی آگ کی طرف لے جاتی ہے اور آدمی جھوٹ کہتا رہتا ہے اور جھوٹ کی کوشش کرتا رہتا ہے، یہاں تک کہ اللہ تعالیٰ کے ہاں کذاب لکھ دیا جاتا ہے۔‘‘ [ بخاری، الأدب، باب قول اللہ تعالٰی : « یأیھا الذین اٰمنوا اتقوا اللہ …» : ۶۰۹۴۔ مسلم : ۲۶۰۷ ]"
    },
    {
      "ayah": 120,
      "tafsir": "(آیت 120) ➊ {مَا كَانَ لِاَهْلِ الْمَدِيْنَةِ … : } مدینہ میں رہنے والے لوگوں اور ان کے اردگرد رہنے والے بدویوں یعنی مزینہ، جہینہ، اشجع، اسلم اور غفار وغیرہ قبائل کے لوگوں کو حکم دیا گیا کہ تنگی اور تکلیف میں بھی آپ صلی اللہ علیہ وسلم کے ساتھ رہیں اور مشکل مواقع پر پیش آنے والے تمام مصائب و آلام میں خوش دلی کے ساتھ آپ کے ہمراہ رہیں، جو سختیاں آپ صلی اللہ علیہ وسلم اٹھا رہے ہیں وہ بھی اٹھائیں، کیونکہ وہ خوب جانتے ہیں کہ اللہ تعالیٰ کے ہاں سب سے زیادہ عزیز اور مکرم آپ صلی اللہ علیہ وسلم ہی ہیں، تو جب آپ اتنی عزت و کرامت کے باوجود ان سختیوں اور مشکلات کا سامنا کر رہے ہیں تو پھر سب کا حق ہے کہ جن چیزوں کا سامنا آپ کر رہے ہیں وہ بھی کریں اور آپ کی جان عزیز کی خاطر اپنی جانوں کی نہ پروا کریں، نہ ان کی کوئی قدر وقیمت سمجھیں، کجا یہ کہ رسول اللہ صلی اللہ علیہ وسلم تو اپنی جان اور اپنا راحت و آرام سب کچھ قربانی کے لیے پیش کریں اور یہ اپنی جانیں بچا بچا کر رکھیں، یہ کبھی بھی ان کا حق نہیں بنتا۔ (زمخشری) عبد اللہ بن ہشام رضی اللہ عنہ فرماتے ہیں کہ ہم نبی صلی اللہ علیہ وسلم کے ساتھ تھے، آپ نے عمر بن خطاب رضی اللہ عنہ کا ہاتھ پکڑا ہوا تھا تو عمر رضی اللہ عنہ نے آپ سے کہا : ’’یا رسول اللہ! یقینا آپ مجھے ہر چیز سے زیادہ محبوب ہیں، سوائے میری جان کے۔‘‘ تو نبی صلی اللہ علیہ وسلم نے فرمایا : ’’نہیں! اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! یہاں تک کہ میں تمھیں تمھاری جان سے بھی زیادہ محبوب ہو جاؤں۔‘‘ تو عمر رضی اللہ عنہ نے کہا : ’’تو پھر یقین کیجیے کہ اب اللہ کی قسم! آپ مجھے میری جان سے بھی زیادہ محبوب ہیں۔‘‘ تو نبی صلی اللہ علیہ وسلم نے فرمایا : ’’اب اے عمر! (تو کامل مومن ہوا)۔‘‘ [ بخاری، الأیمان والنذور، باب کیف کان یمین النبی صلی اللہ علیہ وسلم : ۶۶۳۲ ] ¤ ➋ { ذٰلِكَ بِاَنَّهُمْ لَا يُصِيْبُهُمْ ظَمَاٌ وَّ لَا نَصَبٌ … : ’’ ظَمَاٌ ‘‘} پیاس، {’’ نَصَبٌ ‘‘} تھکاوٹ، مشقت، محنت۔ {’’ مَخْمَصَةٌ ‘‘} سخت بھوک جس میں پیٹ ساتھ لگ جائے، جس طرح پاؤں کا تلوا ({اَخْمَصُ} ) ہوتا ہے۔ {’’ وَطِئَ يَطَأُ ‘‘ مَوْطِئًا} (ع)‘‘ ظرف ہے، روندنے، قدم رکھنے کی جگہ۔ {’’غَاظَ يَغِيْظُ‘‘} غصہ دلانا، یعنی جن راستوں، پہاڑیوں، بستیوں، زمینوں، مکانوں اور کھیتوں وغیرہ پر ان کے قدم رکھنے سے یا ان کے گھوڑوں اور دوسری سواریوں کے انھیں روندتے ہوئے گزرنے سے کفار کے دلوں میں غصہ اور جلن پیدا ہو اور وہ ہراساں اور خوف زدہ ہوں۔ (ابن کثیر) {’’ وَ لَا يَنَالُوْنَ ‘‘ ’’نَالَ يَنَالُ‘‘} کا لفظی معنی لینا، حاصل کرنا ہے، یعنی مسلمان دشمن کی کوئی زمین یا شہر فتح کریں، یا انھیں قتل یا قید کریں، یا مال غنیمت حاصل کریں، یا انھیں کوئی نقصان پہنچائیں، غرض ان سے حاصل ہونے والی ہر کامیابی اور ہر نیک عمل لکھ دیا جاتا ہے اور اس کا اجر انھیں ضرور ملے گا، کیونکہ ان کے یہ تمام اعمال اللہ کی خاطر اور رسول اللہ صلی اللہ علیہ وسلم کی فرماں برداری میں ہیں اور اسی کا نام احسان اور نیکی ہے اور اللہ تعالیٰ احسان کرنے والوں کا اجر کبھی ضائع نہیں کرتا۔"
    },
    {
      "ayah": 121,
      "tafsir": "(آیت 121) ➊ {وَ لَا يُنْفِقُوْنَ نَفَقَةً صَغِيْرَةً … :} پچھلی آیت میں جہاد میں کیے جانے والے وہ اعمال بھی ہیں جو انسان کے اختیار میں ہیں اور وہ بھی جو بے اختیار پیش آتے ہیں، مثلاً مشکلات و مصائب، اس آیت میں صرف ان اعمال کا ذکر ہے جو آدمی کے اختیار میں ہیں، مگر جہاد فی سبیل اللہ کی بنیاد ہیں، یعنی زادِ سفر، سواری اور اسلحہ پر جو میسر ہو خرچ کرنا، پھر سفر جہاد پر نکل کھڑے ہونا اور جنگل اور وادیاں طے کرتے چلے جانا، سب کچھ لکھا جاتا ہے۔ ¤ ➋ اس جنگ میں عثمان رضی اللہ عنہ نے لشکر کی تیاری میں سب سے بڑھ کر حصہ لیا، یعنی ’’نفقہ کبیرہ ‘‘(بڑا خرچ) اور انھوں نے اس وقت صحابہ کو مخاطب کرکے اس کا ذکر بھی فرمایا تھا جب باغیوں نے ان کا محاصرہ کیا کہ کیا تم جانتے ہو کہ میں نے {’’جَيْشُ الْعُسْرَةِ‘‘} (تنگ دستی کے وقت کے لشکر) کا سامان تیار کیا تھا؟ تمام صحابہ نے اس کا اعتراف کیا۔ [ ترمذی، المناقب، باب فی عد عثمان تسمیتہ شہیدا… : ۳۶۹۹، وحسنہ الألبانی ] تفصیل اس کی یہ ہے کہ عبد الرحمن بن سمرہ رضی اللہ عنہ فرماتے ہیں کہ عثمان بن عفان رضی اللہ عنہ ایک ہزار دینار اپنی آستین میں لے کر آئے، جب آپ صلی اللہ علیہ وسلم نے {’’جَيْشُ الْعُسْرَةِ‘‘} کو تیار کیا تو اسے آپ صلی اللہ علیہ وسلم کی گود میں ڈال دیا۔ عبد الرحمن بن سمرہ رضی اللہ عنہ فرماتے ہیں کہ پھر میں نے نبی صلی اللہ علیہ وسلم کو دیکھا کہ آپ انھیں اپنی گود میں الٹ پلٹ کرتے تھے اور فرماتے تھے : ’’آج کے بعد عثمان جو کام بھی کرے اسے کچھ نقصان نہیں دے گا۔‘‘ دو مرتبہ فرمایا۔ [ترمذی، المناقب، باب فی عد عثمان تسمیتہ شہیدا… : ۳۷۰۰، ۳۷۰۱، و حسنہ الألبانی] اور کم خرچ کرنے والے (نفقہ صغیرہ) وہ بھی تھے جو رات بھر محنت کرکے نصف صاع (۱ کلو) کھجوریں لے کر آئے۔ دیکھیے سورۂ توبہ آیت (۷۹) کی تفسیر۔ ¤ ➌ {وَ لَا يَقْطَعُوْنَ وَادِيًا اِلَّا كُتِبَ لَهُمْ:} پہاڑوں کے درمیان کے میدان اور پانی کی گزرگاہ کو وادی کہتے ہیں، یعنی ہر وادی طے کرنے پر وہ ان کے نامۂ اعمال میں لکھ دی جاتی ہے۔ ¤ ➍ { لِيَجْزِيَهُمُ اللّٰهُ اَحْسَنَ … :} یہ سب کچھ اس لیے لکھا جاتا ہے کہ کسی بھی عمل کی زیادہ سے زیادہ اچھی جزا جو ہو سکتی ہے اللہ تعالیٰ انھیں وہ عطا فرمائے۔"
    },
    {
      "ayah": 122,
      "tafsir": "(آیت 122) {وَ مَا كَانَ الْمُؤْمِنُوْنَ لِيَنْفِرُوْا كَآفَّةً … : ’’ نَفَرَ يَنْفِرُ ‘‘} عام طور پر لڑائی کے لیے نکلنے کے معنی میں آتا ہے، جیسا کہ فرمایا : «{ مَا لَكُمْ اِذَا قِيْلَ لَكُمُ انْفِرُوْا فِيْ سَبِيْلِ اللّٰهِ اثَّاقَلْتُمْ اِلَى الْاَرْضِ }» [ التوبۃ : ۳۸ ] اور فرمایا : «{ اِنْفِرُوْا خِفَافًا وَّ ثِقَالًا }» [ التوبۃ : ۴۱ ] اور فرمایا : «{ اِلَّا تَنْفِرُوْا يُعَذِّبْكُمْ }» [ التوبۃ : ۳۹ ] اور فرمایا : «{ وَ قَالُوْا لَا تَنْفِرُوْا فِي الْحَرِّ }» [ التوبۃ : ۸۱ ] اور یہ سورت شروع سے آخر تک جہاد ہی کے تذکرے سے بھری پڑی ہے، اس لیے {’’ لِيَنْفِرُوْا ‘‘} کا معنی ’’لڑائی کے لیے نکلیں‘‘ ہی سیاق سے مناسبت رکھتا ہے۔ جنگ تبوک میں نفیر عام، یعنی تمام مسلمانوں کو نکلنے کا حکم تھا اور فرمایا کہ اہل مدینہ اور اس کے اردگرد کے اعراب کا حق ہی نہیں بنتا تھا کہ وہ جنگ میں رسول اللہ صلی اللہ علیہ وسلم سے پیچھے رہیں، اب اس آیت میں ایسے مواقع کا ذکر ہے جن میں سب کے نکلنے کا حکم نہیں، بلکہ کچھ لوگوں کا نکلنا کافی ہے۔ چنانچہ فرمایا کہ یہ ممکن ہی نہیں کہ تمام مسلمان جنگ کے لیے نکل جائیں، کیونکہ کچھ لوگوں کا شہروں کی حفاظت اور گھروں کے انتظام کے لیے پیچھے رہنا بھی ضروری ہے، کچھ لوگ کسی اور ضروری عذر کی وجہ سے نہیں نکل سکتے، اس لیے ہر بڑے گروہ میں سے جنگ کی ضرورت کے حساب سے کچھ لوگوں کے لیے لازم ہے کہ جہاد کے لیے نکلیں، تاکہ وہ جہاد کے سفر، اس کے درمیان پڑاؤ، رباط کے دوران اور میدان قتال میں پوری کوشش کے ساتھ دین کی سمجھ حاصل کریں اور واپس آکر اپنی قوم کو ڈرائیں کہ دشمن کیا کیا منصوبے بنا رہا ہے اور اس کی تیاری کس قدر ہے اور اس سے نمٹنے کی کیا صورت ہے، تاکہ وہ آئندہ کے لیے مکمل تیاری کرکے دشمن پر فتح یاب ہو سکیں۔ {’’تفقه في الدين‘‘} سے یہاں مراد یہ ہے جو بیان ہوا، جب کہ اس وقت ہمارے ہاں ’’تفقہ فی الدین‘‘ صرف نماز، روزے وغیرہ کے مسائل ہی کو سمجھ لیا گیا ہے، دشمن کے منصوبوں، سازشوں، چالوں اور کار روائیوں کو سمجھنے، ان سے بچنے اور دفاع کے بجائے ان پر حملہ آور ہونے کو ’’تفقہ فی الدین‘‘ سے باہر قرار دے دیا گیا ہے۔ ¤ اس آیت سے چند باتیں واضح طور پر سمجھ میں آ رہی ہیں : (1) ہر جنگ میں تمام مسلمانوں کا نکلنا نہ ضروری ہے نہ ممکن، بلکہ تقسیم کار کے اصول پر عمل ہو گا، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے بنولحیان کی طرف ایک لشکر بھیجتے ہوئے فرمایا : ’’ہر دو آدمیوں میں سے ایک آدمی نکلے اور اجر دونوں کے لیے برابر ہے (تاکہ ایک میدان میں جائے اور دوسرا اپنے اور اپنے بھائی کے پیچھے کے معاملات کی خیر کے ساتھ نگرانی کرے)۔‘‘ [ مسلم، الإمارۃ، باب فضل إعانۃ الغازی… : 1896/138 ] ہاں، اگر ضرورت کی بنا پر امیر نفیر عام کا حکم دے تو سب کا نکلنا ضروری ہو گا۔ (2) فرقہ بڑا ہوتا ہے اور طائفہ چھوٹا، حتیٰ کہ ایک آدمی پر بھی طائفہ کا لفظ بولا جاتا ہے، جیسا کہ فرمایا : «{ وَ اِنْ طَآىِٕفَتٰنِ مِنَ الْمُؤْمِنِيْنَ اقْتَتَلُوْا }» [ الحجرات : ۹ ] یہ آیت دو لڑنے والے آدمیوں کے لیے بھی ہے، کسی گروہ میں سے جنگ کے لیے زیادہ لوگ نکلیں یا ایک آدمی، سب پر طائفہ کا لفظ صادق آتا ہے۔ ¤ (3) {’’ لِيَتَفَقَّهُوْا فِي الدِّيْنِ ‘‘} تفقہ باب تفعل سے ہے، مراد کوشش اور محنت کے ساتھ اچھی طرح سمجھ حاصل کرنا ہے۔ یہاں دین کے دو معنی مراد ہو سکتے ہیں، ایک تو قتال فی سبیل اللہ یعنی اللہ کے راستے میں لڑنا، جیسا کہ ابن عمر رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جب تم عینہ (حیلے کے ساتھ سود کی ایک صورت) کے ساتھ بیع کرنے لگو گے اور کھیتی باڑی پر خوش ہو جاؤ گے اور جہاد چھوڑ دو گے تو اللہ تعالیٰ تم پر ایسی ذلت مسلط کرے گا جسے دور نہیں کرے گا [ حَتّٰی تَرْجِعُوْا اِلٰی دِيْنِكُمْ ] ’’یہاں تک کہ تم اپنے دین کی طرف واپس پلٹ آؤ۔‘‘ [ أبوداوٗد، البیوع، باب فی النھی عن العینۃ : ۳۴۶۲، و صححہ الألبانی ] یہاں دین سے مراد قتال فی سبیل اللہ ہے، اس میں تفقہ جنگ کے میدانوں ہی میں حاصل ہو سکتا ہے۔ سو سال تک شیخ الحدیث کی مسند پر بیٹھے رہیں کبھی یہ تفقہ حاصل نہیں ہو گا، آپ اپنے گھر یا سکول یا کالج یا یونیورسٹی یا اکیڈمی یا دار العلوم میں جتنی بھی جنگی کتابیں اور دشمن کی چالیں پڑھ لیں، یا غازیان اسلام کے معرکے پڑھ لیں، میدان جنگ میں جائے بغیر دین (جنگ) کی حقیقی اور واقعی سمجھ کسی صورت حاصل نہیں ہو سکتی، نہ ہی آدمی اپنی قوم کو دشمن کے خطرے سے صحیح طور پر ڈرا کر اس سے بچنے کے لیے خبردار کر سکتا ہے۔ ¤ دین کا دوسرا معنی عام ہے، یعنی پورا دین اسلام، اس میں تفقہ حاصل کرنے کے لیے بھی جہاد کے میدانوں کا رخ کرنا ضروری تھا، کیونکہ دین کے علم کا سرچشمہ رسول اللہ صلی اللہ علیہ وسلم کی ذات گرامی تھی اور آپ مدینہ میں ہجرت کے بعد اکثر جہاد فی سبیل اللہ کے لیے سفر ہی میں رہتے، یا پھر اپنے کسی صاحب علم و فقہ صحابی کو امیر بنا کر بھیجتے تھے۔ بہت سے معجزات اور مسائل و احکام دوران سفر ہی واقع یا نازل ہوئے، اس لیے جب صحابہ کے حالات بیان ہوتے ہیں تو ان کی قابلیت و فضیلت کا ذکر اس طرح ہوتا ہے : {’’شَهِدَ الْمَشَاهِدَ كُلَّهَا‘‘} کہ وہ تمام جنگوں میں حاضر رہے اور کہا جاتا ہے : {’’’’ شَهِدَ الْبَدْرَ اَوِ الْحُدَيْبِيَةَ اَوْ فَتْحَ مَكَّةَ اَوْ حُنَيْنًا اَوْ تَبُوْكَ ‘‘} کہ فلاں صاحب بدر یا حدیبیہ یا فتح مکہ یا حنین یا تبوک میں شریک ہوئے اور یہ بات تو عیاں ہے کہ گھر کے بکھیڑوں میں علم و فقہ کا حصول اس طرح ممکن ہی نہیں جس طرح ہر چیز سے فارغ ہو کر لشکر اسلام میں جا کر ممکن ہے۔ دیکھو مسیلمہ کذاب کی لڑائی میں قرآن کے کتنے قاری اور علماء و فقہاء شہید ہوئے۔ لڑائی تو تھوڑی دیر کے لیے ہوئی تھی، باقی دوران سفر اقامت اور رباط میں تعلیم و تعلّم یعنی تفقہ فی الدین ہی کا شغل ہوتا تھا، جس میں لڑنے کے سلیقے کے ساتھ ساتھ زندگی کے تمام مسائل سیکھے سکھائے جاتے تھے اور سب لوگ رسول اللہ صلی اللہ علیہ وسلم ، ابوبکر، عمر، عشرہ مبشرہ اور دوسرے افاضل صحابہ کرام رضی اللہ عنھم سے دورانِ جہاد میں دین سیکھتے اور واپس اپنی قوم میں جا کر انھیں دوسرے دینی مسائل سکھانے کے ساتھ ساتھ دنیا اور آخرت کی ذلت، ترکِ جہاد سے ڈرا کر انھیں دشمن سے بچنے کی ترغیب دیتے۔ {’’ لِيُنْذِرُوْا ‘‘} اور {’’ يَحْذَرُوْنَ ‘‘} پر غور فرمائیں تو بات کافی حد تک سمجھ میں آ جائے گی کہ اس وقت دنیا میں مسلمانوں کی حالتِ زار کون سی چیز میں تفقہ حاصل نہ کرنے کا نتیجہ ہے۔ ¤ سید المفسرین امام طبری رحمہ اللہ اور کئی اور مفسرین نے اسی مفہوم کو ترجیح دی ہے، البتہ {’’ لِيَتَفَقَّهُوْا فِي الدِّيْنِ ‘‘} میں دین سے جہاد مراد لینے کی دلیل : [ حَتّٰی تَرْجِعُوْا اِلٰی دِيْنِكُمْ ] انھوں نے ذکر نہیں فرمائی۔ ¤ آیت کا دوسرا مفہوم یہ ہے کہ جب سورۂ توبہ میں جنگ تبوک سے رہ جانے والوں پر اللہ تعالیٰ نے سخت ناراضگی کا اظہار فرمایا تو ہر مسلمان کی کوشش اور خواہش یہ تھی کہ آئندہ ہم ہر جنگ میں ضرور جائیں گے، اس پر یہ آیت اتری کہ تمام مسلمانوں کو ہر مہم کے لیے نہیں نکل جانا چاہیے کہ رسول اللہ صلی اللہ علیہ وسلم مدینہ میں اکیلے رہ جائیں، بلکہ ہر قبیلے میں سے کچھ لوگوں کو مدینہ میں آپ کے پاس بھی آ کر حاضر رہنا چاہیے، تاکہ وہ مدینہ کی اور رسول اللہ صلی اللہ علیہ وسلم کی پہرے داری کا فریضہ بھی سرانجام دیں اور علم بھی حاصل کریں اور واپس جا کر اپنی قوم کو تعلیم دین سے آراستہ کریں۔ اسی طرح کچھ لوگوں کو دینی مدارس میں پڑھنے کے لیے بھی نکلنا چاہیے، تاکہ وہ یکسوئی سے دین کی اچھی طرح سمجھ حاصل کریں اور پھر واپس جاکر اپنی قوم کو دین سمجھا سکیں۔ ہاں حالات کے تحت امیر المومنین نفیر عام کا حکم دیں تو پھر سب کو نکلنا چاہیے، کیونکہ جب قیام کا وقت ہو سجدہ نہیں کیا جاتا۔ یہ مطلب بھی بہت سے مفسرین نے بیان فرمایا ہے۔"
    },
    {
      "ayah": 123,
      "tafsir": "(آیت 123) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا قَاتِلُوا الَّذِيْنَ يَلُوْنَكُمْ مِّنَ الْكُفَّارِ:} یعنی کفار میں سے جو لوگ تم سے جتنے زیادہ قریب ہیں اتنا ہی ان سے پہلے جہاد کرو، پہلے انھیں اسلامی قلمرو میں شامل کرنے کے بعد ان سے جہاد کرو جو ان کی بہ نسبت دور ہیں، کیونکہ ہر کام میں آسان سے آسان اور بہتر سے بہتر ہونے کا خیال سب سے پہلے رکھا جاتا ہے۔ اپنی سرحد سے ملنے والوں کے ساتھ لڑائی میں نہ زیادہ سواریوں کی ضرورت ہے نہ زیادہ اخراجات کی، نہ دور کے سفر کی مشقت ہے، نہ ان کے احوال سے باخبر رہنے کے لیے زیادہ محنت اور وسائل کی، کیونکہ آپ ان کے محل وقوع، ان کے مراکز قوت اور ان کی کمزوریوں سے خوب واقف ہیں۔ پھر دور والے دشمن سے لڑائی میں پیچھے سے اپنے ملک پر کسی دشمن کے حملے یا اندرونی خلفشار کا جو خطرہ رہتا ہے قریب والوں کے ساتھ جنگ میں وہ بھی نہیں ہو گا، بلکہ اپنی پشت محفوظ رہے گی۔ بے شک تمام مشرکین سے لڑنے کا حکم ہے، جیسا کہ فرمایا : «{ وَ قَاتِلُوا الْمُشْرِكِيْنَ كَآفَّةً }» [ التوبۃ : ۳۶ ] مگر ترتیب کو ملحوظ رکھنا لازم ہے۔ دعوت میں بھی یہی ترتیب ہے، پہلے گھر والے، پھر خاندان، پھر قبیلہ، پھر شہر، پھر اپنا ملک، پھر تمام دنیا اور جہاد میں بھی یہی ترتیب ہے، کیونکہ جہاد بھی دعوت ہی کا ایک حصہ ہے۔ چنانچہ اسی ترتیب کے ساتھ نبی صلی اللہ علیہ وسلم نے پہلے اپنے خاص قبیلہ قریش سے جنگ کی، پھر جزیرۂ عرب کے دوسرے قبائل سے، پھر بنی قریظہ اور بنی نضیر سے، پھر خیبر اور فدک کے اہل کتاب سے جو مدینہ کے اردگرد تھے، پھر مکہ فتح ہوا اور پھر یمن اور بحرین حتیٰ کہ پورا جزیرۂ عرب مسلمان ہو گیا۔ جب ان سے فارغ ہوئے تو غزوۂ تبوک کی مہم پر ملک شام کے نصاریٰ سے جہاد کے لیے روانہ ہوئے۔ یہی ترتیب آپ کے بعد ابوبکر صدیق رضی اللہ عنہ ، عمر فاروق شہید محراب رضی اللہ عنہ اور دوسرے خلفاء نے ملحوظ رکھی۔ چنانچہ ان کے زمانے میں پہلے ملک شام اور عراق و فارس فتح کیے گئے، پھر مصر، پھر مشرق کی طرف ہند، خراسان، کاشغر (چین) اور مغرب کی طرف افریقہ، اندلس اور فرانس، غرض مشرق سے مغرب تک اسلام کا پھریرا لہرانے لگا۔ والحمد للہ! اللہ تعالیٰ مسلمانوں کو دوبارہ جہاد کے ساتھ کفار کے تسلط کو ختم کرکے اپنے موجودہ ممالک میں اور دنیا بھر کے ممالک میں اللہ کے دین کو غالب کرنے کی توفیق عطا فرمائے۔ (آمین) ¤ ➋ {وَ لْيَجِدُوْا فِيْكُمْ غِلْظَةً:} لازم ہے کہ تم حملہ کرو تو اس کی شدت کفار کو واضح طور پر محسوس ہو اور اگر کبھی وہ حملہ کرنے کی غلطی کریں تو جواب میں انھیں کسی جگہ نرمی اور کمزوری نہ مل سکے۔ کیونکہ ایمان کا کمال ہی مسلمان بھائی کے لیے نرم ہونا اور کفار کے لیے سخت ہونا ہے، جیسا کہ اللہ تعالیٰ نے صحابہ کرام رضی اللہ عنھم کی خوبی بتائی : «{ اَشِدَّآءُ عَلَى الْكُفَّارِ رُحَمَآءُ بَيْنَهُمْ }» [الفتح : ۲۹ ] ’’کافروں پر بہت سخت، آپس میں نہایت رحم دل۔‘‘ اور مجاہدین کی شان بیان فرمائی : «{ اَذِلَّةٍ عَلَى الْمُؤْمِنِيْنَ اَعِزَّةٍ عَلَى الْكٰفِرِيْنَ }» [ المائدۃ : ۵۴ ] ’’مومنوں پر بہت نرم ہوں گے، کافروں پر بہت سخت۔‘‘ ¤ ➌ { وَ اعْلَمُوْۤا اَنَّ اللّٰهَ مَعَ الْمُتَّقِيْنَ:} اس کا مشاہدہ پوری تاریخ اسلام میں ہوتا رہا ہے۔ مسلمانوں کے خلفاء و ملوک اور امراء و عوام جب متقی ہوتے اللہ تعالیٰ کی خاص معیت و نصرت ان کے ساتھ ہوتی اور ہر جگہ فتح ان کے قدم چومتی اور جب وہ ظالم یا فاسق ہوتے اور عیش و عشرت یا باہمی لڑائیوں میں مصروف ہوتے، تو اللہ کی مدد اٹھ جاتی اور دشمن ان کے علاقوں پر قابض ہو جاتے۔ اب بھی اللہ تعالیٰ کی معیت، ساتھ اور نصرت و تائید حاصل کرنی ہے تو وہ تقویٰ کے ساتھ ہی حاصل ہو گی، محض سائنسی ترقی یا کثرت تعداد سے کبھی نہیں۔"
    },
    {
      "ayah": 124,
      "tafsir": "(آیت 125،124) ➊ {وَ اِذَا مَاۤ اُنْزِلَتْ سُوْرَةٌ … : ’’ يَسْتَبْشِرُوْنَ‘‘} حروف کی زیادتی معنی کی زیادتی پر دلالت کرتی ہے، ایسی زبردست خوشی جس کے آثار بشرے پر بھی ظاہر ہوں۔{’’ سُوْرَةٌ ‘‘ } سے مراد پوری سورت بھی ہو سکتی ہے اور آیات کا کوئی ٹکڑا بھی۔ کسی بھی سورت کے نزول پر اسے قبول کرنے میں اہل ایمان اور اہل نفاق کا واضح فرق ہوتا ہے، بیج کی عمدگی زمین کی قابلیت کے بغیر فائدہ مند نہیں ہوتی، چنانچہ منافقین ایک دوسرے سے بطور استہزا و مذاق یا بعض کمزور ایمان والے مسلمانوں کو شک میں ڈالنے کے لیے پوچھتے ہیں کہ ان آیات کے ساتھ تم میں سے کس کے ایمان میں اضافہ ہوا ہے؟ فرمایا کہ اہل ایمان کے ایمان میں تو ان سے اضافہ اور زیادتی ہوتی ہے، دل کے علم اور یقین میں بھی، زبانی تصدیق میں بھی اور عمل میں بھی اور ان تینوں کا نام ایمان ہے۔ {’’وَ هُمْ يَسْتَبْشِرُوْنَ‘‘} اور وہ بہت ہی خوش ہوتے ہیں، جس کے آثار ان کے چہرے پر بھی نمایاں ہوتے ہیں اور وہ لوگ جن کے دلوں میں کفر اور نفاق کا مرض ہے وہ پہلی سورتوں اور آیات ہی کے منکر تھے، جب اس سے بھی انکار کیا تو کفر کا ایک اور ردّہ ان کے دلوں پر چڑھ گیا اور ان کی کفر پر موت کا باعث بن گیا۔ ¤ ➋ یہ آیت اور قرآن مجید کی کئی اور آیات واضح الفاظ میں ایمان کے زیادہ ہونے کی صراحت فرما رہی ہیں۔ امام بخاری رحمہ اللہ نے اپنی صحیح میں کتاب الایمان کے شروع میں آٹھ آیات اور پھر بہت سی احادیث ذکر فرمائی ہیں جو صاف ایمان کی کمی اور زیادتی پر دلالت کرتی ہیں اور صرف عمل کے لحاظ ہی سے نہیں، بلکہ نفس تصدیق اور یقین میں بھی کمی اور زیادتی پر دلالت کرتی ہیں۔ تعجب ہے ان شیوخ الحدیث والتفسیر پر جو ساری عمر صحیح بخاری اور قرآن مجید پڑھاتے ہیں مگر ایمان کے زیادہ یا کم ہونے کی آیات و احادیث آتی ہیں تو یا تو انھیں مذہب کے خلاف کہہ کر رد کر دیتے ہیں، یا ایسی تاویل کرتے ہیں جو آیات و احادیث کے منشا کے صریح خلاف اور تاویل کے بجائے تحریف کہلانے کے زیادہ لائق ہے۔ اس وقت تو ان کے سامنے شاید کوئی نہ بول سکے مگر وہ پاک پروردگار جو آیات کے ساتھ مومنوں کے دلوں میں ایمان ویقین بڑھاتا ہے، اس کے سامنے کیا تاویل کریں گے؟ اور وہ حضرات اللہ تعالیٰ کو کیا جواب دیں گے جو کہتے ہیں کہ میرا اور ابوبکر صدیق رضی اللہ عنہ کا اور میرا اور جبریل علیہ السلام کا ایمان ایک جیسا ہے، کیونکہ ایمان سب کا برابر ہے، اس میں نہ کمی ہوتی ہے نہ زیادتی۔ وہ خود ہی سوچیں کہ کیا انھیں اللہ اور اس کے رسول اور آخرت کا وہ یقین حاصل ہے جو ابوبکر صدیق رضی اللہ عنہ اور جبریل علیہ السلام کو حاصل تھا ؟"
    },
    {
      "ayah": 125,
      "tafsir": "(آیت 125،124) ➊ {وَ اِذَا مَاۤ اُنْزِلَتْ سُوْرَةٌ … : ’’ يَسْتَبْشِرُوْنَ‘‘} حروف کی زیادتی معنی کی زیادتی پر دلالت کرتی ہے، ایسی زبردست خوشی جس کے آثار بشرے پر بھی ظاہر ہوں۔{’’ سُوْرَةٌ ‘‘ } سے مراد پوری سورت بھی ہو سکتی ہے اور آیات کا کوئی ٹکڑا بھی۔ کسی بھی سورت کے نزول پر اسے قبول کرنے میں اہل ایمان اور اہل نفاق کا واضح فرق ہوتا ہے، بیج کی عمدگی زمین کی قابلیت کے بغیر فائدہ مند نہیں ہوتی، چنانچہ منافقین ایک دوسرے سے بطور استہزا و مذاق یا بعض کمزور ایمان والے مسلمانوں کو شک میں ڈالنے کے لیے پوچھتے ہیں کہ ان آیات کے ساتھ تم میں سے کس کے ایمان میں اضافہ ہوا ہے؟ فرمایا کہ اہل ایمان کے ایمان میں تو ان سے اضافہ اور زیادتی ہوتی ہے، دل کے علم اور یقین میں بھی، زبانی تصدیق میں بھی اور عمل میں بھی اور ان تینوں کا نام ایمان ہے۔ {’’وَ هُمْ يَسْتَبْشِرُوْنَ‘‘} اور وہ بہت ہی خوش ہوتے ہیں، جس کے آثار ان کے چہرے پر بھی نمایاں ہوتے ہیں اور وہ لوگ جن کے دلوں میں کفر اور نفاق کا مرض ہے وہ پہلی سورتوں اور آیات ہی کے منکر تھے، جب اس سے بھی انکار کیا تو کفر کا ایک اور ردّہ ان کے دلوں پر چڑھ گیا اور ان کی کفر پر موت کا باعث بن گیا۔ ¤ ➋ یہ آیت اور قرآن مجید کی کئی اور آیات واضح الفاظ میں ایمان کے زیادہ ہونے کی صراحت فرما رہی ہیں۔ امام بخاری رحمہ اللہ نے اپنی صحیح میں کتاب الایمان کے شروع میں آٹھ آیات اور پھر بہت سی احادیث ذکر فرمائی ہیں جو صاف ایمان کی کمی اور زیادتی پر دلالت کرتی ہیں اور صرف عمل کے لحاظ ہی سے نہیں، بلکہ نفس تصدیق اور یقین میں بھی کمی اور زیادتی پر دلالت کرتی ہیں۔ تعجب ہے ان شیوخ الحدیث والتفسیر پر جو ساری عمر صحیح بخاری اور قرآن مجید پڑھاتے ہیں مگر ایمان کے زیادہ یا کم ہونے کی آیات و احادیث آتی ہیں تو یا تو انھیں مذہب کے خلاف کہہ کر رد کر دیتے ہیں، یا ایسی تاویل کرتے ہیں جو آیات و احادیث کے منشا کے صریح خلاف اور تاویل کے بجائے تحریف کہلانے کے زیادہ لائق ہے۔ اس وقت تو ان کے سامنے شاید کوئی نہ بول سکے مگر وہ پاک پروردگار جو آیات کے ساتھ مومنوں کے دلوں میں ایمان ویقین بڑھاتا ہے، اس کے سامنے کیا تاویل کریں گے؟ اور وہ حضرات اللہ تعالیٰ کو کیا جواب دیں گے جو کہتے ہیں کہ میرا اور ابوبکر صدیق رضی اللہ عنہ کا اور میرا اور جبریل علیہ السلام کا ایمان ایک جیسا ہے، کیونکہ ایمان سب کا برابر ہے، اس میں نہ کمی ہوتی ہے نہ زیادتی۔ وہ خود ہی سوچیں کہ کیا انھیں اللہ اور اس کے رسول اور آخرت کا وہ یقین حاصل ہے جو ابوبکر صدیق رضی اللہ عنہ اور جبریل علیہ السلام کو حاصل تھا ؟"
    },
    {
      "ayah": 126,
      "tafsir": "(آیت 126) {اَوَ لَا يَرَوْنَ اَنَّهُمْ يُفْتَنُوْنَ … :} اکثر جنگ و جہاد کے وقت منافق معلوم ہو جاتے تھے (مگر پھر بھی وہ نفاق پر قائم رہتے تھے)۔ (موضح) اسی طرح ہر آدمی پر کوئی نہ کوئی آزمائش بیماری یا خوف وغیرہ کی صورت میں ہر سال ایک دو مرتبہ آتی رہتی ہے، تاکہ اسے سوچنے کا موقع ملے، فرمایا : «{ وَ لَنُذِيْقَنَّهُمْ مِّنَ الْعَذَابِ الْاَدْنٰى دُوْنَ الْعَذَابِ الْاَكْبَرِ لَعَلَّهُمْ يَرْجِعُوْنَ }» [ السجدۃ : ۲۱ ] ’’اور یقینا ہم انھیں قریب ترین عذاب کا کچھ حصہ سب سے بڑے عذاب سے پہلے ضرور چکھائیں گے، تاکہ وہ پلٹ آئیں۔‘‘ سعادت مندوں کو اس سے توبہ اور نصیحت حاصل کرنے کی توفیق ملتی ہے، مگر منافق محروم رہتا ہے۔ پہلا معنی اس مقام پر زیادہ موزوں ہے۔"
    },
    {
      "ayah": 127,
      "tafsir": "(آیت 127) ➊ {وَ اِذَا مَاۤ اُنْزِلَتْ سُوْرَةٌ …:} اس آیت میں اللہ تعالیٰ نے اس وقت کا نقشہ کھینچا ہے جب منافقین رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں موجود ہوتے اور ان کے راز کھولنے والی یا جہاد کے حکم پر مبنی کوئی سورت یا آیات اترتیں، پھر وہ کمینگی اور شرارت سے ایک دوسرے کی طرف دیکھتے اور موقع پا کر کہ کوئی دیکھ تو نہیں رہا، مجلس سے کھسک جاتے۔ ان کی سمجھ میں صاف آ رہا ہوتا کہ ان آیات کا مصداق وہی ہیں، کیونکہ جہاد کے لیے نکلنا ان کے لیے موت تھی اور اس مجلس میں بیٹھنا ان کے لیے سراسر تذلیل کا باعث ہوتا، چنانچہ وہ تائب ہونے کے بجائے نکل جانے کو ترجیح دیتے۔ فرمایا : «{ قَدْ يَعْلَمُ اللّٰهُ الَّذِيْنَ يَتَسَلَّلُوْنَ مِنْكُمْ لِوَاذًا }» [ النور : ۶۳ ] ’’بے شک اللہ ان لوگوں کو جانتا ہے جو تم میں سے ایک دوسرے کی آڑ لیتے ہوئے کھسک جاتے ہیں۔‘‘ ¤ ➋ { صَرَفَ اللّٰهُ قُلُوْبَهُمْ:} ’’اللہ نے ان کے دل پھیر دیے ہیں‘‘ کیونکہ وہ سمجھتے ہی نہیں کہ ہماری فلاح اور بھلائی کس چیز میں ہے، یا یہ بددعا ہے کہ وہ اس کے اہل ہیں کہ ان کے حق میں کہا جائے کہ اللہ ان کے دلوں کو پھیر دے۔"
    },
    {
      "ayah": 128,
      "tafsir": "(آیت 128) {لَقَدْ جَآءَكُمْ رَسُوْلٌ مِّنْ اَنْفُسِكُمْ … :} اس میں آپ صلی اللہ علیہ وسلم کی بعض صفات عالیہ کا اور لوگوں پر اللہ تعالیٰ کے احسانات کا ذکر ہے۔ ایک صفت {’’ لَقَدْ جَآءَكُمْ رَسُوْلٌ ‘‘} میں لفظ {’’رَسُوْلٌ‘‘} ہے کہ آپ صلی اللہ علیہ وسلم رسول ہیں، یعنی خود نہیں آئے بلکہ اللہ کی طرف سے بھیجے ہوئے آئے ہیں۔ ایک احسان {’’ جَآءَكُمْ ‘‘} ہے، یعنی تمام لوگوں کی طرف قیامت تک کے لیے آنے والا رسول تم عربوں میں آیا ہے، عربی رسول بھیج کر اللہ تعالیٰ نے دنیا کی امامت کے لیے تمھیں منتخب فرمایا ہے۔ {’’ كُمْ ‘‘} کے مخاطب تمام دنیا کے لوگ ہیں، مگر اول مخاطب عرب ہیں، آپ کی تیسری صفت اور اللہ کا احسان {’’ مِنْ اَنْفُسِكُمْ ‘‘} ہے کہ آپ صلی اللہ علیہ وسلم تمھاری جنس سے، یعنی انسانوں میں سے ہیں، انھیں تمام انسانی ضروریات لاحق ہیں، وہ آدم کی اولاد سے ہیں، ان کے ماں باپ بھی ہیں، قریش کے ہر خاندان سے کوئی نہ کوئی رشتہ داری ہے، بیویاں اور اولاد بھی ہیں، بچپن، جوانی، بڑھاپا، بھوک، پیاس اور وفات سب کچھ آپ پر گزرا، صحت و مرض، رنج و راحت ہر مرحلے سے گزرے، اس لیے آپ صلی اللہ علیہ وسلم ہر چیز میں تمھارے لیے نمونہ ہیں۔ اگر وہ جن یا فرشتہ یا کوئی اور جنس ہوتے تو تمھارے لیے نمونہ اور اسوۂ حسنہ کیسے بنتے؟ اللہ کا احسان مانو کہ اس نے خود تم میں سے ایک نمونہ اپنا پیغام دے کر بھیجا کہ اس کی بات بھی سنو اور اس کی ذات کو دیکھ کر اس کے مطابق عمل بھی کرو۔ مزید دیکھے سورۂ آل عمران(۱۶۴) چوتھی یہ کہ {’’ عَزِيْزٌ عَلَيْهِ مَا عَنِتُّمْ ‘‘} تمھارا کسی طرح بھی مشقت یا مصیبت میں پڑنا اس پر نہایت شاق ہے، وہ برداشت ہی نہیں کر سکتا کہ تم کفر اختیار کرکے دنیا میں حیوانوں سے بدتر زندگی گزارو، پھر آخرت میں جہنم کا ایندھن بنو، اس فکر میں وہ گھلتا جا رہا ہے، اتنا کہ اللہ تعالیٰ کو اسے تسلی دلانا پڑتی ہے۔ دیکھیے سورۂ کہف (۶)، آل عمران (۱۷۶)، شعراء ( ۳) اور شوریٰ (۴۸) پھر وہ ایسا دین لے کر آیا ہے جس میں کوئی مشکل نہیں، نہایت آسان اور سادہ ہے، آپ صلی اللہ علیہ وسلم نے فرمایا : [ اِنِّيْ اُرْسِلْتُ بِحَنِيْفِيَّةٍ سَمْحَةٍ ] [ أحمد : 116/6، ح : ۲۴۹۰۸، عن عائشۃرضی اللہ عنھا ، قال شعیب الأرنؤوط وغیرہ حدیث قوی، إسنادہ حسن ] ’’مجھے حنیفی (ابراہیم حنیف والی) آسان شریعت دے کر بھیجا گیا ہے۔‘‘ اور فرمایا : [ اِنَّ الدِّيْنَ يُسْرٌ ] ’’یہ دین سراسر آسان ہے۔‘‘ [ بخاری، الإیمان، باب الدین یسر : ۳۹، عن أبی ھریرۃ رضی اللہ عنہ ] ایسا مہربان نبی کہ طائف میں دس دن رہ کر مار کھا کر زخمی اور بے ہوش ہو کر نکلا اور ہوش آنے پر اللہ تعالیٰ نے پہاڑوں کا فرشتہ بھیجا کہ اگر کہو تو میں (دو پہاڑوں) اخشبین میں ان کفار کو پیس دوں؟ تو فرمایا: ’’مجھے امید ہے کہ اللہ ان کی پشتوں سے ایسے لوگ نکالے گا جو ایک اللہ کی عبادت کریں گے، اس کے ساتھ کسی کو شریک نہیں کریں گے۔‘‘ [ بخاری، بدء الخلق، باب إذا قال إحدکم آمین… : ۳۲۳۱، عن عائشۃ رضی اللہ عنھا ] ¤ پانچویں یہ کہ {’’ حَرِيْصٌ عَلَيْكُمْ ‘‘} رات دن اس کی یہی کوشش ہے اور اسی فکر میں لگا رہتا ہے کہ جس طرح بھی ہو سکے تم دوزخ سے بچ جاؤ اور دنیا و آخرت کی فلاح حاصل کر لو۔ شاہ عبد القادر رحمہ اللہ نے {’’ حَرِيْصٌ عَلَيْكُمْ ‘‘} کا ترجمہ کیا ہے ’’تلاش رکھتا ہے تمھاری۔‘‘ اس کی وضاحت میں فرمایا : ’’چاہتا ہے کہ میری امت زیادہ ہوتی رہے۔‘‘ (موضح) اس لیے زیادہ اولاد دینے والے خاندانوں میں نکاح کرنے کی ترغیب دی، فرمایا : [ تَزَوَّجُوا الْوَلُوْدَ الْوَدُوْدَ فَاِنِّيْ مُكَاثِرٌ بِكُمُ الْأُمَمَ ] ’’ایسی عورتوں سے نکاح کرو جو بہت بچے دینے والی، بہت محبت کر نے والی ہوں، کیونکہ میں دوسری امتوں کے سامنے تمھاری کثرت پر فخر کرنے والا ہوں۔‘‘ [ نسائی، النکاح، باب کراھیۃ تزویج العقیم : ۳۲۲۹۔ أبو داوٗد : ۲۰۵۰ ] چھٹی {’’ بِالْمُؤْمِنِيْنَ رَءُوْفٌ رَّحِيْمٌ ‘‘} نبی کریم صلی اللہ علیہ وسلم اپنے ساتھیوں کی عیادت کے لیے جاتے، ان کے جنازے میں پہنچتے، نماز میں بچے کے رونے کی آواز سن کر ماں کی تکلیف محسوس کرتے ہوئے نماز مختصر کر دیتے، خود بھوکے رہ کر انھیں کھلاتے پلاتے، نبوت سے پہلے آپ صلی اللہ علیہ وسلم کی تمام انسانوں کے ساتھ شفقت و ہمدردی کو دیکھیں جس کی شہادت ام المومنین خدیجہ رضی اللہ عنھا نے دی، تو مومنوں پر آپ کی نرمی اور رحمت کا خود بخود اندازہ ہوتا ہے۔ ان کے لیے مغفرت اور رحمت کی دعا کرتے، اللہ تعالیٰ نے جو ایک مقبول دعا ہر نبی کی طرح آپ کو عطا کی، سب نے کر لی، مگر آپ نے اپنی امت کی شفاعت کرنے کے لیے سنبھال کر رکھ لی۔ اللہ تعالیٰ ہمیں بھی اپنے فضل سے جنت میں اپنے اس مہربان نبی کی رفاقت عطا فرمائے۔ (آمین)"
    },
    {
      "ayah": 129,
      "tafsir": "(آیت 129) ➊ { فَاِنْ تَوَلَّوْا …:} یعنی ایسے مہربان نبی، اس کی مومنوں پر شفقت و رحمت و حرص اور اس قدر سہل دین کے باوجود اگر وہ منہ موڑیں، تو آپ یہ کہیں: «{ حَسْبِيَ اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ }» صرف یہ عقیدہ ہی نہ رکھیں، بلکہ برملا اعلان کریں اور اللہ کے کافی ہونے پر اپنی خوشی اور فخر کا اظہار کریں۔ ¤ توحید تو یہ ہے کہ خدا حشر میں کہہ دے ¤ یہ بندہ دو عالم سے خفا میرے لیے ہے ¤ ➋ {حَسْبِيَ اللّٰهُ: ’’ حَسْبِيَ ‘‘} پہلے آنے کی وجہ سے معنی میں حصر پیدا ہو گیا، یعنی مجھے صرف اللہ کافی ہے، خواہ سب لوگ مجھے چھوڑ جائیں۔ ایک شاعر نے کیا خوب کہا ہے ¤ کیا ڈر ہے اگر ساری خدائی ہو مخالف ¤ کافی ہے اگر ایک خدا میرے لیے ہے ¤ بے شک اللہ تعالیٰ نے دنیا میں اسباب بنائے ہیں، ساتھیوں کی مدد سے قوت ملتی ہے اور ایک دوسرے کی مدد کا حکم بھی ہے : «{ وَ تَعَاوَنُوْا عَلَى الْبِرِّ وَ التَّقْوٰى }» [ المائدۃ : ۲ ] ’’اور نیکی اور تقویٰ پر ایک دوسرے کی مدد کرو۔‘‘ مگر کافر اور مومن کا یہی فرق ہے کہ دنیاوی اسباب ختم ہونے پر کافر ناامید ہو جاتا ہے اور مشرک کو اپنے معبودوں پر اتنا اعتماد ہو ہی نہیں سکتا جتنا موحد کو ایک اللہ پر ہوتا ہے، اس لیے مومن کبھی نا امید ہو کر کفر کے مقابلے سے دستبردار نہیں ہوتا ¤ کافر ہے تو شمشیر پہ کرتا ہے بھروسا ¤ مومن ہے تو بے تیغ بھی لڑتا ہے سپاہی ¤ اس لیے قرآن و حدیث کی تعلیم کا خلاصہ یہ ہے کہ اسباب و ضروریات مہیا کرنے کی پوری کوشش کرو، وہ جمع ہو جائیں تب بھی ان پر نہیں بلکہ اللہ تعالیٰ پر بھروسا کرو اور ایک بھی سبب مہیا نہ ہو سکے تب بھی صرف اللہ پر بھروسا رکھو جس کے سوا کوئی معبود نہیں اور وہ کوئی عام بادشاہ نہیں، عرش عظیم کا رب ہے، کوئی چیز اس کی سلطنت اور دسترس سے باہر نہیں۔ تمام اسباب ختم ہونے پر ایک اللہ پر اسی اعتماد اور اس کے مطابق اللہ تعالیٰ کی مدد کا مظاہرہ غار ثور میں ہوا، فرمایا : «{ اِلَّا تَنْصُرُوْهُ فَقَدْ نَصَرَهُ اللّٰهُ … }» [ التوبۃ : ۴۰ ] اسی کا مظاہرہ جنگ احد کے اختتام پر دشمن کے اجتماع کی خبر پر اہل ایمان کے قول کے وقت ہوا اور اسی کا مظاہرہ دنیا کا ہر سہارا ختم ہونے پر آگ میں پھینکے جانے کے وقت ابراہیم علیہ السلام کے قول «{ حَسْبُنَا اللّٰهُ وَ نِعْمَ الْوَكِيْلُ }» کہنے اور بلا اسباب آگ کو گلزار بنا کر اللہ تعالییٰ کی مدد کی صورت میں ہوا۔ دیکھیے سورۂ آل عمران (۱۷۳، ۱۷۴) اور سورۂ بروج میں مذکور اصحاب الاخدود والے لڑکے کے پاس جب تمام اسباب ختم ہو گئے تو اس نے انھی الفاظ کے ہم معنی الفاظ [ اَللّٰهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ ] (اے اللہ! مجھے ان سے کافی ہو جا جس چیز کے ساتھ تو چاہے) کے ساتھ دعا کی تو پہاڑ سے گرانے والے خود گر کر مر گئے اور سمندر میں ڈبونے والے خود ڈوب گئے، مگر اس کا کچھ بھی نہ بگڑا۔ [ دیکھیے مسلم، الزھد، باب قصۃ أصحاب الأخدود… : ۳۰۰۵، عن صہیب رضی اللہ عنہ ] اب بھی اگر کوئی یقین کے ساتھ اللہ پر اعتماد کرنے والا یہ دعائیں پڑھے تو اللہ تعالیٰ کی مدد اسی طرح آئے گی، خواہ ساری دنیا اس سے منہ موڑ جائے۔ بندۂ عاجز عبد السلام عرض کرتا ہے کہ یہ ان مبارک دعاؤں میں سے ہے جن کے پڑھنے کا اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو قرآن مجید میں {’’ قُلْ ‘‘} کے لفظ کے ساتھ حکم دیا ہے، اس لیے ہمیں بھی اپنے صبح و شام کے اذکار میں اسے شامل کرنا چاہیے۔ ابودرداء رضی اللہ عنہ فرماتے ہیں : ’’جو شخص یہ دعا «{ حَسْبِيَ اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَ هُوَ رَبُّ الْعَعَرْشِ الْعَظِيْمِ }» صبح و شام سات سات دفعہ پڑھے، اللہ تعالیٰ اسے تمام فکروں سے کافی ہو جاتا ہے۔‘‘ یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے تو ثابت نہیں، ہاں ابودرداء رضی اللہ عنہ کے قول کی سند کے راوی اچھے ہیں، البتہ اس میں [ صَادِقًا كَانَ بِهَا اَوْ كَاذِبًا ] کے الفاظ صحیح نہیں، بلکہ منکر ہیں۔ [ دیکھیے سلسلۃ الأحادیث الضعیفۃ و الموضوعۃ : ۵۲۸۶ ] بالفرض اگر صحابی کا قول بھی نہ ہو تو اس کی فضیلت میں اللہ تعالیٰ کافرمان {’’ قُلْ ‘‘} ہی کافی ہے۔"
    }
  ]
}