{
  "surah": "Al-Bayyina",
  "surah_number": 98,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "انس رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے اُبی بن کعب رضی اللہ عنہ سے فرمایا : [ إِنَّ اللّٰهَ أَمَرَنِيْ أَنْ أَقْرَأَ عَلَيْكَ : «لَمْ يَكُنِ الَّذِيْنَ كَفَرُوْا» قَالَ وَسَمَّانِيْ؟ قَالَ نَعَمْ، فَبَكٰی] [بخاري، التفسیر، سورۃ : «لم یکن» : ۴۹۵۹ ]’’اللہ تعالیٰ نے مجھے حکم دیا ہے کہ میں تمھیں {’’ لَمْ يَكُنِ الَّذِيْنَ كَفَرُوْا ‘‘} پڑھ کر سناؤں۔‘‘ اُبی رضی اللہ عنہ نے کہا : ’’اور کیا اللہ نے میرا نام بھی لیا ہے؟‘‘ آپ نے فرمایا : ’’ہاں!‘‘ تو اُبی رضی اللہ عنہ (یہ سن کر خوشی سے) رونے لگے۔‘‘ ¤ (آیت 1) {لَمْ يَكُنِ الَّذِيْنَ كَفَرُوْا … : ’’ مُنْفَكِّيْنَ ‘‘ ’’فَكَّ يَفُكُّ فَكًّا‘‘ (ن) ’’اَلشَّيْءَ‘‘} کسی چیز کو دوسری سے جدا کرنا، {’’اَلْعُقْدَةَ‘‘} گرہ کھولنا اور {’’اَلْخَتَمَ‘‘} مہر توڑنا۔ {’’اِنْفَكَّ يَنْفَكُّ‘‘} (انفعال) ایک چیز کا دوسری چیز سے الگ ہونا جس کے ساتھ وہ خوب جڑی ہوئی تھی، جیسے {’’اِنْفَكَّ الْعَظْمُ‘‘} ’’ہڈی اپنے جوڑ سے الگ ہو گئی۔‘‘ {’’ مُنْفَكِّيْنَ ‘‘} اسم فاعل ہے، (اپنے کفر سے) باز آنے والے، الگ ہونے والے۔یعنی پیغمبر آخرالزماں اور قرآن بھیجنے کی ضرورت اس لیے پیش آئی کہ اہلِ کتاب (یہود و نصاریٰ) اور مشرکینِ عرب کو راہِ حق پر لایا جائے، کیونکہ یہ لوگ اس قدر بگڑے ہوئے تھے کہ ان کا راہ حق پر آنا اس کے بغیر ممکن نہ تھا کہ ایک پیغمبر آئے جو ایک مقدس آسمانی کتاب لائے جس میں عمدہ و دل نشین مضامین ہوں اور وہ انھیں پڑھ کر سنائے، کسی حکیم یا صوفی یا عادل بادشاہ کے بس کی بات نہ تھی کہ انھیں راہِ راست پر لے آتا۔ (اشرف الحواشی)"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 3،2) { رَسُوْلٌ مِّنَ اللّٰهِ يَتْلُوْا صُحُفًا مُّطَهَّرَةً …:} قرآن مجید کو {’’ صُحُفًا مُّطَهَّرَةً ‘‘} اور اس میں موجود احکام اور سورتوں کو {’’ قَيِّمَةٌ ‘‘} (نہایت مضبوط) قرار دیا ہے کہ ان میں کسی قسم کی ناپاک بات یا کمزور اور بے بنیاد قصہ یا حکم نہیں۔ اگرکسی شخص کو رسول اللہ صلی اللہ علیہ وسلم کے لائے ہوئے پاک صحیفوں اور ان میں لکھے ہوئے مضبوط احکام کی پاکیزگی اور مضبوطی معلوم کرنے کا شوق ہو تو وہ قرآن مجید کا بائبل کے مجموعے میں موجود پہلے صحیفوں کے ساتھ موازنہ کرلے، جن میں صحیح باتوں کے ساتھ عقل و اخلاق سے گری ہوئی باتیں ، واضح تحریف شدہ احکام اور اللہ تعالیٰ کی ذات گرامی اور انبیائے کرام کی توہین اور ان پر تہمتوں کی نجاست صاف نظر آتی ہے، مثلاً لوط اور سلیمان علیھما السلام پر بے بنیاد تہمتیں، جن سے وہ ہر طرح سے پاک اور بری ہیں۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3،2) { رَسُوْلٌ مِّنَ اللّٰهِ يَتْلُوْا صُحُفًا مُّطَهَّرَةً …:} قرآن مجید کو {’’ صُحُفًا مُّطَهَّرَةً ‘‘} اور اس میں موجود احکام اور سورتوں کو {’’ قَيِّمَةٌ ‘‘} (نہایت مضبوط) قرار دیا ہے کہ ان میں کسی قسم کی ناپاک بات یا کمزور اور بے بنیاد قصہ یا حکم نہیں۔ اگرکسی شخص کو رسول اللہ صلی اللہ علیہ وسلم کے لائے ہوئے پاک صحیفوں اور ان میں لکھے ہوئے مضبوط احکام کی پاکیزگی اور مضبوطی معلوم کرنے کا شوق ہو تو وہ قرآن مجید کا بائبل کے مجموعے میں موجود پہلے صحیفوں کے ساتھ موازنہ کرلے، جن میں صحیح باتوں کے ساتھ عقل و اخلاق سے گری ہوئی باتیں ، واضح تحریف شدہ احکام اور اللہ تعالیٰ کی ذات گرامی اور انبیائے کرام کی توہین اور ان پر تہمتوں کی نجاست صاف نظر آتی ہے، مثلاً لوط اور سلیمان علیھما السلام پر بے بنیاد تہمتیں، جن سے وہ ہر طرح سے پاک اور بری ہیں۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {وَ مَا تَفَرَّقَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ … :} اس آیت میں اہلِ کتاب کے ایک جرم کا ذکر فرمایا، مشرکین کا نام نہیں لیا، کیونکہ جب پڑھے لکھوں کا یہ حال ہے تو جاہل مشرکین کی ضد اور عناد کا اندازہ خود کرلیں۔ اہل کتاب کا یہ جرم ان کا باہمی تفرقہ تھا اور اس جرم کا ارتکاب انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی تشریف آوری سے پہلے بھی کیا اور آپ کی آمد پر بھی ۔ آپ کی تشریف آوری سے پہلے وہ بہتر (۷۲) فرقوں میں بٹ چکے تھے۔ اس آیت میں وضاحت فرمائی کہ ان کے الگ الگ بہتر (۷۲) فرقے بننے کی وجہ یہ نہ تھی کہ انھیں اللہ کے حکم کا علم نہ تھا، نہیں! بلکہ {’’ الْبَيِّنَةُ ‘‘ } (کھلی دلیل اور واضح حکم) موجود ہونے کے باوجو د باہمی ضد اور عناد کی وجہ سے کسی نے احبار و رہبان میں سے کسی ایک کے اقوال کو حجت مان کر اس کے نام پر فرقہ بنا لیا اور کسی نے دوسرے کے نام پر ۔ یہی حال مسلمانوں کا ہوا، ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ تَفَرَّقَتِ الْيَهُوْدُ عَلٰی إِحْدٰی وَسَبْعِيْنَ فِرْقَةً، أَوِ اثْنَتَيْنِ وَسَبْعِيْنَ فِرْقَةً، وَالنَّصَارارٰی مِثْلَ ذٰلِكَ، وَتَفْتَرِقُ أُمَّتِيْ عَلٰی ثَلاَثٍ وَّسَبْععِيْنَ فِرْقَةً ] [ترمذي، الإیمان، باب ما جاء في افتراق ھٰذہ الأمۃ : ۲۶۴۰، وقال ترمذي و الألباني حسن صحیح ] ’’یہود اکہتر (۷۱) یا بہتر (۷۲) فرقوں میں بٹ گئے، نصرانیوں کا بھی یہی حال ہوا اور میری امت تہتر (۷۳) فرقوں میں بٹ جائے گی۔‘‘ اس افتراق کا حل پہلے بھی یہ تھا اور اب بھی یہی ہے کہ تمام امت اللہ کے نازل کردہ احکام پر متفق ہو جائے ، علماء کے اقوال سے کتاب و سنت سمجھنے میں مدد لی جائے مگران میں سے کسی کے قول کو شرع سمجھ کر فرقہ نہ بنایا جائے، بلکہ جہاں اس کی بات وحی الٰہی کے خلاف ہو، خواہ کتنا ہی بڑا آدمی کیوں نہ ہو، اسے یکسر ترک کر دیا جائے۔ ¤ ➋ رسول اللہ صلی اللہ علیہ وسلم کی تشریف آوری کے بعد آپ پر اہلِ کتاب کے ایمان نہ لانے کی وجہ یہ ہرگز نہ تھی کہ انھیں آپ کے سچا ہونے میں کوئی شک تھا، بلکہ پہلی کتابوں میں آپ صلی اللہ علیہ وسلم کی واضح بشارت اور نشانیاں موجود ہونے کی وجہ سے وہ آپ کو اپنے بیٹوں کی طرح بلکہ اس سے بھی بڑھ کر پہچانتے تھے، مگر محض حسد اور عناد کی وجہ سے آپ کے بارے میں جدا جدا ہوگئے، کوئی ایمان لے آیا اور کوئی کفر پر ڈٹا رہا۔ حسد اور عناد ایک تو یہ تھا کہ آپ بنی اسرائیل کے بجائے بنی اسماعیل سے کیوں ہیں اور دوسرا یہ کہ وہ اپنی مذہبی سرداری چھوڑنے پر آمادہ نہیں تھے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {وَ مَاۤ اُمِرُوْۤا اِلَّا لِيَعْبُدُوا اللّٰهَ …: ’’ الْقَيِّمَةِ ‘‘ ’’قَامَ يَقُوْمُ‘‘} سے {’’فَيْعِلَةٌ‘‘} کے وزن پر صفت کا صیغہ ہے، جس میں تاء مبالغے کے لیے ہے، نہایت مضبوط، سیدھی جس میں کوئی کجی نہیں : {’’أَيْ ذٰلِكَ دِيْنُ الْمِلَّةِ الْقَيِّمَةِ‘‘} ’’یعنی یہی مضبوط ملت کا دین ہے۔‘‘ {’’ حُنَفَآءَ ‘‘ ’’حَنِيْفٌ‘‘} کی جمع ہے جو {’’حَنَفَ يَحْنِفُ حَنْفًا‘‘} (ض) (حاء کے ساتھ) سے {’’فَعِيْلٌ‘‘} بمعنی اسم فاعل ہے ،اس کا لفظی معنی ’’ایک طرف مائل ہونا‘‘ ہے۔ اس کا اکثر استعمال ’’تمام راستوں سے ہٹ کر سیدھے راستے کی طرف آنے‘‘ کے معنی میں ہوتا ہے، جب کہ {’’جَنَفَ‘‘} (جیم کے ساتھ) کا مطلب ’’سیدھے راستے سے ہٹ کر ادھر ادھر ہو جانا‘‘ ہوتا ہے۔ اس آیت میں دین کا خلاصہ بیان فرما دیا کہ پہلی امتیں ہوں یا یہ امت، سب میں ایک ہی حکم ہے کہ ایک اللہ کی عبادت کریں، جو ہر قسم کے شرک اور ریا سے پاک اور خالص اللہ کے لیے ہو اور باطل پر چلنے والے تمام گروہوں سے ہٹ کر ایک اللہ کی طرف یک سو ہو جائیں، جس طرح ابراہیم علیہ السلام ہو گئے تھے اور نماز قائم کریں اور زکوٰۃ ادا کریں، یہی مضبوط ملت کا دین ہے۔ جب اس امت میں بھی وہی پہلا ہی حکم ہے اور پہلی امتوں کا اور اس امت کا دین قیم ایک ہی ہے، تو انھیں ماننے سے انکار کیوں ہے؟"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) { اِنَّ الَّذِيْنَ كَفَرُوْا مِنْ اَهْلِ الْكِتٰبِ …: ’’ الْبَرِيَّةِ ‘‘ ’’بَرَأَ يَبْرَأُ بَرْأً وَ بُرُوْءًا‘‘} (ف) (پیدا کرنا) سے {’’فَعِيْلَةٌ‘‘‘} کے وزن پر اسم مفعول کے معنی میں ہے، مخلوق۔ یعنی یہ لوگ تمام مخلوق حتیٰ کہ جانوروں سے بھی بدتر ہیں، جیسا کہ فرمایا : « اُولٰٓىِٕكَ كَالْاَنْعَامِ بَلْ هُمْ اَضَلُّ» [ الأعراف : ۱۷۹ ] ’’ یہ لوگ جانوروں کی طرح ہیں، بلکہ ان سے بھی زیادہ گمراہ ہیں۔‘‘ کیونکہ یہ جان بوجھ کر حق کی مخالفت کر رہے ہیں۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 8،7) {اِنَّ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ … :} جو لوگ اللہ اور اس کے رسولووں اور تمام کتابوں پر ایمان لائے اور انھوں نے صالح اعمال کیے ان کے لیے تین بڑی بڑی بشارتیں ہیں، پہلی یہ کہ وہ مخلوق میں سب سے بہتر ہیں، کیونکہ اپنے اختیار سے گناہ چھوڑ کر ایمان اور عمل صالح کرنے والوں کا درجہ یقینا ان لوگوں سے بلند ہے جن میں نافرمانی کی استعداد ہی نہیں، دوسری یہ کہ ان کے لیے ہمیشہ رہنے کے لیے باغات ہیں، جن کے تلے نہریں بہتی ہیں اور تیسری یہ کہ انھیں اللہ تعالیٰ کی رضا حاصل ہوگی جو آخرت کی نعمتوں میں سے سب سے بڑی نعمت ہے، فرمایا : « وَ رِضْوَانٌ مِّنَ اللّٰهِ اَكْبَرُ» [ التوبۃ : ۷۲ ] ’’اور اللہ کی رضامندی سب سے بڑی چیز ہے۔‘‘ ’’اور وہ اللہ سے راضی ہوں گے‘‘ یعنی بے شمار نعمتوں کے بعد بھی اگر ان کا دل ہی خوش نہ ہوا تو کیا فائدہ؟ یہ نعمتیں اس کے لیے ہیں جو اپنے رب سے ڈر گیا۔ خالی بے روح کلمہ پڑھنے، بلا خشیت نماز اور بوجھل دل کے ساتھ زکوٰۃ ادا کرنے اور بطور رسم عبادات ادا کرنے سے یہ مرتبہ نہیں ملتا، بلکہ اس کا مدار اللہ کے ڈر پر ہے، جیسا کہ فرمایا : « وَ لِمَنْ خَافَ مَقَامَ رَبِّهٖ جَنَّتٰنِ» [ الرحمٰن : ۴۶ ] ’’اور جو شخص اپنے رب کے سامنے کھڑا ہونے سے ڈر گیا اس کے لیے دو باغ ہیں۔‘‘"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8،7) {اِنَّ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ … :} جو لوگ اللہ اور اس کے رسولووں اور تمام کتابوں پر ایمان لائے اور انھوں نے صالح اعمال کیے ان کے لیے تین بڑی بڑی بشارتیں ہیں، پہلی یہ کہ وہ مخلوق میں سب سے بہتر ہیں، کیونکہ اپنے اختیار سے گناہ چھوڑ کر ایمان اور عمل صالح کرنے والوں کا درجہ یقینا ان لوگوں سے بلند ہے جن میں نافرمانی کی استعداد ہی نہیں، دوسری یہ کہ ان کے لیے ہمیشہ رہنے کے لیے باغات ہیں، جن کے تلے نہریں بہتی ہیں اور تیسری یہ کہ انھیں اللہ تعالیٰ کی رضا حاصل ہوگی جو آخرت کی نعمتوں میں سے سب سے بڑی نعمت ہے، فرمایا : « وَ رِضْوَانٌ مِّنَ اللّٰهِ اَكْبَرُ» [ التوبۃ : ۷۲ ] ’’اور اللہ کی رضامندی سب سے بڑی چیز ہے۔‘‘ ’’اور وہ اللہ سے راضی ہوں گے‘‘ یعنی بے شمار نعمتوں کے بعد بھی اگر ان کا دل ہی خوش نہ ہوا تو کیا فائدہ؟ یہ نعمتیں اس کے لیے ہیں جو اپنے رب سے ڈر گیا۔ خالی بے روح کلمہ پڑھنے، بلا خشیت نماز اور بوجھل دل کے ساتھ زکوٰۃ ادا کرنے اور بطور رسم عبادات ادا کرنے سے یہ مرتبہ نہیں ملتا، بلکہ اس کا مدار اللہ کے ڈر پر ہے، جیسا کہ فرمایا : « وَ لِمَنْ خَافَ مَقَامَ رَبِّهٖ جَنَّتٰنِ» [ الرحمٰن : ۴۶ ] ’’اور جو شخص اپنے رب کے سامنے کھڑا ہونے سے ڈر گیا اس کے لیے دو باغ ہیں۔‘‘"
    }
  ]
}