{
  "surah": "Al-Aadiyaat",
  "surah_number": 100,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "اس سورت کے مکی یا مدنی ہونے میں اختلاف ہے، راجح یہی ہے کہ یہ مکی ہے۔ اس میں شواہد کے ساتھ انسان کا ناشکرا ہونا اور بخیل و حریص ہونا بیان کیا گیا ہے۔ ساتھ ہی قیامت کا تذکرہ ہے۔ ¤ (آیت 1){ وَ الْعٰدِيٰتِ ضَبْحًا: ’’ الْعٰدِيٰتِ ‘‘ ’’عَدَا يَعْدُوْا عَدْوًا‘‘} (ن) (دوڑنا) سے اسم فاعل ہے، دوڑنے والے۔ {’’ضَبْحٌ‘‘} اس آواز کو کہتتے ہیں جو گھوڑے کے تیز دوڑنے کی وجہ سے اس کے جوف سے نکلتی ہے، جو نہ سانس کی آواز ہوتی ہے اور نہ ہنہنانے کی، اس لیے اس کا معنی ’’ ہانپ کر‘‘ کرنا محل نظر ہے۔ آیت میں اگرچہ گھوڑوں کا لفظ نہیں، مگر لغت عرب میں{’’ ضَبْحٌ‘‘} کا لفظ گھوڑے کے لیے آتا ہے یا کتے کے لیے، کیونکہ یہ مخصوص آواز انھی دو جانوروں سے نکلتی ہے۔ اس جگہ کتے مراد ہو ہی نہیں سکتے، اس لیے گھوڑے ہی مراد ہیں۔ یہاں تیز دوڑنے والے گھوڑوں کو بطور شاہد پیش کیا گیا ہے، وہ گھوڑے مسلمانوں کے ہوں یا کافروں کے، انھیں غازیوں کے ساتھ مخصوص بھی نہیں کیا گیا، کیونکہ مقصد گھوڑوں کی فضیلت بیان کرنا نہیں بلکہ انھیں آئندہ آنے والے دعوے کی دلیل کے طور پر پیش کرنا ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) { فَالْمُوْرِيٰتِ قَدْحًا:’’أَوْرٰي يُؤْرِيْ إِيْرَاءً‘‘} (افعال) چقماق ( پتھر) سے آگ نکالنا۔ {’’قَدَحَ يَقْدَحُ قَدْحًا‘‘ } (ف) آگ نکالنے کے لیے پتھر پر پتھر مارنا ہے، مراد سم مارنا ہے۔ تیز دوڑتے ہوئے ان کے سم پتھروں پر پڑتے ہیں تو ان میں سے چنگاریاں نکلتی ہیں۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {فَالْمُغِيْرٰتِ صُبْحًا: ’’ فَالْمُغِيْرٰتِ ‘‘ ’’أَغَارَ يُغِيْرُ إِغَارَةً ‘‘} (افعال) سے اسم فاعل {’’مُغِيْرَةٌ‘‘} کی جمع ہے، لُوٹنے کے لیے حملہ کرنے والے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {فَاَثَرْنَ بِهٖ نَقْعًا: ’’ فَاَثَرْنَ ‘‘ ’’أَثَارَ يُثِيْرُ إِثَارَةً‘‘ (افعال) ’’ اَلْغُبَارَ ‘‘} غبار اڑانا۔ {’’ نَقْعًا ‘‘} غبار۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {فَوَسَطْنَ بِهٖ جَمْعًا: ’’ وَسَطْنَ ‘‘ ’’وَسَطَ يَسِطُ وَسْطًا ‘‘ (ض) ’’ اَلْقَوْمَ أَوِ الْمَكَانَ ‘‘} ’’کسی چیز کے درمیان میں ہونا۔‘‘"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 7،6) {اِنَّ الْاِنْسَانَ لِرَبِّهٖ لَكَنُوْدٌ …: ’’ كَنَدَ يَكْنُدُ ‘‘ (ن) ’’كُنُوْدًا‘‘} (کاف کے ضمہ کے ساتھ) {’’اَلنِّعْمَةَ‘‘} نعمت کا انکار کرنا، ناشکری کرنا۔ {’’ كَنُوْدٌ ‘‘} ( کاف کے فتحہ کے ساتھ ) بروزن {’’ فَعُوْلٌ‘‘} بمعنی فاعل برائے مبالغہ ہے، بہت ناشکری کرنے والا۔ یہ مذکر و مؤنث دونوں کے لیے آتا ہے۔ اصل میں {’’كَنُوْدٌ‘‘} اس زمین کو کہتے ہیں جو کوئی چیز نہ اگاتی ہو۔ اس سورت میں پہلی پانچ آیات میں قسمیں اٹھانے کے بعد چھٹی آیت میں یہ حقیقت بیان کی گئی ہے کہ انسان یقینا اپنے رب کا ناشکرا ہے۔ یہ پانچوں قسمیں اس دعوے کی دلیل اور شاہد کے طور پر لائی گئی ہیں۔ اس کی تفصیل یہ ہے کہ گھوڑے اپنے مالک کے ایسے وفادار اور شکر گزار ہیں کہ رات جب وہ انھیں لے کر نکلتے ہیں تو وہ بلاچون و چرا چل پڑتے ہیں، نہ اپنے آرام کی پروا کرتے ہیں اور نہ رات کی تاریکی کی، پھر وہ مالک کے کہنے پر صدق نیت کے ساتھ اس طرح سرپٹ دوڑتے ہیں کہ ان کے جوف سے آواز نکلنے لگتی ہے اور تیزی سے دوڑتے ہوئے ان کے سم جہاں پڑتے ہیں ان کی ٹھوکر اور رگڑ کے ساتھ پتھروں سے چنگاریاں نکلتی جاتی ہیں۔ پھر صبح کے وقت جب ہر چیز آرام کر رہی ہوتی ہے، ان کے مالک انھیں لے کر دشمن کو لوٹنے کے لیے دھاوا بولتے ہیں تو اس وقت بھی وہ غبار اڑاتے ہوئے دوڑتے چلے جاتے ہیں، خواہ غبار کے ساتھ سانس گھٹ رہا ہو، یا آگے دشمن کی تلواریں، تیر اور نیزے ان کے سینے چھید رہے ہوں، یہ کسی بھی چیز کی پروا نہ کرتے ہوئے اسی حالت میں دشمن کی جماعت کے وسط میں جا گھستے ہیں ۔ گھوڑے اپنے اس مالک کے لیے اتنی تگ و دو کرتے ہیں جو ان کی تھوڑی بہت خدمت کرتا ہے، جس نے نہ انھیں پیدا کیا ہے اور نہ ان کا حقیقی رازق ہے، تو کیا انسان اللہ تعالیٰ کے کہنے پر جو اس کا خالق بھی ہے، مالک اور رازق بھی اتنی تگ و دو کرنے اور قربانی دینے پر تیار ہے؟ وہ خود مانے گا کہ یقینا نہیں، تو پھر اس کے ناشکرا ہونے میں کیا شک ہے؟"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7،6) {اِنَّ الْاِنْسَانَ لِرَبِّهٖ لَكَنُوْدٌ …: ’’ كَنَدَ يَكْنُدُ ‘‘ (ن) ’’كُنُوْدًا‘‘} (کاف کے ضمہ کے ساتھ) {’’اَلنِّعْمَةَ‘‘} نعمت کا انکار کرنا، ناشکری کرنا۔ {’’ كَنُوْدٌ ‘‘} ( کاف کے فتحہ کے ساتھ ) بروزن {’’ فَعُوْلٌ‘‘} بمعنی فاعل برائے مبالغہ ہے، بہت ناشکری کرنے والا۔ یہ مذکر و مؤنث دونوں کے لیے آتا ہے۔ اصل میں {’’كَنُوْدٌ‘‘} اس زمین کو کہتے ہیں جو کوئی چیز نہ اگاتی ہو۔ اس سورت میں پہلی پانچ آیات میں قسمیں اٹھانے کے بعد چھٹی آیت میں یہ حقیقت بیان کی گئی ہے کہ انسان یقینا اپنے رب کا ناشکرا ہے۔ یہ پانچوں قسمیں اس دعوے کی دلیل اور شاہد کے طور پر لائی گئی ہیں۔ اس کی تفصیل یہ ہے کہ گھوڑے اپنے مالک کے ایسے وفادار اور شکر گزار ہیں کہ رات جب وہ انھیں لے کر نکلتے ہیں تو وہ بلاچون و چرا چل پڑتے ہیں، نہ اپنے آرام کی پروا کرتے ہیں اور نہ رات کی تاریکی کی، پھر وہ مالک کے کہنے پر صدق نیت کے ساتھ اس طرح سرپٹ دوڑتے ہیں کہ ان کے جوف سے آواز نکلنے لگتی ہے اور تیزی سے دوڑتے ہوئے ان کے سم جہاں پڑتے ہیں ان کی ٹھوکر اور رگڑ کے ساتھ پتھروں سے چنگاریاں نکلتی جاتی ہیں۔ پھر صبح کے وقت جب ہر چیز آرام کر رہی ہوتی ہے، ان کے مالک انھیں لے کر دشمن کو لوٹنے کے لیے دھاوا بولتے ہیں تو اس وقت بھی وہ غبار اڑاتے ہوئے دوڑتے چلے جاتے ہیں، خواہ غبار کے ساتھ سانس گھٹ رہا ہو، یا آگے دشمن کی تلواریں، تیر اور نیزے ان کے سینے چھید رہے ہوں، یہ کسی بھی چیز کی پروا نہ کرتے ہوئے اسی حالت میں دشمن کی جماعت کے وسط میں جا گھستے ہیں ۔ گھوڑے اپنے اس مالک کے لیے اتنی تگ و دو کرتے ہیں جو ان کی تھوڑی بہت خدمت کرتا ہے، جس نے نہ انھیں پیدا کیا ہے اور نہ ان کا حقیقی رازق ہے، تو کیا انسان اللہ تعالیٰ کے کہنے پر جو اس کا خالق بھی ہے، مالک اور رازق بھی اتنی تگ و دو کرنے اور قربانی دینے پر تیار ہے؟ وہ خود مانے گا کہ یقینا نہیں، تو پھر اس کے ناشکرا ہونے میں کیا شک ہے؟"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { وَ اِنَّهٗ لِحُبِّ الْخَيْرِ لَشَدِيْدٌ:} یعنی اس ناشکری کا سبب مال کی شدید محبت اور اس کے نتیجے میں پیدا ہونے والی حرص، طمع اور بخل کی بد عادتیں ہیں جن کی وجہ سے یہ اپنے منعم حقیقی کو بھلا بیٹھا ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { اَفَلَا يَعْلَمُ اِذَا بُعْثِرَ مَا فِي الْقُبُوْرِ:} یعنی انسان اپنے رب کی ناشکری کرتاہے اور مال سے شدید محبت کی وجہ سے اپنے مالک کے حقوق کی ادائیگی میں کوتاہی کرتا ہے، تو کیا وہ اس وقت کو نہیں جانتا جب وہ سب کچھ نکال باہر پھینکا جائے گا جو قبروں میں ہے اور ان میں موجود تمام مردوں کو زندہ کر کے قبروں سے نکال باہر کیا جائے گا؟ {’’ اَفَلَا يَعْلَمُ ‘‘} ( تو کیا وہ اس وقت کو نہیں جانتا ) کا مطلب یہ ہے کہ کیا وہ اس وقت سے نہیں  ڈرتا کہ اپنے مالک کو کیا جواب دے گا؟"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) { وَ حُصِّلَ مَا فِي الصُّدُوْرِ:} دوسرے اعمال تو پہلے ہی ظاہر ہو چکے تھے، مگر دل کی نیت اور ارادے کے متعلق خیال ہو سکتا تھا کہ اسے کون جانتا ہے، تو اس وقت وہ بھی ظاہر کر دیے جائیں گے،جیساکہ فرمایا : « يَوْمَ تُبْلَى السَّرَآىِٕرُ » [الطارق : ۹ ] ’’جس دن پوشیدہ راز ظاہر کیے جائیں گے۔‘‘"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) { اِنَّ رَبَّهُمْ بِهِمْ يَوْمَىِٕذٍ لَّخَبِيْرٌ:} اس آیت پر سوال پیدا ہوتا ہے کہ رب تعالیٰ تو ہمیشہ ہی بندوں کے حالات سے باخبرہے، پھر اس دن کو خاص کیوں فرمایا؟ اس کا جواب یہ ہے کہ اس دن جب ظاہری اعضا سے سرزد ہونے والے اعمال کے علاوہ دلوں کے اعمال ظاہر کرکے ان کی بھی جزا و سزا دی جائے گی، تو اگر پہلے کسی کو شک تھا تو اس دن وہ بھی دور ہو جائے گا کہ یقینا ان کا رب ان کے متعلق خوب خبر رکھنے والا ہے۔"
    }
  ]
}