{
  "surah": "Al-Humaza",
  "surah_number": 104,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) {وَيْلٌ لِّكُلِّ هُمَزَةٍ لُّمَزَةٍ:’’ هُمَزَةٍ لُّمَزَةٍ‘‘ ’’هَمَزَ يَهْمُزُ هَمْزًا‘‘} (ن،ض) اور{’’لَمَزَ يَلْمُزُ لَمْزًا‘‘} (ن، ض) سے مبالغے کے صیغے ہیں، دونوں کے معنی آپس میں اس قدر ملتے ہیں کہ بعض نے انھیں ہم معنی قرار دیا ہے اور بعض نے فرق کیا ہے۔ دونوں کے مفہوم میں ’’اشارہ بازی ، طعن اور عیب لگانا‘‘ شامل ہے۔ دوسری جگہ فرمایا : « وَ لَا تُطِعْ كُلَّ حَلَّافٍ مَّهِيْنٍ (10) هَمَّازٍ مَّشَّآءٍ بِنَمِيْمٍ» [ القلم : 11،10 ] ’’ہر بہت قسمیں کھانے والے حقیر کی اطاعت نہ کر، جو بہت طعنہ مارنے والا ( یا عیب لگانے والا)، چغلی میں بہت دوڑ دھوپ کرنے والا ہے۔‘‘ اور فرمایا : « وَ لَا تَلْمِزُوْۤا اَنْفُسَكُمْ» [ الحجرات : ۱۱ ] ’’اور تم آپس میں عیب نہ لگاؤ۔‘‘"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ {الَّذِيْ جَمَعَ مَالًا وَّ عَدَّدَهٗ:} یعنی لوگوں کی عیب جوئی، ان پر طعنہ زنی اور ان کی تحقیر کا اصل باعث اس کی مال جمع کرنے کی حد سے بڑھی ہوئی خواہش اور شدید بخل ہے۔ اس بخل نے چونکہ اس میں فراخ دلی یا ہمدردی وغیرہ کی کوئی خوبی باقی نہیں چھوڑی، اس لیے وہ اپنی خست و کمینگی پر پردہ ڈالنے کے لیے ہر صاحب خیر پر طعن کرتا اور اس کی عیب جوئی کرتا ہے، تاکہ کوئی اس کے بخل و حرص کی مذمت کی طرف متوجہ ہی نہ ہو سکے۔ منافقین بھی یہی کام کرتے تھے، فرمایا: « اَلَّذِيْنَ يَلْمِزُوْنَ الْمُطَّوِّعِيْنَ مِنَ الْمُؤْمِننِيْنَ فِي الصَّدَقٰتِ وَ الَّذِيْنَ لَا يَجِدُوْنَ اِلَّا جُهْدَهُمْ فَيَسْخَرُوْنَ مِنْهُمْ » [ التوبۃ : ۷۹ ] ’’ یہ وہ لوگ ہیں جو خوشی سے صدقہ کرنے والے مومنوں پر طعنہ زنی کرتے ہیں اور ان پر بھی جن کے پاس اپنی محنت کی کمائی کے علاوہ کچھ نہیں، سو یہ ان سے مذاق کرتے ہیں۔‘‘ اس کے علاوہ وہ زیادہ سے زیادہ مال جمع کرنے کے لیے دوسروں کی بدگوئی اور عیب جوئی کرتا ہے اور اپنے آپ کو صاف ستھرا ظاہر کرتا ہے، تاکہ لوگ ہر سودے اور ہر کام میں کسی اور سے معاملہ کرنے کے بجائے صرف اس سے معاملہ کریں اور اس کا مال بڑھتا رہے۔ اگر {’’ هُمَزَةٍ لُّمَزَةٍ‘‘} کا واضح نقشہ دیکھنا ہو تو جمہوری انتخابات میں کھڑے ہونے والے امیدواروں کے بیانات پڑھ لیں کہ وہ سیٹ کے حصول کے لیے اپنے حریفوں پر کس قدر طعن اور بہتان تراشی کرتے ہیں۔ ¤ ➋ یعنی مال جو انسان کی ضرورت پوری کرنے اور آسائش حاصل کرنے کا ذریعہ تھا، وہ اس کے لیے اصل مطلوب بن گیا۔ اب وہ اسی کو جمع کرنے اور گن گن کر رکھنے کی دھن میں لگا ہوا ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) { يَحْسَبُ اَنَّ مَالَهٗۤ اَخْلَدَهٗ: ’’خَلَدَ يَخْلُدُ خُلُوْدًا‘‘} (ن) ہمیشہ رہنا اور {’’أَخْلَدَ يُخْلِدُ إِخْلَادًا‘‘} (افعال) ہمیشہ رہنے والا بنا دینا۔ {’’ اَخْلَدَهٗ ‘‘} ماضی کا صیغہ ہے، اس لیے آیت کا ترجمہ کیا گیا ہے : ’’وہ گمان کرتا ہے کہ اس کے مال نے اسے ہمیشہ رہنے والا بنا دیا۔‘‘ اس کا طرز عمل بتاتا ہے کہ وہ مال کو موت سے بچانے والا سمجھتا ہے، کیونکہ اتنی عمر ہونے کے باوجود وہ مال جمع ہی کرتا جاتا ہے، نہ اللہ کا حق ادا کرتا ہے نہ بندوں کا، تو اس سے صاف ظاہر ہے کہ وہ سمجھتا ہے کہ یہ جمع کیا ہوا مال اسے مرنے نہیں دے گا بلکہ ہمیشہ زندہ رکھے گا۔ ورنہ ساٹھ ستر برس کی عمر میں اپنے لیے کروڑوں اربوں روپے جمع کرنے اور سیکڑوں برس باقی رہنے والی پختہ اور مضبوط عمارتیں بنانے کا اس کے سوا کیا مطلب ہے کہ یہ مال اور عمارتیں اسے ہمیشہ زندہ رکھیں گی۔ ہود علیہ السلام نے اپنی قوم سے فرمایا تھا : « اَتَبْنُوْنَ بِكُلِّ رِيْعٍ اٰيَةً تَعْبَثُوْنَ (128) وَ تَتَّخِذُوْنَ مَصَانِعَ لَعَلَّكُمْ تَخْلُدُوْنَ» [ الشعراء : ۱۲۸، ۱۲۹ ] ’’کیا تم ہر اونچی جگہ پر ایک یادگار بناتے ہو؟ اس حال میں کہ لاحاصل کام کرتے ہو۔ اور بڑی بڑی عمارتیں بناتے ہو، شاید کہ تم ہمیشہ رہو گے۔ ‘‘"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {كَلَّا لَيُنْۢبَذَنَّ فِي الْحُطَمَةِ:’’ لَيُنْۢبَذَنَّ ‘‘ ’’نَبَذَ يَنْبِذُ نَبْذًا‘‘‘‘} (ض) (کسی چیز کو خاطر میں نہ لاتے ہوئے پھینک دینا) سے واحد مذکر غائب مضارع مجہول بانون تاکید ثقیلہ ہے جو قسم کا مفہوم ادا کرتا ہے، یعنی یہ خیال ہر گز درست نہیں، بلکہ قسمیہ بات یہ ہے کہ اسے ہر حال میں اس دنیا سے جانا ہے۔ پھر اسے اس کے برے اعمال کی پاداش میں ’’حطمہ‘‘ میں پھینک دیا جائے گا۔ پھینکنے کے لفظ سے اس کی تذلیل و تحقیر نمایاں ہو رہی ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {وَ مَاۤ اَدْرٰىكَ مَا الْحُطَمَةُ:} یہ سوال اس کی ہولناکی بیان کرنے کے لیے ہے، یعنی تم جان ہی نہیں سکتے کہ وہ کس قدر خوف ناک چیز ہے۔ {’’ الْحُطَمَةُ ‘‘ ’’حَطَمَ يَحْطِمُ‘‘} (ض) سے مبالغے کا صیغہ ہے، یعنی بہت ہی زیادہ توڑ پھوڑ دینے والی۔ اس میں جو چیز ڈالی جائے گی اسے توڑ پھوڑ کر رکھ دے گی، بلکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَقَدْ رَأَيْتُ جَهَنَّمَ يَحْطِمُ بَعْضُهَا بَعْضًا ] [ بخاري، العمل في الصلاۃ، باب إذا انفلتت الدابّۃ في الصلاۃ : ۱۲۱۲ ] ’’یقینا میں نے جہنم کو دیکھا کہ اس کے اپنے حصے ایک دوسرے کو توڑ رہے تھے۔‘‘"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {نَارُ اللّٰهِ الْمُوْقَدَةُ: ’’ نَارُ اللّٰهِ ‘‘} (اللہ کی آگ) اور{’’ الْمُوْقَدَةُ ‘‘} (بھڑکائی ہوئی)کہنے میں اس آگ کی جو ہولناکی بیان ہوئی ہے وہ کسی اور لفظ میں بیان ہو ہی نہیں سکتی۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {الَّتِيْ تَطَّلِعُ عَلَى الْاَفْـِٕدَةِ: ’’ تَطَّلِعُ ‘‘ ’’اِطَّلَعَ يَطَّلِعُ اِطِّلَاعًا‘‘} (افتعال) جھانکنا۔ {’’ الْاَفْـِٕدَةِ ‘‘ ’’فُؤَادٌ‘‘} کی جمع ہے، دل۔ ’’جو دلوں پر جھانکتی ہے‘‘ یعنی وہ صاحبِ شعور ہے، دلوں میں جو کفر و نفاق اور بخل و کمینگی ہے یا ایمان اور سخاوت و کرم ہے سب دیکھ لیتی ہے اور جلاتی اسی کو ہے جو جلانے کے قابل ہے۔ دوسرا مطلب یہ ہے کہ دنیا کی آگ بھی اگرچہ ہر چیز کو جلا ڈالتی ہے، مگر یہ آگ دل تک پہنچنے سے پہلے ہی آدمی کی موت واقع ہو جاتی ہے، جبکہ جہنم کی آگ جسم کو جلاتے ہوئے دل تک پہنچ جائے گی مگر آدمی مرے گا نہیں۔ دلوں تک آگ اس لیے پہنچے گی کہ دل ہی گندے عقائد، خبیث نیتوں اور کفر و نفاق کا مرکز ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 9،8) {اِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ …: ’’أَوْصَدَ يُوْصِدُ إِيْصَادًا‘‘ (افعال) ’’اَلْببَابَ‘‘} دروازہ بند کر دینا۔ {’’ مُؤْصَدَةٌ ‘‘} اسم مفعول ہے، بند کی ہوئی۔{’’ عَمَدٍ ‘‘ ’’عَمُوْدٌ‘‘} کی جمع ہے، یعنی انھیں جہنم میں لمبے لمبے ستونوں کے ساتھ باندھ کر چاروں طرف سے بند کر دیا جائے گا، حتیٰ کہ کوئی دروازہ یا کھڑکی بلکہ کوئی شگاف یا درز بھی باقی نہیں چھوڑی جائے گی۔ [ أَعَاذَنَا اللّٰہُ مِنْھَا ] دوسرا معنی یہ ہے کہ اس آگ کے شعلے لمبے لمبے ستونوں کی شکل میں ہوں گے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9،8) {اِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ …: ’’أَوْصَدَ يُوْصِدُ إِيْصَادًا‘‘ (افعال) ’’اَلْببَابَ‘‘} دروازہ بند کر دینا۔ {’’ مُؤْصَدَةٌ ‘‘} اسم مفعول ہے، بند کی ہوئی۔{’’ عَمَدٍ ‘‘ ’’عَمُوْدٌ‘‘} کی جمع ہے، یعنی انھیں جہنم میں لمبے لمبے ستونوں کے ساتھ باندھ کر چاروں طرف سے بند کر دیا جائے گا، حتیٰ کہ کوئی دروازہ یا کھڑکی بلکہ کوئی شگاف یا درز بھی باقی نہیں چھوڑی جائے گی۔ [ أَعَاذَنَا اللّٰہُ مِنْھَا ] دوسرا معنی یہ ہے کہ اس آگ کے شعلے لمبے لمبے ستونوں کی شکل میں ہوں گے۔"
    }
  ]
}