{
  "surah": "Al-Fil",
  "surah_number": 105,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "اس سورت میں اللہ تعالیٰ نے اہلِ مکہ پر اپنا احسان ذکر فرمایا ہے کہ اس نے کس معجزانہ طریقے سے بیت اللہ کی حفاظت فرمائی اور اس کو گرانے کے لیے آنے والوں کو تباہ و برباد کر دیا۔ اگر اللہ تعالیٰ اس بادشاہ کو برباد نہ کرتا تو اہلِ مکہ جس امن و چین اور آزادی کے ساتھ بیٹھے ہیں یہ امن و چین انھیں کہاں نصیب ہوتا؟ سیرت کی کتابوں میں لکھا ہے کہ رسول اللہ صلی اللہ علیہ وسلم اس واقعہ کے پچاس یا پچپن روز بعد پیدا ہوئے۔ ¤ (آیت 1) ➊ {اَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ … : ’’ اَلَمْ تَرَ ‘‘} کا لفظی معنی ہے ’’کیا تونے نہیں دیکھا؟‘‘ مگر مجاہد رحمہ اللہ ( جو ابن عباس رضی اللہ عنھما کے شاگرد ہیں) نے اس کا معنی کیا ہے : {’’أَلَمْ تَعْلَمْ‘‘} ’’کیا تجھے معلوم نہیں؟‘‘ [ بخاري، التفسیر، باب سورۃ الفیل، قبل ح : ۴۹۶۴ ] جب قرآن اترا اس وقت یہ واقعہ اتنا معروف تھا گویا لوگوں کا آنکھوں دیکھا واقعہ ہو۔ بعض لوگوں نے اس لفظ سے یہ کشید کرنے کی کوشش کی ہے کہ نبی صلی اللہ علیہ وسلم نے یہ واقعہ خود اپنی آنکھوں سے دیکھا تھا اور یہ کہ آپ عالم الغیب تھے۔ درحقیقت یہ کہنا کلام عرب اور اسلوب قرآن سے ناواقفیت کا نتیجہ ہے، اللہ تعالیٰ نے فرمایا : « اَوَ لَمْ يَرَ الْاِنْسَانُ اَنَّا خَلَقْنٰهُ مِنْ نُّطْفَةٍ فَاِذَا هُوَ خَصِيْمٌ مُّبِييْن» [ یٰس : ۷۷] ’’ اور کیا انسان نے دیکھا نہیں کہ ہم نے اسے ایک نطفہ سے پیدا کیا تو اچانک وہ کھلا جھگڑالو ہے۔‘‘ اب کیا کسی انسان نے اپنے آپ کو نطفہ سے پیدا ہوتے ہوئے دیکھا ہے؟ یہاں بھی یہی مطلب ہے کہ ’’کیا تجھے معلوم نہیں کہ تیرے رب نے ہاتھی والوں کے ساتھ کیا کیا؟‘‘ {’’أَلَمْ تَعْلَمْ‘‘} (کیا تو نے نہیں جانا) کے بجائے {’’ اَلَمْ تَرَ ‘‘} (کیا تو نے نہیں دیکھا) کہنے کا مطلب یہ ہے کہ یہ اتنا یقینی واقعہ ہے کہ سمجھو تم نے اسے آنکھوں سے دیکھا ہے۔ ¤ ➋ ’’ہاتھی والوں‘‘ سے مراد یمن کا ایک نصرانی حاکم ابرہہ اور اس کا لشکرہے۔ ابرہہ نے ایک عظیم الشان گرجا بنا کر یہ چاہا کہ لوگ کعبہ کی طرح اس کی زیارت کے لیے آیا کریں۔ جب وہ اپنے ارادے میں کامیاب نہ ہو سکا تو وہ ایک بہت بڑا لشکر جس کے ساتھ ہاتھی بھی تھے، اپنے ہمراہ لے کر بیت اللہ کو ڈھانے کی نیت سے مکہ پہنچا۔ جب مزدلفہ اور منیٰ کے درمیان اس وادی میں پہنچا جس کا نام بعد میں وادی محسر پڑا تو اللہ تعالیٰ کے حکم سے گروہ در گروہ پرندے نمودار ہوئے، جن کے پنجوں اور چونچوں میں کنکر تھے، انھوں نے اس لشکر پر وہ کنکریاں پھینکیں جن سے ابرہہ اور اس کا لشکر ہلاک ہوگیا۔ یہ سیرت اور تاریخ میں مذکور واقعے کا خلاصہ ہے۔ (دیکھیے سیرت ابن ہشام اور تفسیر ابن کثیر ) ¤ صحیح اسانید کے ساتھ رسول اللہ صلی اللہ علیہ وسلم سے بھی اس واقعے کا مختصر ذکر موجود ہے، آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ حَبَسَ عَنْ مَكَّةَ الْفِيْلَ ، وَسَلَّطَ عَلَيْهَا رَسُوْلَهُ وَالْمُؤْمِنِيْنَ ، فَإِنَّهَا لاَ تَحِلُّ لِأَحَدٍ كَانَ قَبْلِيْ، وَ إِنَّهَا أُحِلَّتْ لِيْ سَاعَةً مِّنْ نَهَارٍ ، وَ إِنَّهَا لَنْ تَحِلَّ لِأَحَدٍ بَعْدِيْ ] [ بخاري، اللقطۃ، باب کیف تعرّف لقطۃ أھل مکۃ ؟ : ۲۴۳۴ ] ’’اللہ تعالیٰ نے مکہ سے ہاتھیوں کو روک دیا اور اس پر اپنے رسول اور ایمان والوں کو غلبہ عطا فرما دیا، تو یہ مجھ سے پہلے کسی کے لیے حلال نہیں ہوا اور میرے لیے بھی دن کی ایک گھڑی کے لیے حلال ہوا ہے۔ اب میرے بعد کسی کے لیے (اس میں لڑنا) حلال نہیں ہوگا۔‘‘ دوسری حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم حدیبیہ کے زمانے میں نکلے، جب اس گھاٹی پر پہنچے جہاں سے مکہ میں اترا جاتا تھا تو آپ کی اونٹنی بیٹھ گئی، لوگوں نے ( اسے اٹھانے کے لیے) کہا : [ حَلْ حَلْ ] لیکن وہ بیٹھی رہی۔ لوگوں نے کہا : ’’قصواء اَڑ گئی، قصواء اَڑ گئی۔‘‘ تو نبی صلی اللہ علیہ وسلم نے فرمایا : [ مَا خَلَأَتِ الْقَصْوَاءُ، وَمَا ذَاكَ لَهَا بِخُلُقٍ ، وَلٰكِنْ حَبَسَهَا حَابِسُ الْفِيْلِ ] [بخاري، الشروط، باب الشروط في الجہاد : ۲۷۳۱، ۲۷۳۲] ’’قصواء اَڑی نہیں اور نہ یہ اس کی عادت ہے، اسے تو ہاتھیوں کو روکنے والے نے روک دیا ہے۔‘‘ ان احادیث سے ثابت ہوتا ہے کہ ہاتھی والے جب مکہ پر حملے کے لیے آئے تو اللہ تعالیٰ نے انھیں روک دیا تھا۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) { اَلَمْ يَجْعَلْ كَيْدَهُمْ فِيْ تَضْلِيْلٍ: ’’ تَضْلِيْلٍ ‘‘} کا لفظی معنی گمراہ کرناا ہے، یعنی ان کی تدبیر اس طرف نہیں جانے دی جس طرف وہ لے جانا چاہتے تھے۔ دوسرے لفظوں میں ان کی تدبیر سیدھی نہیں پڑنے دی۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {وَ اَرْسَلَ عَلَيْهِمْ …: ’’ اَبَابِيْلَ ‘‘} عام طور پر ایک خاص قسم کی چڑیوں کو ’’ابابیل ‘‘ کہا جاتا ہے، مگر یہ درست نہیں۔ {’’ اَبَابِيْلَ ‘‘} ان گھوڑوں یا پرندوں کو کہا جاتا ہے جو گروہ در گروہ اور جھنڈ کے جھنڈ آئیں۔ یہ لفظ جمع ہی استعمال ہوتا ہے، بعض نے اس کی واحد {’’ إِبَّالَةٌ ‘‘} بیان کی ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {تَرْمِيْهِمْ بِحِجَارَةٍ مِّنْ سِجِّيْلٍ: ’’ سِجِّيْلٍ ‘‘} کی تفسیر میں ابن عباس رضی اللہ عنھما نے فرمایا : [ هِيَ سَنْكِ وَكِلْ ] [ بخاري، التفسیر، باب سورۃ : { ألم تر }، قبل ح : ۴۹۶۴ ] ’’اس سے مراد سنگ و گل ہے۔‘‘ یعنی پکی ہوئی مٹی جسے کھنگر کہا جاتا ہے۔ لاوا اگلنے والے پہاڑوں کے ارد گرد اس قسم کے جلے ہوئے سخت سنگریزے عام ملتے ہیں۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {فَجَعَلَهُمْ كَعَصْفٍ مَّاْكُوْلٍ: ’’عَصْفٌ‘‘} اناج کے دانوں سے جو چھلکا اترتا ہے، بھوسا، توڑی۔ {’’ مَاْكُوْلٍ ‘‘ ’’أَكَلَ يَأْكُلُ أَكْلاً ‘‘} (ن) سے اسم مفعول ہے، کھایا ہوا، کھائے ہوئے بھس سے مراد جانور کی لید ہے، کیونکہ جانور بھس کھا کر لید کرتا ہے اور پھر وہ خشک ہو کر ادھر ادھر بکھر جاتی ہے۔ سنگریزوں کے عذاب سے ان کے اعضا کے بکھر جانے کو اس کے ساتھ تشبیہ دی ہے۔( طبری) اللہ تعالیٰ الفاظ کے استعمال میں اعلیٰ درجے کی شائستگی اختیار فرماتے ہیں، اس مفہوم کو ’’لید‘‘ کے بجائے ’’کھائے ہوئے بھس ‘‘ کے الفاظ میں ادا کیا ہے، اس سے ان کی زبوں حالی بھی نمایاں ہو رہی ہے۔ (قاسمی بحوالہ شہاب) یہ معنی بھی ہو سکتا ہے کہ جانوروں کے کھانے کے بعد جو بھوسا بچ جاتا ہے اسے وہ پاؤں میں روند دیتے ہیں اور وہ ادھر اُدھر بکھر جاتا ہے، وہ اس بھوسے کی طرح ہو گئے۔"
    }
  ]
}