{
  "surah": "Al-Falaq",
  "surah_number": 113,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "کسی بھی قسم کے شر سے اللہ تعالیٰ کی پناہ مانگنے کے لیے سورۂ فلق اور سورۂ ناس جیسی کوئی چیز نہیں۔ ان سورتوں میں تمام جسمانی و روحانی آفات سے بچانے اور انھیں دور کرنے کی زبردست تاثیر موجود ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں سورتوں کی بہت فضیلت بیان فرمائی ہے، خصوصاً پناہ کے باب میں ان کو بے مثل قرار دیا ہے۔ یہاں چند احادیث درج کی جاتی ہیں : (1) عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَلَمْ تَرَ آيَاتٍ أُنْزِلَتِ اللَّيْلَةَ لَمْ يُرَ مِثْلُهُنَّ قَطُّ : «قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ » وَ « قُلْ اَعُوْذُ بِرَبِّ النَّاسِ » ] [مسلم، صلاۃ المسافرین، باب فضل قراء ۃ المعوذتین : ۸۱۴] ’’کیا تم نے وہ آیات نہیں دیکھیں جو آج رات نازل کی گئی ہیں، جن کی مثل کبھی دیکھی ہی نہیں گئی؟ وہ سورۂ فلق اور سورۂ ناس ہیں۔‘‘ (2) ابن عابس جہنی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : [ أَلاَ أُخْبِرُكَ بِأَفْضَلِ مَا يَتَعَوَّذُ بِهِ الْمُتَعَوِّذُوْنَ؟ قَالَ بَلٰي يَا رَسُوْلَ اللّٰهِ! قَالَ « قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ» وَ « قُلْ اَعُوْذُ بِرَبِّ النَّاسِ » هَاتَيْنِ السُّوْرَتَيْنِ ] [ نسائي، الاستعاذۃ، باب ما جاء في سورتي المعوذتین : ۵۴۳۴ ] ’’کیا میں تمھیں سب سے بہتر وہ چیز نہ بتاؤں جس کے ساتھ پناہ پکڑنے والے پناہ پکڑتے ہیں؟‘‘ انھوں نے کہا : ’’کیوں نہیں، اے اللہ کے رسول!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : {’’ قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ ‘‘} اور {’’ قُلْ اَعُوْذُ بِرَبِّ النَّاسِ ‘‘} یہ دو سورتیں۔‘‘ ¤ (3) عبداللہ بن خبیب رضی اللہ عنہ بیان کرتے ہیں : [ خَرَجْنَا فِيْ لَيْلَةٍ مَّطِيْرَةٍ وَظُلْمَةٍ شَدِيْدَةٍ نَطْلُبُ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيْ لَنَا، قَالَ فَأَدْرَكْتُهُ، فَقَالَ قُلْ، فَلَمْ أَقُلْ شَيْئًا، ثُمَّ قَالَ قُلْ، فَلَمْ أَقُلْ شَيْئًا، قَالَ قُلْ، فَقُلْتُ مَا أَقُوْلُ؟ قَالَ قُلْ « قُلْ هُوَ اللّٰهُ اَحَدٌ» وَالْمُعَوِّذَتَيْنِ حِيْنَ تُمْسِيْ وَ تُصْبِحُ ثَلاَثَ مَرَّاتٍ تَكْفِيْكَ مِنْ كُلِّ شَيْءٍ ] [ترمذي، الدعوات، باب الدعاء عند النوم : ۳۵۷۵، وقال الألباني حسن ] ’’ہم ایک بارش اور سخت اندھیرے والی رات میں نکلے، ہم رسول اللہ صلی اللہ علیہ وسلم کو تلاش کر رہے تھے، تاکہ آپ ہمیں نماز پڑھائیں۔ چنانچہ میں آپ سے جا ملا، تو آپ نے فرمایا : ’’کہو۔‘‘ میں نے کچھ نہ کہا، آپ نے پھر فرمایا : ’’کہو۔‘‘ تو میں نے کچھ نہ کہا۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا : ’’کہو۔‘‘ میں نے کہا : ’’میں کیا کہوں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : {’’ قُلْ هُوَ اللّٰهُ اَحَدٌ ‘‘} اور معوذتین صبح و شام تین تین مرتبہ کہہ، یہ تجھے ہر چیز سے کافی ہو جائیں گی۔‘‘ (4) ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں : ’’معوذ تین نازل ہونے سے پہلے رسول اللہ صلی اللہ علیہ وسلم جنوں سے اور انسان کی نظر سے پناہ مانگا کرتے تھے، جب معوذتین اتریں تو آپ نے ان دونوں کو معمول بنا لیا اور ان کے علاوہ کو چھوڑ دیا۔‘‘ [ ترمذي، الاستعاذۃ، باب ما جاء في الرقیۃ بالمعوذتین : ۲۰۵۸ ] ترمذی نے اسے حسن صحیح اور البانی نے صحیح کہا ہے۔ (5) عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے معوذتین کے متعلق پوچھا۔ عقبہ فرماتے ہیں کہ (ہم نے یہ سوال کیا تو) رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ان دونوں سورتوں کے ساتھ صبح کی جماعت کروائی۔ [ نسائي، الاستعاذۃ، باب ما جاء في سورتي المعوذتین : ۵۴۳۶، وصححہ الألباني ] اس سے معلوم ہوا کہ ان کا نام معوذتین معروف تھا اور یہ بھی معلوم ہوا کہ آپ نے لمبی سورتوں کی جگہ انھیں کافی قرار دیا۔ [ دیکھیے ترمذي، الاستعاذۃ، باب ما جاء في الرقیۃ بالمعوذتین : ۲۰۵۸] ¤ (6) عائشہ رضی اللہ عنھا فرماتی ہیں : ’’رسول اللہ صلی اللہ علیہ وسلم ہر رات جب اپنے بستر پر آتے تو دونوں ہتھیلیوں کو جمع کرتے پھر ان میں پھونکتے۔ دونوں میں {’’ قُلْ هُوَ اللّٰهُ اَحَدٌ ‘‘، ’’ قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ ‘‘} اور {’’ قُلْ اَعُوْذُ بِرَبِّ النَّاسِ ‘‘} پڑھتے، پھر دونوں ہتھیلیوں کو اپنے جسم پر جہاں تک ہو سکتا پھیرتے۔ پھیرنے کی ابتدا سر ،چہرے اور جسم کے سامنے والے حصے سے کرتے۔ آپ اس طرح تین مرتبہ کرتے۔‘‘ [ بخاري، فضائل القرآن، باب فضل المعوذات : ۵۰۱۷ ] (7) عائشہ رضی اللہ عنھا ہی سے روایت ہے : ’’رسول اللہ صلی اللہ علیہ وسلم جب بیمار ہوتے تو اپنے آپ پر معوذات پڑھ کر پھونکتے تھے۔ جب آپ کا درد بہت بڑھ گیا تو میں آپ پر پڑھتی اور آپ ہی کا ہاتھ اس ہاتھ کی برکت کی امید سے (آپ کے جسم پر) پھیرتی تھی۔‘‘ [ بخاري، الاستعاذۃ، باب ما جاء في المعوذات : ۵۰۱۶ ] ان احادیث سے معلوم ہوا کہ ان تینوں سورتوں کو مذکورہ اوقات میں روزانہ پڑھنا چاہیے، یہ ہر قسم کی روحانی اور جسمانی بیماریوں سے بھی محفوظ رکھتی ہیں اور جن و انس میں سے شیاطین کے شرور و آفات سے بھی اللہ کی پناہ میں رکھتی ہیں۔ ¤ تنبیہ : جب ہم {’’أَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ‘‘} یا معوذات پڑھتے ہیں تو ان کے ذریعے سے اللہ تعالیٰ کی پناہ مانگنے کا مطلب یہ نہیں کہ صرف زبان سے یہ الفاظ ادا کر دیے جائیں، بلکہ ضروری ہے کہ وہ تمام خیالات، خواہشات اور اعمال ترک کرنے کی کوشش کی جائے جو شیطان کو پسند ہیں۔ جس طرح کسی شخص پر کوئی درندہ حملہ آور ہو تو اس کا صرف یہ کہنا کافی نہیں کہ میں فلاں قلعہ میں پناہ لیتا ہوں، بلکہ اسے اس قلعہ میں پہنچنے کی جدو جہد بھی کرنا ہو گی۔ اسی طرح دشمن کے حملے سے اللہ کی پناہ طلب کرنے والے اور اس پر فتح و نصرت کی دعا کرنے والے کے لیے پناہ اور دعا کے الفاظ ہی منہ سے ادا کر دینا کافی نہیں، بلکہ دشمن کے خلاف تیاری، میدان میں نکلنا اور قتل و قتال کے لیے تیار رہنا بھی ضروری ہے۔ اس کے ساتھ دعا بھی کی جائے تو واقعی اللہ تعالیٰ کی پناہ بھی حاصل ہوتی ہے اور اس کی حفاظت بھی۔ اسی طرح اگر کوئی شخص عملاً تو ہر بات میں شیاطین الانس والجن کی پیروی کرے، مگر منہ سے اللہ کی پناہ طلب کرتا رہے تو یہ پناہ طلب کرنا اسے شیاطین سے اور ان کے وسوسوں سے نہیں بچا سکتا۔ اس کی ایک جامع مثال یہ ہے کہ ’’لا الٰہ الا اللہ ‘‘ کہنے والا شخص یقینا جنت میں جائے گا، اس پر جہنم کی آگ حرام ہے، مگر کیا صرف یہ الفاظ ادا کرنے والا جہنم سے اللہ کی پناہ میں چلا جاتا ہے؟ نہیں، بلکہ وہ جو {’’صَادِقًا مِّنْ قَلْبِهِ‘‘} ہو، یعنی سچے دل سے صرف اللہ کو معبود برحق مانے اور اسی کی عبادت کرے، اس کے لیے یہ فضیلت ہے۔ اگر وہ کسی غیر کو یا اپنی خواہش نفس ہی کو اپنا معبود بنا لے تو پھر کروڑ دفعہ بھی ’’لا الٰہ الا اللہ‘‘ پڑھتا رہے تو جہنم سے نہیں بچ سکتا۔ (ملخص از قاسمی) ¤ (آیت 1) ➊ {قُلْ اَعُوْذُ … : ’’ اَعُوْذُ ‘‘ ’’عَاذَ يَعُوْذُ عَوْذًا وَمَعَاذًا‘‘} (ن) پناہ پکڑنا۔ پناہ لینے کا مطلب یہ ہے کہ آدمی کسی چیز سے خوف محسوس کرے اور سمجھے کہ میں اس کا مقابلہ نہیں کر سکتا تو اس سے بچنے کے لیے وہ کسی دوسرے کی حفاظت میں چلا جائے یا کسی چیز کی آڑ لے لے۔ ظاہر ہے پناہ اسی کی لی جاتی ہے جس کے متعلق سمجھا جائے کہ وہ اس خوف ناک چیز سے بچا سکتا ہے۔ پناہ بعض اوقات ایسی چیزوں کی لی جاتی ہے جنھیں اللہ تعالیٰ نے بعض خوف ناک چیزوں سے بچنے کا سبب بنا دیا ہے، مثلاً دشمن سے بچنے کے لیے کسی قلعہ یا خندق یا مورچے وغیرہ کی پناہ لینا اور کسی ظالم سے بچنے کے لیے کسی طاقتور آدمی یا قوم کی پناہ لینا، یہ پناہ کسی بھی چیز کی لی جا سکتی ہے اور بعض اوقات یہ سمجھ کر پناہ لی جاتی ہے کہ وہ خطرات جن میں دنیا کے بچاؤ کے تمام ذرائع و اسباب بے کار ہو جائیں ان میں فلاں ہستی بچا سکتی ہے۔ سورۂ فلق اور سورۂ ناس میں جس پناہ کا ذکر ہے، بلکہ قرآن و حدیث میں جہاں بھی اللہ سے پناہ مانگی گئی ہے اس سے مراد پناہ کی دوسری قسم ہے۔ اللہ تعالیٰ کے علاوہ کسی دوسرے سے یہ پناہ مانگنا شرک ہے۔ مشرک لوگ اپنے تحفظ کے لیے اللہ کو چھوڑ کر دیوی دیوتاؤں ، جنوں ، فرشتوں یا پیروں، پیغمبروں کی پناہ لیتے اور ان کو مدد کے لیے پکارتے ہیں۔ اللہ تعالیٰ نے ان سورتوں میں تعلیم دی کہ ایسے تمام خطرات سے بچنے کے لیے میری ان صفات کی پناہ لو جن سے ثابت ہو رہا ہے کہ ایسے تمام خطرات سے میں ہی تمھیں بچا سکتا ہوں۔ ¤ ➋ {بِرَبِّ الْفَلَقِ: ’’فَلَقَ يَفْلِقُ فَلَقًا‘‘} ( ض ) پھاڑنا۔ یہاں مصدر {’’ الْفَلَقِ ‘‘} مفعول {’’مَفْلُوْقٌ‘‘} کے معنی میں ہے۔ اس کی تفسیر میں معتبر اقوال دو ہیں، پہلا قول جابربن عبداللہ رضی اللہ عنھما کا ہے جو ابن ابی حاتم نے حسن سند کے ساتھ بیان کیا ہے، ان کے علاوہ کئی تابعین کا بھی یہی قول ہے کہ {’’ الْفَلَقِ ‘‘} کا معنی صبح ہے، کیونکہ صبح رات کی تاریکی کو پھاڑ کر نمودار ہوتی ہے۔ اللہ تعالیٰ نے فرمایا : « فَالِقُ الْاِصْبَاحِ » [ الأنعام : ۹۶] ’’یعنی وہ رات کی تاریکی کو پھاڑ کر صبح لانے والا ہے۔‘‘ صبح کے رب کی پناہ لینے کا مطلب یہ ہے کہ جو رب رات کی تاریکی کو دور کرکے روشن صبح لانے والا ہے میں ساری مخلوق کے شر سے اس کی پناہ مانگتا ہوں، کیونکہ جب وہ رات کی تاریکی کو دور کر دیتا ہے، جس میں بے شمار شر ور پائے جاتے ہیں تو اس کے لیے دوسرے شرور کو دور کرنا اور ان سے بچانا تو معمولی بات ہے۔ دوسرا قول ابن عباس رضی اللہ عنھما کا ہے جو طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ بیان کیا ہے اور ضحاک کا قول بھی یہی ہے کہ {’’ الْفَلَقِ ‘‘} سے وہ تمام چیزیں مراد ہیں جنھیں اللہ تعالیٰ نے کسی چیز کو پھاھاڑ کر نکالا ہے، مثلاً زمین سے نباتات، پہاڑوں سے چشمے، بادلوں سے بارش اور رحم مادر اور انڈوں سے حیوانات۔ ان کے علاوہ جہاں بھی پیدائش کا معاملہ ہے اکثر میں انشقاق ( پھٹنے ) کا سلسلہ موجود ہے۔ گویا {’’ الْفَلَقِ ‘‘} کا معنی مخلوق ہے، مطلب یہ ہوگا کہ میں ساری مخلوق کے مالک کی پناہ پکڑتا ہوں کہ وہ مجھے اپنی مخلوق کے شر سے بچا لے۔ یہ معنی زیادہ جامع ہے، اس لیے ترجمہ میں اسی کو اختیار کیا گیا ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ {مِنْ شَرِّ مَا خَلَقَ:} ’’اس چیز کے شر سے جو اس نے پیدا کی‘‘ اس میں ہر مخلوق کے ہر شر سے پناہ مانگ لی گئی ہے۔ کوئی نقصان، تکلیف یا پریشانی باقی نہیں رہی جو اس میں نہ آگئی ہو۔ حقیقت یہ ہے کہ پناہ مانگنے کے لیے یہ بہت ہی جامع سورت ہے، کیونکہ جب بندہ ساری مخلوق کے ہر شر سے بچنے کے لیے اس کے رب کی پناہ میں چلا گیا تو پھر مخلوق میں سے کون ہے جو اسے نقصان پہنچا سکے اور اگر وہ مالک ہی اپنی مخلوق کو نقصان پہنچانے سے نہ روکے تو مخلوق کے شر سے کون بچ سکتا ہے؟ ¤ ➋ اس آیت میں مخلوق کے اس شر سے بھی پناہ مانگ لی گئی جو پہنچ چکا ہے، تاکہ اللہ تعالیٰ اسے دور کر دے اور اس سے بھی جس کا خوف ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { وَ مِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَ:} اگرچہ ساری مخلوق کے شر سے پناہ مانگنے کے بعد کوئی چیز باقی نہیں رہی جس کے شر سے پناہ مانگی جائے، مگر مخلوق میں سے چند چیزوں کے شر سے خاص طور پر پناہ مانگنے کا سبق دیا گیا، کیونکہ یہ بہت ہی خوف ناک ہیں اور ان کے شر سے پناہ مانگنے کی تو بہت ہی ضرورت ہے۔ ¤ ➋ { ’’ غَاسِقٍ ‘‘} کا معنی ہے تاریک ، سخت اندھیرے والی۔ قاموس میں ہے : {’’غَسَقَ اللَّيْلُ أَيْ اِشْتَدَّتْ ظُلْمَتُهٗ‘‘} ’’یعنی {’’غَسَقَ اللَّيْلُ ‘‘} کا معنی یہ ہے کہ رات کی تاریکی بہت سخت ہوگئی۔‘‘ سورۂ بنی اسرائیل میں فرمایا : « اِلٰى غَسَقِ الَّيْلِ» [ بني إسرائیل : ۸۷ ] ’’رات کے سخت تاریک ہونے تک۔‘‘ {’’ وَقَبَ ‘‘} (ض) داخل ہونا ، غائب ہونا۔ فرّاء نے {’’ غَاسِقٍ اِذَا وَقَبَ ‘‘} کا معنی کیا ہے: {’’ اَللَّيْلُ إِذَا دَخَلَ كُلَّ شَيْءٍ وَ أَظْلَمَ‘‘} ’’ رات جب ہر چیز پر چھا جائے اور تاریک ہو جائے۔‘‘ تاریک رات کے شر سے خاص طور پر پناہ مانگنے کی تلقین اس لیے کی گئی ہے کہ اندھیری رات میں بے شمار شرور و خطرات ہوتے ہیں، اکثر مجرم، چور، ڈاکو، زانی، قاتل اور شب خون مارنے والے رات ہی کو نکلتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم کو رات ہی میں قتل کرنے کے منصوبے بنائے گئے، تاکہ نہ آپ بچاؤ کر سکیں اور نہ قاتل کا پتا چل سکے۔ جنگلی جانوروں مثلاً شیر، چیتے، بھیڑیے وغیرہ اور حشرات الارض مثلاً سانپ ، بچھو وغیرہ کا خطرہ رات کو زیادہ ہو جاتا ہے اور مچھر، کھٹمل وغیرہ رات کو جو تکلیف دیتے ہیں سب جانتے ہیں۔ ڈاکٹروں کی تحقیق کے مطابق اکثر بیماریوں کے جراثیم اندھیرے میں پیدا ہوتے ہیں اور سورج کی روشنی میں ہلاک ہو جاتے ہیں۔ اندھیرے میں وہمی چیزوں کا خوف مزید بڑھ جاتا ہے۔ ان سب پر مزید یہ کہ ان سب شرور کے اندھیرے میں واقع ہونے کی وجہ سے انسان ان سے اپنا بچاؤ بھی نہیں کر سکتا، اس لیے اندھیری رات کی برائیوں سے پناہ مانگنے کی تعلیم دی گئی۔ ¤ ➌ عائشہ رضی اللہ عنھا سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے چاند دیکھا تو فرمایا : [ يَا عَائِشَةُ! اسْتَعِيْذِيْ بِاللّٰهِ مِنْ شَرِّ هٰذَا، فَإِنَّ هٰذَا هُوَ الْغَاسِقُ إِذَا وَقَبَ ] [ ترمذي، تفسیر القرآن، باب ومن سورۃ المعوذتین : ۳۳۶۶، وصححہ الترمذي والألباني ] ’’اے عائشہ! اس کے شر سے اللہ تعالیٰ کی پناہ مانگو، کیونکہ یہی {’’ غَاسِقٍ اِذَا وَقَبَ ‘‘} ہے۔‘‘ اس صورت میں {’’ غَاسِقٍ ‘‘} کا معنی ’’اندھیرے والا‘‘ اور {’’ اِذَا وَقَبَ ‘‘} کا معنی {’’ إِذَا غَابَ ‘‘} ہے، یعنی ’’جب غائب ہو جائے۔‘‘ شاہ رفیع الدین نے ترجمہ یوں کیا ہے : ’’اور برائی اندھیرا کرنے والے کی سے، جب وہ چھپ جائے۔‘‘ یعنی چاند غروب ہو کر اندھیرا پھیلا دیتا ہے۔ بعض مفسرین نے {’’ غَاسِقٍ اِذَا وَقَبَ ‘‘} سے سورج مراد لیا  ہے، کیونکہ سورج غائب ہو کر سخت تاریکی پھیلنے کا باعث بنتا ہے۔ بہرحال ان تفسیروں اور پہلی تفسیر میں کوئی تضاد نہیں، کیونکہ مراد تاریکی کے شر سے پناہ مانگنا ہی ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) { وَ مِنْ شَرِّ النَّفّٰثٰتِ فِي الْعُقَدِ: ’’ النَّفّٰثٰتِ ‘‘ ’’نَفَّاثَةٌ‘‘} کی جمع ہےہے جو {’’نَفَثَ يَنْفُثُ نَفْثًا‘‘} ( ن ، ض) (پھونک مارنا، جس کے ساتھ تھوڑی سی تھوک ہو) سے مشتق ہے، بہت پھونکیں مارنے والی عورتیں یا جماعتیں۔ اگر {’’نَفَّاثَةٌ‘‘} میں تاء {’’عَلَّامَةٌ‘‘} کی طرح مبالغے کے لیے ہو یا {’’ النَّفّٰثٰتِ ‘‘} سے مراد نفوس ہوں تو عورتوں کے علاوہ بہت پھونکیں مارنے والے مرد بھی مراد ہو سکتے ہیں۔ {’’ الْعُقَدِ ‘‘ ’’عُقْدَةٌ‘‘} کی جمع ہے، گرہیں۔ ابن جریر اور مفسرین سلف کے مطابق گرہوں میں پھونکیں مارنے والیوں سے مراد جادو کرنے والی عورتیں یا لوگ ہیں، کیونکہ انھوں نے جس پر جادو کرنا ہوتا ہے اس کے بال یا کوئی چیز حاصل کرکے اس پر جادو کرتے ہوئے کسی تانت یا دھاگے میں گرہیں ڈالتے جاتے اور منتر پڑھ پڑھ کر ان میں پھونکیں مارتے جاتے ہیں۔ ان کے شر سے خاص طور پر پناہ مانگنے کی تلقین اس لیے کی گئی کہ وہ چھپ کر وار کرتے ہیں۔ آدمی کو خبر ہی نہیں ہوتی کہ اسے تکلیف کیوں ہے، وہ بیماری سمجھ کر علاج معالجہ میں لگا رہتا ہے اور تکلیف بڑھتی جاتی ہے۔ ¤ بعض لوگوں نے کہا کہ {’’ الْعُقَدِ ‘‘} (گرہوں) سے مراد مردوں کے پختہ عزم اور ارادے ہیں اور {’’ النَّفّٰثٰتِ ‘‘} سے مراد یہ ہے کہ جس طرح تھوک کے ساتھ رسی کی گرہیں نرم کی جاتی ہیں اس طرح عورتیں اپنی چکنی چپڑی باتوں سے مردوں کے پختہ ارادوں کو بدل دیتی ہیں، اس آیت میں ان عورتوں کے شر سے پناہ مانگنے کی تلقین فرمائی گئی۔ یہ معنی پر لطف ہونے کے باوجود سلف کی تفسیر کے خلاف ہے اور اکثر یہ معنی کرنے والے وہ لوگ ہیں جو جادو سے نقصان پہنچنے کے قائل نہیں اور انھیں اپنے اس موقف پر اس قدر اصرار ہے کہ وہ بخاری ومسلم اور حدیث کی بہت سی دوسری کتابوں میں مروی حدیث کو ماننے ہی سے انکار کر دیتے ہیں جس میں مذکور ہے کہ لبید بن اعصم نے رسول اللہ صلی اللہ علیہ وسلم پر جادو کیا تھا اور آپ اس جادو کی وجہ سے کچھ عرصہ بیمار اور پریشان رہے تھے۔ [ دیکھیے بخاري، کتاب الطب، باب ہل یستخرج السحر؟ :۵۷۶۵،۵۷۶۳ ]"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { وَ مِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ: ’’ حَسَدَ ‘‘} کا معنی ہے کسی شخص پر اللہ کی نعمت سے جلناکہ یہ نعمت اسے کیوں ملی اور اس کے زوال کی تمنا کرنا۔ پھر خواہ یہ خواہش یا کوشش ہو کہ وہ حسد کرنے والے کو ملے یا نہ ہو۔ قباحت کے لحاظ سے حسد کے کئی درجے ہیں، سب سے بدتر یہ ہے کہ کسی شخص کو اللہ نے جو نعمت دی ہے اس سے چھن جانے کی تمنا کے ساتھ ساتھ قول و عمل کے ذریعے سے یہ کوشش بھی کرے کہ وہ نعمت اس سے چھن جائے۔ پھر بعض کی کوشش ہوتی ہے کہ اس سے چھن کر مجھے مل جائے اور بعض کو اس سے غرض نہیں ہوتی، بلکہ وہ اسی پر خوش ہوتے ہیں کہ اس کے پاس یہ نعمت نہیں رہی۔ دوسرا یہ کہ عملی طور پر تو اسے نقصان پہنچانے کی کوشش نہ کرے، لیکن دل میں یہ خواہش رکھے کہ اس کے پاس سے یہ نعمت نہ رہے۔ یہ دونوں صورتیں حرام ہیں۔ ¤ ➋ سوال پیدا ہوتا ہے کہ حاسد کے شر سے پناہ مانگتے وقت {’’ اِذَا حَسَدَ ‘‘} ( جب وہ حسد کرے) کی قید کیوں لگائی؟ جواب یہ ہے کہ حاسد کے حسد کا نقصان دوسرے شخص کو اسی وقت ہوتا ہے جب وہ اپنے حسد کے تقاضے کے مطابق قول یا فعل سے اسے نقصان پہنچانے کی کوشش کرے، یا حسد کے تقاضے کے مطابق یہ خواہش رکھے کہ اس سے وہ نعمت چھن جائے۔ حسد کی ایک صورت یہ ہے کہ دل میں خیال آتا ہے کہ فلاں شخص کو یہ نعمت کیوں ملی، مگر آدمی اس خیال کو ہٹا دیتا ہے، نہ اسے نقصان پہنچانے کی کوشش کرتا ہے اور نہ ایسا ارادہ یا خواہش رکھتا ہے کہ اس سے وہ نعمت چھن جائے، اس پر مؤاخذہ نہیں۔ ایسے خیالات آ ہی جاتے ہیں، کیونکہ انسان کی طبیعت میں یہ بات رکھ دی گئی ہے کہ وہ اس بات کو پسند نہیں کرتا کہ اس کا کوئی ہم جنس کسی خوبی میں اس سے بڑھ کر ہو، تو جو شخص حسد کے تقاضے پر عمل نہ کرے بلکہ ایسے خیال آنے پر انھیں دور کرنے کی کوشش کرے اور محسود (جس کے ساتھ حسد ہو) کے ساتھ احسان کرے، اس کے لیے دعا کرے اور اس کی خوبیاں عام بیان کرنا شروع کر دے، تاکہ دل میں اس بھائی کے ساتھ حسد کے بجائے محبت پیدا ہو جائے تو اس کے شر سے پناہ مانگنے کی کیا ضرورت ہے؟ اس کا حسد کے تقاضے پر عمل کرنے کے بجائے اس سے مقابلہ کرنا اور اسے دور کرنے کی کوشش کرنا تو ایمان کے اعلیٰ درجے کی علامت ہے اور حسد سے نجات پانے کا طریقہ بھی یہی ہے۔ ¤ ➌ حسد کے حرام ہونے کی وجہ یہ ہے کہ حاسد دراصل اللہ تعالیٰ پر ناراض ہوتا ہے کہ اس نے اسے وہ نعمت کیوں دی۔ پھر بندے پر اس کے کسی جرم کے بغیر ناراض ہوتا ہے، کیونکہ اس نعمت کے حصول میں اس کا کچھ اختیار نہیں۔ تو حاسد دراصل اللہ کا بھی دشمن ہے اور اللہ کے بے گناہ بندوں کا بھی۔ ¤ ➍ حسد کا علاج یہ ہے کہ بندہ سوچے کہ حسد کا نقصان دین و دنیا میں حسد کرنے والے ہی کو ہے، محسود کو کوئی نقصان نہیں، نہ دنیا میں نہ دین میں، بلکہ اسے دین و دنیا میں حاسد کے حسد سے فائدہ ہی حاصل ہوتا ہے۔ دین میں فائدہ یہ ہے کہ وہ مظلوم ہے، خصوصاً جب حاسد قول یا عمل سے اسے نقصان پہنچانے کی کوشش کرے، تو قیامت کو اسے ظلم کا بدلا ملے گا اور ظالم حاسد نیکیوں سے مفلس رہ جائے گا اور دنیاوی فائدہ یہ ہے کہ لوگوں کی دلی خواہش یہ ہوتی ہے کہ ان کے دشمن غم و فکر اور عذاب میں مبتلا رہیں اور حاسد جس عذاب اور مصیبت میں گرفتار ہے اس سے بڑی مصیبت اور کیا ہو سکتی ہے؟ وہ ہر وقت حسد کی آگ میں جل رہا ہوتا ہے اور اطمینان اور دلی سکون سے محروم ہوتا ہے۔ ¤ ➎ حسد آدمی کو اللہ کی نافرمانی کی طرف لے جاتا ہے، اہل علم فرماتے ہیں کہ آسمان میں اللہ تعالیٰ کی سب سے پہلی نافرمانی حسد کی وجہ سے واقع ہوئی کہ ابلیس نے آدم علیہ السلام پر حسد کی وجہ سے اسے سجدہ کرنے سے انکار کر دیا اور زمین پر پہلی نافرمانی، یعنی آدم علیہ السلام کے دو بیٹوں میں سے ایک کے دوسرے کو قتل کرنے کا باعث بھی یہی حسد تھا۔ برادران یوسف نے یوسف علیہ السلام اور ان کے والدین پر جو ظلم کیا اس کا باعث بھی حسد تھا۔ یہودی لوگ یہ جانتے ہوئے بھی کہ محمد صلی اللہ علیہ وسلم رسول برحق ہیں، ایمان نہ لائے تو اس کا باعث بھی یہی حسد تھا اور یہی حسد تھا جس کی بنا پرانھوں نے رسول اللہ صلی اللہ علیہ وسلم پر جادو کر دیا۔ گرہوں میں پھونکنے والیوں کے شر کے پیچھے بھی عموماً حسد ہی کا جذبہ چھپا ہوتا ہے، اس لیے ان کے شر کے بعد حاسد کے شر سے پناہ مانگنے کی تلقین فرمائی۔ ¤ ➏ بعض اوقات حسد کا لفظ {’’غِبْطَةٌ ‘‘} (رشک اور ریس) کے معنی میں بھی آجاتا ہے، یعنی کسی شخص پر اللہ تعالیٰ کی نعمت دیکھ کر یہ خواہش کرنا کہ مجھے بھی یہ نعمت مل جائے، لیکن یہ خواہش نہ ہو کہ اس سے وہ نعمت چھن جائے۔ یہ خواہش حرام نہیں، مگر صرف دو چیزوں میں رشک کرنا پسندیدہ ہے، ابن عمر رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللّٰهُ الْقُرْآنَ فَهُوَ يَقُوْمُ بِهِ  آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَ رَجُلٌ آتَاهُ اللّٰهُ مَالًا فَهُوَ يُنْفِقُهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ ] [ مسلم، صلاۃ المسافرین و قصرھا، باب فضل من یقوم بالقرآن… : ۸۱۵۔ بخاري : ۵۰۲۵ ] ’’حسد (رشک کرنا) نہیں مگر دو چیزوں میں، ایک وہ آدمی جسے اللہ نے قرآن دیا تو وہ رات کی گھڑیوں اور دن کی گھڑیوں میں اس کے ساتھ قائم رہتا ہے اور ایک وہ آدمی جسے اللہ نے مال دیا ہے تو وہ رات اور دن کی گھڑیوں میں اس میں سے (نیک کاموں میں) خرچ کرتا رہتا ہے۔‘‘"
    }
  ]
}