{
  "surah": "An-Naas",
  "surah_number": 114,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1تا3) ➊ { قُلْ اَعُوْذُ بِرَبِّ النَّاسِ …:} پناہ کا مطلب پچھلی سورت میں گزر چکا ہے۔ آدمی جب کسی سے خطرہ محسوس کرتا ہے تو سب سے پہلے اپنے کسی مربی ( پرورش کرنے والے)، مثلاً ماں یا باپ کی پناہ لیتا ہے، ان سے چمٹ جاتا ہے، تاکہ وہ اسے بچا لیں۔ اگر وہ کمزور ہوں اور نہ بچا سکتے ہوں تو بادشاہ سے بچانے کی درخواست کرتا ہے اور اس کی پناہ لیتا ہے، کیونکہ وہ سمجھتا ہے کہ بادشاہ اپنی قوت اور فوج کے ذریعے سے اسے بچا سکتا ہے۔ اگر نظر آرہا ہو کہ اس خطرے سے بچانا بادشاہ کے بس کی بات بھی نہیں تو پھر اس ہستی کی پناہ لیتا ہے جسے وہ غیبی قوتوں کا مالک سمجھتا اور جس کی عبادت کرتا ہے، کیونکہ وہ جانتا ہے کہ دنیوی اسباب ختم ہونے کے بعد اسے اس کے علاوہ کہیں سے پناہ نہیں مل سکتی۔ ¤ اس سورت میں وسوسہ ڈالنے والے کے شر سے پناہ لینے کے لیے اللہ تعالیٰ کی تین صفات کے ساتھ پناہ پکڑنے کی تعلیم دی گئی ہے کہ اگر اپنے کسی پرورش کرنے والے کی پناہ پکڑنا چاہو تو بجائے اس کے کہ کسی ایسے شخص کی پناہ پکڑو جو کسی ایک آدھ یا چند آدمیوں کی پرورش کر رہا ہو اور حقیقت میں وہ خود محتاج ہو، تم اس کی پناہ پکڑو جو سب لوگوں کا رب اور سب کی پرورش کرنے والا ہے، جو کسی کا محتاج نہیں اور سب اس کے محتاج ہیں۔ اگر کسی صاحب قوت بادشاہ کی پناہ پکڑنا چاہو تو بجائے اس کے کہ ان بادشاہوں کی پناہ پکڑو جو فوجوں کے محتاج ہیں، جن کا اقتدار محدود اور عارضی ہے اور جن کی اپنی زندگی اور اپنا نفع و نقصان ان کے ہاتھ میں نہیں، تم اس کی پناہ پکڑو جو تمام لوگوں کا بادشاہ ہے اور اس کی قوت اور بادشاہی کسی فوج یا سالار کی محتاج نہیں اور اگر کسی ایسی ہستی کی پناہ لینا چاہو جسے غیبی قوتوں کا مالک ہونے کی وجہ سے تم عبادت کا حق دار سمجھتے ہو تو وہ صرف اور صرف ایک ہی ہے، جو تمام لوگوں کا معبود برحق ہے اور صرف وہی تمھیں ان خطرات میں پناہ دے سکتا ہے جن کے سامنے تمام مربی اور تمام بادشاہ بے بس ہو جاتے ہیں۔ اس کے علاوہ نہ کوئی غیبی قوتوں کا مالک ہے، نہ کائنات کی کسی چیز میں کسی دوسرے کا دخل ہے اور نہ کسی کا حق ہے کہ اس کی عبادت کی جائے۔ ¤ ➋ سورۂ فلق میں اللہ تعالیٰ کی ایک صفت {’’ بِرَبِّ الْفَلَقِ ‘‘} کے ساتھ ساری مخلوق کے شر سے عموماً اور مخلوق میں سے تین چیزوں کے شر سے خصوصاً پناہ مانگی گئی ہے، یعنی اندھیری رات، گرہوں میں پھونکنے والیوں اور حاسد کے شر سے اور اس سورت میں صرف ایک چیز یعنی ہٹ ہٹ کر وسوسہ ڈالنے والے کے شر سے اللہ تعالیٰ کی تین صفات کے ساتھ پناہ مانگی گئی، کیونکہ پہلی تینوں چیزیں انسان کے جسم و جان کو نقصان پہنچانے والی ہیں، جب کہ وسوسہ اس کے ایمان کو نقصان پہنچانے والا ہے اور ایمان کی حفاظت کی فکر جسم و جان سے بھی اہم ہے۔ ¤ ➌ پہلی تین آیات میں {’’ النَّاسِ ‘‘} کا لفظ بار بار لایا گیا ہے، حالانکہ {’’ بِرَبِّ النَّاسِ ‘‘} کے بعد والی آیات میں {’’ النَّاسِ ‘‘} کی ضمیر بھی لائی جا سکتی تھی۔ اس میں حکمت یہ معلوم ہوتی ہے (واللہ اعلم) کہ لوگوں کے وسوسے کا شر اتنا خوف ناک ہے کہ بندہ بار بار اس کا حوالہ دیتا ہے کہ یا اللہ! لوگوں کا رب بھی تو ہے، لوگوں کا بادشاہ بھی تو ہے اور لوگوں کا الٰہ بھی تو ہے، اس لیے لوگوں کے شر سے پناہ بھی توہی دے سکتا ہے۔ اس سورت میں ان تینوں صفات کی پناہ پکڑتے وقت ضمناً بھی بار بار لوگوں کے شر سے پناہ مانگی گئی ہے، پھر{’’ مِنْ شَرِّ الْوَسْوَاسِ…‘‘} کے ساتھ صاف لفظوں میں بھی لوگوں کے وسوسے کے شر سے پناہ مانگی گئی ہے۔ تفسیر قاسمی میں شیخ الاسلام ابن تیمیہ اور شیخ ناصر سے ایک اور حکمت نقل کی گئی ہے، اس کا خلاصہ یہ ہے کہ پناہ مانگنے والے بھی چونکہ لوگ ہیں، اس لیے پناہ مانگتے وقت بار بار ان نسبتوں کا حوالہ دیا جا رہا ہے جو اللہ تعالیٰ کے درمیان اور لوگوں کے درمیان موجود ہیں کہ یا اللہ! تو لوگوں کا رب بھی ہے، لوگوں کا بادشاہ بھی اور لوگوں کا معبود برحق بھی، تو جب لوگوں کا سبھی کچھ تو ہی ہے تو تیرے علاوہ انھیں پناہ دینے والا اور کون ہو سکتا ہے؟ (قاسمی) ¤"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 1تا3) ➊ { قُلْ اَعُوْذُ بِرَبِّ النَّاسِ …:} پناہ کا مطلب پچھلی سورت میں گزر چکا ہے۔ آدمی جب کسی سے خطرہ محسوس کرتا ہے تو سب سے پہلے اپنے کسی مربی ( پرورش کرنے والے)، مثلاً ماں یا باپ کی پناہ لیتا ہے، ان سے چمٹ جاتا ہے، تاکہ وہ اسے بچا لیں۔ اگر وہ کمزور ہوں اور نہ بچا سکتے ہوں تو بادشاہ سے بچانے کی درخواست کرتا ہے اور اس کی پناہ لیتا ہے، کیونکہ وہ سمجھتا ہے کہ بادشاہ اپنی قوت اور فوج کے ذریعے سے اسے بچا سکتا ہے۔ اگر نظر آرہا ہو کہ اس خطرے سے بچانا بادشاہ کے بس کی بات بھی نہیں تو پھر اس ہستی کی پناہ لیتا ہے جسے وہ غیبی قوتوں کا مالک سمجھتا اور جس کی عبادت کرتا ہے، کیونکہ وہ جانتا ہے کہ دنیوی اسباب ختم ہونے کے بعد اسے اس کے علاوہ کہیں سے پناہ نہیں مل سکتی۔ ¤ اس سورت میں وسوسہ ڈالنے والے کے شر سے پناہ لینے کے لیے اللہ تعالیٰ کی تین صفات کے ساتھ پناہ پکڑنے کی تعلیم دی گئی ہے کہ اگر اپنے کسی پرورش کرنے والے کی پناہ پکڑنا چاہو تو بجائے اس کے کہ کسی ایسے شخص کی پناہ پکڑو جو کسی ایک آدھ یا چند آدمیوں کی پرورش کر رہا ہو اور حقیقت میں وہ خود محتاج ہو، تم اس کی پناہ پکڑو جو سب لوگوں کا رب اور سب کی پرورش کرنے والا ہے، جو کسی کا محتاج نہیں اور سب اس کے محتاج ہیں۔ اگر کسی صاحب قوت بادشاہ کی پناہ پکڑنا چاہو تو بجائے اس کے کہ ان بادشاہوں کی پناہ پکڑو جو فوجوں کے محتاج ہیں، جن کا اقتدار محدود اور عارضی ہے اور جن کی اپنی زندگی اور اپنا نفع و نقصان ان کے ہاتھ میں نہیں، تم اس کی پناہ پکڑو جو تمام لوگوں کا بادشاہ ہے اور اس کی قوت اور بادشاہی کسی فوج یا سالار کی محتاج نہیں اور اگر کسی ایسی ہستی کی پناہ لینا چاہو جسے غیبی قوتوں کا مالک ہونے کی وجہ سے تم عبادت کا حق دار سمجھتے ہو تو وہ صرف اور صرف ایک ہی ہے، جو تمام لوگوں کا معبود برحق ہے اور صرف وہی تمھیں ان خطرات میں پناہ دے سکتا ہے جن کے سامنے تمام مربی اور تمام بادشاہ بے بس ہو جاتے ہیں۔ اس کے علاوہ نہ کوئی غیبی قوتوں کا مالک ہے، نہ کائنات کی کسی چیز میں کسی دوسرے کا دخل ہے اور نہ کسی کا حق ہے کہ اس کی عبادت کی جائے۔ ¤ ➋ سورۂ فلق میں اللہ تعالیٰ کی ایک صفت {’’ بِرَبِّ الْفَلَقِ ‘‘} کے ساتھ ساری مخلوق کے شر سے عموماً اور مخلوق میں سے تین چیزوں کے شر سے خصوصاً پناہ مانگی گئی ہے، یعنی اندھیری رات، گرہوں میں پھونکنے والیوں اور حاسد کے شر سے اور اس سورت میں صرف ایک چیز یعنی ہٹ ہٹ کر وسوسہ ڈالنے والے کے شر سے اللہ تعالیٰ کی تین صفات کے ساتھ پناہ مانگی گئی، کیونکہ پہلی تینوں چیزیں انسان کے جسم و جان کو نقصان پہنچانے والی ہیں، جب کہ وسوسہ اس کے ایمان کو نقصان پہنچانے والا ہے اور ایمان کی حفاظت کی فکر جسم و جان سے بھی اہم ہے۔ ¤ ➌ پہلی تین آیات میں {’’ النَّاسِ ‘‘} کا لفظ بار بار لایا گیا ہے، حالانکہ {’’ بِرَبِّ النَّاسِ ‘‘} کے بعد والی آیات میں {’’ النَّاسِ ‘‘} کی ضمیر بھی لائی جا سکتی تھی۔ اس میں حکمت یہ معلوم ہوتی ہے (واللہ اعلم) کہ لوگوں کے وسوسے کا شر اتنا خوف ناک ہے کہ بندہ بار بار اس کا حوالہ دیتا ہے کہ یا اللہ! لوگوں کا رب بھی تو ہے، لوگوں کا بادشاہ بھی تو ہے اور لوگوں کا الٰہ بھی تو ہے، اس لیے لوگوں کے شر سے پناہ بھی توہی دے سکتا ہے۔ اس سورت میں ان تینوں صفات کی پناہ پکڑتے وقت ضمناً بھی بار بار لوگوں کے شر سے پناہ مانگی گئی ہے، پھر{’’ مِنْ شَرِّ الْوَسْوَاسِ…‘‘} کے ساتھ صاف لفظوں میں بھی لوگوں کے وسوسے کے شر سے پناہ مانگی گئی ہے۔ تفسیر قاسمی میں شیخ الاسلام ابن تیمیہ اور شیخ ناصر سے ایک اور حکمت نقل کی گئی ہے، اس کا خلاصہ یہ ہے کہ پناہ مانگنے والے بھی چونکہ لوگ ہیں، اس لیے پناہ مانگتے وقت بار بار ان نسبتوں کا حوالہ دیا جا رہا ہے جو اللہ تعالیٰ کے درمیان اور لوگوں کے درمیان موجود ہیں کہ یا اللہ! تو لوگوں کا رب بھی ہے، لوگوں کا بادشاہ بھی اور لوگوں کا معبود برحق بھی، تو جب لوگوں کا سبھی کچھ تو ہی ہے تو تیرے علاوہ انھیں پناہ دینے والا اور کون ہو سکتا ہے؟ (قاسمی) ¤"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 1تا3) ➊ { قُلْ اَعُوْذُ بِرَبِّ النَّاسِ …:} پناہ کا مطلب پچھلی سورت میں گزر چکا ہے۔ آدمی جب کسی سے خطرہ محسوس کرتا ہے تو سب سے پہلے اپنے کسی مربی ( پرورش کرنے والے)، مثلاً ماں یا باپ کی پناہ لیتا ہے، ان سے چمٹ جاتا ہے، تاکہ وہ اسے بچا لیں۔ اگر وہ کمزور ہوں اور نہ بچا سکتے ہوں تو بادشاہ سے بچانے کی درخواست کرتا ہے اور اس کی پناہ لیتا ہے، کیونکہ وہ سمجھتا ہے کہ بادشاہ اپنی قوت اور فوج کے ذریعے سے اسے بچا سکتا ہے۔ اگر نظر آرہا ہو کہ اس خطرے سے بچانا بادشاہ کے بس کی بات بھی نہیں تو پھر اس ہستی کی پناہ لیتا ہے جسے وہ غیبی قوتوں کا مالک سمجھتا اور جس کی عبادت کرتا ہے، کیونکہ وہ جانتا ہے کہ دنیوی اسباب ختم ہونے کے بعد اسے اس کے علاوہ کہیں سے پناہ نہیں مل سکتی۔ ¤ اس سورت میں وسوسہ ڈالنے والے کے شر سے پناہ لینے کے لیے اللہ تعالیٰ کی تین صفات کے ساتھ پناہ پکڑنے کی تعلیم دی گئی ہے کہ اگر اپنے کسی پرورش کرنے والے کی پناہ پکڑنا چاہو تو بجائے اس کے کہ کسی ایسے شخص کی پناہ پکڑو جو کسی ایک آدھ یا چند آدمیوں کی پرورش کر رہا ہو اور حقیقت میں وہ خود محتاج ہو، تم اس کی پناہ پکڑو جو سب لوگوں کا رب اور سب کی پرورش کرنے والا ہے، جو کسی کا محتاج نہیں اور سب اس کے محتاج ہیں۔ اگر کسی صاحب قوت بادشاہ کی پناہ پکڑنا چاہو تو بجائے اس کے کہ ان بادشاہوں کی پناہ پکڑو جو فوجوں کے محتاج ہیں، جن کا اقتدار محدود اور عارضی ہے اور جن کی اپنی زندگی اور اپنا نفع و نقصان ان کے ہاتھ میں نہیں، تم اس کی پناہ پکڑو جو تمام لوگوں کا بادشاہ ہے اور اس کی قوت اور بادشاہی کسی فوج یا سالار کی محتاج نہیں اور اگر کسی ایسی ہستی کی پناہ لینا چاہو جسے غیبی قوتوں کا مالک ہونے کی وجہ سے تم عبادت کا حق دار سمجھتے ہو تو وہ صرف اور صرف ایک ہی ہے، جو تمام لوگوں کا معبود برحق ہے اور صرف وہی تمھیں ان خطرات میں پناہ دے سکتا ہے جن کے سامنے تمام مربی اور تمام بادشاہ بے بس ہو جاتے ہیں۔ اس کے علاوہ نہ کوئی غیبی قوتوں کا مالک ہے، نہ کائنات کی کسی چیز میں کسی دوسرے کا دخل ہے اور نہ کسی کا حق ہے کہ اس کی عبادت کی جائے۔ ¤ ➋ سورۂ فلق میں اللہ تعالیٰ کی ایک صفت {’’ بِرَبِّ الْفَلَقِ ‘‘} کے ساتھ ساری مخلوق کے شر سے عموماً اور مخلوق میں سے تین چیزوں کے شر سے خصوصاً پناہ مانگی گئی ہے، یعنی اندھیری رات، گرہوں میں پھونکنے والیوں اور حاسد کے شر سے اور اس سورت میں صرف ایک چیز یعنی ہٹ ہٹ کر وسوسہ ڈالنے والے کے شر سے اللہ تعالیٰ کی تین صفات کے ساتھ پناہ مانگی گئی، کیونکہ پہلی تینوں چیزیں انسان کے جسم و جان کو نقصان پہنچانے والی ہیں، جب کہ وسوسہ اس کے ایمان کو نقصان پہنچانے والا ہے اور ایمان کی حفاظت کی فکر جسم و جان سے بھی اہم ہے۔ ¤ ➌ پہلی تین آیات میں {’’ النَّاسِ ‘‘} کا لفظ بار بار لایا گیا ہے، حالانکہ {’’ بِرَبِّ النَّاسِ ‘‘} کے بعد والی آیات میں {’’ النَّاسِ ‘‘} کی ضمیر بھی لائی جا سکتی تھی۔ اس میں حکمت یہ معلوم ہوتی ہے (واللہ اعلم) کہ لوگوں کے وسوسے کا شر اتنا خوف ناک ہے کہ بندہ بار بار اس کا حوالہ دیتا ہے کہ یا اللہ! لوگوں کا رب بھی تو ہے، لوگوں کا بادشاہ بھی تو ہے اور لوگوں کا الٰہ بھی تو ہے، اس لیے لوگوں کے شر سے پناہ بھی توہی دے سکتا ہے۔ اس سورت میں ان تینوں صفات کی پناہ پکڑتے وقت ضمناً بھی بار بار لوگوں کے شر سے پناہ مانگی گئی ہے، پھر{’’ مِنْ شَرِّ الْوَسْوَاسِ…‘‘} کے ساتھ صاف لفظوں میں بھی لوگوں کے وسوسے کے شر سے پناہ مانگی گئی ہے۔ تفسیر قاسمی میں شیخ الاسلام ابن تیمیہ اور شیخ ناصر سے ایک اور حکمت نقل کی گئی ہے، اس کا خلاصہ یہ ہے کہ پناہ مانگنے والے بھی چونکہ لوگ ہیں، اس لیے پناہ مانگتے وقت بار بار ان نسبتوں کا حوالہ دیا جا رہا ہے جو اللہ تعالیٰ کے درمیان اور لوگوں کے درمیان موجود ہیں کہ یا اللہ! تو لوگوں کا رب بھی ہے، لوگوں کا بادشاہ بھی اور لوگوں کا معبود برحق بھی، تو جب لوگوں کا سبھی کچھ تو ہی ہے تو تیرے علاوہ انھیں پناہ دینے والا اور کون ہو سکتا ہے؟ (قاسمی) ¤"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ: ’’ الْوَسْوَاسِ ‘‘} واؤ کے کسرہ کے ساتھ ہو تو یہ {’’وَسْوَسَ يُوَسْوِسُ‘‘} کا مصدر ہے، وسوسہ ڈالنا، جیسے {’’زِلْزَالٌ‘‘} (زاء کے کسرہ کے ساتھ) ہے، سخت ہلانا۔ (زمخشری) یہاں {’’ الْوَسْوَاسِ ‘‘} واؤ کے فتحہ کے ساتھ ہے، یہ مصدر نہیں بلکہ صفت ہے، جو اسم فاعل کے معنی میں ہے، بہت وسوسہ ڈالنے والا، جس طرح {’’ثَرْثَارٌ‘‘} (بہت باتیں کرنے والا) اور {’’دَحْدَاحٌ‘‘} (بہت چھوٹے قد والا) وغیرہ ہیں۔ (تفسیر ابن قیم) ¤ ➋ { ’’ الْوَسْوَاسِ ‘‘} مضاعف رباعی ہے، اس کے مفہوم میں تکرار ( بار بار وسوسہ ڈالنا) شامل ہے، جس طرح {’’زَلْزَلَ‘‘} کے مفہوم میں بار بار ہلانا اور {’’ثَرْثَرَ‘‘} میں بولتے چلے جانا شامل ہے۔ {’’ الْوَسْوَاسِ ‘‘} کا معنی بہت وسوسہ ڈالنے والا جو بار بار وسوسہ ڈالتا ہے۔ ¤ ➌ { ’’وَسْوَسَةٌ‘‘} کا اصل معنی وہ ہلکی یا دبی ہوئی حرکت یا  آواز ہے جو عام طور پر محسوس نہ ہوتی ہو۔ اس سے مراد وہ بات بھی ہوتی ہے جو بالکل آہستہ آواز سے کسی کے کان میں کہی جائے اور صرف اسی کو سنائی دے اور وہ بھی جو آواز کے بغیر کسی کے دل میں ڈال دی جائے، جیسے شیطان انسان کے دل میں وسوسہ ڈالتا ہے۔ ¤ ➍ {’’ الْخَنَّاسِ ‘‘ ’’خَنَسَ يَخْنِسُ‘‘} ( ض ، ن ) پیچھے ہٹنا ، ہٹانا۔ سورۂ تکویر میں ستاروں کو {’’اَلْخُنَّسُ‘‘} فرمایا ہے، کیونکہ وہ روزانہ مغرب میں غروب ہوتے ہیں، پھر پیچھے ہٹتے ہوئے دوبارہ مشرق سے نمودار ہو جاتے ہیں۔ {’’ الْوَسْوَاسِ الْخَنَّاسِ‘‘} مبالغے کا صیغہ ہے، یعنی بہت پیچھے ہٹنے والا۔ اس سے یہ بات خود بخود سمجھ میں آرہی ہے کہ وہ ایک دفعہ ہی وسوسہ ڈال کر پیچھے نہیں ہٹ جاتا، بلکہ بار بار وسوسہ ڈالتا ، بار بار پیچھے ہٹتا اور پھر ہٹ ہٹ کر وسوسہ ڈالتا ہے۔ شیطان کو {’’الْوَسْوَاسِ الْخَنَّاسِ‘‘} اس لیے کہا گیا ہے کہ وہ آدمی کے دل میں برے خیالات ڈالتا ہے، جب وہ اللہ کا ذکر کرے تو پیچھے ہٹ جاتا ہے، جب ذکر سے غافل ہو تو دوبارہ لوٹ کر وسوسہ ڈالنا شروع کر دیتا ہے۔ ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا نُوْدِيَ لِلصَّلاَةِ أَدْبَرَ الشَّيْطَانُ وَلَهُ ضُرَاطٌ، حَتّٰی لاَ يَسْمَعَ التَّأْذِيْنَ ، فَإِذَا قُضِيَ النِّدَاءُ أَقْبَلَ، حَتّٰی إِذَا ثُوِّبَ بِالصَّلاَةِ أَدْبَرَ ، حَتّٰی إِذَا قُضِيَ التَّثْوِيْبُ أَقْبَلَ حَتّٰی يَخْطُرَ بَيْنَ الْمَرْءِ وَنَفْسِهِ ، يَقُوْلُلُ اذْكُرْ كَذَا ، اذْكُرْ كَذَا، لِمَا لَمْ يَكُنْ يَذْكُرُ ، حَتّٰی يَظَلَّ الرَّجُلُ لاَ يَدْرِيْ كَمْ صَلّٰی ] [ بخاري، الأذان، باب فضل التأذین : ۶۰۸ ] ’’جب نماز کے لیے اذان ہوتی ہے تو شیطان گوز مارتا ہوا پیٹھ دے کر بھاگ جاتا ہے، تاکہ اذان نہ سنے۔ جب اذان پوری ہوتی ہے تو آجاتا ہے، پھر جب نماز کی اقامت ہوتی ہے چلا جاتا ہے، جب اقامت مکمل ہوتی ہے تو واپس آکر آدمی اور اس کے دل کے درمیان خیالات ڈالنا شروع کر دیتا ہے۔ کہتا ہے فلاں چیز یاد کر، فلاں چیز یاد کر، وہ چیزیں جو اسے یاد نہیں تھیں، یہاں تک کہ آدمی کی حالت یہ ہو جاتی ہے کہ اسے یہ بھی معلوم نہیں ہوتا کہ اس نے کتنی نماز پڑھی ہے۔ ‘‘ معلوم ہوا کہ آدمی نماز میں دل سے حاضر نہ ہو تو شیطان اپنا کام جاری رکھتا ہے۔ وہ صرف اس ذکر سے پیچھے ہٹتا ہے جس میں زبان کے ساتھ دل بھی شریک ہو۔ ¤"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { الَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِ:} وسوسہ ڈالنے والے کے شر سے پناہ مانگنے کا مطلب یہ ہے کہ آدمی اس بات سے اللہ کی پناہ مانگے کہ وہ اس کے دل میں کوئی وسوسہ ڈال دے اور اسے راہِ حق سے ہٹا دے اور اس بات سے بھی کہ وہ لوگوں کے دلوں میں وسوسے ڈال کرانھیںاس کے خلاف بھڑکا دے، جس کے نتیجے میں دین پر عمل کرنے اور اس کی دعوت دینے کے راستے میں وہ اس کے لیے رکاوٹ بن جائیں۔ دونوں صورتوں میں اللہ تعالیٰ ہی اس کے شر سے بچا سکتا ہے، اس لیے اسی کی پناہ مانگنے کی تعلیم دی گئی ہے۔ ¤ ➋ آدمی کوئی نیکی کرے یا برائی اس کا آغاز دل میں اس کا خیال پیدا ہونے سے ہوتا ہے، خیال جما رہے تو وہ خواہش کو ابھارتا ہے، خواہش سے ارادہ بنتا ہے، ارادہ پختہ ہو جائے تو عزم بنتا ہے، عزم نیت کا باعث ہوتا ہے، نیت اعضا کو عمل کے لیے حرکت میں لے آتی ہے اور آخری مرحلہ اس نیکی یا بدی پر عمل کا ہوتا ہے۔ دل میں پیدا ہونے والا یہ خیال اگر نیکی کا ہو تو رحمان کے مقرر کیے ہوئے فرشتے کی طرف سے ہوتا ہے اور الہام کہلاتا ہے، اگر بدی کا ہو تو وسوسہ کہلاتا ہے اور یہ شیطان کی طرف سے ہوتا ہے۔ ان دونوں کا فرق اس طرح معلوم ہوتا ہے کہ اگر وہ خیال کتاب و سنت کی رو سے نیکی کا کام ہے تو الہام ہے، ورنہ وسوسہ۔ وسوسہ ڈالنے والے کے شر سے پناہ مانگنے کی تعلیم اس لیے دی گئی کہ جہاں سے برائی شروع ہوتی ہے وہیں تم اللہ کی پناہ میں چلے جاؤ، تاکہ اللہ تعالیٰ شروع ہی میں تمھیں اپنی پناہ میں لے لے۔ جس سے نہ وہ وسوسہ دل میں جگہ پکڑے گا اور نہ بعد کے مراحل کی نوبت آئے گی۔ ¤ ➌ وسوسہ ڈالنے والوں کا شر صرف ایک ہی قسم کا نہیں ہوتا، بلکہ وہ کئی طرح سے آدمی کو راہِ حق سے ہٹانے کی کوشش کرتے ہیں۔ حافظ ابن قیم رحمہ اللہ اور دوسرے اہلِ علم نے اس کی کئی صورتیں بیان کی ہیں۔ سب سے پہلے تو وہ آدمی کو صریح کفرو شرک اور اللہ اور اس کے رسول کی بغاوت اور دشمنی پر آمادہ کرتے ہیں، اگر اس میں ناکام ہوں اور آدمی ایمان پر قائم رہے تو وہ اسے دوسرے شر یعنی بدعت میں پھنسانے کی کوشش کرتے ہیں۔ بدعت میں مبتلا کرنا انھیں آدمی کو بڑے سے بڑے گناہ میں مبتلا کرنے سے بھی زیادہ پسند ہے، کیونکہ یہ ایسا گناہ ہے جسے آدمی نیکی سمجھ کر کرتا ہے۔ اگر وہ سنت پر قائم رہے تو اسے کسی نہ کسی کبیرہ گناہ سے آلودہ کرنے کی کوشش کرتے ہیں، خصوصاً اگر وہ دینی عالم ہو، تاکہ بدنام ہو کر دین کا کام نہ کر سکے۔ اگر اس میں بھی کامیاب نہ ہوں تو چھوٹے گناہوں کی رغبت دلاتے ہیں، تاکہ وہ انھیں معمولی سمجھ کر ان کے بوجھ تلے دب جائے۔ یہ بھی نہ کر سکیں تو نیکی کے کاموں سے ہٹا کر ان کاموں میں لگانے کی کوشش کرتے ہیں جن میں نہ ثواب ہے نہ عذاب اور اس طرح اس کی عمر برباد کرنے کی کوشش کرتے ہیں، اگر وہ اپنے وقت کو بے کار کاموں میں لگانے پر کسی صورت آمادہ نہ ہو تو نیکی کے بڑے کام سے ہٹا کر چھوٹے کام میں لگانے کی کوشش کرتے ہیں، مثلاً دعوت و جہاد سے ہٹا کر نفلی نماز روزے میں لگا دیتے ہیں۔ یہ بھی نہ ہو سکے تو دل میں ریا یا اپنے عمل پر غرور پیدا کرنے کی کوشش کرتے ہیں۔ اگر وہ کسی صورت ان کے قابو میں نہ آئے تو شیطان اور اس کے وہ چیلے بے شمار طریقوں سے اسے بدنام کرنے اور تکلیف پہنچانے کی کوشش کرتے ہیں۔ کچھ نہ ہو سکے تو اسے غصہ دلا کر فہم و شعور سے بیگانہ کرنے کی کوشش کرتے ہیں اور اس وقت بھی اگر وہ اللہ کی پناہ میں چلا جائے تو ان کی تمام کوششیں ناکام ہو جاتی ہیں۔ اللہ تعالیٰ نے فرمایا : « وَ اِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ فَاسْتَعِذْ بِاللّٰهِ » » [الأعراف : ۲۰۰ ] ’’اور اگر تجھے شیطان کی طرف سے کوئی چوکا لگے ( یعنی شیطان تجھے غصہ دلائے) تو اللہ کی پناہ مانگ۔‘‘ غرض موت تک یہ دشمن اپنی دشمنی سے باز نہیں آتے۔ اللہ تعالیٰ ہمیں آخر وقت تک اپنی پناہ میں رکھے۔ (آمین) ¤"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6){ مِنَ الْجِنَّةِ وَ النَّاسِ:} لوگوں کے سینوں میں وسوسہ ڈالنے والے شیطان جن بھی ہوتے ہیں اور انسان بھی، اللہ تعالیٰ نے فرمایا : «وَ كَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا شَيٰطِيْنَ الْاِنْسِ وَ الْجِنِّ يُوْحِيْ بَعْضُهُمْ اِلٰى بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُوْرًاا » [ الأنعام : ۱۱۲ ] ’’اور اسی طرح ہم نے ہر نبی کے لیے انسانوں اور جنوں کے شیاطین کو دشمن بنا دیا، ان کا بعض بعض کی طرف ملمع کی ہوئی بات دھوکا دینے کے لیے دل میں ڈالتا رہتا ہے۔‘‘ اللہ تعالیٰ نے ہر آدمی کے ساتھ ایک جن شیطان اور ایک فرشتہ مقرر کر رکھا ہے، شیطان کا کام برائی کا وسوسہ ڈالنا اور فرشتے کا کام بھلائی کا الہام کرنا ہے۔ عبداللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا مِنْكُمْ مِّنْ أَحَدٍ إِلَّا وَقَدْ وَكَّلَ اللّٰهُ  بِهِ قَرِيْنَهُ مِنَ الْجِنِّ، قَالُوْا وَ إِيَّاكَ يَا رَسُوْلَ اللّٰهِ!؟ قَالَ وَ إِيَّايَ إِلَّا أَنَّ اللّٰهَ أَعَانَنِيْ عَلَيْهِ فَأَسْلَمَ فَلَا يَأْمُرُننِيْ إِلَّا بِخَيْرٍ ] [ مسلم، صفۃ القیامۃ، باب تحریش الشیطان… : ۲۸۱۴ ] ’’تم میں سے ہر ایک کے ساتھ اللہ تعالیٰ نے جنوں میں سے اس کا ایک قرین ( ساتھی) مقرر کر رکھا ہے۔‘‘ صحابہ نے پوچھا : ’’یا رسول اللہ! اور آپ کے ساتھ بھی وہ مقرر ہے؟‘‘ آپ نے فرمایا : ’’ہاں میرے ساتھ بھی ہے، مگر اللہ تعالیٰ نے اس کے مقابلے میں میری مدد کی ہے تو وہ تابع ہو گیا ہے اور وہ مجھے خیر کے علاوہ کوئی حکم نہیں دیتا۔‘‘ صحیح مسلم کی اسی حدیث میں سفیان سے مروی یہ الفاظ ہیں : [ وَقَدْ وُكِّلَ بِهِ قَرِيْنُهُ مِنَ الْجِنِّ وَ قَرِيْنُهُ مِنَ الْمَلاَئِكَةِ ] [ مسلم، صفۃ القیامۃ، باب تحریش الشیطان… : ۲۸۱۴ ] ’’(ہر آدمی کے ساتھ) جنوں سے اس کا قرین (ساتھی) اور فرشتوں سے اس کا قرین (ساتھی) مقرر کیا گیا ہے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے دو انصار صحابہ سے فرمایا : [ إِنَّ الشَّيْطَانَ يَجْرِيْ مِنَ الْإِنْسَانِ مَجْرَی الدَّمِ، وَ إِنِّيْ خَشِيْتُ أَنْ يَّقْذِفَ فِيْ قُلُوْبِكُمَا سُوْئًا أَووْ قَالَ شَيْئًا ] [ بخاري، بدء الخلق، باب صفۃ إبلیس و جنودہ : ۳۲۸۱ ] ’’ شیطان انسان میں خون کی طرح گردش کرتا ہے اور میں ڈرا کہ وہ تمھارے دلوں میں کوئی وسوسہ ، یا فرمایا کوئی چیز ڈال دے گا۔‘‘ شیطان اور اس کا جنی قبیلہ انسانوں کی نگاہوں سے مخفی رہ کر فتنہ انگیزی کر سکتا ہے اور کرتا ہے۔ (دیکھیے انعام : ۲۷ ) رہے انسانی شیطان تو وہ ہمیشہ چھپ کر تو حملہ آور نہیں ہو سکتے، مگر اپنی باتوں اور طرز عمل سے وسوسہ ڈالتے اور دل میں برائی کا بیج بو دیتے ہیں۔ ¤ دوسرے وسوسہ ڈالنے والوں کے علاوہ انسان کا اپنا نفس بھی وسوسہ ڈالتا ہے۔ اس کی غلط خواہشات اور بد اعمالیاں اسے برائی کے لیے اکساتی اور ابھارتی ہیں، اللہ تعالیٰ نے فرمایا : « وَ لَقَدْ خَلَقْنَا الْاِنْسَانَ وَ نَعْلَمُ مَا تُوَسْوِسُ بِهٖ نَفْسُهٗ» [ قٓ : ۱۶ ] ’’اور بلاشبہ یقینا ہم نے انسان کو پیدا کیا اور ہم ان چیزوں کو جانتے ہیں جن کا وسوسہ اس کا نفس ڈالتا ہے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم اپنے خطبے میں فرمایا کرتے تھے : [ وَنَعُوْذُ بِاللّٰهِ مِنْ شُرُوْرِ أَنْفُسِنَا وَمِنْ سَيِّآتِ أَعْمَالِنَا ] [ ابن ماجہ، النکاح، باب خطبۃ النکاح : ۱۸۹۲۔ ترمذي : ۱۱۰۵، وصححہ الألباني ] ’’اور ہم اپنے نفس کی برائیوں سے اور اپنے اعمال کی برائیوں سے اللہ کی پناہ مانگتے ہیں۔‘‘ ان تمام وسوسہ ڈالنے والوں سے، خواہ وہ شیاطین الجن ہوں یا شیاطین الانس یا خود آدمی کا نفس ہو، اللہ تعالیٰ کی پناہ مانگنی چاہیے، کیونکہ وہی ان کے شر سے بچا سکتا ہے۔"
    }
  ]
}