{
  "surah": "Ar-Ra'd",
  "surah_number": 13,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت1) ➊ {الٓمّٓرٰ :} یہ حروفِ مقطعات ہیں، ان کی تفصیل سورۂ بقرہ کے شروع میں گزر چکی ہے۔ شعراوی رحمہ اللہ نے یہاں ایک فائدہ ذکر فرمایا ہے کہ قرآن مجید سارا وصل پر مبنی ہے، یعنی ہر لفظ دوسرے سے ملا ہوا ہے، سوائے اس مقام کے جہاں وقف کرنا ہو، جیسا کہ آیت کا آخر وغیرہ، مثلاً اسی سورت کو لے لیں : «{ تِلْكَ اٰيٰتُ الْكِتٰبِ}» اس میں ہر لفظ پر اعراب پڑھیں گے، مگر حروف مقطعات{ ’’ الٓمّٓرٰ ‘‘} کو ملا کر نہیں پڑھیں گے، بلکہ چاروں حرفوں کو الگ الگ پڑھیں گے، کیونکہ جبریل علیہ السلام نے رسول اللہ صلی اللہ علیہ وسلم کو ایسے ہی پڑھایا، پھر آپ نے ایسے ہی پڑھا اور ہم تک تواتر سے ایسے ہی پہنچا۔ ¤ ➋ { تِلْكَ اٰيٰتُ الْكِتٰبِ :} کوئی لفظ جب مطلق بولا جائے تو اس سے کامل فرد مراد ہوتا ہے، مثلاً کہتے ہیں : {’’فُلاَنٌ الرَّجُلُ‘‘} یعنی فلاں شخص مرد ہے، مطلب واقعی سچ مچ کامل مرد ہے، بخیل، بزدل، جھوٹا یا لولا لنگڑا نہیں۔ اسی طرح دین و عقائد میں {’’اَلْكِتَابُ‘‘} سے مراد کامل کتاب قرآن مجید لیا جاتا ہے۔ نحو میں سیبویہ کی کتاب کو {’’اَلْكِتَابُ‘‘} اور شہروں میں سے {’’مَدِيْنَةُ النَّبِيِّ صلي الله عليه وسلم ‘‘} کو {’’ اَلْمَدِيْنَةُ ‘‘} کہا جاتا ہے۔ ¤ ➌ { وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يُؤْمِنُوْنَ :} یعنی آپ کی طرف جو کچھ نازل کیا گیا وہی عین حق ہے، مگر اکثر لوگ غوروفکر نہ کرنے کی وجہ سے ایمان نہیں لاتے۔ اس میں انسانوں کی اکثریت کی رائے کے پرستاروں کے لیے سبق ہے اور ان لوگوں کی تعریف بھی ہے جو ایمان سے بہرہ ور ہیں، وہ قلیل بھی ہو سکتے ہیں کثیر بھی، مگر اکثریت انھی کی ہے جو ایمان کی سعادت سے محروم ہیں۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت2) ➊ { اَللّٰهُ الَّذِيْ رَفَعَ السَّمٰوٰتِ :} لفظ {’’ اَللّٰهُ ‘‘} اس پاک ہستی کا ذاتی نام ہے جس نے سب کچھ بنایا اور اسے چلا رہا ہے۔ اس ایک لفظ میں اس کی ساری صفات آجاتی ہیں۔ ایمان اس ہستی کی توحید، اس کے رسولوں کی تصدیق اور اس کے سامنے قیامت کو پیش ہونے کے عقیدے کا نام ہے۔ یہاں سے اللہ تعالیٰ نے انسان کے سامنے آسمان و زمین میں اپنی قدرت کی کچھ نشانیوں کی طرف توجہ دلائی ہے، تاکہ وہ توحید و رسالت اور قیامت پر ایمان لے آئے۔ سب سے پہلے آسمان کا ذکر فرمایا، سورۂ نازعات (۲۷) میں فرمایا : ’’کیا تمھیں (پہلی بار یا دوبارہ) پیدا کرنا زیادہ مشکل ہے یا آسمان کو؟‘‘ اپنے وجود اور آسمان کے وجود کا مقابلہ کرکے تو دیکھو، اور فرمایا : «{ لَخَلْقُ السَّمٰوٰتِ وَ الْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ }» [ المؤمن : ۵۷ ] ’’یقینا آسمانوں اور زمین کا پیدا کرنا لوگوں کے پیدا کرنے سے زیادہ بڑا (کام) ہے۔‘‘ ¤ ➋ {بِغَيْرِ عَمَدٍ تَرَوْنَهَا : ’’ عَمَدٍ ‘‘} اسم جمع ہے، جمع نہیں، اس کا مفرد{ ’’عَمُوْدٌ‘‘ } یا {’’عِمَادٌ‘‘} ہے۔ (شعراوی) اس کے دو مطلب ہو سکتے ہیں، ایک تو یہ کہ اللہ تعالیٰ نے اس قدر وسیع اور عظیم آسمانوں کو کسی بھی قسم کے ستونوں کے بغیر بلند کر دیا، تم خود انھیں دیکھ رہے ہو کہ ان کے نیچے کوئی ستون نہیں، جب کہ تم چھوٹی سے چھوٹی چھت بھی دیواروں یا ستونوں کے بغیر نہیں بنا سکتے۔ محض اپنی قدرت اور بے پناہ قوت کے ساتھ اتنا اونچا بنانے کے بعد وہیں تھام کر رکھنا اللہ تعالیٰ ہی کا کام ہے، چنانچہ فرمایا : «{وَ يُمْسِكُ السَّمَآءَ اَنْ تَقَعَ عَلَى الْاَرْضِ اِلَّا بِاِذْنِهٖ }» [ الحج : ۶۵ ] ’’اور وہ آسمان کو تھام کر رکھتا ہے، اس سے کہ زمین پر گر پڑے مگر اس کے اذن سے۔‘‘ مزید دیکھیے سورۂ فاطر(۴۱) اس صورت میں {’’ تَرَوْنَهَا ‘‘} (تم انھیں دیکھتے ہو) میں ضمیر کا مرجع لفظ {’’السَّمٰوٰتِ ‘‘} ہو گا اور {’’ تَرَوْنَهَا ‘‘} الگ نیا جملہ ہو گا کہ تم خود آسمانوں کو اس حالت میں دیکھ رہے ہو۔ دوسرا مطلب یہ ہے کہ {’’تَرَوْنَهَا ‘‘} کو{ ’’ عَمَدٍ ‘‘ } کی صفت قرار دیا جائے، پھر ترجمہ یہ ہو گا کہ اس نے آسمانوں کو ایسے ستونوں کے بغیر بلند فرمایا جنھیں تم دیکھتے ہو، گویا ستون ہیں مگر تمھیں نظر نہیں آتے، نہ کہیں نگاہ کے لیے رکاوٹ بنتے ہیں۔ آیت دونوں معنوں کا امکان رکھتی ہے اور اللہ تعالیٰ کے لیے دونوں ممکن ہیں، اس لیے ترجمہ میں بھی دونوں معنوں کو ملحوظ رکھا گیا ہے۔ علمائے تفسیر میں سے کسی نے پہلے معنی کو ترجیح دی اور کسی نے دوسرے کو۔ امام المفسرین طبری رحمہ اللہ نے فرمایا، حق یہ ہے کہ ہم بھی اسی طرح کہیں جیسے اللہ نے فرمایا۔ (خلاصہ) یعنی پورے علم کے بغیر ایک معنی کو ترجیح نہ دیں۔ (واللہ اعلم) (یہاں طبری کے فیصلے کی پوری عبارت نہایت پُر لطف ہے) کیا معلوم کہ کسی وقت تجزیے سے ثابت ہو جائے کہ فضا میں نظر نہ آنے والی کوئی چیز موجود ہے جس پر آسمان قائم ہیں۔ ¤ ➌ { ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ :} قرآن مجید میں اللہ تعالیٰ کا عرش پر مستوی ہونا سات جگہ آتا ہے، سورۂ اعراف (۵۴)، یونس (۳)، رعد (۲)، طٰہٰ (۵)، فرقان (۵۹)، سجدہ (۴) اور حدید (۴) اللہ تعالیٰ کے تعلق سے عرش کا ذکر اکیس (۲۱) مرتبہ اور ملکہ سبا کے تعلق سے چار (۴) مرتبہ آیا ہے۔ مستوی علی العرش کی تفصیل کے لیے دیکھیے سورۂ اعراف (۵۴) اور سورۂ حاقہ (۱۷)۔ ¤ ➍ { وَ سَخَّرَ الشَّمْسَ وَ الْقَمَرَ :} یہاں سے اللہ تعالیٰ نے بندوں پر اپنی چند نہایت واضح نعمتیں ذکر فرمائیں۔ تسخیر کا معنی ہے کسی کو اپنے تابع اور قابو میں کر لینا۔ یعنی اللہ تعالیٰ نے سورج اور چاند کو اپنے تابع اور پوری طرح پابند کر رکھا ہے، اس طرح کہ اللہ تعالیٰ نے انھیں جس طرح جس کام پر لگا دیا ہے وہ اس سے بال برابر ادھر ادھر نہیں ہوتے۔ جو مدت مقرر کی ہے اس کے عین مطابق مقرر وقت پر چل رہے ہیں، یعنی قیامت تک یا اپنے دورے کے مقرر وقت کے مطابق، نہ ان کی رفتار بدلتی ہے نہ طلوع وغیرہ کے نظام میں فرق آتا ہے۔ سورج اپنا دورہ سال میں پورا کرتا ہے، چاند ایک ماہ میں۔ کسی بھی سیارے یا سورج اور چاند کا آپس میں نہ کوئی ٹکراؤ ہے نہ حادثہ۔ یہ سب اللہ تعالیٰ کی زبردست قدرت و حکمت کی کتنی بڑی نشانی ہے۔ ¤ ➎ {يُدَبِّرُ الْاَمْرَ :} کسی کام کی تدبیر کا معنی اسے اس کے سب سے اچھے، مضبوط اور مکمل طریقے پر چلانا ہے۔ مختصر سے عطا کردہ اختیار سے تم جو تدبیریں کرتے ہو ان کا نتیجہ بھی دیکھ لو، کوئی پوری ہوتی ہے کوئی نہیں اور کوئی کسی حادثے کی نذر ہو جاتی ہے اور اس عزیز و حکیم کی تدبیر امور کو دیکھو۔ ¤ ➏ { يُفَصِّلُ الْاٰيٰتِ:} اس میں کائنات میں موجود نشانیاں بھی شامل ہیں اور اللہ تعالیٰ کی طرف سے اس کے رسولوں پر نازل شدہ آیات بھی کھول کر بیان کرنا ہے کہ دونوں کس قدر واضح ہیں، جن کے سمجھنے میں کوئی مشکل پیش نہیں آتی۔ ¤ ➐ { لَعَلَّكُمْ بِلِقَآءِ رَبِّكُمْ تُوْقِنُوْنَ :} یعنی ان تمام آیات کی تفصیل کا مقصد تمھیں یہ یقین دلانا ہے کہ ایسی عظیم مخلوقات کو پیدا کرنے اور ان کی تدبیر کرنے والے پروردگار کے لیے تمھیں دوبارہ پیدا کرنا کچھ مشکل نہیں اور ہر حال میں تمھیں اس کے سامنے پیش ہونا ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت3) ➊ {وَ هُوَ الَّذِيْ مَدَّ الْاَرْضَ …: ’’ مَدَّ ‘‘ } کا معنی پھیلانا ہے۔{ ’’ رَوَاسِيَ ‘‘ ’’رَاسِيَةٌ‘‘} کی جمع ہے، {’’رَسَا يَرْسُوْ‘‘} کا معنی زمین میں گڑا ہوا ہونا ہے، لفظی معنی زمین میں گڑے ہوئے، مراد پہاڑ ہیں۔ پہلے اوپر کے جہان کا تذکرہ فرمایا، پھر زمین، آسمان، سورج، چاند وغیرہ کا، اب نیچے کے جہان میں اللہ تعالیٰ کی چند قدرتوں کا ذکر ہے کہ زمین ایک کرہ ہونے کے باوجود اتنی وسیع بنائی کہ طول و عرض میں آدمی کی نگاہ اس کی انتہا کو نہیں پاتی، انسان اور حیوان کسی تکلیف کے بغیر اس پر چلتے پھرتے ہیں، انسان عظیم الشان عمارتیں بناتے ہیں۔ زمین کا توازن قائم رکھنے کے لیے اور ہر وقت زلزلے کی کیفیت سے محفوظ رکھنے کے لیے اس میں بہت نیچے تک گڑے ہوئے اور بہت اوپر تک اٹھے ہوئے پہاڑ بنا دیے اور تمھاری زندگی کی بقا کے لیے دریا اور ندی نالے بنا دیے۔ ندی نالوں کا ذکر پہاڑوں کے ساتھ فرمایا، کیونکہ دریا عموماً پہاڑوں ہی سے نکلتے ہیں۔ ¤ ➋ { وَ مِنْ كُلِّ الثَّمَرٰتِ … :} اس جملے میں ایک ایسی حقیقت بیان فرمائی ہے جس کا پوری طرح انکشاف کچھ مدت پہلے ہی ہوا ہے۔ پہلے لوگوں کو صرف چند درختوں کے جوڑا یعنی نر اور مادہ ہونے ہی کا علم تھا جن کے نر درخت الگ اور مادہ الگ ہوتے ہیں، مثلاً کھجور اور پپیتا وغیرہ۔ پھر ثابت ہوا کہ ہر درخت ہی کا پھل نر اور مادہ پھولوں کا بور ملنے سے وجود میں آتا ہے، یعنی ہر پھل میں جوڑا موجود ہے، پھر نر و مادہ دونوں پھول بعض اوقات ایک ہی پودے میں موجود ہوتے ہیں، بلکہ بعض اوقات ایک درخت کے ایک ہی پھول میں نر و مادہ دونوں حصے پائے جاتے ہیں۔ کتنی عظیم قدرتوں کا مالک ہے وہ جس کی صرف ایک تخلیق کی ایک حقیقت جو خود اس نے سیکڑوں برس پہلے بیان فرما دی تھی، اب کہیں انسان اسے کسی حد تک پا سکے ہیں۔ عموماً قدیم مفسرین نے اس کا معنی ہر پھل میں سے دو قسمیں کیا ہے، مثلاً میٹھا اور کھٹا، گرم اور سرد، چھوٹا اور بڑا، سیاہ اور سفید وغیرہ، یہ معنی بھی درست ہے۔ ¤ ➌ { يُغْشِي الَّيْلَ النَّهَارَ:} یہ اس کی قدرت کا اور اپنے بندوں پر رحمت کے ایک اور نمونے کا بیان ہے۔{ ’’غَشِيَ يَغْشٰي‘‘} (ع) کا معنی ڈھانپنا ہے۔ {’’ يُغْشِي ‘‘} باب افعال {’’ أَغْشَي يُغْشِيْ‘‘} سے ہے، معنی ہے کسی چیز کو دوسری چیز کے لیے ڈھانپنے والی بنا دینا۔ رات کو دن پر اڑھا دیتا ہے تو اندھیرا چھا جاتا ہے، اگلی بات خود سمجھ میں آ رہی ہے، اس لیے حذف کر دی، یعنی دن کو رات پر اڑھا دیتا ہے تو روشنی ہو جاتی ہے، دونوں ایک دوسرے کی جگہ آتے رہتے ہیں۔ دونوں کے فوائد کی تفصیل کے لیے دیکھیے سورۂ قصص (۷۱ تا ۷۳)۔ ¤ ➍ {اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ … :} یعنی جو لوگ غورو فکر کرتے ہیں ان کے لیے ان چیزوں میں بہت سے دلائل ہیں کہ وہ اللہ کہ مکان و زمان کی ہر حرکت و سکون اور ہر تبدیلی مکمل طور پر اس کے ہاتھ میں ہے، وہ انسان کو بھی دوبارہ پیدا کر سکتا ہے۔ موضح میں ہے : ’’رنگا رنگ چیزیں بنانا نشان ہے کہ اپنی خوشی سے بنایا، اگر ہر چیز خاصیت سے ہوتی تو ایک سی ہوتی۔‘‘ رازی رحمہ اللہ لکھتے ہیں کہ قرآن میں جہاں عالم سفلی، یعنی زمین کے دلائل کا ذکر ہے اس کے آخر میں : «{ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّتَفَكَّرُوْنَ۠ }» یا اس کا ہم معنی جملہ لایا گیا ہے، جس سے اشارہ ہے کہ ان چیزوں پر غور وفکر سے یہ نتیجہ نکلتا ہے کہ یہ اختلاف طبعی اسباب کے تحت نہیں (یعنی خود بخود ایسا نہیں ہو رہا بلکہ ایک کرنے والا سب کچھ کر رہا ہے)۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت4) ➊ {وَ فِي الْاَرْضِ قِطَعٌ مُّتَجٰوِرٰتٌ … : ’’ قِطَعٌ ‘‘ ’’قِطْعَةٌ‘‘} کی جمع ہے، بمعنی ٹکڑے۔{’’ مُتَجٰوِرٰتٌ ‘‘ ’’جِوَارٌ ‘‘} (ہمسائیگی) سے باب تفاعل کا اسم فاعل ہے، یعنی ساری زمین ایک جیسی نہیں، کوئی ٹکڑا زرخیز زمین کا ہے کوئی شور کا، کوئی نرم زمین ہے کوئی پتھریلی اور یہ سب قطعے ایک دوسرے کے ساتھ ساتھ ہیں، اب اسی زمین میں کسی علاقے میں کوئی کھیتی اور پھل پیدا ہوتا ہے کسی میں کوئی، اور اسی میں انگوروں (اور دوسرے پھلوں) کے باغات ہیں (قرآن کا اختصار دیکھیے کہ صرف انگوروں کا ذکر کرکے باقی باغات سننے والے کی سمجھ پر چھوڑ دیے) اور کھیتی ہے (اس میں ہر کھیتی آ گئی) اور کھجوروں کے درخت دو قسم کے ہیں ({’’ صِنْوَانٌ ‘‘ ’’صِنْوٌ‘‘} کی جمع ہے، تثنیہ بھی یہی ہے، اس کا اصل معنی مثل ہے، جیسے فرمایا : {’’عَمُّ الرَّجُلِ صِنْوُ أَبِيْهِ‘‘} یعنی آدمی کا چچا اس کے باپ کی مثل ہے۔ کھجور کا تنا نیچے سے ایک ہو اور اوپر اس تنے سے کئی تنے نکلیں تو وہ {’’ صِنْوَانٌ ‘‘} ہے اور اگر یہ ایک ہی تنا رہے تو یہ {’’ غَيْرُ صِنْوَانٍ ‘‘} ہے ) اس قسم کے دوسرے درخت اس سے خود سمجھ لیں۔ سب ایک ہی پانی سے سیراب کیے جاتے ہیں، پھر اسی زمین اور اسی پانی سے کوئی پھل کڑوا پیدا ہو رہا ہے کوئی میٹھا، کوئی بدمزہ کوئی مزیدار اور کوئی اس سے بھی بڑھ کر لذت والا۔ پھر دیکھیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ عَزَّوَجَلَّ خَلَقَ آدَمَ مِنْ قُبْضَةٍ قَبَضَهَا مِنْ جَمِيْعِ الْاَرْضِ فَجَاءَ بَنُوْ آدَمَ عَلٰي قَدْرِ الْأَرْضِ جَاءَ مِنْهُمُ الْأَبْيَضُ وَالْأَحْمَرُ وَالْأَسْوَدُ وَبَيْنَ ذٰلِكَ الْخَبِيْثُ وَالطَّيِّبُ وَالسَّهْلُ وَالْحَزْنُ وَبَيْنَ ذٰلِكَ ] [ مسند أحمد : 400/4، ح : ۱۹۶۰۱۔ ترمذی : ۲۹۵۵۔ أبوداوٗد : ۴۶۹۳، و صححہ الألبانی ] ’’آدم علیہ السلام کو پیدا کرنے کے لیے پوری روئے زمین سے اللہ تعالیٰ نے ایک مٹھی لی (جس میں سفید، سیاہ، سرخ ہر رنگ اور نرم، سخت، شور، زرخیز ہر قسم کی مٹی آ گئی) اور آدم کی اولاد اسی کے مطابق کوئی سفید، کوئی سرخ، کوئی سیاہ، کوئی اس کے درمیان، کوئی خبیث، کوئی طیب اور کوئی نرم، کوئی سخت پیدا ہوتی ہے اور کوئی اس کے درمیان۔‘‘ ایک ہی زمین، ایک ہی پانی، ایک ہی باپ اور اسی کے نطفے سے بے شماررنگا رنگ انسان پیدا ہوئے۔ ¤ ➋ { اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّعْقِلُوْنَ :} معلوم ہوا کوئی کمال کاریگر اور پوری قدرت والا مدبر ہے جس کے کرنے سے یہ سب کچھ ہو رہا ہے، قرآن نے ان دلائل کا ذکر مختلف مقامات پر کیا ہے۔ عقل سے کام لینے والوں کے لیے اس میں بے شمار نشانیاں ہیں اور جو عقل سے کام نہیں لیتے ان کے لیے کوئی نشانی نہیں۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت5) ➊ { وَ اِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ …: ’’ فَعَجَبٌ ‘‘} میں تنوین تعظیم و تہویل کے لیے ہے، اسی لیے اہل علم نے ترکیب میں اسے نکرہ ہونے کے باوجود مبتدا بنانا جائز رکھا ہے، گویا یہ نکرہ موصوفہ ہے۔ مطلب یہ ہے کہ اگر آپ اتنی نشانیاں دیکھ کر بھی ان کے ایمان نہ لانے پر تعجب کریں تو بہت ہی عجیب بات ان کا دوبارہ نئے سرے سے پیدا ہونے کو ناممکن قرار دینا ہے، حالانکہ جو شخص معمولی علم اور معمولی عقل رکھتا ہے بآسانی سمجھ سکتا ہے کہ اتنی قدرتوں کے مالک اور پہلی دفعہ انھیں پیدا کرنے والے کے لیے انھیں دوبارہ نئے سرے سے پیدا کرنا کیوں مشکل ہے۔ ¤ ➋ { اُولٰٓىِٕكَ الَّذِيْنَ كَفَرُوْا بِرَبِّهِمْ:} یعنی جب انھوں نے آخرت سے انکار کیا تو گویا اللہ کی قدرت سے انکار کیا اور یہ کہا کہ اللہ اتنا عاجز اور بے بس ہے کہ انھیں دوبارہ پیدا کر ہی نہیں سکتا۔ [ اَلْعِیَاذُ بِاللّٰہِ ] ¤ ➌ {وَ اُولٰٓىِٕكَ الْاَغْلٰلُ …: ’’ الْاَغْلٰلُ ‘‘ ’’غُلٌّ‘‘} کی جمع ہے، لوہے کا کڑا یا زنجیر جو مجرم کے گلے میں ڈال کر اسے باندھا جاتا ہے۔ بعض اوقات اس کے ساتھ ہی ہاتھ بھی گردن کے ساتھ باندھ دیتے ہیں، یہ قید کی سخت ترین صورت ہے۔ یعنی ان کی گردنوں میں وہی آبائی کفر و شرک کے طوق پڑے ہوئے ہیں جو انھیں کفر سے ہلنے نہیں دیتے اور انجام ان کا یہ ہے کہ یہ آگ والے ہیں، ہمیشہ اس میں رہنے والے ہیں۔ بعض مفسرین نے {’’ اُولٰٓىِٕكَ الْاَغْلٰلُ ‘‘} کو بھی آخرت کے انجام میں شامل کیا ہے کہ جہنم میں ان کی گردنوں میں لوہے کے طوق (کڑے) ہوں گے، جن میں پڑی ہوئی زنجیروں سے بندھے ہوں گے۔ آیت کے الفاظ سے تو زیادہ ظاہر معنی یہی معلوم ہوتا ہے، جیسا کہ دوسری جگہ فرمایا : «{ اِذِ الْاَغْلٰلُ فِيْۤ اَعْنَاقِهِمْ وَ السَّلٰسِلُ يُسْحَبُوْنَ (71) فِي الْحَمِيْمِ ثُمَّ فِي النَّارِ يُسْجَرُوْنَ }» [ المؤمن : ۷۱، ۷۲ ] ’’جب طوق ان کی گردنوں میں ہوں گے اور زنجیریں، گھسیٹے جا رہے ہوں گے۔ کھولتے پانی میں، پھر وہ آگ میں جھونکے جائیں گے۔‘‘"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت6) ➊ {وَيَسْتَعْجِلُوْنَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ … :’’ اَلسَّيِّئَةُ ‘‘} سے مراد بری حالت مثلاً عذاب اور {’’ الْحَسَنَةِ ‘‘} سے مراد اچھی حالت مثلاً عافیت اور خوش حالی ہے۔ {’’ الْمَثُلٰتُ ‘‘} کی واحد{ ’’ مَثُلَةٌ ‘‘} بروزن {’’ سَمُرَةٌ ‘‘} ہے، معنی ہے سخت سزا اور رسوا کن عذاب، جو انسان پر اترے اور اسے دوسروں کے لیے برے کاموں سے باز رکھنے کے لیے مثال اور عبرت بن جائے۔ {’’اِسْتِعْجَالٌ‘‘ } کسی چیز کا وقت آنے سے پہلے اسے لانے کا مطالبہ کرنا، یعنی ان کی سرکشی اس حد تک پہنچ چکی ہے کہ جھٹلانے اور مذاق اڑانے کے لیے تندرستی اور عافیت کے بجائے پہلے عذاب لانے کا مطالبہ کرتے ہیں۔ مشرکین کے اس قسم کے مطالبوں کا قرآن میں کئی جگہ ذکر ہے، مثلاً سورۂ انفال (۳۲)، سورۂ عنکبوت (۵۳، ۵۴) اور سورۂ نمل (۴۶) ان آیات کا ترجمہ و تفسیر پڑھ لیں۔ ¤ ➋ {وَ قَدْ خَلَتْ مِنْ قَبْلِهِمُ الْمَثُلٰتُ : } جن میں ان کے لیے عبرت کا کافی سامان موجود ہے۔ موضح میں ہے کہ پہلے ہو چکیں ہیں کہاوتیں، یعنی ایسے عذاب آئے ہیں کہ ان کی کہاوتیں چلی ہیں۔ ¤ ➌ {وَ اِنَّ رَبَّكَ لَذُوْ مَغْفِرَةٍ لِّلنَّاسِ عَلٰى ظُلْمِهِمْ : ’’ مَغْفِرَةٍ ‘‘} پر تنوین تعظیم کے لیے ہے، یعنی اللہ اتنی بڑی مغفرت والا ہے کہ لوگوں کے ظلم پر گرفت کرے تو زمین پر کوئی جان دار باقی نہ رہے، فرمایا : «{ وَ لَوْ يُؤَاخِذُ اللّٰهُ النَّاسَ بِظُلْمِهِمْ مَّا تَرَكَ عَلَيْهَا مِنْ دَآبَّةٍ وَّ لٰكِنْ يُّؤَخِّرُهُمْ اِلٰۤى اَجَلٍ مُّسَمًّى فَاِذَا جَآءَ اَجَلُهُمْ لَا يَسْتَاْخِرُوْنَ سَاعَةً وَّ لَا يَسْتَقْدِمُوْنَ}» [ النحل : ۶۱] ’’اور اگر اللہ لوگوں کو ان کے ظلم کی وجہ سے پکڑے تو اس کے اوپر کوئی چلنے والا نہ چھوڑے اور لیکن وہ انھیں ایک مقرر وقت تک ڈھیل دیتا ہے، پھر جب ان کا وقت آ جاتا ہے تو ایک گھڑی نہ پیچھے رہتے ہیں اور نہ آگے بڑھتے ہیں۔‘‘ اور دیکھیے سورۂ فاطر کی آخری آیت۔ وہ مہلت ہی دیے جاتا ہے کہ شاید باز آ جائیں، توبہ کر لیں اور اس کا عذاب بھی نہایت سخت ہے۔ معلوم ہوا کہ سلامتی اور امن کی راہ امید اور خوف میں اعتدال ہے، انسان اللہ تعالیٰ سے مغفرت کی امید بھی رکھے اور اس کے عذاب سے ڈرتا بھی رہے۔ حقیقت یہ ہے کہ اگر اللہ تعالیٰ کے عفو و درگزر کی امید نہ ہو تو کسی شخص کی زندگی خوش گوار نہ ہو اور اگر اس کے عذاب کا ڈر نہ ہو تو ہر شخص بے کھٹکے گناہ کرتا رہے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت7) ➊ {وَ يَقُوْلُ الَّذِيْنَ كَفَرُوْا لَوْ لَاۤ اُنْزِلَ …:} اس آیت میں اللہ تعالیٰ نے کفار کی ایک اور کمینگی کی طرف اشارہ فرمایا ہے کہ یہ کفار تمام انبیاء کی آیات (معجزوں) سے بڑی آیت (بڑا معجزہ یعنی قرآن مجید) دیکھنے کے باوجود کہہ رہے ہیں کہ اس پر کوئی آیت (معجزہ) نازل کیوں نہیں ہوئی۔ ان کے مطالبوں کی مثال دیکھنی ہو تو دیکھیے سورۂ بنی اسرائیل (۹۰ تا ۹۳) آیت یعنی نشانی دو قسم کی ہوتی ہے، ایک تنزیلی یعنی اللہ تعالیٰ کی طرف سے اترنے والے احکام و آیات اور دوسری تکوینی یعنی جن کا مقابلہ کرنے سے ساری کائنات عاجز ہو۔ قرآن میں دونوں خوبیاں ہیں، اس میں ہدایت کی آیات بھی ہیں اور ساری دنیا کو پہلے پوری کتاب، پھر اس جیسی دس سورتیں اور پھر صرف ایک سورت جیسی سورت لانے کا چیلنج قیامت تک کے لیے ہے، جس کا جواب کافر آج تک نہیں دے سکے، کفار کی خست دیکھو پھر بھی کہہ رہے ہیں کہ اس پر کوئی نشانی کیوں نہیں اتری۔ ¤ ➋ {اِنَّمَاۤ اَنْتَ مُنْذِرٌ وَّ لِكُلِّ قَوْمٍ هَادٍ:} نبی کریم صلی اللہ علیہ وسلم مبشر بھی تھے اور منذر بھی، مگر یہاں آپ کی صفت صرف منذر بیان فرمائی، کیونکہ ذکر کفار کا ہے۔ {’’ مُنْذِرٌ ‘‘} اور {’’ هَادٍ ‘‘ } پر تنوین تعظیم کی ہے، یعنی اللہ پر ایمان نہ لانے والوں کے لیے دنیا و آخرت کے عذاب سے ڈرانے والے کی ضرورت ہوتی ہے اور ہر قوم کے لیے ایک عظیم رہنما ہوتا ہے۔ آپ کا کام کرشمے دکھانا نہیں بلکہ آپ کی ذمہ داری لوگوں کو کفر کے برے انجام سے ڈرانا ہے، اس لیے آپ کرشمے دکھانے والے نہیں بلکہ صرف ایک عظیم ہادی، یعنی ڈرانے اور آگاہ کرنے والے ہیں۔ ({’’ اِنَّمَاۤ ‘‘} کے ساتھ یہ حصر اضافی ہے، یعنی معجزہ دکھانے والے کے بجائے منذر ہیں، یہ نہیں کہ آپ منذر کے سوا کچھ بھی نہیں ہیں) پھر قوموں کو رہنما کی ضرورت ہوتی ہے اور آپ عظیم رہنما بھی ہیں، لہٰذا ان کے بے جا مطالبے سے پریشان نہ ہوں۔ مستدرک حاکم(۳؍140، ح : ۴۶۴۶) میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے علی رضی اللہ عنہ نے اس آیت «{ اِنَّمَاۤ اَنْتَ مُنْذِرٌ وَّ لِكُلِّ قَوْمٍ هَادٍ}» کے ضمن میں فرمایا : ’’رسول اللہ صلی اللہ علیہ وسلم منذر ہیں اور میں ہادی ہوں۔‘‘ مگر یہ روایت صحیح نہیں ہے، پھر خلافت بلا فصل پر اس سے استدلال بھی غلط ہے، جیسا کہ ظاہر ہے، حقیقت یہی ہے کہ رسول اللہ صلی اللہ علیہ وسلم ہی اللہ کی طرف سے منذر ہیں اور وہی ہادی ہیں، پھر وہ لوگ جنھوں نے آپ صلی اللہ علیہ وسلم کے علم اور دین یعنی خالص کتاب و سنت کو (نہ کہ لوگوں کی رائے اور قیاس کو) دعوت و جہاد کے ذریعے آگے پہنچایا، پہنچا رہے ہیں اور پہنچاتے رہیں گے، مثلاً خلفائے اربعہ، صحابہ کرام، مجاہدین اسلام، محدثین اور عادل قاضی اور خلفاء (اللہ سب پر راضی ہو) سب آپ کے خلف صدق ہیں۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت8) ➊ {اَللّٰهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ اُنْثٰى … : ’’ تَغِيْضُ ‘‘ ’’غَاضَ يَغِيْضُ‘‘} سے ہے اور یہ {’’نَقَصَ يَنْقُصُ‘‘} کا ہم معنی ہے۔ لازم اور متعدی دونوں معنوں میں آتا ہے، یعنی کم ہونا، کم کرنا۔ اسی طرح {’’ تَزْدَادُ ‘‘} باب افتعال {’’زَادَ يَزِيْدُ‘‘} کی طرح ہے، معنی ہے زیادہ ہونا اور زیادہ کرنا۔ یعنی حمل قرار پانے سے لے کر بچہ پیدا ہونے تک ہر چیز کا علم اللہ تعالیٰ کو ہے اور ارحام (بچہ دانیوں) کا یہ علم اللہ تعالیٰ کی خاص صفات میں سے ہے، یعنی اس بات کا علم کہ مذکر ہے یا مؤنث، خوب صورت ہے یا بد صورت، بدبخت ہے یا نیک بخت، لمبی عمر والا ہے یا کم عمر۔ مزید دیکھیے سورۂ نجم (۳۲)، زمر (۶) اور مومنون (۱۲ تا ۱۴)۔ عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَفَاتِحُ الْغَيْبِ خَمْسٌ : «اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةِ وَ يُنَزِّلُ الْغَيْثَ وَ يَعْلَمُ مَا فِي الْاَرْحَامِ وَ مَا تَدْرِيْ نَفْسٌ مَّا ذَا تَكْسِبُ غَدًا وَ مَا تَدْرِيْ نَفْسٌۢ بِاَيِّ اَرْضٍ تَمُوْتُ اِنَّ اللّٰهَ عَلِيْمٌ خَبِيْرٌ» ] ’’غیب کی کنجیاں پانچ ہیں (جنھیں اللہ تعالیٰ کے سوا کوئی نہیں جانتا)۔‘‘ (پھر سورۂ لقمان کی آخری آیت میں مذکور چیزیں بیان فرمائیں)۔ [ بخاری، التفسیر، باب : «وعندہ مفاتح الغیب …» : ۴۶۲۷] مزید وضاحت کے لیے سورۂ لقمان کی آخری آیت کی تفسیر ملاحظہ فرمائیں۔ الٹرا ساؤنڈ کی حقیقت بھی وہیں ملاحظہ فرمائیں۔ ¤ ➋ {وَ مَا تَغِيْضُ الْاَرْحَامُ وَ مَا تَزْدَادُ:} اور جو رحم کم کرتے ہیں یا زیادہ کرتے ہیں، یعنی بچہ ضائع ہو جاتا ہے یا نامکمل پیدا ہوتا ہے یا مدتِ ولادت میں اضافہ یا کمی ہوتی ہے کہ بعض کے ہاں چھ یا نو ماہ بعد، بعض کے ہاں دس ماہ یا اس سے بھی زیادہ مدت کے بعد بچہ پیدا ہوتا ہے۔ ¤ ➌ {وَ كُلُّ شَيْءٍ عِنْدَهٗ بِمِقْدَارٍ :} اللہ تعالیٰ کو ازل سے ابد تک ہر چیز کا علم ہے، اس نے ہر چیز کے متعلق پہلے ہی سب کچھ طے کر کے لوح محفوظ میں لکھ دیا ہے اور یہی تقدیر ہے۔ اس پر ایمان نہ ہو تو آدمی مسلمان نہیں ہوتا، فرمایا : «{ اِنَّا كُلَّ شَيْءٍ خَلَقْنٰهُ بِقَدَرٍ }» [ القمر : ۴۹ ] ’’بے شک ہم نے جو بھی چیز ہے، ہم نے اسے ایک اندازے کے ساتھ پیدا کیا ہے۔‘‘ یعنی وہی جانتا ہے کہ کون سی چیز کتنی ہو گی اور کیسے ہو گی، اس اندازے میں کمی بیشی نہیں ہو سکتی ۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت9){عٰلِمُ الْغَيْبِ …:’’ الْكَبِيْرُ ‘‘} میں بھی مبالغہ ہے اور {’’ الْمُتَعَالِ ‘‘} (جو اصل میں {’’عَلَا يَعْلُوْ‘‘ } کے باب تفاعل سے {’’مُتَعَالِوٌ‘‘} تھا) میں حروف زیادہ ہونے سے معنی میں مبالغہ مراد ہے۔ {’’مُتَعَالِوٌ‘‘} کی ’’واؤ‘‘ کو ’’یاء‘‘ سے بدلا تو {’’مُتَعَالِيٌ‘‘} ہوا، پھر ’’یاء‘‘ کو آیات کے آخری الفاظ (جنھیں اصطلاح میں فاصلہ، فواصل کہتے ہیں) کی موافقت اور تخفیف کے لیے حذف کر دیا گیا۔ اس میں اللہ تعالیٰ کے علم کی وسعت اور اس کی کبریائی اور بلندی کا بے حد و حساب ہونا بیان ہوا ہے، جو درحقیقت پچھلی بات ہی کی تاکید ہے۔ {’’ الْغَيْبِ ‘‘} مصدر ہے، بمعنی اسم فاعل، یعنی غائب جو حواس اور بدیہ عقل سے غائب ہو۔ {’’ الشَّهَادَةِ ‘‘} مصدر بمعنی اسم فاعل ہے، یعنی جو شاہد و حاضر ہے۔ اسم فاعل کو مصدر کی صورت میں لانے سے مبالغہ مقصود ہے، جیسے {’’زَيْدٌ عَادِلٌ‘‘} کے بجائے {’’زَيْدٌ عَدْلٌ‘‘} کہتے ہیں۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت10) ➊ {سَوَآءٌ مِّنْكُمْ مَّنْ اَسَرَّ الْقَوْلَ …:} یہ اللہ تعالیٰ کے علم کی وسعت کی ایک اور تاکید ہے، یعنی تمھارا کوئی آدمی چھپا کر بات کرے یا بلند آواز سے اللہ کے نزدیک دونوں برابر ہیں، وہ دونوں کو یکساں سنتا ہے، جبکہ تم اور ساری مخلوق چھپی بات کو تو سن ہی نہیں سکتے، البتہ بلند آواز سے کی ہوئی ایک شخص کی بات تم سن اور سمجھ سکتے ہو، مگر جب چار چھ آدمی اونچی آواز میں بولنا شروع کر دیں تو کسی کے پلے کچھ نہیں پڑے گا، اب اللہ تعالیٰ کے علم کا اندازہ کر لو کہ اس کے ہاں یہ سب برابر ہیں، وہ ایک ہی وقت میں سب کی سنتا اور سمجھتا اور سب کی ضرورتیں پوری کرتا ہے۔ ¤ ➋ {’’ مُسْتَخْفٍۭ ‘‘ ’’ خَفِيَ يَخْفَي ‘‘} (چھپنا) کے باب استفعال سے اسم فاعل برائے مبالغہ ہے، بالکل چھپنے والا۔ {’’ بِالَّيْلِ ‘‘} رات کو، کیونکہ رات کی تاریکی چھپنے میں مزید مدد دیتی ہے۔ {’’ سَارِبٌۢ ‘‘} یعنی ظاہر، {’’ سَرَبَ فِي الْاَرْضِ اَيْ ذَهَبَ فِيْ طَرِيْقِهٖ‘‘} وہ اپنے راستے میں گیا، یعنی گھر کے کسی کمرے یا کونے کے بجائے راستے یا گلی بازار میں پھرنے والا اور وہ بھی دن کو ہر ایک کے سامنے ہوتا ہے۔ دن کا ذکر خصوصاً اس لیے کیا کہ وہ ہر چیز کو خوب ظاہر کر دیتا ہے۔ اس لیے بعض اہل علم نے {’’ سَارِبٌۢ ‘‘} کا معنی گلیوں میں پھرنے والا، یعنی بالکل ظاہر کیا ہے۔ یعنی یہ سب اس کے علم میں برابر ہیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت11) ➊ {لَهٗ مُعَقِّبٰتٌ مِّنْۢ بَيْنِ يَدَيْهِ …: ’’ مُعَقِّبٰتٌ ‘‘} (باری باری ایک دوسرے کے بعد آنے والے) یہ ملائکہ کی صفت ہے۔ اس آیت میں اللہ تعالیٰ نے انسان کی نگرانی و حفاظت کا جو انتظام کر رکھا ہے اس کی ایک جھلک دکھائی ہے۔ اللہ تعالیٰ ہی بہتر جانتا ہے کہ اس نے ہر انسان پر کتنے فرشتے مقرر کر رکھے ہیں، کیونکہ دو فرشتے تو نیک و بدعمل لکھنے والے دائیں اور بائیں ہیں۔ (ق : ۱۷، ۱۸) حفاظت کرنے والوں کی تعداد یہاں بیان نہیں فرمائی جو چاروں طرف سے انسان کی ہر آفت و مصیبت سے حفاظت کرتے ہیں، سوائے اس مصیبت کے جو اللہ نے اس کے لیے لکھی ہے۔ فرشتوں کی ایک اور قسم کے متعلق عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ وُكِّلَ بِهٖ قَرِيْنُهٗ مِنَ الْجِنِّ ، وَ قَرِیْنُہُ مِنَ الْمَلَائِکَۃِ قَالُوْا وَ إِيَّاكَ يَا رَسُوْلَ اللّٰهِ !؟ قَالَ وَإِيَّايَ إِلاَّ أَنَّ اللّٰهَ أَعَانَنِيْ عَلَيْهِ فَأَسْلَمَ فَلاَ يَأْمُرُنِيْ إِلاَّ بِخَيْرٍ ] [مسلم، صفات المنافقین، باب تحریش الشیطان… : ۲۸۱۴ ]’’تم میں سے جو بھی شخص ہے اس کے ساتھ اس کا ایک قرین (ساتھ رہنے والا) جنوں سے مقرر کیا گیا ہے اور ایک قرین فرشتوں سے۔‘‘ لوگوں نے پوچھا : ’’یا رسول اللہ! آپ کے ساتھ بھی (جن مقرر ہے)؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’(ہاں) میرے ساتھ بھی، مگر اللہ نے اس کے مقابلے میں میری مدد فرمائی ہے تو وہ تابع ہو گیا ہے، سو وہ مجھے خیر کے سوا کوئی حکم نہیں دیتا۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے بتایا کہ باری والے فرشتے صبح اور عصر کے وقت تبدیل ہوتے ہیں، ان وقتوں میں آنے اور جانے والوں کی ملاقات ان دونوں نمازوں میں ہوتی ہے۔ [ بخاري، مواقیت الصلاۃ، باب فضل صلاۃ العصر : ۵۵۵۔ مسلم : ۶۳۲ ] اس حقیقت کے اظہار کا مقصد یہ ہے کہ انسان ہر آن اللہ تعالیٰ کی حفاظت میں رہتا ہے اور اس کی کوئی حرکت اللہ تعالیٰ سے پوشیدہ نہیں۔ ¤ ➋ {اِنَّ اللّٰهَ لَا يُغَيِّرُ مَا بِقَوْمٍ …: } یعنی جب تک نیکی کے بجائے برائی اور اطاعت کے بجائے نافرمانی نہ کرنے لگیں، البتہ جب وہ ایسا کرنے لگیں تو اللہ تعالیٰ ان سے اپنی نعمت چھین لیتا ہے اور ان پر اپنا عذاب نازل کرتا ہے۔ یہی بات اللہ تعالیٰ نے آلِ فرعون کی مثال کے ساتھ سورۂ انفال (۵۳، ۵۴) میں بیان فرمائی۔ مزید مثال کے لیے دیکھیے سورۂ نحل (۱۱۲) اور سبا (۱۵ تا ۱۷) واضح رہے کہ یہاں قوموں کی تباہی کا قانون بیان کیا گیا ہے، افراد کا نہیں۔ کسی قوم کی اچھی یا بری حالت کا تعین اسی لحاظ سے کیا جائے گا کہ آیا اس میں اچھے لوگوں کا غلبہ ہے یا برے لوگوں کا؟ رہے افراد تو ضروری نہیں کہ ایک شخص گناہ کرے تبھی اس پر عذاب نازل ہو، بلکہ ایک بے گناہ شخص دوسروں کے گناہ کی لپیٹ میں آ سکتا ہے، جیسا کہ زینب بنت جحش رضی اللہ عنھا بیان کرتی ہیں کہ میں نے پوچھا : [ يَا رَسُوْلَ اللّٰهِ ! أَنَهْلِكُ وَفِيْنَا الصَّالِحُوْنَ، قَالَ نَعَمْ إِذَا كَثُرَ الْخَبَثُ ] [ بخاری، أحادیث الأنبیاء، باب قصۃ یأجوج و مأجوج : ۳۳۴۶ ] ’’اے اللہ کے رسول! کیا نیک لوگوں کے ہم میں موجود ہونے کے باوجود ہم ہلاک ہو جائیں گے؟‘‘ فرمایا: ’’ہاں! جب خباثت (گناہ) زیادہ ہو جائے۔‘‘ ¤ ➌ {وَ اِذَاۤ اَرَادَ اللّٰهُ بِقَوْمٍ سُوْٓءًا …: } ہم چاہے کتنی سائنسی تدبیریں اور حفاظت کا بندوبست کر لیں، یا کسی پیر، بزرگ، بت یا جن یا فرشتے کی پناہ پکڑ لیں، اللہ تعالیٰ کے ارادے کے مقابلے میں کسی کی کچھ پیش نہیں جاتی۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت12){هُوَ الَّذِيْ يُرِيْكُمُ الْبَرْقَ …:} اس آیت میں اللہ تعالیٰ نے اپنی قدرت کے ایسے نشان بیان فرمائے ہیں جو بیک وقت امید اور ڈر کے حامل ہیں، جو رحمت کا پیش خیمہ بھی بن سکتے ہیں اور موجب زحمت بھی۔ مثلاً جب بجلی چمکتی ہے تو امید بندھتی ہے کہ بارش ہو گی مگر ڈر بھی لگتا ہے کہ کہیں تباہی کا موجب نہ بن جائے، بادل دیکھ کر رحمت کی بارش کی امید بندھ جاتی ہے مگر ساتھ ہی یہ فکر بھی دامن گیر رہتی ہے کہ کہیں سیلاب نہ آ جائے۔ پس انسان کو چاہیے کہ اللہ کی رحمت کا امید وار رہے اور اس کے عذاب سے بھی ڈرتا رہے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت13) ➊ {وَ يُسَبِّحُ الرَّعْدُ بِحَمْدِهٖ …: ’’ الرَّعْدُ ‘‘} یعنی بادل کی گرج، اس آیت میں اللہ تعالیٰ نے اپنی کمال قدرت، جلال اور عظمت کے بیان کے لیے بادل کی گرج، گرنے والی بجلیوں اور ان کی کڑک کا ذکر فرمایا۔ یہ اس کی حمد کے ساتھ تسبیح کرتی ہیں کہ اللہ تعالیٰ ہر کمی اور ہر عیب سے پاک اور ہر کمال اور ہر خوبی کا مالک ہے اور فرشتے بھی اس کے خوف کی وجہ سے تسبیح و تحمید کرتے ہیں، بلکہ کائنات کی ہر چیز کا یہی وظیفہ ہے، فرمایا : «{ وَ اِنْ مِّنْ شَيْءٍ اِلَّا يُسَبِّحُ بِحَمْدِهٖ وَ لٰكِنْ لَّا تَفْقَهُوْنَ تَسْبِيْحَهُمْ}» [ بنی إسرائیل : ۴۴ ] ’’اور کوئی بھی چیز نہیں مگر اس کی حمد کے ساتھ تسبیح کرتی ہے اور لیکن تم ان کی تسبیح نہیں سمجھتے۔‘‘ قرآن مجید میں کئی چیزوں کا صاحب احساس ہونا اور بولنا مذکور ہے، جنھیں ہم بے زبان سمجھتے ہیں۔ سلیمان علیہ السلام کے زمانے میں چیونٹی کی بات اور سلیمان علیہ السلام کا اسے سمجھنا، اسی طرح ہدہد سے ان کی گفتگو سورۂ نمل میں مذکور ہے۔ سورۂ بقرہ میں پتھروں کا اللہ کے خوف سے گرنا، پھٹ جانا اور ان سے پانی بہ نکلنا مذکور ہے۔ جہنم اور جنت کی گفتگو قرآن وحدیث میں آئی ہے اور اب تو سائنس نے نباتات میں شعور و احساس تجربے سے ثابت کیا ہے۔ کفار کے مرنے پر آسمان و زمین کا نہ رونا سورۂ دخان (۲۹) میں ہے۔ پرندوں اور پہاڑوں کا داؤد علیہ السلام کے ساتھ مل کر صبح و شام تسبیح کا ذکر کرنا سورۂ ص (۱۸، ۱۹) میں ہے۔ {’’ الرَّعْدُ ‘‘} کے متعلق چند احادیث معروف ہیں۔ ایک لمبی روایت ابن عباس رضی اللہ عنھما سے مروی ہے، جس میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے یہودیوں کے ایک سوال کے جواب میں فرمایا : {’’ الرَّعْدُ ‘‘} فرشتوں میں سے ایک فرشتہ ہے جو بادل پر مقرر ہے، اس کے ہاتھ میں آگ کا کوڑا ہے، جس کے ساتھ وہ بادل کو ہانکتا ہے اور جو آواز اس سے سنائی دیتی ہے وہ اس کے بادل کو ہانکنے کی آواز ہے، جب وہ اسے ہانکتا ہے یہاں تک کہ وہ اس جگہ پہنچ جاتا ہے جہاں وہ اسے حکم دیتا ہے۔‘‘ یہ حدیث ترمذی (۳۱۱۷) ، مسند احمد (۱؍۲۷۴، ح : ۲۴۸۷) اور سنن کبریٰ للنسائی (۶؍۳۳۶، ح : ۹۰۷۲) وغیرہ میں ہے۔ شیخ البانی رحمہ اللہ نے اسے سلسلہ صحیحہ (۴؍۴۹۱، ح : ۱۸۷۲) میں ذکر فرمایا ہے اور لمبی بحث کے بعد فرمایا ہے کہ میرے نزدیک یہ حدیث کم از کم حسن ضرور ہے۔ البتہ مسند احمد کی تخریج میں شعیب ارنؤوط نے ابن عباس رضی اللہ عنھما کی اس لمبی حدیث کو حسن کہا ہے، مگر اس کے اس رعد والے حصے کو منکر کہا ہے۔ (واللہ اعلم) ¤ اگر کوئی کہے کہ سائنس تو اسے بادل کے ٹکڑوں کی رگڑ کا نتیجہ قرار دیتی ہے تو اسے کہیں کہ یہ بات حدیث کے خلاف نہیں، وہ رگڑ بھی تو کسی کے حکم سے بادلوں کے چلنے کے نتیجے ہی میں پیدا ہوتی ہے۔ کائنات کی کوئی بھی چیز خود بخود نہیں چل رہی۔ قبیلہ بنو غفار کے ایک صحابی بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ عَزَّ وَجَلَّ يُنْشِئُ السَّحَابَ فَيَنْطِقُ أَحْسَنَ النُّطْقِ وَيَضْحَكُ أَحْسَنَ الضَّحْكِ ] [ السلسلۃ الصحیحۃ : 409/2، ح : ۱۶۶۵ ] ’’اللہ تعالیٰ بادل کو پیدا کرتا ہے تو وہ بولتا ہے، بہترین بولنا اور ہنستا ہے، بہترین ہنسنا۔‘‘ شیخ البانی رحمہ اللہ نے صحیحہ میں اسے مسند احمد اور کئی کتب حدیث کے حوالے سے ذکر کرکے اس کی سند کو صحیح کہا اور شعیب ارنؤوط نے بھی مسند احمد (۳۹؍۹۱، ۹۲، ح: ۲۳۶۸۶) میں اس کی سند کو صحیح کہا ہے۔ معلوم ہوا کہ یہ گرج اور چمک بادل ہی کی گفتگو اور اسی کا ہنسنا ہے۔ رہی یہ بات کہ ’’رعد‘‘ فرشتے کی آواز ہے یا بادل کی گفتگو، تو حقیقت یہ ہے کہ دونوں باتیں ہی درست ہیں، ان میں کوئی تضاد نہیں۔ ¤ ➋ {وَ يُرْسِلُ الصَّوَاعِقَ …:} مفردات راغب میں ہے کہ ’’صاعقہ‘‘ تین معنوں میں آتا ہے : (1) موت، جیسے : «{فَصَعِقَ مَنْ فِي السَّمٰوٰتِ وَ مَنْ فِي الْاَرْضِ }» [ الزمر : ۶۸ ] (2) عذاب، جیسے : «{ اَنْذَرْتُكُمْ صٰعِقَةً مِّثْلَ صٰعِقَةِ عَادٍ وَّ ثَمُوْدَ }» [ حٰمٓ السجدۃ : ۱۳ ] (3) آگ، جیسا کہ فرمایا : «{ وَ يُرْسِلُ الصَّوَاعِقَ } » [ الرعد : ۱۳ ] کیونکہ صاعقہ کا معنی فضا میں پیدا ہونے والی نہایت سخت آواز (بجلی کی کڑک) ہے، پھر اس کے نتیجے میں مذکورہ تین چیزوں میں سے کوئی بھی چیز واقع ہو سکتی ہے، گویا حقیقت میں صاعقہ ایک ہی چیز ہے، باقی اس کے اثرات ہیں۔ صاعقہ کے ساتھ نکلنے والی بجلی کی چمک نہایت تیز ہوتی ہے، اللہ تعالیٰ کڑکنے والی بجلیوں کو بھیجتا ہے، پھر جن پر چاہتا ہے بجلی گرا دیتا ہے، جبکہ وہ بے فکر ہو کر اللہ تعالیٰ کے متعلق جھگڑ رہے ہوتے ہیں۔ ¤ ➌ {وَ هُمْ يُجَادِلُوْنَ فِي اللّٰهِ :} یعنی اتنی نشانیاں دیکھنے کے باوجود اللہ تعالیٰ کے بارے میں جھگڑتے ہیں، کبھی اس کے کمال علم و قدرت اور اکیلے معبود ہونے کا انکار کرتے ہیں اور کہتے ہیں کہ وہ دوبارہ زندہ کیسے کرے گا اور کبھی اس کے رسولوں کو جھٹلاتے ہیں اور کبھی اس کے عذاب کے لیے جلدی مچاتے ہیں۔ ¤ ➍ { وَ هُوَ شَدِيْدُ الْمِحَالِ:} امام راغب نے {’’ الْمِحَالِ ‘‘} کا مادہ {’’ مَحْلٌ ‘‘} بتایا ہے اور {’’ شَدِيْدُ الْمِحَالِ ‘‘} کا معنی کیا ہے : {’’شَدِيْدُ الْأَخْذِ بِالْعُقُوْبَةِ‘‘ } یعنی وہ سزا دینے میں سخت گرفت والا ہے۔ امام راغب ہی نے بعض اہل علم کا قول لکھا ہے کہ اس کا مادہ {’’حَوْلٌ‘‘} ہے، بمعنی {’’ قُوَّةٌ ‘‘} یعنی وہ بہت سخت قوت والا ہے۔ اس صورت میں میم زائد ہے۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت14) ➊ {لَهٗ دَعْوَةُ الْحَقِّ :} یہاں موصوف اپنی صفت کی طرف مضاف ہے، یعنی سچا اور برحق پکارنا صرف اسی کو پکارنا ہے، دوسرے کسی کو بھی پکارنا باطل ہے۔ کیونکہ دور و نزدیک سے ہر ایک کی پکار سنتا بھی وہی ہے، ہر ایک کے احوال سے واقف بھی وہی ہے اور ہر ایک کی حاجت پوری کرنے کی قدرت بھی صرف وہی رکھتا ہے، کسی اور میں ان صفات میں سے کوئی صفت بھی نہیں۔ ¤ ➋ {وَ الَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِهٖ …: ’’ يَدْعُوْنَ ‘‘} کی ضمیر مشرکین کے لیے ہے، یعنی اللہ کے سوا کسی کو بھی پکارنے والے کی مثال اس شخص کی سی ہے جو دونوں ہاتھ پانی کی طرف پھیلائے تاکہ وہ اس کے منہ تک پہنچ جائے، اب پانی نہ اس کی بات سنتا ہے، نہ سمجھتا ہے اور نہ یہ طاقت رکھتا ہے کہ خود بخود اس کے منہ تک پہنچ جائے۔ اللہ تعالیٰ نے کئی مقامات پر ان خود ساختہ خداؤں کی بے بضاعتی اور بے بسی بڑی تفصیل سے بیان فرمائی۔ دیکھیے سورۂ اعراف (۱۹۱ تا ۱۹۸)، سبا (۲۲)، فاطر (۱۳، ۱۴)، احقاف (۵) اور حج (۷۳) قارئین سے درخواست ہے کہ وہ یہ مقامات نکال کر ترجمہ ضرور پڑھیں، ان شاء اللہ توحید کی ٹھنڈک دل میں محسوس کریں گے۔ ¤ ➌ { وَ مَا دُعَآءُ الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ:} یعنی کافروں کا غیر اللہ کو پکارنا سراسر بے سود ہے، جس سے کچھ حاصل نہیں۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’کافر جن کو پکارتے ہیں بعض محض خیال ہیں، بعض جن اور بعض ایسی چیزیں ہیں کہ ان میں کچھ خواص ہیں، لیکن وہ اپنے خواص کی مالک نہیں، پھر ان کے پکارنے سے کیا حاصل۔ جیسے آگ یا پانی اور شاید ستارے بھی اسی قسم میں ہوں، یہ اس کی مثال فرمائی۔‘‘ (موضح) اس کی مختصر سی تفصیل سمجھ لیں کہ فرشتے ہر وقت ہمارے ساتھ ہیں، سنتے بھی ہیں، طاقت بھی رکھتے ہیں مگر وہ اللہ کے اذن کے بغیر کچھ بھی نہ کر سکتے ہیں اور نہ کرتے ہیں۔ تو انھیں پکارنا ایسے ہی ہے جیسے پانی کو اشارے سے یا زبان سے کہا جائے کہ وہ منہ میں آ جائے، حالانکہ اس میں یہ قدرت ہی نہیں اور بالفرض ہو بھی تو وہ یہ اختیار نہیں رکھتا۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت15) ➊ {وَ لِلّٰهِ يَسْجُدُ مَنْ فِي السَّمٰوٰتِ …:} سجدے کا معنی ہے جسم کے سب سے اونچے اور باعزت حصے کو کسی کے سامنے نیچے سے نیچا لے جا کر اس کے سامنے اپنی انتہائی عاجزی کا اظہار کرنا۔ تو کائنات کی ہر چیز اللہ تعالیٰ کے سامنے اسی طرح اپنی عاجزی اور بے بسی کا اظہار کر رہی ہے۔ اس میں مسلمان اور کافر کا کوئی فرق نہیں، ہاں انسان کو تھوڑا سا اختیار جنت یا جہنم کے راستے پر چلنے کا دیا ہے، اس کے علاوہ اللہ کے سامنے نہ چاہتے ہوئے بھی ہر طرح سجدہ ریز ہے اور اللہ تعالیٰ کے اختیار کے مقابلے میں اپنے آپ پر اس کا اختیار ایک فی صد کیا ایک فی ہزار بھی نہیں، اگر کسی کو شک ہے تو ذرا اپنا سانس روک کر دکھائے، بھوک پیاس روک لے، پیشاب یا پاخانہ روک لے، بیماری آئے تو ڈٹ جائے کہ میں بیمار نہیں ہوتا، بڑھاپے کو آنے سے اور بالوں کو سفید ہونے سے روک دے، حرکت قلب بند ہو جائے تو اسے چلا کر دکھائے، گردے فیل ہو جائیں تو چالو کرکے دکھائے، ایک ٹانگ اٹھا سکتا ہے دوسری بھی اٹھا کر دکھائے، موت کے فرشتے کے سامنے اکڑ جائے، غرض ہر عاقل و غیر عاقل اور ان کے سائے خوشی و ناخوشی سے اللہ ہی کے سامنے سجدہ ریز ہیں۔ پھر ایسے بے بس سے فریاد کرنا، کسی کو داتا، کسی کو دستگیر، کسی کو غریب نواز، کسی کو مشکل کشا کہنا کتنی بڑی حماقت ہے۔ یہاں سورۂ حج کی آیت (۱۸) کا ترجمہ و تفسیر بھی ملاحظہ فرما لیں۔ ¤ ➋ { وَ ظِلٰلُهُمْ بِالْغُدُوِّ وَ الْاٰصَالِ : } یعنی ان کے سایوں کا گھٹنا اور بڑھنا بھی اسی کے ارادہ و مشیت سے ہے۔ پہلے اور پچھلے پہر کا ذکر اس لیے کیا کہ ان وقتوں میں زمین پر ہر چیز کا سایہ نمایاں ہوتا ہے اور عبادت کے لحاظ سے یہ دونوں عمدہ وقت ہیں۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اور پرچھائیاں صبح و شام کے وقت زمین پر پسر (پھیل) جاتی ہیں، یہی ان کا سجدہ ہے۔‘‘ (موضح)"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت16) ➊ {قُلْ مَنْ رَّبُّ السَّمٰوٰتِ وَ الْاَرْضِ …:} یعنی اگر ایسا ہوتا کہ دنیا میں کچھ چیزیں تو اللہ نے پیدا کی ہوتیں اور کچھ دوسروں نے، یا بعض کی پرورش اور روزی کا سامان کرنے والا رب اللہ تعالیٰ ہوتا اور بعض کا کوئی دوسرا، یا کسی نفع نقصان کا مالک اللہ تعالیٰ ہوتا اور کسی کا مالک دوسرا، تب تو ان مشرکوں کے شرک کی کوئی بنیاد ہو سکتی تھی کہ یہ بھی خالق ہونے کی وجہ سے مستحق عبادت ہیں، مگر جب یہ خود مانتے ہیں کہ زمین و آسمان کی ہر چیز پیدا کرنے والا اللہ اور صرف اللہ ہے تو کوئی وجہ نہیں کہ اس کے ساتھ کسی دوسرے کو شریک قرار دیں۔ ¤ ➋ { قُلْ هَلْ يَسْتَوِي الْاَعْمٰى وَ الْبَصِيْرُ …:} یہ مشرک اور موحد کی مثال ہے، کیونکہ موحد دیکھنے والی آنکھ، سوچنے والا دل رکھتا ہے، جبکہ مشرک بصارت اور بصیرت دونوں سے خالی سر ا سر اندھا ہے۔ موحد نور توحید سے روشن ہوتا ہے، جبکہ مشرک ایک نہیں ہزاروں اندھیروں میں ہے۔ نور کو واحد اور ظلمات کو جمع لائے، کیونکہ ہدایت اور سیدھا راستہ ایک اور گمراہی کے راستے بے شمار ہیں۔ ¤ ➌ {وَ هُوَ الْوَاحِدُ الْقَهَّارُ :} وہی ہے جو ایک ہے، سب پر غالب ہے، کوئی اس کا مقابلہ نہیں کر سکتا۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت17) ➊ { اَنْزَلَ مِنَ السَّمَآءِ مَآءً …: ’’ اَوْدِيَةٌ‘‘} (نالے) وادی کی جمع ہے جو اصل میں پانی بہنے کی جگہ کو کہتے ہیں۔ دو پہاڑوں کے درمیان خالی جگہ کو بھی کہہ لیتے ہیں، کبھی راستے کے معنی میں بھی استعمال ہوتا ہے، کیونکہ پہاڑوں میں عموماً راستے پہاڑی نالوں کے کناروں کے ساتھ چلتے ہیں۔ {’’ زَبَدًا ‘‘} وہ کوڑا کرکٹ اور جھاگ جو پانی کی تیز رفتاری کے باعث اس کی سطح پر ابھر آتا ہے، یا ہانڈی کے اوپر ابھر آتا ہے۔{ ’’ رَابِيًا ‘‘ ’’ رَبَا يَرْبُوْ رَبْوًا ‘‘} (ن) سے اسم فاعل ہے، بمعنی بڑھنے والا، ابھرنے والا۔ {’’حِلْيَةٍ ‘‘} سونے چاندی وغیر کا زیور جس سے انسان زینت حاصل کرتا ہے۔ {’’ جُفَآءً ‘‘} نالہ یا ہانڈی جو خس و خاشاک یا جھاگ وغیرہ کناروں پر پھینک دیتے ہیں، اسے {’’ جُفَآءً ‘‘} کہتے ہیں۔ ¤ شوکانی رحمہ اللہ نے فرمایا کہ یہ دو مثالیں ہیں جو اللہ تعالیٰ نے حق و باطل کی بیان فرمائی ہیں۔ مطلب یہ ہے کہ ہو سکتا ہے کہ باطل بعض اوقات حق کے اوپر غالب آ جائے، مگر آخر کار اللہ تعالیٰ اسے مٹا دیتا ہے اور بے قدر و قیمت بنا دیتا ہے، حسن انجام حق اور اہل حق ہی کا ہوتا ہے۔ جیسا کہ جھاگ اور خس و خاشاک بے شک پانی کو ڈھانپ لیتے ہیں، مگر آخر کار پانی انھیں کناروں پر پھینک کر بے کار کر دیتا ہے اور خالص پانی سے لوگ فائدہ اٹھاتے ہیں۔ اسی طرح سونا چاندی اور دوسری دھاتوں کو پگھلایا جائے تو ان کا میل کچیل بھی اوپر آ جاتا ہے مگر آخر کار کچھ اتار کر پھینک دیا جاتا ہے اور کچھ جل جاتا ہے۔ غرض، سارا میل کچیل بے کار جاتا ہے اور لوگوں کے لیے نفع مند دھات خالص حالت میں باقی رہ جاتی ہے، جیسے سونا اور چاندی، جس سے وہ زیور بناتے ہیں، یا لوہا، تانبا اور پیتل وغیرہ جس سے برتن، اسلحہ اور دوسرا سامان بنتا ہے۔ استاذ محمد عبدہ رحمہ اللہ لکھتے ہیں کہ ان دونوں مثالوں میں حق (قرآن) کو پانی سے تشبیہ دی ہے اور نالوں سے مراد انسانوں کے دل ہیں جو اپنے اپنے ظرف و استعداد کے مطابق حق سے فیض حاصل کرتے ہیں، یا حق وہ زیور ہے جس سے نفوسِ انسانی آراستہ ہوتے ہیں اور لوگ معاش و معاد میں اس سے انواع و اقسام کے منافع اور فوائد حاصل کرتے ہیں۔ باطل کی مثال جھاگ کی سی ہے جو حق سے کشمکش کے موقع پر وقتی طور پر ابھر کر اوپر آ جاتا ہے مگر آخر کار مٹ جاتا ہے۔ ابوموسیٰ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [مَثَلُ مَا بَعَثَنِيَ اللّٰهُ مِنَ الْهُدَی وَالْعِلْمِ كَمَثَلِ الْغَيْثِ الْكَثِيْرِ أَصَابَ أَرْضًا، فَكَانَ مِنْهَا نَقِيَّةٌ، قَبِلَتِ الْمَاءَ، فَأَنْبَتَتِ الْكَلَأَ وَالْعُشْبَ الْكَثِيْرَ وَكَانَتْ مِنْهَا أَجَادِبُ أَمْسَكَتِ الْمَاءَ، فَنَفَعَ اللّٰهُ بِهَا النَّاسَ فَشَرِبُوْا وَسَقَوْا وَزَرَعُوْا، وَأَصَابَ مِنْهَا طَائِفَةً أُخْرَی، إِنَّمَا هِيَ قِيْعَانٌ لَا تُمْسِكُ مَاءً وَلَا تُنْبِتُ كَلَأً فَذٰلِكَ مَثَلُ مَنْ فَقُهَ فِيْ دِيْنِ اللّٰهِ وَنَفَعَهُ مَا بَعَثَنِيَ اللّٰهُ بِهِ فَعَلِمَ وَعَلَّمَ، وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذٰلِكَ رَأْسًا وَلَمْ يَقْبَلْ هُدَی اللّٰهِ الَّذِيْ أُرْسِلْتُ بِهِ ] [ بخاری، العلم، باب فضل من علم و علّم : ۷۹ ] ’’اللہ تعالیٰ نے مجھے جو علم اور ہدایت دے کر بھیجا ہے اس کی مثال بہت زیادہ بارش کی ہے جو ایک زمین پر برسی۔ اس زمین کا ایک حصہ بہت عمدہ (زرخیز) تھا، اس نے پانی قبول کیا (جذب کر لیا)، پھر بہت سی گھاس اور چارا اگایا اور اس کے کچھ حصے سخت زمین کے گڑھے تھے جنھوں نے پانی روک لیا تو اللہ نے اس کے ساتھ لوگوں کو نفع پہنچایا، چنانچہ انھوں نے پیا اور پلایا اور کھیتی باڑی کی اور اس کے بعض حصے چٹیل میدان تھے جو نہ پانی روکتے تھے اور نہ گھاس اگاتے تھے، تو یہ اس شخص کی مثال ہے جس نے اللہ کے دین کی سمجھ حاصل کی اور اسے اس (علم و ہدایت) نے نفع دیا جسے دے کر مجھے اللہ تعالیٰ نے بھیجا تھا اور اس شخص کی مثال جس نے اس کی طرف نہ سر اٹھایا اور نہ اللہ کی وہ ہدایت قبول کی جو دے کر مجھے بھیجا گیا (ان تینوں میں سے آخری مثال کافر کی ہے)۔‘‘ ¤ ➋ {كَذٰلِكَ يَضْرِبُ اللّٰهُ الْاَمْثَالَ :} یعنی بات سمجھانے کے لیے اللہ تعالیٰ اسی طرح مثالیں بیان کرتا ہے جیسے یہاں دو مثالیں بیان فرمائیں، ایک صحرائی اور پہاڑی لوگوں کو پیش آنے والی (نالوں کی) اور ایک شہری لوگوں کو پیش آنے والی (دھاتوں کی)۔ اسی طرح سورۂ بقرہ کے شروع میں منافقین کی دو مثالیں اور سورۂ نور (۳۹، ۴۰) میں کافروں کی دو مثالیں بیان فرمائیں۔ غرض قرآن و حدیث میں بہت سی مثالیں دے کر سمجھایا گیا ہے۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت18) ➊ { لِلَّذِيْنَ اسْتَجَابُوْا … : ’’ الْحُسْنٰى ‘‘ ’’اَلْاَحْسَنُ‘‘ } کی مؤنث ہے، بمعنی سب سے اچھی، جیسے{ ’’ حَسَنٌ‘‘ } اور {’’اَحْسَنُ‘‘ } ہے، اسی طرح {’’ حَسَنَةٌ ‘‘} اور {’’حُسْنٰي‘‘} ہے، اس کا موصوف محذوف ہے، یعنی رب کی بات قبول کرنے والوں کے لیے سب سے اچھی جزا، یعنی جنت ہے۔ {’’ وَ الَّذِيْنَ لَمْ يَسْتَجِيْبُوْا لَهٗ ‘‘} مبتدا ہے اور{ ’’ لَوْ اَنَّ لَهُمْ ‘‘} پورا جملہ شرطیہ اس کی خبر ہے، مطلب یہ ہے کہ جو لوگ حق سے عناد رکھتے ہیں قیامت کے دن ان پر جو مصیبت آئے گی وہ اس سے رہائی کے لیے اس قدر مال و دولت کی بھی پروا نہیں کریں گے اور فدیہ میں دینے کو تیار ہو جائیں گے۔ ¤ ➋ { اُولٰٓىِٕكَ لَهُمْ سُوْٓءُ الْحِسَابِ:} یہ اس کے مقابلے میں ہے جو فرمایا تھا کہ اپنے رب کی بات قبول کرنے والوں کے لیے بھلائی (بہترین بدلہ) ہے، یعنی یہ دعوت قبول نہ کرنے والوں کا بہت برا حساب ہو گا، انھیں کسی قسم کی معافی نہیں دی جائے گی اور ان کے ایک ایک گناہ پر بری طرح محاسبہ ہو گا۔ یہی مناقشہ فی الحساب ہے۔ ایک دفعہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ حُوْسِبَ عُذِّبَ، قَالَتْ عَائِشَةُ فَقُلْتُ أَوَ لَيْسَ يَقُوْلُ اللّٰهُ تَعَالٰی: «فَسَوْفَ يُحَاسَبُ حِسَابًا يَّسِيْرًا» [الإنشقاق : ۸] قَالَتْ، فَقَالَ إِنَّمَا ذٰلِكَ الْعَرْضُ، وَلَكِنْ مَنْ نُوْقِشَ الْحِسَابَ يَهْلِكْ ] [ بخاري، العلم، باب من سمع شیئًا فراجع … : ۱۰۳ ] ’’جس کا حساب کیا گیا اسے عذاب دیا جائے گا۔‘‘ عائشہ رضی اللہ عنھا فرماتی ہیں کہ اس پر میں نے عرض کیا : ’’اللہ تعالیٰ یہ نہیں فرماتا : «{ فَسَوْفَ يُحَاسَبُ حِسَابًا يَّسِيْرًا }» یعنی جسے دائیں ہاتھ میں اعمال نامہ دیا گیا اس کا حساب آسان ہو گا (مطلب یہ ہے کہ یہاں حساب کے باوجود عذاب نہیں ہو گا تو اس کا مطلب کیا ہے)؟‘‘ فرماتی ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ صرف پیش کیا جانا ہے اور لیکن جس سے مناقشہ ہوا (یعنی ایک ایک چیز کی پڑتال ہوئی) وہ ہلاک ہو جائے گا۔‘‘ ¤ ➌ { وَ بِئْسَ الْمِهَادُ :} مہد اور مہاد اصل میں بچے کے لیے تیار کر دہ جگہ کو کہتے ہیں، گود ہو یا بچھونا، اسی طرح ہر اچھی طرح آرام کے لیے بنائی ہوئی جگہ کو مہاد کہتے ہیں۔ آپ سوچیں کہ بچے کو آرام کے لیے آگ پر لٹا دیا جائے تو اس کا کیا حال ہو گا؟ اسی طرح اللہ کی دعوت قبول نہ کرنے والے کی آرام گاہ جہنم ہو گی۔ [ نَعُوْذُ بِاللّٰہِ مِنْھَا ]"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت19){ اَفَمَنْ يَّعْلَمُ اَنَّمَاۤ اُنْزِلَ …: } یہاں یہ کہنے کے بجائے کہ کیا وہ شخص جو جانتا ہے اس شخص کی طرح ہے جو نہیں جانتا، یوں فرمایا کہ اس شخص کی طرح ہے جو اندھا ہے؟ کیونکہ رسول اللہ صلی اللہ علیہ وسلم کے پاس اللہ کی طرف سے آنے والی نشانیاں آنکھوں سے نظر آ رہی ہیں، جو ان کا علم اور یقین نہیں رکھتا درحقیقت وہ اندھا ہے اور اس کا یہ اندھا پن قیامت کو اچھی طرح ظاہر ہو جائے گا۔ دیکھیے سورۂ طہ (۱۲۴ تا ۱۲۶) یہ مومن اور کافر کی مثال ہے۔{’’ اُولُوا ‘‘ ’’ذُوْ‘‘} کی جمع ہے، بمعنی والے۔ {’’ الْاَلْبَابِ ‘‘} { ’’لُبٌّ‘‘} کی جمع ہے، ہر چیز میں سے جو خالص ہو، خالص عقل جو ہر قسم کی آلائشوں سے پاک ہو۔ (مفردات) اس لیے ترجمہ ’’عقل والوں‘‘ کے بجائے ’’عقلوں والے‘‘ کیا ہے۔ مراد یہ ہے کہ نصیحت صرف خالص اور پاکیزہ عقل والے حاصل کرتے ہیں، الٹے دماغ والے نہیں۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت20){الَّذِيْنَ يُوْفُوْنَ بِعَهْدِ اللّٰهِ … :} ان آیات میں اللہ تعالیٰ نے عقلوں والوں کی چند صفات بیان فرمائیں۔ ان میں سب سے پہلی صفت اللہ تعالیٰ کے ساتھ کیے ہوئے عہد توحید کو پورا کرنا ہے، جیسا کہ سورۂ اعراف (۱۷۲) میں ہے۔{ ’’ وَ لَا يَنْقُضُوْنَ الْمِيْثَاقَ ‘‘} سے ہر اس عہد کو توڑنے سے اجتناب کرنا مراد ہے جسے پورا کرنے کا اللہ تعالیٰ نے حکم دیا ہے۔ پہلے خاص اپنے عہد کے بعد اب عام عہد کا ذکر فرمایا۔ ان منافقین کی طرح نہیں جن میں سے کوئی جب عہد کرتا ہے تو اس کی خلاف ورزی کرتا ہے، جب جھگڑتا ہے تو بدکلامی پر اتر آتا ہے، جب بات کرتا ہے تو جھوٹ بولتا ہے اور جب اسے کوئی امانت سونپی جاتی ہے تو خیانت کرتا ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت21) ➊ {وَ الَّذِيْنَ يَصِلُوْنَ مَاۤ اَمَرَ اللّٰهُ بِهٖۤ اَنْ يُّوْصَلَ :} یعنی صلہ رحمی کرتے ہیں، رشتوں کو نزدیک کے ہوں یا دور کے، ان کے مراتب کے مطابق ملاتے ہیں۔ یا مطلب یہ ہے کہ اللہ عزو جل، رسول کریم صلی اللہ علیہ وسلم ، عام مسلمانوں، ہمسایوں، رشتہ داروں، دوستوں، یتیموں، بیواؤں، الغرض ہر ایک کا حق پہچانتے اور ادا کرتے ہیں۔ ¤ ➋ { وَ يَخْشَوْنَ رَبَّهُمْ …:} اس کے عائد کردہ فرائض کو بجا لاتے اور اس کے منع کردہ گناہوں سے بچتے ہیں۔ راغب نے کہا : ’’خشیت ایسا خوف ہے جس کے ساتھ تعظیم ملی ہوئی ہو، اکثر اس کا باعث علم ہوتا ہے۔‘‘ جیسے فرمایا : «{ اِنَّمَا يَخْشَى اللّٰهَ مِنْ عِبَادِهِ الْعُلَمٰٓؤُا }» [ فاطر : ۲۸ ] ’’اللہ سے تو اس کے بندوں میں سے صرف جاننے والے ہی ڈرتے ہیں۔‘‘ خوف سے مراد کوئی بھی ڈر ہے، بعض نے کہا، دونوں (خشیت اور خوف) ہم معنی ہیں، فرق اغلبی ہے، کلی نہیں۔ (آلوسی) ¤ ➌ { وَ يَخَافُوْنَ سُوْٓءَ الْحِسَابِ :} لہٰذا وہ اس وقت سے پہلے ہی اپنا محاسبہ کرتے رہتے ہیں۔ {’’ سُوْٓءَ الْحِسَابِ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ رعد کی آیت (۱۸) کی تفسیر۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت22) ➊ {وَ الَّذِيْنَ صَبَرُوا ابْتِغَآءَ وَجْهِ رَبِّهِمْ :} یعنی ہر اس مقام پر جہاں صبر قابل تعریف ہے وہ محض اللہ کے چہرے کی خاطر صبر کرتے ہیں، تاکہ وہ راضی ہو جائے۔ نہ ریا (دکھاوے) کے لیے، نہ سُمعہ (شہرت) کے لیے کہ لوگ کہیں واہ کیا صابر شخص ہے۔ صبر کا معنی روکنا، باندھنا ہے۔ اپنے آپ کو اللہ کے احکام کی پابندی پر قائم رکھنا{ ’’صَبْرٌ عَلَي الطَّاعَةِ‘‘} ہے، اس کی نافرمانی سے رکنا {’’ صَبْرٌ عَنِ الْمَعْصِيَةِ ‘‘} ہے اور اللہ تعالیٰ کی طرف سے آنے والی مصیبت، مثلاً بیماری، فاقہ، خوف یا اموات وغیرہ پر اپنے آپ کو جزع فزع سے روکنا اور اسے اللہ تعالیٰ کی حکمت اور اس کی تقدیر سمجھ کر کسی شکوہ و شکایت کے بغیر برداشت کرنا {’’صَبْرٌ عَلَي الْمُصِيْبَةِ‘‘} ہے۔ اللہ تعالیٰ کی خاطر صبر کی یہ تمام صورتیں {’’ اُولُوا الْاَلْبَابِ ‘‘ } کی صفت ہیں۔ ¤ ➋ {وَ اَقَامُوا الصَّلٰوةَ :} اس کی تفسیر کے لیے سورۂ بقرہ کی آیت (۳) ملاحظہ فرمائیں۔ ¤ ➌ { وَ اَنْفَقُوْا مِمَّا رَزَقْنٰهُمْ سِرًّا وَّ عَلَانِيَةً:} فرض زکوٰۃ علانیہ دینا افضل ہے، تاکہ کفر کی تہمت سے بچے، نفل صدقہ دوسروں کو ترغیب دلانے کے لیے علانیہ ہو اور ریا سے پاک ہو تو بہت ہی اچھا ہے، مگر علانیہ صدقے میں ریا کا امکان ہے، اس لیے پوشیدہ صدقے کا جواب ہی نہیں ہے۔ دیکھیے سورۂ بقرہ (۲۷۱) قیامت کے دن اللہ تعالیٰ کا سایہ پانے والوں میں سے ایک وہ بھی ہے جو دائیں ہاتھ سے صدقہ کرے تو بائیں کو خبر بھی نہ ہو۔ [ بخاري، الأذان، باب من جلس فی المسجد… : ۶۶۰ ] ¤ ➍ {وَ يَدْرَءُوْنَ بِالْحَسَنَةِ السَّيِّئَةَ : ’’دَرَءَ يَدْرَءُ دَرْءً ‘‘} (ف) ہٹانا، دفع کرنا، دور کرنا، یعنی {’’ اُولُوا الْاَلْبَابِ ‘‘} کی ایک صفت یہ ہے کہ وہ برائی کو نیکی کے ساتھ ہٹاتے ہیں، یعنی برائی کا جواب بھلائی سے دیتے ہیں، جیسا کہ فرمایا : «{ وَ لَا تَسْتَوِي الْحَسَنَةُ وَ لَا السَّيِّئَةُاِدْفَعْ بِالَّتِيْ هِيَ اَحْسَنُ فَاِذَا الَّذِيْ بَيْنَكَ وَ بَيْنَهٗ عَدَاوَةٌ كَاَنَّهٗ وَلِيٌّ حَمِيْمٌ (34) وَ مَا يُلَقّٰىهَاۤ اِلَّا الَّذِيْنَ صَبَرُوْا وَ مَا يُلَقّٰىهَاۤ اِلَّا ذُوْ حَظٍّ عَظِيْمٍ }» [ حٰمٓ السجدۃ : ۳۴، ۳۵ ] ’’اور نہ نیکی برابر ہوتی ہے اور نہ برائی۔ (برائی کو) اس (طریقے) سے ہٹا جو سب سے اچھا ہے، تو اچانک وہ شخص کہ تیرے درمیان اور اس کے درمیان دشمنی ہے، ایسا ہو گا جیسے وہ دلی دوست ہے۔ اور یہ چیز نہیں دی جاتی مگر انھی کو جو صبر کریں اور یہ نہیں دی جاتی مگر اسی کو جو بہت بڑے نصیب والا ہے۔‘‘ یہ طریقہ ذاتی عداوتوں اور زیادتیوں کے جواب کا ہے کہ زیادتی کے جواب میں صبر کرے اور معاف کر دے۔ رہا اللہ کے دین پر زیادتی اور اللہ کے احکام کے مقابلے میں سرکشی اور عناد کا جواب بہترین طریقے سے دینا تو اس کی صورت دوسری ہے۔ وہاں برائی کو نیکی کے ساتھ ہٹانے کا مطلب یہ نہیں کہ کوئی کافر یا اللہ کا باغی دین پر زیادتی کر رہا ہو تو آپ اسے برداشت کریں اور صبر کریں، بلکہ اس برائی کو بہترین طریقے سے ہٹانا نہ اسے آزاد چھوڑنا ہے نہ معاف کرنا، بلکہ یہاں اسے ہٹانے کا بہترین طریقہ وہی ہے جو رسول اللہ صلی اللہ علیہ وسلم نے اختیار کیا اور اس کا حکم دیا کہ جو شخص تم میں سے کوئی منکر (برائی) دیکھے اسے ہاتھ سے روک دے، اگر اس کام کی قوت نہیں تو زبان سے روکے اور اگر اتنی بھی قوت نہیں تو (کم از کم) اسے دل میں برا سمجھے۔ [ مسلم، الإیمان، باب بیان کون النہی … : ۴۹ ] یہاں سب سے اچھا طریقہ ({بِالَّتِيْ هِيَ اَحْسَنُ}) جہاد فی سبیل اللہ ہے اور اس کا نتیجہ بھی یہی ہے کہ یک لخت ہی جانی دشمن دلی دوست بن جاتے ہیں۔ دیکھیے ثمامہ بن اثال، ہندہ، عکرمہ بن ابی جہل، خالد بن ولید رضی اللہ عنھم اور عرب کے وہ سردار جو کسی صورت ایمان قبول کرنے والے نظر نہ آتے تھے، جہاد کی نیکی کی برکت سے رسول اللہ صلی اللہ علیہ وسلم کے جاں نثار دوست بن گئے۔ ’’برائی کو نیکی کے ساتھ ہٹاتے ہیں‘‘ کا ایک مطلب یہ بھی ہے کہ وہ نیک عمل کرکے برے عمل کو مٹا دیتے ہیں، جیسے فرمایا : «{ اِنَّ الْحَسَنٰتِ يُذْهِبْنَ السَّيِّاٰتِ }» [ ھود : ۱۱۴ ] ’’بے شک نیکیاں برائیوں کو لے جاتی ہیں۔‘‘ اور ابوذر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا عَمِلْتَ سَيِّئَةً فَأَتْبِعْهَا حَسَنَةً تَمْحُهَا] [أحمد : 169/5، ح : ۲۱۵۴۳، صحیح ] ’’جب تم کوئی برائی کرو تو اس کے بعد کوئی نیکی کرو، وہ اسے مٹا دے گی۔‘‘ اور فرمایا : [ وَ إِذَا عَمِلْتَ سَيِّئَةً فَاعْمَلْ بِجَنْبِهَا حَسَنَةً السِّرُّ بِالسِّرِّ وَالْعَلاَنِيَةُ بِالْعَلاَنِيَةِ] [سلسلۃ الأحادیث الصحیحۃ : 462/3، ح : ۱۴۷۵ ] ’’جب تم کوئی برائی کرو تو اس کے ساتھ ہی نیکی کر لو، وہ اسے مٹا دے گی، پوشیدہ برائی کو پوشیدہ نیکی کے ساتھ اور علانیہ برائی کو علانیہ نیکی کے ساتھ مٹاؤ۔‘‘ ¤ ➎ { اُولٰٓىِٕكَ لَهُمْ عُقْبَى الدَّارِ : ’’ عُقْبَى ‘‘ ’’ عَاقِبَةٌ ‘‘} کی طرح مصدر ہے، وہ چیز جو کسی چیز کے پیچھے آئے، عام طور پر یہ لفظ اچھے انجام کے معنی میں آتا ہے۔{ ’’ الدَّارِ ‘‘} میں الف لام عہد کا ہے، یہ گھر یعنی دنیا، یعنی ان صفات والوں کے لیے دنیا کے گھر کے بعد کا انجام بہت اچھا ہے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت23) ➊ { جَنّٰتُ عَدْنٍ يَّدْخُلُوْنَهَا۠ …: } یہ {’’ عُقْبَى الدَّارِ ‘‘} سے بدل الکل ہے، یعنی وہ اچھا انجام ہمیشہ رہنے کے باغات ہیں جن میں وہ داخل ہوں گے اور جنت میں داخل ہونے کے لائق ان کے باپ دادا، بیویاں اور اولادیں بھی ان کے ساتھ جنت عدن میں داخل ہوں گی۔ بعض مفسرین کہتے ہیں کہ {’’عَدْنٍ‘‘} جنت میں ایک مقام ہے، اس صورت میں ترجمہ ہو گا ’’عدن کے باغات‘‘ اور اس صورت میں یہ {’’ عُقْبَى الدَّارِ ‘‘} سے بدل البعض ہو گا۔ امام ابن کثیر رحمہ اللہ نے اس آیت پر فرمایا، یعنی انھیں اور ان کے پیاروں کو جنت میں اکٹھا کر دیا جائے گا، خواہ باپ ہوں یا گھر والے یا اولاد جو مومن ہونے کی وجہ سے جنت میں داخلے کے لائق ہوں گے، تاکہ ان کی آنکھیں ان کے ساتھ ٹھنڈی ہوں، یہاں تک کہ نیچے درجے والے کو اونچے درجے والے کی طرف بلند کر دیا جائے گا، بغیر اس کے کہ اونچے درجے والے کا درجہ کم کیا جائے، محض اللہ تعالیٰ کے امتنان اور احسان کی وجہ سے، جیسا کہ فرمایا : «{ وَ الَّذِيْنَ اٰمَنُوْا وَ اتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِاِيْمَانٍ اَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَ مَاۤ اَلَتْنٰهُمْ مِّنْ عَمَلِهِمْ مِّنْ شَيْءٍ }» [ الطور : ۲۱ ] ’’اور جو لوگ ایمان لائے اور ان کی اولاد کسی بھی درجے کے ایمان کے ساتھ ان کے پیچھے چلی، ہم ان کی اولاد کو ان کے ساتھ ملا دیں گے اور ان سے ان کے عمل میں کچھ کمی نہ کریں گے۔‘‘ ¤ ➋ {وَ الْمَلٰٓىِٕكَةُ يَدْخُلُوْنَ عَلَيْهِمْ …:} جب وہ جنت میں داخل ہوں گے تو فرشتے ہر دروازے سے ان کے پاس آکر انھیں مبارک باد اور خوش خبریاں دیں گے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت24) ➊ { سَلٰمٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ: ’’ سَلٰمٌ ‘‘} کا مطلب ہے کہ اب تم ہر مصیبت، رنج و غم اور پریشانی سے محفوظ ہو گئے۔ حافظ ابن کثیر رحمہ اللہ نے اس کی مناسبت سے عبد اللہ بن عمرو رضی اللہ عنھما کی حدیث نقل فرمائی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ هَلْ تَدْرُوْنَ أَوَّلَ مَنْ يَدْخُلُ الْجَنَّةَ مِنْ خَلْقِ اللّٰهِ ؟ قَالُوْا اَللّٰهُ وَرَسُوْلُهُ أَعْلَمُ، قَالَ أَوَّلُ مَنْ يَّدْخُلُ الْجَنَّةَ مِنْ خَلْقِ اللّٰهِ الْفُقَرَاءُ الْمُهَاجِرُوْنَ الَّذِيْنَ تُسَدُّ بِهِمُ الثُّغُوْرُ وَيُتَّقٰی بِهِمُ الْمَكَارِهُ، وَ يَمُوْتُ أَحَدُهُمْ وَ حَاجَتُهُ فِيْ صَدْرِهِ، لاَ يَسْتَطِيْعُ لَهَا قَضَاءً، فَيَقُوْلُ اللّٰهُ عَزَّوَجَلَّ لِمَنْ يَشَاءُ مِنْ مَلاَئِكَتِهِ إئْتُوْهُمْ فَحَيُّوْهُمْ فَتَقُوْلُ الْمَلاَئِكَةُ نَحْنُ سُكَّانُ سَمَائِكَ وَ خَيْرَتُكَ مِنْ خَلْقِكَ، أَفَتَأْمُرُنَا أَنْ نَّأْتِيَ هٰؤُلاَءِ فَنُسَلِّمَ عَلَيْهِمْ؟ قَالَ إِنَّهُمْ كَانُوْا عِبَادًا يَعْبُدُوْنِيْ، لاَ يُشْرِكُوْنَ بِيْ شَيْئًا، وَ تُسَدُّ بِهِمُ الثُّغُوْرُ وَ يُتَّقَی بِهِمُ الْمَكَارِهُ، وَ يَمُوْتُ أَحَدُهُمْ وَ حَاجَتُهُ فِيْ صَدْرِهِ، لاَ يَسْتَطِيْعُ لَهَا قَضَاءً، قَالَ فَتَأْتِيْهِمُ الْمَلاَئِكَةُ عِنْدَ ذٰلِكَ، فَيَدْخُلُوْنَ عَلَيْهِمْ مِنْ كُلِّ بَابٍ : «سَلٰمٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ » ] [ مسند أحمد : 168/2، ح : ۶۵۷۸۔ ابن حبان : ۷۴۲۱۔ قال شعیب الأرنؤط و إسنادہ جید ] ’’کیا تم جانتے ہو کہ اللہ کی مخلوق میں سے جنت میں سب سے پہلے کون لوگ جائیں گے؟‘‘ لوگوں نے کہا : ’’اللہ اور اس کا رسول بہتر جانتے ہیں۔‘‘ فرمایا : ’’اللہ کی مخلوق میں سے جنت میں سب سے پہلے فقراء اور مہاجرین داخل ہوں گے، جن کے ذریعے سے سرحدیں محفوظ کی جاتی تھیں اور ناپسندیدہ حالات سے بچا جاتا تھا اور ان میں سے کوئی فوت ہوتا تو اس کی دلی خواہش اس کے سینے ہی میں باقی ہوتی تھی، وہ اسے پورا نہیں کر سکتا تھا تو اللہ تعالیٰ اپنے فرشتوں میں سے جنھیں چاہے گا حکم دے گا کہ ان کے پاس جاؤ اور انھیں سلام کرو۔ فرشتے کہیں گے : ’’ہم تیرے آسمان کے رہنے والے اور تیری مخلوق میں سے تیرے چنے ہوئے ہیں، کیا تو ہمیں حکم دیتا ہے کہ ہم ان کے پاس جائیں اور انھیں سلام پیش کریں۔‘‘ اللہ تعالیٰ فرمائے گا : ’’یہ میرے بندے تھے، میری بندگی کرتے تھے، میرے ساتھ کسی چیز کو شریک نہیں کرتے تھے، ان کے ساتھ سرحدیں محفوظ رکھی جاتی تھیں اور ان کے ذریعے سے ناپسندیدہ حالات سے بچا جاتا تھا، ان میں سے کوئی فوت ہوتا تو اس حال میں کہ اس کی دلی خواہش اس کے سینے ہی میں ہوتی، وہ اسے پورا نہیں کر سکتا تھا۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’چنانچہ فرشتے اس وقت ان کے پاس آئیں گے اور ہر دروازے سے ان کے پاس داخل ہوں گے (اور کہیں گے) : ’’سلام ہو تم پر اس کے بدلے جو تم نے صبر کیا، سو اچھا ہے اس گھر کا انجام۔‘‘ ¤ ➋ { بِمَا صَبَرْتُمْ …:} معلوم ہوا ایمان قبول کرنے کے بعد ہر حکم بجا لانے پر ہمیشگی، ہر برائی سے اجتناب، اللہ کی ہر تقدیر پر قناعت کرتے ہوئے ہر مصیبت و راحت میں اللہ تعالیٰ پر خوش رہنا، غرض دین کی ہر بات پر استقامت کی بنیاد صبر ہی ہے اور اس کی جزا کا بھی کوئی حساب نہیں، فرمایا : «{ اِنَّمَا يُوَفَّى الصّٰبِرُوْنَ اَجْرَهُمْ بِغَيْرِ حِسَابٍ }» [ الزمر : ۱۰ ] ’’صرف صبر کرنے والوں ہی کو ان کا اجر بغیر حساب دیا جائے گا۔‘‘"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت25){وَ الَّذِيْنَ يَنْقُضُوْنَ …:} قرآن مجید نے اپنے اسلوب کے مطابق کہ وہ ایمان کے ساتھ کفر، نیکی کے ساتھ بدی، جنت کے ساتھ جہنم کا ذکر کرتا ہے، عہد وفا کرنے والوں کی صفات اور ان کے اچھے انجام کے بعد عہد توڑنے والوں کی صفات بد اور ان کا برا انجام ذکر فرمایا ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت26) ➊ { اَللّٰهُ يَبْسُطُ الرِّزْقَ …:} بہت سے لوگوں کی گمراہی کا سبب یہ شبہ بن جاتا ہے کہ اللہ کے نافرمان دنیا میں خوش حال کیوں ہیں ؟ اس کا جواب دیا، یعنی دنیا میں رزق کی فراوانی یا تنگی کوئی معیار نہیں ہے، جس کے لحاظ سے کسی شخص کے اللہ تعالیٰ کے ہاں پسندیدہ یا غیر پسندیدہ ہونے کا فیصلہ کیا جائے، بسا اوقات وہ کافر کو خوب سامانِ عیش دیتا ہے اور مومن پر تنگ دستی وارد کرتا ہے، تاکہ دونوں کی آزمائش کی جائے، مومن اپنے صبر و شکر کی وجہ سے آخرت میں بلند درجات پاتا ہے اور کافر ناکام رہتا ہے، اس لیے آخرت میں اس کا ٹھکانا برا ہوتا ہے، لہٰذا گمراہ لوگوں کی بداعمالیوں کے باوجود ان کے عیش و عشرت سے کسی کو دھوکا نہیں ہونا چاہیے، بلکہ یہ محض مہلت ہے جو کافر کو دنیا میں دی جاتی ہے۔ (روح المعانی) ¤ ➋ { وَ فَرِحُوْا بِالْحَيٰوةِ الدُّنْيَا … : ’’ مَتَاعٌ ‘‘} کی تنوین تقلیل وتحقیر کے لیے ہے، یعنی معمولی، تھوڑا سا بے قدر و قیمت سامان، یعنی کفار دنیا کی زندگی کی آسائشوں پر پھول رہے ہیں، حالانکہ یہ آخرت کے مقابلے میں محض معمولی اور بے حقیقت تھوڑی دیر کا سامان ہے۔ مستورد بن شداد رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَاللّٰهِ! مَا الدُّنْيَا فِيْ الْآخِرَةِ إِلَّا مِثْلُ مَا يَجْعَلُ أَحَدُكُمْ إِصْبَعَهُ هٰذِهِ ــ وَأَشَارَ يَحْيَی بِالسَّبَّابَةِ ــ فِي الْيَمِّ، فَلْيَنْظُرْ أَحَدُكُمْ بِمَ تَرْجِعُ ] [مسلم، الجنۃ وصفۃ نعیمھا، باب فناء الدنیا… : ۲۸۵۸ ] ’’اللہ کی قسم! دنیا آخرت کے مقابلے میں اس مثال کے سوا کچھ نہیں کہ تم میں سے کوئی شخص اپنی یہ انگلی۔‘‘ اور راوی یحییٰ نے شہادت کی انگلی کے ساتھ اشارہ کیا ’’سمندر میں ڈالے، پھر دیکھے کہ وہ کیا چیز لے کر واپس آتی ہے۔‘‘ عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں : [ نَامَ رَسُوْلُ اللّٰهِ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ عَلٰی حَصِيْرٍ فَقَامَ وَقَدْ أَثَّرَ فِيْ جَنْبِهِ، فَقُلْنَا يَا رَسُوْلَ اللّٰهِ! لَوِ اتَّخَذْنَا لَكَ وِطَاءً، فَقَالَ مَا لِيْ وَ لِلدُّنْيَا، مَا أَنَا فِي الدُّنْيَا إِلاَّ كَرَاكِبٍ اسْتَظَلَّ تَحْتَ شَجَرَةٍ، ثُمَّ رَاحَ وَتَرَكَهَا ] [ ترمذی، الزھد، باب حدیث ما الدنیا إلا کراکب استظل : ۲۳۷۷ ] ’’نبی صلی اللہ علیہ وسلم ایک چٹائی پر سوئے، اٹھے تو چٹائی نے آپ کے پہلو پر اپنے نشان لگا دیے تھے۔ ہم نے عرض کی : ’’یا رسول اللہ! اگر ہم آپ کے لیے نرم بستر بنا دیں تو؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’میرا اور دنیا کا کیا تعلق! میں تو دنیا میں محض اس سوار کی طرح ہوں جس نے ایک درخت کے سائے میں آرام کیا، پھر اسے چھوڑ کر آگے چل دیا۔‘‘"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت27) ➊ {وَ يَقُوْلُ الَّذِيْنَ كَفَرُوْا … :} ایسی نشانی کیوں نہیں اتری جسے دیکھ کر ہم اسے اللہ کا رسول مان لینے پر مجبور ہو جاتے، مثلاً دیکھیے سورۂ بنی اسرائیل (۹۰ تا ۹۳) میں ان کی فرمائشیں۔ ¤ ➋ { قُلْ اِنَّ اللّٰهَ يُضِلُّ مَنْ يَّشَآءُ …:} یعنی نشانی کے اترنے سے کچھ نہیں ہوتا، کیونکہ تمھارے اب تک ایمان نہ لانے کی وجہ یہ نہیں ہے کہ تم نے کوئی نشانی نہیں دیکھی، نشانیاں تو بے حد و حساب موجود ہیں، مگر پہلی بات تو یہ ہے کہ اللہ تعالیٰ کمال حکمت والا ہے اور اپنی رحمت کا خود مالک ہے، جسے چاہے اپنی حکمت کی بنا پر اپنی رحمت و ہدایت سے محروم، یعنی گمراہ رکھے اور جسے چاہے اپنی رحمت و ہدایت سے نواز دے۔ دوسری بات یہ کہ تم اللہ کے راستے کی طرف آتے ہی نہیں، اگر تمھاری سیدھے راستے کی طرف آنے کی خواہش اور جستجو ہوتی تو تم صرف قرآن کی نشانی کو دیکھ کر راہ حق کو پا لیتے، کیونکہ یہ کتاب واضح دلائل سے لبریز ہے۔ اب اگر تم اپنی خواہشات اور شیطان ہی کے پیچھے چلتے جاؤ اور اللہ تعالیٰ کے راستے کی طرف لوٹ کر آنے کی رغبت ہی نہ رکھو تو تمھیں اللہ کے راستے پر چلنا کیسے نصیب ہو، وہ تو اپنی طرف آنے کے راستے پر چلنے کی توفیق انھی کو دیتا ہے جو اس کی طرف رجوع رکھیں اور لوٹ کر آنا چاہیں۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت28){اَلَّذِيْنَ اٰمَنُوْا وَ تَطْمَىِٕنُّ قُلُوْبُهُمْ … :} یہ اللہ کی طرف رجوع کرنے والوں کی صفت ہے، ذکر کا معنی نصیحت بھی ہے اور یاد کرنا بھی۔ اس لحاظ سے آیت کے دو معنی ہو سکتے ہیں، ایک یہ کہ اللہ تعالیٰ انھی کو اپنی طرف ہدایت دیتا ہے جو ایمان لاتے ہیں اور ان کے دل کو وحی الٰہی سے ملنے والی نصیحت سے پوری تسلی ہو جاتی ہے، اس کے سوا انھیں کہیں سے تسلی نہیں ہوتی، کوئی دوسرا اپنے خیال میں کیسی اچھی بات کیوں نہ کہے انھیں اس پر یقین نہیں ہوتا، کیونکہ وہ بھی ان جیسا انسان ہے، اس کی بات درست بھی ہو سکتی ہے اور غلط بھی، اس لیے اس پر انھیں اطمینان نہیں ہوتا، صرف اللہ کی بات ایسی ہے جو غلط نہیں ہوتی، اس لیے اسی پر ان کے دل کو یقین و اطمینان ہوتا ہے۔ {’’ذكر الله‘‘} یعنی اللہ کی نصیحت صرف رسول پر نازل ہوئی، قرآن کی صورت میں بھی اور حدیث کی صورت میں بھی، پھر اس کی حفاظت کا ذمہ بھی اللہ تعالیٰ نے خود اٹھایا، فرمایا : «{اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَ اِنَّا لَهٗ لَحٰفِظُوْنَ }» [ الحجر : ۹ ] ’’بے شک ہم نے ہی یہ نصیحت نازل کی ہے اور بے شک ہم اس کی ضرور حفاظت کرنے والے ہیں۔‘‘ کافر اس نعمت سے محروم ہیں۔ خلاصہ یہ کہ ہدایت کی نعمت صرف اسی کو ملتی ہے جو اس کے لیے اللہ کی طرف رجوع کرے، ایمان لائے اور وحی الٰہی سے اسے پوری تسلی حاصل ہو جائے۔ کوئی شخص اگر ایمان کا دعویٰ کرے مگر اسے قرآن و حدیث کے بجائے تسلی کسی اور کی بات سے ہوتی ہو تو وہ بدنصیب بھی ہدایت الٰہی سے محروم ہے۔ ¤ {’’ذكر الله‘‘} کا دوسرا معنی یاد الٰہی ہے۔ مولانا محمد عبدہ رحمہ اللہ لکھتے ہیں : ’’یہ ایمان کے خالص اور پختہ ہونے کی علامت ہے کہ ذہن خواہ کتنی ہی فکروں میں الجھا ہوا ہو لیکن جوں ہی نماز شروع کرے یا اللہ کو یاد کرے تو تمام فکر بھول جائیں اور انسان حقیقی اطمینان قلب سے بہرہ ور ہو جائے۔‘‘ یہاں اگرچہ دونوں معنوں کی گنجائش ہے مگر پہلا معنی زیادہ مناسب ہے، کیونکہ کافر نشانی مانگ رہے ہیں جبکہ سب سے بڑی نشانی قرآن موجود ہے۔ اہل ایمان کو اسی سے اطمینان ہو جاتا ہے، جبکہ کافر بدنصیب شک ہی میں مارا جاتا ہے اور مزید معجزے مانگتا رہتا ہے ۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت29) {طُوْبٰى لَهُمْ وَ حُسْنُ مَاٰبٍ: ’’ طُوْبٰى ‘‘} اصل میں{ ’’طَابَ يَطِيْبُ‘‘} (اچھا اور عمدہ ہونا) سے {’’طُيْبٰي‘‘} تھا، مصدر بروزن {’’بُشْرٰي‘‘ } بمعنی خوشی، مبارک باد۔ {’’ مَاٰبٍ ‘‘ ’’اٰبَ يَؤُوْبُ أَوْبًا‘‘} کا معنی ہے لوٹنا اور {’’ مَاٰبٍ ‘‘} کا معنی لوٹ کر جانے کی جگہ، ٹھکانا، یعنی ایمان اور عمل صالح کی برکت سے عمدہ ترین زندگی حاصل ہوتی ہے اور آخری ٹھکانا بھی بہترین ملے گا، جیسا کہ فرمایا : «{مَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُنْثٰى وَ هُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهٗ حَيٰوةً طَيِّبَةً وَ لَنَجْزِيَنَّهُمْ اَجْرَهُمْ بِاَحْسَنِ مَا كَانُوْا يَعْمَلُوْنَ}» [ النحل : ۹۷ ] ’’جو بھی نیک عمل کرے، مرد ہو یا عورت اور وہ مومن ہو تو یقینا ہم اسے ضرور زندگی بخشیں گے، پاکیزہ زندگی اور یقینا ہم انھیں ان کا اجر ضرور بدلے میں دیں گے، ان بہترین اعمال کے مطابق جو وہ کیا کرتے تھے۔‘‘ مسند احمد کی ایک حدیث میں جو عتبہ بن عبد السلمی سے مروی ہے، رسول اللہ صلی اللہ علیہ وسلم نے جنت کے ایک درخت کا نام بھی طوبیٰ بتایا ہے۔ [ مسند أحمد : 183/4، ح : ۱۷۶۶۰، وقال شعیب الأرنؤوط إسنادہ قابل للتحسین ]"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت30) ➊ {كَذٰلِكَ اَرْسَلْنٰكَ فِيْۤ اُمَّةٍ:} امت دو قسم کی ہوتی ہے، ایک وہ لوگ جن کی طرف رسول بھیجا جائے، وہ مسلمان ہوں یا کافر، جیسے قوم ثمود کا ہر مسلم و کافر صالح علیہ السلام کی امت تھا اور عاد کا ہر فرد ہود علیہ السلام کی امت میں سے تھا۔ رسول اللہ صلی اللہ علیہ وسلم کی آمد کے بعد قیامت تک ہر مسلم و کافر، یہودی، نصرانی، ہندو اور دہریہ، غرض ہر شخص آپ صلی اللہ علیہ وسلم کی امت میں سے ہے، اسے امتِ دعوت کہا جاتا ہے، پھر جو لوگ رسول کی دعوت کو قبول کر لیں وہ امتِ اجابت کہلاتے ہیں، اس آیت میں امتِ دعوت مراد ہے۔ ¤ ➋ { قَدْ خَلَتْ مِنْ قَبْلِهَاۤ اُمَمٌ :} یعنی نہ آپ پہلے رسول ہیں نہ آپ کی امتِ دعوت کوئی پہلی امت ہے۔ اس سے مقصود آپ کی امت کو پہلی جھٹلانے والی امتوں کے انجام بد سے ڈرانا ہے۔ ¤ ➌ { لِتَتْلُوَاۡ عَلَيْهِمُ الَّذِيْۤ اَوْحَيْنَاۤ اِلَيْكَ :} یعنی آپ کو بھیجنے کا مقصد یہ ہے کہ آپ انھیں وہ آیات و احکام پڑھ کر سنائیں جو ہم نے آپ کی طرف وحی کیے۔ {’’ عَلَيْهِمُ ‘‘ } سے اولین مراد قریش مکہ ہیں اور پھر بعد میں قیامت تک آنے والے تمام لوگ بھی، جیسا کہ فرمایا : «{ هُوَ الَّذِيْ بَعَثَ فِي الْاُمِّيّٖنَ رَسُوْلًا مِّنْهُمْ يَتْلُوْا عَلَيْهِمْ اٰيٰتِهٖ وَ يُزَكِّيْهِمْ وَ يُعَلِّمُهُمُ الْكِتٰبَ وَ الْحِكْمَةَ وَ اِنْ كَانُوْا مِنْ قَبْلُ لَفِيْ ضَلٰلٍ مُّبِيْنٍ (2) وَ اٰخَرِيْنَ مِنْهُمْ لَمَّا يَلْحَقُوْا بِهِمْ وَ هُوَ الْعَزِيْزُ الْحَكِيْمُ}» [ الجمعۃ : ۲، ۳ ] ’’وہی ہے جس نے ان پڑھوں میں ایک رسول انھی میں سے بھیجا، جو ان کے سامنے اس کی آیات پڑھتا ہے اور انھیں پاک کرتا ہے اور انھیں کتاب اور حکمت سکھاتا ہے، حالانکہ بلاشبہ وہ اس سے پہلے یقینا کھلی گمراہی میں تھے۔ اور ان میں سے کچھ اور لوگوں میں بھی (آپ کو بھیجا) جو ابھی تک ان سے نہیں ملے اور وہی سب پر غالب، کمال حکمت والا ہے۔‘‘ ’’جو ابھی تک ان سے نہیں ملے‘‘ سے مراد قیامت تک کے لوگ ہیں۔ ¤ ➍ { وَ هُمْ يَكْفُرُوْنَ بِالرَّحْمٰنِ:} یعنی اللہ نے اپنی رحمت سے ان لوگوں پر کرم فرمایا کہ آپ کو ان کی طرف رسول بنا کر بھیجا، مگر ان کی ناشکری کا حال یہ ہے کہ اس کا حق پہچاننے سے منکر ہو گئے ہیں۔ کفار مکہ اللہ کے خالق ہونے کا تو اقرار کرتے تھے، مگر اس کے ’’رحمان‘‘ ہونے کے منکر تھے، بلکہ جب اللہ تعالیٰ کے رحمان ہونے اور اسے اس نام سے پکارنے کی دعوت دی جاتی تو اس سے چڑتے اور کہتے : «{ وَ مَا الرَّحْمٰنُ اَنَسْجُدُ لِمَا تَاْمُرُنَا وَ زَادَهُمْ نُفُوْرًا }» [ الفرقان : ۶۰ ] ’’رحمان کیا چیز ہے؟ کیا ہم اسے سجدہ کریں جس کے لیے تو ہمیں حکم دیتا ہے اور یہ بات انھیں بدکنے میں بڑھا دیتی ہے۔‘‘ نیز حدیبیہ کے صلح نامہ پر جب نبی صلی اللہ علیہ وسلم نے {’’بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ‘‘} لکھوانا چاہا تو کفار کے نمائندے سہیل بن عمرو نے کہا : ’’اللہ کی قسم! میں رحمان کو نہیں جانتا کہ وہ کون ہے، آپ {’’بِاسْمِكَ اللّٰهُمَّ‘‘} لکھوائیے۔‘‘ [ بخاری، الشروط، باب الشروط في الجہاد … : ۲۷۳۱، ۲۷۳۲ ] {’’ الرَّحْمٰنُ ‘‘} اللہ تعالیٰ کے اسمائے حسنیٰ میں سے ہے اور اسم اللہ کے بعد سب سے محترم نام ہے۔ ابن عمر رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَحَبَّ أَسْمَائِكُمْ إِلَی اللّٰهِ عَبْدُ اللّٰهِ وَ عَبْدُ الرَّحْمٰنِ ] [ مسلم، الآداب، باب النھي عن التکني بأبی القاسم… : ۲۱۳۲ ] ’’اللہ تعالیٰ کے ہاں سب سے پیارے نام عبد اللہ اور عبد الرحمان ہیں۔‘‘"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت31) ➊ {وَ لَوْ اَنَّ قُرْاٰنًا سُيِّرَتْ بِهِ الْجِبَالُ … : ’’ قُرْاٰنًا ‘‘} نکرہ ہے، کوئی قرآن، یعنی پڑھی جانے والی کوئی کتاب۔ {’’لَوْ ‘‘} شرطیہ ہے، اس کا جواب محذوف ہے، جو آیت کے سیاق و سباق سے خود بخود معلوم ہو رہا ہے اور قرآن مجید کے دوسرے مقامات پر موجود بھی ہے۔ تفاسیر میں دو جواب مذکور ہیں اور دونوں درست ہیں، ایک تو یہ کہ اگر واقعی کوئی ایسا قرآن ہوتا جس کے ذریعے سے پہاڑ چلائے جاتے، یا اس کے ذریعے سے زمین قطع کی جاتی، یا اس کے ذریعے سے مُردوں سے کلام کیا جاتا تو پھر بھی یہ لوگ ایمان نہ لاتے، کیونکہ یہ ضد اور عناد کی وجہ سے انکار کر رہے ہیں۔ ان تین چیزوں کا خصوصاً ذکر اس لیے کیا کہ قرآن مجید کے معجزے کے بعد، جس کے چیلنج کے مقابلے میں سب لاجواب ہو چکے تھے، اب وہ لوگ خصوصاً انھی تین چیزوں کے دکھانے کا مطالبہ کرتے تھے۔ اللہ تعالیٰ نے فرمایا کہ جب لاجواب ہونے کے باوجود یہ لوگ اس قرآن پر ایمان نہیں لائے تو اگر کوئی ایسا قرآن بھی آ جائے جس سے ان کے مطالبے پورے ہوں، پھر بھی یہ ایمان نہیں لائیں گے، کیونکہ تمام کام تو اللہ کے ہاتھ میں ہیں اور یہ لوگ جب عناد کی وجہ سے اس قرآن پر ایمان نہ لا کر اللہ تعالیٰ کی ناراضگی کا نشانہ بن چکے ہیں، جو سب معجزوں سے بڑا معجزہ ہے، تو اپنے مطلوبہ معجزے دیکھ لینے کے بعد بھی اللہ کی ناراضگی کی وجہ سے ان کو ایمان لانے کی توفیق کیسے ملے گی اور کہاں سے ملے گی۔ جب کوئی جان بوجھ کر آنکھیں ہی بند کر لے تو کوئی اسے کس طرح دکھا سکتا ہے، جیسا کہ فرمایا : «{ وَ لَوْ اَنَّنَا نَزَّلْنَاۤ اِلَيْهِمُ الْمَلٰٓىِٕكَةَ وَ كَلَّمَهُمُ الْمَوْتٰى وَ حَشَرْنَا عَلَيْهِمْ كُلَّ شَيْءٍ قُبُلًا مَّا كَانُوْا لِيُؤْمِنُوْۤا اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ وَ لٰكِنَّ اَكْثَرَهُمْ يَجْهَلُوْنَ }» [ الأنعام : ۱۱۱ ] ’’اور اگر واقعی ہم ان کی طرف فرشتے اتار دیتے اور ان سے مُردے گفتگو کرتے اور ہم ہر چیز ان کے پاس سامنے لا جمع کرتے توبھی وہ ایسے نہ تھے کہ ایمان لے آتے مگر یہ کہ اللہ چاہے اور لیکن ان کے اکثر جہالت برتتے ہیں۔‘‘ اس آیت سے {’’ لَوْ ‘‘ } کا جواب صراحت کے ساتھ معلوم ہو رہا ہے۔ ¤ دوسرا جواب اس {’’ لَوْ ‘‘} کا یہ ہے کہ ان صفات کا حامل اگر کوئی قرآن ہوتا تو وہ یہی قرآن تھا، جیسا کہ فرمایا : «{ لَوْ اَنْزَلْنَا هٰذَا الْقُرْاٰنَ عَلٰى جَبَلٍ لَّرَاَيْتَهٗ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللّٰهِ }» [ الحشر : ۲۱ ] ’’اگر ہم اس قرآن کو کسی پہاڑ پر اتارتے تو یقینا تو اسے اللہ کے ڈر سے پست ہونے والا، ٹکڑے ٹکڑے ہونے والا دیکھتا۔‘‘اس میں اس قرآن کی عظمت کا بیان ہے کہ تم جو مطالبے کر رہے ہو قرآن کے لیے ان میں سے کوئی بھی پورا کرنا مشکل نہیں، مگر سارا معاملہ اللہ تعالیٰ کے ہاتھ میں ہے اور ایسا کرنا اس کی حکمت کے خلاف ہے، کیونکہ اس کے بعد ایمان نہ لانے کی صورت میں تمھیں عذاب سے ملیامیٹ کر دیا جاتا، جیسا کہ پہلی امتوں کے ساتھ ہوا۔ ¤ ➋ {اَفَلَمْ يَايْـَٔسِ الَّذِيْنَ اٰمَنُوْۤا:} مفسرین نے {’’ اَفَلَمْ يَايْـَٔسِ ‘‘} کے دو معنی لکھے ہیں، ایک معنی ہے کہ{’’ أَفَلَمْ يَعْلَمْ ‘‘} کہ کیا وہ لوگ جو ایمان لائے ہیں انھیں معلوم نہیں ہوا کہ جن نشانیوں کا یہ لوگ مطالبہ کر رہے ہیں اللہ تعالیٰ ان کے دکھانے پر قادر ہے، کیونکہ اسے ہر چیز کا اختیار ہے، مگر اس توقع پر ان نشانیوں کا دکھانا بے سود ہے، کیونکہ وہ جانتا ہے کہ یہ لوگ اتنے سرکش اور ضدی ہیں کہ یہ نشانیاں دیکھ کر بھی ایمان نہیں لائیں گے اور {’’ اَفَلَمْ يَايْـَٔسِ ‘‘} کا دوسرا معنی یہ ہے کہ کیا ابھی مسلمان ان کے ایمان لانے سے مایوس نہیں ہوئے، حالانکہ وہ جانتے ہیں…۔ ¤ ➌ {اَنْ لَّوْ يَشَآءُ اللّٰهُ لَهَدَى النَّاسَ جَمِيْعًا :} یعنی ہدایت تو اللہ تعالیٰ کی مشیت پر موقوف ہے جو ان نشانات کے دکھائے بغیر بھی ہو سکتی ہے۔ (شوکانی) ¤ ➍ {وَ لَا يَزَالُ الَّذِيْنَ كَفَرُوْا … :} یعنی یہ کفار مکہ نشانیوں کو دیکھ کر مان لینے والے نہیں ہیں۔ یہ مانیں گے تو اس طرح کہ ان کے کرتوتوں کی سزا میں آئے دن کوئی نہ کوئی آفت ان پر نازل ہوتی رہے، جیسے قتل، قید، قحط یا بیماری وغیرہ۔ چنانچہ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’لیکن کافر مسلمان یوں ہوں گے کہ ان پر آفت پڑتی رہے گی، ان پر پڑے یا ہمسائے پر، جب تک سارے عرب ایمان میں آ جائیں۔ وہ آفت یہی تھی جہاد مسلمانوں کے ہاتھ سے۔‘‘ (موضح) ¤ ➎ { اَوْ تَحُلُّ قَرِيْبًا مِّنْ دَارِهِمْ:} یعنی وہ آفت ان کے آس پاس والوں پر اترے گی اور وہ ان کا حال دیکھ کر عبرت حاصل کریں گے۔ ¤ ➏ { اِنَّ اللّٰهَ لَا يُخْلِفُ الْمِيْعَادَ:} چنانچہ اللہ تعالیٰ کا وعدہ پورا ہوا، قریش میں سے بعض لوگ مارے گئے اور بعض قید ہوئے، یہاں تک کہ اللہ کا وعدہ پورا ہوا، یعنی مکہ فتح ہوا۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت32){وَ لَقَدِ اسْتُهْزِئَ بِرُسُلٍ …:’’ عِقَابِ ‘‘} اصل میں {’’عِقَابِيْ‘‘} تھا۔ آیات کی موافقت کے لیے یاء حذف کر کے کسرہ رہنے دیا گیا۔ {’’أَمْلَيْتُ‘‘} باب افعال (ناقص واوی) بمعنی مہلت دینا، اس سے مقصود نبی صلی اللہ علیہ وسلم کو تسلی دینا ہے کہ آپ ان کافروں کے ٹھٹھا مذاق کرنے اور ناجائز اور ناممکن مطالبات کرنے سے بد دل نہ ہوں، پہلے رسولوں کے ساتھ بھی ایسا ہی ہوا ہے۔ نوح علیہ السلام کشتی بنا رہے تھے تو ہر گزرنے والا ان سے ٹھٹھا کرتا۔ [ ہود : ۳۸ ] شعیب علیہ السلام سے ان کی قوم نے کہا : ’’ہم پر آسمان کا کوئی ٹکڑا گرا دو۔‘‘ [ الشعراء : ۱۸۷ ] ہود علیہ السلام کی قوم نے کہا : ’’ہم یقینا تجھے بے وقوفی میں مبتلا دیکھ رہے ہیں۔‘‘ [ الأعراف : ۶۶ ] فرعون نے موسیٰ علیہ السلام کو {’’ مُهِيْنٌ ‘‘} (حقیر) کہا اور زبان کی لکنت کا طعنہ دیا۔ [ الزخرف : ۵۲ ] فرمایا، اس کے باوجود میں نے کفار کو مہلت دی، تاکہ ان کا عذر ختم ہو جائے، پھر میں نے انھیں پکڑ لیا تو آپ بھی ان کی حرکتوں سے دل گرفتہ نہ ہوں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ لَيُمْلِيْ لِلظَّالِمِ حَتّٰی إِذَا أَخَذَهُ لَمْ يُفْلِتْهُ ] ’’اللہ تعالیٰ ظالم کو مہلت دیتا ہے، یہاں تک کہ جب اسے پکڑتا ہے تو اسے چھوڑتا نہیں۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «{ وَ كَذٰلِكَ اَخْذُ رَبِّكَ اِذَاۤ اَخَذَ الْقُرٰى وَ هِيَ ظَالِمَةٌ اِنَّ اَخْذَهٗۤ اَلِيْمٌ شَدِيْدٌ }» [ ھود : ۱۰۲ ] ’’اور تیرے رب کی پکڑ ایسی ہی ہوتی ہے، جب وہ بستیوں کو پکڑتا ہے، اس حال میں کہ وہ ظلم کرنے والی ہوتی ہیں، بے شک اس کی پکڑ بڑی دردناک، بہت سخت ہے۔‘‘ [ بخاري، التفسیر، باب قولہ : «و کذٰلک أخذ ربک إذا أخذ القریٰ… » : ۴۶۸۶، عن أبي موسٰی رضی اللہ عنہ ۔ مسلم : ۲۵۸۳ ]"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت33) ➊ {اَفَمَنْ هُوَ قَآىِٕمٌ عَلٰى كُلِّ نَفْسٍۭ بِمَا كَسَبَتْ :} یہاں پھر اللہ تعالیٰ نے اپنی توحید کے ثبوت اور شرک کے رد کا بیان فرمایا ہے۔ {’’ قَآىِٕمٌ ‘‘} سے مراد یہاں نگران اور محافظ ہے۔ {’’ اَفَمَنْ هُوَ قَآىِٕمٌ عَلٰى كُلِّ نَفْسٍۭ بِمَا كَسَبَتْ ‘‘} مبتدا ہے، اس کی خبر محذوف ہے اور وہ ہے {’’ كَمَنْ لَيْسَ كَذٰلِكَ ‘‘} اور یہ حذف شدہ خبر کلام کے پہلے اور پچھلے حصے سے خود بخود سمجھ میں آ رہی ہے۔ یعنی کیا وہ معبود برحق جو ہر جان کا ہر لمحہ اور ہر حالت کا نگران اور محافظ ہے اور اس کے ہر عمل سے، نیک ہو یا بد، پوری طرح واقف ہے، وہ تمھارے ان جھوٹے معبودوں کی طرح ہے جو سرے سے اس وصف سے محروم ہیں۔ اللہ تعالیٰ کے اس وصف کے لیے دیکھیے سورۂ انعام (۵۹)، ہود (۶) اور آیت الکرسی وغیرہ۔ ¤ ➋ {وَ جَعَلُوْا لِلّٰهِ شُرَكَآءَ قُلْ سَمُّوْهُمْ:} اس سے پہلے جملے میں اللہ تعالیٰ کا ذکر ضمیر{ ’’ هُوَ ‘‘} کے ساتھ تھا، یہاں ضمیر کے بجائے اللہ تعالیٰ کا نام لے کر ان کے شرک کی قباحت ظاہر کی کہ کتنے ظالم ہیں کہ انھوں نے{ ’’الله‘‘ } کے شریک بنا لیے، جس کا کوئی شریک ہو ہی نہیں سکتا۔ فرمایا ان شریک بنانے والوں سے کہو ذرا ان شریکوں کے نام تو بتاؤ، انھیں سامنے تو لاؤ۔ اگر تم بالفرض نام لے بھی دو، تو ایسی ہستیوں کا نام لو گے جو محض خیالی ہیں، حقیقت میں ان کا کوئی وجود ہی نہیں، وہ خود اپنے وجود اور بقا میں دوسروں کی محتاج ہیں، نہ اپنے نفع نقصان کا اختیار رکھتی ہیں نہ کسی دوسرے کا، ایک مکھی بھی نہیں بنا سکتیں۔ پھر ان کا نام اللہ کے شریک کے طور پر لینا کس قدر نادانی اور جہالت کی بات ہے۔ ¤ ➌ { اَمْ تُنَبِّـُٔوْنَهٗ بِمَا لَا يَعْلَمُ فِي الْاَرْضِ:} یا تم اسے اس چیز کی خبر دیتے ہو جسے وہ زمین میں نہیں جانتا، حالانکہ اسے زمین کے چپے چپے کی خبر ہے، تو اگر ان شرکاء کا کہیں وجود ہوتا تو وہ انھیں ضرور جانتا۔ اس تفسیر کی رو سے{ ’’ لَا يَعْلَمُ ‘‘ } میں{ ’’هُوَ‘‘ } کی ضمیر اللہ تعالیٰ کے لیے ہو گی اور یہ بھی ہو سکتا ہے کہ {’’ لَا يَعْلَمُ ‘‘} میں ضمیر {’’ مَا‘‘} کے لیے ہو اور مطلب یہ ہو کہ کیا اللہ تعالیٰ کو ان بے جان بتوں کے معبود ہونے کی خبر دیتے ہو جن کو ذرا بھی علم نہیں ہے۔ صاحب روح المعانی لکھتے ہیں، اس سے مقصود تو زمین و آسمان میں اللہ تعالیٰ کے سوا دوسرے معبودوں کی نفی کرنا ہے، لہٰذا {’’ فِي الْاَرْضِ ‘‘} کی قید محض اس لیے لگائی ہے کہ کفار یہ عقیدہ رکھتے تھے کہ اللہ کے یہ شریک زمین میں ہیں۔ (روح، ابن کثیر) ¤ ➍ {اَمْ بِظَاهِرٍ مِّنَ الْقَوْلِ :} یا ظاہری بات ہے، جو تم صرف منہ سے کہہ رہے ہو، دل سے تمھیں بھی یقین نہیں کہ کوئی اللہ کا شریک ہے، کیونکہ اگر غور وفکر کرو تو انسانی فطرت بھی اللہ کا کوئی شریک ہونا تسلیم نہیں کرتی۔ ¤ ➎ { بَلْ زُيِّنَ لِلَّذِيْنَ كَفَرُوْا مَكْرُهُمْ :} مکر سے مراد کفر اور اس کے لیے باطل دلیلیں گھڑنا اور لوگوں کو دھوکا دے کر مشرک بنانا ہے۔ ’’خوش نما بنا دیا گیا‘‘ خوش نما بنانے والی کئی چیزیں ہیں، اس لیے فعل مجہول استعمال کیا گیا، مثلاً : 1 ان کے اعمالِ بد کی نحوست 2 نفسانی خواہشات 3 شیطان 4 ان کے فسق کی وجہ سے اللہ تعالیٰ کی طرف سے ان کے دلوں پر لگنے والی مہر، غرض بہت سی چیزیں ان کے کفر کو خوش نما بنانے کا باعث بنیں۔ ¤ ➏ {وَ صُدُّوْا عَنِ السَّبِيْلِ … : ’’ مِنْ هَادٍ ‘‘} یعنی اللہ تعالیٰ نے ان کی قسمت میں ہدایت نہیں لکھی۔ اب ایسے لوگ سیدھی راہ پر کیسے آ سکتے ہیں۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت34) {لَهُمْ عَذَابٌ فِي الْحَيٰوةِ الدُّنْيَا … :} یعنی دنیا ہی میں بعض اوقات آسمانی آفات، بیماریوں، فاقوں اور مختلف مصیبتوں کے ذریعے سے عذاب ہو گا اور بعض اوقات مجاہدین اسلام کے ہاتھوں قید، قتل یا ذلیل ہوں گے اور آخرت کا عذاب زیادہ سخت ہے۔ اس کی ایک جھلک یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ نَارُكُمْ هٰذِهِ الَّتِيْ يُوْقِدُ ابْنُ آدَمَ جُزْءٌ مِنْ سَبْعِيْنَ جُزْءًا مِنْ حَرِّ جَهَنَّمَ … كُلُّهَا مِثْلُ حَرِّهَا ] [ مسلم، الجنۃ وصفۃ نعیمھا، باب جہنم أعاذنا اللّٰہ منہا : ۲۸۴۳، عن أبی ھریرۃ رضی اللہ عنہ ]’’تمھاری یہ آگ جو ابن آدم جلاتا ہے، جہنم کی گرمی کے ستر (۷۰) حصوں میں سے ایک حصہ ہے… سب کی گرمی اس کی مثل ہے۔‘‘ اور آخرت کے عذاب کے بہت زیادہ سخت ہونے کا سب سے بڑا باعث یہ ہے کہ وہ ہمیشہ ہمیشہ کے لیے ہے۔ مزید دیکھیے سورۂ فجر (۲۵، ۲۶) اور سورۂ فرقان (۱۱ تا ۱۵)۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت35){ مَثَلُ الْجَنَّةِ الَّتِيْ …: ’’ مَثَلُ ‘‘} کا معنی یہاں صفت یا حال ہے، اہل جہنم کے ذکر کے بعد متقی لوگوں کو ملنے والی جنت کا حال اور اس کی صفت بیان فرمائی کہ اس کے درختوں اور مکانوں کے نیچے نہریں بہ رہی ہوں گی، اس کا پھل دائمی ہے، یہ نہیں کہ کبھی ہو اور کبھی نہ ہو، اسی طرح اس کا سایہ بھی دائمی ہے، اس کے پھل نہ ختم ہوں گے، نہ کسی جنتی کو ان سے کوئی رکاوٹ ہو گی۔ (دیکھیے واقعہ : ۳۳) جنت کی نہروں کی صفت کے لیے سورۂ محمد (۱۵) اور سائے کی حالت کے لیے سورۂ دہر (۱۴)، نساء (۵۷) اور طٰہٰ (۱۱۸، ۱۱۹) ملاحظہ فرمائیں۔ مزید تفصیل کے لیے اس مقام پر تفسیر ابن کثیر اور کتب احادیث میں جنت اور جہنم کے احوال کے ابواب ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت36) ➊ {وَ الَّذِيْنَ اٰتَيْنٰهُمُ الْكِتٰبَ … : ’’ الْكِتٰبَ ‘‘} سے مراد یا تو پہلی کتابیں ہیں، یعنی تورات و انجیل، مطلب یہ ہوگا کہ پہلی کتب میں چونکہ آپ صلی اللہ علیہ وسلم کے سچے رسول ہونے کے بہت سے شواہد اور بشارتیں موجود ہیں، اس لیے جن لوگوں کو وہ کتابیں دی گئی ہیں وہ آپ کی طرف اترنے والی آیات پر خوش ہوتے ہیں۔ دیکھیے سورۂ عنکبوت (۴۷) اور آل عمران (۱۱۳) کیونکہ وہ آپ کو پہچان کر ایمان لا چکے ہیں، ہاں ان کے کئی گروہ قرآن کی بعض چیزوں کا انکار کرتے ہیں، کیونکہ وہ ان کی ان باتوں کا رد کرتا ہے جو انھوں نے اپنے پاس سے داخل کر لی تھیں، یا ان میں تبدیلی اور تحریف کر دی تھی، مثلاً یہود کاعزیر علیہ السلام اور نصاریٰ کا مسیح علیہ السلام کو اللہ کا بیٹا قرار دینا اور وہ باتیں ظاہر کرنا ہے جو وہ چھپاتے تھے، مثلاً رجم کی حد، سود کی حرمت، نبی صلی اللہ علیہ وسلم کی صفات وغیرہ، لہٰذا وہ پہچاننے کے باوجود عناد کی وجہ سے ان باتوں کا انکار کرتے اور اپنے کفر پر اڑے ہوئے تھے۔ دیکھیے سورۂ توبہ (۳۰، ۳۱) یا پھر{ ’’ الْكِتٰبَ ‘‘ } سے مراد قرآن مجید ہے اور ’’جن لوگوں کو یہ کتاب دی‘‘ سے مراد مسلمان ہیں کہ وہ آپ پر اترنے والی آیات پر دل سے خوش ہوتے ہیں اور {’’الْأَحْزَابِ‘‘} سے مراد عرب کے وہ جاہل اور ضدی لوگ ہیں جنھوں نے قرآن کی بعض باتیں اپنی مرضی کے خلاف ہونے کی وجہ سے نہ مانیں اور مسلمان نہ ہوئے۔ یہ لوگ خوش ہونے کے بجائے ناراض اور سیخ پا ہوتے ہیں۔ ¤ ➋ {قُلْ اِنَّمَاۤ اُمِرْتُ اَنْ اَعْبُدَ اللّٰهَ … :} تو جو شخص نہیں مانتا وہ گویا اللہ تعالیٰ اور اس کی عبادت سے انکار کرتا ہے۔ ¤ ➌ { وَ اِلَيْهِ مَاٰبِ: ’’ مَاٰبِ ‘‘} یہ {’’ اٰبَ يَؤُوْبُ ‘‘} (ن، اجوف واوی) سے مصدر میمی ہے، اصل{ ’’ مَاٰبِيْ ‘‘} تھا، یعنی میرا لوٹنا، ’’ یاء ‘‘ حذف کر کے کسرہ اس پر دلالت کے لیے باقی رکھا ہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت37) ➊ {وَ كَذٰلِكَ اَنْزَلْنٰهُ حُكْمًا عَرَبِيًّا :} یعنی جس طرح پہلے انبیاء کی طرف کتابیں اتریں اسی طرح ہم نے آپ پر یہ قرآن اتارا اور جس طرح ہر نبی پر اس کی قوم کی زبان میں وحی اور کتاب نازل کی اسی طرح عربوں پر بھی انھی کی زبان میں کتاب اتاری، کسی دوسری زبان میں نہیں، تاکہ وہ یہ نہ کہہ سکیں کہ ہم تو یہ زبان جانتے ہی نہیں۔ {’’ اَنْزَلْنٰهُ ‘‘} (ہم نے اسے اتارا) سے معلوم ہوا کہ قرآن مجید اور وحی الٰہی اوپر کی جانب سے آئی ہیں۔ اس سے ان لوگوں کا صاف رد ہو گیا جو اللہ تعالیٰ کے لیے اوپر کی جانب ہونے یا عرش پر ہونے کو تسلیم نہیں کرتے، بلکہ کبھی کہتے ہیں کہ وہ لامکان ہے، یعنی کہیں بھی نہیں اور کبھی کہتے ہیں وہ ہر جگہ ہے، حالانکہ قرآن نے کئی جگہ صراحت فرما دی ہے کہ وہ اوپر کی جانب ہے اور عرش پر ہے، فرمایا: «{قَدْ نَرٰى تَقَلُّبَ وَجْهِكَ فِي السَّمَآءِ }» [ البقرۃ : ۱۴۴ ] ’’یقینا ہم تیرے چہرے کا بار بار آسمان کی طرف پھرنا دیکھ رہے ہیں۔‘‘ اور فرمایا : «{ ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ }» [ الأعراف : ۵۴ ] ’’پھر وہ عرش پر بلند ہوا۔‘‘ اور دیگر متعدد آیات۔ پھر آپ کے مخاطب اگرچہ قیامت تک کے تمام جن و انس ہیں، تاہم سب سے اول مخاطب عرب تھے۔ اللہ تعالیٰ نے پوری دنیا کی رہنمائی کے لیے ان کا اور ان کی زبان کا انتخاب ان کی فطری خوبیوں اور ان کی زبان کی جامعیت، فصاحت و بلاغت، حسنِ ادا، آسان ہونے اور دوسری خوبیوں کی وجہ سے فرمایا اور اسے اہل عرب پر احسان قرار دیا : «{ وَ اِنَّهٗ لَذِكْرٌ لَّكَ وَ لِقَوْمِكَ وَ سَوْفَ تُسْـَٔلُوْنَ }» [الزخرف : ۴۴ ] ’’اور بے شک وہ تیرے لیے اور تیری قوم کے لیے نصیحت (یا شہرت کا باعث) ہے اور عنقریب تم سے پوچھا جائے گا۔‘‘ پھر اس قرآن نے عربی زبان کو ایسا محفوظ کیا کہ صدیاں گزر جانے کے باوجود عربی زبان اصل صورت میں موجود ہے، جبکہ دوسری تمام زبانیں کچھ عرصہ بعد بدل جاتی ہیں، حتیٰ کہ پہلے لفظ بالکل ہی متروک ہو جاتے ہیں، جیسا کہ انگریزی وغیرہ کا حال ہے۔ خود عربی کو دیکھ لیجیے کہ قرآن کی وجہ سے فصیح عربی محفوظ ہے، مگر عام لوگوں کی عربی بھی مختلف علاقوں اور مختلف ادوار کے لحاظ سے اتنی مختلف ہے کہ ایک علاقے کا عرب دوسرے علاقے کی عامی زبان نہیں سمجھتا۔ البتہ اصل عربی کو قرآن نے صدیوں سے اصل صورت میں باندھ رکھا ہے، وہ دنیا بھر میں ایک ہی ہے۔ ¤ ➋ {وَ لَىِٕنِ اتَّبَعْتَ اَهْوَآءَهُمْ …:} یہ خطاب بظاہر نبی کریم صلی اللہ علیہ وسلم سے ہے لیکن مراد ہر وہ شخص ہے جو اللہ تعالیٰ کی رضا کا طالب اور اس کے غصے سے ڈرنے والا ہے اور اس میں وعید ہے ان علماء کے لیے جو جانتے بوجھتے سنت کی راہ چھوڑ کر بدعت و ضلالت اور قرآن و حدیث چھوڑ کر اقوالِ رجال کی راہ اختیار کرتے ہیں۔ (ابن کثیر)"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت38) ➊ {وَ لَقَدْ اَرْسَلْنَا رُسُلًا مِّنْ قَبْلِكَ … : } نبی کریم صلی اللہ علیہ وسلم کی نبوت پر مشرکین یہ بھی اعتراض کرتے کہ یہ عجیب پیغمبر ہیں کہ دوسرے انسانوں کی طرح نکاح کرتے ہیں، ان کی اولاد بھی ہے، حالانکہ پیغمبر کو ان باتوں سے کیا واسطہ؟! بلکہ انھیں اس پر بھی اعتراض تھا کہ یہ کیسا رسول ہے جو کھانا کھاتا ہے اور بازاروں میں چلتا پھرتا ہے۔ (دیکھیے فرقان : ۷) اس آیت میں اسی اعتراض کا جواب ہے کہ نبوت عورتوں سے نکاح کے منافی نہیں، آپ سے پہلے جتنے بھی اللہ کے پیغمبر ہو گزرے ہیں وہ سب بشر ہی تھے اور ان میں اکثریت ان پیغمبروں کی ہے جو بیوی بچے رکھتے تھے۔ وہ سب کھانا کھاتے اور بازاروں میں چلتے پھرتے تھے۔ (دیکھیے فرقان:۲۰) تمھیں ابراہیم اور اسماعیل علیھما السلام کی اولاد ہونے پر فخر ہے تو کیا تم ان کی شادی کے بغیر ہی پیدا ہو گئے ہو؟! اسی طرح بنی اسرائیل اور ان کے انبیاء کو دیکھ لو۔ سلیمان علیہ السلام کی بیویوں اور لونڈیوں کی تعداد کی طرف دھیان کرو! غرض تمھارا یہ اعتراض سرے سے ہے ہی لغو۔ ہمارے زمانے میں بھی کئی لوگ انھی لوگوں کو اللہ والے، ولی اور بزرگ سمجھتے ہیں جو نہ شادی کریں، نہ کمائی، راہب بن کر دین کی دعوت اور جہاد کے بجائے گوشہ نشینی اور خود محنت کرکے کھانے کے بجائے دوسروں کی کمائی پر زندگی بسر کریں، حالانکہ اسلام میں یہ کام حرام ہیں۔ انس بن مالک رضی اللہ عنہ بیان کرتے ہیں : [جَاءَ ثَلَاثَةُ رَهْطٍ إِلٰی بُيُوْتِ أَزْوَاجِ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُوْنَ عَنْ عِبَادَةِ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا أُخْبِرُوْا كَأَنَّهُمْ تَقَالُّوْهَا فَقَالُوْا وَأَيْنَ نَحْنُ مِنَ النِّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ قَدْ غَفَرَ اللّٰهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ، فَقَالَ أَحَدُهُمْ أَمَّا أَنَا فَأَنَا أُصَلِّی اللَّيْلَ أَبَدًا، وَقَالَ آخَرُ أَنَا أَصُوْمُ الدَّهْرَ وَلَا أُفْطِرُ، وَقَالَ آخَرُ أَنَا أَعْتَزِلُ النِّسَاءَ فَلاَ أَتَزَوَّجُ أَبَدًا، فَجَاءَ إِلَيْهِمْ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَنْتُمُ الَّذِيْنَ قُلْتُمْ كَذَا وَكَذَا ؟ أَمَا وَاللّٰهِ ! إِنِّيْ لَأَخْشَاكُمْ لِلّٰهِ وَأَتْقَاكُمْ لَهُ، لٰكِنِّيْ أَصُوْمُ وَأُفْطِرُ، وَأُصَلِّيْ وَ أَرْقُدُ، وَأَتَزَوَّجُ النِّسَاءَ، فَمَنْ رَغِبَ عَنْ سُنَّتِيْ فَلَيْسَ مِنِّيْ ] [ بخاری، النکاح، باب الترغیب في النکاح : ۵۰۶۳۔ مسلم : ۱۴۰۱ ] ’’تین آدمی نبی صلی اللہ علیہ وسلم کی بیویوں کے گھروں کی طرف آئے، وہ نبی صلی اللہ علیہ وسلم کی عبادت کے متعلق پوچھ رہے تھے۔ جب انھیں بتایا گیا تو گویا انھوں نے اسے کم سمجھا، کہنے لگے : ’’ہماری نبی صلی اللہ علیہ وسلم سے کیا نسبت؟ آپ صلی اللہ علیہ وسلم کو تو اللہ تعالیٰ نے آپ کے پہلے اور پچھلے سب گناہ معاف فرما دیے ہیں۔‘‘ چنانچہ ان میں سے ایک نے کہا : ’’میں ہمیشہ ساری رات نماز پڑھوں گا۔‘‘ دوسرے نے کہا : ’’میں ہمیشہ روزہ رکھوں گا، کبھی روزے کے بغیر نہیں رہوں گا۔‘‘ تیسرے نے کہا : ’’میں عورتوں سے علیحدہ رہوں گا، کبھی نکاح نہیں کروں گا۔‘‘ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے (انھیں بلوایا) اور فرمایا : ’’تم لوگوں نے یہ یہ باتیں کی ہیں، یاد رکھو! اللہ کی قسم! میں تم سب سے زیادہ اللہ کی خشیت والا ہوں اور تم سب سے زیادہ اللہ کے تقویٰ والا ہوں، لیکن میں روزہ رکھتا ہوں اور نہیں بھی رکھتا اور نماز پڑھتا ہوں اور سوتا بھی ہوں اور میں عورتوں سے نکاح بھی کرتا ہوں، تو جو میرے طریقے سے بے رغبتی کرے گا وہ مجھ سے نہیں۔‘‘ ¤ ➋ {وَ مَا كَانَ لِرَسُوْلٍ اَنْ يَّاْتِيَ بِاٰيَةٍ اِلَّا بِاِذْنِ اللّٰهِ:} مخالفین کا ایک اعتراض یہ بھی تھا کہ اگر یہ (محمد صلی اللہ علیہ وسلم ) واقعی اللہ کے سچے پیغمبر ہیں تو ہماری طلب کے مطابق معجزے اور نشانیاں کیوں نہیں لاتے۔ ان کے جواب میں فرمایا کہ پہلے پیغمبر جتنے معجزے لائے ہیں وہ سب اللہ تعالیٰ کی مشیت اور حکم سے لائے ہیں، اب اگر اللہ کا حکم ہو گا تو وہ اپنے اس پیغمبر سے بھی معجزے ظاہر کر دے گا، ورنہ پیغمبر میں از خود یہ ہمت کہاں ہے کہ اپنی مرضی سے جو معجزہ چاہے ظاہر کر دے۔ یہی حال اولیاء کی کرامتوں کا ہے کہ وہ اپنی مرضی سے کرامت دکھلانے پر قادر نہیں ہوتے۔ یہاں آیت سے مراد قرآن کی آیت بھی ہو سکتی ہے جس میں ان کی مرضی کے مطابق کوئی حکم نازل ہو جائے۔ (ابن کثیر) ¤ ➌ { لِكُلِّ اَجَلٍ كِتَابٌ :} یعنی ہر وقت کے لیے ایک لکھا ہوا فیصلہ ہے جو اس وقت ہو کر رہے گا۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت39){يَمْحُوا اللّٰهُ مَا يَشَآءُ وَ يُثْبِتُ …:} بظاہر یہ آیت اس حدیث کے خلاف ہے :ـ [ جَفَّ الْقَلَمُ بِمَا أَنْتَ لَاقٍ ] [بخاری، النکاح، باب ما یکرہ من التبتل والخصاء : ۵۰۷۶ ] ’’جس چیز یا حال کو تم ملنے والے ہو قلم اس کے ساتھ خشک ہو چکا ہے۔‘‘ اس حدیث سے معلوم ہوتا ہے کہ جو فیصلہ ہو چکا وہ اب مٹنے والا نہیں، اس سوال کے حل کے لیے اس آیت کی تفسیر اہل علم نے دو طرح سے کی ہے، ایک تو یہ کہ جس طرح معجزہ اور کرامت اللہ تعالیٰ ہی کے اختیار میں ہے، کسی دوسرے کا اس میں کچھ دخل نہیں، اسی طرح کسی حکم کو باقی رکھنا یا اسے منسوخ کر دینا بھی اسی کے اختیار میں ہے اور اسی کے پاس اصل کتاب ہے جس میں یہ بھی لکھا ہے کہ کون سا حکم کب تک باقی رکھنا ہے اور کون سا حکم منسوخ کرنا ہے اور کب کرنا ہے۔ گویا یہ یہود پر رد ہے جو نسخ کے قائل نہیں تھے۔ اللہ تعالیٰ نے سورۂ بقرہ میں بھی ان پر رد فرمایا : «{ مَا نَنْسَخْ مِنْ اٰيَةٍ اَوْ نُنْسِهَا نَاْتِ بِخَيْرٍ مِّنْهَاۤ اَوْ مِثْلِهَا }» [ البقرۃ : ۱۰۶ ] یعنی جو بھی آیت ہم منسوخ کرتے ہیں یا اسے بھلا دیتے ہیں اس سے بہتر یا اس جیسی اور لے آتے ہیں اور یہ سب باقی رکھنا یا منسوخ کرنا (محو و اثبات) ام الکتاب میں درج ہے، جو اللہ تعالیٰ ہی کے پاس ہے۔ سورۂ بقرہ کی آیت (۱۰۶) کی تفسیر بھی ملاحظہ فرما لیں۔ ¤ اسی طرح اللہ تعالیٰ جب تک چاہتا ہے ایک رسول کے احکام پر عمل قائم رکھتا ہے، پھر جس وقت چاہتا ہے بعد میں آنے والے رسول کے احکام پر عمل فرض کر دیتا ہے اور پہلے پر عمل ختم کر دیتا ہے۔ {’’ يَمْحُوا اللّٰهُ مَا يَشَآءُ وَ يُثْبِتُ ‘‘} میں یہ بھی شامل ہے کہ کسی بندے کے نامۂ اعمال میں کوئی بھی نیک یا بدعمل اللہ تعالیٰ چاہتا ہے تو باقی رکھتا ہے، چاہتا ہے تو مٹا دیتا ہے اور یہ نہیں کہ پہلے اسے علم نہیں تھا کہ میں نے کیا ثابت رکھنا ہے اور کیا مٹانا ہے، بلکہ اصل کتاب اسی کے پاس ہے ۔ ¤ دوسری تفسیر یہ ہے کہ تقدیر کی دو قسمیں ہیں، ایک وہ جس میں کوئی تبدیلی نہیں ہوتی، اسے قضائے مبرم کہتے ہیں اور یہ وہی ہے جس کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے ابوہریرہ رضی اللہ عنہ سے فرمایا : [ جَفَّ الْقَلَمُ بِمَا أَنْتَ لَاقٍ ] [ بخاری، النکاح، باب ما یکرہ من التبتل والخصاء : ۵۰۷۶ ] ’’تم جس چیز یا حال کو ملنے والے ہو اس کے ساتھ قلم خشک ہو چکا ہے۔‘‘ اور ایک تقدیر وہ ہے جس میں تبدیلی ہوتی ہے، اسے تقدیر معلق کہتے ہیں اور وہ بھی اللہ کے علم میں ہے۔ چنانچہ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’دنیا میں ہر چیز اسباب سے ہے، بعض اسباب ظاہر ہیں اور بعض چھپے ہیں۔ اسباب کی تاثیر کا ایک اندازہ مقرر ہے، جب اللہ چاہے ان کی تاثیر اندازے سے کم یا زیادہ کر دے اور جب چاہے ویسی ہی رکھے۔ آدمی کبھی کنکر سے مرتا ہے اورگولی سے بچتا ہے اور ایک اندازہ ہر چیز کا اللہ کے علم میں ہے، وہ ہر گز نہیں بدلتا۔ اندازے کو تقدیر کہتے ہیں، یہ دو تقدیریں ہوئیں، ایک بدلتی ہے (تقدیر تاثیر اسباب) اور ایک نہیں بدلتی (یعنی علمِ الٰہی)۔‘‘ (موضح) ¤ شیخ ناصر الدین البانی نے سلسلہ الاحادیث الضعیفہ (۵۴۴۸) میں فرمایا : ’’قرطبی نے بھی اپنی تفسیر ’’الجامع (۵؍۳۳۲)‘‘ میں اس کی طرف اشارہ فرمایا ہے، وہ لکھتے ہیں : ’’اور عقیدہ یہی ہے کہ اللہ تعالیٰ کے فیصلے (قضا) میں تبدیلی نہیں ہوتی اور یہ محو و اثبات بھی ان چیزوں میں شامل ہے جن کا فیصلہ پہلے ہو چکا ہے اور یہ بات پہلے گزر چکی ہے کہ قضا میں سے کچھ چیزیں وہ ہیں جو لازماً ہو کر رہنی ہیں، یہ وہ ہیں جو ثابت (مبرم) ہیں اور کچھ وہ ہیں جن میں بعض اسباب سے تبدیلی ہو جاتی ہے، یہ محو (مٹائی ہوئی) ہیں۔ (واللہ اعلم) غزنوی رحمہ اللہ نے فرمایا : ’’میرے نزدیک یہ ہے کہ لوح محفوظ میں جو کچھ ہے وہ غیب سے نکل چکا ہے، کیونکہ بعض فرشتے بھی اس سے واقف ہیں، اس لیے وہ تبدیل ہو سکتا ہے، کیونکہ مخلوق کا اللہ تعالیٰ کے پورے علم سے واقف ہونا محال ہے اور اس کے علم میں اشیاء کی جو تقدیر اور طے شدہ بات ہے وہ کبھی نہیں بدلتی۔‘‘ (سلسلہ ضعیفہ کے حاشیہ میں لکھا ہے کہ ظاہر یہ ہے کہ غزنوی سے مراد عالی بن ابراہیم بن اسماعیل ہیں جن کا لقب ’’تاج الشریعہ‘‘ ہے، یہ ایک حنفی فقیہ مفسر ہیں، ان کی کتاب تفسیر التفسیر ہے جو بہت عمدہ ہے، جیسا کہ کئی علماء نے فرمایا ہے، ۵۸۲ ھ میں فوت ہوئے۔ الاعلام) خلاصہ یہ کہ اس ’’محو و اثبات‘‘ کا اس ’’بدا‘‘ کے غلط عقیدے سے کوئی تعلق نہیں جو بعض گمراہ لوگوں نے اختیار کیا ہے، جس کا مطلب یہ ہے کہ تم کوئی کام کرو، پھر اس کا غلط ہونا تمھیں معلوم ہو تو اسے بدل دو۔ اللہ تعالیٰ کے متعلق یہ عقیدہ رکھنا حرام ہے ، کیونکہ وہ پہلے ہی جانتا ہے کہ کیا درست ہے اور کیا غلط ہے۔ ¤ اس تفصیل سے اللہ کے فیصلے کے بدل نہ سکنے کے عقیدے اور ان تمام احادیث و اقوال صحابہ کے متعلق اشکال ختم ہو جاتا ہے جن سے معلوم ہوتا ہے کہ بعض اوقات تقدیر بدل سکتی ہے، خصوصاً دعا سے، مثلاً رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے : [ لاَ يَرُدُّ الْقَضَاءَ إِلاَّ الدُّعَاءُ وَلَا يَزِيْدُ فِي الْعُمُرِ إِلَّا الْبِرُّ ] [ ترمذی، القدر، باب ما جاء لا یرد القدر إلا الدعاء : ۲۱۳۹۔ سلسلۃ الأحادیث الصحیحۃ : 153/1، ح : ۱۵۴ ] ’’تقدیر کو دعا کے سوا کوئی چیز نہیں ٹالتی اور عمر کو نیکی کے سوا کوئی چیز زیادہ نہیں کرتی۔‘‘ اسی طرح بعض صحابہ کی دعائیں کہ یا اللہ! اگر تو نے مجھے شقی لکھا ہے تو اسے بدل کر سعید لکھ دے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت40) {وَ اِنْ مَّا نُرِيَنَّكَ … : ’’ مَا ‘‘} شرط کے معنی کی تاکید کے لیے ہے جو {’’ اِنْ ‘‘} کا مفہوم ہے۔ اس لیے ترجمہ کیا ہے ’’اور اگر کبھی ہم واقعی تجھے دکھا دیں۔‘‘ یہاں {’’ نُرِيَنَّكَ ‘‘} کا معنی آنکھوں سے دکھانا ہے، دل سے یا گمان اور خیال سے نہیں۔ شرط میں مذکور {’’ نُرِيَنَّكَ ‘‘} اور {’’ اَوْ نَتَوَفَّيَنَّكَ۠ ‘‘} دونوں کا جواب محذوف ہے، یعنی ضروری نہیں کہ دنیا میں انھیں دی جانے والی سزا ہم آپ کی زندگی ہی میں آپ کو دکھا کر دیں، یہ بھی ہو سکتا ہے کہ آپ کی وفات کے بعد ان کی سزا کا وقت آئے، اگر ہم آپ کو آنکھوں سے ان کی کچھ دنیوی سزا دکھا دیں تو یہ آپ اور آپ کے ساتھیوں کے سینوں اور آنکھوں کی ٹھنڈک کا باعث ہو گا اور اگر پہلے فوت کر لیں تب بھی آپ فکر نہ کریں، کیونکہ آپ کا کام صرف پیغام پہنچا دینا ہے۔ رہا ان کے اعمال پر محاسبہ اور مؤاخذہ تو وہ ہمارے ذمے ہے۔ اس آیت میں اشارہ ہے کہ کچھ وعدے تو آپ کی زندگی میں پورے ہوں گے اور کچھ آپ کی وفات کے بعد۔ باغبان پودے لگاتا ہے، کچھ اس کی زندگی میں پھل دے دیتے ہیں اور کچھ کئی سالوں کے بعد آنے والی نسل کو پھل دیتے ہیں، لہٰذا آپ کو اس کے لیے جلدی نہیں کرنی چاہیے اور انھیں بے فکر اور غافل نہیں رہنا چاہیے۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت41) ➊ { اَوَ لَمْ يَرَوْا اَنَّا نَاْتِي الْاَرْضَ …: } یہ کفار کے لیے وعید اور مسلمانوں کے لیے خوش خبری ہے، یعنی کیا ان کفار نے نہیں دیکھا کہ ہم ان کی زمین کو اس کے کناروں سے کم کرتے چلے آ رہے ہیں، ان کے شہر اور علاقے یکے بعد دیگرے مسلمانوں کے قبضے میں آتے جا رہے ہیں، ایک وقت آ رہا ہے کہ انھیں زمین کے مرکز ام القریٰ یعنی مکہ سے بھی بے دخل ہونا پڑے گا۔ چونکہ مکہ میں مسلمانوں کی فتوحات کا سلسلہ شروع نہیں ہوا تھا، اس لیے بعض مفسرین نے اس سورت کو مدنی قرار دیا ہے۔ اللہ تعالیٰ نے مسلمانوں کی پیش قدمی کو اپنی پیش قدمی قرار دیا، کیونکہ اللہ تعالیٰ ہی کا دین آگے بڑھ رہا تھا اور مسلمانوں کا آگے بڑھنا صرف اللہ ہی کی مدد سے تھا، ورنہ وہ کفار کی متحدہ قوتوں کے سامنے اکیلے اپنی طاقت سے کبھی آگے نہیں بڑھ سکتے تھے۔ اللہ تعالیٰ کے مسلمانوں کی پیش قدمی کو {’’ اَنَّا نَاْتِي ‘‘} (اپنے آنے) کے الفاظ کے ساتھ بیان کرنے میں اللہ تعالیٰ کی ہیبت و جلال کا جو اظہار ہو رہا ہے وہ اللہ کے کلام ہی کی خصوصیت ہے، جیسے فرمایا : «{ فَاَتَى اللّٰهُ بُنْيَانَهُمْ مِّنَ الْقَوَاعِدِ فَخَرَّ عَلَيْهِمُ السَّقْفُ مِنْ فَوْقِهِمْ وَ اَتٰىهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُوْنَ }» [ النحل : ۲۶ ] ’’(یعنی ان کفار سے پہلے لوگوں نے سازشیں کیں) تو اللہ ان کی عمارت کو بنیادوں سے آیا، پس ان پر ان کے اوپر سے چھت گر پڑی اور ان پر وہاں سے عذاب آیا کہ وہ سوچتے نہ تھے۔‘‘ یہی وہ حقیقت ہے جس کا اظہار رسول اللہ صلی اللہ علیہ وسلم نے صفا اور مروہ پر کھڑے ہو کر ان الفاظ میں کیا : [ لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ وَ نَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ ] [ مسلم، الحج، باب حجۃ النبي صلی اللہ علیہ وسلم : ۱۲۱۸ ] ’’اللہ کے سوا کوئی عبادت کے لائق نہیں، اس نے اپنا وعدہ پورا کیا اور اپنے بندے کی مدد کی اور اکیلے ہی نے تمام جماعتوں کو شکست دی۔‘‘ کفار پر تعجب ہے کہ یہ دیکھ کر بھی کہ دن بدن اسلام کا دائرہ وسیع ہو رہا ہے اور کفر و شرک سمٹ رہا ہے، یہ لوگ اسلام نہیں لاتے۔ اللہ تعالیٰ کی بشارت کے مطابق پھر وہ وقت آیا کہ مشرق اور مغرب کے آخر تک اسلام کا علم لہرانے لگا اور رسول اللہ صلی اللہ علیہ وسلم کی پیش گوئی کے مطابق ہر صورت وہ وقت آنے والا ہے جو مقداد بن الاسود رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم سے نقل کیا ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، فرماتے تھے : [لاَ يَبْقَی عَلَی ظَهْرِ الْأَرْضِ بَيْتُ مَدَرٍ وَلاَ وَبَرٍ إِلاَّ أَدْخَلَهٗ اللّٰهُ كَلِمَةَ الْإِسْلاَمِ بِعِزِّ عَزِيْزٍ أَوْ ذُلِّ ذَلِيْلٍ إِمَّا يُعِزُّهُمُ اللّٰهُ عَزَّوَجَلَّ فَيَجْعَلُهُمْ مِنْ أَهْلِهَا أَوْ يُذِلُّهُمْ فَيَدِيْنُوْنَ لَهَا ] [ أحمد : 4/6، ح : ۲۳۸۷۶ وصححہ الألبانی ]’’زمین کی پشت پر اینٹوں یا بالوں کا بنا ہوا کوئی گھر (یا خیمہ) باقی نہیں رہے گا، مگر اللہ تعالیٰ اس میں کلمۂ اسلام کو داخل کر دے گا، عزت والوں کو عزت بخش کر اور ذلیل کو ذلت دے کر، یا تو انھیں عزت دے گا اور انھیں یہ کلمہ پڑھنے والوں میں داخل کر دے گا، یا انھیں ذلیل کرے گا اور وہ اس کے محکوم بن جائیں گے۔‘‘ مزید دیکھیے سورۂ انبیاء (۴۴)۔ ¤ ➋ { وَ اللّٰهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهٖ:} کیونکہ اس کے فیصلے پر نظر ثانی کرکے اسے وہی بدل سکتا ہے جو اس پر غالب ہو، جب کہ ایسی کسی ہستی کا کہیں وجود ہی نہیں۔ ¤ ➌ { وَ هُوَ سَرِيْعُ الْحِسَابِ :} یعنی اس کے حساب لینے کا وقت نہایت تیزی کے ساتھ آ رہا ہے، حتیٰ کہ اس کے آنے پر مجرم قسمیں کھا کر کہیں گے کہ ہم دنیا میں صرف ایک گھڑی رہے ہیں۔ (روم : ۵۵) دوسرا مطلب یہ ہے کہ اسے حساب لینے میں ذرہ برابر دیر نہیں لگتی بلکہ قیامت کے دن پل بھر میں سارا حساب سامنے آ جائے گا۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت42){وَ قَدْ مَكَرَ الَّذِيْنَ … :} یعنی ان سے پہلے کفار نے بھی اپنے رسولوں کو ستانے اور اسلام کو نیچا دکھانے کی بہت تدبیریں کیں، یہ کوئی نئی بات آپ ہی کو پیش نہیں آ رہی، پھر کوئی تدبیر اللہ کی مشیت کے بغیر کچھ بھی نہیں کر سکتی، کیونکہ اختیار ہر چیز کا اسی کے ہاتھ میں ہے۔ سو اگر ان کی کوئی تدبیر کامیاب ہوئی تو وہ اللہ تعالیٰ کی حکمت ہی کا تقاضا تھا، لہٰذا آپ پریشان نہ ہوں۔ ان کافروں کو بھی بہت جلد معلوم ہو جائے گا کہ اس دنیا کے گھر کا اچھا انجام کس کے حق میں ہوتا ہے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت43) ➊ {لَسْتَ مُرْسَلًا: ’’ مُرْسَلًا ‘‘} کی تنوین کی وجہ سے ترجمہ ’’کسی طرح رسول‘‘ کیا گیا ہے۔ ¤ ➋ { وَ مَنْ عِنْدَهٗ عِلْمُ الْكِتٰبِ :} یعنی یہود و نصاریٰ کے علماء جیسے عبد اللہ بن سلام، سلمان فارسی، تمیم داری رضی اللہ عنھم اور ان میں سے دوسرے ایمان لانے والے۔ اہل کتاب کے علماء کی طرف رجوع کا حکم اس لیے دیا کہ مشرکین رسول اللہ صلی اللہ علیہ وسلم کے معاملے میں عموماً انھی کی طرف رجوع کرتے تھے اور ان کے علماء آپ صلی اللہ علیہ وسلم کی صفات اور آپ کے متعلق بشارتوں سے آپ کے سچا رسول ہونے کو خوب سمجھتے تھے، جیسے فرمایا : «{ يَعْرِفُوْنَهٗ كَمَا يَعْرِفُوْنَ اَبْنَآءَهُمْ }» [ البقرۃ : ۱۴۶] ’’وہ آپ کو پہچانتے ہیں جیسے اپنے بیٹوں کو پہچانتے ہیں۔‘‘ مزید دیکھیے سورۂ اعراف (۱۵۷) اور شعراء (۱۹۷)۔"
    }
  ]
}