{
  "surah": "Ibrahim ",
  "surah_number": 14,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت2،1) ➊ { الٓرٰ: } حروف مقطعات کے لیے دیکھیے سورۂ بقرہ کی پہلی آیت۔ ¤ ➋ {كِتٰبٌ اَنْزَلْنٰهُ اِلَيْكَ:’’ كِتٰبٌ ‘‘ } کو {’’ الٓرٰ ‘‘} کی خبر بنائیں تو معنی ہو گا کہ{’’ الٓرٰ ‘‘} ایک کتاب ہے، یعنی وہ حروف تہجی جن سے تمھارا کلام وجود میں آتا ہے، انھی سے یہ کتاب وجود میں آئی ہے، اگر مقابلے کی ہمت ہے تو آؤ انھی حروف سے تم صرف ایک سورت ہی بنا دو۔ ایک صورت یہ ہے کہ اسے مبتدا محذوف {’’هٰذَا‘‘} کی خبر بنا لیں، پھر معنی ہو گا، یہ ایک کتاب ہے۔ ’’نازل کیا‘‘ کے لفظ سے اس کا بلندی سے اترنا اور اللہ تعالیٰ کا بلندی پر ہونا ثابت ہوتا ہے۔ معلوم ہوا اللہ تعالیٰ کو نہ لامکان کہہ سکتے ہیں اور نہ ہر جگہ میں کہہ سکتے ہیں، بلکہ وہ بلند ہے، عرش پر ہے۔ ’’ہم نے اسے آپ کی طرف نازل کیا‘‘ سے اس کی عظمت ظاہر ہو رہی ہے۔ ¤ ➌ { لِتُخْرِجَ النَّاسَ:} یعنی یہ کتاب آپ پر نازل کی، تاکہ آپ اس کے ذریعے سے لوگوں کو گمراہی سے نکالیں۔ معلوم ہوا کہ منکرین حدیث جو کتاب یعنی قرآن ہی کو کافی سمجھتے ہیں اور رسول کو محض ڈاکیا قرار دیتے ہیں ان کی بات درست نہیں، بلکہ اللہ تعالیٰ نے یہ کتاب نازل فرما کر اس میں بار بار رسول کے اتباع اور اطاعت کا حکم دیا ہے، مثلاً دیکھیے آل عمران (۳۱، ۳۲)۔ ¤ ➍ {مِنَ الظُّلُمٰتِ اِلَى النُّوْرِ:} یعنی کفر کی تاریکیوں سے ایمان کی روشنی کی طرف۔ {’’ اِلٰى صِرَاطِ الْعَزِيْزِ الْحَمِيْدِ ‘‘} یہ {’’ اِلَى النُّوْرِ ‘‘} ہی سے بدل ہے اور اسی کی وضاحت ہے، یعنی وہ نور کیا ہے، اس عزیز و حمید کا راستہ ہے جس کا نام نامی اللہ ہے، وہ جو زمین و آسمان میں جو کچھ ہے سب کا اکیلا مالک ہے۔ لفظ{ ’’ الظُّلُمٰتِ ‘‘ } کو جمع اور{ ’’ النُّوْرِ ‘‘} کو واحد لانے سے صاف ظاہر ہے کہ نور یعنی راہ ہدایت صرف ایک ہے یعنی اسلام، جبکہ تاریکیاں اور گمراہیاں بے شمار ہیں جو سب کی سب کفر کی مختلف صورتیں ہیں۔ ¤ ➎ {بِاِذْنِ رَبِّهِمْ :} اس میں اس طرف اشارہ ہے کہ کوئی مبلغ، چاہے وہ نبی ہی کیوں نہ ہو، لوگوں کو اگر اسلام کی سیدھی راہ کی طرف لا سکتا ہے تو اللہ ہی کی دی ہوئی توفیق سے لا سکتا ہے۔ ابوطالب، آزر، ابن نوح اور نوح و لوط علیھما السلام کی بیویاں اس کی واضح مثالیں ہیں کہ رب کا اذن نہ ہونے کی وجہ سے کفر کے اندھیروں سے نہیں نکل سکے۔ ¤ ➏ { وَ وَيْلٌ لِّلْكٰفِرِيْنَ: ’’ وَيْلٌ ‘‘} پر تنوین تعظیم کی ہے، معنی ہے بڑی ہلاکت، یعنی دنیا میں بھی ان کے لیے بربادی ہی بربادی ہے۔( دیکھیے توبہ : ۵۵۔ طٰہٰ : ۱۲۴ تا ۱۲۷) اور قیامت کے دن تو ان کی اس سے بھی بڑھ کر شامت آنے والی ہے۔ دنیا میں کفار کے لیے {’’ وَيْلٌ ‘‘} کی ایک معمولی سی مثال یہ ہے کہ خودکشی کی شرح آپ سب سے زیادہ کفار میں پائیں گے، خصوصاً جو ان میں زیادہ ترقی یافتہ ہیں، مثلاً جاپان وغیرہ۔"
    },
    {
      "ayah": 1,
      "tafsir": "(آیت2،1) ➊ { الٓرٰ: } حروف مقطعات کے لیے دیکھیے سورۂ بقرہ کی پہلی آیت۔ ¤ ➋ {كِتٰبٌ اَنْزَلْنٰهُ اِلَيْكَ:’’ كِتٰبٌ ‘‘ } کو {’’ الٓرٰ ‘‘} کی خبر بنائیں تو معنی ہو گا کہ{’’ الٓرٰ ‘‘} ایک کتاب ہے، یعنی وہ حروف تہجی جن سے تمھارا کلام وجود میں آتا ہے، انھی سے یہ کتاب وجود میں آئی ہے، اگر مقابلے کی ہمت ہے تو آؤ انھی حروف سے تم صرف ایک سورت ہی بنا دو۔ ایک صورت یہ ہے کہ اسے مبتدا محذوف {’’هٰذَا‘‘} کی خبر بنا لیں، پھر معنی ہو گا، یہ ایک کتاب ہے۔ ’’نازل کیا‘‘ کے لفظ سے اس کا بلندی سے اترنا اور اللہ تعالیٰ کا بلندی پر ہونا ثابت ہوتا ہے۔ معلوم ہوا اللہ تعالیٰ کو نہ لامکان کہہ سکتے ہیں اور نہ ہر جگہ میں کہہ سکتے ہیں، بلکہ وہ بلند ہے، عرش پر ہے۔ ’’ہم نے اسے آپ کی طرف نازل کیا‘‘ سے اس کی عظمت ظاہر ہو رہی ہے۔ ¤ ➌ { لِتُخْرِجَ النَّاسَ:} یعنی یہ کتاب آپ پر نازل کی، تاکہ آپ اس کے ذریعے سے لوگوں کو گمراہی سے نکالیں۔ معلوم ہوا کہ منکرین حدیث جو کتاب یعنی قرآن ہی کو کافی سمجھتے ہیں اور رسول کو محض ڈاکیا قرار دیتے ہیں ان کی بات درست نہیں، بلکہ اللہ تعالیٰ نے یہ کتاب نازل فرما کر اس میں بار بار رسول کے اتباع اور اطاعت کا حکم دیا ہے، مثلاً دیکھیے آل عمران (۳۱، ۳۲)۔ ¤ ➍ {مِنَ الظُّلُمٰتِ اِلَى النُّوْرِ:} یعنی کفر کی تاریکیوں سے ایمان کی روشنی کی طرف۔ {’’ اِلٰى صِرَاطِ الْعَزِيْزِ الْحَمِيْدِ ‘‘} یہ {’’ اِلَى النُّوْرِ ‘‘} ہی سے بدل ہے اور اسی کی وضاحت ہے، یعنی وہ نور کیا ہے، اس عزیز و حمید کا راستہ ہے جس کا نام نامی اللہ ہے، وہ جو زمین و آسمان میں جو کچھ ہے سب کا اکیلا مالک ہے۔ لفظ{ ’’ الظُّلُمٰتِ ‘‘ } کو جمع اور{ ’’ النُّوْرِ ‘‘} کو واحد لانے سے صاف ظاہر ہے کہ نور یعنی راہ ہدایت صرف ایک ہے یعنی اسلام، جبکہ تاریکیاں اور گمراہیاں بے شمار ہیں جو سب کی سب کفر کی مختلف صورتیں ہیں۔ ¤ ➎ {بِاِذْنِ رَبِّهِمْ :} اس میں اس طرف اشارہ ہے کہ کوئی مبلغ، چاہے وہ نبی ہی کیوں نہ ہو، لوگوں کو اگر اسلام کی سیدھی راہ کی طرف لا سکتا ہے تو اللہ ہی کی دی ہوئی توفیق سے لا سکتا ہے۔ ابوطالب، آزر، ابن نوح اور نوح و لوط علیھما السلام کی بیویاں اس کی واضح مثالیں ہیں کہ رب کا اذن نہ ہونے کی وجہ سے کفر کے اندھیروں سے نہیں نکل سکے۔ ¤ ➏ { وَ وَيْلٌ لِّلْكٰفِرِيْنَ: ’’ وَيْلٌ ‘‘} پر تنوین تعظیم کی ہے، معنی ہے بڑی ہلاکت، یعنی دنیا میں بھی ان کے لیے بربادی ہی بربادی ہے۔( دیکھیے توبہ : ۵۵۔ طٰہٰ : ۱۲۴ تا ۱۲۷) اور قیامت کے دن تو ان کی اس سے بھی بڑھ کر شامت آنے والی ہے۔ دنیا میں کفار کے لیے {’’ وَيْلٌ ‘‘} کی ایک معمولی سی مثال یہ ہے کہ خودکشی کی شرح آپ سب سے زیادہ کفار میں پائیں گے، خصوصاً جو ان میں زیادہ ترقی یافتہ ہیں، مثلاً جاپان وغیرہ۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت3) ➊ { الَّذِيْنَ يَسْتَحِبُّوْنَ الْحَيٰوةَ الدُّنْيَا عَلَى الْاٰخِرَةِ : ’’ يَسْتَحِبُّوْنَ ‘‘} سین اور تاء کے اضافے سے معنی میں اضافہ ہو گیا، یعنی اللہ تعالیٰ کو تو آخرت کے مقابلے میں دنیا کو محبوب رکھنا ہی پسند نہیں جبکہ یہ کفار آخرت کے مقابلے میں دنیا کو بہت زیادہ محبوب رکھتے ہیں۔ معلوم ہوا کہ دنیا کی چیزوں سے محبت اس وقت بربادی کا باعث ہے جب وہ اللہ کی محبت کے مقابلے میں غالب ہو، ورنہ دنیا سے فائدہ مومن کے لیے بھی جائز ہے، بلکہ اللہ کی محبت کے تحت اور اس کے احکام کے تحت اپنے بیوی بچوں، دوستوں اور مال وغیرہ سے محبت فطری چیز ہے اور ان کے حقوق کی ادائیگی سے اجر ملتا ہے۔ اس کے برعکس رہبانیت اس فطرت سے جنگ ہے جو اللہ تعالیٰ کو پسند نہیں۔ ¤ ➋ {وَ يَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ … :} یعنی اللہ کی راہ جو بالکل سیدھی اور بے عیب ہے، کافر اس میں عیب نکالنے کی کوشش کرتے ہیں اور اسے ٹیڑھی بتاتے ہیں، تاکہ لوگوں کو اس کے اختیار کرنے سے باز رکھ سکیں۔ (ابن کثیر)"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت4) ➊ {لِيُبَيِّنَ لَهُمْ:} تاکہ وہ ان کے لیے کھول کر بیان کرے اور وہ اچھی طرح سمجھ سکیں اور ان پر حجت قائم ہو سکے۔ رسول اللہ صلی اللہ علیہ وسلم سے پہلے جتنے پیغمبر بھیجے گئے وہ اپنی اپنی قوم کی طرف بھیجے گئے، وہ پیغمبر اس قوم کا ایک فرد ہوتا تھا اور وہ انھی کی زبان بولتا تھا، آپ صلی اللہ علیہ وسلم کی بعثت گو عام ہے اور قیامت تک کے تمام جن و انس کے لیے ہے، لیکن آپ کی قوم، جس میں آپ صلی اللہ علیہ وسلم پیدا ہوئے اور جو آپ صلی اللہ علیہ وسلم کی اولین مخاطب تھی، عربی زبان بولتی تھی، اس لیے طبعی ترتیب کے مطابق آپ نے ان کو اللہ کا پیغام عربی زبان میں پہنچایا، مقصد یہ تھا کہ پہلے یہ قوم اس پیغام کو سمجھے اور پھر اسے دوسروں تک پہنچانے اور سمجھانے کا ذریعہ بنے۔ اگر قرآن تمام زبانوں میں نازل کیا جاتا تو تنازع، اختلاف اور تحریف احکام کے دروازے کھل جاتے اور دعوتِ اسلام کے لیے کسی مقام پر بھی مرکزیت قائم نہ ہو سکتی۔ عربی زبان میں نازل ہونے کے بعد دوسری اقوام کا عربی سیکھنا (جو تمام زبانوں سے آسان ہے) یا اس کا دوسری زبانوں میں ترجمہ ہو جانا تمام اقوام کی ہدایت کے لیے کافی ہے، جیسا کہ الحمد للہ ہو رہا ہے۔ ¤ ➋ { فَيُضِلُّ اللّٰهُ مَنْ يَّشَآءُ …:} یعنی گو ہر پیغمبر اپنی دعوت اسی زبان میں پیش کرتا ہے جسے ساری قوم سمجھتی ہے، تاہم ہدایت و ضلالت کا معاملہ اللہ تعالیٰ کے ہاتھ میں ہے، اللہ تعالیٰ ہی جسے چاہتا ہے ہدایت دیتا ہے اور جسے چاہتا ہے گمراہی میں پڑا رہنے دیتا ہے۔ آج بھی بہت سی عجمی قومیں اسلام کی حامی اور مددگار نظر آتی ہیں اور عرب ممالک باوجود عربی زبان کی خدمت و اشاعت کے اسلام سے منحرف اور دور ہو رہے ہیں۔ (الا ما شاء اللہ)"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت5) ➊ {وَ لَقَدْ اَرْسَلْنَا مُوْسٰى بِاٰيٰتِنَاۤ …:} اللہ تعالیٰ نے شروع سورت میں ہمارے نبی صلی اللہ علیہ وسلم کی طرف نازل کردہ کتاب کا ذکر فرمایا اور اس کا مقصد بتایا کہ آپ لوگوں کو اندھیروں سے روشنی کی طرف نکالیں۔ اب پہلے انبیاء کی اپنی اقوام کو تاریکیوں سے روشنی کی طرف لانے کی کوششوں اور ان کی اقوام کے سلوک کا ذکر فرمایا۔ سب سے پہلے موسیٰ علیہ السلام کا، پھر دوسری اقوام اور ان کے رسولوں کا ذکر فرمایا۔ اللہ تعالیٰ نے موسیٰ علیہ السلام کو کچھ آیات کونیہ عطا فرمائیں، یعنی کائنات کے معمول کے خلاف معجزے، جن کے مقابلے سے دشمن عاجز تھا۔ جن میں سے چند کا تعلق فرعون اور اس کی قوم سے تھا، مثلاً عصائے موسیٰ، ید بیضاء (طٰہٰ : ۱۷ تا ۲۲)، قحط سالی، پھلوں کی کمی، طوفان، ٹڈیاں، جوئیں، مینڈک اور خون۔ (اعراف : ۱۳۳) یہ سب معجزے نبوت کی دلیل کے طور پر دیے گئے، کیونکہ مخاطب فرعون بے حد ضدی، سرکش، خدائی کا دعوے دار اور نہایت بے رحم تھا۔ جب کہ ہمارے نبی کریم صلی اللہ علیہ وسلم کو نبوت کی دلیل کے طور پر صرف ایک معجزہ ’’قرآن‘‘ عطا ہوا، باقی تمام معجزات برکت اور اہل ایمان کا ایمان بڑھانے کے لیے تھے۔ موسیٰ علیہ السلام کے کئی معجزوں کا تعلق بنی اسرائیل سے تھا، مثلاً سمندر کا پھٹنا، فرعون سے نجات، بادلوں کا سایہ، من و سلویٰ کا اترنا، بارہ چشمے پھوٹنا، پہاڑ اکھیڑ کر عہد لیا جانا، گائے کا گوشت لگنے سے مردے کا زندہ ہونا وغیرہ اور کچھ وحی الٰہی کی آیات تھیں جنھیں ’’تنزیلی آیات‘‘ کہتے ہیں۔ موسیٰ علیہ السلام پر سب سے پہلی وحی تورات سے بہت پہلے مدین سے واپسی پر اتری، پھر اسی طرح کسی کتابی صورت کے بغیر سالہا سال اترتی رہی۔ فرعون اسی وحی کے احکام کی نافرمانی کی وجہ سے غرق ہوا۔ پھر اللہ تعالیٰ نے موسیٰ علیہ السلام کو طور پر بلا کر تورات عطا فرمائی۔ غرض موسیٰ علیہ السلام کو تو تورات کے علاوہ بھی بہت سی آیات عطا فرمائیں، کیونکہ دشمن نہایت سخت تھا اور اپنی قوم خوئے غلامی کی وجہ سے بے حد متلون مزاج، کافرانہ عقائد و رسوم سے متاثر اور بار بار مطالبے کرنے والی تھی۔ اوپر تقریباً سترہ آیات (نشانیوں) کا ذکر ہوا ہے، مقصد سب کا یہی تھا کہ وہ فرعون کو اور اپنی قوم کو کفر کی تاریکیوں سے ایمان کی روشنی کی طرف نکالیں۔ ¤ ➋ {وَ ذَكِّرْهُمْ بِاَيّٰىمِ اللّٰهِ … : ’’أَيَّامٌ‘‘} سے مراد وہ دن ہیں جن میں کوئی نادر واقعہ مصیبت یا نعمت کی صورت میں پیش آیا ہو، جیسے یوم بدر وغیرہ۔ {’’أَيَّامٌ‘‘} کی اللہ کی طرف اضافت سے ان کی اہمیت بے حد بڑھ گئی۔ اگلی آیت میں چند {’’أَيَّامٌ‘‘} کا ذکر ہے، مگر ان واقعات سے عبرت صرف انھی کو ہوتی ہے جو بہت صابر اور بہت شاکر ہوں، کیونکہ ہر نیکی کی بنیاد صبر ہے اور شکر بھی اسی کو نصیب ہوتا ہے جو صابر ہو، شکوہ شکایت اور بے صبری کرنے والوں کو شکر کی توفیق کہاں؟"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت6) ➊ {وَ اِذْ قَالَ مُوْسٰى لِقَوْمِهِ اذْكُرُوْا …:} یہاں موسیٰ علیہ السلام چند نعمتیں گنوا رہے ہیں۔ {’’ يَسُوْمُوْنَكُمْ۠ ‘‘} کے بعد {’’ وَ يُذَبِّحُوْنَ اَبْنَآءَكُمْ وَ يَسْتَحْيُوْنَ نِسَآءَكُمْ ‘‘} میں واؤ عطف سے معلوم ہوا کہ وہ لڑکوں کو ذبح کرنے اور عورتوں کو زندہ رکھنے کے علاوہ اور بھی کئی بدترین عذاب دیتے تھے، مثلاً بیگار لینا، ذلیل کرنا اور مار پیٹ وغیرہ۔ ¤ ➋ {وَ فِيْ ذٰلِكُمْ بَلَآءٌ مِّنْ رَّبِّكُمْ عَظِيْمٌ : ’’ بَلَآءٌ ‘‘} کا لفظ مصیبت پر بھی آتا ہے اور نعمت پر بھی، فرمایا : «{ وَ نَبْلُوْكُمْ بِالشَّرِّ وَ الْخَيْرِ فِتْنَةً }» [ الأنبیاء : ۳۵ ] ’’اور ہم تمھیں برائی اور بھلائی میں مبتلا کرتے ہیں، آزمانے کے لیے۔‘‘ آل فرعون کے عذاب بلائے مصیبت تھے اور ان سے نجات بلائے نعمت تھی، عذاب بھی آزمائش اور اس سے رہائی کا انعام بھی آزمائش۔ {’’ ذٰلِكُمْ ‘‘} سے اشارہ {’’ سُوْٓءَ الْعَذَابِ ‘‘} کی طرف ہو تو مصیبت کے ساتھ آزمائش مراد ہے اور {’’ اِذْ اَنْجٰىكُمْ ‘‘} یعنی نجات کی طرف ہو تو نعمت کے ساتھ آزمائش مراد ہو گی اور قرآن کا اعجاز ہے کہ آیت کے ایک لفظ میں دونوں چیزیں آگئی ہیں۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت7) ➊ { وَ اِذْ تَاَذَّنَ رَبُّكُمْ : ’’آذَنَ يُؤْذِنُ‘‘} کا معنی اطلاع دینا، اعلان کرنا ہے۔ باب تفعل میں جانے سے معنی میں اضافہ ہو گیا، اس لیے ترجمہ کیا ہے ’’صاف اعلان کر دیا۔‘‘ ¤ ➋ { لَىِٕنْ شَكَرْتُمْ لَاَزِيْدَنَّكُمْ:} کیونکہ کسی کے بھی احسان کی قدر دانی اور اس کا شکریہ ادا کرنے سے اس کے ساتھ تعلق بڑھتا ہے، پھر اللہ تعالیٰ کا توکہنا ہی کیا ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَلَا شَخْصَ أَحَبُّ إِلَيْهِ الْمِدْحَةُ مِنَ اللّٰهِ، مِنْ أَجْلِ ذٰلِكَ وَعَدَ اللّٰهُ الْجَنَّةَ ] [ مسلم، اللعان : ۱۴۹۹ ]’’کوئی شخص ایسا نہیں جسے اللہ تعالیٰ سے زیادہ اپنی تعریف پسند ہو، اسی لیے اللہ تعالیٰ نے جنت کا وعدہ کیا ہے۔‘‘ جب اللہ تعالیٰ کو زبانی شکر اتنا پسند ہے تو عملاً شکر اور اطاعت پر اس کی نوازش کس قدر ہو گی۔ ¤ ➌ { وَ لَىِٕنْ كَفَرْتُمْ :} اس کا جواب تو یہ تھا {’’لَأُعَذِّبَنَّكُمْ‘‘} کہ اگر تم کفر کرو گے تو میں تمھیں ضرور عذاب دوں گا، مگر اسے حذف کرکے ایسا جملہ استعمال فرمایا جو اس جملے کا مفہوم بھی ادا کرتا ہے اور اللہ تعالیٰ کے عذاب کی نہایت شدت کو بھی، یعنی فرمایا : «{وَ لَىِٕنْ كَفَرْتُمْ اِنَّ عَذَابِيْ لَشَدِيْدٌ }» اور یہ بھی قرآن کا اعجاز ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت8){وَ قَالَ مُوْسٰۤى اِنْ تَكْفُرُوْۤا …:} یعنی اگر تم اور زمین و آسمان کے تمام لوگ ناشکری کرو تو اس ناشکری کا نقصان خود تمھی کو پہنچے گا، اللہ تعالیٰ کا کچھ نہیں بگڑے گا، اسے نہ تمھارے شکر کی ضرورت ہے اور نہ تمھاری ناشکری کی پروا۔ اس کی ذات ہر تعریف کی حامل ہے، چاہے کوئی اس کی تعریف کرے یا نہ کرے۔ ابوذر غفاری رضی اللہ عنہ حدیث قدسی روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَا عِبَادِيْ! لَوْ أَنَّ أَوَّلَكُمْ وَ آخِرَكُمْ، وَ إِنْسَكُمْ وَ جِنَّكُمْ، كَانُوْا عَلٰی أَتْقٰی قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا زَادَ ذٰلِكَ فِيْ مُلْكِيْ شَيْئًا، يَا عِبَادِيْ ! لَوْ أَنَّ أَوَّلَكُمْ وَ آخِرَكُمْ، وَ إِنْسَكُمْ وَ جِنَّكُمْ، كَانُوْا عَلٰی أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا نَقَصَ ذٰلِكَ مِنْ مُلْكِيْ شَيْئًا، يَا عِبَادِيْ! لَوْ أَنَّ أَوَّلَكُمْ وَ آخِرَكُمْ، وَ إِنْسَكُمْ وَ جِنَّكُمْ، قَامُوْا فِيْ صَعِيْدٍ وَاحِدٍ فَسَأَلُوْنِيْ، فَأَعْطَيْتُ كُلَّ إِنْسَانٍ مَسْأَلَتَهُ، مَا نَقَصَ ذٰلِكَ مِمَّا عِنْدِيْ إِلاَّ كَمَا يَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ ] [ مسلم، البر والصلۃ، باب تحریم الظلم : ۲۵۷۷ ] ’’اللہ تعالیٰ فرماتا ہے، اے میرے بندو! اگر تمھارے پہلے، تمھارے پچھلے اور تمھارے انسان اور تمھارے جن تم میں سب سے زیادہ تقویٰ والے آدمی کے دل والے ہو جائیں تو یہ چیز میری سلطنت میں کسی شے کا اضافہ نہیں کرے گی اور اے میرے بندو! اگر تمھارے پہلے اور تمھارے پچھلے، تمھارے انسان اور تمھارے جن تم میں سب سے زیادہ فاجر شخص کے دل والے ہو جائیں تو یہ چیز میری سلطنت میں کسی شے کی کمی نہیں کرے گی اور اے میرے بندو! اگر تمھارے پہلے، تمھارے پچھلے اور تمھارے انسان اور تمھارے جن ایک میدان میں کھڑے ہو جائیں، پھر مجھ سے مانگیں اور میں ہر شخص کو جو اس نے مانگا ہے دے دوں تو یہ چیز اس میں سے جو میرے پاس ہے کچھ کمی نہیں کرے گی، مگر جتنا سوئی جب وہ سمندرمیں داخل کی جائے۔‘‘"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت9) ➊ { لَا يَعْلَمُهُمْ اِلَّا اللّٰهُ :} یعنی اللہ تعالیٰ ہی ان کی تعداد اور تمام حالات سے واقف ہے اور ان کے نسب کو بھی صحیح طور پر اللہ تعالیٰ کے سوا کوئی نہیں جانتا۔ ¤ ➋ { فَرَدُّوْۤا اَيْدِيَهُمْ فِيْۤ اَفْوَاهِهِمْ :} یعنی غصے کے مارے اپنے ہاتھ کاٹنے لگے، جیسا کہ دوسری آیت میں منافقین کے متعلق فرمایا : «{ وَ اِذَا خَلَوْا عَضُّوْا عَلَيْكُمُ الْاَنَامِلَ مِنَ الْغَيْظِ }» [ آل عمران : ۱۱۹ ] ’’اور (یہ منافقین) جب اکیلے ہوتے ہیں تو تم پر غصے سے انگلیوں کی پوریں کاٹ کاٹ کھاتے ہیں۔‘‘ یا ہنسی اور تعجب کے مارے منہ پر ہاتھ رکھ لیے، یا ہاتھ منہ کی طرف لے جا کر اشارہ کیا کہ بس چپ رہو۔ پہلے معنی کو اکثر مفسرین نے ترجیح دی ہے، ایک معنی یہ بھی ہو سکتا ہے کہ ان لوگوں نے اپنے ہاتھ رسولوں کے منہ پر رکھ دیے کہ وہ خاموش رہیں۔ ¤ ➌ {وَ قَالُوْۤا اِنَّا كَفَرْنَا بِمَاۤ اُرْسِلْتُمْ بِهٖ … : ’’ بِمَاۤ اُرْسِلْتُمْ بِهٖ ‘‘} کے الفاظ سے معلوم ہوا کہ پیغمبروں کی نشانیاں دیکھ کر وہ یہ ضرور جان چکے تھے کہ ان رسولوں کو یہ معجزے دے کر بھیجا گیا ہے، یہ رسول خود یہ معجزے نہیں لے آئے۔ اس لیے اگرچہ انھوں نے توحید کی دعوت ماننے سے انکار کر دیا، مگر اپنے کفر پر بھی ان کا یقین متزلزل ہو گیا اور انھوں نے کہا کہ ہم تمھاری دعوت کے بارے میں ایک بے چین رکھنے والے شک میں مبتلا ہیں۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت10) ➊ { قَالَتْ رُسُلُهُمْ اَفِي اللّٰهِ شَكٌّ … :} رسولوں نے یہاں کوئی منطقی و فلسفی بحث نہیں چھیڑی، بلکہ ان کی فطرت کو جھنجوڑا کہ ہر شخص سمجھتا ہے کہ چھوٹی سے چھوٹی چیز حتیٰ کہ سوئی یا کوئی کھلونا بھی بنانے والے کے بغیر نہیں بنتا۔ رازی نے اس کی ایک مثال دی کہ دو بچوں میں سے ایک بچہ دوسرے کو پیچھے سے سر پر ایک چپت لگا کر چھپ جائے تو وہ کبھی یہ نہیں مانے گا کہ یہ چپت خود بخود لگ گئی ہے، بلکہ اسے یقین ہو گا کہ یہ کسی نے ماری ہے۔ تو کسی بھی کام کے خودبخود ہو جانے کو تو ایک بچے کی فطرت بھی تسلیم نہیں کرتی، تو عاقل و بالغ ہو کر تمھیں اس اللہ کے متعلق شک ہے جس نے اتنے عظیم آسمان و زمین بنائے، جن کے مقابلے میں تمھارا بنانا کچھ بھی مشکل نہیں کہ وہ اللہ ہے بھی یا نہیں؟ اور ایک ہے یا کئی ہیں؟ {’’شَكٌّ ‘‘} کی تنوین تنکیر کے لیے ہے، یعنی کیا اللہ کے بارے میں کوئی بھی شک ہے؟ یہ استفہام انکاری ہے، یعنی اس کے متعلق کسی قسم کے شک کی تو گنجائش ہی نہیں۔ ¤ ➋ {مِنْ ذُنُوْبِكُمْ:’’ مِنْ ‘‘} تبعیض کے لیے ہے، یعنی تاکہ تمھارے بعض یا کچھ گناہ بخش دے۔ مطلب یہ ہے کہ اسلام لانے سے پہلے کے گناہ اسلام لانے سے معاف ہو جائیں گے، آئندہ کے گناہ تمھارے عمل اور توبہ کے مطابق دیکھے جائیں گے۔ کفار کے گناہوں کی معافی کا ذکر ہر جگہ {’’ مِنْ ‘‘} (بعض) کے ساتھ آیا ہے، جیسا کہ یہاں اور سورۂ نوح اور احقاف میں ہے، البتہ اہل ایمان کی مغفرت کا ذکر {’’مِنْ‘‘} کے بغیر ہے، جیسا کہ سورۂ صف میں جہاد کا اجر بیان کرتے ہوئے فرمایا : «{ يَغْفِرْ لَكُمْ ذُنُوْبَكُمْ }» [الصف : ۱۲ ] ’’وہ تمھیں تمھارے گناہ بخش دے گا۔‘‘ ¤ ➌ { وَ يُؤَخِّرَكُمْ اِلٰۤى اَجَلٍ مُّسَمًّى :} یعنی دنیا میں موت کے وقت تک تمھیں عذاب سے محفوظ رکھے۔ (قرطبی) ¤ ➍ { قَالُوْۤا اِنْ اَنْتُمْ اِلَّا بَشَرٌ مِّثْلُنَا :} یعنی تم ظاہری شکل و صورت میں، کھانے پینے میں اور دوسری انسانی ضروریات کے اعتبار سے ہمارے جیسے بشر ہو، ہم اپنے آپ پر تمھاری برتری کیسے تسلیم کر لیں۔ مقصد تمھارا ہمیں ہمارے آباء و اجداد کے معبودوں کی عبادت سے روکنا ہے۔ تعجب اس بات پر ہوتا ہے کہ یہی کفار جو دین اور آخرت کے معاملے میں اپنے آباء کی تقلید کی بنا پر اللہ تعالیٰ کے وجود اور اس کی توحید سے انکار پر اصرار کر رہے ہیں، اتنا سوچنے کی زحمت نہیں کرتے کہ دنیا کے کاموں میں بھی وہ آباء کی تقلید کرتے تو دنیا کے ہر دور میں انھوں نے جو ترقی کی، حتیٰ کہ اب ایٹم بم تک پہنچ گئے، یہ ترقی کبھی نہ ہو سکتی، مگر ان کی ڈھٹائی دیکھو کہ انبیاء کے واضح معجزات دیکھ کر اور {’’ اَفِي اللّٰهِ شَكٌّ فَاطِرِ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} جیسی لاجواب دلیلیں سن کر بھی، جنھوں نے انھیں اندر سے ہلا دیا اور وہ اپنے بے چین رکھنے والے شک کا خود اقرار کر رہے ہیں، تقلید پر اڑے ہوئے ہیں اور مزید واضح دلیل کا مطالبہ کر رہے ہیں، مگر دنیوی معاملات میں وہ آباء کی تقلید پر اکتفا کرنے کے لیے ہرگز تیار نہیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت11) ➊ { وَ لٰكِنَّ اللّٰهَ يَمُنُّ عَلٰى مَنْ يَّشَآءُ … :} معلوم ہوا دلیل دیکھنے سے ایمان نہیں آتا، اللہ تعالیٰ کے عطا کرنے سے آتا ہے۔ (موضح) ¤ ➋ اس آیت سے یہ بھی معلوم ہوا کہ نبوت سراسر وہبی، یعنی اللہ تعالیٰ کی دین ہے۔ اس کے لائق افراد کا انتخاب وہ خود کرتا ہے، فرمایا : «{ وَ لٰكِنَّ اللّٰهَ يَجْتَبِيْ مِنْ رُّسُلِهٖ مَنْ يَّشَآءُ }» [ آل عمران : ۱۷۹ ] ’’اور لیکن اللہ اپنے رسولوں میں سے جسے چاہتا ہے چن لیتا ہے۔‘‘ نبوت کسی کو محنت اور ریاضت سے حاصل نہیں ہوتی، جیسا کہ بعض گمراہ لوگوں کا خیال ہے، جن میں قادیانی دجال بھی شامل ہے۔ ¤ ➌ { وَ مَا كَانَ لَنَاۤ اَنْ نَّاْتِيَكُمْ … :} یعنی معجزات ہمارے اختیار میں نہیں، وہ اللہ کے حکم کے بغیر ظاہر نہیں ہوتے، اس لیے ہمارا بھروسا اللہ ہی پر ہے اور تمام اہل ایمان کو اسی پر بھروسا لازم ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت12){وَ مَا لَنَاۤ اَلَّا نَتَوَكَّلَ عَلَى اللّٰهِ … :} یعنی اللہ تعالیٰ نے جب ہمیں ہدایت دے دی تو اس کے بعد ہمارے پاس کیا عذر ہے کہ ہم اس کے بھروسے پر استقامت اختیار نہ کریں۔ رہا تمھارا ہمیں ایذا دینا تو ہم ہر حال میں اس پر صبر کریں گے اور اپنے رب پر بھروسا رکھیں گے، کیونکہ بھروسا رکھنے والوں کو اسی پر بھروسا رکھنا لازم ہے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت13) ➊ {وَ قَالَ الَّذِيْنَ كَفَرُوْا لِرُسُلِهِمْ لَنُخْرِجَنَّكُمْ مِّنْ اَرْضِنَاۤ: } کفار نے اپنی کثرت اور اہل ایمان کی قلت دیکھ کر اپنے رسولوں کو یہ دھمکی دی کہ تمھارے سامنے صرف دو راستے ہیں یا تو ہم تمھیں اپنی زمین سے نکال دیں گے، یا پھر تم اسلام چھوڑ کر واپس آ جاؤ گے، جیسا کہ اس وقت ہند کے کافر مسلمانوں کو قتل یا ارتداد یا نکل جانے کی دھمکیاں دے رہے ہیں۔ ¤ ➋ { اَوْ لَتَعُوْدُنَّ فِيْ مِلَّتِنَا :} ’’یا تم ہماری ملت میں واپس آؤ گے‘‘ کفار کا یہ کہنا ان کے اپنے گمان کے مطابق تھا، ورنہ یہ مطلب نہیں کہ انبیاء علیھم السلام نبوت پر سرفراز ہونے سے پہلے اپنی گمراہ قوم کے دین کی پیروی کرتے تھے، بلکہ بات یہ تھی کہ نبوت سے پہلے انبیاء علیھم السلام ان کے بتوں کے معاملہ میں خاموش رہتے تھے، جس پر انھوں نے بطور خود یہ سمجھ لیا تھا کہ وہ ان کے مذہب پر ہیں، یا اس {’’ لَتَعُوْدُنَّ ‘‘} کا معنی {’’ لَتَصِيْرُنَّ ‘‘} ہے، یعنی تم ہماری ملت میں آ جاؤ گے۔ (دیکھیے اعراف : ۸۸) یا خطاب ان لوگوں سے ہے جو کفر کو چھوڑ کر پیغمبروں پر ایمان لے آئے تھے۔ (رازی)"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت14){ وَ لَنُسْكِنَنَّكُمُ الْاَرْضَ مِنْۢ بَعْدِهِمْ …:} یعنی اللہ تعالیٰ نے وحی کے ذریعے سے انھیں حوصلہ دیا کہ ہم ان ظالموں کو ہلاک کریں گے اور اس سرزمین پر تمھیں آباد کریں گے۔ انبیاء کے پیروکاروں کا آخر کار کفار کے علاقوں پر قابض ہونا بھی درحقیقت انبیاء ہی کا غلبہ ہے، جیسا کہ بنی اسرائیل موسیٰ علیہ السلام کی وفات کے ایک مدت بعد شام اور مصر وغیرہ پر قابض ہوئے، فرمایا : «{ كَذٰلِكَ وَ اَوْرَثْنٰهَا بَنِيْۤ اِسْرَآءِيْلَ }» [الشعراء : ۵۹ ] ’’ایسے ہی ہوا اور ہم نے ان کا وارث بنی اسرائیل کو بنا دیا۔‘‘ اور مسلمان اگرچہ نبی صلی اللہ علیہ وسلم کی زندگی ہی میں جزیرۂ عرب پر قابض ہو گئے تھے، جیسا کہ یہود کے متعلق فرمایا : «{ وَ اَوْرَثَكُمْ اَرْضَهُمْ وَ دِيَارَهُمْ وَ اَمْوَالَهُمْ وَ اَرْضًا لَّمْ تَطَـُٔوْهَا وَ كَانَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ قَدِيْرًا}» [ الأحزاب : ۲۷ ] ’’اور (اے مسلمانو!) تمھیں ان کی زمین اور ان کے گھروں اور ان کے مالوں کا وارث بنا دیا اور اس زمین کا بھی جس پر تم نے قدم نہیں رکھا تھا اور اللہ ہمیشہ سے ہر چیز پر پوری طرح قادر ہے۔‘‘ مگر زمین کے مشارق و مغارب کی فتوحات آپ صلی اللہ علیہ وسلم کی وفات کے بعد ہوئیں اور یہ بھی درحقیقت نبی صلی اللہ علیہ وسلم ہی کی فتوحات تھیں، کیونکہ ان کے دین اور ان کے پیروکاروں کی فتوحات تھیں۔ {’’ وَعِيْدِ ‘‘} اصل میں{ ’’وَعِيْدِيْ‘‘} تھا، ’’میری وعید‘‘ آیات کے آخری حصوں کی موافقت کے لیے یاء حذف کرکے کسرہ باقی رکھا گیا۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت15){وَ اسْتَفْتَحُوْا …: } فتح کا معنی قرآن مجید میں ’’فتح و نصرت‘‘ بھی آیا ہے اور ’’فیصلہ‘‘ بھی۔ {’’ اسْتَفْتَحُوْا ‘‘} کا معنی انھوں نے فتح و نصرت مانگی، یا انھوں نے فیصلہ مانگا اور اس کا فاعل پیغمبر بھی ہو سکتے ہیں اور کفار بھی۔ اگر معنی فتح و نصرت ہو تو مطلب یہ ہو گا کہ پیغمبروں نے بے شمار آزمائشیں آنے پر اپنے رب سے فتح و نصرت کی دعا کی جو قبول ہوئی، فرمایا : «{ حَتّٰى يَقُوْلَ الرَّسُوْلُ وَ الَّذِيْنَ اٰمَنُوْا مَعَهٗ مَتٰى نَصْرُ اللّٰهِ اَلَاۤ اِنَّ نَصْرَ اللّٰهِ قَرِيْبٌ }» [ البقرۃ : ۲۱۴ ] ’’یہاں تک کہ رسول اور جو لوگ اس کے ساتھ ایمان لائے تھے کہہ اٹھے، اللہ کی مدد کب ہو گی؟ سن لو بے شک! اللہ کی مدد قریب ہے۔‘‘ اگر {’’ اسْتَفْتَحُوْا ‘‘} کا فاعل کفار ہوں تو مطلب یہ ہو گا کہ ’’کافروں نے اپنے داتاؤں اور دستگیروں سے فتح و نصرت کی دعا مانگی مگر وہ ناکام ہوئے۔‘‘ اگر فتح کا معنی فیصلہ ہو تو مطلب ہو گا کہ پیغمبروں اور ان پر ایمان لانے والوں نے اللہ تعالیٰ سے دعا کی، فرمایا : «{ رَبَّنَا افْتَحْ بَيْنَنَا وَ بَيْنَ قَوْمِنَا بِالْحَقِّ وَ اَنْتَ خَيْرُ الْفٰتِحِيْنَ }» [ الأعراف : ۸۹ ] ’’اے ہمارے رب! تو ہمارے درمیان اور ہماری قوم کے درمیان حق کے ساتھ فیصلہ فرما اور تو سب فیصلہ کرنے والوں سے بہتر ہے۔‘‘ نتیجہ یہ ہوا کہ ہر سرکش و سخت عناد رکھنے والا ناکام و نامراد ہوا۔ یا مطلب یہ ہے کہ کفار نے اللہ تعالیٰ سے فیصلے کی دعا کی، فرمایا : «{ وَ اِذْ قَالُوا اللّٰهُمَّ اِنْ كَانَ هٰذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَاَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَآءِ اَوِ ائْتِنَا بِعَذَابٍ اَلِيْمٍ }» [ الأنفال : ۳۲ ] ’’اور جب انھوں نے کہا کہ اے اللہ! اگر صرف یہی تیری طرف سے حق ہے تو ہم پر آسمان سے پتھروں کی بارش برسا، یا ہم پر کوئی دردناک عذاب لے آ۔‘‘ {’’ اسْتَفْتَحُوْا ‘‘ } کے ان چاروں معنوں میں سے جو معنی بھی کریں وہ درست ہے اور قرآن مجید کے مختلف مقامات پر چاروں معانی موجود ہیں۔ قرآن کا اعجاز دیکھیے کہ ایک ہی لفظ ایسا بولا جو چاروں پر صادق آتا ہے۔ غرض دنیا میں نتیجہ یہ نکلا کہ ہر سرکش اور سخت عناد رکھنے والا کافر ناکام اور نامراد ہوا۔ رہا آخرت کا انجام تو وہ آئندہ آیت میں مذکور ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت16){مِنْ وَّرَآىِٕهٖ جَهَنَّمُ وَ يُسْقٰى مِنْ مَّآءٍ صَدِيْدٍ : ’’وَرَآءٌ‘‘} کے متعدد معانی آئے ہیں : 1 پیچھے یا بعد، جیسے فرمایا : «{ وَ مِنْ وَّرَآءِ اِسْحٰقَ يَعْقُوْبَ }» [ ھود : ۷۱ ] ’’اور اسحاق کے بعد یعقوب کی بشارت دی۔‘‘ 2 غیر یعنی سوا، جیسے فرمایا : «{ فَمَنِ ابْتَغٰى وَرَآءَ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْعٰدُوْنَ }» [ المؤمنون : ۷ ] ’’پھر جو اس کے سوا تلاش کرے تو وہی لوگ حد سے بڑھنے والے ہیں۔‘‘ 3 آگے، جیسا کہ سورۂ کہف (۷۹) میں {’’ وَ كَانَ وَرَآءَهُمْ مَّلِكٌ ‘‘} کا معنی ’’ان کے آگے ایک بادشاہ تھا‘‘ کیا گیا ہے۔ یہاں مراد بعد بھی ہو سکتا ہے کہ دنیا کی ناکامی کے بعد اس کے لیے جہنم ہے اور آگے بھی کہ آئندہ جہنم اس کے انتظار میں ہے۔ {’’صَدِيْدٍ ‘‘} وہ رقیق پانی جو زخم سے نکلتا ہے، مراد اہلِ جہنم کے جلنے سے ان کے جسموں سے نکلنے والی پیپ، خون اور رطوبت ہے۔ مزید دیکھیے سورۂ صٓ (۵۷، ۵۸)، محمد (۱۵) اور کہف (۲۹) {’’ مَآءٍ صَدِيْدٍ ‘‘} مبدل منہ اور بدل ہے، یعنی ایسا پانی جو ’’صدید ‘‘ ہو گا۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت17) ➊ {يَتَجَرَّعُهٗ :} یہ باب تفعل سے ہے، جس میں تکلف کا معنی ہوتا ہے، یعنی مشکل سے ایک ایک گھونٹ کرکے اسے پیے گا اور وہ اتنا کڑوا، بدذائقہ، بدبو دار اور گرم ہو گا کہ قریب نہیں کہ گلے سے اتار سکے، مگر پیاس کا عذاب اسے پینے پر مجبور کرے گا اور اندر جا کر وہ ان کی انتڑیاں کاٹ دے گا۔ دیکھیے سورۂ محمد(۱۵)۔ ¤ ➋ {وَ يَاْتِيْهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ … :} اور ہر جگہ سے اسے موت آتی دکھائی دے گی، کیونکہ جہنم کی ایک ایک چیز موت کے لیے کافی ہے، مگر وہ کسی صورت مرنے والا نہیں، کیونکہ وہاں موت ہو گی ہی نہیں۔ {’’ بِمَيِّتٍ ‘‘} کی باء سے نفی کی تاکید ہوئی، اس لیے ترجمہ میں ’’کسی صورت‘‘ کا اضافہ ہو گیا۔ دیکھیے سورۂ فاطر (۳۶) اور سورۂ اعلیٰ(۱۳)۔ ¤ ➌ { وَ مِنْ وَّرَآىِٕهٖ عَذَابٌ غَلِيْظٌ :} یعنی اس کے بعد اور سخت عذاب ہے۔ اب اس کی مختلف صورتیں تو اللہ تعالیٰ ہی جانتا ہے، جن میں سے بہت سی چیزیں قرآن و حدیث میں مذکور ہیں، البتہ عذاب کے طور پر مسلط ہونے والی بھوک اور زقوم کے کھانے کا ذکر یہاں کیا جاتا ہے، فرمایا : { اِنَّ شَجَرَتَ الزَّقُّوْمِ (43) طَعَامُ الْاَثِيْمِ (44) كَالْمُهْلِ يَغْلِيْ فِي الْبُطُوْنِ (45) كَغَلْيِ الْحَمِيْمِ (46) خُذُوْهُ فَاعْتِلُوْهُ اِلٰى سَوَآءِ الْجَحِيْمِ (47) ثُمَّ صُبُّوْا فَوْقَ رَاْسِهٖ مِنْ عَذَابِ الْحَمِيْمِ (48) ذُقْ اِنَّكَ اَنْتَ الْعَزِيْزُ الْكَرِيْمُ} [الدخان : ۴۳ تا ۴۹ ] ’’بے شک زقوم کا درخت۔ گناہ گار کا کھانا ہے۔ پگھلے ہوئے تانبے کی طرح، پیٹوں میں کھولتا ہے۔ گرم پانی کے کھولنے کی طرح۔ اسے پکڑو، پھر اسے بھڑکتی آگ کے درمیان تک دھکیل کر لے جاؤ۔ پھر کھولتے پانی کا کچھ عذاب اس کے سر پر انڈیلو۔ چکھ، بے شک تو ہی وہ شخص ہے جو بڑا زبردست، بہت باعزت ہے۔‘‘ ¤ جہنم کے سخت عذاب کا اندازہ دنیا میں کسی طرح نہیں ہو سکتا جس کی آگ ہی یہاں کی آگ سے ستر (۷۰) گنا گرم ہے، البتہ جہنم کے سب سے کم عذاب کا بیان جو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے، اس سے سخت عذاب کا کچھ نہ کچھ اندازہ کر لیں، حقیقی علم تو ممکن ہی نہیں، نہ وہ بیان میں آ سکتا ہے۔ نعمان بن بشیر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا مَنْ لَهُ نَعْلَانِ وَ شِرَاكَانِ مِنْ نَارٍ، يَغْلِيْ مِنْهُمَا دِمَاغُهُ، كَمَا يَغْلِي الْمِرْجَلُ مَا يَرَی أَنَّ أَحَدًا أَشَدُّ مِنْهُ عَذَابًا، وَ إِنَّهُ لَأَهْوَنُهُمْ عَذَابًا ] [مسلم، الإیمان، باب أھون أھل النار عذابا : 213/364]’’اہل نار میں سب سے ہلکے عذاب والا وہ ہو گا جس کے لیے آگ کے دو جوتے اور دو تسمے ہوں گے، ان دونوں سے اس کا دماغ اس طرح ابل رہا ہو گا جیسے ہانڈی ابلتی ہے، وہ نہیں خیال کرے گا کہ اس سے زیادہ بھی کسی کو عذاب ہو رہا ہے، حالانکہ وہ ان سب سے کم عذاب والا ہو گا۔‘‘ [ نَعُوْذُ بِاللّٰہِ مِنْ جَمِیْعِ عَذَابِ الدُّنْیَا وَالْآخِرَۃِ ]"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت18){مَثَلُ الَّذِيْنَ كَفَرُوْا بِرَبِّهِمْ …:} کفار دنیا میں جو بھی اچھے کام کرتے ہیں، مثلاً کمزوروں کی مدد اور صدقہ وغیرہ، وہ آخرت میں ان کے کسی کام نہیں آئیں گے، کیونکہ ان کا بدلا انھیں دنیا ہی میں دیا جا چکا ہو گا۔ (دیکھیے الاحقاف : ۲۰) {’’عَاصِفٍ‘‘ ’’ عَصَفَ يَعْصِفُ ‘‘} سے ہے، بمعنی توڑنا۔ {’’كَعَصْفٍ مَّأْكُوْلٍ‘‘} کا معنی ہے ریزہ شدہ بھس، یعنی تیز و تند ہوا جو ہر چیز کو توڑتی جائے۔ اس آیت میں قیامت کے دن کفار کے اعمال کے بے کار ہونے کی مثال دی ہے کہ ایک تند و تیز ہوا والے دن میں کسی راکھ پر بہت سخت ہوا چلے تو اس ہوا میں راکھ کا ایک ذرہ بھی ہاتھ میں آنا مشکل ہے، اسی طرح کفار کے اعمال صالحہ اس دن بے کار ہوں گے، کیونکہ ان کا کوئی عمل اس دن کے لیے تھا ہی نہیں، نہ اس دن پر ان کا ایمان تھا۔ مزید دیکھیے سورۂ فرقان(۲۳)، کہف (۱۰۳ تا ۱۰۶) اور آل عمران (۱۱۷)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت20،19) ➊ {اَلَمْ تَرَ اَنَّ اللّٰهَ خَلَقَ السَّمٰوٰتِ …:’’ اَلَمْ تَرَ ‘‘} کا معنی {’’اَلَمْ تَعْلَمْ‘‘} ہے، یعنی کیا تمھیں معلوم نہیں کہ اللہ تعالیٰ نے آسمان و زمین کو حق کے ساتھ پیدا کیا ہے، یعنی اس صحیح اندازے کے مطابق جس کے مطابق اسے ہونا چاہیے تھا اور جو اپنے خالق کی کمال قدرت پر دلالت کرتا ہے۔ اللہ تعالیٰ کی بنائی ہوئی کسی چیز میں کوئی نہ نقص نکال سکتا ہے نہ کوئی ایسی صورت پیش کر سکتا ہے جو اس سے بہتر ہو۔ ہاں وہ خود اس سے بھی بہتر بنانے پر پوری طرح قادر ہے۔ ¤ ➋ { وَ مَا ذٰلِكَ عَلَى اللّٰهِ بِعَزِيْزٍ :} اس کے لیے کوئی چیز مشکل نہیں ہے، وہ چاہے تو ایسے کروڑوں عالم دم بھر میں مٹا کر نئے پیدا کر دے۔ {’’ وَ يَاْتِ بِخَلْقٍ جَدِيْدٍ ‘‘} کا ایک معنی بعض اہل علم نے یہ بھی کیا ہے کہ اگر وہ چاہے تو تم سب کو دفعتاً ختم کرکے تمھیں دوبارہ نئے سرے سے پیدا کر دے۔ آگے آنے والی آیات جو حشر اور قیامت کے واقعات پر مشتمل ہیں اس معنی کی تائید کرتی ہیں۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت20،19) ➊ {اَلَمْ تَرَ اَنَّ اللّٰهَ خَلَقَ السَّمٰوٰتِ …:’’ اَلَمْ تَرَ ‘‘} کا معنی {’’اَلَمْ تَعْلَمْ‘‘} ہے، یعنی کیا تمھیں معلوم نہیں کہ اللہ تعالیٰ نے آسمان و زمین کو حق کے ساتھ پیدا کیا ہے، یعنی اس صحیح اندازے کے مطابق جس کے مطابق اسے ہونا چاہیے تھا اور جو اپنے خالق کی کمال قدرت پر دلالت کرتا ہے۔ اللہ تعالیٰ کی بنائی ہوئی کسی چیز میں کوئی نہ نقص نکال سکتا ہے نہ کوئی ایسی صورت پیش کر سکتا ہے جو اس سے بہتر ہو۔ ہاں وہ خود اس سے بھی بہتر بنانے پر پوری طرح قادر ہے۔ ¤ ➋ { وَ مَا ذٰلِكَ عَلَى اللّٰهِ بِعَزِيْزٍ :} اس کے لیے کوئی چیز مشکل نہیں ہے، وہ چاہے تو ایسے کروڑوں عالم دم بھر میں مٹا کر نئے پیدا کر دے۔ {’’ وَ يَاْتِ بِخَلْقٍ جَدِيْدٍ ‘‘} کا ایک معنی بعض اہل علم نے یہ بھی کیا ہے کہ اگر وہ چاہے تو تم سب کو دفعتاً ختم کرکے تمھیں دوبارہ نئے سرے سے پیدا کر دے۔ آگے آنے والی آیات جو حشر اور قیامت کے واقعات پر مشتمل ہیں اس معنی کی تائید کرتی ہیں۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت21){وَ بَرَزُوْا لِلّٰهِ جَمِيْعًا …:’’ تَبَعًا ‘‘} یہ {’’تَابِعٌ‘‘} کی جمع ہے، جیسے {’’خَادِمٌ‘‘} کی جمع {’’خَدَمٌ‘‘} ہے، یعنی اس دن دنیا میں چھپاؤ کی تمام جگہیں ختم ہو جائیں گی۔ پہاڑوں کی بلندیاں، سمندروں کی گہرائیاں اور سطح زمین کی کُرویّت ختم ہو کر روٹی کی طرح صاف زمین پر ساری مخلوق اللہ تعالیٰ کے سامنے پیش ہو گی۔ دنیا میں کمزور اور طاقت ور، مرید و مرشد، رعایا اور سردار ایک جیسی عاجزی اور بے بسی کے ساتھ اللہ کے سامنے ہوں گے، تو کمزور لوگ اپنے گمراہ کرنے والے بڑوں سے کہیں گے کہ ہم تو تمھارے پیچھے چلنے والے تھے اور اس وجہ سے ہم نے انبیاء کو جھٹلایا اور اللہ سے کفر کیا، اب کیا تم اللہ کے عذاب سے بچانے میں ہمارے کسی کام آ سکتے ہو؟ {’’ مِنْ شَيْءٍ ‘‘} کا مطلب یہ ہے کہ سارا عذاب نہیں تو اس میں سے جتنا ہو سکے کم کروا دو۔ وہ سارا گناہ اللہ کے ذمے ڈال کر خود بری ہو کر ان کی کسی بھی قسم کی مدد سے معذرت کر لیں گے۔ چنانچہ کہیں گے، اگر اللہ تعالیٰ ہمیں ہدایت دیتا تو ہم تمھیں ہدایت دیتے، گویا سارا قصور اللہ تعالیٰ کا ہے جس نے ہمیں ہدایت نہیں دی۔ [ اَلْعِیَاذُ بِاللّٰہِ ] جیسا کہ شیطان نے سجدے سے انکار کرکے اپنے گمراہ ہونے کو اللہ تعالیٰ کے ذمے لگا دیا، فرمایا : «{ قَالَ فَبِمَاۤ اَغْوَيْتَنِيْ }» [ الأعراف : ۱۶] ’’کہا، چونکہ تو نے مجھے گمراہ کیا۔‘‘ حالانکہ اللہ تعالیٰ نے تو ہدایت دی تھی، دونوں راستے دکھا دیے تھے، فرمایا : «{اِنَّا هَدَيْنٰهُ السَّبِيْلَ اِمَّا شَاكِرًا وَّ اِمَّا كَفُوْرًا }» [ الدھر : ۳ ] ’’بلاشبہ ہم نے اسے راستہ دکھا دیا، خواہ وہ شکر کرنے والا بنے اور خواہ ناشکرا۔‘‘ اب تمھارا اختیار تھا، نہ اس نے تمھیں بدی پر مجبور کیا نہ نیکی پر اور یہی آزمائش کی حکمت جن و انس کی پیدائش کا باعث تھی۔ خیر اب ایسے عذاب میں پھنس جانے کے بعد جس سے بھاگ نکلنے کی کوئی صورت نہیں، ہمارے سامنے دو ہی راستے ہیں، گھبراہٹ کا اظہار کریں یا صبر کریں۔ دونوں کا کچھ فائدہ ہے نہ یہاں سے چھٹکارے کی کوئی صورت ہے۔ ابن کثیر رحمہ اللہ نے فرمایا کہ ظاہر یہ ہے کہ ان کی یہ باہمی قیل و قال جہنم میں داخلے کے بعد ہوگی۔ دیکھیے سورۂ مومن (۴۷)، سورۂ اعراف (۳۸) اور سورۂ سبا (۳۲، ۳۳) بہرحال ان کا یہ جھگڑا میدان حشر اور جہنم دونوں میں بھی ہو سکتا ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت22) ➊ {بِمُصْرِخِكُمْ: ’’ صُرَاخٌ ‘‘} کا معنی چیخنا چلانا ہے جو مصیبت سے بچانے کے لیے بطور فریاد ہوتا ہے۔ {’’اَصْرَخَ يُصْرِخُ‘‘} باب افعال میں ہمزہ ازالۂ ماخذ کے لیے ہے، یعنی اس مصیبت کو جو چیخنے کا باعث ہے دور کرنا، جیسے {’’شَكَانِيْ فَأَشْكَيْتُهُ ‘‘} کہ اس نے مجھ سے شکایت کی تو میں نے اس کی شکایت دور کر دی۔ اسی لیے عام طور پر {’’صُرَاخٌ‘‘} کا معنی فریاد اور {’’اِصْرَاخٌ‘‘} کا معنی فریاد رسی کر لیا جاتا ہے۔ {’’ بِمُصْرِخِيَّ ‘‘} اصل میں {’’بِمُصْرِخِيْنَ‘‘} جمع مذکر سالم تھا، یاء متکلم کی طرف مضاف ہوا تو نون اعرابی گر گیا اور یاء کے یاء میں ادغام کے ساتھ {’’ بِمُصْرِخِيَّ ‘‘} ہو گیا۔ ¤ ➋ { وَ قَالَ الشَّيْطٰنُ لَمَّا قُضِيَ الْاَمْرُ … :} فیصلے کے بعد جب جنتی جنت میں داخل ہو جائیں گے اور جہنمی جہنم میں اور ہر طرف سے شیطان پر ملامت کی بوچھاڑ ہو گی تو شیطان اس کے جواب میں کہے گا کہ اللہ تعالیٰ نے تم سے جو وعدہ کیا تھا وہ حق تھا، کیونکہ وہ ان تمام چیزوں کا مالک تھا جن کا وعدہ کیا تھا، مثلاً مرنے کے بعد زندہ کرنا، جنت، جہنم اور دعا کی قبولیت وغیرہ، اس لیے اس نے وہ وعدہ پورا کیا اور میں نے تم سے جو وعدہ کیا وہ جھوٹا تھا کہ اس طرح کرو گے تو یہ ہو جائے گا، داتا کو پکارو گے تو یہ ہو گا، دستگیر کو پکارو گے تو یہ ہو گا، کیونکہ ان میں سے کوئی کسی چیز کا مالک ہی نہ تھا اور جو آرزوئیں میں نے تمھارے دل میں ابھاری تھیں کہ فلاں کی نیاز دینے سے معشوق قدموں میں آ گرتا ہے، فلاں کے نام کا بکرا دینے سے دشمن کا ستیاناس ہو جاتا ہے، ان کا وجود ہی نہ تھا۔ فرمایا : «{ يَعِدُهُمْ وَ يُمَنِّيْهِمْ وَ مَا يَعِدُهُمُ الشَّيْطٰنُ اِلَّا غُرُوْرًا }» [ النساء : ۱۲۰ ] ’’وہ انھیں وعدے دیتا ہے اور انھیں آرزوئیں دلاتا ہے اور شیطان انھیں دھوکے کے سوا کچھ وعدہ نہیں دیتا۔‘‘ اس لیے اللہ تعالیٰ کی ہمیں تعلیم یہ ہے کہ تم جب بھی وعدہ کرو تو اس چیز کا کرو جو تم کر سکتے ہو، پھر بھی ساتھ ان شاء اللہ ضرور کہو، کیونکہ تمھارا اختیار اللہ تعالیٰ کے تابع ہے، فرمایا : « وَ لَا تَقُوْلَنَّ لِشَايْءٍ اِنِّيْ فَاعِلٌ ذٰلِكَ غَدًا (23) اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ » [ الکہف : ۲۳، ۲۴ ] ’’اور کسی چیز کے بارے میں ہر گز نہ کہہ کہ میں کل یہ کام ضرور کرنے والا ہوں، مگر یہ کہ اللہ چاہے۔‘‘ ¤ ➌ {وَ مَا كَانَ لِيَ عَلَيْكُمْ مِّنْ سُلْطٰنٍ … : ’’ سُلْطَةٌ ‘‘} اور {’’ سُلْطٰنٍ ‘‘} كا مطلب زبردستی كسی پر غلبہ حاصل كر لينا، مسلط ہو جانا ہے۔ يہ تسلط دو طرح كا ہوتاہے، ايك حكومت كے ذریعے سے ہوتا ہے، ظاہر ہے کہ شیطان کی ان پر کوئی حکومت نہ تھی کہ وہ ان پر کوئی فوج چڑھا لایا تھا اور ایک سلطان اور غلبہ صحیح دلیل کا ہوتا ہے، کیونکہ وہ دلیل دل پر قابو پا لیتی ہے اور آدمی اس کے مطابق عمل پر مجبور ہوتا ہے اور ظاہر ہے کہ شیطان کے پاس ڈنڈا بھی نہ تھا اور کوئی معقول دلیل بھی نہ تھی، چنانچہ وہ کہے گا میں نے تو بس اتنا کیا تھا کہ تمھیں کچھ کاموں کی دعوت دی، وہ تمھاری کمزوریوں، مثلاً حرص، شہوت، غصے، بزدلی وغیرہ کے عین مطابق تھی اور اس میں تمھاری خواہشات کو ابھارا گیا تھا، تم نے فوراً اسے قبول کر لیا ( {أَجَبْتُمْ } اور {اِسْتَجَبْتُمْ} کے فرق کو ملحوظ رکھیں) اس لیے مجھے ملامت مت کرو، بلکہ اپنے آپ کو ملامت کرو، کیونکہ اپنی مرضی سے گناہ تم نے کیا، میں نے تم پر کوئی زبردستی نہیں کی۔ اب نہ تم میری فریاد رسی کر سکتے ہو نہ میں تمھاری۔ سورۂ نحل کی آیت (۱۰۰) میں شیطان کے سلطان کی تشریح ملاحظہ فرمائیں۔ ¤ ➍ { اِنِّيْ كَفَرْتُ بِمَاۤ اَشْرَكْتُمُوْنِ مِنْ قَبْلُ :} اس سے پہلے تم نے جو مجھے اللہ تعالیٰ کا شریک بنایا تھا میں اس کا انکار کرتا ہوں، کیونکہ عبادت تو صرف اللہ کا حق تھا، اسی طرح حکم ماننا تم پر صرف اللہ کا حق تھا اور وہ بھی اس کی عبادت میں شامل تھا، تم نے اس کے بجائے میرا حکم مانا، میری عبادت کی، مجھے اس کا شریک بنایا، اب میں اس سے صاف لاتعلقی کا اظہار کرتا ہوں۔ تم نے میری نہیں بلکہ اپنی خواہش کی پیروی کی اور تم اللہ کے بجائے مجھے نہیں بلکہ اپنے وہم و گمان کے بنائے ہوئے دستگیروں اور داتاؤں کو پکارتے رہے ہو، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اِنْ يَّتَّبِعُوْنَ اِلَّا الظَّنَّ وَ مَا تَهْوَى الْاَنْفُسُ }» [ النجم : ۲۳ ] ’’یہ لوگ (مشرکین) صرف گمان کے اور ان چیزوں کے پیچھے چل رہے ہیں جو ان کے دل چاہتے ہیں۔‘‘ ¤ ➎ { اِنَّ الظّٰلِمِيْنَ لَهُمْ عَذَابٌ اَلِيْمٌ:} یہ بطور اعتراف شیطان کی بات کا آخری حصہ بھی ہو سکتا ہے جس سے پہلے وہ درج ذیل باتیں کہہ کر ان سے بری ہو چکا ہے : (1) میرا وعدہ جھوٹا تھا۔ (2) میرا تم پر کوئی غلبہ نہ تھا۔ (3) تم نے دلیل سے خالی دعوت قبول کی۔ (4) مجھے ملامت کے بجائے اپنے آپ کو ملامت کرو۔ (5) میں تمھاری کوئی مدد نہیں کر سکتا۔ (6) تم نے مجھے جو شریک بنایا میں اسے نہیں مانتا۔ (7) یہ آخری بات ہے کہ ظالموں (مشرکوں) کے لیے عذابِ الیم ہے۔ (خلاصہ از شوکانی) اور یہ جملہ اللہ تعالیٰ کا فرمان بھی ہو سکتا ہے جو اظہار حقیقت ہے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت23) ➊ { وَ اُدْخِلَ الَّذِيْنَ اٰمَنُوْا …:} اللہ تعالیٰ نے اپنی سنت کے مطابق یہاں بھی مشرکین اور شیطان کے ذکر کے بعد ایمان اور عمل صالح والوں کا انجام ذکر فرمایا کہ وہ جنتوں میں داخل کر دیے گئے۔ مراد یہ ہے کہ کیے جائیں گے، مگر بات اتنی یقینی ہے کہ اسے ماضی کے لفظ سے بیان کیا کہ سمجھو یہ کام ہو چکا۔ اس سے پہلے شیطان اور مشرکین، کمزور اور سرداروں کی گفتگو میں بھی ماضی کا صیغہ یہی حکمت رکھتا ہے۔ ¤ ➋ { وَ اُدْخِلَ:} ’’داخل کیے جائیں گے‘‘ داخل کون کرے گا؟ اس کی تین جہتیں ہیں، اصل تو اللہ تعالیٰ ہے جو جنت میں بھیجنے کا حکم دے گا، پھر فرشتے ہیں جو اس کے حکم سے انھیں جنت میں لے جائیں گے، تیسرے ان کا ایمان اور عمل صالح ہیں جو اللہ کی رحمت اور ان کے جنت میں جانے کا ذریعہ بنیں گے، اس لیے مجہول کا صیغہ استعمال کیا۔ {’’ بِاِذْنِ رَبِّهِمْ ‘‘ } یعنی یہ سب کچھ ان کے رب کی توفیق اور مہربانی سے ہوگا۔ ¤ ➌ { تَحِيَّتُهُمْ فِيْهَا سَلٰمٌ : } یعنی آپس میں ملتے وقت وہ ’’السلام علیکم‘‘ کہیں گے۔ فرشتے ان سے کہیں گے : «{ سَلٰمٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ }» [ الرعد : ۲۴ ] ’’سلام ہو تم پر اس کے بدلے میں جو تم نے صبر کیا۔‘‘ یعنی تم پر سلامتی ہو، پھر رب رحیم انھیں سلام کہے گا : «{ سَلٰمٌ قَوْلًا مِّنْ رَّبٍّ رَّحِيْمٍ }» [ یٰسٓ : ۵۸ ]’’سلام ہو۔ اس رب کی طرف سے کہا جائے گا جو بے حد مہربان ہے۔‘‘ اس میں مبارک باد کا مفہوم بھی ہے، سلامتی کی دعا بھی اور اللہ کی طرف سے سلامتی کا عطیہ بھی۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت25،24) ➊ {اَلَمْ تَرَ:} یہ خطاب اولاً رسول اللہ صلی اللہ علیہ وسلم سے ہے اور پھر ہر اس شخص سے ہے جو خطاب کے لائق ہے۔ استفہام سے مراد پوچھنا نہیں بتانا ہے۔ اسے استفہام تقریری کہتے ہیں۔ ’’کیا تو نے نہیں دیکھا؟‘‘ یہاں دیکھنے سے مراد علم اور جاننا ہے جو کائنات کو دیکھنے اور اس میں غور و فکر سے حاصل ہوتا ہے۔ مفسر آلوسی کے کلام کا خلاصہ یہ ہے کہ {’’اَلَمْ تَرَ ‘‘} کا مخاطب بعض اوقات وہ شخص ہوتا ہے جو پہلے سے اس بات سے واقف ہو، ایسی صورت میں مراد تعجب کا اظہار ہوتا ہے اور بعض اوقات اس کا مخاطب وہ شخص ہوتا ہے جو اس سے واقف نہ ہو، اس وقت مراد ایک تو اسے بتانا ہوتا ہے اور ایک اس بات پر تعجب کا اظہار ہوتا ہے کہ اتنی مشہور بات بھی تمھیں معلوم نہیں، جو سب لوگ دیکھی ہوئی بات کی طرح جانتے ہیں۔ پھر اس مخاطب سے بات اس طرح کی جاتی ہے گویا وہ اسے اچھی طرح جانتا ہے۔ ¤ ➋ {’’ مَثَلًا ‘‘} یہ {’’ ضَرَبَ ‘‘} کا مفعول بہ ہے، {’’ كَلِمَةً ‘‘} اس سے بدل ہے یا عطف بیان۔ مثل کا لفظ کسی چیز کی وضاحت کے لیے اس سے زیادہ واضح چیز کے ساتھ مثال دے کر سمجھانے کے لیے آتا ہے۔ ¤ ➌ { كَلِمَةً طَيِّبَةً :} اس میں ہر پاکیزہ کلام، مثلاً تسبیح، تقدیس، تحمید اور تہلیل وغیرہ شامل ہے اور ہر پاکیزہ کلام کا خلاصہ ’’لا الٰہ الا اللہ‘‘ ہے، کیونکہ ہر پاکیزہ کلام یا عمل کا مدار یہی ہے۔ اس لیے مفسرین نے عموماً اس سے کلمۂ اسلام اور اس کے نتیجے میں حاصل ہونے والا ہر پاکیزہ قول و عمل مراد لیا ہے۔ ¤ ➍ {كَشَجَرَةٍ طَيِّبَةٍ اَصْلُهَا ثَابِتٌ … :} پاکیزہ اور عمدہ درخت کی چند خوبیاں بیان فرمائیں، پہلی یہ کہ اس کی جڑ مضبوط ہے، جس کی وجہ سے اس کا اکھڑنا مشکل ہے اور وہ زمین سے غذا بخوبی حاصل کر لیتا ہے اور ڈٹ کر کھڑا رہتا ہے۔ دوسری یہ کہ اس کی چوٹی بہت اونچی ہے، جس کی وجہ سے اسے نقصان پہنچانا مشکل ہے، وہ آلودگی سے محفوظ دھوپ اور صاف ہوا سے بھی اپنی پوری خوراک حاصل کرتا ہے۔ مفسر طنطاوی نے ’’الوسیط‘‘ میں لکھا ہے کہ جدید تحقیق سے ثابت ہوا ہے کہ درخت اپنی غذا کا صرف پانچ فیصد زمین سے حاصل کرتے ہیں، باقی فضا سے۔ تیسری یہ کہ وہ اپنے رب کے حکم سے ہر وقت اپنا پھل دیتا ہے۔ اس صفت کی تفسیر میں مفسرین کو مشکل پیش آئی ہے۔ صحیح بخاری (۶۱۲۲، ۶۱۴۴) میں ابن عمر رضی اللہ عنھما کی حدیث میں رسول اللہ صلی اللہ علیہ وسلم نے کھجور کے درخت کو مومن سے تشبیہ دی ہے کہ اس کے پتے کبھی نہیں گرتے اور وہ ہر وقت اپنا پھل اپنے رب کے حکم سے دیتا ہے، مگر آپ نے اسے کلمہ طیبہ سے تشبیہ نہیں دی۔ ترمذی (۳۱۱۹) میں انس رضی اللہ عنہ سے روایت ہے کہ یہاں کلمہ طیبہ «{ كَشَجَرَةٍ طَيِّبَةٍ }» سے مراد کھجور ہے، مگر شیخ البانی رحمہ اللہ نے اسے مرفوعاً ضعیف اور موقوفاً صحیح فرمایا ہے۔ بہرحال جو مفسرین اس سے مراد کھجور کا درخت لیتے ہیں ان کا کہنا یہ ہے کہ کھجور کے درخت سے پھل کی ابتدا سے لے کر اس کے گودے، کچی کھجور، نیم پختہ، تازہ پکی ہوئی غرض ہر مرحلے کے پھل کو تقریباً چھ ماہ تک کھایا جاتا ہے، پھر اسے محفوظ کرکے سارا سال کھایا جاتا ہے۔ مفسر طنطاوی نے فرمایا کہ میرے خیال میں {’’ تُؤْتِيْۤ اُكُلَهَا ‘‘} کو صرف پھل میں محدود کرنا ٹھیک نہیں، مراد یہ ہے کہ وہ درخت ہر وقت فائدہ پہنچاتا رہتا ہے، پھل کی صورت میں، سائے کی صورت میں، خوشبو کی صورت میں، عمارتی لکڑی یا ایندھن کی صورت میں، پتوں اور ٹہنیوں اور گوند کی مصنوعات کی صورت میں اور دوا کی صورت میں، اگر کچھ بھی نہ ہو تو ہوا کو آلودگی سے صاف کرکے آکسیجن بنانے کی صورت میں ہر وقت وہ اپنا فائدہ پہنچاتا رہتا ہے۔ ظاہر ہے کہ کھجور کے علاوہ وہ تمام درخت بھی اس میں آ جاتے ہیں جن میں یہ تینوں خوبیاں ہوں۔ اسی طرح کلمہ اسلام دنیا اور آخرت کے ہر مرحلے میں اللہ تعالیٰ کے حکم سے مومن کو مختلف قسم کے بے شمار فوائد پہنچاتا رہتا ہے اور ہر وقت مومن کا کوئی نہ کوئی نیک عمل آسمان کی طرف چڑھتا رہتا ہے۔ چونکہ مثال سے بات خوب سمجھ میں آ جاتی ہے، اس لیے اللہ تعالیٰ اسی طرح لوگوں کی نصیحت اور انھیں سمجھانے کے لیے مثالیں بیان فرماتا ہے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت25،24) ➊ {اَلَمْ تَرَ:} یہ خطاب اولاً رسول اللہ صلی اللہ علیہ وسلم سے ہے اور پھر ہر اس شخص سے ہے جو خطاب کے لائق ہے۔ استفہام سے مراد پوچھنا نہیں بتانا ہے۔ اسے استفہام تقریری کہتے ہیں۔ ’’کیا تو نے نہیں دیکھا؟‘‘ یہاں دیکھنے سے مراد علم اور جاننا ہے جو کائنات کو دیکھنے اور اس میں غور و فکر سے حاصل ہوتا ہے۔ مفسر آلوسی کے کلام کا خلاصہ یہ ہے کہ {’’اَلَمْ تَرَ ‘‘} کا مخاطب بعض اوقات وہ شخص ہوتا ہے جو پہلے سے اس بات سے واقف ہو، ایسی صورت میں مراد تعجب کا اظہار ہوتا ہے اور بعض اوقات اس کا مخاطب وہ شخص ہوتا ہے جو اس سے واقف نہ ہو، اس وقت مراد ایک تو اسے بتانا ہوتا ہے اور ایک اس بات پر تعجب کا اظہار ہوتا ہے کہ اتنی مشہور بات بھی تمھیں معلوم نہیں، جو سب لوگ دیکھی ہوئی بات کی طرح جانتے ہیں۔ پھر اس مخاطب سے بات اس طرح کی جاتی ہے گویا وہ اسے اچھی طرح جانتا ہے۔ ¤ ➋ {’’ مَثَلًا ‘‘} یہ {’’ ضَرَبَ ‘‘} کا مفعول بہ ہے، {’’ كَلِمَةً ‘‘} اس سے بدل ہے یا عطف بیان۔ مثل کا لفظ کسی چیز کی وضاحت کے لیے اس سے زیادہ واضح چیز کے ساتھ مثال دے کر سمجھانے کے لیے آتا ہے۔ ¤ ➌ { كَلِمَةً طَيِّبَةً :} اس میں ہر پاکیزہ کلام، مثلاً تسبیح، تقدیس، تحمید اور تہلیل وغیرہ شامل ہے اور ہر پاکیزہ کلام کا خلاصہ ’’لا الٰہ الا اللہ‘‘ ہے، کیونکہ ہر پاکیزہ کلام یا عمل کا مدار یہی ہے۔ اس لیے مفسرین نے عموماً اس سے کلمۂ اسلام اور اس کے نتیجے میں حاصل ہونے والا ہر پاکیزہ قول و عمل مراد لیا ہے۔ ¤ ➍ {كَشَجَرَةٍ طَيِّبَةٍ اَصْلُهَا ثَابِتٌ … :} پاکیزہ اور عمدہ درخت کی چند خوبیاں بیان فرمائیں، پہلی یہ کہ اس کی جڑ مضبوط ہے، جس کی وجہ سے اس کا اکھڑنا مشکل ہے اور وہ زمین سے غذا بخوبی حاصل کر لیتا ہے اور ڈٹ کر کھڑا رہتا ہے۔ دوسری یہ کہ اس کی چوٹی بہت اونچی ہے، جس کی وجہ سے اسے نقصان پہنچانا مشکل ہے، وہ آلودگی سے محفوظ دھوپ اور صاف ہوا سے بھی اپنی پوری خوراک حاصل کرتا ہے۔ مفسر طنطاوی نے ’’الوسیط‘‘ میں لکھا ہے کہ جدید تحقیق سے ثابت ہوا ہے کہ درخت اپنی غذا کا صرف پانچ فیصد زمین سے حاصل کرتے ہیں، باقی فضا سے۔ تیسری یہ کہ وہ اپنے رب کے حکم سے ہر وقت اپنا پھل دیتا ہے۔ اس صفت کی تفسیر میں مفسرین کو مشکل پیش آئی ہے۔ صحیح بخاری (۶۱۲۲، ۶۱۴۴) میں ابن عمر رضی اللہ عنھما کی حدیث میں رسول اللہ صلی اللہ علیہ وسلم نے کھجور کے درخت کو مومن سے تشبیہ دی ہے کہ اس کے پتے کبھی نہیں گرتے اور وہ ہر وقت اپنا پھل اپنے رب کے حکم سے دیتا ہے، مگر آپ نے اسے کلمہ طیبہ سے تشبیہ نہیں دی۔ ترمذی (۳۱۱۹) میں انس رضی اللہ عنہ سے روایت ہے کہ یہاں کلمہ طیبہ «{ كَشَجَرَةٍ طَيِّبَةٍ }» سے مراد کھجور ہے، مگر شیخ البانی رحمہ اللہ نے اسے مرفوعاً ضعیف اور موقوفاً صحیح فرمایا ہے۔ بہرحال جو مفسرین اس سے مراد کھجور کا درخت لیتے ہیں ان کا کہنا یہ ہے کہ کھجور کے درخت سے پھل کی ابتدا سے لے کر اس کے گودے، کچی کھجور، نیم پختہ، تازہ پکی ہوئی غرض ہر مرحلے کے پھل کو تقریباً چھ ماہ تک کھایا جاتا ہے، پھر اسے محفوظ کرکے سارا سال کھایا جاتا ہے۔ مفسر طنطاوی نے فرمایا کہ میرے خیال میں {’’ تُؤْتِيْۤ اُكُلَهَا ‘‘} کو صرف پھل میں محدود کرنا ٹھیک نہیں، مراد یہ ہے کہ وہ درخت ہر وقت فائدہ پہنچاتا رہتا ہے، پھل کی صورت میں، سائے کی صورت میں، خوشبو کی صورت میں، عمارتی لکڑی یا ایندھن کی صورت میں، پتوں اور ٹہنیوں اور گوند کی مصنوعات کی صورت میں اور دوا کی صورت میں، اگر کچھ بھی نہ ہو تو ہوا کو آلودگی سے صاف کرکے آکسیجن بنانے کی صورت میں ہر وقت وہ اپنا فائدہ پہنچاتا رہتا ہے۔ ظاہر ہے کہ کھجور کے علاوہ وہ تمام درخت بھی اس میں آ جاتے ہیں جن میں یہ تینوں خوبیاں ہوں۔ اسی طرح کلمہ اسلام دنیا اور آخرت کے ہر مرحلے میں اللہ تعالیٰ کے حکم سے مومن کو مختلف قسم کے بے شمار فوائد پہنچاتا رہتا ہے اور ہر وقت مومن کا کوئی نہ کوئی نیک عمل آسمان کی طرف چڑھتا رہتا ہے۔ چونکہ مثال سے بات خوب سمجھ میں آ جاتی ہے، اس لیے اللہ تعالیٰ اسی طرح لوگوں کی نصیحت اور انھیں سمجھانے کے لیے مثالیں بیان فرماتا ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت26){وَ مَثَلُ كَلِمَةٍ خَبِيْثَةٍ … :} اور خبیث کلمہ (گندی بات) سے مراد کفر و شرک کی بات ہے۔ اس کی مثال اس بے کار پودے کی ہے جسے جڑ سے اکھیڑ پھینک دیا گیا ہو اور وہ اتنا کمزور ہو کہ اس کی جڑ زمین میں قائم ہی نہ رہ سکتی ہو۔ معمولی سا ہوا کا جھونکا ہی اسے اکھیڑ پھینکنے کے لیے کافی ہو۔ اسی طرح کلمہ کفر دنیا یا آخرت میں ہر طرح بے کار ہے، کسی کام نہیں آئے گا۔ انس رضی اللہ عنہ نے اس سے مراد حنظل (تماں، اندرائن) لیا ہے۔ [ ترمذی، تفسیر القرآن، باب و من سورۃ إبراہیم : ۳۱۱۹ ] البتہ نبی کریم صلی اللہ علیہ وسلم سے انس رضی اللہ عنہ کی یہ روایت مرفوعاً ثابت نہیں۔ [ ضعیف سنن الترمذی للألبانی : ۳۱۱۹ ] طنطاوی نے فرمایا، یہ صرف بطور مثال ایک فرضی پودا ہے جس کا حقیقت میں وجود نہیں، صرف سمجھانے کے لیے اسے بیان کیا گیا ہے۔ تفسیر طبری میں ابن عباس رضی اللہ عنھما سے یہ قول مذکور ہے، مگر اس میں قابوس بن ابی ظبیان ایک راوی ضعیف ہے۔ کیونکہ تماں ہو یا اور کوئی پودا بہرحال اس کے پھر بھی کچھ نہ کچھ غذائی نہ سہی دوائی فائدے ہوتے ہیں۔ ایسے ہی بے کار فرضی پودے والا حال شرک و کفر کا ہے جس کی نہ کوئی دلیل ہوتی ہے نہ دل پر اس کا اثر ہوتا ہے، نہ اس کے ساتھ کوئی عمل قبول ہوتا ہے۔ بودا اتنا ہوتا ہے کہ ذرا سے غور و فکر سے اس کا بے حقیقت ہونا واضح ہو جاتا ہے۔ کافر کا کوئی عمل نہ آسمان کی طرف چڑھتا ہے نہ اللہ کے ہاں قبول ہوتا ہے۔ یہ تفسیر مناسب حال معلوم ہوتی ہے، کیونکہ کفر و شرک کا حقیقی وجود ہے ہی نہیں، بلکہ یہ صرف وہم و گمان کی پیروی کا نام ہے، اس لیے اس کی مثال بھی ایسے ہی پودے سے مناسب ہے جس کا وجود فرضی ہو۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت27) ➊ {يُثَبِّتُ اللّٰهُ الَّذِيْنَ اٰمَنُوْا بِالْقَوْلِ الثَّابِتِ فِي الْحَيٰوةِ الدُّنْيَا : } قولِ ثابت سے مراد کلمہ شہادت اور عقیدۂ توحید ہے۔ اللہ تعالیٰ ایمان والوں کو دنیا میں سخت سے سخت آزمائشوں اور سزاؤں میں بھی اسلام پر قائم رکھتا ہے۔ اصحاب الاخدود کو دیکھ لیجیے، ان انبیاء و شہداء کو دیکھ لیجیے جو اللہ کی راہ میں قتل کر دیے گئے، مگر انھوں نے اسلام کا دامن نہیں چھوڑا۔ ابراہیم علیہ السلام کے آگ میں پھینکے جانے کو دیکھ لیجیے، ہمارے نبی صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنھم مثلاً بلال، عمار، یاسر، خباب، سمیہ، خبیب وغیرہم رضی اللہ عنھم پر آنے والی تنگیوں اور تکلیفوں کو دیکھ لیجیے۔ اس آیت میں فرمایا کہ ان لوگوں کا کلمہ شہادت پر قائم رہنا اللہ تعالیٰ کے ثابت رکھنے سے ہے، وہی ان میں اس قدر عزم و ہمت اور استقامت پیدا کر دیتا ہے کہ وہ سخت سے سخت حالات ہوں یا دنیاوی آسائشوں کی آزمائش ہو، ہر حال میں پختہ بات (کلمہ اسلام) پر خوب قائم رہتے ہیں۔ {’’ يُثَبِّتُ ‘‘} کا ترجمہ باب تفعیل کی وجہ سے ’’خوب قائم رکھتا ہے‘‘ کیا ہے۔ ¤ ➋ { وَ فِي الْاٰخِرَةِ :} اس سے مراد قبر میں سوال و جواب ہے۔ براء بن عازب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا أُقْعِدَ الْمُؤْمِنُ فِيْ قَبْرِهِ أُتِيَ ثُمَّ شَهِدَ أَنْ لَا إِلٰهَ إِلاَّ اللّٰهُ، وَأَنَّ مُحَمَّدًا رَسُوْلُ اللّٰهِ، فَذٰلِكَ قَوْلُهُ : « يُثَبِّتُ اللّٰهُ الَّذِيْنَ اٰمَنُوْا بِالْقَوْلِ الثَّابِتِ» ] [إبراہیم : ۲۷ ] ’’جب مومن کو قبر میں بٹھایا جاتا ہے تو اس کے پاس فرشتے آتے ہیں، پھر وہ شہادت دیتا ہے : {’’أَنْ لَّا إِلٰهَ إِلَّا اللّٰهُ وَأَنَّ مُحَمَّدًا رَّسُوْلُ اللّٰهِ‘‘} چنانچہ اللہ کے اس فرمان : «{ يُثَبِّتُ اللّٰهُ الَّذِيْنَ اٰمَنُوْا بِالْقَوْلِ الثَّابِتِ فِي الْحَيٰوةِ الدُّنْيَا }» کا یہی مطلب ہے۔‘‘ [ بخاري ، الجنائز، باب ما جاء فی عذاب القبر : ۱۳۶۹ ] صحیح بخاری ہی میں اس کے بعد والی روایت میں یہ لفظ ہیں کہ یہ آیت عذاب قبر کے بارے میں اتری۔ ¤ ➌ { وَ يُضِلُّ اللّٰهُ الظّٰلِمِيْنَ:} انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ الْعَبْدَ إِذَا وُضِعَ فِيْ قَبْرِهِ وَتَوَلَّی عَنْهُ أَصْحَابُهُ، وَإِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ، أَتَاهُ مَلَكَانِ فَيُقْعِدَانِهِ فَيَقُوْلاَنِ مَا كُنْتَ تَقُوْلُ فِيْ هٰذَا الرَّجُلِ لِمُحَمَّدٍ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ ؟ فَأَمَّا الْمُؤْمِنُ فَيَقُوْلُ أَشْهَدُ أَنَّهُ عَبْدُ اللّٰهِ وَرَسُوْلُهُ، فَيُقَالُ لَهُ انْظُرْ إِلٰی مَقْعَدِكَ مِنَ النَّارِ قَدْ أَبْدَلَكَ اللّٰهُ بِهِ مَقْعَدًا مِنَ الْجَنَّةِ، فَيَرَاهُمَا جَمِيْعًا، أَنَّهُ يُفْسَحُ لَهُ فِيْ قَبْرِهِ، وَأَمَّا الْمُنَافِقُ وَالْكَافِرُ فَيُقَالُ لَهُ مَا كُنْتَ تَقُوْلُ فِيْ هٰذَا الرَّجُلِ؟ فَيَقُوْلُ لاَ أَدْرِيْ، كُنْتُ أَقُوْلُ مَا يَقُوْلُهُ النَّاسُ، فَيُقَالُ لَا دَرَيْتَ وَلَا تَلَيْتَ، وَيُضْرَبُ بِمَطَارِقَ مِنْ حَدِيْدٍ ضَرْبَةً فَيَصِيْحُ صَيْحَةً يَسْمَعُهَا مَنْ يَلِيْهِ غَيْرَ الثَّقَلَيْنِ ] [ بخاري، الجنائز، باب ما جاء فی عذاب القبر : ۱۳۷۴ ] ’’بندہ جب اپنی قبر میں رکھا جاتا ہے اور اس کے ساتھی واپس چل پڑتے ہیں اور وہ اپنے ساتھیوں کے جوتوں کی آواز سن رہا ہوتا ہے، تو اس کے پاس دو فرشتے آ جاتے ہیں، وہ اسے بٹھا دیتے ہیں اور کہتے ہیں : ’’تو اس آدمی محمد صلی اللہ علیہ وسلم کے متعلق کیا کہتا تھا؟‘‘ اگر وہ مومن ہے تو کہتا ہے : ’’میں شہادت دیتا ہوں کہ وہ اللہ کے بندے اور اس کے رسول ہیں‘‘ تو اس سے کہا جاتا ہے کہ آگ میں اپنی جگہ دیکھ، اللہ تعالیٰ نے اسے بدل کر تجھے جنت میں جگہ دے دی ہے۔ چنانچہ وہ ان دونوں کو دیکھتا ہے، تو اس کے لیے اس کی قبر کو وسیع کر دیا جاتا ہے اور منافق اور کافر، اس سے کہا جاتا ہے : ’’تو اس آدمی(محمد صلی اللہ علیہ وسلم ) کے متعلق کیا کہا کرتا تھا؟‘‘ وہ کہتا ہے : ’’میں نہیں جانتا، جو کچھ لوگ کہتے تھے میں وہی کہا کرتا تھا۔‘‘ تو اس سے کہا جاتا ہے : ’’نہ تو نے کچھ جانا اور نہ جاننے کی کوشش کی۔‘‘ پھر اسے لوہے کے ہتھوڑوں کے ساتھ ایک ضرب ماری جاتی ہے تو وہ ایسا چیختا ہے کہ دو بھاری مخلوقوں (جن و انس) کے سوا سب چیزیں جو اس کے قریب ہوتی ہیں، اس آواز کو سنتی ہیں۔‘‘ ¤ قبر کا عذاب حق ہے۔ امام بخاری رحمہ اللہ نے کئی آیات و احادیث سے اسے ثابت فرمایا ہے، دیکھیے سورۂ بنی اسرائیل (۲۰)، سورۂ انعام (۹۳)، سورۂ توبہ (۱۰۱)، سورۂ مومن (۴۵، ۴۶) اور زیر تفسیر آیت۔ ابوہریرہ رضی اللہ عنہ فرماتے ہیں کہ نبی صلی اللہ علیہ وسلم یہ دعا کیا کرتے تھے : [ اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَ مِنْ عَذَابِ النَّارِ وَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ ] [ بخاری، الجنائز، باب التعوذ من عذاب القبر : ۱۳۷۷ ] بلکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جب تم میں سے کوئی شخص تشہد سے فارغ ہو تو چار چیزوں سے پناہ مانگے : [اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَعَذَابِ الْقَبْرِ وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ الْمَسِيْحِ الدَّجَّالِ ] اس کے بعد اپنے لیے جو چاہے دعا کرے۔‘‘ [ السنن الکبریٰ للنسائی : 389/1، ۳۹۰، ح : ۱۲۳۳، عن أبي ھریرۃ رضی اللہ عنہ ۔ صحیح ] اس لیے بعض ائمہ نے یہ دعا پڑھنا تشہد کے بعد واجب قرار دیا ہے، دوسری دعائیں اس کے بعد پڑھے۔ اتنی واضح آیات و احادیث کے باوجود بہت سے بدنصیب عذاب قبر کے منکر ہیں۔ وہ ان شاء اللہ بہت جلد اپنی آنکھوں سے سب کچھ دیکھ لیں گے۔ ¤ ➍ {وَ يَفْعَلُ اللّٰهُ مَا يَشَآءُ :} اہل ایمان کو ثابت رکھنا، ظالموں کو ہدایت سے محروم رکھنا، اللہ تعالیٰ جو چاہتا ہے کرتا ہے، اگر وہ چاہتا تو اپنی دوسری ساری مخلوق کی طرح جن و انس کو بھی اپنے احکام بجا لانے پر مجبور کر دیتا، مگر اس کی مرضی کہ اس نے ان دونوں کو ہدایت یا ضلالت، کفر یا ایمان کا اختیار دیا۔ اب جو جدھر جانا چاہتا ہے اللہ تعالیٰ اس کے لیے وہی راستہ آسان کر دیتا ہے۔ دیکھیے سورۂ دہر (۳) اور سورۂ لیل (۱ تا ۱۰)۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت29،28) ➊ { اَلَمْ تَرَ اِلَى الَّذِيْنَ بَدَّلُوْا …:’’ الْبَوَارِ ‘‘} یہ {’’بَارَ يَبُوْرُ‘‘ } (ن) کا مصدر ہے، معنی ہے:{’’ فَرْطُ الْكَسَادِ‘‘} یعنی انتہائی بے قدر و قیمت ہونا، پھر ہلاکت کے معنی میں استعمال ہونے لگا۔ (راغب) ¤ ➋ انسان کو اپنے وجود کی نعمت سب سے پہلے مفت ملی، اس نے اس کا شکر اپنے خالق کی اطاعت کے بجائے کفر، یعنی ناشکری اور اس کے وجود یا اطاعت و عبادت سے انکار کے ساتھ کیا اور جو شخص جس قدر سرداری اور نعمت سے بہرہ ور تھا اس نے اتنا ہی اپنی قوم کو غلط راستے پر لگا کر جہنم میں پہنچایا۔ اس لحاظ سے آیت عام ہے مگر سیاق و سباق اور مفسرین کے مطابق یہاں مراد کفار قریش ہیں کہ اللہ تعالیٰ نے انھیں ابراہیم علیہ السلام کی نسل میں پیدا فرما کر اپنے مقدس گھر کا متولی بنا دیا۔ امن و اطمینان اور دنیا کا ہر پھل اور نعمت مہیا فرمائی، انھوں نے اس کا بدلہ توحید اور اطاعتِ الٰہی کے بجائے عین کعبہ میں اور اس کے اردگرد تین سو ساٹھ بت رکھ کر اور اپنی قوم کو ہلاکت کے گھر میں اتار کر دیا، فرمایا : «{ اَوَ لَمْ نُمَكِّنْ لَّهُمْ حَرَمًا اٰمِنًا يُّجْبٰۤى اِلَيْهِ ثَمَرٰتُ كُلِّ شَيْءٍ } » [ القصص : ۵۷ ] ’’اور کیا ہم نے انھیں ایک باامن حرم میں جگہ نہیں دی؟ جس کی طرف ہر چیز کے پھل کھینچ کر لائے جاتے ہیں۔‘‘ اور دیکھیے سورۂ قریش۔ پھر رسول اللہ صلی اللہ علیہ وسلم کو ان میں مبعوث فرما کر دنیا اور آخرت میں سرداری کی نعمت حاصل کرنے کا موقع دیا، مگر انھوں نے آپ پر ایمان لانے اور آپ کی اطاعت کرنے کے بجائے کفر کو اختیار کیا اور آپ کو ہر ایذا دی، حتیٰ کہ آپ کو حرم میں قتل کر دینے کا منصوبہ بنا لیا، جس کے نتیجے میں ان کے پیروکاروں کو دنیا میں جنگوں، خصوصاً بدر وغیرہ اور آخر میں فتح مکہ کی صورت میں رسوائی اور بربادی ملی، شدید قحط اور مکہ میں قافلوں کی آمد رک جانے کی صورت میں آمدنی ختم ہونے سے انھیں بھوک اور خوف نے گھیر لیا اور آخرت میں جہنم میں جانے کی ہلاکت کا سامنا کرنا پڑا۔ چنانچہ فرمایا : «{ وَ ضَرَبَ اللّٰهُ مَثَلًا قَرْيَةً كَانَتْ اٰمِنَةً مُّطْمَىِٕنَّةً يَّاْتِيْهَا رِزْقُهَا رَغَدًا مِّنْ كُلِّ مَكَانٍ فَكَفَرَتْ بِاَنْعُمِ اللّٰهِ فَاَذَاقَهَا اللّٰهُ لِبَاسَ الْجُوْعِ وَ الْخَوْفِ بِمَا كَانُوْا يَصْنَعُوْنَ (112) وَ لَقَدْ جَآءَهُمْ رَسُوْلٌ مِّنْهُمْ فَكَذَّبُوْهُ فَاَخَذَهُمُ الْعَذَابُ وَ هُمْ ظٰلِمُوْنَ }» [ النحل : ۱۱۲، ۱۱۳ ] ’’اور اللہ نے ایک بستی کی مثال بیان کی جو امن والی، اطمینان والی تھی، اس کے پاس اس کا رزق کھلا ہر جگہ سے آتا تھا، تو اس نے اللہ کی نعمتوں کی ناشکری کی تو اللہ نے اسے بھوک اور خوف کا لباس پہنا دیا، اس کے بدلے جو وہ کیا کرتے تھے اور بلاشبہ یقینا ان کے پاس انھی میں سے ایک رسول آیا تو انھوں نے اسے جھٹلا دیا، تو انھیں عذاب نے اس حال میں پکڑ لیا کہ وہ ظالم تھے۔‘‘ ¤ ➌ {اَلَمْ تَرَ:} اس کے اولین مخاطب اگرچہ نبی کریم صلی اللہ علیہ وسلم ہیں مگر ہر وہ شخص اس کا مخاطب ہے جو مخاطب ہونے کی اہلیت رکھتا ہے۔ اللہ تعالیٰ نے اس لفظ کے ساتھ انسان خصوصاً کفار قریش کی نعمت کے مقابلے میں ناشکری اور کفرپر تعجب کا اظہار فرمایا ہے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت29،28) ➊ { اَلَمْ تَرَ اِلَى الَّذِيْنَ بَدَّلُوْا …:’’ الْبَوَارِ ‘‘} یہ {’’بَارَ يَبُوْرُ‘‘ } (ن) کا مصدر ہے، معنی ہے:{’’ فَرْطُ الْكَسَادِ‘‘} یعنی انتہائی بے قدر و قیمت ہونا، پھر ہلاکت کے معنی میں استعمال ہونے لگا۔ (راغب) ¤ ➋ انسان کو اپنے وجود کی نعمت سب سے پہلے مفت ملی، اس نے اس کا شکر اپنے خالق کی اطاعت کے بجائے کفر، یعنی ناشکری اور اس کے وجود یا اطاعت و عبادت سے انکار کے ساتھ کیا اور جو شخص جس قدر سرداری اور نعمت سے بہرہ ور تھا اس نے اتنا ہی اپنی قوم کو غلط راستے پر لگا کر جہنم میں پہنچایا۔ اس لحاظ سے آیت عام ہے مگر سیاق و سباق اور مفسرین کے مطابق یہاں مراد کفار قریش ہیں کہ اللہ تعالیٰ نے انھیں ابراہیم علیہ السلام کی نسل میں پیدا فرما کر اپنے مقدس گھر کا متولی بنا دیا۔ امن و اطمینان اور دنیا کا ہر پھل اور نعمت مہیا فرمائی، انھوں نے اس کا بدلہ توحید اور اطاعتِ الٰہی کے بجائے عین کعبہ میں اور اس کے اردگرد تین سو ساٹھ بت رکھ کر اور اپنی قوم کو ہلاکت کے گھر میں اتار کر دیا، فرمایا : «{ اَوَ لَمْ نُمَكِّنْ لَّهُمْ حَرَمًا اٰمِنًا يُّجْبٰۤى اِلَيْهِ ثَمَرٰتُ كُلِّ شَيْءٍ } » [ القصص : ۵۷ ] ’’اور کیا ہم نے انھیں ایک باامن حرم میں جگہ نہیں دی؟ جس کی طرف ہر چیز کے پھل کھینچ کر لائے جاتے ہیں۔‘‘ اور دیکھیے سورۂ قریش۔ پھر رسول اللہ صلی اللہ علیہ وسلم کو ان میں مبعوث فرما کر دنیا اور آخرت میں سرداری کی نعمت حاصل کرنے کا موقع دیا، مگر انھوں نے آپ پر ایمان لانے اور آپ کی اطاعت کرنے کے بجائے کفر کو اختیار کیا اور آپ کو ہر ایذا دی، حتیٰ کہ آپ کو حرم میں قتل کر دینے کا منصوبہ بنا لیا، جس کے نتیجے میں ان کے پیروکاروں کو دنیا میں جنگوں، خصوصاً بدر وغیرہ اور آخر میں فتح مکہ کی صورت میں رسوائی اور بربادی ملی، شدید قحط اور مکہ میں قافلوں کی آمد رک جانے کی صورت میں آمدنی ختم ہونے سے انھیں بھوک اور خوف نے گھیر لیا اور آخرت میں جہنم میں جانے کی ہلاکت کا سامنا کرنا پڑا۔ چنانچہ فرمایا : «{ وَ ضَرَبَ اللّٰهُ مَثَلًا قَرْيَةً كَانَتْ اٰمِنَةً مُّطْمَىِٕنَّةً يَّاْتِيْهَا رِزْقُهَا رَغَدًا مِّنْ كُلِّ مَكَانٍ فَكَفَرَتْ بِاَنْعُمِ اللّٰهِ فَاَذَاقَهَا اللّٰهُ لِبَاسَ الْجُوْعِ وَ الْخَوْفِ بِمَا كَانُوْا يَصْنَعُوْنَ (112) وَ لَقَدْ جَآءَهُمْ رَسُوْلٌ مِّنْهُمْ فَكَذَّبُوْهُ فَاَخَذَهُمُ الْعَذَابُ وَ هُمْ ظٰلِمُوْنَ }» [ النحل : ۱۱۲، ۱۱۳ ] ’’اور اللہ نے ایک بستی کی مثال بیان کی جو امن والی، اطمینان والی تھی، اس کے پاس اس کا رزق کھلا ہر جگہ سے آتا تھا، تو اس نے اللہ کی نعمتوں کی ناشکری کی تو اللہ نے اسے بھوک اور خوف کا لباس پہنا دیا، اس کے بدلے جو وہ کیا کرتے تھے اور بلاشبہ یقینا ان کے پاس انھی میں سے ایک رسول آیا تو انھوں نے اسے جھٹلا دیا، تو انھیں عذاب نے اس حال میں پکڑ لیا کہ وہ ظالم تھے۔‘‘ ¤ ➌ {اَلَمْ تَرَ:} اس کے اولین مخاطب اگرچہ نبی کریم صلی اللہ علیہ وسلم ہیں مگر ہر وہ شخص اس کا مخاطب ہے جو مخاطب ہونے کی اہلیت رکھتا ہے۔ اللہ تعالیٰ نے اس لفظ کے ساتھ انسان خصوصاً کفار قریش کی نعمت کے مقابلے میں ناشکری اور کفرپر تعجب کا اظہار فرمایا ہے۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت30) {وَ جَعَلُوْا لِلّٰهِ اَنْدَادًا …: ’’ اَنْدَادًا ‘‘ ’’نِدٌّ‘‘} کی جمع ہے۔ راغب نے لکھا ہے : {’’نَدِيْدُ الشَّيْئِ مُشَارِكُهُ فِيْ جَوْهَرِهِ ‘‘} کہ جو کسی چیز کے اصل میں شریک ہو، جبکہ مثل کا لفظ ہر مشارک پر بولا جاتا ہے، چنانچہ ہر ’’ند‘‘ مثل ہے مگر ہر مثل ’’ند‘‘ نہیں۔ (اس لیے اس کا ترجمہ شریک کیا جاتا ہے) یعنی وہ ان کی پوجا کرنے لگے اور دکھ درد میں انھیں پکارنے لگے۔ اس آیت میں اللہ تعالیٰ نے ان کا جرم شرک کا ارتکاب اور لوگوں میں اس کی اشاعت کے ذریعے سے انھیں اسلام سے روکنا اور گمراہ کرنا قرار دیا ہے۔ {’’تَمَتُّعٌ‘‘} کچھ وقت تک فائدہ اٹھانے کو کہتے ہیں۔ قرآن میں جہاں بھی یہ لفظ{ ’’ تَمَتَّعْ ‘‘} یا {’’ تَمَتَّعُوْا ‘‘} (یعنی فائدہ اٹھاؤ) آیا ہے، اس کا مطلب اس کی اجازت دینا نہیں بلکہ اس پر ڈانٹنا اور ڈرانا ہے، یعنی اچھا اگر تم باز نہیں آتے تو چند روز کے مزے اڑا لو، مگر کب تک؟ آخر کار تمھیں ہمیشہ ہمیشہ کے لیے جہنم میں رہنا ہے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت31) ➊ {قُلْ لِّعِبَادِيَ الَّذِيْنَ اٰمَنُوْا :} انسان سارے ہی اللہ کے بندے ہیں، مگر اللہ تعالیٰ کا {’’عِبَادِيْ‘‘} (میرے بندے) کہنا بہت بڑی عزت افزائی ہے، جیسا کہ فرمایا : «{ سُبْحٰنَ الَّذِيْۤ اَسْرٰى بِعَبْدِهٖ لَيْلًا }» [ بنی إسرائیل : ۱ ] ’’پاک ہے وہ جو راتوں رات اپنے بندے کو لے گیا۔‘‘ اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم کو حکم دیا کہ ان لوگوں سے کہہ دیں جن میں دو وصف ہیں، ایک تو یہ کہ وہ صرف میرے بندے ہیں، کسی غیر کے نہیں، جو اپنے نام عبداللہ، عبد الرحمٰن اور ان جیسے رکھتے ہیں، نہ کہ عبد الحسین، عبد النبی، پیراں دتہ، غوث بخش وغیرہ اور جو قولاً و عملاً صرف میری عبادت اور بندگی کرتے ہیں، نہ کہ کسی غیر کی اور دوسرا وصف یہ کہ وہ ایمان لے آئے ہیں۔ ¤ ➋ {يُقِيْمُوا الصَّلٰوةَ وَ يُنْفِقُوْا …:} یہ دونوں فعل لام امر مقدر کی وجہ سے مجزوم ہیں۔ اقامت کا معنی ہے سیدھا کرنا، یعنی نماز کو درست کرکے پڑھیں، اس میں ہمیشگی، وقت پر ادا کرنا، تمام ارکان کو صحیح ادا کرنا اور خشوع کے ساتھ ادا کرنا سب کچھ آ جاتا ہے۔ نماز میں بندگی کی ہر قسم کا کچھ نہ کچھ حصہ آ جاتا ہے، قبلہ کی طرف رخ حج سے مناسبت رکھتا ہے، قیام، رکوع سجود اور دو زانو ہونا غلامی اور بندگی کے اظہار کی مختلف صورتیں ہیں، نماز کے دوران میں کھانے پینے وغیرہ سے اجتناب روزے سے مناسبت رکھتا ہے، کاروبار چھوڑ کر آنا اس شخص کے لیے ممکن ہی نہیں جو اللہ کی راہ میں کچھ خرچ کرنے پر تیار ہی نہیں اور کئی اور چیزیں ایسی ہیں جو صرف نماز ہی میں ہیں، کسی اور عبادت میں نہیں۔ قرآن مجید میں اکثر نماز اور زکوٰۃ یا خرچ کرنا اکٹھا آیا ہے، کیونکہ اللہ تعالیٰ سے تعلق اور بندوں کے حقوق کی ادائیگی ان دونوں کے بغیر نہیں ہو سکتی۔ ¤ ➌ { مِمَّا رَزَقْنٰهُمْ سِرًّا وَّ عَلَانِيَةً :} اس میں دو باتوں کی طرف توجہ لازم ہے۔ ایک تو لفظ {’’مِنْ‘‘} ہے کہ اللہ نے ہمیں جوکچھ دیا ہے جان، مال، اولاد، قوت، علم، عزت، غرض جو شمار ہی نہیں ہو سکتا، وہ سارے کا سارا ہم سے خرچ کرنے کا مطالبہ نہیں کیا، کیونکہ اسے ہماری کمزوری کا علم ہے جو اس نے سورۂ محمد کی آیت (۳۶، ۳۷) میں ذکر فرمائی ہے۔ دوسرا لفظ {’’رَزَقْنَا‘‘} ہے کہ تم نے جو کچھ خرچ کرنا ہے ہمارے دیے ہوئے میں سے کرنا ہے، اگر یہ سوچو گے تو دل میں بخل نہیں آئے گا اور اگر سب کچھ اپنا سمجھو گے تو مشکل ہی سے خرچ کر سکو گے۔ {’’ سِرًّا ‘‘} یعنی پوشیدہ اس لیے کہ وہ ریا سے پاک ہے اور {’’ عَلَانِيَةً ‘‘} یعنی علانیہ اس لیے کہ دوسروں کو رغبت ہو، یا فرض زکوٰۃ ہو تو علانیہ دو، کیونکہ چھپا کر دینے سے زکوٰۃ نہ دینے کی تہمت کا خطرہ ہے۔ ¤ ➍ {مِّنْ قَبْلِ اَنْ يَّاْتِيَ يَوْمٌ لَّا بَيْعٌ فِيْهِ وَ لَا خِلٰلٌ : ’’ خِلٰلٌ ‘‘} یہ باب مفاعلہ کا مصدر ہے، بمعنی دلی دوستی، مراد ہے قیامت کا دن کہ جس میں نیک اعمال خریدے جا سکیں گے نہ کسی کی دوستی اور محبت کام آئے گی کہ اللہ تعالیٰ کی پکڑ سے بچا سکے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یعنی نیک عمل بکتے نہیں اور کوئی دوستی سے رعایت نہیں کرتا۔‘‘ (موضح) اللہ تعالیٰ نے دوسری جگہ فرمایا : «{ اَلْاَخِلَّآءُ يَوْمَىِٕذٍۭ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ اِلَّا الْمُتَّقِيْنَ }» [ الزخرف : ۶۷ ] ’’سب خلیل (دلی دوست) اس دن ایک دوسرے کے دشمن ہوں گے مگر متقی لوگ۔‘‘"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت32) ➊ { اَللّٰهُ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ …:} یعنی وہ اللہ جس کی ناشکری پر تم کمربستہ ہو، جس کی اطاعت اور بندگی سے روگردانی کر رہے ہو اور جس کے ساتھ بلادلیل شریک بنا رہے ہو، وہ تو وہ ذات ہے…۔ اس کے بعد ان تین آیات میں اللہ تعالیٰ کی دس نعمتیں شمار کی گئی ہیں اور آخر میں بتایا گیا ہے کہ اللہ تعالیٰ کی تمام نعمتیں شمار کرنے کی تم میں طاقت ہی نہیں۔ ¤ ➋ {الْفُلْكَ :} واحد جمع ایک ہی طرح ہے، بڑی کشتیاں، بحری جہاز۔ ¤ ➌ { وَ سَخَّرَ لَكُمُ الْاَنْهٰرَ : ’’ الْاَنْهٰرَ ‘‘ ’’نَهْرٌ‘‘} کی جمع ہے، ندی، نالے اور دریا۔ تم ان سے اپنی کھیتیاں سیراب کرتے ہو اور ان میں جہاز اور کشتیاں چلاتے ہو، مچھلیاں پکڑتے ہو، بجلی پیدا کرتے ہو، ان کے کناروں پر پہاڑوں میں راستے بناتے ہیں، غرض بے شمار فائدے اٹھاتے ہو۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت33){دَآىِٕبَيْنِ :} یہ {’’دَأَبَ يَدْأَبُ دَأْبًا‘‘} سے اسم فاعل کا تثنیہ ہے، مسلسل چلنا، یعنی اللہ تعالیٰ نے ان کے چلنے کے لیے جو نظام اور ضابطہ مقرر کر دیا ہے اس پر لگا تار چلے جا رہے ہیں، نہ کبھی تھمتے ہیں اور نہ بگڑتے ہیں اور نہ رفتار میں کمی بیشی ہوتی ہے۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت34) ➊ {وَ اٰتٰىكُمْ مِّنْ كُلِّ مَا سَاَلْتُمُوْهُ :} یعنی یہ سب کچھ اور بہت کچھ تمھارے مانگے بغیر دیا۔ علاوہ ازیں جو کچھ تم نے مانگا اس میں سے بھی جتنا چاہا اس نے تمھیں دیا۔{ ’’ مِنْ ‘‘ } تبعیضیہ ہے۔ ایک تفسیر یہ ہے کہ زبان حال یا قال سے تم نے جو مانگا، یعنی اس دنیا میں زندگی گزارنے کے لیے تمھاری حالت جو تقاضا کرتی تھی اور جو بھی تمھاری ضرورت ہو سکتی تھی اس نے اس میں سے جتنا چاہا تمھیں دیا۔ ¤ ➋ {وَ اِنْ تَعُدُّوْا نِعْمَتَ اللّٰهِ لَا تُحْصُوْهَا :} یعنی مختصر طور پر بھی نہیں گن سکو گے، کجا یہ کہ تم لا محدود نعمتوں کو شمار کر سکو، تو سوچو تم اس کا شکر کس طرح ادا کر سکتے ہو۔ (شوکانی) {’’ كَفَّارٌ ‘‘} بہت ناشکرا۔ {’’اَحْصٰي يُحْصِيْ اِحْصَاءً‘‘} (افعال) شمار کرنا، کیونکہ {’’اَلْحَصٰي‘‘} کا معنی کنکری ہے اور عرب کنکریوں کے ذریعے سے شمار کرتے تھے اور ظاہر ہے کہ کنکریوں سے محدود شمار ہی ہو سکتا ہے۔ ¤ ➌ { اِنَّ الْاِنْسَانَ لَظَلُوْمٌ كَفَّارٌ:} انسان پر اللہ تعالیٰ کے کتنے احسانات ہیں اور ہر آن ہوتے رہتے ہیں، مگر وہ ہے کہ ذرا تکلیف پہنچتی ہے تو ناشکری پر اتر آتا ہے۔ {’’ لَظَلُوْمٌ ‘‘} سے یہی مراد ہے، یا {’’ الْاِنْسَانَ ‘‘} میں الف لام عہد کا ہے اور مراد کافر انسان ہے کہ وہ اللہ کا حق دوسروں کو دے کر، یعنی غیر اللہ کی عبادت کرکے بہت بڑا ظلم کر رہا ہے۔ فرمایا : «{ اِنَّ الشِّرْكَ لَظُلْمٌ عَظِيْمٌ }» [لقمان : ۱۳ ]’’بے شک شرک یقینا بہت بڑا ظلم ہے۔‘‘ کیونکہ ظلم کا معنی ہے {’’ وَضْعُ الشَّيْءِ فِيْ غَيْرِ مَحَلِّهِ‘‘} کہ کسی چیز کو اس کی جگہ کے علاوہ رکھ دینا۔ تو کافر انسان اللہ کی نعمتیں استعمال کرکے نہ اس کی عبادت کرتا ہے نہ اطاعت بلکہ اللہ تعالیٰ کے احسانات کو مخلوق کے احسانات شمار کرتا ہے، کبھی کسی کو جھولی بھرنے والا کہتا ہے، کبھی کسی کو داتا کہتا ہے، کبھی کسی کو دستگیر، کبھی کسی کو مشکل کشا۔{’’ الْاِنْسَانَ ‘‘} سے مراد یہاں کافر انسان ہونے کی دلیل اس سلسلۂ آیات کی ابتدا بھی ہے، فرمایا : «{ اَلَمْ تَرَ اِلَى الَّذِيْنَ بَدَّلُوْا نِعْمَتَ اللّٰهِ كُفْرًا وَّ اَحَلُّوْا قَوْمَهُمْ دَارَ الْبَوَارِ (28) جَهَنَّمَ يَصْلَوْنَهَا وَ بِئْسَ الْقَرَارُ }» [ إبراہیم : ۲۸، ۲۹ ] ’’کیا تو نے ان لوگوں کی طرف نہیں دیکھا جنھوں نے اللہ کی نعمت کو ناشکری سے بدل دیا اور اپنی قوم کو ہلاکت کے گھر میں لا اتارا، جہنم میں، وہ اس میں داخل ہوں گے اور وہ برا ٹھکانا ہے۔‘‘ یہ اس کی زبردست ناشکری ہے۔ اے کافر انسان! افسوس تیری اس کافری اور ناشکری پر۔ کاش! تو اپنے اصل داتا اور دستگیر کا احسان مانتا، اسی کا شکر ادا کرتا: ¤ بتوں سے تجھ کو امیدیں خدا سے نومیدی ¤ مجھے بتا تو سہی اور کافری کیا ہے"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت35) ➊ {وَ اِذْ قَالَ اِبْرٰهِيْمُ رَبِّ اجْعَلْ …:} عام احسانات کا ذکر کرنے کے بعد اب خاص اس احسان کا ذکر کیا جا رہا ہے جو اللہ تعالیٰ نے مکہ والوں پر کیا تھا اور وہ تھا ان کے باپ ابراہیم علیہ السلام کا ان کے جد اعلیٰ اسماعیل علیہ السلام کو یہاں لا کر آباد کرنا۔ اس سلسلے میں یہ بھی بتایا جا رہا ہے کہ تمھارے باپ ابراہیم علیہ السلام نے کن تمناؤں کے ساتھ تمھیں یہاں لا کر بسایا تھا اور کس طرح اس شہر کے پرامن بنانے کی اور اپنے اور اپنے بیٹوں کے لیے بت پرستی سے محفوظ رہنے کی دعا کی تھی، مگر آج تم ان احسانات کو بھول گئے اور بت پرستی کو اپنا دین قرار دے دیا۔ ¤ ➋ { اٰمِنًا:} یہ {’’ذَا اَمْنٍ‘‘} (امن والا) کے معنی میں ہے، جیسے {’’لَابِنٌ‘‘} (دودھ والا) اور {’’تَامِرٌ‘‘} (کھجور والا) ہے۔ سورۂ بقرہ(۱۲۶) میں {’’ هٰذَا بَلَدًا اٰمِنًا ‘‘} اور یہاں {’’ هٰذَا الْبَلَدَ اٰمِنًا ‘‘} میں فرق یہ ہے کہ سورۂ بقرہ میں {’’هٰذَا‘‘} پہلا مفعول اور {’’ بَلَدًا اٰمِنًا ‘‘} دوسرا مفعول ہے، جب کہ یہاں { ’’ هٰذَا الْبَلَدَ ‘‘} پہلا مفعول اور{ ’’اٰمِنًا‘‘} دوسرا مفعول ہے۔ دونوں جگہ ترجمے کا فرق ملاحظہ فرمائیں۔ خلاصہ یہ ہے کہ سورۂ بقرہ (۱۲۶) میں موجود پہلی دعا {’’ رَبِّ اجْعَلْ هٰذَا بَلَدًا اٰمِنًا ‘‘} اس وقت کی ہے جب شہر نہیں بنا تھا، تو دعا کی کہ اس جگہ کو امن والا شہر بنا دے اور دوسری دعا اس وقت کی جب شہر بن چکا تھا، اسماعیل علیہ السلام بڑے ہو چکے تھے کہ پروردگارا! اس شہر کو امن والا بنا دے۔ امن ایک بہت بڑی نعمت ہے اور خوف بہت بڑی آزمائش ہے۔ رازی فرماتے ہیں، ایک عالم سے پوچھا گیا کہ اگر آپ کو بیماری اور خوف میں سے ایک کے انتخاب پر مجبور کیا جائے تو آپ کیا اختیار کریں گے؟ انھوں نے فرمایا، میں بیماری کو اختیار کروں گا کہ اس میں آدمی کھا پی اور سو تو سکتا ہے، خوف میں اس سے بھی محروم ہو جاتا ہے، آپ ایک بکری کا تصور کریں جس کی ٹانگ ٹوٹ جائے، وہ کھاتی پیتی رہے گی، سو بھی جائے گی، مگر ایک تندرست بکری جس کے سامنے بھیڑیا ہو، وہ نہ کھا سکے گی، نہ پی سکے گی اور نہ آرام کر سکے گی، حتیٰ کہ نوبت موت تک بھی پہنچ سکتی ہے۔ اس لیے اللہ تعالیٰ نے سورۂ قریش میں بھوک سے کھلانے اور خوف سے امن دینے کی نعمت کا ذکر فرما کر قریش کو خاص اپنی عبادت کا حکم دیا ہے۔ ¤ ➌ {وَ اجْنُبْنِيْ وَ بَنِيَّ اَنْ نَّعْبُدَ الْاَصْنَامَ: ’’جَنَبَ يَجْنُبُ‘‘} یہ ’’نصر‘‘ سے اور افعال اور تفعیل سے ایک ہی معنی میں آتا ہے۔ ’’صنم‘‘ اس پتھر یا لکڑی یا کسی دھات کے بنائے ہوئے بت، تصویر یا مجسمے کو کہتے ہیں جو کسی انسان یا فرشتے یا دیوتا کی حقیقی یا خیالی صورت پر پوجا کے لیے بنایا گیا ہو، جب کہ ’’وثن‘‘ ہر اس چیز کو کہتے ہیں جو غیر اللہ کی عبادت کے لیے مختص ہو، خواہ قبر ہو یا درخت یا دریا یا بت یا کوئی جانور یا انسان وغیرہ۔ ابراہیم علیہ السلام نے اپنی قوم اور اپنے والد کی صنم پرستی اور اس پر اصرار اپنی آنکھوں سے دیکھا تھا، اس لیے وہ اپنے یا اپنی اولاد کے اس میں مبتلا ہونے سے سخت خوف زدہ تھے، سو انھوں نے یہ دعا کی۔ {’’بَنِيَّ ‘‘} میں ساری اولاد شامل ہے، جیسے بنی آدم یا بنی اسرائیل۔ بیٹوں کی حد تک تو دعا قبول ہوئی، مگر ساری اولاد کے حق میں بعینہٖ قبول نہیں ہوئی، جیسا کہ فرمایا : «{ وَ مِنْ ذُرِّيَّتِهِمَا مُحْسِنٌ وَّ ظَالِمٌ لِّنَفْسِهٖ مُبِيْنٌ }» [ الصافات : ۱۱۳ ] ’’اور ان دونوں (ابراہیم اور اسحاق) کی اولاد میں سے کوئی نیکی کرنے والا ہے اور کوئی اپنی جان پر صریح ظلم کرنے والا ہے۔‘‘ یہ دلیل ہے کہ اللہ تعالیٰ اپنی مرضی کا مالک ہے، وہ اپنی حکمت کے مطابق دعا کرنے والے کی دعا کا جتنا حصہ چاہتا ہے اس کی خواہش کے مطابق پورا کر دیتا ہے اور جو حصہ چاہتا ہے کسی اور صورت میں عطا کر دیتا ہے۔ دعا کسی صورت بھی ضائع نہیں جاتی، البتہ مرضی اسی کی چلتی ہے، کسی دوسرے حتیٰ کہ انبیاء کی بھی نہیں۔ ہمیں بھی ہر وقت اس بات کی فکر رہنی چاہیے کہ ہم یا ہماری اولاد کسی طرح شرک میں مبتلا نہ ہو جائیں، ہمیں اپنی اولاد کے لیے دعا بھی کرنی چاہیے اور اسے توحید کی تعلیم بھی دینی چاہیے۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت36) ➊ {رَبِّ اِنَّهُنَّ اَضْلَلْنَ كَثِيْرًا مِّنَ النَّاسِ …: } صنم پرستی عام ہونے اور لوگوں کے بہت جلد اس میں مبتلا ہونے کی بڑی وجہیں دو ہیں، ایک تو یہ کہ ان دیکھے معبود (اللہ تعالیٰ) پر یقین رکھنے کے بجائے انسان چاہتا ہے کہ وہ ایسی چیز کی عبادت کرے جو اسے نظر آئے۔ اگرچہ اللہ تعالیٰ سے زیادہ ظاہر کوئی چیز نہیں، کیونکہ کائنات کی ہر چیز اپنے بنانے والے کے وجود اور توحید کی شہادت دے رہی ہے اور لطف یہ کہ اللہ تعالیٰ کے سوا کسی کا یہ دعویٰ نہیں کہ یہ زمین و آسمان اور ساری کائنات میں نے بنائی ہے، اگر کوئی یہ دعویٰ کرلے تو ہر شخص اسے جھوٹا کہے گا، بلکہ خود اس کا دل اسے جھٹلائے گا کہ آسمان و زمین تو تجھ سے اور تیرے باپ دادا سے لاکھوں برس پہلے کے بنے ہوئے ہیں۔ وہ اگرچہ ظاہر ہے مگر اس کی ذات سے زیادہ کوئی چیز آنکھوں سے غائب بھی نہیں، کیونکہ کسی میں اسے دیکھنے کی تاب ہی نہیں۔ [ھُوَ الْاَوَّلُ وَ الْاٰخِرُوَ الظَّاھِرُ وَالْبَاطِنُ] اس لیے وہ پہلا تقاضا ہی ایمان بالغیب کا کرتا ہے، کوئی اس کے دیدار کا شوق رکھے یا درخواست کرے، جیسے موسیٰ علیہ السلام نے کی تو وہ ناراض نہیں ہوتا بلکہ جنت میں اپنے دیدار کا وعدہ کرتا ہے، مگر کوئی ایمان لانے کے لیے دیکھنے کی شرط لگائے، جیسے بنی اسرائیل نے کہا : «{ لَنْ نُّؤْمِنَ لَكَ حَتّٰى نَرَى اللّٰهَ جَهْرَةً }» [ البقرۃ : ۵۵ ] ’’(اے موسیٰ!) ہم تیرے لیے ہر گز ایمان نہ لائیں گے جب تک اللہ کو صاف سامنے نہ دیکھ لیں‘‘ تو پھر اس کی آتش غضب بھڑک اٹھتی ہے، پھر کبھی تو وہ بجلی گرا کر بھسم کر دیتا ہے اور اکثر کو اس نے مہلت دے رکھی ہے، قیامت کو انھیں ان کے مطالبے کا جواب دے گا۔ غرض یہی انسان کی بے وقوفی ہے کہ جب وہ اپنی کمزوری کی بنا پر اللہ تعالیٰ کو آنکھوں سے دیکھ نہیں سکتا تو ایمان بالغیب کے بجائے نظر آنے والا رب گھڑ کر اس کی پوجا شروع کر دیتا ہے۔ اس کے ساتھ ہی دوسرا سبب محبت میں غلو بھی شامل ہو جاتا ہے، یعنی جس ہستی سے بھی اس کو حد سے زیادہ محبت ہوتی ہے، اسے نیک سمجھتا ہے یا اس کی ہیبت سے ڈرتا ہے، اس کا بت بنا کر اسے پوجنا شروع کر دیتا ہے۔ قوم نوح میں صنم پرستی کی ابتدا اسی طرح ہوئی۔ تفصیل کے لیے دیکھیے سورۂ نوح۔ بے شمار قوموں کے صنم پرستی میں مبتلا ہونے کی وجہ سے ابراہیم علیہ السلام کہہ رہے ہیں کہ اے پروردگار! ان بتوں نے بہت سے لوگوں کو گمراہ کر دیا، مراد یہ ہے کہ یہ ان کی گمراہی کا باعث بن گئے، جیسے کہتے ہیں کہ سڑک لاہور لے جاتی ہے، وہ تو صرف ذریعہ ہے، جانے والا جاتا تو خود ہے۔ ¤ ➋ {وَ مَنْ عَصَانِيْ فَاِنَّكَ غَفُوْرٌ رَّحِيْمٌ :} یہاں سے بعض لوگ کہتے ہیں کہ ابراہیم علیہ السلام نے اپنی نافرمانی کرنے والوں کے لیے بھی بخشش کی دعا کی، حالانکہ ان الفاظ سے یہ بات نہیں نکلتی، بلکہ صرف یہ بات نکلتی ہے کہ ان کا معاملہ تیرے سپرد ہے، تو چاہے تو بخش دے، چاہے تو عذاب دے اور ساتھ ہی عرض کی : ’’پس بے شک تو غفور و رحیم ہے۔‘‘ بلا شبہ اس میں نہایت ادب، عجز اور سلیقے سے ایک قسم کی سفارش ہے، مگر اسے اللہ تعالیٰ سے مغفرت کی دعا نہیں کہا جا سکتا، ہاں انھوں نے اپنے والد کے لیے وعدہ کی وجہ سے بخشش کی دعا کی تھی، پھر اللہ کا دشمن ثابت ہو جانے پر اس سے براء ت کا اظہار فرما دیا۔ (دیکھیے توبہ : ۱۱۴) قرآن میں ابراہیم اور عیسیٰ علیھما السلام سے منقول دعاؤں میں ہر نافرمان کا معاملہ، خواہ مشرک ہو یا عام گناہ گار، اللہ کے سپرد کیا گیا ہے، ساتھ ہی اللہ تعالیٰ کی بعض صفات کے ذکر کے ساتھ ایک قسم کی سفارش کا بھی اظہار ہوتا ہے۔ یہ ان دونوں پیغمبروں کی بے شمار تکلیفیں اٹھانے کے باوجود حد درجے کی نرم دلی ہے، عیسیٰ علیہ السلام کی دعا ہے : «{ اِنْ تُعَذِّبْهُمْ فَاِنَّهُمْ عِبَادُكَ وَ اِنْ تَغْفِرْ لَهُمْ فَاِنَّكَ اَنْتَ الْعَزِيْزُ الْحَكِيْمُ }» [ المائدۃ : ۱۱۸ ] سورۂ مائدہ میں اس آیت کا ترجمہ اور ہمارے رسول کریم صلی اللہ علیہ وسلم کا طرزِ عمل ملاحظہ فرمائیں۔ ¤ اس کے برعکس نوح علیہ السلام کی دعا تھی : «{ رَبِّ لَا تَذَرْ عَلَى الْاَرْضِ مِنَ الْكٰفِرِيْنَ دَيَّارًا }» [ نوح : ۲۶ ]’’اے میرے رب! زمین پر ان کافروں میں سے کوئی رہنے والا نہ چھوڑ۔‘‘ اور موسیٰ علیہ السلام کی دعا یہ تھی : «{ رَبَّنَا اطْمِسْ عَلٰۤى اَمْوَالِهِمْ وَ اشْدُدْ عَلٰى قُلُوْبِهِمْ فَلَا يُؤْمِنُوْا حَتّٰى يَرَوُا الْعَذَابَ الْاَلِيْمَ } » [ یونس : ۸۸ ] ’’اے ہمارے رب! ان کے مالوں کو مٹا دے اور ان کے دلوں پر سخت گرہ لگا دے، پس وہ ایمان نہ لائیں، یہاں تک کہ دردناک عذاب دیکھ لیں۔‘‘ ان دونوں نبیوں کی یہ دعائیں بھی بلاسبب نہ تھیں۔ نوح علیہ السلام کو اللہ تعالیٰ نے بتا دیا تھا کہ اب تمھاری قوم میں سے مزید کوئی ایمان نہیں لائے گا۔ ( دیکھیے ہود : ۳۶) اور فرعونیوں نے بہت سے معجزے دیکھ کر بھی کہہ دیا تھا کہ موسیٰ! تم جو بھی معجزہ لے آؤ ہم کسی صورت تم پر ایمان لانے والے نہیں۔ ( دیکھیے الاعراف : ۱۳۲) اب اگر وہ یہ دعا نہ کرتے تو کیا کرتے؟ ایسے موقع پر تو ابراہیم علیہ السلام بھی اپنے والد سے صاف لاتعلق ہو گئے تھے، فرمایا : «{ فَلَمَّا تَبَيَّنَ لَهٗۤ اَنَّهٗ عَدُوٌّ لِّلّٰهِ تَبَرَّاَ مِنْهُ } » [ التوبۃ : ۱۱۴ ] ’’پس جب اس کے لیے واضح ہو گیا کہ بے شک وہ اللہ کا دشمن ہے تو وہ اس سے بے تعلق ہو گیا۔‘‘"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت37) ➊ {رَبَّنَاۤ اِنِّيْۤ اَسْكَنْتُ مِنْ ذُرِّيَّتِيْ : ’’ مِنْ ‘‘} تبعیض کے لیے ہے۔ ’’کچھ اولاد‘‘ سے معلوم ہوتا ہے کہ جب ابراہیم علیہ السلام نے یہ دعا کی تو اس وقت اسحاق علیہ السلام پیدا ہو چکے تھے۔ انھیں اور ان کی والدہ سارہ علیھا السلام کو ابراہیم علیہ السلام نے دوسری جگہ (شام میں) ٹھہرایا ہوا تھا۔ ¤ ➋ {بِوَادٍ غَيْرِ ذِيْ زَرْعٍ:} وادی نیچی جگہ کو کہا جاتا ہے، جہاں کبھی پانی بہتا ہو، خصوصاً پہاڑوں کے درمیان گہری جگہ کو ’’وادی‘‘ کہتے ہیں۔ {’’ غَيْرِ ذِيْ زَرْعٍ ‘‘} مکہ اور اس کے گردو نواح بلکہ ارض عرب میں کھیتی باڑی نہیں تھی، کیونکہ بارش کے علاوہ وہاں پانی نہیں ملتا تھا اور زمین بھی پتھریلی یا ریتلی تھی، خصوصاً مکہ والی جگہ میں تو بالکل نہ پانی تھا نہ کھیتی باڑی۔ ان غیر آباد بیابان پہاڑوں کے درمیان اسماعیل اور ان کی والدہ ہاجر علیھما السلام کو لا کر چھوڑ جانے کا، پھر ہاجر علیھا السلام کے صفا و مروہ کے درمیان دوڑنے کا اور پانی تلاش کرنے اور زم زم کے پھوٹ نکلنے کا لمبا واقعہ صحیح بخاری میں ابن عباس رضی اللہ عنھما سے مذکورہے۔ [بخاری، أحادیث الأنبیاء، باب «یزفون » النسلان في المشي : ۳۳۶۴، ۳۳۶۵ ] ہزاروں سال بعد ابھی تک وہ {’’ غَيْرِ ذِيْ زَرْعٍ ‘‘} ہی ہے، البتہ طائف میں کچھ کھیتی باڑی اور پھل وغیرہ ہیں، مگر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا تَقُوْمُ السَّاعَةُ حَتّٰی يَكْثُرَ الْمَالُ وَيَفِيْضَ، حَتّٰی يَخْرُجَ الرَّجُلُ بِزَكَاةِ مَالِهٖ فَلَا يَجِدُ أَحَدًا يَقْبَلُهَا مِنْهُ، وَحَتّٰی تَعُوْدَ أَرْضُ الْعَرَبِ مُرُوْجًا وَأَنْهَارًا ] ’’قیامت قائم نہیں ہو گی جب تک کہ مال بہت زیادہ نہ ہو جائے، حتیٰ کہ آدمی اپنے مال کی زکوٰۃ لے کر نکلے گا، لیکن وہ کوئی ایسا شخص نہیں پائے گا جو اس سے اس کی زکوٰۃ لے لے اور جب تک ارض عرب دوبارہ مروج (سبزہ زار، کھلے کھیت) اور ندیوں نالوں کی صورت میں نہ بدل جائے۔‘‘ [مسلم، الزکاۃ، باب الترغیب في الصدقۃ قبل أن… : 157/60، قبل ح : ۱۰۱۳ ] لفظ {’’ تَعُوْدَ ‘‘} (دوبارہ نہ بدل جائے) سے معلوم ہوتا ہے کہ پہلے بھی کبھی یہ پہاڑ کشمیر کے پہاڑوں کی طرح سرسبز اور ندیوں نہروں والے تھے، قیامت کے قریب پھر اسی طرح ہو جائیں گے۔ ¤ ➌ {عِنْدَ بَيْتِكَ الْمُحَرَّمِ:} اس سے بعض مفسرین نے اخذ کیا ہے کہ یہ دعا ابراہیم علیہ السلام نے بیت اللہ تعمیر کرنے کے بعد کی، ممکن ہے ایسا ہی ہو مگر بیت اللہ تو ابراہیم علیہ السلام کے وہاں جانے سے بھی بہت پہلے تعمیر ہو چکا تھا، کیونکہ وہ زمین پر اللہ کی عبادت کے لیے بنایا جانے والا پہلا گھر ہے اور سب جانتے ہیں کہ زمین پر اللہ کی عبادت آدم علیہ السلام سے یا اس سے بھی پہلے سے شروع ہے، اس کے بانی ٔ اول آدم علیہ السلام ہیں یا اس سے بھی پہلے کی کوئی مخلوق، مثلاً فرشتے یا جن وغیرہ۔ ہاں ابراہیم علیہ السلام کے زمانے میں سیلابوں کی وجہ سے یہ ایک ٹیلے کی شکل میں بدل چکا تھا، وہ جگہ اللہ تعالیٰ نے ابراہیم علیہ السلام کو بتائی اور انھی پہلی بنیادوں پر دوبارہ کعبہ تعمیر ہوا۔ دیکھیے سورۂ بقرہ (۱۲۸) اور سورۂ حج (۲۶){ ’’ الْمُحَرَّمِ ‘‘ } اس لیے کہ کئی کام جو دوسری جگہ حلال ہیں مثلاً شکار کرنا، درخت کاٹنا وغیرہ، وہ یہاں حرام ہیں اور اس گھر کی عزت نہ کرنے والے کا یہاں طاقت کے ذریعے سے قبضہ حرام ہے، ممکن نہیں۔ اس لیے اس گھر کا لقب {’’اَلْبَيْتُ الْعَتِيْقُ‘‘} بھی ہے، یعنی جو ہمیشہ سے آزاد رہا۔ عتیق کا ایک معنی قدیم بھی ہے۔ ¤ ➍ { رَبَّنَا لِيُقِيْمُوا الصَّلٰوةَ: } معلوم ہوا کہ آدمی کو خود بھی اور اولاد کو بھی ایسی جگہ ٹھہرانا چاہیے جہاں اہل توحید کی مسجد پہلے سے موجود ہو، یا جب آدمی وہاں سکونت اختیار کرے تو سب سے پہلا کام اپنا مکان اور مسجد بیک وقت بنانے کا کرے، خواہ کچی اینٹوں کی چار دیواری ہی ہو، جیسا کہ ہمارے پیارے رسول صلی اللہ علیہ وسلم نے مدینہ میں آتے ہی کیا تھا، تاکہ اقامت صلاۃ میں کوئی مشکل پیش نہ آئے اور وہ آبادیاں تو رہنے کے قابل ہی نہیں جو نہایت عالی شان ہونے کے باوجود اکیلے اللہ کی عبادت کے لیے بنائی ہوئی مسجدوں سے خالی ہیں، یا وہاں ایسی مسجدیں گھر سے اتنی دور ہیں کہ نماز کے لیے وقت پر پہنچنا مشکل ہے۔ ¤ ➎ {فَاجْعَلْ اَفْىِٕدَةً مِّنَ النَّاسِ تَهْوِيْۤ اِلَيْهِمْ : ’’ اَفْىِٕدَةً ‘‘ ’’فُؤَادٌ‘‘} کی جمع ہے، یعنی دل، یا {’’وَفُوْدٌ‘‘} کی یعنی آنے والے۔ (عینی) {’’ مِنَ النَّاسِ ‘‘} کچھ لوگوں کے دل۔ {’’ مِنْ ‘‘ } تبعیض کے لیے ہے۔ {’’ تَهْوِيْۤ ‘‘ ’’ هَوَي يَهْوِيْ ‘‘} (ض) سے گرنا اور{ ’’ هَوِيَ يَهْوٰي ‘‘ } (ع) سے چاہنا اور محبت کرنا مراد ہوتا ہے۔ کوئی چیز جب بلندی سے گرتی ہے تو نہایت تیزی سے گرتی ہے اور بے اختیار ہو کر گرتی ہے، یعنی کچھ لوگوں کے دل ایسے بنا دے کہ بے اختیار اس کی طرف دوڑتے چلے آئیں۔ تفاسیر میں بعض صحابہ و تابعین سے منقول ہے کہ ابراہیم علیہ السلام اگر دعا میں ’’کچھ لوگوں‘‘ کی قید نہ لگاتے تو سب لوگوں کے دل، خواہ مسلم ہوتے یا یہود و نصاریٰ، اس کی طرف کھنچے چلے آتے۔ اس دعا کی قبولیت کا نظارہ ہر مسلمان اپنے دل میں اس گھر کے شوق سے اور وہاں حج وغیرہ کے لیے بار بار جانے والوں کی کثرت سے کر سکتا ہے۔ ¤ ➏ {وَ ارْزُقْهُمْ مِّنَ الثَّمَرٰتِ :} مکہ میں دنیا کے تمام خطوں سے ہر موسم کا تازہ پھل دیکھ کر اس دعا کی قبولیت آنکھوں سے نظر آتی ہے۔ اس دعا کی مزید تفسیر کے لیے دیکھیے سورۂ بقرہ (۱۲۴ تا ۱۲۷)۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت38) ➊ {رَبَّنَاۤ اِنَّكَ تَعْلَمُ مَا نُخْفِيْ …:} یعنی ہماری چھپی ہوئی دلی خواہشوں کو اور جو کچھ ہم زبان سے مانگ رہے ہیں تو سب جانتا ہے۔ یہ مانگنے کا بہترین طریقہ ہے کہ صرف تعریف پر اکتفا کیا جائے۔ ’’کتاب الاغانی (۸؍۳۴۴)‘‘ میں ہے کہ امیہ بن ابی الصلت نے عبد اللہ بن جدعان کو مخاطب کر کے کہا تھا: ¤ {أَ أَذْكُرُ حَاجَتِيْ أَمْ قَدْ كَفَانِيْ ¤ حَيَاءُكَ اِنَّ شِيْمَتَكَ الْحَيَاءُ ¤ إِذَا أَثْنَی عَلَيْكَ الْمَرْءُ يَومًا ¤ كَفَاهُ مِنْ تَعَرُّضِهِ الثَّنَاءُ} ¤ ’’کیا میں اپنی حاجت ذکر کروں یا یقینا مجھے تیری حیا ہی کافی ہے، کیونکہ تیری عادت ہی حیا ہے، جب آدمی کسی دن تیری تعریف کر دے تو اسے ضرورت پیش کرنے کے بجائے تعریف ہی کافی ہو جاتی ہے۔‘‘ ¤ سفیان بن عیینہ رحمہ اللہ نے فرمایا : ’’جب مخلوق کا یہ حال ہے تو خالق کا کیا حال ہو گا۔‘‘ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَفْضَلُ الذِّكْرِ لَا إِلٰهَ إِلاَّ اللّٰهُ وَ أَفْضَلُ الدُّعَاءِ الْحَمْدُ لِلّٰهِ ] [ ابن ماجہ، الأدب، باب فضل الحامدین : ۳۸۰۰۔ ترمذی : ۳۳۸۳، عن جابر رضی اللہ عنہ ] ’’سب سے بہتر ذکر لا الٰہ الا اللہ ہے اور سب سے بہتر دعا الحمد للہ ہے۔‘‘ مقصد یہ ہے کہ پروردگارا! ہم جو مانگ رہے ہیں اور جو کچھ ہمارے دل میں ہے تو سب کچھ جانتا ہے، بے شک اللہ پر آسمان میں کوئی چیز ہو یا زمین میں، مخفی نہیں رہتی۔ سو ہماری ظاہر درخواستوں کے ساتھ دلی مرادیں بھی پوری کر دے۔ یاد رہے کہ وہ مشہور روایت جس میں ذکر ہے کہ آگ میں پھینکے جانے کے وقت بارش کے فرشتے نے ابراہیم علیہ السلام کو مدد کی پیش کش کی تو یہ جاننے کے بعد کہ وہ اللہ تعالیٰ کے بھیجنے کے بجائے اپنی مرضی سے آیا ہے، تو انھوں نے مدد قبول کرنے سے انکار کر دیا اور جب اس نے کہا کہ پھر آپ خود ہی اللہ تعالیٰ سے دعاکریں تو فرمایا: [ حَسْبِيْ عَنْ سُؤَالِيْ عِلْمُهُ بِحَالِيْ ] یا فرمایا : [ عِلْمُهُ بِحَالِيْ يُغْنِيْ عَنْ سُؤَالِهِ ] ’’مجھے سوال کرنے کے بجائے یہی کافی ہے کہ وہ میرے حال کو جانتا ہے۔‘‘ سو یہ محض ایک اسرائیلی روایت ہے جس کی کچھ حقیقت نہیں، بلکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ لَّمْ يَدْعُ اللّٰهَ سُبْحَانَهُ غَضِبَ عَلَيْهِ ] ’’جو اللہ سبحانہ و تعالیٰ سے دعا نہ کرے اللہ تعالیٰ اس پر ناراض ہوتا ہے۔‘‘ [ ابن ماجہ، الدعاء، باب فضل الدعاء : ۳۸۲۷۔ السلسلۃ الصحیحۃ : 323/6، ح : ۲۶۵۴ ] اور اللہ تعالیٰ نے فرمایا : «{ وَ قَالَ رَبُّكُمُ ادْعُوْنِيْۤ اَسْتَجِبْ لَكُمْ اِنَّ الَّذِيْنَ يَسْتَكْبِرُوْنَ۠ عَنْ عِبَادَتِيْ سَيَدْخُلُوْنَ جَهَنَّمَ دٰخِرِيْنَ }» [ المؤمن : ۶۰ ] ’’اور تمھارے رب نے فرمایا مجھے پکارو (مجھ سے دعا کرو) میں تمھاری دعا قبول کروں گا، بے شک وہ لوگ جو میری عبادت سے تکبرکرتے ہیں عنقریب ذلیل ہو کر جہنم میں داخل ہوں گے۔‘‘ ایسی روایات صوفی لوگ اپنے خودساختہ وظائف و چلہ جات کو رائج کرنے اور دعا سے محروم کرنے کے لیے بیان کیا کرتے ہیں۔ ¤ ➋ بعض مفسرین نے فرمایا کہ اہل مکہ کے لیے صحیح عقیدے اور امن اور کھانے پینے کی چیزیں عطا کرنے کی دعا کے بعد ابراہیم علیہ السلام نے ہاجر و اسماعیل علیھما السلام سے جدائی کے وقت گزرنے والی کیفیت، جو آنکھوں کے آنسوؤں یا دل کی بے قراری کی وجہ سے دونوں میاں بیوی پر گزر رہی تھی، وہ پیش کی ہے، مگر شکوے کا ایک لفظ بھی زبان پر نہیں لائے، یہ حوصلہ پیغمبروں اور ان کے اہل بیت ہی کا ہوتا ہے۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت39) ➊ { اَلْحَمْدُ لِلّٰهِ الَّذِيْ وَهَبَ لِيْ …: ’’ وَهَبَ يَهَبُ هِبَةً ‘‘} کا معنی کسی معاوضے کے بغیر عطا کر دینا ہے۔ معلوم ہوا اولاد اللہ تعالیٰ کا ہبہ ہے، یہ صرف اسباب جمع ہو جانے سے نہیں ہوتی، ورنہ ہر تندرست جوڑے کے ملنے سے اولاد ہو جاتی، بلکہ یہ محض عطائے الٰہی ہے، وہ بھی اس کی مرضی کے مطابق ہوتی ہے، چاہے تو لڑکے ہی دے، چاہے لڑکیاں، چاہے دونوں ملا کر دے اور چاہے تو بے اولاد رکھے۔ (مزید دیکھیے الشوریٰ : ۵۰) رازی نے فرمایا، قرآن سے یہ بات معلوم ہوتی ہے کہ ابراہیم علیہ السلام کو یہ دونوں بیٹے بڑی عمر اور بڑھاپے میں عطا کیے گئے، لیکن یہ بات کہ اس وقت آپ کی عمر کیا تھی معلوم نہیں ہوتی، اس کے لیے صرف اسرائیلی روایات کی طرف رجوع کیا جاتا ہے، چنانچہ کہا جاتا ہے کہ اسماعیل علیہ السلام پیدا ہوئے تو ابراہیم علیہ السلام ننانویں (۹۹) برس کے تھے اور اسحاق علیہ السلام پیدا ہوئے تو آپ علیہ السلام کی عمر ایک سو بارہ (۱۱۲) برس تھی۔ مگر رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق ہم اس کی تصدیق یا تکذیب نہیں کر سکتے۔ ¤ ➋ {لَسَمِيْعُ الدُّعَآءِ:} لفظی معنی ہے ’’دعا کو بہت سننے والا‘‘ مگر مراد قبول کرنے والا ہے، جیسے کہا جاتا ہے، فلاں کی تو سنی گئی، یعنی مراد پوری ہو گئی۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت40) ➊ {رَبِّ اجْعَلْنِيْ مُقِيْمَ الصَّلٰوةِ:} یہ ابراہیم علیہ السلام کی عاجزانہ دعاؤں کا آخری حصہ ہے، جس میں انھوں نے اپنے لیے اور اپنی اولاد کے لیے اس چیز پر پابند رہنے کی دعا کی ہے جو توحید و رسالت کے یقین و اقرار کے بعد اسلام میں سب چیزوں سے زیادہ ضروری ہے، یعنی نماز جو خاشعین(عاجزی کرنے والوں) کے سوا سب لوگوں کے لیے نہایت دشوار ہے (دیکھیے بقرہ : ۴۵، ۴۶) اور جس کے متعلق موسیٰ علیہ السلام ({جَزَاهُ اللّٰهُ عَنَّا وَ عَنْ جَمِيْعِ أُمَّتِنَا أَحْسَنَ الْجَزَاءِ} ) نے کہا تھا کہ میں نے بنی اسرائیل کو بہت زیادہ بھگتا ہے، آپ کی امت پانچ نمازوں کی طاقت بھی نہیں رکھے گی۔ سو جو ایمان و کفر کے درمیان فرق کرنے والی سب سے نمایاں چیز ہے، ابراہیم علیہ السلام کو اس کی اتنی فکر تھی کہ اپنے اور اپنی اولاد کے لیے اس کی پابندی کی خاص طور پر دعا کی۔ ¤ ➋ {وَ مِنْ ذُرِّيَّتِيْ:} ’’اور میری اولاد میں سے بھی‘‘ بظاہر یہ{’’ مِنْ ‘‘} تبعیض کے لیے ہے، یعنی مجھے اور میری اولاد میں سے بھی کچھ نماز کے پابند بنا، مگر اس پر سوال یہ پیدا ہوتا ہے کہ انھوں نے ساری اولاد کے لیے یہ دعا کیوں نہ کی؟ اس کا جواب اکثر مفسرین نے یہ دیا ہے کہ ابراہیم علیہ السلام کو انسانی تاریخ سے اور اللہ تعالیٰ کے فرمان {’’ لَا يَنَالُ عَهْدِي الظّٰلِمِيْنَ ‘‘ } سے اندازہ تھا کہ ساری اولاد نمازی نہیں ہو سکے گی، اس لیے انھوں نے یہ دعا کی کہ ایسا نہ ہو کہ اولاد میں سے کوئی بھی نمازی نہ رہے، یہ اسی طرح ہے جیسا کہ انھوں نے دعا کی تھی : «{ رَبَّنَا وَ اجْعَلْنَا مُسْلِمَيْنِ لَكَ وَ مِنْ ذُرِّيَّتِنَاۤ اُمَّةً مُّسْلِمَةً لَّكَ }» [ البقرۃ : ۱۲۸ ] ’’اے ہمارے رب! اور ہمیں اپنے لیے فرماں بردار بنا اور ہماری اولاد میں سے بھی ایک امت اپنے لیے فرماں بردار بنا۔‘‘ ابن عاشور صاحب ’’ التحریر والتنویر‘‘ نے لکھا ہے : ’’یہ {’’ مِنْ ‘‘} ابتدائیہ ہے، تبعیض کے لیے نہیں اور{ ’’ مِنْ ذُرِّيَّتِيْ ‘‘} محذوف کی صفت ہے جس کا عطف یائے متکلم پر ہے۔ مقدر عبارت اس طرح ہو گی : {’’ رَبِّ اجْعَلْنِيْ مُقِيْمَ الصَّلٰوةِ وَاجْعَلْ مُقِيْمِيْنَ لِلصَّلَاةِ مِنْ ذُرِّيَّتِيْ‘‘ } یعنی مجھے نماز کا پابند بنا اور نماز کا پابند ان کو بھی بنا جو میری اولاد میں سے ہوں۔ {’’ وَ مِنْ ذُرِّيَّتِنَاۤ اُمَّةً مُّسْلِمَةً لَّكَ‘‘} کی ترکیب بھی اسی طرح ہو سکتی ہے۔ دلیل اس کی یہ ہے کہ دعا مانگتے وقت یہ کیسے ہو سکتا ہے کہ ابراہیم علیہ السلام بت پرستی سے بچنے کی دعا تو اپنے اور اپنی ساری اولاد کے لیے کریں، فرمایا : «{ وَ اجْنُبْنِيْ وَ بَنِيَّ اَنْ نَّعْبُدَ الْاَصْنَامَ }» [ إبراھیم : ۳۵ ] (اور مجھے اور میرے بیٹوں کو بت پوجنے سے بچائے رکھ) مگر نماز کا پابند بنانے کی دعا سب کے لیے کرنے کے بجائے بعض کے لیے کریں۔ جب ہم خود دعا کرتے وقت یہ پسند نہیں کرتے کہ یہ دعا کریں کہ یا اللہ! ہماری کچھ اولاد کو نمازی بنا تو ابراہیم علیہ السلام یہ کیسے پسند کر سکتے ہیں؟‘‘ ابن عاشور کی بات دل کو لگتی ہے۔ (واللہ اعلم) ¤ ➌ {رَبَّنَا وَ تَقَبَّلْ دُعَآءِ: } دعا کے بعد پھر قبولیت کی درخواست اپنے عجز کا اظہار اور قبولیت پر اصرار ہے۔{ ’’ دُعَآءِ ‘‘} پر کسرہ اس لیے ہے کہ یہ اصل میں [’’ دُعَائِيْ‘‘] تھا، آیات کے فواصل کی موافقت کے لیے یاء حذف کرکے کسرہ اس پر دلالت کے لیے باقی رکھا گیا ہے۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت41) {رَبَّنَا اغْفِرْ لِيْ وَ لِوَالِدَيَّ وَ لِلْمُؤْمِنِيْنَ …:} والد کے لیے بخشش کی دعا وہ وعدہ پورا کرنے کے لیے تھی جو انھوں نے گھر سے نکلتے وقت اس سے کیا تھا، مگر جب وہ شرک ہی پر فوت ہو گیا اور اللہ سے اس کی دشمنی ختم ہونے کی امید ہی نہ رہی تو وہ اس سے صاف بری ہو گئے۔ (دیکھیے توبہ : ۱۱۴) رہی اپنی والدہ کے لیے دعا تو شاید وہ پہلے ہی مسلمان ہو چکی ہوں گی، اللہ تعالیٰ نے ان کے متعلق تفصیل سے کچھ بیان نہیں فرمایا۔ تمام مومنین کے حق میں مغفرت کی دعا نوح علیہ السلام (نوح : ۲۸) سے لے کر ہمارے نبی کریم صلی اللہ علیہ وسلم (بخاری : ۷۵۱۰) تک انبیاء اور اہلِ ایمان کرتے چلے آئے ہیں۔ (دیکھیے حشر : ۱۰)"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت42) ➊ {وَ لَا تَحْسَبَنَّ اللّٰهَ غَافِلًا …:’’ الظّٰلِمُوْنَ ‘‘} سے مراد یہاں کفار اور مشرکین ہیں اور یہ بات اس سورت کی آیت (۴۴) سے صاف واضح ہو رہی ہے، یعنی اگر اللہ تعالیٰ ان کفار کو مہلت دے رہا ہے تو مت سمجھو کہ وہ ان کے اعمال سے بے خبر ہے۔ ¤ ➋ { اِنَّمَا يُؤَخِّرُهُمْ …: ’’ تَشْخَصُ ‘‘} باب {’’ مَنَعَ ‘‘} سے ہے، {’’شُخُوْصٌ‘‘} کا معنی ہے خوف اور گھبراہٹ کی وجہ سے آنکھوں کا کھلا رہ جانا، حرکت نہ کرنا۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت43){’’ مُهْطِعِيْنَ ‘‘} تیز دوڑنے والے۔ {’’ أَهْطَعَ يُهْطِعُ ‘‘} (افعال) کا معنی ہے تیز دوڑنا۔ یہ لفظ سورۂ قمر (۸) اور سورۂ معارج (۳۶) میں بھی انھی معنوں میں استعمال ہوا ہے، یعنی قبروں سے نکل کر صور کی آواز کی طرف تیزی سے اس طرح دوڑ کر جا رہے ہوں گے کہ سر اوپر کی طرف اٹھے ہوئے اور آنکھیں کھلی، ٹکٹکی بندھی ہو گی۔{ ’’ مُقْنِعِيْ ‘‘} یہ لفظ اصل میں باب افعال سے مذکر اسم فاعل {’’مُقْنِعِيْنَ‘‘ } تھا، {’’ رُءُوْسِهِمْ ‘‘} کی طرف مضاف ہونے سے نون گر گیا، اس کا معنی ہے دائیں بائیں دیکھے بغیر اوپر کو سر اٹھانا، بعض نے اس کا معنی سر جھکانا بھی کیا ہے۔ (طنطاوی) {’’ أَفْئِدَةٌ ‘‘ ’’ فُؤَادٌ ‘‘} کی جمع ہے، بمعنی دل۔{ ’’هَوَآءٌ‘‘ } کا معنی ہے خالی، یعنی ان کے دل گھبراہٹ کی وجہ سے سوچ سمجھ سے خالی ہوں گے۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت44) ➊ {وَ اَنْذِرِ النَّاسَ يَوْمَ يَاْتِيْهِمُ الْعَذَابُ …: } یعنی لوگوں کو اس دن سے ڈرایے۔ لوگوں سے مراد تمام لوگ ہیں، کیونکہ ڈرانے کی ضرورت تو نیک و بد ہر شخص کو ہے۔ اگرچہ اہل ایمان کی جزا کا بھی وہی دن ہے مگر یہاں مقام ڈرانے کا ہے، اس لیے اسی کا ذکر فرمایا، یا {’’ النَّاسَ ‘‘ } سے خصوصاً کفار مراد ہیں۔ عذاب کا دن ظالموں کے لیے دنیا میں کسی وقت اور کسی صورت میں ہو سکتا ہے، موت کا وقت بھی مراد ہے اور قیامت کا بھی۔ اس وقت کفار اللہ تعالیٰ کی دعوت قبول کرنے اور رسولوں کی پیروی کرنے کے لیے مہلت مانگیں گے، مگر مہلت کہاں۔ اس مفہوم کی آیات قرآن مجید میں بہت ہیں، تفصیل کے لیے دیکھیے سورۂ مومنون ( ۹۹، ۱۰۰)، سورۂ سجدہ (۱۲) اور منافقون (۹، ۱۰)۔ ¤ ➋ { اَوَ لَمْ تَكُوْنُوْۤا اَقْسَمْتُمْ مِّنْ قَبْلُ …: ’’ زَوَالٍ ‘‘} کا معنی ایک جگہ سے دوسری جگہ، یا ایک حالت سے دوسری کی طرف منتقل ہونا ہے، یہاں مراد دوبارہ زندہ ہو کر اور قبروں سے نکل کر آخرت کی زندگی کی طرف منتقل ہونا ہے۔ یعنی اللہ تعالیٰ کی طرف سے فرشتے انھیں کہیں گے کہ تم نے تو دنیا میں قسمیں کھائی تھیں کہ مرنے کے بعد ہمیں کبھی دوبارہ زندہ نہیں کیا جائے گا۔ اس کا مقصد انھیں ان کا ماضی یاد دلا کر مزید ذلیل و خوار کرنا ہو گا، جیسا کہ فرمایا : «{ وَ اَقْسَمُوْا بِاللّٰهِ جَهْدَ اَيْمَانِهِمْ لَا يَبْعَثُ اللّٰهُ مَنْ يَّمُوْتُ بَلٰى وَعْدًا عَلَيْهِ حَقًّا وَّ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ }» [ النحل : ۳۸ ] ’’اور انھوں نے اپنی پکی قسمیں کھاتے ہوئے اللہ کی قسم کھائی کہ اللہ اسے نہیں اٹھائے گا جو مر جائے۔ کیوں نہیں! وعدہ ہے اس کے ذمے سچا اور لیکن اکثر لوگ نہیں جانتے۔‘‘ یہ مطلب بھی ہو سکتا ہے کہ تم تو ایسے متکبر بن گئے اور موت کو بھول بیٹھے تھے کہ قسمیں اٹھاتے تھے کہ ہمارے عروج کو کبھی زوال نہیں۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت45){وَ سَكَنْتُمْ فِيْ مَسٰكِنِ الَّذِيْنَ ظَلَمُوْۤا اَنْفُسَهُمْ …:} یعنی تم لوگ اسی عرب، یمن، عراق اور مصر وغیرہ میں رہ رہے ہو جہاں تم سے پہلے عاد، ثمود، قوم نوح و ابراہیم، قوم لوط اور قوم فرعون رہتے تھے اور ان کے گناہوں کی سزا میں ہم نے ان پر جو عذاب نازل کیے وہ سب تمھیں اچھی طرح معلوم ہو چکے، گو تم زبان سے اقرار نہیں کرتے۔ ہم نے تو تمھیں اپنی کتابوں میں اور اپنے پیغمبروں کی زبانی مثالیں دے دے کر بھی سمجھایا، مثلاً مکھی کی مثال (حج : ۷۳)، عنکبوت یعنی مکڑی کی مثال۔ (عنکبوت : ۴۱)، کتے کی مثال (اعراف : ۱۷۶) اور سراب کی مثال (نور : ۳۹) وغیرہ۔ اس کے علاوہ پہلے کفار کے انجام بطور مثال بھی مراد ہو سکتے ہیں، مثلاً عاد وثمود، فرعون، قوم نوح وغیرہم۔ دیکھیے سورۂ رعد (۶) اور یونس (۱۰۲)۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت46) ➊ {وَ قَدْ مَكَرُوْا مَكْرَهُمْ …: } یعنی ان پہلے کفار اور موجودہ کفار نے اپنے انبیاء اور اہل ایمان کے خلاف اپنی زیادہ سے زیادہ اور خطرناک سے خطرناک جو بھی خفیہ تدبیر اور سازش وہ کر سکتے تھے کی۔ {’’ مَكْرَهُمْ ‘‘} سے یہی مراد ہے اور اللہ کو ان کی ہر سازش کا علم تھا۔ اس آیت کے تحت تفسیروں میں نمرود کا قصہ بھی ذکر کر دیا گیا ہے جو صحت کے ساتھ ثابت نہیں۔ (رازی) ¤ ➋ {وَ اِنْ كَانَ مَكْرُهُمْ لِتَزُوْلَ مِنْهُ الْجِبَالُ:} یہ{ ’’ اِنْ ‘‘} نافیہ (یعنی نہیں کے معنی میں) ہے، اس کے بعد لام پر کسرہ ہے، اسے لام جحد کہتے ہیں جو نفی کی تاکید کے لیے آتا ہے اور اس کے بعد فعل مضارع {’’أَنْ‘‘} کے ساتھ منصوب ہوتا ہے جو لام جحد کے بعد وجوباً محذوف ہوتا ہے۔ عام قراء ت یہی ہے اور اس کا معنی یہ ہے کہ ’’ان کی تدبیر ہر گز ایسی نہ تھی کہ اس سے پہاڑ ٹل جائیں‘‘ یعنی اللہ کا دین جو پہاڑوں کی طرح مستحکم ہے ان کی سازشیں کسی صورت اسے نقصان نہ پہنچا سکتی تھیں۔ ¤ کسائی کی قراء ت اس سے مختلف ہے، وہ {’’ لِتَزُوْلَ ‘‘} کو لام کے فتح کے ساتھ اور {’’ تَزُوْلُ‘‘ } کو مرفوع پڑھتے ہیں۔ اس صورت میں {’’ وَ اِنْ كَانَ مَكْرُهُمْ ‘‘} میں{ ’’ اِنْ ‘‘ ’’إِنَّهُ‘‘} کا (یعنی حرف مشبہ بالفعل{ ’’إِنَّ‘‘} اور اس کے اسم ضمیر شان {’’ هٗ ‘‘ } کا قائم مقام) مخفف ہے اور{ ’’لَتَزُوْلُ‘‘} میں لامِ ابتدا تاکید کے لیے ہے۔ معنی یہ ہو گا کہ یقینا ان کی تدبیر اور سازش ایسی خطرناک اور شدید خوف ناک تھی کہ پہاڑ بھی (اگر کسی طرح اپنی جگہ سے ٹل سکتے تو) ان سازشوں سے ضرور ہی ٹل جاتے۔ ¤ یاد رہے کہ یہ ترجمہ {’’لَتَزُوْلُ‘‘} یعنی لامِ ابتدا مفتوح اور آخری لام مرفوع پڑھنے کی صورت میں ہو گا، پہلی قراء ت (یعنی پہلا لام مکسور اور آخری منصوب) کا یہ ترجمہ اگر کوئی کرلے تو وہ درست نہیں ہو گا۔ معنوی طور پر دوسری قراء ت بھی بہت عمدہ ہے اور پہلی بھی۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت47){فَلَا تَحْسَبَنَّ اللّٰهَ مُخْلِفَ وَعْدِهٖ رُسُلَهٗ …:} اللہ کے وعدے سے مراد دنیا و آخرت میں اللہ کے رسولوں اور اہل ایمان کی نصرت و عزت ہے، جیسا کہ فرمایا : «{ لَنَنْصُرُ رُسُلَنَا وَ الَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَ يَوْمَ يَقُوْمُ الْاَشْهَادُ}» [ المؤمن : ۵۱ ] ’’بے شک ہم اپنے رسولوں کی اور ان لوگوں کی جو ایمان لائے ضرور مدد کرتے ہیں دنیا کی زندگی میں اور جس دن گواہ کھڑے ہوں گے۔‘‘ مزید دیکھیے سورۂ مجادلہ (۲۱) اور سورۂ ابراہیم (۱۳، ۱۴) کی تفسیر۔ اس سے مقصود ایک طرف تو رسول اللہ صلی اللہ علیہ وسلم کو تسلی دینا اور دوسری طرف آپ کے مخالفین کو متنبہ کرنا ہے کہ جس طرح پہلے انبیاء علیھم السلام سے جو ہم نے وعدے کیے وہ سب پورے کیے اسی طرح اپنے آخری رسول صلی اللہ علیہ وسلم سے تائید و نصرت کا جو وعدہ کر رہے ہیں اسے بھی یقینا پورا کریں گے اور ان لوگوں کو تباہ و برباد کریں گے جو آپ کی مخالفت پر کمربستہ ہیں، کیونکہ اللہ سب پر غالب ہے، انتقام والا ہے۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت48) ➊ {يَوْمَ تُبَدَّلُ الْاَرْضُ غَيْرَ الْاَرْضِ وَ السَّمٰوٰتُ:} اس سے معلوم ہوا کہ قیامت کے روز زمین و آسمان کی موجودہ شکل و صورت بدل جائے گی۔ ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ تَكُوْنُ الْأَرْضُ يَوْمَ الْقِيَامَةِ خُبْزَةً وَاحِدَةً يَتَكَفَّؤُهَا الْجَبَّارُ بِيَدِهِ كَمَا يَكْفَؤُ أَحَدُكُمْ خُبْزَتَهُ فِي السَّفَرِ نُزُلًا لِأَهْلِ الْجَنَّةِ ] [ بخاري، الرقاق، باب یقبض اللہ الأرض یوم القیامۃ : ۶۵۲۰۔ مسلم : ۲۷۹۲ ] ’’قیامت کے دن زمین ایک روٹی بن جائے گی، جبار (اللہ تعالیٰ) اسے اپنے ہاتھ میں الٹ پلٹ کرے گا جس طرح تم میں سے کوئی شخص سفرمیں اپنی روٹی الٹ پلٹ کرتا ہے، اہلِ جنت کی مہمان نوازی کے لیے۔‘‘ سہل بن سعد رضی اللہ عنہ بیان کرتے ہیں کہ میں نے نبی صلی اللہ علیہ وسلم سے سنا، فرماتے تھے : [ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلٰی أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ نَقِيٍّ، لَيْسَ فِيْهَا مَعْلَمٌ لِأَحَدٍ ] [ بخاري، الرقاق، باب یقبض اللّٰہ الأرض یوم القیامۃ : ۶۵۲۱۔ مسلم : ۲۷۹۰ ] ’’لوگ قیامت کے دن سفید مٹیالی زمین پر اکٹھے کیے جائیں گے، جیسے میدے کی روٹی ہوتی ہے، اس میں کسی کا کوئی نشان نہیں ہو گا۔‘‘ قرآن مجید میں بھی ہے کہ قیامت کے دن زمین صاف چٹیل میدان بن جائے گی جس میں کوئی بلندی یا پستی نظر نہیں آئے گی۔ (دیکھے طٰہٰ : ۱۰۵ تا ۱۰۷) رہا یہ سوال کہ یہ تبدیلی زمین و آسمان کی ذات میں ہو گی یا ان کی صفات میں، تو اس کے بارے میں قرآن مجید یا حدیث رسول صلی اللہ علیہ وسلم سے کوئی چیز ثابت نہیں، اس لیے ہمیں اسی پر یقین رکھنا ہو گا جو قرآن کے الفاظ سے ظاہر ہو رہا ہے۔ ¤ ➋ { وَ بَرَزُوْا لِلّٰهِ الْوَاحِدِ الْقَهَّارِ:} یہ ان مشرکین کے ردّ کے لیے فرمایا جو اپنے شرکاء کا بھی کچھ اختیار سمجھتے ہیں کہ اس دن سب لوگ اس اللہ تعالیٰ کے سامنے پیش ہوں گے جو اکیلا ہے، بڑا زبردست ہے، کوئی دوسرا کسی اختیار کا مالک نہ ہو گا۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت49) ➊ {وَ تَرَى الْمُجْرِمِيْنَ يَوْمَىِٕذٍ مُّقَرَّنِيْنَ : ’’قَرَنٌ‘‘ } قاف اور راء کے فتحہ کے ساتھ، وہ رسی جس میں دو بیل یا دو آدمی اکٹھے بندھے ہوتے ہیں۔ {’’ مُقَرَّنِيْنَ ‘‘ } کئی آدمی جو آپس میں اکٹھے جکڑے ہوتے ہوں۔ سورۂ صٓ (۳۸) میں ہے : «{وَ اٰخَرِيْنَ مُقَرَّنِيْنَ فِي الْاَصْفَادِ }» یعنی سلیمان علیہ السلام کے تابع کئی جن کر دیے جو زنجیروں میں باہم جکڑے ہوئے تھے۔ لسان العرب میں ہے کہ {’’ مُقَرَّنِيْنَ ‘‘} یا تو{ ’’مَقْرُوْنِيْنَ‘‘ } کے معنی میں ہے، یا باب تفعیل تکثیر کے لیے ہے، یعنی کئی مجرم آپس میں زنجیروں میں بری طرح جکڑے ہوئے ہوں گے۔ ¤ ➋ {فِي الْاَصْفَادِ: ’’ الْاَصْفَادِ ‘‘ ’’صَفَدٌ‘‘} (فاء کے فتحہ کے ساتھ) کی جمع ہے جو اس زنجیر کو کہتے ہیں جو پاؤں میں ڈالی جائے، یا وہ طوق جس کے ساتھ ہاتھ پاؤں کو گردن کی طرف باندھ دیا جاتا ہے۔ [ الوسیط للطنطاوی ] یعنی اے مخاطب! تو اس دن کئی مجرموں کو ایک دوسرے کے ساتھ زنجیروں میں بندھے ہوئے دیکھے گا۔ ہر قسم کا مجرم اپنے جیسے مجرموں کے ساتھ جکڑا ہوا ہو گا۔ دیکھیے سورۂ فرقان (۱۳) اور سورۂ حاقہ (۳۰ تا ۳۳) اور ہر فاسق اپنے جیسے فاسق کے ساتھ ہو گا۔ دیکھیے سورۂ صافات (۲۲، ۲۳) اور مریم (۶۸)۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت50){سَرَابِيْلُهُمْ مِّنْ قَطِرَانٍ: ’’سَرَابِيْلُ‘‘ ’’سِرْبَالٌ‘‘} کی جمع ہے، بمعنی قمیص۔ {’’ قَطِرَانٍ ‘‘} کا معنی قاموس اور لسان العرب میں ہے ابہل، صنوبر (چلغوزہ) اور اس قسم کے درختوں مثلاً چیڑ یا دیار وغیرہ سے نکلنے والی گوند، یعنی رال یا گندہ بیروزا جو تیزی سے جلتا ہے اور سخت بدبو دار ہوتا ہے، خارش زدہ اونٹوں کو ملا جاتا ہے۔ تمام مترجمین کی طرح میں نے بھی پہلے اس کا ترجمہ گندھک کیا تھا، مگر تفسیر کے وقت مختلف لغات دیکھنے سے معلوم ہوا کہ{ ’’ قَطِرَانٍ ‘‘} رال (بیروزا) ہے۔ بعض اہلِ علم نے اس کا ترجمہ تارکول کیا ہے۔ معلوم ہوتا ہے کہ چونکہ اس کا مادہ {’’قَطْرٌ‘‘} ٹپکنے کا مفہوم رکھتا ہے، اس لیے اس میں وہ تمام مائع چیزیں مراد ہو سکتی ہیں جو اشتعال پذیر یعنی شعلہ پکڑنے والی ہیں۔ (واللہ اعلم) ابومالک اشعری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلنَّائِحَةُ إِذَا لَمْ تَتُبْ قَبْلَ مَوْتِهَا تُقَامُ يَوْمَ الْقِيَامَةِ وَعَلَيْهَا سِرْبَالٌ مِنْ قَطِرَانٍ، وَدِرْعٌ مِنْ جَرَبٍ ] [ مسلم، الجنائز، باب التشدید في النیاحۃ : ۹۳۴ ] ’’نوحہ یعنی ماتم و بین کرنے والی عورت اگر مرنے سے پہلے توبہ نہ کرے تو قیامت کے دن اس حال میں اٹھائی جائے گی کہ اس پر {’’قَطِرَانٌ‘‘} کی قمیص اور خارش کا کرتہ ہو گا۔‘‘ ابن عباس رضی اللہ عنھما کی قراء ت ہے {’’مِنْ قَطِرٍ آنٍ ‘‘} یعنی ان کی قمیصیں کھولتے ہوئے تانبے سے ہوں گی، مگر پہلی قراء ت {’’ قَطِرَانٍ ‘‘ } متواتر اور راجح ہے۔ چہروں کو آگ سے ڈھانپنے کا خصوصاً ذکر اس لیے فرمایا کہ یہ جسم کا سب سے باعزت حصہ ہے، اس کا حال یہ ہو گا تو دوسرے حصوں کا کیا حال ہوگا۔ ¤ یہ معاملہ کفار کے ساتھ ہو گا، کیونکہ مومنوں کے سجدے کے آثار (نشانات) کو جلانا اللہ تعالیٰ نے آگ پر حرام کر دیا ہے۔ ابوہریرہ رضی اللہ عنہ کی ایک لمبی حدیث، جس میں قیامت کے کچھ احوال بیان ہوئے ہیں، اس میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ حَتّٰی إِذَا فَرَغَ اللّٰهُ مِنَ الْقَضَاءِ بَيْنَ الْعِبَادِ، وَ أَرَادَ أَنْ يُخْرِجَ بِرَحْمَتِهِ مَنْ أَرَادَ مِنْ أَهْلِ النَّارِ، أَمَرَ الْمَلاَئِكَةَ أَنْ يُخْرِجُوْا مِنَ النَّارِ مَنْ كَانَ لاَ يُشْرِكُ بِاللّٰهِ شَيْئًا، مِمَّنْ أَرَادَ اللّٰهُ أَنْ يَرْحَمَهُ مِمَّنْ يَشْهَدُ أَنْ لَّا إِلٰهَ إلَّا اللّٰهُ، فَيَعْرِفُوْنَهُمْ فِي النَّارِ بِأَثَرِ السُّجُوْدِ، تَأْكُلُ النَّارُ ابْنَ آدَمَ إِلاَّ أَثَرَ السُّجُوْدِ، حَرَّمَ اللّٰهُ عَلَی النَّارِ أَنْ تَأْكُلَ أَثَرَ السُّجُوْدِ ] [ بخاری، التوحید، باب قول اللّٰہ تعالٰی : «وجوہ یومئذ ناضرۃ…» : ۷۴۳۷ ] ’’جب اللہ تعالیٰ بندوں کے درمیان فیصلے سے فارغ ہوں گے اور اہل نار میں سے اپنی رحمت کے ساتھ جسے نکالنا چاہیں گے تو فرشتوں کو حکم دیں گے کہ وہ ان لوگوں کو آگ سے نکال لائیں جنھوں نے اللہ کے ساتھ کسی کو شریک نہیں کیا تھا، ان لوگوں میں سے جن پر اللہ رحم کرنا چاہتا ہو گا، جو ’’لا الٰہ الا اللہ‘‘کی شہادت دیتے ہوں گے تو وہ انھیں آگ میں سجدے کے نشان کے ساتھ پہچانیں گے۔ آگ ابن آدم کو کھا جائے گی مگر سجدے کے نشان کو نہیں۔ اللہ تعالیٰ نے آگ پر حرام کر دیا ہے کہ وہ سجدے کے نشان کو کھائے۔‘‘ ¤ اس حدیث سے یہ بھی معلوم ہوا کہ سب سے آخر میں جہنم سے نکلنے والے وہ ہوں گے جو شرک سے پاک ہوں گے اور جن کے جسم پر سجدے کے نشان ہوں گے۔ بے نماز اس نشان سے محروم ہوتے ہیں، انھیں اپنا انجام سوچ لینا چاہیے۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت51) ➊ { لِيَجْزِيَ اللّٰهُ كُلَّ نَفْسٍ مَّا كَسَبَتْ:} یعنی قیامت کے دن کا یہ سارا سلسلہ اس لیے ہو گا تاکہ اللہ تعالیٰ ہر شخص کو اس کی کمائی کی جزا دے، نیکوں کو نیک اور بدوں کو بد جزا دے۔ ¤ ➋ {اِنَّ اللّٰهَ سَرِيْعُ الْحِسَابِ:} اس میں دو چیزیں شامل ہیں، ایک تو یہ کہ یوم حساب بہت جلد آنے والا ہے، فرمایا : «{ اِقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ }» [ الأنبیاء : ۱ ] ’’لوگوں کے لیے ان کا حساب بہت قریب آ گیا۔‘‘ اور فرمایا : «{ اَتٰۤى اَمْرُ اللّٰهِ فَلَا تَسْتَعْجِلُوْهُ۠ } » [ النحل :۱ ] ’’اللہ کا حکم آگیا، سو اس کے جلد آنے کا مطالبہ نہ کرو۔‘‘ دوسری یہ کہ اللہ تعالیٰ کو حساب لینے میں کوئی دیر نہیں لگتی، آنکھ جھپکنے میں سب کچھ سامنے آ جائے گا، فرمایا : «{ وَ كُلَّ اِنْسَانٍ اَلْزَمْنٰهُ طٰٓىِٕرَهٗ فِيْ عُنُقِهٖ وَ نُخْرِجُ لَهٗ يَوْمَ الْقِيٰمَةِ كِتٰبًا يَّلْقٰىهُ مَنْشُوْرًا (13) اِقْرَاْ كِتٰبَكَ كَفٰى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيْبًا}» [ بنی إسرائیل : ۱۳، ۱۴ ] ’’اور ہر انسان کو، ہم نے اسے اس کا نصیب اس کی گردن میں لازم کر دیا ہے اور قیامت کے دن ہم اس کے لیے ایک کتاب نکالیں گے، جسے وہ کھولی ہوئی پائے گا۔ اپنی کتاب پڑھ، آج تو خود اپنے آپ پر بطور محاسب کافی ہے۔‘‘"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت52){ هٰذَا بَلٰغٌ لِّلنَّاسِ …:} اس آیت میں قرآن مجید نازل کرنے کے چار مقصد بیان ہوئے ہیں : 1 اللہ تعالیٰ کا پیغام پہنچ جائے۔ 2 اس کے ذریعے سے وہ آگاہ ہو جائیں اور ڈر جائیں۔ 3 لوگوں کو علم ہو جائے کہ عبادت صرف ایک اللہ کی کرنی ہے۔ 4 عقلوں والے اس سے نصیحت حاصل کریں۔ رازی نے فرمایا، معلوم ہوا کہ انسان میںعقل ہی اصل ہے، یہ نہ ہو تو وہ کبھی نصیحت حاصل نہیں کر سکتا۔"
    }
  ]
}