{
  "surah": "Maryam",
  "surah_number": 19,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) { كٓهٰيٰعٓصٓ :} اس کی تفسیر کے لیے دیکھیے سورۂ بقرہ کی پہلی آیت کی تفسیر۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهٗ زَكَرِيَّا :} یہاں {’’هٰذَا‘‘} محذوف ہے، یعنی یہ تیرے رب کی اپنے بندے زکریا پر رحمت کا ذکر ہے۔ رحمت سے مراد یہاں زکریا علیہ السلام کی دعا قبول کرنا اور انھیں سخت بڑھاپے اور بیوی بانجھ ہونے کے باوجود یحییٰ علیہ السلام جیسا عظیم مرتبے والا بیٹا عطا فرمانا ہے۔ ¤ ➋ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَانَ زَكَرِيَّاءُ نَجَّارًا ] [ مسلم، الفضائل، باب من فضائل زکریا علیہ السلام: ۲۳۷۹ ] ’’زکریا علیہ السلام نجار (ترکھان) تھے۔‘‘ اس سے معلوم ہوا کہ وہ داؤد علیہ السلام کی طرح اپنے ہاتھ کی کمائی سے کھاتے تھے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا أَكَلَ أَحَدٌ طَعَامًا قَطُّ خَيْرًا مِنْ أَنْ يَّأْكُلَ مِنْ عَمَلِ يَيَدِهِ وَ إِنَّ نَبِيَّ اللّٰهِ دَاوٗدَ عَلَيْهِ السَّلاَمُ كَانَ يَأْكُلُ مِنْ عَمَلِ يَدِهِ ] [ بخاري، البیوع، باب کسب الرجل و عملہ بیدہ : ۲۰۷۲، عن المقدام رضی اللہ عنہ ]’’کسی شخص نے کبھی اپنے ہاتھ کی کمائی سے بہتر نہیں کھایا اور اللہ کے نبی داؤد علیہ السلام اپنے ہاتھ کی کمائی سے کھاتے تھے۔‘‘"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {اِذْ نَادٰى رَبَّهٗ نِدَآءً خَفِيًّا:} اس آیت میں اس جگہ اور وقت کا ذکر نہیں جب ان کے دل میں اس دعا کا داعیہ پیدا ہوا۔ اس کی تفصیل کے لیے دیکھیے سورۂ آل عمران (۳۷، ۳۸)۔ ¤ ➋ { نِدَآءً خَفِيًّا:} چھپی آواز سے آہستہ آواز بھی مراد ہو سکتی ہے اور لوگوں سے الگ جگہ میں دعا بھی۔ اس کی وجہ بعض اہلِ علم نے یہ لکھی ہے کہ بڑھاپے میں بیٹا مانگنا لوگوں کی ہنسی کا باعث ہوتا، پھر اگر نہ ملتا تو لوگ مزید ہنستے، مگر صحیح بات یہ ہے کہ خفیہ دعا ریا کا امکان نہ ہونے کی وجہ سے افضل ہوتی ہے، چنانچہ فرمایا : «{ اُدْعُوْا رَبَّكُمْ تَضَرُّعًا وَّ خُفْيَةً }» [ الأعراف : ۵۵ ] ’’اپنے رب کو گڑ گڑا کر اور خفیہ طور پر پکارو۔‘‘ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے فرض نماز کے بعد سب سے افضل نماز رات کی نماز کو قرار دیا۔ [ مسلم، الصیام، باب فضل صوم المحرم : ۱۱۶۳، عن أبي ھریرۃ رضی اللہ عنہ ] اور اس شخص کو عرش کا سایہ پانے والے سات خوش نصیبوں میں شمار فرمایا جس نے خلوت میں اللہ کو یاد کیا اور اس کی آنکھیں بہ پڑیں، حدیث کے الفاظ ہیں : [ ذَكَرَ اللّٰهَ خَالِيًا فَفَاضَتْ عَيْنَاهٗ ] اسی طرح اس شخص کو بھی جس نے اس طرح چھپا کر صدقہ کیا کہ بائیں ہاتھ کو معلوم نہیں کہ دایاں کیا خرچ کر رہا ہے، حدیث کے الفاظ ہیں : [ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتّٰی لَا تَعْلَمَ شِمَالُهٗ مَا تُنْفِقُ يَمِيْنُهٗ ] [ بخاري، الزکوٰۃ، باب الصدقۃ بالیمین : ۱۴۲۳ ]"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {قَالَ رَبِّ اِنِّيْ وَهَنَ الْعَظْمُ …: ’’ الْعَظْمُ ‘‘} اگرچہ واحد ہے مگر مراد جنس ہے، یعنی میری جو ہڈی بھی ہے کمزور ہو گئی ہے۔ اگر جمع کا لفظ بولتے {’’ اَلْعِظَامُ ‘‘} یعنی ہڈیاں، تو اس سے ہڈیوں کا کوئی مجموعہ بھی مراد ہو سکتا تھا۔ {’’ اشْتَعَلَ الرَّاْسُ ‘‘} سارے سر کے بال سفید ہونے کو آگ کے شعلے مارنے سے تشبیہ دے کر آگ کا لفظ حذف کر دیا اور بڑھاپے کی وجہ سے سر کو شعلے مارنے والا بنا دیا، اسے استعارہ کہتے ہیں۔ ان الفاظ میں اپنی انتہائی کمزوری کا ذکر کرکے اللہ تعالیٰ سے دعا کی ہے، کیونکہ وہ کمزوروں پر زیادہ رحم فرماتا ہے۔ یہ دعا کے آداب میں سے ایک ادب ہے۔ ¤ ➋ { وَ لَمْ اَكُنْۢ بِدُعَآىِٕكَ رَبِّ شَقِيًّا: ’’ كَانَ ‘‘} ہمیشگی کے لیے ہوتا ہے، اس پر نفی آنے سے نفی کی ہمیشگی مراد ہوتی ہے کہ ایسا کبھی نہیں ہوا، اس لیے ترجمہ ’’میں کبھی بے نصیب نہیں ہوا‘‘ کیا گیا ہے۔ اس میں اپنے آپ پر اللہ تعالیٰ کے ہمیشہ لطف و کرم کا واسطہ دے کر دعا کی ہے، خصوصاً اس بات کا واسطہ دے کر کہ تو نے مجھے ہمیشہ دعا قبول ہو جانے کی عادت ڈال دی ہے، کیونکہ اللہ تعالیٰ کے اسماء و صفات کا ذکر کرکے دعا کرنا بھی دعا کے آداب میں شامل ہے، جیسا کہ سورۂ فاتحہ میں عرض مطلب سے پہلے اللہ تعالیٰ کی تعریف ہے۔ علاوہ ازیں اللہ تعالیٰ نے فرمایا : «{ وَ لِلّٰهِ الْاَسْمَآءُ الْحُسْنٰى فَادْعُوْهُ بِهَا }» [ الأعراف : ۱۸۰ ] ’’اور سب سے اچھے نام اللہ ہی کے ہیں، سو اسے ان کے ساتھ پکارو۔‘‘"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {وَ اِنِّيْ خِفْتُ الْمَوَالِيَ مِنْ وَّرَآءِيْ …:’’ الْمَوَالِيَ ‘‘ ’’مَوْلٰي‘‘} کی جمع ہے۔ یہاں مراد قریبی رشتے دار اور چچوں کے بیٹے ہیں جو اولاد نہ ہونے کی صورت میں وارث بنتے ہیں۔ مطلب یہ ہے کہ مجھے ان میں سے کوئی شخص ایسا نظر نہیں آتا جو اس لائق ہو کہ میرے مرنے کے بعد بنی اسرائیل کی رہنمائی کا فریضہ سرانجام دے سکے اور میرا اور آل یعقوب کا علمی و عملی وارث بن سکے، جس سے تیرے دین پر عمل اور اس کی دعوت و تبلیغ کا سلسلہ جاری رہ سکے، بلکہ مجھے ان سے خطرہ ہے کہ وہ دین کو بگاڑیں گے اور اپنی من مانیاں کریں گے، جیسا کہ سورۂ اعراف (۱۶۹) میں بنی اسرائیل میں سے کتاب کے وارث بننے والے بعض لوگوں کا حال ذکر ہوا ہے۔ ¤ ➋ بعض لوگ اس آیت کو انبیاء کی دنیاوی جائداد کی وراثت کی دلیل بناتے ہیں، حالانکہ ان آیات ہی میں اس کا رد موجود ہے، کیونکہ زکریا علیہ السلام ایسے وارث کی دعا کر رہے ہیں جو ان کا اور آل یعقوب کا وارث بنے۔ ظاہر ہے کہ اولاد تو اپنے باپ کی دنیوی جائداد کی وارث ہوتی ہے، پورے خاندان اور قوم کی وارث نہیں ہوتی، اس لیے یہاں علمی ورثہ ہی مراد ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ نُوْرَثُ مَا تَرَكْنَا صَدَقَةٌ ] [ بخاري، ، فرض الخمس، باب فرض الخمس : ۳۰۹۳، عن أبي بکر رضی اللہ عنہ ]’’ہمارا (یعنی انبیاء کا) کوئی وارث نہیں ہوتا، ہم جو کچھ چھوڑ جائیں وہ صدقہ ہے۔‘‘ جو لوگ کہتے ہیں کہ ابوبکر رضی اللہ عنہ نے فاطمہ رضی اللہ عنھا کو فدک اور دوسری جائدادوں میں سے ورثہ نہیں دیا انھیں سوچنا چاہیے کہ انھوں نے آپ صلی اللہ علیہ وسلم کے چچا عباس رضی اللہ عنہ کو اور اپنی بیٹی عائشہ رضی اللہ عنھا اور دوسری ازواج مطہرات کو بھی تو حصہ نہیں دیا اور دلیل کے طور پر یہ (مذکورہ بالا) حدیث پڑھی۔ پھر اگر انھوں نے حصہ نہیں دیا تو علی رضی اللہ عنہ ہی اپنی خلافت میں عباس اور حسن و حسین رضی اللہ عنھم کو اور امہات المومنین کو وہ حصہ دے کر اپنے فرض سے سبک دوش ہو جاتے، مگر ان کا ابوبکر رضی اللہ عنہ کے فیصلے پر کار بند رہنا اس حدیث کی عملی تائید و تصدیق ہے۔ مزید دیکھیے سورۂ نمل کی آیت (۱۶)۔ ¤ ➌ { وَ كَانَتِ امْرَاَتِيْ عَاقِرًا : ’’ عَاقِرًا ‘‘} وہ ہے جس کے ہاں اولاد نہ ہوتی ہو۔ یہ لفظ مرد اور عورت دونوں کے لیے استعمال ہوتا ہے۔ {’’ كَانَتْ ‘‘} کا لفظ ہمیشگی پر دلالت کرتا ہے، اس لیے ترجمہ ’’شروع سے بانجھ ہے‘‘ کیا گیا ہے۔ اتنے الحاح و اصرار سے اپنی ضرورت بیان کرنے کے بعد اپنی صلب سے وارث عطا کرنے کی دعا کی، جو ان کی اور آل یعقوب علیہ السلام کی نبوت، علم اور اوصاف حمیدہ کا وارث بنے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {وَ اجْعَلْهُ رَبِّ رَضِيًّا: ’’ رَضِيًّا ‘‘ ’’فَعِيْلٌ‘‘} بمعنی {’’مَفْعُوْلٌ‘‘} ہے، مطلب پسند کیا ہوا، یعنی وہ اللہ تعالیٰ اور لوگوں سب کا پسندیدہ ہو۔ اللہ جسے پسند کرلے لوگ بھی اس سے محبت کرتے ہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا أَحَبَّ اللّٰهُ الْعَبْدَ نَادَی جِبْرِيْلَ إِنَّ اللّٰهَ يُحِبُّ فُلَانًا فَأَحْبِبْهُ فَيُحِبُّهٗ جِبْرِيْلُ فَيُنَادِيْ جِبْرِيْلُ ففِيْ أَهْلِ السَّمَاءِ إِنَّ اللّٰهَ يُحِبُّ فُلاَنًا فَأَحِبُّوْهٗ فَيُحِبُّهٗ أَهْلُ السَّمَاءِ ثُمَّ يُوْضَعُ لَهٗ الْقَبُوْلُ فِي الْأَرْضِ ] [ بخاری، بدء الخلق، باب ذکر الملائکۃ صلوات اللّٰہ علیہم : ۳۲۰۹، عن أبي ھریرۃ رضی اللہ عنہ ] ’’جب اللہ تعالیٰ کسی بندے سے محبت کرتا ہے تو جبریل علیہ السلام سے کہتا ہے کہ بے شک اللہ تعالیٰ فلاں بندے سے محبت کرتا ہے تو بھی اس سے محبت کر، تو جبریل علیہ السلام بھی اس سے محبت کرتے ہیں، پھر جبریل علیہ السلام آسمان والوں میں اعلان کرتے ہیں کہ اللہ تعالیٰ فلاں شخص سے محبت کرتے ہیں، سو تم بھی اس سے محبت کرو، تو آسمان والے اس سے محبت کرتے ہیں، پھر اس کے لیے زمین میں قبولیت رکھ دی جاتی ہے۔‘‘ ¤ ➋ زکریا علیہ السلام کی بیٹے کے لیے دعا ایک تو یہاں آئی ہے، ایک سورۂ آل عمران (۳۸) میں اور ایک سورۂ انبیاء (۸۹) میں۔ تینوں جگہ ہی الفاظ معانی کا خزینہ اور موتیوں کا نگینہ ہیں۔ اللہ تعالیٰ نے دعا قبول فرمائی اور بانجھ اور بوڑھی بیوی کو اولاد کے قابل بنا کر یحییٰ علیہ السلام عطا فرما دیے۔ دیکھیے سورۂ انبیاء (۹۰)۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {يٰزَكَرِيَّاۤ اِنَّا نُبَشِّرُكَ بِغُلٰمٍ اسْمُهٗ يَحْيٰى … :} یہ بشارت دوران نماز ہی فرشتوں کے ذریعے سے مل گئی تھی۔ دیکھیے سورۂ آل عمران (۳۹) اس میں یحییٰ علیہ السلام کی فضیلت دو پہلوؤں سے بیان کی گئی ہے، ایک یہ کہ ان کا نام اللہ تعالیٰ نے خود رکھا، دوسرے یہ کہ ان کا نام ایسا رکھا جو اس سے پہلے کسی کا نہیں تھا۔ عربی زبان میں {’’ يَحْيٰى ‘‘} کا معنی ’’زندہ رہے‘‘ ہے۔ ¤ ➋ اس سے معلوم ہوا کہ پیدائش سے پہلے بھی بچے کا نام رکھا جا سکتا ہے، ساتویں دن نام رکھنے کا حکم آخری حد ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { قَالَ رَبِّ اَنّٰى يَكُوْنُ لِيْ غُلٰمٌ …:’’ عِتِيًّا ‘‘ ’’عَتَا يَعْتُوْ عِتِيًّا‘‘} بڑھاپے کی انتہا کو پہنچ جانا۔ خشک لکڑی کو {’’عَاتٍ‘‘ } اور{’’عَاسٍ‘‘} کہتے ہیں، جو بھی بڑھاپے یا فساد یا کفر کی انتہا کو پہنچ جائے اسے {’’عَاتٍ‘‘} ({عَتَا يَعْتُوْ} سے اسم فاعل) کہا جاتا ہے۔(طبری) ¤ یہاں خیال پیدا ہوتا ہے کہ خود ہی دعا کی، پھر یہ پوچھنے کا کیا مطلب کہ میرے لیے لڑکا کیسے ہو گا؟ جواب اس کا یہ ہے کہ زکریا علیہ السلام نے یہ سوال عام دستور کے خلاف بیٹے کی خوش خبری سن کر مزید اطمینان حاصل کرنے کے لیے غیر اختیاری طور پر کیا۔ اس کے علاوہ یہ سوال بے پناہ خوشی اور تعجب کے اظہار کی ایک شکل بھی ہو سکتا ہے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’انوکھی چیز مانگنے پر تعجب نہ ہوا، جب سنا کہ ملے گی تب تعجب کیا۔‘‘ (موضح) بعض مفسرین نے لکھا ہے کہ یہ پوچھنا دراصل معلوم کرنے کے لیے تھا کہ بیٹا اسی بانجھ بیوی سے ہو گا یا کسی اور بیوی سے اور میرے بڑھاپے کا کیا بنے گا؟"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { قَالَ كَذٰلِكَ … :} یعنی ایسے ہی ہے کہ تیرے بڑھاپے اور تیری اسی بیوی کے بانجھ پن کے باوجود تیرے ہاں لڑکا ہو گا، کیونکہ جس نے تجھے اس وقت پیدا کر لیا جب تو کچھ بھی نہ تھا تو اس کے لیے یہ کام تو بہت آسان ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {قَالَ رَبِّ اجْعَلْ لِّيْۤ اٰيَةً:} یعنی کوئی ایسی نشانی بتا دے کہ ان حالات میں ہمارے ہاں لڑکے کی پیدائش ہونے والی ہو تو مجھے پہلے سے اس کا پتا چل جائے۔ ¤ ➋ { قَالَ اٰيَتُكَ اَلَّا تُكَلِّمَ …: ’’ سَوِيًّا ‘‘} تندرست، صحیح اعضا والا نہ گونگا نہ بہرا۔ یہاں تین راتوں کا ذکر ہے، جبکہ سورۂ آل عمران میں تین دنوں کا ذکر ہے، یعنی نشانی یہ ہے کہ تین دن رات صحیح سالم، تندرست ہوتے ہوئے تم لوگوں سے بات چیت نہ کر سکو تو سمجھ لو کہ حمل قرار پا گیا۔ لوگوں کے ساتھ کلام سے زبان بند ہو گئی تھی، اللہ کے ذکر اور تسبیح و تحمید سے نہیں۔ دیکھیے سورۂ آل عمران (۴۱)۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {فَخَرَجَ عَلٰى قَوْمِهٖ مِنَ الْمِحْرَابِ: ’’ الْمِحْرَابِ ‘‘} نماز کی جگہ، یا وہ کمرہ جس میں وہ عبادت کیا کرتے تھے، یا مسجد، کیونکہ بنی اسرائیل کی مساجد کو {’’ مَحَارِيْبُ ‘‘} کہا جاتا تھا، کیونکہ وہ ایسے مقامات ہیں جن میں شیطانوں سے حرب (جنگ) کی جاتی ہے۔ (طنطاوی) ¤ ➋ { فَاَوْحٰۤى اِلَيْهِمْ اَنْ سَبِّحُوْا بُكْرَةً وَّ عَشِيًّا:} یعنی حمل کی نشانی کے طور پر زبان بند ہوگئی تو اشارے سے لوگوں کو پہلے اور پچھلے پہر اللہ تعالیٰ کی تسبیح کا حکم دیا، کیونکہ خود انھیں علامت ظاہر ہونے پر اللہ کی طرف سے یہی حکم تھا، جیسا کہ فرمایا : «{ وَ اذْكُرْ رَّبَّكَ كَثِيْرًا وَّ سَبِّحْ بِالْعَشِيِّ وَ الْاِبْكَارِ }» [ آل عمران : ۴۱ ] ’’اور اپنے رب کو بہت یاد کر اور شام اور صبح تسبیح بیان کر۔‘‘"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) { يٰيَحْيٰى خُذِ الْكِتٰبَ بِقُوَّةٍ … :} اللہ تعالیٰ نے اس سے پہلے بہت سی وہ باتیں چھوڑ دیں جو خود ہی سمجھ میں آ جاتی ہیں۔ قصہ مختصر یہ کہ یحییٰ علیہ السلام پیدا ہوئے، کچھ سمجھدار ہوئے تو والد کے جانشین کے طور پر تیار کرنے کے لیے اللہ تعالیٰ نے انھیں حکم دیا کہ اے یحییٰ! تورات کو قوت کے ساتھ پکڑو، یعنی اسے حفظ کرو، معانی و مطالب سمجھو، اس پر عمل کرو اور اس کے احکام پوری قوت کے ساتھ اپنے آپ پر اور پوری قوم پر نافذ کرو۔ اس مقصد کے لیے اللہ تعالیٰ نے انھیں بچپن ہی میں فیصلہ کرنے کی قوت عطا فرما دی اور وہ نو عمری ہی میں اپنے والد کے علم و فضل، بنی اسرائیل کی سیادت اور وحی و نبوت کے وارث بن گئے اور پوری قوت سے بنی اسرائیل کو تورات پڑھانے اور فیصلے کرنے لگے۔ والد کمزور تھے اور یہ نوجوان، سو والد کی جگہ لوگوں کو کتاب کا علم سکھانے لگے۔ اگر کوئی کہے کہ بچپن میں یہ کیسے ہو سکتا ہے تو جواب اس کا یہ ہے کہ نبوت کا سارا معاملہ خرقِ عادت یعنی دنیا کے عام معمول، عادت اور دستور کے خلاف ہوتا ہے، اس لیے اس خرق عادت پر بھی تعجب نہیں ہونا چاہیے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {وَ حَنَانًا مِّنْ لَّدُنَّا …: ’’ حَنَانًا ‘‘} کا عطف {’’ الْحُكْمَ ‘‘} پر ہے، یعنی ہم نے اسے حکم (قوتِ فیصلہ) اور بڑی شفقت اور پاکیزگی عطا کی۔ {’’ حَنَانًا ‘‘} اور {’’ زَكٰوةً ‘‘} پر تنوین تفخیم کے لیے ہے، اس لیے ترجمہ ’’بڑی شفقت اور پاکیزگی‘‘ کیا ہے۔ پاکیزگی سے مراد اخلاق و کردار کی پاکیزگی ہے جو گناہوں سے بچنے سے حاصل ہوتی ہے۔ {’’ تَقِيًّا ‘‘ ’’وَقٰي يَقِيْ‘‘} سے {’’فَعِيْلٌ‘‘} کے وزن پر ہے، پہلی واؤ کو تاء سے بدل دیا گیا ہے، یعنی اللہ کی نافرمانی سے بہت بچنے والا تھا۔ {’’ مِنْ لَّدُنَّا ‘‘} اپنے پاس سے، یعنی یہ حکم حنان اور زکوٰۃ کسی اور کے پاس ہیں ہی نہیں، صرف ہمارے پاس ہیں اور ہم ہی نے اپنے پاس سے انھیں عطا کیے۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) { وَ بَرًّۢا بِوَالِدَيْهِ …:} آرزوؤں اور امنگوں سے پیدا ہونے والی اولاد عموماً مغرور، سرکش اور نافرمان ہوتی ہے، یحییٰ علیہ السلام ایسے نہ تھے، بلکہ ماں باپ کے ساتھ بہت نیک سلوک کرنے والے تھے۔ وہ نہ سرکش تھے اور نہ اپنے والدین یا اپنے رب کی نافرمانی کرنے والے تھے۔ ظاہر یہ ہے کہ {’’ عَصِيًّا ‘‘ ’’عَصَي يَعْصِيْ‘‘} سے {’’ فَعُوْلٌ ‘‘} کے وزن پر ہے، تعلیل کے بعد {’’عَصِيًّا‘‘} بن گیا۔ {’’فَعِيْلٌ‘‘} کے وزن پر بھی ہو سکتا ہے، دونوں وزن مبالغہ کے لیے ہیں۔ (شنقیطی)"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { وَ سَلٰمٌ عَلَيْهِ …:} یعنی ان تینوں وقتوں میں وہ ہر پریشانی سے سلامت رہیں گے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں: ’’اللہ جو بندے پر سلام کہے اس کا معنی یہ ہے کہ اس پر کچھ پکڑ نہیں۔‘‘ (موضح) سفیان بن عیینہ رحمہ اللہ نے فرمایا : {’’ أَوْحَشُ مَا يَكُوْنُ الْخَلْقُ فِيْ ثَلَاثَةِ مَوَاطِنَ يَوْمَ يُوْلَدُ فَيَرَي نَفْسَهٗ خَارِجًا مِمَّا كَانَ فِيْهِ وَيَوْمَ يَمُوْتُ فَيَررَي قَوْمًا لَمْ يَكُنْ عَايَنَهُمْ وَيَوْمَ يُبْعَثُ فَيَرَي نَفْسَهٗ فِيْ مَحْشَرٍ عَظِيْمٍ قَالَ فَأَكْرَمَ اللّٰهُ فِيْهَا يَحْيَي بْنَ زَكَرِيًّا فَخَصَّهُ بِالسَّلاَمِ عَلَيْهِ ‘‘} [ طبري : ۲۳۷۵۱، بسند صحیح ]’’آدمی سب سے زیادہ خوف زدہ تین مواقع پر ہوتا ہے، جس دن پیدا ہوتا ہے اور اپنے آپ کو اس جگہ سے نکلتے ہوئے دیکھتا ہے جہاں وہ تھا اور جس دن فوت ہوتا ہے اور ایسے لوگوں کو دیکھتا ہے جنھیں اس نے نہیں دیکھا تھا اور جس دن وہ زندہ کیا جائے گا اور اپنے آپ کو بہت بڑے محشر (اکٹھ) میں دیکھے گا۔ اللہ تعالیٰ نے ان تینوں وقتوں میں یحییٰ بن زکریا علیھما السلام کو عزت بخشی اور انھیں سلامت رکھنے کی خاص نعمت عطا فرمائی۔‘‘ ¤ ➋ یحییٰ علیہ السلام کے کچھ اوصافِ حمیدہ اس سے پہلے سورۂ آل عمران (۳۹) میں گزر چکے ہیں۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { وَ اذْكُرْ فِي الْكِتٰبِ مَرْيَمَ :} زکریا اور مریم علیھما السلام کے واقعات میں مناسبت کی وجہ سے ان کا ذکر سورۂ آل عمران (۳۵ تا ۴۰)، سورۂ انبیاء (۳۹ تا ۴۱) اور یہاں اکٹھا آیا ہے، کیونکہ ان میں کئی طرح سے مناسبت ہے۔ مریم علیھا السلام کی کرامت بے موسم پھل دیکھ کر زکریا علیہ السلام کے دل میں بے وقت اولاد کی خواہش اور امید پیدا ہوئی۔ پھر زکریا علیہ السلام کو خلاف عادت بیٹا عطا ہوا اور مریم علیھا السلام کے ہاں ان سے بھی بڑھ کر خلاف عادت بیٹا پیدا ہوا۔ دونوں قصے اللہ تعالیٰ کی قدرتِ کاملہ کی دلیل ہیں۔ ¤ ➋ { اِذِ انْتَبَذَتْ مِنْ اَهْلِهَا مَكَانًا شَرْقِيًّا : ’’نَبَذَ‘‘} کا معنی پھینکنا ہے۔ {’’ انْتَبَذَتْ ‘‘} الگ ہوئی، یعنی بالکل الگ ہو گئی، گویا اس نے اپنے آپ کو گھر والوں سے دور پھینک دیا۔ یاد رہے کہ مریم علیھا السلام کو ان کی والدہ نے بیت المقدس کی خدمت کے لیے وقف کیا تھا اور وہ اپنے بہنوئی زکریا علیہ السلام کی کفالت میں وہاں مصروف عبادت رہتی تھیں۔ حدیثِ معراج میں رسول اللہ صلی اللہ علیہ وسلم نے یحییٰ اور عیسیٰ علیھما السلام کو خالہ زاد بھائی فرمایا۔ مریم علیھا السلام کی نیکی، پاکیزگی اور شرافت ضرب المثل تھی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَمُلَ مِنَ الرِّجَالِ كَثِيْرٌ وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلَّا آسِيَةُ امْرَأَةُ فِرْعَوْنَ وَمَرْيَمُ بِنْتُ عِمْرَانَ وَ إِنَّ فَضْلَ عَائِشَةَ عَلَی النِّسَاءِ كَفَضْلِ الثَّرِيْدِ عَلٰی سَائِرِ الطَّعَامِ ] [ بخاري، أحادیث الأنبیاء، باب قولہ تعالٰی : « وضرب اللّٰہ مثلا …» : ۳۴۱۱۔ مسلم :۲۴۳۱ ] ’’مردوں میں بہت سے کامل ہوئے ہیں اور عورتوں میں سے کامل نہیں ہوئیں مگر فرعون کی بیوی آسیہ اور مریم بنت عمران اور عائشہ کی فضیلت عورتوں پر اس طرح ہے جیسے ثرید (گوشت کے سالن میں بھگوئی ہوئی روٹی) کی فضیلت تمام کھانوں پر۔‘‘ علیحدہ ہونے کا مطلب بعض مفسرین نے بیان کیا ہے کہ ایام آنے کی وجہ سے الگ ہوئیں اور بعض نے فرمایا کہ عبادت کے لیے مکمل تنہائی کی خاطر الگ ہوئیں، بظاہر ان دونوں میں سے کوئی ایک وجہ ہو سکتی ہے۔ اللہ تعالیٰ نے وجہ بیان نہیں فرمائی۔ اصل حقیقت وہی بہتر جانتا ہے۔ ابن عباس رضی اللہ عنھما نے فرمایا کہ نصاریٰ نے مشرق کو اسی لیے قبلہ بنا لیا کہ مریم علیھا السلام کے ہاں مسیح علیہ السلام کی پیدائش بیت المقدس کی مشرقی جانب میں ہوئی۔ [ طبري و صححہ ابن بشیر : ۲۳۷۵۷ ]"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {فَاتَّخَذَتْ مِنْ دُوْنِهِمْ حِجَابًا :} ایام سے فارغ ہونے پر غسل کے لیے پردہ تان لیا، یا عبادت میں مکمل تنہائی کے لیے۔ ¤ ➋ { فَاَرْسَلْنَاۤ اِلَيْهَا رُوْحَنَا :} روح سے مراد یہاں جبریل علیہ السلام ہیں، جیسا کہ سورۂ شعراء (۱۹۳) اور سورۂ قدر (۴) میں انھی کے متعلق روح کا لفظ آیا ہے۔ اگرچہ ہر روح کا مالک اللہ تعالیٰ ہی ہے مگر جبریل علیہ السلام کو خاص طور پر اپنا قرار دینے میں ان کی شان کی بلندی کا اظہار ہے، جیسا کہ ہر گھر اور ہر اونٹنی اللہ کی ملکیت ہے، مگر بیت اللہ اور ناقۃ اللہ کی شان انوکھی ہے۔ اس لیے {’’ رُوْحَنَا ‘‘} کا ترجمہ ’’اپنا خاص فرشتہ‘‘ کیا ہے۔ ¤ ➌ {فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا : ’’ سَوِيًّا ‘‘} پورے اعضا والا تندرست (انسان)۔ جبریل علیہ السلام انسان کی شکل میں اس لیے آئے کہ مریم علیھا السلام کے لیے انھیں ان کی اصل صورت میں دیکھنا شدید خوف کا باعث یا ناقابل برداشت ہوتا۔ ہمارے نبی صلی اللہ علیہ وسلم نے بھی اپنی زندگی میں جبریل علیہ السلام کو ان کی اصل صورت میں صرف دو بار دیکھا ہے۔ دیکھیے سورۂ نجم (۵ تا ۱۸) اس سے یہ بھی معلوم ہوا کہ فرشتے اللہ کے حکم سے اپنی شکل بدل سکتے ہیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) { قَالَتْ اِنِّيْۤ اَعُوْذُ بِالرَّحْمٰنِ مِنْكَ … :} تنہائی میں ایک کامل حسین و جوان مرد کو دیکھ کر مریم علیھا السلام سخت گھبرا گئیں کہ کہیں اس کی نیت بری نہ ہو۔ اس لیے بچاؤ کا کوئی اقدام کرنے سے پہلے اس ذات کی پناہ پکڑی جس کے رحم کی کوئی حد نہیں، تاکہ وہ اپنی بندی پر رحم فرما کر اس کی عصمت محفوظ رکھے۔ ساتھ ہی اس مرد کو اللہ کا خوف دلایا کہ اگر تجھ میں اللہ تعالیٰ کا ذرا برابر بھی ڈر ہے تو میں تجھ سے رحمان کی پناہ پکڑتی ہوں۔{ ’’ تَقِيًّا ‘‘} کو نکرہ لانے سے یہ مفہوم پیدا ہوا کہ اگر تجھ میں کسی بھی قسم کا اللہ کا خوف ہے، کیونکہ اللہ کا خوف انسان کو برائی سے ہٹا دیتا ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) { قَالَ اِنَّمَاۤ اَنَا رَسُوْلُ رَبِّكِ …:} جبریل علیہ السلام نے کہا کہ میں تو تیرے اسی رب کی طرف سے بھیجا ہوا ہوں جس کی تو پناہ پکڑ رہی ہے، تاکہ تجھے ایک پاکیزہ لڑکا عطا کروں ۔بعض شرک کے بیمار یہاں سے کشید کرتے ہیں کہ دیکھو! جبریل بیٹا دے سکتے ہیں۔ حالانکہ اگر وہ غور کرتے تو لفظ {’’ رَسُوْلُ ‘‘ } میں ان کی غلط فہمی کا علاج موجود ہے۔ قاصد کا اپنا کچھ نہیں ہوتا، اسے جو پیغام یا جو چیز دے کر بھیجا جاتا ہے وہ اسے وہاں پہنچا دیتا ہے جہاں اسے حکم ہوتا ہے۔ چنانچہ اللہ تعالیٰ نے دوسری جگہ صاف الفاظ میں عیسیٰ علیہ السلام کو اپنے کلمہ {’’ كُنْ ‘‘} کے ساتھ پیدا کرنے کا ذکر فرمایا، دیکھیے سورۂ آل عمران (۵۹) چونکہ وہ چیز قاصد کے ہاتھ بھیجی گئی ہوتی ہے، اس لیے بعض اوقات وہ اس کی نسبت اپنی طرف کر دیتا ہے، جیسا کہ یہاں جبریل علیہ السلام نے پاکیزہ لڑکا عطا کرنے کی نسبت اپنی طرف فرمائی، حالانکہ عطا وہ بھیجنے والے ہی کی تھی۔ مشہور سات قراء میں سے ابو عمرو بن العلاء بصری کی قراء ت {’’لِيَهَبَ لَكِ‘‘ } ہے، جس کا معنی ہے کہ میں تو تیرے رب کا بھیجا ہوا ہوں، تاکہ وہ تجھے ایک لڑکا عطا کرے۔ (ابن کثیر) جس طرح دوسرے چھ قاریوں کی قراء ت کے صحیح ہونے پر امت کا اتفاق ہے اسی طرح ابوعمرو بن العلاء بصری کی قراء ت صحیح ہونے پر بھی امت کا اتفاق ہے۔ اس قراء ت سے دوسری قراء ت کی بھی تفسیر ہو گئی کہ اصل عطا اللہ تعالیٰ کی ہے۔ رسول ہونے کی وجہ سے اس کی نسبت جبریل علیہ السلام کی طرف کی گئی ہے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {قَالَتْ اَنّٰى يَكُوْنُ لِيْ غُلٰمٌ … : ’’ بَغِيًّا ‘‘} کا معنی زانیہ ہے، اس کی جمع {’’ بَغَايَا ‘‘} اور مصدر{ ’’ بِغَاءٌ ‘‘} ہے، اللہ تعالیٰ نے فرمایا : «{ وَ لَا تُكْرِهُوْا فَتَيٰتِكُمْ عَلَى الْبِغَآءِ }» [ النور : ۳۳ ] ’’اور اپنی لونڈیوں کو زنا پر مجبور نہ کرو۔‘‘ مریم علیھاالسلام نے کہا کہ اولاد کے لیے تو مرد اور عورت کا ملنا ضروری ہے، جبکہ مجھے نہ کسی بشر نے نکاح کے ساتھ چھوا ہے اور نہ میں بدکار ہوں۔ {’’ لَمْ يَمْسَسْنِيْ بَشَرٌ‘‘} میں اگرچہ نکاح یا زنا کسی بھی طریقے سے کسی مرد کے چھونے کی نفی ہے اور یہی معنی سورۂ آل عمران (۴۷) میں مراد ہے، مگر یہاں زنا کے مقابلے میں آنے کی وجہ سے چھونے کا مطلب نکاح کے ساتھ چھونا ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { قَالَ كَذٰلِكِ :} جبریل علیہ السلام نے کہا، ایسے ہی ہو گاکہ نکاح یا زنا کے بغیر ہی تمھیں بیٹا عطا ہو گا۔ ¤ ➋ { قَالَ رَبُّكِ هُوَ عَلَيَّ هَيِّنٌ :} مزید کہا کہ تیرے رب نے فرمایا ہے کہ کسی مرد کے بغیر تجھے بیٹا دینا میرے لیے بالکل آسان ہے۔ ¤ ➌ { وَ لِنَجْعَلَهٗۤ …:} واؤ کے بعد یہاں الفاظ محذوف ہیں، یعنی اور (ہم نے اس طرح کیا) تاکہ ہم اسے اپنی قدرت کی بہت بڑی نشانی اور معجزہ بنائیں کہ ہم صرف عورت سے بھی انسان پیدا کر سکتے ہیں، جیسا کہ اس سے پہلے تین نشانیاں موجود ہیں کہ ماں باپ کے بغیر انسان (آدم علیہ السلام )، ماں کے بغیر انسان (حوا علیھا السلام) اور ماں باپ دونوں کے ساتھ انسان۔ تینوں ہماری قدرتِ کاملہ کا اظہار ہیں، اب اس سے ہماری قدرت کی چوتھی نشانی بھی پوری ہو گئی۔ چاروں میں سے کوئی بھی اللہ کے سوا کسی کے بس میں نہیں۔ دوسری جگہ فرمایا، انسان تو دور، ایک مکھی پیدا کرنا بھی کسی کے بس میں نہیں۔ دیکھیے سورۂ حج (۷۳) اس لحاظ سے ساری مخلوق اللہ تعالیٰ کی قدرت اور وحدانیت کی دلیل ہے۔ ¤ {وَ فِيْ كُلِّ شَيْءٍ لَهُ آيَةٌ ¤ تَدُلُّ عَلٰي أَنَّهُ وَاحِدٌ } ¤ شرک کے بیماروں کو دیکھیے، وہ مسیح علیہ السلام کا خالق جبریل علیہ السلام کو قرار دے رہے ہیں۔ [ فَالْحَمْدُ لِلّٰہِ الَّذِيْ عَافَانَا مِنْ بَلِیَّۃِ الْإِشْرَاکِ بِہِ وَمَا کُنَّا لِنَھْتَدِيَ لَوْ لَا أَنْ ھَدَانَا اللّٰہُ ] ¤ ➍ {وَ رَحْمَةً مِّنَّا :} اور اسے اپنی طرف سے عظیم رحمت بنائیں بنی اسرائیل کے لیے اور قیامت تک آنے والے تمام انسانوں کے لیے بھی، کیونکہ مسیح علیہ السلام نے محمد رسول اللہ صلی اللہ علیہ وسلم کی بشارت دی اور آپ پر ایمان لانے اور آپ کی پیروی کا حکم دیا، اس طرح وہ ان کے لیے جہنم سے نجات اور جنت میں داخلے کا باعث بنے۔ {’’ اٰيَةً ‘‘ } اور {’’ رَحْمَةً ‘‘} میں تنوین تعظیم و تفخیم کے لیے ہے، لہٰذا ترجمہ بہت بڑی نشانی اور عظیم رحمت کیا گیا ہے۔ ¤ ➎ { وَ كَانَ اَمْرًا مَّقْضِيًّا : ’’ مَقْضِيًّا ‘‘ ’’قَضَي يَقْضِيْ‘‘} کا اسم مفعول ہے، جو اصل میں {’’مَقْضُوْيٌ‘‘} تھا، معنی فیصلہ کیا ہوا۔ {’’ كَانَ ‘‘} ہمیشگی کے لیے ہے، اس لیے ترجمہ ’’شروع سے طے کیا ہوا‘‘ کیا ہے، یعنی یہ بات تقدیر میں طے ہو چکی ہے، کسی طرح ٹل نہیں سکتی۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) {فَحَمَلَتْهُ فَانْتَبَذَتْ بِهٖ مَكَانًا قَصِيًّا: ’’ قَصِيًّا ‘‘ ’’قَصِيَ يَقْصَي قُصُوًّا‘‘ ’’رَضِيَ يَرْضَي‘‘} کی طرح ناقص واوی {’’عَلِمَ يَعْلَمُ‘‘} سے ہے۔ {’’ قَصِيًّا أَيْ بَعِيْدًا ‘‘} یعنی دور۔ {’’ فَحَمَلَتْهُ ‘‘} جبریل علیہ السلام کے یہ کہنے اور ان میں روح پھونکنے کے بعد وہ حاملہ ہو گئیں۔ روح پھونکنے کی کیفیت کے لیے دیکھیے سورۂ انبیاء (۹۱) اور سورۂ تحریم (۱۲) حاملہ ہونے کے بعد فطری تقاضے کے مطابق حمل کی مدت پوری کرنے کے دوران لوگوں کے طعن و ملامت سے بچنے کے لیے وہ بیت المقدس سے دور ایک مقام پر منتقل ہو گئیں۔ ابن کثیر رحمہ اللہ نے وہب کا قول ذکر کیا ہے کہ وہ بیت اللحم میں منتقل ہوئیں، جو بیت المقدس سے آٹھ میل دور تھا اور وہیں عیسیٰ علیہ السلام کی ولادت ہوئی۔ ابن کثیر نے فرمایا کہ نصاریٰ اس میں کوئی شک نہیں کرتے۔ مگر وہب کا قول اسرائیلیات ہی سے ماخوذ ہے، نہ اس کے صحیح ہونے کا یقین ہو سکتا ہے اور نہ نصاریٰ کے کہنے کا۔ البتہ اکثر علماء کا کہنا یہی ہے۔حمل کے کتنا عرصہ بعد عیسیٰ علیہ السلام کی ولادت ہوئی؟ بعض مفسرین نے فرمایا کہ بس حمل ہونے کی دیر تھی کہ اس کے ساتھ ہی ولادت ہو گئی۔ اگرچہ اللہ تعالیٰ کے لیے یہ کچھ مشکل نہیں مگر یہ بات کسی قابل اعتماد ذریعے سے نہیں آئی اور وحی الٰہی کے بغیر کسی واقعہ کے متعلق سیکڑوں برس بعد اگر کوئی شخص سنی سنائی بات بیان کرے تو خواہ وہ کتنا عظیم ہو وہ بات یقین کی ٹھنڈک نہیں پہنچا سکتی۔ اس لیے ظاہر یہی ہے کہ حمل کی عام مدت پوری ہوئی اور جمہور مفسرین کا قول بھی یہی ہے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ {فَاَجَآءَهَا الْمَخَاضُ …: ’’ جَاءَ يَجِيْئُ مَجِيْئًا ‘‘} کا معنی ہے آنا اور{’’ أَجَاءَ يُجِيْئُ ‘‘} (افعال) کا معنی ہے لانا، مگر اس کے مفہوم میں مجبور کرکے لانا پایا جاتا ہے۔ (زمخشری){ ’’ الْمَخَاضُ ‘‘} عورت کو بچے کی پیدائش کے وقت ہونے والا درد، یعنی درد زِہ۔ {’’ مَخِضَتِ الْمَرْأَةُ ‘‘} (ع) جب عورت کے ہاں پیدائش کا وقت قریب ہو۔ یہ {’’مَخْضٌ‘‘ } سے ماخوذ ہے، جس کا معنی شدید حرکت ہے اور یہ نام رکھنے کی وجہ ولادت کے قریب ماں کے پیٹ میں بچے کا شدت سے حرکت کرنا ہے۔ یعنی درد زِہ کی شدت سے مجبور ہو کر وہ کھجور کے ایک تنے سے ٹیک لگا کر بیٹھ گئیں اور آنے والے وقت کا تصور کرکے، جب ہر طرف سے برائی کی تہمت لگے گی، طعنے ملیں گے، گزشتہ زندگی کی ساری نیکی، پاک بازی اور شرافت کا خاکہ اڑایا جائے گا، کہنے لگیں کہ اے کاش! میں اس سے پہلے مر گئی ہوتی اور کسی کو یاد ہی نہ ہوتا کہ کوئی مریم بھی تھی۔ ¤ ➋ یہ آیت دلیل ہے کہ دین میں فتنے کے وقت موت کی تمنا جائز ہے۔ حدیث میں کسی تکلیف مثلاً مرض یا فقر وغیرہ کی وجہ سے موت کی تمنا سے منع کیا گیا ہے، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تم میں سے کوئی شخص موت کی تمنا کسی تکلیف کی وجہ سے جو اسے پہنچے، ہر گز نہ کرے، اگر اسے ضرور ہی کرنی ہے تو یوں کہے : [ اَللّٰهُمَّ أَحْيِنِيْ مَا كَانَتِ الْحَيَاةُ خَيْرًا لِّيْ وَتَوَفَّنِيْ إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِّيْ ] ’’اے اللہ! مجھے اس وقت تک زندہ رکھ جب تک زندہ رہنا میرے لیے بہتر ہو اور مجھے فوت کر لے جب وفات میرے لیے بہتر ہو۔‘‘ [ بخاری، المرضٰی، باب تمنی المریض الموت : ۵۶۷۱ ]"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) {فَنَادٰىهَا مِنْ تَحْتِهَاۤ …: ’’ سَرِيًّا ‘‘ ’’سَرَي يَسْرِيْ ‘‘} (ض) (چلنا) سے ہو تو معنی ہے ندی، کیونکہ اس میں پانی چلتا ہے اور {’’سَرُوَ يَسْرُوْ‘‘} ({شَرُفَ يَشْرُفُ}) سے ہو تو معنی ہے سردار۔ مریم علیھا السلام کو ان کے نیچے سے کس نے آواز دی؟ اس کے متعلق مفسرین کے دو قول ہیں، ایک یہ کہ وہ جبریل علیہ السلام تھے، کیونکہ عیسیٰ علیہ السلام نے قوم کے طعن و ملامت کے وقت ہی بات کی تھی۔ طبری نے ابن عباس رضی اللہ عنھما سے یہ بات نقل فرمائی ہے کہ یہ جبریل تھے اور عیسیٰ علیہ السلام نے قوم کے پاس لے جانے سے پہلے کلام نہیں کیا۔ مگر یہ روایت عوفی کے طریق سے ہونے کی وجہ سے ضعیف ہے۔ سعید بن جبیر، ضحاک، عمرو بن میمون اور قتادہ کا کہنا بھی یہی ہے کہ انھیں نیچے سے جبریل علیہ السلام نے آواز دی تھی اور ان کے نیچے ایک ندی چلنے کی بشارت دی تھی۔ دوسرا قول یہ ہے کہ انھیں ان کے نیچے سے عیسیٰ علیہ السلام نے آواز دی تھی۔ ابن جریر نے اسے ترجیح دی ہے۔ اس کی تین وجہیں ہیں، ایک یہ کہ اگر کوئی مانع نہ ہو تو ضمیر قریب ترین مرجع کی طرف لوٹتی ہے اور یہاں اس سے پہلے قریب ترین ذکر عیسیٰ علیہ السلام کا ہے، یعنی {’’ فَحَمَلَتْهُ فَانْتَبَذَتْ بِهٖ ‘‘} اور اگر جبریل علیہ السلام نے آواز دی ہوتی تو ان کا نام آنا تھا۔ دوسری یہ کہ اس وقت مریم علیھا السلام کا حوصلہ مضبوط کرنے کی ضرورت تھی اور ظاہر ہے کہ عیسیٰ علیہ السلام کا اس وقت بولنا ایک معجزہ تھا، جس سے انھیں اطمینان حاصل ہوا۔ تیسری یہ کہ قوم کے پاس جانے سے پہلے ان کے کلام کرنے سے مریم علیھا السلام کو یقین ہو جائے کہ قوم کے لوگوں کی ملامت کے وقت بھی یہ بول کر ان کی تسلی کر دیں گے۔ بظاہر ابن جریر کی بات زیادہ قوی معلوم ہوتی ہے۔ (واللہ اعلم)"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 26،25) ➊ {وَ هُزِّيْۤ اِلَيْكِ بِجِذْعِ النَّخْلَةِ … : ’’ قَرِّيْ عَيْنًا ‘‘} مشہور نحوی فراء نے فرمایا کہ قریش اور ان کے آس پاس کے لوگ {’’ قَرَّ يَقَرُّ ‘‘} (قاف کے فتحہ کے ساتھ) کہتے ہیں اور قیس، تمیم اور اہل نجد {’’قَرَّ يَقِرُّ‘‘ } (قاف کے کسرہ کے ساتھ) کہتے ہیں۔ پہلی صورت میں {’’ قَرِّيْ ‘‘} قاف کے فتحہ کے ساتھ ہو گا جو مشہور قراء ت ہے، دوسری صورت میں قاف کے کسرہ کے ساتھ {’’قِرِّيْ‘‘} ہو گا جو شاذ قراء ت ہے۔ مصدر {’’ قُرَّةٌ وَ قُرُوْرٌ‘‘} ہے، ٹھنڈا ہونا۔ (بقاعی) تنہائی، بھوک، پیاس، ولادت کی تکلیف، ولادت کے بعد کی کمزوری اور بدنامی کے خوف میں سے ہر چیز کا اللہ تعالیٰ نے معجزانہ طور پر بہترین علاج فرما دیا۔ ایک کمزور خاتون جو ابھی ولادت کے جان شکن مرحلے سے نکلی ہو کھجور کے تنے کو کس قدر حرکت دے سکتی ہے؟ مگر فرمایا کہ اسے حرکت دو، وہ تازہ پکی ہوئی کھجوریں تم پر گرائے گی۔ اکثر مفسرین کہتے ہیں کہ وہ کھجوروں کے پھل دینے کا وقت نہ تھا۔ ممکن ہے ایسا ہی ہو، کیونکہ مریم علیھا السلام کو ان کے کمرے میں بے موسم رزق ملتا تھا، تفصیل کے لیے دیکھیے سورۂ آل عمران (۳۷) لیکن اگر کھجوروں کے پھل کا موسم بھی مانا جائے تو کوئی جوان اور مضبوط آدمی کھجور کا تنا ہلا کر دیکھ لے کہ کتنی کھجوریں گرتی ہیں؟ ولادت کی کمزوری کے لیے تمام اطباء تازہ پکی ہوئی کھجور کے مفید ہونے پر متفق ہیں۔ پینے کے لیے ان کے نیچے رب تعالیٰ نے ندی جاری فرما دی۔ تنہائی اور پریشانی کے علاج کے لیے آنکھوں کی ٹھنڈک، خوبصورت اور عظیم المرتبت بیٹا عطا کیا اور سب سے بڑھ کر یہ کہ اللہ تعالیٰ کی تمام عنایات عام عادت کے خلاف معجزانہ طور پر ہوئیں۔ رہی آئندہ کی ملامت جو قوم کے پاس جانے کی صورت میں پیش آنے والی تھی، اس کا علاج یہ بتایا گیا کہ اگر کسی بھی وقت کوئی آدمی دیکھو تو اسے اشارے سے کہہ دو کہ میں نے رحمان کی خاطر روزے کی نذر مانی ہے، اس لیے میں کسی انسان سے کسی صورت بات نہیں کروں گی۔ کسی بھی وقت کسی انسان کو دیکھنے کے الفاظ سے معلوم ہوتا ہے کہ اس سارے عمل کے دوران وہ تنہا رہیں۔ ¤ ➋ { اِنِّيْ نَذَرْتُ لِلرَّحْمٰنِ صَوْمًا :} چونکہ شادی کے بغیر بچہ پیدا ہونے پر ملامت کرنے والوں کا کسی طرح کی صفائی دینے سے بھی مطمئن ہونا ممکن نہ تھا، اس لیے ان کے جواب میں مکمل خاموش رہنے کا حکم دیا گیا۔ جاہلوں کے جواب میں دانش مند لوگوں کا یہی وتیرہ ہے، اللہ تعالیٰ نے فرمایا : «{ وَ اِذَا خَاطَبَهُمُ الْجٰهِلُوْنَ قَالُوْا سَلٰمًا }» [ الفرقان : ۶۳ ] ’’اور جب جاہل لوگ ان سے بات کرتے ہیں تو وہ کہتے ہیں سلام ہے۔‘‘ عربی کا مقولہ ہے : {’’أَذَلُّ النَّاسِ سَفِيْهٌ لَا يَجِدُ مُسَافِهًا‘‘} کہ سب سے زیادہ ذلیل وہ بے وقوف ہے جسے اپنے جواب میں کوئی بے وقوفی کرنے والا نہ ملے۔ ¤ ➌ { فَلَنْ اُكَلِّمَ الْيَوْمَ اِنْسِيًّا :} اس آیت سے معلوم ہوا کہ بنی اسرائیل میں خاموشی کا روزہ رکھنا جائز تھا، مگر ہماری شریعت میں اس سے منع کر دیا گیا، بلکہ اس طرح کی نذر ماننا بھی منع ہے۔ ابن عباس رضی اللہ عنھما فرماتے ہیں : [ بَيْنَا النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ و وَسَلَّمَ يَخْطُبُ إِذَا هُوَ بِرَجُلٍ فَسَأَلَ  عَنْهٗ فَقَالُوْا أَبُوْ إِسْرَائِيْلَ نَذَرَ أَنْ يَّقُوْمَ وَلاَ يَقْعُدَ وَلاَ يَسْتَظِلَّ وَلَا يَتَكَلَّمَ وَيَصُوْمَ فَقَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ مُرْهٗ فَلْيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَقْعُدْ وَلْيُتِمَّ صَوْمَهٗ ] [ بخاري، الأیمان والنذور، باب النذر فیما لا یملک و في معصیۃ : ۶۷۰۴ ]’’نبی صلی اللہ علیہ وسلم خطبہ دے رہے تھے، اس دوران میں آپ نے ایک آدمی کو کھڑے ہوئے دیکھا تو اس کے متعلق پوچھا، لوگوں نے بتایا کہ یہ ابو اسرائیل ہے، اس نے نذر مانی ہے کہ دھوپ میں کھڑا رہے گا، سائے میں نہیں جائے گا اور کلام نہیں کرے گا اور روزہ رکھے گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اسے حکم دو کہ بیٹھ جائے اور سائے میں بھی جائے اور کلام کرے اور اپنا روزہ پورا کرے۔‘‘ {’’ فَاِمَّا ‘‘} میں {’’اِنْ‘‘ } شرطیہ اور{ ’’مَا‘‘ } ابہامیہ برائے تاکید ہے، اس لیے ترجمہ ’’اگر کبھی‘‘ کیا ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26،25) ➊ {وَ هُزِّيْۤ اِلَيْكِ بِجِذْعِ النَّخْلَةِ … : ’’ قَرِّيْ عَيْنًا ‘‘} مشہور نحوی فراء نے فرمایا کہ قریش اور ان کے آس پاس کے لوگ {’’ قَرَّ يَقَرُّ ‘‘} (قاف کے فتحہ کے ساتھ) کہتے ہیں اور قیس، تمیم اور اہل نجد {’’قَرَّ يَقِرُّ‘‘ } (قاف کے کسرہ کے ساتھ) کہتے ہیں۔ پہلی صورت میں {’’ قَرِّيْ ‘‘} قاف کے فتحہ کے ساتھ ہو گا جو مشہور قراء ت ہے، دوسری صورت میں قاف کے کسرہ کے ساتھ {’’قِرِّيْ‘‘} ہو گا جو شاذ قراء ت ہے۔ مصدر {’’ قُرَّةٌ وَ قُرُوْرٌ‘‘} ہے، ٹھنڈا ہونا۔ (بقاعی) تنہائی، بھوک، پیاس، ولادت کی تکلیف، ولادت کے بعد کی کمزوری اور بدنامی کے خوف میں سے ہر چیز کا اللہ تعالیٰ نے معجزانہ طور پر بہترین علاج فرما دیا۔ ایک کمزور خاتون جو ابھی ولادت کے جان شکن مرحلے سے نکلی ہو کھجور کے تنے کو کس قدر حرکت دے سکتی ہے؟ مگر فرمایا کہ اسے حرکت دو، وہ تازہ پکی ہوئی کھجوریں تم پر گرائے گی۔ اکثر مفسرین کہتے ہیں کہ وہ کھجوروں کے پھل دینے کا وقت نہ تھا۔ ممکن ہے ایسا ہی ہو، کیونکہ مریم علیھا السلام کو ان کے کمرے میں بے موسم رزق ملتا تھا، تفصیل کے لیے دیکھیے سورۂ آل عمران (۳۷) لیکن اگر کھجوروں کے پھل کا موسم بھی مانا جائے تو کوئی جوان اور مضبوط آدمی کھجور کا تنا ہلا کر دیکھ لے کہ کتنی کھجوریں گرتی ہیں؟ ولادت کی کمزوری کے لیے تمام اطباء تازہ پکی ہوئی کھجور کے مفید ہونے پر متفق ہیں۔ پینے کے لیے ان کے نیچے رب تعالیٰ نے ندی جاری فرما دی۔ تنہائی اور پریشانی کے علاج کے لیے آنکھوں کی ٹھنڈک، خوبصورت اور عظیم المرتبت بیٹا عطا کیا اور سب سے بڑھ کر یہ کہ اللہ تعالیٰ کی تمام عنایات عام عادت کے خلاف معجزانہ طور پر ہوئیں۔ رہی آئندہ کی ملامت جو قوم کے پاس جانے کی صورت میں پیش آنے والی تھی، اس کا علاج یہ بتایا گیا کہ اگر کسی بھی وقت کوئی آدمی دیکھو تو اسے اشارے سے کہہ دو کہ میں نے رحمان کی خاطر روزے کی نذر مانی ہے، اس لیے میں کسی انسان سے کسی صورت بات نہیں کروں گی۔ کسی بھی وقت کسی انسان کو دیکھنے کے الفاظ سے معلوم ہوتا ہے کہ اس سارے عمل کے دوران وہ تنہا رہیں۔ ¤ ➋ { اِنِّيْ نَذَرْتُ لِلرَّحْمٰنِ صَوْمًا :} چونکہ شادی کے بغیر بچہ پیدا ہونے پر ملامت کرنے والوں کا کسی طرح کی صفائی دینے سے بھی مطمئن ہونا ممکن نہ تھا، اس لیے ان کے جواب میں مکمل خاموش رہنے کا حکم دیا گیا۔ جاہلوں کے جواب میں دانش مند لوگوں کا یہی وتیرہ ہے، اللہ تعالیٰ نے فرمایا : «{ وَ اِذَا خَاطَبَهُمُ الْجٰهِلُوْنَ قَالُوْا سَلٰمًا }» [ الفرقان : ۶۳ ] ’’اور جب جاہل لوگ ان سے بات کرتے ہیں تو وہ کہتے ہیں سلام ہے۔‘‘ عربی کا مقولہ ہے : {’’أَذَلُّ النَّاسِ سَفِيْهٌ لَا يَجِدُ مُسَافِهًا‘‘} کہ سب سے زیادہ ذلیل وہ بے وقوف ہے جسے اپنے جواب میں کوئی بے وقوفی کرنے والا نہ ملے۔ ¤ ➌ { فَلَنْ اُكَلِّمَ الْيَوْمَ اِنْسِيًّا :} اس آیت سے معلوم ہوا کہ بنی اسرائیل میں خاموشی کا روزہ رکھنا جائز تھا، مگر ہماری شریعت میں اس سے منع کر دیا گیا، بلکہ اس طرح کی نذر ماننا بھی منع ہے۔ ابن عباس رضی اللہ عنھما فرماتے ہیں : [ بَيْنَا النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ و وَسَلَّمَ يَخْطُبُ إِذَا هُوَ بِرَجُلٍ فَسَأَلَ  عَنْهٗ فَقَالُوْا أَبُوْ إِسْرَائِيْلَ نَذَرَ أَنْ يَّقُوْمَ وَلاَ يَقْعُدَ وَلاَ يَسْتَظِلَّ وَلَا يَتَكَلَّمَ وَيَصُوْمَ فَقَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ مُرْهٗ فَلْيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَقْعُدْ وَلْيُتِمَّ صَوْمَهٗ ] [ بخاري، الأیمان والنذور، باب النذر فیما لا یملک و في معصیۃ : ۶۷۰۴ ]’’نبی صلی اللہ علیہ وسلم خطبہ دے رہے تھے، اس دوران میں آپ نے ایک آدمی کو کھڑے ہوئے دیکھا تو اس کے متعلق پوچھا، لوگوں نے بتایا کہ یہ ابو اسرائیل ہے، اس نے نذر مانی ہے کہ دھوپ میں کھڑا رہے گا، سائے میں نہیں جائے گا اور کلام نہیں کرے گا اور روزہ رکھے گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اسے حکم دو کہ بیٹھ جائے اور سائے میں بھی جائے اور کلام کرے اور اپنا روزہ پورا کرے۔‘‘ {’’ فَاِمَّا ‘‘} میں {’’اِنْ‘‘ } شرطیہ اور{ ’’مَا‘‘ } ابہامیہ برائے تاکید ہے، اس لیے ترجمہ ’’اگر کبھی‘‘ کیا ہے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { فَاَتَتْ بِهٖ قَوْمَهَا تَحْمِلُهٗ:} اپنے بچے کی بات سن کر اور اللہ تعالیٰ کی عطا کردہ کرامات دیکھ کر مریم علیھا السلام کو اطمینان ہو گیا کہ اللہ تعالیٰ اسے ذلیل نہیں ہونے دے گا۔ چنانچہ وہ ایام نفاس گزرنے اور طبیعت بحال ہونے کے بعد کسی جھجک کے بغیر اپنے بچے کو اٹھائے ہوئے اپنے لوگوں کے پاس آ گئیں۔ ¤ ➋ { قَالُوْا يٰمَرْيَمُ لَقَدْ جِئْتِ شَيْـًٔا فَرِيًّا : ’’ فَرَي يَفْرِيْ ‘‘} (ض) کا معنی چمڑے کو قطع کرنا ہے۔ {’’ فَرِيًّا ‘‘} بروزن {’’فَعِيْلٌ‘‘} بمعنی فاعل یا مفعول ہے، قطع کرنے والی یا قطع کی ہوئی، یعنی عام عادت اور معمول کے خلاف چیز، اس لیے اس کا معنی بعض نے عظیم، بعض نے عجیب اور بعض نے منکر یعنی انوکھی کیا ہے۔ بہتان کو بھی افترا کہتے ہیں، کیونکہ وہ بھی واقعہ کے خلاف ہوتا ہے۔ لفظی معنی ہے ’’تو ایک انوکھی چیز کو آئی ہے ‘‘ یعنی تو نے ایک انوکھا کام کیا ہے۔ مراد کنواری کے ہاں بچے کی پیدائش ہے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ {يٰۤاُخْتَ هٰرُوْنَ مَا كَانَ اَبُوْكِ …:} مریم علیھا السلام کے بھائی کا نام ہارون تتھا جو اپنی نیکی اور شرافت میں مشہور تھا، یعنی ایسے صالح بھائی کی بہن، ایسے باپ کی بیٹی جو کسی طرح برا نہ تھا اور ایسی ماں کی بیٹی جس میں بدکاری کی کوئی خصلت نہ تھی، تو نے یہ کیا گل کھلا دیا؟ ان الفاظ میں وہ مریم علیھا السلام کو اشارتاً برائی سے متہم کر رہے تھے۔ ’’کسی طرح برا‘‘ اور ’’بدکاری کی کسی خصلت والی‘‘ کا مفہوم {’’ إِمْرَاَ سَوْءٍ ‘‘} اور {’’ بَغِيًّا ‘‘} کے نکرہ ہونے سے واضح ہو رہا ہے، جو عموم پر دلالت کرتا ہے۔ ¤ ➋ عظیم پیغمبر موسیٰ علیہ السلام کے بھائی کا نام بھی ہارون تھا اور وہ بھی نبی تھے۔ اس آیت میں مذکور ہارون کو بعض اہل کتاب نے موسیٰ علیہ السلام کا بھائی ہارون سمجھ لیا اور اعتراض جڑ دیا کہ مریم علیھا السلام ہارون علیہ السلام کی بہن کیسے ہو سکتی ہیں، ان کے درمیان تو مدت دراز ہے۔ علمائے اسلام نے اس کے مختلف جواب دیے ہیں، مثلاً یہ کہ ہارون علیہ السلام کی بہن سے مراد ہارون علیہ السلام جیسی نیک اور صالح خاتون ہے وغیرہ۔ مگر رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے بعد وہ سب جواب محض تکلف ہیں۔ خلاصہ اس کا یہ ہے کہ اس آیت میں مذکور ہارون مریم علیھا السلام کے بھائی تھے۔ یہ ایک حُسنِ اتفاق ہے کہ موسیٰ و ہارون علیھما السلام کے والد بھی عمران تھے اور عیسیٰ علیہ السلام کی والدہ مریم اور ان کے بھائی ہارون کے والد بھی عمران تھے۔ مغیرہ بن شعبہ رضی اللہ عنہ فرماتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے نجران بھیجا تو وہاں کے لوگوں (نصاریٰ) نے کہا، یہ بتاؤ کہ تم جو پڑھتے ہو {’’ يٰۤاُخْتَ هٰرُوْنَ ‘‘} (اے ہارون کی بہن!) موسیٰ علیہ السلام تو عیسیٰ علیہ السلام سے اتنی مدت پہلے تھے۔ میں واپس آیا اور اس بات کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَلاَ أَخْبَرْتَهُمْ أَنَّهُمْ كَانُوْا يُسَمُّوْنَ بِأَنْبِيَائِهِمْ وَالصَّالِحِيْننَ قَبْلَهُمْ ] [ ترمذی، تفسیر القرآن، باب و من سورۃ مریم : ۳۱۵۵۔ مسلم : ۲۱۳۵ ] ’’تم نے انھیں یہ کیوں نہ بتایا کہ وہ لوگ اپنے سے پہلے انبیاء اور صالحین کے ناموں پر (اپنے بچوں کے) نام رکھتے تھے (یعنی مریم علیھا السلام کے بھائی کا نام ہارون، موسیٰ علیہ السلام کے بھائی ہارون علیہ السلام کے نام پر رکھا گیا تھا)۔‘‘"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) {فَاَشَارَتْ اِلَيْهِ قَالُوْا كَيْفَ … :} مریم علیھا السلام نے خاموشی کے روزے کی وجہ سے اپنی پاکدامنی کی شہادت کے لیے عیسیٰ علیہ السلام کی طرف اشارہ کیا کہ اس سے پوچھ لو۔ وہ سب کہنے لگے کہ ہم اس سے کیسے بات کریں جو ابھی تک گود میں بچہ ہے؟ یہاں {’’ كَانَ ‘‘} زمانۂ حال تک استمرار (ہمیشگی) کے معنی میں ہے۔ یہ آیت دلیل ہے کہ آئندہ آیات میں عیسیٰ علیہ السلام کی گفتگو گود کے وقت کی گفتگو ہے۔ معجزات کے بعض منکروں نے اسے عیسیٰ علیہ السلام کی جوانی کی گفتگو قرار دیا ہے، مگر یہ آیات اور سورۂ آل عمران کی آیت (۴۶) عیسیٰ علیہ السلام کی گود میں گفتگو کی صریح دلیل ہیں۔ علاوہ ازیں صحیح حدیث میں تین بچوں کی گود میں گفتگو کا ذکر ہے جن میں سے ایک عیسیٰ علیہ السلام ہیں۔ [ بخاري، أحادیث الأنبیاء، باب : « و اذکر فی الکتاب مریم…» : ۳۴۳۶، عن أبي ھریرۃ رضی اللہ عنہ ]"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { قَالَ اِنِّيْ عَبْدُ اللّٰهِ :} گویا سب سے پہلا کلمہ جو عیسیٰ علیہ السلام نے اپنی زبان سے ادا کیا وہ اللہ تعالیٰ کی بندگی کا اعتراف تھا، جو ان کے خود اللہ تعالیٰ ہونے یا اللہ تعالیٰ کا بیٹا ہونے یا تین معبودوں میں سے ایک ہونے کی صاف نفی ہے۔ ¤ ➋ { اٰتٰىنِيَ الْكِتٰبَ......:} ظاہر ہے کہ کتاب اور نبوت کا ملنا کچھ مدت بعد ہی ہوا ہو گا، کیونکہ دودھ پیتا بچہ نبوت کے فرائض دعوت و تبلیغ، اصلاح امت وغیرہ کیسے ادا کر سکتا ہے؟ اس لیے اس کے دو معنی ہو سکتے ہیں اور دونوں ہی درست ہیں۔ ایک تو یہ کہ ازل سے اللہ تعالیٰ نے میرا نبی ہونا اور مجھے کتاب ملنا لکھ دیا ہے، جیسا کہ ہمارے نبی کریم صلی اللہ علیہ وسلم نے فرمایا : [ كُنْتُ نَبِيًّا وَآدَمُ بَيْنَ الرُّوْحِ وَالْجَسَدِ ] [ صحیح الجامع للألباني : ۴۵۸۱، عن میسرۃ الفجر رضی اللہ عنہ ]’’میں اس وقت نبی تھا جب آدم علیہ السلام روح اور جسم کے درمیان تھے۔‘‘ حالانکہ اس بات پر اتفاق ہے کہ آپ صلی اللہ علیہ وسلم کو چالیس برس کی عمر میں نبوت عطا ہوئی، اس لیے مراد تقدیر میں نبی لکھا ہونا ہے۔ دوسرا معنی یہ کہ ماضی کا لفظ بول کر مستقبل مراد لیا ہے، کیونکہ اللہ تعالیٰ کے فیصلے اتنے یقینی ہیں کہ سمجھو واقع ہو چکے ہیں۔ یہ اندازبیان قرآن مجید میں عام ہے، جیسے قیامت کے متعلق فرمایا : «{اَتٰۤى اَمْرُ اللّٰهِ فَلَا تَسْتَعْجِلُوْهُ}» [ النحل : ۱ ] ’’اللہ کا حکم آ گیا، سو اس کے جلدی آنے کا مطالبہ مت کرو۔‘‘ اسی طرح سورۂ زمر کی آیت (۶۸) میں ماضی کے چاروں صیغے مستقبل کے معنی میں ہیں۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ {وَ جَعَلَنِيْ مُبٰرَكًا اَيْنَ مَا كُنْتُ : ’’ مُبٰرَكًا ‘‘} یہاں باب مفاعلہ مقابلےے کے معنی میں نہیں بلکہ مبالغہ کے لیے ہے، یعنی بہت برکت والا۔ برکت کا معنی خیر کثیر ہے جو {’’ بِرْكَةٌ ‘‘} سے ہے، جس کا معنی تالاب ہے جس میں بہت پانی ہوتا ہے، یعنی اللہ تعالیٰ نے مجھے لوگوں کے لیے بہت خیر و برکت اور نفع پہنچانے والا بنایا ہے۔ ¤¤ ➋ { وَ اَوْصٰنِيْ بِالصَّلٰوةِ وَ الزَّكٰوةِ :} نماز اور زکاۃ کی خاص تاکید کی وجہ کے لیے دیکھیے سورۂ توبہ (۵، ۱۱) اس آیت سے معلوم ہوا کہ نماز، زکاۃ اور شریعت کے دوسرے احکام موت تک کسی کو معاف نہیں۔ ہمارے نبی کریم صلی اللہ علیہ وسلم کو بھی فوت ہونے تک عبادت کا حکم ہوا، چنانچہ فرمایا : «{ وَ اعْبُدْ رَبَّكَ حَتّٰى يَاْتِيَكَ الْيَقِيْنُ }» [ الحجر : ۹۹ ] ’’اور اپنے رب کی عبادت کر، یہاں تک کہ تیرے پاس یقین (موت) آ جائے۔‘‘ موسیٰ علیہ السلام کو نبوت ملی تو توحید کی تاکید کے بعد نماز کا حکم ہوا۔ دیکھیے سورۂ طٰہٰ (۱۴) ابراہیم علیہ السلام نے اللہ تعالیٰ سے اپنے اور اپنی اولاد کے لیے نماز کا پابند رہنے کی دعا کی۔ دیکھیے سورۂ ابراہیم (۴۰) جب اولوالعزم پیغمبروں کو کسی صورت نماز معاف نہیں ہوئی تو بعض صوفیوں کو کیسے معاف ہو گئی اور پیغمبروں کو صرف دل کی نماز کافی نہیں ہوئی تو انھیں کیسے کافی ہو گئی؟ درحقیقت یہ لوگ اسی سورۂ مریم کی آیت (۵۹) کی حقیقی تصویر ہیں۔ ¤ ➌ چونکہ اللہ تعالیٰ کے علم میں پہلے سے یہ بات موجود تھی کہ کچھ لوگ عیسیٰ علیہ السلام کو معبود بنائیں گے، اس لیے انھیں ساری زندگی نماز اور زکاۃ کا حکم دیا، تاکہ سب لوگ جان لیں کہ جو خود کسی معبود کے سامنے نماز پڑھتا ہے وہ کسی صورت معبود نہیں ہو سکتا۔ (بقاعی)"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ {وَبَرًّۢا بِوَالِدَتِيْ …:} دیکھیے اسی سورت کی آیت (۱۴) وہاں {’’ عَصِيًّا ‘‘} فرمایا اور یہاں {’’ شَقِيًّا ۔‘‘} معلوم ہوا کہ والدین سے بدسلوکی کرنے والا شقی اور بدنصیب ہے، خصوصاً ایسی والدہ سے جو باپ اور ماں دونوں کی جگہ ہو۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ رَغِمَ أَنْفُ ثُمَّ رَغِمَ أَنْفُ ثُمَّ رَغِمَ أَنْفُ قِيْلَ مَنْ يَا رَسُوْلَ اللّٰهِ ! قَالَ مَننْ أَدْرَكَ أَبَوَيْهِ عِنْدَ الْكِبَرِ أَحَدَهُمَا أَوْ كِلَيْهِمَا فَلَمْ يَدْخُلِ الْجَنَّةَ ] [ مسلم، البر والصلۃ، باب رغم من أدرک أبویہ أو أحدھما… : ۲۵۵۱، عن أبي ھریرۃ رضی اللہ عنہ ] ’’اس کی ناک خاک آلود ہو، اس کی ناک خاک آلود ہو، اس کی ناک خاک آلود ہو!‘‘ پوچھا گیا : ’’یا رسول اللہ! کون؟‘‘ فرمایا : ’’جس نے اپنے والدین میں سے ایک کو یا دونوں کو بڑھاپے میں پایا پھر جنت میں داخل نہ ہوا۔‘‘ جنت میں داخلے سے محروم ہو جانے سے بڑھ کر کیا بدبختی ہو گی؟ ¤ ➋ عیسیٰ علیہ السلام نے صرف والدہ کا نام لیا، تاکہ لوگوں کو ان کے باپ کے بغیر پیدا ہونے کا یقین ہو جائے اور والدہ کا ہر تہمت سے پاک ہونا ثابت ہو جائے۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) { وَ السَّلٰمُ عَلَيَّ يَوْمَ وُلِدْتُّ …:} دیکھیے اسی سورت کی آیت (۱۵) وہاں {’’ سَلٰمٌ ‘‘} اور یہاں {’’ السَّلٰمُ ‘‘} ہے، اس لیے ترجمہ ’’خاص سلامتی‘‘ کیا ہے۔ اس خاص سلامتی میں وہ خصوصیت بھی شامل ہے جو صرف عیسیٰ علیہ السلام اور ان کی والدہ کو حاصل ہوئی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا مِنْ مَوْلُوْدٍ يُوْلَدُ إِلَّا وَالشَّيْطَانُ يَمَسُّهُ حِيْنَ يُوْلَدُ فَيَسْتَهِلُّ صَارِخًا مِنْ مَسِّ الشَّيْطَانِ إِيَّاهُ إِلَّا مَرْيَمَ وَابْنَهَا ثُمَّ يَقُوْلُ أَبُوْ هُرَيْرَةَ وَاقْرَؤُوْا إِنْ شِئْتُمْ : «{ وَ اِنِّيْ اُعِيْذُهَا بِكَ وَ ذُرِّيَّتَهَا مِنَ الشَّيْطٰنِ الرَّجِيْمِ }» ] [ بخاري، التفسیر، باب قولہ : « و إنی أعیذھا بک…» : ۴۵۴۸، عن أبی ھریرۃ رضی اللہ عنہ ]’’کوئی بچہ نہیں مگر اس کا حال یہ ہے کہ شیطان اسے پیدا ہوتے وقت چھوتا ہے تو وہ اس کے چھونے کی وجہ سے چلاتے ہوئے اونچی آواز سے روتا ہے، سوائے مریم کے اور اس کے بیٹے کے۔‘‘ پھر ابوہریرہ رضی اللہ عنہ فرماتے:’’اگر چاہو تو یہ آیت پڑھ لو : «{ وَ اِنِّیْ اُعِیْذُھَا بِکَ وَ ذُرِّیَّتَھَا مِنَ الشَّیْطٰنِ الرَّجِیْمِ }» ’’(یعنی مریم علیھا السلام کی والدہ نے دعا کی تھی کہ یا اللہ!) میں اس (مریم) کو اور اس کی اولاد کو شیطان رجیم سے تیری پناہ میں دیتی ہوں۔‘‘"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) { ذٰلِكَ عِيْسَى ابْنُ مَرْيَمَ … : ’’ قَوْلَ الْحَقِّ ‘‘} اصل میں {’’اَلْقَوْلَ الْحَقَّ‘‘} تھا، یعنی وہ بات جو حق اور سچ ہے، تخفیف کے لیے موصوف کو صفت کی طرف مضاف کر دیا، یعنی عیسیٰ علیہ السلام کے بارے میں سچ بات صرف وہ ہے جو یہاں خود ان کی زبانی بیان کر دی گئی کہ وہ اللہ کے بندے اور اس کے سچے رسول ہیں اور ان کا نسب ہر شک و شبہ اور ہر عیب سے پاک ہے۔ رہے ان کی والدہ اور ان پر تہمت تراشنے والے یہود اور انھیں رب قرار دینے والے نصاریٰ، تو ان کی بات محض شکوک و شبہات پر مبنی ہے، اس میں حق کا کوئی شائبہ نہیں۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ { مَا كَانَ لِلّٰهِ اَنْ يَّتَّخِذَ مِنْ وَّلَدٍ … : ’’ كَانَ ‘‘} استمرار کے لیے ہے، یعنی اللہ کے لائق نہ پہلے کبھی تھا اور نہ ہے کہ وہ کوئی بھی اولاد بنائے۔ {’’ وَلَدٍ ‘‘} نکرہ ہونے کی وجہ سے ترجمہ تھا ’’کوئی اولاد‘‘ لیکن اس سے پہلے {’’ مِنْ ‘‘} آنے کی وجہ سے عموم اور زیادہ ہو گیا، اس لیے ترجمہ کیا گیا ہے ’’کہ وہ کوئی بھی اولاد بنائے‘‘ لڑکا یا لڑکی، کسی فرشتے کو یا جن کو، یا انسان کو یا کسی اور مخلوق کو۔ ¤ ➋ { يَقُوْلُ لَهٗ كُنْ فَيَكُوْنُ :} یعنی جسے یہ قدرت حاصل ہو کہ کلمہ {’’ كُنْ ‘‘} سے ہر چیز وجود میں لا سکتا ہو اسے بیٹا بنانے کی کیا ضرورت ہے؟ بیٹے کی ضرورت تو اسے ہے جو بڑھاپے اور کمزوری کی وجہ سے محتاج ہو، یا فنا ہونے والا ہو اور اسے وارث کی ضرورت ہو۔ مزید دیکھیے سورۂ بنی اسرائیل کی آخری آیت۔ پھر جب وہ آدم کو {’’كُنْ‘‘} کہہ کر پیدا کر سکتا ہے تو عیسیٰ علیہ السلام کو بھی آدم علیہ السلام کی طرح {’’ كُنْ ‘‘} کہہ کر پیدا کر سکتا ہے، دیکھیے سورۂ آل عمران (۵۹، ۶۰)۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) { وَ اِنَّ اللّٰهَ رَبِّيْ وَ رَبُّكُمْ …:} یہ گود میں عیسیٰ علیہ السلام کے کلام کا آخری حصہ اور خلاصہ ہے۔ اس کا عطف {’’ قَالَ اِنِّيْ عَبْدُ اللّٰهِ ‘‘} پر ہے، یعنی انھوں نے کہا کہ بے شک میں اللہ کا بندہ ہوں، اس کے بعد اللہ کی عطا کردہ نعمتیں بیان کیں، درمیان میں {’’ ذٰلِكَ عِيْسَى ابْنُ مَرْيَمَ ‘‘} سے {’’ كُنْ فَيَكُوْنُ ‘‘} تک اللہ تعالیٰ کی طرف سے جملہ معترضہ ہے، پھر عیسیٰ علیہ السلام کی اس بات {’’ وَ اِنَّ اللّٰهَ رَبِّيْ وَ رَبُّكُمْ …‘‘} پر ان کا کلام مکمل ہوتا ہے۔ یعنی عبادت اسی کا حق ہے جو ہمارا رب ہے، میری اور تمھاری پرورش کرنے والا ہے، سو اسی کی عبادت کرو، یہی سیدھا راستہ ہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { فَاخْتَلَفَ الْاَحْزَابُ مِنْۢ بَيْنِهِمْ:} عیسیٰ علیہ السلام کے متعلق حق بات تفصیل سے بیان کرنے کے بعد فرمایا کہ پھر بنی اسرائیل سے باہر کے کسی گروہ نے نہیں بلکہ خود ان کے اپنے گروہوں نے آپس میں اختلاف کیا۔ {’’ مِنْۢ بَيْنِهِمْ ‘‘} میں اسی طرف اشارہ ہے۔ یہود نے انھیں ولد الزنا اور جادوگر قرار دیا اور نصاریٰ کئی گروہوں میں بٹ گئے، کسی نے کہا اللہ مسیح ہی تو ہے۔ (مائدہ : ۷۲) کسی نے کہا مسیح اللہ کا بیٹا ہے۔ (توبہ : ۳۰) کسی نے کہا مسیح تین (معبودوں) میں سے تیسرا ہے وغیرہ۔ مائدہ (۷۳) یہود نے ان کی شان گھٹانے کی کوشش کی تو نصاریٰ نے انھیں ان کی حد سے بڑھا دیا۔ ہاں اہل حق نے یہی کہا کہ وہ اللہ کے بندے اور اس کے رسول ہیں۔ یہود ان کی شان گھٹانے اور ان پر ایمان نہ لانے کی وجہ سے کافر ہو گئے اور نصاریٰ ان کی شان میں غلو کی وجہ سے کافر ہو گئے، البتہ اہل حق ایمان پر قائم رہے۔ ¤ ➋ { فَوَيْلٌ لِّلَّذِيْنَ كَفَرُوْا … : ’’ فَوَيْلٌ ‘‘} پر تنوین (تہویل) یعنی اس کی ہولناکی کے اظہار کے لیے ہے، اس لیے ترجمہ ’’بڑی ہلاکت‘‘ کیا ہے۔ {’’ مَشْهَدِ ‘‘} یہاں راجح قول میں مصدر میمی ہے، یعنی اس عظیم دن میں حاضری کی وجہ سے ان لوگوں کے لیے بہت بڑی ہلاکت ہے جنھوں نے کفر کیا، اگر اس دن کی حاضری نہ ہوتی تو یہ لوگ اس ہلاکت سے بچ جاتے۔ اللہ تعالیٰ نے صرف ’’ان لوگوں کے لیے ‘‘ کہنے کے بجائے صراحت سے فرمایا : ’’ان لوگوں کے لیے جنھوں نے کفر کیا بہت بڑی ہلاکت ہے۔‘‘ معلوم ہوا کہ اس ویل کا باعث کفر ہے۔ یوم عظیم پچاس ہزار سال کا دن (معارج : ۴) اور اللہ کے سامنے حساب کے لیے پیش ہونے کا دن ہے۔ [ اَللّٰھُمَّ حَاسِبْنَا حِسَابًا یَّسِیْرًا ]"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) {اَسْمِعْ بِهِمْ وَ اَبْصِرْ … :} یہ دونوں فعل تعجب ہیں۔ اللہ تعالیٰ تعجب سے فرماتے ہیں کہ جس دن وہ ہمارے پاس آئیں گے تو وہ کس قدر سننے والے اور کس قدر دیکھنے والے ہوں گے۔ بعض لوگ اللہ تعالیٰ کے تعجب کرنے کو نہیں مانتے، کیونکہ تعجب تو انسان کرتا ہے اور اللہ تعالیٰ انسان جیسا تو نہیں کہ تعجب کرے۔ اس لیے وہ اس کی تاویل کرتے ہیں کہ ان کی حالت ایسی ہو گی کہ اس پر تعجب کیا جائے، اگرچہ ان کی حالت واقعی ایسی ہو گی مگر جب انسان کے سننے، دیکھنے کے باوجود اللہ تعالیٰ کو بھی سننے دیکھنے والا مانتے ہیں تو اس کے تعجب کرنے میں کیا تعجب ہے۔ ہاں انسان کا سننا، دیکھنا اور تعجب اس کی ہستی کے مطابق ہے، جبکہ اللہ تعالیٰ کا اس کی شان کے مطابق، جیسا کہ فرمایا : «{ لَيْسَ كَمِثْلِهٖ شَيْءٌ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ }» [ الشورٰی : ۱۱ ] ’’اس کی مثل کوئی چیز نہیں اور وہی سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔‘‘ لطف کی بات یہ ہے کہ اللہ تعالیٰ کے تعجب کرنے کے منکر اس کے سمیع و بصیر ہونے اور دوسری صفات کے بھی منکر ہیں، مگر انکار ایسی تاویل کے پردے میں کرتے ہیں جو درحقیقت آیات و احادیث کی تحریف ہے۔یعنی آج تو حق سے اندھے اور بہرے ہو رہے ہیں مگر آخرت میں ان کے کان اور آنکھیں خوب کھلی ہوں گی اور کہیں گے : «{ رَبَّنَاۤ اَبْصَرْنَا وَ سَمِعْنَا }» [ السجدۃ : ۱۲ ] ’’اے ہمارے رب! ہم نے دیکھ لیا اور سن لیا‘‘ مگر اس وقت کا دیکھنا اور سننا کسی کام نہ آئے گا۔ {’’ الظّٰلِمُوْنَ ‘‘} پر الف لام عہد کا ہے، اس لیے ترجمہ ’’یہ ظالم‘‘ کیا گیا ہے۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ { وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ …:} مراد قیامت کا دن ہے جس میں حسرت اور پچھتاوے کے سوا کوئی چارۂ کار نہ ہو گا۔ مزید تفصیل کے لیے دیکھیے سورۂ زمر (۵۶)، انعام (۳۱) اور بقرہ (۱۶۷)۔ ¤ ➋ { اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ …:} ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُؤْتٰی بِالْمَوْتِ كَهَيْئَةِ كَبْشٍ أَمْلَحَ فَيُنَادِيْ مُنَادٍ يَا أَهْلَ الْجَنَّةِ ! فَيَشْرَئِبُّوْنَ وَ يَنْظُرُوْنَ فَيَقُوْلُ هَلْ تَعْرِفُوْنَ هٰذَا ؟ فَيَقُوْلُوْنَ نَعَمْ هٰذَا الْمَوْتُ وَكُلُّهُمْ قَدْ رَاٰهُ ثُمَّ يُنَادِيْ يَا أَهْلَ النَّارِ ! فَيَشْرَئِبُّوْنَ وَ يَنْظُرُوْنَ فَيَقُوْلُ هَلْ تَعْرِفُوْنَ هٰذَا ؟ فَيَقُوْلُوْنَ نَعَمْ، هٰذَا الْمَوْتُ وَ كُلُّهُمْ قَددْ رَاٰهُ فَيُذْبَحُ ثُمَّ يَقُوْلُ يَا أَهْلَ الْجَنَّةِ ! خُلُوْدٌ فَلَا مَوْتَ وَ يَا أَهْلَ النَّارِ ! خُلُوْدٌ فَلاَ مَوْتَ، ثُمَّ قَرَأَ: «{ وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْررُ وَ هُمْ فِيْ غَفْلَةٍ }» وَهٰؤُلَاءِ فِيْ غَفْلَةٍ أَهْلُ الدُّنْيَا «{ وَ هُمْ لَا يُؤْمِنُوْنَ }» ] [بخاري، التفسیر، باب قولہ عز وجل: «و أنذرھم یوم الحسرۃ » : ۴۷۳۰ ] ’’موت کو ایک چتکبرے مینڈھے کی شکل میں لایا جائے گا، پھر ایک آواز دینے والا آواز دے گا : ’’اے جنت والو!‘‘ تو وہ سر اٹھائیں گے اور دیکھیں گے۔ وہ کہے گا : ’’کیا تم اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں! یہ موت ہے‘‘ اور وہ سب اسے دیکھ چکے ہوں گے، پھر وہ آواز دے گا : ’’اے آگ والو!‘‘ تو وہ سر اٹھائیں گے اور دیکھیں گے، وہ کہے گا : ’’کیا تم اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں! یہ موت ہے‘‘ اور وہ سب اسے دیکھ چکے ہوں گے تو اسے ذبح کر دیا جائے گا۔ پھر وہ کہے گا : ’’اے جنت والو! (اب) ہمیشگی ہے، کوئی موت نہیں اور اے آگ والو! (اب) ہمیشگی ہے، کوئی موت نہیں۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «{ وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ }» (اور انھیں پچھتاوے کے دن سے ڈرا جب فیصلہ کر دیا جائے گا اور وہ سراسر غفلت میں ہیں) یعنی وہ سراسر دنیا کی غفلت میں ہیں اور ایمان نہیں لاتے۔‘‘ نبی صلی اللہ علیہ وسلم کا موت کے ذبح کے ذکر کے بعد اس آیت کو پڑھنا دلیل ہے کہ {’’ قُضِيَ الْاَمْرُ ‘‘} (فیصلہ کر دیے جانے) سے مراد موت کا ذبح کر دیا جانا ہے۔ مسند احمد (۳؍۹، ح : ۱۱۰۷۲) میں اسی حدیث کے شروع میں ہے کہ جب (تمام) جنتی جنت میں اور جہنمی جہنم میں چلے جائیں گے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) {اِنَّا نَحْنُ نَرِثُ الْاَرْضَ …:} اس میں اللہ تعالیٰ نے اپنی عظمت کا اظہار کرتے ہوئے اپنا ذکر تین دفعہ جمع متکلم کی ضمیر سے کیا ہے۔ دنیا کے بادشاہ بھی حکم دیتے وقت یا اپنی شان و شوکت کے اظہار کے وقت کہا کرتے ہیں کہ ’’ہم حکم دیتے ہیں‘‘ ’’ہم یہ کریں گے‘‘ وغیرہ، حالانکہ وہ اکیلے حکم دے رہے ہوتے ہیں۔ پھر اللہ تعالیٰ جس کی عظمت کی کوئی حد نہیں، اکیلا ہونے کے باوجود اپنی عظمت کے اظہار کے لیے کیوں نہ فرمائے گا کہ بے شک ہم، ہم ہی زمین کے وارث ہوں گے۔ اردو ترجمے میں ’’ہی‘‘ کا لفظ تیسرے ’’ہم‘‘ کی جگہ لگایا گیا ہے، جو لفظ {’’ نَرِثُ ‘‘} میں ہے۔ مطلب یہ ہے کہ سب فنا ہو جائیں گے اور ہمارے سوا ان کا وارث (پیچھے رہنے والا) کوئی نہ ہو گا۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ { وَ اذْكُرْ فِي الْكِتٰبِ اِبْرٰهِيْمَ :} اس سورت کا اصل موضوع توحید و نبوت اور حشر کے واقعات بیان کرنا ہے۔ توحید کے منکر دو قسم کے لوگ تھے، ایک یہود و نصاریٰ جنھوں نے عیسیٰ اور عُزیر علیھما السلام کو اللہ کا بیٹا قرار دے لیا اور اس طرح شرک میں مبتلا ہو گئے، چنانچہ پچھلی آیات میں مریم اور مسیح علیھما السلام کا قصہ بیان کرکے ان کے غلط عقائد کی تردید فرمائی۔ دوسرے مشرکین عرب، جو بت پرستی میں مبتلا تھے اور اس غلط عقیدے کے باوجود ابراہیم علیہ السلام کے دین پر قائم ہونے کے دعوے دار تھے۔ یہاں سے ابراہیم علیہ السلام کا قصہ بیان کرکے ان کی تردید مقصود ہے، تاکہ معلوم ہو کہ کس طرح ابراہیم علیہ السلام نے اپنے باپ اور قوم کو بت پرستی سے نکالنے کی کوشش کی اور بالآخر وطن اور رشتہ داروں کو چھوڑ کر اللہ کی راہ میں ہجرت کی، مگر تم ہو کہ ایک طرف تو ان کی اولاد میں سے ہو اور ان کے دین پر ہونے کا دعویٰ بھی کرتے ہو، لیکن دوسری طرف بت پرستی کی لعنت میں گرفتار ہو اور توحید کی آواز اٹھانے والوں کو وطن سے نکل جانے پر مجبور کر رہے ہو۔ اگر واقعی تم ابراہیم علیہ السلام کے دین کے پیرو ہو تو اس شرک پر عمل پیرا ہونے اور توحید پرستوں سے دشمنی کا کیا مطلب؟ ¤ ➋ {اِنَّهٗ كَانَ صِدِّيْقًا نَّبِيًّا: ’’ صِدِّيْقًا ‘‘ ’’صِدْقٌ‘‘} سے مبالغہ ہے۔ ابراہیم علیہ السلام کو صدیق اس لیے فرمایا کہ وہ بات میں بہت سچے تھے اور اپنے رب کے ساتھ معاملے میں بھی سچے تھے۔ اللہ کی خاطر گھر سے بے گھر ہونا، آگ میں جلنے کو گوارا کرنا، وطن سے بے وطن ہونا، پردیس میں اپنی عزت و ناموس کے خطرے میں ہونے کو برداشت کرنا، بیوی بچے کو بے آباد سنگلاخ وادی میں چھوڑنا، اکلوتے بیٹے کو ذبح کرنے کے حکم کی تعمیل، اسّی(۸۰) برس کی عمر میں ختنے کا حکم ہونے پر فوراً عمل کرنا، یہ ان کے ہر معاملہ میں صدق کی چند مثالیں ہیں۔ {’’ صِدِّيْقًا ‘‘} کی مزید تفسیر کے لیے دیکھیے سورۂ نساء (۶۹) اور یوسف (۴۶)۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ {’’ يٰۤاَبَتِ ‘‘} کے معنی کے لیے دیکھیے سورۂ یوسف (۴)۔ ¤ ➋ { اِذْ قَالَ لِاَبِيْهِ يٰۤاَبَتِ لِمَ تَعْبُدُ …:} اس سے معلوم ہوا کہ ابراہیم علیہ السلام کا والد بت پرست تھا۔ مزید دیکھیے سورۂ انعام(۷۴) ابراہیم علیہ السلام نے اسے نہایت ادب، نرمی، حسن اخلاق اور بہترین دلائل کے ساتھ بت پرستی ترک کرنے کی نصیحت کی کہ کہیں وہ بڑے پن اور ضد میں آکر حق سے انکار نہ کر دے۔ چنانچہ سب سے پہلے انھوں نے اس سے ان بتوں کو پوجنے کی وجہ پوچھی کہ جن کی کسی عقل مند کے نزدیک کوئی وقعت ہی نہیں، خواہ وہ عالم ہو یا جاہل، کجا یہ کہ ان کی عبادت کی جائے، جو تعظیم، محبت اور عاجزی کا انتہائی مرتبہ ہے۔ کیونکہ عبادت تو اس کی ہونی چاہیے جو ہر طرح سے دوسروں سے غنی ہو، کسی کا محتاج نہ ہو، سب نعمتوں کا مالک ہو، سب کو پیدا کرنے والا، رزق دینے والا ہو، زندگی، موت، ثواب اور عذاب کا مالک ہو۔ ابراہیم علیہ السلام نے اسے توجہ دلائی کہ صاحب عقل کو لازم ہے کہ جو بھی کرے کسی صحیح مقصد کے لیے کرے۔ کوئی بھی چیز یا شخص جو زندہ ہو، صاحب عقل ہو، سنتا دیکھتا ہو، کوئی فائدہ یا نقصان بھی پہنچا سکتا ہو مگر عدم سے وجود میں آیا ہو اور اس کا اختیار کسی اور کا عطا کردہ ہو تو عقل سلیم اس کی عبادت میں عار محسوس کرے گی، خواہ وہ کتنی اونچی مخلوق مثلاً انسان ہو یا فرشتہ، کیونکہ وہ خود اپنی ضروریات کے لیے اس ہستی کا محتاج ہے جو نہ اپنے وجود میں کسی کی محتاج ہے اور نہ اپنی بقا میں۔ پھر پتھر، لکڑی یا دھات کے بنے ہوئے بت یا مٹی اور اینٹوں سے بنی ہوئی قبریں کہ جن میں زندہ لوگوں والی کوئی خوبی ہے ہی نہیں، جو نہ سنیں اور نہ دیکھیں، نہ کسی کے کام آ سکیں، ان کی عبادت کیوں؟"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ {يٰۤاَبَتِ اِنِّيْ قَدْ جَآءَنِيْ مِنَ الْعِلْمِ …: ’’ مِنَ الْعِلْمِ ‘‘} میں {’’ مِنْ ‘‘} تبعیض کے لیے ہے، یعنی کچھ علم۔ دوسری بات میں بھی ان کی نرمی، دانائی اور حسن ادب دیکھیے۔ ’’ابا جی‘‘ کے لقب کے ساتھ مخاطب کیا، یہ نہیں کہا کہ آپ حد درجہ کے جاہل ہیں اور مجھے اللہ تعالیٰ نے صدیقیت اور نبوت کا عظیم مرتبہ عطا کیا ہے، بلکہ یہ کہا کہ میرے پاس کچھ علم آیا ہے جو آپ کے پاس نہیں آیا اور وہ ہے سیدھے راستے کا علم، اس لیے اس میں میرے پیچھے چلنے میں عار محسوس نہ کریں۔ بے شک آپ باپ ہیں مگر یوں سمجھیں کہ میں اور آپ ایک سفر پر ہیں، مجھے راستے کا علم ہے اور آپ کو نہیں، تو آپ کو باپ ہونے کے باوجود میرے پیچھے چلنا ہو گا، تاکہ میں آپ کو صحیح منزل تک پہنچا دوں اور آپ غلط راستے پر چل کر بھٹکتے نہ پھریں۔ (زمحشری) ¤ ➋ {اَهْدِكَ صِرَاطًا سَوِيًّا : ’’ سَوِيًّا ‘‘ ’’سَوِيَ يَسْوٰي‘‘} (ع) سے {’’فَعِيْلٌ‘‘} کے وزن پر صفت کا صیغہ ہے، سیدھا برابر راستہ جس میں نہ زیادتی ہے کہ اس کی عبادت ہو جو اس کا حق دار نہیں اور نہ کمی کہ حق دار کی عبادت بھی نہ کی جائے۔ (قاسمی)"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) { يٰۤاَبَتِ لَا تَعْبُدِ الشَّيْطٰنَ … :} تیسری بات کی ابتدا بھی محبت اور ادب میں ڈوبے ہوئے الفاظ ’’ابا جان‘‘ سے کی اور اسے بت پرستی سے منع کرنے اور ہٹانے کے لیے اس کی حقیقی تصویر ایسی کھینچی کہ ہر عقلمند کو اس سے نفرت ہو جائے، یعنی یہی نہیں کہ بت پرستی کسی بھی نفع سے خالی ہے، بلکہ اس میں بے حد نقصان ہے، کیونکہ یہ درحقیقت شیطان کی عبادت ہے۔ دیکھیے سورۂ نساء (۱۱۷) کیونکہ وہی اس پر آمادہ کرتا اور اسے خوش نما بنا کر دکھاتا ہے، خود شیطان کی عبادت تو کوئی نہیں کرتا۔ {’’ اِنَّ الشَّيْطٰنَ كَانَ لِلرَّحْمٰنِ عَصِيًّا ‘‘} میں {’’ اِنَّ ‘‘} کے ساتھ شیطان کی عبادت سے منع کرنے کی وجہ بیان فرمائی، جو یہ ہے کہ شیطان ہمیشہ سے تمھارے اس رب کا سخت نافرمان ہے جس کی رحمت کی کوئی حد نہیں۔ ظاہر ہے کہ ایسے ناشکرے اور سخت نافرمان کی بات ماننے والا بھی سخت نافرمان ہو گا۔ ہمیشہ کا معنی {’’ كَانَ ‘‘} سے واضح ہو رہا ہے۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) { يٰۤاَبَتِ اِنِّيْۤ اَخَافُ … :} چوتھی بات یہ کہ اسے بت پرستی کے برے انجام اور اس کے وبال اور عذاب سے ڈرایا اور اس میں بھی حسن ادب کو ملحوظ رکھا۔ صاف الفاظ میں یہ نہیں کہا کہ تم پر عذاب آ پڑے گا، بلکہ فرمایا کہ میں ڈرتا ہوں کہ تجھے رحمان کی طرف سے کوئی عذاب آ لگے اور پھر تو شیطان کا ساتھی بن جائے۔ یہاں ’’میں ڈرتا ہوں‘‘ اور ’’کوئی عذاب آ لگے‘‘ کے الفاظ قابل غور ہیں کہ وہ کتنی سخت بات کو کس قدر نرمی کے ساتھ بیان کر رہے ہیں۔ پھر یہ بات کہ عذاب کا نتیجہ شیطان کا دوست اور ساتھی بننا ہو گا۔ معلوم ہوا کہ شیطان کا ساتھی بننا عذاب سے بھی بدتر ہے۔ یہ آخری نصیحت بھی {’’ يٰۤاَبَتِ ‘‘} کے پیارے الفاظ سے شروع ہوتی ہے۔ (زمخشری)"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ {قَالَ اَرَاغِبٌ اَنْتَ عَنْ اٰلِهَتِيْ يٰۤاِبْرٰهِيْمُ : ’’ رَغِبَ فِيْهِ ‘‘} کا معنی رغبت کرنا اور {’’ رَغِبَ عَنْهُ ‘‘} کا معنی بے رغبتی کرنا ہوتا ہے۔ والد نے جواب میں بیٹے کی بات کا انکار کرتے ہوئے ہمزہ استفہام سے بات شروع کی کہ ’’کیا بے رغبتی کرنے والا ہے تو میرے معبودوں سے اے ابراہیم!؟‘‘ اس سے ظاہر ہوتا ہے کہ اس کے نزدیک بتوں سے بے رغبتی زیادہ قابل گرفت تھی، اس لیے {’’ اَرَاغِبٌ ‘‘} کا ذکر خبر ہونے کے باوجود پہلے کیا، رہا ببیٹا تو شرک سے منع کرنے کی وجہ سے اسے {’’ اَنْتَ ‘‘ } کے ساتھ مبتدا ہونے کے باوجود بعدمیں مخاطب کیا اور ابراہیم کا نام ایسا قابل نفرت ٹھہرا کہ اسے سب سے آخر میں لیا۔ ابراہیم علیہ السلام کو دیکھیے کہ وہ ہر بات {’’ يٰۤاَبَتِ ‘‘} سے شروع کرتے ہیں، ادھر مشرک باپ کی خصوصی مہربانی دیکھیے کہ اس نے مخاطب کیا بھی تو آخر میں۔ اس سے معلوم ہوا کہ عقیدے کی بنا پر پیدا ہونے والی دوستی اور دشمنی نسب کی وجہ سے پیدا ہونے والی دوستی اور دشمنی سے زیادہ قوی ہوتی ہے۔ ¤ ➋ { لَىِٕنْ لَّمْ تَنْتَهِ لَاَرْجُمَنَّكَ … :’’ تَنْتَهِ ‘‘} اصل میں {’’تَنْتَهِيْ‘‘} تھا، {’’ لَمْ ‘‘} کی وجہ سے یاء گر گئی۔ {’’ مَلِيًّا ‘‘} کا معنی ہے صحیح سالم اور ایک دوسرا معنی ہے لمبی مدت۔ اگر تو بتوں کی تردید اور نفرت سے باز نہ آیا تو میں تجھے سنگسار کر دوں گا، یعنی پتھر مار مار کر ختم کر دوں گا۔ تو مجھے چھوڑ کر صحیح سلامت نکل جا، ایسا نہ ہو کہ مجھ سے اپنی ہڈیاں تڑوا بیٹھے۔ دوسرا معنی یہ ہے کہ لمبی مدت تک مجھے چھوڑ کر نکل جا کہ میں تمھاری شکل نہ دیکھوں۔ ¤ ➌ اس واقعہ میں ہمارے نبی کریم صلی اللہ علیہ وسلم کے لیے تسلی کا سامان موجود ہے، کیونکہ آپ کو بھی اپنے اقارب کی طرف سے ایسے ہی سلوک کا سامنا کرنا پڑا۔ اسی طرح حق کے ہر داعی کے لیے بھی تسلی ہے کہ اعلان حق پر اسے اپنے قریب ترین عزیزوں کی طرف سے شدید مخالفت کے سامنے کے لیے تیار رہنا ہو گا۔ خصوصاً جب کفار دلیل کے سامنے لاجواب ہو جاتے ہیں تو پھر ان کا غیظ و غضب حد سے گزر جاتا ہے، جیسے یہاں ابراہیم علیہ السلام سے لاجواب ہو کر باپ نے سنگسار کرنے کی دھمکی دے کر گھر سے نکال دیا۔ بتوں کو توڑنے کے بعد ان کے پروہت لاجواب ہوئے تو انھوں نے کہا : «{ حَرِّقُوْهُ وَ انْصُرُوْۤا اٰلِهَتَكُمْ }» [ الأنبیاء : ۶۸ ] ’’اسے جلا دو اور اپنے معبودوں کی مدد کرو۔‘‘ لوط علیہ السلام کی قوم لاجواب ہوئی تو کہا : «{ اَخْرِجُوْهُمْ مِّنْ قَرْيَتِكُمْ }» [ الأعراف : ۸۲ ] ’’انھیں اپنی بستی سے نکال دو۔‘‘ نوح علیہ السلام کی قوم نے لاجواب ہو کر کہا : «{ لَىِٕنْ لَّمْ تَنْتَهِ يٰنُوْحُ لَتَكُوْنَنَّ مِنَ الْمَرْجُوْمِيْنَ }» [ الشعراء : ۱۱۶ ] ’’اے نوح! یقینا اگر تو باز نہ آیا تو ہر صورت سنگسار کیے گئے لوگوں میں سے ہو جائے گا۔‘‘ فرعون نے موسیٰ علیہ السلام کے دلائل کے سامنے بے بس ہونے پر کہا تھا : «{ لَىِٕنِ اتَّخَذْتَ اِلٰهًا غَيْرِيْ لَاَجْعَلَنَّكَ مِنَ الْمَسْجُوْنِيْنَ }» [الشعراء : ۲۹ ] ’’یقینا اگر تو نے میرے سوا کسی اور کو معبود بنایا تو میں تجھے ضرور ہی قید کیے ہوئے لوگوں میں شامل کر دوں گا۔‘‘ کفار کی ان تمام دھمکیوں سے پہلے اللہ تعالیٰ نے انبیاء علیھم السلام کے دلائل ذکر فرمائے ہیں جو قابل دید ہیں اور ان کے جواب میں کفار کی بے بسی بالکل واضح ہے۔ ہمارے پیارے پیغمبر کے سامنے بھی جب کفار کی کوئی پیش نہ گئی تو انھوں نے آپ کو قتل، قید یا جلا وطن کرنے کی سازش کی، جس کے بارے میں اللہ تعالیٰ ارشاد فرماتے ہیں : «{ وَ اِذْ يَمْكُرُ بِكَ الَّذِيْنَ كَفَرُوْا لِيُثْبِتُوْكَ اَوْ يَقْتُلُوْكَ اَوْ يُخْرِجُوْكَ }» [ الأنفال : ۳۰ ] ’’اور جب وہ لوگ جنھوں نے کفر کیا، تیرے خلاف خفیہ تدبیریں کر رہے تھے، تاکہ تجھے قید کر دیں، یا تجھے قتل کر دیں، یا تجھے نکال دیں۔‘‘"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {قَالَ سَلٰمٌ عَلَيْكَ :} ابراہیم علیہ السلام نے اپنے جاہل باپ کے اس سنگ دلانہ جواب کے مقابلے میں پھر انتہائی نرمی کا مظاہرہ کیا اور اسے {’’ سَلٰمٌ عَلَيْكَ ‘‘} کہا کہ آپ سلامت رہیں۔ جاہلوں کے جواب میں ہمیں بھی یہی کہنے کی تعلیم دی گئی ہے۔ دیکھیے سورۂ فرقان (۶۳) اور قصص (۵۵) جب کوئی ضد اور عناد پر تل جائے تو یہ رخصت ہونے اور ترک تعلق کا سلام ہے اور یہ جائز ہے، البتہ عام حالات میں کفار کو سلام میں پہل جائز نہیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا تَبْدَءُ وا الْيَهُوْدَ وَلاَ النَّصَارٰی بِالسَّلَامِ ] [ مسلم، السلام، باب النھي عن ابتداء أھل الکتاب… : ۲۱۶۷، عن أبي ھریرۃ رضی اللہ عنہ ] ’’یہود و نصاریٰ کو سلام میں پہل مت کرو۔‘‘ ¤ ➋ { سَاَسْتَغْفِرُ لَكَ رَبِّيْ :} ابراہیم علیہ السلام نے اس وعدے کو نبھایا، دیکھیے سورۂ شعراء (۸۶) اور ابراہیم (۴۱) مگر اب فوت شدہ مشرک دوستوں یا رشتہ داروں کے لیے استغفار جائز نہیں۔ تفصیل کے لیے دیکھیے سورۂ توبہ(۱۱۳) اور سورۂ ممتحنہ(۴)۔ ¤ ➌ {اِنَّهٗ كَانَ بِيْ حَفِيًّا : ’’ حَفِيًّا ‘‘ ’’حَفِيَ حِفَاوَةً‘‘} ({رَضِيَ} ) سے ہے، کسی پر بہت مہربان ہونا، اس کے معاملات کی فکر رکھنا، اس کے متعلق کثرت سے پوچھتے رہنا۔ مزید دیکھیے سورۂ اعراف (۱۸۷) {’’ كَانَ ‘‘} سے ہمیشہ کا معنی واضح ہوتا ہے، یعنی اللہ تعالیٰ ہمیشہ سے مجھ پر بہت مہربان رہا ہے اور اس نے مجھے دعا قبول ہونے کی عادت ڈال دی ہے۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ {وَ اَعْتَزِلُكُمْ وَ مَا تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ … :} یعنی تم سے اور تمھارے معبودوں سے تعلق توڑ کر جب میں اپنے اکیلے رب کو پکاروں گا تو مجھے امید ہے کہ میں اپنے رب کو پکارنے میں بے نصیب نہیں رہوں گا اور وہ کسی بھی مرحلے پر مجھے بے یارو مددگار نہیں چھوڑے گا۔ اشارے سے یہ بھی کہہ دیا کہ میرا رب تمھارے بتوں کی طرح نہیں ہے کہ انھیں کتنا ہی پکارتے رہو، وہ خاک نفع نہیں پہنچا سکتے۔ ساتھ ہی اللہ تعالیٰ کے سامنے اپنی عاجزی کا اظہار بھی کہ اس پر میرا یا کسی کا زور نہیں، محض اس کے فضل سے امید ہے، کیونکہ اس اکیلے کو پکارنے والا کبھی بے نصیب نہیں رہتا۔ ¤ ➋ ابراہیم علیہ السلام کی کفار سے اور ان کے بتوں سے علیحدگی اور ایمان لانے تک واضح دشمنی کا ذکر قرآن میں کئی جگہ ہے۔ دیکھیے سورۂ انبیاء (۵۱ تا ۶۷ )، سورۂ شعراء (۷۵ تا ۷۷) اور سورۂ ممتحنہ (۴)۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { فَلَمَّا اعْتَزَلَهُمْ وَ مَا يَعْبُدُوْنَ … :} وطن سے ہجرت اور مشرکین سے کنارہ کشی کے عوض اللہ تعالیٰ نے انھیں جو بے شمار نعمتیں عطا کیں ان میں سے ایک یہ تھی کہ انھیں بڑی شان والا بیٹا اور پوتا یعنی اسحاق اور یعقوب ( علیھما السلام ) عطا کیے، تاکہ ان کا دل لگ جائے اور بے وطنی سے وحشت نہ ہو۔ ¤ ➋ { وَ كُلًّا جَعَلْنَا نَبِيًّا :} یہ آیت دلیل ہے کہ اسحاق اور یعقوب علیھما السلام ان کی زندگی ہی میں نبی بن چکے تھے، کیونکہ اگر بعد میں نبی بننا مراد ہوتا تو یوسف علیہ السلام کا بھی ذکر ہوتا، کیونکہ وہ بھی نبی تھے۔ بیٹے اور پوتے کی خوشی ہی کچھ کم نہیں ہوتی، کجا یہ کہ ان کی پہلے ہی خوش خبری بھی مل جائے (ہود : ۷۱) اور اپنی آنکھوں سے انھیں نبوت کے عالی مقام پر فائز بھی دیکھ لیا جائے۔ یہاں اسماعیل علیہ السلام کا ذکر نہیں فرمایا، کیونکہ وہ ان کے پاس نہیں رہے۔ ان کا ذکر الگ آگے آ رہا ہے۔ ¤ ➌ یہ آیت اس حقیقت کی بھی ایک مثال ہے کہ جو شخص اللہ کی خاطر کوئی چیز چھوڑ دے تو اللہ تعالیٰ اس سے کہیں بہتر چیز اسے عطا فرماتا ہے۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ { وَ وَهَبْنَا لَهُمْ مِّنْ رَّحْمَتِنَا : ’’ مِنْ ‘‘} تبعیض کے لیے ہے، اس لیے ترجمہ ’’حصہ‘‘ کیا ہے۔ اس رحمت سے مراد نبوت اور دینی و دنیوی بے شمار برکتیں ہیں، مثلاً اموال و اولاد کی کثرت، ارض مقدس کی خلافت، نسل در نسل نبوت و امامت وغیرہ۔ ¤ ➋ { وَ جَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ عَلِيًّا :} ابن عباس رضی اللہ عنھما نے اس کی تفسیر {’’ثَنَاءٌ حَسَنٌ‘‘} (اچھی شہرت) فرمائی۔ [ طبری بسند ثابت ] {’’ لِسَانَ ‘‘} بول کر وہ چیز مراد لی ہے جو زبان کے ساتھ ہوتی ہے، یعنی شہرت و ناموری، جیسا کہ {’’يَدٌ‘‘ } بول کر احسان مراد لیتے ہیں، کیونکہ وہ ہاتھ کے ساتھ ہوتا ہے۔ {’’ لِسَانَ صِدْقٍ ‘‘} سچی ناموری کا مطلب یہ ہے کہ وہ واقعی اس ناموری اور شہرت کے حق دار تھے اور ان کا عمل اس شہرت کو سچا ثابت کرتا تھا، اس لیے ان کا ذکر خیر ہمیشہ کے لیے لوگوں کی زبان پر جاری کر دیا۔ چنانچہ یہودی، عیسائی اور مسلمان سب ان کی تعظیم کرتے ہیں اور نماز میں درود ابراہیمی بھی ابراہیم علیہ السلام کی دعا کی مقبولیت ہی کا ثمر ہے۔ دیکھیے سورۂ شعراء (۸۴)۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ {وَ اذْكُرْ فِي الْكِتٰبِ مُوْسٰۤى اِنَّهٗ كَانَ مُخْلَصًا: ’’ مُخْلَصًا ‘‘} کا معنی ہے ’’خالص کیا ہوا، چنا ہوا۔‘‘ اس کی تائید اللہ تعالیٰ کے فرمان : «{ وَ اصْطَنَعْتُكَ لِنَفْسِيْ }» [ طٰہٰ : ۴۱ ] (اور میں نے تجھے خاص طور پر اپنے لیے بنایا ہے)، طٰہٰ کی آیت (۱۳) اور اعراف کی آیت (۱۴۴) سے ہوتی ہے۔ ¤ ➋ {وَ كَانَ رَسُوْلًا نَّبِيًّا: ’’ رَسُوْلًا ‘‘} کا لفظی معنی بھیجا ہوا ہے اور {’’ نَبِيًّا ‘‘ ’’ نَبَأٌ ‘‘} سے {’’ فَعِيْلٌ ‘‘} کے وزن پر ہے جو فاعل اور مفعول دونوں معنوں میں آتا ہے۔ مفعول ہو تو وہ جسے اللہ کی طرف سے خبر دی جائے اور اگر فاعل ہو تو وہ جو اللہ کی طرف سے خبر دینے والا ہو۔ {’’ نَبَأٌ ‘‘} عام خبر کو نہیں بلکہ اس خبر کو کہتے ہیں جو بڑی عجیب یا اہم ہو۔ قرآن مجید میں یہ دونوں لفظ عموماً ایک دوسرے کی جگہ استعمال ہوئے ہیں، تاہم بعض مقامات ایسے ہیں جن سے دونوں کے مرتبہ یا کام کی نوعیت کے اعتبار سے کافی فرق پایا جاتا ہے۔ دیکھیے سورۂ حج (۵۲) شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’جس کو اللہ تعالیٰ کی وحی آئی وہ نبی، ان میں سے جو خاص ہیں اور امت رکھتے ہیں یا کتاب وہ رسول ہیں۔‘‘ (موضح) ¤ ➌ یہاں {’’ رَسُوْلًا ‘‘} کے بعد {’’ نَبِيًّا ‘‘} لانے کی ایک حکمت یہ بھی ہو سکتی ہے کہ پیغام پہنچانے کے لیے کوئی بھی بھیجا جائے اسے رسول کہا جاتا ہے۔ اللہ تعالیٰ بھیجے تو اس کا رسول، کوئی اور بھیجے تو اس کا رسول۔ جیسا کہ بعض مفسرین کے قول کے مطابق سورۂ یس میں مذکور مرسلین کسی نبی کی طرف سے بھیجے ہوئے داعی تھے اور جیسا کہ یزید بن شیبان رضی اللہ عنہ فرماتے ہیں کہ ہم عرفات میں ایک جگہ وقوف کیے ہوئے تھے (ان کے شاگرد عمرو بن عبد اللہ وہ جگہ امام کی جگہ سے دور بیان کرتے تھے) تو ہمارے پاس ابن مربع انصاری آئے اور انھوں نے کہا : [ إِنِّيْ رَسُوْلُ رَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ إِلَيْكُمْ ] [ أبوداوٗد، المناسک، باب موضع الوقوف بعرفۃ : ۱۹۱۹۔ ابن ماجہ : ۳۰۱۱ و صححہ الألباني ] ’’میں تمھاری طرف رسول اللہ صلی اللہ علیہ وسلم کا رسول یعنی پیغام لانے والا ہوں۔‘‘ اس آیت میں {’’ رَسُوْلًا ‘‘} کی تاکید {’’ نَبِيًّا ‘‘} کے ساتھ اس لیے فرمائی کہ موسیٰ علیہ السلام کو کسی کی طرف سے بھیجا ہوا محض ایک داعی نہ سمجھا جائے، بلکہ وہ نبی بھی تھے جو وحی الٰہی سے سرفراز تھے۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ {وَ نَادَيْنٰهُ مِنْ جَانِبِ الطُّوْرِ … :} طور کا معنی پہاڑ ہے، بعض خاص پہاڑوں کا نام بھی طور ہے، جیسے ایلہ کے قریب صحرائے سینا کے ایک پہاڑ کو طورِ سینا یا طور سینین کہتے ہیں۔ صاحب قاموس نے چند اور مقامات پر واقع پہاڑوں کا بھی ذکر کیا ہے جنھیں طور کہا جاتا ہے۔ یہ واقعہ موسیٰ علیہ السلام کے مدین سے واپس مصر جاتے ہوئے پیش آیا۔ اس کی تفصیل سورۂ طٰہٰ (۹تا۳۶)، نمل (۷ تا ۱۴) اور قصص (۲۹ تا ۳۵) میں موجود ہے۔ ابن کثیر نے سورۂ قصص کی آیت (۳۰) «{ نُوْدِيَ مِنْ شَاطِئِ الْوَادِ الْاَيْمَنِ }» کی تفسیر میں فرمایا : ’’یعنی وادی کی اس جانب سے جو موسیٰ علیہ السلام کے دائیں طرف پہاڑ کے مغربی کنارے سے ملتی تھی، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ وَ مَا كُنْتَ بِجَانِبِ الْغَرْبِيِّ اِذْ قَضَيْنَاۤ اِلٰى مُوْسَى الْاَمْرَ }» [ القصص : ۴۴ ] ’’اور اس وقت تو مغربی جانب نہیں تھا جب ہم نے موسیٰ کی طرف حکم کی وحی کی۔‘‘ اس سے معلوم ہوتا ہے کہ موسیٰ علیہ السلام نے آگ کی طرف رخ قبلہ کی جانب کیا تھا اور انھوں نے پہاڑ کے مغربی حصے کو اپنی دائیں طرف کیا ہوا تھا۔‘‘ آلوسی نے فرمایا : {’’ مِنْ جَانِبِ الطُّوْرِ الْاَيْمَنِ ‘‘} سے مراد پہاڑ کی وہ جانب ہے جو موسیٰ علیہ السلام کی دائیں جانب تھی، کیوں کہ خود پہاڑ کا کوئی دایاں ہوتا ہے نہ بایاں۔ {’’ الْاَيْمَنِ ‘‘ ’’ يُمْنٌ ‘‘} سے بھی ہو سکتا ہے جس کا معنی برکت ہے، یعنی اس کی مبارک جانب سے، اس معنی کے لحاظ سے پہاڑ کی مبارک جانب بھی مراد ہو سکتی ہے، مگر پہلا معنی بہتر ہے۔ {’’ نَادَيْنٰهُ ‘‘} (ہم نے اسے آواز دی) آواز دینے سے مراد اس جانب سے اللہ کا کلام ظاہر ہونا ہے۔ ظاہر ہے کہ موسیٰ علیہ السلام نے اللہ تعالیٰ کا کلام الفاظ کی صورت میں سنا۔ بعض لوگوں کا کہنا ہے کہ موسیٰ علیہ السلام نے جو سنا تھا اس میں نہ حرف تھے، نہ آواز تھی۔ انھوں نے صرف کانوں سے نہیں بلکہ تمام اعضاء کے ساتھ سنا تھا، جس سے انھیں یقین ہو گیا کہ یہ اللہ کا کلام ہے، اسی لیے کہا گیا ہے کہ مراد یہ ہے کہ ہم نے اسے طور کی مبارک جانب سے آتے ہوئے آواز دی، مگر یہ بات عقل کی دسترس سے باہر ہے اور احادیث کے دلائل اس کے صاف خلاف ہیں۔ اس آیت سے اللہ تعالیٰ کا آواز دینا اور کلام کرنا ثابت ہوتا ہے۔ اللہ تعالیٰ کی صفات کے منکر اس کے کلام کے بھی منکر ہیں، اس لیے وہ نہ اس میں حروف مانتے ہیں، نہ آواز اور نہ اس کا کانوں سے سنا جانا۔ مگر الفاظ اور آواز سے خالی چیز کو کلام کہنا جس طرح عقل سے بعید ہے اسی طرح قرآن و حدیث کے بھی صریح خلاف ہے۔ مزید تفصیل کے لیے دیکھیے سورۂ اعراف (۱۴۳)، کہف (۱۰۹) اور توبہ (۶)۔ ¤ ➋ {وَ قَرَّبْنٰهُ نَجِيًّا : ’’ نَجِيًّا ‘‘ ’’فَعِيْلٌ‘‘} بمعنی {’’مُفَاعِلٌ‘‘} ہے، جیسے {’’جَلِيْسٌ‘‘} بمعنی {’’مُجَالِسٌ‘‘} اور {’’نَدِيْمٌ‘‘} بمعنی {’’مُنَادِمٌ‘‘} ہے۔ {’’مُنَاجَاةٌ‘‘} ایک دوسرے سے چھپی آواز میں بات کرنا، سرگوشی کرنا، یعنی ہم نے اسے سرگوشی کرتے ہوئے قریب کر لیا۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ان سے کلام ہوا، بیچ میں فرشتہ نہ تھا۔‘‘ (موضح) اللہ تعالیٰ نے جس طرح واضح الفاظ میں موسیٰ علیہ السلام سے خود کلام کرنے کا ذکر فرمایا ہے کسی اور کو یہ اعزاز حاصل نہیں ہوا۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) { هٰرُوْنَ نَبِيًّا :} موسیٰ علیہ السلام کو نبوت عطا ہوئی تو انھوں نے اپنی مدد کے لیے اپنے بھائی ہارون علیہ السلام کو بھی نبوت عطا کرنے کی درخواست کی۔ اللہ تعالیٰ نے اسے قبول فرمایا اور اپنی خاص رحمت سے ان کے بھائی کو نبی بنا کر انھیں ہبہ فرما دیا۔ آج تک موسیٰ علیہ السلام کے سوا کسی بھائی نے اپنے بھائی کے لیے اتنے اونچے مرتبے کی دعا نہیں کی اور نہ ہارون علیہ السلام کے سوا کسی کو سفارش سے یہ مقام حاصل ہوا ہے۔ موسیٰ علیہ السلام کی اس درخواست کا ذکر سورۂ طہ (۲۹ تا ۳۵)، شعراء (۱۲، ۱۳)اور قصص (۳۴، ۳۵) میں ہے۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ {وَ اذْكُرْ فِي الْكِتٰبِ اِسْمٰعِيْلَ … :} یہ پانچواں قصہ اسماعیل علیہ السلام کا ہے جو ابراہیم علیہ السلام کے بیٹے تھے اور تمام حجاز کے باپ۔ (ابن کثیر) گو تمام انبیاء وعدے کے سچے ہوتے ہیں مگر اسماعیل علیہ السلام میں یہ صفت خاص طور پر پائی جاتی تھی۔ سب سے پہلے تو ان میں یہ وصف تھا کہ وہ وعدے کے ساتھ ’’ان شاء اللہ‘‘ کہہ لیا کرتے تھے، جیسا کہ انھوں نے والد سے وعدہ کرتے وقت کہا تھا : «{ سَتَجِدُنِيْۤ اِنْ شَآءَ اللّٰهُ مِنَ الصّٰبِرِيْنَ }» [ الصافات : ۱۰۲ ] ’’اگر اللہ نے چاہا تو تُو ضرور مجھے صبر کرنے والوں میں سے پائے گا۔‘‘ پھر یہ وعدے کی سچائی ہی تھی کہ انھوں نے اپنے والد سے وعدہ کیا کہ ذبح ہوتے وقت صبر کروں گا، پھر بے دھڑک چھری کے نیچے لیٹ گئے اور اف تک نہ کیا۔ اس سے بڑھ کر وعدہ وفائی کیا ہو گی؟ وعدہ پورا کرنا ایمان ہے اور وعدہ خلافی نفاق۔ ابوسفیان نے ہرقل کے پاس اقرار کیا تھا : [ يَأْمُرُنَا بِالصَّلَاةِ وَالصَّدَقَةِ وَالْعَفَافِ وَالْوَفَاءِ بِالْعَهْدِ وَأَدَاءِ الْأَمَانَةِ ] [ بخاري، الجھاد والیسر، باب دعاء النبي صلی اللہ علیہ وسلم إلی الإسلام… : ۲۹۴۱ ]کہ نبی( صلی اللہ علیہ وسلم ) ہمیں نماز، سچ، پاک دامنی، وعدہ پورا کرنے اور امانت ادا کرنے کا حکم دیتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے وعدہ خلافی کو منافق کی تین نشانیوں میں سے ایک قرار دیا۔ [ بخاری، الإیمان، باب علامات المنافق : ۳۳، عن أبي ھریرۃ رضی اللہ عنہ ] ¤ ➋ یہاں طبری اور ابن کثیر نے سہل بن عقیل سے نقل کیا ہے کہ اسماعیل علیہ السلام نے ایک آدمی سے ا س کے آنے تک ایک جگہ میں رہنے کا وعدہ کیا، وہ بھول گیا تو ایک دن رات اس کے آنے تک وہیں ٹھہرے رہے، اس لیے اللہ تعالیٰ نے فرمایا : «{ اِنَّهٗ كَانَ صَادِقَ الْوَعْدِ }» اور سفیان ثوری سے نقل کیا ہے کہ مجھے خبر پہنچی ہے کہ ایک سال وہیں ٹھہرے رہے۔ مگر یہ دونوں روایات بعض علماء کے اقوال ہیں، رسول اللہ صلی اللہ علیہ وسلم نے ہر گز بیان نہیں فرمائیں۔ ظاہر ہے ان دونوں بزرگوں نے یہ روایات بنی اسرائیل سے لی ہیں اور ہم اہل کتاب کی کسی بات کو سچا کہہ سکتے ہیں نہ جھوٹا۔ ¤ ➌ سنن ابی داؤد وغیرہ میں اسی طرح کا واقعہ ہمارے نبی صلی اللہ علیہ وسلم کے متعلق بھی مروی ہے کہ نبوت سے پہلے ایک آدمی کے آنے تک ٹھہرنے کے وعدے کی وجہ سے آپ صلی اللہ علیہ وسلم تین دن رات وہیں ٹھہرے رہے، مگر شیخ البانی رحمہ اللہ نے اسے ضعیف قرار دیا ہے۔ ¤ ➍ { وَ كَانَ رَسُوْلًا نَّبِيًّا :} اللہ تعالیٰ نے اسحاق اور یعقوب علیھما السلام کو صرف نبی (مریم : ۴۹) اور اسماعیل علیہ السلام کو {’’رَسُوْلًا نَّبِيًّا ‘‘ } فرمایا، اس سے ان کے بلند مرتبے کا اظہار ہوتا ہے۔ اسماعیل علیہ السلام بنو جرہم کی طرف رسول تھے، جن کے وہ داماد بھی تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ اصْطَفی مِنْ وَلَدِ إِبْرَاهِيْمَ إِسْمَاعِيْلَ ] [ ترمذي، المناقب عن رسول اللّٰہ صلی اللہ علیہ وسلم ، باب ما جاء في فضل النبي صلی اللہ علیہ وسلم : ۳۶۰۵ ]’’اللہ تعالیٰ نے ابراہیم علیہ السلام کی اولاد میں سے اسماعیل علیہ السلام کو منتخب فرمایا۔‘‘"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) ➊ {وَ كَانَ يَاْمُرُ اَهْلَهٗ بِالصَّلٰوةِ وَ الزَّكٰوةِ :} اسماعیل علیہ السلام کے اس عمل کی پابندی کا حکم ہمارے نبی صلی اللہ علیہ وسلم کو اور ان کے ذریعے سے ہمیں بھی دیا گیا، چنانچہ فرمایا : «{ وَ اْمُرْ اَهْلَكَ بِالصَّلٰوةِ وَ اصْطَبِرْ عَلَيْهَا لَا نَسْـَٔلُكَ رِزْقًا نَحْنُ نَرْزُقُكَ وَ الْعَاقِبَةُ لِلتَّقْوٰى }» [ طٰہٰ : ۱۳۲ ] ’’اور اپنے گھر والوں کو نماز کا حکم دے اور اس پر خوب پابند رہ، ہم تجھ سے کسی رزق کا مطالبہ نہیں کرتے، ہم ہی تجھے رزق دیں گے اور اچھا انجام تقویٰ کا ہے۔‘‘ اسی طرح اللہ تعالیٰ نے اہل ایمان کو اپنے آپ کو اور اپنے گھر والوں کو آگ سے بچانے کا حکم دیا۔ دیکھیے سورۂ تحریم (۶)۔ ¤ ➋ {وَ كَانَ عِنْدَ رَبِّهٖ مَرْضِيًّا:} رب تعالیٰ کے ہاں پسندیدہ ہونے کا باعث سب سے پہلے تو خود اس ذات پاک کاکسی کو منتخب فرما لینا ہے، جیسا کہ فرمایا : «{ اَللّٰهُ يَصْطَفِيْ مِنَ الْمَلٰٓىِٕكَةِ رُسُلًا وَّ مِنَ النَّاسِ } » [ الحج : ۷۵ ] ’’اللہ فرشتوں میں سے پیغام پہنچانے والے چنتا ہے اور لوگوں سے بھی۔‘‘ اور فرمایا : «{ اَللّٰهُ يَجْتَبِيْۤ اِلَيْهِ مَنْ يَّشَآءُ وَ يَهْدِيْۤ اِلَيْهِ مَنْ يُّنِيْبُ }» [ الشورٰی : ۱۳ ] ’’اللہ اپنی طرف چن لیتا ہے جسے چاہتا ہے اور اپنی طرف راستہ اسے دیتا ہے جو رجوع کرے۔‘‘ پھر اللہ تعالیٰ کے ہاں پسندیدہ ({مَرْضِيًّا}) ہونے کا ذریعہ رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق کسی بندے کا فرائض کی ادائیگی اور نوافل کی کثرت ہے جس کی وجہ سے اللہ تعالیٰ اس سے محبت کرنے لگتا ہے۔ [ دیکھیے بخاري، الرقاق، باب التواضع : ۶۵۰۲، عن أبي ھریرۃ رضی اللہ عنہ ] اور ابوہریرہ رضی اللہ عنہ ہی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا أَحَبَّ اللّٰهُ الْعَبْدَ نَادَی جِبْرِيْلَ إِنَّ اللّٰهَ يُحِبُّ فُلاَنًا فَأَحْبِبْههُ فَيُحِبُّهُ جِبْرِيْلُ فَيُنَادِيْ جِبْرِيْلُ فِيْ أَهْلِ السَّمَاءِ إِنَّ اللّٰهَ يُحِبُّ فُلَانًا فَأَحِبُّوْهُ فَيُحِبُّهُ أَهْلُ السَّمَاءِ ثُمَّ يُوْضَعُ لَهٗ الْقَبُوْلُ فِي الْاَرْضِ ] [ بخاري، بدء الخلق، باب ذکر الملائکۃ صلوات اللّٰہ علیھم : ۳۲۰۹ ] ’’اللہ تعالیٰ جب کسی بندے سے محبت کرتا ہے تو جبریل علیہ السلام کو آواز دیتا ہے کہ اللہ تعالیٰ فلاں سے محبت کرتا ہے سو تو بھی اس سے محبت کر، تو جبریل اس سے محبت کرتا ہے، پھر جبریل آسمان والوں میں اعلان کر دیتا ہے کہ اللہ تعالیٰ فلاں سے محبت کرتا ہے، تم بھی اس سے محبت کرو تو آسمان والے اس سے محبت کرتے ہیں، پھر اس کے لیے زمین میں قبولیت رکھ دی جاتی ہے۔‘‘ {’’ مَرْضِيًّا ‘‘} کا حقیقی مصداق ایسا شخص ہوتا ہے۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) {وَ اذْكُرْ فِي الْكِتٰبِ اِدْرِيْسَ … :} یہ چھٹا قصہ ادریس علیہ السلام کا ہے، بعض مفسرین نے ادریس علیہ السلام کو بنی اسرائیل کے انبیاء میں شمار کیا ہے اور دلیل یہ دی ہے کہ معراج کے موقع پر جب نبی صلی اللہ علیہ وسلم کی ان سے ملاقات ہوئی تو انھوں نے نبی صلی اللہ علیہ وسلم کو {’’مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالْأَخِ الصَّالِحِ‘‘} (صالح نبی اور صالح بھائی کو مرحبا) کہہ کر خطاب کیا اور آدم اور ابراہیم علیھما السلام کی طرح {’’مَرْحَبًا بِالْوَلَدِ الصَّالِحِ‘‘} (صالح بیٹے کو مرحبا) نہیں کہا۔ حافظ ابن حجر رحمہ اللہ کے مطابق امام بخاری رحمہ اللہ کی یہی رائے ہے، کیونکہ {’’بَابُ ذِكْرِ إِدْرِيْسَ عَلَيْهِ السَّلاَمُ ‘‘} میں وہ حدیث معراج لائے ہیں۔ دیکھیے فتح الباری {’’ بَابُ ذِكْرِ اِدْرِيْسَ عَلَيْهِ السَّلاَمُ‘‘} اس سے پہلے باب میں امام بخاری نے فرمایا : ’’ابن مسعود اور ابن عباس رضی اللہ عنھم سے ذکر کیا جاتا ہے کہ الیاس ہی ادریس ہیں۔‘‘ حافظ ابن حجر رحمہ اللہ نے اس قول کے لانے کو بھی امام بخاری کی اس رائے کا اظہار کہا ہے کہ ادریس علیہ السلام نوح علیہ السلام سے پہلے نہیں بلکہ بعد میں ہوئے ہیں، کیونکہ قرآن مجید میں الیاس علیہ السلام کو نوح یا ابراہیم علیھما السلام کی اولاد میں شمار فرمایا گیا ہے۔ دیکھیے سورۂ انعام (۸۴، ۸۵) لیکن اکثر مفسرین کی تحقیق یہ ہے کہ ان کا زمانہ نوح علیہ السلام سے بھی پہلے کا ہے، چنانچہ بخاری نے {’’بَابُ ذِكْرِ إِدْرِيْسَ عَلَيْهِ السَّلاَمُ‘‘} کے ترجمۃ الباب میں فرمایا : {’’ وَ هُوَ جَدُّ أَبِيْ نُوْحٍ وَ يُقَالُ جَدُّ نُوْحٍ عَلَيْهُمَا السَّلاَمُ ‘‘} یعنی وہ نوح علیہ السلام کے والد کے دادا ہیں اور بعض کہتے ہیں کہ نوح علیہ السلام کے دادا ہیں۔ ابن جریر، قرطبی اور ابن کثیر رضی اللہ عنھا کی رائے بھی یہی ہے، دلیل اسی سورت کی آیت (۵۸) کی تفسیر میں آ رہی ہے۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) {وَ رَفَعْنٰهُ مَكَانًا عَلِيًّا: } حدیثِ معراج میں رسول اللہ صلی اللہ علیہ وسلم کی چوتھے آسمان پر ان سے ملاقات مذکور ہے۔ حافظ ابن حجر رحمہ اللہ نے فرمایا کہ اس مقام کے {’’ مَكَانًا عَلِيًّا ‘‘} (بہت اونچا مقام) ہونے میں کوئی شک نہیں۔ بعض لوگوں نے جو کہا ہے کہ انھیں زندہ آسمان پر اٹھایا گیا، تو یہ رسول اللہ صلی اللہ علیہ وسلم سے کسی قوی سند کے ساتھ ثابت نہیں بلکہ صرف کعب کا قول ہے جو اسرائیلی روایات بیان کرتے ہیں۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) ➊ { اُولٰٓىِٕكَ الَّذِيْنَ اَنْعَمَ اللّٰهُ عَلَيْهِمْ … : } مراد وہ انبیاء ہیں جن کا اس سورت میں ذکر ہے۔ یہ دس ہیں جن میں پہلے زکریا اور آخری ادریس علیھم السلام ہیں۔ ابن کثیر نے فرمایا، سدی اور ابن جریر اور قرطبی(رحمھم اللہ) نے فرمایا : ’’یہاں آدم کی اولاد سے مراد ادریس ہیں اور نوح کے ساتھ سوار ہونے والوں کی اولاد سے مراد ابراہیم ہیں اور ابراہیم کی اولاد سے مراد اسحاق، یعقوب اور اسماعیل ہیں اور اسرائیل کی اولاد سے مراد موسیٰ، ہارون، زکریا، یحییٰ اور عیسیٰ ابن مریم علیھم السلام ہیں۔‘‘ ابن جریر فرماتے ہیں : ’’اسی لیے ان کے نسب الگ الگ ذکر فرمائے ہیں، ورنہ آدم کی اولاد تو سب ہیں۔ وجہ یہ ہے کہ ان میں وہ بھی ہیں جو ان لوگوں کی اولاد میں سے نہیں جو نوح علیہ السلام کے ساتھ کشتی میں تھے اور وہ ادریس ہیں جو نوح علیہ السلام کے دادا ہیں۔‘‘ ابن کثیر نے فرمایا : ’’یہی بات زیادہ ظاہر ہے کہ ادریس علیہ السلام نوح علیہ السلام کے آبائی نسب میں شامل ہیں۔‘‘ ¤ رہا ادریس علیہ السلام کا ہمارے نبی صلی اللہ علیہ وسلم کو بیٹے کے بجائے بھائی کہنا، تو یہ تواضع سے بھی ہو سکتا ہے اور امام بخاری کا حدیث معراج کو لانا {’’ وَ رَفَعْنٰهُ مَكَانًا عَلِيًّا ‘‘} کی تفسیر کے طور پر بھی ہو سکتا ہے اور جو ادریس اور الیاس علیھما السلام کو ایک قرار دینا ہے تو صحابہ کرام اگر رسول اللہ صلی اللہ علیہ وسلم سے بیان کریں تو وہ بات یقینی ہے، ورنہ وحی الٰہی کے بغیر ہزاروں سال پہلے کے متعلق ان کی بات یقینی کیسے ہو سکتی ہے؟ خصوصاً جب یہ بھی امکان ہو کہ وہ بات اہل کتاب میں سے کسی سے سن کر بیان ہوئی ہے۔ اس لیے امام بخاری کا ادریس علیہ السلام کو جزم کے ساتھ نوح علیہ السلام کے والد کا دادا قرار دینا ہی راجح معلوم ہوتا ہے۔ (واللہ اعلم) ¤ ➋ {وَ مِمَّنْ هَدَيْنَا وَ اجْتَبَيْنَا …:} چند انبیاء علیھم السلام کے نام ذکر کرنے کے بعد ان الفاظ کے ساتھ تمام انبیاء کو بھی شامل فرما دیا، جیسا کہ سورۂ انعام کی آیت (۸۷) میں ہے۔ اس آیت میں جو فرمایا : «{ اِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُ الرَّحْمٰنِ خَرُّوْاسُجَّدًا وَّ بُكِيًّا }» اس م میں صراحت فرمائی کہ ان انبیاء کے سامنے جب رحمان کی آیات پڑھی جاتیں تو وہ روتے ہوئے سجدے میں گر جاتے۔ {’’بُكِيًّا ‘‘ ’’بَكَي يَبْكِيْ بُكَاءً‘‘} (ض) سے اسم فاعل {’’بَاكٍ‘‘} کی جمع ہے۔ ابن کثیر نے فرمایا کہ اہل علم کا اجماع ہے کہ انبیاء کی اقتدا میں یہاں سجدہ کرنا مشروع ہے۔ ابن ابی حاتم اور ابن جریر نے ذکر فرمایا : [ قَرَأَعُمَرُ بْنُ الْخَطَّابِ سُوْرَةَ مَرْيَمَ فَسَجَدَ وَقَالَ هٰذَا السُّجُوْدُ فَأَيْنَ الْبُكِييُّ؟ ] ’’عمر بن خطاب رضی اللہ عنہ نے سورۂ مریم پڑھی تو سجدہ کیا اور فرمایا : ’’یہ تو سجدہ ہوا مگر رونے والے کہاں ہیں؟‘‘ حکمت بن بشیر نے اسے صحیح کہا ہے۔ آیاتِ الٰہی سن کر رونا، دل کا ڈر جانا، رونگٹے کھڑے ہونا اور روتے ہوئے سجدے میں گر جانا، یہ صفات اللہ تعالیٰ نے اپنے متقی اور نیک بندوں کی بیان کی ہیں۔ دیکھیے سورۂ بنی اسرائیل (۱۰۷ تا ۱۰۹)، مائدہ (۸۳)، انفال (۲) اور زمر (۲۳) وغیرہ۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) ➊ {فَخَلَفَ مِنْۢ بَعْدِهِمْ خَلْفٌ : } لفظ{ ’’ خَلْفٌ ‘‘} لام کے سکون کے ساتھ ’’اولاد‘‘، واحد و جمع دونوں کے لیے ایک ہی لفظ آتا ہے اور اکثر بری اولاد اور مذمت کے لیے استعمال ہوتا ہے اور لام کے فتحہ کے ساتھ{’’ خَلَفٌ‘‘} ’’جانشین‘‘ کے معنی میں آتا ہے، وہ چاہے اولاد ہو یا کوئی اور۔ اس کا استعمال اکثر مدح و تعریف کے لیے ہوتا ہے اور دونوں لفظ ایک دوسرے کی جگہ بھی استعمال ہوتے ہیں۔ ¤ ➋ { اَضَاعُوا الصَّلٰوةَ:} نماز ضائع کرنے میں سب سے پہلے اس عقیدے کی ایجاد ہے کہ ایمان صرف دل سے تصدیق اور زبان سے اقرار کا نام ہے اور ان دونوں چیزوں سے ایمان مکمل ہو جاتا ہے۔ عمل کرے تو اچھا ہے، درجہ بڑھ جائے گا، ورنہ ایمان میں نہ کمی ہوتی ہے نہ اضافہ، جب کہ اللہ تعالیٰ نے نماز کو ایمان قرار دیا ہے، فرمایا : «{ وَ مَا كَانَ اللّٰهُ لِيُضِيْعَ اِيْمَانَكُمْ  }» [ البقرۃ : ۱۴۳] ’’اور اللہ کبھی ایسا نہیں کہ تمھارا ایمان ضائع کر دے۔‘‘ مگر ان لوگوں نے نماز کو ایمان ماننے سے انکار کر دیا، پڑھنے والا بھی مومن، نہ پڑھنے والا بھی، جو انکار نہ کرے پکا مومن۔ پھر اس عقیدے کی ایجاد کہ نماز تو دل کی ہوتی ہے، قیام، سجدے اور رکوع کی کیا ضرورت ہے اور اسے طریقت اور معرفت قرار دینا نماز ضائع کرنے کا عام بہانہ ہے۔ ¤ اس کے علاوہ نماز کو صحیح وقت پر نہ پڑھنا، یا اسے رسول اللہ صلی اللہ علیہ وسلم کے بتائے ہوئے طریقے کے مطابق نہ پڑھنا، کبھی پڑھنا، کبھی نہ پڑھنا، یا سرے سے اسے ترک کر دینا، سب نماز ضائع کرنے کی صورتیں ہیں۔ نماز ترک کر دینے سے انسان کے پاس اسلام کی آخری عملی شہادت بھی ختم ہو جاتی ہے۔ اس لیے امام احمد کے قول اور امام شافعی کے ایک قول کے مطابق نماز کا تارک کافر ہے۔ یہاں تفصیل کا موقع نہیں، دیکھیے سورۂ توبہ کی آیات (۵) اور (۱۱) کی تفسیر۔ رسول اللہ صلی اللہ علیہ وسلم کی ایک حدیث اس بحث کے لیے فیصلہ کن نظر آتی ہے، ابو امامہ رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَتُنْتَقَضَنَّ عُرَی الْإِسْلَامِ عُرْوَةً عُرْوَةً فَكُلَّمَا انْتَقَضَتْ عُرْوَةٌ تَشَبَّثثَ النَّاسُ بِالَّتِيْ تَلِيْهَا فَأَوَّلُهُنَّ نَقْضًا الْحُكْمُ وَ آخِرُهُنَّ الصَّلَاةُ ] [ صحیح ابن حبان، التاریخ، باب ذکر الأخبار بأن أول ما یظھر… : ۶۷۱۵۔ مسند أحمد : 251/5، ح : ۲۲۲۲۲ ] ’’اسلام کی کڑیاں ایک ایک کرکے ٹوٹتی جائیں گی، جب بھی کوئی کڑی ٹوٹے گی تو لوگ اس کے بعد والی کو مضبوطی سے پکڑ لیں گے، چنانچہ سب سے پہلے ٹوٹنے والی کڑی ’’حکم‘‘ ہو گی (یعنی اللہ تعالیٰ کے نازل کردہ حکم کے مطابق فیصلے کرنا) اور سب سے آخری کڑی نماز ہو گی۔‘‘ ¤ ➌ { وَ اتَّبَعُوا الشَّهَوٰتِ :} انسان میں کئی شہوات و خواہشات پائی جاتی ہیں۔ اللہ تعالیٰ نے ہر خواہش کی تکمیل کے لیے جائز طریقے بتائے ہیں، مثلاً عبادت کی جبلی خواہش پوری کرنے کے لیے اپنے ایک ہی رب اللہ تعالیٰ کی عبادت اس کے رسول صلی اللہ علیہ وسلم کے طریقے کے مطابق کرنا، جنسی خواہش کے لیے نکاح کرنا اور لونڈیاں رکھنا۔ مالی حرص کے لیے جائز طریقے سے مال کمانا، خرچ کرنا اور اس کی زکاۃ دینا، غصے کی جبلت کا رخ کفار اور دشمنان اسلام کے ساتھ جہاد کی طرف موڑنا، غرض ہر فطری جذبے کو پورا کرنے کا سامان بھی فرمایا اور اللہ کے حکم سے تجاوز پر حد بھی نافذ فرمائی۔ شرک کو ناقابل معافی جرم قرار دیا، زنا پر حد رکھی، قوم لوط کے عمل کو حرام قرار دیا، سود کو حرام قرار دیا، ڈاکے اور چوری کی حد مقرر کی، قتل یا زخمی کرنے والوں پر قصاص یا دیت لازم فرمائی۔ پہلے انبیاء کے نالائق جانشینوں نے جس طرح اللہ کے احکام کی پیروی کے بجائے اپنی خسیس خواہشات کی پیروی کی، رسول اللہ صلی اللہ علیہ وسلم کی پیش گوئی کے مطابق ہماری امت کے خواہش پرستوں نے بھی وہی کام کیا، بلکہ انھوں نے اپنے پاس سے ایسے فقہی ضابطے بنائے اور انھیں اللہ کا حکم باور کروایا کہ جن سے اللہ کی حدود سرے سے باطل ہو گئیں۔ ساتھ ہی ہر حرام کام کی سزا سے بچنے کے لیے اس کا نام بدل دیا، یا اس کی حد سے بچنے کا حیلہ ایجاد کر دیا۔ وحدت الوجود اور تصور شیخ کے شرکیہ عقیدے اور عمل کو طریقت اور معرفت کا خوش نما نام دے لیا۔ زنا کی سزا سے بچنے کے لیے کہہ دیا کہ اجرت پر لا کر عورت سے زنا کرنے پر حد نہیں۔ زنا کا نام حلالہ اور متعہ رکھ دیا۔ ماں، بہن، بیٹی اور دوسری محرمات سے، یہ جانتے ہوئے کہ حرام ہیں، نکاح کرکے زنا کرے تو حد معاف قرار دی۔ کانوں اور آنکھوں کے زنا کو سماع، روح کی غذا یا آرٹ اور فنون لطیفہ کہہ دیا۔ سود حلال کر لیا مگر نام اس کا منافع رکھ دیا۔ دار الحرب میں سود کو بالکل ہی جائز قرار دے لیا۔ جان بوجھ کر زکوٰۃ سے بچنے کے لیے کوئی بھی حیلہ کرنا جائز کر دیا اور کہہ دیا کہ یہ مکروہ بھی نہیں۔ کوئی خوبصورت لڑکی پسند آ جائے اور جھوٹے گواہ بھگتا کر قاضی سے اپنے حق میں فیصلہ کروا کر اس سے زنا کرلے تو اسے اللہ کے ہاں بھی گرفت سے بری قرار دیا۔ زنا پر پکڑا جائے، چار گواہ بھی بھگت جائیں مگر زانی کے صرف یہ کہہ دینے سے کہ یہ میری بیوی ہے، حد ختم کر دی، خواہ وہ بیوی ہونے کا کوئی ثبوت بھی پیش نہ کر سکے اور خواہ وہ عورت چیختی چلاتی رہے کہ میں اس کی بیوی نہیں بلکہ فلاں کی بیوی ہوں۔ انگور اور کھجور کے سوا کسی بھی چیز سے بنی ہوئی شراب حلال قرار دی اور نشہ آنے کے باوجود بھی اس سے حد ساقط کر دی اور نام بدل کر نبیذ، طلا یا کوئی اور رکھ لیا۔ قتل جان بوجھ کر کرے مگر تیز دھار آلے سے نہ کرے، یا آگ اور فائر سے نہ کرے تو قصاص ختم کر دیا، خواہ جان بوجھ کر اس سے بدفعلی کرکے مار دے، یا پتھروں سے مار دے، یا برف کے بلاک میں رکھ کر یا ڈبو کر مار دے، یا اسے قید کرکے بھوکا مار دے، یا دیوار میں چن کر مار دے، قصاص ختم کر دیا، صرف دیت لی جا سکتی ہے۔ چوری شہادتوں سے ثابت ہو جائے مگر صرف چور کے دعویٰ کر دینے سے کہ میں اس کا مالک ہوں، خواہ وہ مالک ہونے کی کوئی دلیل بھی نہ دے، حد موقوف کر دی گئی۔ غرض یہود و نصاریٰ اور مشرکین کے ہاں جان، مال اور عزت و آبرو اس قدر برباد نہیں تھی جس قدر مسلمانوں نے خواہش پرستی میں آ کر اسے برباد کیا اور نام اس کا قوانین اسلام رکھ دیا۔ ان لوگوں نے تو یہ سب کچھ حیلے ایجاد کرکے کیا مگر موجودہ اکثر مسلم حکمرانوں نے حیلے کا تکلف بھی چھوڑ دیا اور صاف الفاظ میں حکم الٰہی کو وحشیانہ کہہ کر اسلام کی آخری کڑی نماز سے بھی فارغ ہو گئے۔ غرض رسول اللہ صلی اللہ علیہ وسلم کی وہ بات سچی ہو گئی : [ لَتَتَّبِعُنَّ سَنَنَ مَنْ قَبْلَكُمْ شِبْرًا بِشِبْرٍ وَذِرَاعًا بِذِرَاعٍ حَتّٰی لَوْ سَلَكُوْا جُحْرَ ضَبٍّ لَسَلَكْتُمُوْهُ] [بخاري، أحادیث الأنبیاء، باب نزول عیسی ابن مریم علیھا السلام : ۳۴۵۶، عن أبي سعید رضی اللہ عنہ ]’’تم اپنے سے پہلوں کے طریقوں پر چل نکلو گے (جس طرح) بالشت بالشت کے ساتھ اور ہاتھ ہاتھ کے ساتھ (برابر ہوتا ہے) حتیٰ کہ اگر وہ سانڈے کے بل میں داخل ہوئے ہیں تو تم بھی اس میں ضرور داخل ہو گے۔‘‘ نتیجہ مسلمانوں کی غلامی اور اللہ کے دشمنوں کے ان پر مسلط ہونے کی صورت میں سب کے سامنے ہے، جسے اللہ نے {’’ غَيًّا ‘‘} (گمراہی) فرمایا ہے۔ علاج اس کا بھی وہی ہے جو اللہ تعالیٰ نے اگلی آیت میں بیان فرمایا ہے۔ ¤ ➍ { فَسَوْفَ يَلْقَوْنَ غَيًّا:} ’’گمراہی کو ملیں گے‘‘ کا مطلب یہ ہے کہ دنیا و آخرت دونوں میں جنت کی راہ نہیں پا سکیں گے اور اس سے بھٹکے ہی رہیں گے۔ ابن عباس رضی اللہ عنھما نے {’’ غَيًّا ‘‘} کی تفسیر خسارا فرمائی ہے۔ [ طبري بسند ثابت ] {’’ غَيًّا ‘‘} کی تفسیر جہنم کی ایک وادی یا کنواں صحیح سند کے ساتھ رسول اللہ صلی اللہ علیہ وسلم سے یا ابن مسعود رضی اللہ عنہ سے ثابت نہیں۔ ہاں، یہ درست ہے کہ ساری کی سا ساری جہنم ہی گمراہی کا انجام بد ہے، جسے مجرم جا ملیں گے۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) {اِلَّا مَنْ تَابَ وَ اٰمَنَ وَ عَمِلَ … : } نماز ضائع کرنے اور خواہشات کی پیروی جیسی بیماریوں کے لیے نسخۂ شفا توبہ، ایمان اور عمل صالح ہے۔ توبہ، ایمان اور عمل صالح، یعنی نماز کی پابندی اور اپنی خواہشات کو اللہ کے حکم کے تابع کرنے والا شخص جنت میں داخل ہو گا اور اس کا کوئی اجر مارا نہ جائے گا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلتَّائِبُ مِنَ الذَّنْبِ كَمَنْ لَّا ذَنْبَ لَهٗ ] [ ابن ماجہ، الزھد، باب ذکر الذنوب : ۴۲۵۰، عن أبي عبد اللہ بن مسعود رضی اللہ عنہ و حسنہ الألباني ] ’’گناہ سے توبہ کرنے والا اس شخص جیسا ہے جس کا کوئی گناہ نہ ہو۔‘‘"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) {جَنّٰتِ عَدْنٍ الَّتِيْ وَعَدَ الرَّحْمٰنُ …:} ہمیشگی کی جنتوں کا وعدہ کرتے ہوئے اللہ تعالیٰ کے اپنے رحمان ہونے اور بندوں کو اپنا بندہ کہنے کے الفاظ سے ظاہر ہوتا ہے کہ اس کی رحمت کس قدر بے حساب و بے کنار ہے اور فرماں بردار بندوں سے اس کا تعلق کتنا گہرا اور پیارا ہے۔ ’’بن دیکھے‘‘ کا مطلب یہ ہے کہ بندوں سے اس رحمان نے وعدہ کیا ہے جس رحمان کو انھوں نے نہیں دیکھا، یعنی بن دیکھے اس پر ایمان لائے ہیں۔ دوسرا معنی ہے کہ رحمان نے ان سے ایسی جنتوں کا وعدہ کیا ہے جو انھوں نے دیکھی نہیں مگر انھیں دیکھے بغیر ہی ان کے ملنے کا یقین ہے، کیونکہ یہ حقیقت ہے کہ رحمان کا وعدہ ہمیشہ پورا ہو کر رہنے والا ہے۔ {’’اِنَّ‘‘} تعلیل کے لیے ہے۔ {’’ مَاْتِيًّا ‘‘ ’’أَتَي يَأْتِيْ‘‘} سے اسم مفعول ہے۔ اللہ کا وعدہ جنت ہے اور اس کے بندے یقینا اس میں آنے والے ہیں، یہ بات اس لیے فرمائی کہ عموماً لوگ ان دیکھی چیزوں کے کیے ہوئے وعدے پورے نہیں کرتے۔ (بقاعی) اللہ کا وعدہ پورا ہو کر رہنے پر مشتمل آیات کے لیے دیکھیے سورۂ رعد (۳۱)، آل عمران (۱۹۴، ۱۹۵)، بنی اسرائیل (۱۰۸)، مزمل (۱۷، ۱۸) اور فرقان (۱۵، ۱۶)۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) ➊ { لَا يَسْمَعُوْنَ فِيْهَا لَغْوًا اِلَّا سَلٰمًا :} اہل ایمان کے لیے دنیا میں اییک شدید تکلیف لغو کلام سننا ہے، جسے وہ سننا نہیں چاہتے۔ اس تکلیف کا اندازہ اور اس سے بچے رہنے کی نعمت کی قدر صرف وہ لوگ کر سکتے ہیں جنھیں اس سے سابقہ پڑا ہو۔ جنت میں انھیں ایسی باتوں کے بجائے ہر وقت اللہ تعالیٰ کی طرف سے یا فرشتوں کی طرف سے یا ایک دوسرے کی طرف سے سلام کی آواز آئے گی۔ دیکھیے سورۂ یس (۵۸) اور سورۂ رعد (۲۳، ۲۴) یا ایسی بات سنائی دے گی جو ہر طرح کی تکلیف سے پاک اور سراسر سلامتی والی ہو گی، یعنی کوئی لغو یا تکلیف دہ بات ان کے کانوں میں نہیں پڑے گی۔ ¤ ➋ { بُكْرَةً وَّ عَشِيًّا:} بظاہر معنی یہ ہے کہ اتنی دیر کے بعد جتنی دیر کے بعد دنیا میں صبح سے شام ہوتی ہے مگر یہ معنی راجح نہیں، کیونکہ اتنی دیر تو دنیا میں کھانے پینے سے صبر کرنا مشکل ہے، تو وہ جنت ہی کیا ہوئی جس میں صرف صبح و شام راشن ملے۔ اس لیے اس کا معنی ہر وقت اور ہمیشہ ہے، یعنی ہر وقت جب بھی انھیں کھانے کی یا لذت کی کسی بھی چیز کی خواہش ہو گی، کیونکہ جنت میں دنیا کی طرح کا نہ دن ہو گا اور نہ رات۔ صبح شام بول کر ہمیشگی مراد لینا صرف عربی ہی نہیں ہر زبان کا عام محاورہ ہے۔ خصوصاً اس لیے کہ جنتیوں کو ہر وہ چیز ملے گی جس کی انھیں خواہش ہو گی، خواہ کسی وقت خواہش ہو۔ دیکھیے سورۂ زخرف (۷۱)۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) {تِلْكَ الْجَنَّةُ الَّتِيْ نُوْرِثُ … :} یعنی جنت کا وارث وہ ہو گا جو اللہ اور اس کے رسول کی اطاعت کرے اور کفر و شرک اور گناہوں سے بہت بچنے والا ہو۔ اس آیت میں متقی لوگوں کو جنت کا وارث بنانے کا ذکر ہے۔ یہی بات سورۂ مومنون (۱ تا ۱۰) اور اعراف (۴۲، ۴۳) میں بیان کی گئی ہے۔ سوال یہ ہے کہ اہل جنت کس کے وارث بنیں گے؟ اس کا ایک جواب یہ ہے کہ ان کے باپ آدم کو جنت ملی تھی اور اولاد اپنے باپ کی جائداد کی وارث ہوتی ہے۔ دوسرا جواب یہ ہے کہ اللہ تعالیٰ نے جنت اور جہنم دونوںمیں بنی آدم کی جگہ بنائی ہے۔ اہل جہنم اپنی بداعمالیوں کی وجہ سے جنت میں اپنی جگہ سے محروم ہو جائیں گے تو اس کے وارث جنتی ہوں گے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كُلُّ أَهْلِ الْجَنَّةِ يَرٰی مَقْعَدَهُ مِنَ النَّارِ فَيَقُوْلُ لَوْلاَ أَنَّ اللّٰهَ هَدَانِيْ فَيَكُوْنُ لَههُ شُكْرٌ، وَ كُلُّ أَهْلِ النَّارِ يَرٰی مَقْعَدَهُ مِنَ الْجَنَّةةِ فَيَقُوْلُ لَوْلاَ أَنَّ اللّٰهَ هَدَانِيْ فَيَكُوْنُ عَلَيْهِ حَسْرَةٌ ] [صحیح الجامع : ۴۵۱۴۔ مسند أحمد : 512/2، ح : ۱۰۶۶۳۔ مستدرک حاکم : 436/2، ح : ۳۶۲۹، عن أبي ھریرۃ رضی اللہ عنہ ] ’’تمام اہل جنت آگ میں اپنا ٹھکانا دیکھیں گے تو کہیں گے، اگر یہ نہ ہوتا کہ اللہ نے مجھے ہدایت دی (تو میں یہاں ہوتا)، تو وہ بہت شکر کرے گا اور تمام اہل نار جنت میں اپنی جگہ دیکھیں گے تو کہیں گے، اگر ایسا ہوتا کہ مجھے اللہ تعالیٰ ہدایت دے دیتا (تو میں یہاں ہوتا)، تو اس کے لیے بہت حسرت ہوگی۔‘‘ مگر اس جواب میں یہ خیال گزرتا ہے کہ جنتیوں کو صرف جہنمیوں والی جگہ بطور میراث ملے گی، حالانکہ جنت میں ان کا اپنا حصہ بھی ہے، جیسا کہ فرمایا : «{ اُعِدَّتْ لِلْمُتَّقِيْنَ }» [ آل عمران : ۱۳۳ ] ’’(یہ جنت) ڈرنے والوں کے لیے تیار کی گئی ہے۔‘‘ لہٰذا یہ معنی مرجوح ہے۔ اس لیے اکثر مفسرین نے {’’نُوْرِثُ‘‘} کا معنی یہ کیا ہے کہ ہم متقی لوگوں کو ہر طرح سے اس کا مالک بنا دیں گے، وہ کبھی ان سے واپس نہ لی جائے گی، بلکہ وہ میراث کی طرح انھی کی ہو جائے گی، کیونکہ کسی چیز کی ملکیت حاصل ہونے کی سب سے پکی صورت میراث ہے، اس لیے کہ ملکیت حاصل ہونے کی دوسری تمام صورتوں میں ملکیت چھننے کی گنجائش ہوتی ہے، بیع ہو یا ہبہ یا غصب، اس کا مالک اسے واپس لے سکتا ہے، یا بدل سکتا ہے، مگر وارث کو یہ فکر نہیں ہوتی۔ یہ معنی بھی مضبوط ہے۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 65،64) ➊ {وَ مَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَ : ’’نَنْزِلُ‘‘} کے بجائے {’’ نَتَنَزَّلُ ‘‘} اس لیے فرمایا کہ باب تفعّل میں ٹھہر ٹھہر کر کام کرنے کا مفہوم پایا جاتا ہے۔ مطلب یہ کہ ہم وقفے وقفے سے، ٹھہر ٹھہر کر تیرے رب ہی کے حکم سے اترتے ہیں۔ ابن عباس رضی اللہ عنھما فرماتے ہیں: [ قَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ لِجِبْرِيْلَ : مَا يَمْنَعُكَ أَنْ تَزُوْرُنَا أَككْثَرَ مِمَّا تَزُوْرُنَا فَنَزَلَتْ : «{ وَ مَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَ لَهٗ مَا بَيْنَ اَيْدِيْنَا وَ مَا خَلْفَنَا }» ] [ بخاري، التفسیر، باب قولہ : « وما نتنزل إلا بأمر ربک… » : ۴۷۳۱ ]’’ایک مرتبہ نبی صلی اللہ علیہ وسلم نے جبریل علیہ السلام سے کہا : ’’آپ ہماری ملاقات کے لیے جتنا آتے ہیں اس سے زیادہ کیوں نہیں آتے؟‘‘ تو یہ آیت اتری : «{ وَ مَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَ }» “ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اللہ تعالیٰ نے یہ کلام سکھایا جبریل علیہ السلام کو کہ جواب میں یوں کہو۔ سو یہ کلام ہے اللہ کا جبریل کی طرف سے، جیسا کہ {’’ اِيَّاكَ نَعْبُدُ وَ اِيَّاكَ نَسْتَعِيْنُ ‘‘} ہم کو سکھایا۔ ¤ ➋ { لَهٗ مَا بَيْنَ اَيْدِيْنَا … :} یعنی صرف یہی نہیں کہ ہم اپنی مرضی سے اترنے کا اختیار نہیں رکھتے، بلکہ ہم اپنی مرضی سے کسی کام کا اختیار بھی نہیں رکھتے، کیونکہ جو کچھ ہمارے آگے ہے، یا ہمارے پیچھے ہے، یا اس کے درمیان ہے، یعنی دائیں اور بائیں ہے، چاروں جہتوں کی ہر چیز کا مالک صرف اللہ ہے۔ اگلی آیت میں فرمایا کہ آسمان و زمین اور ان کے مابین اشیاء کا رب بھی وہی ہے۔ اس میں اوپر نیچے کی جہتیں اور ان کے درمیان کی ہر چیز بھی آ گئی، اس کے علاوہ جو ہمارے آگے ہے اور جو ہمارے پیچھے ہے اس میں ماضی، حال اور مستقبل تینوں زمانے بھی آ گئے، یعنی جس ہستی کا قبضہ، ملکیت اور ربوبیت اتنی مستحکم اور وسیع ہے کہ زمان و مکان میں سے کوئی چیز اس سے باہر نہیں، تو اس کی مرضی کے بغیر زمین پر اترنا تو کجا ہم کوئی حرکت بھی نہیں کر سکتے۔ ¤ ➌ { وَ مَا كَانَ رَبُّكَ نَسِيًّا : ’’ نَسِيًّا ‘‘ ’’فَعِيْلٌ‘‘} کے وزن پر مبالغہ ہے، بہت بھولنے والا۔ اس کا معنی یہ نہیں کہ وہ بہت بھولنے والا تو نہیں مگر کم بھولتا ہے، بلکہ اس طرح مبالغے کا لفظ آئے تو مبالغے کی نفی مراد نہیں ہوتی بلکہ نفی میں مبالغہ مراد ہوتا ہے، اس لیے معنی یہ ہو گا کہ تیرا رب کبھی کسی طرح بھولنے والا نہیں۔ کبھی کا مفہوم {’’ كَانَ ‘‘} سے واضح ہو رہا ہے، جیسا کہ فرمایا : «{ وَ اَنَّ اللّٰهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيْدِ }» دیکھیے سورۂ آل عمران (۱۸۲) اور انفال (۵۱) کی تفسیر۔ یہاں رب تعالیٰ سے بھولنے کی نفی کا مطلب یہ ہے کہ جبریل علیہ السلام اگر دیر سے اتریں تو یہ مطلب نہیں کہ آپ کے رب نے آپ کو بھلا دیا ہے، جیسا کہ یہ مشرکین باتیں بنا رہے ہیں، وہاں بھولنے کا تو کسی طرح سوال ہی پیدا نہیں ہوتا۔ بلکہ اس کی حکمت کا تقاضا جبریل علیہ السلام کا اجازت کے ساتھ وقفے سے آنا ہی ہے۔ مزید وضاحت کے لیے دیکھیے سورۂ ضحی کی تفسیر۔ ابودرداء رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بیان فرماتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَا أَحَلَّ اللّٰهُ فِيْ كِتَابِهِ فَهُوَ حَلاَلٌ وَمَا حَرَّمَ فَهُوَ حَرَامٌ وَمَا سَكَتَ عَنْههُ فَهُوَ عَافِيَةٌ فَاقْبَلُوٓا مِنَ اللّٰهِ الْعَافِيَةَ فَإِننَّ اللّٰهَ لَمْ يَكُنْ نَسِيًّا، ثُمَّ تَلَا هٰذِهِ الْآيَةَ : «{ وَ مَا كَانَ رَبُّكَ نَسِيًّا }» ] [مستدرک حاکم : 375/2، ح : ۳۴۱۹ و سندہ حسن ({حكمت بن بشير}) ]’’اللہ نے جو کچھ اپنی کتاب میں حلال کیا وہ حلال ہے اور جسے حرام کیا وہ حرام ہے اور جس سے خاموشی اختیار فرمائی وہ معاف ہے، کیونکہ یہ ہو ہی نہیں سکتا کہ اللہ تعالیٰ کوئی چیز بھول جائے۔‘‘ پھر یہ آیت پڑھی : «{ وَ مَا كَانَ رَبُّكَ نَسِيًّا }» ۔‘‘ ¤ ➍ {’’ وَ اصْطَبِرْ ‘‘ ’’صَبَرَ يَصْبِرُ‘‘} سے باب افتعال کا فعل امر ہے۔ ’’تاء‘‘ کو ’’طاء‘‘ کر دیا اور حرف زیادہ ہونے سے معنی زیادہ ہو گیا، خوب صابر رہ، یعنی اس کی بندگی کرتے رہیے اور اس راہ میں جو مصائب و مشکلات پیش آئیں ان کا پورے صبر کے ساتھ مقابلہ کیجیے، اگر ہماری طرف سے کبھی یاد فرمائی یا مدد یا تسلی دینے میں کچھ تاخیر ہو جائے تو گھبرانے اور پریشان ہونے کی ضرورت نہیں۔ ¤ ➎ {هَلْ تَعْلَمُ لَهٗ سَمِيًّا:} وہ دو شخص جن کا نام ایک ہو ایک دوسرے کے {’’سَمِيٌّ‘‘} (ہم نام)کہلاتے ہیں۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’اللہ تعالیٰ کے جتنے نام ہیں سب اس کی صفت ہیں، یعنی کوئی ہے اس کی صفت کا؟‘‘(موضح) یہاں {’’ سَمِيًّا ‘‘} کا معنی ’’نظیر‘‘ اور ’’مثیل‘‘ ہے۔ گویا اس آیت اور دوسری آیت : « لَيْسَ كَمِثْلِهٖ شَيْءٌ» [ الشوریٰ : ۱۱ ] کا معنی ایک ہی ہے، یعنی جب اس جیسا آپ کسی کو نہیں سمجھتے تو پھر اس کے سوا چارہ کیا ہے کہ اس کے راستے پر چلتے رہیے۔ ¤ ➏ { ’’ وَ مَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَ ‘‘} کے ربط کے لیے دیکھیے سورۂ قیامہ کی آیت (۱۶) : «{ لَا تُحَرِّكْ بِهٖ لِسَانَكَ }» کی تفسیر۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65،64) ➊ {وَ مَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَ : ’’نَنْزِلُ‘‘} کے بجائے {’’ نَتَنَزَّلُ ‘‘} اس لیے فرمایا کہ باب تفعّل میں ٹھہر ٹھہر کر کام کرنے کا مفہوم پایا جاتا ہے۔ مطلب یہ کہ ہم وقفے وقفے سے، ٹھہر ٹھہر کر تیرے رب ہی کے حکم سے اترتے ہیں۔ ابن عباس رضی اللہ عنھما فرماتے ہیں: [ قَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ لِجِبْرِيْلَ : مَا يَمْنَعُكَ أَنْ تَزُوْرُنَا أَككْثَرَ مِمَّا تَزُوْرُنَا فَنَزَلَتْ : «{ وَ مَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَ لَهٗ مَا بَيْنَ اَيْدِيْنَا وَ مَا خَلْفَنَا }» ] [ بخاري، التفسیر، باب قولہ : « وما نتنزل إلا بأمر ربک… » : ۴۷۳۱ ]’’ایک مرتبہ نبی صلی اللہ علیہ وسلم نے جبریل علیہ السلام سے کہا : ’’آپ ہماری ملاقات کے لیے جتنا آتے ہیں اس سے زیادہ کیوں نہیں آتے؟‘‘ تو یہ آیت اتری : «{ وَ مَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَ }» “ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اللہ تعالیٰ نے یہ کلام سکھایا جبریل علیہ السلام کو کہ جواب میں یوں کہو۔ سو یہ کلام ہے اللہ کا جبریل کی طرف سے، جیسا کہ {’’ اِيَّاكَ نَعْبُدُ وَ اِيَّاكَ نَسْتَعِيْنُ ‘‘} ہم کو سکھایا۔ ¤ ➋ { لَهٗ مَا بَيْنَ اَيْدِيْنَا … :} یعنی صرف یہی نہیں کہ ہم اپنی مرضی سے اترنے کا اختیار نہیں رکھتے، بلکہ ہم اپنی مرضی سے کسی کام کا اختیار بھی نہیں رکھتے، کیونکہ جو کچھ ہمارے آگے ہے، یا ہمارے پیچھے ہے، یا اس کے درمیان ہے، یعنی دائیں اور بائیں ہے، چاروں جہتوں کی ہر چیز کا مالک صرف اللہ ہے۔ اگلی آیت میں فرمایا کہ آسمان و زمین اور ان کے مابین اشیاء کا رب بھی وہی ہے۔ اس میں اوپر نیچے کی جہتیں اور ان کے درمیان کی ہر چیز بھی آ گئی، اس کے علاوہ جو ہمارے آگے ہے اور جو ہمارے پیچھے ہے اس میں ماضی، حال اور مستقبل تینوں زمانے بھی آ گئے، یعنی جس ہستی کا قبضہ، ملکیت اور ربوبیت اتنی مستحکم اور وسیع ہے کہ زمان و مکان میں سے کوئی چیز اس سے باہر نہیں، تو اس کی مرضی کے بغیر زمین پر اترنا تو کجا ہم کوئی حرکت بھی نہیں کر سکتے۔ ¤ ➌ { وَ مَا كَانَ رَبُّكَ نَسِيًّا : ’’ نَسِيًّا ‘‘ ’’فَعِيْلٌ‘‘} کے وزن پر مبالغہ ہے، بہت بھولنے والا۔ اس کا معنی یہ نہیں کہ وہ بہت بھولنے والا تو نہیں مگر کم بھولتا ہے، بلکہ اس طرح مبالغے کا لفظ آئے تو مبالغے کی نفی مراد نہیں ہوتی بلکہ نفی میں مبالغہ مراد ہوتا ہے، اس لیے معنی یہ ہو گا کہ تیرا رب کبھی کسی طرح بھولنے والا نہیں۔ کبھی کا مفہوم {’’ كَانَ ‘‘} سے واضح ہو رہا ہے، جیسا کہ فرمایا : «{ وَ اَنَّ اللّٰهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيْدِ }» دیکھیے سورۂ آل عمران (۱۸۲) اور انفال (۵۱) کی تفسیر۔ یہاں رب تعالیٰ سے بھولنے کی نفی کا مطلب یہ ہے کہ جبریل علیہ السلام اگر دیر سے اتریں تو یہ مطلب نہیں کہ آپ کے رب نے آپ کو بھلا دیا ہے، جیسا کہ یہ مشرکین باتیں بنا رہے ہیں، وہاں بھولنے کا تو کسی طرح سوال ہی پیدا نہیں ہوتا۔ بلکہ اس کی حکمت کا تقاضا جبریل علیہ السلام کا اجازت کے ساتھ وقفے سے آنا ہی ہے۔ مزید وضاحت کے لیے دیکھیے سورۂ ضحی کی تفسیر۔ ابودرداء رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بیان فرماتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَا أَحَلَّ اللّٰهُ فِيْ كِتَابِهِ فَهُوَ حَلاَلٌ وَمَا حَرَّمَ فَهُوَ حَرَامٌ وَمَا سَكَتَ عَنْههُ فَهُوَ عَافِيَةٌ فَاقْبَلُوٓا مِنَ اللّٰهِ الْعَافِيَةَ فَإِننَّ اللّٰهَ لَمْ يَكُنْ نَسِيًّا، ثُمَّ تَلَا هٰذِهِ الْآيَةَ : «{ وَ مَا كَانَ رَبُّكَ نَسِيًّا }» ] [مستدرک حاکم : 375/2، ح : ۳۴۱۹ و سندہ حسن ({حكمت بن بشير}) ]’’اللہ نے جو کچھ اپنی کتاب میں حلال کیا وہ حلال ہے اور جسے حرام کیا وہ حرام ہے اور جس سے خاموشی اختیار فرمائی وہ معاف ہے، کیونکہ یہ ہو ہی نہیں سکتا کہ اللہ تعالیٰ کوئی چیز بھول جائے۔‘‘ پھر یہ آیت پڑھی : «{ وَ مَا كَانَ رَبُّكَ نَسِيًّا }» ۔‘‘ ¤ ➍ {’’ وَ اصْطَبِرْ ‘‘ ’’صَبَرَ يَصْبِرُ‘‘} سے باب افتعال کا فعل امر ہے۔ ’’تاء‘‘ کو ’’طاء‘‘ کر دیا اور حرف زیادہ ہونے سے معنی زیادہ ہو گیا، خوب صابر رہ، یعنی اس کی بندگی کرتے رہیے اور اس راہ میں جو مصائب و مشکلات پیش آئیں ان کا پورے صبر کے ساتھ مقابلہ کیجیے، اگر ہماری طرف سے کبھی یاد فرمائی یا مدد یا تسلی دینے میں کچھ تاخیر ہو جائے تو گھبرانے اور پریشان ہونے کی ضرورت نہیں۔ ¤ ➎ {هَلْ تَعْلَمُ لَهٗ سَمِيًّا:} وہ دو شخص جن کا نام ایک ہو ایک دوسرے کے {’’سَمِيٌّ‘‘} (ہم نام)کہلاتے ہیں۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’اللہ تعالیٰ کے جتنے نام ہیں سب اس کی صفت ہیں، یعنی کوئی ہے اس کی صفت کا؟‘‘(موضح) یہاں {’’ سَمِيًّا ‘‘} کا معنی ’’نظیر‘‘ اور ’’مثیل‘‘ ہے۔ گویا اس آیت اور دوسری آیت : « لَيْسَ كَمِثْلِهٖ شَيْءٌ» [ الشوریٰ : ۱۱ ] کا معنی ایک ہی ہے، یعنی جب اس جیسا آپ کسی کو نہیں سمجھتے تو پھر اس کے سوا چارہ کیا ہے کہ اس کے راستے پر چلتے رہیے۔ ¤ ➏ { ’’ وَ مَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَ ‘‘} کے ربط کے لیے دیکھیے سورۂ قیامہ کی آیت (۱۶) : «{ لَا تُحَرِّكْ بِهٖ لِسَانَكَ }» کی تفسیر۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) { وَ يَقُوْلُ الْاِنْسَانُ ءَاِذَا مَا مِتُّ … :} اس آیت کی تفسیر کے لیے دیکھیے سورۂ یس (۷۷ تا ۷۹ )۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) { اَوَ لَا يَذْكُرُ الْاِنْسَانُ اَنَّا خَلَقْنٰهُ … :} تو کیا جس ذات پاک نے اس وقت اسے پیدا فرمایا جب یہ کچھ بھی نہ تھا، اس کے لیے یہ مشکل ہے کہ مرنے کے بعد اسے دوبارہ زندگی دے سکے؟ دوبارہ زندہ کرنے کی یہ سب سے قوی دلیل ہے جو اللہ تعالیٰ نے بار بار قرآن مجید میں بیان فرمائی ہے۔ دیکھیے سورۂ دہر (۱، ۲)، واقعہ (۴۳ تا ۶۲)، روم (۲۷)، حج (۵)، بنی اسرائیل (۵۱) اور انبیاء (۱۰۴) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ قَالَ اللّٰهُ تَعَالٰی كَذَّبَنِيْ ابْنُ آدَمَ وَلَمْ يَكُنْ لَهُ ذٰلِكَ، وَشَتَمَنِيْ وَلَمْ يَكُنْ لَهُ ذٰلِكَ، فَأَمَّا تَكْذِيْبُهُ إِيَّايَ فَقَوْلُهُ : لَنْ يُعِيْدَنِيْ كَمَا بَدأَنِيْ، وَ لَيْسَ أَوَّلُ الْخَلْقِ بِأَهْوَنَ عَلَيَّ مِنْ إِعَادَتِهِ، وَ أَمَّا شَتْمُهُ إِيَّايَ فَقَوْلُهُ اتَّخَذَ اللّٰهُ وَلَدًا، وَأَنَا الْأَحَدُ الصَّمَدُ، لَمْ أَلِدْ وَلَمْ أُوْلَدْ، وَلَمْ يَكُنْ لِّيْ كُفُوًا أَحَدٌ ] [ بخاري، التفسیر، باب تفسیر سورۃ « قل ھو اللّٰہ أحد » : ۴۹۷۴، عن أبي ھریرۃ رضی اللہ عنہ ]’’ اللہ تعالیٰ فرماتا ہے، ابن آدم نے مجھے جھٹلایا حالانکہ یہ اس کا حق نہ تھا اور ابن آدم نے مجھے گالی دی حالانکہ یہ اس کا حق نہ تھا، اس کا مجھے جھٹلانا تو اس کا یہ کہنا ہے کہ جس طرح اس نے مجھے پہلے پیدا کیا دوبارہ پیدا نہیں کرے گا، حالانکہ مجھے پہلی دفعہ پیدا کرنا دوبارہ پیدا کرنے سے زیادہ آسان نہیں اور رہا اس کا مجھے گالی دینا، تو اس کا یہ کہنا ہے کہ اللہ نے اولاد بنا رکھی ہے، حالانکہ میں ایک ہوں، بے نیاز ہوں، نہ میں نے کسی کو جنا، نہ کسی نے مجھے جنا اور نہ ہی کبھی میرا کوئی ہمسر ہے۔‘‘"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) ➊ {فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ …:’’ جِثِيًّا ‘‘ ’’جَثَا يَجْثُوْ جُثُوًّا‘‘} اور {’’جَثَي يَجْثِيْ جُثِيًا‘‘} (ن، ض) سے اسم فاعل {’’جَاثٍ‘‘} ({اَلْجَاثِيْ} ) کی جمع ہے، گھٹنوں کے بل گرنے والے۔ قیامت کے منکروں کو اس کا یقین دلانے کے لیے قسم اٹھا کر فرمایا کہ تیرے رب کی قسم ہے کہ ہم انھیں اور ان کو گمراہ کرنے والے شیطانوں کو ضرور اکٹھا کریں گے۔ شیطانوں میں قرین بھی شامل ہیں (دیکھیے سورۂ ق : ۲۳) اور ابلیس کی اولاد اور انسانوںمیں سے گمراہ کرنے والے شیطان بھی۔ دیکھیے سورۂ انعام (۱۱۲) جہنم کے گرد ان کی حاضری کی تصویر دکھانے کے لیے فرمایا کہ وہ جہنم کے گرد نہایت ذلیل و خوار اور خوف زدہ ہو کر گھٹنوں کے بل گرے ہوں گے اور ان میں کھڑا ہونے کی طاقت نہیں ہوگی۔ دیکھیے سورۂ جاثیہ (۲۸)۔ ¤ ➋ ’’تیرے رب کی قسم‘‘ اس میں دو فائدے حاصل ہو رہے ہیں، ایک تو قسم کی وجہ سے بات کی تاکید، دوسرا رسول اللہ صلی اللہ علیہ وسلم کی شان کی رفعت، جیسا کہ سورۂ ذاریات کی آیت (۲۳) : « {فَوَرَبِّ السَّمَآءِ وَ الْاَرْضِ اِنَّهٗ لَحَقٌّ مِّثْلَ مَاۤ اَنَّكُمْ تَنْطِقُوْنَ} » سے آسمان و زمین کی عظمت ظاہر ہو رہی ہے۔ (طنطاوی)"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) { ثُمَّ لَنَنْزِعَنَّ مِنْ كُلِّ شِيْعَةٍ … : ’’ عِتِيًّا ‘‘ ’’عَتَا يَعْتُوْ‘‘ } سے {’’عُتُوًّا‘‘} کی طرح مصدر ہے، تکبر، سرکشی، حد سے گزرنا۔ {’’ شِيْعَةٍ ‘‘} وہ گروہ جو ایک ہی قسم کا ہو، یعنی پھر ہم ہر باغی گروہ میں سے اس کے سب سے بڑے سرکش اور پیشوا کو، جس نے انھیں کفر و شرک میں پھنسایا اور اللہ تعالیٰ کے مقابلے میں سرکشی کی راہ دکھائی، نکال کر الگ کھڑا کریں گے اور ایسے لوگوں کو سب سے پہلے جہنم میں جھونکیں گے، کیونکہ انھوں نے دو جرم کیے، خود بھی گمراہ ہوئے اور دوسروں کو بھی گمراہ کیا، پھر درجہ بدرجہ ان کے پیروکاروں کی باری آئے گی۔ دیکھیے سورۂ اعراف (۳۸، ۳۹)، نحل (۲۵) اور عنکبوت (۱۳)۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) {ثُمَّ لَنَحْنُ اَعْلَمُ بِالَّذِيْنَ هُمْ … : ’’ صِلِيًّا ‘‘ ’’صَلِيَ يَصْلٰي‘‘} بروزن {’’ رَضِيَ يَرْضَي‘‘} کا مصدر ہے، آگ میں داخل ہو کر اس کی تپش کی تکلیف اٹھانا، یعنی پھر ہمیں خوب معلوم ہے کہ اس جہنم میں جھونکے جانے کے زیادہ لائق کون ہے اور وہ گمراہ کرنے والے اور گمراہ ہونے والے دونوں ہیں، جیسا کہ دوسری جگہ فرمایا : «{ قَالَ لِكُلٍّ ضِعْفٌ وَّ لٰكِنْ لَّا تَعْلَمُوْنَ }» [ الأعراف : ۳۸ ] ’’اللہ فرمائے گا سبھی کے لیے دگنا (عذاب)ہے اور لیکن تم نہیں جانتے۔‘‘ کیونکہ گمراہ ہونے والوں نے بھی کئی لوگوں کو گمراہ کیا۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) {وَ اِنْ مِّنْكُمْ اِلَّا وَارِدُهَا … :} لغت کے اعتبار سے ’’وارد ہونے‘‘ کے معنی ’’داخل ہونا‘‘ اور ’’اوپر سے گزرنا‘‘ دونوں ہو سکتے ہیں، اس لیے ترجمہ ’’وارد ہونے والا‘‘ ہی کر دیا ہے۔ بعض مفسرین نے لکھا ہے کہ یہاں ’’وارد ہونے‘‘ سے مراد جسر (پل) سے گزرنا ہے، جسے بعض احادیث میں ’’صراط‘‘ بھی کہا گیا ہے۔ عام لوگوں نے فارسی اور عربی کو جمع کرکے اس کا نام ’’پل صراط‘‘ رکھ لیا ہے۔ یہ پل چونکہ جہنم کے اوپر رکھا جائے گا، اس لیے یہ جہنم پر سے گزرنا ہی ہے۔ متعدد صحیح احادیث سے ثابت ہے کہ ہر نیک و بد اور ہر کافر و مومن کو اس پل پر سے گزرنا پڑے گا۔ جن مفسرین نے اس کے معنی ’’داخل ہونا‘‘ کیے ہیں وہ کہتے ہیں کہ حدیث کے مطابق {’’تَحِلَّةَ الْقَسَمِ‘‘} یعنی قسم پوری کرنے کے لیے ہر مومن و کافر ایک مرتبہ جہنم میں داخل ہوگا، مگر مومنوں پر وہ آگ ٹھنڈی اور باعث رحمت بنا دی جائے گی۔ مگر پہلا معنی راجح ہے، اگر کسی حدیث میں لفظ ’’دخول‘‘ (داخل ہونا) آیا ہے تو صراط والی حدیث کے مطابق اس سے مراد بھی گزرنا ہے۔ اس معنی سے کتاب و سنت کے دلائل کے درمیان تطبیق ہو جاتی ہے۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) { ثُمَّ نُنَجِّي الَّذِيْنَ اتَّقَوْا …:} یعنی پھر ہم پرہیز گاروں کو جہنم سے بچا لیں گے (صراط سے سلامت گزار کر یا صراط سے جہنم میں گرنے کے بعد) اور کافروں کو ہمیشہ کے لیے اسی میں گرے ہوئے چھوڑ دیں گے۔ انبیاء، صدیقین، شہداء، صالحین اور عام مسلمان جہنم کے اوپر صراط سے اپنے اعمال کے مطابق تیزی سے یا گرتے پڑتے گزر جائیں گے اور کافر اور زیادہ گناہ گار مسلمان پل پر سے جہنم میں گر پڑیں گے، پھر اللہ تعالیٰ ایمان والوں کو سزا پوری ہونے کے بعد یا شفاعت سے یا محض اپنے فضل سے جہنم سے نکال لے گا اور صرف کافر ومشرک ہمیشہ آگ میں رہیں گے۔ اس کی دلیل ابوسعید خدری رضی اللہ عنہ کی حدیث ہے، جس میں رسول اللہ صلی اللہ علیہ وسلم نے آخرت میں رب تعالیٰ کو دیکھنے کا ذکر فرمایا، اس میں ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ ثُمَّ يُؤْتِي بِالْجَسْرِ فَيُجْعَلُ بَيْنَ ظَهْرَيْ جَهَنَّمَ، قُلْنَا يَا رَسُوْلَ اللّٰهِ ! وَمَا الْجَسْرُ؟ قالَ مَدْحَضَةٌ مَزِلَّةٌ عَلَيْهِ خَطَاطِيْفُ وَكَلاَلِيْبُ، وَحَسَكَةٌ مُفَلْطَحَةٌ لَهَا شَوْكَةٌ عَقِيْفَةٌ تَكُوْنُ بِنَجْدٍ، يُقَالُ لَهَا السَّعْدَانُ، الْمُؤْمِنُ عَلَيْهَا كَالطَّرْفِ وَكَالْبَرْقِ وَكَالرِّيْحِ وَكَأَجَاوِيْدِ الْخَيْلِ وَالرِّكَابِ، فَنَاجٍ مُسَلَّمٌ، وَنَاجٍ مَخْدُوْشٌ، وَمَكْدُوْسٌ فِيْ نَارِ جَهَنَّمَ، حَتّٰی يَمُرَّ آخِرُهُمْ يُسْحَبُ سَحْبًا، فَمَا أَنْتُمْ بِأَشَدَّ لِيْ مُنَاشَدَةً فِي الْحَقِّ، قَدْ تَبَيَّنَ لَكُمْ مِنَ ا الْمُؤْمِنِ يَوْمَئِذٍ لِلْجَبَّارِ، وَ إِذَا رَأَوْا أَنَّهُمْ قَدْ نَجَوْا فِيْ إِخْوَانِهِمْ يَقُوْلُوْنَ رَبَّنَا إِخْوَانُنَا كَانُوْا يُصَلُّوْنَ مَعَنَا وَيَصُوْمُوْنَ مَعَنَا وَيَعْمَلُوْنَ مَعَنَا، فَيَقُوْلُ اللّٰهُ تَعَالَی : اذْهَبُوْا فَمَنْ وَجَدْتُمْ فِيْ قَلْبِهِ مِثْقَالَ دِيْنَارٍ مِنْ إِيْمَانٍ فَأَخْرِجُوْهُ … فَيَشْفَعُ النَّبِيُّوْنَ وَالْمَلَائِكَةُ وَالْمُؤْمِنُوْنَ فَيَقُوْلُ الْجَبَّارُ بَقِيَتْ شَفَاعَتِيْ، فَيَقْبِضُ قَبْضَةً مِنَ النَّارِ فَيُخْرِجُ أَقْوَامًا قَدِ امْتُحِشُوْا ] [ بخاری، التوحید، باب : «وجوہ یومئذ ناضرۃ…» : ۷۴۳۹، عن أبي سعید الخدري رضی اللہ عنہ ] ’’پھر حسر (پل) کو لایا جائے گا اور اسے جہنم کے درمیان رکھ دیا جائے گا۔‘‘ ہم نے کہا : ’’یا رسول اللہ! اور وہ حسر (پل) کیا چیز ہے؟‘‘ آپ نے فرمایا : ’’وہ بہت پھسلانے والا ہے، اس پر کنڈے اور آنکڑے ہیں اور بہت چوڑے اونٹ کٹارے، جن میں مڑے ہوئے کانٹے ہیں، جو نجد میں ہوتے ہیں، انھیں سعدان کہتے ہیں، مومن اس پر سے نگاہ کی طرح اور بجلی کی طرح اور آندھی کی طرح اور بہترین گھڑ سواروں اور اونٹ کے سواروں کی طرح گزر جائیں گے، پھر کوئی صحیح سلامت بچ کر نکلنے والا ہو گا، کوئی زخمی ہو کر بچ نکلنے والا، کوئی جہنم کی آگ میں گرا دیا جانے والا، یہاں تک کہ ان کا آخری شخص گھسٹتا ہوا گزر جائے گا۔ تو تم مجھ سے اس حق کا جو تمھارے لیے ثابت ہو چکا ہو، اس سے زیادہ مطالبہ کرنے والے نہیں جس قدر مومن اپنے بھائیوں کے بارے میں اس دن جبار (اللہ تعالیٰ) سے مطالبہ کرے گا اور اس وقت جب وہ دیکھیں گے کہ وہ بچ نکلے ہیں، کہیں گے، اے ہمارے رب! ہمارے بھائی ہیں جو ہمارے ساتھ نماز پڑھتے تھے اور ہمارے ساتھ روزے رکھتے تھے اور ہمارے ساتھ عمل کرتے تھے، تو اللہ تعالیٰ فرمائے گا، جاؤ اور جسے پاؤ کہ اس کے دل میں دینار کے برابر ایمان ہے اسے نکال لو …(لمبی حدیث ہے جس میں نصف دینار کے برابر ایمان والوں کو، پھر ذرہ برابر ایمان والوں کو آگ سے نکالنے کا ذکر ہے) چنانچہ انبیاء، فرشتے اور مومن شفاعت کریں گے، پھر جبار فرمائے گا، میری شفاعت باقی رہ گئی تو وہ آگ میں سے ایک مٹھی بھرے گا اور ایسے لوگوں کو نکالے گا جو کوئلہ ہو چکے ہوں گے۔‘‘"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) {وَ اِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ … : ’’ مَقَامًا ‘‘} جائے قیام، یعنی ررہنے کی جگہ، گھر وغیرہ۔ {’’ نَدِيًّا ‘‘ ’’نَدَوْتُ الْقَوْمَ أَنْدُوْهُمْ‘‘ } (میں نے قوم کو جمع کیا) سے ہے۔ {’’اَلنَّادِيْ‘‘ ’’اَلنَّدِيُّ‘‘} اور {’’ اَلْمُنْتَدَي‘‘} کا معنی لوگوں کی مجلس، اکٹھے ہونے کی جگہ۔ کفار جب اللہ تعالیٰ کی واضح آیات سنتے اور ان کا حق ہونا اس قدر واضح ہوتا کہ وہ کسی صورت نہ ان کا جواب دے پاتے اور نہ غلط کہہ سکتے، تو اپنی برتری ثابت کرنے کے لیے اور اپنے آپ کو حق پر ثابت کرنے کے لیے دنیوی لحاظ سے کمزور ایمان والوں سے کہتے کہ اپنی حالت اور ہماری حالت دیکھو! کس کے رہنے کے مکانات بہتر اور کس کی مجلس زیادہ شان و شوکت والی اور سجی ہوئی ہے؟ گویا انھوں نے دنیوی سازو سامان اور شان و شوکت کو اپنے حق پر ہونے اور اللہ تعالیٰ کے ان پر راضی ہونے کی دلیل قرار دیا۔ قرآن مجید میں تمام انبیاء کے زمانے کے کفار کی یہی سوچ بیان ہوئی ہے۔ دیکھیے سورۂ احقاف (۱۱)، انعام (۵۳)، سبا (۳۵)، مومنون (۵۵، ۵۶)، مریم (۷۷)، کہف (۳۵، ۳۶) اور حم السجدہ (۵۰)۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) {وَ كَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍ …: ’’ اَثَاثًا ‘‘} گھر کا سازو سامان جس میں اونٹ، گھوڑے، بھیڑ بکریاں اور غلام وغیرہ بھی شامل ہیں۔ {’’ رِءْيًا ‘‘ ’’رَأَيَ يَرَي ‘‘} (ف) کا مصدر ہے، بمعنی مفعول یعنی دیکھنے کی چیزیں۔ مصدری معنی بھی ہو سکتا ہے، جیسا کہ ترجمہ میں کیا گیا ہے۔ یعنی جب نافرمانی کے بعد ان سے کہیں بڑھ کر سازو سامان اور شان و شوکت والوں کو ان کی دنیوی خوش حالی ہمارے عذاب سے نہ بچا سکی تو یہ بے چارے کس شمار و قطار میں ہیں؟ حقیقت میں دنیا کے ٹھاٹھ باٹ اور جاہ و جلال پر پھولنا اور نادار مسلمانوں کو حقیر جاننا پرلے درجے کی حماقت ہے۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) ➊ {قُلْ مَنْ كَانَ فِي الضَّلٰلَةِ …:} اس سوال کے جواب میں کہ ہم کفار سے کیا کہیں؟ حکم ہوا کہ ان سے کہو، آؤ ! مباہلہ کر لیں اور ہم تم دونوں مل کر اللہ تعالیٰ سے دعا کریں کہ ہم دونوں میں سے جو فریق گمراہی پر ہے اسے اللہ تعالیٰ ایک مدت تک مہلت دے اور اسے اس کی اسی حالت میں رکھے، تاکہ کفار جب اس استدراج اور مہلت کی وجہ سے کفر کی حالت میں فوت ہوں تو انھیں پتا چل جائے کہ کس کے رہنے کی جگہ بد ترین اور کس کا لشکر اور جتھا کمزور ترین ہے۔ اس تفسیر میں {’’فَلْيَمْدُدْ ‘‘ } کو اصل معنی ’’امر‘‘ پر رکھا گیا ہے۔ ابن کثیر اور ابن جریر نے صرف یہی تفسیر فرمائی ہے۔ قرآن مجید میں اس کی مثال سورۂ آل عمران کی آیت (۶۱) اور سورۂ بقرہ کی آیت (۹۴) ہے۔ (شنقیطی) ¤ ➋ دوسری تفسیر اس آیت کی یہ ہے کہ اس سوال کے جواب میں کہ ہم کفار کی اس دلیل کا کیا جواب دیں؟ حکم ہوا کہ ان سے کہو کہ جو لوگ گمراہی میں مبتلا ہیں اللہ تعالیٰ نے طے کر رکھا ہے کہ انھیں کچھ نہ کچھ مہلت دے، تاکہ ان پر حجت تمام ہو جائے۔ یہ نہ کہیں کہ ہمیں سوچنے کا وقت نہیں ملا۔ پھر جب دنیا ہی میں مسلمانوں کے ہاتھوں ذلیل و خوار ہوں گے، یا موت کے وقت اس عذاب کو دیکھیں گے جس کا ان سے وعدہ کیا جاتا رہا ہے، تو خود ہی اچھی طرح جائزہ لے لیں گے کہ کس کی رہنے کی جگہ زیادہ بری اور کس کا جتھا اور لشکر زیادہ کمزور ہے۔ آیت میں لفظ {’’ الرَّحْمٰنُ ‘‘} کی حکمت یہ ہے کہ گمراہوں کو مہلت دینا اللہ تعالیٰ کی بے انتہا رحمت کا تقاضا ہے کہ وہ اس مہلت سے فائدہ اٹھا کر کفر سے توبہ کر لیں۔ قرآن مجید میں کئی آیات میں یہ بات مختلف طریقوں سے بیان ہوئی ہے۔ دیکھیے سورۂ آل عمران (۱۷۸)، انعام (۴۴)، سبا (۱۷) اور قلم (۴۴، ۴۵) اس تفسیر کی صورت میں {’’ فَلْيَمْدُدْ لَهُ الرَّحْمٰنُ ‘‘} میں امر بمعنی خبر ہے۔ یہ معنی زیادہ قوی ہے، کیونکہ اس کے بعد والی آیت : «{ وَ يَزِيْدُ اللّٰهُ الَّذِيْنَ اهْتَدَوْا هُدًى }» میں فرمایا کہ جس طرح اللہ تعالیٰ کافروں کو ان کی گمراہی میں مہلت دیتا ہے اسی طرح ہدایت والوں کی ہدایت میں اضافہ کرتا چلا جاتا ہے۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76) ➊ {وَ يَزِيْدُ اللّٰهُ الَّذِيْنَ اهْتَدَوْا هُدًى:} یعنی جس طرح گمراہوں کو ڈھیل دیتا ہے اور وہ بدی کے راستے میں بڑھتے چلے جاتے ہیں اسی طرح ہدایت یافتہ لوگوں کو بھی مزید نیک کام کرنے کی توفیق دیتا جاتا ہے، جس سے وہ اس کی خوشنودی کے راستوں پر بڑھتے چلے جاتے ہیں۔ پھر ایمان کے بعد اخلاص کی دولت سے نوازنا بھی {’’زَادَهُمْ هُدًي‘‘} (انھیں ہدایت کی مزید توفیق دینا) میں داخل ہے۔ (کبیر) ¤ ➋ {وَ الْبٰقِيٰتُ الصّٰلِحٰتُ … :} اس کی تفسیر کے لیے دیکھیے سورۂ کہف کی آیت (۴۶)۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77) {اَفَرَءَيْتَ الَّذِيْ كَفَرَ بِاٰيٰتِنَا …:} اوپر کی آیات میں حشر کے یقینی ہونے کے دلائل بیان فرمائے اور کفار کے شبہات کا جواب دیا تھا، اب ان لوگوں کا قول نقل فرمایا جو حشر میں طعن کرتے ہوئے اس کا مذاق اڑاتے تھے۔ صحیحین میں ہے، خباب بن ارت رضی اللہ عنہ بیان کرتے ہیں : [كُنْتُ قَيْنًا فِي الْجَاهِلِيَّةِ وَكَانَ لِيْ عَلَی الْعَاصِ بْنِ وَائِلٍ دَيْنٌ فَأَتَيْتُهُ أَتَقَاضَاهٗ، قَالَ : لاَ أُعْطِيْكَ حَتّٰی تَكْفُرَ بِمُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ لاَ أَكْفُرُ حَتّٰی يُمِيْتَكَ اللّٰهُ ثُمَّ تُبْعَثثَ، قَالَ دَعْنِيْ حَتّٰی أَمُوْتَ وَ أُبْعَثَ فَسَأُوْتیٰ مَالًا وَوَلدًا فَأَقْضِيْكَ فَنَزَلَتْ : «{ اَفَرَءَيْتَ الَّذِيْ كَفَرَ بِاٰيٰتِنَا وَ قَالَ لَاُوْتَيَنَّ مَالًا وَّ وَلَدًا (77) اَطَّلَعَ الْغَيْبَ اَمِ اتَّخَذَ عِنْدَ الرَّحْمٰنِ عَهْدًا }»] [بخاری، البیوع، باب ذکر الفین والحداد : ۲۰۹۱۔ مسلم، : ۳۵، 2795/36 ] ’’میں زمانۂ جاہلیت میں لوہار کا کام کیا کرتا تھا اور میرا عاص بن وائل (ایک مال دار کافر) پر کچھ قرض تھا۔ میں (ایک دن) تقاضے کے لیے اس کے پاس گیا، وہ کہنے لگا : ’’میں تمھارا قرض اس وقت تک ادا نہیں کروں گا جب تک تم محمد( صلی اللہ علیہ وسلم ) کی رسالت سے انکار نہ کرو۔‘‘ خباب رضی اللہ عنہ نے کہا : ’’اللہ کی قسم! میں (محمد صلی اللہ علیہ وسلم کی رسالت سے) ہر گز انکار نہیں کروں گا، یہاں تک کہ اللہ تجھے موت دے، پھر دوبارہ زندہ کرے۔‘‘ کافر کہنے لگا : ’’جب میں مر کر دوبارہ زندہ ہوں گا تو تم میرے پاس آنا، اس وقت میرے پاس خوب مال بھی ہو گا اور اولاد بھی، میں تمھارا قرض ادا کروں گا۔‘‘ اس پر اللہ تعالیٰ نے یہ (چار آیات {’’ فَرْدًا ‘‘} تک) نازل فرمائیں۔‘‘ اس واقعہ میں کفار کا قیامت سے مذاق کی صورت میں انکار کرنا بھی ہے اور اس کے خیال میں بالفرض قائم ہونے کی صورت میں دنیا پر قیاس کرتے ہوئے وہاں بھی مال و اولاد ملنے کے یقین کا اظہار بھی ہے۔ ایک ہی سانس میں اللہ تعالیٰ کے قیامت قائم کرنے پر قادر ہونے سے انکار ہے اور اسی سانس میں قیامت کے دن اسے مال و اولاد دینے پر قادر ہونے کا اظہار ہے۔ مشرک ایسے ہی جاہل ہوتے ہیں۔ یہاں چونکہ زیادہ نمایاں قیامت کے دن دنیا کی طرح مال و اولاد ملنے کے یقین کا اظہار ہے، اس لیے اس سے پہلے آیات (۷۳، ۷۴) میں اس کا رد کیا ہے، اب مزید تین آیات میں اس کا رد فرمایا ہے۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) { اَطَّلَعَ الْغَيْبَ اَمِ اتَّخَذَ … :} یعنی یہ بات تو ’’کہ وہ جنت میں جائے گا اور خوب مال و دولت پائے گا‘‘ وہی کرسکتا ہے جس نے غیب پر اطلاع پائی ہو، یا اس بے حد رحم والی ذات پاک سے کوئی عہد لے رکھا ہو جس نے اپنی بے حد رحمت کی بنا پر اپنے فرماں بردار بندوں سے انعام کا عہد کر رکھا ہے۔ ظاہر ہے کہ علم غیب جب پوری مخلوق میں سے کسی کے پاس نہیں تو اسے کیسے حاصل ہو گیا؟ رہا قیامت کے دن نعمتوں کا عہد، تو وہ رحمت کے حق داروں ہی سے ہے، جو ایمان دار ہیں۔ دیکھیے سورۂ بقرہ (۲۱۸) اس کافر سے وہ عہد کب اور کیسے ہوا؟"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79) ➊ {’’ كَلَّا ‘‘} یہ لفظ انکار اور ڈانٹ کے لیے آتا ہے، یعنی یہ دونوں باتیں ہر گز نہیں ہیں، تو پھر ایک ہی بات رہ جاتی ہے کہ اس نے اپنے پاس سے ایک جھوٹی بات اللہ تعالیٰ کے ذمے لگا دی ہے۔ یہاں سورۂ مریم میں اس تیسری بات کا ذکر نہیں، کیونکہ اس سے پہلے سورۂ بقرہ میں یہود کے دعوے کی تردید کرتے ہوئے یہ بات گزر چکی ہے اور قرآن کی آیات ایک دوسری کی تفسیر کرتی ہیں، فرمایا : «{ وَ قَالُوْا لَنْ تَمَسَّنَا النَّارُ اِلَّاۤ اَيَّامًا مَّعْدُوْدَةً قُلْ اَتَّخَذْتتُمْ عِنْدَ اللّٰهِ عَهْدًا فَلَنْ يُّخْلِفَ اللّٰهُ عَهْدَهٗۤ اَمْ تَقُوْلُوْنَ عَلَى اللّٰهِ مَا لَا تَعْلَمُوْنَ }» [ البقرۃ : ۸۰ ] ’’اور انھوں نے کہا ہمیں آگ ہر گز نہیں چھوئے گی مگر گنے ہوئے چند دن۔کہہ دے کیا تم نے اللہ کے پاس کوئی عہد لے رکھا ہے؟ تو اللہ کبھی اپنے عہد کے خلاف نہیں کرے گا، یا تم اللہ پر وہ بات کہتے ہو جو تم نہیں جانتے۔‘‘ (شنقیطی) ¤ ➋ { وَ نَمُدُّ لَهٗ مِنَ الْعَذَابِ مَدًّا :} یعنی ہم اسے کئی گنا زیادہ عذاب دیں گے، ایک عذاب کفر کا، ایک استہزا اور مذاق اڑانے کا، ایک اللہ کی راہ سے روکنے کا، ایک دوسروں کو کفر کی راہ پر لگانے کا، ایک فساد پھیلانے کا۔ مزید دیکھیے سورۂ نحل (۸۸)، اعراف (۳۸) اور عنکبوت (۱۳) اسی طرح دنیا میں بھی مال و اولاد اور ہر قسم کی زیب و زینت کے ذریعے سے اسے عذاب دیں گے، پھر موت اور آخرت میں مزید عذاب دیں گے، فرمایا : «{ اِنَّمَا يُرِيْدُ اللّٰهُ اَنْ يُّعَذِّبَهُمْ بِبِهَا فِي الدُّنْيَا }» [ التوبۃ : ۸۵ ] ’’اللہ تو یہی چاہتا ہے کہ انھیں ان (اموال و اولاد) کے ذریعے سے دنیا میں سزا دے اور ان کی جانیں اس حال میں نکلیں کہ وہ کافر ہوں۔‘‘"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) ➊ {وَ نَرِثُهٗ مَا يَقُوْلُ:} یعنی جس مال و اولاد پر یہ فخر کر رہا ہے اس کے ہلاک ہونے کے بعد ان سب کے وارث ہم بنیں گے، جیسا کہ اسی سورت میں ارشاد فرمایا : «{ اِنَّا نَحْنُ نَرِثُ الْاَرْضَ وَ مَنْ عَلَيْهَا وَ اِلَيْنَا يُرْجَعُوْنَ }» [ مریم : ۴۰ ] ’’بے شک ہم، ہم ہی اس زمین کے وارث ہوں گے اور ان کے بھی جو اس پر ہیں اور وہ ہماری ہی طرف لوٹائے جائیں گے۔‘‘ ¤ ➋ {وَ يَاْتِيْنَا فَرْدًا :} یعنی قیامت کے دن جب ہمارے پاس آئے گا تو اس کے ساتھ نہ اولاد ہو گی، نہ مال اور نہ کوئی جتھا۔ دیکھیے سورۂ انعام (۹۴)۔"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) {وَ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اٰلِهَةً … :} حشر و نشر کے بیان کے بعد اب ان کے بنائے ہوئے معبودوں کی نفی ہے، خواہ انسان ہوں یا فرشتے یا جن یا بت یا آستانے یا قبریں۔ یعنی اللہ کے سوا انھوں نے اس لیے معبود بنا رکھے ہیں کہ ضرورت اور حاجت کے وقت اللہ تعالیٰ سے سفارش کرکے کام کروا سکیں، مصیبت کے وقت اللہ تعالیٰ سے کہہ کر اسے ٹال دیں، یا وہ موت اور قیامت کے وقت ان کو عذاب سے بچا لیں اور اس طرح وہ ان کے لیے قوت و عزت کا باعث بن جائیں، جیسا کہ اللہ تعالیٰ نے سورۂ یونس (۱۸) اور سورۂ زمر (۳) میں مشرکین کا یہی عقیدہ بیان فرمایا ہے، حالانکہ اللہ تعالیٰ کی اجازت کے بغیر کوئی سفارش کر ہی نہیں سکتا اور نہ کر سکے گا، آیت الکرسی میں ہے : «{ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗۤ اِلَّا بِاِذْنِهٖ }» [ البقرۃ : ۲۵۵ ] ’’کون ہے وہ جو اس کے پاس اس کی اجازت کے بغیر سفارش کر سکے؟‘‘"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) ➊ { كَلَّا سَيَكْفُرُوْنَ بِعِبَادَتِهِمْ :} انکار اس معنی میں کریں گے کہ وہ کہیں گے، ہم نے کبھی ان سے نہیں کہا تھا کہ ہماری عبادت کرو، یا ہمیں مصیبت کے وقت پکارو اور نہ ہمیں یہ خبر تھی کہ وہ ہماری عبادت کر رہے ہیں۔ اللہ تعالیٰ نے یہ بات کئی جگہ بیان فرمائی ہے۔ دیکھیے سورۂ یونس (۲۸، ۲۹)، نحل (۸۶)، قصص (۶۳)، فاطر (۱۳، ۱۴) اور احقاف (۵، ۶) اسی طرح کفار بھی اپنے معبودوں کی عبادت سے مکر جائیں گے اور ان کے خلاف ہو جائیں گے، بلکہ قسم کھا کر کہیں گے کہ اللہ کی قسم! ہم مشرک نہیں تھے۔ دیکھیے سورۂ انعام (۲۳) بلکہ وہ اور ان کے معبود ایک دوسرے کو لعنت کریں گے۔ دیکھیے عنکبوت (۲۵) اور سورۂ بقرہ (۱۶۶، ۱۶۷)۔ ¤ ➋ {وَ يَكُوْنُوْنَ عَلَيْهِمْ ضِدًّا : } یعنی بجائے اس کے کہ وہ ان کے لیے بچاؤ یا عزت کا سبب بنیں، الٹا ان کی پکڑ کا سبب بنیں گے اور قیامت کے دن ان کے شدید مخالف اور ان کے لیے باعث حسرت ہوں گے۔ بے شمار معبودوں کے لیے {’’ ضِدًّا ‘‘} واحد کا لفظ استعمال فرمایا، کیونکہ {’’ ضِدًّا ‘‘} کا لفظ مصدر ہے، جو واحد و جمع اور مذکر و مؤنث سب کے لیے استعمال ہوتا ہے۔ بعض مفسرین نے فرمایا کہ ان پوجنے والوں کے خلاف ان کے معبودوں کے اتحاد و اتفاق کی وجہ سے ان کو {’’شَيْءٌ وَاحِدٌ‘‘} (ایک ہی چیز) فرض کرکے واحد کا صیغہ لایا گیا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے تمام مسلمانوں کے متعلق فرمایا : [ وَ هُمْ يَدٌ عَلٰی مَنْ سِوَاهُمْ ] [ أبوداوٗد، الدیات، باب أیُقاد المسلم من الکافر؟ : ۴۵۳۰۔ نسائی : ۴۷۳۸۔ صحیح الجامع : ۶۶۶۶ ] ’’وہ اپنے سوا سب کے مقابلے میں ایک ہاتھ ہوتے ہیں۔‘‘"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) { اَلَمْ تَرَ اَنَّاۤ اَرْسَلْنَا الشَّيٰطِيْنَ …:’’ اَزًّا ‘‘} قاموس میں ہے :{ ’’ أَزَّ يَئِزُّ ‘‘} اور {’’ اَزَّ يَؤُزُّ اَزًّا ‘‘ } (ض، ن)){ ’’ أَزَّ الشَّيْءَ ‘‘ } اس نے کسی چیز کو سخت حرکت دی۔ {’’ اَزَّ النَّارَ ‘‘} اس نے آگ کو بھڑکایا۔ {’’ اَزَّتِ الْقِدْرُ ‘‘} ہانڈی سخت ابلنے لگی۔ {’’أَزِيْزٌ كَأَزِيْزِ الْمِرْجَلِ‘‘} ہانڈی ابلنے جیسی آواز۔ یعنی کیا تمھیں معلوم نہیں کہ کافر لوگ جنھوں نے طے کر رکھا ہے کہ انھوں نے کسی صورت حق کو تسلیم نہیں کرنا، ہم نے ان پر شیاطین کو مسلط کر دیا ہے، جو انھیں برائی پر شدت سے ابھارتے رہتے ہیں اور انھیں گناہوں کی آگ میں اس طرح مسلسل جھونکے رکھتے ہیں کہ وہ اسی پیچ و تاب میں ہانڈی کی طرح ابلتے اور شعلوں کی طرح بھڑکتے رہتے ہیں۔ (بقاعی) اس آیت کی ہم معنی اور وضاحت کرنے والی آیات کے لیے دیکھیے سورۂ زخرف (۳۶، ۳۷)، حم السجدہ (۲۵)، اعراف (۲۰۲) اور بنی اسرائیل (۶۴)۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84) ➊ { فَلَا تَعْجَلْ عَلَيْهِمْ :} یعنی ایسا نہ کریں کہ جس طرح وہ شیاطین کے ابھارنے سے برائیوں میں جلدی کرتے ہیں کہ آپ بھی ان پر جلدی عذاب لانے کا مطالبہ کرنے لگیں، بلکہ صبر اور حوصلے سے انتظار کریں اور ان پر حجت پوری ہونے دیں۔ دیکھیے سورۂ احقاف (۳۵) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلتَّأَنِّيْ مِنَ اللّٰهِ وَالْعَجَلَةُ مِنَ الشَّيْطَانِ  ] [ مسند أبی یعلٰی : ۴۲۵۶۔ السنن الکبرٰی للبیہقی : ۲۰۷۶۷۔ سلسلۃ الأحادیث صحیحۃ : 294/4،ح:۱۷۹۵، عن أنس رضی اللہ عنہ ] ’’اناۃ (بردباری، وقار، آہستہ روی) اللہ کی طرف سے ہے اور جلد بازی شیطان کی طرف سے ہے۔‘‘ ¤ ➋ { اِنَّمَا نَعُدُّ لَهُمْ عَدًّا:} آدمی کے اطمینان، صبر و ثبات اور خوشی کے لیے اس سے بڑھ کر کوئی چیز نہیں ہو سکتی کہ اس کا سب سے زیادہ قوت والا مددگار مسلسل اس کے دشمن کی نگرانی کر رہا ہو اور نہ دشمن کے لیے اس سے بڑھ کر کوئی چیز پریشان کن ہو سکتی ہے۔ فرمایا، ہم تو بس ان کو دی ہوئی مہلت کا ایک ایک سانس گن رہے ہیں اور گنی ہوئی چیز نے آخر ختم ہونا ہے، پھر یہ کسی صورت بچ نہیں سکیں گے، تو پھر جلدی کیسی؟ دیکھیے سورۂ ہود (۸) روزوں کے جلدی گزرنے کی وجہ بھی {’’ اَيَّامًا مَّعْدُوْدَةٍ ‘‘} فرمائی۔ بعض سلف یہ آیت پڑھتے تو روتے اور کہتے کہ گنتی ختم ہونے کا نتیجہ تیری جان کا نکلنا ہے، تیرا قبر میں داخل ہونا اور تیرا اہل و عیال سے جدا ہونا ہے۔ ایک اور بزرگ نے فرمایا، ہر سانس جو تجھے زندگی بخش رہا ہے تیری زندگی کے سانسوں کی گنتی کم کرتا جا رہا ہے، پھر اس شخص کی زندگی کا کیا حال ہے جسے زندہ رکھنے والی چیز ہی اس کی زندگی کے زوال کا باعث ہے۔ ایک شاعر نے کیا خوب کہا ہے: ¤ {إِنَّ الْحَبِيْبَ مِنَ الْأَحْبَابِ مُخْتَلَسٌ ¤ لاَ يَمْنَعُ الْمَوْتَ بَوَّابٌ وَلَا حَرَسُ ¤ وَكَيْفَ يَفْرَحُ بِالدُّنْيَا وَلَذَّتِهَا ¤¤ فَتًي يُعَدُّ عَلَيْهِ اللَّفْظُ وَالنَّفَسُ} ¤ ’’ہر دوست اپنے دوستوں سے اچانک چھین لیا جانے والا ہے۔ موت کو کوئی دربان روک سکتا ہے نہ کوئی پہرے دار۔ دنیا اور اس کی لذت کے ساتھ کیسے خوش ہو سکتا ہے وہ جوان جس کا ایک ایک لفظ اور سانس گنا جا رہا ہو۔‘‘ (روح المعانی)"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 86،85) {يَوْمَ نَحْشُرُ الْمُتَّقِيْنَ … : ’’ وَفْدًا ‘‘ ’’وَافِدٌ‘‘} کی جمع ہے۔ {’’وَفَدَ يَفِدُ وَفْدًا وَ وُفُوْدًا‘‘ } بروزن {’’وَعَدَ يَعِددُ ‘‘} کسی کے پاس جانا۔ وفد چند آدمیوں کی جماعت کو کہتے ہیں جو کسی اہم کام کے لیے یا کوئی عطیہ حاصل کرنے کے لیے کسی بادشاہ یا بڑی شخصیت کے پاس جائے۔ {’’ نَسُوْقُ ‘‘ ’’سَاقَ يَسُوْقُ سَوْقًا‘‘} بروزن {’’قَالَ يَقُوْلُ‘‘} جانوروں کو ہانکنا۔ بعض اوقات کسی کو بھی چلانے کے معنی میں آ جاتا ہے، جیسا کہ فرمایا : «{ وَ سِيْقَ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ اِلَى الْجَنَّةِ زُمَرًا }» [ الزمر : ۷۳ ] ’’اور وہ لوگ جو اپنے رب سے ڈر گئے، گروہ در گروہ جنت کی طرف لے جائے جائیں گے۔‘‘ {’’ الْمُجْرِمِيْنَ ‘‘} جرم وہ گناہ جسے کرنے والا سزا کا حق دار ہو۔ {’’وِرْدًا ‘‘ ’’وَارِدٌ‘‘ } کی جمع ہے۔ {’’وَرَدَ يَرِدُ وُرُوْدًا‘‘ } پانی پینے کے لیے جانا، چونکہ اس مقصد کے لیے پیاسا ہی جاتا ہے، اس لیے {’’وِرْدًا‘‘} کا معنی ’’پیاسے‘‘ ہے۔ ان آیات میں متقین اور مجرمین کا انجام بیان ہوا ہے۔ پہلی آیت میں رحمان کی طرف جانے کا ذکر فرمایا، جنت وغیرہ کا ذکر نہیں فرمایا، یعنی متقی لوگ رحمان کے معزز مہمان بن کر جائیں گے۔ دنیا میں شاہی مہمانوں کے قدم زمین پر نہیں ٹکتے، اس دن بے حد و بے انتہا رحم والے، شاہوں کے شاہ کے معزز مہمانوں کے اعزاز و اکرام کا اندازہ کون کر سکتا ہے؟ دوسری آیت میں جہنم کا ذکر ہے، رحمان کا ذکر نہیں۔ کیونکہ آخر دم تک جرم سے باز نہ آنے والے مجرم اس رحمان کے کسی رحم کے مستحق نہیں جو زمین و آسمان سے بھی زیادہ گناہوں کو سچے دل سے معافی کی ایک درخواست پر معاف کر دیتا ہے۔ سورۂ زمر (۷۱ تا ۷۳) میں متقین اور کفار کے اس مرحلے کا تفصیل سے ذکر آیا ہے۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86،85) {يَوْمَ نَحْشُرُ الْمُتَّقِيْنَ … : ’’ وَفْدًا ‘‘ ’’وَافِدٌ‘‘} کی جمع ہے۔ {’’وَفَدَ يَفِدُ وَفْدًا وَ وُفُوْدًا‘‘ } بروزن {’’وَعَدَ يَعِددُ ‘‘} کسی کے پاس جانا۔ وفد چند آدمیوں کی جماعت کو کہتے ہیں جو کسی اہم کام کے لیے یا کوئی عطیہ حاصل کرنے کے لیے کسی بادشاہ یا بڑی شخصیت کے پاس جائے۔ {’’ نَسُوْقُ ‘‘ ’’سَاقَ يَسُوْقُ سَوْقًا‘‘} بروزن {’’قَالَ يَقُوْلُ‘‘} جانوروں کو ہانکنا۔ بعض اوقات کسی کو بھی چلانے کے معنی میں آ جاتا ہے، جیسا کہ فرمایا : «{ وَ سِيْقَ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ اِلَى الْجَنَّةِ زُمَرًا }» [ الزمر : ۷۳ ] ’’اور وہ لوگ جو اپنے رب سے ڈر گئے، گروہ در گروہ جنت کی طرف لے جائے جائیں گے۔‘‘ {’’ الْمُجْرِمِيْنَ ‘‘} جرم وہ گناہ جسے کرنے والا سزا کا حق دار ہو۔ {’’وِرْدًا ‘‘ ’’وَارِدٌ‘‘ } کی جمع ہے۔ {’’وَرَدَ يَرِدُ وُرُوْدًا‘‘ } پانی پینے کے لیے جانا، چونکہ اس مقصد کے لیے پیاسا ہی جاتا ہے، اس لیے {’’وِرْدًا‘‘} کا معنی ’’پیاسے‘‘ ہے۔ ان آیات میں متقین اور مجرمین کا انجام بیان ہوا ہے۔ پہلی آیت میں رحمان کی طرف جانے کا ذکر فرمایا، جنت وغیرہ کا ذکر نہیں فرمایا، یعنی متقی لوگ رحمان کے معزز مہمان بن کر جائیں گے۔ دنیا میں شاہی مہمانوں کے قدم زمین پر نہیں ٹکتے، اس دن بے حد و بے انتہا رحم والے، شاہوں کے شاہ کے معزز مہمانوں کے اعزاز و اکرام کا اندازہ کون کر سکتا ہے؟ دوسری آیت میں جہنم کا ذکر ہے، رحمان کا ذکر نہیں۔ کیونکہ آخر دم تک جرم سے باز نہ آنے والے مجرم اس رحمان کے کسی رحم کے مستحق نہیں جو زمین و آسمان سے بھی زیادہ گناہوں کو سچے دل سے معافی کی ایک درخواست پر معاف کر دیتا ہے۔ سورۂ زمر (۷۱ تا ۷۳) میں متقین اور کفار کے اس مرحلے کا تفصیل سے ذکر آیا ہے۔"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) {لَا يَمْلِكُوْنَ الشَّفَاعَةَ اِلَّا مَنِ اتَّخَذَ …:} یعنی شفاعت کا حق دار وہ ہو گا جسے رحمان کے ہاں عہد نجات حاصل ہو۔ اس عہد سے مراد کلمۂ شہادت کا اقرار ہے۔ یہ تفسیر ابن عباس اور ابن مسعود رضی اللہ عنھم سے ثابت ہے۔ (ابن کثیر مع حاشیہ حکمت بن بشیر) ایک حدیث میں پنجگانہ نماز کی پابندی کو بھی عہد قرار دیا گیا ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْعَهْدُ الَّذِيْ بَيْنَنَا وَبَيْنَهُمُ الصَّلَاةُ فَمَنْ تَرَكَهَا فَقَدْ كَفَرَ ] [ مسند أحمد : 346/5، ح : ۲۳۰۰۱۔ ترمذي : ۲۶۲۱۔ ابن ماجہ : ۱۰۷۹، عن بریدۃ رضی اللہ عنہ و صححہ الألباني ] ’’وہ عہد جو ہمارے اور ان (مشرکین) کے درمیان ہے نماز ہے، جس نے اسے ترک کر دیا تو وہ بلاشبہ کافر ہو گیا۔‘‘ معلوم ہوا کہ کبیرہ گناہوں کے مرتکب ایمان والوں کی تو شفاعت ہو گی مگر کافر کی کوئی شفاعت نہیں کر سکے گا۔ پس {’’ لَا يَمْلِكُوْنَ الشَّفَاعَةَ ‘‘} کے معنی یہ ہیں کہ شفاعت کے مستحق صرف وہی لوگ ہوں گے جنھوں نے رحمان کے ہاں عہد حاصل کر رکھا ہے، کفار نہیں۔ اس معنی کی شاہد کئی آیات ہیں۔ دیکھیے سورۂ مدثر (۴۸)، شعراء (۱۰۰، ۱۰۱)، مومن (۱۸)، انبیاء (۲۸) اور دوسری آیات۔ اس سے معلوم ہوا کہ جب مجرمین کے حق میں کوئی شفاعت نہیں کر سکے گا تو وہ خود دوسروں کے حق میں شفاعت کا اختیار بالاولیٰ نہیں رکھیں گے۔ دوسرا مطلب آیت کا یہ ہے کہ شفاعت کا اختیار صرف اسی کو ہو گا جس کو اللہ تعالیٰ شفاعت کی اجازت دے گا، کوئی نبی یا فرشتہ اپنی مرضی سے کسی کی شفاعت نہیں کر سکے گا، فرمایا : «{مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗۤ اِلَّا بِاِذْنِهٖ }» [ البقرۃ : ۲۵۵ ] ’’کون ہے وہ جو اس کے پاس اس کی اجازت کے بغیر سفارش کرے۔‘‘ اس آیت میں تمام مشرکین کو خبردار کر دیا گیا ہے کہ مشرک بت پرست ہوں یا قبر پرست، زندہ پرست ہوں یا مردہ پرست، ہر قسم کی شفاعت سے محروم رہیں گے۔ گویا یہ {’’ لِيَكُوَنُوْا لَهُمْ عِزًّا ‘‘ } کا جواب ہے۔ (کبیر، شوکانی، شنقیطی)"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88تا95) ➊ پہلی آیات سے مناسبت یہ ہے کہ جب شفاعت کی نفی فرمائی اور سب سے بڑھ کر شفاعت کی حق دار اولاد ہوتی ہے، اس لیے ان لوگوں نے اللہ تعالیٰ کی اولاد قرار دے رکھی تھی، تو اللہ تعالیٰ نے ان کی بات کی نفی فرمائی، تاکہ خاص و عام ہر سفارشی کی نفی ہو جائے اور ہر اس عزت کی نفی ہو جائے جس کے حصول کا باعث وہ اپنے معبودوں کو سمجھتے تھے۔ (بقاعی) ¤ ➋ { وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا :} اللہ تعالیٰ نے ان کا قول نقل کرتے ہوئے ساتھ ہی اس کے باطل ہونے کی دلیل بھی ذکر فرما دی کہ وہ کہتے ہیں کہ اس رحمان نے اولاد بنا رکھی ہے جس کی بے پناہ رحمت سے ساری کائنات وجود میں آئی ہے اور ہر چیز اپنی بقا کے لیے اسی کی محتاج ہے، جبکہ وہ کسی کا محتاج نہیں، سب اس کے محتاج ہیں، فرمایا : « يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ» [ فاطر : ۱۵ ] ’’اے لوگو! تم ہی اللہ کی طرف محتاج ہو اور اللہ ہی سب سے بے پروا، تمام تعریفوں کے لائق ہے۔‘‘ بیٹا باپ کا محتاج نہیں ہوتا، بلکہ باپ اپنی کمزوری کی وجہ سے اولاد کا محتاج ہوتا ہے اور جس عقیدے، یعنی مسیح کو کفارہ بنانے کے لیے اسے اللہ کا بیٹا قرار دیا ہے، اللہ تعالیٰ کو رحمان ماننے کے بعد اس کی ضرورت ہی نہیں رہتی۔ ¤ ➌ یہود عزیر علیہ السلام کو اور نصاریٰ مسیح علیہ السلام کو اللہ تعالیٰ کا بیٹا کہتے تھے اور مشرکین عرب فرشتوں کو اللہ  کی بیٹیاں کہتے تھے، جبکہ امت مسلمہ کے کئی نادان رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی ذات پاک کا جزو قرار دیتے ہیں۔ ¤ ➍ { لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا …:} اس سے پہلے اللہ تعالیٰ کے لیے اولاد قرار دینے والوں کا ذکر غغائب کے صیغے کے ساتھ تھا، اس آیت میں اللہ تعالیٰ نے شدت غضب میں ان ظالموں کو مخاطب فرما کر بات کی اور تاکید کے دو لفظوں {’’لام‘‘} اور {’’قَدْ‘‘} کے ساتھ، جن کے جمع ہونے سے قسم کا مفہوم پیدا ہو جاتا ہے، فرمایا قسم ہے کہ تم ایک بہت ہی بھاری بات تک آ پہنچے ہو، جو اس قدر خوفناک اور بھاری ہے کہ قریب ہے کہ اللہ تعالیٰ کی عظمت کے تصور اور اس بات کے بوجھ سے {’’سَبْعٌ شِدَادٌ‘‘} یعنی ساتوں نہایت مضبوط آسمان پھٹ پڑیں، یہ وسیع اور محکم زمین شق ہو جائے اور انتہائی ٹھوس اور سخت پہاڑ مٹی کی بوسیدہ دیوار کی طرح ڈھے کر گر پڑیں کہ ان لوگوں نے (یہاں پھر نفرت سے مشرکوں کا ذکر غائب کے صیغے کے ساتھ کیا ہے) رحمن کے لیے اولاد کا دعویٰ کر دیا، حالانکہ رحمان کے لائق ہی نہیں کہ وہ (کسی کو بھی، خواہ پیغمبر ہو یا فرشتہ) اولاد بنائے۔ قوسین کے الفاظ مفعول اول ہیں جو محذوف ہیں، {’’وَلَدًا‘‘} مفعول ثانی ہے، یعنی اس کی اولاد ہونا ناممکن اور محال ہے، اس لیے کہ اولاد ہم جنس ہوتی ہے اور اللہ کا کوئی ہم جنس نہیں۔ پھر اولاد کمزوری میں سہارے کے لیے ہوتی ہے، جبکہ اللہ تعالیٰ ہر کمزوری سے پاک اور اپنی ذات و صفات میں ہر ایک سے بے نیاز ہے۔ وہ ہمیشہ سے عزیز و غالب ہے اور ہمیشہ عزیز و غالب رہے گا۔ دیکھیے سورۂ بنی اسرائیل کی آخری آیت کی تفسیر۔ اس کے علاوہ اولاد بیوی سے ہوتی ہے اور خاوند بیوی کا محتاج ہوتا ہے، جب اللہ کی بیوی ہی نہیں اور وہ کسی کا محتاج ہی نہیں تو اولاد کیسی؟ فرمایا : «{ اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ }» [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی، جبکہ اس کی کوئی بیوی نہیں۔‘‘ ¤ ➎ { اٰتِي الرَّحْمٰنِ عَبْدًا :} آسمان و زمین میں جو بھی ہے اس کا غلام بن کر حاضر ہونے والا ہے۔ اگر کوئی اولاد ہوتی تو غلام کیسے ہوتی؟ ¤ ➏ { لَقَدْ اَحْصٰىهُمْ وَ عَدَّهُمْ عَدًّا :} اللہ تعالیٰ نے سب کا احاطہ کر رکھا ہے، ایک ایک اس کے شمار میں ہے اور سب اکیلے اکیلے اس کے پاس آنے والے ہیں، اگر زمین و آسمان میں کوئی بھی اس کی اولاد ہوتا تو یقینا اسے معلوم ہوتا۔ کیا تم اللہ سے بھی زیادہ باخبر ہو، فرمایا : «{ قُلْ اَتُنَبِّـُٔوْنَ اللّٰهَ بِمَا لَا يَعْلَمُ فِي السَّمٰوٰتِ وَ لَا فِي الْاَرْضِ }» [ یونس : ۱۸ ] ’’کہہ دے کیا تم اللہ کو اس چیز کی خبر دیتے ہو جسے وہ نہ آسمانوں میں جانتا ہے اور نہ زمین میں؟ ‘‘ نیز دیکھیے سورۂ یونس (۶۸)، بنی اسرائیل (۴۰) اور نجم (۱۹ تا ۲۲) ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ أَحَدٌ أَصْبَرَ عَلٰی أَذًی سَمِعَهٗ مِنَ اللّٰهِ إِنَّهُمْ لَيَدْعُوْنَ لَهٗ وَلَدًا وَ إِنَّهٗ لَيُعَافِيْهِمْ وَيَرْزُقُهُمْ ] [ بخاری، الأدب، باب الصبر في الأذی : ۶۰۹۹ ] ’’اللہ تعالیٰ سے زیادہ تکلیف دہ بات پر صبر کرنے والا، جسے وہ سن رہا ہو اور کوئی نہیں۔ لوگ اس کے لیے اولاد بتاتے ہیں اور وہ (اس کے باوجود) انھیں عافیت دیتا ہے اور رزق دیتا ہے۔‘‘"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 88تا95) ➊ پہلی آیات سے مناسبت یہ ہے کہ جب شفاعت کی نفی فرمائی اور سب سے بڑھ کر شفاعت کی حق دار اولاد ہوتی ہے، اس لیے ان لوگوں نے اللہ تعالیٰ کی اولاد قرار دے رکھی تھی، تو اللہ تعالیٰ نے ان کی بات کی نفی فرمائی، تاکہ خاص و عام ہر سفارشی کی نفی ہو جائے اور ہر اس عزت کی نفی ہو جائے جس کے حصول کا باعث وہ اپنے معبودوں کو سمجھتے تھے۔ (بقاعی) ¤ ➋ { وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا :} اللہ تعالیٰ نے ان کا قول نقل کرتے ہوئے ساتھ ہی اس کے باطل ہونے کی دلیل بھی ذکر فرما دی کہ وہ کہتے ہیں کہ اس رحمان نے اولاد بنا رکھی ہے جس کی بے پناہ رحمت سے ساری کائنات وجود میں آئی ہے اور ہر چیز اپنی بقا کے لیے اسی کی محتاج ہے، جبکہ وہ کسی کا محتاج نہیں، سب اس کے محتاج ہیں، فرمایا : « يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ» [ فاطر : ۱۵ ] ’’اے لوگو! تم ہی اللہ کی طرف محتاج ہو اور اللہ ہی سب سے بے پروا، تمام تعریفوں کے لائق ہے۔‘‘ بیٹا باپ کا محتاج نہیں ہوتا، بلکہ باپ اپنی کمزوری کی وجہ سے اولاد کا محتاج ہوتا ہے اور جس عقیدے، یعنی مسیح کو کفارہ بنانے کے لیے اسے اللہ کا بیٹا قرار دیا ہے، اللہ تعالیٰ کو رحمان ماننے کے بعد اس کی ضرورت ہی نہیں رہتی۔ ¤ ➌ یہود عزیر علیہ السلام کو اور نصاریٰ مسیح علیہ السلام کو اللہ تعالیٰ کا بیٹا کہتے تھے اور مشرکین عرب فرشتوں کو اللہ  کی بیٹیاں کہتے تھے، جبکہ امت مسلمہ کے کئی نادان رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی ذات پاک کا جزو قرار دیتے ہیں۔ ¤ ➍ { لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا …:} اس سے پہلے اللہ تعالیٰ کے لیے اولاد قرار دینے والوں کا ذکر غغائب کے صیغے کے ساتھ تھا، اس آیت میں اللہ تعالیٰ نے شدت غضب میں ان ظالموں کو مخاطب فرما کر بات کی اور تاکید کے دو لفظوں {’’لام‘‘} اور {’’قَدْ‘‘} کے ساتھ، جن کے جمع ہونے سے قسم کا مفہوم پیدا ہو جاتا ہے، فرمایا قسم ہے کہ تم ایک بہت ہی بھاری بات تک آ پہنچے ہو، جو اس قدر خوفناک اور بھاری ہے کہ قریب ہے کہ اللہ تعالیٰ کی عظمت کے تصور اور اس بات کے بوجھ سے {’’سَبْعٌ شِدَادٌ‘‘} یعنی ساتوں نہایت مضبوط آسمان پھٹ پڑیں، یہ وسیع اور محکم زمین شق ہو جائے اور انتہائی ٹھوس اور سخت پہاڑ مٹی کی بوسیدہ دیوار کی طرح ڈھے کر گر پڑیں کہ ان لوگوں نے (یہاں پھر نفرت سے مشرکوں کا ذکر غائب کے صیغے کے ساتھ کیا ہے) رحمن کے لیے اولاد کا دعویٰ کر دیا، حالانکہ رحمان کے لائق ہی نہیں کہ وہ (کسی کو بھی، خواہ پیغمبر ہو یا فرشتہ) اولاد بنائے۔ قوسین کے الفاظ مفعول اول ہیں جو محذوف ہیں، {’’وَلَدًا‘‘} مفعول ثانی ہے، یعنی اس کی اولاد ہونا ناممکن اور محال ہے، اس لیے کہ اولاد ہم جنس ہوتی ہے اور اللہ کا کوئی ہم جنس نہیں۔ پھر اولاد کمزوری میں سہارے کے لیے ہوتی ہے، جبکہ اللہ تعالیٰ ہر کمزوری سے پاک اور اپنی ذات و صفات میں ہر ایک سے بے نیاز ہے۔ وہ ہمیشہ سے عزیز و غالب ہے اور ہمیشہ عزیز و غالب رہے گا۔ دیکھیے سورۂ بنی اسرائیل کی آخری آیت کی تفسیر۔ اس کے علاوہ اولاد بیوی سے ہوتی ہے اور خاوند بیوی کا محتاج ہوتا ہے، جب اللہ کی بیوی ہی نہیں اور وہ کسی کا محتاج ہی نہیں تو اولاد کیسی؟ فرمایا : «{ اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ }» [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی، جبکہ اس کی کوئی بیوی نہیں۔‘‘ ¤ ➎ { اٰتِي الرَّحْمٰنِ عَبْدًا :} آسمان و زمین میں جو بھی ہے اس کا غلام بن کر حاضر ہونے والا ہے۔ اگر کوئی اولاد ہوتی تو غلام کیسے ہوتی؟ ¤ ➏ { لَقَدْ اَحْصٰىهُمْ وَ عَدَّهُمْ عَدًّا :} اللہ تعالیٰ نے سب کا احاطہ کر رکھا ہے، ایک ایک اس کے شمار میں ہے اور سب اکیلے اکیلے اس کے پاس آنے والے ہیں، اگر زمین و آسمان میں کوئی بھی اس کی اولاد ہوتا تو یقینا اسے معلوم ہوتا۔ کیا تم اللہ سے بھی زیادہ باخبر ہو، فرمایا : «{ قُلْ اَتُنَبِّـُٔوْنَ اللّٰهَ بِمَا لَا يَعْلَمُ فِي السَّمٰوٰتِ وَ لَا فِي الْاَرْضِ }» [ یونس : ۱۸ ] ’’کہہ دے کیا تم اللہ کو اس چیز کی خبر دیتے ہو جسے وہ نہ آسمانوں میں جانتا ہے اور نہ زمین میں؟ ‘‘ نیز دیکھیے سورۂ یونس (۶۸)، بنی اسرائیل (۴۰) اور نجم (۱۹ تا ۲۲) ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ أَحَدٌ أَصْبَرَ عَلٰی أَذًی سَمِعَهٗ مِنَ اللّٰهِ إِنَّهُمْ لَيَدْعُوْنَ لَهٗ وَلَدًا وَ إِنَّهٗ لَيُعَافِيْهِمْ وَيَرْزُقُهُمْ ] [ بخاری، الأدب، باب الصبر في الأذی : ۶۰۹۹ ] ’’اللہ تعالیٰ سے زیادہ تکلیف دہ بات پر صبر کرنے والا، جسے وہ سن رہا ہو اور کوئی نہیں۔ لوگ اس کے لیے اولاد بتاتے ہیں اور وہ (اس کے باوجود) انھیں عافیت دیتا ہے اور رزق دیتا ہے۔‘‘"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت 88تا95) ➊ پہلی آیات سے مناسبت یہ ہے کہ جب شفاعت کی نفی فرمائی اور سب سے بڑھ کر شفاعت کی حق دار اولاد ہوتی ہے، اس لیے ان لوگوں نے اللہ تعالیٰ کی اولاد قرار دے رکھی تھی، تو اللہ تعالیٰ نے ان کی بات کی نفی فرمائی، تاکہ خاص و عام ہر سفارشی کی نفی ہو جائے اور ہر اس عزت کی نفی ہو جائے جس کے حصول کا باعث وہ اپنے معبودوں کو سمجھتے تھے۔ (بقاعی) ¤ ➋ { وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا :} اللہ تعالیٰ نے ان کا قول نقل کرتے ہوئے ساتھ ہی اس کے باطل ہونے کی دلیل بھی ذکر فرما دی کہ وہ کہتے ہیں کہ اس رحمان نے اولاد بنا رکھی ہے جس کی بے پناہ رحمت سے ساری کائنات وجود میں آئی ہے اور ہر چیز اپنی بقا کے لیے اسی کی محتاج ہے، جبکہ وہ کسی کا محتاج نہیں، سب اس کے محتاج ہیں، فرمایا : « يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ» [ فاطر : ۱۵ ] ’’اے لوگو! تم ہی اللہ کی طرف محتاج ہو اور اللہ ہی سب سے بے پروا، تمام تعریفوں کے لائق ہے۔‘‘ بیٹا باپ کا محتاج نہیں ہوتا، بلکہ باپ اپنی کمزوری کی وجہ سے اولاد کا محتاج ہوتا ہے اور جس عقیدے، یعنی مسیح کو کفارہ بنانے کے لیے اسے اللہ کا بیٹا قرار دیا ہے، اللہ تعالیٰ کو رحمان ماننے کے بعد اس کی ضرورت ہی نہیں رہتی۔ ¤ ➌ یہود عزیر علیہ السلام کو اور نصاریٰ مسیح علیہ السلام کو اللہ تعالیٰ کا بیٹا کہتے تھے اور مشرکین عرب فرشتوں کو اللہ  کی بیٹیاں کہتے تھے، جبکہ امت مسلمہ کے کئی نادان رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی ذات پاک کا جزو قرار دیتے ہیں۔ ¤ ➍ { لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا …:} اس سے پہلے اللہ تعالیٰ کے لیے اولاد قرار دینے والوں کا ذکر غغائب کے صیغے کے ساتھ تھا، اس آیت میں اللہ تعالیٰ نے شدت غضب میں ان ظالموں کو مخاطب فرما کر بات کی اور تاکید کے دو لفظوں {’’لام‘‘} اور {’’قَدْ‘‘} کے ساتھ، جن کے جمع ہونے سے قسم کا مفہوم پیدا ہو جاتا ہے، فرمایا قسم ہے کہ تم ایک بہت ہی بھاری بات تک آ پہنچے ہو، جو اس قدر خوفناک اور بھاری ہے کہ قریب ہے کہ اللہ تعالیٰ کی عظمت کے تصور اور اس بات کے بوجھ سے {’’سَبْعٌ شِدَادٌ‘‘} یعنی ساتوں نہایت مضبوط آسمان پھٹ پڑیں، یہ وسیع اور محکم زمین شق ہو جائے اور انتہائی ٹھوس اور سخت پہاڑ مٹی کی بوسیدہ دیوار کی طرح ڈھے کر گر پڑیں کہ ان لوگوں نے (یہاں پھر نفرت سے مشرکوں کا ذکر غائب کے صیغے کے ساتھ کیا ہے) رحمن کے لیے اولاد کا دعویٰ کر دیا، حالانکہ رحمان کے لائق ہی نہیں کہ وہ (کسی کو بھی، خواہ پیغمبر ہو یا فرشتہ) اولاد بنائے۔ قوسین کے الفاظ مفعول اول ہیں جو محذوف ہیں، {’’وَلَدًا‘‘} مفعول ثانی ہے، یعنی اس کی اولاد ہونا ناممکن اور محال ہے، اس لیے کہ اولاد ہم جنس ہوتی ہے اور اللہ کا کوئی ہم جنس نہیں۔ پھر اولاد کمزوری میں سہارے کے لیے ہوتی ہے، جبکہ اللہ تعالیٰ ہر کمزوری سے پاک اور اپنی ذات و صفات میں ہر ایک سے بے نیاز ہے۔ وہ ہمیشہ سے عزیز و غالب ہے اور ہمیشہ عزیز و غالب رہے گا۔ دیکھیے سورۂ بنی اسرائیل کی آخری آیت کی تفسیر۔ اس کے علاوہ اولاد بیوی سے ہوتی ہے اور خاوند بیوی کا محتاج ہوتا ہے، جب اللہ کی بیوی ہی نہیں اور وہ کسی کا محتاج ہی نہیں تو اولاد کیسی؟ فرمایا : «{ اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ }» [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی، جبکہ اس کی کوئی بیوی نہیں۔‘‘ ¤ ➎ { اٰتِي الرَّحْمٰنِ عَبْدًا :} آسمان و زمین میں جو بھی ہے اس کا غلام بن کر حاضر ہونے والا ہے۔ اگر کوئی اولاد ہوتی تو غلام کیسے ہوتی؟ ¤ ➏ { لَقَدْ اَحْصٰىهُمْ وَ عَدَّهُمْ عَدًّا :} اللہ تعالیٰ نے سب کا احاطہ کر رکھا ہے، ایک ایک اس کے شمار میں ہے اور سب اکیلے اکیلے اس کے پاس آنے والے ہیں، اگر زمین و آسمان میں کوئی بھی اس کی اولاد ہوتا تو یقینا اسے معلوم ہوتا۔ کیا تم اللہ سے بھی زیادہ باخبر ہو، فرمایا : «{ قُلْ اَتُنَبِّـُٔوْنَ اللّٰهَ بِمَا لَا يَعْلَمُ فِي السَّمٰوٰتِ وَ لَا فِي الْاَرْضِ }» [ یونس : ۱۸ ] ’’کہہ دے کیا تم اللہ کو اس چیز کی خبر دیتے ہو جسے وہ نہ آسمانوں میں جانتا ہے اور نہ زمین میں؟ ‘‘ نیز دیکھیے سورۂ یونس (۶۸)، بنی اسرائیل (۴۰) اور نجم (۱۹ تا ۲۲) ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ أَحَدٌ أَصْبَرَ عَلٰی أَذًی سَمِعَهٗ مِنَ اللّٰهِ إِنَّهُمْ لَيَدْعُوْنَ لَهٗ وَلَدًا وَ إِنَّهٗ لَيُعَافِيْهِمْ وَيَرْزُقُهُمْ ] [ بخاری، الأدب، باب الصبر في الأذی : ۶۰۹۹ ] ’’اللہ تعالیٰ سے زیادہ تکلیف دہ بات پر صبر کرنے والا، جسے وہ سن رہا ہو اور کوئی نہیں۔ لوگ اس کے لیے اولاد بتاتے ہیں اور وہ (اس کے باوجود) انھیں عافیت دیتا ہے اور رزق دیتا ہے۔‘‘"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت 88تا95) ➊ پہلی آیات سے مناسبت یہ ہے کہ جب شفاعت کی نفی فرمائی اور سب سے بڑھ کر شفاعت کی حق دار اولاد ہوتی ہے، اس لیے ان لوگوں نے اللہ تعالیٰ کی اولاد قرار دے رکھی تھی، تو اللہ تعالیٰ نے ان کی بات کی نفی فرمائی، تاکہ خاص و عام ہر سفارشی کی نفی ہو جائے اور ہر اس عزت کی نفی ہو جائے جس کے حصول کا باعث وہ اپنے معبودوں کو سمجھتے تھے۔ (بقاعی) ¤ ➋ { وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا :} اللہ تعالیٰ نے ان کا قول نقل کرتے ہوئے ساتھ ہی اس کے باطل ہونے کی دلیل بھی ذکر فرما دی کہ وہ کہتے ہیں کہ اس رحمان نے اولاد بنا رکھی ہے جس کی بے پناہ رحمت سے ساری کائنات وجود میں آئی ہے اور ہر چیز اپنی بقا کے لیے اسی کی محتاج ہے، جبکہ وہ کسی کا محتاج نہیں، سب اس کے محتاج ہیں، فرمایا : « يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ» [ فاطر : ۱۵ ] ’’اے لوگو! تم ہی اللہ کی طرف محتاج ہو اور اللہ ہی سب سے بے پروا، تمام تعریفوں کے لائق ہے۔‘‘ بیٹا باپ کا محتاج نہیں ہوتا، بلکہ باپ اپنی کمزوری کی وجہ سے اولاد کا محتاج ہوتا ہے اور جس عقیدے، یعنی مسیح کو کفارہ بنانے کے لیے اسے اللہ کا بیٹا قرار دیا ہے، اللہ تعالیٰ کو رحمان ماننے کے بعد اس کی ضرورت ہی نہیں رہتی۔ ¤ ➌ یہود عزیر علیہ السلام کو اور نصاریٰ مسیح علیہ السلام کو اللہ تعالیٰ کا بیٹا کہتے تھے اور مشرکین عرب فرشتوں کو اللہ  کی بیٹیاں کہتے تھے، جبکہ امت مسلمہ کے کئی نادان رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی ذات پاک کا جزو قرار دیتے ہیں۔ ¤ ➍ { لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا …:} اس سے پہلے اللہ تعالیٰ کے لیے اولاد قرار دینے والوں کا ذکر غغائب کے صیغے کے ساتھ تھا، اس آیت میں اللہ تعالیٰ نے شدت غضب میں ان ظالموں کو مخاطب فرما کر بات کی اور تاکید کے دو لفظوں {’’لام‘‘} اور {’’قَدْ‘‘} کے ساتھ، جن کے جمع ہونے سے قسم کا مفہوم پیدا ہو جاتا ہے، فرمایا قسم ہے کہ تم ایک بہت ہی بھاری بات تک آ پہنچے ہو، جو اس قدر خوفناک اور بھاری ہے کہ قریب ہے کہ اللہ تعالیٰ کی عظمت کے تصور اور اس بات کے بوجھ سے {’’سَبْعٌ شِدَادٌ‘‘} یعنی ساتوں نہایت مضبوط آسمان پھٹ پڑیں، یہ وسیع اور محکم زمین شق ہو جائے اور انتہائی ٹھوس اور سخت پہاڑ مٹی کی بوسیدہ دیوار کی طرح ڈھے کر گر پڑیں کہ ان لوگوں نے (یہاں پھر نفرت سے مشرکوں کا ذکر غائب کے صیغے کے ساتھ کیا ہے) رحمن کے لیے اولاد کا دعویٰ کر دیا، حالانکہ رحمان کے لائق ہی نہیں کہ وہ (کسی کو بھی، خواہ پیغمبر ہو یا فرشتہ) اولاد بنائے۔ قوسین کے الفاظ مفعول اول ہیں جو محذوف ہیں، {’’وَلَدًا‘‘} مفعول ثانی ہے، یعنی اس کی اولاد ہونا ناممکن اور محال ہے، اس لیے کہ اولاد ہم جنس ہوتی ہے اور اللہ کا کوئی ہم جنس نہیں۔ پھر اولاد کمزوری میں سہارے کے لیے ہوتی ہے، جبکہ اللہ تعالیٰ ہر کمزوری سے پاک اور اپنی ذات و صفات میں ہر ایک سے بے نیاز ہے۔ وہ ہمیشہ سے عزیز و غالب ہے اور ہمیشہ عزیز و غالب رہے گا۔ دیکھیے سورۂ بنی اسرائیل کی آخری آیت کی تفسیر۔ اس کے علاوہ اولاد بیوی سے ہوتی ہے اور خاوند بیوی کا محتاج ہوتا ہے، جب اللہ کی بیوی ہی نہیں اور وہ کسی کا محتاج ہی نہیں تو اولاد کیسی؟ فرمایا : «{ اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ }» [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی، جبکہ اس کی کوئی بیوی نہیں۔‘‘ ¤ ➎ { اٰتِي الرَّحْمٰنِ عَبْدًا :} آسمان و زمین میں جو بھی ہے اس کا غلام بن کر حاضر ہونے والا ہے۔ اگر کوئی اولاد ہوتی تو غلام کیسے ہوتی؟ ¤ ➏ { لَقَدْ اَحْصٰىهُمْ وَ عَدَّهُمْ عَدًّا :} اللہ تعالیٰ نے سب کا احاطہ کر رکھا ہے، ایک ایک اس کے شمار میں ہے اور سب اکیلے اکیلے اس کے پاس آنے والے ہیں، اگر زمین و آسمان میں کوئی بھی اس کی اولاد ہوتا تو یقینا اسے معلوم ہوتا۔ کیا تم اللہ سے بھی زیادہ باخبر ہو، فرمایا : «{ قُلْ اَتُنَبِّـُٔوْنَ اللّٰهَ بِمَا لَا يَعْلَمُ فِي السَّمٰوٰتِ وَ لَا فِي الْاَرْضِ }» [ یونس : ۱۸ ] ’’کہہ دے کیا تم اللہ کو اس چیز کی خبر دیتے ہو جسے وہ نہ آسمانوں میں جانتا ہے اور نہ زمین میں؟ ‘‘ نیز دیکھیے سورۂ یونس (۶۸)، بنی اسرائیل (۴۰) اور نجم (۱۹ تا ۲۲) ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ أَحَدٌ أَصْبَرَ عَلٰی أَذًی سَمِعَهٗ مِنَ اللّٰهِ إِنَّهُمْ لَيَدْعُوْنَ لَهٗ وَلَدًا وَ إِنَّهٗ لَيُعَافِيْهِمْ وَيَرْزُقُهُمْ ] [ بخاری، الأدب، باب الصبر في الأذی : ۶۰۹۹ ] ’’اللہ تعالیٰ سے زیادہ تکلیف دہ بات پر صبر کرنے والا، جسے وہ سن رہا ہو اور کوئی نہیں۔ لوگ اس کے لیے اولاد بتاتے ہیں اور وہ (اس کے باوجود) انھیں عافیت دیتا ہے اور رزق دیتا ہے۔‘‘"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت 88تا95) ➊ پہلی آیات سے مناسبت یہ ہے کہ جب شفاعت کی نفی فرمائی اور سب سے بڑھ کر شفاعت کی حق دار اولاد ہوتی ہے، اس لیے ان لوگوں نے اللہ تعالیٰ کی اولاد قرار دے رکھی تھی، تو اللہ تعالیٰ نے ان کی بات کی نفی فرمائی، تاکہ خاص و عام ہر سفارشی کی نفی ہو جائے اور ہر اس عزت کی نفی ہو جائے جس کے حصول کا باعث وہ اپنے معبودوں کو سمجھتے تھے۔ (بقاعی) ¤ ➋ { وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا :} اللہ تعالیٰ نے ان کا قول نقل کرتے ہوئے ساتھ ہی اس کے باطل ہونے کی دلیل بھی ذکر فرما دی کہ وہ کہتے ہیں کہ اس رحمان نے اولاد بنا رکھی ہے جس کی بے پناہ رحمت سے ساری کائنات وجود میں آئی ہے اور ہر چیز اپنی بقا کے لیے اسی کی محتاج ہے، جبکہ وہ کسی کا محتاج نہیں، سب اس کے محتاج ہیں، فرمایا : « يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ» [ فاطر : ۱۵ ] ’’اے لوگو! تم ہی اللہ کی طرف محتاج ہو اور اللہ ہی سب سے بے پروا، تمام تعریفوں کے لائق ہے۔‘‘ بیٹا باپ کا محتاج نہیں ہوتا، بلکہ باپ اپنی کمزوری کی وجہ سے اولاد کا محتاج ہوتا ہے اور جس عقیدے، یعنی مسیح کو کفارہ بنانے کے لیے اسے اللہ کا بیٹا قرار دیا ہے، اللہ تعالیٰ کو رحمان ماننے کے بعد اس کی ضرورت ہی نہیں رہتی۔ ¤ ➌ یہود عزیر علیہ السلام کو اور نصاریٰ مسیح علیہ السلام کو اللہ تعالیٰ کا بیٹا کہتے تھے اور مشرکین عرب فرشتوں کو اللہ  کی بیٹیاں کہتے تھے، جبکہ امت مسلمہ کے کئی نادان رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی ذات پاک کا جزو قرار دیتے ہیں۔ ¤ ➍ { لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا …:} اس سے پہلے اللہ تعالیٰ کے لیے اولاد قرار دینے والوں کا ذکر غغائب کے صیغے کے ساتھ تھا، اس آیت میں اللہ تعالیٰ نے شدت غضب میں ان ظالموں کو مخاطب فرما کر بات کی اور تاکید کے دو لفظوں {’’لام‘‘} اور {’’قَدْ‘‘} کے ساتھ، جن کے جمع ہونے سے قسم کا مفہوم پیدا ہو جاتا ہے، فرمایا قسم ہے کہ تم ایک بہت ہی بھاری بات تک آ پہنچے ہو، جو اس قدر خوفناک اور بھاری ہے کہ قریب ہے کہ اللہ تعالیٰ کی عظمت کے تصور اور اس بات کے بوجھ سے {’’سَبْعٌ شِدَادٌ‘‘} یعنی ساتوں نہایت مضبوط آسمان پھٹ پڑیں، یہ وسیع اور محکم زمین شق ہو جائے اور انتہائی ٹھوس اور سخت پہاڑ مٹی کی بوسیدہ دیوار کی طرح ڈھے کر گر پڑیں کہ ان لوگوں نے (یہاں پھر نفرت سے مشرکوں کا ذکر غائب کے صیغے کے ساتھ کیا ہے) رحمن کے لیے اولاد کا دعویٰ کر دیا، حالانکہ رحمان کے لائق ہی نہیں کہ وہ (کسی کو بھی، خواہ پیغمبر ہو یا فرشتہ) اولاد بنائے۔ قوسین کے الفاظ مفعول اول ہیں جو محذوف ہیں، {’’وَلَدًا‘‘} مفعول ثانی ہے، یعنی اس کی اولاد ہونا ناممکن اور محال ہے، اس لیے کہ اولاد ہم جنس ہوتی ہے اور اللہ کا کوئی ہم جنس نہیں۔ پھر اولاد کمزوری میں سہارے کے لیے ہوتی ہے، جبکہ اللہ تعالیٰ ہر کمزوری سے پاک اور اپنی ذات و صفات میں ہر ایک سے بے نیاز ہے۔ وہ ہمیشہ سے عزیز و غالب ہے اور ہمیشہ عزیز و غالب رہے گا۔ دیکھیے سورۂ بنی اسرائیل کی آخری آیت کی تفسیر۔ اس کے علاوہ اولاد بیوی سے ہوتی ہے اور خاوند بیوی کا محتاج ہوتا ہے، جب اللہ کی بیوی ہی نہیں اور وہ کسی کا محتاج ہی نہیں تو اولاد کیسی؟ فرمایا : «{ اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ }» [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی، جبکہ اس کی کوئی بیوی نہیں۔‘‘ ¤ ➎ { اٰتِي الرَّحْمٰنِ عَبْدًا :} آسمان و زمین میں جو بھی ہے اس کا غلام بن کر حاضر ہونے والا ہے۔ اگر کوئی اولاد ہوتی تو غلام کیسے ہوتی؟ ¤ ➏ { لَقَدْ اَحْصٰىهُمْ وَ عَدَّهُمْ عَدًّا :} اللہ تعالیٰ نے سب کا احاطہ کر رکھا ہے، ایک ایک اس کے شمار میں ہے اور سب اکیلے اکیلے اس کے پاس آنے والے ہیں، اگر زمین و آسمان میں کوئی بھی اس کی اولاد ہوتا تو یقینا اسے معلوم ہوتا۔ کیا تم اللہ سے بھی زیادہ باخبر ہو، فرمایا : «{ قُلْ اَتُنَبِّـُٔوْنَ اللّٰهَ بِمَا لَا يَعْلَمُ فِي السَّمٰوٰتِ وَ لَا فِي الْاَرْضِ }» [ یونس : ۱۸ ] ’’کہہ دے کیا تم اللہ کو اس چیز کی خبر دیتے ہو جسے وہ نہ آسمانوں میں جانتا ہے اور نہ زمین میں؟ ‘‘ نیز دیکھیے سورۂ یونس (۶۸)، بنی اسرائیل (۴۰) اور نجم (۱۹ تا ۲۲) ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ أَحَدٌ أَصْبَرَ عَلٰی أَذًی سَمِعَهٗ مِنَ اللّٰهِ إِنَّهُمْ لَيَدْعُوْنَ لَهٗ وَلَدًا وَ إِنَّهٗ لَيُعَافِيْهِمْ وَيَرْزُقُهُمْ ] [ بخاری، الأدب، باب الصبر في الأذی : ۶۰۹۹ ] ’’اللہ تعالیٰ سے زیادہ تکلیف دہ بات پر صبر کرنے والا، جسے وہ سن رہا ہو اور کوئی نہیں۔ لوگ اس کے لیے اولاد بتاتے ہیں اور وہ (اس کے باوجود) انھیں عافیت دیتا ہے اور رزق دیتا ہے۔‘‘"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت 88تا95) ➊ پہلی آیات سے مناسبت یہ ہے کہ جب شفاعت کی نفی فرمائی اور سب سے بڑھ کر شفاعت کی حق دار اولاد ہوتی ہے، اس لیے ان لوگوں نے اللہ تعالیٰ کی اولاد قرار دے رکھی تھی، تو اللہ تعالیٰ نے ان کی بات کی نفی فرمائی، تاکہ خاص و عام ہر سفارشی کی نفی ہو جائے اور ہر اس عزت کی نفی ہو جائے جس کے حصول کا باعث وہ اپنے معبودوں کو سمجھتے تھے۔ (بقاعی) ¤ ➋ { وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا :} اللہ تعالیٰ نے ان کا قول نقل کرتے ہوئے ساتھ ہی اس کے باطل ہونے کی دلیل بھی ذکر فرما دی کہ وہ کہتے ہیں کہ اس رحمان نے اولاد بنا رکھی ہے جس کی بے پناہ رحمت سے ساری کائنات وجود میں آئی ہے اور ہر چیز اپنی بقا کے لیے اسی کی محتاج ہے، جبکہ وہ کسی کا محتاج نہیں، سب اس کے محتاج ہیں، فرمایا : « يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ» [ فاطر : ۱۵ ] ’’اے لوگو! تم ہی اللہ کی طرف محتاج ہو اور اللہ ہی سب سے بے پروا، تمام تعریفوں کے لائق ہے۔‘‘ بیٹا باپ کا محتاج نہیں ہوتا، بلکہ باپ اپنی کمزوری کی وجہ سے اولاد کا محتاج ہوتا ہے اور جس عقیدے، یعنی مسیح کو کفارہ بنانے کے لیے اسے اللہ کا بیٹا قرار دیا ہے، اللہ تعالیٰ کو رحمان ماننے کے بعد اس کی ضرورت ہی نہیں رہتی۔ ¤ ➌ یہود عزیر علیہ السلام کو اور نصاریٰ مسیح علیہ السلام کو اللہ تعالیٰ کا بیٹا کہتے تھے اور مشرکین عرب فرشتوں کو اللہ  کی بیٹیاں کہتے تھے، جبکہ امت مسلمہ کے کئی نادان رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی ذات پاک کا جزو قرار دیتے ہیں۔ ¤ ➍ { لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا …:} اس سے پہلے اللہ تعالیٰ کے لیے اولاد قرار دینے والوں کا ذکر غغائب کے صیغے کے ساتھ تھا، اس آیت میں اللہ تعالیٰ نے شدت غضب میں ان ظالموں کو مخاطب فرما کر بات کی اور تاکید کے دو لفظوں {’’لام‘‘} اور {’’قَدْ‘‘} کے ساتھ، جن کے جمع ہونے سے قسم کا مفہوم پیدا ہو جاتا ہے، فرمایا قسم ہے کہ تم ایک بہت ہی بھاری بات تک آ پہنچے ہو، جو اس قدر خوفناک اور بھاری ہے کہ قریب ہے کہ اللہ تعالیٰ کی عظمت کے تصور اور اس بات کے بوجھ سے {’’سَبْعٌ شِدَادٌ‘‘} یعنی ساتوں نہایت مضبوط آسمان پھٹ پڑیں، یہ وسیع اور محکم زمین شق ہو جائے اور انتہائی ٹھوس اور سخت پہاڑ مٹی کی بوسیدہ دیوار کی طرح ڈھے کر گر پڑیں کہ ان لوگوں نے (یہاں پھر نفرت سے مشرکوں کا ذکر غائب کے صیغے کے ساتھ کیا ہے) رحمن کے لیے اولاد کا دعویٰ کر دیا، حالانکہ رحمان کے لائق ہی نہیں کہ وہ (کسی کو بھی، خواہ پیغمبر ہو یا فرشتہ) اولاد بنائے۔ قوسین کے الفاظ مفعول اول ہیں جو محذوف ہیں، {’’وَلَدًا‘‘} مفعول ثانی ہے، یعنی اس کی اولاد ہونا ناممکن اور محال ہے، اس لیے کہ اولاد ہم جنس ہوتی ہے اور اللہ کا کوئی ہم جنس نہیں۔ پھر اولاد کمزوری میں سہارے کے لیے ہوتی ہے، جبکہ اللہ تعالیٰ ہر کمزوری سے پاک اور اپنی ذات و صفات میں ہر ایک سے بے نیاز ہے۔ وہ ہمیشہ سے عزیز و غالب ہے اور ہمیشہ عزیز و غالب رہے گا۔ دیکھیے سورۂ بنی اسرائیل کی آخری آیت کی تفسیر۔ اس کے علاوہ اولاد بیوی سے ہوتی ہے اور خاوند بیوی کا محتاج ہوتا ہے، جب اللہ کی بیوی ہی نہیں اور وہ کسی کا محتاج ہی نہیں تو اولاد کیسی؟ فرمایا : «{ اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ }» [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی، جبکہ اس کی کوئی بیوی نہیں۔‘‘ ¤ ➎ { اٰتِي الرَّحْمٰنِ عَبْدًا :} آسمان و زمین میں جو بھی ہے اس کا غلام بن کر حاضر ہونے والا ہے۔ اگر کوئی اولاد ہوتی تو غلام کیسے ہوتی؟ ¤ ➏ { لَقَدْ اَحْصٰىهُمْ وَ عَدَّهُمْ عَدًّا :} اللہ تعالیٰ نے سب کا احاطہ کر رکھا ہے، ایک ایک اس کے شمار میں ہے اور سب اکیلے اکیلے اس کے پاس آنے والے ہیں، اگر زمین و آسمان میں کوئی بھی اس کی اولاد ہوتا تو یقینا اسے معلوم ہوتا۔ کیا تم اللہ سے بھی زیادہ باخبر ہو، فرمایا : «{ قُلْ اَتُنَبِّـُٔوْنَ اللّٰهَ بِمَا لَا يَعْلَمُ فِي السَّمٰوٰتِ وَ لَا فِي الْاَرْضِ }» [ یونس : ۱۸ ] ’’کہہ دے کیا تم اللہ کو اس چیز کی خبر دیتے ہو جسے وہ نہ آسمانوں میں جانتا ہے اور نہ زمین میں؟ ‘‘ نیز دیکھیے سورۂ یونس (۶۸)، بنی اسرائیل (۴۰) اور نجم (۱۹ تا ۲۲) ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ أَحَدٌ أَصْبَرَ عَلٰی أَذًی سَمِعَهٗ مِنَ اللّٰهِ إِنَّهُمْ لَيَدْعُوْنَ لَهٗ وَلَدًا وَ إِنَّهٗ لَيُعَافِيْهِمْ وَيَرْزُقُهُمْ ] [ بخاری، الأدب، باب الصبر في الأذی : ۶۰۹۹ ] ’’اللہ تعالیٰ سے زیادہ تکلیف دہ بات پر صبر کرنے والا، جسے وہ سن رہا ہو اور کوئی نہیں۔ لوگ اس کے لیے اولاد بتاتے ہیں اور وہ (اس کے باوجود) انھیں عافیت دیتا ہے اور رزق دیتا ہے۔‘‘"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت 88تا95) ➊ پہلی آیات سے مناسبت یہ ہے کہ جب شفاعت کی نفی فرمائی اور سب سے بڑھ کر شفاعت کی حق دار اولاد ہوتی ہے، اس لیے ان لوگوں نے اللہ تعالیٰ کی اولاد قرار دے رکھی تھی، تو اللہ تعالیٰ نے ان کی بات کی نفی فرمائی، تاکہ خاص و عام ہر سفارشی کی نفی ہو جائے اور ہر اس عزت کی نفی ہو جائے جس کے حصول کا باعث وہ اپنے معبودوں کو سمجھتے تھے۔ (بقاعی) ¤ ➋ { وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا :} اللہ تعالیٰ نے ان کا قول نقل کرتے ہوئے ساتھ ہی اس کے باطل ہونے کی دلیل بھی ذکر فرما دی کہ وہ کہتے ہیں کہ اس رحمان نے اولاد بنا رکھی ہے جس کی بے پناہ رحمت سے ساری کائنات وجود میں آئی ہے اور ہر چیز اپنی بقا کے لیے اسی کی محتاج ہے، جبکہ وہ کسی کا محتاج نہیں، سب اس کے محتاج ہیں، فرمایا : « يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ» [ فاطر : ۱۵ ] ’’اے لوگو! تم ہی اللہ کی طرف محتاج ہو اور اللہ ہی سب سے بے پروا، تمام تعریفوں کے لائق ہے۔‘‘ بیٹا باپ کا محتاج نہیں ہوتا، بلکہ باپ اپنی کمزوری کی وجہ سے اولاد کا محتاج ہوتا ہے اور جس عقیدے، یعنی مسیح کو کفارہ بنانے کے لیے اسے اللہ کا بیٹا قرار دیا ہے، اللہ تعالیٰ کو رحمان ماننے کے بعد اس کی ضرورت ہی نہیں رہتی۔ ¤ ➌ یہود عزیر علیہ السلام کو اور نصاریٰ مسیح علیہ السلام کو اللہ تعالیٰ کا بیٹا کہتے تھے اور مشرکین عرب فرشتوں کو اللہ  کی بیٹیاں کہتے تھے، جبکہ امت مسلمہ کے کئی نادان رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی ذات پاک کا جزو قرار دیتے ہیں۔ ¤ ➍ { لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا …:} اس سے پہلے اللہ تعالیٰ کے لیے اولاد قرار دینے والوں کا ذکر غغائب کے صیغے کے ساتھ تھا، اس آیت میں اللہ تعالیٰ نے شدت غضب میں ان ظالموں کو مخاطب فرما کر بات کی اور تاکید کے دو لفظوں {’’لام‘‘} اور {’’قَدْ‘‘} کے ساتھ، جن کے جمع ہونے سے قسم کا مفہوم پیدا ہو جاتا ہے، فرمایا قسم ہے کہ تم ایک بہت ہی بھاری بات تک آ پہنچے ہو، جو اس قدر خوفناک اور بھاری ہے کہ قریب ہے کہ اللہ تعالیٰ کی عظمت کے تصور اور اس بات کے بوجھ سے {’’سَبْعٌ شِدَادٌ‘‘} یعنی ساتوں نہایت مضبوط آسمان پھٹ پڑیں، یہ وسیع اور محکم زمین شق ہو جائے اور انتہائی ٹھوس اور سخت پہاڑ مٹی کی بوسیدہ دیوار کی طرح ڈھے کر گر پڑیں کہ ان لوگوں نے (یہاں پھر نفرت سے مشرکوں کا ذکر غائب کے صیغے کے ساتھ کیا ہے) رحمن کے لیے اولاد کا دعویٰ کر دیا، حالانکہ رحمان کے لائق ہی نہیں کہ وہ (کسی کو بھی، خواہ پیغمبر ہو یا فرشتہ) اولاد بنائے۔ قوسین کے الفاظ مفعول اول ہیں جو محذوف ہیں، {’’وَلَدًا‘‘} مفعول ثانی ہے، یعنی اس کی اولاد ہونا ناممکن اور محال ہے، اس لیے کہ اولاد ہم جنس ہوتی ہے اور اللہ کا کوئی ہم جنس نہیں۔ پھر اولاد کمزوری میں سہارے کے لیے ہوتی ہے، جبکہ اللہ تعالیٰ ہر کمزوری سے پاک اور اپنی ذات و صفات میں ہر ایک سے بے نیاز ہے۔ وہ ہمیشہ سے عزیز و غالب ہے اور ہمیشہ عزیز و غالب رہے گا۔ دیکھیے سورۂ بنی اسرائیل کی آخری آیت کی تفسیر۔ اس کے علاوہ اولاد بیوی سے ہوتی ہے اور خاوند بیوی کا محتاج ہوتا ہے، جب اللہ کی بیوی ہی نہیں اور وہ کسی کا محتاج ہی نہیں تو اولاد کیسی؟ فرمایا : «{ اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ }» [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی، جبکہ اس کی کوئی بیوی نہیں۔‘‘ ¤ ➎ { اٰتِي الرَّحْمٰنِ عَبْدًا :} آسمان و زمین میں جو بھی ہے اس کا غلام بن کر حاضر ہونے والا ہے۔ اگر کوئی اولاد ہوتی تو غلام کیسے ہوتی؟ ¤ ➏ { لَقَدْ اَحْصٰىهُمْ وَ عَدَّهُمْ عَدًّا :} اللہ تعالیٰ نے سب کا احاطہ کر رکھا ہے، ایک ایک اس کے شمار میں ہے اور سب اکیلے اکیلے اس کے پاس آنے والے ہیں، اگر زمین و آسمان میں کوئی بھی اس کی اولاد ہوتا تو یقینا اسے معلوم ہوتا۔ کیا تم اللہ سے بھی زیادہ باخبر ہو، فرمایا : «{ قُلْ اَتُنَبِّـُٔوْنَ اللّٰهَ بِمَا لَا يَعْلَمُ فِي السَّمٰوٰتِ وَ لَا فِي الْاَرْضِ }» [ یونس : ۱۸ ] ’’کہہ دے کیا تم اللہ کو اس چیز کی خبر دیتے ہو جسے وہ نہ آسمانوں میں جانتا ہے اور نہ زمین میں؟ ‘‘ نیز دیکھیے سورۂ یونس (۶۸)، بنی اسرائیل (۴۰) اور نجم (۱۹ تا ۲۲) ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ أَحَدٌ أَصْبَرَ عَلٰی أَذًی سَمِعَهٗ مِنَ اللّٰهِ إِنَّهُمْ لَيَدْعُوْنَ لَهٗ وَلَدًا وَ إِنَّهٗ لَيُعَافِيْهِمْ وَيَرْزُقُهُمْ ] [ بخاری، الأدب، باب الصبر في الأذی : ۶۰۹۹ ] ’’اللہ تعالیٰ سے زیادہ تکلیف دہ بات پر صبر کرنے والا، جسے وہ سن رہا ہو اور کوئی نہیں۔ لوگ اس کے لیے اولاد بتاتے ہیں اور وہ (اس کے باوجود) انھیں عافیت دیتا ہے اور رزق دیتا ہے۔‘‘"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت 88تا95) ➊ پہلی آیات سے مناسبت یہ ہے کہ جب شفاعت کی نفی فرمائی اور سب سے بڑھ کر شفاعت کی حق دار اولاد ہوتی ہے، اس لیے ان لوگوں نے اللہ تعالیٰ کی اولاد قرار دے رکھی تھی، تو اللہ تعالیٰ نے ان کی بات کی نفی فرمائی، تاکہ خاص و عام ہر سفارشی کی نفی ہو جائے اور ہر اس عزت کی نفی ہو جائے جس کے حصول کا باعث وہ اپنے معبودوں کو سمجھتے تھے۔ (بقاعی) ¤ ➋ { وَ قَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا :} اللہ تعالیٰ نے ان کا قول نقل کرتے ہوئے ساتھ ہی اس کے باطل ہونے کی دلیل بھی ذکر فرما دی کہ وہ کہتے ہیں کہ اس رحمان نے اولاد بنا رکھی ہے جس کی بے پناہ رحمت سے ساری کائنات وجود میں آئی ہے اور ہر چیز اپنی بقا کے لیے اسی کی محتاج ہے، جبکہ وہ کسی کا محتاج نہیں، سب اس کے محتاج ہیں، فرمایا : « يٰۤاَيُّهَا النَّاسُ اَنْتُمُ الْفُقَرَآءُ اِلَى اللّٰهِ وَ اللّٰهُ هُوَ الْغَنِيُّ الْحَمِيْدُ» [ فاطر : ۱۵ ] ’’اے لوگو! تم ہی اللہ کی طرف محتاج ہو اور اللہ ہی سب سے بے پروا، تمام تعریفوں کے لائق ہے۔‘‘ بیٹا باپ کا محتاج نہیں ہوتا، بلکہ باپ اپنی کمزوری کی وجہ سے اولاد کا محتاج ہوتا ہے اور جس عقیدے، یعنی مسیح کو کفارہ بنانے کے لیے اسے اللہ کا بیٹا قرار دیا ہے، اللہ تعالیٰ کو رحمان ماننے کے بعد اس کی ضرورت ہی نہیں رہتی۔ ¤ ➌ یہود عزیر علیہ السلام کو اور نصاریٰ مسیح علیہ السلام کو اللہ تعالیٰ کا بیٹا کہتے تھے اور مشرکین عرب فرشتوں کو اللہ  کی بیٹیاں کہتے تھے، جبکہ امت مسلمہ کے کئی نادان رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کی ذات پاک کا جزو قرار دیتے ہیں۔ ¤ ➍ { لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا …:} اس سے پہلے اللہ تعالیٰ کے لیے اولاد قرار دینے والوں کا ذکر غغائب کے صیغے کے ساتھ تھا، اس آیت میں اللہ تعالیٰ نے شدت غضب میں ان ظالموں کو مخاطب فرما کر بات کی اور تاکید کے دو لفظوں {’’لام‘‘} اور {’’قَدْ‘‘} کے ساتھ، جن کے جمع ہونے سے قسم کا مفہوم پیدا ہو جاتا ہے، فرمایا قسم ہے کہ تم ایک بہت ہی بھاری بات تک آ پہنچے ہو، جو اس قدر خوفناک اور بھاری ہے کہ قریب ہے کہ اللہ تعالیٰ کی عظمت کے تصور اور اس بات کے بوجھ سے {’’سَبْعٌ شِدَادٌ‘‘} یعنی ساتوں نہایت مضبوط آسمان پھٹ پڑیں، یہ وسیع اور محکم زمین شق ہو جائے اور انتہائی ٹھوس اور سخت پہاڑ مٹی کی بوسیدہ دیوار کی طرح ڈھے کر گر پڑیں کہ ان لوگوں نے (یہاں پھر نفرت سے مشرکوں کا ذکر غائب کے صیغے کے ساتھ کیا ہے) رحمن کے لیے اولاد کا دعویٰ کر دیا، حالانکہ رحمان کے لائق ہی نہیں کہ وہ (کسی کو بھی، خواہ پیغمبر ہو یا فرشتہ) اولاد بنائے۔ قوسین کے الفاظ مفعول اول ہیں جو محذوف ہیں، {’’وَلَدًا‘‘} مفعول ثانی ہے، یعنی اس کی اولاد ہونا ناممکن اور محال ہے، اس لیے کہ اولاد ہم جنس ہوتی ہے اور اللہ کا کوئی ہم جنس نہیں۔ پھر اولاد کمزوری میں سہارے کے لیے ہوتی ہے، جبکہ اللہ تعالیٰ ہر کمزوری سے پاک اور اپنی ذات و صفات میں ہر ایک سے بے نیاز ہے۔ وہ ہمیشہ سے عزیز و غالب ہے اور ہمیشہ عزیز و غالب رہے گا۔ دیکھیے سورۂ بنی اسرائیل کی آخری آیت کی تفسیر۔ اس کے علاوہ اولاد بیوی سے ہوتی ہے اور خاوند بیوی کا محتاج ہوتا ہے، جب اللہ کی بیوی ہی نہیں اور وہ کسی کا محتاج ہی نہیں تو اولاد کیسی؟ فرمایا : «{ اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ }» [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی، جبکہ اس کی کوئی بیوی نہیں۔‘‘ ¤ ➎ { اٰتِي الرَّحْمٰنِ عَبْدًا :} آسمان و زمین میں جو بھی ہے اس کا غلام بن کر حاضر ہونے والا ہے۔ اگر کوئی اولاد ہوتی تو غلام کیسے ہوتی؟ ¤ ➏ { لَقَدْ اَحْصٰىهُمْ وَ عَدَّهُمْ عَدًّا :} اللہ تعالیٰ نے سب کا احاطہ کر رکھا ہے، ایک ایک اس کے شمار میں ہے اور سب اکیلے اکیلے اس کے پاس آنے والے ہیں، اگر زمین و آسمان میں کوئی بھی اس کی اولاد ہوتا تو یقینا اسے معلوم ہوتا۔ کیا تم اللہ سے بھی زیادہ باخبر ہو، فرمایا : «{ قُلْ اَتُنَبِّـُٔوْنَ اللّٰهَ بِمَا لَا يَعْلَمُ فِي السَّمٰوٰتِ وَ لَا فِي الْاَرْضِ }» [ یونس : ۱۸ ] ’’کہہ دے کیا تم اللہ کو اس چیز کی خبر دیتے ہو جسے وہ نہ آسمانوں میں جانتا ہے اور نہ زمین میں؟ ‘‘ نیز دیکھیے سورۂ یونس (۶۸)، بنی اسرائیل (۴۰) اور نجم (۱۹ تا ۲۲) ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ أَحَدٌ أَصْبَرَ عَلٰی أَذًی سَمِعَهٗ مِنَ اللّٰهِ إِنَّهُمْ لَيَدْعُوْنَ لَهٗ وَلَدًا وَ إِنَّهٗ لَيُعَافِيْهِمْ وَيَرْزُقُهُمْ ] [ بخاری، الأدب، باب الصبر في الأذی : ۶۰۹۹ ] ’’اللہ تعالیٰ سے زیادہ تکلیف دہ بات پر صبر کرنے والا، جسے وہ سن رہا ہو اور کوئی نہیں۔ لوگ اس کے لیے اولاد بتاتے ہیں اور وہ (اس کے باوجود) انھیں عافیت دیتا ہے اور رزق دیتا ہے۔‘‘"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت 96) { سَيَجْعَلُ لَهُمُ الرَّحْمٰنُ وُدًّا: ’’ وُدٌّ ‘‘} اور {’’ حُبٌّ ‘‘} ہم معنی ہیں۔ {’’ وُدًّا ‘‘} کی تنوین تعظیم کے لیے ہے۔ کافروں کے برے عقائد و اعمال اور ان کے انجام بد کا ذکر کرنے کے بعد ایمان اور عمل صالح والوں پر اپنے انعامات کا ذکر فرمایا۔ اس آیت کے تین معنی ہو سکتے ہیں اور تینوں درست ہیں، جن کی قرآن و حدیث سے تائید ہوتی ہے۔ اللہ کے کلام سے بڑھ کر جامع کلام کوئی نہیں کہ جس کے تھوڑے سے کلمات میں بہت سے معانی جمع ہیں۔ پہلا معنی یہ ہے کہ جو لوگ صدق دل سے ایمان لائے اور انھوں نے اس دعویٰ کی تصدیق کے لیے کتاب و سنت کے مطابق اخلاص کے ساتھ عمل کیے (کیونکہ عمل صالح کے تین اجزا ہیں : ایمان، اخلاص اور اتباع کتاب و سنت) تو اللہ تعالیٰ بہت جلد ایمان والوں کے دلوں میں ان کے لیے عظیم محبت رکھ دے گا، جب کہ دشمنوں کے دلوں میں ان کی ہیبت اور رعب ڈال دے گا، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کا رعب ایک مہینے کی مسافت پر دور دشمن پر پڑ جاتا تھا۔ اصبہانی نے فرمایا کہ یہ محبت انھیں لوگوں کی محبت حاصل کرنے کی کسی کوشش یا لوگوں کی دوستی کے اسباب میں سے کسی سبب، مثلاً قرابت، کسی پر احسان، مروت یا خوش اخلاقی وغیرہ کے بغیر محض رحمان کی عنایت سے حاصل ہوتی ہے (جن لوگوں سے وہ ملا بھی نہیں ہوتا وہ بھی اس سے محبت رکھتے ہیں)۔ (بقاعی) صفت رحمان اور دلوں میں محبت پیدا کرنے کے درمیان مناسبت بالکل واضح ہے۔قرآن مجید میں اس کی مثال موسیٰ علیہ السلام کو محبوبِ خلائق بنانا ہے، فرمایا : «{ اَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّيْ }» [ طٰہٰ : ۳۹ ] ’’اور میں نے تجھ پر اپنی طرف سے عظیم محبت ڈال دی۔‘‘ اسی طرح {’’رَبُّنَا اللّٰهُ ‘‘} (ہمارا رب اللہ ہی ہے) کہہ کر استقامت اختیار کرنے والوں کو فرشتے بشارت دیتے ہیں : «{ نَحْنُ اَوْلِيٰٓؤُكُمْ فِي الْحَيٰوةِ الدُّنْيَا وَ فِي الْاٰخِرَةِ}» [ حٰمٓ السجدۃ : ۳۱ ] ’’ہم تمھارے دوست ہیں دنیا کی زندگی میں اور آخرت میں بھی۔‘‘ اور ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا أَحَبَّ اللّٰهُ الْعَبْدَ نَادَی جِبْرِيْلَ إِنَّ اللّٰهَ يُحِبُّ فُلاَنًا فَأَحْبِبْهُ فَيُحِبُّهٗ جِبْرِيْلُ فَيُنَادِيْ جِبْرِيْلُ فِيْ أَهْلِ السَّمَاءِ إِنَّ اللّٰهَ يُحِبُّ فُلاَنًا فَأَحِبُّوْهٗ فَيُحِبُّهٗ أَهْلُ السَّمَاءِ ثُمَّ يُوْضَعُ لَهٗ الْقَبُوْلُ فِي الْأَرْضِ ] [ بخاري، بدء الخلق، باب ذکر الملائکۃ صلوات اللہ علیہم : ۳۲۵۹، ۷۴۸۵ ] ’’جب اللہ تعالیٰ کسی بندے سے محبت کرتا ہے تو جبریل کو بلاتا ہے (اور کہتا ہے کہ) بے شک اللہ تعالیٰ فلاں بندے سے محبت کرتا ہے تو بھی اس سے محبت کر، تو جبریل بھی اس سے محبت کرتا ہے اور آسمان والوں میں اعلان کرتا ہے کہ اللہ تعالیٰ فلاں سے محبت کرتا ہے، اس لیے تم سب اس سے محبت کرو، تو آسمان والے اس سے محبت کرتے ہیں، پھر اس کے لیے زمین میں قبولیت رکھ دی جاتی ہے۔‘‘ ¤ صحیح مسلم میں مزید یہ الفاظ ہیں : [ وَإِذَا أَبْغَضَ اللّٰهُ عَبْدًا دَعَا جِبْرَئِيْلَ فَيَقُوْلُ إِنِّيْ أُبْغِضُ فُلَانًا فَأَبْغِضْهُ، قَالَ: فَيُبْغِضُهُ جِبْرَئِيْلُ ، ثُمَّ يُنَادِيْ فِيْ أَهْلِ السَّمَاءِ إِنَّ اللّٰهَ يُبْغِضُ فُلَانًا فَأَبْغِضُوْهُ، قَالَ فَيُبْغِضُوْنَهُ، ثُمَّثُمَّ تُوْضَعُ لَهُ الْبَغْضَاءُ فِي الْأَرْضِ ] [مسلم، البر والصلۃ، باب إذا أحب اللہ عبدا، أمر جبرئیل… : ۲۶۳۷ ] ’’اور جب وہ کسی بندے سے بغض رکھتا ہے تو جبریل کو بلاتا ہے اور کہتا ہے کہ میں فلاں سے بغض رکھتا ہوں، تم بھی اس سے بغض رکھو۔‘‘ فرمایا : ’’تو جبریل اس سے بغض رکھتا ہے، پھر وہ آسمان والوں میں اعلان کر دیتا ہے کہ اللہ فلاں سے بغض رکھتا ہے، اس لیے تم بھی اس سے بغض رکھو۔‘‘ فرمایا : ’’تو وہ اس سے بغض رکھتے ہیں، پھر اس کے لیے زمین میں دلی دشمنی رکھ دی جاتی ہے۔‘‘ واضح رہے کہ یہ آیت مکہ معظمہ میں نازل ہوئی جہاں مسلمان انتہائی مظلومیت و کس مپرسی کی زندگی بسر کر رہے تھے، گویا اللہ تعالیٰ نے ان سے وعدہ فرمایا کہ عنقریب حالات بدلیں گے (لوگ جوق در جوق اسلام میں داخل ہوں گے) اور تم ذلیل و رسوا ہونے کے بجائے محبوبِ خلائق بن کر زندگی گزارو گے۔ چنانچہ یہ وعدہ پورا ہوا اور رہتی دنیا تک لوگوں کے دلوں میں صحابہ کرام رضی اللہ عنھم کی وہ محبت پیدا ہوئی جس کی مثال ملنا مشکل ہے۔ دوسرا معنی اس آیت کا یہ ہے کہ اللہ تعالیٰ ایمان اور عمل صالح والوں کے لیے آپس میں محبت پیدا فرما دے گا، جو پہلے جانی دشمن تھے ایمان کے بعد دلی دوست بن جائیں گے، جیسا کہ اللہ تعالیٰ نے فرمایا : « { هُوَ الَّذِيْۤ اَيَّدَكَ بِنَصْرِهٖ وَ بِالْمُؤْمِنِيْنَ (62) وَ اَلَّفَ بَيْنَ قُلُوْبِهِمْ لَوْ اَنْفَقْتَ مَا فِي الْاَرْضِ جَمِيْعًا مَّاۤ اَلَّفْتَ بَيْنَ قُلُوْبِهِمْ وَ لٰكِنَّ اللّٰهَ اَلَّفَ بَيْنَهُمْ اِنَّهٗ عَزِيْزٌ حَكِيْمٌ } » [الأنفال : ۶۲، ۶۳ ] ’’وہی ہے جس نے تجھے اپنی مدد کے ساتھ اور مومنوں کے ساتھ قوت بخشی اور ان کے دلوں کے درمیان الفت ڈال دی۔ اگر تو زمین میں جو کچھ ہے سب خرچ کر دیتا ان کے دلوں میں الفت نہ ڈالتا اور لیکن اللہ نے ان کے درمیان الفت ڈال دی، بے شک وہ سب پر غالب، کمال حکمت والا ہے۔‘‘ یہ رحمان کی اس رحمت ہی کا نتیجہ ہے کہ مدتوں لڑنے والے اوس و خزرج بھائی بھائی بن گئے، حبش کے بلال، روم کے صہیب، ایران کے سلمان، مدینہ کے انصار اور مکہ کے قریش آپس میں بھائی بھائی بن گئے اور {’’ اِنَّمَا الْمُوْمِنُوْنَ اِخْوَةٌ ‘‘} کا عملی نقشہ دنیا کے سامنے آ گیا۔ اگر ان کی کوئی باہمی رنجش رہ بھی گئی تو اللہ تعالیٰ نے جنت میں جانے سے پہلے اسے دور کرنے کا وعدہ فرمایا۔ دیکھیے سورۂ حجر (۴۷) جیسا کہ اوپر گزرا، یہ محبت ایمان داروں کے دلوں میں پیدا ہوتی ہے، کفار کے دلوں میں نہیں، اس کی مثال ثمامہ بن اثال اور ہند بنت عتبہ رضی اللہ عنھما ہیں جنھوں نے شہادت دی کہ اسلام لانے سے پہلے ان کے نزدیک رسول اللہ صلی اللہ علیہ وسلم سے زیادہ مبغوض کوئی نہ تھا، لیکن پھر ایمان لانے کے بعد آپ سے بڑھ کر محبوب کوئی نہ تھا۔ ¤ تیسرا معنی یہ ہے کہ {’’ وُدًّا ‘‘} مصدر بمعنی اسم مفعول ہے، محبوب چیز، یعنی ایمان اور عمل صالح والے جو چیز محبوب رکھیں گے، پسند کریں گے رحمان جنت میں انھیں وہی عطا فرمائے گا، جیسا کہ فرمایا : «{ وَ لَكُمْ فِيْهَا مَا تَشْتَهِيْۤ اَنْفُسُكُمْ وَ لَكُمْ فِيْهَا مَا تَدَّعُوْنَ }» [ حٰمٓ السجدۃ : ۳۱ ] ’’اور تمھارے لیے اس (جنت) میں وہ کچھ ہے جو تمھارے دل چاہیں گے اور تمھارے لیے اس میں وہ کچھ ہے جو تم مانگو گے۔‘‘ یہ معنی ابومسلم نے بیان فرمایا ہے۔ (قاسمی)"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت 97) {فَاِنَّمَا يَسَّرْنٰهُ بِلِسَانِكَ … :} یہ ساری سورت بلکہ پورا قرآن متقین کو خوش خبری اور منکرین کو ڈرانے کے لیے ہے۔ اس آیت سے پہلی آیات میں بھی اللہ تعالیٰ کی اولاد بتانے والوں کی تردید اور ان کا انجام بد مذکور ہے اور ایمان اور عمل صالح والوں کو حصول محبت کی خوش خبری دی گئی ہے۔ اس آیت میں اللہ تعالیٰ نے اس مقصد کے لیے قرآن مجید میں تین خوبیاں رکھنے کا ذکر فرمایا، تاکہ بشارت و نذارت بہترین طریقے سے ہو سکے۔ پہلی یہ کہ اللہ تعالیٰ نے اسے آسان کر دیا ہے اور اللہ کی آسان کی ہوئی چیز سے زیادہ آسان کیا چیز ہو گی۔ دیکھیے سورۂ قمر (۱۷) دوسری یہ کہ اسے رسول اللہ صلی اللہ علیہ وسلم کی زبان ’’عربی‘‘ میں اتارا جس سے زیادہ بات واضح کرنے کی خوبی کسی زبان میں نہیں اور جس کے اولین مخاطب یہ زبان بولنے والے تھے، جو اس زبان کے باریک سے باریک اشاروں کو بھی سمجھتے تھے۔ دیکھیے سورۂ شعراء (۱۹۲ تا ۱۹۵)، یوسف (۱، ۲)، زخرف (۱ تا ۳) اور نحل (۱۰۳)۔ ¤ تیسری یہ کہ اس کے ساتھ خوش خبری دینے اور ڈرانے کے لیے نبی کریم صلی اللہ علیہ وسلم کو یہ دے کر بھیجا گیا جو خود اہل عرب سے تھے، تاکہ وہ اسے پڑھ کر سنائیں اور عمل کر کے دکھائیں۔ دیکھیے سورۂ نحل(۴۴) پہلی خوبی لفظ {’’ يَسَّرْنٰهُ ‘‘} میں، دوسری {’’ بِلِسَانِكَ ‘‘} میں اور تیسری {’’ تُنْذِرَ بِهٖ ‘‘} اور {’’ تُنْذِرَ بِهٖ ‘‘} کے صیغہ خطاب میں بیان ہوئی ہے۔ {’’ لُّدًّا ‘‘’’ أَلَدُّ ‘‘} کی جمع ہے، سخت جھگڑالو اور ضدی شخص، جو کسی طرح حق بات کو نہ مانے۔ اس سے مراد قریش اور دوسرے معاند کفار ہیں۔ دیکھیے سورۂ زخرف (۵۷، ۵۸)۔"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت 98) {وَ كَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍ …:} یہاں گزشتہ آیت میں مذکور سخت جھگڑالو قوم کو ان سے پہلی سخت جھگڑالو قوموں کی ہلاکت کا ذکر کرکے ڈرایا گیا ہے کہ ہم نے ان سے پہلے ایسی کتنی ہی سخت ضدی قوموں کو ہلاک کر دیا۔ غور سے دیکھو! ان میں سے کوئی تمھیں کہیں کھٹکتا ہے، یا اس کی بھنک ہی کان میں پڑتی ہے؟ یہی حال اس زمانے کے کافروں کا ہونے والا ہے۔"
    }
  ]
}