{
  "surah": "Taa-Haa",
  "surah_number": 20,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) {طٰهٰ :} ظاہر یہی ہے کہ یہ حروف مقطعات میں سے ہیں، کیونکہ یہ دونوں حرف دوسری جگہ مقطعات میں استعمال ہوئے ہیں، ’’طا‘‘ {’’ طٰسٓمّٓ ‘‘} (شعراء) میں اور ’’ہا‘‘ {’’ كٓهٰيٰعٓصٓ ‘‘ } (مریم) میں۔ مقطعات کی تفسیر کے لیے سورۂ بقرہ کی پہلی آیت کی تفسیر دیکھیے۔ عبد الرزاق نے اپنی صحیح سند کے ساتھ قتادہ اور حسن کا قول نقل کیا ہے کہ{ ’’ طٰهٰ ‘‘ } کا معنی ہے {’’يَا رَجُلُ!‘‘} اے آدمی! کیونکہ قبیلہ بنوعکّ میں یہ لفظ اس معنی میں بولا جاتا تھا، مگر پہلی بات زیادہ صحیح ہے، کیونکہ قرآن مجید قریش کی لغت میں نازل ہوا ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {مَاۤ اَنْزَلْنَا عَلَيْكَ الْقُرْاٰنَ لِتَشْقٰۤى : ’’ شَقِيَ يَشْقٰي شَقَاوَةً وَ شَقَاءً‘‘} بروزن {’’رَضِيَ يَرْضَي‘‘} یہ سعادت کی ضد ہے۔ سعادت کی دو قسمیں ہیں، دنیوی اور اخروی۔ اسی طرح شقاوت کی بھی دو قسمیں ہیں، دنیوی اور اخروی۔ اخروی شقاوت بدبختی و بدنصیبی ہے، جیسا کہ کفار کہیں گے : «{ رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا }» [ المؤمنون : ۱۰۶ ] ’’پروردگارا! ہم پر ہماری بدبختی غالب آگئی۔‘‘ دنیوی شقاوت ایسے کاموں میں پھنس جانا جو مشقت اور تھکاوٹ کا باعث ہوں، جیسے کہتے ہیں{’’ فُلاَنٌ أَشْقَي مِنْ رَائِضِ مُهْرٍ ‘‘} ’’فلاں گھوڑی کے بچھیرے کو سدھانے والے سے بھی زیادہ مشقت اور مصیبت میں پھنسا ہوا ہے۔‘‘ مفسرین نے اس آیت کے دو معنی بیان فرمائے ہیں اور دونوں درست ہیں۔ ایک یہ کہ رسول اللہ صلی اللہ علیہ وسلم نزول وحی کے بعد ہر وقت اس فکر میں رہتے تھے کہ سب لوگ مسلمان ہو جائیں، اس کے لیے آپ دن رات دعوت و تبلیغ کے لیے اتنی مشقت اٹھاتے اور کفار کی بے رخی پر اس قدر غمزدہ ہوتے کہ اللہ تعالیٰ نے آپ کو تسلی دی کہ اتنی بھی مشقت اور فکر کیا کہ آپ مصیبت ہی میں پڑ جائیں، ہم نے آپ پر یہ قرآن شقاوت کے لیے نہیں بلکہ آپ کی سعادت کے لیے اتارا ہے۔ آپ کے ذمے یہ نہیں کہ تمام لوگوں کو مسلمان کرکے چھوڑیں۔ آپ کا کام نصیحت ہے، پھر جو اللہ سے ڈرتا ہے وہ قبول کر لے گا، دوسروں کے آپ ذمہ دار نہیں ہیں۔ لوگوں کے مسلمان نہ ہونے پر رسول اللہ صلی اللہ علیہ وسلم کے غم و افسوس کا اور آپ کو تسلی دینے کا ذکر بہت سی آیات میں ہے، مثلاً : «{ فَلَعَلَّكَ بَاخِعٌ نَّفْسَكَ عَلٰۤى اٰثَارِهِمْ اِنْ لَّمْ يُؤْمِنُوْا بِهٰذَا الْحَدِيْثِ اَسَفًا }» [ الکہف : ۶ ] ’’پس شاید تو اپنی جان ان کے پیچھے غم سے ہلاک کر لینے والا ہے، اگر وہ اس بات پر ایمان نہ لائے۔‘‘ اور فرمایا : «{ لَعَلَّكَ بَاخِعٌ نَّفْسَكَ اَلَّا يَكُوْنُوْا مُؤْمِنِيْنَ }» [ الشعراء : ۳ ] ’’شاید تو اپنے آپ کو ہلاک کرنے والا ہے، اس لیے کہ وہ مومن نہیں ہوتے۔‘‘ دوسرا معنی اس آیت کا یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم عبادت خصوصاً قیام میں بہت محنت کرتے، تو اللہ تعالیٰ نے اس میں میانہ روی کا حکم دیا اور فرمایا : «{ فَاقْرَءُوْا مَا تَيَسَّرَ مِنَ الْقُرْاٰنِ }» [ المزمل : ۲۰ ] یعنی اے نبی! آپ جتنا قیام آسانی سے کر سکتے ہیں کریں۔ تفصیل کے لیے سورۂ مزمل کا آخری رکوع ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) { اِلَّا تَذْكِرَةً لِّمَنْ يَّخْشٰى : ’’ اِلَّا ‘‘ } کے ساتھ استثنا منقطع ہے، کیونکہ {’’ تَذْكِرَةً ‘‘} شقاوت میں شامل نہیں ہے، لہٰذا یہاں {’’ اِلَّا ‘‘ } بمعنی {’’ لٰكِنَّ ‘‘} ہے، چنانچہ یہاں اس کا ترجمہ ’’بلکہ‘‘ کیا گیا ہے اور یہ جو فرمایا کہ اس قرآن کو اس شخص کی نصیحت کے لیے اتارا جو ڈرتا ہے، اس سے مراد یہ نہیں کہ قرآن دوسرے لوگوں کی نصیحت کے لیے نہیں اترا، کیونکہ قرآن بلکہ پورا دین ہر انس و جن تک پہنچانے کے لیے اتارا گیا ہے، جیسا کہ فرمایا : «{ يٰۤاَيُّهَا الرَّسُوْلُ بَلِّغْ مَاۤ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ }» [ المائدۃ : ۶۷ ] ’’اے رسول! پہنچا دے جو کچھ تیری طرف تیرے رب کی جانب سے نازل کیا گیا ہے۔‘‘ اور نبی صلی اللہ علیہ وسلم قیامت تک آنے والے تمام لوگوں کی طرف بھیجے گئے ہیں۔ (دیکھیے سبا : ۲۸) بلکہ مقصد یہ ہے کہ اس سے فائدہ وہی اٹھائے گا جو اللہ تعالیٰ سے ڈرتا ہے، جسے اللہ اور آخرت کا ڈر نہیں اسے صحیح راستے پر ڈال دینا آپ کے ذمے نہیں، جیسا کہ فرمایا : « سَيَذَّكَّرُ مَنْ يَّخْشٰى (10) وَ يَتَجَنَّبُهَا الْاَشْقَى » [ الأعلٰی : ۱۰، ۱۱ ] ’’عنقریب نصیحت حاصل کرے گا جو ڈرتا ہے اور اس سے علیحدہ رہے گا جو سب سے بڑا بدنصیب ہے۔‘‘ علاوہ ازیں دیکھیے سورۂ بقرہ (۱ تا ۵)، سورۂ ق (۴۵) اور نازعات (۴۵)۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {’’ تَنْزِيْلًا ‘‘} فعل محذوف کی وجہ سے منصوب ہے جو {’’ مَاۤ اَنْزَلْنَا عَلَيْكَ ‘‘} سے معلوم ہو رہا ہے، یعنی {’’نُزِّلَ هٰذَا الْقُرْآنُ تَنْزِيْلاً۔‘‘} تنزیل کا معنی تھوڑا تھوڑا کرکے اتارنا ہے، اس کی حکمت کے لیے دیکھیے سورۂ فرقان کی آیت (۳۲) {’’ الْعُلٰى ‘‘ ’’عُلْيَا‘‘} کی جمع ہے جو{ ’’أَعْلٰي‘‘} کی مؤنث ہے، جیسے {’’كُبْرٰي‘‘ } کی جمع {’’كُبَرٌ‘‘} ہے، یعنی یہ قرآن کسی جادوگر، کاہن، شاعر، شیطان، جن، انسان، فرشتے یا کسی بھی مخلوق کا کلام نہیں، بلکہ اس خالق کا نازل کردہ ہے جو صرف تمھارا ہی خالق نہیں بلکہ اس عظیم الشان زمین کا، جس کے اوپر اور ان بے حد بلند و بالا آسمانوں کا، جن کے نیچے تم رہتے ہو، سب کا خالق وہی ہے۔ دیکھیے سورۂ نازعات (۲۷ تا ۳۳) اس سے اس قرآن کی عظمت سمجھ لو کہ کیا یہ اپنے لانے والے یا اپنے ماننے والوں کے لیے کسی طرح بھی باعث شقاوت ہو سکتا ہے؟ ہر گز نہیں! بلکہ یہ ان کے لیے سراسر سعادت ہی سعادت ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: [ إِنَّ الدِّيْنَ يُسْرٌ وَلَنْ يُّشَادَّ الدِّيْنَ أَحَدٌ إِلَّا غَلَبَهٗ فَسَدِّدُوْا وَقَارِبُوْا وَأَبْشِرُوْا وَاسْتَعِيْنُوْا بِالْغَدْوَةِ وَالرَّوْحَةِ وَشَيْءٍ مِنَ الدُّلْجَةِ ] ’’بے شک یہ دین آسان ہے اور کوئی بھی شخص دین میں جب بھی بے جا سختی کرے گا تو وہ اس پر غالب آ جائے گا۔ تو تم سیدھے چلو اور قریب رہو اور (اللہ سے ملنے والے اجر پر) خوش ہو جاؤ اور صبح و شام اور رات کے کچھ حصے (میں عبادت) کے ساتھ مددحاصل کرو۔‘‘ [ بخاري، الإیمان، باب الدین یسر : ۳۹، عن أبي ھریرۃ رضی اللہ عنہ ]"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { اَلرَّحْمٰنُ عَلَى الْعَرْشِ اسْتَوٰى:} یعنی آپ پر قرآن کا نازل کرنا اور زمین اور بلند آسمان کو پیدا کرنا جس بے حد رحم والے کی رحمت کا نتیجہ ہے وہ رحمان عرش پر بلند ہے۔ عرش کا لفظی معنی تخت ہے اور {’’ اسْتَوٰى ‘‘} کا معنی {’’اِرْتَفَعَ‘‘} (بلند ہوا) ہے۔ عرش کے اوپر اللہ تعالیٰ ہے اور پوری کائنات کی تدبیر فرما رہا ہے، فرمایا : «{ ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ يُدَبِّرُ الْاَمْرَ }» [یونس : ۳ ] ’’پھر وہ عرش پر بلند ہوا، ہر کام کی تدبیر کرتا ہے۔‘‘ اس آیت اور دوسری آیات سے صاف ظاہر ہے کہ اللہ تعالیٰ عرش کے اوپر ہے، مگر یہ بات کہ وہ عرش کے اوپر کس طرح ہے؟ کھڑا ہے یا بیٹھا ہے یا کس کیفیت میں ہے؟ کوئی نہیں جانتا، نہ جان سکتا ہے، کیونکہ مخلوق محدود ہے اور وہ لامحدود۔ مخلوق میں سے کوئی بھی خالق کو تو کجا اس کی معلومات میں سے بھی کوئی چیز پوری طرح نہیں جان سکتا، مگر جو وہ چاہے، فرمایا : «{ وَ لَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖۤ اِلَّا بِمَا شَآءَ }» [ البقرۃ : ۲۵۵ ] ’’اور وہ اس کے علم میں سے کسی چیز کا احاطہ نہیں کرتے مگر جتنا وہ چاہے۔‘‘ صحابہ کرام رضی اللہ عنھم نے، جو انبیاء علیھم السلام کے بعد اللہ تعالیٰ کے بارے میں سب سے زیادہ علم رکھنے والے تھے، نبی صلی اللہ علیہ وسلم سے یہ سوال نہیں کیا کہ وہ اپنے تخت پر کس طرح ہے؟ اسی لیے کسی شخص نے امام مالک رحمہ اللہ سے {’’ اَلرَّحْمٰنُ عَلَى الْعَرْشِ اسْتَوٰى ‘‘} کے متعلق پوچھا کہ کس طرح؟ تو انھوں نے فرمایا: {’’اَلْاِسْتِوَاءُ مَعْلُوْمٌ وَالْكَيْفُ مَجْهُوْلٌ وَالسُّؤَالُ عَنْهُ بِدْعَةٌ ‘‘} ’’یہ بات سب جانتے ہیں کہ وہ عرش کے اوپر ہے، مگر یہ کسی کو معلوم نہیں کہ کس طرح ہے اور اس کے متعلق سوال بدعت ہے۔‘‘ مزید فرمایا : ’’میں تمھیں برا آدمی خیال کرتا ہوں، اسے میرے پاس سے نکال دو۔‘‘ تو سوال کرنے والا یہ کہتا ہوا چلا گیا کہ اے ابو عبد اللہ! میں نے اس کے متعلق اہل عراق اور اہل شام سے پوچھا مگر کسی کو آپ (کے صحیح جواب) جیسی توفیق عطا نہیں ہوئی۔ (تفسیر بغوی) ¤ خلاصہ یہ کہ جو بات اللہ تعالیٰ اور اس کے رسول نے بتائی ہے اس پر ایمان رکھنا فرض ہے اور وہ یہ ہے کہ اللہ تعالیٰ عرش پر مستوی ہے، اللہ تعالیٰ کے عرش کو قیامت کے دن آٹھ فرشتے اٹھائے ہوئے ہوں گے (دیکھیے حاقہ : ۱۷) اس کے پائے بھی ہیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلنَّاسُ يَصْعَقُوْنَ يَوْمَ الْقِيَامَةِ فَأَكُوْنُ أَوَّلَ مَنْ يُّفِيْقُ فَإِذَا أَنَا بِمُوْسٰی آخِذٌ بِقَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ فَلَا أَدْرِيْ أَفَاقَ قَبْلِيْ أَمْ جُوْزِيَ بِصَعْقَةِ الططُّوْرِ ] ’’لوگ قیامت کے دن بے ہوش ہو جائیں گے تو سب سے پہلا شخص جو ہوش میں آئے گا میں ہوں گا۔ اچانک میں موسیٰ علیہ السلام کو دیکھوں گا کہ وہ عرش کے پایوں میں سے ایک پائے کو پکڑے ہوئے ہوں گے، تو میں نہیں جانتا کہ وہ مجھ سے پہلے ہوش میں آ گئے یا انھیں طور کی بے ہوشی کا بدلہ دیا گیا۔‘‘ [ بخاري، أحادیث الأنبیاء، باب قول اللّٰہ تعالٰی : «وواعدنا موسٰی ثلاثین… » : ۳۳۹۸، عن أبي سعید الخدري رضی اللہ عنہ ] مگر اللہ کا عرش پر ہونا یا اس کی کوئی بھی صفت مخلوق کی صفت کے مشابہ نہیں، فرمایا : «{ لَيْسَ كَمِثْلِهٖ شَيْءٌ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ }» [ الشورٰی : ۱۱ ]’’اس کی مثل کوئی چیز نہیں اور وہی سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔‘‘ تمام سلف کا اللہ تعالیٰ کے عرش پر بلند ہونے اور دوسری صفات کے متعلق یہی عقیدہ ہے۔ خیر القرون گزرنے کے بعد جب عقیدہ و اعمال کی بدعات شروع ہوئیں تو اللہ تعالیٰ کے متعلق آیات و احادیث کی بھی اپنی اپنی بدعات کے مطابق تاویل بلکہ تحریف کی جانے لگی۔ چنانچہ بہت سے لوگوں نے کہا کہ عرش کے اوپر ہونے کا مطلب زمین و آسمان کی حکومت کا مالک ہونا ہے، ورنہ نہ کوئی عرش ہے اور نہ اللہ تعالیٰ اس کے اوپر ہے۔ وہ نہ اوپر ہے نہ نیچے اور نہ کسی اور جہت میں، نہ وہ آسمان دنیا پر اترتا ہے اور نہ قیامت کے دن زمین پر آئے گا۔ غرض تاویل کے نام پر صریح آیات و احادیث کا انکار کر دیا۔ مگر اتنے بڑے بڑے علماء پر تعجب ہوتا ہے کہ انھوں نے اتنی جرأت کے ساتھ اس عرش عظیم و کریم کا انکار کیسے کر دیا کہ جس پر اپنے بلند ہونے کا ذکر خود رحمان نے فرمایا اور جسے قیامت کے دن تمام لوگوں کے اوپر آٹھ فرشتوں کے اٹھانے کا ذکر قرآن کریم نے فرمایا ہے اور جس کے پایوں کا ذکر اس کے حبیب صلی اللہ علیہ وسلم نے فرمایا ہے۔ [ فَنَعُوْذُ بِاللّٰہِ مِنْ ھٰذِہِ الْأَھْوَاءِ الْمُضِلَّۃِ وَالْعَقَائِدِ الْبَاطِلَۃِ وَ خُذْلَانِ رَحْمَۃِ اللّٰہِ تَعَالٰی ] مزید دیکھیے سورۂ اعراف (۵۴)، حاقہ (۱۷) اور سورۂ فجر (۲۲) مفسر جمال الدین قاسمی لکھتے ہیں : ’’فلکیات کے جدید ماہرین کی تحقیق سے ثابت ہو چکا ہے کہ عرش ایک حقیقی وجود ہے جس کا باقاعدہ جسم ہے، کائنات کے جتنے عالم ہیں وہ سب کا مرکز ہے، یعنی جذب، تاثیر، تدبیر اور نظام سب کا مرکز ہے (تمام کہکشائیں جن کا ایک ایک سیارہ سورج سے بھی ہزاروں گنا بڑا ہے، اسی کے گرد گردش کر رہی ہیں اور اس کے انکار یا تاویل کی گنجائش ہی نہیں)۔‘‘ اس کی مثال ایسے ہی ہے کہ اللہ تعالیٰ کے فرمان ’’کہ ہم انصاف کے ترازو قیامت کے دن رکھیں گے‘‘ کے متعلق جب عقل پرستوں کی عقل میں یہ بات نہ آ سکی کہ اعراض کا وزن کیسے ہو گا تو انھوں نے وزن اعمال کا انکار کر دیا، یا تاویل کر دی۔ جب کہ جدید ایجادات میں تقریباً ہر چیز کا میٹر تیار ہو چکا ہے، بجلی، بخار، حرارت، سردی، کثافت، نمی، خشکی غرض بے شمار اعراض کے ماپنے تولنے کے پیمانے وجود میں آ چکے ہیں جن کی وجہ سے عقل پرستوں کے انکار اور تاویل کا تاروپود بکھر چکا ہے۔ ¤ ➋ اللہ تعالیٰ نے اپنی رحمت سے زمین پر قرآن نازل فرمایا، اس لیے پہلے اس کا ذکر فرمایا، پھر بلند آسمان کا، پھر رحمان کے عرش پر ہونے کا کہ دیکھو یہ رحمت کہاں سے نازل ہوئی اور کس عظیم شخصیت پر نازل ہوئی۔ اس میں قرآن کی رفعت و عظمت کا بھی بیان ہے اور صاحب قرآن کی عظمت کا بھی۔ مزید آپ صلی اللہ علیہ وسلم کو اور آپ کی امت کو اس نعمت کی قدر کا احساس دلانا بھی ہے اور کفار کی طرف سے پیش آنے والی مزاحمت اور مصائب و تکالیف کے مقابلے میں تسلی اور خوش خبری بھی کہ اس رحمان کی پشت پناہی حاصل ہونے کے بعد تمھیں کس بات کی پروا ہے۔ اس کے بعد موسیٰ علیہ السلام کا ذکر تفصیل سے کیا کہ انبیاء اور ان کے ساتھیوں کو اللہ تعالیٰ کی نصرت و تائید کس کس طرح حاصل ہوتی ہے اور انھیں کیا کیا آزمائشیں پیش آتی ہیں۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {لَهٗ مَا فِي السَّمٰوٰتِ … : ’’ الثَّرٰى ‘‘} گیلی مٹی کے نیچے سے مراد زمین کا سب سے نچلا حصہ ہے، یعنی وہ عرش پر مستوی ہو کر آسمانوں سے لے کر زمین کی آخری گہرائی تک ہر چیز کی تدبیر ہی نہیں کر رہا بلکہ ان سب کا مالک بھی وہ اکیلا ہی ہے۔ ملک بھی اسی کا ہے، ملکیت بھی اسی کی۔ حاکم بھی وہی ہے، مالک بھی وہی۔ ہر چیز کا وجود، حرکت، سکون، تغیر یا ثبات سب کچھ اسی کے امر سے ہے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) { وَ اِنْ تَجْهَرْ بِالْقَوْلِ … :} یعنی اگر تم اونچی آواز سے بات کرو تو وہ اسے بالاولیٰ سنتا ہے، کیونکہ وہ تو سر (پوشیدہ بات) کو جانتا ہے اور اخفی (اس سے زیادہ پوشیدہ) کو بھی۔ سر سے مراد وہ بات ہے جو تنہائی میں چپکے سے کہی جائے اور اخفیٰ (اس سے زیادہ چھپی بات) وہ ہے جو ابھی دل میں ہو اور زبان پر نہ آئی ہو۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ … :} یعنی جس ہستی کی یہ صفات بیان ہوئی ہیں وہ اللہ ہے جس کے سوا عبادت کے لائق کوئی نہیں۔ {’’ لَهُ الْاَسْمَآءُ الْحُسْنٰى ‘‘} کی تفسیر کے لیے دیکھیے سورۂ اعراف (۱۸۰)۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9تا11) ➊ { وَ هَلْ اَتٰىكَ حَدِيْثُ مُوْسٰى:} قرآن کی عظمت کے ذکر اور دعوت و تبلیغ کے سلسلے میں رسول اللہ صلی اللہ علیہ وسلم کی مشقت اور تکلیف کی طرف اشارہ فرما کر اب یہاں سے موسیٰ علیہ السلام کا قصہ بیان کیا جا رہا ہے، اس سے مقصود آپ صلی اللہ علیہ وسلم کو تسلی دینا ہے، کیونکہ جن دنوں یہ سورت نازل ہوئی مکہ میں نبی صلی اللہ علیہ وسلم کو ایسے ہی حالات درپیش تھے، جیسے موسیٰ علیہ السلام کو پیش آچکے تھے۔ اس کے علاوہ گزشتہ آیت میں{ ’’ اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ ‘‘ } کے ساتھ توحید کا جو بیان ہوا تھا اس کی مزید وضاحت مقصود ہے کہ ہر نبی یہی دعوت لے کر آیا۔ خصوصاً گزشتہ انبیاء میں سے جس نبی کے واقعات سب سے زیادہ مشہور ہیں انھیں بھی پہلی وحی میں آگاہ کر دیا گیا : « { اِنَّنِيْۤ اَنَا اللّٰهُ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدْنِيْ }» [ طٰہٰ : ۱۴ ] اور سورت کے آخر میں بھی یہی بات دہرائی : «{ اِنَّمَاۤ اِلٰهُكُمُ اللّٰهُ الَّذِيْ لَاۤ اِلٰهَ اِلَّا هُوَ وَسِعَ كُلَّ شَيْءٍ عِلْمًا }» [ طٰہٰ : ۹۸ ] ’’تمھارا معبود تو اللہ ہی ہے جس کے سوا کوئی معبود نہیں، اس نے ہر چیز کو علم سے گھیر رکھا ہے۔‘‘ ¤ {’’ وَ هَلْ اَتٰىكَ حَدِيْثُ مُوْسٰى ‘‘} یہ{’’ مَاۤ اَنْزَلْنَا عَلَيْكَ الْقُرْاٰنَ لِتَشْقٰۤى ‘‘} پر عطف ہے، یعنی نزول وحی آپ کے لیے باعث شقاوت نہیں بلکہ باعث سعادت ہے، جیسا کہ موسیٰ علیہ السلام کے لیے یہ نعمت باعث سعادت تھی۔ اور کیا آپ کو موسیٰ کی خبر پہنچی کہ ان کو یہ سعادت ملنے کا آغاز کیسے ہوا؟ استفہام ان کی خبر سننے کا شوق دلانے کے لیے ہے، پوچھنے کے لیے نہیں۔ آگ دیکھنے کا ذکر مزید شوق دلانے کے لیے ہے کہ معلوم ہو آگ دیکھنے کے بعد کیا ہوا؟ یہ اس وقت کا واقعہ ہے جب مدین میں دس سال تک جلا وطنی کی زندگی گزارنے کے بعد موسیٰ علیہ السلام اپنے اہل و عیال سمیت مصر آ رہے تھے۔ اس قصے کا کچھ حصہ سورۂ یونس اور سورۂ اعراف میں گزر چکا ہے ۔یہاں جو بات ذکر ہوئی ہے اس سے پہلے کی سرگزشت کا ذکر سورۂ قصص میں ہے۔ ¤ ➋ ’’جب اس نے آگ دیکھی‘‘ سے معلوم ہوا کہ یہ رات کا وقت تھا اور سردی کا موسم تھا۔ گھر والے ساتھ تھے اور سب کو رات گزارنے کے لیے آگ کی ضرورت تھی۔ سورۂ قصص (۲۹) اور سورۂ نمل (۷) میں ہے : «{ لَعَلَّكُمْ تَصْطَلُوْنَ }» ’’تاکہ تم تاپ لو۔‘‘ {’’ اَوْ اَجِدُ عَلَى النَّارِ هُدًى ‘‘} سے معلوم ہوا کہ موسیٰ علیہ السلام راستہ بھول گئے تھے، آگ جلانے کا پتھر (چقماق) پاس نہیں تھا، اگر تھا تو سردی کی شدت یا لکڑیوں کی نمی کی وجہ سے آگ نہیں جل رہی تھی۔ اندھیرے میں آگ کے ذریعے سے متوجہ کرنے میں ایک مناسبت یہ بھی ہے کہ اسی طرح موسیٰ علیہ السلام گمراہی کی تاریکی میں ہدایت کی روشنی کا باعث بنیں گے۔ [ التحریر و التنویر ] ¤ ➌ { اِنِّيْۤ اٰنَسْتُ نَارًا : ’’ آنَسَ ‘‘} (افعال) اس نے واضح طور پر دیکھا، اسی لیے آنکھ کی پتلی کو ’’انسان العین‘‘ کہتے ہیں، کیونکہ اسی سے کوئی چیز واضح معلوم ہوتی ہے۔ {’’ إِنَّ ‘‘} کے ساتھ تاکید اور لفظ {’’ اٰنَسْتُ ‘‘} کے استعمال سے ظاہر ہو رہا ہے کہ موسیٰ علیہ السلام پورے یقین کے ساتھ ایک بہت بڑی آگ دیکھنے کا ذکر فرما رہے ہیں، کیونکہ {’’ نَارًا ‘‘} کی تنوین بھی تعظیم کے لیے ہے۔ یہ آگ موسیٰ علیہ السلام کو متوجہ کرنے کے لیے تھی جو انھیں ایک درخت میں لگی ہوئی نظر آئی اور درخت ہی سے آواز آئی کہ بے شک میں تیرا رب ہوں۔ یہ اللہ تعالیٰ کا ذاتی نور نہیں تھا۔ اس کی دلیل یہ ہے کہ جب موسیٰ علیہ السلام نے اللہ تعالیٰ کو دیکھنے کی درخواست کی تو جواب {’’ لَنْ تَرٰنِيْ ‘‘} ملا۔ تفصیل کے لیے دیکھیے سورۂ اعراف (۱۴۳)۔ ¤ ➍ {لَعَلِّيْۤ اٰتِيْكُمْ مِّنْهَا بِقَبَسٍ : ’’ قَبَسٌ‘‘} مصدر بمعنی مفعول، اخذ کی ہوئی چیز۔ آگ جلانے کے لیے جلتی ہوئی آگ میں سے لکڑی یا سرکنڈے وغیرہ کے سرے پر آگ کا شعلہ لیا جائے تو اسے {’’قَبَسٌ‘‘} کہتے ہیں اور {’’جَذْوَةٌ‘‘} بھی۔ {’’جَذْوَةٌ‘‘} کا ایک معنی انگارا بھی ہے۔ (قاموس) ¤ ➎ { هُدًى :} یعنی کوئی راستہ بتانے والا مل جائے، یا آگ کی روشنی میں راستے کے آثار مل جائیں۔ اللہ تعالیٰ نے موسیٰ علیہ السلام کی زبان پر وہی چیز جاری فرما دی جو فی الواقع وجود میں آنے والی تھی، چنانچہ انھیں کفر کی برودت سے بچانے والا ایمان کا شعلہ بھی مل گیا اور صراط مستقیم کی رہنمائی بھی حاصل ہو گئی۔ ¤ ➏ { ’’ نُوْدِيَ ‘‘} (آواز دی گئی) یہ آواز ایک درخت سے آ رہی تھی۔ تفصیل کے لیے دیکھیے سورۂ قصص (۳۰) فعل مجہول لانے میں بھی یہ جاننے کا شوق ابھارنا مقصود ہے کہ آواز دینے والا کون تھا اور اس نے کیا آواز دی؟"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 9تا11) ➊ { وَ هَلْ اَتٰىكَ حَدِيْثُ مُوْسٰى:} قرآن کی عظمت کے ذکر اور دعوت و تبلیغ کے سلسلے میں رسول اللہ صلی اللہ علیہ وسلم کی مشقت اور تکلیف کی طرف اشارہ فرما کر اب یہاں سے موسیٰ علیہ السلام کا قصہ بیان کیا جا رہا ہے، اس سے مقصود آپ صلی اللہ علیہ وسلم کو تسلی دینا ہے، کیونکہ جن دنوں یہ سورت نازل ہوئی مکہ میں نبی صلی اللہ علیہ وسلم کو ایسے ہی حالات درپیش تھے، جیسے موسیٰ علیہ السلام کو پیش آچکے تھے۔ اس کے علاوہ گزشتہ آیت میں{ ’’ اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ ‘‘ } کے ساتھ توحید کا جو بیان ہوا تھا اس کی مزید وضاحت مقصود ہے کہ ہر نبی یہی دعوت لے کر آیا۔ خصوصاً گزشتہ انبیاء میں سے جس نبی کے واقعات سب سے زیادہ مشہور ہیں انھیں بھی پہلی وحی میں آگاہ کر دیا گیا : « { اِنَّنِيْۤ اَنَا اللّٰهُ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدْنِيْ }» [ طٰہٰ : ۱۴ ] اور سورت کے آخر میں بھی یہی بات دہرائی : «{ اِنَّمَاۤ اِلٰهُكُمُ اللّٰهُ الَّذِيْ لَاۤ اِلٰهَ اِلَّا هُوَ وَسِعَ كُلَّ شَيْءٍ عِلْمًا }» [ طٰہٰ : ۹۸ ] ’’تمھارا معبود تو اللہ ہی ہے جس کے سوا کوئی معبود نہیں، اس نے ہر چیز کو علم سے گھیر رکھا ہے۔‘‘ ¤ {’’ وَ هَلْ اَتٰىكَ حَدِيْثُ مُوْسٰى ‘‘} یہ{’’ مَاۤ اَنْزَلْنَا عَلَيْكَ الْقُرْاٰنَ لِتَشْقٰۤى ‘‘} پر عطف ہے، یعنی نزول وحی آپ کے لیے باعث شقاوت نہیں بلکہ باعث سعادت ہے، جیسا کہ موسیٰ علیہ السلام کے لیے یہ نعمت باعث سعادت تھی۔ اور کیا آپ کو موسیٰ کی خبر پہنچی کہ ان کو یہ سعادت ملنے کا آغاز کیسے ہوا؟ استفہام ان کی خبر سننے کا شوق دلانے کے لیے ہے، پوچھنے کے لیے نہیں۔ آگ دیکھنے کا ذکر مزید شوق دلانے کے لیے ہے کہ معلوم ہو آگ دیکھنے کے بعد کیا ہوا؟ یہ اس وقت کا واقعہ ہے جب مدین میں دس سال تک جلا وطنی کی زندگی گزارنے کے بعد موسیٰ علیہ السلام اپنے اہل و عیال سمیت مصر آ رہے تھے۔ اس قصے کا کچھ حصہ سورۂ یونس اور سورۂ اعراف میں گزر چکا ہے ۔یہاں جو بات ذکر ہوئی ہے اس سے پہلے کی سرگزشت کا ذکر سورۂ قصص میں ہے۔ ¤ ➋ ’’جب اس نے آگ دیکھی‘‘ سے معلوم ہوا کہ یہ رات کا وقت تھا اور سردی کا موسم تھا۔ گھر والے ساتھ تھے اور سب کو رات گزارنے کے لیے آگ کی ضرورت تھی۔ سورۂ قصص (۲۹) اور سورۂ نمل (۷) میں ہے : «{ لَعَلَّكُمْ تَصْطَلُوْنَ }» ’’تاکہ تم تاپ لو۔‘‘ {’’ اَوْ اَجِدُ عَلَى النَّارِ هُدًى ‘‘} سے معلوم ہوا کہ موسیٰ علیہ السلام راستہ بھول گئے تھے، آگ جلانے کا پتھر (چقماق) پاس نہیں تھا، اگر تھا تو سردی کی شدت یا لکڑیوں کی نمی کی وجہ سے آگ نہیں جل رہی تھی۔ اندھیرے میں آگ کے ذریعے سے متوجہ کرنے میں ایک مناسبت یہ بھی ہے کہ اسی طرح موسیٰ علیہ السلام گمراہی کی تاریکی میں ہدایت کی روشنی کا باعث بنیں گے۔ [ التحریر و التنویر ] ¤ ➌ { اِنِّيْۤ اٰنَسْتُ نَارًا : ’’ آنَسَ ‘‘} (افعال) اس نے واضح طور پر دیکھا، اسی لیے آنکھ کی پتلی کو ’’انسان العین‘‘ کہتے ہیں، کیونکہ اسی سے کوئی چیز واضح معلوم ہوتی ہے۔ {’’ إِنَّ ‘‘} کے ساتھ تاکید اور لفظ {’’ اٰنَسْتُ ‘‘} کے استعمال سے ظاہر ہو رہا ہے کہ موسیٰ علیہ السلام پورے یقین کے ساتھ ایک بہت بڑی آگ دیکھنے کا ذکر فرما رہے ہیں، کیونکہ {’’ نَارًا ‘‘} کی تنوین بھی تعظیم کے لیے ہے۔ یہ آگ موسیٰ علیہ السلام کو متوجہ کرنے کے لیے تھی جو انھیں ایک درخت میں لگی ہوئی نظر آئی اور درخت ہی سے آواز آئی کہ بے شک میں تیرا رب ہوں۔ یہ اللہ تعالیٰ کا ذاتی نور نہیں تھا۔ اس کی دلیل یہ ہے کہ جب موسیٰ علیہ السلام نے اللہ تعالیٰ کو دیکھنے کی درخواست کی تو جواب {’’ لَنْ تَرٰنِيْ ‘‘} ملا۔ تفصیل کے لیے دیکھیے سورۂ اعراف (۱۴۳)۔ ¤ ➍ {لَعَلِّيْۤ اٰتِيْكُمْ مِّنْهَا بِقَبَسٍ : ’’ قَبَسٌ‘‘} مصدر بمعنی مفعول، اخذ کی ہوئی چیز۔ آگ جلانے کے لیے جلتی ہوئی آگ میں سے لکڑی یا سرکنڈے وغیرہ کے سرے پر آگ کا شعلہ لیا جائے تو اسے {’’قَبَسٌ‘‘} کہتے ہیں اور {’’جَذْوَةٌ‘‘} بھی۔ {’’جَذْوَةٌ‘‘} کا ایک معنی انگارا بھی ہے۔ (قاموس) ¤ ➎ { هُدًى :} یعنی کوئی راستہ بتانے والا مل جائے، یا آگ کی روشنی میں راستے کے آثار مل جائیں۔ اللہ تعالیٰ نے موسیٰ علیہ السلام کی زبان پر وہی چیز جاری فرما دی جو فی الواقع وجود میں آنے والی تھی، چنانچہ انھیں کفر کی برودت سے بچانے والا ایمان کا شعلہ بھی مل گیا اور صراط مستقیم کی رہنمائی بھی حاصل ہو گئی۔ ¤ ➏ { ’’ نُوْدِيَ ‘‘} (آواز دی گئی) یہ آواز ایک درخت سے آ رہی تھی۔ تفصیل کے لیے دیکھیے سورۂ قصص (۳۰) فعل مجہول لانے میں بھی یہ جاننے کا شوق ابھارنا مقصود ہے کہ آواز دینے والا کون تھا اور اس نے کیا آواز دی؟"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 9تا11) ➊ { وَ هَلْ اَتٰىكَ حَدِيْثُ مُوْسٰى:} قرآن کی عظمت کے ذکر اور دعوت و تبلیغ کے سلسلے میں رسول اللہ صلی اللہ علیہ وسلم کی مشقت اور تکلیف کی طرف اشارہ فرما کر اب یہاں سے موسیٰ علیہ السلام کا قصہ بیان کیا جا رہا ہے، اس سے مقصود آپ صلی اللہ علیہ وسلم کو تسلی دینا ہے، کیونکہ جن دنوں یہ سورت نازل ہوئی مکہ میں نبی صلی اللہ علیہ وسلم کو ایسے ہی حالات درپیش تھے، جیسے موسیٰ علیہ السلام کو پیش آچکے تھے۔ اس کے علاوہ گزشتہ آیت میں{ ’’ اَللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ ‘‘ } کے ساتھ توحید کا جو بیان ہوا تھا اس کی مزید وضاحت مقصود ہے کہ ہر نبی یہی دعوت لے کر آیا۔ خصوصاً گزشتہ انبیاء میں سے جس نبی کے واقعات سب سے زیادہ مشہور ہیں انھیں بھی پہلی وحی میں آگاہ کر دیا گیا : « { اِنَّنِيْۤ اَنَا اللّٰهُ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدْنِيْ }» [ طٰہٰ : ۱۴ ] اور سورت کے آخر میں بھی یہی بات دہرائی : «{ اِنَّمَاۤ اِلٰهُكُمُ اللّٰهُ الَّذِيْ لَاۤ اِلٰهَ اِلَّا هُوَ وَسِعَ كُلَّ شَيْءٍ عِلْمًا }» [ طٰہٰ : ۹۸ ] ’’تمھارا معبود تو اللہ ہی ہے جس کے سوا کوئی معبود نہیں، اس نے ہر چیز کو علم سے گھیر رکھا ہے۔‘‘ ¤ {’’ وَ هَلْ اَتٰىكَ حَدِيْثُ مُوْسٰى ‘‘} یہ{’’ مَاۤ اَنْزَلْنَا عَلَيْكَ الْقُرْاٰنَ لِتَشْقٰۤى ‘‘} پر عطف ہے، یعنی نزول وحی آپ کے لیے باعث شقاوت نہیں بلکہ باعث سعادت ہے، جیسا کہ موسیٰ علیہ السلام کے لیے یہ نعمت باعث سعادت تھی۔ اور کیا آپ کو موسیٰ کی خبر پہنچی کہ ان کو یہ سعادت ملنے کا آغاز کیسے ہوا؟ استفہام ان کی خبر سننے کا شوق دلانے کے لیے ہے، پوچھنے کے لیے نہیں۔ آگ دیکھنے کا ذکر مزید شوق دلانے کے لیے ہے کہ معلوم ہو آگ دیکھنے کے بعد کیا ہوا؟ یہ اس وقت کا واقعہ ہے جب مدین میں دس سال تک جلا وطنی کی زندگی گزارنے کے بعد موسیٰ علیہ السلام اپنے اہل و عیال سمیت مصر آ رہے تھے۔ اس قصے کا کچھ حصہ سورۂ یونس اور سورۂ اعراف میں گزر چکا ہے ۔یہاں جو بات ذکر ہوئی ہے اس سے پہلے کی سرگزشت کا ذکر سورۂ قصص میں ہے۔ ¤ ➋ ’’جب اس نے آگ دیکھی‘‘ سے معلوم ہوا کہ یہ رات کا وقت تھا اور سردی کا موسم تھا۔ گھر والے ساتھ تھے اور سب کو رات گزارنے کے لیے آگ کی ضرورت تھی۔ سورۂ قصص (۲۹) اور سورۂ نمل (۷) میں ہے : «{ لَعَلَّكُمْ تَصْطَلُوْنَ }» ’’تاکہ تم تاپ لو۔‘‘ {’’ اَوْ اَجِدُ عَلَى النَّارِ هُدًى ‘‘} سے معلوم ہوا کہ موسیٰ علیہ السلام راستہ بھول گئے تھے، آگ جلانے کا پتھر (چقماق) پاس نہیں تھا، اگر تھا تو سردی کی شدت یا لکڑیوں کی نمی کی وجہ سے آگ نہیں جل رہی تھی۔ اندھیرے میں آگ کے ذریعے سے متوجہ کرنے میں ایک مناسبت یہ بھی ہے کہ اسی طرح موسیٰ علیہ السلام گمراہی کی تاریکی میں ہدایت کی روشنی کا باعث بنیں گے۔ [ التحریر و التنویر ] ¤ ➌ { اِنِّيْۤ اٰنَسْتُ نَارًا : ’’ آنَسَ ‘‘} (افعال) اس نے واضح طور پر دیکھا، اسی لیے آنکھ کی پتلی کو ’’انسان العین‘‘ کہتے ہیں، کیونکہ اسی سے کوئی چیز واضح معلوم ہوتی ہے۔ {’’ إِنَّ ‘‘} کے ساتھ تاکید اور لفظ {’’ اٰنَسْتُ ‘‘} کے استعمال سے ظاہر ہو رہا ہے کہ موسیٰ علیہ السلام پورے یقین کے ساتھ ایک بہت بڑی آگ دیکھنے کا ذکر فرما رہے ہیں، کیونکہ {’’ نَارًا ‘‘} کی تنوین بھی تعظیم کے لیے ہے۔ یہ آگ موسیٰ علیہ السلام کو متوجہ کرنے کے لیے تھی جو انھیں ایک درخت میں لگی ہوئی نظر آئی اور درخت ہی سے آواز آئی کہ بے شک میں تیرا رب ہوں۔ یہ اللہ تعالیٰ کا ذاتی نور نہیں تھا۔ اس کی دلیل یہ ہے کہ جب موسیٰ علیہ السلام نے اللہ تعالیٰ کو دیکھنے کی درخواست کی تو جواب {’’ لَنْ تَرٰنِيْ ‘‘} ملا۔ تفصیل کے لیے دیکھیے سورۂ اعراف (۱۴۳)۔ ¤ ➍ {لَعَلِّيْۤ اٰتِيْكُمْ مِّنْهَا بِقَبَسٍ : ’’ قَبَسٌ‘‘} مصدر بمعنی مفعول، اخذ کی ہوئی چیز۔ آگ جلانے کے لیے جلتی ہوئی آگ میں سے لکڑی یا سرکنڈے وغیرہ کے سرے پر آگ کا شعلہ لیا جائے تو اسے {’’قَبَسٌ‘‘} کہتے ہیں اور {’’جَذْوَةٌ‘‘} بھی۔ {’’جَذْوَةٌ‘‘} کا ایک معنی انگارا بھی ہے۔ (قاموس) ¤ ➎ { هُدًى :} یعنی کوئی راستہ بتانے والا مل جائے، یا آگ کی روشنی میں راستے کے آثار مل جائیں۔ اللہ تعالیٰ نے موسیٰ علیہ السلام کی زبان پر وہی چیز جاری فرما دی جو فی الواقع وجود میں آنے والی تھی، چنانچہ انھیں کفر کی برودت سے بچانے والا ایمان کا شعلہ بھی مل گیا اور صراط مستقیم کی رہنمائی بھی حاصل ہو گئی۔ ¤ ➏ { ’’ نُوْدِيَ ‘‘} (آواز دی گئی) یہ آواز ایک درخت سے آ رہی تھی۔ تفصیل کے لیے دیکھیے سورۂ قصص (۳۰) فعل مجہول لانے میں بھی یہ جاننے کا شوق ابھارنا مقصود ہے کہ آواز دینے والا کون تھا اور اس نے کیا آواز دی؟"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { فَاخْلَعْ نَعْلَيْكَ :} غالباً اسی سے یہودیوں نے یہ مسئلہ بنا لیا ہے کہ جوتا پہن ککر نماز پڑھنا جائز نہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے یہ غلط فہمی دور کرنے کے لیے فرمایا : [ خَالِفُوا الْيَهُوْدَ فَإِنَّهُمْ لَا يُصَلُّوْنَ فِيْ نِعَالِهِمْ وَلَا خ خِفَافِهِمْ ] [ أبوداوٗد، الصلاۃ، باب الصلاۃ في النعل : ۶۵۲، و صححہ الألباني ] ’’یہودیوں کے خلاف عمل کرو، کیونکہ وہ اپنے جوتوں اور موزوں میں نماز نہیں پڑھتے۔‘‘ اگر دوسری حدیث نہ ہوتی تو اس حدیث کی رو سے جوتوں سمیت نماز پڑھنا فرض تھا۔ وہ حدیث یہ ہے، عبد اللہ بن عمرو رضی اللہ عنھما فرماتے ہیں : [ رَأَيْتُ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيْ حَافِيًا وَمُنْتَعِلًا ] [ أبوداوٗد، الصلاۃ، باب الصلاۃ في النعل : ۶۵۳ ] ’’میں نے رسول اللہ صلی اللہ علیہ وسلم کو ننگے پاؤں اور جوتا پہن کر (دونوں طرح) نماز پڑھتے ہوئے دیکھا ہے۔‘‘ ¤ ➋ { اِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى :} ابن عباس رضی اللہ عنھما نے فرمایا : ’’طویٰ اس وادی کا نام ہے۔‘‘ [ طبري بسند حسن ] یہ الفاظ دلیل ہیں کہ اس وقت موسیٰ علیہ السلام کے جوتے ناپاک تھے، اگر وہ پاک ہوتے تو اس وادی کو پاک بتا کر جوتے اتارنے کا حکم نہ دیا جاتا۔ ابوسعید خدری رضی اللہ عنہ فرماتے ہیں : [ بَيْنَمَا رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيْ بِأَصْحَابِهِ إِذْ خَلَعَ نَعْلَيْهِ فَوَضَعَهُمَا عَنْ يَسَارِهِ، فَلَمَّا رَأَی ذٰلِكَ الْقَوْمُ أَلْقَوْا نِعَالَهُمْ، فَلَمَّا قَضَی رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ قَالَ مَا حَمَلَكُمْ عَلٰی إِلْقَائِكُمْ  نِعَالَكُمْ ؟ قَالُوْا رَأَيْنَاكَ أَلْقَيْتَ نَعْلَيْكَ فَأَلْقَيْنَا نِعَالَنَا، فَقَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ إِنَّ جِبْرِيْلَ عَلَيْهِ السَّلَامُ أَتَانِيْ فَأَخْبَرَننِيْ أَنَّ فِيْهِمَا قَذَرًا، أَوْ قَالَ أَذًی، وَقَالَ إِذَا جَاءَ أَحَدُكُمْ إِلَی الْمَسْجِدِ فَلْيَنْطُرْ فإِنْ رَأَی فِيْ نَعْلَيْهِ قَذَرًا أَوْ أَذًی فَلْيَمْسَحْهُ وَلْيُصَلِّ فِيْهِمَا ] [ أبوداوٗد، االصلاۃ، باب الصلاۃ في النعل : ۶۵۰، و صححہ الألباني ] ’’رسول اللہ صلی اللہ علیہ وسلم اپنے اصحاب کو نماز پڑھا رہے تھے، دوران نماز آپ نے اپنے جوتے اتارے اور اپنی بائیں طرف رکھ دیے۔ جب لوگوں نے یہ دیکھا تو انھوں نے بھی اپنے جوتے اتار دیے۔ جب آپ نے اپنی نماز پوری کی تو فرمایا : ’’تمھارے جوتے اتارنے کا باعث کیا ہوا؟‘‘ انھوں نے کہا : ’’ہم نے آپ کو دیکھا کہ آپ نے جوتے اتارے تو ہم نے بھی اتار دیے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’میرے پاس جبریل آئے اور انھوں نے مجھے بتایا کہ ان میں گندگی لگی ہے۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے فرمایا : ’’جب تم میں سے کوئی مسجد کو آئے تو دیکھ لے، پھر اگر اپنے جوتوں میں کوئی گندگی دیکھے تو اسے مل کر صاف کر لے اور انھیں پہن کر نماز پڑھ لے۔‘‘ ¤ یہ حدیث دلیل ہے کہ موسیٰ علیہ السلام کو جوتے اتارنے کے حکم کی وجہ وادی کا پاک ہونا اور جوتوں کا ناپاک ہونا تھا۔ یہ وجہ نہ تھی کہ کسی مقدس جگہ میں جوتے پہن کر جانا منع ہے، کیونکہ یہ تو سب جانتے ہیں کہ مسجد پاک ترین جگہ ہے اور اسے پاک رکھنے کا حکم بھی ہے۔ دیکھیے سورۂ بقرہ (۱۲۵) اور سورۂ حج (۲۶) اور عائشہ رضی اللہ عنھا سے روایت ہے : [ أَمَرَ رَسُوْلُ اللّٰهِ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ بِبِنَاءِ الْمَسَاجِدِ فِي الدُّوْرِ وَأَنْ تُنَظَّفَ وَتُطَيَّبَ ] [ أبوداوٗد، الصلاۃ، باب اتخاذ المساجد فی الدور : ۴۵۵۔ ترمذی : ۵۹۴۔ ابن ماجہ : ۷۵۸، صحیح ] ’’رسول اللہ صلی اللہ علیہ وسلم نے محلوں میں مسجدیں بنانے کا حکم دیا اور حکم دیا کہ انھیں صاف ستھرا رکھا جائے اور خوشبو دار بنایا جائے۔‘‘ جوتے پاک ہوں تو مسجد میں جا سکتے ہیں تو کسی اور جگہ کیوں نہیں جا سکتے؟ بعض روایات میں ہے کہ موسیٰ علیہ السلام کے جوتے مردار گدھے کے چمڑے کے تھے، اس لیے انھیں اتارنے کا حکم ہوا، مگر یہ روایات پایۂ ثبوت کو نہیں پہنچتیں۔ اس لیے یہ بات اللہ تعالیٰ ہی بہتر جانتا ہے کہ ان کے جوتوں میں کیا چیز تھی جو وادی مقدس کے لائق نہ تھی، کیونکہ پاک جوتے جب مسجد نبوی میں پہنے جا سکتے ہیں تو تین مسجدوں سے زیادہ مقدس جگہ کون سی ہوگی؟ ¤ ➌ اس آیت اور حدیث سے معلوم ہوا کہ نہ موسیٰ علیہ السلام غیب جانتے تھے اور نہ ہمارے رسول کریم صلی اللہ علیہ وسلم ، ورنہ جبریل علیہ السلام کو جوتوں میں نجاست کی اطلاع کے لیے دوران نماز آپ کے پاس آنے کی ضرورت نہ تھی اور اگر موسیٰ علیہ السلام غیب جانتے ہوتے تو نہ راستہ بھولتے اور نہ آگ کو عام آگ سمجھتے، نہ اللہ تعالیٰ کو وادی مقدس کا بتا کر انھیں جوتے اتارنے کا حکم دینا پڑتا اور نہ یہ کہہ کر تعارف کروانا پڑتا کہ میں تیرا رب تجھ سے مخاطب ہوں اور نہ اس کے بعد جبریل علیہ السلام کو بار بار آ کر وحی پہنچانا پڑتی۔ مگر افسوس کہ ولیوں اور نبیوں کو غیب دان کہنے والے ذرہ برابر نہیں سوچتے۔ ¤ ➍ اوپر کی حدیث سے معلوم ہوا کہ جوتے پاک کرنے کے لیے کپڑے کو پاک کرنے کی طرح دھونا ضروری نہیں، بلکہ صرف مٹی سے مل کر صاف کر دینا کافی ہے۔ علاوہ ازیں یہ حدیث ہر اس بہانے کا جواب ہے جو جوتوں سمیت نماز سے روکنے والے کرتے ہیں، مثلاً یہ کہ یہ سفر کے لیے ہے، یا یہ کسی میدان وغیرہ میں نماز کے لیے ہے مسجد کے لیے نہیں، یا یہ کہ جوتا نیا ہو تو جائز ہے، یا یہ کہ دھویا ہوا ہو تو ٹھیک ہے، یا یہ کہ جوتا پہننا اللہ تعالیٰ کے حضور پیشی کے ادب کے خلاف ہے وغیرہ، ان تمام باتوں کا جواب اسی حدیث پر غور کر نے سے مل جاتا ہے۔ ¤ ➎ جیسا کہ اوپر گزرا جوتوں سمیت نماز پڑھنا فرض نہیں مستحب ہے۔ اس لیے اگر لا علم لوگوں کے فتنے میں پڑنے کا خوف ہو تو جوتوں سمیت نماز پڑھنے سے پہلے انھیں اچھی طرح سمجھانا لازم ہے، ایسا نہ ہو کہ وہ متنفر ہو کر نماز پڑھنا ہی چھوڑ دیں۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) { وَ اَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِمَا يُوْحٰى:} نبوت کے حصول میں کسی کی جد و جہد یا محنت کا کچھ دخل نہیں، یہ صرف اور صرف اللہ تعالیٰ کا انتخاب ہے۔ دیکھیے سورۂ حج (۷۵) قادیانی دجال نے اسے مجاہدہ و کسب سے حاصل ہو سکنے کا دعویٰ کیا، چنانچہ اس کی زندگی ہی میں اس کے پیروکاروں میں سے تیرہ آدمیوں نے نبوت کا دعویٰ کر دیا۔ دیکھیے قادیانیت از ابوالحسن علی ندوی۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { اِنَّنِيْۤ اَنَا اللّٰهُ :} اللہ تعالیٰ نے پہلے موسیٰ علیہ السلام کو اس تعلق سے آگاہ کیا جو اللہ تعالیٰ اور موسیٰ علیہ السلام کے درمیان تھا کہ بلاشبہ میں تیرا رب ہوں جو تجھ سے مخاطب ہوں، یعنی تجھے پیدا کرنے والا، تیری پرورش کرنے والا اور تیری ہر ضرورت پوری کرنے والا میں ہی ہوں۔ پھر جوتے اتارنے کے حکم کے بعد وحی کو غور سے سننے کی تاکید فرمائی، کیونکہ چننے سے مقصود ہی وحی کے ذریعے سے رسالت کی ذمہ داریاں سونپنا تھا۔ اب ضمیر متکلم ـ{’’ اَنَا ‘‘} کے بعد اپنا ذاتی نام بتایا، کیونکہ ملاقات میں پہلی چیز یہی ہے کہ ایک دوسرے کا نام معلوم ہو۔ اللہ تعالیٰ نے اشارہ فرمایا کہ میں تو اپنے کلیم کا نام جانتا ہی ہوں، میرا نام اللہ ہے۔ یاد رہے کہ اللہ تعالیٰ کے باقی سب نام صفاتی ہیں جن میں اس کے ننانوے نام بھی شامل ہیں اور وہ بے شمار نام بھی جن سے اس نے ابھی تک کسی کو آگاہ نہیں کیا۔ لفظ ’’اللہ‘‘ عربی زبان میں اس ذات پاک کا نام ہے۔ جب ’’اللہ‘‘ کہہ دیا تو اس میں اس کے تمام نام بھی آ گئے اور تمام صفات بھی۔ {’’ إِنَّ‘‘} کے ساتھ تاکید موسیٰ علیہ السلام سے شک کا امکان دور کرنے کے لیے ہے، کیونکہ انوکھی بات سن کر جلدی یقین نہیں آتا۔ ¤ ➋ { لَاۤ اِلٰهَ اِلَّاۤ اَنَا:’’ اِنَّنِيْۤ ‘‘ } کی پہلی خبر {’’ اَنَا اللّٰهُ ‘‘} تھی، {’’ لَاۤ اِلٰهَ اِلَّاۤ اَنَا ‘‘} دوسری خبر ہے۔ یہ سب سے پہلی بات ہے جسے جاننا، اس پر یقین رکھنا اور اس کے مطابق عمل کرنا ہر جن و انس پر واجب ہے۔ اسی بات کی تعلیم کے لیے تمام انبیاء مبعوث فرمائے گئے۔ دیکھیے سورۂ انبیاء (۲۵) {’’ فَاعْبُدْنِيْ ‘‘} یہ ہے وہ مقصد جس کے لیے جن و انس کو پیدا کیا گیا، جیسا کہ فرمایا : «{ وَ مَا خَلَقْتُ الْجِنَّ وَ الْاِنْسَ اِلَّا لِيَعْبُدُوْنِ }» [ الذاریات : ۵۶ ] ’’اور میں نے جنوں اور انسانوں کو پیدا نہیں کیا مگر اس لیے کہ وہ میری عبادت کریں۔‘‘ یعنی جب میرے سوا کوئی عبادت کے لائق نہیں تو میری عبادت کر۔ عبادت میں ہر وہ عمل آ جاتا ہے جو انتہائی محبت کے ساتھ انتہائی درجے کی عاجزی اور تعظیم پر دلالت کرتا ہو، اس میں قول، فعل اور دل کا اخلاص سب شامل ہیں۔ ¤ ➌ { وَ اَقِمِ الصَّلٰوةَ لِذِكْرِيْ : ’’ فَاعْبُدْنِيْ ‘‘} میں اگرچہ ہر قسم کی بدنی و مالی عبادت کا ذکر آ گیا تھھا، لیکن چونکہ نماز تمام عبادتوں کی جامع اور سب سے اہم عبادت ہے اور اسلام قبول کرنے کے بعد ایمان کی سب سے پہلی شرط اور علامت ہے کہ جس سے مسلمان کی پہچان ہو کر اس کا خون اور مال محفوظ ہو جاتا ہے (دیکھیے توبہ : ۵،۱۱) اس لیے اس کا خاص طور پر الگ ذکر بھی فرمایا۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’موسیٰ علیہ السلام کو پہلی وحی میں نماز کا حکم ہے اور ہمارے پیغمبر صلی اللہ علیہ وسلم کو بھی {’’وَرَبَّكَ فَكَبِّرْ ‘‘} فرمایا گیا۔‘‘ (موضح) ¤ {’’ لِذِكْررِيْ ‘‘} کی دو تفسیریں ہیں اور دونوں درست ہیں۔ پہلی یہ کہ نماز کا مقصد یہ ہے کہ بندہ اللہ کی یاد سے غافل نہ ہو، ایک نماز سے فارغ ہو تو اگلی کے انتظار میں مشغول رہے، جیسا کہ حدیث مبارکہ میں آتا ہے : [ وَ رَجُلٌ قَلْبُهُ مُعَلَّقٌ بِالْمَسْججِدِ ] [ بخاری : ۶۸۰۶] اس طرح اس کا سارا وقت ہی نماز میں شمار ہو گا جو اللہ کی یاد کا سب سے اچھا طریقہ ہے۔ دیکھیے سورۂ بنی اسرائیل کی آیت (۷۸) کی تفسیر۔ ہر وقت یاد رکھنے کا نتیجہ اللہ کی نافرمانی سے اجتناب ہو گا، جیسا کہ فرمایا : «{ اِنَّ الصَّلٰوةَ تَنْهٰى عَنِ الْفَحْشَآءِ وَ الْمُنْكَرِ }» [ العنکبوت : ۴۵ ] ’’بے شک نماز بے حیائی اور برائی سے روکتی ہے۔‘‘ دوسری تفسیر یہ کہ اگر بھول جائے تو یاد آنے پر نماز پڑھ لے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ نَسِيَ صَلَاةً فَلْيُصَلِّ إِذَا ذَكَرَهَا لاَ كَفَّارَةَ لَهَا إِلاَّ ذٰلِكَ «{ وَ اَقِمِ الصَّلٰوةَ لِذِكْرِيْ }» ] [ بخاری، مواقیت الصلاۃ، باب من نسي صلاۃ فلیصل إذا ذکر… : ۵۹۷، عن أنس رضی اللہ عنہ ] ’’جو شخص کوئی نماز بھول جائے تو جب اسے یاد آئے پڑھ لے، اس کا کفارہ اس کے سوا کچھ نہیں۔‘‘ اور پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «{ وَ اَقِمِ الصَّلٰوةَ لِذِكْرِيْ }» ’’اور نماز میری یاد کے وقت قائم کر۔‘‘ ایک روایت میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ نَسِيَ صَلَاةً أَوْ نَامَ عَنْهَا فَكَفَّارَتُهَا اَنْ يُصَلِّيَهَا  إِذَا ذَكَرَهَا ] [ مسلم، المساجد، باب قضاء الصلاۃ الفائتۃ… : 684/315، عن أنس رضی اللہ عنہ ]’’جو شخص کوئی نماز بھول جائے یا اس سے سویا رہ جائے تو اس کا کفارہ یہ ہے کہ جب اسے یاد آئے پڑھ لے۔‘‘ اللہ تعالیٰ نے فرمایا : «{ وَ اذْكُرْ رَّبَّكَ اِذَا نَسِيْتَ }» [ الکہف : ۲۴ ] ’’اور اپنے رب کو یاد کر جب تو بھول جائے۔‘‘"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { اِنَّ السَّاعَةَ اٰتِيَةٌ:} توحید، عبادت اور نماز کی تاکید کے بعد ایمان کے ایک اور بنیادی رکن قیامت کے یقینی ہونے کا ذکر فرمایا، تاکہ ہر شخص کو اس کی سعی و کوشش کی جزا دی جائے۔ اس صورت میں {’’ لِتُجْزٰى ‘‘ ’’ اٰتِيَةٌ ‘‘} کے متعلق ہو گا۔ قیامت کا یقین ہی ایسی چیز ہے جو انسان کو اللہ تعالیٰ کی عبادت اور اس کی اطاعت پر آمادہ کرتی ہے، ورنہ باز پرس اور اللہ کے سامنے پیش ہونے کا یقین نہ ہو تو جائز و ناجائز کی تمیز کون کرتا ہے؟ ¤ ➋ {اَكَادُ اُخْفِيْهَا لِتُجْزٰى … : } یہاں ایک مشہور سوال ہے کہ جس کام کے متعلق {’’كَادَ يَكَادُ‘‘} استعمال ہو اس کا مطلب یہ ہوتا ہے کہ وہ واقع ہونے کے قریب ہے مگر واقع نہیں ہوا، جیسا کہ سورۂ بقرہ کی آیت (۲۰) : «{ يَكَادُ الْبَرْقُ يَخْطَفُ اَبْصَارَهُمْ }» (بجلی قریب ہے کہ ان کی نگاہوں کو اُچک لے) میں ہے۔ مفسرین نے اس کے بہت سے جواب دیے ہیں، مگر مجھے ابن جزی رحمہ اللہ کے جواب پر اطمینان ہوتا ہے کہ ’’اللہ تعالیٰ نے قیامت کے وقت کو پوشیدہ رکھا ہے اور کسی کو نہیں بتایا، یہاں تک کہ قریب تھا کہ وہ قیامت کے واقع ہونے کو بھی چھپا کر رکھتا اور کسی کو اس کی خبر نہ دیتا، مگر یہ اس کا کرم ہے کہ اس نے اسے پوشیدہ نہیں رکھا، بلکہ اس کے واقع ہونے کی بات سب کو بتا دی ہے، تاکہ لوگ بالکل غافل نہ رہیں۔ اس صورت میں {’’كَادَ‘‘} اور {’’ أُخْفِيْ‘‘ } دونوں اپنے اصل معنی پر رہتے ہیں کہ قریب تھا کہ قیامت کا واقع ہونا چھپا لیا جاتا، مگر ایسا نہیں ہوا۔‘‘ (التسہیل)"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {فَلَا يَصُدَّنَّكَ عَنْهَا …:} اس آیت سے حاصل ہونے والے فوائد میں سے ایک فائدہ مفسر زمخشری کے الفاظ میں یہ ہے : ’’جو لوگ آخرت پر ایمان نہیں رکھتے وہ جم غفیر ہیں، کیونکہ کفار کے لیے قیامت کو تسلیم کرنے سے زیادہ مشکل کوئی چیز نہیں، نہ ہی وہ اس سے زیادہ کسی چیز کا انکار کرتے ہیں۔ سو ایسا ہر گز نہ ہو کہ ان کی طرف سے آنے والے مصائب کی کثرت اور ان کی بہت بڑی تعداد تمھیں خوف زدہ کر دے اور ان کی کثرت تمھارے قدم پھسلنے کا باعث بن جائے۔ یاد رکھو کہ وہ جس قدر بھی تعداد میں زیادہ ہوں وہ صرف اور صرف اپنی خواہش نفس کے پیچھے چل رہے ہیں، کسی دلیل و برہان کے پیچھے نہیں اور اس میں بہت بڑی ترغیب ہے کہ دلیل کا علم اور اس کی پیروی لازم ہے اور تقلید سے بچنا نہایت ضروری ہے، کیونکہ تقلید اور اہل تقلید کا انجام ہلاکت ہے۔‘‘ دوسرا فائدہ یہ ہے کہ دنیا پرست لوگوں، خصوصاً کفار کی مجلس اور ان سے نرمی اور مداہنت اختیار کرنے سے پرہیز لازم ہے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’نہ روک دے اس سے ‘‘ یعنی قیامت کے یقین لانے سے یا نماز سے۔ جب اللہ تعالیٰ نے موسیٰ علیہ السلام کو برے کی صحبت سے منع کیا تو اور کوئی کیا ہے؟‘‘ (موضح)"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) { وَ مَا تِلْكَ بِيَمِيْنِكَ يٰمُوْسٰى :} اللہ تعالیٰ کے اس سوال کا یہ مطلب نہیں کہ اللہ تعالیٰ کو معلوم نہ تھا کہ موسیٰ علیہ السلام کے ہاتھ میں کیا ہے، بلکہ اس میں حکمت یہ تھی کہ موسیٰ علیہ السلام کو اس کے عصا ہونے کا یقین ہو جائے، بعد میں سانپ بننے پر انھیں یہ شک پیدا نہ ہو کہ شاید میں نے کوئی اور چیز پکڑی ہوئی تھی۔ (واللہ اعلم) یہ بھی ہو سکتا ہے کہ اللہ تعالیٰ نے موسیٰ علیہ السلام کے دل سے ہیبت دور کرنے اور مانوس کرنے کے لیے لاٹھی کے متعلق سوال فرمایا ہو، تا کہ انھیں اگلا حکم دیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { قَالَ هِيَ عَصَايَ … :} جواب میں اگرچہ اتنا ہی کہہ دینا کافی تھا کہ ’’یہ میری لاٹھی ہے‘‘ مگر موسیٰ علیہ السلام نے یہ بتانے کے بعد اس کے کئی فوائد بھی بیان کر دیے۔ اس کی ایک توجیہ تو یہ ہے کہ موسیٰ علیہ السلام نے خیال کیا کہ یہ بات ظاہر ہے کہ میرے ہاتھ میں لاٹھی ہے اور ظاہر بات کے متعلق سوال نہیں ہوتا، اس لیے انھوں نے سمجھا کہ اللہ تعالیٰ نے مجھے یہ اس لیے پوچھا ہے کہ میں بتاؤں کہ میں نے لاٹھی کیوں پکڑ رکھی ہے؟ اس لیے جواب میں ’’یہ لاٹھی ہے‘‘ کہہ کر اس کے چند فوائد بیان کیے، مگر آخر میں بات مختصر کر دی کہ اگر مزید وضاحت کی ضرورت ہوئی تو پھر پوچھ لیا جائے گا۔ (ابن عاشور) دوسری توجیہ علمائے معانی نے یہ بیان فرمائی ہے کہ اللہ تعالیٰ سے ہم کلامی کی لذت میں بے اختیار بات لمبی ہوتی گئی، مگر ایک طرف فرط محبت کا تقاضا تھا کہ بات لمبی سے لمبی ہوتی جائے، تو دوسری طرف ادب زیادہ بات کرنے سے مانع تھا، اس لیے ایک اپنی ضرورت ’’ٹیک لگانا‘‘ اور ایک اپنی بکریوں کی ضرورت ’’پتے جھاڑنا‘‘ بیان کر کے آخر میں یہ کہہ کر بات مختصر کر دی کہ {’’وَ لِيَ فِيْهَا مَاٰرِبُ اُخْرٰى ‘‘} یہ توجیہ بھی بہترین ہے۔ یہ بھی ہو سکتا ہے کہ موسیٰ علیہ السلام نے لاٹھی کے بہت سے دیگر فوائد بھی بیان کیے ہوں جن کا ماحصل اللہ تعالیٰ نے اپنے الفاظ میں بیان فرما دیا ہو۔ اس صورت میں یہ اختصار موسیٰ علیہ السلام کے کلام میں نہیں بلکہ اللہ تعالیٰ کے کلام میں ہو گا۔ (واللہ اعلم) ¤ ➋ { وَ اَهُشُّ بِهَا عَلٰى غَنَمِيْ … :} حافظ ابن کثیر رحمہ اللہ نے امام مالک رحمہ اللہ سے {’’هَشٌّ‘‘} کا معنی یہ نقل کیا ہے کہ لاٹھی کے ساتھ ٹہنی کو ہلانا، تاکہ پتے گر پڑیں مگر شاخ نہ ٹوٹے۔ یہ لفظ لاٹھی مار کر پتے جھاڑنے کے معنی میں بھی آتا ہے۔ {’’ وَ لِيَ فِيْهَا مَاٰرِبُ اُخْرٰى ‘‘ ’’مَأْرَبَةٌ‘‘} (را کے فتحہ، کسرہ اور ضمہ کے ساتھ) کی جمع، حاجت یعنی وہ کام جن کی ضرورت پڑتی ہے۔ لاٹھی کے فوائد پر جاحظ نے ’’کتاب العصا‘‘ لکھی ہے جس میں لاٹھی کے فوائد اور عربوں کے بہت سے واقعات لکھے ہیں۔ اس میں لکھا ہے کہ ابن الاعرابی سے پوچھا گیا کہ {’’ وَ لِيَ فِيْهَا مَاٰرِبُ اُخْرٰى‘‘} سے کیا مراد ہے؟ تو انھوں نے فرمایا : ’’میں موسیٰ علیہ السلام کی تمام ضروریات تو بیان نہیں کر سکتا، البتہ لاٹھی کی ضرورت کی چند چیزیں تمھیں بتاتا ہوں، وہ یہ کہ لاٹھی سانپ، بچھو، بھیڑیے، بپھرے ہوئے سانڈ اور کھیت اجاڑنے والے جانوروں کے لیے ساتھ رکھی جاتی ہے۔ بڑی عمر کے بوڑھے، کمزور و بیمار لوگ، کٹی ہوئی ٹانگ والے اور لنگڑے اس کا سہارا لیتے ہیں، یہ انھیں دوسری ٹانگ کا کام دیتی ہے۔ اندھے کو قائد کا کام دیتی ہے۔ دھوبی، رنگ ریز اور تنور اور چولھے کی راکھ ہلانے والوں کے کام آتی ہے۔ چونا کوٹنے، تل وغیرہ چھڑنے کے کام آتی ہے۔ ڈاک لے جانے والوں اور کرائے کے جانوروں کے ساتھ جانے والوں کے کام آتی ہے کہ فاصلہ لمبا ہو تو وہ لاٹھی کے سہارے چھلانگ لگاتے جاتے ہیں۔ فالج زدہ کے جھکاؤ کو سیدھا کرتی ہے اور رعشہ کے مریض کے لرزہ کو کنٹرول کرتی ہے۔ چرواہے اسے بکریوں کے لیے اور تمام سوار اپنی سواری کے لیے ساتھ رکھتے ہیں۔ کوئی بھاری بوجھ ہو تو اس میں داخل کرکے اسے دونوں ہاتھوں سے پکڑ لیا جاتا ہے۔ بعض اوقات دو آدمی اس کا ایک ایک کنارہ پکڑ لیتے ہیں۔ چاہو تو دیوار میں ٹھونک کر میخ بنا لو یا کھلی جگہ میں گاڑ کر سترہ بنا لو یا چھتری بنا لو۔ اگر نوک لگا دو تو برچھی بن جائے گی، کچھ اور بڑھا دو تو نیزہ بن جائے گی۔ لاٹھی کوڑے کا کام بھی دیتی ہے اور اسلحہ بھی ہے۔ کندھے پر رکھ کر اس کے ساتھ کمان، ترکش اور پانی یا دودھ وغیرہ کا برتن بھی لٹکا سکتے ہو۔ کنویں سے پانی نکالنے کے لیے رسی چھوٹی ہو تو لاٹھی ساتھ ملا کر پانی نکال سکتے ہو۔ چادر اس کے اوپر ڈال کر سایہ حاصل کر سکتے ہو اور درندوں کا مقابلہ کر سکتے ہو وغیرہ۔‘‘"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19تا21) ➊ اللہ تعالیٰ کے حکم پر موسیٰ علیہ السلام نے اپنا عصا پھینکا تو اچانک وہ سانپ بن گیا جو دوڑتا تھا، یعنی حقیقی اور زندہ سانپ تھا۔ قرآن مجید میں اس کے لیے تین الفاظ استعمال ہوئے ہیں {’’ حَيَّةٌ ‘‘} (سانپ)، {’’ جَاۤنٌّ ‘‘} (پتلا چھڑی جیسا چمکتا ہوا سانپ) اور {’’ ثُعْبَانٌ ‘‘ } (بہت بڑا اژدہا)۔ معلوم ہوا کہ لاٹھی پھینکتے ہی پتلے سانپ جیسی بنی، پھر بڑھتے بڑھتے بہت بڑا اژدہا بن گئی۔ موسیٰ علیہ السلام خوف زدہ ہو کر بے اختیار بھاگ اٹھے اور مڑ کر بھی نہ دیکھا۔ دیکھیے سورۂ نمل (۱۰) اور قصص (۳۱) اللہ تعالیٰ نے فرمایا کہ اسے پکڑو اور ڈرو نہیں، ہم اسے دوبارہ پہلی حالت میں لوٹا دیں گے۔ ¤ ➋ اہل علم نے لاٹھی کے ایک لمحہ میں سانپ اور پھر دوبارہ لاٹھی بننے میں کئی حکمتیں بیان فرمائی ہیں۔ ان میں سے ایک یہ ہے کہ اللہ تعالیٰ نے انھیں ان کے جد امجد ابراہیم علیہ السلام کی طرح اپنی قدرت کا عین الیقین عطا فرما دیا کہ کس طرح اس کے حکم سے ایک بے جان چیز اتنی خطرناک ہو جاتی ہے کہ اس کے سامنے کوئی چیز ٹھہر نہیں سکتی اور پھر کس طرح اتنی خطرناک چیز اس کے حکم سے بے جان لکڑی بن جاتی ہے، جو حرکت بھی نہیں کر سکتی۔ مقصد یہ یقین دلانا تھا کہ فرعون اپنی تمام تر قہرمانیوں کے باوجود اللہ کے حکم کے سامنے کچھ بھی نہیں۔ دوسری حکمت یہ کہ اس زمانے میں جادو اپنے عروج پر تھا، اس کے توڑ کے لیے یہ معجزہ دیا اور انھیں مشاہدہ بھی کروا دیا، تاکہ میدان میں لاٹھی کے سانپ بننے سے موسیٰ علیہ السلام خوف زدہ ہو کر بھاگ نہ اٹھیں، بلکہ انھیں آنکھوں سے دیکھنے کے بعد اللہ تعالیٰ کی عطا کر دہ قوت کا ہر وقت احساس رہے۔ تیسری حکمت بقاعی رحمہ اللہ نے ربط آیات کے ضمن میں لکھی ہے کہ موسیٰ علیہ السلام کے واقعہ کے آغاز سے پہلے اللہ تعالیٰ نے قیامت کے آنے کا ذکر فرمایا ہے، جسے {’’اَلسَّاعَةُ‘‘} کہتے ہیں، یعنی ایک لمحہ، ایک گھڑی، قیامت کا ذکر کرنے کے بعد موسیٰ علیہ السلام کو ایک لمحے میں لاٹھی کو سانپ اور سانپ کو لاٹھی بنا کر ایک گھڑی میں قیامت قائم ہونے کا مشاہدہ کروا دیا۔ (نظم الدرر)"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 19تا21) ➊ اللہ تعالیٰ کے حکم پر موسیٰ علیہ السلام نے اپنا عصا پھینکا تو اچانک وہ سانپ بن گیا جو دوڑتا تھا، یعنی حقیقی اور زندہ سانپ تھا۔ قرآن مجید میں اس کے لیے تین الفاظ استعمال ہوئے ہیں {’’ حَيَّةٌ ‘‘} (سانپ)، {’’ جَاۤنٌّ ‘‘} (پتلا چھڑی جیسا چمکتا ہوا سانپ) اور {’’ ثُعْبَانٌ ‘‘ } (بہت بڑا اژدہا)۔ معلوم ہوا کہ لاٹھی پھینکتے ہی پتلے سانپ جیسی بنی، پھر بڑھتے بڑھتے بہت بڑا اژدہا بن گئی۔ موسیٰ علیہ السلام خوف زدہ ہو کر بے اختیار بھاگ اٹھے اور مڑ کر بھی نہ دیکھا۔ دیکھیے سورۂ نمل (۱۰) اور قصص (۳۱) اللہ تعالیٰ نے فرمایا کہ اسے پکڑو اور ڈرو نہیں، ہم اسے دوبارہ پہلی حالت میں لوٹا دیں گے۔ ¤ ➋ اہل علم نے لاٹھی کے ایک لمحہ میں سانپ اور پھر دوبارہ لاٹھی بننے میں کئی حکمتیں بیان فرمائی ہیں۔ ان میں سے ایک یہ ہے کہ اللہ تعالیٰ نے انھیں ان کے جد امجد ابراہیم علیہ السلام کی طرح اپنی قدرت کا عین الیقین عطا فرما دیا کہ کس طرح اس کے حکم سے ایک بے جان چیز اتنی خطرناک ہو جاتی ہے کہ اس کے سامنے کوئی چیز ٹھہر نہیں سکتی اور پھر کس طرح اتنی خطرناک چیز اس کے حکم سے بے جان لکڑی بن جاتی ہے، جو حرکت بھی نہیں کر سکتی۔ مقصد یہ یقین دلانا تھا کہ فرعون اپنی تمام تر قہرمانیوں کے باوجود اللہ کے حکم کے سامنے کچھ بھی نہیں۔ دوسری حکمت یہ کہ اس زمانے میں جادو اپنے عروج پر تھا، اس کے توڑ کے لیے یہ معجزہ دیا اور انھیں مشاہدہ بھی کروا دیا، تاکہ میدان میں لاٹھی کے سانپ بننے سے موسیٰ علیہ السلام خوف زدہ ہو کر بھاگ نہ اٹھیں، بلکہ انھیں آنکھوں سے دیکھنے کے بعد اللہ تعالیٰ کی عطا کر دہ قوت کا ہر وقت احساس رہے۔ تیسری حکمت بقاعی رحمہ اللہ نے ربط آیات کے ضمن میں لکھی ہے کہ موسیٰ علیہ السلام کے واقعہ کے آغاز سے پہلے اللہ تعالیٰ نے قیامت کے آنے کا ذکر فرمایا ہے، جسے {’’اَلسَّاعَةُ‘‘} کہتے ہیں، یعنی ایک لمحہ، ایک گھڑی، قیامت کا ذکر کرنے کے بعد موسیٰ علیہ السلام کو ایک لمحے میں لاٹھی کو سانپ اور سانپ کو لاٹھی بنا کر ایک گھڑی میں قیامت قائم ہونے کا مشاہدہ کروا دیا۔ (نظم الدرر)"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 19تا21) ➊ اللہ تعالیٰ کے حکم پر موسیٰ علیہ السلام نے اپنا عصا پھینکا تو اچانک وہ سانپ بن گیا جو دوڑتا تھا، یعنی حقیقی اور زندہ سانپ تھا۔ قرآن مجید میں اس کے لیے تین الفاظ استعمال ہوئے ہیں {’’ حَيَّةٌ ‘‘} (سانپ)، {’’ جَاۤنٌّ ‘‘} (پتلا چھڑی جیسا چمکتا ہوا سانپ) اور {’’ ثُعْبَانٌ ‘‘ } (بہت بڑا اژدہا)۔ معلوم ہوا کہ لاٹھی پھینکتے ہی پتلے سانپ جیسی بنی، پھر بڑھتے بڑھتے بہت بڑا اژدہا بن گئی۔ موسیٰ علیہ السلام خوف زدہ ہو کر بے اختیار بھاگ اٹھے اور مڑ کر بھی نہ دیکھا۔ دیکھیے سورۂ نمل (۱۰) اور قصص (۳۱) اللہ تعالیٰ نے فرمایا کہ اسے پکڑو اور ڈرو نہیں، ہم اسے دوبارہ پہلی حالت میں لوٹا دیں گے۔ ¤ ➋ اہل علم نے لاٹھی کے ایک لمحہ میں سانپ اور پھر دوبارہ لاٹھی بننے میں کئی حکمتیں بیان فرمائی ہیں۔ ان میں سے ایک یہ ہے کہ اللہ تعالیٰ نے انھیں ان کے جد امجد ابراہیم علیہ السلام کی طرح اپنی قدرت کا عین الیقین عطا فرما دیا کہ کس طرح اس کے حکم سے ایک بے جان چیز اتنی خطرناک ہو جاتی ہے کہ اس کے سامنے کوئی چیز ٹھہر نہیں سکتی اور پھر کس طرح اتنی خطرناک چیز اس کے حکم سے بے جان لکڑی بن جاتی ہے، جو حرکت بھی نہیں کر سکتی۔ مقصد یہ یقین دلانا تھا کہ فرعون اپنی تمام تر قہرمانیوں کے باوجود اللہ کے حکم کے سامنے کچھ بھی نہیں۔ دوسری حکمت یہ کہ اس زمانے میں جادو اپنے عروج پر تھا، اس کے توڑ کے لیے یہ معجزہ دیا اور انھیں مشاہدہ بھی کروا دیا، تاکہ میدان میں لاٹھی کے سانپ بننے سے موسیٰ علیہ السلام خوف زدہ ہو کر بھاگ نہ اٹھیں، بلکہ انھیں آنکھوں سے دیکھنے کے بعد اللہ تعالیٰ کی عطا کر دہ قوت کا ہر وقت احساس رہے۔ تیسری حکمت بقاعی رحمہ اللہ نے ربط آیات کے ضمن میں لکھی ہے کہ موسیٰ علیہ السلام کے واقعہ کے آغاز سے پہلے اللہ تعالیٰ نے قیامت کے آنے کا ذکر فرمایا ہے، جسے {’’اَلسَّاعَةُ‘‘} کہتے ہیں، یعنی ایک لمحہ، ایک گھڑی، قیامت کا ذکر کرنے کے بعد موسیٰ علیہ السلام کو ایک لمحے میں لاٹھی کو سانپ اور سانپ کو لاٹھی بنا کر ایک گھڑی میں قیامت قائم ہونے کا مشاہدہ کروا دیا۔ (نظم الدرر)"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) { وَ اضْمُمْ يَدَكَ اِلٰى جَنَاحِكَ … :} دوسری جگہ اس کی تفصیل آئی ہے کہ حکم ہوا کہ اپنے گریبان میں ہاتھ ڈال کر اسے اپنے پہلو کے ساتھ لگاؤ گے تو وہ چمکتا ہوا سفید نکلے گا، مگر وہ سفیدی برص وغیرہ جیسا عیب نہیں ہو گی، بلکہ ایک معجزہ ہوگی۔ ’’کسی عیب کے بغیر‘‘ کی تصریح اس لیے فرمائی کہ برص کو بہت ہی معیوب سمجھا جاتا ہے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) { لِنُرِيَكَ مِنْ اٰيٰتِنَا الْكُبْرٰى:} یہاں {’’ مِنْ ‘‘} بعض کے معنی میں ہے، یعنی ہمم نے عصا اور ید بیضا تمھیں اپنے چند بڑے معجزے دکھانے کے لیے عطا کیے ہیں۔ یہ معنی بھی ہے کہ ہم نے یہ معجزے تمھیں اپنے کچھ مزید بڑے معجزے دکھانے کے لیے دیے ہیں۔ ان کی تفصیل کے لیے دیکھیے سورۂ بنی اسرائیل (۱۰۱)۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) { اِذْهَبْ اِلٰى فِرْعَوْنَ … :} نبوت اور معجزات عطا کرنے کے بعد حکم ہوا کہ یہ معجزات لے کر فرعون کے پاس جاؤ جو تکبر اور سرکشی میں ہر حد سے تجاوز کر گیا ہے، حتیٰ کہ بندہ ہو کر رب اعلیٰ ہونے کا دعویٰ کر بیٹھا ہے۔ اس حکم کی مزید تفصیل آگے آیات (۴۲ تا ۴۸) میں آ رہی ہے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 26،25) { قَالَ رَبِّ اشْرَحْ لِيْ صَدْرِيْ … :} دوسری جگہ فرمایا : «{ وَ يَضِيْقُ صَدْرِيْ وَ لَا يَنْطَلِقُ لِسَانِيْ }» [ الشعراء : ۱۳ ] ’’اور میرا سینہ تنگ ہوتا ہے اور میری زبان چلتی نہیں۔‘‘ یعنی اتنی بڑی ذمہ داری اٹھانے سے میرے دل میں جو تنگی محسوس ہوتی ہے وہ دور فرما دے اور اس منصب عظیم کا بوجھ اٹھانے کے لیے جس ہمت، پامردی اور حوصلہ مندی کی ضرورت ہے وہ میرے دل میں پیدا فرما دے اور میرا تبلیغ رسالت کا کام میرے لیے آسان فرما دے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26،25) { قَالَ رَبِّ اشْرَحْ لِيْ صَدْرِيْ … :} دوسری جگہ فرمایا : «{ وَ يَضِيْقُ صَدْرِيْ وَ لَا يَنْطَلِقُ لِسَانِيْ }» [ الشعراء : ۱۳ ] ’’اور میرا سینہ تنگ ہوتا ہے اور میری زبان چلتی نہیں۔‘‘ یعنی اتنی بڑی ذمہ داری اٹھانے سے میرے دل میں جو تنگی محسوس ہوتی ہے وہ دور فرما دے اور اس منصب عظیم کا بوجھ اٹھانے کے لیے جس ہمت، پامردی اور حوصلہ مندی کی ضرورت ہے وہ میرے دل میں پیدا فرما دے اور میرا تبلیغ رسالت کا کام میرے لیے آسان فرما دے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27تا30) ➊ { وَ احْلُلْ عُقْدَةً مِّنْ لِّسَانِيْ …:} سورۂ شعراء کی آیت (۱۳) : «{ وَ يَضِيْقُ صَدْرِيْ وَ لَا يَنْطَلِقُ لِسَانِيْ }» سے معلوم ہوتا ہے کہ موسیٰ علیہ السلام کی زبان میں وہ روانی نہ تھی جسے وہ اللہ کا پیغام پہنچانے کے لیے ضروری سمجھتے تھے۔ فرعون کو بھی ان پر طعن کے لیے یہی کمزوری ملی کہ کہا : «{ وَ لَا يَكَادُ يُبِيْنُ }» [ الزخرف : ۵۲ ] ’’اور یہ (موسیٰ) قریب نہیں کہ بات واضح کرے۔‘‘ اگرچہ فرعون کی بات کا کچھ اعتبار نہیں، کیونکہ جھوٹا الزام لگا دینا اس سے کچھ بعید نہ تھا۔ الغرض ! اس کے لیے انھوں نے دو دعائیں کیں، ایک تویہ کہ اے میرے رب! میری زبان کی کچھ گرہ کھول دے، تاکہ لوگ میری بات سمجھ لیں۔ کچھ گرہ کا مفہوم {’’ عُقْدَةً ‘‘} کی تنوین سے ظاہر ہو رہا ہے۔ زبان سے مکمل گرہ دور کرنے کی دعا کے بجائے انھوں نے یہ کہہ کر اپنے بھائی ہارون علیہ السلام کے لیے نبوت کی درخواست کر دی کہ وہ مجھ سے زیادہ فصیح اللسان ہیں اور میرے اہلِ خانہ میں سے میرا بوجھ بٹانے والے ہوں گے۔ اہلِ علم فرماتے ہیں کہ کسی بھائی نے اپنے بھائی کے لیے موسیٰ علیہ السلام سے زیادہ بہتر دعا نہیں کی۔ بعض تفاسیر میں موسیٰ علیہ السلام کے بچپن میں انگارا منہ میں ڈالنے کا ذکر ہے، مگر وہ اسرائیلی روایات میں سے ہے، جن سے کسی بات کا یقین حاصل نہیں ہوتا۔ ¤ ➋ { وَ اجْعَلْ لِّيْ وَزِيْرًا … :} یعنی مددگار جو اس عظیم بوجھ کو اٹھانے میں میرا شریک ہو۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ایسے بڑے پیغمبروں کو (ساری) خلق کی طرف بہت (یعنی مکمل) خیال نہیں ہوتا، ایک پیش کار چاہیے کہ خلق کو سہج میں سمجھائے، ہمارے پیغمبر صلی اللہ علیہ وسلم کے پیش کار ابوبکر صدیق رضی اللہ عنہ تھے، ابتدا میں ابوبکر رضی اللہ عنہ کی تبلیغ ہی سے بہت سے لوگ مسلمان ہوئے ہیں، جن کا شمار کبار صحابہ میں ہے۔‘‘ (موضح)"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 27تا30) ➊ { وَ احْلُلْ عُقْدَةً مِّنْ لِّسَانِيْ …:} سورۂ شعراء کی آیت (۱۳) : «{ وَ يَضِيْقُ صَدْرِيْ وَ لَا يَنْطَلِقُ لِسَانِيْ }» سے معلوم ہوتا ہے کہ موسیٰ علیہ السلام کی زبان میں وہ روانی نہ تھی جسے وہ اللہ کا پیغام پہنچانے کے لیے ضروری سمجھتے تھے۔ فرعون کو بھی ان پر طعن کے لیے یہی کمزوری ملی کہ کہا : «{ وَ لَا يَكَادُ يُبِيْنُ }» [ الزخرف : ۵۲ ] ’’اور یہ (موسیٰ) قریب نہیں کہ بات واضح کرے۔‘‘ اگرچہ فرعون کی بات کا کچھ اعتبار نہیں، کیونکہ جھوٹا الزام لگا دینا اس سے کچھ بعید نہ تھا۔ الغرض ! اس کے لیے انھوں نے دو دعائیں کیں، ایک تویہ کہ اے میرے رب! میری زبان کی کچھ گرہ کھول دے، تاکہ لوگ میری بات سمجھ لیں۔ کچھ گرہ کا مفہوم {’’ عُقْدَةً ‘‘} کی تنوین سے ظاہر ہو رہا ہے۔ زبان سے مکمل گرہ دور کرنے کی دعا کے بجائے انھوں نے یہ کہہ کر اپنے بھائی ہارون علیہ السلام کے لیے نبوت کی درخواست کر دی کہ وہ مجھ سے زیادہ فصیح اللسان ہیں اور میرے اہلِ خانہ میں سے میرا بوجھ بٹانے والے ہوں گے۔ اہلِ علم فرماتے ہیں کہ کسی بھائی نے اپنے بھائی کے لیے موسیٰ علیہ السلام سے زیادہ بہتر دعا نہیں کی۔ بعض تفاسیر میں موسیٰ علیہ السلام کے بچپن میں انگارا منہ میں ڈالنے کا ذکر ہے، مگر وہ اسرائیلی روایات میں سے ہے، جن سے کسی بات کا یقین حاصل نہیں ہوتا۔ ¤ ➋ { وَ اجْعَلْ لِّيْ وَزِيْرًا … :} یعنی مددگار جو اس عظیم بوجھ کو اٹھانے میں میرا شریک ہو۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ایسے بڑے پیغمبروں کو (ساری) خلق کی طرف بہت (یعنی مکمل) خیال نہیں ہوتا، ایک پیش کار چاہیے کہ خلق کو سہج میں سمجھائے، ہمارے پیغمبر صلی اللہ علیہ وسلم کے پیش کار ابوبکر صدیق رضی اللہ عنہ تھے، ابتدا میں ابوبکر رضی اللہ عنہ کی تبلیغ ہی سے بہت سے لوگ مسلمان ہوئے ہیں، جن کا شمار کبار صحابہ میں ہے۔‘‘ (موضح)"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 27تا30) ➊ { وَ احْلُلْ عُقْدَةً مِّنْ لِّسَانِيْ …:} سورۂ شعراء کی آیت (۱۳) : «{ وَ يَضِيْقُ صَدْرِيْ وَ لَا يَنْطَلِقُ لِسَانِيْ }» سے معلوم ہوتا ہے کہ موسیٰ علیہ السلام کی زبان میں وہ روانی نہ تھی جسے وہ اللہ کا پیغام پہنچانے کے لیے ضروری سمجھتے تھے۔ فرعون کو بھی ان پر طعن کے لیے یہی کمزوری ملی کہ کہا : «{ وَ لَا يَكَادُ يُبِيْنُ }» [ الزخرف : ۵۲ ] ’’اور یہ (موسیٰ) قریب نہیں کہ بات واضح کرے۔‘‘ اگرچہ فرعون کی بات کا کچھ اعتبار نہیں، کیونکہ جھوٹا الزام لگا دینا اس سے کچھ بعید نہ تھا۔ الغرض ! اس کے لیے انھوں نے دو دعائیں کیں، ایک تویہ کہ اے میرے رب! میری زبان کی کچھ گرہ کھول دے، تاکہ لوگ میری بات سمجھ لیں۔ کچھ گرہ کا مفہوم {’’ عُقْدَةً ‘‘} کی تنوین سے ظاہر ہو رہا ہے۔ زبان سے مکمل گرہ دور کرنے کی دعا کے بجائے انھوں نے یہ کہہ کر اپنے بھائی ہارون علیہ السلام کے لیے نبوت کی درخواست کر دی کہ وہ مجھ سے زیادہ فصیح اللسان ہیں اور میرے اہلِ خانہ میں سے میرا بوجھ بٹانے والے ہوں گے۔ اہلِ علم فرماتے ہیں کہ کسی بھائی نے اپنے بھائی کے لیے موسیٰ علیہ السلام سے زیادہ بہتر دعا نہیں کی۔ بعض تفاسیر میں موسیٰ علیہ السلام کے بچپن میں انگارا منہ میں ڈالنے کا ذکر ہے، مگر وہ اسرائیلی روایات میں سے ہے، جن سے کسی بات کا یقین حاصل نہیں ہوتا۔ ¤ ➋ { وَ اجْعَلْ لِّيْ وَزِيْرًا … :} یعنی مددگار جو اس عظیم بوجھ کو اٹھانے میں میرا شریک ہو۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ایسے بڑے پیغمبروں کو (ساری) خلق کی طرف بہت (یعنی مکمل) خیال نہیں ہوتا، ایک پیش کار چاہیے کہ خلق کو سہج میں سمجھائے، ہمارے پیغمبر صلی اللہ علیہ وسلم کے پیش کار ابوبکر صدیق رضی اللہ عنہ تھے، ابتدا میں ابوبکر رضی اللہ عنہ کی تبلیغ ہی سے بہت سے لوگ مسلمان ہوئے ہیں، جن کا شمار کبار صحابہ میں ہے۔‘‘ (موضح)"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 27تا30) ➊ { وَ احْلُلْ عُقْدَةً مِّنْ لِّسَانِيْ …:} سورۂ شعراء کی آیت (۱۳) : «{ وَ يَضِيْقُ صَدْرِيْ وَ لَا يَنْطَلِقُ لِسَانِيْ }» سے معلوم ہوتا ہے کہ موسیٰ علیہ السلام کی زبان میں وہ روانی نہ تھی جسے وہ اللہ کا پیغام پہنچانے کے لیے ضروری سمجھتے تھے۔ فرعون کو بھی ان پر طعن کے لیے یہی کمزوری ملی کہ کہا : «{ وَ لَا يَكَادُ يُبِيْنُ }» [ الزخرف : ۵۲ ] ’’اور یہ (موسیٰ) قریب نہیں کہ بات واضح کرے۔‘‘ اگرچہ فرعون کی بات کا کچھ اعتبار نہیں، کیونکہ جھوٹا الزام لگا دینا اس سے کچھ بعید نہ تھا۔ الغرض ! اس کے لیے انھوں نے دو دعائیں کیں، ایک تویہ کہ اے میرے رب! میری زبان کی کچھ گرہ کھول دے، تاکہ لوگ میری بات سمجھ لیں۔ کچھ گرہ کا مفہوم {’’ عُقْدَةً ‘‘} کی تنوین سے ظاہر ہو رہا ہے۔ زبان سے مکمل گرہ دور کرنے کی دعا کے بجائے انھوں نے یہ کہہ کر اپنے بھائی ہارون علیہ السلام کے لیے نبوت کی درخواست کر دی کہ وہ مجھ سے زیادہ فصیح اللسان ہیں اور میرے اہلِ خانہ میں سے میرا بوجھ بٹانے والے ہوں گے۔ اہلِ علم فرماتے ہیں کہ کسی بھائی نے اپنے بھائی کے لیے موسیٰ علیہ السلام سے زیادہ بہتر دعا نہیں کی۔ بعض تفاسیر میں موسیٰ علیہ السلام کے بچپن میں انگارا منہ میں ڈالنے کا ذکر ہے، مگر وہ اسرائیلی روایات میں سے ہے، جن سے کسی بات کا یقین حاصل نہیں ہوتا۔ ¤ ➋ { وَ اجْعَلْ لِّيْ وَزِيْرًا … :} یعنی مددگار جو اس عظیم بوجھ کو اٹھانے میں میرا شریک ہو۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ایسے بڑے پیغمبروں کو (ساری) خلق کی طرف بہت (یعنی مکمل) خیال نہیں ہوتا، ایک پیش کار چاہیے کہ خلق کو سہج میں سمجھائے، ہمارے پیغمبر صلی اللہ علیہ وسلم کے پیش کار ابوبکر صدیق رضی اللہ عنہ تھے، ابتدا میں ابوبکر رضی اللہ عنہ کی تبلیغ ہی سے بہت سے لوگ مسلمان ہوئے ہیں، جن کا شمار کبار صحابہ میں ہے۔‘‘ (موضح)"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 32،31) {اشْدُدْ بِهٖۤ اَزْرِيْ … : ’’ اشْدُدْ ‘‘} اکثر قراء کی قراء ت کے مطابق یہ {’’شَدَّ يَشُدُّ‘‘} (ن) سے ہمزہ کے ضمہ کے ساتھ فعل امر ہے۔ اسی طرح {’’ اَشْرِكْهُ ‘‘ ’’اَشْرَكَ يُشْرِكُ‘‘} (افعال) سے فعل امر ہے۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32،31) {اشْدُدْ بِهٖۤ اَزْرِيْ … : ’’ اشْدُدْ ‘‘} اکثر قراء کی قراء ت کے مطابق یہ {’’شَدَّ يَشُدُّ‘‘} (ن) سے ہمزہ کے ضمہ کے ساتھ فعل امر ہے۔ اسی طرح {’’ اَشْرِكْهُ ‘‘ ’’اَشْرَكَ يُشْرِكُ‘‘} (افعال) سے فعل امر ہے۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 34،33) { كَيْ نُسَبِّحَكَ كَثِيْرًا … :} یعنی ان دعاؤں سے ہمیں کوئی دنیاوی مفاد مقصود نہیں، بلکہ مقصد یہ ہے کہ ہم ایک دوسرے کے تعاون سے تیری تسبیح اور تیرا ذکر بہت زیادہ کر سکیں گے، مثلاً دنیوی ضروریات آپس میں تقسیم کر لیں گے تو تسبیح و ذکر اور دعوت کے لیے زیادہ وقت نکل سکے گا۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34،33) { كَيْ نُسَبِّحَكَ كَثِيْرًا … :} یعنی ان دعاؤں سے ہمیں کوئی دنیاوی مفاد مقصود نہیں، بلکہ مقصد یہ ہے کہ ہم ایک دوسرے کے تعاون سے تیری تسبیح اور تیرا ذکر بہت زیادہ کر سکیں گے، مثلاً دنیوی ضروریات آپس میں تقسیم کر لیں گے تو تسبیح و ذکر اور دعوت کے لیے زیادہ وقت نکل سکے گا۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) { اِنَّكَ كُنْتَ بِنَا بَصِيْرًا : ’’ كُنْتَ ‘‘} میں {’’ كَانَ ‘‘} استمرار کے لیے ہے کہ ’’بے شک تو ہمیشہ ہمارا نگران اور نگہبان رہا ہے۔‘‘ یعنی جب ہم بچے تھے اس وقت بھی تو نے ہماری پرورش کی اور ہمیں دشمنوں سے محفوظ رکھا، اب بھی تیری اسی رحمت کے وسیلے سے تیری جناب میں درخواست ہے کہ ہماری یہ دعائیں قبول فرما۔ اس آیت میں اللہ تعالیٰ کی صفات اور پہلی نوازشوں کے وسیلے سے دعا کا سبق بھی ہے۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {قَالَ قَدْ اُوْتِيْتَ … :} یعنی تم نے منہ مانگی مراد پالی اور ہم نے تمھاری ہر درخواست کو منظور فرما لیا۔ سینہ کھل گیا، کام آسان ہو گیا، زبان کی گرہ بھی مکمل یا بقدر ضرورت کھل گئی۔ چنانچہ اس کے بعد ہر جگہ موسیٰ علیہ السلام نے خود ہی فرعون اور جادوگروں سے بحث کی ہے، کہیں ہارون علیہ السلام کا ذکر نہیں آیا او رہارون علیہ السلام کو بھی نبی بنا کر وزیر بنا دیا گیا۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) { وَ لَقَدْ مَنَنَّا عَلَيْكَ مَرَّةً اُخْرٰۤى :} اللہ تعالیٰ سے ہم کلامی، نبوت و رسالت کے منصب پر فائز ہونے، عصا و ید بیضا کے معجزے عطا ہونے، ان کا آنکھوں سے مشاہدہ کرنے اور اس موقع پر کی ہوئی چاروں دعاؤں کی قبولیت میں سے ہر ایک عظیم احسان تھا۔ اب اللہ تعالیٰ نے ان سے پہلے کیے گئے آٹھ احسانات کا ذکر فرمایا۔ مقصد یہ کہ میں نے تم پر پہلے بھی احسان کیے، اب بھی کیے اور آئندہ بھی کرتا رہوں گا، کیونکہ میں نے تمھیں بنایا ہی خاص اپنے لیے ہے، فرمایا : «{ وَ اصْطَنَعْتُكَ لِنَفْسِيْ }» [ طٰہٰ : ۴۱ ] ’’اور میں نے تجھے اپنے لیے خاص طور پر بنایا ہے۔‘‘ جیسا کہ اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم کو آئندہ کے وعدے کا یقین دلانے کے لیے پچھلے احسانات یاد دلائے، فرمایا : «{ وَ لَسَوْفَ يُعْطِيْكَ رَبُّكَ فَتَرْضٰى (5) اَلَمْ يَجِدْكَ يَتِيْمًا فَاٰوٰى (6) وَ وَجَدَكَ ضَآلًّا فَهَدٰى (7) وَ وَجَدَكَ عَآىِٕلًا فَاَغْنٰى}» [ الضحیٰ : ۵ تا ۸ ] ’’اور یقینا عنقریب تیرا رب تجھے عطا کرے گا، پس تو راضی ہو جائے گا۔ کیا اس نے تجھے یتیم نہیں پایا، پس جگہ دی اور اس نے تجھے راستے سے ناواقف پایا تو راستہ دکھا دیا اور اس نے تجھے تنگدست پایا تو غنی کر دیا۔‘‘ (ابن عاشور) ¤ ’’اور بلاشبہ یقینا ہم نے تجھ پر ایک اور بار بھی احسان کیا‘‘ اس میں احسان کو مجمل رکھا ہے، تاکہ شوق پیدا ہو کہ وہ کیا احسان تھا، پھر چار آیات (۳۸ تا ۴۱) میں پے در پے آٹھ احسان ذکر فرمائے : (1) {’’اِذْ اَوْحَيْنَاۤ اِلٰۤى اُمِّكَ مَا يُوْحٰۤى ‘‘} (2) {’’ وَ اَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّيْ ‘‘} (3) {’’ وَ لِتُصْنَعَ عَلٰى عَيْنِيْ ‘‘} (4) {’’ فَرَجَعْنٰكَ اِلٰۤى اُمِّكَ كَيْ تَقَرَّ عَيْنُهَا وَ لَا تَحْزَنَ ‘‘} (5) {’’ وَ قَتَلْتَ نَفْسًا فَنَجَّيْنٰكَ مِنَ الْغَمِّ ‘‘} (6) {’’ وَ فَتَنّٰكَ فُتُوْنًا ‘‘} (7) {’’ فَلَبِثْتَ سِنِيْنَ فِيْۤ اَهْلِ مَدْيَنَ ثُمَّ جِئْتَ عَلٰى قَدَرٍ يّٰمُوْسٰى ‘‘} (8) {’’ وَ اصْطَنَعْتُكَ لِنَفْسِيْ ‘‘}"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ { اِذْ اَوْحَيْنَاۤ اِلٰۤى اُمِّكَ مَا يُوْحٰۤى :} جب کسی چیز کی عظمت بیان کرنا مقصود ہو تو یہ انداز اختیار کیا جاتا ہے ’’جو وحی کی جاتی تھی‘‘ یعنی اس کی عظمت محدود الفاظ میں بیان نہیں ہو سکتی، جیسا کہ «{ فَغَشِيَهُمْ مِّنَ الْيَمِّ مَا غَشِيَهُمْ }» [ طٰہٰ : ۷۸ ] اور «{ فَاَوْحٰۤى اِلٰى عَبْدِهٖ مَاۤ اَوْحٰى }» [ النجم : ۱۰ ] میں ہے۔ ¤ ➋ یہاں موسیٰ علیہ السلام کی والدہ کو بتانے اور مطمئن کرنے کے لیے {’’ اَوْحَيْنَاۤ ‘‘} (ہم نے وحی کی) اور {’’ يُوْحٰۤى ‘‘} (جو وحی کی جاتی تھی)کے الفاظ استعمال ہوئے ہیں۔ وحی کے لفظی معنی اشارۂ سریعہ یا دل میں کوئی بات ڈال دینے کے ہیں۔ اصطلاح میں جب یہ لفظ کسی نبی کے لیے استعمال ہوتا ہے تو اس کے معنی فرشتے کے ذریعے سے پیغام بھیجنا ہوتے ہیں۔ قرآن میں دونوں معنوں کے اعتبار سے وحی کا لفظ استعمال ہوا ہے، چنانچہ موسیٰ علیہ السلام کی والدہ کی طرف جو وحی بھیجی گئی وہ بھی لفظی معنی کے اعتبار سے تھی، یعنی خواب میں یا کسی خفیہ طریقے سے ان کے دل میں یہ بات ڈال دی گئی جس سے ان کو یقین و اطمینان حاصل ہو گیا، کیونکہ اس بات پر تقریباً علماء کا اتفاق ہے کہ اللہ کے جتنے نبی ہوئے ہیں مردوں میں سے ہوئے ہیں، عورتوں میں سے کسی عورت کو نبی نہیں بنایا گیا۔ دیکھیے سورۂ یوسف (۱۰۹) اور انبیاء (۷) لہٰذا موسیٰ علیہ السلام کی والدہ نبی نہیں تھیں کہ ان کے لیے وحی کے وہ معنی مراد لیے جائیں جو کسی نبی کے لیے ہوتے ہیں۔ (کبیر)"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ { اَنِ اقْذِفِيْهِ فِي التَّابُوْتِ …:} یعنی تمھارا کام بس اتنا ہے کہ صندوق میں ڈال کر دریا (نیل) میں ڈال دو۔ آگے دریا کو ہمارا حکم یہ ہے کہ اسے راستے میں روکنے یا لے جا کر سمندر میں ڈالنے کے بجائے عین فرعون کے محل کے پاس ساحل پر لگا دے۔ اس واقعہ کی پوری تفصیل سورۂ قصص (۷ تا ۱۳) میں ہے۔ ¤ ➋ {وَ اَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّيْ … :} یعنی تمھاری صورت ایسی بنائی اور اس میں اپنی طرف سے ایسی انوکھی دل ربائی رکھی کہ جو کوئی تمھیں دیکھتا بے اختیار محبت کرنے لگتا۔ {’’ وَ لِتُصْنَعَ عَلٰى عَيْنِيْ ‘‘} کا عطف {’’ وَ اَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّيْ ‘‘} سے حاصل ہونے والے مفہوم پر ہے، جس کی تقدیر یوں ہو گی :{ ’’وَ أَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّيْ لِتُحَبَّ وَلِتُصْنَعَ عَلٰي عَيْنِيْ ‘‘} ’’اور میں نے تجھ پر ایک انوکھی محبت ڈال دی، تاکہ تجھ سے محبت کی جائے اور تاکہ تیری پرورش میری آنکھوں کے سامنے کی جائے۔‘‘ اس عطف کی مزید توجیہات مفصل کتب میں دیکھیں۔ {’’ مَحَبَّةً ‘‘} میں تنوین تنکیر کے لیے ہے، اس لیے ’’ایک انوکھی محبت‘‘ ترجمہ کیا ہے، یعنی جو اسباب کی وجہ سے نہیں تھی، بلکہ بلااسباب خاص اللہ تعالیٰ کی طرف سے تھی۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 41،40) ➊ {’’ اِذْ تَمْشِيْۤ اُخْتُكَ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ قصص (۱۱ تا ۱۳) اور {’’ وَ قَتَلْتَ نَفْسًا ‘‘} سے آخر آیت تک کی تفسیر کے لیے دیکھیے سورۂ قصص (۱۴ تا ۲۸)۔ ¤ ➋ {وَ فَتَنّٰكَ فُتُوْنًا : ’’ فُتُوْنًا ‘‘ ’’فَتَنَ يَفْتِنُ‘‘} کا مصدر ہے، جیسا کہ {’’قُعُوْدٌ‘‘} اور {’’خُرُوْجٌ‘‘} وغیرہ ہیں۔ اس کی تنوین تعظیم کے لیے ہے، اس لیے ترجمہ کیا ہے ’’اور ہم نے تجھے آزمایا، خوب آزمانا۔‘‘ اس آزمائش میں شاہ زادگی کی آسائشوں کے بعد ان کے ہاتھوں قبطی کا نادانستہ قتل، پھر اپنے قتل ہونے کا خوف، پھر بے سروسامانی میں فوری ہجرت، بھوکے پیاسے اور شدید خوف کی حالت میں کئی دن رات کا سفر، پردیس اور دس سالہ مزدوری سب شامل ہیں، جن سب میں زبردست تربیت کا سامان تھا۔ حافظ ابن کثیر نے ایک لمبی حدیث ’’حدیث فتون‘‘ مکمل ذکر کرنے کے بعد فرمایا ہے کہ اس کا اکثر حصہ اسرائیلیات سے لیا گیا ہے۔ ¤ ➌ { ثُمَّ جِئْتَ عَلٰى قَدَرٍ يّٰمُوْسٰى :} یعنی تمھارا راہ بھول کر وادی طویٰ میں اآنا اور میرے ساتھ کلام اور نبوت و رسالت سے سرفراز ہونا کسی طے شدہ منصوبے کے بغیر اور اچانک نہیں تھا، بلکہ عین میرے مقرر کردہ وقت اور فیصلے کے مطابق تھا۔ اگرچہ ہر کام ہی اللہ کی تقدیر سے ہے، مگر اس{ ’’ قَدَرٍ ‘‘ } سے مراد خاص طور پر طے کرنا ہے، جیسا کہ اگلی آیت میں فرمایا : « وَ اصْطَنَعْتُكَ لِنَفْسِيْ » {’’صَنَعَ يَصْنَعُ‘‘ } کا معنی بنانا ہے، {’’اِصْطَنَعَ‘‘} باب افتعال سے ہے، صاد کی مناسبت سے تاء کو طاء سے بدل دیا اور حروف کے اضافے سے معنی میں اضافہ ہو گیا، یعنی میں نے تجھے خاص طور پر اپنے کام یعنی رسالت و نبوت کے لیے تیار کیا ہے۔ یہ تمام احسانات کا خلاصہ ہے."
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41،40) ➊ {’’ اِذْ تَمْشِيْۤ اُخْتُكَ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ قصص (۱۱ تا ۱۳) اور {’’ وَ قَتَلْتَ نَفْسًا ‘‘} سے آخر آیت تک کی تفسیر کے لیے دیکھیے سورۂ قصص (۱۴ تا ۲۸)۔ ¤ ➋ {وَ فَتَنّٰكَ فُتُوْنًا : ’’ فُتُوْنًا ‘‘ ’’فَتَنَ يَفْتِنُ‘‘} کا مصدر ہے، جیسا کہ {’’قُعُوْدٌ‘‘} اور {’’خُرُوْجٌ‘‘} وغیرہ ہیں۔ اس کی تنوین تعظیم کے لیے ہے، اس لیے ترجمہ کیا ہے ’’اور ہم نے تجھے آزمایا، خوب آزمانا۔‘‘ اس آزمائش میں شاہ زادگی کی آسائشوں کے بعد ان کے ہاتھوں قبطی کا نادانستہ قتل، پھر اپنے قتل ہونے کا خوف، پھر بے سروسامانی میں فوری ہجرت، بھوکے پیاسے اور شدید خوف کی حالت میں کئی دن رات کا سفر، پردیس اور دس سالہ مزدوری سب شامل ہیں، جن سب میں زبردست تربیت کا سامان تھا۔ حافظ ابن کثیر نے ایک لمبی حدیث ’’حدیث فتون‘‘ مکمل ذکر کرنے کے بعد فرمایا ہے کہ اس کا اکثر حصہ اسرائیلیات سے لیا گیا ہے۔ ¤ ➌ { ثُمَّ جِئْتَ عَلٰى قَدَرٍ يّٰمُوْسٰى :} یعنی تمھارا راہ بھول کر وادی طویٰ میں اآنا اور میرے ساتھ کلام اور نبوت و رسالت سے سرفراز ہونا کسی طے شدہ منصوبے کے بغیر اور اچانک نہیں تھا، بلکہ عین میرے مقرر کردہ وقت اور فیصلے کے مطابق تھا۔ اگرچہ ہر کام ہی اللہ کی تقدیر سے ہے، مگر اس{ ’’ قَدَرٍ ‘‘ } سے مراد خاص طور پر طے کرنا ہے، جیسا کہ اگلی آیت میں فرمایا : « وَ اصْطَنَعْتُكَ لِنَفْسِيْ » {’’صَنَعَ يَصْنَعُ‘‘ } کا معنی بنانا ہے، {’’اِصْطَنَعَ‘‘} باب افتعال سے ہے، صاد کی مناسبت سے تاء کو طاء سے بدل دیا اور حروف کے اضافے سے معنی میں اضافہ ہو گیا، یعنی میں نے تجھے خاص طور پر اپنے کام یعنی رسالت و نبوت کے لیے تیار کیا ہے۔ یہ تمام احسانات کا خلاصہ ہے."
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ { اِذْهَبْ اَنْتَ وَ اَخُوْكَ بِاٰيٰتِيْ :} یہ ہے وہ مقصد جس کے لیے موسیٰ علیہ السلام کی پرورش فرعون کے گھر میں اور پھر مدین میں کی گئی، چونکہ اس وقت وہاں ہارون علیہ السلام موجود نہیں تھے، اس لیے موسیٰ علیہ السلام کو مصر پہنچ کر انھیں ساتھ لے جانے کا حکم دیا۔ {’’ بِاٰيٰتِيْ ‘‘} یعنی تم فرعون کے پاس خالی ہاتھ نہیں جاؤ گے بلکہ میری نشانیاں عصا اور ید بیضا تمھارے پاس ہوں گی، اس لیے بلاجھجک جاؤ اور میرا پیغام پہنچاؤ۔ ¤ ➋ {وَ لَا تَنِيَا فِيْ ذِكْرِيْ : ’’ لَا تَنِيَا ‘‘ ’’وَنٰي يَنِيْ وَنْيًا‘‘} بروزن {’’وَعَدَ يَعِدُ‘‘} سستی کرنا، کوتاہی کرنا، تھک کر رہ جانا۔ یعنی میری یاد میں کمی نہ کرنا، اس سے تمھارا عزم قوی اور قدم ثابت رہے گا، کیونکہ جب تم مجھے یاد کرو گے تو میرے بے شمار عظیم احسانات تمھارے سامنے رہیں گے، جس سے ادائے رسالت میں کوئی ضعف نہیں آئے گا۔ (طبری) اللہ تعالیٰ نے ہمیں بھی دشمن کے مقابلے کے وقت اپنے ذکر کثیر کا حکم دیا (دیکھیے انفال : ۴۵) اور ہر حال میں ذکر کرنے والوں کی تعریف فرمائی اور انھیں {’’اُولُوا الْاَلْبَابِ ‘‘ } قرار دیا۔ دیکھیے سورۂ آل عمران (۱۹۰)۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) {اِنَّهٗ طَغٰى : ’’ طُغْيَانٌ ‘‘ } کا اصل معنی حد سے بڑھ جانا ہے، جیسا کہ فرمایا : «{ اِنَّا لَمَّا طَغَا الْمَآءُ حَمَلْنٰكُمْ فِي الْجَارِيَةِ } » [الحاقۃ : ۱۱ ] ’’بلاشبہ ہم نے ہی جب پانی حد سے تجاوز کر گیا تمھیں کشتی میں سوار کیا۔‘‘ فرعون کی طغیانی اللہ تعالیٰ نے کئی مقامات پر ذکر فرمائی ہے کہ وہ اپنے رب اعلیٰ ہونے کا دعوے دار تھا۔ (نازعات : ۲۴) وہ بلاشرکت غیرے معبود (الٰہ) ہونے کا دعویٰ رکھتا تھا۔ (قصص : ۳۸) اس نے بنی اسرائیل کو یہ باتیں نہ ماننے کی وجہ سے غلامی اور بدترین عذاب کا نشانہ بنا رکھا تھا، ان کے بیٹے نہایت بے رحمی سے قتل کرتا، عورتوں کو زندہ رکھ کر اپنی اور اپنی قوم کی زیادتیوں کا نشانہ بناتا اور مردوں سے بے گارلیتا تھا۔ (قصص : ۴) جسے چاہتا انکار پر جیل میں ڈال دیتا تھا۔ (شعراء : ۲۹)"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ {فَقُوْلَا لَهٗ قَوْلًا لَّيِّنًا :} اللہ تعالیٰ نے موسیٰ اور ہارون علیھما السلام کو حکم دیا کہ فرعون کو دعوت دیتے وقت نرم بات کہیں، جس میں ترغیب ہو، اسے غصہ دلانے والی نہ ہو۔ ہر داعی کو یہی اسلوب اختیار کرنا لازم ہے، کیونکہ دعوت الی اللہ سے مقصود مخاطب کی ہدایت اور اصلاح ہوتی ہے نہ کہ اپنی برتری ثابت کرنا، یا سخت کلامی سے دل کا غصہ نکالنا۔ دیکھیے سورۂ نحل (۱۲۵) اور آل عمران (۱۵۹) اللہ تعالیٰ نے وہ نرم بات بھی خود ہی سکھا دی، جیسا کہ آگے آیت (۴۷) میں آ رہا ہے اور دیکھیے سورۂ نازعات (۱۸، ۱۹) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَا عَائِشَةُ ! إِنَّ اللّٰهَ رَفِيْقٌ يُحِبُّ الرِّفْقَ وَيُعْطِيْ عَلَی الرِّفْقِ مَا لَا يُعْطِيْ عَلَی الْعُنْفِ وَمَا لاَ يُعْطِيْ عَلٰی مَا سِوَاهٗ ] [ مسلم، البر والصلۃ، باب فضل الرفق : ۲۵۹۳، عن عائشۃ رضی اللہ عنھا ] ’’اے عائشہ! بے شک اللہ تعالیٰ بہت نرمی والا ہے، نرمی کو پسند فرماتا ہے اور نرمی پر وہ کچھ عطا کرتا ہے جو نہ سختی پر عطا کرتا ہے اور نہ اس (نرمی) کے سوا کسی اور چیز پر عطا کرتا ہے۔‘‘ اور یہ بھی فرمایا : [ إِنَّ الرِّفْقَ لَايَكُوْنُ فِيْ شَيْءٍ إِلَّا زَانَهُ وَلاَ يُنْزَعُ مِنْ شَيْءٍ إِلَّا شَانَهٗ ] [ مسلم، أیضًا : ۲۵۹۴ ] ’’نرمی جس چیز میں بھی ہوتی ہے اسے زینت بخشتی ہے اور جس سے بھی نکال لی جائے اسے عیب دار بنا دیتی ہے۔‘‘ ہاں اگر کہیں نرمی بالکل ہی بے اثر ٹھہرے اور کوئی شخص ہٹ دھرمی اور تکبر سے کسی طرح باز نہ آئے تو اس سے حق بات سختی کے ساتھ کہنے کی بھی اجازت ہے، کیونکہ وہاں ’’حکمت ‘‘کا تقاضا یہی ہے، جیسا کہ سورۂ عنکبوت (۴۶) میں ہے اور زیر تفسیر آیات میں آیت (۴۸) میں موسیٰ علیہ السلام کا قول ہے۔ ¤ ➋ {لَعَلَّهٗ يَتَذَكَّرُ اَوْ يَخْشٰى: ’’ لَعَلَّ ‘‘} کا لفظ ترجی (امید کرنے) کے لیے ہوتا ہے۔ یہاں ایک مشہور سوال ہے کہ اللہ تعالیٰ کے کلام میں امید کا ذکر آئے تو وہ بات یقینی ہوتی ہے۔ یہاں اللہ تعالیٰ کو علم تھا کہ فرعون نصیحت یا ڈرنے سے محروم رہے گا، پھر {’’لَعَلَّ‘‘ } کا لفظ کیوں فرمایا؟ اس کی دو توجیہیں ہیں اور دونوں درست ہیں۔ ایک تویہ کہ یہ {’’لَعَلَّ‘‘ } موسیٰ اور ہارون علیھما السلام کی نسبت سے ہے کہ تم اس سے نرم بات اس امید کے ساتھ کہو کہ وہ نصیحت حاصل کرے گا یا ڈر جائے گا۔ ترجمہ اسی کے مطابق کیا گیا ہے، کیونکہ موسیٰ علیہ السلام کو تو علم نہیں تھا کہ وہ ایمان نہیں لائے گا۔ اسی طرح مخاطب کتنا بھی سرکش ہو داعی کو ہمیشہ امید کا چراغ دل میں روشن رکھنا لازم ہے۔ دوسری توجیہ یہ ہے کہ {’’لَعَلَّ‘‘} کا لفظ ’’امید ہے‘‘ کے علاوہ{ ’’كَيْ‘‘} یعنی ’’تاکہ‘‘ کے معنی میں بھی آتا ہے، جیسے سورۂ بقرہ (۲۱) میں فرمایا : « لَعَلَّكُمْ تَتَّقُوْنَ » ’’تاکہ تم بچ جاؤ۔‘‘ {’’ يَتَذَكَّرُ ‘‘ } نصیحت حاصل کرکے ایمان لے آئے یا کم از کم ڈر کر ظلم سے باز آ جائے، کیونکہ ایک سرکش آدمی سے یہی امید کی جا سکتی ہے۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) { قَالَا رَبَّنَاۤ اِنَّنَا نَخَافُ … :} موسیٰ علیہ السلام نے مصر پہنچ کر ہارون علیہ السلام کو اللہ تعالیٰ کا پیغام پہنچایا اور دونوں بھائیوں نے اپنی بے سرو سامانی اور فرعون کی سرکشی، حاکمانہ تسلط اور ظلم و ستم پر غور کیا تو انسانی فطرت کے مطابق ڈرے اور اپنے رب سے اس کا اظہار کرتے ہوئے عرض کی کہ اے ہمارے رب! ہم تو ڈرتے ہیں کہ وہ ہم پر زیادتی کرتے ہوئے ہمیں قید یا قتل نہ کر دے، یا کوئی اور خوف نا ک سزا نہ دے، یا اس کی سرکشی اور بڑھ جائے اور وہ کفر اور گمراہی میں مزید بڑھ جائے، یا تیری ذات و صفات کے بارے میں کوئی نامناسب بات کہہ گزرے، جس سے ہمیں ہر تکلیف سے زیادہ تکلیف پہنچے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { اِنَّنِيْ مَعَكُمَاۤ :} بے شک میں تمھارے ساتھ ہوں، اگرچہ اللہ تعالیٰ ہر ایک کے ساتھ ہے، فرمایا : «{ وَ هُوَ مَعَكُمْ اَيْنَ مَا كُنْتُمْ }» [ الحدید : ۴ ] ’’اور وہ تمھارے ساتھ ہے، تم جہاں کہیں بھی ہو۔‘‘ مگر یہاں اس سے مراد خاص معیت (ساتھ) ہے، یعنی میں تمھاری ہر طرح سے حفاظت و نصرت کروں گا، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ سے فرمایا تھا : «{ لَا تَحْزَنْ اِنَّ اللّٰهَ مَعَنَا }» [ التوبۃ : ۴۰ ] ’’غم نہ کر، بے شک اللہ ہمارے ساتھ ہے۔‘‘ غور کیجیے پورے مصر کے وسائل کے مالک، بے پناہ فوج کے پہرے میں رب اور معبود ہونے کے دعوے دار کے پاس مقہور و مجبور اور غلام قوم کے دو آدمی جاتے ہیں، جن کے پاس بظاہر ایک لاٹھی کے سوا کچھ نہیں، نہ انھیں کوئی پہرے دار روک سکتا ہے اور نہ فوج کو روکنے کی جرأت ہوتی ہے۔ وہ سیدھے فرعون کے بھرے دربار میں بلاخوف و خطر جا کر اللہ تعالیٰ کا پیغام پہنچاتے ہیں۔ اس کے ہر سوال کا جواب دیتے ہیں اور اس کے ہر مغالطے کا پردہ چاک کرتے ہیں، یہاں تک کہ وہ لاجواب ہو کر قید کی دھمکی دیتا ہے، مگر اسے نہ قید کرنے کی جرأت ہوتی ہے اور نہ کسی اور زیادتی کی، اس سے بڑھ کر اللہ تعالیٰ کے ساتھ ہونے کا مظاہرہ اور کیا ہو گا؟ ¤ ➋ { اَسْمَعُ وَ اَرٰى :} میں دوسرے بھیجنے والوں کی طرح نہیں جو اپنا قاصد بھیج کر نہ اسے دیکھ سکتے ہیں اور نہ اس کی بات سن سکتے ہیں، بلکہ میں ہر وقت تمھارے ساتھ ہوں، تمھاری اور سب کی ہر بات سن رہا ہوں اور ہر عمل دیکھ رہا ہوں۔ ایسی کوئی بات اور ایسا کوئی کام نہ ہونے دوں گا جس کا تمھیں خوف ہے۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ { فَاْتِيٰهُ فَقُوْلَاۤ اِنَّا رَسُوْلَا رَبِّكَ … :} اللہ تعالیٰ نے فرعون کو تین چیزوں کی دعوت پہنچانے کا حکم دیا، ایک دعوت توحید کہ رب تو نہیں بلکہ وہ ہے جو تیرا بھی رب ہے اور جب وہ تیرے جیسے رب کہلانے والوں کا رب ہے تو باقی تمام مخلوق کا رب ہونے میں تو کوئی شک ہی نہیں۔ دوسری دعوت رسالت کہ ہم تیرے رب کے بھیجے ہوئے ہیں اور اس کا پیغام لے کر تیرے پاس آئے ہیں اور تیسری قوم کی آزادی کا مطالبہ کہ رب تعالیٰ کی توحید اور اپنی رسالت پر ایمان کی دعوت کے بعد خاص تیری طرف یہ پیغام بھی لے کر آئے ہیں کہ بنی اسرائیل کو آزادی دے کر میرے ساتھ بھیج دے کہ وہ اللہ کی زمین میں جہاں آزاد رہ سکیں چلے جائیں اور یہ کہ انھیں ان مختلف قسم کے عذابوں سے رہا کر دے جن سے تو نے انھیں دو چار کر رکھا ہے۔ معلوم ہوا کہ اسلام کی دعوت میں غلام اور مظلوم اقوام کو غلامی سے نجات دلانا بھی شامل ہے۔ یہ کہنا کہ یہ جہاد فی سبیل اللہ نہیں، غلط ہے۔ دیکھیے سورۂ بقرہ (۲۴۶ تا ۲۵۲)۔ ¤ ➋ { قَدْ جِئْنٰكَ بِاٰيَةٍ مِّنْ رَّبِّكَ :} یہ اس بات کی تفصیل ہے کہ ’’ہم تیرے رب کی طرف سے بھیجے ہوئے آئے ہیں‘‘ یعنی یقین جانو کہ ہم تمھارے رب کی طرف سے اپنی رسالت کی نشانی اور دلیل بھی لے کر آئے ہیں، اگر تم اسے دیکھے بغیر ہی ایمان لے آؤ تو بہت ہی اچھا ہے، ورنہ ہم وہ بھی پیش کرنے کے لیے تیار ہیں۔ ¤ ➌ { وَ السَّلٰمُ عَلٰى مَنِ اتَّبَعَ الْهُدٰى :} اس میں ہدایت کی پیروی کرنے والوں کے ساتھ ساتھ فرعون کو بھی سلام ہے، اگر وہ ہدایت قبول کرلے۔ معلوم ہوا کہ اگر وہ ہدایت قبول نہ کرے تو اسے کوئی سلام نہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے بھی کافر بادشاہوں قیصر و کسریٰ وغیرہ کو جو خط لکھے ان میں یہی لکھا : [ اَلسَّلَامُ عَلٰی مَنِ اتَّبَعَ الْهُدٰی] [ بخاري : ۶۲۶۰ ] ’’ سلام ہو اس شخص پر جو اسلام کو قبول کرے ‘‘ یعنی ایمان نہ لانے والوں کے لیے نہ سلامتی کی دعا ہے اور نہ ان کے لیے اللہ کی گرفت سے سلامتی کی کوئی صورت ہے۔ آپ صلی اللہ علیہ وسلم نے ان سب کو لکھا : [ أَسْلِمْ تَسْلَمْ ] [ بخاري : ۷ ] ’’مسلمان ہو جاؤ تو سلامت رہو گے۔‘‘"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) { اِنَّا قَدْ اُوْحِيَ اِلَيْنَاۤ …:} توحید و رسالت اور بنی اسرائیل کو اپنے ظلم و ستم اور غلامی سے آزاد کرنے کی دعوت کے ساتھ ہی خوش خبری بھی سنائی کہ جو ہدایت کی پیروی کرے گا سلامت رہے گا۔ اس آیت میں ڈرانے کا فریضہ سرانجام دیا کہ ہمیں وحی کے ذریعے سے بتایا گیا ہے کہ جو جھٹلائے گا اور منہ پھیرے گا اس پر اللہ کا عذاب نازل ہو گا۔ اس ڈرانے میں بھی نرم سے نرم الفاظ، جو ممکن تھے، ملحوظ رکھے، یہ نہیں فرمایا کہ تم پر عذاب نازل ہو گا۔ اس سلامتی اور عذاب دونوں کو عام رکھا، اس میں دنیا اور آخرت دونوں کی سلامتی اور عذاب شامل ہیں۔ یہ مضمون سورۂ نازعات (۳۰ تا ۳۹) اور سورۂ قیامہ (۳۱ تا ۳۵) وغیرہ میں بھی بیان ہوا ہے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) {قَالَ فَمَنْ رَّبُّكُمَا يٰمُوْسٰى :} یعنی وہ کون ہے جسے تم نے مجھے چھوڑ کر رب بنا رکھا ہے؟ واضح رہے کہ فرعون اپنے رب اعلیٰ ہونے کا دعوے دار تھا (نازعات : ۲۴) اور اپنے {’’الٰه‘‘} یعنی معبود ہونے کا بھی۔ (قصص : ۳۸)"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ {قَالَ رَبُّنَا الَّذِيْۤ اَعْطٰى كُلَّ شَيْءٍ خَلْقَهٗ :} یعنی صرف یہی نہیں کہ اس نے ہر چیز کو پیدا کیا ہے، بلکہ اس نے ہر چیز کو پیدا کرتے ہوئے اسے اس کی حسب ضرورت اور حسب حال شکل و صورت عطا فرمائی۔ چلنے والے، اڑنے والے اور تیرنے والے ہر جاندار کو، ہر درخت، پہاڑ اور دریا کو اور زمین و آسمان غرض ہر مخلوق کو ایسی شکل و صورت عطا فرمائی کہ کوئی دوسرا نہ اسے بنا سکتا ہے، نہ کوئی نقص یا عیب نکال سکتا ہے اور نہ اس سے بہتر شکل پیش کر سکتا ہے۔ دیکھیے سورۂ سجدہ (۷) اور سورۂ ملک (۳)۔ ¤ ➋ { ثُمَّ هَدٰى :} یعنی اس کے حسب حال شکل و صورت عطا فرما کر اسے زندگی گزارنے اور اپنی بناوٹ سے کام لینے کا راستہ بھی بتایا ہے، چنانچہ پرندے کا بچہ انڈے سے نکلتے ہی دانہ چگنے لگتا ہے، بطخ کا بچہ تیرنے لگتا ہے، جبکہ جانور اور انسان کا بچہ پیدا ہوتے ہی دودھ پینے لگتا ہے، اگر اللہ تعالیٰ نہ سکھاتا تو کون سکھا سکتا تھا؟ الغرض اس کائنات میں ہر چیز جو بھی کام کر رہی ہے اس کی دی ہوئی ہدایت اور تعلیم ہی سے کر رہی ہے۔ موسیٰ علیہ السلام کے کہنے کا مطلب یہ ہے کہ ہمارا رب تو نہیں بلکہ وہ بزرگ و برتر اللہ ہے جس کی یہ اور یہ صفات ہیں۔ موسیٰ علیہ السلام نے عموماً وہی دلائل پیش کیے جو ان کے جد امجد ابراہیم علیہ السلام نے پیش کیے تھے۔ دیکھیے سورۂ شعراء (۲۳ تا ۲۹)۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) { قَالَ فَمَا بَالُ الْقُرُوْنِ الْاُوْلٰى:} یہ سوال پوچھنے کی تین وجہیں ہو سکتی ہیں اور موسیٰ علیہ السلام کے جواب میں سب کا حل موجود ہے۔ پہلی وجہ شاہ عبد القادر رحمہ اللہ کے الفاظ میں یہ ہے : ’’فرعون شاید دہریہ مزاج تھا۔ آدمیوں کی پیدائش کو سمجھتا تھا جیسے برسات کا سبزہ، نہ اول کسی نے پیدا کیا، آپ ہی پیدا ہو گیا، نہ آخر باقی رہا، گل کر مٹی ہو گیا۔ جب سنا کہ سب کے سر پر ایک رب ہے تب یہ پوچھا کہ اگلی خلق کہاں گئی؟ بتایا ان کا حساب لکھا ہوا موجود ہے کہ ایک ایک آدمی پھر حاضر ہو گا۔‘‘ (موضح) دوسری وجہ اس کے یہ پوچھنے کی کہ پھر پہلے زمانوں کے لوگوں کا کیا حال ہے، یہ ہو سکتی ہے کہ وہ یہ کہلوانا چاہتا تھا کہ جو لوگ سیکڑوں برس سے نسلاً بعد نسل دوسروں کو اپنا رب سمجھتے اور ان کی بندگی کرتے رہے ہیں وہ سب گمراہ اور مستحق عذاب تھے۔ مقصد اس کا یہ تھا کہ جب موسیٰ علیہ السلام ان کو گمراہ اور مستحق عذاب قرار دیں گے تو ان کے خلاف تمام لوگوں کے جذبات بھڑک اٹھیں گے اور وہ ان کی دعوت سے متنفر ہو جائیں گے۔ اہل حق کے خلاف اہل باطل جاہلوں کو مشتعل کرنے کا یہ ہتھکنڈا ہمیشہ سے استعمال کرتے رہے ہیں اور آج بھی اسے کارگر حربہ سمجھتے ہیں۔ سورۂ شعراء کی آیات (۲۳ تا ۲۹) کی روشنی میں یہ مطلب سب سے واضح نظر آتا ہے۔ موسیٰ علیہ السلام نے اس معاملے کو اللہ کے علم کے سپرد کر دیا، چنانچہ فرعون کا وار خالی گیا۔ ¤ تیسری وجہ یہ کہ فرعون یہ باور کروانا چاہتا تھا کہ رسول تو عالم الغیب ہوتے ہیں، اگر تم واقعی رسول ہو تو پہلے یہ بتاؤ کہ پہلے زمانوں کے لوگوں کا کیا حال ہے، ان کا حال ہمیں بتاؤ۔ مقصد یہ تھا کہ جب نہیں بتا سکیں گے تو ہم کہہ دیں گے کہ یہ کیسا رسول ہے جو پہلے زمانوں کے لوگوں کے احوال بھی نہیں جانتا؟ جواب یہ دیا کہ یہ جاننا رسولوں کی ذمہ داری نہیں بلکہ یہ رب تعالیٰ کا کام ہے۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ {قَالَ عِلْمُهَا عِنْدَ رَبِّيْ :} یعنی مجھے ان کے حال سے کوئی بحث نہیں، وہ اپنے اس رب کے پاس پہنچ گئے جس کے پاس ان کے تمام اعمال اور نیتوں کا ریکارڈ موجود ہے، جیسے ان کے اعمال ہوں گے ویسا ہی بدلہ ان کو مل جائے گا۔ ہمیں فکر اپنے حال کی ہونی چاہیے کہ ہم کس طرح اپنے آپ کو عذاب کا مستحق ہونے سے بچا سکتے ہیں؟ یہ نہایت ہی حکیمانہ جواب ہے، جو صحیح بھی ہے اور اس سے فرعون بھی اپنے مقصد میں کامیاب نہ ہو سکا۔ ¤ ➋ { فِيْ كِتٰبٍ لَا يَضِلُّ رَبِّيْ وَ لَا يَنْسَى :} چونکہ لکھی ہوئی بات زیادہ معتبر سمجھی جاتی ہے اس لیے اللہ تعالیٰ نے لوگوں پر حجت تمام کرنے کے لیے کراماً کاتبین مقرر فرمائے، جو ہر ایک کی کتاب تیار کر رہے ہیں۔ ساتھ ہی آگاہ فرما دیا کہ کتاب میں لکھنے کا مطلب یہ نہیں کہ اللہ تعالیٰ غلطی یا بھول سے بچنے کے لیے لکھنے کا محتاج ہے، نہیں! بلکہ اللہ تعالیٰ ہر نقص کی طرح ان دونوں نقصوں سے بھی پاک ہے۔ اس میں ایک چوٹ بھی ہے، کیونکہ یہ کہنے کی ضرورت ہی نہیں کہ ہر چیز کا خالق و ہادی نہ بھٹکتا ہے اور نہ بھولتا ہے، دراصل یہ فرعون سے کہا جا رہا ہے کہ تو، جس کی سرشت میں بھٹکنا اور بھولنا رکھ دیا گیا ہے، کیا تجھے رب اعلیٰ ہونے کا دعویٰ کرتے ہوئے حیا نہیں آئی؟ سبحان اللہ! ¤ بت کریں آرزو خدائی کی ¤ شان ہے تیری کبریائی کی ¤"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت54,53) ➊ {الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ مَهْدًا …:} یہ دونوں آیات موسیٰ علیہ السلام کا کلام بھی ہو سکتی ہیں، جسے نقل کرتے ہوئے اللہ تعالیٰ نے زمین سے مختلف نباتات نکالنے کا ذکر آنے پر اپنے لیے غائب کے صیغوں کے بعد جمع متکلم کا صیغہ استعمال فرما دیا، یعنی {’’ فَاَخْرَجْنَا بِهٖۤ اَزْوَاجًا ‘‘} اور یہ بھی ہو سکتا ہے کہ موسیٰ علیہ السلام کا کلام {’’ وَ لَا يَنْسَى ‘‘} پر ختم ہو گیا ہو اور ان دونوں آیتوں میں اللہ تعالیٰ نے مقام کی مناسبت سے اپنی مزید نعمتیں بیان فرمائی ہوں۔ اس صورت میں بھی اللہ تعالیٰ نے پہلے اپنا ذکر غائب کے صیغے سے فرمایا اور {’’ فَاَخْرَجْنَا ‘‘} میں اپنی عظمت کے اظہار کے لیے جمع متکلم کا صیغہ استعمال فرمایا۔ ¤ ➋ ان دو آیات میں اللہ تعالیٰ نے اپنی چار نعمتیں ذکر فرمائی ہیں، پہلی نعمت زمین کو انسان کے لیے بچھونا بنانا۔ اس کا ذکر کئی آیات میں فرمایا۔ دیکھیے سورۂ زخرف (۹، ۱۰)، سورۂ نبا (۶)، ذاریات (۴۸) اور رعد (۳) وغیرہ۔ دوسری نعمت زمین میں راستے بنانا سکھایا۔ دیکھیے سورۂ زخرف (۹)، انبیاء (۳۱)، نوح (۱۹) اور نحل(۱۵) تیسری نعمت آسمان سے پانی اتارنا، اس کا ذکر قرآن مجید کی بہت سی آیات میں ہے۔ چوتھی نعمت بنی آدم اور ان کے مویشیوں کے لیے بے شمار قسم کی کھانے اور استعمال کی چیزیں اگانا۔ دیکھیے سورۂ سجدہ (۲۷)، نازعات (۳۱ تا ۳۳)، عبس (۲۵ تا ۳۲) اور سورۂ نحل (۱۰)۔ (شنقیطی) ¤ ➌ {’’ شَتّٰى ‘‘ ’’شَتِيْتٌ‘‘} کی جمع ہے، مختلف، جیسا کہ {’’مَرِيْضٌ‘‘} کی جمع {’’ مَرْضٰي‘‘} ہے۔{ ’’ النُّهٰى ‘‘ ’’ نُهْيَةٌ ‘‘} کی جمع ہے، جس کا معنی عقل ہے، کیونکہ عقل انسان کو نامناسب کاموں سے منع کرتی ہے۔ {’’نَهٰي يَنْهٰي‘‘} کا معنی ہے منع کرنا۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت54,53) ➊ {الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ مَهْدًا …:} یہ دونوں آیات موسیٰ علیہ السلام کا کلام بھی ہو سکتی ہیں، جسے نقل کرتے ہوئے اللہ تعالیٰ نے زمین سے مختلف نباتات نکالنے کا ذکر آنے پر اپنے لیے غائب کے صیغوں کے بعد جمع متکلم کا صیغہ استعمال فرما دیا، یعنی {’’ فَاَخْرَجْنَا بِهٖۤ اَزْوَاجًا ‘‘} اور یہ بھی ہو سکتا ہے کہ موسیٰ علیہ السلام کا کلام {’’ وَ لَا يَنْسَى ‘‘} پر ختم ہو گیا ہو اور ان دونوں آیتوں میں اللہ تعالیٰ نے مقام کی مناسبت سے اپنی مزید نعمتیں بیان فرمائی ہوں۔ اس صورت میں بھی اللہ تعالیٰ نے پہلے اپنا ذکر غائب کے صیغے سے فرمایا اور {’’ فَاَخْرَجْنَا ‘‘} میں اپنی عظمت کے اظہار کے لیے جمع متکلم کا صیغہ استعمال فرمایا۔ ¤ ➋ ان دو آیات میں اللہ تعالیٰ نے اپنی چار نعمتیں ذکر فرمائی ہیں، پہلی نعمت زمین کو انسان کے لیے بچھونا بنانا۔ اس کا ذکر کئی آیات میں فرمایا۔ دیکھیے سورۂ زخرف (۹، ۱۰)، سورۂ نبا (۶)، ذاریات (۴۸) اور رعد (۳) وغیرہ۔ دوسری نعمت زمین میں راستے بنانا سکھایا۔ دیکھیے سورۂ زخرف (۹)، انبیاء (۳۱)، نوح (۱۹) اور نحل(۱۵) تیسری نعمت آسمان سے پانی اتارنا، اس کا ذکر قرآن مجید کی بہت سی آیات میں ہے۔ چوتھی نعمت بنی آدم اور ان کے مویشیوں کے لیے بے شمار قسم کی کھانے اور استعمال کی چیزیں اگانا۔ دیکھیے سورۂ سجدہ (۲۷)، نازعات (۳۱ تا ۳۳)، عبس (۲۵ تا ۳۲) اور سورۂ نحل (۱۰)۔ (شنقیطی) ¤ ➌ {’’ شَتّٰى ‘‘ ’’شَتِيْتٌ‘‘} کی جمع ہے، مختلف، جیسا کہ {’’مَرِيْضٌ‘‘} کی جمع {’’ مَرْضٰي‘‘} ہے۔{ ’’ النُّهٰى ‘‘ ’’ نُهْيَةٌ ‘‘} کی جمع ہے، جس کا معنی عقل ہے، کیونکہ عقل انسان کو نامناسب کاموں سے منع کرتی ہے۔ {’’نَهٰي يَنْهٰي‘‘} کا معنی ہے منع کرنا۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) { مِنْهَا خَلَقْنٰكُمْ وَ فِيْهَا نُعِيْدُكُمْ … :} یعنی تم سب کے باپ آدم علیہ السلام کا پتلا مٹی سے بنایا گیا اور تمھاری غذائیں اور ضرورت کی تمام چیزیں بھی مٹی سے نکلتی ہیں۔ یہ پہلا مرحلہ ہے جو موت تک چلتا ہے۔ دوسرا مرحلہ یہ کہ موت کے بعد دوبارہ مٹی میں جاؤ گے، پھر کوئی انسان قبر میں دفن ہو یا نہ ہو، بالواسطہ یا بلا واسطہ اس کے اجزا مٹی میں جائیں گے۔ تیسرے مرحلے میں قیامت کے دن انھی اجزا کو دوبارہ روح پھونک کر زندہ کر دیا جائے گا، فرمایا : «{ قَالَ فِيْهَا تَحْيَوْنَ وَ فِيْهَا تَمُوْتُوْنَ وَ مِنْهَا تُخْرَجُوْنَ }» [ الأعراف : ۲۵ ] ’’فرمایا تم اسی میں زندہ رہو گے اور اسی میں مرو گے اور اسی سے نکالے جاؤ گے۔‘‘ بعض روایات میں دفن کے وقت مٹی کی پہلی مٹھی ڈالتے ہوئے {’’ مِنْهَا خَلَقْنٰكُمْ ‘‘} ، دوسری مٹھی ڈالتے ہوئے {’’ وَ فِيْهَا نُعِيْدُكُمْ ‘‘} اور تیسری مٹھی ڈالتے وقت {’’ وَ مِنْهَا نُخْرِجُكُمْ تَارَةً اُخْرٰى ‘‘} پڑھنے کا ذکر ہے، مگر وہ روایات ضعیف ہیں، البتہ آیت پڑھے بغیر تین مٹھی مٹی ڈالنا مسنون ہے۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے : [ أَنَّ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ صَلّٰی عَلٰی جِنَازَةٍ ثُمَّ أَتٰی قَبْرَ الْمَيِّتِ فَحَثٰی عَلَيْهِ مِنْ قِبَلِ رَأْسِهٖ ثَلاَثًا ] [ ابن ماجہ، الجنائز، باب ما جاء في حثو التراب في القبر: ۱۵۶۵، صحیح ] ’’رسول اللہ صلی اللہ علیہ وسلم نے ایک جنازے پر نماز پڑھی، پھر میت کی قبر پر آئے اور اس کے سر کی طرف (مٹی کی) تین مٹھیاں ڈالیں۔‘‘"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) { وَ لَقَدْ اَرَيْنٰهُ اٰيٰتِنَا كُلَّهَا … :} یہ آیت موسیٰ علیہ السلام اور فرعون کی باہمی گفتگو ذکر کرنے کے بعد موسیٰ علیہ السلام کے قصے کو دوبارہ آگے بیان کرنے سے پہلے جملہ معترضہ کے طور پر آئی ہے، یعنی فرعون کفر میں اتنا پکا تھا کہ ہماری تمام نشانیاں دیکھنے اور موسیٰ علیہ السلام کو دل سے سچا سمجھنے کے باوجود ایمان نہیں لایا، حتیٰ کہ اس نے آخری نشانی اپنی آنکھوں سے دیکھ لی کہ سمندر پھٹ گیا اور اس کے پانی کا ہر حصہ ایک بہت بڑے پہاڑ کی طرح کھڑا ہو گیا۔ موسیٰ علیہ السلام اور بنی اسرائیل ان راستوں سے بخیریت گزر گئے (شعراء : ۶۳ تا ۶۶)، اس کے باوجود وہ ایمان نہ لایا، بلکہ اپنے رب ہونے کے جھوٹے دعوے کو سچا ثابت کرنے کے لیے پوری فوج کو لے کر سمندر میں داخل ہو کر غرق ہوا، مگر غرق ہونے سے پہلے تک وہ جھٹلاتا اور انکار ہی کرتا رہا۔ دیکھیے سورۂ قمر (۴۱، ۴۲) اور یونس (۹۰ تا ۹۲)۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) ➊ { قَالَ اَجِئْتَنَا … : } فرعون نے یہ بات تمام نشانیاں دیکھنے کے بعد نہیں کہی، کیونکہ اگر ایسا ہو تو جادوگروں سے ہونے والا یہ مقابلہ طوفان، جراد، قمل وغیرہ حتیٰ کہ سمندر پھٹنے کے واقعہ کے بعد ماننا پڑے گا، کیونکہ {’’ اٰيٰتِنَا كُلَّهَا ‘‘} میں یہ سب شامل ہیں۔ اس لیے قرآن مجید کے دوسرے مقامات کی صراحت کے مطابق فرعون نے موسیٰ علیہ السلام کا عصا اور ید بیضا والا معجزہ دیکھ کر یہ بات کہی۔ دیکھیے سورۂ اعراف (۱۰۶ تا ۱۲۶) اور شعراء (۳۰ تا ۵۱)۔ (ابن عاشور) ¤ ➋ { لِتُخْرِجَنَا مِنْ اَرْضِنَا :} ہر باطل پرست اور جابر و ظالم حکمران جب داعی حق کے سامنے لاجواب ہو جاتا ہے تو اس کی دعوت ٹھکرانے کے لیے یہی ہتھکنڈا استعمال کرتا ہے، یعنی اسے اقتدار کا بھوکا ہونے کا طعنہ دیتا ہے، گویا اقتدار پر قابض رہنا اس کا تو پیدائشی حق ہے مگر کسی دوسرے کے لیے اس کے قریب پھٹکنا بھی جائز نہیں۔ ¤ ➌ { ’’ بِسِحْرِكَ ‘‘} میں ’’جادو‘‘ کی اضافت موسیٰ علیہ السلام کے لیے آنے والی ضمیر (کاف) کی طرف کرنے میں ان معجزوں کی تحقیر مراد ہے کہ تو اپنے اس بے قدر و قیمت جادو کے ذریعے سے ہمیں سرزمین مصر سے نکالنا چاہتا ہے۔ تیرے اس جادو کی ہمارے کامل اور ماہر فن جادوگروں کے جادو کے مقابلے میں کیا حیثیت ہے؟"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) { فَاجْعَلْ بَيْنَنَا وَ بَيْنَكَ مَوْعِدًا …: ’’ مَوْعِدًا ‘‘} ظرف زمان بھی ہو سکتا ہے، مکان بھی اور مصدر میمی بھی، یعنی ہمارے ساتھ وہ وقت بھی طے کر لو جس میں مقابلہ ہو گا اور جگہ بھی، البتہ جگہ ایسی ہونی چاہیے جو قبطیوں اور بنی اسرائیل دونوں کے لیے برابر ہو، تاکہ کسی کو آنے میں دشواری پیش نہ آئے۔ بعض مفسرین نے فرمایا کہ {’’ مَكَانًا سُوًى ‘‘} کا مطلب برابر اور ہموار زمین ہے، جہاں سب مقابلہ دیکھ سکیں۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) { قَالَ مَوْعِدُكُمْ يَوْمُ الزِّيْنَةِ …: ’’ ضُحًى ‘‘} وہ وقت جب سورج نکلنے کے بعد اس کی حرارت کا آغاز ہوتا ہے۔ موسیٰ علیہ السلام تو خود چاہتے تھے کہ زیادہ سے زیادہ لوگ جمع ہوں، تاکہ ان تک حق کا پیغام پہنچے اور وہ معجزات الٰہی کو اور حق کی فتح کو اپنی آنکھوں سے دیکھیں۔ چنانچہ {’’ يَوْمُ الزِّيْنَةِ ‘‘} اور دوپہر کا وقت مقرر کر دیا گیا، تاکہ لوگ چھٹی کی وجہ سے فارغ ہوں اور دوپہر تک تمام علاقوں سے ہر شخص آسانی سے پہنچ جائے، دن کی روشنی زیادہ سے زیادہ ہو اور اگر مقابلہ طول پکڑ جائے تو مغرب تک لمبا وقت مل جائے۔ {’’ يَوْمُ الزِّيْنَةِ ‘‘ } مصریوں کے ہاں معروف دن تھا، یہ اس دن منایا جاتا جب نیل کی طغیانی اپنی انتہا کو پہنچ جاتی اور دور تک پانی پھیل جاتا، جس کے بعد فصلوں کی کاشت کا آغاز ہوتا۔ ابن عاشور رحمہ اللہ نے اس کا اندازہ پندرہ ستمبر لگایا ہے ہے۔ تفصیل ’’التحریر والتنویر‘‘ میں دیکھیں۔ موسیٰ علیہ السلام نے جگہ کا ذکر نہیں فرمایا، اس سے معلوم ہوتا ہے کہ {’’ يَوْمُ الزِّيْنَةِ ‘‘} میں تمام لوگوں کا جشن منانے کے لیے کسی خاص جگہ جمع ہونا معروف تھا، جیسا کہ حکومتوں نے بڑے بڑے سٹیڈیم بنا رکھے ہوتے ہیں، اس لیے زینت کا دن اور وقت طے کرنے کے بعد جگہ کے ذکر کی ضرورت نہ تھی۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) { فَتَوَلّٰى فِرْعَوْنُ فَجَمَعَ … :} یعنی فرعون نے مجلس برخاست کر دی اور پھر اپنے سرداروں سے مشورے اور سب کے اتفاق کے بعد پوری کوشش سے ایک طرف تو سلطنت کے ہر علاقے سے ماہر جادوگر جمع کر لیے اور انھیں انعام و اکرام اور قرب شاہی کا وعدہ کر کے مقابلے کے لیے تیار کیا اور دوسری طرف عام لوگوں کو دیکھنے کی ترغیب دی کہ مقابلہ دیکھنے کے لیے زیادہ سے زیادہ تعداد میں جمع ہوں۔ پھر فرعون سب کچھ ساتھ لے کر میدان مقابلہ میں آ گیا۔ دیکھیے سورۂ اعراف (۱۰۹، ۱۱۰)، شعراء (۳۴، ۳۵) اور نازعات (۲۲، ۲۳)۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) ➊ {وَيْلَكُمْ لَا تَفْتَرُوْا عَلَى اللّٰهِ كَذِبًا : ’’ وَيْلَكُمْ ‘‘} ’’تمھاری بربادی ہو‘‘ نصیحت کرتے ہوئے سختی کا لفظ بھی استعمال ہو سکتا ہے اور محبت اور بے تکلفی کا بھی، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوبصیر رضی اللہ عنہ کو فرمایا تھا : [ وَيْلُ أُمِّهِ مِسْعَرَ حَرْبٍ ] [ بخاری، الشروط، باب الشروط في الجھاد… : ۲۷۳۱،۲۷۳۲]’’اس کی ماں مرے! یہ تو لڑائی بھڑکانے والا ہے۔‘‘ موسیٰ علیہ السلام نے پہلے فرعون کو نصیحت کی تھی، اب اس کے امراء اور جادوگروں کو بھی نصیحت کرنا ضروری تھا، چنانچہ انھیں سمجھایا بھی اور ڈرایا بھی۔ ¤ ➋ { فَيُسْحِتَكُمْ بِعَذَابٍ : ’’أَسْحَتَ يُسْحِتُ‘‘ أَيْ ’’اِسْتَأْصَلَ‘‘} جڑ سے اکھاڑ پھینکنا۔ {’’ بِعَذَابٍ ‘‘} کی تنوین تنکیر کے لیے ہو تو ’’کسی عذاب کے ساتھ‘‘ ترجمہ ہو گا اور تعظیم کے لیے ہو تو ’’بڑے عذاب کے ساتھ‘‘ ہو گا۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) { فَتَنَازَعُوْۤا اَمْرَهُمْ بَيْنَهُمْ … :} نصیحت بعض پر مؤثر ہوئی، بعض پر نہیں۔ چنانچہ وہ آپس میں چپکے چپکے جھگڑنے لگے، تاکہ فرعون یا موسیٰ یا عوام میں سے کسی کو ان کے باہمی اختلاف کی خبر نہ ہونے پائے۔ {’’ النَّجْوٰى ‘‘} آپس کی خفیہ بات، سرگوشی۔ {’’ اَسَرُّوا ‘‘} انھوں نے پوشیدہ کیا۔ {’’ النَّجْوٰى ‘‘} (سرگوشی) خود پوشیدہ ہوتی ہے، پھر {’’ اَسَرُّوا ‘‘} سے اس کی مزید پوشیدگی کا اندازہ کریں اور اس سے پہلے {’’ بَيْنَهُمْ ‘‘} (آپس میں) کا لفظ بتاتا ہے کہ اس جھگڑے کی خبر اس محدود گروہ کے درمیان ہی رہی، باہر نہیں نکلی۔ (ابن عاشور) کوئی کہنے لگا، موسیٰ جادوگر ہے اور کوئی کہنے لگا، یہ چہرہ جادوگر کا نہیں ہو سکتا۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) ➊ { قَالُوْۤا اِنْ هٰذٰىنِ لَسٰحِرٰنِ … :} یہ {’’ اِنْ ‘‘} اصل میں {’’إِنَّ‘‘} حرف تاکید ہے، جس کی علامت خبر {’’ لَسٰحِرٰنِ ‘‘} پر لام تاکید ہے۔ یہاں ایک مشہور سوال ہے کہ {’’ إِنَّ ‘‘} اپنے اسم کو نصب دیتا ہے، اس لیے {’’ هٰذٰىنِ ‘‘} کے بجائے {’’هٰذَيْنِ‘‘} ہونا چاہیے تھا۔ اس کا ایک جواب یہ ہے کہ {’’ إِنَّ‘‘} کے نون کو جزم دینے کے بعد اس کا عمل ختم کر دیا گیا اور {’’ هٰذٰىنِ ‘‘} مبتدا ہونے کی وجہ سے مرفوع ہے، دوسرا یہ کہ {’’ اِنْ ‘‘} (نون ساکن کے ساتھ) {’’ إِنَّهُ ‘‘} یعنی {’’ إِنَّ ‘‘} اور ضمیر شان کی جگہ آیا ہے، چنانچہ {’’اِنْ ‘‘} کا اسم ضمیرِ شان تھی اور {’’ هٰذٰىنِ ‘‘} اگلے جملے کا مبتدا ہے اور وہ جملہ {’’ اِنْ ‘‘} کی خبر بن رہا ہے۔ (ابن جزی) مزید جواب لمبی تفسیروں میں دیکھیں۔ {’’ الْمُثْلٰى ‘‘ ’’أَمْثَلُ‘‘} اسم تفضیل کا مؤنث ہے، بمعنی {’’أَفْضَلُ‘‘} سب سے اچھا۔ ¤ ➋ آخر باہمی مشورے کے بعد مال و دولت اور جاہ ومنصب کی حرص نے ان سب کو مقابلے پر متفق کر دیا اور فیصلہ یہ ٹھہرا کہ یہ دونوں یقینا جادوگر ہیں اور چاہتے ہیں کہ اقتدار حاصل کرکے تمھیں تمھارے وطن سے نکال دیں اور تمھارے دین و مذہب کو، جو سب سے اچھا ہے اور تمھاری عیش و عشرت والی بہترین زندگی کو حکومت پر قبضہ کرکے ختم کر دیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا ذِئْبَانِ جَائِعَانِ أُرْسِلاَ فِيْ غَنَمٍ بِأَفْسَدَ لَهَا مِنْ حِرْصِ الْمَرْءِ عَلَی الْمَالِ وَالشَّرَفِ لِدِيْنِهٖ ] ’’دو بھوکے بھیڑیے، جو بھیڑ بکریوں میں چھوڑ دیے جائیں، وہ انھیں اس قدر برباد کرنے والے نہیں جس قدر آدمی کی مال اور بلند مرتبہ (شہرت) کی حرص اس کے دین کو برباد کرنے والی ہے۔‘‘ [ ترمذی، الزھد، باب حدیث ما ذئبان جائعان… : ۲۳۷۶۔ ابن حبان : ۳۲۲۸، عن کعب بن مالک رضی اللہ عنہ ، صحیح ]"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) ➊ {فَاَجْمِعُوْا كَيْدَكُمْ …: ’’جَمَعَ يَجْمَعُ‘‘} (ف) جمع کرنا اور {’’أَجْمَعَ‘‘} (افعال) پختہ کرنا، پختہ ارادہ کرنا، اتفاق کرنا۔ لہٰذا {’’ فَاَجْمِعُوْا ‘‘} (افعال)کا ترجمہ ’’جمع کرو یا اکٹھا کرو‘‘ درست نہیں۔ یعنی یہ تذبذب اور اختلاف چھوڑو کہ موسیٰ ( علیہ السلام ) کا مقابلہ کیا جائے یا نہ کیا جائے، تم اپنا ارادہ اور اپنی خفیہ تدبیر پختہ اور مستحکم کرو اور پھر صف کی صورت میں اکٹھے ہو کر میدان میں آؤ، تاکہ سب پر تمھارا رعب پڑے اور دفعتاً ایسا حملہ کرو کہ حریف کے قدم اکھڑ جائیں۔ اس سے ظاہر ہے کہ جادوگر بہت بڑی تعداد میں تھے اور انھوں نے ایک بے ہنگم ہجوم کی صورت میں سامنے آنے کے بجائے باقاعدہ فوجی ترتیب سے آگے پیچھے صفیں باندھ کر اپنی ہیبت اور شان و شوکت کے اظہار کا فیصلہ کیا۔ {’’ صَفًّا ‘‘} یہاں جنس کے معنی میں ہے اور اس سے ایک صف مراد نہیں، جیسا کہ فرمایا : «{ يَوْمَ يَقُوْمُ الرُّوْحُ وَ الْمَلٰٓىِٕكَةُ صَفًّا }» [ النبا : ۳۸ ] ’’جس دن روح اور فرشتے صف بنا کر کھڑے ہوں گے۔‘‘ فرعون کے حکم سے مصر کے تمام شہروں میں سے ہر ماہر جادوگر وہاں لایا گیا تھا، اس لیے مراد کئی صفیں ہیں۔ ¤ ➋ { وَ قَدْ اَفْلَحَ الْيَوْمَ مَنِ اسْتَعْلٰى : ’’ اسْتَعْلٰى ‘‘ ’’عَلَا يَعْلُوْ‘‘ } سے استفعال ہے۔ زائد حروف مبالغے کے لیے ہیں، یعنی آج کے مقابلے کی اتنی اہمیت ہے کہ جس نے اس میں واضح اور نمایاں غلبہ حاصل کر لیا اس کا سکہ ہمیشہ کے لیے بیٹھ گیا اور جو اس میں رہ گیا پھر کبھی سر نہ اٹھا سکے گا۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) { قَالُوْا يٰمُوْسٰۤى اِمَّاۤ اَنْ تُلْقِيَ … :} فرعون نے موسیٰ علیہ السلام کے عصا کو سانپ بنتے ہوئے دیکھا تو لوگوں کی نگاہ میں اسے بے وقعت بنانے کے لیے اسے جادو قرار دے کر کہا کہ ہم بھی مقابلے میں ایسا ہی جادو لائیں گے، چنانچہ اس کے مطابق جادوگروں نے لاٹھیوں اور رسیوں کے سانپ بننے کے شعبدے کی تیاری کی اور میدان میں آ کر یہ پیش کش کی جو اس آیت میں مذکور ہے۔ اس پیش کش کے الفاظ سے اپنے جادو پر ان کے اعتماد کا اظہار بھی ہوتا ہے اور اس بات کا بھی کہ اگر تم پہل پر تیار نہیں ہو تو ہم اس کے لیے بالکل تیار ہیں۔ حقیقت یہ ہے کہ انھوں نے جس خیال سے بھی یہ پیش کش کی ہو اس میں اللہ تعالیٰ کی یہ حکمت پوشیدہ تھی کہ ان کے جادو کا سارا کمال لوگوں کے سامنے آنے کے بعد اسے حق کے مقابلے میں بے حقیقت ثابت کیا جائے، جیسا کہ اس سے پہلے خود فرعون کے منہ سے موسیٰ علیہ السلام کو اختیار دلوایا گیا کہ مقابلے کامقام اور دن وہ مقرر کریں۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) { فَاِذَا حِبَالُهُمْ وَ عِصِيُّهُمْ … :} ’’اچانک‘‘کے لفظ سے معلوم ہوتا ہے کہ انھوں نے ایسی زبردست تیاری کر رکھی تھی کہ ان کے لاٹھیوں اور رسیوں کو پھینکنے کے بعد ان کے دوڑنے اور حرکت کرنے میں کوئی تاخیر نہیں ہوئی۔ صف در صف کھڑے ہوئے جادوگروں کی بیک وقت پھینکی ہوئی لاٹھیوں اور رسیوں سے میدان دوڑتے ہوئے سانپوں کی شکل میں بدل گیا۔ اللہ تعالیٰ نے سورۂ اعراف میں ان کے لوگوں کی آنکھوں پر جادو کرنے کا ذکر فرمایا ہے اور ان کے جادو کو سحر عظیم قرار دیا ہے۔ اس آیت سے لے کر آیت(۷۶) تک کی تفسیر کے لیے سورۂ اعراف کی آیت(۱۱۵) سے (۱۲۶) کی تفسیر ملاحظہ فرمائیں۔ یہاں چند مختصر سے اشاروں پر اکتفا کیا گیا ہے۔"
    },
    {
      "ayah": 67,
      "tafsir": ""
    },
    {
      "ayah": 68,
      "tafsir": ""
    },
    {
      "ayah": 69,
      "tafsir": ""
    },
    {
      "ayah": 70,
      "tafsir": ""
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) ➊ { اِنَّهٗ لَكَبِيْرُكُمُ الَّذِيْ عَلَّمَكُمُ السِّحْرَ:} یعنی یہ تمھارا ’’گرو‘‘ ہے اور تم اس کے چیلے ہو۔ معلوم ہوتا ہے کہ تم آپس میں طے کرکے آئے ہو کہ پہلے چیلے ایک شعبدہ دکھائیں گے، پھر وہ سب کے سامنے ’’گرو‘‘ سے شکست کھا لیں گے، تاکہ دیکھنے والے ان کے ’’گرو‘‘ کا کہنا مان لیں اور اس کے معتقد بن جائیں۔ فرعون نے یہ شبہ اسی وقت پیدا کر دیا کہ کہیں ایسا نہ ہو کہ عوام بھی ان کے متبع ہو جائیں۔ ¤ ➋ {فَلَاُقَطِّعَنَّ اَيْدِيَكُمْ …:} شبہ پیدا کرنے کے بعد اوپر سے دھمکی بھی دے دی، تاکہ ان کو ایمان پر قائم رہنے سے پھیر دیا جائے اور دوسرے لوگ بھی مرعوب ہو جائیں۔ ¤ ➌ {فِيْ جُذُوْعِ النَّخْلِ : ’’ جُذُوْعِ ‘‘ ’’جِذْعٌ‘‘} (جیم کے کسرہ کے ساتھ) کی جمع ہے ’’تنے۔‘‘ سولی دینے کے لیے اونچے سے اونچا میسر کھمبا اس وقت کھجور کا تنا تھا۔ ظاہر ہے کہ سولی تنے کے اوپر دی جاتی ہے، مگر یہاں {’’ فِيْ جُذُوْعِ النَّخْلِ ‘‘} (کھجوروں کے تنوں میں) فرمایا۔ مفسرین فرماتے ہیں کہ یہاں لفظ {’’ فِيْ ‘‘ ’’عَلٰي‘‘} کے معنی میں ہے، مگر {’’ فِيْ ‘‘} کا لفظ اس لیے استعمال کیا کہ تمھیں کھجوروں کے تنوں کے اوپر لے جا کر کیلوں یا رسیوں کے ساتھ تنوں میں پیوست کر دوں گا اور اس طرح تم عبرت ناک انجام کو پہنچو گے۔ سولی کی تفصیل سورۂ اعراف (۱۱۵ تا ۱۲۶) میں دیکھیں۔ ¤ ➍ { وَ لَتَعْلَمُنَّ اَيُّنَاۤ اَشَدُّ عَذَابًا وَّ اَبْقٰى:} یعنی وہ عذاب جس سے موسیٰ( علیہ السلام ) نے تمھیں مقابلے سے پہلے ڈرایا تھا کہ {’’وَيْلَكُمْ لَا تَفْتَرُوْا عَلَى اللّٰهِ كَذِبًا فَيُسْحِتَكُمْ بِعَذَابٍ ‘‘} وہ زیادہ سخت اور دیرپا ہے یا میرا عذاب؟ فرعون حقیقت ِحال سے واقف تھا، مگر اپنی شکست فاش پر پردہ ڈالنے کے لیے یہ دھمکیاں دے رہا تھا۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 73،72) {قَالُوْا لَنْ نُّؤْثِرَكَ عَلٰى مَا جَآءَنَا … :} مگر جادوگروں کا ایمان تو ایک للمحہ میں اس قدر پختہ ہو گیا تھا کہ نہ ان کے دل میں مال و دولت اور دنیوی جاہ و منصب کی کچھ قدر باقی رہ گئی، جس کے لیے انھوں نے یہ مقابلہ کیا تھا اور نہ اب فرعون کی دھمکیوں کا ان پر کچھ اثر ہوا۔ چنانچہ انھوں نے کہا کہ تو اس سے زیادہ کیا کر سکتا ہے کہ ہماری چند روزہ دنیاوی زندگی کا خاتمہ کر دے؟ سو ہمیں اس کی پروا نہیں۔ مگر آج ایک شخص ساٹھ سال قرآن پڑھ کر بھی حقیر دنیا کے بدلے اپنے ایمان کو فروخت کر دیتا ہے۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73،72) {قَالُوْا لَنْ نُّؤْثِرَكَ عَلٰى مَا جَآءَنَا … :} مگر جادوگروں کا ایمان تو ایک للمحہ میں اس قدر پختہ ہو گیا تھا کہ نہ ان کے دل میں مال و دولت اور دنیوی جاہ و منصب کی کچھ قدر باقی رہ گئی، جس کے لیے انھوں نے یہ مقابلہ کیا تھا اور نہ اب فرعون کی دھمکیوں کا ان پر کچھ اثر ہوا۔ چنانچہ انھوں نے کہا کہ تو اس سے زیادہ کیا کر سکتا ہے کہ ہماری چند روزہ دنیاوی زندگی کا خاتمہ کر دے؟ سو ہمیں اس کی پروا نہیں۔ مگر آج ایک شخص ساٹھ سال قرآن پڑھ کر بھی حقیر دنیا کے بدلے اپنے ایمان کو فروخت کر دیتا ہے۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) {لَا يَمُوْتُ فِيْهَا وَ لَا يَحْيٰى :} رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [أَمَّا أَهْلُ النَّارِ الَّذِيْنَ هُمْ أَهْلُهَا، فَإِنَّهُمْ لاَ يَمُوْتُوْنَ فِيْهَا وَلاَ يَحْيَوْنَ، وَلٰكِنْ نَاسٌ مِنْكُمْ أَصَابَتْهُمُ النَّارُ بِذُنُوْبِهِمْ فَأَمَاتَهُمُ اللّٰهُ تَعَالٰی إِمَاتَةً، حَتّٰی إِذَا كَانُوْا فَحْمًا أُذِنَ بِالشَّفَاعَةِ، فَجِيْئَ بِهِمْ ضَبَائِرَ ضَبَائِرَ، فَبُثُّوْا عَلَی أَنْهَارِ الْجَنَّةِ، ثُمَّ قِيْلَ ! يَا أَهْلَ الْجَنَّةِ ! أَفِيْضُوْا عَلَيْهِمْ، فَيَنْبُتُوْنَ نَبَاتَ الْحِبَّةِ تَكُوْنُ فِيْ حَمِيْلِ السَّيْلِ ] [ مسلم، الإیمان، باب إثبات الشفاعۃ و إخراج الموحدین من النار : ۱۸۵، عن أبي سعید الخدري رضی اللہ عنہ ]’’آگ والے، جو اسی میں رہنے والے ہیں، وہ تو اس میں نہ مریں گے اور نہ جییں گے اور لیکن کچھ لوگ، جنھیں ان کے گناہوں کی وجہ سے آگ لگ جائے گی تو اللہ تعالیٰ انھیں ایک طرح کی موت دے دے گا، یہاں تک کہ جب وہ کوئلہ ہو جائیں گے تو شفاعت کا اذن ہو جائے گا۔ سو انھیں ڈھیروں کی صورت میں لایا جائے گا اور وہ جنت کی نہروں (کے کناروں) پر بکھیر دیے جائیں گے، پھر کہا جائے گا کہ اے جنتیو! ان پر پانی انڈیلو، تو وہ اس طرح اگ آئیں گے جیسے سیلاب کی لائی مٹی میں جڑی بوٹیوں کے بیج (فوراً) اگ آتے ہیں۔‘‘ ’’نہ مرے گا اور نہ جیے گا‘‘ کی تفسیر کے لیے دیکھیے سورۂ فاطر (۳۶)، ابراہیم (۱۵ تا ۱۷)، نساء (۵۶)، اعلیٰ (۱۱ تا ۱۳) اور زخرف (۷۷)۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 76,75) {فَاُولٰٓىِٕكَ لَهُمُ الدَّرَجٰتُ الْعُلٰى … : ’’ الْعُلٰى ‘‘ ’’عُلْيَا‘‘} کی جمع ہے، جو اسم تفضیل {’’ أَعْلٰي‘‘} کی مؤنث ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ، وَالْفِرْدَوْسُ أَعْلاَهَا دَرَجَةً وَمِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ الْأَرْبَعَةُ وَمِننْ فَوْقِهَا يَكُوْنُ الْعَرْشُ فَإِذَا سَأَلْتُمُ اللّٰهَ فَاسْأَلُوْهُ الْفِرْدَوْسَ ] [ ترمذي، صفۃ الجنۃ، باب ما جاء فی صفۃ درجات الجنۃ : ۲۵۳۱، عن عبادۃ بن الصامت رضی اللہ عنہ ] ’’جنت میں سو درجے ہیں، ہر دو درجوں کے درمیان اتنا فاصلہ ہے جتنا آسمان اور زمین کے درمیان ہے۔ ان میں سب سے اعلیٰ درجہ فردوس ہے، اسی سے جنت کی چاروں نہریں جاری ہوتی ہیں اور اس کے اوپر رحمان کا عرش ہے تو جب تم اللہ تعالیٰ سے مانگو تو فردوس مانگا کرو۔‘‘ ایک حدیث میں آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَهْلَ الْجَنَّةِ يَتَرَاؤُنَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ كَمَا تَتَرَاؤُنَ الْكَوْكَبَ الدُّرِّيَّ الْغَابِرَ فِي الْأُفُقِ مِنَ الْمَشْرِقِ أَوِ الْمَغْرِبِ لِتَفَاضُلِ مَا بَيْنَهُمْ ، قَالُوْا : يَا رَسُوْلَ اللّٰهِ ! تِلْكَ مَنَازِلُ الْأَنْبِيَاءِ لَا يَبْلُغُهَا غَيْرُهُمْ؟ قَالَ بَلٰی وَالَّذِيْ نَفْسِيْ بِيَدِهِ ! رِجَالٌ آمَنُوْا بِاللّٰهِ وَصَدَّقُوا الْمُرْسَلِيْنَ ] [ بخاري، بدء الخلق، باب ما جاء في صفۃ الجنۃ و أنھا مخلوقۃ : ۳۲۵۶، عن أبي سعید الخدري رضی اللہ عنہ ]’’جنت والے اپنے سے اوپر بالاخانوں والوں کو اس طرح دیکھیں گے جس طرح تم اس چمک دار ستارے کو دیکھتے ہو جو آسمان کے مشرقی یا مغربی کنارے میں باقی رہ گیا ہو، ان کے ایک دوسرے سے درجات زیادہ ہونے کی وجہ سے۔‘‘ لوگوں نے کہا : ’’یا رسول اللہ! یہ انبیاء کے مقام ہوں گے کہ ان کے سوا کوئی ان تک نہیں پہنچ سکے گا؟‘‘ آپ نے فرمایا : ’’کیوں نہیں؟ مجھے اس کی قسم جس کے ہاتھ میں میری جان ہے! یہ وہ آدمی ہوں گے جو اللہ پرایمان لائے اور انھوں نے رسولوں کی تصدیق کی۔‘‘ جنت کی نہروں کی تفصیل کے لیے دیکھیے سورۂ محمد (۱۵)۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76,75) {فَاُولٰٓىِٕكَ لَهُمُ الدَّرَجٰتُ الْعُلٰى … : ’’ الْعُلٰى ‘‘ ’’عُلْيَا‘‘} کی جمع ہے، جو اسم تفضیل {’’ أَعْلٰي‘‘} کی مؤنث ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ، وَالْفِرْدَوْسُ أَعْلاَهَا دَرَجَةً وَمِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ الْأَرْبَعَةُ وَمِننْ فَوْقِهَا يَكُوْنُ الْعَرْشُ فَإِذَا سَأَلْتُمُ اللّٰهَ فَاسْأَلُوْهُ الْفِرْدَوْسَ ] [ ترمذي، صفۃ الجنۃ، باب ما جاء فی صفۃ درجات الجنۃ : ۲۵۳۱، عن عبادۃ بن الصامت رضی اللہ عنہ ] ’’جنت میں سو درجے ہیں، ہر دو درجوں کے درمیان اتنا فاصلہ ہے جتنا آسمان اور زمین کے درمیان ہے۔ ان میں سب سے اعلیٰ درجہ فردوس ہے، اسی سے جنت کی چاروں نہریں جاری ہوتی ہیں اور اس کے اوپر رحمان کا عرش ہے تو جب تم اللہ تعالیٰ سے مانگو تو فردوس مانگا کرو۔‘‘ ایک حدیث میں آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَهْلَ الْجَنَّةِ يَتَرَاؤُنَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ كَمَا تَتَرَاؤُنَ الْكَوْكَبَ الدُّرِّيَّ الْغَابِرَ فِي الْأُفُقِ مِنَ الْمَشْرِقِ أَوِ الْمَغْرِبِ لِتَفَاضُلِ مَا بَيْنَهُمْ ، قَالُوْا : يَا رَسُوْلَ اللّٰهِ ! تِلْكَ مَنَازِلُ الْأَنْبِيَاءِ لَا يَبْلُغُهَا غَيْرُهُمْ؟ قَالَ بَلٰی وَالَّذِيْ نَفْسِيْ بِيَدِهِ ! رِجَالٌ آمَنُوْا بِاللّٰهِ وَصَدَّقُوا الْمُرْسَلِيْنَ ] [ بخاري، بدء الخلق، باب ما جاء في صفۃ الجنۃ و أنھا مخلوقۃ : ۳۲۵۶، عن أبي سعید الخدري رضی اللہ عنہ ]’’جنت والے اپنے سے اوپر بالاخانوں والوں کو اس طرح دیکھیں گے جس طرح تم اس چمک دار ستارے کو دیکھتے ہو جو آسمان کے مشرقی یا مغربی کنارے میں باقی رہ گیا ہو، ان کے ایک دوسرے سے درجات زیادہ ہونے کی وجہ سے۔‘‘ لوگوں نے کہا : ’’یا رسول اللہ! یہ انبیاء کے مقام ہوں گے کہ ان کے سوا کوئی ان تک نہیں پہنچ سکے گا؟‘‘ آپ نے فرمایا : ’’کیوں نہیں؟ مجھے اس کی قسم جس کے ہاتھ میں میری جان ہے! یہ وہ آدمی ہوں گے جو اللہ پرایمان لائے اور انھوں نے رسولوں کی تصدیق کی۔‘‘ جنت کی نہروں کی تفصیل کے لیے دیکھیے سورۂ محمد (۱۵)۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77) ➊ { وَ لَقَدْ اَوْحَيْنَاۤ اِلٰى مُوْسٰۤى …:} فرعون کے جادوگروں کے مقابلے میں ناکام ہونے اور ان کے ایمان قبول کر لینے کے بعد ایک لمبی مدت گزری، جس میں بنی اسرائیل پر ظلم کے کئی پہاڑ ٹوٹتے رہے، ساتھ ہی فرعون اور اس کی قوم پر قحط، طوفان، ٹڈی دل، جوؤں، مینڈکوں اور خون کی صورت میں معجزے کے طور پر کئی عذاب آئے، جن میں سے ہر عذاب آنے پر وہ لوگ اپنے ایمان لانے کا اور بنی اسرائیل کو آزادی دینے کا وعدہ کرتے مگر عذاب ٹل جانے پر صاف مکر جاتے۔ آخر میں اللہ تعالیٰ نے موسیٰ علیہ السلام کو راتوں رات بنی اسرائیل کو ساتھ لے جانے کا حکم دیا۔ اس کا ذکر سورۂ اعراف (۱۳۰ تا ۱۳۵) میں تفصیل سے ہے۔ یہاں وہ ساری بات حذف کرکے فرعون کا انجام ذکر فرما دیا۔ اس لیے اس آیت کا عطف آیت (۵۶) «{وَ لَقَدْ اَرَيْنٰهُ اٰيٰتِنَا كُلَّهَا فَكَذَّبَ وَ اَبٰى }» پر ہے کہ فرعون کے تمام آیات (نشانیوں) کو جھٹلانے اور انکار کا انجام کیا ہوا؟ اس کا عطف موسیٰ علیہ السلام اور جادوگروں کے مقابلے کے واقعہ پر نہیں۔ (بقاعی) ¤ ➋ {اَنْ اَسْرِ بِعِبَادِيْ … :} یہ قصہ تفصیل کے ساتھ سورۂ شعراء (۵۲ تا ۶۶) اور یونس (۹۰ تا ۹۲) میں مذکور ہے۔ یہاں {’’ فَاجْعَلْ لَهُمْ طَرِيْقًا ‘‘} (پس ان کے لیے راستہ بنا) کے بجائے {’’ فَاضْرِبْ لَهُمْ طَرِيْقًا فِي الْبَحْرِ يَبَسًا ‘‘} (پس ان کے لیے سمندر میں ایک خشک راستہ مار) فرمایا، مقصود لمبی بات کو مختصر کرنا ہے، یعنی {’’ اِجْعَلْ لَهُمْ بِضَرْبِ الْبَحْرِ بِعَصَاكَ طَرِيْقًا ‘‘} (سمندر پر اپنی لاٹھی مارنے کے ساتھ ان کے لیے اس میں خشک راستہ بنا)۔ گویا {’’اِضْرِبْ‘‘} میں {’’اِجْعَلْ‘‘} کا معنی سمو دیا ہے، اسے تضمین کہتے ہیں۔ ¤ ➌ {لَا تَخٰفُ دَرَكًا وَّ لَا تَخْشٰى : ’’ لَا تَخْشٰى ‘‘} کا مفعول ذکر نہیں فرمایا، تاکہ وہ عام رہے۔ معنی یہ ہو گا کہ نہ تو پکڑے جانے سے خوف کھائے گا اور نہ کسی بھی دوسری چیز سے ڈرے گا، مثلاً غرق ہونے، راستہ بھول جانے، بھوک پیاس سے ہلاک ہونے یا کسی اور دشمن کے حملے سے، غرض کسی بھی خطرے کا تجھے ڈر نہیں ہو گا۔ بعض مفسرین نے اس کا مفعول{ ’’غَرْقًا‘‘ } محذوف مانا ہے، یعنی تو غرق ہونے سے نہیں ڈرے گا، مگر محذوف مفعول مقام کی مناسبت سے کوئی بھی ہو سکتا ہے، اس لیے اسے عام رکھنا بہتر ہے اور پھر اس میں غرق ہونا بھی آ جاتا ہے۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) { فَغَشِيَهُمْ مِّنَ الْيَمِّ مَا غَشِيَهُمْ :} یعنی ان کو سمندر سے ایسی عظیم چیز نے ڈھانپ لیا جو انسانی بیان میں نہیں آ سکتی اور اگر اللہ تعالیٰ اسے اس طرح بیان فرمائے جس طرح اسے بیان کرنے کا حق ہے تو انسان کی کوتاہ عقل میں وہ سما نہیں سکتی، اس لیے اس کی تفصیل مت پوچھو۔ مراد ان سب کا سمندر میں غرق ہونا، پانی کی راہ سے آگ کا ایندھن بننا اور مرتے وقت اور بعد میں فرشتوں کی مار بے حساب و بے شمار ہے جو بیان سے باہر ہے۔ دیکھیے سورۂ مومن (۴۵، ۴۶) اس کی مزید مثالیں یہ ہیں : «{ اِذْ يَغْشَى السِّدْرَةَ يَغْشٰى }» [ النجم : ۱۶ ] اور : «{ وَ الْمُؤْتَفِكَةَ اَهْوٰى (53) فَغَشّٰىهَا مَا غَشّٰى }» [ النجم : ۵۳، ۵۴ ] اور : «{فَاَوْحٰۤى اِلٰى عَبْدِهٖ مَاۤ اَوْحٰى }» [ النجم : ۱۰ ]"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79) {وَ اَضَلَّ فِرْعَوْنُ قَوْمَهٗ وَ مَا هَدٰى :} یہاں ایک سوال ہے کہ {’’ اَضَلَّ ‘‘} (گمراہ کیا) اور {’’ مَا هَدٰى ‘‘} (سیدھے راستے پر نہ ڈالا) دونوں کا مطلب ایک ہی ہے تو تکرار کا کیا فائدہ؟ اس سوال کے کئی جواب ہیں، ایک تویہ کہ یہ تاکید کے لیے ہے، جیسا کہ فرمایا : «{ اَمْوَاتٌ غَيْرُ اَحْيَآءٍ }» [ النحل : ۲۱ ] ’’مردے ہیں، زندہ نہیں ہیں۔‘‘ دوسرا یہ کہ ’’فرعون نے اپنی قوم کو گمراہ کیا‘‘ میں امکان تھا کہ اگر بعض چیزوں میں اس نے اپنی قوم کو غلط راستے پر ڈالا تو بعض میں درست سمت پر بھی چلایا ہو، چلو دنیا ہی کا کچھ فائدہ پہنچایا ہو۔ فرمایا، نہیں! کسی چیز میں بھی درست راستے پر نہیں ڈالا، بلکہ انھیں اتنا بے وقوف اور بے وقعت بنا دیا کہ وہ اس کی سراسر حماقتوں میں بھی اس کے پیچھے ہی چلتے رہے۔ (زخرف : ۴۵) (بقاعی) جیسا کہ آج کل دہریہ ملک چین میں حکومت کے حکم پر ایک یا دو بچوں سے زیادہ بچے پیدا ہونے پر عموماً انھیں ہسپتال ہی میں زہر کا ٹیکہ لگا کر مار دیا جاتا ہے اور اگر کوئی اپنا بچہ مرنے سے بچا لے تو اس کا پیدائش کے رجسٹر میں اندراج ہو سکتا ہے نہ اسے رجسٹرڈ شہری کی مراعات حاصل ہو سکتی ہیں۔ کوئی اولاد والا ہی اس دردناک کیفیت کا ادراک کر سکتا ہے۔ اس کے باوجود پوری قوم خوشی یا بے بسی سے ان احکام کے پیچھے چل رہی ہے، اس سے بڑھ کر {’’ مَا هَدٰى ‘‘} کیا ہو گا؟ تیسرا جواب یہ کہ دراصل یہ فرعون کے اس دعویٰ پر طنز ہے جو اس نے کیا تھا : «{ مَاۤ اُرِيْكُمْ اِلَّا مَاۤ اَرٰى وَ مَاۤ اَهْدِيْكُمْ اِلَّا سَبِيْلَ الرَّشَادِ }» [ المؤمن : ۲۹ ] ’’میں تو تمھیں وہی رائے دے رہا ہوں جو خود رائے رکھتا ہوں اور میں تمھیں بھلائی کا راستہ ہی بتا رہا ہوں۔‘‘ اور زیرِ تفسیر سورت کی آیت (۶۳) میں بھی اس کے چیلوں نے اپنے طریقے کو سب سے افضل قرار دیا۔ اللہ تعالیٰ نے اس کے رد میں فرمایا کہ ’’فرعون نے اپنی قوم کو گمراہ کیا اور انھیں سیدھے راستے پر نہ ڈالا۔‘‘ (زمخشری)"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) ➊ { يٰبَنِيْۤ اِسْرَآءِيْلَ قَدْ اَنْجَيْنٰكُمْ … :} یہ تین آیتیں موسیٰ علیہ السلام کے قصے کے درمیان جملہ معترضہ کے طور پر آئی ہیں، جیسا کہ اس سے پہلے دو آیات (۵۵، ۵۶) گزر چکی ہیں۔ اس آیت میں موسیٰ علیہ السلام کے زمانے کے بنی اسرائیل مخاطب ہیں اور یہ بھی ممکن ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے کے یہود کو اللہ تعالیٰ کی نعمتیں یاد کروائی جا رہی ہوں، جیسا کہ «{ يٰبَنِيْۤ اِسْرَآءِيْلَ اذْكُرُوْا نِعْمَتِيَ الَّتِيْۤ اَنْعَمْتُ عَلَيْكُمْ }» [ البقرۃ : ۴۰، ۴۷، ۱۲۲ ] میں ہے۔ اس آیت میں اللہ تعالیٰ نے بنی اسرائیل کو تین نعمتیں یاد دلائیں۔ سب سے پہلے غلامی سے نجات کی عظیم نعمت، اس کے بعد طور پر بلا کر دینی احکام پر مشتمل کتاب عطا کرنے کی نعمت اور آخر میں بلامشقت من و سلویٰ کا پاکیزہ اور لذیذ ترین رزق عطا کرنے کی نعمت۔ من و سلویٰ کی تفسیر کے لیے دیکھیں سورۂ بقرہ (۵۷)۔ ¤ ➋ { وَ وٰعَدْنٰكُمْ جَانِبَ الطُّوْرِ الْاَيْمَنَ … :} اس واقعہ کا ذکر سورۂ بقرہ (۵۲) میں بھی ہے اور اس کی تفصیل سورۂ اعراف (۱۴۲ تا ۱۴۷) میں ہے۔ یہاں سوال پیدا ہوتا ہے کہ پہاڑ کی دائیں جانب سے مراد کیا ہے؟ کیونکہ پہاڑ کی ہر جانب ہی کھڑے ہونے والے شخص کے لحاظ سے دائیں بھی ہو سکتی ہے اور بائیں بھی۔ جواب اس کا یہ ہے کہ زمانۂ جاہلیت اور اسلام میں جغرافیہ اور محل وقوع میں جہتوں کے تعین کے لیے مشرق کو اصل قرار دیا گیا ہے، چنانچہ یمن اور شام کے نام اسی مناسبت سے رکھے گئے ہیں کہ کعبہ سے مشرق کی طرف رخ کریں تو دائیں طرف یمن ہے، جس کا معنی دایاں ہے اور بائیں طرف شام۔ امرؤ القیس نے بھی ایک بادل کے برسنے کا محل وقوع بیان کرتے ہوئے کہا ہے: ¤ {عَلٰي قَطَنٍ بِالشَّيْمِ أَيْمَنُ صَوْبِهِ ¤ وَ أَيْسَرُهُ عَلَي السِّتَارِ فَيَذْبُلِ } ¤ ’’غور سے دیکھنے پر اس کی بارش کا دایاں حصہ قطن مقام پر تھا اور اس کا بایاں حصہ ستار پھر یذبل نامی مقام پر تھا۔‘‘ ¤ اس صورت میں اگر {’’ الْاَيْمَنَ ‘‘} سے مراد دائیں جانب لیں تو موسیٰ علیہ السلام کے طور کی مغربی جانب اس کی طرف رخ کرکے کھڑے ہونے پر پہاڑ کی دائیں طرف (جنوب) مراد ہو گی، جیسا کہ مدین سے مصر کو آتے ہوئے پہلی وحی کے وقت وہ پہاڑ کی مغربی جانب میں تھے۔ اللہ تعالیٰ نے ہمارے نبی صلی اللہ علیہ وسلم کو مخاطب کرتے ہوئے فرمایا : «{ وَ مَا كُنْتَ بِجَانِبِ الْغَرْبِيِّ اِذْ قَضَيْنَاۤ اِلٰى مُوْسَى الْاَمْرَ }» [ القصص : ۴۴ ] ’’اور اس وقت تو مغربی جانب میں نہیں تھا جب ہم نے موسیٰ کی طرف حکم کی وحی کی۔‘‘ اور اگر {’’ الْاَيْمَنَ ‘‘} کو {’’يَمِيْنٌ‘‘} (دائیں) کے بجائے {’’يُمْنٌ‘‘} (برکت) سے اسم تفضیل مانیں تو دائیں بائیں کی تعیین کی ضرورت ہی نہیں بلکہ طور کی جانب ایمن (بابرکت جانب) اور اس سورت کی آیت (۱۲) : «{ اِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى }» میں مذکور وادی مقدس دونوں سے مراد وادی طویٰ ہو گی۔ (ابن عاشور)"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) ➊ { وَ لَا تَطْغَوْا فِيْهِ :} طغیانی کا معنی حد سے بڑھنا ہے۔ رزق میں حد سے تجاوز یہ ہے کہ دوسرے کا حق کھا جائے، ناشکری یا فضول خرچی کرنے لگے، نعمت پر اترانے لگے، رزق میں واجب حقوق ادا نہ کرے، اسے اللہ کی نافرمانی میں خرچ کرنے لگے، یا جس جگہ یا جس وقت اسے جوڑ کر رکھنے سے منع کیا گیا ہے وہاں جوڑنے کے پیچھے پڑ جائے۔ غرض حکم یہ دیا کہ اللہ تعالیٰ کی عطا کردہ نعمتوں کو اللہ کی حدود سے تجاوز اور نافرمانی کا ذریعہ مت بناؤ۔ ¤ ➋ {فَقَدْ هَوٰى: ’’هَوٰي يَهْوِيْ‘‘} (ض) اونچی جگہ سے گرنا۔ چونکہ ایسا گرنا جس کے بعد اٹھنا نہ ہو، ہلاک ہونے کی صورت ہی میں ہوتا ہے، اس لیے یہاں {’’ هَوٰى ‘‘} کا معنی ’’ہلاک ہو گیا‘‘ کرتے ہیں۔"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) { وَ اِنِّيْ لَغَفَّارٌ لِّمَنْ تَابَ … :} نافرمانی اور طغیانی کی وعید کے بعد توبہ کی ترغیب دی۔ معلوم ہوا مغفرت کے لیے چار چیزیں شرط ہیں، ایک توبہ یعنی کفر و شرک اور نافرمانی سے باز آ جانا، دوسری ایمان یعنی اللہ تعالیٰ، رسول اللہ صلی اللہ علیہ وسلم ، یوم آخرت اور دوسری ایمانیات پر صدق دل سے اعتقاد رکھنا، تیسری عمل صالح یعنی اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کی ہدایات کے مطابق نیک عمل کرنا اور چوتھی آخر دم تک سیدھے راستے پر قائم رہنا۔ {’’ اهْتَدٰى ‘‘} سے یہی مراد ہے اور یہی چیز سب سے مشکل ہے۔ اس لیے اللہ تعالیٰ نے اسے لفظ {’’ ثُمَّ ‘‘} (پھر) کے بعد ذکر فرمایا، جیسا کہ «{ ثُمَّ كَانَ مِنَ الَّذِيْنَ اٰمَنُوْا وَ تَوَاصَوْا بِالصَّبْرِ وَ تَوَاصَوْا بِالْمَرْحَمَةِ }» [ البلد : ۱۷ ] میں ہے۔ گویا یہ آیت سورۂ حم السجدہ کی آیات (۳۰ تا ۳۲) کی ہم معنی ہے۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) { وَ مَاۤ اَعْجَلَكَ عَنْ قَوْمِكَ يٰمُوْسٰى :} اللہ تعالیٰ نے بنی اسرائیل اور موسیٰ علیہ السلام سے طور کی دائیں جانب میں آنا اور موسیٰ علیہ السلام کو کتاب عطا کرنا طے فرمایا۔ موسیٰ علیہ السلام نے خود قوم کے ساتھ آنے کے بجائے ہارون علیہ السلام کو اپنا جانشین مقرر کرکے انھیں طور کی طرف سفر جاری رکھنے کا حکم دیا اور خود اپنے رب سے کلام اور ملاقات کے شوق میں نہایت تیزی کے ساتھ وعدے کے مقام پر پہنچ گئے۔ اللہ تعالیٰ نے مناجات اور تورات عطا کرنے کے بعد پوچھا کہ موسیٰ! تجھے کیا چیز تیری قوم سے جلدی لے آئی؟"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84) { قَالَ هُمْ اُولَآءِ عَلٰۤى اَثَرِيْ :} یہاں ایک سوال ہے کہ موسیٰ علیہ السلام نے جواب میں جلدی کی وجہ بتانے کے بجائے کہ پروردگارا! میں تجھے راضی کرنے کے لیے جلدی آ گیا، یہ کیوں ضروری سمجھا کہ پہلے یہ عرض کریں کہ قوم کے لوگ میرے پیچھے میرے نشان قدم پر آ رہے ہیں، یعنی نشان مٹنے سے بھی پہلے وہ اس پر چلے آ رہے ہیں، یعنی میں کوئی زیادہ جلدی نہیں آیا۔ اس کا جواب یہ ہے کہ اللہ تعالیٰ اس بات سے بے خبر نہ تھا کہ وہ کیوں جلدی آ گئے، بلکہ اللہ تعالیٰ کا عتاب قوم کے ساتھ نہ آنے پر تھا اور یہ سوال اپنے کلیم کی تربیت کے لیے تھا کہ تمھارا پہلے آنا مناسب نہ تھا، بلکہ غلامی سے تازہ تازہ نکلی ہوئی قوم کے ساتھ رہنا ضروری تھا، تاکہ کتاب ملنے سے پہلے ہر قدم پر ان کی رہنمائی کرتے اور ان کی غلطیوں پر سرزنش کرتے۔ ویسے بھی کسی قوم کے رئیس کا حق یہ ہے کہ وہ ان کے پیچھے رہ کر ان کے ہر فرد کا خیال رکھے، جیسا کہ اللہ تعالیٰ نے لوط علیہ السلام کو اہل و عیال سمیت رات کو نکلنے کا حکم دیتے ہوئے یہ ادب سکھایا : «{ وَ اتَّبِعْ اَدْبَارَهُمْ }» [ الحجر : ۶۵ ] ’’اور خود ان کے پیچھے پیچھے چل۔‘‘اور جیسا کہ جابر بن عبد اللہ رضی اللہ عنھما نے رسول کریم صلی اللہ علیہ وسلم کے متعلق ذکر فرمایا : [ كَانَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يَتَخَلَّفُ فِي الْمَسِيْرِ فَيُزْجِي الضَّعِيْفَ وَيُرْدِفُ وَيَدْعُوْ لَهُمْ ] [ أبوداوٗد، الجہاد، باب في لزوم الساقۃ : ۲۶۳۹۔ سلسلۃ الأحادیث الصحیحۃ : ۲۱۲۰ ] ’’رسول اللہ صلی اللہ علیہ وسلم سفر میں پیچھے رہتے، کمزور (کی سواری) کو ہانکتے اور (پیدل کو) پیچھے بٹھا لیتے اور ان کے لیے دعا کرتے۔‘‘ موسیٰ علیہ السلام کا وُفور شوق میں جلدی آنا اگرچہ بری بات نہ تھی مگر بادشاہوں کے حضور پیش ہونے کے کچھ آداب ہوتے ہیں اور شاہوں کے شاہ کا ادب تو سب سے بڑھ کر ہے۔ اس کی ایک مثال ابوبکرہ رضی اللہ عنہ کی جلدی ہے کہ وہ مسجد میں پہنچے تو نبی صلی اللہ علیہ وسلم رکوع میں تھے، انھوں نے صف میں ملنے سے پہلے ہی رکوع کر لیا، نبی صلی اللہ علیہ وسلم سے اس بات کا ذکر ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ زَادَكَ اللّٰهُ حِرْصًا وَلَا تَعُدْ] [ بخاري، الأذان، باب إذا رکع دون الصف : ۷۸۳ ] ’’اللہ تعالیٰ تمھاری حرص زیادہ کرے اور دوبارہ ایسا نہ کرنا۔‘‘ [ قاسمی، بقاعی، ابن عاشور ]"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 85) ➊ { قَالَ فَاِنَّا قَدْ فَتَنَّا قَوْمَكَ …:} یہ فاء تعلیل کے لیے ہے، یعنی تمھارا قوم کو چھوڑ کر چلے آنا اور مفسدوں کے لیے موقع فراہم کر دینا اس کا باعث بنا کہ تمھارے بعد ہم نے تمھاری قوم کو آزمائش میں ڈال دیا اور سامری نے انھیں گمراہ کر دیا۔ یہاں ایک بات یاد رہنی چاہیے کہ انھیں بچھڑا بنا کر سامری نے گمراہ کیا تھا، اللہ تعالیٰ نے اس کی صراحت بھی فرما دی کہ انھیں سامری نے گمراہ کر دیا، مگر تمام اسباب کا خالق چونکہ اللہ تعالیٰ ہے اور تمام دل اس کے ہاتھ میں ہیں اس لیے آزمائش میں ڈالنے کی نسبت اللہ تعالیٰ نے اپنی طرف فرمائی۔ ¤ ➋ {مِنْۢ بَعْدِكَ:} موسیٰ علیہ السلام اپنی قوم کو تیس دنوں کے اعتکاف کا بتا کر گئے تھے، جسے اللہ تعالیٰ نے چالیس دنوں کے ساتھ مکمل فرمایا تو قوم اس سے بے خبر تھی، انھیں معلوم نہ تھا کہ موسیٰ علیہ السلام کب آئیں گے؟ اس مدت سے فائدہ اٹھا کر سامری نے کیا جو کچھ کیا۔ اس لیے اللہ تعالیٰ نے{ ’’ بَعْدِكَ ‘‘ } سے پہلے {’’ مِنْ‘‘} کا لفظ زیادہ فرمایا، جو ’’بعض‘‘ کے معنی میں ہے، یعنی تمھارے بعد کے عرصے میں سے کچھ عرصے میں سامری نے انھیں گمراہ کر دیا۔ (بقاعی)"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86) ➊ { فَرَجَعَ مُوْسٰۤى اِلٰى قَوْمِهٖ … : ’’ غَضْبَانَ ‘‘} مبالغے کے وزن پر ہے، اس لیے ’’غصے سے بھرا ہوا‘‘ ترجمہ کیا ہے۔ {’’ اَسِفًا ‘‘ ’’أَسِفَ يَأْسَفُ‘‘} (ع) سے صفت کا صیغہ ہے، اس کا معنی سخت غم و افسوس کرنے والا بھی ہے اور غصے والا بھی۔ (قاموس) یہاں {’’ غَضْبَانَ ‘‘ } کے بعد افسوس زیادہ مناسب ہے۔ حرفِ ’’فاء‘‘  سے معلوم ہوا کہ اللہ تعالیٰ نے موسیٰ علیہ السلام سے مکالمہ اور کتاب دینے کے آخر میں انھیں قوم کے گمراہ ہونے کی اطلاع دی۔ {’’ فَرَجَعَ مُوْسٰۤى اِلٰى قَوْمِهٖ ‘‘} تو یہ خبر سنتے ہی موسیٰ علیہ السلام اپنی قوم کی طرف واپس روانہ ہو گئے۔ ¤ ➋ {قَالَ يٰقَوْمِ اَلَمْ يَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا :} اس وعدے سے مراد توبہ، ایمان اور عمل صالح کے بعد اس پر استقامت اختیار کرنے والے کے لیے مغفرت کا وعدہ، طور کی جانبِ ایمن پر موسیٰ علیہ السلام سے کلام اور بنی اسرائیل کی ہدایت کے لیے تورات عطا کرنے کا وعدہ اور من و سلویٰ نازل کرنے کا وعدہ ہے۔ (طبری) ¤ ➌ { اَفَطَالَ عَلَيْكُمُ الْعَهْدُ …: ’’ الْعَهْدُ ‘‘} کا معنی ہے وصیت، کسی آدمی سے کوئی بات طے کر لینا، پختہ وعدہ، قسم، حرمت کا خیال رکھنا، امان، ذمہ، ملاقات، پہچان، زمانہ، وفا، اللہ تعالیٰ کی توحید وغیرہ۔ (قاموس) یہاں ملاقات بھی معنی ہو سکتا ہے اور مدت بھی کہ کیا تمھیں میری ملاقات کو بہت لمبی مدت ہو چکی تھی کہ تم نے مجھ سے جو وعدہ کیا تھا اس کی خلاف ورزی کی؟ تیس دنوں سے دس دن ہی تو زیادہ گزرے تھے، یہ کون سی لمبی مدت تھی کہ تم نے مجھ سے کیے ہوئے سب وعدے توڑ ڈالے۔ وعدہ خلافی سے مراد ان کا طور کے دامن تک جانے کے لیے موسیٰ علیہ السلام کے پیچھے چلتے رہنے کے بجائے راستے میں ٹھہر جانا، بچھڑے کی پرستش اور مجاوری پر اڑ جانا اور ہارون علیہ السلام کے انھیں چلتے رہنے کی تاکید اور بچھڑے کی عبادت ترک کرنے کی نصیحت پر یہ کہنا کہ {’’ لَنْ نَّبْرَحَ عَلَيْهِ عٰكِفِيْنَ ‘‘} یعنی ہم اسی پر مجاور بن کر بیٹھے رہیں گے یہاں تک کہ موسیٰ ہمارے پاس آئیں۔ یہ تمام باتیں وعدے کی خلاف ورزی تھیں۔ (طبری)"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) ➊ { قَالُوْا مَاۤ اَخْلَفْنَا مَوْعِدَكَ بِمَلْكِنَا :} انھوں نے وعدہ خلافی کا نہایت ہی بودا عذر پیش کیا کہ اس وعدہ خلافی میں ہمارا کوئی اختیار ہی نہ تھا۔ سامری نے ہمیں پھسلایا ہی اس طرح کہ ہم میں نیک و بد کی پہچان ہی نہ رہ گئی۔ کوئی پوچھے کہ سامری نے تم پر کوئی فوج کشی کی تھی یا تلوار تان رکھی تھی کہ تمھارا اختیار ختم ہو گیا تھا؟ قیامت کے دن ہر مجرم اپنے آپ کو بے قصور اور بے اختیار ٹھہرائے گا اور اپنے تمام جرائم کا ذمہ دار شیطان کو ٹھہرائے گا مگر وہ صاف کہہ دے گا کہ میں نے تم پر کوئی فوج کشی نہیں کی تھی، صرف دعوت دی تھی، تم نہ مانتے تو میں تمھارا کیا بگاڑ سکتا تھا۔ دیکھیے سورۂ ابراہیم (۲۲)۔ ¤ ➋ { وَ لٰكِنَّا حُمِّلْنَاۤ اَوْزَارًا …:} اس آیت کی تفسیر اکثر مفسرین نے یہ کی ہے کہ بنی اسرائیل نے مصر سے نکلنے سے پہلے فرعون کی قوم کے لوگوں سے ان کے زیورات ادھار مانگ لیے تھے، بعض نے تو یہ بھی لکھا ہے کہ یہ کام انھوں نے موسیٰ علیہ السلام کے کہنے پر کیا تھا۔ اب وہ ان کے لیے بوجھ بن گئے تھے، کیونکہ وہ مال غنیمت کے حکم میں تھے اور پہلی امتوں کے لیے غنیمت حلال نہ تھی۔ چنانچہ ہارون علیہ السلام یا سامری کے کہنے پر کہ ان زیورات کو اپنے پاس رکھنا گناہ ہے، سب زیور ایک گڑھے میں پھینک کر انھیں آگ لگا دی گئی اور سامری نے اس سے فائدہ اٹھا کر اس سونے یا چاندی سے بچھڑا بنا دیا۔ بعض نے یہ لکھا ہے کہ فرعون کی قوم جب غرق ہوئی اور ان کی لاشیں کنارے پر آئیں تو بنی اسرائیل نے ان کے زیور اتار لیے، اس زمانے میں عورتوں کی طرح مرد بھی سونے چاندی کے کنگن اور زیور وغیرہ پہنتے تھے۔ {’’ زِيْنَةِ الْقَوْمِ ‘‘} سے قوم فرعون کے زیور مراد ہیں۔ بہت سے لوگوں کو یہ اصرار ہے کہ یہ سلف کی تفسیر ہے اور اس سے انحراف سلف سے انحراف ہے۔ مگر قرآن و حدیث سے یا کسی صحابی سے صحیح سند کے ساتھ اس کی طرف معمولی اشارہ بھی نہیں ملتا کہ ہجرت کے وقت پوری قوم کو، حتیٰ کہ موسیٰ علیہ السلام کو دھوکے سے قوم فرعون کے زیورات حاصل کرنے کی فکر پڑی ہوئی تھی، نہ آیات ہی میں کوئی اشارہ ہے کہ {’’ زِيْنَةِ الْقَوْمِ ‘‘} میں {’’ الْقَوْمِ ‘‘} سے مراد قوم فرعون ہے۔ دراصل یہ بات تورات اور پہلے صحیفوں سے لی گئی ہے، جن میں یہود نے اتنی تحریف کر دی ہے کہ انبیاء پر تہمتیں لگانے سے بھی دریغ نہیں کیا۔ داؤد اور لوط علیھما السلام پر ان کی تہمتیں معروف ہیں۔ اس واقعہ میں بھی انھوں نے ہارون علیہ السلام پر تہمت لگائی ہے کہ بچھڑا بنا کر لوگوں کو اس کی عبادت پر لگانے والے وہ تھے۔ [ نَعُوْذُ بِاللّٰہِ مِنْ ھَفَوَاتِھِمْ ] اس کے برعکس قرآن مجید میں دوسرے مقام پر تصریح ہے کہ وہ تمام زیور بنی اسرائیل کے اپنے تھے، چنانچہ اللہ تعالیٰ فرماتے ہیں : «{ وَ اتَّخَذَ قَوْمُ مُوْسٰى مِنْۢ بَعْدِهٖ مِنْ حُلِيِّهِمْ عِجْلًلًا جَسَدًا لَّهٗ خُوَارٌ }» [الأعراف : ۱۴۸ ] ’’اور موسیٰ کی قوم نے اس کے بعد اپنے زیوروں سے ایک بچھڑا بنا لیا جو ایک جسم تھا، جس کی گائے جیسی آواز تھی۔‘‘ {’’ مِنْ حُلِيِّهِمْ ‘‘ } (اپنے زیوروں سے) کی تصریح کے باوجود انھیں قومِ فرعون کے زیور قرار دینا عجیب بات ہے۔ ¤ اصل حقیقت یہ معلوم ہوتی ہے کہ اس زمانے میں نوٹ وغیرہ تو تھے نہیں، نقدی سونے یا چاندی ہی کی صورت میں ہوتی تھی، جسے زیورات کی صورت میں لوگ پہن لیتے یا گھروں میں محفوظ رکھتے، ان کا کافی بوجھ بن جاتاتھا، خصوصاً جب ان کے ساتھ تانبے وغیرہ کی آمیزش اور پہننے کے لیے چمڑے، دھاگے یا لوہے کی زنجیریں وغیرہ بھی ساتھ ہوتیں۔ اس لیے اس سفر میں ذمہ داریاں تقسیم کرتے وقت ہر ایک کے اپنے اپنے بوجھ اٹھانے کے بجائے کچھ لوگوں کے ذمے اسے اٹھانے کی ذمہ داری لگائی گئی۔ ظاہر ہے کہ اتنی اہم ذمہ داری قوم کے سربر آور دہ لوگوں ہی کی ہو سکتی تھی۔ موسیٰ علیہ السلام بھی انھی لوگوں سے مخاطب تھے، کیونکہ وہ ایک وقت میں ساری قوم کے ہزاروں، یا بقول بعض لاکھوں لوگوں سے تو بات نہیں کر سکتے تھے۔ انھوں نے یہ وجہ بتائی کہ ہم پر لوگوں کے زیوروں کا بوجھ تھا، ہم نے اسے جس قدر ہو سکا ہلکا کرنے کے لیے آگ میں پھینکا کہ زائد چیزیں جل جائیں اور خالص سونے اور چاندی کی اینٹیں بنا لی جائیں اور منزل پر پہنچ کر ہر ایک کو اس کے نام لکھے ہوئے کے مطابق اس کے حصے میں آنے والا خالص چاندی یا سونا دے دیا جائے۔ اس موقع سے فائدہ اٹھا کر سامری نے اس سے بچھڑے کا مجسمہ بنا دیا۔ ¤ ➌ اللہ تعالیٰ نے سونے اور چاندی میں یہ وصف رکھا ہے کہ یہ بطور قیمت شروع سے مقرر چلے آ رہے ہیں۔ دینار و درہم بھی ان کے بنتے تھے اور یہی فطری طریقہ تھا جس سے ہر شخص کا مال خود اس کے پاس ہوتا تھا۔ چالاک یہودیوں نے بینک بنا کر لوگوں کا سونا چاندی اپنے پاس جمع کر لیا اور انھیں رسیدیں جاری کر دیں کہ جب چاہو یہ دکھا کر اپنا سونا چاندی لے لو۔ لوگوں نے صرف اتنی سہولت کی خاطر کہ بوجھ نہ اٹھانا پڑے، ان رسیدوں سے لین دین شروع کر دیا، جس نے آگے نوٹوں کی صورت اختیار کر لی۔ اب صرف بوجھ سے بچنے کی خاطر سارا کاروبار یا تو نوٹ پر چلتا ہے یا بینک کے چیکوں پر۔ لوگوں کے پاس کاغذ کے ایک ٹکڑے کے سوا کچھ بھی نہیں اور اس کاغذ کی حیثیت یہ ہے کہ حکومتیں جب چاہتی ہیں اس کی قیمت کبھی آدھی کم کر دیتی ہیں، کبھی چوتھا حصہ۔ جو شخص ایک کروڑ روپے کے سونے کا مالک تھا، صرف ایک اعلان کے بعد پچاس لاکھ کے وعدے والے کاغذ کے سوا اس کے پاس کچھ نہیں رہتا اور اگر نئے نوٹ جاری ہو جائیں اور یہ بر وقت نہ بدلوا سکے تو بالکل ہی خالی ہاتھ رہ جاتا ہے۔ بینک دیوالیہ ہو جائے تو اس کا چیک کسی کام کا نہیں رہتا اور ساری رقم ہی برباد ہو جاتی ہے۔ ضروری بوجھ سے جان چھڑانے کا نتیجہ یہی ہوتا ہے۔اگر اللہ نے چاہا تو اس کے مخلص بندے یہود کے شکنجے کو توڑ کر سود اور بینکوں کو ختم کرکے سونے یا چاندی کے سکے جاری کریں گے، تاکہ کوئی کسی کا حق نہ مار سکے۔ یہاں مقصود صرف یہ بتانا ہے کہ بوجھ سے جان چھڑانے میں بنی اسرائیل کو کتنا نقصان ہوا اور اب مسلم اور غیر مسلم صرف بوجھ اٹھائے پھرنے سے بچنے کی خاطر کتنے بڑے خسارے میں پڑے ہوئے ہیں کہ ان کے ہاتھ میں درحقیقت کچھ بھی نہیں، سب یہودی سود خوروں یا ان کے گماشتوں کے پاس ہے۔ ہر مسلمان کو کوشش کرنی چاہیے کہ اپنی مالیت سونے چاندی کی صورت میں محفوظ رکھے، صرف اتنا بیچ لے جتنے استعمال کی ضرورت ہے۔ سونے کی قیمت ہمیشہ ایک رہی ہے اور رہے گی۔ دیکھیے صحیح حدیث میں رسول اللہ صلی اللہ علیہ وسلم سے ایک دینار میں بکری خریدنا منقول ہے، ہجرت کو چودہ سو تیس سال گزرنے کے باوجود آج بھی بکری کی قیمت یہی ہے۔"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) ➊ {فَاَخْرَجَ لَهُمْ عِجْلًا … :} مصری لوگ ہندوؤں کی طرح گائے کی پرستش کرتے تھے اور اس کی تقدیس کے قائل تھے۔ بنی اسرائیل میں بھی مسلمان ہونے کے باوجود قبطی مشرکوں کی غلامی اور ان سے میل جول کی وجہ سے یہ عقیدہ سرایت کر گیا تھا، جس کا وقتاً فوقتاً اظہار ہوتا رہتا تھا، جیسا کہ اس وقت ہوا جب موسیٰ علیہ السلام نے انھیں کوئی گائے ذبح کرنے کا حکم دیا۔ دیکھیے سورۂ بقرہ (۶۷) اب موسیٰ علیہ السلام کی عدم موجودگی میں سامری نے بنی اسرائیل کے زیوروں سے گائے کا بچھڑا بنایا جو بے جان تھا، مگر ایسی کاری گری سے بنایا گیا تھا کہ اس میں رکھے گئے سوراخوں کی وجہ سے خود بخود گائے کی سی آواز نکلتی تھی۔ وہ لوگ جنھوں نے سمندر سے پار ہوتے ہی چند بت پرستوں کے پاس سے گزرتے ہوئے موسیٰ علیہ السلام سے ان کے معبودوں جیسا معبود بنانے کا مطالبہ داغ دیا تھا، انھی جاہلوں نے فوراً اسے اپنا معبود تسلیم کر لیا اور کہنے لگے، تمھارا اور موسیٰ کا اصل معبود تو یہ ہے، موسیٰ بھول میں پڑ گئے جو طور پر کسی معبود سے کلام کے لیے گئے ہیں۔ ہمارے بعض صوفی حضرات بھی تصور شیخ کے شرک میں اس حد تک بڑھ گئے کہ جو محبت اپنے رب سے کرنی تھی اور جس طرح ہر وقت اسی کو اپنے سامنے رکھنا تھا، وہ محبت اور یاد شیخ کی نذر کر دی اور یہاں تک کہہ دیا : ¤ اے قوم بحج رفتہ کجائید کجائید معشوق ¤ درینجا ست کجائید کجائید ¤ ’’اے حج کو گئے ہوئے لوگو! تم کہاں ہو، تم کہاں ہو؟ معشوق تو یہاں ہے، تم کہاں ہو، تم کہاں ہو؟‘‘ ¤ ➋ { جَسَدًا لَّهٗ خُوَارٌ …:} بعض مفسرین نے یہ تک لکھ دیا ہے کہ وہ گوشت پوست کا بچھڑا بن گیا، مگر اس کی کوئی دلیل نہیں، بلکہ وہ محض دھات کا بنا ہوا ایک بے جان مجسمہ تھا۔ {’’ خُوَارٌ ‘‘} گائے کی آواز۔"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 89) { اَفَلَا يَرَوْنَ اَلَّا يَرْجِعُ اِلَيْهِمْ قَوْلًا… :} یہ وہی دلیل ہے جو ابراہیم علیہ السلام نے اپنے والد اور قوم کے سامنے پیش کی تھی : «{ يٰۤاَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَ لَا يُبْصِرُ وَ لَا يُغْنِيْ عَنْكَ شَيْـًٔا }» [ مریم : ۴۲ ] ’’اے میرے باپ! تو اس چیز کی عبادت کیوں کرتا ہے جو نہ سنتی ہے اور نہ دیکھتی ہے اور نہ تیرے کسی کام آتی ہے۔‘‘ موسیٰ علیہ السلام کے پیش کردہ اکثر دلائل وہی ہیں جو ان کے جد امجد ابراہیم علیہ السلام نے پیش کیے تھے، دیکھیے سورۂ شعراء۔ بنی اسرائیل کی عجائب پرستی دیکھیے کہ دھات کے بنے ہوئے بچھڑے کے بے جان مجسمے کو صرف آواز کی وجہ سے معبود، حاجت روا اور مشکل کشا مان بیٹھے۔ مجسمہ بھی اس جانور کا جسے تمام جانوروں سے سادہ لوح سمجھا جاتا ہے اور جو خود انسان کا خدمت گار اور اس کی خوراک ہے۔ یہ نہ سوچا کہ اس مجسمے سے تو وہ خود ہزار گنا بااختیار ہیں کہ بول سکتے ہیں، اپنی مرضی سے چل پھر سکتے ہیں اور بقدر استطاعت کچھ نہ کچھ فائدہ یا نقصان پہنچا سکتے ہیں، جب کہ بت بچھڑے کا ہو یا انسان کا، بات کرنے، چلنے پھرنے، سننے دیکھنے، ہر چیز سے عاری ہے۔ سورۂ اعراف کی آیات (۱۹۴، ۱۹۵) میں یہ بات نہایت تفصیل سے بیان ہوئی ہے۔"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت 90) ➊ { وَ لَقَدْ قَالَ لَهُمْ هٰرُوْنُ …:} موسیٰ علیہ السلام کے آنے سے پہلے ہارون علیہ السلام نے نہایت اچھے طریقے سے نصیحت کی تھی۔ اللہ تعالیٰ نے ہارون علیہ السلام کے خطاب کا ذکر {’’ وَ لَقَدْ ‘‘} (بلاشبہ یقینا) کے ساتھ شروع فرمایا، اس میں بائبل کا رد ہے جس کا کہنا ہے کہ وہ بچھڑا ہارون علیہ السلام نے بنایا تھا۔ فرمایا، یقینی بات یہ ہے کہ ہارون علیہ السلام نے تو اپنی قوم کو اس کی عبادت سے منع فرمایا تھا۔ ہارون علیہ السلام کے خطاب کا حسن دیکھیے کہ سب سے پہلے یہ کہہ کر انھیں اپنا اور ان کا باہمی تعلق بتایا کہ {’’ يٰقَوْمِ ‘‘} (اے میری قوم!) یعنی اپنے ایک فرد کی بات سنو، جو تمھارا ایک فرد ہے اور تم سب کی اس سے رشتہ داری ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی قوم سے فرمایا : «{ لَاۤ اَسْـَٔلُكُمْ عَلَيْهِ اَجْرًا اِلَّا الْمَوَدَّةَ فِي الْقُرْببٰى }» [الشوریٰ : ۲۳ ] ’’میں تم سے اس پر کوئی اجرت نہیں مانگتا، مگر رشتہ داری کی وجہ سے دوستی۔‘‘پھر باطل معبود کی نفی کے بعد صرف معبود برحق ’’رحمان‘‘ کو اپنا رب ماننے کی تاکید فرمائی جو ہر حال میں انسان پر رحم فرماتا ہے، جیسا کہ ’’لا الٰہ الا اللہ ‘‘ میں پہلے ہر معبود کی نفی اور آخر میں اللہ تعالیٰ کے معبود برحق ہونے کا اثبات ہے۔ آخر میں اپنی نبوت اور موسیٰ علیہ السلام کی خلافت کی وجہ سے اپنے پیچھے چلنے اور اپنا حکم ماننے کی تلقین فرمائی۔ نصیحت کی یہ بہترین ترتیب ہے۔ ¤ ➋ یہاں ایک نکتہ قابل ذکر ہے کہ شیعہ حضرات رسول اللہ صلی اللہ علیہ وسلم کی وفات کے بعد ابوبکر رضی اللہ عنہ کے بجائے علی رضی اللہ عنہ کے خلیفہ ہونے کی دلیل کے طور پر ایک حدیث بڑے زور و شور سے بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ سے فرمایا : [ أَنْتَ مِنِّيْ بِمَنْزِلَةِ هَارُوْنَ مِنْ مُّوْسٰی إِلاَّ أَنَّهُ لَا نَبِيَّ بَعْدِيْ ] [ مسلم، فضائل الصحابۃ، باب من فضائل علي بن أبي طالب رضی اللہ عنہ : 2404/31، عن سعد بن أبي وقاص رضی اللہ عنہ ] ’’تم مجھ سے اسی مقام پر ہو جو ہارون علیہ السلام کا موسیٰ علیہ السلام سے تھا، سوائے ااس بات کے کہ میرے بعد کوئی نبی نہیں۔‘‘ ان حضرات کو دیکھنا چاہیے کہ اپنے مخالفین کے اتنے بڑے مجمع میں، جو ہارون علیہ السلام کے قتل تک پر تیار تھا، ہارون علیہ السلام نے تقیہ اختیار نہیں کیا، بلکہ سب لوگوں کے سامنے واضح الفاظ میں حق بیان فرمایا اور لوگوں کو اپنے اتباع اور اطاعت کی دعوت دی اور دوسروں کی پیروی اور اطاعت سے منع فرمایا، تو اگر امت محمد صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کو خلیفہ بنانے میں خطا پر ہوتی تو علی رضی اللہ عنہ پر لازم تھا کہ وہی کرتے جو ہارون علیہ السلام نے کیا تھا اور کسی بھی تقیہ اور خوف کے بغیر اپنی خلافت کا اعلان کرتے اور صاف الفاظ میں کہتے {’’ فَاتَّبِعُوْنِيْ وَ اَطِيْعُوْا اَمْرِيْ ‘‘} تو جب انھوں نے ایسا نہیں کیا تو معلوم ہوا کہ امت کا فیصلہ درست تھا۔ (رازی)"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت 91) { قَالُوْا لَنْ نَّبْرَحَ عَلَيْهِ عٰكِفِيْنَ …: ’’ عَكَفَ يَعْكُفُ عُكُوْفًا ‘‘} (ن) کا معنی عبادت اور تقرب کے ارادے سے کسی جگہ بیٹھ رہنا ہے۔ ہارون علیہ السلام نے بنی اسرائیل کو بچھڑے کی عبادت چھوڑنے اور اپنے ساتھ موسیٰ علیہ السلام کے پیچھے طور کی طرف جانے کے لیے کہا تو انھوں نے نہایت ڈھٹائی سے ان کی دونوں باتوں کا انکار کر دیا کہ موسیٰ علیہ السلام کے واپس آنے تک ہم نہ تمھارے ساتھ جائیں گے اور نہ بچھڑے کی مجاوری چھوڑیں گے۔"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت 93،92) { قَالَ يٰهٰرُوْنُ مَا مَنَعَكَ … :} آیت (۸۶) سے (۸۹) تک موسیٰ علیہ السلام کی شدید غصے اور افسوس کے ساتھ واپسی اور قوم کو ڈانٹنے اور ان سے سوال جواب کا ذکر ہے۔ اس کے بعد دو آیات میں اس عرصے میں ہارون علیہ السلام کی امر بالمعروف اور نہی عن المنکر کے فریضے کی ادائیگی اور قوم کے ان کی کوئی بھی بات نہ ماننے کا ذکر ہے، جس سے مقصود ہارون علیہ السلام کا دامن ہر کوتاہی سے پاک قرار دینا ہے۔ موسیٰ علیہ السلام نے قوم کو بچھڑے کی عبادت کرتے دیکھا تھا، انھیں ہارون علیہ السلام کی اصلاح کی کوشش اور نصیحت کا علم نہ تھا، اس لیے قوم کو ڈانٹ ڈپٹ کے ساتھ ہی انھوں نے شدید غصے کی حالت میں تورات کی تختیوں کو پھینک دیا اور ہارون علیہ السلام کا سر پکڑ کر اپنی طرف کھینچنے لگے( اعراف : ۱۵۰، ۱۵۱) اور کہنے لگے کہ جب تم نے دیکھا کہ یہ گمراہ ہو گئے ہیں تو تمھیں کس چیز نے روکا کہ میرے پیچھے چلے آؤ اور آ کر مجھے ان کے گمراہ ہونے کی خبر دو، تو کیا تم نے میرا حکم نہیں مانا؟"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت 93،92) { قَالَ يٰهٰرُوْنُ مَا مَنَعَكَ … :} آیت (۸۶) سے (۸۹) تک موسیٰ علیہ السلام کی شدید غصے اور افسوس کے ساتھ واپسی اور قوم کو ڈانٹنے اور ان سے سوال جواب کا ذکر ہے۔ اس کے بعد دو آیات میں اس عرصے میں ہارون علیہ السلام کی امر بالمعروف اور نہی عن المنکر کے فریضے کی ادائیگی اور قوم کے ان کی کوئی بھی بات نہ ماننے کا ذکر ہے، جس سے مقصود ہارون علیہ السلام کا دامن ہر کوتاہی سے پاک قرار دینا ہے۔ موسیٰ علیہ السلام نے قوم کو بچھڑے کی عبادت کرتے دیکھا تھا، انھیں ہارون علیہ السلام کی اصلاح کی کوشش اور نصیحت کا علم نہ تھا، اس لیے قوم کو ڈانٹ ڈپٹ کے ساتھ ہی انھوں نے شدید غصے کی حالت میں تورات کی تختیوں کو پھینک دیا اور ہارون علیہ السلام کا سر پکڑ کر اپنی طرف کھینچنے لگے( اعراف : ۱۵۰، ۱۵۱) اور کہنے لگے کہ جب تم نے دیکھا کہ یہ گمراہ ہو گئے ہیں تو تمھیں کس چیز نے روکا کہ میرے پیچھے چلے آؤ اور آ کر مجھے ان کے گمراہ ہونے کی خبر دو، تو کیا تم نے میرا حکم نہیں مانا؟"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت 94) ➊ { قَالَ يَبْنَؤُمَّ لَا تَاْخُذْ … : ’’ يَبْنَؤُمَّ ‘‘} اصل میں {’’يَا ابْنَ أُمِّيْ‘‘} تھا، یاء کو الف سے بدلنے کے بعد حذف کر دیا۔ ہارون علیہ السلام نے موسیٰ علیہ السلام کا دل نرم کرنے کے لیے انھیں ماں کا بیٹا کہہ کر مخاطب کیا، کیونکہ ماں کی جانب والی قرابت باپ کی جانب والی قرابت سے زیادہ شفقت، نرمی اور پیار کا تقاضا کرتی ہے۔ (شنقیطی) ¤ ➋ { اِنِّيْ خَشِيْتُ …:} ہارون علیہ السلام نے سفر جاری نہ رکھنے کا یہ عذر بیان کیا کہ یہ لوگ راستے میں بچھڑا بنا کر وہیں بیٹھ رہنے پر اڑ گئے تھے، اگر میں توحید پر قائم لوگوں کو لے کر آپ کی طرف آتا تو قوم دو حصوں میں بٹ جاتی اور اگر میں انھیں لے کر بچھڑا پوجنے والوں سے لڑتا تو پھر بھی دو دھڑے بن جاتے، جن کی ایک دوسرے کو قتل کرنے کی وجہ سے نہ مٹنے والی شدید دشمنی بن جاتی۔ غالب دھڑا بچھڑے والوں کا تھا اور وہ اس قدر قوت میں تھے کہ انھوں نے مجھے بالکل کمزور سمجھا اور قریب تھے کہ مجھے قتل کر دیتے، اس لیے میں نے آپ کے آنے کا انتظار کیا، تاکہ آپ یہ نہ کہیں کہ تم نے بنی اسرائیل میں پھوٹ ڈال دی اور میری بات کا انتظار نہ کیا، کیونکہ آپ کے احسانات اور اللہ تعالیٰ کے عطا کردہ معجزات کی وجہ سے آپ کی ہیبت اور آپ کا اکرام ان کے دلوں میں موجود ہے۔ مجھے امید تھی کہ آپ آ کر انھیں سنبھال لیں گے۔ ¤ ➌ {فَرَّقْتَ بَيْنَ بَنِيْۤ اِسْرَآءِيْلَ :} بعض صلح کُل سیاسی حضرات، جو ووٹ لینے کی خاطر بدعتی اور مشرک لوگوں کے سامنے شرک کی تردید سے اجتناب کرتے ہیں، بلکہ قبروں پر چادریں بھی چڑھا دیتے ہیں، ان کا کہنا ہے کہ اس سے معلوم ہوا کہ لوگوں کو اپنے ساتھ رکھنے کے لیے اگر شرک کو برداشت کرنا پڑے تو وہ بھی کر لینا چاہیے، مگر پھوٹ ڈال کر سیٹ ضائع کرنے سے بچنا چاہیے۔ ان حضرات نے غور نہیں کیا کہ ہارون علیہ السلام نے شرک کے مقابلے میں کسی نرمی یا سمجھوتے سے کام نہیں لیا، بلکہ انھوں نے صاف الفاظ میں شرک کی تردید ، توحید کی تبلیغ اور اپنی اتباع و اطاعت کی تاکید فرمائی۔ دیکھیے آیت (۹۰) اگر وہ شرک کی تردید نہ کرتے تو قوم کو ان کے قتل کے درپے ہونے کی کیا ضرورت تھی؟ ہاں انھوں نے حالات کو دیکھ کر موسیٰ علیہ السلام کی آمد تک علیحدہ ہونے یا لڑنے کے بجائے ان کے فرمان کا انتظار ضروری سمجھا اور اس میں کوئی حرج کی بات نہیں۔ ¤ ➍ { لَا تَاْخُذْ بِلِحْيَتِيْ :} اس سے معلوم ہوا کہ ہارون علیہ السلام کی ڈاڑھی تھی، کیونکہ وہ اگر ڈاڑھی منڈے ہوتے تو انھیں ڈاڑھی پکڑنے کا کیا خوف تھا۔ قرآن مجید کی دوسری آیت ساتھ ملانے سے امت مسلمہ کے ہر فرد پر ڈاڑھی رکھنا فرض ثابت ہوتا ہے، اللہ تعالیٰ نے فرمایا : «{ وَ مِنْ ذُرِّيَّتِهٖ دَاوٗدَ وَ سُلَيْمٰنَ وَ اَيُّوْبَ وَ يُوْسُفَ وَ مُوْسٰى وَ هٰرُوْنَ }» [ الأنعام : ۸۴ ] ’’اور اس (ابراہیم) کی اولاد میں سے داؤد اور سلیمان اور ایوب اور یوسف اور موسیٰ اور ہارون کو (ہم نے ہدایت دی)۔‘‘ اس مقام پر اللہ تعالیٰ نے کئی اور پیغمبروں اور ان کے آباء، اولاد اور بھائیوں میں سے ہدایت یافتہ لوگوں کا ذکر کرکے فرمایا : «{ اُولٰٓىِٕكَ الَّذِيْنَ هَدَى اللّٰهُ فَبِهُدٰىهُمُ اقْتَدِهْ }» [ الأنعام : ۹۰ ] ’’یہی وہ لوگ ہیں جنھیں اللہ نے ہدایت دی، سو تو ان کی ہدایت کی پیروی کر۔‘‘ نبی صلی اللہ علیہ وسلم کو ہارون علیہ السلام اور دوسرے انبیاء کی پیروی کا حکم آپ کی امت کے لیے بھی پیروی کا حکم ہے۔ دیکھیے سورۂ صٓ (۲۴) ڈاڑھی بڑھانا فطرت ہے، کسی نبی سے ڈاڑھی منڈوانا یا کتروانا ثابت نہیں۔ یہود ونصاریٰ ڈاڑھی منڈواتے ہیں تو صرف ہمارے رسول ہی کی نہیں اپنے پیغمبر کی بھی مخالفت کرتے ہیں۔ عائشہ رضی اللہ عنھا بیان کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ عَشْرٌ مِّنَ الْفِطْرَةِ : قَصُّ الشَّارِبِ وَإِعْفَاٰءُ اللِّحْيَةِ وَالسِّوَاكُ وَاسْتِنْشَاقُ الْمَاءِ وَ قَصُّ الْأَظْفَارِ وَ غَسْلُ الْبَرَاجِمِ وَ نَتْفُ الإِْبِطِ وَ حَلْقُ الْعَانَةِ وَانْتِقَاصُ الْمَاءِ، قَالَ زَكَرِيَّاءُ قَالَ مُصْعَبٌ وَ نَسِيْتُ الْعَاشِرَةَ إِلاَّ أَنْ تَكُوْنَ الْمَضْمَضَةَ ] [ مسلم، الطھارۃ، باب خصصال الفطرۃ : ۲۶۱ ] ’’دس چیزیں فطرت میں سے ہیں : (1) مونچھیں کترنا۔ (2) ڈاڑھی بڑھانا۔ (3) مسواک کرنا۔ (4) ناک میں پانی ڈالنا۔ (5) ناخن کاٹنا۔ (6) پوروں کو دھونا۔ (7) بغلوں کے بال اکھیڑنا۔ (8) زیر ناف صفائی کرنا۔ (9) پانی سے استنجا کرنا۔‘‘ زکریا نے کہا کہ حدیث کے راوی مصعب نے کہا کہ میں دسویں چیز بھول گیا، شاید وہ کلی کرنا ہو۔‘‘ مرد اور عورت کے درمیان فرق کی سب سے بڑی ظاہری نشانی ڈاڑھی ہے۔ کسی مرد کے خصیے نکال دیے جائیں تو اس کی ڈاڑھی بھی معدوم ہو جائے گی۔ یہ خلق اللہ (اللہ کی پیدائش) میں شامل ہے، جس کے متعلق شیطان نے قسم کھا کر کہا تھا کہ میں بنی آدم کو حکم دوں گا تو وہ اللہ کی پیدا کردہ شکل کو بدل ڈالیں گے۔ ڈاڑھی بڑھانے کے حکم کی احادیث معروف ہیں : {’’ أَعْفُوا اللُّحٰي، أَرْخُوا اللُّحٰي، وَفِّرُوا اللُّحٰي، أَوْفُوا اللُّحٰي‘‘} اور {’’ لَا تُشَبِّهُوْا بِالْمَجُوْسِ‘‘} اس کے متعلق بہت سی تصانیف موجود ہیں۔ ہمارے نبی کریم صلی اللہ علیہ وسلم کی گھنی ڈاڑھی تھی۔ [ مسند أحمد : 89/1، ح : ۶۸۷، عن علی بن أبي طالب و حسنہ شعیب الأرنؤوط ] جو آپ کے بے مثال حسن کا حصہ تھی۔ آپ سے ساری زندگی اس کا ایک بال کاٹنا بھی ثابت نہیں۔ صحابہ کرام اور تابعین، جنھوں نے قیصر و کسریٰ کے خزانے فتح کیے اور زمین کے مشرق و مغرب کو اپنا تابع فرمان بنایا، ان میں کوئی ڈاڑھی منڈا نہ تھا۔ افسوس ہے ان مسلمانوں پر جن کی فطرت اس حد تک مسخ ہو چکی کہ وہ شیطان کے پیچھے لگ کر انبیاء اور صحابہ و تابعین کی وضع اور مردانگی کے اس عظیم شرف سے محروم ہی نہیں ہوئے بلکہ مرد ہوتے ہوئے عورتوں اور مخنثوں والا حلیہ بنا کر اس پر فخر کرنے لگے اور الٹا ڈاڑھی کا مذاق اڑانے لگے، جیسے ناک کٹے لوگ ناک والے کو نکو کہنا شروع کر دیں۔ اللہ تعالیٰ مسلمانوں کو اپنے پیغمبر کی اطاعت کی طرف پلٹنے اور اپنی گم کردہ عظمت و مردانگی حاصل کرنے کی توفیق عطا فرمائے۔"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت 95) {قَالَ فَمَا خَطْبُكَ يٰسَامِرِيُّ :} ہارون علیہ السلام سے جس زبانی اور عملی شدت کے ساتھ سوال ہوا تھا سامری سے سوال کرتے ہوئے وہ شدت نظر نہیں آتی، کیونکہ اپنوں پر غصہ زیادہ آتا ہے اور ان کے معقول عذر بیان کرنے پر غصہ ہی نہیں دل کا ملال بھی ختم ہو جاتا ہے، بلکہ ان کے لیے دعا نکلتی ہے۔ چنانچہ ہارون علیہ السلام کی بات سن کر موسیٰ علیہ السلام نے دعا کی : «{ رَبِّ اغْفِرْ لِيْ وَ لِاَخِيْ وَ اَدْخِلْنَا فِيْ رَحْمَتِكَ وَ اَنْتَ اَرْحَمُ الرّٰحِمِيْنَ }» [ الأعراف : ۱۵۱ ] ’’اے میرے رب! مجھے اور میرے بھائی کو بخش دے اور ہمیں اپنی رحمت میں داخل کر لے اور تو سب رحم کرنے والوں سے زیادہ رحم والا ہے۔‘‘ ¤ اس کے برعکس سامری کی بدطینتی پہلے ہی معلوم تھی، سو سوال میں وہ شدت نہیں مگر اس کا عذر گناہ سن کر، جو بدتر از گناہ تھا، اسے ایسی سزا سنائی جو شاید کسی کو بھی نہ دی گئی ہو۔ اس کی مثال جنگ تبوک میں تین مخلص مسلمانوں کے لشکر سے پیچھے رہ جانے کی وجہ سے ان سے بائیکاٹ ہے، جس کا نتیجہ ان کے اخلاص و امانت کی بدولت ان کی توبہ کی قبولیت اور قرآن میں ہمیشہ کے لیے ذکر خیر کی صورت میں نکلا۔اس کے برعکس منافقین کا عذر بظاہر قبول کر لیا جاتا ہے، مگر اس کے بعد اللہ تعالیٰ کی طرف سے انھیں کسی جنگ میں ساتھ لے جانے، ان کا جنازہ پڑھنے، ان کی قبر پر کھڑا ہونے سے منع کر دیا جاتا ہے اور آخرت کے بدترین عذاب کی نوید سنا دی جاتی ہے۔"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت 96) { قَالَ بَصُرْتُ بِمَا لَمْ يَبْصُرُوْا بِهٖ … :} میں نے اس آیت کی تفسیر کے لیے بہت زیادہ تفاسیر کا مطالعہ کیا، کئی اہل علم سے بھی پوچھا، جو کچھ تفاسیر میں لکھا ہے میں وہ نقل کرتا ہوں۔ حافظ ابن کثیر رحمہ اللہ فرماتے ہیں : {’’ بَصُرْتُ بِمَا لَمْ يَبْصُرُوْا بِهٖ ‘‘} (میں نے وہ چیز دیکھی جو ان لوگوں نے نہیں دیکھی) یعنی میں ننے جبریل علیہ السلام کو دیکھا، جب وہ فرعون کو ہلاک کرنے کے لیے آئے تو {’’ فَقَبَضْتُ قَبْضَةً مِّنْ اَثَرِ الرَّسُوْلِ ‘‘} (سو میں نے رسول کے پاؤں کے نشان سے ایک مٹھی اٹھا لی) یعنی جبریل علیہ السلام کی گھوڑی کے پاؤں کے نشان سے۔ یہی بات بہت سے مفسرین یا زیادہ تر مفسرین کے ہاں مشہور ہے۔‘‘ (ابن کثیر) جیسا کہ حافظ ابن کثیر رحمہ اللہ نے ذکر فرمایا، اکثر مفسرین نے یہی تفسیر کی ہے، بلکہ بعض نے تو اس کے علاوہ کسی تفسیر کو سلف کی تفسیر سے انحراف قرار دیا ہے، یعنی سامری نے مٹی کی وہ مٹھی بچھڑے کے مجسمے میں ڈالی تو اس سے گائے کی آواز آنے لگی۔ مگر اس تفسیر کی قرآن، حدیث یا آیات کے سیاق میں کوئی دلیل نہیں۔ شروع سورت سے یہاں تک جبریل علیہ السلام کا کوئی ذکر نہیں کہ الف لام عہد کا مان کر جبریل علیہ السلام مراد لیے جائیں۔ نہ پورے قرآن میں جبریل علیہ السلام کے متعلق {’’ الرَّسُوْلِ ‘‘} (معرف باللام) آیا ہے کہ ان کا لقب مان لیا جائے۔ پھر گھوڑی کا تو دور دور تک کچھ پتا نہیں۔ بعض تابعین کے اقوال یہاں دلیل نہیں بن سکتے، کیونکہ نہ وہ موقع پر موجود تھے اور نہ انھوں نے بتایا کہ یہ تفسیر انھوں نے کہاں سے لی۔ اگر انھوں نے پہلی کسی کتاب سے لی ہے، جیسا کہ ظاہر ہے، تو ہم اس پر یقین نہیں کر سکتے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ان کی تصدیق یا تکذیب دونوں سے منع فرمایا ہے۔ شک والی بات علم نہیں ہو سکتی اور نہ قرآن مجید (جس میں کوئی شک نہیں) کی تفسیر شک والی بات کے ساتھ کرنا علم تفسیر ہے۔ اس تفسیر سے پیدا ہونے والے سوالات، مثلاً تمام لوگوں میں سے سامری نے جبریل علیہ السلام کو کیسے پہچانا؟ اسے کیسے معلوم ہوا کہ اس مٹھی میں کیا کرشمہ ہے وغیرہ، سب کے جوابات کے لیے مزید کہانیاں درج کی گئی ہیں جن کا کوئی سر پیر نہیں۔ ¤ کئی مفسرین نے ابومسلم اصفہانی (معتزلی) کی تفسیر اختیار کی ہے، وہ کہتے ہیں کہ مفسرین نے جو کچھ فرمایا قرآن میں اس کی صراحت نہیں ہے۔ چنانچہ اس کی اور توجیہ ہو سکتی ہے کہ {’’ الرَّسُوْلِ ‘‘} سے مراد موسیٰ علیہ السلام ہیں اور رسول کے پاؤں کے نشان سے ایک مٹھی پکڑنے سے مراد یہ ہے کہ میں نے ان کی سنت اور ان کے طریقے سے کچھ حصہ اخذ کیا۔ بعض اوقات آدمی کہتا ہے : {’’فَلَانٌ يَقْفُوْ أَثَرَ فُلَانٍ وَ يَقْتَصُّ أَثَرَهُ‘‘} ’’فلاں شخص فلاں کے نشان قدم کا پیچھا کرتا ہے اور اس کے نشان قدم کے پیچھے جاتا ہے۔‘‘ جب وہ اس کے طریقے پر چلتا ہو۔مطلب یہ ہو گا کہ موسیٰ علیہ السلام نے جب سامری کو ملامت کی اور اس سے قوم کو گمراہ کرنے کا سبب پوچھا تو اس نے کہا {’’ بَصُرْتُ بِمَا لَمْ يَبْصُرُوْا بِهٖ ‘‘} یعنی مجھے معلوم ہو گیا کہ تم لوگ جس راہ پر ہو وہ حق نہیں تو {’’ فَقَبَضْتُ قَبْضَةً مِّنْ اَثَرِ الرَّسُوْلِ ({وَقَدْ كُنْتُ}) ‘‘} اس سے پہلے اے رسول! میں نے آپ کے دین اور طریقے کا کچھ حصہ اختیار کیا تھا، {’’ فَنَبَذْتُهَا ‘‘} پھر میں نے اس طریقے کو پھینک دیا اور اسے چھوڑ کر بچھڑے کی پرستش میرے نفس نے میرے لیے خوشنما بنا دی۔ اس پر موسیٰ علیہ السلام نے اسے دنیا اور آخرت کے عذاب کی اطلاع دی اور اس نے رسول کو غائب کے صیغے سے اسی طرح ذکر کیا جیسے آدمی اپنے سردار سے گفتگو کرتے ہوئے کہتا ہے کہ امیر صاحب اس بارے میں کیا فرماتے ہیں اور امیر صاحب کیا حکم دیتے ہیں؟ رہا اس کا موسیٰ علیہ السلام کی رسالت کا منکر ہونے کے باوجود انھیں رسول کہنا، تو وہ ایسے ہی ہے جیسے اللہ تعالیٰ نے کفار کا قول ذکر فرمایا : « {وَ قَالُوْا يٰۤاَيُّهَا الَّذِيْ نُزِّلَ عَلَيْهِ  الذِّكْرُ اِنَّكَ لَمَجْنُوْنٌ} » [ الحجر : ۶ ] ’’اور انھوں نے کہا اے وہ شخص جس پر یہ نصیحت نازل کی گئی ہے! بے شک تو تو دیوانہ ہے۔‘‘ حالانکہ وہ لوگ آپ پر نصیحت کا نزول تسلیم نہیں کرتے تھے۔ رازی لکھتے ہیں کہ ابومسلم نے جو ذکر کیا ہے وہ تحقیق کے زیادہ قریب ہے اور اس میں (پہلے) مفسرین کی مخالفت کے سوا کوئی خرابی نہیں۔ پھر رازی نے اس کی تائید میں کئی چیزیں ذکر کی ہیں۔ بہت سے بعد میں آنے والے مفسرین نے بھی یہ تفسیر اختیار کی ہے، مگر {’’ بَصُرْتُ بِمَا لَمْ يَبْصُرُوْا بِهٖ ‘‘} کے بعد {’’ فَقَبَضْتُ قَبْضَةً ‘‘} کی تفسیر {’’ وَقَدْ كُنْتُ قَبَضْتُ ‘‘} کے ساتھ کرنا تکلف ہے، اسی طرح کسی کی پیروی کے لیے {’’ يَقْفُوْ‘‘} اور {’’يَقْتَصُّ أَثَرَهُ ‘‘} تو معروف ہے مگر اس مفہوم کے لیے {’’ يَقْبِضُ قَبْضَةً مِنْ أَثَرِهِ ‘‘} کے استعمال کی لغت عرب میں کوئی نظیر نہ ابومسلم نے پیش کی ہے، نہ رازی نے اور نہ بعد میں آنے والے کسی بزرگ نے۔ پہلی تفسیر پر ابومسلم کا اعتراض کہ اس کی قرآن میں تصریح نہیں اس تفسیر پر بھی وارد ہوتا ہے کہ اس کی تصریح بھی قرآن میں نہیں، محض کھینچ کھانچ کر یہ مطلب نکالا گیا ہے۔ ¤ ایک اردو مفسر نے یہ بات نکالی ہے کہ سامری ایک فتنہ پرداز شخص تھا۔ اس نے بچھڑا بنا کر اس میں کسی تدبیر سے بچھڑے کی سی آواز پیدا کر دی۔ پھر مزید جسارت یہ کی کہ خود موسیٰ علیہ السلام کے سامنے ایک پر فریب داستان گھڑ کر رکھ دی، اس نے دعویٰ کیا کہ مجھے وہ کچھ نظر آیا جو دوسروں کو نظر نہ آیا تھا اور ساتھ ہی یہ افسانہ بھی گھڑ دیا کہ رسول کے نقش قدم کی ایک مٹھی بھر مٹی سے یہ کرامت صادر ہوئی ہے۔ رسول سے مراد ممکن ہے جبریل ہی ہوں، یا اس نے رسول کا لفظ خود موسیٰ علیہ السلام کے لیے استعمال کیا تھا تو یہ اس کی ایک اور مکاری تھی، وہ اس طرح موسیٰ علیہ السلام کو ذہنی رشوت دینا چاہتا تھا۔ ( ملخص) مگر ساری قوم کے سامنے اس کے جھوٹ پر موسیٰ علیہ السلام جیسے پر جلال پیغمبر کا ذہنی رشوت لے کر خاموش رہنا اور صرف اسے سزا سنانے پر اکتفا کرنا اور قوم کے سامنے اس کے جھوٹ اور فریب کو واضح نہ کرنا سمجھ میں نہیں آتا۔ ¤ ایک اور عقلی بزرگ نے {’’ بَصُرْتُ بِمَا لَمْ يَبْصُرُوْا بِهٖ ‘‘} کی یہ توجیہ کی ہے کہ اس نے کہا کہ مجھے کشفی مشاہدہ ہوا جو صرف مجھی کو ہوا کہ جبریل علیہ السلام کے آتے ہی میں نے ان کے (یا ان کے گھوڑے کے) نقش قدم سے ایک مٹھی خاک اٹھالی ہے اور ایک بچھڑا بنا کر اس میں ڈال دی ہے، جس سے وہ بولنے لگا، مگر اب آپ کے ڈانٹنے سے معلوم ہوا کہ یہ محض میرے نفس کا دھوکا تھا۔ (ملخص) تعجب ہوتا ہے کہ یہ حضرات بات بناتے بناتے کہاں تک پہنچ جاتے ہیں۔ حقیقت یہ ہے کہ دیکھنے کی تفسیر کشفی مشاہدہ قادیانی طرز تفسیر کے سوا کچھ نہیں۔ پھر یہ کیسے ہو سکتا ہے کہ موسیٰ علیہ السلام قوم کے سامنے اس فریب کا پردہ چاک نہ کریں؟ مجھے تو سلامتی اسی میں نظر آتی ہے کہ جس آیت کی تفصیل قرآن مجید کے الفاظ سے واضح نہ ہو اور نہ رسول اللہ صلی اللہ علیہ وسلم سے آئی ہو، اہل کتاب کی کسی روایت پر یقین کرنے یا زبردستی کوئی مطلب نکالنے کے بجائے متشابہات میں سے سمجھ کر اس پر مجمل ایمان رکھا جائے اور اس کی تفصیل اللہ کے سپرد کر دی جائے، کیونکہ خود اللہ تعالیٰ نے فرمایا ہے : « {هُوَ الَّذِيْۤ اَنْزَلَ عَلَيْكَ الْكِتٰبَ مِنْهُ اٰيٰتٌ مُّحْكَمٰتٌ هُنَّ اُمُّ الْكِتٰبِ وَ اُخَرُ مُتَشٰبِهٰتٌ فَاَمَّا الَّذِيْنَ فِيْ قُلُوْبِهِمْ زَيْغٌ فَيَتَّبِعُوْنَ مَا تَشَابَهَ مِنْهُ ابْتِغَآءَ الْفِتْنَةِ وَ ابْتِغَآءَ تَاْوِيْلِهٖ وَ مَا يَعْلَمُ تَاْوِيْلَهٗۤ اِلَّا اللّٰهُ وَ الرّٰسِخُوْنَ فِي الْعِلْمِ  يَقُوْلُوْنَ اٰمَنَّا بِهٖ كُلٌّ مِّنْ عِنْدِ رَبِّنَا وَ مَا يَذَّكَّرُ اِلَّاۤ اُولُوا الْاَلْبَابِ} » [ آل عمران : ۷ ] ’’وہی ہے جس نے تجھ پر یہ کتاب اتاری، جس میں کچھ آیات محکم ہیں، وہی کتاب کی اصل ہیں اور کچھ دوسری کئی معنوں میں ملتی جلتی ہیں، پھر جن لوگوں کے دلوں میں تو کجی ہے وہ اس میں سے ان کی پیروی کرتے ہیں جو کئی معنوں میں ملتی جلتی ہیں، فتنے کی تلاش کے لیے اور ان کی اصل مراد کی تلاش کے لیے، حالانکہ ان کی اصل مراد نہیں جانتا مگر اللہ اور جو علم میں پختہ ہیں وہ کہتے ہیں ہم اس پر ایمان لائے، سب ہمارے رب کی طرف سے ہے اور نصیحت قبول نہیں کرتے مگر جو عقلوں والے ہیں۔‘‘ آخر ہم حروف مقطعات، اللہ تعالیٰ کی صفات، سد ذوالقرنین، دابۃ الارض، یاجوج ماجوج اور قرآن مجید کی کتنی ہی باتوں کی تفصیل نہیں جانتے، مگر ہمارا ان پر ایمان ہے۔ سامری کے جواب کی تفصیل میں اگر ہمارا کوئی فائدہ ہوتا تو اللہ تعالیٰ اسے ضرور ذکر فرما دیتا۔ سو ہمارا ایمان ہے کہ اگرچہ ہم تفصیل نہیں جانتے مگر جو ہمارے رب نے فرمایا وہ حق ہے۔"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت 97) ➊ {قَالَ فَاذْهَبْ فَاِنَّ لَكَ فِي الْحَيٰوةِ …:’’ مِسَاسَ ‘‘ ’’ قَاتَلَ يُقَاتِلُ مَقَاتَلَةً وَ قِتَالًا ‘‘} کی طرح باب مفاعلہ کا مصدر ہے جس میں مشارکت پائی جاتی ہے، یعنی ایک دوسرے کو چھونا، ہاتھ لگانا۔ اللہ تعالیٰ کی طرف سے وہ زندگی  بھر کے لیے ایسی بیماری اور عذاب میں مبتلا ہوا کہ وہ کسی کو ہاتھ لگاتا یا کوئی اسے ہاتھ لگاتا، دونوں صورتوں میں اسے شدید تکلیف ہوتی، جس کی حقیقت اللہ تعالیٰ بہتر جانتا ہے۔ وہ اس سے بچنے کے لیے خود ہی کہتا پھرتا کہ نہ میں تمھیں ہاتھ لگاتا ہوں اور نہ تم مجھے ہاتھ لگاؤ۔ بعض تابعین نے کہا ہے کہ ہاتھ لگنے کی صورت میں سامری اور دوسرے شخص دونوں کو بخار چڑھ جاتا تھا، مگر انھوں نے اس خبر کا ذریعہ نہیں بتایا۔ زندگی ہی میں تمام انسانوں سے اس کا تعلق کاٹ دیا گیا اور وہ تنہائی کے بدترین عذاب میں مبتلا ہو گیا۔ اس کے عمل سے سزا کی مناسبت اہل علم نے یہ بیان فرمائی ہے کہ گائے کی آواز والا بچھڑا بنا کر اسے معبود کی صورت میں پیش کرنے سے اس کا مقصد شہرت اور لوگوں کو اپنے گرد جمع کرنے کی خواہش تھی، اللہ تعالیٰ نے ایسی سزا دی کہ کسی ایک شخص سے بھی نہ مل سکے۔ ¤ ➋ {وَ اِنَّ لَكَ مَوْعِدًا لَّنْ تُخْلَفَهٗ : } مراد موت، قبر اور آخرت کا عذاب ہے۔ ¤ ➌ {وَ انْظُرْ اِلٰۤى اِلٰهِكَ الَّذِيْ … : ’’ ظَلْتَ ‘‘ ’’ظَلَّ يَظَلُّ‘‘} (ع) سے واحد مذکر حاضر ہے، جو اصل میں {’’ظَلِلْتَ‘‘} تھا (پہلے لام کے کسرہ کے ساتھ)، بولنے میں دشواری ختم کرنے کے لیے پہلا لام حذف کر دیا گیا۔ وزن {’’فَعِلْتَ‘‘ } کے بجائے {’’فَلْتَ‘‘} رہ گیا۔ {’’لَنُحَرِّقَنَّهٗ‘‘} جلانے میں شدت کے اظہار کے لیے باب تفعیل استعمال ہوا ہے۔ {’’نَسَفَ يَنْسِفُ نَسْفًا‘‘} (ض) اڑانا، بکھیرنا۔ {’’الْيَمِّ ‘‘} نمکین سمندر اور میٹھے دریا دونوں معنوں میں آتا ہے۔ یہاں ایک سوال ہے کہ سونے یا چاندی کے بچھڑے کو آگ میں جلانے سے وہ دھات اڑانے اور بکھیرنے کے قابل تو نہیں ہوتی بلکہ زیادہ خالص اور مضبوط ہو جاتی ہے۔ اس کا جواب بعض مفسرین نے یہ دیا ہے کہ وہ گوشت پوست کا بچھڑا بن گیا تھا، مقصد یہ تھا کہ ہم اسے ذبح کرکے اچھی طرح جلا کر دریا یا سمندر میں اڑا کر بکھیر دیں گے، مگر گوشت پوست کا بچھڑا بننے کی بات بالکل بے اصل ہے۔ دوسرا جواب یہ دیا گیا ہے کہ ہم اسے خوب گرم کریں گے، تاکہ وہ نرم ہو جائے، پھر ریتی کے ساتھ اسے ذرہ ذرہ کر کے دریا میں بکھیر دیں گے، مگر قرآن مجید میں ریتی کا ذکر نہیں۔ اس لیے بعض مفسرین نے فرمایا کہ {’’حَرَقَ يَحْرُقُ‘‘} کا معنی پیسنا بھی آتا ہے اور باب تفعیل میں مزید مبالغہ ہو گیا۔ یہ جواب بھی زبردستی پر مبنی ہے، کیونکہ {’’ تَحْرِيْقٌ ‘‘} کا معنی جلانا ہی آتا ہے۔ اللہ تعالیٰ کے خاص فضل سے مجھے اس کا بالکل واضح جواب مل گیا، وہ یہ کہ حکیم جس دھات کا چاہتے ہیں کشتہ بنا لیتے ہیں، جو راکھ کی صورت میں اتنا باریک ہو جاتا ہے کہ پھونک سے اڑ جاتا ہے۔ اطباء کو انبیاء کے کمال سے تو کوئی نسبت ہی نہیں، لہٰذا ان کے لیے دھات کو راکھ بنانا کیا مشکل ہے؟ ¤ ➍ موسیٰ علیہ السلام کا عمل اس بات کی دلیل ہے کہ غیر اللہ کی عبادت کے لیے جو چیز بھی استعمال ہو رہی ہو اسے مسمار کرنا، جلانا اور اس کا نام و نشان مٹا دینا لازم ہے، خواہ وہ کوئی بت ہو یا درخت یا قبر۔ ابوالہیاج الاسدی (علی رضی اللہ عنہ کے داماد) فرماتے ہیں کہ مجھے علی رضی اللہ عنہ نے فرمایا : [ أَلَا أَبْعَثُكَ عَلٰلٰی مَا بَعَثَنِيْ عَلَيْهِ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ أَنْ لاَّ تَدَعَ تِمْثَالاً إِلَّا طَمَسْتَهٗ وَلَا قَبْرًا مُشْرِفًا إِلاَّ سَوَّيْتَهٗ ] [ مسلم، الجنائز، باب الأمر بتسویۃ القبر : ۹۶۹ ] ’’کیا میں تمھیں اس کام پر نہ بھیجوں جس پر مجھے رسول اللہ صلی اللہ علیہ وسلم نے بھیجا تھا؟ وہ یہ ہے کہ کسی مجسمے کو نہ چھوڑو جسے مٹا نہ دو اور کسی اونچی قبر کو نہ چھوڑو جسے برابر نہ کر دو۔‘‘ اللہ کی شان دیکھیے، اونچی قبریں برابر کرنے پر علی رضی اللہ عنہ کو مقرر فرمایا جنھیں تمام قبر پرست اپنا پیشوا مانتے ہیں۔ حقیقت یہ ہے کہ مسلمانوں کی دنیوی و اخروی ذلت و رسوائی کا باعث اہلِ کتاب کی پیروی میں قبر پرستی اور شرک کی دوسری صورتوں میں مبتلا ہونا اور توحید سے منہ موڑنا ہے۔ اللہ تعالیٰ امتِ مسلمہ کو اپنی توحید کی طرف پلٹنے کی توفیق عطا فرمائے۔ (آمین) {’’ لَنُحَرِّقَنَّهٗ‘‘} اور {’’ لَنَنْسِفَنَّهٗ ‘‘} میں لام تاکید اور نون ثقیلہ کے ساتھ اور پھر {’’ نَسْفًا ‘‘} مفعول مطلق کے ساتھ تاکید کا مطلب یہ ہے کہ ہم ہر صورت اسے جلائیں گے اور ہر صورت دریا میں اڑا کر بکھیریں گے۔ کسی طرح ایسا کرنے سے نہیں ٹلیں گے، خواہ کوئی مقابلے پر آ جائے، یا منت و سماجت کرے، یا اپنے اس معبود کے غیظ و غضب سے ڈراتا رہے، یہ کام ہو کر رہے گا۔"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت 98) {اِنَّمَاۤ اِلٰهُكُمُ اللّٰهُ الَّذِيْ …:} یہ موسیٰ علیہ السلام کا کلام ہے جنھوں نے سامری سے خطاب کے بعد اپنی امت کے لوگوں کو مخاطب فرمایا۔ اس آیت میں اللہ تعالیٰ کے معبود برحق ہونے کی دو دلیلیں بیان ہوئی ہیں، ایک اللہ تعالیٰ کی وحدانیت کہ اس کے سوا کوئی معبود نہیں۔ اہلِ علم فرماتے ہیں کہ اس صفت میں ساری صفات آ جاتی ہیں، تفصیل اس کی علم کلام کی کتابوں میں ’’لا الٰہ الا اللہ‘‘ کی تشریح میں مذکور ہے۔ دوسری دلیل خاص صفت علم ہے جس کے گھیرے سے کوئی چیز باہر نہیں۔ {’’ وَسِعَ ‘‘} کا لفظ اس لیے استعمال فرمایا کہ گھیرا ڈالنے والی چیز میں اس کے اندر والی چیز سے زیادہ گنجائش ہوتی ہے۔ (ابن عاشور) جو {’’ كُلَّ شَيْءٍ ‘‘} سے بھی وسیع ہے اس کی وسعت کا اندازہ کون کر سکتا ہے؟"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت 99) {كَذٰلِكَ نَقُصُّ عَلَيْكَ …:} یعنی جیسے ہم نے آپ کو موسیٰ علیہ السلام ، بنی اسرائیل، فرعون اور اس کی قوم کے حالات بتائے ہیں ایسے ہی ہم آپ کو ان چیزوں کی کچھ خبریں سناتے ہیں جو آپ سے پہلے گزر چکیں۔ جنھیں نہ آپ نے دیکھا تھا اور نہ آپ کو یا آپ کی قوم کو ان کا علم تھا۔ دیکھیے ہود (۴۹) ان سے مقصود محض وقت گزاری یا لطف اٹھانا نہیں بلکہ مقصود نصیحت ہے اور ہم نے اپنے پاس سے آپ کو یہ عظیم نصیحت عطا کی ہے۔ اس عظیم نصیحت سے مراد وحی الٰہی کے ذریعے سے نازل ہونے والی کتاب و حکمت (قرآن و سنت) ہے۔ اس کے سوا بڑے سے بڑے آدمی کی بات نہ اللہ کے پاس سے ہے اور نہ اس پر عمل کی اجازت ہے۔ دیکھیے سورۂ اعراف (۳) {’’ ذِكْرًا ‘‘} کی تنوین تعظیم کے لیے ہے، اس لیے ترجمہ ’’عظیم نصیحت‘‘ کیا ہے اور{ ’’ مِنْ ‘‘} تبعیض کے لیے ہے، اس لیے ترجمہ ’’کچھ خبریں‘‘ کیا ہے، تمام خبریں سننے کی نہ ضرورت ہے اور نہ سنی جا سکتی ہیں۔ {’’ مَا ‘‘} اکثر غیر ذوی العقول کے لیے آتا ہے، اس لیے ترجمہ ان لوگوں کے بجائے ’’ان چیزوں کی کچھ خبریں‘‘ کیا گیا ہے، ’’ان احوال کی کچھ خبریں‘‘ بھی ترجمہ ہو سکتا ہے۔"
    },
    {
      "ayah": 100,
      "tafsir": "(آیت 101،100) { مَنْ اَعْرَضَ عَنْهُ … :} منہ پھیرنے سے مراد اس نصیحت پر ایمان نہ لانا اور عمل نہ کرنا ہے۔ {’’ وِزْرًا ‘‘} پر تنوین تعظیم و تہویل کے لیے ہے، بڑا بوجھ، بھاری بوجھ۔ {’’ حِمْلًا ‘‘} بمعنی {’’مَحْمُووْلٌ‘‘} ہے، جیسے {’’ذِبْحٌ‘‘} بمعنی {’’مَذْبُوْحٌ‘‘} ہے، اٹھایا ہوا (بوجھ)۔ {’’ سَآءَ ‘‘} فعل ذم ہے، جس کا فاعل ضمیر مبہم {’’هُوَ‘‘} ہے اور جس کے ابہام کی توضیح {’’ حِمْلًا ‘‘} تمیز کے ساتھ کی گئی ہے۔"
    },
    {
      "ayah": 101,
      "tafsir": "(آیت 101،100) { مَنْ اَعْرَضَ عَنْهُ … :} منہ پھیرنے سے مراد اس نصیحت پر ایمان نہ لانا اور عمل نہ کرنا ہے۔ {’’ وِزْرًا ‘‘} پر تنوین تعظیم و تہویل کے لیے ہے، بڑا بوجھ، بھاری بوجھ۔ {’’ حِمْلًا ‘‘} بمعنی {’’مَحْمُووْلٌ‘‘} ہے، جیسے {’’ذِبْحٌ‘‘} بمعنی {’’مَذْبُوْحٌ‘‘} ہے، اٹھایا ہوا (بوجھ)۔ {’’ سَآءَ ‘‘} فعل ذم ہے، جس کا فاعل ضمیر مبہم {’’هُوَ‘‘} ہے اور جس کے ابہام کی توضیح {’’ حِمْلًا ‘‘} تمیز کے ساتھ کی گئی ہے۔"
    },
    {
      "ayah": 102,
      "tafsir": "(آیت 102) {يَوْمَ يُنْفَخُ فِي الصُّوْرِ … :} یہ پچھلی آیات میں مذکور {’’ يَوْمَ الْقِيٰمَةِ ‘‘} سے بدل ہے جو قیامت کے دن کی وضاحت کر رہا ہے۔ {’’ الصُّوْرِ ‘‘} کی تشریح کے لیے دیکھیے سورۂ انعام (۷۳) اور کہف (۹۹)۔ {’’ زُرْقًا‘‘ ’’أَزْرَقُ‘‘} کی جمع ہے، جس کا معنی نیلے رنگ والا ہے۔ یہاں اس کے دو معنی مراد ہو سکتے ہیں، ایک نیلے جسم اور نیلے چہروں والے، مراد سیاہ رنگ والے، کیونکہ جلی ہوئی جلد نیلگوں کالی ہو جاتی ہے۔ اس کی ہم معنی آیت کے لیے دیکھیے سورۂ آل عمران (۱۰۶)۔ دوسرا معنی ’’اندھے‘‘ ہے، کیونکہ بہت نیلی آنکھ اندھے آدمی کی ہوتی ہے، یعنی قیامت کے دن اندھے اٹھائے جائیں گے، اس کی ہم معنی آیت کے لیے دیکھیے سورۂ طٰہٰ (۱۲۴، ۱۲۵)۔ طبری نے صرف یہی معنی بیان فرمایا ہے۔"
    },
    {
      "ayah": 103,
      "tafsir": "(آیت 103) { يَتَخَافَتُوْنَ بَيْنَهُمْ …:} اسمائے عدد میں قاعدہ ہے کہ تین سے دس تک کی گنتی میں اگر کوئی چیز مذکر ہو تو عدد مؤنث آئے گا اور اگر کوئی چیز مؤنث ہو تو عدد مذکر ہو گا، جیسا کہ فرمایا : «{ سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَّ ثَمٰنِيَةَ اَيَّامٍ حُسُوْمًا}» [الحاقۃ : ۷ ] ’’اس نے اس (آندھی) کو ان پر سات راتیں اور آٹھ دن مسلسل چلائے رکھا۔‘‘ اس لیے یہاں {’’ عَشْرًا ‘‘} کا معنی دس راتیں ہو گا۔ {’’ تَخَافُتْ ‘‘} (تفاعل) کا معنی خوف وغیرہ کی وجہ سے آہستہ آواز سے بات کرنا ہے۔ ان کی یہ حالت قیامت کی ہولناکی کی وجہ سے ہوگی۔"
    },
    {
      "ayah": 104,
      "tafsir": "(آیت 104) {نَحْنُ اَعْلَمُ بِمَا يَقُوْلُوْنَ …: ’’اَمْثَلُ‘‘} بمعنی {’’أَفْضَلُ‘‘} ہے۔ {’’ اَلْمَثَالَةُ ‘‘} یعنی {’’ اَلْفَضْلُ۔‘‘ ’’ طَرِيْقَةً ‘‘‘} سب سے اچھے طریقے والا سے مراد یہاں سب سے اچھی رائے والا ہے۔ اسے زیادہ اچھی رائے والا اور عقل مند اس لیے فرمایا کہ اس نے دنیا کے عارضی اور ختم ہونے کو اور آخرت کے ہمیشہ اور باقی رہنے کو دوسروں سے زیادہ سمجھا، اس لیے اس نے کہا کہ دس راتیں کہاں، تم تو ایک دن سے زیادہ دنیا میں نہیں ٹھہرے۔ طبری نے فرمایا کہ قیامت کی ہولناکی انھیں دنیا کا عیش و عشرت ایسا بھلائے گی کہ وہ دنیا میں رہنے کی صحیح مدت بھی نہیں بتا سکیں گے۔ دیکھیے سورۂ مومنون (۱۱۲ تا ۱۱۴) اور روم (۵۵)۔"
    },
    {
      "ayah": 105,
      "tafsir": "(آیت 106،105) ➊ {وَ يَسْـَٔلُوْنَكَ عَنِ الْجِبَالِ … :} قرطبی نے فرمایا کہ قرآن مجید میں جہاں بھی کسی سوال کا ذکر آیا ہے اس کے لیے جواب میں {’’قُلْ‘‘} کا لفظ آیا ہے۔ صرف اس مقام پر فاء کے ساتھ {’’ فَقُلْ ‘‘} آیا ہے۔ اس کی وجہ یہ ہے کہ دوسرے تمام مقامات پر ان سوالات کا جواب ہے جو ہو چکے تھے، یہاں فاء اس لیے ہے کہ اللہ تعالیٰ نے آئندہ ہونے والے سوال کا جواب دیا کہ {’’ فَإِنْ سَأَلُوْكَ فَقُلْ… ‘‘} یعنی اگر وہ تجھ سے پوچھیں تو کہہ دینا…۔ یعنی فاء دلیل ہے کہ اس سے پہلے شرط محذوف ہے۔ ¤ ➋ { فَقُلْ يَنْسِفُهَا رَبِّيْ نَسْفًا … :} صور پھونکنے کے ساتھ قیامت قائم ہونے اور تمام لوگوں کے جمع کرنے کے ذکر پر منکرین قیامت کی طرف سے سوال آنے والا تھا، اللہ تعالیٰ نے اس کا جواب پہلے ہی دے دیا کہ ان کے خیال میں اتنے بلند و بالا اور محکم پہاڑوں کو ان کی جگہ سے کوئی ہلا نہیں سکتا، اس لیے وہ پوچھیں گے کہ ان پہاڑوں کا کیا بنے گا؟ اللہ تعالیٰ نے فرمایا کہ اگر یہ لوگ پوچھیں تو آپ ان سے کہہ دیں کہ میرا رب انھیں اڑا کر بکھیر دے گا۔ {’’ يَنْسِفُهَا ‘‘} کی تاکید {’’ نَسْفًا ‘‘} کے ساتھ فرمائی، تاکہ کوئی یہ نہ سمجھے کہ {’’يَنْسِفُ‘‘} اپنے اصل معنی میں نہیں ہے بلکہ مجاز ہے۔ یعنی فی الحقیقت اللہ تعالیٰ انھیں ریزہ ریزہ کرکے اڑا دے گا۔ پہاڑوں پر گزرنے والی حالتوں کی تفصیل کے لیے دیکھیے سورۂ نبا (۲۰) کی تفسیر۔ {’’ قَاعًا ‘‘} میدان۔ {’’ صَفْصَفًا ‘‘} ہموار۔"
    },
    {
      "ayah": 106,
      "tafsir": "(آیت 106،105) ➊ {وَ يَسْـَٔلُوْنَكَ عَنِ الْجِبَالِ … :} قرطبی نے فرمایا کہ قرآن مجید میں جہاں بھی کسی سوال کا ذکر آیا ہے اس کے لیے جواب میں {’’قُلْ‘‘} کا لفظ آیا ہے۔ صرف اس مقام پر فاء کے ساتھ {’’ فَقُلْ ‘‘} آیا ہے۔ اس کی وجہ یہ ہے کہ دوسرے تمام مقامات پر ان سوالات کا جواب ہے جو ہو چکے تھے، یہاں فاء اس لیے ہے کہ اللہ تعالیٰ نے آئندہ ہونے والے سوال کا جواب دیا کہ {’’ فَإِنْ سَأَلُوْكَ فَقُلْ… ‘‘} یعنی اگر وہ تجھ سے پوچھیں تو کہہ دینا…۔ یعنی فاء دلیل ہے کہ اس سے پہلے شرط محذوف ہے۔ ¤ ➋ { فَقُلْ يَنْسِفُهَا رَبِّيْ نَسْفًا … :} صور پھونکنے کے ساتھ قیامت قائم ہونے اور تمام لوگوں کے جمع کرنے کے ذکر پر منکرین قیامت کی طرف سے سوال آنے والا تھا، اللہ تعالیٰ نے اس کا جواب پہلے ہی دے دیا کہ ان کے خیال میں اتنے بلند و بالا اور محکم پہاڑوں کو ان کی جگہ سے کوئی ہلا نہیں سکتا، اس لیے وہ پوچھیں گے کہ ان پہاڑوں کا کیا بنے گا؟ اللہ تعالیٰ نے فرمایا کہ اگر یہ لوگ پوچھیں تو آپ ان سے کہہ دیں کہ میرا رب انھیں اڑا کر بکھیر دے گا۔ {’’ يَنْسِفُهَا ‘‘} کی تاکید {’’ نَسْفًا ‘‘} کے ساتھ فرمائی، تاکہ کوئی یہ نہ سمجھے کہ {’’يَنْسِفُ‘‘} اپنے اصل معنی میں نہیں ہے بلکہ مجاز ہے۔ یعنی فی الحقیقت اللہ تعالیٰ انھیں ریزہ ریزہ کرکے اڑا دے گا۔ پہاڑوں پر گزرنے والی حالتوں کی تفصیل کے لیے دیکھیے سورۂ نبا (۲۰) کی تفسیر۔ {’’ قَاعًا ‘‘} میدان۔ {’’ صَفْصَفًا ‘‘} ہموار۔"
    },
    {
      "ayah": 107,
      "tafsir": "(آیت 107) { لَا تَرٰى فِيْهَا عِوَجًا وَّ لَاۤ اَمْتًا : ’’ عِوَجًا ‘‘} کجی، مراد نیچی جگہ ہے۔ {’’ اَمْتًا ‘‘} معمولی ابھری ہوئی جگہ، یعنی ہر بلندی اور پستی، حتیٰ کہ سمندروں کی گہرائی اور پہاڑوں کی بلندی ختم ہو کر پوری زمین بالکل ہموار ہو جائے گی، جس میں ذرہ برابر نیچی یا اونچی جگہ دکھائی نہ دے گی۔"
    },
    {
      "ayah": 108,
      "tafsir": "(آیت 108) ➊ {يَوْمَىِٕذٍ يَّتَّبِعُوْنَ الدَّاعِيَ …:} یعنی قیامت کے دن سب لوگ حشر کے لیے قبروں سے نکل کر پکارنے والے کی آواز کی طرف نہایت تیزی کے ساتھ سر اٹھائے ہوئے دوڑتے جائیں گے، جیسا کہ فرمایا : «{ مُهْطِعِيْنَ مُقْنِعِيْ رُءُوْسِهِمْ }» [إبراہیم : ۴۳ ] ’’اس حال میں کہ تیز دوڑنے والے، اپنے سروں کو اوپر اٹھانے والے ہوں گے۔‘‘ اس کی طرف جانے میں کوئی کجی نہ ہو گی، یعنی تیر کی طرح سیدھے جائیں گے اور ذرہ بھر ادھر ادھر نہ ہوں گے۔ اس حالت کا نقشہ سورۂ ابراہیم (۴۲، ۴۳)، سورۂ قمر (۶ تا ۸) اور سورۂ قٓ (۴۱، ۴۲) میں دیکھیے۔ {’’لَا عِوَجَ لَهٗ ‘‘} کا دوسرا معنی یہ ہے کہ پکارنے والے کی پکار میں کوئی کجی نہ ہو گی کہ کسی تک پہنچے اور کسی تک نہ پہنچے، ہر شخص تک سیدھی پہنچے گی۔ ¤ ➋ { وَ خَشَعَتِ الْاَصْوَاتُ … :} یعنی اتنی بے شمار مخلوق کے دوڑنے اور اکٹھے ہونے پر کوئی شور و غل نہ ہو گا۔ سب آوازیں رحمان کے لیے پست ہو جائیں گی۔ ’’رحمان‘‘ کے لیے پست ہونے کا مطلب یہ ہے کہ اس بے حد رحم والے رب کی رحمت اور اس کے کرم کی طلب میں سب عاجزی سے خاموش ہوں گے۔ {’’ هَمْسًا ‘‘} ہلکی سے ہلکی آواز یا قدموں کی ہلکی سے ہلکی آہٹ، کھسکھساہٹ۔"
    },
    {
      "ayah": 109,
      "tafsir": "(آیت 109) ➊ {يَوْمَىِٕذٍ لَّا تَنْفَعُ الشَّفَاعَةُ … :} اس آیت میں اس دن کی مزید ہیبت اور عظمت بیان ہوئی ہے کہ مشرکین کا کہنا کہ ہمارے معبود ہماری سفارش کرکے ہمیں بچا لیں گے، بالکل غلط ہے۔ وہاں کوئی سفارش نفع نہ دے گی۔ ¤ ➋ { اِلَّا مَنْ اَذِنَ لَهُ الرَّحْمٰنُ … :} اس کے دو مطلب ہیں، دونوں مراد ہیں اور دونوں کی تائید آیات قرآن سے ہوتی ہے۔ یہ قرآن کا اعجاز ہے کہ نہایت مختصر لفظوں میں بہت زیادہ معانی ہوتے ہیں۔ ایک معنی یہ ہے کہ اس دن سفارش نفع نہ دے گی مگر اس کی جس کو رحمان سفارش کرنے کی اجازت دے اور جس کے بات کرنے کو پسند فرمائے۔ دوسرا یہ کہ اس دن سفارش نفع نہ دے گی مگر اس کو جس کے حق میں رحمان سفارش کی اجازت دے اور جس کے حق میں بات کرنے کو پسند فرمائے۔ دیکھیے سورۂ مریم (۸۷)، سبا (۲۳)، زخرف (۸۶)، نجم (۲۶) اور نبا (۳۸)۔"
    },
    {
      "ayah": 110,
      "tafsir": "(آیت 110) ➊ { يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَ مَا خَلْفَهُمْ :} دیکھیے آیت الکرسی (بقرہ : ۲۵۵) کی تفسیر۔ ¤ ➋ {وَ لَا يُحِيْطُوْنَ بِهٖ عِلْمًا : ’’ بِهٖ ‘‘} کی ضمیر کے مرجع کے لحاظ سے اس کے تین مطلب ہو سکتے ہیں اور تینوں صحیح ہیں۔ ایک یہ کہ{ ’’ بِهٖ ‘‘} میں {’’هٖ‘‘} ضمیر اللہ تعالیٰ کے لیے قرار دی جائے۔ معنی یہ ہو گا کہ کسی کا علم اتنا نہیں ہے کہ اللہ تعالیٰ کی ذات و صفات کا احاطہ کر سکے، مخلوق کا محدود علم خالق کا احاطہ کیسے کر سکتا ہے؟ دوسرا یہ کہ یہ ضمیر {’’ يَعْلَمُ ‘‘} کے مصدر{ ’’عِلْمٌ‘‘} کے لیے قرار دی جائے۔ اس صورت میں معنی یہ ہو گا کہ کوئی شخص اللہ کے علم کا احاطہ نہیں کر سکتا اور اس صورت میں یہ آیت الکرسی کے جملہ{ ’’ وَ لَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖۤ اِلَّا بِمَا شَآءَ ‘‘} کا ہم معنی ہو گا۔ تیسرا یہ ہے کہ {’’هٖ‘‘} ضمیر{’’ مَا بَيْنَ اَيْدِيْهِمْ وَ مَا خَلْفَهُمْ‘‘} میں موجود {’’ مَا ‘‘ } کی طرف لوٹ رہی ہو۔ اس صورت میں مطلب یہ ہو گا کہ ان میں سے کسی کا علم بھی اس کا احاطہ نہیں کر سکتا جو لوگوں کے سامنے ہے اور جو ان کے پیچھے ہے۔ یعنی اللہ تعالیٰ کے سوا دوسروں کو (چاہے وہ فرشتے ہوں یا جن یا انسان یا کوئی اور) لوگوں کے اگلے پچھلے حال کا پورا علم نہیں ہے کہ جان سکیں کہ کس کے حق میں شفاعت کرنی چاہیے اور کس کے حق میں نہیں کرنی چاہیے، اس لیے شفاعت کو اللہ تعالیٰ کے اذن (اجازت) پر موقوف رکھا گیا ہے۔ اس میں ان لوگوں کے لیے تنبیہ ہے جو فرشتوں یا انبیاء و اولیاء اور بزرگوں کی پرستش اس امید پر کرتے ہیں کہ وہ قیامت کے دن ہماری سفارش کریں گے۔"
    },
    {
      "ayah": 111,
      "tafsir": "(آیت 111) ➊ {وَ عَنَتِ الْوُجُوْهُ لِلْحَيِّ الْقَيُّوْمِ : ’’ عَنَتْ ‘‘ ’’عَنَا يَعْنُوْ عُنُوًّا‘‘} (ن) سے واحد مؤنث غائب، ماضی معلوم ہے، اصل میں {’’عَنَوَتْ‘‘} تھا، ذلیل اور عاجز ہو کر جھک جانا۔ اس میں سے اسم فاعل {’’عَانٍ‘‘} یا {’’اَلْعَانِيْ‘‘} آتا ہے، جس کا معنی قیدی ہے، کیونکہ قیدی بے حد عاجز، بے بس اور ذلیل ہوتا ہے۔ یعنی اس دن صرف تمام آوازیں ہی رحمان کے لیے پست نہیں ہوں گی بلکہ تمام چہرے، حتیٰ کہ ان سرکش متکبر لوگوں کے چہرے بھی اس حی و قیوم کے سامنے ذلیل قیدیوں کی طرح جھکے ہوں گے جن کی پیشانی دنیا میں کبھی اللہ کے سامنے جھکی نہ تھی۔ کیونکہ وہ سب فانی و محتاج ہیں اور انھیں حی و قیوم کے سامنے جھکے بغیر کوئی چارہ ہی نہیں۔ {’’ لِلْحَيِّ الْقَيُّوْمِ ‘‘}  کی تفسیر آیت الکرسی (بقرہ : ۲۵۵) میں دیکھیے۔ ¤ ➋ { وَ قَدْ خَابَ مَنْ حَمَلَ ظُلْمًا:} یہاں {’’ ظُلْمًا ‘‘} پر تنوین تعظیم کی ہے، اس لیے ترجمہ ’’بڑے ظلم کا بوجھ اٹھایا‘‘ کیا ہے۔ بڑے ظلم سے مراد مشرک ہونا اور مسلمان نہ ہونا ہے۔ (طبری) اس کا ترجمہ ’’کسی ظلم کا بوجھ اٹھایا‘‘ درست نہیں، کیونکہ گناہ گار مومن و موحد سزا پا کر یا سزا کے بغیر اللہ کے اذن سے جنت میں چلے جائیں گے اور جنت میں پہنچ جانے والا ناکام نہیں۔ دلیل اور تفصیل کے لیے دیکھیے سورۂ انعام (۸۲)، بقرہ (۲۵۴) اور یونس (۱۰۶) کی تفسیر۔"
    },
    {
      "ayah": 112,
      "tafsir": "(آیت 112) ➊ { وَ مَنْ يَّعْمَلْ مِنَ الصّٰلِحٰتِ وَ هُوَ مُؤْمِنٌ : ’’ مِنَ الصّٰلِحٰتِ ‘‘} میں {’’ مِنْ ‘‘} تبعیض کے لیے ہے، اس لیے ترجمہ ’’کچھ نیک اعمال‘‘ کیا ہے۔ انسان اپنی کمزوری کی وجہ سے تمام اعمال صالحہ تو کر ہی نہیں سکتا، جیسا کہ فرمایا : «{ كَلَّا لَمَّا يَقْضِ مَاۤ اَمَرَهٗ }» [عبس : ۲۳ ] ’’ہر گز نہیں، ابھی تک اس نے وہ کام پورا نہیں کیا جس کا اس نے اسے حکم دیا۔‘‘ اس لیے وہ اتنے عمل ہی کا مکلف ہے جتنی اس میں طاقت ہے، فرمایا : «{لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا وُسْعَهَا}» [البقرۃ : ۲۸۶ ] ’’اللہ کسی جان کو تکلیف نہیں دیتا مگر اس کی طاقت کے مطابق۔‘‘ اور فرمایا : «{ فَاتَّقُوا اللّٰهَ مَا اسْتَطَعْتُمْ }» [ التغابن : ۱۶ ] ’’سو اللہ سے ڈرو جتنی طاقت رکھو۔‘‘ مفسرین نے اس سے مراد فرائض لیے ہیں۔ ¤ ➋ عمل کی قبولیت کے لیے دو شرطیں بیان فرمائیں۔ عمل کا صالح ہونا یعنی کتاب و سنت کے مطابق ہونا اور عمل کرنے والے کا صاحب ایمان ہونا۔ نہ کافر کا کوئی عمل قبول ہے اور نہ وہ عمل جو کتاب و سنت سے ثابت نہ ہو۔ دیکھیے سورۂ کہف کی آخری آیت۔ ¤ ➌ {فَلَا يَخٰفُ ظُلْمًا وَّ لَا هَضْمًا :} بے انصافی یہ ہے کہ کسی کو ان گناہوں پر سزا دی جائے جو اس نے نہیں کیے اور حق تلفی یہ ہے کہ کی ہوئی نیکیوں پر پانی پھیر دیا جائے۔ اسی کو سورۂ جن (۱۳) میں {’’ بَخْسًا ‘‘} اور {’’ رَهَقًا ‘‘} سے تعبیر کیا گیا ہے۔ قرآن نے متعدد آیات میں جزا و سزا میں عدل و انصاف کا اعلان کیا ہے، مگر گناہ گار مومنوں کو معاف کر دینا فضل ہے جو عدل کے منافی نہیں۔"
    },
    {
      "ayah": 113,
      "tafsir": "(آیت 113) ➊ { وَ كَذٰلِكَ اَنْزَلْنٰهُ قُرْاٰنًا عَرَبِيًّا :} ’’اسی طرح‘‘ کا اشارہ اس سورت میں مذکور آیات کی طرف ہے کہ ہم نے پورا قرآن ہی ان آیات کی طرح نازل کیا ہے۔{ ’’ قُرْاٰنًا عَرَبِيًّا ‘‘ } کی تفسیر سورۂ یوسف (۲) میں دیکھیے۔ ¤ ➋ {وَ صَرَّفْنَا فِيْهِ مِنَ الْوَعِيْدِ:} یعنی بار بار اور مختلف طریقوں کے ساتھ دنیا اور آخرت میں اپنی گرفت اور عذاب سے ڈرایا ہے۔ ¤ ➌ { لَعَلَّهُمْ يَتَّقُوْنَ … : } تاکہ وہ ڈر جائیں، یا کم از کم یہ ان کے دل میں کسی طرح کی عبرت و نصیحت پیدا کر دے اور وہ سوچیں کہ پچھلی امتوں کا کیا انجام ہوا اگر ہم بھی گناہ کریں گے تو انھی کی طرح تباہ و برباد ہوں گے۔ (ابن کثیر) {’’ ذِكْرًا ‘‘} کی تنوین تنکیر کی وجہ سے ’’کسی طرح کی نصیحت‘‘ ترجمہ کیا ہے۔"
    },
    {
      "ayah": 114,
      "tafsir": "(آیت 114) ➊ {فَتَعٰلَى اللّٰهُ الْمَلِكُ الْحَقُّ …:’’ فَتَعٰلَى ‘‘ ’’عَلاَ يَعْلُوْ عُلُوًّا‘‘} ‘} بلند ہونا۔ باب تفاعل میں تاء اور الف کے اضافے سے معنی میں مبالغہ پیدا ہو گیا ’’پس بہت بلند ہے۔‘‘ {’’ الْمَلِكُ الْحَقُّ ‘‘ ’’حَقَّ يَحِقُّ‘‘} ثابت ہونا۔ لفظ حق باطل کے مقابلے میں آتا ہے۔ اللہ تعالیٰ کی بادشاہی حقیقی، سچی اور پائدار ہے۔ دوسرے تمام بادشاہ دنیا میں نہایت محدود اختیارات کے مالک ہیں اور وہ بھی اللہ تعالیٰ کی مرضی سے، وہ نہ چاہے تو کچھ بھی نہیں کر سکتے اور آخرت میں ان کے وہ اختیار بھی ختم ہو جائیں گے۔ پھر اس میں کیا شک ہے کہ حقیقی بادشاہ اللہ تعالیٰ ہی ہے اور باقی سب باطل ہیں ۔ ¤ سروری زیبا فقط اس ذات بے ہمتا کو ہے ¤ حکمران ہے اک وہی باقی بتانِ آزری ¤ صحیح بخاری (۱۱۲۰) میں تہجد کے لیے اٹھتے وقت رسول اللہ صلی اللہ علیہ وسلم کی ایک لمبی دعا مذکور ہے، اس دعا میں ہے : [ وَلَكَ الْحَمْدُ أَنْتَ الْحَقُّ وَوَعْدُكَ الْحَقُّ، وَلِقَاءُكَ حَقٌّ ] دعاؤں کی کسی کتاب یا اصل صحیح بخاری سے یہ مکمل دعا یاد کر لیں، یہ دعا تہجد کے وقت پڑھنا مسنون اور بے حد برکت کا باعث ہے۔ ¤ ➋ { وَ لَا تَعْجَلْ بِالْقُرْاٰنِ …:} یہ وہی مضمون ہے جو سورۂ قیامہ (۱۶ تا ۱۹) میں بیان ہوا ہے۔ یہاں ایک سوال پیدا ہوتا ہے کہ جب ایک دفعہ جلدی کرنے اور جبریل علیہ السلام کے ساتھ ساتھ پڑھنے سے منع فرما دیا، تو دوبارہ اس حکم کی کیا ضرورت تھی؟ شاہ عبد القادر رحمہ اللہ نے اسے یوں حل فرمایا ہے : ’’جبرئیل جب قرآن لاتے آپ صلی اللہ علیہ وسلم ان کے پڑھنے کے ساتھ پڑھنے لگتے کہ بھول نہ جاویں۔ اس کو پہلے منع فرمایا تھا سورۂ قیامہ میں اور تسلی کر دی تھی کہ اس کا یاد رکھوانا اور لوگوں تک پہنچوانا ذمہ ہمارا ہے، لیکن بندہ بشر ہے، شاید بھول گئے ہوں، پھر تقید کیا اور بھولنے پر مثل فرمائی آدم علیہ السلام کی۔‘‘ (موضح) ¤ ➌ { وَ قُلْ رَّبِّ زِدْنِيْ عِلْمًا :} رسول اللہ صلی اللہ علیہ وسلم کے جبرئیل علیہ السلام کے ساتھ ساتھ جلدی پڑھنے کے پیچھے اصل جذبہ زیادہ سے زیادہ علم کے حصول اور حفظ کا تھا۔ اللہ تعالیٰ نے صرف جلدی کرنے سے منع فرمایا، مگر اصل جذبے کی تعریف کی اور اس کی تکمیل کے لیے دعا سکھائی، جیسا کہ ابوبکرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کو نماز پڑھاتے ہوئے رکوع کی حالت میں پایا تو صف میں ملنے سے پہلے ہی رکوع میں چلے گئے اور پھر اسی حالت میں رکوع میں مل گئے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ زَادَكَ اللّٰهُ حِرْصًا وَلَا تَعُدْ ] [ بخاري، الأذان، باب إذا رکع دون الصف : ۷۸۳ ]’’اللہ تمھاری حرص زیادہ کرے اور دوبارہ ایسا نہ کرنا۔‘‘ دوبارہ ایسی جلدی سے منع کرنے کے ساتھ نیکی میں حرص کی تعریف فرمائی۔ {’’ رَبِّ زِدْنِيْ عِلْمًا ‘‘} میں {’’ عِلْمًا ‘‘‘} عام ہے اور اس سے مراد علم نافع ہے۔ دین یعنی قرآن و حدیث کا علم ہو یا دنیا کا ایسا علم جو دنیا و آخرت دونوں میں نافع ہو، کیونکہ رسول اللہ صلی اللہ علیہ وسلم دعا فرمایا کرتے تھے : [ اَللّٰهُمَّ انْفَعْنِيْ بِمَا عَلَّمْتَنِيْ وَ عَلِّمْنِيْ مَا يَنْفَعُنِيْ وَ زِدْنِيْ عِلْمًا ] [ ترمذي، الدعوات، باب سبق المفردون … : ۳۵۹۹، عن أبي ھریرۃ رضی اللہ عنہ و صححہ الألباني ] ’’اے اللہ ! مجھے اس کے ساتھ نفع دے جس کا تو نے مجھے علم دیا اور مجھے اس کا علم دے جو مجھے نفع دے اور مجھے علم میں زیادہ کر۔‘‘ انس رضی اللہ عنہ فرماتے ہیں کہ نبی صلی اللہ علیہ وسلم کی اکثر دعا یہ تھی : [ اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَّ فِي الْآخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ ] [ بخاري، الدعوات، باب قول النبی صلی اللہ علیہ وسلم : ربنا آتنا… : ۶۳۸۹ ] ’’اے اللہ! اے ہمارے رب! ہمیں دنیا میں بھلائی عطا کر اور آخرت میں بھلائی عطا کر اور ہمیں دوزخ سے بچا۔‘‘ مسلمانوں پر دنیا کی ہر ضرورت کا علم حاصل کرنا فرض کفایہ ہے، تاکہ انھیں غیر مسلموں کا محتاج نہ ہونا پڑے اور وہ دنیا میں اسلام کو غالب رکھ سکیں، مثلاً طب، زراعت، ہیئت، جغرافیہ، ہندسہ، سائنس، اسلحہ سازی وغیرہ۔ رسول اللہ صلی اللہ علیہ وسلم کو جو بھی نئی چیز معلوم ہوتی اس سے جہاد میں فائدہ اٹھایا کرتے تھے، جیسا کہ جنگ احزاب میں خندق تیار فرمائی اور صحابہ اور تابعین مجاہدین نے جنگوں میں منجنیق کا استعمال فرمایا۔ رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں کے بحری جہاد کی خوشخبری دی اور امیر معاویہ رضی اللہ عنہ نے بحری بیڑا تیار کیا، جس کے نتیجے میں بحر روم پر مسلمانوں کا غلبہ ہو گیا اور جدید سے جدید ایجادات اور تدابیر کے نتیجے میں سلطان محمد الفاتح رحمہ اللہ نے قسطنطنیہ کو فتح کیا۔ ظاہر ہے کہ تیس فیصد خشکی پر بھی اسی کی حکومت ہو گی جو ستر فیصد سمندر پر اپنا تسلط منوا سکے۔ داؤد علیہ السلام کو اللہ تعالیٰ نے زرہ سازی کا فن سکھایا اور اسے بطور احسان قرآن مجید میں ذکر فرمایا۔ قرآن مجید میں احکام کی آیات اتنی نہیں جتنی زمین و آسمان، سورج، چاند، بحر و بر، نباتات و جمادات و حیوانات اور اللہ تعالیٰ کی مخلوقات میں غور کرنے کی تاکید والی آیات ہیں۔ مسلمانوں نے اس میں غفلت کی اور کفار نے ان پر محنت کرکے جدید سے جدید ایجادات، مثلاً مشین، موٹر، ریل، ہوائی جہاز، بجلی، بارود، بم، میزائل ، ایٹم، کمپیوٹروغیرہ تیار کرکے مسلمانوں کو اپنا محتاج بلکہ غلام بنا لیا۔ اب مسلمانوں پر لازم ہے کہ ان تمام علوم میں مہارت حاصل کریں جو کفار کے ساتھ جہاد کے لیے ضروری ہیں اور اس طرح یہ سب کچھ علم دنیا ہونے کے باوجود علم آخرت بن جائے گا، کیونککہ یہ اللہ تعالیٰ کے حکم {’’ وَ اَعِدُّوْا لَهُمْ مَّا اسْتَطَعْتُمْ مِّنْ قُوَّةٍ ‘‘} کی تعمیل ہو گی۔ البتہ اس بات کا اہتمام نہایت ضروری ہے کہ یہ علوم سیکھنے والے قرآن و حدیث کے علم سے آراستہ اور یقین و ایمان اور جہاد فی سبیل اللہ کے جذبے سے سرشار ہوں، تاکہ وہ سائنس پڑھتے پڑھتے کفار سے متاثر ہو کر محض دنیا پرست اور ملحد نہ بن جائیں۔ کیونکہ یہ سب کچھ اس وقت مذموم ہو جائے گا جب اس سے مقصود صرف دنیا ہو اور آخرت سے غفلت اختیار کی جائے۔ ایسی صورت میں یہ تمام علوم رکھنے والا اللہ تعالیٰ کے فرمان کے مطابق بے علم ہو گا، جیسا کہ فرمایا : «{ وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ (6) يَعْلَمُوْنَ ظَاهِرًا مِّنَ الْحَيٰوةِ الدُّنْيَا وَ هُمْ عَنِ الْاٰخِرَةِ هُمْ غٰفِلُوْنَ }» [ الروم : ۶، ۷ ] ’’اور لیکن اکثر لوگ نہیں جانتے (علم نہیں رکھتے)۔ وہ دنیا کی زندگی کے ظاہر کا علم رکھتے ہیں اور وہ آخرت سے وہی غافل ہیں۔‘‘ اور فرمایا : «{ فَمِنَ النَّاسِ مَنْ يَّقُوْلُ رَبَّنَاۤ اٰتِنَا فِي الدُّنْيَا وَ مَا لَهٗ فِي الْاٰخِرَةِ مِنْ خَلَاقٍ }» [ البقرۃ : ۲۰۰ ] ’’پھر لوگوں میں سے کوئی تو وہ ہے جو کہتا ہے، اے ہمارے رب! ہمیں دنیا میں دے دے اور آخرت میں اس کا کوئی حصہ نہیں۔‘‘ ان لوگوں کا علم، علم نافع نہیں، اس لیے اس سے پناہ مانگنی چاہیے، جیسا کہ زید بن ارقم رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا کیا کرتے تھے : [ اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عِلْمٍ لَّا يَنْفَعُ وَ مِنْ قَلْبٍ لَّا يَخْشَعُ وَمِنْ نَفْسٍ لَّا تَشْبَعُ وَمِنْ  دَعْوَةٍ لَّا يُسْتَجَابُ لَهَا ] [ مسلم، الذکر و الدعاء، باب في الأدعیۃ : ۲۷۲۲ ] ’’اے اللہ! بے شک میں تیری پناہ چاہتا ہوں ایسے علم سے جو نفع نہ دے اور ایسے دل سے جو خشوع نہ رکھے اور ایسے نفس سے جو سیر نہ ہو اور ایسی دعا سے جو قبول نہ کی جائے۔‘‘"
    },
    {
      "ayah": 115,
      "tafsir": "(آیت 115) ➊ {وَ لَقَدْ عَهِدْنَاۤ اِلٰۤى اٰدَمَ …: ’’ عَهِدَ إِلَيْهِ ‘‘} کا معنی {’’ أَوْصَاهُ ‘‘} ہے کہ اس نے اسے تاکید کی۔ تاکید سے مراد مخصوص درخت کے قریب نہ جانے کا حکم ہے۔ {’’نَسِيَ‘‘} کا معنی عام طور پر ’’وہ بھول گیا‘‘ آتا ہے، مگر یہاں مراد جان بوجھ کر عمل ترک کرنا ہے۔ اس کی دلیل یہ ہے کہ ابلیس نے آدم و حوا علیھما السلام کے دل میں یہ وسوسہ ڈالا اور ان دونوں کے لیے اپنے خیر خواہ ہونے کی قسم کھائی تھی : «{ مَا نَهٰىكُمَا رَبُّكُمَا عَنْ هٰذِهِ الشَّجَرَةِ اِلَّاۤ اَنْ تَكُوْنَا مَلَكَيْنِ اَوْ تَكُوْنَا مِنَ الْخٰلِدِيْنَ}» [ الأعراف : ۲۰ ] ’’تم دونوں کے رب نے تمھیں اس درخت سے منع نہیں کیا مگر اس لیے کہ کہیں تم دونوں فرشتے بن جاؤ یا ہمیشہ رہنے والوں میں سے ہو جاؤ۔‘‘ معلوم ہوا کہ آدم علیہ السلام کو وہ درخت کھاتے وقت اللہ تعالیٰ کا حکم یاد تھا، مگر شیطان کے وسوسے سے لالچ میں آ کر حکم عدولی کر بیٹھے، اس لیے اللہ تعالیٰ نے ان کے فعل کو عصیان (نافرمانی) قرار دیا، فرمایا : «{ وَ عَصٰۤى اٰدَمُ رَبَّهٗ فَغَوٰى }» [ طٰہٰ : ۱۲۱ ] ’’اور آدم نے اپنے رب کی نافرمانی کی تو وہ بھٹک گیا۔‘‘ بھول کر کیے ہوئے عمل کو نافرمانی نہیں کہا جاتا۔ طبری نے حسن سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل فرمایا ہے کہ {’’ فَنَسِيَ يَقُوْلُ فَتَرَكَ‘‘} یعنی {’’ فَنَسِيَ ‘‘} کا معنی ’’اس نے عمل ترک کر دیا‘‘ ہے۔ اس واقعہ کی تفصیل آگے آ رہی ہے۔ ¤ ➋ قرآن میں آدم علیہ السلام کا یہ قصہ چھٹی بار بیان ہو رہا ہے، اول سورۂ بقرہ، دوم اعراف، سوم حجر، چہارم بنی اسرائیل، پنجم کہف اور ششم یہاں اور ہر جگہ ایک خاص مقصد کے تحت مختلف انداز سے اس قصے کو دہرایا گیا ہے۔ یہاں ماقبل سے اس کی مناسبت کے سلسلہ میں چند وجوہ بیان کی گئی ہیں، ان میں سے ایک یہ ہے کہ اس کا تعلق آیت : « كَذٰلِكَ نَقُصُّ عَلَيْكَ مِنْ اَنْۢبَآءِ مَا قَدْ سَبَقَ» [ طٰہٰ : ۹۹ ] (اسی طرح ہم تجھ سے ان چیزوں کی کچھ خبریں بیان کرتے ہیں جو پہلے گزر چکیں) سے ہے، یعنی اس آیت میں اشارہ فرمایا ہے کہ ہم قصے بیان فرمائیں گے، چنانچہ اس کے تحت آدم علیہ السلام کا قصہ بیان فرما دیا۔ ایک مناسبت یہ ہے کہ {’’ رَبِّ زِدْنِيْ عِلْمًا ‘‘} کہنے کا حکم دینے کے بعد آپ صلی اللہ علیہ وسلم کے علم میں اضافے کے لیے آدم علیہ السلام کا قصہ بیان فرمایا اور ایک مناسبت وہ ہے جو اوپر شاہ عبد القادر رحمہ اللہ کی توضیح میں گزر چکی ہے۔"
    },
    {
      "ayah": 116,
      "tafsir": "(آیت 116) { وَ اِذْ قُلْنَا لِلْمَلٰٓىِٕكَةِ۠ اسْجُدُوْا … :} اس کی تفسیر کے لیے دیکھیے سورۂ بقرہ (۳۴ تا ۳۶) اور اعراف (۱۱، ۱۲)۔"
    },
    {
      "ayah": 117,
      "tafsir": "(آیت 117) { فَقُلْنَا يٰۤاٰدَمُ اِنَّ هٰذَا عَدُوٌّ لَّكَ … :} عداوت کا اظہار سجدے سے انکار کے ساتھ ہی ہو گیا تھا۔ مزید تفصیل کے لیے دیکھیے سورۂ اعراف (۲۲) {’’ فَتَشْقٰى ‘‘} تو مصیبت میں پڑ جائے گا، یعنی روزی کے لیے محنت مشقت کرنا پڑے گی اور جنت کی تمام آسائشیں اور نعمتیں چھین لی جائیں گی۔ آدم علیہ السلام کی طرف خاص شقاوت کی نسبت اس لیے ہے کہ مرد کو عورت کا منتظم اور اس کے اخراجات کا ذمہ دار ٹھہرایا گیا ہے۔ اس لیے اصل آدم علیہ السلام ہی ہیں اور حوا علیھا السلام ان کے تابع۔"
    },
    {
      "ayah": 118,
      "tafsir": "(آیت 119،118) ➊ { اِنَّ لَكَ اَلَّا تَجُوْعَ …:} گویا آدم اور حوا علیھما السلام کو بتا دیا گیاا کہ تمھاری تمام بنیادی ضروریات کا یہاں انتظام کر دیا گیا ہے۔ ظاہر ہے کہ انسان کی بنیادی ضرورتیں یہی چار چیزیں ہیں : بھوک دور کرنے کے لیے کھانا، پیاس بجھانے کے لیے پانی، ستر ڈھانپنے کے لیے لباس اور سردی گرمی سے بچنے کے لیے مکان۔ یہ دراصل شقاوت کی تفسیر ہے اور اس شقاوت سے مراد دنیوی شقاوت ہے نہ کہ اخروی۔ شقاوت کی تفصیل کے لیے دیکھیے سورۂ طٰہٰ (۲)۔ ¤ ➋ ان دو آیات میں اللہ تعالیٰ نے بھوک کے بعد پیاس کے بجائے ننگا ہونے کا ذکر کیا اور پیاس کے بعد دھوپ میں جلنے کا ذکر فرمایا۔ اس میں ایک تو آیات کے آخری الفاظ کی مناسبت مقصود ہے اور ایک یہ کہ اگر بھوک، پیاس اور ننگے ہونے اور دھوپ میں جلنے کو اکٹھا ذکر کیا جاتا تو پہلی دونوں اور دوسری دونوں کا مجموعہ ہم شکل ہونے کی وجہ سے ایک ایک نعمت نظر آتا، الگ الگ ذکر کرنے سے چار نعمتیں نمایاں ہو گئیں۔ (قاسمی)"
    },
    {
      "ayah": 119,
      "tafsir": "(آیت 119،118) ➊ { اِنَّ لَكَ اَلَّا تَجُوْعَ …:} گویا آدم اور حوا علیھما السلام کو بتا دیا گیاا کہ تمھاری تمام بنیادی ضروریات کا یہاں انتظام کر دیا گیا ہے۔ ظاہر ہے کہ انسان کی بنیادی ضرورتیں یہی چار چیزیں ہیں : بھوک دور کرنے کے لیے کھانا، پیاس بجھانے کے لیے پانی، ستر ڈھانپنے کے لیے لباس اور سردی گرمی سے بچنے کے لیے مکان۔ یہ دراصل شقاوت کی تفسیر ہے اور اس شقاوت سے مراد دنیوی شقاوت ہے نہ کہ اخروی۔ شقاوت کی تفصیل کے لیے دیکھیے سورۂ طٰہٰ (۲)۔ ¤ ➋ ان دو آیات میں اللہ تعالیٰ نے بھوک کے بعد پیاس کے بجائے ننگا ہونے کا ذکر کیا اور پیاس کے بعد دھوپ میں جلنے کا ذکر فرمایا۔ اس میں ایک تو آیات کے آخری الفاظ کی مناسبت مقصود ہے اور ایک یہ کہ اگر بھوک، پیاس اور ننگے ہونے اور دھوپ میں جلنے کو اکٹھا ذکر کیا جاتا تو پہلی دونوں اور دوسری دونوں کا مجموعہ ہم شکل ہونے کی وجہ سے ایک ایک نعمت نظر آتا، الگ الگ ذکر کرنے سے چار نعمتیں نمایاں ہو گئیں۔ (قاسمی)"
    },
    {
      "ayah": 120,
      "tafsir": "(آیت 121،120) ➊ { فَوَسْوَسَ اِلَيْهِ الشَّيْطٰنُ … :} قرآن میں شیطان کے وسوسہ انداز ہونے اور پھسلانے کی نسبت بعض آیات میں صرف آدم علیہ السلام کی طرف کی گئی ہے اور بعض میں آدم و حوا دونوں کی طرف۔ معلوم ہوتا ہے کہ اصل میں تو شیطان آدم علیہ السلام ہی کے دل میں وسوسہ انداز ہوا ہے، حوا علیھا السلام کا ذکر ان کے تابع ہونے کی حیثیت سے ہے، لہٰذا عوام میں جو یہ بات مشہور ہو گئی ہے کہ شیطان نے پہلے حوا علیھا السلام کو پھسلایا اور پھر ان کے ذریعے سے آدم علیہ السلام کو قابو کیا، وہ قطعی غلط اور لغو ہے اور اسرائیلیات سے ماخوذ ہے۔ دونوں آیات کی تفصیل کے لیے دیکھیے سورۂ اعراف (۲۰، ۲۱)۔ ¤ ➋ {وَ عَصٰۤى اٰدَمُ رَبَّهٗ فَغَوٰى … :} آدم علیہ السلام کا واقعہ نہایت عجیب ہے کہ اتنا عظیم شخص، جسے اللہ تعالیٰ نے اپنے ہاتھوں سے بنایا، فرشتوں سے اس کو سجدہ کروایا، کمال عقل بخشی، اپنی جنت میں ہر نعمت عطا فرمائی، اسے صاف لفظوں میں شیطان کی دشمنی سے آگاہ کر دیا اور دشمن کی بات ماننے پر جنت سے نکلنے کی تنبیہ بھی فرما دی، اتنے عظیم شخص کو اس کے اتنے مہربان پروردگار نے صرف ایک چیز سے منع فرمایا، مگر وہ اپنے رب کی اتنی عنایتوں اور شیطان کی واضح دشمنی کے علم کے باوجود اس کے ورغلانے سے اپنے رب کی حکم عدولی کیسے کر گزرا؟ جو شخص بھی اس واقعہ میں غور و فکر کرے گا اس کا تعجب بڑھتا ہی جائے گا اور آخر کار اس نتیجے پر پہنچے گا کہ اللہ کی تقدیر کو نہ کوئی روک سکتا ہے اور نہ ہٹا سکتا ہے اور یہ کہ دلیل جتنی بھی واضح اور مضبوط ہو اس سے تبھی فائدہ حاصل ہوتا ہے جب اللہ تعالیٰ نے اس کا فیصلہ فرمایا ہو اور اسے مقدر فرمایا ہو۔ (رازی) صحیح بخاری اور صحیح مسلم وغیرہ میں موسیٰ علیہ السلام کے آدم علیہ السلام سے سوال اور ان کے جواب سے بھی یہی بات سمجھ میں آتی ہے۔ اس حدیث سے اگر کوئی یہ استدلال کرے کہ گناہ جب اللہ تعالیٰ نے تقدیر میں لکھ دیا ہے تو ہمارا کیا قصور ہے اور ہمیں ملامت کیوں کی جاتی ہے؟ تو اس کا جواب یہ ہے کہ آدم علیہ السلام نے توبہ قبول ہونے اور گناہ معاف ہونے کے بعد یہ جواب دیا ہے، اس سے پہلے اللہ تعالیٰ نے جب ان سے پوچھا : «{ اَلَمْ اَنْهَكُمَا عَنْ تِلْكُمَا الشَّجَرَةِ }» [ الأعراف : ۲۲ ] کہ کیا میں نے تمھیں اس درخت سے منع نہیں کیا تھا تو انھوں نے نہ تقدیر کا بہانہ بنایا اور نہ اپنا قصور اللہ تعالیٰ کے ذمے لگایا، بلکہ صاف تسلیم کیا : «{ رَبَّنَا ظَلَمْنَاۤ اَنْفُسَنَا وَ اِنْ لَّمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ }» [ الأعراف : ۲۳ ] ’’اے ہمارے رب! ہم نے اپنی جانوں پر ظلم کیا اور اگر تو نے ہمیں نہ بخشا اور ہم پر رحم نہ کیا تو یقینا ہم ضرور خسارہ پانے والوں سے ہو جائیں گے۔‘‘ اس کے برعکس ابلیس نے اپنا گناہ ماننے کے بجائے اسے اللہ تعالیٰ کے ذمے لگا دیا : «{ قَالَ فَبِمَاۤ اَغْوَيْتَنِيْ لَاَقْعُدَنَّ لَهُمْ صِرَاطَكَ الْمُسْتَقِيْمَ }» [ الأعراف : ۱۶ ] ’’اس نے کہا پھر اس وجہ سے کہ تو نے مجھے گمراہ کیا میں ضرور ان کے لیے تیرے سیدھے راستے پر بیٹھوں گا۔‘‘ گناہ کی معافی کے بغیر تقدیر کا عذر غلط ہے۔ ایک اور جواب جو اس سے بھی قوی ہے، یہ ہے کہ موسیٰ علیہ السلام نے آدم علیہ السلام سے یہ نہیں پوچھا تھا کہ آپ نے نافرمانی کیوں کی تھی؟ بلکہ انھوں نے انھیں اپنی اولاد کو جنت سے نکالنے اور مصیبت میں ڈالنے پر ملامت کی تھی، حالانکہ مصیبت پر ملامت نہیں کی جاتی، خواہ وہ کسی غلطی کی وجہ سے آئی ہو، بلکہ تسلی دی جاتی ہے، مثلاً اگر کسی کی غلطی کی وجہ سے کوئی حادثہ ہو جائے تو اسے غلطی پر ملامت کے بجائے مصیبت میں تعزیت کی جاتی ہے کہ اللہ کی تقدیر میں ایسا ہی لکھا تھاا، اس لیے غم مت کرو۔ چنانچہ صحیح مسلم میں ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ اِحْتَجَّ آدَمُ وَ مُوْسٰی، فَقَالَ مُوْسَی يَا آدَمُ ! أَنْتَ أَبُوْنَا، أَنْتَ خَيَّبْتَنَا وَأَخْرَجْتَنَا مِنَ الْجَنَّةِ، فَقَالَ لَهُ آدَمُ أَنْتَ مُوْسَی، اصْطَفَاكَ اللّٰهُ بِكَلَامِهِ، وَخَطَّ لَكَ بِيَدِهِ، أَتَلُوْمُنِیْ عَلٰی أَمْرٍ قَدَّرَهُ اللّٰهُ عَلَيَّ قَبْلَ أَنْ يَخْلُقَنِيْ بِأَرْبَعِيْنَ سَنَةً؟ فَقَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ : فَحَجَّ آدَمُ مُوْسَی، فَحَجَّ آدَممُ مُوْسَی] ’’آدم اور موسیٰ علیھما السلام کی بحث ہو گئی تو موسیٰ علیہ السلام نے کہا، تم ہمارے باپ ہو، تم نے ہمیں نامراد کر دیا اور ہمیں جنت سے نکال دیا۔ ‘‘ تو آدم علیہ السلام نے ان سے کہا : ’’اے موسیٰ! اللہ عز وجل نے تمھیں اپنے کلام کے لیے چنا اور تمھارے لیے اپنے ہاتھ سے (کتاب) لکھی۔ اے موسیٰ! کیا تم مجھے ایک ایسے کام پر ملامت کرتے ہو جو اللہ تعالیٰ نے مجھے پیدا کرنے سے چالیس سال پہلے مجھ پر طے کر دیا تھا۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تو آدم، موسیٰ پر دلیل میں غالب آ گئے، تو آدم، موسیٰ پر دلیل میں غالب آ گئے۔‘‘ [ مسلم، القدر، باب حجاج آدم و موسٰی صلی اللہ علیہما وسلم : ۲۶۵۲ ]"
    },
    {
      "ayah": 121,
      "tafsir": "(آیت 121،120) ➊ { فَوَسْوَسَ اِلَيْهِ الشَّيْطٰنُ … :} قرآن میں شیطان کے وسوسہ انداز ہونے اور پھسلانے کی نسبت بعض آیات میں صرف آدم علیہ السلام کی طرف کی گئی ہے اور بعض میں آدم و حوا دونوں کی طرف۔ معلوم ہوتا ہے کہ اصل میں تو شیطان آدم علیہ السلام ہی کے دل میں وسوسہ انداز ہوا ہے، حوا علیھا السلام کا ذکر ان کے تابع ہونے کی حیثیت سے ہے، لہٰذا عوام میں جو یہ بات مشہور ہو گئی ہے کہ شیطان نے پہلے حوا علیھا السلام کو پھسلایا اور پھر ان کے ذریعے سے آدم علیہ السلام کو قابو کیا، وہ قطعی غلط اور لغو ہے اور اسرائیلیات سے ماخوذ ہے۔ دونوں آیات کی تفصیل کے لیے دیکھیے سورۂ اعراف (۲۰، ۲۱)۔ ¤ ➋ {وَ عَصٰۤى اٰدَمُ رَبَّهٗ فَغَوٰى … :} آدم علیہ السلام کا واقعہ نہایت عجیب ہے کہ اتنا عظیم شخص، جسے اللہ تعالیٰ نے اپنے ہاتھوں سے بنایا، فرشتوں سے اس کو سجدہ کروایا، کمال عقل بخشی، اپنی جنت میں ہر نعمت عطا فرمائی، اسے صاف لفظوں میں شیطان کی دشمنی سے آگاہ کر دیا اور دشمن کی بات ماننے پر جنت سے نکلنے کی تنبیہ بھی فرما دی، اتنے عظیم شخص کو اس کے اتنے مہربان پروردگار نے صرف ایک چیز سے منع فرمایا، مگر وہ اپنے رب کی اتنی عنایتوں اور شیطان کی واضح دشمنی کے علم کے باوجود اس کے ورغلانے سے اپنے رب کی حکم عدولی کیسے کر گزرا؟ جو شخص بھی اس واقعہ میں غور و فکر کرے گا اس کا تعجب بڑھتا ہی جائے گا اور آخر کار اس نتیجے پر پہنچے گا کہ اللہ کی تقدیر کو نہ کوئی روک سکتا ہے اور نہ ہٹا سکتا ہے اور یہ کہ دلیل جتنی بھی واضح اور مضبوط ہو اس سے تبھی فائدہ حاصل ہوتا ہے جب اللہ تعالیٰ نے اس کا فیصلہ فرمایا ہو اور اسے مقدر فرمایا ہو۔ (رازی) صحیح بخاری اور صحیح مسلم وغیرہ میں موسیٰ علیہ السلام کے آدم علیہ السلام سے سوال اور ان کے جواب سے بھی یہی بات سمجھ میں آتی ہے۔ اس حدیث سے اگر کوئی یہ استدلال کرے کہ گناہ جب اللہ تعالیٰ نے تقدیر میں لکھ دیا ہے تو ہمارا کیا قصور ہے اور ہمیں ملامت کیوں کی جاتی ہے؟ تو اس کا جواب یہ ہے کہ آدم علیہ السلام نے توبہ قبول ہونے اور گناہ معاف ہونے کے بعد یہ جواب دیا ہے، اس سے پہلے اللہ تعالیٰ نے جب ان سے پوچھا : «{ اَلَمْ اَنْهَكُمَا عَنْ تِلْكُمَا الشَّجَرَةِ }» [ الأعراف : ۲۲ ] کہ کیا میں نے تمھیں اس درخت سے منع نہیں کیا تھا تو انھوں نے نہ تقدیر کا بہانہ بنایا اور نہ اپنا قصور اللہ تعالیٰ کے ذمے لگایا، بلکہ صاف تسلیم کیا : «{ رَبَّنَا ظَلَمْنَاۤ اَنْفُسَنَا وَ اِنْ لَّمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ }» [ الأعراف : ۲۳ ] ’’اے ہمارے رب! ہم نے اپنی جانوں پر ظلم کیا اور اگر تو نے ہمیں نہ بخشا اور ہم پر رحم نہ کیا تو یقینا ہم ضرور خسارہ پانے والوں سے ہو جائیں گے۔‘‘ اس کے برعکس ابلیس نے اپنا گناہ ماننے کے بجائے اسے اللہ تعالیٰ کے ذمے لگا دیا : «{ قَالَ فَبِمَاۤ اَغْوَيْتَنِيْ لَاَقْعُدَنَّ لَهُمْ صِرَاطَكَ الْمُسْتَقِيْمَ }» [ الأعراف : ۱۶ ] ’’اس نے کہا پھر اس وجہ سے کہ تو نے مجھے گمراہ کیا میں ضرور ان کے لیے تیرے سیدھے راستے پر بیٹھوں گا۔‘‘ گناہ کی معافی کے بغیر تقدیر کا عذر غلط ہے۔ ایک اور جواب جو اس سے بھی قوی ہے، یہ ہے کہ موسیٰ علیہ السلام نے آدم علیہ السلام سے یہ نہیں پوچھا تھا کہ آپ نے نافرمانی کیوں کی تھی؟ بلکہ انھوں نے انھیں اپنی اولاد کو جنت سے نکالنے اور مصیبت میں ڈالنے پر ملامت کی تھی، حالانکہ مصیبت پر ملامت نہیں کی جاتی، خواہ وہ کسی غلطی کی وجہ سے آئی ہو، بلکہ تسلی دی جاتی ہے، مثلاً اگر کسی کی غلطی کی وجہ سے کوئی حادثہ ہو جائے تو اسے غلطی پر ملامت کے بجائے مصیبت میں تعزیت کی جاتی ہے کہ اللہ کی تقدیر میں ایسا ہی لکھا تھاا، اس لیے غم مت کرو۔ چنانچہ صحیح مسلم میں ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ اِحْتَجَّ آدَمُ وَ مُوْسٰی، فَقَالَ مُوْسَی يَا آدَمُ ! أَنْتَ أَبُوْنَا، أَنْتَ خَيَّبْتَنَا وَأَخْرَجْتَنَا مِنَ الْجَنَّةِ، فَقَالَ لَهُ آدَمُ أَنْتَ مُوْسَی، اصْطَفَاكَ اللّٰهُ بِكَلَامِهِ، وَخَطَّ لَكَ بِيَدِهِ، أَتَلُوْمُنِیْ عَلٰی أَمْرٍ قَدَّرَهُ اللّٰهُ عَلَيَّ قَبْلَ أَنْ يَخْلُقَنِيْ بِأَرْبَعِيْنَ سَنَةً؟ فَقَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ : فَحَجَّ آدَمُ مُوْسَی، فَحَجَّ آدَممُ مُوْسَی] ’’آدم اور موسیٰ علیھما السلام کی بحث ہو گئی تو موسیٰ علیہ السلام نے کہا، تم ہمارے باپ ہو، تم نے ہمیں نامراد کر دیا اور ہمیں جنت سے نکال دیا۔ ‘‘ تو آدم علیہ السلام نے ان سے کہا : ’’اے موسیٰ! اللہ عز وجل نے تمھیں اپنے کلام کے لیے چنا اور تمھارے لیے اپنے ہاتھ سے (کتاب) لکھی۔ اے موسیٰ! کیا تم مجھے ایک ایسے کام پر ملامت کرتے ہو جو اللہ تعالیٰ نے مجھے پیدا کرنے سے چالیس سال پہلے مجھ پر طے کر دیا تھا۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تو آدم، موسیٰ پر دلیل میں غالب آ گئے، تو آدم، موسیٰ پر دلیل میں غالب آ گئے۔‘‘ [ مسلم، القدر، باب حجاج آدم و موسٰی صلی اللہ علیہما وسلم : ۲۶۵۲ ]"
    },
    {
      "ayah": 122,
      "tafsir": "(آیت 122) ➊ { ثُمَّ اجْتَبٰهُ رَبُّهٗ: ’’جَبَي يَجْبِيْ‘‘} (ض) کا معنی کھینچ کر لانا ہے، جیسا کہ فرمایا : «{ اَوَ لَمْ نُمَكِّنْ لَّهُمْ حَرَمًا اٰمِنًا يُّجْبٰۤى اِلَيْهِ ثَمَرٰتُ كُلِّ شَيْءٍ }» [ القصص : ۵۷ ] ’’اور کیا ہم نے انھیں ایک باامن حرم میں جگہ نہیں دی؟ جس کی طرف ہر چیز کے پھل کھینچ کر لائے جاتے ہیں۔‘‘ {’’اِجْتَبَي‘‘} (افتعال) کا معنی کسی چیز کو اپنے لیے لے لینا، چن لینا ہے۔ اللہ تعالیٰ کے آدم علیہ السلام کو اپنے لیے کھینچ لینے اور چن لینے کا مطلب یہ ہے کہ ان کے دل دل میں توبہ کا خیال ڈالا، انھیں توبہ کی توفیق دی اور توبہ کے کلمات کی تعلیم دی، جیسا کہ فرمایا : « فَتَلَقّٰۤى اٰدَمُ مِنْ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَيْهِ» [ البقرۃ : ۳۷ ] ’’پھر آدم نے اپنے رب سے چند کلمات سیکھ لیے تو اس نے اس کی توبہ قبول فرما لی۔‘‘ قرآن کے مطابق وہ کلمات یہ تھے : «{ رَبَّنَا ظَلَمْنَاۤ اَنْفُسَنَا وَ اِنْ لَّمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ }» [ الأعراف : ۲۳ ] {’’ اجْتَبٰهُ رَبُّهٗ ‘‘} میں لفظ {’’ رَبُّهٗ ‘‘} اس چننے کے سبب کی طرف اشارہ کر رہا ہے۔ ¤ ➋ { فَتَابَ عَلَيْهِ وَ هَدٰى :} یعنی اس کی توبہ قبول فرمائی اور ہدایت دی، یعنی صراط مستقیم پر گامزن کر دیا اور اس پر ثابت قدمی عطا فرمائی۔ ابن عاشور نے لکھا ہے کہ قرآن مجید میں جہاں {’’اِجْتِبَاء‘‘} اور ’’ہدایت‘‘ کے الفاظ اکٹھے آئیں وہاں نببوت عطا کرنا مراد ہوتا ہے، جیسا کہ فرمایا : «{ وَ اجْتَبَيْنٰهُمْ وَ هَدَيْنٰهُمْ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ }» [ الأنعام : ۸۷ ] اور فرمایا : «{ اِجْتَبٰىهُ وَ هَدٰىهُ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ }» [ النحل : ۱۲۱ ] اور تیسری آیت یہ ہے۔ ¤ ➌ آدم علیہ السلام کا گناہ توبہ و استغفار کی وجہ سے ان کے لیے پہلے سے بھی زیادہ بلند مقام کا ذریعہ بن گیا۔ اس سے اللہ تعالیٰ کی حکمت ظاہر ہوتی ہے کہ اس نے انبیاء سے غلطی کا صادر ہونا ناممکن کیوں نہیں بنا دیا اور وہ ہے رسول کا غلطی سرزد ہونے کے بعد توبہ و استغفار میں اپنی امت کے لیے اسوہ اور نمونہ بننا۔ کیونکہ غلطی کے بعد والی ندامت، آہ و زاری، آئندہ نہ کرنے کا عزم اور پچھلی غلطی پر دن رات استغفار اللہ تعالیٰ کو اس قدر پسند ہے کہ اگر انسان سے غلطی نہ ہو، جس کے بعد وہ توبہ و استغفار کرے، تو اللہ تعالیٰ بنی آدم کی صف لپیٹ کر گناہ کرنے والی کوئی اور قوم لے آئے، جوگناہ کرے، پھر استغفار کرے اور اللہ تعالیٰ انھیں معاف فرمائے۔ [ مسلم، التوبۃ، باب سقوط الذنوب بالاستغفار والتوبۃ : ۲۷۴۹، عن أبي ھریرۃ رضی اللہ عنہ ] پھر اس مہربان رب کی رحمت اور لطف و کرم کی کیا حد ہے جو توبہ کے بعد پہلے گناہوں کو بھی نیکیوں میں بدل دیتا ہے۔ دیکھیے سورۂ فرقان (۷۰) اللہ تعالیٰ ہم گناہ گاروں کو بھی ایسی ہی توبہ کرنے والوں میں شامل فرما لے۔ (آمین) ¤ ➍ درخت میں سے کھانے کے بعد یہاں توبہ قبول کرنے کا ذکر پہلے ہے اور زمین پر اترنے کا حکم بعد میں، حالانکہ اصل ترتیب یہ تھی کہ درخت میں سے کھاتے ہی انھیں جنت سے نکال دیا گیا، مگر یہاں آدم علیہ السلام کی توبہ کا قبول ہونا اور نبوت عطا ہونا پہلے اس لیے ذکر فرمایا کہ سننے والوں کو آدم علیہ السلام کا انجام معلوم ہو جائے کہ وہ کس قدر اچھا ہوا۔"
    },
    {
      "ayah": 123,
      "tafsir": "(آیت 123) ➊ { قَالَ اهْبِطَا مِنْهَا جَمِيْعًۢا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ :} اس کی تفسیر سورۂ بقرہ کی آیت (۳۶) میں دیکھیے، یعنی توبہ قبول ہونے کے باوجود زمین پر رہنے کا فیصلہ قائم رہا، کیونکہ انھیں پیدا ہی زمین کی خلافت کے لیے کیا گیا تھا۔ ¤ ➋ {فَمَنِ اتَّبَعَ هُدَايَ … :} سورۂ بقرہ (۳۸) میں {’’ فَمَنْ تَبِعَ هُدَايَ ‘‘ } ہے، یعنی جس نے میری ہدایت کی پیروی کی اور یہاں {’’اتَّبَعَ‘‘} (افتعال) ہے، اس میں حروف زیادہ ہونے کی وجہ سے تکلف اور مبالغہ ہے، یعنی جس نے میری ہدایت کی پوری طرح پیروی کی تو وہ نہ دنیا میں جنت کے راستے سے بھٹکے گا اور نہ آخرت میں جنت سے محروم رہ کر بدنصیب ہو گا، بلکہ سیدھا چلتا ہوا اپنے گھر جنت میں پہنچ جائے گا۔ ابن عباس رضی اللہ عنھما نے فرمایا : [ ضَمِنَ اللّٰهُ لِمَنْ قَرَأَ الْقُرْآنَ أَلاَّ يَضِلَّ فِی الدُّنْيَا وَلاَ يَشْقٰی فِی الْآخِرَةِةِ ثُمَّ تَلاَ : «{ فَمَنِ اتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَ لَا  يَشْقٰى} » ] [ مصنف ابن أبي شیبۃ : 467/10، ح : ۳۰۵۷۵۔ مستدرک حاکم : 381/2، ح : ۳۴۳۸ و صححہ ووافقہ الذھبی ]’’جو شخص قرآن کی پیروی کرے اللہ تعالیٰ اس کا ضامن ہے کہ وہ نہ دنیا میں گمراہ ہو گا اور نہ آخرت میں بد نصیبب۔‘‘ پھر آپ نے یہ آیت پڑھی : ’’ تو جو میری ہدایت کے پیچھے چلا تو وہ نہ گمراہ ہو گا اور نہ مصیبت میں پڑے گا۔‘‘ معلوم ہوا ہدایت وہی ہے جو اللہ کی طرف سے آئے، اللہ تعالیٰ نے ہدایت خود بھیجنے کا وعدہ کیا اور اسے پورا فرمایا ہے۔ اللہ کے سوا کسی کی رہنمائی منزل پر نہیں پہنچا سکتی، خواہ کوئی عالم ہو یا درویش، انسان ہو یا جن یا کوئی اور، اللہ کی کتاب کے مطابق زندگی گزارنا دنیا وآخرت دونوں میں کامیاب زندگی کا ضامن ہے، فرمایا : «{ مَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُنْثٰى وَ هُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهٗ حَيٰوةً طَيِّبَةً وَ لَنَجْزِيَنَّهُمْ اَجْرَهُمْ بِاَحْسَنِ مَا كَانُوْا يَعْمَلُوْنَ }» [ النحل : ۹۷ ] ’’جو بھی نیک عمل کرے، مرد ہو یا عورت اور وہ مومن ہو تو یقینا ہم اسے ضرور زندگی بخشیں گے، پاکیزہ زندگی اور یقینا ہم انھیں ان کا اجر ضرور بدلے میں دیں گے، ان بہترین اعمال کے مطابق جو وہ کرتے تھے۔‘‘"
    },
    {
      "ayah": 124,
      "tafsir": "(آیت 124) ➊ {وَ مَنْ اَعْرَضَ عَنْ ذِكْرِيْ :} ذکر سے مراد اللہ تعالیٰ کی طرف سے نازل ہونے والی نصیحت ہے، جیسا کہ فرمایا : «{ اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَ اِنَّا لَهٗ لَحٰفِظُوْنَ }» [ الحجر : ۹ ] ’’بے شک ہم، ہم نے ہی یہ ذکر یعنی نصیحت نازل کی ہے اور بے شک ہم اس کی ضرور حفاظت کرنے والے ہیں۔‘‘ ¤ ➋ {فَاِنَّ لَهٗ مَعِيْشَةً ضَنْكًا : ’’ مَعِيْشَةً ‘‘} زندگی، وہ چیزیں جن پر زندگی گزرتی ہے، مثلاً کھانا پینا اور دوسری ضروریات۔ (قاموس) {’’ ضَنْكًا ‘‘ ’’ ضَنُكَ يَضْنُكُ ضَنْكًا وَضُنَاكًا وَ ضَنَاكَةً ‘‘} مصدر بمعنی اسم فاعل ہے، اس لیے {’’ مَعِيْشَةً ‘‘} کی صفت ہونے کے باوجود لفظ میں تبدیلی نہیں ہوئی، یہ واحد و جمع اور مذکر و مؤنث سب کے لیے ایک ہی رہتا ہے، یعنی وہ تنگی والی زندگی گزارے گا۔ اس کی تفسیر رسول اللہ صلی اللہ علیہ وسلم سے مروی ہے، اس لیے وہ سب سے راجح ہے۔ صحیح ابن حبان میں ہے کہ ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اللہ عزو جل کے اس قول {’’ فَاِنَّ لَهٗ مَعِيْشَةً ضَنْكًا ‘‘} کے متعلق روایت کیا، آپ نے فرمایا : ({عَذَابُ الْقَبْرِ } ) ’’(مراد) عذاب قبر ہے۔‘‘ {’’ اَلتَّفْسِيْرُ الصَّحِيْحُ الْمَسْبُوْرُ ‘‘} میں اسے الاحسان (۳۱۱۹)، مستدرک حاکم (۱؍۳۸۱، ح : ۱۴۰۵) اور کئی کتابوں سے نقل کیا گیا ہے اور مختلف ائمہ سے اس کا حسن، جید یا صحیح ہونا بھی نقل کیا گیا ہے۔ امام طبری نے ابن عباس رضی اللہ عنھما سے حسن سند کے ساتھ اس کی تفسیر ’’الشقاء‘‘ فرمائی ہے۔ ’’الشقاء‘‘ کی تفسیر کے لیے دیکھیے سورۂ طہ (۲) {’’ مَعِيْشَةً ضَنْكًا ‘‘} کے الفاظ میں دنیا اور قبر دونوں کی تنگ زندگی شامل ہے۔ اللہ کی نصیحت سے منہ موڑنے والا شخص اللہ پر توکل اور اس کے عطا کردہ پر قناعت سے محرومی کی وجہ سے ہر وقت زیادہ سے زیادہ مال و جاہ کی ہوس میں مبتلا رہتا ہے۔ مال کی دو وادیاں ملنے پر تیسری کی تلاش میں چل نکلتا ہے۔ باؤلے کتے کی پیاس کی طرح اس کی حرص ختم نہیں ہوتی۔ اربوں کھربوں کا مالک ہونے کے باوجود فقیر ہوتا ہے، حرص اور بخل کی کمینگی کی وجہ سے اسے کسی کی دلی محبت حاصل نہیں رہتی۔ اموال و اولاد اس کے لیے راحت بننے کے بجائے اللہ کی طرف سے عذاب بن جاتے ہیں۔ دیکھیے سورۂ توبہ (۵۵، ۸۵) پھر وہ وقت آ جاتا ہے کہ اسے گولیوں کے بغیر نیند نہیں آتی اور ہر آسائش حاصل ہوتے ہوئے بھی اسے اس رنج و الم سے بھری ہوئی زندگی سے چھٹکارے کی کوئی صورت خود کشی کے سوا نظر نہیں آتی۔ یقین نہ ہو تو جاپان، سویڈن، ناروے وغیرہ میں خود کشی کا تناسب دیکھ لیں۔ ¤ ➌ { وَ نَحْشُرُهٗ يَوْمَ الْقِيٰمَةِ اَعْمٰى :} دنیا میں اللہ تعالیٰ کی آیات سے کان اور آنکھیں بند کر لینے اور حق کو تسلیم نہ کرنے کی پاداش میں قیامت کے دن اسے اندھا، گونگا اور بہرا کرکے اٹھایا جائے گا۔ (بنی اسرائیل : ۹۷) قیامت کا دن پچاس ہزار سال کا ہے۔ دیکھیے سورۂ معارج (۴) اس کے مختلف اوقات میں لوگوں کے احوال مختلف ہوں گے۔ قبر سے اٹھتے وقت وہ اندھا ہو گا، پھر جہنم کی ہولناکی اور اہل ایمان کی عزت دکھانے کے لیے بینا کر دیا جائے گا۔ دیکھیے سورۂ طور (۱۴، ۱۵) اور سورۂ مریم (۳۸)۔"
    },
    {
      "ayah": 125,
      "tafsir": ""
    },
    {
      "ayah": 126,
      "tafsir": "(آیت 126) ➊ {قَالَ كَذٰلِكَ اَتَتْكَ …: ’’ كَذٰلِكَ ‘‘} (اسی طرح) سے مراد ’’اندھا ہونا‘‘ ہے، جسس کا ذکر سوال میں ہے کہ پروردگارا! تو نے مجھے اندھا کیوں اٹھایا؟ جواب ملے گا : «{قَالَ كَذٰلِكَ اَتَتْكَ اٰيٰتُنَا فَنَسِيْتَهَا}» کہ اسی طرح تیرے پاس ہماری آیات آئیں تو تو انھیں بھول گیا۔ دونوں آیتوں کے الفاظ سے ظاہر ہے کہ ایک لمبی بات کو اس طرح مختصر کیا گیا ہے کہ حذف شدہ الفاظ خود بخود سمجھ میں آ رہے ہیں۔ سوال میں اندھے ہونے کا ذکر ہے، جواب میں بھلانے کا ذکر ہے۔ یہ اختصار تین جگہوں پر ہے، پہلا اختصار {’’ وَ نَحْشُرُهٗ يَوْمَ الْقِيٰمَةِ اَعْمٰى ({وَ نَنْسَااهُ}) ‘‘} ’’ہم قیامت کے دن اسے اندھا کر کے اٹھائیں گے (اور اسے بھلا دیں گے)‘‘ دوسرا اور تیسرا اختصار {’’ قَالَ كَذٰلِكَ اَتَتْكَ اٰيٰتُنَا فَنَسِيْتَهَا ( {وَ عَمِيْتَ عَنْهَا} ) وَ كَذٰلِكَ الْيَوْمَ ( {وَ تُحْشَرُ أَعْمٰي} ) “} ’’وہ فرمائے گا، اسی طرح تیرے پاس ہماری آیات آئیں تو تو انھیں بھول گیا (اور ان سے اندھا بن گیا) اور اسی طرح آج تو بھلایا جائے گا (اور اندھا کرکے اٹھایا جائے گا)۔‘‘ اسے بلاغت کی اصطلاح میں {’’ اِحْتِبَاكٌ ‘‘} کہتے ہیں۔ (ابن عاشور) ¤ ➋ واضح رہے کہ آیات کو بھلانے سے مراد یہاں ان پر ایمان نہ لانا اور عمل نہ کرنا ہے، حفظ کرنے کے بعد بھول جانا مراد نہیں۔ اس کی دلیل اگلی آیت ہے : « {وَ كَذٰلِكَ نَجْزِيْ مَنْ اَسْرَفَ وَ لَمْ يُؤْمِنْۢ بِاٰيٰتِ رَبِّهٖ} » [ طٰہٰ : ۱۲۷ ] ’’اور اسی طرح ہم اس شخص کو جزا دیتے ہیں جو حد سے گزرے اور اپنے رب کی آیات پر ایمان نہ لائے۔‘‘ ایمان لانے والا شخص جو حفظ کے بعد کسی بیماری یا مصروفیت کی وجہ سے کچھ آیات بھول جائے وہ اس میں داخل نہیں ہے۔ ¤ ➌ قرآن یاد کرنے کے بعد بھول جانے پر وعید کی کوئی حدیث رسول اللہ صلی اللہ علیہ وسلم سے ثابت نہیں۔ چند ضعیف روایات درج ذیل ہیں : (1) مسند احمد (۵؍۲۸۵، ح : ۲۲۵۲۴) میں سعد بن عبادہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَمَا مِنْ رَجُلٍ قَرَأَ الْقُرْآنَ فَنَسِيَهٗ إِلاَّ لَقِيَ اللّٰهَ يَوْمَ يَلْقَاهٗ وَهُوَ أَجْذَمُ ] ’’اور کوئی بھی شخص جو قرآن پڑھے پھر اسے بھول جائائے وہ اللہ تعالیٰ سے جس دن ملے گا تو اس حال میں ملے گا کہ کوڑھی ہو گا۔‘‘ اس کی ایک سند میں عیسیٰ بن فائد مجہول راوی ہے، اس کا شیخ بھی مجہول ہے۔ دوسری سند میں بھی عیسیٰ بن فائد مجہول ہے۔ (2) سنن ابو داؤد (۴۶۱) اور ترمذی (۲۹۱۶) میں انس بن مالک رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ عُرِضَتْ عَلَيَّ أَجُوْرُ أُمَّتِيْ حَتَّی الْقَذَاةُ يُخْرِجُهَا الرَّجُلُ مِنَ الْمَسْجِدِ وَعُرِضَتْ عَلَيَّ ذُنُوْبُ أُمَّتِيْ فَلَمْ أَرَ ذَنْبًا أَعْظَمَ مِنْ سُوْرَةٍ مِنَ الْقُرْآنِ أُوْتِيَهَا رَجُلٌ ثُمَّ نَسِيَهَا ] ’’میرے سامنے میری امت کے اجر پیش کیے گئے، یہاں تک کہ وہ تنکا بھی جسے آدمی مسجد سے نکالے اور میرے سامنے میری امت کے گناہ پیش کیے گئے، تو میں نے اس سے بڑا کوئی گناہ نہیں دیکھا کہ کسی آدمی کو قرآن کی کوئی سورت یا آیت عطا کی گئی پھر اس نے اسے بھلا دیا۔‘‘ شیخ ناصر الدین البانی رحمہ اللہ نے فرمایا کہ اس کی سند ضعیف ہے، کیونکہ ابن جریج اور مطلب بن عبد اللہ دونوں مدلس ہیں اور اسے ’’عن‘‘ کے لفظ سے روایت کرتے ہیں اور بخاری اور ترمذی نے اسے ضعیف قرار دیا۔ تفصیل کے لیے دیکھیں ضعیف ابی داؤد (۷۱)۔ ¤ ➍ ضعیف اور موضوع روایات نے امت کو کس قدر نقصان پہنچایا اس کا اندازہ نہیں ہو سکتا۔ میں نے بہت سے مردوں اور عورتوں کو دیکھا کہ وہ ان روایات ہی کی وجہ سے قرآن حفظ کرنے سے محروم رہے، حالانکہ یہ بات صاف ظاہر ہے کہ جسے کسی مصروفیت یا بیماری یا غفلت کی وجہ سے قرآن بھول جائے وہ اس شخص سے ہزار گنا بہتر ہے جس نے قرآن پڑھا ہی نہیں، یا یاد ہی نہیں کیا، کیونکہ وہ اس سے تو ہر حال میں قرآن کا علم زیادہ رکھتا ہے اور اللہ تعالیٰ غفور و رحیم ہے۔ اسے سب سے بڑے گناہ شرک کے قائم مقام قرار دینا یا کوڑھی ہونے کا باعث قرار دینا راویوں کی جہالت اور تدلیس ہی کا کارنامہ ہے۔"
    },
    {
      "ayah": 127,
      "tafsir": "(آیت 127) ➊ {وَ كَذٰلِكَ نَجْزِيْ … :} یعنی اسی طرح ہر ایک مجرم کو اس کے جرم کے موافق جزا دی جائے گی۔ ¤ ➋ { مَنْ اَسْرَفَ … :} حد سے گزرنے والا سب سے بڑھ کر وہ ہے جو اللہ تعالیٰ کی ذات یا صفات میں کسی کو اس کا شریک ٹھہرائے، پھر وہ ہے جو عبودیت (بندگی) کے مقام سے بڑھ کر اتنا بڑا (متکبر) بنے کہ اپنی خواہش نفس کے پیچھے لگ کر اپنے خالق و مالک کی کوئی بات نہ مانے۔ ¤ ➌ {وَ لَعَذَابُ الْاٰخِرَةِ … :} یعنی اگرچہ دنیا اور قبر کی تنگی والی زندگی اور محشر میں اندھا کرکے اٹھایا جانا اور قیامت کے دن اللہ تعالیٰ کا فراموش کر دینا، ان میں سے ہر ایک بہت بڑا عذاب ہے، مگر آخرت یعنی سب سے آخری مرحلے کا عذاب (جہنم) سب سے زیادہ سخت اور سب سے زیادہ باقی رہنے والا ہے۔ سخت اتنا کہ اس کی آگ دنیا کی آگ سے ستر گنا تیز اور باقی رہنے والا ایسا کہ جہنمی اس سے خلاصی کے لیے موت کی تمنا کریں گے، مگر موت ذبح کی جا چکی ہو گی، اسی لیے فرمایا : «{ لَا يَمُوْتُ فِيْهَا وَ لَا يَحْيٰى }» [ طٰہٰ : ۷۴ ] ’’نہ وہ اس میں مرے گا اور نہ جیے گا۔‘‘ جہنم سے ان کے نکلنے کی کوئی صورت نہ ہو گی۔"
    },
    {
      "ayah": 128,
      "tafsir": "(آیت 128) ➊ { اَفَلَمْ يَهْدِ لَهُمْ …:’’هَدٰي يَهْدِيْ‘‘} راہنمائی کرنا۔ {’’ الْقُرُوْنِ ‘‘ ’’قَرْنٌ‘‘} کی جمع ہے۔ قرن کا معنی متعین کرنے کے لیے رسول اللہ صلی اللہ علیہ وسلم کا فرمان سب سے زیادہ معتبر ہے، جو آپ نے عبد اللہ بن بسر رضی اللہ عنہ کے متعلق فرمایا، آپ نے فرمایا : [ يَعِيْشُ هٰذَا الْغُلَامُ قَرْنًا، فَعَاشَ مِائَةَ سَنَةٍ ] [ سلسلۃ الأحادیث الصحیحۃ : 159/6، ح : ۲۶۶۰ ] ’’یہ لڑکا ایک قرن زندہ رہے گا‘‘ تو وہ سو سال زندہ رہے۔‘‘ سلسلہ صحیحہ کی اس روایت میں ابن عساکر کے حوالے سے مزید یہ ہے کہ عبد اللہ بن بسر رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کی : ’’یا رسول اللہ! میرے ماں باپ قربان! قرن کتنا ہوتا ہے؟‘‘ فرمایا : ’’سو سال۔‘‘ عبد اللہ بن بسر رضی اللہ عنہ نے فرمایا کہ میں پچانوے برس جی چکا ہوں اور رسول اللہ صلی اللہ علیہ وسلم کی بات پوری ہونے میں پانچ برس رہ گئے ہیں۔ محمد بن قاسم کہتے ہیں کہ ہم نے بعد میں پانچ سال گنے، پھر وہ فوت ہو گئے۔ ¤ ➋ قرون سے مراد عاد و ثمود ہیں، کیونکہ عرب لوگ یمن، نجران اور اس کے گرد و نواح کی طرف جاتے ہوئے قوم عاد کے رہنے کی جگہوں سے گزرتے تھے۔ نبی کریم صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنھم تبوک کے سفر میں ثمود کے مکانات سے گزرے تھے۔ اسی طرح ان سفروں میں قوم لوط اور اہل مدین کی تباہ شدہ بستیاں سب سے بڑی شاہراہ پر واقع تھیں، جہاں سے وہ صبح و شام گزرتے تھے۔ دیکھیے سورۂ حجر (۷۶ تا ۷۹) اور صافات (۳۳ تا ۳۸)۔ ¤ ➌ اس سورت میں پیغمبروں کو جھٹلانے والے لوگوں کا اور ان کے بدترین انجام کا ذکر گزر چکا ہے۔ حق یہ تھا کہ اہل عرب تاریخ سے سبق حاصل کرتے اور کفر و شرک سے باز آ جاتے، مگر وہ اپنی سرکشی پر جمے رہے۔ اس لیے بطور تعجب فرمایا کہ کیا اس بات نے ان کی رہنمائی نہیں کی کہ ہم نے ان سے پہلے کتنی ہی قوموں کو ہلاک کر ڈالا، جن کے رہنے کی جگہوں میں یہ چلتے پھرتے ہیں اور جنھیں دیکھنے سے صاف نظر آتا ہے کہ وہ لوگ قد و قامت، صنعت و زراعت اور قوت و مہارت میں ان سے بہت زیادہ ترقی یافتہ تھے۔ مدائن صالح، اہرام مصر اور دوسرے آثار قدیمہ شاہد ہیں کہ اس قوت کے لوگ پھر پیدا نہیں ہوئے۔ دیکھیے سورۂ فجر (۶ تا ۱۴) اور سورۂ روم (۹، ۱۰) ان لوگوں کے آثار آنکھوں سے دیکھ کر اور اپنے آبا و اجداد سے تواتر کے ساتھ ان کی قوت و ہیبت اور عذابِ الٰہی سے بربادی کے واقعات سن کر بھی کیا ان کی سمجھ میں نہیں آتا کہ اگر یہ لوگ بھی ان کی روش پر اڑے رہے تو ان کا انجام کیا ہو گا؟ ¤ ➍ {اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّاُولِي النُّهٰى : ’’ النُّهٰى ‘‘} کی تفسیر اسی سورت کی آیت (۵۴) میں دیکھیے۔ {’’ النُّهٰى ‘‘} جمع ہونے کی وجہ سے ترجمہ ’’عقلوں والے‘‘ کیا ہے اور {’’ لَاٰيٰتٍ ‘‘} پر تنوین تعظیم کی وجہ سے ترجمہ ’’کئی عظیم نشانیاں‘‘ کیا ہے۔"
    },
    {
      "ayah": 129,
      "tafsir": "(آیت 129) ➊ {وَ لَوْ لَا كَلِمَةٌ سَبَقَتْ …:} اصل میں {’’ وَلَوْلاَ كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ وَأَجَلٌ مُّسَمًّي لَكَانَ ({الْعَذَابُ}) لِزَاامًا‘‘} ہے، فواصل (آیات کے آخری حروف) کی مطابقت کے لیے {’’ وَ اَجَلٌ مُّسَمًّى ‘‘} کو مؤخر کر دیا گیا۔ ¤ ➋ {’’ لِزَامًا ‘‘} بروزن {’’قِتَالٌ‘‘} باب مفاعلہ کا مصدر ہے اور اسم فاعل کے معنی میں برائے مبالغہ ہے، لازم ہونے والا۔ ¤ ➌ {’’ لَكَانَ ‘‘} میں ضمیر {’’هُوَ‘‘} اس کا اسم ہے جو پچھلی آیات کے مضمون {’’الْعَذَابُ‘‘} (وہی عذاب) کی طرف لوٹ رہی ہے۔ ¤ ➍ جب پہلی قوموں کی ہلاکت کا ذکر فرمایا تو سوال پیدا ہوا کہ اب ان جھٹلانے والوں کو کیوں ہلاک نہیں کیا جا رہا؟ فرمایا کہ اس کے دو سبب ہیں، ایک تو وہ بات جو رب تعالیٰ کی طرف سے پہلے طے ہو چکی اور دوسرا وہ وقت جو مقرر ہو چکا۔ پہلے طے شدہ بات سے مراد اللہ تعالیٰ کی رحمت کا اس کے غضب پر غالب ہونا ہے، جیسا کہ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَمَّا خَلَقَ اللّٰهُ الْخَلْقَ كَتَبَ فِيْ كِتَابِهٖ وَ هُوَ يَكْتُبُ عَلٰی نَفْسِهٖ وَهُوَ وَضْعٌ عِنْدَهٗ عَلَی الْعَرْشِ اِنَّ رَحْمَتِيْ تَغْلِبُ غَضَبِيْ ] [ بخاري، التوحید، باب قول اللہ : «ویحذرکم اللہ نفسہ» : ۷۴۰۴ ] ’’جب اللہ تعالیٰ نے مخلوق پیدا فرمائی تو اپنے آپ پر یہ بات لکھ دی، اور وہ خود ہی اپنپنے آپ پر لکھتا ہے، اور اسے اپنے پاس عرش پر رکھ لیا کہ بے شک میری رحمت میرے غضب پر غالب ہے۔‘‘ اور اس نے اپنی رحمت سے یہ بھی لکھ دیا ہے کہ وہ پیغام پہنچانے اور حجت پوری کرنے کے بغیر عذاب نہیں دیتا۔ دیکھیے بنی اسرائیل (۱۵) اور نساء (۱۶۵) اور یہ بھی لکھ دیا ہے کہ کفار کی نسل سے بے شمار مسلمان پیدا ہوں گے، اس لیے اس نے فوراً عذاب نازل کرنے کے بجائے کفار کو مہلت دے رکھی ہے۔ دوسری بات یہ کہ ہر ایک کا وقت مقرر شدہ ہے، جس سے پہلے کوئی قوم یا شخص جتنی بھی نافرمانی کرے، اسے مہلت دی جاتی ہے، تاکہ وہ یہ نہ کہہ سکے کہ مجھے وقت نہیں ملا، جیسا کہ فرمایا : « {وَ لِكُلِّ اُمَّةٍ اَجَلٌ فَاِذَا جَآءَ اَجَلُهُمْ لَا يَسْتَاْخِرُوْنَ۠ سَاعَةً وَّ لَا يَسْتَقْدِمُوْنَ۠} » [ الأعراف : ۳۴ ] ’’ا ور ہر امت کے لیے ایک وقت ہے، پھر جب ان کا وقت آ جاتا ہے تو وہ ایک گھڑی نہ پیچھے ہوتے ہیں اور نہ آگے ہوتے ہیں۔‘‘ اگر یہ دو باتیں نہ ہوتیں تو وہی پہلی قوموں والا عذاب لازم ہو جاتا۔"
    },
    {
      "ayah": 130,
      "tafsir": "(آیت 130) ➊ { فَاصْبِرْ عَلٰى مَا يَقُوْلُوْنَ:} یعنی جب اللہ تعالیٰ نے انھیں مہلت دینا طے فرما دیا ہے تو اب خواہ وہ کتنی تکلیف دہ باتیں کہیں، ساحرکہیں یا شاعر، کاہن کہیں یا مجنون، مذاق اڑائیں یا اس سے بھی زیادہ تکلیف دہ باتیں کہیں، آپ کے پاس صبر اور اللہ سے فریاد کے سوا چارہ نہیں، کیونکہ ہر مصیبت میں دو ہی چیزیں مددگار ثابت ہوتی ہیں، ایک صبر اور دوسری اللہ تعالیٰ کا ذکر اور تسبیح و تحمید، جس کی جامع صورت نماز ہے، اس لیے دوسری جگہ فرمایا : «{ وَاسْتَعِیْنُوْا بِالصَّبْرِ وَ الصَّلٰوۃِ }» [ البقرۃ : ۱۵ ] ’’اور صبر اور نماز کے ساتھ مدد طلب کرو۔‘‘ ¤ ➋ {وَ سَبِّحْ بِحَمْدِ رَبِّكَ:} اس کا لفظی معنی اگرچہ یہ ہے کہ ’’اپنے رب کی حمد کے ساتھ تسبیح کر‘‘ مگر مراد نماز ہے، جیسا کہ جز بول کر کل مراد لیا جاتا ہے، رکعت یا سجدہ بول کر پوری نماز مراد لی جاتی ہے، اسی طرح تسبیح و حمد بول کر پوری نماز مراد لی ہے، کیونکہ رکوع اور سجدہ کی طرح تسبیح و حمد بھی نماز کا جز ہے۔ دلیل اس کی جریر بن عبد اللہ بجلی رضی اللہ عنہ کی حدیث ہے، وہ فرماتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے تو آپ نے چودھویں رات کے چاند کو دیکھ کر فرمایا : [ إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هٰذَا لَا تُضَامُّوْنَ فِيْ رُؤْيَتِهٖ فَإِنِ اسْتَطَعْتُمْ أَننْ لَّا تُغْلَبُوْا عَلٰی صَلاَةٍ قَبْلَ طُلُوْعِ الشَّمْسِ وَقَبْلَ غُرُوْبِهَا فَافْعَلُوْا ثُمَّ قَرَأَ: «{ وَ سَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوْعِ الشَّمْسِ وَ قَببْلَ الْغُرُوْبِ }» ] [ قٓ : ۳۹ ] [ بخاري، التفسیر، باب قولہ «وسبح بحمد ربک…» :۴۸۵۱ ]’’تم اپنے رب کو اسی طرح دیکھو گے جیسے اسے دیکھ رہے ہو، اسے دیکھنے میں تمھیں کوئی بھیڑ پیش نہیں آئے گی۔ تو اگر تم یہ کر سکو کہ سورج طلوع ہونے سے پہلے اور اس کے غروب ہونے سے پہلے کی نماز کی ادائیگی میں کوئی تم پر غالب نہ آئے (رکاوٹ نہ بنے) تو ایسا کرو۔‘‘ پھر آپ نے یہ آیت پڑھی : «{ وَ سَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوْعِ الشَّمْسِ وَ قَبْلَ الْغُرُوْبِ }» سورۂ قٓ کی اس آیت اور زیر تفسیر آیت کے الفاظ ایک ہیں، اس لیے یہاں بھی {’’ وَ سَبِّحْ بِحَمْدِ رَبِّكَ ‘‘} سے مراد نماز ہہی ہے۔ یہ بات واضح رہے کہ فرض نمازیں پانچ ہیں، ان کے اوقات کے اول و آخر کی تعیین، ان کی رکعات، ان کے ادا کرنے کا طریقہ سب کچھ حدیث سے معلوم ہوتا ہے، حدیث کے انکار کا مطلب درحقیقت قرآن کا انکار ہے۔ صرف قرآن مجید سے ان میں سے کسی بات پر عمل ممکن نہیں، بلکہ نماز کے علاوہ زکوٰۃ، صیام، حج غرض کسی بھی حکم پر پوری طرح عمل ممکن نہیں۔ اس لیے کسی بھی مسلمان کو یہ مانے بغیر چارہ نہیں کہ قرآن مجید نے بھی انھی پانچ نمازوں کو فرض قرار دیا ہے جنھیں رسول اللہ صلی اللہ علیہ وسلم نے دن رات میں فرض بتایا ہے اور اپنے قول و عمل سے ان کا نمونہ پیش فرمایا ہے۔ اس لیے سلف صالحین نے ایسی تمام آیات کی تفسیر، جن میں نماز کے اوقات کی طرف اشارہ ہے، حدیث کو مدنظر رکھ کر ہی کی ہے۔ ¤ اس آیت سے پانچ نمازوں کا حکم کس طرح ثابت ہوتا ہے؟ اس بارے میں مفسرین کا بیان مختلف ہے۔ مجھے بقاعی رحمہ اللہ کی تفسیر بہتر معلوم ہوتی ہے، وہ یہ ہے کہ {’’ قَبْلَ طُلُوْعِ الشَّمْسِ ‘‘} سے مراد فجر کی نماز ہے۔ {’’ قَبْلَ الْغُرُوْبِ ‘‘} سے مراد ظہر اور عصر کی نماز ہے۔ {’’ وَ مِنْ اٰنَآئِ الَّيْلِ ‘‘} سے مراد مغرب اور عشاء ہے اور {’’ وَ اَطْرَافَ النَّهَارِ ‘‘} (دن کے کناروں) سے مراد فجر اور عصر ہے، کیونکہ فجر دن کےے پہلے کنارے میں ہے اور عصر دن کے آخری کنارے میں، رہی مغرب تو وہ رات میں شامل ہے۔ اس پر یہ سوال پیدا ہوتا ہے کہ ان دو نمازوں (فجر اور عصر) کا ذکر {’’ قَبْلَ طُلُوْعِ الشَّمْسِ وَ قَبْلَ غُرُوْبِهَا ‘‘} میں ہو چکا ہہے، اس تفسیر کے مطابق ان کا ذکر دوبارہ لازم آتا ہے۔ جواب اس کا یہ ہے کہ ان دونوں نمازوں کی مزید تاکید کے لیے ان کا دوبارہ ذکر کیا گیا ہے، جیسا کہ فرمایا : «{ حٰفِظُوْا عَلَى الصَّلَوٰتِ وَ الصَّلٰوةِ الْوُسْطٰى وَ قُوْمُوْا لِلّٰهِ قٰنِتِيْنَ }» [ البقرۃ : ۲۳۸ ] (سب نمازوں کی حفاظت کرو اور درمیانی نماز کی اور اللہ کے لیے فرماں بردار ہو کر کھڑے رہو) میں ’’صلاۃ وسطیٰ ‘‘ کا ذکر اس کی فضیلت و اہمیت کے پیش نظر دوبارہ کیا گیا ہے۔ فجر او رعصر کے فضائل کے پیش نظر ان کی مزید تاکید کے لیے انھیں دوبارہ ذکر فرمایا، کیونکہ حدیث کے مطابق ان دونوں نمازوں میں رات اور دن کے فرشتے شامل ہوتے ہیں اور جیسا کہ اوپر گزرا کہ اللہ تعالیٰ کی زیارت کے حصول کے لیے ان دونوں نمازوں کا خاص دخل ہے۔ نمازوں کے اوقات کے لیے مزید دیکھیں سورۂ بنی اسرائیل (۷۸)۔ ¤ ➌ { لَعَلَّكَ تَرْضٰى :} یہ اشارہ ہے اس طرف کہ صبر اور نماز کی برکت سے آپ کو مقام محمود حاصل ہو گا۔ دیکھیے سورۂ بنی اسرائیل (۷۹) سورۂ ضحی میں فرمایا : «{ وَ لَسَوْفَ يُعْطِيْكَ رَبُّكَ فَتَرْضٰى }» [ الضحٰی : ۵ ]’’اور یقینا عنقریب تیرا رب تجھے عطا کرے گا، پس تو راضی ہو جائے گا۔ ‘‘ حدیث میں ہے کہ اہل جنت کو بھی راضی کیا جائے گا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ يَقُوْلُ لِأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةةِ ! فَيَقُوْلُوْنَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ وَالْخَيْرُ فِيْ يَدَيْكَ، فَيَقُوْلُ هَلْ رَضِيْتُمْ؟ فَيَقُوْلُوْنَ وَمَا لَنَا لاَ نَرْضَی يَا رَبِّ ! فَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ؟ فَيَقُوْلُ أَلاَ أُعْطِيْكُمْ أَفْضَلَ مِنْ ذٰلِكَ ؟ فَيَقُوْلُوْنَ يَا رَبِّ ! وَأَيُّ شَيْءٍ أَفْضَلُ مِنْ ذٰلِكَ؟ فَيَقُوْلُ : أُحِلُّ عَلَيْكُمْ رِضْوَانِيْ فَلاَ أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا ] [ بخاري، التوحید، باب کلام الرب مع أہل الجنۃ : ۷۵۱۸، عن أبی سعید الخدری رضی اللہ عنہ ]’’اللہ تعالیٰ اہل جنت سے فرمائے گا، اے اہل جنت! وہ کہیں گے، بار بار تیری جناب میں حاضر ہیں اے ہمارے رب! اور بار بار حاضر ہیں! تو وہ فرمائے گا، کیا تم راضی (خوش) ہو گئے؟ وہ کہیں گے، ہمیں کیا ہے کہ ہم خوش نہ ہوں، جب کہ تو نے ہمیں وہ کچھ عطا فرمایا جو اپنی مخلوق میں سے کسی کو عطا نہیں فرمایا۔ وہ فرمائے گا، کیا میں تمھیں اس سے بھی افضل چیز عطا کروں؟ وہ کہیں گے، اے رب! اور اس سے افضل کیا ہے؟ وہ فرمائے گا، میں تمھیں اپنی رضا عطا کرتا ہوں، سو اس کے بعد میں تم پر کبھی ناراض نہیں ہوں گا۔‘‘ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ، قَالَ يَقُوْلُ اللّٰهُ تَبَارَكَ وَتَعَالٰی تُرِيْدُوْنَ شَيْئًا أَزِيْدُكُمْ؟ فَيَقُوْلُوْنَ أَلَمْ تُبَيِّضْ وُجُوْهَنَا؟ أَلَمْ تُدْخِلْننَا الْجَنَّةَ وَ تُنَجِّنَا مِنَ النَّارِ؟ قَالَ فَيَكْشِفُ الْحِجَابَ، فَمَا أُعْطُوْا شَيْئًا أَحَبَّ إِلَيْهِمْ مِنَ النَّظَرِ إِلٰی رَبِّهِمْ ] [ مسلم، الإیمان، باب إثبات رؤیۃ المؤمنین… : ۱۸۱، عن صہیب رضی اللہ عنہ ] ’’جب اہل جنت، جنت میں داخل ہو جائیں گے تو اللہ تبارک و تعالیٰ فرمائے گا : ’’تم کوئی چیز چاہتے ہو کہ میں تمھیں مزید دوں؟‘‘ تو وہ کہیں گے : ’’کیا تو نے ہمارے چہرے سفید نہیں کیے؟ کیا تو نے ہمیں جنت میں داخل نہیں فرمایا اور ہمیں آگ سے نجات نہیں دی؟‘‘ فرمایا : ’’تو اس وقت اللہ حجاب اٹھا دے گا، تو انھیں کوئی چیز عطا نہیں کی گئی ہو گی جو انھیں اپنے رب عز وجل کے دیدار سے زیادہ محبوب ہو۔‘‘"
    },
    {
      "ayah": 131,
      "tafsir": "(آیت 131) ➊ {وَ لَا تَمُدَّنَّ عَيْنَيْكَ اِلٰى مَا مَتَّعْنَا بِهٖۤ …: ’’ مَدَّ يَمُدُّ ‘‘} (نن) پھیلانا، لمبا کرنا۔ آنکھیں پھیلانے سے مراد تعجب سے دیر تک دیکھتے رہنا ہے۔ {’’ مَدَّ يَمُدُّ‘‘ } عام طور پر پاؤں یا ہاتھ پھیلانے کے لیے استعمال ہوتا ہے۔ {’’ مَدَّ يَدَهُ ‘‘} یا {’’مَدَّ رِجْلَهُ‘‘} اس نے اپنا ہاتھ پھیلایا یا اپنا پاؤں پھیلایا۔ یہاں آنکھیں پھیلانا استعارہ ہے، یعنی جس طرح پسندیدہ چیز کی طرف شوق اور حرص سے ہاتھ پھیلایا جاتا ہے آپ اپنی آنکھیں مت پھیلائیں۔ معلوم ہوا دیکھنے پر پابندی نہیں، دیکھتے چلے جانے پر پابندی ہے، کیونکہ اس سے دل میں اس چیز کی خواہش پیدا ہو سکتی ہے جو اللہ تعالیٰ کے نزدیک مچھر کے پر کے برابر بھی وقعت نہیں رکھتی۔ {’’ اَزْوَاجًا ‘‘} کی تنوین تقلیل کے لیے ہے، یعنی دنیا کی وہ زیب و زینت ہم نے ہر کافر کو نہیں دی، بلکہ ان کے چند قسم کے لوگوں ہی کو دی ہے، کیونکہ بہت سے کفار نہایت بدحال زندگی بسر کر رہے ہیں۔ {’’ زَهْرَةٌ ‘‘ ’’زَهْرٌ‘‘} کی واحد ہے، پھول، جیسے {’’ تَمْرَةٌ ‘‘ } {’’تَمْرٌ ‘‘} کی واحد ہے۔ استعارے کے طور پر زیب و زینت کو بھی{ ’’ زَهْرَةٌ ‘‘} کہتے ہیں، کیونکہ پھول کی طرح زینت بھی نگاہ و دل کو لے جاتی ہے۔ {’’ زَهْرَةَ الْحَيٰوةِ الدُّنْيَا ‘‘} دنیا کی زندگی کی زینت۔ دنیا کی زینت کے جامع بیان کے لیے دیکھیے سورۂ آل عمران (۱۴) اور سورۂ توبہ (۲۴) بلکہ انسان کو ملنے والی ہر چیز ہی دنیا کی زندگی کی زینت ہے، چنانچہ فرمایا : «{ وَ مَاۤ اُوْتِيْتُمْ مِّنْ شَيْءٍ فَمَتَاعُ الْحَيٰوةِ الدُّنْيَا وَ زِيْنَتُهَا }» [ االقصص : ۶۰ ] ’’اور تمھیں جو کچھ بھی دیا گیا ہے سو دنیا کی زندگی کا سامان اور اس کی زینت ہے۔‘‘ معلوم ہوا کفار کو ملنے والی کسی بھی چیز کی طرف نگاہ پھیلانا جائز نہیں، کیونکہ یہ سب کچھ ان کے فتنہ و آزمائش کے لیے ہے اور حقیقت میں ان کی زندگی دشوار کرنے کا باعث ہے، جیسا کہ فرمایا : «{ فَاِنَّ لَهٗ مَعِيْشَةً ضَنْكًا }» [ طٰہٰ : ۱۲۴ ] ’’تو بے شک اس کے لیے تنگ گزران ہے۔‘‘ اور دیکھیے سورۂ توبہ (۵۵)۔ ¤ ➋ { وَ رِزْقُ رَبِّكَ خَيْرٌ وَّ اَبْقٰى:} ’’تیرے رب کا رزق‘‘ سے مراد حلال رزق ہے، کیونکہ وہ رب کے حکم کے مطابق کمایا گیا ہے، اس لیے اللہ تعالیٰ نے اس کی شان کی بلندی کے لیے اس کی نسبت اپنی طرف کی، ورنہ کافروں کو ملنے والا رزق بھی اللہ تعالیٰ ہی کا عطا کر دہ ہے۔ یعنی دنیا میں اللہ تعالیٰ کی دی ہوئئی حلال روزی اور آخرت میں اس کا عطا کردہ اجر و ثواب کفار کو ملنے والی نعمتوں سے کہیں بہتر اور پائیدار ہے، کیونکہ دنیا فانی اور آخرت باقی ہے۔"
    },
    {
      "ayah": 132,
      "tafsir": "(آیت 132) ➊ {وَ اْمُرْ اَهْلَكَ بِالصَّلٰوةِ …: ’’ اصْطَبِرْ ‘‘ ’’صَبَرَ يَصْبِرُ‘‘} سے باب افتعال کا امر ہے، تاء کو طاء سے بدل دیا ہے اور حروف کے اضافے سے مبالغہ مقصود ہے، اس لیے ترجمہ ’’خوب پابندرہ‘‘ کیا گیا ہے۔ ان آیات میں بظاہر تمام اوامر کے مخاطب رسول اللہ صلی اللہ علیہ وسلم ہیں، مگر امت کا ہر فرد نبی کریم صلی اللہ علیہ وسلم کے تابع ہونے کی وجہ سے ان کا مخاطب ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مُرُوْا أَوْلَادَكُمْ بِالصَّلَاةِ وَهُمْ أَبْنَاءُ سَبْعِ سِنِيْنَ وَاضْرِبُوْهُمْ عَلَيْهَا وَهُمْ أَبْنَاءُ عَشْرِ سِنِيْنَ وَفَرِّقُوْا بَيْنَهُمْ فِي الْمَضَاجِعِ ] [ أبوداوٗد، الصلاۃ، باب متٰی یؤمر الغلام بالصلاۃ : ۴۹۵، عن عبد اللہ بن عمرو رضی اللہ عنھما ] ’’اپنی اولاد کو نماز کا حکم دو جب وہ سات برس کے ہوں اور انھیں اس کی وجہ سے مارو جب وہ دس برس کے ہوں اور آپس میں ان کے بستر الگ کر دو۔‘‘ یعنی بجائے اس کے کہ آپ کے گھر والے دنیا داروں کے عیش و آرام کی طرف نگاہیں بڑھائیں، آپ انھیں نماز کی تاکید کریں اور خود بھی اس پر خوب پابندی کریں۔ کیونکہ یہ چیز ان کا اور آپ کا تعلق اللہ تعالیٰ سے جوڑ دے گی اور تم میں حلال روزی پر، چاہے وہ مقدار میں کتنی ہی تھوڑی ہو، صبر و قناعت کا جذبہ پیدا کرے گی اور اصل غنا صبر و قناعت سے ہے، نہ کہ مال و دولت سے۔ ¤ ➋ { لَا نَسْـَٔلُكَ رِزْقًا …: } عام طور پر روزی کمانے کی وجہ سے آدمی اللہ تعالیٰ کی عبادت اور نماز میں سستی کرتا ہے، اس لیے فرمایا، ہمارا مطالبہ آپ سے روزی کمانے کا نہیں عبادت اور نماز کا ہے، روزی تمھیں ہم دیں گے۔ اللہ کے احکام کے مطابق زندگی بسر کرنے کا نام عبادت ہے، اللہ تعالیٰ نے انسان کو روزی کمانے کے لیے پیدا نہیں فرمایا، بلکہ اپنے احکام کے مطابق زندگی بسر کرنے کے لیے پیدا فرمایا ہے۔ اگر وہ اللہ کا بندہ (غلام) بن کر اس کے احکام کے مطابق زندگی بسر کرے تو اسے رزق کی کوئی کمی نہیں آئے گی، فرمایا : «{ وَ مَا خَلَقْتُ الْجِنَّ وَ الْاِنْسَ اِلَّا لِيَعْبُدُوْنِ (56) مَاۤ اُرِيْدُ مِنْهُمْ مِّنْ رِّزْقٍ وَّ مَاۤ اُرِيْدُ اَنْ يُّطْعِمُوْنِ(57) اِنَّ اللّٰهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِيْنُ}» [ الذاریات : ۵۶ تا ۵۸ ] ’’اور میں نے جنوں اور انسانوں کو پیدا نہیں کیا مگر اس لیے کہ میری عبادت کریں، نہ میں ان سے کوئی رزق چاہتا ہوں اور نہ یہ چاہتا ہوں کہ وہ مجھے کھلائیں، بے شک اللہ ہی بے حد رزق دینے والا، طاقت والا، نہایت مضبوط ہے۔‘‘ انسان کی بے صبری اور بخل و حرص کا علاج نماز کی محافظت اور اس پر دوام ہے۔ دیکھیے سورۂ معارج (۱۹ تا ۳۵) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ تَعَالٰی يَقُوْلُ يَا ابْنَ آدَمَ  ! تَفَرَّغْ لِعِبَادَتِيْ أَمْلَأْ صَدْرَكَ غِنًی وَأَسُدَّ فَقْرَكَ وَإِلاَّ تَفْعَلْ مَلَأْتُ يَدَيْكَ شُغْلاً وَلَمْ أَسُدَّ فَقْرَكَ] [ترمذي، صفۃ القیامۃ، باب أحادیث ابتلینا بالضراء… : ۲۴۶۶، عن أبي ھریرۃ رضی اللہ عنہ ]’’اللہ تعالیٰ فرماتا ہے، اے ابن آدم! میری عبادت کے لیے پوری طرح فارغ ہو جا، (تو) میں تیرا سینہ غنا سے بھر دوں گا اور تیری فقیری دور کر دوں گا اور اگر تو نے ایسا نہ کیا تو میں تیرے دونوں ہاتھ مشغولیت سے بھر دوں گا اور تیری فقیری دور نہیں کروں گا۔‘‘ ¤ ➌ {وَ الْعَاقِبَةُ لِلتَّقْوٰى :} یعنی چاہے دنیا میں ان کے دن تکلیف سے گزریں مگر آخرت میں ہمیشہ رہنے والا عیش و آرام انھی کا حصہ ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ كَانَتِ الْآخِرَةُ هَمَّهٗ جَعَلَ اللّٰهُ غِنَاهُ فِيْ قَلْبِهٖ وَجَمَعَ لَهٗ شَمْلَهٗ وَأَتَتْهُ الدُّنْيَا وَهِيَ رَاغِمَةٌ وَمَنْ كَانَتِ الدُّنْيَا هَمَّهٗ جَعَللَ اللّٰهُ فَقْرَهُ بَيْنَ عَيْنَيْهٖ وَفَرَّقَ عَلَيْهِ شَمْلَهٗ وَلَمْ يَأْتِهٖ مِنَ الدُّنْيَا إِلاَّ مَا قُدِّرَ لَهٗ ] [ ترمذي، صفۃ القیامۃ، باب أحادیث ابتلینا بالضراء… : ۲۴۶۵، عن أنس بن مالک رضی اللہ عنہ ] ’’جس شخص کی فکر صرف آخرت ہو اللہ تعالیٰ اس کی دولت مندی اس کے دل میں رکھ دیتا ہے اور اس کے لیے اس کے تمام معاملات جمع کر دیتا ہے اور دنیا اس کے پاس ذلیل ہو کر آتی ہے اور جس کی فکر صرف دنیا ہو اللہ تعالیٰ اس کا فقر اس کی آنکھوں کے سامنے رکھ دیتا ہے اور اس کے تمام معاملات کو بکھیر دیتا ہے اور دنیا اسے اتنی ہی ملتی ہے جو اس کے مقدر میں ہے۔‘‘ اس سے معلوم ہوا کہ دنیا و آخرت دونوں میں اچھا انجام تقویٰ ہی کا ہے۔"
    },
    {
      "ayah": 133,
      "tafsir": "(آیت 133) { وَ قَالُوْا لَوْ لَا يَاْتِيْنَا … :} کفار کہا کرتے تھے کہ اگر محمد( صلی اللہ علیہ وسلم ) نبی ہیں تو گزشتہ انبیاء کی طرح اپنے سچا ہونے کی کوئی نشانی کیوں پیش نہیں کرتے؟ فرمایا، اس سے زیادہ آپ کی سچائی کی اور کیا دلیل ہو سکتی ہے کہ پہلی آسمانی کتابیں آپ کے آنے کی خبر دے رہی ہیں۔ یقینا یہ خبر اہلِ کتاب کو معلوم ہے اور ان کے واسطے سے کفارِ مکہ تک پہنچ چکی ہے۔ پہلی کتابوں میں آپ صلی اللہ علیہ وسلم کے ذکر خیر کی تفصیل کے لیے دیکھیے سورۂ اعراف (۱۵۷)، فتح (۲۹) اور صف (۶)۔"
    },
    {
      "ayah": 134,
      "tafsir": "(آیت 134) { وَ لَوْ اَنَّاۤ اَهْلَكْنٰهُمْ بِعَذَابٍ … :} اس آیت میں اللہ تعالیٰ نے کفار کو عذاب دینے سے پہلے انبیاء کو مبعوث کرنے اور کفار کو مہلت دینے کی حکمت دوبارہ بیان فرمائی۔ اس سے مقصود ان کا عذر ختم کرنا اور ان پر حجت تمام کرنا ہے اور یہی ہمیشہ سے اللہ تعالیٰ کا دستور رہا ہے۔ دیکھیے سورۂ قصص (۵۹) اور بنی اسرائیل (۱۵)۔"
    },
    {
      "ayah": 135,
      "tafsir": "(آیت 135) ➊ { قُلْ كُلٌّ مُّتَرَبِّصٌ فَتَرَبَّصُوْا … : ’’ كُلٌّ ‘‘} کی تنوین اس کے محذوف مضاف الیہ کی جگہ آئی ہے، یعنی {’’كُلُّ وَاحِدٍ‘‘} ہر ایک، مطلب یہ ہے کہ اگر پہلی کتابوں میں موجود واضح دلائل تمھارے لیے نبی صلی اللہ علیہ وسلم پر ایمان لانے کے لیے کافی نہیں اور تمھیں اپنی مرضی کی نشانی دیکھنے پر اصرار ہے تو تم ایمان لانے کے لیے نشانی کا انتظار کرتے رہو، ہم تمھارے لیے دنیا میں اللہ کی گرفت اور آخرت میں اس کے عذاب کا انتظار کر رہے ہیں۔ جلد ہی تمھیں معلوم ہو جائے گا کہ سیدھے راستے والے کون ہیں اور وہ کون ہے جس نے ہدایت پالی ہے؟ اس سے رسول اللہ صلی اللہ علیہ وسلم کے اپنے راہ حق پر ہونے کے یقین کا اظہار ہوتا ہے، کیونکہ اتنے دعوے سے یہ بات وہی شخص کہہ سکتا ہے جسے اپنے حق پر ہونے کا مکمل یقین ہو۔ ¤ ➋ {فَتَرَبَّصُوْا :} امر کے ساتھ اگر قرینہ بھی ہو تو وہ دوام کے لیے ہوتا ہے۔ یہاں قرینہ یہ ہے کہ انتظار اس وقت تک جاری رہنا ہے جب تک وہ چیز وجود میں نہ آئے جس کا انتظار ہے۔ انتظار کا یہ حکم وعید اور خبردار کرنے کے لیے ہے۔ اسے متارکہ کہتے ہیں، یعنی ہم نے تمھیں تمھاری انتظار کی حالت پر چھوڑ دیا ہے، کیونکہ ہمیں تمھارے برے انجام کا یقین ہے۔ اس کی ہم معنی آیات کے لیے دیکھیے سورۂ سجدہ (۳۰) اور سورۂ توبہ (۵۲) تاریخ شاہد ہے کہ بہت جلد کفار کو مسلمانوں کا راہ راست پر ہونا معلوم ہو گیا۔ بدر کے دن ان کو جو اسلام نہیں لائے، مثلاً ابوجہل اور کفر و شرک کے دوسرے ہلاک ہونے والے سردار اور ان کو بھی جو مسلمان ہو گئے، مثلاً ابوسفیان اور خالد بن ولید رضی اللہ عنھما اور ان سب کو جنھوں نے جزیرۂ عرب، شام، عراق، ایران، مصر اور پھر زمین کے مشرق و مغرب پر اسلام کا غلبہ اپنی آنکھوں سے دیکھ لیا اور اس طرح اللہ تعالیٰ کی بات پوری ہوئی۔ ’’جلد ہی جان لو گے‘‘ میں یہ بھی شامل ہے کہ بہت جلد قیامت کے دن تمھیں اس بات کا علم الیقین اور عین الیقین حاصل ہو جائے گا۔ کیونکہ {’’كُلُّ آتٍ قَرِيْبٌ‘‘} کہ آنے والی ہر چیز قریب ہی ہے۔"
    }
  ]
}