{
  "surah": "Ash-Shu'araa",
  "surah_number": 26,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) {طٰسٓمّٓ :} اس کی تفسیر کے لیے دیکھیے سورۂ بقرہ (۱)۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {تِلْكَ اٰيٰتُ الْكِتٰبِ الْمُبِيْنِ:} یہ تمہیدی فقرہ اس مضمون کے ساتھ پوری مناسبت رکھتا ہے جو اس سورت میں آگے بیان ہوا ہے۔ کفار مکہ نبی صلی اللہ علیہ وسلم سے کوئی نشانی (معجزہ) مانگتے تھے، تاکہ اسے دیکھ کر انھیں اطمینان ہو جائے کہ آپ واقعی یہ پیغام اللہ کی طرف سے لائے ہیں۔ فرمایا، اگر کسی کو ایمان لانے کے لیے نشانی کی طلب ہے تو کتابِ مبین کی یہ آیات موجود ہیں، مزید کسی معجزے کی ضرورت نہیں۔ اس بات کو اللہ تعالیٰ نے اس سورت میں ہر واقعہ کے آخر پر دہرایا ہے : «{ اِنَّ فِيْ ذٰلِكَ لَاٰيَةً }» [ الشعراء : ۸ ] ’’بے شک اس میں یقینا عظیم نشانی ہے۔‘‘ یعنی قرآن میں آنے والی ہر آیت اور ہر واقعہ ہی معجزہ ہے، جو قرآن کے من جانب اللہ ہونے کی دلیل ہے اور جس کا جواب لانے سے پوری مخلوق عاجز ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {لَعَلَّكَ بَاخِعٌ نَّفْسَكَ …:} اس سے مقصود نبی صلی اللہ علیہ وسلم کو تسلی دینا ہے کہ ان بدبختوں کے ایمان نہ لانے پر آپ اس قدر رنجیدہ نہ ہوں، قرآن سے بڑا معجزہ کوئی نہیں، وہ آپ نے انھیں دکھلا دیا، اب بھی ایمان نہیں لاتے تو ان پر اتنا غم کرنے کی ضرورت نہیں۔ دیکھیے سورۂ کہف کی آیت (۶) اور سورۂ فاطر کی آیت (۸)کی تفسیر ۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {اِنْ نَّشَاْ نُنَزِّلْ عَلَيْهِمْ مِّنَ السَّمَآءِ …:} آسمان سے نشانی اتارنے سے مراد وہ معجزے دکھانا ہے جن کا وہ مطالبہ کرتے تھے۔ (سعدی) یعنی اگر ہم چاہیں تو آسمان سے کوئی نشانی اتار دیں، جس کے آنے کے بعد ان کے لیے مانے بغیر کوئی چارہ کار نہ رہے، لیکن ہم ایسا نہیں کرتے، کیونکہ دنیا امتحان کا گھر ہے اور ہمارا فیصلہ یہ ہے کہ جو شخص بھی ایمان لائے سوچ سمجھ کر اپنے اختیار سے لائے، نہ کہ کسی دباؤ اور مجبوری کے تحت۔ اس لیے ہم نے انبیاء و رسل بھیجے، صحیفے اور کتابیں نازل فرمائیں۔ یہ حقیقت قرآن میں متعدد مقامات پر بیان کی گئی ہے۔ دیکھیے سورۂ یونس (۹۹)، ہود (۱۱۸، ۱۱۹) اور غاشیہ (۲۱، ۲۲) اور ہم اس لیے بھی نشانی نہیں اتارتے کہ ایمان وہ معتبر ہے جو بن دیکھے ہو، جب غیب ہی سے پردہ اٹھ گیا، پھر کوئی ایمان لائے بھی تو اسے کوئی فائدہ نہیں، جیسا کہ فرمایا : «{ فَلَمْ يَكُ يَنْفَعُهُمْ اِيْمَانُهُمْ لَمَّا رَاَوْا بَاْسَنَا سُنَّتَ اللّٰهِ الَّتِيْ قَدْ خَلَتْ فِيْ عِبَادِهٖ وَ خَسِرَ هُنَالِكَ الْكٰفِرُوْنَ }» [ المؤمن : ۸۵ ] ’’پھر یہ نہ تھا کہ ان کا ایمان انھیں فائدہ دیتا، جب انھوں نے ہمارا عذاب دیکھ لیا۔ یہ اللہ کا طریقہ ہے جو اس کے بندوں میں گزر چکا اور اس موقع پر کافر خسارے میں رہے۔‘‘ اور دیکھیے سورۂ حجر (۶ تا ۸) اور فرقان (۲۱، ۲۲)۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { وَ مَا يَاْتِيْهِمْ مِّنْ ذِكْرٍ مِّنَ الرَّحْمٰنِ …:} سورۂ انبیاء کی آیت (۴۲) میں ہے : «{ عَنْ ذِكْرِ رَبِّهِمْ }» اور یہاں فرمایا : «{ مِنْ ذِكْرٍ مِّنَ الرَّحْمٰنِ }» اس کی مناسبت یہ ہے کہ آپ جن کے غم میں پڑے ہیں ان کی حالت یہ ہے کہ رحمان اپنی رحمت سے جب ان کی بھلائی کے لیے کوئی نصیحت بھیجتا ہے، تو وہ اس سے منہ موڑنے والے ہوتے ہیں۔ {’’ مُحْدَثٍ ‘‘} کا مطلب یہ ہے کہ ان کا یہ معاملہ اس نصیحت کے ساتھ ہے جو بار بار نئی سے نئی آتی رہتی ہے، اگر ایک آدھ دفعہ ہی آتی تو ان کا کیا حال ہوتا، اس لیے ان کے غم میں اپنے آپ کو ہلاک مت کریں۔ ¤ ➋ { ’’إِلَّا أَعْرَضُوْا عَنْهُ ‘‘} (مگر اس سے منہ موڑ لیتے ہیں) کے بجائے فرمایا : «{ اِلَّا كَانُوْا عَنْهُ مُعْرِضِيْنَ}» ’’مگر وہ اس سے منہ موڑنے والے ہوتے ہیں‘‘ اس میں ان کے مسلسل اعراض کا بیان ہے۔ ¤ ➌ قرآن مجید کے محدث ہونے کی تفسیر کے لیے دیکھیے سورۂ انبیاء کی آیت (۲) کی تفسیر۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { فَقَدْ كَذَّبُوْا …:} یعنی یہ لوگ صرف اعراض تک ہی نہیں رہے بلکہ انھوں نے صاف جھٹلا دیا اور اس سے بڑھ کر ان چیزوں کا مذاق بھی اڑانے لگے جن کے آنے کی رسول صلی اللہ علیہ وسلم نے خبر دی تھی، جیساکہ{’’ كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ ‘‘} سے معلوم ہو رہا ہے۔ ¤ ➋ { فَسَيَاْتِيْهِمْ۠ اَنْۢبٰٓؤُا مَا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ:} یعنی پیغمبر نے انھیں جن چیزوں کے واقع ہونے کی خبریں دیں، جن کا وہ مذاق اڑاتے رہے تھے، وہ بہت جلد ان کی آنکھوں کے سامنے آ جائیں گی اور انھیں معلوم ہو جائے گا کہ وہ حق تھیں۔ اس میں کفار کے لیے سخت وعید ہے۔ دیکھیے سورۂ انعام (۴، ۵)۔ ¤ ➌ {’’ اَنْۢبٰٓؤُا ‘‘ ’’ نَبَأٌ ‘‘} کی جمع ہے، کسی بڑے واقعہ کی خبر کو {’’ نَبَأٌ ‘‘} کہتے ہیں، جیسا کہ فرمایا : «{ وَ لَقَدْ جَآءَكَ مِنْ نَّبَاِي الْمُرْسَلِيْنَ}» [الأنعام : ۳۴ ] ’’اور بلاشبہ یقینا تیرے پاس ان رسولوں کی کچھ خبریں آئی ہیں۔‘‘ {’’ اَنْۢبٰٓؤُا ‘‘} جمع کا لفظ اس لیے استعمال فرمایا ہے کہ وہ رسول اللہ صلی اللہ علیہ وسلم کی بتائی ہوئی بہت سی باتوں کا مذاق اڑاتے رہے تھے، مثلاً قیامت، دنیا میں ان کو ملنے والی سزا، مسلمانوں کا غالب آنا، فتح مکہ، جہنم کا عذاب اور زقوم کا درخت وغیرہ۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {اَوَ لَمْ يَرَوْا اِلَى الْاَرْضِ …: } اصل میں واؤ عطف پہلے ہے اور ہمزہ بعد میں ہے، چونکہ ہمزہ استفہام کلام کے شروع میں ہوتا ہے، اس لیے واؤ عطف کو بعد میں کر دیا۔ واؤ عطف سے معلوم ہوتا ہے کہ اس سے پہلے جملہ محذوف ہے جو خود بخود سمجھ میں آ رہا ہے، یعنی {’’أَلَمْ يَرَوْا إِلَی السَّمَاءِ وَ أَلَمْ يَرَوْا إِلَي الْأَرْضِ‘‘} ’’کیا انھوں نے آسمان کی طرف نہیں دیکھا اور کیا انھوں نے زمین کی طرف نہیں دیکھا۔‘‘ یہ اختصار کلام اللہ کا اعجاز ہے۔ (بقاعی) یعنی اگر وہ رسول پر اترنے والی آیات کو جھٹلائیں اور ان کا مذاق اڑائیں تو اس میں کون سا تعجب ہے، کیا انھوں نے اس سے پہلے آسمان، زمین اور اس میں پائی جانے والی ہر قسم کی بے شمار عمدہ ترین چیزیں نہیں دیکھیں؟ اگر انھوں نے اپنے خالق و مالک پر اور اس کی توحید پر ایمان لانا ہوتا تو یہ سب کچھ بطور دلیل کیا کم تھا، جب انھیں اس سے عبرت نہیں ہوئی تو آپ پر نازل ہونے والی آیات سے انھیں کیا عبرت ہو گی۔ ¤"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { اِنَّ فِيْ ذٰلِكَ لَاٰيَةً وَ مَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِيْنَ:} یعنی آسمان و زمین اور اس میں پائی جانے والی بے شمار نفیس ترین چیزوں میں اللہ تعالیٰ کے وجود اور اس کی توحید کی بہت بڑی نشانی ہے، مگر ان کے اکثر شروع ہی سے ایمان لانے والے نہ تھے۔ دوسری جگہ فرمایا : «{ وَ فِي الْاَرْضِ اٰيٰتٌ لِّلْمُوْقِنِيْنَ (20) وَ فِيْۤ اَنْفُسِكُمْ اَفَلَا تُبْصِرُوْنَ }» [ الذاریات : ۲۰، ۲۱ ] ’’اور زمین میں یقین کرنے والوں کے لیے کئی نشانیاں ہیں اور تمھارے نفسوں میں بھی، تو کیا تم نہیں دیکھتے؟‘‘ مزید دیکھیے سورۂ یوسف (۱۰۵)، حٰم السجدہ (۹، ۱۰) اور لقمان (۱۰، ۱۱)۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {وَ اِنَّ رَبَّكَ لَهُوَ الْعَزِيْزُ الرَّحِيْمُ : ’’ اِنَّ ‘‘} کے اسم {’’ رَبَّكَ ‘‘} اور خبر {’’ الْعَزِيْزُ الرَّحِيْمُ ‘‘} دونوں کے معرفہ ہونے سے قصر کا مفہوم پیدا ہو رہا ہے اور درمیان میں {’’ لَهُوَ ‘‘} ضمیر لانے سے قصر میں مزید زور پیدا ہو رہا ہے۔ یعنی تیرا رب ہی ہے جو سب پر غالب ہے، اس کے سوا کوئی غالب نہیں، وہ زبردست قوت والا ہے، جو چاہے کر سکتا ہے، ان کی نافرمانیوں پر انھیں آنکھ جھپکنے میں پکڑ سکتا ہے، مگر وہ ساتھ ہی رحیم بھی ہے، توبہ کرنے پر عمر بھر کی نافرمانیوں کو معاف کر دیتا ہے۔ اس لیے انھیں سنبھلنے کے لیے موقع پر موقع دیے جا رہا ہے اور ان کی سرکشی پر گرفت نہیں کر رہا۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 11،10) ➊ { وَ اِذْ نَادٰى رَبُّكَ مُوْسٰۤى:} یہاں سے عبرت کے لیے پہلی قوموں کے چند واقعات بیان فرمائے ہیں، جن سے مقصود یہ ہے کہ آیاتِ الٰہی کو جھٹلانے اور ان کا مذاق اڑانے کا انجام ہلاکت ہے۔ گویا ان واقعات سے پچھلی آیت : «{فَسَيَاْتِيْهِمْ۠ اَنْۢبٰٓؤُا مَا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ }» کی تائید اور وضاحت مقصود ہے۔ (شوکانی) اس کے علاوہ رسول اللہ صلی اللہ علیہ وسلم اور اہلِ ایمان کو تسلی دلانا بھی مقصود ہے۔ اس کے لیے ابتدا موسیٰ علیہ السلام اور پھر ار ابراہیم علیہ السلام کے واقعات سے فرمائی ہے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ان کی بہت سی چیزوں میں مشارکت ہے، مثلاً ہجرت، جہاد اور ارضِ مقدس کو حاصل کرنے کی آرزو وغیرہ۔ موسیٰ علیہ السلام کو وہ کتاب ملی جو قرآن کے بعد انتہائی جامع کتاب ہے اور انھیں بہت سے معجزے ملے۔ قرآن میں ان کا اور ان کی قوم کا ذکر سب سے زیادہ کیا گیا ہے۔ ¤ ➋ یہ واقعہ اس سے پہلے سورۂ بقرہ، اعراف اور طٰہٰ میں تفصیل کے ساتھ گزر چکا ہے اور آگے سورۂ قصص میں بھی آ رہا ہے۔ ¤ ➌ { اَنِ ائْتِ الْقَوْمَ الظّٰلِمِيْنَ :} اس قوم کا نام قبط تھا، انھیں ظالم اس لیے فرمایا کہ وہ کفر و شرک کر کے اپنی جان پر ظلم کر رہے تھے، فرعون کو ربِ اعلیٰ مان رہے تھے اور بنی اسرائیل کو غلام بنا کر، ان کے بیٹوں کو قتل کر کے اور عورتوں کو باقی رکھ کر ان پر بھی ظلم کر رہے تھے۔ ¤ ➍ { اَلَا يَتَّقُوْنَ :} فرمایا، یہ لوگ بے تحاشا ظلم و ستم کرتے ہی چلے جا رہے ہیں، کیا انھیں خوف نہیں کہ کوئی ان سے باز پرس کرنے والا بھی ہے !!"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11،10) ➊ { وَ اِذْ نَادٰى رَبُّكَ مُوْسٰۤى:} یہاں سے عبرت کے لیے پہلی قوموں کے چند واقعات بیان فرمائے ہیں، جن سے مقصود یہ ہے کہ آیاتِ الٰہی کو جھٹلانے اور ان کا مذاق اڑانے کا انجام ہلاکت ہے۔ گویا ان واقعات سے پچھلی آیت : «{فَسَيَاْتِيْهِمْ۠ اَنْۢبٰٓؤُا مَا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ }» کی تائید اور وضاحت مقصود ہے۔ (شوکانی) اس کے علاوہ رسول اللہ صلی اللہ علیہ وسلم اور اہلِ ایمان کو تسلی دلانا بھی مقصود ہے۔ اس کے لیے ابتدا موسیٰ علیہ السلام اور پھر ار ابراہیم علیہ السلام کے واقعات سے فرمائی ہے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ان کی بہت سی چیزوں میں مشارکت ہے، مثلاً ہجرت، جہاد اور ارضِ مقدس کو حاصل کرنے کی آرزو وغیرہ۔ موسیٰ علیہ السلام کو وہ کتاب ملی جو قرآن کے بعد انتہائی جامع کتاب ہے اور انھیں بہت سے معجزے ملے۔ قرآن میں ان کا اور ان کی قوم کا ذکر سب سے زیادہ کیا گیا ہے۔ ¤ ➋ یہ واقعہ اس سے پہلے سورۂ بقرہ، اعراف اور طٰہٰ میں تفصیل کے ساتھ گزر چکا ہے اور آگے سورۂ قصص میں بھی آ رہا ہے۔ ¤ ➌ { اَنِ ائْتِ الْقَوْمَ الظّٰلِمِيْنَ :} اس قوم کا نام قبط تھا، انھیں ظالم اس لیے فرمایا کہ وہ کفر و شرک کر کے اپنی جان پر ظلم کر رہے تھے، فرعون کو ربِ اعلیٰ مان رہے تھے اور بنی اسرائیل کو غلام بنا کر، ان کے بیٹوں کو قتل کر کے اور عورتوں کو باقی رکھ کر ان پر بھی ظلم کر رہے تھے۔ ¤ ➍ { اَلَا يَتَّقُوْنَ :} فرمایا، یہ لوگ بے تحاشا ظلم و ستم کرتے ہی چلے جا رہے ہیں، کیا انھیں خوف نہیں کہ کوئی ان سے باز پرس کرنے والا بھی ہے !!"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 13،12) ➊ {وَ يَضِيْقُ صَدْرِيْ:} یعنی اتنے بڑے کام کے لیے جاتے ہوئے مجھے گھبراہٹ محسوس ہوتی ہے۔ ¤ ➋ { وَ لَا يَنْطَلِقُ لِسَانِيْ:} یعنی میں پوری روانی سے تقریر نہیں کر سکتا۔ ¤ ➌ { فَاَرْسِلْ اِلٰى هٰرُوْنَ:} تاکہ ان سے مجھے تقویت اور پشت پناہی حاصل ہو اور یوں بھی وہ مجھ سے زیادہ فصیح اللسان ہیں۔ (دیکھیے طٰہٰ : ۳۱۔ قصص : ۳۴) موسیٰ علیہ السلام نے ہارون علیہ السلام کا تعاون حاصل کرنے کے لیے درخواست کی نہ کہ رسالت سے سبکدوشی کے لیے۔ (شوکانی)"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13،12) ➊ {وَ يَضِيْقُ صَدْرِيْ:} یعنی اتنے بڑے کام کے لیے جاتے ہوئے مجھے گھبراہٹ محسوس ہوتی ہے۔ ¤ ➋ { وَ لَا يَنْطَلِقُ لِسَانِيْ:} یعنی میں پوری روانی سے تقریر نہیں کر سکتا۔ ¤ ➌ { فَاَرْسِلْ اِلٰى هٰرُوْنَ:} تاکہ ان سے مجھے تقویت اور پشت پناہی حاصل ہو اور یوں بھی وہ مجھ سے زیادہ فصیح اللسان ہیں۔ (دیکھیے طٰہٰ : ۳۱۔ قصص : ۳۴) موسیٰ علیہ السلام نے ہارون علیہ السلام کا تعاون حاصل کرنے کے لیے درخواست کی نہ کہ رسالت سے سبکدوشی کے لیے۔ (شوکانی)"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) {وَ لَهُمْ عَلَيَّ ذَنْۢبٌ …:} یعنی مجھ سے ان کا ایک آدمی قتل ہو گیا ہے، جو ان کے کہنے کے مطابق میرا جرم ہے، اس لیے میں ڈرتا ہوں کہ وہ مجھے قتل کر دیں گے۔ اس واقعہ کی تفصیل سورۂ قصص (۱۵) میں آ رہی ہے، مختصر یہ کہ موسیٰ علیہ السلام نے ایک قبطی کو ایک اسرائیلی سے لڑتے دیکھ کر گھونسا مار دیا، جس سے اس قبطی کی موت واقع ہو گئی، پھر جب موسیٰ علیہ السلام کو معلوم ہوا کہ اس واقعہ کی اطلاع فرعون اور اس کے لوگوں کو ہو گئی ہے اور وہ بدلا لینے کے لیے مشورے کر رہے ہیں تو وہ مصر سے مدین چلے گئے۔ معلوم ہوا کہ خوف طبعی طور پر انبیاء علیھم السلام کو بھی لاحق ہو جاتا ہے۔ (قرطبی)"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ {قَالَ كَلَّا …:} فرمایا، ہر گز ایسا نہیں ہو گا، نہ وہ تمھیں قتل کر سکیں گے، نہ کوئی ایذا پہنچا سکیں گے۔ تمھاری ہارون کو معاون نبی بنانے کی درخواست بھی قبول ہے، اس لیے تم دونوں فرعون کے پاس جاؤ۔ ¤ ➋ {فَاذْهَبَا بِاٰيٰتِنَاۤ اِنَّا مَعَكُمْ مُّسْتَمِعُوْنَ:} ہمت بندھانے کے لیے دو چیزیں عطا فرمائیں، پہلی عصا اور ید بیضا کے معجزے، دوسری اپنی معیت کا وعدہ۔ عام معیت تو کائنات کی ہر چیز کو حاصل ہے، یہاں معیت سے مراد معیت خاصہ ہے، جیسا کہ موسیٰ علیہ السلام نے فرعون اور اس کی فوج کے آ پہنچنے پر فرمایا تھا : «{ كَلَّا اِنَّ مَعِيَ رَبِّيْ سَيَهْدِيْنِ }» [ الشعراء : ۶۲ ] ’’ہر گز نہیں! بے شک میرے ساتھ میرا رب ہے، وہ مجھے ضرور راستہ بتائے گا۔‘‘ اور جیسے رسول اللہ صلی اللہ علیہ وسلم نے اپنے ساتھی کے لیے کہا تھا : «{ لَا تَحْزَنْ اِنَّ اللّٰهَ مَعَنَا }» [ التوبۃ : ۴۰ ] ’’غم نہ کر، بے شک اللہ ہمارے ساتھ ہے۔‘‘ {’’سَمِعَ‘‘} ’’اس نے سنا‘‘ اور {’’اِسْتَمَعَ‘‘} اس نے کان لگا کر سنا۔‘‘ {’’ اِنَّا مَعَكُمْ ‘‘} میں ضمیر {’’كُمْ‘‘} تثنیہ کے لیے استعمال ہوئی ہے، کیونکہ دوسری جگہ فرمایا : «{ لَا تَخَافَاۤ اِنَّنِيْ مَعَكُمَاۤ اَسْمَعُ وَ اَرٰى }» [ طٰہٰ : ۴۶ ] ’’ڈرو نہیں، بے شک میں تم دونوں کے ساتھ ہوں، میں سن رہا ہوں اور دیکھ رہا ہوں۔‘‘"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { فَاْتِيَا فِرْعَوْنَ :} موسیٰ علیہ السلام کو دو ہدف دے کر بھیجا گیا تھا، ایک فرعون کے سامنے توحید کی دعوت پیش کرنا (دیکھیے نازعات : ۱۷ تا ۱۹) اور دوسرا بنی اسرائیل کو آزادی دلانا۔ ( دیکھیے طٰہٰ : ۴۷)۔ ¤ ➋ {فَقُوْلَاۤ اِنَّا رَسُوْلُ رَبِّ الْعٰلَمِيْنَ :} اللہ تعالیٰ نے فرعون کے سامنے جا کر گفتگو کی ابتدا اس بات سے کرنے کا حکم دیا کہ ہم ’’رب العالمین کے رسول‘‘ (پیغام پہنچانے والے) ہیں، یعنی ہم جو کچھ تمھیں کہہ رہے ہیں وہ ہماری بات نہیں، بلکہ رب العالمین کا پیغام اور اس کا فرمان ہے جو ہم تمھیں پہنچا رہے ہیں۔ ’’رب العالمین‘‘ کے لفظ کے ساتھ واشگاف الفاظ میں اسے بتایا کہ وہ (فرعون) رب نہیں ہے۔ رب وہ ہے جو سارے جہانوں کا رب ہے، جن میں فرعون بھی شامل ہے۔ اس میں توحید کا اعلان بھی ہے، کیونکہ ’’عالمین‘‘ کا لفظ پوری کائنات کو شامل ہے، جن میں فرعون اور قبطیوں کے تمام معبود بھی شامل ہیں، مثلاً سورج، چاند، ستارے اور گائے وغیرہ۔ گویا اس چھوٹے سے جملے میں توحید و رسالت دونوں کا پیغام موجود ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) { اَنْ اَرْسِلْ مَعَنَا بَنِيْۤ اِسْرَآءِيْلَ:} موسیٰ اور ہارون علیھما السلام کو فرعون کی طرف توحید و رسالت کے ساتھ یہ پیغام بھی دے کر بھیجا گیا کہ وہ بنی اسرائیل کو غلامی سے آزاد کر دے اور انھیں ان کے ساتھ ان کے آبا و اجداد کی سرزمین میں جانے دے۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 19،18) {قَالَ اَلَمْ نُرَبِّكَ فِيْنَا وَلِيْدًا …:} یہاں لمبی بات سننے والے کی سمجھ پر چھوڑ کر حذف کر دی گئی کہ اللہ تعالیٰ نے انھیں ایسی ہیبت عطا فرمائی کہ وہ دونوں کسی فوج یا اسلحے کے بغیر فرعون کے دربار میں پہنچے، اس کی فوج اور پہرے داروں میں سے کسی کو انھیں روکنے کی جرأت نہ ہو سکی اور دربار میں پہنچ کر انھوں نے اس کے تمام سرداروں کی موجودگی میں اسے اللہ تعالیٰ کا پیغام پہنچایا۔ فرعون نے موسیٰ علیہ السلام کی گفتگو سے اندازہ لگا لیا کہ اصل رسول وہی ہیں، ہارون صرف معاون ہیں، اس لیے اس نے موسیٰ علیہ السلام ہی کو مخاطب کیا، ہارون علیہ السلام سے بات نہیں کی۔ موسیٰ علیہ السلام سے بات کرتے ہوئے اس نے ان کی دعوت پر بات کرنے سے گریز کرتے ہوئے حکمرانوں کے عام ہتھکنڈے استعمال کیے، جن میں سے پہلا ہتھکنڈا ان کی پرورش کا احسان جتا کر شرمندہ کرنا تھا۔ چنانچہ کہنے لگا کہ کیا ہم نے تجھے اپنے پاس رکھ کر تیری اس وقت پرورش نہیں کی جب تو بچہ تھا اور تو اپنی عمر کے کئی برس ہم میں رہا۔ دوسرا ہتھکنڈا انھیں مجرم ثابت کرکے سزا سے خوف زدہ کرنا تھا۔ اس کا خیال تھا کہ پرورش کے احسان سے شرمندہ ہو کر یا جان کے خوف سے وہ زبان بند رکھیں گے۔ چنانچہ کہنے لگا : ’’اور تو نے اپنا وہ کام کیا جو تو نے کیا اور تو ناشکروں میں سے ہے‘‘ یعنی ہمارے اتنے احسانات کے باوجود تم نے ہمارے ایک آدمی کو قتل کر دیا جو یقینا تمھاری احسان فراموشی تھی۔ {’’ اَلَمْ نُرَبِّكَ فِيْنَا ‘‘} (کیا ہم نے تیری اپنے ہاں پرورش نہیں کی) کے الفاظ سے ان مفسرین اور مؤرخین کی بات کی کسی قدر تائید ہوتی ہے جن کا خیال ہے کہ یہ فرعون وہ نہیں تھا جس کے گھر موسیٰ علیہ السلام کی پرورش ہوئی تھی، بلکہ اس کا بیٹا تھا، کیونکہ اگر یہ وہی ہوتا تو کہتا، کیا میں نے تیری پرورش نہیں کی اور تو کئی سال میرے پاس رہا؟ (واللہ اعلم)"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19،18) {قَالَ اَلَمْ نُرَبِّكَ فِيْنَا وَلِيْدًا …:} یہاں لمبی بات سننے والے کی سمجھ پر چھوڑ کر حذف کر دی گئی کہ اللہ تعالیٰ نے انھیں ایسی ہیبت عطا فرمائی کہ وہ دونوں کسی فوج یا اسلحے کے بغیر فرعون کے دربار میں پہنچے، اس کی فوج اور پہرے داروں میں سے کسی کو انھیں روکنے کی جرأت نہ ہو سکی اور دربار میں پہنچ کر انھوں نے اس کے تمام سرداروں کی موجودگی میں اسے اللہ تعالیٰ کا پیغام پہنچایا۔ فرعون نے موسیٰ علیہ السلام کی گفتگو سے اندازہ لگا لیا کہ اصل رسول وہی ہیں، ہارون صرف معاون ہیں، اس لیے اس نے موسیٰ علیہ السلام ہی کو مخاطب کیا، ہارون علیہ السلام سے بات نہیں کی۔ موسیٰ علیہ السلام سے بات کرتے ہوئے اس نے ان کی دعوت پر بات کرنے سے گریز کرتے ہوئے حکمرانوں کے عام ہتھکنڈے استعمال کیے، جن میں سے پہلا ہتھکنڈا ان کی پرورش کا احسان جتا کر شرمندہ کرنا تھا۔ چنانچہ کہنے لگا کہ کیا ہم نے تجھے اپنے پاس رکھ کر تیری اس وقت پرورش نہیں کی جب تو بچہ تھا اور تو اپنی عمر کے کئی برس ہم میں رہا۔ دوسرا ہتھکنڈا انھیں مجرم ثابت کرکے سزا سے خوف زدہ کرنا تھا۔ اس کا خیال تھا کہ پرورش کے احسان سے شرمندہ ہو کر یا جان کے خوف سے وہ زبان بند رکھیں گے۔ چنانچہ کہنے لگا : ’’اور تو نے اپنا وہ کام کیا جو تو نے کیا اور تو ناشکروں میں سے ہے‘‘ یعنی ہمارے اتنے احسانات کے باوجود تم نے ہمارے ایک آدمی کو قتل کر دیا جو یقینا تمھاری احسان فراموشی تھی۔ {’’ اَلَمْ نُرَبِّكَ فِيْنَا ‘‘} (کیا ہم نے تیری اپنے ہاں پرورش نہیں کی) کے الفاظ سے ان مفسرین اور مؤرخین کی بات کی کسی قدر تائید ہوتی ہے جن کا خیال ہے کہ یہ فرعون وہ نہیں تھا جس کے گھر موسیٰ علیہ السلام کی پرورش ہوئی تھی، بلکہ اس کا بیٹا تھا، کیونکہ اگر یہ وہی ہوتا تو کہتا، کیا میں نے تیری پرورش نہیں کی اور تو کئی سال میرے پاس رہا؟ (واللہ اعلم)"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {قَالَ فَعَلْتُهَاۤ اِذًا وَّ اَنَا مِنَ الضَّآلِّيْنَ : ’’ اَنَا مِنَ الضَّآلِّيْنَ ‘‘} ’’میں اس وقت ضلالت والوں سے تھا۔‘‘ لفظ ’’ضلالت‘‘ ہر جگہ گمراہی کے معنی میں نہیں ہوتا، بلکہ عربی زبان میں اسے ناواقفیت، نادانی، خطا اور بھول وغیرہ کے معنی میں بھی استعمال کیا جاتا ہے۔ قبطی کے قتل کے واقعہ کو دیکھیں تو یہاں اس کا معنی نادانی، خطا یا بھول ہی ہو سکتا ہے، کیونکہ نہ ان کا ارادہ اسے قتل کرنے کا تھا اور نہ ان کے وہم و گمان میں یہ بات تھی کہ ایک گھونسے سے اس کا کام تمام ہو جائے گا۔ موسیٰ علیہ السلام نے پہلے اس کے اس طعن کا جواب دیا جس سے وہ انھیں مجرم ثابت کرنا چاہتا تھا، کیونکہ جرم ثابت ہونے سے وہ قصاص کے مستحق ٹھہرتے تھے۔ چنانچہ انھوں نے دھمکی کا جواب کسی خوف کے بغیر نہایت دلیری سے دیا کہ ہاں، وہ کام میں نے کیا ہے، مگر میں نے اس وقت یہ کام جان بوجھ کر نہیں کیا، نہ میرا یہ ارادہ تھا کہ اسے قتل کروں، مجھے کیا خبر تھی کہ ایک گھونسے میں اس کا دم نکل جائے گا، کبھی ایک گھونسے سے بھی موت واقع ہوا کرتی ہے؟ مجھ سے یہ کام دانستہ نہیں خطا اور بھول سے ہوا ہے اور کیا کسی قانون میں خطا سے ہونے والے کام کو جرم قرار دیا جاتا ہے ؟"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ …:} یعنی اس وقت کی بات چھوڑو جب میں خطا کاروں سے تھا، حاضر وقت کی بات کرو، جو یہ ہے کہ جب میں تمھارے خوف سے تمھارے ہاں سے بھاگ گیا تو میرے رب نے مجھے حکم عطا کیا، یعنی نبوت و علم بخشا اور مجھے رسولوں میں شامل فرما لیا۔ اب میں وہ موسیٰ نہیں جو خطا کاروں سے تھا، اب میں اللہ تعالیٰ کا انتخاب ہوں اور تمھارے پاس اس کا پیغام لانے والا ہوں۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) {وَ تِلْكَ نِعْمَةٌ تَمُنُّهَا عَلَيَّ …:} یہ اس کے پہلے طعن کا جواب ہے، یعنی آج تو مجھ پر یہ احسان کیسے جتلا سکتا ہے کہ تو نے اپنے گھر میں رکھ کر میری پرورش کی، حالانکہ اس کا سبب تیرا ظلم و ستم تھا۔ اگر تو نے بنی اسرائیل کو غلام بنا کر ان کے بیٹوں کو قتل کرنے کا سلسلہ شروع نہ کر رکھا ہوتا تو میں اپنے گھر میں پرورش پاتا، میری والدہ کو کیا ضرورت پڑی تھی کہ مجھے صندوق میں بند کرکے دریا میں بہاتی اور اس طرح میں تیرے گھر پہنچ جاتا۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ {قَالَ فِرْعَوْنُ وَ مَا رَبُّ الْعٰلَمِيْنَ :} فرعون نے جب دیکھا کہ وہ موسیٰ علیہ السلام کو خوف زدہ نہیں کر سکا اور وہ کسی صورت توحید کی دعوت سے اور بنی اسرائیل کی آزادی کے مطالبے سے باز آنے والے نہیں تو وہ مجادلے پر اتر آیا۔ عموماً مناظرے کا کامیاب اسلوب یہ سمجھا جاتا ہے کہ مدّ مقابل کو سوالات میں الجھا دیا جائے۔ تو اس کے مطابق اس نے کہا : «{ وَ مَا رَبُّ الْعٰلَمِيْنَ }» ’’اور رب العالمین کیا ہے؟‘‘ واؤ عطف اس لیے ہے کہ اس سے پہلے وہ ایک سوال کر چکا تھا : «{ اَلَمْ نُرَبِّكَ فِيْنَا }» یہ اس پر عطف ہے۔ یہاں مفسرین عام طور پر لکھتے ہیں کہ {’’ مَا ‘‘} کے ساتھ کسی چیز کی حقیقت کے متعلق سوال ہوتا ہے، چونکہ مخلوق خالق کی حقیقت کا ادراک کر ہی نہیں سکتی، اس لیے موسیٰ علیہ السلام نے اللہ تعالیٰ کی ربوبیت کے آثار کو اس کے تعارف کے لیے پیش فرمایا۔ ابن عاشور نے فرمایا، لفظ {’’ مَا ‘‘} کے ساتھ سوال ہو تو {’’ مَا ‘‘} کے بعد والی چیز کی وہ حقیقت معلوم کرنا مقصود ہوتی ہے جس سے وہ دوسری چیزوں سے الگ ہو جائے۔ اس لیے کسی کی قوم یا قبیلہ معلوم کرنا ہو تو {’’ مَا ‘‘} کے ساتھ سوال ہوتا ہے، جیسا کہ فارس کے ساتھ ایک جنگ میں کسریٰ کے جرنیل کی مغیرہ بن شعبہ رضی اللہ عنہ سے گفتگو ہوئی تو اس نے پوچھا : [ مَا أَنْتُمْ؟ ] ’’تم کیا ہو؟‘‘ تو انھوں نے فرمایا : [ نَحْنُ أُنَاسٌ مِنَ الْعَرَبِ ] [ بخاري، الجزیۃ، باب الجزیۃ والموادعۃ … : ۳۱۵۹ ] ’’ہم عرب کے کچھ لوگ ہیں۔‘‘ ¤ ➋ قبطیوں کے ہاں کئی معبودوں کی پرستش ہوتی تھی، مشرکین کا علم الاصنام سراسر باطل ہونے کی وجہ سے نہایت پُر پیچ اور ناقابل فہم ہوتا ہے۔ فرعون کی سلطنت میں کئی معبودوں کی پرستش ہوتی تھی، فرعون بھی ان کی خدائی کو مانتا تھا۔ (دیکھیے اعراف : ۱۲۷) اس کے باوجود وہ ان تمام معبودوں کا نمائندہ بن کر اپنے آپ کو رب اعلیٰ کہتا اور کہلواتا تھا، جیسا کہ فرمایا : «{ فَحَشَرَ فَنَادٰى (23) فَقَالَ اَنَا رَبُّكُمُ الْاَعْلٰى }» [ النازعات : ۲۳، ۲۴ ] ’’پھر اس نے اکٹھا کیا، پس پکارا ۔ پس اس نے کہا میں تمھارا سب سے اونچا رب ہوں۔‘‘ کبھی یہ کہتا : «{ يٰۤاَيُّهَا الْمَلَاُ مَا عَلِمْتُ لَكُمْ مِّنْ اِلٰهٍ غَيْرِيْ }» [ القصص : ۳۸ ] ’’اے سردارو! میں نے اپنے سوا تمھارے لیے کوئی معبود نہیں جانا۔‘‘ بظاہر اس سے معلوم ہوتا ہے کہ وہ ’’رب العالمین‘‘ کو نہیں جانتا تھا، اس لیے اس نے پوچھا : «{ وَ مَا رَبُّ الْعٰلَمِيْنَ }» مگر حقیقت یہ ہے کہ وہ ’’رب العالمین‘‘ کو اچھی طرح جانتا تھا، جیسا کہ موسیٰ علیہ السلام نے اسے فرمایا تھا : «{ لَقَدْ عَلِمْتَ مَاۤ اَنْزَلَ هٰۤؤُلَآءِ اِلَّا رَبُّ السَّمٰوٰتِ وَ الْاَرْضِ بَصَآىِٕرَ }» [ بني إسرائیل : ۱۰۲ ] ’’بلاشبہ یقینا تو جان چکا ہے کہ انھیں آسمانوں اور زمین کے رب کے سوا کسی نے نہیں اتارا، اس حال میں کہ واضح دلائل ہیں۔‘‘ اور اللہ تعالیٰ نے اس کے اور اس کی قوم کے متعلق شہادت دی ہے، فرمایا : «{ وَ جَحَدُوْا بِهَا وَ اسْتَيْقَنَتْهَاۤ اَنْفُسُهُمْ ظُلْمًا وَّ عُلُوًّا }» [[ النمل : ۱۴] ’’اور انھوں نے ظلم اور تکبر کی وجہ سے ان کا انکار کر دیا، حالانکہ ان کے دل ان کا اچھی طرح یقین کر چکے تھے۔‘‘ معلوم ہوا اس کا سوال {’’ وَ مَا رَبُّ الْعٰلَمِيْنَ ‘‘} تجاہلِ عارفانہ تھا، وہ جاننے کے باوجود ماننے کے لیے تیار نہیں تھا۔ سورۂ طٰہٰ میں اس کا سوال یہ نقل ہوا ہے : «{ فَمَنْ رَّبُّكُمَا يٰمُوْسٰى }» [ طٰہٰ : ۴۹ ] ’’تو تم دونوں کا رب کون ہے اے موسیٰ!؟‘‘"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) { قَالَ رَبُّ السَّمٰوٰتِ وَ الْاَرْضِ …:} موسیٰ علیہ السلام نے جواب دیا، رب العالمین وہ ہے جو آسمانوں کا اور زمین کا اور ان کے درمیان کی ہر چیز کا رب ہے، اگر تم میں کسی چیز پر یقین کرنے کی صلاحیت ہے تو اس بات پر یقین کے سوا تمھارے لیے کوئی چارہ نہیں، تم تو زمین کے ایک نہایت چھوٹے سے قطعہ مصر پر حکومت کی وجہ سے رب اعلیٰ بن رہے ہو، حالانکہ تم نے مصر کو نہ پیدا کیا نہ اہل مصر کو روزی دے رہے ہو۔ تو وہ جس نے زمین و آسمان اور وہ سب کچھ پیدا فرمایا جو ان دونوں کے درمیان ہے اور ان کی پرورش بھی کر رہا ہے۔ غور کرو تمھیں کس بات پر یقین آتا ہے، اپنے رب ہونے پر یا اس کے رب ہونے پر جو آسمانوں کا، زمین کا اور ان دونوں کے درمیان کی ہر چیز کا خالق و مالک اور رازق ہے؟"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) { قَالَ لِمَنْ حَوْلَهٗۤ اَلَا تَسْتَمِعُوْنَ:} ظاہر ہے فرعون رب اعلیٰ ہونے کا لاکھ دعویٰ کرے، آسمان و زمین کے ایک ذرّے کا خالق و پروردگار نہیں تھا اور اپنی اوقات کو خوب جانتا تھا، جب وہ موسیٰ علیہ السلام کی بات کا جواب نہ دے سکا تو بات کو خلط ملط کرنے، اپنے درباریوں کو ابھارنے اور موسیٰ علیہ السلام اور ان کی دلیل کو بے وزن بنانے کے لیے کہنے لگا، کیا تم غور سے سنتے نہیں، یہ شخص کیسی عجیب بات کر رہا ہے؟ کیا ایسی بات کبھی تمھارے سننے میں آئی بھی ہے؟"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) {قَالَ رَبُّكُمْ وَ رَبُّ اٰبَآىِٕكُمُ الْاَوَّلِيْنَ:} فرعون نے درباریوں کو بھڑکایا تو موسیٰ علیہ السلام نے انھیں بھی خطاب میں شامل کر لیا اور فرمایا ’’رب العالمین‘‘ وہ ہے جو تمھارا اور تمھارے پہلے آبا و اجداد کا رب ہے، جو پہلے بھی موجود تھا، اب بھی ہے اور آئندہ بھی رہے گا۔ یہ بات اگرچہ {’’ رَبُّ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} کے ضمن میں آ چکی تھی کہ آسمان و زمین تو فرعون کی پیدائش سے پہلے پیدا ہو چکے تھے، یہ ان کا رب کیسے بن گیا، مگر موسیٰ علیہ السلام بات کو مزید قریب کرکے ان کے اور ان کے باپ دادا تک لے آئے کہ سوچو، جب تمھارے باپ یا دادا موجود تھے تو رب ہونے کے یہ مدعی صاحب کیا اس وقت موجود تھے؟ اور آئندہ جب تمھاری اولاد کی اولاد ہو گی تو اس وقت یہ رب صاحب کہاں ہوں گے؟"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) { قَالَ اِنَّ رَسُوْلَكُمُ الَّذِيْۤ اُرْسِلَ اِلَيْكُمْ لَمَجْنُوْنٌ:} موسیٰ علیہ السلام کی دلیل اتنی واضح اور زبردست تھی کہ فرعون اس کا جواب دینا چھوڑ کر موسیٰ علیہ السلام کی ذات پر حملہ آور ہو گیا اور کہنے لگا، یقینا تمھارا یہ رسول، جو تمھاری طرف بھیجا گیا ہے، ضرور پاگل ہے۔ موسیٰ علیہ السلام کے چہرے پر حکمت و دانائی اور نور فراست کے آثار ان کے دیوانہ یا پاگل ہونے کی نفی کر رہے تھے، اس لیے فرعون نے {’’ اِنَّ ‘‘} اور ’’لام تاکید‘‘ کے ساتھ انھیں مجنون قرار دیا کہ یقینا یہ ضرور پاگل ہے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { قَالَ رَبُّ الْمَشْرِقِ وَ الْمَغْرِبِ …:} شاہ عبد القادر لکھتے ہیں: ’’موسیٰ علیہ السلام ایک بات کہے جاتے تھے اللہ کی قدرتیں بتانے کو اور فرعون بیچ میں اپنے سرداروں کو ابھارتا تھا کہ ان کو یقین نہ آ جائے۔‘‘ پاگل ہونے کے الزام کے جواب میں موسیٰ علیہ السلام نے اب وہ دلیل پیش کی جو ان کے جدّ امجد ابراہیم خلیل اللہ علیہ السلام نے پیش کی تھی کہ ’’رب العالمين‘‘ وہ ہے جو مشرق و مغرب اور ان کے مابین کا رب ہے، جو ہمیشہ سے سورج کو مشرق سے طلوع کرتا ہے اور مغرب میں غروب کرتا ہے، تمھیں رب ہونے کا زعم ہے تو ذرا سورج کو مغرب سے نکال کر دکھا دو۔ ¤ ➋ { اِنْ كُنْتُمْ تَعْقِلُوْنَ:} مجھے دیوانہ بتاتے ہو اور خود عقل مند ہونے کا دعویٰ کرتے ہو، اگر تم میں واقعی عقل ہے تو بتاؤ کہ رب وہ ہے جس کے حکم سے سورج ہمیشہ مشرق سے طلوع اور مغرب میں غروب ہوتا ہے، یا تم جو ایک دفعہ بھی ایسا نہیں کر سکتے۔پہلی دفعہ موسیٰ علیہ السلام نے فرعون اور اس کے ساتھیوں کے متعلق نرم لفظ استعمال فرمائے، یعنی {’’ اِنْ كُنْتُمْ مُوْقِنِیْنَ‘‘} لیکن جب اس نے مجنون ہونے کا الزام لگایا تو موسیٰ علیہ السلام نے سخت الفاظ استعمال فرمائے {’’ اِنْ كُنْتُمْ تَعْقِلُوْنَ‘‘} کہ اگر تم سمجھتے ہو۔ (ابن جَزیّ)"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { قَالَ لَىِٕنِ اتَّخَذْتَ اِلٰهًا غَيْرِيْ …:} ہر ظالم و جابر اور باطل کے علم بردار حکمران کا وتیرہ ہے کہ جب وہ دلیل کے میدان میں شکست کھاتا ہے تو آخری حربے کے طور پر طاقت کے استعمال کی دھمکی دیتا ہے کہ یا تو ہمارے غلط کو بھی صحیح مانو، ورنہ سزا کے لیے تیار ہو جاؤ۔ فرعون نے بھی آخر میں صاف کہہ دیا کہ مصر میں میرے سوا کوئی خدا نہیں اور نہ کسی کا حکم چلے گا، اگر میرے سوا کسی اور معبود کی حکومت مانی تو تمھارے لیے قید خانہ تیار ہے۔ ¤ ➋ {لَاَجْعَلَنَّكَ مِنَ الْمَسْجُوْنِيْنَ :} فرعون نے موسیٰ علیہ السلام کو یہ کہنے ککے بجائے کہ{’’لَأَسْجُنَنَّكَ‘‘} (میں تجھے قید کر دوں گا) یہ کہا کہ ’’میں تجھے قید کیے ہوئے لوگوں میں شامل کر دوں گا۔‘‘ اس میں وہ موسیٰ علیہ السلام کو نہایت خوفناک نتیجے سے ڈرا رہا تھا کہ ان لوگوں کا حال دیکھ لو جنھیں میں نے قید کر رکھا ہے، تمھیں بھی ان کے ساتھ شامل کر دوں گا۔ واضح رہے کہ آخرت کا منکر اور جواب دہی کے احساس سے عاری ہونے کی وجہ سے فرعون نہایت سنگدل تھا اور انسانیت اور رحم سے یکسر ناآشنا تھا، وہ اپنے مخالفوں سے قید خانے میں جو سلوک کرتا ہو گا بنی اسرائیل کے بیٹوں کو قتل کرنے کو پیش نظر رکھ کر اس کا تصور کچھ مشکل نہیں۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {قَالَ اَوَ لَوْ جِئْتُكَ بِشَيْءٍ مُّبِيْنٍ :} جب فرعون لاجواب ہو گیا اور قید خانے کی دھمکی دینے لگا تو موسیٰ علیہ السلام نے اللہ تعالیٰ کے عطا کیے ہوئے معجزے پیش کرنے کی پیش کش کی اور اس کے لیے نہایت نرم الفاظ اور نرم لہجہ اختیار فرمایا کہ ہو سکتا ہے وہ ان کے صدق کی واضح دلیل دیکھ کر ہی ایمان لے آئے۔ {’’ اَوَ لَوْ جِئْتُكَ ‘‘} میں واؤ سے پہلے ایک لفظ محذوف ہے : {’’أَتَفْعَلُ بِيْ ذٰلِكَ وَلَوْ جِئْتُكَ…‘‘} یعنی کیا اگر میں تمھارے سامنے بالکل واضح چیز پیش کر دوں، پھر بھی تم نہیں مانو گے اور میرے ساتھ یہی سلوک کرو گے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) {قَالَ فَاْتِ بِهٖۤ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ:} فرعون کے پاس اس کے سوا کوئی چارہ نہ تھا کہ اس نے کہا، اگر سچے ہو تو پیش کرو۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 33،32) {فَاَلْقٰى عَصَاهُ فَاِذَا هِيَ …:} ان آیات کی تفسیر کے لیے دیکھیے سورۂ اعراف (۱۰۷، ۱۰۸)۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33،32) {فَاَلْقٰى عَصَاهُ فَاِذَا هِيَ …:} ان آیات کی تفسیر کے لیے دیکھیے سورۂ اعراف (۱۰۷، ۱۰۸)۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 35،34) {قَالَ لِلْمَلَاِ حَوْلَهٗۤ … :} ابھی خدائی کے دعوے تھے اور ابھی اپنے وزیروں اور درباریوں سے پوچھنے پر اتر آیا کہ بتاؤ کیا کیا جائے، اس آئی بلا کو کیونکر ٹالا جائے؟ اس نے اپنے اقتدار کا سورج غروب ہوتے دیکھ کر یہ رویہ اختیار کیا۔ یہاں یہ ذکر ہے کہ یہ بات فرعون نے کہی، جب کہ سورۂ اعراف (۱۰۹، ۱۱۰) میں ہے کہ یہ بات فرعون کے سرداروں نے کہی تھی۔ حقیقت یہ ہے کہ یہ بات فرعون نے کہی تو اس کے سرداروں نے بھی وہی بات دہرا دی۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35،34) {قَالَ لِلْمَلَاِ حَوْلَهٗۤ … :} ابھی خدائی کے دعوے تھے اور ابھی اپنے وزیروں اور درباریوں سے پوچھنے پر اتر آیا کہ بتاؤ کیا کیا جائے، اس آئی بلا کو کیونکر ٹالا جائے؟ اس نے اپنے اقتدار کا سورج غروب ہوتے دیکھ کر یہ رویہ اختیار کیا۔ یہاں یہ ذکر ہے کہ یہ بات فرعون نے کہی، جب کہ سورۂ اعراف (۱۰۹، ۱۱۰) میں ہے کہ یہ بات فرعون کے سرداروں نے کہی تھی۔ حقیقت یہ ہے کہ یہ بات فرعون نے کہی تو اس کے سرداروں نے بھی وہی بات دہرا دی۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 37،36) {قَالُوْۤا اَرْجِهْ وَ اَخَاهُ … :} ان آیات کی تفسیر سورۂ اعراف (۱۱۱، ۱۱۲) میں گزر چکی ہے، فرق یہ ہے کہ وہاں {’’اَرْسِلْ ‘‘} ہے اور یہاں {’’ابْعَثْ‘‘ } ہے، دونوں ہم معنی ہیں۔ اس کے علاوہ وہاں {’’ سٰحِرٍ عَلِيْمٍ ‘‘} ہے اور یہاں {’’ سَحَّارٍ عَلِيْمٍ ‘‘} ہے، یہاں مبالغہ کا صیغہ ہونے کی وجہ سے ترجمہ کیا ہے : ’’کہ وہ تیرے پاس ہر بڑا جادو گر لے آئیں، جو بہت ماہر فن ہو۔‘‘ جبکہ وہاں ترجمہ ہے ’’کہ وہ تیرے پاس ہر ماہر فن جادوگر لے آئیں۔‘‘"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37،36) {قَالُوْۤا اَرْجِهْ وَ اَخَاهُ … :} ان آیات کی تفسیر سورۂ اعراف (۱۱۱، ۱۱۲) میں گزر چکی ہے، فرق یہ ہے کہ وہاں {’’اَرْسِلْ ‘‘} ہے اور یہاں {’’ابْعَثْ‘‘ } ہے، دونوں ہم معنی ہیں۔ اس کے علاوہ وہاں {’’ سٰحِرٍ عَلِيْمٍ ‘‘} ہے اور یہاں {’’ سَحَّارٍ عَلِيْمٍ ‘‘} ہے، یہاں مبالغہ کا صیغہ ہونے کی وجہ سے ترجمہ کیا ہے : ’’کہ وہ تیرے پاس ہر بڑا جادو گر لے آئیں، جو بہت ماہر فن ہو۔‘‘ جبکہ وہاں ترجمہ ہے ’’کہ وہ تیرے پاس ہر ماہر فن جادوگر لے آئیں۔‘‘"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 39،38) {فَجُمِعَ السَّحَرَةُ لِمِيْقَاتِ … :} سورۂ طٰہٰ (۵۹) میں اس مقرر کر دہ وقت اور مقام کا ذکر گزر چکا ہے۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39،38) {فَجُمِعَ السَّحَرَةُ لِمِيْقَاتِ … :} سورۂ طٰہٰ (۵۹) میں اس مقرر کر دہ وقت اور مقام کا ذکر گزر چکا ہے۔"
    },
    {
      "ayah": 40,
      "tafsir": ""
    },
    {
      "ayah": 41,
      "tafsir": ""
    },
    {
      "ayah": 42,
      "tafsir": ""
    },
    {
      "ayah": 43,
      "tafsir": ""
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) { وَ قَالُوْا بِعِزَّةِ فِرْعَوْنَ … :} فرعون کی تعظیم کے لیے اس کی عزت کی قسم کھائی کہ ہم ضرور ہی جیتیں گے۔ اس سے جادوگروں کا مقصد فرعون کو خوش اور موسیٰ علیہ السلام کو مرعوب کرنا تھا۔ جاہلیت میں لوگ اس قسم کی قسمیں کھایا کرتے تھے، اسلام میں اس سے منع کر دیا گیا۔ عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَلاَ إِنَّ اللّٰهَ يَنْهَاكُمْ أَنْ تَحْلِفُوْا بِآبَائِكُمْ مَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللّٰهِ أَوْ لِيَصْمُتتْ ] [ بخاری، الأیمان والنذور، باب لا تحلفوا بآبائکم : ۶۶۴۶ ] ’’خبر دار! اللہ تعالیٰ تمھیں تمھارے باپوں کی قسم کھانے سے منع کرتا ہے، جسے قسم کھانی ہو وہ اللہ کی قسم کھائے، یا خاموش رہے۔‘‘ اس کے باوجود آج کل بعض مسلمان بھی اللہ تعالیٰ کی ذات یا صفات کی قسم کھانے پر مطمئن نہیں ہوتے، بلکہ اپنے پیر و مرشد یا کسی بزرگ کی قبر کی قسم کھاتے ہیں، یا عام رواج کے مطابق کہہ دیتے ہیں مجھے تیری قسم یا تیرے سر کی قسم وغیرہ، اس طرح وہ دوسروں کی عظمت کا اظہار کرتے ہیں، تو جس طرح اللہ تعالیٰ کی جھوٹی قسم کھانا گناہ ہے مخلوق کی سچی قسم کھانا اس سے بھی بڑھ کر گناہ ہے۔"
    },
    {
      "ayah": 45,
      "tafsir": ""
    },
    {
      "ayah": 46,
      "tafsir": ""
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 48،47) {قَالُوْۤا اٰمَنَّا بِرَبِّ الْعٰلَمِيْنَ …:} ’’ہم تمام جہانوں کے رب پر ایمان لے آئے‘‘ کے بعد ’’موسیٰ اور ہارون کے رب پر‘‘ اس لیے کہا کہ کہیں فرعون کو شبہ نہ ہو کہ انھوں نے اسے تمام جہانوں کا رب قرار دے دیا ہے، کیونکہ وہ بھی اپنے آپ کو رب کہتا تھا۔ (کبیر)"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48،47) {قَالُوْۤا اٰمَنَّا بِرَبِّ الْعٰلَمِيْنَ …:} ’’ہم تمام جہانوں کے رب پر ایمان لے آئے‘‘ کے بعد ’’موسیٰ اور ہارون کے رب پر‘‘ اس لیے کہا کہ کہیں فرعون کو شبہ نہ ہو کہ انھوں نے اسے تمام جہانوں کا رب قرار دے دیا ہے، کیونکہ وہ بھی اپنے آپ کو رب کہتا تھا۔ (کبیر)"
    },
    {
      "ayah": 49,
      "tafsir": ""
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) { قَالُوْا لَا ضَيْرَ …: ’’ لَا ضَيْرَ ‘‘} کوئی نقصان نہیں۔ {’’ضَارَ يَضِيْرُ ضَيْرًا‘‘} اور {’’ضَرَّ يَضُرُّ ضَرًّا‘‘} ہم معنی ہیں، یعنی بہرحال اللہ کی طرف تو لوٹنا ہی ہے، اس طرح مریں گے تو شہادت کا درجہ پائیں گے اور صبر کا اجر ملے گا۔ (وحیدی)"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) {اَنْ كُنَّاۤ اَوَّلَ الْمُؤْمِنِيْنَ:} یعنی دلیل واضح ہو جانے کے بعد قومِ فرعون میں سے سب سے پہلے ہم ایمان لائے۔ ¤ نوٹ! آیت (۴۱) سے (ا۵) تک کی تفسیر کے لیے سورۂ اعراف (۱۱۳ تا ۱۲۶) اور سورۂ طٰہٰ (۶۵ تا ۷۵) کی تفسیر ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ { وَ اَوْحَيْنَاۤ اِلٰى مُوْسٰۤى اَنْ اَسْرِ بِعِبَادِيْۤ …:} اوپر کے واقعات کے بعد بنی اسرائیل کی ہجرت کا ذکر شروع ہوتا ہے، اس کا یہ مطلب نہیں کہ اس کے بعد فوراً ہی موسیٰ علیہ السلام کو بنی اسرائیل سمیت مصر سے نکل جانے کا حکم دے دیا گیا، بلکہ یہاں کئی سال کی تاریخ چھوڑ دی گئی ہے، جس کا ذکر سورۂ اعراف (۱۲۷ تا ۱۳۵) اور سورۂ یونس (۸۳ تا ۸۹) میں گزر چکا ہے اور جس کا ایک حصہ آگے سورۂ مؤمن (۲۳ تا ۴۶) اور سورۂ زخرف (۴۶ تا ۵۶) میں آ رہا ہے۔ یہاں چونکہ سلسلہ کلام کی مناسبت سے صرف یہ بتانا مقصود ہے کہ جس فرعون نے صریح نشانیاں دیکھ لینے کے باوجود یہ ہٹ دھرمی دکھائی تھی اس کا انجام آخر کار کیا ہوا۔ ¤ ➋ ان آیات میں ایک بہت بڑی عبرت یہ ہے کہ حق واضح ہونے کے بعد اسے تسلیم کرنے میں ایک طرف جادوگرہیں، جنھوں نے ایمان لانے میں ایک لمحہ کی تاخیر نہیں کی اور ہاتھ پاؤں کاٹنے اور سولی پر چڑھانے کی دھمکیاں بھی انھیں حق سے برگشتہ نہیں کر سکیں، دوسری طرف فرعون اور اس کی قوم ہے، جو سالہا سال تک ان معجزوں کے علاوہ مزید نشانیاں دیکھتے رہے اور بار بار ایمان لانے اور بنی اسرائیل کو آزادی دینے کا وعدہ کرتے رہے، اس کے باوجود غرق ہونے تک ایمان سے محروم رہے۔ سچ فرمایا موسیٰ علیہ السلام نے : «{ اِنْ هِيَ اِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَنْ تَشَآءُ وَ تَهْدِيْ مَنْ تَشَآءُ}» [ الأعراف : ۱۵۵ ] ’’یہ نہیں ہے مگر تیری آزمائش، جس کے ساتھ تو گمراہ کرتا ہے جسے چاہتا ہے اور ہدایت بخشتا ہے جسے چاہتا ہے۔‘‘ سورت کے آغاز میں رسول اللہ صلی اللہ علیہ وسلم کو کفار کے ایمان نہ لانے پر تسلی دیتے ہوئے اسی حقیقت کی طرف توجہ دلائی ہے۔ دیکھیے اسی سورت کی آیات (۳ تا ۹)۔ ¤ ➌ جب فرعون کا ظلم و ستم حد سے بڑھ گیا تو موسیٰ علیہ السلام نے فرعون اور اس کی قوم کے خلاف اللہ تعالیٰ سے دعا کی۔ (دیکھیے یونس : ۸۸) اللہ تعالیٰ نے ان کی دعا قبول فرمائی اور حکم دیا کہ میرے (مسلم) بندوں کو (بنی اسرائیلی ہوں یا کوئی اور) لے کر راتوں رات نکل جاؤ اور یاد رکھو ! تمھارا تعاقب کیا جائے گا، اس لیے اتنا فاصلہ طے کر لو کہ تعاقب کرنے والے جلدی تم تک نہ پہنچ سکیں۔ چنانچہ ایسے موقع پر معروف طریقے کے مطابق پورے مصر کے بنی اسرائیل کے لیے ایک وقت اور ایک جگہ مقرر کر دی گئی، جس پر وہ موسیٰ علیہ السلام کے ساتھ جلد از جلد فرعون کی سلطنت (مصر) سے نکل جانے کے لیے رات کو روانہ ہو گئے۔ بعض تفاسیر میں ہے کہ ان میں سے ہر ایک نے قبطیوں سے عاریتاً زیور مانگ لیے تھے جنھیں وہ ساتھ لے کر ہی روانہ ہو گئے، مگر یہ بات درست نہیں۔ دیکھیے سورۂ طٰہٰ (۸۷) کی تفسیر۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) {فَاَرْسَلَ فِرْعَوْنُ فِي الْمَدَآىِٕنِ حٰشِرِيْنَ:} صبح ہوئی اور فرعون اور اس کے لوگوں نے دیکھا کہ بنی اسرائیل جا چکے ہیں تو وہ سخت برافروختہ ہوئے، وہ کسی صورت انھیں جانے نہیں دینا چاہتے تھے، کیونکہ وہ ان سے گھروں اور کھیتوں کی محنت مشقت کی بیگار لیتے تھے۔ اس لیے انھیں واپس لانے کے لیے فرعون نے فوجیں اکٹھی کرنے کے لیے تمام شہروں میں آدمی بھیج دیے۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) {اِنَّ هٰۤؤُلَآءِ لَشِرْذِمَةٌ قَلِيْلُوْنَ : ’’شِرْ ذِمَةٌ ‘‘} چھوٹا سا گروہ، اس نے انھیں مزید حقیر اور بے وقعت بتانے کے لیے {’’ قَلِيْلُوْنَ ‘‘} کے ساتھ تاکید کی، جو جمع قلت کا صیغہ ہے۔ {’’ هٰۤؤُلَآءِ ‘‘} کے ساتھ اشارہ بھی حقارت کے اظہار کے لیے ہے کہ یہ لوگ ایک چھوٹی سی جماعت اور تھوڑے سے لوگ ہیں، ہمیں ان کی کیا پروا ہے، ہم آسانی سے انھیں نیست و نابود کر سکتے ہیں اور چاہیں تو معمولی وسائل کے ساتھ انھیں واپس لا سکتے ہیں۔ ان الفاظ کے ساتھ وہ اپنے آپ کو اور اپنی قوم کو دلیری دے رہا تھا، جب کہ اس سے اس کا سخت خوف زدہ ہونا ظاہر ہو رہا تھا کہ اگر واقعی وہ اتنے ہی قلیل اور بے وقعت ہیں تو تمھیں اتنی فوجیں اکٹھی کرنے کی کیا ضرورت ہے۔ یہاں مفسرین نے بائبل سے متاثر ہو کر لکھا ہے کہ اس وقت بنی اسرائیل کی تعداد بچوں اور بوڑھوں کے علاوہ چھ لاکھ تھی، مگر یہ بات عقلاً ممکن ہی نہیں۔ حافظ ابن کثیر رحمہ اللہ نے انھیں مبالغہ قرار دیا ہے۔ جوانوں کی اتنی بڑی تعداد اگر موسیٰ علیہ السلام کے ساتھ ہوتی تو وہ کبھی ہجرت کا راستہ اختیار نہ کرتے اور چھ لاکھ کو {’’لَشِرْذِمَةٌ قَلِيْلُوْنَ ‘‘} بھی نہییں کہا جا سکتا۔ مفسر مراغی لکھتے ہیں : ’’جو بات یقین سے کہی جا سکتی ہے وہ یہ ہے کہ بنی اسرائیل فرعون کے لشکر سے بہت کم تھے، لیکن ہم کسی معین عدد کا یقین نہیں کر سکتے، تورات اور تاریخ کی کتابوں میں جو مبالغہ آمیز باتیں ہیں ان کی تصدیق بہت مشکل ہے، ان پر اعتماد نہیں کرنا چاہیے، ہمارے لیے بہتر ہے کہ ان کی تفاصیل میں نہ پڑیں۔ ابن خلدون نے اپنی تاریخ کے مقدمہ میں ان روایات کو باطل قرار دیا ہے اور ان میں موجود غلو کی وضاحت کی ہے، جسے نہ عقل قبول کرتی ہے اور نہ صحیح علمی بحث کے سامنے وہ قائم رہ سکتی ہیں۔‘‘"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) {وَ اِنَّهُمْ لَنَا لَغَآىِٕظُوْنَ :} وہ ہمیں غصہ دلانے والے ہیں کہ وہ ہمیشہ ہم سے آزادی کا مطالبہ کر کے بدامنی اور شور و شر پھیلاتے رہتے ہیں اور اب ہمارے پوچھے بغیر ہمارے ہاتھ سے نکل گئے۔ بعض مفسرین نے غصہ دلانے کے اسباب میں سے ان کا زیورات لے جانا بھی لکھا ہے، مگر یہ بات ثابت نہیں۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) {وَ اِنَّا لَجَمِيْعٌ حٰذِرُوْنَ :} یعنی اگرچہ وہ چھوٹا سا گروہ اور تھوڑے سے لوگ ہیں، مگر ہمیں ہر وقت ہوشیار اور چوکنا رہنا ہے اور ہر ایسے فتنے کا پہلے ہی سدباب کرنا ہے جو کسی وقت بھی پھیل سکتا ہے۔ خلاصہ یہ کہ اس نے اپنی قوم کو ان کا پیچھا کرنے پر آمادہ کرنے کے لیے سب سے پہلے یہ کہا کہ وہ قلیل تعداد والے چھوٹا سا گروہ ہیں، ان کے تعاقب میں کوئی مشکل درپیش نہیں، پھر یہ ذکر کیا کہ وہ ہمارے شدید دشمن ہیں اور انھوں نے ہمیں غصہ دلا دیا ہے، اس لیے ان کا ہر حال میں پیچھا کرنا ہو گا اور آخر میں اس نے لازمی احتیاطی تدبیر کے طور پر ان کے تعاقب کو ضروری قرار دیا۔ یہ سب باتیں اس نے اپنے خوف کو چھپانے کے لیے کیں کہ اتنا بڑا بادشاہ ہو کر ان بے سر و سامان لوگوں سے ڈر رہا ہے۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 58،57) {فَاَخْرَجْنٰهُمْ مِّنْ جَنّٰتٍ وَّ عُيُوْنٍ … :} چند ہی دنوں میں فرعون نے بنی اسرائیل کے تعاقب کے لیے ایک لشکر جرار تیار کر لیا۔ اس کے نزدیک تو یہ کام نہایت عقل مندی کا تھا کہ اس نے پورے ملک سے اپنی ساری قوت اکٹھی کرلی، تاکہ بنی اسرائیل کو زبردستی دوبارہ اپنی غلامی میں واپس لے آئے، یا انھیں دنیا سے مٹا دےے، مگر اللہ تعالیٰ کی تدبیر غالب ہے۔ اس نے فرعون کی چال اسی پر پلٹ دی، اس کی سلطنت کے بڑے بڑے ستون پورے ملک سے اکٹھے ہو گئے، تمام فوجیں بھی یکجا ہو گئیں اور ایک ہی وقت میں سمندر میں غرق کر دی گئیں۔ اگر وہ بنی اسرائیل کے لیے فوجیں جمع نہ کرتا تو زیادہ سے زیادہ ایک قوم اس کے ہاتھ سے نکل جاتی، مگر اس کی سلطنت اور عیش و عشرت کے اسباب باقی رہتے۔ اب اس کی تدبیر کا نتیجہ یہ نکلا کہ وہ خود، اس کی افواج اور اس کے امراء و وزراء، جو اس کی سلطنت کا خلاصہ تھے، سب سمندر میں غرق ہو گئے۔ یہ اس قادر و مختار کا کام تھا کہ ایک طرف اس نے فرعون کو، اس کی پوری قوت کو اور اس کی قوم کے سرداروں کو ان کے باغوں، چشموں، خزانوں اور عالی شان مقامات سے نکالا اور سمندر میں لا کر غرق کر دیا اور دوسری طرف بنی اسرائیل کو خیریت کے ساتھ مصر سے نکال کر آزادی سے ہمکنار کر دیا۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58،57) {فَاَخْرَجْنٰهُمْ مِّنْ جَنّٰتٍ وَّ عُيُوْنٍ … :} چند ہی دنوں میں فرعون نے بنی اسرائیل کے تعاقب کے لیے ایک لشکر جرار تیار کر لیا۔ اس کے نزدیک تو یہ کام نہایت عقل مندی کا تھا کہ اس نے پورے ملک سے اپنی ساری قوت اکٹھی کرلی، تاکہ بنی اسرائیل کو زبردستی دوبارہ اپنی غلامی میں واپس لے آئے، یا انھیں دنیا سے مٹا دےے، مگر اللہ تعالیٰ کی تدبیر غالب ہے۔ اس نے فرعون کی چال اسی پر پلٹ دی، اس کی سلطنت کے بڑے بڑے ستون پورے ملک سے اکٹھے ہو گئے، تمام فوجیں بھی یکجا ہو گئیں اور ایک ہی وقت میں سمندر میں غرق کر دی گئیں۔ اگر وہ بنی اسرائیل کے لیے فوجیں جمع نہ کرتا تو زیادہ سے زیادہ ایک قوم اس کے ہاتھ سے نکل جاتی، مگر اس کی سلطنت اور عیش و عشرت کے اسباب باقی رہتے۔ اب اس کی تدبیر کا نتیجہ یہ نکلا کہ وہ خود، اس کی افواج اور اس کے امراء و وزراء، جو اس کی سلطنت کا خلاصہ تھے، سب سمندر میں غرق ہو گئے۔ یہ اس قادر و مختار کا کام تھا کہ ایک طرف اس نے فرعون کو، اس کی پوری قوت کو اور اس کی قوم کے سرداروں کو ان کے باغوں، چشموں، خزانوں اور عالی شان مقامات سے نکالا اور سمندر میں لا کر غرق کر دیا اور دوسری طرف بنی اسرائیل کو خیریت کے ساتھ مصر سے نکال کر آزادی سے ہمکنار کر دیا۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) {كَذٰلِكَ وَ اَوْرَثْنٰهَا بَنِيْۤ اِسْرَآءِيْلَ: ’’ كَذٰلِكَ ‘‘} کو مبتدا محذوف کی خبر بنا لیں {’’أَيْ اَلْأَمْرُ كَذٰلِكَ‘‘} یا فعل محذوف کا فاعل {’’أَيْ وَقَعَ كَذٰلِكَ‘‘} یعنی اگرچہ یہ بات ناممکن دکھائی دیتی ہے، مگر ایسے ہی ہوا اور ہم نے ان باغوں، چشموں، خزانوں اور عالی شان جگہوں کا وارث بنی اسرائیل کو بنا دیا۔ یہاں ایک سوال ہے کہ اس آیت سے ظاہر ہو رہا ہے کہ فرعون کے غرق ہونے کے بعد بنی اسرائیل مصر کی سر زمین کے مالک بن گئے، جب کہ بنی اسرائیل جہاد سے انکار کی پاداش میں چالیس برس تو صحرا ہی میں دھکے کھاتے رہے، اس کے بعد بھی معروف یہی ہے کہ ان کی پیش قدمی شام کی طرف ہوئی اور شام ہی یوشع بن نون اور بعد میں داؤد اور سلیمان علیھم السلام کی سلطنت کا مرکز تھا۔ تاریخ میں ان کی مصر واپسی کا کہیں ذکر نہیں۔ ¤ اس سوال کا حل دو طرح سے ہے، ایک وہ جو بہت سے مفسرین نے اختیار کیا ہے کہ اللہ تعالیٰ نے بنی اسرائیل کو بہت سے باغوں، چشموں، خزانوں اور عمدہ جگہوں کا وارث بنایا، مگر مصر میں نہیں بلکہ شام میں۔ مصر کے باغوں، چشموں وغیرہ کی وارث اور قومیں بنیں۔ ان مفسرین کے نزدیک سورۂ دخان (۲۸) میں مذکور : «{ كَذٰلِكَ وَ اَوْرَثْنٰهَا قَوْمًا اٰخَرِيْنَ }» (اسی طرح ہوا اور ہم نے ان کا وارث اور لوگوں کو بنا دیا) کا مطلب یہ ہے کہ ہم نے سر زمین مصر کا وارث بنی اسرائیل کے سوا اور لوگوں کو بنا دیا۔ ابن عاشور، بقاعی اور بہت سے مفسرین کی یہی رائے ہے۔ ¤ دوسرا حل یہ ہے کہ اللہ تعالیٰ نے مصر کے باغوں، چشموں اور خزانوں وغیرہ کا مالک بالآخر بنی اسرائیل کو بنا دیا، مگر ان کو نہیں جو موسیٰ علیہ السلام کے ہمراہ ہجرت کرکے وہاں سے نکلے تھے، بلکہ بنی اسرائیل ہی کی ایک اور نسل کو یہ نعمت عطا ہوئی اور یہی مطلب ہے اس آیت کا : «{ كَذٰلِكَ وَ اَوْرَثْنٰهَا قَوْمًا اٰخَرِيْنَ }» [ الدخان : ۲۸ ] مجھے اس رائے پر اطمینان ہوتا ہے۔ رہی یہ بات کہ تاریخ میں بنی اسرائیل کے مصر واپس آنے کا ذکر نہیں تو حقیقت یہ ہے کہ قبل مسیح کی تاریخ کا پوری طرح اعتبار مشکل ہے اور اس میں کسی بات کے ذکر نہ ہونے کا یہ مطلب نہیں کہ وہ واقعہ ہوا ہی نہیں۔ سلیمان علیہ السلام جنھوں نے یمن کی ملکہ کی حکومت کا علم ہونے پر اسے اپنے زیر نگیں کرنے تک دم نہیں لیا اور قرآن کے بیان کے مطابق جنھیں ایسی سلطنت ملی جو بعد میں کسی کے شایان شان ہی نہیں، ان کے لیے مصر کو اپنی قلمرو میں شامل کرنا کچھ مشکل نہیں تھا۔ اس لیے فرعون کی قوم کو ان کے باغوں اور چشموں وغیرہ سے نکال لانے کے بعد ’’اور ہم نے ان کا وارث بنی اسرائیل کو بنا دیا‘‘ کے الفاظ کو ان کے ظاہر پر ہی رہنے دینا چاہیے۔ ہاں، یہ درست ہے کہ وہ بنی اسرائیل اور تھے جو وارث بنے، ’’تیہ‘‘ میں چالیس سال تک سر مارتے رہنے والے بنی اسرائیل نہیں تھے۔ (واللہ اعلم) مزید دیکھیے سورۂ اعراف (۱۳۶)۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) {فَاَتْبَعُوْهُمْ۠ مُّشْرِقِيْنَ:’’ مُشْرِقِيْنَ ‘‘} کے دو معنی ہو سکتے ہیں، ایک تویہ کہ وہ لوگ سورج طلوع ہوتے ہی بنی اسرائیل کے تعاقب میں روانہ ہو گئے اور دوسرا معنی یہ کہ وہ مشرق کی طرف رخ کیے ہوئے ان کے پیچھے چل پڑے۔ (ابن جزی) اگر نقشے کو غور سے دیکھیں تو مصر کے مشرق میں بحر قلزم ہے، جو شمال کی طرف پھیلتا گیا ہے، اس کے آخر میں مصر خشکی کے ذریعے سے صحرائے سینا کے ساتھ ملا ہوا ہے۔ معلوم ہوتا ہے کہ موسیٰ علیہ السلام نے مصر سے نکلنے کے لیے مشرق کی طرف سمندر کا رخ کیا، جس کے ساتھ ساتھ شمال کی طرف چلتے ہوئے وہ صحرائے سینا میں داخل ہونا چاہتے تھے، مگر فرعون نے انھیں سمندر پر ہی جا لیا۔ اب ان کے آگے سمندر تھا اور پیچھے فرعون اور اس کا لشکر۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) {فَلَمَّا تَرَآءَ الْجَمْعٰنِ …:’’تَرَاءٰی يَتَرَاءٰي تَرَائُيًا‘‘} (تفاعل) ایک دوسرے کو دیکھنا۔ جب دونوں جماعتیں ایک دوسرے کو نظر آنے لگیں تو موسیٰ علیہ السلام کے ساتھی کہنے لگے کہ ہم تو یقینا پکڑے جانے والے ہیں۔ {’’إِنَّ‘‘} اور {’’لام تاكيد‘‘} سے ان کے شدید خوف کا اظہار ہو رہا ہے کہ اب ہر صورت یہ لوگ ہمیں مار ڈالیں گے، یا پھر غلام بنا کر ساتھ لے جائیں گے۔ اس سے پہلے مصر میں بھی انھوں نے موسیٰ علیہ السلام سے کہا تھا : «{ اُوْذِيْنَا مِنْ قَبْلِ اَنْ تَاْتِيَنَا وَ مِنْۢ بَعْدِ مَا جِئْتَنَا }» [الأعراف : ۱۲۹ ] ’’ہمیں اس سے پہلے ایذا دی گئی کہ تو ہمارے پاس آئے اور اس کے بعد بھی کہ تو ہمارے پاس آیا۔‘‘ اب انھیں فرعون کی صورت میں موت نظر آئی تو انھوں نے یہ بات کہی۔ یہاں {’’قَالَ بَنُوْ إِسْرَائِيْلَ‘‘} کے بجائے {’’ قَالَ اَصْحٰبُ مُوْسٰۤى ‘‘} اس لیے فرمایا کہ ہجرت کرکے آنے والوں میں بنی اسرائیل کے علاوہ مسلمان بھی تھے۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) {قَالَ كَلَّا اِنَّ مَعِيَ رَبِّيْ سَيَهْدِيْنِ:} فرمایا، ایسا ہر گز نہیں ہو گا، بلکہ میرا رب میرے ساتھ ہے، اس نے فرعون کی طرف روانہ کرتے ہوئے خود مجھ سے وعدہ کیا ہے : «{ اِنَّا مَعَكُمْ مُّسْتَمِعُوْنَ }» [ الشعراء : ۱۵ ] ’’بے شک ہم تمھارے ساتھ خوب سننے والے ہیں۔‘‘ اسی کے حکم سے میں یہاں آیا ہوں، یہ کس طرح ہو سکتا ہے کہ اب وہ مجھے بے یارو مددگار چھوڑ دے، وہ مجھے ضرور ان سے نجات کا راستہ بتائے گا۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) {فَاَوْحَيْنَاۤ اِلٰى مُوْسٰۤى اَنِ اضْرِبْ بِّعَصَاكَ الْبَحْرَ …:} بعض لوگ جو معجزاات کے منکر ہیں فرعون اور اس کی قوم کے سمندر میں غرق ہونے کی تاویل یہ کرتے ہیں کہ جب بنی اسرائیل سمند رکے کنارے پہنچے تو اس وقت سمندر میں جزر کی کیفیت تھی، پانی پیچھے ہٹ گیا تھا، چنانچہ وہ بخیریت اس سے گزر گئے، ان کے پیچھے فرعون اور اس کی قوم بھی سمندر میں داخل ہو گئی۔ جب وہ پوری طرح اس کے اندر داخل ہو گئے تو سمندر میں ’’مد‘‘ کی کیفیت پیدا ہو گئی، پانی یک لخت چڑھ آیا اور وہ سب غرق ہو گئے۔ حقیقت یہ ہے کہ یہ تاویل نہیں بلکہ قرآن کا صاف انکار ہے۔ اللہ تعالیٰ فرماتے ہیں کہ ہم نے اس موقع پر موسیٰ علیہ السلام کو وحی کی کہ اپنا عصا سمندر پر مار، چنانچہ سمندر پھٹ گیا اور پانی کا ہر ٹکڑا ایک بہت بڑے، لمبے چوڑے اور اونچے پہاڑ کی صورت میں تھم گیا۔ سورۂ طٰہٰ میں ہے کہ ان کے درمیان (سمندر کی تہ کی گیلی اور دلدلی زمین میں) خشک راستہ بن گیا، فرمایا : «{ فَاضْرِبْ لَهُمْ طَرِيْقًا فِي الْبَحْرِ يَبَسًا }» [ طٰہٰ : ۷۷ ] ’’پس ان کے لیے سمندر میں ایک خشک راستہ بنا۔‘‘ غور کریں کہاں مد و جزر سے سمندر کا بڑھنا گھٹنا اور کہاں پانی کا اپنی سطح ہموار رکھنے کے بجائے بہت بڑے پہاڑوں کی صورت میں تھم جانا۔ دراصل ان لوگوں کا ایمان ہی نہیں کہ جس مالک نے آگ میں جلانے کی اور پانی میں بہنے اور ڈبونے کی خاصیت رکھی ہے، وہ جب چاہے ان سے یہ خاصیت واپس بھی لے سکتا ہے۔ یہ لوگ اندھے بہرے مادے ہی کو اپنا معبود بنائے بیٹھے ہیں، جو اپنے آپ پر بھی کوئی اختیار نہیں رکھتا۔ یہاں {’’فَأَوْحَيْنَا إِلَيْهِ‘‘} کے بجائے {’’ فَاَوْحَيْنَاۤ اِلٰى مُوْسٰۤى ‘‘} میں موسیٰ علیہ السلام کا نام اپنے رب پر اعتماد کے صلے میں ان کی عظمت شان کے اظہار کے لیے ہے۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) {وَ اَزْلَفْنَا ثَمَّ الْاٰخَرِيْنَ : ’’ أَزْلَفَ يُزْلِفُ‘‘} قریب کرنا۔ {’’ ثَمَّ ‘‘} وہاں، اس جگہ۔ {’’ الْاٰخَرِيْنَ ‘‘} دوسرے لوگ یعنی فرعون کی قوم۔ {’’ ثَمَّ ‘‘} کا مطلب یہ ہے کہ اس عظیم الشان موقع پر ہم نے فرعون اور اس کی قوم کو مسلمانوں کے قریب پہنچا دیا۔ یہ بھی اللہ تعالیٰ کا خاص تصرّف تھا کہ فرعون اور اس کی قوم سمندر میں داخل ہو گئی، ورنہ سمجھ سے بالاتر ہے کہ فرعون جیسا مادہ پرست ایسے خوفناک منظر کو دیکھتے ہوئے کیسے سمندر میں داخل ہو گیا۔ اس لیے اللہ تعالیٰ نے اس فعل کو اپنی طرف منسوب کرکے جمع متکلم کے صیغے کے ساتھ فرمایا کہ اس موقع پر ہم انھیں قریب لے آئے، ورنہ وہ کہاں قریب آنے والے تھے۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 66،65) {وَ اَنْجَيْنَا مُوْسٰى وَ مَنْ مَّعَهٗۤ …:} یعنی اس وقت وہ دونوں ایک دوسرے کے قریب تھے کہ ہم نے اس پانی سے موسیٰ علیہ السلام اور ان کے تمام ساتھیوں کو بچا کر نکال لیا، پھر ہم نے اسی پانی کے ساتھ دوسروں کو غرق کر دیا۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66،65) {وَ اَنْجَيْنَا مُوْسٰى وَ مَنْ مَّعَهٗۤ …:} یعنی اس وقت وہ دونوں ایک دوسرے کے قریب تھے کہ ہم نے اس پانی سے موسیٰ علیہ السلام اور ان کے تمام ساتھیوں کو بچا کر نکال لیا، پھر ہم نے اسی پانی کے ساتھ دوسروں کو غرق کر دیا۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) ➊ {اِنَّ فِيْ ذٰلِكَ لَاٰيَةً:} ایک ہی پانی کے ذریعے سے کسی کو بچا لینے اور کسی کو غرق کر دینے میں یقینا بہت بڑی نشانی ہے کہ اللہ کے رسولوں کو جھٹلانے والوں کا انجام کیا ہوتا ہے۔ اس کے علاوہ قوموں اور سلطنتوں میں انقلاب آتے رہتے ہیں، مگر ایسے حیرت انگیز اور عظیم الشان واقعہ کے ساتھ انقلاب ایک بہت بڑا معجزہ ہے۔ ¤ ➋ { وَ مَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِيْنَ:} اس جگہ {’’ اَكْثَرُهُمْ ‘‘} سے مراد ان لوگوں میں سے اکثر مراد نہیں جو فرعون کے ساتھ آئے تھے، کیونکہ وہ تو سب غرق ہو گئے اور غرق ہوتے وقت ایمان لائے بھی تو بے سود۔ (دیکھیے یونس : ۹۰، ۹۱) مراد مصر میں فرعون سے تعلق رکھنے والے تمام لوگ ہیں کہ ان کے اکثر ایمان نہیں لائے، بہت کم ایمان لائے۔ جن میں فرعون کے جادو گر، اس کی بیوی آسیہ اور اس کی قوم کے چند لڑکے شامل تھے۔ (دیکھیے یونس : ۸۳) اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی بھی ہے کہ اتنے عظیم الشان معجزے دیکھ کر بھی ان کے اکثر ایمان نہیں لائے تو آپ اپنی قوم کے اکثر لوگوں کے ایمان نہ لانے پر اتنے غمگین کیوں ہیں؟ یہاں مفسرین نے موسیٰ علیہ السلام پر ایمان لانے والوں میں ایک خاتون کا ذکر کیا ہے، جس کے بتانے پر بنی اسرائیل یوسف علیہ السلام کی میّت کو ان کی قبر سے نکال کر ساتھ لے گئے تھے اور جس نے اس شرط پر موسیٰ علیہ السلام کو اس قبر کی نشان دہی کی تھی کہ وہ اس بات کی ضمانت دیں کہ اسے جنت میں ان کا ساتھ ملے گا۔ حافظ ابن کثیر فرماتے ہیں، میں نے مفسرین کی دیکھا دیکھی اسے نقل کر دیا ہے، ورنہ اس میں نکارت ہے، یعنی یہ واقعہ صحیح نہیں ہے۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) {وَ اِنَّ رَبَّكَ لَهُوَ الْعَزِيْزُ الرَّحِيْمُ:} یعنی اپنے دشمنوں سے انتقام لینے والا اور اپنے ماننے والوں پر رحم کرنے والا ہے۔ چنانچہ دیکھو دم بھر میں فرعون کو غرق کر دیا اور بنی اسرائیل کو نجات دلا کر بادشاہ بنا دیا۔ اس میں ہمارے نبی کریم صلی اللہ علیہ وسلم کے لیے بھی بشارت ہے کہ اللہ تعالیٰ آپ کی مدد کرے گا، اگر ہجرت کے بعد مکہ کے فرعونوں نے آپ کا تعاقب کیا تو ان کا حال بھی مصر کے فرعون جیسا ہو گا اور پھر واقعی اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کی مدد فرمائی اور بدر کے میدان میں مکہ کے فرعونوں کو تباہ و برباد کیا۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) {وَ اتْلُ عَلَيْهِمْ نَبَاَ اِبْرٰهِيْمَ:} سورت کے شروع میں اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کی شدت غم کا ذکر فرمایا، جو آپ کو اپنی قوم کے ایمان نہ لانے پر لاحق ہوئی تھی۔ پھر موسیٰ علیہ السلام کا بیان فرمایا، تاکہ آپ کو تسلی ہو اور آپ کو یاد رہے کہ نہ آپ پہلے رسول ہیں اور نہ ہی آپ کی قوم جھٹلانے میں پہلی ہے، بلکہ موسیٰ علیہ السلام کے عظیم الشان معجزے لے کر آنے کے باوجود قبطیوں کے بہت ہی کم لوگ ان پر ایمان لائے۔ اس کے بعد ابو الانبیاء ابراہیم علیہ السلام کا ذکر فرمایا جو خلیل اللہ کے بلند منصب پر فائز تھے، تاکہ آپ کے سامنے وہ شخصیت بھی رہے جس کا غم بھی بے انتہا تھا، کیونکہ وہ اپنے باپ اور اپنی قوم کو آگ میں جاتے ہوئے دیکھتا تھا، مگر انھیں اس سے بچا نہ سکتا تھا۔ اس نے انھیں ہر طریقے سے سمجھانے کی کوشش کی، حتیٰ کہ دلیل کے ساتھ انھیں بالکل لاجواب کر دیا، مگر انھوں نے نہیں مانا، بلکہ آباء کی تقلید ہی پر جمے رہے۔ فرمایا : ’’اور ان (مشرکین مکہ) کے سامنے ابراہیم علیہ السلام کی عظیم خبر بھی پڑھ۔‘‘"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) { اِذْ قَالَ لِاَبِيْهِ وَ قَوْمِهٖ مَا تَعْبُدُوْنَ :} یہ سوال کہ تم کس چیز کی عبادت  کرتے ہو، پوچھنے کے لیے نہیں تھا، کیونکہ ابراہیم علیہ السلام جانتے تھے کہ وہ بت پوجتے ہیں، بلکہ بت پرستی پر غور و فکر کی دعوت دینے کے لیے تھا، کیونکہ اپنا موقف خود بیان کرتے وقت اس کی کمزوریاں انسان کے سامنے اس سے کہیں زیادہ آتی ہیں کہ کوئی دوسرا اسے بیان کرے۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) {قَالُوْا نَعْبُدُ اَصْنَامًا فَنَظَلُّ لَهَا عٰكِفِيْنَ:’’ اَصْنَامًا ‘‘} میں تنوین تعظیم کے لیے ہے۔ دن بھر کام کرنے کو {’’ظَلَّ يَظَلُّ‘‘} اور رات بھر کام کرنے کو {’’ بَاتَ يَبِيْتُ‘‘} کہتے ہیں۔ {’’ظَلَّ يَظَلُّ‘‘} کسی وقت کسی کام میں مصروف ہونے کے معنی میں بھی آتا ہے۔ {’’ عٰكِفِيْنَ ‘‘} اعتکاف کہتے ہیں کسی جگہ جم کر بیٹھے رہنا یعنی مجاوری۔ ابراہیم علیہ السلام کے سوال کے جواب میں اتنا کہنا ہی کافی تھا کہ {’’ اَصْنَامًا ‘‘} (بتوں کی) مگر انھوں نے فخر کے لیے کہا کہ ہم عظیم بتوں کی عبادت کرتے ہیں۔ {’’ لَهَا ‘‘} کو {’’ عٰكِفِيْنَ ‘‘} سے پہلے لانے سے تخصیص پیدا ہو رہی ہے، یعنی ہم انھی کے مجاور بنے رہتے ہیں۔ یہ ایسے ہی ہے کہ کسی قبر پرست کو سمجھانے کے لیے کہا جائے کہ تم کس چیز کی پوجا کر رہے ہو؟ (یعنی جس کا کوئی فائدہ نہیں) تو وہ آگے سے فخر کے ساتھ کہے کہ ہم تو فلاں دربار ہی کے مجاور ہیں۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 73،72) {قَالَ هَلْ يَسْمَعُوْنَكُمْ۠ اِذْ تَدْعُوْنَ …:} ابراہیم علیہ السلام نے کسی بھی ذات کی عبادت کے لیے اس میں پائی جانے والی تین صفات ذکر کرکے فرمایا کہ کیا ان میں یہ تینوں یا کوئی ایک صفت پائی جاتی ہے؟ کیا جب تم انھیں پکارتے ہو تو یہ تمھاری بات سنتے ہیں؟ یا تمھیں کوئی فائدہ پہنچاتے ہیں؟ یا نقصان پہنچاتے ہیں؟ اگر نہیں اور یقینا نہیں، تو ان کی عبادت کیوں کرتے ہو ؟"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73،72) {قَالَ هَلْ يَسْمَعُوْنَكُمْ۠ اِذْ تَدْعُوْنَ …:} ابراہیم علیہ السلام نے کسی بھی ذات کی عبادت کے لیے اس میں پائی جانے والی تین صفات ذکر کرکے فرمایا کہ کیا ان میں یہ تینوں یا کوئی ایک صفت پائی جاتی ہے؟ کیا جب تم انھیں پکارتے ہو تو یہ تمھاری بات سنتے ہیں؟ یا تمھیں کوئی فائدہ پہنچاتے ہیں؟ یا نقصان پہنچاتے ہیں؟ اگر نہیں اور یقینا نہیں، تو ان کی عبادت کیوں کرتے ہو ؟"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) {قَالُوْا بَلْ وَجَدْنَاۤ اٰبَآءَنَا كَذٰلِكَ يَفْعَلُوْنَ:} یعنی لکڑی، پتھر اور دھات کے یہ بت سنتے تو نہیں، نہ ہی کوئی نفع نقصان پہنچا سکتے ہیں، مگر ہم نے اپنے آبا و اجداد کو قدیم زمانے سے ایسے ہی کرتے ہوئے پایا ہے، تو کیا وہ سب بے وقوف تھے جو ان کی پوجا کرتے رہے، آخر ان کے پاس ان کی عبادت کی کوئی دلیل تو ہو گی۔ گویا جب کوئی معقول جواب نہ بن پڑا تو باپ دادا کی تقلید کا سہارا لیا، جو ہر اندھے کی لاٹھی اور ڈوبنے والے کے لیے آخری تنکا ہے۔ یہی حال ان مقلد حضرات کا ہے جو اس لیے اپنے امام کی تقلید کرتے جا رہے ہیں کہ فلاں فلاں بزرگ بھی تو ان کی تقلید کرتے رہے ہیں۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 76،75) {قَالَ اَفَرَءَيْتُمْ مَّا كُنْتُمْ تَعْبُدُوْنَ …: ’’ اٰبَآؤُكُمُ الْاَقْدَمُوْنَ ‘‘} کے الفاظ سے ابراہیم علیہ السلام یہ باور کروا رہے ہیں کہ کسی دین کے حق ہونے کے لیے بس یہ دلیل کافی نہیں کہ وہ قدیم آبا و اجداد کے وقت سے چلا آ رہا ہے۔ دنیا کے کسی بھی کام میں پہلے لوگوں کی غلطی ثابت ہو جائے تو اسے فوراً چھوڑ دیتے ہو، تو کیا دین ہی اتنا بے حیثیت ہے کہ غلط جان کر بھی نسلوں کی نسلیں آنکھیں بند کرکے اس پر چلتی جائیں اور مکھی پر مکھی مارتی جائیں ؟"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76،75) {قَالَ اَفَرَءَيْتُمْ مَّا كُنْتُمْ تَعْبُدُوْنَ …: ’’ اٰبَآؤُكُمُ الْاَقْدَمُوْنَ ‘‘} کے الفاظ سے ابراہیم علیہ السلام یہ باور کروا رہے ہیں کہ کسی دین کے حق ہونے کے لیے بس یہ دلیل کافی نہیں کہ وہ قدیم آبا و اجداد کے وقت سے چلا آ رہا ہے۔ دنیا کے کسی بھی کام میں پہلے لوگوں کی غلطی ثابت ہو جائے تو اسے فوراً چھوڑ دیتے ہو، تو کیا دین ہی اتنا بے حیثیت ہے کہ غلط جان کر بھی نسلوں کی نسلیں آنکھیں بند کرکے اس پر چلتی جائیں اور مکھی پر مکھی مارتی جائیں ؟"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77) ➊ {فَاِنَّهُمْ عَدُوٌّ لِّيْۤ اِلَّا رَبَّ الْعٰلَمِيْنَ: ’’ عَدُوٌّ ‘‘ ’’فَعُوْلٌ‘‘}  کے وزن پر ہے، واحد، جمع، مذکر اور مؤنث سب کے لیے یکساں استعمال ہوتا ہے، اس لیے {’’ فَاِنَّهُمْ ‘‘} میں جمع کی خبر ہونے کے باوجود واحد آیا ہے۔ یعنی تم اور تمھارے قدیم ترین آبا و اجداد جن چیزوں کی عبادت کرتے رہے ہیں وہ سب چیزیں میری دشمن ہیں۔ ہاں، اگر ان میں سے کوئی {’’رب العالمين‘‘} کی بھی عبادت کرتا رہا ہے، تو صرف {’’رب العالمين‘‘} میرا دوست ہے۔ ¤ ➋ یہاں ایک سوال ہے کہ بتوں کے دشمن تو ابراہیم علیہ السلام تھے، بتوں نے ان سے کیا دشمنی کرنا تھی؟ تو یہاں یہ کہنے کے بجائے کہ میں ان کا دشمن ہوں، یہ کیوں فرمایا کہ وہ میرے دشمن ہیں؟ اس کے دو جواب ہیں، ایک یہ کہ ابراہیم علیہ السلام انھیں بتانا یہ چاہتے ہیں کہ اللہ تعالیٰ کے سوا تم جن کی عبادت کرتے ہو، جتنی مرضی ان سے محبت کر لو یا ان کی عبادت کر لو، قیامت کے دن وہ تمھارے دشمن بن جائیں گے، ایک اللہ عز و جل کی ذات پاک ہے کہ وہ اپنی عبادت کرنے والوں کی دوست رہے گی، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ وَ مَنْ اَضَلُّ مِمَّنْ يَّدْعُوْا مِنْ دُوْنِ اللّٰهِ مَنْ لَّا يَسْتَجِيْبُ لَهٗۤ  اِلٰى يَوْمِ الْقِيٰمَةِ وَ هُمْ عَنْ دُعَآىِٕهِمْ غٰفِلُوْنَ (5) وَ اِذَا حُشِرَ النَّاسُ كَانُوْا لَهُمْ اَعْدَآءً وَّ كَانُوْا بِعِبَادَتِهِمْ كٰفِرِيْنَ }» [[ الأحقاف : ۵، ۶ ]’’اور اس سے بڑھ کر کون گمراہ ہے جو اللہ کے سوا انھیں پکارتا ہے جو قیامت کے دن تک اس کی دعا قبول نہیں کریں گے اور وہ ان کے پکارنے سے بے خبر ہیں۔ اور جب سب لوگ اکٹھے کیے جائیں گے تو وہ ان کے دشمن ہوں گے اور ان کی عبادت سے منکر ہوں گے۔‘‘ سورۂ بقرہ (۱۶۵، ۱۶۶) اور سورۂ مریم (۸۱، ۸۲) میں بھی یہی بات بیان ہوئی ہے۔ مگر ابراہیم علیہ السلام نے یہ کہنے کے بجائے کہ ’’تمھارے معبود تمھارے دشمن ہوں گے‘‘ یہ فرمایا کہ تمھارے یہ معبود (اگر میں ان کی عبادت کروں گا تو) میرے دشمن ہوں گے۔ اس میں انھوں نے دعوت میں حکمت اور دانائی کو محفوظ رکھا ہے کہ مخاطب سوچے کہ جس طرح ابراہیم علیہ السلام کو اپنی فکر ہے کہ بتوں کی عبادت کی صورت میں انھیں ان کی دشمنی کے علاوہ کچھ حاصل نہ ہو گا، اسی طرح مجھے بھی اپنی فکر کرنی چاہیے۔ ¤ دوسرا جواب یہ ہے کہ {’’ عَدُوٌّ ‘‘} (دشمن) اسی کو نہیں کہتے جسے آپ سے دشمنی ہو، اسے بھی دشمن کہا جاتا ہے جس سے آپ کو دشمنی ہو۔ جس سے اپنی شدید دشمنی کا اظہار کرنا ہو اس کے متعلق کہا جاتا ہے کہ وہ میرا دشمن ہے اور جس سے شدید محبت کا اظہار کرنا ہو اس کے متعلق کہا جاتا ہے کہ وہ میرا دوست ہے۔ مرزا غالب نے کہا ہے: ¤ یہی ہے آزمانا تو ستانا کس کو کہتے ہیں ¤ عدو کے ہو لیے جب تم تو میرا امتحاں کیوں ہو ¤ گویا ابراہیم علیہ السلام نے اپنی شدید عداوت کے اظہار کے لیے انھیں اپنا دشمن اور ’’رب العالمین‘‘ کو اپنا دوست قرار دیا ہے۔ ¤ ➌ ابراہیم علیہ السلام نے ان الفاظ میں بتوں سے اپنی دشمنی کا جو اظہار کیا ہے دوسری جگہ اس کا اظہار ان الفاظ میں ہوا ہے : «{وَ تَاللّٰهِ لَاَكِيْدَنَّ اَصْنَامَكُمْ بَعْدَ اَنْ تُوَلُّوْا مُدْبِرِيْنَ }» [ الأنبیاء : ۵۷ ] ’’اور اللہ کی قسم! میں ضرور ہی تمھارے بتوں کی خفیہ تدبیر کروں گا، اس کے بعد کہ تم پیٹھ پھیر کر چلے جاؤ گے۔‘‘ پھر ابراہیم علیہ السلام نے اس دشمنی کا عملی مظاہرہ بھی بتوں کو توڑ کر فرمایا۔ ان الفاظ میں اس بات کا بھی اظہار ہے کہ میں تمھارے بتوں سے ہرگز نہیں ڈرتا، وہ میرا کچھ بگاڑ نہیں سکتے، میرا ان کے ساتھ اور تمھارے ساتھ تعلق دشمنی کا ہے۔ (دیکھیے ممتحنہ : ۴۔ انعام : ۸۰، ۸۱) اللہ تعالیٰ کے دوسرے جلیل القدر پیغمبروں نے بھی کفار اور ان کے معبودوں کے متعلق صاف اعلان کیا کہ وہ ان کے خلاف جو کر سکتے ہیں انھیں ان کی کوئی پروا ہے نہ ان سے کوئی خوف۔ نوح علیہ السلام کے متعلق دیکھیے سورۂ یونس (۷۱) اور ہود علیہ السلام کے متعلق دیکھیے سورۂ ہود (۵۵، ۵۶)۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) {الَّذِيْ خَلَقَنِيْ فَهُوَ يَهْدِيْنِ : ’’ يَهْدِيْنِ ‘‘} اصل میں {’’يَهْدِيْنِيْ‘‘}} ہے، آیات کے آخری حروف کی موافقت کے لیے یاء حذف کر دی گئی ہے، نون کا کسرہ اس کی دلیل ہے۔ آئندہ آیات کے اندر {’’ يَسْقِيْنِ ‘‘، ’’ يَشْفِيْنِ ‘‘} اور {’’ يُحْيِيْنِ ‘‘} میں بھی یاء محذوف ہے۔ یہاں سے ابراہیم علیہ السلام نے رب العالمین کی وہ صفات بیان کی ہیں جن کی وجہ سے وہ عبادت کا حق دار ہے، یعنی {’’رب العالمين‘‘} وہ ہے جس نے مجھے پیدا کیا، پھر وہی مجھے راستہ دکھاتا ہے۔ یہاں {’’ الَّذِيْ خَلَقَنِيْ ‘‘} (وہ جس نے مجھے پیدا کیا) کے بعد {’’ فَهُوَ يَهْدِيْنِ ‘‘} (پھر وہی مجھے راستہ دکھاتا ہے) حصر کے ساتھ ہے، اس کی وجہ یہ ہے کہ پیدا کرنے کا دعویٰ اللہ تعالیٰ کے سوا کسی کے متعلق موجود ہی نہیں کہ اللہ تعالیٰ کے متعلق کہا جائے کہ اسی نے مجھے پیدا کیا ہے، جبکہ ہدایت کا دعویٰ بہت سی ہستیوں کے متعلق ہے، اس لیے فرمایا کہ پھر وہی مجھے ہدایت دیتا ہے، اور کوئی نہیں۔ مطلب یہ ہے کہ تم مانتے ہو کہ اس نے پیدا کیا تو مانو کہ ہدایت بھی وہی دیتا ہے۔ {’’ الَّذِيْ خَلَقَنِيْ ‘‘} (جس نے مجھے پیدا کیا) ماضی کے ساتھ ہے، کیونکہ پیدا تو وہ کر چکا، جبکہ {’’ فَهُوَ يَهْدِيْنِ ‘‘} (پھر وہ مجھے راستہ دکھاتا ہے) مضارع ہے، کیونکہ ہدایت کی ضرورت ہر ہر لمحے میں ہے اور وہ ہر لمحے مجھے ہدایت دیتا ہے۔ پیدائش کے بعد سب سے زیادہ اہم ہدایت ہے، اس لیے ان دونوں کا ذکر سب سے پہلے فرمایا۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79) {وَ الَّذِيْ هُوَ يُطْعِمُنِيْ وَ يَسْقِيْنِ :} یہ دونوں صفات بھی حصر کے ساتھ ہیں کہ وہی مجھے کھلاتا ہے اور مجھے پلاتا ہے، اور کوئی نہیں۔ یہاں بھی حصر کی ضرورت اس لیے ہے کہ لوگوں نے اور بھی داتا اور رزاق بنا رکھے ہیں۔ یہ{ ’’رب العالمين‘‘} ہونے کی تیسری وجہ ہے کہ اس نے پیدا کرکے مجھے چھوڑ نہیں دیا، بلکہ میری ضرورت کی ہر چیز مجھے مہیا کرتا ہے۔"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) ➊ { وَ اِذَا مَرِضْتُ فَهُوَ يَشْفِيْنِ :} یعنی وہی ہے جو مجھے کھلاتا ہے اور پلاتا ہے، مگر میں جب اس کھانے پینے میں حد اعتدال سے گزر کر بیمار ہوتا ہوں، یا اپنی کسی اور غلطی کی وجہ سے بیمار ہوتا ہوں تو وہی ہے جو پھر مجھے شفا دے دیتا ہے۔ یہ پچھلی آیت کے ساتھ ایک لطیف مطابقت ہے۔ بعض طبیبوں کا کہنا ہے کہ اگر مُردوں سے پوچھا جائے، تمھاری موت کا سبب کیا ہوا تو اکثر یہی کہیں گے کہ زیادہ کھانے سے، بدہضمی سے۔ ¤ ➋ اگرچہ بیماری اور شفا دونوں اللہ تعالیٰ کی طرف سے ہیں، مگر ابراہیم علیہ السلام نے یہاں بیمار ہونے کی نسبت اپنی طرف کی ہے کہ ’’جب میں بیمار ہوتا ہوں‘‘ اور شفا دینے کی نسبت اللہ تعالیٰ کی طرف کی ہے کہ {’’ فَهُوَ يَشْفِيْنِ ‘‘} (تو وہی مجھے شفا دیتا ہے)، اس میں ابراہیم علیہ السلام نے اللہ تعالیٰ کا ادب ملحوظ رکھا ہے کہ خیر و شر دونوں کا خالق ہونے کے باوجود شر کی نسبت اس کی طرف نہ کی جائے، جیسا کہ صحیح مسلم (۷۷۱) کی ایک حدیث میں ہے : [ وَالشَّرُّ لَيْسَ إِلَيْكَ ] اور جیسا کہ سورۂ فاتحہ میں {’’ اَنْعَمْتَ عَلَيْهِمْ ‘‘} میں انعام کی نسبت اللہ تعالیٰ کی طرف ہے، مگر {’’ الْمَغْضُوْبِ عَلَيْهِمْ وَ لَا الضَّآلِّيْنَ ‘‘} میں ’’غضب‘‘ اور ’’ضلالت‘‘ کی نسبت اس کی طرف نہیں ہے اور سورۂ کہف (۷۹ تا ۸۲) میں خضر علیہ السلام نے تینوں واقعات کی تاویل بیان کرتے وقت اس ادب کو خوب ملحوظ رکھا ہے اور سورۂ جن (۱۰) میں جنوں نے بھی اس ادب کو ملحوظ رکھا ہے۔ {’’ فَهُوَ يَشْفِيْنِ ‘‘} میں بھی حصر ہے کہ وہی مجھے شفا دیتا ہے، کوئی اور نہیں، کیونکہ اور بھی بے شمار ہستیاں ہیں جن کو لوگوں نے شفا دینے والے سمجھ رکھا ہے۔"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) {وَ الَّذِيْ يُمِيْتُنِيْ ثُمَّ يُحْيِيْنِ:} یہ دونوں حصر کے بغیر ہیں، کیونکہ ان میں حصر کی ضرورت نہیں تھی کہ کہا جائے وہی مجھے موت دے گا اور وہی مجھے زندہ کرے گا، کیونکہ سب مانتے ہیں کہ مارنا یا زندہ کرنا صرف ’’رب العالمین‘‘ کا کام ہے، اور کسی کا یہ دعویٰ ہی نہیں۔ ابراہیم علیہ السلام کے دور کے جبار نے جو کہا تھا : «{ اَنَا اُحْيٖ وَ اُمِيْتُ }» [ البقرۃ : ۲۵۸ ] (میں زندگی بخشتا اور موت دیتا ہوں) وہ محض اس کی ڈھٹائی اور بے شرمی تھی، اس کے دعوے کو کسی نے وقعت ہی نہیں دی۔"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) {وَ الَّذِيْۤ اَطْمَعُ اَنْ يَّغْفِرَ لِيْ خَطِيْٓـَٔتِيْ يَوْمَ الدِّيْنِ :} یعنی قیامت کے دن جب اللہ تعالیٰ عدالت قائم فرمائے گا تو وہاں کسی کی عدالت، حاکمیت یا سلطنت نہیں ہو گی، نہ اس کے فیصلوں میں کسی کا کوئی دخل ہو گا، نہ اس کے سوا کوئی کسی کے گناہ معاف کر سکے گا، جیسا کہ فرمایا : «{ وَ مَنْ يَّغْفِرُ الذُّنُوْبَ اِلَّا اللّٰهُ }» [ آل عمران : ۱۳۵ ]’’اور اللہ کے سوا اور کون گناہ بخشتا ہے؟‘‘ چونکہ میں اس کا موحد بندہ ہوں، میں نے اس کے ساتھ شرک نہیں کیا، اس لیے میں اس سے امید رکھتا ہوں کہ اس دن وہ میری خطائیں معاف فرمائے گا۔ اس میں ابراہیم علیہ السلام کی تواضع اور ان کا انکسار بھی ظاہر ہو رہا ہے کہ انھوں نے اللہ تعالیٰ کے جلال اور اس کی بے پروائی کو مدنظر رکھتے ہوئے اپنی امید کا اظہار کیا ہے۔ ابراہیم علیہ السلام نے یہ صفات اس لیے بیان فرمائیں کہ مشرکین کو مطمئن کر سکیں کہ عبادت صرف اس ’’رب العالمین‘‘ کا حق ہے جو ان صفات کا مالک ہے۔ دوسرے معبود جو نہ پیدا کر سکیں، نہ رہنمائی کر سکیں، نہ کھانے کو دے سکیں، نہ پینے کو، نہ شفا کے مالک ہوں، نہ موت و حیات کے، نہ قیامت برپا کر سکتے ہوں، نہ عدالت قائم کر سکتے ہوں، وہ عبادت کے حق دار کیسے ہو سکتے ہیں؟"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) ➊ { رَبِّ هَبْ لِيْ حُكْمًا:} اللہ تعالیٰ کی تعریف اور اس کی صفات بیان کرنے کے بعد ابراہیم علیہ السلام نے اللہ کی بارگاہ میں چند دعائیں کی ہیں۔ اس میں دعا کا ادب ملحوظ رکھا گیا ہے اور اس کا سلیقہ سکھایا گیا ہے کہ دعا سے پہلے اللہ تعالیٰ کی تعریف جس قدر ہو سکے کرو، پھر اپنی عرض داشت پیش کرو۔ سورۂ فاتحہ میں بھی یہی سبق سکھایا گیا ہے۔ ¤ ➋ حُکْم کا معنی فیصلہ ہے، یعنی پروردگارا ! فیصلے کے لیے جو چیزیں درکار ہیں وہ سب مجھے عطا  کر، یعنی اپنے دین کا پورا علم جس سے صحیح فیصلہ ہوتا ہے، پھر ہر معاملے کا صحیح فہم، پھر وہ اقتدار جس کے ساتھ فیصلہ نافذ ہوتا ہے۔ ¤ ➌ {وَّ اَلْحِقْنِيْ بِالصّٰلِحِيْنَ:} یعنی دنیا میں بھی صالح دوستوں اور ساتھیوں کی رفاقت عطا فرما اور آخرت میں بھی انھی کے ساتھ ملا دے۔ یوسف علیہ السلام نے بھی یہ دعا کی : «{ تَوَفَّنِيْ مُسْلِمًا وَّ اَلْحِقْنِيْ بِالصّٰلِحِيْنَ }» [ یوسف : ۱۰۱ ] ’’مجھے مسلم ہونے کی حالت میں فوت کر اور مجھے نیک لوگوں کے ساتھ ملا دے۔‘‘ اور ہمارے نبی کریم صلی اللہ علیہ وسلم نے بھی آخری وقت دعا کی تھی : [ اَللّٰهُمَّ فِي الرَّفِيْقِ الْأَعْلٰی ] ’’(اے اللہ!) مجھے سب سے بلند رفیقوں میں شامل فرما دے۔‘‘ آپ صلی اللہ علیہ وسلم نے یہ دعا تین دفعہ کی۔ [ بخاري، فضائل أصحاب النبي صلی اللہ علیہ وسلم ، باب : ۳۶۶۹، ۴۴۳۷ ]"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84) {وَ اجْعَلْ لِّيْ لِسَانَ صِدْقٍ …: ’’ لِسَانَ ‘‘} سے مراد تعریف ہے، کیونکہ وہ زبان سے ہوتی ہے۔ {’’ لِسَانَ صِدْقٍ ‘‘} سے مراد اچھی تعریف اور نیک شہرت ہے، یعنی قیامت تک آنے والی نسلوں میں مجھے سچی ناموری عطا فرما کہ وہ اچھے الفاظ میں میرا ذکر کرتی رہیں۔ اللہ تعالیٰ نے ان کی دعا قبول فرمائی، یہودی، عیسائی اور مسلمان سب انھیں اپنا پیشوا مانتے ہیں اور ان کا ذکرِ خیر کرتے ہیں۔ مسلمان تو نماز میں {’’كَمَا صَلَّيْتَ عَلٰي إِبْرَاهِيْمَ‘‘} اور {’’كَمَا بَارَكْتَ عَلٰي إِبْرَاهِيْمَ‘‘} بھی کہتے ہیں۔ [ دیکھیے بخاري : ۳۳۷۰ ] امام مالک رحمہ اللہ نے اس آیت سے استدلال فرمایا کہ آدمی کی اس خواہش میں کوئی حرج نہیں کہ اس کی نیک شہرت ہو۔ بعض اہلِ علم نے فرمایا کہ اس کا فائدہ آخرت میں یہ ہے کہ ممکن ہے کہ نیک اعمال میں اس کی شہرت سن کر کوئی شخص وہ اعمال کرنے لگے جس کا اجر اسے بھی ملے گا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً حَسَنَةً فَعُمِلَ بِهَا بَعْدَهُ كُتِبَ لَهُ مِثْلُ أَجْرِ مَنْ عَمِلَ  بِهَا وَلَا يَنْقَصُ مِنْ أُجُوْرِهِمْ شَيْءٌ ] [مسلم، العلم، باب من سن سنۃ حسنۃ… : ۱۵ /۱۰۱۷، قبل ح : ۲۶۷۴، عن جریر بن عبد اللہ رضی اللہ عنہ ] ’’جو شخص اسلام میں کوئی اچھا طریقہ جاری کرے، پھر اس کے بعد اس پر عمل کیا جائے، تو اس کے لیے ان لوگوں جیسا اجر لکھا جائے گا جو اس پر عمل کریں گے اور ان کے اجروں سے کچھ کم نہیں کیا جائے گا۔‘‘ بعض مفسرین نے اس سے یہ بھی مراد لیا ہے کہ آخر زمانے میں میری نسل سے نبی ہو، جیسا کہ فرمایا : «{ رَبَّنَا وَ ابْعَثْ فِيْهِمْ رَسُوْلًا مِّنْهُمْ }» [ البقرۃ : ۱۲۹ ] ’’اے ہمارے رب! اور ان میں انھی میں سے ایک رسول بھیج۔‘‘ مگر اس دعا کے الفاظ سے یہ مفہوم نہیں نکلتا۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 85) {وَ اجْعَلْنِيْ مِنْ وَّرَثَةِ جَنَّةِ النَّعِيْمِ: ’’ وَرَثَةِ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ مومنون کی آیت (۱۱) پچھلی آیت میں دنیا کی سعادت مانگی اور اس آیت میں آخرت کی سعادت طلب کی۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86) {وَ اغْفِرْ لِاَبِيْۤ اِنَّهٗ كَانَ مِنَ الضَّآلِّيْنَ :} ابراہیم علیہ السلام نے اپنے باپ سے رخصت ہوتے وقت استغفار کی دعا کا وعدہ کیا تھا (مریم : ۴۷) چنانچہ انھوں نے یہ دعا فرمائی۔ زندگی میں دعا کا حاصل یہ ہے کہ اسے توبہ کی توفیق بخش، تاکہ اس کے گناہ معاف ہو جائیں اور وفات کے بعد ہو تو اس کے شرک اور دوسرے گناہ معاف کرنے کی دعا ہے، لیکن بعد میں جب انھیں معلوم ہوا کہ ایک مشرک اور دشمنِ حق کے لیے دعائے مغفرت کرنا صحیح نہیں ہے تو انھوں نے اس دعا سے رجوع کر لیا، جیسا کہ سورۂ توبہ میں ہے : «{ فَلَمَّا تَبَيَّنَ لَهٗۤ اَنَّهٗ عَدُوٌّ لِّلّٰهِ تَبَرَّاَ مِنْهُ }» [ التوبۃ : ۱۱۴ ] ’’پھر جب اس کے لیے واضح ہو گیا کہ بے شک وہ اللہ کا دشمن ہے تو وہ اس سے بے تعلق ہو گیا۔‘‘"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) {وَ لَا تُخْزِنِيْ يَوْمَ يُبْعَثُوْنَ :} یعنی قیامت کے دن تمام مخلوق کے سامنے میرا مؤاخذہ کرکے، یا میرے والد کو عذاب دے کر مجھے رسوا نہ کرکہ لوگ اسے جہنم میں جلتا ہوا دیکھ کر کہیں یہ ابراہیم کا باپ ہے۔ اللہ تعالیٰ نے ابراہیم علیہ السلام کی یہ دعا بھی قبول فرمائی، چنانچہ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَلْقٰی إِبْرَاهِيْمُ أَبَاهُ آزَرَ يَوْمَ الْقِيَامَةِ وَ عَلٰی وَجْهِ آزَرَ قَتَرَةٌ وَغَبَرَةٌ فَيَقُوْلُ لَهُ إِبْرَاهِيْمُ أَلَمْ أَقُلْ  لَّكَ لَا تَعْصِنِيْ؟ فَيَقُوْلُ أَبُوْهُ فَالْيَوْمَ لَا أَعْصِيْكَ، فَيَقُوْلُ إِبْرَاهِيْمُ يَا رَبِّ! إِنَّكَ وَعَدْتَنِيْ أَنْ لَّا تُخْزِيَنِيْ يَوْمَ يُبْعَثُوْنَ، فَأَيُّ خِزْيٍ أَخْزٰی  مِنْ أَبِي الْأَبْعَدِ؟ فَيَقُوْلُ اللّٰهُ تَعَالٰی إِنِّيْ حَرَّمْتُ الْجَنَّةَ عَلَی الْكَافِرِيْنَ، ثُمَّ يُقَالُ يَا إِبْرَاهِيْمُ!! مَا تَحْتَ رِجْلَيْكَ؟ فَيَنْظُرُ فَإِذَا هُوَ بِذِيْخٍ مُلْتَطِخخٍ فَيُؤْخَذُ بِقَوَائِمِهِ فَيُلْقٰی فِي النَّارِ ] [بخاري، أحادیث الأنبیاء، باب قول اللہ تعالٰی : « واتخذ اللہ إبراہیم خلیلا » : ۳۳۵۰ ] ’’قیامت کے دن ابراہیم علیہ السلام اپنے باپ کو اس حال میں ملیں گے کہ اس کے چہرے پر سیاہی اور غبار ہو گا۔ ابراہیم علیہ السلام اس سے کہیں گے : ’’میں نے تجھے کہا نہ تھا کہ میری نافرمانی مت کر۔‘‘ ان کا باپ کہے گا : ’’تو آج میں تیری نافرمانی نہیں کروں گا۔‘‘ ابراہیم علیہ السلام کہیں گے: ’’اے رب! تو نے مجھ سے وعدہ کیا تھا کہ تو مجھے اس دن رسوا نہیں کرے گا جب لوگ اٹھائے جائیں گے، تو میرے بدنصیب باپ سے بڑھ کر ذلت کیا ہو گی۔‘‘ اللہ تعالیٰ فرمائے گا : ’’یقینا میں نے جنت کافروں پر حرام کر دی ہے۔‘‘ پھر کہا جائے گا : ’’ابراہیم! تیرے پاؤں کے نیچے کیا ہے؟‘‘ وہ دیکھیں گے تو اچانک گندگی میں لت پت ایک بِجّو ہو گا، پھر اس بِجّو کو اس کی ٹانگوں سے پکڑ کر آگ میں پھینک دیا جائے گا۔‘‘ گویا اللہ تعالیٰ مشرک پر جنت حرام کرنے کا قانون بھی قائم رکھیں گے اور ابراہیم علیہ السلام کو رسوا ہونے سے بھی بچا لیں گے کہ رسوائی تو تب ہو کہ لوگ دیکھیں کہ ابراہیم علیہ السلام کا باپ آگ میں جل رہا ہے۔ ایک بِجّو آگ میں جل رہا ہو تو کسی کو کیا خبر کہ یہ ابراہیم علیہ السلام کا باپ ہے۔"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) {يَوْمَ لَا يَنْفَعُ مَالٌ وَّ لَا بَنُوْنَ:} جس دن آدمی کو اللہ کے عذاب سے کوئی مال نہیں بچا سکے گا، خواہ زمین بھرنے کے برابر سونا ہو (آل عمران : ۹۱) اور صرف بیٹے ہی نہیں، زمین کے تمام لوگ بطور فدیہ پیش کیے جائیں تو وہ بھی کام نہ آئیں گے۔ (معارج : ۱۱ تا ۱۴)"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 89) {اِلَّا مَنْ اَتَى اللّٰهَ بِقَلْبٍ سَلِيْمٍ :} سلامتی والے دل سے مراد ایسا دل ہے جو  کفر و شرک سے پاک ہو۔ بعض نے بدعت و جہالت اور اخلاق رذیلہ سے پاک ہونا بھی مراد لیا ہے۔ مال اور اولاد بھی کام آئیں گے تو اس کے جس کا دل کفر و شرک سے خالی ہو گا۔"
    },
    {
      "ayah": 90,
      "tafsir": "(آیت 91،90) {وَ اُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِيْنَ …:} ابراہیم علیہ السلام نے {’’ يَوْمَ يُبْعَثُوْنَ ‘‘} کا مزید نقشہ بیان کیا ہے کہ جنت متقین کے قریب لائی جائے گی اور وہ اس کے نظارے سے لطف اندوز ہوں گے، اسی طرح جہنم گمراہوں کو میدانِ حشر ہی میں دکھائی دینے لگے گی جو ان کا ٹھکانا بننے والی ہے، تاکہ جلد از جلد ہر ایک کو اس کے اعمال کی جزا مل جائے۔ {’’ غَاوِيْنَ ‘‘} (گمراہوں) سے مراد یہاں مشرکین ہیں، جیسا کہ اگلی آیت میں صراحت آ رہی ہے۔"
    },
    {
      "ayah": 91,
      "tafsir": "(آیت 91،90) {وَ اُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِيْنَ …:} ابراہیم علیہ السلام نے {’’ يَوْمَ يُبْعَثُوْنَ ‘‘} کا مزید نقشہ بیان کیا ہے کہ جنت متقین کے قریب لائی جائے گی اور وہ اس کے نظارے سے لطف اندوز ہوں گے، اسی طرح جہنم گمراہوں کو میدانِ حشر ہی میں دکھائی دینے لگے گی جو ان کا ٹھکانا بننے والی ہے، تاکہ جلد از جلد ہر ایک کو اس کے اعمال کی جزا مل جائے۔ {’’ غَاوِيْنَ ‘‘} (گمراہوں) سے مراد یہاں مشرکین ہیں، جیسا کہ اگلی آیت میں صراحت آ رہی ہے۔"
    },
    {
      "ayah": 92,
      "tafsir": "(آیت 93،92) {وَ قِيْلَ لَهُمْ اَيْنَمَا كُنْتُمْ تَعْبُدُوْنَ …: ’’ يَنْتَصِرُوْنَ ‘‘ ’’اِنْتَصَرَ يَنْتَصِرُ‘‘} (افتعال) کا معنی اپنا بچاؤ کرنا بھی ہے اور بدلا لینا بھی، یعنی ان گمراہوں سے کہا جائے گا کہ کہاں ہیں وہ جن کی تم اللہ کے سوا عبادت کرتے تھے، کیا وہ تمھاری مدد کرتے ہیں، یا تمھارا بدلا لیتے ہیں، یا کم از کم اپنا بچاؤ ہی کرتے ہیں؟"
    },
    {
      "ayah": 93,
      "tafsir": "(آیت 93،92) {وَ قِيْلَ لَهُمْ اَيْنَمَا كُنْتُمْ تَعْبُدُوْنَ …: ’’ يَنْتَصِرُوْنَ ‘‘ ’’اِنْتَصَرَ يَنْتَصِرُ‘‘} (افتعال) کا معنی اپنا بچاؤ کرنا بھی ہے اور بدلا لینا بھی، یعنی ان گمراہوں سے کہا جائے گا کہ کہاں ہیں وہ جن کی تم اللہ کے سوا عبادت کرتے تھے، کیا وہ تمھاری مدد کرتے ہیں، یا تمھارا بدلا لیتے ہیں، یا کم از کم اپنا بچاؤ ہی کرتے ہیں؟"
    },
    {
      "ayah": 94,
      "tafsir": "(آیت 95،94) {فَكُبْكِبُوْا فِيْهَا هُمْ وَ الْغَاوٗنَ … : ’’كَبَّ يَكُبُّ‘‘} منہ کے بل گرانا۔ {’’كَبْكَبَ‘‘} میں لفظ کے تکرار سے معنی میں تکرار پیدا ہو رہا ہے، بار بار گرانا۔ یعنی ان کے باطل معبود اوندھے منہ جہنم میں ایک دوسرے کے اوپر بار بار گرائے جائیں گے، یعنی جب انھیں اوندھے منہ ڈالا جائے گا تو بار بار ٹھوکریں کھاتے ہوئے، الٹ پلٹ ہوتے ہوئے نیچے گرتے جائیں گے، حتیٰ کہ اس کی گہرائی تک پہنچ جائیں گے۔ ان کے ساتھ ان کی عبادت کرنے والے گمراہ لوگ اور ابلیس کے تمام لشکر بھی اسی طرح گرائے جائیں گے۔ بتوں کا ذکر پہلے فرمایا، تاکہ پوجنے والوں کو انھیں پہلے گرتے ہوئے دیکھ کر مزید عبرت ہو۔ ابلیس کے لشکروں سے مراد اس کے تمام پیروکار ہیں جو دوسروں کو بھی گمراہ کرتے رہے۔ طبری نے معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل کیا ہے کہ{’’ فَكُبْكِبُوْا فِيْهَا ‘‘} کا معنی ہے اس میں جمع کیے جائیں گے، گویا الٹے منہ گراتے ہوئے سب کو وہاں جمع کر دیا جائے گا۔ [ طبري : ۲۶۸۸۸ ]"
    },
    {
      "ayah": 95,
      "tafsir": "(آیت 95،94) {فَكُبْكِبُوْا فِيْهَا هُمْ وَ الْغَاوٗنَ … : ’’كَبَّ يَكُبُّ‘‘} منہ کے بل گرانا۔ {’’كَبْكَبَ‘‘} میں لفظ کے تکرار سے معنی میں تکرار پیدا ہو رہا ہے، بار بار گرانا۔ یعنی ان کے باطل معبود اوندھے منہ جہنم میں ایک دوسرے کے اوپر بار بار گرائے جائیں گے، یعنی جب انھیں اوندھے منہ ڈالا جائے گا تو بار بار ٹھوکریں کھاتے ہوئے، الٹ پلٹ ہوتے ہوئے نیچے گرتے جائیں گے، حتیٰ کہ اس کی گہرائی تک پہنچ جائیں گے۔ ان کے ساتھ ان کی عبادت کرنے والے گمراہ لوگ اور ابلیس کے تمام لشکر بھی اسی طرح گرائے جائیں گے۔ بتوں کا ذکر پہلے فرمایا، تاکہ پوجنے والوں کو انھیں پہلے گرتے ہوئے دیکھ کر مزید عبرت ہو۔ ابلیس کے لشکروں سے مراد اس کے تمام پیروکار ہیں جو دوسروں کو بھی گمراہ کرتے رہے۔ طبری نے معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل کیا ہے کہ{’’ فَكُبْكِبُوْا فِيْهَا ‘‘} کا معنی ہے اس میں جمع کیے جائیں گے، گویا الٹے منہ گراتے ہوئے سب کو وہاں جمع کر دیا جائے گا۔ [ طبري : ۲۶۸۸۸ ]"
    },
    {
      "ayah": 96,
      "tafsir": "(آیت96تا98) ➊ {قَالُوْا وَ هُمْ فِيْهَا يَخْتَصِمُوْنَ …: ’’ اِنْ كُنَّا لَفِيْ ضَلٰلٍ مُّبِيْنٍ ‘‘} اصل میں{ ’’إِنَّا كُنَّا لَفِيْ ضَلاَلٍ مُّبِيْنٍ‘‘ } ہے۔ دلیل اس کی{ ’’ فِيْ‘‘ } پر آنے والا لام ہے۔ یعنی وہ جہنم میں اپنے معبودوں سے جھگڑتے ہوئے ان سے کہیں گے کہ اللہ کی قسم! ہم یقینا کھلی گمراہی میں تھے، جب ہم تمھیں رب العالمین کے برابر ٹھہراتے تھے، اس کے بعض اختیارات اور صفات تمھارے لیے بھی مانتے تھے، تمھارے لیے حلال و حرام کرنے کے اختیار کا عقیدہ رکھتے تھے، تمھیں بھی عالم الغیب اور مختار کل سمجھتے تھے، تمھیں بگڑی بنانے والے، فریاد کو پہنچنے والے، اولاد عطا کرنے والے اور شفا دینے والے سمجھتے تھے۔ ¤ ➋ یاد رہے رسول اللہ صلی اللہ علیہ وسلم نے ایسے الفاظ بولنے سے بھی منع فرمایا جن سے مخلوق کی خالق کے ساتھ کسی طرح بھی برابری ظاہر ہوتی ہو۔ حذیفہ رضی اللہ عنہ نبی صلی اللہ علیہ وسلم سے بیان کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَا تَقُوْلُوْا مَا شَاءَ اللّٰهُ وَ شَاءَ فُلَانٌ وَلٰكِنْ قُوْلُوْا مَا شَاءَ اللّٰهُ ثُمَّ شَاءَ فُلَانٌ ] [ أبوداوٗد، الأدب، باب لا یقال خبثت نفسي : ۴۹۸۰، قال الألباني صحیح ] ’’یہ مت کہو کہ جو اللہ نے چاہا اور فلاں نے چاہا، بلکہ یوں کہو کہ جو اللہ نے چاہا، پھر فلاں نے چاہا۔‘‘ ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے کہا : [ مَا شَاءَ اللّٰهُ وَ شِئْتَ ] ’’جو اللہ چاہے اور آپ چاہیں۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ جَعَلْتَ لِلّٰهِ نِدًّا ] ’’تم نے اللہ کا شریک بنا دیا۔‘‘ یوں کہو : [ مَا شَاءَ اللّٰهُ وَحْدَهُ ] ’’جو اللہ اکیلا چاہے۔‘‘ [الأدب المفرد : 274/1، ح : ۷۸۳، وقال الألباني صحیح ]"
    },
    {
      "ayah": 97,
      "tafsir": "(آیت96تا98) ➊ {قَالُوْا وَ هُمْ فِيْهَا يَخْتَصِمُوْنَ …: ’’ اِنْ كُنَّا لَفِيْ ضَلٰلٍ مُّبِيْنٍ ‘‘} اصل میں{ ’’إِنَّا كُنَّا لَفِيْ ضَلاَلٍ مُّبِيْنٍ‘‘ } ہے۔ دلیل اس کی{ ’’ فِيْ‘‘ } پر آنے والا لام ہے۔ یعنی وہ جہنم میں اپنے معبودوں سے جھگڑتے ہوئے ان سے کہیں گے کہ اللہ کی قسم! ہم یقینا کھلی گمراہی میں تھے، جب ہم تمھیں رب العالمین کے برابر ٹھہراتے تھے، اس کے بعض اختیارات اور صفات تمھارے لیے بھی مانتے تھے، تمھارے لیے حلال و حرام کرنے کے اختیار کا عقیدہ رکھتے تھے، تمھیں بھی عالم الغیب اور مختار کل سمجھتے تھے، تمھیں بگڑی بنانے والے، فریاد کو پہنچنے والے، اولاد عطا کرنے والے اور شفا دینے والے سمجھتے تھے۔ ¤ ➋ یاد رہے رسول اللہ صلی اللہ علیہ وسلم نے ایسے الفاظ بولنے سے بھی منع فرمایا جن سے مخلوق کی خالق کے ساتھ کسی طرح بھی برابری ظاہر ہوتی ہو۔ حذیفہ رضی اللہ عنہ نبی صلی اللہ علیہ وسلم سے بیان کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَا تَقُوْلُوْا مَا شَاءَ اللّٰهُ وَ شَاءَ فُلَانٌ وَلٰكِنْ قُوْلُوْا مَا شَاءَ اللّٰهُ ثُمَّ شَاءَ فُلَانٌ ] [ أبوداوٗد، الأدب، باب لا یقال خبثت نفسي : ۴۹۸۰، قال الألباني صحیح ] ’’یہ مت کہو کہ جو اللہ نے چاہا اور فلاں نے چاہا، بلکہ یوں کہو کہ جو اللہ نے چاہا، پھر فلاں نے چاہا۔‘‘ ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے کہا : [ مَا شَاءَ اللّٰهُ وَ شِئْتَ ] ’’جو اللہ چاہے اور آپ چاہیں۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ جَعَلْتَ لِلّٰهِ نِدًّا ] ’’تم نے اللہ کا شریک بنا دیا۔‘‘ یوں کہو : [ مَا شَاءَ اللّٰهُ وَحْدَهُ ] ’’جو اللہ اکیلا چاہے۔‘‘ [الأدب المفرد : 274/1، ح : ۷۸۳، وقال الألباني صحیح ]"
    },
    {
      "ayah": 98,
      "tafsir": "(آیت96تا98) ➊ {قَالُوْا وَ هُمْ فِيْهَا يَخْتَصِمُوْنَ …: ’’ اِنْ كُنَّا لَفِيْ ضَلٰلٍ مُّبِيْنٍ ‘‘} اصل میں{ ’’إِنَّا كُنَّا لَفِيْ ضَلاَلٍ مُّبِيْنٍ‘‘ } ہے۔ دلیل اس کی{ ’’ فِيْ‘‘ } پر آنے والا لام ہے۔ یعنی وہ جہنم میں اپنے معبودوں سے جھگڑتے ہوئے ان سے کہیں گے کہ اللہ کی قسم! ہم یقینا کھلی گمراہی میں تھے، جب ہم تمھیں رب العالمین کے برابر ٹھہراتے تھے، اس کے بعض اختیارات اور صفات تمھارے لیے بھی مانتے تھے، تمھارے لیے حلال و حرام کرنے کے اختیار کا عقیدہ رکھتے تھے، تمھیں بھی عالم الغیب اور مختار کل سمجھتے تھے، تمھیں بگڑی بنانے والے، فریاد کو پہنچنے والے، اولاد عطا کرنے والے اور شفا دینے والے سمجھتے تھے۔ ¤ ➋ یاد رہے رسول اللہ صلی اللہ علیہ وسلم نے ایسے الفاظ بولنے سے بھی منع فرمایا جن سے مخلوق کی خالق کے ساتھ کسی طرح بھی برابری ظاہر ہوتی ہو۔ حذیفہ رضی اللہ عنہ نبی صلی اللہ علیہ وسلم سے بیان کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَا تَقُوْلُوْا مَا شَاءَ اللّٰهُ وَ شَاءَ فُلَانٌ وَلٰكِنْ قُوْلُوْا مَا شَاءَ اللّٰهُ ثُمَّ شَاءَ فُلَانٌ ] [ أبوداوٗد، الأدب، باب لا یقال خبثت نفسي : ۴۹۸۰، قال الألباني صحیح ] ’’یہ مت کہو کہ جو اللہ نے چاہا اور فلاں نے چاہا، بلکہ یوں کہو کہ جو اللہ نے چاہا، پھر فلاں نے چاہا۔‘‘ ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے کہا : [ مَا شَاءَ اللّٰهُ وَ شِئْتَ ] ’’جو اللہ چاہے اور آپ چاہیں۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ جَعَلْتَ لِلّٰهِ نِدًّا ] ’’تم نے اللہ کا شریک بنا دیا۔‘‘ یوں کہو : [ مَا شَاءَ اللّٰهُ وَحْدَهُ ] ’’جو اللہ اکیلا چاہے۔‘‘ [الأدب المفرد : 274/1، ح : ۷۸۳، وقال الألباني صحیح ]"
    },
    {
      "ayah": 99,
      "tafsir": "(آیت 99) {وَ مَاۤ اَضَلَّنَاۤ اِلَّا الْمُجْرِمُوْنَ : } ان مجرموں سے مراد وہ سردار اور وڈیرے ہیں جنھوں نے انھیں گمراہ کیا تھا۔ پیروکاروں اور معتقدوں کی طرف سے انھی لوگوں کو نشانۂ ملامت بنایا جا رہا ہو گا جنھیں وہ دنیا میں اپنا پیشوا اور بزرگ مانتے تھے، ان کے ہاتھ پاؤں چومتے تھے، ان کی نذریں نیازیں چڑھاتے تھے، قیامت کو جب حقیقت کھلے گی اور پیچھے چلنے والوں کو معلوم ہو گا کہ آگے چلنے والے ہمیں کہاں لے آئے اور خود کہاں ہیں تو یہی پیروکار انھیں مجرم ٹھہرائیں گے اور ان پر لعنت کریں گے۔ قرآن نے کئی مقامات پر یہ نقشہ کھینچا ہے، تاکہ لوگ آنکھیں بند کرکے کسی کے پیچھے نہ چلیں اور تقلید کے بجائے تحقیق سے کام لیں۔ دیکھیے سورۂ بقرہ (۱۶۶، ۱۶۷)، اعراف (38،37)، احزاب (۶۷، ۶۸)، حٰم السجدہ (۲۹) اور سورۂ ص (۵۹ تا ۶۱)۔"
    },
    {
      "ayah": 100,
      "tafsir": "(آیت 100) {فَمَا لَنَا مِنْ شَافِعِيْنَ:} یعنی جن جن کو ہم دنیا میں اپنا سفارشی سمجھتے تھے اور ہمارا خیال تھا کہ ان کا دامن تھام لیں گے تو ہمارا بیڑا پار ہے، ان میں سے آج کوئی نظر نہیں آتا۔ مشرکوں کے لیے کوئی سفارشی نہیں ہو گا، جب کہ مومنوں کے لیے انبیاء، فرشتے اور مومن سفارشی ہوں گے۔"
    },
    {
      "ayah": 101,
      "tafsir": "(آیت 101) {وَ لَا صَدِيْقٍ حَمِيْمٍ : ’’ صَدِيْقٍ ‘‘} جو دوستی میں سچا ہو اور {’’ حَمِيْمٍ ‘‘} جسے دوست کی وجہ سے گرمی آتی ہو، یعنی دلی دوست۔ {’’ حَمِيْمٍ ‘‘} کا معنی رشتہ دار بھی ہے۔ یعنی کفار کا قیامت کے دن کوئی دلی دوست ہو گا نہ رشتے دار، سب ایک دوسرے کے دشمن بن جائیں گے، جب کہ مومنوں کے دوست انبیاء، فرشتے اور تمام مومن ہوں گے، جیسا کہ فرمایا : «{ اَلْاَخِلَّآءُ يَوْمَىِٕذٍۭ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ اِلَّا الْمُتَّقِيْنَ }» [ الزخرف : ۶۷ ] ’’سب دلی دوست اس دن ایک دوسرے کے دشمن ہوں گے مگر متقی لوگ۔‘‘"
    },
    {
      "ayah": 102,
      "tafsir": "(آیت 102) {فَلَوْ اَنَّ لَنَا كَرَّةً …:} کفار کی اس تمنا کا ذکر قرآن میں متعدد مقامات پر ہے اور یہ بھی کہ ان کی یہ تمنا کبھی پوری نہیں ہو گی۔ دیکھیے سورۂ بقرہ (۱۶۷)، انعام (۲۷، ۲۸) اور مؤمنون (۱۰۶ تا ۱۰۸)۔"
    },
    {
      "ayah": 103,
      "tafsir": "(آیت 103) {اِنَّ فِيْ ذٰلِكَ لَاٰيَةً …:} یعنی ابراہیم علیہ السلام کے اپنی قوم کو دعوت کے ان واقعات میں بہت بڑی نشانی ہے، اس کے باوجود ان کے اکثر لوگ ایمان لانے والے نہ ہوئے۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی بھی ہے کہ جب خلیل اللہ کی بے حد کوشش و محنت کے باوجود اکثر لوگ ایمان نہ لائے، تو آپ ان کے ایمان نہ لانے پر غمگین کیوں ہوتے ہیں۔ ایک معنی اس کا یہ بھی ہو سکتا ہے کہ ان قریش میں سے اکثر لوگ ماننے والے نہیں، سو آپ ان کے ایمان نہ لانے پر غمگین نہ ہوں۔"
    },
    {
      "ayah": 104,
      "tafsir": "(آیت 104) {وَ اِنَّ رَبَّكَ لَهُوَ الْعَزِيْزُ الرَّحِيْمُ :} اس آیت کی تفسیر کے لیے دیکھیے اسی سورت کی آیت (۹)۔"
    },
    {
      "ayah": 105,
      "tafsir": "(آیت 105) ➊ { كَذَّبَتْ قَوْمُ نُوْحٍ المُرْسَلِيْنَ:} سورت کا آغاز نبی کریم صلی اللہ علیہ وسلم کو تسلی دلانے اور رسولوں کو جھٹلانے کے انجامِ بد کے ساتھ ہوا تھا، موسیٰ اور ابراہیم علیھما السلام اور ان کی قوم کے ذکر کے بعد اب قومِ نوح کا ذکر ہوتا ہے۔ اس میں بھی رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی ہے اور اللہ کے رسولوں کو جھٹلانے والوں کے انجامِ بد کا ذکر ہے، اس کے بعد عاد، ثمود، قوم لوط اور اصحاب الایکہ کے ذکر میں بھی یہ دونوں چیزیں نمایاں ہیں۔ ¤ ➋ اگرچہ انھوں نے صرف ایک پیغمبر نوح علیہ السلام کو جھٹلایا تھا، لیکن چونکہ تمام پیغمبروں کی دعوت ایک تھی اور ایک پیغمبر کو جھٹلانا اس دعوت کو جھٹلانا ہے جو تمام پیغمبر لے کر آئے، اس لیے فرمایا کہ انھوں نے تمام پیغمبروں کو جھٹلا دیا۔ تقابل کے لیے دیکھیے سورۂ اعراف (۵۹ تا ۶۴)، یونس (۲۵ تا ۴۸)، بنی اسرائیل (۳)، انبیاء (۷۶، ۷۷)، مؤمنون (۲۳ تا ۳۰) اور فرقان (۳۷) اس کے علاوہ نوح علیہ السلام کے واقعہ کی تفصیل کے لیے یہ مقامات بھی زیر نظر رکھیں، سورۂ عنکبوت (۱۴، ۱۵)، صافات (۷۵ تا ۸۲)، قمر (۹ تا ۱۵) اور سورۂ نوح مکمل۔"
    },
    {
      "ayah": 106,
      "tafsir": "(آیت 106) { اِذْ قَالَ لَهُمْ اَخُوْهُمْ نُوْحٌ اَلَا تَتَّقُوْنَ : ’’ اَخُوْهُمْ ‘‘} کے لفظ سے ان کے ساتھ نوح علیہ السلام کا نسبی تعلق واضح کیا ہے اور اس خیر خواہی کی طرف اشارہ ہے جو نوح علیہ السلام کو اس قوم کا فرد ہونے کی وجہ سے ان کے سااتھ تھی۔ یہ بھی معلوم ہوا کہ رسول بشر ہی ہوتے ہیں اور حکمت کا تقاضا بھی یہی ہے، کیونکہ انسانوں کے لیے نمونہ انسان ہی بن سکتا ہے، فرشتہ یا کوئی اور نہیں، مگر اس وقت کفار نے بشر ہونے کی وجہ سے انھیں نبی نہیں مانا اور اب کئی جاہل ایسے ہیں جو نبی مانتے ہیں مگر نبی ہونے کی وجہ سے بشر نہیں مانتے۔ عقیدہ دونوں کا ایک ہے کہ بشر نبی نہیں ہو سکتا۔ قرآن نے جا بجا اس عقیدے کی تردید کی ہے۔ ¤ دوسرے مقامات پر مذکور نوح علیہ السلام کے خطاب کی ابتدا ان الفاظ سے ہوتی ہے : «{ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ اَفَلَا تَتَّقُوْنَ }» [ المؤمنون : ۲۳ ] ’’اے میری قوم! اللہ کی عبادت کرو، اس کے سوا تمھارا کوئی بھی معبود نہیں، تو کیا تم ڈرتے نہیں؟‘‘ اور فرمایا : «{ اَنِ اعْبُدُوا اللّٰهَ وَ اتَّقُوْهُ وَ اَطِيْعُوْنِ }» [ نوح : ۳ ] ’’کہ اللہ کی عبادت کرو اور اس سے ڈرو اور میرا کہنا مانو۔‘‘ دعوت کے آغاز میں خوف دلانے میں حکمت یہ ہے کہ جب تک کسی شخص یا قوم کو اس کے غلط رویے کے برے انجام کا خطرہ محسوس نہ کرایا جائے وہ صحیح بات پر توجہ کرنے کے لیے آمادہ نہیں ہوتا۔ ہمارے نبی کریم صلی اللہ علیہ وسلم نے بھی اپنے قریبی رشتہ داروں کو جمع کرکے صفا پر کھڑے ہو کر یہی کہا تھا : [ فَإِنِّيْ نَذِيْرٌ لَّكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيْدٍ ] [ بخاري، التفسیر، باب : «و أنذر عشیرتک الأقربین… » : ۴۷۷۰ ] ’’میں تمھیں ایک بہت سخت عذاب سے پہلے ڈرانے والا ہوں۔‘‘"
    },
    {
      "ayah": 107,
      "tafsir": "(آیت 108،107) { اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌ …:} نوح علیہ السلام نے دعویٔ رسالت کے ثبوت کے طور پر دو چیزیں پیش فرمائیں، پہلی یہ کہ میں امانت دار ہوں، میری ساری عمر تمھارے سامنے گزری، تم میری امانت اور میرے صدق سے خوب واقف ہو، پھر تمھیں میری رسالت تسلیم کرنے میں رکاوٹ کیا ہے؟ ہمارے نبی صلی اللہ علیہ وسلم کو بھی اللہ تعالیٰ نے یہ بات واشگاف الفاظ میں کہہ دینے کا حکم دیا، فرمایا : «{ فَقَدْ لَبِثْتُ فِيْكُمْ عُمُرًا مِّنْ قَبْلِهٖ اَفَلَا تَعْقِلُوْنَ }» [ یونس : ۱۶ ] ’’پس بے شک میں تم میں اس سے پہلے ایک عمر رہ چکا ہوں، تو کیا تم نہیں سمجھتے؟‘‘ حدیثِ ہرقل میں ابوسفیان نے جب رسول اللہ صلی اللہ علیہ وسلم کا صادق و امین ہونا تسلیم کیا تو ہرقل نے کہا : ’’یہ نہیں ہو سکتا کہ وہ لوگوں پر جھوٹ سے تو اجتناب کرے اور اللہ پر جھوٹ باندھ دے کہ اس نے مجھے رسول بنا کر بھیجا ہے۔‘‘ (دیکھیے بخاری : ۷) غرض نوح علیہ السلام نے قوم کو اپنے امین ہونے کا حوالہ دے کر اپنی رسالت کی اطلاع دی اور فرمایا (چونکہ میں رسول امین ہوں) اس لیے تم اللہ سے ڈرو کہ مجھے جھٹلا کر کہیں تم اس کے غضب کا نشانہ نہ بن جاؤ اور میرا کہا مانو۔ معلوم ہوا کہ رسول کا ہر حکم ماننا امت کے لیے ضروری ہے۔ یہ نہیں کہ وہ کتاب اللہ کی چند آیات پہنچا دے اور بس، اس کے علاوہ اس کی بات ماننا لازم نہ ہو۔"
    },
    {
      "ayah": 108,
      "tafsir": "(آیت 108،107) { اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌ …:} نوح علیہ السلام نے دعویٔ رسالت کے ثبوت کے طور پر دو چیزیں پیش فرمائیں، پہلی یہ کہ میں امانت دار ہوں، میری ساری عمر تمھارے سامنے گزری، تم میری امانت اور میرے صدق سے خوب واقف ہو، پھر تمھیں میری رسالت تسلیم کرنے میں رکاوٹ کیا ہے؟ ہمارے نبی صلی اللہ علیہ وسلم کو بھی اللہ تعالیٰ نے یہ بات واشگاف الفاظ میں کہہ دینے کا حکم دیا، فرمایا : «{ فَقَدْ لَبِثْتُ فِيْكُمْ عُمُرًا مِّنْ قَبْلِهٖ اَفَلَا تَعْقِلُوْنَ }» [ یونس : ۱۶ ] ’’پس بے شک میں تم میں اس سے پہلے ایک عمر رہ چکا ہوں، تو کیا تم نہیں سمجھتے؟‘‘ حدیثِ ہرقل میں ابوسفیان نے جب رسول اللہ صلی اللہ علیہ وسلم کا صادق و امین ہونا تسلیم کیا تو ہرقل نے کہا : ’’یہ نہیں ہو سکتا کہ وہ لوگوں پر جھوٹ سے تو اجتناب کرے اور اللہ پر جھوٹ باندھ دے کہ اس نے مجھے رسول بنا کر بھیجا ہے۔‘‘ (دیکھیے بخاری : ۷) غرض نوح علیہ السلام نے قوم کو اپنے امین ہونے کا حوالہ دے کر اپنی رسالت کی اطلاع دی اور فرمایا (چونکہ میں رسول امین ہوں) اس لیے تم اللہ سے ڈرو کہ مجھے جھٹلا کر کہیں تم اس کے غضب کا نشانہ نہ بن جاؤ اور میرا کہا مانو۔ معلوم ہوا کہ رسول کا ہر حکم ماننا امت کے لیے ضروری ہے۔ یہ نہیں کہ وہ کتاب اللہ کی چند آیات پہنچا دے اور بس، اس کے علاوہ اس کی بات ماننا لازم نہ ہو۔"
    },
    {
      "ayah": 109,
      "tafsir": "(آیت 109) ➊ { وَ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ:} اپنی رسالت کے ثبوت کے لیے دوسری چیز یہ پیش فرمائی کہ دین داری اور روحانیت کے دعوے داروں کا مقصود عموماً اپنی گدی جمانا، مال و زر جمع کرنا اور سرداری حاصل کرنا ہوتا ہے۔ خانقاہوں اور راہبوں کی کٹیاؤں کے تقدس کے پیچھے عموماً بدترین ہوس زر ہی چھپی ہوتی ہے، مگر مجھے اللہ کا پیغام پہنچانے میں نہ تم سے کسی مزدوری یا دنیاوی منفعت کی خواہش ہے نہ تم سے اس کا کوئی مطالبہ۔ ایسے بے غرض خیر خواہ کی بھی بات نہ مانو تو تم سے بڑا بدنصیب کون ہو گا۔ اس بات کا نوح علیہ السلام نے خاص طور پر اس لیے بھی ذکر کیا کہ ان کی قوم نے ان پر بہتان باندھا تھا کہ وہ رسالت کے ذریعے سے اپنی قوم پر بڑائی حاصل کرنا چاہتے ہیں، سورۂ مؤمنون میں ہے : «{ مَا هٰذَاۤ اِلَّا بَشَرٌ مِّثْلُكُمْ يُرِيْدُ اَنْ يَّتَفَضَّلَ عَلَيْكُمْ }» [ المؤمنون : ۲۴ ] ’’یہ نہیں ہے مگر تمھارے جیسا ایک بشر، جو چاہتا ہے کہ تم پر برتری حاصل کر لے۔‘‘ نوح علیہ السلام کی طرح ہمارے پیغمبر صلی اللہ علیہ وسلم کی پوری زندگی بھی اس کی شاہد عدل ہے، آپ صلی اللہ علیہ وسلم نے بھی اپنے پیچھے نہ کوئی دینار چھوڑا، نہ درہم اور نہ کوئی اور چیز، جو کچھ تھا صدقہ کر دیا۔ اللہ کے پیغمبر ایسے ہی بے لوث ہوتے ہیں اور وہ اس کا اعلان بھی کرتے رہتے ہیں۔ ¤ ➋ {اِنْ اَجْرِيَ اِلَّا عَلٰى رَبِّ الْعٰلَمِيْنَ:} اس میں قیامت کے عقیدے کی دعوت بھی ہے کہ میری تگ و دو اور محنت کی اجرت صرف اور صرف رب العالمین کے ذمے ہے اور ظاہر ہے کہ وہ قیامت کے دن ہی پوری پوری ملے گی۔"
    },
    {
      "ayah": 110,
      "tafsir": "(آیت 110) {فَاتَّقُوا اللّٰهَ وَ اَطِيْعُوْنِ:} یہ آیت دوبارہ آئی ہے، اس کے تکرار میں حکمت یہ ہے کہ پہلی آیت میں رسول امین کی اطاعت کا حکم دیا ہے اور اس کو جھٹلانے پر اللہ سے ڈرایا ہے اور اس آیت میں اس رسول کو جھٹلانے پر اللہ تعالیٰ سے ڈرایا ہے جو پیغامِ الٰہی پہنچانے میں کسی اجرت کا مطالبہ نہیں کرتا۔ فرمایا، ایسے بے لوث خیر خواہ کو جھٹلاتے ہوئے اللہ سے ڈرو اور اس کی اطاعت کرو۔"
    },
    {
      "ayah": 111,
      "tafsir": "(آیت 111) {قَالُوْۤا اَنُؤْمِنُ لَكَ …: ’’ الْاَرْذَلُوْنَ ‘‘ ’’أَرْذَلُ‘‘} (اسم تفضیل) کی جمع سالم ہے، سب سے کمتر، نیچ، ذلیل، جن کے پاس جاہ و مال نہ ہو، غریب، محتاج۔ ان میں وہ لوگ بھی آ جاتے ہیں جو حقیر سمجھے جانے والے پیشوں سے تعلق رکھتے ہیں۔ یہ بات کہنے والے نوح علیہ السلام کی قوم کے سردار تھے۔ دیکھیے سورۂ ہود (۲۷) اس سے معلوم ہوا کہ نوح علیہ السلام پر ایمان لانے والے زیادہ تر غریب لوگ، چھوٹے چھوٹے پیشہ ور یا ایسے نوجوان تھے جن کی قوم میں کوئی حیثیت نہ تھی۔ ہمارے نبی صلی اللہ علیہ وسلم پر ایمان لانے والے بھی ایسے ہی لوگ تھے۔ حدیثِ ہرقل میں ہے کہ اس نے ابوسفیان سے سوال کیا : [ فَأَشْرَافُ النَّاسِ يَتَّبِعُوْنَهُ أَمْ ضُعَفَائُهُمْ ؟ ] ’’اونچے لوگ اس کی پیروی اختیار کر رہے ہیں یا کمزور لوگ؟‘‘ ابوسفیان نے جواب دیا : ’’کمزور لوگ۔‘‘ تو ہرقل نے کہا : ’’رسولوں کی پیروی کرنے والے یہی لوگ ہوتے ہیں۔‘‘ [ بخاري، بدء الوحي، باب کیف کان بدء الوحي… : ۷ ] کیونکہ مال و جاہ والے لوگوں کو ایمان قبول کرنے میں ان کا مال و جاہ، اپنی عزت اور رتبے کا احساس اور دنیوی مفاد رکاوٹ بن جاتے ہیں، کیونکہ ایمان لانے کی صورت میں انھیں حکم منوانے کے بجائے حکم ماننا پڑتا ہے، جب کہ کمزور لوگ ان رکاوٹوں سے آزاد ہوتے ہیں۔ اس مکالمے میں نبی صلی اللہ علیہ وسلم کے لیے بھی تسلی ہے، کیونکہ آپ کی قوم کے لوگ بھی اللہ کے فضل کا مستحق مال داروں ہی کو سمجھتے تھے۔ ان کی نظر میں رسول اللہ صلی اللہ علیہ وسلم کے بجائے مکہ یا طائف کے کسی مال دار سردار کو نبوت ملنی چاہیے تھی، سورۂ زخرف میں ہے : «{ وَ قَالُوْا لَوْ لَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيْمٍ }» [ الزخرف : ۳۱ ] ’’اور انھوں نے کہا یہ قرآن ان دوبستیوں میں سے کسی بڑے آدمی پر کیوں نازل نہ کیا گیا؟‘‘ واضح رہے کہ مومن کو رذیل یا ذلیل سمجھنا یا کہنا جائز نہیں، بلکہ ہر مومن کے متعلق یہی خیال رکھنا چاہیے کہ ہو سکتا ہے یہ مجھ سے بہتر ہو، جیسا کہ فرمایا : «{ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا يَسْخَرْ قَوْمٌ مِّنْ قَوْمٍ عَسٰۤى اَنْ يَّكُوْنُوْا خَيْرًا مِّنْهُمْ } » [ الحجرات : ۱۱ ] ’’اے لوگو جو ایمان لائے ہو! کوئی قوم کسی قوم سے مذاق نہ کرے، ہو سکتا ہے کہ وہ ان سے بہتر ہوں۔‘‘"
    },
    {
      "ayah": 112,
      "tafsir": "(آیت 113،112) {قَالَ وَ مَا عِلْمِيْ بِمَا كَانُوْا يَعْمَلُوْنَ …:} یعنی مجھے تو اللہ کا راستہ بتانے سے غرض ہے نہ کہ ان کے پیشوں سے۔ وہ کمائی کے لیے جو بھی کام کریں یا جو بھی پیشہ اختیار کریں، اگر وہ جائز ہے تو وہ اپنے ایمان دار ہونے کی وجہ سے ان مغرور مال داروں سے افضل ہیں جو اللہ کی نافرمانی پر تلے ہوئے ہیں۔ یا مطلب یہ ہے کہ میں کیا جانوں کہ ان کے عمل کیسے ہیں، مجھے تو ظاہری ایمان کو دیکھنا ہے، ان کی نیتوں کو اللہ تعالیٰ جانتا ہے، وہی ان کا حساب کرے گا۔ ابن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتّٰی يَشْهَدُوْا أَنْ لَّا إِلٰهَ إِلَّا اللّٰهُ وَ أَنَّ مُحَمَّدًا رَّسُوْلُ اللّٰهِ، وَ يُقِيْمُوا الصَّلَاةَ، وَ يُؤْتُوا الزَّكَاةَ، فَإِذَا فَعَلُوْاا ذٰلِكَ عَصَمُوْا مِنِّيْ دِمَاءَهُمْ وَ أَمْوَالَهُمْ إِلَّا بِحَقِّ الْإِسْلَامِ وَ حِسَابُهُمْ عَلَی اللّٰهِ ] [ بخاري، الإیمان، باب فإن تابوا و أقاموا الصلاۃ : ۲۵ ] ’’مجھے حکم دیا گیا ہے کہ میں لوگوں سے جنگ کروں، یہاں تک کہ وہ شہادت دیں کہ اللہ کے سوا کوئی معبود نہیں اور محمد اللہ کے رسول ہیں اور نماز قائم کریں اور زکوٰۃ دیں، اگر وہ یہ کام کریں تو انھوں نے اپنے خون اور اپنے مال مجھ سے محفوظ کر لیے مگر اسلام کے حق کے ساتھ اور ان کا حساب اللہ پر ہے۔‘‘"
    },
    {
      "ayah": 113,
      "tafsir": "(آیت 113،112) {قَالَ وَ مَا عِلْمِيْ بِمَا كَانُوْا يَعْمَلُوْنَ …:} یعنی مجھے تو اللہ کا راستہ بتانے سے غرض ہے نہ کہ ان کے پیشوں سے۔ وہ کمائی کے لیے جو بھی کام کریں یا جو بھی پیشہ اختیار کریں، اگر وہ جائز ہے تو وہ اپنے ایمان دار ہونے کی وجہ سے ان مغرور مال داروں سے افضل ہیں جو اللہ کی نافرمانی پر تلے ہوئے ہیں۔ یا مطلب یہ ہے کہ میں کیا جانوں کہ ان کے عمل کیسے ہیں، مجھے تو ظاہری ایمان کو دیکھنا ہے، ان کی نیتوں کو اللہ تعالیٰ جانتا ہے، وہی ان کا حساب کرے گا۔ ابن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتّٰی يَشْهَدُوْا أَنْ لَّا إِلٰهَ إِلَّا اللّٰهُ وَ أَنَّ مُحَمَّدًا رَّسُوْلُ اللّٰهِ، وَ يُقِيْمُوا الصَّلَاةَ، وَ يُؤْتُوا الزَّكَاةَ، فَإِذَا فَعَلُوْاا ذٰلِكَ عَصَمُوْا مِنِّيْ دِمَاءَهُمْ وَ أَمْوَالَهُمْ إِلَّا بِحَقِّ الْإِسْلَامِ وَ حِسَابُهُمْ عَلَی اللّٰهِ ] [ بخاري، الإیمان، باب فإن تابوا و أقاموا الصلاۃ : ۲۵ ] ’’مجھے حکم دیا گیا ہے کہ میں لوگوں سے جنگ کروں، یہاں تک کہ وہ شہادت دیں کہ اللہ کے سوا کوئی معبود نہیں اور محمد اللہ کے رسول ہیں اور نماز قائم کریں اور زکوٰۃ دیں، اگر وہ یہ کام کریں تو انھوں نے اپنے خون اور اپنے مال مجھ سے محفوظ کر لیے مگر اسلام کے حق کے ساتھ اور ان کا حساب اللہ پر ہے۔‘‘"
    },
    {
      "ayah": 114,
      "tafsir": "(آیت 114) { وَ مَاۤ اَنَا بِطَارِدِ الْمُؤْمِنِيْنَ : } یہ سرداروں کے اس مطالبے کا جواب ہے کہ  ان رذیلوں کو اپنے ہاں سے نکال دیں تو ہم آپ کی مجلس میں بیٹھیں، فرمایا میں کسی صورت ایمان والوں کو نکال دینے والا نہیں کہ انھیں دھکے دے کر نکال دوں۔ (نفی کی تاکید باء کے ساتھ ہونے کی وجہ سے ترجمہ میں ’’کسی صورت‘‘ کا اضافہ کیا گیا ہے) یہ کیسے ہو سکتا ہے کہ جو لوگ میری بات نہیں مانتے میں ان کے پیچھے پھرتا رہوں اور جو میری بات مانتے ہیں انھیں دھکے دے کر نکال دوں۔ (دیکھیے عبس : ۵ تا ۹) میرا کام تو صاف اور واضح الفاظ میں کفر کے برے انجام سے ڈرانا ہے، پھر جس کا جی چاہے مانے جس کا جی چاہے نہ مانے۔ ہمارے نبی صلی اللہ علیہ وسلم کے ساتھ بھی بعینہٖ یہی صورت پیش آئی، نوح علیہ السلام اور ان کی قوم کی گفتگو آپ صلی اللہ علیہ وسلمکو اسی لیے سنائی جا رہی ہے، فرق صرف نوح علیہ السلام اور محمد صلی اللہ علیہ وسلم کا ہے، ورنہ دونوں کی دعوت اور دونوں کے لیے مغرور اور متکبر سرداروں کا جواب ایک ہی ہے۔ یقینا اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے بہت بڑی تسلی ہے کہ یہ سب کچھ آپ ہی پر نہیں گزر رہا، اہلِ زمین کی طرف سب سے پہلے رسول کے ساتھ بھی یہی کچھ ہوا تھا۔ اہلِ ایمان کو اپنے پاس سے نکالنے کی ممانعت کے لیے دیکھیے سورۂ انعام (۵۲، ۵۳) اور کہف (۲۸)۔"
    },
    {
      "ayah": 115,
      "tafsir": ""
    },
    {
      "ayah": 116,
      "tafsir": "(آیت 116) {قَالُوْا لَىِٕنْ لَّمْ تَنْتَهِ يٰنُوْحُ … :} نوح علیہ السلام اور ان کی قوم کی یہ گفتگو دو چار مواقع کی بات نہیں بلکہ ان کے ساتھ ان کی قوم کی یہ کش مکش ساڑھے نو سو (۹۵۰) برس جاری رہی۔ جیسے جیسے آپ دعوت کے کام میں آگے بڑھتے گئے وہ بدی میں آگے بڑھتے گئے۔ آخر کار تمام ظالم و جابر لوگوں کی طرح، جو دلیل میں لاجواب ہو کر دھمکیوں اور تشدد پر اتر آتے ہیں، نوح علیہ السلام کی قوم نے بھی صاف لفظوں میں کہہ دیا کہ آئندہ اگر تم اپنی دعوت سے باز نہ آئے تو ہم پتھر مار مار کر تمھیں ختم کر دیں گے۔"
    },
    {
      "ayah": 117,
      "tafsir": "(آیت 117) {قَالَ رَبِّ اِنَّ قَوْمِيْ كَذَّبُوْنِ : ’’ كَذَّبُوْنِ ‘‘} اصل میں {’’كَذَّبُوْنِيْ‘‘} ہے۔ جب قوم اس حد تک پہنچ گئی کہ اپنے رسول کو سنگسار کر دے اور اللہ تعالیٰ نے نوح علیہ السلام کو اطلاع بھی دے دی کہ اب ان میں سے مزید کوئی ایمان نہیں لائے گا (دیکھیے ہود : ۳۷) تو انھوں نے اللہ تعالیٰ سے دعا کی، اس دعا کے الفاظ قرآن میں مختلف مقامات پر موجود ہیں، فرمایا : «{ اَنِّيْ مَغْلُوْبٌ فَانْتَصِرْ }» [ القمر : ۱۰ ] ’’کہ بے شک میں مغلوب ہوں، سو تو بدلا لے۔‘‘ اور فرمایا : «{ رَبِّ لَا تَذَرْ عَلَى الْاَرْضِ مِنَ الْكٰفِرِيْنَ دَيَّارًا }» [ نوح : ۲۶ ] ’’اے میرے رب! زمین پر ان کافروں میں سے کوئی رہنے والا نہ چھوڑ۔‘‘ یہاں انھوں نے جو کہا ہے کہ ’’اے میرے رب! میری قوم نے مجھے جھٹلا دیا‘‘ یہ اللہ کے حضور شکایت کے لیے ہے، یہ نہیں کہ اللہ تعالیٰ کو یہ بات معلوم نہیں اور نوح علیہ السلام اسے بتا رہے ہیں۔"
    },
    {
      "ayah": 118,
      "tafsir": "(آیت 118) { فَافْتَحْ بَيْنِيْ وَ بَيْنَهُمْ فَتْحًا …:} اس فیصلے سے مراد انھیں نیست و نابود کر دینے والا عذاب ہے، جو{’’ وَ نَجِّنِيْ وَ مَنْ مَّعِيَ مِنَ الْمُؤْمِنِيْنَ ‘‘} سے سمجھ میں آ رہا ہے۔"
    },
    {
      "ayah": 119,
      "tafsir": "(آیت 120،119) { فَاَنْجَيْنٰهُ وَ مَنْ مَّعَهٗ … :} اس کی تفصیل سورۂ ہود (۳۶ تا ۴۹) میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 120,
      "tafsir": "(آیت 120،119) { فَاَنْجَيْنٰهُ وَ مَنْ مَّعَهٗ … :} اس کی تفصیل سورۂ ہود (۳۶ تا ۴۹) میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 121,
      "tafsir": "(آیت 122،121) {اِنَّ فِيْ ذٰلِكَ لَاٰيَةً…:} ان آیات کی تفسیر سورت کے شروع میں آیت (۸، ۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 122,
      "tafsir": "(آیت 122،121) {اِنَّ فِيْ ذٰلِكَ لَاٰيَةً…:} ان آیات کی تفسیر سورت کے شروع میں آیت (۸، ۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 123,
      "tafsir": "(آیت 123تا127) ➊ { كَذَّبَتْ عَادٌ المُرْسَلِيْنَ …:} نوح علیہ السلام اور ان کے بعد چاروں انبیاء علیھم السلام کے قصوں میں خاص طور پر تقویٰ اور اطاعت کے حکم اور تبلیغ رسالت پر کسی قسم کے بدلے کی نفی سے ظاہر ہوتا ہے کہ انبیاء کی بعثت کا بنیادی مقصد اللہ تعالیٰ کی معرفت، اس کی توحید اور اس کے رسولوں کی اطاعت کا حکم دینا ہے اور یہ کہ انبیاء علیھم السلام دنیاوی طمع سے پاک ہوتے ہیں۔ ¤ ➋ اس قصے کی اور نوح علیہ السلام کے قصے کی ابتدائی آیات ایک جیسی ہیں، اس لیے ان کی تفسیر دہرانے کی ضرورت نہیں۔ تقابل کے لیے دیکھیے سورۂ اعراف (۶۵ تا ۷۲) اور ہود (۵۰ تا ۶۰) مزید تفصیلات ان مقامات پر بھی ہیں، سورۂ حٰم السجدہ (۱۳ تا ۱۶)، احقاف (۲۱ تا ۲۶)، ذاریات (۴۱ تا ۴۵)، قمر (۱۸ تا ۲۲) اور سورۂ فجر (۶ تا ۸) قومِ عاد کا مسکن حضر موت کے قریب اس جگہ تھا جسے اب ’’الربع الخالی‘‘ کہا جاتا ہے۔ دیکھیے سورۂ اعراف (۶۵)۔ ¤ ➌ { اِذْ قَالَ لَهُمْ اَخُوْهُمْ هُوْدٌ …:} ہود علیہ السلام کی تقریر سمجھنے کے لیے اس قوم کے متعلق وہ بنیادی معلومات نگاہ میں رہنا ضروری ہیں جو قرآن مجید میں مختلف مقامات پر مذکور ہیں۔ ان کے مطابق قوم نوح کی تباہی کے بعد اس قوم کو عروج عطا ہوا۔ (اعراف : ۶۹) جسمانی لحاظ سے یہ لوگ بڑے تنو مند اور زور آور تھے۔ (اعراف : ۶۹۔ حاقہ : ۷) اس قوم جیسی کوئی قوم پیدا نہیں کی گئی۔ (فجر : ۸) وہ نہایت ترقی یافتہ تھے، اونچے اونچے ستونوں والی بلند و بالا عمارتیں بنانے کی وجہ سے ان کی شہرت ہی ’’ستونوں والے‘‘ کے نام سے تھی۔ (فجر : ۶، ۷) مادی ترقی اور جسمانی قوت کی وجہ سے وہ سخت متکبر تھے اور کسی کو اپنے سے طاقتور نہیں مانتے تھے۔ (حٰم السجدہ : ۱۵) ان کا سیاسی نظام بڑے بڑے سرکش جباروں کے ہاتھ میں تھا۔ (ہود : ۵۹) مذہبی لحاظ سے اللہ تعالیٰ کے منکر نہیں تھے بلکہ مشرک تھے، ایک اللہ کو معبود ماننے کے لیے تیار نہ تھھے۔ (اعراف : ۷۰)"
    },
    {
      "ayah": 124,
      "tafsir": "(آیت 123تا127) ➊ { كَذَّبَتْ عَادٌ المُرْسَلِيْنَ …:} نوح علیہ السلام اور ان کے بعد چاروں انبیاء علیھم السلام کے قصوں میں خاص طور پر تقویٰ اور اطاعت کے حکم اور تبلیغ رسالت پر کسی قسم کے بدلے کی نفی سے ظاہر ہوتا ہے کہ انبیاء کی بعثت کا بنیادی مقصد اللہ تعالیٰ کی معرفت، اس کی توحید اور اس کے رسولوں کی اطاعت کا حکم دینا ہے اور یہ کہ انبیاء علیھم السلام دنیاوی طمع سے پاک ہوتے ہیں۔ ¤ ➋ اس قصے کی اور نوح علیہ السلام کے قصے کی ابتدائی آیات ایک جیسی ہیں، اس لیے ان کی تفسیر دہرانے کی ضرورت نہیں۔ تقابل کے لیے دیکھیے سورۂ اعراف (۶۵ تا ۷۲) اور ہود (۵۰ تا ۶۰) مزید تفصیلات ان مقامات پر بھی ہیں، سورۂ حٰم السجدہ (۱۳ تا ۱۶)، احقاف (۲۱ تا ۲۶)، ذاریات (۴۱ تا ۴۵)، قمر (۱۸ تا ۲۲) اور سورۂ فجر (۶ تا ۸) قومِ عاد کا مسکن حضر موت کے قریب اس جگہ تھا جسے اب ’’الربع الخالی‘‘ کہا جاتا ہے۔ دیکھیے سورۂ اعراف (۶۵)۔ ¤ ➌ { اِذْ قَالَ لَهُمْ اَخُوْهُمْ هُوْدٌ …:} ہود علیہ السلام کی تقریر سمجھنے کے لیے اس قوم کے متعلق وہ بنیادی معلومات نگاہ میں رہنا ضروری ہیں جو قرآن مجید میں مختلف مقامات پر مذکور ہیں۔ ان کے مطابق قوم نوح کی تباہی کے بعد اس قوم کو عروج عطا ہوا۔ (اعراف : ۶۹) جسمانی لحاظ سے یہ لوگ بڑے تنو مند اور زور آور تھے۔ (اعراف : ۶۹۔ حاقہ : ۷) اس قوم جیسی کوئی قوم پیدا نہیں کی گئی۔ (فجر : ۸) وہ نہایت ترقی یافتہ تھے، اونچے اونچے ستونوں والی بلند و بالا عمارتیں بنانے کی وجہ سے ان کی شہرت ہی ’’ستونوں والے‘‘ کے نام سے تھی۔ (فجر : ۶، ۷) مادی ترقی اور جسمانی قوت کی وجہ سے وہ سخت متکبر تھے اور کسی کو اپنے سے طاقتور نہیں مانتے تھے۔ (حٰم السجدہ : ۱۵) ان کا سیاسی نظام بڑے بڑے سرکش جباروں کے ہاتھ میں تھا۔ (ہود : ۵۹) مذہبی لحاظ سے اللہ تعالیٰ کے منکر نہیں تھے بلکہ مشرک تھے، ایک اللہ کو معبود ماننے کے لیے تیار نہ تھھے۔ (اعراف : ۷۰)"
    },
    {
      "ayah": 125,
      "tafsir": "(آیت 123تا127) ➊ { كَذَّبَتْ عَادٌ المُرْسَلِيْنَ …:} نوح علیہ السلام اور ان کے بعد چاروں انبیاء علیھم السلام کے قصوں میں خاص طور پر تقویٰ اور اطاعت کے حکم اور تبلیغ رسالت پر کسی قسم کے بدلے کی نفی سے ظاہر ہوتا ہے کہ انبیاء کی بعثت کا بنیادی مقصد اللہ تعالیٰ کی معرفت، اس کی توحید اور اس کے رسولوں کی اطاعت کا حکم دینا ہے اور یہ کہ انبیاء علیھم السلام دنیاوی طمع سے پاک ہوتے ہیں۔ ¤ ➋ اس قصے کی اور نوح علیہ السلام کے قصے کی ابتدائی آیات ایک جیسی ہیں، اس لیے ان کی تفسیر دہرانے کی ضرورت نہیں۔ تقابل کے لیے دیکھیے سورۂ اعراف (۶۵ تا ۷۲) اور ہود (۵۰ تا ۶۰) مزید تفصیلات ان مقامات پر بھی ہیں، سورۂ حٰم السجدہ (۱۳ تا ۱۶)، احقاف (۲۱ تا ۲۶)، ذاریات (۴۱ تا ۴۵)، قمر (۱۸ تا ۲۲) اور سورۂ فجر (۶ تا ۸) قومِ عاد کا مسکن حضر موت کے قریب اس جگہ تھا جسے اب ’’الربع الخالی‘‘ کہا جاتا ہے۔ دیکھیے سورۂ اعراف (۶۵)۔ ¤ ➌ { اِذْ قَالَ لَهُمْ اَخُوْهُمْ هُوْدٌ …:} ہود علیہ السلام کی تقریر سمجھنے کے لیے اس قوم کے متعلق وہ بنیادی معلومات نگاہ میں رہنا ضروری ہیں جو قرآن مجید میں مختلف مقامات پر مذکور ہیں۔ ان کے مطابق قوم نوح کی تباہی کے بعد اس قوم کو عروج عطا ہوا۔ (اعراف : ۶۹) جسمانی لحاظ سے یہ لوگ بڑے تنو مند اور زور آور تھے۔ (اعراف : ۶۹۔ حاقہ : ۷) اس قوم جیسی کوئی قوم پیدا نہیں کی گئی۔ (فجر : ۸) وہ نہایت ترقی یافتہ تھے، اونچے اونچے ستونوں والی بلند و بالا عمارتیں بنانے کی وجہ سے ان کی شہرت ہی ’’ستونوں والے‘‘ کے نام سے تھی۔ (فجر : ۶، ۷) مادی ترقی اور جسمانی قوت کی وجہ سے وہ سخت متکبر تھے اور کسی کو اپنے سے طاقتور نہیں مانتے تھے۔ (حٰم السجدہ : ۱۵) ان کا سیاسی نظام بڑے بڑے سرکش جباروں کے ہاتھ میں تھا۔ (ہود : ۵۹) مذہبی لحاظ سے اللہ تعالیٰ کے منکر نہیں تھے بلکہ مشرک تھے، ایک اللہ کو معبود ماننے کے لیے تیار نہ تھھے۔ (اعراف : ۷۰)"
    },
    {
      "ayah": 126,
      "tafsir": "(آیت 123تا127) ➊ { كَذَّبَتْ عَادٌ المُرْسَلِيْنَ …:} نوح علیہ السلام اور ان کے بعد چاروں انبیاء علیھم السلام کے قصوں میں خاص طور پر تقویٰ اور اطاعت کے حکم اور تبلیغ رسالت پر کسی قسم کے بدلے کی نفی سے ظاہر ہوتا ہے کہ انبیاء کی بعثت کا بنیادی مقصد اللہ تعالیٰ کی معرفت، اس کی توحید اور اس کے رسولوں کی اطاعت کا حکم دینا ہے اور یہ کہ انبیاء علیھم السلام دنیاوی طمع سے پاک ہوتے ہیں۔ ¤ ➋ اس قصے کی اور نوح علیہ السلام کے قصے کی ابتدائی آیات ایک جیسی ہیں، اس لیے ان کی تفسیر دہرانے کی ضرورت نہیں۔ تقابل کے لیے دیکھیے سورۂ اعراف (۶۵ تا ۷۲) اور ہود (۵۰ تا ۶۰) مزید تفصیلات ان مقامات پر بھی ہیں، سورۂ حٰم السجدہ (۱۳ تا ۱۶)، احقاف (۲۱ تا ۲۶)، ذاریات (۴۱ تا ۴۵)، قمر (۱۸ تا ۲۲) اور سورۂ فجر (۶ تا ۸) قومِ عاد کا مسکن حضر موت کے قریب اس جگہ تھا جسے اب ’’الربع الخالی‘‘ کہا جاتا ہے۔ دیکھیے سورۂ اعراف (۶۵)۔ ¤ ➌ { اِذْ قَالَ لَهُمْ اَخُوْهُمْ هُوْدٌ …:} ہود علیہ السلام کی تقریر سمجھنے کے لیے اس قوم کے متعلق وہ بنیادی معلومات نگاہ میں رہنا ضروری ہیں جو قرآن مجید میں مختلف مقامات پر مذکور ہیں۔ ان کے مطابق قوم نوح کی تباہی کے بعد اس قوم کو عروج عطا ہوا۔ (اعراف : ۶۹) جسمانی لحاظ سے یہ لوگ بڑے تنو مند اور زور آور تھے۔ (اعراف : ۶۹۔ حاقہ : ۷) اس قوم جیسی کوئی قوم پیدا نہیں کی گئی۔ (فجر : ۸) وہ نہایت ترقی یافتہ تھے، اونچے اونچے ستونوں والی بلند و بالا عمارتیں بنانے کی وجہ سے ان کی شہرت ہی ’’ستونوں والے‘‘ کے نام سے تھی۔ (فجر : ۶، ۷) مادی ترقی اور جسمانی قوت کی وجہ سے وہ سخت متکبر تھے اور کسی کو اپنے سے طاقتور نہیں مانتے تھے۔ (حٰم السجدہ : ۱۵) ان کا سیاسی نظام بڑے بڑے سرکش جباروں کے ہاتھ میں تھا۔ (ہود : ۵۹) مذہبی لحاظ سے اللہ تعالیٰ کے منکر نہیں تھے بلکہ مشرک تھے، ایک اللہ کو معبود ماننے کے لیے تیار نہ تھھے۔ (اعراف : ۷۰)"
    },
    {
      "ayah": 127,
      "tafsir": "(آیت 123تا127) ➊ { كَذَّبَتْ عَادٌ المُرْسَلِيْنَ …:} نوح علیہ السلام اور ان کے بعد چاروں انبیاء علیھم السلام کے قصوں میں خاص طور پر تقویٰ اور اطاعت کے حکم اور تبلیغ رسالت پر کسی قسم کے بدلے کی نفی سے ظاہر ہوتا ہے کہ انبیاء کی بعثت کا بنیادی مقصد اللہ تعالیٰ کی معرفت، اس کی توحید اور اس کے رسولوں کی اطاعت کا حکم دینا ہے اور یہ کہ انبیاء علیھم السلام دنیاوی طمع سے پاک ہوتے ہیں۔ ¤ ➋ اس قصے کی اور نوح علیہ السلام کے قصے کی ابتدائی آیات ایک جیسی ہیں، اس لیے ان کی تفسیر دہرانے کی ضرورت نہیں۔ تقابل کے لیے دیکھیے سورۂ اعراف (۶۵ تا ۷۲) اور ہود (۵۰ تا ۶۰) مزید تفصیلات ان مقامات پر بھی ہیں، سورۂ حٰم السجدہ (۱۳ تا ۱۶)، احقاف (۲۱ تا ۲۶)، ذاریات (۴۱ تا ۴۵)، قمر (۱۸ تا ۲۲) اور سورۂ فجر (۶ تا ۸) قومِ عاد کا مسکن حضر موت کے قریب اس جگہ تھا جسے اب ’’الربع الخالی‘‘ کہا جاتا ہے۔ دیکھیے سورۂ اعراف (۶۵)۔ ¤ ➌ { اِذْ قَالَ لَهُمْ اَخُوْهُمْ هُوْدٌ …:} ہود علیہ السلام کی تقریر سمجھنے کے لیے اس قوم کے متعلق وہ بنیادی معلومات نگاہ میں رہنا ضروری ہیں جو قرآن مجید میں مختلف مقامات پر مذکور ہیں۔ ان کے مطابق قوم نوح کی تباہی کے بعد اس قوم کو عروج عطا ہوا۔ (اعراف : ۶۹) جسمانی لحاظ سے یہ لوگ بڑے تنو مند اور زور آور تھے۔ (اعراف : ۶۹۔ حاقہ : ۷) اس قوم جیسی کوئی قوم پیدا نہیں کی گئی۔ (فجر : ۸) وہ نہایت ترقی یافتہ تھے، اونچے اونچے ستونوں والی بلند و بالا عمارتیں بنانے کی وجہ سے ان کی شہرت ہی ’’ستونوں والے‘‘ کے نام سے تھی۔ (فجر : ۶، ۷) مادی ترقی اور جسمانی قوت کی وجہ سے وہ سخت متکبر تھے اور کسی کو اپنے سے طاقتور نہیں مانتے تھے۔ (حٰم السجدہ : ۱۵) ان کا سیاسی نظام بڑے بڑے سرکش جباروں کے ہاتھ میں تھا۔ (ہود : ۵۹) مذہبی لحاظ سے اللہ تعالیٰ کے منکر نہیں تھے بلکہ مشرک تھے، ایک اللہ کو معبود ماننے کے لیے تیار نہ تھھے۔ (اعراف : ۷۰)"
    },
    {
      "ayah": 128,
      "tafsir": "(آیت 128) {اَتَبْنُوْنَ بِكُلِّ رِيْعٍ اٰيَةً تَعْبَثُوْنَ : ’’ رِيْعٍ ‘‘} اونچی جگہ۔ قاموس میں ہے {’’رِيْعٌ‘‘} (کسرہ اور فتحہ کے ساتھ) اونچی زمین یا ہر کشادہ راستہ یا ہر راستہ یا پہاڑ میں کھلا راستہ یا بلند پہاڑ۔ واحد کے لیے تاء کے ساتھ استعمال ہوتا ہے۔ {’’ اٰيَةً ‘‘} نشانی، یادگار۔ {’’ تَعْبَثُوْنَ ‘‘ ’’عَبَثٌ‘‘} (ع) بے فائدہ اور لاحاصل کام کرنا، یعنی تم بے فائدہ اور لاحاصل کام کرتے ہو۔ {’’كُلُّ رِيْعٍ‘‘} سے مراد بہت سی اونچی جگہیں ہیں، کیونکہ ہر اونچی جگہ تو یاد گار نہ بن سکتی ہے اور نہ انھوں نے بنائی تھی۔ ہود علیہ السلام نے پہلے اپنی قوم کو تمام انبیاء کی لائی ہوئی بنیادی تعلیم اللہ پر ایمان، اس کے تقویٰ اور اطاعت کی دعوت دی، اس کے بعد ان کے چند کاموں پر انکار کا اظہار فرمایا۔ پہلا یہ کہ تم ہر اونچی اور نمایاں جگہ، جہاں تمھارے فخر و غرور، تمھاری شان و شوکت اور دولت و قوت کا اظہار ہو سکتا ہے کوئی نہ کوئی یاد گار بنا دیتے ہو، جس کا دنیا یا آخرت میں کوئی فائدہ نہیں۔ ہود علیہ السلام کا مقصد نمود و نمائش کے اس رجحان سے ہٹانا ہے، جس کی وجہ سے ایسے عبث کام کیے جاتے ہیں اور سمجھا جاتا ہے کہ ہم کسی کے سامنے جواب دہ نہیں ہیں۔ بے دریغ مال خرچ کرتے ہوئے کوئی اپنی یاد گار کے طور پر شاندار مقبرہ تعمیر کرا دیتا ہے، کوئی بلند و بالا مینار کھڑا کر دیتا ہے، کوئی بارہ دری بنوا دیتا ہے۔ عجائب عالم میں شمار ہونے والے اہرامِ مصر اور تاج محل بھی اپنے بانیوں کی ایسی ہی لاحاصل اور عبث یاد گاریں ہیں، جن کی جواب دہی انھیں کرنا ہو گی۔ ان یادگاروں کی مذمت اس لیے فرمائی کہ یہ فخر و غرور، فضول خرچی اور عمر عزیز کو ضائع کرنے پر دلالت کرتی ہیں، جن کا باعث یہ ہے کہ ان کے بنانے والوں کو جواب دہی کا احساس نہیں۔"
    },
    {
      "ayah": 129,
      "tafsir": "(آیت 129) {وَ تَتَّخِذُوْنَ مَصَانِعَ …:’’ مَصَانِعَ ‘‘ ’’مَصْنَعٌ‘‘} یا {’’مَصْنَعَةٌ‘‘} کی جمع ہے۔ مختار الصحاح اور قاموس میں اس کا معنی بڑے بڑے قلعے، مضبوط محلات اور زمین دوز نہریں لکھا ہے۔ راغب لکھتے ہیں کہ {’’صَنْعٌ‘‘} کا معنی کوئی کام عمدہ طریقے سے کرنا ہے۔ عالی شان جگہوں کو {’’ مَصَانِعَ ‘‘} کہا گیا ہے۔ {’’ لَعَلَّكُمْ ‘‘ ’’لَعَلَّ‘‘} کا معنی ہے ’’امید ہے، شاید‘‘ یہاں یہ {’’كَأَنَّ‘‘} کا مفہوم ادا کر رہا ہے ’’گویا، جیسے۔‘‘ یہ ان کا دوسرا کام ہے جس پر ہود علیہ السلام نے انکار کا اظہار فرمایا، اس سے ان کی ہمیشہ زندہ رہنے کی حرص اور لمبی امید کا اظہار ہوتا تھا۔ یعنی تمھاری دوسری قسم کی تعمیرات ایسی ہیں جو اگرچہ استعمال کے لیے ہیں مگر انھیں شاندار، مزین اور مستحکم بنانے کے لیے تم اپنی دولت، محنت اور قابلیت اس طرح صرف کرتے ہو جیسے تمھیں ہمیشہ یہیں رہنا ہے، اس کے سوا تمھیں کسی اور زندگی کی فکر ہی نہیں۔ ¤ ابن کثیر نے ابن ابی حاتم سے نقل فرمایا ہے کہ ابوالدرداء رضی اللہ عنہ نے ’’غوطہ‘‘ میں مسلمانوں کی بنائی ہوئی عمارتیں اور شجر کاری دیکھی تو ان کی مسجد میں جا کر آواز دی : ’’اے دمشق والو!‘‘ وہ ان کے پاس جمع ہو گئے، تو انھوں نے اللہ کی حمد و ثنا کی، پھر فرمایا : ’’کیا تم حیا نہیں کرتے؟ کیا تم حیا نہیں کرتے؟ تم وہ کچھ جمع کر رہے ہو جو کھاتے نہیں اور وہ عمارتیں بنا رہے ہو جن میں رہتے نہیں اور اس کی امید کرتے ہو جو کبھی حاصل نہیں کر سکتے۔ حقیقت یہ ہے کہ تم سے پہلے کئی صدیاں گزریں، وہ لوگ جمع کرتے تھے، پھر اس کی حفاظت کرتے تھے، عمارتیں بناتے تھے اور بہت مضبوط بناتے تھے، امیدیں باندھتے تھے اور بہت لمبی باندھتے تھے، پھر ان کی امید دھوکا نکلی اور ان کی جماعت ہلاک ہو گئی اور ان کی رہائش گاہیں قبریں بن گئیں۔ یاد رکھو! قوم عاد عدن سے عمان تک گھوڑوں اور اونٹوں کے مالک تھے، اب کون ہے جو مجھ سے ان کی میراث دو درہم میں خرید لے؟‘‘ دکتور حکمت بن بشیر نے فرمایا، اس کی سند حسن ہے۔"
    },
    {
      "ayah": 130,
      "tafsir": "(آیت 130) {وَ اِذَا بَطَشْتُمْ بَطَشْتُمْ جَبَّارِيْنَ :} یہ ان کا تیسرا کام ہے جس پر ہود علیہ السلام نے انکار فرمایا کہ تم ایسے سنگدل اور انسانیت سے عاری ہو کہ کمزوروں کے لیے تمھارے دل میں کوئی رحم نہیں، وہ گرد و پیش کی کمزور قومیں ہوں یا تمھارے پست طبقہ کے لوگ، جب انھیں پکڑتے ہو تو بہت بے رحم ہو کر پکڑتے ہو، دنیا کے لالچ اور تکبر نے انسانی اخلاق کا لباس تمھارے جسموں سے اتار دیا ہے۔ اس کا باعث بھی یہی تھا کہ ان کا اللہ کی توحید اوریوم آخرت پر ایمان نہ تھا۔ ایمان سنگدلی کی اجازت نہیں دیتا۔ مومن قتل کرتے وقت بھی سنگدلی سے کام نہیں لیتا۔ عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَعَفَّ النَّاسِ قِتْلَةً أَهْلُ الْإِيْمَانِ ] [ مسند أحمد : 393/1، ح : ۳۷۲۸، قال المحقق حدیث حسن ] ’’یقینا قتل کرنے میں سب لوگوں سے زیادہ اچھا طریقہ اختیار کرنے والے اہل ایمان ہوتے ہیں۔‘‘"
    },
    {
      "ayah": 131,
      "tafsir": "(آیت 131) {فَاتَّقُوا اللّٰهَ وَ اَطِيْعُوْنِ :} یہ دعوت کا خلاصہ ہے جو تقریر کے شروع میں بیان فرمایا، تاکید کے لیے اسے پھر بیان فرمایا ہے کہ اللہ سے ڈر کر اس اکیلے کی عبادت کرو اور اس کے رسول کی اطاعت کرو۔"
    },
    {
      "ayah": 132,
      "tafsir": "(آیت 132تا134) {وَ اتَّقُوا الَّذِيْۤ اَمَدَّكُمْ بِمَا تَعْلَمُوْنَ …:} نصیحت کرتے ہوئے ہود علیہ السلام نے انھیں اللہ تعالیٰ کی نعمتیں یاد دلا کر تیسری بار پھر اس سے ڈرایا۔ پہلی آیت میں مجمل طور پر نعمتیں ذکر فرمائیں، پھر مفصل طریقے سے بیان کیں، یعنی سوچو جس مالک نے تمھیں اتنی نعمتیں عطا فرمائیں وہ انھیں چھین بھی سکتا ہے۔"
    },
    {
      "ayah": 133,
      "tafsir": "(آیت 132تا134) {وَ اتَّقُوا الَّذِيْۤ اَمَدَّكُمْ بِمَا تَعْلَمُوْنَ …:} نصیحت کرتے ہوئے ہود علیہ السلام نے انھیں اللہ تعالیٰ کی نعمتیں یاد دلا کر تیسری بار پھر اس سے ڈرایا۔ پہلی آیت میں مجمل طور پر نعمتیں ذکر فرمائیں، پھر مفصل طریقے سے بیان کیں، یعنی سوچو جس مالک نے تمھیں اتنی نعمتیں عطا فرمائیں وہ انھیں چھین بھی سکتا ہے۔"
    },
    {
      "ayah": 134,
      "tafsir": "(آیت 132تا134) {وَ اتَّقُوا الَّذِيْۤ اَمَدَّكُمْ بِمَا تَعْلَمُوْنَ …:} نصیحت کرتے ہوئے ہود علیہ السلام نے انھیں اللہ تعالیٰ کی نعمتیں یاد دلا کر تیسری بار پھر اس سے ڈرایا۔ پہلی آیت میں مجمل طور پر نعمتیں ذکر فرمائیں، پھر مفصل طریقے سے بیان کیں، یعنی سوچو جس مالک نے تمھیں اتنی نعمتیں عطا فرمائیں وہ انھیں چھین بھی سکتا ہے۔"
    },
    {
      "ayah": 135,
      "tafsir": "(آیت 135) { اِنِّيْۤ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيْمٍ:} نصیحت کی ابتدا ڈرانے سے کی تھی، اب اسے ختم بھی اسی پر کیا، کیونکہ خوف ہی انسان کو غلط راستے سے پلٹنے پر آمادہ کر سکتا ہے۔ یعنی اگر تم ایمان نہ لائے تو میں تم پر ایک بہت بڑے دن کے عذاب سے ڈرتا ہوں۔ ’’بہت بڑے عذاب سے‘‘ کہنے کے بجائے فرمایا ’’بہت بڑے دن کے عذاب سے‘‘ مطلب یہ ہے کہ جب وہ دن ہی بہت بڑا ہے تو اس کا عذاب کتنا بڑا ہو گا۔"
    },
    {
      "ayah": 136,
      "tafsir": "(آیت 136) {قَالُوْا سَوَآءٌ عَلَيْنَاۤ اَوَ عَظْتَ …:} مفردات راغب میں ہے ’’وعظ‘‘ ایسا ڈانٹنا ہے جس کے ساتھ خوف دلانا بھی ہو۔ خلیل نے فرمایا : ’’اس کا معنی ہے ایسے اچھے طریقے سے نصیحت کرنا جس سے دل نرم ہو جائیں۔‘‘ یہ ہود علیہ السلام کی قوم کا جواب ہے کہ تم نصیحت کرو یا نہ کرو، ہم تمھاری بات کسی طرح ماننے والے نہیں۔ ان الفاظ سے ان کا ہود علیہ السلام کے ساتھ بے پروائی اور تحقیر کا سلوک نمایاں ہو رہا ہے۔ سورۂ ہود (۵۳) میں ان کے جواب کے مزید الفاظ ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 137,
      "tafsir": "(آیت 138،137) { اِنْ هٰذَاۤ اِلَّا خُلُقُ الْاَوَّلِيْنَ …:} یعنی یہ بت پرستی، یادگاریں اور عالی شان عمارتیں بنانا اور اپنے مخالفین کے ساتھ ایسا سلوک کرنا کوئی ہمارا شیوہ ہی نہیں، یہی کچھ ہمارے پہلے باپ دادا کرتے آئے ہیں۔ ان کا دین بھی یہی تھا اور تمدن بھی یہی، نہ ان پر کوئی عذاب آیا نہ ہم پر آئے گا۔ آیت کا ایک مطلب یہ بھی ہو سکتا ہے کہ نصیحت کی یہ باتیں جو تم ہم سے کر رہے ہو کوئی نئی نہیں ہیں، پہلے بھی ایسے خبطی گزرے ہیں جو اس طرح کی باتیں کرتے رہے ہیں۔ ہم پر ان کا کچھ اثر نہیں، نہ ہمیں کوئی عذاب ہو گا۔"
    },
    {
      "ayah": 138,
      "tafsir": "(آیت 138،137) { اِنْ هٰذَاۤ اِلَّا خُلُقُ الْاَوَّلِيْنَ …:} یعنی یہ بت پرستی، یادگاریں اور عالی شان عمارتیں بنانا اور اپنے مخالفین کے ساتھ ایسا سلوک کرنا کوئی ہمارا شیوہ ہی نہیں، یہی کچھ ہمارے پہلے باپ دادا کرتے آئے ہیں۔ ان کا دین بھی یہی تھا اور تمدن بھی یہی، نہ ان پر کوئی عذاب آیا نہ ہم پر آئے گا۔ آیت کا ایک مطلب یہ بھی ہو سکتا ہے کہ نصیحت کی یہ باتیں جو تم ہم سے کر رہے ہو کوئی نئی نہیں ہیں، پہلے بھی ایسے خبطی گزرے ہیں جو اس طرح کی باتیں کرتے رہے ہیں۔ ہم پر ان کا کچھ اثر نہیں، نہ ہمیں کوئی عذاب ہو گا۔"
    },
    {
      "ayah": 139,
      "tafsir": "(آیت 139) ➊ {فَكَذَّبُوْهُ فَاَهْلَكْنٰهُمْ:} اللہ تعالیٰ نے بہت سی قوموں کو پانی کے ذریعے سے عذاب دیا اور جن لوگوں کو اپنی قوت و طاقت کا بہت زعم تھا، اللہ تعالیٰ نے انھیں ہوا کے ذریعے سے عذاب دیا جو پانی سے کہیں بڑھ کر قوت و طاقت رکھتی ہے، یہ عذاب آندھی کی صورت میں تھا جو سات راتیں اور آٹھ دن مسلسل ان پر چلی اور اس نے ان کی ہر چیز کو تباہ کر ڈالا۔ دیکھیے سورۂ حٰم السجدہ (۱۶)، احقاف (۲۴، ۲۵) اور حاقہ (۶، ۷)۔ ¤ ➋ { اِنَّ فِيْ ذٰلِكَ لَاٰيَةً …:} بے شک ان لوگوں کے قصے میں مشرکین مکہ کے لیے ایک عظیم درس عبرت ہے، مگر نہ ان کے اکثر لوگ ایمان لائے، نہ ان کے اکثر ایمان لانے والے ہیں۔"
    },
    {
      "ayah": 140,
      "tafsir": "(آیت 140) {وَ اِنَّ رَبَّكَ لَهُوَ الْعَزِيْزُ الرَّحِيْمُ :} ظالموں پر عذاب اس کی عزت اور غلبے کا اظہار ہے اور ایمان والوں کی نجات اس کی رحمت کا اظہار ہے۔"
    },
    {
      "ayah": 141,
      "tafsir": "(آیت 141تا145) ➊ {كَذَّبَتْ ثَمُوْدُ الْمُرْسَلِيْنَ …:} ثمود اور صالح علیھما السلام کا قصہ اس  سے پہلے سورۂ اعراف (۷۳ تا ۷۹)، ہود (۶۱ تا ۶۸)، حجر (۸۰ تا ۸۴) اور بنی اسرائیل (۵۹) میں گزر چکا ہے۔ مزید دیکھیے سورۂ نمل (۴۵ تا ۵۳)، ذاریات (۴۳ تا ۴۵)، قمر (۲۳ تا ۳۱)، فجر (۹) اور شمس (۱۱)۔ ¤ ➋ { اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌ:} صالح علیہ السلام کی قوم بھی ان کی امانت و دیانت اور غیر معمولی قابلیت کو مانتی تھی۔ (دیکھیے ہود : ۶۲) قوم کا انھیں {’’ اِنَّمَا اَنْتَ مِنَ الْمُسَحَّرِيْنَ ‘‘} کہنے سے بھی ثابت ہوتا ہے کہ نبوت کے اعلان سے پہلے وہ ان کے نزدیک نہایت سمجھ دار اور عقل مند تھے اور ان کی حالت کی تبدیلی ان کے خیال سے جادو کا نتیجہ تھی۔"
    },
    {
      "ayah": 142,
      "tafsir": "(آیت 141تا145) ➊ {كَذَّبَتْ ثَمُوْدُ الْمُرْسَلِيْنَ …:} ثمود اور صالح علیھما السلام کا قصہ اس  سے پہلے سورۂ اعراف (۷۳ تا ۷۹)، ہود (۶۱ تا ۶۸)، حجر (۸۰ تا ۸۴) اور بنی اسرائیل (۵۹) میں گزر چکا ہے۔ مزید دیکھیے سورۂ نمل (۴۵ تا ۵۳)، ذاریات (۴۳ تا ۴۵)، قمر (۲۳ تا ۳۱)، فجر (۹) اور شمس (۱۱)۔ ¤ ➋ { اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌ:} صالح علیہ السلام کی قوم بھی ان کی امانت و دیانت اور غیر معمولی قابلیت کو مانتی تھی۔ (دیکھیے ہود : ۶۲) قوم کا انھیں {’’ اِنَّمَا اَنْتَ مِنَ الْمُسَحَّرِيْنَ ‘‘} کہنے سے بھی ثابت ہوتا ہے کہ نبوت کے اعلان سے پہلے وہ ان کے نزدیک نہایت سمجھ دار اور عقل مند تھے اور ان کی حالت کی تبدیلی ان کے خیال سے جادو کا نتیجہ تھی۔"
    },
    {
      "ayah": 143,
      "tafsir": "(آیت 141تا145) ➊ {كَذَّبَتْ ثَمُوْدُ الْمُرْسَلِيْنَ …:} ثمود اور صالح علیھما السلام کا قصہ اس  سے پہلے سورۂ اعراف (۷۳ تا ۷۹)، ہود (۶۱ تا ۶۸)، حجر (۸۰ تا ۸۴) اور بنی اسرائیل (۵۹) میں گزر چکا ہے۔ مزید دیکھیے سورۂ نمل (۴۵ تا ۵۳)، ذاریات (۴۳ تا ۴۵)، قمر (۲۳ تا ۳۱)، فجر (۹) اور شمس (۱۱)۔ ¤ ➋ { اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌ:} صالح علیہ السلام کی قوم بھی ان کی امانت و دیانت اور غیر معمولی قابلیت کو مانتی تھی۔ (دیکھیے ہود : ۶۲) قوم کا انھیں {’’ اِنَّمَا اَنْتَ مِنَ الْمُسَحَّرِيْنَ ‘‘} کہنے سے بھی ثابت ہوتا ہے کہ نبوت کے اعلان سے پہلے وہ ان کے نزدیک نہایت سمجھ دار اور عقل مند تھے اور ان کی حالت کی تبدیلی ان کے خیال سے جادو کا نتیجہ تھی۔"
    },
    {
      "ayah": 144,
      "tafsir": "(آیت 141تا145) ➊ {كَذَّبَتْ ثَمُوْدُ الْمُرْسَلِيْنَ …:} ثمود اور صالح علیھما السلام کا قصہ اس  سے پہلے سورۂ اعراف (۷۳ تا ۷۹)، ہود (۶۱ تا ۶۸)، حجر (۸۰ تا ۸۴) اور بنی اسرائیل (۵۹) میں گزر چکا ہے۔ مزید دیکھیے سورۂ نمل (۴۵ تا ۵۳)، ذاریات (۴۳ تا ۴۵)، قمر (۲۳ تا ۳۱)، فجر (۹) اور شمس (۱۱)۔ ¤ ➋ { اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌ:} صالح علیہ السلام کی قوم بھی ان کی امانت و دیانت اور غیر معمولی قابلیت کو مانتی تھی۔ (دیکھیے ہود : ۶۲) قوم کا انھیں {’’ اِنَّمَا اَنْتَ مِنَ الْمُسَحَّرِيْنَ ‘‘} کہنے سے بھی ثابت ہوتا ہے کہ نبوت کے اعلان سے پہلے وہ ان کے نزدیک نہایت سمجھ دار اور عقل مند تھے اور ان کی حالت کی تبدیلی ان کے خیال سے جادو کا نتیجہ تھی۔"
    },
    {
      "ayah": 145,
      "tafsir": "(آیت 141تا145) ➊ {كَذَّبَتْ ثَمُوْدُ الْمُرْسَلِيْنَ …:} ثمود اور صالح علیھما السلام کا قصہ اس  سے پہلے سورۂ اعراف (۷۳ تا ۷۹)، ہود (۶۱ تا ۶۸)، حجر (۸۰ تا ۸۴) اور بنی اسرائیل (۵۹) میں گزر چکا ہے۔ مزید دیکھیے سورۂ نمل (۴۵ تا ۵۳)، ذاریات (۴۳ تا ۴۵)، قمر (۲۳ تا ۳۱)، فجر (۹) اور شمس (۱۱)۔ ¤ ➋ { اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌ:} صالح علیہ السلام کی قوم بھی ان کی امانت و دیانت اور غیر معمولی قابلیت کو مانتی تھی۔ (دیکھیے ہود : ۶۲) قوم کا انھیں {’’ اِنَّمَا اَنْتَ مِنَ الْمُسَحَّرِيْنَ ‘‘} کہنے سے بھی ثابت ہوتا ہے کہ نبوت کے اعلان سے پہلے وہ ان کے نزدیک نہایت سمجھ دار اور عقل مند تھے اور ان کی حالت کی تبدیلی ان کے خیال سے جادو کا نتیجہ تھی۔"
    },
    {
      "ayah": 146,
      "tafsir": "(آیت 146تا150) ➊ { اَتُتْرَكُوْنَ فِيْ مَا هٰهُنَاۤ اٰمِنِيْنَ …:} قومِ عاد کی طرح یہ لوگ بھی اللہ کی عبادت سے کنارہ کش ہو چکے تھے، بتوں کے پجاری اور قیامت کے منکر تھے، جس کے نتیجے میں ان کی ساری تگ و دو دنیا کی آسائشوں کے حصول اور عیش پرستی تک محدود تھی، آخرت کی فکر اور اللہ تعالیٰ کے سامنے جواب دہی کے احساس سے یکسر عاری تھے، ان کے بدترین اور مفسد لوگ ان کے سردار اور راہ نما بنے ہوئے تھے۔ اللہ تعالیٰ نے ان کی طرف صالح علیہ السلام کو بھیجا، جنھوں نے اوپر والی آیات کے مطابق انھیں اللہ سے ڈرنے اور اپنے رسول کی اطاعت کرنے کی تلقین فرمائی اور بتایا کہ وہ ان سے کسی بھی قسم کی مالی منفعت کے طلب گار نہیں ہیں۔ اس کے بعد انھیں اللہ تعالیٰ کی نعمتیں یاد دلا کر اور اس کے عذاب سے ڈرا کر نصیحت فرمائی۔ قومِ ثمود کی آبادی حجر کے علاقہ میں تھی، جو مدینہ منورہ اور تبوک کے درمیان واقع ہے اور آج کل اسے ’’مدائن صالح ‘‘ کہا جاتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم تبوک کو جاتے ہوئے یہاں سے گزرے تھے، اس کی تفصیل سورۂ اعراف (۷۳) میں دیکھیے۔ یعنی یہاں دنیا کے اندر اپنے علاقے میں جو تم امن سے رہ رہے ہو، کسی دشمن کا خوف نہیں، ضرورت کی ہر چیز تمھیں میسر ہے اور راحت و آرام کے تمام اسباب بھی، تو کیا تمھیں ان باغوں چشموں، کھیتوں کے نرم و نازک خوشوں والے درختوں اور پہاڑوں کو تراش کر نہایت مہارت کے ساتھ بنائی پائیدار اور خوبصورت عمارتوں میں ہمیشہ رہنے دیا جائے گا؟ جب یہ طے شدہ ہے کہ ایسا نہیں ہو گا، بلکہ ہر حال میں تمھیں مالک کے سامنے پیش ہو کر جواب دہ ہونا ہے، تو اللہ سے ڈرو اور اس سوال کا جواب سوچ لو کہ اس کا دیا کھاتے ہو اور دوسرے کے گن گاتے ہو اور میری اطاعت کرو، کیونکہ اس نے مجھے تمھاری ہدایت کے لیے بھیجا ہے۔ ¤ ➋ { وَ تَنْحِتُوْنَ مِنَ الْجِبَالِ …:} عاد کے تمدن کی خصوصیت یہ تھی کہ وہ اونچے ستونوں والی عمارتیں بناتے تھے، جب کہ ثمود کے تمدن کی سب سے نمایاں خصوصیت، جس کی بنا پر وہ مشہور تھے، یہ تھی کہ وہ پہاڑوں کو تراش تراش کر ان کے اندر عمارتیں بناتے تھے۔ چنانچہ سورۂ فجر (۷) میں عاد کو {’’ ذَاتِ الْعِمَادِ‘‘} (ستونوں والے) کہا گیا ہے اور ثمود کے متعلق فرمایا : «{الَّذِيْنَ جَابُوا الصَّخْرَ بِالْوَادِ}» [ الفجر : ۹ ] ’’جنھوں نے وادی میں چٹانوں کو تراشا۔‘‘ اس کے علاوہ وہ اپنے میدانی علاقوں میں بھی بڑے بڑے محل تعمیر کرتے تھے، فرمایا : «{ تَتَّخِذُوْنَ مِنْ سُهُوْلِهَا قُصُوْرًا }» [ الأعراف : ۷۴ ] ’’تم اس کے میدانوں میں محل بناتے ہو۔‘‘ ان تعمیرات سے ان کی غرض و غایت اپنی شان و شوکت، مہارت اور کمال فن کی نمائش تھی، نہ کہ کوئی حقیقی ضرورت۔ بگڑے ہوئے معاشروں کا یہی حال ہوتا ہے کہ ایک طرف لوگوں کو سر چھپانے کے لیے جگہ نہیں ملتی تو دوسری طرف امراء اور اہلِ ثروت کمزوروں کی مدد کے بجائے اپنی ضرورت سے زیادہ عمارتیں بنانے کے بعد بلاضرورت نمائشی یادگاریں تعمیر کرنے لگتے ہیں۔ ¤ تفہیم القرآن میں ہے : ’’ثمود کی ان عمارات میں سے کچھ اب بھی باقی ہیں، جنھیں ۱۹۵۹ء کے دسمبر میں میں نے خود دیکھا ہے۔ یہ جگہ مدینہ اور تبوک کے درمیان حجاز کے مشہور مقام ’’العلاء‘‘ (جسے عہد نبوی میں وادی القریٰ کہا جاتا تھا) سے چند میل کے فاصلے پر بجانب شمال واقع ہے۔ آج بھی اس جگہ کو مقامی باشندے الحجر اور مدائن صالح کے ناموں ہی سے یاد کرتے ہیں۔ اس علاقے میں ’’العلاء‘‘ تو اب بھی نہایت سر سبز و شاداب وادی ہے، جس میں کثرت سے چشمے اور باغات ہیں، مگر ’’الحجر‘‘ کے گرد و پیش بڑی نحوست پائی جاتی ہے، آبادی برائے نام ہے، روئیدگی بہت کم ہے، چند کنویں ہیں، انھی میں سے ایک کنویں کے متعلق مقامی آبادی میں یہ روایت چلی آ رہی ہے کہ صالح علیہ السلام کی اونٹنی اسی سے پانی پیتی تھی۔ اب وہ ترکی عہد کی ایک ویران چھوٹی سی چوکی کے اندر پایا جاتا ہے اور بالکل خشک پڑا ہے۔ اس علاقے میں جب ہم داخل ہوئے تو ’’العلاء‘‘ کے قریب پہنچتے ہی ہر طرف ایسے پہاڑ نظر آئے جو بالکل کھیل کھیل ہو گئے ہیں، صاف محسوس ہوتا تھا کہ کسی سخت ہولناک زلزلے نے انھیں سطح زمین سے چوٹی تک جھنجھوڑ کر قاش قاش کر رکھا ہے۔ اسی طرح کے پہاڑ ہمیں مشرق کی طرف ’’العلاء‘‘ سے خیبر جاتے ہوئے تقریباً پچاس (۵۰) میل تک اور شمال کی طرف ریاست اردن کے حدود میں ۳۰، ۴۰ میل کے اندر ملتے چلے گئے ہیں۔ اس کے معنی یہ ہیں کہ تین چار سو میل لمبا اور سو میل چوڑا ایک علاقہ تھا جسے ایک زلزلہ عظیم نے ہلا کر رکھ دیا تھا۔‘‘"
    },
    {
      "ayah": 147,
      "tafsir": "(آیت 146تا150) ➊ { اَتُتْرَكُوْنَ فِيْ مَا هٰهُنَاۤ اٰمِنِيْنَ …:} قومِ عاد کی طرح یہ لوگ بھی اللہ کی عبادت سے کنارہ کش ہو چکے تھے، بتوں کے پجاری اور قیامت کے منکر تھے، جس کے نتیجے میں ان کی ساری تگ و دو دنیا کی آسائشوں کے حصول اور عیش پرستی تک محدود تھی، آخرت کی فکر اور اللہ تعالیٰ کے سامنے جواب دہی کے احساس سے یکسر عاری تھے، ان کے بدترین اور مفسد لوگ ان کے سردار اور راہ نما بنے ہوئے تھے۔ اللہ تعالیٰ نے ان کی طرف صالح علیہ السلام کو بھیجا، جنھوں نے اوپر والی آیات کے مطابق انھیں اللہ سے ڈرنے اور اپنے رسول کی اطاعت کرنے کی تلقین فرمائی اور بتایا کہ وہ ان سے کسی بھی قسم کی مالی منفعت کے طلب گار نہیں ہیں۔ اس کے بعد انھیں اللہ تعالیٰ کی نعمتیں یاد دلا کر اور اس کے عذاب سے ڈرا کر نصیحت فرمائی۔ قومِ ثمود کی آبادی حجر کے علاقہ میں تھی، جو مدینہ منورہ اور تبوک کے درمیان واقع ہے اور آج کل اسے ’’مدائن صالح ‘‘ کہا جاتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم تبوک کو جاتے ہوئے یہاں سے گزرے تھے، اس کی تفصیل سورۂ اعراف (۷۳) میں دیکھیے۔ یعنی یہاں دنیا کے اندر اپنے علاقے میں جو تم امن سے رہ رہے ہو، کسی دشمن کا خوف نہیں، ضرورت کی ہر چیز تمھیں میسر ہے اور راحت و آرام کے تمام اسباب بھی، تو کیا تمھیں ان باغوں چشموں، کھیتوں کے نرم و نازک خوشوں والے درختوں اور پہاڑوں کو تراش کر نہایت مہارت کے ساتھ بنائی پائیدار اور خوبصورت عمارتوں میں ہمیشہ رہنے دیا جائے گا؟ جب یہ طے شدہ ہے کہ ایسا نہیں ہو گا، بلکہ ہر حال میں تمھیں مالک کے سامنے پیش ہو کر جواب دہ ہونا ہے، تو اللہ سے ڈرو اور اس سوال کا جواب سوچ لو کہ اس کا دیا کھاتے ہو اور دوسرے کے گن گاتے ہو اور میری اطاعت کرو، کیونکہ اس نے مجھے تمھاری ہدایت کے لیے بھیجا ہے۔ ¤ ➋ { وَ تَنْحِتُوْنَ مِنَ الْجِبَالِ …:} عاد کے تمدن کی خصوصیت یہ تھی کہ وہ اونچے ستونوں والی عمارتیں بناتے تھے، جب کہ ثمود کے تمدن کی سب سے نمایاں خصوصیت، جس کی بنا پر وہ مشہور تھے، یہ تھی کہ وہ پہاڑوں کو تراش تراش کر ان کے اندر عمارتیں بناتے تھے۔ چنانچہ سورۂ فجر (۷) میں عاد کو {’’ ذَاتِ الْعِمَادِ‘‘} (ستونوں والے) کہا گیا ہے اور ثمود کے متعلق فرمایا : «{الَّذِيْنَ جَابُوا الصَّخْرَ بِالْوَادِ}» [ الفجر : ۹ ] ’’جنھوں نے وادی میں چٹانوں کو تراشا۔‘‘ اس کے علاوہ وہ اپنے میدانی علاقوں میں بھی بڑے بڑے محل تعمیر کرتے تھے، فرمایا : «{ تَتَّخِذُوْنَ مِنْ سُهُوْلِهَا قُصُوْرًا }» [ الأعراف : ۷۴ ] ’’تم اس کے میدانوں میں محل بناتے ہو۔‘‘ ان تعمیرات سے ان کی غرض و غایت اپنی شان و شوکت، مہارت اور کمال فن کی نمائش تھی، نہ کہ کوئی حقیقی ضرورت۔ بگڑے ہوئے معاشروں کا یہی حال ہوتا ہے کہ ایک طرف لوگوں کو سر چھپانے کے لیے جگہ نہیں ملتی تو دوسری طرف امراء اور اہلِ ثروت کمزوروں کی مدد کے بجائے اپنی ضرورت سے زیادہ عمارتیں بنانے کے بعد بلاضرورت نمائشی یادگاریں تعمیر کرنے لگتے ہیں۔ ¤ تفہیم القرآن میں ہے : ’’ثمود کی ان عمارات میں سے کچھ اب بھی باقی ہیں، جنھیں ۱۹۵۹ء کے دسمبر میں میں نے خود دیکھا ہے۔ یہ جگہ مدینہ اور تبوک کے درمیان حجاز کے مشہور مقام ’’العلاء‘‘ (جسے عہد نبوی میں وادی القریٰ کہا جاتا تھا) سے چند میل کے فاصلے پر بجانب شمال واقع ہے۔ آج بھی اس جگہ کو مقامی باشندے الحجر اور مدائن صالح کے ناموں ہی سے یاد کرتے ہیں۔ اس علاقے میں ’’العلاء‘‘ تو اب بھی نہایت سر سبز و شاداب وادی ہے، جس میں کثرت سے چشمے اور باغات ہیں، مگر ’’الحجر‘‘ کے گرد و پیش بڑی نحوست پائی جاتی ہے، آبادی برائے نام ہے، روئیدگی بہت کم ہے، چند کنویں ہیں، انھی میں سے ایک کنویں کے متعلق مقامی آبادی میں یہ روایت چلی آ رہی ہے کہ صالح علیہ السلام کی اونٹنی اسی سے پانی پیتی تھی۔ اب وہ ترکی عہد کی ایک ویران چھوٹی سی چوکی کے اندر پایا جاتا ہے اور بالکل خشک پڑا ہے۔ اس علاقے میں جب ہم داخل ہوئے تو ’’العلاء‘‘ کے قریب پہنچتے ہی ہر طرف ایسے پہاڑ نظر آئے جو بالکل کھیل کھیل ہو گئے ہیں، صاف محسوس ہوتا تھا کہ کسی سخت ہولناک زلزلے نے انھیں سطح زمین سے چوٹی تک جھنجھوڑ کر قاش قاش کر رکھا ہے۔ اسی طرح کے پہاڑ ہمیں مشرق کی طرف ’’العلاء‘‘ سے خیبر جاتے ہوئے تقریباً پچاس (۵۰) میل تک اور شمال کی طرف ریاست اردن کے حدود میں ۳۰، ۴۰ میل کے اندر ملتے چلے گئے ہیں۔ اس کے معنی یہ ہیں کہ تین چار سو میل لمبا اور سو میل چوڑا ایک علاقہ تھا جسے ایک زلزلہ عظیم نے ہلا کر رکھ دیا تھا۔‘‘"
    },
    {
      "ayah": 148,
      "tafsir": "(آیت 146تا150) ➊ { اَتُتْرَكُوْنَ فِيْ مَا هٰهُنَاۤ اٰمِنِيْنَ …:} قومِ عاد کی طرح یہ لوگ بھی اللہ کی عبادت سے کنارہ کش ہو چکے تھے، بتوں کے پجاری اور قیامت کے منکر تھے، جس کے نتیجے میں ان کی ساری تگ و دو دنیا کی آسائشوں کے حصول اور عیش پرستی تک محدود تھی، آخرت کی فکر اور اللہ تعالیٰ کے سامنے جواب دہی کے احساس سے یکسر عاری تھے، ان کے بدترین اور مفسد لوگ ان کے سردار اور راہ نما بنے ہوئے تھے۔ اللہ تعالیٰ نے ان کی طرف صالح علیہ السلام کو بھیجا، جنھوں نے اوپر والی آیات کے مطابق انھیں اللہ سے ڈرنے اور اپنے رسول کی اطاعت کرنے کی تلقین فرمائی اور بتایا کہ وہ ان سے کسی بھی قسم کی مالی منفعت کے طلب گار نہیں ہیں۔ اس کے بعد انھیں اللہ تعالیٰ کی نعمتیں یاد دلا کر اور اس کے عذاب سے ڈرا کر نصیحت فرمائی۔ قومِ ثمود کی آبادی حجر کے علاقہ میں تھی، جو مدینہ منورہ اور تبوک کے درمیان واقع ہے اور آج کل اسے ’’مدائن صالح ‘‘ کہا جاتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم تبوک کو جاتے ہوئے یہاں سے گزرے تھے، اس کی تفصیل سورۂ اعراف (۷۳) میں دیکھیے۔ یعنی یہاں دنیا کے اندر اپنے علاقے میں جو تم امن سے رہ رہے ہو، کسی دشمن کا خوف نہیں، ضرورت کی ہر چیز تمھیں میسر ہے اور راحت و آرام کے تمام اسباب بھی، تو کیا تمھیں ان باغوں چشموں، کھیتوں کے نرم و نازک خوشوں والے درختوں اور پہاڑوں کو تراش کر نہایت مہارت کے ساتھ بنائی پائیدار اور خوبصورت عمارتوں میں ہمیشہ رہنے دیا جائے گا؟ جب یہ طے شدہ ہے کہ ایسا نہیں ہو گا، بلکہ ہر حال میں تمھیں مالک کے سامنے پیش ہو کر جواب دہ ہونا ہے، تو اللہ سے ڈرو اور اس سوال کا جواب سوچ لو کہ اس کا دیا کھاتے ہو اور دوسرے کے گن گاتے ہو اور میری اطاعت کرو، کیونکہ اس نے مجھے تمھاری ہدایت کے لیے بھیجا ہے۔ ¤ ➋ { وَ تَنْحِتُوْنَ مِنَ الْجِبَالِ …:} عاد کے تمدن کی خصوصیت یہ تھی کہ وہ اونچے ستونوں والی عمارتیں بناتے تھے، جب کہ ثمود کے تمدن کی سب سے نمایاں خصوصیت، جس کی بنا پر وہ مشہور تھے، یہ تھی کہ وہ پہاڑوں کو تراش تراش کر ان کے اندر عمارتیں بناتے تھے۔ چنانچہ سورۂ فجر (۷) میں عاد کو {’’ ذَاتِ الْعِمَادِ‘‘} (ستونوں والے) کہا گیا ہے اور ثمود کے متعلق فرمایا : «{الَّذِيْنَ جَابُوا الصَّخْرَ بِالْوَادِ}» [ الفجر : ۹ ] ’’جنھوں نے وادی میں چٹانوں کو تراشا۔‘‘ اس کے علاوہ وہ اپنے میدانی علاقوں میں بھی بڑے بڑے محل تعمیر کرتے تھے، فرمایا : «{ تَتَّخِذُوْنَ مِنْ سُهُوْلِهَا قُصُوْرًا }» [ الأعراف : ۷۴ ] ’’تم اس کے میدانوں میں محل بناتے ہو۔‘‘ ان تعمیرات سے ان کی غرض و غایت اپنی شان و شوکت، مہارت اور کمال فن کی نمائش تھی، نہ کہ کوئی حقیقی ضرورت۔ بگڑے ہوئے معاشروں کا یہی حال ہوتا ہے کہ ایک طرف لوگوں کو سر چھپانے کے لیے جگہ نہیں ملتی تو دوسری طرف امراء اور اہلِ ثروت کمزوروں کی مدد کے بجائے اپنی ضرورت سے زیادہ عمارتیں بنانے کے بعد بلاضرورت نمائشی یادگاریں تعمیر کرنے لگتے ہیں۔ ¤ تفہیم القرآن میں ہے : ’’ثمود کی ان عمارات میں سے کچھ اب بھی باقی ہیں، جنھیں ۱۹۵۹ء کے دسمبر میں میں نے خود دیکھا ہے۔ یہ جگہ مدینہ اور تبوک کے درمیان حجاز کے مشہور مقام ’’العلاء‘‘ (جسے عہد نبوی میں وادی القریٰ کہا جاتا تھا) سے چند میل کے فاصلے پر بجانب شمال واقع ہے۔ آج بھی اس جگہ کو مقامی باشندے الحجر اور مدائن صالح کے ناموں ہی سے یاد کرتے ہیں۔ اس علاقے میں ’’العلاء‘‘ تو اب بھی نہایت سر سبز و شاداب وادی ہے، جس میں کثرت سے چشمے اور باغات ہیں، مگر ’’الحجر‘‘ کے گرد و پیش بڑی نحوست پائی جاتی ہے، آبادی برائے نام ہے، روئیدگی بہت کم ہے، چند کنویں ہیں، انھی میں سے ایک کنویں کے متعلق مقامی آبادی میں یہ روایت چلی آ رہی ہے کہ صالح علیہ السلام کی اونٹنی اسی سے پانی پیتی تھی۔ اب وہ ترکی عہد کی ایک ویران چھوٹی سی چوکی کے اندر پایا جاتا ہے اور بالکل خشک پڑا ہے۔ اس علاقے میں جب ہم داخل ہوئے تو ’’العلاء‘‘ کے قریب پہنچتے ہی ہر طرف ایسے پہاڑ نظر آئے جو بالکل کھیل کھیل ہو گئے ہیں، صاف محسوس ہوتا تھا کہ کسی سخت ہولناک زلزلے نے انھیں سطح زمین سے چوٹی تک جھنجھوڑ کر قاش قاش کر رکھا ہے۔ اسی طرح کے پہاڑ ہمیں مشرق کی طرف ’’العلاء‘‘ سے خیبر جاتے ہوئے تقریباً پچاس (۵۰) میل تک اور شمال کی طرف ریاست اردن کے حدود میں ۳۰، ۴۰ میل کے اندر ملتے چلے گئے ہیں۔ اس کے معنی یہ ہیں کہ تین چار سو میل لمبا اور سو میل چوڑا ایک علاقہ تھا جسے ایک زلزلہ عظیم نے ہلا کر رکھ دیا تھا۔‘‘"
    },
    {
      "ayah": 149,
      "tafsir": "(آیت 146تا150) ➊ { اَتُتْرَكُوْنَ فِيْ مَا هٰهُنَاۤ اٰمِنِيْنَ …:} قومِ عاد کی طرح یہ لوگ بھی اللہ کی عبادت سے کنارہ کش ہو چکے تھے، بتوں کے پجاری اور قیامت کے منکر تھے، جس کے نتیجے میں ان کی ساری تگ و دو دنیا کی آسائشوں کے حصول اور عیش پرستی تک محدود تھی، آخرت کی فکر اور اللہ تعالیٰ کے سامنے جواب دہی کے احساس سے یکسر عاری تھے، ان کے بدترین اور مفسد لوگ ان کے سردار اور راہ نما بنے ہوئے تھے۔ اللہ تعالیٰ نے ان کی طرف صالح علیہ السلام کو بھیجا، جنھوں نے اوپر والی آیات کے مطابق انھیں اللہ سے ڈرنے اور اپنے رسول کی اطاعت کرنے کی تلقین فرمائی اور بتایا کہ وہ ان سے کسی بھی قسم کی مالی منفعت کے طلب گار نہیں ہیں۔ اس کے بعد انھیں اللہ تعالیٰ کی نعمتیں یاد دلا کر اور اس کے عذاب سے ڈرا کر نصیحت فرمائی۔ قومِ ثمود کی آبادی حجر کے علاقہ میں تھی، جو مدینہ منورہ اور تبوک کے درمیان واقع ہے اور آج کل اسے ’’مدائن صالح ‘‘ کہا جاتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم تبوک کو جاتے ہوئے یہاں سے گزرے تھے، اس کی تفصیل سورۂ اعراف (۷۳) میں دیکھیے۔ یعنی یہاں دنیا کے اندر اپنے علاقے میں جو تم امن سے رہ رہے ہو، کسی دشمن کا خوف نہیں، ضرورت کی ہر چیز تمھیں میسر ہے اور راحت و آرام کے تمام اسباب بھی، تو کیا تمھیں ان باغوں چشموں، کھیتوں کے نرم و نازک خوشوں والے درختوں اور پہاڑوں کو تراش کر نہایت مہارت کے ساتھ بنائی پائیدار اور خوبصورت عمارتوں میں ہمیشہ رہنے دیا جائے گا؟ جب یہ طے شدہ ہے کہ ایسا نہیں ہو گا، بلکہ ہر حال میں تمھیں مالک کے سامنے پیش ہو کر جواب دہ ہونا ہے، تو اللہ سے ڈرو اور اس سوال کا جواب سوچ لو کہ اس کا دیا کھاتے ہو اور دوسرے کے گن گاتے ہو اور میری اطاعت کرو، کیونکہ اس نے مجھے تمھاری ہدایت کے لیے بھیجا ہے۔ ¤ ➋ { وَ تَنْحِتُوْنَ مِنَ الْجِبَالِ …:} عاد کے تمدن کی خصوصیت یہ تھی کہ وہ اونچے ستونوں والی عمارتیں بناتے تھے، جب کہ ثمود کے تمدن کی سب سے نمایاں خصوصیت، جس کی بنا پر وہ مشہور تھے، یہ تھی کہ وہ پہاڑوں کو تراش تراش کر ان کے اندر عمارتیں بناتے تھے۔ چنانچہ سورۂ فجر (۷) میں عاد کو {’’ ذَاتِ الْعِمَادِ‘‘} (ستونوں والے) کہا گیا ہے اور ثمود کے متعلق فرمایا : «{الَّذِيْنَ جَابُوا الصَّخْرَ بِالْوَادِ}» [ الفجر : ۹ ] ’’جنھوں نے وادی میں چٹانوں کو تراشا۔‘‘ اس کے علاوہ وہ اپنے میدانی علاقوں میں بھی بڑے بڑے محل تعمیر کرتے تھے، فرمایا : «{ تَتَّخِذُوْنَ مِنْ سُهُوْلِهَا قُصُوْرًا }» [ الأعراف : ۷۴ ] ’’تم اس کے میدانوں میں محل بناتے ہو۔‘‘ ان تعمیرات سے ان کی غرض و غایت اپنی شان و شوکت، مہارت اور کمال فن کی نمائش تھی، نہ کہ کوئی حقیقی ضرورت۔ بگڑے ہوئے معاشروں کا یہی حال ہوتا ہے کہ ایک طرف لوگوں کو سر چھپانے کے لیے جگہ نہیں ملتی تو دوسری طرف امراء اور اہلِ ثروت کمزوروں کی مدد کے بجائے اپنی ضرورت سے زیادہ عمارتیں بنانے کے بعد بلاضرورت نمائشی یادگاریں تعمیر کرنے لگتے ہیں۔ ¤ تفہیم القرآن میں ہے : ’’ثمود کی ان عمارات میں سے کچھ اب بھی باقی ہیں، جنھیں ۱۹۵۹ء کے دسمبر میں میں نے خود دیکھا ہے۔ یہ جگہ مدینہ اور تبوک کے درمیان حجاز کے مشہور مقام ’’العلاء‘‘ (جسے عہد نبوی میں وادی القریٰ کہا جاتا تھا) سے چند میل کے فاصلے پر بجانب شمال واقع ہے۔ آج بھی اس جگہ کو مقامی باشندے الحجر اور مدائن صالح کے ناموں ہی سے یاد کرتے ہیں۔ اس علاقے میں ’’العلاء‘‘ تو اب بھی نہایت سر سبز و شاداب وادی ہے، جس میں کثرت سے چشمے اور باغات ہیں، مگر ’’الحجر‘‘ کے گرد و پیش بڑی نحوست پائی جاتی ہے، آبادی برائے نام ہے، روئیدگی بہت کم ہے، چند کنویں ہیں، انھی میں سے ایک کنویں کے متعلق مقامی آبادی میں یہ روایت چلی آ رہی ہے کہ صالح علیہ السلام کی اونٹنی اسی سے پانی پیتی تھی۔ اب وہ ترکی عہد کی ایک ویران چھوٹی سی چوکی کے اندر پایا جاتا ہے اور بالکل خشک پڑا ہے۔ اس علاقے میں جب ہم داخل ہوئے تو ’’العلاء‘‘ کے قریب پہنچتے ہی ہر طرف ایسے پہاڑ نظر آئے جو بالکل کھیل کھیل ہو گئے ہیں، صاف محسوس ہوتا تھا کہ کسی سخت ہولناک زلزلے نے انھیں سطح زمین سے چوٹی تک جھنجھوڑ کر قاش قاش کر رکھا ہے۔ اسی طرح کے پہاڑ ہمیں مشرق کی طرف ’’العلاء‘‘ سے خیبر جاتے ہوئے تقریباً پچاس (۵۰) میل تک اور شمال کی طرف ریاست اردن کے حدود میں ۳۰، ۴۰ میل کے اندر ملتے چلے گئے ہیں۔ اس کے معنی یہ ہیں کہ تین چار سو میل لمبا اور سو میل چوڑا ایک علاقہ تھا جسے ایک زلزلہ عظیم نے ہلا کر رکھ دیا تھا۔‘‘"
    },
    {
      "ayah": 150,
      "tafsir": "(آیت 146تا150) ➊ { اَتُتْرَكُوْنَ فِيْ مَا هٰهُنَاۤ اٰمِنِيْنَ …:} قومِ عاد کی طرح یہ لوگ بھی اللہ کی عبادت سے کنارہ کش ہو چکے تھے، بتوں کے پجاری اور قیامت کے منکر تھے، جس کے نتیجے میں ان کی ساری تگ و دو دنیا کی آسائشوں کے حصول اور عیش پرستی تک محدود تھی، آخرت کی فکر اور اللہ تعالیٰ کے سامنے جواب دہی کے احساس سے یکسر عاری تھے، ان کے بدترین اور مفسد لوگ ان کے سردار اور راہ نما بنے ہوئے تھے۔ اللہ تعالیٰ نے ان کی طرف صالح علیہ السلام کو بھیجا، جنھوں نے اوپر والی آیات کے مطابق انھیں اللہ سے ڈرنے اور اپنے رسول کی اطاعت کرنے کی تلقین فرمائی اور بتایا کہ وہ ان سے کسی بھی قسم کی مالی منفعت کے طلب گار نہیں ہیں۔ اس کے بعد انھیں اللہ تعالیٰ کی نعمتیں یاد دلا کر اور اس کے عذاب سے ڈرا کر نصیحت فرمائی۔ قومِ ثمود کی آبادی حجر کے علاقہ میں تھی، جو مدینہ منورہ اور تبوک کے درمیان واقع ہے اور آج کل اسے ’’مدائن صالح ‘‘ کہا جاتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم تبوک کو جاتے ہوئے یہاں سے گزرے تھے، اس کی تفصیل سورۂ اعراف (۷۳) میں دیکھیے۔ یعنی یہاں دنیا کے اندر اپنے علاقے میں جو تم امن سے رہ رہے ہو، کسی دشمن کا خوف نہیں، ضرورت کی ہر چیز تمھیں میسر ہے اور راحت و آرام کے تمام اسباب بھی، تو کیا تمھیں ان باغوں چشموں، کھیتوں کے نرم و نازک خوشوں والے درختوں اور پہاڑوں کو تراش کر نہایت مہارت کے ساتھ بنائی پائیدار اور خوبصورت عمارتوں میں ہمیشہ رہنے دیا جائے گا؟ جب یہ طے شدہ ہے کہ ایسا نہیں ہو گا، بلکہ ہر حال میں تمھیں مالک کے سامنے پیش ہو کر جواب دہ ہونا ہے، تو اللہ سے ڈرو اور اس سوال کا جواب سوچ لو کہ اس کا دیا کھاتے ہو اور دوسرے کے گن گاتے ہو اور میری اطاعت کرو، کیونکہ اس نے مجھے تمھاری ہدایت کے لیے بھیجا ہے۔ ¤ ➋ { وَ تَنْحِتُوْنَ مِنَ الْجِبَالِ …:} عاد کے تمدن کی خصوصیت یہ تھی کہ وہ اونچے ستونوں والی عمارتیں بناتے تھے، جب کہ ثمود کے تمدن کی سب سے نمایاں خصوصیت، جس کی بنا پر وہ مشہور تھے، یہ تھی کہ وہ پہاڑوں کو تراش تراش کر ان کے اندر عمارتیں بناتے تھے۔ چنانچہ سورۂ فجر (۷) میں عاد کو {’’ ذَاتِ الْعِمَادِ‘‘} (ستونوں والے) کہا گیا ہے اور ثمود کے متعلق فرمایا : «{الَّذِيْنَ جَابُوا الصَّخْرَ بِالْوَادِ}» [ الفجر : ۹ ] ’’جنھوں نے وادی میں چٹانوں کو تراشا۔‘‘ اس کے علاوہ وہ اپنے میدانی علاقوں میں بھی بڑے بڑے محل تعمیر کرتے تھے، فرمایا : «{ تَتَّخِذُوْنَ مِنْ سُهُوْلِهَا قُصُوْرًا }» [ الأعراف : ۷۴ ] ’’تم اس کے میدانوں میں محل بناتے ہو۔‘‘ ان تعمیرات سے ان کی غرض و غایت اپنی شان و شوکت، مہارت اور کمال فن کی نمائش تھی، نہ کہ کوئی حقیقی ضرورت۔ بگڑے ہوئے معاشروں کا یہی حال ہوتا ہے کہ ایک طرف لوگوں کو سر چھپانے کے لیے جگہ نہیں ملتی تو دوسری طرف امراء اور اہلِ ثروت کمزوروں کی مدد کے بجائے اپنی ضرورت سے زیادہ عمارتیں بنانے کے بعد بلاضرورت نمائشی یادگاریں تعمیر کرنے لگتے ہیں۔ ¤ تفہیم القرآن میں ہے : ’’ثمود کی ان عمارات میں سے کچھ اب بھی باقی ہیں، جنھیں ۱۹۵۹ء کے دسمبر میں میں نے خود دیکھا ہے۔ یہ جگہ مدینہ اور تبوک کے درمیان حجاز کے مشہور مقام ’’العلاء‘‘ (جسے عہد نبوی میں وادی القریٰ کہا جاتا تھا) سے چند میل کے فاصلے پر بجانب شمال واقع ہے۔ آج بھی اس جگہ کو مقامی باشندے الحجر اور مدائن صالح کے ناموں ہی سے یاد کرتے ہیں۔ اس علاقے میں ’’العلاء‘‘ تو اب بھی نہایت سر سبز و شاداب وادی ہے، جس میں کثرت سے چشمے اور باغات ہیں، مگر ’’الحجر‘‘ کے گرد و پیش بڑی نحوست پائی جاتی ہے، آبادی برائے نام ہے، روئیدگی بہت کم ہے، چند کنویں ہیں، انھی میں سے ایک کنویں کے متعلق مقامی آبادی میں یہ روایت چلی آ رہی ہے کہ صالح علیہ السلام کی اونٹنی اسی سے پانی پیتی تھی۔ اب وہ ترکی عہد کی ایک ویران چھوٹی سی چوکی کے اندر پایا جاتا ہے اور بالکل خشک پڑا ہے۔ اس علاقے میں جب ہم داخل ہوئے تو ’’العلاء‘‘ کے قریب پہنچتے ہی ہر طرف ایسے پہاڑ نظر آئے جو بالکل کھیل کھیل ہو گئے ہیں، صاف محسوس ہوتا تھا کہ کسی سخت ہولناک زلزلے نے انھیں سطح زمین سے چوٹی تک جھنجھوڑ کر قاش قاش کر رکھا ہے۔ اسی طرح کے پہاڑ ہمیں مشرق کی طرف ’’العلاء‘‘ سے خیبر جاتے ہوئے تقریباً پچاس (۵۰) میل تک اور شمال کی طرف ریاست اردن کے حدود میں ۳۰، ۴۰ میل کے اندر ملتے چلے گئے ہیں۔ اس کے معنی یہ ہیں کہ تین چار سو میل لمبا اور سو میل چوڑا ایک علاقہ تھا جسے ایک زلزلہ عظیم نے ہلا کر رکھ دیا تھا۔‘‘"
    },
    {
      "ayah": 151,
      "tafsir": "(آیت 152،151) {وَ لَا تُطِيْعُوْۤا اَمْرَ الْمُسْرِفِيْنَ …:} یعنی ان لوگوں کا کہنا مت مانو جو اخلاق و تہذیب کی ساری حدیں پھلانگ کر شتر بے مہار بن گئے ہیں۔ مراد ان کے وہ سردار اور امراء ہیں جو شرک و کفر کے داعی اور حق کی مخالفت میں پیش پیش تھے اور جن کی زیرِ قیادت ان کا بگڑا ہوا نظامِ زندگی چل رہا تھا، ایسے لوگ ہمیشہ زمین میں فساد ہی پھیلاتے ہیں، ان کے ہاتھوں اصلاح کبھی نہیں ہو سکتی۔ قرآن مجید کے دوسرے مقام سے معلوم ہوتا ہے کہ ان {’’ الْمُسْرِفِيْنَ ‘‘} میں سب سے پیش پیش وہ نو (۹) بدمعاش تھے جنھوں نے ملک میں فساد مچا رکھا تھا اور آخر کار قوم کی تباہی کا سبب بنے، فرمایا : «{ وَ كَانَ فِي الْمَدِيْنَةِ تِسْعَةُ رَهْطٍ يُّفْسِدُوْنَ فِي الْاَرْضِ وَ لَا يُصْلِحُوْنَ }» [ النمل : ۴۸ ] ’’اور اس شہر میں نو(۹) شخص تھے، جو اس سرزمین میں فساد پھیلاتے تھے اور اصلاح نہیں کرتے تھے۔‘‘"
    },
    {
      "ayah": 152,
      "tafsir": "(آیت 152،151) {وَ لَا تُطِيْعُوْۤا اَمْرَ الْمُسْرِفِيْنَ …:} یعنی ان لوگوں کا کہنا مت مانو جو اخلاق و تہذیب کی ساری حدیں پھلانگ کر شتر بے مہار بن گئے ہیں۔ مراد ان کے وہ سردار اور امراء ہیں جو شرک و کفر کے داعی اور حق کی مخالفت میں پیش پیش تھے اور جن کی زیرِ قیادت ان کا بگڑا ہوا نظامِ زندگی چل رہا تھا، ایسے لوگ ہمیشہ زمین میں فساد ہی پھیلاتے ہیں، ان کے ہاتھوں اصلاح کبھی نہیں ہو سکتی۔ قرآن مجید کے دوسرے مقام سے معلوم ہوتا ہے کہ ان {’’ الْمُسْرِفِيْنَ ‘‘} میں سب سے پیش پیش وہ نو (۹) بدمعاش تھے جنھوں نے ملک میں فساد مچا رکھا تھا اور آخر کار قوم کی تباہی کا سبب بنے، فرمایا : «{ وَ كَانَ فِي الْمَدِيْنَةِ تِسْعَةُ رَهْطٍ يُّفْسِدُوْنَ فِي الْاَرْضِ وَ لَا يُصْلِحُوْنَ }» [ النمل : ۴۸ ] ’’اور اس شہر میں نو(۹) شخص تھے، جو اس سرزمین میں فساد پھیلاتے تھے اور اصلاح نہیں کرتے تھے۔‘‘"
    },
    {
      "ayah": 153,
      "tafsir": "(آیت 153) {قَالُوْۤا اِنَّمَاۤ اَنْتَ مِنَ الْمُسَحَّرِيْنَ: ’’ مَسْحُوْرِيْنَ‘‘} جن پر جادو کیا گیا ہو۔ {’’ الْمُسَحَّرِيْنَ‘‘} باب تفعیل سے ہے، اس میں مبالغہ ہے، اس لیے ترجمہ کیا گیا ہے ’’تو تو انھی لوگوں سے ہے جن پر زبردست جادو کیا گیا ہے۔‘‘ جب وہ لوگ صالح علیہ السلام کی دعوت پر کوئی اعتراض نہ کر سکے تو عامۃ الناس کو بے وقوف بنانے کے لیے کہنے لگے، زبردست جادو کی وجہ سے تیری عقل ماری گئی ہے۔"
    },
    {
      "ayah": 154,
      "tafsir": "(آیت 154) {مَاۤ اَنْتَ اِلَّا بَشَرٌ مِّثْلُنَا…:} اس کے دو مطلب ہو سکتے ہیں، ایک یہ کہ تو ہمارے جیسا بشر ہے اور بشر رسول نہیں ہو سکتا، جیسا کہ تمام پیغمبروں کے امتیوں نے بشر ہونے کی وجہ سے ان کی رسالت کا انکار کیا۔( دیکھیے بنی اسرائیل : ۹۴) دوسرا یہ کہ تو ہمارے جیسا ایک بشر ہے، پھر تجھ میں کیا خصوصیت ہے کہ ہمیں چھوڑ کر تجھے رسالت عطا ہوئی ہے۔ (دیکھیے قمر : ۲۵) {’’ فَاْتِ بِاٰيَةٍ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ ‘‘} اس لیے اپنی اس خصوصیت کی دلیل کے طور پر تجھے کوئی معجزہ پیش کرنا ہو گا، جس سے ثابت ہو جائے کہ واقعی تجھے اللہ تعالیٰ نے بھیجا ہے۔"
    },
    {
      "ayah": 155,
      "tafsir": "(آیت 156،155) ➊ {قَالَ هٰذِهٖ نَاقَةٌ …:} اللہ تعالیٰ نے اس اونٹنی کو {’’آيَةٌ بَيِّنَةٌ‘‘} اور {’’آيَةٌ مُبْصِرَةٌ‘‘} (واضح نشانی و معجزہ) قرار دیا ہے۔ دیکھیے سورۂ اعراف (۷۳)، ہود (۶۴) اور بنی اسرائیل (۵۹) اس سے معلوم ہوا کہ وہ عام قسم کی اونٹنی نہ تھی بلکہ اس کی پیدائش اور ظاہر ہونے میں ضرور کوئی ایسی بات تھی جس کی بنا پر اسے معجزہ قرار دیا گیا۔ {’’ الصحيح المسبور‘‘} میں ہے کہ ابن حبان نے صحیح سند کے ساتھ ابوطفیل عامر بن واثلہ رضی اللہ عنہ سے روایت کی ہے : ’’صالح علیہ السلام نے انھیں فرمایا، نکلو! تو وہ ایک چٹان کی طرف نکلے، وہ چٹان اس طرح لرزی جس طرح حاملہ اونٹنی کو درد زہ ہوتا ہے، پھر وہ پھٹی اور اس کے درمیان سے اونٹنی نکلی تو صالح علیہ السلام نے ان سے کہا : «{ هٰذِهٖ نَاقَةُ اللّٰهِ لَكُمْ اٰيَةً فَذَرُوْهَا تَاْكُلْ فِيْۤ اَرْضِ اللّٰهِ وَ لَا تَمَسُّوْهَا بِسُوْٓءٍ فَيَاْخُذَكُمْ عَذَابٌ قَرِيْبٌ } » [ [ ہود : ۶۴ ] ’’یہ اللہ کی اونٹنی ہے، تمھارے لیے عظیم نشانی، پس اسے چھوڑ دو کہ اللہ کی زمین میں کھاتی پھرے اور اسے کوئی تکلیف نہ پہنچاؤ، ورنہ تمھیں ایک قریب عذاب پکڑ لے گا۔‘‘ اگرچہ اس روایت کی سند صحیح ہے مگر یہ صحابی کا قول ہے۔ ¤ ابن کثیر رحمہ اللہ لکھتے ہیں : ’’قوم کے بڑے بڑے سردار جمع ہوئے اور انھوں نے ایک چٹان کی طرف اشارہ کرتے ہوئے صالح علیہ السلام سے مطالبہ کیا کہ اس چٹان سے ہمارے دیکھتے دیکھتے ایک پوری جسامت کی اونٹنی نکالو، جس کی یہ یہ صفات ہوں۔ صالح علیہ السلام نے ان سے پختہ عہد لیا کہ اگر ان کی فرمائش پوری کر دی جائے تو وہ ایمان لا کر ان کی پیروی اختیار کریں گے۔ جب انھوں نے قول دے دیا تو صالح علیہ السلام اللہ تعالیٰ کے حضور دعا کے لیے کھڑے ہوئے کہ ان کی فرمائش پوری کر دی جائے، چنانچہ وہ چٹان جس کی طرف انھوں نے اشارہ کیا تھا، یکایک پھٹی اور اس میں سے ان کی مطلوبہ صفات کی اونٹنی ظاہر ہوئی، اسے دیکھ کر کچھ لوگ ایمان لے آئے، لیکن اکثر اپنے کفر پر جمے رہے، اس پر صالح علیہ السلام نے ان سے فرمایا : «{ هٰذِهٖ نَاقَةُ اللّٰهِ لَكُمْ اٰيَةً فَذَرُوْهَا تَاْكُلْ فِيْۤ اَرْضِ اللّٰهِ وَ لَا تَمَسُّوْهَا بِسُوْٓءٍ فَيَاْخُذَكُمْ عَذَابٌ قَرِيْبٌ }» [ ھود : ۶۴ ] ’’یہ اللہ کی اونٹنی ہے، تمھارے لیے عظیم نشانی، پس اسے چھوڑ دو کہ اللہ کی زمین میں کھاتی پھرے اور اسے کوئی تکلیف نہ پہنچاؤ، ورنہ تمھیں ایک قریب عذاب پکڑ لے گا۔‘‘ مفسر مراغی لکھتے ہیں : ’’اس قسم کی روایات کو سچا ماننا ہم پر اسی وقت لازم ہے جب وہ صحیح خبروں سے ثابت ہوں۔‘‘ مطلب یہ ہے کہ یہ روایات رسول اللہ صلی اللہ علیہ وسلم سے ثابت نہیں ہیں، تاہم اس میں شک نہیں کہ وہ عام اونٹنی نہ تھی بلکہ معجزانہ شان رکھنے والی اونٹنی تھی۔ اس اونٹنی کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے مروی ایک صحیح حدیث مسند احمد کے حوالے سے سورۂ اعراف (۷۳) میں گزر چکی ہے۔ ¤ ➋ { لَهَا شِرْبٌ وَّ لَكُمْ شِرْبُ يَوْمٍ مَّعْلُوْمٍ :} قرآن کی دوسری آیات سے معلوم ہوتا ہے کہ قوم کو صرف اتنا حکم نہ تھا کہ ہر دوسرے روز یہ اونٹنی تمھارے سارے علاقے کا پانی پیے گی، بلکہ یہ حکم بھی تھا کہ یہ تمھارے کھیتوں اور باغوں میں جہاں چاہے گی جائے گی اور جو چاہے گی کھائے گی، اسے کوئی نقصان نہ پہنچانا۔ دیکھیے سورۂ اعراف (۷۳) اور ہود (۶۴)۔"
    },
    {
      "ayah": 156,
      "tafsir": "(آیت 156،155) ➊ {قَالَ هٰذِهٖ نَاقَةٌ …:} اللہ تعالیٰ نے اس اونٹنی کو {’’آيَةٌ بَيِّنَةٌ‘‘} اور {’’آيَةٌ مُبْصِرَةٌ‘‘} (واضح نشانی و معجزہ) قرار دیا ہے۔ دیکھیے سورۂ اعراف (۷۳)، ہود (۶۴) اور بنی اسرائیل (۵۹) اس سے معلوم ہوا کہ وہ عام قسم کی اونٹنی نہ تھی بلکہ اس کی پیدائش اور ظاہر ہونے میں ضرور کوئی ایسی بات تھی جس کی بنا پر اسے معجزہ قرار دیا گیا۔ {’’ الصحيح المسبور‘‘} میں ہے کہ ابن حبان نے صحیح سند کے ساتھ ابوطفیل عامر بن واثلہ رضی اللہ عنہ سے روایت کی ہے : ’’صالح علیہ السلام نے انھیں فرمایا، نکلو! تو وہ ایک چٹان کی طرف نکلے، وہ چٹان اس طرح لرزی جس طرح حاملہ اونٹنی کو درد زہ ہوتا ہے، پھر وہ پھٹی اور اس کے درمیان سے اونٹنی نکلی تو صالح علیہ السلام نے ان سے کہا : «{ هٰذِهٖ نَاقَةُ اللّٰهِ لَكُمْ اٰيَةً فَذَرُوْهَا تَاْكُلْ فِيْۤ اَرْضِ اللّٰهِ وَ لَا تَمَسُّوْهَا بِسُوْٓءٍ فَيَاْخُذَكُمْ عَذَابٌ قَرِيْبٌ } » [ [ ہود : ۶۴ ] ’’یہ اللہ کی اونٹنی ہے، تمھارے لیے عظیم نشانی، پس اسے چھوڑ دو کہ اللہ کی زمین میں کھاتی پھرے اور اسے کوئی تکلیف نہ پہنچاؤ، ورنہ تمھیں ایک قریب عذاب پکڑ لے گا۔‘‘ اگرچہ اس روایت کی سند صحیح ہے مگر یہ صحابی کا قول ہے۔ ¤ ابن کثیر رحمہ اللہ لکھتے ہیں : ’’قوم کے بڑے بڑے سردار جمع ہوئے اور انھوں نے ایک چٹان کی طرف اشارہ کرتے ہوئے صالح علیہ السلام سے مطالبہ کیا کہ اس چٹان سے ہمارے دیکھتے دیکھتے ایک پوری جسامت کی اونٹنی نکالو، جس کی یہ یہ صفات ہوں۔ صالح علیہ السلام نے ان سے پختہ عہد لیا کہ اگر ان کی فرمائش پوری کر دی جائے تو وہ ایمان لا کر ان کی پیروی اختیار کریں گے۔ جب انھوں نے قول دے دیا تو صالح علیہ السلام اللہ تعالیٰ کے حضور دعا کے لیے کھڑے ہوئے کہ ان کی فرمائش پوری کر دی جائے، چنانچہ وہ چٹان جس کی طرف انھوں نے اشارہ کیا تھا، یکایک پھٹی اور اس میں سے ان کی مطلوبہ صفات کی اونٹنی ظاہر ہوئی، اسے دیکھ کر کچھ لوگ ایمان لے آئے، لیکن اکثر اپنے کفر پر جمے رہے، اس پر صالح علیہ السلام نے ان سے فرمایا : «{ هٰذِهٖ نَاقَةُ اللّٰهِ لَكُمْ اٰيَةً فَذَرُوْهَا تَاْكُلْ فِيْۤ اَرْضِ اللّٰهِ وَ لَا تَمَسُّوْهَا بِسُوْٓءٍ فَيَاْخُذَكُمْ عَذَابٌ قَرِيْبٌ }» [ ھود : ۶۴ ] ’’یہ اللہ کی اونٹنی ہے، تمھارے لیے عظیم نشانی، پس اسے چھوڑ دو کہ اللہ کی زمین میں کھاتی پھرے اور اسے کوئی تکلیف نہ پہنچاؤ، ورنہ تمھیں ایک قریب عذاب پکڑ لے گا۔‘‘ مفسر مراغی لکھتے ہیں : ’’اس قسم کی روایات کو سچا ماننا ہم پر اسی وقت لازم ہے جب وہ صحیح خبروں سے ثابت ہوں۔‘‘ مطلب یہ ہے کہ یہ روایات رسول اللہ صلی اللہ علیہ وسلم سے ثابت نہیں ہیں، تاہم اس میں شک نہیں کہ وہ عام اونٹنی نہ تھی بلکہ معجزانہ شان رکھنے والی اونٹنی تھی۔ اس اونٹنی کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے مروی ایک صحیح حدیث مسند احمد کے حوالے سے سورۂ اعراف (۷۳) میں گزر چکی ہے۔ ¤ ➋ { لَهَا شِرْبٌ وَّ لَكُمْ شِرْبُ يَوْمٍ مَّعْلُوْمٍ :} قرآن کی دوسری آیات سے معلوم ہوتا ہے کہ قوم کو صرف اتنا حکم نہ تھا کہ ہر دوسرے روز یہ اونٹنی تمھارے سارے علاقے کا پانی پیے گی، بلکہ یہ حکم بھی تھا کہ یہ تمھارے کھیتوں اور باغوں میں جہاں چاہے گی جائے گی اور جو چاہے گی کھائے گی، اسے کوئی نقصان نہ پہنچانا۔ دیکھیے سورۂ اعراف (۷۳) اور ہود (۶۴)۔"
    },
    {
      "ayah": 157,
      "tafsir": "(آیت 157) ➊ {فَعَقَرُوْهَا:} اللہ تعالیٰ نے یہاں ان سب کے متعلق فرمایا کہ انھوں نے اس کی کونچیں کاٹ دیں، حالانکہ کونچیں کاٹنے والا صرف ایک شخص ’’قدار‘‘ تھا، جیسا کہ سورۂ شمس میں ہے : «{ اِذِ انْۢبَعَثَ اَشْقٰىهَا}» [الشمس : ۱۲] ’’جب اس (قوم) کا سب سے بڑا بدبخت اٹھا۔‘‘ اس کی وجہ یہ ہے کہ اس نے یہ کام پوری قوم کے مشورے اور ان کی فرمائش پر کیا تھا، جیسا کہ سورۂ قمر میں ہے : «{ فَنَادَوْا صَاحِبَهُمْ فَتَعَاطٰى فَعَقَرَ}» [ الققمر : ۲۹ ] ’’تو انھوں نے اپنے ساتھی کو پکارا، سو اس نے (اسے) پکڑا، پس کونچیں کاٹ دیں۔‘‘ اس لیے سبھی مجرم قرار دیے گئے۔ ¤ ➋ { فَاَصْبَحُوْا نٰدِمِيْنَ :} سورۂ ہود میں ہے کہ اونٹنی کو قتل کرنے پر صالح علیہ السلام نے انھیں تین دن کی مہلت دی، چنانچہ جب حسبِ وعدہ عذاب کے آثار نمودار ہونے لگے تو وہ ندامت کا اظہار کرنے لگے، مگر وہ وقت ندامت اور توبہ کا نہ تھا۔ (دیکھیے مومن : ۸۵) اور ان کی ندامت رسول کو جھٹلانے پر نہ تھی، بلکہ عذاب میں مبتلا ہونے پر تھی۔"
    },
    {
      "ayah": 158,
      "tafsir": "(آیت 159،158) ➊ { فَاَخَذَهُمُ الْعَذَابُ :} اس کی تفسیر کے لیے دیکھیے سورۂ اعراف (۷۸) اور ہود (۶۷)۔ ¤ ➋ { اِنَّ فِيْ ذٰلِكَ لَاٰيَةً وَ مَا كَانَ … :} ان آیات کی تفسیر سورت کے شروع میں آیت (۸، ۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 159,
      "tafsir": "(آیت 159،158) ➊ { فَاَخَذَهُمُ الْعَذَابُ :} اس کی تفسیر کے لیے دیکھیے سورۂ اعراف (۷۸) اور ہود (۶۷)۔ ¤ ➋ { اِنَّ فِيْ ذٰلِكَ لَاٰيَةً وَ مَا كَانَ … :} ان آیات کی تفسیر سورت کے شروع میں آیت (۸، ۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 160,
      "tafsir": "(آیت 161،160) {كَذَّبَتْ قَوْمُ لُوْطٍ المُرْسَلِيْنَ … :} لوط علیہ السلام کے حالات کے لیے دیکھیے سورۂ اعراف (۸۰ تا ۸۴)، ہود (۷۷ تا ۸۳)، حجر (۶۱ تا ۷۷)، انبیاء (۷۱ تا ۷۵)، نمل (۵۴ تا ۵۸)، صافات (۱۳۳ تا ۱۳۸) اور قمر (۳۳ تا ۳۹) لوط علیہ السلام ابراہیم علیہ السلام کے بھتیجے تھے۔ اصلاً یہ عراق کے رہنے والے تھے، انھیں جن بستیوں کی طرف مبعوث کیا گیا ان کا صدر مقام سدوم تھا، اس کے رہنے والوں کو لوط کی قوم اس لیے کہا گیا کہ وہ ان میں جا کر آباد ہو گئے تھے۔ ممکن ہے ان کی بیوی بھی انھی میں سے ہو۔ اگلی آیت میں لوط علیہ السلام کو ان کا بھائی اسی مناسبت سے کہا گیا ہے، ورنہ ان کا ان سے نسبی رشتہ نہیں تھا۔ اسی لیے جب ان کی قوم کے بدمعاش ان کے مہمانوں کی بے عزتی پر تل گئے تو انھوں نے کہا : «{ لَوْ اَنَّ لِيْ بِكُمْ قُوَّةً اَوْ اٰوِيْۤ اِلٰى رُكْنٍ شَدِيْدٍ }» [ ھود : ۸۰ ] ’’کاش! واقعی میرے پاس تمھارے مقابلہ کی کچھ طاقت ہوتی، یا میں کسی مضبوط سہارے کی پناہ لیتا۔‘‘ تفصیل سورۂ اعراف (۸۰ تا ۸۴)، ہود (۷۷ تا ۸۳) اور حجر (۶۱ تا ۷۷) میں دیکھیے۔"
    },
    {
      "ayah": 161,
      "tafsir": "(آیت 161،160) {كَذَّبَتْ قَوْمُ لُوْطٍ المُرْسَلِيْنَ … :} لوط علیہ السلام کے حالات کے لیے دیکھیے سورۂ اعراف (۸۰ تا ۸۴)، ہود (۷۷ تا ۸۳)، حجر (۶۱ تا ۷۷)، انبیاء (۷۱ تا ۷۵)، نمل (۵۴ تا ۵۸)، صافات (۱۳۳ تا ۱۳۸) اور قمر (۳۳ تا ۳۹) لوط علیہ السلام ابراہیم علیہ السلام کے بھتیجے تھے۔ اصلاً یہ عراق کے رہنے والے تھے، انھیں جن بستیوں کی طرف مبعوث کیا گیا ان کا صدر مقام سدوم تھا، اس کے رہنے والوں کو لوط کی قوم اس لیے کہا گیا کہ وہ ان میں جا کر آباد ہو گئے تھے۔ ممکن ہے ان کی بیوی بھی انھی میں سے ہو۔ اگلی آیت میں لوط علیہ السلام کو ان کا بھائی اسی مناسبت سے کہا گیا ہے، ورنہ ان کا ان سے نسبی رشتہ نہیں تھا۔ اسی لیے جب ان کی قوم کے بدمعاش ان کے مہمانوں کی بے عزتی پر تل گئے تو انھوں نے کہا : «{ لَوْ اَنَّ لِيْ بِكُمْ قُوَّةً اَوْ اٰوِيْۤ اِلٰى رُكْنٍ شَدِيْدٍ }» [ ھود : ۸۰ ] ’’کاش! واقعی میرے پاس تمھارے مقابلہ کی کچھ طاقت ہوتی، یا میں کسی مضبوط سہارے کی پناہ لیتا۔‘‘ تفصیل سورۂ اعراف (۸۰ تا ۸۴)، ہود (۷۷ تا ۸۳) اور حجر (۶۱ تا ۷۷) میں دیکھیے۔"
    },
    {
      "ayah": 162,
      "tafsir": "(آیت 162تا164) ان آیات کی تفسیر آیت (۱۰۷ تا ۱۰۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 163,
      "tafsir": "(آیت 162تا164) ان آیات کی تفسیر آیت (۱۰۷ تا ۱۰۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 164,
      "tafsir": "(آیت 162تا164) ان آیات کی تفسیر آیت (۱۰۷ تا ۱۰۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 165,
      "tafsir": "(آیت 165) { اَتَاْتُوْنَ الذُّكْرَانَ مِنَ الْعٰلَمِيْنَ:} اس کے دو مطلب ہو سکتے ہیں، ایک یہ کہ سارے جہانوں میں سے تم نے مردوں کو اس کام کے لیے چن لیا ہے کہ ان سے خواہش نفس پوری کرو، حالانکہ دنیا میں عورتیں بہت ہیں۔ دوسرا یہ کہ دنیا بھر میں تم ہی ایسے لوگ ہو جو شہوت پوری کرنے کے لیے مردوں کے پاس جاتے ہو، تم سے پہلے کسی نے یہ خسیس حرکت نہیں کی۔ اس مفہوم کی صراحت سورۂ عنکبوت میں اس طرح آئی ہیں : «{ اِنَّكُمْ لَتَاْتُوْنَ الْفَاحِشَةَ مَا سَبَقَكُمْ بِهَا مِنْ اَحَدٍ مِّنَ الْعٰلَمِيْنَ }» [ العنکبوت : ۲۸ ] ’’بے شک تم یقینا اس بے حیائی کا ارتکاب کرتے ہو جو تم سے پہلے جہانوں میں سے کسی نے نہیں کی۔‘‘"
    },
    {
      "ayah": 166,
      "tafsir": "(آیت 166) ➊ { وَ تَذَرُوْنَ مَا خَلَقَ لَكُمْ رَبُّكُمْ … :} اس آیت کے بھی دو مطلب ہو سکتے ہیں، ایک یہ کہ اس خواہش کو پورا کرنے کے لیے جو بیویاں اللہ تعالیٰ نے تمھارے لیے پیدا کی ہیں انھیں چھوڑ کر مردوں کے پاس جاتے ہو۔ اس صورت میں {’’ مَا ‘‘} بیانیہ ہے، ترجمہ اسی کے مطابق کیا گیا ہے۔ دوسرا مطلب یہ ہے کہ تمھاری بیویوں میں سے جو کچھ تمھارے رب نے تمھارے لیے پیدا کیا ہے اسے چھوڑ دیتے ہو؟ یعنی قُبل کے بجائے غیر فطری وضع سے شہوت پوری کرتے ہو۔ اس صورت میں {’’ مَا ‘‘} تبعیض کے لیے ہے۔ بعید نہیں کہ وہ لوگ یہ حرکت اولاد سے بچچنے کے لیے کرتے ہوں۔ ¤ ➋ {بَلْ اَنْتُمْ قَوْمٌ عٰدُوْنَ :} یعنی صرف اسی کام میں نہیں بلکہ ہر کام میں حد سے گزرنا تمھاری عادت بن چکی ہے، جیسا کہ فرمایا : «{ اَئِنَّکُمْ لَتَاْتُوْنَ الرِّجَالَ وَ تَقْطَعُوْنَ السَّبِيْلَ وَ تَاْتُوْنَ فِيْ نَادِيْكُمُ الْمُنْكَرَ }» [ العنکبوت : ۲۹ ] ’’کیا بے شک تم واقعی مردوں کے پاس آتے ہو اور راستہ کاٹتے ہو اور اپنی مجلس میں برا کام کرتے ہو؟‘‘ ہمارے عہد میں یورپی لوگ فطرت کی مخالفت میں اس قدر حد سے گزر گئے ہیں کہ انھوں نے قانوناً قوم لوط کے عمل کو جائز قرار دے دیا ہے اور مردوں کا مردوں کے ساتھ نکاح کرنے لگے ہیں۔ اگرچہ نئی سے نئی بیماریوں کی صورت میں اللہ کے عذاب کا کوڑا ان پر برس رہا ہے، تاہم بعید نہیں کہ اللہ تعالیٰ ان پر ایسا عذاب بھیجے جو دنیا کے لیے باعثِ عبرت ہو۔"
    },
    {
      "ayah": 167,
      "tafsir": "(آیت 167) ➊ {قَالُوْا لَىِٕنْ لَّمْ تَنْتَهِ يٰلُوْطُ …:} اس سے معلوم ہوتا ہے کہ ان لوگوں کا شیوہ تھا کہ جو ان کی مرضی کے خلاف بات کرے اسے عبرت ناک طریقے سے ذلیل و خوار کرکے نکال دیتے تھے۔ اس لیے انھوں نے پہلے نکالے جانے والوں کے انجام کا حوالہ دے کر کہا کہ ہم تمھیں بھی ان میں شامل کر دیں گے۔ ¤ ➋ بقاعی نے فرمایا، وہ لوگ لوط علیہ السلام کو اپنی بستی سے ذلیل کر کے نکالنا چاہتے تھے، جبکہ اللہ تعالیٰ انھیں اس بستی سے باعزت طریقے سے نکالنے والا تھا، پھر وہی ہوا جو اللہ چاہتا تھا کیونکہ : «{ وَ اللّٰهُ غَالِبٌ عَلٰۤى اَمْرِهٖ }» [ یوسف :۲۱ ]’’اور اللہ اپنے کام پر غالب ہے۔‘‘"
    },
    {
      "ayah": 168,
      "tafsir": "(آیت 168) {قَالَ اِنِّيْ لِعَمَلِكُمْ مِّنَ الْقَالِيْنَ: ’’ الْقَالِيْنَ ‘‘ ’’اَلْقَالِيْ‘‘} کی جمع ہے جو {’’قَلٰي يَقْلِيْ‘‘} سے اسم فاعل ہے، جس کا معنی شدید نفرت اور دشمنی بھی ہے اور گوشت بھوننا بھی۔ لوط علیہ السلام نے فرمایا کہ میں تمھیں منع کرنے سے کیسے باز آ سکتا ہوں، جب کہ میں تمھارے اس کام سے شدید دشمنی رکھنے والوں میں سے ہوں، اتنی شدید کہ اس سے میرا دل جلتا ہے۔"
    },
    {
      "ayah": 169,
      "tafsir": "(آیت 169) {رَبِّ نَجِّنِيْ وَ اَهْلِيْ مِمَّا يَعْمَلُوْنَ :} یعنی کفار پر ان اعمال کا وبال اور عذاب نازل فرما اور ہمیں ان کے اعمال بد کی نحوست اور وبال سے محفوظ رکھ۔"
    },
    {
      "ayah": 170,
      "tafsir": "(آیت 170تا173) ان آیات کی تفسیر اس مقام پر لوط علیہ السلام کے قصے کے شروع میں دیے ہوئے حوالہ جات میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 171,
      "tafsir": "(آیت 170تا173) ان آیات کی تفسیر اس مقام پر لوط علیہ السلام کے قصے کے شروع میں دیے ہوئے حوالہ جات میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 172,
      "tafsir": "(آیت 170تا173) ان آیات کی تفسیر اس مقام پر لوط علیہ السلام کے قصے کے شروع میں دیے ہوئے حوالہ جات میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 173,
      "tafsir": "(آیت 170تا173) ان آیات کی تفسیر اس مقام پر لوط علیہ السلام کے قصے کے شروع میں دیے ہوئے حوالہ جات میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 174,
      "tafsir": "(آیت 175،174) ان آیات کی تفسیر آیت (۸، ۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 175,
      "tafsir": "(آیت 175،174) ان آیات کی تفسیر آیت (۸، ۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 176,
      "tafsir": "(آیت 177،176) {كَذَّبَ اَصْحٰبُ لْـَٔيْكَةِ الْمُرْسَلِيْنَ … : ’’اَلْئَيْكَةُ‘‘} درختوں کے جھنڈ کو کہتے ہیں، یہ جھنڈ مدین کے اردگرد واقع تھے۔ شعیب علیہ السلام مدین والوں اور اصحاب الایکہ دونوں کی طرف مبعوث تھے، مگر چونکہ ان کی رہائش مدین میں تھی اور ان کا نسبی تعلق بھی اہلِ مدین سے تھا اور پھر اللہ تعالیٰ نے تمام پیغمبروں کا انتخاب بستیوں میں رہنے والے سے کیا ہے (دیکھیے یوسف : ۱۰۹) اس لیے مدین کے ذکر میں شعیب علیہ السلام کو ان کا بھائی قرار دیا، جیسا کہ فرمایا : «{ وَ اِلٰى مَدْيَنَ اَخَاهُمْ شُعَيْبًا }» [ الأعراف : ۸۵ ] ’’اور مدین کی طرف ان کے بھائی شعیب کو بھیجا۔‘‘ جب کہ اصحاب الایکہ کے ذکر میں فرمایا : «{ اِذْ قَالَ لَهُمْ شُعَيْبٌ }» [ الشعراء : ۱۷۷ ] ’’جب شعیب نے ان سے کہا‘‘ اس سے معلوم ہوا کہ شعیب علیہ السلام ان کی طرف مبعوث تو تھے مگر نسب یا سسرال یا ان میں رہائش کا کوئی ایسا تعلق نہ تھا کہ انھیں ان کا بھائی کہا جاتا۔ (التحریر والتنویر) ¤ ابن کثیر رحمہ اللہ نے فرمایا : ’’صحیح بات یہ ہے کہ اصحاب الایکہ اہلِ مدین ہی ہیں، دونوں کو ماپ تول پورا کرنے کی نصیحت کی گئی۔ انھیں اصحاب الایکہ اس لیے فرمایا کہ ’’الایکہ‘‘ ایک درخت تھا یا درختوں کا جھنڈ تھا، جس کی وہ پرستش کرتے تھے۔ جب مدین (شہر یا قوم) کا ذکر فرمایا تو شعیب علیہ السلام کو ان کا بھائی فرمایا، لیکن جب ان کی نسبت شجر پرستی کی طرف کی تو فرمایا : «{ اِذْ قَالَ لَهُمْ شُعَيْبٌ }» ’’جب شعیب نے ان سے کہا‘‘ یعنی اخوت کا تعلق ختم کر دیا۔‘‘"
    },
    {
      "ayah": 177,
      "tafsir": "(آیت 177،176) {كَذَّبَ اَصْحٰبُ لْـَٔيْكَةِ الْمُرْسَلِيْنَ … : ’’اَلْئَيْكَةُ‘‘} درختوں کے جھنڈ کو کہتے ہیں، یہ جھنڈ مدین کے اردگرد واقع تھے۔ شعیب علیہ السلام مدین والوں اور اصحاب الایکہ دونوں کی طرف مبعوث تھے، مگر چونکہ ان کی رہائش مدین میں تھی اور ان کا نسبی تعلق بھی اہلِ مدین سے تھا اور پھر اللہ تعالیٰ نے تمام پیغمبروں کا انتخاب بستیوں میں رہنے والے سے کیا ہے (دیکھیے یوسف : ۱۰۹) اس لیے مدین کے ذکر میں شعیب علیہ السلام کو ان کا بھائی قرار دیا، جیسا کہ فرمایا : «{ وَ اِلٰى مَدْيَنَ اَخَاهُمْ شُعَيْبًا }» [ الأعراف : ۸۵ ] ’’اور مدین کی طرف ان کے بھائی شعیب کو بھیجا۔‘‘ جب کہ اصحاب الایکہ کے ذکر میں فرمایا : «{ اِذْ قَالَ لَهُمْ شُعَيْبٌ }» [ الشعراء : ۱۷۷ ] ’’جب شعیب نے ان سے کہا‘‘ اس سے معلوم ہوا کہ شعیب علیہ السلام ان کی طرف مبعوث تو تھے مگر نسب یا سسرال یا ان میں رہائش کا کوئی ایسا تعلق نہ تھا کہ انھیں ان کا بھائی کہا جاتا۔ (التحریر والتنویر) ¤ ابن کثیر رحمہ اللہ نے فرمایا : ’’صحیح بات یہ ہے کہ اصحاب الایکہ اہلِ مدین ہی ہیں، دونوں کو ماپ تول پورا کرنے کی نصیحت کی گئی۔ انھیں اصحاب الایکہ اس لیے فرمایا کہ ’’الایکہ‘‘ ایک درخت تھا یا درختوں کا جھنڈ تھا، جس کی وہ پرستش کرتے تھے۔ جب مدین (شہر یا قوم) کا ذکر فرمایا تو شعیب علیہ السلام کو ان کا بھائی فرمایا، لیکن جب ان کی نسبت شجر پرستی کی طرف کی تو فرمایا : «{ اِذْ قَالَ لَهُمْ شُعَيْبٌ }» ’’جب شعیب نے ان سے کہا‘‘ یعنی اخوت کا تعلق ختم کر دیا۔‘‘"
    },
    {
      "ayah": 178,
      "tafsir": "(آیت 178تا180) ان آیات کی تفسیر اسی سورت کی آیات (۱۰۷ تا ۱۰۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 179,
      "tafsir": "(آیت 178تا180) ان آیات کی تفسیر اسی سورت کی آیات (۱۰۷ تا ۱۰۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 180,
      "tafsir": "(آیت 178تا180) ان آیات کی تفسیر اسی سورت کی آیات (۱۰۷ تا ۱۰۹) کے تحت گزر چکی ہے۔"
    },
    {
      "ayah": 181,
      "tafsir": "(آیت 181تا183) {اَوْفُوا الْكَيْلَ وَ لَا تَكُوْنُوْا … :} ان کی ماپ تول میں کمی بیشی، زمین میں فساد اور رہزنی کا ذکر سورۂ اعراف (۸۵، ۸۶) میں گزر چکا ہے۔ شعیب علیہ السلام کے قصے کی تفصیل کے لیے دیکھیے سورۂ اعراف (۸۵ تا ۹۳)، ہود (۸۴ تا ۹۵) اور عنکبوت (۳۶، ۳۷) بعض لوگوں نے مدین کے اس بزرگ کو شعیب علیہ السلام قرار دیا ہے جس کے پاس موسیٰ علیہ السلام نے دس سال گزارے تھے، مگر یہ بات بالکل بے اصل ہے، ’’مدین‘‘ کے ہر بزرگ کا شعیب علیہ السلام ہونا ضروری نہیں۔"
    },
    {
      "ayah": 182,
      "tafsir": "(آیت 181تا183) {اَوْفُوا الْكَيْلَ وَ لَا تَكُوْنُوْا … :} ان کی ماپ تول میں کمی بیشی، زمین میں فساد اور رہزنی کا ذکر سورۂ اعراف (۸۵، ۸۶) میں گزر چکا ہے۔ شعیب علیہ السلام کے قصے کی تفصیل کے لیے دیکھیے سورۂ اعراف (۸۵ تا ۹۳)، ہود (۸۴ تا ۹۵) اور عنکبوت (۳۶، ۳۷) بعض لوگوں نے مدین کے اس بزرگ کو شعیب علیہ السلام قرار دیا ہے جس کے پاس موسیٰ علیہ السلام نے دس سال گزارے تھے، مگر یہ بات بالکل بے اصل ہے، ’’مدین‘‘ کے ہر بزرگ کا شعیب علیہ السلام ہونا ضروری نہیں۔"
    },
    {
      "ayah": 183,
      "tafsir": "(آیت 181تا183) {اَوْفُوا الْكَيْلَ وَ لَا تَكُوْنُوْا … :} ان کی ماپ تول میں کمی بیشی، زمین میں فساد اور رہزنی کا ذکر سورۂ اعراف (۸۵، ۸۶) میں گزر چکا ہے۔ شعیب علیہ السلام کے قصے کی تفصیل کے لیے دیکھیے سورۂ اعراف (۸۵ تا ۹۳)، ہود (۸۴ تا ۹۵) اور عنکبوت (۳۶، ۳۷) بعض لوگوں نے مدین کے اس بزرگ کو شعیب علیہ السلام قرار دیا ہے جس کے پاس موسیٰ علیہ السلام نے دس سال گزارے تھے، مگر یہ بات بالکل بے اصل ہے، ’’مدین‘‘ کے ہر بزرگ کا شعیب علیہ السلام ہونا ضروری نہیں۔"
    },
    {
      "ayah": 184,
      "tafsir": "(آیت 184) {وَ اتَّقُوا الَّذِيْ خَلَقَكُمْ وَ الْجِبِلَّةَ الْاَوَّلِيْنَ:} شعیب علیہ السلام نے گفتگو کا آغاز {’’ اَلَا تَتَّقُوْنَ ‘‘} سے کیا تھا، اب اسی تقویٰ کی تاکید کے لیے فرمایا کہ اپنے اس رب سے ڈرو جس نے تمھیں اور تم سے پہلی نسلوں کو پیدا فرمایا۔ اس نے اگر تمھیں پیدا کیا ہے تو ملیا میٹ بھی کر سکتا ہے۔ اس میں توحید کی بھی تلقین ہے کہ جب پیدا کرنے میں اس کا کوئی شریک نہیں تو عبادت میں اس کے لیے شریک کیوں بناتے ہو۔ امتِ مسلمہ کو بھی اللہ تعالیٰ نے اسی دلیل کے ساتھ اپنی عبادت کا حکم دیا، فرمایا : «{ يٰۤاَيُّهَا النَّاسُ اعْبُدُوْا رَبَّكُمُ الَّذِيْ خَلَقَكُمْ وَ الَّذِيْنَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُوْنَ }» [ االبقرۃ : ۲۱ ] ’’اے لوگو! اپنے رب کی عبادت کرو جس نے تمھیں پیدا کیا اور ان لوگوں کو بھی جو تم سے پہلے تھے، تاکہ تم بچ جاؤ۔‘‘"
    },
    {
      "ayah": 185,
      "tafsir": "(آیت 186،185) ➊ { قَالُوْۤا اِنَّمَاۤ اَنْتَ مِنَ الْمُسَحَّرِيْنَ… :} یہ وہی جواب ہے جو قوم ثمود نے صالح علیہ السلام کو دیا تھا۔ ¤ ➋ { وَ اِنْ نَّظُنُّكَ لَمِنَ الْكٰذِبِيْنَ:} یہ {’’ اِنْ ‘‘} اصل میں {’’إِنَّ‘‘} ہے جس کا اسم {’’نَا‘‘} محذوف ہے : {’’ أَيْ وَ إِنَّا لَنَظُنُّكَ مِنَ الْكَاذِبِيْنَ‘‘} یعنی ہمارا گمان تمھارے جھوٹے ہونے کے سوا کہیں جاتا ہی نہیں۔"
    },
    {
      "ayah": 186,
      "tafsir": "(آیت 186،185) ➊ { قَالُوْۤا اِنَّمَاۤ اَنْتَ مِنَ الْمُسَحَّرِيْنَ… :} یہ وہی جواب ہے جو قوم ثمود نے صالح علیہ السلام کو دیا تھا۔ ¤ ➋ { وَ اِنْ نَّظُنُّكَ لَمِنَ الْكٰذِبِيْنَ:} یہ {’’ اِنْ ‘‘} اصل میں {’’إِنَّ‘‘} ہے جس کا اسم {’’نَا‘‘} محذوف ہے : {’’ أَيْ وَ إِنَّا لَنَظُنُّكَ مِنَ الْكَاذِبِيْنَ‘‘} یعنی ہمارا گمان تمھارے جھوٹے ہونے کے سوا کہیں جاتا ہی نہیں۔"
    },
    {
      "ayah": 187,
      "tafsir": "(آیت 187) {فَاَسْقِطْ عَلَيْنَا كِسَفًا مِّنَ السَّمَآءِ : ’’ كِسَفًا ‘‘ ’’كِسْفَةٌ‘‘} کی جمع ہے، جیسے {’’قِطْعَةٌ‘‘} کی جمع {’’قِطَعٌ‘‘} ہے۔ {’’ كِسَفًا ‘‘} کا معنی ہے ٹکڑے۔"
    },
    {
      "ayah": 188,
      "tafsir": "(آیت 188) {قَالَ رَبِّيْۤ اَعْلَمُ بِمَا تَعْمَلُوْنَ :} شعیب علیہ السلام نے جواب دیا کہ عذاب لانا یا آسمان سے ٹکڑے گرانا میرا کام نہیں، میرے رب کا کام ہے، کیونکہ وہی خوب جانتا ہے کہ تم کیا کرتے ہو، تم پر عذاب آنا ہے یا نہیں اور آنا ہے تو تمھارے اعمال کے مطابق کب آنا ہے اور کس قدر آنا ہے ؟ میرا کام متنبہ کرنا تھا وہ میں نے کر دیا۔ شعیب علیہ السلام کے اس واقعہ میں قریش کے لیے بھی تنبیہ ہے، کیونکہ وہ بھی رسول اللہ صلی اللہ علیہ وسلم سے یہ مطالبے کرتے تھے : «{ اَوْ تُسْقِطَ السَّمَآءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا اَوْ تَاْتِيَ بِاللّٰهِ وَ الْمَلٰٓىِٕكَةِ قَبِيْلًا }» [ بني إسرائیل : ۹۲ ] ’’یا آسمان کو ٹکڑے کر کے ہم پر گرا دے، جیسا کہ تونے دعویٰ کیاہے، یا تو اللہ اور فرشتوں کو سامنے لے آئے۔‘‘"
    },
    {
      "ayah": 189,
      "tafsir": "(آیت 189) ➊ { فَكَذَّبُوْهُ فَاَخَذَهُمْ عَذَابُ يَوْمِ الظُّلَّةِ … :} اس عذاب کی کوئی تفصیل قرآن مجید یا کسی صحیح حدیث میں نہیں آئی۔ ظاہر الفاظ سے یہ بات سمجھ میں آتی ہے کہ اللہ تعالیٰ نے آسمان سے کچھ ٹکڑے گرانے کے مطالبلبے کے جواب میں ان پر بادل کا ایک سائبان بھیج دیا، جس سے ایسا عذاب برسا کہ وہ تباہ و برباد ہو گئے۔ اس عذاب کی حقیقت اللہ تعالیٰ بہتر جانتا ہے، مگر خود اللہ تعالیٰ نے اس سوال کا جواب دیا کہ وہ کس قسم کا عذاب تھا، فرمایا یقینا وہ ایک عظیم دن کا عذاب تھا۔ جب وہ دن عظیم تھا تو اس میں اترنے والے عذاب کی عظمت کا خود اندازہ کر لو۔ ¤ ➋ یہ آیت اس بات کی واضح دلیل ہے کہ ’’اصحابِ مدین‘‘ اور ’’اصحاب الایکہ ‘‘ الگ الگ قومیں تھیں، کیونکہ اصحاب الایکہ پر {’’ يَوْمِ الظُّلَّةِ ‘‘} کا عذاب آیا، جب کہ اصحابِ مدین پر زلزلے اور صیحہ (چیخ) کا عذاب آیا تھا، جیسا کہ فرمایا : «{ فَاَخَذَتْهُمُ الرَّجْفَةُ فَاَصْبَحُوْا فِيْ دَارِهِمْ جٰثِمِيْنَ }» [ الأعراف : ۷۸ ] ’’تو انھیں زلزلے نے پکڑ لیا تو انھوں نے اپنے گھر میں اس حال میں صبح کی کہ گرے پڑے تھے۔‘‘ اور فرمایا : «{ وَ اَخَذَ الَّذِيْنَ ظَلَمُوا الصَّيْحَةُ فَاَصْبَحُوْا فِيْ دِيَارِهِمْ جٰثِمِيْنَ }» [ ھود : ۶۷] ’’اور جن لوگوں نے ظلم کیا تھا انھیں چیخ نے پکڑ لیا، تو انھوں نے اپنے گھروں میں اس حال میں صبح کی کہ گرے پڑے تھے۔‘‘ ¤ بعض مفسرین نے سائبان کے عذاب کی تفصیل یہ بیان کی ہے کہ ’’اصحاب الایکہ ‘‘ پر پہلے سات دن تک سخت لو چلتی رہی، جس سے ان کے بدن پک گئے، چشموں اور کنووں کا پانی سوکھ گیا۔ وہ گھبرا کر جنگل کی طرف نکلے، وہاں دھوپ کی شدت اور نیچے سے گرم زمین نے ان کے پاؤں کی کھال اتار دی، پھر ایک سیاہ بادل سائبان کی شکل میں نمودار ہوا، وہ سارے کے سارے خوشی کے مارے اس کے سائے میں جمع ہو گئے، اس وقت اچانک بادل سے آگ برسنا شروع ہوئی جس سے سب ہلاک ہو گئے۔ مگر ہم مفسرین کی اس تفصیل کو نہ سچا کہتے ہیں نہ جھوٹا، کیونکہ یہ نہ قرآن مجید سے ثابت ہے نہ صحیح حدیث سے۔"
    },
    {
      "ayah": 190,
      "tafsir": "(آیت 191،190) { اِنَّ فِيْ ذٰلِكَ لَاٰيَةً … :} اس سورت میں سات انبیاء کے واقعات میں سے ہر ایک کے آخر میں یہ الفاظ آئے ہیں، ان سے مقصود نبی کریم صلی اللہ علیہ وسلمکو تسلی دینا اور جھٹلانے والوں کو متنبہ کرنا ہے کہ ان میں سے ہر واقعہ میں ایک عظیم نشانی ہے کہ اللہ کے رسولوں کو جھٹلانے والوں کا انجام کیا ہوتا ہے۔ بار بار دہرانے سے بات زیادہ مؤثر ہو جاتی ہے۔"
    },
    {
      "ayah": 191,
      "tafsir": "(آیت 191،190) { اِنَّ فِيْ ذٰلِكَ لَاٰيَةً … :} اس سورت میں سات انبیاء کے واقعات میں سے ہر ایک کے آخر میں یہ الفاظ آئے ہیں، ان سے مقصود نبی کریم صلی اللہ علیہ وسلمکو تسلی دینا اور جھٹلانے والوں کو متنبہ کرنا ہے کہ ان میں سے ہر واقعہ میں ایک عظیم نشانی ہے کہ اللہ کے رسولوں کو جھٹلانے والوں کا انجام کیا ہوتا ہے۔ بار بار دہرانے سے بات زیادہ مؤثر ہو جاتی ہے۔"
    },
    {
      "ayah": 192,
      "tafsir": "(آیت 192) ➊ { وَ اِنَّهٗ لَتَنْزِيْلُ رَبِّ الْعٰلَمِيْنَ :} شروع سورت میں تمہیداً قرآن کے ذکر سے مقصود رسول اللہ صلی اللہ علیہ وسلمکی رسالت و نبوت کو ثابت کرنا تھا، پھر جھٹلانے والوں کو دھمکی دی اور اس سلسلہ میں انبیاء کے سات قصے بیان فرمائے، تاکہ آپ صلی اللہ علیہ وسلمکو تسلی ہو اور آپ کو جھٹلانے والے عبرت حاصل کریں۔ اب یہاں سے پھر رسالت کا اثبات شروع کیا اور آپ کی نبوت کے حق ہونے کے دلائل اور کفار کے شبہات کے جواب آخر سورت تک چلے گئے ہیں۔ (کبیر، قرطبی) ¤ ➋ {’’ تَنْزِيْلٌ‘‘} مصدر ہے جو اسم مفعول کے معنی میں ہے، نازل کیا ہوا۔ کفار قرآن کے وحی الٰہی ہونے کا انکار کرتے تھے، اس لیے وہ نبی صلی اللہ علیہ وسلم کی رسالت کے بھی منکر تھے۔ اللہ تعالیٰ نے اس سورت کا آغاز یہ کہہ کر فرمایا کہ یہ کتاب مبین کی آیات ہیں، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم کو تسلی دینے کے لیے اور کفار کو کفر کے انجام بد سے ڈرانے کے لیے انبیائے کرام علیھم السلام کے سات قصّے بیان فرمائے، جو اس بات کی واضح دلیل ہیں کہ یہ قرآن یقینا وحی الٰہی ہے اور آپ صلی اللہ علیہ وسلم اللہ کے سچے رسول ہیں، کیونکہ اگر ایسا نہ ہوتا تو یہ رسول، جو نہ پڑھ سکتا ہے نہ لکھ سکتا ہے، گزشتہ انبیاء اور قوموں کے واقعات کیسے بیان کر سکتا تھا۔ بلاغت کا قاعدہ ہے کہ انکار جتنا شدید ہو بات اتنی ہی تاکید سے کی جاتی ہے۔ اس لیے نہایت تاکید کے ساتھ فرمایا کہ بے شک یہ یقینا رب العالمین کا نازل کیا ہوا ہے، نہ محمد( صلی اللہ علیہ وسلم) نے اسے خود تصنیف کیا ہے، نہ کسی اور انسان یا جن کا گھڑا ہوا ہے۔"
    },
    {
      "ayah": 193,
      "tafsir": "(آیت 193) {نَزَلَ بِهِ الرُّوْحُ الْاَمِيْنُ : ’’ الرُّوْحُ ‘‘} سے مراد فرشتہ ہے، اسے ’’روح‘‘ اس لیے کہا گیا ہے کہ فرشتے عالم اجسام کے بجائے عالم ارواح سے تعلق رکھتے ہیں۔ (ابن عاشور) {’’ الْاَمِيْنُ ‘‘} نہایت امانت دار، اس سے مراد جبریل علیہ السلام ہیں، کیونکہ اللہ تعالیٰ نے انھیں انبیاء تک اپنا پیغام پہنچانے کے لیے امین قرار دیا ہے۔ ان کی یہ صفت اور دوسری صفات سورۂ تکویر (۱۹ تا ۲۱) میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 194,
      "tafsir": "(آیت 194) ➊ { عَلٰى قَلْبِكَ:} دوسری جگہ فرمایا : «{ قُلْ مَنْ كَانَ عَدُوًّا لِّجِبْرِيْلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰى قَلْبِكَ بِاِذْنِ اللّٰهِ }» [ البقرۃ : ۹۷ ] ’’کہہ دے جو کوئی جبریل کا دشمن ہو تو بے شک اس نے یہ کتاب تیرے دل پر اللہ کے حکم سے اتاری ہے۔‘‘ یعنی اس قرآن مجید کو جبریل علیہ السلام نے کانوں کے ذریعے سے آپ کو سنانے کے بجائے آپ کے دل پر نازل کیا ہے۔ اگرچہ کانوں نے بھی دل ہی کو بات پہنچانی ہے، مگر بلاواسطہ دل پر نازل کرنے کا مقصد یہ ہے کہ اسے سمجھنے میں اور یاد رکھنے میں کوئی کمی نہ رہے، جیسا کہ فرمایا : «{ سَنُقْرِئُكَ فَلَا تَنْسٰۤى (6) اِلَّا مَا شَآءَ اللّٰهُ }» [ الأعلٰی : ۶، ۷ ] ’’ہم ضرور تجھے پڑھائیں گے تو تُو نہیں بھولے گا، مگر جو اللہ چاہے۔‘‘ اور دیکھیے سورۂ قیامہ (۱۶ تا ۱۹)۔ ¤ ➋ { لِتَكُوْنَ مِنَ الْمُنْذِرِيْنَ :} یہ کہنے کے بجائے کہ ’’تاکہ تو ڈرانے والا بن جائے‘‘ فرمایا ’’تاکہ تو انبیاء و رسل کی عظیم الشان جماعت میں شامل ہو جائے‘‘ کیونکہ اس میں آپ کی زیادہ عظمت کا اظہار ہے۔ اگرچہ رسول ’’نذیر‘‘ بھی ہوتے ہیں اور ’’بشیر‘‘ بھی، مگر یہاں ’’منذر‘‘ ہونے کا ذکر اس لیے فرمایا کہ اس سورت کا سارا بیان ہی انبیاء کے اپنی اقوام کو ڈرانے پر مشتمل ہے اور جیسا کہ پہلے گزرا کہ جب تک کسی شخص یا قوم کو اپنے غلط راستے پر چلنے کے خوفناک نتائج سے آگاہ نہ کیا جائے اس کا راہِ راست پر آنا مشکل ہوتا ہے، اس لیے ہر پیغمبر نے اپنی بات کا آغاز {’’ اَلَا تَتَّقُوْنَ ‘‘} سے فرمایا۔"
    },
    {
      "ayah": 195,
      "tafsir": "(آیت 195) ➊ { بِلِسَانٍ عَرَبِيٍّ:} معلوم ہوا کہ نبی صلی اللہ علیہ وسلم پر صرف قرآن مجید کے مفہوم و معانی نازل نہیں ہوئے کہ آپ نے انھیں الفاظ کا جامہ پہنایا ہو، بلکہ یہ عربی زبان کے الفاظ کی صورت میں آپ پر نازل ہوا ہے۔ بعض لوگ اللہ تعالیٰ کے الفاظ کے ساتھ کلام کرنے کے منکر ہیں، یہ آیت اور دوسری بہت سی آیات ان کا رد کرتی ہیں۔ حقیقت یہ ہے کہ یہ عربی زبان میں اللہ تعالیٰ کا معجز کلام ہے جو اللہ تعالیٰ کا امتیاز ہے، ساری مخلوق جمع ہو کر بھی صرف معانی ہی نہیں اس کے الفاظ کی مثال لانے سے بھی عاجز ہے۔ ¤ ➋ { مُبِيْنٍ :} یعنی منکرین کا اس پر ایمان نہ لانا اس کے بیان میں کسی خامی کی وجہ سے نہیں بلکہ خود ان کی نااہلی یا ہٹ دھرمی کی وجہ سے ہے، کیونکہ یہ تمام زبانوں سے فصیح زبان عربی میں ہے اور اس عربی میں جو معمے یا پہیلی کی زبان نہیں بلکہ ’’عربی مبین‘‘ ہے، اس میں کوئی ایسا لفظ یا ایسی ترکیب نہیں جو عرب میں کثرت سے مستعمل نہ ہو، یا معنی کی ادائیگی میں اس کے اندر کوئی کمی ہو۔ جو لوگ اس پر ایمان نہیں لا رہے ان کے پاس یہ عذر ہر گز نہیں کہ ہم اسے سمجھ نہیں سکے۔"
    },
    {
      "ayah": 196,
      "tafsir": "(آیت 196) {وَ اِنَّهٗ لَفِيْ زُبُرِ الْاَوَّلِيْنَ:’’ زُبُرِ ‘‘ ’’زَبُوْرٌ‘‘} کی جمع ہے، جس کاا معنی کتاب ہے، جیسا کہ فرمایا : «{ وَ كُلُّ شَيْءٍ فَعَلُوْهُ فِي الزُّبُرِ }» [ القمر : ۵۲ ] ’’اور ہر چیز جسے انھوں نے کیا، وہ دفتروں میں درج ہے۔‘‘ اس آیت میں دو مفہوم شامل ہیں، ایک یہ کہ اس قرآن میں جو احکام و تعلیمات ہیں وہ پہلے انبیاء و رسل کی کتابوں میں بھی موجود ہیں۔ سب کتابیں اللہ کی توحید، آخرت، اس کے رسولوں پر ایمان اور ان کی اطاعت کے حکم پر مشتمل ہیں اور سب میں شرک اور اللہ اور اس کے رسولوں کی نافرمانی سے منع کیا گیا ہے، لہٰذا یہ کتاب کوئی انوکھی یا پہلی کتابوں سے الگ تعلیمات پر مشتمل نہیں ہے۔ ¤ دوسرا مفہوم یہ ہے کہ اس قرآن کا تذکرہ پہلی کتابوں میں بھی موجود ہے، کیونکہ ان میں واضح الفاظ میں اس قرآن کو لانے والے پیغمبر کی آمد کی بشارت دی گئی ہے، جیسا کہ فرمایا : «{ الَّذِيْ يَجِدُوْنَهٗ مَكْتُوْبًا عِنْدَهُمْ فِي التَّوْرٰىةِ وَ الْاِنْجِيْلِ }» [الأعراف : ۱۵۷ ] ’’وہ جس کو وہ اپنے ہاں تورات اور انجیل میں لکھا ہوا پاتے ہیں۔‘‘ اور عیسیٰ علیہ السلام نے اپنے ایک خطبہ میں فرمایا : «{ وَ مُبَشِّرًۢا بِرَسُوْلٍ يَّاْتِيْ مِنْۢ بَعْدِي اسْمُهٗۤ اَحْمَدُ }» [ الصف : ۶ ] ’’اور میں ایک رسول کی بشارت دیتا ہوں جو میرے بعد آئے گا جس کا نام احمد ہے۔‘‘ تورات و انجیل کے حوالوں کے لیے مذکورہ بالا آیات کی تفسیر ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 197,
      "tafsir": "(آیت 197) {اَوَ لَمْ يَكُنْ لَّهُمْ اٰيَةً …:} یعنی کیا مشرکین مکہ کے یہ جاننے کے لیے کہ قرآن واقعی اللہ کی طرف سے نازل شدہ اور پہلی کتابوں میں مذکور ہے اور یہ کہ محمد صلی اللہ علیہ وسلم نبی آخر الزماں ہیں، یہ بات کافی نہیں کہ بنی اسرائیل کے علماء اس سے واقف ہیں، جیسا کہ ان حضرات کی شہادت سے معلوم ہوا جو ان میں سے ایمان لائے، مثلاً عبد اللہ بن سلام اور سلمان فارسی رضی اللہ عنھما اور جیسا کہ ان میں سے بعض علانیہ اور بعض اپنی خصوصی مجلسوں میں اس کا ذکر کرتے ہیں، گو اپنی بعض مصلحتوں کی وجہ سے ایمان نہیں لائے۔ اہلِ کتاب کی شہادت مشرکین مکہ کے ہاں اس لیے حجت قرار پاتی ہے کہ وہ پچھلی کتابوں کے بارے میں معلومات حاصل کرنے کے لیے انھی کی طرف رجوع کرتے تھے اور جو بات وہ کہتے تھے اسے صحیح تسلیم کرتے تھے۔ نجاشی اور اس کے درباریوں نے جعفر رضی اللہ عنہ سے سورۂ مریم کی آیات سن کر ان کے حق ہونے کا برملا اقرار کیا تھا۔ دیکھیے سورۂ مائدہ (۸۳)، مزید دیکھیے قصص (۵۲، ۵۳) آیت میں لفظ {’’ اٰيَةً ‘‘ ’’ لَمْ يَكُنْ ‘‘} کی خبر ہے اور {’’ اَنْ يَّعْلَمَهٗ … ‘‘} بتاویل مصدر اس کا اسم مؤخر ہے۔ (قرطبی، شوکانی)"
    },
    {
      "ayah": 198,
      "tafsir": "(آیت 199،198) { وَ لَوْ نَزَّلْنٰهُ عَلٰى بَعْضِ الْاَعْجَمِيْنَ… : ’’ الْاَعْجَمِيْنَ ‘‘ ’’أَعْجَمُ‘‘} کی جمع ہے، گونگا یا جو سرے سے عربی نہ جانتا ہو، انسان ہو یا جانور۔ {’’أَعْجَمِيٌّ‘‘} کا بھی یہی معنی ہے، اس میں یائے نسبت تاکید کے لیے زیادہ کی گئی ہے۔ ان آیات میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی گئی ہے کہ ان لوگوں کے ایمان نہ لانے کی وجہ اس کے سوا کچھ نہیں کہ انھوں نے طے کر رکھا ہے کہ وہ اس پر ایمان لائیں گے ہی نہیں، اس لیے آپ ان کے ایمان نہ لانے پر غم زدہ نہ ہوں۔ اگر اب یہ لوگ ایک عربی رسول پر نازل ہونے کی وجہ سے اس قرآن پر ایمان نہیں لا رہے، حالانکہ یہ عظیم ترین معجزہ ہے، جس کی ایک سورت کی مثال بھی وہ نہیں لا سکے، یہ کہہ کر کہ اس نے خود اسے تصنیف کر لیا ہے، تو اگر ہم اس فصیح و بلیغ ترین عربی کلام کو کسی عجمی پر نازل کرتے، جو عربی زبان کا ایک لفظ بھی نہ جانتا ہوتا اور وہ اسے ان کے سامنے پڑھتا، جس سے وہ اس کے من جانب اللہ ہونے کا انکار کر ہی نہ سکتے، پھر بھی یہ لوگ اپنے شدید عناد کی وجہ سے ایمان نہ لاتے، بلکہ اسے جادو کہہ کر یا کوئی اور بہانہ بنا کر جھٹلا دیتے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اِنَّ الَّذِيْنَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِنُوْنَ (96) وَ لَوْ جَآءَتْهُمْ كُلُّ اٰيَةٍ حَتّٰى يَرَوُا الْعَذَابَ الْاَلِيْمَ }» [ یونس : ۹۶، ۹۷ ] ’’بے شک وہ لوگ جن پر تیرے رب کی بات ثابت ہوچکی، وہ ایمان نہیں لائیں گے، خواہ ان کے پاس ہر نشانی آ جائے، یہاں تک کہ دردناک عذاب دیکھ لیں۔‘‘ مزید دیکھیے سورۂ حجر (۱۴، ۱۵) اور انعام (۱۱۱)۔"
    },
    {
      "ayah": 199,
      "tafsir": "(آیت 199،198) { وَ لَوْ نَزَّلْنٰهُ عَلٰى بَعْضِ الْاَعْجَمِيْنَ… : ’’ الْاَعْجَمِيْنَ ‘‘ ’’أَعْجَمُ‘‘} کی جمع ہے، گونگا یا جو سرے سے عربی نہ جانتا ہو، انسان ہو یا جانور۔ {’’أَعْجَمِيٌّ‘‘} کا بھی یہی معنی ہے، اس میں یائے نسبت تاکید کے لیے زیادہ کی گئی ہے۔ ان آیات میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی گئی ہے کہ ان لوگوں کے ایمان نہ لانے کی وجہ اس کے سوا کچھ نہیں کہ انھوں نے طے کر رکھا ہے کہ وہ اس پر ایمان لائیں گے ہی نہیں، اس لیے آپ ان کے ایمان نہ لانے پر غم زدہ نہ ہوں۔ اگر اب یہ لوگ ایک عربی رسول پر نازل ہونے کی وجہ سے اس قرآن پر ایمان نہیں لا رہے، حالانکہ یہ عظیم ترین معجزہ ہے، جس کی ایک سورت کی مثال بھی وہ نہیں لا سکے، یہ کہہ کر کہ اس نے خود اسے تصنیف کر لیا ہے، تو اگر ہم اس فصیح و بلیغ ترین عربی کلام کو کسی عجمی پر نازل کرتے، جو عربی زبان کا ایک لفظ بھی نہ جانتا ہوتا اور وہ اسے ان کے سامنے پڑھتا، جس سے وہ اس کے من جانب اللہ ہونے کا انکار کر ہی نہ سکتے، پھر بھی یہ لوگ اپنے شدید عناد کی وجہ سے ایمان نہ لاتے، بلکہ اسے جادو کہہ کر یا کوئی اور بہانہ بنا کر جھٹلا دیتے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اِنَّ الَّذِيْنَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِنُوْنَ (96) وَ لَوْ جَآءَتْهُمْ كُلُّ اٰيَةٍ حَتّٰى يَرَوُا الْعَذَابَ الْاَلِيْمَ }» [ یونس : ۹۶، ۹۷ ] ’’بے شک وہ لوگ جن پر تیرے رب کی بات ثابت ہوچکی، وہ ایمان نہیں لائیں گے، خواہ ان کے پاس ہر نشانی آ جائے، یہاں تک کہ دردناک عذاب دیکھ لیں۔‘‘ مزید دیکھیے سورۂ حجر (۱۴، ۱۵) اور انعام (۱۱۱)۔"
    },
    {
      "ayah": 200,
      "tafsir": "(آیت 201،200) {كَذٰلِكَ سَلَكْنٰهُ فِيْ قُلُوْبِ الْمُجْرِمِيْنَ … : ’’سَلَكَ يَسْلُكُ‘‘} پرونا، سوئی میں دھاگا داخل کرنا، کسی چیز کو دوسری کے اندر گھسا دینا۔ {’’ سَلَكْنٰهُ ‘‘} میں {’’هٗ‘‘} کی ضمیر اس انکار اور تکذیب کی طرف جا رہی ہے جس کا ذکر پچھلی آیت {’’ مَّا كَانُوْا بِهٖ مُؤْمِنِيْنَ ‘‘} میں ہے، یعنی ہم نے اس ایمان نہ لانے کو ان مجرموں کے جرائم کی پاداش میں ان کے دلوں کے اندر اس طرح داخل کر دیا ہے جس طرح سوئی میں دھاگا داخل کر دیا جاتا ہے۔ اب یہ لوگ اس پر ایمان نہیں لائیں گے، حتیٰ کہ {’’عذاب اليم‘‘} دیکھ لیں۔ اس میں بھی رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی ہے کہ ان لوگوں نے ایمان لانا ہی نہیں تو ان پر آپ غم زدہ کیوں ہوتے ہیں۔ آیت کے سیاق کے لحاظ سے یہی معنی راجح ہے۔ ¤ بعض مفسرین نے {’’ سَلَكْنٰهُ ‘‘} میں {’’هُ‘‘ } کی ضمیر کا مرجع قرآن کو قرار دیا ہے۔ انھوں نے اس کی تفسیر یہ کی ہے کہ قرآن کا حق ہونا تو ان کے دلوں میں اتار دیا گیا ہے مگر ان کی ہٹ دھرمی کا یہ حال ہے کہ…۔ (اشرف الحواشی) بعض نے اس کا مرجع قرآن کو قرار دے کر اس کی تفسیر اس طرح کی ہے : ’’یعنی یہ اہلِ حق کے دلوں کی طرح تسکینِ روح اور شفائے قلب بن کر ان کے اندر نہیں اترتا، بلکہ ایک گرم لوہے کی سلاخ بن کر اس طرح گزرتا ہے کہ وہ سیخ پا ہو جاتے ہیں اور اس کے مضامین پر غور کرنے کے بجائے اس کی تردید کے لیے حربے ڈھونڈنے لگ جاتے ہیں۔‘‘ (تفہیم القرآن)"
    },
    {
      "ayah": 201,
      "tafsir": "(آیت 201،200) {كَذٰلِكَ سَلَكْنٰهُ فِيْ قُلُوْبِ الْمُجْرِمِيْنَ … : ’’سَلَكَ يَسْلُكُ‘‘} پرونا، سوئی میں دھاگا داخل کرنا، کسی چیز کو دوسری کے اندر گھسا دینا۔ {’’ سَلَكْنٰهُ ‘‘} میں {’’هٗ‘‘} کی ضمیر اس انکار اور تکذیب کی طرف جا رہی ہے جس کا ذکر پچھلی آیت {’’ مَّا كَانُوْا بِهٖ مُؤْمِنِيْنَ ‘‘} میں ہے، یعنی ہم نے اس ایمان نہ لانے کو ان مجرموں کے جرائم کی پاداش میں ان کے دلوں کے اندر اس طرح داخل کر دیا ہے جس طرح سوئی میں دھاگا داخل کر دیا جاتا ہے۔ اب یہ لوگ اس پر ایمان نہیں لائیں گے، حتیٰ کہ {’’عذاب اليم‘‘} دیکھ لیں۔ اس میں بھی رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی ہے کہ ان لوگوں نے ایمان لانا ہی نہیں تو ان پر آپ غم زدہ کیوں ہوتے ہیں۔ آیت کے سیاق کے لحاظ سے یہی معنی راجح ہے۔ ¤ بعض مفسرین نے {’’ سَلَكْنٰهُ ‘‘} میں {’’هُ‘‘ } کی ضمیر کا مرجع قرآن کو قرار دیا ہے۔ انھوں نے اس کی تفسیر یہ کی ہے کہ قرآن کا حق ہونا تو ان کے دلوں میں اتار دیا گیا ہے مگر ان کی ہٹ دھرمی کا یہ حال ہے کہ…۔ (اشرف الحواشی) بعض نے اس کا مرجع قرآن کو قرار دے کر اس کی تفسیر اس طرح کی ہے : ’’یعنی یہ اہلِ حق کے دلوں کی طرح تسکینِ روح اور شفائے قلب بن کر ان کے اندر نہیں اترتا، بلکہ ایک گرم لوہے کی سلاخ بن کر اس طرح گزرتا ہے کہ وہ سیخ پا ہو جاتے ہیں اور اس کے مضامین پر غور کرنے کے بجائے اس کی تردید کے لیے حربے ڈھونڈنے لگ جاتے ہیں۔‘‘ (تفہیم القرآن)"
    },
    {
      "ayah": 202,
      "tafsir": "(آیت 203،202) {فَيَاْتِيَهُمْ بَغْتَةً وَّ هُمْ لَا يَشْعُرُوْنَ …:} یعنی وہ اس پر ایمان نہیں لائیں گے یہاں تک وہ ’’عذاب اليم‘‘ کو دیکھ لیں، جو ان پر اچانک آئے اور وہ سوچتے بھی نہ ہوں، پھر وہ یہ کہیں کہ کیا ہم مہلت دیے جانے والے ہیں کہ ہم ایمان لائیں اور تصدیق کریں، مگر اس وقت مہلت نہیں ملے گی۔"
    },
    {
      "ayah": 203,
      "tafsir": "(آیت 203،202) {فَيَاْتِيَهُمْ بَغْتَةً وَّ هُمْ لَا يَشْعُرُوْنَ …:} یعنی وہ اس پر ایمان نہیں لائیں گے یہاں تک وہ ’’عذاب اليم‘‘ کو دیکھ لیں، جو ان پر اچانک آئے اور وہ سوچتے بھی نہ ہوں، پھر وہ یہ کہیں کہ کیا ہم مہلت دیے جانے والے ہیں کہ ہم ایمان لائیں اور تصدیق کریں، مگر اس وقت مہلت نہیں ملے گی۔"
    },
    {
      "ayah": 204,
      "tafsir": "(آیت 204) {اَفَبِعَذَابِنَا يَسْتَعْجِلُوْنَ:} یعنی عذاب آئے گا تو مہلت کا مطالبہ کریں گے اور آج مہلت ملی ہوئی ہے تو عذاب کا مطالبہ کرتے ہیں، کبھی کہتے ہیں : «{ فَاَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَآءِ }» [ الأنفال : ۳۲ ] ’’تو ہم پر آسمان سے پتھر برسا۔‘‘ کبھی کہتے ہیں : «{ فَاَسْقِطْ عَلَيْنَا كِسَفًا مِّنَ السَّمَآءِ }» [ الشعراء : ۱۸۷ ] ’’سو ہم پر آسمان سے کچھ ٹکڑے گرا دے۔‘‘ کبھی کہتے ہیں : «{ اَوْ تَاْتِيَ بِاللّٰهِ وَ الْمَلٰٓىِٕكَةِ قَبِيْلًا }» [ بني إسرائیل : ۹۲ ] ’’یا تو اللہ اور فرشتوں کو سامنے لے آئے۔‘‘ کبھی کہتے ہیں : «{ مَتٰى هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ }» [ یونس : ۴۸ ] ’’یہ وعدہ کب (پورا) ہوگا، اگر تم سچے ہو۔‘‘"
    },
    {
      "ayah": 205,
      "tafsir": "(آیت 205تا207) ➊ {اَفَرَءَيْتَ اِنْ مَّتَّعْنٰهُمْ سِنِيْنَ …:} ان کا عذاب جلدی لانے کا مطالبہ کرنے سے ظاہر ہے کہ وہ اس کے آنے پر ایمان نہیں رکھتے اور بہت دیر تک زندہ رہنے کی امید رکھتے ہیں، اسی لیے وہ اسے جلدی طلب کرتے اور اس کا مذاق اڑاتے ہیں۔ فرمایا، یہ بتاؤ کہ اگر ہم ان کی توقع کے مطابق کچھ سال انھیں زندہ رہنے اور فائدہ اٹھانے کا موقع دے دیں، پھر ان پر عذاب آئے یا موت ہی آ جائے جس کے بعد عذاب ہی عذاب ہے، تو جتنے سال انھیں زندہ رہنے کا اور زندگی سے فائدہ اٹھانے کا موقع دیا جاتا رہا وہ عذاب سے بچانے میں ان کے کس کام آئے گا؟ (دیکھیے بقرہ : ۹۶) وہ گزرا ہوا سارا عرصہ تو ایک ساعت سے زیادہ معلوم نہیں ہو گا۔ (دیکھیے روم : ۵۵) اور رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق دنیا کے سب سے خوش حال کافر کو جہنم کا ایک غوطہ دلانے کے بعد پوچھا جائے گا کہ تو نے کبھی خیر دیکھی ہے تو وہ قسم اٹھا کر کہے گا کہ نہیں۔ [ دیکھیے مسلم، صفات المنافقین، باب صبغ أنعم أھل الدنیا في النار : ۲۸۰۷، عن أنس رضی اللہ عنہ ] تفسیر کبیر میں ہے کہ میمون بن مہران طواف میں حسن بصری سے ملے اور نصیحت کی درخواست کی تو انھوں نے صرف اس آیت کی تلاوت کر دی، تو میمون نے کہا، آپ نے نصیحت کی اور کمال کی نصیحت کی۔ ¤ ➋ { ’’ سِنِيْنَ ‘‘} جمع مذکر سالم نکرہ قلت کے لیے استعمال ہوا ہے، یعنی جتنی لمبی زندگی بھی مل جائے وہ چند سال ہی ہیں، کیونکہ گزر جانے والی چیز قلیل ہی ہوتی ہے۔"
    },
    {
      "ayah": 206,
      "tafsir": "(آیت 205تا207) ➊ {اَفَرَءَيْتَ اِنْ مَّتَّعْنٰهُمْ سِنِيْنَ …:} ان کا عذاب جلدی لانے کا مطالبہ کرنے سے ظاہر ہے کہ وہ اس کے آنے پر ایمان نہیں رکھتے اور بہت دیر تک زندہ رہنے کی امید رکھتے ہیں، اسی لیے وہ اسے جلدی طلب کرتے اور اس کا مذاق اڑاتے ہیں۔ فرمایا، یہ بتاؤ کہ اگر ہم ان کی توقع کے مطابق کچھ سال انھیں زندہ رہنے اور فائدہ اٹھانے کا موقع دے دیں، پھر ان پر عذاب آئے یا موت ہی آ جائے جس کے بعد عذاب ہی عذاب ہے، تو جتنے سال انھیں زندہ رہنے کا اور زندگی سے فائدہ اٹھانے کا موقع دیا جاتا رہا وہ عذاب سے بچانے میں ان کے کس کام آئے گا؟ (دیکھیے بقرہ : ۹۶) وہ گزرا ہوا سارا عرصہ تو ایک ساعت سے زیادہ معلوم نہیں ہو گا۔ (دیکھیے روم : ۵۵) اور رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق دنیا کے سب سے خوش حال کافر کو جہنم کا ایک غوطہ دلانے کے بعد پوچھا جائے گا کہ تو نے کبھی خیر دیکھی ہے تو وہ قسم اٹھا کر کہے گا کہ نہیں۔ [ دیکھیے مسلم، صفات المنافقین، باب صبغ أنعم أھل الدنیا في النار : ۲۸۰۷، عن أنس رضی اللہ عنہ ] تفسیر کبیر میں ہے کہ میمون بن مہران طواف میں حسن بصری سے ملے اور نصیحت کی درخواست کی تو انھوں نے صرف اس آیت کی تلاوت کر دی، تو میمون نے کہا، آپ نے نصیحت کی اور کمال کی نصیحت کی۔ ¤ ➋ { ’’ سِنِيْنَ ‘‘} جمع مذکر سالم نکرہ قلت کے لیے استعمال ہوا ہے، یعنی جتنی لمبی زندگی بھی مل جائے وہ چند سال ہی ہیں، کیونکہ گزر جانے والی چیز قلیل ہی ہوتی ہے۔"
    },
    {
      "ayah": 207,
      "tafsir": "(آیت 205تا207) ➊ {اَفَرَءَيْتَ اِنْ مَّتَّعْنٰهُمْ سِنِيْنَ …:} ان کا عذاب جلدی لانے کا مطالبہ کرنے سے ظاہر ہے کہ وہ اس کے آنے پر ایمان نہیں رکھتے اور بہت دیر تک زندہ رہنے کی امید رکھتے ہیں، اسی لیے وہ اسے جلدی طلب کرتے اور اس کا مذاق اڑاتے ہیں۔ فرمایا، یہ بتاؤ کہ اگر ہم ان کی توقع کے مطابق کچھ سال انھیں زندہ رہنے اور فائدہ اٹھانے کا موقع دے دیں، پھر ان پر عذاب آئے یا موت ہی آ جائے جس کے بعد عذاب ہی عذاب ہے، تو جتنے سال انھیں زندہ رہنے کا اور زندگی سے فائدہ اٹھانے کا موقع دیا جاتا رہا وہ عذاب سے بچانے میں ان کے کس کام آئے گا؟ (دیکھیے بقرہ : ۹۶) وہ گزرا ہوا سارا عرصہ تو ایک ساعت سے زیادہ معلوم نہیں ہو گا۔ (دیکھیے روم : ۵۵) اور رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق دنیا کے سب سے خوش حال کافر کو جہنم کا ایک غوطہ دلانے کے بعد پوچھا جائے گا کہ تو نے کبھی خیر دیکھی ہے تو وہ قسم اٹھا کر کہے گا کہ نہیں۔ [ دیکھیے مسلم، صفات المنافقین، باب صبغ أنعم أھل الدنیا في النار : ۲۸۰۷، عن أنس رضی اللہ عنہ ] تفسیر کبیر میں ہے کہ میمون بن مہران طواف میں حسن بصری سے ملے اور نصیحت کی درخواست کی تو انھوں نے صرف اس آیت کی تلاوت کر دی، تو میمون نے کہا، آپ نے نصیحت کی اور کمال کی نصیحت کی۔ ¤ ➋ { ’’ سِنِيْنَ ‘‘} جمع مذکر سالم نکرہ قلت کے لیے استعمال ہوا ہے، یعنی جتنی لمبی زندگی بھی مل جائے وہ چند سال ہی ہیں، کیونکہ گزر جانے والی چیز قلیل ہی ہوتی ہے۔"
    },
    {
      "ayah": 208,
      "tafsir": "(آیت 209،208) {وَ مَاۤ اَهْلَكْنَا مِنْ قَرْيَةٍ اِلَّا لَهَا مُنْذِرُوْنَ…:} یعنی ہم نے جو بستی بھی ہلاک کی اس کی طرف خبردار کرنے اور ڈرانے والے بھیجے، تاکہ وہ انھیں نصیحت کریں اور یاد دہانی کروائیں، پھر جب انھوں نے ان کی نصیحت قبول نہیں کی، نہ یاد دہانی کی پروا کی تو ہم نے انھیں ہلاک کر دیا۔ ظاہر ہے کہ یہ ہماری طرف سے ان پر کوئی ظلم نہ تھا، ظلم اس وقت ہوتا جب ہم پہلے نصیحت نہ کرتے اور خبردار نہ کرتے۔ پہلی آیت کے مضمون کے لیے دیکھیے سورۂ بنی اسرائیل (۱۵) اور قصص (۵۹) اور دوسری آیت کے مضمون کے لیے دیکھیے سورۂ یونس (۴۴) اور نساء (۴۰)۔"
    },
    {
      "ayah": 209,
      "tafsir": "(آیت 209،208) {وَ مَاۤ اَهْلَكْنَا مِنْ قَرْيَةٍ اِلَّا لَهَا مُنْذِرُوْنَ…:} یعنی ہم نے جو بستی بھی ہلاک کی اس کی طرف خبردار کرنے اور ڈرانے والے بھیجے، تاکہ وہ انھیں نصیحت کریں اور یاد دہانی کروائیں، پھر جب انھوں نے ان کی نصیحت قبول نہیں کی، نہ یاد دہانی کی پروا کی تو ہم نے انھیں ہلاک کر دیا۔ ظاہر ہے کہ یہ ہماری طرف سے ان پر کوئی ظلم نہ تھا، ظلم اس وقت ہوتا جب ہم پہلے نصیحت نہ کرتے اور خبردار نہ کرتے۔ پہلی آیت کے مضمون کے لیے دیکھیے سورۂ بنی اسرائیل (۱۵) اور قصص (۵۹) اور دوسری آیت کے مضمون کے لیے دیکھیے سورۂ یونس (۴۴) اور نساء (۴۰)۔"
    },
    {
      "ayah": 210,
      "tafsir": "(آیت 210) {وَ مَا تَنَزَّلَتْ بِهِ الشَّيٰطِيْنُ :} یہ ذکر کرنے کے بعد کہ یہ قرآن رب العالمین کا نازل کردہ ہے، جسے جبریل امین لے کر آپ کے دل پر اترا ہے، اب ان لوگوں کی تردید فرمائی جو کہتے تھے کہ محمد صلی اللہ علیہ وسلم کے پاس یہ وحی شیطان لاتے ہیں، جیسا کہ جندب بن عبداللہ رضی اللہ عنہ بیان کرتے ہیں کہ ایک دفعہ جبریل علیہ السلام کی آمد رک گئی تو قریش کی ایک عورت کہنے لگی : {’’أَبْطَأَ عَلَيْهِ شَيْطَانُهُ‘‘} ’’اس کے شیطان نے اس کے پاس آنے میں دیر کر دی ہے۔‘‘ تو اس پر یہ آیات اتریں : «{ وَ الضُّحٰى (1) وَ الَّيْلِ اِذَا سَجٰى (2) مَا وَدَّعَكَ رَبُّكَ وَ مَا قَلٰى }» [ الضحٰی : ۱ تا ۳ ] ’’قسم ہے دھوپ چڑھنے کے وقت کی! اور رات کی جب وہ چھا جائے! نہ تیرے رب نے تجھے چھوڑا اور نہ وہ ناراض ہوا۔‘‘ [ بخاري، التہجد، باب ترک القیام للمریض : ۱۱۲۵ ] اللہ تعالیٰ فرماتے ہیں کہ اس قرآن کو لے کر شیاطین نہیں اترے کہ یہ جادو ہو یا کہانت ہو، یا شعر ہو یا اوٹ پٹانگ خواب ہوں، کیونکہ شیاطین کا سرمایہ یہی کچھ ہوتا ہے، پھر اللہ تعالیٰ نے شیاطین کے لیے اس کے ناممکن ہونے کی تین وجہیں بیان فرمائیں۔"
    },
    {
      "ayah": 211,
      "tafsir": "(آیت 211) ➊ { وَ مَا يَنْۢبَغِيْ لَهُمْ :} پہلی یہ کہ اتنا پاکیزہ کلام لے کر اترنا شیاطین کے لائئق ہی نہیں، کیونکہ قرآن سراسر خیر و برکت اور نور ہے، جبکہ شیاطین سرا سر شر و فساد اور ظلمت سے بھرے ہوئے ہیں، دونوں ایک دوسرے کی ضد ہیں۔ ¤ ➋ { وَ مَا يَسْتَطِيْعُوْنَ:} دوسری یہ کہ اگر ان کے لائق ہو بھی تو وہ اس جیسا کلام لانے کی طاقت ہی نہیں رکھتے، خواہ کتنی کوشش کر لیں، فرمایا : «{ قُلْ لَّىِٕنِ اجْتَمَعَتِ الْاِنْسُ وَ الْجِنُّ عَلٰۤى اَنْ يَّاْتُوْا بِمِثْلِ هٰذَا الْقُرْاٰنِ لَا يَاْتُووْنَ بِمِثْلِهٖ وَ لَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيْرًا}» [ بني إسرائیل : ۸۸ ] ’’کہہ دے اگر سب انسان اور جن جمع ہوجائیں کہ اس قرآن جیسا بنا لائیں تو اس جیسا نہیں لائیں گے، اگرچہ ان کا بعض بعض کا مددگار ہو۔‘‘"
    },
    {
      "ayah": 212,
      "tafsir": "(آیت 212) {اِنَّهُمْ عَنِ السَّمْعِ لَمَعْزُوْلُوْنَ:} تیسری وجہ یہ کہ اگر بالفرض وہ سن سنا کر لانے کی طاقت بھی رکھتے ہوں تو بارگاہ الٰہی میں ان کا دخل ہی نہیں کہ سن لیں، زیادہ سے زیادہ یہ ہو سکتا تھا کہ وہ فرشتوں سے سن کر آگے پہنچا دیں، مگر قرآن کے نزول کے وقت ان پر فرشتوں کی باہمی گفتگو سننے پر بھی پابندی لگا دی گئی، اب وہ سننے کی کوشش کرتے ہیں تو ان پر شہابوں کی بارش ہوتی ہے۔ کوئی ایک آدھ بات چوری سے سن بھی لیں تو سیکڑوں جھوٹوں کی آمیزش کی وجہ سے اس کا اعتبار نہیں رہتا۔ دیکھیے سورۂ جنّ (۸ تا ۱۰) اور صافات (۶ تا ۱۰)۔"
    },
    {
      "ayah": 213,
      "tafsir": "(آیت 213) {فَلَا تَدْعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ …:} قرآن کے حق اور منزل من اللہ ہونے کے بیان کے بعد اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو ایک اللہ کو پکارنے اور اس کے سوا کسی کو بھی نہ پکارنے کا حکم دیا اور فرمایا کہ اگر کسی اور کو پکارو گے تو عذاب دیے جانے والوں میں سے ہو جاؤ گے۔ یہ خطاب اگرچہ رسول اللہ صلی اللہ علیہ وسلم کو ہے، مگر اصل مقصود کفار و مشرکین کو متنبہ کرنا ہے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے تو نہ شرک کیا نہ کرنا تھا، آپ صلی اللہ علیہ وسلم کو اس لیے مخاطب کیا کہ سب لوگ آگاہ ہو جائیں کہ شرک اتنا بڑا گناہ ہے کہ بالفرض رسول سے سرزد ہو جائے تو اسے بھی عذاب ہو گا، پھر دوسرے لوگوں کا کیا حال ہو گا؟ جیسا کہ فرمایا : «{ وَ لَقَدْ اُوْحِيَ اِلَيْكَ وَ اِلَى الَّذِيْنَ مِنْ قَبْلِكَ لَىِٕنْ اَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَ لَتَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ }» [ الزمر : ۶۵ ] ’’اور بلاشبہ یقینا تیری طرف وحی کی گئی اور ان لوگوں کی طرف بھی جو تجھ سے پہلے تھے کہ بلاشبہ اگر تو نے شریک ٹھہرایا تو یقینا تیرا عمل ضرور ضائع ہو جائے گا اور تو ضرور بالضرور خسارہ اٹھانے والوں سے ہو جائے گا۔‘‘"
    },
    {
      "ayah": 214,
      "tafsir": "(آیت 214) {وَ اَنْذِرْ عَشِيْرَتَكَ الْاَقْرَبِيْنَ:} اور اپنے سب سے قریب رشتہ داروں کو اللہ کے عذاب سے ڈرا کہ میری قرابت پر بھروسا نہ رکھنا۔ سب سے قریب رشتہ داروں کو ڈرانے کے حکم سے ظاہر ہے کہ جو ان کے علاوہ ہیں انھیں بالاولیٰ ڈرانا ہو گا اور جب قریب ترین رشتہ داروں کو ڈرانے میں ان کی ناپسندیدگی یا ناراضی کی پروا نہیں کی جائے گی تو دوسروں کی ناراضی یا ناپسندیدگی تو اس کے مقابلے میں معمولی بات ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے اس فریضہ کو اس طرح ادا کیا جیسے اس کا حق تھا۔ ابن عباس رضی اللہ عنھما فرماتے ہیں کہ جب آیت : «{ وَ اَنْذِرْ عَشِيْرَتَكَ الْاَقْرَبِيْنَ }» اتری تو رسول اللہ صلی اللہ علیہ وسلم صفا پہاڑ پر چڑھے اور آواز دینے لگے : [ يَا بَنِيْ فِهْرٍ! يَا بَنِيْ عَدِيٍّ! لِبُطُوْنِ قُرَيْشٍ، حَتَّی اجْتَمَعُوْا، فَجَعَلَ الرَّجُلُ إِذَا لَمْ يَسْتَطِعْ أَنْ يَّخْرُجَ أَرْسَلَ رَسُوْلًا لِيَنْظُرَ مَا هُوَ، فَجَاءَ أَبُوْ لَهَبٍ وَ قُرَيْشٌ فَقَالَ أَرَأَيْتَكُمْ لَوْ أَخْبَرْتُكُمْ أَنَّ خَيْلًا بِالْوَادِيْ تُرِيْدُ أَنْ تُغِيْرَ ععَلَيْكُمْ أَ كُنْتُمْ مُصَدِّقِيَّ؟ قَالُوْا نَعَمْ مَا جَرَّبْنَا عَللَيْكَ إِلَّا صِدْقًا، قَالَ فَإِنِّيْ نَذِيْرٌ لَكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيْدٍ، فَقَالَ أَبُوْ لَهَبٍ تَبًّا لَكَ سَائِرَ الْيَوْمِ، أَ لِهٰذَا جَمَعْتَنَا؟ فَنَزَلَتْ : «{ تَبَّتْ يَدَاۤ اَبِيْ لَهَبٍ وَّ تَبَّ (1) مَاۤ اَغْنٰى عَنْهُ مَالُهٗ وَ مَا كَسَبَ }» ] [ بخاري، التفسیر، باب : «و أنذر عشیرتک الأقربین …» : ۴۷۷۰ ] ’’یا بنی فہر! یا بنی عدی!‘‘ قریش کے مختلف قبائل کو آواز دی، یہاں تک کہ وہ جمع ہو گئے، کوئی آدمی خود نہ آ سکتا تو کسی دوسرے کو بھیج دیتا، تاکہ وہ دیکھے کیا معاملہ ہے۔ غرض ابولہب اور قریش سب آ گئے تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ بتاؤ کہ اگر میں تمھیں اطلاع دوں کہ اس وادی میں ایک لشکر تم پر حملہ آور ہونا چاہتا ہے تو کیا تم مجھے سچا جانو گے؟‘‘ انھوں نے کہا : ’’ہاں! ہم نے آپ پر سچ ہی کا تجربہ کیا ہے۔‘‘ آپ نے فرمایا : ’’پھر میں تمھیں ایک شدید عذاب سے پہلے ڈرانے والا ہوں۔‘‘ تو ابو لہب نے کہا : ’’تیرے لیے سارا دن ہلاکت ہو، کیا تو نے ہمیں اسی لیے جمع کیا ہے؟‘‘ اس پر یہ سورت اتری : «{ تَبَّتْ يَدَاۤ اَبِيْ لَهَبٍ وَّ تَبَّ (1) مَاۤ اَغْنٰى عَنْهُ مَالُهٗ وَ مَا كَسَبَ }» [ اللھب : ۱، ۲ ] ¤ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ يَا بَنِيْ عَبْدِ مَنَافٍ! اشْتَرُوْا أَنْفُسَكُمْ مِنَ اللّٰهِ، يَا بَنِيْ عَبْدِ الْمُطَّلِبِ! اشْتَرُوْا أَنْفُسَكُمْ مِنَ اللّٰهِ، يَا أُمَّ الزُّبَيْرِ بْنِ الْعَوَّامِ عَمَّةَ رَسُوْلِ اللّٰهِ صَلَّي اللّٰهُ عَلَيْهِ وَ سَلَّمَ! يَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ! اشْتَرِيَا أَنْفُسَكُمَا مِنَ اللّٰهِ، لَا أَمْلِكُ لَكُمَا مِنَ اللّٰهِ شَيْئًا، سَلَانِيْ مِنْ مَالِيْ مَا شِئْتُمَا ] [ بخاري، المناقب، باب من انتسب إلی آبائہ … : ۳۵۲۷ ] ’’اے بنی عبد مناف! اپنی جانیں اللہ سے خرید لو، اے بنی عبد المطلب! اپنی جانیں اللہ سے خرید لو، اے زبیر بن عوام کی ماں اور رسول اللہ صلی اللہ علیہ وسلم کی پھوپھی (صفیہ)! اے فاطمہ بنت محمد! تم دونوں اپنی جانیں اللہ سے خرید لو، میں اللہ کے ہاں تمھارے لیے کچھ اختیار نہیں رکھتا، مجھ سے میرے مال میں سے جو چاہو مانگ لو۔‘‘ ایک روایت میں ہے کہ آپ صلی اللہ علیہ وسلم نے قریش کو اور اپنے چچا عباس کو بھی مخاطب فرمایا۔ [ دیکھیے بخاري، التفسیر، باب : «و أنذر عشیرتک… » : ۴۷۷۱ ]"
    },
    {
      "ayah": 215,
      "tafsir": "(آیت 215) {وَ اخْفِضْ جَنَاحَكَ …:} ڈرانے کی ضرورت اس کے لیے ہے جو اعراض کرے، جو پیروی اختیار کرے اس کے لیے اس کے برعکس حکم دیا، فرمایا مومنوں میں سے جو آپ کے پیچھے چلیں، اپنے ہوں یا پرائے، ان کے لیے اپنا (شفقت کا) بازو جھکا دیں، جس طرح مرغی کسی خطرے کو محسوس کرکے اپنے بچوں کو اپنے پروں میں لے لیتی ہے اسی طرح آپ بھی اے پیغمبر! ان کو اپنی رحمت و عنایت کے بازؤوں کے نیچے چھپائے رکھیں۔ نرمی کا یہ حکم ان پیچھے چلنے والوں کے لیے ہے جو مومن ہیں۔ معلوم ہوا جو لوگ قرابت کی وجہ سے آپ کا ساتھ دیتے تھے، جیسے ابوطالب، بنو ہاشم اور بنو مطلب، یا حق کو پہچاننے کی وجہ سے ساتھ دیتے تھے مگر ایمان نہیں لاتے تھے، ان کے ساتھ مومنوں والی نرمی اور شفقت کا حکم نہیں۔"
    },
    {
      "ayah": 216,
      "tafsir": "(آیت 216) {فَاِنْ عَصَوْكَ فَقُلْ …:} یعنی پھر اگر وہ تیری نافرمانی کریں، تیرے قریب ترین رشتہ دار ہوں یا کوئی اور، تو ان کے ساتھ مومنوں کے لیے نرمی والے معاملے کے بجائے ان سے الگ ہو جا اور کہہ دے کہ تم جس نافرمانی کا ارتکاب کر رہے ہو میں اس سے بری ہوں۔ ممکن ہے تیرا لاتعلقی کا اعلان ہی انھیں واپس لے آئے، یا کم از ککم تو اللہ کے ہاں بری ہو جائے۔"
    },
    {
      "ayah": 217,
      "tafsir": "(آیت 217) {وَ تَوَكَّلْ عَلَى الْعَزِيْزِ الرَّحِيْمِ :} جب ہر نافرمانی کرنے والے سے براء ت کا اعلان کرنے کا حکم دیا تو ساتھ ہی فرمایا کہ نافرمانی کرنے والے کوئی ہوں یا کتنے ہوں، تیرا کچھ نہیں بگاڑ سکتے، اس لیے سب سے بیزار ہو کر اس مالک پر بھروسا رکھ، جو عزیز (سب پر غالب) بھی ہے کہ اس کے مقابلے میں کسی کی پیش نہیں جاتی اور رحیم (بے حد رحم والا) بھی کہ اس کی بے حساب رحمت ہمیشہ اپنوں پر متوجہ رہتی ہے ۔توکل کا معنی اپنا کام اس کے سپرد کر دینا جس کے متعلق یقین ہو کہ وہ اس کے لیے کافی ہو جائے گا۔"
    },
    {
      "ayah": 218,
      "tafsir": "(آیت 218تا220) ➊ {الَّذِيْ يَرٰىكَ حِيْنَ تَقُوْمُ …:} یعنی اس عزیز و رحیم پر بھروسا رکھ جو ہر وقت تجھے دیکھ رہا ہے، اس وقت بھی جب تو کھڑا ہوتا ہے، رات قیام میں کھڑا ہو یا دعوت و جہاد کے فریضے کی ادائیگی کے لیے، یا کسی بھی کام کے لیے اور تیرے صحابہ میں تیرے گھومنے پھرنے کو بھی دیکھ رہا ہے جن کا خاص وصف ساجدین ہے، فرمایا : «{ تَرٰىهُمْ رُكَّعًا سُجَّدًا يَّبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَ رِضْوَانًا سِيْمَاهُمْ فِيْ وُجُوْهِهِمْ مِّنْ اَثَرِ السُّجُوْدِ }» [ الفتح : ۲۹ ] ’’تو انھیں اس حال میں دیکھے گا کہ رکوع کرنے والے ہیں، سجدے کرنے والے ہیں، اپنے رب کا فضل اور (اس کی) رضا ڈھونڈتے ہیں، ان کی شناخت ان کے چہروں میں (موجود) ہے۔‘‘ جب تو ان کے ساتھ باجماعت نماز کی حالت میں اپنی ہیئت بدل رہا ہوتا ہے، کبھی ان کے ساتھ سجدے میں ہوتا ہے، کبھی رکوع میں، کبھی قیام میں اور جب تو ان سجدہ گزاروں کے ساتھ دعوت یا جہاد کے کام میں پھر رہا ہوتا ہے تو تیرا رب ہر وقت تجھے دیکھ رہا ہے اور اپنے اس قیام اور پھرنے میں تو جو کچھ کہتا ہے وہ اسے سنتا ہے اور جو کچھ تو کرتا ہے اسے جانتا ہے، کیونکہ وہی سننے والا، جاننے والا ہے۔ اس لیے اس پر بھروسا رکھ جس کی نگاہ سے تو ایک لمحہ اوجھل نہیں، وہ تجھے کبھی بے سہارا نہیں چھوڑے گا۔ ¤ ➋ ان آیات میں اس بات کی طرف بھی اشارہ ہے کہ نبی صلی اللہ علیہ وسلم اور آپ کے صحابہ کی شب و روز کی مصروفیات کو جو شخص بھی غور سے دیکھے گا وہ کبھی نہیں کہہ سکتا کہ ان لوگوں کا شیطان سے کوئی تعلق ہو سکتا ہے ۔"
    },
    {
      "ayah": 219,
      "tafsir": "(آیت 218تا220) ➊ {الَّذِيْ يَرٰىكَ حِيْنَ تَقُوْمُ …:} یعنی اس عزیز و رحیم پر بھروسا رکھ جو ہر وقت تجھے دیکھ رہا ہے، اس وقت بھی جب تو کھڑا ہوتا ہے، رات قیام میں کھڑا ہو یا دعوت و جہاد کے فریضے کی ادائیگی کے لیے، یا کسی بھی کام کے لیے اور تیرے صحابہ میں تیرے گھومنے پھرنے کو بھی دیکھ رہا ہے جن کا خاص وصف ساجدین ہے، فرمایا : «{ تَرٰىهُمْ رُكَّعًا سُجَّدًا يَّبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَ رِضْوَانًا سِيْمَاهُمْ فِيْ وُجُوْهِهِمْ مِّنْ اَثَرِ السُّجُوْدِ }» [ الفتح : ۲۹ ] ’’تو انھیں اس حال میں دیکھے گا کہ رکوع کرنے والے ہیں، سجدے کرنے والے ہیں، اپنے رب کا فضل اور (اس کی) رضا ڈھونڈتے ہیں، ان کی شناخت ان کے چہروں میں (موجود) ہے۔‘‘ جب تو ان کے ساتھ باجماعت نماز کی حالت میں اپنی ہیئت بدل رہا ہوتا ہے، کبھی ان کے ساتھ سجدے میں ہوتا ہے، کبھی رکوع میں، کبھی قیام میں اور جب تو ان سجدہ گزاروں کے ساتھ دعوت یا جہاد کے کام میں پھر رہا ہوتا ہے تو تیرا رب ہر وقت تجھے دیکھ رہا ہے اور اپنے اس قیام اور پھرنے میں تو جو کچھ کہتا ہے وہ اسے سنتا ہے اور جو کچھ تو کرتا ہے اسے جانتا ہے، کیونکہ وہی سننے والا، جاننے والا ہے۔ اس لیے اس پر بھروسا رکھ جس کی نگاہ سے تو ایک لمحہ اوجھل نہیں، وہ تجھے کبھی بے سہارا نہیں چھوڑے گا۔ ¤ ➋ ان آیات میں اس بات کی طرف بھی اشارہ ہے کہ نبی صلی اللہ علیہ وسلم اور آپ کے صحابہ کی شب و روز کی مصروفیات کو جو شخص بھی غور سے دیکھے گا وہ کبھی نہیں کہہ سکتا کہ ان لوگوں کا شیطان سے کوئی تعلق ہو سکتا ہے ۔"
    },
    {
      "ayah": 220,
      "tafsir": "(آیت 218تا220) ➊ {الَّذِيْ يَرٰىكَ حِيْنَ تَقُوْمُ …:} یعنی اس عزیز و رحیم پر بھروسا رکھ جو ہر وقت تجھے دیکھ رہا ہے، اس وقت بھی جب تو کھڑا ہوتا ہے، رات قیام میں کھڑا ہو یا دعوت و جہاد کے فریضے کی ادائیگی کے لیے، یا کسی بھی کام کے لیے اور تیرے صحابہ میں تیرے گھومنے پھرنے کو بھی دیکھ رہا ہے جن کا خاص وصف ساجدین ہے، فرمایا : «{ تَرٰىهُمْ رُكَّعًا سُجَّدًا يَّبْتَغُوْنَ فَضْلًا مِّنَ اللّٰهِ وَ رِضْوَانًا سِيْمَاهُمْ فِيْ وُجُوْهِهِمْ مِّنْ اَثَرِ السُّجُوْدِ }» [ الفتح : ۲۹ ] ’’تو انھیں اس حال میں دیکھے گا کہ رکوع کرنے والے ہیں، سجدے کرنے والے ہیں، اپنے رب کا فضل اور (اس کی) رضا ڈھونڈتے ہیں، ان کی شناخت ان کے چہروں میں (موجود) ہے۔‘‘ جب تو ان کے ساتھ باجماعت نماز کی حالت میں اپنی ہیئت بدل رہا ہوتا ہے، کبھی ان کے ساتھ سجدے میں ہوتا ہے، کبھی رکوع میں، کبھی قیام میں اور جب تو ان سجدہ گزاروں کے ساتھ دعوت یا جہاد کے کام میں پھر رہا ہوتا ہے تو تیرا رب ہر وقت تجھے دیکھ رہا ہے اور اپنے اس قیام اور پھرنے میں تو جو کچھ کہتا ہے وہ اسے سنتا ہے اور جو کچھ تو کرتا ہے اسے جانتا ہے، کیونکہ وہی سننے والا، جاننے والا ہے۔ اس لیے اس پر بھروسا رکھ جس کی نگاہ سے تو ایک لمحہ اوجھل نہیں، وہ تجھے کبھی بے سہارا نہیں چھوڑے گا۔ ¤ ➋ ان آیات میں اس بات کی طرف بھی اشارہ ہے کہ نبی صلی اللہ علیہ وسلم اور آپ کے صحابہ کی شب و روز کی مصروفیات کو جو شخص بھی غور سے دیکھے گا وہ کبھی نہیں کہہ سکتا کہ ان لوگوں کا شیطان سے کوئی تعلق ہو سکتا ہے ۔"
    },
    {
      "ayah": 221,
      "tafsir": "(آیت 222،221) {هَلْ اُنَبِّئُكُمْ عَلٰى مَنْ تَنَزَّلُ الشَّيٰطِيْنُ …:’’ اَفَّاكٍ ‘‘ ’’إِفْكٌ‘‘} میں سے مبالغہ ہے، زبردست جھوٹا۔ {’’اَثِيْمٍ ‘‘ ’’إِثْمٌ‘‘} میں سے مبالغہ ہے، سخت گناہ گار۔ پہلے فرمایا تھا کہ شیاطین نہ یہ قرآن لے کر اترے ہیں نہ ان کے لیے یہ ممکن ہے، اب یہ بیان ہے کہ شیاطین کا قرآن لے کر آنے کی طرح رسول اللہ صلی اللہ علیہ وسلم پر اترنا بھی محال ہے، کیونکہ آپ صلی اللہ علیہ وسلم صادق و امین ہیں اور خیر کی تمام خوبیوں سے آراستہ ہیں، شیاطین تو ایسے ے لوگوں پر اترتے ہیں جو نہایت جھوٹے اور سخت گناہ گار ہوں، کیونکہ انھوں نے انھی لوگوں پر اترنا ہوتا ہے جن کے دلوں میں ان کی بات قبول کرنے کی استعداد ہو اور جو جھوٹ، خیانت، خبث اور دوسری کمینگیوں میں ان کے ساتھ مناسبت رکھتے ہوں۔ مراد اس سے وہ کاہن، نجومی، جوتشی، چوریاں بتانے والے اور عامل قسم کے لوگ ہیں جو غیب دانی کا ڈھونگ رچاتے اور لوگوں کو ان کی قسمتیں بتاتے پھرتے ہیں۔ کچھ جنّوں اور موکّلوں کی تسخیر کے دعوے سے اپنا کاروبار چلاتے پھرتے ہیں۔"
    },
    {
      "ayah": 222,
      "tafsir": "(آیت 222،221) {هَلْ اُنَبِّئُكُمْ عَلٰى مَنْ تَنَزَّلُ الشَّيٰطِيْنُ …:’’ اَفَّاكٍ ‘‘ ’’إِفْكٌ‘‘} میں سے مبالغہ ہے، زبردست جھوٹا۔ {’’اَثِيْمٍ ‘‘ ’’إِثْمٌ‘‘} میں سے مبالغہ ہے، سخت گناہ گار۔ پہلے فرمایا تھا کہ شیاطین نہ یہ قرآن لے کر اترے ہیں نہ ان کے لیے یہ ممکن ہے، اب یہ بیان ہے کہ شیاطین کا قرآن لے کر آنے کی طرح رسول اللہ صلی اللہ علیہ وسلم پر اترنا بھی محال ہے، کیونکہ آپ صلی اللہ علیہ وسلم صادق و امین ہیں اور خیر کی تمام خوبیوں سے آراستہ ہیں، شیاطین تو ایسے ے لوگوں پر اترتے ہیں جو نہایت جھوٹے اور سخت گناہ گار ہوں، کیونکہ انھوں نے انھی لوگوں پر اترنا ہوتا ہے جن کے دلوں میں ان کی بات قبول کرنے کی استعداد ہو اور جو جھوٹ، خیانت، خبث اور دوسری کمینگیوں میں ان کے ساتھ مناسبت رکھتے ہوں۔ مراد اس سے وہ کاہن، نجومی، جوتشی، چوریاں بتانے والے اور عامل قسم کے لوگ ہیں جو غیب دانی کا ڈھونگ رچاتے اور لوگوں کو ان کی قسمتیں بتاتے پھرتے ہیں۔ کچھ جنّوں اور موکّلوں کی تسخیر کے دعوے سے اپنا کاروبار چلاتے پھرتے ہیں۔"
    },
    {
      "ayah": 223,
      "tafsir": "(آیت 223) {يُّلْقُوْنَ السَّمْعَ وَ اَكْثَرُهُمْ كٰذِبُوْنَ: ’’ السَّمْعَ ‘‘} مصدر بمعنی اسم مفعول ہے، یعنی سنی ہوئی بات۔ اس کے دو معنی ہو سکتے ہیں، ایک یہ کہ شیاطین فرشتوں سے سنی ہوئی بات کاہنوں کے کانوں میں لا ڈالتے ہیں، جن میں وہ اپنی طرف سے سو (۱۰۰) جھوٹی باتیں ملا دیتے ہیں۔ فرشتوں سے سنی ہوئی وہ بات سچی نکلتی ہے تو سو (۱۰۰) جھوٹی باتوں کی طرف کوئی توجہ ہی نہیں کرتے۔ دوسرا یہ کہ وہ {’’افاك و اثيم‘‘} کاہن شیاطین سے سنی ہوئی بات لوگوں کو بتاتے ہیں جس میں وہ مزید جھوٹ ملا دیتے ہیں اور ان کے اکثر جھوٹ بول رہے ہوتے ہیں، سوائے اس ایک بات کے جو شیاطین نے چرا کر ان تک پہنچائی ہوتی ہے۔ {’’ يُّلْقُوْنَ السَّمْعَ ‘‘} میں {’’ السَّمْعَ ‘‘} مصدر مفعول لہ بھی ہو سکتا ہے، یعنی وہ شیاطین فرشتوں کی گفتگو سننے کے لیے کان لگاتے ہیں، یا وہ کاہن شیاطین کی باتیں سننے کے لیے کان لگاتے ہیں۔ یہ معنی بھی درست ہے۔ ¤ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا قَضَی اللّٰهُ الْأَمْرَ فِي السَّمَاءِ، ضَرَبَتِ الْمَلَائِكَةُ بِأَجْنِحَتِهَا خُضْعَانًا لِقَوْلِهِ، كَأَنَّهُ سِلْسِلَةٌ عَلٰی صَفْوَانٍ، فَإِذَا فُزِّعَ عَنْ قُلُوْبِهِمْ قَالُوْا مَا ذَا قَالَ رَبُّكُمْ؟ قَالُوْا لِلَّذِيْ قَالَ الْحَقَّ، وَهُوَ الْعَلِيُّ الْكَبِيْرُ، فَيَسْمَعُهَا مُسْتَرِقُ السَّمْعِ وَمُسْتَرِقُوا السَّمْعِ هٰكَذَا بَعْضُههُ فَوْقَ بَعْضٍ، وَصَفَهُ سُفْيَانُ بِكَفِّهِ فَحَرَفَهَا وَ بَدَّدَ بَيْنَ أَصَابِعِهِ، فَيَسْمَعُ الْكَلِمَةَ فَيُلْقِيْهَاا إِلٰی مَنْ تَحْتَهُ، ثُمَّ يُّلْقِيْهَا الْآخَرُ إِلٰی مَنْ تَحْتَههُ، حَتّٰی يُلْقِيَهَا عَلٰی لِسَانِ السَّاحِرِ أَوِ الْكَاهِنِ، فَرُبَّمَا أَدْرَكَ الشِّهَابُ قَبْلَ أَنْ يُلْقِيَهَا، وَرُبَّمَا اأَلْقَاهَا قَبْلَ أَنْ يُّدْرِكَهُ، فَيَكْذِبُ مَعَهَا مِائَةَ كَذْذْبَةٍ فَيُقَالُ أَلَيْسَ قَدْ قَالَ لَنَا يَوْمَ كَذَا وَ كَذَا، كَذَا وَ كَذَا؟ فَيُصَدَّقُ بِتِلْكَ الْكَلِمَةِ الَّتِيْ سُمِعَتْ مِنَ السَّمَاءِ] [ بخاري، التفسیر، باب « حتی إذا فزع عن قلوبہم…» : ۴۸۰۰ ] ’’جب اللہ تعالیٰ کسی کام کا فیصلہ آسمان پر کرتا ہے تو فرشتے عاجزی سے اپنے پر پھڑ پھڑاتے ہیں اور اللہ تعالیٰ کا فرمان انھیں اس طرح سنائی دیتا ہے جیسے صاف چکنے پتھر پر زنجیر کی آواز ہوتی ہے، پھر جب وہ گھبراہٹ ان کے دلوں سے دور ہو جاتی ہے تو وہ آپس میں دریافت کرتے ہیں کہ تمھارے رب نے کیا فرمایا ہے؟ وہ کہتے ہیں کہ اس نے حق فرمایا ہے اور وہ بہت بلندی والا، بہت بڑائی والا ہے، تو (کبھی کبھی) چوری سننے والا اسے سن لیتا ہے اور چوری سننے والے اس طرح ایک دوسرے کے اوپر ہوتے ہیں۔‘‘ اور (حدیث کے راوی) سفیان نے چوری سننے والوں کی کیفیت بیان کرتے ہوئے اپنے ہاتھوں کی انگلیوں کو الگ الگ کرکے ایک دوسرے کے اوپر رکھ کر دکھایا۔ ’’تو وہ (شیطان جنّ) بات سن لیتا ہے اور اپنے سے نیچے والے کو پہنچا دیتا ہے، پھر وہ دوسرا اسے اپنے سے نیچے والے کو پہنچا دیتا ہے، یہاں تک کہ وہ اسے جادوگر کاہن کی زبان پر ڈال دیتا ہے، پھر بعض اوقات شُعلہ اسے نیچے پہنچانے سے پہلے آ پکڑتا ہے اور بعض اوقات وہ شعلہ پہنچنے سے پہلے دوسرے کو وہ بات پہنچا دیتا ہے تو وہ اس کے ساتھ سو جھوٹ ملا دیتا ہے۔ تو کہا جاتا ہے، کیا اس نے ہمیں فلاں فلاں دن ایسے ایسے نہیں کہا تھا؟ تو اس بات کی وجہ سے جو آسمان سے سنی تھی اس کو سچا سمجھ لیا جاتا ہے۔‘‘ عائشہ زوج النبی صلی اللہ علیہ وسلم بیان کرتی ہیں کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرما رہے تھے : [ إِنَّ الْمَلَائِكَةَ تَنْزِلُ فِي الْعَنَانِ، وَهُوَ السَّحَابُ، فَتَذْكُرُ الْأَمْرَ قُضِيَ فِي السَّمَاءِ، فَتَسْتَرِقُ الشَّيَاطِيْنُ السَّمْعَ فَتَسْمَعُهُ، فَتُوْحِيْهِ إِلَی الْكُهَّانِ، فَيَكْذِبُوْنَ مَعَههَا مِائَةَ كَذْبَةٍ مِنْ عِنْدِ أَنْفُسِهِمْ ] [بخاري، بدء الخلق، باب ذکر الملائکۃ… : ۳۲۱۰ ] ’’فرشتے بادل میں اترتے ہیں اور اس کام کا ذکر کرتے ہیں جس کا آسمان میں فیصلہ کیا گیا ہوتا ہے۔ تو شیطان چوری سے اس کی طرف کان لگاتے ہیں اور اسے سن لیتے ہیں اور کاہنوں کے دلوں میں پہنچا دیتے ہیں اور اس کے ساتھ اپنی طرف سے سو (۱۰۰) جھوٹ ملا دیتے ہیں۔‘‘ ¤ صفیہ نے نبی صلی اللہ علیہ وسلم کی بیویوں میں سے ایک بیوی سے بیان کیا کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ أَتٰی عَرَّافًا فَسَأَلَهُ عَنْ شَيْءٍ لَمْ تُقْبَلْ لَهُ صَلاَةُ أَرْبَعِيْنَ لَيْلَةً] [مسلم، السلام، باب تحریم الکہانۃ… : ۲۲۳۰ ] ’’جو شخص کسی عراف (چوریاں یا گم شدہ چیزیں بتانے والے) کے پاس گیا اور اس سے کسی چیز کے بارے میں پوچھا تو اس کی چالیس راتوں کی نماز قبول نہیں ہو گی۔‘‘ ابوہریرہ اور حسن رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ أَتٰی كَاهِنًا أَوْ عَرَّافًا فَصَدَّقَهُ بِمَا يَقُوْلُ فَقَدْ كَفَرَ بِمَا أُنْزِلَ عَلٰی مُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ ] [ مسند أحمد : 429/2، ح : ۹۵۴۸ ] ’’جو شخص کسی کاہن یا عراف کے پاس جائے اور اسے اس بات میں سچا سمجھے جو وہ کہے تو اس نے اس کے ساتھ کفر کیا جو محمد صلی اللہ علیہ وسلم پر نازل ہوا۔‘‘ عائشہ رضی اللہ عنھا بیان کرتی ہیں کہ کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے کاہنوں (غیب کی باتیں بتانے والوں) کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسُوْا بِشَيْءٍ، قَالُوْا يَا رَسُوْلَ اللّٰهِ! فَإِنَّهُمْ يُحَدِّثُوْنَ أَحْيَانًا بِالشَّيْءِ يَكُوْنُ حَقًّا، فَقَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ تِلْكَ الْكَلِمَةُ مِنَ الْحَقِّ يَخْطَفُهَا الْجِنِّيُّ فَيَقُرُّهَا فِيْ أُذُنِ وَلِيِّهِ قَرَّ الدَّجَااجَةِ فَيَخْلِطُوْنَ فِيْهَا أَكْثَرَ مِنْ مِائَةِ كَذْبَةٍ] [بخاري،، الأدب، باب قول الرجل للشيء …: ۶۲۱۳ ] ’’وہ کچھ بھی نہیں۔‘‘ لوگوں نے کہا : ’’یا رسول اللہ! بعض اوقات وہ ہمیں کوئی بات بتاتے ہیں جو سچی نکلتی ہے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ بات حق ہوتی ہے جسے جنّی (جن) اچک لیتا ہے اور اپنے دوست کے کان میں مرغی کے کڑکڑ کرنے کی طرح ڈال دیتا ہے، پھر وہ اس کے ساتھ سو (۱۰۰) جھوٹ ملا لیتے ہیں۔‘‘"
    },
    {
      "ayah": 224,
      "tafsir": "(آیت 224) {وَ الشُّعَرَآءُ يَتَّبِعُهُمُ الْغَاوٗنَ : ’’ الْغَاوٗنَ ‘‘ ’’غَوٰي يَغْوِيْ‘‘} (ض) سے اسم فاعل کی جمع ہے، گمراہ لوگ۔ کفارِمکہ رسول اللہ صلی اللہ علیہ وسلم پر کاہن کے علاوہ شاعر ہونے کا الزام بھی لگاتے تھے، اس لیے آپ سے کہانت کی نفی کے بعد شاعر ہونے کی نفی بھی فرمائی۔ مزید دیکھیے سورۂ یٰس (۶۹) اور حاقہ (۴۰ تا ۴۳) ان آیات میں شعراء کی تین خصوصیات بیان فرمائیں جن سے صاف ظاہر ہے کہ شعراء اور نبی کریم صلی اللہ علیہ وسلم میں اور شعر اور قرآن مجید میں مشرق و مغرب کا فرق ہے۔ پہلی خصوصیت یہ کہ شعراء کے پیچھے گمراہ، بھٹکے ہوئے اور اوباش قسم کے لوگ لگتے ہیں، پھر جن کے پیچھے لگنے والے گمراہ ہوں خود ان کے گمراہ ہونے میں کیا کمی ہو گی؟ عرب کے سب سے بڑے شاعر ’’امرء القیس‘‘ نے جس بے حیائی اور فحاشی کی اشاعت اپنے شعروں میں کی ہے اس کی مثال نہیں ملتی، یہاں تک کہ اہل عرب بھی اسے اپنا سب سے بڑا شاعر ماننے کے باوجود {’’اَلْمَلِكُ الضَّلِيْلُ ‘‘} (رند بادشاہ) کہتے تھے۔ شاعروں کا محبوب موضوع عشق بازی، شراب نوشی اور بازاری عورتوں یا کسی کی معصوم بہو وبیٹی کے حسن و جمال کا تذکرہ ہے، یا شہوت بھڑکانے والی فحش باتیں۔ وہ کسی کی بے جا مدح کرتے ہیں اور کسی کی ناجائز مذمت، اس لیے ان کے ساتھی بھی اسی قبیل کے لوگ ہوتے ہیں۔ جبکہ رسول اللہ صلی اللہ علیہ وسلم اور آپ کے ساتھی انتہائی سچے، پاکباز، شریف اور مہذب تھے۔ ایسے شخص کو شاعر وہی شخص کہہ سکتا ہے جو جھوٹ بولنے میں حیا کی ساری حدیں پار کر گیا ہو۔"
    },
    {
      "ayah": 225,
      "tafsir": "(آیت 225) {اَلَمْ تَرَ اَنَّهُمْ فِيْ كُلِّ وَادٍ يَّهِيْمُوْنَ :} یہ شاعروں کی دوسری خصوصیت ہے جو یہاں بیان کی گئی ہے اور وہ یہ ہے کہ جب انھیں کوئی خیال آتا ہے اسے اچھوتے انداز میں شعر کے قالب میں ڈھال دیتے ہیں، انھیں اس سے غرض نہیں کہ وہ رحمانی ہے یا شیطانی، روحانی ہے یا نفسانی، اس سے خیر کے جذبات پیدا ہوں گے یا شر کے۔ کبھی کسی کی تعریف کرکے اسے آسمان پر چڑھا دیتے ہیں اور کبھی کسی کی ہجو اور مذمت کرکے اسے آسمان سے زمین پر پٹخ دیتے ہیں۔ ایک شعر سے معلوم ہو گا کہ شاعر ولی ہے جب کہ دوسرے شعر سے پتا چلے گا کہ وہ شیطان ہے۔ ایک ہی سانس میں وہ نیکی اور بدی دونوں کی باتیں بے تکلف کہہ دے گا، لیکن کہے گا ایسے مؤثر اور دلکش انداز میں کہ سننے والے ان دونوں سے متاثر ہو جائیں گے، لیکن نفس انسانی کو چونکہ نیکی کے بجائے بدی کی باتیں ہی عموماً مرغوب ہوتی ہیں، اس لیے شاعر کے چھوڑے ہوئے بدی والے اثرات و نقوش تو قائم رہتے ہیں، مگر نیکی کے اثرات غائب ہو جاتے ہیں اور اس طرح ان کا کلام {’’ وَ اِثْمُهُمَاۤ اَكْبَرُ مِنْ نَّفْعِهِمَا ‘‘} کا مصداق بن جاتا ہے۔ (تفسیر مدنی)"
    },
    {
      "ayah": 226,
      "tafsir": "(آیت 226) {وَ اَنَّهُمْ يَقُوْلُوْنَ مَا لَا يَفْعَلُوْنَ :} یہ شاعروں کی تیسری خصوصیت ہے جو نبی صلی اللہ علیہ وسلم کے طرزِ عمل کی عین ضد تھی، آپ صلی اللہ علیہ وسلم کو جاننے والا ہر شخص جانتا تھا کہ آپ جو کہتے ہیں وہی کرتے ہیں، دوست دشمن سب کا اتفاق تھا کہ آپ کے قول و فعل میں تضاد نہیں، جب کہ شاعروں کے متعلق ہر شخص جانتا ہے کہ ان کے کہنے کی باتیں اور ہوتی ہیں، کرنے کی اور ۔ شعر پڑھو تو معلوم ہو گا کہ شیر سے زیادہ بہادر ہیں مگر پرلے درجے کے بزدل ہوں گے، سخاوت کا مضمون ایسا باندھیں گے کہ آدمی سمجھے ان سے بڑا سخی کوئی نہیں جب کہ واقع میں سخت کنجوس ہوں گے، زہد و قناعت اور خود داری کا بلند بانگ دعویٰ کریں گے جب کہ حرص و طمع میں ذلت کی آخری حد کو پار کر رہے ہوں گے۔ مرزا غالب نے اپنا حال خود ہی بیان کر دیا ہے: ¤ یہ مسائل تصوف یہ ترا بیان غالب ¤ تجھے ہم ولی سمجھتے جو نہ بادہ خوار ہوتا ¤ حالی نے مسدس میں اپنے زمانے کے شاعروں کا خوب نقشہ کھینچا ہے. ¤ برا شعر کہنے کی گر کچھ سزا ہے ¤ تو وہ محکمہ جس کا قاضی خدا ہے ¤ گنہ گار واں چھوٹ جائیں گے سارے ¤ عبث جھوٹ بکنا اگر ناروا ہے ¤ مقرر جہاں نیک و بد کی سزا ہے ¤ جہنم کو بھر دیں گے شاعر ہمارے ¤ ان اشعار میں حالی نے شاعروں کی مذمت کرتے ہوئے دوسرے تمام گناہ گاروں کو جہنم سے آزادی کا پروانہ دے دیاا، یہ اس شاعری ہی کا نتیجہ ہے جس کی اللہ تعالیٰ نے مذمت فرمائی ہے ۔اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَأَنْ يَّمْتَلِئَ جَوْفُ الرَّجُلِ قَيْحًا يَرِيْهِ خَيْرٌ مِّنْ أَنْ يَّمْتَلِئَ شِعْرًا ] [ مسلم، الشعر، باب في إنشاد الأشعار…:۲۲۵۷، عن أبي ھریرۃ رضی اللہ عنہ ] ’’(تم میں سے) کسی آدمی کا اندرون (سینہ، پیٹ) پیپ سے بھر جائے جو اسے گلا دے، تو وہ اس سے بہتر ہے کہ شعر سے بھرے۔‘‘ اندرون (سینہ، پیٹ) شعر سے بھرنے کا مطلب یہ ہے کہ قرآن و حدیث کے بجائے اشعار آدمی پر غالب ہوں۔ ورنہ اچھے اشعار یاد کرنے اور سننے سنانے میں کوئی حرج نہیں۔ عمرو بن شرید اپنے والد سے بیان کرتے ہیں کہ ایک دن میں رسول اللہ صلی اللہ علیہ وسلم کے پیچھے سواری پر سوار تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ هَلْ مَعَكَ مِنْ شِعْرِ أُمَيَّةَ بْنِ أَبِي الصَّلْتِ شَيْءٌ ؟ قُلْتُ نَعَمْ، قَاللَ هِيْهِ فَأَنْشَدْتُّهُ بَيْتًا، فَقَالَ هِيْهِ ثُمَّ أَنْشَدْتُّهُ بَيْتًا فَقَالَ هِيْهِ حَتّٰی أَنْشَدْتُّهُ مِائَةَ بَيْتٍ ] [مسلم، الشعر، باب في إنشاد الأشعار…:۲۲۵۵ ] ’’تمھیں امیہ بن صلت کے کچھ اشعار یاد ہیں؟‘‘ میں نے کہا : ’’جی ہاں!‘‘ آپ نے فرمایا : ’’سناؤ۔‘‘ میں نے ایک شعر سنایا، آپ نے فرمایا : ’’اور سناؤ۔‘‘ میں نے ایک شعر اور سنایا، آپ نے فرمایا : ’’اور سناؤ۔‘‘ حتیٰ کہ میں نے آپ کو سو شعر سنائے۔‘‘ ابن عباس رضی اللہ عنھما سے روایت ہے، انھوں نے فرمایا : [ إِذَا خَفِيَ عَلَيْكُمْ شَيْءٌ مِنَ الْقُرْآنِ فَابْتَغُوْهُ فِي الشِّعْرِ فَإِنَّهُ دِيْوَانُ الْعَرَبِ ] [مستدرک حاکم : 499/2، ح : ۳۸۴۵، قال الحاکم صحیح و وافقہ الذھبي ]’’جب تم سے قرآن کی کوئی چیز مخفی رہے (کسی لفظ کا مطلب سمجھ میں نہ آئے) تو اسے شعر میں تلاش کرو، کیونکہ وہ عرب کا دیوان ہے (یعنی ان کے گزشتہ علوم کا مجموعہ ہے)۔‘‘ ابن حبان (۷۳۷۷) کے حاشیہ میں اس کے محقق نے یہ روایت بیہقی کی ’’الاسماء والصفات‘‘ کے حوالے سے نقل کر کے اس کی دو سندوں کو حسن کہا ہے۔ ابن عباس رضی اللہ عنھما کا تفسیرِ قرآن میں اشعار عرب سے اسستشہاد معروف ہے۔"
    },
    {
      "ayah": 227,
      "tafsir": "(آیت 227) ➊ {اِلَّا الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ …:} شعراء کی مذمت کے بعد ان میں سے ایسے لوگوں کو مستثنیٰ فرمایا جن میں چار اوصاف پائے جائیں، پہلا وصف یہ کہ وہ مومن ہوں۔ دوسرا یہ کہ وہ صالح اعمال کے حامل ہوں، فاسق و فاجر اور بدکار نہ ہوں۔ تیسرا یہ کہ اللہ کو کثرت سے یاد کرتے ہوں، اپنی عام زندگی میں بھی اور اپنے اشعار میں بھی۔ ایسا نہ ہو کہ زبانی تسبیح و تہلیل اور اذکار پر تو بہت زور ہو مگر اشعار میں اللہ کی یاد کے بجائے عشق و ہوس اور فضول باتوں کا تذکرہ ہو۔ چوتھا وصف یہ کہ وہ اپنے کلام سے ظالموں کے مقابلے میں حق کی حمایت کا کام لیتے ہوں اور کفار و مشرکین اسلام، مسلمانوں اور رسول اللہ صلی اللہ علیہ وسلم کے متعلق جو بد زبانی کریں ان کا دندان شکن جواب دیں۔ ایسے موقع پر وہ زبان سے وہ کام لیتے ہیں جو میدان جنگ میں مجاہد تیر و تلوار سے لیتا ہے۔ اس مقصد کے لیے رسول اللہ صلی اللہ علیہ وسلم خود شعرائے اسلام کی ہمت افزائی فرمایا کرتے تھے۔ چنانچہ عائشہ رضی اللہ عنھا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اُهْجُوْا قُرَيْشًا فَإِنَّهُ أَشَدُّ عَلَيْهَا مِنْ رَشْقٍ بِالنَّبْلِ ] [ مسلم، ، فضائل الصحابۃ، باب فضائل حسان بن ثابت رضی اللہ عنہ : ۲۴۹۰ ] ’’قریش کی ہجو کرو، کیونکہ وہ ان پر تیروں کے چھیدنے سے بھی سخت ہے۔‘‘ اور اس حدیث کے آخر میں ہے، عائشہ رضی اللہ عنھا بیان کرتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو سنا، آپ حسان رضی اللہ عنہ سے کہہ رہے تھے : [ إِنَّ رُوْحَ الْقُدُسِ لَا يَزَالُ يُؤَيِّدُكَ مَا نَافَحْتَ عَنِ اللّٰهِ وَ رَسُوْلِهِ ] ’’روح القدس تیری مدد کرتا رہتا ہے جب تک تو اللہ اور اس کے رسول صلی اللہ علیہ وسلیہ وسلم کا دفاع کرتا رہے۔‘‘ اور فرماتی ہیں کہ میں نے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ هَجَاهُمْ حَسَّانُ فَشَفٰی وَ اشْتَفٰی] [ مسلم، فضائل الصحابۃ، باب فضائل حسان بن ثابت رضی اللہ عنہ : ۲۴۹۰ ] ’’حسان نے ان کی ہجو کی اور شفا دی اور شفا پائی۔‘‘ کعب بن مالک رضی اللہ عنہ نے کہا : ’’یا رسول اللہ! آپ کی شعر کے بارے میں کیا رائے ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [إِنَّ الْمُؤْمِنَ يُجَاهِدُ بِسَيْفِهِ وَلِسَانِهِ وَالَّذِيْ نَفْسِيْ بِيَدِهِ لَكَأَننَّمَا تَنْضَحُوْنَهُمْ بِالنَّبْلِ ] [صحیح ابن حبان : ۴۷۰۷، قال المحقق إسنادہ علی شرط الشیخین ] ’’مومن اپنی تلوار اور اپنی زبان کے ساتھ جہاد کرتا ہے، قسم اس کی جس کے ہاتھ میں میری جان ہے! گویا تم انھیں تیروں کے ساتھ چھیدتے ہو۔‘‘ آیت سے ظاہر ہے کہ شعر کی دو حالتیں ہیں، ایک وہ جس کی مذمت آئی ہے، دوسری وہ جس کی اجازت ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ مِنَ الشِّعْرِ حِكْمَةً ] [ ابن ماجہ، الأدب، باب الشعر : ۳۷۵۵ ، و قال الألباني صحیح ] ’’بعض شعر حکمت سے بھرے ہوتے ہیں۔‘‘ عبد اللہ بن عمرو بن عاص رضی اللہ عنھما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ الشِّعْرُ بِمَنْزِلَةِ الْكَلَامِ حَسَنُهُ كَحَسَنِ الْكَلَامِ وَ قَبِيْحُهُ كَقَبِيْحِ الْكَلَامِ ] [ سنن الدار قطني : 274/5، ح : ۴۳۰۸ ]’’شعر کلام کی طرح ہے، سو اس میں سے جو اچھا ہے وہ اچھے کلام کی طرح ہے اور جو اس میں سے برا ہے وہ برے کلام کی طرح ہے۔‘‘ ¤ ➋ { وَ سَيَعْلَمُ الَّذِيْنَ ظَلَمُوْۤا …:} ظلم کرنے والوں سے مراد وہ کفار و مشرکین ہیں جنھوں نے ایمان قبول نہ کرکے اپنی جانوں پر ظلم کیا اور ضد اور ہٹ دھرمی سے اسلام کو نیچا دکھانے کے لیے رسول اللہ صلی اللہ علیہ وسلم کو ساحر، کاہن اور شاعر کہہ کر جھٹلاتے رہے۔ فرمایا، یہ لوگ جلد ہی جان لیں گے کہ ان کا کیا انجام ہونے والا ہے آخرت میں اور دنیا میں بھی۔ ان الفاظ میں کفار کے لیے بہت سخت وعید ہے۔ [ اَللّٰھُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُوْرِ کُلِّھَا وَأَجِرْنَا مِنْ خِزْيِ الدُّنْیَا وَ عَذَابِ الْآخِرَۃِ ]"
    }
  ]
}