{
  "surah": "Al-Qasas",
  "surah_number": 28,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 2،1) {طٰسٓمّٓ (1) تِلْكَ اٰيٰتُ الْكِتٰبِ الْمُبِيْنِ:} حروف مقطعات کی تفسیر کے لیے دیکھییے سورۂ بقرہ (۱) اور دوسری آیت کی تفسیر سورۂ یوسف کی آیت (۲) میں دیکھیں۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2،1) {طٰسٓمّٓ (1) تِلْكَ اٰيٰتُ الْكِتٰبِ الْمُبِيْنِ:} حروف مقطعات کی تفسیر کے لیے دیکھییے سورۂ بقرہ (۱) اور دوسری آیت کی تفسیر سورۂ یوسف کی آیت (۲) میں دیکھیں۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {نَتْلُوْا عَلَيْكَ مِنْ نَّبَاِ مُوْسٰى وَ فِرْعَوْنَ: ’’ نَبَاِ ‘‘} اس خبر کو کہتے ہیں جو اہم اور شان والی ہو۔ {’’ مِنْ ‘‘} بعض کے معنی میں ہے، اس لیے ترجمہ ’’کچھ خبر‘‘ کیا گیا ہے۔ شوق دلانے کے لیے قصے کا آغاز ان الفاظ سے فرمایا، ہم تجھ پر موسیٰ علیہ السلام اور فرعون کے اہم واقعے کا کچھ حصہ حق کے ساتھ، یعنی ٹھیک ٹھیک بیان کرتے ہیں۔ ¤ ➋ { لِقَوْمٍ يُّؤْمِنُوْنَ:} ’’یعنی مسلمان اپنا حال قیاس کر لیں ظالموں کے مقابلہ میں۔‘‘ (موضح) مطلب یہ ہے کہ اس قصے میں مسلمانوں کو یہ بتایا گیا ہے کہ فرعون سے بڑھ کر کوئی ظالم نہیں ہو سکتا اور بنی اسرائیل سے زیادہ کوئی مظلوم نہیں۔ تو جس طرح اللہ تعالیٰ نے موسیٰ علیہ السلام کے ذریعے سے بنی اسرائیل کو کمزور ہونے کے باوجود فرعون کے مقابلے میں کامیاب کیا، اسی طرح جو مسلمان مکہ میں کمزور اور مغلوب ہیں، یا دنیا کے کسی بھی خطے میں یا کسی بھی وقت مظلوم و مجبور ہوں گے، انھیں ہرگز مایوس نہیں ہونا چاہیے، اللہ تعالیٰ ان کی بھی اسی طرح مدد فرمائے گا، انھیں دشمنوں سے نجات دلائے گا اور ان کے دشمنوں کو نیست و نابود کرے گا۔ ¤ ➌ { لِقَوْمٍ يُّؤْمِنُوْنَ:} جیسا کہ سورۂ بقرہ کے شروع میں اس کتاب لا ریب کو صرف متقین کے لیے ہدایت قرار دیا، اسی طرح یہاں فرمایا کہ ہم آپ کو موسیٰ اور فرعون کے قصے کا کچھ حصہ ان لوگوں کے لیے سنا رہے ہیں جو ایمان رکھتے ہیں، کیونکہ سنتے اگرچہ کافر بھی ہیں مگر فائدہ صرف اہلِ ایمان ہی اٹھاتے ہیں۔ جن لوگوں نے طے کر رکھا ہے کہ ہم نے ماننا ہی نہیں، انھیں اس واقعے سے بلکہ پورے قرآن سے کچھ حاصل نہیں۔ کچھ حصہ اس لیے فرمایا کہ اس قصے کے بہت سے حصے اس سورت کے بجائے دوسری سورتوں میں ہیں اور قرآن کوئی بھی واقعہ بطور تاریخ پورا بیان نہیں کرتا، بلکہ اس کے صرف وہ حصے بیان کرتا ہے جن کی ضرورت ہوتی ہے۔ ¤ ➍ اس واقعہ کے لیے مزید ملاحظہ کریں سورۂ بقرہ (رکوع ۶)، اعراف (رکوع ۱۳ تا ۱۶)، یونس (رکوع ۸، ۹)، ہود (رکوع ۹)، بنی اسرائیل (رکوع ۱۲)، مریم (رکوع ۴)، طٰہٰ (رکوع ۱ تا ۵)، مومنون (رکوع۳)، شعراء (رکوع ۲ تا ۴)، نمل (رکوع ۱)، عنکبوت (رکوع۴)، مومن (رکوع ۳ تا ۵)، زخرف (رکوع ۵)، دخان (رکوع ۱)، ذاریات (رکوع ۲) اور نازعات (رکوع ۱)۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { اِنَّ فِرْعَوْنَ عَلَا فِي الْاَرْضِ: ’’ الْاَرْضِ ‘‘} سے مراد سرزمین مصر ہے، جس کا قرینہ فرعون کا ذکر ہے، کیونکہ اس کی حکومت صرف مصر میں تھی۔ جو لوگ اسے پوری زمین کا بادشاہ سمجھتے ہیں ان کی بات درست نہیں، کیونکہ ہجرت کے بعد مصر کے قریب ہی مدین پہنچنے پر موسیٰ علیہ السلام اس کی گرفت سے آزاد تھے۔ {’’ عَلَا ‘‘} کا لفظی معنی ہے ’’اس نے سر اٹھایا، اونچا بن گیا‘‘ یعنی اپنے اصل مقام بندگی سے اونچا ہو کر خدائی کا دعویٰ کر بیٹھا اور اپنی حقیقت کو بھول گیا۔ {’’ عَلَا فِي الْاَرْضِ ‘‘} کے لفظ میں یہ بھی اشارہ ہے کہ بلندی اور کبریائی تو اس ذات کا لباس ہے جو عرش پر بلند ہے، زمین پر رہنے والے کا حق تو عرش والے کے سامنے پستی اور عاجزی ہے، نہ کہ سرکشی کرتے ہوئے اللہ کے بندوں کو ذلیل و خوار کرنا اور ان پر ظلم و ستم کے پہاڑ توڑنا۔ ¤ ➋ {وَ جَعَلَ اَهْلَهَا شِيَعًا:} یعنی اس نے سر زمین مصر کے باشندوں کو مختلف طبقوں میں تقسیم کر دیا تھا۔ واضح رہے کہ فرعون کے زمانے کی تہذیب اور ان کے عقائد بہت حد تک ہندوؤں کی تہذیب اور عقائد سے ملتے جلتے ہیں۔ ہندو بھی چار طبقوں میں تقسیم ہیں، برہمن، کھتری، ویش اور شودر۔ جن میں برہمنوں کو سب پر بالادست رکھا گیا ہے اور شودر کو انسانیت کی حد سے بھی نیچے گرا دیا گیا ہے۔ مصری تہذیب بھی بادشاہ کی خدائی کے ساتھ گائے کی پجاری تھی، ہندوؤں کا بھی یہی حال ہے۔ فرعونِ مصر نے بھی مصر کے رہنے والوں کو مختلف گروہوں میں بانٹ دیا تھا اور ان سب کو آپس میں دست و گریبان کر رکھا تھا اور مختلف قسم کی مراعات دے کر یا ان پر ظلم و ستم کر کے انھیں اتنا بے وقعت اور بے بس بنا رکھا تھا کہ وہ کسی بات میں اس سے اختلاف کی جرأت نہیں کر سکتے تھے، حتیٰ کہ انھوں نے اس کے رب اعلیٰ ہونے کے دعوے کو بھی مان لیا۔ (دیکھیے زخرف : ۵۱ تا۵۴) آج کل بھی ملکوں اور قوموں کو محکوم رکھنے کے لیے بڑی طاقتوں کا یہی طریقہ ہے کہ تقسیم کرو اور حکومت کرو۔ ¤ ➌ { يَسْتَضْعِفُ طَآىِٕفَةً مِّنْهُمْ: ’’ أَضْعَفَ يُضْعِفُ‘‘} (افعال) کا معنی کمزور کرنا ہے اور استفعال میں حروف کے اضافے کی وجہ سے معنی میں اضافہ ہو گیا، یعنی وہ ان میں سے ایک گروہ کو بہت زیادہ ہی کمزور کر رہا تھا۔ مراد اس سے بنی اسرائیل ہیں، جو یوسف علیہ السلام کے زمانے میں مصر آئے تھے اور مدت تک نہایت شان و شوکت اور عزت و احترام کے ساتھ زندگی بسر کرتے رہے، پھر اللہ کی نافرمانی اور اپنے اعمال بد کی وجہ سے اللہ تعالیٰ نے مصر کے اصل باشندوں کو جو قبطی تھے، ان پر مسلط کر دیا اور اس فرعون نے تو انھیں کمزور اور بے بس کرنے کی انتہا کر دی۔ اس نے ایسا بندوبست کیا کہ قبطی آقا بن کر رہیں اور بنی اسرائیل غلام اور خدمت گار بن کر۔ چنانچہ مشقت کا ہر کام زبردستی ان سے لیا جاتا، مثلاً کھیتی باڑی، عمارتیں بنانے اور نہریں وغیرہ کھودنے کا کام اور گھروں میں خدمت کا کام ان کی عورتوں سے لیا جاتا۔ اس کے علاوہ لڑکوں کو ذبح کرکے عورتوں کو اپنی ہوس کا نشانہ بنانے کے لیے زندہ رکھا جاتا۔ ¤ ➍ { يُذَبِّحُ اَبْنَآءَهُمْ وَ يَسْتَحْيٖ نِسَآءَهُمْ:} اس حکم کی وجہ اور ذبح کی کیفیت کے لیے دیکھیے سورۂ بقرہ (۴۹)۔ ¤ ➎ { اِنَّهٗ كَانَ مِنَ الْمُفْسِدِيْنَ: ’’ إِنَّ ‘‘} عموماً اپنے سے پہلے والے کلام کی علت بیان کرنے کے لیے آتا ہے، یعنی اس کے اس ظلم اور سرکشی کی وجہ یہ تھی کہ وہ ان لوگوںمیں سے تھا جن کا کام ہی فساد اور جن کی پہچان ہی مفسدین کے نام سے ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { وَ نُرِيْدُ اَنْ نَّمُنَّ عَلَى الَّذِيْنَ اسْتُضْعِفُوْا فِي الْاَرْضِ …:} فرعون کے اس ظلم کو اللہ تعالیٰ کی رحمت کس طرح برداشت کر سکتی تھی، خصوصاً جب مظلوم قوم مسلمان بھی ہو۔ ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کو یمن کی طرف بھیجا اور فرمایا : [ اِتَّقِ دَعْوَةَ الْمَظْلُوْمِ فَإِنَّهُ لَيْسَ بَيْنَهَا وَ بَيْنَ  اللّٰهِ حِجَابٌ ] [ بخاري، الزکاۃ، باب أخذ الصدقۃ من الأغنیاء … : ۱۴۹۶ ] ’’مظلوم کی بد دعا سے بچ، کیونکہ اس کے درمیان اور اللہ کے درمیان کوئی پردہ نہیں۔‘‘ یعنی فرعون تو اس مظلوم قوم کو مکمل طور پر نیست و نابود کرنے پر تلا ہوا تھا، مگر ہمارا ارادہ یہ تھا کہ ان لوگوں پر احسان کریں جنھیں نہایت کمزور کیا گیا۔ احسان وہ عطیہ ہے جو کسی عوض کے بغیر دیا جائے، یعنی بنی اسرائیل پر فرعون سے نجات کی نعمت اور دوسری نعمتیں محض ہمارا احسان اور فضل و کرم تھا۔ ¤ ➋ { وَ نَجْعَلَهُمْ اَىِٕمَّةً:} مستضعفین کی مدد کے لیے اللہ تعالیٰ کی غیرت جب جوش میں آتی ہے تو وہ ان سے صرف ظلم ہی دور نہیں کرتا، بلکہ انھیں مزید انعامات سے بھی نوازتا ہے۔ چنانچہ فرمایا، ہم چاہتے تھے کہ ان پر احسان کریں اور انھیں دین کی پیشوائی کے ساتھ حکومت و اقتدار کے پیشوا بھی بنائیں، تاکہ کسی کو ان پر ظلم کی جرأت ہی نہ ہو۔ ¤ ➌ { وَ نَجْعَلَهُمُ الْوٰرِثِيْنَ:} اور انھیں فرعون اور آل فرعون کے غلبے و اقتدار کا اور ان تمام چیزوں کا وارث بنائیں جو وہ چھوڑ کر غرق ہونے والے تھے، اور ایسا ہی ہوا۔ دیکھیے سورۂ اعراف (۱۳۷)، شعراء (۵۷ تا ۵۹) اور دخان (۲۵ تا ۲۷)۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {وَ نُمَكِّنَ لَهُمْ فِي الْاَرْضِ …:} ہامان فرعون کا وزیر تھا، جو ظلم و ستم میں اس کا شریک اور آلہ کار تھا۔ یعنی ہم چاہتے تھے کہ انھیں زمین میں اقتدار بخشیں اور ان کا سِکّہ جما دیں اور فرعون، ہامان اور ان کے لشکروں نے جس خطرے کی وجہ سے بنی اسرائیل کے لڑکوں کو قتل کرنا شروع کیا تھا کہ کہیں ان کی تعداد اور قوت اتنی نہ بڑھ جائے کہ وہ ہماری حکومت پر قابض ہو جائیں، بنی اسرائیل ہی کے ذریعے سے وہ خطرہ انھیں حقیقت بنا کر دکھا دیں اور وہ اپنی آنکھوں سے دیکھ لیں کہ اللہ کی تقدیر کبھی ٹل نہیں سکتی، نہ اس کے ارادے کو پورا ہونے سے کوئی طاقت روک سکتی ہے، جیسا کہ فرمایا: «{ وَ اللّٰهُ غَالِبٌ عَلٰۤى اَمْرِهٖ وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ }» [ یوسف : ۲۱ ] ’’اور اللہ اپنے کام پر غالب ہے اور لیکن اکثر لوگ نہیں جانتے۔‘‘"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { وَ اَوْحَيْنَاۤ اِلٰۤى اُمِّ مُوْسٰۤى:} ’’وحی‘‘ کا لفظی معنی خفیہ اور تیز اشارہ ہے۔ وحی کرنے کا مطلب کوئی بات خفیہ طریقے سے دل میں ڈالنا ہے۔ یہاں کلام کا ایک حصہ محذوف ہے کہ مظلوم بنی اسرائیل پر احسان کی ابتدا یہاں سے ہوئی کہ ان کی نجات کا ذریعہ بننے والے لڑکے کی ماں اس کے ساتھ اس سال حاملہ ہوئی جس میں ان کے لڑکوں کو ذبح کیا جاتا تھا۔ ان کے والد کا نام رسول اللہ صلی اللہ علیہ وسلم نے عمران بیان فرمایا ہے۔ [ دیکھیے مسلم، الإیمان، باب الإسراء برسول اللہ صلی اللہ علیہ وسلم … : ۲۶۷ /۱۶۵ ] اس سے پہلے ان کے بھائی ہارون علیہ السلام کی ولادت اس سال ہو چکی تھی جس میں لڑکے قتل نہیں کیے جاتے تھے۔ دیکھیے سورۂ بقرہ کی آیت (۴۹) کی تفسیر۔ ان کی والدہ کا نام اللہ تعالیٰ نے بیان نہیں فرمایا، نہ رسول اللہ صلی اللہ علیہ وسلم نے ذکر فرمایا ہے۔ بعض مفسرین نے ان کا نام ’’ایارفت‘‘ اور بعض نے ’’لوحا‘‘ بتایا ہے، مگر یہ کسی صحیح حوالے سے ثابت نہیں۔ قرآن ان کا ذکر {’’اُمّ موسيٰ‘‘} کے نام سے کرتا ہے۔ ¤ ➋ یہاں اللہ تعالیٰ نے {’’ اَوْحَيْنَاۤ ‘‘} میں اور آگے آنے والے الفاظ میں اپنی عظمت کے اظہار کے لیے اپنا ذکر جمع کے صیغے کے ساتھ فرمایا ہے، کیونکہ شاہی حکم عموماً جمع کے صیغے سے جاری ہوتے ہیں اور اللہ تعالیٰ تو ملک الملوک اور شہنشاہ ہے۔ مقصد یہ ہے کہ یہ جو کچھ ہوا ہماری قدرت و حکمت کے نتیجے میں ہوا، ورنہ ایسا ہونا ممکن نہ تھا۔ ¤ ➌ وحی کا لفظی معنی خفیہ اور تیز اشارہ ہے۔ اُمّ موسیٰ کو اللہ تعالیٰ نے یہ وحی کس طرح کی، اس کی صراحت نہیں فرمائی۔ انھیں الہام کیا (ان کے دل میں ڈالا) یا انھیں خواب دکھایا، بہر حال یہ وحی انھیں چند باتیں بتانے کے لیے تھی، نبوت کی وحی نہیں تھی۔ کیونکہ اس بات پر تمام علماء کا اجماع ہے کہ موسیٰ علیہ السلام کی والدہ نبیہ نہیں تھیں، کیونکہ تمام انبیاء مرد تھے۔ (دیکھیے انبیاء : ۷) بعض مفسرین کہتے ہیں کہ ان کے پاس فرشتہ آیا، اس صورت میں بھی یہی کہا جائے گا کہ فرشتے تو بعض اوقات غیر انبیاء کے پاس بھی آ جاتے ہیں، جیسا کہ مریم بنت عمران علیھا السلام کے پاس بھی فرشتہ آیا اور انھیں مسیح علیہ السلام کی ولادت کی بشارت دی۔ (دیکھیے مریم : ۱۶ تا ۲۱) صحیح بخاری (۳۴۶۴) اور صحیح مسلم (۲۹۶۴) میں گنجے، کوڑھی اور نابینے شخص کا قصہ مذکور ہے کہ ان کے پاس فرشتہ آیا اور ان سے ہم کلام ہوا۔ سنن کبریٰ بیہقی کی صحیح حدیث (۹۱۱۰) میں ہے کہ فرشتوں نے عمران بن حصین رضی اللہ عنہ کو سلام کیا، لیکن اس سے وہ نبی نہیں بن گئے۔ ¤ ➍ { اَنْ اَرْضِعِيْهِ:} اللہ تعالیٰ نے اُمّ موسیٰ کو وحی کی کہ اپنے بچے کو کچھ مدت تک دودھ پلا، تاکہ اس کی ابتدائی غذائی ضرورت پوری ہو جائے، کیونکہ ماں کے دودھ سے بڑھ کر کوئی چیز وہ ضرورت پوری نہیں کر سکتی، اور جسم کچھ مضبوط ہو جائے، جو آخری مرتبہ دودھ پلا کر دریا میں ڈالنے سے لے کر دایہ کا دودھ ملنے تک کا وقفہ برداشت کر سکے۔ ’’اسے دودھ پلا‘‘ کے ضمن میں یہ حکم بھی موجود ہے کہ اتنی مدت تک اسے ہرحال میں چھپا کر رکھ، کسی کو اس کی خبر نہ ہو۔ حقیقت یہ ہے کہ حمل کی پوری مدت، پھر ولادت کے وقت، حتیٰ کہ کچھ عرصہ دودھ پلانے تک فرعون کی مقرر کردہ دایوں اور اس کے جاسوسوں کو اس معاملے کی خبر نہ ہو سکنا اللہ تعالیٰ کا معجزانہ انتظام تھا، جس کا ذکر سورۂ طٰہٰ (۳۹) میں {’’ وَ لِتُصْنَعَ عَلٰى عَيْنِيْ ‘‘} کے الفاظ کے ساتھ فرمایا ہے۔ دودھ پلانے کا یہ عرصہ کتنا تھا؟ تین ماہ یا چھ ماہ یا سال، اللہ تعالیٰ ہی بہتر جانتا ہے، کیونکہ صحیح ذریعے سے اس کی تعیین ثابت نہیں۔ ¤ ➎ {فَاِذَا خِفْتِ عَلَيْهِ فَاَلْقِيْهِ فِي الْيَمِّ:} اس کی تفصیل سورۂ طٰہٰ (۳۸ تا ۴۰) میں ہے۔ ¤ ➏ { وَ لَا تَخَافِيْ وَ لَا تَحْزَنِيْ:} خوف آنے والے خطرے کا ہوتا ہے اور غم گزشتہ نقصان کا۔ فرمایا جب تمھیں فرعون کے جاسوسوں کا خطرہ محسوس ہو تو اسے دریا میں پھینک دو اور نہ ڈرو کہ ضائع ہو جائے گا، یا اسے کوئی نقصان پہنچے گا اور نہ غم کرو کہ میں نے اپنے بچے کو دریا میں کیوں پھینک دیا۔ ¤ ➐ { اِنَّا رَآدُّوْهُ اِلَيْكِ وَ جَاعِلُوْهُ مِنَ الْمُرْسَلِيْنَ:} مفسرین نے اس آیت میں اللہ کے کلام کا اعجاز بیان کیا ہے کہ اس مختصر سی آیت میں اللہ تعالیٰ نے اُمّ موسیٰ کو دو چیزوں کا حکم دیا ہے، یعنی {’’ اَنْ اَرْضِعِيْهِ ‘‘} اور {’’ فَاَلْقِيْهِ فِي الْيَمِّ ‘‘} اور دو چیزوں سے منع فرمایا ہے، یعنی {’’وَ لَا تَخَافِيْ ‘‘} اور {’’ وَ لَا تَحْزَنِيْ ‘‘} اور دو چیزوں کا وعدہ فرمایا اور خوش خبری دی ہے، یعنی {’’اِنَّا رَآدُّوْهُ اِلَيْكِ ‘‘} اور{ ’’وَ جَاعِلُوْهُ مِنَ الْمُرْسَلِيْنَ ‘‘} ۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { فَالْتَقَطَهٗۤ اٰلُ فِرْعَوْنَ: ’’ اِلْتَقَطَ‘‘} کا معنی ہے کسی کی گری ہوئی چیز اٹھا لینا۔ اُمّ موسیٰ کا گھر دریائے نیل کے کنارے پر فرعون کے محل کے بالائی جانب تھا۔ انھوں نے موسیٰ علیہ السلام کو ایک صندوق میں بند کر کے اسے پانی سے محفوظ بنا کر دریا میں ڈال دیا، جو بہتا ہوا فرعون کے محل کے پاس سے گزرا، اس کے لوگوں نے اسے دیکھا تو دریا سے نکال کر فرعون کے پاس لے آئے۔ ¤ ➋ {لِيَكُوْنَ لَهُمْ عَدُوًّا وَّ حَزَنًا:} اس ’’لام‘‘ کو اکثر مفسرین ’’لام عاقبت‘‘ کہتے ہیں، یعنی آل فرعون کے اسے اٹھانے کا نتیجہ یہ ہونا تھا کہ وہ ان کا دشمن اور ان کے لیے غم کا باعث بنے۔ مگر اسے لام تعلیل بھی بنا سکتے ہیں، یعنی یہ اللہ تعالیٰ کی تدبیر تھی کہ آل فرعون نے اسے اٹھا لیا، تاکہ وہ ان کے لیے دشمن اور باعث غم بنے۔ ¤ ➌ {اِنَّ فِرْعَوْنَ وَ هَامٰنَ …:’’ خٰطِـِٕيْنَ ‘‘ ’’أَخْطَأَ يُخْطِئُ‘‘} (افعال) کا معنی ہے بھول کر خطا کرنا اور {’’خَطِئَ يَخْطَأُ ‘‘} (ع) کا معنی ہے جان بوجھ کر گناہ کرنا، جیسا کہ فرمایا : «{ نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ }» [ العلق : ۱۶ ] ’’پیشانی کے ان بالوں کے ساتھ جو جھوٹے ہیں، خطا کار ہیں۔‘‘ اس کا مصدر {’’خِطْأٌ‘‘} (خاء کے کسرے کے ساتھ) ہے، جیسا کہ فرمایا : «{ اِنَّ قَتْلَهُمْ كَانَ خِطْاً كَبِيْرًا }» [ بني إسرائیل : ۳۱ ] ’’بے شک ان کا قتل ہمیشہ سے بہت بڑا گناہ ہے۔‘‘ اور سورۂ یوسف میں ہے : «{ اِنَّكِ كُنْتِ مِنَ الْخٰطِـِٕيْنَ }» [ یوسف : ۲۹ ] ’’یقینا تو ہی خطا کاروں سے تھی۔‘‘ {’’ اِنَّ ‘‘} کے ساتھ عموماً پہلی بات کی علت بیان کی جاتی ہے، یعنی موسیٰ علیہ السلام ان کے لیے دشمن اور باعث غم کیوں بننے والے تھے؟ اس لیے کہ وہ سب اللہ کے نافرمان اور خطاکار تھے، جنھوں نے ہزاروں بچوں کو ذبح کر دیا اور بنی اسرائیل پر بے پناہ ظلم کیے۔ اللہ تعالیٰ نے انھی کے پروردہ کو ان کی ہلاکت کا ذریعہ بنا دیا۔ بعض مفسرین نے اس کا ترجمہ ’’چوکنے والے‘‘ کیا ہے، مگر {’’خَاطِئٌ‘‘} کا لغوی معنی اس ترجمے کا ساتھ نہیں دیتا۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ { وَ قَالَتِ امْرَاَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِّيْ وَ لَكَ …:} فرعون اور اس کی بیوی نے صندوق کھلوایا تو اس میں سے نہایت خوب صورت اور پیارا بچہ نکلا، جس میں اللہ تعالیٰ نے ایسی کشش رکھ دی تھی کہ جو دیکھے اس سے محبت کرنے لگے، جیسا کہ فرمایا : «{ وَ اَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّيْ }» [ طٰہٰ : ۳۹ ]’’اور میں نے تجھ پر اپنی طرف سے ایک محبت ڈال دی۔‘‘ مگر جس طریقے سے یہ بچہ آیا تھا اس سے صاف ظاہر تھا کہ یہ بنی اسرائیل کے کسی آدمی کا بچہ ہے، جس نے ذبح ہونے سے بچانے کے لیے اسے دریا کے حوالے کر دیا ہے، اس لیے فرعون اور اس کے خونخوار ساتھیوں نے اصرار کیا کہ اسے ہر حال میں ذبح کیا جائے، مگر فرعون کی بیوی کہنے لگی کہ یہ میری اور تیری آنکھ کی ٹھنڈک ہے، اسے قتل مت کرو۔ فرعون کی بیوی کا یہ کہنا کہ ’’اسے قتل مت کرو ‘‘ اس بات کا قرینہ ہے کہ وہ لوگ اسے قتل کرنے کے درپے ہو چکے تھے۔ ¤ ➋ رسول اللہ صلی اللہ علیہ وسلم نے فرعون کی بیوی کا نام آسیہ بتایا ہے۔ یہ خاتون دنیا کی سب سے بلند مرتبہ خواتین میں سے ایک تھیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [كَمُلَ مِنَ الرِّجَالِ كَثِيْرٌ وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلَّا آسِيَةُ امْرَأَةُ فِرْعَوْنَ وَمَرْرْيَمُ بِنْتُ عِمْرَانَ وَ إِنَّ فَضْلَ عَائِشَةَ عَلَی النِّسَاءِ  كَفَضْلِ الثَّرِيْدِ عَلٰی سَائِرِ الطَّعَامِ ] [بخاري، أحادیث الأنبیاء، باب قول اللہ تعالٰی : « و ضرب اللہ مثلا…» : ۳۴۱۱، عن أبي موسیٰ رضی اللہ عنہ ] ’’مردوں میں سے بہت سے کامل ہوئے ہیں، مگر عورتوں میں فرعون کی بیوی آسیہ اور عمران کی بیٹی مریم کے سوا کوئی کامل نہیں ہوئی اور عائشہ کی عورتوں پر برتری ایسے ہی ہے جیسے ثرید کی برتری تمام کھانوں پر۔‘‘ آسیہ علیھا السلام کے متعلق مزید دیکھیے سورۂ تحریم (۱۱)۔ ¤ ➌ { عَسٰۤى اَنْ يَّنْفَعَنَاۤ اَوْ نَتَّخِذَهٗ وَلَدًا:} اس سے معلوم ہوا کہ فرعون اولاد سے محروم تھا۔ اللہ کی شان دیکھیے کہ{’’ اَنَا رَبُّكُمْ الْاَعْلٰي ‘‘} کا دعویٰ کرنے والا اولاد کی خواہش رکھنے کے باوجود اولاد حاصل نہیں کر سکا۔ لوگوں کے بنائے ہوئے بہت سے مشکل کُشا اور حاجت روا، جن سے لوگ اولاد مانگتے ہیں، دنیا سے بے اولاد ہی رخصت ہو گئے۔ لاہور میں مدفون مشہور بزرگ علی ہجویری کی خود اولاد نہیں تھی، مگر لوگ ہیں کہ انھیں داتا (رازق) اور گنج بخش (خزانے عطا کرنے والا) کہہ کر ان سے مال و اولاد مانگتے ہیں۔ اللہ تعالیٰ سمجھ عطا فرمائے۔ ¤ ➍ آسیہ علیھا السلام نے موسیٰ علیہ السلام کے متعلق جو کچھ کہا اللہ تعالیٰ نے اسے سچ کر دکھایا، آپ اس کی آنکھوں کی ٹھنڈک بھی بنے اور اسے وہ نفع پہنچایا جو کم ہی کسی بچے نے اپنی پالنے والی کو پہنچایا ہو گا۔ اگر فرعون بھی یہ الفاظ کہتا تو شاید اسے بھی یہ سعادت مل جاتی، مگر ظالموں کو ایسی ہدایت نہیں ملتی، جیسا کہ فرمایا : «{ وَ اللّٰهُ لَا يَهْدِي الْقَوْمَ الظّٰلِمِيْنَ }» [ البقرۃ : ۲۵۸] ’’اور اللہ ظالم لوگوں کو ہدایت نہیں دیتا۔‘‘ ¤ ➎ { وَ هُمْ لَا يَشْعُرُوْنَ:} یعنی انھیں یہ خیال تک نہ تھا کہ یہ بچہ بڑا ہو کر ہمارے زوال اور ہماری ہلاکت کا باعث بنے گا۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ { وَ اَصْبَحَ فُؤَادُ اُمِّ مُوْسٰى فٰرِغًا:} اوپر ان کا حال بیان ہوا جنھیں وہ بچہ ملا، اب اس کا حال بیان ہوتا ہے جس سے وہ جدا ہوا۔ ابن ابی حاتم نے صحیح سند کے ساتھ ابن عباس رضی اللہ عنھما سے نقل فرمایا ہے کہ انھوں نے اس کی تفسیر میں فرمایا : [ فَارِغًا مِنْ كُلِّ شَيْءٍ غَيْرِ ذِكْرِ مُوْسٰی] ’’موسیٰ علیہ السلام کی ماں اتنی بے قرار ہو گئی کہ اس کا دل موسیٰ کی یاد کے سوا ہر چیز سے خالی ہو گیا۔‘‘ ¤ ➋ { اِنْ كَادَتْ لَتُبْدِيْ بِهٖ:} یہ{’’ اِنْ ‘‘} اصل میں {’’إِنَّ‘‘} ہے، جس کا اسم محذوف ہے۔ دلیل اس کی {’’ لَتُبْدِيْ بِهٖ ‘‘} پر آنے والا لام ہے۔ محذوف کو ظاہر کریں تو عبارت ہو گی : {’’إِنَّهَا كَادَتْ لَتُبْدِيْ بِهِ‘‘} یعنی وہ بے قراری کی وجہ سے قریب تھی کہ اس کا معاملہ ظاہر کر دیتی کہ ہائے میں نے اپنے ہاتھوں سے اپنا بچہ دریا میں پھینک دیا۔ ¤ ➌ { لَوْ لَاۤ اَنْ رَّبَطْنَا عَلٰى قَلْبِهَا لِتَكُوْنَ مِنَ الْمُؤْمِنِيْنَ:} یعنی ہم نے اس سے جو وعدہ کیا تھا کہ{’’ اِنَّا رَاۤدُّوْهُ اِلَيْكِ ‘‘} (ہم اسے تیرے پاس واپس لانے والے ہیں) اس پر اس کا ایمان پختہ رکھنے کے لیے ہم نے اس کے دل پر صبر کا بند باندھ دیا اور اس کی ڈھارس بندھا دی، اگر یہ نہ ہوتا تو وہ قریب تھی کہ بچے کا راز خود ہی فاش کر دیتی، مگر ہمارے بند باندھنے کی وجہ سے وہ قائم رہی۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ { وَ قَالَتْ لِاُخْتِهٖ قُصِّيْهِ:’’ قَصَّ يَقُصُّ‘‘} کا معنی بیان کرنا بھی ہے اور پیچھے پیچھے جانا بھی۔ موسیٰ علیہ السلام کی ماں نے ان کی بہن سے کہا کہ اس کے پیچھے پیچھے جاؤ۔ اس سے پہلے موسیٰ علیہ السلام کے ایک بھائی ہارون تھے اور ایک بہن تھی۔ ¤ ➋ { فَبَصُرَتْ بِهٖ عَنْ جُنُبٍ وَّ هُمْ لَا يَشْعُرُوْنَ: ’’ عَنْ جُنُبٍ ‘‘} کا معنی ’’دور سے‘‘ یا ’’جانب سے‘‘ یعنی وہ کنارے پر رہ کر ساتھ چلتی ہوئی دور سے اسے دیکھتی رہی، اس طرح کہ کسی کو معلوم نہیں ہو سکا کہ وہ اس کا پیچھا کر رہی ہے۔ اس سے اس لڑکی کی دانائی اور ذہانت کا پتا چلتا ہے۔ ماں نے صرف پیچھے پیچھے جانے کو کہا تھا، یہ اس کی دانش مندی تھی کہ پیچھے کس طرح جانا ہے۔ ایک عرب شاعر نے خوب کہا ہے : ¤ {إِذَا كُنْتَ فِيْ حَاجَةٍ مُرْسِلاً ¤ فَأَرْسِلْ حَكِيْمًا وَ لَا تُوْصِهٖ} ¤ ’’جب تم کسی کام کے لیے بھیجو تو دانا آدمی کو بھیجو، پھر اسے سمجھانے کی ضرورت نہیں۔‘‘"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { وَ حَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ مِنْ قَبْلُ:’’ الْمَرَاضِعَ ‘‘ ’’مُرْضِعٌ‘‘} کی جمع بھی ہو سکتی ہے، یعنی دودھ پلانے والیاں اور{’’ مَرْضَعٌ‘‘} کی بھی جو ظرف مکان ہو تو مراد دودھ پلانے کی جگہ ہو گی، یعنی دودھ کی چھاتیاں اور اگر مصدر میمی ہو تو مراد تمام دودھ ہوں گے، یعنی ہم نے اپنی تقدیر میں طے شدہ حکم کے ذریعے سے موسیٰ علیہ السلام پر تمام دودھ پہلے ہی حرام کر دیے تھے، یعنی پینے سے منع کر دیا تھا۔ فرعون کی بیوی کو موسیٰ علیہ السلام سے بے پناہ محبت ہو گئی تھی اور وہ ہر قیمت پر ان کے لیے دودھ کا انتظام کرنا چاہتی تھی، مگر جو دایہ بھی لائی گئی، موسیٰ نے اس کا دودھ پینے سے انکار کر دیا۔ فرعون کی بیوی سخت فکر مند تھی کہ دودھ نہ پینے کی وجہ سے اتنا پیارا بچہ کہیں فوت نہ ہو جائے۔ ¤ ➋ { فَقَالَتْ هَلْ اَدُلُّكُمْ عَلٰۤى اَهْلِ بَيْتٍ يَّكْفُلُوْنَهٗ لَكُمْ …::} موسیٰ علیہ السلام کی بہن اجنبی بن کر یہ سب کچھ دیکھ رہی تھی۔ جب موسیٰ علیہ السلام کو دودھ پلانے کی تمام کوششیں ناکام ہو گئیں تو اس نے موقع پا کر کہا، کیا میں تمھیں ایک ایسے گھر والے بتاؤں جو تمھارے لیے اس کی کفالت کریں گے اور وہ اس کے خیر خواہ ہوں گے۔ یہاں درمیان کی بات چھوڑ دی گئی ہے، کیونکہ وہ خود بخود سمجھ میں آ رہی ہے کہ فرعون کے گھر والوں نے اس سے پوچھا کہ وہ گھر والے کون ہیں؟ اس نے کہا، میری ماں۔ انھوں نے کہا، اس کا مطلب یہ ہے کہ یہ بچہ تمھارا ہے اور تم اس کے متعلق جانتی ہو۔ اس نے کہا، بلکہ ہم بادشاہ کے خیرخواہ اور مخلص محبت کرنے والے ہیں، اس لیے اس بچے کی خیر خواہی اور خدمت میں کوئی کوتاہی نہیں کریں گے۔ انھوں نے کہا، تمھاری اماں کے ہاں دودھ کہاں سے آیا؟ اس نے کہا، میرا بھائی ہارون پچھلے سال پیدا ہوا ہے اور دودھ پی رہا ہے۔ غرض انھوں نے موسیٰ علیہ السلام کی والدہ کو بلوایا، کیونکہ ان کے پاس اس کے سوا کوئی چارہ نہیں تھا۔ سلطنت کی ملکہ ہر حال میں اس کے لیے دودھ کا انتظام کرنا چاہتی تھی، جوں ہی ماں نے بچے کے منہ سے اپنی چھاتی لگائی، بچہ خوش ہو کر دودھ پینے لگا۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ { فَرَدَدْنٰهُ اِلٰۤى اُمِّهٖ:} یعنی ہم نے موسیٰ علیہ السلام کی ماں سے جو وعدہ کیا تھا کہ اسے تمھارے پاس واپس لائیں گے، اتنی دیر ہی میں پورا کر دیا جتنی دیر کوئی بچہ ماں کے دودھ کے بغیر گزار سکتا ہے۔ ¤ ➋ { كَيْ تَقَرَّ عَيْنُهَا: ’’قَرَّ يَقِرُّ} (ض، ع) {قُرَّةً وَ قُرُوْرًا‘‘} ’’آنکھ کا ٹھنڈا ہونا۔‘‘ تاکہ اس کی آنکھ جو بیٹے کی جدائی میں سکون سے ناآشنا تھی، آنسو بہا بہا کر اور بیدار رہ کر سرخ اور گرم ہو چکی تھی، بیٹے کے واپس ملنے، اسے دودھ پلانے اور اپنے پاس رکھنے سے ٹھنڈی اور پرسکون ہو جائے اور آرام کی نیند سو جائے اور غم زدہ نہ رہے۔ ¤ نکتہ : اللہ تعالیٰ نے انسانی جسم کے اعضا کا درجہ حرارت مختلف رکھا ہے، اس کی جلد کا درجہ حرارت عموماً 37 ڈگری ہوتا ہے۔ جگر کو کام کرنے کے لیے 40 ڈگری کے قریب درجہ حرارت کی ضرورت ہوتی ہے، جب کہ آنکھ کا درجہ حرارت زیادہ سے زیادہ 9 ڈگری ہوتا ہے، اس سے زیادہ ہو جائے تو آنکھ پگھل کر بہ جائے، اس لیے دل کی خوشی کے لیے آنکھ کی ٹھنڈک کا لفظ استعمال کیا جاتا ہے۔ (شعراوی) ¤ ➌ قدیم زمانے میں ان ممالک کے بڑے اور خاندانی لوگ بچوں کو اپنے ہاں پالنے کے بجائے دودھ پلانے والی عورتوں کے سپرد کر دیتے تھے۔ خود ہمارے نبی کریم صلی اللہ علیہ وسلم نے بھی حلیمہ سعدیہ کے ہاں صحرا میں پرورش پائی۔ اس کے مطابق موسیٰ علیہ السلام کو ان کی والدہ اپنے گھر لے گئیں۔ اس طرح اللہ تعالیٰ نے ان کے بیٹے کو واپس لانے کا جو وعدہ کیا تھا وہ بھی پورا ہوا اور شاہی خزانے سے ماں کو جو وظیفہ ملتا رہا وہ اس کے علاوہ تھا۔ ¤ ➍ اس مقام پر بعض مفسرین نے یہ روایت نقل کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَثَلُ الَّذِيْ يَعْمَلُ وَ يَحْتَسِبُ فِيْ صِنْعَةِ الْخَيْرِ كَمَثَلِ أُمِّ مُوْسٰی تُرْضِعُ وَلَدَهَا وَ تَأْخُذُ أَجْرَهَا ] ’’’وہ شخص جو کام کرے اور اپنے کام میں نیکی کی نیت رکھے، اس کی مثال موسیٰ کی والدہ کی سی ہے، جو اپنے بچے کو دودھ پلاتی ہے اور اپنی مزدوری وصول کرتی ہے۔‘‘ مگر ان الفاظ کے ساتھ یہ روایت حدیث کی کسی کتاب میں نہیں ہے، البتہ ایک مرسل روایت ان الفاظ کے ساتھ آئی ہے : [ مَثَلُ الَّذِيْنَ يَغْزُوْنَ مِنْ أُمَّتِيْ وَ يَأْخُذُوْنَ الْجُعْلَ يَتَقَوَّوْنَ بِهِ عَلٰی عَدُووِّهِمْ كَمَثَلِ أُمِّ مُوْسٰي تُرْضِعُ وَلَدَهَا وَ تَأْخُذُ أَجْرَهَا ] ’’میری امت کے جو لوگ جنگ کرتے ہیں اور وظیفہ لیتے ہیں، جس کے ساتھ دشمن کے مقابلے میں قوت حاصل کرتے ہیں، ان کی مثال ام موسیٰ کی سی ہے جو اپنے بچے کو دودھ پلاتی ہے اور اپنی مزدوری وصول کرتی ہے۔‘‘ یہ روایت مرسل (جو ضعیف کی ایک قسم ہے) ہونے کے علاوہ سند کے لحاظ سے بھی ضعیف ہے۔ تفصیل کے لیے دیکھیے {’’ سلسلة الأحاديث الضعيفة للألباني (ح : ۴۵۰۰)‘‘} اس حدیث میں جو بات بیان ہوئی ہے اگرچہ فی نفسہ درست ہے، جو اپنی طرف سے بطور مثال بیان کی جا سکتی ہے، مگر رسول اللہ صلی اللہ علیہ وسلم کے ذمے وہی بات لگانے کی اجازت ہے جو آپ سے ثابت ہو، ورنہ {’’ مَنْ كَذَبَ عَلَيَّ  ‘‘} کی وعید کا مصداق بننے کا خطرہ ہے۔ ¤ ➎ { وَ لِتَعْلَمَ اَنَّ وَعْدَ اللّٰهِ حَقٌّ:} یعنی ہم نے موسیٰ علیہ السلام کو اس کی ماں کے پاس واپس پہنچا دیا، تاکہ اسے پہلے وحی کے ذریعے سے سن کر اللہ کا وعدہ حق ہونے کا علم تھا، تو اب آنکھوں سے دیکھ کر اس کے حق ہونے کا علم ہو جائے۔ پہلے اگر علم الیقین تھا تو اب عین الیقین ہو جائے۔ (بقاعی) ¤ ➏ {وَ لٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ:} یعنی اکثر لوگ نہیں جانتے کہ اللہ کا وعدہ حق ہے۔ ان کا حال یہ ہے کہ جوں ہی کسی کام میں کوئی مشکل پیش آتی ہے، اللہ تعالیٰ سے بدظن ہو جاتے ہیں اور انھیں اللہ کے وعدے پر یقین نہیں رہتا، حالانکہ اس کا وعدہ خلاف نہیں ہو سکتا۔ اللہ تعالیٰ اسباب کو کچھ اس طرح پھیر کر لاتا ہے جو انسانی سمجھ سے باہر ہوتا ہے اور جس چیز کا گمان بھی نہیں ہوتا وہ آنکھوں کے سامنے لے آتا ہے۔ پھر بعض اوقات آدمی ایک چیز کو برا سمجھتا ہے جب کہ وہ اس کے حق میں بہتر ہوتی ہے اور ایک چیز کو اچھا سمجھتا ہے جب کہ وہ اس کے حق میں بری ہوتی ہے۔ دیکھیے سورۂ بقرہ (۲۱۶) اور نساء (۱۹)۔ ¤ ہاں مشو نومید چوں واقف نہ ای ز اسرارِ غیب ¤ باشد اندر پردہ بازی ہائے پنہاں غم مخور ¤ ’’خبردار! ناامید نہ ہو، کیونکہ تو غیب کے اسرار سے واقف نہیں۔ پردے کے اندر کئی پوشیدہ کھیل ہو رہے ہوتے ہیں، غم مت کر۔‘‘"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { وَ لَمَّا بَلَغَ اَشُدَّهٗ وَ اسْتَوٰۤى:} یہاں ایک لمبی بات حذف کر دی گئی ہے کہ موسیٰ علیہ السلام کے رضاعت کے ایام اپنی والدہ کے پاس گزرے، جس سے انھیں اپنے والدین، بھائی بہن اور خاندان سے شناسائی ہو گئی اور آئندہ بھی اس تعلق کی وجہ سے میل جول جاری رہا، جس سے وہ اپنے آبائے کرام ابراہیم، اسحاق اور یعقوب علیھم السلام اور ان کے دین سے واقف ہو گئے اور بنی اسرائیل کی زبوں حالت پر براہ راست مطلع رہنے لگے۔ رضاعت کے بعد شاہی محل میں منتقل ہونے کے ساتھ ان کی پرورش اور تربیت ایک شہزادے کی حیثیت سے ہوئی، انھیں اس وقت کے تمام علوم و فنون، لکھنے پڑھنے اور جہانبانی کے طریقے سکھائے گئے، جنگ میں درکار عام تربیت اور سپہ سالاری کے لیے خاص تربیت دی گئی۔ ان تمام چیزوں سے بڑھ کر اللہ تعالیٰ کی خاص نگرانی اور تربیت تھی، جس کے ذریعے سے انھیں آنے والی ذمہ داری کے لیے تیار کیا گیا، حتیٰ کہ وہ اپنی پوری جوانی کو پہنچ گئے۔ {’’ بَلَغَ اَشُدَّهٗ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ یوسف (۲۲) وہاں یوسف علیہ السلام کے لیے صرف {’’ بَلَغَ اَشُدَّهٗ ‘‘} کا لفظ آیا ہے، جب کہ یہاں موسیٰ علیہ السلام کے لیے {’’ وَ اسْتَوٰۤى ‘‘} کا لفظ بھی آیا ہے، یعنی وہ پورے طاقت ور ہو گئے، کیونکہ جسمانی قوت یوسف علیہ السلام میں موسیٰ علیہ السلام جیسی نظر نہیں آتی۔ ¤ ➋ { اٰتَيْنٰهُ حُكْمًا وَّ عِلْمًا: ’’ حُكْمًا ‘‘} کا معنی فیصلہ کرنے کی صلاحیت ہے اور {’’ عِلْمًا ‘‘} سے مراد دنیا اور دین کا علم ہے، یعنی جوان ہونے پر ہم نے انھیں حق و باطل میں فیصلہ کرنے کی اہلیت عطا فرمائی اور دنیا و دین دونوں کا علم عطا فرمایا۔ جس میں سے دنیا کے علوم شاہی محل کے ذریعے سے حاصل ہوئے اور دین کا علم اور اس کا فہم والدہ کے گھر اور خاندان کے ذریعے سے حاصل ہوا۔ بعض مفسرین نے {’’ حُكْمًا وَّ عِلْمًا ‘‘} سے مراد نبوت لی ہے، مگر یہاں یہ معنی درست معلوم نہیں ہوتا، کیونکہ نبوت تو اس کے دس سال بعد طُور پر عطا ہوئی، جیسا کہ آگے آرہا ہے۔ ¤ ➌ {وَ كَذٰلِكَ نَجْزِي الْمُحْسِنِيْنَ:} احسان کا معنی نیک کام کرنا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے احسان کی تفسیر{’’ أَنْ تَعْبُدَ اللّٰهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ‘‘} کے ساتھ فرمائی ہے کہ ’’اللہ کی عبادت ایسے کرنا گویا تم اسے دیکھ رہے ہو، پھر اگر اُسے نہیں دیکھتے تو وہ تمھیں دیکھ رہا ہے۔‘‘ [ دیکھیے بخاري، الإیمان، باب سؤال جبریل … : ۵۰ ] احسان کا ایک معنی یہ معلوم ہوتا ہے کہ کسی معاوضہ کی طلب یا خواہش کے بغیر کسی کے ساتھ نیکی کرنا، جیسا کہ بنی اسرائیل کے نیک لوگوں نے قارون کو نصیحت کی تھی : «{ وَ اَحْسِنْ كَمَاۤ اَحْسَنَ اللّٰهُ اِلَيْكَ }» [ القصص : ۷۷ ] ’’اور احسان کر جیسے اللہ نے تیرے ساتھ احسان کیا ہے۔‘‘ فرمایا : ’’ہم محسنین کو ایسے ہی جزا دیتے ہیں‘‘ اس سے معلوم ہوا موسیٰ علیہ السلام احسان کی صفت سے پوری طرح آراستہ تھے، جس کی جزا میں اللہ تعالیٰ نے انھیں حکم و علم عطا فرمایا۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ {وَ دَخَلَ الْمَدِيْنَةَ عَلٰى حِيْنِ غَفْلَةٍ مِّنْ اَهْلِهَا:} ’’شہر میں داخل ہوا ‘‘سے معلوم ہوا کہ شاہی محلاّت عام آبادی سے باہر واقع تھے، جہاں سے وہ شہر میں داخل ہوئے۔ {’’ غَفْلَةٍ ‘‘} میں تنوین کی وجہ سے ’’کسی قدر غفلت‘‘ ترجمہ کیا گیا ہے۔ ایک دفعہ وہ شہر میں ایسے وقت میں آئے جو کسی قدر غفلت کا وقت تھا۔ یہ صبح سویرے یا عشاء کے بعد یا دوپہر کے وقت میں سے کوئی وقت بھی ہو سکتا ہے، مگر غالب یہی ہے کہ وہ دوپہر کا وقت تھا جب سڑکیں سُنسان ہوتی ہیں، لوگ گرمی کی وجہ سے گھروں میں آرام کر رہے ہوتے ہیں۔ چنانچہ ابن ابی حاتم نے اپنی صحیح سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول ذکر فرمایا ہے : {’’ نِصْفُ النَّهَارِ‘‘} ’’(یعنی یہ) دوپہر کا وقت تھا۔‘‘ [ ابن أبي حاتم : ۱۶۷۵۵ ] ¤ ➋ { فَوَجَدَ فِيْهَا رَجُلَيْنِ يَقْتَتِلٰنِ …:} موسیٰ علیہ السلام کو معلوم تھا کہ وہ بنی اسرائیل سے ہیں، وہ قبطیوں کے بنی اسرائیل پر مظالم سے بھی آگاہ تھے اور ہر روز اپنی آنکھوں سے ان مظالم کا مشاہدہ کرتے تھے، اس لیے قدرتی طور پر ان کی ہمدردیاں اپنی قوم کے ساتھ تھیں۔ قوم بھی جانتی تھی کہ وہ ان کے ایک فرد ہیں۔ اب موسیٰ علیہ السلام نے دیکھا کہ دو آدمی لڑ جھگڑ رہے ہیں، ان میں سے ایک ان کی قوم سے ہے اور دوسرا قبطی ہے، جو ان کے دشمن تھے۔ قبطی حسبِ عادت غلام سمجھ کر اسرائیلی پر زیادتی کر رہا تھا۔ اسرائیلی اگر مقابلہ کر سکتا ہوتا تو اسے مدد مانگنے کی ضرورت نہ تھی۔ جب وہ بے بس ہو گیا تو اس نے مدد کے لیے موسیٰ علیہ السلام کو آواز دی۔ موسیٰ علیہ السلام طبعی طور پر کمزوروں اور مظلوموں کے ہمدرد تھے۔ اب ظلم ہوتے دیکھا تو مظلوم کو بچانے کے لیے آگے بڑھے اور قبطی کو ایک گھونسا مارا، جس سے اس کا کام تمام ہو گیا۔ موسیٰ علیہ السلام کا اسے قتل کرنے کا نہ ارادہ تھا نہ ان کے وہم و گمان میں یہ بات تھی کہ وہ ایک گھونسے سے مر جائے گا۔ جب اچانک یہ واقعہ ہوا اور موسیٰ علیہ السلام نے اس کے انجام پر غور کیا کہ ان کے اور ان کی قوم کے حق میں اس کا کیا نتیجہ نکل سکتا ہے، تو وہ سخت پریشان ہوئے اور کہنے لگے کہ یہ شیطان کا کام ہے جس نے بڑے فساد کے لیے مجھے غصہ دلا کر یہ کام کروایا ہے۔ وہ تو ایسا دشمن ہے جو کھلم کھلا گمراہ کر دینے والا ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {قَالَ رَبِّ اِنِّيْ ظَلَمْتُ نَفْسِيْ فَاغْفِرْ لِيْ …:} گو موسیٰ علیہ السلام نے جاان بوجھ کر قتل نہیں کیا تھا، مگر پیغمبروں کی شان بڑی ہے، ان کی شان کے لحاظ سے یہ بے احتیاطی بھی مناسب نہ تھی، اس لیے موسیٰ علیہ السلام نے اسے گناہ سمجھا اور اللہ تعالیٰ سے مغفرت کے طلب گار ہوئے۔ چنانچہ اللہ تعالیٰ نے ان کی مغفرت فرما دی، مگر موسیٰ علیہ السلام اس کے بعد بھی نادم رہے اور قیامت کے دن جب لوگ ان کے پاس جائیں گے کہ اللہ تعالیٰ کے پاس ہماری شفاعت کیجیے تو اپنی ندامت کا اظہار ان الفاظ میں کریں گے: [ إِنِّيْ قَتَلْتُ نَفْسًا لَمْ أُوْمَرْ  بِقَتْلِهَا ] [ مسلم، الإیمان، باب أدنٰی أھل الجنۃ منزلۃ فیھا : ۱۹۴ ] ’’میں نے ایک شخص قتل کر دیا جس کے قتل کا مجھے حکم نہیں دیا گیا تھا۔‘‘ ¤ ➋ قرآن کے بیان سے ظاہر ہے کہ موسیٰ علیہ السلام سے یہ قتل نا دانستہ ہوا تھا، مگر بائبل موسیٰ علیہ السلام کوو قتلِ عمد کا مجرم ٹھہراتی ہے۔ چنانچہ اس کی روایت ہے کہ ’’مصری اور اسرائیلی کو لڑتے دیکھ کر موسیٰ علیہ السلام نے اِدھر اُدھر نگاہ کی اور جب دیکھا کہ وہاں کوئی دوسرا آدمی نہیں ہے، تو اس مصری کو جان سے مار کر اسے ریت میں چھپا دیا۔‘‘ (خروج : ۲ : ۱۲) یہ یہود کی ان تحریفات میں سے ہے جن کی اصلاح قرآن نے فرمائی، جو پہلی تمام کتابوں پر مہیمن ہے۔ ¤ ➌ موسیٰ علیہ السلام کی دعا {’’ فَاغْفِرْ لِيْ ‘‘} میں بخشش کی درخواست کے ساتھ پردہ ڈالنے کی درخواست کا مفہوم بھی شامل ہے۔ {’’مِغْفَرٌ ‘‘} اس خَود کو کہتے ہیں جس کے ساتھ جنگ میں سر ڈھانپتے ہیں۔ چنانچہ اللہ تعالیٰ نے موسیٰ علیہ السلام کو معاف فرما دیا اور اس واقعہ پر پردہ بھی ڈال دیا اور اگلے دن پیش آنے والے واقعہ تک کسی کو خبر نہیں ہوئی کہ قتل کس نے کیا ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {قَالَ رَبِّ بِمَاۤ اَنْعَمْتَ عَلَيَّ … : ’’ بِمَاۤ ‘‘} میں باء سببیت کے لیے ہے، یعنی اے میرے رب! تو نے جو مجھ پر انعام کیا کہ مجھے ہر قسم کی نعمت سے نوازا اور میرے فعل پر پردہ ڈال دیا، اس وجہ سے میں تجھ سے عہد کرتا ہوں کہ آئندہ کبھی مجرموں کا مددگار نہیں بنوں گا۔ ممکن ہے موسیٰ علیہ السلام کی مراد مجرم سے وہ اسرائیلی ہو جس کی انھوں نے مدد کی تھی، کیونکہ وہ جرم کا سبب بنا تھا اور یہ بھی ممکن ہے کہ موسیٰ علیہ السلام نے ’’مجرمین‘‘ سے فرعون اور اس کی قوم کے لوگ مراد لیے ہوں، کیونکہ وہ اللہ تعالیٰ کے نافرمان اور مجرم تھے اور ان کے اللہ تعالیٰ کے حضور عہد کرنے کا مطلب یہ ہو کہ تو نے جو مجھے نعمت و عزت اور راحت و قوت عطا فرمائی ہے اس کا شکر یہ ہے کہ اسے ان مجرموں کی حمایت و اِعانت میں صرف نہ کروں، بلکہ ان سے اپنا تعلق منقطع کر لوں اور اس ظالم حکومت کا کل پُرزہ نہ بنوں۔ ابن جریر اور بہت سے دوسرے مفسرین نے موسیٰ علیہ السلام کے اس عہد کا یہی مطلب لیا ہے اور حافظ ابن کثیر نے بھی اس کے مطابق تفسیر فرمائی ہے۔ اس آیت سے ظالم حکمرانوں کا ساتھ دینے اور ان کا تعاون کرنے کی ممانعت ثابت ہوتی ہے۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 19،18) {فَاَصْبَحَ فِي الْمَدِيْنَةِ خَآىِٕفًا يَّتَرَقَّبُ …:} موسیٰ علیہ السلام کے ہاتھوں قبطی قتل ہو گیا تھا، اس لیے انھوں نے شہر میں اس حال میں صبح کی کہ کل کے واقعہ سے خوف زدہ تھے اور انتظار کر رہے تھے کہ اس کا نتیجہ کیا نکلتا ہے اور کب کوئی انھیں گرفتار کرنے کے لیے آتا ہے۔ اچانک کیا دیکھتے ہیں کہ وہی اسرائیلی جس نے کل ان سے ایک قبطی سے بچانے کے لیے مدد مانگی تھی، وہ ایک اور قبطی سے لڑ رہا ہے۔ جب موسیٰ علیہ السلام وہاں سے گزرے تو اس نے چیخ چیخ کر انھیں مدد کے لیے پکارنا شروع کر دیا۔ موسیٰ علیہ السلام کل کے واقعہ سے آزردہ تھے، اسے کہنے لگے، یقینا تو کھلا گمراہ شخص ہے، یعنی ہر روز کسی نہ کسی سے لڑتا جھگڑتا رہتا ہے، کل ایک شخص سے لڑ رہا تھا، آج ایک اور سے جھگڑ ا مول لیے کھڑا ہے۔ مطلب یہ تھا کہ کل تیرے سبب سے میں ایک جان کو قتل کر چکا ہوں، اب تو نے پھر وہی ماحول بنا دیا ہے۔ پھر جوں ہی موسیٰ علیہ السلام نے اس قبطی کو پکڑنے کا ارادہ کیا، چونکہ انھوں نے ابھی اسرائیلی کو ڈانٹا تھا، اس لیے وہ موسیٰ علیہ السلام کے تیور دیکھ کر ڈر گیا اور سمجھا کہ وہ اسے پکڑنا چاہتے ہیں۔ اس نے جان بچانے کے لیے کہا، موسیٰ! تم مجھے بھی قتل کرنا چاہتے ہو! جیسے تم نے کل ایک بندہ قتل کر دیا تھا۔ اس سے پہلے یہ راز موسیٰ اور اسرائیلی کے سوا کسی کو معلوم نہ تھا۔ قبطی نے یہ بات سنی تو فوراً جا کر فرعون کو اطلاع دی، فرعون شدید غضب ناک ہوا اور اس نے خود اپنے سرداروں کی مجلس بلا کر فیصلہ کیا کہ اب اس کے سوا کوئی حل نہیں کہ موسیٰ کو قتل کر دیا جائے۔ {’’ فَلَمَّاۤ اَنْ اَرَادَ ‘‘} میں {’’ اَنْ ‘‘} کے فائدے کے لیے دیکھیے سورۂ یوسف (۹۶)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19،18) {فَاَصْبَحَ فِي الْمَدِيْنَةِ خَآىِٕفًا يَّتَرَقَّبُ …:} موسیٰ علیہ السلام کے ہاتھوں قبطی قتل ہو گیا تھا، اس لیے انھوں نے شہر میں اس حال میں صبح کی کہ کل کے واقعہ سے خوف زدہ تھے اور انتظار کر رہے تھے کہ اس کا نتیجہ کیا نکلتا ہے اور کب کوئی انھیں گرفتار کرنے کے لیے آتا ہے۔ اچانک کیا دیکھتے ہیں کہ وہی اسرائیلی جس نے کل ان سے ایک قبطی سے بچانے کے لیے مدد مانگی تھی، وہ ایک اور قبطی سے لڑ رہا ہے۔ جب موسیٰ علیہ السلام وہاں سے گزرے تو اس نے چیخ چیخ کر انھیں مدد کے لیے پکارنا شروع کر دیا۔ موسیٰ علیہ السلام کل کے واقعہ سے آزردہ تھے، اسے کہنے لگے، یقینا تو کھلا گمراہ شخص ہے، یعنی ہر روز کسی نہ کسی سے لڑتا جھگڑتا رہتا ہے، کل ایک شخص سے لڑ رہا تھا، آج ایک اور سے جھگڑ ا مول لیے کھڑا ہے۔ مطلب یہ تھا کہ کل تیرے سبب سے میں ایک جان کو قتل کر چکا ہوں، اب تو نے پھر وہی ماحول بنا دیا ہے۔ پھر جوں ہی موسیٰ علیہ السلام نے اس قبطی کو پکڑنے کا ارادہ کیا، چونکہ انھوں نے ابھی اسرائیلی کو ڈانٹا تھا، اس لیے وہ موسیٰ علیہ السلام کے تیور دیکھ کر ڈر گیا اور سمجھا کہ وہ اسے پکڑنا چاہتے ہیں۔ اس نے جان بچانے کے لیے کہا، موسیٰ! تم مجھے بھی قتل کرنا چاہتے ہو! جیسے تم نے کل ایک بندہ قتل کر دیا تھا۔ اس سے پہلے یہ راز موسیٰ اور اسرائیلی کے سوا کسی کو معلوم نہ تھا۔ قبطی نے یہ بات سنی تو فوراً جا کر فرعون کو اطلاع دی، فرعون شدید غضب ناک ہوا اور اس نے خود اپنے سرداروں کی مجلس بلا کر فیصلہ کیا کہ اب اس کے سوا کوئی حل نہیں کہ موسیٰ کو قتل کر دیا جائے۔ {’’ فَلَمَّاۤ اَنْ اَرَادَ ‘‘} میں {’’ اَنْ ‘‘} کے فائدے کے لیے دیکھیے سورۂ یوسف (۹۶)۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { وَ جَآءَ رَجُلٌ مِّنْ اَقْصَا الْمَدِيْنَةِ يَسْعٰى …:} ادھر فرعون کے آدمی موسیٰ علیہ السلام کو گرفتار کرنے کے لیے روانہ ہوئے، ادھر مجلس میں موجود ایک شخص فوراً شہر کے سب سے دور کنارے سے گلیوں بازاروں کے قریب ترین راستے سے دوڑتا ہوا آیا اور موسیٰ علیہ السلام سے کہنے لگا، موسیٰ! سردار تمھیں قتل کرنے کا مشورہ کر رہے ہیں، اس لیے فوراً یہاں سے نکل جاؤ، میں تمھارے خیر خواہوں میں سے ہوں۔ ¤ ➋ سورۂ یٰس میں ہے : «{ وَ جَآءَ مِنْ اَقْصَا الْمَدِيْنَةِ رَجُلٌ يَّسْعٰى }» [ یٰس : ۲۰ ] جب کہ یہاں ہے : «{ وَ جَآءَ رَجُلٌ مِّنْ اَقْصَا الْمَدِيْنَةِ يَسْعٰى }» مفسرین نے فرمایا، ہر مقام پر وہ لفظ پہلے لایا جاتا ہے جو وہاں اہم ہوتا ہے۔ اس مقام پر اس آدمی کی مردانگی بیان کرنا اہم ہے، اس لیے {’’ رَجُلٌ ‘‘} کا لفظ پہلے ذکر فرمایا، کیونکہ فرعون کا راز فاش کرنے کے نتیجے سے آگاہ ہونے کے باوجود اس نے اپنی جان کی پروا نہ کرتے ہوئے موسیٰ علیہ السلام کو یہ اطلاع دی اور یہ کسی مرد ہی کا کام ہو سکتا تھا، پھر یہ بھی اس کی مردانگی تھی کہ بہت دور جگہ سے سرکاری دستے سے پہلے پہنچ گیا۔ ¤ ➌ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یہ سنایا ہمارے پیغمبر کو کہ لوگ ان کی جان لینے کی فکر کریں گے اور وہ بھی وطن سے نکلیں گے، چنانچہ کافر سب اکٹھے ہوئے تھے کہ ان پر مل کر چوٹ کریں، اسی رات میں آپ وطن سے ہجرت کر گئے۔‘‘ (موضح)"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) { فَخَرَجَ مِنْهَا خَآىِٕفًا يَّتَرَقَّبُ …:’’ يَتَرَقَّبُ ‘‘ ’’رَقَبَةٌ ‘‘} سے ہے، گردن پھیرکر ادھر ادھر دیکھنا، انتظار کرنا۔ موسیٰ علیہ السلام کے علم میں یہ بات آئی تو فوراً اکیلے ہی اس شہر سے نکل کھڑے ہوئے۔ اس سے پہلے انھیں ایسا کوئی سابقہ پیش نہیں آیا تھا، بلکہ وہ شہزادے کی حیثیت سے نہایت خوش حالی کے ساتھ راحت و آرام کی زندگی بسر کر رہے تھے۔ اب شہر سے اِدھر اُدھر دیکھتے ہوئے دشمن کی گرفت سے بچتے ہوئے نکلے، اللہ تعالیٰ سے دعا کی کہ اے میرے رب! جس طرح تو نے میری معجزانہ طریقے سے پرورش فرمائی مجھے ان ظالم لوگوں سے نجات عطا فرما۔ ظالم اس لیے فرمایا کہ پہلے بے شمار مظالم کے علاوہ ان کا تازہ ترین ظلم یہ تھا کہ وہ موسیٰ علیہ السلام کے قتل کے در پے ہو گئے تھے، جو صریح ظلم تھا، کیونکہ قتل خطا کی سزا کسی قانون میں بھی قتل نہیں ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {وَ لَمَّا تَوَجَّهَ تِلْقَآءَ مَدْيَنَ …:} اللہ تعالیٰ نے موسیٰ علیہ السلام کی دعا قبول فرمائی اور انھیں اس راستے پر ڈال دیا جو مدین کی طرف جاتا تھا۔ مدین خلیج عقبہ کے مغربی ساحل پر ’’مقنا‘‘ سے چند میل بجانب شمال واقع تھا، آج کل اسے {’’اَلْبِدَعْ‘‘} کہتے ہیں۔ اس زمانے میں مدین فرعون کی سلطنت سے باہر تھا۔ مصر کی حکومت پورے جزیرہ نمائے سینا پر نہیں تھی، بلکہ صرف اس کے مغربی اور جنوبی علاقے تک محدود تھی۔ خلیج عقبہ کے مشرقی اور مغربی ساحل، جن پر بنی مدیان آباد تھے، وہ مصری اقتدار سے آزاد تھے، اس لیے موسیٰ علیہ السلام نے مصر سے نکلتے ہی مدین کا رخ کیا، کیونکہ قریب ترین آزاد اور آباد علاقہ وہی تھا، لیکن وہاں جانے کے لیے انھیں گزرنا بہرحال مصر کے مقبوضہ علاقوں ہی سے تھا اور مصر کی فوج سے بچ کر نکلنا تھا، اس لیے انھوں نے اللہ تعالیٰ سے دعا کی کہ مجھے سیدھے راستے پر ڈال دے، جس سے میں صحیح سلامت مدین پہنچ جاؤں۔ (تفہیم القرآن) ¤ ➋ ابن ابی حاتم نے صحیح سند کے ساتھ سعید بن جبیر کے واسطے سے ابن عباس رضی اللہ عنھما کا قول ذکر کیا ہے کہ ’’موسیٰ علیہ السلام مصر سے مدین کی طرف چلے تو ان کے پاس راستے میں سبزی اور درختوں کے پتوں کے سوا کھانے کی کوئی چیز نہ تھی، حتیٰ کہ پاؤں سے ننگے ہو گئے۔ مدین پہنچنے سے پہلے ہی ان کے پاؤں کے جوتے ٹوٹ کر گر گئے۔ جب سائے میں جا کر بیٹھے تو اس وقت وہ ساری مخلوق میں اللہ کے چنے ہوئے بندے تھے اور حال یہ تھا کہ بھوک سے پیٹ پیٹھ سے لگا ہوا تھا۔‘‘"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ { وَ لَمَّا وَرَدَ مَآءَ مَدْيَنَ …:} یعنی جب مدین پہنچے تو اس کے کنویں پر دیکھا کہ لوگوں کا ایک ہجوم ہے، جو اپنے جانوروں کو پانی پلا رہا ہے۔ مدین ایک قبیلے کا نام بھی ہے، جو مدین بن ابراہیم کی اولاد سے تھا۔ اس لحاظ سے موسیٰ علیہ السلام کا ان سے نسبی تعلق بھی تھا، کیونکہ وہ بھی ابراہیم علیہ السلام کے پوتے یعقوب علیہ السلام کی اولاد سے تھے۔ (ابن عاشور) ¤ ➋ { وَ وَجَدَ مِنْ دُوْنِهِمُ امْرَاَتَيْنِ تَذُوْدٰنِ: ’’ذَادَ يذُوْدُ ذَوْدًا‘‘} ہٹانا۔ موسیٰ علیہ السلام نے دیکھا کہ دو عورتیں مردوں سے الگ ایک کنارے پر کھڑی ہیں اور اپنی بھیڑ بکریوں کو پانی کی طرف جانے سے ہٹا رہی ہیں، تاکہ ایسا نہ ہو کہ وہ پانی پینے کے لیے لوگوں کی بکریوں میں گھس جائیں اور پھر گم ہو جائیں۔ اتنی قوت نہ تھی کہ مجمع کو ہٹا دیں یا خود بھاری ڈول نکال لیں۔ ¤ ➌ { قَالَ مَا خَطْبُكُمَا:} موسیٰ علیہ السلام کو ان کا حال دیکھ کر رحم آیا اور ان سے پوچھا کہ تم یہاں کیوں کھڑی ہو، پانی کیوں نہیں پلاتی؟ ¤ ➍ { قَالَتَا لَا نَسْقِيْ حَتّٰى يُصْدِرَ الرِّعَآءُ:’’ الرِّعَآءُ ‘‘ ’’رَاعِيٌّ‘‘} کی جمع ہے، چرواہے۔ {’’أَصْدَرَ يُصْدِرُ‘‘} پانی پلا کر واپس لے جانا۔ انھوں نے کہا، جب تک یہ چرواہے اپنے جانوروں کو پانی پلا کر واپس نہ لے جائیں، ہم پانی نہیں پلاتیں، کیونکہ ہمارا باپ بہت بوڑھا اور کمزور ہے، یہاں آنے کے قابل نہیں، نہ وہ پانی نکال سکتا ہے نہ ہم بھاری ڈول نکال سکتی ہیں، چرواہے چلے جائیں تو ان کا بچا کھچا پانی ہم پلا لیں گی، یا بعد میں ڈول میں تھوڑا تھوڑا پانی نکال کر انھیں پانی پلا لیں گی۔ ان عورتوں کا نام مفسرین نے ’’صفورا‘‘ اور ’’ لیا ‘‘ بیان کیا ہے، مگر یہ بات کسی معتبر ذریعے سے ثابت نہیں۔ ¤ ➎ { وَ اَبُوْنَا شَيْخٌ كَبِيْرٌ:} ان خواتین کے والد کے متعلق مشہور یہ ہے کہ وہ شعیب علیہ السلام تھے۔ اس کی بنیاد اس کے سوا کچھ نہیں کہ مدین کی طرف شعیب علیہ السلام مبعوث ہوئے تھے، مگر اس سے یہ کیسے ثابت ہو گیا کہ مدین کے وہ بزرگ جنھوں نے موسیٰ علیہ السلام کی میزبانی کی وہ بھی شعیب علیہ السلام ہی تھے۔ علماء فرماتے ہیں کہ شعیب علیہ السلام کا زمانہ موسیٰ علیہ السلام سے بہت پہلے کا ہے، کیونکہ انھوں نے اپنی قوم سے کہا تھا : «{ وَ مَا قَوْمُ لُوْطٍ  مِّنْكُمْ بِبَعِيْدٍ }» [ ھود : ۸۹ ] ’’اور لوط کی قوم (بھی) ہر گز تم سے کچھ دور نہیں ہے۔‘‘ اور سب جانتے ہیں کہ لوط اور ابراہیم علیھما السلام ایک زمانے میں ہوئے ہیں اور ابراہیم علیہ السلام موسیٰ علیہ السلام سے صدیوں پہلے گزرے ہیں۔ ابن کثیر فرماتے ہیں : ’’اس کی تائید کہ وہ بزرگ شعیب علیہ السلام نہیں تھے، اس بات سے بھی ہوتی ہے کہ اگر وہ شعیب علیہ السلام ہوتے تو غالب گمان یہی ہے کہ قرآن میں ان کا نام مذکور ہوتا۔ بعض احادیث میں موسیٰ علیہ السلام کے قصہ میں ان کے نام کی تصریح ملتی ہے، مگر ان میں سے کسی کی سند صحیح نہیں، جیسا کہ ہم آگے ذکر کریں گے۔‘‘ (ابن کثیر) بنی اسرائیل کی کتابوں میں ان کا نام ’’ثیرون‘‘ آیا ہے، ایک جگہ ان کانام ’’رعوائیل‘‘ آیا، دوسری جگہ ’’یترو‘‘ آیا ہے اور ایک جگہ ’’حوباب‘‘ آیا ہے۔ علمائے اسلام میں سے بعض نے ان کا نام ’’یثریٰ‘‘ بیان کیا ہے، مگر ظاہر یہ ہے کہ یہ بات ثابت شدہ خبر کے بغیر معلوم نہیں ہو سکتی، جو یہاںموجود نہیں۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { فَسَقٰى لَهُمَا:} پیغمبروں میں فطری طور پر ہمدردی کا بے پناہ جذبہ ہوتا ہے، جیسا کہ اُمّ المومنین خدیجہ رضی اللہ عنھا نے رسول اللہ صلی اللہ علیہ وسلم سے کہا تھا : [كَلَّا، وَاللّٰهِ! مَا يُخْزِيْكَ اللّٰهُ أَبَدًا، إِنَّكَ لَتَصِلُ الرَّحِمَ، وَ تَحْمِلمِلُ الْكَلَّ وَتَكْسِبُ الْمَعْدُوْمَ وَ تَقْرِي الضَّيْفَ وَ تُعِيْنُ عَلٰی نَوَائِبِ الْحَقِّ ] [ بخاري، بدء الوحي، باب کیف کان بدء الوحي …: ۳ ] ’’ہر گز (ایسا) نہیں (ہو گا)، اللہ کی قسم! اللہ تعالیٰ آپ کو کبھی رسوا نہیں کرے گا، کیونکہ آپ تو صلہ رحمی کرتے ہیں اور بے کسوں کا بوجھ اٹھاتے ہیں اور بے روز گار کے لیے کام ڈھونڈھتے ہیں اور مہمان کی مہمان نوازی کرتے ہیں اور حق کی طرف سے آنے والی مصیبتوں پر مدد کرتے ہیں۔‘‘موسیٰ علیہ السلام تھکے ماندے اور بھوکے پیاسے تھے، اس کے باوجود انھوں نے ان کی بکریوں کو پلانی پلا دیا۔ ابن کثیر رحمہ اللہ نے یہاں ابن ابی شیبہ کی ایک روایت نقل کی ہے کہ عمر بن خطاب رضی اللہ عنہ نے فرمایا : ’’موسیٰ علیہ السلام جب مدین کے پانی پر پہنچے تو وہاں لوگوں کی ایک جماعت کو پایا جو پانی پلا رہے تھے۔ جب وہ فارغ ہو گئے تو انھوں نے کنویں پر دوبارہ پتھر رکھ دیا، جسے دس آدمی ہی اٹھا سکتے تھے۔ موسیٰ علیہ السلام نے دیکھا کہ دو عورتیں ہیں جو اپنے جانوروں کو ہٹا رہی ہیں، ان سے پوچھا : ’’تمھارا معاملہ کیا ہے؟‘‘ انھوں نے اپنا ماجرا بیان کیا، تو آپ نے جا کر وہ پتھر اٹھایا اور ایک ہی ڈول نکالا تھا کہ بکریاں سیراب ہو گئیں۔‘‘ [ ابن کثیر : 227/6 ] ابن کثیر نے فرمایا : ’’اس کی سند صحیح ہے، حاکم نے بھی اسے صحیح کہا اور ذہبی نے ان کی موافقت کی ہے۔‘‘ ¤ ➋ { ثُمَّ تَوَلّٰۤى اِلَى الظِّلِّ:} بقاعی لکھتے ہیں : ’’پھر جس طرف ان کا رخ تھا اس طرف پیٹھ کر کے سائے کی طرف چلے گئے، تاکہ وہاں آرام کر سکیں اور مخلوق کی خیر خواہی اور مدد کے بعد خالق کی طرف متوجہ ہوئے۔ {’’ الظِّلِّ ‘‘} کو معرفہ اس لیے ذکر فرمایا کہ جہاں لوگ کثرت سے آتے جاتے ہوں وہاں سائے کی موجودگی انوکھی نہیں، بلکہ جانی پہچانی بات ہے، خصوصاً جہاں پانی بھی ہو۔‘‘ ¤ ➌ { فَقَالَ رَبِّ اِنِّيْ لِمَاۤ اَنْزَلْتَ اِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ:} اللہ تعالیٰ سے دعا کرتے ہوئے موسیٰ علیہ السلام نے اس کی صفات میں سے صفت ’’رب‘‘ کے واسطے سے دعا کی، کیونکہ اس وقت ان کا حال صفت ربوبیت سے فریاد کا تقاضا کرتا تھا۔ بھوک اتنی کہ پیٹ پیٹھ سے لگا ہوا تھا۔ بے وطنی ایسی کہ کوئی واقفیت نہ کوئی مونس و غم خوار، کوئی گھر نہ ٹھکانا، دشمن کے تعاقب کا مسلسل خوف، غرض ہر لحاظ سے فقر ہی فقر۔ ایسی حالت میں انھوں نے کسی مخلوق کے ساتھ شکوہ نہیں کیا، بلکہ اپنے رب ہی کی جناب میں درخواست پیش کی کہ اے میرے پالنے والے! میں تو جو خیر بھی تو میری طرف نازل فرمائے اس کا محتاج ہوں۔ ’’نازل فرمائے‘‘ کا لفظ اس لیے بولا کہ آدمی کو جو کچھ ملتا ہے آسمان سے آتا ہے، جیسا کہ فرمایا : «{ وَ فِي السَّمَآءِ رِزْقُكُمْ وَ مَا تُوْعَدُوْنَ }» [الذاریات : ۲۲ ]’’اور آسمان ہی میں تمھارا رزق ہے اور وہ بھی جس کا تم وعدہ دیے جاتے ہو۔‘‘ حقیقت یہ ہے کہ موسیٰ علیہ السلام کی یہ دعا نہایت جامع دعا ہے، دنیا اور آخرت کی کوئی بھلائی ایسی نہیں جو اس میں نہ آگئی ہو۔ طویل سفر کے بعد غربت اور فقر و فاقہ کی حالت میں عجزو انکسار سے بھری ہوئی یہ جامع دعا موسیٰ علیہ السلام کے لبوں سے نکلی تو ساتھ ہی قبولیت کے آثار بھی ظاہر ہونا شروع ہو گئے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ {فَجَآءَتْهُ اِحْدٰىهُمَا تَمْشِيْ عَلَى اسْتِحْيَآءٍ: ’’عَلٰي حَيَاءٍ‘‘} کا معنی ہے حیا کے ساتھ، {’’ عَلَى اسْتِحْيَآءٍ ‘‘} میں حروف زیادہ ہونے سے معنی میں اضافہ ہو گیا، یعنی بہت حیا کے ساتھ۔ ¤ ➋ شاہ عبد القادر لکھتے ہیں : ’’عورتوں نے پہچانا کہ چھاؤں پکڑتا ہے مسافر ہے، دور سے آیا ہوا تھکا، بھوکا، جا کر اپنے باپ سے کہا۔‘‘ ابن کثیر لکھتے ہیں : ’’جب وہ دونوں باپ کے پاس جلدی واپس پہنچ گئیں تو اسے تعجب ہوا اور اس نے ان سے اس کے متعلق پوچھا، انھوں نے موسیٰ علیہ السلام کے احسان کا ذکر کیا، تو اس نے ان میں سے ایک کو انھیں بلانے کے لیے بھیجا۔‘‘ ¤ ➌ ’’ تو ان دونوں میں سے ایک بہت حیا کے ساتھ چلتی ہوئی موسیٰ کے پاس آئی۔‘‘ سبحان اللہ ! وہ خاتون کس قدر باحیا ہو گی جس کے بہت حیا کی شہادت رب العالمین نے دی ہے۔ {’’ تَمْشِيْ بِاسْتِحْيَاءٍ‘‘} کے بجائے {’’ تَمْشِيْ عَلَىى اسْتِحْيَآءٍ ‘‘} اس لیے فرمایا گویا وہ حیا کی سواری پر سوار ہو کر چلی آ رہی تھی، حیا کی ہر صورت اس کی دسترس میں تھی۔ ابن ابی حاتم نے عمر رضی اللہ عنہ سے نقل کیا ہے کہ انھوں نے فرمایا : [ «{ فَجَآءَتْهُ اِحْدٰىهُمَا تَمْشِيْ عَلَىى اسْتِحْيَآءٍ }» قَائِلَةٌ بِثَوْبِهَا عَلٰیی وَجْهِهَا لَيْسَتْ بِسَلْفَعِ مِنَ النِّسَاءِ وَلَّاجَةً، خَرَّاجَةً ] [ طبري : ۲۷۵۸۵۔ ابن أبي حاتم : ۱۶۸۳۲] ’’وہ نہایت حیا کے ساتھ اپنا کپڑا چہرے پر ڈالے ہوئے آئی، بے باک عورتوں کی طرح نہیں جو بے دھڑک اور بے خوف چلی آتی ہوں، ہر جگہ جا گھستی ہر طرف نکل جاتی ہوں۔‘‘ ابن کثیر نے فرمایا : {’’ هٰذَا إِسْنَادٌ صَحِيْحٌ ‘‘} اور تفسیر ابن کثیر کے محقق حکمت بن بشیر نے فرمایا : {’’وَ سَنَدُهُ صَحِيْحٌ۔‘‘} ظاہر یہی ہے کہ یہ اسرائیلی روایت ہے، مگر اس سے معلوم ہوتا ہے کہ صحابہ کرام رضی اللہ عنھم کے ہاں حیا کا مطلب کیا تھا۔ جو لوگ چہرے کے پردے کے قائل نہیں انھیں غور کرنا چاہیے کہ امیر المومنین چہرہ ڈھانکنے کو حیا قرار دے رہے ہیں۔ ¤ ➍ { قَالَتْ اِنَّ اَبِيْ يَدْعُوْكَ:} اس خاتون کے بلانے کے انداز سے بھی اس کی کمال دانائی اور حیا ظاہر ہو رہی ہے۔ اس نے اپنی طرف سے ساتھ چلنے کو نہیں کہا، بلکہ باپ کی طرف سے پیغام دیا، کیونکہ ایک باحیا خاتون کو زیب ہی نہیں دیتا کہ کسی اجنبی مرد کو ساتھ چلنے کے لیے کہے۔ ¤ ➎ { لِيَجْزِيَكَ اَجْرَ مَا سَقَيْتَ لَنَا:} یہ بات بھی اس نے حیا ہی کی وجہ سے کہی، کیونکہ ایک غیر مرد کو ساتھ لے جانے کی کوئی معقول وجہ ہونی چاہیے، اس کے بغیر شبہات پیدا ہو سکتے تھے، جن کا اس نے پہلے ہی سدباب کر دیا۔ ¤ ➏ یہاں مفسرین نے ایک سوال اٹھایا ہے کہ انبیاء تو احسان کا بدلا نہیں لیتے، پھر موسیٰ علیہ السلام پانی پلانے کی اجرت لینے کے لیے کیوں چل پڑے؟ جواب اس کا ایک تو یہ ہے کہ یہ معروف معنوں میں اجرت نہیں، بلکہ احسان کا بدلا ہے، احسان کے بدلے میں کوئی احسان کرے تو اسے قبول کرنے میں کوئی مضائقہ نہیں، جیسا کہ فرمایا : «{ هَلْ جَزَآءُ الْاِحْسَانِ اِلَّا الْاِحْسَانُ }» [الرحمٰن : ۶۰ ]’’نیکی کا بدلا نیکی کے سوا کیا ہے۔‘‘ اور نبی صلی اللہ علیہ وسلم ہدیہ قبول کرتے تھے اور اس کا بدلا بھی دیتے تھے، حدیث کے الفاظ ہیں: [ كَانَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يَقْبَلُ الْهَدِيَّةَ وَ  يُثِيْبُ عَلَيْهَا ] [بخاري، الھبۃ، باب المکافأۃ في الھبۃ : ۲۵۸۵ ] پھر موسیٰ علیہ السلام اس وقت سخت اضطرار کی حالت میں تھے، انھوں نے اس دعوت کو اپنی دعا کی قبولیت کا نتیجہ سمجھا اور خواہ مخواہ کی خود داری سے اللہ تعالیٰ کے پیدا کردہ اس موقع کو ضائع نہیں کیا۔ دوسرا جواب اس کا یہ ہے کہ اگر کسی کو اصرار ہو کہ یہ اجرت ہی تھی تو محنت کے بدلے میں مزدوری لینا موسیٰ علیہ السلام منع نہیں سمجھتے تھے، نہ ہی یہ منع ہے، خصوصاً جب کوئی بلا طلب مزدوری دے دے، جیسا کہ خضر علیہ السلام کے واقعہ میں ہے کہ جب انھوں نے گرتی ہوئی دیوار سیدھی کر دی تو موسیٰ علیہ السلام نے ان سے کہا : «{ لَوْ شِئْتَ لَتَّخَذْتَ عَلَيْهِ اَجْرًا }» [ الکہف : ۷۷ ] ’’اگر تو چاہتا تو ضرور اس پر کچھ اجرت لے لیتا۔‘‘ ¤ ➐ { فَلَمَّا جَآءَهٗ وَ قَصَّ عَلَيْهِ الْقَصَصَ:} جب موسیٰ علیہ السلام اس بزرگ کے پاس آئے تو ظاہر ہے سب سے پہلی بات تعارف تھا، چنانچہ موسیٰ علیہ السلام نے اپنا نام و نسب، اپنی قوم پر فرعون کا ظلم و ستم، اپنی پیدائش اور پرورش کا قصہ اور ایک نادانستہ قتل پر فرعون کے ان کی جان کے درپے ہونے کا حال بیان کیا۔ ¤ ➑ { قَالَ لَا تَخَفْ …:} اس بزرگ نے کھانا وغیرہ پیش کرنے سے پہلے موسیٰ علیہ السلام کا خوف دور کیا، کیونکہ خوف میں مبتلا شخص بھوک کے مارے کھانا کھائے بھی تو اس میں اسے لذت نہیں ملتی، اس لیے سب سے پہلے اس نے کہا ڈرو مت، اس جگہ فرعون کی حکومت نہیں، تم ان ظالموں سے نجات پا چکے ہو۔ اس کے بعد نہایت عزت و احترام سے ان کی مہمان نوازی کی۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ { قَالَتْ اِحْدٰىهُمَا يٰۤاَبَتِ اسْتَاْجِرْهُ:} ان دونوں میں سے ایک نے کہا، ابا جان! آپ اسے مزدور رکھ لیں، تاکہ ہم عورتوں کو بکریاں چرانے کی مشقت سے رہائی مل جائے۔ ضروری نہیں کہ اس نے یہ بات موسیٰ علیہ السلام کی اس کے باپ سے پہلی ملاقات کے وقت ہی کہہ دی ہو۔ تین دن مہمان نوازی تو حق ہے، اس لیے غالب یہی ہے کہ اس دوران ان لڑکیوں اور ان کے والد نے موسیٰ علیہ السلام کے اوصاف حمیدہ کا اچھی طرح سے مشاہدہ کر لیا تو لڑکی نے اپنے باپ سے یہ بات کہی۔ ¤ ➋ { اِنَّ خَيْرَ مَنِ اسْتَاْجَرْتَ الْقَوِيُّ الْاَمِيْنُ:} تفسیر ابن کثیر میں ہے : ’’عمر، ابن عباس، شریح قاضی، ابو مالک، قتادہ، محمد بن اسحاق اور کئی ایک نے فرمایا کہ اس کے والد نے پوچھا، تمھیں یہ بات کیسے معلوم ہوئی؟ اس نے کہا، اس نے وہ پتھر اٹھا لیا جو دس آدمیوں سے کم اٹھا نہیں سکتے اور جب میں اس کے ساتھ آئی تو اس کے آگے چل رہی تھی، اس نے مجھ سے کہا، میرے پیچھے چلی آؤ اور جہاںراستہ بدلنا ہو مجھے کنکری کے ساتھ اشارہ کر دو، میں سمجھ جاؤں گا کس طرف جانا ہے۔‘‘ تفسیر ابن کثیر کے محقق حکمت بن بشیر نے فرمایا، عمر اور ابن عباس رضی اللہ عنھم کا قول ابن ابی حاتم نے صحیح سند کے ساتھ بیان کیا ہے۔ [ ابن أبي حاتم : ۱۶۸۴۳ ] دوسرے ائمہ کے اقوال بھی طبری (۲۷۶۰۹) یا ابن ابی حاتم نے صحیح سند کے ساتھ بیان کیے ہیں، مگر یہ رسول اللہ صلی اللہ علیہ وسلم سے مروی نہیں، اس لیے اس کا ماخذ اسرائیلی روایات ہی ہے۔ ¤ ➌ سب سے بہتر شخص جسے تم اجرت پر رکھو وہ ہے جو قوت والا اور امانت دار ہو۔ یہ ہے وہ قاعدہ جو کسی شخص کو ذمہ داری دیتے وقت ملحوظ رکھنا ضروری ہے۔ حقیقت یہ ہے کہ ایک وقت میں یہ دونوں صفات بہت کم لوگوں میں پائی جاتی ہیں۔ کوئی شخص اگر کام کی اہلیت اور قوت رکھتا ہے تو امانت میں کمزور ہے اور اگر امین ہے تو قوت و اہلیت نہیں رکھتا۔ آج کل حکومتیں کسی عہدے پر مقرر کرنے سے پہلے امتحانات اور انٹرویو کے ذریعے سے اہلیت کا اندازہ تو کرتی ہیں مگر امانت کا نہیں، نتیجہ بے حساب بد دیانتی اور خیانت ہے، جس نے مسلمان ملکوں کی معیشت اور معاشرت دونوں کا بیڑا غرق کر دیا ہے۔ ¤ ➍ اس بات سے اس لڑکی کی کمال فراست اور آدمیوں کی پہچان کا اندازہ ہوتا ہے۔ ابن ابی حاتم نے صحیح سند کے ساتھ نقل کیا ہے کہ عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا : ’’لوگوں میں سب سے زیادہ فراست والے تین ہیں، ابوبکر رضی اللہ عنہ کی فراست عمر رضی اللہ عنہ کے بارے میں، عزیز مصر کی یوسف علیہ السلام کے متعلق فراست، جب اس نے بیوی سے کہا : «{اَكْرِمِيْ مَثْوٰىهُ }» [ یوسف : ۲۱ ] ’’اس کی رہائش باعزت رکھ۔‘‘ اور موسیٰ علیہ السلام کے واقعہ والی خاتون کی فراست کہ جس نے کہا : «{ يٰۤاَبَتِ اسْتَاْجِرْهُ اِنَّ خَيْرَ مَنِ اسْتَاْجَرْتَ الْقَوِيُّ الْاَمِيْنُ }» [ القصص : ۲۶ ] ’’اے میرے باپ! اسے اجرت پر رکھ لے، کیونکہ سب سے بہتر شخص جسے تو اجرت پر رکھے طاقت ور، امانت دار ہی ہے۔‘‘ [ ابن أبي حاتم : ۱۶۸۳۸ ]"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { قَالَ اِنِّيْۤ اُرِيْدُ اَنْ اُنْكِحَكَ اِحْدَى ابْنَتَيَّ هٰتَيْنِ … :} باپ نے بییٹی کی رائے سے اتفاق کر لیا، مگر جوان بیٹیوں کی موجودگی میں ایک غیر محرم مرد کو گھر میں رکھنا مناسب نہیں تھا، اس لیے اس مرد دانا نے فیصلہ کیا کہ ایک بیٹی کا اس صالح جوان کے ساتھ نکاح کر کے اسے مزدور کے طور پر گھر میں رکھ لے۔ چنانچہ اس نے موسیٰ علیہ السلام سے کہا : «{ اِنِّيْۤ اُرِيْدُ }» ’’یقینا میں ارادہ رکھتا ہوں۔‘‘ اہل علم فرماتے ہیں، اس بزرگ نے {’’إِنَّ‘‘} کے ساتھ تاکید اس لیے کی کہ عام طور پر لوگ کسی اجنبی جوان کو جو مالی لحاظ سے بھی فقیر ہو، رشتہ دینے پر آمادہ نہیں ہوتے۔ اس لیے اس نے کہا، یقینا میں ارادہ رکھتا ہوں کہ اپنی ان دو بیٹیوں میں سے ایک کا نکاح تجھ سے کر دوں، اس شرط پر کہ تو آٹھ سال میری مزدوری کرے گا…۔ ¤ ➋ اس سے معلوم ہوا کہ کسی صالح آدمی کو اپنی بیٹی کے رشتے کی پیش کش خود کر دینے میں کوئی مضائقہ نہیں، بلکہ ایسا ہونا چاہیے۔ بے شمار لڑکیاں اس لیے نکاح سے محروم بیٹھی ہیں کہ ان کے والد انتظار میں ہیں کہ کوئی ہم سے رشتہ پوچھے، جبکہ لڑکوں کے والدین انکار کے خوف سے رشتہ مانگنے کی جرأت نہیں کرتے۔ نتیجہ اس کا لڑکے لڑکیوں دونوں کا نکاح سے محروم رہنا ہے۔ صحابہ کرام میں سے عمر رضی اللہ عنہ کا عمل اس کا بہترین نمونہ ہے۔ ان کی بیٹی حفصہ رضی اللہ عنھا خُنیس بن حذافہ رضی اللہ عنہ کے فوت ہونے سے بیوہ ہو گئی، جو نبی صلی اللہ علیہ وسلم کے بدری صحابہ میں سے تھے۔ عمر رضی اللہ عنہ نے فرمایا : ’’میں عثمان بن عفان رضی اللہ عنہ کے پاس گیا اور انھیں حفصہ کا رشتہ پیش کیا، انھوں نے کہا، میں اس بارے میں سوچوں گا، کچھ راتیں گزریں تو مجھے ملے اور کہنے لگے : ’’میری رائے یہی ٹھہری ہے کہ میں ان دنوں نکاح نہ کروں۔‘‘ عمر رضی اللہ عنہ فرماتے ہیں : ’’پھر میں ابوبکرصدیق رضی اللہ عنہ سے ملا اور ان سے کہا : ’’اگر آپ چاہیں تو میں حفصہ بنت عمر کا نکاح آپ سے کر دوں۔‘‘ ابوبکر خاموش رہے، مجھے کچھ جواب نہیں دیا، میں دل میں ان پر عثمان سے بھی زیادہ ناراض ہوا۔ چند راتیں گزریں تو رسول اللہ صلی اللہ علیہ وسلم نے اس کےے نکاح کا پیغام بھیج دیا، تو میں نے حفصہ کا نکاح آپ صلی اللہ علیہ وسلم سے کر دیا۔‘‘ [ بخاري، النکاح، باب عرض الإنسان ابنتہ أو أختہ علی أھل الخیر : ۵۱۲۲ ] دیکھیے عمر بن خطاب رضی اللہ عنہ سے بڑھ کر غیرت مند کون ہو گا، مگر اپنی بیٹی کے رشتے کی پیش کش خود کر رہے ہیں۔ ¤ ➌ بعض لوگ اس واقعہ سے استدلال کرتے ہیں کہ نکاح میں لڑکی کا مہر یہ ہو سکتا ہے کہ خاوند اس کے والد کی مزدوری کرے، مگر یہ استدلال درست نہیں، کیونکہ مہر عورت کا حق ہے نہ کہ اس کے باپ کا۔ حقیقت یہ ہے کہ قرآن کے بیان میں صرف نکاح کے ارادے اور اس کی شرط کا ذکر ہے کہ موسیٰ علیہ السلام کم از کم آٹھ سال اپنے سسر کے ساتھ رہیں گے، اس سے پہلے اپنی بیوی کو لے کر نہیں جائیں گے۔ اگر یہ عقد نکاح ہوتا تو اس میں دو لڑکیوں میں سے ایک لڑکی کی تعیین ہوتی اور ارادے کے الفاظ کے بجائے یہ الفاظ ہوتے کہ میں نے اپنی فلاں لڑکی کا نکاح اتنے مہر میں تمھارے ساتھ کیا۔ قرآن نے نکاح کے لیے ابتدائی گفتگو اور والد کی شرط کا ذکر کیا ہے، عقد نکاح اور مہر وغیرہ کی تفصیل کا ذکر چھوڑ دیا ہے، کیونکہ اس کے بیان کی یہاں ضرورت نہیں تھی۔ ¤ ➍ اس واقعہ سے مزدوری کرنے کا جواز بلکہ اس کا استحباب ثابت ہوتا ہے اور اس کے ضمن میں بکریاں رکھنے اور انھیں چرانے کی فضیلت بھی معلوم ہوتی ہے۔ ہمارے پیغمبر صلی اللہ علیہ وسلم نے بھی اجرت پر بکریاں چرائی ہیں۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ مَا بَعَثَ اللّٰهُ نَبِيًّا إِلَّا رَعَی الْغَنَمَ ] ’’اللہ تعالیٰ نے جو بھی نبی بھیجا اس نے بکریاں چرائی ہیں۔‘‘ آپ صلی اللہ علیہ وسلم کے اصحاب نے پوچھا : ’’تو کیا آپ نے بھی (چرائی ہیں)؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ نَعَمْ كُنْتُ أَرْعَاهَا عَلٰی قَرَاارِيْطَ لِأَهْلِ مَكَّةَ ] [ بخاري، الإجارۃ، باب رعي الغنم علی قراریط : ۲۲۶۲ ] ’’ہاں، میں اہل مکہ کے لیے چند قیراطوں پر بکریاں چرایا کرتا تھا۔‘‘ ¤ ➎ یہاں سوال پیدا ہوتا ہے کہ اتنی لمبی مدت تک بکریاں چرانے کی اجرت کیا تھی۔ بعض لوگوں کا کہنا ہے کہ مزدوری صرف کھانا اور کپڑا ہی تھی، جیسا کہ عتبہ بن نُدر السلمی رضی اللہ عنہ سے روایت ہے کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے، آپ صلی اللہ علیہ وسلم نے {’’ طٰسٓمّٓ ‘‘} کی تلاوت کی، یہاں تک کہ موسیٰ علیہ السلام کے قصے پر پہنچے، تو فرمایا : ’’موسیٰ علیہ السلام نے اپنی شرم گاہ کی عفت اور پیٹ کے کھانے پر آٹھ سال یا دس سال اپنے آپ کو مزدور بنائے رکھا۔‘‘ [ ابن ماجہ، الرھون، باب إجارۃ الأجیر علی طعام بطنہ : ۲۴۴۴ ] ابن کثیر رحمہ اللہ نے اس پر فرمایا : ’’اس طریق سے یہ حدیث ضعیف ہے، کیونکہ مسلمہ بن علی ( خُشنی، دمشقی اور ہلالی) ائمہ کے نزدیک روایت میں ضعیف ہے۔ ایک اور سند سے بھی یہ حدیث آئی ہے مگر اس میں بھی نظر ہے۔‘‘ ¤ ابن کثیر رحمہ اللہ نے بعض روایات نقل کی ہیں کہ جس سال موسیٰ علیہ السلام نے رخصت ہونا تھا اس سال ان کے سسر نے ان سے کہا کہ اس سال جو بکری اپنے رنگ سے مختلف بچہ دے وہ تمھارا ہو گا، مگر رسول اللہ صلی اللہ علیہ وسلم سے مروی ایسی کسی روایت کی سند صحیح نہیں۔ بعض صحابہ کے اقوال موجود ہیں، مگر ظاہر ہے کہ وہ اسرائیلیات سے ہیں، کیونکہ وہ صحابہ اس واقعہ کے وقت موجود نہیں تھے، نہ وہ رسول اللہ صلی اللہ علیہ وسلم سے یہ بات روایت کرتے ہیں۔ اس لیے بہتر یہ ہے کہ یہ بات اسی طرح چھوڑ دی جائے جس طرح قرآن نے تفصیل کے بغیر چھوڑ دی ہے، اگر یہ بات ہدایت کے لیے ضروری ہوتی تو اللہ تعالیٰ اسے ضرور بیان فرما دیتے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { قَالَ ذٰلِكَ بَيْنِيْ وَ بَيْنَكَ…:} موسیٰ علیہ السلام نے اپنے سسر سے کہا، آپ نے جو کہا کہ میں آٹھ سال آپ کی مزدوری کروں گا، یہ میرے اور آپ کے درمیان طے ہو گیا، اب یہ میری مرضی کی بات ہے کہ آٹھ برس کے بعد دو برس اور خدمت کروں یا آٹھ ہی برس بعد اپنی بیوی کو لے کر چلا جاؤں۔ دونوں صورتوں میں آپ مجھے مجبور نہیں کریں گے کہ ابھی اور خدمت کرو۔ ¤ ➋ { وَ اللّٰهُ عَلٰى مَا نَقُوْلُ وَكِيْلٌ:} یہ کلمہ عہد کو پختہ کرنے کے لیے کہا جاتا ہے۔ اس معاہدے کے بعد اس بزرگ نے اپنی ایک بیٹی کا نکاح موسیٰ علیہ السلام سے کر دیا اور اللہ تعالیٰ نے ’’خیر‘‘ کی تمام چیزیں ان کے لیے مہیا کر دیں، جن کی انھیں ضرورت تھی۔ ¤ ➌ سعید بن جبیر رحمہ اللہ کہتے ہیں کہ مجھ سے اہل حیرہ کے ایک یہودی نے پوچھا کہ موسیٰ علیہ السلام نے دو مدتوں میں سے کون سی مدت پوری کی تھی؟ میں نے کہا، مجھے معلوم نہیں جب تک میں عرب کے عالم کے پاس جا کر پوچھ نہ لوں۔ چنانچہ میں ابن عباس رضی اللہ عنھما کے پاس آیا اور ان سے پوچھا تو انھوں نے فرمایا : ’’انھوں نے وہ مدت پوری کی جو دونوں میں زیادہ اور بہتر تھی (یعنی دس سال)۔ اللہ کا رسول جب بات کرتا ہے تو اسے پورا کرتا ہے (یعنی ایسا شخص جو آئندہ رسول بننے والا ہے، وہی مدت پوری کرے گا جو زیادہ کامل ہے)۔‘‘ [ بخاري، الشہادات، باب : ۲۶۸۴ ] یہ ابن عباس رضی اللہ عنھما کا قول ہے اور بظاہر یہ ان کا اجتہاد ہے۔ ابن کثیر رحمہ اللہ نے اس مفہوم کی متعدد روایات نبی کریم صلی اللہ علیہ وسلم سے بھی نقل کی ہیں، مگر سند کے لحاظ سے سب میں کلام ہے، اگرچہ ان سے ابن عباس رضی اللہ عنھما کے قول کو تقویت حاصل ہوتی ہے۔ حافظ ابن کثیر نے فرمایا :{’’ فَلَمَّا قَضٰى مُوْسَى الْاَجَلَ ‘‘} سے بھی یہ بات نکلتی ہے کہ موسیٰ علیہ السلام نے وہ مدت پوری کی تھی جو زیادہ کامل تھی اور جس میں ان کے سسر کے ساتھ زیادہ حسن سلوک پایا جاتا تھا، کیونکہ{’’ الْاَجَلَ ‘‘} میں الف لام کا معنی کامل مدت ہے اور وہ مدت دس سال ہی ہے، جیسا کہ فرمایا : «{ فَمَنْ تَعَجَّلَ فِيْ يَوْمَيْنِ فَلَاۤ اِثْمَ عَلَيْهِ وَ مَنْ تَاَخَّرَ فَلَاۤ اِثْمَ عَلَيْهِ لِمَنِ اتَّقٰى }» [ البقرۃ : ۲۰۳ ] ’’پھر جو دو دنوں میں جلد چلا جائے تو اس پر کوئی گناہ نہیں اور جو تاخیر کرے تو اس پر بھی کوئی گناہ نہیں، اس شخص کے لیے جو ڈرے۔‘‘ ظاہر ہے جو شخص ایام تشریق کا تیسرا دن بھی پورا کرے وہ زیادہ کامل ہے۔ ¤ ➍ شاہ عبدالقادر فرماتے ہیں: ’’ہمارے حضرت صلی اللہ علیہ وسلم بھی وطن سے نکلے، سو آٹھ برس پیچھے آکر مکہ فتح کیا، اگر چاہتے اسی وقت شہر خالی کرواتے کافروں سے۔ دس برس پیچھے پاک کیا۔‘‘ (موضح)"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { فَلَمَّا قَضٰى مُوْسَى الْاَجَلَ وَ سَارَ بِاَهْلِهٖۤ:} اہلِ کتاب اور اکثر مسلمان مفسرین کا کہنا ہے کہ ان دس سالوں کے دوران وہ فرعون فوت ہو گیا جس نے موسیٰ علیہ السلام کی پرورش کی تھی اور اب اس کی جگہ اور فرعون حکمران تھا۔ (واللہ اعلم) ¤ موسیٰ علیہ السلام نے جب وہ مدت پوری کر لی تو بیوی کو لے کر اپنے وطن جانے کے ارادے سے مدین سے روانہ ہو گئے۔ اس ارادے کی دلیل یہ ہے کہ طور اس راستے پر واقع ہے جو مدین سے مصر کی طرف جاتا ہے۔ ایک تو اپنے والدین اور بہن بھائیوں سے ملنے کا شوق تھا، دوسرے ہو سکتا ہے یہ خیال بھی ہو کہ لوگ اب تک اس واقعہ کو بھول چکے ہوں گے اور وہاں رہنے میں کوئی مشکل پیش نہیں آئے گی۔ ¤ ➋ { اٰنَسَ مِنْ جَانِبِ الطُّوْرِ نَارًا … : ’’ جَذْوَةٍ ‘‘} لکڑی کا ٹکڑا جس کے سرے پر آگ ہو۔ یہ واقعہ تفصیل کے ساتھ سورۂ طٰہٰ اور سورۂ نمل میں گزر چکا ہے۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { فَلَمَّاۤ اَتٰىهَا نُوْدِيَ …:’’ شَاطِئِ الْوَادِ الْاَيْمَنِ ‘‘} کی تفسیر کے لیے دیکھے سورۂ مریم (۵۲) اور طٰہٰ (۸۰) {’’ مِنَ الشَّجَرَةِ ‘‘} جب موسیٰ علیہ السلام اس آگ کے پاس آئے تو دیکھا کہ سرسبز درخت میں آگ لگی ہوئی ہے، جس سے جلنے کے بجائے درخت مزید سرسبز اور خوب صورت دکھائی دے رہا ہے۔ موسیٰ علیہ السلام حیرت سے یہ منظر دیکھ ہی رہے تھے کہ درخت میں سے آواز آئی : ’’اے موسیٰ! بلاشبہ میں ہی اللہ ہوں جو رب العالمین ہے۔‘‘ ¤ ➋ { اِنِّيْۤ اَنَا اللّٰهُ رَبُّ الْعٰلَمِيْنَ:} دیکھیے سورۂ طٰہٰ (۱۴) اللہ تعالیٰ نے یہاں موسیٰ علیہ السلام کو دو ناموں کے ساتھ اپنا تعارف کروانے کا ذکر فرمایا ہے، ایک {’’ اللّٰهُ ‘‘} جو ذاتی نام ہے، جس میں اس کی ساری صفات آ جاتی ہیں اورر دوسرا {’’ رَبُّ الْعٰلَمِيْنَ ‘‘} جو اللہ کے اسماء میں سے ایسا اسم ہے جس میں اس کی وہ تمام صفات آجاتی ہیں جن کے آثار آدمی کے مشاہدے میں آتے ہیں۔ سورۂ طٰہٰ میں بھی انھی دو اسماء کا ذکر ہے، جیسے فرمایا : «{ اِنِّيْۤ اَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ }» [ طٰہٰ : ۱۲ ] اور «{ اِنَّنِيْۤ اَنَا اللّٰهُ لَاۤ اِلٰهَ اِلَّاۤ اَنَا }» [ طٰہٰ : ۱۴ ] یہاں بات مختصر کی ہے، سورۂ طٰہٰ میں ان اسماء کے تقاضے پر عمل کا بھی حکم دیا ہے، فرمایا : «{ فَاعْبُدْنِيْ وَ اَقِمِ الصَّلٰوةَ لِذِكْرِيْ (16) اِنَّ السَّاعَةَ اٰتِيَةٌ اَكَادُ اُخْفِيْهَا لِتُجْزٰى كُلُّ نَفْسٍۭ بِمَا تَسْعٰى (15) فَلَا يَصُدَّنَّكَ عَنْهَا مَنْ لَّا يُؤْمِنُ بِهَا وَ اتَّبَعَ هَوٰىهُ فَتَرْدٰى }» [طٰہٰ : ۱۴ تا ۱۶ ] ’’سو میری عبادت کر اور میری یاد کے لیے نماز قائم کر۔ یقینا قیامت آنے والی ہے، میں قریب ہوں کہ اسے چھپا کر رکھوں، تاکہ ہر شخص کو اس کا بدلا دیا جائے جو وہ کوشش کرتا ہے۔ سو تجھے اس سے وہ شخص کہیں روک نہ دے جو اس پر یقین نہیں رکھتا اور اپنی خواہش کے پیچھے لگا ہوا ہے، پس تو ہلاک ہو جائے گا۔‘‘ سورۂ نمل میں دو مزید صفات کا بھی ذکر ہے، فرمایا : «{ يٰمُوْسٰۤى اِنَّهٗۤ اَنَا اللّٰهُ الْعَزِيْزُ الْحَكِيْمُ }» [ النمل : ۹ ] ’’اے موسیٰ! بے شک حقیقت یہ ہے کہ میں ہی اللہ ہوں، جو سب پر غالب، کمال حکمت والا ہے۔‘‘ اس کا مطلب یہ ہے کہ اللہ تعالیٰ نے اس موقع پر ان تمام صفات کا ذکر فرمایا تھا، پھر ہر سورت میں اس کے مضمون کے مطابق ان میں سے چند صفات کا ذکر فرما دیا۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { وَ اَنْ اَلْقِ عَصَاكَ:} یہاں کچھ عبارت محذوف ہے کہ جب انھوں نے اپنی لاٹھی پھینکی تو وہ یکلخت سانپ بن گئی۔ ¤ ➋ { فَلَمَّا رَاٰهَا تَهْتَزُّ …:} تو جب اس نے اسے دیکھا کہ حرکت کر رہی ہے…۔ {’’ جَآنٌّ ‘‘} اور {’’ ثُعْبَانٌ ‘‘} کی تطبیق کے لیے دیکھیے سورۂ نمل (۱۰)۔ ¤ ➌ { وَلّٰى مُدْبِرًا وَّ لَمْ يُعَقِّبْ:} یعنی اتنے خوف زدہ ہوئے کہ ایک جانب کو نہیں بلکہ پیٹھ دے کر بھاگ کھڑے ہوئے اور مڑ کر بھی نہیں دیکھا کہ کہیں وہ سانپ پیچھے نہ پہنچ جائے۔ ¤ ➍ { يٰمُوْسٰۤى اَقْبِلْ وَ لَا تَخَفْ:} اللہ تعالیٰ نے آواز دی، اے موسیٰ! مڑ کر بھاگنے کے بجائے آگے آ، کیونکہ تو امن والوں سے ہے۔{ ’’إِنَّ‘‘ } علت بیان کرنے کے لیے ہوتا ہے۔ سورۂ طٰہٰ (۲۱) میں بتایا : ’’اسے پکڑ اور ڈر نہیں، ہم اسے پھر اس کی پہلی حالت میں لوٹا دیں گے۔‘‘ مزید فوائد کے لیے سورۂ طٰہٰ (۲۱) دیکھیے۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ {اُسْلُكْ يَدَكَ فِيْ جَيْبِكَ … :} دوسری جگہ فرمایا : « وَ اَدْخِلْ يَدَكَ فِيْ جَيْبِكَ » [النمل: 12] {’’سِلْكٌ‘‘} اس دھاگے کو کہتے ہیں جس میں موتی پروئے جاتے ہیں۔ ظاہر ہے ان میں دھاگا مہارت اور احتیاط سے داخل کیا جاتا ہے، یعنی کسی گھبراہٹ کے بغیر اطمینان کے ساتھ اپنا ہاتھ اپنے گریبان میں ڈالو۔ مزید دیکھیے سورۂ طٰہٰ (۲۲)۔ ¤ ➋ { وَ اضْمُمْ اِلَيْكَ جَنَاحَكَ مِنَ الرَّهْبِ:} موسیٰ علیہ السلام کو جس مقصد کے لیے بھیجا جا رہا تھا، اس میں کئی مقامات ایسے آنے والے تھے جن میں آدمی شدید خوف کا شکار ہو جاتا ہے، بلکہ اسے اپنی جان کا خطرہ لاحق ہو جاتا ہے۔ دو عظیم الشان معجزوں کے ساتھ اس خوف کا علاج بھی بتا دیا کہ جب بھی تمھیں کوئی خوف محسوس ہو اپنا بازو پہلو کے ساتھ اچھی طرح ملا لو، اس سے تمھارا دل مضبوط ہو جائے گا اور خوف دور ہو جائے گا۔ اہل علم فرماتے ہیں کہ خوف کے وقت کوئی شخص موسیٰ علیہ السلام کی اقتدا میں یہ عمل کرے تو اس کا خوف ختم ہو جائے گا یا کم ہو جائے گا۔ (ان شاء اللہ) ¤ ➌ { فَذٰنِكَ بُرْهَانٰنِ مِنْ رَّبِّكَ … :} یعنی لاٹھی کا سانپ بننا اور ہاتھ کا سفید چمک دارر ہو کر نکلنا صرف آج اسی موقع کے لیے نہیں بلکہ یہ دونوں معجزے فرعون اور اس کے سرداروں کی طرف بھیجتے ہوئے تمھیں نبوت کی دلیل اور سند کے طور پر عطا کیے گئے ہیں، کیونکہ وہ ہمیشہ سے نافرمان لوگ ہیں۔ انھیں دعوت دینے اور ان پر حجت تمام کرنے کے لیے ایسے ہی زبردست معجزوں کی ضرورت ہے۔ {’’إِنَّ ‘‘} تعلیل کے لیے ہوتا ہے اور {’’كَانَ‘‘} میں ہمیشگی کا معنی پایا جاتا ہے۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) {قَالَ رَبِّ اِنِّيْ قَتَلْتُ مِنْهُمْ نَفْسًا …:} موسیٰ علیہ السلام نے یہ بات ذمہ داری قبول کرنے سے انکار کے لیے نہیں کہی، بلکہ اس سلسلے میں پیش آنے والی مشکلات میں مدد کی درخواست کے لیے کہی۔ چنانچہ ان خطرات کا ذکر کیا جو انھیں اس سلسلے میں نظر آرہے تھے اور اللہ تعالیٰ سے ان خطرات میں مدد کی ضمانت حاصل کر لی۔ (تفسیر بقاعی میں ہے کہ یہ پیش بینی اس جلیل القدر پیغمبر کی عادت مبارکہ تھی، دیکھیے انھوں نے کس طرح ہماری بھلائی کے لیے بار بار نبی کریم صلی اللہ علیہ وسلم کو تخفیف کی درخواست کے لیے اللہ تعالیٰ کی جناب میں واپس جانے کو کہا) ان میں سے پہلا خطرہ یہ بیان کیا کہ میں نے ان کا ایک آدمی قتل کیا ہے، اس لیے ڈرتا ہوں کہ وہ مجھے دعوت پیش کرنے سے پہلے ہی قتل کر دیں گے۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) { وَ اَخِيْ هٰرُوْنُ هُوَ اَفْصَحُ مِنِّيْ لِسَانًا … : ’’ رِدْاً ‘‘} مددگار، دیوار کا پشتہ جو اسے مضبوط کرنے کے لیے لگایا جائے۔ بعض روایات میں ہے کہ ایک دفعہ بچپن میں موسیٰ علیہ السلام نے فرعون کی ڈاڑھی پکڑ لی تو اس نے کہا، یہ وہی ہے جس کے ہاتھوں میری سلطنت کے زوال کی پیش گوئی کی گئی ہے، اس وجہ سے اس نے موسیٰ علیہ السلام کو قتل کرنے کا پختہ ارادہ کر لیا۔ آسیہ علیھا السلام نے کہا، یہ بچہ ہے، اسے ان باتوں کی کیا خبر؟ اس کے سامنے انگارا اور ہیرا رکھ کر دیکھ لو، جب موسیٰ علیہ السلام کے سامنے انگارا اور ہیرا رکھ کر ان کی آزمائش کی جانے لگی اور موسیٰ علیہ السلام ہیرے کی طرف ہاتھ بڑھانے لگے، تو جبریل علیہ السلام نے ان کا ہاتھ پکڑ کر انگارے کی طرف کر دیا اور انھوں نے اسے اٹھا کر منہ میں ڈال لیا، جس سے ان کی زبان جل گئی اور لکنت پیدا ہو گئی۔ مگر یہ حکایت کسی معتبر ذریعے سے ثابت نہیں۔ البتہ سورۂ طٰہٰ (۲۵ تا ۲۸) میں مذکور موسیٰ علیہ السلام کی دعا سے معلوم ہوتا ہے کہ ان کی زبان میں کچھ گرہ تھی جس کی وجہ سے انھیں بات سمجھانے میں دقت پیش آتی تھی اور انھوں نے اسے دور کرنے کی دعا کی تھی۔ فرعون نے بھی انھیں اس بات کا طعن دیا تھا : «{ اَمْ اَنَا خَيْرٌ مِّنْ هٰذَا الَّذِيْ هُوَ مَهِيْنٌ وَّ لَا يَكَادُ يُبِيْنُ }» [ الزخرف : ۵۲ ] ’’بلکہ میں اس شخص سے بہتر ہوں، وہ جو حقیر ہے اور قریب نہیں کہ وہ بات واضح کرے۔‘‘ ¤ یہاں دوسرا خطرہ انھوں نے یہ ذکر کیا ہے کہ بات پوری طرح واضح نہ کر سکنے کی وجہ سے میں ڈرتا ہوں کہ فرعون اور اس کے سردار مجھے جھٹلا دیں گے، ہارون کی زبان مجھ سے زیادہ فصیح ہے، اگر بحث کی نوبت آ گئی تو وہ میرے مددگار ثابت ہوں گے، اس لیے انھیں میرے ساتھ مددگار بنا کر بھیج کہ میری تصدیق کریں، یعنی حق کو خوب کھول کر بیان کریں، کفار کے اعتراضات کا ایسا جواب دیں کہ انھیں جھٹلانے کی جرأت نہ ہو۔ سورۂ طٰہٰ (۲۹ تا ۳۶) میں یہ بات زیادہ تفصیل سے مذکور ہے۔ ان آیات سے ظاہر ہے کہ موسیٰ علیہ السلام رسالت  کی ذمہ داری بہترین طریقے سے ادا کرنے میں کس قدر مخلص اور اس کے لیے کتنے فکر مند تھے۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ { قَالَ سَنَشُدُّ عَضُدَكَ بِاَخِيْكَ … :} اللہ تعالیٰ نے موسیٰ علیہ السلام کی دعا قبول فرمائی اور تین باتوں کا وعدہ فرمایا، پہلا یہ کہ ہم ہارون کو نبی بنا کر تمھارا بازو ضرور مضبوط کریں گے (سین تاکید کے لیے ہے)، وہ تمھارے ساتھ فرعون کے دربار میں جائیں گے۔ بعض سلف نے فرمایا، کسی بھائی پر اس کے بھائی کا اتنا بڑا احسان نہیں جتنا بڑا احسان موسیٰ علیہ السلام کا ہارون علیہ السلام پر ہے کہ ان کی شفاعت سے انھیں نبوت مل گئی، اس سے اللہ تعالیٰ کے ہاں موسیٰ علیہ السلام کا مرتبہ بھی معلوم ہوتا ہے، جیسا کہ فرمایا : «{ وَ كَانَ عِنْدَ اللّٰهِ وَجِيْهًا }» [ الأحزاب : ۶۹ ] ’’اور وہ (یعنی موسیٰ علیہ السلام ) اللہ کے ہاں بہت مرتبے والا تھا۔‘‘ ¤ ➋ { فَلَا يَصِلُوْنَ اِلَيْكُمَا بِاٰيٰتِنَاۤ:} دوسرا وعدہ یہ کہ فرعونیوں کے مقابلے میں تم دونوں کو ہم ایسا غلبہ اور دبدبہ عطا کریں گے کہ ہمارے معجزے تمھارے ساتھ ہونے کی وجہ سے وہ تم تک پہنچ نہیں پائیں گے اور نہ کسی قسم کی دست درازی کر سکیں گے۔ چنانچہ بعد میں ایسے ہی ہوا کہ فرعون اور اس کے سرداروں کو تمام تر اسباب و وسائل اور اسلحہ و افواج کے باوجود کبھی اس بات کی جرأت و ہمت نہ ہو سکی کہ ان پر کسی طرح ہاتھ اٹھا سکیں۔ یہ تفسیر {’’ بِاٰيٰتِنَاۤ ‘‘} کو {’’ فَلَا يَصِلُوْنَ ‘‘} کے متعلق کرنے کی صورت میں ہے۔ ¤ ➌ {بِاٰيٰتِنَاۤ اَنْتُمَا وَ مَنِ اتَّبَعَكُمَا الْغٰلِبُوْنَ:} یہ تیسرا وعدہ ہے کہ تم دونوں اور تمھارے پیروکار ہی آخر کار غالب ہوں گے۔ {’’بِاٰيٰتِنَاۤ ‘‘} کو{’’ الْغٰلِبُوْنَ ‘‘} کے متعلق کرنے سے معنی یہ ہوگا کہ تم دونوں اور تمھارے پیروکار ہی ہمارے معجزات کی بدولت غالب رہو گے۔ یہ مضمون کہ رسول اور ان کے پیروکار ہی آخر غالب ہوں گے، قرآن میں متعدد مقامات پر بیان ہوا ہے۔ دیکھیے سورۂ مومن (۵۱) اور مجادلہ (۲۱)۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {فَلَمَّا جَآءَهُمْ مُّوْسٰى بِاٰيٰتِنَا بَيِّنٰتٍ …:} موسیٰ علیہ السلام یہ ذمہ داریی لے کر وادی طویٰ سے واپس لوٹے۔ درمیان کی بات قرآن نے یہاں چھوڑ دی ہے کہ وہ اپنے اہل و عیال کے ساتھ اپنے گھر آئے۔ والدین اور بھائی بہنوں سے ملاقات کی، ہارون علیہ السلام کو نبوت عطا ہونے کا ماجرا سنایا، پھر دونوں بھائی فرعون اور اس کے سرداروں کو دعوت دینے کے لیے ان کے دربار میں پہنچے اور انھیں توحید الٰہی کی دعوت دی اور انھیں اللہ کی طرف سے اپنی رسالت کا اور بنی اسرائیل کو آزادی دینے کا حکم سنایا۔ موسیٰ علیہ السلام کی یہ دعوت سورۂ طٰہٰ (۴۷ تا ۵۴) اور شعراء (۱۶ تا۳۳) میں تفصیل سے بیان ہوئی ہے۔ جب فرعون نے ان کی دعوت قبول کرنے سے انکار کیا تو انھوں نے اپنی رسالت کی دلیل کے طور پر عصا اور یدِ بیضا کا معجزہ پیش کیا۔ فرعون کے پاس ان معجزوں کا کوئی جواب نہیں تھا، وہ دل سے موسیٰ علیہ السلام کے سچا نبی ہونے کو مان چکا تھا۔ دیکھیے بنی اسرائیل (۱۰۲) اور نمل (۱۴) مگر اس نے اپنی قوم کو بے وقوف بنانے کے لیے دو باتیں کہیں، ایک یہ کہ تمھارا عصا اور ید بیضا سحر مفتری ہے، یعنی تمھارا گھڑا ہوا اور بنایا ہوا جادو ہے، حقیقت اس کی کچھ نہیں۔ سورۂ اعراف (۱۰۹ تا۱۲۶)، طٰہٰ (۵۵ تا ۷۶) اور شعراء (۳۴ تا ۵۱) میں اس کے جادوگر جمع کر کے ان معجزات کے مقابلے کا اور جادوگروں کے ناکام ہو کر مسلمان ہو جانے کا ذکر گزر چکا ہے۔ دوسری بات اس نے یہ کہی کہ ہم نے توحید کی یہ دعوت اپنے پہلے آبا و اجداد میں نہیں سنی۔ فرعون کی اس بات کی بنیاد محض آبا و اجداد کی تقلید تھی، جو ان لوگوں کی دلیل ہوتی ہے جن کے پاس کوئی دلیل نہ ہو اور وہ محض ہٹ دھرمی سے کسی غلط بات پر ڈٹ جائیں۔ بھلا یہ بھی کوئی دلیل ہے کہ میں نے خسارے کا سودا کرنا ہی کرنا ہے، کیونکہ میرے باپ نے خسارے کا سودا کیا تھا۔ فرعون ہی نہیں تمام باطل پرستوں کے پاس حق کے انکار کا یہی بہانہ ہوتا ہے۔ دیکھیے سورۂ بقرہ (۱۷۰)۔ ¤ بعض مفسرین نے لکھا ہے کہ فرعون کا یہ کہنا جھوٹ تھا کہ ہم نے اپنے پہلے آباء میں یہ بات نہیں سنی، کیونکہ اس سے پہلے مصر میں یوسف علیہ السلام گزر چکے تھے جو قید خانے میں بھی توحید کی دعوت کا موقع ہاتھ سے نہیں جانے دیتے تھے، جیسا کہ قریش مکہ کا یہ کہنا جھوٹ تھا کہ ہم نے اپنے آباء میں یہ بات نہیں سنی، حالانکہ ان کے آبا و اجداد میں ابراہیم اور اسماعیل علیھما السلام تھے جو بتوں کو توڑنے والے تھے اور توحید الٰہی کے زبردست علمبردار تھے، مگر فرعون اور قریش مکہ نے صرف ان آباء کو دلیل بنایا جو عقل و ہدایت دونوں سے خالی تھے، فرمایا : «{ اَوَ لَوْ كَانَ اٰبَآؤُهُمْ لَا يَعْقِلُوْنَ شَيْـًٔا وَّ لَا يَهْتَدُوْنَ }» [ البقرۃ : ۱۷۰ ]’’کیا اگرچہ ان کے باپ دادا نہ کچھ سمجھتے ہوں اور نہ ہدایت پاتے ہوں۔‘‘"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { وَ قَالَ مُوْسٰى رَبِّيْۤ اَعْلَمُ بِمَنْ جَآءَ بِالْهُدٰى …:} مفسرین کہتے ہیں کہ بظاہر فرعون کی بات نقل کرنے کے بعد موسیٰ علیہ السلام کی بات نقل کرنے کے لیے {’’ قَالَ ‘‘} ہی کافی تھا، ’’واؤ‘‘ کی ضرورت نہ تھی، مگر دونوں کی بات کا موازنہ کرنے کے لیے اللہ تعالیٰ نے ’’واؤ‘‘ کا ذکر کیا کہ فرعون نے یہ کہا اور موسیٰ علیہ السلام نے یہ کہا۔ ¤ ➋ موسیٰ علیہ السلام کا یہ کلام اللہ تعالیٰ کی اس تلقین پر عمل کا ایک خوب صورت نمونہ ہے، جو اللہ تعالیٰ نے انھیں فرعون کی طرف بھیجتے ہوئے کی تھی، فرمایا : «{ فَقُوْلَا لَهٗ قَوْلًا لَّيِّنًا لَّعَلَّهٗ يَتَذَكَّرُ اَوْ يَخْشٰى }» [ طٰہٰ : ۴۴ ] ’’پس اس سے بات کرو، نرم بات، اس امید پر کہ وہ نصیحت حاصل کرلے، یا ڈر جائے۔‘‘ فرعون کی ہٹ دھرمی کے جواب میں انھوں نے اسے جھوٹا کہنے یا کوئی سخت بات کرنے کے بجائے نرم لہجہ اختیار کرتے ہوئے فرمایا کہ میرا رب زیادہ جاننے والا ہے کہ اس کے پاس سے ہدایت لے کر کون آیا ہے اور اس گھر کا اچھا انجام کس کا ہوتا ہے؟ ہاں! اس حقیقت سے کوئی انکار نہیں کر سکتا کہ ظالم لوگ کبھی فلاح نہیں پاتے۔ یہ اس طرح کی بات ہے، جیسے اللہ تعالیٰ نے فرمایا : «{ قُلْ مَنْ يَّرْزُقُكُمْ مِّنَ السَّمٰوٰتِ وَ الْاَرْضِ قُلِ اللّٰهُ وَ اِنَّاۤ اَوْ اِيَّاكُمْ لَعَلٰى هُدًى اَوْ فِيْ ضَلٰلٍ مُّبِيْنٍ (24) قُلْ لَّا تُسْـَٔلُوْنَ عَمَّاۤ اَجْرَمْنَا وَ لَا نُسْـَٔلُ عَمَّا تَعْمَلُوْنَ (25) قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا ثُمَّ يَفْتَحُ بَيْنَنَا بِالْحَقِّ وَ هُوَ الْفَتَّاحُ الْعَلِيْمُ }» [ سبا : ۲۴ تا ۲۶ ]’’کہہ تمھیں آسمانوں اور زمین سے رزق کون دیتا ہے؟ کہہ دے اللہ۔ اور بے شک ہم یا تم ضرور ہدایت پر ہیں، یا کھلی گمراہی میں ہیں۔ کہہ دے نہ تم سے اس کے بارے میں پوچھا جائے گا جو ہم نے جرم کیا اور نہ ہم سے اس کے بارے میں پوچھا جائے گا جو تم کرتے ہو۔ کہہ ہم سب کو ہمارا رب جمع کرے گا، پھر ہمارے درمیان حق کے ساتھ فیصلہ کرے گا اور وہی خوب فیصلہ کرنے والا، سب کچھ جاننے والا ہے۔‘‘ ¤ ➌ { عَاقِبَةُ الدَّارِ:} آلوسی نے فرمایا : {’’ الدَّارِ ‘‘} (اس گھر) سے مراد دنیا ہے، اس کا اچھا انجام ایسا خاتمہ ہے جو انسان کو اللہ کے فضل و کرم کے ساتھ جنت میں لے جائے۔‘‘"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ { وَ قَالَ فِرْعَوْنُ يٰۤاَيُّهَا الْمَلَاُ مَا عَلِمْتُ لَكُمْ مِّنْ اِلٰهٍ غَيْرِيْ:} سرکش اور مغرور فرعون پر موسیٰ علیہ السلام کی اتنی نرم اور حلم والی بات کا کچھ اثر نہیں ہوا، بلکہ اس نے اپنے سرداروں کو مخاطب کر کے لاف زنی شروع کر دی کہ ’’اے سردارو! میں نے اپنے سوا تمھارا کوئی معبود نہیں جانا۔‘‘ اس سے فرعون کے تکبر کا اور اس کی حماقت کا اندازہ ہوتا ہے۔ گویا وہ انھیں کہہ رہا تھا کہ مجھے معلوم نہیں کہ میرے سوا تمھارا کوئی معبود ہو اور جو مجھے معلوم نہیں وہ ہے ہی نہیں۔ بتائیے اس سے بڑی بے وقوفی کیا ہو گی۔ تمھیں تو یہ تک معلوم نہ ہو سکا کہ تمھارے گھر میں کس کی پرورش ہو رہی ہے؟ اس کی قوم کے سرداروں نے بھی اس کی اس یا وہ گوئی پر خاموش رہ کر اس کی تائید کی، جو ان کی جہالت اور بزدلی کی انتہا تھی۔ اللہ تعالیٰ نے فرمایا : «{ فَاسْتَخَفَّ قَوْمَهٗ فَاَطَاعُوْهُ اِنَّهُمْ كَانُوْا قَوْمًا فٰسِقِيْنَ }» [ الزخرف : ۵۴ ] ’’غرض اس نے اپنی قوم کو ہلکا (بے وزن) کر دیا تو انھوں نے اس کی اطاعت کر لی، یقینا وہ نافرمان لوگ تھے۔‘‘ ¤ ➋ استاذ محمد عبدہ رحمہ اللہ لکھتے ہیں : ’’شاہ صاحب رحمہ اللہ نے یہاں ’’الٰہ‘‘ (خدا) کا ترجمہ حاکم کیا ہے اور یہی بات صحیح معلوم ہوتی ہے، کیونکہ فرعون اپنے آپ کو ارض و سماء کا خالق اور معبود نہیں سمجھتا تھا، بلکہ وہ خود بہت سے دیوتاؤں کی پرستش کرتا تھا۔ پس فرعون کا مطلب یہ تھا کہ میں ہی تمھارا مطاع اور حاکم مطلق ہوں، میرے سوا کوئی دوسرا نہیں ہو سکتا، جس کی فرماں برداری کی جائے۔‘‘ (اشرف الحواشی) فرعون کے رب اعلیٰ ہونے کے دعوے کی تفصیل کے لیے دیکھیے سورۂ اعراف (۱۲۷) کی تفسیر۔ ¤ ➌ {فَاَوْقِدْ لِيْ يٰهَامٰنُ عَلَى الطِّيْنِ … :} اپنے اس دعوے کے ساتھ کہ مجھے اپنے سوا تمھارا کوئی الٰہ معلوم نہیں، فرعون نے یہ دکھانے کے لیے کہ واقعی اس کے سوا کوئی معبود نہیں، اپنے وزیر ہامان کو حکم دیا کہ وہ پکی اینٹیں تیار کرے۔ یہاں قرآن مجید کے الفاظ کے انتخاب پر توجہ فرمائیں، عربی زبان میں پکی اینٹ کے لیے {’’آجُرٌّ، طُوْبٌ ‘‘} اور {’’ قَرْمَدٌ ‘‘} وغیرہ الفاظ استعمال ہوتے ہیں، مگر ان سب کی ادائیگی میں ایک قسم کا ثقل پایا جاتا ہے۔ اللہ تعالیٰ نے ان کے بجائے فرمایا : «{ فَاَوْقِدْ لِيْ يٰهَامٰنُ عَلَى الطِّيْنِ }» ’’تو اے ہامان! میرے لیے مٹی پر آگ جلا‘‘ اس جملے میں پختہ اینٹ بنانے کا طریقہ بھی بیان ہو گیا، ہامان کو اس کی تیاری کا حکم بھی اور اس جملے کے کسی لفظ میں کسی قسم کا کوئی ثقل بھی نہیں آیا، سب حروف متناسب اور سلیس ہیں۔ عام طور پر کہا جاتا ہے کہ پختہ اینٹ بنانے کی ابتدا ہامان نے فرعون کے حکم سے کی، مگر اس کی کوئی پختہ دلیل نہیں کہ اس سے پہلے پختہ اینٹیں نہیں بنتی تھیں۔ ¤ ➍ { فَاجْعَلْ لِّيْ صَرْحًا … :} لوگوں کو بے وقوف بنانے کے لیے اس نے یہ حکم دیا کہ پختہ اینٹیں تیار کر کے میرے لیے ایک بلند و بالا محل بنا، تاکہ میں اس پر چڑھ کر موسیٰ کے رب کو دیکھوں، کیونکہ میں تو اسے جھوٹا ہی گمان کرتا ہوں۔ فرعون کی یہ بات سورۂ مومن (۳۶، ۳۷) میں بھی بیان ہوئی ہے۔ قرآن مجید یا حدیث میں یہ ذکر نہیں کہ اس نے وہ محل بنایا یا نہیں۔ بغوی نے ذکر کیا ہے کہ ہامان نے کاریگر اور مزدور جمع کیے، حتیٰ کہ پچاس ہزار مستری جمع ہو گئے۔ مزدور اور کارکن اس کے علاوہ تھے۔ اسی طرح اینٹیں پکانے والے، چونا بنانے والے، لکڑی اور لوہے کا کام کرنے والے بھی ان کے علاوہ تھے۔ ان سب نے وہ عمارت بنائی جو اتنی بلند تھی کہ مخلوق میں سے کسی نے اتنی بلند عمارت نہیں بنائی۔ جب وہ فارغ ہوئے تو فرعون اس کے اوپر چڑھا اور اس نے آسمان کی طرف تیر پھینکنے کا حکم دیا، وہ واپس آیا تو خون سے لت پت تھا۔ کہنے لگا، میں نے موسیٰ کے معبود کو قتل کر دیا۔ فرعون گھوڑے کے ساتھ اس پر چڑھا تھا۔ اللہ تعالیٰ نے سورج غروب ہونے کے قریب جبریل علیہ السلام کو بھیجا، انھوں نے اس عمارت پر اپنا پر مارا اور اسے تین ٹکڑوں میں کاٹ دیا۔ ایک ٹکڑا فرعون کے لشکر پر گرا، جس نے ان میں سے دس لاکھ آدمیوں کو ہلاک کر دیا، ایک ٹکڑا سمندر میں گرا اور ایک ٹکڑا مغرب میں جا گرا اور اس عمارت کے بنانے میں جس نے کچھ بھی کام کیا تھا، کوئی باقی نہ رہا۔ طبری نے اسے اختصار کے ساتھ سدی سے بیان کیا ہے۔ قرطبی نے اسے ذکر کر کے اس کے کمزور ہونے کی طرف یہ کہہ کر اشارہ کیا ہے : {’’وَاللّٰهُ أَعْلَمُ بِصِحَّةِ ذٰلِكَ‘‘} کہ اس روایت کی صحت کے بارے میں اللہ ہی ی بہتر جانتے ہیں۔ اسرائیلی روایات کی یہی مصیبت ہے کہ ان کی کوئی سند ہوتی ہے نہ ان کا سرا کہیں جا کر ملتا ہے۔ اس زمانے میں صرف مصر کے اندر دس لاکھ کے لشکر کی بات بھی قابل توجہ ہے۔ حقیقت یہی معلوم ہوتی ہے اور اکثر مفسرین نے اسی کو اختیار کیا ہے کہ یہ فرعون کی محض گیدڑ بھبکی تھی، جس کے ساتھ وہ اپنی قوم کو بے وقوف بنا رہا تھا۔ اینٹیں بنانے کا حکم بھی اس نے معاملے کو لٹکانے کے لیے دیا، ورنہ مصری لوگوں کو اینٹوں کی ضرورت ہی نہ تھی، جو لوگ اہرام مصر اتنے بڑے بڑے پتھروں سے بنا سکتے ہیں، جن میں سے ہر پتھر کا حجم عام کمرے کے مکمل حجم کے برابر ہے، انھیں اینٹیں پکانے کی ضرورت کیا تھی۔ یہ صرف وقت گزاری کی کارروائی تھی، ویسے بلند و بالا پہاڑوں کے ہوتے ہوئے اینٹوں سے عمارت بنانے کا حکم دینا، جو کسی طرح بھی پہاڑوں جتنی بلند نہیں ہو سکتی، محض دھوکا تھا۔ جیسا کہ اس نے اپنے سرداروں سے کہا تھا : «{ ذَرُوْنِيْۤ اَقْتُلْ مُوْسٰى وَ لْيَدْعُ رَبَّهٗ }» [ المؤمن : ۲۶ ] ’’(اور فرعون نے کہا) مجھے چھوڑ دو کہ میں موسیٰ کو قتل کر دوں اور وہ اپنے رب کو پکارے۔‘‘ بندہ پوچھے تمھیں کس نے پکڑا ہوا ہے، جسے چھوڑنے کے لیے کہہ رہے ہو! ہمت ہے تو ہاتھ بڑھا کر تو دیکھو۔ ¤ ➎ مفسر عبدالرحمان کیلانی رحمہ اللہ لکھتے ہیں : ’’یہ بات دراصل اس نے اپنی رعایا کو اُلّو بنانے اور ان سے دعوت حق کے اثر کو زائل کرنے کے لیے کہی تھی اور یہ بالکل ایسی ہی بات تھی جیسی چند برس پیشتر روس نے، جو ایک کمیونسٹ اور دہریت پسند ملک ہے، کہی تھی۔ اس نے اپنا ایک سپوتنک طیارہ چھوڑا جو چند لاکھ میل بلندی تک پہنچا تو واپسی پر ان لوگوں نے یہ دعویٰ کر دیا کہ ہم اتنے لاکھ میل کی بلندی تک ہو آئے ہیں، مگر ہمیں مسلمانوں کا خدا کہیں نہیں ملا۔ یعنی ان احمقوں کا یہ خیال تھا کہ اگر اللہ تعالیٰ کی ہستی موجود ہے تو یہی چند لاکھ میلوں کی بلندی پر ہی ہو سکتی ہے اور اس واقعہ کو بھی انھوں نے لوگوں کو اُلّو بنانے کے لیے ہی سائنٹفک دلیل کے طور پر پیش کیا، حالانکہ یہی لوگ جب کائنات کی وسعت کا حال بتاتے ہیں تو کہتے ہیں کہ سورج ہماری زمین سے ۹ کروڑ ۳۰ لاکھ میل دور ہے اور زمین اس کے گرد گردش کر رہی ہے۔ یہ اس سورج کا تیسرا سیارہ ہے اور سورج کے گرد نواں سیارہ پلوٹو گردش کرتا ہے، جو سورج سے ۳ ارب ۶۸ کروڑ میل کے فاصلے پر ہے۔ نیز یہ کہ اس کائنات میں نظام شمسی میں سورج ایک ستارہ یا ثابت ہے اور کائنات میں ایسے ہزاروں ستارے یا ثوابت مشاہدہ کیے جا چکے ہیں اور یہ ستارے یا سورج ہمارے سورج سے جسامت کے لحاظ سے بہت بڑے ہیں۔ ہمارے سورج سے بہت دور تقریباً ۴۰۰ کھرب کلومیٹر کے فاصلے پر ایک سورج موجود ہے، جو ہمیں محض روشنی کا ایک چھوٹا سا نقطہ معلوم ہوتا ہے۔ اس کا نام قلب عقرب ہے۔ اگر اسے اٹھا کر ہمارے نظام شمسی میں رکھا جائے تو سورج سے مریخ تک کا تمام علاقہ اس میں پوری طرح سما جائے گا، جبکہ مریخ کا سورج سے فاصلہ ۱۴ کروڑ ۱۵ لاکھ میل ہے، گویا قلب عقرب کا قطر ۲۸ کروڑ ۳۰ لاکھ میل کے لگ بھگ ہے۔ پھر جب کائنات میں ہر سو بکھرے سیاروں کے فاصلے کھربوں میل کے عدد سے بھی تجاوز کر گئے تو ہیئت دانوں نے نوری سال کی اصطلاح ایجاد کی، جس کا مطلب یہ ہے کہ روشنی ایک لاکھ ۸۶ ہزار میل فی سیکنڈ کی رفتار سے سفر کرتی ہے۔ اس لحاظ سے ہماری زمین سے سورج کا فاصلہ جو حقیقتاً ۹ کروڑ ۳۰ لاکھ میل ہے، روشنی کا یہ سفر آٹھ منٹ کا سفر ہے، گویا سورج ہم سے آٹھ نوری منٹ کے فاصلے پر ہے۔ اب کائنات میں ایسے سیارے بھی موجود ہیں جو ایک دوسرے سے ہزارہا بلکہ لاکھوں نوری سالوں کے فاصلے پر ہیں۔ ¤ یہ تو ہے کائنات کی وسعت کا وہ مطالعہ جو انسان کر چکا ہے اور جو ابھی انسان کے علم میں نہیں آسکا، وہ اللہ بہتر جانتا ہے۔ اب کیا وہ ہستی جو ان ساری چیزوں کی خالق اور ان سب سے اوپر ہے، کیا یہ احمق اسے چند لاکھ میلوں کی بلندی پر پالیں گے؟ نیز وہ سمجھ رہے ہیں جیسے وہ کوئی مادی جسم ہے، جو ان کی گرفت میں آسکتا ہے۔ [قٰتَلَھُمُ اللّٰہُ اَنّٰی یُوْفَکُوْنَ] اس سے بڑی حماقت ان روسی داناؤں نے یہ کی کہ اپنی سائنٹفک تحقیق کو اپنے سکولوں میں پڑھانا شروع کر دیا، تو ایک لڑکی کے منہ سے بے ساختہ یہ جملہ نکل گیا کہ جہاں تک سپوتنک میزائل پہنچا تھا اللہ تعالیٰ اس سے بہت اوپر تھا۔ فرعون نے بھی ہامان سے ایسی ہی بات کہی تھی، جس سے لوگوں کو اللہ کی ہستی کے بارے میں شک میں مبتلا کر دے، ورنہ عملاً نہ ہامان نے کوئی ایسا اونچا محل یا مینار بنایا تھا اور نہ ہی فرعون کا یہ مقصد تھا۔‘‘ ¤ ➏ { وَ اِنِّيْ لَاَظُنُّهٗ مِنَ الْكٰذِبِيْنَ:} یعنی موسیٰ جو یہ دعویٰ کرتا ہے کہ آسمانوں پر رب ہے جو ساری کائنات کو پالنے والا ہے، میں تو اسے جھوٹا سمجھتا ہوں۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ {وَ اسْتَكْبَرَ هُوَ وَ جُنُوْدُهٗ فِي الْاَرْضِ: ’’ الْاَرْضِ ‘‘} سے مراد زمین مصر ہے۔ یعنی بڑائی کا حق تو صرف اللہ رب العالمین کو ہے، مگر یہ لوگ ایک ذرا سے ملک میں اقتدار پا کر یہ سمجھ بیٹھے کہ بس ہم ہی بڑے ہیں۔ ¤ ➋ {وَ ظَنُّوْۤا اَنَّهُمْ اِلَيْنَا لَا يُرْجَعُوْنَ:} یعنی چند روزہ اقتدار پاکر وہ سمجھ بیٹھے کہ ان کے اوپر کوئی ہستی نہیں، جس کے سامنے مر کر انھیں پیش ہونا ہے، لہٰذا کھلی چھٹی ہے جو چاہیں کریں اور ملک میں جو فساد پھیلانا چاہیں پھیلاتے رہیں۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ { فَاَخَذْنٰهُ وَ جُنُوْدَهٗ فَنَبَذْنٰهُمْ فِي الْيَمِّ: ’’ نَبَذَ يَنْبِذُ ‘‘} پھینک مارنا۔ اس مقام پر درمیان کے بہت سے واقعات چھوڑ دیے گئے ہیں، جو دوسرے مقامات پر مذکور ہیں، یہاں صرف ان کے انجام کی خبر دی گئی ہے۔ ان الفاظ میں اللہ تعالیٰ نے ان کے جھوٹے تکبر کے مقابلے میں ان کے بے حقیقت ہونے کی تصویر کھینچ دی ہے کہ وہ جو اپنے آپ کو بہت بڑی چیز سمجھ بیٹھے تھے، جب وہ مہلت ختم ہو گئی جو اللہ تعالیٰ نے انھیں راہ راست پر آنے کے لیے دی تھی تو انھیں کوڑے کرکٹ کی طرح سمندر میں پھینک دیا گیا۔ ¤ ➋ { فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الظّٰلِمِيْنَ:} اس میں ہر عبرت حاصل کرنے والے شخص کو ان کے انجام سے عبرت حاصل کرنے کی طرف توجہ دلائی ہے کہ جو انجام ان کا ہوا وہی انجام ان لوگوں کا ہو گا جو رسول اللہ صلی اللہ علیہ وسلم کو جھٹلائیں گے۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ {وَ جَعَلْنٰهُمْ اَىِٕمَّةً يَّدْعُوْنَ اِلَى النَّارِ: ’’ اَىِٕمَّةً ‘‘ ’’إِمَامٌ‘‘} کی جمع ہے، جس کی پیروی کی جائے، جیسا کہ نماز میں مقتدی امام کی پیروی کرتا ہے۔ امامت نیکی میں بھی ہوتی ہے اور برائی میں بھی، جیسا کہ ابراہیم، اسحاق اور یعقوب علیھم السلام کے متعلق فرمایا : «{ وَ جَعَلْنٰهُمْ اَىِٕمَّةً يَّهْدُوْنَ بِاَمْرِنَا } » [ الأنبیاء : ۷۳ ] ’’اور ہم نے انھیں ایسے پیشوا بنایا جو ہمارے حکم کے ساتھ رہنمائی کرتے تھے۔‘‘ برائی میں امامت کی مثال فرعون اور اس کے لشکر تھے۔ فرمایا، ہم نے انھیں ایسے پیشوا بنایا جو آگ کی طرف بلاتے تھے، یعنی جب تک زندہ رہے کفر میں لوگوں کے پیشوا رہے اور اپنے قول و فعل سے انھیں کفر کی دعوت دیتے رہے، جس کا نتیجہ آگ ہے۔ اسی طرح یہ قیامت کے دن بھی امام اور پیشوا ہوں گے، مگر آگ کی طرف، فرمایا : «{ يَقْدُمُ قَوْمَهٗ يَوْمَ الْقِيٰمَةِ فَاَوْرَدَهُمُ النَّارَ وَ بِئْسَ الْوِرْدُ الْمَوْرُوْدُ }» [ ھود : ۹۸ ] ’’وہ قیامت کے دن اپنی قوم کے آگے ہوگا، پس انھیں پینے کے لیے آگ پر لے آئے گا اور وہ پینے کی بری جگہ ہے، جس پر پینے کے لیے آیا جائے۔‘‘ ¤ ➋ { وَ يَوْمَ الْقِيٰمَةِ لَا يُنْصَرُوْنَ:} یعنی یہاں کے لشکر وہاں کام نہ دیں گے، نہ کسی طرف سے کوئی مدد پہنچ سکے گی۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ {وَ اَتْبَعْنٰهُمْ فِيْ هٰذِهِ الدُّنْيَا لَعْنَةً:} یعنی دنیا میں جو بھی ان کا ذکر کرتا ہے ان پر لعنت بھیجتا ہے۔ ¤ ➋ {وَ يَوْمَ الْقِيٰمَةِ هُمْ مِّنَ الْمَقْبُوْحِيْنَ: ’’ الْمَقْبُوْحِيْنَ ‘‘ ’’ أَيْ مَطْرُوْدِيْنَ‘‘} یعنی دور دفع کیے ہوئے، قبیح بنائے گئے۔ یعنی صرف دنیا ہی میں ان پر لعنت نہیں پڑے گی بلکہ قیامت کے دن بھی وہ اللہ کی رحمت سے دور کیے ہوئے ہوں گے، ان کی شکلیں قبیح ہوں گی اور چہرے بگڑے ہوئے ہوں گے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) {وَ لَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ مِنْۢ بَعْدِ مَاۤ اَهْلَكْنَا … :} یہاں سے رسول اللہ صلی اللہ علیہ وسلم کی نبوت کے دلائل اور اس پر اعتراضات کا جواب شروع ہوتا ہے۔ ان میں سے ایک اعتراض یہ تھا کہ ہم نے یہ بات پہلے آبا و اجداد میں نہیں سنی، جیسا کہ فرمایا : «{مَا سَمِعْنَا بِهٰذَا فِي الْمِلَّةِ الْاٰخِرَةِ اِنْ هٰذَاۤ اِلَّا اخْتِلَاقٌ}» [ صٓ : ۷ ] ’’ہم نے یہ بات آخری ملت میں نہیں سنی، یہ تو محض بنائی ہوئی بات ہے۔‘‘ زیر تفسیر آیت سے پہلے آیت (۳۶) میں گزرا ہے کہ یہی اعتراض فرعون اور اس کے سرداروں نے موسیٰ علیہ السلام پر کیا تھا : «{وَ مَا سَمِعْنَا بِهٰذَا فِيْۤ اٰبَآىِٕنَا الْاَوَّلِيْنَ }» ’’اور ہم نے یہ بات اپنے پہلے باپ دادا میں نہیں سنی۔‘‘ اللہ تعالیٰ نے موسیٰ علیہ السلام کی پیدائش سے لے کر فرعون کی ہلاکت تک کا واقعہ بیان کرنے کے بعد فرمایا کہ ہم نے پہلی نسلوں قوم نوح، عاد، ثمود اور قوم لوط وغیرہ کو ہلاک کرنے کے بعد جب ہر طرف گمراہی اور ظلمت کا دور دورہ تھا، موسیٰ علیہ السلام کو کتاب دی جو اس وقت کے لوگوں کے لیے ایسے دلائل لیے ہوئے تھی جن سے دل کی آنکھ روشن ہوتی ہے اور جو گمراہی سے نکال کر ہدایت میں لانے والی اور عذاب سے بچا کر رحمت کا مستحق بنانے والی تھی۔ اور یہ اعتراض بے کار تھا کہ ہم نے اپنے پہلے باپ دادا میں یہ بات نہیں سنی، کیونکہ اسی لیے تو موسیٰ علیہ السلام کو مبعوث کیا گیا تھا کہ مدت دراز تک رسول نہ آنے کی وجہ سے لوگووں کو ہدایت اور روشنی کی ضرورت تھی۔ اسی طرح بنی اسماعیل میں ابراہیم اور اسماعیل علیھما السلام کے بعد ہزاروں سال کا وقفہ واقع ہو جانے کی وجہ سے ان کی طرف رسول بھیجنے کی ضرورت تھی۔ بنی اسرائیل کی طرف آنے والے آخری رسول عیسیٰ علیہ السلام کو بھی ایک عرصہ گزر چکا تھا۔ اس لیے نبی کریم صلی اللہ علیہ وسلم کو مبعوث کیا گیا، تاکہ بنی اسماعیل اور بنی اسرائیل میں سے کسی کے پاس یہ عذر نہ رہے کہ ہمارے پاس کوئی آگاہ کرنے والا نہیں آیا۔ یہی بات آگے آیت (۴۷) میں آرہی ہے اور اس سے پہلے سورۂ مائدہ میں بھی گزر چکی ہے، فرمایا : «{ يٰۤاَهْلَ الْكِتٰبِ قَدْ جَآءَكُمْ رَسُوْلُنَا يُبَيِّنُ لَكُمْ عَلٰى فَتْرَةٍ مِّنَ الرُّسُلِ اَنْ تَقُوْلُوْا مَا جَآءَنَا مِنْۢ بَشِيْرٍ وَّ لَا نَذِيْرٍ فَقَدْ جَآءَكُمْ بَشِيْرٌ وَّ نَذِيْرٌ وَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ }» [ المائدۃ : ۱۹ ]’’اے اہل کتاب ! بے شک تمھارے پاس ہمارا رسول آیا ہے، جو تمھارے لیے کھول کر بیان کرتا ہے، رسولوں کے ایک وقفے کے بعد، تاکہ تم یہ نہ کہو کہ ہمارے پاس نہ کوئی خوش خبری دینے والا آیا اور نہ ڈرانے والا، تو یقینا تمھارے پاس ایک خوش خبری دینے والا اور ڈرانے والا آچکا ہے اور اللہ ہر چیز پر پوری طرح قادر ہے۔‘‘"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ { وَ مَا كُنْتَ بِجَانِبِ الْغَرْبِيِّ … : ’’ بِجَانِبِ الْغَرْبِيِّ ‘‘} میں {’’جَانِبٌ‘‘} موصوف ہے جو اپنی صفت کی طرف مضاف ہے اور یہ کلام عرب میں عام ہے، جیسے {’’مَسْجِدُ الْجَامِعِ، دِيْنُ الْقَيِّمِ، حَقُّ الْيَقِيْنِ‘‘} اور {’’دَارُ الْآخِرَةِ۔‘‘} بعض نحوی حضرات جو موصوف کو صفت کی طرف مضاف کرنا جائز نہیں سمجھتے، وہ ان سب مقامات میں کوئی نہ کوئی لفظ محذوف مانتے ہیں، مثلاً {’’ بِجَانِبِ الْغَرْبِيِّ ‘‘} کے متعلق ان کا کہنا ہے کہ یہ اصل میں {’’بِجَانِبِ الْمَكَانِ الْغَرْبِيِّ‘‘} ہے۔ مگر اس تکلف کی ضرورت نہیں۔ یہاں سوال پیدا ہوتا ہے کہ مغربی جانب سے کس مقام کی مغربی جانب مراد ہے؟ کیونکہ ہر جگہ ہی کسی نہ کسی لحاظ سے مغربی ہوتی ہے۔ جواب اس کا یہ ہے کہ عرب کے ہاں سمتوں کے تعین کے لیے بیت اللہ کو اصل قرار دیا گیا ہے۔ بیت اللہ کو سامنے رکھ کر مشرق کی طرف منہ کریں تو دائیں طرف کے علاقے کو یمن (دایاں) کہتے ہیں، بائیں طرف کو شام (بایاں) اور سامنے کے علاقے کو جانب شرقی کہا جاتا ہے۔ جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے مشرق کی طرف منہ کر کے فرمایا : [ أَلَا إِنَّ الْفِتْنَةَ هٰهُنَا مِنْ حيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ ] [ مسلم، الفتن و أشراط الساعۃ، باب الفتنۃ من المشرق… : ۲۹۰۵۔ بخاري : ۳۵۱۱ ] ’’آگاہ ہو جاؤ! اس (یعنی مشرق کی ) طرف سے فساد پھوٹے گا، جدھر سے شیطان کا سینگ طلوع ہوتا ہے۔‘‘ اور بیت اللہ سے مغرب کی جانب والے علاقوں کو ’’جانب غربی‘‘ کہا جاتا ہے۔ امرء القیس نے ایک بادل کا محل وقوع بیان کرتے ہوئے کہا ہے : ¤ {عَلٰي قَطَنٍ بِالشَّيْمِ أَيْمَنُ صَوْبِهِ ¤ وَ أَيْسَرُهُ عَلَي السِّتَارِ فَيَذْبُلِ } ¤ ’’غور سے دیکھنے پر اس کی بارش کا دایاں حصہ قطن مقام پر تھا اور اس کا بایاں حصہ ستار پھر یذبل نامی مقام پر تھا۔‘‘یہاں دائیں اور بائیں جانب سے مراد مشرق کی طرف منہ کرنے کے بعد دائیں اور بائیں جانب مراد ہے۔ ¤ واضح رہے کہ موسیٰ علیہ السلام کو جب طور سے ندا آئی تو اس وقت وہ طور سے اس جانب میں تھے جو کعبہ کی طرف رخ کرنے سے اس کی غربی جانب بنتی ہے اور اس وقت وہ جس وادی میں تھے وہ موسیٰ علیہ السلام کے کعبہ کی طرف رخ کرنے کی صورت میں پہاڑ کی دائیں طرف تھی، جسے اللہ تعالیٰ نے {’’ الْوَادِ الْاَيْمَنِ ‘‘} اور {’’ بِالْوَادِ الْمُقَدَّسِ طُوًى ‘‘} فرمایا ہے۔ ¤ ➋ ان آیات میں رسول اللہ صلی اللہ علیہ وسلم کی نبوت اور قرآن کے حق ہونے کی دلیل بیان فرمائی ہے کہ جب ہم نے موسیٰ علیہ السلام کی طرف وحی کی اور انھیں نبوت عطا فرمائی، اس وقت اے محمد! نہ تو طور کی غربی جانب میں موجود تھا، نہ یہ منظر دیکھنے والوں میں سے تھا اور نہ تو اس سے پہلے پڑھنا لکھنا جانتا تھا (دیکھیے عنکبوت : ۴۸) بلکہ یہ غیب کی وہ باتیں ہیں جو ہم نے تجھے وحی کے ذریعے سے بتلائی ہیں، جو اس بات کی دلیل ہیں کہ تو اللہ کا سچا رسول ہے، کیونکہ تو نے نہ خود ان باتوں کا مشاہدہ کیا، نہ یہ کسی سے سیکھیں۔ یہ مضمون قرآن مجید میں متعدد مقامات پر بیان ہوا ہے، سورۂ آل عمران میں ہے : «{ ذٰلِكَ مِنْ اَنْۢبَآءِ الْغَيْبِ نُوْحِيْهِ اِلَيْكَ وَ مَا كُنْتَ لَدَيْهِمْ اِذْ يُلْقُوْنَ اَقْلَامَهُمْ }» [ آل عمران : ۴۴ ] ’’یہ غیب کی کچھ خبریں ہیں، ہم اسے تیری طرف وحی کرتے ہیں اور تو اس وقت ان کے پاس نہ تھا جب وہ اپنے قلم پھینک رہے تھے۔‘‘ اور دیکھیے سورۂ ہود (۴۹ اور ۱۰۰)، یوسف (۱۰۲) اور طٰہٰ(۹۹)۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ { وَ لٰكِنَّاۤ اَنْشَاْنَا قُرُوْنًا فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُ:} یعنی آپ اس  وقت موجود نہیں تھے، لیکن ہم نے موسیٰ علیہ السلام سے لے کر آپ تک بہت سی نسلیں اور قومیں پیدا کیں، جن پر سیکڑوں ہزاروں سال کی لمبی مدت گزر گئی۔ جس سے اصل واقعات اور دین کے صحیح احکام اپنی اصل صورت پر باقی نہ رہے، لہٰذا ضرورت تھی کہ نئے پیغمبر کے ذریعے سے دین اور شریعت کو صحیح، مکمل اور آخری صورت میں پیش کیا جائے، اس لیے ہم نے آپ کو نبوت سے سرفراز فرمایا اور یہ تمام واقعات وحی کے ذریعے سے آپ کو بتائے۔ یا یہ مطلب ہے کہ لمبی مدتیں گزرنے کی وجہ سے اہل عرب نبوت و رسالت کو بالکل ہی بھلا بیٹھے تھے، اس لیے انھیں آپ کی نبوت پر تعجب ہو رہا ہے اور وہ اسے ماننے کے لیے تیار نہیں ہیں۔ ¤ ➋ {وَ مَا كُنْتَ ثَاوِيًا فِيْۤ اَهْلِ مَدْيَنَ … :} یعنی موسیٰ علیہ السلام کو ’’مدین‘‘ جا کر جو واقعات پیش آئے، ان کے اتنی صحت اور خوبی کے ساتھ بیان کرنے سے تو ظاہر ہوتا ہے کہ اس وقت آپ وہاں رہائش رکھتے تھے، سب کچھ اپنی آنکھوں سے دیکھ رہے تھے، یا ان سے سیکھ رہے تھے اور انھیں اس طرح ہماری آیات پڑھ کر سنا رہے تھے جیسے اب اہل مکہ کو سناتے ہیں۔ جب کہ حقیقت یہ ہے کہ آپ اس وقت اہل مدین میں مقیم نہیں تھے کہ انھیں ہماری آیات پڑھ کر سنا رہے ہوں۔ بعض مفسرین نے {’’ تَتْلُوْا عَلَيْهِمْ اٰيٰتِنَا ‘‘} کو حال بنایا ہے اور {’’ عَلَيْهِمْ ‘‘} سے مراد اہل مکہ لیے ہیں۔ اس صورت میں معنی یہ ہو گا کہ اہل مکہ کے سامنے موسیٰ علیہ السلام اور اس بزرگ کے متعلق ہماری آیات کی تلاوت کرتے وقت تو اہل مدین میں مقیم نہیں تھا کہ سب کچھ دیکھ کر انھیں سنا رہا ہو، بلکہ یہ سب کچھ ہماری وحی کے ذریعے سے ہوا۔ ¤ ➌ { وَ لٰكِنَّا كُنَّا مُرْسِلِيْنَ:} لیکن بات یہ ہے کہ ہم ہمیشہ سے پیغمبر بھیجتے رہے ہیں، جو لوگوں کو غفلت سے بیدار کرتے اور ہمارے احکام سے آگاہ کرتے رہے۔ اب اسی عادت کے مطابق ہم نے آپ کو رسول بنا کر بھیجا اور آپ پر یہ آخری کتاب نازل فرمائی، تاکہ لمبی مدتیں گزرنے کے بعد لوگ پھر صحیح دین اور اصل واقعات سے آگاہ ہو جائیں۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { وَ مَا كُنْتَ بِجَانِبِ الطُّوْرِ اِذْ نَادَيْنَا:} ان تینوں آیات میں {’’ وَ مَا كُنْتَ ‘‘} (اور تو وہاں موجود نہ تھا) کی تکرار سے رسول اللہ صلی اللہ علیہ وسلم کے حق اور صدق پر ہونے کو واضح فرمایا گیا ہے کہ جب آپ ان مقامات میں سے کہیں بھی موجود نہیں تھے، پھر بھی ان کے بارے میں اصل حقائق کو صحیح طور پر اور بالکل واقعہ کے مطابق بیان کرتے ہیں تو یہ اس بات کی کھلی دلیل اور واضح ثبوت ہے کہ آپ اللہ کے سچے رسول ہیں۔ اس کی وحی آپ کے پاس آتی ہے جس کے ذریعے سے آپ یہ سب کچھ اتنی صحت کے ساتھ بیان کرتے ہیں۔ ¤ ➋ { ’’ وَ مَا كُنْتَ ‘‘} (اور تو وہاں موجود نہ تھا) کی تکرار کے ساتھ یہ اہم حقیقت بھی واضح فرما دی گئی ہے کہ پیغمبر حاضر و ناظر اور ہر جگہ موجود نہیں ہوتے، نہ وہ عالم الغیب ہوتے ہیں۔ انھیں جو علم ہوتا ہے وحی کے ذریعے سے ہوتا ہے اور وہ بھی اتنا جتنی وحی کی جائے۔ ¤ ➌ { وَ لٰكِنْ رَّحْمَةً مِّنْ رَّبِّكَ:} یعنی آپ کو یہ واقعات اس لیے معلوم نہیں ہوئے کہ آپ ان مواقع پر موجود تھے، یا انھیں دیکھ رہے تھے، بلکہ یہ آپ کے رب کی رحمت ہے کہ اس نے آپ کو نبوت عطا فرمائی اور وحی سے نوازا۔ ¤ ➍ {لِتُنْذِرَ قَوْمًا مَّاۤ اَتٰىهُمْ مِّنْ نَّذِيْرٍ …:} اس قوم سے مراد اہل مکہ اور عربب ہیں۔ ان میں ابراہیم، اسماعیل اور شعیب علیھم السلام کے بعد کوئی نبی نہیں آیا تھا۔ ہزاروں برس کی اس طویل مدت میں باہر کے انبیاء کی دعوتیں تو ضرور وہاں پہنچتی رہیں، مثلاً موسیٰ اور عیسیٰ علیھما السلام کی دعوت، کیونکہ اس کے بغیر ان کا کفر و شرک پر جمے رہنے کا عذر موجود رہتا، جب کہ اللہ تعالیٰ نے یہ عذر کسی کے لیے باقی نہیں چھوڑا، مگر خاص اس سر زمین میں کسی نبی کی بعثت نہیں ہوئی۔ اس لیے اللہ تعالیٰ نے وہاں آخری پیغمبر کو مبعوث فرمایا۔ اس مضمون کی آیات کے لیے دیکھیے سورۂ سجدہ (۳) اور یٰس (۱ تا ۶)۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {وَ لَوْ لَاۤ اَنْ تُصِيْبَهُمْ مُّصِيْبَةٌ … :} یعنی عرب کے لوگوں کا کفرو شرک اور ان کی سرکشی اس حد تک بڑھ چکی تھی کہ اگر اللہ تعالیٰ کوئی پیغمبر بھیجے بغیر بھی ان پر عذاب بھیجتا تو ظلم نہ ہوتا، کیونکہ ان پر جو مصیبت آتی ان کے ہاتھوں کی کمائی ہوتی، مگر اس نے احسان فرمایا اور ان کے لیے عذر کا کوئی موقع نہیں چھوڑا کہ وہ کہہ سکیں کہ پروردگارا! تو نے ہماری طرف کوئی پیغام پہنچانے والا کیوں نہ بھیجا کہ ہم تیری آیات کی پیروی کرتے اور ایمان لانے والوں میں شامل ہو جاتے۔ یہ مضمون کہ اللہ تعالیٰ نے انبیاء اس لیے بھیجے کہ لوگوں کے پاس ککفرو شرک کا کوئی عذر باقی نہ رہے، قرآن میں کئی جگہ بیان ہوا ہے۔ دیکھیے سورۂ نساء (۱۶۵)، انعام (۱۵۶، ۱۵۷)، مائدہ (۱۹) اور سورۂ فاطر (۲۴) وغیرہ۔ ¤ ➋ {’’ وَ لَوْ لَاۤ اَنْ تُصِيْبَهُمْ مُّصِيْبَةٌ ‘‘} کا جواب محذوف ہے، جو سلسلہ کلام سے خود بخود سمجھ میں آ رہا ہے، یعنی اگر یہ بات نہ ہوتی کہ اپنے اعمالِ بد کی وجہ سے عذاب آنے پر یہ لوگ کہیں گے کہ پروردگارا! تو نے ہماری طرف کوئی رسول کیوں نہ بھیجا، {’’ لَعَجَّلْنَا لَهُمُ الْعَذَابَ‘‘} (تو ہم ان پر جلدی عذاب بھیج دیتے)، یا {’’ لَمَا أَرْسَلْنَا رَسُوْلًا‘‘} (تو ہم کوئی رسول نہ بھیجتے)۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ { فَلَمَّا جَآءَهُمُ الْحَقُّ مِنْ عِنْدِنَا …:} یعنی رسول نہ بھیجتے تو بہانہ ہوتا کہ رسول کیوں نہ بھیجا، اب ہماری طرف سے رسول آیا تو ضد اور عناد سے کہنے لگے کہ اسے اس قسم کے معجزات کیوں نہیں دیے جو موسیٰ کو دیے گئے تھے، مثلاً عصا، یدِبیضا، سمندر کا پھٹنا، بادلوں کا سایہ کرنا، پتھر سے بارہ چشمے پھوٹنا، من و سلویٰ کا اترنا، اللہ تعالیٰ کا کلام کرنا اور تورات کا الواح کی شکل میں نازل ہونا وغیرہ۔ معلوم ہوا نہ ماننا ہو تو بہانے ختم نہیں ہوتے۔ ¤ ➋ مفسر رازی فرماتے ہیں : ’’ان لوگوں نے جو مطالبہ کیا ضروری نہیں تھا کہ اسی طرح ہوتا، کیونکہ نہ تمام انبیاء کے معجزات کا ایک ہونا لازم ہے اور نہ یہ ضروری ہے کہ ان پر اترنے والی کتاب ایک ہی طرح نازل ہو، کیونکہ کبھی کتاب کا اکھٹا نازل ہونا بہتر ہوتا ہے جیسے تورات اور کبھی جدا جدا کر کے نازل کرنا بہتر ہوتا ہے، جیسے قرآن۔‘‘ ¤ ➌ { اَوَ لَمْ يَكْفُرُوْا بِمَاۤ اُوْتِيَ مُوْسٰى مِنْ قَبْلُ :} یعنی ان کے طلب کردہ معجزات اگر دکھا بھی دیے جائیں تو کیا فائدہ؟ جنھوں نے طے کر لیا ہے کہ ایمان نہیں لانا، وہ ہر طرح کی نشانیاں دیکھنے کے باوجود ایمان نہیں لائیں گے۔ کیا ان کے ہم جنس لوگوں نے جو ان جیسا مذہب اور ان جیسا عناد رکھنے والے تھے، یعنی موسیٰ علیہ السلام کے زمانے کے کافر، انھوں نے ان معجزات کا انکار نہیں کیا تھا جو موسیٰ کو دیے گئے تھے؟ انھوں نے موسیٰ اور ہارون علیھما السلام کے متعلق کہا تھا کہ یہ (اتنے بڑے جادوگر ہیں کہ) مجسم جادو ہیں، جو ایک دوسرے کی مدد کر رہے ہیں اور انھوں نے کہا تھا کہ ہم تو ان سب سے منکر ہیں۔ ¤ یہ معنی درست ہے، مگر اس سے زیادہ صحیح بات یہ ہے کہ{ ’’ اَوَ لَمْ يَكْفُرُوْا …‘‘} (کیا انھوں نے ان چیزوں کا انکار نہیں کیا جو موسیٰ کو دی گئیں) میں انکار کرنے والوں سے مراد قریش ہی ہیں جنھوں نے رسول اللہ صلی اللہ علیہ وسلم سے وہ معجزے لانے کا مطالبہ کیا جو موسیٰ علیہ السلام کو دیے گئے۔ اس معنی کے زیادہ صحیح ہونے کی دلیل یہ ہے کہ{’’ فَلَمَّا جَآءَهُمُ الْحَقُّ ‘‘} سے لے کر {’’ وَ قَالُوْۤا اِنَّا بِكُلٍّ كٰفِرُوْنَ ‘‘} تک سب باتیں کہنے والے وہی لوگ ہیں جن کے متعلق اللہ تعالیٰ نے اگلی آیت میں فرمایا : «{ قُلْ فَاْتُوْا بِكِتٰبٍ مِّنْ عِنْدِ اللّٰهِ هُوَ اَهْدٰى مِنْهُمَاۤ }» ’’کہہ پھر اللہ کے پاس سے کوئی ایسی کتاب لے آؤ جو ان دونوں سے زیادہ یادہ ہدایت والی ہو۔‘‘ ظاہر ہے رسول اللہ صلی اللہ علیہ وسلم کو یہ بات کہنے کا حکم ان لوگوں کے لیے تھا جو آپ کے مخاطب تھے اور وہ قریش تھے، یا آپ کے زمانے کے دوسرے کفار، کیونکہ وہ صرف رسول اللہ صلی اللہ علیہ وسلم کی نبوت ہی کے منکر نہ تھے بلکہ اس سے پہلی نبوتوں کے بھی منکر تھے، وہ نہ موسیٰ علیہ السلام پر ایمان لا کر ان کے تابع دار بنے، نہ عیسیٰ علیہ السلام پر۔ اللہ تعالیٰ نے آپ کے زمانے کے کفار کا قول نقل فرمایا : «{ وَ قَالَ الَّذِيْنَ كَفَرُوْا لَنْ نُّؤْمِنَ بِهٰذَا الْقُرْاٰنِ وَ لَا بِالَّذِيْ بَيْنَ يَدَيْهِ}» [ سبا : ۳۱ ] ’’اور ان لوگوں نے کہا جنھوں نے کفر کیا، ہم ہرگز نہ اس قرآن پر ایمان لائیں گے اور نہ اس پر جو اس سے پہلے ہے۔‘‘ مطلب یہ کہ موسیٰ علیہ السلام کے جن معجزوں کا یہ مطالبہ کر رہے ہیں ان معجزوں کے باوجود موسیٰ علیہ السلام پر بھی یہ کب ایمان لائے تھے جو اب محمد صلی اللہ علیہ وسلم سے ان کا مطالبہ کر رہے ہیں۔ یہ خود کہتے ہیں کہ موسیٰ علیہ السلام کو یہ معجزے دیے گئے تھے، مگر پھر بھی انھوں نے ان کو نبی مان کر ان کی پیروی کبھی قبول نہیں کی۔ ¤ ➍ { قَالُوْا سِحْرٰنِ تَظٰهَرَا:} یعنی قرآن اور تورات دونوں جادو ہیں، جو ایک دوسرے کی تصدیق کرتی ہیں۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما سے یہی نقل فرمایا ہے۔ آسمانی کتابوں میں قرآن کے بعد سب سے عظیم الشان کتاب تورات ہے، موسیٰ علیہ السلام کے بعد تمام انبیاء بشمول عیسیٰ علیہ السلام اسی پر عمل پیرا رہے، اس لیے قرآن میں عموماً تورات اور قرآن کا ذکر ایک ساتھ آیا ہے، جیسا کہ فرمایا : «{ قُلْ مَنْ اَنْزَلَ الْكِتٰبَ الَّذِيْ جَآءَ بِهٖ مُوْسٰى نُوْرًا وَّ هُدًى لِّلنَّاسِ }» [ الأنعام :۹۱ ] ’’کہہ وہ کتاب کس نے اتاری جو موسیٰ لے کر آیا؟ جو لوگوں کے لیے روشنی اور ہدایت تھی۔‘‘ یہاں تورات کے نور اور ہدایت ہونے کا ذکر فرمایا، پھر قرآن کے متعلق فرمایا : «{ وَ هٰذَا كِتٰبٌ اَنْزَلْنٰهُ مُبٰرَكٌ مُّصَدِّقُ الَّذِييْ بَيْنَ يَدَيْهِ }» [ الأنعام : ۹۲] ’’اور یہ ایک کتاب ہے، ہم نے اسے نازل کیا، بڑی برکت والی ہے، اس کی تصدیق کرنے والی جو اس سے پہلے ہے۔‘‘ اسی سورۂ انعام کے آخر میں فرمایا: «{ ثُمَّ اٰتَيْنَا مُوْسَى الْكِتٰبَ تَمَامًا عَلَى الَّذِيْۤ اَحْسَنَ }» [ الأنعام : ۱۵۴ ] ’’پھر ہم نے موسیٰ کو کتاب دی اس شخص پر (نعمت) پوری کرنے کے لیے جس نے نیکی کی۔‘‘ اور اس سے اگلی آیت میں قرآن کا ذکر فرمایا : «{ وَ هٰذَا كِتٰبٌ اَنْزَلْنٰهُ مُبٰرَكٌ فَاتَّبِعُوْهُ وَ اتَّقُوْا لَعَلَّكُمْ تُرْحَمُوْنَ }» [ الأنعام : ۱۵۵ ] ’’اور یہ ایک کتاب ہے جسے ہم نے نازل کیا ہے، بڑی برکت والی، پس اس کی پیروی کرو اور بچ جاؤ، تاکہ تم پر رحم کیا جائے۔‘‘"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) { قُلْ فَاْتُوْا بِكِتٰبٍ مِّنْ عِنْدِ اللّٰهِ … :} یعنی ان سے کہہ دیجیے کہ اگر تم اس بات میں سچے ہو کہ میں اور موسیٰ جادو گر ہیں اور تورات اور قرآن جادو ہیں، تو تم کوئی ایسی کتاب لے آؤ جو من گھڑت نہ ہو، بلکہ اللہ تعالیٰ کی طرف سے ہو اور ان دونوں کتابوں سے زیادہ ہدایت والی ہو، تو میں بلا تامل اس کی پیروی کروں گا، کیونکہ مجھے تو ہدایت سے سروکار ہے۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ { فَاِنْ لَّمْ يَسْتَجِيْبُوْا لَكَ فَاعْلَمْ … :} پھر اگر وہ تمھارا یہ مطالبہ قبول نہ کریں تو جان لو کہ ان کے پاس کوئی دلیل یا حجت نہیں، بلکہ وہ صرف اپنی خواہشات کی پیروی کر رہے ہیں۔ اس کا مطلب یہ نہیں کہ وہ یہ مطالبہ قبول کر سکتے ہیں، بلکہ یہ بات ان کے عجز کے اظہار کے لیے کہی جا رہی ہے، کیونکہ سب جانتے ہیں کہ ایسی کتاب کہاں سے آ سکتی ہے۔ یہ ایسے ہی ہے جیسے فرمایا : «{ فَاِنْ لَّمْ تَفْعَلُوْا وَ لَنْ تَفْعَلُوْا فَاتَّقُوا النَّارَ الَّتِيْ وَ قُوْدُهَا النَّاسُ وَ الْحِججَارَةُ }» [ البقرۃ : ۲۴ ] ’’پھر اگر تم نے ایسا نہ کیا اور نہ کبھی کرو گے تو اس آگ سے بچ جاؤ جس کا ایندھن انسان اور پتھر ہیں۔‘‘ ¤ ➋ { وَ مَنْ اَضَلُّ مِمَّنِ اتَّبَعَ هَوٰىهُ بِغَيْرِ هُدًى مِّنَ اللّٰهِ:} ’’اور اس شخص سے بڑھ کر کون گمراہ ہے جو اللہ تعالیٰ کی طرف سے آنے والی ہدایت کو چھوڑ کر اپنی خواہش کی پیروی کرے۔‘‘ اس آیت میں تقلید کا زبردست رد ہے، کیونکہ تقلید کی تعریف ہے : {’’ أَخْذُ قَوْلِ الْغَيْرِ بِلاَ دَلِيْلٍ‘‘} کہ اللہ اور اس کے رسول کے غیر کی بات کو بلا دلیل لے لینا۔ اللہ کی طرف سے آنے والی ہدایت دلیل ہے، جو قرآن اور سنت ہے۔ اس کو چھوڑ کر جس کی بھی بات مانی جائے وہ خواہش کی پیروی ہے، جس سے بڑی گمراہی کوئی نہیں۔ رازی نے بھی اس آیت کو تقلید کے رد کی دلیل قرار دیا ہے۔ ¤ ➌ { اِنَّ اللّٰهَ لَا يَهْدِي الْقَوْمَ الظّٰلِمِيْنَ:} یہ کہنے کے بجائے کہ اللہ ایسے لوگوں کو جو خواہش کی پیروی کریں، ہدایت نہیں دیتا، فرمایا، اللہ ظالم لوگوں کو ہدایت نہیں دیتا، یعنی اللہ کی ہدایت کے بجائے اپنی خواہش کی پیروی کرنے والے ظالم ہیں اور اللہ ظالموں کو ہدایت نہیں دیا کرتا، کیونکہ وہ ظلمت میں رہنا پسند کرتے ہیں اور جو چیز جہاں رکھنی چاہیے وہاں رکھنے کے بجائے دوسری جگہ رکھتے ہیں (ظلم کا یہی معنی ہے) اور جو اندھیرے میں رہنے پر اصرار کرے اسے ہدایت کی روشنی کیسے نصیب ہو سکتی ہے۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) {وَ لَقَدْ وَصَّلْنَا لَهُمُ الْقَوْلَ …:’’ وَصَّلَ الْقَوْلَ تَوْصِيْلاً ‘‘} بات کے ساتھ بات ملانا، پے در پے بات پہنچانا۔ قرآن اور تورات کو جادو قرار دے کر دونوں کے انکار کے اعلان کا مطلب یہ ہوا کہ ان کے مطابق اللہ کی طرف سے ان کے پاس کوئی ہدایت آئی ہی نہیں اور بلاغت کا قاعدہ ہے کہ انکار جتنا شدید ہو اتنی ہی تاکید کے ساتھ بات کی جاتی ہے۔ اس لیے اللہ تعالیٰ نے ’’لام‘‘ اور {’’قَدْ‘‘} کی دوہری تاکید کے ساتھ، جو قسم کا مفہوم رکھتی ہے، فرمایا : ’’اور بلاشبہ یقینا ہم نے انھیں پے در پے بات پہنچائی، تاکہ وہ نصیحت حاصل کریں۔‘‘ اس کے دو مطلب ہو سکتے ہیں اور دونوں ہی مراد ہیں، ایک یہ کہ ہم ایک رسول کے بعد دوسرا رسول اور ایک کتاب کے بعد دوسری کتاب بھیجتے رہے اور اس طرح مسلسل اپنی بات لوگوں تک پہنچاتے رہے، ان سب کی تعلیمات ان تک بھی پہنچتی رہیں، تاکہ یہ خوابِ غفلت سے بیدار ہوں۔ دوسرا مطلب یہ ہے کہ قرآن مجید ایک ہی دفعہ نازل کر دینے کے بجائے ہم انھیں اس کی آیات یکے بعد دیگرے پے در پے پہنچا رہے ہیں، کبھی وعدہ و وعید کی صورت میں، کبھی وعظ و نصیحت کی صورت میں، کبھی قصوں اور عبرتوں کے بیان کی صورت میں اور کبھی امر و نہی کی صورت میں کہ کسی طور پر نصیحت حاصل کریں۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) { اَلَّذِيْنَ اٰتَيْنٰهُمُ الْكِتٰبَ مِنْ قَبْلِهٖ …:} یعنی درحقیقت یہ لوگ ضد اور عناد میں گرفتار ہیں، ہدایت کے طالب ہی نہیں، کیونکہ اگر یہ فی الواقع ہدایت کے طلب گار ہوتے تو ہمارے پے در پے نصیحت کرنے سے ہدایت پا جاتے، جیسا کہ کئی لوگ جنھیں ہم نے اس سے پہلے کتاب دی، وہ اس قرآن پر ایمان لاتے ہیں، جیسا کہ عبد اللہ بن سلام، سلمان فارسی، تمیم داری، جارود عبدی اور رفاعہ قرظی رضی اللہ عنھم وغیرہ اور وہ عیسائی جو نجاشی کے پاس تھے اور قرآن سن کر رونے لگے تھے، جن کا ذکر سورۂ اعراف (۱۵۹) میں گزر چکا ہے۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ { وَ اِذَا يُتْلٰى عَلَيْهِمْ قَالُوْۤا اٰمَنَّا بِهٖۤ:} یعنی جب ان کے سامنے قرآن کی تلاوت ہوتی ہے تو وہ کہتے ہیں، ہم اس پر ایمان لے آئے۔ ¤ ➋ { اِنَّهُ الْحَقُّ مِنْ رَّبِّنَاۤ: ’’إِنَّ‘‘} علت بیان کرنے کے لیے ہوتا ہے، مطلب یہ کہ ہم اس پر ایمان لے آئے، کیونکہ یہ ہمارے رب کی طرف سے حق ہے۔ ¤ ➌ { اِنَّا كُنَّا مِنْ قَبْلِهٖ مُسْلِمِيْنَ:} یہ بھی ایمان لانے کی ایک علت ہے، یعنی ہم سنتے ہی اس پر اس لیے ایمان لے آئے کہ ہم اس سے پہلے ہی مسلم تھے۔ تورات و انجیل کی بنیادی تعلیم وہی تھی جو قرآن کی ہے، جب ہم نے دیکھا کہ یہ تو وہی ہے تو ہم اس پر ایمان لے آئے۔ اس سے معلوم ہوا کہ پہلی امتوں کا دین اسلام تھا اور وہ بھی مسلم تھے، جیسا کہ فرمایا : «{ مِلَّةَ اَبِيْكُمْ اِبْرٰهِيْمَ هُوَ سَمّٰىكُمُ الْمُسْلِمِيْنَ مِنْ قَبْلُ وَ فِيْ هٰذَا }» [ الحج : ۷۸ ] ’’اپنے باپ ابراہیم کی ملت کے مطابق، اسی نے تمھارا نام مسلمین رکھا، اس سے پہلے اور اس (کتاب) میں بھی۔‘‘ یہ کہنا کہ ’’مسلمین‘‘ صرف امت محمد صلی اللہ علیہ وسلم کا نام ہے، درست نہیں۔ {’’ اِنَّا كُنَّا مِنْ قَبْلِهٖ مُسْلِمِيْنَ ‘‘} کا معنی یہ بھی ہے کہ تورات و انجیل میں اس نبی اور اس کتاب کی پیش گوئیاں پڑھ کر ہم تو اس سے پہلے ہی اس پر ایمان رکھتے تھے اور دل و جان سے مسلم یعنی اس کے تابع فرمان تھے۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ { اُولٰٓىِٕكَ يُؤْتَوْنَ اَجْرَهُمْ مَّرَّتَيْنِ :} یعنی اہل کتاب میں سے جو لوگ نبی کریم صلی اللہ علیہ وسلم پر ایمان لائے انھیں دوہرا اجر ملے گا، کیونکہ یہ لوگ پہلے رسول پر ایمان لائے، پھر آپ صلی اللہ علیہ وسلم پر بھی ایمان لائے۔ ابو موسیٰ اشعری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ ثَلَاثَةٌ لَهُمْ أَجْرَانِ : رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ وَ آمَنَ بِمُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ، وَالْعَبْدُ  الْمَمْلُوْكُ إِذَا أَدّٰی حَقَّ اللّٰهِ وَ حَقَّ مَوَالِيْهِ وَ رَجُلٌ كَانَتْ عِنْدَهُ أَمَةٌ يَطَؤُهَا فَأَدَّبَهَا فَأَحْسَنَ تَأْدِيْبَهَا وَ عَلَّمَهَا فَأَحْسَنَ تَعْلِيْمَهَا ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا فَلَهُ أَجْرَانِ ] [بخاري، العلم، باب تعلیم الرجل أمتہ و أھلہ : ۹۷ ]’’تین آدمیوں کے لیے دو اجر ہیں، ایک اہل کتاب میں سے کوئی آدمی جو اپنے نبی پر ایمان لایا اور محمد صلی اللہ علیہ وسلم پر ایمان لایا اور ایک وہ غلام جو کسی کی ملکیت میں ہے، جب اللہ کا حق ادا کرے اور اپنے مالکوں کا حق ادا کرے اور ایک وہ آدمی جس کے پاس کوئی لونڈی تھی، جس سے وہ جماع کرتا تھا، اسے اس نے ادب سکھایا اور اچھا ادب سکھایا اور تعلیم دی اور اچھی تعلیم دی، پھر آزاد کر کے اس سے نکاح کر لیا، تو اس کے لیے دو اجر ہیں۔‘‘ ¤ ➋ { بِمَا صَبَرُوْا:} صبر تین طرح کا ہے، طاعت پر صبر، معصیت سے صبر اور مصیبت پر صبر۔ یعنی پہلے ایک رسول علیہ السلام پر ایمان لا کر صابر اور ثابت قدم رہے، پھر دوسرے رسول صلی اللہ علیہ وسلم پر ایمان لا کر اس پر ثابت قدم رہے۔ اسی طرح خواہشاتِ نفس کے مقابلے میں ثابت قدم رہے اور ان آزمائشوں اور مصیبتوں پر صبر کرتے رہے جو قبول اسلام کے بعد ان پر آئیں۔ ¤ ➌ { وَ يَدْرَءُوْنَ بِالْحَسَنَةِ السَّيِّئَةَ : ’’دَرَأَ يَدْرَأُ‘‘} کا معنی دفع کرنا، دور کرنا، یا پرے ہٹانا ہے۔ اس آیت کے دو مطلب ہیں، ایک یہ کہ اگر کوئی شخص ان سے برا سلوک کرے تو اس کا جواب برائی سے نہیں بلکہ اچھے سے اچھے طریقے سے دیتے ہیں، جیساکہ فرمایا : «{ وَ لَا تَسْتَوِي الْحَسَنَةُ وَ لَا السَّيِّئَةُ اِدْفَعْ بِالَّتِيْ هِيَ اَحْسَنُ فَاِاِذَا الَّذِيْ بَيْنَكَ وَ بَيْنَهٗ عَدَاوَةٌ كَاَنَّهٗ وَلِيٌّ حَمِيْمٌ }» [ حٰم السجدۃ : ۳۴ ] ’’ اور نہ نیکی برابر ہوتی ہے اور نہ برائی۔ (برائی کو) اس (طریقے) کے ساتھ ہٹا جو سب سے اچھا ہے، تو اچانک وہ شخص کہ تیرے درمیان اور اس کے درمیان دشمنی ہے، ایسا ہوگا جیسے وہ دلی دوست ہے۔‘‘ اور دیکھیے سورۂ رعد (۲۲) اور دوسرا مطلب یہ ہے کہ اگر ان سے کوئی برائی ہو جائے تو بعد میں نیک اعمال کر کے اس کا اثر ختم کرنے کی کوشش کرتے ہیں، جیسا کہ فرمایا : «{ وَ اَقِمِ الصَّلٰوةَ طَرَفَيِ النَّهَارِ وَ زُلَفًا مِّنَ الَّيْلِ اِنَّ الْحَسَنٰتِ يُذْهِبْنَ السَّيِّاٰتِ }» [ ھود : ۱۱۴ ]’’اور دن کے دونوں کناروں میں نماز قائم کر اور رات کی کچھ گھڑیوں میں بھی، بے شک نیکیاں برائیوں کو لے جاتی ہیں۔‘‘ ¤ ➍ { وَ مِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ:} برائی کا جواب اچھائی سے دینا، یا نیکی کے ساتھ برائی کو مٹانا بعض اوقات ممکن ہی نہیں ہوتا جب تک خرچ نہ کیا جائے، اس لیے ان کی یہ صفت بیان فرمائی کہ ہم نے انھیں جو کچھ دیا اس میں سے خرچ کرتے ہیں۔ اس میں حقوقِ واجبہ و مستحبہ، فرض زکاۃ اور نفلی صدقات سبھی آ گئے۔ {’’ رَزَقْنٰهُمْ ‘‘} میں اپنے احسان کا احساس بھی دلایا ہے اور یہ بھی کہ اگر وہ خرچ کرتے ہیں تو اپنا کچھ خرچ نہیں کرتے، بلکہ اللہ کا دیا ہوا ہی خرچ کرتے ہیں، لہٰذا انھیں خرچ کرنے میں دریغ نہیں ہونا چاہیے۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) ➊ { وَ اِذَا سَمِعُوا اللَّغْوَ اَعْرَضُوْا عَنْهُ:} یعنی جب کوئی لغو بات سنتے ہیں تو اس سے کنارہ کشی اختیار کرتے ہیں، جیسا کہ فرمایا : { وَ اِذَا مَرُّوْا بِاللَّغْوِ مَرُّوْا كِرَامًا } [ الفرقان : ۷۲ ] ’’جب بے ہودہ کام کے پاس سے گزرتے ہیں تو باعزت گزر جاتے ہیں۔‘‘ ¤ ➋ { وَ قَالُوْا لَنَاۤ اَعْمَالُنَا وَ لَكُمْ اَعْمَالُكُمْ :} یعنی جب کوئی جاہل بے وقوفی کی کوئی حرکت کرے یا نامناسب بات کرے تو جواب میں ایسی بات یا حرکت نہیں کرتے، بلکہ کہتے ہیں، ہمارے لیے ہمارے عمل ہیں اور تمھارے لیے تمھارے عمل، تم جہالت کرو گے ہم صبر ہی کریں گے۔ مزید دیکھیے سورۂ شوریٰ (۱۵) اور سبا (۲۵، ۲۶)۔ ¤ ➌ { سَلٰمٌ عَلَيْكُمْ:} دوسری جگہ فرمایا : «{ وَ اِذَا خَاطَبَهُمُ الْجٰهِلُوْنَ قَالُوْا سَللٰمًا }» [ الفرقان : ۶۳ ] ’’اور جب جاہل لوگ ان سے بات کرتے ہیں تو وہ کہتے ہیں سلام ہے۔‘‘ جاہلوں کو سلام محبت اور دعا کا سلام نہیں، بلکہ جدائی اور قطع تعلق کا سلام ہے۔ بعض اہلِ علم نے فرمایا کہ سلام ایمان والوں کے درمیان ایک دوسرے کے لیے دعا ہے اور جاہلوں کا جہل برداشت کرنے کی علامت ہے۔ ¤ ➍ اس سے معلوم ہوا کہ جس جاہل سے توقع نہ ہو کہ سمجھانے سے سمجھے گا تو اس سے کنارا ہی بہتر ہے۔ ¤ ➎ { لَا نَبْتَغِي الْجٰهِلِيْنَ :} یعنی ہم نہ دوستی اور مجلس کے لیے جاہلوں کو چاہتے ہیں، نہ جہالت میں مقابلے یا گالی گلوچ اور لڑائی جھگڑے کے لیے انھیں چاہتے ہیں، بلکہ دور ہی سے سلام کہہ کر ان سے کنارا کرتے ہیں۔ یہ بات دل میں کہتے ہیں، کیونکہ اونچی کہنے سے تو خواہ مخواہ جھگڑا ہو سکتا ہے۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ { اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ …:} رسول اللہ صلی اللہ علیہ وسلم تمام لوگوں کے بے حد خیر خواہ تھے اور ان کے ایمان لانے کی شدید خواہش رکھتے تھے۔ خصوصاً آپ کے دل میں اپنے قرابت داروں کے متعلق صلہ رحمی کے جذبے کی وجہ سے یہ خواہش اور بھی زیادہ تھی۔ اس مقام پر اہل کتاب کے ان لوگوں کا ذکر آیا جو کتاب اللہ کی تلاوت سنتے ہی ایمان لے آئے، تو قدرتی طور پر آپ صلی اللہ علیہ وسلم کی طبیعت کا اس بات سے متاثر ہونا لازمی تھا کہ نسبتاً دور والے ایمان لانے میں بازی لے گئے اور میرے قرابت دار حتیٰ کہ عزیز چچا ابو طالب اس نعمت سے محروم رہے۔ اس پر اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو تسلی دی کہ اس معاملے میں آپ کی دعوت یا خیر خوااہی میں کوئی کمی نہیں، بلکہ بات یہ ہے کہ ہدایت آپ کے اختیار میں نہیں، اللہ تعالیٰ کے اختیار میں ہے اور وہی زیادہ جانتا ہے کہ ہدایت پانے والے کون ہیں، اہلِ کتاب ہیں یا عرب، اقارب ہیں یا دور کے رشتہ دار۔ (بقاعی) کسی اور کو علم ہی نہیں کہ ہدایت کسے دینی ہے، تو وہ ہدایت کیا دے گا؟ تمام مفسرین کا اتفاق ہے کہ یہ آیت رسول اللہ صلی اللہ علیہ وسلم کے چچا ابو طالب کے بارے میں اتری۔ ¤ ➋ سعید بن مسیب کے والد بیان کرتے ہیں : [ لَمَّا حَضَرَتْ أَبَا طَالِبٍ الْوَفَاةُ جَاءَهُ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ فَوَجَدَ عِنْدَهُ أَبَا جَهْلٍ وَعَبْدَ اللّٰهِ بْنَ أَبِيْ أُمَيَّةَ بْنِ الْمُغِيْرَةِ، فَقَالَ أَيْ عَمِّ! قُلْ لاَ إِلٰلٰهَ إِلاَّ اللّٰهُ، كَلِمَةً أُحَاجُّ لَكَ بِهَا عِنْدَ اللّٰهِ، فَقَالَ أَبُوْ جَهْلٍ وَعَبْدُ اللّٰهِ بْنُ أَبِيْ أُمَيَّةَ أَتَرْغَبُ عَنْ مِلَّةِلَّةِ عَبْدِ الْمُطَّلِبِ؟ فَلَمْ يَزَلْ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ  عَلَيْهِ وَسَلَّمَ يَعْرِضُهَا عَلَيْهِ، وَيُعِيْدَانِهِ بِتِلْكَ الْمَقَالَةِ حَتّٰي قَالَ أَبُوْ طَالِبٍ آخِرَ مَا كَلَّمَهُمْ ع عَلٰی مِلَّةِ عَبْدِ الْمُطَّلِبِ، وَأَبٰی أَنْ يَّقُوْلَ لاَ إِلٰهَ إِلاَّ اللّٰهُ، قَالَ فَقَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَاللّٰهِ! لَأَسْتَغْفِرَنَّ لَكَ مَا لَمْ أُنْهَ عَنْكَ ، فَأَنْزَلَ اللّٰهُ : «مَا كَانَ لِلنَّبِيِّ وَ الَّذِيْنَ اٰمَنُووْۤا اَنْ يَّسْتَغْفِرُوْا لِلْمُشْرِكِيْنَ» وَ أَنْزَلَ اللّٰهُ فِيْ أَبِيْ طَالِبٍ، فَقَالَ لِرَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ : «{ اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ وَ لٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَآءُ}» ] [ بخاري، التفسیر، باب قولہ : «إنک لا تھدی من أحببت… » ۴۷۷۲ ] ’’جب ابو طالب کی وفات کا وقت آیا تو رسول اللہ صلی اللہ علیہ وسلم اس کے پاس آئے اور اس کے پاس ابوجہل اور عبداللہ بن ابی امیہ بن مغیرہ کو پایا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’اے چچا! تو ’’لاالٰہ الا اللہ‘‘ کہہ دے، یہ ایسا کلمہ ہے جس کے ذریعے سے میں تیرے لیے اللہ کے پاس جھگڑا کروں گا۔‘‘ تو ابو جہل اور عبداللہ بن ابی امیہ نے کہا : ’’کیا تو عبدالمطلب کی ملت سے بے رغبتی کرتا ہے۔‘‘ چنانچہ رسول اللہ صلی اللہ علیہ وسلم اس کے سامنے یہی بات پیش کرتے رہے اور وہ دونوں اپنی وہی باتات دہراتے رہے، حتیٰ کہ ابوطالب نے ان سے آخری بات جو کی وہ یہ تھی : ’’عبد المطلب کی ملت پر (مر رہا ہوں)۔‘‘ اور اس نے ’’لا الٰہ الا اللہ‘‘ کہنے سے انکار کر دیا۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ کی قسم! میں ہر صورت تیرے لیے استغفار کروں گا، جب تک مجھے منع نہ کر دیا گیا۔‘‘ تو اللہ عزوجل نے یہ آیت نازل فرمائی : «{ مَا كَانَ لِلنَّبِيِّ وَ الَّذِيْنَ اٰمَنُوْۤا اَنْ يَّسْتَغْفِرُوْا لِلْمُشْرِكِيْنَ وَ لَوْ كَانُوْۤا اُولِيْ قُرْبٰى }» [ التوبۃ : ۱۱۳ ] ’’اس نبی اور ان لوگوں کے لیے جو ایمان لائے، کبھی جائز نہیں کہ وہ مشرکوں کے لیے بخشش کی دعا کریں، خواہ وہ قرابت دار ہوں۔‘‘ اور اللہ عزوجل نے ابوطالب کے بارے میں یہ آیت نازل فرمائی اور رسول اللہ صلی اللہ علیہ وسلم کو مخاطب کر کے فرمایا : «{ اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ وَ لٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَآءُ }» ’’بے شک تو ہدایت نہیں دیتا جسے تو دوست رکھے اور لیکن اللہ ہدایت دیتا ہے جسے چاہتا ہے۔‘‘ ¤ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے چچا سے کہا : ’’تو ’’لا الٰہ الا اللہ‘‘ کہہ دے، میں قیامت کے دن تیرے لیے اس کی شہادت دوں گا۔‘‘ اس نے کہا : ’’اگر یہ نہ ہوتا کہ قریش کے لوگ مجھے عار دلائیں گے کہ اسے اس پر (موت کی) گھبراہٹ نے آمادہ کیا تو میں اس کے ساتھ تیری آنکھ ٹھنڈی کر دیتا۔‘‘ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی : «{ اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ وَ لٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَآءُ }» [ ممسلم، الإیمان، باب الدلیل علٰی صحۃ إسلام … : 25/42 ] ¤ ➌ بعض لوگوں کو اصرار ہے کہ ابوطالب اسلام پر فوت ہوا، ان کا کہنا یہ ہے کہ عبدالمطلب ملتِ ابراہیم پر تھے اور {’’عَلٰي مِلَّةِ عَبْدِ الْمُطَّلِبِ‘‘} کہنے کا مطلب یہ ہے کہ ’’میں ملتِ ابراہیم پر فوت ہو رہا ہوں‘‘ لہٰذا وہ مسلمان تھا۔ مگر حدیث کے الفاظ ’’اور اس نے لا الٰہ الا اللہ کہنے سے انکار کر دیا‘‘ کے بعد اس تاویل کی کوئی گنجائش باقی نہیں رہتی۔ ¤ ➍ ابو طالب کو رسول اللہ صلی اللہ علیہ وسلم سے بے حد محبت تھی، اس نے ہر طرح سے آپ کی حفاظت اور آپ کا دفاع کیا، مگر اس کی محبت طبعی یعنی قرابت اور نسب کی وجہ سے تھی، ایمانی محبت نہ تھی، اس لیے ہدایت نصیب نہ ہو سکی۔ ¤ ➎ اگرچہ یہ آیت ابوطالب کے بارے میں اتری مگر اصولی طور پر اس کا حکم عام ہے اور اس میں ہر وہ شخص شامل ہے جس کے متعلق رسول اللہ صلی اللہ علیہ وسلم کی خواہش تھی کہ وہ ایمان لے آئے، مگر اس نے کفر پر مرنے کو ترجیح دی۔ مزید دیکھیے سورۂ توبہ (۱۱۳)۔ ¤ ➏ یہاں فرمایا : «{ اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ }» اور دوسری جگہ فرمایا : «{ وَ اِنَّكَ لَتَهْدِيْۤ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ }» [ الشورٰی : ۵۲ ]’’اور بلاشبہ تو یقینا سیدھے راستے کی طرف رہنمائی کرتا ہے۔‘‘ پہلی آیت میں ہدایت سے مراد منزلِ مقصود پر پہنچا دینا ہے۔ یہ صرف اللہ تعالیٰ کا کام ہے، یہ کسی اور کا کام نہیں۔ دوسری آیت میں ہدایت سے مراد راستہ دکھانا ہے، یہ کام رسول اللہ صلی اللہ علیہ وسلم بھی سر انجام دیتے تھے۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) ➊ {وَ قَالُوْۤا اِنْ نَّتَّبِعِ الْهُدٰى مَعَكَ …:} رسول اللہ صلی اللہ علیہ وسلم پر ایمان نہ لانے کا ایک بہانہ اور اس کا جواب اوپر گزر چکا ہے : «{ فَلَمَّا جَآءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوْا لَوْ لَاۤ اُوْتِيَ مِثْلَ مَاۤ اُوْتِيَ مُوْسٰى اَوَ لَمْ يَكْفُرُوْا بِمَاۤ ااُوْتِيَ مُوْسٰى مِنْ قَبْلُ }» [القصص : ۴۸ ] ’’ پھر جب ان کے پاس ہمارے ہاں سے حق آگیا تو انھوں نے کہا اسے اس جیسی چیزیں کیوں نہ دی گئیں جو موسیٰ کو دی گئیں؟ تو کیا انھوں نے اس سے پہلے ان چیزوں کا انکار نہیں کیا جو موسیٰ کو دی گئی تھیں۔‘‘ اب اس آیت میں ان کے ایمان نہ لانے کا ایک اور بہانہ ذکر فرمایا۔ {’’ وَ قَالُوْۤا اِنْ نَّتَّبِعِ الْهُدٰى مَعَكَ … ‘‘} کا عطف گزشتہ آیت (۴۸) {’’ قَالُوْا لَوْ لَاۤ اُوْتِيَ مِثْلَ مَاۤ اُوْتِيَ مُوْسٰى ‘‘} پر ہے، یعنی بعض مشرکین نے یہ کہا کہ ہم جانتے ہیں کہ آپ حق پر ہیں، لیکن ہم ڈرتے ہیں کہ اگر ہم نے آپ کے ہمراہ ہدایت کی پیروی اختیار کر لی اور سارے عرب کی مخالفت مول لے لی تو وہ ہمیں ہماری سر زمین سے اچک لیں گے اور ایسی خاموشی سے یکلخت اٹھا لے جائیں گے کہ کسی کو خبر بھی نہ ہو گی۔ ¤ ➋ { اَوَ لَمْ نُمَكِّنْ لَّهُمْ حَرَمًا اٰمِنًا … :} یہ ان کے عذر کا جواب ہے کہ جب پورے عرب میں ہر طرف بدامنی کا دور دورہ ہے، کسی کی جان محفوظ ہے نہ مال، دن دہاڑے لوگوں کو اٹھا کر لونڈی و غلام بنا لیا جاتا ہے، قبائل غربت و فقر کی وجہ سے ایک دوسرے سے دست و گریبان ہیں، تو کیا اس وقت ہم نے انھیں اس حرم میں جگہ نہیں دی جس کے امن و امان کی یہ حالت ہے کہ اس کے جانوروں تک کو کوئی نہیں ستاتا اور جسے وادی غیر ذی زرع ہونے کے باوجود اس قدر مرکزی حیثیت حاصل ہے کہ دنیا بھر کے پھل اور اموال تجارت اس کی طرف کھچے چلے آرہے ہیں۔ ظاہر ہے کہ اسے یہ حیثیت ہم نے بخشی ہے، تو جب ہم نے کفروشرک کے باوجود انھیں اس قدر امن و امان دیا اور اپنی نعمتوں سے نوازا تو کیا جب وہ ہمارا دین اختیار کریں گے تو ہم انھیں پناہ نہیں دیں گے؟ اور لوگوں کی دست درازی سے ان کی حفاظت نہیں کریں گے۔ نہیں، ایسا ہرگز نہیں ہو گا، لیکن اکثر لوگ نادان ہیں، جانتے نہیں۔ مزید دیکھیے سورۂ عنکبوت (۶۷)۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) ➊ {وَ كَمْ اَهْلَكْنَا مِنْ قَرْيَةٍ …:’’ بَطَرٌ‘‘} کا معنی ہے نعمت پر سرکشی اختیار کررنا، پھول جانا۔ اس کا معنی ناشکری اور انکار بھی آتا ہے۔ پہلا معنی ہو تو یہاں {’’فِيْ‘‘} محذوف ہو گا : {’’أَيْ بَطِرَتْ فِيْ مَعِيْشَتِهَا۔‘‘} حرف جار حذف ہونے سے {’’مَعِيْشَتَهَا‘‘} پر نصب آ گیا۔ جیسا کہ سورۂ اعراف (۱۵۵) میں ہے : « وَ اخْتَارَ مُوْسٰى قَوْمَهٗ سَبْعِيْنَ رَجُلًا » {’’ أَيْ مِنْ قَوْمِهِ ‘‘} ۔ یہ ان کے عذر کا دوسرا جواب ہے، یعنی تم نے گمان کر رکھا ہے کہ ایمان لانے کی صورت میں تم تباہ و برباد ہو جاؤ گے اور ایمان نہ لائے تو تمھاری شان و شوکت، سیادت و عزت، مال و دولت اور اعلیٰ درجے کی ترقی یافتہ معیشت محفوظ رہے گی۔ سو تمھارا یہ گمان غلط ہے، تم سے پہلے کتنی ہی اقوام، جو اپنی معیشت پر اِترا گئی تھیں اور ان کے رہنے والے اپنی خوش حالی اور فارغ البالی کی بدولت بدمست ہو گئے تھے، مثلاً عاد، ثمود، قوم لوط اور قوم شعیب وغیرہ، ہم نے انھیں ایسا ہلاک اور برباد کیا کہ ان کی بستیاں یہ تمھارے سامنے ہیں، ان میں ایسی نحوست ہے کہ ان کے بعد کوئی ان میں آباد ہی نہیں ہوا، مگر بہت کم کہ راہ چلتے ہوئے تھوڑی دیر کے لیے کوئی مسافر اترا اور پھر چل دیا۔ تمھیں ان کے انجام سے عبرت حاصل کرنی چاہیے۔ ¤ ➋ { وَ كُنَّا نَحْنُ الْوٰرِثِيْنَ :} یعنی ان میں سے کوئی باقی ہی نہیں رہا جو ان کے گھروں اور مال و دولت کا وارث بنے، فرمایا : «{ فَهَلْ تَرٰى لَهُمْ مِّنْۢ بَاقِيَةٍ }» [ الحآقۃ : ۸ ] ’’تو کیا تو ان کا کوئی بھی باقی رہنے والا دیکھتا ہے؟‘‘ ان کے وارث ہم بنے اور ہر چیز کے وارث ہمیشہ ہم ہی ہوا کرتے ہیں۔ {’’ كُنَّا ‘‘} میں {’’كَانَ‘‘} استمرار اور ہمیشگی کے لیے ہے۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) ➊ { وَ مَا كَانَ رَبُّكَ مُهْلِكَ الْقُرٰى … :} اس آیت میں اللہ تعالیٰ نے نافرمان بستیوں کو ہلاک کرنے کا اصول بیان فرمایا اور اس سوال کا جواب دیا کہ ان اقوام کی ہلاکت کے بعد کتنی مدت گزری، کفار کا کفرو شرک اور ان کی سرکشی اور ظلم و زیادتی انتہا کو پہنچ چکی، انھیں کیوں ہلاک نہیں کیا گیا؟ فرمایا یہ تیرے رب کی ربوبیت اور اس کی رحمت ہے کہ وہ کبھی بستیوں کو ہلاک نہیں کرتا، جب تک ان کی مرکزی بستی میں کوئی پیغام پہنچانے والا (رسول) نہ بھیجے، جو ان کے سامنے ہماری آیات کی تلاوت کر کے ان کا یہ عذر ختم نہ کر دے کہ ہمیں عذاب سے پہلے آگاہ کیوں نہیں کیا گیا۔ {’’ وَ مَا كَانَ ‘‘} میں نفی کا استمرار ہے، یعنی ایسا کبھی ہوا ہی نہیں، نہ ہونے والا ہے۔ جیسے دیکھیے سورۂ آل عمران (۷۹) اور یونس (۳۶)۔ ¤ ➋ { وَ مَا كُنَّا مُهْلِكِي الْقُرٰۤى … :} یہ اس سوال کا جواب ہے کہ اب رسول اللہ صلی اللہ علیہ وسلم کی آمد کے بعد ایمان نہ لانے والوں پر عذاب کیوں نہیں آتا۔ فرمایا، ہماری یہ بھی عادت ہے کہ ہم بستیوں کو کبھی ہلاک نہیں کرتے، جب تک ان کے رہنے والے ظلم پر اس طرح نہ ڈٹ جائیں کہ ظالم کے لقب کے حق دار بن جائیں۔ اب اس نبی کی آمد پر تمھیں مہلت دی جا رہی ہے کہ تم کفرو شرک اور ظلم پر اصرار کر کے ظاالم ٹھہرتے اور عذاب کے مستحق بنتے ہو یا ایمان لا کر رحمت کے حق دار بنتے ہو۔ ¤ ➌ ابن کثیر نے فرمایا : ’’یہ آیت دلیل ہے کہ نبی صلی اللہ علیہ وسلم جو اُمّ القریٰ (مکہ) میں مبعوث ہوئے، وہ عرب و عجم کی تمام بستیوں کی طرف مبعوث تھے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ وَ كَذٰلِكَ اَوْحَيْنَاۤ اِلَيْكَ قُرْاٰنًا عَرَبِيًّا لِّتُنْذِرَ اُمَّ الْقُرٰى وَ مَنْ حَوْلَهَا }» [ الشورٰی : ۷ ] ’’اور اسی طرح ہم نے تیری طرف عربی قرآن وحی کیا، تاکہ تو بستیوں کے مرکز(مکہ)کو ڈرائے اور ان لوگوں کو بھی جو اس کے ارد گرد ہیں۔‘‘ اور فرمایا : «{ قُلْ يٰۤاَيُّهَا النَّاسُ اِنِّيْ رَسُوْلُ اللّٰهِ اِلَيْكُمْ جَمِيْعًا }» [ الأعراف : ۱۵۸ ] ’’کہہ دے اے لوگو! بے شک میں تم سب کی طرف اللہ کا رسول ہوں۔‘‘ (ابن کثیر) اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھے پانچ چیزیں عطا کی گئیں جو مجھ سے پہلے کسی کو عطا نہیں کی گئیں۔‘‘ ان میں سے ایک یہ بیان فرمائی ـ: [ وَكَانَ النَّبِيُّ يُبْعَثُ إِلٰی قَوْمِهِ خَاصَّةً وَ بُعِثْتُ إِلَی النَّاسِ عَامَّةً ] [بخاري، التیمم، باب : ۳۳۵ ] ’’اور ہر نبی خاص اپنی قوم کی طرف بھیجا جاتا تھا اور مجھے تمام لوگوں کی طرف بھیجا گیا ہے۔‘‘"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) ➊ { وَ مَاۤ اُوْتِيْتُمْ مِّنْ شَيْءٍ فَمَتَاعُ الْحَيٰوةِ الدُّنْيَا … :} یہ کفار مکہ کے شبہے کا تیسرا جواب ہے، کیونکہ ان کے شبہ کا اصل یہ تھا کہ ہم یہ دین اس لیے قبول نہیں کر رہے کہ ہمیں اپنی دنیا کے نقصان کا خطرہ ہے۔ اللہ تعالیٰ نے بیان فرمایا کہ یہ تمھاری بہت بڑی غلطی ہے، کیونکہ دنیا میں تمھیں جو کچھ بھی دے دیا جائے سب دنیا کی زندگی کا تھوڑے سے وقت کے لیے فائدہ اٹھانے کا سامان ہے، جس نے آخر ختم ہونا ہے اور آخرت میں جو کچھ اللہ تعالیٰ کے پاس ہے وہ اس سے کہیں بہتر بھی ہے اور باقی رہنے والا بھی ہے اور کوئی بھی عقل مند بہتر اور باقی کو چھوڑ کر کمتر اور فانی کو ترجیح نہیں دیتا، تو کیا تمھیں عقل نہیں کہ فانی کو ترجیح دے کر ہمیشہ کی زندگی برباد کر رہے ہو۔ ¤ ➋ جو کچھ اللہ کے ہاں ہے اسے بہت بہتر اس لیے فرمایا کہ دنیا کا ساز و سامان اس کے مقابلے میں نہ مقدار میں کچھ حیثیت رکھتا ہے نہ خوبی میں۔ مقدار میں اتنا ہو گا کہ عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ آخِرَ أَهْلِ الْجَنَّةِ دُخُوْلاً الْجَنَّةَ ، وَآخِرَ أَهْلِ  النَّارِ خُرُوْجًا مِنَ النَّارِ رَجُلٌ يَخْرُجُ حَبْوًا فَيَقُوْلُ لَهُ رَبُّهُ ادْخُلِ الْجَنَّةَ فَيَقُوْلُ رَبِّ! الْجَنَّةُ مَلْأَی فَيَقُوْلُ لَهُ ذٰلِكَ ثَلاَثَ مَرَّاتٍ فَكُلُّ ذٰلِكَ يُعِيْدُ عَلَيْهِ الْجَنَّةُ مَلأَی فَيَقُوْلُ إِننَّ لَكَ مِثْلَ الدُّنْيَا عَشْرَ مِرَارٍ ] [ بخاري، التوحید، باب کلام الرب عزوجل یوم القیامۃ… : ۷۵۱۱ ] ’’جنت میں سب سے آخر میں داخل ہونے والا، جو جہنم سے نکلنے والوں میں سب سے آخری ہو گا، گھسٹتا ہوا آگ سے نکلے گا تو اسے اس کا رب فرمائے گا : ’’جنت میں داخل ہو جا۔‘‘ وہ کہے گا : ’’اے میرے رب! جنت بھری ہوئی ہے۔‘‘ اللہ تعالیٰ اسے تین دفعہ فرمائے گا، ہر بار وہ یہی جواب دے گا کہ جنت بھری ہوئی ہے۔ تو اللہ تعالیٰ فرمائے گا : ’’تمھیں دنیا سے دس گنا زیادہ (جنت) عطا کی جاتی ہے۔‘‘ مستورد بن شداد رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَاللّٰهِ! مَا الدُّنْيَا فِي الْآخِرَةِ إِلَّا مِثْلُ مَا يَجْعَلُ أَحَدُكُمْ إِصْبَعَهُ وَ أَشَارَ يَحْيٰی بِالسَّبَّابَةِ هٰذِهِ فِي الْيَمِّ فَلْيَنْظُرْ بِمَ تَرْجِعُ؟ ] [ مسلم، الجنۃ و صفۃ نعیمھا، باب فناء الدنیا و بیان الحشر یوم القیامۃ : ۲۸۵۸ ] ’’اللہ کی قسم! آخرت کے مقابلے میں دنیا اس کے سوا کچھ نہیں جیسے تم میں سے کوئی شخص اپنی یہ (شہادت کی) انگلی سمندر میں ڈالے، پھر دیکھے وہ کتنا پانی لے کر لوٹتی ہے؟‘‘ اور خوبی میں آخرت اس لیے کہیں بہتر ہے کہ اس کی ہر نعمت کسی بھی قسم کے غم یا فکر سے پاک ہے، جب کہ دنیا کی کوئی نعمت ایسی نہیں اور وہ اتنی بہتر ہے کہ کوئی شخص نہ اس کی خوبی بیان کر سکتا ہے، نہ وہ کسی کے تصور میں آ سکتی ہے۔ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، اللہ تعالیٰ فرماتے ہیں : [ أَعْدَدْتُ لِعِبَادِيَ الصَّالِحِيْنَ مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلٰی قَلْبِ بَشَرٍ فَاقْرَؤُوْا إِنْ شِئْتُمْ : «{ فَلَا تَعْللَمُ نَفْسٌ مَّاۤ اُخْفِيَ لَهُمْ مِّنْ قُرَّةِ اَعْيُنٍ }» ] [ السجدۃ : ۱۷] [ بخاري، بدء الخلق، باب ما جاء في صفۃ الجنۃ و أنھا مخلوقۃ : ۳۲۴۴ ] ’’میں نے اپنے صالح بندوں کے لیے وہ کچھ تیار کر رکھا ہے جو نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا اور نہ کسی بشر کے دل میں اس کا خیال تک آیا ہے۔‘‘ اگرچاہو تو یہ آیت پڑھ لو : ’’کوئی جان نہیں جانتی کہ اس کے لیے آنکھوں کی ٹھنڈک کا کیا کچھ سامان چھپا کر رکھا گیا ہے۔‘‘"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) { اَفَمَنْ وَّعَدْنٰهُ وَعْدًا حَسَنًا … :} اس آیت میں مومن و کافر کی زندگیوں کا موازنہ کیا گیا ہے اور سوال کی صورت میں سوچنے کی دعوت دی گئی ہے کہ آیا یہ دونوں زندگیاں کسی صورت برابر ہو سکتی ہیں؟ جب یہ دونوں برابر نہیں ہو سکتیں تو تم دنیا کے فائدے کے لیے رسول کی پیروی کیوں چھوڑتے ہو؟ دنیا کی نعمتیں مومن و کافر دونوں کو ملتی ہیں، مگر مومن اللہ تعالیٰ کے حکم کا پابند رہ کر ان سے فائدہ اٹھاتا ہے، جس کی وجہ سے آخرت کی نعمتیں صرف اس کے لیے خاص ہو جاتی ہیں۔ (دیکھیے اعراف : ۳۲) اور ایمان اور عمل صالح والوں سے اللہ تعالیٰ کا یہی وعدۂ حسنہ ہے، جو ہر حال میں مومن کو مل کر رہے گا، کیونکہ اللہ کا وعدہ کبھی خلاف نہیں ہوتا، جیسا کہ فرمایا : «{ مَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُنْثٰى وَ هُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهٗ حَيٰوةً طَيِّبَةً وَ لَنَجْزِيَنَّهُمْ اَجْرَهُمْ بِاَحْسَنِ مَا كَانُوْا يَعْمَلُوْنَ }» [ النحل : ۹۷ ] ’’جو بھی نیک عمل کرے، مرد ہو یا عورت اور وہ مومن ہو تو یقینا ہم اسے ضرور زندگی بخشیں گے، پاکیزہ زندگی اور یقینا ہم انھیں ان کا اجر ضرور بدلے میں دیں گے، ان بہترین اعمال کے مطابق جو وہ کیا کرتے تھے۔‘‘ اس کے مقابلے میں کافر ہے، مومن کے متعلق جو فرمایا کہ وہ ہمارے اچھے وعدے کو ملنے والا ہے، تو یہ اشارہ ہے کہ کافر کو بھی شیطان اور اس کے بنائے ہوئے شریک وعدے دلاتے رہتے ہیں، مگر ان کے دلائے ہوئے وعدے اسے کبھی حاصل نہیں ہوں گے، جیسا کہ اللہ تعالیٰ نے سورۂ ابراہیم میں ذکر فرمایا ہے کہ قیامت کے دن شیطان کہے گا : «{ اِنَّ اللّٰهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَ وَعَدْتُّكُمْ فَاَخْلَفْتُكُمْ۠ }» [ إبراہیم : ۲۲ ] ’’بے شک اللہ نے تم سے وعدہ کیا، سچا وعدہ اور میں نے تم سے وعدہ کیا تو میں نے تم سے خلاف ورزی کی۔‘‘ کافر کو دنیا کی زندگی کا کچھ سامان دیا گیا، ملنا اسے بھی اتنا ہی ہے جتنا اللہ تعالیٰ نے لکھ دیا ہے، مگر اس نے اللہ تعالیٰ کی فرماں برداری کے بجائے اپنی خواہش نفس کے مطابق اس سے فائدہ اٹھایا، جس کے نتیجے میں وہ ان لوگوں میں شامل ہونے والا ہے جو قیامت کے دن حاضر کیے جانے والے ہیں۔ قرآن کی اصطلاح میں {’’ الْمُحْضَرِيْنَ ‘‘} (حاضر کیے جانے والے) کا لفظ عذاب میں حاضر کیے جانے والوں کے متعلق ہی استعمال ہوا ہے۔ دیکھیے سورۂ صافات (۵۷ اور ۱۲۷) اس لفظ میں بھی یہ مفہوم موجود ہے، کیونکہ حاضر اسی کو کیا جاتا ہے جو حاضر نہ ہونا چاہے، جنت میں تو ہر شخص شوق سے جائے گا۔ ¤ ابن کثیر رحمہ اللہ نے فرمایا : ’’تو کیا وہ شخص جو مومن ہے، اس وعدے کو سچا جاننے والا ہے جو اللہ نے اس کے صالح اعمال پر اس سے ثواب کی صورت میں کیا ہے، جو لا محالہ اسے ملنے والا ہے، اس شخص کی طرح ہو سکتا ہے جو کافر ہے، اللہ کی ملاقات اور اس کے وعدہ و وعید کو جھٹلانے والا ہے۔ سو اسے دنیا کی زندگی میں تھوڑے سے دن کچھ سامان ملنے والا ہے، پھر قیامت کے دن وہ حاضر کیے جانے والوں میں سے ہے۔ مجاہد نے فرمایا، یعنی عذاب دیے جانے والوں میں سے ہے۔‘‘ (ابن کثیر)"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) ➊ { وَ يَوْمَ يُنَادِيْهِمْ … :} یہ آیات بھی مشرکین مکہ ہی سے متعلق ہیں جو دنیوی مفادات کی خاطر شرک اور شرک کے عَلَم برداروں سے چمٹے ہوئے تھے، انھیں ان کے اس عملِ بد کے انجام سے آگاہ کیا جا رہا ہے۔ الفاظ عام ہونے کی وجہ سے ان کا تعلق تمام کفار سے بھی ہے۔ قیامت کے دن اللہ تعالیٰ انھیں آواز دے کر دو سوال کریں گے، دونوں سوالوں سے مقصود پوچھنا نہیں بلکہ انھیں ذلیل کرنا اور ان کے شرکاء کے بے بس اور بے اختیار ہونے کا اظہار ہے۔ ¤ ➋ { فَيَقُوْلُ اَيْنَ شُرَكَآءِيَ الَّذِيْنَ كُنْتُمْ تَزْعُمُوْنَ:} یہ پہلا سوال ہے جو اللہ تعالیٰ مشرکین کو آواز دے کر ان سے کریں گے کہ بتاؤ کہاں ہیں میرے وہ شریک جن کے متعلق تم سمجھ بیٹھے تھے کہ وہ تمھارے نفع یا نقصان کے مالک ہیں اور دنیوی مفادات ان کی بدولت حاصل ہو رہے ہیں، یا وہ تمھیں سفارش کر کے چھڑوا لیں گے؟ دیکھیے سورۂ انعام (۹۴)۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) ➊ {قَالَ الَّذِيْنَ حَقَّ عَلَيْهِمُ الْقَوْلُ:} ’’بات ثابت ہو چکی‘‘ سے مراد ہے ’’عذاب کی بات ثابت ہو چکی‘‘ جیسا کہ فرمایا : «{ وَ لٰكِنْ حَقَّ الْقَوْلُ مِنِّيْ لَاَمْلَـَٔنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَ النَّاسِ اَجْمَعِيْنَ }» [ السجدۃ : ۱۳ ] ’’اور لیکن میری طرف سے بات پکی ہو چکی کہ یقینا میں جہنم کو جنوں اور انسانوں، سب سے ضرور بھروں گا۔‘‘ اور ’’جن پر عذاب کی بات ثابت ہو چکی‘‘ سے مراد شیاطین یا وہ بڑے بڑے پیشوا، سردار، لیڈر اور پیرفقیر قسم کے لوگ ہیں جن کو لوگوں نے دنیا میں {’’ اَرْبَابًا مِنْ دُوْنِ اللّٰهِ‘‘} بنا لیا تھا اور جن کی بات کے مقابلے میں وہ اللہ اور اس کے رسولوں کی بات کو رد کر دیا کرتے تھے۔ وہ کسی چیز کو حلال کہہ دیتے تو حلال سمجھتے، حرام کہہ دیتے تو حرام سمجھتے، یہ ان کو اللہ کے سوا رب اور اللہ کے شریک بنانا تھا۔ جن پیشواؤں نے لوگوں کو اپنی بندگی پر لگایا تھا اور جن پر عذاب کا فیصلہ ہو چکا ہو گا وہ کہیں گے اے ہمارے رب ! …۔ ¤ ➋ {رَبَّنَا هٰۤؤُلَآءِ الَّذِيْنَ اَغْوَيْنَا …:} یعنی جنھیں اللہ کے شریک بنایا گیا تھا، وہ کہیں گے، اے ہمارے رب! یہ ہیں وہ لوگ جنھیں ہم نے گمراہ کیا۔ ہم نے انھیں ویسے ہی گمراہ کیا جیسے ہم خود گمراہ ہوئے، یعنی گمراہی کی دعوت دینے والوں کی دعوت پر جس طرح ہم اپنی مرضی سے گمراہ ہوئے اسی طرح ہم نے ان کے سامنے گمراہی پیش کی تو یہ اپنی مرضی سے گمراہ ہوئے، نہ ہم پر کسی نے جبر کیا تھا اور نہ ہم نے ان پر کوئی زبردستی کی۔ ¤ ➌ { تَبَرَّاْنَاۤ اِلَيْكَ:} ہم ان کی گمراہی کی ذمہ داری سے بری ہیں۔ اللہ کے سوا جن کی بھی عبادت کی گئی، وہ نیک تھے یا بد، قیامت کے دن اپنی عبادت کرنے والوں سے بری ہو جائیں گے، بلکہ ان کے دشمن ہوں گے۔ دیکھیے سورۂ مریم (۸۱، ۸۲)، احقاف (۵، ۶)، عنکبوت (۲۵) اور سورۂ بقرہ (۱۶۶، ۱۶۷)۔ ¤ ➍ { مَا كَانُوْۤا اِيَّانَا يَعْبُدُوْنَ :} کیونکہ اللہ کے سوا کسی بھی شریک کی پیروی کرنے والے یا اسے پکارنے والے درحقیقت نہ کسی موجود چیز کو پپکار رہے ہیں، نہ اس کی پیروی کر رہے ہیں، کیونکہ اللہ کے کسی شریک کا وجود ہے ہی نہیں، وہ محض اپنے خیال اور گمان کی پیروی کر رہے ہیں، جیسا کہ فرمایا : «{ اَلَاۤ اِنَّ لِلّٰهِ مَنْ فِي السَّمٰوٰتِ وَ مَنْ فِي الْي الْاَرْضِ وَ مَا يَتَّبِعُ الَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ شُرَكَآءَ اِنْ يَّتَّبِعُوْنَ اِلَّا الظَّنَّ وَ اِنْ هُمْ اِلَّا يَخْرُصُوْنَ } » [ یونس : ۶۶ ] ’’سن لو! بے شک اللہ ہی کے لیے ہے جو کوئی آسمانوں میں ہے اور جو کوئی زمین میں ہے اور جو لوگ اللہ کے غیر کو پکارتے ہیں وہ کسی بھی قسم کے شریکوں کی پیروی نہیں کر رہے۔ وہ پیروی نہیں کرتے مگر گمان کی اور وہ اس کے سوا کچھ نہیں کہ اٹکلیں دوڑاتے ہیں۔‘‘ اس لیے جنھیں شریک بنایا گیا تھا وہ صاف کہہ دیں گے کہ یہ ہماری پرستش نہیں کرتے تھے، بلکہ محض اپنے گمان کی پرستش کیا کرتے تھے اور ہمارے بندے نہیں بلکہ اپنے نفس کے بندے بنے ہوئے تھے۔ ¤ ➎ اس آیت میں یہ بات قابل غور ہے کہ سوال تو ان لوگوں سے ہو گا جنھوں نے شریک بنائے تھے، مگر بول وہ اٹھیں گے جنھیں شریک بنایا گیا تھا۔ وجہ اس کی یہ ہے کہ جب عام مشرکین سے سوال ہو گا تو پیشوا اور سردار سمجھ لیں گے کہ اب ہماری شامت آنے والی ہے، ہمارے یہ مرید اور پیروکار ضرور اپنی گمراہی کا ذمہ دار ہمیں ٹھہرائیں گے، اس لیے وہ پہلے ہی اپنی صفائی پیش کرنے لگیں گے۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) {وَ قِيْلَ ادْعُوْا شُرَكَآءَكُمْ … :} یعنی پہلے ان سے کہا جائے گا کہ میرے وہ شریک کہاں ہیں جو تم گمان کرتے تھے؟ ابھی وہ اس کا کوئی جواب نہیں دے پائے ہوں گے کہ ان سے کہا جائے گا کہ اپنے شریکوں کو مدد کے لیے بلاؤ۔ وہ انھیں پکاریں گے تو وہ انھیں جواب نہیں دیں گے۔ اس وقت مایوس ہو کر تمنا کریں گے، کاش! وہ دنیا میں ہدایت قبول کرتے ہوتے۔ بعض مفسرین نے اس کا مطلب یہ بیان فرمایا کہ شیاطین اور مشرکین جب اپنے شریکوں کے طور پر اللہ کے نیک بندوں کا نام لیں گے تو ان سے کہا جائے گا کہ اپنے شریکوں کو پکارو، وہ کچھ جواب نہ دیں گے، کیونکہ وہ ان کی مشرکانہ حرکتوں سے واقف تھے نہ ہی ان پر خوش تھے۔ عین اس وقت اللہ تعالیٰ کی طرف سے جہنم سامنے لا کر کھڑی کر دی جائے گی، تو انھیں یقین ہو جائے گا کہ ہم اس میں گرائے جانے والے ہیں۔ دیکھیے سورۂ کہف (۵۲، ۵۳)۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) {وَ يَوْمَ يُنَادِيْهِمْ فَيَقُوْلُ مَا ذَاۤ اَجَبْتُمُ الْمُرْسَلِيْنَ :} یہ دوسرا سسوال ہے جو نبوت کے متعلق ہے کہ جب میرے رسولوں نے تمھیں میرا پیغام پہنچایا اور اس پر چلنے کی ہدایت کی تو تم نے انھیں کیا جواب دیا۔ پہلا سوال توحید کے متعلق تھا، یہی دو سوال قبر میں ہوں گے، یعنی ’’{مَنْ رَبُّكَ} ؟‘‘ ’’تیرا رب کون ہے؟‘‘ اور ’’{مَنْ نَبِيُّكَ}؟‘‘ تیرا نبی کون ہے؟‘‘ اور تیسرا سوال یہ کہ’’{مَا دِيْنُكَ}؟‘‘ ’’تیرا دین کیا ہے؟‘‘ مومن کا جواب ہو گا : {’’ رَبِّيَ اللّٰهُ وَ نَبِيِّيْ مُحَمَّدٌ صَلَّي اللّٰهُ عَلَيلَيْهِ وَسَلَّمَ وَ دِيْنِيَ الْإِسْلَامُ‘‘} ’’میرا رب اللہ ہے، میر انبی محمد صلی اللہ علیہ وسلم ہے اور میرا دین اسلام ہے۔‘‘ [ دیکھیے مسند البزار : ۱۷ /۱۵۴، ح : ۹۷۶۰۔ سلسلۃ الأحادیث الصحیحۃ : 127/6، ح : ۲۶۲۸ ]"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) ➊ { فَعَمِيَتْ عَلَيْهِمُ الْاَنْۢبَآءُ يَوْمَىِٕذٍ …:’’عَمِيَ يَعْمٰي عَمًي‘‘} (ع) کا معنی اندھا ہونا ہے۔ کہنا یہ تھا کہ {’’فَعَمُوْا عَنِ الْأَنْبَاءِ يَوْمَئِذٍ ‘‘} کہ ’’وہ اس دن خبروں سے اندھے ہو جائیں گے۔‘‘ مبالغے کے لیے الٹ فرمایا کہ اس دن ان پر تمام خبریں تاریک ہو جائیں گی، یعنی یہ بات ان کی سمجھ ہی میں نہیں آئے گی کہ وہ اس سوال کا کیا جواب دیں، نہ ہی یہ ہو سکے گا کہ ایک دوسرے سے پوچھ کر اس سوال کا جواب دے دیں۔ اس وقت کی دہشت ہی اتنی زیادہ ہو گی کہ وہ ایک دوسرے سے کوئی بات پوچھ ہی نہیں سکیں گے۔ ¤ ➋ اس سوال سے پہلے قبر میں منکر نکیر کے سوالات کے جواب میں بھی کافر اور منافق یہی کہیں گے : [ هَاهْ هَاهْ لَا أَدْرِيْ ] ’’ہائے ہائے، میں نہیں جانتا۔‘‘ [ دیکھیے أبوداوٗد، السنۃ، باب المسألۃ في القبر… : ۴۷۵۳، عن البراء بن عازب رضی اللہ عنہ ، و صححہ الألباني ] یہ بھی خبروں کے تاریک ہو جانے ہی کا نتیجہ ہو گا۔ ¤ ➌ یہاں فرمایا : «{ فَهُمْ لَا يَتَسَآءَلُوْنَ}» ’’وہ ایک دوسرے سے (بھی) نہیں پوچھیں گے۔‘‘ دوسری جگہ فرمایا : «{ وَ اَقْبَلَ بَعْضُهُمْ عَلٰى بَعْضٍ يَّتَسَآءَلُوْنَ }» [ الصافات : ۲۷ ] ’’اور ان کے بعض بعض کی طرف متوجہ ہوں گے، ایک دوسرے سے سوال کریں گے۔‘‘ اسی طرح یہاں فرمایا : ’’وہ کچھ جواب نہ دیں سکیں گے۔‘‘ دوسری جگہ فرمایا، وہ کہیں گے : «{ وَ اللّٰهِ رَبِّنَا مَا كُنَّا مُشْرِكِيْنَ }» [ الأنعام : ۲۳ ] ’’اللہ کی قسم! جو ہمارا رب ہے، ہم شریک بنانے والے نہ تھے۔‘‘ اس ظاہری اختلاف کی حقیقت یہ ہے کہ قیامت کا دن بہت لمبا ہے۔ اس میں کفار پر کئی مرحلے آئیں گے، جن میں کبھی وہ خاموش رہیں گے، کبھی جرم سے انکار کریں گے، کبھی اقرار کریں گے اور کہیں گے ہم پر ہماری بدبختی غالب آگئی۔ کبھی ایک دوسرے سے سوال کریں گے اور کبھی ایک دوسرے سے سوال نہیں کر سکیں گے، اس لیے مقامات مختلف ہونے کی وجہ سے ان آیات میں کوئی حقیقی اختلاف نہیں ہے۔ مزید دیکھیے سورۂ انعام (۲۲، ۲۳)۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) ➊ { فَاَمَّا مَنْ تَابَ وَ اٰمَنَ …:} قرآن مجید میں کافر و مومن اور عذاب و ثواب دونوں کے بیان کا سلسلہ ساتھ ساتھ چلتا ہے۔ یہاں کفر پر مرنے والوں کے ذکر کے بعد توبہ کر کے ایمان اور عمل صالح والوں کا ذکر فرمایا کہ امید ہے کہ یہ لوگ فلاح پانے والوں سے ہوں گے۔ ¤ ➋ یہاں مشہور سوال ہے کہ توبہ، ایمان اور عمل صالح والوں کے لیے فلاح کا وعدہ موجود ہے، جیسا کہ سورۂ بقرہ کے شروع میں مومنوں کی چند صفات ذکر کرنے کے بعد فرمایا : «{ اُولٰٓىِٕكَ عَلٰى هُدًى مِّنْ رَّبِّهِمْ وَ اُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ }» [البقرۃ : ۵ ] ’’یہ لوگ اپنے رب کی طرف سے بڑی ہدایت پر ہیں اور یہی لوگ پورے کامیاب ہیں۔‘‘ پھر یقین کے بجائے {’’ فَعَسٰۤى ‘‘} (سو امید ہے) کا کیا مطلب ہے؟ اس کے دو جواب ہیں، ایک یہ کہ یہ شاہانہ اندازِ بیان ہے۔ عام بادشاہ کسی چیز کی امید دلا دیں تو اسے پورا کرتے ہیں، تو شاہوں کا شاہ ملک الملوک امید دلائے تو کیسے ہو سکتا ہے کہ پوری نہ کرے، یہ اس کی شان ہی کے خلاف ہے۔ دوسرا جواب یہ ہے کہ یہ {’’ فَعَسٰۤى ‘‘} (سو امید ہے) اس توبہ، ایمان اور عمل صالح والے شخص کے اعتبار سے ہے کہ اسے یہ امید رکھنی چاہیے، کیونکہ یقین تو تب ہو جب اسے قبولیت کی سند مل جائے۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) ➊ { وَ رَبُّكَ يَخْلُقُ مَا يَشَآءُ وَ يَخْتَارُ :} قیامت کے دن مشرکین کی رسوائی اور ان کے شرکاء کی بے بسی کے اظہار کے بعد اللہ تعالیٰ کی توحید کا اور اس کے چند دلائل کا ذکر فرمایا۔ چنانچہ فرمایا : ’’تیرا رب جو چاہتا ہے پیدا کرتا ہے اور جس چیز کو یا جس شخص کو چاہتا ہے چن لیتا ہے۔‘‘ ظاہر ہے جس نے پیدا کیا وہی چنے گا۔ جس کا پیدا کرنے میں کوئی حصہ ہی نہیں، کسی چیز یا شخص کے انتخاب میں اس کا کیا دخل ہو سکتا ہے۔ پھر کسی چیز یا شخص کو چننا صرف اسی کی مشیت پر موقوف ہے، نہ اس میں کسی کا مشورہ چلتا ہے، نہ کسی چیز یا شخص کی خوبی کی وجہ سے اسے چننا اس پر لازم ہے، کیونکہ : «{ لَا يُسْـَٔلُ عَمَّا يَفْعَلُ وَ هُمْ يُسْـَٔلُوْنَ }» [ الأنبیاء : ۲۳ ] ’’اس سے نہیں پوچھا جاتا اس کے متعلق جو وہ کرے اور ان سے پوچھا جاتا ہے۔‘‘ اس نے چاہا تو عرش کو برتری بخشی، کعبہ کو قبلہ بنایا، انبیاء کو نبوت بخشی، محمد صلی اللہ علیہ وسلم کو سید ولد آدم بنایا، مہاجرین و انصار کو محمد صلی اللہ علیہ وسلم کی صحبت کے لیے چنا، خلفائے اربعہ کو تمام صحابہ پر برتری بخشی، کوئی کہہ نہیں سکتا کہ نبوت فلاں کو کیوں نہیں ملی، جیسے کفار نے کہا تھا : «{لَوْ لَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيْمٍ }» [ الزخرف : ۳۱ ] ’’یہ قرآن ان دو بستیوں (مکہ اور طائف) میں سے کسی بڑے آدمی پر کیوں نازل نہیں کیا گیا؟‘‘ جواب میں فرمایا : «{ اَهُمْ يَقْسِمُوْنَ رَحْمَتَ رَبِّكَ }» [ الزخرف : ۳۲ ] ’’کیا تیرے رب کی رحمت وہ تقسیم کرتے ہیں۔‘‘ ¤ ➋ { مَا كَانَ لَهُمُ الْخِيَرَةُ :} بندوں کے پاس یہ اختیار کبھی بھی نہ تھا، نہ ہے کہ وہ اپنی مرضی سے جسے چاہیں چن لیں، ({كَانَ} میں نفی کا استمرار ہے) پھر ان مشرکین کو یہ اختیار کہاں سے مل گیا کہ رب تعالیٰ کے بندوں کو رب تعالیٰ کے اختیارات کا مالک بنا دیں، جو اس نے کسی کو دیے ہی نہیں، نہ ان اختیارات کا مالک اس کے سوا کوئی ہو سکتا ہے۔ آخر انھیں کس نے یہ اختیار دیا کہ اس کے بندوں میں سے جسے چاہیں مشکل کُشا بنا لیں، جسے چاہیں داتا (رزاق)، گنج بخش، فریاد رس یا دستگیر قرار دے دیں۔ اولاد، رزق، فتح و شکست، عزت و ذلت، شفا و مرض، زندگی اور موت کے محکمے، جو اس نے کسی کو دیے ہی نہیں، اپنے بنائے ہوئے شریکوں میں تقسیم کرتے پھریں۔ ¤ ➌ اس آیت سے یہ بھی معلوم ہوا کہ بعض لوگ جو کہتے ہیں کہ انبیاء یا اولیاء کو یہاں تک اختیار حاصل ہو جاتا ہے کہ وہ کمان سے نکلا ہوا تیر بھی واپس لے آتے ہیں اور تقدیر کا لکھا تک مٹا دیتے ہیں، یا بدل دیتے ہیں، جسے چاہتے ہیں نواز دیتے ہیں، جسے چاہتے ہیں راندۂ درگاہ بنا دیتے ہیں، یہ سب کفریہ باتیں ہیں۔ اللہ تعالیٰ کے سوا نہ کسی کے پاس یہ اختیار ذاتی طور پر ہے، نہ اللہ تعالیٰ نے کسی کو یہ اختیار دیا ہے، فرمایا : «{ مَا كَانَ لَهُمُ الْخِيَرَةُ }» ’’ان کے لیے کبھی بھی اختیار نہیں۔‘‘ ¤ ➍ { سُبْحٰنَ اللّٰهِ وَ تَعٰلٰى عَمَّا يُشْرِكُوْنَ :} یعنی اللہ تعالیٰ کے ساتھ کسی اور کے پاس اختیار ہونا اللہ تعالیٰ کی ذات کے لیے عیب ہے کہ وہ اکیلا سب کچھ کرنے پر قادر نہیں اور اس کی شان کو گرا دینے والی بات ہے، اس لیے فرمایا : ’’اللہ پاک ہے اور بہت بلند ہے اس سے جو وہ شریک بناتے ہیں۔‘‘ {’’عَلَا يَعْلُوْ عُلْوًا‘‘} (بلند ہونا) اور {’’تَعَالٰي يَتَعَالٰي تَعَالِيًا‘‘} (بہت بلند ہونا)۔ معلوم ہوا کہ اس کارخانۂ قدرت میں کسی بندے کو، چاہے وہ ولی یا پیغمبر ہی کیوں نہ ہو، کوئی اختیار نہیں ہے۔ تمام اختیارات صرف اللہ تعالیٰ کے ہاتھ میں ہیں۔ {’’ سُبْحٰنَ اللّٰهِ وَ تَعٰلٰى عَمَّا يُشْرِكُوْنَ ‘‘} کے الفاظ اکٹھے قرآن میں صرف اسی ایک مقام پر آئے ہیں۔ ¤ ➎ دنیا میں بندے کو عمل کرنے یا نہ کرنے کا جو اختیار دیا گیا ہے، جس پر اسے ثواب یا عذاب ہو گا، اس کے اوپربھی اللہ تعالیٰ ہی کا اختیار ہے۔ اس لیے یہ کہنا حق ہے کہ مخلوق کو کوئی اختیار نہیں۔ قرآن و حدیث کے مطابق یہ دو باتیں ماننا ضروری ہیں، ایک یہ کہ بندے کو اسباب کے تحت بعض اشیاء میں اختیار دیا گیا ہے، چاہے تو کفر کا راستہ اختیار کرے اور چاہے تو شکر کا۔ وہ مجبور محض نہیں کہ کسی عمل میں اسے کسی طرح کا اختیار بھی نہ ہو، جیسا کہ فرمایا : «{ اِنَّا هَدَيْنٰهُ السَّبِيْلَ اِمَّا شَاكِرًا وَّ اِمَّا كَفُوْرًا }» [الدھر : ۳ ] ’’بلاشبہ ہم نے اسے راستہ دکھایا، خواہ وہ شکر کرنے والا بنے اور خواہ ناشکرا۔‘‘ دوسری بات یہ کہ بندے کو یہ اختیار بھی اللہ تعالیٰ کے اختیار کے تحت ہے، وہ نہ چاہے تو بندہ نہ کوئی ارادہ کر سکتا ہے نہ عمل۔ جیسا کہ سورۂ دہر میں فرمایا : «{ وَ مَا تَشَآءُوْنَ اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ اِنَّ اللّٰهَ كَانَ عَلِيْمًا حَكِيْمًا }» [الدھر : ۳۰ ] ’’اور تم نہیں چاہتے مگر یہ کہ اللہ چاہے، یقینا اللہ ہمیشہ سے سب کچھ جاننے والا، کمال حکمت والا ہے۔‘‘ یہ اللہ کی تقدیر ہے، جس پر ایمان رکھنا لازم ہے، جو اس پر ایمان نہ رکھے مومن نہیں۔ رہی یہ بات کہ ایسا کیوں ہے؟ تو اس کا جواب یہ ہے کہ وہ مالک ہے جو چاہے کرے، نہ کسی کو اس سے پوچھنے کا حق ہے نہ اختیار، جیسا کہ فرمایا : «{ لَا يُسْـَٔلُ عَمَّا يَفْعَلُ وَ هُمْ يُسْـَٔلُوْنَ }» [ الأنبیاء : ۲۳ ] ’’اس سے نہیں پوچھا جاتا اس کے متعلق جو وہ کرے اور ان سے پوچھاجاتا ہے۔‘‘ مگر یہ بات یقینی ہے کہ اس کا ہر کام علم و حکمت پر مبنی ہے۔ مخلوق کو اس کے علم اور حکمت تک رسائی نہ ہے نہ ہو سکتی ہے، اس لیے اسے اپنی اوقات میں رہنا لازم ہے۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) {وَ رَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُوْرُهُمْ …: ’’أَكَنَّ يُكِنُّ إِكْنَانًا‘‘} چھپانا۔ پچھلی آیت میں مذکور اختیار اور قدرت علم کے بغیر ممکن ہی نہیں، اس لیے فرمایا : ’’تیرا رب جانتا ہے جو ان کے سینے چھپاتے ہیں اور جو کچھ وہ ظاہر کرتے ہیں۔‘‘ یعنی قدرت و اختیار کا مالک بھی وہی ہے اور پوشیدہ اور ظاہر کا علم بھی اسی کے پاس ہے۔ یہاں ایک سوال ہے کہ سینوں کی چھپی ہوئی بات جاننا تو واقعی اللہ تعالیٰ کا خاصہ ہے، مخلوق کو اس کی خبر نہیں ہو سکتی، مگر جو کچھ لوگ علانیہ کرتے یا کہتے ہیں اسے جاننا تو آدمی کے لیے بھی کچھ مشکل نہیں۔ جواب اس کا یہ ہے کہ سینوں کی چھپی ہوئی بات تو پھر بھی بعض اوقات کسی اشارے کنائے سے کچھ نہ کچھ معلوم ہو جاتی ہے، مگر ایک ہی وقت میں سب لوگ جو کر رہے ہیں یا کہہ رہے ہیں، اسے رب العالمین کے سوا کوئی نہیں جان سکتا۔ اگر کوئی سنے گا تو اسے ایک شور کے سوا کچھ حاصل نہیں ہو گا۔ دوسری جگہ فرمایا : «{ سَوَآءٌ مِّنْكُمْ مَّنْ اَسَرَّ الْقَوْلَ وَ مَنْ جَهَرَ بِهٖ وَ مَنْ هُوَ مُسْتَخْففٍۭ بِالَّيْلِ وَ سَارِبٌۢ بِالنَّهَارِ }» [ الرعد : ۱۰ ] ’’برابر ہے تم میں سے جو بات چھپا کر کرے اور جو اسے بلند آواز سے کرے اور وہ جو رات کو بالکل چھپا ہوا ہے اور (جو) دن کو ظاہر پھرنے والا ہے۔‘‘"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) ➊ { وَ هُوَ اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ :} اور وہ جس نے جو چاہا پیدا کیا اور پیدا کرتا ہے اور جو چاہے اختیا رکرتا ہے، جو سینوں کی چھپائی ہوئی باتوں کو اور علانیہ کیے جانے والے کاموں کو جانتا ہے وہی اللہ ہے، اس کے سوا کوئی عبادت کے لائق نہیں۔ کیونکہ یہ صفات کسی اور میں ہیں ہی نہیں، پھر کوئی اس کا شریک کیسے بن گیا؟! ¤ ➋ { لَهُ الْحَمْدُ فِي الْاُوْلٰى وَ الْاٰخِرَةِ :} دنیا اور آخرت میں تعریف جو بھی ہے اور جس کی بھی ہے سب اس اکیلے کی ہے، کیونکہ جو تعریف ہو گی کسی نہ کسی خوبی پر ہو گی اور خوبی جو بھی ہے اور جس میں ہے سب اس کی عطا کر دہ ہے۔ سو تعریف جس کی بھی کی جائے اصل میں اسی کی ہو گی۔ اس کے علاوہ دنیا اور آخرت میں اس نے جو کچھ کیا یا کر رہا ہے یا کرے گا سب محمود ہی محمود ہے۔ اس کی بات یا اس کا کام ایک بھی ایسا نہیں جس کی مذمت کی جا سکے۔ اس لیے مومن دنیا میں بھی اسی کی حمد کرتے ہیں۔ اور آخرت میں بھی اسی کی حمد کریں گے۔ دیکھیے سورۂ زمر (۷۴، ۷۵)۔ ¤ ➌ { وَ لَهُ الْحُكْمُ :} حکم کی دو قسمیں ہیں، ایک تکوینی حکم اور ایک تشریعی۔ تکوینی حکم کا مطلب {’’كُنْ‘‘} کہنا ہے، جیسا کہ فرمایا : «{اِنَّمَا اَمْرُهٗۤ اِذَاۤ اَرَادَ شَيْـًٔا اَنْ يَّقُوْلَ لَهٗ كُنْ فَيَكُوْنُ }» [ یٰس : ۸۲ ] ’’اس کا حکم تو، جب وہ کسی چیز کا ارادہ کرتا ہے، اس کے سوا نہیں ہوتا کہ اسے کہتا ہے ’’ہو جا‘‘ تو وہ ہو جاتی ہے۔‘‘ یہ حکم صرف اس کا ہے، کسی اور میں یہ قدرت ہے نہ اختیار، فرمایا : «{ وَ اللّٰهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهٖ وَ هُوَ سَرِيْعُ الْحِسَابِ }» [ الرعد : ۴۱ ] ’’اور اللہ فیصلہ فرماتا ہے، اس کے فیصلے پر کوئی نظر ثانی کرنے والا نہیں اور وہ جلد حساب لینے والا ہے۔‘‘ دوسرا حکم تشریعی ہے، یعنی اس نے اپنے بندوں کو جو کچھ کرنے یا نہ کرنے کا حکم دیا ہے یہ بھی صرف اس کا حق ہے، کسی دوسرے کو یہ حق دینا اسے اللہ کا شریک بنانا ہے، جیسا کہ فرمایا : «{ اَمْ لَهُمْ شُرَكٰٓؤُا شَرَعُوْا لَهُمْ مِّنَ الدِّيْنِ مَا لَمْ يَاْذَنْۢ ببِهِ اللّٰهُ }» [ الشورٰی : ۲۱ ] ’’ یا ان کے لیے کچھ ایسے شریک ہیں جنھوں نے ان کے لیے دین کا وہ طریقہ مقرر کیا ہے جس کی اللہ نے اجازت نہیں دی۔‘‘ ¤ ➍ {وَ اِلَيْهِ تُرْجَعُوْنَ :} یعنی مرنے کے بعد تم اپنے بنائے ہوئے کسی مشکل کشا، حاجت روا، داتا، دستگیر، گنج بخش یا غریب نواز کی طرف نہیں بلکہ اس اکیلے کی طرف لوٹائے جاؤ گے اور وہی تمھارا حساب کر کے نیک کو نیکی کا اور بد کو بدی کا بدلا دے گا، اس لیے اس کے ساتھ کسی کو شریک بنا کر اپنی جان پر ظلم مت کرو۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 72،71) ➊ {قُلْ اَرَءَيْتُمْ اِنْ جَعَلَ اللّٰهُ عَلَيْكُمُ الَّيْلَ …:’’ اَرَءَيْتُمْ ‘‘} کا لفظی معنی ہے ’’کیا تم نے دیکھا۔‘‘ عرب اسے {’’أَخْبِرُوْنِيْ‘‘} (مجھے بتاؤ) کے معنی میں استعمال کرتے ہیں، یعنی تم نے دیکھا ہے تو بتاؤ۔ اللہ تعالیٰ کی توحید کی ایک اور دلیل اور اس کی نعمتوں میں سے ایک اور نعمت، جس پر وہ حمد کا مستحق ہے، رات دن کا بدلنا ہے، جیسا کہ فرمایا : «{ اِنَّ فِيْ خَلْقِ السَّمٰوٰتِ وَ الْاَرْضِ وَ اخْتِلَافِ الَّيْلِ وَ النَّهَارِ لَاٰيٰتٍ لِّاُولِي الْاَلْبَابِ }» [ آل عمران : ۱۹۰ ] ’’بے شک آسمانوں اور زمین کے پیدا کرنے اور رات اور دن کے بدلنے میں عقلوں والوں کے لیے یقینا بہت سی نشانیاں ہیں۔‘‘ فرمایا : ’’یہ بتاؤ کہ اگر اللہ تعالیٰ تم پر قیامت کے دن تک ہمیشہ رات کر دے تو اللہ کے سوا کون سا معبود ہے جو تمھارے پاس کوئی روشنی لے آئے، خواہ کسی قسم کی ہو یا کتنی معمولی ہو۔‘‘ ({بِضِيَآءٍ} کی تنوین تنکیر و تقلیل کے لیے ہے) یہاں اللہ تعالیٰ نے {’’ اَفَلَا تَسْمَعُوْنَ ‘‘} (تو کیا تم سنتے نہیں) ذکر فرمایا، جب کہ اگلی آیت میں {’’ اَفَلَا تُبْصِرُوْنَ ‘‘} (تو کیا تم نہیں دیکھتے) فرمایا۔ ابن ہبیرہ نے فرمایا : ’’اس کی حکمت یہ ہے کہ سمع کی سلطنت رات کو ہوتی ہے اور بصر کی دن کو (رات کی تاریکی میں کان سنتے ہیں، آنکھ نہیں دیکھتی اور دن کی روشنی کے ذریعے سے آنکھ دیکھتی ہے، کان نہیں سنتے)۔‘‘ (بقاعی) یعنی رات کی اس تاریکی میں، جو ہمیشہ کے لیے قیامت تک مسلط ہو، یہ بات تمھارے کان سن سکتے ہیں کہ اللہ کے سوا کون سا معبود ہے جو تمھارے پاس کسی بھی طرح کی تھوڑی سے تھوڑی روشنی ہی لے آئے؟ تو کیا تم سنتے نہیں کہ سن کر سمجھو اور سمجھ کر اللہ کی توحید پر ایمان لے آؤ۔ اسی طرح اگر اللہ تعالیٰ تم پر قیامت کے دن تک ہمیشہ کے لیے دن کر دے تو اللہ کے سوا کون سا معبود ہے جو تمھارے پاس کوئی رات لے آئے جس میں تم راحت اور سکون پاسکو۔ ¤ ➋ ان آیات میں رات کا ذکر دن سے پہلے فرمایا، کیونکہ رات کے بعد دن آنے کی نعمت بہت بڑی نعمت ہے۔ انسان کی معیشت کا سارا سلسلہ اسی پر موقوف ہے۔ علاوہ ازیں رات ایک طرح کا عدم ہے اور ضیاء وجود اور ظاہر ہے کہ عدم وجود سے پہلے ہے۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72،71) ➊ {قُلْ اَرَءَيْتُمْ اِنْ جَعَلَ اللّٰهُ عَلَيْكُمُ الَّيْلَ …:’’ اَرَءَيْتُمْ ‘‘} کا لفظی معنی ہے ’’کیا تم نے دیکھا۔‘‘ عرب اسے {’’أَخْبِرُوْنِيْ‘‘} (مجھے بتاؤ) کے معنی میں استعمال کرتے ہیں، یعنی تم نے دیکھا ہے تو بتاؤ۔ اللہ تعالیٰ کی توحید کی ایک اور دلیل اور اس کی نعمتوں میں سے ایک اور نعمت، جس پر وہ حمد کا مستحق ہے، رات دن کا بدلنا ہے، جیسا کہ فرمایا : «{ اِنَّ فِيْ خَلْقِ السَّمٰوٰتِ وَ الْاَرْضِ وَ اخْتِلَافِ الَّيْلِ وَ النَّهَارِ لَاٰيٰتٍ لِّاُولِي الْاَلْبَابِ }» [ آل عمران : ۱۹۰ ] ’’بے شک آسمانوں اور زمین کے پیدا کرنے اور رات اور دن کے بدلنے میں عقلوں والوں کے لیے یقینا بہت سی نشانیاں ہیں۔‘‘ فرمایا : ’’یہ بتاؤ کہ اگر اللہ تعالیٰ تم پر قیامت کے دن تک ہمیشہ رات کر دے تو اللہ کے سوا کون سا معبود ہے جو تمھارے پاس کوئی روشنی لے آئے، خواہ کسی قسم کی ہو یا کتنی معمولی ہو۔‘‘ ({بِضِيَآءٍ} کی تنوین تنکیر و تقلیل کے لیے ہے) یہاں اللہ تعالیٰ نے {’’ اَفَلَا تَسْمَعُوْنَ ‘‘} (تو کیا تم سنتے نہیں) ذکر فرمایا، جب کہ اگلی آیت میں {’’ اَفَلَا تُبْصِرُوْنَ ‘‘} (تو کیا تم نہیں دیکھتے) فرمایا۔ ابن ہبیرہ نے فرمایا : ’’اس کی حکمت یہ ہے کہ سمع کی سلطنت رات کو ہوتی ہے اور بصر کی دن کو (رات کی تاریکی میں کان سنتے ہیں، آنکھ نہیں دیکھتی اور دن کی روشنی کے ذریعے سے آنکھ دیکھتی ہے، کان نہیں سنتے)۔‘‘ (بقاعی) یعنی رات کی اس تاریکی میں، جو ہمیشہ کے لیے قیامت تک مسلط ہو، یہ بات تمھارے کان سن سکتے ہیں کہ اللہ کے سوا کون سا معبود ہے جو تمھارے پاس کسی بھی طرح کی تھوڑی سے تھوڑی روشنی ہی لے آئے؟ تو کیا تم سنتے نہیں کہ سن کر سمجھو اور سمجھ کر اللہ کی توحید پر ایمان لے آؤ۔ اسی طرح اگر اللہ تعالیٰ تم پر قیامت کے دن تک ہمیشہ کے لیے دن کر دے تو اللہ کے سوا کون سا معبود ہے جو تمھارے پاس کوئی رات لے آئے جس میں تم راحت اور سکون پاسکو۔ ¤ ➋ ان آیات میں رات کا ذکر دن سے پہلے فرمایا، کیونکہ رات کے بعد دن آنے کی نعمت بہت بڑی نعمت ہے۔ انسان کی معیشت کا سارا سلسلہ اسی پر موقوف ہے۔ علاوہ ازیں رات ایک طرح کا عدم ہے اور ضیاء وجود اور ظاہر ہے کہ عدم وجود سے پہلے ہے۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) {وَ مِنْ رَّحْمَتِهٖ جَعَلَ لَكُمُ الَّيْلَ … :} یعنی اسی نے اپنی رحمت سے تمھارے لیے رات دن کی صورت میں راحت و سکون اور معیشت کے اسباب و وسائل مہیا کیے، تا کہ تم اس کی نعمتوں کا شکر بجا لاؤ، مگر تم نے شکر ادا کرنے کے بجائے اس کے لیے شریک بنانے شروع کر دیے۔ معلوم ہوا کہ فطری طریق یہی ہے کہ انسان دن کو کام کرے اور رات کو آرام اور عموماً ہوتا بھی ایسا ہی ہے، پھر دونوں وقت دونوں کام ہوتے ہیں۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) {وَ يَوْمَ يُنَادِيْهِمْ فَيَقُوْلُ …:} توحید کے مزید دلائل ذکر کرنے کے بعد وہی مضمون دہرایا جو اوپر گزرا ہے کہ اللہ تعالیٰ مشرکین کو آواز دے کر کہے گا کہ کہاں ہیں میرے وہ شریک جنھیں تم گمان کرتے تھے!؟ بار بار یہ کہنے کا مقصد انھیں ڈانٹنا، ذلیل و رسوا کرنا اور ان کی اور ان کے شرکاء کی بے بسی کا اور شرک کے باطل ہونے کا اظہار ہو گا۔ پھر کبھی وہ اس بات سے انکار کریں گے کہ وہ کسی شریک کی عبادت کرتے تھے (دیکھیے انعام : ۲۲ تا ۲۴)، کبھی اپنے جھوٹے معبودوں کو پکاریں گے اور کوئی جواب نہ پائیں گے اور کبھی مایوس ہو کر خاموش ہو رہیں گے۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) ➊ { وَ نَزَعْنَا مِنْ كُلِّ اُمَّةٍ شَهِيْدًا :} اس گواہ سے مراد وہ نبی ہے جس نے کسی امت کو حق کا پیغام پہنچایا اور اس کی امت کے وہ لوگ بھی جنھوں نے پیغمبر کے بعد لوگوں کو دین کی تبلیغ کی۔ اسی طرح ہر وہ ذریعہ بھی جس سے کسی قوم یا شخص تک حق کا پیغام پہنچا۔ وہ گواہ گواہی دے گا کہ میں نے ان لوگوں تک اللہ کا پیغام پہنچایا تھا۔ دوسری جگہ فرمایا : «وَ جِايْٓءَ بِالنَّبِيّٖنَ وَ الشُّهَدَآءِ وَ قُضِيَ بَيْنَهُمْ بِالْحَقِّ وَ هُمْ لَا يُظْلَمُوْنَ » [ الزمر : ۶۹ ] ’’اور نبیوں اور گواہوں کو لایا جائے گا اور ان کے درمیان حق کے ساتھ فیصلہ کیا جائے گا اور ان پر ظلم نہیں کیا جائے گا۔‘‘ ¤ ➋ { فَقُلْنَا هَاتُوْا بُرْهَانَكُمْ …:} اس گواہی کے بعد مجرموں کو موقع دیا جائے گا کہ وہ اس کے خلاف کوئی عذر پیش کر سکتے ہیں تو کریں اور جب وہ کوئی عذر پیش نہیں کر سکیں گے تو ان سے کہا جائے گا کہ تم اللہ کا پیغام پہنچنے کے بعد جو شرک ہی پر قائم رہے، اس کی تمھارے پاس کوئی دلیل ہے تو پیش کرو۔ تو اس وقت انھیں معلوم ہو جائے گا کہ سچی بات اللہ کی ہے، عبادت اسی کا حق ہے، کوئی اس کا شریک نہیں اور انھوں نے جو شریک بنائے تھے اور دنیا میں جو حجت بازی کرتے تھے، سب کچھ ان سے گم ہو جائے گا، نہ کوئی شریک ہاتھ آئے گا نہ اسے شریک بنانے کی کوئی دلیل پیش کر سکیں گے۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76) ➊ {اِنَّ قَارُوْنَ كَانَ مِنْ قَوْمِ مُوْسٰى … :} کفار مکہ کے ایمان قبول نہ کرنے کا بہت بڑا باعث ان کے مالی اور دنیوی مفادات تھے، جس کا اظہار انھوں نے یہ کہہ کر کیا : «{ اِنْ نَّتَّبِعِ الْهُدٰى مَعَكَ نُتَخَطَّفْ مِنْ اَرْضِنَا }» [ القصص : ۵۷ ] ’’اگر ہم تیرے ہمراہ اس ہدایت کی پیروی کریں تو ہم اپنی زمین سے اچک لیے جائیں گے۔‘‘ یہ لوگ بہت بڑے سیٹھ، ساہو کار اور سرمایہ دار تھے، جنھیں بین الاقوامی تجارت نے قارونِ وقت بنا دیا تھا۔ اللہ تعالیٰ نے ان کے اس بہانے کو کئی طرح سے دور فرمایا، جس میں انھیں حرم کی بدولت حاصل نعمتوں کا تذکرہ بھی ہے، اپنی معیشت پر متکبر قوموں کی ہلاکت کا بھی اور اس بات کا بھی کہ دنیا میں تمھیں جو کچھ دیا گیا ہے وہ صرف دنیا کی زندگی کا سامان اور اس کی زینت ہے۔ اس کی وجہ سے آخرت کا نقصان نہ کرو، جو اس سے کہیں بہتر اور باقی رہنے والی ہے۔ درمیان میں قیامت کے دن مشرکوں کا حال اور توحید کے کچھ دلائل ذکر فرمائے۔ آخر میں قارون، اس کے مال و دولت، اس کے کفر و تکبر اور اس کے انجامِ بد کا ذکر فرمایا کہ دنیا کی دولت ایسی چیز نہیں کہ اس کی خاطر آدمی ایمان کی دولت اور ہمیشہ کی سعادت سے محروم رہے۔ ¤ ➋ { اِنَّ قَارُوْنَ كَانَ مِنْ قَوْمِ مُوْسٰى:} قرآن مجید نے اس بات کی صراحت کی ہے کہ قارون موسیٰ علیہ السلام کی قوم سے تھا اور اپنی قوم کے خلاف فرعون کا ساتھی بنا ہوا تھا، جیسے تمام ظالم بادشاہ کسی قوم پر ظلم و ستم کے لیے اسی قوم کے کسی آدمی کو مال و دولت اور عہدہ و مرتبہ دے کر اپنا آلۂ کار بناتے ہیں۔ بعض تفسیروں میں لکھا ہے کہ یہ تورات کا حافظ تھا اور بہت خوب صورت آواز سے تورات پڑھتا تھا، مگر اندر سے منافق تھا۔ لیکن قرآن مجید سے معلوم ہوتا ہے کہ وہ کفر میں اتنا پکا تھا کہ اللہ تعالیٰ نے موسیٰ علیہ السلام کو جھٹلانے والوں میں فرعون کے ساتھ جن دو آدمیوں کا نام لیا ہے ان میں سے ایک قارون تھا، جیسا کہ فرمایا : «{ وَ لَقَدْ اَرْسَلْنَا مُوْسٰى بِاٰيٰتِنَا وَ سُلْطٰنٍ مُّبِيْنٍ (23) اِلٰى فِرْعَوْنَ وَ هَامٰنَ وَ قَارُوْنَ  فَقَالُوْا سٰحِرٌ كَذَّابٌ }» [ المؤمن : ۲۳، ۲۴ ] ’’اور بلاشبہ یقینا ہم نے موسیٰ کو اپنی آیات اور واضح دلیل کے ساتھ بھیجا۔ فرعون اور ہامان اور قارون کی طرف تو انھوں نے کہا، جادوگر ہے، بہت جھوٹا ہے۔‘‘ (مزید دیکھیے عنکبوت:۳۹) اس کے مطابق اس کے تورات کا عالم یا منافق ہونے کی بات درست نہیں۔ ¤ ➌ { فَبَغٰى عَلَيْهِمْ:} اس سے بڑی سرکشی کیا ہو گی کہ وہ اپنی ہی قوم کے خلاف ایسے شخص کا دست و بازو بن گیا جو ان کے لڑکے ذبح کرتا تھا، ان کی عورتوں کو زندہ رکھتا اور انھیں بدترین سزائیں دیتا تھا۔ ¤ ➍ {وَ اٰتَيْنٰهُ مِنَ الْكُنُوْزِ … :} اس سے معلوم ہوا کہ ظالموں کو جو مال ملتا ہے وہ بھی اللہ تعالیٰ ہی عطا کرتا ہے، جس میں ان کی آزمائش اور ان پر حجت پوری کرنے کی حکمت پوشیدہ ہوتی ہے۔ {’’اَلْعُصْبَةُ ‘‘} غیر معین آدمیوں کی جماعت۔ اسے {’’عُصْبَةٌ‘‘} اس لیے کہتے ہیں کہ ان کا ہر فرد دوسرے کے لیے قوت کا باعث ہوتا ہے۔ عرف میں دس سے لے کر چالیس آدمیوں کی جماعت کو کہتے ہیں۔ {’’مَفَاتِحُ‘‘ ’’مِفْتَحٌ‘‘} کی جمع ہے، چابیاں۔ یعنی ہم نے قارون کو اتنے خزانے دیے تھے جن سے بھرے ہوئے کمروں کے تالوں کی چابیاں ایک قوت والی جماعت پر اٹھانے میں بھاری تھیں۔ تفاسیر میں ان خزانوں کی عجیب و غریب تفصیل مذکور ہے، جس کی تصدیق کا ہمارے پاس کوئی ذریعہ نہیں۔ صاحبِ کشّاف نے فرمایا : ’’اس کے اموال کی کثرت کے بیان میں مبالغے کے کئی الفاظ استعمال ہوئے ہیں، یعنی {’’اَلْكُنُوْزُ، اَلْمَفَاتِحُ، اَلنَّوْءُ} (بھاری ہونا) {اَلْعُصْبَةُ، أُوْلِي الْقُوَّةِ‘‘} اس سے ان اموال کا بہت زیادہ ہونا ثابت ہو رہا ہے۔‘‘ ¤ ➎ { اِذْ قَالَ لَهٗ قَوْمُهٗ لَا تَفْرَحْ …:} انسان کو اللہ تعالیٰ اپنی نعمتوں سے نوازے تو وہ ان پر پھول جاتا ہے، اس کی گفتگو، اس کا لباس، اس کی چال ڈھال، اس کے رنگ ڈھنگ، غرض اس کی ایک ایک ادا سے کبر و غرور ٹپکنے لگتا ہے۔ یہی حال قارون کا ہوا، بنی اسرائیل کے نیک بزرگ اور عالم لوگوں نے اسے سمجھایا کہ اللہ تعالیٰ نے تجھے دولت دی ہے تو اپنے آپ میں رہ، اسے اللہ کی نافرمانی میں خرچ مت کر اور پھول مت جا، اللہ تعالیٰ پھول جانے والوں سے محبت نہیں کرتا۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77) ➊ {وَ ابْتَغِ فِيْمَاۤ اٰتٰىكَ اللّٰهُ الدَّارَ الْاٰخِرَةَ:} اور اللہ تعالیٰ نے تجھے جو کچھ عطا فرمایا ہے اس کے ذریعے سے آخری گھر یعنی جنت حاصل کرنے کی کوشش کر۔ ¤ ➋ { وَ لَا تَنْسَ نَصِيْبَكَ مِنَ الدُّنْيَا :} یعنی مت بھول کہ دنیا جو تجھے عطا کی گئی ہے، اس میں تیرا حصہ کیا ہے۔ اس کی بہترین تفسیر وہ حدیث ہے جو ابوہریرہ رضی اللہ عنہ نے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَقُوْلُ الْعَبْدُ مَالِيْ مَالِيْ إِنَّمَا لَهُ ممِنْ مَّالِهِ ثَلَاثٌ، مَا أَكَلَ فَأَفْنٰی أَوْ لَببِسَ فَأَبْلٰی أَوْ أَعْطٰی فَاقْتَنٰی وَمَا سِوَی ذٰلِكَ فَهُوَ ذَاهِبٌ وَ تَارِكُهُ لِلنَّاسِ ] [مسلم، الزھد، باب ’’ الدنیا سجن للمؤمن و جنۃ للکافر ‘‘ : ۲۹۵۹ ] ’’بندہ کہتا ہے میرا مال، میرا مال، حالانکہ اس کے مال میں اس کی تو صرف تین چیزیں ہیں، جو اس نے کھایا اور فنا کر دیا، یا پہنا اور پرانا کر دیا، یا (اللہ کی راہ میں) دیا اور ذخیرہ بنا لیا اور جو اس کے سوا ہے تو یہ اسے لوگوں کے لیے چھوڑ کر (دنیا سے) جانے والا ہے۔‘‘ بعض مفسرین نے فرمایا، کسی چیز میں آدمی کا حصہ وہ نہیں ہوتا جو اس سے جدا ہو جائے، بلکہ وہ ہوتا ہے جو اس کے ساتھ رہے۔ اس کے مطابق دنیا میں سے آدمی کا حصہ وہ نیکی ہے جو آخرت میں اس کے ساتھ جائے۔ اور بعض مفسرین نے فرمایا، دنیا میں سے آدمی کے حصے سے مراد اس کا کفن ہے، کیونکہ اس کے سوا وہ کوئی چیز ساتھ لے کر نہیں جاتا: ¤ {نَصِيْبُكَ مِمَّا تَجْمَعُ الدَّهْرَ كُلَّهُ ¤ رِدَائَانِ تُلْوٰي فِيْهِمَا وَ حَنُوْطُ} ¤ ’’ساری عمر تو جو کچھ جمع کرے گا اس میں سے تیرا حصہ دو چادریں ہیں، جن میں تجھے لپیٹا جائے گا اور مُردے کو لگائی جانے والی خوشبو ہے۔‘‘ ¤ ایک تفسیر جو اکثر مفسرین نے بیان فرمائی ہے، یہ ہے کہ مال کا حریص بعض اوقات بخل کی اس حد تک پہنچ جاتا ہے کہ وہ اپنی جان پر بھی خرچ کرنے سے گریز کرتا ہے، اپنے کھانے، پہننے اور دوسری ضروریات میں بھی بخل سے کام لیتا ہے۔ قارون کو بزرگوں نے نصیحت کی کہ دنیا میں اپنے حصے کو مت بھول، اپنی جان پر بھی ضرورت کے مطابق خرچ کر۔ یہ چاروں تفسیریں درست ہیں اور ایک دوسرے کی تائید کرتی ہیں۔ ¤ ➌ { وَ اَحْسِنْ كَمَاۤ اَحْسَنَ اللّٰهُ اِلَيْكَ :} یعنی جیسے اللہ تعالیٰ نے تیرے ساتھ احسان (بہترین سلوک) کیا ہے، یہ مال و دولت اور شان و شوکت تجھے کسی بدلے کے بغیر عطا کی ہے، اسی طرح تو بھی اللہ کی مخلوق کے ساتھ احسان کر، یعنی ان سے کسی صلے کی خواہش کے بغیر بہترین سلوک کر۔ احسان کی یہ تفسیر اس لیے ہے کہ اللہ تعالیٰ نے بندے کو جو کچھ دیا ہے کسی بدلے کے بغیر دیا ہے۔ والدین کے ساتھ بھی اسی احسان کا حکم ہے، فرمایا : «{ وَ بِالْوَالِدَيْنِ۠ اِحْسَانًا }» [ بني إسرائیل : ۲۳ ] ’’اور ماں باپ کے ساتھ بہت اچھا سلوک کر۔‘‘ کیونکہ بڑھاپے میں ان سے کسی صلے کی توقع نہیں ہوتی۔ احسان کی تفسیر حدیث میں یہ بھی آئی ہے : [ أَنْ تَعْبُدَ اللّٰهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَّمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ] [بخاري، الإیمان، باب سؤال جبریل النبي صلی اللہ علیہ وسلم … : ۵۰ ] ’’اللہ کی عبادت اس طرح کرے جیسے تو اسے دیکھ رہا ہے، پھر اگر تو اسے نہیں دیکھتا تو وہ تجھے دیکھتا ہے۔‘‘ اس تفسیر کے مطابق مطلب یہ ہو گا کہ جیسے اللہ نے تیرے ساتھ بہترین سلوک کیا ہے تو بھی اس کے ساتھ بہترین معاملہ رکھ کہ ہر وقت اور ہر کام میں اسے پیشِ نظر رکھ اور اپنے ہر حال پر اس کی نگرانی کو اس طرح مدنظر رکھ کہ تیرا ہر کام اور تیری ہر حرکت اس کی رضا کے مطابق ہو، یہ احسان ہے۔ ¤ ➍ { وَ لَا تَبْغِ الْفَسَادَ فِي الْاَرْضِ …:} زمین میں ہر خرابی اور ہر فساد اللہ کے ساتھ شرک اور اس کی اور اس کے رسول کی نافرمانی سے پیدا ہوتا ہے، جیسا کہ فرمایا : «{ ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَ الْبَحْرِ بِمَا كَسَبَتْ اَيْدِي النَّاسِ }» [ الروم : ۴۱ ] ’’خشکی اور سمندر میں فساد ظاہر ہوگیا، اس کی وجہ سے جو لوگوں کے ہاتھوں نے کمایا۔‘‘ قوم کے دانش مند لوگوں نے قارون کو زمین میں فساد کی کوشش سے منع کیا اور بتایا کہ اللہ تعالیٰ مفسدوں سے محبت نہیں رکھتا۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) ➊ {قَالَ اِنَّمَاۤ اُوْتِيْتُهٗ عَلٰى عِلْمٍ عِنْدِيْ:} اس نے کہا اللہ کا مجھ پر کوئی احسان نہیں، یہ سب کچھ تو مجھے صرف اس علم کی وجہ سے دیا گیا ہے جو میرے پاس ہے۔ یہ اس طرح کی بات ہے جیسے آج کل کے دہر یہ سائنس دان کہتے ہیں کہ ہماری تمام تر ترقی ہمارے علوم کی وجہ سے ہے، اللہ تعالیٰ کا اس میں کوئی دخل نہیں۔ یہ نہیں سوچتے کہ یہ عقل، ذہانت اور مہارت عطا کرنے والا کون ہے؟ دوسری تفسیر یہ ہے کہ {’’ عِنْدِيْ ‘‘} کو {’’ عِلْمٍ ‘‘} کے متعلق ماننے کے بجائے {’’ اُوْتِيْتُهٗ ‘‘} کے متعلق مانا جائے، اس صورت میں معنی یہ ہو گا کہ ’’میرے نزدیک یہ سب کچھ مجھے اللہ تعالیٰ کے میرے اعمال و اوصاف کو جاننے کی بنا پر ملا ہے۔‘‘ یعنی اسے معلوم تھا کہ میں اس قابل ہوں، اگر میں اس کی نگاہ میں ناپسندیدہ ہوتا تو وہ مجھے یہ مال کیوں دیتا۔ ¤ ➋ وہ علم جو قارون کو دیا گیا تھا، کیا تھا؟ بعض لوگوں کا کہنا ہے کہ وہ علم کیمیا تھا، جس کے ساتھ وہ سونا بنا لیتا تھا، مگر اس کی کوئی دلیل نہیں۔ اللہ تعالیٰ بندے کو تجارت، صنعت، زراعت، غرض جس ذریعے سے بھی رزق دے وہ اس ذریعے کو رزق کا باعث قرار دے لیتا ہے اور اس مالک کو بھول جاتا ہے جس نے اس کے لیے اس علم و ہنر کو ذریعہ بنایا۔ ¤ ➌ {اَوَ لَمْ يَعْلَمْ اَنَّ اللّٰهَ قَدْ اَهْلَكَ …:} یعنی یہ شخص جو اپنے علم و ہنر پر اس قدر مغرور تھا، کیا اسے معلوم نہیں ہوا کہ اللہ تعالیٰ نے اس سے پہلے اس سے زیادہ قوت اور زیادہ جمع شدہ مال اور زیادہ جماعتوں والے لوگوں کو ہلاک کر دیا؟ ان کا علم و ہنر انھیں ہلاک ہونے سے نہ روک سکا، تو اس کا وہ علم جس پر اسے ناز ہے اسے ہلاک ہونے سے کیسے بچا سکے گا؟ اور اگر دنیا میں زیادہ مال و دولت اور زیادہ طرف داروں کا ہونا اللہ تعالیٰ کے خوش ہونے کی دلیل ہے تو پھر ان لوگوں پر عذاب کیوں آیا جو اس سے زیادہ قوت والے اور زیادہ تعداد والے تھے؟ ¤ ➍ { وَ لَا يُسْـَٔلُ عَنْ ذُنُوْبِهِمُ الْمُجْرِمُوْنَ :} یعنی مجرم تو یہی دعویٰ کیا کرتے ہیں کہ ہم بہت اچھے لوگ ہیں، مگر جب ان پر جرم ثابت ہو جاتا ہے اور اللہ کا عذاب آتا ہے تو ان سے پوچھ کر انھیں نہیں پکڑا جاتا کہ تمھارے گناہ کیا ہیں۔ ¤ ➎ دوسرے مقام پر جو فرمایا ہے : «{ فَوَرَبِّكَ لَنَسْـَٔلَنَّهُمْ اَجْمَعِيْنَ (92) عَمَّا كَانُوْا يَعْمَلُوْنَ } » [ الحجر : ۹۲، ۹۳ ] ( سو تیرے رب کی قسم ہے ! یقینا ہم ان سب سے ضرور سوال کریں گے، اس کے بارے میں جو وہ کیا کرتے تھے) تو وہ اس آیت کے منافی نہیں، کیونکہ قیامت کا دن بہت لمبا ہے۔ مجرموں کو ہلاک کرنے کے وقت ان سے ان کے گناہوں کے بارے میں نہیں پوچھا جاتا، ہاں دوسرے مقامات اور مواقع پر ان سے سوال کیا جاتا ہے۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79) ➊ {فَخَرَجَ عَلٰى قَوْمِهٖ فِيْ زِيْنَتِهٖ :} قارون نے مال و دولت پر اپنے کبرو غرور کے زبانی اظہار کو کافی نہیں سمجھا، بلکہ اس نے لوگوں کے سامنے اس کی نمائش کا بھی اہتمام کیا۔ {’’ فِيْ زِيْنَتِهٖ ‘‘} (اپنی زینت میں) کے الفاظ سے ظاہر ہے کہ اس نے اس موقع پر اپنی دولت و حشمت کا کیا کچھ اہتمام کیا ہو گا۔ اس طرح وہ موسیٰ علیہ السلام اور ان کے ساتھیوں کو مرعوب کرنا چاہتا تھا، تاکہ ان میں سے کچھ لوگ ٹوٹ کر اس سے آ ملیں، کیونکہ عوام کی اکثریت ایسے مظاہروں سے متاثر ہوتی ہے۔ تفاسیر میں اس کی زینت کی کچھ تفصیل بیان ہوئی ہے، مگر اس سے صاف ظاہر ہے کہ اس کا تانا بانا اسرائیلی روایات ہیں، مثلاً تفسیر طبری میں ہے کہ قتادہ نے فرمایا : ’’ہمیں بتایا گیا ہے کہ وہ لوگ چار ہزار سواریوں پر نکلے، ان پر اور ان کی سواریوں پر ارغوانی (شوخ گلابی) رنگ تھا۔‘‘ ابن زید نے کہا : ’’میرے والد ذکر کیا کرتے تھے کہ وہ ستر ہزار کے جلوس کے ساتھ نکلا۔‘‘ مراغی نے مقاتل کا قول نقل کیا ہے کہ وہ چتکبرے خچر پر سوار تھا، جس کی زین سونے کی تھی، ساتھ چار ہزار گھڑ سوار تھے، جنھوں نے ارغوانی لباس پہنے ہوئے تھے۔ اس کے ساتھ تین سو گورے رنگ کی لڑکیاں تھیں، جو زیور اور سرخ لباس پہن کر چتکبرے خچروں پر سوار تھیں وغیرہ وغیرہ۔ حقیقت یہ ہے کہ نہ قتادہ وہاں موجود تھے، نہ زید، نہ مقاتل اور نہ ان کے پاس وحی کے ذریعے سے یہ تفصیل آئی۔ ہاں اتنی بات ضرور ہے کہ جس شخص کے خزانوں کی چابیاں ایک قوت والی جماعت پر بھاری ہوتی تھیں اس نے اپنی دولت اور شان و شوکت کے اظہار میں کوئی کسر نہیں چھوڑی ہو گی۔ چنانچہ اس نے ایسا متکبرانہ انداز اختیار کیا جو اللہ تعالیٰ کو سخت ناپسند تھا۔ ¤ ➋ {قَالَ الَّذِيْنَ يُرِيْدُوْنَ الْحَيٰوةَ الدُّنْيَا … :} وہ لوگ جن کی زندگی کا مقصد ہی دنیا اور اس کی زیب و زینت کا حصول ہے، قارون کی شان و شوکت دیکھ کر کہنے لگے، کاش! ہمیں بھی یہ سب کچھ ملا ہوتا جو قارون کو دیا گیا ہے، یقینا وہ بہت بڑے نصیب والا ہے۔ یہ لوگ بنی اسرائیل کے عوام بھی ہو سکتے ہیں، کیونکہ دنیوی خوش حالی کی خواہش ہر دل میں موجود ہے اور فرعون کی قوم کے لوگ بھی۔ ان لوگوں کی اس تمنا کی مثالیں اب بھی ہمیں ہر جگہ نظر آتی ہیں۔ مردوں کو دیکھو یا عورتوں کو، جوانوں کو دیکھو یا بوڑھوں کو، ہر ایک دنیوی ترقی کی دوڑ میں ایک دوسرے سے آگے بڑھنے کی کوشش میں لگا ہوا ہے۔ ہر ایک نے کوئی نہ کوئی تمنا پال رکھی ہے کہ کاش! میرا مکان فلاں جیسا ہو، میری سواری فلاں جیسی ہو، میرا کاروبار فلاں جیسا ہو، پھر اس تمنا کے حصول کے لیے نہ اسے حلال کی پروا ہے نہ حرام کی۔ قرآن نے یہ مثالیں صرف داستان طرازی کے لیے بیان نہیں فرمائیں، بلکہ یہ سب کچھ ہمیں ایسے رویے کے بد انجام سے آگاہ کرنے کے لیے بیان فرمایا ہے۔"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) ➊ { وَ قَالَ الَّذِيْنَ اُوْتُوا الْعِلْمَ … :} وہ لوگ جنھیں علم دیا گیا تھا، کہنے لگے، افسوس تم پر! اللہ کی نافرمانی کے ساتھ حاصل ہونے والی اس زیب و زینت اور شان و شوکت کے مقابلے میں اللہ تعالیٰ کا عطا کردہ بدلا کہیں بہتر ہے جو وہ ایمان اور عمل صالح والوں کو عطا کرتا ہے۔ اس آیت میں اللہ کے ثواب سے مراد وہ رزق کریم ہے جو اللہ تعالیٰ کے احکام پر قائم رہ کر محنت و کوشش کے نتیجے میں دنیا اور آخرت میں حاصل ہوتا ہے۔ ¤ ➋ { وَ لَا يُلَقّٰىهَاۤ اِلَّا الصّٰبِرُوْنَ:} صبر کی تین قسمیں ہیں، اللہ کے احکام پر صبر یعنی ان کا پابند رہنا، اس کی نافرمانی سے صبر یعنی اس سے بچتے رہنا اور مصیبتوں پر صبر۔ یعنی اللہ کا یہ ثواب صرف انھی لوگوں کو عطا کیا جاتا ہے جن میں اتنا صبر اور ثابت قدمی ہو کہ حلال طریقے اختیار کرنے پر مضبوطی کے ساتھ جمے رہیں، خواہ تھوڑا رزق ملے یا زیادہ، حرام سے قطعاً اجتناب کریں، خواہ اس سے کتنے فائدے مل رہے ہوں اور اس صدق و دیانت کی وجہ سے پیش آنے والی ہر مشکل اور مصیبت پر صبر کریں۔ دنیا کی تکالیف کو عارضی اور چند روزہ سمجھ کر کسی نہ کسی طرح گزار دیں اور اللہ تعالیٰ سے شکوہ شکایت کا کوئی لفظ زبان پر نہ لائیں۔ اللہ تعالیٰ کا عطا کردہ ثواب، جو مومن کو دنیا میں ملتا ہے، تھوڑا ہو یا زیادہ، کافر کے مال و منال سے خواہ وہ کتنا زیادہ ہو، اس لیے بہتر ہے کہ مومن کو اللہ کی فرماں برداری کی خوشی کا احساس، اس کے عطا کردہ رزق پر صبرو قناعت اور اس کی وجہ سے ملنے والی سکون و اطمینان کی دولت کے مقابلے میں کافر کے اموال و اولاد اور زیب و زینت کی کوئی حقیقت ہی نہیں، جو اللہ تعالیٰ کے فرمان کے مطابق ان کے لیے بے شمار رنج و غم اور عذاب کا باعث ہیں، جیسا کہ فرمایا : «{ فَلَا تُعْجِبْكَ اَمْوَالُهُمْ وَ لَاۤ اَوْلَادُهُمْ اِنَّمَا يُرِيْدُ اللّٰهُ لِيُعَذِّبَهُمْ بِهَا فِي الْحَيٰوةِ الدُّنْيَا وَ تَزْهَقَ اَنْفُسُهُمْ وَ هُمْ ككٰفِرُوْنَ }» [ التوبۃ : ۵۵ ] ’’سو تجھے نہ ان کے اموال بھلے معلوم ہوں اور نہ ان کی اولاد، اللہ تو یہی چاہتا ہے کہ انھیں ان کے ذریعے دنیا کی زندگی میں عذاب دے اور ان کی جانیں اس حال میں نکلیں کہ وہ کافر ہوں۔‘‘ اور آخرت میں اللہ کا ثواب کفار کی دنیوی زینت و مال سے اس لیے کہیں بہتر ہے کہ یہ عارضی ہے اور وہ باقی، اس میں بے شمار پریشانیوں اور رنج و غم کی آمیزش ہے اور وہ ہر قسم کے رنج و غم کی آمیزش سے پاک ہے۔"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) ➊ { فَخَسَفْنَا بِهٖ وَ بِدَارِهِ الْاَرْضَ :} اللہ تعالیٰ کو اس کے تکبر کے اس مظاہرے پر پر ایسی غیرت آئی کہ اس نے اسے اور اس کے گھر کو جس میں اس کے اہل و عیال، نوکر چاکر اور خزانے تھے، سب کو زمین میں دھنسا دیا۔ قارون کی اس حالت پر وہ حدیث منطبق ہوتی ہے جو ابن عمر رضی اللہ عنھما نے بیان کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ بَيْنَمَا رَجُلٌ يَجُرُّ إِزَارَهُ مِنَ الْخُيَلاَءِ خُسِفَ بِهِ ، فَهُوَ يَتَجَلْجَلُ فِي الْأَرْضِ إِلٰي يَوْمِ الْقِيَامَةِ ] [ بخاري، أحادیث الأنبیاء، باب : ۳۴۸۵ ] ’’ایک آدمی اپنی چادر تکبر سے گھسیٹتا جا رہا تھا، تو اسی حالت میں اسے زمین میں دھنسا دیا گیا اور وہ قیامت کے دن تک زمین میں دھنستا چلا جا رہا ہے۔‘‘ علمائے تفسیر کا رجحان یہ ہے کہ اس سے مراد قارون ہے۔ ¤ ➋ اس آیت اور حدیث سے معلوم ہوا کہ تکبر سے چادر لٹکانا بھی اللہ تعالیٰ کو اس قدر ناپسند ہے کہ اگر اس کی رحمت نہ ہو تو ایسے آدمی کو زمین میں دھنسا دیا جائے۔ اس میں شک نہیں کہ کپڑا خود بخود ڈھلک جائے تو وہ تکبر نہیں، جیسا کہ ابوبکرصدیق رضی اللہ عنہ کا کپڑا ڈھلک جاتا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ تم تکبر سے ایسا نہیں کرتے، مگر بعض لوگ جان بوجھ کر کپڑا لٹکاتے ہیں اور کہتے ہیں کہ ہم تکبر سے ایسا نہیں کرتے۔ ان کے متعلق رسول اللہ صلی اللہ علیہ وسلم کا فرمان سنیے، جابر بن سلیم رضی اللہ عنہ نے ایک لمبی حدیث میں بیان کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے انھیں فرمایا : [ وَارْفَعْ إِزَارَكَ إِلٰی نِصْفِ السَّاقِ فَإِنْ أَبَيْتَ فَإِلَی الْكَعْبَيْنِ وَ إِيَّاكَ وَ إِسْبَبَالَ الْإِزَارِ فَإِنَّهَا مِنَ الْمَخِيْلَةِ وَ إِنَّ اللّٰهَ لاَ يُحِبُّ الْمَخِيْلَةَ ] [أبو داوٗد، اللباس، باب ما جاء في إسبال الإزار : ۴۰۸۴، و صححہ الألباني ] ’’اپنی چادر نصف پنڈلی تک اٹھاؤ، اگر نہیں مانتے تو ٹخنوں تک اٹھاؤ، اور چادر لٹکانے سے بچو، کیونکہ یہ تکبر سے ہے اور یقینا اللہ تعالیٰ تکبر کو پسند نہیں کرتا۔‘‘ اس سے ثابت ہوا کہ جان بوجھ کر کپڑا لٹکانا ہی تکبر ہے۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم کا فرمان سننے کے بعد اسے نہ ماننا اور جان بوجھ کر کپڑا لٹکانا صاف تکبر ہے۔ جان بوجھ کر چادر لٹکانا اتنا بڑا گناہ ہے کہ ابوذر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ ثَلَاثَةٌ لَا يُكَلِّمُهُمُ اللّٰهُ يَوْمَ الْقِيَامَةِ وَلَا يَنْظُرُ إِلَيْهِمْ وَلَا يُزَكِّيْهِمْ وَلَهُمْ عَذَابٌ أَلِيْمٌ ، ققَالَ فَقَرَأَهَا رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ ثَلاَثَ مَرَّاتٍ، قَالَ أَبُوْ ذَرٍّ خَابُوْا وَخَسِرُوْا مَنْ هُمْ يَا رَسُوْلَ اللّٰهِ!؟ قَالَ الْمُسْبِلُ إِزَارَهُ وَالْمَنَّانُ وَ الْمُنَفِّقُ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ ] [مسلم، الإیمان، باب بیان غلظ تحریم إسبال الإزار… : ۱۰۶]’’تین آدمی ایسے ہیں کہ قیامت کے دن اللہ تعالیٰ نہ ان سے کلام کرے گا، نہ ان کی طرف نگاہ کرے گا اور نہ ان کو پاک کرے گا اور ان کے لیے دردناک عذاب ہے۔‘‘ تین دفعہ فرمایا تو ابوذر رضی اللہ عنہ نے کہا : ’’وہ تو ناکام اور نامراد ہو گئے، یا رسول اللہ! وہ کون ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اپنی چادر (ٹخنوں سے نیچے) لٹکانے والا اور احسان جتلانے والا اور اپنا سامان جھوٹی قسم کے ساتھ بیچنے والا۔‘‘ ¤ ➌ قرآن مجید کے بیان سے ظاہر ہے کہ اسے زمین میں دھنسانے کا باعث اس کا تکبر اور اس کے اظہار کے لیے اس کا اپنی زینت اور شان و شوکت کے ساتھ نکلنا تھا۔ مگر بعض مفسرین نے اس کی بغاوت اور سرکشی کے اور واقعات بھی بیان کیے ہیں، جن میں سے ایک یہ ہے کہ قارون نے ایک فاحشہ عورت کو اس شرط پر کچھ مال دیا کہ وہ موسیٰ علیہ السلام پر بدکاری کی تہمت لگائے، جب وہ بنی اسرائیل میں کھڑے ہو کر کتاب اللہ کی تلاوت کر رہے ہوں تو یہ عورت کہے کہ موسیٰ! تم نے میرے ساتھ ایسے ایسے کیا ہے۔ لہٰذا جب اس نے مجلس میں موسیٰ علیہ السلام کو یہ بات کہی تو وہ ڈر کر کانپ اٹھے اور دو رکعتیں پڑھ کر اس کی طرف متوجہ ہوئے اور فرمایا : ’’میں تمھیں اس اللہ کی قسم دیتا ہوں جس نے سمندر کو پھاڑا اور تمھیں فرعون سے نجات دی اور فلاں فلاں احسانات کیے کہ تم ہر صورت وہ شخص بتاؤ جس نے تمھیں اس بات پر آمادہ کیا ہے جو تم نے کہی۔‘‘ اس نے کہا، جب آپ نے مجھ سے قسم دے کر پوچھا ہے تو قارون نے مجھے اتنا مال دیا ہے، اس شرط پر کہ میں آپ کو اس اس طرح کہوں اور میں اللہ سے معافی مانگتی ہوں اور توبہ کرتی ہوں۔ اس پر موسیٰ علیہ السلام سجدے میں گر گئے اور قارون کے بارے میں اللہ تعالیٰ سے دعا کی۔ اللہ تعالیٰ نے انھیں وحی کی کہ میں نے زمین کو حکم دے دیا ہے کہ اس کے متعلق تمھارا حکم مانے تو موسیٰ علیہ السلام نے زمین کو حکم دیا کہ اسے نگل جائے، تو ایسا ہی ہوا۔ ابن کثیر نے یہ واقعہ ابن عباس رضی اللہ عنھما سے نقل کیا ہے۔ سند اس کی اچھی بھی ہو تو یہ ان کا قول ہے، انھوں نے اسے رسول اللہ صلی اللہ علیہ وسلم سے نقل نہیں فرمایا اور ظاہر ہے کہ اس واقعہ کے وقت ابن عباس رضی اللہ عنھما موجود نہیں تھے، بلکہ درمیان میں سیکڑوں ہزاروں سال کا فاصلہ ہے۔ اس لیے اس کے اسرائیلی روایت ہونے میں کوئی شک نہیں، جس پر یقین ممکن نہیں۔ خصوصاً اس لیے کہ اس میں قارون کا سمندر سے پار ہونا بھی مذکور ہے، جب کہ سورۂ مومن میں اللہ تعالیٰ نے موسیٰ علیہ السلام کو فرعون، ہامان اور قارون کی طرف بھیجنے اور ان تینوں کے آپ کو جھٹلانے کا ذکر فرمایا ہے، پھر فرعون اور اس کے ساتھیوں کے متعلق فرمایا : «{ وَ حَاقَ بِاٰلِ فِرْعَوْنَ سُوْٓءُ الْعَذَابِ (45) اَلنَّارُ يُعْرَضُوْنَ عَلَيْهَا غُدُوًّا وَّ عَشِيًّا }» [ المؤمن : ۴۵، ۴۶ ] ’’اور آلِ فرعون کو برے عذاب نے گھیر لیا۔ جو آگ ہے، وہ اس پر صبح و شام پیش کیے جاتے ہیں۔‘‘ اسی طرح سورۂ عنکبوت (۳۹، ۴۰) میں ان تینوں کے تکبر کی وجہ سے ایمان نہ لانے اور اپنے گناہوں میں پکڑے جانے کا ذکر ہے۔ غرض قرآن مجید سے قارون کے ایمان لانے یا سمندر سے پار جانے کا کوئی اشارہ نہیں ملتا، بلکہ اس کے مسلسل جھٹلانے، تکبر کرنے اور اس کی پاداش میں زمین کے اندر دھنس جانے کا ذکر ہی ملتا ہے۔ ابن کثیر نے فرمایا : ’’یہاں بہت سی اسرائیلیات ذکر کی گئی ہیں جن سے ہم نے پہلو تہی کی ہے۔‘‘ کاش! ابن کثیر یہ اسرائیلیات بھی ذکر نہ کرتے جو انھوں نے ذکر کی ہیں۔ ¤ ➍ { فَمَا كَانَ لَهٗ مِنْ فِئَةٍ يَّنْصُرُوْنَهٗ …:} یعنی اس وقت نہ کوئی جماعت تھی جو اس کی مدد کو پہنچتی، نہ وہ خود اپنے آپ کو بچا سکا۔ اس کے نوکر چاکر، ساتھی اور دوست اس کے کسی کام نہ آ سکے۔"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) ➊ {وَ اَصْبَحَ الَّذِيْنَ تَمَنَّوْا مَكَانَهٗ بِالْاَمْسِ … : ’’ وَيْكَاَنَّ ‘‘} کی تفسیر میں کئی اقوال ہیں، بعض نے فرمایا، اس کا معنی {’’أَلَمْ تَرَ أَنَّ‘‘} (کیا تو نے نہیں دیکھا کہ) ہے۔ بعض نے فرمایا، یہ{’’ وَيْ‘‘ ، ’’ كَ‘‘} اور {’’أَنَّ ‘‘} کا مجموعہ ہے۔ {’’وَيْ‘‘} تعجب کا کلمہ ہے، کاف تعلیل کے لیے ہے ( اس لیے) اور {’’أَنَّ ‘‘} حرف تحقیق ہے۔ یعنی  تعجب ہے، اس لیے کہ بے شک اللہ تعالیٰ… ۔ اور بعض نے فرمایا {’’وَيْ ‘‘} کلمہ تَنَدُّم ہے، یعنی ندامت اور افسوس کے اظہار کے لیے آتا ہے اور کاف حرف تشبیہ ہے (بمعنی گویا کہ)۔ میں نے اسی کے مطابق ترجمہ کیا ہے : ’’افسوس! ایسا معلوم ہوتا ہے کہ۔‘‘ ¤ ➋ یعنی کل جو لوگ مال و دولت اور جاہ و حشمت میں قارون کو حاصل مرتبے کی تمنا کر رہے تھے، صبح ہوئی تو وہی کہہ رہے تھے کہ افسوس! معلوم یہی ہوتا ہے کہ رزق کا زیادہ ہونا یا کم ہونا کسی کے علم یا محنت پر نہیں بلکہ اللہ تعالیٰ کی مشیت اور مرضی پر موقوف ہے۔ وہ جس کا رزق چاہتا ہے فراخ کر دیتا ہے اور جس کا چاہتا ہے تنگ کر دیتا ہے۔ کسی کو رزق زیادہ دینے کا یہ مطلب نہیں کہ اس کے پاس مال کمانے کا ہنر زیادہ ہے اور کسی کا رزق تنگ ہونے کا یہ مطلب نہیں کہ اس کے پاس مال کمانے کا ہنر نہیں، نہ ہی مال کا زیادہ ہونا اللہ تعالیٰ کے راضی ہونے کی یا کم ہونا اس کے ناراض ہونے کی دلیل ہے۔ اللہ تعالیٰ کے راضی ہونے کی علامت صرف اور صرف یہ ہے کہ وہ کسی کو ایمان کی دولت عطا فرما دے، جیسا کہ عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا : [ إِنَّ اللّٰهَ تَعَالٰی قَسَمَ بَيْنَكُمْ أَخْلاَقَكُمْ ، كَمَا قَسَمَ بَيْنَكُمْ أَرْزَاقَكُمْ ، وَإِنَّ اللّٰهَ تَعَالٰي يُعْطِي الْمَالَ مَنْ أَحَبَّ وَمَنْ لاَ يُحِبُّ ، وَلاَ يُعْطِي الْإِيْمَانَ إِلاَّ  مَنْ يُحِبُّ ] [ الأدب المفرد : ۲۷۵، قال الألباني صحیح، موقوف في حکم المرفوع، وانظر سلسلۃ الأحادیث الصحیحۃ : ۲۷۱۴ ]’’اللہ تعالیٰ نے تمھارے درمیان تمھارے اخلاق اسی طرح تقسیم کیے ہیں جس طرح اس نے تمھارے رزق تقسیم کیے ہیں اور اللہ مال اسے بھی دیتا ہے جس سے محبت کرتا ہے اور اسے بھی جس سے محبت نہیں کرتا، مگر ایمان اس کے سوا کسی کو نہیں دیتا جس سے وہ محبت کرتا ہو۔‘‘¤ ➌ {لَوْ لَاۤ اَنْ مَّنَّ اللّٰهُ عَلَيْنَا لَخَسَفَ بِنَا …:} یعنی اللہ تعالیٰ کا احسان ہے کہ اس نے ہمیں قارون کی طرح نہیں بنایا، ورنہ ہماری بھی یہی حالت ہوتی۔ ہم تو حرص کی وجہ سے {’’ يٰلَيْتَ لَنَا مِثْلَ مَاۤ اُوْتِيَ قَارُوْنُ ‘‘} (کاش! ہمارے لیے اس جیسا ہوتا جو قارون کو دیا گیا ہے) کہہ کر اس جیسے عذاب کے حق دار بن چکے تھے۔ اللہ کا شکر ہے کہ اس نے ہماری آرزو پوری نہ کی، بلکہ قارون کا انجام آنکھوں سے دکھا کر رجوع کی توفیق فرمائی۔ اب معلوم ہوا کہ مال و دولت جتنا بھی جمع کر لیں کافر کبھی فلاح نہیں پا سکتے۔ ¤ ➍ ابو کبشہ الانماری رضی اللہ عنہ بیان کرتے ہیں کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا۔ لمبی حدیث ہے، اس میں ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّمَا الدُّنْيَا لِأَرْبَعَةِ نَفَرٍ : عَبْدٍ رَزَقَهُ اللّٰهُ مَالاً وَعِلْمًا فَهُوَ يَتَّقِيْ رَبَّهُ فِيْهِ وَيَصِلُ فِيْهِ رَحِمَههُ وَيَعْلَمُ لِلّٰهِ فِيْهِ حَقًّا فَهٰذَا بِأَفْضَلِ الْمَنَازِلِ وَعَبْدٍ رَزَقَهُ اللّٰهُ عِلْمًا وَلَمْ يَرْزُقْهُ مَالاً فَهُوَ صَادِقُ النِّيَّةِ يَقُوْلُ لَوْ أَنَّ لِيْ مَالاً لَعَمِلْتُ فِيْههِ بِعَمَلِ فُلاَنٍ فَهُوَ بِنِيَّتِهِ فَأَجْرُهُمَا سَوَاءٌ، وَعَبْدٍ رَزَقَهُ اللّٰهُ مَالاً وَلَمْ يَرْزُقْهُ عِلْمًا فَهُوَ يُخْبَطُ فِيْ مَالِهِ بِغَيْرِ عِلْمٍ لاَ يَتَّقِيْ فِيهِ رَبَّهُ وَلاَ يَصِلُ فِيْهِ رَحِمَهُ وَلاَ يَعْلَمُ لِلّٰهِ فِيْهِ حَقًّا فَهٰذَا بِأَخْبَثِ الْمَنَازِلِ وَعَبْدٍ لَمْ يَرْزُقْهُ اللّٰهُ مَالاً وَلاَ عِلْمًا فَهُوَ يَقُوْلُ لَوْ أَنَّ لِيْ مَالاً لَعَمِلْتُ فِيْهِ بِبِعَمَلِ فُلاَنٍ فَهُوَ بِنِيَّتِهِ فَوِزْرُهُمَا سَوَاءٌ] [ ترمذي، الزھد، باب ما جاء مثل الدنیا مثل أربعۃ نفر : ۲۳۲۵ ] ’’دنیا صرف چار آدمیوں کے لیے ہے، ایک وہ بندہ جسے اللہ تعالیٰ نے مال اور علم عطا فرمایا، چنانچہ وہ اس کے بارے میں اپنے رب سے ڈرتا ہے اور صلہ رحمی کرتا ہے اور اس میں اللہ کا حق جانتا ہے، یہ سب سے افضل مرتبے میں ہے اور ایک وہ بندہ جسے اللہ تعالیٰ نے علم دیا، مگر مال نہیں دیا، چنانچہ وہ سچی نیت والا ہے۔ کہتا ہے، اگر میرے پاس مال ہو تو میں فلاں شخص جیسا عمل کروں۔ سو یہ اس کی نیت ہے اور دونوں کا اجر برابر ہے۔ اور ایک وہ بندہ جسے اللہ تعالیٰ نے مال دیا، مگر علم نہیں دیا۔ چنانچہ وہ اس میں علم کے بغیر ٹامک ٹوئیاں مارتا پھرتا ہے۔ نہ اس میں اپنے رب سے ڈرتا ہے، نہ اس میں صلہ رحمی کرتا ہے اور نہ اس میں اللہ کا کوئی حق جانتا ہے۔ سو وہ بدترین مرتبے میں ہے اور ایک وہ بندہ جسے اللہ نے نہ مال دیا ہے نہ علم۔ چنانچہ وہ کہتا ہے، اگر میرے پاس مال ہو تو میں فلاں شخص جیسا عمل کروں تو یہ اس کی نیت ہے اور ان دونوں کا گناہ برابر ہے۔‘‘ جو لوگ کل قارون کے مرتبے کی تمنا کر رہے تھے اس حدیث کی رو سے قارون اور وہ دونوں گناہ میں برابر تھے، اس لیے انھوں نے اللہ کا احسان مانا کہ اس نے ہمیں قارون کی طرح زمین میں دھنسا نہیں دیا۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) ➊ { تِلْكَ الدَّارُ الْاٰخِرَةُ …: ’’ عُلُوًّا ‘‘} کا لفظی معنی اونچا ہونا ہے، مراد اپنے آپ کو دوسروں سے اونچا سمجھنا اور دوسروں کو حقیر جاننا ہے۔ {’’ فَسَادًا ‘‘} کا لفظی معنی خرابی ہے، عام طور پر یہ لفظ چوری، ڈاکے، غصب، لوٹ مار، قتل و غارت اور لوگوں کا حق مارنے کے معنی میں استعمال ہوتا ہے۔ مراد اللہ اور اس کے رسول کی نافرمانی ہے، خواہ کوئی بھی ہو، کیونکہ اسی سے زمین میں خرابی پیدا ہوتی ہے اور سب سے بڑا فساد اللہ کے ساتھ شرک ہے۔ ¤ ➋ آخرت کی عظمت کی طرف اشارہ کرتے ہوئے فرمایا کہ یہ آخری گھر جس کا ذکر تم سنتے رہتے ہو، ہم ان لوگوں کے لیے بناتے ہیں جو صرف یہ نہیں کہ تکبر اور سرکشی اختیار نہیں کرتے اور فساد فی الارض کا ارتکاب نہیں کرتے، بلکہ ان دونوں کاموں کا ارادہ بھی نہیں کرتے۔ مطلب یہ کہ دارِ آخرت میں فرعون، قارون اور ان جیسے لوگوں کا کوئی حصہ نہیں، جن کی زندگی سراسر علو اور فساد ہو۔ ¤ ➌ عیاض بن حمار رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایک دن خطبہ دینے کے لیے ہم میں کھڑے ہوئے۔ آپ صلی اللہ علیہ وسلم نے کئی باتیں بیان فرمائیں، ان میں سے ایک یہ ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ وَ إِنَّ اللّٰهَ أَوْحٰی إِلَيَّ أَنْ تَوَاضَعُوْا حَتّٰی لَا يَفْخَرَ أَحَدٌ عَلی أَحَدٍ وَلَا يَبْغِيْ أَحَدٌ عَلٰی أَحَدٍ ] [ مسلم، الجنۃ و صفۃ نعیمھا، باب الصفات التي یعرف بھا في الدنیا أھل الجنۃ و أھل النار : ۶۴ /۲۸۶۵ ] ’’اللہ تعالیٰ نے میری طرف وحی فرمائی کہ عاجزی اختیار کرو، حتیٰ کہ کوئی شخص کسی پر فخر نہ کرے اور کوئی شخص کسی پر سرکشی نہ کرے۔‘‘ عبد اللہ بن مسعود رضی اللہ عنہ نبی صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِيْ قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ، قَالَ رَجُلٌ إِنَّ الرَّجُلَ يُحِبُّ أَنْ يَكُوْنَ ثَوْبُهُ حَسَنًا وَ نَعْلُهُ حَسَنَةً، قَالَ إِنَّ اللّٰهَ جَمِيْلٌ يُحِبُّ الْجَمَالَ الْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ ] [ مسلم، الإیمان، باب تحریم الکبر و بیانہ : ۹۱ ] ’’وہ شخص جنت میں نہیں جائے گا جس کے دل میں ذرہ برابر تکبر ہو گا۔‘‘ ایک آدمی نے کہا : ’’آدمی پسند کرتا ہے کہ اس کا کپڑا اچھا ہو، اس کا جوتا اچھا ہو (تو کیا یہ بھی تکبر ہے)؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یقینا اللہ جمیل ہے اور جمال سے محبت رکھتا ہے، تکبر تو حق کا انکار اور لوگوں کو حقیر جاننا ہے۔‘‘ ¤ ➍ { وَ الْعَاقِبَةُ لِلْمُتَّقِيْنَ:} اور اچھا انجام ان لوگوں کے لیے ہے جو اللہ سے ڈرتے ہیں اور ہر قسم کے کبر اور فساد سے بچ کر رہتے ہیں۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84) {مَنْ جَآءَ بِالْحَسَنَةِ فَلَهٗ خَيْرٌ مِّنْهَا … :} اس آیت کی تفسیر کے لیے دیکھیے سورۂ انعام (۱۶۰) اور سورۂ نمل (۸۹) کی تفسیر۔"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 85) ➊ { اِنَّ الَّذِيْ فَرَضَ عَلَيْكَ الْقُرْاٰنَ …: ’’ مَعَادٍ ‘‘} میں تنوین تعظیم کی ہے، اس لیے ترجمہ عظیم الشان لوٹنے کی جگہ کیا گیا ہے۔ قرآن فرض کرنے سے مراد اس پر عمل اور اسے تمام دنیا کے لوگوں تک پہنچانے اور اس کے لیے جہاد کرنے کا فریضہ عائد کرنا ہے۔ ¤ ➋ {لَرَآدُّكَ اِلٰى مَعَادٍ :} پہلے فرمایا تھا : {’’ وَ الْعَاقِبَةُ لِلْمُتَّقِيْنَ ‘‘} اب رسول اللہ صلی اللہ علیہ وسلم کے لیے اس اچھے انجام کا ذکر فرمایا اور سورت کا اختتام عظیم الشان خوش خبری کے ساتھ فرمایا، یعنی جس اللہ نے آپ پر قرآن پر عمل کا اور اس کی دعوت کا فریضہ عائد کیا ہے وہ آپ کی محنت و مشقت اور ادائیگی فرض کے نتیجہ میں آپ کو ایک عظیم الشان انجام تک پہنچانے والا ہے، دنیا میں بھی اور آخرت میں بھی۔ دنیا میں اس طرح کہ آپ اس شہر مکہ سے ہجرت کریں گے اور دوبارہ پھر اس میں واپس آئیں گے اور اس شاندار طریقے سے آئیں گے کہ پورا جزیرۂ عرب آپ کے زیرِنگین ہو گا۔ جیسا کہ صحیح بخاری (۴۷۷۳) میں ابن عباس رضی اللہ عنھما سے مروی ہے کہ اس {’’ مَعَادٍ ‘‘} سے مراد مکہ مکرمہ ہے۔ چنانچہ ہجرت کے آٹھویں سال اللہ تعالیٰ کا یہ وعدہ پورا ہو گیا اور آپ فاتحانہ شان سے مکہ مکرمہ میں داخل ہوئے، اور آخرت میں عظیم الشان مقام محمود پر پہنچانے والا ہے، جس کی وجہ سے پہلے اور پچھلے سب آپ پر رشک کریں گے۔ اسے {’’ مَعَادٍ ‘‘} اس لیے فرمایا کہ قرآن مجید میں آخرت کو سب کے لیے لوٹنے کی جگہ قرار دیا ہے، جیسا کہ فرمایا : «{ وَ اتَّقُوْا يَوْمًا تُرْجَعُوْنَ فِيْهِ اِلَى اللّٰهِ }» [ البقرۃ : ۲۸۱ ] ’’اور اس دن سے ڈرو جس میں تم اللہ کی طرف لوٹائے جاؤ گے۔‘‘ اور فرمایا : «{ ثُمَّ اِلَيْهِ تُرْجَعُوْنَ }» [ البقرۃ : ۲۸ ] ’’پھر تم اسی کی طرف لوٹائے جاؤ گے۔‘‘ اور فرمایا : «{ اِلَى اللّٰهِ مَرْجِعُكُمْ }» [ المائدۃ : ۴۸ ] ’’اللہ ہی کی طرف تم سب کا لوٹ کر جانا ہے۔‘‘ مفسرین میں سے بعض نے {’’ مَعَادٍ ‘‘} سے مراد مکہ اور بعض نے جنت لی ہے، ددونوں اقوال اپنی اپنی جگہ درست ہیں۔ ¤ ➌ { قُلْ رَّبِّيْۤ اَعْلَمُ مَنْ جَآءَ بِالْهُدٰى … :} یہ پیش گوئی کہ آپ کا رب آپ کو اسی مکہ میں فاتحانہ شان سے واپس لائے گا، کفار کے نزدیک ایسی بات تھی جو کوئی گمراہ شخص ہی کر سکتا ہے، اس لیے اللہ تعالیٰ نے ان کی طرف سے آنے والی بات کا جواب پہلے ہی بتا دیا کہ آپ ان سے کہہ دیں کہ میرا رب بہتر جانتا ہے کہ ہدایت لے کر کون آیا ہے اور کون ہے جو کھلی گمراہی میں مبتلا ہے اور بہت جلد یہ حقیقت تم پر واضح ہو جائے گی۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86) ➊ { وَ مَا كُنْتَ تَرْجُوْۤا اَنْ يُّلْقٰۤى اِلَيْكَ الْكِتٰبُ …:} رسول اللہ صلی اللہ علیہ وسلم مکہ مکرمہ میں جن حالات سے گزر رہے تھے اور جس طرح کفار نے آپ کا اور آپ کے ساتھیوں کا جینا دو بھر کر رکھا تھا، ان حالات میں یہ پیش گوئی کہ آپ کا رب آپ کو یہاں سے ہجرت کے بعد اسی عظیم الشان مقام میں لانے والا ہے، بظاہر ایک ناممکن کام کی پیش گوئی تھی۔ اس پر اللہ تعالیٰ نے آپ کو اطمینان دلانے کے لیے اس احسان کا ذکر فرمایا جو اس سے کہیں بڑا احسان تھا۔ فرمایا، آپ کو تعجب ہوتا ہے اور یہ بات بہت بعید نظر آتی ہے کہ آپ نہایت باعزت طریقے سے اپنے شہر میں واپس آئیں گے تو ذرا اپنی رسالت پر تو غور کریں، کبھی آپ نے سوچا بھی تھا یا دل میں یہ خیال یا آرزو بھی پیدا ہوئی تھی کہ آپ اللہ کے رسول بن جائیں گے، اس کے باوجود اللہ تعالیٰ نے آپ کو یہ نعمت عطا فرمائی اور رسالت کے لیے چن لیا جو آپ کے خیال تک میں نہ تھی، تو وہ ایسی خبر سے آپ کو کیسے محروم رکھے گا جو آپ کی خواہش ہے اور جس کا آپ شوق رکھتے ہیں۔ ¤ ➋ یہ آیت رسول اللہ صلی اللہ علیہ وسلم کے اللہ کا سچا رسول ہونے کی بھی زبردست دلیل ہے۔ اس میں بتایا ہے کہ رسالت اور نبوت محض اللہ تعالیٰ کا انتخاب ہے، وہ جنھیں چنتا ہے انھیں بھی خبر نہیں ہوتی کہ ہمیں اتنی بڑی نعمت ملے گی۔ یہ نبوت کے جھوٹے دعوے داروں کا طریقہ ہوتا ہے کہ وہ پہلے ہی اپنی نبوت کا اشتہار شروع کر دیتے ہیں۔ اس سورت میں اس سے پہلے موسیٰ علیہ السلام کو نبوت ملنے کا ذکر ہے، وہ معاملہ بھی اچانک ہوا۔ موسیٰ علیہ السلام کو اس کا وہم و گمان تک نہ تھا۔ رسول اللہ صلی اللہ علیہ وسلم کے پاس بھی جبریل علیہ السلام غار حرا میں اچانک آئے۔ اللہ تعالیٰ نے اس بات کو رسول اللہ صلی اللہ علیہ وسلم کے سچا رسول ہوونے کی دلیل کے طور پر کئی جگہ بیان فرمایا ہے کہ ایک اُمّی شخص، جس کی عمر کے چالیس سال سب کے سامنے گزرے، جو نہ لکھنا جانتا تھا نہ پڑھنا، اگرچہ صدق و امانت اور اخلاق حمیدہ سے پہلے بھی متصف تھا، مگر نہ کسی کے خیال میں یہ بات تھی نہ خود اس کے دل میں یہ امید تک پیدا ہوئی تھی کہ اسے ایسی کتاب عطا کی جائے گی جس کی ایک سورت کی مثل اللہ کے سوا پوری کائنات جمع ہو کر بھی نہیں لا سکے گی۔ چنانچہ دوسری جگہ فرمایا : «{ وَ كَذٰلِكَ اَوْحَيْنَاۤ اِلَيْكَ رُوْحًا مِّنْ اَمْرِنَا مَا كُنْتَ تَدْرِيْ مَا الْكِتٰبُ وَ لَا الْاِيْمَانُ وَ لٰكِنْ جَعَلْنٰهُ نُوْرًا نَّهْدِيْ بِهٖ مَنْ نَّشَآءُ مِنْ عِبَادِنَا وَ اِنَّكَ لَتَهْدِيْۤ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ }» [ الشورٰی : ۵۲ ] ’’اور اسی طرح ہم نے تیری طرف اپنے حکم سے ایک روح کی وحی کی، تو نہیں جانتا تھا کہ کتاب کیا ہے اور نہ یہ کہ ایمان کیا ہے اور لیکن ہم نے اسے ایک ایسی روشنی بنا دیا ہے جس کے ساتھ ہم اپنے بندوں میں سے جسے چاہتے ہیں راہ دکھا تے ہیں اور بلاشبہ تو یقینا سیدھے راستے کی طرف رہنمائی کرتا ہے۔‘‘ ایک جگہ یہ صراحت فرمائی کہ یہ غیب کی خبریں، جو ہم آپ کو وحی کر رہے ہیں، اس سے پہلے نہ آپ جانتے تھے نہ آپ کی قوم، فرمایا : «{ تِلْكَ مِنْ اَنْۢبَآءِ الْغَيْبِ نُوْحِيْهَاۤ اِلَيْكَ مَا كُنْتَ تَعْلَمُهَاۤ اَنْتَ وَ لَا قَوْمُكَ مِنْ قَبْلِ هٰذَا }» [ ھود : ۴۹ ] ’’یہ غیب کی خبروں سے ہے جنھیں ہم تیری طرف وحی کرتے ہیں، اس سے پہلے نہ تو انھیں جانتا تھا اور نہ تیری قوم۔‘‘ ¤ ➌ { فَلَا تَكُوْنَنَّ ظَهِيْرًا لِّلْكٰفِرِيْنَ :} اللہ تعالیٰ نے کتاب و نبوت عطا کرنے کی نعمت یاد دلانے کے بعد پانچ حکم دیے، پہلا یہ کہ آپ کی قوم قریش اور آپ کے بھائی بندوں اور رشتہ داروں میں سے جو لوگ دین کے معاملہ میں آپ کا ساتھ نہیں دے رہے، بلکہ مخالفت پر اتر آئے ہیں، آپ کسی صورت نہ ان کا ساتھ دیں نہ ان کی حمایت کریں۔"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) ➊ {وَ لَا يَصُدُّنَّكَ عَنْ اٰيٰتِ اللّٰهِ بَعْدَ اِذْ اُنْزِلَتْ اِلَيْكَ : ’’ وَ لَا يَص يَصُدُّنَّكَ ‘‘} صاد اور دال کے ضمہ کے ساتھ یہ لفظ پورے قرآن میں اسی مقام پر ہے، دوسری تمام جگہوں میں دال کے فتحہ کے ساتھ ہے۔ یہ نہی غائب جمع مذکر بانون تاکید ثقیلہ کا صیغہ ہے کہ تجھے ہر گز نہ روکیں۔ یہ دوسرا حکم ہے کہ اللہ تعالیٰ کی آیات نازل ہونے کے بعد کفار خواہ کتنی کوشش کریں، کتنی ایذا پہنچائیں، یا کتنا لالچ دیں، ان آیات پر عمل سے اور ان کی تبلیغ سے کسی صورت آپ کو روکنے نہ پائیں۔ یہی بات دوسری جگہ فرمائی: «{ يٰۤاَيُّهَا الرَّسُوْلُ بَلِّغْ مَاۤ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ وَ اِنْ لَّمْ تَفْعَلْ فَمَا بَلَّغْتتَ رِسَالَتَهٗ }» [ المائدۃ: ۶۷ ] ’’اے رسول! پہنچا دے جو کچھ تیری طرف تیرے رب کی جانب سے نازل کیا گیا ہے اور اگر تو نے نہ کیا تو تو نے اس کا پیغام نہیں پہنچایا۔‘‘ ¤ ➋ { وَ ادْعُ اِلٰى رَبِّكَ :} یہ تیسرا حکم ہے کہ اپنے رب کی طرف دعوت دیں، یعنی اللہ تعالیٰ کی توحید اور اس کے دین کی دعوت پورے زور و شور سے دیتے رہیں، جس میں کوئی کمی یا کوتاہی نہ ہو، جیسا کہ دوسری جگہ فرمایا : «{ قُلْ هٰذِهٖ سَبِيْلِيْۤ اَدْعُوْۤا اِلَى اللّٰهِ عَلٰى بَصِيْرَةٍ اَنَا وَ مَنِ اتَّبَعَنِيْ وَ سُبْحٰنَ اللّٰهِ وَ مَاۤ اَنَا مِنَ الْمُشْرِكِيْنَ }» [ یوسف : ۱۰۸ ] ’’کہہ دے یہی میرا راستہ ہے، میں اللہ کی طرف بلاتا ہوں، پوری بصیرت پر، میں اور وہ بھی جنھوں نے میری پیروی کی ہے اور اللہ پاک ہے اور میں شریک بنانے والوں سے نہیں ہوں۔‘‘ ¤ ➌ { وَ لَا تَكُوْنَنَّ مِنَ الْمُشْرِكِيْنَ :} یہ چوتھا حکم ہے کہ مشرکین سے ہر گز نہ ہوں۔"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) ➊ { وَ لَا تَدْعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ:} یہ پانچواں حکم ہے کہ اللہ کے ساتھ کسی اور معبود کو مت پکار۔ یہ پانچوں حکم ہر انسان کے لیے ہیں، مگر آپ کو مخاطب کرنے سے ایک تو آپ کے لیے ان احکام کی تاکید مراد ہے اور ایک یہ کہ سنایا آپ کو جا رہا ہے مگر خبردار دوسرے تمام لوگوں کو کیا جا رہا ہے۔ کیونکہ آپ صلی اللہ علیہ وسلم تو ان احکام پر عمل کر ہی رہے تھے اور اللہ تعالیٰ کے آپ کو رسالت کے لیے چن لینے کے بعد آپ سے شرک کا امکان ہی نہیں تھا، جیسا کہ دوسری جگہ یہی بات بہت سخت لہجے میں کہی گئی ہے : «{ قُلْ اَفَغَيْرَ اللّٰهِ تَاْمُرُوْٓنِّيْۤ اَعْبُدُ اَيُّهَا الْجٰهِلُوْنَ (64) وَ لَقَدْ اُوْحِيَ اِلَيْكَ وَ اِلَى الَّذِيْنَ مِنْ قَبْلِكَ لَىِٕنْ اَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَ لَتَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ }» [ الزمر : ۶۴، ۶۵ ] ’’کہہ دے پھر کیا تم مجھے غیراللہ کے بارے میں حکم دیتے ہو کہ میں (ان کی) عبادت کروں اے جاہلو! اور بلاشبہ یقینا تیری طرف وحی کی گئی اور ان لوگوں کی طرف بھی جو تجھ سے پہلے تھے کہ بلاشبہ اگر تو نے شریک ٹھہرایا تو یقینا تیرا عمل ضرور ضائع ہو جائے گا اور تو ضرور بالضرور خسارہ اٹھانے والوں سے ہو جائے گا۔‘‘ مقصد یہ ہے کہ جب اس مسئلے میں کسی پیغمبر کے لیے کوئی رعایت نہیں تو کسی اور کے لیے کیا ہو گی۔ ¤ ➋ { لَاۤ اِلٰهَ اِلَّا هُوَ :} یہ وہ جملہ ہے جو اسلام کی دعوت کا خلاصہ ہے۔ قرآن مجید کی اکثر سورتوں کا آغاز بھی شرک کی تردید اور توحید کی دعوت سے ہوتا ہے اور اختتام بھی۔ یہاں اس دعوے کی تین دلیلیں بیان فرمائی ہیں۔ ¤ ➌ { كُلُّ شَيْءٍ هَالِكٌ اِلَّا وَجْهَهٗ :} یہ اس بات کی پہلی دلیل ہے کہ اللہ کے سوا کوئی عبادت کے لائق نہیں، کیونکہ وہی ہے جو دائم، باقی اور حی قیوم ہے۔ اس کے سوا سب کو مرنا ہے، سب فانی ہیں۔ ابن عباس رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کہا کرتے تھے : [ أَعُوْذُ بِعِزَّتِكَ الَّذِيْ لاَ إِلٰهَ إِلاَّ أَنْتَ الَّذِيْ لاَ يَمُوْتُ، وَالْجِنُّ وَالْإِنْسُ يَمُوْتُوْنَ ] [ بخاري، التوحید، باب قول اللہ تعالٰی : «و ھو العزیز الحکیم … » : ۷۳۸۳ ]’’میں تیری عزت کی پناہ چاہتا ہوں، تُو وہ ہے کہ تیرے سوا کوئی عبادت کے لائق نہیں اور تو کبھی نہیں مرتا، جبکہ جن اور انسان مر جاتے ہیں۔‘‘ اللہ تعالیٰ نے دوسری جگہ فرمایا : «{ كُلُّ مَنْ عَلَيْهَا فَانٍ (26) وَّ يَبْقٰى وَجْهُ رَبِّكَ ذُو الْجَلٰلِ وَ الْاِكْرَامِ}» [ الرحمٰن : ۲۶، ۲۷ ] ’’ہر ایک جو اس( زمین)پر ہے، فنا ہونے والا ہے اور تیرے رب کا چہرہ باقی رہے گا، جو بڑی شان اور عزت والا ہے۔‘‘ اور ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَصْدَقُ كَلِمَةٍ قَالَهَا الشَّاعِرُ كَلِمَةُ لَبِيْدٍ : أَلاَ كُلُّ شَيْءٍ مَا خَلاَ اللّٰهَ بَاطِلٌ ] [بخاري، مناقب الأنصار، باب أیام الجاہلیۃ : ۳۸۴۱ ] ’’سب سے سچی بات جو کسی شاعر نے کہی لبید کی بات ہے کہ سن لو! اللہ کے سوا ہر چیز باطل ہے۔‘‘ ¤ ➍ { لَهُ الْحُكْمُ :} یہ اللہ تعالیٰ کے معبودِ واحد ہونے کی دوسری دلیل ہے کہ کائنات میں اسی کا حکم جاری و ساری ہے، اس کے سوا {’’ كُنْ‘‘} کا اختیار کسی کے پاس نہیں۔ ¤ ➎ { وَ اِلَيْهِ تُرْجَعُوْنَ :} یہ توحید کی تیسری دلیل ہے کہ تمام لوگوں کو اسی کے پاس واپس جانا اور اسی کے سامنے پیش ہونا ہے۔ دوسرے سب توخود پیش ہونے والے ہیں، پھر وہ معبود کیسے بن گئے۔"
    }
  ]
}