{
  "surah": "Al-Imran",
  "surah_number": 3,
  "tafsir": [
    {
      "Ayah": 1,
      "tafsir": "سورۂ آل عمران کی فضیلت سورۂ بقرہ کی فضیلت کے ساتھ بیان ہو چکی ہے۔ اس سورت کے مدنی ہونے پر مفسرین کا اتفاق ہے اور اس کی دلیل یہ ہے کہ اس کی پہلی ۸۳ آیتیں وفد نجران کے بارے میں نازل ہوئی ہیں جو ۹ ھ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تھا۔ (فتح القدیر) مگر ابن عاشور کی تحقیق یہ ہے کہ یہ وفد تقریباً ۳ ھ میں آیا ہے، کیونکہ اس پر اتفاق ہے کہ یہ سورت مدنی سورتوں کی ابتدائی سورتوں میں سے ہے۔ نزول کے اعتبار سے کل سورتوں میں اس کا نمبر ۴۸ واں ہے۔ ۹ ھ میں نازل ہونے کا دعویٰ کرنے والوں کی غلطی کا باعث یہ ہے کہ وفود اس سال آئے تھے، جبکہ وفد نجران پہلے آ چکا تھا۔ [التحریر والتنویر] یہ وفد ساٹھ سواروں پر مشتمل تھا، جن میں چودہ ان کے معزز افراد بھی شامل تھے۔ تین آدمی ان سب میں نمایاں حیثیت رکھتے تھے۔ ان کا امیر عاقب تھا جس کا نام عبد المسیح تھا۔ دوسرا ’’سید‘‘ تھا اس کا نام الایہم تھا، یہ اس کا مشیر اور بہت سمجھدار تھا۔ تیسرا ابوحارثہ بن علقمہ الکبریٰ تھا، یہ ان کا لاٹ پادری تھا۔ ان سے دوسری باتوں کے علاوہ مسیح علیہ السلام کے خدا ہونے پر بھی رسول اللہ صلی اللہ علیہ وسلم کا مناظرہ ہوا۔ آپ نے فرمایا : ’’مسیح فنا ہو جائے گا اور اللہ تعالیٰ ہی ’’ حی ‘‘ یعنی ہمیشہ زندہ ہے اور رہے گا۔‘‘ آپ نے یہ اور دوسرے دلائل پیش کیے جس پر وہ خاموش ہو گئے، اس پر یہ سورت نازل ہوئی۔ بقیہ تفصیل کے لیے دیکھیے آیت مباہلہ ’’۶۱‘‘۔ (معالم، ابن کثیر) ¤ (آیت 1){ الٓمَّۤ۔} حروف مقطعات کی تشریح سورۂ بقرہ کی ابتدا میں گزر چکی ہے۔"
    },
    {
      "Ayah": 2,
      "tafsir": "(آیت2) ➊ { اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ:} یہ اس سورت کا دعویٰ ہے اور وفد نجران کو دعوت کی مناسبت سے اس کے اثبات پر زور دیا گیا ہے۔ ¤ ➋ { الْحَيُّ الْقَيُّوْمُ:} یہ اسمائے حسنیٰ اللہ تعالیٰ کی صفات ہیں۔ حیات اور قیومیت اللہ تعالیٰ کی صفات ذاتیہ میں سے ہیں۔ وہ ہمیشہ سے ہے اور ہمیشہ رہے گا، اسے موت اور فنا نہیں۔ {”الْقَيُّوْمُ“} کا مطلب ہے ساری کائنات قائم رکھنے والا، محافظ اور نگران، ساری کائنات اس کی محتاج وہ کسی کا محتاج نہیں۔ عیسائی عیسیٰ علیہ السلام کو اللہ یا اللہ کا بیٹا یا تین میں سے ایک مانتے تھے۔ گویا ان سے کہاجا رہا ہے کہ جب عیسیٰ علیہ السلام اللہ کی مخلوق ہیں، وہ ماں کے پیٹ سے پیدا ہوئے ہیں اور ان کی پیدائش کا زمانہ بھی کائنات کے پیدا ہونے سے بہت بعد کا ہے، پھر ان پر موت بھی آئے گی اور عیسائیوں کے بقول تو ان پر موت آ چکی، تو جب نہ ان کی حیات ہمیشہ، نہ انھیں قیومیت حاصل تو وہ اللہ یا اللہ کا بیٹا کیسے بن گئے؟"
    },
    {
      "Ayah": 3,
      "tafsir": "(آیت 4،3) ➊ یہاں { ”الْكِتٰبَ“ } سے مراد قرآن مجید ہے، گویا کتاب کامل یہی ہے۔ الف لام عہد کا ہونے کی مناسبت سے ’’یہ کتاب‘‘ ترجمہ کیا ہے۔{ ’’ نَزَّلَ ‘‘ } کا معنی آہستہ آہستہ اتارنا ہے۔ دوسری آسمانی کتابوں کے برعکس قرآن تیئیس(۲۳) برس میں مکمل نازل ہوا۔ اس کی حکمتوں کے لیے دیکھیے سورۂ فرقان (۳۲)۔ {”بِالْحَقِّ“} سے اس  کا سچا اور اللہ کی طرف سے نازل شدہ ہونا مراد ہے۔ ¤ ➋ { مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ:} اس کے پہلی کتابوں کی تصدیق کرنے کا مطلب یہ ہے کہ پہلی کتابوں میں جو خبریں اور بشارتیں مذکور ہیں اس میں بھی وہی خبریں اور بشارتیں ہیں، اگر یہ اللہ کی طرف سے نہ ہوتیں تو ان میں بہت اختلاف ہوتا۔ ایک خبر یہ تھی کہ اللہ تعالیٰ محمد صلی اللہ علیہ وسلم کو آخری رسول بنا کر بھیجے گا اور بشارت یہ تھی کہ اللہ تعالیٰ ان پر قرآن نازل فرمائے گا۔ تفصیل کے لیے دیکھیے سورۂ اعراف (۱۵۷) اور سورۂ صف (۶) تو جب تم ان کتابوں کو مانتے ہو جن کی تصدیق ہو رہی ہے تو تصدیق کرنے والی کتاب کو بھی مانو۔ ( ابن کثیر، رازی) ¤ ➌ { وَ اَنْزَلَ التَّوْرٰىةَ وَ الْاِنْجِيْلَ:} تورات سے مراد وہ کتاب ہے جو موسیٰ علیہ السلام پر نازل کی گئی اور انجیل سے مراد وہ کتاب ہے جو عیسیٰ علیہ السلام پر نازل کی گئی۔ اس وقت یہ دونوں کتابیں اصل شکل میں موجود نہیں ہیں۔ تورات بائبل کے عہد قدیم کی پہلی پانچ کتابوں کا نام ہے اور انجیل بائبل کے عہد جدید کی پہلی چار کتابوں میں متفرق طور پر درج ہے۔ یہود و نصاریٰ نے انھیں بڑی حد تک بدل ڈالا ہے اور ان میں اپنی طرف سے تشریحات ملا کر خلط ملط کر دیا ہے۔ یہ کتابیں پہلے زمانے میں لوگوں کے لیے ہدایت کا کام کرتی تھیں، مگر جب ان کے اندر باطل شامل ہو گیا تو اللہ تعالیٰ نے صحیح اور غلط میں فرق کرنے والی کتاب قرآن مجید اتاری اور اسی لحاظ سے اس کا نام {’’ الْفُرْقَانَ ‘‘} رکھا۔ اب اسے سچا مانے بغیر ہدایت حاصل کرنے کا کوئی اور ذریعہ نہیں۔ اس میں نازل شدہ آیات کا انکار کرنے والوں کے لیے بہت سخت عذاب ہے اور اللہ پر یہ کچھ مشکل نہیں، وہ سب پر غالب بھی ہے اور انتقام لینے والا بھی ہے۔"
    },
    {
      "Ayah": 4,
      "tafsir": "(آیت 4،3) ➊ یہاں { ”الْكِتٰبَ“ } سے مراد قرآن مجید ہے، گویا کتاب کامل یہی ہے۔ الف لام عہد کا ہونے کی مناسبت سے ’’یہ کتاب‘‘ ترجمہ کیا ہے۔{ ’’ نَزَّلَ ‘‘ } کا معنی آہستہ آہستہ اتارنا ہے۔ دوسری آسمانی کتابوں کے برعکس قرآن تیئیس(۲۳) برس میں مکمل نازل ہوا۔ اس کی حکمتوں کے لیے دیکھیے سورۂ فرقان (۳۲)۔ {”بِالْحَقِّ“} سے اس  کا سچا اور اللہ کی طرف سے نازل شدہ ہونا مراد ہے۔ ¤ ➋ { مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ:} اس کے پہلی کتابوں کی تصدیق کرنے کا مطلب یہ ہے کہ پہلی کتابوں میں جو خبریں اور بشارتیں مذکور ہیں اس میں بھی وہی خبریں اور بشارتیں ہیں، اگر یہ اللہ کی طرف سے نہ ہوتیں تو ان میں بہت اختلاف ہوتا۔ ایک خبر یہ تھی کہ اللہ تعالیٰ محمد صلی اللہ علیہ وسلم کو آخری رسول بنا کر بھیجے گا اور بشارت یہ تھی کہ اللہ تعالیٰ ان پر قرآن نازل فرمائے گا۔ تفصیل کے لیے دیکھیے سورۂ اعراف (۱۵۷) اور سورۂ صف (۶) تو جب تم ان کتابوں کو مانتے ہو جن کی تصدیق ہو رہی ہے تو تصدیق کرنے والی کتاب کو بھی مانو۔ ( ابن کثیر، رازی) ¤ ➌ { وَ اَنْزَلَ التَّوْرٰىةَ وَ الْاِنْجِيْلَ:} تورات سے مراد وہ کتاب ہے جو موسیٰ علیہ السلام پر نازل کی گئی اور انجیل سے مراد وہ کتاب ہے جو عیسیٰ علیہ السلام پر نازل کی گئی۔ اس وقت یہ دونوں کتابیں اصل شکل میں موجود نہیں ہیں۔ تورات بائبل کے عہد قدیم کی پہلی پانچ کتابوں کا نام ہے اور انجیل بائبل کے عہد جدید کی پہلی چار کتابوں میں متفرق طور پر درج ہے۔ یہود و نصاریٰ نے انھیں بڑی حد تک بدل ڈالا ہے اور ان میں اپنی طرف سے تشریحات ملا کر خلط ملط کر دیا ہے۔ یہ کتابیں پہلے زمانے میں لوگوں کے لیے ہدایت کا کام کرتی تھیں، مگر جب ان کے اندر باطل شامل ہو گیا تو اللہ تعالیٰ نے صحیح اور غلط میں فرق کرنے والی کتاب قرآن مجید اتاری اور اسی لحاظ سے اس کا نام {’’ الْفُرْقَانَ ‘‘} رکھا۔ اب اسے سچا مانے بغیر ہدایت حاصل کرنے کا کوئی اور ذریعہ نہیں۔ اس میں نازل شدہ آیات کا انکار کرنے والوں کے لیے بہت سخت عذاب ہے اور اللہ پر یہ کچھ مشکل نہیں، وہ سب پر غالب بھی ہے اور انتقام لینے والا بھی ہے۔"
    },
    {
      "Ayah": 5,
      "tafsir": "(آیت 6،5) ➊ یہ دونوں آیات اللہ تعالیٰ کے « عَزِيْزٌ ذُو انْتِقَامِ » ہونے کے لیے بھی دلیل ہیں اور سورت کے دعویٰ « اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ » کے لیے بھی۔ یہاں پہلے بتایا گیا کہ اللہ تعالیٰ کو آسمان و زمین کی ہر بڑی اور چھوٹی، ظاہر اور پوشیدہ چیز کا علم ہے، حالانکہ وہ عرش معلیٰ پر ہے اور پھر اس طرف اشارہ کیا کہ عیسیٰ علیہ السلام اللہ تعالیٰ  کے ایک بندے ہیں۔ جس طرح دوسرے انسانوں کو اللہ تعالیٰ نے ماں کے پیٹ میں پیدا کیا اسی طرح عیسیٰ علیہ السلام کو ماں کے پیٹ میں جیسے چاہا پیدا کیا، پھر وہ خدا یا خدا کا بیٹا کیسے ہو سکتا ہے، جیسا کہ نصرانیوں کا غلط عقیدہ ہے۔ ¤ ➋ {هُوَ الَّذِيْ يُصَوِّرُكُمْ فِي الْاَرْحَامِ كَيْفَ يَشَآءُ:} یعنی مذکر و مؤنث، سرخ یا سیاہ، کامل یا ناقص اور خوش قسمت یا بدقسمت، حتیٰ کہ عمر اور رزق بھی اسی وقت لکھ دیا جاتا ہے، جیسا کہ متعدد احادیث میں مذکور ہے۔ [دیکھیے بخاری، بدء الخلق، باب ذکر الملائکۃ : ۳۲۰۸] آخر میں پھر وہی دعویٰ {”لَاۤ اِلٰهَ اِلَّا هُوَ“} والا دہرا دیا اور اس کی مزید دلیلیں بھی دیں کہ کائنات کا یہ سارا سلسلہ اس اکیلے کے غلبہ و قوت اور حکمت و دانائی کے ساتھ چل رہا ہے، اس کے سوا کسی میں یہ صفات نہیں، سو عبادت بھی صرف اسی کا حق ہے، وہ نہ مسیح کا حق ہے، نہ ان کی والدہ کا اور نہ کسی اور کا۔"
    },
    {
      "Ayah": 6,
      "tafsir": "(آیت 6،5) ➊ یہ دونوں آیات اللہ تعالیٰ کے « عَزِيْزٌ ذُو انْتِقَامِ » ہونے کے لیے بھی دلیل ہیں اور سورت کے دعویٰ « اللّٰهُ لَاۤ اِلٰهَ اِلَّا هُوَ » کے لیے بھی۔ یہاں پہلے بتایا گیا کہ اللہ تعالیٰ کو آسمان و زمین کی ہر بڑی اور چھوٹی، ظاہر اور پوشیدہ چیز کا علم ہے، حالانکہ وہ عرش معلیٰ پر ہے اور پھر اس طرف اشارہ کیا کہ عیسیٰ علیہ السلام اللہ تعالیٰ  کے ایک بندے ہیں۔ جس طرح دوسرے انسانوں کو اللہ تعالیٰ نے ماں کے پیٹ میں پیدا کیا اسی طرح عیسیٰ علیہ السلام کو ماں کے پیٹ میں جیسے چاہا پیدا کیا، پھر وہ خدا یا خدا کا بیٹا کیسے ہو سکتا ہے، جیسا کہ نصرانیوں کا غلط عقیدہ ہے۔ ¤ ➋ {هُوَ الَّذِيْ يُصَوِّرُكُمْ فِي الْاَرْحَامِ كَيْفَ يَشَآءُ:} یعنی مذکر و مؤنث، سرخ یا سیاہ، کامل یا ناقص اور خوش قسمت یا بدقسمت، حتیٰ کہ عمر اور رزق بھی اسی وقت لکھ دیا جاتا ہے، جیسا کہ متعدد احادیث میں مذکور ہے۔ [دیکھیے بخاری، بدء الخلق، باب ذکر الملائکۃ : ۳۲۰۸] آخر میں پھر وہی دعویٰ {”لَاۤ اِلٰهَ اِلَّا هُوَ“} والا دہرا دیا اور اس کی مزید دلیلیں بھی دیں کہ کائنات کا یہ سارا سلسلہ اس اکیلے کے غلبہ و قوت اور حکمت و دانائی کے ساتھ چل رہا ہے، اس کے سوا کسی میں یہ صفات نہیں، سو عبادت بھی صرف اسی کا حق ہے، وہ نہ مسیح کا حق ہے، نہ ان کی والدہ کا اور نہ کسی اور کا۔"
    },
    {
      "Ayah": 7,
      "tafsir": "(آیت 7) ➊ ایک جگہ قرآن مجید کی تمام آیات کو محکم کہا گیا ہے، چنانچہ فرمایا : «الٓرٰ كِتٰبٌ اُحْكِمَتْ اٰيٰتُهٗ» [ھود : ۱ ] ’’{ الٓرٰ} ، ایک کتاب ہے جس کی آیات محکم کی گئیں۔‘‘ اور دوسری جگہ تمام آیات کو متشابہ، چنانچہ فرمایا : «اَللّٰهُ نَزَّلَ اَحْسَنَ الْحَدِيْثِ كِتٰبًا مُّتَشَابِهًا » [الزمر : ۲۳ ] ’’اللہ نے سب سے اچھی بات نازل فرمائی، ایسی کتاب جو آپس میں ملتی جلتی ہے۔‘‘ اور یہاں بعض آیات کو متشابہ قرار دیا ہے، بعض کو محکم، مگر اس میں کوئی تعارض نہیں۔ تمام آیات کے محکم ہونے کا مطلب یہ ہے کہ پورے قرآن میں کوئی کمی یا خرابی نہیں، نہایت مضبوط اور محکم ہے اور متشابہ ہونے کا مطلب یہ ہے کہ اس کی تمام آیات فصاحت و بلاغت اور مضامین و معانی میں ایک دوسری سے ملتی جلتی ہیں۔ اس جگہ جو فرمایا کہ بعض محکم ہیں اور بعض متشابہ، تو محکمات سے مراد وہ آیات ہیں جن کا مفہوم بالکل واضح اور صریح ہے، ان میں کسی قسم کی تاویل کی گنجائش نہیں ان کو {’’ اُمُّ الْكِتٰبِ ‘‘} قرار دیا ہے، یعنی اصل اور بنیاد۔ انھی آیات میں لوگوں کو دین کی طرف دعوت دی گئی ہے اور انھی میں دین کے بنیادی عقائد، عبادات اور احکام بیان کیے گئے ہیں۔ قرآن مجید میں مذکور نصیحتیں اور عبرتیں بھی ان میں شامل ہیں، انسانی گمراہیوں کی نشاندہی بھی ان آیات میں کی گئی ہے۔ جبکہ متشابہات سے مراد وہ آیات ہیں جو ملتے جلتے کئی معانی کا احتمال رکھتی ہیں، اس لیے ان کا اصل مرادی معنی سمجھنے میں لوگوں کو اشتباہ ہو جاتا ہے، یا ان میں تاویل کی گنجائش نکل سکتی ہے، یا جن میں ایسے حقائق کا بیان ہے جن پر مجمل طور پر ایمان لانا تو ضروری ہے لیکن ان کی تفصیلات کو جاننا نہ انسان کے لیے ضروری ہے اور نہ عقلی استعداد کے ساتھ ممکن ہے۔ تفسیر وحیدی میں لکھا ہے : ’’صفاتِ الٰہیہ کے منکرین تو اللہ تعالیٰ کے استواء (عرش پر ہونے کو) اور اس کے ید (ہاتھ) اور اس کے نزول (ہر رات آسمان دنیا پر اور قیامت کے دن زمین پر اترنے) کو متشابہات قرار دے کر ان کے معنی سمجھنے ہی کو ناممکن قرار دیتے ہیں، مگر اہل حدیث انھیں محکم مانتے ہیں، ان کے معانی کو واضح سمجھتے ہیں، البتہ کیفیت کو اللہ کے سپرد کرتے ہیں۔‘‘ ¤ ➋ اس آیت میں نصاریٰ کو بھی تنبیہ ہے کہ وہ عیسیٰ علیہ السلام سے متعلق { ”كَلِمَتُهٗ“ } اور { ”رُوْحٌ مِّنْهُ“ } وغیرہ آیات سے عیسیٰ علیہ السلام کے الٰہ ہونے اور اللہ کا بیٹا ہونے پر تو استدلال کرتے ہیں مگر دوسری آیات : « اِنْ هُوَ اِلَّا عَبْدٌ اَنْعَمْنَا عَلَيْهِ » [الزخرف : ۵۹ ] ’’ نہیں ہے وہ مگر ایک بندہ جس پر ہم نے انعام کیا۔‘‘ اور «اِنَّ مَثَلَ عِيْسٰى عِنْدَ اللّٰهِ كَمَثَلِ اٰدَمَ» [آل عمران : ۵۹ ] ’’بے شک عیسیٰ کی مثال اللہ کے نزدیک آدم کی مثال کی طرح ہے ‘‘ ان پر اور ان جیسی دیگر آیات پر دھیان نہیں دیتے۔ ( ابن کثیر) ¤ ➌ { فَاَمَّا الَّذِيْنَ فِيْ قُلُوْبِهِمْ زَيْغٌ :} یعنی وہ لوگ جن کے دلوں میں کجی ہے اور جن کا مشغلہ ہی محض فتنہ جوئی ہوتا ہے وہ محکمات کو چھوڑ کر متشابہات کے پیچھے پڑتے ہیں اور چونکہ وہ کئی معانی کا احتمال رکھتی ہیں اس لیے وہ ان سے وہ معنی نکالتے ہیں جو قرآن کی صیح اور محکم آیات کے خلاف ہوتے ہیں، فتنے کی تلاش کے لیے اور اپنے خیال میں اس کی اصل مراد تلاش کرنے کے لیے۔ ام المومنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اس آیت کو { ”اُولُوا الْاَلْبَابِ“ } تک پڑھا اور پھر فرمایا : ’’جب تم ان لوگوں کو دیکھو جو متشابہات کے پیچھے پڑتے ہیں تو سمجھ لو کہ یہ وہی لوگ ہیں جن کا اللہ تعالیٰ نے نام لیا ہے، سو تم ان سے بچو۔‘‘ [بخاری، التفسیر، باب : «منہ آیات محکمات » : ۴۵۴۷ ] ¤ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’قرآن میں جھگڑنا کفر ہے۔‘‘ [أبو داوٗد، السنۃ، باب النہی عن الجدال : ۴۶۰۳، عن أبی ہریرۃ رضی اللہ عنہ ، صحیح ] پس ضروری ہے کہ قرآن کا جو حصہ محکم ہے اس پر عمل کیا جائے اور جو متشابہ ہے اس پر جوں کا توں ایمان رکھا جائے اور تفصیلات سے بحث نہ کی جائے۔ (فتح البیان، ابن کثیر) ¤ ➍ {وَ مَا يَعْلَمُ تَاْوِيْلَهٗۤ اِلَّا اللّٰهُ:} اکثر ائمہ لفظ { ”اللّٰهُ“ } پر وقف کر کے { ”وَ الرّٰسِخُوْنَ فِي الْعِلْمِ“ } سے نیا کلام شروع سمجھتے ہیں، یعنی متشابہات کی اصل مراد اللہ کے سوا کوئی نہیں جانتا اور راسخ فی العلم لوگ کہتے ہیں کہ محکم و متشابہ سب ہمارے رب کی طرف سے ہیں، ہم متشابہات کی اصل مراد نہ جانتے ہوئے بھی ان کے من عند اللہ ہونے پر ایمان رکھتے ہیں جبکہ کچھ ائمہ کا کہنا ہے : { ”وَ الرّٰسِخُوْنَ فِي الْعِلْمِ“ } کا لفظ { ”اللّٰهُ“ } پر عطف ہے، یعنی اہل زیغ متشابہ آیات کا پیچھا فتنے کی تلاش کے لیے اور ان سے فاسد معنی مراد لینے کے لیے کرتے ہیں اور ایسے معنی نکالتے ہیں جو قرآن وحدیث کی نصوص کے خلاف ہوتے ہیں، حالانکہ ان کا اصل معنی اللہ تعالیٰ جانتا ہے یا پختہ علم والے جو کہتے ہیں کہ ہم اس پر ایمان لائے، یہ سب ہمارے رب کی طرف سے ہے، اس لیے ان کا ایسا معنی مراد ہو ہی نہیں سکتا جو دوسری آیات و احادیث کے خلاف ہو۔ ¤ ➎ {وَ مَا يَذَّكَّرُ اِلَّاۤ اُولُوا الْاَلْبَابِ: ”الْاَلْبَابِ“ ’’ لُبٌّ ‘‘ } کی جمع ہے، جس کا معنی خالص عقل ہے۔ (راغب) جس عقل میں خواہش پرستی، بدعت یا شرک کی آمیزش ہو وہ {’’ لُبٌّ ‘‘} نہیں کہلاتی۔ مقصد یہ ہے کہ متشابہ کے اصل معنی تک رسائی کی توفیق اہل علم کو بھی ہوتی ہے مگر صرف ان اہل علم کو جن کی عقل ہر قسم کی خواہش پرستی، بدعت اور شرک سے پاک ہوتی ہے۔ حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ابن عباس رضی اللہ عنہما کے لیے دعا فرمائی : [ اَللَّهُمَّ فَقِّهْهُ فِي الدِّيْنِ وَ عَلِّمْهُ التَّأْوِيْلَ ]] ’’اے اللہ ! اسے دین میں سمجھ عطا فرما اور اسے تاویل کا علم عطا فرما۔‘‘ [مستدرک حاکم : 534/3، ح : ۶۲۸۰ مسند أحمد: 266/1، ح ۲۴۰۱، صحیح ] معلوم ہوا تاویل کا علم راسخ فی العلم لوگوں کو بھی ہوتا ہے۔ ¤ ➏ احسن البیان میں ہے، تاویل کے ایک معنی تو ہیں کسی چیز کی اصل حقیقت، اس معنی کے لحاظ سے {”اِلَّا اللّٰهُ“} پر وقف ضروری ہے، کیونکہ ہر چیز کی اصل حقیقت واضح طور پر اللہ تعالیٰ ہی جانتا ہے۔ تاویل کے دوسرے معنی ہیں، کسی چیز کی تفسیر اور بیان و توضیح، اس اعتبار سے{ ’’ اِلَّا اللّٰهُ ‘‘} پر وقف کے بجائے {’’ وَ الرّٰسِخُوْنَ فِي الْعِلْمِ ‘‘} پر بھی وقف کیا جا سکتا ہے، کیونکہ مضبوط علم والے بھی صحیح تفسیر و توضیح کا علم رکھتے ہیں۔ تاویل کے یہ دونوں معنی قرآن کریم کے استعمال سے ثابت ہیں۔ (ملخص از ابن کثیر)"
    },
    {
      "Ayah": 8,
      "tafsir": "(آیت 9،8)یہ وہ دعا ہے جو راسخ فی العلم حضرات اللہ تعالیٰ کے حضور کرتے رہتے ہیں، ہدایت پر ثابت قدمی کی دعا کے ساتھ قیامت کے دن اللہ کے سامنے پیش ہونے کا یقین بھی ہر وقت ان کے پیش نگاہ رہتا ہے، ان کی اصل کوشش اور دعا دنیا کے لیے نہیں بلکہ آخرت کے لیے ہوتی ہے۔ ام سلمہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم اکثر یہ دعا کیا کرتے تھے : [ يَا مُقَلِّبَ الْقُلُوْبِ ! ثَبِّتْ قَلْبِيْ عَلٰي دِيْنِكَ ] ’’اے دلوں کو پھیرنے والے! میرے دل کو اپنے دین پر ثابت رکھ۔‘‘ [ترمذی، الدعوات، باب دعاء یا مقلب القلوب ! … : ۳۵۲۲، وصححہ الألبانی ]"
    },
    {
      "Ayah": 9,
      "tafsir": "(آیت 9،8)یہ وہ دعا ہے جو راسخ فی العلم حضرات اللہ تعالیٰ کے حضور کرتے رہتے ہیں، ہدایت پر ثابت قدمی کی دعا کے ساتھ قیامت کے دن اللہ کے سامنے پیش ہونے کا یقین بھی ہر وقت ان کے پیش نگاہ رہتا ہے، ان کی اصل کوشش اور دعا دنیا کے لیے نہیں بلکہ آخرت کے لیے ہوتی ہے۔ ام سلمہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم اکثر یہ دعا کیا کرتے تھے : [ يَا مُقَلِّبَ الْقُلُوْبِ ! ثَبِّتْ قَلْبِيْ عَلٰي دِيْنِكَ ] ’’اے دلوں کو پھیرنے والے! میرے دل کو اپنے دین پر ثابت رکھ۔‘‘ [ترمذی، الدعوات، باب دعاء یا مقلب القلوب ! … : ۳۵۲۲، وصححہ الألبانی ]"
    },
    {
      "Ayah": 10,
      "tafsir": "(آیت 11،10) {”كَدَاْبِ اٰلِ فِرْعَوْنَ“} اس کی ترکیب کے لیے دیکھیے سورۂ انفال (۵۲، ۵۴) یعنی جس طرح کا عذاب قوم فرعون اور پہلی امتوں کو رسولوں کو جھٹلانے کی وجہ سے دیا گیا اسی طرح کا عذاب ان اموال و اولاد والے کفار کو دیا جائے گا۔ یہاں ان کفار سے مراد وفد نجران، یہود، مشرکین عرب اور دوسرے تمام کفار بھی ہو سکتے ہیں۔ (شوکانی)"
    },
    {
      "Ayah": 11,
      "tafsir": "(آیت 11،10) {”كَدَاْبِ اٰلِ فِرْعَوْنَ“} اس کی ترکیب کے لیے دیکھیے سورۂ انفال (۵۲، ۵۴) یعنی جس طرح کا عذاب قوم فرعون اور پہلی امتوں کو رسولوں کو جھٹلانے کی وجہ سے دیا گیا اسی طرح کا عذاب ان اموال و اولاد والے کفار کو دیا جائے گا۔ یہاں ان کفار سے مراد وفد نجران، یہود، مشرکین عرب اور دوسرے تمام کفار بھی ہو سکتے ہیں۔ (شوکانی)"
    },
    {
      "Ayah": 12,
      "tafsir": "(آیت 12){قُلْ لِّلَّذِيْنَ كَفَرُوْا … : } یہاں کافروں سے مراد یہودی ہیں۔ اس آیت کے نزول کے بعد بنو قریظہ کے قتل، بنو نضیر کے جلاوطن اور خیبر کے فتح ہو جانے سے قرآن کی یہ پیشین گوئی بحمد اللہ حرف بحرف سچ ثابت ہوئی۔ (شوکانی)"
    },
    {
      "Ayah": 13,
      "tafsir": "(آیت 13) ➊ {قَدْ كَانَ لَكُمْ اٰيَةٌ … :} یعنی اوپر جو پیشین گوئی (یہودی) کافروں کے مغلوب اور جہنم واصل ہونے کی ذکر ہوئی ہے اس کے سچ ہونے کے لیے معرکۂ بدر میں بہت بڑی آیت (دلیل) موجود تھی۔ ¤ ➋ {يَّرَوْنَهُمْ مِّثْلَيْهِمْ : } اس کے دو معنی ہو سکتے ہیں، ایک یہ کہ مسلمان کفار کو اپنے سے صرف دگنا دیکھ رہے تھے، حالانکہ وہ ان سے تین گنا تھے، تاکہ مسلمان ثابت قدم رہیں، چنانچہ مسلمانوں کو فتح حاصل ہوئی۔ دوسرا یہ کہ کفار مسلمانوں کو اپنے سے دگنا دیکھ رہے تھے، حالانکہ ان کی تعداد ایک ہزار کے قریب تھی اور مسلمان کل ۳۱۳ تھے، مگر مسلمان دگنا اس لیے نظرآتے تھے کہ اللہ تعالیٰ نے ان کی نصرت کے لیے فرشتے بھیج دیے تھے اور اللہ اپنی نصرت کے ساتھ جسے چاہے قوت بخشتا ہے۔ اکثر مفسرین نے پہلے معنی کو ترجیح دی ہے اور بعض نے دوسرے کو۔ (ابن کثیر، شوکانی) مزید دیکھیے سورۂ انفال (۴۳، ۴۴)۔"
    },
    {
      "Ayah": 14,
      "tafsir": "(آیت 14) ➊ { ”الشَّهَوٰتِ“ } یہ {’’ شَهْوَةٌ ‘‘} کی جمع ہے جس کا معنی ہے ’’کسی مرغوب چیز کی طرف نفس کا کھچ جانا‘‘ یہاں { ”الشَّهَوٰتِ“ } سے مراد وہ چیزیں ہیں جو طبیعت کو مرغوب ہیں، یعنی مصدر بمعنی اسم مفعول{ ’’ مُشْتَهَيَاتٌ ‘‘} ہے اور { ”مِنَ النِّسَآءِ“ } میں {’’مِنْ‘‘} بیانیہ ہے، یعنی وہ چیزیں یہ ہیں۔ { ”وَ الْقَنَاطِيْرِ“ } کا واحد{ ’’ قِنْطَارٌ ‘‘} ہے، اس کی مقدار میں مختلف اقوال ہیں، مگر سب کا حاصل یہ ہے کہ مال کثیر کو {’’ قِنْطَارٌ‘‘} کہا جاتا ہے۔ (ابن کثیر، شوکانی) ہماری زبان میں اس کا ترجمہ ’’خزانے‘‘ ہو سکتا ہے۔ { ”مَتَاعُ“ } اس سامان کو کہا جاتا ہے جس سے فائدہ حاصل کیا جائے۔ حاصل یہ کہ انسان ان چیزوں کی محبت میں پھنس کر اللہ اور اس کے دین سے غافل ہو جائے اور انھیں تفاخر و زینت کا ذریعہ سمجھے اور غرور وتکبر پر اتر آئے تو یہ تمام چیزیں مذموم ہیں، ورنہ اگر ان تمام چیزوں کو اللہ تعالیٰ کی طرف سے نعمت خیال کرتے ہوئے ذریعۂ آخرت بنایا جائے اور شریعت کی حدود میں رہ کر ان سے فائدہ اٹھایا جائے تو یہ مذموم و مبغوض نہیں بلکہ نہایت مرغوب و محمود ہیں۔ اصل چیز نیت اور عمل ہے، اس لیے حدیث میں ایک طرف تو رسول اللہ صلی اللہ علیہ وسلم کا ارشاد یہ ہے : ’’میرے بعد مردوں کے لیے کوئی فتنہ عورتوں سے بڑھ کر نقصان دہ نہیں۔‘‘ [بخاری، النکاح، باب ما یتقی من شؤم المرأۃ … : ۵۰۹۶، عن أسامۃ رضی اللہ عنہ ] اور دوسری طرف آپ صلی اللہ علیہ وسلم نے یہ فرمایا : ’’دنیا متاع (فائدہ اٹھانے کا سامان) ہے اور اس کی بہترین متاع نیک عورت ہے۔‘‘ [مسلم، النکاح، باب خیر متاع الدنیا … ۱۴۶۹، عن ابن عمرورضی اللہ عنہما] اور یہ بھی فرمایا : ’’دنیا میں سے عورت اور خوشبو میرے لیے پسندیدہ بنا دی گئی ہیں۔‘‘ [نسائی، عشرۃ النساء، باب حب النساء : ۳۳۹۱، عن أنس رضی اللہ عنہ، قال الألبانی حسن صحیح ] آیت کے آخر میں ان کو دنیاوی زندگی کا سامان قرار دے کر دنیاوی زندگی سے بے رغبتی اور آخرت میں رغبت پر زور دیا ہے۔ (ابن کثیر، شوکانی) ¤ ➋ { ”الْخَيْلِ}“ یہ اسم جمع ہے،{ ’’خُيَلاَءٌ ‘‘} سے مشتق ہے، جس کا معنی تکبر ہے۔ گھوڑے کی چال میں ایک طرح کا تکبر پایا جاتا ہے۔ { ”الْمُسَوَّمَةِ“ } یہ{’’سِيْمَا ‘‘} یا {’’سِيْمِيَاءُ ‘‘} سے مشتق ہو تو نشان لگائے ہوئے اور {’’ سَوْمٌ ‘‘ } سے مشتق ہو تو چرنے کے لیے چھوڑے ہوئے گھوڑے ۔ {”الْاَنْعَامِ“} یہ {’’نَعَمٌ ‘‘} کی جمع ہے، اونٹ، گائے، بکریاں وغیرہ اور اکثر اونٹوں پر بولا جاتا ہے۔"
    },
    {
      "Ayah": 15,
      "tafsir": "(آیت 15) دیکھیے سورۂ بقرہ کی آیت (۲۵) کی تفسیر۔ اس آیت میں مذکور لفظ { ”رِضْوَانٌ“ ’’ رَضِيَ يَرْضَي (س)‘‘} ناقص واوی سے مصدر ہے، اس کا مصدر {’’رِضًا ‘‘} بھی آتا ہے، مگر {”رِضْوَانٌ“} میں حروف زیادہ ہونے اور تنوین برائے تعظیم ہونے کی وجہ سے ترجمہ ’’عظیم خوشنودی ‘‘ کیا گیا ہے۔ حقیقت یہ ہے کہ یہ نعمت جنت کی تمام نعمتوں سے اعلیٰ ہے، اللہ نے فرمایا : «وَ رِضْوَانٌ مِّنَ اللّٰهِ اَكْبَرُ » [التوبۃ : ۷۲ ] ’’اور اللہ کی طرف سے تھوڑی سی خوشنودی سب سے بڑی ہے۔‘‘"
    },
    {
      "Ayah": 16,
      "tafsir": "(آیت 16) ➊ { اَلَّذِيْنَ يَقُوْلُوْنَ … :} یعنی اللہ تعالیٰ کے متقی بندے، جنھیں آخرت میں مذکورہ نعمتیں حاصل ہوں گی، وہ ہیں جو یہ دعا کرتے ہیں اور جن میں وہ صفات پائی جاتی ہیں جن کا اگلی آیت میں ذکر آ رہا ہے۔ ¤ ➋ { اِنَّنَاۤ اٰمَنَّا فَاغْفِرْ لَنَا:} اس دعا میں اپنے ایمان لانے کا ذکر کرکے اللہ تعالیٰ سے دعا کی گئی ہے، اس سے دعا کے لیے عمل کا وسیلہ پیش کرنا ثابت ہوتا ہے، جیسا کہ « اِيَّاكَ نَعْبُدُ وَ اِيَّاكَ نَسْتَعِيْنُ» میں ہے۔"
    },
    {
      "Ayah": 17,
      "tafsir": "(آیت 17) ➊ {”اَلصّٰبِرِيْنَ“} نیکی کرنے پر، گناہ سے بچنے پر، مصیبتیں آنے پر صبر کرنے والے۔ صبرر کی یہ تین قسمیں ہیں۔ {’’ وَ الصّٰدِقِيْنَ ‘‘ } نیت، قول اور فعل میں سچے، حکم ماننے والے، اپنا مال و جان، اپنی اولاد اور اللہ کی دی ہوئی ہر نعمت خرچ کرنے والے اور یہ سب کچھ کرنے کے باوجود سحریوں (رات کی آخری گھڑیوں) میں اپنی عبادت پر مغرور ہونے کی بجائے اپنی کوتاہیوں کے لیے استغفار کرنے والے۔ ¤ ➋ اس آیت سے خاص طور پر سحر (پچھلی رات) کے وقت استغفار کی فضیلت معلوم ہوتی ہے۔ (دیکھیے ذاریات : ۱۵ تا ۱۸) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ہمارا رب تبارک و تعالیٰ ہر رات آسمان دنیا پر اترتا ہے، جب رات کا آخری تہائی حصہ باقی رہ جاتا ہے، فرماتا ہے : ’’کون ہے جو مجھ سے دعا کرے تو میں اس کی دعا قبول کروں ؟ کون ہے جو مجھ سے مانگے تو میں اسے دوں ؟ کون ہے جو مجھ سے بخشش مانگے تو میں اسے بخشوں؟‘‘ [بخاری، التہجد، باب الدعاء … : ۱۱۴۵، عن أبی ہریرۃ رضی اللہ عنہ ]"
    },
    {
      "Ayah": 18,
      "tafsir": "(آیت 18) ➊ {شَهِدَ اللّٰهُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا هُوَ:} اللہ تعالیٰ کے ہاں معتبر دین اسلام ہے، جیسا کہ آئندہ آیت میں آ رہا ہے اور اسلام کی بنیاد توحید الٰہی پر ہے۔ اس حقیقت سے وفد نجران اور تمام دنیا کو آگاہ کیا جا رہا ہے۔ { ”شَهِدَ“ } کا معنی {’’ بَيَّنَ وَ اَعْلَمَ ‘‘} یعنی بیان کیا اور آگاہ کیا ہے۔ (فتح القدیر) شاہد وہ ہے جو اپنے یقینی علم کے ساتھ آگاہ کرے۔ یعنی اللہ تعالیٰ نے اپنی مخلوق اور ساری کائنات میں موجود بے شمار دلائل اور نشانیوں کے ساتھ اور اپنے رسولوں کے ذریعے سے پیغام بھیج کر شہادت دی اور آگاہ کیا ہے کہ اس کے سوا کوئی عبادت کے لائق نہیں، اس حال میں کہ وہ اپنی مخلوق کے تمام معاملات و احوال میں عدل پر قائم ہے اور اس سے بڑھ کر کس کی شہادت ہو سکتی ہے اور اس کے پاک فرشتوں اور اہل علم نے بھی یہ شہادت دی ہے۔ آیت کے آخر میں پھر وہی دعویٰ { ”لَاۤ اِلٰهَ اِلَّا هُوَ“ } دہرایا اور اس کی دو مزید دلیلیں پیش فرمائیں کہ وہ سب پر غالب اور کمال حکمت والا ہے، کوئی اس پر غالب نہیں اور کمال حکمت والا اس کے سوا کوئی نہیں۔ کوئی ہے تو لاؤ پیش کرو۔ ¤ ➋ { قَآىِٕمًۢا بِالْقِسْطِ:} یہ لفظ {”اللّٰهُ“} سے حال ہے۔"
    },
    {
      "Ayah": 19,
      "tafsir": "(آیت 19) ➊ اللہ تعالیٰ کے نزدیک دین صرف اسلام ہے، یعنی اپنے آپ کو اللہ کے احکام کے تابع کر دینا، جو اس کے رسول مختلف اوقات میں لے کر آتے رہے، حتیٰ کہ اللہ تعالیٰ نے ان سب کے آخر میں خاتم الانبیاء کو مبعوث فرمایا اور محمد صلی اللہ علیہ وسلم کے راستے کے سوا اپنے تک پہنچنے والے تمام راستوں کو بند کر دیا۔ اب اگر آپ صلی اللہ علیہ وسلم کی شریعت کے سوا کوئی اور دین لے کر اللہ کے پاس جائے گا تو وہ اس سے ہر گز قبول نہیں کیا جائے گا، فرمایا : «وَ مَنْ يَّبْتَغِ غَيْرَ الْاِسْلَامِ دِيْنًا فَلَنْ يُّقْبَلَ مِنْهُ» [آل عمران : ۸۵ ] ’’اور جو اسلام کے علاوہ کوئی اور دین تلاش کرے تو وہ اس سے ہر گز قبول نہ کیا جائے گا۔‘‘ ¤ اب جو شخص رسول اللہ صلی اللہ علیہ وسلم کی رسالت کا قائل نہیں اور نہ آپ کے بتائے ہوئے طریقے کے مطابق اپنا عمل اور عقیدہ ہی درست کرتا ہے تو اس کا دین اللہ کے ہاں معتبر نہیں، خواہ وہ توحید کا قائل اور دوسرے ایمانیات کا اقرار کرتا ہو۔ ¤ ➋ { وَ مَا اخْتَلَفَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ …: } یعنی اللہ تعالیٰ نے جتنے انبیاء بھیجے ان سب کا دین یہی اسلام تھا۔ اہل کتاب نے یہ حقیقت جان لینے کے بعد کہ دین حق اسلام ہی ہے اور محمد صلی اللہ علیہ وسلم اللہ کے سچے رسول اور آخری نبی ہیں، محض باہمی بغض و عناد کی بنا پر اسلام سے انحراف کیا ہے۔ آج بھی ان کے لیے صحیح روش یہی ہے کہ آپ صلی اللہ علیہ وسلم پر ایمان لے آئیں اور دین اسلام کو اختیار کریں۔ ¤ ➌ { سَرِيْعُ الْحِسَابِ:} یعنی اللہ تعالیٰ کی طرف سے جلد محاسبہ ہونے والا ہے اور آیاتِ الٰہی سے کفر کی سزا مل کر رہے گی۔"
    },
    {
      "Ayah": 20,
      "tafsir": "(آیت 20) ➊ { فَاِنْ حَآجُّوْكَ فَقُلْ اَسْلَمْتُ وَجْهِيَ لِلّٰهِ: } اسلام کی حقانیت اور رسول اللہ صلی اللہ علیہ وسلم کا صدق ثابت ہو جانے کے باوجود بھی اگر اہل کتاب کفر و عناد کی راہ اختیار کرتے ہیں تو آپ کہہ دیجیے کہ میں نے تو اپنا ظاہر و باطن اللہ کے سامنے جھکا دیا ہے اور یہی حال میری پیروی کرنے والے مسلمانوں کا بھی ہے اور اہل کتاب یہود و نصاریٰ اور اُمی لوگوں، یعنی مشرکین عرب، سب سے کہہ دیجیے کہ اگر تم اسلام لے آؤ گے تو صراط مستقیم پر گامزن ہو جاؤ گے اور اگر روگردانی کرو گے تو میرا کام صرف پیغام پہنچا دینا ہے اور حساب تو تمھیں اللہ ہی کو دینا ہو گا۔ ¤ ➋ اس آیت کے مطابق رسول اللہ صلی اللہ علیہ وسلم نے عرب و عجم کے تمام ملوک و امراء کو دعوتی خطوط لکھے اور اپنی عمومی رسالت کا اعلان کیا۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اس ذات کی قسم جس کے ہاتھ میں محمد( صلی اللہ علیہ وسلم ) کی جان ہے ! اس امت میں سے اگر کوئی بھی یہودی ہو یا نصرانی، وہ میرے بارے میں سنے اور اس پر ایمان نہ لائے جو دے کر مجھے بھیجا گیا ہے تو وہ اصحاب النار میں سے ہو گا۔‘‘ [مسلم، الإیمان، باب وجوب الإیمان برسالۃ … : ۱۵۳ ] اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھے سرخ و سیاہ (یعنی عرب و عجم) کی طرف بھیجا گیا ہے۔‘‘ [مسند أحمد : 145/5، ح : ۲۱۳۵۷، عن أبی ذر رضی اللہ عنہ ] ¤ نیز آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہر نبی کو خاص اس کی قوم کی طرف بھیجا جاتا تھا اور مجھے تمام لوگوں کی طرف بھیجا گیا ہے۔‘‘ [بخاری، التیمم، باب : ۳۳۵ ] آپ صلی اللہ علیہ وسلم کے قیامت تک اور تمام لوگوں کی طرف رسول ہونے پر کتاب و سنت میں بکثرت دلائل موجود ہیں۔ دیکھیے سورۂ اعراف (۱۵۸) اور سبا (۲۸) حتیٰ کہ جنوں کی طرف بھی۔ دیکھیے احقاف (۳۱)۔"
    },
    {
      "Ayah": 21,
      "tafsir": "(آیت 22،21){اِنَّ الَّذِيْنَ يَكْفُرُوْنَ … :} اس میں اہل کتاب کی مذمت ہے، جن کی پوری تاریخ شاہد ہے کہ انھوں نے نہ صرف احکام الٰہی پر عمل کرنے سے انکار کیا بلکہ انبیاء اور ان لوگوں کو قتل کرتے رہے جنھوں نے کبھی ان کے سامنے دعوت حق پیش کی اور یہ تکبر کی آخری حد ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جس شخص کے دل میں ذرہ برابر کبر ہو گا وہ جنت میں داخل نہیں ہو گا۔‘‘ ایک آدمی نے عرض کیا : ’’ایک آدمی پسند کرتا ہے کہ اس کا کپڑا خوبصورت ہو اور اس کا جوتا اچھا ہو۔ ‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’بے شک اللہ جمیل ہے اور جمال کو پسند کرتا ہے، تکبر تو حق کے انکار اور لوگوں کو حقیر سمجھنے کا نام ہے۔‘‘ [مسلم، الإیمان، باب تحریم الکبر و بیانہ : ۹۱، عن ابن مسعود رضی اللہ عنہ ] ¤ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’قیامت کے دن سب سے سخت عذاب اس شخص کو ہو گا جسے کسی نبی نے قتل کیا، یا جس نے کسی نبی کو قتل کیا ہو۔‘‘ [مسند أحمد : 407/1، ح : ۳۸۶۷، عن ابن مسعود رضی اللہ عنہ۔ الصحیحۃ: ۲۸۱ ]"
    },
    {
      "Ayah": 22,
      "tafsir": "(آیت 22،21){اِنَّ الَّذِيْنَ يَكْفُرُوْنَ … :} اس میں اہل کتاب کی مذمت ہے، جن کی پوری تاریخ شاہد ہے کہ انھوں نے نہ صرف احکام الٰہی پر عمل کرنے سے انکار کیا بلکہ انبیاء اور ان لوگوں کو قتل کرتے رہے جنھوں نے کبھی ان کے سامنے دعوت حق پیش کی اور یہ تکبر کی آخری حد ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جس شخص کے دل میں ذرہ برابر کبر ہو گا وہ جنت میں داخل نہیں ہو گا۔‘‘ ایک آدمی نے عرض کیا : ’’ایک آدمی پسند کرتا ہے کہ اس کا کپڑا خوبصورت ہو اور اس کا جوتا اچھا ہو۔ ‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’بے شک اللہ جمیل ہے اور جمال کو پسند کرتا ہے، تکبر تو حق کے انکار اور لوگوں کو حقیر سمجھنے کا نام ہے۔‘‘ [مسلم، الإیمان، باب تحریم الکبر و بیانہ : ۹۱، عن ابن مسعود رضی اللہ عنہ ] ¤ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’قیامت کے دن سب سے سخت عذاب اس شخص کو ہو گا جسے کسی نبی نے قتل کیا، یا جس نے کسی نبی کو قتل کیا ہو۔‘‘ [مسند أحمد : 407/1، ح : ۳۸۶۷، عن ابن مسعود رضی اللہ عنہ۔ الصحیحۃ: ۲۸۱ ]"
    },
    {
      "Ayah": 23,
      "tafsir": "(آیت 23){اَلَمْ تَرَ اِلَى الَّذِيْنَ اُوْتُوْا … :} اس آیت میں {”كِتٰبِ اللّٰهِ“} سے مراد تورات اور انجیل ہیں اور مطلب یہ ہے کہ جب انھیں خود ان کی کتابوں کی طرف دعوت دی جاتی ہے کہ چلو انھی کو حکم مان لو اور بتاؤ کہ ان میں رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے کا حکم دیا گیا ہے یا نہیں تو یہ اس سے بھی پہلو تہی کر جاتے ہیں اور ظاہر کرتے ہیں جیسے انھیں کسی چیز کا علم ہی نہیں۔"
    },
    {
      "Ayah": 24,
      "tafsir": "(آیت 24){ذٰلِكَ بِاَنَّهُمْ قَالُوْا لَنْ تَمَسَّنَا النَّارُ …:} یعنی جس چیز نے انھیں حق سے ککھلم کھلا انحراف اور بڑے سے بڑے گناہ کا بے شرمی سے ارتکاب کر لینے پر دلیر و جری بنا دیا ہے وہ یہ ہے کہ انھیں اللہ تعالیٰ کی پکڑ اور سزا کا کوئی ڈر نہیں ہے۔ ان کے آباء و اجداد انھیں طرح طرح کی خام خیالیوں اور جھوٹی تمناؤں میں مبتلا کر گئے ہیں، کبھی وہ اللہ کے بیٹے اور چہیتے ہونے کا دعویٰ کرتے ہیں(مائدہ : ۱۸) کبھی کہتے ہیں کہ جنت بنی ہی ہمارے لیے ہے [بقرہ : ۱۱۱ ] اور کبھی کہتے ہیں کہ اگر ہمیں تھوڑی بہت سزا ہوئی بھی تو چند دن سے زیادہ نہیں ہو گی، ہمارے بزرگوں کا، جن کے ہم نام لیوا ہیں اور جن کا ہم دامن پکڑے ہوئے ہیں ان کا اللہ پر اتنا زور ہے کہ وہ چاہے بھی تو ہمیں سزا نہیں دے سکے گا۔ (مزید دیکھیے بقرہ : ۷۸ تا ۸۰) اور نصاریٰ نے تو مسئلۂ کفارہ گھڑ کے گناہوں پر سزا کا سارا معاملہ ہی ختم کر دیا ہے۔ یعنی مسیح علیہ السلام اپنی امت کے گناہوں کی پاداش میں صلیب پر چڑھ گئے جس سے امت کے تمام گناہ معاف ہو گئے۔ اب اتنا ہی کافی ہے کہ عیسائی ہو جاؤ پھر جو مرضی کرتے رہو، مسیح علیہ السلام سب گناہوں کا کفارہ ادا کر چکے ہیں۔ ¤ یہی حال اب بہت سے مسلمانوں کا ہو گیا، کوئی شیخ جیلانی کو زبردستی موت کے فرشتے سے روحیں چھین لینے والا بنا بیٹھا ہے اور کوئی حسین رضی اللہ عنہ کی شہادت کو اپنے نام لیواؤں کے گناہوں کا کفارہ سمجھ بیٹھا ہے۔ [فَإِلَی اللّٰہِ الْمُشْتَکٰی ]"
    },
    {
      "Ayah": 25,
      "tafsir": "(آیت 25) یعنی انھیں جان لینا چاہیے کہ قیامت کے روز جب ہمارے حضور جمع ہوں گے تو ان کا بہت برا حال ہو گا، ان کے یہ من گھڑت عقیدے ان کے کسی کام نہیں آ سکیں گے اور نہ انھیں اپنے بزرگوں سے جھوٹی محبت اور دامن گیری اللہ کے عذاب سے بچا سکے گی۔ کوئی نبی یا ولی اللہ تعالیٰ کی مرضی کے بغیر سفارش بھی نہیں کر سکے گا۔ (ترجمان)"
    },
    {
      "Ayah": 26,
      "tafsir": "(آیت 26) ➊ {قُلِ اللّٰهُمَّ مٰلِكَ الْمُلْكِ:} سیبویہ اور خلیل نے کہا { ”اللّٰهُمَّ“ } اصل میں { ”يَااللّٰهُ“ } تھا، شروع سے ’’یا‘‘ کو حذف کیا تو آخر میں میم مشدد لگا دی۔ { ”مٰلِكَ الْمُلْكِ“ } سے پہلے بھی ’’یا‘‘ پوشیدہ ہے، اس لیے لفظ { ”مٰلِكَ“ } منصوب ہے۔ ( شوکانی) گویا اس دعا میں اللہ کے ذاتی اور صفاتی دونوں ناموں سے دعا کرنا سکھایا گیا ہے۔ ¤ ➋ یہودی غلط فہمی میں مبتلا تھے کہ حُکم و نبوت کا یہ سلسلہ ہمیشہ ان میں رہے گا، دوسری قوم اس کا حق نہیں رکھتی، مگر جب نبی آخر الزماں صلی اللہ علیہ وسلم ایک اُمی قوم بنی اسماعیل سے مبعوث ہو گئے تو ان کے غیظ و غضب اور حسد کی انتہا نہ رہی۔ اللہ تعالیٰ نے ان کی غلط فہمی دور کرتے ہوئے فرمایا کہ اللہ تعالیٰ اپنی مرضی والا اور ساری بادشاہی کا مالک ہے۔ وہ جس قوم کو چاہتا ہے دنیا میں عزت و سلطنت سے نواز دیتا ہے۔ لہٰذا نبوت جو بہت بڑی عزت ہے، اس کے لیے بھی اللہ تعالیٰ نے جسے چاہا پسند فرما لیا۔ اللہ تعالیٰ پر کسی کو اعتراض کا حق نہیں ہے۔ یہاں دعا کے انداز میں مسلمانوں کو بشارت بھی دے دی کہ تمھیں اس دنیا میں غلبہ و اقتدار حاصل ہو گا اور خاتم النّبیین صلی اللہ علیہ وسلم کی بعثت اللہ تعالیٰ کا بہت بڑا انعام ہے، لہٰذا تمھیں چاہیے کہ اس پر اللہ تعالیٰ کا شکر بجا لاؤ۔ ¤ ➌ { ”الْخَيْرُ“ } میں الف لام استغراق کا ہے اور {”بِيَدِكَ“} خبر پہلے آنے سے تخصیص پیدا ہو گئی ہے، اس لیے ترجمہ ’’تیرے ہی ہاتھ میں ہر بھلائی ہے ‘‘کیا گیا ہے۔"
    },
    {
      "Ayah": 27,
      "tafsir": "(آیت 27) ➊ { تُوْلِجُ الَّيْلَ فِي النَّهَارِ وَ تُوْلِجُ النَّهَارَ فِي الَّيْلِ:} اس سے موسموں کے اعتبار سے رات اور دن کے بڑھنے اور گھٹنے کی طرف اشارہ ہے، ایک ہی وقت کبھی رات کا حصہ بن جاتا ہے اور کبھی دن کا۔ اس طرح رات دن میں داخل ہو جاتی ہے اور دن رات میں۔ ¤ ➋ {وَ تُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ …:} مردہ سے زندہ، یعنی کافر سے مسلمان، جیسے آزر سے ابراہیم علیہ السلام ، نطفہ سے حیوان، انڈے سے پرندہ اور زندہ سے مردہ جیسے نوح علیہ السلام سے کنعان اور حیوان اور پرندے سے نطفہ اور انڈا۔ ¤ ➌ طبرانی کی ایک روایت میں اس آیت کے اندر اسم اعظم ہونے کا ذکر ہے۔ {’’هداية المستنير‘‘} میں اس روایت کو ایک راوی محمد بن زکریا غلابی کی وجہ سے موضوع کہا گیا ہے اور ’’الضعیفہ (۲۷۷۲)‘‘ سے {’’ضَعِيْفٌ جِدًّا‘‘} کا حکم نقل کیا گیا ہے۔"
    },
    {
      "Ayah": 28,
      "tafsir": "(آیت 28) ➊ {لَا يَتَّخِذِ الْمُؤْمِنُوْنَ … :} جب اکیلا اللہ تعالیٰ ہی بادشاہی کا مالک، عزت و  ذلت دینے والا اور ہر خیر والا ہے تو ایمان والوں پر بھی لازم ہے کہ وہ اس کے دوستوں سے دوستی اور اس کے دشمنوں سے دشمنی رکھیں، کسی فائدے کی امید پر اہل ایمان کو چھوڑ کر کافروں سے دوستی نہ رکھیں اور جو شخص ایسا کرے گا اس کے لیے اللہ کی دوستی میں سے ذرہ برابر حصہ بھی نہیں ہو گا۔ ہاں، ان کے شر سے کسی طرح بچنے کے لیے ظاہری طور پر دوستی کا اظہار جائز ہے، جب کہ دل میں ان کے کفر کی وجہ سے نفرت ہو۔ اسی طرح جو کافر مسلمانوں کے خلاف نہ لڑتے ہوں اور نہ کسی لڑنے والے کی مدد کرتے ہوں تو ان سے حسن سلوک اور مدارات جائز ہے۔ دیکھیے سورۂ ممتحنہ ( ۸، ۹)۔ ¤ ➋ {اِلَّاۤ اَنْ تَتَّقُوْا مِنْهُمْ تُقٰىةً :} لفظ {”تُقٰىةً“ ’’ وَقٰي يَقِيْ‘‘} سے مصدر ہے، تنوین کی وجہ سے ’’کسی طرح بچنا‘‘ ترجمہ کیا ہے۔ ’’تقیہ‘‘ بھی اس کا ہم معنی ہے۔ طبری اور ابن ابی حاتم نے ابن عباس رضی اللہ عنہما سے حسن سند کے ساتھ نقل کیا ہے کہ اللہ سبحانہ و تعالیٰ نے مومنوں کو منع کیا ہے کہ وہ کافروں سے دلی دوستی رکھیں، الا یہ کہ کافر ان پر غالب ہوں تو ان کے لیے نرمی کا اظہار کریں، مگر دین میں ان کی مخالفت کریں۔ مزید تشریح کے لیے دیکھیے سورۂ مائدہ (۵۱، ۵۶) اور تقیہ کی تفصیل کے لیے دیکھیے سورۂ نحل (۱۰۶)۔ ¤ ان آیات سے کسی مسلمان کے لیے مسلمانوں کے ملک کو چھوڑ کر کفار کے ملک میں رہنے کی کراہت بھی ثابت ہوتی ہے، کیونکہ وہاں مسلمان کے لیے کفار سے دوستی کے عملی ثبوت کے بغیر رہنا اور اپنے اور اہل و عیال کے دین کو بچانا مشکل ہے، اس لیے اگر کوئی مسلمان کہیں مغلوب ہے تو اسے جان بچانے کے لیے دوستی کا اظہار تو جائز ہے، مگر وہاں سے ہجرت کرکے مسلمانوں کے علاقے میں آنا لازم ہے۔ ہاں، بے بس ہو تو اللہ تعالیٰ سب کچھ جانتا ہے۔ یہ اور اس مفہوم کی دوسری آیات مسلم حکومتوں کی خارجہ پالیسی کی وضاحت کرتی ہیں اور انفرادی معاملات میں مدارات کی بھی، جیسا کہ ابو درداء رضی اللہ عنہ نے فرمایا : ’’ہم بعض لوگوں کے سامنے مسکراتے ہیں، جب کہ ہمارے دل ان پر لعنت کر رہے ہوتے ہیں۔‘‘ [بخاری، الأدب، باب المداراۃ مع الناس …، قبل ح : ۶۱۳۱ ]"
    },
    {
      "Ayah": 29,
      "tafsir": ""
    },
    {
      "Ayah": 30,
      "tafsir": ""
    },
    {
      "Ayah": 31,
      "tafsir": "(آیت 31){قُلْ اِنْ كُنْتُمْ تُحِبُّوْنَ اللّٰهَ فَاتَّبِعُوْنِيْ …: } یہود و نصاریٰ اور مشرکین سبھی اللہ تعالیٰ سے محبت کا دعویٰ رکھتے تھے، اس آیت میں اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو حکم دیا کہ ان سے کہہ دو اگر تم اللہ سے محبت رکھتے ہو تو اب اس دعویٰ کے سچا ہونے کی ایک ہی صورت ہے کہ مجھے نبی مان کر میری پیروی اختیار کرو، اس سے نہ صرف تمھاری اللہ سے محبت قبول ہو گی بلکہ اللہ تعالیٰ تم سے محبت کرے گا، تم اللہ کے محبوب بن جاؤ گے اور وہ تمھارے گناہ بھی بخش دے گا۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’جو کوئی کسی کی محبت کا دعویٰ کرے تو اس طرح محبت کرے جس طرح محبوب چاہے، نہ کہ جس طرح اپنا جی چاہے اور اسی طرح چاہے تو محبوب اس کو چاہے۔‘‘ (موضح) اس خطاب کا تعلق مسلمانوں سے بھی ہے کہ اگر تم کو اللہ کی محبت کا دعویٰ ہے تو اس کے لیے زبانی اظہار محبت کافی نہیں ہے، بلکہ اپنے تمام اقوال و افعال میں میری پیروی اختیار کرو۔ اپنے پاس سے گھڑے ہوئے طریقوں سے اللہ تعالیٰ کی محبت حاصل نہیں ہو سکتی، اسی لیے حدیث میں بدعت کی شدید مذمت آئی ہے۔"
    },
    {
      "Ayah": 32,
      "tafsir": "(آیت 32) ➊ {قُلْ اَطِيْعُوا اللّٰهَ وَ الرَّسُوْلَ:} پچھلی آیت میں رسول اللہ صلی اللہ علیہ وسلم کے اتباع کا حکم تھا جس کا معنی آپ کے نقش قدم پر چلنا، آپ کی پیروی کرنا ہے، اگرچہ اتباع میں حکم ماننا بھی آ جاتا ہے مگر اس آیت میں اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی اطاعت کا خاص طور پر الگ ذکر فرمایا، جس کا معنی حکم ماننا ہے۔ آگے فرمایا کہ اگر وہ منہ پھیر لیں تو اللہ ایسے کافروں سے محبت نہیں رکھتا۔ یہاں بات صاف سمجھ میں آ رہی ہے کہ بات مختصر کر دی گئی ہے، جو اس طرح تھی کہ اگر وہ منہ پھیر لیں تو وہ کافر ہیں اور اللہ ایسے کافروں سے محبت نہیں کرتا۔ { ”الْكٰفِرِيْنَ“ } میں الف لام عہد کا ہونے کی وجہ سے ترجمہ ’’ایسے کافروں‘‘ کیا گیا ہے۔ ¤ ➋ اس آیت میں اللہ تعالیٰ کی اطاعت کے ساتھ { ”الرَّسُوْلَ“ } یعنی محمد صلی اللہ علیہ وسلم کی اطاعت کا مستقل حیثیت سے حکم دیا گیا ہے اور آپ صلی اللہ علیہ وسلم کی وفات کے بعد {”الرَّسُوْلَ“} کی اطاعت سنت کی پیروی ہی سے ہو سکتی ہے۔ بعض لوگ غلط فہمی کی بنا پر کہہ دیتے ہیں کہ حدیث وہی حجت ہو گی جو قرآن کے مطابق ہو، حالانکہ قرآن نے متعدد مواقع پر حدیث کو مستقل دلیل اور شریعت کے ماخذ کی حیثیت دی ہے، لہٰذا قانون کا ماخذ قرآن و حدیث دونوں قرار پائیں گے۔ حدیث میں قرآن سے زائد حکم تو ہو سکتے ہیں مگر کوئی صحیح حدیث قرآن کے خلاف نہیں ہے، اگر کوئی شخص یہ سمجھتا ہے تو یہ اس کی عقل و فہم کا قصور ہے، یا اس کی نیت کا فتور۔ مزید دیکھیے سورۂ نجم (۴)۔ ¤ ➌ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’میں تم میں سے کسی کو اس حال میں نہ پاؤں کہ وہ اپنے تکیے پر ٹیک لگائے ہوئے ہو اور اس کے پاس میرے حکم میں سے کوئی حکم آئے، ان چیزوں میں سے جن کا میں نے حکم دیا ہے، یا میں نے منع کیا تو وہ کہے، ہم نہیں جانتے، ہم اللہ کی کتاب میں جو پائیں گے اسی کی پیروی کریں گے۔‘‘ [أبو داوٗد، السنۃ، باب فی لزوم السنۃ : ۴۶۰۵، عن أبی الدرداء رضی اللہ عنہ ]"
    },
    {
      "Ayah": 33,
      "tafsir": "(آیت 33){اِنَّ اللّٰهَ اصْطَفٰۤى …:} اوپر کی آیات میں رسول اللہ صلی اللہ علیہ وسلم کی اتباع و اطاعت کا حکم دیا ہے، اب اس آیت میں آپ کی رسالت کے اثبات کے سلسلہ میں فرمایا جا رہا ہے کہ آپ صلی اللہ علیہ وسلم کا تعلق ببھی اس خاندان نبوت سے ہے جسے اللہ تعالیٰ نے چن لیا ہے (کیونکہ آپ آل ابراہیم سے ہیں)۔ (شوکانی) عمران نام کی دو شخصیتیں گزری ہیں، ایک موسیٰ و ہارون علیہما السلام کے والد اور دوسرے مریم علیھا السلام کے والد۔ اکثر مفسرین نے یہاں دوسرے عمران مراد لیے ہیں، کیونکہ انھی کی آل (مریم و عیسیٰ علیہما السلام ) کا قصہ بیان کیا جا رہا ہے۔ (ابن کثیر، رازی) غالباً اس سورت کا نام بھی اسی قصہ کی بنا پر رکھا گیا ہے۔"
    },
    {
      "Ayah": 34,
      "tafsir": "(آیت 34){ذُرِّيَّةًۢ بَعْضُهَا مِنْۢ بَعْضٍ: } گویا سب انبیاء آدم علیہ السلام ، پھر نوح علیہ السلام ، پھر ابراہیم علیہ السلام کی اولاد میں سے تھے اور چونکہ عیسیٰ علیہ السلام بھی ابراہیم علیہ السلام اور پھر آل عمران سے تھے، لہٰذا وہ بھی انسان تھے، اللہ یا اللہ کے بیٹے نہیں تھے۔ یہاں سے اہل نجران اور دوسرے نصرانیوں کے عقیدے کے ابطال کے لیے عیسیٰ علیہ السلام کی ولادت کا قصہ شروع ہوتا ہے۔"
    },
    {
      "Ayah": 35,
      "tafsir": "(آیت 35) تفاسیر میں عمران کی بیوی کا نام {’’حَنَّه ‘‘} مذکور ہے اور یہ کہ دمشق کے بیرونی حصے میں ان کی قبر ہے، مگر ان دونوں باتوں کی کوئی پختہ دلیل نہیں۔ اس زمانے میں دستور تھا کہ بعض لڑکوں کو ماں باپ اپنے حق سے آزاد کرکے اللہ تعالیٰ کی نذر کر دیتے اور عبادت خانے کے سپرد کر دیتے۔ عمران کی بیوی حاملہ تھیں، انھوں نے بھی یہی نذر مانی۔ {”مُحَرَّرًا“} کے معنی ہیں کہ وہ صرف مسجد کی خدمت ہی کے لیے وقف رہے گا۔ (قرطبی)"
    },
    {
      "Ayah": 36,
      "tafsir": "(آیت 36) ➊ {وَ لَيْسَ الذَّكَرُ كَالْاُنْثٰى:} بظاہر تو کہنا چاہیے تھا کہ لڑکی لڑکے جیسی نہیں مگر الٹ فرمایا، یعنی اللہ تعالیٰ فرماتے ہیں کہ وہ لڑکا جو عمران کی بیوی کے ذہن میں تھا اس لڑکی جیسا نہیں ہو سکتا جو انھیں عطا کی گئی۔ { ”الذَّكَرُ“ } اور {”اَلْاُنْثٰى“} میں الف لام عہد ذہنی کا ہے۔ ¤ ➋ { وَ اِنِّيْ سَمَّيْتُهَا مَرْيَمَ:} اس سے معلوم ہوا کہ پیدائش کے ساتھ ہی نام رکھا جا سکتا ہے، ساتویں دن کا انتظار ضروری نہیں، بلکہ ساتواں دن نام رکھنے کی آخری حد ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’آج رات میرے گھر بچہ پیدا ہوا ہے اور میں نے اپنے باپ (ابراہیم علیہ السلام ) کے نام پر اس کا نام رکھا ہے۔‘‘ [مسلم، الفضائل، باب رحمتہ صلی اللہ علیہ وسلم الصبیان …:۲۳۱۵ ، عن أنس رضی اللہ عنہ ] ¤ ➌ { وَ اِنِّيْۤ اُعِيْذُهَا بِكَ وَ ذُرِّيَّتَهَا مِنَ الشَّيْطٰنِ الرَّجِيْمِ:} چنانچہ یہ دعا قبول ہوئی، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ہر بچہ جب پیدا ہوتا ہے تو شیطان اسے چھوتا ہے، شیطان کے اسے چھونے کی وجہ سے وہ چیخ کر رونے لگتا ہے، سوائے مریم اور اس کے بیٹے کے۔‘‘ [بخاری،التفسیر، باب قول اللہ تعالٰی : « واذکر فی الکتاب مریم …» : ۳۴۳۱، عن أبی ہریرۃ رضی اللہ عنہ ]"
    },
    {
      "Ayah": 37,
      "tafsir": "(آیت 37) ➊ { وَ كَفَّلَهَا زَكَرِيَّا:} عام قول کے مطابق زکریا علیہ السلام ان کے خالو تھے، مگر صحیح بات یہ ہے کہ وہ مریم علیھا السلام کے بہنوئی تھے۔ اس کی دلیل حدیث معراج ہے جس میں دوسرے آسمان پر رسول اللہ صلی اللہ علیہ وسلم کی یحییٰ اور عیسیٰ علیہما السلام سے ملاقات کا ذکر ہے اور صراحت ہے کہ وہ دونوں خالہ زاد بھائی تھے۔ [بخاری، الأنبیاء، باب قول اللہ تعالیٰ : « ذکر رحمۃ ربک…»: ۳۴۳۰ ] ¤ ➋ { الْمِحْرَابَ:} اس سے مراد معروف محراب نہیں ہے جو مسجدوں میں امام کے لیے بنایا جاتا ہے، بلکہ اس کا معنی اس کمرہ کے ہیں جو تنہائی کے لیے بنایا جاتا ہے۔ (دیکھیے سبا : ۱۳) یہودو نصاریٰ عبادت خانے سے الگ کچھ بلندی پر یہ محراب بناتے تھے، جس میں مسجد کے عبادت گزار رہتے تھے۔ ¤ ➌ { وَجَدَ عِنْدَهَا رِزْقًا:} اسلوب کلام سے صاف معلوم ہوتا ہے کہ یہ رزق بطور کرامت مریم علیہا السلام کے پاس پہنچ رہا تھا۔ اکثر تابعین سے منقول ہے کہ زکریا علیہ السلام جب بھی مریم علیہا السلام کے حجرے میں جاتے تو ان کے ہاں بے موسم کے تازہ پھل پاتے۔ (ابن جریر، ابن کثیر) تابعین کا یہ فرمان آیت کے الفاظ کی تشریح ہو جیسا کہ ظاہر ہے تو اس رزق کے بطور کرامت ملنے کی تائید ہے اور اگر اسرائیلی نقل ہو تو اسے سچایا جھوٹا کہنے کی اجازت نہیں مگر اللہ تعالیٰ کے بندوں کو اسباب کے بغیر رزق عطا ہونا کچھ بعید نہیں اور امت محمد صلی اللہ علیہ وسلم کے اولیاء و شہداء کو یہ کرامت اور عزت افزائی ملنا صحیح سند سے ثابت ہے۔ ¤ صحیح بخاری میں ابوہریرہ رضی اللہ عنہ سے خبیب رضی اللہ عنہ کی سولی کا واقعہ تفصیل سے مذکور ہے، مکہ کے جس گھر میں انھیں قید رکھا گیا اس گھر والی بنت الحارث کا بیان ہے کہ اللہ کی قسم ! میں نے خبیب سے بہتر قیدی کبھی نہیں دیکھا، اللہ کی قسم! میں نے ایک دن انھیں انگور کا گچھا کھاتے ہوئے دیکھا، جو ان کے ہاتھ میں تھا، جب کہ وہ لوہے کی زنجیروں میں بندھے ہوئے تھے، حالانکہ مکہ میں کوئی پھل نہیں تھا۔ (بنت الحارث) کہتی تھیں کہ یقینا وہ اللہ کی طرف سے رزق تھا جو اس نے خبیب کو دیا تھا۔ [بخاری، الجہاد والسیر، باب ھل یستأسر الرجل … : ۳۰۴۵ ]مگر کرامت ولی کے اختیار میں نہیں ہوتی کہ وہ جو چاہے کرے، ورنہ خبیب رضی اللہ عنہ زنجیریں توڑ کر آزاد ہو جاتے، حتیٰ کہ نبی بھی اپنی مرضی سے کوئی معجزہ نہیں دکھا سکتے، فرمایا : «وَ مَا كَانَ لَنَاۤ اَنْ نَّاْتِيَكُمْ بِسُلْطٰنٍ اِلَّا بِاِذْنِ اللّٰهِ» [إِبراہیم : ۱۱ ]"
    },
    {
      "Ayah": 38,
      "tafsir": "(آیت 38){هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهٗ:} زکریا علیہ السلام بوڑھے ہو چکے تھے اور ابھی تک بے اولاد تھے، بیوی بانجھ تھی، بظاہر انھیں اولاد کی کوئی امید نہ تھی، لیکن یہ دیکھ کر کہ کس طرح مریم علیھا السلام کو خرق عادت کے طور پر بے موسم کا رزق پہنچ رہا ہے، ان کے دل میں بھی خواہش پیدا ہوئی کہ بے موسم کا رزق پہنچانے والا مایوسی کے عالم میں اولاد بھی عطا فرما سکتا ہے، چنانچہ اسی جگہ اور اسی وقت اللہ تعالیٰ کے حضور نیک اولاد کی دعا کی۔ بعض علماء نے مریم علیہا السلام کو خرق عادت میوے پہنچنے کا انکار کیا اور کہا ہے کہ یہ محاورہ ہے کہ خدا رسیدہ لوگ ہر نعمت کو (من عند اللہ) اللہ تعالیٰ کی طرف منسوب کر دیتے ہیں، مگر زکریا علیہ السلام کا اس حالت کو دیکھ کر اظہار تعجب اور دعا کرنا بتا رہا ہے کہ رزق خرق عادت (بطور کرامت) ہی مل رہا تھا۔ پچھلی آیت کے حاشیہ میں خبیب رضی اللہ عنہ کا واقعہ ملاحظہ فرمائیں اور زکریا علیہ السلام کا واقعہ سورۂ مریم کے شروع میں ملاحظہ کریں۔"
    },
    {
      "Ayah": 39,
      "tafsir": "(آیت 39) ➊ {فَنَادَتْهُ الْمَلٰٓىِٕكَةُ … : } عبادت خانے میں نماز پڑھنے کے دوران ہی فرشتوں نے انھیں یحییٰ نامی بیٹے کی خوش خبری دی۔ معلوم ہوا پیدائش سے پہلے بھی اولاد کا نام رکھا جا سکتا ہے۔ ¤ ➋ { بِكَلِمَةٍ مِّنَ اللّٰهِ :} یہ عیسیٰ علیہ السلام کا لقب ہے، اگرچہ ہر شخص ہی اللہ تعالیٰ کے کلمۂ کن سے پیدا ہوا ہے، مگر عیسیٰ علیہ السلام کے بغیر باپ کے پیدا ہونے پر انھیں بطور شرف یہ لقب دیا گیا، جیسے بیت اللہ، ناقۃ اللہ، اگرچہ ہر مسجد اور ہر اونٹنی اللہ ہی کی ہے۔یحییٰ علیہ السلام عیسیٰ علیہ السلام سے بڑے تھے، تبھی انھوں نے عیسیٰ علیہ السلام کی تصدیق کی۔ ¤ ➌ ”{حَصُوْرًا“} سے مراد ایسا شخص ہے جسے اپنی جنسی خواہشوں پر پوری طرح قابو حاصل ہو۔ (فتح البیان) بعض لوگوں نے معنی کیا ہے جو عورت کے پاس نہ جا سکتا ہو، مگر یہ نہ کوئی خوبی ہے نہ یہاں مراد ہے۔"
    },
    {
      "Ayah": 40,
      "tafsir": "(آیت 40){قَالَ رَبِّ اَنّٰى يَكُوْنُ......:} دعا کی فوری قبولیت اور بظاہر ناممکن کام کی بشارت پر انھیں تعجب ہوا۔ عجیب بات یہ ہے کہ خود ہی دعا کر رہے ہیں اور پھر خود ہی انھیں اتنا تعجب ہو رہا ہے کہ یہ کیسے ہو گا ؟ جو اب ملا کہ اللہ تعالیٰ جو چاہے کرتا ہے۔"
    },
    {
      "Ayah": 41,
      "tafsir": "(آیت 41){قَالَ رَبِّ اجْعَلْ … : } زکریا علیہ السلام کا تعجب اس حد تک بڑھا کہ انھوں نے اللہ تعالیٰ سے اس کی نشانی کی درخواست کر دی، فرمایا کہ تمھارے لیے نشانی یہ ہے کہ تم تین دن تک صحیح سالم ہونے کے باوجود (ہاتھ یا ابرو وغیرہ کے) اشارے کے سوا لوگوں سے بات چیت نہ کر سکو گے، لہٰذا اس دوران تم اپنا سارا وقت اللہ تعالیٰ کے ذکر و شکر اور تسبیح میں صرف کرو۔"
    },
    {
      "Ayah": 42,
      "tafsir": "(آیت 42) ➊ {اِنَّ اللّٰهَ اصْطَفٰىكِ …: } اس آیت میں اللہ تعالیٰ کے مریم علیہا السلام کو چننے کا ذکر دو مرتبہ آیا ہے۔ یہ بھی ہو سکتا ہے کہ محض تاکید کے لیے ہو، یا پہلے چننے سے مراد بچپن میں مریم علیہا السلام کو شرف قبولیت بخشنا ہو، جو آیت : «فَتَقَبَّلَهَا رَبُّهَا بِقَبُوْلٍ حَسَنٍ » میں مذکور ہے اور دوسرے چننے سے مراد اللہ تعالیٰ کا انھیں عیسیٰ علیہ السلام کی پیدائش کے لیے منتخب فرمانا اور خصوصی فضیلت عطا کرنا ہو۔ ¤ ➋ { عَلٰى نِسَآءِ الْعٰلَمِيْنَ:} سب جہانوں کی عورتوں سے مراد صرف اس زمانے کی عورتیں ہیں، کیونکہ احادیث میں مریم علیہا السلام کی طرح خدیجہ، فاطمہ اور عائشہ رضی اللہ عنھن کی فضیلت میں بھی اسی قسم کے الفاظ مذکور ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’مردوں میں سے بہت سے لوگ کامل ہوئے ہیں لیکن عورتوں میں سے آسیہ زوجۂ فرعون اور مریم بنت عمران ہی کامل ہوئی ہیں اور عورتوں پر عائشہ رضی اللہ عنہا کو اس طرح فضیلت حاصل ہے جس طرح ثرید کو باقی کھانوں پر فضیلت حاصل ہے۔‘‘ [بخاری، أحادیث الأنبیاء، باب قول اللہ تعالٰی : « و ضرب اللہ مثلاً… » : ۳۴۱۱، عن أبی موسیٰ الأشعری رضی اللہ عنہ ] انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تمام جہانوں کی عورتوں میں تمھارے لیے مریم بنت عمران، خدیجہ بنت خویلد، فاطمہ بنت محمد اور آسیہ زوجۂ فرعون کافی ہیں۔‘‘ [ترمذی، المناقب، باب فضل خدیجۃ : ۳۸۷۸ ]"
    },
    {
      "Ayah": 43,
      "tafsir": "(آیت 43){ وَ ارْكَعِيْ مَعَ الرّٰكِعِيْنَ : } مریم علیہا السلام چونکہ بیت المقدس کے ساتھ محراب میں رہتی تھیں اور بیت المقدس کی خادمہ تھیں اس لیے انھیں جماعت کے ساتھ نماز پڑھنے کا حکم ہوا۔"
    },
    {
      "Ayah": 44,
      "tafsir": "(آیت 44) ➊ {ذٰلِكَ مِنْ اَنْبَآءِ الْغَيْبِ نُوْحِيْهِ اِلَيْكَ …: } اس آیت سے پانچ مسئلے واضح طور پر ثابت ہوئے، پہلا یہ کہ رسول اللہ صلی اللہ علیہ وسلم غیب نہیں جانتے تھے، ورنہ انھیں غیب کی یہ خبریں وحی کرنے کی ضرورت نہ تھی۔ دوسرا یہ کہ رسول اللہ صلی اللہ علیہ وسلم ہر جگہ حاضر و ناظر نہیں ہیں، ورنہ اللہ تعالیٰ یہ نہ فرماتا کہ تو اس وقت ان کے پاس موجود نہ تھا۔ تیسرا یہ کہ اولیاء اور دوسرے انبیاء بھی غیب دان نہیں، ورنہ بیت المقدس کے خدام اور وقت کے پیغمبر زکریا علیہ السلام کو قرعہ ڈالنے کی ضرورت نہ تھی۔ چوتھا یہ کہ جب چیز ایک ہو اور اس کے حق دار کئی ہوں تو اس وقت قرعہ کے ذریعے سے فیصلہ شریعت کا فیصلہ ہے۔ امام بخاری رحمہ اللہ نے {’’كِتَابُ الشَّهَادَاتِ‘‘} میں باب باندھا ہے : {’’ بَابُ الْقُرْعَةِ فِي الْمُشْكِلاَتِ ‘‘} ’’مشکل معاملات میں قرعہ اندازی کا بیان ‘‘ اور اس میں کئی احادیث لائے ہیں۔ بعض لوگوں نے قرعہ کو جوا قرار دیا ہے، یہ ان کی غلطی ہے۔ ہاں، اگر اس مقصد کے لیے قرعہ ڈالا جائے کہ یہ کام کروں یا نہ کروں تو یہ قرعہ نہیں بلکہ فال نکالنا ہے جو حرام ہے۔ [ديكهيے سورهٔ مائده :۹۰] ¤ پانچواں یہ کہ رسول اللہ صلی اللہ علیہ وسلم جو اس واقعہ کے وقت نہ موجود تھے، نہ اسے جانتے تھے، آپ کا وحی الٰہی سے اس واقعہ کو بیان کرنا آپ کے رسول برحق ہونے کی دلیل ہے۔ ¤ ➋ { اِذْ يُلْقُوْنَ اَقْلَامَهُمْ:} اس قرعہ اندازی کی ضرورت اس لیے پیش آئی کہ مریم علیہا السلام یہودیوں کے بہت بڑے عالم عمران کی بیٹی تھیں، جب ان کی والدہ نے انھیں اپنی عبادت گاہ کی نذر کیا تو عبادت گاہ کے خدام میں جھگڑا ہوا کہ ان کی سرپرستی اور نگرانی کا شرف کون حاصل کرے، تو انھوں نے قرعہ اندازی کی اور قرعہ زکریا علیہ السلام کے نام نکلا۔ ( ابن کثیر، قرطبی )"
    },
    {
      "Ayah": 45,
      "tafsir": "(آیت 46،45) ➊ {اِذْ قَالَتِ الْمَلٰٓىِٕكَةُ يٰمَرْيَمُ......:} اس آیت میں عیسیٰ علیہ السلام کو اللہ تعالیٰ کی طرف سے ایک کلمہ قرار دیا گیا ہے، اس کی وضاحت آیت(۳۸) کے فوائد میں گزر چکی ہے۔ فرشتوں نے مریم علیہا السلام سے بالمشافہہ یہ بات کی، جیسا کہ سورۂ مریم (۱۷) میں ہے کہ جبریل علیہ السلام انسانی شکل میں ان سے ہم کلام ہوئے۔ {’’ الْمَسِيْحُ ‘‘} لفظ{ ’’ مَسَحَ ‘‘} سے مشتق ہے، جس کے معنی ہاتھ پھیرنے یا زمین کی مساحت کے ہیں۔ لہٰذا عیسیٰ علیہ السلام کو مسیح یا تو اس لیے کہا گیا ہے کہ وہ بیماروں پر ہاتھ پھیرتے تھے اور وہ تندرست ہو جاتے تھے، یا اس بنا پر کہ آپ ہر وقت زمین میں سفر کرتے رہتے تھے۔ ( ابن کثیر) ¤ ➋ یہاں مسیح علیہ السلام کے چار اوصاف بیان ہوئے ہیں : (1) { ’’ وَجِيْهًا ‘‘ } یعنی بہت وجاہت والا ہو گا۔ چہرہ آدمی کی ذات کا آئینہ ہوتا ہے، اس لیے اونچے مرتبے کو وجاہت کہتے ہیں۔ (2) مقرب لوگوں میں سے ہو گا۔ (3) گہوارے اور ادھیڑ عمر میں یکساں حکیمانہ کلام کرے گا۔ گہوارے میں ان کا کلام سورۂ مریم (۳۰ تا ۳۳) میں نقل ہوا ہے اور ادھیڑ عمر میں کلام کرنے میں ان کے دوبارہ اترنے کی طر ف بھی اشارہ ہے۔ (4) صالحین سے ہو گا۔ صالح وہ ہے جس کے سارے کام درست ہوں، اس لیے سلیمان علیہ السلام جیسے جلیل القدر پیغمبر نے صالح بندوں میں داخل کیے جانے کی دعا کی۔ دیکھیے سورۂ یوسف (۱۰۱) اور سورۂ نمل (۱۹)۔"
    },
    {
      "Ayah": 46,
      "tafsir": "(آیت 46،45) ➊ {اِذْ قَالَتِ الْمَلٰٓىِٕكَةُ يٰمَرْيَمُ......:} اس آیت میں عیسیٰ علیہ السلام کو اللہ تعالیٰ کی طرف سے ایک کلمہ قرار دیا گیا ہے، اس کی وضاحت آیت(۳۸) کے فوائد میں گزر چکی ہے۔ فرشتوں نے مریم علیہا السلام سے بالمشافہہ یہ بات کی، جیسا کہ سورۂ مریم (۱۷) میں ہے کہ جبریل علیہ السلام انسانی شکل میں ان سے ہم کلام ہوئے۔ {’’ الْمَسِيْحُ ‘‘} لفظ{ ’’ مَسَحَ ‘‘} سے مشتق ہے، جس کے معنی ہاتھ پھیرنے یا زمین کی مساحت کے ہیں۔ لہٰذا عیسیٰ علیہ السلام کو مسیح یا تو اس لیے کہا گیا ہے کہ وہ بیماروں پر ہاتھ پھیرتے تھے اور وہ تندرست ہو جاتے تھے، یا اس بنا پر کہ آپ ہر وقت زمین میں سفر کرتے رہتے تھے۔ ( ابن کثیر) ¤ ➋ یہاں مسیح علیہ السلام کے چار اوصاف بیان ہوئے ہیں : (1) { ’’ وَجِيْهًا ‘‘ } یعنی بہت وجاہت والا ہو گا۔ چہرہ آدمی کی ذات کا آئینہ ہوتا ہے، اس لیے اونچے مرتبے کو وجاہت کہتے ہیں۔ (2) مقرب لوگوں میں سے ہو گا۔ (3) گہوارے اور ادھیڑ عمر میں یکساں حکیمانہ کلام کرے گا۔ گہوارے میں ان کا کلام سورۂ مریم (۳۰ تا ۳۳) میں نقل ہوا ہے اور ادھیڑ عمر میں کلام کرنے میں ان کے دوبارہ اترنے کی طر ف بھی اشارہ ہے۔ (4) صالحین سے ہو گا۔ صالح وہ ہے جس کے سارے کام درست ہوں، اس لیے سلیمان علیہ السلام جیسے جلیل القدر پیغمبر نے صالح بندوں میں داخل کیے جانے کی دعا کی۔ دیکھیے سورۂ یوسف (۱۰۱) اور سورۂ نمل (۱۹)۔"
    },
    {
      "Ayah": 47,
      "tafsir": "(آیت 47) {اَنّٰى يَكُوْنُ لِيْ وَلَدٌ وَّ لَمْ يَمْسَسْنِيْ بَشَرٌ:} مریم علیہا السلام کو جب لڑکے کی خوشخبری دی گئی تو انھوں نے تعجب کا اظہار کیا، تعجب کا اظہار اس کے ناممکن ہونے پر نہیں بلکہ کس طرح ہونے پر کیا، کیونکہ ظاہری اسباب موجود نہیں۔ کہنے لگیں، مجھے تو آج تک کسی بشر نے ہاتھ نہیں لگایا، پھر میرے ہاں بچہ کیسے ہو گا !؟ فرمایا : ’’اللہ اسی طرح جو چاہتا ہے پیدا کرتا ہے۔‘‘ زکریا علیہ السلام کے قصے میں{ ’’ يَفْعَلُ ‘‘} اور یہاں {’’ يَخْلُقُ ‘‘} فرمایا۔ پہلا لفظ عام ہے، کیونکہ وہاں میاں بیوی دونوں موجود تھے، گو بوڑھے تھے۔{ ’’ يَخْلُقُ ‘‘ } خاص ہے، کیونکہ مرد کے بغیر اسباب ہی مکمل نہیں۔ مزید دیکھیے سورۂ مریم (۲۰، ۲۱)۔"
    },
    {
      "Ayah": 48,
      "tafsir": "(آیت 48) {وَ يُعَلِّمُهُ الْكِتٰبَ:} عیسیٰ علیہ السلام کو تورات اور ہر کتاب بغیر پڑھے آتی تھی اور یہ سب معجزے تھے۔ (موضح) بعض مفسرین نے {”الْكِتٰبَ“} کا معنی لکھنا کیا ہے۔"
    },
    {
      "Ayah": 49,
      "tafsir": "(آیت 49) ➊ {اَنِّيْ قَدْ جِئْتُكُمْ بِاٰيَةٍ مِّنْ رَّبِّكُمْ:} یعنی جب وہ رسول بن کر آئیں گے تو ان کی دعوت یہ ہو گی جو آگے بیان ہوئی ہے۔ ¤ ➋ { اَنِّيْۤ اَخْلُقُ : } یہاں {’’ خَلَقَ ‘‘} کا لفظ ظاہری شکل و صورت بنانے کے معنی میں استعمال ہوا ہے، جیسا کہ حدیث میں ہے کہ قیامت کے دن اللہ تعالیٰ تصویر بنانے والوں سے فرمائے گا : [ اَحْيُوْا مَا خَلَقْتُمْ ] ’’تم نے جو خلق کیا اسے زندہ کرو۔‘‘ [بخاری، البیوع، باب التجارۃ فیما یکرہ…: ۲۱۰۵ ] پیدا کرنے اور زندگی دینے کے معنی میں خالق صرف اللہ تعالیٰ ہے۔ ¤ ➌ { بِاِذْنِ اللّٰهِ:} یہاں {”بِاِذْنِ اللّٰهِ“} کا لفظ بار بار لانے سے یہ بتانا مقصود ہے کہ اگر اللہ تعالیٰ کا حکم نہ ہوتا تو عیسیٰ علیہ السلام یہ معجزات نہ دکھا سکتے اور یہی ہر نبی کے معجزات کا حال ہے کہ وہ اللہ ہی کے اختیار میں ہوتے ہیں۔ ¤ ➍ اللہ تعالیٰ نے اپنے ہر نبی کو اس کے زمانے کے مناسب حال معجزات عطا فرمائے۔ موسیٰ علیہ السلام کے زمانے میں جادو اور جادوگروں کا زور تھا، سو اللہ تعالیٰ نے انھیں وہ معجزات دے کر بھیجا جن سے تمام جادوگر دنگ رہ گئے اور ان کی عقل چکرا گئی، بالآخر وہ جادوگر از خود مسلمان ہوئے اور اسلام کی راہ میں سولی چڑھنے تک کے لیے تیار ہو گئے۔ عیسیٰ علیہ السلام کے زمانے میں طب اور علوم طبعیہ (سائنس) کا چرچا تھا، سو اللہ تعالیٰ نے انھیں وہ معجزات عطا فرمائے جن کے سامنے تمام اطباء اور سائنسدان اپنے عاجز اور درماندہ ہونے کا اعتراف کیے بغیر نہ رہ سکے۔ ہمارے رسول صلی اللہ علیہ وسلم کے زمانے میں فصاحت وبلاغت اور شعر و ادب کا ڈنکا بجتا تھا، سو اللہ تعالیٰ نے ان پر وہ کتاب نازل فرمائی جس نے تمام فصحاء و بلغاء کی گردنیں خم کر دیں۔ اللہ تعالیٰ نے انھیں تین طرح کا چیلنج دیا، پہلے پورے قرآن کی مثل لانے کا (بنی اسرائیل : ۸۸) پھر دس سورتیں اس جیسی لانے کا (ہود: ۱۳) پھر اس جیسی کوئی ایک سورت لانے کا (یونس : ۳۸) مگر وہ بار بار چیلنج سننے کے باوجود اس جیسی دس سورتیں تو کجا، اس جیسی ایک سورت بھی پیش نہ کر سکے۔ کیوں؟ اس لیے کہ پروردگار کا کلام مخلوق کے کلام سے مماثلت نہیں رکھتا۔ ( ابن کثیر، رازی)"
    },
    {
      "Ayah": 50,
      "tafsir": "(آیت 50) {وَ مُصَدِّقًا لِّمَا بَيْنَ يَدَيَّ … :} عیسیٰ علیہ السلام کے وقت تورات میں سے کئی حکم جو مشکل تھے موقوف ہوئے، باقی وہی تورات کا حکم تھا۔ (موضح) عیسیٰ علیہ السلام اپنی کوئی الگ مستقل شریعت لے کر مبعوث نہیں ہوئے تھے، بلکہ موسوی شریعت کی تائید و تصدیق کرنے اور بنی اسرائیل کو تورات پر عمل کی دعوت دینے کے لیے آئے تھے، البتہ تورات میں بعض چیزیں جو بطور تشدید ان پر حرام کر دی گئی تھیں ان کو اللہ کے حکم سے حلال قرار دینا بھی ان کے مقصد بعثت میں شامل تھا، جیسے اونٹ کا گوشت اور حلال جانوروں کی چربی وغیرہ۔ بعض علماء نے کہا ہے کہ عیسیٰ علیہ السلام نے صرف ان چیزوں کو حلال قرار دیا جنھیں یہود نے آپس کے اختلافات اور موشگافیوں کی وجہ سے حرام قرار دے لیا تھا۔ لیکن زیادہ صحیح یہی ہے کہ انھوں نے بعض چیزوں کی حرمت کو منسوخ بھی کیا ہے۔ ( ابن کثیر)"
    },
    {
      "Ayah": 51,
      "tafsir": "(آیت 51){اِنَّ اللّٰهَ رَبِّيْ … : } عیسیٰ علیہ السلام نے معجزات پیش کرنے کے ساتھ ضروری سمجھا کہ اصل دین کی تاکید فرما دیں کہ میرا اور تمھارا داتا (رب) اللہ ہے، سو اسی کی عبادت کرو۔ مگر افسوس کہ نصرانیوں نے مسیح علیہ السلام کو اللہ یا اللہ کا بیٹا قرار دے کر رب اور نفع و نقصان کا مالک سمجھ لیا اور ان سے فریادیں کرنے لگے۔"
    },
    {
      "Ayah": 52,
      "tafsir": "(آیت 52) ➊ { فَلَمَّاۤ اَحَسَّ عِيْسٰى مِنْهُمُ الْكُفْرَ … :} یعنی صرف عقل سے نہیں سمجھا بلکہ حواس سے معلوم کر لیا، آنکھوں اور کانوں سے یہ حقیقت جان لی کہ یہود اور ان کے علماء اللہ کی دی ہوئی نشانیوں اور دلائل و معجزات کے سامنے بے بس ہوچکے ہیں، مگر ماننے کے لیے کسی صورت آمادہ نہیں، بلکہ ان کی زندگی کے درپے ہیں اور اس مقصد کے لیے سازشیں کر رہے ہیں تو انھیں اپنے دنیا سے رخصت ہونے میں کچھ شبہ نہ رہا۔ اب انھیں فکر تھی تو یہ کہ دین کی اشاعت و تبلیغ کا کام رکنا نہیں چاہیے، چنانچہ انھوں نے اپنے پیروکاروں سے پوچھا کہ کون ہے جو اللہ کی طرف دعوت دینے اور اس کے راستے پر چلنے اور چلانے میں میرا مددگار ہو؟ اللہ تعالیٰ نے چند لوگوں کو توفیق عطا فرمائی، وہ ایمان لائے اور پوری تن دہی کے ساتھ عیسیٰ علیہ السلام کی مدد کرتے رہے اور یہی لوگ عیسیٰ علیہ السلام کے حواری کہلائے۔ یہاں یہ بات قابل غور ہے کہ عیسیٰ علیہ السلام اپنے ساتھیوں سے مدد مانگ رہے ہیں، اگر وہ مختار کل ہوتے تو مدد مانگنے کی کیا ضرورت تھی۔ ہمارے دور کے قبرپرست بھی عجیب ہیں، اس آیت سے استدلال کرکے فوت شدہ بزرگوں سے وہ چیزیں مانگتے ہیں جو ان کے اختیار میں نہیں اور دلیل میں یہ آیت پیش کرتے ہیں۔ حالانکہ اس میں بزرگوں نے چھوٹوں سے وہ مدد مانگی ہے جو ان کے اختیار میں تھی۔ ¤ ➋ عیسیٰ علیہ السلام کا یہ قول ویسا ہی ہے جیسا کہ رسول اللہ صلی اللہ علیہ وسلم ہجرت سے پہلے زمانۂ حج میں مختلف قبائل عرب سے فرمایا کرتے تھے کہ کون ہے جو مجھے پناہ دے تاکہ میں لوگوں تک اپنے رب کا پیغام پہنچا سکوں، اس لیے کہ قریش نے مجھے یہ پیغام پہنچانے سے روک رکھا ہے ؟ تاآنکہ آپ کو انصار مل گئے، جنھوں نے آپ کو پناہ دی اور اپنی جان و مال سے آپ کی مدد کی۔ مگر آپ کے حواری (خاص جاں نثار و مددگار) صرف انصار ہی نہ تھے، مہاجر بھی تھے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے جنگ خندق کے دوران میں تین دفعہ پوچھا : ’’کون ہے جو بنوقریظہ کی خبر لائے گا؟‘‘ تینوں دفعہ زبیر رضی اللہ عنہ نے اپنے آپ کو پیش کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا  : ’’ہر نبی کے حواری ہوتے ہیں، میرا حواری زبیر ہے۔‘‘ [مسلم، فضائل الصحابۃ، باب من فضائل طلحۃ … : ۲۴۱۵، عن جابر بن عبد اللہ رضی اللہ عنہما ]"
    },
    {
      "Ayah": 53,
      "tafsir": ""
    },
    {
      "Ayah": 1,
      "tafsir": "(آیت 54) {وَ مَكَرُوْا وَ مَكَرَ اللّٰهُ… :} شیخ شنقیطی نے فرمایا : ’’یہاں نہ یہود کی خفیہ تدبیر کا ذکر ہے اور نہ اللہ تعالیٰ کی خفیہ تدبیر کا، مگر دوسری جگہ ان کی تدبیر کا ذکر کیا ہے کہ انھوں نے آپ کو قتل کرنے کا ارادہ کر لیا تھا، جیسا کہ فرمایا: «وَ قَوْلِهِمْ اِنَّا قَتَلْنَا الْمَسِيْحَ عِيْسَى ابْنَ مَرْيَمَ رَسُوْلَ اللّٰهِ» [اللنساء : ۱۵۷ ] ’’اور ان کے یہ کہنے کی وجہ سے کہ بلاشبہ ہم نے ہی مسیح عیسیٰ ابن مریم کو قتل کیا، جو اللہ کا رسول تھا۔‘‘ اور اللہ کی خفیہ تدبیر کا ذکر فرمایا ہے : «وَ لٰكِنْ شُبِّهَ لَهُمْ» [النساء : ۱۵۷ ] ’’اور لیکن ان کے لیے (کسی کو اس مسیح کا)شبیہ بنا دیا گیا۔‘‘ وہ عیسیٰ علیہ السلام کی شبیہ کو سولی دے کر سمجھ بیٹھے کہ ہم نے مسیح کو قتل کر دیا۔‘‘ مزید تفصیل کے لیے دیکھیے سورۂ نساء (۱۵۷)۔"
    },
    {
      "Ayah": 55,
      "tafsir": "(آیت55) ➊ {مُتَوَفِّيْكَ وَ رَافِعُكَ اِلَيَّ:} { ’’ وَفَي يَفِيْ‘‘ } کا معنی پورا ہونا یا پورا کرنا ہے۔ {’’اِسْتَوْفَي‘‘} اور {’’ تَوَفّٰي‘‘ } کا معنی پورا لے لینا ہے۔ {’’ اِسْتَوْفَيْتُ مِنْهُ وَ تَوَفَّيْتُ‘‘} کا معنی ہے ’’میں نے اس سے پورا حق لے لیا۔‘‘ اس بنا پر {”مُتَوَفِّيْكَ“} کا معنی ہے ’’میں تمھیں پورا لینے والا ہوں ‘‘ اور یہ اسی صورت میں ہو سکتا ہے کہ عیسیٰ علیہ السلام کو روح و بدن دونوں کے ساتھ اٹھا لیا جاتا۔ بعض نے اس کا معنی ’’(وقت پر) فوت کرنے والا ہوں ‘‘ کیا ہے اور میں نے ترجمہ کیا ہے ’’قبض کرنے والا ہوں۔‘‘ اس میں دونوں معنی آ جاتے ہیں۔ یوں تو قرآن میں {’’ تَوَفِّيْ ‘‘} کا معنی سلا دینا بھی آیا ہے، جیسا کہ فرمایا : «وَ هُوَ الَّذِيْ يَتَوَفّٰىكُمْ بِالَّيْلِ » [الأنعام: ۶۰ ]’’اور وہی ہے جو تمھیں رات کو قبض کر لیتا (سلا دیتا) ہے‘‘ اور فرمایا : «اَللّٰهُ يَتَوَفَّى الْاَنْفُسَ حِيْنَ مَوْتِهَا وَ الَّتِيْ لَمْ تَمُتْ فِيْ مَنَامِهَا » [الزمر : ۴۲ ] ’’اللہ جانوں کو ان کی موت کے وقت قبض کرتا ہے اور ان کو بھی جو نہیں مریں ان کی نیند میں۔‘‘ ¤ شیخ الاسلام امام ابن تیمیہ رحمہ اللہ نے {’’ اَلْجَوَابُ الصَّحِيْحُ ‘‘} میں لکھا ہے کہ لغتِ عرب میں{ ’’تَوَفِّيْ‘‘} کے معنی {’’اِسْتِيْفَاءٌ ‘‘} اور قبض کے آئے ہیں اور یہ نیند کی صورت میں بھی ہو سکتا ہے اور موت کی صورت میں بھی اور یہ {’’ تَوَفِّي الرُّوْحِ مَعَ الْبَدَنِ جَمِيْعًا ‘‘} (روح اور بدن دونوں کو لے لینے) کے معنی میں بھی آتا ہے اور اس آیت میں یہی معنی مراد ہیں۔ خلاصہ یہ کہ اس آیت میں «مُتَوَفِّيْكَ وَ رَافِعُكَ اِلَيَّ » سے عیسیٰ علیہ السلام کا مع جسم آسمان کی طرف اٹھایا جانا مراد ہے، جیسا کہ فرمایا : «وَ رَافِعُكَ اِلَيَّ » ’’اور تجھے اپنی طرف اٹھانے والا ہوں۔‘‘ دوسری جگہ اللہ تعالیٰ نے عیسیٰ علیہ السلام کے قتل اور سولی کی نفی فرمائی اور {’’تَوَفِّيْ‘‘} کا لفظ استعمال کیے بغیر فرمایا : «بَلْ رَّفَعَهُ اللّٰهُ اِلَيْهِ » [النساء : ۱۵۸] ’’بلکہ اللہ نے اسے اپنی طرف اٹھا لیا۔‘‘ ¤ ➋ {وَ جَاعِلُ الَّذِيْنَ اتَّبَعُوْكَ فَوْقَ الَّذِيْنَ كَفَرُوْۤا:} عیسیٰ علیہ السلام کے اول تابع نصاریٰ تھے، ان کے بعد مسلمان ہیں، سو یہ ہمیشہ غالب رہے۔ (موضح) حافظ ابن کثیر رحمہ اللہ لکھتے ہیں کہ ان سے مراد صرف نصاریٰ بھی ہو سکتے ہیں اور مطلب یہ ہے کہ یہود جو مسیح علیہ السلام کے منکر ہیں ان پر نصاریٰ ہمیشہ غالب رہیں گے۔ (ابن کثیر) ¤ اس سے مراد یہ بھی ہے کہ قیامت کے قریب جب مسیح علیہ السلام تشریف لائیں گے تو ان کے پیروکار مسلمان سب کفار پر غالب ہوں گے۔"
    },
    {
      "Ayah": 56,
      "tafsir": ""
    },
    {
      "Ayah": 57,
      "tafsir": ""
    },
    {
      "Ayah": 58,
      "tafsir": ""
    },
    {
      "Ayah": 59,
      "tafsir": "(آیت 59) ➊ { اِنَّ مَثَلَ عِيْسٰى … : } یہ سورت شروع سے لے کر یہاں تک (یعنی پہلی آیت سے ۵۹ تک) وفد نجران کے بارے میں نازل ہوئی ہے۔ اس وفد نے رسول اللہ صلی اللہ علیہ وسلم سے بحث کے دوران عیسیٰ علیہ السلام کی {’’ بُنُوَّة ‘‘} (اللہ کا بیٹا ہونے) پر اس سے استدلال کیا کہ وہ بغیر باپ کے پیدا ہوئے ہیں، اس آیت میں اللہ تعالیٰ نے تردید فرمائی کہ اگر بغیر باپ کے پیدا ہونا اللہ کا بیٹا ہونے کی دلیل ہو سکتا ہے تو آدم علیہ السلام جو ماں باپ دونوں کے بغیر پیدا ہوئے وہ بالاولیٰ اللہ کا بیٹا کہلانے کے حق دار ہیں، مگر یہ عقیدہ بالکل باطل ہے۔ اصل میں اللہ تعالیٰ نے آدم علیہ السلام کی طرح مسیح علیہ السلام کو بھی {’’ كُنْ ‘‘} سے پیدا کرکے اپنی قدرتِ کاملہ کو ظاہر فرمایا ہے۔ (ابن کثیر) ¤ ➋ {”مِنْ تُرَابٍ“} میں تنوین تقلیل یا تحقیر کے لیے ہے، اس لیے ترجمہ کیا ہے ’’تھوڑی سی مٹی۔ ‘‘"
    },
    {
      "Ayah": 60,
      "tafsir": "(آیت 60){اَلْحَقُّ مِنْ رَّبِّكَ … :} یعنی عیسیٰ علیہ السلام کے بارے میں تمھارے سامنے جو حق بیان ہوا ہے یہ تیرے رب کی طرف سے ہے۔ {’’ اَلْحَقُّ ‘‘} میں الف لام عہد کا ہے جس کا اشارہ گزشتہ بیان کی طرف ہے، اس لیے ترجمہ ’’یہ حق تیرے رب کی طرف سے ہے‘‘ کیا گیا ہے۔ اور اس میں شک و شبہ کی ہر گز گنجائش نہیں ہے۔ (ابن کثیر) یہ خطاب بظاہر نبی صلی اللہ علیہ وسلم سے ہے مگر مقصود تمام مسلمانوں کو تنبیہ کرنا ہے۔ (رازی)"
    },
    {
      "Ayah": 61,
      "tafsir": "(آیت 61) ➊ { فَمَنْ حَآجَّكَ فِيْهِ مِنْۢ بَعْدِ مَا جَآءَكَ مِنَ الْعِلْمِ:} سورت کے شروع سے لے کر یہاں تک اللہ تعالیٰ کی توحید، مسیح علیہ السلام کی ولادت کا بیان اور ان کا اللہ یا اللہ کا بیٹا نہ ہونا زبردست علمی دلائل کے ساتھ بیان ہوا، اب حکم ہوا کہ جو شخص اتنے واضح دلائل کے بعد بھی نہ مانے تو وہ عناد پر آمادہ ہے، اس سے بحث کا کوئی فائدہ نہیں، پھر انھیں مباہلہ کی دعوت دو۔ ¤ ➋ مباہلہ کی صورت یہ بیان فرمائی کہ آؤ ہم اپنے بیٹوں اور تمھارے بیٹوں کو بلا لیں اور اپنی عورتوں اور تمھاری عورتوں کو بھی اور اپنے آپ کو اور تمھیں بھی، پھر گڑ گڑا کر دعا کریں، پس جھوٹوں پر اللہ کی لعنت بھیجیں۔ ¤ ’’ {بَهَلَ يَبْهَلُ} (ف)‘‘ کا معنی لعنت کرنا ہے اور{ ’’ بَاهَلَ مُبَاهَلَةً ‘‘} اور {’’ اِبْتَهَلَ يَبْتَهِلُ ‘‘} کا معنی ایک دوسرے پر لعنت کی دعا کرنا ہے، چونکہ یہ دعا نہایت خلوص اور عاجزی سے ہوتی ہے، اس لیے {’’اِبْتَهَلَ‘‘} کا لفظ عاجزی سے دعا کرنے کے معنوں میں بھی استعمال ہوتا ہے۔ ¤ ➌ سعد بن ابی وقاص رضی اللہ عنہ بیان کرتے ہیں کہ جب یہ آیت نازل ہوئی : «فَقُلْ تَعَالَوْا نَدْعُ اَبْنَآءَنَا وَ اَبْنَآءَكُمْ …» تو رسول اللہ صلی اللہ علیہ وسلم نے علی، فاطمہ اور حسن و حسین رضی اللہ عنہم کو بلایا، پھر فرمایا : [ اَللّٰهُمَّ هٰؤُلاَءِ اَهْلِيْ ] ’’اے اللہ ! یہ میرے اہل ہیں۔‘‘ [مسلم، فضائل الصحابۃ، باب من فضائل علی بن أبی طالب رضی اللہ عنہ : ۳۲؍۲۴۰۴ ] ¤ مگر اہل نجران مباہلہ سے ڈر گئے اور انھوں نے جزیہ دینا منظور کر لیا، جیسا کہ حذیفہ رضی اللہ عنہ سے روایت ہے کہ عاقب اور السید نجران والے رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، وہ آپ سے مباہلہ کا ارادہ رکھتے تھے تو ان میں سے ایک نے دوسرے سے کہا : ’’ایسا مت کرو، کیونکہ اللہ کی قسم ! اگر یہ نبی ہوئے اور ہم نے مباہلہ کر لیا تو نہ ہم کبھی فلاح پائیں گے اور نہ ہمارے بعد ہماری نسل۔‘‘ تو دونوں نے کہا : ’’آپ نے ہم سے جو مطالبہ کیا ہے ہم آپ کو دیں گے اور آپ ہمارے ساتھ کوئی امین آدمی بھیج دیں اور کسی اور کو نہیں صرف امانت دار کو بھیجیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یقینا میں تمھارے ساتھ ایک سچے پکے امانت دار کو بھیجوں گا۔‘‘ تو اصحاب رسول صلی اللہ علیہ وسلم نے اس کے لیے گردنیں اٹھائیں (کہ کس پر آپ کی نظر پڑتی ہے) تو آپ نے فرمایا : ’’اے ابوعبیدہ بن جراح ! اٹھو۔‘‘ جب وہ کھڑے ہوئے تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’یہ اس امت کا امین ہے۔‘‘ [بخاری، المغازی، باب قصۃ أہل نجران : ۴۳۸۰ ] ابن عباس رضی اللہ عنہما فرماتے ہیں : ’’اگر وہ لوگ نبی صلی اللہ علیہ وسلم سے مباہلہ کرتے تو اس حال میں واپس جاتے کہ نہ اپنے اہل کو پاتے اور نہ مال کو۔‘‘ ( طبری بسند حسن) ¤ ➍ اس آیت سے علماء نے استدلال کیا ہے کہ ضد میں آ کر حق سے انکار کرنے والے سے مباہلہ ہو سکتا ہے۔ اگر دیکھا جائے تو لعان بھی مباہلہ کی ایک صورت ہے۔ ¤ ➎ {وَ نِسَآءَنَا وَ نِسَآءَكُمْ وَ اَنْفُسَنَا وَ اَنْفُسَكُمْ:} آیت مباہلہ میں اپنے بییٹوں اور اپنی عورتوں کو بلانے کا ذکر ہے۔ { ”نِسَآءَ“ } (عورتوں) کا لفظ بیویوں پر استعمال ہوتا ہے، جیسا کہ سورۂ احزاب میں بار بار نبی صلی اللہ علیہ وسلم کی بیویوں کو { ”يٰنِسَآءَ النَّبِيِّ“ } کہہ کر مخاطب کیا گیا ہے اور انھیں اہل بیت کہہ کر خطاب کیا ہے۔ ( دیکھیے احزاب : ۳۰ تا ۳۴ ) اولاد پر بیٹیوں کا لفظ آتا ہے نہ کہ عورتوں کا، ہاں، دوسری عورتوں کے ساتھ مل کر ان پر بھی یہ لفظ آ سکتا ہے۔ یہاں بعض لوگوں کا کہنا ہے کہ آپ نے فاطمہ، علی اور حسن و حسین رضی اللہ عنہم کو بلایا، آپ کے اہل بیت یہی تھے، بیویوں کو نہیں بلایا، حالانکہ کسی حدیث میں بیویوں کو نہ بلانے کا ذکر نہیں ہے اور یہ طے شدہ قاعدہ ہے کہ کسی چیز کا ذکر نہ ہونے سے اس کی نفی نہیں ہوتی، بلکہ احادیث میں تو دوسرے صحابہ کو بلانے کا یا ان کے آنے کا بھی ذکر نہیں، تو کیا وہاں اور کوئی بھی موجود نہ تھا۔ حقیقت یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم  کے گھر والے تو آپ کی بیویاں ہی تھیں، بیٹا کوئی زندہ نہ تھا، اس لیے آپ نے اللہ تعالیٰ سے دعا کرکے آل علی کو اپنے اہل میں شامل کروایا، دلیل اس کی لفظ {”اَللَّهُمَّ“} ہے اور یہ تو معروف ہے کہ بیٹی کی اولاد کی نسبت اس کے خاوند اور خاوند کے آباء و اجداد کی طرف ہوتی ہے، نہ کہ نانا کی طرف۔ ہاں، یہ علی، فاطمہ اور حسن و حسین رضی اللہ عنہم کی خصوصیت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی دعا سے وہ بھی اہل بیت ہیں، مگر بیویوں کو جو اصل گھر والی ہیں انھیں گھر والوں ہی سے نکال دینا محض تعصب ہے، حالانکہ اللہ تعالیٰ انھیں گھر والیاں فرما رہا ہے، فرمایایا : «لِيُذْهِبَ عَنْكُمُ الرِّجْسَ اَهْلَ الْبَيْتِ » [الأحزاب : ۳۳ ] ’’اللہ تو یہی چاہتا ہے کہ تم سے گندگی دور کر دے اے اہل بیت!‘‘ اور جبریل علیہ السلام ابراہیم علیہ السلام کی بیوی سارہ علیہا السلام کو «رَحْمَتُ اللّٰهِ وَ بَرَكٰتُهٗ عَلَيْكُمْ اَهْلَ الْبَيْتِ» کے الفاظ سے مخاطب کر رہے ہیں، یعنی ’’ اللہ کی رحمت اور اس کی برکتیں ہوں تم پر اے اہل بیت!‘‘ [ہود : ۷۳ ]"
    },
    {
      "Ayah": 62,
      "tafsir": ""
    },
    {
      "Ayah": 63,
      "tafsir": ""
    },
    {
      "Ayah": 64,
      "tafsir": "(آیت 64) ➊ { قُلْ يٰۤاَهْلَ الْكِتٰبِ …:} اس آیت میں اہل کتاب کو تین مشترکہ باتوں کی دعوت دینے کا حکم دیا گیا ہے :(1) اللہ تعالیٰ کے سوا ہم کسی کی عبادت نہ کریں۔ (2) اس کے ساتھ کسی چیز کو شریک نہ ٹھہرائیں۔ (3) اور ہم میں سے کوئی کسی کو اللہ کے سوا رب نہ بنائے۔ تورات و انجیل میں تحریف کے باوجود تورات تو اب بھی توحید سے اور شرک کی ممانعت سے لبریز ہے، انجیل میں بھی یہی تعلیم متفرق طور پر موجود ہے، جیسے : ’’تو خداوند خدا کو سجدہ کر اور صرف اسی کی عبادت کر۔‘‘ [متّی : ۴ : ۱۰ ] بلکہ یہ بھی ہے : ’’زمین پر اللہ کے احکام پر عمل ہونا چاہیے۔ تیری بادشاہی آئے۔ تیری مرضی جیسی آسمان پر پوری ہوتی ہے زمین پر بھی ہو۔‘‘ [متّی : ۶ : ۱۰ ] ¤ ➋ اہل کتاب تینوں باتوں کی مخالفت کر رہے تھے، یہود نے عزیر کو اور نصاریٰ نے مسیح کو اللہ کا بیٹا قرار دے کر ان کی پرستش شروع کر دی اور دونوں نے اپنے اپنے احبار و رہبان کی حلال کردہ چیزوں کو حلال اور حرام کردہ کو حرام ٹھہرا کر انھیں رب ہونے کا درجہ دے دیا۔ تفصیل کے لیے دیکھیے سورۂ توبہ (۳۰، ۳۱) اور ان کے حواشی۔ ¤ ➌ رسول اللہ صلی اللہ علیہ وسلم نے اللہ تعالیٰ کے حکم کے مطابق اہل کتاب کو اس مشترکہ عقیدہ کی دعوت دی، جو قریب تھے انھیں براہِ راست دعوت دی اور جو دور تھے انھیں خط لکھے، چنانچہ شاہ روم ہرقل کو خط لکھا تو اسلام کی دعوت دینے کے ساتھ زیر تفسیر آیت بھی لکھی، جیسا کہ صحیح بخاری ’’کتاب التفسیر (۴۵۵۳)‘‘ میں مذکور ہے۔ ¤ ➍ { فَاِنْ تَوَلَّوْا فَقُوْلُوا اشْهَدُوْا بِاَنَّا مُسْلِمُوْنَ:} یعنی اگر اہل کتاب اس عقیدہ کے ماننے سے انحراف کریں تو تم اپنی طرف سے اس عقیدہ پر قائم رہنے کا اعلان کر دو۔ اس میں متنبہ کیا ہے کہ اہل کتاب اس عقیدہ سے منحرف ہو چکے ہیں، کیونکہ انھوں نے عزیر اور عیسیٰ علیہما السلام کو اللہ کے بیٹے قرار دے دیا تھا۔ علاوہ ازیں انھوں نے اپنے انبیاء اور صالحینن کی قبروں کو سجدہ گاہیں بنا لیا تھا۔"
    },
    {
      "Ayah": 65,
      "tafsir": "(آیت 65) {يٰۤاَهْلَ الْكِتٰبِ لِمَ تُحَآجُّوْنَ …:} یہود ابراہیم علیہ السلام کے یہودی ہونے کے دعوے دار تھے اور نصاریٰ ان کے نصرانی ہونے کے اور یہ بات ایسی تھی جو واضح طور پر غلط تھی۔ ابراہیم علیہ السلام کا زمانہ موسیٰ علیہ السلام سے ہزاروں برس پہلے کا ہے، یہ تورات و انجیل ان کے بہت بعد نازل ہوئیں تو وہ یہودی یا نصرانی کیسے ہوئے؟ بھلا یہ کوئی ایسی بات ہے جس پر عقلمند لوگ باہمی جھگڑے میں مشغول ہوں۔ ہماری امت میں سے بھی اگر بعد میں بننے والا کوئی گروہ جو : { ”مَا اَنَا عَلَيْهِ وَ اَصْحَابِيْ“} پر قائم نہ ہو اور دعویٰ کرے کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے گروہ سے تھے تو اس سے یہی کہا جائے گا کہ تمھاری تو بنیاد ہی بعد میں رکھی گئی، جب کہ رسول اللہ صلی اللہ علیہ وسلم دنیا سے رخصت ہو چکے تھے تو آپ صلی اللہ علیہ وسلم تمھارے گروہ میں کیسے شامل ہو گئے؟"
    },
    {
      "Ayah": 66,
      "tafsir": "(آیت 66){ لَيْسَ لَكُمْ بِهٖ عِلْمٌ:} یعنی اس دین ابراہیمی سے متعلق۔ مراد یہ ہے کہ جب تم تورات و انجیل ہی کے مسائل میں بھٹکے اور کیسے بھٹکے، حالانکہ وہاں کچھ علم تمھیں حاصل تھا، تو اب دینِ ابراہیمی کے بارے میں کیوں کٹ حجتی پر تلے ہو، جس کے بارے میں تو تمھیں علم کا شائبہ بھی حاصل نہیں؟ (ماجدی) اس آیت میں نہ صرف غلط طور پر جھگڑا کرنے سے منع کیا گیا ہے بلکہ مطلقاً جھگڑے سے گریز کی نصیحت بھی کی ہے۔ (ابن کثیر، فتح القدیر )"
    },
    {
      "Ayah": 67,
      "tafsir": "(آیت 67) {مَا كَانَ اِبْرٰهِيْمُ يَهُوْدِيًّا وَّ لَا نَصْرَانِيًّا …:} اس آیت میں اشارہ ہے کہ یہود و نصاریٰ ابراہیم علیہ السلام کو اپنے اپنے گروہ میں شمار کرتے ہیں، حالانکہ یہ مشرک ہیں، کیونکہ انھوں نے اپنے مشائخ اور علماء کو رب اور ان کے اقوال کو شریعت بنا رکھا ہے اور عزیر و عیسیٰ علیہما السلام کو اللہ کا بیٹا اور نبیوں اور ولیوں کی قبروں کو مسجدیں بنائے ہوئے ہیں، جب کہ ابراہیم علیہ السلام ایک اللہ کی پرستش کرنے والے مسلم تھے، وہ مشرکین میں سے نہیں تھے۔ کچھ ایسا ہی حال اس امت کا بھی ہے کہ ہر فرقے والے رسول اللہ صلی اللہ علیہ وسلم کو اپنے اپنے گروہ میں شامل کرتے ہیں، حالانکہ وہ سب گروہ بہت بعد میں بنے اور انھوں نے اپنے اپنے سربراہوں کے اقوال کو شریعت قرار دے کر ان سربراہوں کو اللہ کا درجہ دے دیا۔ جب کہ رسول اللہ صلی اللہ علیہ وسلم صرف {”مَا اَنْزَلَ اللّٰهُ“} (اللہ کے نازل کر دہ دین) پر چلنے والے مسلم تھے اور ہر گز مشرک نہ تھے۔"
    },
    {
      "Ayah": 68,
      "tafsir": "(آیت 68) {اِنَّ اَوْلَى النَّاسِ بِاِبْرٰهِيْمَ …:} مطلب یہ کہ اگر تم اس معنی میں ابراہیم علیہ السلام کو یہودی یا نصرانی کہتے ہو کہ ان کی شریعت تمھاری شریعت سے ملتی جلتی ہے تو یہ بھی غلط ہے، کیونکہ ابراہیم علیہ السلام کے پیروکاروں کے بعد ان کے سب سے زیادہ قریب یہ نبی محمد صلی اللہ علیہ وسلم اور ان پر ایمان لانے والے ہیں۔ اس اعتبار سے مسلمانوں کو یہ کہنے کا حق تم سے زیادہ پہنچتا ہے کہ ہم اس طریقہ پر ہیں جس پر ابراہیم علیہ السلام تھے۔ ¤ عبد اللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ لِكُلِّ نَبِيٍّ وُلاَةً مِنَ النَّبِيِّيْنَ وَ إِنَّ وَلِيِّيْ أَبِيْ وَ خَلِيْلُ رَبِّيْ ] ’’ہر نبی کے لیے نبیوں میں سے کچھ دوست ہیں، جن سے اس کا خصوصی تعلق ہوتا ہے اور میرا (خاص تعلق والا) دوست میرا باپ اور میرے رب کا خلیل ہے۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی۔ [ترمذی، تفسیر القرآن، باب و من سورۃ آل عمران : ۲۹۹۵۔ صحیح ]"
    },
    {
      "Ayah": 69,
      "tafsir": "(آیت 69) {وَدَّتْ طَّآىِٕفَةٌ … :} اس گروہ کی سازشوں کا ذکر اسی سورت (۷۲، ۷۳) میں آ رہا ہے۔ فرمایا یہ لوگ مسلمانوں کو یہودی بنانے کی کوشش میں لگے ہوئے ہیں، مسلمان ان کے بہکاوے میں کیا آئیں گے، وہ تو ایمان میں پختہ ہیں، یہ خود ہی مارے جائیں گے، مگر انھیں اس کا شعور ہی نہیں۔"
    },
    {
      "Ayah": 70,
      "tafsir": "(آیت 70){لِمَ تَكْفُرُوْنَ بِاٰيٰتِ اللّٰهِ …:} اللہ کی آیات سے مراد رسول اللہ صلی اللہ علیہ وسلم کی نبوت کی وہ بشارتیں ہیں جو پہلے انبیاء سے منقول تھیں۔ یہود ان کو صحیح سمجھتے تھے مگر مانتے نہیں تھے۔ اللہ کی آیات سے رسول اللہ صلی اللہ علیہ وسلم کی بشارتوں پر مشتمل آیات کے ساتھ ساتھ عقائد و احکام وغیرہ پر مشتمل دوسری آیات بھی مراد ہو سکتی ہیں، یعنی وہ لوگ صرف آپ صلی اللہ علیہ وسلم سے متعلق ہی نہیں، بلکہ دوسری آیات کو بھی اللہ کا کلام سمجھنے کے باوجود ان پر ایمان نہیں لاتے تھے۔"
    },
    {
      "Ayah": 71,
      "tafsir": "(آیت 71){لِمَ تَلْبِسُوْنَ الْحَقَّ بِالْبَاطِلِ …:} اہل کتاب کی مذہبی بدبختیوں کی طرف اشارہ ہے، اس سے پہلی آیت میں علمائے یہود کی یہ بدبختی بیان کی گئی ہے کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے سچا پیغمبر ہونے کے دلائل جان لینے کے باوجود کفر کر رہے ہیں، اب یہاں بتایا جا رہا ہے کہ حق کو باطل کے ساتھ ملانا اور حق کو چھپانا ان کا عام شیوہ بن چکا ہے۔ پہلی آیت میں ان کی اپنی گمراہی کا بیان تھا، اس آیت میں دوسروں کو گمراہ کرنے کا ذکر ہے۔(رازی) مزید دیکھیے سورۂ بقرہ (۴۲)۔ یہ مقام عبرت ہے کہ ہمارے دور کے فرقہ پرست علماء اور تجدد زدہ حضرات بھی دنیوی اور مادی اغراض و مصالح کے پیش نظر قرآن مجید سے وہی سلوک کر رہے ہیں جو ان کے پیش رو تورات و انجیل کے ساتھ کرتے رہے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے بالکل صحیح فرمایا : [ لَتَتَّبِعُنَّ سُنَنَ مَنْ كَانَ قَبْلَكُمْ ] [بخاری، أحادیث الأنبیاء، باب ما ذکر عن بنی إسرائیل : ۳۴۵۶ ] ’’تم لازماً پہلی امتوں کے نقش قدم پر چلو گے۔‘‘"
    },
    {
      "Ayah": 72,
      "tafsir": "(آیت 72) {لِمَ تَلْبِسُوْنَ الْحَقَّ بِالْبَاطِلِ …:} کمزور ایمان والے مسلمانوں کے دلوں میں اسلام کے متعلق شکوک و شبہات پیدا کرنے کے لیے یہود مختلف سازشیں کرتے رہتے تھے، یہ بھی اس سلسلہ کی ان کی ایک سازش کا بیان ہے کہ صبح کے وقت قرآن اور پیغمبر پر ایمان کا اظہار کرو اور شام کو کفر و انحراف کا اعلان کر دو، ممکن ہے یہ طریقہ اختیار کرنے سے بعض مسلمان بھی سوچنے لگیں کہ یہ پڑھے لکھے لوگ مسلمان ہونے کے بعد اس تحریک سے الگ ہو گئے ہیں تو آخر انھوں نے کوئی خرابی یا کمزور پہلو ضرور دیکھا ہو گا۔ (ابن کثیر، شوکانی)"
    },
    {
      "Ayah": 73,
      "tafsir": "(آیت 74،73) {وَ لَا تُؤْمِنُوْۤا اِلَّا لِمَنْ تَبِعَ دِيْنَكُمْ …:} یہ بھی ان گروہوں کا کلام ہے جن کا ذکر چلا آ رہا ہے اور اس سے ان کا مذہبی تعصب اور حسد ظاہر ہو رہا ہے کہ وہ اپنے متبعین کو تاکید کرتے رہتے ہیں : « وَ لَا تُؤْمِنُوْۤا اِلَّا لِمَنْ تَبِعَ دِيْنَكُمْ » امام طبری نے اس کا مطلب یہ بیان فرمایا ہے کہ اپنے ہم مشرب کے سوا کسی کی بات پر یقین نہ کرو، نہ یہ تسلیم کرو کہ تمھاری طرح کسی اور کو بھی نبوت دی جا سکتی ہے اور نہ یہ مانو کہ مسلمان اللہ تعالیٰ کے حضور جا کر  تم پر کوئی حجت قائم کر سکیں گے۔ اس صورت میں «قُلْ اِنَّ الْهُدٰى هُدَى اللّٰهِ » جملہ معترضہ ہو گا اور اس کا ربط « قُلْ اِنَّ الْفَضْلَ بِيَدِ اللّٰهِ » کے ساتھ ہو گا۔ (ابن کثیر، ابن جریر) یہاں تک ان کی دینی خیانت اور مذہبی تعصب کا بیان تھا، اب اگلی آیت میں ان کی مالی خیانت اور مسلمانوں سے بغض کا بیان ہے۔ (رازی)"
    },
    {
      "Ayah": 74,
      "tafsir": "(آیت 74،73) {وَ لَا تُؤْمِنُوْۤا اِلَّا لِمَنْ تَبِعَ دِيْنَكُمْ …:} یہ بھی ان گروہوں کا کلام ہے جن کا ذکر چلا آ رہا ہے اور اس سے ان کا مذہبی تعصب اور حسد ظاہر ہو رہا ہے کہ وہ اپنے متبعین کو تاکید کرتے رہتے ہیں : « وَ لَا تُؤْمِنُوْۤا اِلَّا لِمَنْ تَبِعَ دِيْنَكُمْ » امام طبری نے اس کا مطلب یہ بیان فرمایا ہے کہ اپنے ہم مشرب کے سوا کسی کی بات پر یقین نہ کرو، نہ یہ تسلیم کرو کہ تمھاری طرح کسی اور کو بھی نبوت دی جا سکتی ہے اور نہ یہ مانو کہ مسلمان اللہ تعالیٰ کے حضور جا کر  تم پر کوئی حجت قائم کر سکیں گے۔ اس صورت میں «قُلْ اِنَّ الْهُدٰى هُدَى اللّٰهِ » جملہ معترضہ ہو گا اور اس کا ربط « قُلْ اِنَّ الْفَضْلَ بِيَدِ اللّٰهِ » کے ساتھ ہو گا۔ (ابن کثیر، ابن جریر) یہاں تک ان کی دینی خیانت اور مذہبی تعصب کا بیان تھا، اب اگلی آیت میں ان کی مالی خیانت اور مسلمانوں سے بغض کا بیان ہے۔ (رازی)"
    },
    {
      "Ayah": 75,
      "tafsir": "(آیت 75) ➊ {وَ مِنْ اَهْلِ الْكِتٰبِ مَنْ اِنْ تَاْمَنْهُ بِقِنْطَارٍ يُّؤَدِّهٖۤ اِلَيْكَ:} اللہ تعالیٰ کا انصاف ملاحظہ فرمائیں کہ اہلِ کتاب کی مذمت کے دوران بھی اگر ان کے کچھ لوگوں میں کوئی خوبی تھی تو اس کا اعتراف فرمایا ہے، مذمت صرف ان کی فرمائی ہے جو اس کے حق دار تھے۔ ایک خزانہ امانت ادا کر دینے والوں کی بہترین مثال صحیح بخاری میں مذکور وہ تفصیلی واقعہ ہے جس میں بنی اسرائیل کے ایک شخص نے دوسرے اسرائیلی سے ایک ہزار دینار قرض مانگا، پھر پہنچانے کے لیے کشتی نہ ملنے پر لکڑی میں ڈال کر سمندر کے حوالے کر دیا، پھر بعد میں خود بھی لے کر حاضر ہوا۔ مگر دوسرے نے بھی امانت کا مظاہرہ کیا اور بتایا کہ مجھے تمھاری طرف سے لکڑی میں بھیجی ہوئی رقم مل گئی تھی۔ [بخاری، الکفالۃ، باب الکفالۃ فی القرض … : ۲۲۹۱ ] ¤ ➋ {وَ مِنْهُمْ مَّنْ اِنْ تَاْمَنْهُ بِدِيْنَارٍ لَّا يُؤَدِّهٖۤ اِلَيْكَ …:} سر پر کھڑا رہنے کے بغیر ایک دینار بھی ادا نہ کرنے کی وجہ ان کے کہنے کے مطابق یہ ہے کہ اُمّی (عرب) لوگوں کا مال کھا جانے میں ہم پر کوئی گرفت نہیں ہو گی۔ اللہ تعالیٰ نے فرمایا کہ یہ جان بوجھ کر اللہ تعالیٰ پر بہتان بانباندھ رہے ہیں، کیونکہ اللہ تعالیٰ نے کبھی امانت میں خیانت کا حکم نہیں دیا، خواہ وہ اسرائیلی ہو یا عرب، بلکہ اسلام نے تو کسی ذمی کے مال کو بھی بلا اجازت لینا جائز قرار نہیں دیا اور کسی حربی کافر کے مال کو بھی خیانت سے کھانے کی اجازت نہیں دی، چنانچہ فرمایا : «اِنَّ اللّٰهَ يَاْمُرُكُمْ اَنْ تُؤَدُّوا الْاَمٰنٰتِ اِلٰۤى اَهْلِهَا » [النساء : ۵۸ ]’’بے شک اللہ تمھیں حکم دیتا ہے کہ امانتیں ان کے حق داروں کو ادا کرو۔‘‘ افسوس کہ یہود کی طرح بعض مسلمان بھی کفار کے ممالک میں سود کے لین دین کے لیے کہتے ہیں کہ دار الحرب میں سود جائز ہے اور دار الحرب بھی اپنی مرضی کا بنایا ہوا ہے، خواہ ان سے جنگ ہو رہی ہو یا نہ۔ ¤ ➌ ہمارے ایک تاجر دوست نے اس آیت سے استدلال کیا کہ کوئی شخص کتنا بھی قرض واپس نہ کرنے والا ہو اگر آپ بار بار اس سے تقاضا کرتے رہیں گے تو آخر کار آپ کے پیسے نکل آئیں گے، بشرطیکہ آپ نہ اس سے لڑیں، نہ اسے لڑنے کا موقع دیں، کیونکہ پھر بار بار تقاضا ممکن نہیں رہتا۔ اس نے کہا یہ میرا تجربہ ہے۔"
    },
    {
      "Ayah": 76,
      "tafsir": "(آیت 76) {”بَلٰى“} (کیوں نہیں) یعنی اس بدعہدی اور خیانت پر ضرور مؤاخذہ ہو گا۔ اللہ تعالیٰ کا پسندیدہ اور محبوب شخص تو وہی ہے جو اللہ تعالیٰ اور بندوں سے کیا ہوا عہد پورا کرتا ہے (اس میں رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے کا عہد بھی داخل ہے) اور پھر ہر معاملہ میں اللہ تعالیٰ سے ڈرتا ہے اور اس شریعت کا اتباع کرتا ہے جو آپ صلی اللہ علیہ وسلم لے کر مبعوث ہوئے۔"
    },
    {
      "Ayah": 77,
      "tafsir": "(آیت 77){ اِنَّ الَّذِيْنَ يَشْتَرُوْنَ …: } عبد اللہ بن ابی اوفیٰ رضی اللہ عنہ سے روایت ہے کہ ایک شخص نے بازار میں کچھ سامانِ تجارت لا کر رکھا، پھر اس پر قسم کھا کر کہا کہ میں نے اس سامان کے اتنے روپے دیے، حالانکہ اس نے اتنے روپے نہیں دیے تھے (یا کہا کہ مجھے اس سامان کے اتنے روپے مل رہے تھے، حالانکہ اسے اتنے روپے نہیں مل رہے تھے) قسم کا مقصد یہ تھا کہ کسی مسلمان کو اس میں پھنسا لے تو اس پر یہ آیت اتری : «اِنَّ الَّذِيْنَ يَشْتَرُوْنَ بِعَهْدِ اللّٰهِ وَ اَيْمَانِهِمْ ثَمَنًا قَلِيْلًا » [بخاری، البیوع، باب ما یکرہ من الحلف فی البیع : ۲۰۸۸، ۴۵۵۱ ] یعنی جو لوگ بدعہدی، خیانت اور جھوٹی قسمیں کھا کر لوگوں کا مال کھاتے ہیں اللہ تعالیٰ ان پر ایسا ناراض ہو گا کہ نہ آخرت میں ان کا کچھ حصہ ہو گا، نہ اللہ ان سے کلام کرے گا، نہ انھیں (نظر رحمت سے) دیکھے گا، نہ انھیں پاک کرے گا اور ان کے لیے دردناک عذاب ہو گا۔ عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جس شخص نے جھوٹی قسم کھائی، تاکہ اس کے ساتھ کسی مسلمان کا مال ہڑپ کر لے تو وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ وہ اس پر سخت غصے ہو گا۔‘‘ تو اللہ تعالیٰ نے اس کی تصدیق میں (زیر تفسیر) یہ آیت اتاری۔ [بخاری، التفسیر، باب { إن الذين يشترون بعهد الله … :} ۴۵۴۹ ] ¤ ابو ذر رضی اللہ عنہ بیان کرتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : ’’تین شخص ایسے ہیں جن سے نہ تو اللہ تعالیٰ کلام کرے گا، نہ قیامت کے دن ان کی طرف دیکھے گا اور نہ ان کو پاک کرے گا۔ (وہ یہ ہیں) اپنے کپڑے کو لٹکانے والا، احسان کر کے جتلانے والا اور اپنے سودے کو جھوٹی قسم کے ساتھ بیچنے والا۔‘‘ [مسلم، الإیمان، باب بیان غلظ تحریم الإسبال …: ۱۰۶، عن أبی ذر رضی اللہ عنہ ]"
    },
    {
      "Ayah": 78,
      "tafsir": "(آیت 78){وَ اِنَّ مِنْهُمْ لَفَرِيْقًا يَّلْوٗنَ اَلْسِنَتَهُمْ بِالْكِتٰبِ … :} اس کا عطف پہلی آیت پر ہے، جس سے ثابت ہوتا ہے کہ اوپر کی آیت بھی یہود کے بارے میں نازل ہوئی ہے (اگرچہ لفظ عام ہونے کی وجہ سے ایسے تمام لوگ اس میں داخل ہیں)۔ (رازی) اس آیت کے معنی یہ ہیں کہ وہ تورات و انجیل میں تحریف کرتے ہیں اور اس میں (خصوصاً ان آیات میں جن میں رسول اللہ صلی اللہ علیہ وسلم کی صفت مذکور ہے) کچھ چیزیں اپنی طرف سے بڑھا کر اس انداز اور لہجہ سے پڑھتے ہیں کہ سننے والا ان کو اللہ کی طرف سے نازل شدہ سمجھ لیتا ہے، حالانکہ وہ اللہ کی طرف سے نازل نہیں ہوئیں، پھر یہی نہیں بلکہ اللہ تعالیٰ سے ان کی بے خوفی اور ڈھٹائی کی حد یہ ہے کہ وہ ان چیزوں کے اللہ کی طرف سے ہونے کا دعویٰ بھی کرتے ہیں، حالانکہ وہ اللہ کی طرف سے نہیں اور جان بوجھ کر اللہ پر جھوٹ بولتے ہیں۔ افسوس، امت محمد صلی اللہ علیہ وسلم میں بھی بہت سے لوگ اسی راہ پر چل رہے ہیں اور وہ اپنی دنیاوی اغراض یا مذہبی فرقہ پرستی کی وجہ سے قرآن کریم کے ساتھ یہ معاملہ کبھی لفظی اور کبھی معنوی تحریف کے ساتھ کرتے ہیں، عوام بے چارے اسے اللہ کا حکم سمجھتے ہیں، حالانکہ وہ مولوی صاحب یا ان کے کسی پیشوا کی بات ہوتی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے سچ فرمایا : ’’یقینًا تم اپنے سے پہلے لوگوں کے طریقوں پر چل پڑو گے۔‘‘ [بخاری، الاعتصام بالکتاب والسنۃ، باب قول النبی صلی اللہ علیہ وسلم : لتتبعن سنن … : ۷۳۲۰ ]"
    },
    {
      "Ayah": 79,
      "tafsir": "(آیت 79) ➊ { مَا كَانَ لِبَشَرٍ … : } تورات و انجیل میں اہل کتاب کی تحریف بیان کرنے کے بعد اشارہ فرمایا ہے کہ انجیل میں عیسیٰ علیہ السلام کی خدائی کے دعویٰ کی خاطر بھی تحریف کی گئی ہے، ورنہ نبی تو بشر ہوتے ہیں اور وحی و نبوت ایسی صفات سے مشرف ہونے کے بعد ان کی طرف سے اپنے الٰہ (خدا) ہونے کا دعویٰ محال ہے۔ (رازی) ¤ ➋ پھر جب نبی کا یہ حق نہیں کہ لوگ اس کی عبادت کریں تو دوسرے مشائخ اور ائمہ اس مرتبے پر کیسے فائز ہو سکتے ہیں اور انھیں یہ حق کیسے حاصل ہو گیا کہ اپنے مریدوں کو چوبیس گھنٹے اپنی صورت آنکھوں اور ذہن کے سامنے رکھنے کا حکم دیں اور ان سے یہ عہد لیں کہ میری ہر بات تمھیں ماننا ہو گی، صحیح معلوم ہو یا غلط اور جب مصیبت پیش آئے تو ہمیں یاد کرو گے۔ بتائیے خدائی اور کیا ہوتی ہے؟ نبی ہونے کی حیثیت سے انبیاء کی پیروی اور ان کا ہر حکم ماننا واجب ہوتا ہے، مشائخ اور ائمہ تو واجب الاتباع بھی نہیں ہوتے۔ ¤ ➌ {كُوْنُوْا عِبَادًا لِّيْ: } اس سے معلوم ہوا کہ عبد المسیح یا عبد الرسول یا عبد المصطفٰی نام رکھنا جائز نہیں۔ ¤ ➍ { ”اَلرَّبَّانِيُّ“ } لفظ ’’رب‘‘ پر الف نون بڑھا کر یاء نسبت کی لگا دی گئی ہے اور اس کے معنی عالم باعمل کے ہیں۔ مبرّد فرماتے ہیں کہ یہ {’’رَبَّهُ يَرُبُّهُ فَهُوَ رَبَّانُ ‘‘} ہے، یعنی صیغہ صفت۔ {’’رَبَّانُ ‘‘ } کے ساتھ ’’یاء ‘‘ ملائی گئی ہے۔(فتح البیان) صحیح بخاری میں ہے کہ ابن عباس رضی اللہ عنہما نے فرمایا، آیت : «كُوْنُوْا رَبّٰنِيّٖنَ » کا معنی ہے حکماء، فقہاء بنو اور کہا : ’’کہا جاتا ہے ’’الربانی‘‘ وہ ہے جو علم کی بڑی باتوں سے پہلے اس کی چھوٹی باتوں کے ساتھ لوگوں کی تربیت کرے۔“ [بخاری، العلم، باب العلم قبل القول والعمل …، بعد ح : ۶۷ ] ¤ ➎ { بِمَا كُنْتُمْ:} اس میں ’’باء‘‘ برائے سببیت ہے، چونکہ تم تعلیم و دراست کا مشغلہ رکھتے ہو، اس لیے تمھیں عالم باعمل اور اللہ کے عبادت گزار بندے بننا چاہیے۔ (بیضاوی) ¤ ➏ { كُوْنُوْا رَبّٰنِيّٖنَ:} شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ہاں، تم کو (اے اہل کتاب !) یہ کہنا ہے کہ تم میں جو آگے دین داری تھی، یعنی کتاب کا پڑھنا اور سکھانا، وہ اب نہیں رہی اب میری صحبت میں پھر وہی کمال حاصل کرو۔‘‘ (موضح) اور یہ بات اب قرآن کریم کے پڑھنے پڑھانے اور سیکھنے سکھانے ہی سے حاصل ہو سکتی ہے۔ ¤ ➐ کسی شخص میں اگر علم اور کتب الٰہیہ کے پڑھنے پڑھانے سے اللہ تعالیٰ کی بندگی کی خصلت پیدا نہیں ہوتی تو یہ مشغلہ وقت ضائع کرنا ہے اور رسول اللہ صلی اللہ علیہ وسلم نے ایسے علم سے پناہ مانگی ہے، آپ دعا کیا کرتے تھے : [ اَللّٰهُمَّ اِنِّيْ أَعُوْذُ بِكَ مِنْ عِلْمٍ لَّا يَنْفَعُ ] [مسلم، الذکر والدعاء، باب فی الأدعیۃ : ۲۷۲۲ ] ’’اے اللہ! میں ایسے علم سے تیری پناہ مانگتا ہوں جو نفع نہ دے۔‘‘ (فتح البیان)"
    },
    {
      "Ayah": 80,
      "tafsir": "(آیت 80) ➊ { وَ لَا يَاْمُرَكُمْ …:} اور نہ نبی کا یہ حق ہے کہ تمھیں اس بات کا حکم دے کہ تم فرشتوں اور نبیوں کو رب بنا لو۔ یہ کام تو صریح کفر ہے، پھر ایک پیغمبر تمھارے مسلمان ہونے کے بعد تمھیں کفر کا حکم کیسے دے سکتا ہے؟ ¤ ➋ اس آیت میں یہود و نصاریٰ کے طرز عمل پر چوٹ ہے، جنھوں نے انبیاء اور فرشتوں کی تعظیم میں اس قدر غلو کیا کہ ان کو رب تعالیٰ کے مقام پر کھڑا کر دیا۔ انبیاء اور صالحین کی قبروں پر عمارتیں بنا کر ان میں ان کی تصویریں بنا ڈالیں۔ عائشہ رضی اللہ عنہا سے روایت ہے کہ ام حبیبہ اور ام سلمہ رضی اللہ عنہما نے ایک کنیسہ (گرجے) کا ذکر کیا، جو انھوں نے حبشہ میں دیکھا تھا، جس میں تصویریں تھیں۔ انھوں نے نبی صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ نے فرمایا : ’’ان لوگوں کا حال یہ تھا کہ جب ان میں کوئی نیک آدمی ہوتا اور وہ فوت ہو جاتا تو وہ لوگ اس کی قبر پر مسجد بنا دیتے اور اس میں یہ تصویریں بنا دیتے، یہ لوگ قیامت کے دن اللہ کے ہاں ساری مخلوق سے بدتر ہوں گے۔‘‘ [بخاری، مناقب الأنصار، باب ھجرۃ الحبشۃ : ۳۸۷۳ ] اب آپ کو مسلمانوں کے ہر شہر اور تقریباً ہر محلے میں یہی نقشہ نظر آئے گا۔ جب کہ رسول اللہ صلی اللہ علیہ وسلم نے قبر کو چونا گچ کرنے، اس پر عمارت بنانے یا اس پر (مجاور بن کر) بیٹھنے سے منع فرمایا۔ [مسلم، الجنائز، باب النھی عن تجصیص القبر والبناء علیہ : ۹۷۰، عن جابر رضی اللہ عنہ ] بلکہ آپ صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ کو حکم دیا کہ ہر تصویر کو مٹا دو اور ہر اونچی قبر کو برابر کر دو۔ [مسلم، الجنائز، باب الأمر بتسویۃ القبر : ۹۶۹ ] ¤ استاذ محمد عبدہ رحمہ اللہ لکھتے ہیں کہ اس آیت : «اَيَاْمُرُكُمْ بِالْكُفْرِ» سے ثابت ہوتا ہے کہ کسی نبی یا فرشتے کی پرستش صریح کفر ہے اور کوئی ایک تعلیم یا فلسفہ جو اللہ تعالیٰ کے سوا کسی اور کی بندگی سکھائے یا اللہ کے کسی نبی یا بزرگ کو رب تعالیٰ کے مقام پر بٹھائے وہ ہر گز اللہ تعالیٰ یا اس کے نبی کی تعلیم نہیں ہو سکتی۔ {”اَيَاْمُرُكُمْ“} میں استفہام انکاری ہے، یعنی یہ ممکن ہی نہیں، کیونکہ انبیاء تو لوگوں کو عبادتِ الٰہی کی تعلیم دینے اور مسلمان بنانے کے لیے مبعوث ہوتے ہیں نہ کہ الٹا کافر بنانے کے لیے۔ (قرطبی، ابن کثیر)"
    },
    {
      "Ayah": 81,
      "tafsir": "(آیت 81) ➊ {وَ اِذْ اَخَذَ اللّٰهُ …:} ان آیات سے مقصود ایسے دلائل کی وضاحت ہے جن سے رسول اللہ صلی اللہ علیہ وسلم کی نبوت ثابت ہوتی ہے۔ (رازی) یعنی اللہ تعالیٰ نے آدم علیہ السلام اور ان کے بعد ہر نبی سے عہد لیا کہ وہ اپنے بعد آنے والے نبی کی تصدیق اور اس کی مدد کرے گا اور اس بارے میں کسی قسم کی گروہ بندی اور عصبیت اس کے راستے میں رکاوٹ نہیں بنے گی۔ اگر وہ نبی اس کی زندگی میں آ جائے تو بذات خود اس پر ایمان لائے گا اور  اگر اس کی وفات کے بعد آئے تو وہ اپنی امت کو بعد میں آنے والے نبی پر ایمان لانے اور اس کی مدد کرنے کا حکم دے کر جائے گا۔ اس اعتبار سے گویا موسیٰ علیہ السلام سے عیسیٰ علیہ السلام پر اور عیسیٰ علیہ السلام سے رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے کا عہد لیا گیا ہے۔ طبری اور ابن ابی حاتم میں حسن سند کے ساتھ ابن عباس رضی اللہ عنہما کا قول منقول ہے کہ اللہ تعالیٰ نے تمام انبیاء سے عہد لیا کہ اگر محمد صلی اللہ علیہ وسلم تمھاری زندگی میں آ جائیں تو تم ان پرایمان لاؤ گے۔ ابن کثیر رحمہ اللہ فرماتے ہیں کہ یہ تفسیر کوئی الگ نہیں بلکہ پہلی تفسیر ہی میں شامل ہے۔ بہرحال رسول اللہ صلی اللہ علیہ وسلم اللہ تعالیٰ کے آخری نبی اور واجب الاتباع ہیں، اب آپ کے سوا کسی اور نبی کی اتباع جائز نہیں۔ ¤ ➋ { ”اِصْرٌ“ } کسی چیز کے باندھنے اور زبردستی بند کرنے کو کہتے ہیں، یعنی بھاری بوجھ۔ اسی طرح مؤکد عہد کو بھی {”اِصْرٌ“} کہتے ہیں، کیونکہ وہ انسان کو باندھ دیتا ہے۔ اللہ تعالیٰ نے سب انبیاء سے یہ عہد اور اقرار لیا، انھیں اس کی شہادت کا حکم دیا اور خود بھی شہادت دی۔"
    },
    {
      "Ayah": 82,
      "tafsir": "(آیت 82) {فَمَنْ تَوَلّٰى … :} اس آیت میں اہل کتاب کو متنبہ کیا گیا ہے کہ تم رسول اللہ صلی اللہ علیہ وسلم پر ایمان نہ لا کر دراصل اس عہد کی خلاف ورزی کر رہے ہو جو تمھارے انبیاء سے اور ان کے ذریعے تم سے لیا گیا ہے، اب بتاؤتمھارے فاسق ہونے میں کوئی شک و شبہ ہو سکتا ہے ؟ (رازی)"
    },
    {
      "Ayah": 83,
      "tafsir": "(آیت 83) ➊ {طَوْعًا وَّ كَرْهًا :} اگر کوئی کہے کہ بہت سے انسان اللہ کے فرماں بردار ہیں ہی نہیں تو جواب یہ ہے کہ وہ بھی فرماں بردار ہونے میں بے بس ہیں، ورنہ اپنا سانس یا دل کی دھڑکن یا بھوک و پیاس یا پیشاب و پاخانہ روک کر دکھائیں، ہاں اعمال سے متعلق انسان کو ایک حد تک اختیار دیا گیا ہے اور اسی سے متعلق باز پرس ہو گی ۔ ¤ ➋ { اَفَغَيْرَ دِيْنِ اللّٰهِ يَبْغُوْنَ :} یعنی جب آسمان و زمین کی ہر چیز، فرشتے، جن و انس وغیرہ اللہ کے قانون فطرت کے سامنے سر جھکائے ہوئے ہیں اور اختیاری و غیر اختیاری طور پر اس کے حکم کے تابع ہیں تو یہ لوگ اس کے قانون شریعت {”دِيْنِ اللّٰهِ“} کو چھوڑ کر دوسرا راستہ کیوں اختیار کرتے ہیں، انھیں چاہیے کہ اگر آخرت میں نجات چاہتے ہیں تو اللہ کا دین جو اس وقت رسول اللہ صلی اللہ علیہ وسلم لے کر مبعوث ہوئے ہیں اسے اختیار کر لیں۔ نیز دیکھیے سورۂ آل عمران (۸۵)۔"
    },
    {
      "Ayah": 84,
      "tafsir": "(آیت 84){ قُلْ اٰمَنَّا بِاللّٰهِ … : } اس آیت کی تشریح کے لیے سورۂ بقرہ کی آیت (۱۳۶) دیکھیے۔"
    },
    {
      "Ayah": 85,
      "tafsir": "(آیت 85) {وَ مَنْ يَّبْتَغِ …:} یعنی محمد رسول اللہ صلی اللہ علیہ وسلم کے مبعوث ہو جانے کے بعد جو شخص آپ کی فرماں برداری اور اطاعت کا راستہ چھوڑ کر کوئی اور راستہ اختیار کرے گا، یا کسی پہلے راستے پر چلتا رہے گا وہ چاہے کتنا توحید پرست کیوں نہ ہو اور پچھلے انبیاء پر ایمان رکھنے والا ہو، اگر وہ محمد صلی اللہ علیہ وسلم پر ایمان نہیں رکھتا تو اس کی دین داری اللہ تعالیٰ کے ہاں مقبول نہیں ہو گی اور وہ آخرت میں نامراد و ناکام ہو گا۔ واضح رہے کہ اگرچہ تمام انبیاء کا دین اسلام تھا، مگر آخری پیغمبر صلی اللہ علیہ وسلم کی تشریف آوری کے بعد اسلام صرف آپ کی پیروی کا نام ہے۔ قرآن کی اصطلاح میں بھی اب اسلام سے یہی مراد ہوتا ہے، اس معنی میں رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے : [مَنْ عَمِلَ عَمَلاً لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ ] [مسلم، الأقضیۃ، باب نقض الأحکام الباطلۃ … : 1718/18، عن عائشۃ رضی اللہ عنہا ] ’’جس نے کوئی ایسا کام کیا جس پر ہمارا امر نہیں ہے تو وہ مردود ہے۔‘‘"
    },
    {
      "Ayah": 86,
      "tafsir": "(آیت 86تا88) ➊ یعنی جو لوگ حق کے پوری طرح واضح ہو جانے اور رسول اللہ صلی اللہ علیہ وسلم کے سچا نبی ہونے کے روشن دلائل دیکھنے کے باوجود محض کبر و حسد اور مال و جاہ کی محبت کی بنا پر کفر کی روش پر قائم رہے، یا ایک مرتبہ اسلام قبول کر لینے کے بعد پھر مرتد ہو گئے تو وہ سراسر ظالم و بدبخت ہیں، ایسے لوگوں کو راہِ ہدایت دکھانا اللہ تعالیٰ کا قانون نہیں ہے۔ اس سے معلوم ہوا کہ مرتد شخص کافر سے زیادہ مجرم ہے۔ ( ابن کثیر، شوکانی) ¤ ➋ حسن بصری رحمہ اللہ نے ایک اور آیت کے ساتھ اس کی بہترین تفسیر فرمائی کہ اس سے مراد اہل کتاب ہیں، وہ اپنی کتابوں میں محمد صلی اللہ علیہ وسلم کو موجود پاتے تھے، ان کی آمد پر ان کے ذریعے سے فتح کی دعائیں کیا کرتے تھے (گویا آپ پر ایمان رکھتے تھے) جب آپ تشریف لائے تو انھوں نے آپ کے ساتھ کفر اختیار کیا، جیسا کہ ارشاد فرمایا : « كَانُوْا مِنْ قَبْلُ يَسْتَفْتِحُوْنَ عَلَى الَّذِيْنَ كَفَرُوْا فَلَمَّا جَآءَهُمْ مَّا عَرَفُوْا كَفَرُوْا بِهٖ فَلَعْنَةُ اللّٰهِ عَلَى الْككٰفِرِيْنَ» [البقرۃ : ۸۹ ] ’’حالانکہ وہ اس سے پہلے ان لوگوں پر فتح طلب کیا کرتے تھے جنھوں نے کفر کیا، پھر جب ان کے پاس وہ چیز آ گئی جسے انھوں نے پہچان لیا تو انھوں نے اس کے ساتھ کفر کیا، پس کافروں پر اللہ کی لعنت ہے۔‘‘ (طبری بسند حسن )"
    },
    {
      "Ayah": 87,
      "tafsir": "(آیت 86تا88) ➊ یعنی جو لوگ حق کے پوری طرح واضح ہو جانے اور رسول اللہ صلی اللہ علیہ وسلم کے سچا نبی ہونے کے روشن دلائل دیکھنے کے باوجود محض کبر و حسد اور مال و جاہ کی محبت کی بنا پر کفر کی روش پر قائم رہے، یا ایک مرتبہ اسلام قبول کر لینے کے بعد پھر مرتد ہو گئے تو وہ سراسر ظالم و بدبخت ہیں، ایسے لوگوں کو راہِ ہدایت دکھانا اللہ تعالیٰ کا قانون نہیں ہے۔ اس سے معلوم ہوا کہ مرتد شخص کافر سے زیادہ مجرم ہے۔ ( ابن کثیر، شوکانی) ¤ ➋ حسن بصری رحمہ اللہ نے ایک اور آیت کے ساتھ اس کی بہترین تفسیر فرمائی کہ اس سے مراد اہل کتاب ہیں، وہ اپنی کتابوں میں محمد صلی اللہ علیہ وسلم کو موجود پاتے تھے، ان کی آمد پر ان کے ذریعے سے فتح کی دعائیں کیا کرتے تھے (گویا آپ پر ایمان رکھتے تھے) جب آپ تشریف لائے تو انھوں نے آپ کے ساتھ کفر اختیار کیا، جیسا کہ ارشاد فرمایا : « كَانُوْا مِنْ قَبْلُ يَسْتَفْتِحُوْنَ عَلَى الَّذِيْنَ كَفَرُوْا فَلَمَّا جَآءَهُمْ مَّا عَرَفُوْا كَفَرُوْا بِهٖ فَلَعْنَةُ اللّٰهِ عَلَى الْككٰفِرِيْنَ» [البقرۃ : ۸۹ ] ’’حالانکہ وہ اس سے پہلے ان لوگوں پر فتح طلب کیا کرتے تھے جنھوں نے کفر کیا، پھر جب ان کے پاس وہ چیز آ گئی جسے انھوں نے پہچان لیا تو انھوں نے اس کے ساتھ کفر کیا، پس کافروں پر اللہ کی لعنت ہے۔‘‘ (طبری بسند حسن )"
    },
    {
      "Ayah": 88,
      "tafsir": "(آیت 86تا88) ➊ یعنی جو لوگ حق کے پوری طرح واضح ہو جانے اور رسول اللہ صلی اللہ علیہ وسلم کے سچا نبی ہونے کے روشن دلائل دیکھنے کے باوجود محض کبر و حسد اور مال و جاہ کی محبت کی بنا پر کفر کی روش پر قائم رہے، یا ایک مرتبہ اسلام قبول کر لینے کے بعد پھر مرتد ہو گئے تو وہ سراسر ظالم و بدبخت ہیں، ایسے لوگوں کو راہِ ہدایت دکھانا اللہ تعالیٰ کا قانون نہیں ہے۔ اس سے معلوم ہوا کہ مرتد شخص کافر سے زیادہ مجرم ہے۔ ( ابن کثیر، شوکانی) ¤ ➋ حسن بصری رحمہ اللہ نے ایک اور آیت کے ساتھ اس کی بہترین تفسیر فرمائی کہ اس سے مراد اہل کتاب ہیں، وہ اپنی کتابوں میں محمد صلی اللہ علیہ وسلم کو موجود پاتے تھے، ان کی آمد پر ان کے ذریعے سے فتح کی دعائیں کیا کرتے تھے (گویا آپ پر ایمان رکھتے تھے) جب آپ تشریف لائے تو انھوں نے آپ کے ساتھ کفر اختیار کیا، جیسا کہ ارشاد فرمایا : « كَانُوْا مِنْ قَبْلُ يَسْتَفْتِحُوْنَ عَلَى الَّذِيْنَ كَفَرُوْا فَلَمَّا جَآءَهُمْ مَّا عَرَفُوْا كَفَرُوْا بِهٖ فَلَعْنَةُ اللّٰهِ عَلَى الْككٰفِرِيْنَ» [البقرۃ : ۸۹ ] ’’حالانکہ وہ اس سے پہلے ان لوگوں پر فتح طلب کیا کرتے تھے جنھوں نے کفر کیا، پھر جب ان کے پاس وہ چیز آ گئی جسے انھوں نے پہچان لیا تو انھوں نے اس کے ساتھ کفر کیا، پس کافروں پر اللہ کی لعنت ہے۔‘‘ (طبری بسند حسن )"
    },
    {
      "Ayah": 89,
      "tafsir": "(آیت89) ➊ {اِلَّا الَّذِيْنَ تَابُوْا …:} اس سے معلوم ہوا کہ اگر مشرک صدقِ دل سے توبہ کر لے اور دوبارہ اسلام لے آئے تو اللہ تعالیٰ اس کی پچھلی غلطی کو معاف کر دیتے ہیں۔ ابن عباس رضی اللہ عنہما نے فرمایا : ’’انصار میں سے ایک آدمی اسلام لانے کے بعد مرتد ہو گیا اور مشرکوں سے جا ملا، پھر وہ پشیمان ہوا اور اس نے اپنے قبیلے کے لوگوں سے کہلا بھیجا کہ تم رسول اللہ صلی اللہ علیہ وسلم سے دریافت کرو کہ آیا میری توبہ قبول ہو سکتی ہے؟ تو اس پر یہ آیت نازل ہوئی۔ (اس کے بھائی نے) اسے یہ آیت بھیج دی اور وہ دوبارہ مسلمان ہو گیا۔ [نسائی، تحریم الدم، باب توبۃ المرتد … :۴۰۷۳ وقال الالبانی صحیح ] اس شخص کا نام حارث بن سوید تھا۔ (طبری) ¤ ➋ کسی شخص کو زبردستی مسلمان نہیں بنایا جائے گا، فرمایا : «لَاۤ اِكْرَاهَ فِي الدِّيْنِ » [البقرة : ۲۵۶]’’دین میں کوئی زبردستی نہیں۔‘‘ مگر کوئی مسلمان ہونے کے بعد مرتد ہو، پھر ارتداد سے توبہ نہ کرے تو اس کی سزا قتل ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ بَدَّلَ دِيْنَهُ فَاقْتُلُوْهُ ] ’’جو اپنا دین (یعنی اسلام) بدل لے اسے قتل کر دو۔‘‘ [بخاری، استتابۃ المرتدین و المعاندین وقتالہم، باب إثم من أشرک … : ۶۹۱۸ ]"
    },
    {
      "Ayah": 90,
      "tafsir": "(آیت 90)یعنی یہود پہلے اقرار کرتے تھے کہ یہ یقینًا نبی ہے لیکن جب ان سے معاملہ ہوا تو وہ منکر ہو گئے۔(موضح) اور ایسے لوگ بھی اس کا مصداق ہیں جو اسلام سے مرتد ہونے کے بعد موت کے وقت تک کفر پر قائم رہتے ہیں، ان کے بارے میں اللہ تعالیٰ فرما رہے ہیں کہ حالت نزع میں اگر یہ لوگ توبہ کریں گے بھی تو ان کی توبہ قبول نہیں کی جائے گی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ يَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ ] [ترمذی، الدعوات، باب إن اللہ یقبل التوبۃ … : ۳۵۳۷۔ حسنہ الألبانی ]’’یقینًا اللہ تبارک و تعالیٰ بندے کی توبہ اس وقت تک قبول کرتا ا ہے جب تک روح حلق تک نہ پہنچے۔‘‘ نیز دیکھیے سورۂ نساء (۱۸) اور {”الضَّآلُّوْنَ“} سے مراد ’’کامل درجہ کے گمراہ ہیں۔‘‘ (رازی)"
    },
    {
      "Ayah": 91,
      "tafsir": "(آیت 91) اس سے مراد وہ لوگ ہیں جو کفر کی روش اختیار کرتے ہیں اور کفر ہی کی حالت میں فوت ہو جاتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ قیامت کے دن سب سے ہلکے عذاب والے جہنمی سے پوچھے گا : ’’اگر دنیا میں جو بھی چیز ہے تمھاری ہو جائے تو کیا تم اسے (اپنی جان بچانے کے لیے) فدیہ میں دے دو گے ؟‘‘ وہ کہے گا : ’’ہاں! ‘‘ اللہ تعالیٰ فرمائے گا : ’’میں نے تم سے اس وقت جب تم آدم کی پشت میں تھے اس سے بہت زیادہ آسان بات کا تقاضا کیا تھا کہ شرک نہ کرنا تو میں تمھیں دوزخ میں داخل نہیں کروں گا، لیکن تم نہ مانے اور شرک کرتے رہے۔‘‘ [مسلم، صفات المنافقین، باب طلب الکافر الفداء … : ۲۸۰۵، عن أنس رضی اللہ عنہ ]"
    },
    {
      "Ayah": 92,
      "tafsir": "(آیت 92) ➊ {لَنْ تَنَالُوا الْبِرَّ … :} { ”الْبِرَّ“ } ’’کامل نیکی ‘‘، {”مِمَّا تُحِبُّوْنَ“} (اس میں سے کچھ خرچ کرو جس سے تم محبت رکھتے ہو) عام ہے، یعنی جان و مال، اولاد و اقارب، جاہ و عزت، غرض ہر چیز کو شامل ہے۔ یہ خطاب مسلمانوں کو بھی ہے اور یہود کو بھی۔ مسلمانوں سے خطاب کی مناسبت یہ معلوم ہوتی ہے کہ پچھلی آیت میں بیان فرمایا ہے کہ کافر کو خرچ کرنے سے کچھ بھی نفع نہیں ہو گا، اب اس آیت میں مومنوں کو خرچ کرنے کی کیفیت بتلائی، جس سے آخرت میں انھیں نفع ہو گا۔ ¤ ➋ {وَ مَا تُنْفِقُوْا مِنْ شَيْءٍ … :} مقصد یہ کہ انسان جو کچھ بھی فی سبیل اللہ خرچ کرتا ہے، تھوڑا ہو یا زیادہ، وہ اللہ تعالیٰ کے علم میں ہے اور انسان کو (بشرطیکہ مسلمان ہو اور اخلاص سے خرچ کرے) اس کا بدلہ ضرور ملے گا۔ اس لیے معمولی چیز خرچ کرنے کو بھی عار نہ سمجھے۔مگر نیکی میں کامل درجہ حاصل کرنے کے لیے ضروری ہے کہ عزیز ترین چیز صرف کی جائے۔ یہ آیت سن کر اس پر صحابہ کرام رضی اللہ عنہم کے عمل کی ایک دو مثالیں ملاحظہ فرمائیں۔ انس رضی اللہ عنہ بیان کرتے ہیں کہ جب یہ آیت نازل ہوئی تو ابو طلحہ انصاری رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کی : ’’یا رسول اللہ ! میری جائداد میں سے مجھے سب سے محبوب {’’بَيْرُحَاء‘‘ } باغ ہے (جو عین مسجد نبوی کے سامنے تھا، نبی صلی اللہ علیہ وسلم اس میں تشریف لے جایا کرتے اور اس کا نفیس پانی پیا کرتے تھے) اور اے اللہ کے رسول ! اللہ تعالیٰ نے فرمایا ہے : «لَنْ تَنَالُوا الْبِرَّ حَتّٰى تُنْفِقُوْا مِمَّا تُحِبُّوْنَ » سو میں اسے اللہ کی راہ میں صدقہ کرتا ہوں اور اس کے اجر و ثواب کی امید رکھتا ہوں، آپ اس کے بارے میں جو چاہیں فیصلہ فرما دیں۔‘‘ ¤ [ بخاری، الزکوٰۃ، باب الزکوٰۃ علی الأقارب … : ۱۴۶۱، مختصرًا ]عمر بن خطاب رضی اللہ عنہ نے عرض کیا : ’’اے اللہ کے رسول! مجھے خیبر میں سے جو حصہ ملا ہے اس سے بڑھ کر نفیس مال مجھے آج تک حاصل نہیں ہوا، میں نے ارادہ کیا ہے کہ اسے صدقہ کر دوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اصل اپنے پاس رکھو اور اس کے پھل کو اللہ کے راستے میں تقسیم کر دو۔‘‘ چنانچہ عمر رضی اللہ عنہ نے اسے وقف کر دیا۔ [ بخاری، الشروط، باب الشروط فی الوقف : ۲۷۳۷۔ ابن ماجہ :۲۳۹۶، ۲۳۹۷ ] ¤ ➌ یہود سے خطاب کی صورت میں شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’شاید یہود کے ذکر میں یہ آیت اس واسطے ذکر فرمائی کہ ان کو اپنی ریاست بہت عزیز تھی، جس کے تھامنے کو نبی صلی اللہ علیہ وسلم کے تابع نہ ہوتے تھے، تو جب وہی نہ چھوڑیں تو اللہ کی راہ میں درجۂ ایمان نہ پائیں۔‘‘ (موضح) ¤ ➍ {مِمَّا تُحِبُّوْنَ:} اللہ کا کرم دیکھیے، بندوں سے ان کی محبوب چیزیں ساری نہیں مانگیں، بلکہ اس میں سے کچھ خرچ کرنے ہی کو کامل نیکی قرار دے دیا ہے۔"
    },
    {
      "Ayah": 93,
      "tafsir": "(آیت 94،93){كُلُّ الطَّعَامِ …:} اوپر کی آیات میں رسول اللہ صلی اللہ علیہ وسلم کی نبوت کے اثبات میں دلائل پیش کیے اور اہل کتاب پر الزامات قائم کیے ہیں۔ اب یہاں سے ان کے شبہات کا جواب ہے، جو وہ آپ صلی اللہ علیہ وسلم کی نبوت پر پیش کرتے تھے۔ (رازی) جب قرآن نے بیان کیا کہ یہود کے ظلم اور سرکشی کی وجہ سے بہت سی وہ چیزیں ان پر حرام کر دی گئیں [ النساء : ۱۶۰۔ الانعام : ۱۴۶] جو ابراہیم علیہ السلام کے عہدِ نبوت میں حلال تھیں، تو یہود نے ان آیات کو جھٹلایا اور کہنے لگے کہ یہ چیزیں تو ابراہیم علیہ السلام کے وقت سے حرام چلی آئی ہیں، اس پر یہ آیات نازل ہوئیں۔(شوکانی) بعض مفسرین نے ان آیات (94،93) کی شانِ نزول میں لکھا ہے کہ یہود تورات میں نسخ کے قائل نہیں تھے اور عیسیٰ علیہ السلام کو بھی یہود نے اسی لیے جھٹلا دیا تھا کہ وہ تورات میں بعض حرام کردہ چیزوں کو حلال قرار دیتے تھے اور اسی لیے انھوں نے قرآن کے ناسخ و منسوخ پر بھی اعتراض کیا تو ان کے جواب میں یہ آیات نازل ہوئیں کہ یہ نسخ تو خود تمھاری شریعت میں بھی موجود ہے کہ جب تک تورات نازل نہیں ہوئی تھی تو کھانے کی تمام چیزیں تمھارے لیے حلال تھیں، جن میں اونٹ کا گوشت اور دودھ بھی شامل ہے، پھر جب یعقوب علیہ السلام عرق النساء کے مرض میں مبتلا ہوئے تو انھوں نے صحت یاب ہونے پر بطور نذر اونٹ کا گوشت حرام قرار دے لیا۔ پھر جب تورات نازل ہوئی تو اس میں اونٹ کا گوشت اور دودھ حرام قرار دے دیا گیا۔ (ابن کثیر، الکشاف) حلال کو حرام قرار دے لینے کی یہ نذر ان کی شریعت میں جائز تھی۔ خود رسول اللہ صلی اللہ علیہ وسلم نے بھی ایک واقعہ میں شہد پینے کو اپنے اوپر حرام قرار دے لیا تھا، گو یہ نذر نہ تھی مگر قرآن نے اس قسم کی نذر سے اور حلال کو حرام کرنے سے منع فرما دیا اور کفارہ مقرر فرما دیا۔ تفصیل کے لیے دیکھیے سورۂ تحریم۔ ¤ بعض نے لکھا ہے کہ یہود رسول اللہ صلی اللہ علیہ وسلم کی نبوت کے سلسلہ میں یہ اعتراض بھی کرتے تھے کہ یہ پیغمبر خود کو ملتِ ابراہیمی کے اتباع کا دعوے دار بتاتا ہے اور اونٹ کا گوشت کھاتا ہے، حالانکہ یہ گوشت ملتِ ابراہیمی میں حرام ہے، اس پر یہ آیات نازل ہوئیں کہ تورات کے اترنے سے پہلے تو یہ سب چیزیں حلال تھیں، پھر ملتِ ابراہیمی میں یہ کیسے حرام ہو سکتی ہیں، اگر تم اپنے دعوے میں سچے ہو تو تورات میں دکھا ؤ ، ورنہ اللہ تعالیٰ پر اس قسم کے بہتان گھڑنے سے باز رہو۔ (ابن کثیر) ¤ مسند احمد میں ابن عباس رضی اللہ عنہما سے یہود کے رسول اللہ صلی اللہ علیہ وسلم سے چار سوال اور ان کے جواب مذکور ہیں۔ ان میں سے ایک یہ تھا کہ کھانے کی وہ کون سی چیزیں تھیں جنھیں یعقوب علیہ السلام نے تورات نازل ہونے سے پہلے اپنے لیے حرام قرار دے لیا تھا؟ آپ صلی اللہ علیہ وسلم نے اس کا جواب یہ دیا کہ اسرائیل یعنی یعقوب علیہ السلام جب سخت بیمار ہو گئے تھے، ان کی بیماری بہت طول اختیار کر گئی تو انھوں نے یہ نذر مانی تھی کہ اگر اللہ تعالیٰ انھیں شفا عطا فرما دے تو وہ اپنے پسندیدہ کھانے اور پسندیدہ مشروب کو ترک کر دیں گے اور ان کا پسندیدہ کھانا اونٹ کا گوشت اور پسندیدہ مشروب اونٹ کا دودھ تھا۔ یہ بات سن کر یہود نے آپ کی تصدیق کی، آپ نے فرمایا : ’’اے اللہ! تو ان پر گواہ ہو جا۔‘‘ [ أحمد : 278/1، ح : ۲۵۱۸، و حسنہ و صححہ أحمد شاکر و الحاکم و وافقہ الذھبی۔ المعجم الکبیر للطبرانی : 191،190/12، ح : ۱۳۰۱۲ ] اس واقعہ کی «لَنْ تَنَالُوا الْبِرَّ حَتّٰى تُنْفِقُوْا مِمَّا تُحِبُّوْنَ»سے مناسبت بھی ظاہر ہے۔"
    },
    {
      "Ayah": 94,
      "tafsir": "(آیت 94،93){كُلُّ الطَّعَامِ …:} اوپر کی آیات میں رسول اللہ صلی اللہ علیہ وسلم کی نبوت کے اثبات میں دلائل پیش کیے اور اہل کتاب پر الزامات قائم کیے ہیں۔ اب یہاں سے ان کے شبہات کا جواب ہے، جو وہ آپ صلی اللہ علیہ وسلم کی نبوت پر پیش کرتے تھے۔ (رازی) جب قرآن نے بیان کیا کہ یہود کے ظلم اور سرکشی کی وجہ سے بہت سی وہ چیزیں ان پر حرام کر دی گئیں [ النساء : ۱۶۰۔ الانعام : ۱۴۶] جو ابراہیم علیہ السلام کے عہدِ نبوت میں حلال تھیں، تو یہود نے ان آیات کو جھٹلایا اور کہنے لگے کہ یہ چیزیں تو ابراہیم علیہ السلام کے وقت سے حرام چلی آئی ہیں، اس پر یہ آیات نازل ہوئیں۔(شوکانی) بعض مفسرین نے ان آیات (94،93) کی شانِ نزول میں لکھا ہے کہ یہود تورات میں نسخ کے قائل نہیں تھے اور عیسیٰ علیہ السلام کو بھی یہود نے اسی لیے جھٹلا دیا تھا کہ وہ تورات میں بعض حرام کردہ چیزوں کو حلال قرار دیتے تھے اور اسی لیے انھوں نے قرآن کے ناسخ و منسوخ پر بھی اعتراض کیا تو ان کے جواب میں یہ آیات نازل ہوئیں کہ یہ نسخ تو خود تمھاری شریعت میں بھی موجود ہے کہ جب تک تورات نازل نہیں ہوئی تھی تو کھانے کی تمام چیزیں تمھارے لیے حلال تھیں، جن میں اونٹ کا گوشت اور دودھ بھی شامل ہے، پھر جب یعقوب علیہ السلام عرق النساء کے مرض میں مبتلا ہوئے تو انھوں نے صحت یاب ہونے پر بطور نذر اونٹ کا گوشت حرام قرار دے لیا۔ پھر جب تورات نازل ہوئی تو اس میں اونٹ کا گوشت اور دودھ حرام قرار دے دیا گیا۔ (ابن کثیر، الکشاف) حلال کو حرام قرار دے لینے کی یہ نذر ان کی شریعت میں جائز تھی۔ خود رسول اللہ صلی اللہ علیہ وسلم نے بھی ایک واقعہ میں شہد پینے کو اپنے اوپر حرام قرار دے لیا تھا، گو یہ نذر نہ تھی مگر قرآن نے اس قسم کی نذر سے اور حلال کو حرام کرنے سے منع فرما دیا اور کفارہ مقرر فرما دیا۔ تفصیل کے لیے دیکھیے سورۂ تحریم۔ ¤ بعض نے لکھا ہے کہ یہود رسول اللہ صلی اللہ علیہ وسلم کی نبوت کے سلسلہ میں یہ اعتراض بھی کرتے تھے کہ یہ پیغمبر خود کو ملتِ ابراہیمی کے اتباع کا دعوے دار بتاتا ہے اور اونٹ کا گوشت کھاتا ہے، حالانکہ یہ گوشت ملتِ ابراہیمی میں حرام ہے، اس پر یہ آیات نازل ہوئیں کہ تورات کے اترنے سے پہلے تو یہ سب چیزیں حلال تھیں، پھر ملتِ ابراہیمی میں یہ کیسے حرام ہو سکتی ہیں، اگر تم اپنے دعوے میں سچے ہو تو تورات میں دکھا ؤ ، ورنہ اللہ تعالیٰ پر اس قسم کے بہتان گھڑنے سے باز رہو۔ (ابن کثیر) ¤ مسند احمد میں ابن عباس رضی اللہ عنہما سے یہود کے رسول اللہ صلی اللہ علیہ وسلم سے چار سوال اور ان کے جواب مذکور ہیں۔ ان میں سے ایک یہ تھا کہ کھانے کی وہ کون سی چیزیں تھیں جنھیں یعقوب علیہ السلام نے تورات نازل ہونے سے پہلے اپنے لیے حرام قرار دے لیا تھا؟ آپ صلی اللہ علیہ وسلم نے اس کا جواب یہ دیا کہ اسرائیل یعنی یعقوب علیہ السلام جب سخت بیمار ہو گئے تھے، ان کی بیماری بہت طول اختیار کر گئی تو انھوں نے یہ نذر مانی تھی کہ اگر اللہ تعالیٰ انھیں شفا عطا فرما دے تو وہ اپنے پسندیدہ کھانے اور پسندیدہ مشروب کو ترک کر دیں گے اور ان کا پسندیدہ کھانا اونٹ کا گوشت اور پسندیدہ مشروب اونٹ کا دودھ تھا۔ یہ بات سن کر یہود نے آپ کی تصدیق کی، آپ نے فرمایا : ’’اے اللہ! تو ان پر گواہ ہو جا۔‘‘ [ أحمد : 278/1، ح : ۲۵۱۸، و حسنہ و صححہ أحمد شاکر و الحاکم و وافقہ الذھبی۔ المعجم الکبیر للطبرانی : 191،190/12، ح : ۱۳۰۱۲ ] اس واقعہ کی «لَنْ تَنَالُوا الْبِرَّ حَتّٰى تُنْفِقُوْا مِمَّا تُحِبُّوْنَ»سے مناسبت بھی ظاہر ہے۔"
    },
    {
      "Ayah": 95,
      "tafsir": "(آیت 95) {قُلْ صَدَقَ اللّٰهُ …:} یعنی اللہ تعالیٰ کا بیان صدق پر مبنی ہے کہ کھانے کی یہ قسم پہلے حلال تھی، اس کے بعد اسرائیل اور ان کی اولاد پر حرام کر دی گئی، لہٰذا ’’نسخ‘‘ صحیح ہے اور تمھارا شبہ باطل ہے، رسول اللہ صلی اللہ علیہ وسلم نے جو ان کے حلال ہونے کا فتویٰ دیا ہے، یہ عین ملتِ ابراہیم علیہ السلام کے مطابق ہے۔ لہٰذا تم بھی دینِ اسلام میں داخل ہو جا ؤ ، جو اصول و فروع کے اعتبار سے عین دین ابراہیم کے مطابق ہے۔ (ابن کثیر)"
    },
    {
      "Ayah": 96,
      "tafsir": "(آیت 96) {اِنَّ اَوَّلَ بَيْتٍ … :} یہ یہود کے دوسرے شبہ کا جواب ہے کہ ابراہیم علیہ السلام نے شام کی طرف ہجرت کی اور ان کی اولاد میں سے تمام انبیاء شام میں ہوئے، ان کا قبلہ بیت المقدس تھا اور مسلمانوں نے اس قدیم قبلہ کو چھوڑ کر کعبہ کو قبلہ بنا لیا ہے، پھر یہ ملتِ ابراہیم کے متبع کیسے ہو سکتے ہیں؟ قرآن نے بتایا کہ دنیا میں سب سے پہلا عبادت خانہ تو کعبہ ہے، جو ’’بکہ‘‘ میں ہے۔ بکہ مکہ ہی کا نام ہے، جسے اللہ تعالیٰ نے شرفِ قبولیت بخشا۔ اس پر بہت سے واضح دلائل موجود ہیں۔ جن میں سے ایک دلیل یہ ہے کہ دورِ جاہلیت سے یہ محترم چلا آ رہا ہے کہ اگر کسی کے باپ کا قاتل بھی اس میں داخل ہو جائے تو وہ اس سے تعرض نہیں کرتا، نیز اس میں مقامِ ابراہیم، یعنی وہ پتھر ہے جو اس بات کی دلیل ہے کہ اس کے بانی ابراہیم علیہ السلام ہیں اور یہ کہ یہی ابراہیمی قبلہ ہے، کیونکہ بیت المقدس کی تعمیر کعبۃ اللہ سے چالیس برس بعد ہوئی۔ ¤ ابو ذر رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا : ’’اے اللہ کے رسول ! روئے زمین پر سب سے پہلے کون سی مسجد بنائی گئی؟‘‘ آپ نے فرمایا : ’’مسجد حرام۔‘‘ پوچھا : ’’پھر کون سی ؟‘‘ آپ نے فرمایا : ’’مسجد اقصیٰ۔‘‘ پوچھا : ’’ان دونوں کے درمیان کتنی مدت ہے؟‘‘ آپ نے فرمایا : ’’چالیس سال۔‘‘ [ بخاری، أحادیث الأنبیاء، بابٌ : ۳۳۶۶ ]"
    },
    {
      "Ayah": 97,
      "tafsir": "(آیت 97 ) ➊ {وَ لِلّٰهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ:} رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اسلام کی بنیاد پانچ چیزوں پر ہے، اس بات کی شہادت کہ اللہ کے سوا کوئی عبادت کے لائق نہیں اور اس کی (شہادت) کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور اس کے رسول ہیں اور نماز قائم کرنا اور زکوٰۃ دینا اور حج کرنا اور رمضان کے روزے رکھنا۔‘‘ [ بخاری، الإیمان، باب دعاؤکم إیمانکم : ۸، عن ابن عمر رضی اللہ عنہما] ہر عاقل و بالغ مسلمان پر جو کعبہ تک پہنچنے کی استطاعت رکھتا ہے، اس پر عمر بھر میں ایک مرتبہ حج فرض ہے۔ [ مسلم، الحج، باب فرض الحج مرۃ فی العمر : ۱۳۳۷ ] ¤ ➋ {مَنِ اسْتَطَاعَ اِلَيْهِ سَبِيْلًا :} استطاعت کی تفسیر حدیث میں زادِ راہ اور سواری سے کی گئی ہے۔ [ ترمذی، الحج، باب ما جاء من التغلیظ… : ۸۱۲، عن علی رضی اللہ عنہ عن رسول اللہ صلی اللہ علیہ وسلم ] شیخ البانی رحمہ اللہ نے صحیح الترغیب میں اسے حسن قرار دیا ہے اور ابن تیمیہ رحمہ اللہ بھی یہی کہتے ہیں۔ [ ہدایۃ المستنیر ] ¤ استطاعت کے مفہوم میں راستے کا پر امن ہونا، جان و مال کے تلف ہونے کا اندیشہ نہ ہونا بھی شامل ہے اور عورت کے لیے محرم کا ساتھ ہونا بھی ضروری ہے۔ حدیث سے معلوم ہوتا ہے کہ اگر مالی استطاعت ہو مگر جسمانی نہ ہو تو کوئی دوسرا اس کی جگہ حج کرلے۔ ابن عباس رضی اللہ عنہما سے روایت ہے کہ خثعم قبیلے کی ایک عورت آئی، اس نے پوچھا : ’’یا رسول اللہ ! اللہ کا اپنے بندوں پر جو فریضۂ حج ہے، وہ میرے والد پر اس حال میں آیا ہے کہ وہ بہت بوڑھا ہے، سواری پر جم کر بیٹھ نہیں سکتا، تو کیا میں اس کی طرف سے حج کروں؟‘‘ فرمایا : ’’ہاں !‘‘ اور یہ حجۃ الوداع کی بات ہے۔ [ بخاری، جزاء الصید، باب حج المرأۃ عن الرجل : ۱۸۵۵ ] ¤ اسی طرح اگر کسی صاحب پر حج فرض تھا، جو سستی سے رہ گیا اور وہ فوت ہو گیا تو اس کی میراث میں سے حج ادا کیا جائے گا، ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فَاقْضِ اللّٰهَ فَهُوَ أَحَقُّ بِالْقَضَاءِ ] ’’اللہ کا قرض ادا کرو، کیونکہ وہ پورا کیے جانے کا زیادہ حق دار ہے۔‘‘ [ بخاری، الأیمان والنذور، باب من مات و علیہ نذر : ۶۶۹۹۔ مسلم : ۱۱۴۸ ] ایک صحیح حدیث سے معلوم ہوتا ہے کہ دوسرے کی طرف سے وہ شخص حج کرے جو پہلے اپنا حج کر چکا ہو۔ [ أبو داوٗد، المناسک، باب الرجل یحج عن غیرہ : ۱۸۱۱، عن ابن عباس رضی اللہ عنہما ] ¤ ➌ {وَ مَنْ كَفَرَ:} اس سے معلوم ہوا کہ استطاعت کے باوجود حج نہ کرنا کفر ہے اور جو کفر کرے تو اس بے چارے کی کیا اوقات ہے، اللہ تعالیٰ تو سارے جہانوں سے بے پروا ہے۔ اسلام کی پانچ بنیادوں کے ترک اور دوسری چیزوں کے ترک کا یہی فرق ہے کہ ان پانچوں میں سے کسی کے ترک سے اسلام کی بنیاد ڈھے جاتی ہے۔ حافظ ابن کثیر رحمہ اللہ نے ابو بکر اسماعیلی الحافظ رحمہ اللہ کی سند سے امیر المومنین عمر بن خطاب رضی اللہ عنہ سے نقل کیا ہے کہ انھوں نے فرمایا : ’’جو شخص حج کی طاقت رکھے اور پھر حج نہ کرے تو اس پر برابر ہے کہ یہودی ہونے کی حالت میں مرے یا نصرانی ہونے کی حالت میں۔‘‘ امام ابن کثیر نے فرمایا : ’’یہ سند عمر رضی اللہ عنہ تک صحیح ہے۔‘‘"
    },
    {
      "Ayah": 98,
      "tafsir": "(آیت 99،98) {قُلْ يٰۤاَهْلَ الْكِتٰبِ … :} اہل کتاب کے شبہات کی تردید کرنے کے بعد اب انھیں ڈانٹ پلائی جا رہی ہے کہ تم نہ صرف یہ کہ حق پر خود ایمان نہیں لاتے، بلکہ جو لوگ اس پر ایمان لا چکے ہیں ان میں طرح طرح کے فتنے اور شوشے چھوڑ کر حق کی راہ میں کجی پیدا کرنے کی کوشش کرتے ہو۔ {”تَبْغُوْنَهَا عِوَجًا“} کا مطلب ہے : { ”تَبْغُوْنَ فِيْهَا عِوَجًا“ } (تم اس دین میں کوئی نہ کوئی کجی تلاش کرتے ہو) اور پھر یہ سب کچھ جان بوجھ کر کر رہے ہو۔ اللہ تعالیٰ کو تمھارے یہ کرتوت خوب معلوم ہیں، تمھیں اپنے اس جرم کی سزا بھگتنا پڑے گی۔ { ”سَبِيْلِ اللّٰهِ“ } سے مراد یہاں اسلام ہے۔"
    },
    {
      "Ayah": 99,
      "tafsir": "(آیت 99،98) {قُلْ يٰۤاَهْلَ الْكِتٰبِ … :} اہل کتاب کے شبہات کی تردید کرنے کے بعد اب انھیں ڈانٹ پلائی جا رہی ہے کہ تم نہ صرف یہ کہ حق پر خود ایمان نہیں لاتے، بلکہ جو لوگ اس پر ایمان لا چکے ہیں ان میں طرح طرح کے فتنے اور شوشے چھوڑ کر حق کی راہ میں کجی پیدا کرنے کی کوشش کرتے ہو۔ {”تَبْغُوْنَهَا عِوَجًا“} کا مطلب ہے : { ”تَبْغُوْنَ فِيْهَا عِوَجًا“ } (تم اس دین میں کوئی نہ کوئی کجی تلاش کرتے ہو) اور پھر یہ سب کچھ جان بوجھ کر کر رہے ہو۔ اللہ تعالیٰ کو تمھارے یہ کرتوت خوب معلوم ہیں، تمھیں اپنے اس جرم کی سزا بھگتنا پڑے گی۔ { ”سَبِيْلِ اللّٰهِ“ } سے مراد یہاں اسلام ہے۔"
    },
    {
      "Ayah": 100,
      "tafsir": "(آیت 100) ➊ {اِنْ تُطِيْعُوْا فَرِيْقًا …:} اوپر کی دو آیتوں میں اہل کتاب کو وعید سنائی گئی جو لوگوں کو گمراہ کر رہے تھے، اب یہاں سے مسلمانوں کو نصیحت فرمائی جا رہی ہے کہ ان سے ہوشیار رہیں اور ان کی بات کسی صورت نہ مانیں، ورنہ وہ گمراہ ہو جائیں گے۔ ¤ ➋ {يَرُدُّوْكُمْ بَعْدَ اِيْمَانِكُمْ … :} ایمان کے بعد پھر کافر بنا دینے میں یہ بھی شامل ہے کہ ان کا کام آپس میں لڑانا ہے۔ اگر ان کی بات مانو گے تو آپس کے اتفاق اور محبت سے محروم ہو جا ؤ گے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ میرے بعد پھر کافر نہ بن جانا کہ ایک دوسرے کی گردنیں مارنے لگو۔‘‘ [ بخاری، المغازی، باب حجۃ الوداع : ۴۴۰۳، عن ابن عمر رضی اللہ عنہما ] یاد رہے کہ اس کفر سے مراد اسلام میں رہ کر کفر ہے، مرتد ہونا نہیں۔ کیونکہ اللہ تعالیٰ نے مسلمانوں کے دو لڑنے والے گروہوں میں سے دونوں کو مومن قرار دے کر ان کے درمیان صلح کروانے کا حکم دیا ہے۔ تفصیل کے لیے دیکھیے سورۂ حجرات (۹، ۱۰)۔"
    },
    {
      "Ayah": 101,
      "tafsir": "(آیت 101) ➊ {وَ كَيْفَ تَكْفُرُوْنَ … :} ابن عباس رضی اللہ عنہما فرماتے ہیں : ’’جاہلیت میں اوس اور خزرج کے درمیان لڑائی رہی تھی، اب ایک دفعہ وہ بیٹھے ہوئے تھے کہ انھوں نے آپس میں جو کچھ ہوا تھا اس کا ذکر کیا تو دونوں غصے میں آ گئے اور ایک دوسرے کے مقابلے کے لیے اسلحہ لینے کے لیے اٹھے، تو اس پر یہ آیت اتری : «وَ كَيْفَ تَكْفُرُوْنَ وَ اَنْتُمْ تُتْلٰى عَلَيْكُمْ اٰيٰتُ اللّٰهِ وَ فِيْكُمْ رَسُوْلُهٗ» [ ابن أبی حاتم : 110/3، ح : ۳۹۴۸۔ طبری ] ¤ ➋ {وَ اَنْتُمْ تُتْلٰى عَلَيْكُمْ اٰيٰتُ اللّٰهِ وَ فِيْكُمْ رَسُوْلُهٗ:} یعنی تمھاری طرف سے کفر کا ارتکاب بہت بعید ہے، کیونکہ اللہ کی آیات تم پر پڑھی جا رہی ہیں، اس کا رسول بنفس نفیس تم میں موجود ہے اور جو شخص اللہ کو مضبوطی سے پکڑ لے تو یقینا اسے سیدھے راستے کی طرف ہدایت کی گئی۔ اس کے مخاطب صحابہ کرام رضی اللہ عنہم ہیں، لیکن نصیحت کا تعلق تمام مسلمانوں سے ہے۔ آج گو ہمارے درمیان رسول اللہ صلی اللہ علیہ وسلم بنفس نفیس موجود نہیں ہیں، مگر اللہ کی کتاب، یعنی قرآن کریم اور آپ صلی اللہ علیہ وسلم کی سنت موجود ہے، جن پر عمل پیرا ہو کر موجودہ دور کے فتنوں اور ہر قسم کی بدعت و ضلالت سے مسلمان محفوظ رہ سکتے ہیں۔ اب بغیر دیکھے رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانا اور کتاب و سنت پر عمل کرنا بہت بڑے اجر کا باعث ہے۔ ابن محیریز کہتے ہیں کہ میں نے ابوجمعہ رضی اللہ عنہ سے کہا : ’’ہمیں کوئی حدیث سنا ؤ جو تم نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہو انھوں نے کہا : ’’ہاں، میں تمھیں ایک جید حدیث سنا ؤ ں گا، ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ناشتہ کیا اور ہمارے ساتھ ابو عبیدہ بن جراح رضی اللہ عنہ بھی تھے، انھوں نے کہا : ’’یا رسول اللہ ! کیا ہم سے بھی کوئی بہتر ہے ؟ ہم آپ کے ساتھ اسلام لائے اور آپ کے ساتھ جہاد کیا ؟‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہاں، وہ لوگ جو تمھارے بعد ہوں گے، وہ مجھ پر ایمان لائیں گے حالانکہ انھوں نے مجھے دیکھا نہیں۔‘‘ [ أحمد : 106/4، ح : ۱۶۹۷۸، ۱۶۹۷۹، و سندہ صحیح ] ¤ امام احمد کے علاوہ ابو نعیم، حاکم اور ابو یعلی الموصلی نے بھی اسے روایت کیا ہے۔ سورۂ بقرہ کی شروع کی آیات «يُؤْمِنُوْنَ بِالْغَيْبِ » کی تفسیر میں اس مفہوم کی کئی احادیث حافظ ابن کثیر رحمہ اللہ لائے ہیں، جن سے ثابت ہوتا ہے کہ اب رسول اللہ صلی اللہ علیہ وسلم ہم میں موجود نہیں، بلکہ اب ہم ایمان بالغیب لا کر قرآن و سنت پر عمل کریں گے۔ مزید تفصیل کے لیے دیکھیے سورۂ حجرات (۷)۔"
    },
    {
      "Ayah": 102,
      "tafsir": "(آیت 102) ➊ {اتَّقُوا اللّٰہَ حَقَّ تُقَاتِهٖ … :} عبد اللہ بن مسعود رضی اللہ عنہ سے اس آیت کی تفسیر یوں مروی ہے : ’’اس کی اطاعت کی جائے نافرمانی نہ کی جائے، اسے یاد رکھا جائے بھلایا نہ جائے، اس کا شکر ادا کیا جائے ناشکری نہ کی جائے۔‘‘ [ ابن أبی حاتم : 112/3۔ مستدرک حاکم : 323/2، ح : ۳۱۵۹ ] ابن کثیر رحمہ اللہ نے اس قول کی سند کو صحیح قرار دیا ہے، مراد حسبِ استطاعت ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «فَاتَّقُوا اللّٰهَ مَا اسْتَطَعْتُمْ » [ التغابن : ۱۶ ] ’’ سو اللہ سے ڈرو جتنی طاقت رکھو۔‘‘ ¤ ➋ {وَ لَا تَمُوْتُنَّ اِلَّا وَ اَنْتُمْ مُّسْلِمُوْنَ:} چونکہ موت کا علم ہی نہیں کب آ جائے، اس لیے موت آنے تک ہر وقت اللہ تعالیٰ سے اسی طرح ڈرتے رہو۔"
    },
    {
      "Ayah": 103,
      "tafsir": "(آیت 103) ➊ {وَ اعْتَصِمُوْا بِحَبْلِ اللّٰهِ جَمِيْعًا … :} مومنوں کو اہل کتاب کی اطاعت سے دور رہنے کی نصیحت فرما کر اب یہاں سے چند اصولی باتوں کا حکم دیا جا رہا ہے، جن کی پابندی سے انسان ہر قسم کے فتنوں سے محفوظ رہ سکتا ہے، یعنی اللہ تعالیٰ سے ڈرنا جیسے ڈرنے کا حق ہے، سب کا مل کر اللہ کی رسی کو مضبوطی سے پکڑنا اور جدا جدا نہ ہونا اور اللہ کی نعمت، یعنی دلوں میں الفت ڈالنے کو یاد رکھنا۔ ¤ ➋ اللہ کی رسی سے مراد قرآن ہے، درحقیقت یہ ایک استعارہ ہے کہ اگر کچھ لوگ پہاڑ کی بلندی سے کسی گہری کھائی میں گر پڑیں تو انھیں نکالنے کے لیے اوپر سے رسی پھینکی جاتی ہے۔ اب جو لوگ مل کر اس رسی کو مضبوطی سے پکڑ لیں وہ اس رسی کے ساتھ اوپر نکل آئیں گے اور دوسرے گڑھے ہی میں رہ جائیں گے۔ اسی طرح اللہ تعالیٰ نے گمراہی کے گڑھے سے نکالنے کے لیے آسمان سے قرآن اتارا ہے، جس کے ساتھ وحی الٰہی، یعنی سنت رسول بھی اتاری ہے۔ مسلمان موجودہ فرقہ بندیوں سے بھی اسی صورت میں نجات پا سکتے ہیں کہ قرآن مجید کو لائحہ عمل قرار دیں اور ذاتی خیالات و آراء کو ترک کر کے سنت کی روشنی میں قرآن کو سمجھیں اور اس پر عمل کریں اور مشائخ و ائمہ کے اقوال و فتاویٰ کو قرآن و سنت کا درجہ دے کر گروہ بندی اختیار نہ کریں۔ ¤ ➌ {اِذْ كُنْتُمْ اَعْدَآءً … :} اسلام سے پہلے اوس اور خزرج ہی نہیں بلکہ تمام عرب کفر و شرک اور باہمی عداوتوں میں مبتلا تھے۔ اسی کو یہاں آگ کے گڑھے کے کنارے پر ہونے سے تعبیر کیا ہے۔ مقصد یہ ہے کہ اسلام کے ذریعے سے اللہ تعالیٰ نے تمھیں آگ میں گرنے سے بچا لیا اور عداوت کے بجائے اخوت پیدا کر دی۔ اگر اس عداوت کا اندازہ کرنا ہو تو سورۂ انفال (۶۲، ۶۳) کا مطالعہ کریں۔"
    },
    {
      "Ayah": 104,
      "tafsir": "(آیت 104) {وَ لْتَكُنْ مِّنْكُمْ اُمَّةٌ …:} یعنی اللہ تعالیٰ کی رسی کو مضبوط پکڑنے اور اختلافف و ضلالت سے بچنے کی صورت یہ ہے کہ تم میں سے ایک جماعت نیکی کا حکم دینے اور برائی سے منع کرنے کا فریضہ سر انجام دیتی رہے۔ جب تک اس قسم کی جماعت قائم رہے گی، لوگ ہدایت پر رہیں گے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ’’تم میں سے جو شخص کوئی برائی دیکھے وہ اسے اپنے ہاتھ سے بدل دے، پھر اگر طاقت نہ رکھے تو اپنی زبان سے، پھر اگر طاقت نہ رکھے تو اپنے دل سے اور یہ سب سے کمزور ایمان ہے۔‘‘ [ مسلم، الإیمان، باب بیان کون النھی عن المنکر… : ۴۹، عن أبی سعید الخدری رضی اللہ عنہ ] شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ اس آیت سے معلوم ہوا کہ مسلمانوں پر فرض ہے کہ ایک جماعت قائم رہے جہاد کرنے کے لیے اور دین کا تقید کرنے ( پابندی کرنے اور کروانے) کے لیے، تاکہ کوئی دین کے خلاف نہ کرے اور جو اس کام پر قائم ہوں وہی کامیاب ہیں اور یہ کہ کوئی کسی سے واسطہ نہ رکھے ’’موسیٰ بدین خود، عیسیٰ بدین خود ‘‘ (موسیٰ اپنے دین پر اور عیسیٰ اپنے دین پر) یہ راہ مسلمان کی نہیں ہے۔‘‘ (موضح) ¤ یہ تفسیر {’’مِنْكُمْ ‘‘} کے {’’مِنْ‘‘} کو بعض کے معنی میں لینے کی صورت میں ہے، جیسا کہ عام طور پر «وَ لْتَكُنْ مِّنْكُمْ اُمَّةٌ » میں {’’مِنْ‘‘} کو تبعیض کے لیے سمجھا جاتا ہے۔ اس کی تفسیر کی رو سے مسلمانوں کی ایک جماعت امر بالمعروف اور نہی عن المنکر کے لیے کافی ہے، مگر اللہ تعالیٰ کے فرمان «وَ اُولٰٓىِٕكَ هُمُ الْمُفْلِحُوْنَ» سے معلوم ہوتا ہے کہ امت کے ہر فرد پر امر بالمعروف اور نہی عن المنکر فرض ہے، کیونکہ آخر میں فرمایا کہ کامیاب صرف وہ ہیں جو یہ فریضہ سرانجام دیں اور ظاہر ہے کہ کامیابی کی ضرورت ہر مسلمان کو ہے۔ اس لیے یہاں {’’ مِنْكُمْ ‘‘} کے {’’مِنْ‘‘} کو بیانیہ ماننا پڑے گا اور معنی یہ ہو گا کہ اے مسلمانو! تمھاری صورت میں ایک ایسی جماعت ہونا لازم ہے جو نیکی کا حکم دیں۔ ابن جزی نے فرمایا : {’’ وَ قَوْلُهُ ’’ مِنْكُمْ ‘‘ دَلِيْلٌ عَلٰي اَنَّهُ فَرْضُ كَفَايَةٍ لِاَنَّ مِنْ لِلتَّبْعِيْضِ وَ قِيْلَ اِنَّهَا لِبِيَانِ الْجِنْسِ وَالْمَعْنَي كُوْنُوْا أُمَّةً ‘‘} ’’ یعنی ایک قول یہ ہے کہ {’’ مِنْ ‘‘ } جنس کے بیان کے لیے ہے اور معنی یہ ہے کہ تم سب ایسی امت بن جا ؤ جو …۔ جیسا کہ فرمایا : «فَاجْتَنِبُوا الرِّجْسَ مِنَ الْاَوْثَانِ » [ الحج : ۳۰ ] ’’پس گندگی سے بچ جاؤ جو بت ہیں۔‘‘ ابن جزی کہتے ہیں :{ ’’ مِنْ‘‘ ”لِبِيَانِ الْجِنْسِ كَأَنَّهُ قَالَ اللرِّجْسُ هُوَ الْأَوْثَانُ“} یعنی {’’ مِنْ‘‘} جنس کے لیے ہے اور ’’رجس‘‘ سے مراد بت ہیں۔ [ التسہیل لابن جُزی ]"
    },
    {
      "Ayah": 105,
      "tafsir": "(آیت 105) {وَ لَا تَكُوْنُوْا كَالَّذِيْنَ تَفَرَّقُوْا …:} اس سے مراد بنی اسرائیل ہیں۔ معلوم ہوا کہ یہود و نصاریٰ کے باہمی اختلاف اور فرقہ بندی کی وجہ یہ نہ تھی کہ انھیں حق کا پتا نہ تھا اور وہ اس کے دلائل سے بے خبر تھے، بلکہ حقیقت یہ ہے کہ انھوں نے سب کچھ جانتے ہوئے محض اپنے دنیاوی مفاد اور نفسانی اغراض کے لیے اختلاف اور فرقہ بندی کا راستہ اختیار کیا تھا اور اس پر جمے ہوئے تھے۔ قرآن مجید نے مختلف طریقوں سے بار بار یہ حقیقت واضح فرمائی اور اس سے دور رہنے کی تاکید فرمائی۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ یہود اکہتر (۷۱) یا بہتر (۷۲) فرقوں میں جدا جدا ہو گئے، اسی طرح نصاریٰ بھی اور میری امت تہتر (۷۳) فرقوں میں جدا جدا ہو جائے گی۔‘‘ [ ترمذی، الإیمان، باب ما جاء فی افتراق ھذہ الأمۃ : ۲۶۴۰، و قال حسن صحیح ] دوسری حدیث میں وضاحت ہے کہ آپ نے فرمایا : ’’سب آگ میں جائیں گے مگر ایک۔‘‘ پوچھنے پر بتایا : [ مَا أَنَا عَلَيْهِ وَ أَصْحَابِيْ ] ’’جس طریقے پر میں اور میرے اصحاب ہیں۔‘‘ [ ترمذی، الإیمان، باب ما جاء فی افتراق ھذہ الأمۃ : ۲۶۴۱، و حسنہ الألبانی ] ¤ افسوس! امت مسلمہ کے تفرقہ بازوں نے بھی وہی روش اختیار کی کہ حق اور اس کے روشن دلائل قرآن کریم اور سنت صحیحہ کی صورت میں انھیں خوب اچھی طرح معلوم ہیں، مگر وہ اپنی فرقہ بندیوں پر جمے ہوئے ہیں اور اپنی عقل و ذہانت کا سارا زور پہلی امتوں کی طرح تاویل و تحریف کے مکروہ شغل میں ضائع کر رہے ہیں۔"
    },
    {
      "Ayah": 106,
      "tafsir": "(آیت 106) {اَكَفَرْتُمْ بَعْدَ اِيْمَانِكُمْ:} اس سے بظاہر تو مرتدین مراد ہیں، مگر درحقیقت یہ تمام کفار کو شامل ہے، کیونکہ جب ثابت ہے کہ روز اول کے وقت سب نے اللہ تعالیٰ کے رب ہونے کا اقرار کیا تھا اور حدیث میں یہ بھی ہے کہ ہر شخص دین فطرت پر پیدا ہوتا ہے، لہٰذا جو بھی کفر اختیار کرے گا وہ ایمان لانے کے بعد ہی کافر ہو گا۔ اس لیے علماء نے لکھا ہے کہ اس آیت میں اصلی کافر، مرتدین، منافقین اور پھر اہل بدعت سبھی آ جاتے ہیں، کیونکہ یہ سب ایمان لانے کے بعد کفر کر رہے ہیں۔ (رازی، شوکانی) شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ معلوم ہوا کہ سیاہ منہ ان کے ہیں جو مسلمانی میں کفر کرتے ہیں، منہ سے کلمۂ اسلام کہتے ہیں اور عقیدہ خلاف رکھتے ہیں، سب گمراہ فرقوں کا یہی حکم ہے۔‘‘ (موضح)"
    },
    {
      "Ayah": 107,
      "tafsir": "(آیت 107) {وَ اَمَّا الَّذِيْنَ ابْيَضَّتْ وُجُوْهُهُمْ:} چہروں کی یہ سیاہی اور سفیدی قیامت کے دن ہو گی۔ جو لوگ ایمان پر قائم رہے،پھر بدعات اور گروہ بندی سے بچ کر اصل کتاب و سنت [مَا أَنَا عَلَيْهِ وَ أَصْحَابِيْ] پر قائم رہے، ان کے چہرے سفید ہوں گے۔"
    },
    {
      "Ayah": 108,
      "tafsir": "(آیت 108) {وَ مَا اللّٰهُ يُرِيْدُ ظُلْمًا لِّلْعٰلَمِيْنَ:} یعنی جہاد اور امر بالمعروف کا جو حکم فرمایا یہ مخلوق پر ظلم نہیں، اس میں ان کی تربیت ہے۔ (موضح) جب اللہ تعالیٰ کو ہر چیز کا علم اور ہر چیز پر قدرت حاصل ہے تو اسے کسی پر ظلمم کرنے کی کیا ضرورت ہے۔ (ابن کثیر)"
    },
    {
      "Ayah": 109,
      "tafsir": "(آیت 109) {وَ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ … :} یعنی جہاد میں خلق کی جان و مال تلف ہو تو مالک کے حکم سے ہے، ہر چیز اللہ کا مال ہے۔ (موضح)"
    },
    {
      "Ayah": 110,
      "tafsir": "(آیت110) ➊ {كُنْتُمْ خَيْرَ اُمَّةٍ … :} یعنی یہ امت ہر امت سے بہتر ہے انھی دو صفات میں، امر بالمعروف یعنی جہاد اور ایمان یعنی توحید کا تقید (پابندی) اس قدر کسی اور دین میں نہیں۔ (موضح) ان دو صفتوں سے پہلے ایک اور صفت بھی ذکر فرمائی ہے اور وہ ہے {’’اُخْرِجَتْ لِلنَّاسِ ‘‘} یعنی یہ امت پیدا ہی لوگوں کی خیر خواہی اور اصلاح کے لیے کی گئی ہے۔ یاد رہے! امر بالمعروف اور نہی عن المنکر سے مراد جہاد ہے، وہ ہاتھ سے ہو یا زبان سے یا دل سے۔ ابوہریرہ رضی اللہ عنہ نے اس آیت کی یہی تفسیر بیان کرتے ہوئے فرمایا : [ خَيْرَ النَّاسِ لِلنَّاسِ تَأْتُوْنَ بِهِمْ فِي السَّلاَسِلِ فِيْ أَعْنَاقِهِمْ  حَتّٰي يَدْخُلُوْا فِي الإِسْلاَمِ ] [ بخاری، التفسیر، باب : «کنتم خیر أمۃ أخرجت للناس» : ۴۵۵۷ ] ’’تم لوگوں کے حق میں تمام لوگوں سے بہتر ہو کہ ان کی گردنوں میں زنجیریں ڈال کر لاتے ہو، حتیٰ کہ وہ اسلام میں داخل ہو جاتے ہیں۔‘‘ معاویہ بن حیدہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ تم ستر (۷۰) امتوں کو پورا کر رہے ہو، جن میں سے تم اللہ تعالیٰ کے ہاں سب سے بہتر اور سب سے معزز ہو۔‘‘ [ أحمد : 447/4، ح : ۲۰۰۳۷۔ ترمذی، التفسیر، باب ومن سورۃ آل عمران : ۳۰۰۱ و حسنہ الألبانی ] ¤ ➋ کچھ لوگ نیکی کا حکم دیتے ہیں اور کہتے ہیں کہ اس سے لوگ خود بخود برائی چھوڑ دیں گے، اگر ایسا ہوتا تو برائی سے منع کرنے کا حکم نہ ہوتا اور سب سے بڑی برائی شرک و کفر کو زبان سے روکنے کے ساتھ قتال ( لڑنا) فرض نہ ہوتا۔ ¤ ➌ {وَ تُؤْمِنُوْنَ بِاللّٰهِ :} یعنی امر بالمعروف اور نہی عن المنکر کی صورت میں دنیا کے کاروبار کا جو نقصان ہوتا ہے تم اس کی پروا نہیں کرتے، ¤ ➍ {خَيْرَ اُمَّةٍ:} اس کا ایک معنی پہلے گزر چکا کہ یہ امت تمام امتوں سے بہتر ہے اور دوسرا معنی یہ ہے کہ یہ خطاب صحابہ کرام رضی اللہ عنہم سے ہے کہ تم پوری امت محمد صلی اللہ علیہ وسلم سے بہتر ہو، کیونکہ امر بالمعروف و نہی عن المنکر(جہاد) اور ایمان باللہ (توحید خالص کا عقیدہ) تم میں بدرجۂ اتم پائے جاتے ہیں۔ اس سے صحابہ کی فضیلت معلوم ہوتی ہے اور ان پر کفر کا فتویٰ لگانے والوں کے منہ میں خاک پڑتی ہے۔ خلاصہ یہ کہ الفاظ کے لحاظ سے دونوں معنی درست ہیں اور حقیقت میں بھی ایسا ہی ہے۔ ¤ ➎ بہترین امت ہونے کا وصف چند شرطوں کے ساتھ مشروط ہے، یعنی لوگوں کی خیر خواہی و اصلاح، امر بالمعروف و نہی عن المنکر (جہاد) اور ایمان باللہ (توحید خالص)، جب اس امت میں یہ چیزیں نہیں رہیں گی تو وہ بہترین امت ہونے کے وصف سے محروم ہو جائے گی، جیسا کہ یہود کے بارے میں آتا ہے : «كَانُوْا لَا يَتَنَاهَوْنَ عَنْ مُّنْكَرٍ فَعَلُوْهُ » [ المائدۃ : ۷۹ ] ’’وہ ایک دوسرے کو کسی برائی سے جو انھوں نے کی ہوتی، روکتے نہ تھے۔‘‘ جیسا کہ اب اس امت کا حال ہو رہا ہے۔ ¤ ➏ {وَ لَوْ اٰمَنَ اَهْلُ الْكِتٰبِ … :} اس آیت میں اہل کتاب کو اسلام لانے کی ترغیب ہے اور اس حقیقت کا اظہار ہے کہ ان میں سے کچھ مومن ہیں، مگر اکثر فاسق ہیں اور یہ اللہ کی مشیت ہے جس کی حکمت وہی جانتا ہے، جیسا کہ فرمایا : «وَ مَاۤ اَكْثَرُ النَّاسِ وَ لَوْ حَرَصْتَ بِمُؤْمِنِيْنَ » [ یوسف : ۱۰۳ ] ’’اور اکثر لوگ خواہ تو حرص کرے، ہر گز ایمان لانے والے نہیں۔‘‘ اس سے جمہوریت کا بھی رد ہوتا ہے خواہ وہ کسی بھی قسم کی ہو۔"
    },
    {
      "Ayah": 111,
      "tafsir": "(آیت 111) {اِلَّاۤ اَذًى:} {”اَذًى“} میں تنوین تقلیل و تحقیر کے لیے ہے، اس لیے ترجمہ ’’معمولی تکلیف‘‘ کیا ہے، مراد زبانی بہتان تراشی اور سازشیں ہیں، مگر میدان میں تمھارے مقابلے میں ٹھہر نہیں سکیں گے، چنانچہ ایسا ہی ہوا۔ یہود کو مسلمانوں کے مقابلے میں ہر جگہ شکست ہوئی اور رسوائی کا منہ دیکھنا پڑا، بالآخر نبی کریم صلی اللہ علیہ وسلم اور آپ کے صحابہ نے انھیں جزیرۂ عرب سے جلاوطن کر دیا۔ یہ آیت اخبار بالغیب اور پیشین گوئی پر مشتمل ہے اور اللہ تعالیٰ نے اس میں فتح و کامیابی اور نصرت کی بشارت دی ہے۔ اب اگرچہ یہود نصرانیوں کے بل بوتے پر فلسطین کے کچھ حصے اور بیت المقدس پر قابض ہیں، مگر وہ وقت قریب آ رہا ہے کہ جب مسلمانوں کے ساتھ یہود کی جنگ میں پتھر اور درخت بھی مسلمان کو بلا کر کہیں گے : ’’اے مسلم ! یہ میرے پیچھے یہودی چھپا ہوا ہے، اسے قتل کر دے۔‘‘ [ مسلم، الفتن، باب لا تقوم الساعۃ حتی… : ۲۹۲۱، ۲۹۲۲ ]"
    },
    {
      "Ayah": 112,
      "tafsir": "(آیت 112) ➊ {ضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ …:} یعنی مغلوب ہونے کے ساتھ ہی ان پر ذلت بھی مسلط کر دی گئی۔ (دیکھیے سورۂ بقرہ: ۶۱) یہود کی اس ذلت سے بچا ؤ کی دو صورتیں بیان کی گئی ہیں، ایک یہ کہ وہ اللہ کی پناہ میں آ جائیں، جس کا مطلب یہ ہے کہ وہ اسلام قبول کر لیں، یا اسلامی مملکت میں جزیہ دے کر ذمی کی حیثیت سے رہنا قبول کر لیں۔ دوسری صورت یہ ہے کہ لوگوں کی پناہ ان کو حاصل ہو جائے۔ اس کے دو مفہوم بیان کیے گئے ہیں، ایک یہ کہ اسلامی مملکت کے بجائے عام مسلمان ان کو پناہ دے دیں، جیسا کہ ہر مسلمان کو یہ حق حاصل ہے اور اسلامی مملکت کے حکمرانوں اور تمام مسلمانوں کو تاکید کی گئی ہے کہ معمولی درجے کے مسلمان حتیٰ کہ کسی عورت کی دی ہوئی پناہ کو بھی رد نہ کیا جائے۔ دوسرا یہ کہ کسی بڑی غیر مسلم طاقت کی پشت پناہی انھیں حاصل ہو جائے، کیونکہ { ”النَّاسِ“ } عام ہے، اس میں مسلم اور غیر مسلم دونوں شامل ہیں۔ ¤ ➋ {ذٰلِكَ بِاَنَّهُمْ كَانُوْا يَكْفُرُوْنَ بِاٰيٰتِ اللّٰهِ :} یعنی نافرمانی اور حد سے گزرنے کا اثر یہ ہوا کہ وہ کفر کرنے لگے اور پیغمبروں کو ناحق قتل کرنے لگے، پھر کفر اور قتل انبیاء کا نتیجہ یہ ہوا کہ اللہ کا غضب اترا، ذلیل و محتاج ہو گئے، حکومت اور ریاست چھن گئی۔ حاصل یہ کہ ذلت و غضب اور مسکنت کی وجہ کفر اور قتلِ انبیاء ہے اور کفر اور قتل انبیاء کی وجہ ان کی نافرمانی اور زیادتی ہے، پس {”ذٰلِكَ بِمَا عَصَوْا“} سے سبب کے سبب کی طرف اشارہ ہے۔"
    },
    {
      "Ayah": 113,
      "tafsir": "(آیت 113) ➊ {لَيْسُوْا سَوَآءً … :} یعنی گو اہل کتاب کی اکثریت فاسق ہے مگر سب ایک جیسے نہیں، ان میں سے کچھ لوگ ایسے بھی ہیں جو ایمان لے آتے ہیں۔ طبری اور ابن ابی حاتم نے حسن سندوں کے ساتھ ابن عباس رضی اللہ عنہما سے نقل کیا ہے کہ جب عبد اللہ بن سلام، ثعلبہ بن سعید، اسید بن سعید، اسد بن عبید رضی اللہ عنہم اور انن کے دوسرے ساتھی مسلمان ہوئے اور اسلام میں رغبت رکھ کر پکے ہو گئے تو یہودی مولوی اور ان کے بے ایمان لوگ کہنے لگے کہ محمد ( صلی اللہ علیہ وسلم ) کے پیچھے صرف ہمارے برے لوگ ہی لگے ہیں، اگر وہ ہمارے اچھے لوگ ہوتے تو اپنے آباء کا دین چھوڑ کر غیر کی طرف نہ جاتے، اس پر اللہ تعالیٰ نے یہ آیات (۱۱۳، ۱۱۴) نازل فرمائیں۔ یہ الفاظ طبری کے ہیں۔ اہل کتاب کے ان اچھے لوگوں کا ذکر سورۂ آل عمران (۱۹۹)، بنی اسرائیل (۱۰۷ تا ۱۰۹) اور سورۂ بقرہ (۱۲۱) میں بھی ہے۔ ¤ ➋ { اُمَّةٌ قَآىِٕمَةٌ … : } یعنی رات کو قیام کرتے ہیں اور تہجد کی نماز میں قرآن کی تلاوت کرتے ہیں۔ {”قَآىِٕمَةٌ“} کا ایک معنی {’’ مُسْتَقِيْمَةٌ ‘‘} ہے، یعنی رسول اللہ صلی اللہ علیہ وسلم کے فرماں بردار ہیں اور ان کی شریعت پر قائم ہیں۔"
    },
    {
      "Ayah": 114,
      "tafsir": "(آیت 114) {يُؤْمِنُوْنَ بِاللّٰهِ …:} یہ یہود پر طنز ہے کہ جن لوگوں کو تم برا کہتے ہو ان میں تو یہ نیک اوصاف ہیں، وہ برے کیسے ہو گئے، وہ تو صالحین میں سے ہیں۔"
    },
    {
      "Ayah": 115,
      "tafsir": "(آیت 115) {وَ مَا يَفْعَلُوْا مِنْ خَيْرٍ …:} یعنی اہل کتاب میں سے جو لوگ بھی صفاتِ مذکورہ سے متصف ہو جائیں گے انھیں صرف ان کے بعد کے نیک اعمال کا ثواب ہی نہیں ملے گا بلکہ اسلام میں داخل ہونے سے قبل کی نیکیوں کا اجر بھی حاصل ہو گا۔ جیسا کہ ایک حدیث میں ہے : ’’تین آدمیوں کو دوہرا اجر ملے گا، ان میں سے ایک اہل کتاب میں سے وہ شخص ہے جو اپنے نبی پر ایمان لایا اور پھر مجھ پر بھی، تو اسے دو اجر ملیں گے، دوسرا وہ غلام جو کسی کی ملکیت میں ہے، اللہ کا حق ادا کرتا ہے اور اپنے مالکوں کا بھی، اس کے لیے بھی دو اجر ہیں اور تیسرا وہ آدمی جس نے اپنی لونڈی کو ادب سکھایا اور اچھا ادب سکھایا، پھر اسے آزاد کر کے اس سے نکاح کر لیا تو اس کے لیے بھی دو اجر ہیں۔‘‘ [ بخاری، العلم، باب تعلیم الرجل أمتہ وأھلہ : ۹۷۔ مسلم : ۱۵۴ ] اور دیکھیے سورۂ حدید (۲۸)۔"
    },
    {
      "Ayah": 116,
      "tafsir": "(آیت 117،116) ➊ {لَنْ تُغْنِيَ عَنْهُمْ اَمْوَالُهُمْ …:} یعنی جو مال خرچ کیا اور اللہ کی رضا پر نہ دیا، آخرت میں دیا نہ دیا برابر ہے۔ (موضح) عام طور پر مصیبت کے وقت اولاد انسان کے کام آتی ہے، مگر اس وقت کفار کی اولاد ان کے کسی کام نہیں آئے گی۔ اوپر کی آیات میں مومن اور متقی کے نیک اعمال کا انجام ذکر فرمایا کہ ان کی ادنیٰ سے ادنیٰ نیکی بھی ضائع نہیں ہو گی، بلکہ اس کا پورا پورا بدلہ ملے گا، اب اس آیت میں کافر کے صدقہ و خیرات اور رفاہی کاموں کو آخرت میں بے فائدہ اور ضائع ہونے کے اعتبار سے ان لوگوں کی کھیتی سے تشبیہ دی ہے جنھوں نے اپنی جانوں پر ظلم کیا، جو کھیتی دیکھنے میں سرسبز و شاداب نظر آئے لیکن یکایک سخت سرد ہوا چلے اور اسے تباہ و برباد کر کے رکھ دے۔ یہی حال کفار کے صدقہ و خیرات کا ہے، وہ چونکہ ایمان و اخلاص کی دولت سے محروم ہیں، اس لیے آخرت میں ان کے اعمال تباہ و برباد ہو جائیں گے اور انھیں ان اعمال کا کچھ بھی اجر نہیں ملے گا۔ مزید دیکھیے سورۂ فرقان (۲۳) اور سورۂ نور( ۳۹، ۴۰) ہاں کفار کو دنیا ہی میں ان کے اچھے اعمال کا بدلہ مل جائے گا۔ دیکھیے سورۂ احقاف (۲۰) {’’صِرٌّ ‘‘} شدید ٹھنڈی ہوا جو کھیتوں کو جلا دے۔ واضح رہے کہ قرآن میں عموماً {’’رِيْحٌ‘‘} کا لفظ عذاب کے لیے استعمال ہوا ہے اور {”رِيَاحٌ“} جمع کا لفظ رحمت کے لیے۔ ( مفردات) سورۂ یونس (۲۲) میں {’’رِيْحٌ‘‘} کا لفظ موافق ہوا کے لیے آیا ہے : «وَ جَرَيْنَ بِهِمْ بِرِيْحٍ طَيِّبَةٍ » دوسرے مقامات پر عذاب کی ہوا کے لیے آیا ہے۔ ¤ ➋ {وَ مَا ظَلَمَهُمُ اللّٰهُ …:} یعنی ان کے اعمال جو ضائع اور برباد ہوئے یہ اس وجہ سے نہیں کہ اللہ تعالیٰ نے ان پر ظلم کیا ہے، بلکہ خود ان کے اپنے اوپر ظلم کا نتیجہ ہے۔ کیونکہ انھوں نے نہ تو اللہ تعالیٰ اور اس کے رسولوں اور کتابوں کی تصدیق کی اور نہ خالص اللہ تعالیٰ کے لیے عمل کیے، بلکہ ریاکاری کرتے رہے۔"
    },
    {
      "Ayah": 117,
      "tafsir": "(آیت 117،116) ➊ {لَنْ تُغْنِيَ عَنْهُمْ اَمْوَالُهُمْ …:} یعنی جو مال خرچ کیا اور اللہ کی رضا پر نہ دیا، آخرت میں دیا نہ دیا برابر ہے۔ (موضح) عام طور پر مصیبت کے وقت اولاد انسان کے کام آتی ہے، مگر اس وقت کفار کی اولاد ان کے کسی کام نہیں آئے گی۔ اوپر کی آیات میں مومن اور متقی کے نیک اعمال کا انجام ذکر فرمایا کہ ان کی ادنیٰ سے ادنیٰ نیکی بھی ضائع نہیں ہو گی، بلکہ اس کا پورا پورا بدلہ ملے گا، اب اس آیت میں کافر کے صدقہ و خیرات اور رفاہی کاموں کو آخرت میں بے فائدہ اور ضائع ہونے کے اعتبار سے ان لوگوں کی کھیتی سے تشبیہ دی ہے جنھوں نے اپنی جانوں پر ظلم کیا، جو کھیتی دیکھنے میں سرسبز و شاداب نظر آئے لیکن یکایک سخت سرد ہوا چلے اور اسے تباہ و برباد کر کے رکھ دے۔ یہی حال کفار کے صدقہ و خیرات کا ہے، وہ چونکہ ایمان و اخلاص کی دولت سے محروم ہیں، اس لیے آخرت میں ان کے اعمال تباہ و برباد ہو جائیں گے اور انھیں ان اعمال کا کچھ بھی اجر نہیں ملے گا۔ مزید دیکھیے سورۂ فرقان (۲۳) اور سورۂ نور( ۳۹، ۴۰) ہاں کفار کو دنیا ہی میں ان کے اچھے اعمال کا بدلہ مل جائے گا۔ دیکھیے سورۂ احقاف (۲۰) {’’صِرٌّ ‘‘} شدید ٹھنڈی ہوا جو کھیتوں کو جلا دے۔ واضح رہے کہ قرآن میں عموماً {’’رِيْحٌ‘‘} کا لفظ عذاب کے لیے استعمال ہوا ہے اور {”رِيَاحٌ“} جمع کا لفظ رحمت کے لیے۔ ( مفردات) سورۂ یونس (۲۲) میں {’’رِيْحٌ‘‘} کا لفظ موافق ہوا کے لیے آیا ہے : «وَ جَرَيْنَ بِهِمْ بِرِيْحٍ طَيِّبَةٍ » دوسرے مقامات پر عذاب کی ہوا کے لیے آیا ہے۔ ¤ ➋ {وَ مَا ظَلَمَهُمُ اللّٰهُ …:} یعنی ان کے اعمال جو ضائع اور برباد ہوئے یہ اس وجہ سے نہیں کہ اللہ تعالیٰ نے ان پر ظلم کیا ہے، بلکہ خود ان کے اپنے اوپر ظلم کا نتیجہ ہے۔ کیونکہ انھوں نے نہ تو اللہ تعالیٰ اور اس کے رسولوں اور کتابوں کی تصدیق کی اور نہ خالص اللہ تعالیٰ کے لیے عمل کیے، بلکہ ریاکاری کرتے رہے۔"
    },
    {
      "Ayah": 118,
      "tafsir": "(آیت 118) ➊ { ”بِطَانَةً“ } پوشیدہ چیز اور وہ کپڑا جو اوپر والے کپڑے کے نیچے جسم کے ساتھ ملا ہوتا ہے، مراد دلی دوست، خاص راز دار۔ یہ باب {’’ نَصَرَ‘‘} سے مصدر ہے، واحد اور جمع دونوں پر بولا جاتا ہے۔ { ”مِنْ دُوْنِكُمْ“ } ( اپنے مخلص مسلمانوں کے سوا) اس کا تعلق «يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنْ تُطِيْعُوْا فَرِيْقًا مِّنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ يَرُدُّوْكُمْ بَعْدَ اِيْمَانِكُمْ كٰفِرِيْنَ» [ آل عمران : ۱۰۰ ] سے ہے اور اس میں کفار کی طرف میلان اور ان کی دوستی سے منع فرمایا گیا ہے۔ طبری نے حسن سند کے ساتھ ابن عباس رضی اللہ عنہما سے نقل کیا ہے : ’’مسلمانوں میں سے کچھ آدمی یہودیوں سے میل جول اور تعلقات رکھتے تھے، کیونکہ اسلام سے پہلے وہ آپس میں ہمسائے اور حلیف تھے، تو اللہ تعالیٰ نے یہ آیات نازل کر کے انھیں اپنے اندرونی راز داں اور دلی دوست بنانے سے منع فرما دیا۔ کیونکہ اس میں ( راز افشا ہونے اور) ان کی طرف سے فتنے کا شدید خطرہ تھا۔‘‘ ¤ ابن ابی حاتم ہی نے صحیح سند کے ساتھ ذکر کیا ہے کہ عمر بن خطاب رضی اللہ عنہ سے کہا گیا کہ اہل حیرہ سے ایک نوجوان محفوظ رکھنے والا کاتب ہے، آپ اسے کاتب (سیکرٹری) رکھ لیں۔ فرمایا: ’’پھر تو میں مومنوں کے سوا { ”بِطَانَةً“ } (راز دار) بنانے والا ہوں گا۔‘‘ [ ابن أبی حاتم : 147/3، ح : ۴۰۸۷ ] ابو موسیٰ اشعری رضی اللہ عنہ بیان کرتے ہیں : ’’میں نے عمر رضی اللہ عنہ سے کہا : میرے پاس ایک نصرانی کاتب ہے۔‘‘ انھوں نے فرمایا : ’’اللہ تجھے مارے، یہ تم نے کیا کیا ؟ کیا تم نے اللہ کا یہ فرمان نہیں سنا : «يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوا الْيَهُوْدَ وَ النَّصٰرٰۤى اَوْلِيَآءَ بَعْضُهُمْ اَوْلِيَآءُ بَعْضٍ» [ المائدۃ : ۵۱ ] تم نے کسی مسلمان کو کیوں نہیں رکھا؟‘‘ میں نے عرض کی : ’’اے امیر المومنین! مجھے اس کی کتابت سے غرض ہے، اس کا دین اس کے لیے ہے۔‘‘ عمر رضی اللہ عنہ نے فرمایا : ’’جب اللہ نے انھیں رسوا کر دیا ہے تو میں ان کی تکریم نہیں کر سکتا، جب اللہ نے انھیں ذلیل کیا ہے تو میں انھیں عزت نہیں دے سکتا، جب اللہ نے انھیں دور کر دیا ہے تو میں انھیں قریب نہیں کر سکتا۔‘‘ [ السنن الکبریٰ للبیہقی : 127/10، ح : ۲۰۹۱۱، وھو حسن ] ¤ { ”مِنْ دُوْنِكُمْ“ } (اپنے سوا) کے الفاظ عام ہیں، یہود و نصاریٰ، منافقین اور مشرکین سبھی { ”مِنْ دُوْنِكُمْ“ } میں داخل ہیں، اس لیے انتظامی امور میں کسی منافق یا غیر مسلم (ذمی) کو متعین کرنا ممنوع ہے۔ کیونکہ اس سے مسلمانوں کے راز فاش ہونے کا خطرہ ہے۔ بلکہ مسلمان کے لیے مشرکین کے ملک میں رہنا بھی درست نہیں۔ دیکھیے سورۂ نساء (۹۷، ۹۸) ¤ افسوس کہ اس وقت مسلمان ملکوں کے حکمرانوں نے اللہ کے اس حکم کو پس پشت ڈال رکھا ہے اور غیر مسلم ان کے کلیدی عہدوں پر فائز اور تقریباً تمام اہم رازوں سے آگاہ ہیں، نتیجہ سب کے سامنے ہے۔ ¤ ➋ {لَا يَاْلُوْنَكُمْ:} {’’ أَلَا يَأْلُوْ (ن)‘‘} کمی کرنا، کوتاہی کرنا۔ { ”خَبَالًا“ } خرابی ڈالنا، نقصان پہنچانا۔ {”مَا عَنِتُّم“ ’’عَنَتٌ‘‘} مشقت، تکلیف،یعنی ’’جس سے تم تکلیف میں پڑو۔‘‘ دلی دوست نہ بنانے کے حکم کی وجہ کی طرف اشارہ ہے، یعنی اگرچہ یہ لوگ اپنی منافقت کی بنا پر تم سے ایسی باتیں نہیں کرنا چاہتے جن سے تمھیں ان کی اسلام دشمنی کا پتا چل سکے، مگر شدید عداوت کی وجہ سے ان کی زبان پر ایسے الفاظ آ ہی جاتے ہیں، جن سے تم اندازہ کر سکتے ہو کہ یہ تمھارے خیر خواہ نہیں بلکہ بدترین دشمن ہیں اور تمھارے خلاف جو جذبات اپنے دلوں میں چھپائے ہوئے ہیں، وہ اس سے کہیں بڑھ کر ہیں۔ ¤ ➌ {قَدْ بَيَّنَّا …:} یعنی کفار سے دوستی نہ کرنے کے سلسلہ میں یہودیوں اور منافقین کے بغض و عناد اور ان کے دلی حسد سے متعلق ہم نے پتے کی باتیں خوب کھول کر بیان کر دی ہیں۔ اب غور و فکر کرنا تمھارا کام ہے۔"
    },
    {
      "Ayah": 119,
      "tafsir": "(آیت 119) {”الْاَنَامِلَ“} یہ {’’اَنْمِلَةٌ‘‘} کی جمع ہے، جس کا معنی ہے انگلیوں کے پورے۔ {’’عَضَّ يَعَضُّ (س) ‘‘} کا معنی ہے دانتوں سے کانٹا۔ ’’الکتاب‘‘ سے مراد تمام آسمانی کتابیں ہیں، یعنی تم تو سب کتابوں پر ایمان رکھتے ہو اور وہ کسی کتاب پر بھی ایمان نہیں رکھتے، پھر بھی بجائے اس کے کہ تم ان سے نفرت کرو، الٹا ان سے دوستی کرتے ہو اور وہ بجائے دوستی کے تم سے دشمنی رکھتے ہیں اور دشمنی بھی اتنی سخت کہ اکیلے ہوتے ہیں تو غصے کی وجہ سے دانتوں سے انگلیوں کے پورے کاٹتے ہیں، مگر جب تم سے ملتے ہیں تو کہتے ہیں کہ ہم ایمان لے آئے۔ منافقین کی مسلم دشمنی کو واضح فرمایا ہے۔"
    },
    {
      "Ayah": 120,
      "tafsir": "(آیت 120) {اِنْ تَمْسَسْكُمْ حَسَنَةٌ تَسُؤْهُمْ …:} اس آیت میں مسلمانوں کو تعلیم دی گئی ہے کہ دشمنوں کے مکر و فریب اور ان کی چالوں سے محفوظ رہنے کا طریقہ صرف یہ ہے کہ تم صبر و استقلال اور تقویٰ سے کام لو، اگر یہ اصول اپنا لو گے تو وہ تمھیں نقصان نہیں پہنچا سکیں گے۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’ اکثر منافق بھی یہود میں سے تھے، اس واسطے ان کے ذکر کے ساتھ یہود کا ذکر بھی فرمایا۔ اب آگے غزوۂ احد کی باتیں مذکور ہیں، کیونکہ اس میں بھی مسلمانوں نے بعض کافروں کا کہنا مان لیا تھا اور لڑائی سے پھر چلے تھے اور منافقوں نے اپنے نفاق کی باتیں ظاہر کی تھیں۔‘‘ (موضح)"
    },
    {
      "Ayah": 121,
      "tafsir": "(آیت 121) {وَ اِذْ غَدَوْتَ مِنْ اَهْلِكَ …:} یہاں سے غزوۂ احد کا بیان ہے۔ غزوۂ بدر میں ذلت آمیز شکست، ستر آدمی قتل اور ستر قید ہونے کے بعد مشرکین نے جوش انتقام میں مدینہ پر حملہ آور ہونے کا منصوبہ بنایا اور ارد گرد سے مختلف قبائل کو جمع کر کے تین ہزار کا مسلح لشکر لیا اور جبل احد کے قریب آکر ٹھہر گئے۔ رسول اللہ صلی اللہ علیہ وسلم نے صحابہ رضی اللہ عنہم سے مشورہ کیا۔ بعض نے مدینہ میں رہ کر لڑنے کا مشورہ دیا، جب کہ بعض پرجوش نوجوانوں نے، جو بدر میں شریک نہیں ہو سکے تھے، میدان میں نکل کر لڑنے پر اصرار کیا۔ آپ ان کی رائے کے مطابق ایک ہزار کی جمعیت لے کر باہر نکلے۔ مقام ’’ شوط‘‘ پر عبد اللہ بن ابی نے مسلمانوں کو دھوکا دیا اور اپنے تین سو ساتھیوں کے ساتھ لوٹ آیا۔ اس سے بعض مسلمانوں کے حوصلے بھی پست ہو گئے، جیسا کہ آگے آ رہا ہے، مگر اللہ تعالیٰ نے ان کو ثابت قدمی بخشی۔ رسول اللہ صلی اللہ علیہ وسلم سات سو صحابہ رضی اللہ عنہم کی یہ جمعیت لے کر آگے بڑھے اور احد کے قریب وادی میں فوج کو آراستہ کیا، جس کی طرف قرآن نے «تُبَوِّئُ الْمُؤْمِنِيْنَ مَقَاعِدَ لِلْقِتَالِ » میں اشارہ کیا ہے۔ اسلامی فوج کی پشت پر جبلِ احد تھا اور ایک جانب ٹیلے پر عبد اللہ بن جبیر رضی اللہ عنہ کی سرکردگی میں پچاس تیر اندازوں کا دستہ متعین تھا، نیز آپ صلی اللہ علیہ وسلم نے انھیں حکم دیا تھا کہ اگر تم دیکھو کہ پرندے ہمارے جسموں کو نوچ رہے ہیں، تو پھر بھی اس جگہ کو نہ چھوڑنا، یہاں تک کہ میں تمھیں پیغام بھیجوں اور اگر تم دیکھو کہ ہم نے کفار کو شکست دے دی ہے اور انھیں پامال کر دیا ہے، پھر بھی اس جگہ کو نہ چھوڑنا، یہاں تک کہ میں پیغام بھیجوں۔ مگر ان میں سے اکثر لوگ کفار کو پسپا ہوتے دیکھ کر نیچے اتر آئے اور اس گھاٹی کو چھوڑ دیا جس سے مشرکین کو عقب سے حملہ کرنے کا موقع مل گیا۔ اس اچانک حملے سے مسلمانوں کے پا ؤ ں اکھڑ گئے۔ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چند صحابہ کرام رضی اللہ عنہم ثابت قدم رہے۔ اس موقع پر رسول اللہ صلی اللہ علیہ وسلم کا دانت مبارک شہید ہو گیا، سر اور پیشانی مبارک بھی زخمی ہو گئے۔ آخر کار صحابہ آپ صلی اللہ علیہ وسلم کے گرد دوبارہ جمع ہوئے، جس سے میدان جنگ کا نقشہ بدل گیا اور دشمن کو ناکام ہو کر لوٹ جانا پڑا۔ یہ شوال ۳ھ کا واقعہ ہے۔ ان آیات میں جنگ کے بعض واقعات کی طرف اشارے آ رہے ہیں۔ (ابن کثیر)"
    },
    {
      "Ayah": 122,
      "tafsir": "(آیت 122) {اِذْ هَمَّتْ طَّآىِٕفَتٰنِ …:} ان دو جماعتوں سے مراد انصار کے دو قبیلے بنو سلمہ اور بنو حارثہ ہیں (جو منافق عبد اللہ بن ابی کی واپسی دیکھ کر دل شکستہ ہو گئے اور انھوں نے واپس آنے کا ارادہ کر لیا تھا)۔ [ بخاری، التفسیر، باب : «إذ ھمت طآئفتان…» : ۴۵۵۸ ]"
    },
    {
      "Ayah": 123,
      "tafsir": "(آیت 123) {وَّ اَنْتُمْ اَذِلَّةٌ:} اس لفظ سے مسلمانوں کی قلت تعداد اور ضعفِ حال کی طرف اشارہ ہے۔ مقام بدر مدینہ سے قریباً 150 کلو میٹر جنوب مغرب کی طرف واقع ہے۔غزوۂ بدر بروز جمعہ ۱۷ رمضان المبارک ۲ھ ( ۱۳ مارچ ۶۲۴ء) کو پیش آیا۔ اس آیت میں جنگ احد میں شکست کے اسباب کی طرف اشارہ کرتے ہوئے معرکۂ بدر کے واقعات پر غور و فکر کی دعوت اور آئندہ ثابت قدم رہنے کے لیے تقویٰ کی تعلیم دی ہے۔ جنگِ بدر کی تفصیل کے لیے سورۂ انفال (۴۱) ملاحظہ کیجیے۔ (شوکانی، ابن کثیر )"
    },
    {
      "Ayah": 124,
      "tafsir": "(آیت 124تا127) {اِذْ تَقُوْلُ لِلْمُؤْمِنِيْنَ … :} اس کا تعلق یا تو جنگ بدر سے ہے یا جنگ احد سے۔ امام طبری نے پہلی بات کو ترجیح دی ہے، یعنی جب کفار کی تیاری اور کثرتِ تعداد کو دیکھ کر مسلمانوں کے دلوں میں تشویش پیدا ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرشتوں کی مدد کا ذکر کر کے انھیں تسلی دی۔ چنانچہ بدر میں فرشتے نازل ہوئے۔ بدر میں فرشتوں کے نزول کی کیفیت کے لیے دیکھیے سورۂ انفال (۹)۔ (ابن کثیر، شوکانی) بدر کے دن فرشتوں کی تعداد سورۂ انفال میں ایک ہزار ذکر ہوئی ہے، جبکہ یہاں تین ہزار اور پانچ ہزار کا ذکر ہے۔ جواب اس کا یہ ہے کہ پہلے ایک ہزار کا وعدہ ہوا، پھر تین ہزار اور پھر پانچ ہزار کی بشارت ہوئی، ان کا آپس میں کوئی تعارض نہیں۔ (ابن کثیر) ¤ بعض کے نزدیک اس وعدے کا تعلق جنگ احد سے ہے اور انھوں نے کہا ہے، چونکہ مسلمانوں نے جنگ احد میں توکل اور صبر سے کام نہ لیا، اس لیے اللہ تعالیٰ نے مدد کو روک لیا، ورنہ ظاہر ہے کہ اگر فرشتے نازل ہوتے تو مسلمان شکست نہ کھاتے۔ (ابن جریر)"
    },
    {
      "Ayah": 125,
      "tafsir": "(آیت 124تا127) {اِذْ تَقُوْلُ لِلْمُؤْمِنِيْنَ … :} اس کا تعلق یا تو جنگ بدر سے ہے یا جنگ احد سے۔ امام طبری نے پہلی بات کو ترجیح دی ہے، یعنی جب کفار کی تیاری اور کثرتِ تعداد کو دیکھ کر مسلمانوں کے دلوں میں تشویش پیدا ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرشتوں کی مدد کا ذکر کر کے انھیں تسلی دی۔ چنانچہ بدر میں فرشتے نازل ہوئے۔ بدر میں فرشتوں کے نزول کی کیفیت کے لیے دیکھیے سورۂ انفال (۹)۔ (ابن کثیر، شوکانی) بدر کے دن فرشتوں کی تعداد سورۂ انفال میں ایک ہزار ذکر ہوئی ہے، جبکہ یہاں تین ہزار اور پانچ ہزار کا ذکر ہے۔ جواب اس کا یہ ہے کہ پہلے ایک ہزار کا وعدہ ہوا، پھر تین ہزار اور پھر پانچ ہزار کی بشارت ہوئی، ان کا آپس میں کوئی تعارض نہیں۔ (ابن کثیر) ¤ بعض کے نزدیک اس وعدے کا تعلق جنگ احد سے ہے اور انھوں نے کہا ہے، چونکہ مسلمانوں نے جنگ احد میں توکل اور صبر سے کام نہ لیا، اس لیے اللہ تعالیٰ نے مدد کو روک لیا، ورنہ ظاہر ہے کہ اگر فرشتے نازل ہوتے تو مسلمان شکست نہ کھاتے۔ (ابن جریر)"
    },
    {
      "Ayah": 126,
      "tafsir": "(آیت 124تا127) {اِذْ تَقُوْلُ لِلْمُؤْمِنِيْنَ … :} اس کا تعلق یا تو جنگ بدر سے ہے یا جنگ احد سے۔ امام طبری نے پہلی بات کو ترجیح دی ہے، یعنی جب کفار کی تیاری اور کثرتِ تعداد کو دیکھ کر مسلمانوں کے دلوں میں تشویش پیدا ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرشتوں کی مدد کا ذکر کر کے انھیں تسلی دی۔ چنانچہ بدر میں فرشتے نازل ہوئے۔ بدر میں فرشتوں کے نزول کی کیفیت کے لیے دیکھیے سورۂ انفال (۹)۔ (ابن کثیر، شوکانی) بدر کے دن فرشتوں کی تعداد سورۂ انفال میں ایک ہزار ذکر ہوئی ہے، جبکہ یہاں تین ہزار اور پانچ ہزار کا ذکر ہے۔ جواب اس کا یہ ہے کہ پہلے ایک ہزار کا وعدہ ہوا، پھر تین ہزار اور پھر پانچ ہزار کی بشارت ہوئی، ان کا آپس میں کوئی تعارض نہیں۔ (ابن کثیر) ¤ بعض کے نزدیک اس وعدے کا تعلق جنگ احد سے ہے اور انھوں نے کہا ہے، چونکہ مسلمانوں نے جنگ احد میں توکل اور صبر سے کام نہ لیا، اس لیے اللہ تعالیٰ نے مدد کو روک لیا، ورنہ ظاہر ہے کہ اگر فرشتے نازل ہوتے تو مسلمان شکست نہ کھاتے۔ (ابن جریر)"
    },
    {
      "Ayah": 127,
      "tafsir": "(آیت 124تا127) {اِذْ تَقُوْلُ لِلْمُؤْمِنِيْنَ … :} اس کا تعلق یا تو جنگ بدر سے ہے یا جنگ احد سے۔ امام طبری نے پہلی بات کو ترجیح دی ہے، یعنی جب کفار کی تیاری اور کثرتِ تعداد کو دیکھ کر مسلمانوں کے دلوں میں تشویش پیدا ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرشتوں کی مدد کا ذکر کر کے انھیں تسلی دی۔ چنانچہ بدر میں فرشتے نازل ہوئے۔ بدر میں فرشتوں کے نزول کی کیفیت کے لیے دیکھیے سورۂ انفال (۹)۔ (ابن کثیر، شوکانی) بدر کے دن فرشتوں کی تعداد سورۂ انفال میں ایک ہزار ذکر ہوئی ہے، جبکہ یہاں تین ہزار اور پانچ ہزار کا ذکر ہے۔ جواب اس کا یہ ہے کہ پہلے ایک ہزار کا وعدہ ہوا، پھر تین ہزار اور پھر پانچ ہزار کی بشارت ہوئی، ان کا آپس میں کوئی تعارض نہیں۔ (ابن کثیر) ¤ بعض کے نزدیک اس وعدے کا تعلق جنگ احد سے ہے اور انھوں نے کہا ہے، چونکہ مسلمانوں نے جنگ احد میں توکل اور صبر سے کام نہ لیا، اس لیے اللہ تعالیٰ نے مدد کو روک لیا، ورنہ ظاہر ہے کہ اگر فرشتے نازل ہوتے تو مسلمان شکست نہ کھاتے۔ (ابن جریر)"
    },
    {
      "Ayah": 128,
      "tafsir": "(آیت 129،128) ➊ {لَيْسَ لَكَ مِنَ الْاَمْرِ شَيْءٌ … :} اس آیت میں پیغمبر صلی اللہ علیہ وسلم سے فرمایا کہ بندے کو اختیار نہیں، ہر قسم کے اختیارات اللہ تعالیٰ کے ہاتھ میں ہیں۔ (موضح) ¤ بئرِ معونہ پر جن قبائل نے آپ صلی اللہ علیہ وسلم کے ستر صحابہ کو دھوکے سے قتل کیا تھا، ان کے خلاف اور جنگِ احد میں مشرکین کی طرف سے جو لوگ پیش پیش تھے، ان کے خلاف رسول اللہ صلی اللہ علیہ وسلم نے نام لے لے کر دعائے قنوت شروع کی۔ بئر معونہ والا واقعہ بخاری میں موجود ہے۔ [ بخاری، المغازی، باب غزوۃ الرجیع… : ۴۰۸۶ ] ¤ عبد اللہ بن عمر رضی اللہ عنہما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نماز فجر کی دوسری رکعت میں رکوع کے بعد سر اٹھاتے تو {’’ سَمِعَ اللّٰهُ لِمَنْ حَمِدَهٗ رَبَّنَا وَ لَكَ الْحَمْدُ ‘‘} کے بعد یہ دعا کیا کرتے : ’’اے اللہ ! فلاں، فلاں اور فلاں پر لعنت فرما۔‘‘ چنانچہ اللہ تعالیٰ نے یہ آیت نازل فرمائی : «لَيْسَ لَكَ مِنَ الْاَمْرِ شَيْءٌ » ’’تیرے اختیار میں اس معاملے سے کچھ بھی نہیں۔‘‘ [ بخاری، التفسیر، باب : «لیس لک من الأمر شیء» : ۴۰۶۹ ] ¤ چنانچہ اللہ تعالیٰ نے ان تمام لوگوں کو جن کا نام لے کر آپ لعنت فرماتے تھے، توبہ کی توفیق عطا فرمائی اور وہ مسلمان ہو گئے۔ اس سے معلوم ہوا کہ مختار کل اور عالم الغیب ذات صرف اللہ وحدہٗ لا شریک لہ ہی ہے، ورنہ آپ اپنے عزیز چچا کو ضرور مسلمان کر لیتے اور احد اور بئر معونہ میں ظلم کرنے والوں کو ضرور ملعون کروا لیتے۔ ¤ ➋ ان آیات اور احادیث سے معلوم ہوا کہ قنوت نازلہ میں کسی کافر کا نام لے کر لعنت کرنا جائز نہیں، کیا خبر اللہ تعالیٰ اسے توبہ کی توفیق بخش دے۔ ہاں، عام کفار پر لعنت درست ہے اور یہ رسول اللہ صلی اللہ علیہ وسلم سے بھی ثابت ہے۔"
    },
    {
      "Ayah": 129,
      "tafsir": "(آیت 129،128) ➊ {لَيْسَ لَكَ مِنَ الْاَمْرِ شَيْءٌ … :} اس آیت میں پیغمبر صلی اللہ علیہ وسلم سے فرمایا کہ بندے کو اختیار نہیں، ہر قسم کے اختیارات اللہ تعالیٰ کے ہاتھ میں ہیں۔ (موضح) ¤ بئرِ معونہ پر جن قبائل نے آپ صلی اللہ علیہ وسلم کے ستر صحابہ کو دھوکے سے قتل کیا تھا، ان کے خلاف اور جنگِ احد میں مشرکین کی طرف سے جو لوگ پیش پیش تھے، ان کے خلاف رسول اللہ صلی اللہ علیہ وسلم نے نام لے لے کر دعائے قنوت شروع کی۔ بئر معونہ والا واقعہ بخاری میں موجود ہے۔ [ بخاری، المغازی، باب غزوۃ الرجیع… : ۴۰۸۶ ] ¤ عبد اللہ بن عمر رضی اللہ عنہما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نماز فجر کی دوسری رکعت میں رکوع کے بعد سر اٹھاتے تو {’’ سَمِعَ اللّٰهُ لِمَنْ حَمِدَهٗ رَبَّنَا وَ لَكَ الْحَمْدُ ‘‘} کے بعد یہ دعا کیا کرتے : ’’اے اللہ ! فلاں، فلاں اور فلاں پر لعنت فرما۔‘‘ چنانچہ اللہ تعالیٰ نے یہ آیت نازل فرمائی : «لَيْسَ لَكَ مِنَ الْاَمْرِ شَيْءٌ » ’’تیرے اختیار میں اس معاملے سے کچھ بھی نہیں۔‘‘ [ بخاری، التفسیر، باب : «لیس لک من الأمر شیء» : ۴۰۶۹ ] ¤ چنانچہ اللہ تعالیٰ نے ان تمام لوگوں کو جن کا نام لے کر آپ لعنت فرماتے تھے، توبہ کی توفیق عطا فرمائی اور وہ مسلمان ہو گئے۔ اس سے معلوم ہوا کہ مختار کل اور عالم الغیب ذات صرف اللہ وحدہٗ لا شریک لہ ہی ہے، ورنہ آپ اپنے عزیز چچا کو ضرور مسلمان کر لیتے اور احد اور بئر معونہ میں ظلم کرنے والوں کو ضرور ملعون کروا لیتے۔ ¤ ➋ ان آیات اور احادیث سے معلوم ہوا کہ قنوت نازلہ میں کسی کافر کا نام لے کر لعنت کرنا جائز نہیں، کیا خبر اللہ تعالیٰ اسے توبہ کی توفیق بخش دے۔ ہاں، عام کفار پر لعنت درست ہے اور یہ رسول اللہ صلی اللہ علیہ وسلم سے بھی ثابت ہے۔"
    },
    {
      "Ayah": 130,
      "tafsir": "(آیت 130) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَاْكُلُوا الرِّبٰۤوا:} شاید سود کا ذکر یہاں ( جنگ احد کے تذکرے میں) اس لیے فرمایا کہ اوپر (آیت ۱۲۲ میں) ذکر ہوا جہاد میں نامردی کا اور سود کھانے سے نامردی آتی ہے دو سبب سے، ایک یہ کہ مال حرام کھانے سے توفیق اطاعت کم ہوتی ہے اور بڑی اطاعت جہاد ہے اور دوسرے یہ کہ سود لینا کمال بخل ہے۔ چاہیے تھا کہ اپنا مال جتنا دیا تھا لے لیتا، درمیان میں کسی کا کام نکل جاتا، یہ بھی مفت نہ چھوڑے، اس کا جدا بدلہ چاہے، تو جس کو مال پر اتنا بخل ہو وہ جان کب دینا چاہے گا۔ (موضح) ¤ پھر انصار کے یہود کے ساتھ سودی لین دین کے تعلقات تھے اور احد میں منافقینِ یہود کی وجہ سے نقصان پہنچا تھا، گویا اس کو حرام قرار دے کر ان تعلقات کو ختم کر دیا۔ ¤ ➋ {اَضْعَافًا مُّضٰعَفَةً:} اس سے بعض لوگوں نے سود مرکب کو حرام اور سود مفرد کو حلال ثابت کرنے کی کوشش کی ہے، حالانکہ یہاں اس زمانے کے سود خوروں کی سنگ دلی بیان ہو رہی ہے، جو آج بھی موجود ہے۔ زمانۂ جاہلیت میں بہت سے لوگ دوسروں کو سودی قرض دیا کرتے، جب قرض کی میعاد ختم ہو جاتی تو مقروض سے کہتے، قرض ادا کرو ورنہ سود میں اضافہ کرو۔ قرض ادا نہ کرنے کی صورت میں میعاد میں توسیع کر دی جاتی اور سود کی مقدار میں اضافہ کر دیا جاتا۔ اس طرح کچھ عرصے کے بعد سود کی مقدار اصل زر سے بھی کئی گنا زیادہ ہو جاتی اور یہ سود تجارتی اور غیر تجارتی دونوں طرح کا ہوتا تھا، جیسا کہ اس آیت کی تفسیر کے تحت تابعین نے تصریح کی ہے۔ سودی کاروبار کی اس بھیانک صورت کی طرف قرآن نے {”اَضْعَافًا مُّضٰعَفَةً“} کے الفاظ سے اشارہ فرمایا ہے، ورنہ یہ مطلب نہیں کہ مرکب سود حرام اور سادہ جائز ہے۔ اسلام میں ہر قسم کا سود حرام ہے، صرف قرض کی ایک صورت جائز ہے، جیسا کہ فرمایا: «وَ اِنْ تُبْتُمْ فَلَكُمْ رُءُوْسُ اَمْوَالِكُمْ لَا تَظْلِمُوْنَ وَ لَا تُظْلَمُوْنَ » [ البقرۃ : ۲۷۹ ] ’’اور اگر تم توبہ کر لو تو تمھیں اپنے اصل مال لینے کی اجازت ہے، نہ تم ظلم کرو گے اور نہ تم پر ظلم کیا جائے گا۔‘‘"
    },
    {
      "Ayah": 131,
      "tafsir": "(آیت 131) {وَ اتَّقُوا النَّارَ … :} اس آیت میں سود خوروں کو اس آگ سے ڈرایا گیا ہے جو کافروں کے لیے تیار کی گئی ہے۔ اس سے معلوم ہوا سود لینا اور دینا مسلمان کا کام نہیں۔ جو شخص یہ کام کرتا ہے اور باز نہیں آتا اسے اس آگ کے لیے تیار رہنا چاہیے جو کفار کے لیے تیار کی گئی ہے۔ سورۂ بقرہ میں ایسے شخص کو اللہ تعالیٰ کی طرف سے جنگ کا اعلان کان کھول کر سننے کا حکم ہے۔ (قرطبی)"
    },
    {
      "Ayah": 132,
      "tafsir": "(آیت 132 ) {وَ اَطِيْعُوا اللّٰهَ وَ الرَّسُوْلَ … :} یعنی اللہ تعالیٰ کی رحمت کا امیدوار تو وہ شخص ہو سکتا ہے جو اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کا فرماں بردار ہو۔ سود کھانا اور اللہ تعالیٰ کی رحمت کی امید رکھنا دو متضاد چیزیں ہیں۔ آیت کے الفاظ عام ہونے کی وجہ سے اس میں ہر نافرمان کے لیے بھی عتاب موجود ہے۔ (رازی)"
    },
    {
      "Ayah": 133,
      "tafsir": "(آیت 133) ➊ {وَ سَارِعُوْۤا اِلٰى مَغْفِرَةٍ مِّنْ رَّبِّكُمْ :} اہل ایمان کو ان اعمال صالحہ کی طرف جلدی کرنی چاہیے جو اللہ تعالیٰ کی مغفرت کا سبب بنتے ہیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’نیک اعمال سر انجام دینے میں جلدی کر لو، ایسے فتنوں کے آنے سے پہلے پہلے جو اندھیری رات کے مختلف ٹکڑوں کی طرح ( یکے بعد دیگرے) رونما ہوں گے۔ صبح کو آدمی مومن ہو گا اور شام کو کافر ہو گا اور شام کو مومن ہو گا اور صبح کو کافر، وہ اپنے دین کو دنیا کے معمولی سامان کے عوض بیچ دے گا۔‘‘ [ مسلم، الإیمان، باب الحث علی المبادرۃ… : ۱۱۸، عن أبی ہریرۃ رضی اللہ عنہ ] ¤ ➋ {وَ جَنَّةٍ عَرْضُهَا السَّمٰوٰتُ … :} یعنی جس طرح سود خور کافر کے لیے دوزخ تیار کی گئی ہے اسی ططرح فرماں بردار متقی کے لیے جنت تیار کی گئی ہے اور پھر جنت کے متعلق « وَ جَنَّةٍ عَرْضُهَا السَّمٰوٰتُ وَ الْاَرْضُ » فرما کر اس کی وسعت کی طرف اشارہ فرمایا ہے۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : ’’اے محمد ! یہ بتائیں کہ جنت کا عرض آسمانوں اور زمین کے برابر ہے تو آگ کہاں ہے ؟‘‘ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : ’’یہ بتا ؤ کہ پہلے رات تھی، پھر نہیں رہی تو کہاں چلی گئی؟‘‘ اس نے کہا : ’’ اللہ بہتر جانتا ہے ‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ پھر اللہ تعالیٰ کرتا ہے جو چاہتا ہے۔‘‘ [ صحیح ابن حبان : ۱۰۳۔ مستدرک حاکم : 92/1، ح : ۱۰۳ و صححہ و وافقہ الذہبی ] ¤ حقیقت یہ ہے کہ جنت اور جہنم کے جو اوصاف قرآن و حدیث میں جس طرح مذکور ہیں اسی طرح ان پر ایمان رکھنا ضروری ہے، خواہ ہماری عقل و ذہن کی رسائی ان تک نہ ہو اور یہی نہیں، آخرت کے تمام معاملات کا یہی حال ہے۔"
    },
    {
      "Ayah": 134,
      "tafsir": "(آیت 134) ➊ {الَّذِيْنَ يُنْفِقُوْنَ … :} ان آیات میں اہل جنت کی صفات کا ذکر ہے، چنانچہ ان کی پہلی صفت یہ ہے کہ خوش حالی اور تنگ دستی ہر حالت میں وہ اپنی استطاعت کے مطابق خرچ کرتے رہتے ہیں اور نیک کاموں اور رضائے الٰہی کے لیے مال صرف کرنے سے انھیں کوئی چیز غافل نہیں کرتی۔ (ابن کثیر) ¤ ➋ {وَ الْكٰظِمِيْنَ الْغَيْظَ:} ان کی دوسری صفت یہ ہے کہ وہ غصہ سے مغلوب ہونے کے بجائے اس پر قابو پا لیتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’پہلوان ہرگز وہ نہیں جو بہت زیادہ پچھاڑ دینے والا ہو، بلکہ پہلوان وہ ہے جو غصے کے وقت اپنے آپ پر قابو رکھے۔‘‘ [ بخاری، الأدب، باب الحذر من الغضب: ۶۱۱۴، عن أبی ہریرۃ رضی اللہ عنہ ] ¤ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی نے آپ صلی اللہ علیہ وسلم سے عرض کی : ’’مجھے وصیت فرمائیے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ تَغْضَبْ ] ’’غصہ مت کر۔‘‘اس نے کئی دفعہ درخواست دہرائی، آپ نے یہی فرمایا : [ لاَ تَغْضَبْ ] ’’غصہ مت کر۔‘‘ [ بخاری، الأدب، باب الحذر من الغضب : ۶۱۱۶۔ ترمذی : ۲۰۲۰ ] ¤ ➌ {وَ الْعَافِيْنَ عَنِ النَّاسِ:} یہ دراصل غصہ پی جانے کا لازمی تقاضا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’تین چیزوں پر میں قسم کھاتا ہوں، صدقہ سے مال کم نہیں ہوتا، اللہ تعالیٰ معاف کر دینے سے بندے کی عزت میں اضافہ ہی کرتا ہے اور جو اللہ کے لیے نیچا ہوتا ہے اللہ اسے اونچا کر دیتا ہے۔‘‘ [مسلم، البر والصلۃ، باب استحباب العفو : ۲۵۸۸۔ عن أبی ہریرۃ رضی اللہ عنہ۔ ترمذی: 2325 ] اور یہ احسان کا مقام ہے اور اللہ محسنین سے محبت رکھتا ہے۔"
    },
    {
      "Ayah": 135,
      "tafsir": "(آیت 135 ) ➊ {وَ الَّذِيْنَ اِذَا فَعَلُوْا فَاحِشَةً …:} یعنی اگر بشری تقاضے کے تحت ان سے کسی  گناہ کا ارتکاب ہو جاتا ہے تو وہ فوراً اللہ تعالیٰ کو یاد کر کے توبہ و استغفار کرتے ہیں اور اللہ تعالیٰ سے معافی چاہتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : ’’ایک آدمی نے گناہ کیا تو کہا : ’’اے میرے رب! میں نے ایک گناہ کیا ہے، تو مجھے وہ بخش دے۔‘‘ تو اللہ عزوجل نے فرمایا : ’’میرے بندے نے ایک گناہ کیا تو اس نے جان لیا کہ اس کا ایک رب ہے جو گناہ بخشتا ہے اور اس پر پکڑتا ہے، سو میں نے اپنے بندے کو بخش دیا۔‘‘ پھر اس نے ایک اور گناہ کیا اور کہا : ’’اے میرے رب! میں نے ایک اور گناہ کیا ہے، تو اسے بخش دے۔‘‘ تو اللہ تعالیٰ نے فرمایا : ’’میرے بندے نے جان لیا کہ اس کا ایک رب ہے جو گناہ بخشتا ہے اور اس پر پکڑتا ہے، (فرشتو! گواہ رہو کہ) میں نے اپنے بندے کو بخش دیا، پھر بندہ رکا رہا جتنا اللہ نے چاہا پھر اس نے ایک اور گناہ کیا تو کہا : ’’اے میرے رب! میں نے ایک اور گناہ کیا ہے، تو اسے بخش دے۔‘‘ تو اللہ تعالیٰ نے فرمایا : ’’میرے بندے نے جان لیا کہ اس کا ایک رب ہے جو گناہ بخشتا ہے اور اس پر پکڑتا ہے (فرشتو! گواہ رہو کہ) میں نے اپنے بندے کو بخش دیا، سو وہ جو چاہے کرے۔‘‘ [ بخاری، التوحید، باب قول اللہ تعالٰی : «یریدون أن یبدلوا کلام اللہ» : ۷۵۰۷۔ مسلم، التوبۃ، باب قبول التوبۃ… : ۲۷۵۸ ] ¤ ➋ {وَ لَمْ يُصِرُّوْا عَلٰى مَا فَعَلُوْا …:} اصرار کے معنی ہیں اڑ جانا اور بے پروائی سے گناہ کرتے جانا۔ نہ ان پر ندامت کا اظہار کرنا اور نہ توبہ کرنا۔ ورنہ اگر کسی شخص سے سچے دل سے توبہ کرنے کے بعد گناہ سرزد بھی ہو جاتا ہے تو اسے اصرار نہیں کہتے، جیسا کہ پچھلے فائدے میں گزرا ہے۔ {”وَ هُمْ يَعْلَمُوْنَ“} یعنی کسی کام کے گناہ ہونے کا علم ہونے پر اس پر اصرار نہیں کرتے۔ مزید دیکھیے سورۂ نساء (۱۷، ۱۸)۔"
    },
    {
      "Ayah": 136,
      "tafsir": "(آیت 136)اس آیت کی تفسیر کے لیے دیکھیے سورۂ بقرہ(۲۵) ۔"
    },
    {
      "Ayah": 137,
      "tafsir": "(آیت 137) {قَدْ خَلَتْ مِنْ قَبْلِكُمْ … :} اوپر کی آیات میں اللہ اور اس کے رسول کی اطاعت پر اور ان کی نافرمانی سے توبہ پر بخشش اور جنت کا وعدہ فرمایا، اب یہاں اطاعت اور توبہ کی ترغیب کے لیے پہلی امتوں کی تاریخ پر غور و فکر کا حکم دیا ہے، تاکہ ان میں سے مطیع اور نافرمان کے احوال پر غور کر کے انسان اپنے لیے سامانِ عبرت حاصل کرے۔ {’’ سُنَنٌ ‘‘} کا مفرد {’’سُنَّةٌ ‘‘} ہے، اس کے معنی طریق مستقیم اور اس نمونے کے ہیں جس کا اتباع کیا جاتا ہے۔ یہ {’’ فُعْلَةٌ ‘‘} بمعنی {’’ مَفْعُوْلَةٌ ‘‘} ہے۔ رسول اللہ صلی اللہ علیہ وسلم کا فعل چونکہ مسلمان کے لیے نمونہ اورطریق مستقیم ہوتا ہے، اس لیے اسے سنت کہتے ہیں۔ ¤ جنگ احد میں جب ستر مسلمان شہید اور کچھ زخمی ہوئے تو اس شکست سے مسلمانوں کو قدرتی طور پر بہت تکلیف ہوئی۔ ان آیات میں اللہ تعالیٰ نے تسلی دی کہ اس شکست سے افسردہ خاطر نہیں ہونا چاہیے کہ یہ بات تو پہلی امتوں اور انبیاء کے متبعین میں بھی ہوتی چلی آئی ہے کہ ابتدا میں ان کو تکا لیف سے دو چار ہونا پڑااور بالآخر جھٹلانے والے ذلیل و خوار ہوئے۔ (ابن کثیر)"
    },
    {
      "Ayah": 138,
      "tafsir": "(آیت 138) {هٰذَا بَيَانٌ لِّلنَّاسِ … :} یعنی قرآن میں اس کا واضح ثبوت موجود ہے کہ پہلی امتوں کا ان کے دشمنوں کے ساتھ مقابلے میں کیا حال ہوا۔ چنانچہ قرآن نے جا بجا متقین کے نیک انجام اور جھٹلانے والوں کی ہلاکت کا تذکرہ فرمایا ہے۔"
    },
    {
      "Ayah": 139,
      "tafsir": "(آیت 139) {وَ لَا تَهِنُوْا وَ لَا تَحْزَنُوْا … :} اوپر کی آیت { ”قَدْ خَلَتْ“ } اس بشارت کی تمہید تھی اور { ”وَ اَنْتُمُ الْاَعْلَوْنَ“ } کے لیے ایک طرح کی دلیل کہ پہلی امتوں کی تاریخ اس بات پر شاہد ہے کہ اہل باطل کو اگرچہ غلبہ حاصل ہوا مگر عارضی، آخر کار وہ تباہ و برباد ہو گئے۔ یہی حال تمھارا ہے، اس لیے کسی قسم کے { ”وَهْنٌ“ } (کمزوری) سے کام نہ لو، غم نہ کرو، اگر تم مومن ہو تو تمھی غالب رہو گے۔ چنانچہ اس کے بعد ہر لڑائی میں مسلمان غالب ہوتے رہے۔"
    },
    {
      "Ayah": 140,
      "tafsir": "(آیت 141،140) ➊ {اِنْ يَّمْسَسْكُمْ قَرْحٌ … :} یعنی اگر ’’ احد ‘‘ کے دن تمھیں مشرکین کے ہاتھوں نقصان پہنچا ہے تو تم بھی بدر کے دن انھیں اسی قسم کا نقصان پہنچا چکے ہو، اس لیے یہ زیادہ پریشانی کی بات نہیں۔ { ”اَلْحَرْبُ سِجَالٌ“} (لڑائی میں باریاں ہوتی ہیں) جب بھی دو گروہوں میں جنگ ہوئی ہے تو کبھی ایک کا پلڑا بھاری رہا ہے، کبھی دوسرے کا۔ ¤ ➋ {وَ تِلْكَ الْاَيَّامُ …:} جنگ احد میں مسلمانوں کو سخت جانی نقصان پہنچا۔ یہود اور منافقین کے طعنے مزید دل دکھانے کا باعث بنے۔ منافق کہتے تھے کہ اگر آپ ( صلی اللہ علیہ وسلم ) سچے نبی ہوتے تو مسلمان یہ نقصان اور ہزیمت کی ذلت کیوں اٹھاتے وغیرہ۔ ان آیات میں مسلمانوں کو تسلی دی گئی ہے کہ فتح و شکست تو ادلتی بدلتی چیز ہے، یہ حق اور نا حق کا معیار نہیں، آج اگر تم نے زخم کھایا ہے تو کل وہ جنگ بدر میں تمھارے ہاتھوں اسی قسم کا زخم کھا چکے ہیں اور خود اس جنگ کے شروع میں ان کے بہت سے آدمی مارے جا چکے ہیں، جیسا کہ اس آیت : «اِذْ تَحُسُّوْنَهُمْ بِاِذْنِهٖ » [ آل عمران : ۱۵۲ ] (جب تم انھیں اس کے حکم سے کاٹ رہے تھے) سے معلوم ہوتا ہے۔ تمھاری اس شکست میں بھی کئی حکمتیں پوشیدہ ہیں، ایک یہ کہ ایمان و اخلاص اور کفر و نفاق میں تمیز ہو گئی، مومن اور منافق الگ الگ ہو گئے، اگر ہمیشہ مسلمانوں کو فتح ہوتی تو منافقین کا نفاق ظاہر نہ ہوتا۔ دوسری مومنوں کو شہادت نصیب ہوئی، فرمایا : «وَ يَتَّخِذَ مِنْكُمْ شُهَدَآءَ» جو اللہ کے ہاں بہت بڑا شرف ہے۔ کفار کی اس عارضی فتح کا یہ مطلب نہیں کہ اللہ ظالموں اور مشرکوں کو پسند کرتا ہے، فرمایا : «وَ اللّٰهُ لَا يُحِبُّ الظّٰلِمِيْنَ» ’’اور اللہ ظالموں سے محبت نہیں کرتا۔‘‘ تیسری یہ کہ مومنوں کو خالص کرے، اگر ان میں کچھ کمی ہے تو دور کر دے، فرمایا : «وَ لِيُمَحِّصَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا» ’’اور تاکہ اللہ ان لوگوں کو خالص کر دے جو ایمان لائے‘‘ اور چوتھی یہ کہ کفار کی طاقت کو ختم کرنا مقصود ہے، «وَ يَمْحَقَ الْكٰفِرِيْنَ» اس طرح کہ وہ اپنی عارضی فتح پر مغرور ہو کر پھر لڑنے آئیں گے اور اس وقت ان کی وہ سرکوبی ہو گی کہ دوبارہ اس طرف رخ کرنے کا نام نہیں لیں گے۔ چنانچہ غزوۂ احزاب کے موقع پر ایسا ہی ہوا کہ اس کے بعد کفار نے دفاعی جنگیں تو لڑیں مگر خود حملے کی جرأت نہ کر سکے۔ (رازی، شوکانی)"
    },
    {
      "Ayah": 141,
      "tafsir": "(آیت 141،140) ➊ {اِنْ يَّمْسَسْكُمْ قَرْحٌ … :} یعنی اگر ’’ احد ‘‘ کے دن تمھیں مشرکین کے ہاتھوں نقصان پہنچا ہے تو تم بھی بدر کے دن انھیں اسی قسم کا نقصان پہنچا چکے ہو، اس لیے یہ زیادہ پریشانی کی بات نہیں۔ { ”اَلْحَرْبُ سِجَالٌ“} (لڑائی میں باریاں ہوتی ہیں) جب بھی دو گروہوں میں جنگ ہوئی ہے تو کبھی ایک کا پلڑا بھاری رہا ہے، کبھی دوسرے کا۔ ¤ ➋ {وَ تِلْكَ الْاَيَّامُ …:} جنگ احد میں مسلمانوں کو سخت جانی نقصان پہنچا۔ یہود اور منافقین کے طعنے مزید دل دکھانے کا باعث بنے۔ منافق کہتے تھے کہ اگر آپ ( صلی اللہ علیہ وسلم ) سچے نبی ہوتے تو مسلمان یہ نقصان اور ہزیمت کی ذلت کیوں اٹھاتے وغیرہ۔ ان آیات میں مسلمانوں کو تسلی دی گئی ہے کہ فتح و شکست تو ادلتی بدلتی چیز ہے، یہ حق اور نا حق کا معیار نہیں، آج اگر تم نے زخم کھایا ہے تو کل وہ جنگ بدر میں تمھارے ہاتھوں اسی قسم کا زخم کھا چکے ہیں اور خود اس جنگ کے شروع میں ان کے بہت سے آدمی مارے جا چکے ہیں، جیسا کہ اس آیت : «اِذْ تَحُسُّوْنَهُمْ بِاِذْنِهٖ » [ آل عمران : ۱۵۲ ] (جب تم انھیں اس کے حکم سے کاٹ رہے تھے) سے معلوم ہوتا ہے۔ تمھاری اس شکست میں بھی کئی حکمتیں پوشیدہ ہیں، ایک یہ کہ ایمان و اخلاص اور کفر و نفاق میں تمیز ہو گئی، مومن اور منافق الگ الگ ہو گئے، اگر ہمیشہ مسلمانوں کو فتح ہوتی تو منافقین کا نفاق ظاہر نہ ہوتا۔ دوسری مومنوں کو شہادت نصیب ہوئی، فرمایا : «وَ يَتَّخِذَ مِنْكُمْ شُهَدَآءَ» جو اللہ کے ہاں بہت بڑا شرف ہے۔ کفار کی اس عارضی فتح کا یہ مطلب نہیں کہ اللہ ظالموں اور مشرکوں کو پسند کرتا ہے، فرمایا : «وَ اللّٰهُ لَا يُحِبُّ الظّٰلِمِيْنَ» ’’اور اللہ ظالموں سے محبت نہیں کرتا۔‘‘ تیسری یہ کہ مومنوں کو خالص کرے، اگر ان میں کچھ کمی ہے تو دور کر دے، فرمایا : «وَ لِيُمَحِّصَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا» ’’اور تاکہ اللہ ان لوگوں کو خالص کر دے جو ایمان لائے‘‘ اور چوتھی یہ کہ کفار کی طاقت کو ختم کرنا مقصود ہے، «وَ يَمْحَقَ الْكٰفِرِيْنَ» اس طرح کہ وہ اپنی عارضی فتح پر مغرور ہو کر پھر لڑنے آئیں گے اور اس وقت ان کی وہ سرکوبی ہو گی کہ دوبارہ اس طرف رخ کرنے کا نام نہیں لیں گے۔ چنانچہ غزوۂ احزاب کے موقع پر ایسا ہی ہوا کہ اس کے بعد کفار نے دفاعی جنگیں تو لڑیں مگر خود حملے کی جرأت نہ کر سکے۔ (رازی، شوکانی)"
    },
    {
      "Ayah": 142,
      "tafsir": "(آیت 142) {وَ لَمَّا يَعْلَمِ اللّٰهُ الَّذِيْنَ جٰهَدُوْا …:} بعض سلف نے اس کا معنی کیا ہے ’’ابھی تک اللہ نے ظاہر نہیں کیا‘‘ ان کا کہنا ہے کہ اللہ تعالیٰ کو تو ماضی، حال اور مستقبل ہر بات کا علم ہے، اس لیے یہ ترجمہ کہ ’’ ابھی تک اللہ نے نہیں جانا‘‘ درست نہیں، مگر {’’عَلِمَ يَعْلَمُ ‘‘} کا معنی تو جاننا ہی ہوتا ہے، ظاہر کرنے کے لیے تو { ”لَمَّا يُظْهِرِ اللّٰهُ“ } یا اس سے ملتے جلتے الفاظ ہونے چاہییں۔ حقیقت یہ ہے کہ اللہ تعالیٰ کی صفات کی نوع ازلی ہے مگر ان کے افراد حادث ہوتے رہتے ہیں، مثلاً پیدا کرنا، سننا اور جاننا وغیرہ، جیسا کہ فرمایا : «كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ » [ الرحمٰن : ۲۹ ] ’’ہر دن وہ ایک نئی شان میں ہے۔‘‘ خالق تو وہ ازل سے ہے، مگر جب وہ کوئی چیز پیدا کرے گا تو اس چیز کی خلق اس وقت وجود میں آئے گی۔ اسی طرح آیت : «قَدْ سَمِعَ اللّٰهُ قَوْلَ الَّتِيْ تُجَادِلُكَ فِيْ زَوْجِهَا » [ المجادلۃ : ۱ ] ’’یقینا اللہ نے اس عورت کی بات سن لی جو تجھ سے اپنے خاوند کے بارے میں جھگڑ رہی تھی‘‘ اس عورت کے جھگڑے کے بعد ہی واقعاتی سماع وجود میں آیا، اسی طرح جہاد کرنے کا واقعاتی علم تو جہاد کے واقع ہونے کے بعد ہی ہو گا۔ مقصد یہ کہ ابھی تک اللہ تعالیٰ نے اس چیز کا وقوع میں آنا نہیں جانا کہ تم میں سے کس نے جہاد کیا ہے۔ {”وَ يَعْلَمَ الصّٰبِرِيْنَ“} میں میم {’’ لامِ كَيْ‘‘} کی وجہ سے منصوب ہے، جو یہاں محذوف ہے اس لیے ترجمہ کیا ہے ’’اور تاکہ وہ صبر کرنے والوں کو جان لے۔‘‘ خلاصہ یہ ہے کہ کیا تم سمجھتے ہو کہ ایسی آزمائش کے بغیر ہی تم کو جنت میں اعلیٰ مراتب مل جائیں گے؟ مطلب یہ کہ جب تک اس قسم کی آزمائشوں میں پورے نہیں اترو گے جنت میں اعلیٰ مراتب حاصل نہیں ہو سکتے۔"
    },
    {
      "Ayah": 143,
      "tafsir": "(آیت 143 ) {وَ لَقَدْ كُنْتُمْ تَمَنَّوْنَ الْمَوْتَ :} یہاں موت کا معنی جنگ یا شہادت ہے۔ ( بغوی) جن لوگوں کو جنگ بدر میں حاضری کا موقع نہیں ملا تھا وہ تمنا کیا کرتے تھے کہ دشمن سے مقابلے کا موقع ملے تو ہم بھی شہدائے بدر کا درجہ حاصل کر لیں، مگر جب جنگ احد میں موقع ملا تو دشمن کے اچانک حملے کی وجہ سے ثابت قدم نہ رہ سکے اور بعض بھاگ نکلے۔ اس آیت میں صحابہ کو مخاطب کر کے فرمایا کہ تمھاری تمنا کے مطابق اب یہ موقع آیا تو تمھیں چاہیے تھا کہ پوری جواں مردی سے دشمن کا مقابلہ کرتے اور پامردی کا ثبوت دیتے۔ عبد اللہ بن ابی اوفی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’ دشمن سے مڈبھیڑ کی تمنا نہ کیا کرو، بلکہ اللہ تعالیٰ سے عافیت مانگتے رہا کرو، ہاں، اگر دشمن سے مقابلہ ہو جائے تو پھر صبر کرو اور خوب جان لو کہ جنت تلواروں کے سائے تلے ہے۔‘‘ [ بخاری، الجہاد والسیر، باب لا تمنوا لقاء العدو : ۳۰۲۵ ]"
    },
    {
      "Ayah": 144,
      "tafsir": "(آیت 144) ➊ {وَ مَا مُحَمَّدٌ اِلَّا رَسُوْلٌ :} جنگ احد میں بعض صحابہ نے تو مرتبۂ شہادت حاصل کر لیا اور بعض میدان چھوڑ کر فرار ہونے لگے، رسول اللہ صلی اللہ علیہ وسلم بھی زخمی ہو گئے اور کسی شیطان نے آپ کی شہادت کی افواہ پھیلا دی، صحابہ کرام رضی اللہ عنہم کے دل اس افواہ سے ٹوٹ گئے اور وہ ہمت ہار بیٹھے اور منافقین نے طعن و تشنیع کے نشتر چبھونے شروع کر دیے کہ اگر محمد ( صلی اللہ علیہ وسلم ) اللہ تعالیٰ کے سچے نبی ہوتے تو قتل کیوں ہوتے؟! اس پر یہ آیات اتریں : «وَ مَا مُحَمَّدٌ اِلَّا رَسُوْلٌ » ’’نہیں ہے محمد مگر ایک رسول۔‘‘ اس میں قصرِ قلب ہے کہ محمد صلی اللہ علیہ وسلم کے متعلق تم نے جو سمجھا ہے کہ وہ اللہ تعالیٰ ہیں، یا اللہ تعالیٰ کے اختیارات کے مالک ہیں، ایسا نہیں، وہ محض اللہ کا پیغام پہنچانے والے ہیں۔ وہ قتل بھی ہو سکتے ہیں، فوت بھی ہو سکتے ہیں اور ان سے پہلے کئی رسول گزر چکے ہیں۔ کیا محمد رسول اللہ صلی اللہ علیہ وسلم کے قتل ہونے یا طبعی موت مر جانے سے تم اللہ کا دین چھوڑ بیٹھو گے؟ تمھیں چاہیے کہ اللہ کی راہ میں جہاد کرتے رہو۔ (ابن کثیر، قرطبی) شاہ عبد القادر رحمہ اللہ لکھتے ہیں :’’اور اشارتاً یہ بات ثابت ہوتی ہے کہ آپ صلی اللہ علیہ وسلم کی وفات پر بعض لوگ پھر جائیں گے۔ اسی طرح ہوا کہ بہت سے لوگ آپ صلی اللہ علیہ وسلم کے بعد مرتد ہوئے تو ابوبکر صدیق رضی اللہ عنہ نے ان کو پھر مسلمان کیا اور بعضوں کو مارا۔‘‘ (موضح) ¤ ➋ عائشہ رضی اللہ عنہا سے روایت ہے کہ (جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی تو) ابوبکر صدیق رضی اللہ عنہ اپنے گھر سے جو {’’ اَلسُّنْح ‘‘} میں تھا، گھوڑے پر تشریف لائے، وہ گھوڑے سے اتر کر مسجد میں آ گئے، لوگوں سے انھوں نے کوئی بات نہ کی، بلکہ سیدھے عائشہ( رضی اللہ عنہا ) کے ہاں چلے گئے اور رسول اللہ صلی اللہ علیہ وسلم کا قصد کیا، اس وقت آپ یمنی دھاری دار چادر سے ڈھانپے ہوئے تھے۔ انھوں نے آپ صلی اللہ علیہ وسلم کے چہرے سے کپڑا ہٹایا، پھر آپ پر جھک کر آپ کو بوسہ دیا، پھر رو پڑے اور کہنے لگے : ’’میرے ماں باپ آپ پر قربان ! اے اللہ کے نبی ! اللہ آپ پر دو موتیں جمع نہیں کرے گا، جو موت آپ پر لکھی گئی تھی، وہ آپ فوت ہو چکے۔‘‘ ابو سلمہ کہتے ہیں، مجھے ابن عباس رضی اللہ عنہما نے بتایا کہ ابو بکر رضی اللہ عنہ نکلے، عمر رضی اللہ عنہ لوگوں سے باتیں کر رہے تھے، تو فرمایا : ’’بیٹھ جا ؤ ۔‘‘ انھوں نے نہ مانا، پھر فرمایا : ’’بیٹھ جا ؤ ۔‘‘ وہ پھر بھی نہ مانے تو ابو بکر رضی اللہ عنہ نے خطبہ پڑھا، اب لوگ ان کی طرف متوجہ ہو گئے اور عمر رضی اللہ عنہ کو چھوڑ دیا۔ ابو بکر رضی اللہ عنہ نے فرمایا : ’’اما بعد ! تم میں سے جو محمدمد صلی اللہ علیہ وسلم کی عبادت کرتا تھا تو بے شک محمد صلی اللہ علیہ وسلم فوت ہو گئے ہیں اور جو اللہ کی عبادت کرتا تھا تو بے شک اللہ زندہ ہے، کبھی فوت نہیں ہو گا، اللہ تعالیٰ نے فرمایا ہے : «وَ مَا مُحَمَّدٌ اِلَّا رَسُوْلٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ » یہ مکمل آیت تلاوت کی۔ ابن عباس رضی اللہ عنہما فرماتے ہیں : ’’اللہ کی قسم ! ایسا معلوم ہو رہا تھا کہ لوگ جانتے ہی نہ تھے کہ اللہ تعالیٰ نے یہ آیت نازل فرمائی ہے، یہاں تک کہ ابو بکر صدیق رضی اللہ عنہ نے یہ آیت پڑھی تو لوگوں نے اسے ان سے لے لیا تو جسے سنو یہی آیت پڑھ رہا تھا۔‘‘ سعید بن مسیب سے روایت ہے کہ عمر رضی اللہ عنہ نے فرمایا : ’’اللہ کی قسم ! میں نے ابو بکر رضی اللہ عنہ سے جب اس آیت کی تلاوت سنی تو میں کھڑے کا کھڑا رہ گیا، میرے پا ؤ ں مجھے اٹھا نہیں رہے تھے، یہاں تک کہ میں گر گیا۔‘‘ [ بخاری، المغازی، باب مرض النبی صلی اللہ علیہ وسلم ووفاتہ : ۴۴۵۲، ۴۴۵۳، ۴۴۵۴ ]"
    },
    {
      "Ayah": 145,
      "tafsir": "(آیت 145) {وَ مَا كَانَ لِنَفْسٍ اَنْ تَمُوْتَ اِلَّا بِاِذْنِ اللّٰهِ …:} اس سے مقصود مسلمانوں کو جہاد پر ابھارنا اور ان کے ذہن میں یہ بات بٹھانا ہے کہ موت سے فرار کی راہ اختیار کرنے سے انسان موت کے پنجے سے نجات نہیں پا سکتا، اللہ تعالیٰ نے ہر شخص کی موت کا ایک وقت مقرر فرمایا ہے، جو آگے پیچھے نہیں ہو سکتا۔ {’’ اِلَّا بِاِذْنِ اللّٰهِ ‘‘} میں {’’ اِذْنٌ ‘‘} بمعنی علم ہے، یعنی ہر شخص کی موت کا وقت اللہ تعالیٰ کے علم میں ہے اور یہ بھی ہو سکتا ہے کہ {”اِذْنٌ“} بمعنی قضا و قدر ہو۔ الغرض! تمھیں چاہیے کہ موت سے بھاگنے کی فکر چھوڑ کر بے جگری سے اللہ تعالیٰ کی راہ میں جہاد کرو اور اس جہاد سے تمھارا مقصود آخرت کا ثواب ہونا چاہیے، ورنہ اگر تم صرف دنیا کا ثواب، شہرت اور مال غنیمت وغیرہ ہی چاہو گے تو تمھیں صرف وہی ملے گا اور وہ بھی اللہ تعالیٰ کی مشیت پر اور آخرت سے محروم رہو گے۔ یہاں ”{كِتٰبًا مُّؤَجَّلًا“ } سے مراد وہ کتاب ہے جو { ”آجَالٌ“ } (مقررہ اوقات) پرمشتمل ہے۔ بعض نے اس سے مراد لوح محفوظ لیا ہے۔ احادیث میں ہے : ’’اللہ تعالیٰ نے قلم سے فرمایا : [ اُكْتُبْ فَكَتَبَ مَا هُوَ كَائِنٌ ] ’’لکھ دے، تو قلم نے جو کچھ ہونے والا تھا، سب لکھ دیا۔‘‘ [ أحمد : 317/5، ح : ۲۲۷۷۳ وابن أبی عاصم عن عبادۃ بن الصامت رضی اللہ عنہ و سندہ حسن ] ¤ اس آیت میں اشارہ ہے کہ جنگ احد میں حاضر ہونے والے اپنی نیتوں کے اعتبار سے دو قسم کے تھے، بعض غنیمت کے طالب تھے اور بعض آخرت کے۔ یہ آیت گو خاص جہاد کے بارے میں نازل ہوئی ہے مگر حکم کے اعتبار سے عام ہے اور تمام اعمال کا مدار انسان کے ارادے اور نیت پر ہے۔ معلوم ہوا مقتول بھی موت کے مقررہ وقت پر مرتا ہے اور مقررہ وقت میں تبدیلی ناممکن ہے۔"
    },
    {
      "Ayah": 146,
      "tafsir": "(آیت 146تا148) { ”رِبِّيُّوْنَ“ } یہ {’’رِبِّيٌّ‘‘} کی جمع ہے، جو {”رَبَّانِيٌّ“} کا ہم معنی ہے۔ (کشاف) ایک معنی اور بھی اہل علم نے کیا ہے کہ یہ {’’رِبَّةٌ ‘‘} کی طرف منسوب ہے، جس کا معنی کثیر جماعت ہے، یعنی ان کے ہمراہ بہت سی جماعتیں تھیں۔ (قرطبی) ¤ {’’وَهْنٌ، ضُعْفٌ، اِسْتِكَانَةٌ ‘‘} یہ تینوں لفظ قریب المعنی ہیں، کمزوری کے معنی میں یہ بالترتیب واقع ہوتے ہیں۔ {’’وَهْنٌ ‘‘} دل سے ہمت ہارنا، ’’ضُعْفٌ‘‘ عام کمزوری اور {’’ اِسْتِكَانَةٌ ‘‘} دشمن کے سامنے عاجزی کا اظہار۔ ان تینوں آیتوں سے مقصود ان لوگوں پر عتاب اور تنبیہ ہے جو احد کے دن شکست کے آثار دیکھ کر ہمت ہار بیٹھے اور رسول اللہ صلی اللہ علیہ وسلم کی شہادت کی افواہ سن کر بالکل ہی پست ہو گئے، پس فرمایا کہ تم سے پہلے انبیاء کے متبعین گزر چکے ہیں، ان کا اتباع کرو اور اس قسم کی کمزوری نہ دکھاؤ ۔ (قرطبی، ابن کثیر) ¤ یعنی ان لوگوں میں سے بہت سے {’’رِبِّيُّوْنَ ‘‘} اپنے انبیاء کے ساتھ مل کر جہاد کرتے رہے، لیکن انھوں نے اپنی تعداد کی قلت اوربے سروسامانی کے باوجود کبھی ہمت نہیں ہاری اور نہ کبھی اپنے انبیاء کے وفات پا جانے یا شہید ہو جانے کی صورت میں وسوسوں میں مبتلا ہوئے، بلکہ ہمیشہ اور ہر حال میں صبر و استقلال سے کام لیتے رہے اور اللہ تعالیٰ سے اپنی کوتاہیوں پر عفو و درگزر کی درخواست کرتے رہے، اس کا نتیجہ یہ ہوا کہ اللہ تعالیٰ نے انھیں دنیا و آخرت دونوں کے ثواب سے نواز دیا، بلکہ آخرت کے حسن ثواب سے اور احسان کا مرتبہ پا لینے کی وجہ سے اپنی محبت بھی عطا فرمائی، فرمایا: «وَ اللّٰهُ يُحِبُّ الْمُحْسِنِيْنَ»"
    },
    {
      "Ayah": 147,
      "tafsir": "(آیت 146تا148) { ”رِبِّيُّوْنَ“ } یہ {’’رِبِّيٌّ‘‘} کی جمع ہے، جو {”رَبَّانِيٌّ“} کا ہم معنی ہے۔ (کشاف) ایک معنی اور بھی اہل علم نے کیا ہے کہ یہ {’’رِبَّةٌ ‘‘} کی طرف منسوب ہے، جس کا معنی کثیر جماعت ہے، یعنی ان کے ہمراہ بہت سی جماعتیں تھیں۔ (قرطبی) ¤ {’’وَهْنٌ، ضُعْفٌ، اِسْتِكَانَةٌ ‘‘} یہ تینوں لفظ قریب المعنی ہیں، کمزوری کے معنی میں یہ بالترتیب واقع ہوتے ہیں۔ {’’وَهْنٌ ‘‘} دل سے ہمت ہارنا، ’’ضُعْفٌ‘‘ عام کمزوری اور {’’ اِسْتِكَانَةٌ ‘‘} دشمن کے سامنے عاجزی کا اظہار۔ ان تینوں آیتوں سے مقصود ان لوگوں پر عتاب اور تنبیہ ہے جو احد کے دن شکست کے آثار دیکھ کر ہمت ہار بیٹھے اور رسول اللہ صلی اللہ علیہ وسلم کی شہادت کی افواہ سن کر بالکل ہی پست ہو گئے، پس فرمایا کہ تم سے پہلے انبیاء کے متبعین گزر چکے ہیں، ان کا اتباع کرو اور اس قسم کی کمزوری نہ دکھاؤ ۔ (قرطبی، ابن کثیر) ¤ یعنی ان لوگوں میں سے بہت سے {’’رِبِّيُّوْنَ ‘‘} اپنے انبیاء کے ساتھ مل کر جہاد کرتے رہے، لیکن انھوں نے اپنی تعداد کی قلت اوربے سروسامانی کے باوجود کبھی ہمت نہیں ہاری اور نہ کبھی اپنے انبیاء کے وفات پا جانے یا شہید ہو جانے کی صورت میں وسوسوں میں مبتلا ہوئے، بلکہ ہمیشہ اور ہر حال میں صبر و استقلال سے کام لیتے رہے اور اللہ تعالیٰ سے اپنی کوتاہیوں پر عفو و درگزر کی درخواست کرتے رہے، اس کا نتیجہ یہ ہوا کہ اللہ تعالیٰ نے انھیں دنیا و آخرت دونوں کے ثواب سے نواز دیا، بلکہ آخرت کے حسن ثواب سے اور احسان کا مرتبہ پا لینے کی وجہ سے اپنی محبت بھی عطا فرمائی، فرمایا: «وَ اللّٰهُ يُحِبُّ الْمُحْسِنِيْنَ»"
    },
    {
      "Ayah": 148,
      "tafsir": "(آیت 146تا148) { ”رِبِّيُّوْنَ“ } یہ {’’رِبِّيٌّ‘‘} کی جمع ہے، جو {”رَبَّانِيٌّ“} کا ہم معنی ہے۔ (کشاف) ایک معنی اور بھی اہل علم نے کیا ہے کہ یہ {’’رِبَّةٌ ‘‘} کی طرف منسوب ہے، جس کا معنی کثیر جماعت ہے، یعنی ان کے ہمراہ بہت سی جماعتیں تھیں۔ (قرطبی) ¤ {’’وَهْنٌ، ضُعْفٌ، اِسْتِكَانَةٌ ‘‘} یہ تینوں لفظ قریب المعنی ہیں، کمزوری کے معنی میں یہ بالترتیب واقع ہوتے ہیں۔ {’’وَهْنٌ ‘‘} دل سے ہمت ہارنا، ’’ضُعْفٌ‘‘ عام کمزوری اور {’’ اِسْتِكَانَةٌ ‘‘} دشمن کے سامنے عاجزی کا اظہار۔ ان تینوں آیتوں سے مقصود ان لوگوں پر عتاب اور تنبیہ ہے جو احد کے دن شکست کے آثار دیکھ کر ہمت ہار بیٹھے اور رسول اللہ صلی اللہ علیہ وسلم کی شہادت کی افواہ سن کر بالکل ہی پست ہو گئے، پس فرمایا کہ تم سے پہلے انبیاء کے متبعین گزر چکے ہیں، ان کا اتباع کرو اور اس قسم کی کمزوری نہ دکھاؤ ۔ (قرطبی، ابن کثیر) ¤ یعنی ان لوگوں میں سے بہت سے {’’رِبِّيُّوْنَ ‘‘} اپنے انبیاء کے ساتھ مل کر جہاد کرتے رہے، لیکن انھوں نے اپنی تعداد کی قلت اوربے سروسامانی کے باوجود کبھی ہمت نہیں ہاری اور نہ کبھی اپنے انبیاء کے وفات پا جانے یا شہید ہو جانے کی صورت میں وسوسوں میں مبتلا ہوئے، بلکہ ہمیشہ اور ہر حال میں صبر و استقلال سے کام لیتے رہے اور اللہ تعالیٰ سے اپنی کوتاہیوں پر عفو و درگزر کی درخواست کرتے رہے، اس کا نتیجہ یہ ہوا کہ اللہ تعالیٰ نے انھیں دنیا و آخرت دونوں کے ثواب سے نواز دیا، بلکہ آخرت کے حسن ثواب سے اور احسان کا مرتبہ پا لینے کی وجہ سے اپنی محبت بھی عطا فرمائی، فرمایا: «وَ اللّٰهُ يُحِبُّ الْمُحْسِنِيْنَ»"
    },
    {
      "Ayah": 149,
      "tafsir": "(آیت 149) {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنْ تُطِيْعُوا الَّذِيْنَ كَفَرُوْا:} احد کی عارضی سی شکست کے بعد کفار نے جن میں منافقین، یہود و نصاریٰ اور مشرکین سبھی شامل تھے، مسلمانوں کے دلوں میں مختلف قسم کے شکوک و شبہات پیدا کر کے انھیں اسلام سے برگشتہ کرنے کی کوشش کی، اس پر اللہ تعالیٰ نے مسلمانوں کو متنبہ کیا کہ کفار کے فریب میں مت آنا، ورنہ تم خسارے میں پڑ جا ؤ گے۔ یہ آیت بھی پچھلی آیت کے مضمون کو مکمل کر رہی ہے۔ یاد رہے کہ دنیا میں سب سے بڑا خسارا یہ ہے کہ کوئی انسان اپنے دشمن کے سامنے ہتھیار ڈال دے اور آخرت کا خسارا ثواب سے محرومی اور عذاب میں گرفتاری ہے۔ پس خسارہ عام ہے۔"
    },
    {
      "Ayah": 150,
      "tafsir": "(آیت 150) {بَلِ اللّٰهُ مَوْلٰىكُمْ … :} مولیٰ کا معنی مالک، مدد گار اور دوست وغیرہ ہے، یعنی تم کفار کی اطاعت تو اس لیے کرو گے کہ وہ تمھاری کچھ مدد کریں، مگر یہ سراسر جہالت ہے، تمھارا مالک، حامی و ناصر تو اللہ تعالیٰ ہے، اس پر بھروسا رکھو گے تو دنیا کی کوئی طاقت تمھارا بال بیکا نہیں کر سکتی۔ یاد رہے کہ اللہ تعالیٰ کے لیے {”خَيْرُ النّٰصِرِيْنَ“} محاورۂ کلام کے اعتبار سے ہے، ورنہ یہ معنی نہیں ہیں کہ کچھ اور ناصرین بھی ہیں جن میں سے اللہ تعالیٰ سب سے بہتر ہے۔ (کبیر)"
    },
    {
      "Ayah": 151,
      "tafsir": "(آیت 151) ➊ { سَنُلْقِيْ …:} یہ آیت اپنے سیاق کے اعتبار سے اوپر کے بیان کو مکمل کر رہی ہے، اس آیت میں اللہ تعالیٰ نے مختلف وجوہ سے جہاد کی ترغیب دی ہے اور کفار کے خوف کو دلوں سے نکالا ہے۔ یہاں فرمایا ہے کہ اگر تم اللہ تعالیٰ پر بھروسا رکھو گے اور اسی سے مدد مانگو گے تو اللہ تعالیٰ کفار کے دلوں میں تمھارا خوفف ڈال دے گا، اس طرح تمھیں ان پر غلبہ حاصل ہو جائے گا، کیونکہ وہ اللہ کے ساتھ دوسروں کو شریک ٹھہراتے ہیں، لہٰذا {”بِمَاۤ اَشْرَكُوْا“} میں باء برائے سببیت ہے۔ (قرطبی) ¤ ➋ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’مشرک اللہ تعالیٰ کے چور ہیں اور چور کے دل میں ڈر ہوتا ہے۔‘‘ (موضح) چنانچہ اللہ تعالیٰ کا یہ وعدہ سچا ہوا اور کافر احد میں باوجود غالب ہونے کے چپکے سے میدان چھوڑ کر بھاگ گئے۔ سیرت کی کتابوں میں مذکور ہے کہ واپسی کے وقت راستے میں انھوں نے دوبارہ مدینہ پر حملے کا ارادہ کیا مگر مرعوب ہو گئے۔ بخاری و مسلم میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’پانچ چیزوں میں مجھے پہلے انبیاء پر فضیلت دی گئی ہے، ان میں سے ایک یہ ہے کہ ایک ماہ کی مسافت پر دشمن کے دل میں میرا رعب ڈال کر میری مدد کی گئی ہے۔‘‘ [ بخاری، التیمم، بابٌ : ۳۳۵۔ مسلم : ۵۲۱، عن جابر بن عبد اللہ رضی اللہ عنھما ] اس حدیث سے معلوم ہوا کہ کفار کے دل میں رعب ڈالنے کا وعدہ احد کے ساتھ خاص نہیں بلکہ عام ہے۔ ¤ ➌ اس آیت سے یہ بھی معلوم ہوا کہ آپ صلی اللہ علیہ وسلم کے ساتھ آپ کی امت، یعنی مسلمانوں کا رعب بھی مشرکوں پر ڈال دیا گیا ہے اور اس کی وجہ ان کا شرک ہے، گویا شرک کرنے والوں کا دل دوسروں کی ہیبت سے ڈرتا اور لرزتا رہتا ہے۔ یہی وجہ ہے کہ جب مسلمانوں کی بڑی تعداد مشرکانہ عقائد و اعمال میں گرفتار ہوئی، تقریباً ہر شہر اور محلہ میں پختہ قبریں اور غیر اللہ کے آستانے بن گئے اور غیر اللہ سے استغاثہ اور مدد مانگنا شروع ہو گئے، تو وہی رعب جو شرک کی وجہ سے کفار کے دل میں تھا، ڈیڑھ ارب کے قریب تعداد ہونے کے باوجود مسلمانوں کے دلوں میں پڑ گیا۔ ہاں، توحید والے اس رعب سے محفوظ ہیں اور قیامت تک کفار سے جہاد جاری رکھیں گے اور ان کا رعب کفار کے دلوں میں کفار کے مشرکانہ عقائد و اعمال کی وجہ سے رہے گا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَنْ يَّبْرَحَ هٰذَا الدِّيْنُ قَائِمًا يُقَاتِلُ عَلَيْهِ عِصَابَةٌ مِّنَ الْمُسْلِمِيْنَ حَتّٰي تَقُوْمَ السَّاعَةُ ] [ مسلم، الأمارۃ، باب قولہ صلی اللہ علیہ وسلم : لا تزال طائفۃ من أمتی… : ۱۹۲۲، عن جابر بن سمرۃ رضی اللہ عنہ ]’’یہ دین ہمیشہ قائم رہے گا، مسلمانوں کی ایک جماعت اس پر لڑتی رہے گی، حتیٰ کہ قیامت قائم ہو۔‘‘"
    },
    {
      "Ayah": 152,
      "tafsir": "(آیت 152) ➊ {وَ لَقَدْ صَدَقَكُمُ اللّٰهُ وَعْدَهٗۤ …:} جنگ احد میں پہلے پہل اللہ تعالیٰ کی مدد مسلمانوں کے شامل حال رہی اور وہ مشرکین کو اللہ کے حکم سے خوب کاٹتے رہے، حتیٰ کہ جب فتح کے آثار نظر آنے لگے اور مشرکین اور ان کی عورتوں نے بھاگنا شروع کر دیا تو پچاس تیر انداز، جنھیں آپ صلی اللہ علیہ وسلم نے عبد اللہ بن جبیر رضی اللہ عنہ کی سرکردگی میں ایک پہاڑی پر متعین کیا تھا، تاکہ ادھر سے مشرک حملہ آور نہ ہوں، انھوں نے مال غنیمت دیکھ کر باہم جھگڑنا شروع کر دیا۔ پچاس آدمیوں میں سے اکثر آپ صلی اللہ علیہ وسلم کے حکم کی نافرمانی کر کے اپنی جگہ چھوڑکر مال غنیمت کی طرف دوڑ پڑے، اس سبب سے مشرکین کو عقب سے حملہ کرنے کا موقع مل گیا اور مسلمانوں کو بہت بڑا نقصان اٹھانا پڑا۔ اس آیت میں اسی واقعہ کی طرف اشارہ ہے۔ (ابن کثیر) ¤ جنگ کے بعد جب آپ صلی اللہ علیہ وسلم مدینہ واپس آئے تو بعض لوگ کہنے لگے کہ یہ مصیبت ہم پر کیسے آگئی، حالانکہ اللہ تعالیٰ نے نصرت کا وعدہ فرمایا تھا، اس پر یہ آیت نازل ہوئی کہ اللہ تعالیٰ نے تو اپنا وعدہ پورا کر دیا تھا، پھر جو کچھ ہوا یہ تمھارے ہمت ہارنے اور آپس میں جھگڑنے اور تمھاری نافرمانی کا نتیجہ تھا۔ (قرطبی) ¤ ➋ {ثُمَّ صَرَفَكُمْ …:} یعنی غلبہ کے بعد ان کے مقابلہ میں تمھیں پسپائی دلائی، تاکہ تمھاری آزمائش ہو کہ کون سچا مسلمان ہے اور کون کمزور ایمان والا اور جھوٹا۔ (قرطبی) ¤ ➌ {وَ لَقَدْ عَفَا عَنْكُمْ:} یعنی گو تم نے رسول اللہ صلی اللہ علیہ وسلم کی نافرمانی اور جنگ سے فرار کی راہ اختیار کر کے نہایت سنگین جرم کا ارتکاب کیا تھا، جس کی تمھیں سخت سزا دی جا سکتی تھی، لیکن اللہ تعالیٰ نے تمھارا سارا قصور معاف فرما دیا۔ اس میں صحابہ کرام رضی اللہ عنہم کے اس شرف کا اظہار ہے جو ان کی کوتاہیوں کے باوجود اللہ تعالیٰ نے ان پر فرمایا، یعنی ان کی غلطیوں کی وضاحت کر کے، تاکہ آئندہ ان کا اعادہ نہ کریں۔ جب اللہ تعالیٰ نے ان کے لیے معافی کا عام اعلان فرما دیا تو اب کسی کے لیے ان پر طعن و تشنیع کی کیا گنجائش رہ گئی۔ صحیح بخاری میں مذکور ہے کہ ایک شخص نے ابن عمر رضی اللہ عنہما کے پاس عثمان رضی اللہ عنہ پر بعض اعتراضات کیے، ایک ان میں سے یہ تھا کہ وہ احد کے دن فرار ہو گئے تھے، تو ابن عمر رضی اللہ عنہما نے فرمایا : ’’میں شہادت دیتا ہوں کہ اللہ تعالیٰ نے انھیں معاف فرما دیا۔‘‘ [ بخاری، المغازی، باب قول اللہ تعالٰی : «إن الذین تولوا منکم…» : ۴۰۶۶ ]"
    },
    {
      "Ayah": 153,
      "tafsir": "(آیت 153) ➊ {اِذْ تُصْعِدُوْنَ … :} یہ بھاگتے ہوئے مسلمانوں کی کیفیت کا ذکر ہے کہ رسول اللہ صلی اللہ علیہ وسلم تمھاری پچھلی جماعت میں، جو ثابت قدم رہی تھی، تمھیں پکار رہے تھے کہ اے اللہ کے بندو ! میری طرف آ ؤ ، میں یہاں ہوں، مگر تم دور دوڑے جا رہے تھے اور کسی کو نہ مڑ کر دیکھتے تھے، نہ کسی کی سنتے تھے۔ ¤ ➋ {فَاَثَابَكُمْ غَمًّۢا بِغَمٍّ:} یعنی تمھاری کوتاہی کے بدلے میں تمھیں غم پر غم پہنچایا، ایک شکست کا غم اور دوسرا رسول اللہ صلی اللہ علیہ وسلم کی شہادت کی افواہ کا صدمہ، جو پہلے غم سے زیادہ سخت تھا، پس {”بِغَمٍّ“} کے معنی {’’عَلٰي غَمٍّ ‘‘} ہیں اور بعض نے باء کو سببیت کے لیے مانا ہے، یعنی آپ صلی اللہ علیہ وسلم کو مغموم کرنے کی وجہ سے تمھیں غم پہنچایا، مگر پہلا معنی زیادہ صحیح ہے۔( ابن کثیر، شوکانی) ¤ ➌ {لِّكَيْلَا تَحْزَنُوْا … :} یعنی تمھیں دوہرے غم میں مبتلا کر دیا، تاکہ نہ تو تمھیں مال غنیمت کے ہاتھ سے نکل جانے کا غم ہو اور نہ زخمی و شہید ہونے اور شکست کا غم ہو، کیونکہ متواتر غم خصوصاً بڑے غم کے آنے کے ساتھ پہلے غم ہلکے ہو جاتے ہیں اور انسان سختیاں برداشت کرنے کا عادی ہو جاتا ہے۔"
    },
    {
      "Ayah": 154,
      "tafsir": "(آیت 154 ) ➊ {ثُمَّ اَنْزَلَ عَلَيْكُمْ … :} ان پے درپے صدموں کے بعد اللہ تعالیٰ نے میدان جنگ ممیں موجود مسلمانوں پر اپنا خاص فضل فرمایا کہ ان پر اونگھ مسلط کر دی، جس سے انھیں امن و اطمینان حاصل ہو گیا۔ ابو طلحہ رضی اللہ عنہ بیان کرتے ہیں : ’’ہم پر اونگھ چھا گئی، جب کہ ہم احد کے دن اپنی صفوں میں کھڑے تھے، حالت یہ تھی کہ میری تلوار میرے ہاتھ سے گر جاتی تھی، میں اسے اٹھا لیتا تھا، وہ پھر گر جاتی تھی اور میں اسے پھر اٹھا لیتا تھا۔‘‘ [ بخاری، التفسیر، باب قولہ : «أمنة نعاسًا» : ۴۵۶۲ ] ابو طلحہ رضی اللہ عنہ ہی بیان فرماتے ہیں : ’’میں نے احد کے دن اپنا سر بلند کیا اور لوگوں کو دیکھنے لگا تو( کیا دیکھتا ہوں کہ) ہر شخص اونگھ کی وجہ سے اپنے سر کو ڈھال کے نیچے جھکائے ہوئے ہے اور یہی اللہ تعالیٰ کے اس قول کا مطلب ہے : «ثُمَّ اَنْزَلَ عَلَيْكُمْ مِّنْۢ بَعْدِ الْغَمِّ اَمَنَةً نُّعَاسًا» [ ترمذی، أبواب التفسیر، باب ومن سورۃ آل عمران : ۳۰۰۷ ] ¤ ➋ {وَ طَآىِٕفَةٌ قَدْ اَهَمَّتْهُمْ اَنْفُسُهُمْ:} ظاہر ہے کہ اس سے مراد منافقین اور ضعیف ایمان والے مسلمان ہیں۔ ایسے حالات میں انھیں تو اپنی جانوں ہی کی فکر تھی۔ ¤ ➌ {يَظُنُّوْنَ بِاللّٰهِ غَيْرَ الْحَقِّ ظَنَّ الْجَاهِلِيَّةِ …:} { ”ظَنَّ الْجَاهِلِيَّةِ“ } یہ { ”غَيْرَ الْحَقِّ“ } سے بدل ہے، یعنی وہ یہ گمان کر رہے تھے کہ دین اسلام اور اس کے حاملین بس اب ہلاک ہو گئے، مسلمانوں کی کبھی مدد نہیں ہو گی اور یہ دعوت حق پروان نہیں چڑھے گی۔ ¤ ➍ {يَقُوْلُوْنَ لَوْ كَانَ لَنَا مِنَ الْاَمْرِ شَيْءٌ:} یہ جملہ { ”يَظُنُّوْنَ“ } سے بدل ہے اور { ”ممِنَ الْاَمْرِ“ } سے مراد فتح و نصرت ہے، یعنی بالکل مایوسی کا اظہار کرنے لگے اور یہ کہنا شروع کر دیا کہ ہمیں کبھی فتح بھی نصیب ہو گی اور کچھ ملے گا بھی ؟ یا { ”مِنَ الْاَمْرِ“ } سے مراد معاملے کا فیصلہ ہے کہ اس معاملے میں ہماری بات تو مانی ہی نہیں گئی، ہمیں مجبوراً ساتھ دینا پڑا، ورنہ ہم تو شہر سے باہر نکل کر لڑنے کے حق میں نہیں تھے۔ بعض نے یہ معنی کیے ہیں کہ ہم تو مجبور محض ہیں، ہمارا تو کچھ بھی اختیار نہیں۔ (فتح القدیر) ¤ ➎ {مَّا قُتِلْنَا هٰهُنَا :} مطلب یہ کہ اگر ہماری بات مان لی جاتی کہ شہر کے اندر رہ کر ہی جنگ لڑی جائے تو آج ہمارا یہ جانی نقصان نہ ہوتا، مگر ہماری کسی نے نہ سنی۔ یہ بات یا تو ان منافقین نے کہی جو جنگ میں شریک تھے، جیسا کہ زبیر رضی اللہ عنہ فرماتے ہیں : ’’اللہ کی قسم! میں معتب بن قُشَیر، جو بنو عمرو بن عوف سے تھا، اس کی بات سن رہا تھا، جب کہ اونگھ مجھے ڈھانپ رہی تھی، میں خواب کی طرح اس کی بات سن رہا تھا، جب وہ کہہ رہا تھا، اگر اس معاملے میں ہمارا کچھ اختیار ہوتا تو ہم یہاں قتل نہ کیے جاتے۔‘‘ [ المختارۃ، ح : ۸۶۴، ۸۶۵ ] اسے ابن ابی حاتم نے اپنی تفسیر میں بھی حسن سند کے ساتھ ذکر کیا ہے۔ ¤ یہ بھی ہو سکتا ہے کہ یہ بات ان منافقین نے کہی ہو جو عبد اللہ بن ابی کے ساتھ مدینہ لوٹ آئے تھے، اس صورت میں {”هٰهُنَا“} ( یہاں) کا اشارہ مدینہ کے قریب احد کی طرف ہو گا۔ (قرطبی، شوکانی) ¤ ➏ {قُلْ لَّوْ كُنْتُمْ فِيْ بُيُوْتِكُمْ …:} اس سے ان کے خیال کی تردید مقصود ہے، یعنی اگر تم اپنے گھروں میں بیٹھے رہتے تب بھی جن لوگوں کی قسمت میں قتل ہونا لکھا جا چکا تھا وہ ضرور اپنے گھروں سے نکلتے اور جہاں اب مارے گئے ہیں، وہیں مارے جاتے، کیونکہ اللہ کی تقدیر سے بھاگنے کا کوئی راستہ نہیں ہے۔ ¤ ➐ {وَ لِيَبْتَلِيَ اللّٰهُ مَا فِيْ صُدُوْرِكُمْ … :} یہ جملہ محذوف کی علت ہے، یعنی جنگ احد میں جو کچھ ہوا اور جن حالات سے مسلمان دوچار ہوئے، اس سے کئی اور حکمتوں کے ساتھ مقصود یہ بھی تھا کہ تمھارے دلوں کی حالت ظاہر ہو جائے اور تمھارے دل و ساوس سے پاک ہو جائیں، یا یہ کہ منافقین کے دلوں کا نفاق باہر نکل آئے، چنانچہ ایسا ہی ہوا اور احد کی لڑائی بگڑنے سے سارا بھانڈا پھوٹ گیا۔"
    },
    {
      "Ayah": 155,
      "tafsir": "(آیت 155) ➊ {اِنَّ الَّذِيْنَ تَوَلَّوْا … :} یعنی احد کے دن جو مسلمان میدان جنگ سے ہٹ گئے، وہ شیطان کے پھسلانے کے سبب ہٹے، مگر شیطان کو انھیں پھسلانے کا موقع انھی کے کچھ گزشتہ گناہوں کی وجہ سے ملا۔ جن میں سے بعض کا ایک گناہ یہ بھی تھا کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے حکم کی مخالفت کی تھی۔ سلف سے مروی ہے کہ ایک نیک کام کرنے سے دوسرے نیک کام کی توفیق ملتی ہے اور ایک گناہ دوسرے گناہ کے ارتکاب کا سبب بنتا ہے۔ (ابن کثیر) مقصد یہ کہ بعض مخلص مسلمان جو اس دن بھاگ کھڑے ہوئے وہ اس وجہ سے نہیں بھاگے کہ وہ اسلام سے پھر گئے تھے، یا منافق تھے، بلکہ شامت نفس اور سیئات اعمال کی وجہ سے شیطان کو انھیں بہکانے کا موقع ملا۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم اپنے خطبہ میں فرمایا کرتے تھے : [وَ نَعُوْذُ بِاللّٰهِ مِنْ شُرُوْرِ أَنْفُسِنَا وَ مِنْ سَيِّئَاتِ أَعْمَالِننَا ] ’’ہم اپنے نفس کے شر اور اپنے اعمال کی برائیوں سے اللہ کی پناہ چاہتے ہیں۔‘‘ [ ابن ماجہ، النکاح، باب خطبۃ النکاح : ۱۸۹۲، وصححہ الألبانی ] یہ بھی معلوم ہوا کہ نفس کا شر ہو یا اعمال کی شامت، ان کے ساتھ شیطان کا گمراہ کرنا بھی شامل ہوتا ہے۔ ¤ ➋ {وَلَقَدْ عَفَا اللّٰهُ عَنْهُمْ:} اس سے تین آیات پہلے بھی {”وَ لَقَدْ عَفَا عَنْكُمْ“} کہہ کر ان کی معافی کی نوید سنائی گئی ہے۔ اب پھر مزید اطمینان اور تسلی کے لیے دوبارہ خوش خبری سنائی جا رہی ہے کہ بلاشبہ یقینا اللہ تعالیٰ نے انھیں معاف کر دیا ہے، یعنی جو واقعی دل میں اخلاص رکھتے تھے ان کی توبہ اور معذرت کے سبب اللہ تعالیٰ نے انھیں معاف کر دیا، اب نہ ان پر کوئی گناہ ہے اور نہ کسی کو طعن کا حق ہے۔ مزید تفصیل کے لیے دیکھیے آل عمران (۱۵۲) کے حواشی۔"
    },
    {
      "Ayah": 156,
      "tafsir": "(آیت 156) {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَكُوْنُوْا …:} {’’ غُزًّى ‘‘} یہ{’’ غَازٍ‘‘} کی جمع ہے، جو {’’ غَزَا يَغْزُوْ ‘‘} سے اسم فاعل ہے، بمعنی لڑنے والے، جیسے{ ’’ رَاكِعٌ ‘‘} کی جمع {’’ رُكَّعٌ ‘‘} آتی ہے۔ مسلمانوں کو تاکید فرمائی گئی ہے کہ تم ان لوگوں کی طرح نہ ہو جا ؤ جو اپنے نفاق کی وجہ سے کافر ہیں اور یہ گندہ عقیدہ صرف دل ہی میں نہیں رکھتے بلکہ برملا اس کا اظہار بھی کرتے ہیں کہ ہمارے جو بھائی جہاد کے سفر میں فوت ہو گئے یا لڑتے ہوئے مارے گئے، اگر ہمارے پاس رہتے تو نہ مرتے، نہ قتل ہوتے۔ ان کا یہ عقیدہ اور قول اللہ تعالیٰ ہمیشہ کے لیے ان کے دلوں میں حسرت و افسوس کا باعث بنائے رکھے گا۔ مسلمانوں کو اس عقیدہ سے اس لیے روکا کہ غلط ہونے کے ساتھ ساتھ یہ بزدلی کا باعث بنتا ہے، جب کہ موت و حیات تو اللہ کے ہاتھ میں ہے اور اس کا وقت مقرر ہے۔ یہی عقیدہ مسلمان کی قوت کا باعث ہے، اس لیے حکم دیا کہ دل مضبوط رکھو، موت اپنے وقت سے ایک لمحہ بھی پہلے نہیں آ سکتی۔ اگر مگر کے الفاظ شیطان کو دخل اندازی کا موقع دیتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’قوی مومن اللہ تعالیٰ کے نزدیک ضعیف سے بہتر اور زیادہ محبوب ہے اور ہر ایک میں کوئی نہ کوئی بھلائی ہے، اس چیز کی حرص کرو جو تمھیں نفع دے اور اللہ سے مدد مانگو اور عاجز مت ہو جا ؤ اور اگر تمھیں کوئی مصیبت پہنچے تو یہ مت کہو، اگر میں ایسا اور ایسا کرتا (تو مجھے یہ مصیبت نہ پہنچتی) بلکہ یوں کہو کہ اللہ نے جو مقدر کیا اور جو چاہا کر دیا، اس لیے کہ {”لَوْ“} (اگر کا لفظ) شیطان کے کام (کا راستہ) کھول دیتا ہے۔‘‘ [ مسلم، القدر ، باب الإیمان بالقدر والاذعان لہ : ۲۶۶۴، عن أبی ہریرۃ رضی اللہ عنہ ]"
    },
    {
      "Ayah": 157,
      "tafsir": "(آیت 157)یعنی اگر تمھارا مرنا یا قتل ہونا اللہ تعالیٰ کی راہ میں ہے تو یہ یقینا تمھارے لیے مغفرت اور رحمت کا سبب بنے گا اور یہ مغفرت و رحمت اس مال و متاع سے بہتر ہے جس کے جمع کرنے کی فکر میں یہ کفار اور منافقین ہر آن لگے رہتے ہیں، یہ ان کے شبہ کا دوسرا جواب ہے۔ { ”لَمَغْفِرَةٌ“ } اور {”وَ رَحْمَةٌ“} میں تنوین تقلیل کے لیے ہے، اس لیے ترجمہ ’’ تھوڑی سی بخشش اور رحمت‘‘ کیا گیا ہے۔"
    },
    {
      "Ayah": 158,
      "tafsir": "(آیت 158) {وَ لَىِٕنْ مُّتُّمْ اَوْ قُتِلْتُمْ … :} اوپر کی آیت میں خاص قسم کے قتل اور موت، یعنی فی سبیل اللہ کا ذکر تھا، جس پر رحمت و مغفرت کی خوش خبری تھی، اب یہاں عمومی موت اور قتل کا ذکر ہے ( جس طرح بھی واقع ہو) مطلب یہ کہ تمھیں مر کر بہر حال ہمارے پاس آنا اور اپنے اعمال کا اچھا یا برا بدلہ پانا ہے، اگر تمھاری زندگی اللہ کے کلمہ کو بلند کرنے کی خاطر ہو اور اسی کی راہ میں موت ہو تو تم اپنے اعمال کا خوش کن بدلہ پا ؤ گے۔"
    },
    {
      "Ayah": 159,
      "tafsir": "(آیت 160،159) ➊ {فَبِمَا رَحْمَةٍ مِّنَ اللّٰهِ:} یہاں جار مجرور { ”بِرَحْمَةٍ“ } پہلے آنے ہی سے تاکید پیدا ہو گئی تھی، پھر {’’مَا‘‘} لا کر {”فَبِمَا رَحْمَةٍ“} میں تاکید مزید ہو گئی۔ {’’ رَحْمَةٍ ‘‘} پر تنوین تعظیم کی ہے، اس لیے ترجمہ ’’بڑی رحمت‘‘ کیا ہے۔ ¤ ➋ {وَ لَوْ كُنْتَ فَظًّا غَلِيْظَ الْقَلْبِ … :} احد کے دن مسلمانوں نے خوف ناک غلطی کی اور میدان چھوڑ کر فرار اختیار کیا، پھر جب رسول اللہ صلی اللہ علیہ وسلم کی دعوت سے دوبارہ جمع ہوئے تو آپ نے ان کو کسی قسم کی سرزنش نہیں کی، بلکہ حسن اخلاق سے پیش آئے۔ اللہ تعالیٰ نے فرمایا کہ آپ کا یہ حسن خلق اور طبیعت کی نرمی اللہ تعالیٰ کے خاص فضل و احسان اور رحمت کا نتیجہ ہے، ورنہ مسلمانوں کا جمع ہونا ممکن نہ تھا۔ (قرطبی) معلوم ہوا دعوت دین کے لیے نرمی اور حسن اخلاق نہایت ضروری چیزیں ہیں، بدخلقی، درشتی اور سخت دلی سے لوگ کبھی قریب نہیں آ سکتے۔ ¤ ➌ {فَاعْفُ عَنْهُمْ … :} یعنی جنگ میں ان سے جو غلطیاں ہوئیں وہ انھیں معاف کر دیںں، اللہ سے بھی ان کے لیے استغفار کریں اور مشورے سے محروم نہ کریں بلکہ برابر مشورہ کرتے رہیں۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ شاید رسول اللہ صلی اللہ علیہ وسلم کا دل مسلمانوں سے خفا ہوا ہو گا اور چاہا ہو گا کہ اب ان سے مشورہ نہ پوچھیے، سو حق تعالیٰ نے تلقین فرمائی کہ اول مشورہ کر لینا بہتر ہے، جب ایک بات طے ہو جائے پھر پس و پیش نہ کرے۔‘‘ (موضح) اس آیت میں رسول اللہ صلی اللہ علیہ وسلم کو حکم دیا جا رہا ہے کہ جب کبھی جنگ یا انتظامی قسم کا کوئی ایسا معاملہ در پیش ہو، جس میں ہماری طرف سے بذریعۂ وحی کوئی متعین حکم نہ دیا جائے تو اپنے ساتھیوں سے مشورہ کر لیا کرو، تاکہ ان کی دل جوئی ہو اور انھیں بعد میں باہمی مشورہ سے مل کر کام کرنے کی تربیت بھی حاصل ہو۔ چنانچہ آپ صلی اللہ علیہ وسلم نے اکثر اہم امور میں صحابہ کرام رضی اللہ عنہم سے مشورے فرمائے اور ان پر عمل بھی ہوا۔ (دیکھیے ابن کثیر زیر بحث آیت) اس کے بعد خلفائے راشدین بھی اس سنت پر پوری طرح کار بند رہے۔ پھر اگر مشورے کے بعد کسی چیز کا فیصلہ کر لیا جائے تو اسے پوری دل جمعی سے کر گزرنے اور نتیجہ اللہ پر چھوڑ دینے کا نام توکل ہے۔ چنانچہ مذکور ہے کہ جنگ اُحد کے موقع پر کھلے میدان میں لڑائی کرنے کے فیصلے کے بعد جب آپ مسلح ہو کر تشریف لے آئے اور صحابہ کرام رضی اللہ عنہم نے اپنی غلطی کا احساس کرتے ہوئے آپ کی رائے کے مطابق شہر ہی میں رہ کر مقابلہ کرنے پر رضا مندی ظاہر کی تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ لِنَبِيٍّ اِذَا لَبِسَ لَأْمَتَهُ أَنْ يَّضَعَهَا حَتّٰي يُقَاتِلَ ] [ مسند أحمد : ۳؍۳۵۱، ح : ۱۴۷۹۹ ] ’’کسی نبی کے لائق نہیں کہ جب اپنا اسلحہ پہن لے تو لڑنے سے پہلے اسے اتار دے۔‘‘ یہ آیت اور آیت : «وَ اَمْرُهُمْ شُوْرٰى بَيْنَهُم» [ الشوریٰ : ۳۸ ] اسلامی طرزِ حکومت کے لیے بنیادی حیثیت کی حامل ہیں۔ چنانچہ نبی صلی اللہ علیہ وسلم اپنی زندگی میں صحابہ کرام رضی اللہ عنہم سے بہت سے معاملات میں مشورہ کرتے تھے۔ انس رضی اللہ عنہ بیان کرتے ہیں : ’’(جنگ بدر کے موقع پر) نبی صلی اللہ علیہ وسلم کو جب ابو سفیان کے آنے کی خبر ملی تو آپ نے مشورہ کیا۔ ابو بکر و عمر رضی اللہ عنہما نے بات کی تو آپ نے ان سے اعراض کیا۔ سعد بن عبادہ رضی اللہ عنہ نے کھڑے ہو کر کہا : ’’شاید آپ ہم ( انصار) سے پوچھنا چاہتے ہیں، اے اللہ کے رسول ! اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اگر آپ ہمیں حکم دیں کہ ہم گھوڑوں کو سمندر میں ڈال دیں تو ہم ضرور ڈال دیں گے اور اگر آپ حکم دیں کہ گھوڑوں کو برک الغماد (مدینہ سے بہت دور ایک جگہ) تک لے جائیں تو ہم ضرور لے جائیں گے۔‘‘ [ مسلم، الجہاد والسیر، باب غزوۃ بدر : ۱۷۷۹ ] جنگ خندق میں رسول اللہ صلی اللہ علیہ وسلم کے مشورہ کرنے پر سلمان فارسی رضی اللہ عنہ نے خندق کھودنے کی رائے دی جس پر رسول اللہ صلی اللہ علیہ وسلم نے عمل کیا اور اللہ تعالیٰ نے اس مشورے میں بہت برکت پیدا فرمائی۔ امام بخاری رحمہ اللہ فرماتے ہیں : ’’رسول اللہ صلی اللہ علیہ وسلم کے بعد خلفاء برابر دیانت دار اہل علم سے مشورہ لیتے رہے۔‘‘( قرطبی) ¤ آج کل بہت سے لوگ مشورے اور ووٹ کو ایک چیز سمجھتے ہیں اور جمہوریت کو اسلامی شوریٰ قرار دیتے ہیں، حالانکہ موجودہ جمہوریت اور اسلامی شوریٰ الگ الگ چیزیں ہیں، کیونکہ جمہوریت ایک مستقل دین ہے۔ اس میں : (1) ہر اہل اور نا اہل کا ووٹ برابر ہے۔ (2) اس میں عوام کی اکثریت فیصلہ کن ہے، فیصلوں میں انھی کو اللہ اور رسول کا مقام حاصل ہے، خواہ وہ سود کو حلال کر دیں، یا زنا اور قوم لوط کے عمل کو۔ اللہ اور اس کے رسول کی اطاعت کی کوئی شرط نہیں، اگر کہیں ہے بھی تو دھوکا دینے کے لیے۔ (3) اس میں فیصلہ اکثریت کے نمائندوں کی اکثریت کا ہوتا ہے، صدر اس فیصلے کا پابند ہے، خواہ اسے غلط سمجھتا ہو یا صحیح۔ (4) ان کے ہاں مشورے کا معنی اکثریت ہے۔ جب کہ اسلام میں: (1) امیر مشورہ لینے کا پابند ہے، مگر صرف ان امور میں جو قرآن و سنت میں مذکور نہ ہوں، بلکہ تدبیری اور انتظامی قسم کے ہوں۔ (2) امیر مشورہ ان لوگوں سے لے گا جو اس معاملے میں رائے کی اہلیت رکھتے ہیں۔ امام شوکانی رحمہ اللہ لکھتے ہیں : ’’حکمرانوں کے لیے ضروری ہے کہ وہ علماء سے ایسے معاملات میں مشورہ کریں جن کا انھیں علم نہیں ہے، یا ان کے بارے میں انھیں اشکال ہے، فوج کے سربراہوں سے فوجی معاملات میں، سربرآوردہ لوگوں سے عوام کے مصالح کے بارے میں اور ماتحت حکام و والیان سے ان کے علاقوں کی ضروریات و ترجیحات کے متعلق مشورہ کریں۔‘‘ (3) مشورے کے بعد آخری فیصلہ امیر کا ہو گا، فرمایا : «فَاِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللّٰهِ» [ آل عمران : ۱۵۹ ] اگر وہ مناسب سمجھے تو اکثریت کے فیصلے پر عمل کرے اور اگر کم لوگوں میں زیادہ اہلیت والے لوگ ہونے کی وجہ سے ان کی رائے کو بہتر سمجھے تو اس پر فیصلہ کرے، کیونکہ فیصلوں کے نتائج کا آخری ذمہ دار امیر ہو گا، اکثریت نہیں اور وہ بھی اللہ پر توکل کرتے ہوئے فیصلے پر عمل کرے گا، نہ کہ مشورہ دینے والوں کی یا اپنی عقل و فہم پر۔ اگلی آیت میں پھر اللہ تعالیٰ پر توکل کرنے کی تاکید ہے۔"
    },
    {
      "Ayah": 160,
      "tafsir": "(آیت 160،159) ➊ {فَبِمَا رَحْمَةٍ مِّنَ اللّٰهِ:} یہاں جار مجرور { ”بِرَحْمَةٍ“ } پہلے آنے ہی سے تاکید پیدا ہو گئی تھی، پھر {’’مَا‘‘} لا کر {”فَبِمَا رَحْمَةٍ“} میں تاکید مزید ہو گئی۔ {’’ رَحْمَةٍ ‘‘} پر تنوین تعظیم کی ہے، اس لیے ترجمہ ’’بڑی رحمت‘‘ کیا ہے۔ ¤ ➋ {وَ لَوْ كُنْتَ فَظًّا غَلِيْظَ الْقَلْبِ … :} احد کے دن مسلمانوں نے خوف ناک غلطی کی اور میدان چھوڑ کر فرار اختیار کیا، پھر جب رسول اللہ صلی اللہ علیہ وسلم کی دعوت سے دوبارہ جمع ہوئے تو آپ نے ان کو کسی قسم کی سرزنش نہیں کی، بلکہ حسن اخلاق سے پیش آئے۔ اللہ تعالیٰ نے فرمایا کہ آپ کا یہ حسن خلق اور طبیعت کی نرمی اللہ تعالیٰ کے خاص فضل و احسان اور رحمت کا نتیجہ ہے، ورنہ مسلمانوں کا جمع ہونا ممکن نہ تھا۔ (قرطبی) معلوم ہوا دعوت دین کے لیے نرمی اور حسن اخلاق نہایت ضروری چیزیں ہیں، بدخلقی، درشتی اور سخت دلی سے لوگ کبھی قریب نہیں آ سکتے۔ ¤ ➌ {فَاعْفُ عَنْهُمْ … :} یعنی جنگ میں ان سے جو غلطیاں ہوئیں وہ انھیں معاف کر دیںں، اللہ سے بھی ان کے لیے استغفار کریں اور مشورے سے محروم نہ کریں بلکہ برابر مشورہ کرتے رہیں۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’ شاید رسول اللہ صلی اللہ علیہ وسلم کا دل مسلمانوں سے خفا ہوا ہو گا اور چاہا ہو گا کہ اب ان سے مشورہ نہ پوچھیے، سو حق تعالیٰ نے تلقین فرمائی کہ اول مشورہ کر لینا بہتر ہے، جب ایک بات طے ہو جائے پھر پس و پیش نہ کرے۔‘‘ (موضح) اس آیت میں رسول اللہ صلی اللہ علیہ وسلم کو حکم دیا جا رہا ہے کہ جب کبھی جنگ یا انتظامی قسم کا کوئی ایسا معاملہ در پیش ہو، جس میں ہماری طرف سے بذریعۂ وحی کوئی متعین حکم نہ دیا جائے تو اپنے ساتھیوں سے مشورہ کر لیا کرو، تاکہ ان کی دل جوئی ہو اور انھیں بعد میں باہمی مشورہ سے مل کر کام کرنے کی تربیت بھی حاصل ہو۔ چنانچہ آپ صلی اللہ علیہ وسلم نے اکثر اہم امور میں صحابہ کرام رضی اللہ عنہم سے مشورے فرمائے اور ان پر عمل بھی ہوا۔ (دیکھیے ابن کثیر زیر بحث آیت) اس کے بعد خلفائے راشدین بھی اس سنت پر پوری طرح کار بند رہے۔ پھر اگر مشورے کے بعد کسی چیز کا فیصلہ کر لیا جائے تو اسے پوری دل جمعی سے کر گزرنے اور نتیجہ اللہ پر چھوڑ دینے کا نام توکل ہے۔ چنانچہ مذکور ہے کہ جنگ اُحد کے موقع پر کھلے میدان میں لڑائی کرنے کے فیصلے کے بعد جب آپ مسلح ہو کر تشریف لے آئے اور صحابہ کرام رضی اللہ عنہم نے اپنی غلطی کا احساس کرتے ہوئے آپ کی رائے کے مطابق شہر ہی میں رہ کر مقابلہ کرنے پر رضا مندی ظاہر کی تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ لِنَبِيٍّ اِذَا لَبِسَ لَأْمَتَهُ أَنْ يَّضَعَهَا حَتّٰي يُقَاتِلَ ] [ مسند أحمد : ۳؍۳۵۱، ح : ۱۴۷۹۹ ] ’’کسی نبی کے لائق نہیں کہ جب اپنا اسلحہ پہن لے تو لڑنے سے پہلے اسے اتار دے۔‘‘ یہ آیت اور آیت : «وَ اَمْرُهُمْ شُوْرٰى بَيْنَهُم» [ الشوریٰ : ۳۸ ] اسلامی طرزِ حکومت کے لیے بنیادی حیثیت کی حامل ہیں۔ چنانچہ نبی صلی اللہ علیہ وسلم اپنی زندگی میں صحابہ کرام رضی اللہ عنہم سے بہت سے معاملات میں مشورہ کرتے تھے۔ انس رضی اللہ عنہ بیان کرتے ہیں : ’’(جنگ بدر کے موقع پر) نبی صلی اللہ علیہ وسلم کو جب ابو سفیان کے آنے کی خبر ملی تو آپ نے مشورہ کیا۔ ابو بکر و عمر رضی اللہ عنہما نے بات کی تو آپ نے ان سے اعراض کیا۔ سعد بن عبادہ رضی اللہ عنہ نے کھڑے ہو کر کہا : ’’شاید آپ ہم ( انصار) سے پوچھنا چاہتے ہیں، اے اللہ کے رسول ! اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اگر آپ ہمیں حکم دیں کہ ہم گھوڑوں کو سمندر میں ڈال دیں تو ہم ضرور ڈال دیں گے اور اگر آپ حکم دیں کہ گھوڑوں کو برک الغماد (مدینہ سے بہت دور ایک جگہ) تک لے جائیں تو ہم ضرور لے جائیں گے۔‘‘ [ مسلم، الجہاد والسیر، باب غزوۃ بدر : ۱۷۷۹ ] جنگ خندق میں رسول اللہ صلی اللہ علیہ وسلم کے مشورہ کرنے پر سلمان فارسی رضی اللہ عنہ نے خندق کھودنے کی رائے دی جس پر رسول اللہ صلی اللہ علیہ وسلم نے عمل کیا اور اللہ تعالیٰ نے اس مشورے میں بہت برکت پیدا فرمائی۔ امام بخاری رحمہ اللہ فرماتے ہیں : ’’رسول اللہ صلی اللہ علیہ وسلم کے بعد خلفاء برابر دیانت دار اہل علم سے مشورہ لیتے رہے۔‘‘( قرطبی) ¤ آج کل بہت سے لوگ مشورے اور ووٹ کو ایک چیز سمجھتے ہیں اور جمہوریت کو اسلامی شوریٰ قرار دیتے ہیں، حالانکہ موجودہ جمہوریت اور اسلامی شوریٰ الگ الگ چیزیں ہیں، کیونکہ جمہوریت ایک مستقل دین ہے۔ اس میں : (1) ہر اہل اور نا اہل کا ووٹ برابر ہے۔ (2) اس میں عوام کی اکثریت فیصلہ کن ہے، فیصلوں میں انھی کو اللہ اور رسول کا مقام حاصل ہے، خواہ وہ سود کو حلال کر دیں، یا زنا اور قوم لوط کے عمل کو۔ اللہ اور اس کے رسول کی اطاعت کی کوئی شرط نہیں، اگر کہیں ہے بھی تو دھوکا دینے کے لیے۔ (3) اس میں فیصلہ اکثریت کے نمائندوں کی اکثریت کا ہوتا ہے، صدر اس فیصلے کا پابند ہے، خواہ اسے غلط سمجھتا ہو یا صحیح۔ (4) ان کے ہاں مشورے کا معنی اکثریت ہے۔ جب کہ اسلام میں: (1) امیر مشورہ لینے کا پابند ہے، مگر صرف ان امور میں جو قرآن و سنت میں مذکور نہ ہوں، بلکہ تدبیری اور انتظامی قسم کے ہوں۔ (2) امیر مشورہ ان لوگوں سے لے گا جو اس معاملے میں رائے کی اہلیت رکھتے ہیں۔ امام شوکانی رحمہ اللہ لکھتے ہیں : ’’حکمرانوں کے لیے ضروری ہے کہ وہ علماء سے ایسے معاملات میں مشورہ کریں جن کا انھیں علم نہیں ہے، یا ان کے بارے میں انھیں اشکال ہے، فوج کے سربراہوں سے فوجی معاملات میں، سربرآوردہ لوگوں سے عوام کے مصالح کے بارے میں اور ماتحت حکام و والیان سے ان کے علاقوں کی ضروریات و ترجیحات کے متعلق مشورہ کریں۔‘‘ (3) مشورے کے بعد آخری فیصلہ امیر کا ہو گا، فرمایا : «فَاِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللّٰهِ» [ آل عمران : ۱۵۹ ] اگر وہ مناسب سمجھے تو اکثریت کے فیصلے پر عمل کرے اور اگر کم لوگوں میں زیادہ اہلیت والے لوگ ہونے کی وجہ سے ان کی رائے کو بہتر سمجھے تو اس پر فیصلہ کرے، کیونکہ فیصلوں کے نتائج کا آخری ذمہ دار امیر ہو گا، اکثریت نہیں اور وہ بھی اللہ پر توکل کرتے ہوئے فیصلے پر عمل کرے گا، نہ کہ مشورہ دینے والوں کی یا اپنی عقل و فہم پر۔ اگلی آیت میں پھر اللہ تعالیٰ پر توکل کرنے کی تاکید ہے۔"
    },
    {
      "Ayah": 161,
      "tafsir": "(آیت161) ➊ {وَ مَا كَانَ لِنَبِيٍّ اَنْ يَّغُلَّ …:} اوپر کی آیات میں جہاد کی ترغیب ہے اور اس اآیت میں جہاد کے احکام کا بیان ہے۔ ¤ ➋ جنگ احد کے دوران جو لوگ مورچہ چھوڑ کر مال غنیمت سمیٹنے دوڑ پڑے تھے ان کا خیال تھا کہ اگر ہم نہ پہنچے توسارا مال غنیمت دوسرے لوگ سمیٹ کر لے جائیں گے، اس پر تنبیہ کی جا رہی ہے کہ آخر تم نے یہ تصور کیسے کر لیا کہ اس مال میں سے تمھارا حصہ تمھیں نہیں دیا جائے گا۔ کیا تمھیں نبی صلی اللہ علیہ وسلم کی امانت پر اطمینان نہیں؟ یاد رکھو! ایک پیغمبر سے کسی قسم کی خیانت کا صدور ممکن ہی نہیں ہے، کیونکہ خیانت نبوت کے منافی ہے۔ معلوم ہوا غلول (خیانت) کے معنی ’’تقسیم میں نا انصافی‘‘ کے بھی آتے ہیں اور یہ بھی غلول ہے کہ تقسیم سے پہلے مال غنیمت سے کوئی چیز بلا اجازت اٹھا لی جائے۔ ¤ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’طمع کے کام تو ادنیٰ نبیوں سے بھی سرزد نہیں ہو سکتے (چہ جائیکہ سید الانبیاء سے)۔‘‘ (موضح)"
    },
    {
      "Ayah": 162,
      "tafsir": ""
    },
    {
      "Ayah": 163,
      "tafsir": ""
    },
    {
      "Ayah": 164,
      "tafsir": "(آیت 164) ➊ {لَقَدْ مَنَّ اللّٰهُ …:} اللہ تعالیٰ نبی صلی اللہ علیہ وسلم کے بشر ہونے اور انسانوں ہی میں سے ہونے کو ایک احسان کے طور پر بیان کر رہا ہے اور فی الواقع یہ احسان عظیم ہے کہ اس طرح ایک تو وہ اپنی قوم کی زبان اور لہجے ہی میں اللہ کا پیغام پہنچائے گا، جسے سمجھنا ہر شخص کے لیے آسان ہو گا، دوسرے لوگ ہم جنس ہونے کی وجہ سے اس سے مانوس اور اس سے قریب ہوں گے اور تیسرے انسان کے لیے انسان، یعنی بشر کی پیروی تو ممکن ہے، لیکن فرشتوں کی پیروی اس کے بس کی بات نہیں، نہ فرشتوں میں وہ کمزوریاں اور ضرورتیں پائی جاتی ہیں جو انسان میں ہیں اور نہ فرشتہ انسان کے وجدان و شعور کی گہرائیوں اور باریکیوں کا ادراک کر سکتا ہے۔ اس لیے اگر پیغمبر فرشتوں میں سے ہوتے تو وہ ان ساری ضروریات سے محروم ہوتے جو تبلیغ و دعوت کے لیے لازمی ہیں، اس لیے جتنے انبیاء بھی آئے سب کے سب بشر ہی تھے۔ قرآن مجید نے ان کی بشریت کو خوب کھول کر بیان کیا ہے، مثلاً دیکھیے سورۂ یوسف (۱۰۹)، سورۂ فرقان (۲۰)، سورۂ حم السجدہ (۶) اور سورۂ کہف کی آخری آیت۔ ¤ ➋ اوپر کی آیت میں جب یہ بیان فرما دیا کہ غلول اور خیانت ایک نبی کی شان سے بعید ہے، نبوت و خیانت جمع نہیں ہو سکتے، تو اب اس آیت میں اسی کی مزید تاکید فرمائی کہ آپ صلی اللہ علیہ وسلم کو ایک پاکیزہ اور اعلیٰ نصب العین دے کر مبعوث کیا گیا ہے، جو یہ ہے کہ تم پر اس کی آیات پڑھے، تمھیں کتاب و حکمت (سنت) کی تعلیم دے اور رذائل سے پاک کرے، پھر ایسی پاکیزہ ہستی کی طرف، جو اتنے عظیم مقصد کے حصول کی خاطر مبعوث ہوئی ہو، کوئی عقل مند آدمی غلول کی نسبت کیسے کر سکتا ہے، یا کسی کے دل میں یہ خیال کیسے آسکتا ہے کہ آپ خیانت جیسے کبیرہ اور مذموم فعل کا ارتکاب کر سکتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے بہت سی احادیث میں اس گناہ کو کبیرہ قرار دیا ہے، حتیٰ کہ ابن لتبیہ والی حدیث میں حکام کے ہدیوں (تحائف) کو بھی غلول شمار کیا۔ [ بخاری، الحیل، باب احتیال العامل… : ۶۹۷۹ ] { ”وَ اِنْ كَانُوْا“ } یہ اصل میں { ”وَ اِنَّهُمْ كَانُوْا“ } تھا، دلیل اس کی {”لَفِيْ ضَلٰلٍ مُّبِيْنٍ“} پر لام تاکید کا آنا ہے۔"
    },
    {
      "Ayah": 165,
      "tafsir": "(آیت 165) ➊ {اَوَ لَمَّاۤ اَصَابَتْكُمْ …:} یعنی احد میں تمھارے ستر آدمی شہید ہو گئے تو بدر میں تم نے ان کے ستر آدمی قتل اور ستر قید کیے تھے اور قیدی بھی مقتول کے حکم میں ہوتا ہے کہ جب گرفتار کرنے والے کی مرضی ہو اسے قتل کر ڈالے۔ ¤ ➋ {هُوَ مِنْ عِنْدِ اَنْفُسِكُمْ:} یعنی تمھارے گناہوں کی وجہ سے، یا خود تمھارے پسند کرنے کی وجہ سے۔ (فتح القدیر) پہلی صورت سے مراد یہ ہے کہ تمھاری اپنی کمزوریوں اور کوتاہیوں کی وجہ سے اور رسول اللہ صلی اللہ علیہ وسلم کی نافرمانی کی وجہ سے، جس کا ارتکاب تیر اندازوں نے اپنی جگہ کو چھوڑ کر کیا۔ (قرطبی) دوسری صورت میں اس کے معنی یہ ہوں گے کہ تمھارے فدیہ کو اختیار کرنے کی وجہ سے۔ رسول اللہ صلی اللہ علیہ وسلم نے بدر کے قیدیوں کے بارے میں صحابہ کو اختیار دیا تھا کہ اگر تم فدیہ لینا چاہتے ہو تو اس کے بدلے میں آئندہ تمھارے ستر آدمی شہید ہوں گے، چنانچہ صحابہ کرام رضی اللہ عنہم نے اسے منظور کر لیا تھا، قرآن نے یہاں « هُوَ مِنْ عِنْدِ اَنْفُسِكُمْ» کے الفاظ سے اسی حقیقت کی طرف اشارہ فرمایا ہے۔ [ ابن کثیر۔ طبری۔ أحمد : 30/1، ۳۱، ح : ۲۰۹ ]"
    },
    {
      "Ayah": 166,
      "tafsir": "(آیت 166) {وَ مَاۤ اَصَابَكُمْ … :} یعنی جنگ احد میں تمھیں جس نقصان کا سامنا کرنا پڑا وہ اللہ  تعالیٰ کے حکم اور اس کی مشیت سے تھا اور اس میں حکمت یہ تھی کہ اہل ایمان اور اہل نفاق کے درمیان تمیز ہو جائے۔"
    },
    {
      "Ayah": 167,
      "tafsir": "(آیت 167) ➊ {اَوِ ادْفَعُوْا:} نبی کریم صلی اللہ علیہ وسلم جنگ احد میں ایک ہزار کی جمعیت لے کر احد کی طرف چلے، مقام شوط پر پہنچے تو عبد اللہ بن ابی اپنے تین سو ساتھیوں سمیت وہاں سے لوٹ آیا۔ لوگوں نے ان سے کہا کہ اگر اللہ کی راہ میں جہاد نہیں کر سکتے تو کم از کم مسلمانوں کے ساتھ رہو، تاکہ کثرت تعداد کا دشمنوں پر اثر پڑے اور وہ آگے بڑھنے کی جرأت نہ کریں۔ اکثر مفسرین نے {”اَوِ ادْفَعُوْا“} کے یہی معنی کیے ہیں، مگر بعض نے یہ معنی بھی کیے ہیں کہ اپنے گھر کی عورتوں اور بچوں کی خاطر ہی لڑائی میں شامل رہو۔ (یہ معنی زیادہ درست معلوم ہوتا ہے) الغرض! لوگوں نے ہر طرح سے انھیں واپس لانے کی کوشش کی مگر وہ تیار نہ ہوئے اور وہ جواب دیا جو آگے آ رہا ہے۔ (قرطبی، ابن کثیر) ¤ ➋ {قَالُوْا لَوْ نَعْلَمُ قِتَالًا … :} وہ کہنے لگے، کوئی لڑائی وڑائی نہیں ہو گی، اگر ہمیں واقعی لڑائی کی توقع ہوتی تو ہم ضرور تمھارا ساتھ دیتے، یا مطلب یہ ہے کہ کوئی ڈھب کی جنگ ہوتی اور فریقین میں کچھ تناسب ہوتا تو ہم ضرور شرکت کرتے، مگر اُدھر تین ہزار کا مسلح لشکر ہے اور اِدھر ایک ہزار بے سروسامان آدمی ہیں، یہ کوئی جنگ ہے !؟ یہ تو اپنے آپ کو ہلاکت میں ڈالنا ہے، اس بنا پر ہم ساتھ نہیں دے سکتے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یہ کلمہ انھوں نے طعن کے طور پر کہا تھا اور مطلب یہ تھا کہ مسلمان فنون حرب سے بالکل نا آشنا ہیں، ورنہ ہماری رائے مان لی جاتی تو مدینہ کے اندر رہ کر مدافعت کی جاتی۔‘‘ (موضح) ¤ ➌ {هُمْ لِلْكُفْرِ يَوْمَىِٕذٍ اَقْرَبُ مِنْهُمْ لِلْاِيْمَانِ:} یعنی اس سے قبل تو وہ بظاہر مسلمانوں کے ساتھ شامل تھے، گو ان کے باطن میں کفر تھا، مگر علانیہ اس کا اظہار نہیں کرتے تھے، لیکن اس روز انھوں نے ایمان کو چھوڑ کر علانیہ کفر اختیار کر لیا، یا مطلب یہ ہے کہ اس دن انھیں ایمان کی بہ نسبت کفر کا مفاد زیادہ عزیز تھا اور انھوں نے واپس ہو کر مسلمانوں کو کمزور کیا اور کفر کو تقویت بخشی۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یہ کلمہ انھوں نے طعن کے طور پر کہا تھا، پس اس لفظ کی وجہ سے وہ کفر کے قریب اور ایمان سے دور ہو گئے۔‘‘ (موضح) ¤ ➍ {يَقُوْلُوْنَ بِاَفْوَاهِهِمْ … :} یعنی بظاہر یہ کلمہ کہہ کر عذر لنگ اور بہانہ بناتے ہیں، مگر جو جذبات ان کے دلوں میں چھپے ہوئے ہیں ان کا صاف طور پر اظہار نہیں کرتے، دراصل یہ مسلمانوں کی ہلاکت کے متمنی ہیں، لیکن انھیں یہ بات فراموش نہیں کرنی چاہیے کہ اللہ تعالیٰ ان کے دل کی باتوں سے خوب واقف ہے۔"
    },
    {
      "Ayah": 168,
      "tafsir": "(آیت 168)جو مسلمان جنگ احد میں شہید ہوئے ان کے بارے میں منافقین نے اس قسم کا اظہار کیا، تاکہ لوگوں کو جہاد میں شمولیت سے متنفر کیا جا سکے۔ قرآن نے ان کے اس شبہ کی تردید کرتے ہوئے فرمایا کہ اگر واقعی گھروں میں بیٹھے رہنا تمھیں موت سے بچا سکتا ہے تو ذرا اپنے اوپر واقع ہونے والی موت کو ٹال کر دکھا ؤ ۔"
    },
    {
      "Ayah": 159,
      "tafsir": "(آیت 169)اس آیت میں منافقین کے اس شبہ کی کہ ’’جہاد میں شامل ہونا خواہ مخواہ اپنے آپ کو ہلاکت میں ڈالنا ہے‘‘ ایک دوسرے طریقے سے تردید کی ہے۔ فرمایا، نہیں بلکہ اس سے دائمی زندگی حاصل ہوتی ہے، شہداء کو اللہ کے ہاں بلند درجے ملتے ہیں، پروردگار کے ہاں انھیں ہر قسم کی نعمت اور لذت حاصل ہوتی ہے، یہ زندگی حقیقی زندگی ہے مگر دنیا والی زندگی نہیں، بلکہ یہ اللہ تعالیٰ کے پاس ہے، جو تمھاری نگاہ سے اوجھل ہے، جسے ’’برزخ‘‘ کہتے ہیں اور جو تمھاری سمجھ میں نہیں آ سکتی، فرمایا : «وَ لٰكِنْ لَّا تَشْعُرُوْنَ» [ البقرۃ : ۱۵۴ ] ’’اور لیکن تم (اس زندگی کو) نہیں سمجھتے۔‘‘ ¤ عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم سے اس آیت کریمہ «وَ لَا تَحْسَبَنَّ الَّذِيْنَ قُتِلُوْا فِيْ سَبِيْلِ اللّٰهِ اَمْوَاتًا» سے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ ان (شہداء) کی روحیں سبز رنگ کے پرندوں کے قالب میں ہوتی ہیں اور ان کے لیے عرشِ الٰہی کے ساتھ قندیلیں معلق ہوتی ہیں، وہ جنت میں جہاں سے چاہتی ہیں کھاتی پیتی ہیں، پھر عرش کے نیچے لٹکی ہوئی انھی قندیلوں میں آکر رہتی ہیں۔‘‘ [ مسلم، الإمارۃ، باب بیان أن أرواح الشھداء فی الجنۃ… : ۱۸۸۷ ]"
    },
    {
      "Ayah": 170,
      "tafsir": "(آیت 171،170) {وَ يَسْتَبْشِرُوْنَ بِالَّذِيْنَ …:} یعنی اپنے جن مسلمان بھائیوں کو جہاد فی سبیل اللہ میں مشغول چھوڑ آئے ہیں ان کا تصور کر کے خوش ہوتے ہیں کہ ان کو بھی ہماری طرح پر لطف اور بے خوف و خطر زندگی حاصل ہو گی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جب تمھارے بھائی احد میں شہید ہوئے تو اللہ تعالیٰ نے ان کی روحوں کو سبز رنگ کے پروندں کے قالبوں میں ڈال دیا، جو جنت کی نہروں پر آتی ہیں، جنت کے پھل کھاتی ہیں اور عرش کے سائے میں سونے کی قندیلوں کے پاس ٹھہر جاتی ہیں، جب انھوں نے اپنے پاکیزہ کھانے اور پینے کو دیکھا اور اپنے حسن انجام کو ملاحظہ کیا تو کہنے لگے : ’’اے کاش ! ہمارے بھائیوں کو بھی یہ معلوم ہو جائے کہ اللہ تعالیٰ نے ہمارے ساتھ کیا اچھا سلوک فرمایا ہے، تاکہ وہ جہاد سے غافل ہو کر جنگ سے منہ نہ موڑیں۔‘‘ تب اللہ تعالیٰ نے فرمایا : ’’تمھارا یہ پیغام میں پہنچا دیتا ہوں۔‘‘ تو یہ آیات نازل فرمائیں : «وَ لَا تَحْسَبَنَّ الَّذِيْنَ قُتِلُوْا فِيْ سَبِيْلِ اللّٰهِ اَمْوَاتًا بَلْ اَحْييَآءٌ » [ أحمد : 265/1، ۲۶۶ح : ۲۳۸۸، عن عبد اللہ بن عباس رضی اللہ عنہما و صححہ أحمدشاکر فی المسند : ۲۳۸۹ ] {’’ يَسْتَبْشِرُوْنَ‘‘} میں حروف زیادہ ہونے کی وجہ سے ترجمہ ’’ بہت خوش ہوتے ہیں‘‘ کیا ہے۔"
    },
    {
      "Ayah": 171,
      "tafsir": "(آیت 171،170) {وَ يَسْتَبْشِرُوْنَ بِالَّذِيْنَ …:} یعنی اپنے جن مسلمان بھائیوں کو جہاد فی سبیل اللہ میں مشغول چھوڑ آئے ہیں ان کا تصور کر کے خوش ہوتے ہیں کہ ان کو بھی ہماری طرح پر لطف اور بے خوف و خطر زندگی حاصل ہو گی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جب تمھارے بھائی احد میں شہید ہوئے تو اللہ تعالیٰ نے ان کی روحوں کو سبز رنگ کے پروندں کے قالبوں میں ڈال دیا، جو جنت کی نہروں پر آتی ہیں، جنت کے پھل کھاتی ہیں اور عرش کے سائے میں سونے کی قندیلوں کے پاس ٹھہر جاتی ہیں، جب انھوں نے اپنے پاکیزہ کھانے اور پینے کو دیکھا اور اپنے حسن انجام کو ملاحظہ کیا تو کہنے لگے : ’’اے کاش ! ہمارے بھائیوں کو بھی یہ معلوم ہو جائے کہ اللہ تعالیٰ نے ہمارے ساتھ کیا اچھا سلوک فرمایا ہے، تاکہ وہ جہاد سے غافل ہو کر جنگ سے منہ نہ موڑیں۔‘‘ تب اللہ تعالیٰ نے فرمایا : ’’تمھارا یہ پیغام میں پہنچا دیتا ہوں۔‘‘ تو یہ آیات نازل فرمائیں : «وَ لَا تَحْسَبَنَّ الَّذِيْنَ قُتِلُوْا فِيْ سَبِيْلِ اللّٰهِ اَمْوَاتًا بَلْ اَحْييَآءٌ » [ أحمد : 265/1، ۲۶۶ح : ۲۳۸۸، عن عبد اللہ بن عباس رضی اللہ عنہما و صححہ أحمدشاکر فی المسند : ۲۳۸۹ ] {’’ يَسْتَبْشِرُوْنَ‘‘} میں حروف زیادہ ہونے کی وجہ سے ترجمہ ’’ بہت خوش ہوتے ہیں‘‘ کیا ہے۔"
    },
    {
      "Ayah": 172,
      "tafsir": "(آیت 172)یہ حمراء الاسد، یعنی جنگ احد سے اگلے روز کا واقعہ ہے۔ تفصیل اس کی یہ ہے کہ احد سے پلٹ کر جب مشرکین چند منزل دور چلے گئے تو آپس میں کہنے لگے کہ ہم نے یہ کیا حماقت کی کہ مسلمانوں کا پوری طرح خاتمہ کیے بغیر واپس چلے آئے۔ چنانچہ وہ مدینے پر دوبارہ حملہ کرنے کا منصوبہ بنانے لگے، ادھر جب رسول اللہ صلی اللہ علیہ وسلم کو اطلاع ملی تو آپ نے مسلمانوں کو مشرکین کے تعاقب میں نکلنے کا حکم دیا، تاکہ وہ واقعی پلٹ کر مدینہ پر حملہ نہ کر دیں۔ اس وقت اگرچہ شرکائے احد میں سے اکثر لوگ سخت زخمی اور تھکے تھے لیکن اللہ اور رسول صلی اللہ علیہ وسلم کے حکم کی تعمیل میں فوراً نکل کھڑے ہوئے۔ جب مدینہ سے تقریباً آٹھ میل کے فاصلے پر حمراء الاسد (نامی جگہ) پہنچے تو مشرکین کو ان کے آنے کی اطلاع مل گئی اور انھوں نے آپس میں کہا کہ اس مرتبہ تو واپس چلتے ہیں، اگلے سال پھر آئیں گے۔ اس صورت حال کے پیش نظر نبی صلی اللہ علیہ وسلم بھی مدینہ واپس تشریف لے آئے۔ چنانچہ آیت میں اسی واقعے کی طرف اشارہ ہے اور مسلمانوں کو بشارت ہے۔ (ابن کثیر) ¤ عائشہ رضی اللہ عنہا نے اپنے بھانجے عروہ سے کہا : ’’اے میرے بھانجے! تیرے دونوں باپ زبیر (والد) اور ابو بکر (نانا) بھی ان میں شامل تھے، جب رسول اللہ صلی اللہ علیہ وسلم کو احد میں وہ تکالیف پہنچیں جو پہنچیں اور مشرکین واپس چلے گئے تو آپ نے خوف محسوس کیا کہ وہ پلٹ نہ آئیں تو فرمایا : ’’ان کے پیچھے کون جائے گا؟‘‘ تو ان میں سے ستر آدمیوں نے لبیک کہا، ان میں ابوبکر اور زبیر بھی تھے۔‘‘ [ بخاری، المغازی، باب : «الذین استجابوا للہ والرسول» : ۴۰۷۷، عن عائشۃ رضی اللہ عنہا ]"
    },
    {
      "Ayah": 173,
      "tafsir": "(آیت 173 ) ➊ {اَلَّذِيْنَ قَالَ لَهُمُ النَّاسُ … :} یہ آیت بھی واقعہ حمراء الاسد ہی سے متعلق ہے اور وہ اس طرح کہ جب ابوسفیان کو جو اس وقت مشرکین کی قیادت کر رہا تھا، مسلمانوں کے تعاقب کی اطلاع ملی تو اس نے ایک تجارتی قافلے کے ذریعے سے رسول اللہ صلی اللہ علیہ وسلم کو یہ چیلنج بھیجا کہ میں نے بڑا لا ؤ لشکر جمع کر لیا ہے اور میں مدینہ پر پھر سے حملہ کرنے والا ہوں، یہ سن کر مسلمانوں میں خوف اور کمزوری کے بجائے مزید ایمانی قوت پیدا ہوئی اور آپ صلی اللہ علیہ وسلم اور صحابہ نے کہا : «حَسْبُنَا اللّٰهُ وَ نِعْمَ الْوَكِيْلُ» ’’ہمیں اللہ کافی ہے اور وہ اچھا کارساز ہے۔‘‘ (ابن کثیر) ¤ ➋ عبد اللہ بن عباس رضی اللہ عنہما فرماتے ہیں کہ «حَسْبُنَا اللّٰهُ وَ نِعْمَ الْوَكِيْلُ» کا کلمہ ابراہیم علیہ السلام نے اس وقت کہا تھا جب انھیں آگ میں ڈالا گیا اور محمد صلی اللہ علیہ وسلم نے اس وقت کہا جب لوگوں نے کہا : «اِنَّ النَّاسَ قَدْ جَمَعُوْا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ اِيْمَانًا» ’’بے شک لوگوں نے تمھارے لیے (فوج) جمع کر لی ہے، سو ان سے ڈرو، تو اس بات نے انھیں ایمان میں زیادہ کر دیا‘‘ اور انھوں نے کہا : «حَسْبُنَا اللّٰهُ وَ نِعْمَ الْوَكِيْلُ » ’’ہمیں اللہ کافی ہے اور وہ اچھا کارساز ہے۔‘‘ [ بخاری، التفسیر، باب قولہ : «الذین قال لہم الناس…» : ۴۵۶۳ ] ¤ ➌ {فَزَادَهُمْ اِيْمَانًا:} اس سے معلوم ہوا کہ صحابہ کا ایمان مشرکین کے چیلنج کرنے سے بڑھ گیا، ظاہر ہے وہ پہلے نسبتاً کم تھا، تب ہی بڑھا۔ اس سے ایمان کی کمی بیشی ثابت ہوتی ہے اور ان لوگوں کی تردید ہو گئی جو کہتے ہیں کہ ہمارا ایمان جبریل علیہ السلام اور ابو بکر رضی اللہ عنہ کے ایمان جیسا ہے۔ یہ بھی معلوم ہوا کہ ایمان جس قدر بڑھتا ہے جذبۂ جہاد بھی بڑھتا ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جس نے نہ جنگ کی نہ اپنے دل سے جنگ کی بات کی، وہ نفاق کی ایک شاخ پر مرے گا۔‘‘ [ مسلم، الإمارۃ، باب ذم من مات و لم یغز … ۱۹۱۰۔ أبو داوٗد، الجہاد، باب کراھیۃ ترک الغزو : ۲۵۰۲، عن أبی ھریرۃ رضی اللہ عنہ ]"
    },
    {
      "Ayah": 174,
      "tafsir": "(آیت 174)اس آیت سے اور ابن عباس رضی اللہ عنہما کی حدیث سے کلمہ «حَسْبُنَا اللّٰهُ وَ نِعْمَ الْوَكِيْلُ» کی فضیلت ثابت ہوتی ہے کہ کس طرح ابراہیم علیہ السلام ، نبی کریم صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنہم ہر قسم کی برائی سے محفوظ رہ کر اللہ کی نعمت اور فضل کے ساتھ واپس پلٹے اور انھوں نے اللہ کی رضا کی پیروی کی۔ اس لیے ہر مصیبت کے وقت اس وظیفہ کے معنی کا خیال کرتے ہوئے دل اور زبان کو ایک کر کے اسے کثرت سے پڑھنا چاہیے۔"
    },
    {
      "Ayah": 175,
      "tafsir": "(آیت 175)وہ شخص جو یہ افواہیں پھیلا رہا تھا اسے شیطان فرمایا اور بتایا کہ یہ اپنے کافر اور منافق دوستوں سے ڈرا رہا ہے، مسلمانوں کو چاہیے کہ اللہ تعالیٰ کے سوا کسی کا ڈر دل میں نہ لائیں۔ حقیقی شیطان بھی اپنے انسانی دوست شیطانوں کے دلوں میں مسلمانوں کو خوف زدہ کرنے کے نئے سے نئے طریقے ڈالتا رہتا ہے۔ دیکھیے سورۂ انعام (۱۱۲) آج کل اخبار، ریڈیو، ٹی وی اور انٹرنیٹ جھوٹ پھیلانے اور خوف زدہ کرنے کے لیے شیطان کے آلات ہیں۔ مومن کو ان کی خبروں سے ڈرنے کے بجائے اللہ پر بھروسا کرنا چاہیے اور { ”اَلْحَرْبُ خُدْعَةٌ“} کے تحت ان کا علاج بھی کرنا چاہیے۔"
    },
    {
      "Ayah": 176,
      "tafsir": "(آیت 176)کافر اور منافق مختلف طریقوں سے رسول اللہ صلی اللہ علیہ وسلم کی مخالفت کرتے رہتے، جس سے آپ طبعی طور پر رنجیدہ خاطر بھی ہو جاتے، خصوصاً غزوۂ احد کے واقعہ کو منافقین نے بہت ہوا دی اور مسلمانوں کو اللہ کی نصرت سے مایوس کرنے کی کوشش کی اس پر یہ آیات نازل ہوئیں اور آپ صلی اللہ علیہ وسلم کو تسلی دی گئی کہ اس قسم کی مخالفتوں سے کفار اسلام کو کوئی نقصان نہیں پہنچا سکتے، بلکہ اس قسم کا رویہ اختیار کر کے خود ہی آخرت کے حصے سے محروم ہو رہے ہیں۔"
    },
    {
      "Ayah": 177,
      "tafsir": "(آیت 177)یعنی یہ لوگ ایمان کے بجائے کفر اختیارکر کے خود اپنا برا کر رہے ہیں، اس کے نتیجہ میں دردناک عذاب سے دو چار ہوں گے۔"
    },
    {
      "Ayah": 178,
      "tafsir": "(آیت 178)فرمایا، ہم جو کافروں کی عمریں لمبی کرتے چلے جا رہے ہیں اور انھیں ان کے حال پر چھوٹ دے رہے ہیں، مال، اولاد اور دنیا کی نعمتیں وافر دے رہے ہیں، توکیا یہ سب کچھ ان کے لیے بہتر ہے؟ نہیں، بلکہ یہ ان کے لیے بہت برا ہے، کیونکہ اس سے ان کے گناہوں میں اضافہ ہو گا، ان کے خلاف حجت مضبوط ہو گی، بلکہ دنیا میں بھی یہ سب کچھ ان کے لیے عذاب کا باعث بنے گا، دیکھیے سورۂ مومنون (۵۵، ۵۶)، سورۂ قلم (۴۴) اور سورۂ توبہ (۵۵)۔"
    },
    {
      "Ayah": 179,
      "tafsir": "(آیت 179 ) ➊ {مَا كَانَ اللّٰهُ لِيَذَرَ الْمُؤْمِنِيْنَ …:} چنانچہ جنگ احد میں کفر و نفاق اور ایمان و اخلاص الگ ہو کر سامنے آگئے۔ رازی لکھتے ہیں : ”اس آیت کا تعلق بھی قصۂ احد سے ہے۔ چنانچہ اس حادثہ میں قتل و ہزیمت اور پھر اس کے بعد ابو سفیان کے چیلنج کے جواب میں مسلمانوں کا نکلنا وغیرہ، سب ایسے واقعات تھے جن سے کفر و نفاق اور ایمان و اخلاص الگ الگ ہو کر سامنے آگئے اور مومن اور منافق میں امتیاز ہوگیا۔ چونکہ منافقین کا مومنوں کے ساتھ ملا جلا رہنا حکمت الٰہی کے خلاف تھا، اس لیے یہ تمام واقعات پیش آئے۔“ ¤ ➋ {وَ مَا كَانَ اللّٰهُ لِيُطْلِعَكُمْ عَلَى الْغَيْبِ:} یعنی اگر اللہ تعالیٰ اس طرح آزمائش کے ذریعے سے مخلص مومنوں اور منافقین کے حالات اور ان کے ظاہر و باطن کو نمایاں نہ کرے تو تمھارے پاس کوئی غیب کا علم تو ہے نہیں کہ جس سے تم پر یہ چیزیں ظاہر ہو جائیں اور تم جان سکو کہ کون مومن ہے اور کون منافق؟ اور نہ تم میں سے ہر ایک کو غیب کی بات پر اطلاع دی جا سکتی ہے اور نہ تم میں سے کسی کو بھی پورے غیب کی اطلاع دی جا سکتی ہے۔ ¤ ➌ {وَ لٰكِنَّ اللّٰهَ يَجْتَبِيْ …:} ہاں، البتہ اللہ تعالیٰ اپنے رسولوں میں سے جسے چاہتا ہے غیب کی جتنی بات چاہتا ہے اس کی اطلاع دے دیتا ہے، جو نہیں چاہتا نہیں بتاتا۔ اب منافقین میں سے بعض کا بتا دیا اور بعض کا نہیں بتایا، چنانچہ فرمایا : «وَ مِمَّنْ حَوْلَكُمْ مِّنَ الْاَعْرَابِ مُنٰفِقُوْنَ وَ مِنْ اَهْلِ الْمَدِيْنَةِ مَرَدُوْا عَلَى النِّفَاقِ لَا تَعْلَمُهُمْ نَحْنُ نَعْلَمُهُمْ » [ التوبۃ : ۱۰۱] ’’اور ان لوگوں میں سے جو تمھارے ارد گرد بدویوں میں سے ہیں، کچھ منافق ہیں اور کچھ اہل مدینہ میں سے بھی جو نفاق پر اڑ گئے ہیں، تو انھیں نہیں جانتا، ہم ہی انھیں جانتے ہیں۔‘‘ اس سے معلوم ہوا کہ اللہ تعالیٰ اپنے چنے ہوئے رسولوں کو غیب کی کچھ باتوں کی اطلاع دیتا ہے، جن کی انھیں نبوت کی دلیل کے طور پر ضرورت ہوتی ہے، مگر وہ اس سے عالم الغیب نہیں بنتے، عالم الغیب ایک اللہ تعالیٰ ہی کی ذات ہے۔ مزید دیکھیے سورۂ انعام (۵۹)، سورۂ نمل(۶۵) اور سورۂ جن (۲۶تا ۲۸)۔ ¤ ➍ {فَاٰمِنُوْا بِاللّٰهِ وَ رُسُلِهٖ :} مسلمانوں کا یہ کام نہیں کہ رسول سے اپنی مرضی کی غیب کی باتیں بتانے کا مطالبہ کریں۔ ان کا کام اللہ اور اس کے رسولوں پر ایمان لانا ہے اور اگر وہ ایمان لا کر تقویٰ اختیار کریں گے تو ان کے لیے اجر عظیم ہے۔"
    },
    {
      "Ayah": 180,
      "tafsir": "(آیت 180) ➊ {وَ لَا يَحْسَبَنَّ الَّذِيْنَ يَبْخَلُوْنَ …:} اوپر ترغیب جہاد کے سلسلے میں جانی ققربانی پر زور دیا ہے اور جو جان بچانے کی خاطر اس سے فرار اختیار کرتے ہیں ان کے حق میں وعید سنائی ہے۔ اب یہاں جہاد میں مالی قربانی پر زور دیا جا رہا ہے اور بخل کرنے والوں کی مذمت کی جا رہی ہے۔ مقصد یہ ہے کہ جس طرح ان منافقین کو اپنی جان پیاری ہے اسی طرح ان کو اپنا مال بھی پیارا ہے اور جو لوگ مال کے حقوق ادا کرنے سے پہلوتہی کرتے ہیں، قیامت کے دن یہی مال ان کے لیے وبال جان بن جائے گا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جس شخص کو اللہ تعالیٰ نے کچھ مال دیا ہے اور وہ اس کی زکوٰۃ ادا نہیں کرتا، قیامت کے دن اس کے مال کو ایک گنجے سانپ کی شکل دے دی جائے گی اور وہ طوق بنا کر اس کے گلے میں ڈال دیا جائے گا۔ وہ اسے اس کی دونوں باچھوں سے پکڑے گا اور اس سے کہے گا : ’’میں ہوں تمھارا مال، میں ہوں تمھارا خزانہ۔‘‘ پھر نبی صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی۔ [ بخاری، التفسیر، باب : «ولایحسبن الذین یبخلون…» : ۴۵۶۵، عن أبی ھریرۃ رضی اللہ عنہ ] ¤ ➋ بخل ان حقوق کو ادا نہ کرنے کا نام ہے جو انسان پر واجب ہوں، مثلاً گھر والوں کا نان و نفقہ، مہمان نوازی، جہاد کی تیاری، زکوٰۃ و عشر وغیرہ۔ ابو بکر صدیق رضی اللہ عنہ نے فرمایا : [ وَ اَيُّ دَائٍ اَدْوَأُ مِنَ الْبُخْلِ ] ’’بخل سے بڑی بیماری کیا ہو سکتی ہے؟‘‘ [ بخاری، المغازی، باب قصۃ عمان والبحرین : ۴۳۸۳ ] ¤ ➌ {وَ لِلّٰهِ مِيْرَاثُ … :} یعنی جب زمین و آسمان کی ہر چیز اللہ تعالیٰ ہی کی میراث اور ملکیت ہے تو جس مال کے بظاہر تم وارث بنائے گئے ہو، اس میں بخل کیوں کرتے ہو ؟ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’اللہ وارث ہے، آخر تم مر جا ؤ گے اور مال اسی کا ہو رہے گا، تم اپنے ہاتھ سے دو تو ثواب پا ؤ ۔‘‘ (موضح)"
    },
    {
      "Ayah": 181,
      "tafsir": "(آیت 181) ➊ {لَقَدْ سَمِعَ اللّٰهُ قَوْلَ الَّذِيْنَ قَالُوْۤا اِنَّ اللّٰهَ فَقِيْرٌ …:} اوپر کی آیات میں اللہ کے راستے میں خرچ کرنے پر زور دیا، اب ان آیات میں یہود کے اعتراضات کا بیان اور ان کا جواب دینا مقصود ہے۔ دراصل یہود یہ اعتراضات نبوت پر طعن کی غرض سے کرتے تھے۔ کتب تفسیر میں ہے کہ جب یہ آیت نازل ہوئی : «مَنْ ذَا الَّذِيْ يُقْرِضُ اللّٰهَ قَرْضًا حَسَنًا» [ البقرۃ : ۲۴۵ ] (کون ہے جو اللہ کو قرض دے، اچھا قرض) تو بعض یہود نے مذاق اڑاتے ہوئے کہا : ’’ لو جی، اللہ تعالیٰ بھی فقیر ہو گئے ہیں اور بندوں سے قرض مانگنے پر اتر آئے ہیں۔‘‘ تو ان کے جواب میں یہ آیت اتری۔ (ابن کثیر) دراصل اس قسم کے اعتراضا ت وہ عوام کو اللہ کی راہ میں خرچ کرنے سے متنفر کرنے کی غرض سے کرتے تھے، ورنہ وہ بھی خوب جانتے تھے کہ اللہ تعالیٰ کے بارے میں ایسے الفاظ کہنا کتنی بڑی گستاخی اور کفر ہے۔ (قرطبی) ¤ ➋ {سَنَكْتُبُ مَا قَالُوْا:} یعنی ان کی اللہ تعالیٰ کے بارے میں یہ گستاخی اور رسولوں کو ناحق قتل کرنا، سب ان کے نامۂ اعمال میں درج کیا جا رہا ہے۔ قیامت کے دن ایسے مجرموں کو کیفر کردار تک پہنچایا جائے گا اور وہ عذاب حریق کی سزا میں گرفتار ہوں گے۔"
    },
    {
      "Ayah": 182,
      "tafsir": "(آیت 182) {وَ اَنَّ اللّٰهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيْدِ:} اس پر ایک سوال پیدا ہوتا ہے کہ {”ظَلاَّمٌ“} مبالغے کا صیغہ ہے، جس کا معنی بہت ظلم کرنے والا ہے۔ بظاہر معنی یہ ہوا کہ ’’اللہ بندوں پر بہت ظلم کرنے والا نہیں‘‘ گویا کم ظلم کر سکتا ہے۔ اس کا ایک جواب استاذ مرحوم مولانا محمد عبدہ رحمہ اللہ نے دیا ہے : ’’اس مبالغے کے ساتھ اللہ تعالیٰ سے ظلم کی نفی کے یہ معنی ہیں کہ اگر اللہ تعالیٰ کی طرف سے (نعوذ باللہ) رتی برابر بھی ظلم صادر ہو تو وہ { ”ظَلاَّمٌ“ } ٹھہرے گا اور اللہ تعالیٰ کی ذات ظلم سے منزہ ہے۔‘‘ یہ جواب بھی اچھا ہے، مگر اس سے قوی جواب یہ ہے کہ بعض اوقات مبالغے کے صیغے پر نفی آئے تو اس سے مراد مبالغہ کی نفی نہیں ہوتی بلکہ نفی میں مبالغہ ہوتا ہے۔ اس لیے ترجمہ کیا گیا ہے کہ ’’ اللہ بندوں پر کچھ بھی ظلم کرنے والا نہیں۔‘‘ جیسا کہ طرفہ نے کہا ہے: ¤ {وَلَسْتُ بِحَلاَّلِ التِّللَاعِ مَخَافَةً ¤ وَلٰكِنْ مَتٰي يَسْتَرْفِدِ الْقَوْمُ أَرْفِدِ} ¤ ظاہر الفاظ کے مطابق ترجمہ یہ ہو گا ’’اور میں خوف کی وجہ سے ٹیلوں پر بہت زیادہ چڑھنے والا نہیں، بلکہ قوم جب مجھ سے عطیہ مانگے تو میں عطیہ دیتا ہوں۔‘‘ مگر یہاں یہ معنی نہیں کہ میں بہت زیادہ چڑھنے والا نہیں، بلکہ معنی ہے کہ میں بالکل ٹیلوں پر نہیں چڑھتا۔ دلیل یہ ہے کہ میں عطیہ مانگنے پر دیتا ہوں۔ دیکھیے ’’ البحر المحیط ‘‘ اور ’’ اللباب‘‘ وغیرہ۔"
    },
    {
      "Ayah": 183,
      "tafsir": "(آیت 183) ➊ {اَلَّذِيْنَ قَالُوْۤا اِنَّ اللّٰهَ عَهِدَ اِلَيْنَاۤ …:} یہ ان کا دوسرا اعتراض ہے جو انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی نبوت پر ایمان نہ لانے کے سلسلے میں پیش کیا کہ بنی اسرائیل سے اللہ تعالیٰ نے یہ عہد لیا ہے کہ اگر کوئی نبی یہ معجزہ پیش نہ کرے تو اس پر ایمان نہ لائیں۔ (رازی) حالانکہ ان کی کسی کتاب میں یہ حکم نہیں اور ان کے تمام انبیاء کو یہ معجزہ عطا بھی نہیں ہوا تھا، جیسا کہ اسی آیت میں اشارہ ہے : «قُلْ قَدْ جَآءَكُمْ رُسُلٌ مِّنْ قَبْلِيْ» یہاں {”رُسُلٌ“} نکرہ ہے، جس سے معلوم ہوتا ہے کہ ان کے تمام انبیاء کو نہیں، بلکہ بعض کو یہ معجزہ عطا ہوا کہ جب کوئی سوختنی (جلائی جانے والی) قربانی (نذر) پیش کی جاتی تو وہ اللہ تعالیٰ سے دعا کرتے، اس قربانی (نذر) کی قبولیت کی علامت کے طور پر آسمان سے آگ اترتی، جو اسے جلا ڈالتی، جیسا کہ ایلیاء اور سلیمان علیہما اسلام کے متعلق مذکور ہے۔ (ابن کثیر) ¤ ➋ {قُلْ قَدْ جَآءَكُمْ رُسُلٌ مِّنْ قَبْلِيْ …:} یہ ان کے اس اعتراض کا جواب ہے، جو اوپر ذکر ہوا کہ اگر واقعی تم اس دعویٰ میں سچے ہو تو پھر تمھارے آباء و اجداد نے ان بہت سے انبیاء کو قتل کیوں کر ڈالا جو اپنی نبوت کے صدق پر دوسری واضح دلیلوں کے ساتھ یہ معجزہ بھی لے کر آئے جس کا تم مطالبہ کر رہے ہو ؟"
    },
    {
      "Ayah": 184,
      "tafsir": "(آیت 184) یہود کے تمسخر اور اعتراضات کا جواب دینے کے بعد آپ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ اس قسم کے شبہات پیدا کر کے اگر یہ لوگ آپ کو جھٹلا رہے ہیں تو یہ غم کی بات نہیں، کیونکہ آپ سے پہلے بہت سے انبیاء کے ساتھ وہ یہ سلوک کر چکے ہیں۔ { ”بِالْبَيِّنٰتِ“ } سے دلائل عقلیہ اور معجزات دونوں مراد ہیں۔ { ”الزُّبُرِ“ } یہ زبور کی جمع ہے، اس سے وہ چھوٹے چھوٹے صحیفے مراد ہیں جن میں نیکی کی نصیحت، برائی سے روکنے اور حکمت و دانائی کی باتیں ہوتی تھیں۔ دا ؤ د علیہ السلام کو جو کتاب دی گئی تھی، قرآن نے اسے بھی ’’زبور‘‘ کہا ہے، کیونکہ اس میں بھی انھی چیزوں کا پہلو نمایاں ہے اور قرآن کی اصطلاح میں {”الْكِتٰبِ“} سے مراد وہ بڑی کتاب ہے جس میں مسائل و احکام اور دوسری سب چیزیں ہوں، مگر ان کتابوں میں قرآن مجید کے سوا کسی کتاب کو اعجازی حیثیت حاصل نہیں ہوئی (کہ اس کی کسی سورت کے مقابلے میں اس جیسی ایک سورت لانے کا چیلنج ہو)۔"
    },
    {
      "Ayah": 185,
      "tafsir": "(آیت 185)بخیلوں کا حال اور ان کا کفر بیان کرنے کے بعد یہاں بتایا کہ دنیا کے جس مال و متاع کے جمع کرنے کے لیے انسان بخل کرتا ہے، یہ سب کچھ فانی ہے اور باقی نہ رہنے والا ہے اور آخرت کی زندگی ہی باقی اور ابدی ہے۔ لہٰذا انسان کو چاہیے کہ آخرت کی فکر کرے اور اس میں کامیابی کی کوشش کرتا رہے۔ اور یہ جو فرمایا : ’’ تمھیں تمھارے اجر قیامت کے دن ہی پورے دیے جائیں گے‘‘ تو اس کے معنی یہ ہیں کہ انسان کو دنیا یا برزخ میں بھی کچھ نہ کچھ اعمال کا بدلہ ملتا ہے، مگر پورا بدلہ یعنی پورا ثواب و عقاب قیامت کے دن ہی ملے گا، اس سے پہلے ممکن نہیں۔ اور دنیا کی زندگی محض {”مَتَاعُ الْغُرُوْرِ“} (دھوکے کا سامان) ہے، اس کی ظاہری زیب و زینت سے دھوکا نہیں کھانا چاہیے، اصل کامیابی تو آخرت کی کامیابی ہے۔ [ لاَ عَیْشَ اِلاَّ عَیْشُ الْآخِرَہْ ]"
    },
    {
      "Ayah": 186,
      "tafsir": "(آیت 186)یہ خطاب نبی صلی اللہ علیہ وسلم اور عام مسلمانوں سے ہے کہ آئندہ بھی جان و مال میں تمھاری آزمائش ہو گی اور تمھیں ہر قسم کی قربانیاں پیش کرنا ہوں گی، جیسے اموال کا تلف ہو جانا اور بیمار پڑ جانا وغیرہ۔ اہل کتاب اور مشرکین کی زبانوں سے تمھیں انتہائی دل آزار اور جگر خراش طعن و تشنیع، بے ہودہ گفتگو اور جھوٹے الزامات سننا پڑیں گے، جیسا کہ منافقین نے ہر طرح ستایا۔ سورۂ منافقون اور سورۂ توبہ میں تفصیل دیکھ لیں، نیز کعب بن اشرف یہودی نے رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنہم کی ہجو کی اور اپنے قصائد میں مسلمان خواتین کا نام لے کر عشقیہ اشعار کہے۔ مگر ان کا علاج یہ ہے کہ تم صبر، یعنی ثابت قدمی اور استقلال سے کام لو اور اللہ تعالیٰ کا تقویٰ اپنے دلوں میں رکھو۔ اگر صبر اور تقویٰ سے ان آزمائشوں کا مقابلہ کرو گے تو یہ نہایت ہمت، حوصلے اور اولو العزمی کا کام ہے۔ چنانچہ آپ صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنہم ہمیشہ صبر اور تقویٰ سے کام لیتے رہے، حتیٰ کہ حالت جنگ میں بھی نہ ان کی طرح بد زبانی سے کام لیا اور نہ عملاً اس طرح زیادتی کی جس طرح انھوں نے کی تھی۔"
    },
    {
      "Ayah": 187,
      "tafsir": "(آیت 187)یعنی اہل کتاب سے یہ عہد لیا گیا تھا کہ ان کی کتابوں میں جو احکام دیے گئے ہیں اور نبی آخر الزماں صلی اللہ علیہ وسلم سے متعلق جو بشارتیں اور علامتیں بیان کی گئی ہیں، ان کا اعلانیہ اظہار کریں گے اور ان کو چھپانے کے جرم کا ارتکاب نہیں کریں گے، مگر انھوں نے دنیا طلبی میں پڑ کر اس عہد کی کوئی پروا نہ کی اور ان احکام کی بھی لفظی اور معنوی تحریف کی اور ان بشارتوں اور علامتوں کو چھپایا، «فَبِئْسَ مَا يَشْتَرُوْنَ» ’’سو برا ہے جو وہ خرید رہے ہیں۔‘‘ اس آیت میں ضمناً مسلمان علماء کو بھی یہ ہدایت کی گئی ہے کہ وہ حق بات کو جانتے بوجھتے ہوئے چھپانے کے جرم کا ارتکاب نہ کریں۔ حدیث میں متعدد سندوں سے رسول اللہ صلی اللہ علیہ وسلم کا یہ ارشاد مروی ہے : [ مَنْ سُئِلَ عَنْ عِلْمٍ فَكَتَمَهُ اُلْجِمَ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِّنْ نَّارٍ ] [ ترمذی، العلم، باب ما جاء فی کتمان العلم : ۲۶۴۹، عن أبی ھریرۃ رضی اللہ عنہ ] ’’جس سے علم کی کوئی بات پوچھی گئی اور اس نے اسے چھپایا تو قیامت کے دن اس کے منہ میں آگ کی لگام دی جائے گی۔‘‘"
    },
    {
      "Ayah": 188,
      "tafsir": "(آیت 188)یعنی جو کام انھوں نے کیے ہیں ان پر اتراتے چلے جاتے ہیں اور جو کام انھوں نے نہیں کیے ان کے متعلق بھی چاہتے ہیں کہ انھیں ان کے کارناموں میں شمار کیا جائے، ایسے لوگوں کے بارے میں ہرگز یہ خیال نہ کرو کہ وہ اللہ کی پکڑ اور اس کے عذاب سے چھوٹ جائیں گے۔ یہ آیت دراصل یہود اور منافقین کے حق میں نازل ہوئی ہے۔ چنانچہ ابن عباس رضی اللہ عنہما فرماتے ہیں کہ آپ صلی اللہ علیہ وسلم نے یہود سے کوئی بات دریافت کی تو انھوں نے اس کا غلط جواب دیا، پھر خوش ہوئے کہ ہم نے آپ صلی اللہ علیہ وسلم کو مطمئن کر دیا، اب انھیں ہماری تعریف کرنی چاہیے۔ [ بخاری، التفسیر، باب : «لا تحسبن الذین یفرحون بما أتوا» : ۴۵۶۸ ] ¤ ابو سعید خدری رضی اللہ عنہ بیان کرتے ہیں کہ جب کبھی رسول اللہ صلی اللہ علیہ وسلم جنگ کے لیے تشریف لے جاتے تو بعض منافقین آپ کے ساتھ نہ جاتے اور آپ کے جانے کے بعد ( اپنے گھروں میں) بیٹھے رہنے سے بہت خوش ہوا کرتے، پھر جب رسول اللہ صلی اللہ علیہ وسلم واپس تشریف لاتے تو عذر اور بہانے پیش کرتے اور (ان عذر بہانوں پر ) قسم کھاتے اور چاہتے کہ اس کام پر ان کی تعریف کی جائے جو انھوں نے نہیں کیا، چنانچہ اس سلسلے میں یہ آیت نازل ہوئی : «لَا تَحْسَبَنَّ الَّذِيْنَ يَفْرَحُوْنَ بِمَاۤ اَتَوْا وَّ يُحِبُّوْنَ اَنْ يُّحْمَدُوْا بِمَا لَمْ يَفْعَلُوْا» [بخاری، التفسیر، باب : «ولا تحسبن الذين يفرحون بما أتوا» : ۴۵۶۷ ] مگر یہ حکم اہل کتاب اور مسلمانوں کے لیے عام ہے، جو بھی خوشامد پسند ہو گا اور اس قسم کا ذہن رکھے گا کہ اس کے ناکردہ کارناموں پر اس کی تعریف کی جائے اس کے لیے وہ وعید ہے جو اس آیت میں مذکور ہے۔ (شوکانی)"
    },
    {
      "Ayah": 189,
      "tafsir": "(آیت 189) {وَ لِلّٰهِ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ … :} جب حقیقت یہ ہے کہ آسمان و زمین کی بادشاہت اللہ ہی کی ہے اور وہ ہر چیز پر پوری طرح قادر ہے تو یہ حقیقت اگر تم ہر وقت اپنے سامنے رکھو تو شاید ایک نافرمانی کی جرأت بھی نہ کر سکو۔"
    },
    {
      "Ayah": 190,
      "tafsir": "(آیت 190) ➊ {اِنَّ فِيْ خَلْقِ السَّمٰوٰتِ وَ الْاَرْضِ …:} اس آیت سے آخر سورت تک آیات کی بڑی فضیلت ہے۔ رسول اللہ صلی اللہ علیہ وسلم رات کو تہجد کے لیے اٹھتے تو ان آیات کی تلاوت کیا کرتے تھے۔ [ بخاری، التفسیر، باب : «ربنا إنک من تدخل النار» : ۴۵۷۰، ۴۵۷۱، عن ابن عباس رضی اللہ عنہما ] ¤ ➋ {لَاٰيٰتٍ لِّاُولِي الْاَلْبَابِ: ”الْاَلْبَابِ“ } یہ {’’ لُبٌّ ‘‘} کی جمع ہے، جس کا معنی خالص عقل ہے، اس لیے ترجمہ ’’ عقلوں والوں‘‘ کیا ہے۔ یعنی جو لوگ زمین و آسمان کی تخلیق اور کائنات کے دیگر اسرار و رموز پر غور کرتے ہیں، انھیں کائنات کے خالق اور اس کے اصل فرماں روا کی پہچان ہو جاتی ہے اور وہ سمجھ جاتے ہیں کہ اتنی طویل و عریض کائنات کا یہ لگا بندھا نظام، جس میں ذرا خلل واقع نہیں ہوتا، یقینا اس کے پیچھے ایک ذات ہے جو اسے چلا رہی ہے اور وہ ہے اللہ کی ذات۔ اس میں عقلوں والوں کے لیے اللہ تعالیٰ کی توحید اور اکیلے مالک ہونے کی، اللہ تعالیٰ کی حکمت اور کاریگری کی اور اللہ تعالیٰ کی قدرت اور حاکمیت کی بہت سی نشانیاں ہیں۔ ¤ نظام فلکی اور اس کی تفصیلات، چاند سورج، ستاروں کی تعداد، ان کے درمیانی فاصلے، ان کے باہمی تعلقات و تاثرات، ان کی گردشوں کی پیمائش، گرہن کے اسباب و اوقات، ان کے طلوع و غروب اور نور و حرارت وغیرہ کے قاعدے و ضابطے، غرض اس قسم کی تفصیلات سے علم ہیئت کی کتابوں کے دفتر کے دفتر بھرے پڑے ہیں۔ رہی زمین تو اس کی شکل و صورت، اس کی پیمائش، اس کے پہاڑ اور سمندر، اس کی معدنیات، اس کی کشش، اس کی ہوا ؤ ں اور موسموں کے تغیرات وغیرہ کے لیے تو کوئی ایک فن بھی پوری طرح کافی نہ ہوا، بلکہ جغرافیہ، جغرافیہ طبعی، جیالوجی، فزیالوجی، میٹرالوجی اور آرکیالوجی، اللہ جانے کتنے فنون پر فنون نکلتے چلے آ رہے ہیں اور اللہ تعالیٰ کی حکمت اور اس کی کاریگر ی کے اندازے اور تخمینے ختم ہونے میں نہیں آ رہے۔ اب {”اُوْلُوْا الْاَلْبَابِ“} کے بجائے غیر مسلم قومیں ان چیزوں پر غور میں مصروف ہیں اور چونکہ ان کا ہدف ہی دنیا ہے، اس لیے دنیا کے بے شمار فائدے حاصل کر رہے ہیں، بلکہ انھی فنون کے ذریعے سے انھوں نے مسلمانوں کو مغلوب کر رکھا ہے، ہدف کی غلطی کی وجہ سے انھیں ذات باری تعالیٰ کی وحدانیت کو سمجھنے کی توفیق نہیں ہوئی۔ کاش! مسلمان ان فنون میں پوری طرح حصہ لیتے تو یہ سارے علوم دین کی سربلندی اور توحید کی دعوت کا زبردست ذریعہ بنتے اور دنیا پر غلبے کے کام آتے، کیونکہ مسلمان تو «رَبَّنَاۤ اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَّ فِي الْاٰخِرَةِ حَسَنَةً وَّ قِنَا عَذَابَ النَّارِ  » کا ہدف سامنے رکھتا ہے۔"
    },
    {
      "Ayah": 191,
      "tafsir": "(آیت 191) ➊ {الَّذِيْنَ يَذْكُرُوْنَ اللّٰهَ …:} پچھلی آیت میں اللہ تعالیٰ کے ہر چیز کے خالق اور رب ہونے کا ذکر تھا، اب اس اکیلے کی عبادت کا ذکر ہے، یعنی وہ {”أُوْلُوا الْاَلْبَابِ“} دل، زبان اور دوسرے سب اعضا سے کھڑے، بیٹھے اور لیٹے ہوئے ہر حالت میں اللہ کو یاد کرتے ہیں۔ روزی کماتے وقت اللہ کے حکم کا خیال رکھنا بھی اس کی یادہے، عدالت کی کرسی پر بیٹھ کر اسے نہ بھولنا بھی یاد ہے، نظر کو بے لگام نہ ہونے دینا بھی اس کا ذکر ہے، اسلام کی سر بلندی کے لیے جہاد کی تیاری میں مصروف ہونا بھی اس کی یاد ہے۔ افسوس کہ مسلمانوں نے صرف نماز اور تسبیح و تحمید کو ذکر سمجھ لیا اور اللہ کی جس یاد اور ملاقات کے شوق سے صحابہ و تابعین کے سینے روشن تھے اور وہ موت کو موت کی جگہوں میں ڈھونڈتے پھرتے تھے، اس کو اپنے شب و روز سے نکال دیا، حالانکہ یہ ذکر اسلام کے بنیادی ارکان کے بعد تمام اذکار سے کہیں افضل ہے۔ فرمایا : «اَجَعَلْتُمْ سِقَايَةَ الْحَآجِّ وَ عِمَارَةَ الْمَسْجِدِ الْحَرَامِ كَمَنْ اٰمَنَ بِاللّٰهِ وَ الْيَوْمِ الْاٰخِرِ وَ جٰهَدَ فِيْ سَبِيْلِ اللّٰهِ لَا يَسْتَوٗنَ عِنْدَ اللّٰهِ» [التوبۃ : ۱۹ ] ’’کیا تم نے حاجیوں کو پانی پلانا اور مسجد حرام کو آباد کرنا اس جیسا بنا دیا جو اللہ اور یوم آخرت پر ایمان لایا اور اس نے اللہ کے راستے میں جہاد کیا، یہ اللہ کے ہاں براببر نہیں ہیں۔‘‘ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَوْقِفُ سَاعَةٍ فِيْ سَبِيْلِ اللّٰهِ خَيْرٌ مِّنْ قِيَامِ لَيْلَةِ الْقَدْرِ عِنْدَ الْحَجَرِ الْاَسْوَدِ ]] ’’ ایک گھڑی اللہ کے راستے ( جہاد) میں رہنا حجر اسود کے پاس لیلۃ القدر کے قیام سے افضل ہے۔ ‘‘ [ابن حبان : ۴۶۰۳ و صححہ الألبانی، الصحیحۃ : ۴۵۸۴ ] ¤ ➋ {وَ يَتَفَكَّرُوْنَ فِيْ خَلْقِ السَّمٰوٰتِ وَ الْاَرْضِ:} یعنی زمین و آسمان کو پیدا کرنے میں اللہ تعالیٰ نے جو حکمت رکھی ہے وہ اس پر غور و فکر کرتے ہیں۔ علوم ہیئت فلکیات اور ریاضی کو اگر دینی نقطۂ نظر سے پڑھا جائے تو فی الجملہ عبادت میں داخل ہے۔ ¤ ➌ {رَبَّنَا مَا خَلَقْتَ هٰذَا بَاطِلًا:} یعنی بے مقصد نہیں بنایا، بلکہ اس عالم کی انتہا دوسرے عالم میں ہو رہی ہے، جس میں حساب کتاب ہو گا۔(موضح) اس میں مادہ پرستوں اور دہریوں کا رد ہے جو کائنات کو محض اتفاق کا نتیجہ سمجھتے ہیں، یعنی غور و فکر سے ان پر یہ حقیقت کھلتی ہے کہ کائنات کا یہ سارا نظام یونہی پیدا نہیں کیا، بلکہ اس کے پیچھے یہ مقصد کارفرما ہے کہ انسان دنیا میں اللہ تعالیٰ کے احکام کے مطابق زندگی بسر کرے تو اجر و ثواب پائے اور نافرمانی کرے تو آخرت میں عذاب بھگتے، اس لیے وہ آگ سے محفوظ رہنے کی دعا کرتے رہتے ہیں۔"
    },
    {
      "Ayah": 192,
      "tafsir": ""
    },
    {
      "Ayah": 193,
      "tafsir": "(آیت 193) ➊ {رَبَّنَاۤ اِنَّنَا سَمِعْنَا مُنَادِيًا … : ”مُنَادِيًا“} سے مراد رسول اللہ صلی اللہ علیہ وسلم ہیں یا قرآن یا پھر ہر وہ شخص مراد ہو سکتا ہے جو دعوتِ حق پیش کرے۔ ¤ ➋ {رَبَّنَا فَاغْفِرْ لَنَا ذُنُوْبَنَا:} اس میں اپنے ایمان لانے کے عمل کے وسیلے سے گناہوں کی مغفرت کی دعا ہے اور یہ مسنون ہے۔"
    },
    {
      "Ayah": 194,
      "tafsir": "(آیت 194) ➊ {رَبَّنَا وَ اٰتِنَا مَا وَعَدْتَّنَا :} یعنی تو نے ہم سے اپنے رسولوں کے ذریعے سے ان کی تصدیق اور اتباع کرنے پر دنیا اور آخرت میں جس نصرت اور اجر و ثواب کا وعدہ فرمایا ہے، وہ ہمیں عطا فرما۔ ¤ ➋ {اِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ:} یعنی ہمیں یہ ڈر تو نہیں کہ تو وعدہ خلافی کرے گا، بلکہ ہمیں ڈر اپنے ہی اعمال سے ہے کہ یہ اچھے نہیں ہیں، کہیں ہماری رسوائی کا باعث نہ بنیں، اگر تو اپنی رحیمی و کریمی اور غفاری سے ہماری کوتاہیوں کو معاف فرما دے اور ہمیں رسوائی سے بچا لے تو ہماری عین سرفرازی اور تیری بندۂ نوازی ہے۔ پس کلمہ « اِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ» سے مقصد عاجزی، خشوع اور بندگی کا اظہار ہے نہ کہ اس کا مطالبہ، کیونکہ اللہ تعالیٰ سے وعدہ خلافی تو محال ہے، پھر مومن اس کا تصور کیسے کر سکتے ہیں۔ (رازی) دعا اور اس کی قبولیت کا یہ وعدہ ایمان اور عمل صالح پر ہے، دعا میں اس کا وسیلہ بھی پیش کر سکتے ہیں، جیسا کہ غار میں پھنس جانے والے تین آدمیوں نے کیا تھا، البتہ دعا کی قبولیت کے لیے کسی نیک ہستی کو وسیلہ بنانا کہ یا اللہ! فلاں کے طفیل میری یہ مشکل حل فرما دے، قرآن و حدیث میں مذکور دعا ؤ ں کے خلاف ہے۔ ہاں، کسی زندہ آدمی سے دعا کروائی جا سکتی ہے اور یہ سنت سے ثابت ہے۔"
    },
    {
      "Ayah": 195,
      "tafsir": "(آیت 195) ➊ {فَاسْتَجَابَ لَهُمْ رَبُّهُمْ …:} یعنی انھوں نے اس طرح دعا کی تو اللہ تعالیٰ نے ان کی دعا قبول فرما لی۔ پھر ان کی دعا کی قبولیت کی صورت اور کیفیت کا بھی ذکر فرما دیا کہ باری تعالیٰ کسی عامل کے عمل کو ضائع نہیں کرتا۔ اس میں مرد و عورت کا بھی کوئی فرق نہیں، کیونکہ ان کا بعض بعض سے ہے، وہ کوئی الگ الگ مخلوق نہیں ہیں۔ اخروی نجات اور اللہ کے ہاں درجات حاصل کرنے میں مرد و عورت دونوں برابر ہیں، ہاں، مرد و عورت کی جداگانہ ذمہ داریوں کے اعتبار سے فطرتاً ان کی صلاحیتوں میں فرق ہے۔ دیکھیے سورۂ نساء (۳۲، ۳۴)۔ ¤ ➋ {فَالَّذِيْنَ هَاجَرُوْا … :} یعنی جنھوں نے دین کی خاطر اپنی خوشی سے ہجرت کی، اپنے وطن اور مال و منال کو خیر باد کہہ کر مرکز اسلامی میں پہنچ گئے اور وہ لوگ جن پر کفار نے ظلم و ستم ڈھائے، انھیں سخت اذیتیں دے کر گھر بار چھوڑنے پر مجبور کر دیا، انھیں کسی طرح چین سے نہ بیٹھنے دیا اور انھیں محض اس لیے تکالیف کا نشانہ بنایا کہ انھوں نے دین اسلام کی راہ اختیار کی، جیساکہ دوسرے مقام پر فرمایا : «يُخْرِجُوْنَ الرَّسُوْلَ وَ اِيَّاكُمْ اَنْ تُؤْمِنُوْا بِاللّٰهِ رَبِّكُمْ» [ الممتحنۃ : ۱ ] ’’یہ کافر پیغمبر ( صلی اللہ علیہ وسلم ) کو اور تمھیں گھروں سے محض اس جرم کی پاداش میں نکالتے ہیں کہ ہ تم اپنے رب پر ایمان رکھتے ہو۔‘‘ نیز فرمایا : «وَ مَا نَقَمُوْا مِنْهُمْ اِلَّاۤ اَنْ يُّؤْمِنُوْا بِاللّٰهِ الْعَزِيْزِ الْحَمِيْدِ» [ البروج : ۸ ] ’’اور انھوں نے ان سے اس کے سوا کسی چیز کا بدلہ نہیں لیا کہ وہ اس اللہ پر ایمان رکھتے ہیں جو سب پر غالب ہے ہر تعریف کے لائق ہے۔‘‘"
    },
    {
      "Ayah": 196,
      "tafsir": "(آیت196تا198) {لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِيْنَ كَفَرُوْا … :} اوپر کی آیات میں مومنوں کے گناہ بخشنے اور ثواب عظیم کا وعدہ فرمایا، حالانکہ وہ فقر و فاقہ کی حالت میں زندگی بسر کر رہے تھے۔ ان کے بالمقابل کفار نہایت عیش و نعمت میں تھے، انھیں دیکھ کر بعض اوقات مسلمان غلط فہمیوں کا شکار ہو جاتے اور مختلف خیالات کی دنیا میں چلے جاتے، لہٰذا ان آیات میں مسلمانوں کا ذہن صاف کرنے کے لیے کفار کا انجام بیان فرمایا اور مسلمانوں کو تسلی دی ہے۔ انس بن مالک رضی اللہ عنہ بیان فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نیکی کے معاملہ میں مومن کے ساتھ نا انصافی نہیں کرتا، اسے اس نیکی کا بدلہ دنیا میں بھی دیتا ہے اور آخرت میں بھی اور کافر جو نیکیاں اللہ کے لیے کرتا ہے اس کا بدلہ اسے دنیا ہی میں پورا دے دیا جاتا ہے، پھر جب وہ آخرت میں پہنچے گا تو اس کی کوئی نیکی باقی نہیں ہو گی کہ اس کا بدلہ اسے دیا جائے۔‘‘ [ مسلم، صفات المنافقین، باب جزاء المؤمن… : ۲۸۰۸ ] مقصد یہ ہے کہ شہروں میں کفار کے تجارتی کاروبار، ان کی خوش حالی اور مال و دولت کی فراوانی کو دیکھ کر مسلمانوں کے دلوں میں کسی قسم کا حزن و غم نہیں آنا چاہیے، نہ ان کو نا امیدی کا شکار ہونا چاہیے، نہ منافقین کا سا طرزِ عمل اختیار کرنا چاہیے، جو سختی اور خوف کے وقت پکار اٹھتے ہیں : « مَا وَعَدَنَا اللّٰهُ وَ رَسُوْلُهٗۤ اِلَّا غُرُوْررًا» [ الأحزاب : ۱۲ ] ’’اللہ اور اس کے رسول نے ہم سے محض دھوکا دینے کے لیے وعدہ کیا تھا۔‘‘ کفار کی دنیوی خوشحالی سے کفر کے حق ہونے پر استدلال نہیں کرنا چاہیے، یہ چند روزہ زندگی کا قلیل سا سامان اور عارضی بہار ہے، مرنے کے بعد ان کا ٹھکانا جہنم ہے اور وہ نہایت برا ٹھکانا ہے۔ اس کے مخاطب بظاہر تو رسول اللہ صلی اللہ علیہ وسلم ہیں مگر مراد امت ہے۔ اس کے بعد اگلی آیت میں مومنین کی جزا کا ذکر فرمایا، تاکہ مزید تشفی حاصل ہو اور یہ چونکہ کفار کے مقابلے میں بیان کی جا رہی ہے، اس لیے {’’ لٰكِنِ ‘‘} کا لفظ بطور استدراک ذکر فرمایا۔ (المنار)"
    },
    {
      "Ayah": 197,
      "tafsir": "(آیت196تا198) {لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِيْنَ كَفَرُوْا … :} اوپر کی آیات میں مومنوں کے گناہ بخشنے اور ثواب عظیم کا وعدہ فرمایا، حالانکہ وہ فقر و فاقہ کی حالت میں زندگی بسر کر رہے تھے۔ ان کے بالمقابل کفار نہایت عیش و نعمت میں تھے، انھیں دیکھ کر بعض اوقات مسلمان غلط فہمیوں کا شکار ہو جاتے اور مختلف خیالات کی دنیا میں چلے جاتے، لہٰذا ان آیات میں مسلمانوں کا ذہن صاف کرنے کے لیے کفار کا انجام بیان فرمایا اور مسلمانوں کو تسلی دی ہے۔ انس بن مالک رضی اللہ عنہ بیان فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نیکی کے معاملہ میں مومن کے ساتھ نا انصافی نہیں کرتا، اسے اس نیکی کا بدلہ دنیا میں بھی دیتا ہے اور آخرت میں بھی اور کافر جو نیکیاں اللہ کے لیے کرتا ہے اس کا بدلہ اسے دنیا ہی میں پورا دے دیا جاتا ہے، پھر جب وہ آخرت میں پہنچے گا تو اس کی کوئی نیکی باقی نہیں ہو گی کہ اس کا بدلہ اسے دیا جائے۔‘‘ [ مسلم، صفات المنافقین، باب جزاء المؤمن… : ۲۸۰۸ ] مقصد یہ ہے کہ شہروں میں کفار کے تجارتی کاروبار، ان کی خوش حالی اور مال و دولت کی فراوانی کو دیکھ کر مسلمانوں کے دلوں میں کسی قسم کا حزن و غم نہیں آنا چاہیے، نہ ان کو نا امیدی کا شکار ہونا چاہیے، نہ منافقین کا سا طرزِ عمل اختیار کرنا چاہیے، جو سختی اور خوف کے وقت پکار اٹھتے ہیں : « مَا وَعَدَنَا اللّٰهُ وَ رَسُوْلُهٗۤ اِلَّا غُرُوْررًا» [ الأحزاب : ۱۲ ] ’’اللہ اور اس کے رسول نے ہم سے محض دھوکا دینے کے لیے وعدہ کیا تھا۔‘‘ کفار کی دنیوی خوشحالی سے کفر کے حق ہونے پر استدلال نہیں کرنا چاہیے، یہ چند روزہ زندگی کا قلیل سا سامان اور عارضی بہار ہے، مرنے کے بعد ان کا ٹھکانا جہنم ہے اور وہ نہایت برا ٹھکانا ہے۔ اس کے مخاطب بظاہر تو رسول اللہ صلی اللہ علیہ وسلم ہیں مگر مراد امت ہے۔ اس کے بعد اگلی آیت میں مومنین کی جزا کا ذکر فرمایا، تاکہ مزید تشفی حاصل ہو اور یہ چونکہ کفار کے مقابلے میں بیان کی جا رہی ہے، اس لیے {’’ لٰكِنِ ‘‘} کا لفظ بطور استدراک ذکر فرمایا۔ (المنار)"
    },
    {
      "Ayah": 198,
      "tafsir": "(آیت196تا198) {لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِيْنَ كَفَرُوْا … :} اوپر کی آیات میں مومنوں کے گناہ بخشنے اور ثواب عظیم کا وعدہ فرمایا، حالانکہ وہ فقر و فاقہ کی حالت میں زندگی بسر کر رہے تھے۔ ان کے بالمقابل کفار نہایت عیش و نعمت میں تھے، انھیں دیکھ کر بعض اوقات مسلمان غلط فہمیوں کا شکار ہو جاتے اور مختلف خیالات کی دنیا میں چلے جاتے، لہٰذا ان آیات میں مسلمانوں کا ذہن صاف کرنے کے لیے کفار کا انجام بیان فرمایا اور مسلمانوں کو تسلی دی ہے۔ انس بن مالک رضی اللہ عنہ بیان فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ نیکی کے معاملہ میں مومن کے ساتھ نا انصافی نہیں کرتا، اسے اس نیکی کا بدلہ دنیا میں بھی دیتا ہے اور آخرت میں بھی اور کافر جو نیکیاں اللہ کے لیے کرتا ہے اس کا بدلہ اسے دنیا ہی میں پورا دے دیا جاتا ہے، پھر جب وہ آخرت میں پہنچے گا تو اس کی کوئی نیکی باقی نہیں ہو گی کہ اس کا بدلہ اسے دیا جائے۔‘‘ [ مسلم، صفات المنافقین، باب جزاء المؤمن… : ۲۸۰۸ ] مقصد یہ ہے کہ شہروں میں کفار کے تجارتی کاروبار، ان کی خوش حالی اور مال و دولت کی فراوانی کو دیکھ کر مسلمانوں کے دلوں میں کسی قسم کا حزن و غم نہیں آنا چاہیے، نہ ان کو نا امیدی کا شکار ہونا چاہیے، نہ منافقین کا سا طرزِ عمل اختیار کرنا چاہیے، جو سختی اور خوف کے وقت پکار اٹھتے ہیں : « مَا وَعَدَنَا اللّٰهُ وَ رَسُوْلُهٗۤ اِلَّا غُرُوْررًا» [ الأحزاب : ۱۲ ] ’’اللہ اور اس کے رسول نے ہم سے محض دھوکا دینے کے لیے وعدہ کیا تھا۔‘‘ کفار کی دنیوی خوشحالی سے کفر کے حق ہونے پر استدلال نہیں کرنا چاہیے، یہ چند روزہ زندگی کا قلیل سا سامان اور عارضی بہار ہے، مرنے کے بعد ان کا ٹھکانا جہنم ہے اور وہ نہایت برا ٹھکانا ہے۔ اس کے مخاطب بظاہر تو رسول اللہ صلی اللہ علیہ وسلم ہیں مگر مراد امت ہے۔ اس کے بعد اگلی آیت میں مومنین کی جزا کا ذکر فرمایا، تاکہ مزید تشفی حاصل ہو اور یہ چونکہ کفار کے مقابلے میں بیان کی جا رہی ہے، اس لیے {’’ لٰكِنِ ‘‘} کا لفظ بطور استدراک ذکر فرمایا۔ (المنار)"
    },
    {
      "Ayah": 199,
      "tafsir": "(آیت 199) {وَ اِنَّ مِنْ اَهْلِ الْكِتٰبِ … : } اس آیت میں اہل کتاب (یہود و نصاریٰ) کے اس گروہ کا ذکر ہے جو سچے دل سے مسلمان ہو گئے تھے، ان کے ایمان اور ایمانی صفات کا ذکر فرما کر اللہ تعالیٰ نے انھیں دوسرے اہل کتاب سے ممتاز فرما دیا کہ یہ لوگ اللہ تعالیٰ پر ایمان لاتے ہیں، پہلی کتابوں اور قرآن مجید پر ایمان لاتے ہیں، اللہ سے ڈرنے والے ہیں، اللہ کی آیات کے بدلے دنیاوی مفاد حاصل نہیں کرتے، ان کے لیے اللہ کے ہاں ان کا اجر محفوظ ہے، بلکہ دوہرا اجر ہے، جیسا کہ سورۂ حدید (۲۸) میں ہے۔ یہ صفات یہود میں بہت کم تھیں۔ علمائے یہود میں سے عبد اللہ بن سلام رضی اللہ عنہ جیسے ان صفات کے حامل چند لوگ ہی تھے، جن کی تعداد دس سے زیادہ نہ تھی، البتہ نصرانیوں میں سے بہت سے لوگوں نے ایمان قبول کیا، جن میں حبشہ کے بادشاہ اصحمہ نجاشی بھی شامل تھے، ان کی موت کی خبر آنے پر رسول اللہ صلی اللہ علیہ وسلم نے مدینہ میں ان پر غائبانہ نماز جنازہ پڑھائی۔ [ بخاری، مناقب الأنصار، باب موت النجاشی : ۳۸۷۷، عن جابر رضی اللہ عنہ ]"
    },
    {
      "Ayah": 200,
      "tafsir": "(آیت 200) { ”اصْبِرُوْا“ } یعنی دین اسلام پر ثابت قدمی سے جمے رہو۔ { ”صَابِرُوْا“ } یہ باب مفاعلہ سے ہے جس میں مقابلہ کا معنی پایا جاتا ہے، یعنی کافروں کے مقابلے میں ان سے بڑھ کر پامردی اور ثابت قدمی کا مظاہرہ کرو۔ {”وَ رَابِطُوْا“} یعنی دشمنوں سے جہاد کے مورچوں پر ڈٹے رہو۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ کے راستے میں ایک دن سرحدوں پر پہرا دینا دنیا اور دنیا میں جو کچھ موجود ہے، اس سب سے بہتر ہے۔‘‘ [ بخاری، الجہاد والسیر، باب فضل رباط یوم فی سبیل اللہ : ۲۸۹۲، عن سہل بن سعد رضی اللہ عنہ ] اور آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ کے راستے میں ایک دن اور ایک رات کا پہرا دینا ایک مہینے کے قیام اور صیام سے بہترہے اور اگر اس حالت میں مجاہد فوت ہو گیا تو اس کا وہ عمل جاری رہے گا جو وہ کیا کرتا تھا اور اس کے مطابق اس کا رزق بھی جاری رہے گا، نیز وہ آزمائش سے بھی محفوظ رہے گا۔‘‘ [ مسلم، الإمارۃ، باب فضل الرباط فی سبیل اللہ عز وجل : ۱۹۱۳، عن سلمان الفارسی رضی اللہ عنہ ] ¤ احادیث میں سختی اور تکلیف کے اوقات میں پوری طرح وضو کرنے، مسجد کی طرف چل کر آنے اور پھر ایک نماز کے بعد دوسری نماز کے انتظار کو بھی آپ صلی اللہ علیہ وسلم نے {’’رِبَاطٌ ‘‘} فرمایا ہے۔ [ مسلم، الطہارۃ، باب فضل إسباغ الوضوء علی المکارہ : ۲۵۱ ] ابن کثیر رحمہ اللہ نے اس مقام پر اللہ کی راہ میں مورچہ بند ہونے اور پہرا دینے کی بہت سی احادیث جمع فرمائی ہیں۔ [ فَجَزَاہُ اللّٰہُ خَیْرًا ]"
    }
  ]
}