{
  "surah": "Luqman",
  "surah_number": 31,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 2،1){ الٓمّٓ (1) تِلْكَ اٰيٰتُ الْكِتٰبِ الْحَكِيْمِ:} اس کی تفسیر کے لیے دیکھیے سورۂ یونس کی پہلی آیت کی تفسیر۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2،1){ الٓمّٓ (1) تِلْكَ اٰيٰتُ الْكِتٰبِ الْحَكِيْمِ:} اس کی تفسیر کے لیے دیکھیے سورۂ یونس کی پہلی آیت کی تفسیر۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3تا5) {هُدًى وَّ رَحْمَةً لِّلْمُحْسِنِيْنَ …:} ان آیات کی تفسیر کے لیے دیکھیے سورۂ بقرہ کی آیات (۲ تا ۵) کی تفسیر۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 3تا5) {هُدًى وَّ رَحْمَةً لِّلْمُحْسِنِيْنَ …:} ان آیات کی تفسیر کے لیے دیکھیے سورۂ بقرہ کی آیات (۲ تا ۵) کی تفسیر۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 3تا5) {هُدًى وَّ رَحْمَةً لِّلْمُحْسِنِيْنَ …:} ان آیات کی تفسیر کے لیے دیکھیے سورۂ بقرہ کی آیات (۲ تا ۵) کی تفسیر۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 7،6) ➊ {وَ مِنَ النَّاسِ مَنْ يَّشْتَرِيْ لَهْوَ الْحَدِيْثِ …:} محسنین کے اوصاف اور ان کے حسنِ انجام کے ذکر کے بعد ان بدنصیبوں کا ذکر فرمایا جن کے لیے {’’ عَذَابٌ مُّهِيْنٌ ‘‘} یعنی ذلیل کرنے والا عذاب تیار ہے۔ {’’ لَهْوَ ‘‘} کا لفظی معنی ’’غافل کر دینا‘‘ ہے، جیسا کہ فرمایا : «{ لَا تُلْهِكُمْ اَمْوَالُكُمْ وَ لَاۤ اَوْلَادُكُمْ عَنْ ذِكْرِ اللّٰهِ }» [ المنافقون : ۹ ] ’’تمھارے اموال اور تمھاری اولاد تمھیں اللہ کے ذکر سے غافل نہ کر دیں۔‘‘ {’’ لَهْوَ ‘‘} ہر اس بات یا کام کو کہتے ہیں جو انسان کو اس کے مقصد کی چیز سے غافل کر دے۔ شیخ عبدالرحمان السعدی اس آیت کی تفسیر میں فرماتے ہیں : {’’ وَ مِنَ النَّاسِ ‘‘} لوگوں میں سے کوئی ایسا بد نصیب اور بے توفیق بھی ہے، {’’ مَنْ يَّشْتَرِيْ ‘‘} جو اس طرح رغبت رکھتا اور پسند کرتا ہے جیسے قیمت خرچ کر کے حاصل کرنے والا پسند کرتا ہے، {’’ لَهْوَ الْحَدِيْثِ ‘‘} ان باتوں کو جو دلوں کو غافل کر دینے والی اور عظیم مقصد سے روک دینے والی ہوتی ہیں۔ چنانچہ اس میں ہر حرام کلام، ہر باطل اور ایسے اقوال پر مشتمل ہر ہذیان داخل ہے جو کفر، فسق اور معصیت کی رغبت پیدا کرے، وہ اقوال حق کو رد کرنے والے لوگوں کے ہوں، جو باطل کے ساتھ بحث کر کے حق کو زیر کرنے کی کوشش کرتے ہیں، غیبت، چغلی، جھوٹ اور گالی گلوچ کی صورت میں ہوں یا گانے بجانے، شیطان کے باجوں اور غافل کر دینے والی داستانوں اور افسانوں کی صورت میں ہوں، جن کا نہ دنیا میں کوئی فائدہ ہو نہ آخرت میں۔ تو لوگوں کی یہ قسم وہ ہے جو ہدایت والی بات چھوڑ کر {’’ لَهْوَ ‘‘} والی بات خریدتی ہے۔‘‘ ¤ ➋ میں نے شیخ عبد الرحمن السعدی کا کلام اس لیے نقل کیا ہے کہ عام طور پر اس آیت میں {’’ لَهْوَ الْحَدِيْثِ ‘‘} سے مراد صرف گانا بجانا لیا جاتا ہے، جب کہ آیت کا مفہوم اس سے بہت وسیع ہے، اگرچہ حرام غنا (ناجائز گانا) بھی اس میں شامل ہے۔ طبری میں عبد اللہ بن مسعود رضی اللہ عنہ سے جو حسن سند کے ساتھ ثابت ہے کہ انھوں نے قسم کھا کر فرمایا کہ اس سے مراد غنا (گانا) ہے، تو یہ {’’ لَهْوَ الْحَدِيْثِ ‘‘} کی ایک جزئی کا بیان ہے۔ یہاں یہ بات ذہن میں رکھنا ضروری ہے کہ اس کا مصداق ایسے گانے بجانے والے ہوں گے جو دین سے روکنے والے، اللہ تعالیٰ کی آیات کو مذاق بنانے والے اور انھیں سن کر تکبر سے منہ پھیرنے والے ہوں، کیونکہ ان اوصاف کی ان آیات میں صراحت ہے، اور یہ اوصاف کفار کے ہیں مسلمانوں کے نہیں اور انھی کے لیے ذلیل کرنے والا عذاب ہے۔ مسلمان کو ہونے والا عذاب تو اسے گناہوں سے پاک کرنے کے لیے ہو گا۔ البتہ اس حقیقت سے انکار ممکن نہیں کہ مسلمان کہلانے والے لوگ جو حرام عشقیہ گانے بجانے کو اپنا پیشہ یا شغل بنا لیتے ہیں، اس کے نتیجے میں ان کے دلوں میں بدترین نفاق پیدا ہو جاتا ہے اور اللہ کی آیات کو سن کر ان کے ساتھ ان کا رویہ بھی بعینہٖ وہی ہوتا ہے جو ان آیات میں مذکور ہے۔ یہ لوگ اللہ کی آیات کا مذاق اڑانے کے لیے مولوی کا مذاق اڑاتے اور اسے گالی دیتے ہیں، جب کہ ظاہر ہے کہ مولوی بے چارے کا قصور یہ ہے کہ وہ اللہ کی آیات سناتا ہے۔ ایسی صورت میں صرف نام کے مسلمان ہونے کا اللہ تعالیٰ کے ہاں کچھ فائدہ نہ ہو گا۔ اللہ کی آیات کے انکار، ان سے استکبار اور ان کو مذاق بنانے کے ساتھ مسلمانی کے دعوے پر اصرار قیامت کے دن ان کے کسی کام نہ آئے گا۔ افسوس! اس وقت یہ بیماری بری طرح امتِ مسلمہ میں پھیل چکی ہے۔ ریڈیو، ٹیلی ویژن، موبائل فون، انٹرنیٹ، غرض ہر ذریعے سے کفار اور ان کے نام نہاد مسلم گماشتوں نے اسے اس قدر پھیلا دیا ہے کہ کم ہی کوئی خوش نصیب اس سے بچا ہو گا۔ حالانکہ دین کے کمال و زوال کے علاوہ دنیوی عروج و زوال میں بھی اس کا بہت بڑا حصہ ہے۔ اقبال نے چند لفظو ں میں اس کا نقشہ کھینچا ہے: ¤ میں تجھ کو بتاتا ہوں تقدیر امم کیا ہے ¤ شمشیر و سناں اول، طاؤس و رباب آخر ¤ کوئی شخص اگر حرام گانے بجانے کا عمل گناہ سمجھ کر کرے، اس پر نادم ہو تو پھر بھی معافی کی امید ہے، مگر جب کوئی قوم فنون لطیفہ یا روح کی غذا کا نام دے کر اسے حلال ہی کرلے، تو اس کے لیے اللہ کے عذاب کے کوڑے سے بچنا بہت ہی مشکل ہے۔ ابو عامر یا ابو مالک اشعری رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَيَكُوْنَنَّ مِنْ أُمَّتِيْ أَقْوَامٌ يَسْتَحِلُّوْنَ الْحِرَ وَالْحَرِيْرَ وَالْخَمْرَ وَالْمَعَازِفَ ، وَلَيَنْزِلَنَّ أَقْوَامٌ إِلٰی جَنْبِ عَلَمٍ يَرُوْحُ عَلَيْهِمْ بِسَارِحَةٍ لَّهُمْ، يَأْتِيْهِمْ، يَعْنِي الْفَقِيْرَ، لِحَاجَةٍ فَيَقُوْلُوْا ارْجِعْ إِلَيْنَا غَدًا فَيُبَيِّتُهُمُ اللّٰهُ وَيَضَعُ الْعَلَمَ ، وَيَمْسَخُ آخَرِيْنَ قِرَدَةً وَخَنَازِيْرَ إِلٰی يَوْمِ الْقِيَامَةِ ] [ بخاري، الأششربۃ، باب ما جاء فیمن یستحل الخمر… : ۵۵۹۰ ] ’’میری امت میں کئی لوگ ہوں گے جو شرم گاہ (زنا) اور ریشم اور شراب اور باجوں کو حلال کر لیں گے اور کئی لوگ ایک پہاڑ کے پہلو میں اتریں گے، ان کے چرواہے شام کو ان کے چرنے والے مویشی لایا کریں گے، ان کے پاس فقیر اپنی حاجت کے لیے آئے گا، وہ کہیں گے کل آنا۔ تورات ہی کو اللہ تعالیٰ ان پر اپنا عذاب بھیجے گا اور وہ پہاڑ ان پر گرا دے گا اور کئی دوسروں کی شکلیں قیامت تک کے لیے بندروں اور خنزیروں کی شکل میں بدل دے گا۔‘‘ ابو مالک اشعری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيَشْرَبَنَّ نَاسٌ مِّنْ أُمَّتِي الْخَمْرَ يُسَمُّوْنَهَا بِغَيْرِ اسْمِهَا، يُعْزَفُ عَلٰی رُؤُوْسِهِمْ بِالْمَعَازِفِ وَالْمُغَنِّيَاتِ يَخْسِفُ اللّٰهُ بِهِمُ الْأَرْضَ وَيَجْعَلُ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيْرَ ] [ ابن ماجہ، الفتن، باب العقوبات : ۴۰۲۰، و قال الألباني صحیح ] ’’میری امت کے کچھ لوگ شراب پییں گے، اس کا نام اصل نام کے بجائے اور رکھ لیں گے، ان کے سامنے باجے بجائے جائیں گے اور گانے والیاں گائیں گی۔ اللہ تعالیٰ انھیں زمین میں دھنسا دے گا اور ان میں سے بعض کو بندر اور خنزیر بنا دے گا۔‘‘"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7،6) ➊ {وَ مِنَ النَّاسِ مَنْ يَّشْتَرِيْ لَهْوَ الْحَدِيْثِ …:} محسنین کے اوصاف اور ان کے حسنِ انجام کے ذکر کے بعد ان بدنصیبوں کا ذکر فرمایا جن کے لیے {’’ عَذَابٌ مُّهِيْنٌ ‘‘} یعنی ذلیل کرنے والا عذاب تیار ہے۔ {’’ لَهْوَ ‘‘} کا لفظی معنی ’’غافل کر دینا‘‘ ہے، جیسا کہ فرمایا : «{ لَا تُلْهِكُمْ اَمْوَالُكُمْ وَ لَاۤ اَوْلَادُكُمْ عَنْ ذِكْرِ اللّٰهِ }» [ المنافقون : ۹ ] ’’تمھارے اموال اور تمھاری اولاد تمھیں اللہ کے ذکر سے غافل نہ کر دیں۔‘‘ {’’ لَهْوَ ‘‘} ہر اس بات یا کام کو کہتے ہیں جو انسان کو اس کے مقصد کی چیز سے غافل کر دے۔ شیخ عبدالرحمان السعدی اس آیت کی تفسیر میں فرماتے ہیں : {’’ وَ مِنَ النَّاسِ ‘‘} لوگوں میں سے کوئی ایسا بد نصیب اور بے توفیق بھی ہے، {’’ مَنْ يَّشْتَرِيْ ‘‘} جو اس طرح رغبت رکھتا اور پسند کرتا ہے جیسے قیمت خرچ کر کے حاصل کرنے والا پسند کرتا ہے، {’’ لَهْوَ الْحَدِيْثِ ‘‘} ان باتوں کو جو دلوں کو غافل کر دینے والی اور عظیم مقصد سے روک دینے والی ہوتی ہیں۔ چنانچہ اس میں ہر حرام کلام، ہر باطل اور ایسے اقوال پر مشتمل ہر ہذیان داخل ہے جو کفر، فسق اور معصیت کی رغبت پیدا کرے، وہ اقوال حق کو رد کرنے والے لوگوں کے ہوں، جو باطل کے ساتھ بحث کر کے حق کو زیر کرنے کی کوشش کرتے ہیں، غیبت، چغلی، جھوٹ اور گالی گلوچ کی صورت میں ہوں یا گانے بجانے، شیطان کے باجوں اور غافل کر دینے والی داستانوں اور افسانوں کی صورت میں ہوں، جن کا نہ دنیا میں کوئی فائدہ ہو نہ آخرت میں۔ تو لوگوں کی یہ قسم وہ ہے جو ہدایت والی بات چھوڑ کر {’’ لَهْوَ ‘‘} والی بات خریدتی ہے۔‘‘ ¤ ➋ میں نے شیخ عبد الرحمن السعدی کا کلام اس لیے نقل کیا ہے کہ عام طور پر اس آیت میں {’’ لَهْوَ الْحَدِيْثِ ‘‘} سے مراد صرف گانا بجانا لیا جاتا ہے، جب کہ آیت کا مفہوم اس سے بہت وسیع ہے، اگرچہ حرام غنا (ناجائز گانا) بھی اس میں شامل ہے۔ طبری میں عبد اللہ بن مسعود رضی اللہ عنہ سے جو حسن سند کے ساتھ ثابت ہے کہ انھوں نے قسم کھا کر فرمایا کہ اس سے مراد غنا (گانا) ہے، تو یہ {’’ لَهْوَ الْحَدِيْثِ ‘‘} کی ایک جزئی کا بیان ہے۔ یہاں یہ بات ذہن میں رکھنا ضروری ہے کہ اس کا مصداق ایسے گانے بجانے والے ہوں گے جو دین سے روکنے والے، اللہ تعالیٰ کی آیات کو مذاق بنانے والے اور انھیں سن کر تکبر سے منہ پھیرنے والے ہوں، کیونکہ ان اوصاف کی ان آیات میں صراحت ہے، اور یہ اوصاف کفار کے ہیں مسلمانوں کے نہیں اور انھی کے لیے ذلیل کرنے والا عذاب ہے۔ مسلمان کو ہونے والا عذاب تو اسے گناہوں سے پاک کرنے کے لیے ہو گا۔ البتہ اس حقیقت سے انکار ممکن نہیں کہ مسلمان کہلانے والے لوگ جو حرام عشقیہ گانے بجانے کو اپنا پیشہ یا شغل بنا لیتے ہیں، اس کے نتیجے میں ان کے دلوں میں بدترین نفاق پیدا ہو جاتا ہے اور اللہ کی آیات کو سن کر ان کے ساتھ ان کا رویہ بھی بعینہٖ وہی ہوتا ہے جو ان آیات میں مذکور ہے۔ یہ لوگ اللہ کی آیات کا مذاق اڑانے کے لیے مولوی کا مذاق اڑاتے اور اسے گالی دیتے ہیں، جب کہ ظاہر ہے کہ مولوی بے چارے کا قصور یہ ہے کہ وہ اللہ کی آیات سناتا ہے۔ ایسی صورت میں صرف نام کے مسلمان ہونے کا اللہ تعالیٰ کے ہاں کچھ فائدہ نہ ہو گا۔ اللہ کی آیات کے انکار، ان سے استکبار اور ان کو مذاق بنانے کے ساتھ مسلمانی کے دعوے پر اصرار قیامت کے دن ان کے کسی کام نہ آئے گا۔ افسوس! اس وقت یہ بیماری بری طرح امتِ مسلمہ میں پھیل چکی ہے۔ ریڈیو، ٹیلی ویژن، موبائل فون، انٹرنیٹ، غرض ہر ذریعے سے کفار اور ان کے نام نہاد مسلم گماشتوں نے اسے اس قدر پھیلا دیا ہے کہ کم ہی کوئی خوش نصیب اس سے بچا ہو گا۔ حالانکہ دین کے کمال و زوال کے علاوہ دنیوی عروج و زوال میں بھی اس کا بہت بڑا حصہ ہے۔ اقبال نے چند لفظو ں میں اس کا نقشہ کھینچا ہے: ¤ میں تجھ کو بتاتا ہوں تقدیر امم کیا ہے ¤ شمشیر و سناں اول، طاؤس و رباب آخر ¤ کوئی شخص اگر حرام گانے بجانے کا عمل گناہ سمجھ کر کرے، اس پر نادم ہو تو پھر بھی معافی کی امید ہے، مگر جب کوئی قوم فنون لطیفہ یا روح کی غذا کا نام دے کر اسے حلال ہی کرلے، تو اس کے لیے اللہ کے عذاب کے کوڑے سے بچنا بہت ہی مشکل ہے۔ ابو عامر یا ابو مالک اشعری رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَيَكُوْنَنَّ مِنْ أُمَّتِيْ أَقْوَامٌ يَسْتَحِلُّوْنَ الْحِرَ وَالْحَرِيْرَ وَالْخَمْرَ وَالْمَعَازِفَ ، وَلَيَنْزِلَنَّ أَقْوَامٌ إِلٰی جَنْبِ عَلَمٍ يَرُوْحُ عَلَيْهِمْ بِسَارِحَةٍ لَّهُمْ، يَأْتِيْهِمْ، يَعْنِي الْفَقِيْرَ، لِحَاجَةٍ فَيَقُوْلُوْا ارْجِعْ إِلَيْنَا غَدًا فَيُبَيِّتُهُمُ اللّٰهُ وَيَضَعُ الْعَلَمَ ، وَيَمْسَخُ آخَرِيْنَ قِرَدَةً وَخَنَازِيْرَ إِلٰی يَوْمِ الْقِيَامَةِ ] [ بخاري، الأششربۃ، باب ما جاء فیمن یستحل الخمر… : ۵۵۹۰ ] ’’میری امت میں کئی لوگ ہوں گے جو شرم گاہ (زنا) اور ریشم اور شراب اور باجوں کو حلال کر لیں گے اور کئی لوگ ایک پہاڑ کے پہلو میں اتریں گے، ان کے چرواہے شام کو ان کے چرنے والے مویشی لایا کریں گے، ان کے پاس فقیر اپنی حاجت کے لیے آئے گا، وہ کہیں گے کل آنا۔ تورات ہی کو اللہ تعالیٰ ان پر اپنا عذاب بھیجے گا اور وہ پہاڑ ان پر گرا دے گا اور کئی دوسروں کی شکلیں قیامت تک کے لیے بندروں اور خنزیروں کی شکل میں بدل دے گا۔‘‘ ابو مالک اشعری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيَشْرَبَنَّ نَاسٌ مِّنْ أُمَّتِي الْخَمْرَ يُسَمُّوْنَهَا بِغَيْرِ اسْمِهَا، يُعْزَفُ عَلٰی رُؤُوْسِهِمْ بِالْمَعَازِفِ وَالْمُغَنِّيَاتِ يَخْسِفُ اللّٰهُ بِهِمُ الْأَرْضَ وَيَجْعَلُ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيْرَ ] [ ابن ماجہ، الفتن، باب العقوبات : ۴۰۲۰، و قال الألباني صحیح ] ’’میری امت کے کچھ لوگ شراب پییں گے، اس کا نام اصل نام کے بجائے اور رکھ لیں گے، ان کے سامنے باجے بجائے جائیں گے اور گانے والیاں گائیں گی۔ اللہ تعالیٰ انھیں زمین میں دھنسا دے گا اور ان میں سے بعض کو بندر اور خنزیر بنا دے گا۔‘‘"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { اِنَّ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ …:} لہو الحدیث کے خریدار بد نصیبوں اور ان کی جزا کے ذکر کے بعد ایمان اور عمل صالح والے خوش نصیبوں کا ذکر فرمایا کہ ان کے لیے نعمت کے باغات ہیں، جن میں نعمت ہی نعمت ہو گی، کسی قسم کی زحمت یا تکلیف یا رنج و غم نہیں ہو گا، جب کہ دنیا کا کوئی باغ یا کوئی نعمت ایسی نہیں جس کے ساتھ کوئی زحمت یا رنج و غم نہ ہو۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ { خٰلِدِيْنَ فِيْهَا:} اس کی تفسیر کے لیے دیکھیے سورۂ کہف (۱۰۷، ۱۰۸)۔ ¤ ➋ { وَعْدَ اللّٰهِ حَقًّا :} جنت کے وعدے کی ضمانت کے لیے اللہ تعالیٰ نے اپنا نام ذکر فرمایا کہ یہ کسی اَیرے غیرے کا وعدہ نہیں، بلکہ ساری کائنات کے مالک اللہ تعالیٰ کا وعدہ ہے جو سب سے بڑا ہے۔ ہو سکتا ہے کہ {’’ حَقًّا ‘‘} کے ساتھ مزید یقین دلایا ہو کہ وعدہ بھی ایسا ہے جو بالکل سچا ہے، جس سے زیادہ سچا کوئی وعدہ ہو ہی نہیں سکتا۔ ¤ ➌ {وَ هُوَ الْعَزِيْزُ الْحَكِيْمُ :} اس میں مزید یقین دہانی ہے کہ یہ وعدہ کرنے والا وہ ہے جو سب پر غالب ہے، کوئی قوت اسے وعدہ پورا کرنے سے روک نہیں سکتی اور وہ کمال حکمت والا ہے۔ اس نے یہ وعدہ اندھا دھند اور بے موقع نہیں فرمایا، بلکہ حکمت کے مطابق فرمایا ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {خَلَقَ السَّمٰوٰتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا … :} اس میں اللہ تعالیٰ کی عزت و حکمت کی چند نشانیوں کا ذکر فرما کر اس کی توحید کو اجاگر فرمایا، جو قرآن مجید کا سب سے بڑا اور اصل موضوع ہے۔ {’’ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ‘‘} کی تفسیر سورۂ رعد (۲) میں اور {’’ وَ اَلْقٰى فِي الْاَرْضِ رَوَاسِيَ اَنْ تَمِيْدَ بِكُمْ ‘‘} کی تفسیر سورۂ حجر (۱۹) اور سورۂ انبیاء (۳۱) میں دیکھیے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {هٰذَا خَلْقُ اللّٰهِ فَاَرُوْنِيْ مَا ذَا خَلَقَ الَّذِيْنَ مِنْ دُوْنِهٖ … :} یعنی  یہ ستونوں کے بغیر بلند آسمان، زمین میں گڑے ہوئے پہاڑ اور اس میں پھیلے ہوئے جانور، آسمان سے اترنے والا پانی اور اس کے ساتھ زمین سے پیدا ہونے والی ہر عمدہ اور نفیس قسم کی چیز، یہ سب کچھ تو اللہ تعالیٰ نے پیدا فرمایا ہے۔ اب مجھے دکھاؤ کہ وہ کون سی چیز ہے جو اس کے سوا کسی اور نے پیدا فرمائی ہے؟ ظاہر ہے ایک بھی نہیں۔ تو پھر مشرکین اس کے سوا کسی اور کی عبادت کیوں کرتے ہیں، کیا ان کے پاس کوئی دلیل ہے؟ فرمایا نہیں، بلکہ اصل یہ ہے کہ مشرک ظالم ہیں اور ظالم بھی ایسے جو واضح گمراہی میں مبتلا ہیں، شرک کی ظلمت اور اندھیرے میں انھیں سیدھا راستہ سوجھتا ہی نہیں، اس لیے وہ اس راستے پر چل رہے ہیں جو واضح طور پر غلط اور گمراہی کا راستہ ہے۔ اللہ تعالیٰ نے قرآن مجید میں بار بار اس بات کو اپنی توحید کی دلیل کے طور پر بیان فرمایا ہے کہ پیدا کرنے والا صرف وہ ہے، تو پھر عبادت کسی اور کی کیوں ہو؟ دیکھیے سورۂ بقرہ (۲۱، ۲۲)، رعد (۱۶)، نحل (۱۷ تا ۲۱)، حج (۷۳، ۷۴)، فاطر (۴۰) اور احقاف (۴، ۵)۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { وَ لَقَدْ اٰتَيْنَا لُقْمٰنَ الْحِكْمَةَ :} تفاسیر میں لقمان کے متعلق جو کچھ لکھا ہے ملاحظہ فرمائیں، روح المعانی میں ہے : ’’وہب نے کہا، وہ ایوب علیہ السلام کے بھانجے تھے۔ مقاتل نے کہا، ان کے خالہ زاد تھے۔ عبدالرحمن سہیلی نے کہا، وہ عنقا بن سرون کے بیٹے تھے۔ بعض نے کہا، وہ آزر کی اولاد سے تھے، ہزار برس زندہ رہے اور داؤد علیہ السلام کو پایا اور ان سے علم حاصل کیا۔ ¤ ان کے مبعوث ہونے سے پہلے فتویٰ دیتے تھے، جب وہ مبعوث ہوئے تو فتویٰ دینا چھوڑ دیا۔ ان سے پوچھا گیا تو فرمانے لگے، جب مجھ سے کفایت کی گئی تو کیا میں اکتفا نہ کروں۔ بعض نے کہا، وہ بنی اسرائیل کے ایک قاضی تھے۔ یہ بات واقدی سے نقل کی گئی ہے، مگر انھوں نے کہا، ان کا زمانہ محمد صلی اللہ علیہ وسلم اور عیسیٰ علیہ السلام کے درمیان تھا۔ عکرمہ اور شعبی نے کہا، وہ نبی تھے۔ اکثر کا کہنا ہے کہ وہ داؤد علیہ السلام کے زمانہ میں تھے، نبی نہیں تھے اور ان کے بارے میں اختلاف ہے کہ وہ آزاد تھے یا غلام۔ اکثر کا کہنا ہے کہ وہ غلام تھے۔ ایک اختلاف اور ہے، بعض نے کہا، حبشی تھے، یہ ابن عباس اور مجاہد سے مروی ہے اور ابن مردویہ نے یہ ابوہریرہ رضی اللہ عنہ سے مرفوعاً روایت کی ہے۔ مجاہد نے ان کے بارے میں بیان کیا کہ وہ موٹے ہونٹوں اور پاؤں کے سیدھے تلوے والے تھے۔ بعض نے کہا، وہ نُوبی تھے، پھٹے ہوئے پاؤں اور موٹے ہونٹوں والے تھے۔ یہ ابن عباس، ابن مسیب اور مجاہد سے منقول ہے۔ ابن ابی حاتم نے عبداللہ بن زبیر رضی اللہ عنھما سے نقل کیا ہے کہ انھوں نے فرمایا، میں نے جابر بن عبد اللہ رضی اللہ عنھما سے کہا، آپ کو لقمان کے بارے میں کیا خبر پہنچی ہے؟ انھوں نے فرمایا، وہ چھوٹے قد، چپٹی ناک والے نوبی (حبشی) تھے۔ ابن ابی حاتم، ابن جریر اور ابن المنذر نے ابن المسیّب سے بیان کیا ہے، انھوں نے فرمایا کہ لقمان مصر کے سیاہ فام لوگوں میں سے کالے رنگ والے اور بڑے ہونٹوں والے تھے، اللہ تعالیٰ نے انھیں حکمت عطا کی، مگر نبوت نہیں دی۔ اس میں بھی اختلاف ہے کہ ان کا پیشہ کیا تھا۔ چنانچہ خالد بن ربیع نے کہا، وہ نجار (راء کے ساتھ) یعنی ترکھان تھے اور معانی الزجاج میں ہے، وہ نجاد تھے (دال کے ساتھ، بروزن کتاب، جو بچھونے اور گدے وغیرہ بناتے اور سیتے ہیں)۔ ابن ابی شیبہ نے اور احمد نے ’’الزہد‘‘ میں اور ابن المنذر نے ابن المسیّب سے روایت کی ہے کہ وہ خیاط (کپڑے سینے والے) تھے، جو نجاد سے عام ہے۔ ابن عباس رضی اللہ عنھما سے مروی ہے کہ وہ چرواہے تھے۔ بعض نے کہا، وہ ہر روز اپنے مالک کے لیے ایندھن کا گٹھا لاتے تھے۔‘‘ مفسر آلوسی صاحب روح المعانی یہ سب کچھ نقل کرنے کے بعد لکھتے ہیں : {’’ وَلَا وُثُوْقَ لِيْ بِشَيْءٍ مِنْ هٰذِهِ الْأَخْبَارِ وَإِنَّمَا نَقَلْتُهَا تَأْسِيًا بِمَنْ نَقَلَهَا مِنَ الْمُفَسِّرِيْنَ الْأَخْيَارِ غَيْرَ أَنِّيْ أَخْتَارُ أَنَّهُ كَانَ رَجُلًا صَالِحًا حَكِيْمًا وَلَمْ يَكُنْ نَبِيًّا‘‘} ’’یعنی مجھے ان خبروں میں سے کسی پر کوئی اعتبار نہیں ہے، میں نے تو انھیں صرف اس لیے نقل کیا ہے کہ جید مفسرین نے انھیں نقل کیا ہے۔ میں تو صرف اس بات کو ترجیح دیتا ہوں کہ وہ صالح اور حکیم (و دانا) آدمی تھے، نبی نہیں تھے۔‘‘ ¤ میں نے بھی یہ سارا کلام یہ دکھانے کے لیے نقل کیا ہے کہ بعض مفسرین کس طرح بلاثبوت باتیں نقل کرتے جاتے ہیں اور یہ سوچنے کی زحمت ہی نہیں کرتے کہ مجاہد، قتادہ، ابن المسیّب وغیرہ حضرات کا ہزاروں برس پہلے گزرے ہوئے لقمان کے ساتھ کوئی میل جول رہا ہے، یا انھوں نے ان تک کوئی سند بیان کی ہے۔ نہ رسول اللہ صلی اللہ علیہ وسلم کی طرف منسوب روایت نقل کرتے ہوئے یہ اہتمام کرتے ہیں کہ ثابت شدہ روایت ہی نقل کریں۔ حقیقت یہ ہے کہ ہمیں ان کے متعلق اس سے زیادہ کچھ معلوم نہیں جو اللہ تعالیٰ نے قرآن مجید میں بیان فرمایا اور جسے صاحب روح المعانی نے ترجیح دی ہے۔ ان کے غلام یا حبشی وغیرہ ہونے کی کوئی روایت پایۂ ثبوت کو نہیں پہنچتی۔ البتہ نبی صلی اللہ علیہ وسلم کی بعثت سے پہلے بھی ان کی حکمت اور دانائی کے واقعات عرب میں مشہور تھے اور جاہلی شعراء اور خطباء اپنے کلام میں ان کا ذکر کرتے تھے، جیسا کہ ابن ہشام نے اپنی سیرت میں نقل کیا ہے۔ ¤ ➋ شرک کی تردید میں ایک پر زور عقلی دلیل پیش کرنے کے بعد اب عرب کے لوگوں کو یہ بتایا جا رہا ہے کہ توحید کی بات صرف پیغمبروں ہی کے ذریعے سے نہیں آئی، بلکہ عقل و حکمت کا تقاضا بھی یہی ہے اور پہلے عاقل اور دانا لوگ بھی یہی بات کہتے چلے آئے ہیں، چنانچہ تمھارا اپنا مشہور حکیم لقمان بھی اب سے بہت پہلے یہی کچھ کہہ گیا ہے۔ ¤ ➌ { اَنِ اشْكُرْ لِلّٰهِ :} تفسیر قاسمی میں ہے : {’’قَالَ فِي الْبَصَائِرِ الشُّكْرُ مَبْنِيٌّ عَلٰي خَمْسَةِ قَوَاعِدَ، خُضُوْعُ الشَّاكِرِ لِلْمَشْكُوْرِ وَ حُبُّهُ لَهُ وَاعْتِرَافُهُ بِنِعْمَتِهِ وَالثَّنَاءُ عَلَيْهِ بِهَا وَ أَنْ لَّا يَسْتَعْمِلَهَا فِيْمَا يَكْرَهُ، هٰذَا الْخَمْسَةُ هِيَ أَسَاسُ الشُّكْرِ وَبَنَاءُهُ عَلَيْهَا فَإِنْ عُدِمَ مِنْهَا وَاحِدَةٌ اخْتَلَّتْ قَاعِدَةٌ مِّنْ قَوَاعِدِ الشُّكْرِ وَكُلُ مَنْ تَكَلَّمَ فِي الشُّكْرِ فَإِنَّ كَلَامَهُ إِلَيْهَا يَرْجِعُ وَ عَلَيْهَا يَدُوْرُ‘‘} ’’البصائر میں فرمایا کہ شکر کی بنیاد پانچ چیزوں پر ہے، شکر کرنے والے کا اس کے سامنے عاجز ہونا جس کا وہ شکر ادا کر رہا ہے، اس کے ساتھ محبت کرنا، اس کی نعمت کا اعتراف کرنا، اِس پر اُس کی تعریف کرنا اور یہ کہ اس نعمت کو اس جگہ استعمال نہ کرے جہاں نعمت دینے والا پسند نہ کرتا ہو۔ یہ پانچوں چیزیں ہی شکر کی اساس ہیں اور انھی پر اس کی بنیاد ہے۔ اگر ان میں سے کوئی ایک کم ہو تو شکر کی بنیادوں میں سے ایک بنیاد کم ہو جائے گی۔ جس نے بھی شکر کے بارے میں گفتگو کی ہے اس کی گفتگو کا نتیجہ یہی ہے اور وہ اسی پر گھومتی ہے۔ ‘‘ ¤ ➍ { وَ مَنْ يَّشْكُرْ فَاِنَّمَا يَشْكُرُ لِنَفْسِهٖ :} اس کی تفسیر کے لیے دیکھیے سورۂ ابراہیم (۷) اور سورۂ نمل (۴۰)۔ ¤ ➎ {وَ مَنْ كَفَرَ فَاِنَّ اللّٰهَ غَنِيٌّ حَمِيْدٌ :} یعنی کسی کے کفر کا اللہ تعالیٰ کو کچھ نقصان نہیں، کیونکہ وہ بے نیاز ہے اور وہ کسی کے شکر کا محتاج نہیں، کوئی شکر کرے یا نہ کرے، کائنات کا ذرہ ذرہ گواہی دے رہا ہے کہ اس کی ذات محمود ہے اور تمام خوبیوں کا مالک وہی ہے، کسی میں کوئی خوبی ہے تو اس کی اپنی نہیں بلکہ اسی کی عطا کردہ ہے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ {وَ اِذْ قَالَ لُقْمٰنُ لِابْنِهٖ وَ هُوَ يَعِظُهٗ …: ’’وَعَظَ‘‘} کا معنی کسی چیز سے روکنا ہے، جس میں ترغیب کے ساتھ ڈرانا بھی ہو، جیسا کہ اللہ نے نوح علیہ السلام کو بیٹے کے لیے سفارش پر فرمایا : «{ فَلَا تَسْـَٔلْنِ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ اِنِّيْۤ اَعِظُكَ اَنْ تَكُوْنَ مِنَ الْجٰهِلِيْنَ }» [ ھود : ۴۶ ] ’’پس مجھ سے اس بات کا سوال نہ کر جس کا تجھے کچھ علم نہیں۔ بے شک میں تجھے اس سے نصیحت کرتا ہوں کہ تو جاہلوں میں سے ہو جائے۔‘‘ اور جیسا کہ فرمایا : «{ فَاَعْرِضْ عَنْهُمْ وَ عِظْهُمْ وَ قُلْ لَّهُمْ فِيْۤ اَنْفُسِهِمْ قَوْلًۢا بَلِيْغًا }» [ النساء : ۶۳ ] ’’سو تو ان سے دھیان ہٹا لے اور انھیں نصیحت کر اور ان سے ایسی بات کہہ جو ان کے دلوں میں بہت اثر کرنے والی ہو۔‘‘ ¤ ➋ {يٰبُنَيَّ:’’اِبْنٌ‘‘} اصل میں {’’بَنْوٌ‘‘} ہے، اس کی تصغیر {’’ بُنَيْوٌ‘‘} ہے۔ یائے متکلم کی طرف مضاف کرنے سے {’’بُنَيْوِيَ‘‘} ہو گیا۔ واؤ کو یاء کرنے سے {’’بُنَيْيِيَ‘‘} ہو گیا۔ پھر ایک یاء حذف کرنے اور ادغام سے {’’بُنَيَّ‘‘} ہو گیا۔ معنی اس کا ہے ’’اے میرے چھوٹے بیٹے۔‘‘ چھوٹے سے مراد پیارا ہے۔ بیٹے پر شفقت اور محبت کے اظہار کے لیے تصغیر اور یائے متکلم کی طرف مضاف کر کے مخاطب فرمایا۔ ¤ ➌ اس سے معلوم ہوا کہ وعظ کرتے وقت مخاطب کو نہایت محبت اور شفقت بھرے الفاظ کے ساتھ خطاب کرنا چاہیے، جیسا کہ لقمان علیہ السلام نے اپنے بیٹے کو {’’ يٰبُنَيَّ ‘‘} کہہ کر اور ابراہیم علیہ السلام نے اپنے والد کو {’’ يٰۤاَبَتِ ‘‘} کہہ کر مخاطب فرمایا اور رسول اللہ صلی اللہ علیہ وسلم نے ابو طالب کو {’’يَا عَمِّ! قُلْ لَّا إِلٰهَ إِلَّا اللّٰهُ‘‘} کہہ کر وعظ فرمایا۔ بلکہ عام گفتگو میں بھی اس ادب کو ملحوظ رکھنا چاہیے، جیسا کہ یوسف علیہ السلام نے والد کو {’’ يٰۤاَبَتِ اِنِّيْ رَاَيْتُ اَحَدَ عَشَرَ كَوْكَبًا ‘‘} اور والد نے انھیں {’’ يٰبُنَيَّ لَا تَقْصُصْ رُءْيَاكَ عَلٰۤى اِخْوَتِكَ ‘‘‘} کے ساتھ مخاطب کیا۔ ¤ ➍ { لَا تُشْرِكْ بِاللّٰهِ:} حکمت عطا ہونے کے بعد یہ پہلی نصیحت ہے جو لقمان علیہ السلام نے اپنے بیٹے کو کی اور یہی وہ اصل الاصول ہے جس کی وحی اللہ تعالیٰ نے اپنے ہر رسول کو فرمائی، فرمایا : «{ وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَاا فَاعْبُدُوْنِ }» [ الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔‘‘ اس سے معلوم ہوا کہ ہر والد کے لیے ضروری ہے کہ وہ سب سے پہلے اپنی اولاد کو شرک سے بچانے کی کوشش کرے۔ اس کوشش میں وعظ کے ساتھ ان کے لیے اللہ سے دعا بھی شامل ہے، جیسا کہ ابراہیم علیہ السلام نے جب اسماعیل علیہ السلام اور ان کی والدہ کو وادی غیر ذی زرع میں چھوڑا، تو ان کے نگاہوں سے اوجھل ہونے پر اللہ تعالیٰ سے دعا کی : «{ وَ اِذْ قَالَ اِبْرٰهِيْمُ رَبِّ اجْعَلْ هٰذَا الْبَلَدَ اٰمِنًا وَّ اجْنُبْنِيْ وَ بَنِيَّ اَنْ نَّعْبُدَ الْاَصْنَامَ }» [ إبراہیم : ۳۵ ] ’’اور جب ابراہیم نے کہا اے میرے رب! اس شہر کو امن والا بنادے اور مجھے اور میرے بیٹوں کو بچا کہ ہم بتوں کی عبادت کریں۔‘‘ ¤ ➎ {اِنَّ الشِّرْكَ لَظُلْمٌ عَظِيْمٌ : ’’ اِنَّ ‘‘} کا لفظ تعلیل کے لیے آتا ہے، یعنی اس کے ساتھ پہلی بات کی علت بیان کی جاتی ہے، فرمایا : ’’اللہ کے ساتھ شرک مت کر، کیونکہ شرک بہت بڑا ظلم ہے۔‘‘ ظلم کا معنی ہے {’’وَضْعُ الشَّيْءِ فِيْ غَيْرِ مَحَلِّهِ‘‘} کسی چیز کو اس کی جگہ کے بجائے دوسری جگہ رکھ دینا، کسی کا حق دوسرے کو دے دینا۔ کیونکہ ظلم کا اصل معنی اندھیرا ہے اور اندھیرے میں آدمی کسی چیز کو اس کی اصل جگہ نہیں رکھ سکتا۔ موحّد آدمی اپنی پوری زندگی توحید کی روشنی میں بصیرت کے ساتھ گزارتا ہے، جیسا کہ فرمایا : «{ قُلْ هٰذِهٖ سَبِيْلِيْۤ اَدْعُوْۤا اِلَى اللّٰهِ عَلٰى بَصِيْرَةٍ اَنَا وَ مَنِ اتَّبَعَنِيْ }» [ یوسف : ۱۰۸ ] ’’کہہ دے یہی میرا راستہ ہے، میں اللہ کی طرف بلاتا ہوں، پوری بصیرت پر، میں اور وہ بھی جنھوں نے میری پیروی کی ہے۔‘‘ جب کہ مشرک ساری عمر شرک کی ظلمتوں میں بھٹکتا رہتا ہے، جیسا کہ فرمایا : «{ صُمٌّۢ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُوْنَ }» [ البقرۃ : ۱۷۱ ] ’’بہرے ہیں، گونگے ہیں، اندھے ہیں، پس وہ نہیں سمجھتے۔‘‘ شرک بہت بڑا ظلم اس لیے ہے کہ اس سے بڑھ کر بے انصافی ہو نہیں سکتی کہ بے بس اور عاجز مخلوق کو خالق و مالک اور مختار رب تعالیٰ کے اختیارات کا مالک بنا دیا جائے۔ یہ اللہ تعالیٰ کی حق تلفی ہے اور آدمی کا اپنی جان پر بھی بہت بڑا ظلم کہ وہ اپنے آپ کو توحید کے بلند آسمان سے گرا کر شرک کی پستی میں گرا دے اور ہمیشہ کی نعمتوں والی جنت کے بجائے ابد الآباد جہنم کے عذاب کا سزاوار ٹھہرے۔ دیکھیے سورۂ حج (۳۱) اور مائدہ (۷۲) مزید دیکھیے سورۂ انعام کی آیت (۸۲) : «{ اَلَّذِيْنَ اٰمَنُوْا وَ لَمْ يَلْبِسُوْۤا اِيْمَانَهُمْ بِظُلْمٍ }» کی تفسیر۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ {وَ وَصَّيْنَا الْاِنْسَانَ بِوَالِدَيْهِ :} اللہ عزوجل نے لقمان علیہ السلام کی اپنے بیٹے کو وصیت ذکر فرمائی، جس میں انھوں نے اسے اللہ تعالیٰ کا حق ادا کرنے کی تاکید فرمائی، تو ساتھ ہی اللہ تعالیٰ نے اپنی طرف سے انسان کو ماں باپ کا حق ادا کرنے کی وصیت فرما دی، کیونکہ وہ دنیا میں اس کے آنے اور اس کی پرورش کا ذریعہ بنے۔ قرآن مجید میں کئی جگہ اللہ تعالیٰ کی عبادت کا اور ماں باپ کے ساتھ احسان کا ذکر اکٹھا آیا ہے۔ دیکھیے بنی اسرائیل (۲۳، ۲۴)، عنکبوت (۸) اور انعام (۱۵۱) یہاں {’’ وَ وَصَّيْنَا الْاِنْسَانَ بِوَالِدَيْهِ ‘‘} کے بعد اس وصیت کی تفسیر {’’ اَنِ اشْكُرْ لِيْ وَ لِوَالِدَيْكَ ‘‘} کے ساتھ فرمائی ہے، یعنی ہم نے انسان کو اس کے والدین کے متعلق وصیت کی کہ میرا اور اپنے والدین کا شکر ادا کر۔ درمیان میں جملہ معترضہ کے طور پر ماں کا حق زیادہ ہونے کی طرف توجہ دلائی کہ اس نے باپ سے کہیں زیادہ بچے کی مشقت اٹھائی ہے۔ معاویہ بن حیدہ رضی اللہ عنہ (دادا بہز بن حکیم) بیان کرتے ہیں کہ میں نے کہا : [ يَا رَسُوْلَ اللّٰهِ! مَنْ أَبَرُّ ] ’’یا رسول اللہ! میں کس کے ساتھ نیکی اور احسان و سلوک کروں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ أُمَّكَ ثُمَّ أُمَّكَ ثُمَّ أُمَّكَ ثُمَّ أَبَاكَ ثُمَّ الْأَقْرَبَ فَالْأَقْرَبَ ] [ أبوداوٗد، الأدب، باب في بر الوالدین، : ۵۱۳۹ ، و قال الألباني حسن صحیح ] ’’اپنی ماں کے ساتھ، پھر اپنی ماں کے ساتھ، پھر اپنی ماں کے ساتھ، پھر اپنے باپ کے ساتھ، پھر اپنے سب سے قریب کے ساتھ، پھر اس کے بعد زیادہ قریب کے ساتھ۔‘‘ بعض اہلِ علم نے اس تاکید کی ایک وجہ یہ بیان فرمائی ہے کہ والدہ کی کمزوری اور طبعی نرمی اور شفقت کی وجہ سے اولاد اس کی پروا نہیں کرتی اور اس کا حق ادا کرنے میں کوتاہی کرتی ہے، جب کہ باپ کی طبیعت کی وجہ سے اس کا خیال کرنا پڑتا ہے، لہٰذا تاکید کے لیے ماں کا ذکر تین دفعہ فرمایا۔ یہ مطلب نہیں کہ ماں کو تین روپے دو اور باپ کو ایک روپیہ، بلکہ اولاد کو دونوں ہی کا خیال رکھنا چاہیے۔ (واللہ اعلم) ¤ ➋ { حَمَلَتْهُ اُمُّهٗ وَهْنًا عَلٰى وَهْنٍ:’’ وَهْنًا ‘‘} کی ترکیب کئی  طرح سے ہو سکتی ہے، ایک یہ کہ یہ {’’ اُمُّهٗ ‘‘} سے حال بمعنی اسم فاعل ہے۔{’’ أَيْ حَمَلَتْهُ أُمُّهُ ذَاتَ وَهْنٍ عَلٰي وَهْنٍ ‘‘} یعنی اس کی ماں نے اسے اس حالت میں اٹھائے رکھا کہ وہ کمزوری پر کمزوری والی تھی۔ زمخشری نے فرمایا : {’’ وَهْنًا ‘‘} فعل محذوف{’’تَهِنُ‘‘} کا مفعول مطلق ہے، یعنی اس کی ماں نے اسے اس حال میں اٹھایا کہ وہ کمزور پر کمزور ہوتی جاتی تھی، دن بدن اس کا ضعف بڑھتا جاتا تھا، کیونکہ جیسے جیسے اس کا حمل بڑھتا، اس کا بوجھ اور ضعف بڑھتا جاتا تھا۔‘‘ ایک صورت یہ ہے کہ اس سے پہلے حرف جار ’’باء‘‘ محذوف ہے، جس کے حذف کرنے سے اس پر نصب آئی ہے : {’’أَيْ حَمَلَتْهُ بِضُعْفٍ عَلٰي ضُعْفٍ‘‘} یعنی اس نے اسے کمزوری پر کمزوری کے ساتھ اٹھائے رکھا۔ ¤ ➌ { ’’ وَهْنًا عَلٰى وَهْنٍ ‘‘} (کمزوری پر کمزوری) میں دورانِ حمل دن بدن بڑھنے والی کمزوری کے بعد {’’ وَ فِصٰلُهٗ فِيْ عَامَيْنِ ‘‘} (اس کا دودھ چھڑانا دو سال میں ہے) کے درمیان کمزوری اور مشقت کے کئی مرحلے ذکر نہیں فرمائے، کیونکہ وہ خود بخود سمجھ میں آ رہے ہیں۔ جن میں ولادت کا جاں گسل مرحلہ، پھر نفاس کی کمزوری، پھر دن رات بچے کی پرورش، نگہداشت، اسے دودھ پلانا اور اس کی ہر ضرورت کا خیال رکھنا وغیرہ شامل ہیں۔ ¤ ➍ { وَ فِصٰلُهٗ فِيْ عَامَيْنِ :} حافظ ابن کثیر رحمہ اللہ نے فرمایا، اللہ تعالیٰ کا فرمان {’’ وَ فِصٰلُهٗ فِيْ عَامَيْنِ ‘‘} ( اور اس کا دودھ چھڑانا دو سال میں ہے) اللہ تعالیٰ کے اس فرمان کا ہم معنی ہے : «{ وَ الْوَالِدٰتُ يُرْضِعْنَ اَوْلَادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ لِمَنْ اَرَادَ اَنْ يُّتِمَّ الرَّضَاعَةَ }» [ البقرۃ : ۲۳۳ ] ’’اور مائیں اپنے بچوں کو پورے دو سال دودھ پلائیں، اس کے لیے جو چاہے کہ دودھ کی مدت پوری کرے۔‘‘ اسی سے ابن عباس رضی اللہ عنھما وغیرہ ائمہ نے استنباط فرمایا ہے کہ حمل کی کم از کم مدت چھ ماہ ہے، کیونکہ اللہ تعالیٰ نے دوسری آیت میں فرمایا ہے : «{ وَ حَمْلُهٗ وَ فِصٰلُهٗ ثَلٰثُوْنَ شَهْرًا }» [ الأحقاف : ۱۵ ] ’’اور اس کے حمل اور اس کے دودھ چھڑانے کی مدت تیس مہینے ہے۔‘‘ اور اللہ تعالیٰ نے ماں کی پرورش کا، اس کمزوری، تکان اور دن رات بیداری اور مشقت کا ذکر اس لیے فرمایا کہ بچے کو اس کا احسان یاد دلائے جو اس نے اس پر کیا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ وَ قُلْ رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيٰنِيْ صَغِيْرًا }» [ بني إسرائیل : ۲۴ ] ’’اور کہہ اے میرے رب! ان دونوں پر رحم کر جیسے انھوں نے چھوٹا ہونے کی حالت میں مجھے پالا۔‘‘ ¤ ➎ زمخشری نے فرمایا : ’’اگر تم کہو کہ دودھ چھڑانے کی مدت دو سال مقرر کرنے کا کیا مطلب ہے، تو میں کہوں گا کہ یہ مدت مقرر کرنے کا مطلب یہ ہے کہ یہ حد ہے جس سے تجاوز درست نہیں۔ دو سال سے کم میں دودھ چھڑانے کا معاملہ ماں کے اجتہاد پر موقوف ہے۔ اگر وہ سمجھے کہ وہ اس سے پہلے دودھ چھڑانا برداشت کر سکتا ہے تو وہ چھڑا سکتی ہے۔ اس کی دلیل اللہ تعالیٰ کا یہ فرمان ہے : «{ وَ الْوَالِدٰتُ يُرْضِعْنَ اَوْلَادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ لِمَنْ اَرَادَ اَنْ يُّتِمَّ الرَّضَاعَةَ }» [ البقرۃ : ۲۳۳ ] ’’اور مائیں اپنے بچوں کو پورے دو سال دودھ پلائیں، اس کے لیے جو چاہے کہ دودھ کی مدت پوری کرے۔‘‘ ¤ ➏ اس آیت سے معلوم ہوا کہ دودھ پلانے کی کامل مدت دو سال ہے۔ اس عرصے میں دودھ پینے سے رضاعت کی حرمت ثابت ہو گی، اس کے بعد نہیں۔ بعض لوگوں نے مدت رضاعت اڑھائی سال قرار دی ہے اور اسے احتیاط کا تقاضا قرار دیا ہے۔ مگر صریح آیت کے بعد کسی کو احتیاط یا کسی اور وجہ سے اس کی مخالفت کا کوئی اختیار نہیں۔ مزید دیکھیے سورۂ احقاف (۱۵)۔ ¤ ➐ { اِلَيَّ الْمَصِيْرُ : ’’ اِلَيَّ ‘‘} کو پہلے لانے سے کلام میں حصر پیدا ہو گیا، یعنی میری ہی طرف لوٹ کر آنا ہے کسی اور کی طرف نہیں۔ یہاں ایک سوال ہے کہ یہ نہیں بتایا کہ کس کا لوٹ کر آنا مراد ہے؟ جواب یہ ہے کہ اسے عام رکھا ہے، تاکہ اس میں سب لوگ شامل ہو جائیں۔ یعنی ہر ایک کو، جن میں تم بھی شامل ہو، میری ہی طرف واپس آنا ہے۔ اس میں ازسر نو اللہ عزوجل اور والدین کے شکر کی وصیت ہے اور وعدہ بھی اور وعید بھی کہ اگر میرے متعلق اور اپنے والدین کے متعلق میری وصیت پر عمل کرو گے تو جزائے خیر پاؤ گے، ورنہ سزا کے لیے تیار رہو۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { وَ اِنْ جَاهَدٰكَ عَلٰۤى اَنْ تُشْرِكَ بِيْ …:} والدین کے ساتھ حُسن سلوک کی تاکید کے بعد اس میں سے ایک چیز کا استثنا فرمایا کہ اگر وہ تجھ پر اس بات کا زور دیں کہ تو میرے ساتھ شرک کرے، تو خواہ جتنا زور لگا لیں ان کی بات مت ماننا۔ سورۂ عنکبوت کی آٹھویں آیت میں بھی یہی بات بیان ہوئی ہے۔ فرق صرف یہ ہے کہ وہاں {’’ وَ اِنْ جَاهَدٰكَ عَلٰۤى اَنْ تُشْرِكَ بِيْ ‘‘} ہے اور یہاں {’’ عَلٰۤى اَنْ تُشْرِكَ بِيْ ‘‘} ہے۔ {’’ عَلٰۤى ‘‘} کے لفظ میں ’’لام‘‘ کی بہ نسبت زیادہ قوت پائی جاتی ہے، اس لیے تفسیر میں اس بات کی طرف ’’خواہ جتنا زور لگا لیں‘‘ کے الفاظ کے ساتھ اشارہ کیا گیا ہے۔ سورۂ عنکبوت میں فتنے کا ذکر ہے، جو والدین کی طرف سے منت و سماجت اور نرمی سے بھی ہو سکتا ہے اور سختی سے بھی، بہلانے پھسلانے یا بے رخی کی صورت میں بھی ہو سکتا ہے اور طاقت، قوت اور زبردستی کے ساتھ بھی۔ والدین کی طرف سے شرک پر آمادہ کرنے کی زیادہ سے زیادہ کوشش کے باوجود ان کی اطاعت نہ کرنے کا حکم دیا، خواہ معاملہ تلوار یا بندوق تک پہنچ جائے۔ معمولی کوششیں خودبخود اس کے ضمن میں آگئیں۔ پھر جب اللہ تعالیٰ کے بعد آدمی کے سب سے بڑے محسنوں کی بات ماننا اللہ تعالیٰ کے حکم کے مقابلے میں جائز نہیں، تو پھر کسی اور کی کیا حیثیت ہے کہ اس کی اطاعت کی جائے؟ خواہ کوئی رشتہ دار ہو یا دوست، پیر ہو یا فقیر، امام ہو یا حاکم، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا طَاعَةَ لِمَخْلُوْقٍ فِيْ مَعْصِيَةِ الْخَالِقِ ] [ المعجم الکبیر للطبراني: 60/13، ح : ۱۴۷۹۵ ] ’’خالق کی نافرمانی کے معاملہ میں مخلوق کی اطاعت جائز نہیں۔‘‘ مزید دیکھیے سورۂ عنکبوت (۸) کی تفسیر۔ ¤ ➋ { وَ صَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوْفًا :} ممکن تھا کہ کوئی شخص اس سے یہ سمجھ لیتا کہ والدین کے مشرک ہونے یا شرک پر آمادہ کرنے کی کوشش کی صورت میں ان سے سرے ہی سے قطع تعلق کر لینا چاہیے۔ اس لیے فرمایا کہ جب تک وہ زندہ ہیں، ان معاملات میں جو دین کے ساتھ تعلق نہیں رکھتے، ان کے ساتھ اچھے طریقے کے ساتھ رہو۔ مثلاً ان کے کھانے پینے، پہننے، رہنے اور علاج وغیرہ کی ضروریات کا خیال رکھو، ان کے ساتھ نرمی اور محبت کے ساتھ بات کرو، ان کے غصے اور تلخی کو برداشت کرتے رہو۔ جب مشرک والدین کے متعلق یہ حکم ہے، تو مومن والدین کا حق کس قدر ہو گا ! ¤ ➌ { وَ اتَّبِعْ سَبِيْلَ مَنْ اَنَابَ اِلَيَّ :} اس جملے میں دوبارہ تاکید فرمائی کہ دنیاوی معاملات میں ان کے ساتھ معروف طریقے سے رہنے کی صورت میں اس بات کا خیال رکھو کہ تم میں مداہنت نہ پیدا ہو جائے کہ دینی معاملات میں بھی تم ان کے پیچھے چل پڑو۔ نہیں، چلنا انھی لوگوں کے راستے پر ہے جن کا رجوع میری طرف ہے اور جو صرف میری ہدایت اور رہنمائی پر چلتے ہیں۔ یہ راستہ صرف ان لوگوں کا ہے جو قرآن و حدیث پر چلتے ہیں، کیونکہ اللہ کی طرف سے نازل شدہ یہی دو چیزیں ہیں۔ کسی ایسے شخص کی رائے یا قیاس پر چلنا، جس پر اللہ کی طرف سے وحی نہیں ہوتی {’’ سَبِيْلَ مَنْ اَنَابَ اِلَيَّ ‘‘} پر چلنا نہیں، کیونکہ ہدایت حاصل کرنے کے لیے اس کی طرف رجوع اللہ تعالیٰ کی طرف نہیں بلکہ غیر اللہ کی طرف ہے، جیسا کہ فرمایا : «{ اِتَّبِعُوْا مَاۤ اُنْزِلَ اِلَيْكُمْ مِّنْ رَّبِّكُمْ وَ لَا تَتَّبِعُوْا مِنْ دُوْنِهٖۤ اَوْلِيَآءَ }» [ الأعراف : ۳ ] ’’اس کے پیچھے چلو جو تمھاری طرف تمھارے رب کی جانب سے نازل کیا گیا ہے اور اس کے سوا اور دوستوں کے پیچھے مت چلو۔‘‘ ¤ ➍ { ثُمَّ اِلَيَّ مَرْجِعُكُمْ فَاُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ :} ’’میں تمھیں بتاؤں گا‘‘ میں ڈانٹنے کا جو زور ہے وہ ’’میں تمھیں جزا دوں گا‘‘ میں نہیں۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { يٰبُنَيَّ اِنَّهَاۤ اِنْ تَكُ …:} لقمان علیہ السلام کی پہلی وصیت کے بعد دو آیات میں اللہ تعالیٰ نے والدین کے بارے میں وصیت فرمائی۔ اب دوبارہ لقمان علیہ السلام کی وصیتوں کا بیان شروع ہوتا ہے۔ پہلی وصیت میں اللہ تعالیٰ کے ساتھ شرک کا رد اور اس کی توحید کا بیان تھا، اس وصیت میں اللہ تعالیٰ کے علم اور قدرت کے کمال کا بیان ہے۔ ¤ ➋ اکثر مفسرین کے مطابق {’’ اِنَّهَاۤ ‘‘} میں ضمیر {’’هَا‘‘} نیکی اور بدی کے اس عمل کی طرف جا رہی ہے جس کا ذکر پچھلی آیت {’’بِمَا كُنْتُمْ تَعْمَلُوْنَ ‘‘} میں ہے : {’’ أَيْ إِنَّ الْفِعْلَةَ الْحَسَنَةَ أَوِ السَّيِّئَةَ إِنْ تَكُ مِثْقَالَ حَبَّةٍ ‘‘} یعنی ’’ااچھا یا برا عمل اگر رائی کے ایک دانے کے برابر ہو گا …۔‘‘ ابن عاشور نے فرمایا کہ {’’ تَكُ ‘‘} کا اسم مؤنث مقام کی دلالت کے مطابق مقدر مانا جائے گا :{ ’’ أَيْ إِنْ تَكُ الْكَائِنَةُ ‘‘} یعنی اگر ہونے والی کوئی بھی چیز رائی کے دانے کے برابر ہو گی۔ یہ عام ہے، جس میں نیکی اور بدی بھی شامل ہے۔ ¤ ➌ { مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ:} مراد چھوٹی سے چھوٹی چیز ہے، کیونکہ عرب اس کے لیے {’’مِثْقَالَ ذَرَّةٍ‘‘} کا لفظ استعمال کرتے ہیں، یا {’’ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ ‘‘} کا۔ {’’ مِثْقَالَ ‘‘ ’’ثَقُلَ‘‘} میں سے آلہ کا وزن ہے، بروزن {’’مِفْعَالٌ۔‘‘} ¤ ➍ { فَتَكُنْ فِيْ صَخْرَةٍ اَوْ فِي السَّمٰوٰتِ اَوْ فِي الْاَرْضِ :} یہ بیان کسی بھی ایسی چیز کی مثال کے طور پر ہے جو زیادہ سے زیادہ مخفی ہو اور جس کا حصول زیادہ سے زیادہ مشکل ہو۔ ¤ ➎ { يَاْتِ بِهَا اللّٰهُ:} اس میں اللہ تعالیٰ کے کمال علم اور قدرت کا بیان ہے کہ کوئی چیز کہیں بھی ہو، کتنی پوشیدہ سے پوشیدہ اور کتنی بعید سے بعید ہو، اللہ تعالیٰ کو معلوم ہے کہ وہ کہاں ہے اور وہ اسے حاضر کرنے پر پوری طرح قادر ہے۔ جب چاہے گا اسے اپنے پاس لے آئے گا۔ اس میں یہ بھی شامل ہے کہ کوئی عمل نیک ہو یا بد، جتنا بھی چھپ کر کیا جائے اور اس کا کرنے والا کہیں بھی چلا جائے، اللہ تعالیٰ اسے اور اس کے کرنے والے کو اپنے پاس لے آئے گا اور اس کی جزا دے گا۔ (دیکھیے سورۂ انبیاء : ۴۷) جب اتنی مخفی اور عام رسائی سے باہر چیزوں کے متعلق اس کے علم و قدرت کا یہ عالم ہے، تو ان چیزوں کے بارے میں اس کے علم اور قدرت کا خود ہی اندازہ لگا لو جو اتنی مشکل اور دشوار نہیں ہیں۔ اس وصیت میں حدیثِ جبریل میں مذکور ’’احسان‘‘ کی تاکید ہے کہ آدمی ہر وقت یہ خیال رکھے کہ میں جو کچھ کر رہا ہوں میرا مالک مجھے دیکھ رہا ہے اور وہ مجھ پر پوری قدرت رکھتا ہے۔ اس سے انسان اللہ تعالیٰ کی معصیت سے بچ جاتا ہے۔ ¤ ➏ { اِنَّ اللّٰهَ لَطِيْفٌ خَبِيْرٌ : ’’لُطْفٌ‘‘} میں باریک بینی اور نرمی دونوں مفہوم پائے جاتے ہیں۔ ابن عاشور نے فرمایا : {’’اَللَّطِيْفُ مَنْ يَّعْلَمُ دَقَائِقَ الْأَشْيَاءِ وَيَسْلُكُ فِيْ إِيْصَالِهَا إِلٰي مَنْ تَصْلُحُ لَهُ مَسْلَكَ الرِّفْقِ‘‘} ’’لطیف وہ ہے جو نہایت باریک اشیاء کو جانتا ہو اور جن کے لائق وہ چیزیں ہیں ان تک انھیں پہنچانے میں نرمی کا طریقہ اختیار کرے۔‘‘ مثلاً اس کے لطیف ہونے کا اظہار اس کیڑے کے وجود سے ہوتا ہے جو کسی بہت بڑی چٹان کے اندر ہے، جس تک پہنچنے کا یا خوراک پہنچانے کا کوئی راستہ نہیں۔ اب یہ اس لطیف و خبیر کا کام ہے کہ اس نے اسے وہاں کس طرح پیدا فرمایا، پھر ہر لمحے اس کی ہر ضرورت اسے پہنچائی، پھر جب چاہے چٹان کو توڑ کر یا توڑے بغیر اور اسے ذرہ بھر خراش پہنچائے بغیر جہاں چاہے لے آئے۔ جو رائی کے دانے کے برابر اشیاء کا اتنا علم اور ان پر اتنی دسترس رکھتا ہے، بڑی اشیاء کے متعلق اس کے علم و قدرت کا کیا حال ہو گا!؟ یہاں تک بنیادی صحیح عقیدے کا بیان مکمل ہو گیا۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { يٰبُنَيَّ اَقِمِ الصَّلٰوةَ وَ اْمُرْ بِالْمَعْرُوْفِ … :} لقمان علیہ السلام نے بنیادی عقائد کی وصیت کے بعد بیٹے کو بنیادی احکام کی وصیت فرمائی۔ جن میں سب سے اول اور سب سے اہم نماز کی اقامت ہے، جس میں اس کو وقت پر صحیح طریقے اور خشوع و اطمینان کے ساتھ باجماعت ادا کرنا سب کچھ شامل ہے۔ دوسری چیز لوگوں کو نیکی کا حکم دینا اور تیسری چیز برائی سے منع کرنا ہے، کیونکہ سب لوگ دنیا میں آخرت کے سفر پر ہیں۔ اگر کوئی شخص ساتھیوں کا خیال نہیں رکھے گا اور انھیں ساتھ لے کر چلنے کی کوشش نہیں کرے گا تو وہ اسے بھی لے بیٹھیں گے اور وہ منزل پر پہنچنے سے محروم رہے گا۔ اسی طرح اس سفر میں سب لوگ ایک جہاز پر سوار ہیں، اگر اس میں سوراخ کرنے والوں کو روکا نہیں جائے گا تو جہاز کے ڈوبنے کے ساتھ سب ڈوب جائیں گے۔ واضح رہے کہ نیکی کا حکم دینا اور برائی سے منع کرنا دو الگ الگ حکم ہیں اور دونوں پر عمل ضروری ہے۔ جس کا بلند ترین درجہ جہاد فی سبیل اللہ ہے، جسے رسول اللہ صلی اللہ علیہ وسلم نے اسلام کے کوہان کی چوٹی قرار دیا ہے۔ ¤ ➋ اقامتِ صلاۃ، امر بالمعروف اور نہی عن المنکر کے حکم میں ان تینوں کا علم حاصل کرنا خود بخود شامل ہے، کیونکہ یہ مسلّم قاعدہ ہے : {’’مَا لَا يَتِمُّ الْوَاجِبُ إِلَّا بِهِ فَهُوَ وَاجِبٌ‘‘} ’’جن چیزوں کے بغیر واجب پوری طرح ادا نہیں ہوتا وہ بھی واجب ہیں۔‘‘ معروف و منکر کے صحیح علم کے بغیر امر بالمعروف اور نہی عن المنکرکرتے ہوئے عین ممکن ہے کہ کوئی شخص کتاب و سنت اور معروف کی دعوت کے بجائے شرک و بدعت اور خرافات و منکرات کی اشاعت کرتا پھرے، جیسا کہ آج کل بہت سے لوگوں کا یہی حال ہے۔ اس طرح امر بالمعروف اور نہی عن المنکر کے لیے دعوت کا اسلوب، اس کے لیے ضروری حکمت، موعظہ حسنہ، نرمی اور برداشت سیکھنا اور اختیار کرنا بھی لازم ہے۔ اس کے ساتھ ساتھ برائی کو روکنے کے لیے جہاد فی سبیل اللہ کی تیاری اور اس کے لیے مطلوب قوت، گھوڑے اور سواریاں تیار رکھنا بھی لازم ہے۔ غرض لقمان علیہ السلام کی اس نصیحت میں اگرچہ نمایاں طور پر نماز کا ذکر آیا ہے، کیونکہ ایمان کے بعد وہ سب سے اہم فریضہ ہے، مگر معروف اور منکر کے ضمن میں پورا اسلام، اس کا علم حاصل کرنا اور اسے آگے پہنچانا سب کچھ آگیا ہے۔ ¤ ➌ { وَ اصْبِرْ عَلٰى مَاۤ اَصَابَكَ :} اگرچہ معروف کے ضمن میں اس کا ذکر آ چکا ہے، تاہم اس کی اہمیت کے پیش نظر اسے الگ بھی ذکر فرمایا۔ اس میں دو چیزیں شامل ہیں، پہلی یہ کہ اقامت صلاۃ، امر بالمعروف اور نہی عن المنکر کے فرائض کی ادائیگی میں پیش آنے والی ہر مصیبت پر صبر کرنا۔ اس میں اس بات کی طرف بھی اشارہ ہے کہ جو شخص بھی یہ کام کرے گا اس پر مصیبتوں نے آنا ہی آنا ہے۔ جنّ و انس کے شیاطین ہاتھ دھو کر اس کے پیچھے پڑ جائیں گے اور اسے ہر قسم کی اذیتوں سے سابقہ پیش آئے گا۔ سو اس پر لازم ہے کہ صبر سے کام لے۔ دوسری چیز یہ کہ دنیا کی زندگی آزمائشوں اور مصیبتوں سے بھری ہوئی ہے، راحت اور آرام صرف جنت میں حاصل ہو گا۔ اس لیے مومن پر لازم ہے کہ اس قید خانے کی ہر تکلیف اور آزمائش پر صبر کرے اور اپنے رب کا شکوہ کرنے کے بجائے اس پر راضی رہے۔ ¤ ➍ {اِنَّ ذٰلِكَ مِنْ عَزْمِ الْاُمُوْرِ : ’’ عَزْمِ ‘‘} مصدر بمعنی اسم مفعول ہے، جو اپنے موصوف کی طرف مضاف ہے : {’’ أَيْ الْأُمُوْرُ الْمَعْزُوْمَةُ‘‘} اس کے دو مطلب ہو سکتے ہیں، ایک یہ کہ {’’ عَزْمِ ‘‘} کا معنی ’’واجب کرنا‘‘ ہے، یعنی یہ چاروں ایسے کاموں میں سے ہیں جو اللہ تعالیٰ کی طرف سے واجب اور فرض کیے گئے ہیں، جیسا کہ حدیث میں ہے : [ إِنَّ اللّٰهَ يُحِبُّ أَنْ تُؤْتَی رُخَصُهُ ، كَمَا يُحِبُّ أَنْ تُؤْتَی عَزَائِمُهُ ] [ صحیح ابن حبان : ۳۵۴، عن ابن عباس رضی اللہ عنھما و صححہ شعیب الأرنؤوط ] ’’اللہ تعالیٰ پسند کرتا ہے کہ اس کی رخصتوں پر عمل کیا جائے، جس طرح وہ پسند کرتا ہے کہ اس کے فرائض پر عمل کیا جائے۔‘‘ اشرف الحواشی میں ہے : ’’دوسرا مطلب اس کا یہ بھی ہو سکتا ہے کہ نیکی کا حکم دینے اور برائی سے روکنے کا یہ کام بڑے عزم و ہمت کا کام ہے، کم ہمت لوگوں کے بس میں نہیں کہ اس کی سختیاں جھیل سکیں۔ اس لیے اپنے اندر عزم و ہمت پیدا کر۔‘‘"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ {وَ لَا تُصَعِّرْ خَدَّكَ لِلنَّاسِ : ’’صَعَرٌ‘‘} اونٹ کو لگنے والی ایک بیماری، جس سے وہ اپنی گردن ایک طرف پھیرے رکھتا ہے۔ اس سے باب ’’تفعیل‘‘ تکلف کے لیے ہے۔ یعنی تکلف سے ایک طرف منہ پھیرے رکھنا۔ یہ انداز حقارت کے اظہار کے لیے استعمال ہوتا ہے۔ عمرو بن حُنَیّ تغلبی نے اپنے بعض بادشاہوں کو مخاطب کرتے ہوئے کہا : ¤ {وَ كُنَّا إِذَا الْجَبَّارُ صَعَّرَ خَدَّهُ ¤ أَقَمْنَا لَهُ مِنْ مَيْلِهِ فَتَقَوَّمَا} ¤ ’’اوور ہم ایسے تھے کہ جب کسی جبار نے اپنا رخسار ٹیڑھا کیا، تو ہم نے اس کی ٹیڑھ سیدھی کر دی، سو تو بھی سیدھا ہو جا۔‘‘ ( {فَتَقَوَّمَا} امر كا صيغہ ہے (ابو عبید) اور آخر ميں الف اشباع كے ليے ہے) ¤ ➋ احکام کی وصیت کے بعد لقمان علیہ السلام نے چند آداب و اخلاق کی وصیت فرمائی، فرمایا لوگوں کے لیے اپنا رخسار ٹیڑھا نہ رکھ، یعنی انھیں حقیر سمجھ کر ایسا نہ کر جیسے متکبر اور مغرور لوگ کرتے ہیں، بلکہ تواضع اور نرمی اختیار کر، جیسا کہ عقل مند لوگوں کا شیوہ ہے۔ تحقیر کے اس انداز سے منع کرنے میں زبان یا ہاتھ کے ساتھ کسی کی تحقیر سے منع کرنا بالاولیٰ شامل ہے۔ یہ ایسے ہی ہے جیسے فرمایا: « {فَلَا تَقُلْ لَّهُمَاۤ اُفٍّ} » [ بني إسرائیل : ۲۳ ] ’’ماں باپ کو ’’اُف‘‘ نہ کہو۔‘‘ مراد کسی بھی طرح تکلیف پہنچانے سے منع کرنا ہے۔ ¤ ➌ {وَ لَا تَمْشِ فِي الْاَرْضِ مَرَحًا :} یہاں ایک سوال ہے کہ چلا زمین ہی پر جاتا ہے، پھر خاص طور پر اس کا ذکر کرنے میں کیا حکمت ہے؟ جواب اس کا یہ ہے کہ تمام لوگوں کی طرح اس زمین سے تمھاری پیدائش ہے، اسی میں تم نے دفن ہونا ہے اور دوسرے تمام لوگ بھی اسی زمین پر چل رہے ہیں، پھر تمھارا دوسروں کو حقیر اور اپنے آپ کو ان سے برتر سمجھنا اور اکڑ کر چلنا تمھیں کس طرح زیب دیتا ہے؟ (واللہ اعلم) سورۂ بنی اسرائیل (۳۷) میں یہ مضمون زیادہ وضاحت کے ساتھ بیان ہوا ہے۔ ¤ ➍ {اِنَّ اللّٰهَ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُوْرٍ :} اس کی تففسیر کے لیے دیکھیے سورۂ نساء (۳۶)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ {وَ اقْصِدْ فِيْ مَشْيِكَ :} اکڑ کر چلنے سے منع کیا تو ممکن تھا کہ اس پر عمل کرتے ہوئے کوئی انتہائی کمزور اور مریل چال اختیار کرتا، اس لیے چال میں میانہ روی کا حکم دیا، جس سے نہ تکبر کا اظہار ہوتا ہو نہ کمزوری کا۔ مزید دیکھیے سورۂ فرقان (۶۳)۔ ¤ ➋ { وَ اغْضُضْ مِنْ صَوْتِكَ : ’’ مِنْ ‘‘} تبعیض کے لیے ہے، اس لیے ترجمہ کیا گیا ہے ’’ اور اپنی آواز کچھ نیچی رکھ۔‘‘ اس سے معلوم ہوا کہ بلا ضرورت اونچی آواز سے نہیں بولنا چاہیے، کیونکہ یہ وقار کے خلاف ہے اور چلا کر بولنے سے سننے والے کو تکلیف ہوتی ہے۔ بولتے وقت اپنی آواز کسی قدر پست رکھنی چاہیے، نہ اتنی کہ سننے والے سن یا سمجھ ہی نہ سکیں۔ ¤ ➌ { اِنَّ اَنْكَرَ الْاَصْوَاتِ لَصَوْتُ الْحَمِيْرِ :} یعنی بلا ضرورت اونچی آواز سے بولنے اور چیخنے کی مثال گدھے کی آواز جیسی ہے اور تمام آوازوں سے بری آواز گدھے کی ہے۔ اللہ تعالیٰ نے جہنمیوں کے چیخنے چلانے کی آوازوں کو {’’ زَفِيْرٌ ‘‘} اور {’’ شَهِيْقٌ ‘‘} (گدھے کی آواز) کہا ہے۔ (دیکھیے ہود : ۱۰۶ ) کفار جب جہنم میں پھینکے جائیں گے تو اس کی خوف ناک آواز جو انھیں سنائی دے گی، اللہ تعالیٰ نے اسے بھی {’’ شَهِيْقًا ‘‘} فرمایا ہے۔ (دیکھیے ملک : ۷ ) اس سے گدھے کی آواز کا شدید مکروہ ہونا ظاہر ہوتا ہے۔ رازی نے یہاں ایک نکتہ بیان کیا ہے کہ ہر جانور جب بولتا ہے تو اس سے اندازہ ہو جاتا ہے کہ وہ تکان کی وجہ سے بول رہا ہے یا بوجھ سے یا خوف یا مار کی وجہ سے یا کسی اور وجہ سے، صرف گدھا ایسا جانور ہے جو کسی ضرورت کی وجہ سے نہیں بولتا، وہ نہ بوجھ کی وجہ سے بولتا ہے نہ مارنے سے، حتیٰ کہ اگر اسے جان سے مار دیا جائے تو بھی نہیں بولتا اور بولتا ہے تو بلاضرورت ہی بولتا چلا جاتا ہے۔ اس لیے اس کی آواز سب سے زیادہ بری لگنے کی ایک وجہ اس کی کرختگی اور شدت کے علاوہ یہ بھی ہے۔ (الکبیر) رسول اللہ صلی اللہ علیہ وسلم نے گدھے کے رینکنے کی وجہ اس کا شیطان کو دیکھنا بیان فرمایا ہے۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْأَلُوا اللّٰهَ مِنْ فَضْلِهِ فَإِنَّهَا رَأَتْ مَلَكًا، وَإِذَا سَمِمِعْتُمْ نَهِيْقَ الْحِمَارِ فَتَعَوَّذُوْا بِاللّٰهِ مِنَ الشَّيْطَانِ فَإِنَّهُ رَأَی شَيْطَانًا ] [ بخاري، بدء الخلق، باب خیر مال المسلم غنم … : ۳۳۰۳ ] ’’جب تم مرغوں کے چیخنے کی آواز سنو تو اللہ سے اس کے فضل کا سوال کرو، کیونکہ انھوں نے کوئی فرشتہ دیکھا ہے اور جب تم گدھے کے رینکنے کی آواز سنو تو شیطان سے اللہ کی پناہ مانگو، کیونکہ اس نے کوئی شیطان دیکھا ہے۔‘‘ یہ مثال دینے کا مطلب یہ ہے کہ تم گدھے کی مشابہت اختیار مت کرو۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ لَنَا مَثَلُ السَّوْءِ، الَّذِيْ يَعُوْدُ فِيْ هِبَتِهِ كَالْكَلْبِ يَرْجِعُ فِيْ قَيْئِهِ ] [ بخاري، الھبۃ، باب لا یحل لأحد أن یرجع في ھبتہ و صدقتہ : ۲۶۲۲، عن ابن عباس رضی اللہ عنھما ]’’بری مثال ہمارے لیے نہیں ہے (ہمیں اس کا مصداق نہیں بننا چاہیے) وہ شخص جو اپنے ہبہ کو واپس لیتا ہے، وہ کتے کی طرح ہے، جو اپنی قے چاٹ لیتا ہے۔‘‘ ¤ ➍ {’’ الْحَمِيْرِ ‘‘ ’’حِمَارٌ‘‘} کی جمع ہے۔ ابن عاشور لکھتے ہیں: ’’قرآن مجید میں گدھے کے لیے جمع کا لفظ {’’ الْحَمِيْرِ ‘‘} آیا ہے، حالانکہ لفظ {’’صَوْتٌ‘‘} مفرد ہے۔ {’’حِمَارٌ‘‘} کا لفظ نہیں فرمایا، کیونکہ جس جمع پر جنس کا الف لام آجائے وہ مفرد و جمع کے لیے یکساں ہوتا ہے۔ اس لیے کہا جاتاہے کہ جمع پر جنس کا الف لام آجائے تو وہ اس سے جمع ہونے کا مفہوم ختم کر دیتا ہے۔ یہاں {’’حِمَارٌ‘‘} کے بجائے {’’ الْحَمِيْرِ ‘‘} کے لفظ کو اس لیے ترجیح دی گئی ہے، کیونکہ {’’ الْحَمِيْرِ ‘‘} کا لفظ آیات کے فواصل سے زیادہ مناسبت رکھتا ہے، جیسا کہ اس سے پہلی اور بعد والی آیات کے فواصل کو دیکھھنے سے ظاہر ہے، جو {’’ خَبِيْرٌ ، الْاُمُوْرِ ، فَخُوْرٍ ، مُنِيْرٍ ‘‘} اور {’’ السَّعِيْرِ ‘‘} وغیرہ ہیں۔‘‘ (التحریر والتنویر) ہمارے بھائی حافظ عبد اللہ رفیق صاحب (دار العلوم المحمدیہ لاہور) نے اس کی ایک اور دلچسپ توجیہ فرمائی ہے کہ گدھے اکٹھے مل کر رینکنا شروع کر دیں تو ماحول بہت زیادہ خراب ہو جاتا ہے۔ یہاں لقمان علیہ السلام کی وصیتیں ختم ہو گئیں، آگے پھر توحید کے دلائل اور مشرکین کو ڈانٹ ڈپٹ کا سلسلہ شروع ہوتا ہے، جس کے ساتھ سورت کی ابتدا ہوئی تھی۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ {اَلَمْ تَرَوْا اَنَّ اللّٰهَ سَخَّرَ لَكُمْ مَّا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضضِ: ’’ اَلَمْ تَرَوْا ‘‘} کا معنی {’’اَلَمْ تَعْلَمُوْا‘‘} (کییا تم نے جانا) ہے، کیونکہ انسان نے آسمان و زمین کی ہر چیز کو اپنی آنکھوں سے اپنی خاطر مسخر شدہ نہیں دیکھا، مگر اس کے لیے دیکھنے کا لفظ اس لیے استعمال فرمایا کہ یہ بات اتنی واضح ہے جیسے آنکھوں سے دیکھی ہوئی بات ہوتی ہے۔ (بقاعی) {’’ سَخَّرَ لَكُمْ ‘‘} میں لام انتفاع کا ہے، اس لیے ترجمہ کیا گیا ہے ’’تمھاری خاطر مسخر کر دیا‘‘ کیونکہ چند چیزیں اگر انسان کے کسی حد تک تابع فرمان ہیں، جیسے چوپائے وغیرہ کہ انسان ان سے جس طرح چاہے فائدہ اٹھا سکتا ہے، تو بے شمار چیزیں ایسی ہیں جن پر انسان کا کوئی اختیار نہیں۔ انھیں انسان کی خاطر مسخر کرنے کا مطلب یہ ہے کہ اللہ تعالیٰ نے انھیں پابند کر دیا ہے کہ وہ سب اس کے فائدے اور خدمت کے لیے کام کریں، جیسے سورج، چاند، ستارے بلکہ فرشتے بھی جو اس کی حفاظت کرتے ہیں۔ موذی جانور بھی آخر کار کسی نہ کسی طرح انسان کے فائدے کے لیے ہیں، حتیٰ کہ ابلیس بھی کہ وہ نہ ہوتا تو نہ آزمائش کا سلسلہ ہوتا، نہ اس میں کامیاب ہو کر انسان ہمیشہ کی جنت کا وارث بن سکتا۔ وہ لوگ اپنی حیثیت سے بہت بڑھ کر بولتے ہیں جو کہتے ہیں کہ آدمی سائنس کے ساتھ کائنات کو مسخر کر سکتا ہے۔ کائنات تو بہت دور کی بات ہے، یہ حضرات اپنے دل کی دھڑکن ہی کو مسخر کر کے دکھائیں، یا بچپن سے جوانی، پھر بڑھاپے کی منزلوں کو تابع فرمان بنا کر دکھائیں، چلیں موت ہی کو مسخر کر لیں۔ فرمایا : «{ كَبُرَتْ كَلِمَةً تَخْرُجُ مِنْ اَفْوَاهِهِمْ اِنْ يَّقُوْلُوْنَ اِلَّا كَذِبًا }» [ الکہف : ۵ ] ’’(یہ بات) بولنے میں بڑی ہے، جو ان کے مونہوں سے نکلتی ہے، وہ سراسر جھوٹ کے سوا کچھ نہیں کہتے۔‘‘ اس سے پہلے اللہ تعالیٰ نے اپنی توحید کی دلیل {’’ خَلَقَ السَّمٰوٰتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا …‘‘} بیان فرمائی تھی، اب زمین و آسمان کی ہر چیز کو انسان کے فائدے کے لیے مسخر کرنے کو اپنی توحید کی دلیل کے طور پر بیان فرمایا کہ سوچو! اس خلق یا تسخیر میں تمھارے کسی معبود کا ذرہ برابر بھی دخل ہے؟ ¤ ➋ {وَ اَسْبَغَ عَلَيْكُمْ نِعَمَهٗ ظَاهِرَةً وَّ بَاطِنَةً:} کھلی نعمتوں سے مراد وہ نعمتیں ہیں جن کا انسان اپنے حواس سے مشاہدہ کرتا ہے، یا وہ عقل سے معلوم ہوتی ہیں، یا اسے کسی کے بتانے سے معلوم ہوتی ہیں اور چھپی نعمتوں سے مراد وہ نعمتیں ہیں جو انسان کے جسم کے اندر یا باہر اس کے مفاد کے لیے کام کر رہی ہیں، جن کا اسے شعور تک نہیں کہ اس کے پروردگار نے اس کے رزق، اس کی نشوونما اور حفاظت کے لیے کیا کچھ سامان فراہم کر رکھا ہے۔ مثلاً انسان کھانا کھا کر فارغ ہو جاتا ہے، اسے کچھ خبر نہیں کہ اس کے اندر کتنی مشینیں اسے ہضم کرنے، جزو بدن بنانے اور اس کے فضلے کو خارج کرنے کے لیے پوری مستعدی کے ساتھ مصروف عمل ہو جاتی ہیں۔ سائنس کے مختلف شعبوں میں جیسے جیسے تحقیق آگے بڑھتی جا رہی ہے اللہ تعالیٰ کی بے شمار نعمتیں انسان کے سامنے بے نقاب ہوتی جا رہی ہیں۔ یہ تو ہوئیں دنیوی اور مادی نعمتیں، دینی اور روحانی نعمتیں جو ظاہر اور پوشیدہ ہیں، وہ ان کے علاوہ ہیں اور ان سے کہیں زیادہ ہیں، جیسا کہ اسلام، قرآن، نبی کریم صلی اللہ علیہ وسلم اور اللہ تعالیٰ کی بے پایاں رحمت وغیرہ۔ رازی نے {’’ ظَاهِرَةً وَّ بَاطِنَةً ‘‘} کی ایک سادہ سی پُر لطف توجیہ کی ہے، وہ فرماتے ہیں : ’’ظاہری نعمتوں سے مراد اعضائے انسانی کا سلامت ہونا ہے اور باطنی نعمتوں سے مراد وہ قوتیں ہیں جو ان اعضا میں ودیعت کی گئی ہیں۔ دیکھیے آنکھ، کان، ناک اور زبان سب چربی، گوشت، ہڈی اور پٹھوں سے بنے ہیں، جو صاف نظر آتے ہیں، مگر ان میں دیکھنے، سننے، سونگھنے، چکھنے اور بولنے کی قوتیں باطنی نعمتیں ہیں۔ بعض اوقات باطنی نعمت مثلاً بینائی، شنوائی ختم ہو جاتی ہے، جب کہ ظاہری عضو، مثلاً آنکھ یا کان سلامت رہتا ہے۔ یہی حال ہر عضو کا ہے۔‘‘ ¤ ➌ {وَ مِنَ النَّاسِ مَنْ يُّجَادِلُ فِي اللّٰهِ … :} یعنی کچھ لوگ ایسے ہیں جو خلق، تسخیر اور دوسری بے شمار ظاہری و باطنی نعمتوں کے دلائل سے اللہ تعالیٰ کی وحدانیت ثابت ہو چکنے کے باوجود اللہ تعالیٰ کی توحید اور اس کی صفات میں جھگڑتے اور بحثیں کرتے ہیں، مثلاً اللہ تعالیٰ موجود بھی ہے یا نہیں؟ اور ہے تو ایک ہے یا اس کے ساتھ دوسرے بھی خدائی میں شریک ہیں؟ اور اس کی صفات کیا ہیں ؟ ¤ ➍ {بِغَيْرِ عِلْمٍ وَّ لَا هُدًى وَّ لَا كِتٰبٍ مُّنِيْرٍ:} علم حاصل کرنے کے تین مراتب ہیں، پہلا اپنی جدوجہد اور غوروفکر سے معلوم کرنا، دوسرا کسی علم والے سے رہنمائی حاصل کر لینا اور تیسرا کسی درست کتاب کے مطالعہ سے علم حاصل کر لینا۔ مشرکین کا حال یہ ہے کہ نہ ان کے پاس خود کوئی علم یا سمجھ بوجھ ہے جس کی بنا پر وہ حقیقت کو سمجھ سکیں، نہ انھیں کسی سچے راہ نما کی راہ نمائی حاصل ہے اور نہ ان کے پاس خود اللہ تعالیٰ کی بھیجی ہوئی کوئی کتاب موجود ہے جس سے انھوں نے یہ عقیدہ اخذ کیا ہو۔ بلکہ علم کے تینوں ذرائع سے محرومی کے بعد ان کی کل کائنات تقلید آباء ہے اور وہ اندھا دھند ان کے پیچھے چلے جا رہے ہیں۔ ¤ ➎ حافظ صاحبان یاد رکھیں کہ{’’ اَلَمْ تَرَوْا ‘‘} قرآن مجید میں صرف دو جگہ آیا ہے، ایک اس آیت میں اور دوسرا سورۂ نوح میں : «{ اَلَمْ تَرَوْا كَيْفَ خَلَقَ اللّٰهُ سَبْعَ سَمٰوٰتٍ طِبَاقًا } » [ نوح : ۱۵ ] ان کے علاوہ ہر جگہ واحد کے صیغے کے ساتھ {’’ اَلَمْ تَرَ‘‘} ہی آیا ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { وَ اِذَا قِيْلَ لَهُمُ اتَّبِعُوْا مَاۤ اَنْزَلَ اللّٰهُ …:} یعنی کتاب اللہ اور پیغمبر صلی اللہ علیہ وسلم کی ہدایت کے مقابلے میں اپنے جاہل اسلاف کو پیش کرتے ہیں، پھر اس سے بڑھ کر گمراہی اور کیا ہو سکتی ہے؟ مزید دیکھیے سورۂ بقرہ (۱۷۰)۔ ¤ ➋ { اَوَ لَوْ كَانَ الشَّيْطٰنُ يَدْعُوْهُمْ اِلٰى عَذَابِ السَّعِيْرِ :} یعنی کیا اگر شیطان انھیں بھڑکتی ہوئی آگ کے عذاب کی طرف دعوت دے رہا ہو تب بھی یہ ان کے ساتھ دوزخ کی آگ میں جا کودیں گے اور یہ سوچنے کی زحمت ہی نہ کریں گے کہ وہ انھیں کدھرلے جا رہا ہے ؟"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ { وَ مَنْ يُّسْلِمْ وَجْهَهٗۤ اِلَى اللّٰهِ …:} اس سے پہلے ان لوگوں کا ذکر ہوا ہے جو اللہ تعالیٰ کے بارے میں کسی علم، ہدایت یا کتاب منیر کے بغیر جھگڑتے ہیں۔ اب ان کے مقابلے میں اس شخص کا ذکر ہے جو اپنے چہرے یعنی اپنے آپ کو پوری طرح اللہ تعالیٰ کے سپرد اور اس کے حوالے کر دیتا ہے۔ اپنا ہر عمل صرف اس کی رضا کے لیے کرتا ہے۔ جو وہ کہے کرتا ہے، جس سے روک دے رک جاتا ہے۔ نہ اپنی خواہش پر چلتا ہے نہ کسی دوست یا رشتہ دار کے پیچھے چلتا ہے اور نہ آبا و اجداد میں سے کسی کی راہ و رسم اختیار کرتا ہے۔ اس کی نماز، قربانی، زندگی اور موت سب کچھ اللہ تعالیٰ کے لیے ہے، فرمایا : « قُلْ اِنَّ صَلَاتِيْ وَ نُسُكِيْ وَ مَحْيَايَ وَ مَمَاتِيْ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ » [ الأنعام : ۱۶۲ ] ’’کہہ دے بے شک میری نماز اور میری قربانی اور میری زندگی اور میری موت اللہ کے لیے ہے، جو جہانوں کا رب ہے۔‘‘ آیت میں چہرے کو اللہ کے حوالے کرنے کا ذکر ہے، مراد پورے وجود کو اللہ کے حوالے کرنا ہے۔ کیونکہ چہرہ جسم کا سب سے باشرف حصہ ہے، اس کے تابع ہونے سے پورا وجود تابع ہو جاتا ہے۔ ¤ ➋ { وَ هُوَ مُحْسِنٌ :} اور وہ اپنا ہر عمل اس طرح کرتا ہے گویا وہ اپنے رب کو دیکھ رہا ہے۔ سو اگر وہ اسے نہیں دیکھتا تو اس کا رب اسے دیکھ رہا ہے اور وہ ہر عمل میں اللہ کے رسول کے بتائے ہوئے طریقے پر چلتا ہے۔ ¤ ➌ { فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقٰى : ’’أَمْسَكَ يُمْسِكُ إِمْسَاكًا‘‘} تھامنا، پکڑنا۔ {’’ اسْتَمْسَكَ ‘‘} میں حروف زیادہ ہونے کی وجہ سے مبالغہ ہے، یعنی ’’اچھی طرح پکڑ لیا۔‘‘ {’’اَلْعُرْوَةُ‘‘} کڑا یا حلقہ یا رسی کا کنارا جسے لٹکتے ہوئے گرنے سے بچنے کے لیے پکڑ لیا جائے اور {’’ الْوُثْقٰى ‘‘ ’’أَوْثَقُ‘‘} کا مؤنث ہے ’’سب سے مضبوط۔‘‘ یعنی اپنے آپ کو اللہ کے سپرد کر دینے والا یہ وہ شخص ہے جس نے اسلام کی رسی کے مضبوط حلقے کو اچھی طرح تھام لیا ہے۔ اسے بلندی سے پستی میں یا جہنم میں گرنے کا کوئی خطرہ نہیں۔ شیطان اس کا کچھ نہیں بگاڑ سکتا اور اسی حلقے کو تھامے ہوئے آخرکار وہ اللہ تعالیٰ تک پہنچ جائے گا اور اس کی جنت کا وارث بن جائے گا۔ بخلاف ان لوگوں کے جو کسی علم، ہدایت یا کتاب منیر کے بغیر جھگڑتے ہیں کہ انھوں نے اپنی عمارت کی بنیاد ایک گرنے والے کھوکھلے تودے کے کنارے پر رکھی ہے، جو انھیں لے کر جہنم کی آگ میں گرنے والا ہے۔ دیکھیے سورۂ توبہ (۱۰۹)۔ ¤ ➍ { وَ اِلَى اللّٰهِ عَاقِبَةُ الْاُمُوْرِ : ’’ اِلَى اللّٰهِ ‘‘} کو پہلے لانے سے کلام میں حصر پیدا ہو گیا کہ تمام کاموں کا انجام اللہ تعالیٰ ہی کی طرف ہے، کسی اور کی طرف نہیں، وہی ہر کام کی جزا دے گا۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ { وَ مَنْ كَفَرَ فَلَا يَحْزُنْكَ كُفْرُهٗ … :} اس میں رسول اللہ صلی اللہ علیہ وسلم اور آپ کے بعد اسلام کے ہر داعی کو تسلی دی ہے کہ جو شخص ہماری دعوت اور پیغام پہنچنے کے باوجود کفر پر اصرار کرتا ہے، آپ اس کے کفر کی وجہ سے غم زدہ نہ ہوں، آپ کا کام پیغام پہنچانا تھا، وہ آپ نے پہنچا دیا، اب انھوں نے ہمارے پاس واپس آنا ہے تو ہم انھیں وہ سب کچھ بتائیں گے جو انھوں نے کیا۔ اس میں کفار کے لیے زبردست وعید ہے۔ ¤ ➋ { اِنَّ اللّٰهَ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ:} کفار کا کفر کچھ علانیہ تھا کچھ دلوں میں پوشیدہ تھا، فرمایا، اللہ تعالیٰ کو سینوں کی بات کا پوری طرح علم ہے، وہ ان کی بھی جزا دے گا۔ اسی طرح اگر کوئی شخص اسلام کا اظہار کرتا ہے مگر دل میں کفر رکھتا ہے تو اللہ تعالیٰ کو اس کا بھی خوب علم ہے، وہ خود ہی اس سے نمٹ لے گا۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) {نُمَتِّعُهُمْ قَلِيْلًا ثُمَّ نَضْطَرُّهُمْ اِلٰى عَذَابٍ غَلِيْظٍ :} یہ سامعین کے ذہن میں پیدا ہونے والے اس سوال کا جواب ہے کہ اس قدر کفر کے باوجود ان پر عذاب جلدی کیوں نہیں آ جاتا؟ فرمایا، ہم انھیں دنیا میں تھوڑا سا برتنے کا سامان دیں گے، پھر انھیں مجبور اور بے بس کر کے ایک بہت سخت عذاب کی طرف لے جائیں گے، تو وہ کسی طرح ہماری گرفت سے نکل کر بھاگ نہیں سکیں گے۔ {’’ غَلِيْظٍ ‘‘} اصل میں بھاری اور ضخامت والے جسم کو کہتے ہیں، گویا وہ عذاب ان پر ایک ضخیم (لمبے چوڑے اور بھاری) جسم کی طرح آ گرے گا، جس کے بوجھ کے نیچے وہ ایسے دبے ہوں گے کہ کسی طرف نکل نہیں سکیں گے۔ دیکھیے سورۂ یونس (۶۹، ۷۰)۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ { وَ لَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ … :} اس سے پہلے مشرکین کے اللہ تعالیٰ کے متعلق مجادلہ کا ذکر فرمایا، اب ان کے مسکت جواب کا ذکر ہے کہ اگر آپ ان سے پوچھیں کہ ان آسمانوں کو اور زمین کو کس نے پید اکیا ہے، تو وہ یقینا یہی کہیں گے کہ انھیں اللہ تعالیٰ نے پیدا کیا ہے۔ اب اس اقرار کے بعد ان کے پاس جھگڑنے کی کوئی گنجائش نہیں، کیونکہ {’’أَلْمَرْءُ يُؤْخَذُ بِإِقْرَارِهِ‘‘} ’’آدمی اپنے اقرار کے ساتھ پکڑا جاتا ہے۔‘‘ ¤ ➋ {قُلِ الْحَمْدُ لِلّٰهِ:} آپ فرمائیں کہ جب تم نے مان لیا کہ ہر چیز کو پیدا کرنے والا اللہ تعالیٰ ہے، جس میں تمھارے بنائے معبود بھی شامل ہیں، تو تمام حمد اور ہر خوبی کا مالک تو اللہ تعالیٰ ہی ٹھہرا، پھر تم ہر خوبی کے مالک کو چھوڑ کر اس کی عبادت کیوں کرتے ہو جس میں اپنی کوئی خوبی ہے ہی نہیں؟ ¤ ➌ {بَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَ :} بلکہ ان کے اکثر نہیں جانتے کہ وہ کیا کہہ رہے ہیں، یا جو کچھ وہ کہہ رہے ہیں اس کا مطلب اور نتیجہ کیا ہے، مثلاً جب انھوں نے اعتراف کر لیا کہ زمین و آسمان کا خالق اللہ تعالیٰ ہے، تو پھر انھیں لازماً ماننا ہوگا کہ مالک بھی وہی ہے، رب بھی وہی ہے، حاکم اور شارع بھی وہی ہے، عبادت اور بندگی کا حق دار بھی وہی ہے، دعا اور فریاد بھی اسی سے کرنی چاہیے۔ یہ علم و عقل سے کتنی بعید بات اور کتنا بڑا تناقض ہے کہ خالق تو کوئی اور ہو اور معبود اس کی مخلوق میں سے کسی کو بنا لیا جائے۔ ¤ ➍ یہ جو فرمایا کہ ’’ان کے اکثر نہیں جانتے‘‘ تو اس کی وجہ یہ ہے کہ مشرکین میں سے کچھ ایسے بھی تھے اور ہوتے ہیں کہ بات واضح ہونے پر سمجھ لیتے اور مان جاتے ہیں۔ ان کا ذکر آگے {’’ فَمِنْهُمْ مُّقْتَصِدٌ ‘‘} میں آ رہا ہے اور کچھ ایسے ہوتے ہیں جو جانتے ہیں مگر ضد اور عناد کی وجہ سے مانتے نہیں۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) { لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ الْاَرْضِ … :} یہ پہلی آیت ہی کا نتیجہ ہے کہ جب آسمانوں کا اور زمین کا خالق اللہ تعالیٰ ہے تو ظاہر ہے کہ ان کا مالک بھی وہی ہے، اور جب مالک وہ ہے تو ثابت ہوا کہ زمین و آسمان کی ہر چیز اپنے وجود اور بقا میں اس کی محتاج ہے اور وہ سب سے غنی ہے، کسی کا محتاج نہیں اور ہر حمد کا مالک ہے۔ دیکھیے اسی سورت کی آیت (۱۲)۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ {وَ لَوْ اَنَّ مَا فِي الْاَرْضِ مِنْ شَجَرَةٍ اَقْلَامٌ … : ’’ كَلِمٰتُ ‘‘ ’’كَلِمَةٌ‘‘} کی جمع ہے، جس کا معنی کلام ہے، جیسا کہ فرمایا : «{ اِنَّهَا كَلِمَةٌ هُوَ قَآىِٕلُهَا }» [ المؤمنون : ۱۰۰ ] ’’یہ تو ایک بات ہے جسے وہ کہنے والا ہے۔‘‘ مراد اللہ تعالیٰ کے دوسرے کلام کے ساتھ ساتھ کلمہ {’’كُنْ‘‘} بھی ہے۔ یہ اس خیال کا رد ہے جو ذہن میں پیدا ہو سکتا ہے کہ بے شک اللہ تعالیٰ زمین و آسمان کا مالک ہے اور وہ غنی ہے، مگر یہ سب کچھ ختم بھی تو ہو سکتا ہے اور جو غنی ہے وہ محتاج بھی تو ہو سکتا ہے۔ اس خیال کے رد میں فرمایا کہ اللہ تعالیٰ کی ملکیت میں کبھی کمی نہیں ہو سکتی اور نہ وہ کبھی محتاج ہو سکتا ہے، کیونکہ وہ جب کسی چیز کا ارادہ کرتا ہے تو وہ کلمہ ’’کُنْ‘‘ کہنے سے ہو جاتی ہے۔ اس کے علاوہ بھی وہ جو بات چاہے کر سکتا ہے اور کرتا ہے۔ جس طرح اس کی ذات کی نہ ابتدا ہے نہ انتہا، اسی طرح اس کے کلمات کی نہ ابتدا ہے نہ انتہا اور نہ ان کا شمار ہو سکتا ہے۔ پھر جو مالک ایک کلمہ {’’كُنْ‘‘} کہنے سے سارے عالم کو فنا کر سکتا ہے اور ایک {’’كُنْ‘‘} کہہ کر اس جیسے بلکہ اس سے کہیں بڑے اور اعلیٰ کروڑوں جہاں پیدا کر سکتا ہے اور جس کے کلمات کی کوئی انتہا نہیں اور نہ وہ کبھی ختم ہو سکتے ہیں، ایسے مالک کے ملک کو کبھی زوال ہو سکتا ہے؟ یا وہ کبھی محتاج ہو سکتا ہے؟ نہیں، وہ ہمیشہ سے غنی و حمید ہے اور عزیزو حکیم ہے اور ہمیشہ رہے گا۔ ¤ ➋ مفسر ابن کثیر لکھتے ہیں : ’’اللہ تعالیٰ اپنی عظمت، کبریائی، جلال، اپنے اسماء و صفاتِ حسنیٰ اور اپنے کامل کلمات کے متعلق بتاتے ہوئے فرماتے ہیں، جن کا نہ کوئی احاطہ کر سکتا ہے اور نہ کسی بشر کو ان کی حقیقت اور شمار کا علم ہے، جیسا کہ سیدالبشر اور خاتم الرسل صلی اللہ علیہ وسلم نے فرمایا : [ لَا أُحْصِيْ ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلٰی نَفْسِكَ ] [ مسلم، الصلاۃ، باب ما یقال في الرکوع و السجود؟ : ۴۸۶ ] ’’میں تیری ثنا کا شمار نہیں کر سکتا، تو اسی طرح ہے جیسے تو نے خود اپنی ثنا کی ہے۔‘‘ چنانچہ فرمایا : «{ وَ لَوْ اَنَّ مَا فِي الْاَرْضِ مِنْ شَجَرَةٍ اَقْلَامٌ … }» یعنی اگر زمین کے تمام درخت قلم بنا دیے جائیں اور سمندر کو سیاہی بنا دیا جائے اور اس کے ساتھ سات سمندر مزید بڑھا دیے جائیں اور ان کے ساتھ اللہ تعالیٰ کے کلمات لکھے جائیں، جو اس کی عظمت، جلال اور اس کی صفات پر دلالت کرکرتے ہیں، تو قلم ٹوٹ جائیں گے، سمندروں کا پانی ختم ہو جائے گا، خواہ ان جیسے جتنے بھی اور لے آئیں۔ ’’سات سمندروں‘‘ کا ذکر صرف مبالغہ کے لیے ہے، اس سے حصر مراد نہیں، نہ ہی یہ بات ہے کہ کوئی سات سمندر موجود ہیں جو عالم کو گھیرے ہوئے ہیں، جیسا کہ بعض لوگوں نے کہا ہے جو اسرائیلیات بیان کرتے ہیں، جن کی تصدیق یا تکذیب نہیں ہو سکتی، بلکہ حقیقت وہ ہے جو اللہ تعالیٰ نے دوسری آیت میں بیان فرمایا : «{ قُلْ لَّوْ كَانَ الْبَحْرُ مِدَادًا لِّكَلِمٰتِ رَبِّيْ لَنَفِدَ الْبَححْرُ قَبْلَ اَنْ تَنْفَدَ كَلِمٰتُ رَبِّيْ وَ لَوْ جِئْنَا بِمِثْلِهٖ مَدَدًا }» [ الکہف : ۱۰۹ ] ’’کہہ دے اگر سمندر میرے رب کی باتوں کے لیے سیاہی بن جائے تو یقینا سمندر ختم ہوجائے گا اس سے پہلے کہ میرے رب کی باتیں ختم ہوں، اگرچہ ہم اس کے برابر اور سیاہی لے آئیں۔‘‘ چنانچہ اس کی مثل سے مراد اس جیسا ایک اور سمندر نہیں بلکہ اس جیسا، پھر اس جیسا، پھر اس جیسا، اس طرح آگے بڑھاتے جاؤ۔ جتنے بھی سمندر لے آئیں اللہ کے کلمات ختم نہ ہوں گے، کیونکہ اللہ تعالیٰ کی آیات اور اس کے کلمات کا شمار نہیں ہو سکتا۔ حسن بصری نے فرمایا : ’’اگر زمین کے تمام درخت قلم بنا دیے جائیں اور سمندر سیاہی ہو جائے اور اللہ تعالیٰ فرمائے کہ ’’میرا یہ حکم ہے اور میرا یہ حکم ہے‘‘ تو سمندر کا پانی ختم ہو جائے گا اور قلم ٹوٹ جائیں گے۔‘‘ (ابن کثیر) ¤ ➌ { اِنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ :} یعنی اللہ تعالیٰ ہر چیز پر غالب اور زبردست ہے، وہ جو ارادہ کرے کوئی نہ اسے روک سکتا ہے، نہ اس سے باز پرس کر سکتا ہے، اور وہ کمال حکمت والا ہے، اس کا غلبہ اندھے کی لاٹھی نہیں، بلکہ اس کا ہر کام سراسر حکمت پر مبنی ہے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { مَا خَلْقُكُمْ وَ لَا بَعْثُكُمْ اِلَّا كَنَفْسٍ وَّاحِدَةٍ :} اللہ تعالیٰ کے کمال علم و قدرت کے بیان کے بعد کفار کی اس بات کی تردید فرمائی کہ ہم دوبارہ کیسے زندہ کیے جائیں گے؟ چنانچہ فرمایا، تم سب کو پیدا کرنا اور دوبارہ زندہ کرنا اللہ تعالیٰ کے لیے ایک شخص کے پیدا کرنے اور زندہ کرنے کی طرح ہی ہے، کیونکہ وہ تمام چیزوں کو کلمہ {’’كُنْ‘‘} سے موجود کر دیتا ہے، پھر تمھیں دوبارہ زندہ کر دینا اس کے لیے کیا مشکل ہے؟ دیکھیے سورۂ یٰس (۲۲ اور ۷۹)۔ ¤ ➋ { اِنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ :} ان دو صفات کی مناسبت یہاں یہ ہے کہ اللہ تعالیٰ اربوں انسانوں کی پکار بیک وقت سن لیتا ہے۔ ایک انسان کی دعا سننا اسے دوسرے کی دعا سننے سے غافل یا قاصر نہیں بنا سکتا۔ اس کے لیے ایک انسان کی ایک وقت میں دعا سننا اور اربوں انسانوں کی اسی وقت دعا سننا برابر ہے۔ پھر اس کی مخلوق صرف انسان ہی نہیں بلکہ لاکھوں انواع میں اور اربوں کھربوں کی تعداد میں ہے، وہ ان سب کی دعا اور فریاد سنتا ہے اور ایک چیونٹی کی بھی فریاد اسی طرح سنتا ہے جیسے ایک انسان کی۔ پھر معاملہ سننے تک محدود نہیں بلکہ سننے کے ساتھ وہ اپنی ساری مخلوق کو دیکھ بھی رہا ہے۔ ان کے ظاہری اور باطنی حالات سے واقف بھی ہے، انھیں رزق بھی پہنچا رہا ہے اور ان کی جملہ ضروریات بھی پوری کر رہا ہے۔ یہی حال اس کی تخلیق کا ہے، اس کا ایک انسان کو پیدا کرنا بھی ایسے ہی ہے جیسے سب انسانوں کو پیدا کرنا۔ وہ ایک ہی وقت میں لاکھوں انسانوں اور اربوں دوسری مخلوق کو اس وقت بھی پیدا کر رہا ہے اور مرنے کے بعد قیامت کے دن دوبارہ تمام انسانوں کو ایسے ہی ایک وقت میں دوبارہ اٹھا کھڑا کرے گا۔ اس کے لیے ایک انسان کے دوبارہ پیدا کرنے اور سب انسانوں کے دوبارہ پیدا کرنے میں کوئی فرق نہیں۔ (کیلانی)"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { اَلَمْ تَرَ اَنَّ اللّٰهَ يُوْلِجُ الَّيْلَ فِي النَّهَارِ … :} اس کی تفسیر کے لیے دیکھیے سورۂ آل عمران (۲۷) یہ اس بات کی دلیل ہے کہ اللہ تعالیٰ کے لیے تمام انسانوں کو پیدا کرنا اور دوبارہ زندہ کرنا ایسے ہی ہے جیسے ایک جان کو پیدا کرنا اور دوبارہ زندہ کرنا۔ تم اپنی آنکھوں سے دیکھتے ہو کہ جب دن بڑھنے لگتے ہیں تو ہر روز رات کا ایک حصہ دن میں شامل ہو جاتا ہے، پھر سردیوں کی آمد کے ساتھ دن کا وہی حصہ رات میں شامل ہوتا جاتا ہے۔ دن کو رات اور رات کو دن کا حصہ بنا دینے والے کے لیے تمھاری موت کے بعد حیات بالکل معمولی بات ہے۔ یہ معنی بھی ہو سکتا ہے کہ وہ رات کی تاریکی کو دن کی روشنی پر اور دن کی روشنی کو رات کی تاریکی پر لے آتا ہے۔ ¤ ➋ { وَ سَخَّرَ الشَّمْسَ وَ الْقَمَرَ كُلٌّ يَّجْرِيْۤ اِلٰۤى اَجَلٍ مُّسَمًّى:} حافظ صاحبان توجہ فرمائیں کہ پورے قرآن مجید میں {’’ كُلٌّ يَّجْرِيْۤ اِلٰۤى اَجَلٍ مُّسَمًّى ‘‘} اسی مقام پر ہے۔ دوسرے تمام مقامات پر{’’ كُلٌّ يَّجْرِيْۤ لِأَجَلٍ مُّسَمًّى ‘‘} ہے۔ یہ دوبارہ زندزندگی کے ممکن ہونے کی دوسری دلیل ہے۔ یعنی انسان سے کہیں بڑی مخلوق سورج اور چاند کا اس طرح مسخر ہونا کہ مدت ہائے دراز سے اسی طرح چل رہے ہیں اور اس وقت تک چلتے رہیں گے جو اللہ تعالیٰ نے ان کے لیے مقرر فرمایا ہے۔ {’’ اِلٰۤى اَجَلٍ مُّسَمًّى ‘‘} (ایک مقرر وقت تک) کے لفظ میں کئی چیزیں شامل ہیں، پہلی یہ کہ رات دن کی روزانہ کی گردش میں یہ دونوں صبح سے شام تک اور شام سے صبح تک چلتے ہیں، پھر اسی سفر پر روانہ ہو جاتے ہیں۔ ان کا روزانہ کا یہ سفر مشرق سے مغرب اور مغرب سے مشرق کی طرف رہٹ کی طرح جاری رہتا ہے۔ دوسری یہ کہ طلوع و غروب کے وقت کے لحاظ سے چاند ایک ماہ میں اپنا سفر پورا کر کے اسی وقت طلوع ہوتا ہے جس وقت وہ پچھلے ماہ طلوع ہوا تھا اور سورج سال کے بعد عین اسی وقت طلوع ہوتا ہے جس وقت وہ پچھلے سال طلوع ہوا تھا۔ تیسری یہ کہ سورج اور چاند اس وقت تک چل رہے ہیں جو اللہ تعالیٰ نے ان کی گردش ختم ہونے کے لیے مقرر فرمایا ہے اور وہ قیامت کا دن ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «{ اِذَا الشَّمْسُ كُوِّرَتْ (1) وَ اِذَا النُّجُوْمُ انْكَدَرَتْ }» [التکویر : ۱، ۲ ] ’’جب سورج لپیٹ دیا جائے گا۔ اور جب ستارے بے نور ہو جائیں گے۔‘‘ آیات کے سیاق کے لحاظ سے یہ معنی یہاں زیادہ مناسب ہے، اس لیے اکثر مفسرین نے یہاں {’’ اِلٰۤى اَجَلٍ مُّسَمًّى ‘‘} سے قیامت کا دن ہی مراد لیا ہے۔ ¤ ➌ یہاں ایک سوال یہ ہے کہ اس مقام پر {’’ اِلٰۤى اَجَلٍ مُّسَمًّى ‘‘} کا لفظ استعمال فرمایا ہے، جب کہ دوسرے مقامات پر {’’ لِاَجَلٍ مُّسَمًّى ‘‘} استعمال فرمایا ہے، اس میں کیا حکمت ہے؟ سلیمان الجمل نے فرمایا : ’’یہاں اللہ تعالیٰ نے {’’ اِلٰۤى اَجَلٍ مُّسَمًّى ‘‘} فرمایا ہے، جب کہ سورۂ فاطر اور سورۂ زمر (اور رعد) میں {’’ لِاَجَلٍ مُّسَمًّى ‘‘} فرمایا ہے۔ کیونکہ یہاں یہ لفظ دو ایسی آیات کے درمیان آیا ہے جن میں اس انتہا کا ذکر ہے جب مخلوق ختم ہو گی، چنانچہ اس سے پہلے{’’ مَا خَلْقُكُمْ وَ لَا بَعْثُكُمْ ‘‘} ہے اور بعد میں {’’ اتَّقُوْا رَبَّكُمْ وَ اخْشَوْا يَوْمًا ‘‘} ہے، دونوں آیات کائنات کے اس نظام کے خاتمے پر دلالت کر رہی ہیں اور سورۂ فاطر اور زمر میں یہ بات نہیں، کیونکہ سورۂ فاطر میں نہ خلق کی ابتدا کا ذکر ہے نہ انتہا کا اور سورۂ زمر میں ابتدا کا ذکر ہے انتہا کا نہیں، اس لیے وہاں ’’لام‘‘ کا لفظ استعمال فرمایا کہ سورج اور چاند جس طرح چلتے دکھائی دے رہے ہیں یہ ایک مقرر وقت پر پہنچنے کے لیے چل رہے ہیں۔ ‘‘ ¤ ➍ {وَّ اَنَّ اللّٰهَ بِمَا تَعْمَلُوْنَ خَبِيْرٌ :} اس کا عطف {’’ اَلَمْ تَرَ اَنَّ اللّٰهَ يُوْلِجُ ‘‘} پر ہے۔ {’’ اَلَمْ تَرَ ‘‘} کا معنی تھا ’’کیا تم نے نہیں جانا؟‘‘ یعنی تم یقینا جانتے ہو کہ اللہ تعالیٰ رات کو دن میں داخل کرتا ہے اور… یہ بھی جانتے ہو کہ تم جو کچھ کرتے ہو اللہ تعالیٰ اس سے پوری طرح باخبر ہے۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { ذٰلِكَ بِاَنَّ اللّٰهَ هُوَ الْحَقُّ :} یعنی یہ سب کچھ اللہ تعالیٰ نے اس لیے بیان فرمایا ہے کہ تم جان لو کہ وہی حق ہے جو حقیقی فاعل و مختار ہے، کیونکہ وہ ازلی و ابدی ہے، ہمیشہ سے ہے اور ہمیشہ رہے گا، اپنے وجود میں وہ کسی کا محتاج نہیں۔ ¤ ➋ {وَ اَنَّ مَا يَدْعُوْنَ مِنْ دُوْنِهِ الْبَاطِلُ :} اور اس کے سوا مشرک جس کی بھی عبادت کرتے ہیں سب باطل ہیں، ان کا کہیں وجود ہی نہیں۔ یہاں نہ کوئی لات ہے، نہ منات، نہ داتا، نہ دستگیر، نہ گنج بخش، نہ غریب نواز۔ سب ان مشرکوں کے خیال اور وہم کی تخلیق ہیں اور انھوں نے اپنے پاس سے فرض کر لیا ہے کہ فلاں صاحب خدائی میں کوئی دخل رکھتے ہیں اور انھیں مشکل کُشائی اور حاجت روائی کے اختیارات حاصل ہیں، حالانکہ فی الواقع ان میں سے کوئی بھی نہ خدائی اختیارات کا مالک ہے، نہ کسی کو پکارنا اور اس سے فریاد کرنا حق ہے۔ دیکھیے سورۂ یونس (۶۶) اور سورۂ نجم (۱۹ تا۲۳)۔ ¤ ➌ ان آیات میں دہریوں کا بھی رد ہے جو اس کائنات کو ازلی اور ابدی سمجھتے ہیں اور مشرکوں کا بھی جو فانی چیزوں کو معبود بنائے بیٹھے ہیں۔ ¤ ➍ { وَ اَنَّ اللّٰهَ هُوَ الْعَلِيُّ الْكَبِيْرُ :} یعنی کائنات کی ہر چیز سے اس کی شان بلند ہے اور بڑائی میں بھی وہ کائنات کی ہر چیز سے بڑا ہے۔ ان دونوں صفات کا مجموعہ {’’ ثُمَّ اسْتَوٰي عَلٰي الْعَرْشِ ‘‘} میں پایا جاتا ہے۔ اس میں ایک واضح اشارہ اس بات کی طرف بھی ہے کہ بلندی اور بڑائی جب اللہ ہی کی شان ہے تو اس کے مقابلے میں ساری مخلوق پست، عاجز اور حقیر ہے، جس کے مفہوم کو لفظ ’’عبد‘‘ ادا کرتا ہے، فرمایا : «{ اِنْ كُلُّ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ اِلَّاۤ اٰتِي الرَّحْمٰنِ عَبْدًا }» [ مریم : ۹۳ ] ’’آسمانوں اور زمین میں جو کوئی بھی ہے وہ رحمان کے پاس غلام بن کر آنے والا ہے۔‘‘ اس سے بڑا ظلم کیا ہو گا کہ اس علی و کبیر کے اختیارات اس کی پیدا کردہ ہستیوں کے لیے سمجھ لیے جائیں جو اس کے عباد اور اس کے سامنے بالکل پست، عاجز اور حقیر ہیں!؟"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ {اَلَمْ تَرَ اَنَّ الْفُلْكَ تَجْرِيْ فِي الْبَحْرِ بِنِعْمَتِ اللّٰهِ … :} اس سے پہلے اللہ نے{’’ اَلَمْ تَرَوْا اَنَّ اللّٰهَ سَخَّرَ لَكُمْ مَّا فِي السَّمٰوٰتِ ‘‘} میں اور{’’ اَلَمْ تَرَ اَنَّ اللّٰهَ يُوْلِجُ الَّيْلَ فِي النَّهَارِ …‘‘} میں اپنی بعض نعمتوں کی طرف توجہ دلائی، اب {’’ اَلَمْ تَرَ اَنَّ الْفُلْكَ ‘‘} میں سمندر میں چلنے والے جہازوں کی نعمت کی طرف متوجہ فرمایا۔ یعنی کیا تم نے دیکھا نہیں کہ کشتیاں اور بحری جہاز سمندر میں محض اللہ تعالیٰ کی نعمت اور اس کے احسان کی بدولت چل رہے ہیں؟ کیونکہ اگر اس کا احسان نہ ہو تو پانی جو ایک سوئی نہیں اٹھاتا بلکہ غرق کر دیتا ہے، پہاڑوں جیسے لمبے چوڑے اور اونچے جہازوں کو اپنے سینے پر نہ اٹھائے رکھے۔ یہ اسی کا احسان ہے کہ اس نے پانی میں یہ خاصیت رکھ دی ہے کہ وہ ایک خاص حجم کی چیز کو نیچے نہیں جانے دیتا، کیونکہ پانی میں ہرچیز کا وزن ہوا میں وزن کی نسبت کم ہوتا ہے اور یہ کمی کسی چیز کے حجم کے برابر پانی کے حجم کے برابر ہوتی ہے۔ (تیسیرالقرآن) اگر اللہ تعالیٰ پانی کو اس طرح پیدا نہ فرماتا، پھر انسان کو پانی کی اس خاصیت کا علم عطا نہ فرماتا اور اس کے جد امجد نوح علیہ السلام کو کشتی بنانے کا طریقہ نہ سکھاتا تو وہ کبھی اس میں کشتیاں یا جہاز نہ چلا سکتا اور نہ ہی اتنی وزنی چیزیں نہایت آسانی کے ساتھ ایک جگہ سے دوسری جگہ منتقل کر سکتا، جو خشکی کے راستے منتقل کرنا اس کے لیے بے حد مشکل تھا۔( دیکھیے یٰس : ۴۱ تا ۴۴) پھر سمندر میں آندھیاں، طوفان اور تلاطم خیز موجیں انسان کو آنکھ جھپکنے میں ہلاکت سے دو چار کر سکتی ہیں اور سمندر میں اتنی عظیم الجثہ مخلوق موجود ہے جو ایک ہی ٹکر میں کشتیوں اور جہازوں کو ڈبو سکتی ہیں۔ پھر سمندر کے اندر پہاڑ ہیں جن سے ٹکرا کر جہاز پاش پاش ہو جاتے ہیں اور مقناطیسی چٹانیں ہیں جو انسان کی ساری کوششوں کے باوجود جہازوں کو کھینچ کر غرقاب کر دیتی ہیں۔ یہ اللہ تعالیٰ ہی کی خاص مہربانی ہوتی ہے کہ انسان اکثر اوقات سمندری سفر خیروعافیت سے طے کر لیتا ہے۔ ¤ ➋ { لِيُرِيَكُمْ مِّنْ اٰيٰتِهٖ :} یعنی ایسی نشانیاں جن سے پتا چلتا ہے کہ سارے اختیارات اللہ تعالیٰ کے ہاتھ میں ہیں۔ انسان خواہ کیسے ہی مضبوط اور بحری سفر کے لیے موزوں جہاز بنالے اور جہاز رانی کے فن میں کتنا ہی کمال حاصل کر لے، سمندر میں پیش آنے والی ہولناک طاقتوں کے مقابلے میں جب تک اللہ تعالیٰ کا فضل شامل نہ ہو وہ اکیلا اپنی تدابیر کے بل بوتے پر بخیریت سفر نہیں کر سکتا۔ ¤ ➌ { اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ :} یہ اس سوال کا جواب ہے کہ اتنی عظیم اور واضح نشانیوں کے باوجود مشرک ان سے فائدہ کیوں نہیں اٹھاتے؟ فرمایا، ان نشانیوں سے توحید کا سبق ہمیشہ وہ لوگ حاصل کرتے ہیں جن میں دو وصف ہوں، ایک یہ کہ وہ {’’ صَبَّارٍ ‘‘} (بہت بڑے صبر والے) ہوں، ان کے مزاج میں تلوّن نہ ہو، بلکہ ثابت قدمی ہو، گوارا و ناگوار، سخت اور نرم، اچھے اور برے تمام حالات میں صحیح عقیدے پر قائم رہیں۔ یہ نہیں کہ برا وقت آیا تو اللہ کے سامنے گڑگڑانے لگے اور اچھا وقت آنے پر سب کچھ بھول گئے، یا اس کے برعکس اچھے حالات میں تو اللہ تعالیٰ پر خوش رہے اور اس کی پرستش کرتے رہے اور مصیبت کی ایک چوٹ پڑتے ہی اسے گالیاں دینے لگے۔ دوسرا وصف یہ کہ وہ {’’ شَكُوْرٍ ‘‘} (بہت بڑے شکر کرنے والے) ہوں، نمک حرام اور احسان فراموش نہ ہوں، بلکہ ہمیشہ نعمت دینے والے کے لیے دل میں احسان مندی اور قدردانی کا جذبہ رکھیں اور اپنے قول و عمل سے اس کا شکر ادا کرتے رہیں۔ یہ دونوں وصف صرف مومن میں پائے جاتے ہیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ عَجَبًا لِأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَهُ كُلَّهُ خَيْرٌ، وَلَيْسَ ذَاكَ لِأَحَدٍ إِلَّا لِلْمُؤْمِنِ إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ، فَكَانَ خَيْرًا لَّهُ وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَّهُ ] [ مسلم، الزھد والرقائق، باب المؤمن أمرہ کلہ خیر : ۲۹۹۹، عن صہیب رضی اللہ عنہ ] ’’مومن کا معاملہ عجیب ہے، کیونکہ اس کا ہر معاملہ ہی خیر ہے اور یہ چیز مومن کے سوا کسی کو حاصل نہیں کہ اگر اسے کوئی خوشی پہنچے، وہ شکر کرتا ہے تو وہ اس کے لیے خیر ہوتی ہے اور اگر اسے کوئی تکلیف پہنچے تو وہ صبر کرتا ہے، سو وہ بھی اس کے لیے بہتر ہوتی ہے۔‘‘"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ { وَ اِذَا غَشِيَهُمْ مَّوْجٌ كَالظُّلَلِ …:} پچھلی آیت میں اللہ تعالیٰ کی نعمت کے ساتھ سمندر میں چلنے والی کشتیوں اور جہازوں کو دیکھ کر ایمان والوں کی حالت کا ذکر فرمایا، جو بہت صبر و شکر کرنے والے ہوتے ہیں کہ ان کے لیے ان کشتیوں میں اللہ تعالیٰ کی توحید کی اور اس کے قادر و مختار ہونے کی بہت سی نشانیاں ہیں۔ اب بتایا کہ مشرکوں کی حالت اس کے برعکس ہوتی ہے، چنانچہ جب سمندر میں طوفان آتا ہے اور یک لخت پانی کی موجیں سائبانوں کی طرح انھیں ڈھانپ لیتی ہیں اور وہ سمجھ لیتے ہیں کہ معاملہ ختم ہے تو تمام خداؤں، حاجت رواؤں اور مشکل کشاؤں کو چھوڑ کر اپنے دین یعنی عبادت کو اللہ کے لیے خالص کرتے ہوئے اس اکیلے کو پکارتے ہیں۔ ¤ ➋ { فَلَمَّا نَجّٰىهُمْ اِلَى الْبَرِّ فَمِنْهُمْ مُّقْتَصِدٌ … : ’’ خَتَّارٍ ‘‘ ’’خَتْرٌ‘‘} میں سے ہے، جو بدترین عہد شکنی اور غداری کو کہتے ہیں۔ {’’ مُقْتَصِدٌ ‘‘} کا لفظی معنی سیدھی راہ پر چلنے والا بھی ہے اور میانہ روی اختیار کرنے والا بھی۔ اس جملے کی تین تفسیریں ہو سکتی ہیں اور تینوں درست ہیں، ایک یہ کہ {’’ مُقْتَصِدٌ ‘‘} کا معنی سیدھی راہ پر چلنے والا ہے، کیونکہ تمام راستوں میں سے درمیانہ راستہ ہی سیدھا اور درست ہوتا ہے۔ {’’ فَمِنْهُمْ ‘‘} میں {’’مِنْ‘‘} تبعیض کے لیے ہے، یعنی جب اللہ تعالیٰ انھیں سائبانوں جیسی ان موجوں سے بچا کر خشکی پر لے آتا ہے تو ان میں سے کچھ ہی سیدھی راہ پر رہنے والے ہوتے ہیں، جو اس عہد پر قائم رہتے ہیں جو انھوں نے طوفان کی حالت میں اپنے رب سے کیا تھا، جیسا کہ ابو جہل کے بیٹے عکرمہ رضی اللہ عنہ تھے، ان میں سے اکثر اللہ تعالیٰ کی ان نشانیوں کا صاف انکار کر دیتے ہیں جن کا مشاہدہ انھوں نے سمندر میں کیا تھا اور اس عہد کو توڑ دیتے ہیں جو انھوں نے طوفان کے وقت اپنے رب سے کیا تھا۔ پھر جو دہریے ہیں وہ اپنے بچ جانے کے لیے مادی اسباب بیان کرتے پھرتے ہیں کہ ہم فلاں وجہ سے بچ گئے اور جو مشرک ہیں وہ اپنے بچ جانے کو کسی نہ کسی داتا یا دستگیر کی کرم نوازی قرار دینے لگتے ہیں۔ حقیقت یہ ہے کہ اللہ کی آیات اور اس کی نعمتوں کا اس طرح صاف انکار وہی شخص کر سکتا ہے جو بدترین عہد توڑنے والا اور نہایت ناشکرا ہو۔ {’’ خَتَّارٍ ‘‘} اور {’’ كَفُوْرٍ ‘‘} مشرک کی صفات ہیں، جو بالترتیب مومن کی صفات {’’ صَبَّارٍ ‘‘} اور {’’ شَكُوْرٍ ‘‘} کے مقابلہ میں آئی ہیں۔ ¤ دوسری تفسیر یہ ہے کہ {’’ مُقْتَصِدٌ ‘‘} سے مراد کفر میں میانہ روی اختیار کرنے والے ہیں۔ مطلب یہ ہے کہ جب اللہ تعالیٰ انھیں بچا کر خشکی پر لے آتا ہے تو ان میں سے کچھ ایسے بھی ہوتے ہیں جو کفر میں اتنے شدید نہیں رہتے، بلکہ میانہ روی اختیار کرتے ہیں، جبکہ اکثر اپنے رب کی اس نعمت کا صاف انکار کر کے بدترین عہد شکنی اور ناشکری کا مظاہرہ کرتے ہیں۔ اس صورت میں {’’ مُقْتَصِدٌ ‘‘} سے مراد {’’ مُقْتَصِدٌ فِي الْكُفْرِ‘‘} ہو گا۔ تیسری تفسیر اس کی یہ ہے کہ {’’ اِقْتِصَادٌ ‘‘} سے مراد ایمان و اخلاص اور عمل میں میانہ روی ہے : {’’أَيْ فَمِنْهُمْ مُقْتَصِدٌ فِي الْإِيْمَانِ وَالْعَمَلِ‘‘} یعنی طوفان سے نجات کے بعد جب کچھ وقت گزرتا ہے تو اخلاص اور ایمان کی وہ کیفیت کسی کی بھی باقی نہیں رہتی جو طوفان کے وقت تھی۔ پھر کچھ لوگ ہوتے ہیں جو اخلاص و ایمان اور عمل کے اعلیٰ درجے سے میانہ روی پر آجاتے ہیں، البتہ اکثر کا حال یہ ہوتا ہے کہ وہ سارے عہد توڑ کر اللہ تعالیٰ کی نعمت کا صاف انکار کر دیتے ہیں اور پھر اپنے شرک کی طرف پلٹ جاتے ہیں۔ شاہ عبدالقادر لکھتے ہیں : ’’یعنی جو حال خوف کے وقت تھا وہ تو کسی کا نہیں، مگر بالکل بھول بھی نہ جائے، ایسے بھی کم ہیں۔ نہیں تو اکثر قدرت سے منکر ہوتے ہیں، اپنے بچ نکلنے کو تدبیر پر رکھتے ہیں یا کسی ارواح وغیرہ کی مدد پر۔‘‘ اللہ تعالیٰ کے کلام کا اعجاز ہے کہ آیت کے الفاظ میں تینوں معنوں کی گنجائش ہے اور کچھ بعید نہیں کہ تینوں مراد ہوں۔ مزید دیکھیے سورۂ بنی اسرائیل (۶۷)، عنکبوت (۶۵) اور یونس (۲۱ تا۲۳)۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ { يٰۤاَيُّهَا النَّاسُ اتَّقُوْا رَبَّكُمْ … :} مختلف طریقوں سے توحید اور آخرت کے دلائل بیان کرنے کے بعد اب تقویٰ کا حکم دیا، جو اللہ تعالیٰ کے احکام پر عمل اور اس کی نافرمانی سے بچنے کا نام ہے اور قیامت کے دن سے ڈرتے رہنے کا حکم دیا، کیونکہ اسی سے تقویٰ حاصل ہوتا ہے۔ اگر باز پرس کا خوف نہ ہو تو کوئی چیز آدمی کو تقویٰ پر آمادہ نہیں کر سکتی۔ ¤ ➋ { وَ اخْشَوْا يَوْمًا لَّا يَجْزِيْ وَالِدٌ عَنْ وَّلَدِهٖ :} یعنی دنیا میں سب سے قریب باہمی تعلق والدین اور اولاد کا ہے، جب وہ ایک دوسرے کے کام نہ آسکے تو کوئی اور رشتے دار، دوست، لیڈر یا پیر فقیر کیا کام آسکے گا۔ دیکھیے سورۂ بقرہ (۴۸)، عبس(۳۴ تا ۳۷)، اور معارج (۸ تا ۱۴) والد کے کام نہ آسکنے کی مثال نوح علیہ السلام اور ان کا بیٹا ہیں۔ ¤ ➌ {وَ لَا مَوْلُوْدٌ هُوَ جَازٍ عَنْ وَّالِدِهٖ شَيْـًٔا : ’’ جَازٍ ‘‘ ’’جَزٰي يَجْزِيْ‘‘} سے اسم فاعل ہے۔ اولاد کے کام نہ آسکنے کی مثال ابراہیم علیہ السلام اور ان کا باپ ہیں۔ ¤ ➍ { اِنَّ وَعْدَ اللّٰهِ حَقٌّ :} اللہ کے وعدے سے مراد قیامت قائم ہونا ہے، وہ ہر حال میں ہو کر رہے گی۔ ¤ ➎ { فَلَا تَغُرَّنَّكُمُ الْحَيٰوةُ الدُّنْيَا :} دنیا کی زندگی انسانوں کو کئی طرح سے دھوکے میں ڈالتی ہے۔ کوئی سمجھتا ہے کہ زندگی بس دنیا ہی کی زندگی ہے، جینا مرنا سب کچھ یہیں ہے، اس کے بعد کوئی دوسری زندگی نہیں، لہٰذا جو کچھ کرنا ہے یہیں پر کر لو۔ دیکھیے سورۂ انعام (۲۹)، مومنون (۳۷) اور جاثیہ (۲۴) کوئی کہتا ہے کہ دنیوی خوشی یا بدحالی ہی حق و باطل کا اور اللہ تعالیٰ کے راضی یا ناراض ہونے کا معیار ہے، اگر قیامت قائم ہوئی تو وہاں بھی وہی خوش حال ہوں گے جو یہاں خوش حال ہیں۔ دیکھیے سورۂ مریم (۷۷) کوئی آخرت پر ایمان کے باوجود دنیا کی خواہشات کی محبت میں کھو کر اس دن کی یاد ہی بھلا بیٹھتا ہے۔ دیکھیے سورۂ آل عمران (۱۴) غرض دنیا کی زندگی آدمی کو طرح طرح سے دھوکے میں ڈالتی ہے۔ ¤ ➏ {وَ لَا يَغُرَّنَّكُمْ بِاللّٰهِ الْغَرُوْرُ : ’’ الْغَرُوْرُ ‘‘} ’’غین‘‘ کے فتح کے ساتھ صفت مشبہ {’’فَعُوْلٌ‘‘} بمعنی فاعل ہے، دھوکا دینے والا، جیسے : «{ اِنَّهٗ كَانَ عَبْدًا شَكُوْرًا }» [ بني إسرائیل : ۳ ] اور ’’غین‘‘ کے ضمہ کے ساتھ مصدر ہے، جیسے : «{ زُخْرُفَ الْقَوْلِ غُرُوْرًا }» [الأنعام : ۱۱۲ ] اور : «{ لَا نُرِيْدُ مِنْكُمْ جَزَآءً وَّ لَا شُكُوْرًا }» [ الدھر : ۹ ] دھوکا دینے والے سے مراد شیطان ہے، وہ ابلیس اور اس کی اولاد سے ہو یا انسانوں میں سے۔ لفظ کو عام رکھیں تو آدمی کا نفس بھی اسے دھوکا دیتا ہے اور دنیا بھی دھوکا دیتی ہے، اس لیے کئی مفسرین نے یہاں {’’ الْغَرُوْرُ ‘‘} کی تفسیر ’’دنیا‘‘ فرمائی ہے۔ ¤ ➐ اللہ تعالیٰ کے بارے میں شیطان کا یہ دھوکا کئی طرح سے ہوتا ہے۔ یہ کسی کو دھوکا دیتا ہے کہ اللہ تعالیٰ ہے ہی نہیں، کسی کو دھوکا دیتا ہے کہ وہ بڑا غفور و رحیم ہے، گناہ کر لو، بعد میں توبہ کر لینا۔ کسی سے کہتا ہے کہ فلاں بزرگ یا پیر کا اس پر بڑا زور ہے، وہ سفارش کر کے تمھیں اس کی پکڑ سے بچا لیں گے۔ غرض وہ مختلف طریقوں سے انسان کو دنیا کی طرف مائل کر کے اللہ تعالیٰ سے غافل کر دیتا ہے۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ { اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةِ :} قیامت کے ذکر پر سوال پیدا ہوتا ہے کہ وہ کب آئے گی؟ اور یہی سوال کفار بار بار کرتے تھے۔ اس لیے فرمایا، اس کا علم صرف اللہ تعالیٰ کے پاس ہے اور اسے مخفی رکھنا اللہ تعالیٰ کی خاص حکمت ہے، تاکہ ہر شخص اس کے لیے ہر وقت تیار رہے اور ہر شخص کو اس کے عمل کی جزا ملے۔ (دیکھیے طٰہٰ : ۱۵) {’’ عِنْدَهٗ ‘‘} کو پہلے لانے سے تخصیص کا معنی پیدا ہوا کہ قیامت کا علم صرف اس کے پاس ہے، کسی اور کے پاس نہیں۔ دیکھیے سورۂ اعراف (۱۸۷)، احزاب (۶۳) اور نازعات (۴۲ تا ۴۴) حدیث جبریل میں جبریل علیہ السلام کے سوال {’’مَتَي السَّاعَةُ؟‘‘} (قیامت کب ہے؟) کے جواب میں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [  مَا الْمَسْئُوْلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ ] ’’جس سے پوچھا گیا ہے وہ پوچھنے والے سے زیادہ نہیں جانتا۔‘‘… پھر آپ صلی اللہ علیہ وسلم نے فرمایا : [ فِيْ خَمْسٍ لَا يَعْلَمُهُنَّ إِلَّا اللّٰهُ : « اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةةِ وَ يُنَزِّلُ الْغَيْثَ وَ يَعْلَمُ مَا فِي الْاَرْحَامِ» ] [ بخاري، التفسیر، باب قولہ : « إن اللہ عندہ علم الساعۃ » : ۴۷۷۷ ] ’’قیامت کا علم ان پانچ چیزوں میں سے ہے جنھیں اللہ کے سوا کوئی نہیں جانتا۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : « اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةِ وَ يُنَزِّلُ الْغَيْثَ وَ يَعْلَمُ مَا فِي الْاَرْحَاممِ » [ لقمان: ۳۴ ] ابن عمر رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَفَاتِيْحُ الْغَيْبِ خَمْسٌ، ثُمَّ قَرَأَ : « اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةِ » ] [ بخاري، التفسیر، باب قولہ : « إن اللہ عندہ علم الساعۃ » : ۴۷۷۸ ]’’غیب کی چابیاں پانچ ہیں۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : « اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةِ » [ لقمان : ۳۴ ] ¤ ➋ { وَ يُنَزِّلُ الْغَيْثَ :} اس کا عطف {’’ عِنْدَهٗ عِلْمُ السَّاعَةِ ‘‘} پرہے، گویا عبارت یوں ہے {’’وَ إِنَّ اللّٰهَ يُنَزِّلُ الْغَيْثَ‘‘} یعنی اللہ تعالیٰ ہی بارش اتارتا ہے، اور جو اتارتا ہے وہی جانتا ہے کہ کہاں اتارنی ہے، کب اتارنی ہے اور کتنی اتارنی ہے، اس کے سوا کسی کو یہ بات معلوم نہیں۔ یہاں ایک سوال ہے کہ{’’ وَ يُنَزِّلُ الْغَيْثَ وَ يَعْلَمُ مَا فِي الْاَرْحَامِ ‘‘} دونوں جملوں میں حصر پر دلالت کرنے والا کوئی لفظ نہیں، جس کا ترجمہ یہ ہو کہ اللہ تعالیٰ ہی یہ کام کرتا ہے۔ اس کا سب سے قوی جواب تو وہ ہے جو شنقیطی نے دیا ہے کہ یہ بات کہ یہاں حصر مراد ہے، رسول اللہ صلی اللہ علیہ وسلم کی صحیح حدیث سے ثابت ہے، جیسا کہ اوپر گزرا اور آپ صلی اللہ علیہ وسلم سے بڑھ کر قرآن مجید اور لغت عرب کو جاننے والا کوئی نہیں۔ ویسے علمائے عربیت نے کئی طرح سے یہاں حصر ثابت فرمایا ہے جن میں سے ایک جواب یہاں بیان کیا جاتا ہے۔ سب سے پہلے تو یہ دیکھیے کہ اگر کہا جاتا کہ{’’إِنَّ عِلْمَ السَّاعَةِ عِنْدَ اللّٰهِ‘‘} تو جملہ مختصر بھی ہوتا اور بات بھی ادا ہو جاتی، مگر اللہ تعالیٰ نے فرمایا : {’’ اِنَّ اللّٰهَ ‘‘} اور اس کی خبر {’’ عِنْدَهٗ عِلْمُ السَّاعَةِ ‘‘} بیان فرمائی۔ اس میں دو طرح سے حصر ہے، لفظ {’’ اللّٰهَ ‘‘} کو زیادہ صراحت کے ساتھ پہلے لانا، پھر خبر کے جملہ میں {’’ عِنْدَهٗ ‘‘} کو مقدم کرنا، جس سے تخصیص پیدا ہوئی۔ گویا جملے کی ابتدا جو حصر کے ساتھ ہوئی، وہی حصر {’’ وَ يُنَزِّلُ الْغَيْثَ وَ يَعْلَمُ مَا فِي الْاَرْحَامِ ‘‘} میں بھی ملحوظ ہے، کیونکہ ان دونوں کا عطف جملہ {’’ عِلْمُ السَّاعَةِ ‘‘} پر ہے۔ بعض اوقات عامۃ الناس کی طرف سے ایک سوال آتا ہے کہ آج کل سائنس اتنی ترقی کر گئی ہے کہ محکمہ موسمیات والے پہلے ہی پیش گوئی کر دیتے ہیں کہ فلاں دن بارش ہو گی، اگر یہ مفاتیح الغیب سے ہے، جن کا علم اللہ کے سوا کسی کو نہیں، تو وہ کیسے بتا دیتے ہیں؟ جواب اس کا یہ ہے کہ علم یقین کا نام ہے، ظن و تخمین اور گمان کو علم نہیں کہتے۔ محکمہ موسمیات والے اپنے تجربے کے مطابق ہوا کے دباؤ اور فضا میں موجود نمی وغیرہ کو دیکھ کر بارش ہونے یا نہ ہونے کا اعلان کر دیتے ہیں، مگر کبھی ان کی بات درست ثابت ہوتی ہے کبھی نادرست۔ بعض اوقات تجربے کے مطابق بارش ہونے کے تمام اسباب ہوتے ہیں مگر بادل ایک بوند برسائے بغیر گزر جاتے ہیں اور بعض اوقات بارش کے اسباب میں سے کچھ بھی موجود نہیں ہوتا کہ یکایک تمام اسباب پیدا ہو کر بارش شروع ہو جاتی ہے۔ اس کی دلیل کہ اللہ تعالیٰ کے سوا کوئی نہیں جانتا کہ بارش کب، کہاں اور کتنی ہو گی محکمہ موسمیات والوں کا یہ اعلان بھی ہے کہ آج بارش کا امکان ہے۔ سوفیصد علم نہ ان کے پاس ہے نہ ان کا دعویٰ ہے۔ آیت پر اعتراض کرنے والوں کا حال ’’ مدعی سست گواہ چست‘‘ والا ہے۔ ¤ ➌ { وَ يَعْلَمُ مَا فِي الْاَرْحَامِ :} اس کا عطف بھی {’’ عِنْدَهٗ عِلْمُ السَّاعَةِ ‘‘} پر ہے : {’’ أَيْ إِنَّ اللّٰهَ يَعْلَمُ مَا فِي الْأَرْحَامِ‘‘} یعنی اللہ تعالیٰ ہی جانتا ہے کہ ماؤں کے پیٹوں میں کیا ہے۔ یہاں بھی یہ سوال اٹھایا جاتا ہے کہ آج کل الٹراساؤنڈ سے معلوم ہو جاتا ہے کہ پیدا ہونے والا لڑکا ہے یا لڑکی۔ اس کے جواب میں عموماً علمائے اسلام فرماتے ہیں کہ آیت کے الفاظ یہ نہیں کہ اللہ تعالیٰ ہی جانتا ہے کہ ماؤں کے پیٹوں میں لڑکا ہے یا لڑکی، بلکہ فرمایا {’’ مَا فِي الْاَرْحَامِ ‘‘} کہ جو کچھ پیٹوں میں ہے، ضروری نہیں کہ اس سے مراد لڑکا یا لڑکی ہی لیا جائے، بلکہ مراد اس سے یہ ہے کہ جنین زندہ رہنے والا ہے یا ضائع ہو جانے والا، طویل عمر والا ہے یا تھوڑی عمر والا، خوش بخت ہے یا بد نصیب، تندرست رہے گا یا بیمار ہو گا۔ سو اگر اس کی جنس معلوم ہو بھی جائے کہ لڑکا ہے یا لڑکی، تب بھی قرآن کے بیان پر کوئی حرف نہیں آتا۔ یقینا یہ جواب بہت عمدہ ہے، مگر ابھی تک یہ دعویٰ کہ الٹراساؤنڈ سے لڑکے یا لڑکی کی جنس معلوم ہو جاتی ہے، سوفیصد درست ثابت نہیں ہوا۔ خود ڈاکٹر حضرات کہتے ہیں کہ جنین کی وضع پیٹ میں ایسی ہوتی ہے کہ اس کے اعضائے تناسل اس کے سر کے نیچے چھپے ہوتے ہیں اور الٹراساؤنڈ کے ذریعے سے اندازے ہی کی بنیاد پر فیصلہ کیا جاتا ہے جو اکثر صحیح ہوتا ہے اور کبھی غلط بھی نکلتا ہے۔ اس لیے یہ کہنا کہ الٹراساؤنڈ سے جنس معلوم ہو جاتی ہے، سوفیصد درست نہیں۔ الٹرا ساؤنڈ کی شہرت کے باوجود میں نے اپنی زندگی میں دو دفعہ الٹرا ساؤنڈ کی پیش گوئی تمام دنیا کے سامنے غلط ثابت ہوتی ہوئی دیکھی ہے، ایک دفعہ برطانیہ کے ولی عہد کی بیوی لیڈی ڈیانا کے ہاں ڈاکٹروں نے اعلان کیا کہ لڑکی پیدا ہو گی، مگر ان کے اعلان کے برعکس لڑکا پیدا ہوا۔ دوسرا پاکستان کی سابقہ وزیراعظم بے نظیر کے ڈاکٹر نے اعلان کیا کہ لڑکا پیدا ہو گا، مگر لڑکی پیدا ہوئی۔ اب آپ سوچیں کہ برطانیہ اور پاکستان کے ان اونچے مناصب پر فائز لوگوں کے پاس الٹراساؤنڈ کے ماہرین کی کیا کمی تھی؟ حقیقت یہ ہے کہ اگر الٹراساؤنڈ کے ذریعے سے ایک ہزار بچوں کے متعلق پیش گوئی کی جائے، جن میں سے نوسو ننانوے درست اور ایک غلط نکلے تو بھی اسے علم نہیں کہہ سکتے، کیونکہ علم وہ ہے جو یقینی ہو، کبھی غلط نہ نکلے۔ البتہ اگر کوئی آپریشن کرکے آنکھوں سے بچے کی جنس دیکھ لے تو قرآن کی بات پھر بھی اپنی جگہ قائم ہے کہ یہ بات کہ بچہ دانیوں میں کیا ہے اللہ تعالیٰ ہی جانتا ہے، کیونکہ ’’کیا ہے‘‘ میں لڑکے لڑکی کی جنس کے علاوہ بے شمار باتیں داخل ہیں۔ ¤ ➍ { وَ مَا تَدْرِيْ نَفْسٌ مَّا ذَا تَكْسِبُ غَدًا:} مسروق فرماتے ہیں کہ میں نے عائشہ رضی اللہ عنھا سے پوچھا : ’’اماں جان! کیا محمد صلی اللہ علیہ وسلم نے اپنے رب کو دیکھا ہے؟‘‘ انھوں نے فرمایا : ’’تم نے جو بات کہی اس سے تو میرے رونگٹے کھڑے ہو گئے، کیا تم ان تین باتوں سے بھی ناواقف ہو؟ جنھیں جو بھی تمھیں بیان کرے وہ جھوٹ کہے گا۔‘‘ پھر فرمایا : [ مَنْ حَدَّثَكَ أَنَّ مُحَمَّدًا صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ رَأَی رَبَّهُ فَقَدْ كَذَبَ، ثُمَّ قَرَأَتْ : « لَا تُدْرِكُهُ الْاَبْصَارُ وَ هُوَ يُدْرِكُ الْاَبْصَارَ وَ هُوَ اللَّطِيْفُ الْخَبِيْرُ » [الأنعام : ۱۰۳] ، « وَ مَا كَانَ لِبَشَرٍ اَنْ يُّكَلِّمَهُ اللّٰهُ اِلَّا وَحْيًا اَوْ مِنْ وَّرَآءِ حِجَابٍ » [الشورٰي : ۵۱] وَ مَنْ حَدَّثَكَ أَنَّهُ يَعْلَمُ مَا فِيْ غَدٍ فَقَدْ كَذَبَ ثُمَّ قَرَأَتْ : « وَ مَا تَدْرِيْ نَفْسٌۢ بِاَيِّ اَرْضٍ تَمُوْتُ » [لقمان : ۳۴] وَمَنْ حَدَّثَكَ أَنَّهُ كَتَمَ فَقَدْ كَذَبَ، ثُمَّ قَرَأَتْ : « يٰۤاَيُّهَا الرَّسُوْلُ بَلِّغْ مَاۤ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ» [المائدة : ۶۷] ، وَ لٰكِنَّهُ رَأٰی جِبْرِيْلَ عَلَيْهِ السَّلاَمُ فِيْ صُوْرَتِهِ مَرَّتَيْنِ ] [ بخاري، التفسیر، باب : ۴۸۵۵۔ مسلم : ۱۷۷ ] ’’جو شخص تمھیں بیان کرے کہ محمد صلی اللہ علیہ وسلم نے اپنے رب کو دیکھا ہے تو اس نے یقینا جھوٹ کہا، پھر ام المومنین رضی اللہ عنھا نے یہ آیت پڑھی : « لَا تُدْرِكُهُ الْاَبْصَارُ وَ هُوَ يُدْرِكُ الْاَبْصَارَ وَ هُوَ اللَّطِيْفُ الْخَبِيْرُ » [ الأنعام : ۱۰۳ ] ’’اسے نگاہیں نہیں پاتیں اور وہ سب نگاہوں کو پاتا ہے اور وہی نہایت باریک بین، سب خبر رکھنے والا ہے۔‘‘ اور یہ آیت : «وَ مَا كَانَ لِبَشَرٍ اَنْ يُّكَلِّمَهُ اللّٰهُ اِلَّا وَحْيًا اَوْ مِنْ وَّرَآئِ حِجَابٍ » [ الشورٰی : ۵۱ ] ’’اور کسی بشر کے لیے ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے، یا پردے کے پیچھے سے۔‘‘ ’’اور جو شخص تمھیں بیان کرے کہ آپ صلی اللہ علیہ وسلم وہ جانتے ہیں جو کل ہو گا تو اس نے یقینا جھوٹ کہا۔‘‘ پھر انھوں نے یہ آیت پڑھی : « وَ مَا تَدْرِيْ نَفْسٌ مَّا ذَا تَكْسِبُ غَدًا » [ لقمان : ۳۴ ] ’’اور کوئی شخص نہیں جانتا کہ وہ کل کیا کمائی کرے گا۔‘‘ ’’اور جو شخص تمھیں بیان کرے کہ آپ صلی اللہ علیہ وسلم نے (وحی کی بات کو) چھپایا ہے، اس نے یقینا جھوٹ کہا۔‘‘ پھر انھوں نے یہ آیت پڑھی : «اَيُّهَا الرَّسُوْلُ بَلِّغْ مَاۤ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ» [ المائدۃ : ۶۷ ] ’’اے رسول! پہنچا دے جو کچھ تیری طرف تیرے رب کی جانب سے نازل کیا گیا ہے۔‘‘ ’’لیکن آپ صلی اللہ علیہ وسلم نے جبریل علیہ السلام کو ان کی اصل صورت میں دو مرتبہ دیکھا ہے۔‘‘ ¤ {رُبَيِّع بنت مُعوّذ} رضی اللہ عنھما بیان کرتی ہیں : ’’جس رات میری رخصتی ہوئی اس کی صبح رسول اللہ صلی اللہ علیہ وسلم میرے پاس آئے اور میرے بستر پر بیٹھ گئے، جہاں تم بیٹھے ہو اور کچھ چھوٹی لڑکیاں دف بجا کر اپنے آباء کے متعلق شعر پڑھ رہی تھیں جو بدر میں شہید ہوئے، یہاں تک کہ ایک لڑکی نے کہا : [ وَفِيْنَا نَبِيٌّ يَعْلَمُ مَا فِيْ غَدٍ ] ’’اور ہم میں وہ نبی ہے جو کل ہونے والی بات جانتا ہے۔‘‘ تو نبی صلی اللہ علیہ وسلم نے فرمایا : [ لاَ تَقُوْلِيْ هٰكَذَا ، وَقُوْلِيْ مَا كُنْتِ تَقُوْلِيْنَ ] ’’اس طرح مت کہو اور وہ کہتی جاؤ جو کہہ رہی تھی۔‘‘ [ بخاري، المغازي، باب : ۴۰۰۱ ] ¤ ➎ { وَ مَا تَدْرِيْ نَفْسٌۢ بِاَيِّ اَرْضٍ تَمُوْتُ:} یعنی کوئی انسان نہیں جانتا کہ اسے موت کہاں آئے گی، خشکی پر یا سمندر میں یا پہاڑ پر۔ جب اسے اپنی موت کی جگہ کا علم نہیں تو وقت کا علم کیسے ہو سکتا ہے۔ عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا كَانَ أَجَلُ أَحَدِكُمْ بِأَرْضٍ أَوْثَبَتْهُ إِلَيْهَا الْحَاجَةُ ، فَإِذَا بَلَغَ أَقْصٰی أَثَرِهِ، قَبَضَهُ اللّٰهُ سُبْحَانَهُ ، فَتَقُوْلُ الأَرْضُ يَويَوْمَ الْقِيَامَةِ رَبِّ! هٰذَا مَا اسْتَوْدَعْتَنِيْ ] [ ابن ماجہ، الزھد، باب ذکر الموت والاستعداد : ۴۲۶۳، وقال البوصیري و الألباني صحیح ] ’’جب تم میں سے کسی شخص کی موت کسی زمین میں طے ہو، تو کوئی ضرورت اسے چھلانگ لگوا کر وہاں پہنچا دیتی ہے۔ پھر جب وہ اس جگہ پہنچتا ہے جہاں اس کے قدم کا آخری نشان ہوتا ہے، تو اللہ سبحانہ اسے قبض کر لیتے ہیں۔ چنانچہ زمین قیامت کے دن کہے گی : ’’اے میرے رب! یہ ہے وہ امانت جو تو نے میرے پاس رکھی تھی۔‘‘ ¤ ➏ { اِنَّ اللّٰهَ عَلِيْمٌ خَبِيْرٌ :} یعنی اللہ تعالیٰ کا علم ان پانچ چیزوں کے ساتھ ہی خاص نہیں، بلکہ وہ ہر چیز کا علم رکھنے والا ہے اور ان کے ظاہر و باطن کی پوری خبر رکھنے والا ہے۔"
    }
  ]
}