{
  "surah": "Yaseen",
  "surah_number": 36,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "قرآن مجید کی ہر سورت کے فضائل میں یہ بات ہی کافی ہے کہ اللہ تعالیٰ کے سوا پوری کائنات جمع ہو کر کر بھی کسی ایک سورت جیسی سورت پیش نہیں کر سکتی۔ بعض سورتوں کی کوئی خاص فضیلت بھی رسول اللہ صلی اللہ علیہ وسلم سے آئی ہے، جیسا کہ سورۂ فاتحہ کے فضائل پیچھے گزر چکے ہیں۔ سورۂ یٰس کے فضائل میں کئی روایات مشہور ہیں، قریب الموت شخص کے پاس اسے پڑھنے کی روایت تو اتنی مشہور ہے کہ اقبال نے موجودہ مسلمانوں کے قرآن کے ساتھ تعلق کے بارے میں کہا ہے: ¤ بآیاتش ترا کارے جزایں نیست ¤ کہ از یاسین او آساں بمیری ¤ ’’یعنی اس کی آیات کے ساتھ تجھے اس کے سوا کوئی غرض نہیں کہ اس کی سورۂ یٰس کے ساتھ تیری موت آسانی سے واقع ہو جائے۔‘‘ ¤ مگر خاص طور پر اس سورت کی فضیلت میں آنے والی کوئی روایت صحیح نہیں، کچھ روایات موضوع ہیں اور کچھ ضعیف ہیں۔ یہاں تفسیر ابن کثیر میں مذکور چند روایات اور ان کا ضعف بیان کیا جاتا ہے : ¤ (1) انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ لِكُلِّ شَيْءٍ قَلْبًا وَ قَلْبُ الْقُرْآنِ يٰسٓ مَنْ قَرَأَ يٰسٓ كَتَبَ اللّٰهُ لَهُ بِقِرَاءَتِهَا قِرَاءَةَ الْقُرْآنِ عَشْرَ مَرَّاتٍ ] [ ترمذي، فضائل القرآن، باب ما جاء في فضل یٰس : ۲۸۸۷ ] ’’ہر چیز کا ایک دل ہے اور قرآن کا دل سورۂ یٰس ہے اور جو سورۂ یٰس پڑھے اللہ تعالیٰ اس کے پڑھنے کے ساتھ اس کے لیے دس مرتبہ قرآن کی تلاوت لکھ دیتا ہے۔‘‘ ¤ امام ترمذی نے یہ روایت بیان کرکے فرمایا : ’’یہ حدیث حسن غریب ہے، ہم اسے حمید بن عبد الرحمان کی روایت کے علاوہ نہیں جانتے اور (اس کا ایک راوی) ہارون ابو محمد شیخ مجہول ہے۔‘‘ ابن ابی حاتم نے اپنے والد سے نقل کیا ہے، انھوں نے فرمایا : [ حَدِيْثٌ بَاطِلٌ لَا أَصْلَ لَهُ ] [ العلل : 56/2 ] ’’یہ باطل حدیث ہے، اس کی کوئی اصل نہیں۔‘‘ محدث علامہ البانی نے اسے موضوع کہا ہے۔ (دیکھیے ضعیف سنن ترمذی) ¤ (2) ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ قَرَأَ يٰسٓ فِيْ لَيْلَةٍ أَصْبَحَ مَغْفُوْرًا لَّهُ ] [ مسند أبي یعلٰی : ۶۲۲۴ ] ’’جو شخص کسی رات سورۂ یٰس پڑھے، وہ اس حال میں صبح کرتا ہے کہ اسے بخش دیا گیا ہوتا ہے۔‘‘ ابن کثیر نے اس کی سند کو جید کہا ہے، مگر مسند ابویعلٰی کے محقق نے اس کے ایک راوی ہشام بن زیاد کے ضعیف ہونے کی وجہ سے اسے ضعیف قرار دیا ہے اور حافظ ابنِ حجر نے تقریب میں اس راوی کے متعلق فرمایا : {’’ مَتْرُوْكٌ ‘‘} یعنی اسے محدثین نے ترک کر دیا ہے۔ ¤ (3) جندب بن عبد اللہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ قَرَأَ يٰسٓ فِيْ لَيْلَةٍ ابْتِغَاءَ وَجْهِ اللّٰهِ غُفِرَ لَهُ ] [ ابن حبان : ۲۵۷۴ ] ’’جو شخص کسی رات اللہ کی رضا حاصل کرنے کے لیے سورۂ یٰس پڑھے، اسے بخش دیا جاتا ہے۔‘‘ تفسیر ابن کثیر کے محقق دکتور حکمت بن بشیر نے فرمایا، اس کی سند ضعیف ہے کیونکہ حسن نے جندب رضی اللہ عنہ سے نہیں سنا۔ ¤ (4) معقل بن یسار رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يٰسٓ قَلْبُ الْقُرْآنِ لَا يَقْرَأُهَا رَجُلٌ يُرِيْدُ اللّٰهَ وَالدَّارَ الْآخِرَةَ إِلَّا غُفِرَ لَهُ وَاقْرَؤُوْهَا عَلٰی مَوْتَاكُمْ ] [ مسند أحمد :26/5، ح : ۲۰۳۰۰ ] ’’سورۂ یٰس قرآن کا دل ہے، جو آدمی بھی اسے اللہ اور دار آخرت کے ارادے سے پڑھے، اسے بخش دیا جاتا ہے اور تم اسے اپنے مرنے والوں پر پڑھو۔‘‘ تفسیر ابن کثیر کے محقق دکتور حکمت بن بشیر نے فرمایا کہ اس کی سند {’’عَنْ رَجُلٍ عَنْ أَبِيْهِ‘‘} دو آدمیوں کے مجہول ہونے کی وجہ سے ضعیف ہے۔ ¤ (5) ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَوَدِدْتُّ أَنَّهَا فِيْ قَلْبِ كُلِّ إِنْسَانٍ مِنْ أُمَّتِيْ يَعْنِيْ يٰسٓ ] [ مسند بزار : ۲۳۰۵ ] ’’میری خواہش ہے کہ یہ یعنی سورۂ یٰس میری امت کے ہر انسان کے دل میں موجود ہو۔‘‘ محقق حکمت بن بشیر نے فرمایا : ’’اس کی سند ضعیف ہے، کیونکہ اس کا ایک راوی ابراہیم بن حکم بن ابان ضعیف ہے۔‘‘ تفسیر ابن کثیر میں مذکور روایات کے علاوہ ایک مشہور روایت یہ ہے کہ عطاء بن ابی رباح کہتے ہیں، مجھے یہ خبر پہنچی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ قَرَأَ يٰسٓ فِيْ صَدْرِ النَّهَارِ قُضِيَتْ حَوَائِجُهُ ] [ سنن الدارمي : 549/2، ح : ۳۴۱۸ ] ’’جو شخص دن کے شروع حصے میں سورۂ یٰس پڑھے، اس کی ضرورتیں پوری کر دی جاتی ہیں۔‘‘ دارمی کے محقق حسین سلیم اسد نے فرمایا : ’’اس کی سند ضعیف و مرسل ہے۔‘‘ یعنی عطاء بن ابی رباح تابعی ہیں، انھوں نے نہ رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے اور نہ اپنی خبر کا ذریعہ بیان کیا ہے۔ علاوہ ازیں اس میں ابراہیم بن حکم راوی ضعیف ہے۔ ان روایات کے علاوہ روایات کا حال ان سے بھی ابتر ہے۔ ¤ (آیت 1){ يٰسٓ:} یہ حروف مقطعات ہیں، ان کی وضاحت کے لیے دیکھیے سورۂ بقرہ کی پہلی آیت۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {وَ الْقُرْاٰنِ الْحَكِيْمِ:} قسم سے مقصود اس بات کا یقین دلانا ہوتا ہے جس کے لیے قسم اٹھائی جائے اور قسم اس بات کی دلیل ہوتی ہے جو اس قسم کے بعد اس کے جواب کے طور پر آ رہی ہوتی ہے، پھر بعض اوقات جس کی قسم اٹھائی جائے اس کی عظمت ہی کو جواب قسم کی شہادت کے طور پر پیش کیا جاتا ہے، مثلاً اللہ کی قسم، اور بعض اوقات قسم کا مفہوم جواب قسم کی دلیل ہوتا ہے اور اس کے سچے ہونے کی شہادت دے رہا ہوتا ہے۔ {’’ الْحَكِيْمِ ‘‘} کا ایک معنی یہ ہے کہ یہ قرآن دانائی اور حکمت سے بھرپور ہے، اس کی کوئی بات نہ خطا ہے نہ عقل کے خلاف اور نہ کم تر درجہ کی، بلکہ ہر بات ہی کمال عقل و دانش پر مبنی ہے اور ایک معنی یہ ہے کہ یہ قرآن انتہائی محکم اور مضبوط ہے، اس کی آیات میں کوئی باہمی اختلاف نہیں۔ ¤ یہاں اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو مخاطب کرتے ہوئے قرآن حکیم کی قسم کھا کر تین باتیں فرمائیں، پہلی یہ کہ یقینا تو رسولوں میں سے ہے، جنھیں ہماری طرف سے بھیجا گیا ہے، دوسری یہ کہ یقینا تو سیدھے راستے پر ہے اور تیسری یہ کہ یہ عزیز و رحیم کا نازل کردہ ہے۔ قسم اور جواب قسم میں مناسبت بالکل واضح ہے کہ آپ کی رسالت اور دوسری دونوں باتوں کے لیے اور کوئی دلیل نہ بھی ہو تو یہ قرآن ہی ان کی دلیل کے لیے کافی ہے۔ مطلب یہ ہے کہ حکمت سے بھرپور اور ہر لحاظ سے محکم یہ قرآن اس بات کا شاہد ہے کہ یقینا آپ اللہ کے رسول ہیں، بالکل سیدھے راستے پر ہیں اور یہ قرآن اللہ تعالیٰ کی طرف سے نازل کیا ہوا ہے، جو عزیز بھی ہے اور رحیم بھی۔ کیونکہ آپ صلی اللہ علیہ وسلم اُمّی تھے، نہ لکھنا جانتے تھے نہ پڑھنا، نہ آپ نے کسی کی شاگردی اختیار کی تھی، نہ آپ نے نبوت سے پہلے کبھی کوئی ایسا یا اس سے ملتا جلتا کلام پیش کیا، جس سے شبہ ہو کہ کلام کا یہ ملکہ ترقی کرتا کرتا اس درجے تک پہنچ گیا۔ یہ سب باتیں کفارِ مکہ اچھی طرح جانتے تھے، کیونکہ وہ ذاتی طور پر آپ کو چالیس برس سے جانتے تھے، پھر چالیس برس کے بعد آپ صلی اللہ علیہ وسلم کی زبان پر یک لخت ایسے کلام کا جاری ہو جانا، جس نے عرب کے تمام فصیح و بلیغ لوگوں کو مقابلے سے عاجز کر دیا اور گونگا بنا دیا اور بار بار کے چیلنج کے باوجود وہ ایسا کلام پیش کرنے سے عاجز آ گئے۔ اس سے یہ تین باتیں ثابت ہو رہی ہیں، ایک یہ کہ یہ عظیم الشّان حکیمانہ کلام آپ کا کلام نہیں بلکہ کسی اور کا کلام ہے جس نے آپ کو بھیجا ہے، دوسری یہ کہ وہ بھیجنے والا کوئی مخلوق نہیں بلکہ خود خالق کائنات ہے، جو عزیز و رحیم ہے، کیونکہ اگر یہ کسی اور کا کلام ہوتا تو وہ اس جیسا مزید بھی بنا کر پیش کر دیتا، جب کہ پوری کائنات مل کر بھی اس جیسی ایک سورت پیش کرنے سے عاجز ہے اور تیسری یہ کہ جب آپ اللہ کی طرف سے بھیجے ہوئے ہیں تو یقینا آپ جس راہ پر چل رہے ہیں وہ بالکل سیدھا راستہ ہے۔ اس میں قرآن کی عظمت و رفعت کا اظہار بھی ہے کہ اس کی قسم کھائی جا رہی ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {اِنَّكَ لَمِنَ الْمُرْسَلِيْنَ :} اس کا یہ مطلب نہیں کہ معاذ اللہ نبی کریم صلی اللہ علیہ وسلم کو اپنے رسول ہونے میں کوئی شک تھا، بلکہ در اصل یہ ان کفار کی تردید ہے جو آپ صلی اللہ علیہ وسلم سے صاف کہتے تھے کہ آپ اللہ کی طرف سے بھیجے ہوئے نہیں ہیں، بلکہ اپنی طرف سے گھڑ کر یہ کلام پیش کر رہے ہیں، جیسا کہ فرمایا : «وَ يَقُوْلُ الَّذِيْنَ كَفَرُوْا لَسْتَ مُرْسَلًا قُلْ كَفٰى بِاللّٰهِ شَهِيْدًۢا بَيْنِيْ وَ بَيْنَكُمْ وَ مَنْ عِنْدَهٗ عِلْمُ الْكِتٰبِ » [ الرعد : ۴۳ ] ’’اور وہ لوگ جنھوں نے کفر کیا،کہتے ہیں تو کسی طرح رسول نہیں ہے۔ کہہ دے میرے درمیان اور تمھارے درمیان اللہ کافی گواہ ہے اور وہ شخص بھی جس کے پاس کتاب کا علم ہے۔‘‘"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {عَلٰى صِرَاطٍ مُّسْتَقِيْمٍ:} یعنی آپ دین توحید پر ہیں، جو سیدھا اللہ تک پہنچا دیتا ہے، جیسا کہ فرمایا : « وَ عَلَى اللّٰهِ قَصْدُ السَّبِيْلِ وَ مِنْهَا جَآىِٕرٌ » [ النحل : ۹ ] ’’اور سیدھا راستہ اللہ ہی پر (جا پہنچتا) ہے اور ان میں سے کچھ (راستے) ٹیڑھے ہیں۔‘‘ یہی بات ان آیات میں فرمائی : « وَ اِنَّكَ لَتَهْدِيْۤ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ (52) صِرَاطِ اللّٰهِ الَّذِيْ لَهٗ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ اَلَاۤ اِلَى اللّٰهِ تَصِيْرُ الْاُمُوْرُ » [ الشوریٰ : ۵۲، ۵۳ ] ’’اور بلاشبہ تو یقینا سیدھے راستے کی طرف رہنمائی کرتا ہے۔ اس اللہ کے راستے کی طرف کہ جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے اسی کا ہے، سن لو !تمام معاملات اللہ ہی کی طرف لوٹتے ہیں۔‘‘"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {تَنْزِيْلَ الْعَزِيْزِ الرَّحِيْمِ :} یعنی یہ کسی بے اختیار اور بے بس شخص کا کلام نہیں جس کے جھٹلانے کی کوئی پروا نہ ہو، بلکہ اس اللہ تعالیٰ کا نازل کردہ ہے جو سب پر غالب ہے، اس کے مقابلے میں نہ کوئی اپنا کلام لا سکتا ہے نہ اس کے کلام کو نافذ ہونے سے کوئی طاقت روک سکتی ہے اور نہ اسے جھٹلا کر کوئی اس کی گرفت سے بچ سکتا ہے۔ ساتھ ہی وہ بے حد رحم والا بھی ہے کہ اس نے تمھاری ہدایت کے لیے رسول بھیجا، کتاب نازل فرمائی، پھر تمھیں مہلت دی اور جھٹلانے پر فوراً نہیں پکڑا۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { لِتُنْذِرَ قَوْمًا مَّاۤ اُنْذِرَ اٰبَآؤُهُمْ … :} یعنی آپ صلی اللہ علیہ وسلم کو اس لیے رسول بنایا اور یہ کتاب نازل کی ہے تاکہ آپ اس قوم کو ڈرائیں جس میں اس سے پہلے کوئی نبی نہیں آیا، اس لیے وہ دین حق سے بے خبر ہیں۔ یہی مضمون سورۂ سجدہ (۴) میں ملاحظہ فرمائیں۔ ¤ ➋ ابنِ کثیر نے فرمایا کہ {’’ لِتُنْذِرَ قَوْمًا ‘‘} میں قوم سے مراد عرب ہیں، جن کے آباء کو ڈرایا نہیں گیا، مگر اس پر یہ سوال پیدا ہوتا ہے کہ اس کا مطلب تو یہ ہوا کہ رسول اللہ صلی اللہ علیہ وسلم صرف عرب ہی کے لیے بھیجے گئے تھے۔ اس کا جواب ابنِ کثیر نے یہ دیا ہے کہ اکیلے عرب کے ذکر سے دوسری اقوام کی طرف مبعوث ہونے کی نفی نہیں ہوتی، جس طرح بعض افراد کے ذکر سے عموم کی نفی نہیں ہوتی۔ یہاں بہت سی آیات اور متواتر احادیث سے ثابت ہے کہ آپ تمام اقوام کی طرف مبعوث ہیں اور آپ کی بعثت قیامت تک کے لیے ہے۔ دیکھیے سورۂ اعراف (۱۵۷) اور سورۂ سبا (۲۸) مفسر سلیمان الجمل نے فرمایا : {’’ لِتُنْذِرَ قَوْمًا ‘‘} سے مراد عرب اور غیر عرب تمام اقوام ہیں اور {’’ اٰبَآؤُهُمْ ‘‘} سے مراد قریب کے آباء ہیں، یعنی قریب زمانے میں نہ عرب کی طرف کوئی نبی آیا نہ غیر عرب کی طرف۔ ہاں بعید زمانے میں عرب کی طرف اسماعیل، ہود، صالح اور شعیب علیھم السلام مبعوث ہوئے اور غیر عرب کی طرف سب سے آخر میں عیسیٰ علیہ السلام مبعوث ہوئے، جن کی بعثت کو تقریباً چھ سو برس گزر چکے تھے۔ اس لیے اللہ تعالیٰ کے فرمان کا مطلب یہ ہے کہ آپ اپنے زمانے کے تمام لوگوں کی طرف مبعوث ہیں، خواہ عرب ہو یا عجم، کیونکہ ان کے قریب آباء کی طرف کوئی نبی مبعوث نہیں ہوا۔ انبیاء کی آمد پر مدت دراز گزرنے کی وجہ سے یہ سب لوگ اصل دین سے بے خبر ہیں۔‘‘ یہ تفسیر بھی بہت عمدہ ہے۔ اس پر وہ سوال پیدا ہی نہیں ہوتا جو ابن کثیر رحمہ اللہ کی تفسیر پر وارد ہوتا ہے۔ ¤ ➌ ایک اور سوال یہ ہے کہ زمانۂ فترت (جس میں کوئی رسول نہیں آیا) کے لوگوں کو شرک اور گمراہی کی وجہ سے عذاب کیوں ہو گا، جب کہ اللہ تعالیٰ کا قاعدہ ہے : «وَ مَا كُنَّا مُعَذِّبِيْنَ حَتّٰى نَبْعَثَ رَسُوْلًا » [ بني إسرائیل : ۱۵ ] ’’اور ہم کبھی عذاب دینے والے نہیں، یہاں تک کہ کوئی پیغام پہنچانے والا بھیجیں۔‘‘ جواب اس کا سورۂ بنی اسرائیل میں اسی مذکورہ بالا آیت (۱۵) کی تفسیر میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {لَقَدْ حَقَّ الْقَوْلُ عَلٰۤى اَكْثَرِهِمْ …:’’ حَقَّ الْقَوْلُ ‘‘} (بات ثابت ہو چکی) سے مراد ان پر عذاب کا فیصلہ ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : « وَ لَوْ شِئْنَا لَاٰتَيْنَا كُلَّ نَفْسٍ هُدٰىهَا وَ لٰكِنْ حَقَّ الْقَوْلُ مِنِّيْ لَاَمْلَـَٔنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَ النَّااسِ اَجْمَعِيْنَ » [السجدۃ : ۱۳ ] ’’اور اگر ہم چاہتے تو ہر نفس کو اس کی ہدایت دے دیتے اور لیکن میری طرف سے بات پکی ہو چکی کہ یقینا میں جہنم کو جنّوں اور انسانوں، سب سے ضرور بھروں گا۔‘‘ یہ ان لوگوں کا ذکر ہے جو پیغمبر کی آمد اور حق واضح ہونے کے بعد بھی اپنے کفر پر اڑے رہتے ہیں۔ اللہ تعالیٰ کو ازل ہی میں ان کے بارے میں علم تھا کہ وہ اپنے عناد اور سرکشی کی وجہ سے ایمان نہیں لائیں گے اور اس نے اپنے اس علم کی بنا پر لکھ دیا تھا کہ وہ جہنم کا ایندھن بنیں گے۔ یہ اس وجہ سے نہیں کہ اللہ نے جبراً انھیں ایمان سے محروم رکھا، کیونکہ جبر کی صورت میں تو وہ عذاب کے مستحق قرار نہ پاتے۔ یہ بات کہ ان کی گمراہی کا باعث خود ان کی ضد اور ان کا عناد ہے، کئی آیات میں بیان ہوئی ہے۔ دیکھیے سورۂ بقرہ (۲۶، ۲۷)، زخرف (۳۶، ۳۷)، صف (۵)، انعام (۱۱۰)، حم السجدہ (۲۵) اور احقاف (۱۷، ۱۸) اس آیت کی ہم معنی یہ آیت ہے : « اِنَّ الَّذِيْنَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِنُوْنَ (96) وَ لَوْ جَآءَتْهُمْ كُلُّ اٰيَةٍ حَتّٰى يَرَوُا الْعَذَابَ الْاَلِيْمَ » [ یونس : ۹۶، ۹۷ ] ’’بے شک وہ لوگ جن پر تیرے رب کی بات ثابت ہوچکی، وہ ایمان نہیں لائیں گے۔ خواہ ان کے پاس ہر نشانی آ جائے، یہاں تک کہ دردناک عذاب دیکھ لیں۔‘‘"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { اِنَّا جَعَلْنَا فِيْۤ اَعْنَاقِهِمْ اَغْلٰلًا … : ’’ اَغْلٰلًا ‘‘ ’’غُلٌّ‘‘} (غین کے ضمّہ کے ساتھ) کی جمع ہے، لوہے کا کڑا یا زنجیر جو مجرم کے گلے میں ڈال کر اسے باندھا جاتا ہے، بعض اوقات اس کے ساتھ ہی اس کے ہاتھ بھی گردن کے ساتھ باندھ دیے جاتے ہیں۔ یہ قید کی سخت ترین صورت ہے۔ {’’ الْاَذْقَانِ ‘‘ ’’ذَقَنٌ‘‘} کی جمع ہے، ٹھوڑیاں۔ {’’ مُقْمَحُوْنَ ‘‘ ’’قَمَحَ الْبَعِيْرُ‘‘} جب اونٹ حوض سے سر اٹھائے اور پانی نہ پیے۔ {’’فُلَانٌ أَقْمَحَ الْبَعِيْرَ‘‘} ’’فلاں نے اونٹ کا سر اٹھا دیا۔‘‘ {’’مُقْمَحٌ‘‘} اسم مفعول، جس کا سر اوپر اٹھا دیا گیا ہو اور وہ اسے نیچے نہ جھکا سکتا ہو۔ اس آیت میں ان کے کفر پر اصرار اور اڑے رہنے کی نہایت مؤثر تصویر کشی فرمائی ہے، یعنی ہم نے ان انکار کرنے والوں کی گردنوں میں بھاری طوق ڈال دیے ہیں، جو ایک دوسرے کے اوپر اس طرح تہ بہ تہ ہیں کہ ٹھوڑیوں تک پہنچ گئے ہیں۔ جن کی وجہ سے ان کے سر اوپر اٹھا دیے گئے ہیں۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { وَ جَعَلْنَا مِنْۢ بَيْنِ اَيْدِيْهِمْ سَدًّا …:} یعنی ہم نے ان کی گردنوں میں بھاری طوق ڈالنے کے علاوہ ان کے آگے ایک دیوار اور ان کے پیچھے ایک دیوار کر دی ہے، پھر انھیں اوپر سے پردے کے ساتھ ڈھانک دیا ہے، جس کے نتیجے میں انھیں کچھ نظر ہی نہیں آتا۔ یہ مثال ہے ان لوگوں کی جو اپنی جاہلانہ اور مشرکانہ رسوم پر اڑے ہوئے ہیں۔ ان کے غلط ہونے کی کھلی سے کھلی دلیل بھی نہ انھیں دکھائی دیتی ہے نہ اسے سنتے ہیں۔ اب یہ لوگ حق پر ایمان لائیں تو کیسے لائیں؟"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {وَ سَوَآءٌ عَلَيْهِمْ ءَاَنْذَرْتَهُمْ۠ اَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُوْنَ :} اس کا مطلب یہ نہیں کہ انھیں سمجھانا اور تبلیغ کرنا چھوڑ دیں، بلکہ مطلب یہ ہے کہ جب آپ لوگوں کو سمجھائیں گے اور عام تبلیغ کریں گے تو آپ کو دو قسم کے لوگوں سے سابقہ پیش آئے گا، ایک وہ لوگ جن پر آپ کی تبلیغ کوئی اثر نہیں کرے گی اور وہ اپنے کفر و شرک پر بضد رہیں گے۔ اس آیت میں انھی لوگوں کا ذکر کیا گیا ہے۔ مزید دیکھیے سورۂ بقرہ (۶)۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {اِنَّمَا تُنْذِرُ مَنِ اتَّبَعَ الذِّكْرَ … :} یعنی آپ کے ڈرانے کا فائدہ صرف ان لوگگوں کو ہو گا جو نصیحت سنیں اور اسے مان کر اس پر عمل کریں۔ {’’ وَ خَشِيَ الرَّحْمٰنَ بِالْغَيْبِ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ فاطر (۱۸) {’’ بِمَغْفِرَةٍ ‘‘} کی تنوین تعظیم کے لیے ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { اِنَّا نَحْنُ نُحْيِ الْمَوْتٰى :} یعنی ہم ان سب کو مرنے کے بعد زندہ کریں گے، ان کو بھی جو آپ کے ڈرانے کے باوجود کفر پر اڑے رہے اور انھیں بھی جنھوں نے آپ کی نصیحت سن کر اس کی پیروی کی، تاکہ انھیں ان کے اعمال کی جزا دیں۔ بعض مفسرین نے مُردوں کو زندہ کرنے سے مشرکین کو شرک سے نکال کر ایمان میں لانا مراد لیا ہے، مگر سیاق کے لحاظ سے پہلا معنی زیادہ ظاہر ہے۔ ¤ ➋ { وَ نَكْتُبُ مَا قَدَّمُوْا :} اور اچھے یا برے جو عمل بھی انھوں نے کیے ہیں، ہم سب لکھ رہے ہیں۔ مراد اس سے وہ اعمال ہیں جو انھوں نے اپنی زندگی میں خود کیے۔ ¤ ➌ { وَ اٰثَارَهُمْ : ’’ اٰثَارَ ‘‘ ’’أَثَرٌ‘‘} کی جمع ہے۔ اس کی تفسیر میں دو قول ہیں، ایک یہ کہ اس سے مراد ان کی زندگی میں یا ان کی موت کے بعد دوسرے لوگوں کے وہ اچھے یا برے اعمال ہیں جن کا سبب یہ بنے اور ان کے کسی قول یا فعل یا ان کی کسی حالت کی وجہ سے دوسرے لوگوں نے وہ اعمال اختیار کیے۔ چنانچہ لوگوں نے ان کی دعوت، نصیحت، امر بالمعروف، نہی عن المنکر یا جہاد فی سبیل اللہ کی وجہ سے یا ان کے پڑھانے یا تصنیف کی وجہ سے ان کی زندگی میں یا موت کے بعد جو نیک عمل کیے، یا انھوں نے کوئی مسجد، مدرسہ یا لوگوں کے فائدے کی کوئی چیز بنا دی، جس سے ان کی موت کے بعد بھی لوگ فائدہ اٹھاتے رہے، سب ان کے نامہ اعمال میں لکھے جائیں گے۔ یہی حال ان برے اعمال کا ہے جو ان کی وجہ سے ان کی زندگی میں یا موت کے بعد لوگوں نے کیے، وہ بھی ان کے نامہ اعمال میں درج ہوں گے۔ جریر بن عبد اللہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَ أَجْرُ مَنْ عَمِلَ بِهَا بَعْدَهُ مِنْ غَيْرِ أَنْ يَّنْقُصَ مِنْ أُجُوْرِهِمْ شَيْءٌ وَمَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً سَيِّئَةًةً كَانَ عَلَيْهِ وِزْرُهَا وَ وِزْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أَوْزَارِهِمْ شَيْءٌ] [ مسلم، الزکاۃ، باب الحث علی الصدقۃ… : ۱۰۱۷ ] ’’جو شخص اسلام میں کوئی اچھا طریقہ (یعنی کتاب و سنت کی کوئی بات) جاری کرے اس کے لیے اس کے اپنے عمل کا اجر ہے اور ان لوگوں کے عمل کا بھی جو اس کے بعد کریں، بغیر اس کے کہ ان کے اجر میں سے کچھ کم ہو اور جو شخص اسلام میں کوئی برا طریقہ (یعنی کتاب و سنت کے خلاف یا کوئی بدعت) جاری کرے اس پر اپنے گناہ کا بوجھ ہو گا اور ان کے گناہ کا بھی جو اس کے بعد کریں گے، بغیر اس کے کہ ان کے بوجھ میں سے کچھ کم ہو۔‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ إِلَّا  مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُوْ لَهُ ] [ مسلم، الوصیۃ، باب ما یلحق الإنسان … : ۱۶۳۱ ] ’’جب انسان فوت ہو جاتا ہے، تو اس کا عمل اس سے منقطع ہو جاتا ہے، سوائے تین چیزوں کے، صدقہ جاریہ سے، یا اس علم سے جس سے لوگ فائدہ اٹھائیں، یا نیک اولاد سے جو اس کے لیے دعا کرے۔‘‘ اس آیت اور ان احادیث سے دعوت و تعلیم اور جہاد فی سبیل اللہ کے عمل کی عظمت اور فضیلت معلوم ہوتی ہے۔ ¤ {’’ اٰثَارَهُمْ ‘‘} کی تفسیر میں دوسرا قول یہ ہے کہ اس سے مراد یہ ہے کہ نیکی یا بدی کی طرف چل کر جانے والے قدموں کے نشانوں کو بھی اللہ تعالیٰ لکھ لیتے ہیں۔ چنانچہ جابر بن عبد اللہ رضی اللہ عنھما بیان کرتے ہیں کہ مسجد نبوی کے ارد گرد زمین کے کچھ قطعے خالی ہو گئے تو بنو سلمہ نے ارادہ کیا کہ مسجد کے قریب منتقل ہو جائیں۔ رسول اللہ صلی اللہ علیہ وسلم کو اس کی اطلاع ملی تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھے اطلاع ملی ہے کہ تم مسجد کے قریب منتقل ہونے کا ارادہ رکھتے ہو؟‘‘ انھوں نے کہا : ’’ہاں، یا رسول اللہ! ہم نے یہ ارادہ کیا ہے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ يَا بَنِيْ سَلِمَةَ! دِيَارَكُمْ! تُكْتَبْ آثَارُكُمْ دِيَارَكُمْ! تُكْتَبْ آثَارُكُمْ ] [ مسلم، المساجد، باب فضل کثرۃ الخطا إلی المساجد : ۶۶۵ ] ’’اے بنو سلمہ! اپنے گھروں ہی میں رہو، تمھارے قدموں کے نشانات لکھے جائیں گے، (اے بنو سلمہ!) اپنے گھروں ہی میں رہو، تمھارے قدموں کے نشانات لکھے جائیں گے۔‘‘ ابنِ کثیر نے فرمایا، اس قول اور پہلے قول میں کوئی تضاد نہیں، بلکہ اس قول کی رو سے {’’ اٰثَارَهُمْ ‘‘} سے کسی کی پیروی کی وجہ سے کیے جانے والے اعمال مراد لینا بدرجہ اولیٰ ثابت ہوتا ہے، کیونکہ جب قدموں کے نشان تک لکھے جاتے ہیں تو اچھے یا برے جن اعمال میں کوئی شخص نمونہ بنا، وہ تو بدرجہ اولیٰ لکھے جاتے ہیں۔ ¤ ➍ { وَ كُلَّ شَيْءٍ اَحْصَيْنٰهُ فِيْۤ اِمَامٍ مُّبِيْنٍ: ’’ اِمَامٍ مُّبِيْنٍ ‘‘}  سے مراد لوحِ محفوظ ہے، جس میں اللہ تعالیٰ نے ہونے والا ہر کام پہلے ہی درج فرما دیا ہے، یا ہر شخص کا اعمال نامہ ہے جس میں اس کا چھوٹا یا بڑا ہر عمل پورے ضبط کے ساتھ درج ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «يَوْمَ نَدْعُوْا كُلَّ اُنَاسٍۭ بِاِمَامِهِمْ » [ بني إسرائیل : ۷۱ ] ’’جس دن ہم سب لوگوں کو ان کے امام کے ساتھ بلائیں گے۔‘‘ یہاں امام سے مراد ان کے اعمال کی کتاب ہے۔ اس واضح کتاب کا ذکر قرآن مجید میں کئی مقامات پر ہے۔ دیکھیے سورۂ زمر (۶۹) اور کہف (۴۹) یہاں {’’ اِمَامٍ مُّبِيْنٍ ‘‘} سے مراد اعمال نامہ لینا زیادہ مناسب ہے، اگرچہ اس میں وجود میں آنے کے بعد وہی کچھ درج ہو گا جو اس سے پہلے لوح محفوظ میں درج ہو چکا ہے ۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {وَ اضْرِبْ لَهُمْ مَّثَلًا اَصْحٰبَ الْقَرْيَةِ … :} یعنی جن لوگوں کو ڈرانے کے لیے آپ کو یہ قرآن حکیم دے کر مبعوث کیا گیا ہے اور جن کے اکثر لوگ کفر پر اصرار کی وجہ سے عذاب کے مستحق بن چکے ہیں، انھیں اس بستی کے لوگوں کا حال بطور مثال سنائیں، جن کی طرف ہمارے بھیجے ہوئے رسول آئے۔ انھوں نے بھی اپنے رسولوں کو انھی کی طرح جھٹلایا تھا، سو ان کا انجام یہ لو گ بھی پیش نظر رکھیں۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی بھی ہے کہ آپ پہلے رسول نہیں جسے اس کی قوم نے جھٹلایا ہو۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { اِذْ اَرْسَلْنَاۤ اِلَيْهِمُ اثْنَيْنِ فَكَذَّبُوْهُمَا … :} یعنی ہم نے ان لوگوں کی طرف دو رسول بھیجے تو انھوں نے دونوں کو جھٹلا دیا، تو ہم نے انھیں تیسرے پیغمبر کے ساتھ قوت دی، تو ان سب نے حرف تاکید {’’إِنَّ‘‘} کے ساتھ انھیں کہا کہ یقینا ہم تمھاری طرف بھیجے ہوئے ہیں۔ ¤ ➋ مفسر عبد الرحمن کیلانی رحمہ اللہ لکھتے ہیں : ’’یہ بستی کون سی تھی؟ اس کے متعلق قرآن و حدیث میں کوئی صراحت نہیں۔ (بعض) مفسرین کہتے ہیں کہ اس سے مراد روم میں واقع شہر انطاکیہ ہے۔ پھر اس بات میں بھی اختلاف ہے کہ یہ رسول بلاواسطہ رسول تھے یا بالواسطہ رسول یا مبلغ تھے۔ بعض کہتے ہیں کہ یہ مبلغ سیدنا عیسیٰ علیہ السلام ہی نے بھیجے تھے اور بعض کہتے ہیں کہ یہ سیدنا عیسیٰ علیہ السلام کے حواریوں میں سے تھے۔ قرآن کے بیان سے سرسری طور پر یہی معلوم ہوتا ہے کہ وہ بلاواسطہ اللہ کے رسول تھے اور اگر یہی بات ہو تو ان کا زمانہ سیدنا عیسیٰ علیہ السلام سے پہلے کا زمانہ ہونا چاہیے، کیونکہ سیدنا عیسیٰ علیہ السلام کے بعد رسول اللہ صلی اللہ علیہ وسلم کی بعثت تک کوئی نبی یا رسول مبعوث نہیں ہوا، اور بستی کے نام کی تعیین یا رسول کے بلاواسطہ یا بالواسطہ ہونے کی تعیین کوئی مقصود بالذات چیز بھی نہیں کہ اس کی تحقیق ضروری ہو، مقصود بالذات چیز تو کفارِ مکہ کو سمجھانا ہے۔ کیونکہ کفارِ مکہ اور ان بستی والوں کے حالات میں بہت سی باتوں میں مماثلت پائی جاتی تھی۔‘‘ یہ رسول عیسیٰ علیہ السلام کی طرف سے نہیں بلکہ اللہ تعالیٰ ہی کی طرف سے بھیجے ہوئے تھے۔ اس کی ایک دلیل یہ بھی ہے کہ ان پر وہی اعتراض کیا گیا جو اللہ کے دوسرے رسولوں پر کیا گیا کہ تم ہمارے جیسے بشر ہو۔ عیسیٰ علیہ السلام کے حواریوں پر اس اعتراض کے بجائے وہ کوئی اور اعتراض کرتے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) {قَالُوْا مَاۤ اَنْتُمْ اِلَّا بَشَرٌ مِّثْلُنَا … :} کفارِ مکہ نے بھی رسول اللہ صلی اللہ علیہ وسلم کو یہی بات کہی۔ دیکھیے سورۂ انعام (۹۱) بلکہ ہر قوم نے اپنے رسول کو یہی کہا کہ تم ہمارے جیسے بشر ہو، آخر تم میں ہم سے بڑھ کر وہ کون سی خوبی ہے جو اللہ نے تمھیں ہی نبوت کے لیے منتخب کیا؟ دیکھیے سورۂ ابراہیم (۱۰)، بنی اسرائیل (۹۴)، مومنون (۳۴) اور تغابن (۶) گویا نبوت کے متعلق ہمیشہ سے جاہلی تصور یہ ہے کہ جو بشر ہو وہ رسول نہیں ہو سکتا۔ دوسرے الفاظ میں یہی تصور بعض جاہلوں میں اس طرح پایا جاتا ہے کہ جو رسول ہو وہ بشر نہیں ہو سکتا، حالانکہ قرآن تمام انبیاء کو بشر بھی ثابت کرتا ہے اور رسول بھی۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {قَالُوْا رَبُّنَا يَعْلَمُ اِنَّاۤ اِلَيْكُمْ لَمُرْسَلُوْنَ:} ’’ہمارا رب جانتا ہے ‘‘ یہ الفاظ قسم کے لیے استعمال کیے جاتے ہیں۔ بلاغت کا اصول ہے کہ سننے والا جتنی شدت کے ساتھ کسی بات کا منکر ہو اتنی ہی تاکید کے ساتھ بات کی جائے۔ پیغمبروں کا حوصلہ دیکھیے، بستی والوں کے انھیں صاف جھوٹا کہنے پر بھی وہ برا فروختہ نہیں ہوئے، بلکہ قسم کھا کر انھیں اپنی رسالت کا یقین دلانے کی کوشش کی۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {وَ مَا عَلَيْنَاۤ اِلَّا الْبَلٰغُ الْمُبِيْنُ :} یعنی ہمارا فریضہ اتنا ہی ہے کہ ہم تمھیں اللہ کا پیغام صاف پہنچا دیں۔ رہا تمھیں مومن بنا لینا، یا تمھارے مطالبات کے مطابق معجزے دکھانا، یا تم پر عذاب لے آنا، تو یہ ہمارا کام نہیں۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) { قَالُوْۤا اِنَّا تَطَيَّرْنَا بِكُمْ …:} جب بستی والے دلیل کے ساتھ جواب نہ دے سکے تو دھمکی پر اتر آئے، جیسا کہ فرعون اور دوسرے متکبروں کا شیوہ رہا ہے۔ کہنے لگے، اگر تم اپنی دعوت سے باز نہ آئے تو ہم تمھیں سنگسار کر دیں گے اور تمھیں ہمارے ہاتھوں درد ناک سزا سے دو چار ہونا پڑے گا۔ {’’ تَطَيَّرْنَا ‘‘} کی تفسیر کے لیے دیکھیے سورۂ نمل (۴۷) اور سورۂ اعراف (۱۳۱)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ {قَالُوْا طَآىِٕرُكُمْ مَّعَكُمْ :} پیغمبروں نے کہا، تم پر آنے والی نحوست کا باعث ہم نہیں بلکہ خود تمھارے افعال ہیں کہ تم نے اللہ کے ساتھ شرک اور اس کی صریح نافرمانی اور سرکشی اختیار کر رکھی ہے۔ اگر تم پر قحط پڑا ہے، یا وبا آئی ہے، یا کوئی اور آفت تو اس کا باعث تم خود ہو، ہم نہیں، کیونکہ ہم تو اللہ کی توحید اور اس کی اطاعت ہی کی دعوت دیتے ہیں۔ ¤ ➋ { اَىِٕنْ ذُكِّرْتُمْ :} اس شرط کا جواب محذوف ہے، یعنی کیا اگر تمھیں نصیحت کی جائے اور تمھاری خیر خواہی کی جائے تو شکر گزار ہونے کے بجائے ہمیں منحوس قرار دیتے ہو اور دھمکیاں دیتے ہو؟ ¤ ➌ {بَلْ اَنْتُمْ قَوْمٌ مُّسْرِفُوْنَ :} بلکہ اصل یہ ہے کہ تم حد سے بڑھنے والے لوگ ہو۔ اپنی خواہشوں کے خلاف اللہ تعالیٰ کی طرف سے آنے والی، یا عقل و دانش کی رو سے عائد ہونے والی کوئی پابندی تمھیں قبول نہیں۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ {وَ جَآءَ مِنْ اَقْصَا الْمَدِيْنَةِ رَجُلٌ يَّسْعٰى:} آیات سے ظاہر ہے کہ پیغمبروں کی دعوت اور قوم کا مباحثہ مدت تک جاری رہا، حتیٰ کہ ان کی دعوت ساری بستی میں پھیل گئی اور جب انھوں نے قتل کی دھمکی دی تو یہ خبر بھی ہر طرف پھیل گئی کہ بستی کے لوگ پیغمبروں کو قتل کرنا چاہتے ہیں۔ بستی خاصی بڑی تھی، جسے پہلے اللہ تعالیٰ نے {’’ الْقَرْيَةِ ‘‘} فرمایا ہے، اس کے بعد اسے {’’ الْمَدِيْنَةِ ‘‘} یعنی شہر کہا ہے۔ اس شہر کے سب سے دور کنارے میں ایک صالح آدمی رہتا تھا، اسے جب پیغمبروں کی دعوت اور قوم کے انکار کی اور پیغمبروں کو قتل کرنے کی دھمکیوں کی خبر پہنچی تو وہ شہر کے سب سے دور کنارے سے دوڑتا ہوا آیا کہ کہیں وہ جلدی میں پیغمبروں کو قتل ہی نہ کر دیں، اور وہ اپنی قوم کو سمجھانے لگا۔ اس مرد صالح کا یہ عمل ہمارے لیے نمونہ ہے کہ جب اسے معلوم ہو گیا کہ پیغمبر حق پر ہیں تو اس نے اس بات پر اکتفا نہیں کیا کہ اپنی جگہ بیٹھ کر اللہ اللہ کرتا رہتا، بلکہ حق ق کی شہادت دینے کے لیے جتنی جلدی ہو سکتا تھا دوڑتا ہوا پہنچا اور اس نے اپنی جان کی پروا نہ کرتے ہوئے قوم کو سمجھانے کی پوری کوشش کی اور کہا، اے میری قوم! اللہ کے ان رسولوں کی پیروی اختیار کرو۔ اس مرد صالح کا نام تفاسیر میں حبیب نجار لکھا ہے جو اسرائیلیات سے ماخوذ ہے۔ (واللہ اعلم) ¤ ➋ یہاں ایک سوال ہے کہ سورۂ قصص میں موسیٰ علیہ السلام کو ان کے قتل کے مشورے کی خبر دینے والے صاحب کا ذکر کرتے ہوئے فرمایا : « وَ جَآءَ رَجُلٌ مِّنْ اَقْصَا الْمَدِيْنَةِ» [ القصص : ۲۰ ] جب کہ یہاں فرمایا : « وَ جَآءَ مِنْ اَقْصَا الْمَدِيْنَةِ رَجُلٌ» اس میں کیا حکمت ہے؟ اہلِ علم نے فرمایا کہ ہمیشہ پہلے اس بات کا ذکر کیا جاتا ہے جو موقع کے لحاظ سے زیادہ اہم ہو۔ سورۂ قصص میں موسیٰ علیہ السلام کو اطلاع دینے والے شخص کی مردانگی کا اظہار زیادہ اہم تھا، اس لیے {’’ رَجُلٌ ‘‘} کا ذکر پہلے فرمایا، جب کہ یہاں اس مرد ناصح کا دور سے آ کر سمجھانے کا ذکر زیادہ اہم تھا، اس لیے {’’ مِنْ اَقْصَا الْمَدِيْنَةِ ‘‘} کو پہلے ذکر فرمایا۔ (و اللہ اعلم)"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {اتَّبِعُوْا مَنْ لَّا يَسْـَٔلُكُمْ اَجْرًا وَّ هُمْ مُّهْتَدُوْنَ:} یعنی پیغمبروں ککی بات مان لو، ان کے کہنے پر چلو اور دیکھو کہ وہ اپنے کسی دنیوی مفاد کی خاطر تمھیں دعوت نہیں دے رہے، نہ ہی تم سے اپنی اس خیر خواہی کی کوئی اجرت طلب کر رہے ہیں، خود سیدھے راستے پر ہیں اور تمھیں سیدھے راستے کی طرف بلا رہے ہیں۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ { وَ مَا لِيَ لَاۤ اَعْبُدُ الَّذِيْ فَطَرَنِيْ :} توحید کی دعوت دیتے ہوئے اس مرد صالح نے نہایت حکیمانہ اسلوب اختیار کیا کہ انھیں مخاطب کرنے کے بجائے اپنے آپ کو مخاطب کر لیا، تاکہ وہ چڑ نہ جائیں۔ یعنی آخر مجھے کیا ہے کہ میں اس کی عبادت نہ کروں جس نے مجھے پیدا کیا ہے اور ان کی عبادت کروں جنھوں نے کچھ بھی پیدا نہیں کیا، بلکہ خود لوگوں نے انھیں بنایا ہے۔ ¤ ➋ { وَ اِلَيْهِ تُرْجَعُوْنَ :} اور یہ بھی نہ سمجھنا کہ اس نے ہمیں پیدا کر کے آزاد چھوڑ دیا ہے، اب اس کا کوئی تعلق واسطہ ہم سے نہیں رہا، بلکہ تم سب کو مرنے کے بعد اسی کے پاس واپس لے جایا جائے گا، خواہ تم چاہو یا نہ چاہو۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) {ءَاَتَّخِذُ مِنْ دُوْنِهٖۤ …:} کیا میں اپنے پیدا کرنے والے کے بجائے ان زندہ یا مردہ ہستیوں کی عبادت کروں کہ رحمن اگر مجھے کوئی تکلیف پہنچانے کا ارادہ کرے تو ان کی سفارش میرے کسی کام آ سکے گی نہ وہ زبردستی مجھے بچا سکیں گے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) { اِنِّيْۤ اِذًا لَّفِيْ ضَلٰلٍ مُّبِيْنٍ :} یعنی اگر میں ایسا کروں گا تو اس وقت میں یقینا کھلی گمراہی میں ہوں گا۔ اس بستی والوں میں عقیدے اور عمل کی جو خرابیاں تھیں وہ سب اہلِ مکہ میں بھی پائی جاتی تھیں۔ اس بستی والوں کی مثال کے ساتھ مقصود اہلِ مکہ کو سمجھانا ہے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) { اِنِّيْۤ اٰمَنْتُ بِرَبِّكُمْ فَاسْمَعُوْنِ :} پھر اس مرد ناصح نے لوگوں کو اور اس بستی کی طرف بھیجے گئے پیغمبروں کو، سب کو مخاطب کرتے ہوئے اپنے ایمان لانے کا اور اس پر اپنی استقامت کا اعلان کیا، یعنی میں اس رب پر ایمان لایا ہوں جو میرا ہی نہیں تمھارا بھی رب ہے، سو تم پر لازم ہے کہ میری بات غور سے سنو۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ { قِيْلَ ادْخُلِ الْجَنَّةَ :} یہاں درمیان کی بات محذوف ہے جو خود بخود سمجھ میں آ رہی ہے کہ اس کی اس بات پر قوم کے لوگ اس پر پل پڑے اور اسے شہید کر دیا، تو اللہ تعالیٰ نے اس کی شہادت کو قبول فرمایا اور شہادت کی دیر تھی کہ اسے جنت میں داخلے کی بشارت مل گئی۔ شہداء کے جنت میں داخلے کی کیفیت کے متعلق دیکھیے سورۂ بقرہ (۱۵۴) اور آل عمران (۱۶۹ تا ۱۷۱)۔ ¤ ➋ { قَالَ يٰلَيْتَ قَوْمِيْ يَعْلَمُوْنَ :} اس سے ظاہر ہے کہ وہ  بندہ اپنی قوم کا کس قدر خیر خواہ تھا کہ زندگی میں بھی اس نے جان کی پروا نہ کرتے ہوئے قوم کو نصیحت کی اور مرنے کے بعد بھی ان کے لیے اس کی خیر خواہی جاری رہی، پھر اپنے قاتلوں کے متعلق اس کی تمنا ہے کہ اللہ تعالیٰ نے اسے جو اعزاز و اکرام بخشا کسی طرح ان کو بھی معلوم ہو جائے اور اسے جان کر وہ بھی ایمان لے آئیں اور اس اکرام کے حق دار بن جائیں۔ فی الحقیقت مومن ایسا ہی خیر خواہ ہوتا ہے، احد کے شہداء نے شہادت کے بعد اسی تمنا کا اظہار کیا تھا۔ ہمارے لیے اس میں سبق ہے کہ دعوت دیتے ہوئے کبھی غیظ و غضب اور انتقامی جذبے سے مغلوب نہ ہوں، بلکہ نہایت صبرو ہمت کے ساتھ دعوت جاری رکھیں۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) { بِمَا غَفَرَ لِيْ رَبِّيْ وَ جَعَلَنِيْ مِنَ الْمُكْرَمِيْنَ :} اس قصّے میں اہلِ مکہ کے لیے بھی پیغام ہے کہ جس طرح وہ مرد صالح اپنی قوم کا خیر خواہ تھا محمد صلی اللہ علیہ وسلم بھی تمھارے ایسے ہی سچے خیر خواہ ہیں۔ اس قصّے میں قریش کے لیے ایک اور سبق بھی ہے کہ اگر تم نبی کریم صلی اللہ علیہ وسلم پر ایمان نہیں لاؤ گے تو اللہ تعالیٰ اور لوگوں کو لے آئے گا جو آپ پر ایمان لائیں گے اور آپ کی مدد کریں گے اور شہادت کی پروا نہیں کریں گے، جیسا کہ اس بستی کے دور ترین حصے سے وہ آدمی آیا تھا۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) { وَ مَاۤ اَنْزَلْنَا عَلٰى قَوْمِهٖ مِنْۢ بَعْدِهٖ مِنْ جُنْدٍ مِّنَ السَّمَآءِ … :} اس قوم کے بالکل حقیر اور بے وقعت ہونے کے اظہار کے لیے فرمایا کہ ہم نے اس کے بعد اس کی قوم کو ہلاک کرنے کے لیے آسمان سے فرشتوں کا کوئی لشکر نہیں اتارا اور نہ ہی جب ہم کسی قوم کو مکمل طور پر نیست و نابود کرنا چاہتے ہیں تو فرشتوں کی فوج بھیجتے ہیں، کیونکہ اس کام کے لیے اس کی ضرورت ہی نہیں ہوتی، بلکہ اس کے لیے ایک فرشتے کی ایک چیخ ہی کافی ہوتی ہے۔ ہاں، اپنے مومن بندوں کی مدد کے لیے ہم ہزاروں فرشتے نازل کر دیتے ہیں جو ان کے دل کو مضبوط رکھتے ہیں، اور اس وقت کفار کو عذاب آسمان کے فرشتوں کے ذریعے سے نہیں بلکہ ایمان والوں کے ہاتھوں سے دیا جاتا ہے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) {اِنْ كَانَتْ اِلَّا صَيْحَةً وَّاحِدَةً فَاِذَا هُمْ خٰمِدُوْنَ:} یعنی فرشتے نے ایک چیخ ماری جس سے ان سب کی زندگی کا شعلہ بجھ گیا۔ ان کے یک لخت ہلاک ہونے کو آگ کے بجھنے کے ساتھ تشبیہ دی ہے۔ ابو العلاء المعری نے کہا ہے: ¤ {وَ كَالنَّارِ الْحَيَاةُ فَمِنْ رَمَادٍ ¤ أَوَاخِرُهَا وَ أَوَّلُهَا دُخَانٗ} ¤ ’’زندگی آگ کی طرح ہے، جس کا آخر راکھ اور ابتدا دھواں ہے۔‘‘"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {يٰحَسْرَةً عَلَى الْعِبَادِ …:} فوت شدہ چیز پر شدید افسوس کو حسرت کہتے ہیں۔ {’’ الْعِبَادِ ‘‘} میں الف لام عہد کا ہے، مراد وہ بندے ہیں جو رسولوں کو جھٹلاتے رہے، اس بستی والے بھی ان میں شامل ہیں۔ یہ ان کی حالت کا نقشہ ہے کہ ان کا حال ایسا ہے جس پر حسرت و افسوس ہی کیا جا سکتا ہے۔ ان کے پاس جو رسول بھی آیا وہ اسے جھٹلاتے ہی رہے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) {اَلَمْ يَرَوْا كَمْ اَهْلَكْنَا قَبْلَهُمْ …: ’’ اَلَمْ يَرَوْا ‘‘} سے مراد {’’أَلَمْ يَعْلَمُوْا‘‘} ہے، یعنی سابقہ اقوام کے انجام کی طرف نہ دیکھتے ہیں نہ اس میں غوروفکر کرتے ہیں۔ وہ قومیں بھی اپنے رسولوں کا مذاق اڑاتی رہیں اور اس کی پاداش میں انھیں ہلاک کر دیا جاتا تھا اور ان کا نام و نشان تک ایسا مٹا کہ ان میں سے کوئی بھی بچ کر ان کے پاس واپس نہیں لوٹا، پھر بھی ان کافروں کا یہی دستور رہا کہ جب کوئی نیا رسول آتا تو اس سے اسی طرح تمسخر اور استہزا شروع کر دیتے جو پہلے کفار کی عادت تھی اور کچھ سبق حاصل نہیں کرتے تھے اور آج کفارِ مکہ کا بھی رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایسا ہی معاملہ ہے۔ (کیلانی) {’’ لَا يَرْجِعُوْنَ ‘‘} (وہ پلٹ کر نہیں آتے) کے لفظ میں ان لوگوں کا رد ہے جو بعض شخصیتوں کے موت کے بعد دوبارہ زندہ ہو کر دنیا میں آنے کے قائل ہیں اور ان ہندؤوں کا بھی جو کہتے ہیں کہ تمام مرنے والے دوبارہ دنیا میں کسی دوسری شکل میں آتے ہیں۔ اگر پہلی زندگی میں انھوں نے اچھے کام کیے ہوں تو پہلے سے اچھی صورت میں اور اگر برے کام کیے ہوں تو پہلے سے بری صورت میں اور اس عقیدے کو تناسخ یا او اگون کہتے ہیں۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) { وَ اِنْ كُلٌّ لَّمَّا جَمِيْعٌ …:} یہ {’’ اِنْ ‘‘} نافیہ ہے اور {’’ لَمَّا ‘‘} بمعنی {’’إِلَّا‘‘} ہے۔ یعنی جو لوگ پہلے گزر چکے یا موجود ہیں یا آئندہ ہوں گے، وہ سب ہمارے پاس اکٹھے حاضر کیے جانے والے ہیں۔ {’’ مُحْضَرُوْنَ ‘‘} اسم مفعول ہے، یعنی وہ چاہیں یا نہ چاہیں، اپنے خیال میں جتنے بڑے ہوں، ہر حال میں سب ہمارے پاس اکٹھے حاضر کیے جانے والے ہیں۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ {وَ اٰيَةٌ لَّهُمُ الْاَرْضُ الْمَيْتَةُ :} پچھلی آیت میں تمام لوگوں کے اللہ تعالیٰ کے پاس حاضر کیے جانے کا ذکر ہے، جو قیامت کے دن ہو گا، چونکہ کفار اسے نہیں مانتے تھے، اس لیے اب اس کی کئی دلیلیں بیان فرمائیں۔ یہاں {’’ اٰيَةٌ ‘‘} (نشانی) سے مراد دلیل و برہان ہے۔ مردہ زمین سے مراد بنجر اور بے آباد زمین ہے۔ ¤ ➋ { اَحْيَيْنٰهَا وَ اَخْرَجْنَا مِنْهَا حَبًّا …: ’’ اٰيَةٌ ‘‘} میں تنوین تعظیم کے لیے ہے، یعنی ہماری مرُدوں کو زندہ کرنے کی قدرت کی ایک عظیم دلیل یہ ہے کہ ہم بنجر اور قحط زدہ زمین پر بارش برساتے ہیں تو وہ بڑھتی پھولتی اور لہلہاتی ہے، پھر ہم اس سے غلہ پیدا کرتے ہیں جو ان کے کھانے کی چیزوں کا اکثر حصہ ہیں۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) {وَ جَعَلْنَا فِيْهَا جَنّٰتٍ مِّنْ نَّخِيْلٍ … : ’’ نَخِيْلٍ ‘‘ ’’نَخْلٌ‘‘} کی جمع ہہے، جیسے {’’عَبْدٌ‘‘} کی جمع {’’عَبِيْدٌ‘‘} ہے۔ {’’ اَعْنَابٍ ‘‘ ’’عِنَبٌ‘‘} کی جمع ہے اور {’’ الْعُيُوْنِ ‘‘ ’’عَيْنٌ‘‘} کی جمع ہے، مراد کنویں اور چشمے ہیں جن سے زمین سیراب کی جاتی ہے۔ یعنی مُردہ زمین کو زندہ کر کے ہم اس سے ان کی خوراک کے لیے صرف غلہ ہی نہیں اگاتے بلکہ ان کے کام و دہن کی لذت کے لیے مختلف اقسام کے پھل بھی کثرت سے پیدا کرتے ہیں۔ یہاں صرف دو پھلوں کا ذکر اس لیے کیا ہے کہ یہ کثیر المنافع بھی ہیں اور عربوں کو مرغوب بھی، نیز ان کی پیداوار بھی عرب میں زیادہ ہے، پھر غلے کا ذکر پہلے کیا، کیوں کہ اس کی پیداوار بھی زیادہ ہے اور خوراک کی حیثیت سے اس کی اہمیت بھی مسلّمہ ہے۔ جب تک انسان روٹی یا چاول وغیرہ خوراک سے اپنا پیٹ نہیں بھرتا، محض پھل فروٹ سے اس کی غذائی ضرورت پوری نہیں ہوتی۔ (احسن البیان)"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) {لِيَاْكُلُوْا مِنْ ثَمَرِهٖ وَ مَا عَمِلَتْهُ اَيْدِيْهِمْ …:} یعنی یہ غلے، باغات، چشمے اور پھل ان کی کسی کوشش اور محنت سے پیدا نہیں ہوئے بلکہ یہ سب کچھ ہم نے پیدا کیا ہے، تو کیا وہ شکر نہیں کرتے کہ ہماری ہی عبادت کریں، کسی اور کو اس میں شریک نہ کریں۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {سُبْحٰنَ الَّذِيْ خَلَقَ الْاَزْوَاجَ كُلَّهَا … :} یعنی ان لوگوں نے اللہ کے جو شریک بک بنا رکھے ہیں وہ ان سے پاک ہے۔ پھر اپنی کچھ صفات بیان فرمائیں جو صرف اس کے ساتھ خاص ہیں اور جن کا تقاضا ہے کہ اسے ہر عیب، ہر نقص اور ہر شرک سے پاک سمجھا جائے۔ {’’ الْاَزْوَاجَ ‘‘} کے کئی معنی ہیں، مثلاً اس کا اطلاق نر و مادہ پر بھی ہوتا ہے۔ مرد عورت کے لیے زوج ہے اور عورت مرد کے لیے اور ان دونوں میں اللہ تعالیٰ نے فطرتی طور پر ایک دوسرے کے لیے کشش رکھ دی ہے، پھر اس زوج کے ایک دوسرے سے ملنے سے آگے مزید تخلیق کا سلسلہ چلتا ہے اور یہ سلسلہ صرف حیوانات ہی میں نہیں، نباتات میں بھی پایا جاتا ہے، بلکہ اللہ تعالیٰ نے فرمایا : « وَ مِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُوْنَ » [ الذاریات : ۴۹ ] ’’اور ہر چیز سے ہم نے دو قسمیں بنائیں، تاکہ تم نصیحت حاصل کرو۔‘‘ نباتات میں سے کچھ درخت تو ایسے ہیں جن کا عام انسانوں کو بھی علم ہوتا ہے، مثلاً کھجور اور انار کے درخت نر بھی ہوتے ہیں اور مادہ بھی، جب پھل لگنے کا موسم ہوتا ہے تو ہوائیں نر درختوں کا بیج اٹھا کر مادہ درختوں پر پھینک دیتی ہیں تو مزید پیدائش عمل میں آتی ہے اور نباتات کی ہر قسم میں نر و مادہ کا سلسلہ موجود ہے، خواہ ابھی تک انسان کو اس کا علم ہوا ہو یا نہ ہو۔ پھر یہ سلسلہ جمادات حتیٰ کہ مادہ کے ایک ذرہ کے اندر بھی پایا جاتا ہے۔ اس میں بھی مثبت اور منفی قوتیں موجود ہیں، جو آپس میں ایک دوسرے کے لیے کشش رکھتی ہیں۔ دوسرے زوج کا لفظ آپس میں مماثلت رکھنے والی چیزوں کے لیے بھی آتا ہے، مثلاً ایک جوتا دوسرے جوتے کے لیے زوج ہوتا ہے اور اس معنی میں بھی یہ لفظ قرآن میں موجود ہے، جیسے فرمایا : « وَ اٰخَرُ مِنْ شَكْلِهٖۤ اَزْوَاجٌ » [ صٓ : ۵۸ ] ’’اور دوسری اس کی ہم شکل کئی (ازواج) قسمیں۔‘‘ اور ازواج کا ایک معنی ایک دوسرے کے مخالف اشیاء، جیسے دن رات کا زوج ہے اور رات دن کا، یا سایہ دھوپ کا اور دھوپ سائے کا، یا روشنی تاریکی کی زوج اور تاریکی روشنی کی، گویا یہ زوج کا سلسلہ اتنا وسیع ہے جو نباتات اور حیوانات کے علاوہ بھی تمام اشیاء میں پایا جاتا ہے، خواہ تمھیں اس کا علم ہو یا نہ ہو سکے۔ فرمایا : « وَ مِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُوْنَ» [ الذاریات : ۴۹ ] ’’اور ہم نے ہر چیز سے دو قسمیں بنائیں، تاکہ تم نصیحت حاصل کرو۔‘‘ ¤ اس آیت کی ابتدا میں اللہ تعالیٰ نے {’’ سُبْحٰنَ الَّذِيْ ‘‘} کا لفظ استعمال فرمایا، جس کا مطلب یہ ہے کہ صرف اللہ تعالیٰ کی ذات ایسی ہے جو ہر قسم کے زوج سے پاک ہے، نہ اس کا کوئی مقابل ہے اور نہ مماثل، کیونکہ مقابلہ یا مماثلت ان چیزوں میں ہو سکتی ہے جو کسی درجہ میں فی الجملہ اشتراک رکھتی ہوں، مگر خالق اور مخلوق کا کسی حقیقت میں اشتراک نہیں ہوتا، اور اس کا دوسرا پہلو یہ ہے کہ دنیا میں شرک کی جتنی بھی اقسام پائی جاتی ہیں ان میں سے ہر قسم میں اللہ تعالیٰ کی ذات میں کسی نہ کسی کمی، کمزوری، عیب یا نقص کا الزام ہوتا ہے، اللہ تعالیٰ نے {’’ سُبْحٰنَ ‘‘} کا لفظ کہہ کر مشرکوں کے ہر قسم کے شرکیہ عقیدے کی تردید فرما دی۔ (کیلانی)"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) { وَ اٰيَةٌ لَّهُمُ الَّيْلُ … : ’’ نَسْلَخُ ‘‘ ’’سَلَخَ يَسْلَخُ‘‘} (ف، ن) بکری کی کھال اتارنا۔ قیامت اور اللہ تعالیٰ کی قدرت کے دلائل میں سے مکانی دلیل مُردہ زمین بیان فرمائی ہے۔ اب زمانی دلیلوں کا ذکر ہوتا ہے کہ ان کے لیے ایک اور دلیل قیامت کی اور اس بات کی بھی کہ اللہ تعالیٰ جو چاہے کر سکتا ہے، رات ہے، جس پر دن کے نور کا پردہ چڑھا ہوا تھا۔ اللہ تعالیٰ نے اپنی عظمت کے اظہار کے لیے اپنا ذکر جمع کے صیغے کے ساتھ کرتے ہوئے فرمایا : « نَسْلَخُ مِنْهُ النَّهَارَ » ہم اس رات سے دن کو کھینچ اتارتے ہیں تو اچانک وہ اندھیرے میں رہ جانے والے ہوتے ہیں۔ یعنی وہ جو اندھیرے کے بعد روشنی اور روشنی کے بعد اندھیرا لانے والا ہے، اس کے لیے تمھیں موت کے بعد زندہ کرنا کیا مشکل ہے؟"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ {وَ الشَّمْسُ تَجْرِيْ لِمُسْتَقَرٍّ لَّهَا … : ’’مُسْتَقَرٌّ‘‘} باب استفعال سے اسم ظرف ہے، قرار کی جگہ یا وقت۔ یہ دوسری دلیل ہے، یعنی سورج کا روزانہ غروب ہونے کے بعد طلوع ہونا موت کے بعد زندگی کی دلیل ہے۔ اس آیت کے دو معنی ہیں اور دونوں معنی ایک وقت میں مراد ہو سکتے ہیں اور یہ قرآن کا اعجاز ہے۔ ایک معنی یہ کہ سورج اپنی اس جگہ چل رہا ہے جو اللہ تعالیٰ نے اس کے لیے مقرر فرما دی ہے اور وہ عرش کے نیچے ہے۔ اس صورت میں {’’ لِمُسْتَقَرٍّ ‘‘} میں ’’لام‘‘ {’’عَلٰي‘‘} یا {’’فِيْ‘‘} کے معنی میں ہو گا، جیسا کہ شاہ عبد القادر رحمہ اللہ نے ترجمہ کیا ہے : ’’اور سورج چلا جاتا ہے اپنے ٹھہرے ہوئے راستے پر۔‘‘ اس معنی کی دلیل ابوذر رضی اللہ عنہ کی یہ حدیث ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے اللہ تعالیٰ کے اس قول {’’ وَ الشَّمْسُ تَجْرِيْ لِمُسْتَقَرٍّ لَّهَا ‘‘} کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ مُسْتَقَرُّهَا تَحْتَ الْعَرْشِ ] [بخاري، التفسیر، سورۃ یٰسٓ، باب قولہ : « و الشمس تجري… » : ۴۸۰۳ ] ’’اس کا مستقر عرش کے نیچے ہے۔‘‘ ¤ دوسرا معنی یہ کہ سورج اپنی اس جگہ یا وقت کی طرف چلا جا رہا ہے جو اس کے ٹھہرنے کے لیے اللہ تعالیٰ نے مقرر فرما دیا ہے، جہاں پہنچنے کے بعد اسے آگے چلنے کے بجائے واپس چلنے کا حکم دیا جائے گا اور وہ مشرق سے طلوع ہونے کے بجائے مغرب سے طلوع ہو گا۔ اس کے چلنے کا یہ راستہ اور ٹھہر جانے کی وہ جگہ اور وہ وقت اس ہستی کا مقرر کردہ ہے جو سب پر غالب، سب کچھ جاننے والی ہے۔ یہ معنی بھی حدیث سے ثابت ہے، جیسا کہ ابوذر رضی اللہ عنہ ہی سے مروی ہے کہ سورج غروب ہوتے وقت رسول اللہ صلی اللہ علیہ وسلم نے ان سے پوچھا : [ أَ تَدْرِيْ أَيْنَ تَذْهَبُ؟ ] ’’کیا تم جانتے ہو یہ کہاں جاتا ہے؟‘‘ میں نے کہا : [ اَللّٰهُ وَ رَسُوْلُهُ أَعْلَمُ ] ’’اللہ اور اس کا رسول ہی بہتر جانتے ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ فَإِنَّهَا تَذْهَبُ حَتّٰی تَسْجُدَ تَحْتَ الْعَرْشِ، فَتَسْتَأْذِنَ فَيُؤْذَنَ لَهَا، وَيُوْشِكُ أَنْ تَسْجُدَ فَلاَ يُقْبَلَ مِنْهَا، وَتَسْتَأْذِنَ فَلاَ يُؤْذَنَ لَهَا، فَيُقَالُ لَهَا ارْجِعِييْ مِنْ حَيْثُ جِئْتِ فَتَطْلُعُ مِنْ مَّغْرِبِهَا، فَذٰلِكَ قَوْلُهُ تَعَالٰی: «وَ الشَّمْسُ تَجْرِيْ لِمُسْتَقَرٍّ لَّهَا ذٰلِكَ تَقْدِيْرُ الْعَزِيْزِ الْعَلِيْمِ» ] [ بخاري، بدء الخلق، باب صفۃ الشمس والقمر : ۳۱۹۹ ] ’’یہ سورج چلتا جاتا ہے، حتیٰ کہ عرش کے نیچے سجدہ کرتا ہے، پھر اجازت مانگتا ہے تو اسے اجازت دی جاتی ہے اور قریب ہے کہ وہ سجدہ کرے تو اس کا سجدہ قبول نہ کیا جائے اور اجازت مانگے تو اسے اجازت نہ دی جائے، پھر وہ اپنے مغرب سے طلوع ہو گا، یہ ہے اللہ تعالیٰ کا فرمان : « وَ الشَّمْسُ تَجْرِيْ لِمُسْتَقَرٍّ لَّهَا ذٰلِكَ تَقْدِيْرُ الْعَزِيْزِ الْعَلِيْمِ » ‘‘ ¤ ➋ اس آیت سے معلوم ہوا کہ سورج چل رہا ہے۔ سائنس دان اس کی دو حرکتیں بیان کرتے ہیں، ایک اس کی اپنے مدار کے گرد حرکت اور دوسری اس حرکت کے ساتھ ساتھ کسی عظیم کہکشاں کے گرد حرکت۔ (واللہ اعلم) ¤ ➌ یہاں ایک سوال پیدا ہوتا ہے کہ یہ حقیقت تو سب کو معلوم ہے کہ سورج ہر وقت چلتا رہتا ہے، اگر کہیں غروب ہوتا ہے تو اس سے اگلی جگہ طلوع ہو رہا ہوتا ہے، تو غروب ہوتے وقت اس کے عرش کے نیچے سجدہ کرنے اور چلنے کی اجازت طلب کرنے کا مطلب کیا ہے؟ جواب اس کا یہ ہے کہ سورج عرش کے نیچے چل رہا ہے اور ہر وقت اور ہر لمحے اللہ تعالیٰ کے سامنے سجدہ ریز ہے اور ہر لمحے اس کا آگے چلنا اللہ تعالیٰ کی اجازت پر موقوف ہے، جب اللہ تعالیٰ کی طرف سے یہ اجازت نہیں ملے گی، وہ ٹھہر جائے گا اور اللہ کے حکم کے مطابق مشرق کے بجائے مغرب سے طلوع ہو گا۔ اس کی دلیل قرآن مجید کی یہ آیت ہے : «اَلَمْ تَرَ اَنَّ اللّٰهَ يَسْجُدُ لَهٗ مَنْ فِي السَّمٰوٰتِ وَ مَنْ فِي الْاَرْضِ وَ الشَّمْسُ وَ الْقَمَرُ وَ النُّجُوْمُ وَ الْجِبَالُ وَ الشَّجَرُ وَ الدَّوَآبُّ وَ كَثِيْرٌ مِّنَ النَّاسِ وَ كَثِيْرٌ حَقَّ عَلَيْهِ الْعَذَابُ وَ  مَنْ يُّهِنِ اللّٰهُ فَمَا لَهٗ مِنْ مُّكْرِمٍ اِنَّ اللّٰهَ يَفْعَلُ مَا يَشَآءُ » [ الحج : ۱۸ ] ’’کیا تو نے نہیں دیکھا کہ اللہ، اسی کے لیے سجدہ کرتے ہیں جو کوئی آسمانوں میں ہیں اور جو زمین میں ہیں اور سورج اور چاند اور ستارے اور پہاڑ اور درخت اور چوپائے اور بہت سے لوگ۔ اور بہت سے وہ ہیں جن پر عذاب ثابت ہوچکا اور جسے اللہ ذلیل کر دے پھر اسے کوئی عزت دینے والا نہیں۔ بے شک اللہ کرتا ہے جو چاہتا ہے۔‘‘ ¤ ➍ سورج کا روزانہ غروب کے بعد دوبارہ طلوع ہونا موت کے بعد زندگی کی واضح دلیل ہے۔ ¤ ➎ سورج اور چاند کی عظیم مخلوقات کے ساتھ اللہ تعالیٰ نے اپنی دو جلال و کمال والی صفات ’’عزيز‘‘ اور ’’عليم‘‘ کا یہاں بھی ذکر فرمایا ہے اور سورۂ انعام (۹۶) اور سورۂ حٰم السجدہ (۱۲) میں بھی۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) ➊ {وَ الْقَمَرَ قَدَّرْنٰهُ مَنَازِلَ حَتّٰى عَادَ كَالْعُرْجُوْنِ الْقَدِيْمِ: ’’اَلْعُرْجُوْنَ‘‘} بروزن {’’فُعْلُوْنَ‘‘} جمع {’’عَرَاجِيْنُ‘‘} یہ {’’اَلْعِرَاجُ‘‘} سے مشتق ہے، جس کا معنی ٹیڑھا ہونا ہے۔ کھجور کے گچھے کی وہ ٹیڑھی میڑھی ڈنڈیاں جن کے ساتھ کھجوریں لگی ہوتی ہیں۔ ¤ ➋ یہ تیسری دلیل ہے، سورج کی طرح چاند ہمیشہ ایک شکل کا نہیں رہتا، بلکہ روزانہ گھٹتا بڑھتا ہے۔ اللہ تعالیٰ نے اس کی اٹھائیس منزلیں مقرر فرمائیں جن میں وہ نظر آتا ہے۔ پھر ایک دن یا دو دن غائب رہ کر دوبارہ طلوع ہو جاتا ہے۔ پہلی رات وہ پتلی ٹیڑھی سی لکیر کی طرح ہوتا ہے جس کی روشنی بھی مدھم ہوتی ہے، پھر وہ بڑھتا ہوا چودھویں رات کو پورا روشن ہو جاتا ہے، پھر گھٹتا ہوا اٹھائیسویں رات کو دوبارہ اس حالت میں پلٹ جاتا ہے جسے اللہ تعالیٰ نے کھجور کی پرانی ٹیڑھی بے رونق ڈنڈی کے ساتھ تشبیہ دی ہے۔ لاکھوں برس سے چاند کا گھٹنا بڑھنا اور طلوع و غروب اسی طرح جاری ہے۔ اتنے زبردست غلبے اور کامل علم والے کے لیے انسان کو دوبارہ زندہ کرنا کیا مشکل ہے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ { لَا الشَّمْسُ يَنْۢبَغِيْ لَهَاۤ اَنْ تُدْرِكَ الْقَمَرَ:} یہ چوتھی دلیل ہے، یعنی چاند کی روشنی کے ظہور کا وقت رات ہے، یہ نہیں ہو سکتا کہ رات کو جب چاند چمک رہا ہو تو اچانک سورج طلوع ہو جائے۔ ¤ ➋ { وَ لَا الَّيْلُ سَابِقُ النَّهَارِ:} اور نہ یہ ہو سکتا ہے کہ ابھی دن کا وقت باقی ہو اور یکایک رات چھا جائے۔ ¤ ➌ { وَ كُلٌّ فِيْ فَلَكٍ يَّسْبَحُوْنَ : ’’سَبَحَ يَسْبَحُ‘‘} (ف) کا معنی تیرنا ہے۔ یعنی کیا سورج، کیا چاند اور کیا ستارے (جن میں زمین بھی شامل ہے) ہر ایک کا اپنا اپنا فلک (مدار) ہے، جس میں وہ تیر رہا ہے اور اللہ تعالیٰ نے اربوں ستاروں میں سے ہر ایک کا مدار دوسرے سے الگ بنایا ہے اور ایسا نظام قائم کیا ہے کہ کوئی ستارہ دوسرے کے مدار میں آکر اس سے ٹکراتا نہیں، بلکہ باقاعدگی سے اپنے مدار میں گھوم رہا ہے اور یہ نظام قیامت تک چلتا رہے گا۔ یقینا یہ اللہ تعالیٰ کی بہت بڑی نشانی ہے۔ ¤ ➍ ان آیات کا اصل مقصد علم ہیئت کے حقائق بیان کرنا نہیں، بلکہ انسان کو یہ سمجھانا مقصود ہے کہ اگر وہ آنکھیں کھول کر دیکھے اور عقل سے کام لے تو زمین سے لے کر آسمان تک جدھر بھی وہ نگاہ ڈالے گا اس کے سامنے اللہ تعالیٰ کی ہستی اور اس کی یکتائی کے بے حد و حساب دلائل آئیں گے اور کہیں کوئی ایک دلیل بھی دہریت اور شرک کے ثبوت میں نہ ملے گی۔ ہماری یہ زمین جس میں نظام شمسی بھی شامل ہے، اس کی عظمت کا یہ حال ہے کہ اس کا مرکز سورج زمین سے تین لاکھ گنا بڑا ہے اور اس کے بعید ترین سیارے نیپچون کا فاصلہ سورج سے کم از کم ۲ ارب ۷۹ کروڑ ۳۰ لاکھ میل ہے۔ بلکہ اگر پلوٹو کو بعید ترین سیارہ مانا جائے تو وہ سورج سے ۴ ارب ۶۰ کروڑ میل دور تک پہنچ جاتا ہے۔ اس عظمت کے باوجود یہ نظام شمسی ایک بہت بڑے کہکشاں کا محض ایک چھوٹا سے حصہ ہے۔ جس کہکشاں میں ہمارا یہ نظام شمسی شامل ہے اس میں تقریباً تین ہزار ملین (۳ ارب) آفتاب پائے جاتے ہیں اور اس کا قریب ترین آفتاب ہماری زمین سے اس قدر دور ہے کہ اس کی روشنی یہاں تک پہنچنے میں ۴ سال صرف ہوتے ہیں۔ پھر یہ کہکشاں بھی پوری کائنات نہیں ہے، بلکہ اب تک کے مشاہدات کی بنا پر اندازہ کیا گیا ہے کہ یہ تقریباً بیس لاکھ لولبی سحابیوں میں سے ایک ہے اور ان میں سے قریب ترین سحابیے کا فاصلہ ہم سے اس قدر زیادہ ہے کہ اس کی روشنی دس لاکھ سال میں ہماری زمین تک پہنچتی ہے۔ رہے بعید ترین اجرام فلکی، جو ہمارے موجودہ آلات سے نظر آتے ہیں، ان کی روشنی تو زمین تک پہنچنے میں دس کروڑ سال لگ جاتے ہیں۔ اس پر بھی یہ نہیں کہا جا سکتا کہ انسان نے ساری کائنات دیکھ لی ہے۔ (تفہیم القرآن) حقیقت یہ ہے کہ اللہ تعالیٰ کی سلطنت ہیئت دانوں کے ان اندازوں بلکہ انسان کے خیال سے بے حدو حساب وسیع ہے۔ یہ ایک معمولی جھلک ہے جو انھیں دکھائی دی ہے۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ { وَ اٰيَةٌ لَّهُمْ اَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ … : ’’ذُرِّيَّةٌ‘‘} کا لفظی معنی اولاد ہے۔ {’’ ذُرِّيَّتَهُمْ ‘‘} میں ضمیر {’’هُمْ‘‘} سے مراد انسان ہیں۔ {’’ الْمَشْحُوْنِ ‘‘} بھری ہوئی، مراد اس سے نوح علیہ السلام کی کشتی ہے۔ یعنی ایک اور نشانی ان کے لیے یہ ہے کہ ہم نے نسل انسان کو بھری ہوئی کشتی میں سوار کیا اور وہ پانی جو لوہے کی سوئی اور لکڑی کے ایک ڈنڈے تک کو نہیں اٹھاتا، بلکہ غرق کر دیتا ہے، اسی پانی نے ہمارے سکھانے کے مطابق لوہے یا لکڑی سے بنی ہوئی کشتی کو اٹھا لیا، جو آدمیوں سے اور ہر جانور کے ایک ایک جوڑے اور ان کی ضرورت کی اشیاء سے خوب بھری ہوئی تھی۔ ¤ ➋ یہاں ایک سوال ہے کہ کشتی میں اولاد ہی نہیں ان کے باپ بھی سوار ہوتے ہیں، پھر اللہ تعالیٰ نے یہ جو فرمایا کہ ’’ہم نے ان کی نسل (یا اولاد) کو بھری ہوئی کشتی میں سوار کیا‘‘ یہ کیوں نہ فرما دیا کہ ’’ہم نے ان کو بھری ہوئی کشتی میں سوار کیا؟‘‘ جواب اس کا یہ ہے کہ نوح علیہ السلام سے پہلے آباء کو کشتی بنانے کا طریقہ معلوم نہ تھا، نہ وہ سمندر میں سفر کر سکتے تھے۔ آدم علیہ السلام کے بعد ان کی اولاد، جسے باقی رکھنا منظور تھا، ساری کی ساری اس کشتی میں سوار تھی اور طوفان کے بعد وہی زمین پر باقی رہی، باقی سب غرق ہو گئی، جیسا کہ اللہ تعالیٰ نے نوح علیہ السلام کے متعلق فرمایا : « وَ جَعَلْنَا ذُرِّيَّتَهٗ هُمُ الْبٰقِيْنَ » [الصافات : ۷۷ ] ’’اور ہم نے اس کی اولاد ہی کو باقی رہنے والے بنا دیا۔‘‘ اس لیے یہاں {’’ اَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِي الْفُلْكِ الْمَشْحُوْنِ‘‘} فرمایا۔ (نظم الدرر) دوسری جگہ اسی کشتی کا ذکر ان الفاظ میں ہے : « اِنَّا لَمَّا طَغَا الْمَآءُ حَمَلْنٰكُمْ فِي الْجَارِيَةِ (11) لِنَجْعَلَهَا لَكُمْ تَذْكِرَةً وَّ تَعِيَهَاۤ اُذُنٌ وَّاعِيَةٌ » [ الحآقۃ : ۱۱، ۱۲ ] ’’بلاشبہ ہم نے ہی جب پانی حد سے تجاوز کر گیا، تمھیں کشتی میں سوار کیا، تا کہ ہم اسے تمھارے لیے ایک یاد دہانی بنا دیں اور یاد رکھنے والا کان اسے یاد رکھے۔‘‘"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) { وَ خَلَقْنَا لَهُمْ مِّنْ مِّثْلِهٖ مَا يَرْكَبُوْنَ :} اس سے معلوم ہوا کہ اس سے پہلے انسان کو کشتی بنانے کا علم نہ تھا۔ نوح علیہ السلام کی بنائی ہوئی کشتی کے ذریعے سے طوفان سے بچ نکلنے والوں نے بحری سفر کے لیے کشتیاں بنانے کا سلسلہ شروع کر دیا جو عام کشتیوں سے باد بانی جہازوں تک پہنچا، پھر انجن والے جہاز ایجاد ہوئے، جن کا سلسلہ ایٹمی ایندھن سے چلنے والے طیارہ بردار جہازوں اور آبدوزوں تک جا پہنچا ہے۔ آگے دیکھیے کیا کچھ ایجاد ہوتا ہے۔ بعض مفسرین نے اس آیت سے مراد یہ لیا ہے کہ ہم نے ان کے لیے کشتی کی طرح اور سواریاں بھی پیدا کی ہیں، مثلاً اونٹ جو صحرا کا جہاز کہلاتا ہے، اسی طرح موٹر، ریل اور ہوائی جہاز وغیرہ ۔ اگرچہ یہ معنی بھی ہو سکتا ہے، مگر اگلی آیت میں غرق کے ذکر کی وجہ سے {’’ مِنْ مِّثْلِهٖ ‘‘} سے مراد ایسی سواریاں لینا بہتر ہے جو سمندری سفر میں کام آتی ہیں، جن میں ہوائی جہاز بھی شامل ہیں۔ نو ایجاد سواریوں کا پیشگی ذکر سورۂ نحل (۸) میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) {وَ اِنْ نَّشَاْ نُغْرِقْهُمْ فَلَا صَرِيْخَ لَهُمْ … :} یعنی یہ ہمارا احسان ہے کہ ہم نے پانی میں بحری جہاز اٹھانے کی خوبی رکھی اور انسان کو کشتیاں اور جہاز بنانے کا سلیقہ سکھایا، پھر ہمارا ہی احسان ہے کہ ہم انھیں سلامتی کے ساتھ منزل پر پہنچا دیتے ہیں۔ اگر ہم چاہیں تو انھیں غرق کر دیں، پھر نہ کوئی ان کی مدد کو پہنچ سکتا ہے اور نہ وہ خود اپنے آپ کو غرق ہونے سے بچا سکتے ہیں۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) {اِلَّا رَحْمَةً مِّنَّا وَ مَتَاعًا اِلٰى حِيْنٍ :} یہ بس ہماری رحمت اور زندگی کی مقررہ مدت تک مہلت دینے ہی کا نتیجہ ہے کہ ہم سمندر اور ہواؤں کی سرکش اور بے پناہ قوتوں کو اپنے کنٹرول میں رکھتے ہیں، جس سے مسافر اور تاجر صحیح سلامت دوسرے کنارے پر جا اترتے ہیں۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) {وَ اِذَا قِيْلَ لَهُمُ اتَّقُوْا مَا بَيْنَ اَيْدِيْكُمْ … :} کائنات میں پھیلی ہوئی توحید اور آخرت کی نشانیوں اور دلیلوں کے ذکر کے بعد، جن سے مشرکین نے آنکھیں بند کر رکھی ہیں، اب نصیحت کرنے والوں کے ساتھ ان کے سلوک کا ذکر فرمایا۔ جس کا خلاصہ یہ ہے کہ انھوں نے خیر خواہی کی ہر بات سے بھی کان بند کر رکھے ہیں۔ {’’ مَا بَيْنَ اَيْدِيْكُمْ ‘‘} سے مراد پہلے گناہ اور {’’ وَ مَا خَلْفَكُمْ ‘‘} سے مراد بعد کے گناہ ہیں، یا {’’ مَا بَيْنَ اَيْدِيْكُمْ ‘‘} سے مراد دنیا کا عذاب اور {’’ وَ مَا خَلْفَكُمْ ‘‘} سے مراد آخرت کا عذاب ہے۔ یعنی جب ان سے ان گناہوں سے بچنے کے لیے کہا جاتا ہے جو وہ کر چکے ہیں کہ ان پر نادم ہو جاؤ، ان سے توبہ کر لو اور آئندہ کے لیے ان سے بچ جاؤ، یا جب ان سے کہا جاتا ہے کہ اس عذاب سے بچ جاؤ جو تمھارے گناہوں کی پاداش میں تم پر دنیا میں آ سکتا ہے اور اس سے بھی جو آخرت میں آ رہا ہے، تا کہ تم پر رحم کیا جائے۔ اس جملے کا جواب یہ ہے {’’أَعْرَضُوْا عَنْهُ‘‘} یعنی وہ اس نصیحت سے منہ پھیر لیتے ہیں، مگر یہاں یہ جواب حذف کر دیا گیا ہے، کیونکہ یہ اگلی آیت سے خود بخود معلوم ہو رہا ہے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) {وَ مَا تَاْتِيْهِمْ مِّنْ اٰيَةٍ …:} یعنی صرف اس نصیحت ہی سے نہیں، ان کے پاس ان کے رب کی آیات میں سے جو آیت بھی آتی ہے وہ اس سے منہ پھیر لیتے ہیں، خواہ وہ ان کی ذات یا پوری کائنات میں پھیلی ہوئی آیات اور نشانیاں ہوں اور خواہ اللہ تعالیٰ کی نازل کردہ آیات ہوں۔ چنانچہ وہ نہ اس کی توحید کو مانتے ہیں اور نہ اس کے رسولوں پر ایمان لاتے ہیں۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {وَ اِذَا قِيْلَ لَهُمْ اَنْفِقُوْا مِمَّا رَزَقَكُمُ اللّٰهُ … :} یعنی جب ان سے کہا جاتا ہے کہ اللہ تعالیٰ نے تمھیں جو کچھ دیا ہے، اس میں فقراء اور مساکین کے جو حقوق ہیں وہ بھی ادا کرو، تو جواب یہ دیتے ہیں کہ اگر اللہ تعالیٰ کا ارادہ ہوتا تو وہ ان فقراء و مساکین کو خود ہی دے دیتا۔ جب اللہ تعالیٰ ہی کا ارادہ انھیں دینے کا نہیں تو ہم انھیں کیوں دیں؟ تم مسلمان تو صاف گمراہی میں پڑے ہوئے ہو کہ ایسے لوگوں کا پیٹ بھرنا چاہتے ہو جن کا پیٹ اللہ نہیں بھرنا چاہتا۔ ¤ ➋ مشرکین کی یہ بات محض کٹ حجتی ہے، کیونکہ وہ خود بھی خوب جانتے تھے کہ غریبوں کی مدد کرنا بہت اچھا کام ہے۔ رہا اللہ کے چاہنے کا بہانہ، تو یہ محض اپنی بخیلی چھپانے کے لیے ہے، ورنہ اللہ تعالیٰ نے یہ دنیا امتحان ہی کے لیے بنائی ہے، فقیری اور امیری دونوں آزمائشیں ہیں، فقیر کی آزمائش صبر سے ہے اور غنی کی اللہ تعالیٰ کے راستے میں خرچ کرنے سے۔ یہ لوگ اللہ تعالیٰ کی مشیّت یعنی اس کے چاہنے کا سہارا صرف اس وقت تک لیتے ہیں جب تک خود مجرم ہوں۔ جب کوئی دوسرا مجرم ہو اور ان کی حق تلفی ہو رہی ہو تو کبھی اللہ کی مشیّت کا سہارا نہیں لیں گے۔ مثلاً اگر کوئی ڈاکو ان کا مال چھین لے، یا ان کا آدمی قتل کر دے تو کبھی یہ کہہ کر خاموش نہیں ہوں گے کہ اللہ نے ایسے ہی چاہا، اس لیے ٹھیک ہو گیا۔ ¤ ➌ اس سے معلوم ہوا کہ رسول اللہ صلی اللہ علیہ وسلم کفار و مشرکین کو صرف توحید و رسالت ہی کی دعوت نہیں دیتے تھے، بلکہ نماز، زکوٰۃ اور دوسری نیکیوں کا حکم بھی دیتے تھے، جیسا کہ حدیثِ ہرقل میں ہے کہ ہرقل نے ابوسفیان سے رسول اللہ صلی اللہ علیہ وسلم کے متعلق پوچھا : ’’وہ تمھیں کس بات کا حکم دیتے ہیں؟‘‘ تو ابوسفیان نے بتایا : [ يَأْمُرُنَا بِالصَّلَاةِ وَالزَّكَاةِ وَالصِّلَةِ وَالْعَفَافِ ] ’’وہ ہمیں نماز، زکوٰۃ، صلہ رحمی اور پاک دامنی کا حکم دیتے ہیں۔‘‘ [ بخاري، التفسیر، باب : «قل یا أھل الکتاب تعالوا… » : ۴۵۵۳ ]"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ { وَ يَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ …:} کفار چونکہ قیامت کو نہیں مانتے تھے، اس لیے وہ نبی صلی اللہ علیہ وسلم اور مسلمانوں سے کہا کرتے تھے کہ پھر تم قیامت لاتے کیوں نہیں؟ اچھا، یہ بتاؤ کہ وہ کب آئے گی؟ اس سے ان کا مقصود تاریخ معلوم ہونے پر اس کی تیاری نہ تھا، بلکہ محض جھٹلانا اور مذاق اڑانا تھا کہ جب وہ فوراً قیامت نہ لا سکیں گے تو ہم کہیں گے قیامت وغیرہ کچھ نہیں۔ ¤ ➋ { اِنْ كُنْتُمْ صٰدِقِيْنَ :} یہ الفاظ ابھارنے کے لیے اور جھوٹا ثابت کرنے میں زور پیدا کرنے کے لیے ہیں۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { مَا يَنْظُرُوْنَ اِلَّا صَيْحَةً وَّاحِدَةً … :} ان کے جواب میں یہ نہیں کہا گیا کہ قیامت فلاں وقت آئے گی، بلکہ ان کے سامنے قیامت کے چند ہولناک مناظر کا نقشہ پیش کر دیا گیا ہے۔ ¤ ➋ {اِلَّا صَيْحَةً وَّاحِدَةً :} ایک ہی چیخ سے مراد اسرافیل علیہ السلام کا پہلی دفعہ صور میں پھونکنا ہے، جس سے تمام مخلوق مر جائے گی۔ اللہ تعالیٰ نے فرمایا، یہ لوگ جس قیامت کا انتظار کر رہے ہیں اس کے لیے ہمیں کسی لمبی چوڑی تیاری کی ضرورت نہیں، صرف ایک مرتبہ صور میں پھونک دیا جائے گا، جس کی چیخ کی آواز سے سب لوگ بے ہوش ہو کر مر جائیں گے۔ ¤ ➌ {تَاْخُذُهُمْ وَ هُمْ يَخِصِّمُوْنَ : ’’ يَخِصِّمُوْنَ ‘‘} اصل میں {’’ يَخْتَصِمُوْنَ‘‘} (افتعال) ہے۔ تاء کو صاد کے ساتھ بدل کر صاد میں ادغام کر دیا اور صاد کی موافقت کے لیے خاء کو بھی کسرہ دے دیا۔ ادغام سے ان کے جھگڑنے کی شدت بیان کرنا مقصود ہے۔ یعنی وہ قیامت آہستہ آہستہ نہیں آئے گی، جسے دیکھ کر وہ کچھ سنبھل جائیں، بلکہ سب لوگ اپنے اپنے کاموں میں مشغول ہوں گے اور پورے زور و شور سے ایک دوسرے سے جھگڑا اور بحث کر رہے ہوں گے کہ اچانک ایک چیخ سے قیامت برپا ہو جائے گی۔ ابوہریرہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بیان کرتے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا : [ تَقُوْمُ السَّاعَةُ وَالرَّجُلُ يَحْلُبُ اللِّقْحَةَ فَمَا يَصِلُ الْإِنَاءُ إِلٰی فِيْهِ حَتّٰی تَقُوْمَ وَ الرَّجُلَانِ يَتَبَايَعَانِ الثَّوْبَ فَمَا يَتَبَايَعَانِهِ حَتّٰی تَقُوْمَ وَالرَّجُلُ يَلِطُ فِيْ حَوْضِهِ فَمَا يَصْدُرُ حَتّٰی تَقُوْمَ ] [مسلم، الفتن، باب قرب الساعۃ : ۲۹۵۴ ] ’’قیامت (اتنی اچانک) قائم ہو گی کہ آدمی اونٹنی کا دودھ دوہ رہا ہو گا، پھر برتن اس کے منہ تک نہیں پہنچے گا یہاں تک کہ وہ قائم ہو جائے گی اور دو آدمی کپڑے کی خریدو فروخت کر رہے ہوں گے، تو ابھی سوداکر نہیں پائیں گے کہ وہ قائم ہو جائے گی اور آدمی اپنے حوض کی لپائی کر رہا ہو گا، ابھی واپس نہیں ہو گا کہ وہ قائم ہو جائے گی۔‘‘"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) {فَلَا يَسْتَطِيْعُوْنَ۠ تَوْصِيَةً … : ’’ تَوْصِيَةً ‘‘ ’’وَصّٰي يُوَصِّيْ‘‘} (تفعیل) کا مصدر ہے، وصیت کرنا۔ یعنی اس چیخ کے بعد انھیں اتنی مہلت نہیں ملے گی کہ وہ کچھ وصیت کر سکیں، یا جو باہر ہیں وہ اپنے گھر واپس جا سکیں، بلکہ جو کوئی جہاں موجود ہو گا وہیں دھر لیا جائے گا۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) {وَ نُفِخَ فِي الصُّوْرِ فَاِذَا هُمْ مِّنَ الْاَجْدَاثِ : ’’ الْاَجْدَاثِ ‘‘ ’’جَدَثٌ‘‘} کی جمع ہے، جیسے {’’فَرَسٌ‘‘} کی جمع {’’أَفْرَاسٌ‘‘} ہے۔{ ’’يَنْسِلُوْنَ ‘‘ ’’نَسَلَ‘‘} (ن، ض) {نَسْلاً، نَسَلًا وَ نَسَلَانًا فِيْ مَشْيِهِ‘‘} دوڑنا۔ ¤ یعنی صور میں دوسری دفعہ پھونکا جائے گا تو اچانک سب لوگ اپنی قبروں سے نکل کر اپنے رب کی طرف دوڑ رہے ہوں گے۔ (دیکھیے قمر : ۶ تا ۸۔ معارج : ۴۳ ) صور میں کتنی دفعہ پھونکا جائے گا اور دو دفعہ پھوکنے کے درمیان کتنا عرصہ ہو گا، اس تفصیل کے لیے سورۂ نمل کی آیت (۸۷) کی تفسیر ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ { قَالُوْا يٰوَيْلَنَا مَنْۢ بَعَثَنَا مِنْ مَّرْقَدِنَا :} یعنی اس وقت انھیں یہ احساس نہیں ہو گا کہ وہ مر چکے تھے اور اب زندہ کیے گئے ہیں، بلکہ سمجھیں گے کہ ہم سوئے ہوئے تھے اور کسی نے ہمیں جگا دیا ہے۔ گزری ہوئی لمبی مدت انھیں ایک لمحہ معلوم ہو گی۔ مزید دیکھیے سورۂ بنی اسرائیل (۵۲) اور روم (۵۵)۔ ¤ ➋ { هٰذَا مَا وَعَدَ الرَّحْمٰنُ وَ صَدَقَ الْمُرْسَلُوْنَ :} یہاں یہ ذکر نہیں کہ یہ بات کون کہے گا، عین ممکن ہے کہ خود ہی ان کی سمجھ میں آ جائے کہ یہ تو وہی قیامت ہے جو رسول ہمیں بتایا کرتے تھے اور ہم اسے جھٹلاتے تھے، اور یہ بھی ہو سکتا ہے کہ مومن یا فرشتے انھیں یہ بات کہیں۔ یہ بھی ہو سکتا ہے کہ اللہ تعالیٰ مستقبل کو حاضر قرار دے کر اب یہ جواب دے رہے ہوں۔ ¤ ➌ یہاں لفظ {’’ الرَّحْمٰنُ ‘‘} صرف اس کا وعدہ یاد دلانے کے لیے نہیں، بلکہ یہ بتانے کے لیے ہے کہ اس خوف ناک دن میں اللہ تعالیٰ کی رحمت کے ننانوے حصوں کے وہ جلوے نظر آئیں گے جو کسی کے وہم و گمان میں بھی نہیں آ سکتے، جییسا کہ فرمایا : «اَلْمُلْكُ يَوْمَىِٕذٍ الْحَقُّ لِلرَّحْمٰنِ » [ الفرقان : ۲۶ ] ’’اس دن حقیقی بادشاہی رحمان کی ہو گی۔‘‘ اور فرمایا : « وَ خَشَعَتِ الْاَصْوَاتُ لِلرَّحْمٰنِ » [ طٰہٰ : ۱۰۸ ] ’’اور سب آوازیں رحمان کے لیے پست ہو جائیں گی۔‘‘"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) {اِنْ كَانَتْ اِلَّا صَيْحَةً وَّاحِدَةً … :} مراد صور میں دوسری دفعہ کی پھونک ہے، جس سے لمحہ بھر میں قیامت برپا ہو جائے گی۔ دیکھیے سورۂ نحل (۷۷) اور نازعات (۱۳، ۱۴)۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) {فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْـًٔا … :} یعنی اس وقت اعلان ہو گا کہ آج کسی جان پر کچھ بھی ظلم نہیں کیا جائے گا، نہ یہ کہ ان کی نیکیوں میں کوئی کمی کی جائے اور نہ یہ کہ وہ گناہ اس کے ذمے ڈال دیے جائیں جو اس نے نہیں کیے، بلکہ صرف انھی اعمال کی جزا ملے گی جو وہ کرتے رہے تھے۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) { اِنَّ اَصْحٰبَ الْجَنَّةِ الْيَوْمَ … :} یہ ذکر کرنے کے بعد کہ ہر ایک کو اس کے عمل ہی کی جزا ملے گی، پہلے اہلِ جنت کی جزا ذکر فرمائی کہ آج کے دن وہ ایک عظیم مشغولیت میں خوش ہوں گے۔ {’’ شُغُلٍ ‘‘} کا معنی ایسا کام ہے جو انسان کو دوسرے کاموں سے روک دے۔ اس میں تنوین تعظیم کی ہے، مراد یہ ہے کہ وہ اپنی بیویوں سے اور جنت کی دوسری نعمتوں سے لذت اٹھانے میں ایسے مگن ہوں گے کہ انھیں کسی اور چیز کا خیال تک نہیں آئے گا، کیونکہ جنت کی وہ نعمتیں ایسی ہوں گی جو انسان کے وہم و گمان سے بھی بالا ہیں۔ دیکھیے سورۂ سجدہ (۱۷) {’’ الْيَوْمَ ‘‘} (آج) کے لفظ سے معلوم ہوا کہ اہلِ جنت جلد ہی جنت میں چلے جائیں گے۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) {هُمْ وَ اَزْوَاجُهُمْ فِيْ ظِلٰلٍ … :} جنت کے سایوں کے لیے دیکھیے سورۂ نساء کی آیت (۵۷)۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) {لَهُمْ فِيْهَا فَاكِهَةٌ وَّ لَهُمْ مَّا يَدَّعُوْنَ : ’’ فَاكِهَةٌ ‘‘} میں تنوین تکثیر کے لیے ہے، یعنی ان کے لیے جنت میں بہت سے پھل ہوں گے اور انھیں ہر وہ چیز ملے گی جس کی وہ تمنا کریں گے اور مانگیں گے۔ یہ تو جسمانی لذتوں کا حال ہو گا، روحانی لذتوں میں سب سے اونچی لذت کا ذکر اگلی آیت میں فرمایا۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) {سَلٰمٌ قَوْلًا مِّنْ رَّبٍّ رَّحِيْمٍ:} یعنی اس بے حد مہربان رب کی طرف سے جنتیوں کو سلام کہا جائے گا۔ دوسری آیات میں ہے کہ انھیں اللہ تعالیٰ کا دیدار بھی ہو گا۔ رب رحیم کے دیدار اور اس کی طرف سے سلام کے بعد انھیں ہر لحاظ سے سلامتی حاصل ہو گی اور ایسا تحفہ اور ایسی نعمت ملے گی جس سے بڑا تحفہ اور بڑی نعمت کوئی نہیں، کیونکہ اس سے انھیں اس کی ابدی رضا حاصل ہو جائے گی، جس کے بعد وہ کبھی ان پر ناراض نہیں ہو گا۔ دیکھیے سورۂ توبہ (۷۲) اور سورۂ یونس (۲۶)۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) {وَ امْتَازُوا الْيَوْمَ اَيُّهَا الْمُجْرِمُوْنَ :} جنتیوں کی ہر لحاظ سے تکریم اور رب رحیم کی طرف سے سلام کے ذکر کے بعد بتایا کہ جہنمیوں سے کیا کہا جائے گا، یعنی ان سے کہا جائے گا کہ اے مجرمو! تم جنتیوں سے الگ ہو جاؤ۔ دنیا میں بے شک تم اکٹھے رہے، مگر آج تمھارا ان سے کوئی تعلق نہیں رہا۔ چنانچہ یہود و نصاریٰ، مجوس اور مشرکین سب الگ ہو جائیں گے (دیکھیے یونس: ۲۸۔ روم : ۱۴ تا ۱۶) اور جو جس کی پرستش کرتا تھا اس کے پیچھے چلا جائے گا، صرف موحد باقی رہ جائیں گے۔ دیکھیے سورۂ قلم کی آیت (۴۲) « يَوْمَ يُكْشَفُ عَنْ سَاقٍ » کی تفسیر۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) {اَلَمْ اَعْهَدْ اِلَيْكُمْ يٰبَنِيْۤ اٰدَمَ …:’’عَهِدَ إِلَيْهِ‘‘} کا معنی ہے اس کو وصیت کی۔ آلوسی نے فرمایا، اس تاکیدی نصیحت سے مراد اللہ تعالیٰ کے وہ اوامر و نواہی ہیں جو اس نے اپنے رسولوں کی معرفت بنی آدم کے لیے بھیجے، جن میں سے اللہ تعالیٰ کا یہ فرمان بھی ہے : « يٰبَنِيْۤ اٰدَمَ لَا يَفْتِنَنَّكُمُ الشَّيْطٰنُ كَمَاۤ اَخْرَجَ اَبَوَيْكُمْ مِّنَ الْجَنَّةِ يَنْزِعُ عَنْهُمَا لِبَاسَهُممَا لِيُرِيَهُمَا سَوْاٰتِهِمَا اِنَّهٗ يَرٰىكُمْ هُوَ وَ قَبِيْلُهٗ مِنْ حَيْثُ لَا تَرَوْنَهُمْ اِنَّا جَعَلْنَا الشَّيٰطِيْنَ اَووْلِيَآءَ لِلَّذِيْنَ لَا يُؤْمِنُوْنَ » [ الأعراف : ۲۷ ] ’’اے آدم کی اولاد! کہیں شیطان تمھیں فتنے میں نہ ڈال دے، جس طرح اس نے تمھارے ماں باپ کو جنت سے نکال دیا، وہ دونوں سے ان کے لباس اتارتا تھا، تاکہ دونوں کو ان کی شرم گاہیں دکھائے، بے شک وہ اور اس کا قبیلہ تمھیں وہاں سے دیکھتے ہیں جہاں سے تم انھیں نہیں دیکھتے۔ بے شک ہم نے شیطانوں کو ان لوگوں کے دوست بنایا ہے جو ایمان نہیں رکھتے۔‘‘ بعض نے کہا، مراد وہ عہد ہے جو {’’ اَلَسْتُ بِرَبِّكُمْ ‘‘} میں مذکور ہے، (دیکھیے سورۂ اعراف : ۱۷۲ کی تفسیر) یا وہ عقلی دلائل ہیں جو اللہ تعالیٰ نے انسان کے لیے کائنات میں رکھے ہیں۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) {وَ اَنِ اعْبُدُوْنِيْ هٰذَا صِرَاطٌ مُّسْتَقِيْمٌ: ’’ اَنْ لَّا تَعْبُدُوا الشَّيْطٰنَ ‘‘} میں اور{ ’’ اَنِ اعْبُدُوْنِيْ ‘‘} میں {’’ اِنْ ‘‘‘} تفسیر یہ ہے اور یہ سب اسی تاکیدی نصیحت کی تفسیر ہے۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) {اَفَلَمْ تَكُوْنُوْا تَعْقِلُوْنَ :} یعنی کیا تم اتنی عقل نہ رکھتے تھے کہ جب شیطان تمھارا دشمن تھا تو تم اس کے بتائے ہوئے راستے پر نہ چلتے؟"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 64،63) {هٰذِهٖ جَهَنَّمُ الَّتِيْ كُنْتُمْ تُوْعَدُوْنَ …: ’’ اِصْلَوْهَا ‘‘ ’’صَلِيَ يَصصْلٰي } (ع) {النَّارَ‘‘} کا اصل معنی آگ سینکنا ہے۔ انھیں یہ بات بطور طنز و استہزا کہی جائے گی۔ (التحریر) اور اس حکم کے ساتھ ہی انھیں دھکیل کر جہنم میں پھینک دیا جائے گا۔ سورۂ طور میں فرمایا : «يَوْمَ يُدَعُّوْنَ اِلٰى نَارِ جَهَنَّمَ دَعًّا (13) هٰذِهِ النَّارُ الَّتِيْ كُنْتُمْ بِهَا تُكَذِّبُوْنَ » [ الطور : ۱۳، ۱۴ ]’’جس دن انھیں جہنم کی آگ کی طرف دھکیلا جائے گا، سخت دھکیلا جانا۔ یہی ہے وہ آگ جسے تم جھٹلاتے تھے۔‘‘"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64،63) {هٰذِهٖ جَهَنَّمُ الَّتِيْ كُنْتُمْ تُوْعَدُوْنَ …: ’’ اِصْلَوْهَا ‘‘ ’’صَلِيَ يَصصْلٰي } (ع) {النَّارَ‘‘} کا اصل معنی آگ سینکنا ہے۔ انھیں یہ بات بطور طنز و استہزا کہی جائے گی۔ (التحریر) اور اس حکم کے ساتھ ہی انھیں دھکیل کر جہنم میں پھینک دیا جائے گا۔ سورۂ طور میں فرمایا : «يَوْمَ يُدَعُّوْنَ اِلٰى نَارِ جَهَنَّمَ دَعًّا (13) هٰذِهِ النَّارُ الَّتِيْ كُنْتُمْ بِهَا تُكَذِّبُوْنَ » [ الطور : ۱۳، ۱۴ ]’’جس دن انھیں جہنم کی آگ کی طرف دھکیلا جائے گا، سخت دھکیلا جانا۔ یہی ہے وہ آگ جسے تم جھٹلاتے تھے۔‘‘"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) ➊ {اَلْيَوْمَ نَخْتِمُ عَلٰۤى اَفْوَاهِهِمْ … :} مونہوں پر مہر لگانے کی وجہ یہ ہو گی کہ بعض مجرم قیامت کے دن اپنے جرم کا اقرار کرنے سے انکار کر دیں گے اور کہیں گے کہ ہم نے کوئی جرم کیا ہی نہیں، وہ گواہوں کو جھٹلا دیں گے اور نامہ اعمال کو بھی درست نہیں مانیں گے، بلکہ اپنے بے گناہ ہونے کی قسمیں کھائیں گے، جیسا کہ فرمایا : « ثُمَّ لَمْ تَكُنْ فِتْنَتُهُمْ اِلَّاۤ اَنْ قَالُوْا وَ اللّٰهِ رَبِّنَا مَا كُنَّا مُشْرِكِيْنَ» [ الأنعام : ۲۳ ] ’’پھر ان کا فریب اس کے سوا کچھ نہ ہو گا کہ کہیں گے، اللہ کی قسم! جو ہمارا رب ہے، ہم شریک بنانے والے نہ تھے۔‘‘ اور قسمیں کھا کر دل میں سمجھیں گے کہ جس طرح دنیا میں جھوٹ چل جاتا تھا، اب بھی چل جائے گا، فرمایا : « يَوْمَ يَبْعَثُهُمُ اللّٰهُ جَمِيْعًا فَيَحْلِفُوْنَ لَهٗ كَمَا يَحْلِفُوْنَ لَكُمْ وَ يَحْسَبُوْنَ اَنَّهُمْ عَلٰى شَيْءٍ اَلَاۤ اِنَّهُمْ هُمُ الْكٰذِبُوْنَ» [ المجادلۃ : ۱۸ ] ’’جس دن اللہ ان سب کو اٹھائے گا تو وہ اس کے سامنے قسمیں کھائیں گے جس طرح تمھارے سامنے قسمیں کھاتے ہیں اور گمان کریں گے کہ وہ کسی چیز پر (قائم) ہیں، سن لو! یقینا وہی اصل جھوٹے ہیں۔‘‘ اس وقت ان سے یہ معاملہ ہو گا جس کا اس آیت میں ذکر ہے۔ انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ ایک دفعہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے کہ آپ اچانک ہنس دیے اور فرمایا : ’’جانتے ہو میں کس بات پر ہنسا ہوں؟‘‘ ہم نے کہا : ’’اللہ اور اس کا رسول بہتر جانتے ہیں۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ مِنْ مُخَاطَبَةِ الْعَبْدِ رَبَّهُ يَقُوْلُ يَا رَبِّ! أَلَمْ تُجِرْنِيْ مِنَ الظُّلْمِ؟ قَالَ يَقُوْلُ بَلٰی، قَالَ فَيَقُوْلُ فَإِنِّيْ لَا أُجِيْزُ عَلٰی نَففْسِيْ إِلَّا شَاهِدًا مِنِّيْ، قَالَ فَيَقُوْلُ كَفٰی بِنَفْسِكَ الْيَوْمَ عَلَيْكَ شَهِيْدًا وَبِالْكِرَامِ الْكَاتِبِيْنَ شُهُوْدًا قَالَ فَيُخْتَمُ عَلٰی فِيْهِ فَيُقَالُ لِأَرْكَانِهِ انْطِقِيْ قَالَ فَتَنْطِقُ بِأَعْمَالِهِ قَالَ ثُمَّ يُخَلّٰی بَيْنَهُ وَبَيْنَ الْكَلَامِ قَالَ فَيَقُوْلُ بُعْدًا لَكُنَّ وَسُحْقًا فَعَنْكُنَّ كُنْتُ أُنَاضِلُ ] [مسلم، الزھد والرقائق، باب الدنیا سجن للمؤمن و جنۃ للکافر : ۲۹۶۹ ] ’’میں بندے کی اپنے رب سے گفتگو پر ہنسا ہوں (جو وہ قیامت کے دن کرے گا)، وہ کہے گا : ’’اے میرے رب! کیا تو مجھے ظلم سے پناہ نہیں دے چکا؟‘‘ وہ فرمائے گا: ’’کیوں نہیں؟‘‘ کہے گا : ’’میں اپنے سوا کسی گواہ کی گواہی اپنے خلاف منظور نہیں کروں گا (میرا بدن میرا اپنا ہے باقی سب میرے دشمن ہیں)۔‘‘ اللہ تعالیٰ فرمائے گا : ’’آج تیری ذات ہی تیرے خلاف بطور گواہ کافی ہے اور کراماً کاتبین گواہ کافی ہیں۔‘‘ چنانچہ اس کے منہ پر مہر لگا دی جائے گی اور اس کے جسم کے اعضا سے کہا جائے گا : ’’بولو!‘‘ تو وہ اس کے سارے اعمال بول کر بتائیں گے، پھر اسے بولنے کی اجازت دی جائے گی تو وہ اپنے اعضا سے کہے گا : ’’تمھارا ستیاناس ہو اور تم (مجھ سے) دور ہو جاؤ، میں تو تمھارا ہی دفاع کر رہا تھا۔‘‘ ¤ ➋ اس آیت میں ہاتھوں اور پاؤں کے بولنے اور شہادت دینے کا ذکر ہے، جبکہ دوسرے مقامات پر جسم کے دوسرے اعضا کے بولنے کا بھی ذکر ہے، چنانچہ فرمایا : « حَتّٰۤى اِذَا مَا جَآءُوْهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَ اَبْصَارُهُمْ وَ جُلُوْدُهُمْ بِمَا كَانُوْا يَعْمَلُوْنَ » [ حٰمٓ السجدۃ : ۲۰ ] ’’یہاں تک کہ جوں ہی اس (آگ) کے پاس پہنچیں گے ان کے کان اور ان کی آنکھیں اور ان کے چمڑے ان کے خلاف اس کی شہادت دیں گے جو وہ کیا کرتے تھے۔‘‘ اور فرمایا : « يَوْمَ تَشْهَدُ عَلَيْهِمْ اَلْسِنَتُهُمْ وَ اَيْدِيْهِمْ وَ اَرْجُلُهُمْ بِمَا كَانُوْا يَعْمَلُوْنَ» [ النور : ۲۴ ] ’’جس دن ان کی زبانیں اور ان کے ہاتھ اور ان کے پاؤں ان کے خلاف اس کی شہادت دیں گے جو وہ کیا کرتے تھے۔‘‘ اس آیت پر ایک سوال ہے کہ مونہوں پر مہر کے باوجود زبانیں کیسے شہادت دیں گی؟ جواب اس کا یہ ہے کہ مہر سے مراد یہ ہے کہ اس کی زبان پر سے اس کا اختیار ختم کر دیا جائے گا اور زبان کو اپنی مرضی سے صحیح بات کہنے کا اختیار ہو گا۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) ➊ {وَ لَوْ نَشَآءُ لَطَمَسْنَا عَلٰۤى اَعْيُنِهِمْ …:} پچھلی دو آیتوں کے ساتھ ان دو آیات کا تعلق یہ ہے کہ جب اللہ تعالیٰ نے ذکر فرمایا کہ وہ قیامت کے دن شرک سے انکار کے بعد اس کے اعتراف پر مجبور ہو جائیں گے، تو اس سے دل میں خیال گزرتا ہے کہ کاش! دنیا میں بھی انھیں اسی طرح اللہ تعالیٰ کی توحید اور اس کے رسولوں کی تصدیق پر مجبور کر دیا جاتا۔ تو اللہ تعالیٰ نے بتایا کہ اگر ہمارا ارادہ یہ ہوتا تو ہم ایسا کر دیتے اور کفرو شرک کرنے والوں کو فوراً پکڑ لیتے، تاکہ وہ اپنے کفرو شرک سے باز آ جائیں، مگر ہم نے دنیا کو دارالامتحان بنایا ہے اور ہر ایک کو عمل کی مہلت دی ہے۔ (ابن عاشور) ¤ ➋ {’’طَمَسَ يَطْمِسُ‘‘} (ض) کا معنی ’’مٹانا‘‘ ہے، لفظ {’’ عَلٰۤى ‘‘} کے بغیر بھی اس کا معنی یہی ہے، {’’ عَلٰۤى ‘‘} کے لفظ سے مراد مٹانے میں مبالغہ ہے۔ یعنی اگر ہم چاہیں تو ان کی آنکھیں سرے ہی سے مٹا دیں، پھر وہ راستے کی طرف بڑھیں تو اسے کس طرح دیکھیں گے۔ {’’ لَوْ ‘‘} کا لفظ شرط کے نہ ہونے کی وجہ سے جزا کے نہ ہونے کے لیے ہوتا ہے۔ مطلب یہ ہے کہ ’’لیکن ہم نے یہ نہیں چاہا تو ایسا نہیں ہوا، بلکہ ہم نے انھیں ان کی تمام تر نافرمانیوں کے باوجود ایک وقت تک مہلت دی ہے۔‘‘"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) {وَ لَوْ نَشَآءُ لَمَسَخْنٰهُمْ عَلٰى مَكَانَتِهِمْ …:} مسخ کا معنی ہے انسان کی شکل اس کے علاوہ کسی اور شکل میں بدل دینا، مثلاً اسے بندر یا خنزیر یا پتھر بنا دینا۔ {’’مَكَانَةٌ‘‘ ’’مَكَانٌ‘‘} (جگہ) کی مؤنث ہے ({بُقْعَةٌ} کی تاویل کے ساتھ)، یعنی اور اگر ہم چاہیں تو (جب وہ کفر و شرک کا ارتکاب کریں) انھیں زمین کے عین اسی ٹکڑے پر مسخ کر دیں، پھر نہ وہ آگے جا سکیں اور نہ گھر واپس جا سکیں (مگر ہم نے یہ نہیں چاہا … )۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) ➊ { وَ مَنْ نُّعَمِّرْهُ نُنَكِّسْهُ فِي الْخَلْقِ:} انسان کی جوانی جوں جوں ڈھلتی ہے، بڑھاپا، کمزوری اور ناتوانی آتی جاتی ہے، حتیٰ کہ وہ دوبارہ بچوں کی طرح کمزور اور ہر کام میں دوسروں کا محتاج ہو جاتا ہے۔ بڑے عالی دماغ کے باوجود سب کچھ بھول جاتا ہے، جیسا کہ فرمایا : «اَللّٰهُ الَّذِيْ خَلَقَكُمْ مِّنْ ضُؔعْفٍ ثُمَّ جَعَلَ مِنْۢ بَعْدِ ضُؔعْفٍ قُوَّةً ثُمَّ جَعَلَ مِنْۢ ببَعْدِ قُوَّةٍ ضُؔعْفًا وَّ شَيْبَةً يَخْلُقُ مَا يَشَآءُ وَ هُوَ الْعَلِيْمُ الْقَدِيْرُ » [ الروم : ۵۴ ] ’’اللہ وہ ہے جس نے تمھیں کمزوری سے پیدا کیا، پھر کمزوری کے بعد قوت بنائی، پھر قوت کے بعد کمزوری اور بڑھاپا بنا دیا، وہ پیدا کرتا ہے جو چاہتا ہے اور وہی سب کچھ جاننے والا ہے، ہر چیز پر قادر ہے۔‘‘ اور فرمایا : «ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْۤا اَشُدَّكُمْ وَ مِنْكُمْ مَّنْ يُّتَوَفّٰى وَ مِنْنْكُمْ مَّنْ يُّرَدُّ اِلٰۤى اَرْذَلِ الْعُمُرِ لِكَيْلَا يَعْلَمَ مِنْۢ بَعْدِ عِلْمٍ شَيْـًٔا » [ الحج : ۵ ] ’’پھر ہم تمھیں ایک بچے کی صورت میں نکالتے ہیں، پھر تاکہ تم اپنی جوانی کو پہنچو اور تم میں سے کوئی وہ ہے جو قبض کر لیا جاتا ہے اور تم میں سے کوئی وہ ہے جو سب سے نکمّی عمر کی طرف لوٹایا جاتا ہے، تاکہ وہ جاننے کے بعد کچھ نہ جانے۔‘‘ ¤ ➋{ اَفَلَا يَعْقِلُوْنَ: } مفسرین نے پچھلی آیات کی مناسبت سے اس کی تفسیر دو طرح سے کی ہے، ایک یہ کہ زندگی کے ان انقلابات کو دیکھ کر بھی یہ لوگ نہیں سمجھتے کہ یہ انقلابات لانے والی ہستی کے لیے انسان کو دوبارہ زندہ کرنا اور قیامت برپا کرنا کچھ مشکل نہیں، بلکہ آخرت اور جزائے اعمال حق ہے۔ شاہ عبدالقادر لکھتے ہیں : ’’یعنی جیسے لڑکا سست تھا، بوڑھا بھی ویسا ہی ہوا، یہ بھی نشان ہے پھر پیدا ہونے کا۔‘‘ (موضح) دوسری تفسیر یہ کہ پھر بھی کیا یہ لوگ نہیں سمجھتے کہ جو پروردگار عمر دے کر بناوٹ میں الٹا کر دیتا ہے، وہ اس پر بھی قادر ہے کہ آنکھیں دینے کے بعد انھیں مٹا دے اور اچھی صورتیں عطا کرنے کے بعد انھیں مسخ کر دے۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) ➊ { وَ مَا عَلَّمْنٰهُ االشِّعْرَ وَ مَا يَنْۢبَغِيْ لَهٗ :} پچھلی آیات سے اس کی مناسبت یہ ہے کہ کفار توحید و آخرت اور زندگی کے بعد موت اور جنت و دوزخ کے متعلق نبی صلی اللہ علیہ وسلم کی باتوں کو محض شاعری قرار دے کر اپنے خیال میں بے وزن ٹھہرانے کی کوشش کرتے تھے، یہ ان کے اس الزام کا رد ہے۔ یعنی آپ صلی اللہ علیہ وسلم نبوت و رسالت کے جس مقام پر فائز ہیں شاعری کو اس سے کوئی مناسبت نہیں۔ شاعری کا حُسن اور کمال تو جھوٹ، مبالغہ آرائی، خیالی بلند پروازی اور فرضی نکتہ آفرینی ہے، جب کہ نبی صلی اللہ علیہ وسلم کی شان ان چیزوں سے بلندوبالا ہے۔ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کی طبیعت ایسی رکھی کہ باوجود خاندان عبدالمطلب سے ہونے کے، جس کا ہر فرد فطرتاً شاعر ہوتا تھا، پوری عمر میں کوئی شعر نہیں کہا۔ یوں جنگ وغیرہ کے موقع پر زبان مبارک سے کبھی کوئی مقفّٰی عبارت ایسی نکل گئی جو شعر کا سا وزن رکھتی تھی تو وہ الگ بات ہے، اسے شعروشاعری نہیں کہا جا سکتا۔ شعر اور شعراء پر مفصل کلام کے لیے دیکھیے سورۂ شعراء کی آیات (۲۴ ۲ تا ۲۲۷) کی تفسیر۔ ¤ ➋ { ’’ وَ مَا عَلَّمْنٰهُ الشِّعْرَ ‘‘} کے الفاظ پر ان لوگوں کو غور کرنا چاہیے جو رسول اللہ صلی اللہ علیہ وسلم کو {’’عَالِمُ مَا كَانَ وَمَا يَكُوْنُ ‘‘} قرار دیتے ہیں۔ ¤ ➌ { اِنْ هُوَ اِلَّا ذِكْرٌ وَّ قُرْاٰنٌ مُّبِيْنٌ :} یعنی یہ تو نصیحت اور یاد دہانی ہے اور واضح پڑھی جانے والی آسمانی کتاب ہے۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) ➊ { لِيُنْذِرَ مَنْ كَانَ حَيًّا:} تاکہ یہ اس آدمی کو ڈرائے جس کا دل اور جس کی بصیرت زندہ ہے، جس نے اپنے سوچنے سمجھنے کی صلاحیتوں کو معطل نہیں کر رکھا اور نہ ہی اس کا دل پتھر کی طرح مُردہ ہو چکا ہے کہ اسے کتنی ہی نصیحت کی جائے اس پر کوئی اثر نہیں ہوتا، کیونکہ زندہ دل والا آدمی ہی اس کے ڈرانے سے فائدہ اٹھا سکتا ہے، جیسا کہ فرمایا: « اِنَّمَا تُنْذِرُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ وَ اَقَامُوا الصَّلٰوةَ وَ مَنْ تَزَكّٰى فَاِنَّمَا يَتَزَكّٰى لِنَفْسِهٖ وَ اِلَى اللّٰهِ الْمَصِيْرُ (18) وَ مَا يَسْتَوِي الْاَعْمٰى وَ الْبَصِيْرُ (19) وَ لَا الظُّلُمٰتُ وَ لَا النُّوْرُ (20) وَ لَا الظِّلُّ وَ لَا الْحَرُوْرُ (21) وَ مَا يَسْتَوِي الْاَحْيَآءُ وَ لَا الْاَمْوَاتُ اِنَّ اللّٰهَ يُسْمِعُ مَنْ يَّشَآءُ وَ مَاۤ اَنْتَ بِمُسْمِعٍ مَّنْ فِي الْقُبُوْرِ (22) اِنْ اَنْتَ اِلَّا نَذِيْرٌ (23) اِنَّاۤ اَرْسَلْنٰكَ بِالْحَقِّ بَشِيْرًا وَّ نَذِيْرًا وَ اِنْ مِّنْ اُمَّةٍ اِلَّا خَلَا فِيْهَا نَذِيْرٌ» [ فاطر : ۱۸ تا ۲۴ ] ’’تو صرف ان لوگوں کو ڈراتا ہے جو دیکھے بغیر اپنے رب سے ڈرتے ہیں اور نماز قائم کرتے ہیں اور جو پاک ہوتا ہے تو وہ صرف اپنے لیے پاک ہوتا ہے اور اللہ ہی کی طرف لوٹ کر جانا ہے۔ اور اندھا اور دیکھنے والا برابر نہیں۔ اور نہ اندھیرے اور نہ روشنی۔ اور نہ سایہ اور نہ لُو۔ اور نہ زندے برابر ہیں اور نہ مردے۔ بے شک اللہ سنا دیتا ہے جسے چاہتا ہے اور تو ہرگز اسے سنانے والا نہیں جو قبروں میں ہے۔ تُو تو محض ایک ڈرانے والا ہے۔ بے شک ہم نے تجھے حق کے ساتھ خوش خبری دینے والا اور ڈرانے والا بنا کر بھیجا ہے اور کوئی امت نہیں مگر اس میں ایک ڈرانے والا گزرا ہے۔‘‘ اور فرمایا : « اِنَّمَا تُنْذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَ خَشِيَ الرَّحْمٰنَ بِالْغَيْبِ فَبَشِّرْهُ بِمَغْفِرَةٍ وَّ اَجْرٍ كَرِيْمٍ» [ یٰسٓ : ۱۱ ] ’’تُو تو صرف اسی کو ڈراتا ہے جو نصیحت کی پیروی کرے اور رحمان سے بِن دیکھے ڈرے۔ سو اسے بڑی بخشش اور باعزت اجر کی خوش خبری دے۔‘‘ اور فرمایا : «فَاِنَّكَ لَا تُسْمِعُ الْمَوْتٰى وَ لَا تُسْمِعُ الصُّمَّ الدُّعَآءَ اِذَا وَلَّوْا مُدْبِرِيْنَ (56) وَ مَاۤ اَنْتَ بِهٰدِ الْعُمْيِ عَنْ ضَلٰلَتِهِمْ اِنْ تُسْمِعُ اِلَّا مَننْ يُّؤْمِنُ بِاٰيٰتِنَا فَهُمْ مُّسْلِمُوْنَ » [ الروم : ۵۲، ۵۳ ] ’’پس بے شک تو نہ ُمردوں کو سناتا ہے اور نہ بہروں کو پکار سناتا ہے، جب وہ پیٹھ پھیر کر لوٹ جائیں۔ اور نہ تو کبھی اندھوں کو ان کی گمراہی سے راہ پر لانے والا ہے۔ تو نہیں سناتا مگر انھی کو جو ہماری آیات پر ایمان لاتے ہیں ،پھر وہ فرماں بردار ہیں۔‘‘ ¤ ➋ { وَ يَحِقَّ الْقَوْلُ عَلَى الْكٰفِرِيْنَ :} اور تاکہ جو کفر پر ڈٹے رہیں ان پر اللہ کی طرف سے حجت پوری ہو جائے اور ان کے پاس کوئی ایسا عذر نہ رہے جس کی بنا پر وہ قیامت کے دن اپنے آپ کو بے قصور اور مظلوم تصور کر سکیں۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) {اَوَ لَمْ يَرَوْا اَنَّا خَلَقْنَا لَهُمْ …:} یہاں سے پھر توحید اور اس کے بعد آخرت کے دلائل کا بیان ہے۔{’’ اَنْعَامًا ‘‘ ’’نَعَمٌ‘‘} کی جمع ہے، یعنی کیا انھوں نے نہیں دیکھا کہ یہ جانور جن کے یہ مالک بنے ہوئے ہیں، یہ سب ہم نے پیدا کیے ہیں۔ اگرچہ اللہ تعالیٰ کے ہاتھوں کا ذکر قرآن مجید میں دوسرے مقامات پر بھی ہے اور ان پر ایمان رکھنا اور ان کی کیفیت اللہ تعالیٰ کے سپرد کرنا واجب ہے، تاہم یہاں اہلِ علم نے ’’اپنے ہاتھوں سے‘‘ بنانے کا مطلب یہ بیان فرمایا ہے کہ ہم نے انھیں کسی کی شرکت یا واسطے کے بغیر خود بنایا ہے۔ ان کے پیدا کرنے میں کسی دوسرے کا ذرہ برابر دخل نہیں ہے۔ (فتح البیان)"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) {وَ ذَلَّلْنٰهَا لَهُمْ فَمِنْهَا رَكُوْبُهُمْ … :} یعنی ان چوپاؤں کو ہم نے ان کے تابع کر رکھا ہے، اگر ہم دوسرے جنگلی جانوروں کی طرح ان کی طبیعت میں بھی وحشت رکھ دیتے تو وہ کبھی ان کے قابو میں نہ آتے، کجا یہ کہ ان کے مالک بنتے۔ ہمارے تابع کرنے کا نتیجہ ہے کہ ایک چھوٹا سا بچہ بھی اونٹ کی نکیل تھام لے تو اونٹ جیسا قوی اور بڑا جانور اس کے ساتھ چل پڑتا ہے اور اگر اس کے ساتھ سو اونٹوں کی قطار ہو تو وہ بھی ایک بچے کے ہانکنے سے سیدھی چلتی رہتی ہے۔ اس ماتحتی کے علاوہ ان پر سوار ہو کر لمبے لمبے سفر آسانی سے طے کرتے ہیں۔ خود سوار ہوتے ہیں، سامان لادتے ہیں اور بوجھ ڈھونے کا کام لیتے ہیں، حتیٰ کہ بعض کو ذبح کر کے ان کا گوشت بھی کھاتے ہیں۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) ➊ { وَ لَهُمْ فِيْهَا مَنَافِعُ وَ مَشَارِبُ:} سواری اور گوشت کے علاوہ انسان کے لیے ان جانوروں میں بہت سے فوائد ہیں، مثلاً ان کی کھال، چربی، سینگوں، بالوں اور آنتوں وغیرہ سے سیکڑوں چیزیں بناتے ہیں۔ ان کے ساتھ کھیتی باڑی کرتے ہیں، ان کے گوبر کی کھاد بناتے ہیں اور ان کی خریدو فروخت کے ساتھ زندگی کی ہر ضرورت پوری کرتے ہیں۔ جانوروں کے ذریعے سے آدمی کو پینے کی بھی بہت سی چیزیں مہیا ہوتی ہیں، مثلاً ان کا دودھ اور بے شمار وہ چیزیں جو دودھ سے بنتی ہیں۔ مزید دیکھیے سورۂ نحل (۵ تا۸) اور سورۂ زخرف (۱۲ تا ۱۴)۔ ¤ ➋ { اَفَلَا يَشْكُرُوْنَ :} یعنی یہ سب قسم کے احسانات تو انسان پر اللہ تعالیٰ نے کیے، اب بجائے اس کے کہ وہ اللہ کا شکر ادا کرتا، اس نے انھی جانوروں کی قربانیاں غیر اللہ کے آستانوں پر اور ان کے نام پر کیں۔ ان کے نام پر جانور آزاد چھوڑے جن کا ان جانوروں کے پیدا کرنے اور انھیں انسان کا مطیع بنانے میں کچھ بھی عمل دخل نہ تھا، اس سے بڑھ کر ناشکری اور نمک حرامی کیا ہو سکتی ہے!؟"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) { وَ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ … :} انسان نے اللہ کے سوا جن کی بھی عبادت کی ہے صرف اس لیے کی ہے کہ وہ اس کی مدد کریں، اس کی کوئی حاجت پوری کریں، یا اس کی کوئی مشکل دور کریں۔ اگر وہ آخرت پر بھی ایمان رکھتا ہے تو اس لیے کہ اسے سفارش کے بل بوتے پر عذاب سے بچا لیں، یہ سب مدد کی صورتیں ہیں۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) ➊ { لَا يَسْتَطِيْعُوْنَ نَصْرَهُمْ :} فرمایا، وہ ان کی مدد کی طاقت نہیں رکھتے، نہ دنیا میں نہ آخرت میں۔ دنیا میں ان کی مدد کا یہ حال ہے کہ وہ اپنے عابدوں کی مدد تو کیا کریں گے وہ اپنی بقا، حفاظت اور دوسری ضروریات کے لیے اپنی عبادت کرنے والوں کے محتاج ہیں اور آخرت میں وہ ان کے دشمن بن جائیں گے اور ان کی عبادت کا انکار کر دیں گے۔ دیکھیے سورۂ احقاف (۶)۔ ¤ ➋ { وَ هُمْ لَهُمْ جُنْدٌ مُّحْضَرُوْنَ:} اس کے دو معنی ہو سکتے ہیں، پہلا یہ کہ {’’ هُمْ ‘‘} سے مراد مشرکین اور {’’ لَهُمْ ‘‘} سے مراد ان کے معبود ہوں، یعنی بجائے اس کے کہ ان کے معبود ان کی مدد کریں یہ عبادت کرنے والے ہر وقت ان کے مددگار اور خدمت گار فوج بنے ہوئے ہیں، ان کے آستانے تعمیر کرتے ہیں، ان کے آستانوں اور قبروں پر جھاڑو دیتے ہیں، انھیں چمکا کر رکھتے ہیں، وہاں لنگر کا انتظام کرتے ہیں، ان کی حمایت میں لڑتے جھگڑتے ہیں اور ان کی مشکل کُشائی اور حاجت روائی کے جھوٹے قصّے بیان کر کے لوگوں کو ان کا گرویدہ بناتے ہیں۔ اگر عبادت کرنے والوں کے یہ لشکر نہ ہوں تو ان کی خدائی ایک لمحہ نہیں چل سکتی۔ دوسرا معنی یہ ہے کہ {’’ هُمْ ‘‘} سے مراد باطل معبود اور {’’ لَهُمْ ‘‘} سے مراد مشرکین ہوں، یعنی وہ جھوٹے معبود قیامت کے دن ان کفار کی عبادت کا انکار کر کے انھیں عذاب دینے دلوانے والے لشکر بن جائیں گے۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76) ➊ { فَلَا يَحْزُنْكَ قَوْلُهُمْ :} اس میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ جب ہمارے متعلق ان مشرکین کے جہل اور عناد کا یہ حال ہے تو آپ بھی ان کی باتوں سے غم زدہ نہ ہوں۔ ¤ ➋ { اِنَّا نَعْلَمُ مَا يُسِرُّوْنَ وَ مَا يُعْلِنُوْنَ:} ({إِنَّ} تعلیل کے لیے ہوتا ہے) کیونکہ آپ غم زدہ تو تب ہوں جب انھیں کوئی پوچھنے والا نہ ہو، ہم تو ان کی وہ باتیں بھی جانتے ہیں جو وہ چھپاتے ہیں اور وہ بھی جو ظاہر کرتے تھے۔ ہمیں معلوم ہے کہ آپس میں وہ آپ کے سچا ہونے کا اقرار کرتے ہیں اور لوگوں کے سامنے آپ کو شاعر، ساحر اور کاہن وغیرہ کہتے ہیں۔ اسی طرح ہمیں ان کی خفیہ سازشوں کا بھی علم ہے اور علانیہ دشمنی کا بھی، آپ فکر نہ کریں، ہم سارا حساب برابر کر دیں گے۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77) ➊ { اَوَ لَمْ يَرَ الْاِنْسَانُ :} یہاں سے سورت کے آخر تک کفار کے اس انکار کا دلیل کے ساتھ جواب ہے جو وہ قیامت کا مذاق اڑانے کے لیے سوال کی صورت میں کرتے تھے کہ {’’ مَتٰى هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ ‘‘} قیامت کا وعدہ کب پورا ہو گا؟ یعنی قیامت وغیرہ کچھ نہیں، نہ ہی کوئی مر کر زندہ ہو سکتا ہے۔ {’’ اَوَ لَمْ يَرَ ‘‘} (اور کیا انسان نے نہیں دیکھا) سے مراد ہے {’’أَوَلَمْ يَعْلَمْ‘‘} (اور کیا انسان کو معلوم نہیں)۔ کیونکہ کسی بھی شخص نے اپنا نطفے سے پیدا ہونا آنکھوں سے نہیں دیکھا۔ ¤ ➋ { اَنَّا خَلَقْنٰهُ مِنْ نُّطْفَةٍ : ’’ نُطْفَةٍ ‘‘ ’’نَطَفَ يَنْطُفُ‘‘} (ن، ض) ٹپکنا، اس میں تنوین تحقیر کے لیے ہے، معمولی اور حقیر قطرہ، یعنی کیا انسان کو معلوم نہیں کہ ہم نے انسان کو ایک حقیر قطرے سے پیدا کیا ہے؟ بسر بن جحاش القرشی رضی اللہ عنہ بیان کرتے ہیں : [ بَزَقَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ فِيْ كَفِّهِ، ثُمَّ وَضَعَ أُصْبَعَهُ السَّبَّابَةَ وَقَالَ يَقُوْلُ اللّٰهُ عَزَّ وَجَلَّ أَنّٰی تُعْجِزُنِي ابْنَ آدَمَ وَقَدْ خَلَقْتُكَ مِنْ مِثْلِ هٰذِهِ، فَإِذَا بَلَغَتْ نَفْسُكَ هٰذِهِ، وَأَشَارَ إِلٰی حَلْقِهِ، قُلْتَ أَتَصَدَّقُ، وَأَنّٰی أَوَانُ الصَّدَقَةِ؟ ] [ابن ماجہ، الوصایا، باب النھي عن الإمساک… : ۲۷۰۷، قال البوصیري صحیح وقال الألباني حسن ] ’’رسول اللہ صلی اللہ علیہ وسلم نے اپنی ہتھیلی پر تھوکا، پھر اپنی شہادت کی انگلی اس پر رکھی اور فرمایا : ’’اللہ عز و جل فرماتا ہے، اے ابن آدم! تو مجھے کیسے عاجز کر سکتا ہے، حالانکہ میں نے تجھے اس جیسی چیز سے پیدا کیا ہے اور جب تیری جان یہاں پہنچ جاتی ہے (اور آپ نے حلق کی طرف اشارہ فرمایا) تو کہتا ہے، میں صدقہ کرتا ہوں، بھلا اب صدقے کا وقت کہاں؟‘‘ ¤ ➌ { فَاِذَا هُوَ خَصِيْمٌ مُّبِيْنٌ : ’’ خَصِيْمٌ ‘‘} مبالغے کا صیغہ ہے، بہت جھگڑنے والا۔ {’’إِذَا‘‘} فجائیہ اچانک کے معنی میں آتا ہے، یعنی ایسی عجیب چیز کا وجود میں آنا جس کا وہم و گمان نہ ہو، یعنی ایسے حقیر قطرے سے پیدا کیے جانے والے انسان کا حق تو یہ تھا کہ ہمیشہ اس کا سر ہمارے احسان کے بوجھ سے جھکا رہتا۔ یہ تو امید ہی نہ تھی کہ وہ صاف جھگڑے پر اتر آئے گا اور اتنا زیادہ جھگڑے گا۔ دیکھیے سورۂ نحل (۴)۔"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) {وَ ضَرَبَ لَنَا مَثَلًا وَّ نَسِيَ خَلْقَهٗ … :} یعنی ہمیں مخلوق کی طرح عاجز سمجھتا ہے کہ جس طرح انسان مُردہ کو زندہ نہیں کر سکتا ہم بھی نہیں کر سکتے اور یہ بھول جاتا ہے کہ خود اسے ہم نے کس چیز سے پیدا کیا۔ کہتا ہے، آخر جب بدن گل سڑ کر ہڈیاں رہ گیا اور وہ بھی پرانی اور بوسیدہ و کھوکھلی تو انھیں دوبارہ کون زندہ کرے گا؟ اگر یہ اپنی پیدائش کو یاد رکھتا تو یہ سوال ہر گز نہ کرتا، کیونکہ جو انسان کو ایک حقیر مردہ قطرے سے پیدا کر سکتا ہے، جب اس کا نام و نشان نہیں تھا، اس کے لیے اسے اس کی بوسیدہ ہڈیوں کو دوبارہ زندہ کرنا کیا مشکل ہے؟ اللہ تعالیٰ نے انسان کو نطفے سے پیدا کرنے کی بات کئی مقامات پر یاد دلائی ہے، سورۂ دہر میں فرمایا : « اِنَّا خَلَقْنَا الْاِنْسَانَ مِنْ نُّطْفَةٍ اَمْشَاجٍ» [ الدھر : ۲ ] ’’بلاشبہ ہم نے انسان کو ایک ملے جلے قطرے سے پیدا کیا۔‘‘ اور سورۂ مرسلات میں فرمایا : « اَلَمْ نَخْلُقْكُّمْ مِّنْ مَّآءٍ مَّهِيْنٍ» [ المرسلات : ۲۰ ] ’’کیا ہم نے تمھیں ایک حقیر پانی سے پیدا نہیں کیا؟‘‘"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79) ➊ { قُلْ يُحْيِيْهَا الَّذِيْۤ اَنْشَاَهَاۤ … :} یعنی جس نے ان ہڈیوں کو اس وقت پیدا کر لیا جب ان کا وجود ہی نہ تھا، پھر ان میں جان ڈال دی، وہی انھیں دوبارہ زندہ کر دے گا، کیونکہ دوبارہ بنانا تو زیادہ آسان ہوتا ہے۔ اگرچہ اس قادر مطلق کے لیے پہلی مرتبہ بنانا اور دوبارہ بنانا یکساں آسان ہے۔ دیکھیے سورۂ روم (۲۷)۔ ¤ ➋ { وَ هُوَ بِكُلِّ خَلْقٍ عَلِيْمُ : ’’ خَلْقٍ ‘‘} مصدر بھی ہو سکتا ہے، یعنی ’’ہر طرح کا پیدا کرنا‘‘ اور اسم مفعول بمعنی مخلوق بھی، یعنی ’’ہر ہر مخلوق‘‘ پہلا معنی ہو تو مطلب یہ ہے کہ وہ ہر چیز کے متعلق خوب جانتا ہے کہ اسے کس طرح پیدا کرنا ہے، پھر یہ بھی کہ اسے پہلی دفعہ کیسے پیدا کرنا ہے اور دوبارہ کیسے بنانا ہے، لہٰذا اس کے لیے بوسیدہ ہڈیوں کو زندہ کرنا کچھ مشکل نہیں۔ دوسرا معنی ہو تو مطلب یہ ہے کہ وہ ہر ہر مخلوق کو جانتا ہے کہ وہ کہاں ہے اور اس کے فنا ہونے کے بعد اس کے ذرات کہاں کہاں ہیں، سو وہ ہر ذرے کو اس کی جگہ سے جمع کر کے دوبارہ زندہ کر سکتا ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَانَ رَجُلٌ يُسْرِفُ عَلٰی نَفْسِهِ، فَلَمَّا حَضَرَهُ الْمَوْتُ قَالَ لِبَنِيْهِ إإِذَا أَنَا مُتُّ فَأَحْرِقُوْنِيْ ثُمَّ اطْحَنُوْنِيْ ثُمَّ ذَرُّوْنِيْ فِي الرِّيْحِ، فَوَ اللّٰهِ !  لَئِنْ قَدَرَ اللّٰهُ عَلَيَّ لَيُعَذِّبَنِّيْ عَذَابًا مَا عَذَّبَهُ أَحَدًا فَلَمَّا مَاتَ فُعِلَ بِهِ ذٰلِكَ، فَأَمَرَ اللّٰهُ الْأَرْضَ، فَقَالَ اجْمَعِيْ مَا فِيْكِ مِنْهُ فَفَعَلَتْ فَإِذَا هُوَ قَائِمٌ، فَقَالَ مَا حَمَلَكَ عَلٰی مَا صَنَعْتَ؟ قَالَ يَا رَبِّ! خَشْيَتُكَ فَغَفَرَ لَهُ ] [ بخاري، أحادیث الأنبیاء، باب : ۳۴۸۱ ] ’’ایک آدمی اپنی جان پر زیادتی کرتا تھا۔ جب اس کی موت کا وقت آیا، اس نے اپنے بیٹوں سے کہا، جب میں فوت ہو جاؤں، مجھے جلا دینا، پھر مجھے پیسنا، پھر مجھے ہوا میں اڑا دینا، کیونکہ قسم ہے اللہ کی! اگر اللہ نے مجھ پر قابو پا لیا تو مجھے ایسا عذاب دے گا جو اس نے کسی کو نہیں دیا۔ تو جب وہ فوت ہو گیا، اس کے ساتھ ایسے ہی کیا گیا تو اللہ تعالیٰ نے زمین کو حکم دیا، فرمایا، تجھ میں اس کا جو کچھ ہے جمع کر دے، اس نے ایسے ہی کیا تو وہ اسی وقت کھڑا ہو گیا۔ اللہ تعالیٰ نے فرمایا : ’’تجھے اس طرح کرنے پر کس چیز نے آمادہ کیا؟‘‘ اس نے کہا : ’’اے میرے رب! تیرے خوف نے۔‘‘ تو اللہ تعالیٰ نے اسے بخش دیا۔‘‘"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) {الَّذِيْ جَعَلَ لَكُمْ مِّنَ الشَّجَرِ الْاَخْضَرِ نَارًا … : ’’ الْاَخْضَرِ ‘‘} سے مراد تروتازہ درخت ہے، جو پانی سے لبریز ہوتا ہے۔ یہ دوبارہ زندگی کی دوسری دلیل ہے کہ اللہ تعالیٰ اشیاء سے ان کی ضد نکالنے پر قادر ہے، وہ بوسیدہ ہڈیوں سے دوبارہ زندہ انسان بنا دے گا، کیونکہ دیکھو، پانی اور آگ ایک دوسرے کی ضد ہیں، مگر اس نے پانی سے لبریز تازہ درخت میں آگ پکڑنے والا وہ مادہ رکھ دیا ہے جس سے تازہ لکڑی بھی جلنے لگتی ہے۔ اسی طرح وہ زندہ سے مُردہ کو اور مُردہ سے زندہ کو نکالتا ہے اور نکالے گا۔"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) { اَوَ لَيْسَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ بِقٰدِرٍ … :} یہ دوبارہ زندگی کی تیسری دلیل ہے کہ آسمان اور زمین کو دیکھو، ان میں اللہ تعالیٰ نے جو عجیب و غریب اور عظیم الشّان چیزیں رکھی ہیں، انھیں دیکھو اور ان کے مقابلے میں انسان کو دیکھو، کیا اس عظیم آسمان و زمین کو پیدا کرنے والا اس ضعیف البنیان انسان کو پہلے یا دوبارہ پیدا نہیں کر سکتا؟ پھر اللہ تعالیٰ نے خود ہی جواب دیا، کیوں نہیں! وہ خلّاق بھی ہے اور علیم بھی۔ جب اس میں صفت خلق اور صفت علم پورے کمال کے ساتھ جمع ہیں تو پھر کون سا مُردہ ہے جو وہ زندہ نہ کر سکے؟ اللہ تعالیٰ نے آسمان و زمین کی پیدائش کو انسان کے دوبارہ زندہ کرنے کی دلیل کے طور پر کئی مقامات پر نہایت زوردار انداز میں بیان فرمایا ہے، جیسا کہ فرمایا : « لَخَلْقُ السَّمٰوٰتِ وَ الْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ» [المؤمن : ۵۷ ] ’’یقینا آسمانوں اور زمین کا پیدا کرنا لوگوں کے پیدا کرنے سے زیادہ بڑا (کام) ہے۔‘‘ اور فرمایا : «اَوَ لَمْ يَرَوْا اَنَّ اللّٰهَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ وَ لَمْ يَعْيَ بِخَلْقِهِنَّ بِقٰدِرٍ عَلٰۤى اَنْ يُّحْيِۧ الْمَوْتٰى بَلٰۤى اِنَّهٗ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ» [ الأحقاف : ۳۳ ] ’’اور کیا انھوں نے نہیں دیکھا کہ وہ اللہ جس نے آسمانوں اور زمین کو پیدا کیا اور وہ ان کے پیدا کرنے سے نہیں تھکا، وہ اس بات پر قادر ہے کہ ُمردوں کو زندہ کر دے؟ کیوں نہیں! یقینا وہ ہر چیز پر خوب قادر ہے۔‘‘ اور فرمایا : « ءَاَنْتُمْ اَشَدُّ خَلْقًا اَمِ السَّمَآءُ بَنٰىهَا» [النازعات : ۲۷ ] ’’کیا پیدا کرنے میں تم زیادہ مشکل ہو یا آسمان؟ اس نے اسے بنایا۔‘‘"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) { اِنَّمَااَمْرُهٗۤ اِذَاۤ اَرَادَ شَيْـًٔا … :} یہ ایک طرح سے پہلی آیات کا نتیجہ اور خلاصہ ہے کہ اسے پہلی مرتبہ یا دوسری مرتبہ کوئی چھوٹی یا بڑی چیز بنانے میں دقت ہی کیا ہو سکتی ہے؟ وہ تو جب کسی چیز کا ارادہ کرتا ہے تو بس {’’ كُنْ ‘‘} کہتا ہے اور وہ ہو جاتی ہے۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) ➊ {فَسُبْحٰنَ الَّذِيْ بِيَدِهٖ مَلَكُوْتُ كُلِّ شَيْءٍ : ’’ مَلَكُوْتُ ‘‘ ’’مُلْكٌ‘‘} (مصدر) میں مبالغہ ہے، اس لیے اس کا ترجمہ ’’کامل بادشاہی‘‘ کیا گیا ہے۔ ¤ ➋ {وَ اِلَيْهِ تُرْجَعُوْنَ :} یعنی یہ نہیں کہ مٹی میں رَل مل کر تمھارا وجود ہمیشہ کے لیے ختم ہو جائے۔ نہیں، بلکہ اسے دوبارہ وجود عطا کیا جائے گا۔ یہ بھی نہیں ہو گا کہ تم بھاگ کر کسی اور کے پاس پناہ طلب کر لو، بلکہ تمھیں ہرحال میں اس کی بارگاہ میں حاضر ہونا ہو گا، جہاں وہ تمھارے اعمال کے مطابق اچھی یا بری جزا دے گا۔"
    }
  ]
}