{
  "surah": "Az-Zumar",
  "surah_number": 39,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "{سورة الزمر} ¤ (آیت 1){ تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِ : ’’ الْكِتٰبِ ‘‘} میں الف لام عہد کا ہونے کی وجہ سے ترجمہ’’ اس کتاب‘‘ کیا گیا ہے۔ کفار کہتے تھے کہ یہ قرآن محمد( صلی اللہ علیہ وسلم ) نے خود بنا لیا ہے، جیسا کہ سورۂ طور میں ہے : « اَمْ يَقُوْلُوْنَ تَقَوَّلَهٗ» [الطور : ۳۳ ] ’’یا وہ کہتے ہیں کہ اس نے یہ خود گھڑ لیا ہے؟‘‘ اللہ تعالیٰ نے سورت کی ابتدا اس بات سے فرمائی کہ یہ کتاب اللہ کی طرف سے نازل کی گئی ہے، ساتھ ہی اپنی دو صفات ذکر فرمائیں، تاکہ وہ اس کلام کو معمولی خیال نہ کریں، بلکہ اس کی اہمیت سمجھیں۔ ایک یہ کہ یہ کلام نازل کرنے والا عزیز یعنی سب پر غالب ہے، کوئی یہ نہ سمجھے کہ وہ اس کا ذرہ بھر مقابلہ بھی کر سکے گا۔ دوسرا یہ کہ وہ حکیم یعنی حکمت والا ہے، اس لیے یہ کتاب سراسر دانائی اور حکمت پر مشتمل ہے، کوئی عقل سے عاری شخص ہی اس سے بے رخی اختیار کر سکتا ہے۔ اللہ تعالیٰ نے کئی سورتوں کی ابتدا اس بات سے فرمائی ہے کہ یہ اللہ کی نازل کردہ کتاب ہے اور ہر جگہ اس کی اہمیت واضح کرنے کے لیے اپنی چند صفات کا تذکرہ فرمایا ہے، مثلاً سورۂ مومن کے شروع میں فرمایا : «حٰمٓ (1) تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْعَلِيْمِ» ’’ {حٰمٓ۔} اس کتاب کا اتارنا اللہ کی طرف سے ہے، جو سب پر غالب ، ہر چیز کو جاننے والا ہے۔‘‘ سورۂ جاثیہ اور احقاف کے شروع میں فرمایا : « حٰمٓ (1) تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِ » ’’ {حٰمٓ۔} اس کتاب کا اتارنا اللہ کی طرف سے ہے جو سب پر غالب، کمال حکمت والا ہے۔‘‘ سورۂ یٰس کے شروع میں فرمایا : « تَنْزِيْلُ الْعَزِیْرِ الرَّحِیْمِ » ’’ یہ سب پر غالب، نہایت مہربان کا نازل کیا ہوا ہے۔‘‘ سورۂ حٰم السجدہ کے شروع میں فرمایا : « حٰمٓ (1) تَنْزِيْلُ الرَّحْمٰنِ الرَّحِیْمِ» ’’ {حٰمٓ۔} اس بے حد رحم والے، ننہایت مہربان کی طرف سے اتاری ہوئی ہے۔‘‘ ظاہر ہے اس میں قرآن مجید کے اللہ تعالیٰ کا کلام ہونے کی تاکید ہے اور اس کی خوبی اور فضیلت کا بیان بھی، کیونکہ کلام کرنے والا جتنی اعلیٰ صفات والا ہو گا اس کا کلام بھی اتنا ہی اعلیٰ اور کامل ہوگا۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { اِنَّاۤ اَنْزَلْنَاۤ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ :} ’’حق‘‘ وہ ہے جو واقعہ کے عین مطابق ہو۔ اس آیت میں قرآن مجید کی مزید خوبیاں بیان فرمائیں، ایک یہ کہ پچھلی آیت میں اس کتاب کو اللہ تعالیٰ کی نازل کردہ بیان فرمایا، اب یہی بات اپنا ذکر جمع متکلم کے صیغے کے ساتھ کر کے فرمائی، جس سے مقصود اپنی اور اپنے کلام کی عظمت کا اظہار ہے۔ دوسری یہ کہ ہم نے اس کتاب کو تیری طرف حق کے ساتھ نازل کیا ہے، اس کی ہر بات درست ہے، کوئی بات واقعہ کے خلاف نہیں، اس لیے اس پر عمل لازم ہے۔ ¤ ➋ { فَاعْبُدِ اللّٰهَ مُخْلِصًا لَّهُ الدِّيْنَ :} دین کا معنی عبادت اور اطاعت بھی ہے اور ایمان، اسلام اور احسان بھی، جیسا کہ حدیثِ جبریل میں ہے۔ اخلاص کا مطلب یہ ہے کہ آدمی اپنے ہر قول و فعل میں اللہ تعالیٰ کو راضی کرنے کا ارادہ اور نیت رکھے۔ شوکانی نے فرمایا، یہ آیت نیت کے ضروری ہونے کی دلیل ہے اور اس بات کی بھی کہ وہ ہر قسم کے شرک اور ریا کی ملاوٹ سے خالص ہونی چاہیے، کیونکہ اخلاص کا تعلق دل سے ہے اور صحیح حدیث میں ہے کہ تمام اقوال و افعال کا دارومدار نیت پر ہے، جیسا کہ فرمایا : [ إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ ] [ بخاري، بدء الوحي، باب کیف کان بدء الوحي… : ۱ ] ’’تمام اعمال نیتوں ہی کے ساتھ معتبر ہیں۔‘‘ دین کو اللہ کے لیے خالص کرنے کا مطلب یہ ہے کہ آدمی اللہ کی عبادت (بندگی) کے ساتھ کسی دوسرے کی بندگی شامل نہ کرے، بلکہ صرف اسی کی پرستش کرے، اسی کی ہدایت کی پیروی کرے اور اسی کے احکام پر عمل کرے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { اَلَا لِلّٰهِ الدِّيْنُ الْخَالِصُ … :} یعنی اصل حقیقت تو یہی ہے کہ خالص عبادت اور اطاعت صرف اللہ تعالیٰ کا حق ہے، مگر اللہ کے سوا دوسری ہستیوں کو اپنا حمایتی اور مدد گار سمجھنے والے مشرک لوگ عموماً یہی کہا کرتے ہیں کہ ہم ان کی عبادت انھیں خالق و مالک سمجھ کر نہیں کرتے، خالق و مالک اور اصل معبود تو ہم اللہ تعالیٰ ہی کو سمجھتے ہیں، لیکن اس کی ذات بہت بلند ہے، ہماری وہاں رسائی نہیں ہو سکتی، اس لیے ہم ان ہستیوں کو ذریعہ بناتے ہیں اور انھیں پکارتے اور ان سے فریاد کرتے ہیں، تاکہ یہ ہماری حاجتیں اور دعائیں اللہ تعالیٰ سے پوری کروا دیں۔ کئی لوگ اس کے لیے چھت پر پہنچنے کے لیے سیڑھی کے ضروری ہونے کی مثال بیان کیا کرتے ہیں۔ ¤ ➋ { اِنَّ اللّٰهَ يَحْكُمُ بَيْنَهُمْ … :} ایک اللہ کو پکارنے اور اس کی عبادت کرنے والے تو ایک ہی معبود پر متفق ہیں مگر اس کے سوا دوسری ہستیوں کو پکارنے والوں کا کسی ایک ہستی پر اتفاق نہیں، کوئی کسی کو پکارتا ہے اور کوئی کسی کو، کیونکہ کسی کے پاس اس بات کی دلیل نہیں، نہ اللہ تعالیٰ نے یہ بتایا ہے کہ فلاں ہستی کو فلاں کام کا اختیار ہے، یا وہ اللہ تعالیٰ سے فلاں فلاں کام کروا سکتا ہے۔ مشرکین محض گمان کی بنا پر انھیں پوجتے جا رہے ہیں اور ہر ایک اپنے اپنے گمان کے مطابق کسی نہ کسی داتا، دستگیر، مشکل کُشا یا حاجت روا کو پکار تا چلا جا رہا ہے۔ مشرکین کی یہ بات چونکہ بالکل ہی بودی اور بے کار ہے، اس لیے اللہ تعالیٰ نے اس کا رد کرنے کے بجائے فرمایا کہ قیامت کے دن اللہ تعالیٰ مومن موحّدوں اور ان مشرکین کے درمیان اور مشرکوں کے مختلف گروہوں کے باہمی اختلاف میں حق بات کا فیصلہ فرمائے گا۔ ¤ ➌ { اِنَّ اللّٰهَ لَا يَهْدِيْ مَنْ هُوَ كٰذِبٌ كَفَّارٌ :} اللہ تعالیٰ نے مشرکوں کے لیے دو لففظ استعمال فرمائے ہیں، ایک {’’ كٰذِبٌ ‘‘} اور دوسرا {’’ كَفَّارٌ ‘‘} ۔ {’’ كٰذِبٌ ‘‘} اس لیے کہ اس سے بڑا جھوٹ کوئی نہیں کہ ایسی کوئی ہستی موجود ہے جس کی پرستش سے، یا اسے پکارنے سے اللہ تعالیٰ کا قُرب حاصل ہو جاتا ہے اور {’’ كَفَّارٌ ‘‘} (بہت ناشکرا) اس لیے کہ اللہ تعالیٰ ہر شخص کی دعا خود سنتا اور قبول کرتا ہے، لیکن کس قدر نا شکرے ہیں وہ لوگ جو اس کی اس نعمت کی ناشکری کرتے ہوئے اس کے بجائے بے اختیار ہستیوں کو پکارتے اور ان کی پرستش کرتے ہیں اور اس کے لیے سیڑھی وغیرہ کی مثالیں بیان کرتے ہیں۔ وہ فرماتا ہے، میں قریب ہوں اور یہ کہتے ہیں کہ اس تک رسائی کے لیے واسطے ضروری ہیں۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت4 ) ➊ {لَوْ اَرَادَ اللّٰهُ اَنْ يَّتَّخِذَ وَلَدًا … :} اس آیت میں مشرکین کے ایک اور شرک یعنی اللہ تعالیٰ کے لیے اولاد کی نفی فرمائی ہے، کیونکہ ان میں سے بعض عزیر علیہ السلام کو اور بعض عیسیٰ علیہ السلام کو اللہ تعالیٰ کا بیٹا قرار دیتے تھے اور بعض فرشتوں کو اللہ تعالیٰ کی بیٹیاں قرار دیتے تھے۔ ظاہر ہے اولاد دو طرح کی ہو سکتی ہے، ایک حقیقی اولاد۔ یہ اللہ تعالیٰ کے لیے عقلاً محال ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : « اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّ لَمْ تَكُنْ لَّهٗ صَاحِبَةٌ  وَ خَلَقَ كُلَّ شَيْءٍ وَ هُوَ بِكُلِّ شَيْءٍ عَلِيْمٌ » [ الأنعام : ۱۰۱ ] ’’اس کی اولاد کیسے ہو گی، جب کہ اس کی کوئی بیوی نہیں اور اس نے ہر چیز پیدا کی اور وہ ہر چیز کو خوب جاننے والا ہے۔‘‘ یعنی اللہ کی کوئی بیوی نہیں اور بیوی کے بغیر اولاد محال ہے، پھر ہر چیز اس کی مخلوق ہے اور اولاد والد کی مخلوق نہیں بلکہ اس کی ہم جنس ہوتی ہے۔ دوسری صورت یہ ہے کہ کسی کو اپنی منہ بولی اولاد بنا لینا ہے۔ فرمایا، اگر اللہ تعالیٰ کسی کو اپنی اولاد بنانا چاہتا تو وہ اپنی مخلوق میں سے جسے چاہتا اس کے لیے چن لیتا، نہ کہ یہ معاملہ ان مشرکوں اور گمراہ یہود و نصاریٰ پر چھوڑ دیتا، مگر نہ اس نے یہ چاہا اور نہ کسی کو اولاد بنایا، کیونکہ اللہ تعالیٰ سے یہ ارادہ کرنا ممکن ہی نہیں۔ یہاں {’’ لَوْ ‘‘} کا لفظ تعلیق بالمحال کے لیے استعمال ہوا ہے، جیسا کہ فرمایا : «لَوْ اَرَدْنَاۤ اَنْ نَّتَّخِذَ لَهْوًا لَّاتَّخَذْنٰهُ مِنْ لَّدُنَّاۤ اِنْ كُنَّا فٰعِلِيْنَ » [ الأنبیاء : ۱۷ ] ’’اگر ہم چاہتے کہ کوئی کھیل بنائیں تو یقینا اسے اپنے پاس سے بنالیتے، اگر ہم کرنے والے ہوتے۔‘‘ ¤ ➋ { سُبْحٰنَهٗ :} یہ اللہ تعالیٰ کے کسی کو اولاد نہ بنانے کی دلیل ہے۔ دوسری جگہ یہ دلیل تفصیل سے بیان فرمائی ہے : «وَ قَالُوا اتَّخَذَ اللّٰهُ وَلَدًا سُبْحٰنَهٗ بَلْ لَّهٗ مَا فِي السَّمٰوٰتِ وَ الْاَرْضِ كُلٌّ لَّهٗ قٰنِتُوْنَ» [ البقرۃ : ۱۱۶ ] ’’اور انھوں نے کہا اللہ نے کوئی اولاد بنا رکھی ہے، وہ پاک ہے، بلکہ اسی کا ہے جو کچھ آسمانوں اور زمین میں ہے، سب اسی کے فرماں بردار ہیں۔‘‘ اس آیت میں تین طرح سے اللہ تعالیٰ کے کسی کو اولاد بنانے کا رد ہے۔ مزید دیکھیے سورۂ بقرہ (۱۱۶)۔ ¤ ➌ { هُوَ اللّٰهُ الْوَاحِدُ :} اللہ تعالیٰ نے کسی کو اولاد بنانے کی نفی کرتے ہوئے پہلے اپنا ذاتی نام {’’ اللّٰهُ ‘‘} ذکر فرمایا، پھر اپنی صفت {’’ الْوَاحِدُ ‘‘} بیان فرمائی کہ جس کی تم اولاد بتا رہے ہو وہ انسان یا کوئی مخلوق نہیں بلکہ اللہ ہے، جو اصل میں {’’اَلْاِلٰهُ‘‘} ہے، یعنی وہ معبود ہے، باقی سب عبد ہیں۔ تو جو عبد ہے وہ اس کی اولاد کیسے ہو سکتا ہے؟ {’’ الْوَاحِدُ ‘‘} اور {’’ الْقَهَّارُ ‘‘} پر الف لام کی وجہ سے کلام میں حصر پیدا ہو گیا، یعنی وہی واحد ہے، اس کے سوا کوئی واحد نہیں، اس کا ایک ہو نا کسی کو اولاد بنانے کے منافی ہے، کیونکہ اولاد اولاد بنانے والے کی جنس ہوتی ہے، جیسا کہ انسان کسی انسان ہی کو اولاد بنا سکتا ہے، اور اللہ تعالیٰ کی کوئی جنس نہیں، کیونکہ وہ ہے ہی اکیلا، تو کوئی اس کی اولاد کیسے بن گیا؟ ¤ ➍ { الْقَهَّارُ :} اور وہی قہار ہے، اس سے اولاد کی اور ہر قسم کے شریک کی نفی ہو گئی، کیونکہ ہر چیز اس کی مقہور ہے۔ وہ سب پر قاہر اور غالب ہی نہیں بلکہ قہار اور زبردست غالب ہے، جب کہ باپ اور بیٹے کا معاملہ ایسا نہیں ہوتا۔ اگلی آیات میں اپنی وحدانیت اور قدرت و عظمت پر دلالت کرنے والی کئی اور چیزیں بیان فرمائیں۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ بِالْحَقِّ :} یعنی اس نے آسمانوں کو اور زمین کو بالکل درست اور صحیح طریقے پر بنایا ہے۔ کوئی شخص اس کی کسی چیز کو غلط نہیں کہہ سکتا اور نہ ہی اس سے بہتر پیش کر سکتا ہے، اور اس نے انھیں خاص مقصد اور مصلحت کے لیے پیدا فرمایا ہے۔ مزید دیکھیے سورۂ انعام (۷۳)، یونس (۵)، حجر (۸۵) اور نحل (۳)۔ ¤ ➋ { يُكَوِّرُ الَّيْلَ عَلَى النَّهَارِ … : ’’كَوْرُ الْعِمَامَةِ وَ تَكْوِيْرُهَا‘‘} پگڑی لپیٹنا۔ اس آیت میں زمین کے گول ہونے کا بھی اشارہ ہے، یعنی جس طرح سر پر پگڑی لپیٹی جاتی ہے کہ اس کے ایک پیچ کے اوپر دوسرا پیچ آ جاتا ہے، جو پہلے پیچ کو چھپا لیتا ہے، اسی طرح اللہ تعالیٰ زمین کے اوپر رات کو کسی وقفے کے بغیر دن پر لپیٹتا ہے، جیسے جیسے رات کا پیچ آگے بڑھتا ہے روشنی چھپتی جاتی ہے اور تاریکی پھیلتی جاتی ہے، اس کے پیچھے دن کا پیچ سورج کی صورت میں پھیلتا چلا آتا ہے، جس سے رات کی تاریکی چھپ کر روشنی پھیلتی جاتی ہے۔ دیکھیے سورۂ اعراف (۵۴)۔ ¤ ➌ { وَ سَخَّرَ الشَّمْسَ وَ الْقَمَرَ … :} اس کی تفسیر کے لیے دیکھیے سورۂ رعد (۲)۔ ¤ ➍ { اَلَا هُوَ الْعَزِيْزُ الْغَفَّارُ :} لفظ {’’ اَلَا ‘‘} اس مقصد کے لیے ہے کہ اس آیت کے مضمون پر خوب غور کرو اور اس پر خاص توجہ دو۔ {’’ الْعَزِيْزُ ‘‘} یعنی وہ جس نے آسمان و زمین کو حق کے ساتھ پیدا فرمایا، جو رات کو دن پر لپیٹتا اور دن کو رات پر لپیٹتا ہے، وہی سب پر غالب ہے، کسی میں طاقت نہیں کہ وہ جو کرنا چاہے اسے روک دے اور جسے روکنا چاہے وہ کر گزرے۔ {’’ الْغَفَّارُ ‘‘ } یعنی اتنے غلبے اور قوت کے باوجود اس نے اپنے نافرمانوں کو جو مہلت دے رکھی ہے اس کی وجہ یہ ہے کہ وہ بے پناہ غلبے کے ساتھ ساتھ بندوں کے گناہوں پر نہایت پردہ ڈالنے والا اور بے حد بخشنے والا بھی ہے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { خَلَقَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ … :} اس کی تفسیر کے لیے دیکھیے سورۂ نساء کی پہلی آیت۔ ¤ ➋ { وَ اَنْزَلَ لَكُمْ مِّنَ الْاَنْعَامِ ثَمٰنِيَةَ اَزْوَاجٍ:} یہ بھی اللہ تعالیٰ کی وحدانیت اور قدرت و عظمت کی دلیل ہے۔ تفصیل کے لیے دیکھیے سورۂ انعام (۱۴۳، ۱۴۴) جانوروں کی آٹھ قسمیں پیدا کرنے کے لیے {’’ اَنْزَلَ ‘‘} (اتارا) کا لفظ یہ توجہ دلانے کے لیے ہے کہ تمھیں ملنے والی نعمتیں اللہ تعالیٰ ہی کی طرف سے آتی ہیں، جیسا کہ فرمایا : « وَ فِي السَّمَآءِ رِزْقُكُمْ وَ مَا تُوْعَدُوْنَ» [الذاریات : ۲۲ ] ’’اور آسمان ہی میں تمھارا رزق ہے اور وہ بھی جس کا تم وعدہ دیے جاتے ہو۔‘‘ بے شمار جانوروں میں سے خاص طور پر ان جانوروں کا ذکر اس لیے فرمایا کہ زیادہ تر یہی جانور لوگوں کے کھانے پینے، پہننے اور دوسری ضروریات میں استعمال ہوتے ہیں۔ لوہا بھی چونکہ انسانی ضروریات میں بنیادی حیثیت رکھتا ہے، اس کے لیے بھی یہی الفاظ استعمال فرمائے : « وَ اَنْزَلْنَا الْحَدِيْدَ فِيْهِ بَاْسٌ شَدِيْدٌ وَّ مَنَافِعُ لِلنَّاسِ» [ الحدید : ۲۵ ] ’’اور ہم نے لوہا اتارا جس میں سخت لڑائی (کا سامان) ہے اور لوگوں کے لیے بہت سے فائدے ہیں۔‘‘ ¤ ➌ { يَخْلُقُكُمْ فِيْ بُطُوْنِ اُممَّهٰتِكُمْ خَلْقًا مِّنْۢ بَعْدِ خَلْقٍ:} ایک پیدائش کے بعد دوسری پیدائش سے مراد نطفے سے لے کر مکمل انسان تک کے سارے مراحل ہیں۔ دیکھیے سورۂ مومنون (۱۲ تا ۱۴)۔ ¤ ➍ { فِيْ ظُلُمٰتٍ ثَلٰثٍ :} اس سے مراد پیٹ کی تاریکی، رحم کی تاریکی اور اس جھلی کی تاریکی ہے جو بچے کے اوپر لپٹی ہوتی ہے۔ ماؤں کے پیٹوں میں اتنی تاریکیوں کے اندر تمھاری مختلف مرحلوں میں پیدائش، وہیں تمھارے لیے ہر ضرورت مہیا کرنا اور ہر صدمے اور چوٹ سے محفوظ رکھنا، پھر خیریت سے اس دنیا میں لے آنا اس ذات واحد ہی کی کاری گری ہے۔ مزید دیکھیے سورۂ مرسلات (۲۰ تا ۲۳) اور سورۂ عبس (۱۷ تا ۲۰)۔ ¤ ➎ { ذٰلِكُمُ اللّٰهُ رَبُّكُمْ … :} یعنی جب تمھارا رب اللہ تعالیٰ ہے اور سب بادشاہی اسی کی ہے تو لازماً تمھارا الٰہ (معبود) بھی وہی ہے۔ اس کے سوا کوئی اور کس طرح الٰہ ہو سکتا ہے، جو نہ تمھارا خالق، نہ مالک، نہ پروردگار، نہ بادشاہ اور نہ ہی اس کا ان کاموں میں کوئی حصہ، پھر تم ایسے معبود بنا کر کس طرح اور کدھر پھیرے جاتے ہو؟ معلوم ہوا انسان کی اصل فطرت توحید کا عقیدہ ہے۔ اس سے ہٹانے والا شیطان ہوتا ہے یا دوسرے لوگ جو اسے غلط راستے کی طرف پھیر دیتے ہیں۔ اس میں آدمی کی غیرت کو ابھارا ہے کہ اپنی عقل اور اپنی مرضی استعمال کرنے کے بجائے اندھا دھند دوسروں کے کہنے پر غلط راستے پر جا رہے ہو، کچھ تو سوچو کہ تمھیں سیدھے راستے سے کس طرح ہٹایا اور کدھر کو لے جایا جا رہا ہے؟"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { اِنْ تَكْفُرُوْا فَاِنَّ اللّٰهَ غَنِيٌّ عَنْكُمْ :} کفر کا معنی ناشکری بھی ہے اور انکار بھی، یعنی اگر تم اللہ کی نعمتوں کی ناشکری کرو، جن کا اوپر ذکر ہوا ہے، یا ایمان کے بجائے کفر اختیار کرو تو یقینا اللہ تم سے بہت بے پروا ہے، وہ تمھارا کسی طرح بھی محتاج نہیں، نہ اسے تمھارے شکر یا ایمان کا کوئی فائدہ ہے اور نہ تمھاری نا شکری یا کفر کا کوئی نقصان، تم ہی ہر طرح سے اس کے محتاج ہو۔ مزید دیکھیے سورۂ ابراہیم (۸)۔ ¤ ➋ { وَ لَا يَرْضٰى لِعِبَادِهِ الْكُفْرَ :} ہاں، وہ اپنے بندوں کے لیے کفر اور ناشکری کو پسند نہیں کرتا۔ یہاں یہ بات قابل غور ہے کہ یہ کہنے کے بجائے کہ {’’وَلَا يَرْضٰي لَكُمُ الْكُفْرَ‘‘} (وہ تمھارے لیے ناشکری کو پسند نہیں کرتا) یہ فرمایا کہ وہ اپنے عباد (بندوں) کے لیے ناشکری کو پسند نہیں کرتا۔ مطلب یہ ہے کہ کوئی بھی مالک اپنے غلاموں کی ناشکری کو پسند نہیں کرتا، تم اپنے متعلق سوچ لو، کیا تم اپنے کسی غلام کی ناشکری اور بغاوت کو پسند کرو گے، حالانکہ غلام تمھارے جیسے انسان ہیں، تو اللہ اپنے غلاموں کی ناشکری اور کفر کو کیسے پسند فرمائے گا، جب کہ وہ اس کے پیدا کیے ہوئے اور ہر طرح سے اس کے محتاج ہیں؟ ¤ ➌ یہاں یہ بات یاد رکھنی چاہیے کہ اللہ تعالیٰ کی مشیّت اور ارادہ اور چیز ہے اور اس کی رضا اور پسند دوسری چیز ہے۔ دنیا میں کوئی بھی کام اس کی مشیّت اور ارادے کے بغیر نہیں ہو سکتا، مگر اس نے انسانوں کو اور جنّوں کو ایک حد تک اختیار دیا ہے، وہ چاہیں تو اس کی نعمتوں کا شکر ادا کرتے ہوئے اس پر ایمان لائیں اور اس کے احکام پر عمل کریں، یا چاہیں تو ناشکری کرتے ہوئے اس کے ساتھ کفر کریں اور اس کے احکام کی نافرمانی کریں۔ یہ اختیار دینے میں اس کی بے شمار حکمتیں ہیں، جن میں سے ایک بندوں کی آزمائش ہے، مگر وہ یہ پسند نہیں کرتا کہ اس کے بندے ہو کر وہ اس کی ناشکری اور نافرمانی کریں۔ مثلاً ابلیس اور تمام کفار کا کفر اس کی مشیّت اور ارادے کے ساتھ ہی ہے، وہ اللہ سے زبردست ہو کر نہیں بلکہ اس کے دیے ہوئے اختیار ہی کی وجہ سے کفر کر رہے ہیں، مگر اللہ تعالیٰ کو ان کا کفر کرنا پسند نہیں ہے۔ ¤ ➍ {وَ اِنْ تَشْكُرُوْا يَرْضَهُ لَكُمْ: ’’ يَرْضَههُ ‘‘} اصل میں {’’يَرْضَاهُ‘‘} ہے، {’’ اِنْ تَشْكُرُوْا ‘‘} شرط کی جزا ہونے کی وجہ سے اس پر جزم آئی، جس سے ’’الف‘‘ گر گیا۔{ ’’هٗ‘‘} ضمیر {’’ تَشْكُرُوْا ‘‘} کے ضمن میں پائے جانے والے شکر کی طرف جا رہی ہے، یعنی اگر تم شکر کرو تو اللہ تعالیٰ اس شکر کو تمھارے لیے پسند فرمائے گا۔ ¤ ➎ { وَ لَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰى :} یعنی تم میں سے ہر شخص اپنے اعمال کا خود ذمہ دار ہے، کسی دوسرے شخص کے کہنے پر یا اسے راضی رکھنے کے لیے اگر کفر اختیار کرے گا تو کوئی اس کے کفر کا بوجھ نہیں اٹھائے گا۔ {’’ وَازِرَةٌ ‘‘} کے مؤنث ہونے کی وجہ جاننے اور مزید تفصیل کے لیے دیکھیے سورۂ فاطر کی آیت (۱۸) کی تفسیر۔ ¤ ➏ { ثُمَّ اِلٰى رَبِّكُمْ مَّرْجِعُكُمْ … :} یعنی دنیا میں تمھیں شکر یا کفر کا اختیار ہے، مگر آخر کار تم سب کو واپس اللہ کے پاس جانا ہے، جس نے تمھیں شروع میں پیدا فرمایا۔ وہ تمھیں تمھارے انھی اعمال کی خبر اور جزا دے گا جو تم کرتے رہے، یہ نہیں ہوگا کہ کسی اور کے عمل تمھارے ذمے ڈال دیے جائیں، یا تمھارے نیک یا بد اعمال غائب کر دیے جائیں۔ ¤ ➐ { اِنَّهٗ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ:} یہ اس سے پہلے جملے کی علت ہے، یعنی اللہ تعالیٰ کو تم میں سے ہر شخص کے اعمال اس کے سامنے پیش کرنا کچھ مشکل نہیں، کیونکہ وہ تو سینوں کی باتوں تک کو پوری طرح جاننے والا ہے، پھر کوئی قول یا عمل اس سے کس طرح مخفی رہ سکتا ہے؟"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { وَ اِذَا مَسَّ الْاِنْسَانَ ضُرٌّ:} اپنی وحدانیت اور کمال قدرت کے بہت سے دلائل اور انھیں دیکھنے کے بعد شکر یا کفر کرنے والوں کا انجام بیان فرمانے کے بعد اللہ تعالیٰ نے خوش حالی اور بدحالی میں انسان کی طبیعت کا ذکر فرمایا، ساتھ ہی بتا دیا کہ دونوں حالتوں میں مومن و کافر اور عالم و جاہل برابر نہیں ہیں۔ آیت میں {’’ الْاِنْسَانَ ‘‘} سے مراد کافر و مشرک ہے، کیونکہ اس کے متعلق آگے آ رہا ہے : « وَ جَعَلَ لِلّٰهِ اَنْدَادًا» کہ نعمت ملنے پر وہ اللہ کے لیے کئی شریک بنا لیتا ہے۔ جن مشرک انسانوں کا یہاں ذکر ہے وہ کم از کم مصیبت میں تو ایک اللہ کو پکارتے تھے، مگمگر ہمارے زمانے کے کئی اسلام کے دعوے دار مصیبت میں اور سمندر میں طوفان کے وقت بھی غیر اللہ کو پکارتے رہتے ہیں۔ [ إِنَّا لِلّٰہِ وَ إِنَّا إِلَیْہِ رَاجِعُوْنَ ] ¤ ➋ { دَعَا رَبَّهٗ مُنِيْبًا اِلَيْهِ :} یعنی تکلیف اور مصیبت کے وقت وہ پورے خلوص کے ساتھ اپنے رب کو پکارتا ہے، اس وقت اسے کوئی دوسرا معبود یاد نہیں رہتا، وہ سب سے مایوس ہو کر صرف اللہ تعالیٰ کی طرف رجوع کرتا ہے۔ یہ دلیل ہے کہ اس کے دل کی گہرائیوں میں یہ بات موجود ہے کہ وہ تکلیف اس کا کوئی حاجت روا یا مشکل کُشا یا داتا یا دستگیر دور نہیں کر سکتا، اسے دور کرنے والا صرف ایک اللہ ہے۔ {’’ مُنِيْبًا ‘‘} کا مطلب یہ ہے کہ وہ پہلے غیروں کو پکارتا تھا، مصیبت کے وقت سب کو چھوڑ کر واپس اللہ کی طرف آجاتا ہے۔ ¤ ➌ { ثُمَّ اِذَا خَوَّلَهٗ نِعْمَةً مِّنْهُ :} نعمت عطا فرمانے سے مراد اس تکلیف کا دور کرنا ہے۔ اس کے علاوہ کوئی بھی نعمت مراد ہو سکتی ہے۔ ¤ ➍ {نَسِيَ مَا كَانَ يَدْعُوْۤا اِلَيْهِ مِنْ قَبْلُ: ’’ اِلَيْهِ ‘‘} میں ضمیر {’’هٗ‘‘} سے مراد {’’ ضُرٌّ ‘‘} ہے۔ اس کی دلیل یہ آیت ہے : «وَ اِذَا مَسَّ الْاِنْسَانَ الضُّرُّ دَعَانَا لِجَنْۢبِهٖۤ اَوْ قَاعِدًا اَوْ قَآىِٕمًا فَلَمَّا كَشَفْنَا عَنْهُ ضُرَّهٗ مَرَّ كَاَنْ لَّمْ يَدْعُننَاۤ اِلٰى ضُرٍّ مَّسَّهٗ » [ یونس : ۱۲ ] ’’اور جب انسان کو تکلیف پہنچتی ہے تو اپنے پہلو پر یا بیٹھا ہوا یا کھڑا ہوا ہمیں پکارتا ہے، پھر جب ہم اس سے اس کی تکلیف دور کر دیتے ہیں تو چل دیتا ہے جیسے اس نے ہمیں کسی تکلیف کی طرف، جو اسے پہنچی ہو، پکارا ہی نہیں۔‘‘ ¤ ➎ { وَ جَعَلَ لِلّٰهِ اَنْدَادًا لِّيُضِلَّ عَنْ سَبِيْلِهٖ:} یعنی اللہ کی راہ (اسلام و توحید) سے وہ نہ صرف خود گمراہ ہوتا ہے بلکہ دوسروں کو بھی گمراہ کرنے کی کوشش کرتا ہے اور لوگوں سے کہتا پھرتا ہے کہ ہمیں تو فلاں آستانے سے شفا نصیب ہوئی تھی، فلاں بزرگ کی نظر کرم سے ہم مصیبت سے نکل آئے اور فلاں حضرت جی کی توجہ سے ہماری کشتی کنارے آ لگی۔ اس طرح یہ جاہل جھوٹی کہانیاں گھڑ کر بے بس اور بے اختیار مخلوق کو اللہ کا شریک بتا کر لوگوں کو گمراہ کرتا رہتا ہے۔ ¤ ➏ {قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيْلًا … :} فرمایا، اس مشرک انسان کو کہہ دے کہ اپنے کفر و شرک کے ذریعے سے لوگوں کو گمراہ کر کے حاصل ہونے والی لذتوں سے معمولی فائدہ اٹھا لے، مگر یہ بالکل تھوڑی مدت کے لیے ہے، بہت جلد یہ سب کچھ ختم ہو جائے گا اور تو آگ والوں میں شامل ہو کر ہمیشہ کے لیے جہنم میں رہنے والا ہے۔ آیت کی مزید تفسیر کے لیے دیکھیے سورۂ یونس (۱۲)۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {اَمَّنْ هُوَ قَانِتٌ اٰنَآءَ الَّيْلِ …: ’’ قَانِتٌ ‘‘} کا معنی عبادت کرنے والا بھی ہے، فرماں بردار بھی اور خشوع و عاجزی کرنے والا بھی۔ {’’ اَمَّنْ ‘‘} (یا وہ شخص) کے لفظ سے ظاہر ہے کہ اس سے پہلے کچھ الفاظ محذوف ہیں، یعنی {’’أَ هٰذَا خَيْرٌ‘‘} (کیا یہ مصیبت میں اپنے رب کو پکارنے والا اور نعمت عطا ہونے پر اسے بھول جانے والا بہتر ہے) {’’ اَمَّنْ هُوَ قَانِتٌ ‘‘} یا وہ شخص جو صرف دن کے وقت ہی نہیں بلکہ رات کی گھڑیوں میں بھی سجدے اورر قیام کے ساتھ اللہ کی عبادت کرنے والا اور ہر حال میں اسی کا فرماں بردار ہے؟ جواب ظاہر ہے کہ یہ مومن (قانت) ہر لحاظ سے اس سے بہتر ہے۔ ¤ ➋ { يَحْذَرُ الْاٰخِرَةَ وَ يَرْجُوْا رَحْمَةَ رَبِّهٖ :} ایمان اللہ تعالیٰ کے خوف اور اس سے امید کے درمیان ہے۔ انس رضی اللہ عنہ فرماتے ہیں کہ نبی صلی اللہ علیہ وسلم ایک نوجوان کے پاس گئے جو موت (کے چل چلاؤ) میں تھا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ كَيْفَ تَجِدُكَ؟ قَالَ وَاللّٰهِ! يَا رَسُوْلَ اللّٰهِ! إإِنِّيْ أَرْجُو اللّٰهَ وَ إِنِّيْ أَخَافُ ذُنُوْبِيْ  فَقَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ لَا يَجْتَمِعَانِ فِيْ قَلْبِ عَبْدٍ فِيْ مِثْلِ هٰذَا الْمَوْطِنِ إِلَّا أَعْطَاهُ اللّٰهُ مَا يَرْجُوْ وَ آمَنَهُ مِمَّا يَخا يَخَافُ ] [ ترمذي، الجنائز، باب الرجاء باللّٰہ والخوف بالذنب عند الموت : ۹۸۳ ] ’’تو اپنے آپ کو کس حال میں پاتا ہے؟‘‘ اس نے کہا : ’’اللہ کی قسم ! یا رسول اللہ! میں اللہ سے امید رکھتا ہوں اور اپنے گناہوں سے ڈرتا بھی ہوں۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اس جیسے مقام پر کسی بندے کے دل میں یہ دونوں چیزیں جمع نہیں ہوتیں مگر اللہ تعالیٰ اسے وہ چیز عطا کر دیتا ہے جس کی وہ امید رکھتا ہے اور اس چیز سے اسے امن عطا کر دیتا ہے جس سے وہ ڈرتا ہے۔‘‘ ¤ ➌ {قُلْ هَلْ يَسْتَوِي الَّذِيْنَ يَعْلَمُوْنَ … :} یہاں {’’ الَّذِيْنَ يَعْلَمُوْنَ ‘‘} (جاننے والے) ان لوگوں کو کہا گیا ہے جو دن رات، خوش حالی و بدحالی میں ہر وقت ایک اللہ ہی کی عبادت کرنے والے اور اسی کے فرماں بردار ہیں اور {’’ وَ الَّذِيْنَ لَا يَعْلَمُوْنَ ‘‘} (نہ جاننے والے) ان لوگوں کو کہا گیا ہے جو تکلیف اور مصیبت میں تمام معبودوں سے واپس پلٹ کر ایک اللہ ہی کو پکارتے ہیں، مگر خوش حالی میں اسے بھول کر اللہ تعالیٰ کے لیے کئی شریک بنا لیتے ہیں۔ اس کا مطلب یہ ہے کہ یہ جاننے کے باوجود کہ تمام اختیارات کا مالک صرف اللہ تعالیٰ ہے، نعمت عطا ہونے پر اسے بھلا دیتے ہیں اور اس کے شریک بنا لیتے ہیں، اس لیے اللہ تعالیٰ نے انھیں نہ جاننے والے قرار دیا۔ اس سے معلوم ہوا کہ جو شخص اپنے علم پر عمل نہیں کرتا وہ جاہل ({لَا يَعْلَمُ}) ہے، اسی لیے اللہ تعالیٰ نے فرمایا : « اِنَّمَا يَخْشَى اللّٰهَ مِنْ عِبَادِهِ الْعُلَمٰٓؤُا » [ فاطر : ۲۸ ] ’’اللہ سے تو اس کے بندوں میں سے صرف علماء (جاننے والے) ہی ڈرتے ہیں۔‘‘ اللہ تعالیٰ سے نہ ڈرنے والے اللہ کے نزدیک علماء نہیں، خواہ ان کے پاس کتنی ڈگریاں اور کتنے عہدے ہوں اور خواہ انھوں نے کتنی کتابیں یا کتب خانے چاٹ رکھے ہوں۔ ¤ ➍ اس آیت سے علم اور اس پر عمل کرنے والے اہلِ علم کی فضیلت ثابت ہوتی ہے۔ عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللّٰهُ الْقُرْآنَ فَهُوَ يَتْلُوْهُ آنَاءَ اللَّيْلِ وَ آنَاءَ النَّهَارِ، وَ رَجُلٌ آتَاهُ اللّٰهُ مَالًا فَهُوَ يُنْفِقُهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ ] [ بخاري، التوحید، باب قول النبي صلی اللہ علیہ وسلم: رجل آتاہ اللّٰہ القرآن… : ۷۵۲۹ ] ’’دو چیزوں کے سوا رشک کرنا درست نہیں، ایک وہ آدمی جسے اللہ تعالیٰ نے قرآن دیا تو وہ رات کی گھڑیوں میں اور دن کی گھڑیوں میں اس کی تلاوت کرتا ہے، اور ایک وہ آدمی جسے اللہ تعالیٰ نے کھلا مال عطا کیا ہے تو وہ رات کی گھڑیوں اور دن کی گھڑیوں میں اسے خرچ کرتا ہے۔‘‘ امام بخاری رحمہ اللہ نے {’’بَابُ فَضْلِ الْعِلْمِ‘‘} میں علم کی فضیلت میں دو آیات نقل فرمائی ہیں، ایک سورۂ مجادلہ کی : «يَرْفَعِ اللّٰهُ الَّذِيْنَ اٰمَنُوْا مِنْكُمْ وَ الَّذِيْنَ اُوْتُوا الْعِلْمَ دَرَجٰتٍ » [ المجادلۃ : ۱۱ ] ’’اللہ ان لوگوں کو درجوں میں بلند کرے گاجو تم میں سے ایمان لائے اور جنھیں علم دیا گیا۔‘‘ اور دوسری سورۂ طٰہٰ کی : « وَ قُلْ رَّبِّ زِدْنِيْ عِلْمًا » [ طٰہٰ : ۱۱۴ ] ’’اور کہہ اے میرے رب! مجھے علم میں زیادہ کر۔‘‘ موسیٰ اور خضر علیھما السلام کا واقعہ بھی علم کی فضیلت کی دلیل ہے۔ (دیکھیے بخاری : ۷۴) ¤ ➎ { اِنَّمَا يَتَذَكَّرُ اُولُوا الْاَلْبَابِ : ’’ الْاَلْبَابِ ‘‘ ’’لُبٌّ‘‘} کی جمع ہے، مغز، عقل۔ جمع ہونے کی وجہ سے ترجمہ ’’عقلوں والے‘‘ کیا گیا ہے۔ ان عقلوں والوں سے مراد اہلِ ایمان ہیں نہ کہ کفار، گو وہ اپنے آپ کو کس قدر عقل و دانش والے سمجھتے ہوں، کیونکہ جب وہ اپنی عقلوں کو استعمال کر کے نصیحت حاصل ہی نہیں کرتے تو عقلوں والے کیسے ہوئے!؟ ایسے لوگوں کو اللہ تعالیٰ نے چوپاؤں کی طرح بلکہ ان سے بھی {’’اضل‘‘} قرار دیا ہے۔ دیکھیے سورۂ اعراف (۱۷۹) اور انبیاء (۴۶) کی تفسیر۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ { قُلْ يٰعِبَادِ الَّذِيْنَ اٰمَنُوا اتَّقُوْا رَبَّكُمْ:} سورت کے شروع سے توحید کا بیان آرہا ہے، اب بڑی محبت کے ساتھ ایمان والوں کو ’’میرے بندو‘‘ کہہ کر انھیں یہ پیغام دینے کا حکم دیا کہ صرف زبان سے توحید کا اقرار کافی نہیں، بلکہ اپنے رب کا تقویٰ اختیار کرو۔ {’’تَقْوٰي‘‘ ’’وَقٰي يَقِيْ وِقَايَةً‘‘} کا مصدر ہے، اس کا لفظی معنی ’’بچنا‘‘ ہے، مراد ایسے تمام کام چھوڑ دینا ہے جن کے کرنے سے اللہ تعالیٰ کے عذاب کا ڈر ہے اور ایسے تمام کام کرنا جن کے چھوڑنے سے اس کے عذاب کا ڈر ہے۔ یعنی اللہ تعالیٰ کے احکام کی پابندی کرو اور اس کی نافرمانی سے اجتناب کرو۔ ¤ ➋ { لِلَّذِيْنَ اَحْسَنُوْا فِيْ هٰذِهِ الدُّنْيَا حَسَنَةٌ: ’’ حَسَنَةٌ ‘‘} میں تنوین تعظیم کے لیے ہے۔{’’ فِيْ هٰذِهِ الدُّنْيَا ‘‘} کا تعلق{’’ اَحْسَنُوْا ‘‘} کے ساتھ ہے، یعنی جن لوگوں نے اس دنیا میں نیک اعمال کیے ان کے لیے عظیم بھلائی ہے۔ اس بھلائی سے مراد دنیا کی بھلائی بھی ہے اور آخرت کی بھلائی بھی، کیونکہ رسول صلی اللہ علیہ وسلم کی اکثر دعا یہ تھی : [اَللّٰهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً وَّ فِي الْآخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ ] [ بخاري، الدعوات، باب قول النبي صلی اللہ علیہ وسلم ربنا … : ۶۳۸۹ ] ’’اے اللہ! ہمیں اس دنیا میں بھلائی عطا فرما اور آخرت میں بھلائی عطا فرما اور ہمیں آگ کے عذاب سے بچانا۔‘‘ مزید دیکھیے سورۂ بقرہ (۲۰۱) کی تفسیر۔ دنیا اور آخرت دونوں میں اس بھلائی کی تفصیل کے لیے سورۂ نحل (۹۷) کی تفسیر ملاحظہ فرمائیں۔ ¤ ➌ {وَ اَرْضُ اللّٰهِ وَاسِعَةٌ:} یہ ہجرت کی طرف اشارہ ہے۔ یعنی اگر کسی جگہ تم اللہ کے تقویٰ پر کار بند نہیں رہ سکتے اور اللہ کے دین پر عمل کرنے میں کوئی رکاوٹ ہے تو اللہ کی زمین وسیع ہے، کسی دوسری جگہ چلے جاؤ، جہاں آزادی سے اللہ کے احکام پر عمل کر سکو۔ اس جملے کی مفصل تفسیر کے لیے سورۂ نساء کی آیات (۹۷ تا ۱۰۰) اور ان کی تفسیر ملاحظہ فرمائیں۔ ¤ ➍ { اِنَّمَا يُوَفَّى الصّٰبِرُوْنَ اَجْرَهُمْ بِغَيْرِ حِسَابٍ:} صبر کا لفظی معنی باندھنا ہے۔ اہلِ علم نے صبر کی تین قسمیں بیان فرمائی ہیں، اللہ تعالیٰ کے احکام کی پابندی پر صبر، اس کی منع کر دہ چیزوں سے اجتناب پر صبر اور پیش آنے والی تکلیفوں اور مصیبتوں پر صبر۔ صابر وہ ہے جس کی خصلت ہی صبر ہو۔ فرمایا، جن لوگوں کی خصلت صبر ہے، صرف یہی لوگ ہیں جنھیں ان کا اجر کسی حساب کے بغیر دیا جائے گا۔ اس میں ہجرت کے دوران پیش آنے والی تکالیف پر صبر کی تلقین ہے اور اس پر بے حساب اجر کی بشارت ہے۔ بغیر حساب اجر سے مراد جنت ہے، کیونکہ وہ ہمیشہ رہنے والی ہے۔ دنیا کی ہر نعمت خواہ کتنی ہو ختم ہونے والی ہے اور ختم ہونے والی ہر چیز کا حساب ہو سکتا ہے، جیسا کہ فرمایا : « وَ مَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُنْثٰى وَ هُوَ مُؤْمِنٌ فَاُولٰٓىِٕكَ يَدْخُلُوْنَ الْجَنَّةَ يُرْزَقُوْنَ فِيْهَا بِغَيْرِ حِسَابٍ» [ المؤمن : ۴۰ ] ’’اور جس نے کوئی نیک عمل کیا، مرد ہو یا عورت اور وہ مومن ہوا تو یہ لوگ جنت میں داخل ہوں گے، اس میں بے حساب رزق دیے جائیں گے۔‘‘"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) { قُلْ اِنِّيْۤ اُمِرْتُ اَنْ اَعْبُدَ اللّٰهَ …:} سورت کے شروع میں اللہ تعالیٰ نے فرمایا : « فَاعْبُدِ اللّٰهَ مُخْلِصًا لَّهُ الدِّيْنَ » [الزمر : ۲ ] اب نبی صلی اللہ علیہ وسلم کو حکم دیا کہ کہہ دے مجھے تو یہ حکم دیا گیا ہے کہ میں اللہ کی عبادت کروں، اس حال میں کہ اپنی بندگی، اطاعت اور نیت کو اسی کے لیے خالص کرنے والا ہوں۔ تفصیل اسی سورت کی آیت (۲) میں دیکھیے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { وَ اُمِرْتُ لِاَنْ اَكُوْنَ اَوَّلَ الْمُسْلِمِيْنَ : ’’ لِاَنْ اَكُوْنَ ‘‘} میں لام ’’باء‘‘ کے معنی میں ہے : {’’أَيْ أُمِرْتُ بِأَنْ أَكُوْنَ أَوَّلَ الْمُسْلِمِيْنَ‘‘} یعنی اللہ کا پیغام پہنچانے والے کی حیثیت سے میرا کام صرف یہ نہیں کہ اس کا پیغام پہنچا دوں، بلکہ مجھے حکم ہے کہ اس کی فرماں برداری کرنے والوں میں سب سے پہلا فرماں بردار میں بنوں۔ میں ان جابر بادشاہوں کی طرح نہ بنوں جو لوگوں کو کئی کاموں کا حکم دیتے ہیں، مگر خود وہ کام نہیں کرتے، بلکہ میں تمھیں اللہ کے جو احکام پہنچاؤں، سب سے پہلے خود ان پر عمل کروں۔ ¤ ➋ { ’’ لِاَنْ اَكُوْنَ ‘‘} میں ’’لام‘‘ علت بیان کرنے کے لیے بھی ہو سکتا ہے، اس صورت میں دونوں آیات کا ترجمہ اس طرح ہو گا، کہہ دے مجھے تو حکم دیا گیا ہے کہ میں اللہ کی عبادت کروں، اس حال میں کہ دین کو اسی کے لیے خالص کرنے والا ہوں اور مجھے یہ حکم اس لیے دیا گیا ہے کہ میں تمام مسلمانوں میں سب سے پہلا بنوں (کیونکہ دین میں پیش قدمی اخلاص ہی سے حاصل ہوتی ہے)۔ مفسر ابو السعود نے کہا : {’’وَ أُمِرْتُ بِذٰلِكَ لِأَجَلِ أَنْ أَكُوْنَ مُقَدِّمَهُمْ فِي الدُّنْيَا وَالْآخِرَةِ لِأَنَّ إِحْرَازَ قَصَبِ السَّبْقِ فِي الدِّيْنِ بِالْإِخْلَاصِ فِيْهِ ‘‘}"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) { قُلْ اِنِّيْۤ اَخَافُ اِنْ عَصَيْتُ رَبِّيْ … :} یعنی اے پیغمبر ! کہہ دے اگر میں اپنے رب کی نافرمانی کروں اور اپنی عبادت اور اطاعت اس کے لیے خالص کرنے کے بجائے تمھاری طرح اس کا کوئی شریک بنا لوں تو میں ایک بہت بڑے دن کے عذاب سے ڈرتا ہوں۔ مطلب یہ کہ میرے جیسا شخص بھی ( جسے اللہ تعالیٰ نے سید ولد آدم بنایا، جس کے اگلے پچھلے سارے گناہ معاف فرما دیے) اگر اللہ کی نافرمانی کرتے ہوئے شرک کا ارتکاب کر بیٹھے، تو اس عظیم دن کے عذاب سے ڈرتا ہے، تو اپنے متعلق تم خود سوچ لو۔ تفصیل سورۂ زمر (۶۴، ۶۵) اور سورۂ انعام (۱۴، ۱۵ اور ۸۱ تا ۸۸) کی تفسیر میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) {قُلِ اللّٰهَ اَعْبُدُ …:} لفظ {’’ اللّٰهَ ‘‘} کو پہلے لانے سے کلام میں حصر پیدا ہوگیا، یعنی کہہ دے میں تو صرف اللہ کی عبادت کرتا ہوں، کسی اور کی عبادت نہ اسے اصل سمجھ کر کرتا ہوں نہ سفارشی یا واسطہ سمجھ کر۔ پچھلی آیت : « قُلْ اِنِّيْۤ اُمِرْتُ اَنْ اَعْبُدَ اللّٰهَ …» میں ایک اللہ کی عبادت کے امر کا اعلان کرنے کا حکم دیا گیا تھا، اس آیت میں اس پر اپنے عمل کے اعلان کا حکم دیا گیا ہے، اس لیے تکرار نہیں ہے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { فَاعْبُدُوْا مَا شِئْتُمْ مِّنْ دُوْنِهٖ :} اس میں ایک تو شرک اور مشرکین سے علیحدگگی اور براء ت کا اعلان ہے کہ تم اللہ کے سوا جس کی چاہو عبادت کرو، مجھ سے یہ توقع ہر گز نہ رکھو۔ سورۂ کافرون میں یہی مضمون تفصیل سے بیان ہوا ہے۔ دوسرے اس میں مشرکین کو دھمکی دی گئی ہے کہ اگر میرے سمجھانے کے باوجود تم ان جھوٹے معبودوں کی بندگی پر ڈٹے ہوئے ہو تو ڈٹے رہو، مگر سزا بھگتنے پر بھی تیار رہو۔ تمھارے انجام کی ذمہ داری مجھ پر نہیں۔ ¤ ➋ {قُلْ اِنَّ الْخٰسِرِيْنَ الَّذِيْنَ خَسِرُوْۤا اَنْفُسَهُمْ …: ’’ الْخٰسِرِيْنَ ‘‘} میں الف لام کمال کے معنی کے لیے ہے، یعنی کامل اور اصل خسارے والے وہ ہیں۔ آدمی کو اپنی جان اور گھر والے سب سے زیادہ عزیز ہوتے ہیں۔ فرمایا، کہہ دے اصل خسارے والے لوگ وہ ہیں جنھوں نے شرک کرکے اور شرک کی تعلیم دے کر قیامت کے دن اپنے آپ کو اور اپنے گھر والوں کو جہنم کا ایندھن بنایا، کیونکہ دنیا کے خسارے کا تومداوا ہو سکتا ہے مگر قیامت کے دن کے خسارے کا کوئی مداوا نہیں۔ ¤ ➌ { اَلَا ذٰلِكَ هُوَ الْخُسْرَانُ الْمُبِيْنُ:} مشرکین کی غباوَت اور کند ذہنی کو مد نظر رکھ کر ایک دفعہ پھر صاف لفظوں میں ان کے واضح خسارے کا اظہار فرمایا، تاکہ کسی جملے ہی سے وہ توحید کی طرف پلٹ آئیں۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {لَهُمْ مِّنْ فَوْقِهِمْ ظُلَلٌ مِّنَ النَّارِ …:’’ ظُلَلٌ ‘‘ ’’ظُلَّةٌ‘‘} کی جمع ہے، سائبان، چھَتر، ڈھانپنے یا سایہ کرنے والی کوئی چیز، جس کی دیواریں نہ ہوں، جیساکہ فرمایا : « وَ اِذَا غَشِيَهُمْ مَّوْجٌ كَالظُّلَلِ » [ لقمان : ۳۲ ]’’اور جب انھیں سائبانوں جیسی کوئی موج ڈھانپ لیتی ہے۔‘‘ یعنی ان کے اوپر اور نیچے ہر طرف آگ کے سائبان ہوں گے۔ نیچے والی آگ کی لپٹوں کو سائبان اس لیے کہا گیا کہ وہ کچھ اور لوگوں کے اوپر ہوں گی، کیونکہ جہنم میں کئی طبقے ہیں، جنھیں دَرکات کہا جاتا ہے، جیساکہ اللہ تعالیٰ نے فرمایا : «اِنَّ الْمُنٰفِقِيْنَ فِي الدَّرْكِ الْاَسْفَلِ  مِنَ النَّارِ » [ النساء : ۱۴۵ ] ’’بے شک منافق لوگ آگ کے سب سے نچلے درجے میں ہوں گے۔‘‘ یہ بھی ہو سکتا ہے کہ آگ کی لپٹوں کو نیچے سے اوپر اٹھنے کی وجہ سے سائبان کہا گیا ہو۔ دوسری آیت میں نیچے والی آگ کو ان کے بچھونے اور اوپر والی آگ کو ان کے لحاف بتایا ہے، فرمایا : « لَهُمْ مِّنْ جَهَنَّمَ مِهَادٌ وَّ مِنْ فَوْقِهِمْ غَوَاشٍ » [ الأعراف : ۴۱ ] ’’ان کے لیے جہنم ہی کا بچھونا اور ان کے اوپر کے لحاف ہوں گے۔‘‘ اور ایک آیت میں فرمایا : « يَوْمَ يَغْشٰىهُمُ الْعَذَابُ مِنْ فَوْقِهِمْ وَ مِنْ تَحْتِ اَرْجُلِهِمْ » [ العنکبوت : ۵۵ ] ’’جس دن عذاب انھیں ان کے اوپر سے اور ان کے پاؤں کے نیچے سے ڈھانپ لے گا۔‘‘ اللہ ہمیں اپنی پناہ میں رکھے۔ ¤ ➋ { ذٰلِكَ يُخَوِّفُ اللّٰهُ بِهٖ عِبَادَهٗ … :} یعنی یہ قیامت کا خسارہ اور آگ کے سائبان ہیں جن کے ساتھ اللہ اپنے بندوں کو ڈراتا ہے، تو اے میرے بندو! مجھ سے ڈر جاؤ اور ہمیشہ ڈرتے رہو۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {وَ الَّذِيْنَ اجْتَنَبُوا الطَّاغُوْتَ …:’’ الطَّاغُوْتَ ‘‘} کی لغوی تشریح کے لیے دیکھیے سورۂ بقرہ کی آیت (۲۵۶)۔ استاذ محمد عبدہ لکھتے ہیں، اصل میں لفظ {’’ الطَّاغُوْتَ ‘‘ } (بروزن {فَعْلُوْتٌ لَا فَاعُوْلٌ أَصْلُهُ طَغْيُوْتٌ أَوْ طَغْوُوْتٌ}) {’’طُغْيَانٌ‘‘} سے مشتق ہے، لہٰذا اس سے مراد شیطان بھی ہے اور بت بھی اور ہر وہ انسان بھی جو بندگی کی حد سے نکل کر اپنے آپ کو خدائی کے مقام پر رکھتا ہو۔ اس کی عبادت سے مراد محض اسے سجدہ کرنا نہیں بلکہ اسے مستقل بالذات آمر و مطاع سمجھتے ہوئے اس کے احکام کی بجاآوری بھی ہے۔ جوہری لکھتے ہیں : {’’اَلطَّاغُوْتُ الْكَاهِنُ وَالشَّيْطَانُ وَ كُلُّ رَأْسٍ فِي الضَّلَالِ‘‘} کہ اس سے مراد شیطان، کاہن اور ہر وہ چیز ہے جو گمرراہی کا منبع بنے۔ امام راغب کہتے ہیں : {’’ هُوَ عِبَارَةٌ عَنْ كُلِّ مَعْبُوْدٍ مِنْ دُوْنِ اللّٰهِ‘‘} کہ وہ ہر اس چیز سے عبارت ہے جس کی اللہ کے سوا عبادت کی جائے۔ (روح) (اشرف الحواشی) ¤ ➋ معلوم ہوا توحید کے لیے صرف اللہ کی عبادت کافی نہیں بلکہ طاغوت سے کنارا کشی بھی لازم ہے، اس لیے کلمہ توحید {’’لَا اِلٰهَ إِلَّا اللّٰهُ‘‘} میں پہلے تمام الٰہوں کی نفی ہے، پھر ایک اللہ کی عبادت کا اثبات ہے۔ ¤ ➌ { لَهُمُ الْبُشْرٰى :} اس کی تفسیر کے لیے دیکھیے سورۂ یونس کی آیت (۶۴)۔ ¤ ➍ { لَهُمُ الْبُشْرٰى …: ’’ عِبَادِ ‘‘} اصل میں {’’عِبَادِيْ‘‘} ہے، آیات کے فواصل کی مناسبت کے لیے یاء کو حذف کر کے دال پر کسرہ باقی رکھا گیا ہے اور ترجمہ ’’میرے بندوں کو‘‘ کیا گیا ہے۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ {الَّذِيْنَ يَسْتَمِعُوْنَ الْقَوْلَ فَيَتَّبِعُوْنَ اَحْسَنَهٗ :} اس جملے کی تین تفسیریں ہیں، ایک یہ کہ میرے ان بندوں کو بشارت دے جو ہر بات سنتے ہیں، مگر پیروی صرف قرآن و سنت کی کرتے ہیں، کیونکہ سب باتوں سے اچھی بات اللہ کی نازل کردہ بات ہے، جیسا کہ آگے آیت (۲۳) میں آ رہا ہے : « اَللّٰهُ نَزَّلَ اَحْسَنَ الْحَدِيْثِ» ’’اللہ نے سب سے اچھی بات نازل فرمائی۔‘‘ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَحْسَنُ الْكَلاَمِ كَلاَمُ اللّٰهِ وَ أَحْسَنُ الْهَدْيِ هَدْيُ مُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ ] [ نسائي، السھو، باب نوع من الذکر بعد التشھد : ۱۳۱۲، عن جابر رضی اللہ عنہ ] ’’ہر کلام سے اچھا اللہ کا کلام ہے اور ہر طریقے سے اچھا محمد صلی اللہ علیہ وسلم کا طریقہ ہے۔‘‘ دوسری تفسیر یہ ہے کہ وہ قرآن سنتے ہیں جس میں کچھ احکام حسن (اچھے) ہیں اور کچھ اَحسن (زیادہ اچھے) ہیں، پھر وہ احسن کی پیروی کرتے ہیں۔ مثلاً قصاص لینا یا معاف کر دینا، زیادتی پر انتقام لینا یا صبر کرنا، قرض وصول کرنے میں مہلت دینا یا چھوڑ دینا، اگرچہ تینوں معاملات میں مذکور دونوں کام اچھے ہیں، مگر دوسرا کام پہلے سے زیادہ اچھا ہے۔ تیسری تفسیر یہ ہے کہ وہ اچھی بری سبھی باتیں سنتے ہیں، مگر کرتے وہی بات یا وہی کام ہیں جو سب سے اچھا ہو۔ ابن عطیہ نے ’’المحرر الوجیز‘‘ میں فرمایا : {’’هُوَ عَامٌّ فِيْ جَمِيْعِ الْأَقْوَالِ وَالْقَصْدُ الثَّنَاءُ عَلٰی هٰؤُلَاءِ بِبَصَائِرَ وَ نَظْرٍ سَدِيْدٍ يُفَرِّقُوْنَ بِهِ بَييْنَ الْحَقِّ وَ الْبَاطِلِ وَ بَيْنَ الصَّوَابِ وَالْخَطَإِ فَيَتَّبِعُوْنَ الْأَحْسَنَ مِنْ ذٰلِكَ‘‘} ’’یہ تمام اقوال کے لیے عام ہے، مقصد ان لوگوں کی بصیرتوں اور درست غور و فکر کی تعریف ہے جس کے ساتھ وہ حق و باطل اور درست اور خطا کے درمیان فیصلہ کرتے ہیں، پھر اس میں سے احسن کی پیروی کرتے ہیں۔‘‘ الفاظ عام ہونے کی وجہ سے تیسری تفسیر زیادہ ظاہر ہے۔ ¤ ➋{ اُولٰٓىِٕكَ الَّذِيْنَ هَدٰىهُمُ اللّٰهُ …:} ہر قسم کے اقوال سن کر سب سے اچھی بات کی جستجو کر کے اس پر عمل کرنے والوں ہی کو اللہ تعالیٰ نے وہ لوگ قرار دیا جنھیں اس نے ہدایت دی اور صرف انھی کو عقلوں والے قرار دیا۔ ¤ ➌ اس آیت سے تقلید کی واضح تردید ہو رہی ہے، کیونکہ تقلید کا معنی ہے : {’’أَخْذُ قَوْلِ الْغَيْرِ بِلَا دَلِيْلٍ‘‘} یعنی اللہ اور اس کے رسول کے غیر کی بات بلا دلیل لے لینا۔ مقلد اپنے بنائے ہوئے پیشوا کے علاوہ اوّل تو کسی کی بات سننے پر آمادہ ہی نہیں ہوتا، اگر سن بھی لے تو اپنے پیشوا کی بات پر جما رہتا ہے۔ دوسری بات خواہ قرآن مجید کی آیت ہو یا رسول اللہ صلی اللہ علیہ وسلم کی حدیث ہو اور خواہ وہ کتنی ہی اچھی ہو، نہ سمجھنے کی کوشش کرتا ہے نہ مانتا ہے۔ جب کہ مومن ہر بات غور سے سن کر اس کے حسن و قبح کی جانچ پڑتال کرتا ہے اور احسن پر عمل کرتا ہے۔ جہنم میں جانے والے تمنا کریں گے کہ کاش! وہ دنیا میں سنتے یا سمجھتے ہوتے، مگر اس وقت جب ان کی تمنا پوری ہونے کی کوئی صورت نہ ہو گی، فرمایا : « وَ قَالُوْا لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ مَا كُنَّا فِيْۤ اَصْحٰبِ السَّعِيْرِ » [ الملک : ۱۰ ] ’’اور وہ کہیں گے، اگر ہم سنتے ہوتے یا سمجھتے ہوتے تو بھڑکتی ہوئی آگ والوں میں نہ ہوتے۔‘‘ ایسے لوگ نہ اللہ کی طرف سے ہدایت یافتہ ہیں اور نہ ان کا شمار ’’اولوا الالباب‘‘ میں ہو سکتا ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) { اَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِ …:} تو کیا وہ شخص جس (کے شیطان کی پیروی اور کفر پر اصرار اور ضد اور عناد کی وجہ سے اس) پر عذاب کی بات ثابت ہو چکی اور جسے اللہ تعالیٰ آگ میں ڈالنے کا فیصلہ فرما چکا (دیکھیے سورۂ ص : ۸۵) تو اے نبی! کیا تو اسے بچالے گا جو آگ میں ہے؟ نہیں! تو ہر گز نہیں بچا سکے گا۔ پھر جسے تو نہ بچا سکا تو اور کون ہے جو اسے آگ سے بچا سکے گا؟ اس میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ بے شک آپ کی شدید خواہش ہے کہ سب لوگ ایمان لے آئیں مگر ایمان لانے کی توفیق دینا یا نہ دینا اآپ کے اختیار میں نہیں، بلکہ اللہ تعالیٰ کے ہاتھ میں ہے، جیسا کہ فرمایا : « اِنَّكَ لَا تَهْدِيْ مَنْ اَحْبَبْتَ » [ القصص : ۵۶ ] ’’بے شک تو ہدایت نہیں دیتا جسے تو دوست رکھے۔‘‘"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { لٰكِنِ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ …:} جہنمیوں کے ذکر کے ساتھ ہی  متقیوں کا حسن انجام بیان فرمایا، تاکہ ترہیب کے ساتھ ترغیب بھی جاری رہے۔ علی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ فِي الْجَنَّةِ لَغُرَفًا يُرٰی ظُهُوْرُهَا مِنْ بُطُوْنِهَا وَ بُطُوْنُهَا مِنْ ظُهُوْرِهَاا فَقَامَ إِلَيْهِ أَعْرَابِيٌّ فَقَالَ لِمَنْ هِيَ يَا نَبِيَّ اللّٰهِ!؟ قَالَ هِيَ لِمَنْ أَطَابَ الْكَلَامَ وَأَطْعَمَ الطَّعَامَ وَ أَدَامَ الصِّيَامَ وَ صَلّٰی لِلّٰهِ بِاللَّيْلِ وَ النَّاسُ نِيَامٌ ] [ ترمذي، صفۃ الجنۃ، باب ما جاء في صفۃ غرف الجنۃ : ۲۵۲۷، و قال الألباني حسن ] ’’جنت میں ایسے اونچے محل ہیں جن کے باہر کے حصے ان کے اندر کے حصوں سے اور اندر کے حصے باہر کے حصوں سے دکھائی دیتے ہیں۔‘‘ ایک اعرابی نے اٹھ کر پوچھا : ’’اے اللہ کے نبی! وہ کن کے لیے ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ان کے لیے جو پاکیزہ گفتگو کریں اور کھانا کھلائئیں اور روزوں پر ہمیشگی کریں اور اللہ کے لیے نماز پڑھیں جب لوگ سوئے ہوئے ہوں۔‘‘ ¤ ➋ { مِنْ فَوْقِهَا غُرَفٌ … :} یعنی متقی لوگوں کے لیے اونچے محل ہیں، جن سے مزید بلندی پر اور اونچے محل ہیں، ان کی بلندی کا ذکر سورۂ فرقان کی آیت (۷۵) کی تفسیر میں گزر چکا ہے۔ ¤ ➌ {’’ مَبْنِيَّةٌ ‘‘ ’’بَنٰي يَبْنِيْ بِنَاءً‘‘} سے اسم مفعول ہے۔ ’’بنائے ہوئے‘‘ سے مراد نہایت خوبی سے بنائے ہوئے ہیں۔ ابوہریرہ رضی اللہ عنہ سے روایت ہے، وہ فرماتے ہیں کہ ہم نے کہا : [ يَا رَسُوْلَ اللّٰهِ! حَدِّثْنَا عَنِ الْجَنَّةِ، مَا بِنَاؤُهَا؟ قَالَ لَبِنَةُ ذَهَبٍ وَ لَبِنَةُ فِضَّةٍ، وَمِلاَطُهَا الْمِسْكُ الْأَذْفَرُ، وَ حَصْبَاؤُهَا اللُّؤْلُؤُ وَالْيَاقُوْتُ، وَ تُرَابُهَا الزَّعْفَرَانُ، مَنْ يَّدْخُلُهَا يَنْعَمُ وَ لَا يَبْأَسُ، وَ يَخْلُدُ وَ لَا يَمُوْتُ،، لَا تَبْلٰی ثِيَابُهُ وَ لَا يَفْنٰی شَبَابُهُ ] [ مسند أحمد : 305/2، ح : ۸۰۶۳، قال المحقق صحیح بطرقہ و شواہدہ ] ’’یا رسول اللہ ! ہمیں جنت کے متعلق بتائیں کہ وہ کس چیز کی بنی ہوئی ہے؟‘‘ فرمایا : ’’ایک اینٹ سونے کی، ایک اینٹ چاندی کی، اس کا گارا مہکنے والی کستوری ہے، اس کی کنکریاں لؤلؤ اور یاقوت ہیں اور اس کی مٹی زعفران ہے۔ جو اس میں داخل ہو گا خوش حال رہے گا، کبھی بدحال نہیں ہو گا، ہمیشہ زندہ رہے گا، کبھی فوت نہیں ہو گا، نہ اس کے کپڑے کبھی بوسیدہ ہوں گے اور نہ ہی اس کی جوانی ختم ہو گی۔‘‘ ¤ ➍ {’’ مَبْنِيَّةٌ ‘‘} (بنائے ہوئے) کے لفظ سے ظاہر ہے کہ جنت کے وہ محل بنائے جا چکے ہیں اور جنت متقی بندوں کے لیے تیار کی جاچکی ہے، فرمایا : « اُعِدَّتْ لِلْمُتَّقِيْنَ » [ آل عمران : ۱۳۳ ] ’’(جنت) ڈرنے والوں کے لیے تیار کی گئی ہے۔‘‘"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَآءِ مَآءً … : ’’ يَنَابِيْعَ ‘‘ ’’يَنْبُوْعٌ‘‘} کی جمع ہے، جس کا معنی چشمہ بھی ہے اور بہت پانی والا نالہ بھی۔ (قاموس) ابن کثیر رحمہ اللہ نے فرمایا : ’’اللہ تعالیٰ بتا رہے ہیں کہ زمین میں موجود پانی کا اصل آسمان ہی سے ہے، جیسا کہ اللہ تعالیٰ نے فرمایا : «وَ اَنْزَلْنَا مِنَ السَّمَآءِ مَآءً طَهُوْرًا» [ الفرقان : ۴۸ ] ’’اور ہم نے آسمان سے پاک کرنے والا پانی اتارا۔‘‘ آسمان سے اترنے کے بعد یہ پانی زمین کی تہوں میں چلا جاتا ہے، پھر اللہ تعالیٰ اسے ضرورت کے مطابق جس طرح چاہتا ہے چلاتا ہے اور چھوٹے یا بڑے چشموں کی صورت میں باہر نکالتا ہے، جس سے ندی نالے اور دریا بنتے ہیں، اسی لیے اللہ تعالیٰ نے فرمایا : « فَسَلَكَهٗ يَنَابِيْعَ فِي الْاَرْضِ» ’’پھر اسے چشموں کی صورت میں زمین میں چلایا۔‘‘ ¤ ➋ آخرت میں ہمیشہ ہمیشہ آگ کے عذاب اور ہمیشہ ہمیشہ کی جنت کے ذکر کے ساتھ ہی دنیا کی زندگی کی زیب و زینت اور خوش حالی کے عارضی اور نا پائیدار ہونے کا ذکر فرمایا۔ آسمان سے اترنے والے پانی کے ساتھ پیدا ہونے والی کھیتی کا جو حال اس آیت میں بیان ہوا ہے یہی حال انسان کا ہے، وہ پہلے بچہ ہوتا ہے، پھر جوان ہوتا ہے، پھر پختہ ہو کر بوڑھا ہو جاتا ہے، آخر کار دنیا سے سدھار جاتا ہے۔ دنیا کی ہر چیز کا یہی حال ہے، اس کی سب زینتیں عارضی اور چند روزہ ہیں، اس کے ہر کمال کو زوال ہے اور اس کی ہر چیز کو آخر کار فنا ہونا ہے۔ اس آیت کی مزید تفسیر کے لیے دیکھیے سورۂ یونس (۲۴)، کہف (۴۵) اور حدید (۲۰)۔ ¤ ➌ {ثُمَّ يُخْرِجُ بِهٖ زَرْعًا مُّخْتَلِفًا اَلْوَانُهٗ :} مختلف رنگوں سے مراد مختلف رنگ بھی ہیں، مثلاً سبز، سرخ، زرد وغیرہ اور مختلف قسمیں بھی، مثلاً گندم، جَو اور چنے وغیرہ۔ یہ دلیل ہے کہ ایک ہی پانی اور ایک ہی زمین سے مختلف رنگوں اور ذائقوں کی کھیتیاں پیدا کرنا اندھے بہرے مادے کا کام نہیں، بلکہ ایک قادر و مختار ہستی کا کام ہے۔ دیکھیے سورۂ رعد (۴)۔ ¤ ➍ {ثُمَّ يَهِيْجُ فَتَرٰىهُ مُصْفَرًّا : ’’هَاجَ يَهِيْجُ هَيْجًا وَ هِيَاجًا وَ هَيْجَانًا الشَّيْءُ‘‘} کسی چیز کا ابھرنا، حرکت کرنا۔ {’’هَاجَ النَّبْتُ‘‘} کھیتی کا خشک ہونا۔ ¤ ➎ { ثُمَّ يَجْعَلُهٗ حُطَامًا :’’ حَطِمَ } (س) {الشَّيْءُ حَطَمًا‘‘} کسی چیز کا ٹوٹ کر ریزہ ریزہ ہو جانا۔ {’’ حُطَامًا ‘‘ ’’فُتَاتًا‘‘} کا ہم وزن اور ہم معنی ہے، ریزہ ریزہ شدہ، چورا۔ اس آیت میں {’’ ثُمَّ يَجْعَلُهٗ حُطَامًا ‘‘} (پھر وہ اسے چورا بنا دیتا ہے) فرمایا، جب کہ سورۂ حدید میں فرمایا : «ثُمَّ يَكُوْنُ حُطَامًا » [ الحدید : ۲۰ ] ’’پھر وہ چورا بن جاتی ہے۔‘‘ یہ فرق اس لیے ہے کہ یہاں اللہ تعالیٰ کی قدرت و صنعت کی بات ہو رہی ہے کہ اللہ تعالیٰ نے آسمان سے پانی اتارا، پھر اسے چشموں کی صورت میں زمین میں چلایا، پھر یہاں مختلف رنگوں کی کھیتی اُگانے اور اس کے پکنے کا ذکر ہے، اس لیے فرمایا، پھر وہ اسے چورا بنا دیتا ہے اور سورۂ حدید میں {’’ الْحَيٰوةُ الدُّنْيَا ‘‘} (دنیا کی زندگی) سے بات کا آغاز ہوا ہے، اس لیے آخر میں فرمایا، پھر وہ چورا بن جاتی ہے۔ ¤ ➏ { اِنَّ فِيْ ذٰلِكَ لَذِكْرٰى … : ’’ لَذِكْرٰى ‘‘} میں تنکیر تعظیم کے لیے ہے، یعنی اس میں عقلوں والوں کے لیے بہت بڑی نصیحت ہے کہ ان کی زندگی بھی اس کھیتی کی طرح نا پائیدار اور فنا ہونے والی ہے اور یہ بھی کہ اللہ تعالیٰ جب چاہے گا انھیں دوبارہ اسی طرح زندہ کر ے گا جس طرح وہ مردہ زمین کو پانی کے ذریعے سے زندہ کر دیتا ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {اَفَمَنْ شَرَحَ اللّٰهُ صَدْرَهٗ لِلْاِسْلَامِ …:} شرح صدر کی تفسیر کے لیے دیکھیے سورۂ انعام کی آیت (۱۲۵) اس آیت میں بیان فرمایا کہ مومن و کافر اور فرماں بردار و نافرمان کبھی برابر نہیں ہو سکتے۔ {’’مَنْ شَرَحَ اللّٰهُ صَدْرَهُ لِلْإِسْلَامِ‘‘} مبتدا ہے، اس کی خبر محذوف ہے، جو بعد کے جملے سے خود بخود سمجھ میں آ رہی ہے : {’’أَيْ كَمَنْ هُوَ قَاسِي الْقَلْبِ عَنْ ذِكْرِ اللّٰهِ‘‘} یعنی وہ شخص جس کا دل اللہ تعالیٰ نے قبول اسلام کے لیے کھول دیا ہے اور وہ اپنے رب کی طرف سے ہدایت کی روشنی پر گامزن ہے اس شخص جیسا ہو سکتا ہے جس کا دل اللہ کی یاد کی طرف سے پتھر کی طرح سخت ہو چکا ہے اور اسے اپنا پروردگار یاد ہی نہیں؟ قرآن مجید میں کئی مقامات پر ایسے مبتدا کی خبر مذکور بھی ہے، جیسا کہ فرمایا : «اَفَمَنْ يَّعْلَمُ اَنَّمَاۤ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ الْحَقُّ كَمَنْ هُوَ اَعْمٰى » [ الرعد : ۱۹ ] ’’پھر کیا وہ شخص جو جانتا ہے کہ جو کچھ تیرے رب کی جانب سے تیری طرف اتارا گیا وہی حق ہے، اس شخص کی طرح ہے جو اندھا ہے ؟‘‘ اور فرمایا : « اَفَمَنْ كَانَ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّهٖ كَمَنْ زُيِّنَ لَهٗ سُوْٓءُ عَمَلِهٖ وَ اتَّبَعُوْۤا اَهْوَآءَهُمْ » [ محمد : ۱۴ ] ’’تو کیا وہ شخص جو اپنے رب کی طرف سے ایک واضح دلیل پر ہے اس شخص کی طرح ہے جس کے لیے اس کے برے اعمال مزیّن کر دیے گئے اور انھوں نے اپنی خواہشوں کی پیروی کی؟‘‘ ¤ ➋ {فَوَيْلٌ لِّلْقٰسِيَةِ قُلُوْبُهُمْ … : ’’اَلْقَاسِيَةُ‘‘ ’’قَسَا يَقْسُوْ قَسْوَةً‘‘} سے اسم فاعل مؤنث ہے۔ {’’قَسْوَةٌ‘‘} کے مفہوم کے لیے دیکھیے سورۂ بقرہ کی آیت (۷۴) : «ثُمَّ قَسَتْ قُلُوْبُكُمْ » کی تفسیر۔ ¤ ➌ { اُولٰٓىِٕكَ فِيْ ضَلٰلٍ مُّبِيْنٍ : } اس سے بڑی گمراہی کیا ہو گی کہ کوئی شخص اپنے مالک ہی سے منہ موڑلے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ { اَللّٰهُ نَزَّلَ اَحْسَنَ الْحَدِيْثِ …:’’ نَزَّلَ ‘‘} کے مفہوم میں تھوڑا تھوڑا کر کے نازل کرنا پایا جاتا ہے، جیساکہ فرمایا : «وَ قُرْاٰنًا فَرَقْنٰهُ لِتَقْرَاَهٗ عَلَى النَّاسِ عَلٰى مُكْثٍ وَّ نَزَّلْنٰهُ تَنْزِيْلًا » [ بني إسرائیل : ۱۰۶ ] ’’اور عظیم قرآن، ہم نے اس کو جدا جدا کرکے (نازل) کیا، تاکہ تو اسے لوگوں پر ٹھہر ٹھہر کر پڑھے اور ہم نے اسے نازل کیا، (تھوڑا تھوڑا) نازل کرنا۔‘‘ {’’ اَحْسَنَ الْحَدِيْثِ ‘‘} سے مراد اللہ کا کلام ہے، کیونکہ مخلوق کا کلام کبھی بھی خالق کے کلام جیسے حسن والا نہیں ہو سکتا اور نہ مخلوق اس کی مثال پیش کر سکتی ہے۔ (دیکھیے سورۂ بقرہ : ۲۳، ۲۴){ ’’ الْحَدِيْثِ ‘‘} کا معنی ’’نئی‘‘ ہے، چونکہ بات بھی نئی ہوتی ہے، اس لیے اسے ’’حدیث‘‘ کہتے ہیں۔ اس سے معلوم ہوا کہ اللہ تعالیٰ جب چاہتا ہے کلام کرتا ہے اور اس کا کلام حدیث اور محدث (نیا) ہوتا ہے۔ (دیکھیے سورۂ انبیاء : ۲۔ شعراء : ۵) بعض لوگوں نے یونانی فلسفیوں کا یہ قاعدہ تسلیم کر لیا کہ ہر محل حوادث حادث ہوتا ہے، یعنی جس سے کوئی نئی چیز صادر ہو وہ ہمیشہ سے موجود ہستی نہیں ہو سکتی۔ اس لیے انھوں نے اللہ تعالیٰ کے سننے، دیکھنے، اترنے چڑھنے، کلام کرنے، ہنسنے، غرض بے شمار صفات کا انکار کر دیا، یا ان کی تاویل کی، حالانکہ یہ قاعدہ قرآن کریم کے صریح خلاف ہے۔ قرآن کے مطابق اللہ تعالیٰ ہمیشہ سے ہے اور ہمیشہ رہے گا، اس کے باوجود وہ سمیع بھی ہے بصیر بھی، خالق بھی ہے رزاق بھی، خوش بھی ہوتا ہے ناراض بھی اور کلام بھی کرتا ہے اور ظاہر ہے کلام الفاظ کے ساتھ ہوتا ہے، جن میں ترتیب اور حدوث پایا جاتا ہے، بلکہ اللہ تعالیٰ ہر آن نئی سے نئی حالت اور نئی سے نئی شان میں ہے، فرمایا : « يَسْـَٔلُهٗ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ » [ الرحمٰن : ۲۹ ] ’’ اسی سے مانگتا ہے جو کوئی آسمانوں اور زمین میں ہے، ہر دن وہ ایک (نئی) شان میں ہے۔‘‘ ¤ یونانی فلسفی چونکہ آسمانی ہدایت کی روشنی سے محروم تھے، اس لیے ان کا فلسفہ قرآن و حدیث سے متصادم ہے اور ان کے ماننے والے قرآن و حدیث پر ایمان کے دعوے کے باوجود ان میں مذکور صفات الٰہی کو ماننے سے دل میں شدید تنگی محسوس کرتے ہیں۔ اس لیے ان کی ایسی ایسی تاویلیں کرتے ہیں جو صریح تحریف ہیں۔ مزید دیکھیے سورۂ اعراف (۱۴۳)، توبہ (۶)، کہف (۱۰۹)، انبیاء (۲) اور سورۂ شعراء (۵)۔ ¤ ➋ { كِتٰبًا مُّتَشَابِهًا :} اس مقام پر پورے قرآن کو{ ’’ كِتٰبًا مُّتَشَابِهًا ‘‘} کہا گیا ہے، یعنی قرآن مجید کی تمام آیات مضامین و معانی میں، تمام خبروں کے سچا ہونے اور تمام احکام کے حق ہونے میں ایک دوسری سے ملتی جلتی اور ایک دوسری کی تائید و تصدیق کرتی ہیں۔ اگر ایک جگہ بات مختصر ہے تو دوسری جگہ مفصل ہے، کہیں بھی کوئی اختلاف یا تناقض نہیں ہے، فرمایا : «وَ لَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللّٰهِ لَوَجَدُوْا فِيْهِ اخْتِلَافًا كَثِيْرًا » [ النساء : ۸۲ ] ’’اور اگر وہ غیر اللہ کی طرف سے ہوتا تو وہ اس میں بہت زیادہ اختلاف پاتے۔‘‘ اسی طرح فصاحت و بلاغت اور حسن و خوبی میں بھی سب ایک جیسی ہیں۔ تیئیس (۲۳) سالوں کے طویل عرصہ میں تھوڑی تھوڑی آیات نازل ہونے کے باوجود کسی بھی مقام پر نہ ان کی حسن و خوبی اور فصاحت و بلاغت میں کوئی تفاوت ہے اور نہ کہیں اس کے جلال اور دبدبے میں کوئی کمی ہے۔مزید تفصیل کے لیے دیکھیے سورۂ نساء (۸۲) دوسرے مقام پر قرآن کی بعض آیات کو محکم اور بعض کو {متشابه} کہا گیا ہے، اس کی وضاحت کے لیے دیکھیے سورۂ آل عمران (۷)۔ ¤ ➌ {’’ مَثَانِيَ ‘‘ ’’ثَنٰي يَثْنِيْ‘‘} ({رَمٰي يَرْمِيْ}) کے اسم مفعول {’’مَثْنِيَّةٌ‘‘} بروزن {’’مَرْمِيَّةٌ‘‘} کی جمع ہے، معنی دوہرا کرنا یا دہرانا ہے۔ یعنی اس کتاب کی آیات بار بار دہرائی جانے والی ہیں، جنھیں عقائد، احکام، قصص اور ترغیب و ترہیب کو ذہن نشین کرانے کے لیے بار بار، کہیں ایک ہی طرح اور کہیں مختلف انداز میں دہرایا گیا ہے، تاکہ خوب ذہن نشین ہو جائیں اور اگر ایک جگہ بات پوری طرح سمجھ میں نہ آئے تو دوسری جگہ خوب واضح ہو جائے۔ لطف یہ کہ نہ اس کے مختلف مضامین بار بار دہرانے سے طبیعت اکتاتی ہے اور نہ ہی کوئی ایک سورت یا آیت بار بار پڑھنے سے دل سیر ہوتا ہے۔ {’’ مَثَانِيَ ‘‘} کے مفہوم میں یہ بات بھی داخل ہے کہ عموماً کسی بات کے ذکر کے ساتھ اس کے مقابل کا بھی ذکر ہے، مثلاً ایمان و کفر، جنت و جہنم، ابرار و فجار، ترغیب و ترہیب اور رحمت و عذاب وغیرہ۔ ¤ ➍ {تَقْشَعِرُّ مِنْهُ جُلُوْدُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ …:} یعنی جب ان آیات میں اللہ تعالیٰ کے جلال و قہر کا، یا اس کے عذاب کا ذکر ہوتا ہے تو خوف کی وجہ سے اپنے رب سے ڈرنے والوں کے رونگٹے کھڑے ہو جاتے ہیں، پھر جب اس کی رحمت و مغفرت کا ذکر آتا ہے تو ان کے چمڑے اور دل امید کی بدولت نرم ہو کر اللہ کی یاد کی طرف جھک جاتے ہیں۔ {’’ تَلِيْنُ ‘‘} کے ضمن میں {’’تَمِيْلُ‘‘} کا معنی ہونے کی وجہ سے اسے {’’ اِلٰى ‘‘} کے ساتھ ذکر کیا گیا ہے۔ اس کیفیت کے لیے دیکھیے سورۂ انفال (۲تا۴)، مومنون (۵تا ۱۶) اور سورۂ مائدہ (۸۳، ۸۴)۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ {’’ اَفَمَنْ يَّتَّقِيْ بِوَجْهِهٖ ‘‘} کی خبر محذوف ہے (جیسا کہ اس سے پہلے آیت : ۱۹ میں گزر چکا ہے) : {’’أَيْ كَمَنْ هُوَ آمِنٌ مِنَ الْعَذَابِ، أَوْ كَمَنْ هُوَ مِنْ أَهْلِ الْجَنَّةِ‘‘} یعنی تو کیا وہ شخص جو قیامت کے دن اپنے چہرے کے ساتھ بدترین عذاب سے بچے گا، وہ اس شخص کی طرح ہو سکتا ہے جو عذاب سے بے خوف ہو گا، یا جو اہلِ جنت سے ہو گا؟ جیسا کہ فرمایا : « اَفَمَنْ يُّلْقٰى فِي النَّارِ خَيْرٌ اَمْ مَّنْ يَّاْتِيْۤ اٰمِنًا يَّوْمَ الْقِيٰمَةِ» [ حٰمٓ السجدۃ : ۴۰ ] ’’تو کیا وہ شخص جو آگ میں پھینکا جائے بہتر ہے، یاجو امن کی حالت میں قیامت کے دن آئے؟‘‘ مزید دیکھیے سورۂ قمر (۴۸) اور سورۂ ملک (۲۲)۔ ¤ ➋ دنیا میں آدمی کو آگ یا کسی بھی تکلیف دہ چیز کا سامنا ہو تو وہ اپنے چہرے کو اس سے بچانے کے لیے ہاتھوں کو ڈھال کے طور پر استعمال کرتا ہے۔ قیامت کے دن چونکہ جہنمیوں کے ہاتھ بندھے ہوئے ہوں گے، اس لیے وہ عذاب سے بچنے کے لیے چار و ناچار چہروں ہی کو ڈھال بنائیں گے، یعنی بد ترین عذاب کے تھپیڑے سیدھے ان کے منہ پر پڑیں گے۔ ¤ ➌ {وَ قِيْلَ لِلظّٰلِمِيْنَ ذُوْقُوْا … :} یعنی وہ اپنے چہرے کے ساتھ عذاب سے بچیں گے، مگر اس سے انھیں کچھ بچاؤ حاصل نہ ہو گا، بلکہ آگ انھیں ہر جانب سے ڈھانپ لے گی۔ آگے یہ کہنے کے بجائے کہ ’’ان سے کہا جائے گا‘‘ فرمایا ’’ان ظالموں سے کہا جائے گا‘‘ مقصد یہ بات واضح کرنا ہے کہ ان کے عذاب کا باعث ان کا ظلم ہو گا اور ان سے کہا جائے گا کہ اپنی کمائی کا وبال چکھو۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ … :} رسول کریم صلی اللہ علیہ وسلم کو جھٹلانے والوں کو متنبہ کرنے کے لیے فرمایا کہ ان سے پہلے لوگوں نے بھی پیغمبروں کو جھٹلایا تو ان پر وہاں سے عذاب آیا کہ وہ سوچتے بھی نہ تھے۔ مثلاً زلزلے سے ان کے مکانوں کی چھتیں ان پر گر پڑیں۔ (دیکھیے نحل : ۲۶) بعض پر پتھراؤ والی ہوا بھیجی گئی، بعض کو چیخ نے پکڑ لیا، بعض کو زمین میں دھنسا دیا گیا اور بعض کو غرق کر دیا گیا۔ (دیکھیے عنکبوت : ۴۰)"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ { فَاَذَاقَهُمُ اللّٰهُ الْخِزْيَ فِي الْحَيٰوةِ الدُّنْيَا … :} دنیا میں اللہ تعالیٰ نے ان عذابوں کے ذریعے سے انھیں رسوائی چکھائی اور آخرت کا عذاب ان سے کہیں زیادہ بڑا ہے، کیونکہ آخرت کی آگ دنیا کی آگ سے ستر (۷۰) گنا زیادہ حرارت والی ہے، پھر دنیا کا عذاب تو ختم ہونے والا ہے، مگر آخرت کا عذاب ہمیشہ کے لیے ہے۔ اس کے علاوہ آخرت کا عذاب رسوائی میں بھی کہیں زیادہ ہے۔ دیکھیے سورۂ حمٰ السجدہ (۱۶)۔ ¤ ➋ { لَوْ كَانُوْا يَعْلَمُوْنَ:} یعنی وہ یہ بات جانتے ہی نہ تھے کہ آخرت کا عذاب کہیں زیادہ بڑا ہے، ورنہ وہ اس سے بے خوف نہ ہوتے۔ معلوم ہوا کہ اگر انھوں نے علم کے باوجود نافرمانی کی تو حقیقت میں وہ علم نہ تھا بلکہ جہل تھا، کیونکہ علم وہ ہے جو عمل پر آمادہ کرے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) { وَ لَقَدْ ضَرَبْنَا لِلنَّاسِ فِيْ هٰذَا الْقُرْاٰنِ …:} مثال کے ساتھ بات کرنے سے وہ بات جلد سمجھ میں آجاتی ہے اور خوب ذہن نشین ہو جاتی ہے، خصوصاً ایسی مثالیں جن کا آدمی کی اپنی زندگی اور گردوپیش کی اشیاء سے تعلق ہو اور اسے روز مرہ ان سے واسطہ پڑتا ہو۔ اس لیے اللہ تعالیٰ نے قرآن مجید میں ہر قسم کی مثالیں بیان فرمائی ہیں، جیسا کہ اپنی توحید سمجھانے کے لیے آدمیوں کو خود ان کی مثالیں دے کر سمجھایا۔ دیکھیے سورۂ روم (۲۸) اور نحل (۷۵ـ، ۷۶)۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) { قُرْاٰنًا عَرَبِيًّا غَيْرَ ذِيْ عِوَجٍ … : ’’ قُرْاٰنًا عَرَبِيًّا ‘‘} کی تفسیر کے لیے دیکھیے سورۂ یوسف (۲) {’’ غَيْرَ ذِيْ عِوَجٍ ‘‘} میں تنوین کی وجہ سے نفی عام ہو گئی ہے، یعنی اس میں کسی قسم کی کوئی کجی نہیں۔ یہ مفہوم {’’غَيْرَ مُعَوَّجٍ‘‘} (جو کجی والا نہیں) سے حاصل نہیں ہو سکتا تھا۔ تفسیر کے لیے دیکھیے سورۂ کہف کی آیت (۱) یہ دونوں آیات اگلی آیت میں آنے والی مثال کے لیے تمہید کے طور پر بیان ہوئی ہیں۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { ضَرَبَ اللّٰهُ مَثَلًا …:’’رَجُلٌ شَكِسٌ‘‘} ضدی، بدخلق، جھگڑنے والا آدمی۔ {’’ مُتَشٰكِسُوْنَ ‘‘} باب تفاعل سے جمع مذکر اسم فاعل ہے، اس باب میں تشارک پایا جاتا ہے، ایک دوسرے سے ضد کرنے والے، جھگڑنے والے۔ یہ مشرک اور موحّد کی مثال ہے، مشرک جو کئی معبودوں کی عبادت کرتا ہے اس کی مثال اس آدمی کی ہے جو کئی آقاؤں کا غلام ہے، جو اس کے مالک ہونے میں شریک ہیں اور سب بدخو، ضدی اور ایک دوسرے سے جھگڑنے والے ہیں۔ ان میں سے ہر ایک چاہتا ہے کہ غلام اسی کے کام میں لگا رہے اور ہر ایک اسے اپنے مطلب کا حکم دیتا ہے، اسے دوسروں کے کام سے کوئی سروکار نہیں، وہ حیران ہے کہ کس کا حکم بجا لائے۔ پھر ان میں سے کوئی بھی اس غلام کی ضروریات کا ذمہ دار بننے کے لیے تیار نہیں، بلکہ ہر ایک اسے دوسرے کے حوالے کرتا ہے۔ نتیجہ یہ کہ نہ وہ ان میں سے کسی کو خوش کر سکتا ہے نہ اس کی کوئی حاجت یا ضرورت پوری ہوتی ہے۔ اس کی زندگی جس قدر تنگ ہو گی، بخوبی ظاہر ہے۔ اس کے مقابلے میں موحّد کی مثال اس آدمی کی ہے جو صرف ایک آقا کا غلام ہے، اسی کی خدمت کرتا ہے اور اسی کے سامنے اپنی ہر حاجت اور ضرورت پیش کرتا ہے۔ صاف ظاہر ہے کہ یہ آدمی نہایت اطمینان اور سکون کی زندگی بسر کر ے گا۔ شاہ عبد القادر رحمہ اللہ فرماتے ہیں : ’’ایک غلام جو کئی کا ہو، کوئی اس کو کو اپنا نہ سمجھے تو اس کی پوری خبر نہ لے اور ایک غلام جو سارا ایک کا ہو، وہ اس کو اپنا سمجھے اور پوری خبر لے، یہ مثال ہے ان کی جو ایک رب کے بندے ہیں اور جو کئی رب کے بندے ہیں۔‘‘ (موضح) ¤ ➋ { اَلْحَمْدُ لِلّٰهِ:} یہاں {’’ اَلْحَمْدُ لِلّٰهِ ‘‘} کا مطلب یہ ہے کہ ان مشرکوں میں سے کوئی بھی نہیں کہہ سکتا کہ یہ دونوں برابر ہو سکتے ہیں، بلکہ یا تو وہ تسلیم کریں گے کہ یہ دونوں برابر نہیں ہو سکتے، یا پھر خاموشی اختیار کریں گے، دونوں صورتوں میں توحید کی خوبی اور شرک کی برائی ثابت ہو جائے گی۔ اس پر فرمایا، سب تعریف اللہ کے لیے ہے جس نے ایسی بہترین اور آسان مثال کے ساتھ توحید کا مسئلہ واضح فرمایا۔ ¤ ➌ { بَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَ :} یعنی ایک آقا کی غلامی اور بہت سے آقاؤں کی غلامی کا فرق ماننے کے باوجود اکثر لوگ ایک اللہ کی عبادت اور بہت سے معبودوں کی عبادت کا فرق نہیں جانتے، اس لیے شرک میں گرفتار رہتے ہیں۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { اِنَّكَ مَيِّتٌ وَّ اِنَّهُمْ مَّيِّتُوْنَ:} یعنی اگر یہ نہیں مانتے تو نہ مانیں، ہمیشہ نہ تجھے رہنا ہے نہ ان کو، یقینا تو مرنے والا ہے اور یقینا وہ بھی مرنے والے ہیں۔ اس میں نبی صلی اللہ علیہ وسلم کے لیے وعدہ اور بشارت ہے کہ آپ کی دنیا کی محنت و مشقت اور تمام رنج ختم ہونے والے ہیں اور آپ اپنے رب سے ملاقات کرنے والے اور ہمیشہ کی راحت و آرام والی جنت میں جانے والے ہیں، اور کافروں کے لیے وعید ہے کہ ان کی مہلت ختم ہونے والی ہے اور وہ اپنے رب کے سامنے پیش ہو کر اپنے کفر و شرک کا حساب دینے والے ہیں۔ اس کے علاوہ اس میں نبی صلی اللہ علیہ وسلم اور تمام مسلمانوں کو ان کی موت یاد دلا کر اس کی تیاری کی یاد دہانی بھی ہے۔ ¤ ➋ اس آیت میں اللہ تعالیٰ نے اطلاع دی ہے کہ رسول اللہ صلی اللہ علیہ وسلم فوت ہو جائیں گے، تاکہ آپ کی موت کے متعلق لوگوں میں اختلاف واقع نہ ہو اور وہ آپ کی پرستش نہ کرنے لگیں، جیسا کہ پہلی امتوں میں اپنے انبیاء کی وفات کے متعلق اختلاف واقع ہوا۔ چنانچہ نبی صلی اللہ علیہ وسلم کی وفات پر اکثر لوگوں نے تسلیم نہ کیا کہ آپ صلی اللہ علیہ وسلم فوت ہو چکے ہیں، جن میں عمر بن خطاب رضی اللہ عنہ بھی شامل تھے۔ اس موقع پر ابو بکر رضی اللہ عنہ نے یہ آیت اور سورۂ آل عمران کی آیت (۱۴۴) : « وَ مَا مُحَمَّدٌ اِلَّا رَسُوْلٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ اَفَاۡىِٕنْ مَّااتَ اَوْ قُتِلَ انْقَلَبْتُمْ عَلٰۤى اَعْقَابِكُمْ » پڑھ کر اععلان کیا کہ محمد صلی اللہ علیہ وسلم فوت ہو گئے۔ [ دیکھیے بخاري، فضائل أصحاب النبي صلی اللہ علیہ وسلم ، باب : ۳۶۶۷، ۳۶۶۸] سورۂ آل عمران کی آیت (۱۴۴) کی تفسیر بھی دیکھ لیں۔ اس پر عمر رضی اللہ عنہ اور دوسرے صحابہ نے اپنے موقف سے رجوع کر لیا اور تمام صحابہ کا اتفاق ہو گیا کہ آپ صلی اللہ علیہ وسلم فوت ہو گئے ہیں۔ اسی لیے انھوں نے آپ صلی اللہ علیہ وسلم کو غسل اور کفن دے کر دفن کر دیا، ورنہ وہ آپ صلی اللہ علیہ وسلم کو زندہ کبھی دفن نہ کرتے۔ افسوس! قرآن کی واضح آیات اور صحابہ کرام رضی اللہ عنھم کے اجماع کے باوجود کچھ لوگوں کو اصرار ہے کہ نبی صلی اللہ علیہ وسلم اب بھی دنیوی زندگی کے ساتھ زندہ ہیں۔ چنانچہ ایک صاحب لکھتے ہیں : ’’انبیاء کی موت ایک آن کے لیے ہوتی ہے، پھر انھیں حیات عطا فرمائی جاتی ہے۔‘‘ سوال یہ ہے کہ اگر اس حیات سے مراد برزخ کی زندگی ہے تو وہ تو نیک و بد سب کو عطا ہوتی ہے اور برزخ میں جزا و سزا کا سلسلہ شروع ہو جاتا ہے۔ ظاہر ہے انبیاء کی شان سب سے اونچی ہے اور ان کو عطا ہونے والے انعامات بھی بے حساب ہیں، اس زندگی سے کسی کو بھی انکار نہیں، مگر اس کے لیے موت ضروری ہے، کیونکہ یہ موت کے بعد شروع ہوتی ہے۔ لیکن اگر ایک آن کے بعد انھیں دنیوی زندگی عطا کر دی جاتی ہے، تو پھر انبیاء کے جاں نثار صحابہ انھیں دفن کیوں کر دیتے ہیں؟ رسول اللہ صلی اللہ علیہ وسلم سوموار کے دن فوت ہوئے اور بدھ کے دن آپ کو دفن کیا گیا، تو کیا اس وقت تک وہ آن پوری نہ ہوئی تھی اور صحابہ کو معلوم نہ ہوا تھا کہ آپ کو پھر حیات عطا ہو چکی ہے۔ کیا انھوں نے یہ جانتے ہوئے بھی آپ صلی اللہ علیہ وسلم کے دفن کرنے پر اتفاق کر لیا اور آپ صلی اللہ علیہ وسلم کو زندہ دفن کر دیا اور رسول صلی اللہ علیہ وسلم بھی زندہ ہونے کے باوجود خاموشی کے ساتھ دفن ہو گئے؟ «فَمَالِ هٰۤؤُلَآءِ الْقَوْمِ لَا يَكَادُوْنَ يَفْقَهُوْنَ حَدِيْثًا » [ النساء : ۷۸ ] ’’تو ان لوگوں کو کیا ہے کہ قریب نہیں ہیں کہ کوئی بات سمجھیں۔‘‘"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { ثُمَّ اِنَّكُمْ يَوْمَ الْقِيٰمَةِ … :} اس سے پہلی اور بعد میں آنے والی آیات کے مطابق اس جھگڑے سے مراد مشرکین اور رسول اللہ صلی اللہ علیہ وسلم کا قیامت کے دن اللہ تعالیٰ کے سامنے جھگڑا ہے، جب رسول اللہ صلی اللہ علیہ وسلم اپنا مقدمہ پیش کریں گے کہ یا اللہ! میں نے ان لوگوں کو تیرا پیغام پہنچایا مگر انھوں نے مجھے جھٹلا دیا۔ (دیکھیے فرقان : ۳۰) اور مشرکین قسمیں کھا کر دنیا میں اپنے مشرک ہونے کا انکار کر دیں گے، وہ کہیں گے : « وَ اللّٰهِ رَبِّنَا مَا كُنَّا مُشْرِكِيْنَ » [ الأنعام : ۲۳ ] ’’اللہ کی قسم! جو ہمارا رب ہے، ہم شریک بنانے والے نہ تھے۔‘‘ پھر فیصلہ اللہ تعالیٰ کے ہاتھ میں ہوگا جو ان پر نبی کی شہادت کے علاوہ ایمان والوں کی، فرشتوں کی، زمین و آسمان کی اور خود ان مشرکوں کے ہاتھ پاؤں، زبانوں اور دوسرے اعضا کی شہادتوں کے ساتھ ان کا جرم ثابت کر کے ان کے انجام کا فیصلہ فرمائے گا۔ ¤ ➋ آیت کے الفاظ عام ہونے کی وجہ سے قیامت کے دن اللہ تعالیٰ کے سامنے ہونے والے تمام جھگڑے بھی اس میں شامل ہیں، جو کفار اور مسلمانوں کے درمیان ہوں گے، یا مشرکین اور ان کے معبودوں یا بڑے لوگوں اور ان کے فرماں برداروں کے درمیان ہوں گے، یا بادشاہوں اور ان کی رعایا کے درمیان ہوں گے، یا مظلوموں اور ظالموں کے درمیان ہوں گے، خواہ وہ دونوں مسلمان ہوں، حتیٰ کہ آدمی کا اپنے اعضا سے بھی جھگڑا ہو گا۔ (دیکھیے حٰم السجدہ : ۲۱) اس لیے اکثر مفسرین نے اس آیت کو عام رکھا ہے۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ اس آیت کی تفسیر میں ابن عباس رضی اللہ عنھما کا قول نقل کیا ہے : {’’ يُخَاصِمُ الصَّادِقُ الْكَاذِبَ، وَالْمَظْلُوْمُ الظَّالِمَ، وَالْمُهْتَدِي الضَّالَّ وَالضَّعِيْفُ الْمُسْتَكْبِرَ ‘‘} [ طبري : ۳۰۳۸۳ ] ’’یعنی سچا جھوٹے سے، مظلوم ظالم سے، ہدایت والا گمراہ سے اور کمزور متکبر سے جھگڑے گا۔‘‘ زبیر رضی اللہ عنہ فرماتے ہیں : [ لَمَّا نَزَلَتْ : « ثُمَّ اِنَّكُمْ يَوْمَ الْقِيٰمَةِ عِنْدَ رَبِّكُمْ تَخْتَصِمُوْنَ » قَالَ الزُّبَيْرُ يَا رَسُوْلَ اللّٰهِ! أَتُكَرَّرُ عَلَيْنَا الْخُصُوْمَةُ بَعْدَ الَّذِيْ كَانَ بَيْنَنَا فِي الدُّنْيَا؟ قَالَ نَعَمْ فَقَالَ إِنَّ الْأَمْرَ إِذًا لَشَدِيْدٌ ] [ ترمذي، التفسیر، باب و من سورۃ الزمر : ۳۲۳۶، قال الترمذي حسن صحیح وقال الألباني حسن الإسناد ] ’’جب یہ آیت : «ثُمَّ اِنَّكُمْ يَوْمَ الْقِيٰمَةِ عِنْدَ رَبِّكُمْ تَخْتَصِمُوْنَ » اتری تو زبیر رضی اللہ عنہ نے کہا : ’’یا رسول اللہ ! کیا دنیا میں جھگڑے ہونے کے بعد وہ جھگڑے دوبارہ ہمارے درمیان ہوں گے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہاں!‘‘ تو زبیر رضی اللہ عنہ نے کہا : ’’اس وقت تو معاملہ بہت سخت ہو گا۔‘‘"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ { فَمَنْ اَظْلَمُ مِمَّنْ كَذَبَ عَلَى اللّٰهِ :} ظلم کا معنی اندھیرا ہے، کسی چیز کو اس کی جگہ کے علاوہ کہیں اور رکھنا بھی اور کسی کا حق دوسرے کو دے دینا بھی ظلم ہے، کیونکہ آدمی اندھیرے میں کسی چیز کو اس کی اصل جگہ نہیں رکھ سکتا۔ ¤ ➋ اللہ تعالیٰ پر جھوٹ سے مراد شرک یعنی اس کے ساتھ کسی اور کی عبادت کرنا ہے، جس کی کئی صورتیں اس سورت کے شروع سے یہاں تک بیان ہوئی ہیں۔ مثلاً اللہ کا قرب حاصل کرنے کے لیے کچھ اولیاء کی عبادت کرنا، فرشتوں کو یا مسیح و عزیر علیھما السلام کو یا کسی اور کو اللہ کی اولاد قرار دینا، مصیبت اور تکلیف کے وقت صرف اللہ تعالیٰ کو پکارنا اور اس کی طرف سے کوئی نعمت عطا ہونے پر اسے بھول کر اس کے شریک بنا کر لوگوں کو گمراہ کرنا اور طاغوت کی عبادت کرنا وغیرہ۔ اللہ تعالیٰ نے سب کا رد فرما کر اس آیت میں خلاصہ بیان فرمایا، اس لیے آیت کی ابتدا ’’فاء‘‘ کے ساتھ فرمائی کہ پھر اس سے بڑھ کر ظالم کون ہے جس نے اللہ پر جھوٹ بولا اور اس کا حق دوسروں کو دے دیا؟ اللہ تعالیٰ پر جھوٹ باندھنے کی کچھ تفصیل ان آیات کی تفسیر میں ملاحظہ فرمائیں، سورۂ انعام (۲۱)، اعراف (۳۷)، ہود (۱۸) اور عنکبوت (۶۸)۔ ¤ ➌ { وَ كَذَّبَ بِالصِّدْقِ اِذْ جَآءَهٗ:} صدق کا معنی وہ بات ہے جو واقعہ کے مطابق ہو، سچی ہو، یہاں اس سے مراد اللہ تعالیٰ کی توحید، آخرت اور رسالت ہے۔ یعنی اگر کسی شخص کے پاس سچی بات نہ پہنچے تو اس کا عذر ہو سکتا ہے، مگر جس شخص کے پاس حق اور صدق آ جائے اور وہ اس پر غور و فکر کی زحمت کیے بغیر اسے سنتے ہی جھٹلا دے، یا اسے سمجھنے کے باوجود عناد کی وجہ سے اس کے آنے کے ساتھ ہی اسے جھٹلا دے، یعنی جو شخص اللہ پر جھوٹ بولے اور سچی بات سنتے ہی اسے جھٹلا دے اس سے بڑا ظالم کوئی نہیں۔ ¤ ➍ شاہ عبد القادر رحمہ اللہ نے اس آیت کی تفسیر ایک اور طریقے سے کی ہے : ’’یعنی اگر نبی نے جھوٹ خدا کا نام لیا تو اس سے برا کون؟ اور اگر وہ سچا تھا اور تم نے جھٹلایا تو تم سے برا کون؟‘‘ (موضح) اس تفسیر کے مطابق {’’ مِمَّنْ كَذَبَ عَلَى اللّٰهِ ‘‘} کا مصداق اور ہے اور {’’ وَ كَذَّبَ بِالصِّدْقِ ‘‘} کا مصداق اور، جب کہ پہلی تفسیر کے مطابق دونوں صفات ایک ہی شخص کی ہیں۔ ¤ ➎ {اَلَيْسَ فِيْ جَهَنَّمَ مَثْوًى لِّلْكٰفِرِيْنَ: ’’ مَثْوًى ‘‘ ’’ثَوٰي يَثْوِيْ ثَوَاءً وَثُوِيًّا‘‘} بروزن {’’مَضٰي يَمْضِيْ مَضَاءً وَ مُضِيًّا‘‘} سے اسم ظرف ہے ، رہنا، ٹھہرنا۔ تفسیر کے لیے دیکھیے سورۂ عنکبوت (۶۸) یہ کہنے کے بجائے کہ ’’کیا ان کے لیے جہنم میں کوئی ٹھکانا نہیں؟‘‘ یہ فرمایا کہ ’’کیا ان کافروں کے لیے جہنم میں کوئی ٹھکانا نہیں؟‘‘ مقصود اس بات کا اظہار ہے کہ ان کا ٹھکانا جہنم ہونے کی وجہ ان کا کفر یعنی حق بات کو چھپانا اور اس کا انکار کرنا ہے۔ ¤ ➏ {’’اَلْكَافِرِيْنَ‘‘} جمع لانے سے ظاہر ہے کہ {’’ مِمَّنْ كَذَبَ عَلَى اللّٰهِ ‘‘} (جس نے اللہ پر جھوٹ بولا) میں {’’مَنْ‘‘} عموم کے لیے ہے، یعنی اس سے مراد ایک شخص نہیں بلکہ ایسے تمام لوگ ہیں جو اللہ پر جھوٹ باندھتے اور سچی بات کو جھٹلاتے ہیں۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ { وَ الَّذِيْ جَآءَ بِالصِّدْقِ وَ صَدَّقَ بِهٖۤ : ’’ الَّذِيْ ‘‘ } سے مراد پہلے گروہ کے بالمقابل گروہ ہے اور پہلی آیت کے{ ’’مَنْ‘‘} کی طرح اس آیت میں{ ’’ الَّذِيْ ‘‘} عموم کے لیے ہے، اس سے مراد نبی صلی اللہ علیہ وسلم اور ہر وہ شخص ہے جو آپ صلی اللہ علیہ وسلم کی دعوت لے کر اٹھ کھڑا ہو، کیونکہ یہ لوگ سچی بات لانے والے بھی ہیں اور اسے سچ ماننے والے بھی۔ سچ لے کر آنے کے ساتھ اس کی تصدیق کی شرط اس لیے لگائی کہ بعض اوقات آدمی سچ بیان کر دیتا ہے، مگر اپنے تکبر کی وجہ سے اسے ماننے کے لیے تیار نہیں ہوتا، اس لیے تعریف کے قابل وہی ہے جس میں صدق اور تصدیق دونوں پائی جائیں، کیونکہ اس کا صدق اس کے علم کی دلیل ہے اور تصدیق اس کی تواضع اور تکبر سے پاک ہونے کی دلیل ہے۔ (سعدی) شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’جو سچی بات لے کر آیا وہ نبی اور جس نے سچ مانا وہ مومن ہے۔‘‘ (موضح) اس تفسیر کے مطابق دونوں کا مصداق الگ الگ ہے، اس لیے بعض مفسرین نے سچی بات لانے والے سے مراد نبی کریم صلی اللہ علیہ وسلم لیے ہیں، کیونکہ آپ صلی اللہ علیہ وسلم اس امت میں سب سے پہلے سچی بات لے کر آئے اور اس کی تصدیق کرنے والے سے مراد ابوبکر صدیق رضی اللہ عنہ لیے ہیں، کیونکہ وہ سب سے پہلے آپ صلی اللہ علیہ وسلم پر ایمان لائے۔ اگرچہ ابوبکر رضی اللہ عنہ کے علاوہ تمام مومن بھی ان لوگوں میں شامل ہیں جنھوں نے آپ صلی اللہ علیہ وسلم کی تصدیق کی اور وہ تمام داعی بھی سچی بات لانے والوں میں شامل ہیں جنھوں نے اسلام کی دعوت دی۔ ¤ ➋ {اُولٰٓىِٕكَ هُمُ الْمُتَّقُوْنَ :} یعنی یہی لوگ شرک سے بچنے والے اور جہنم سے بچے رہنے والے ہیں۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ {لَهُمْ مَّا يَشَآءُوْنَ عِنْدَ رَبِّهِمْ:} چونکہ وہ دنیا میں وہ کام کر تے رہے جو اان کا رب چاہتا تھا، اس لیے اس کے بدلے میں رب تعالیٰ کے ہاں انھیں وہ کچھ ملے گا جو وہ چاہیں گے، فرمایا : « هَلْ جَزَآءُ الْاِحْسَانِ اِلَّا الْاِحْسَانُ » [ الرحمٰن : ۶۰ ] ’’نیکی کا بدلا نیکی کے سوا کیا ہے۔‘‘ ¤ ➋ { ذٰلِكَ جَزٰٓؤُا الْمُحْسِنِيْنَ:} یہاں کچھ عبارت محذوف ہے : {’’لِأَنَّهُمْ كَانُوْا مُحْسِنِيْنَ‘‘} کیونکہ وہ نیکی کرنے والے تھے اور نیکی کرنے والوں کی یہی جزا ہے۔ ’’احسان‘‘ کی تفسیر کے لیے دیکھیے سورۂ بقرہ (۵۸)، یوسف (۳۶) اور قصص (۱۴ اور ۷۷)۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ { لِيُكَفِّرَ اللّٰهُ عَنْهُمْ اَسْوَاَ الَّذِيْ عَمِلُوْا : ’’ لِيُكَفِّرَ اللّٰهُ ‘‘} محذوف فعل {’’أَعْطَاهُمْ ذٰلِكَ‘‘} کے متعلق ہے، یعنی اللہ تعالیٰ انھیں یہ جزا دے گا، تاکہ وہ ان سے وہ بدترین عمل دور کر دے جو انھوں نے کیے…۔ اللہ تعالیٰ متقی لوگوں کے ساتھ عدل سے بڑھ کر فضل کا معاملہ فرمائے گا۔ عدل یہ ہے کہ نیکیوں اور برائیوں کو برابر شمار کرکے جزا دی جائے، جب کہ فضل یہ ہے کہ برائی صرف ایک لکھی جائے اور نیکی دس گنا سے سات سو گنا یا بے حساب لکھی جائے، فرمایا : « اِنَّمَا يُوَفَّى الصّٰبِرُوْنَ اَجْرَهُمْ بِغَيْرِ حِسَابٍ » [ الزمر : ۱۰ ] ’’صرف کامل صبر کرنے والوں ہی کو ان کا اجر کسی شمار کے بغیر دیا جائے گا۔‘‘ اسی فضل کی بدولت اللہ تعالیٰ اپنے متقی بندوں کے سب سے برے اعمال دور کر دے گا۔ جب سب سے برے اعمال دور ہو گئے تو کم برے اعمال بھی دور کر دے گا۔ چنانچہ اگر وہ پہلے کافر ہیں تو اسلام لانے کی بدولت پہلے گناہ معاف کر دے گا، اگر مسلمان تھے تو توبہ، ہجرت، حج اور ان کے تقویٰ کی وجہ سے ان کے تمام گناہ دور کر دے گا، جیسا کہ فرمایا : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِنْ تَتَّقُوا اللّٰهَ يَجْعَلْ لَّكُمْ فُرْقَانًا وَّ يُكَفِّرْ عَنْكُمْ سَيمْ سَيِّاٰتِكُمْ وَ يَغْفِرْ لَكُمْ وَ اللّٰهُ ذُو الْفَضْلِ الْعَظِيْمِ » [ الأنفال : ۲۹ ] ’’اے لوگو جو ایمان لائے ہو! اگر تم اللہ سے ڈرو گے تو وہ تمھارے لیے (حق و باطل میں) فرق کرنے کی بڑی قوت بنا دے گا اور تم سے تمھاری برائیاں دور کر دے گا اور تمھیں بخش دے گا اور اللہ بہت بڑے فضل والا ہے۔‘‘ مزید دیکھیے سورۂ مائدہ (۶۵)، سورۂ محمد (۲)، تغابن (۹)، عنکبوت (۷) اور احقاف (۱۶)۔ ¤ ➋ { وَ يَجْزِيَهُمْ اَجْرَهُمْ بِاَحْسَنِ الَّذِيْ كَانُوْا يَعْمَلُوْنَ :} یعنی انھیں ان کے اعمال کا بدلا ان کے ان اعمال کے لحاظ سے دیا جائے گا جو ان کے نامہ اعمال میں بہترین ہوں گے۔ مطلب یہ ہے کہ ان کے کم تر درجے کے اعمال بھی بہترین بنا دیے جائیں گے اور ایک نیکی کا بدلا دس گنا سے سات سو گنا تک بلکہ بغیر حساب کے دیا جائے گا۔ دیکھیے سورۂ نحل (۹۶، ۹۷) اور طور (۲۱)۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) ➊ { اَلَيْسَ اللّٰهُ بِكَافٍ عَبْدَهٗ :} اللہ تعالیٰ نے یہ ذکر کرنے کے بعد کہ وہ مومنوں کو جنت میں جو چاہیں گے عطا کرے گا اور ان کے بدترین اعمال دور کر ے گا، ساتھ ہی بیان فرمایا کہ دنیا میں بھی وہ انھیں تمام کاموں کے لیے کافی ہو جائے گا اور تمام دشمنوں سے بھی کافی ہو جائے گا۔ اس بات کو نہایت قوت اور زور سے بیان کرنے کے لیے اسے سوالیہ انداز میں بیان فرمایا کہ کیا اللہ تعالیٰ اپنے بندے کے لیے کافی نہیں؟ یعنی یقینا وہ اپنے بندے محمد صلی اللہ علیہ وسلم کے لیے اور اپنے ہر بندے کے لیے کافی ہے۔ ¤ ➋ { وَ يُخَوِّفُوْنَكَ بِالَّذِيْنَ مِنْ دُوْنِهٖ… :} کافر رسول اللہ صلی اللہ علیہ وسلم کو اپنے معبودوں سے ڈراتے اور کہتے کہ ہمارے معبودوں کی برائی سے باز رہ، ورنہ وہ تجھے نقصان پہنچائیں گے اور تجھے دیوانہ بنا دیں گے، جیسا کہ اس زمانے کے مشرک اور قبروں کے مجاور و گدی نشین، جو نام کے مسلمان ہیں اور بزرگوں اور ولیوں کو پکارتے ہیں، ان کی نذریں نیازیں دیتے ہیں، دور دور سے جا کر ان کی قبروں پر میلے لگاتے ہیں، ہاتھ باندھ کر بڑی عاجزی سے ان کے آگے کھڑے ہوتے ہیں، بعض قبروں کے گرد طواف کرتے ہیں اور سجدہ کرتے ہیں، غرض ہر طرح کی عبادت کرتے ہیں، تو جب کوئی انھیں منع کرے اور ان سے کہے کہ اللہ تعالیٰ کے ساتھ کسی کو شریک نہ کرو تو اپنے معبودوں سے ڈراتے ہیں کہ فلاں شخص نے ان کو نہ مانا تو وہ تباہ و برباد ہو گیا، اس کا یہ نقصان ہو گیا۔ ایسی باتوں سے احمق و نادان ڈر جاتے ہیں اور ان کی پوجا کرنے لگ جاتے ہیں، اس لیے اللہ تعالیٰ نے فرمایا : «وَ مَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍ» یعنی یہ لوگ گمراہ ہیں اور جسے اللہ گمراہ کر دے پھر اسے کوئی راہ پر لانے والا نہیں۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { وَ مَنْ يَّهْدِ اللّٰهُ فَمَا لَهٗ مِنْ مُّضِلٍّ :} اور جسے اللہ تعالیٰ ہدایت دے، پھر کوئی اسے گمراہ کرنے والا نہیں۔ شیطان یا اس کے پیروکار اپنے حاجت رواؤں یا مشکل کُشاؤں سے اسے جس قدر بھی ڈرائیں وہ کبھی نہ ان سے ڈرتا ہے اور نہ وہ اللہ کے سوا کسی سے امید رکھتا ہے۔ کفار کا اپنے خداؤں سے ڈرانے کے ذکر کے لیے دیکھیے سورۂ ہود (۵۴)، انعام (۸۰ تا ۸۲) اور سورۂ قمر (۹)۔ ¤ ➋{ اَلَيْسَ اللّٰهُ بِعَزِيْزٍ ذِي انْتِقَامٍ:} کیا اللہ تعالیٰ سب پر غالب نہیں کہ جو اس کی پناہ میں ہو کوئی اس کی ہوا کی طرف بھی نہیں دیکھ سکتا؟ اور کیا وہ اپنی اور اپنے دوستوں کی خاطر بہت بڑے انتقام والا نہیں ({انْتِقَامٍ} کی تنوین تعظیم کے لیے ہے) کہ اس کے اور اس کے دوستوں کے دشمنوں کو اس کے زبردست انتقام سے کوئی نہیں بچا سکتا؟ یقینا وہ سب پر غالب بھی ہے اور بہت بڑے انتقام والا بھی: ¤ نہ جا اس کے تحمل پر کہ بے ڈھب ہے گرفت اس کی ¤ ڈر اس کی دیر گیری سے کہ ہے سخت انتقام اس کا"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ { وَ لَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ … :} اس آیت میں مشرکین کی جہالت اور ان کے قول و عمل کے تضاد کو اجاگر کیا ہے۔ فرمایا، اگر آپ ان سے پوچھیں کہ آسمانوں کو اور زمین کو کس نے پیدا کیا تو یقینا کہیں گے، اللہ تعالیٰ نے۔ اس اقرار کا لازمی نتیجہ یہ ہے کہ جب خالق وہ ہے تو مالک بھی وہی ہے، پھر کسی اور کے پاس کسی طرح کے نفع یا نقصان کا کیا اختیار ہو سکتا ہے۔ اس لیے اس اقرار کے بعد انھیں اللہ کے سوا دوسری ہستیوں کے نفع یا نقصان کااختیار نہ رکھنے کا اقرار کروانے کے لیے فرمایا، ان سے کہیے کہ پھر یہ بتاؤ کہ وہ ہستیاں جنھیں تم اللہ کے سوا پکارتے ہو، اگر اللہ مجھے کوئی تکلیف یا نقصان پہنچانے کا ارادہ کرے تو کیا وہ اس کی تکلیف یا نقصان کو ہٹا سکتی ہیں، یا اگر وہ مجھ پر کوئی مہربانی فرمانا چاہے تو کیا وہ اس کی رحمت کو روک سکتی ہیں؟ اللہ تعالیٰ نے کفار کا جواب یہاں ذکر نہیں فرمایا۔ یا تو اس لیے کہ اس کا جواب بالکل واضح ہے کہ جب خالق و مالک اللہ تعالیٰ ہے تو کوئی دوسرا اس کے ارادے کے خلاف کیا کر سکتا ہے، یا اس لیے کہ مشرک یہ جانتے ہوئے بھی کہ ان کے معبود کچھ اختیار نہیں رکھتے، یہ نہیں کہیں گے کہ وہ نہ تکلیف دور کریں گے اور نہ اس کی رحمت کو روک سکیں گے، بلکہ لاجواب ہو کر خاموشی اختیار کریں گے۔ ¤ ➋ { قُلْ حَسْبِيَ اللّٰهُ … :} یعنی کافر اس سوال کے جواب میں خاموش رہیں تو آپ خود فرما دیں کہ مجھے تو اللہ کافی ہے، تمام بھروسا کرنے والے اسی پر بھروسا کرتے ہیں۔ مطلب یہ ہے کہ تمام بھروسا کرنے والوں کو اسی پر بھروسا کرنا لازم ہے، کیونکہ جب کسی بات کا زیادہ زور سے حکم دینا ہو تو اسے خبر کی صورت میں بیان کیا جاتا ہے، مثلاً کہنا ہو کہ آج سب لوگ فلاں جگہ عصر کی نماز پڑھیں، تو کہا جائے گا، آج سب لوگ عصر کی نماز فلاں جگہ پڑھ رہے ہیں یا پڑھیں گے۔ ¤ ➌ {هَلْ هُنَّ كٰشِفٰتُ ضُرِّهٖۤ … :} اللہ کے سوا ہستیوں کو مؤنث کے صیغے کے ساتھ ذکر کرنے سے ان کے بے اختیار ہونے کا اظہار اور ان کی تحقیر مراد ہے۔ ¤ ➍ ’’اللہ کے سوا نفع یا نقصان کا کوئی بھی مالک نہیں‘‘ یہ مضمون اللہ تعالیٰ نے مختلف طریقوں سے قرآن مجید میں جا بجا بیان فرمایا ہے۔ دیکھیے سورۂ رعد (۱۴ تا ۱۶)، فرقان (۳)، انعام (۱۷) اور سورۂ یونس (۱۰۶، ۱۰۷)۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 40،39) { قُلْ يٰقَوْمِ اعْمَلُوْا عَلٰى مَكَانَتِكُمْ …:} ان آیات کی تفسیر کے لیے دیکھیے  سورۂ انعام (۱۳۵) {’’ عَذَابٌ يُّخْزِيْهِ ‘‘} (وہ عذاب جو اسے رسوا کر دے گا) سے مراد دنیا کا عذاب اور {’’ عَذَابٌ مُّقِيْمٌ ‘‘} (ہمیشہ رہنے والا عذاب) سے مراد آخرت کا عذاب ہے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40،39) { قُلْ يٰقَوْمِ اعْمَلُوْا عَلٰى مَكَانَتِكُمْ …:} ان آیات کی تفسیر کے لیے دیکھیے  سورۂ انعام (۱۳۵) {’’ عَذَابٌ يُّخْزِيْهِ ‘‘} (وہ عذاب جو اسے رسوا کر دے گا) سے مراد دنیا کا عذاب اور {’’ عَذَابٌ مُّقِيْمٌ ‘‘} (ہمیشہ رہنے والا عذاب) سے مراد آخرت کا عذاب ہے۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) {اِنَّاۤ اَنْزَلْنَا عَلَيْكَ الْكِتٰبَ … :} کفار کے کفر پر اصرار سے رسول اللہ صلی اللہ علیہ وسلم کو سخت غم ہوتا تھا، اللہ تعالیٰ نے آپ کو تسلی دی کہ ہم نے آپ پر یہ کتاب حق کے ساتھ نازل کی ہے۔ اب جو شخص صحیح راستے پر چلے گا اس کا فائدہ خود اسی کو ہے اور جو گمراہ ہو گا اس کا وبال اسی پر ہے، آپ پر اس کی ذمہ داری نہیں، آپ کا فرض صرف پیغام حق پہنچانا ہے، وہ آپ نے ادا کر دیا، آگے معاملہ اللہ کے سپرد کریں، جس کے ہاتھ میں مارنا، زندہ کرنا، سلانا اور جگانا سب کچھ ہے۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ { اَللّٰهُ يَتَوَفَّى الْاَنْفُسَ حِيْنَ مَوْتِهَا … :} اس آیت سے معلوم ہوا کہ اللہ تعالیٰ آدمی کی جان موت کے وقت بھی قبض کرتا ہے اور نیند کے وقت بھی۔ گویا نیند بھی ایک طرح کی موت ہے، مگر اس میں روح قبض ہونے کے باوجود جسم کے ساتھ اس کا ایسا تعلق باقی رہتا ہے جس سے نبض چلتی، کھانا ہضم ہوتا اور سانس جاری رہتا ہے۔ اس تعلق کی پوری حقیقت ہم نہیں جانتے، کیونکہ روح کے معاملات کا علم صرف اللہ تعالیٰ کے پاس ہے، فرمایا : «وَ يَسْـَٔلُوْنَكَ عَنِ الرُّوْحِ قُلِ الرُّوْحُ مِنْ اَمْرِ رَبِّيْ وَ مَاۤ اُوْتِيْتُمْ مِّنَ الْعِلْمِ اِلَّا قَلِيْلًا » [ بني إسرائیل : ۸۵ ] ’’اور وہ تجھ سے روح کے بارے میں پوچھتے ہیں، کہہ دے روح میرے رب کے حکم سے ہے اور تمھیں علم میں سے بہت تھوڑے کے سوا نہیں دیا گیا۔‘‘ مگر اس کی ایک ادنیٰ سی مثال، جو پوری مثال نہیں ہے، بجلی کا کرنٹ ہے کہ اس کا مرکز کسی جگہ ہوتا ہے مگر ہزاروں میل دور اس کا تعلق کسی اور چیز سے بھی ہوتا ہے، جیسے ریڈیو، ٹیلی وژن، ریموٹ وغیرہ۔ اس سے عذاب قبر پر بھی روشنی پڑتی ہے کہ موت کے بعد روح قبض ہونے کے باوجود اس کا جسم کے ساتھ اللہ کے حکم سے کوئی ایسا تعلق رہتا ہے کہ اس پر قبر میں عذاب و ثواب کا سلسلہ بھی جاری رہتا ہے، انسان اپنے ناقص علم کی وجہ سے اسے سمجھ نہیں سکتا۔ اس لیے بعض لوگوں نے عذاب قبر کا انکار ہی کر دیا، حالانکہ قرآن و حدیث میں اس کے صاف دلائل موجود ہیں اور مومن کا کام یہ ہے کہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی بات ہر حال میں مانے، خواہ اس کی کیفیت اسے بتائی جائے یا نہ بتائی جائے۔ ¤ ➋ نیند کی حالت میں جان قبض ہونے کی وجہ سے رسول اللہ صلی اللہ علیہ وسلم نے اس پر موت کا لفظ استعمال فرمایا، اگرچہ یہ بڑی اور آخری موت سے پہلے موت کی ایک قسم ہے، جو زندگی میں آدمی پر بار بار آتی اور جاتی ہے، جیسا کہ فرمایا : «وَ هُوَ الَّذِيْ يَتَوَفّٰىكُمْ بِاللَّيْلِ وَ يَعْلَمُ مَا جَرَحْتُمْ بِالنَّهَارِ » [ الأنعام : ۶۰ ] ’’اور وہی ہے جو تمھیں رات کو قبض کر لیتا ہے اور جانتا ہے جو کچھ تم نے دن میں کمایا۔‘‘ حذیفہ رضی اللہ عنہ فرماتے ہیں : [ كَانَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ إِذَا أَوٰی إِلٰی  فِرَاشِهِ قَالَ بِاسْمِكَ أَمُوْتُ وَ أَحْيَا وَ إِذَا قَامَ قَالَ الْحَمْدُ لِلّٰهِ الَّذِيْ أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَ إِلَيْهِ النُّشُوْرُ ] [ بخاري، الدعوات، باب ما یقول إذا نام : ۶۳۱۲ ] ’’نبی صلی اللہ علیہ وسلم جب بستر پر جاتے توکہتے : ’’تیرے ہی نام کے ساتھ مرتا ہوں اور زندہ ہوتا ہوں۔‘‘ اور جب بیدار ہوتے توکہتے : ’’سب تعریف اللہ کے لیے ہے جس نے ہمیں زندگی بخشی، اس کے بعد کہ اس نے ہمیں موت دی اور اسی کی طرف اٹھ کر جانا ہے۔‘‘ ¤ ➌ بعض اہلِ علم نے یہاں روح کی دو قسمیں بنائی ہیں، ایک روح حیوانی اور ایک روح نفسانی اور بعض نے نفس کو الگ اور روح کو الگ قرار دیا ہے، مگر یہ بات قرآن یا حدیث سے ثابت نہیں، بلکہ جس طرح قرآن مجید میں نیند کے وقت نفسوں کو قبض کرنے کا ذکر ہے اسی طرح بخاری، ابوداؤد، نسائی اور مسند احمد وغیرہ میں نیند کے وقت ارواح کو قبض کرنے کا ذکر ہے۔ چنانچہ ابوقتادہ رضی اللہ عنہ نے ایک سفر میں رسول اللہ صلی اللہ علیہ وسلم اور تمام صحابہ رضی اللہ عنھم کے رات کے سفر کے دوران سو جانے کا اور سورج نکلنے کے بعد بیدار ہونے کا ذکر کیا ہے، اس موقع پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ قَبَضَ أَرْوَاحَكُمْ حِيْنَ شَاءَ، وَ رَدَّهَا عَلَيْكُمْ حِيْنَ شَاءَ] [بخاري، مواقیت الصلاۃ، باب الأذان بعد ذھاب الوقت : ۵۹۵ ] ’’اللہ تعالیٰ نے تمھاری ارواح کو قبض کر لیا جب چاہا اور انھیں تمھیں واپس کر دیا جب چاہا۔‘‘ اس بحث سے معلوم ہوا نیند کے وقت قبض ہونے والی چیز نفس بھی کہلاتی ہے اور روح بھی۔ ¤ ➍ { وَ يُرْسِلُ الْاُخْرٰۤى اِلٰۤى اَجَلٍ مُّسَمًّى :} مقرر وقت سے مراد بڑی اور آخری موت ہے۔ ¤ ➎ { اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّتَفَكَّرُوْنَ:} غور و فکر کرنے والوں کے لیے اس میں بہت سی نشانیاں ہیں، جن میں سب سے پہلی تو اللہ کا وحدہ لا شریک لہ ہونا ہے کہ موت و حیات اور سلانے اور جگانے کا سلسلہ صرف اس کے ہاتھ میں ہے، اگر اس کا کوئی شریک ہوتا تو یہ اختیار یا اس کا کچھ حصہ اس کے پاس بھی ہوتا، اس لیے ہر طرح کی عبادت کا حق دار اللہ تعالیٰ ہے، یہی دلیل اللہ کے خلیل علیہ السلام نے پیش فرمائی تھی : « رَبِّيَ الَّذِيْ يُحْيٖ وَ يُمِيْتُ» [ البقرۃ : ۲۵۸ ] ’’میرا رب وہ ہے جو زندگی بخشتا اور موت دیتا ہے۔‘‘ دوسری نشانی یہ ہے کہ جو پروردگار ہر روز موت دیتا ہے اور مرنے کے بعد زندگی عطا کرتا ہے وہ قیامت کے دن بھی تمام مُردوں کو زندہ کرنے پر قادر ہے اور یقینا انھیں زندہ کرے گا اور وہی اکیلا سب کا فیصلہ کرے گا، کوئی اس کی مرضی کے بغیر سفارش بھی نہیں کر سکے گا، جیسا کہ اگلی آیت میں آ رہا ہے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ { اَمِ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ شُفَعَآءَ :} یعنی بجائے اس کے کہ یہ لوگ موت اور نیند کی کیفیت سے کوئی سبق حاصل کریں اور ہر معاملے کا مختار صرف اللہ تعالیٰ کو سمجھیں، انھوں نے کچھ دوسرے معبود بنا لیے ہیں، جنھیں وہ اللہ کے حضور سفارشی سمجھتے ہیں۔ ¤ ➋ {قُلْ اَوَ لَوْ كَانُوْا لَا يَمْلِكُوْنَ شَيْـًٔا وَّ لَا يَعْققِلُوْنَ : ’’ كَانُوْا ‘‘} کی وجہ سے {’’ لَا يَمْلِكُوْنَ شَيْـًٔا ‘‘} کی نفی میں استمرار پیدا ہو گیا ہے، اس لیے ترجمہ کیا گیا ہے ’’کیا اگرچہ وہ کبھی نہ کسی چیز کے مالک ہوں اور نہ عقل رکھتے ہوں۔‘‘ یعنی کیا پھر بھی یہ لوگ انھیں اپنا سفارشی سمجھ کر ان کی پوجا کرتے رہیں گے، ان کے نام کی نذر و نیاز مانتے رہیں گے اور اپنی دعاؤں میں ان کا وسیلہ ڈالتے رہیں گے؟ ظاہر ہے جن ہستیوں کو بھی یہ پکارتے ہیں وہ نہ ان کی بات سنتے ہیں نہ سمجھتے ہیں، کیونکہ سمجھی تو وہی بات جاتی ہے جو سننے میں آئے، بلکہ وہ فوت شدہ ہیں زندہ نہیں ہیں، خود انھیں اپنے متعلق علم نہیں کہ کب اٹھائے جائیں گے۔ دیکھیے سورۂ نحل (۲۰، ۲۱)، فاطر (۱۳، ۱۴) اور احقاف (۵، ۶)۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) {قُلْ لِّلّٰهِ الشَّفَاعَةُ جَمِيْعًا … :} لفظ {’’ لِّلّٰهِ ‘‘} پہلے آنے سے کلام میں حصر پیدا ہو گیا۔ یعنی آپ ان سے کہہ دیں کہ سفارش کی تمام صورتوں کا مالک تو صرف اللہ تعالیٰ ہے، اس کی اجازت کے بغیر کوئی سفارش کر ہی نہیں سکتا، اس لیے اسی کو پکارنا چاہیے، کیونکہ وہ اجازت دے گا تو کوئی سفارش کرے گا۔ سفارش ہی نہیں آسمان و زمین کی بادشاہی اسی کی ہے، کسی اور کا دخل نہ سفارش میں ہے نہ بادشاہی میں، پھر تم اسی کی طرف لوٹائے جاؤ گے۔ شاہ عبد القادر رحمہ اللہ لکھتے ہیں : ’’یعنی اللہ کے روبرو سفارش ہے، پر اللہ کے حکم سے، نہ کہ تمھارے کہے سے، جب موت آئے کسی کے کہے سے عزرائیل نہیں چھوڑتا۔‘‘ (موضح) (یاد رہے! ملک الموت کا نام عزرائیل کتاب و سنت سے ثابت نہیں) شفاعت کے متعلق دیکھیے آیت الکرسی (بقرہ : ۲۵۵) کی تفسیر۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ {وَ اِذَا ذُكِرَ اللّٰهُ وَحْدَهُ … : ’’اِشْمَأَزَّ‘‘} نفرت سے بھر گیا، تنگ پڑ گیا۔ یہ بات دنیا بھر کے مشرکوں میں مشترک ہے، خواہ وہ نام کے مسلمان کیوں نہ ہوں کہ کوئی شخص اکیلے اللہ کا اور اس کی کبریائی اور توحید کا ذکر کرے تو ان کے دل نفرت سے بھر جاتے ہیں اور تنگ پڑ جاتے ہیں اور ان کے چہروں پر ناگواری اور نفرت کے آثار نمایاں ہو جاتے ہیں۔ کہتے ہیں یہ شخص اولیاء اور بزرگوں کو نہیں مانتا، اسی لیے صرف اللہ ہی کی بات کرتا چلا جاتا ہے، نہ کسی ولی کی قوت و تصرف کا ذکر کرتا ہے جو (ان کے خیال میں) اللہ تعالیٰ کی تقدیر کا تیر راستے سے واپس ہٹا لاتے ہیں اور نہ کسی دستگیر یا گنج بخش یا مشکل کُشا کی دستگیری یا مشکل کُشائی کا بیان کرتا ہے، جیسا کہ اللہ تعالیٰ نے دوسری جگہ فرمایا : « وَ اِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْاٰنِ وَحْدَهٗ وَلَّوْا عَلٰۤى اَدْبَارِهِمْ نُفُوْرًا» [ بني إسرائیل : ۴۶ ] ’’اور جب تو قرآن میں اپنے رب کا، اکیلے اسی کا ذکر کرتا ہے تو وہ بدکتے ہوئے اپنی پیٹھوں پر پھر جاتے ہیں۔‘‘ ¤ ➋ { الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ :} یعنی اکیلے اللہ کے ذکر پر ان کے دلوں کے تنگ پڑنے کی وجہ آخرت پر یقین نہ ہونا ہے، اگر آخرت پر یقین ہوتا اور وہ ایمان رکھتے کہ ہمیں اس دن اس اکیلے کے سامنے پیش ہو کر اپنے اعمال کا حساب دینا ہے تو وہ ایسا کبھی نہ کرتے۔ ¤ ➌ {وَ اِذَا ذُكِرَ الَّذِيْنَ مِنْ دُوْنِهٖۤ … : ’’ يَسْتَبْشِرُوْنَ‘‘} باب استفعال میں حروف زیادہ ہونے کی وجہ سے معنی میں بھی زیادتی ہوتی ہے، یعنی بہت خوش ہو جاتے ہیں، جیسا کہ {’’ اشْمَاَزَّتْ ‘‘} میں حروف کی زیادتی ان کی نفرت اور دل کی تنگی کے زیادہ ہونے کا اظہار کرتی ہے۔ {’’اِشْمِئْزَازٌ‘‘} اور {’’اِسْتِبْشَارٌ‘‘} کے الفاظ سے ظاہر ہے کہ اکیلے اللہ کے ذکر پر دل کی تنگی میں اور من دون اللہ کے ذکر پر اس کی خوشی میں وہ انتہا کو پہنچے ہوئے ہوتے ہیں۔ {’’ اِذَا ‘‘} مفاجات کے لیے ہے ’’اچانک‘‘ یعنی جب اللہ تعالیٰ کے ساتھ یا اس کے بغیر اس کے سوا اور ہستیوں کا ذکر کیا جائے اور ان کی جھوٹی سچی کرامات بیان ہونا شروع ہوں تو اچانک ان کے چہروں پر خوشی پھیل جاتی ہے۔ مفسر آلوسی نے روح المعانی میں اپنا تجربہ لکھا ہے کہ ایک دن میں نے ایک آدمی سے کہا جو اپنی کسی مشکل میں کسی فوت شدہ سے استغاثہ کر رہا تھا اور اسے پکار کر کہہ رہا تھا کہ اے فلاں! میری مدد کر۔ میں نے اس سے کہا، تم ’’یا اللہ‘‘ کہو، کیونکہ اللہ تعالیٰ نے فرمایا ہے : « وَ اِذَا سَاَلَكَ عِبَادِيْ عَنِّيْ فَاِنِّيْ قَرِيْبٌ اُجِيْبُ دَعْوَةَ الددَّاعِ اِذَا دَعَانِ » [ البقرۃ : ۱۸۶ ] ’’اور جب میرے بندے تجھ سے میرے بارے میں سوال کریں تو بے شک میں قریب ہوں، میں پکارنے والے کی دعا قبول کرتا ہوں جب وہ مجھے پکارتا ہے۔‘‘ تو وہ شخص سخت غصے میں آ گیا۔ بعد میں لوگوں نے مجھے بتایا کہ وہ کہتا تھا، یہ شخص اولیاء کا منکر ہے۔ کچھ لوگوں نے مجھے یہ بھی بتایا کہ اس نے کہا، اللہ تعالیٰ کی بہ نسبت ولی جلدی سن لیتے ہیں۔ اللہ تعالیٰ ہمیں گمراہی سے محفوظ رکھے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { قُلِ اللّٰهُمَّ فَاطِرَ السَّمٰوٰتِ وَ الْاَرْضِ … :} کفار کو توحید کی دعوت دیتے ہوئے رسول اللہ صلی اللہ علیہ وسلم نے جو مشقتیں اٹھائیں اور ان کی ضد، عناد اور ہٹ دھرمی کی وجہ سے آپ کو جو تکلیفیں پہنچیں اور توحید کے واضح دلائل کے سامنے لاجواب ہو کر بھی وہ جس طرح شرک پر ڈٹے رہے، اس پر آپ صلی اللہ علیہ وسلم کو تسلی دینے کے لیے حکم دیا گیا کہ آپ اللہ تعالیٰ سے دعا کریں اور سارا معاملہ اس کے سپرد کریں، کیونکہ وہی آسمان و زمین کو پیدا کرنے والا ہے، ہر چیز پر قادر ہے اور مخلوق کے تمام حاضر و غائب احوال کو جاننے والا ہے۔ اس لیے ان اسماء و صفات کے وسیلے سے اس سے دعا کریں کہ جب تیری توحید جیسی روشن اور واضح بات میں بھی جھگڑے ہونے لگے اور زمین و آسمان کو پیدا کرنے والے اور حاضر و غائب کو جاننے والے کا وقار بھی دلوں میں نہ رہا تو اب تجھی سے فریاد ہے، تو ہی ان جھگڑوں کا فیصلہ فرمائے گا۔ ¤ ➋ ابو سلمہ بن عبد الرحمن بیان کرتے ہیں کہ میں نے عائشہ رضی اللہ عنھا سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم رات قیام کرتے تو اپنی نماز کا افتتاح کس چیز سے کرتے تھے؟ انھوں نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم رات اٹھتے تو اپنی نماز کا افتتاح اس دعا سے کرتے : [ اَللّٰهُمَّ رَبَّ جِبْرَائِيْلَ وَ مِيْكَائِيْلَ وَ إِسْرَافِيْلَ فَاطِرَ السَّمَاوَاتِ وَ الْأَرْضِ عَالِمَ الْغَيْبِ وَ الشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِ عِبَادِكَ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ اهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلٰی صِرَاطٍ مُّسْتَقِيْمٍ ] [ مسلم، صلاۃ المسافرین، باب صلاۃۃ النبي صلی اللہ علیہ وسلم و دعائہ باللیل : ۷۷۰ ] ’’اے اللہ! اے جبرائیل، میکائیل اور اسرافیل کے رب! اے آسمان و زمین کو پیدا کرنے والے! اے حاضر و غائب کو جاننے والے! تو ہی اپنے بندوں کے درمیان اس چیز کا فیصلہ کرے گا جس میں وہ اختلاف کیا کرتے تھے، مجھے حق کی ان تمام باتوں میں اپنے اذن سے سیدھی راہ پر لگا جن میں اختلاف کیا گیا ہے، کیونکہ تو ہی سیدھے راستے پر لگاتا ہے جسے چاہتا ہے۔‘‘ ¤ ابوراشد حُبرانی کہتے ہیں، میں نے عبد اللہ بن عمرو رضی اللہ عنھما سے کہا کہ آپ نے رسول اللہ صلی اللہ علیہ وسلم سے جو کچھ سنا ہے اس میں سے کچھ ہمیں بیان کریں تو انھوں نے میرے سامنے ایک کتاب نکال کر کہا، یہ ہے وہ کتاب جو مجھے رسول اللہ صلی اللہ علیہ وسلم نے لکھوائی ہے۔ میں نے دیکھا تو اس میں لکھا تھا کہ ابوبکر رضی اللہ عنہ نے کہا : ’’یا رسول اللہ! آپ مجھے سکھائیں کہ میں صبح اور شام کو کیا پڑھوں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اے ابوبکر! یہ پڑھو : [ اَللّٰهُمَّ فَاطِرَ السَّمٰوَاتِ وَ الْأَرْضِ عَالِمَ الْغَيْبِ وَ الشَّهَادَةِ لَا إِلٰهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَ مَلِيْكَهُ أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ وَ مِنْ شَرِّ الشَّيْطَاننِ وَ شِرْكِهِ وَ أَنْ أَقْتَرِفَ عَلٰی نَفْسِيْ سُوْءًا أَوْ أَجُرَّهُ إِلٰی مُسْلِمٍ ] [ ترمذي، الدعوات، باب دعاء علمہمہ صلی اللہ علیہ وسلم أبا بکر… : ۳۵۲۹، و قال الألباني صحیح ] ’’اے اللہ! اے آسمان و زمین کو پیدا کرنے والے، غائب و حاضر کو جاننے والے! تیرے سوا کوئی معبود برحق نہیں، اے ہر چیز کے رب اور اس کے بادشاہ! میں تجھ سے اپنے نفس کے شر سے اور شیطان کے شر اور اس کے شرک سے تیری پناہ مانگتا ہوں اور اس بات سے پناہ مانگتا ہوں کہ میں اپنے نفس پر کسی برائی کا ارتکاب کروں یا کسی مسلم کا برا کروں۔‘‘"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {وَ لَوْ اَنَّ لِلَّذِيْنَ ظَلَمُوْا … :} ظلم کرنے والوں سے مراد مشرک ہیں، انھی کا ذکر مسلسل آ رہا ہے۔ مشرکین کے اقوال و احوال کا ذکر اور ان کا رد کرنے کے بعد ان کا انجام بیان فرمایا کہ آخرت کے دن اگر ان کے پاس وہ سب کچھ ہو جو زمین میں ہے اور اس کے ساتھ اتنا اور بھی ہو تو قیامت کے دن کے برے عذاب سے بچنے کے لیے اسے ضرور ہی فدیے میں دے دیں گے اور ان کی خواہش ہو گی کہ یہ سب کچھ دے کر ان کی جان عذاب سے بچ جائے۔ (دیکھیے یونس : ۵۴) مگر ان کی یہ خواہش کبھی پوری نہیں ہو گی۔ دیکھیے سورۂ بقرہ (۴۸ اور ۱۲۳)، آل عمران (۹۱)، مائدہ (۳۶، ۳۷)، انعام (۷۰)، رعد (۱۸) اور سورۂ حدید (۱۵)۔ ¤ ➋ { وَ بَدَا لَهُمْ مِّنَ اللّٰهِ … :} یعنی جس طرح جنت والوں کو وہ نعمتیں ملیں گی جو نہ کسی آنکھ نے دیکھیں، نہ کسی کان نے سنیں اور نہ کسی آدمی کے دل میں ان کا خیال آیا (دیکھیے سجدہ : ۱۷) ایسے ہی کفار کے سامنے اللہ کی طرف سے ایسے ایسے عذاب آئیں گے جن کا وہ گمان بھی نہ کرتے تھے۔ ایک تفسیر یہ بھی ہے کہ وہ قیامت کے دن اپنے متعلق جو جھوٹی امیدیں رکھے ہوئے تھے اور اپنے حاجت رواؤں اور مشکل کُشاؤں کی دستگیری کے متعلق ان کے جو گمان تھے اس دن ان کے سامنے اللہ کی طرف سے اس کے برعکس وہ کچھ پیش آئے گا جس کا وہ گمان بھی نہیں کرتے تھے اور جن اعمال کو وہ نیکیاں سمجھتے تھے وہ برائیوں کی صورت میں ان کے سامنے ظاہر ہوں گے۔ سفیان ثوری سے مروی ہے کہ انھوں نے یہ آیت پڑھی اور فرمایا : {’’وَيْلٌ لِأَهْلِ الرِّيَاءِ، وَيْلٌ لِأَهْلِ الرِّيَاءِ‘‘} ’’دکھاوے والوں کے لیے ہلاکت ہے، دکھاوے والوں کے لیے ہلاکت ہے۔‘‘ (الوسیط) کیونکہ قیامت کے دن انھیں امید کے برعکس معاملہ پیش آئے گا، جیسا کہ ریا کار عالم، شہید اور سخی والی حدیث میں مذکور ہے۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) {وَ بَدَا لَهُمْ سَيِّاٰتُ مَا كَسَبُوْا … :} اور ان کے سامنے ان کے اعمال کی برائیاں یعنی ان کے برے نتائج ظاہر ہو جائیں گے اور وہی عذاب جس کا وہ مذاق اڑایا کرتے تھے انھیں چاروں طرف سے گھیر لے گا۔ [ أَعَاذَنَا اللّٰہُ مِنْہُ ]"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { فَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ … : ’’خَوَّلَ يُخَوِّلُ‘‘} کسی معاوضے کے بغیر کوئی عطیہ دینا۔ اس آیت میں مشرک انسان کی ایک اور قبیح صفت بیان کی گئی ہے کہ جب اسے کوئی بڑی تکلیف پہنچتی ہے، مثلاً فقر یا بیماری یا سیلاب یا طوفان وغیرہ، تو اپنے جھوٹے معبودوں کو چھوڑ کر ایک اللہ کو پکارتا ہے، ({’’ ثُمَّ ‘‘} تراخی کے لیے ہے، جس سے ظاہر ہے کہ اللہ تعالیٰ کی طرف سے وہ نعمت کچھ مدت کے بعد ملتی ہے) پھر ایک مدت تک اس تکلیف میں رہنے اور بار بار لیٹے، بیٹھے اور کھڑے ہر حال میں اس سے فریاد کرنے اور اسے پکارنے کے بعد جب وہ اسے اس تکلیف سے نجات کی نعمت، یا کوئی بھی نعمت محض اپنے خاص فضل سے عطا کرتا ہے تو وہ اللہ تعالیٰ کو سرے سے بھول جاتا ہے اور کہتا ہے، یہ تو مجھے صرف ایک علم کی بنا پر دی گئی ہے، مثلاً فقر کے بعد مال ملتا ہے تو کہتا ہے، یہ میرے دولت کمانے کے ہنر کی وجہ سے ملا ہے، اگر بیماری کے بعد شفا مل جائے تو کہتا ہے، یہ میری یا فلاں صاحب کی طب میں مہارت کی وجہ سے ملی ہے۔ ¤ ➋ { اِنَّمَاۤ اُوْتِيْتُهٗ عَلٰى عِلْمٍ :} ’’مجھے یہ (نعمت) ایک علم کی بنیاد پر دی گئی ہے‘‘ یعنی اپنے رب کے سارے احسان بھلا کر اس قدر بیگانہ ہو جاتا ہے کہ نعمت دینے والے کا نام تک لینا گوارا نہیں کرتا، بلکہ کہتا ہے ’’مجھے یہ نعمت دی گئی ہے‘‘ یہ احسان فراموشی اور نمک حرامی کی انتہا ہے، کوئی اس سے پوچھے، کیا تیرے باپ نے تجھے یہ نعمت دی ہے؟ ¤ ➌ یہاں ایک سوال ہے کہ اس سے پہلے اسی سورت کی آیت (۸) میں یہی الفاظ ’’واؤ‘‘ کے ساتھ آئے ہیں : « فَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ » یہاں ’’فاء‘‘ کے ساتھ {’’ فَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ ‘‘} لانے میں کیا حکمت ہے؟ جواب اس کا یہ ہے (واللہ اعلم) کہ ’’فاء‘‘ کے ذریعے سے اس جملے کا تعلق {’’ وَ اِذَا ذُكِرَ اللّٰهُ وَحْدَهُ اشْمَاَزَّتْ ‘‘} کے ساتھ ہے، درمیان کے جملے معترضہ ہیں، یعنی ان جاہلوں کا تضاد دیکھو کہ کبھی ان کا یہ حال ہوتا ہے کہ اللہ اکیلے کے ذکر پر ان کے دل نفرت سے بھر جاتے اور سخت تنگ پڑ جاتے ہیں اور اس کے غیر کے ذکر پر ان کے دل کی کلی کھل اٹھتی ہے اور وہ بہت خوش ہو جاتے ہیں (اور دوسرے وقت ان کا یہ حال ہوتا ہے کہ) پھر جب انھیں کوئی بڑی تکلیف پہنچتی ہے {’’ فَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ دَعَانَا ‘‘} تو اسی اللہ کو پکارتے ہیں جس کے ذکر پر ان کے دل تنگ پڑ جاتے تھے اور ان غیروں کا نام بھی نہیں لیتے جن کے ذکر پر وہ بہت خوش ہو جاتے تھے۔ ¤ ➍ { بَلْ هِيَ فِتْنَةٌ:} یعنی وہ نعمت اسے اس کے علم کی بنا پر نہیں بلکہ آزمائش کے لیے دی گئی ہے کہ وہ عطا کرنے والے کا شکر ادا کرتا ہے یا اس کی نعمت کی ناشکری اور کفر و شرک پر اصرار کرتا ہے۔ ¤ ➎ { وَ لٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ :} یعنی اکثر لوگ نہیں جانتے کہ مال و جاہ، صحت و قوت بلکہ ہر ایک نعمت محض اللہ کے فضل سے عطا ہوتی ہے، اس میں کسی کی عقل یا علم کا کوئی دخل نہیں، کیونکہ بہت سے علم و عقل والے کنگال، بیمار اور کمزور ہوتے ہیں، انھیں کہیں پناہ نہیں ملتی اور بہت سے علم و عقل سے عاری مال و دولت، صحت و قوت اور بے شمار نعمتوں سے مالا مال ہوتے ہیں۔ ’’اکثر لوگ‘‘ اس لیے فرمایا کہ تھوڑے لوگ اس حقیقت کو جانتے ہیں، پھر ان میں سے بعض تو ایمان لے آتے ہیں اور ہر حال میں اپنے رب پر صابر و شاکر رہتے ہیں اور بعض جاننے کے باوجود ضد اور عناد سے ناشکری اور کفر اختیار کرتے ہیں۔ یہ بھی {’’ لَا يَعْلَمُوْنَ ‘‘} ہی میں داخل ہیں، کیونکہ جو علم عمل سے آراستہ نہ ہو وہ لاعلمی ہی ہے۔ {’’ لَا يَعْلَمُوْنَ ‘‘} میں یہ بھی داخل ہے کہ اکثر لوگ نہیں جانتے کہ نعمتوں کی یہ فراوانی اگر شکر اور ایمان کا باعث نہ بنے تو اللہ کے راضی ہونے یا ان کے نعمتوں کے حق دار ہونے کی دلیل نہیں، بلکہ استدراج ہے اور ان کے ذریعے سے ان پر حجت تمام ہو رہی ہے۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ { قَدْ قَالَهَا الَّذِيْنَ مِنْ قَبْلِهِمْ:} یعنی ان کفار قریش اور ان کے زمانے اور بعد میں آنے والے کفار سے پہلے بھی بہت سے لوگوں کا یہی عقیدہ اور یہی کہنا تھا، جیسا کہ قارون کو اس کی قوم نے نصیحت کی تو اس نے کہا : « اِنَّمَاۤ اُوْتِيْتُهٗ عَلٰى عِلْمٍ عِنْدِيْ » [ القصص : ۷۸ ] ’’(یہ سب کچھ) مجھے تو ایک علم کی بنا پر دیا گیا ہے جو میرے پاس ہے۔‘‘ قارون کے واقعہ کی تفصیل کے لیے دیکھیے سورۂ قصص (۷۶ تا ۸۲ )۔ ¤ ➋ { فَمَاۤ اَغْنٰى عَنْهُمْ مَّا كَانُوْا يَكْسِبُوْنَ :} یعنی یہ کہنے والوں پر کہ ’’ہمیں سب کچھ ہمارے علم کی بنا پر دیا گیا ہے‘‘ جب اللہ تعالیٰ کا عذاب آیا، جیسا کہ قارون کو اس کے مال و محلات سمیت زمین میں دھنسا دیا گیا، تو انھوں نے جو مال، اولاد کمائے تھے اور جو دنیوی مہارت حاصل کی تھی وہ ان کے کسی کام نہ آئی۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ { فَاَصَابَهُمْ سَيِّاٰتُ مَا كَسَبُوْا : ’’ سَيِّاٰتُ ‘‘} سے مراد ان کے اعمال کے برے نتائج اور وبال ہیں، یعنی ان کے اعمالِ بد کے نتائج ان پر مختلف عذابوں کی صورت میں آ پڑے۔ ¤ ➋ { وَ الَّذِيْنَ ظَلَمُوْا مِنْ هٰۤؤُلَآءِ … :} یہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے کے اور بعد کے تمام کفار کو تنبیہ ہے کہ اگر پہلے لوگوں کی طرح وہ بھی ناشکری اور ظلم (کفر و شرک) سے باز نہ آئے تو ان کے اعمال کے برے نتائج بہت جلد ان پر آ پڑیں گے۔ ¤ ➌ { وَ مَا هُمْ بِمُعْجِزِيْنَ : ’’ بِمُعْجِزِيْنَ ‘‘} کی باء نفی کی تاکید کے لیے ہے، اس لیے ترجمہ کیا گیا ہے کہ ’’وہ ہر گز عاجز کرنے والے نہیں ہیں۔‘‘ یعنی جب ان کے اعمال کے برے نتائج اور وبال مختلف عذابوں کی صورت میں ان پر آئے تو یہ نہ انھیں روک سکیں گے اور نہ کسی صورت یہ ہو گا کہ وہ اللہ تعالیٰ کو عاجز اور بے بس کرکے اس کی گرفت سے نکل کر بھاگ جائیں، یا چھپ جائیں۔ چنانچہ ان میں سے جو زندہ رہے ان پر دنیا ہی میں قحط، خوف، جنگ، قید اور قتل کی صورت میں اللہ کے عذاب آئے اور فوت ہونے والوں کے لیے عذاب شدید انتظار میں ہے۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ {اَوَ لَمْ يَعْلَمُوْۤا اَنَّ اللّٰهَ يَبْسُطُ الرِّزْقَ … :} پچھلی آیات میں بیان ہوا ہے کہ موجودہ اور پہلے کفار کا دھوکے میں مبتلا ہونے کا باعث انھیں عطا ہونے والا مال اور دوسری نعمتیں ہیں۔ انھوں نے اپنی جہالت سے یہ سمجھا کہ مال و دولت کی کثرت ان کی اپنی مہارت و قابلیت اور علم و عقل کا نتیجہ ہے اور یہ ان کے حق پر ہونے کی اور اللہ تعالیٰ کے ان پر خوش ہونے کی دلیل ہے۔ فرمایا، نہ رزق کی کشادگی کسی شخص کے علم و عقل یا مہار ت پر موقوف ہے نہ اس کا تنگ ہونا کسی کے علم و عقل یا مہارت کی کمی کی وجہ سے ہے اور نہ اس کی زیادتی یا کمی اللہ تعالیٰ کے خوش یا ناخوش ہونے کی دلیل ہے، بلکہ یہ صرف اور صرف اللہ تعالیٰ کی مشیّت پر موقوف ہے، وہ جس کا رزق جب چاہتا ہے فراخ کر دیتا ہے، خواہ وہ نیک ہو یا بد اور جب چاہتا ہے تنگ کر دیتا ہے، نیک ہو یا بد اور اس کی حکمت اس کے سوا کوئی نہیں جانتا۔ اگر رزق علم و عقل اور مہارت و قابلیت پر موقوف ہوتا تو کوئی عالم و عاقل رزق کی تنگی میں مبتلا نہ ہوتا اور نہ ہی کسی جاہل یا کم عقل کو رزق یا دوسری نعمتوں کی فراوانی حاصل ہوتی۔ ¤ ➋ { اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يُّؤْمِنُوْنَ :} یعنی رزق کی فراخی اور تنگی میں ایمان والوں کے لیے بہت سی نشانیاں ہیں، کیونکہ اس سے وہی فائدہ اٹھاتے اور عبرت حاصل کرتے ہیں، کیونکہ وہی ایمان رکھتے ہیں کہ رزق فراخ کرنے والا اور اسے تنگ کرنے والا صرف اللہ تعالیٰ ہے اور وہ یہ فیصلہ کسی کے نیک یا بد ہونے کی بنا پر نہیں بلکہ اپنی حکمت و رحمت کے تحت کرتا ہے، کیونکہ وہ اپنے بندوں کا حال بہتر جانتا ہے۔ کبھی وہ اپنے بندے کا رزق تنگ کر دیتا ہے کہ اگر اس کا رزق فراخ کر دیا تو یہ سرکشی اور بغاوت پر اتر آئے گا، کبھی اس کا امتحان مقصود ہوتا ہے کہ آیا وہ اس فقر و فاقہ میں صبر کرتا ہے یا اللہ تعالیٰ کا شکوہ کرتا اور اسے کوسنا شروع کر دیتا ہے۔ کبھی وہ دل جوئی اور انعام کے طور پر یا حجت تمام کرنے کے لیے رزق فراخ کر دیتا ہے۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ {قُلْ … :} سورت کی ابتدا سے یہاں تک مختلف طریقوں سے شرک کی تردید اور مشرکین کو وعید کا ایک لمبا سلسلہ چلا آ رہا ہے، جس کی پروا بظاہر کافر و مشرک لوگ نہیں کرتے، مگر اللہ تعالیٰ کے اس قدر پرزور کلام سے ان کے دلوں میں خوف کا پیدا ہونا ایک فطری چیز ہے، جو حد سے بڑھ جائے تو نتیجہ یاس اور ناامیدی کی صورت میں ظاہر ہوتا ہے۔ اس لیے اللہ تعالیٰ ہر جگہ ڈرانے کے ساتھ بشارت کا بیان بھی ضرور فرماتا ہے، تاکہ ایسا نہ ہو کہ اس کے بندے ناامید ہو کر اس کی جناب میں آنے کی جرأت ہی نہ کریں، اور بشارت اور ترغیب کے ساتھ ترہیب اور ڈرانے کا بیان بھی فرماتا ہے، تاکہ وہ بے خوف نہ ہو جائیں، جیسا کہ جراح نشتر بھی لگاتا ہے اور مرہم بھی رکھتا ہے، پھر پرہیز کی تاکید کرتا ہے اور بد پرہیزی کے انجام سے ڈراتا ہے، فرمایا : «نَبِّئْ عِبَادِيْۤ اَنِّيْۤ اَنَا الْغَفُوْرُ الرَّحِيْمُ (49) وَ اَنَّ عَذَابِيْ هُوَ الْعَذَابُ الْاَلِيْمُ» [ الحجر : ۴۹، ۵۰ ] ’’میرے بندوں کو خبر دے دے کہ بے شک میں ہی بے حد بخشنے والا، نہایت رحم والاہوں۔ اور یہ بھی کہ بے شک میرا عذاب ہی دردناک عذاب ہے۔‘‘ اور فرمایا : «وَ اِنَّ رَبَّكَ لَذُوْ مَغْفِرَةٍ لِّلنَّاسِ عَلٰى ظُلْمِهِمْ وَ اِنَّ رَبَّكَ لَشَدِيْدُ الْعِقَابِ» [ الرعد : ۶ ] ’’اور بے شک تیرا رب یقینا لوگوں کے لیے ان کے ظلم کے باوجود بڑی بخشش والا ہے اور بلاشبہ تیرا رب یقینا بہت سخت سزا والا ہے۔‘‘ یہاں بھی وعید کے لمبے سلسلے کے بعد اپنے بندوں کو {’’ لَا تَقْنَطُوْا ‘‘} کے ساتھ اپنی رحمت کی امید دلائی اور بعد کی آیات میں انھیں جلد از جلد توبہ کی تلقین فرما کر وقت ہاتھ سے نکلنے سے ڈرایا ہے۔ ¤ ➋ {يٰعِبَادِيْ:} بندے مومن ہوں یا کافر، سب اللہ کے بندے ہیں، اس لیے قرآن مجید میں {’’عِبَادِيْ‘‘} کا لفظ دونوں کے لیے استعمال ہوا ہے، جیسا کہ مومن و کافر دونوں فریقوں کو اپنے بندے قرار دیا : «اِنَّهٗ كَانَ فَرِيْقٌ مِّنْ عِبَادِيْ يَقُوْلُوْنَ رَبَّنَاۤ اٰمَنَّا» [ المؤمنون : ۱۰۹ ] ’’بے شک حقیقت یہ ہے کہ میرے بندوں میں سے کچھ لوگ تھے جو کہتے تھے اے ہمارے رب! ہم ایمان لے آئے۔‘‘ اور کفار کو اپنے بندے کہا : «وَ يَوْمَ يَحْشُرُهُمْ وَ مَا يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ فَيَقُوْلُ ءَاَنْتُمْ اَضْلَلْتُمْ عِبَادِيْ هٰۤؤُلَآءِ اَمْ هُمْ ضَلُّوا السَّبِيْلَ» [ الفرقان : ۱۷ ] ’’اور جس دن وہ انھیں اور جن کو وہ اللہ کے سوا پوجتے تھے، اکٹھا کرے گا، پھر کہے گا کیا تم نے میرے ان بندوں کو گمراہ کیا، یا وہ خود راستے سے بھٹک گئے تھے؟‘‘ اور دیکھیے سورۂ زمر (۱۶) مگر اس کا اکثر استعمال اللہ کے مخلص اور مومن بندوں کے لیے ہوا ہے، جیسا کہ فرمایا : «اِنَّ عِبَادِيْ لَيْسَ لَكَ عَلَيْهِمْ سُلْطٰنٌ» [ الحجر : ۴۲ ] ’’بے شک میرے بندے، تیرا ان پر کوئی غلبہ نہیں۔‘‘ ¤ ➌ {الَّذِيْنَ اَسْرَفُوْا عَلٰۤى اَنْفُسِهِمْ :} اس آیت میں {’’ يٰعِبَادِيْ‘‘} سے مراد قرآن مجید کے اکثر استعمال کے خلاف کفار و مشرکین ہیں، اس کی دلیل اس کے بعد کی آیات ہیں، جیسا کہ فرمایا : «وَ اَسْلِمُوْا لَهٗ مِنْ قَبْلِ اَنْ يَّاْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنْصَرُوْنَ» [الزمر : ۵۴ ] ’’اور اس کے مطیع ہو جاؤ، اس سے پہلے کہ تم پر عذاب آ جائے، پھر تمھاری مدد نہیں کی جائے گی۔‘‘ اور ان کا یہ کہنا : «وَ اِنْ كُنْتُ لَمِنَ السّٰخِرِيْنَ» [ الزمر : ۵۶ ] ’’اور بے شک میں تو مذاق کرنے والوں سے تھا۔‘‘ اور یہ آیت : «بَلٰى قَدْ جَآءَتْكَ اٰيٰتِيْ فَكَذَّبْتَ بِهَا وَ اسْتَكْبَرْتَ وَ كُنْتَ مِنَ الْكٰفِرِيْنَ» [ الزمر : ۵۹ ] ’’کیوں نہیں،بے شک تیرے پاس میری آیات آئیں تو تو نے انھیں جھٹلایا اور تکبر کیا اور تو انکار کرنے والوں میں سے تھا۔‘‘ ¤ صحیح بخاری میں ابن عباس رضی اللہ عنھما سے مروی ہے کہ یہ آیات کچھ مشرکین کے بارے میں نازل ہوئیں، چنانچہ انھوں نے فرمایا : [ أَنَّ نَاسًا مِنْ أَهْلِ الشِّرْكِ كَانُوْا قَدْ قَتَلُوْا وَ أَكْثَرُوْا، وَ زَنَوْا وَ أَكْثَرُوْا، فَأَتَوْا مُحَمَّددًا صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ فَقَالُوْا إِنَّ الَّذِيْ تَقُوْلُ وَ تَدْعُوْ إِلَيْهِ لَحَسَنٌ لَوْ تُخْبِرُنَا أَنَّ لِمَا عَمِلْنَا كَفَّارَةً، فَنَزَلَ : «وَ الَّذِيْنَ لَا يَدْعُوْنَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ وَ لَا يَقْتُلُوْنَ النَّفْسَ الَّتِيْ حَرَّمَ اللّٰهُ اِلَّا بِالْحَقِّ وَ لَا يَزْنُوْنَ» [الفرقان : ۶۸] وَ نَزَلَ : « قُلْ يٰعِبَادِيَ الَّذِيْنَ اَسْرَفُوْا عَلٰۤى اَنْفُسِهِمْ لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ» [الزمر : ۵۳] ] [ بخاري، التفسیر، باب قولہ : «یا عبادی الذین أسرفوا…» : ۴۸۱۰ ] ’’مشرکین میں سے کچھ لوگ جنھوں نے قتل کیے تھے اور بہت کیے تھے اور زنا کیا تھا اور بہت کیا تھا، پھر وہ محمد صلی اللہ علیہ وسلم کے پاس آئے اور کہنے لگے : ’’آپ جو بات کہتے ہیں اور جس کی دعوت دیتے ہیں یقینا وہ بہت اچھی ہے، اگر آپ ہمیں بتائیں کہ ہم نے جو کچھ کیا اس کا کوئی کفارہ ہے؟‘‘ تو یہ آیت اتری : «وَ الَّذِيْنَ لَا يَدْعُوْنَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ وَ لَا يَقْتُلُوْنَ  النَّفْسَ الَّتِيْ حَرَّمَ اللّٰهُ اِلَّا بِالْحَقِّ وَ لَا يَزْنُوْنَ » [ الفرقان : ۶۸ ] ’’اور وہ لوگ جو اللہ کے ساتھ کسی دوسرے معبود کو نہیں پکارتے اور اس جان کو جسے اللہ نے حرام کیا ہے قتل نہیں کرتے مگر حق کے ساتھ اور نہ وہ زنا کرتے ہیں۔‘‘ (یعنی اس کے بعد کی آیات میں ہے : « اِلَّا مَنْ تَابَ وَ اٰمَنَ وَ عَمِلَ عَمَلًا صَالِحًا فَاُولٰٓىِٕكَ يُبَدِّلُ اللّٰهُ سَيِّاٰتِهِمْ حَسَنٰتٍ وَ كَانَ اللّٰهُ غَفُوْرًا رَّحِيْمًا » [ الفرقان : ۷۰ ] ’’مگر جس نے توبہ کی اور ایمان لے آیا اور عمل کیا نیک عمل، تو یہ لوگ ہیں جن کی برائیاں اللہ نیکیوں میں بدل دے گا اور اللہ ہمیشہ سے بے حد بخشنے والا، نہایت رحم والا ہے۔‘‘) اور یہ آیت اتری : « قُلْ يٰعِبَادِيَ الَّذِيْنَ اَسْرَفُوْا عَلٰۤى اَنْفُسِهِمْ لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ» ’’کہہ دے اے میرے بندو! جنھوں نے اپنی جانوں پر زیادتی کی! اللہ کی رحمت سے ناامید نہ ہو جاؤ۔‘‘ ¤ ➍ ’’اسراف‘‘ کا معنی کسی بھی چیز میں حد سے گزرنا ہے، عموماً اس کا استعمال خرچ کرنے میں ہوتا ہے، جیسا کہ فرمایا : «وَ الَّذِيْنَ اِذَاۤ اَنْفَقُوْا لَمْ يُسْرِفُوْا وَ لَمْ يَقْتُرُوْا» [ الفرقان : ۶۷ ] ’’اور وہ لوگ کہ جب خرچ کرتے ہیں تو نہ فضول خرچی کرتے ہیں اور نہ خرچ میں تنگی کرتے ہیں۔‘‘ یہاں اس سے مراد کفر و شرک کرکے اپنی جانوں پر ظلم و زیادتی ہے۔ {’’ عَلٰۤى اَنْفُسِهِمْ ‘‘} کا مطلب یہ ہے کہ تمھاری زیادتی کا نقصان تم ہی کو ہے، اللہ تعالیٰ کو یا کسی اور کو نہیں، اس لیے اس زیادتی کے مداوے کی فکر بھی تمھی کو ہونی چاہیے، جیسا کہ فرمایا : « يٰۤاَيُّهَا النَّاسُ اِنَّمَا بَغْيُكُمْ عَلٰۤى اَنْفُسِكُمْ » [ یونس : ۲۳ ] ’’اے لوگو! تمھاری سرکشی تمھاری جانوں ہی پر ہے۔‘‘ ¤ ➎ {لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ : ’’قَنِطَ يَقْنَطُ قُنُوْطًا‘‘} (ع، ض) ناامید ہونا۔ اس آیت میں اللہ تعالیٰ نے اپنے بندوں کو کئی طرح سے گناہوں کی بخشش کی امید دلائی ہے۔ تفسیر رازی نے وہ دس وجہیں بیان کی ہیں : ¤ (1) {’’ يٰعِبَادِيْ ‘‘} (اے میرے بندو!) بندہ غلام کو کہتے ہیں۔ غلام بے چارہ مسکین، عاجز اور محتاج ہوتا ہے، اس کی مسکنت اور بے چارگی اسے مالک کے رحم و کرم کا حق دار بناتی ہے۔ ¤ (2) اللہ تعالیٰ نے {’’ يٰعِبَادِيْ‘‘} (اے میرے بندو!) کہہ کر ان کی نسبت اپنی طرف فرمائی اور جسے اللہ تعالیٰ اپنا کہہ دے اس کے ناامید ہونے کی کوئی وجہ نہیں۔ ¤ (3) {’’ اَسْرَفُوْا عَلٰۤى اَنْفُسِهِمْ ‘‘} كا مطلب يہ ہے كہ انهوں نے جو گناه کیے ان كا نقصان انھی كو ہے، الله تعالی كا اس سے کچھ نهيں بگڑا، اس ليے كوئی وجہ نہيں كہ وہ ان کی توبہ قبول نہ کرے۔ ¤ (4) {’’ لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ ‘‘} میں صریح الفاظ کے ساتھ ناامید ہونے سے منع فرمایا۔ ¤ (5) {’’ يٰعِبَادِيْ‘‘} (اے میرے بندو!) کے ساتھ خطاب کے بعد کلام کا تقاضا یہ تھا کہ کہا جاتا : {’’لَا تَقْنَطُوْا مِنْ رَّحْمَتِيْ‘‘} (کہ میری رحمت سے ناامید نہ ہو جاؤ) مگر {’’مِنْ رَّحْمَتِيْ‘‘} کے بجائے فرمایا : {’’ مِنْ رَّحْمَةِ اللّٰهِ ‘‘} (اللہ کی رحمت سے ناامید نہ ہو جاؤ) کیونکہ لفظ {’’ اللّٰهِ ‘‘} اللہ تعالیٰ کے اسماء میں سب سے بڑا اور اس کی تمام صفات کا جامع نام ہے۔ تمام صفات کمال کی جامع ہستی سے ناامید ہونا کسی طرح بھی جائز نہیں۔ ¤ (6) {اِنَّ اللّٰهَ يَغْفِرُ الذُّنُوْبَ جَمِيْعًا :} کہنا تو یہ تھا کہ {’’إِنَّهُ يَغْفِرُ الذُّنُوْبَ‘‘} ( بے شک وہ سب کے سب گناہ بخش دیتا ہے) مگر دوبارہ اپنا نام لے کر فرمایا : {’’ اِنَّ اللّٰهَ يَغْفِرُ الذُّنُوْبَ جَمِيْعًا ‘‘} (کہ بے شک اللہ تعالیٰ سب کے سب گناہ بخش دیتا ہے) دوبارہ اپنا گرامی قدر نام ذکر کرنے اور {’’ اِنَّ ‘‘} کے ساتھ اس کی تاکید سے مغفرت کے وعدے میں مبالغے کا اظہار ہو رہا ہے۔ ¤ (7) {جَمِيْعًا : ’’ الذُّنُوْبَ ‘‘} میں الف لام استغراق کے لیے ہے، اس لیے تمام گناہوں کی مغفرت کے وعدے کے لیے {’’ يَغْفِرُ الذُّنُوْبَ ‘‘} ہی کافی تھا، مگر {’’ جَمِيْعًا ‘‘} کے ساتھ مزید تاکید فرما دی کہ اللہ تعالیٰ توبہ کے ساتھ تمام گناہ، حتیٰ کہ شرک جیسے اکبر الکبائر کو بھی بخش دیتا ہے، جیسا کہ اگلی آیت میں {’’اَنِيْبُوْۤا ‘‘} اور {’’ اَسْلِمُوْا ‘‘} وغیرہ الفاظ کے ساتھ وضاحت آ رہی ہے۔ ¤ (8) {اِنَّهٗ هُوَ الْغَفُوْرُ:’’ الْغَفُوْرُ ‘‘ ’’غَفَرَ يَغْفِرُ‘‘} کا اصل معنی پردہ ڈالنا ہے اور {’’ الْغَفُوْرُ ‘‘} اس سے مبالغے کا صیغہ ہے، یعنی اللہ تعالیٰ بندوں کے گناہوں پر بہت زیادہ پردہ ڈالنے والا ہے۔ یہ عذاب کا باعث بننے والی چیزوں کو دور کرنے کی طرف اشارہ ہے۔ ¤ (9) {’’ الرَّحِيْمُ ‘‘ ’’رُحْمٌ‘‘} سے مبالغے کا صیغہ ہے کہ وہ بے حد رحم کرنے والا ہے۔ یہ مغفرت کے بعد مزید رحمت کے نتیجے میں عطا ہونے والی نعمتوں کی طرف اشارہ ہے۔ ان دونوں کا فرق شعراوی نے ایک مقام پر ایک مثال کے ساتھ واضح کرنے کی کوشش کی ہے، اگرچہ یہ مکمل نہیں ہے۔ مثلاً کوئی شخص کسی چور کو چوری کرتے ہوئے پکڑ لیتا ہے، اب وہ اسے سزا دے یا دلوا سکتا ہے، مگر وہ اس کی منتوں اور آئندہ ایسا نہ کرنے کے وعدے کی وجہ سے اس کی چوری پر پردہ ڈال دیتا ہے اور کسی کو اس کی اطلاع نہیں دیتا، یہ مغفرت ہے۔ پھر وہ اس کی حالت زار پر رحم کرتے ہوئے اسے کچھ رقم دے کر کاروبار میں کھڑا کر دیتا ہے، یہ اس پر رحم ہے۔ ¤ (10) {’’ اِنَّهٗ هُوَ الْغَفُوْرُ الرَّحِيْمُ ‘‘} میں {’’ هُوَ ‘‘} ضمیر فصل اور خبر {’’ الْغَفُوْرُ الرَّحِيْمُ ‘‘} پر الف لام کی وجہ سے کلام میں تاکید اور حصر پیدا ہو گیا۔ یعنی اس کے سوا کوئی نہ غفور ہے نہ رحیم، اس سے اللہ تعالیٰ کی مغفرت اور رحمت کے کمال کا اظہار ہوتا ہے۔ یہ تمام وجوہ اللہ تعالیٰ کی کمال مغفرت و رحمت پر اور بندوں کے اس سے کسی حال میں بھی ناامید نہ ہونے پر دلالت کرتی ہیں۔ اللہ تعالیٰ ہمیں بھی اپنے فضل و کرم سے ان میں سے وافر حصہ عطا فرمائے۔ (آمین) ¤ ➏ {اِنَّ اللّٰهَ يَغْفِرُ الذُّنُوْبَ جَمِيْعًا … : ’’ وَ اَنِيْبُوْۤا اِلٰى رَبِّكُمْ ‘‘} اور بعد کی آیات سے ظاہر ہے کہ یہ وعدہ صرف ان لوگوں سے ہے جو توبہ کریں۔ ابن کثیر رحمہ اللہ نے بھی یہی تفسیر اختیار فرمائی ہے، کیونکہ اگر وہ کافر و مشرک ہے تو کفر و شرک سے توبہ کرنے اور اسلام قبول کرنے کے بغیر اس کی بخشش کا سوال ہی پیدا نہیں ہوتا اور اگر وہ مسلمان ہے تو اس کے تمام گناہوں کی معافی کا وعدہ توبہ یا اس کے قائم مقام اعمال کے ساتھ ہے، ورنہ اس کی بخشش اللہ تعالیٰ کی مشیّت پر موقوف ہے، وہ جسے چاہے گا بخش دے گا، جیسا کہ فرمایا : « اِنَّ اللّٰهَ لَا يَغْفِرُ اَنْ يُّشْرَكَ بِهٖ وَ يَغْفِرُ مَا دُوْنَ ذٰلِكَ لِمَنْ يَّشَآءُ» [ النساء : ۱۱۶ ] ’’بے شک اللہ اس بات کو نہیں بخشے گا کہ اس کا شریک بنایا جائے اور بخش دے گا جو اس کے علاوہ ہے، جسے چاہے گا۔‘‘ اگر یہ کہا جائے کہ ہر مسلمان کے تمام گناہ توبہ کے بغیر معاف ہو جائیں گے تو شریعت کے احکام کی کوئی وقعت باقی نہیں رہتی۔ البتہ اس بات میں شک نہیں کہ اللہ تعالیٰ جس مسلمان کے گناہ چاہے گا سزا دیے بغیر معاف کر دے گا اور جسے چاہے گا سزا دے گا، مگر آخر کار ہر موحّد مسلمان کو جہنم سے نکال لیا جائے گا۔ اس وقت کفار خواہش کریں گے کہ کاش! وہ بھی مسلمان ہوتے، خواہ کسی درجے کے ہوتے، کیونکہ کفار پر اللہ تعالیٰ نے جنت کی نعمتیں حرام کر دی ہیں۔ دیکھیے سورۂ حجر کی آیت (۲) کی تفسیر۔ اگر بخشش کا یہ معنی کیا جائے کہ آخر کار تمام مسلمان جنت میں جائیں گے تو {’’ اِنَّ اللّٰهَ يَغْفِرُ الذُّنُوْبَ جَمِيْعًا ‘‘} (بے شک اللہ سب کے سب گناہ بخش دیتا ہے) سے صرف کافر مستثنیٰ ہوں گے کہ ان کے گناہ توبہ کے بغیر معاف نہیں ہوں گے۔ ¤ ➐ اس آیت اور بعد کی آیات سے اللہ تعالیٰ کی بے انتہا رحمت کا اندازہ ہوتا ہے کہ وہ توبہ کرنے والوں کو کس قدر معاف فرمانے والا ہے۔ سورۂ فرقان (۶۹، ۷۰) میں شرک، قتل ناحق اور زنا کرنے والوں کے ساتھ توبہ، ایمان اور عمل صالح کے بعد ان کی گزشتہ برائیوں کو نیکیوں میں بدل دینے کا وعدہ فرمایا ہے۔ اس لیے کسی بندے کو اللہ کی رحمت سے ناامید نہیں ہونا چاہیے، خواہ اس کے گناہوں سے زمین و آسمان بھرے ہوئے ہوں۔ صرف اللہ کی طرف پلٹنے اور اس کے سامنے اعتراف کے بعد توبہ کی ضرورت ہے، وہ سب گناہ معاف فرما دے گا، کیونکہ اسے اپنے بندوں کی توبہ بہت ہی محبوب ہے۔ چنانچہ ارشاد ہے : « اَلَمْ يَعْلَمُوْۤا اَنَّ اللّٰهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهٖ » [ التوبۃ : ۱۰۴ ] ’’کیا انھوں نے نہیں جانا کہ اللہ ہی اپنے بندوں کی توبہ قبول کرتا ہے۔‘‘ اور فرمایا : « وَ مَنْ يَّعْمَلْ سُوْٓءًا اَوْ يَظْلِمْ نَفْسَهٗ ثُمَّ يَسْتَغْفِرِ اللّٰهَ يَجِدِ اللّٰهَ غَفُوْرًا ررَّحِيْمًا » [ النساء : ۱۱۰ ] ’’اور جو بھی کوئی برا کام کرے، یا اپنی جان پر ظلم کرے، پھر اللہ سے بخشش مانگے وہ اللہ کوبے حد بخشنے والا، نہایت مہربان پائے گا۔‘‘ منافقین کے متعلق فرمایا : « اِنَّ الْمُنٰفِقِيْنَ فِي الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِ وَ لَنْ تَجِدَ لَهُمْمْ نَصِيْرًا (145) اِلَّا الَّذِيْنَ تَابُوْا» [ النساء : ۱۴۵، ۱۴۶ ] ’’بے شک منافق لوگ آگ کے سب سے نچلے درجے میں ہوں گے اور تو ہرگز ان کا کوئی مدد گار نہ پائے گا۔ مگر وہ لوگ جنھوں نے توبہ کی۔‘‘ اور فرمایا : « لَقَدْ كَفَرَ الَّذِيْنَ قَالُوْۤا اِنَّ اللّٰهَ ثَالِثُ ثَلٰثَةٍ وَ مَا مِنْ اِلٰهٍ اِلَّاۤ اِلٰهٌ وَّاحِدٌ وَ اِنْ لَّمْ يَنْتَهُوْا عَمَّا يَقُوْلُوْنَ لَيَمَسَّنَّ الَّذِيْنَ كَفَرُوْا مِنْهُمْ عَذَابٌ اَلِيْمٌ » [ المائدۃ : ۷۳ ] ’’بلاشبہ یقینا ان لوگوں نے کفر کیا جنھوں نے کہا بے شک اللہ تین میں سے تیسرا ہے، حالانکہ کوئی بھی معبود نہیں مگر ایک معبود، اور اگر وہ اس سے باز نہ آئے جو وہ کہتے ہیں تو یقینا ان میں سے جن لوگوں نے کفر کیا انھیں ضرور درد ناک عذاب پہنچے گا۔‘‘ پھر انھی کے متعلق فرمایا : « اَفَلَا يَتُوْبُوْنَ اِلَى اللّٰهِ وَ يَسْتَغْفِرُوْنَهٗ وَ اللّٰهُ غَفُوْرٌ رَّحِيْمٌ » [ المائدۃ : ۷۴ ] ’’توکیا وہ اللہ کی طرف توبہ نہیں کرتے اور اس سے بخشش نہیں مانگتے، اور اللہ بے حد بخشنے والا، نہایت مہربان ہے۔‘‘ ¤ ابن کثیر رحمہ اللہ نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما سے {’’ قُلْ يٰعِبَادِيَ الَّذِيْنَ اَسْرَفُوْا عَلٰۤى اَنْفُسِهِمْ لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ ‘‘} کی تفسیر میں نقل کیا ہے کہ انھوں نے فرمایا : ’’اللہ تعالیٰ نے ان لوگوں کو اپنی مغفرت کی دعوت دی جنھوں نے کہا مسیح خود اللہ ہے اور جنھوں نے کہا مسیح اللہ کا بیٹا ہے اور جنھوں نے کہا عزیر اللہ کا بیٹا ہے اور جنھوں نے کہا اللہ فقیر ہے اور جنھوں نے کہا اللہ کا ہاتھ بندھا ہوا ہے اور جنھوں نے کہا اللہ تین میں تیسرا ہے، ان سب سے اللہ تعالیٰ نے فرمایا : «اَفَلَا يَتُوْبُوْنَ اِلَى اللّٰهِ وَ يَسْتَغْفِرُوْنَهٗ وَ اللّٰهُ غَفُوْرٌ رَّحِيْمٌ » [ المائئدۃ : ۷۴ ] ’’توکیا وہ اللہ کی طرف توبہ نہیں کرتے اور اس سے بخشش نہیں مانگتے، اور اللہ بے حد بخشنے والا، نہایت مہربان ہے۔‘‘ پھر اسے بھی توبہ کی دعوت دی جس نے ان سے بھی بڑی بات کہی : « اَنَا رَبُّكُمُ الْاَعْلٰى » [ النازعات : ۲۴ ] ’’میں تمھارا سب سے اونچا رب ہوں۔‘‘ اور جس نے کہا : «مَا عَلِمْتُ لَكُمْ مِّنْ اِلٰهٍ غَيْرِيْ » [ القصص : ۳۸ ] ’’میں نے اپنے سوا تمھارے لیے کوئی معبود نہیں جانا۔‘‘ چنانچہ فرمایا : « وَ اِنِّيْ لَغَفَّارٌ لِّمَنْ تَابَ وَ اٰمَنَ وَ عَمِلَ صَالِحًا ثُمَّ اهْتَدٰى » [ طٰہٰ : ۸۲ ] ’’اور بے شک میں یقینا اس کو بہت بخشنے والا ہوں جو توبہ کرے اور ایمان لائے اور نیک عمل کرے، پھر سیدھے راستے پر چلے۔‘‘ ابن عباس رضی اللہ عنھما نے فرمایا : ’’جو شخص اس کے بعد بھی اللہ کے بندوں کو توبہ سے مایوس کرے اس نے اللہ کی کتاب کا انکار کیا، لیکن بندہ توبہ نہیں کر سکتا، حتیٰ کہ اللہ تعالیٰ اس پر مہربانی فرمائے۔‘‘ مسلمانوں کو آگ سے بھری ہوئی خندقوں میں ڈالنے والوں (اصحاب الاخدود) کے متعلق فرمایا : « اِنَّ الَّذِيْنَ فَتَنُوا الْمُؤْمِنِيْنَ وَ الْمُؤْمِنٰتِ ثُمَّ لَمْ يَتُوْبُوْا فَلَهُمْ عَذَابُ جَهَنَّمَ وَ لَهُمْ عَذَابُ الْحَرِيْقِ » [ البروج : ۱۰ ] ’’یقینا وہ لوگ جنھوں نے مومن مردوں اور مومن عورتوں کو آزمائش میں ڈالا، پھر انھوں نے توبہ نہیں کی تو ان کے لیے جہنم کا عذاب ہے اور ان کے لیے جلنے کا عذاب ہے۔‘‘ حسن بصری رحمہ اللہ نے فرمایا : ’’اس جود و کرم کو دیکھو! ان لوگوں نے اس کے دوستوں کو قتل کیا اور وہ انھیں توبہ اور مغفرت کی دعوت دے رہا ہے۔‘‘ (ابن کثیر) ¤ قرآن مجید میں اللہ تعالیٰ کی رحمت و مغفرت کی بہت سی آیات ہیں۔ احادیثِ صحیحہ میں ننانوے آدمیوں کے بعد سوویں آدمی کے قاتل کی توبہ کا ذکر معروف ہے، جسے نیک لوگوں کی بستی کی طرف جاتے ہوئے راستے میں موت آ گئی۔ [ دیکھیے مسلم، التوبۃ، باب قبول توبۃ القاتل، إن کثر قتلہ : ۲۷۶۶ ] اسی طرح اللہ تعالیٰ کا بندے کی توبہ پر اس آدمی سے بھی زیادہ خوش ہونے کا ذکر ہے جو اپنی گم شدہ اونٹنی ملنے پر خوشی کی شدت میں اللہ تعالیٰ کو مخاطب کرتے ہوئے بے اختیار کہہ اٹھتا ہے : ’’یا اللہ! تو میرا بندہ اور میں تیرا رب‘‘ اور خوشی کی شدت میں خطا کر جاتا ہے۔ [ دیکھیے مسلم، التوبۃ، باب في الحض علی التوبۃ والفرح بھا : ۲۷۴۷ ] اسی طرح اس بندے کا ذکر ہے جس نے اپنے بیٹوں کو وصیت کی کہ وہ اس کے فوت ہونے کے بعد اس کی لاش کو جلا کر اس کی راکھ کچھ پانی میں بہا دیں اور کچھ ہوا میں اڑا دیں۔ اللہ تعالیٰ نے اسے زندہ کرکے پوچھا کہ تو نے ایسا کیوں کیا؟ تو اس نے کہا : ’’یا اللہ! تیرے ڈر سے۔‘‘ تو اللہ تعالیٰ نے اسے بخش دیا۔ [ دیکھیے مسلم، التوبۃ، باب في سعۃ رحمۃ اللہ تعالیٰ… : ۲۷۵۶ ] پھر اللہ تعالیٰ کا یہ بھی کرم ہے کہ بندہ جتنی بار بھی گناہ کرے، پھر اس کے بعد جتنی بار توبہ کرے وہ معاف فرما دیتا ہے، ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَذْنَبَ عَبْدٌ ذَنْبًا فَقَالَ اللّٰهُمَّ اغْفِرْ لِيْ ذَنْبِيْ فَقَالَ تَبَارَكَ وَ تَعَالٰی أَذْنَبَ عَبْدِيْ ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَ يَأْخُذُ بِالذَّنْبِ ثُمَّ عَادَ فَأَذْنَبَ فَقَالَ أَيْ رَبِّ! اغْفِرْ لِيْ ذَنْبِيْ فَقَالَ تَبَارَكَ وَ تَعَالٰی عَبْدِيْ أَذْنَبَ ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَ يَأْخُذُ بِالذَّنْبِ ثُمَّ عَادَ فَأَذْنَبَ فَقَالَ أَيْ  رَبِّ! اغْفِرْ لِيْ ذَنْبِيْ فَقَالَ تَبَارَكَ وَ تَعَالٰی أَذْنَبَ عَبْدِيْ ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَ  يَأْخُذُ بِالذَّنْبِ اعْمَلْ مَا شِئْتَ فَقَدْ غَفَرْتُ لَكَ ] [ مسلم، التوبۃ، باب قبول التوبۃ من الذنوب… : ۲۷۵۸ ] ’’ایک بندے نے گناہ کیا، پھر اس نے کہا : ’’اے میرے رب! مجھے میرا گناہ بخش دے۔‘‘ تو اللہ تعالیٰ نے فرمایا : ’’میرے بندے نے ایک گناہ کیا، پھر جان لیا کہ اس کا ایک رب ہے جو گناہ بخشتا ہے اور گناہ پر پکڑتا ہے۔‘‘ پھر اس نے دوبارہ گناہ کیا اور کہا : ’’اے میرے رب!مجھے میرا گناہ بخش دے۔‘‘ تو اللہ تبارک و تعالیٰ نے فرمایا : ’’میرے بندے نے ایک گناہ کیا پھر جان لیا کہ اس کا ایک رب ہے جو گناہ بخشتا ہے اور گناہ پر پکڑتا ہے۔‘‘ پھر ایک بار اور اس نے گناہ کیا اور کہا : ’’اے میرے رب! مجھے میرا گناہ بخش دے۔‘‘ تو اللہ تبارک و تعالیٰ نے فرمایا : ’’میرے بندے نے گناہ کیا پھر جان لیا کہ اس کا ایک رب ہے جو گناہ بخشتا ہے اور گناہ پر پکڑتا ہے۔ (میرے بندے!) تو جو چاہے کر، میں نے تجھے بخش دیا۔‘‘"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) {وَ اَنِيْبُوْۤا اِلٰى رَبِّكُمْ … : ’’أَنَابَ يُنِيْبُ إِنَابَةً‘‘} رجوع کرنا، پلٹ آنا۔ {’’تَابَ يَتُوْبُ‘‘} کا معنی بھی یہی ہے۔ چونکہ یہ آیات ان لوگوں کے بارے میں نازل ہوئیں جو حالتِ کفر میں اپنے کیے ہوئے گناہوں کی وجہ سے اسلام لانے سے ہچکچا رہے تھے، اس لیے اللہ تعالیٰ نے انھیں مخاطب کرکے فرمایا کہ اللہ کی رحمت سے ناامید نہ ہو جاؤ، کیونکہ اللہ تعالیٰ سب کے سب گناہ بخش دیتا ہے۔ مگر ساتھ ہی تاکید فرمائی کہ اس کے لیے تمھیں موت سے پہلے پہلے کفر سے توبہ کرنا ہو گی، کیونکہ اس کے بعد توبہ کا کوئی فائدہ نہیں اور نہ ہی پھر کوئی تمھاری مدد کرے گا۔ ہاں! تم کفر سے توبہ کر لو تو تمھارے پہلے سب گناہ بخش دیے جائیں گے۔ عمرو بن عاص رضی اللہ عنہ فرماتے ہیں : [ فَلَمَّا جَعَلَ اللّٰهُ الْإِسْلَامَ فِيْ قَلْبِيْ أَتَيْتُ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ فَقُلْتُ ابْسُطْ  يَمِيْنَكَ فَلِأُبَايِعْكَ فَبَسَطَ يَمِيْنَهُ قَالَ فَقَبَضْتُ يَددِيْ قَالَ مَا لَكَ يَا عَمْرُو!؟ قَالَ قُلْتُ أَرَدْتُ أَنْ أَشْتَرِطَ، قَالَ تَشْتَرِطُ بِمَاذَا؟ قُلْتُ أَنْ يُغْفَرَ لِيْ، قَالَ أَمَا عَلِمْتَ أَنَّ الْإِسْلَامَ يَهْدِمُ مَا كَانَ قَبْلَهُهُ وَ أَنَّ الْهِجْرَةَ تَهْدِمُ مَا كَانَ قَبْلَهَا وَ أَنَّ الْحَجَّ يَهْدِمُ مَا كَانَ قَبْلَهُ؟ ] [ مسلم، الإیمان، باب کون الإسلام یھدم ما قبلہ… : ۱۲۱ ] ’’جب اللہ تعالیٰ نے میرے دل میں اسلام ڈالا، تو میں نبی صلی اللہ علیہ وسلم کے پاس آیا اور کہا : ’’اپنا دایاں ہاتھ پھیلائیے، تاکہ میں آپ سے بیعت کروں۔‘‘ آپ صلی اللہ علیہ وسلم نے اپنا ہاتھ پھیلا دیا تو میں نے اپنا ہاتھ پیچھے ہٹا لیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’عمرو! تمھیں کیا ہوا؟‘‘ میں نے کہا : ’’میں نے ارادہ کیا ہے کہ شرط کر لوں۔‘‘ آپ نے فرمایا : ’’تم کیا شرط کرو گے؟‘‘ میں نے کہا : ’’یہ کہ مجھے بخش دیا جائے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’کیا تمھیں معلوم نہیں ہوا کہ اسلام ان چیزوں کو گرا دیتا ہے جو اس سے پہلے ہوئی ہوں اور ہجرت ان چیزوں کو گرا دیتی ہے جو اس سے پہلے ہوئی ہوں اور حج ان چیزوں کو گرا دیتا ہے جو اس سے پہلے ہوئی ہوں؟‘‘"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) ➊ {وَ اتَّبِعُوْۤا اَحْسَنَ مَاۤ اُنْزِلَ اِلَيْكُمْ … :} یہاں {’’ اَحْسَنَ ‘‘} کی اضافت {’’ مَاۤ اُنْزِلَ اِلَيْكُمْ ‘‘} کی طرف اضافت بیانیہ ہے، یعنی اللہ تعالیٰ کی نازل کردہ وحی قرآن و حدیث کی پیروی کرو، جو ساری کی ساری ہی احسن اور دوسرے ہر کلام سے اچھی ہے، فرمایا : «اَللّٰهُ نَزَّلَ اَحْسَنَ الْحَدِيْثِ كِتٰبًا مُّتَشَابِهًا مَّثَانِيَ » [ الزمر : ۲۳ ] ’’اللہ نے سب سے اچھی بات نازل فرمائی، ایسی کتاب جو آپس میں ملتی جلتی ہے۔‘‘ مزید تفصیل سورۂ زمر کی آیات (۱۷، ۱۸) کی تفسیر میں دیکھیے۔ ¤ ➋ { مِنْ قَبْلِ اَنْ يَّاْتِيَكُمُ الْعَذَابُ بَغْتَةً :} اچانک عذاب سے اس لیے ڈرایا کہ اس میں نہ سنبھلنے کی مہلت ملے گی نہ توبہ کی، اس لیے جلد از جلد اللہ تعالیٰ کے احکام کی پیروی اختیار کر لو، اس سے پہلے کہ اللہ تعالیٰ کی گرفت تم پر اچانک آ جائے، جب کہ تم سوچتے بھی نہ ہو، کیونکہ عذاب آنے کے بعد کی جانے والی توبہ قبول نہ ہو گی۔ مزید دیکھیے سورۂ نساء (۱۸)، یونس (۵۱ اور ۹۰، ۹۱) اور سورۂ مومن (۸۴، ۸۵)۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ { اَنْ تَقُوْلَ نَفْسٌ يّٰحَسْرَتٰى … : ’’ اَنْ ‘‘} سے مراد {’’لِئَلَّا‘‘} ہے، جیسا کہ سورۂ نحل کی آیت (۱۵) میں ہے : «وَ اَلْقٰى فِي الْاَرْضِ رَوَاسِيَ اَنْ تَمِيْدَ بِكُمْ » {’’أَيْ لِئَلَّا تَمِيْدَ بِكُمْ ‘‘} ’’اور اس نے زمین میں پہاڑ گاڑ دیے، تاکہ وہ تمھیں ہلا نہ دے۔‘‘ {’’يٰحَسْرَتٰى ‘‘} اصل میں {’’حَسْرَةٌ‘‘} یائے متکلم کی طرف مضاف ہے، جسے ’’الف‘‘ میں بدل دیا ہے۔ حسرت شدید پشیمانی اور افسوس کو کہتے ہیں، ہائے میرا افسوس! {’’ فَرَّطْتُّ ‘‘ ’’فَرَّطَ يُفَرِّطُ تَفْرِيْطًا‘‘} کوتاہی کرنا اور {’’أَفْرَطَ يُفْرِطُ إِفْرَاطًا‘‘} زیادتی کرنا۔ یعنی ایسا نہ ہو کہ اس وقت کوئی شخص یہ کہے کہ ہائے  میرا افسوس! میری اس کوتاہی اور نافرمانی پر جو میں ساری کائنات کے خالق و مالک اللہ تعالیٰ کی جناب میں اس کے سامنے کرتا رہا، جو کسی چیز سے بے خبر نہیں۔ ¤ ➋ { وَ اِنْ كُنْتُ لَمِنَ السّٰخِرِيْنَ : ’’ اِنْ ‘‘} اصل میں {’’ إِنِّيْ‘‘} ہے۔ {’’إِنَّ‘‘} کے نون کو ساکن اور اس کے اسم ’’یائے متکلم‘‘ کو حذف کر دیا۔ دلیل اس کی {’’ لَمِنَ السّٰخِرِيْنَ ‘‘} پر آنے والا لام ہے، اور بے شک میں تو مذاق کرنے والوں سے تھا۔ یعنی افسوس! میں نے صرف نافرمانی پر اکتفا نہیں کیا بلکہ دوسروں کے ساتھ مل کر مذاق اڑانے میں بھی شریک رہا۔ ظاہر ہے اجتماعی طور پر مذاق اڑانے میں اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی اور زیادہ مخالفت ہے۔ اس آیت سے بھی واضح ہے کہ {’’قُلْ يٰعِبَادِيَ الَّذِيْنَ اَسْرَفُوْا ‘‘} سے لے کر سلسلہ کلام کفار کے متعلق ہے، کیونکہ اللہ تعالیٰ، اس کے رسول اور قیامت کا مذاق وہی اُڑاتے ہیں۔ مومن کیسا بھی بدعمل ہو اس کا ایمان اسے مذاق اُڑانے کی اجازت نہیں دیتا۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) { اَوْ تَقُوْلَ لَوْ اَنَّ اللّٰهَ هَدٰىنِيْ … :} یعنی ایسا نہ ہو کہ جب کوئی اور عذر نہ ملے تو اللہ تعالیٰ پر جھوٹ باندھ دے کہ اس نے مجھے ہدایت نہیں دی، اگر وہ مجھے ہدایت دیتا تو میں ضرور پرہیز گاروں میں سے ہوتا۔ یہ وہی بات ہے جو زندگی میں کفار کہتے رہے : «لَوْ شَآءَ اللّٰهُ مَاۤ اَشْرَكْنَا وَ لَاۤ اٰبَآؤُنَا وَ لَا حَرَّمْنَا مِنْ شَيْءٍ » [ الأنعام : ۱۴۸ ] ’’اگر اللہ چاہتا تو نہ ہم اور نہ ہمارے باپ دادا شرک کرتے اور نہ ہم کوئی چیز حرام کرتے۔‘‘ دیکھیے سورۂ انعام (۱۴۸) اور سورۂ نحل (۳۵) کی تفسیر۔ حالانکہ اللہ تعالیٰ نے رسول اور قرآن بھیج کر اپنی حجت تمام کر دی۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) {اَوْ تَقُوْلَ حِيْنَ تَرَى الْعَذَابَ …:} پچھلی آیت کے ضمن میں کفار کے اللہ تعالیٰ  پر اس جھوٹ کا ذکر تھا کہ اس نے انھیں ہدایت نہیں دی، اس آیت کے ضمن میں ان کے ایک اور جھوٹ کا ذکر ہے کہ اس نے انھیں نیک بننے کے لیے وقت نہیں دیا، اگر انھیں دوبارہ بھیجا جائے تو وہ نیک عمل کرنے والوں میں شامل ہو جائیں گے۔ چنانچہ وہ عذاب دیکھ کر دنیا میں ایک دفعہ واپس جانے کی ناکام تمنا کریں گے۔ (دیکھیے انعام : ۲۷، ۲۸) طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما سے نقل کیا ہے کہ انھوں نے فرمایا : ’’اللہ تعالیٰ نے وہ بات جو بندے کہنے والے ہیں، ان کے کہنے سے پہلے بتا دی ہے اور (دوبارہ دنیا میں بھیجے جانے کی صورت میں) وہ جو کچھ کرنے والے ہیں ان کے کرنے سے پہلے بتا دیا ہے اور فرمایا : « وَ لَا يُنَبِّئُكَ مِثْلُ خَبِيْرٍ » [ فاطر : ۱۴ ] ’’اور تجھے ایک پوری خبر رکھنے والے کی طرح کوئی خبر نہیں دے گا۔‘‘ یعنی وہ کہیں گے {’’يٰحَسْرَتٰى عَلٰى مَا فَرَّطْتُّ فِيْ جَنْۢبِ اللّٰهِ ‘‘} یا یہ کہیں گے {’’ لَوْ اَنَّ اللّٰهَ هَدٰىنِيْ لَكُنْتُ مِنَ الْمُتَّقِيْنَ ‘‘} یا کہیں گے {’’ لَوْ اَنَّ لِيْ كَرَّةً فَاَكُوْنَ مِنَ الْمُحْسِنِيْنَ ‘‘ ’’ الْمُحْسِنِيْنَ ‘‘} سے مراد {’’اَلْمُهْتَدِيْنَ‘‘} یعنی ہدایت یافتہ لوگ ہیں، تو اللہ تعالیٰ نے پہلے ہی بتا دیا کہ اگر انھیں دوبارہ بھیجا گیا تو پھر بھی ہدایت نہیں پا سکیں گے، جیسا کہ فرمایا : «وَ لَوْ رُدُّوْا لَعَادُوْا لِمَا نُهُوْا عَنْهُ وَ اِنَّهُمْ لَكٰذِبُوْنَ » [ الأنعام : ۲۸ ] ’’اور اگر انھیں واپس بھیج دیا جائے تو ضرور پھر وہی کریں گے جس سے انھیں منع کیا گیا تھا اور بلاشبہ وہ یقینا جھوٹے ہیں۔‘‘ اور فرمایا : « وَ نُقَلِّبُ اَفْـِٕدَتَهُمْ وَ اَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوْا بِهٖۤ اَوَّلَ مَرَّةٍ » [ الأنعام : ۱۱۰ ] ’’اور ہم ان کے دلوں اور ان کی آنکھوں کو پھیر دیں گے، جیسے وہ اس پر پہلی بار ایمان نہیں لائے۔‘‘ یعنی جس طرح وہ پہلی دفعہ ایمان نہیں لائے، اگر انھیں دوبارہ دنیا میں بھیج دیا جائے تب بھی ان کے اور ہدایت کے درمیان رکاوٹ حائل رہے گی، جیسا کہ پہلی مرتبہ حائل رہی جب وہ دنیا میں تھے۔‘‘"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) {بَلٰى قَدْ جَآءَتْكَ اٰيٰتِيْ … :} لفظ {’’ بَلٰى ‘‘ } (کیوں نہیں) اس شخص کی تردید کے لیے کہا جاتا ہے جو کسی ثابت شدہ چیز کی تردید کر رہا ہو۔ کفار کے قول {’’ لَوْ اَنَّ اللّٰهَ هَدٰىنِيْ لَكُنْتُ مِنَ الْمُتَّقِيْنَ ‘‘} (اگر اللہ مجھے ہدایت دیتا تو میں ضرور پرہیز گاروں میں سے ہوتا) کے ضمن میں یہ بات موجود ہے کہ وہ کہہ رہے ہیں کہ اللہ تعالیٰ نے انھیں ہدایت نہیں دی اور {’’ لَوْ اَنَّ لِيْ كَرَّةً ‘‘} کے ضمن میں یہ بات موجود ہے کہ اس نے انھیں وقت نہیں دیا۔ اللہ تعالیٰ نے فرمایا، کیوں نہیں، میری آیات تیرے پاس آئیں (یعنی میں نے اپنی آیات کے ذریعے سے تجھے ہدایت دی اور وقت بھی دیا) مگر تو نے انھیں جھٹلا دیا اور تکبر کیا اور تو انکار کرنے والوں میں شامل رہا، جیسا کہ قوم ثمود کے متعلق فرمایا : « وَ اَمَّا ثَمُوْدُ فَهَدَيْنٰهُمْ فَاسْتَحَبُّوا الْعَمٰى عَلَى الْهُدٰى» [ حٰمٓ السجدۃ : ۱۷ ] ’’اور جو ثمود تھے ہم نے انھیں سیدھا راستہ دکھایا، مگر انھوں نے ہدایت کے مقابلے میں اندھا رہنے کو پسند کیا۔‘‘"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) ➊ { وَ يَوْمَ الْقِيٰمَةِ تَرَى الَّذِيْنَ كَذَبُوْا … :} اللہ پر جھوٹ باندھنے میں اگرچہ اس کے ساتھ شرک کرنا، اس کے لیے بیوی یا اولاد قرار دینا، اپنے آپ کو اس کا محبوب قرار دینا اور ان کے علاوہ دوسرے سب جھوٹ شامل ہیں، مگر آیات کے سیاق کے لحاظ سے اس کے اولین مصداق وہ دو جھوٹ ہیں جو اس سے پہلی آیات کے ضمن میں بیان ہوئے ہیں، یعنی ایک ان کا یہ کہنا کہ اللہ تعالیٰ نے انھیں ہدایت نہیں دی اور دوسرا یہ کہ اللہ تعالیٰ نے انھیں مہلت نہیں دی۔ ¤ ➋ { وُجُوْهُهُمْ مُّسْوَدَّةٌ:} قیامت کے دن کفار کے چہروں کے سیاہ ہونے کا ذکر قرآن مجید میں کئی مقامات پر آیا ہے۔ دیکھیے سورۂ آل عمران (۱۰۶، ۱۰۷)، یونس (۲۷) اور عبس (۴۰ تا ۴۲)۔ ¤ ➌ { اَلَيْسَ فِيْ جَهَنَّمَ مَثْوًى لِّلْمُتَكَبِّرِيْنَ : ’’ مَثْوًى ‘‘ ثَوٰي يَثْوِيْ بِالْمَكَانِ وَ أَثْوٰي فِيْهِ‘‘} کسی جگہ میں رہنا، جیسا کہ سورۂ قصص میں ہے : « وَ مَا كُنْتَ ثَاوِيًا فِيْۤ اَهْلِ مَدْيَنَ » [[ القصص : ۴۵ ] ’’اور تو اہلِ مدین میں رہنے والا نہیں تھا۔‘‘ اس سے معلوم ہوا جہنم میں جانے کا باعث ان کا تکبر ہو گا کہ وہ اللہ تعالیٰ کے سامنے جھکنے کے لیے تیار نہیں تھے اور حق معلوم ہونے کے باوجود انھوں نے اسے ماننے سے انکار کر دیا تھا اور ان کے چہرے سیاہ ہونے کا باعث بھی یہی تکبر ہو گا، کیونکہ متکبر کا چہرہ بگاڑنے ہی سے اس کا تکبر ٹوٹتا ہے۔ (ابن عاشور) ¤ عبد اللہ بن مسعود رضی اللہ عنہ نبی صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِيْ قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ، قَالَ رَجُلٌ إِنَّ الرَّجُلَ يُحِبُّ أَنْ ييَّكُوْنَ ثَوْبُهُ حَسَنًا وَ نَعْلُهُ حَسَنَةً، قَالَ إِنَّ اللّٰهَ جَمِيْلٌ يُحِبُّ الْجَمَالَ، الْكِبْرُ بَطَرُ الْحَقِّ وَ غَمْطُ النَّاسِ] [مسلم، الإیمان، باب تحریم الکبر و بیانہہ : ۹۱ ] ’’وہ شخص جنت میں داخل نہیں ہو گا جس کے دل میں ایک ذرے کے برابر تکبر ہو گا۔‘‘ ایک آدمی نے کہا : ’’آدمی پسند کرتا ہے کہ اس کے کپڑے اچھے ہوں اور اس کا جوتا اچھا ہو (کیا یہ بھی تکبر ہے)؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ تعالیٰ بہت جمال والا ہے اور جمال کو پسند فرماتا ہے، تکبر تو حق کا انکار اور لوگوں کو حقیر جاننا ہے۔‘‘ عبد اللہ بن عمرو رضی اللہ عنھما نبی صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا : [ يُحْشَرُ الْمُتَكَبِّرُوْنَ يَوْمَ الْقِيَامَةِ أَمْثَالَ الذَّرِّ فِيْ صُوَرِ الرِّجَالِ يَغْشَاهُمُ الذُّلُّ مِنْ كُلِّ مَكَانٍ فَيُسَاقُوْنَ إِللٰی سِجْنٍ فِيْ جَهَنَّمَ يُسَمَّی بُوْلَسَ تَعْلُوْهُمْ نَارُ الْأَنْيَارِ يُسْقَوْنَ مِنْ عُصَارَةِ أَهْلِ النَّارِ طِيْنَةِ الْخَبَالِ ] [ ترمذي، صفۃ القیامۃ، باب ما جاء في شدۃ الوعید المتکبرین : ۲۴۹۲، قال الترمذي حسن صحیح وقال الألباني حسن ]’’متکبر لوگ قیامت کے دن چیونٹیوں کی طرح آدمیوں کی شکلوں میں اٹھائے جائیں گے، ہر جگہ سے ذلت انھیں ڈھانک رہی ہو گی، پھر وہ جہنم میں ایک قید خانے کی طرف ہانک کر لے جائے جائیں گے، جس کا نام ’’بولس‘‘ ہے۔ آگوں کی آگ (سب سے بڑی آگ) ان پر چڑھی ہو گی، انھیں آگ والوں کا نچوڑ ’’طینۃ الخبال‘‘ پلایا جائے گا۔‘‘ [ أَعَاذَنَا اللّٰہُ مِنْہُ ]"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) ➊ { وَ يُنَجِّي اللّٰهُ الَّذِيْنَ اتَّقَوْا … :} متکبرین کا انجام بیان فرمانے کے بعد متقین کا انجام بیان فرمایا۔ اس سے معلوم ہوا کہ تقویٰ تکبر کے منافی ہے، کیونکہ تقویٰ اللہ کی نافرمانی سے بچنے اور اس کے سامنے عاجز ہو جانے کا نام ہے، جیسا کہ فرمایا : «تِلْكَ الدَّارُ الْاٰخِرَةُ نَجْعَلُهَا لِلَّذِيْنَ لَا يُرِيْدُوْنَ عُلُوًّا فِي الْاَرْضِ وَ لَا فَسَادًا وَ الْعَاقِبَةُ لِلْمُتَّققِيْنَ » [ القصص : ۸۳ ]’’یہ آخری گھر، ہم اسے ان لوگوں کے لیے بناتے ہیں جو نہ زمین میں کسی طرح اونچا ہونے کا ارادہ کرتے ہیں اور نہ کسی فساد کا اور اچھا انجام متقی لوگوں کے لیے ہے۔‘‘ ¤ ➋ { بِمَفَازَتِهِمْ : ’’مَفَازَةٌ‘‘ ’’فَازَ يَفُوْزُ فَوْزًا‘‘} سے مصدر میمی ہے ’’کامیابی‘‘ یا ظرف مکان ہے ’’کامیابی کی جگہ‘‘ یعنی اللہ تعالیٰ متقی لوگوں کو (دنیا کی امتحان گاہ میں) کامیاب ہونے کی وجہ سے جہنم سے نجات عطا فرمائے گا، یا اللہ تعالیٰ متقی لوگوں کو ان کے کامیاب ہونے کی جگہ (جنت میں داخلے) کے ساتھ نجات عطا فرمائے گا، جیسا کہ فرمایا : « فَمَنْ زُحْزِحَ عَنِ النَّارِ وَ اُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ» [ آل عمران : ۱۸۵ ] ’’پھر جو شخص آگ سے دور کر دیا گیا اور جنت میں داخل کر دیا گیا تو یقینا وہ کامیاب ہو گیا۔‘‘ ¤ ➌ {لَا يَمَسُّهُمُ السُّوْٓءُ وَ لَا هُمْ يَحْزَنُوْنَ :} یعنی نہ آئندہ انھیں کوئی تکلیف یا برائی پہنچے گی۔ چنانچہ نہ ان پر کوئی خوف آئے گا اور نہ ہی انھیں دنیا میں گزرے ہوئے صدموں یا پریشانیوں کا کوئی غم رہے گا، کیوں کہ جنت کا ایک ہی پھیرا انھیں دنیا کے تمام رنج و غم بھلا دے گا۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) ➊ { اَللّٰهُ خَالِقُ كُلِّ شَيْءٍ …:} اہلِ توحید کے لیے وعدے اور مشرکین کے لیے وعید کے بعد دوبارہ اللہ تعالیٰ کی توحید اور رد شرک کے دلائل کا ذکر شروع فرمایا۔ ابن عاشور نے فرمایا : {’’ اَللّٰهُ خَالِقُ كُلِّ شَيْءٍ ‘‘} اور اس کے بعد والے دو جملے {’’قُلْ اَفَغَيْرَ اللّٰهِ تَاْمُرُوْٓنِّيْۤ اَعْبُدُ اَيُّهَا الْجٰهِلُوْنَ ‘‘} کی تمہید ہیں اور اکیلے اللہ تعالیٰ کی عبادت کی دلیل ہیں۔ پہلا جملہ {’’ اَللّٰهُ خَالِقُ كُلِّ شَيْءٍ ‘‘} ہے، ظاہر ہے کہ جب ہر چیز پیدا اللہ تعالیٰ نے فرمائی ہے تو عبادت بھی اسی کا حق ہے۔ اللہ تعالیٰ نے اپنے معبود برحق ہونے کی دلیل کے طور پر اپنے ہر چیز کے خالق ہونے کو جا بجا بیان فرمایا ہے۔ دیکھیے سورۂ انعام (۱۰۲)، رعد (۱۶)، فاطر (۳)، مومن (۶۲) اور سورۂ حج (۷۳)۔ ¤ ➋ {وَ هُوَ عَلٰى كُلِّ شَيْءٍ وَّكِيْلٌ : ’’وَكَلَ يَكِلُ‘‘} (ض) سپرد کرنا۔ ’’وکیل‘‘ جس کے سپرد کوئی چیز کی جائے کہ وہ اس کی حفاظت اور نگرانی کرے اور اس میں جو چاہے کرے۔ یہ اکیلے اللہ کی عبادت کی دوسری دلیل ہے، یعنی جس طرح ہر چیز کو پیدا کرنے والا صرف اللہ تعالیٰ ہے اسی طرح ہر چیز کی تدبیر و حفاظت کرنے والا بھی صرف اللہ تعالیٰ ہے، نہ کسی چیز کے پیدا کرنے میں کوئی اس کا شریک ہے اور نہ اس کی حفاظت و تدبیر میں۔ اس لیے اپنی ہر چیز اور ہر کام اللہ تعالیٰ کے سپرد کرنے کاحکم قرآن میں بار بار آیا ہے، فرمایا : « وَ عَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ » [ آل عمران : ۱۲۲ ] ’’اور اللہ ہی پر پس لازم ہے کہ مومن بھروسا کریں۔‘‘ اور فرمایا : « وَ عَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُوْنَ » [ إبراہیم : ۱۲ ] ’’اور اللہ ہی پر پس لازم ہے کہ بھروسا کرنے والے بھروسا کریں۔‘‘"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) ➊ { لَهٗ مَقَالِيْدُ السَّمٰوٰتِ وَ الْاَرْضِ :’’ مَقَالِيْدُ ‘‘ ’’مِقْلَدٌ‘‘} یا {’’مِقْلَادٌ‘‘} کی جمع ہے، جس طرح قلادہ (ہار یا پٹا) گردن کے ساتھ ہوتا ہے اسی طرح چابی تالے کے ساتھ ہوتی ہے۔ اکثر مفسرین کا کہنا ہے کہ یہ {’’إِقْلِيْدٌ‘‘} کی جمع ہے اور عام قاعدے کے خلاف ہے۔ {’’إِقْلِيْدٌ‘‘} دراصل فارسی لفظ ’’کلید‘‘ سے عربی بنایا گیا ہے۔ یعنی زمین و آسمان کے خزانوں کی کنجیاں بھی اسی کے پاس ہیں، کسی اور کے پاس کچھ ہے ہی نہیں، تو اسے پکارنے اور اس سے فریاد کرنے کا کیا فائدہ؟ یہ اکیلے اللہ کے مستحق عبادت ہونے کی تیسری دلیل ہے۔ ¤ ➋ {وَ الَّذِيْنَ كَفَرُوْا بِاٰيٰتِ اللّٰهِ … :} یہاں ایک سوال ہے کہ ’’واؤ‘‘ کے ساتھ عطف کس جملے پر ڈالا گیا ہے؟ زمخشری نے اس کا جواب یہ دیا ہے کہ اس کا عطف {’’ وَ يُنَجِّي اللّٰهُ الَّذِيْنَ اتَّقَوْا ‘‘} پر ہے اور درمیان کے جملے معترضہ ہیں۔ مگر اتنی دور عطف محل نظر ہے۔ بقاعی نے فرمایا، اس کا عطف ایک مقدر جملے پر ہے جو سیاق سے ظاہر ہو رہا ہے : {’’أَيْ فَالَّذِيْنَ آمَنُوْا وَ تَقَبَّلُوْا آيَاتِهِ أُوْلٰئِكَ هُمُ الْفَائِزُوْنَ وَالَّذِيْنَ كَفَرُوْا بِآيَاتِ اللّٰهِ هُمُ الْخَاسِرُوْنَ‘‘} ’’تو جو لوگ ایمان لے آئے اور اس کی آیات کو قبول کر لیا یہی لوگ کامیاب ہیں اور جن لوگوں نے اللہ کی آیات کا انکار کیا وہی خسارہ اٹھانے والے ہیں۔‘‘ {’’ هُمْ ‘‘} ضمیر فصل کی وجہ سے اور {’’الْخٰسِرُوْنَ ‘‘} خبر پر الف لام کی وجہ سے کلام میں تاکید اور حصر پیدا ہو گیا، یعنی خسارہ اٹھانے والے صرف وہ ہیں جنھوں نے اللہ کی آیات کا انکار کر دیا۔ گویا اس کے علاوہ اگر کوئی خسارہ ہے بھی تو فی الحقیقت خسارہ نہیں ہے، کیونکہ وہ عارضی خسارہ ہے۔ اسی طرح حقیقی کامیابی صرف آخرت کی کامیابی ہے، کیونکہ وہی دائمی اور پائیدار کامیابی ہے، فرمایا : « فَمَنْ زُحْزِحَ عَنِ النَّارِ وَ اُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ » [ آل عمران : ۱۸۵ ] ’’پھر جو شخص آگ سے دور کر دیا گیا اور جنت میں داخل کر دیا گیا تو یقینا وہ کامیاب ہوگیا۔‘‘ ’’اللہ کی آیات‘‘ سے مراد اس کے وجود اور وحدانیت کے دلائل ہیں جو گزشتہ آیات، خصوصاً اس سے پہلے تین جملوں میں بیان ہوئے ہیں۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) ➊ {قُلْ اَفَغَيْرَ اللّٰهِ تَاْمُرُوْٓنِّيْۤ اَعْبُدُ : ’’ قُلْ ‘‘} کے بعد جملہ ’’فاء‘‘ سے شروع ہوتا ہے، مگر ہمزہ استفہام چونکہ کلام کی ابتدا میں ہوتا ہے، اس لیے ’’فاء‘‘ کو اس کے بعد کر دیا ہے، اسی طرح جملہ فعلیہ کا آغاز فعل {’’ تَاْمُرُوْٓنِّيْۤ ‘‘} سے ہونا تھا اور {’’غَيْرَ اللّٰهِ‘‘} کو {’’ اَعْبُدُ ‘‘} کے بعد ہونا تھا، مگر {’’غَيْرَ اللّٰهِ‘‘} کی تحقیر کو نمایاں کرنے کے لیے اسے پہلے ذکر فرمایا۔ یعنی جب ہر چیز کا خالق اللہ ہے اور وہی ہر چیز پر نگران ہے اور اسی کے پاساس آسمانوں اور زمین کی کنجیاں ہیں تو پھر کیا اس کے ہوتے ہوئے تم مجھے اس کے غیر کی عبادت کا حکم دیتے ہو، جس کے اختیار میں خود اپنا وجود بھی نہیں؟ ¤ ➋ { اَيُّهَا الْجٰهِلُوْنَ:} جہل کا لفظ حلم کے مقابلے میں آتا ہے اور علم کے مقابلے میں بھی، یہاں علم کے مقابلے میں آیا ہے۔ یعنی اللہ تعالیٰ کے ’’وحدہ لا شریک لہ معبود‘‘ ہونے کے اتنے واضح دلائل اپنے کانوں سے سننے اور آنکھوں سے دیکھنے کے باوجود پتھروں، قبروں، جانوروں یا اپنے جیسی بے بس اور بے اختیار مخلوق کی عبادت کی پستی میں گرے ہوئے جاہلو! جو نہ اللہ تعالیٰ کی ذات و صفات کا کچھ علم رکھتے ہو کہ صرف اسی کی عبادت کرو، نہ رسول اللہ صلی اللہ علیہ وسلم کی شان سے واقف ہو کہ انھیں غیر اللہ کی عبادت کی دعوت کی جرأت کر رہے ہو اور نہ ہی اس شرف کا کچھ علم رکھتے ہو جو اللہ تعالیٰ نے تمھیں انسان بنا کر عطا کیا ہے کہ اتنی اونچی مخلوق ہو کر اپنے جیسی یا اپنے سے بھی ادنیٰ مخلوق کی عبادت کر رہے ہو۔ اقبال نے کہا ہے: ¤ آدم از بے بصری بندگیٔ آدم کرد ¤ من نہ دیدم کہ سگے پیش سگے سر خم کرد ¤ ’’آدمی بے سمجھی کی وجہ سے آدمی کی بندگی کرنے لگا۔ میں نے تو یہ بھی نہیں دیکھا کہ کسی کتے نے کسی کتے کے آگے سر جھکایا ہو۔‘‘"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) ➊ { وَ لَقَدْ اُوْحِيَ اِلَيْكَ … :} سلیمان الجمل نے فرمایا : {’’ وَ لَقَدْ ‘‘} اور {’’ لَىِٕنْ اَشْرَكْتَ ‘‘} دونوں میں لام کے بعد قسم مقدر ہے، یعنی اللہ تعالیٰ نے یہ بات قسم کھا کر نہایت تاکید کے ساتھ فرمائی ہے۔‘‘ {’’ لَىِٕنْ اَشْرَكْتَ ‘‘} (اگر تو نے شرک کیا) کے مخاطب نبی صلی اللہ علیہ وسلم بھی ہیں اور پہلے پیغمبروں میں سے ہر ایک پیغمبر بھی۔ یعنی آپ کو اور آپ سے پہلے ایک ایک پیغمبر کو مخاطب کرکے وحی کی گئی ہے کہ اگر تو نے شرک کیا تو ُتو نے جو بھی اچھا کام کیا ہو گا یقینا سب ضائع ہو جائے گا اور یقینا تو خسارہ پانے والوں میں سے ہو جائے گا۔ مزید دیکھیے سورۂ انعام (۸۸)۔ ¤ ➋ یہاں ایک سوال ہے کہ اللہ تعالیٰ کو علم تھا کہ کوئی نبی شرک نہیں کرے گا، پھر انھیں یہ وحی کرنے کا مطلب کیا ہے؟ جواب اس کا یہ ہے کہ اس سے شرک کی شامت اور برائی بیان کرنا مقصود ہے کہ اگر بالفرض اللہ تعالیٰ کے اتنے مقرب بندے شرک کا ارتکاب کر بیٹھیں تو ان کا عمل ضائع ہو جائے گا، تو پھر دوسرے لوگوں کی کیا حیثیت ہے۔ گویا پیغمبروں کو سنا کر ان کی قوموں کو ڈرایا گیا ہے۔ ¤ ➌ شرک کے ساتھ تمام اعمال ضائع ہونے کی یہ وعید ان لوگوں کے لیے ہے جن کی موت کفر و شرک کی حالت میں واقع ہو، جیسا کہ فرمایا : « وَ مَنْ يَّرْتَدِدْ مِنْكُمْ عَنْ دِيْنِهٖ فَيَمُتْ وَ هُوَ كَافِرٌ فَاُولٰٓىِٕكَ حَبِطَتْ اَعْمَالُهُمْ فِي الدُّنْيَا وَ الْاٰخِرَةِ » [البقرۃ : ۲۱۷ ]’’اور تم میں سے جو اپنے دین سے پھر جائے، پھر اس حال میں مرے کہ وہ کافر ہو تو یہ وہ لوگ ہیں جن کے اعمال دنیا اور آخرت میں ضائع ہو گئے۔‘‘ توبہ کر لینے والے اس سے مستثنیٰ ہیں۔ دیکھیے سورۂ فرقان (۶۸ تا ۷۰)۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) ➊ {بَلِ اللّٰهَ فَاعْبُدْ:} لفظ {’’ اللّٰهَ ‘‘} کو پہلے لانے سے کلام میں حصر پیدا ہو گگیا ہے، یعنی (اللہ کے ساتھ شرک نہ کر) بلکہ (اگر تجھ میں عقل ہے، یا اگر تجھے عبادت کرنی ہے تو) صرف اللہ کی عبادت کر، اس کے سوا کسی کی عبادت نہ کر۔ ¤ ➋ { وَ كُنْ مِّنَ الشّٰكِرِيْنَ :} یعنی عقیدۂ توحید کی سمجھ عطا ہونے پر اور اکیلے اللہ کی عبادت کی توفیق ملنے پر اس کے شکر گزار بندوںمیں شامل ہو جا، کیونکہ اس سے بڑی نعمت کوئی نہیں۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) ➊ { وَ مَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖ:} یعنی جن لوگوں نے غیر اللہ کی عبادت کی، یا آپ صلی اللہ علیہ وسلم سے مطالبہ کیا کہ غیر اللہ کی عبادت کریں، انھوں نے اللہ تعالیٰ کی عظمت و کبریائی کا اندازہ ہی نہیں کیا کہ اس کا مقام کس قدر بلند ہے اور اس کے سامنے وہ تمام ہستیاں جن کی وہ عبادت کر رہے ہیں، کس قدر حقیر اور بے بس ہیں، ورنہ وہ کبھی ایسا نہ کرتے۔ ¤ ➋ { وَ الْاَرْضُ جَمِيْعًا قَبْضَتُهٗ يَوْمَ الْقِيٰمَةِ … :} یعنی اللہ تعالیٰ کی عظمت کا حال تو یہ ہے کہ قیامت کے دن پوری زمین اس کی مٹھی میں ہو گی اور تمام آسمان اس کے دائیں ہاتھ میں کاغذ کی طرح لپیٹے ہوئے ہوں گے، جیسا کہ فرمایا : «يَوْمَ نَطْوِي السَّمَآءَ كَطَيِّ السِّجِلِّ لِلْكُتُبِ» [ الأنبیاء : ۱۰۴ ] ’’جس دن ہم آسمان کو کاتب کے کتابوں کو لپیٹنے کی طرح لپیٹ دیں گے۔‘‘ ¤ ➌ کچھ لوگ اللہ تعالیٰ کے قیامت کے دن زمین کو مٹھی میں لینے کو اور آسمانوں کو دائیں ہاتھ میں لپیٹنے کو اور قرآن مجید اور احادیثِ صحیحہ میں اللہ تعالیٰ کے متعلق آنے والے اس طرح کے الفاظ کو نہیں مانتے اور ان سب کی ایسی تاویل کرتے ہیں جو درحقیقت انکار ہے۔ ان کے کہنے کے مطابق اللہ تعالیٰ کے عرش پر ہونے کا مطلب اس کی حکومت ہے (انھیں اس سے غرض نہیں کہ قیامت کو آٹھ فرشتوں کے اسے اٹھانے کی کیا تاویل کریں گے) مٹھی میں لینے اور دائیں ہاتھ میں لپیٹنے کا مطلب ان سب کا اس کے قبضۂ قدرت میں ہونا ہے (انھیں اس سے غرض نہیں کہ یہ سب کچھ اس کے قبضۂ قدرت میں تو ہر وقت ہی ہے) یہ لوگ اللہ تعالیٰ کے چہرے، پنڈلی، ہاتھ، انگلیوں، کان اور آنکھوں کا اور اس کے اترنے اور چڑھنے کا صاف انکار کرتے ہیں، بلکہ وہ اس کے سننے اور دیکھنے کے بھی منکر ہیں اور ان کا مطلب یہ کرتے ہیں کہ وہ جاننے والا ہے۔ اسی طرح وہ اس کے کلام کے بھی منکر ہیں۔ ان کے انکار کی اصل وجہ یہ ہے کہ انھوں نے اللہ تعالیٰ کی ان تمام صفات کو اپنی صفات کی طرح سمجھا، ورنہ اگر وہ ان تمام صفات اور الفاظ کے متعلق یہ عقیدہ رکھتے کہ وہ ہماری طرح یا کسی بھی مخلوق کی طرح نہیں، بلکہ اس طرح ہیں جس طرح اس کی شان کے لائق ہے تو کبھی انکار نہ کرتے۔ دیکھیے انسان سمیع و بصیر ہے، فرمایا : «فَجَعَلْنٰهُ سَمِيْعًۢا بَصِيْرًا» [ الدھر : ۲ ] ’’سو ہم نے اسے خوب سننے والا، خوب دیکھنے والا بنا دیا۔‘‘ تو کیا ہم اللہ تعالیٰ کے سمیع و بصیر ہونے کا اس لیے انکار کر دیں گے کہ اس سے وہ انسان کی طرح ہو جائے گا؟ نہیں، ہر گز نہیں! اللہ تعالیٰ نے فرمایا : «لَيْسَ كَمِثْلِهٖ شَيْءٌ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ» [ الشورٰی : ۱۱ ] ’’اس کی مثل کوئی چیز نہیں اور وہی سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔‘‘ یعنی اس کا سمع و بصر کسی اور کی مثل نہیں، بلکہ اس طرح ہے جس طرح اس کی شان کے لائق ہے۔ اسی طرح یقینا اس کے ہاتھ ہیں، جو دونوں ہی یمین (دائیں) ہیں، مٹھی بھی ہے، انگلیاں بھی، مگر انسان یا مخلوق کی طرح نہیں بلکہ جس طرح اس کی شان کے لائق ہے۔ استعارہ کہہ کر ان کا انکار کرنا درست نہیں۔ قرآن مجید کی ان آیات کی تشریح جو رسول اللہ صلی اللہ علیہ وسلم نے فرمائی وہ اس قسم کی تاویلات کی تردید کرتی ہے۔ ¤ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرما رہے تھے : [ يَقْبِضُ اللّٰهُ الْأَرْضَ، وَ يَطْوِی السَّمٰوَاتِ بِيَمِيْنِهِ، ثُمَّ يَقُوْلُ أَنَا الْمَلِكُ، أَيْنَ مُلُوْكُ الْأَرْضِ؟ ] [ بخاري، اللتفسیر، باب قولہ : «والأرض جمیعا قبضتہ…» : ۴۸۱۲ ] ’’اللہ تعالیٰ زمین کو مٹھی میں لے گا اور آسمانوں کو اپنے دائیں ہاتھ میں لپیٹ لے گا، پھر فرمائے گا : ’’میں ہی بادشاہ ہوں، کہاں ہیں زمین کے بادشاہ؟‘‘ عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں : [ أَنَّ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ قَرَأَ هٰذِهِ الْآيَةَ ذَاتَ يَوْمٍ عَلَی الْمِنْبَرِ : « وَ مَا قَدَرُوا اللّٰهَ حَقَّ ققَدْرِهٖ وَ الْاَرْضُ جَمِيْعًا قَبْضَتُهٗ يَوْمَ الْقِيٰمَةِ وَ السَّمٰوٰتُ مَطْوِيّٰتٌۢ بِيَمِيْنِهٖ سُبْحٰنَهٗ وَ تَعٰلٰى عَمَّا يُشْرِكُوْنَ » [الزمر : ۶۷] وَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ يَقُوْلُ هٰكَذَا بِيَدِهِ، وَ يُحَرِّكُهَا، يُقْبِلُ بِهَا وَ يُدْبِرُ، يُمَجِّدُ الرَّبُّ نَفْسَهُ أَنَا الْجَبَّارُ، أَنَا الْمُتَكَبِّرُ، أَنَا الْمَلِكُ، أَنَا الْعَزِيْزُ، أَنَا الْكَرِيْمُ فَرَجَفَ بِرَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ الْمِنْبَرُ، قُلْنَا لَيَخِرَّنَّ بِهِ] [مسند أحمد : 72/2، ح : ۵۴۱۳ ] ’’ایک دن رسول اللہ صلی اللہ علیہ وسلم نے منبر پر یہ آیت پڑھی : «وَ مَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖ وَ الْاَرْضُ جَمِييْعًا قَبْضَتُهٗ يَوْمَ الْقِيٰمَةِ وَ السَّمٰوٰتُ مَطْوِيّٰتٌۢ بِيَمِيْنِهٖ سُبْحٰنَهٗ وَ تَعٰلٰى عَمَّا يُشْرِكُوْنَ » ’’اور انھوں نے اللہ کی قدر نہیں کی جو اس کی قدر کا حق ہے، حالانکہ زمین ساری قیامت کے دن اس کی مٹھی میں ہو گی اور آسمان اس کے دائیں ہاتھ میں لپیٹے ہوئے ہوں گے۔ وہ پاک ہے اور بہت بلند ہے اس سے جو وہ شریک بنا رہے ہیں۔‘‘ اور آپ اپنے ہاتھ کو ہلاتے ہوئے اسے آگے اور پیچھے لے جاتے رہے۔ رب تعالیٰ نے خود اپنی تعریف بیان کی کہ میں جبار ہوں، میں متکبر ہوں، میں بادشاہ ہوں، میں عزیز ہوں، میں کریم ہوں، پھر آپ صلی اللہ علیہ وسلم پر ایسا لرزہ طاری ہوا کہ منبر لرزنے لگا اور ہمیں خطرہ پیدا ہوا کہ آپ صلی اللہ علیہ وسلم منبر سمیت گر پڑیں گے۔‘‘ مسند احمد کے محقق نے فرمایا کہ اس کی سند مسلم کی شرط پر صحیح ہے اور اس کے تمام راوی بخاری و مسلم کے راوی ہیں، ایک حماد بن سلمہ صرف مسلم کا راوی ہے۔ صحابہ کرام رضی اللہ عنھم اور دوسرے سلف صالحین نے صفات کی آیات و احادیث کو ان کے ظاہری معنی پر محمول کیا ہے، ان کی تاویل نہیں کی اور کہا ہے کہ یہ صفات اللہ تعالیٰ کے لیے ثابت ہیں جیسا کہ اس کی شان کے لائق ہے۔ ¤ ➍ {سُبْحٰنَهٗ وَ تَعٰلٰى عَمَّا يُشْرِكُوْنَ :} یعنی اللہ تعالیٰ ان کے شرک سے پاک اور بہت بلند ہے۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) {وَ نُفِخَ فِي الصُّوْرِ … :} اس کی مفصل تفسیر کے لیے دیکھیے سورۂ نمل کی آیت (۸۷) کی تفسیر۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) ➊ {وَ اَشْرَقَتِ الْاَرْضُ …:} قیامت کے دن اللہ تعالیٰ اور فرشتے زمین پر تشریف لائیں گے (دیکھیے سورۂ فجر : ۲۲) اور زمین اپنے رب کے نور سے روشن ہو جائے گی۔ بعض لوگ قیامت کے دن اللہ تعالیٰ کے زمین پر آنے کے منکر ہیں اور اس کے آسمان دنیا پر اترنے کا بھی صاف انکار کرتے ہیں۔ ان کا کہنا ہے کہ نہ اللہ تعالیٰ عرش پر ہے، نہ وہ آسمان دنیا پر اترتا ہے اور نہ قیامت کے دن زمین پر آئے گا، بلکہ یہ سب مجاز ہیں، عرش سے مراد سلطنت ہے، آسمان دنیا پر اترنے کا مطلب اس کی رحمت کا نزول ہے اور قیامت کے دن آنے کا مطلب اس کا حکم آنا ہے وغیرہ۔ حالانکہ یہ مسلمہ قاعدہ ہے کہ مجازی معنی اس وقت مراد لیا جاتا ہے جب حقیقی معنی مراد لینا محال ہو، جب کہ یہاں حقیقی معنی لینے میں کوئی مشکل نہیں۔ ان لوگوں نے یونان کے مشرک فلسفیوں کی یہ بات مان لی کہ ہر محل حوادث حادث ہوتا ہے، اس لیے انھوں نے اللہ تعالیٰ پر آنے والی ہر نئی حالت اور نئی شان کا انکار کر دیا۔ چنانچہ ان کے مطابق اللہ تعالیٰ نہ سنتا ہے، نہ دیکھتا ہے، نہ بات کرتا ہے، نہ عرش پر ہے، نہ اترتا ہے، نہ چڑھتا ہے، نہ ناراض ہوتا ہے اور نہ راضی ہوتا ہے، کیونکہ یہ سب حوادث (نئے احوال) ہیں جو ان کے خیال میں اللہ تعالیٰ پر نہیں آ سکتے۔ ¤ یہ لوگ قرآن و حدیث میں آنے والے ایسے تمام الفاظ کی ایسی ایسی تاویلیں کرتے ہیں جو درحقیقت تحریف ہیں۔ ان کا کہنا ہے کہ یہ سب استعارے ہیں جو عرب کے بدوؤں کے ذہن کے مطابق اللہ تعالیٰ کو ایک بادشاہ کی صورت میں پیش کرتے ہوئے استعمال کیے گئے ہیں۔ گویا اللہ تعالیٰ اور اس کی ذات و صفات کو نہ رسول اللہ صلی اللہ علیہ وسلم نے جانا نہ صحابہ کرام رضی اللہ عنھم نے۔ اصل حقیقت یونانی فلسفیوں پر منکشف ہوئی اور ان کی بدولت ان حضرات تک پہنچی۔ قرآن مجید جا بجا ان کے اس قاعدے کی نفی کرتا ہے، جیسا کہ فرمایا : « يَسْـَٔلُهٗ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ » [ الرحمٰن : ۲۹ ] ’’ اسی سے مانگتا ہے جو کوئی آسمانوں اور زمین میں ہے، ہر دن وہ ایک (نئی) شان میں ہے۔‘‘ اور فرمایا : «قَدْ سَمِعَ اللّٰهُ قَوْلَ الَّتِيْ تُجَادِلُكَ فِيْ زَوْجِهَا » [ المجادلۃ : ۱ ] ’’یقینا اللہ نے اس عورت کی بات سن لی جو تجھ سے اپنے خاوند کے بارے میں جھگڑ رہی تھی۔‘‘ اور فرمایا : «اُجِيْبُ دَعْوَةَ الدَّاعِ اِذَا دَعَانِ » [ البقرۃ : ۱۸۶ ] ’’میں پکارنے والے کی دعا قبول کرتا ہوں جب وہ مجھے پکارتا ہے۔‘‘ اور فرمایا : « وَ كَلَّمَ اللّٰهُ مُوْسٰى تَكْلِيْمًا » [ النساء : ۱۶۴ ] ’’اور اللہ نے موسیٰ سے کلام کیا، خود کلام کرنا۔‘‘ اور فرمایا : « وَ مَا يَاْتِيْهِمْ مِّنْ ذِكْرٍ مِّنَ الرَّحْمٰنِ مُحْدَثٍ اِلَّا كَانُوْا عَنْهُ مُعْرِضِيْنَ» [ الشعرآء : ۵ ] ’’اور ان کے پاس رحمان کی طرف سے کوئی نصیحت نہیں آتی جو نئی ہو، مگر وہ اس سے منہ موڑنے والے ہوتے ہیں۔‘‘ مزید دیکھیے سورۂ فجر (۲۲) اور سورۂ حاقہ (۱۷) کی تفسیر۔ ¤ ➋ { وَ وُضِعَ الْكِتٰبُ : } یعنی تمام لوگوں کے اعمال نامے ان کے سامنے رکھ دیے جائیں گے۔ دیکھیے سورۂ بنی اسرائیل (۱۳) اور سورۂ کہف (۴۹)۔ ¤ ➌ {وَ جِايْٓءَ بِالنَّبِيّٖنَ وَ الشُّهَدَآءِ :} شہداء (گواہوں) سے مراد نبیوں کے علاوہ ہماری امت اور پہلی تمام امتوں کے وہ نیک لوگ ہیں جنھوں نے اپنی اپنی امت کے لوگوں تک حق کا پیغام پہنچایا، کیونکہ اللہ تعالیٰ کا فرمان ہے : «وَ مَا كُنَّا مُعَذِّبِيْنَ حَتّٰى نَبْعَثَ رَسُوْلًا » [ بني إسرائیل : ۱۵ ] ’’اور ہم کبھی عذاب دینے والے نہیں، یہاں تک کہ کوئی پیغام پہنچانے والا بھیجیں۔‘‘ ان شہداء میں امت محمد صلی اللہ علیہ وسلم کے وہ افراد بھی شامل ہیں جو نوح علیہ السلام اور دوسرے انبیاء کے حق میں شہادت دیں گے کہ انھوں نے اپنی اپنی امت کو اللہ کا پیغام پہنچا دیا تھا۔ مزید تفصیل کے لیے دیکھیے سورۂ بقرہ (۱۴۳) اور سورۂ نساء (۴۱) کی تفسیر۔ ان گواہوں میں کراماً کاتبین بھی شامل ہیں اور انسان کے اعضا بھی جو اس کے خلاف گواہی دیں گے۔ اسی طرح زمین بھی، جس پر کسی شخص نے کوئی نیک یا برا عمل کیا ہو گا، فرمایا : « يَوْمَىِٕذٍ تُحَدِّثُ اَخْبَارَهَا (4) بِاَنَّ رَبَّكَ اَوْحٰى لَهَا» [ الزلزال : ۴، ۵ ] ’’اس دن وہ اپنی خبریں بیان کرے گی۔ اس لیے کہ تیرے رب نے اسے وحی کی ہو گی۔‘‘ ¤ ➍ { وَ قُضِيَ بَيْنَهُمْ بِالْحَقِّ … :} یعنی تمام نیکیاں اور بدیاں سامنے لا کر گواہوں کے ذریعے سے حجت پوری کرنے کے بعد سب لوگوں کے درمیان حق کے ساتھ فیصلہ کیا جائے گا اور لوگوں پر کسی طرح کا ظلم نہیں کیا جائے گا۔ دیکھیے سورۂ انبیاء (۴۷) اور سورۂ نساء (۴۰)۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) ➊ { وَ وُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ :} ہر جان کو اس کے نیک یا بد عمل کا پورا بدلا دیا جائے گا، ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے رب عز و جل سے جو کچھ روایت کیا اس میں یہ بھی فرمایا : [ إِنَّ اللّٰهَ كَتَبَ الْحَسَنَاتِ وَ السَّيِّئَاتِ، ثُمَّ بَيَّنَ ذٰلِكَ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللّٰهُ لَهُ عِنْددَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللّٰهُ لَهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلٰی سَبْعِمِائَةِ ضِعْفٍ  إِلٰی أَضْعَافٍ كَثِيْرَةٍ، وَ مَنْ هَمَّ بِسَيِّئَةٍ فَلَمْ ييَعْمَلْهَا كَتَبَهَا اللّٰهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللّٰهُ لَهُ سَيِّئَةً وَاحِدَةً ] [ بخاري، الرقاق، باب من ھم بحسنۃ أو بسیئۃ : ۶۴۹۱ ] ’’اللہ تعالیٰ نے نیکیاں اور برائیاں لکھ دیں، پھر ان کی وضاحت فرما دی، تو جس شخص نے کسی نیکی کا ارادہ کیا اور عمل نہ کیا تو اللہ تعالیٰ اسے اپنے پاس ایک پوری نیکی لکھ لیتا ہے اور اگر وہ اس کا ارادہ کرے اور اسے کر بھی لے تو اللہ تعالیٰ اسے اپنے پاس دس سے سات سو گنا بلکہ بہت گنا تک نیکیاں لکھ لیتا ہے اور جس نے کسی برائی کا ارادہ کیا، پھر (اللہ کے خوف سے) اس پر عمل نہ کیا، تو اللہ تعالیٰ اس کے عوض اپنے پاس ایک پوری نیکی لکھ لیتا ہے اور اگر اس نے اس کا ارادہ کیا اور اس پر عمل بھی کر لیا تو اللہ تعالیٰ اسے اس کے لیے ایک برائی لکھ لیتا ہے۔‘‘ ¤ ➋ {وَ هُوَ اَعْلَمُ بِمَا يَفْعَلُوْنَ :} یعنی دنیا میں لوگ جو عمل کر رہے ہیں انھیں اللہ تعالیٰ خوب جانتا ہے، اسے کسی لکھنے والے یا حساب رکھنے والے یا گواہی پیش کرنے والے کی ضرورت نہیں، لیکن اعمال نامہ اس لیے رکھا جائے گا اور پیغمبروں اور گواہوں کو اس لیے لایا جائے گا کہ لوگوں پر حجت تمام ہو۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) ➊ {وَ سِيْقَ الَّذِيْنَ كَفَرُوْۤا اِلٰى جَهَنَّمَ زُمَرًا : ’’سَاقَ يَسُوْقُ سَوْقًا‘‘} (ن) کسی کو اپنے آگے رکھ کر پیچھے سے ہانکنا، اس میں ہانکے جانے والے کی ذلت کا اظہار ہوتا ہے۔ آگے رہ کر کسی کو اپنے پیچھے چلانے کے لیے {’’قَادَ يَقُوْدُ‘‘} کا لفظ استعمال ہوتا ہے۔ {’’ زُمَرًا ‘‘ ’’زُمْرَةٌ‘‘ } کی جمع ہے، وہ گروہ جس کے پیچھے اور گروہ ہو۔ {’’زُمْرَةٌ مِنَ النَّاسِ‘‘} اس جماعت کو کہا جاتا ہے جس کے پیچھے اور جماعت آ رہی ہو۔ ¤ ➋ پچھلی آیات میں قیامت کے دن حق کے ساتھ فیصلے کا ذکر ہے، ان آیات میں اس فیصلے پر عمل کا ذکر ہے۔ چنانچہ پہلے عذاب کے مستحق لوگوں کا ذکر فرمایا ہے، کیونکہ مقام ان لوگوں کو نصیحت اور ڈرانے کا ہے جو اتنی نصیحت اور اس قدر دلائل سن کر بھی کفر پر جمے رہے۔ ¤ ➌ یعنی جب کافروں کا جرم ثابت ہونے کے بعد فیصلہ کر دیا جائے گا تو ٹولیاں بنا کر انھیں زبردستی ہانکتے ہوئے جہنم کی طرف لے جایا جائے گا، جیسا کہ فرمایا : « يَوْمَ يُدَعُّوْنَ اِلٰى نَارِ جَهَنَّمَ دَعًّا » [ الطور : ۱۳ ] ’’جس دن انھیں جہنم کی آگ کی طرف دھکیلا جائے گا، بری طرح دھکیلا جانا۔‘‘ مختلف گروہوں میں تقسیم یا تو کفر کی درجہ بندی کے لحاظ سے ہو گی کہ منافق درک اسفل میں ہوں گے اور کچھ وہ بھی ہوں گے جنھیں صرف آگ کا جوتا پہنایا جائے گا، یا زمانے کے لحاظ سے کہ پہلے لوگ پہلے اور بعد کے لوگ بعد میں داخل ہوں گے۔ (دیکھیے اعراف : ۳۸) ایک تقسیم مجرموں کی مختلف اقسام کے لحاظ سے بھی ہو گی، مثلاً چوروں کا گروہ، بدکاروں کا گروہ وغیرہ۔ دیکھیے سورۂ صافات (۲۲) اور سورۂ حٰمٓ السجدہ (۱۹)۔ ¤ ➍ { حَتّٰۤى اِذَا جَآءُوْهَا فُتِحَتْ اَبْوَابُهَا:} یعنی ان کے آنے پر جہنم کے دروازے، جو پہلے بند تھے، کھولے جائیں گے، جس طرح قید خانے کے دروازے صرف مجرموں کی آمد پر کھولے جاتے ہیں اور پھر ان پر بند کر دیے جاتے ہیں، تاکہ وہ وہیں قید رہیں۔ ¤ ➎ {وَ قَالَ لَهُمْ خَزَنَتُهَاۤ : ’’خَزَنَةٌ‘‘ ’’خَازِنٌ‘‘} کی جمع ہے، جیسا کہ {’’طَلَبَةٌ‘‘ ’’طَالِبٌ‘‘} کی جمع ہے۔ دربان کو خازن کہا جاتا ہے، کیونکہ عموماً دربان وہیں ہوتے ہیں جہاں قیمتی چیزوں کا خزانہ ہو۔ جہنم کے دربانوں کی صفت کے لیے دیکھیے سورۂ تحریم (۶)۔ ¤ ➏ { اَلَمْ يَاْتِكُمْ رُسُلٌ مِّنْكُمْ … :} جہنم کے سخت دل، سخت لہجے اور قوت والے فرشتے ان سے یہ بات پوچھنے کے لیے نہیں بلکہ انھیں ملامت کرنے اور ڈانٹنے کے لیے کہیں گے، جسمانی عذاب کے ساتھ یہ عذاب مزید ہو گا۔ دیکھیے سورۂ انعام (۱۲۰) اور سورۂ ملک (۸ تا ۱۱)۔ ¤ ➐ { قَالُوْا بَلٰى وَ لٰكِنْ … :} یعنی ہاں آئے تھے اور انھوں نے ڈرایا بھی تھا، مگر ہم ہی ایسے اعمال کرتے رہے کہ اللہ تعالیٰ کی وہ بات جو اس نے جہنم کو کافر جنوں اور انسانوں سے بھرنے کے متعلق فرمائی تھی (دیکھیے السجدہ : ۱۳) وہ ہمارے حق میں سچی ثابت ہوئی۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) { فَبِئْسَ مَثْوَى الْمُتَكَبِّرِيْنَ :} اس جملے سے معلوم ہوا کہ جہنم میں جانے کی سب سے بڑی وجہ تکبر (یعنی اپنے آپ کو بڑا سمجھ کر حق کا انکار) ہے۔ ابلیس کا بھی اصل جرم تکبر ہی تھا، اس لیے اللہ تعالیٰ نے ان کے الگ الگ جرم گنانے کے بجائے تمام جرائم کا اصل ذکر فرما دیا، جو تمام مجرموں میں مشترک ہے۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) ➊ {وَ سِيْقَ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ اِلَى الْجَنَّةِ …:} کفار کے انجام سے ڈرانے کے بعد متقین کے حسن انجام کی بشارت دی، کیونکہ قرآن مجید میں یہ دونوں ساتھ ساتھ چلتے ہیں، جیسا کہ فرمایا : « لِتُبَشِّرَ بِهِ الْمُتَّقِيْنَ وَ تُنْذِرَ بِهٖ قَوْمًا لُّدًّا» [ مریم : ۹۷ ] ’’تاکہ تو اس کے ساتھ متقی لوگوں کو خوش خبری دے اور اس کے ساتھ ان لوگوں کو ڈرائے جو سخت جھگڑا لو ہیں۔‘‘ ¤ ➋ یہاں ایک سوال ہے کہ {’’سَاقَ يَسُوْقُ‘‘} میں سختی کے ساتھ ہانکنے کا مفہوم پایا جاتا ہے، جیسا کہ اوپر کی آیات میں کفار کو سختی سے ہانک کر جہنم کی طرف لے جانے کا ذکر ہے، تو یہاں متقین کو جنت کی طرف لے جانے کے لیے یہ لفظ کیوں استعمال کیا گیا؟ جواب اس کا یہ ہے کہ یہاں یہ لفظ پہلے {’’ سِيْقَ ‘‘} کے ساتھ مشاکلت کے طور پر استعمال ہوا ہے، ورنہ یہاں اس لفظ سے مراد سختی سے لے جانا یا ہانکنا نہیں۔ اسے تجرید کہتے ہیں، یہاں اس سے مراد صرف لے جانا ہے۔ مقصد دونوں کو لے جانے کا باہمی فرق واضح کرنا ہے کہ اگرچہ دونوں کو لے جایا جائے گا، مگر کفار کو لے جانے میں سختی، دھکے اور اہانت و تذلیل ہو گی، جب کہ مومنوں کو اکرام کے ساتھ لے جایا جائے گا، جس کی دلیل بعد میں آنے والے الفاظ {’’ وَ فُتِحَتْ اَبْوَابُهَا ‘‘} اور {’’ وَ قَالَ لَهُمْ خَزَنَتُهَا ‘‘} ہیں۔ ¤ ➌ { زُمَرًا:} یہ جماعتیں درجات کے لحاظ سے ہوں گی، چنانچہ سب سے بلند درجات والے پہلے داخل ہوں گے۔ ( دیکھیے سورۂ واقعہ : ۱۰) مثلاً انبیاء، صدیقین، شہداء اور صالحین، اسی طرح درجہ بدرجہ جماعتیں جنت میں داخل ہوں گی۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَوَّلُ زُمْرَةٍ تَلِجُ الْجَنَّةَ صُوْرَتُهُمْ عَلٰی صُوْرَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ، لَا يَبْصُقُوْنَ فِيْهَا وَ لاَ يَمْتَخِطُوْنَ وَ لَا يَتَغَوَّطُوْنَ، آنِيَتُهُمْ فِيْهَا الذَّهَبُ، أَمْشَاطُهُمْ مِنَ الذَّهَبِ وَالْفِضَّةِ، وَ مَجَامِرُهُمُ الْأُلُوَّةُ، وَرَشْحُهُمُ الْمِسْكُ، وَ لِكُلِّ وَاحِدٍ مِنْهُمْ زَوْجَتَانِ، يُرٰی مُخُّ سُوْقِهِمَا مِنْ وَرَااءِ اللَّحْمِ، مِنَ الْحُسْنِ، لَا اخْتِلاَفَ بَيْنَهُمْ وَ لَا تَبَاغُضَ، قُلُوْبُهُمْ قَلْبٌ وَاحِدٌ، يُسَبِّحُوْنَ اللّٰهَ بُكْرَةً وَ عَشِيًّا ] [ بخاري، بدء الخلق، باب ما جاء في صفۃ الجنۃ و أنھا مخلوقۃ : ۳۲۴۵ ] ’’پہلا گروہ جو جنت میں داخل ہو گا ان کے چہرے چودھویں رات کے چاند کی طرح ہوں گے، وہ نہ اس میں تھوکیں گے، نہ رینٹ پھینکیں گے اور نہ پاخانہ کریں گے۔ اس میں ان کے برتن سونے کے ہوں گے، ان کی کنگھیاں سونے اور چاندی کی ہوں گی اور ان کی انگیٹھیاں {’’اُلُوَّه‘‘ } (جل کر خوشبو دینے والی ایک لکڑی) کی ہوں گی، ان کا پسینہ کستوری ہو گا، ان میں سے ہر ایک کی دو بیویاں وہ ہوں گی جن کی پنڈلیوں کا مغز حسن کی وجہ سے گوشت کے پیچھے سے دکھائی دے گا، ان میں نہ کوئی اختلاف ہوگا، نہ ایک دوسرے سے کوئی بغض ہو گا، ان کے دل ایک دل ہوں گے، صبح و شام اللہ تعالیٰ کی تسبیح کریں گے۔‘‘ صحیح مسلم میں اسی حدیث میں ہے : [ أَوَّلُ زُمْرَةٍ تَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِيْ عَلٰی صُوْرَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ، ثُمَّ الَّذِيْنَ يَلُوْنَهُمْ عَلٰی أَشَدِّ نَجْمٍ فِي السَّمَاءِ إِضَاءَةً ثُمَّ هُمْ بَعْدَ ذٰلِكَ مَنَازِلُ ] [ مسلم، الجنۃ و صفۃ نعیمہا و أھھلھا، باب أول زمرۃ تدخل الجنۃ… : ۱۶؍۲۸۳۴ ] ’’میری امت کی پہلی جماعت جو جنت میں داخل ہو گی ان کے چہرے چودھویں کے چاند کی طرح ہوں گے، پھر جو ان کے بعد جائیں گے وہ آسمان کے سب سے زیادہ روشن ستارے کی طرح ہوں گے، پھر اس کے بعد ان کے مختلف مراتب ہوں گے۔‘‘ ¤ ➍ جنتیوں کے گروہوں کی ایک تقسیم مختلف صالح اعمال میں خصوصیت کی بنا پر ہو گی، جن کی بنا پر انھیں مختلف دروازوں سے بلایا جائے گا۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : [ مَنْ أَنْفَقَ زَوْجَيْنِ مِنْ شَيْءٍ مِنَ الْأَشْيَاءِ فِيْ سَبِيْلِ اللّٰهِ دُعِيَ مِنْ أَبْوَابِ يَعْنِی الْجَنَّةَ يَا عَبْدَ اللّٰهِ! هٰذَا خَيْرٌ، فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ دُعِيَ مِنْ بَابِ الصَّلَاةِ، وَ مَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ بَابِ الْجِهَادِ، وَ مَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ بَابِ الصَّدَقَةِ، وَ مَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الصِّيَامِ، وَ بَابِ الرَّيَّانِ، فَقَالَ أَبُوْ بَكْرٍ مَا عَلٰی هٰذَا الَّذِيْ يُدْعٰی مِنْ تِلْكَ الْأَبْوَابِ مِنْ ضَرُوْرَةٍ، وَ قَالَ هَلْ يُدْعٰی مِنْهَا كُلِّهَا أَحَدٌ يَا رَسُوْلَ اللّٰهِ!؟ قَالَ نَعَمْ، وَ أَرْجُوْ أَنْ تَكُوْنَ مِنْهُمْ يَا أَبَا بَكْرٍ! ] [بخاري، باب فضائل أصحاب النبي صلی اللہ علیہ وسلم ، باب : ۳۶۶۶ ] ’’جو شخص کسی چیز کا ایک جوڑا اللہ کے راستے میں خرچ کرے گا اسے جنت کے دروازوں سے بلایا جائے گا، اے اللہ کے بندے! یہ خیر ہے۔ تو جو شخص نماز والوں سے ہو گا اسے نماز کے دروازے سے بلایا جائے گا اور جو جہاد والوں سے ہو گا اسے جہاد کے دروازے سے بلایا جائے گا اور جو صدقہ والوں سے ہو گا اسے صدقہ کے دروازے سے بلایا جائے گا اور جو روزے والوں سے ہو گا اسے روزے کے دروازے اور باب الریان (سیرابی کے دروازے) سے بلایا جائے گا۔‘‘ تو ابوبکر رضی اللہ عنہ نے کہا : ’’جس شخص کو ان دروازوں سے بلایا جائے اسے کوئی ضرورت تو نہیں، مگر یا رسول اللہ! کیا کسی کو ان تمام دروازوں سے بھی بلایا جائے گا؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہاں! اور میں امید کرتا ہوں کہ اے ابوبکر! تم بھی ان میں سے ہو گے۔‘‘ ¤ ➎ {حَتّٰۤى اِذَا جَآءُوْهَا وَ فُتِحَتْ اَبْوَابُهَا :} یہاں {’’ فُتِحَتْ ‘‘} سے پہلے ’’واؤ‘‘ لانے کا مطلب یہ ہے کہ متقین کی آمد پر جنت کے دروازے پہلے ہی کھول دیے گئے ہوں گے، جیسے کسی معظم و مکرم مہمان کے انتظار میں پہلے ہی دروازے کھلے رکھے جاتے ہیں۔ اسی کو دوسری آیت میں صراحت کے ساتھ فرمایا : « جَنّٰتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ الْاَبْوَابُ» [ صٓ : ۵۰ ] ’’ہمیشہ رہنے کے باغات، اس حال میں کہ ان کے لیے دروازے پورے کھولے ہوئے ہوں گے۔‘‘ جنت کے آٹھ دروازے ہیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فِي الْجَنَّةِ ثَمَانِيَةُ أَبْوَابٍ، فِيْهَا بَابٌ يُسَمَّی الرَّيَّانَ لاَ يَدْخُلُهُ إِلاَّ االصَّائِمُوْنَ ] [ بخاري، بدء الخلق، باب صفۃ أبواب الجنۃ : ۳۲۵۷ ] ’’جنت کے آٹھ دروازے ہیں، ایک دروازے کا نام ریّان ہے، اس میں سے صرف خاص روزے دار داخل ہوں گے۔‘‘ ¤ ➏ { وَ قَالَ لَهُمْ خَزَنَتُهَا سَلٰمٌ عَلَيْكُمْ … :} کفار کے برعکس متقین کی جنت کے پاس آمد پر اس  کے دربان فرشتے نہایت محبت کے ساتھ ان کا اکرام اور عزت افزائی کرتے ہوئے انھیں تین باتیں کہیں گے، پہلی یہ کہ تم پر سلام ہے، یعنی اب تم ہر تکلیف ، غم اور خوف سے سلامت رہو گے۔ دوسری بات {’’ طِبْتُمْ ‘‘} ہے، اس کے دو معنی ہو سکتے ہیں، ایک یہ کہ تم اس سے پہلے دنیا میں کفر و شرک سے پاک رہے، سو اس میں داخل ہو جاؤ ہمیشہ رہنے والے، دوسرا یہ کہ اب تم ہر گناہ اور بری بات سے پاک ہو گئے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَخْلُصُ الْمُؤْمِنُوْنَ مِنَ النَّارِ، فَيُحْبَسُوْنَ عَلٰی قَنْطَرَةٍ بَيْنَ الْجَنَّةِ وَ النَّارِ، فَيُقْتَصُّ لِبَعْضِهِمْ مِنْ بَعْضٍ، مَظَالِمُ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا، حَتّٰي إِذَا هُذذِّبُوْا وَ نُقُّوْا أُذِنَ لَهُمْ فِيْ دُخُوْلِ الْجَنَّةِ ] [ بخاري، الرقاق، باب القصاص یوم القیامۃ : ۶۵۳۵ ] ’’مومن آگ سے بچ کر نکلیں گے تو انھیں جنت اور آگ کے درمیان ایک پل پر روک لیا جائے گا، پھر انھیں ایک دوسرے سے ان زیادتیوں کا بدلا دلایا جائے گا جو دنیا میں آپس میں ہوئیں، پھر جب خوب پاک صاف ہو جائیں گے تو انھیں جنت میں داخلے کی اجازت ملے گی۔‘‘ تیسری بات یہ کہیں گے کہ چونکہ تم پاک ہو چکے، سو اب تم جنت میں ہمیشہ رہنے والے بن کر داخل ہو جاؤ۔ جنت میں داخلہ ہی بہت بڑی بشارت ہے، اس کے ساتھ ہمیشگی کی بشارت کی کوئی انتہا ہی نہیں۔ اللہ تعالیٰ ہمیں بھی ان خوش نصیبوں میں شامل فرمائے۔ [ آمِیْنَ یَا رَبَّ الْعَالَمِیْنَ ] ¤ ➐ کفار کے متعلق جو فرمایا : {’’ اِذَا جَآءُوْهَا ‘‘} (جب وہ اس کے پاس آئیں گے) اس شرط کی جزا {’’ وَ فُتِحَتْ اَبْوَابُهَا ‘‘} (تو اس کے دروازے کھولے جائیں گے) ہے، مگر متقین کے متعلق تینوں جملے شرط کا حصہ ہیں {’’ اِذَا جَآءُوْهَا ‘‘ ، ’’ وَ فُتِحَتْ اَبْوَابُهَا ‘‘ اور ’’ وَ قَالَ لَهُمْ خَزَنَتُهَا ‘‘} ان کی جزا حذف کر دی گئی ہے، کیونکہ اس دنیا میں انسانی فکر اس کی بلندی تک پہنچ ہی نہیں سکتی۔ گویا عبارت یوں ہے، یہاں تک کہ جب وہ اس کے پاس آئیں گے، اس حال میں کہ اس کے دروازے کھول دیے گئے ہوں گے اور اس کے نگران ان سے کہیں گے تم پر سلام ہو، تم پاکیزہ رہے، پس اس میں داخل ہو جاؤ، پاکیزہ رہنے والے، تو مت پوچھو کہ وہ کس قدر خوش ہوں گے، کیونکہ تم سوچ بھی نہیں سکتے کہ وہ کتنی بڑی نعمت حاصل کریں گے۔"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) ➊ {وَ قَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْ صَدَقَنَا وَعْدَهٗ:} اہلِ جنت جب جنت میں داخلل ہوں گے تو اپنے رب کی حمد اور اس کا شکر ادا کریں گے اور اس بات کا اقرار و اعلان کریں گے کہ اس نے جو وعدہ کیا تھا : « اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّ عُيُوْنٍ» [الذاریات : ۱۵ ] کہ بے شک متقی لوگ باغوں اور چشموں میں ہوں گے (اور دوسری آیات مثلاً مریم : ۶۳) وہ وعدہ اس نے پورا فرما دیا۔ مزید دیکھیے سورۂ اعراف (۴۳، ۴۴) اور سورۂ فاطر (۳۳ تا ۳۵)۔ ¤ ➋ { وَ اَوْرَثَنَا الْاَرْضَ:} آدمی جس چیز کا وارث بنتا ہے اس کا پوری طرح مالک بن جاتا ہے، کوئی دوسرا اس پر دعویٰ نہیں کر سکتا۔ اس کے علاوہ انھیں ان جگہوں کا بھی مالک بنایا جائے گا جو جہنم میں جانے والوں کی تھیں، اگر وہ نیک عمل کرتے اور یہ مالکانہ حقوق ہمیشہ کے لیے ہوں گے۔ ¤ ➌ {نَتَبَوَّاُ مِنَ الْجَنَّةِ حَيْثُ نَشَآءُ:} یہاں ایک سوال ہے کہ جنتی اگر چاہے تو کیا دوسرے اہلِ جنت کے گھروں میں اپنی جگہ بنا سکے گا؟ اس کے جواب میں شاہ عبد القادر رحمہ اللہ نے فرمایا : ’’ان کو حکم ہے کہ جہاں چاہیں رہیں، لیکن ہر کوئی وہی جگہ چاہے گا جو اس کے واسطے پہلے سے رکھی ہے۔‘‘ (موضح) اس کی تفصیل یہ ہے کہ ہر جنتی کے پاس اتنی جگہ ہو گی کہ اسے کسی اور کی جگہ لینے کی ضرورت ہی نہیں ہو گی۔ ابو سعید خدری رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیا کہ جہنم سے نکل کر جنت میں جانے والے شخص کو اللہ تعالیٰ زمین کے برابر اور اس کے ساتھ اس سے دس گنا زیادہ جگہ عطا فرمائے گا۔ [ دیکھیے بخاري، الأذان، باب فضل السجود : ۸۰۶ ] ظاہر ہے اتنی جگہ ہوتے ہوئے کسی دوسرے کی جگہ کی خواہش کوئی کمینہ شخص ہی کرے گا، جب کہ جنت میں کسی کمینگی یا کمینے شخص کی گنجائش ہی نہیں۔ ¤ ➍ { فَنِعْمَ اَجْرُ الْعٰمِلِيْنَ:} یہ بات متقی کہیں گے یا فرشتے، یا یہ اللہ تعالیٰ کا فرمان ہے۔"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) ➊ { وَ تَرَى الْمَلٰٓىِٕكَةَ حَآفِّيْنَ … :} یعنی جس وقت اللہ تعالیٰ لوگوں کے درمیان فیصلہ کرنے کے لیے نزول فرمائے گا اس وقت فرشتے عرش کو اردگرد سے گھیرے ہوئے ہوں گے۔ اس منظر کو دوسرے مقام پر کچھ تفصیل کے ساتھ بیان فرمایا ہے : « فَاِذَا نُفِخَ فِي الصُّوْرِ نَفْخَةٌ وَّاحِدَةٌ (13) وَّ حُمِلَتِ الْاَرْضُ وَ الْجِبَالُ فَدُكَّتَا دَكَّةً وَّاحِدَةً (14) فَيَوْمَىِٕذٍ وَّقَعَتِ الْوَاقِعَةُ (15) وَ انْشَقَّتِ السَّمَآءُ فَهِيَ يَوْمَىِٕذٍ وَّاهِيَةٌ (16) وَّ الْمَلَكُ عَلٰۤى اَرْجَآىِٕهَا وَ يَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَىِٕذٍ ثَمٰنِيَةٌ (17) يَوْمَىِٕذٍ تُعْرَضُوْنَ لَا تَخْفٰى مِنْكُمْ خَافِيَةٌ» [ الحآقۃ : ۱۳ تا ۱۸ ] ’’پس جب صور میں پھونکا جائے گا، ایک بار پھونکنا۔ اور زمین اور پہاڑوں کو اٹھایا جائے گا، پس دونوں ٹکرا دیے جائیں گے، ایک بار ٹکرا دینا۔ تو اس دن ہونے والی ہو جائے گی۔ اور آسمان پھٹ جائے گا، پس وہ اس دن کمزور ہو گا۔ اور فرشتے اس کے کناروں پر ہوں گے اور تیرے رب کا عرش اس دن آٹھ (فرشتے) اپنے اوپر اٹھائے ہوئے ہوں گے۔ اس دن تم پیش کیے جاؤ گے، تمھاری کوئی چھپی ہوئی بات چھپی نہیں رہے گی۔‘‘ سورۂ حاقہ میں ان آیات کی تفسیر ملاحظہ فرمائیں۔ ¤ ➋ { مِنْ حَوْلِ الْعَرْشِ:} یہاں ایک سوال ہے کہ یہ کہنا ہی کافی تھا {’’حَافِّيْنَ حَوْلَ الْعَرْشِ‘‘} کہ وہ عرش کے گرد گھیرا ڈالے ہوئے ہوں گے، پھر لفظ {’’ مِنْ ‘‘} لانے کی کیا ضرورت تھی؟ اس کا جواب بعض مفسرین نے دیا ہے کہ یہ {’’ مِنْ ‘‘ } زائد ہے۔ بقاعی نے فرمایا کہ یہ {’’ مِنْ ‘‘ } تبعیض کے لیے ہے، یعنی فرشتے کتنی بھی تعداد میں ہوں عرش اللہ تعالیٰ کی اتنی بڑی مخلوق ہے کہ سب فرشتے مل کر بھی اس کے اردگرد کے کچھ حصے ہی پر گھیرا ڈال سکیں گے۔ ¤ ➌ { وَ قُضِيَ بَيْنَهُمْ بِالْحَقِّ:} یعنی ایسے پر جلال اور پر ہیبت ماحول میں اللہ تعالیٰ لوگوں کے درمیان حق کے ساتھ فیصلہ فرمائے گا۔ ¤ ➍ {وَ قِيْلَ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ:} یعنی لوگوں کے فیصلے کا اختتام اللہ رب العالمین کی حمد پر ہو گا۔ حمد کرنے والوں کے عام ہونے کی وجہ سے {’’ قِيْلَ ‘‘} (کہا جائے گا) میں کہنے والے کا ذکر نہیں فرمایا۔ مطلب یہ کہ جب فیصلہ ہو چکے گا تو کائنات کا ذرہ ذرہ ان سراسر عدل اور رحم والے فیصلوں پر اللہ رب العالمین کی حمد کرے گا اور ہر طرف سے آواز آئے گی : « اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ» ’’ سب تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے۔‘‘ طبری نے صحیح سند کے ساتھ قتادہ کا قول ذکر کیا ہے، انھوں نے فرمایا : ’’مخلوق کی پیدائش کی ابتدا بھی حمد کے ساتھ ہے، جیسا کہ فرمایا : « اَلْحَمْدُ لِلّٰهِ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ وَ جَعَلَ الظُّلُمٰتِ وَ النُّوْرَ » [ الأنعام : ۱ ] ’’سب تعریف اللہ کے لیے ہے جس نے آسمانوں اور زمین کو پیدا کیا اور اندھیروں اور روشنی کو بنایا۔‘‘ اور مخلوق کی انتہا بھی حمد ہے، فرمایا : « وَ قُضِيَ بَيْنَهُمْ بِالْحَقِّ وَ قِيْلَ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ » [ الزمر : ۷۵ ] ’’اور ان کے درمیان حق کے ساتھ فیصلہ کر دیا جائے گا اور کہا جائے گا کہ سب تعریف ا للہ کے لیے ہے جو تمام جہانوں کا رب ہے۔‘‘ (طبری) ہمارے لیے اس میں یہ سبق ہے کہ ہر کام کے آخر میں اللہ تعالیٰ کی حمد و ثنا ہونی چاہیے، جیسا کہ اہلِ جنت کے متعلق فرمایا : « دَعْوٰىهُمْ فِيْهَا سُبْحٰنَكَ اللّٰهُمَّ وَ تَحِيَّتُهُمْ فِيْهَا سَلٰمٌ وَ اٰخِرُ دَعْوٰىهُمْ اَنِ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ» [ یونس : ۱۰ ] ’’ان کی دعا ان میں یہ ہوگی’’پاک ہے تو اے اللہ!‘‘ اور ان کی آپس کی دعا ان (باغات) میں سلام ہوگی اور ان کی دعا کا خاتمہ یہ ہوگا کہ سب تعریف اللہ کے لیے جو تمام جہانوں کا پالنے والا ہے۔‘‘ حمد کے متعلق مزید دیکھیے سورۂ فاتحہ کی تفسیر۔"
    }
  ]
}