{
  "surah": "Fussilat",
  "surah_number": 41,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "’’سورهٔ حم السجده‘‘ کا ایک نام ’’سورهٔ فصلت ‘‘ بھی ہے۔ ¤ (آیت 1) {حٰمٓ:} حروف مقطعات کی تفصیل کے لیے دیکھیے سورۂ بقرہ کی پہلی آیت کی تفسیر۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { تَنْزِيْلٌ مِّنَ الرَّحْمٰنِ الرَّحِيْمِ: ’’ تَنْزِيْلٌ ‘‘} کا معنی ’’تھوڑا تھوڑا کرکے اتارنا‘‘ ہے۔ قرآن مجید کو ایک ہی دفعہ نازل کرنے کے بجائے تیئیس (۲۳) برس میں نازل کرنے کی حکمتوں کے لیے دیکھیے سورۂ بنی اسرائیل کی آیت (۱۰۶) کی تفسیر۔ {’’ الرَّحْمٰنِ الرَّحِيْمِ ‘‘} کا مفہوم اور باہمی فرق سورۂ فاتحہ کی تفسیر میں دیکھیے۔ کفار قرآن مجید کو اللہ تعالیٰ کی طرف سے نازل شدہ کتاب نہیں مانتے تھے، بلکہ اسے رسول اللہ صلی اللہ علیہ وسلم کا خود ساختہ کلام کہتے تھے۔ اللہ تعالیٰ نے انھیں یقین دلانے کے لیے کہ یہ اللہ تعالیٰ ہی کی طرف سے نازل شدہ ہے، اس بات کو متعدد مقامات پر مختلف انداز سے بیان فرمایا۔ پچھلی سورت میں یہ بات اپنی صفات ’’عزيز و عليم‘‘ کے ذکر کے ساتھ بیان فرمائی، یہاں ’’رحمان و رحیم ‘‘ کے ساتھ ذکر فرمائی۔ ¤ ➋ {’’ الرَّحْمٰنِ الرَّحِيْمِ ‘‘} کا ذکر اس لیے فرمایا کہ ساری مخلوق محتاج ہے، جس کی ہر ضرورت پوری کرنے والا رحمان و رحیم ہے۔ وہ سب ضعیف اور بیمار ہیں، ان کی غذا اور ہر ضرورت کا اہتمام اور ان کی بیماریوں اور کمزوریوں کا مداوا وہی کرتا ہے جو رحمان ہے، جس کی رحمت کی کوئی حد نہیں اور رحیم بھی ہے کہ اس کی رحمت دائمی ہے، جسے کبھی زوال نہیں۔ اس نے رحم کرتے ہوئے یہ کتاب نازل فرمائی ہے، تاکہ لوگ ضلالت کی تاریکیوں سے ہدایت کی روشنی میں آ جائیں اور دنیا اور آخرت دونوں میں اس بہت بڑی ہلاکت سے بچ جائیں جو مشرکین کا مقدر ہے، جس کا ذکر آیت (۶) میں آ رہا ہے۔ کتاب کا اتارنا اس کی صفت رحمت کا اظہار ہے۔ دیکھیے سورۂ انعام (۱۵۷) اور سورۂ عنکبوت (۵۱)۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {كِتٰبٌ فُصِّلَتْ اٰيٰتُهٗ:’’ فُصِّلَتْ ‘‘} کا کچھ بیان سورۂ ہود کی پہلی آیت کی تفسیر میں گزر چکا ہے۔ یہاں ہمارے استاذ محمد عبدہ لکھتے ہیں : ’’یعنی ان میں مختلف مضامین عقائد، حرام و حلال، گزشتہ اقوام کے واقعات اور مثالیں وغیرہ کھول کھول کر واضح اندازمیں بیان کیے گئے ہیں۔‘‘ (اشرف الحواشی) یہ {’’ كِتٰبٌ ‘‘} کی پہلی صفت ہے۔ ¤ ➋ { قُرْاٰنًا عَرَبِيًّا:} یہ دوسری صفت ہے۔ تفسیر کے لیے دیکھیے سورۂ یوسف (۲) اور سورۂ شعراء (۱۹۵)۔ ¤ ➌ { لِقَوْمٍ يَّعْلَمُوْنَ:} یہ تیسری صفت ہے۔ {’’ لِقَوْمٍ ‘‘} کا لام {’’ تَنْزِيْلٌ ‘‘} کے متعلق بھی ہو سکتا ہے اور {’’ فُصِّلَتْ ‘‘} کے بھی۔ یعنی یہ کتاب ان لوگوں کے لیے نازل کی گئی ہے اور انھی کے لیے اس کی آیات کھول کھول کر بیان کی گئی ہیں جو جانتے ہیں، یا جاننا اور سمجھنا چاہتے ہیں۔ گویا یہ ان کے لیے ہے ہی نہیں جو علم کے بجائے اپنی خواہشِ نفس یا آبا و اکابر کی تقلید کے پیروکار ہیں، کیونکہ ان کا عناد اور تعصب انھیں سوچنے سمجھنے حتیٰ کہ سننے کی بھی اجازت نہیں دیتا (دیکھیے حم السجدۃ : ۲۶) اور نہ سننا اور نہ سمجھنا ہی لوگوں کو جہنم میں لے جائے گا، جیسا کہ سورۂ ملک میں ہے : « وَ قَالُوْا لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ مَا كُنَّا فِيْۤ اَصْحٰبِ السَّعِيْرِ » [[ الملک : ۱۰ ] ’’ اور وہ کہیں گے اگر ہم سنتے ہوتے یا سمجھتے ہوتے تو بھڑکتی ہوئی آگ والوں میں نہ ہوتے۔‘‘ یہی بات متعدد آیات میں بیان فرمائی، فرمایا : «وَ تِلْكَ الْاَمْثَالُ نَضْرِبُهَا لِلنَّاسِ وَ مَا يَعْقِلُهَاۤ اِلَّا الْعٰلِمُوْنَ » [ العنکبوت : ۴۳ ] ’’اور یہ مثالیں ہیں جو ہم لوگوں کے لیے بیان کرتے ہیں اور انھیں صرف جاننے والے ہی سمجھتے ہیں۔‘‘ اور فرمایا : «بَلْ هُوَ اٰيٰتٌۢ بَيِّنٰتٌ فِيْ صُدُوْرِ الَّذِيْنَ اُوْتُوا الْعِلْمَ » [ العنکبوت : ۴۹ ] ’’بلکہ یہ تو واضح آیات ہیں ان لوگوں کے سینوں میں جنھیں علم دیا گیا ہے۔‘‘ اور فرمایا : « اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّلْعٰلِمِيْنَ » [ الروم : ۲۲ ] ’’بے شک اس میں جاننے والوں کے لیے یقینا بہت سی نشانیاں ہیں۔‘‘ اور فرمایا : « اِنَّاۤ اَنْزَلْنٰهُ قُرْءٰنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُوْنَ » [یوسف : ۲ ] ’’بے شک ہم نے اسے عربی قرآن بنا کر نازل کیا ہے، تا کہ تم سمجھو۔‘‘"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { بَشِيْرًا وَّ نَذِيْرًا:} یہ چوتھی اور پانچویں صفت ہے کہ یہ کتاب ایمان لانے والوں کو دنیا اور آخرت دونوں جہاں میں بہترین انجام کی بشارت دیتی ہے اور جھٹلانے والوں کو دنیا اور آخرت کے بدترین انجام سے ڈراتی ہے۔ ¤ ➋ { فَاَعْرَضَ اَكْثَرُهُمْ فَهُمْ لَا يَسْمَعُوْنَ:} قرآن مجید کی صفات بیان کرنے کے بعد اس پر لوگوں کا رد عمل بیان فرمایا کہ ان میں سے اکثر نے منہ موڑ لیا، سو وہ سنتے ہی نہیں۔ اکثر سے مراد یہاں کفار ہیں۔ نہ سننے سے مراد یہ ہے کہ وہ سرے سے سنتے ہی نہیں، بلکہ مجلس سے اٹھ جاتے ہیں (دیکھیے ص : ۶) یا کانوں میں انگلیاں ڈال لیتے ہیں اور کپڑے اوڑھ لیتے ہیں۔ (دیکھیے نوح : ۷) یا شور و غل ڈال کر نہ خود سنتے ہیں نہ کسی کو سننے دیتے ہیں، جیسا کہ اسی سورۂ حم السجدہ کی آیت (۲۶) میں ہے اور نہ سننے سے مراد یہ بھی ہے کہ وہ اسے قبول نہیں کرتے، کیونکہ جب ماننا ہی نہیں تو سننا نہ سننا برابر ہے، جیسا کہ فرمایا : «وَ لَقَدْ ذَرَاْنَا لِجَهَنَّمَ كَثِيْرًا مِّنَ الْجِنِّ وَ الْاِنْسِ لَهُمْ قُلُوْبٌ لَّا يَفْقَهُوْنَ بِهَا ووَ لَهُمْ اَعْيُنٌ لَّا يُبْصِرُوْنَ بِهَا وَ لَهُمْ اٰذَانٌ لَّا يَسْمَعُوْنَ بِهَا اُولٰٓىِٕكَ كَالْاَنْعَامِ بَلْ هُمْ اَضَلُّ اُولٰٓىِٕكَ هُمُ الْغٰفِلُوْنَ » [ الأعراف : ۱۷۹ ] ’’اور بلاشبہ یقینا ہم نے بہت سے جن اور انسان جہنم ہی کے لیے پیدا کیے ہیں، ان کے دل ہیں جن کے ساتھ وہ سمجھتے نہیں اور ان کی آنکھیں ہیں جن کے ساتھ وہ دیکھتے نہیں اور ان کے کان ہیں جن کے ساتھ وہ سنتے نہیں، یہ لوگ چوپاؤں جیسے ہیں، بلکہ یہ زیادہ بھٹکے ہوئے ہیں، یہی ہیں جو بالکل بے خبر ہیں۔‘‘ اور اسی سورت کی اگلی آیت : « وَ قَالُوْا قُلُوْبُنَا فِيْۤ اَكِنَّةٍ مِّمَّا تَدْعُوْنَاۤ اِلَيْهِ وَ فِيْۤ اٰذَانِنَا وَقْرٌ وَّ مِنْۢ بَيْنِنَا وَ بَيْنِكَ حِجَابٌ فَاعْمَلْ اِنَّنَا عٰمِلُوْنَ» [ حٰمٓ السجدۃ : ۵ ] ’’ اور انھوں نے کہا ہمارے دل اس بات سے پردوں میں ہیں جس کی طرف تو ہمیں بلاتا ہے اور ہمارے کانوں میں ایک بوجھ ہے اور ہمارے درمیان اور تیرے درمیان ایک حجاب ہے، پس تو عمل کر، بے شک ہم بھی عمل کرنے والے ہیں۔‘‘ ¤ ➌ قرآن مجید نے لوگوں کی اکثریت کے متعلق فرمایا : « اَكْثَرُهُمْ لَا يُؤْمِنُوْنَ » [ البقرۃ : ۱۰۰ ] ’’ ان کے اکثر ایمان نہیں رکھتے۔‘‘ اور فرمایا : «اَكْثَرَهُمْ لَا يَعْلَمُوْنَ» [ الأنعام : ۳۷ ] ’’ ان کے اکثر نہیں جانتے۔‘‘ اور فرمایا : « اَكْثَرَهُمْ يَجْهَلُوْنَ » [الأنعام : ۱۱۱ ] ’’ان کے اکثر جہالت برتتے ہیں۔‘‘ اور فرمایا : « وَ لَا تَجِدُ اَكْثَرَهُمْ شٰكِرِيْنَ» [الأعراف : ۱۷ ] ’’اور تو ان کے اکثر کو شکر کرنے والے نہیں پائے گا۔‘‘ اور فرمایا : « وَ اِنْ وَّجَدْنَاۤ اَكْثَرَهُمْ لَفٰسِقِيْنَ» [ الأعراف : ۱۰۲ ] ’’اور بے شک ہم نے ان کے اکثر کو فاسق ہی پایا۔‘‘ اور فرمایا: «وَ مَا يَتَّبِعُ اَكْثَرُهُمْ اِلَّا ظَنًّا » [ یونس : ۳۶ ] ’’اور ان کے اکثر پیروی نہیں کرتے مگر ایک گمان کی۔‘‘ اور فرمایا : « وَ لٰكِنَّ اَكْثَرَهُمْ لَا يَشْكُرُوْنَ» [ یونس : ۶۰ ] ’’اور لیکن ان میں سے اکثر شکر نہیں کرتے۔‘‘ اور فرمایا : « وَ مَا يُؤْمِنُ اَكْثَرُهُمْ بِاللّٰهِ اِلَّا وَ هُمْ مُّشْرِكُوْنَ» [ یوسفف : ۱۰۶ ] ’’اور ان میں سے اکثر اللہ پر ایمان نہیں رکھتے، مگر اس حال میں کہ وہ شریک بنانے والے ہوتے ہیں۔‘‘ اور فرمایا : « اِنَّ فِيْ ذٰلِكَ لَاٰيَةً وَ مَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِيْنَ» [ الشعراء : ۸ ] ’’بے شک اس میں یقینا عظیم نشانی ہے اور ان کے اکثر ایمان لانے والے نہیں تھے۔‘‘ جب کہ ایمان والوں اور شکر گزار بندوں کے متعلق فرمایا کہ وہ بہت تھوڑے ہیں، جیسا کہ فرمایا : « اِلَّا الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ وَ قَلِيْلٌ مَّا هُمْ » [ صٓ : ۲۴ ] ’’مگر وہ لوگ جو ایمان لائے اور انھوں نے نیک اعمال کیے اور یہ لوگ بہت ہی کم ہیں۔‘‘ اور فرمایا : « وَ قَلِيْلٌ مِّنْ عِبَادِيَ الشَّكُوْرُ» [ سبا : ۱۳ ] ’’اور بہت تھوڑے میرے بندوں میں سے پورے شکر گزار ہیں۔‘‘ ان آیات سے کفار کے رائج کر دہ نظامِ جمہوریت کی حقیقت واضح ہو جاتی ہے، جس کی بنیاد ہی عوام کی اکثریت پر ہے، وہ مسلم ہوں یا کافر، متقی ہوں یا فاسق۔ پھر اس اکثریت کو دستور اور قانون سازی کا بھی اختیار ہے، خواہ وہ اللہ کے دین کے مطابق ہو یا اس سے متصادم۔ اس لیے دنیا بھر کے کفار تمام مسلمان ملکوں میں جمہوریت رائج کرنے کے لیے اپنی پوری کوشش استعمال کرتے ہیں، کیونکہ اسی کے ذریعے سے وہ ان ملکوںمیں اللہ اور اس کے رسول کے احکام کو نافذ ہونے سے روک سکتے ہیں اور اپنا دخل جاری رکھ سکتے ہیں۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {وَ قَالُوْا قُلُوْبُنَا فِيْۤ اَكِنَّةٍ …:’’ اَكِنَّةٍ ‘‘ ’’ كِنَانٌ ‘‘} کی جمع ہے، پردہ، جیسا کہ {’’ غِطَاءٌ‘‘} کی جمع {’’ أَغْطِيَةٌ ‘‘} ہے۔ ترکش، یعنی تیروں کا تھیلا جس میں تیر چھپے ہوتے ہیں{ ’’ كِنَانَةٌ ‘‘ } کہلاتا ہے۔ {’’ وَقْرٌ ‘‘} کا اصل معنی ’’بوجھ‘‘ ہے، مراد بہرا پن ہے۔ ¤ ➋ فرمایا، کفار کا آیاتِ الٰہی سے اعراض اس حد کو پہنچ چکا ہے کہ صرف یہ نہیں کہ وہ سنتے نہیں یا منہ موڑ کر چلے جاتے ہیں، بلکہ ان کی نفرت اس حد تک پہنچ چکی ہے کہ انھوں نے واشگاف الفاظ میں اس کا اظہار کیا اور اس کی تین وجہیں بیان کیں۔ پہلی یہ کہ تم ہمیں جس بات کی طرف دعوت دیتے ہو ہمارے دل اس سے بھاری پردوں میں محفوظ ہیں۔ ({اَكِنَّةٍ} کی تنوین تعظیم کے لیے ہے) وہ دعوت ہمارے دلوں تک پہنچتی ہی نہیں۔ دوسری یہ کہ ہمارے کانوں میں بھاری بوجھ ہے۔ ({وَقْرٌ} کی تنوین تعظیم کے لیے ہے) وہ تمھاری بات سننے سے شدید بہرے ہیں اور تیسری یہ کہ ہمارے اور تمھارے درمیان بھاری پردہ ہے۔ غرض، ہماری آنکھیں یا کان یا دل تمھاری کوئی بھی بات سننے یا سمجھنے کے لیے تیار نہیں۔ کفار نے یہ بات اپنی خوبی کے طور پر بیان کی۔ سورۂ بقرہ میں ہے : «وَ قَالُوْا قُلُوْبُنَا غُلْفٌ بَلْ لَّعَنَهُمُ اللّٰهُ بِكُفْرِهِمْ فَقَلِيْلًا مَّا يُوؤْمِنُوْنَ » [ البقرۃ : ۸۸ ] ’’اور انھوں نے کہا ہمارے دل غلاف میں (محفوظ) ہیں، بلکہ اللہ نے ان کے کفر کی وجہ سے ان پر لعنت کر دی، پس وہ بہت کم ایمان لاتے ہیں۔‘‘ ¤ ➌ { وَ مِنْۢ بَيْنِنَا وَ بَيْنِكَ حِجَابٌ:} بقاعی نے اس {’’ مِنْ‘‘} سے تبعیض کا مفہوم اخذ کیا ہے کہ ہمارے اور تمھارے درمیان کے بعض معاملات میں ایک پردہ ہے، یعنی ایک دوسرے کے دنیوی معاملات تو ہم دیکھتے، سنتے اور سمجھتے ہیں، مگر دین کے معاملات میں ہمارے اور تمھارے درمیان بھاری پردہ ہے، لہٰذا تم اپنے دین پر عمل کرو اور ہم اپنے دین پر عمل کرنے والے ہیں۔ ¤ ➍ دوسری جگہ فرمایا کہ ان کے دلوں، آنکھوں اور کانوں پر یہ پردے ہم نے ڈالے ہیں اور اس کی وجہ خود ان کا اعراض اور گریز ہے، جیسا کہ فرمایا : « وَ مَنْ اَظْلَمُ مِمَّنْ ذُكِّرَ بِاٰيٰتِ رَبِّهٖ فَاَعْرَضَ عَنْهَا وَ نَسِيَ مَا قَدَّمَتْ يَدٰهُ اِنَّا جَعَلْنَا عَلٰى قُلُوْبِهِمْ اَكِنَّةً اَنْ يَّفْقَهُوْهُ وَ فِيْۤ اٰذَانِهِمْ وَقْرًا وَ اِنْ تَدْعُهُمْ اِلَى الْهُدٰى فَلَنْ يَّهْتَدُوْۤا اِذًا اَبَدًا » [ اللکہف : ۵۷ ] ’’اور اس سے بڑھ کر ظالم کون ہے جسے اس کے رب کی آیات کے ساتھ نصیحت کی گئی تو اس نے ان سے منہ پھیر لیا اور اسے بھول گیا جو اس کے دونوں ہاتھوں نے آگے بھیجا تھا، بے شک ہم نے ان کے دلوں پر پردے بنا دیے ہیں، اس سے کہ اسے سمجھیں اور ان کے کانوں میں بوجھ رکھ دیا ہے اور اگر تو انھیں سیدھی راہ کی طرف بلائے تو اس وقت وہ ہرگز کبھی راہ پر نہ آئیں گے۔‘‘ اور ضد اور عناد کی وجہ سے مخالفت پر ڈٹ جانے والوں کے متعلق اللہ تعالیٰ کی سنت یہی ہے، فرمایا : « وَ مَنْ يُّشَاقِقِ الرَّسُوْلَ مِنْۢ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدٰى وَ يَتَّبِعْ غَيْرَ سَبِيْلِ الْمُؤْمِنِيْنَ نُوَلِّهٖ مَا تَوَلّٰى وَ نُصْلِهٖ جَهَنَّمَ وَ سَآءَتْ مَصِيْرًا» [ النساء : ۱۱۵ ] ’’اور جو کوئی رسول کی مخالفت کرے، اس کے بعد کہ اس کے لیے ہدایت خوب واضح ہو چکی اور مومنوں کے راستے کے سوا (کسی اور) کی پیروی کرے ہم اسے اسی طرف پھیر دیں گے جس طرف وہ پھرے گا اور ہم اسے جہنم میں جھونکیں گے اور وہ بری لوٹنے کی جگہ ہے۔‘‘ اور فرمایا : « فَلَمَّا زَاغُوْۤا اَزَاغَ اللّٰهُ قُلُوْبَهُمْ» [ الصف : ۵ ] ’’پھر جب وہ ٹیڑھے ہو گئے تو اللہ نے ان کے دل ٹیڑھے کر دیے۔‘‘ ¤ ➎ {فَاعْمَلْ اِنَّنَا عٰمِلُوْنَ:} بار بار دعوت اور نصیحت سے امید ہوتی ہے کہ شاید کسی وقت ہی اثر کر جائے، اس لیے کفار نے رسول اللہ صلی اللہ علیہ وسلم کو پوری طرح مایوس کرنے کے لیے یہ جملہ کہا، جیسا کہ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو حکم دیا کہ کفار کو {’’ لَكُمْ دِيْنُكُمْ وَ لِيَ دِيْنِ ‘‘} (تمھارے لیے تمھارا دین اور میرے لیے میررا دین ہے) کہہ کر اس بات سے پوری طرح مایوس کر دیں کہ آپ ان کے معبودوں کی کبھی کسی صورت میں بھی عبادت کر سکتے ہیں۔ (دیکھیے کافرون : ۶)"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 7،6) ➊ { قُلْ اِنَّمَاۤ اَنَا بَشَرٌ مِّثْلُكُمْ:} یعنی مجھ سے تمھاری اس قدر دوری کی کوئی وجہ نہیں، کیونکہ نہ تو میں فرشتہ یا جن یا نظر نہ آنے والی کوئی اور مخلوق ہوں کہ میرے اور تمھارے درمیان کوئی پردہ ہو، جس کی وجہ سے تم مجھے دیکھ نہ سکو یا میری بات سن نہ سکو، بلکہ میں ایک بشر ہی ہوں جو تم میں پیدا ہوا، پلا بڑھا اور نبوت سے سرفراز ہوا۔ نہ یہ بات ہے کہ میری زبان تم سے مختلف ہے، بلکہ تمھاری طرح عرب ہوں، کھانے پینے، سونے جاگنے، تندرستی، بیماری، شادی، غمی اور آل اولاد، غرض تمام انسانی صفات میں تمھارے جیسا ہوں، پھر مجھ سے یہ اجتناب اور ایسی دوری کیوں؟ ¤ ➋ { يُوْحٰۤى اِلَيَّ اَنَّمَاۤ اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ:} دوری کی ایک وجہ یہ ہو سکتی ہے کہ میں اپنی کوئی ذاتی بات تمھارے سامنے پیش کرکے اسے منوانا چاہتا ہوں۔ ایسا بھی نہیں، بلکہ میں تو تمھارے پاس وحی الٰہی کی بات لے کر آیا ہوں اور یہی میرا امتیاز ہے، اور یہ بھی نہیں کہ وہ وحی الٰہی کوئی پیچیدہ یا عقل میں نہ آنے والی بات ہو، یا اس کے تم سے بے شمار مطالبات ہوں جنھیں پورا کرنے سے تم قاصر ہو، بلکہ وہ صاف، سچی اور عقل کے عین مطابق ہے اور وہ ہے صرف ایک مختصر سی بات کہ تمھاری عبادت کا حق دار صرف ایک معبود ہے۔ ایسی واضح اور مختصر بات نہ سننے یا نہ سمجھنے کا اور اس کے کہنے والے کو نہ دیکھنے کا تمھارے پاس کوئی عذر نہیں، تمھیں روکنے والی چیز صرف تمھارا کفر پر اصرار ہے۔ سو اسے چھوڑو، تاکہ تم بھی وہ حقیقت سمجھ سکو جو تمھارے جیسا ایک بشر ہو کر میں سمجھتا ہوں اور تمھیں سمجھا رہا ہوں، لہٰذا اپنا رخ اپنے واحد معبود کی طرف بالکل سیدھا کر لو۔ ¤ ➌ {فَاسْتَقِيْمُوْۤا اِلَيْهِ:} استقامت کی تفسیر کے لیے دیکھیے سورۂ ہود (۱۱۲)۔ یعنی جب تمھاری عبادت کا حق دار صرف ایک معبود ہے تو تمام معبودان باطلہ سے منہ پھیر کر اپنا رخ پوری طرح اس کی طرف سیدھا کر لو اور صرف اسی کی عبادت کرو، جیسا کہ خلیل اللہ علیہ السلام نے کہا تھا : « اِنِّيْ وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمٰوٰتِ وَ الْاَرْضَ حَنِيْفًا وَّ ممَاۤ اَنَا مِنَ الْمُشْرِكِيْنَ» [ الأنعام : ۷۹ ] ’’بے شک میں نے اپنا چہرہ اس کی طرف متوجہ کر لیا ہے جس نے آسمانوں اور زمین کو پیدا کیا ہے، ایک (اللہ کی) طرف ہو کر اور میں مشرکوں سے نہیں۔‘‘ ¤ ➍ {وَ اسْتَغْفِرُوْهُ:} یعنی اس سے پہلے اس کی جو ناشکری اور اس کے ساتھ شرک کرتے رہے ہو اس کی اس سے معافی مانگو اور اس کا حق ادا کرنے میں جو کوتاہی پہلے ہوئی یا آئندہ ہو گی سب کی بخشش کی دعا کرتے رہو۔ ¤ ➎ آیت کی جو تفسیر اوپر بیان کی گئی ہے یہ بقاعی اور کچھ اور مفسرین کے مطابق ہے۔ ایک اور تفسیر یہ ہے : ’’میں تو تمھارے جیسا ایک انسان ہوں، تمھارے کانوں اور آنکھوں کو کھولنا اور دلوں کے پردے دور کرنا نہ میرے اختیار میں ہے اور نہ ہی میں اس کا مکلف ہوں، میری ذمہ داری وہ وحی الٰہی تم تک پہنچا دینا ہے جو اللہ تعالیٰ کی جانب سے میری طرف کی جاتی ہے اور وہ یہ ہے کہ تمھارا سچا معبود بس ایک ہے۔ سو اس کی طرف پوری طرح سیدھے ہو جاؤ اور اپنی گزشتہ اور موجودہ نافرمانیوں اور لغزشوں کی اس سے معافی مانگو۔‘‘ (ابن عاشور) یہ تفسیر بھی بہت عمدہ ہے۔ ¤ ➏ { وَ وَيْلٌ لِّلْمُشْرِكِيْنَ (6) الَّذِيْنَ لَا يُؤْتُوْنَ الزَّكٰوةَ:} یعنی جو لوگ اللہ واحد اور اس کے رسول پر ایمان نہیں لاتے ان کے لیے بہت بڑی ہلاکت ہے۔ اگرچہ ان کی ہلاکت کے بے شمار اسباب ہیں، مگر یہاں ان میں سے تین بنیادی اسباب ذکر فرمائے، کیوں کہ سعادت کے بنییادی اسباب بھی تین ہیں، یعنی اللہ کا حق ادا کرنا، مخلوق کا حق ادا کرنا اور آخرت کا یقین رکھ کر اپنے اعمال کی جواب دہی کے لیے تیاری رکھنا۔ جس طرح سب سے اونچے اعمال یہ ہیں اسی طرح سب سے بڑی خست اور کمینگی بھی ان کا ادا نہ کرنا ہے۔ فرمایا، ان لوگوں کے لیے بہت بڑی ہلاکت ہے جو مشرک ہیں، اپنے مالک کے غدار ہیں، اللہ کی طرف سے مخلوق کے لیے عائد ہونے والا کم از کم فریضہ بھی ادا نہیں کرتے اور آخرت کے سرے ہی سے منکر ہیں، جس میں حساب ہو گا اور جس کے بعد زندگی دائمی اور ابدی ہے۔ ¤ ➐ یہاں ایک سوال ہے کہ یہ سورت مکی ہے، جب کہ زکوٰۃ مدینہ میں فرض ہوئی۔ اس کے جواب میں بعض مفسرین نے فرمایا کہ زکوٰۃ کا لفظی معنی پاکیزگی ہے، اس لیے یہاں توحید کے اقرار کے ساتھ نفس کی پاکیزگی مراد ہے کہ مشرک کلمۂ توحید کے ساتھ اپنے آپ کو پاک نہیں کرتے۔ مگر اس میں یہ اشکال ہے کہ اگر آیت کے الفاظ {’’لَا يَأْتُوْنَ الزَّكَاةَ‘‘} ہوتے تو اس معنی کی گنجائش تھی، {’’ لَا يُؤْتُوْنَ ‘‘} میں اس کی گنجائش مشکل ہے، کیونکہ اس کا معنی ہے ’’وہ زکوٰۃ نہیں دیتے۔‘‘ اس لیے طبری اور اکثر مفسرین رحمھم اللہ نے اسی معنی کو ترجیح دی ہے کہ وہ زکوٰۃ نہیں دیتے۔ رہا یہ سوال کہ مکہ میں تو زکوٰۃ فرض ہی نہیں ہوئی تھی، تو جواب اس کا یہ ہے کہ اگرچہ زکوٰۃ کا نصاب اور دورانیہ مدینہ میں مقرر ہوا مگر اصل زکوٰۃ اور اللہ کی راہ میں خرچ کرنا ابتدائے اسلام ہی میں فرض تھا۔ ہرقل نے جب ابوسفیان سے پوچھا کہ وہ نبی تمھیں کیا حکم دیتا ہے تو انھوں نے کہا تھا : [ يَأْمُرُنَا بِالصَّلَاةِ وَالزَّكَاةِ وَالصِّلَةِ وَالْعَفَافِ ] [ بخاري، الزکوٰۃ، باب وجوب الزکوٰۃ، قبل ح : ۱۳۹۵ٰ، تعلیقاً ] ’’وہ نبی ہمیں نماز، زکوٰۃ، صلہ رحمی اور پاک دامنی کا حکم دیتا ہے۔‘‘ اور ظاہر ہے کہ ابوسفیان نے وہی احکام ذکر کیے جو مکہ میں اس نے سنے۔ علاوہ ازیں مکی سورتوں میں جا بجا صدقے، زکوٰۃ اور کھیتی میں سے حق ادا کرنے کا ذکر ہے، جیسا کہ فرمایا : « وَ اٰتُوْا حَقَّهٗ يَوْمَ حَصَادِهٖ» [ الأنعام : ۱۴۱ ] ’’اور اس کا حق اس کی کٹائی کے دن ادا کرو۔‘‘ اور فرمایا : « وَ سَيُجَنَّبُهَا الْاَتْقَى (17) الَّذِيْ يُؤْتِيْ مَالَهٗ يَتَزَكّٰى » [ اللیل : ۱۷، ۱۸ ] ’’اور عنقریب اس سے وہ بڑا پرہیز گار دور رکھا جائے گا۔ جو اپنا مال (اس لیے) دیتا ہے کہ پاک ہو جائے۔‘‘ اور فرمایا : « وَ الَّذِيْنَ فِيْۤ اَمْوَالِهِمْ حَقٌّ مَّعْلُوْمٌ۪ (24) لِّلسَّآىِٕلِ وَ الْمَحْرُوْمِ » [ المعارج : ۲۴،۲۵] ’’اور وہ جن کے مالوں میں ایک مقرر حصہ ہے۔ سوال کرنے والے کے لیے اور (اس کے لیے) جسے نہیں دیا جاتا۔‘‘ اور فرمایا : « وَ الَّذِيْنَ يُؤْتُوْنَ مَاۤ اٰتَوْا وَّ قُلُوْبُهُمْ وَجِلَةٌ اَنَّهُمْ اِلٰى رَبِّهِمْ رٰجِعُووْنَ» [ المؤمنون : ۶۰ ] ’’اور وہ کہ انھوں نے جو کچھ دیا اس حال میں دیتے ہیں کہ ان کے دل ڈرنے والے ہوتے ہیں کہ یقینا وہ اپنے رب ہی کی طرف لوٹنے والے ہیں۔‘‘ اور یہ تمام آیات مکی سورتوں کی ہیں۔ سورۂ مزمل ابتدا میں اترنے والی مکی سورت ہے، اس کی آخری آیت میں اس کا صراحتاً ذکر ہے۔ ¤ معلوم ہوا کہ کفار توحید و رسالت پر ایمان کے علاوہ زکوٰۃ اور دوسرے احکام پر عمل کے بھی مکلف ہیں اور ان کی عدم ادائیگی پر بھی ان کو عذاب ہو گا۔ رہی یہ بات کہ ان کی نماز اور زکوٰۃ تو ایمان لانے کے بعد ہی معتبر ہو گی، پہلے اس کا فائدہ ہی نہیں، تو اس سے یہ ثابت نہیں ہوتا کہ انھیں نماز یا زکوٰۃ کا حکم نہیں، جیسا کہ نماز اسی وقت درست ہو گی جب وضو ہو گا، مگر اس کا یہ مطلب نہیں کہ جب تک وضو نہ ہو نماز کا حکم ہی نہیں۔ مزید تفصیل کے لیے دیکھیے سورۂ مدثر (۳۹ تا ۴۸) کی تفسیر۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7،6) ➊ { قُلْ اِنَّمَاۤ اَنَا بَشَرٌ مِّثْلُكُمْ:} یعنی مجھ سے تمھاری اس قدر دوری کی کوئی وجہ نہیں، کیونکہ نہ تو میں فرشتہ یا جن یا نظر نہ آنے والی کوئی اور مخلوق ہوں کہ میرے اور تمھارے درمیان کوئی پردہ ہو، جس کی وجہ سے تم مجھے دیکھ نہ سکو یا میری بات سن نہ سکو، بلکہ میں ایک بشر ہی ہوں جو تم میں پیدا ہوا، پلا بڑھا اور نبوت سے سرفراز ہوا۔ نہ یہ بات ہے کہ میری زبان تم سے مختلف ہے، بلکہ تمھاری طرح عرب ہوں، کھانے پینے، سونے جاگنے، تندرستی، بیماری، شادی، غمی اور آل اولاد، غرض تمام انسانی صفات میں تمھارے جیسا ہوں، پھر مجھ سے یہ اجتناب اور ایسی دوری کیوں؟ ¤ ➋ { يُوْحٰۤى اِلَيَّ اَنَّمَاۤ اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ:} دوری کی ایک وجہ یہ ہو سکتی ہے کہ میں اپنی کوئی ذاتی بات تمھارے سامنے پیش کرکے اسے منوانا چاہتا ہوں۔ ایسا بھی نہیں، بلکہ میں تو تمھارے پاس وحی الٰہی کی بات لے کر آیا ہوں اور یہی میرا امتیاز ہے، اور یہ بھی نہیں کہ وہ وحی الٰہی کوئی پیچیدہ یا عقل میں نہ آنے والی بات ہو، یا اس کے تم سے بے شمار مطالبات ہوں جنھیں پورا کرنے سے تم قاصر ہو، بلکہ وہ صاف، سچی اور عقل کے عین مطابق ہے اور وہ ہے صرف ایک مختصر سی بات کہ تمھاری عبادت کا حق دار صرف ایک معبود ہے۔ ایسی واضح اور مختصر بات نہ سننے یا نہ سمجھنے کا اور اس کے کہنے والے کو نہ دیکھنے کا تمھارے پاس کوئی عذر نہیں، تمھیں روکنے والی چیز صرف تمھارا کفر پر اصرار ہے۔ سو اسے چھوڑو، تاکہ تم بھی وہ حقیقت سمجھ سکو جو تمھارے جیسا ایک بشر ہو کر میں سمجھتا ہوں اور تمھیں سمجھا رہا ہوں، لہٰذا اپنا رخ اپنے واحد معبود کی طرف بالکل سیدھا کر لو۔ ¤ ➌ {فَاسْتَقِيْمُوْۤا اِلَيْهِ:} استقامت کی تفسیر کے لیے دیکھیے سورۂ ہود (۱۱۲)۔ یعنی جب تمھاری عبادت کا حق دار صرف ایک معبود ہے تو تمام معبودان باطلہ سے منہ پھیر کر اپنا رخ پوری طرح اس کی طرف سیدھا کر لو اور صرف اسی کی عبادت کرو، جیسا کہ خلیل اللہ علیہ السلام نے کہا تھا : « اِنِّيْ وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمٰوٰتِ وَ الْاَرْضَ حَنِيْفًا وَّ ممَاۤ اَنَا مِنَ الْمُشْرِكِيْنَ» [ الأنعام : ۷۹ ] ’’بے شک میں نے اپنا چہرہ اس کی طرف متوجہ کر لیا ہے جس نے آسمانوں اور زمین کو پیدا کیا ہے، ایک (اللہ کی) طرف ہو کر اور میں مشرکوں سے نہیں۔‘‘ ¤ ➍ {وَ اسْتَغْفِرُوْهُ:} یعنی اس سے پہلے اس کی جو ناشکری اور اس کے ساتھ شرک کرتے رہے ہو اس کی اس سے معافی مانگو اور اس کا حق ادا کرنے میں جو کوتاہی پہلے ہوئی یا آئندہ ہو گی سب کی بخشش کی دعا کرتے رہو۔ ¤ ➎ آیت کی جو تفسیر اوپر بیان کی گئی ہے یہ بقاعی اور کچھ اور مفسرین کے مطابق ہے۔ ایک اور تفسیر یہ ہے : ’’میں تو تمھارے جیسا ایک انسان ہوں، تمھارے کانوں اور آنکھوں کو کھولنا اور دلوں کے پردے دور کرنا نہ میرے اختیار میں ہے اور نہ ہی میں اس کا مکلف ہوں، میری ذمہ داری وہ وحی الٰہی تم تک پہنچا دینا ہے جو اللہ تعالیٰ کی جانب سے میری طرف کی جاتی ہے اور وہ یہ ہے کہ تمھارا سچا معبود بس ایک ہے۔ سو اس کی طرف پوری طرح سیدھے ہو جاؤ اور اپنی گزشتہ اور موجودہ نافرمانیوں اور لغزشوں کی اس سے معافی مانگو۔‘‘ (ابن عاشور) یہ تفسیر بھی بہت عمدہ ہے۔ ¤ ➏ { وَ وَيْلٌ لِّلْمُشْرِكِيْنَ (6) الَّذِيْنَ لَا يُؤْتُوْنَ الزَّكٰوةَ:} یعنی جو لوگ اللہ واحد اور اس کے رسول پر ایمان نہیں لاتے ان کے لیے بہت بڑی ہلاکت ہے۔ اگرچہ ان کی ہلاکت کے بے شمار اسباب ہیں، مگر یہاں ان میں سے تین بنیادی اسباب ذکر فرمائے، کیوں کہ سعادت کے بنییادی اسباب بھی تین ہیں، یعنی اللہ کا حق ادا کرنا، مخلوق کا حق ادا کرنا اور آخرت کا یقین رکھ کر اپنے اعمال کی جواب دہی کے لیے تیاری رکھنا۔ جس طرح سب سے اونچے اعمال یہ ہیں اسی طرح سب سے بڑی خست اور کمینگی بھی ان کا ادا نہ کرنا ہے۔ فرمایا، ان لوگوں کے لیے بہت بڑی ہلاکت ہے جو مشرک ہیں، اپنے مالک کے غدار ہیں، اللہ کی طرف سے مخلوق کے لیے عائد ہونے والا کم از کم فریضہ بھی ادا نہیں کرتے اور آخرت کے سرے ہی سے منکر ہیں، جس میں حساب ہو گا اور جس کے بعد زندگی دائمی اور ابدی ہے۔ ¤ ➐ یہاں ایک سوال ہے کہ یہ سورت مکی ہے، جب کہ زکوٰۃ مدینہ میں فرض ہوئی۔ اس کے جواب میں بعض مفسرین نے فرمایا کہ زکوٰۃ کا لفظی معنی پاکیزگی ہے، اس لیے یہاں توحید کے اقرار کے ساتھ نفس کی پاکیزگی مراد ہے کہ مشرک کلمۂ توحید کے ساتھ اپنے آپ کو پاک نہیں کرتے۔ مگر اس میں یہ اشکال ہے کہ اگر آیت کے الفاظ {’’لَا يَأْتُوْنَ الزَّكَاةَ‘‘} ہوتے تو اس معنی کی گنجائش تھی، {’’ لَا يُؤْتُوْنَ ‘‘} میں اس کی گنجائش مشکل ہے، کیونکہ اس کا معنی ہے ’’وہ زکوٰۃ نہیں دیتے۔‘‘ اس لیے طبری اور اکثر مفسرین رحمھم اللہ نے اسی معنی کو ترجیح دی ہے کہ وہ زکوٰۃ نہیں دیتے۔ رہا یہ سوال کہ مکہ میں تو زکوٰۃ فرض ہی نہیں ہوئی تھی، تو جواب اس کا یہ ہے کہ اگرچہ زکوٰۃ کا نصاب اور دورانیہ مدینہ میں مقرر ہوا مگر اصل زکوٰۃ اور اللہ کی راہ میں خرچ کرنا ابتدائے اسلام ہی میں فرض تھا۔ ہرقل نے جب ابوسفیان سے پوچھا کہ وہ نبی تمھیں کیا حکم دیتا ہے تو انھوں نے کہا تھا : [ يَأْمُرُنَا بِالصَّلَاةِ وَالزَّكَاةِ وَالصِّلَةِ وَالْعَفَافِ ] [ بخاري، الزکوٰۃ، باب وجوب الزکوٰۃ، قبل ح : ۱۳۹۵ٰ، تعلیقاً ] ’’وہ نبی ہمیں نماز، زکوٰۃ، صلہ رحمی اور پاک دامنی کا حکم دیتا ہے۔‘‘ اور ظاہر ہے کہ ابوسفیان نے وہی احکام ذکر کیے جو مکہ میں اس نے سنے۔ علاوہ ازیں مکی سورتوں میں جا بجا صدقے، زکوٰۃ اور کھیتی میں سے حق ادا کرنے کا ذکر ہے، جیسا کہ فرمایا : « وَ اٰتُوْا حَقَّهٗ يَوْمَ حَصَادِهٖ» [ الأنعام : ۱۴۱ ] ’’اور اس کا حق اس کی کٹائی کے دن ادا کرو۔‘‘ اور فرمایا : « وَ سَيُجَنَّبُهَا الْاَتْقَى (17) الَّذِيْ يُؤْتِيْ مَالَهٗ يَتَزَكّٰى » [ اللیل : ۱۷، ۱۸ ] ’’اور عنقریب اس سے وہ بڑا پرہیز گار دور رکھا جائے گا۔ جو اپنا مال (اس لیے) دیتا ہے کہ پاک ہو جائے۔‘‘ اور فرمایا : « وَ الَّذِيْنَ فِيْۤ اَمْوَالِهِمْ حَقٌّ مَّعْلُوْمٌ۪ (24) لِّلسَّآىِٕلِ وَ الْمَحْرُوْمِ » [ المعارج : ۲۴،۲۵] ’’اور وہ جن کے مالوں میں ایک مقرر حصہ ہے۔ سوال کرنے والے کے لیے اور (اس کے لیے) جسے نہیں دیا جاتا۔‘‘ اور فرمایا : « وَ الَّذِيْنَ يُؤْتُوْنَ مَاۤ اٰتَوْا وَّ قُلُوْبُهُمْ وَجِلَةٌ اَنَّهُمْ اِلٰى رَبِّهِمْ رٰجِعُووْنَ» [ المؤمنون : ۶۰ ] ’’اور وہ کہ انھوں نے جو کچھ دیا اس حال میں دیتے ہیں کہ ان کے دل ڈرنے والے ہوتے ہیں کہ یقینا وہ اپنے رب ہی کی طرف لوٹنے والے ہیں۔‘‘ اور یہ تمام آیات مکی سورتوں کی ہیں۔ سورۂ مزمل ابتدا میں اترنے والی مکی سورت ہے، اس کی آخری آیت میں اس کا صراحتاً ذکر ہے۔ ¤ معلوم ہوا کہ کفار توحید و رسالت پر ایمان کے علاوہ زکوٰۃ اور دوسرے احکام پر عمل کے بھی مکلف ہیں اور ان کی عدم ادائیگی پر بھی ان کو عذاب ہو گا۔ رہی یہ بات کہ ان کی نماز اور زکوٰۃ تو ایمان لانے کے بعد ہی معتبر ہو گی، پہلے اس کا فائدہ ہی نہیں، تو اس سے یہ ثابت نہیں ہوتا کہ انھیں نماز یا زکوٰۃ کا حکم نہیں، جیسا کہ نماز اسی وقت درست ہو گی جب وضو ہو گا، مگر اس کا یہ مطلب نہیں کہ جب تک وضو نہ ہو نماز کا حکم ہی نہیں۔ مزید تفصیل کے لیے دیکھیے سورۂ مدثر (۳۹ تا ۴۸) کی تفسیر۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { اِنَّ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ …:’’ مَمْنُوْنٍ ‘‘ ’’مَنَّ يَمُنُّ مَنًّا ‘‘} (ن) {’’ الْحَبْلَ‘‘} رسی کو کاٹ دینا۔ کفار کے ساتھ ہی ایمان اور عمل صالح والوں کا انجام ذکر فرمایا کہ ان کے لیے ایسا اجر ہے جو کبھی قطع نہیں کیا جائے گا۔ مراد جنت اور اس کی نعمتیں ہیں جو کبھی ختم یا کم ہونے والی نہیں، بلکہ دائمی اور ہر دن زیادہ ہونے والی ہیں، جیسا کہ فرمایا : « لَا مَقْطُوْعَةٍ وَّ لَا مَمْنُوْعَةٍ » [ الواقعۃ : ۳۳ ] ’’(جنت کے پھل) نہ کبھی ختم ہوں گے اور نہ ان سے کوئی روک ٹوک ہو گی۔‘‘ اور فرمایا : « عَطَآءً غَيْرَ مَجْذُوْذٍ» [ ھود: ۱۰۸ ] ’’ایسا عطیہ جو قطع کیا جانے والا نہیں۔‘‘ اور فرمایا : « اِنَّ هٰذَا لَرِزْقُنَا مَا لَهٗ مِنْ نَّفَادٍ » [ صٓ : ۵۴ ] ’’بلاشبہ یقینا یہ ہمارا رزق ہے، جس کے لیے کسی صورت ختم ہونا نہیں ہے۔‘‘ ¤ بعض مفسرین نے اس لفظ کو {’’مَنَّ يَمُنُّ مَنًّا‘‘} (احسان جتانا) سے قرار دے کر مطلب یہ کیا ہے کہ جنت کی نعمتوں کا ان پر احسان نہیں جتایا جائے گا۔ مگر ابن کثیر رحمہ اللہ نے فرمایا کہ یہ معنی درست نہیں، کیونکہ اللہ تعالیٰ تو احسان جتلاتا ہے اور جتلائے گا اور یہ اس کا حق ہے، کیونکہ ایمان کی ہدایت اور توفیق اس نے عطا فرمائی، فرمایا : « بَلِ اللّٰهُ يَمُنُّ عَلَيْكُمْ اَنْ هَدٰىكُمْ لِلْاِيْمَانِ اِنْ كُنْتُمْ صٰدِقِيْنَ » [ الحجرات : ۱۷ ] ’’کہہ دے مجھ پر اپنے اسلام کا احسان نہ رکھو، بلکہ اللہ تم پر احسان رکھتا ہے کہ اس نے تمھیں ایمان کے لیے ہدایت دی، اگر تم سچے ہو۔‘‘ اور جنتی کہیں گے : « فَمَنَّ اللّٰهُ عَلَيْنَا وَ وَقٰىنَا عَذَابَ السَّمُوْمِ » [الطور : ۲۷ ] ’’پھر اللہ نے ہم پر احسان کیا اور ہمیں زہریلی لو کے عذاب سے بچا لیا۔‘‘"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ { قُلْ اَىِٕنَّكُمْ لَتَكْفُرُوْنَ … :} مشرکین کا آخرت کا انکار ذکر کرنے کے بعد اللہ تعالیٰ کے اس پر قادر ہونے، بلکہ ہر چیز پر قادر ہونے کے دلائل کا ذکر شروع فرمایا اور دلیل میں ان چیزوں کے پیدا کرنے کا ذکر فرمایا جو ان کی آنکھوں کے سامنے تھیں اور جن کا خالق وہ خود اللہ تعالیٰ کو مانتے تھے۔ بات کا آغاز ہمزۂ استفہام، {’’إِنَّ‘‘} اور لام کی تاکید کے ساتھ ہوا ہے۔ اس میں ان کے شرک پر تعجب اور ڈانٹ بھی ہے اور اس بات کا اظہار بھی کہ یقینا تم شرک کی کمینی حرکت کرتے ہو، حالانکہ کوئی عقل مند سوچ بھی نہیں سکتا کہ کوئی انسان زمین و آسمان کے خالق کے ساتھ کفر کرے گا اور اس کے ساتھ شریک بنائے گا۔ تعجب اور ڈانٹ کے ساتھ ساتھ زمین و آسمان کی تخلیق کی تاریخ بھی بیان فرما دی ہے۔ ہمزۂ استفہام اور تاکید کے دونوں حرفوں کو ملحوظ رکھ کر ترجمہ کیا گیا ہے : ’’کہہ کیا بے شک تم واقعی اس کا انکار کرتے ہو…۔‘‘ ¤ ➋ { لَتَكْفُرُوْنَ:} یہاں ماضی کا صیغہ {’’ كَفَرْتُمْ ‘‘} (تم نے انکار کیا) لانے کے بجائے فعل مضارع {’’ لَتَكْفُرُوْنَ ‘‘} کا لفظ اس لیے استعمال فرمایا کہ صرف یہ نہیں کہ تم اس سے پہلے کفر کر بیٹھے جو کر بیٹھے، بلکہ اتنے دلائل دیکھ اور سن کر بھی کفر سے باز نہیں آئے، بلکہ کفر کرتے ہی چلے جاتے ہو۔ ¤ ➌ { بِالَّذِيْ خَلَقَ الْاَرْضَ فِيْ يَوْمَيْنِ:} جب زمین و آسمان کو پیدا فرمایا اس وقت سورج کا وجود ہی نہیں تھا جس سے دن رات وجود میں آتے ہیں، تو پھر دو دنوں سے کیا مراد ہے؟ اس کے لیے دیکھیے سورۂ اعراف کی آیت (۵۴) کی تفسیر۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ { وَ جَعَلَ فِيْهَا رَوَاسِيَ: ’’ رَوَاسِيَ ‘‘ } کی تفسیر کے لیے دیکھیے سورۂ حجر (۱۹) اور سورۂ انبیاء (۳۱)۔ ¤ ➋ { مِنْ فَوْقِهَا:} اللہ تعالیٰ نے پہاڑ پورے کے پورے زمین کے اندر گاڑ دینے کے بجائے ان کا ایک حصہ زمین کے اوپر رکھا۔ اس میں بے شمار حکمتیں اور آدمی کے لیے فائدے ہیں، کیونکہ اگر پہاڑ پورے ہی زمین کے اندر ہوتے تو آدمی برف کے ان ذخیروں سے فیض یاب نہ ہو سکتا جو پہاڑ محفوظ رکھتے ہیں اور نہ ہی جنگلوں اور دریاؤں کے یہ سلسلے ہوتے۔ اس کے علاوہ بے شمار سونے، چاندی اور دوسری دھاتوں، گیسوں اور ہیرے جواہرات سے محروم رہتا جو وہ پہاڑوں کے زمین سے اوپر ہونے کی وجہ سے نکالتا ہے۔ ¤ ➌ { وَ بٰرَكَ فِيْهَا:} یعنی اس میں خیر کی بے شمار اشیاء کے خزانے رکھ دیے، جن میں درخت اور پودے بھی شامل ہیں۔ مٹی، پتھر، دھاتیں، گیسیں اور دوسرے وہ بے شمار عناصر بھی جو زمین میں موجود ہیں۔ چرند پرند، درندے اور آبی جانور بھی، پوری زمین کو گھیرے ہوئے ہوا بھی اور اس کے تقریباً ستر (۷۰) فی صد حصے پر مشتمل پانی بھی، جن پر زندگی کا دارو مدار ہے اور جن پر ہزاروں لاکھوں سال گزرنے کے باوجود کوئی کمی نہیں آئی، بلکہ ہر دن نئی سے نئی برکت کا ظہور ہوتا ہے۔ بتاؤ، اللہ کے سوا کون ہے جس نے ان میں سے ایک ہی چیز پیدا کی ہو، جس کی وجہ سے تم نے اسے اپنا حاجت روا اور خدا بنا لیا؟ ¤ ➍ {وَ قَدَّرَ فِيْهَاۤ اَقْوَاتَهَا: ’’أَقْوَاتٌ‘‘ ’’قُوْتٌ‘‘} کی جمع ہے، غذا، خوراک اور روزی۔ زمین کی غذاؤں سے مراد اس میں رہنے والی تمام مخلوقات کی غذائیں ہیں جو اللہ تعالیٰ نے ہر ایک کے لیے اس کے حسب حال اس کی ضرورت کے مطابق پورے اندازے کے ساتھ رکھ دیں، کسی مخلوق کی غذا کی کمی کا سوال ہی پیدا نہیں ہوتا۔ دیکھیے سورۂ حجر (۱۹ تا ۲۱)۔ ¤ ➎ { فِيْۤ اَرْبَعَةِ اَيَّامٍ:} یہاں ایک سوال ہے کہ قرآن مجید میں متعدد مقامات پر مذکور ہے کہ زمین و آسمان کی پیدائش چھ دنوںمیں ہوئی ہے۔ (دیکھیے اعراف : ۵۴۔ یونس : ۳۔ ہود : ۷۔ فرقان : ۵۹۔ سجدہ : ۴۔ ق : ۳۸۔ حدید : ۴) جب کہ ان آیات سے ان کی پیدائش آٹھ دنوںمیں ظاہر ہو رہی ہے، اس لیے کہ پہلے زمین کو دو دنوں میں پیدا کرنے کا ذکر فرمایا، پھر چار دنوں میں اس کے اوپر پہاڑ گاڑنے اور اس میں غذائیں رکھنے کا ذکر فرمایا، اس کے بعد والی آیات میں دو دنوں میں آسمانوں کو پورا کرنے کا ذکر فرمایا، تو یہ کل آٹھ دن بنتے ہیں۔ جواب اس کا یہ ہے کہ زیر تفسیر آیت میں مذکور {’’ اَرْبَعَةِ اَيَّامٍ ‘‘} (چار دن) میں پہلے دو دن بھی شامل ہیں، یعنی زمین کی پیدائش اور اس میں پہاڑ گاڑنے اور غذائیں رکھنے کا کام کل چار دن میں ہوا۔ اس کے بعد دو دنوں میں آسمانوں کی پیدائش کا کام پورا ہوا، یہ کل چھ دن بنتے ہیں۔ مفسر شنقیطی نے فرمایا : ’’اس آیت کی یہ تفسیر جو ہم نے کی ہے اس کے علاوہ کوئی تفسیر کسی طرح بھی درست نہیں۔‘‘ ¤ ➏ { سَوَآءً لِّلسَّآىِٕلِيْنَ:} یعنی اللہ تعالیٰ نے روزی کا سوال کرنے والوں کے لیے، خواہ وہ زبان حال سے مانگیں یا زبان قال سے، ان کی خوراکیں پورے اندازے کے ساتھ زمین میں رکھ دی ہیں اور اس کا اندازہ کبھی غلط نہیں ہو سکتا۔ مزید دیکھیے سورۂ ابراہیم کی آیت (۳۴) : « وَ اٰتٰىكُمْ مِّنْ كُلِّ مَا سَاَلْتُمُوْهُ » کیی تفسیر۔ زمین و آسمان کی تمام مخلوق اپنی ہر ضرورت کا سوال اللہ تعالیٰ سے کر رہی ہے اور وہ ہر لمحے اسے پورا کر رہا ہے، جیساکہ فرمایا : « يَسْـَٔلُهٗ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ كُلَّ يَوْمٍ هُوَ فِيْ شَاْنٍ» [ الرحمن : ۲۹ ] ’’اسی سے مانگتا ہے جو کوئی آسمانوں اور زمین میں ہے، ہر دن وہ ایک (نئی) شان میں ہے۔‘‘"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ { ثُمَّ اسْتَوٰۤى اِلَى السَّمَآءِ …:’’ اسْتَوٰۤى ‘‘} کے بعد {’’ اِلَى ‘‘} ہو تو اس کا معنی قصد کرنا ہوتا ہے۔ یعنی پھر اللہ نے آسمان کی طرف توجہ فرمائی، وہ اس وقت دھویں کی صورت میں تھا، تو اسے یعنی آسمان اور زمین دونوں سے کہا {’’ ائْتِيَا ‘‘} (آ جاؤ) یعنی میرے حکم کی اطاعت کرو، خوشی سے کرو یا مجبوری سے، ہر حال میں کرنا پڑے گی۔ ¤ ➋ {قَالَتَاۤ اَتَيْنَا طَآىِٕعِيْنَ:} ان دونوں نے کہا، ہم خوشی سے حاضر ہیں۔ اس سے معلوم ہوا کہ کائنات میں جو چیزیں طبعی طور پر اللہ تعالیٰ کی اطاعت کرتی ہیں، مثلاً فرشتے اس کے حکم کے بغیر کوئی بات کرتے ہیں نہ کوئی کام، اسی طرح سورج، چاند، ستارے، بادل، ہوائیں، سمندر، نباتات اور حیوانات و جمادات، غرض ہر چیز اللہ تعالیٰ کے حکم کے مطابق چل رہی ہے، ذرہ برابر ادھر ادھر نہیں ہوتی، تو یہ سب چیزیں مجبور ہو کر نہیں بلکہ اپنی رضا اور خوش دلی سے مالک کے حکم پر چل رہی ہیں۔ اللہ تعالیٰ نے ان کی فطرت ہی اسلام (فرماں برداری اور اطاعت) بنائی ہے۔ ¤ اس سے یہ بھی معلوم ہوا کہ زمین و آسمان کی ہر چیز اپنے رب کے احکام سننے، سمجھنے، ان کا جواب دینے اور ان پر عمل کرنے کی پوری سمجھ رکھتی ہے، خواہ ہم اسے {’’ لَا يَعْقِلُ‘‘} (بے سمجھ) خیال کرتے رہیں، کیونکہ لفظ {’’ طَآىِٕعِيْنَ ‘‘} (جمع مذکر سالم) عربی لغت میں ذوی العقول کے لیے آتا ہے، یہ الگ بات ہے کہ ہم ان کی گفتگو یا تسبیح نہ سمجھ سکیں۔ مزید دیکھیے سورۂ بنی اسرائیل(۴۴)۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { فَقَضٰىهُنَّ سَبْعَ سَمٰوٰتٍ فِيْ يَوْمَيْنِ:} یعنی اللہ تعالیٰ نے آسمان کو جو دخخان کی صورت میں تھا، دو دنوں میں پورے سات آسمان بنا دیا۔ ¤ ➋ { وَ اَوْحٰى فِيْ كُلِّ سَمَآءٍ اَمْرَهَا:} یعنی کائنات کے اس نظام میں ہر آسمان کی اور اس میں رہنے والی ہر مخلوق کی جو ذمہ داری تھی وہ اس کی طرف وحی فرما دی کہ تمھیں یہ کام کرنا ہے اور اس طرح کرنا ہے۔ ¤ ➌ {وَ زَيَّنَّا السَّمَآءَ الدُّنْيَا بِمَصَابِيْحَ وَ حِفْظًا: ’’ حِفْظًا ‘‘ ’’حَفِظْنَاهَا‘‘} کا مفعول مطلق ہے جو یہاں مقدر ہے اور اس کا عطف لفظ مقدر {’’ زِيْنَةٌ ‘‘} پر ہے جو {’’ زَيَّنَّا السَّمَآءَ الدُّنْيَا ‘‘} کا مفعول مطلق ہے۔ گویا اصل جملہ یہ تھا : {’’ وَ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيْحَ زِيْنَةً وَ حَفِظْنَاهَا بِهَا حِفْظًا۔‘‘} لفظ {’’ زَيَّنَّا ‘‘} کی دلالت کی وجہ سے {’’ زِيْنَةً ‘‘} کو حذف کر دیا اور {’’ حِفْظًا ‘‘} کی دلالت کی وجہ سے {’’حَفِظْنَاهَا‘‘} کو حذف کر دیا۔ اس طرح نہایت خوب صورتی کے ساتھ ایک لمبی بات مختصر لفظوں میں سمیٹ دی۔ یہ قرآن کی بلاغت ہے اور اسے احتباک کہتے ہیں۔ (بقاعی) {’’ حِفْظًا ‘‘} کے مفعول مطلق ہونے کی وجہ سے ترجمہ کیا گیا ہے ’’خوب محفوظ کر دیا۔‘‘ اس زینت و حفاظت کی تفصیل کے لیے ملاحظہ فرمائیں سورۂ حجر (۱۶ تا ۱۸)، صافات (۶ تا ۱۰) اور سورۂ ملک (۵)۔ یہاں یہ بات ملحوظ رہے کہ ان آیات میں اس سے پہلے اللہ تعالیٰ نے اپنا ذکر غائب کے صیغے {’’بِالَّذِيْ خَلَقَ الْاَرْضَ‘‘} کے ساتھ کیا ہے،{ ’’ زَيَّنَّا السَّمَآءَ ‘‘ } میں متکلم کے صیغے کے ساتھ اور {’’ ذٰلِكَ تَقْدِيْرُ الْعَزِيْزِ الْعَلِيْمِ ‘‘} میں پھر غائب کے ساتھ فرمایا ہے، اسے التفات کہتے ہیں، اس سے کلام میں حسن پیدا ہوتا ہے اور کئی حکمتیں بھی ملحوظ ہوتی ہیں۔ ¤ ➍ { ذٰلِكَ تَقْدِيْرُ الْعَزِيْزِ الْعَلِيْمِ:} یہ سب اس ہستی کا اندازہ اور مقرر کردہ نظام ہے جو عزت و علم کے ساتھ پوری طرح موصوف ہے۔ وہ سب پر غالب ہے، کوئی اس پر غالب نہیں، وہ سب کچھ جاننے والا ہے۔ گزشتہ، موجودہ یا آئندہ کوئی بھی چیز اس سے مخفی نہیں، اس لیے اس کے اس نظام میں کوئی غلطی، کوئی حادثہ نہیں اور کسی اور کا اس نظام میں ذرہ برابر دخل نہیں۔ سلسلۂ کلام {’’ قُلْ اَىِٕنَّكُمْ لَتَكْفُرُوْنَ بِالَّذِيْ خَلَقَ الْاَرْضَ فِيْ يَوْمَيْنِ ‘‘} سے شروع ہوا تھا اور {’’ ذٰلِكَ تَقْدِيْرُ الْعَزِيْزِ الْعَلِيْمِ ‘‘} پر ختم ہوا۔ مطلب یہ ہے کہ یہ پوری کائنات جس نے چھ دن میں پیدا فرمائی، اس میں موجود ہر چیز حتیٰ کہ تمھیں اور ان چیزوں کو بھی پیدا کیا جنھیں تم نے معبود بنا رکھا ہے، کیا تم اس عظیم ہستی کے ساتھ کفر کرتے ہو اور اس کے ساتھ شریک بناتے ہو جس نے یہ سب کچھ کیا ہے؟"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) { فَاِنْ اَعْرَضُوْا فَقُلْ اَنْذَرْتُكُمْ … : ’’ صٰعِقَةً ‘‘} کی وضاحت کے لیے دیکھیے  سورۂ رعد (۱۳)۔ سورت کی ابتدائی آیات (۴، ۵) میں اللہ کی کتاب سے اکثر لوگوں کے اعراض کا ذکر فرمایا، اس کے بعد چھ دنوں میں زمین و آسمان کی تخلیق کی تفصیل بیان فرمائی، اب فرمایا کہ اگر یہ لوگ اب بھی نہ مانیں کہ معبود برحق صرف ایک ہے، جس نے یہ زمین و آسمان اور ساری کائنات بنائی ہے اور اس حقیقت سے اعراض پر اڑے رہیں، تو ان سے کہہ دیں کہ تم سے پہلے بھی کئی اقوام نے یہ روش اختیار کی جو تم اختیار کر رہے ہو۔ سو میں تمھیں اس جیسے عذاب اور کڑکنے والی بجلی سے ڈراتا ہوں جو تم سے پہلی اقوام عاد و ثمود پر گری تھی۔ عاد و ثمود کے تعارف کے لیے دیکھیے سورۂ اعراف (۶۵ تا ۷۹)۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { اِذْ جَآءَتْهُمُ الرُّسُلُ مِنْۢ بَيْنِ اَيْدِيْهِمْ وَ مِنْ خَلْفِهِمْ:} دونوں قوموں کی طرف آنے والے دو رسولوں ہود اور صالح علیھما السلام کے لیے جمع کا لفظ استعمال فرمایا ہے، یا مراد دونوں پیغمبروں میں سے ہر ایک کے ساتھ پیغام حق پہنچانے والے مومن بھی ہیں، جنھوں نے ہر طرح اور ہر جانب سے آ کر انھیں اللہ کا پیغام پہنچایا۔ آگے پیچھے سے مراد ہر طرف سے اور ہر طرح سے آ کر سمجھانا ہے، جیسا کہ ابلیس نے کہا تھا : « ثُمَّ لَاٰتِيَنَّهُمْ مِّنْۢ بَيْنِ اَيْدِيْهِمْ وَ مِنْ خَلْفِهِمْ وَ عَنْ اَيْمَانِهِمْ وَ عَنْ شَمَآىِٕلِهِمْ وَ لَا تَجِدُ اَكْثَرَهُمْ شٰكِرِيْنَ» [ الأعراف : ۱۷ ] ’’پھر میں ہر صورت ان کے آگے سے اور ان کے پیچھے سے اور ان کی دائیں طرفوں سے اور ان کی بائیں طرفوں سے آؤں گا اور تو ان کے اکثر کو شکر کرنے والے نہیں پائے گا۔‘‘ ¤ ➋ { اَلَّا تَعْبُدُوْۤا اِلَّا اللّٰهَ: ’’ أَلَّا ‘‘ ’’أَنْ لَا ‘‘} ہے، اس میں {’’أَنْ‘‘} تفسیریہ ہے، یعنی تمام رسولوں کی دعوت یہ تھی کہ اللہ کے سوا کسی کی عبادت مت کرو۔ ¤ ➌ { قَالُوْا لَوْ شَآءَ رَبُّنَا لَاَنْزَلَ مَلٰٓىِٕكَةً …:} اس کی تفسیر کے لیے دیکھیے سورۂ ابراہیم (۹، ۱۰) اور سورۂ بنی اسرائیل (۹۴، ۹۵)۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ {فَاَمَّا عَادٌ فَاسْتَكْبَرُوْا۠ فِي الْاَرْضِ … :} اللہ تعالیٰ نے قومِ عاد کو ایسے لمبے قد، جسمانی قوت اور دنیوی ترقی کے اسباب عطا فرمائے تھے کہ اس کے فرمان کے مطابق اس جیسی کوئی قوم پیدا ہی نہیں کی گئی، فرمایا : « اَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِعَادٍ۪ (6) اِرَمَ ذَاتِ الْعِمَادِ۪ (7) الَّتِيْ لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ » [ الفجر : ۶ تا ۸ ] ’’کیا تونے نہیں دیکھا کہ تیرے رب نے عاد کے ساتھ کس طرح کیا۔ (وہ عاد) جو ارم ( قبیلہ کے لوگ) تھے، ستونوں والے۔ وہ کہ ان جیسا کوئی شہروں میں پیدا نہیں کیا گیا۔‘‘ اور فرمایا: « اَتَبْنُوْنَ بِكُلِّ رِيْعٍ اٰيَةً تَعْبَثُوْنَ (128) وَ تَتَّخِذُوْنَ مَصَانِعَ لَعَلَّكُمْ تَخْلُدُوْنَ (129) وَ اِذَا بَطَشْتُمْ بَطَشْتُمْ جَبَّارِيْنَ » [الشعراء : ۱۲۸ تا ۱۳۰ ] ’’کیا تم ہر اونچی جگہ پر ایک یادگار بناتے ہو؟ اس حال میں کہ لاحاصل کام کرتے ہو۔ اور بڑی بڑی عمارتیں بناتے ہو، شاید کہ تم ہمیشہ رہو گے۔ اور جب تم پکڑتے ہو تو بہت بے رحم ہو کر پکڑتے ہو۔‘‘ جب ہود علیہ السلام نے انھیں توحید کی دعوت دی تو انھوں نے یہ جان لینے کے باوجود کہ وہ اللہ کے سچے رسول ہیں، محض اپنی بڑائی اور سرداری کے گمان میں انھیں جھٹلا دیا، کیونکہ انھیں رسول ماننے کی صورت میں ان کی اطاعت اختیار کرنا پڑتی تھی، جس کے لیے وہ تیار نہ تھے۔ ¤ ➋ { وَ قَالُوْا مَنْ اَشَدُّ مِنَّا قُوَّةً:} جب ہود علیہ السلام نے انھیں اللہ کے عذاب سے ڈرایا تو وہ کہنے لگے کہ ہم سے زیادہ قوت والا کون ہے جس سے ہم خوف کھائیں؟ ہم آنے والا ہر عذاب ہٹا سکتے ہیں۔ آج کل بھی ملحد لوگ آسمانی آفات کے متعلق کہتے ہیں کہ ہم ان کا مقابلہ کریں گے۔ شاہ عبد القار لکھتے ہیں : ’’ان کے جسم بڑے بڑے ہوتے تھے، بدن کی قوت پر غرور آیا، غرور کا دم بھرنا اللہ کے ہاں وبال لاتا ہے۔‘‘ (موضح) ¤ ➌ {اَوَ لَمْ يَرَوْا اَنَّ اللّٰهَ الَّذِيْ خَلَقَهُمْ … : ’’ اَوَ لَمْ يَرَوْا ‘‘} کا معنی {’’أَوَ لَمْ يَعْلَمُوْا‘‘} ہے، یہ رؤیت علمی ہے۔ یعنی کیا انھیں معلوم نہ تھا کہ وہ کتنی قوت والے سہی، اس اللہ سے زیادہ قوت والے نہیں ہو سکتے جس نے انھیں پیدا کیا؟ یقینا انھیں یہ معلوم تھا، استفہام انکاری ہے۔ ¤ ➍ {وَ كَانُوْا بِاٰيٰتِنَا يَجْحَدُوْنَ: ’’جُحُوْدٌ‘‘} کا معنی ’’جاننے کے باوجود انکار کرنا‘‘ ہے۔ یعنی دل میں ان کا حق ہونا سمجھتے تھے، مگر ضد اور عناد کی وجہ سے انکار کرتے چلے جاتے تھے۔ آیات سے مراد انبیاء پر نازل ہونے والی آیات بھی ہیں، ان کے معجزات بھی اور کائنات میں اللہ تعالیٰ کی توحید اور اس کی قدرت کی پھیلی ہوئی بے شمار نشانیاں بھی۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { فَاَرْسَلْنَا عَلَيْهِمْ رِيْحًا صَرْصَرًا: ’’ صَرْصَرًا ‘‘ ’’صِرٌّ‘‘} (صاد پر کسرہ) سے ہے، سردی کی شدت جو بدن سکیڑ کر رکھ دے، یعنی شدید ٹھنڈی ہوا، جیسا کہ اللہ تعالیٰ کا فرمان ہے : « كَمَثَلِ رِيْحٍ فِيْهَا صِرٌّ » [ آل عمران : ۱۱۷] ’’اس ہوا کی مثال جیسی ہے جس میں سخت سردی ہے۔‘‘ یا {’’صَرَّةٌ‘‘} سے ہے، جس کا معنی ’’خوفناک چیخ‘‘ ہے، جیسا کہ فرمایا : « فَاَقْبَلَتِ امْرَاَتُهٗ فِيْ صَرَّةٍ» [ الذاریات : ۲۹ ] ’’تو اس کی بیوی چیختی ہوئی آگے بڑھی۔‘‘ یہاں دونوں معنی اکٹھے ملحوظ ہیں کہ وہ ہوا نہایت ٹھنڈی اور خوفناک چیخ جیسی آواز والی تھی۔ {’’ صَرْصَرًا ‘‘} میں حروف مکرر ہونے سے معنی میں مبالغہ پیدا ہو گیا ہے، یعنی ہم نے ان پر نہایت خوفناک آواز والی شدید ٹھنڈی تیز و تند آندھی بھیجی اور اسی ہوا کو جو ان کی زندگی کے قیام اور دل کی راحت کا باعث تھی اور جسے وہ بالکل معمولی اور بے ضرر سمجھتے تھے، ان کی ہلاکت کا سامان بنا دیا اور ان کی کوئی قوت انھیں بچا نہ سکی۔ ¤ ➋ {فِيْۤ اَيَّامٍ نَّحِسَاتٍ: ’’ نَحِسَاتٍ ‘‘ ’’نَحْسٌ‘‘} (نون کے فتحہ اور حاء کے سکون کے ساتھ) کی جمع ہے، جیسا کہ دوسری جگہ فرمایا : « فِيْ يَوْمِ نَحْسٍ مُّسْتَمِرٍّ » [ القمر : ۱۹ ] ’’ایسے دن میں جو دائمی نحوست والا تھا۔‘‘ {’’ نَحْسٌ‘‘} اور {’’مَنْحُوْسٌ‘‘} (بدقسمتی والا) {’’سَعْدٌ‘‘} (خوش قسمتی والا) کی ضد ہے۔ فی الحقیقت اپنی ذات میں کوئی چیز منحوس نہیں، یہ صرف اضافی چیز ہے، یعنی ایک ہی شے کسی کے حق میں خوش قسمتی کا باعث ہوتی ہے اور کسی کے حق میں بدقسمتی کا، جیسا کہ آندھی کے یہ ایام قومِ عاد کے حق میں منحوس تھے مگر ہود علیہ السلام اور ایمان والوں کے لیے ان دنوں سے زیادہ خوش قسمتی والا دن اور کون سا ہو گا۔ اس آندھی کی تفصیل کے لیے دیکھیے سورۂ اعراف (۷۲)، قمر (۱۸ تا ۲۰)، ذاریات (۴۱، ۴۲) اور سورۂ حاقہ (۶ تا ۸)۔ بعض مسلمان کہلانے والے بھی بعض دنوں کو منحوس سمجھتے ہیں، جیسے دس محرم، کیونکہ اس میں حسین رضی اللہ عنہ شہید ہوئے، حالانکہ اس دس محرم کو موسیٰ علیہ السلام اور بنی اسرائیل کو نجات حاصل ہوئی، جس کی خوشی میں رسول اللہ صلی اللہ علیہ وسلم روزہ رکھتے تھے۔ بعض لوگ صفر کے کچھ دنوں کو منحوس سمجھتے ہیں، حالانکہ ایسا عقیدہ باطل ہے۔ ¤ ➌ { لِنُذِيْقَهُمْ عَذَابَ الْخِزْيِ فِي الْحَيٰوةِ الدُّنْيَا:} یہ ذلت و رسوائی ان کے غرور اور تکبر کا جواب تھا کہ وہی زمین جس پر وہ بڑے بنے ہوئے تھے اسی پر ان کے بے جان لاشے کھجور کے کھوکھلے تنوں کی طرح گرے پڑے تھے۔ ¤ ➍ { وَ لَعَذَابُ الْاٰخِرَةِ اَخْزٰى … :} یقینا آخرت کا عذاب زیادہ رسوائی والا ہے، اس لیے کہ وہ تمام پہلے اور پچھلے لوگوں کے سامنے ہو گا، پھر دنیا میں تو ظاہری اسباب کے ساتھ شاید کوئی مدد کے لیے پہنچ جائے، وہاں اس کا سوال ہی پیدا نہیں ہوتا۔ پھر دنیا کی رسوائی تو ایک وقت تک ہے، جب کہ وہاں کی رسوائی ہمیشہ کے لیے ہے۔ اللہ تعالیٰ ہمیں اس ذلت و رسوائی سے محفوظ رکھے۔ آمین !"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {وَ اَمَّا ثَمُوْدُ فَهَدَيْنٰهُمْ …:} قوم ثمود کے تعارف کے لیے دیکھیے سورۂ اعراف (۷۳ تا ۷۹)۔ ہدایت کی تفسیر کے لیے سورۂ فاتحہ کی آیت : { اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ } کی تفسیر ملاحظہ فرمائیں۔ یعنی ہم نے انھیں راہِ حق دکھا دیا، مگر انھوں نے ہدایت قبول کرنے کے بجائے اندھا اور گمراہ رہنے کو ترجیح دی۔ ¤ ➋ {فَاَخَذَتْهُمْ صٰعِقَةُ الْعَذَابِ الْهُوْنِ …:’’ الْهُوْنِ ‘‘} اور{’’اَلْهَوَانُ‘‘} معنی ذلت، یہ مصدر بمعنی اسم فاعل برائے مبالغہ ہے۔ ثمود پر آنے والے عذاب کو کہیں {’’ الرَّجْفَةُ ‘‘} (زلزلہ) کہا گیا ہے، کہیں {’’ الصَّيْحَةُ ‘‘} (سخت چیخ) یہاں اسے بجلی کی کڑک کہا گیا ہے۔ اس سے معلوم ہوا کہ وہ ایک سخت چیخ تھی جس میں بجلی کی کڑک اور شعلہ تھا، ساتھ ہی شدید زلزلہ تھا جس سے ان کے جگر پھٹ گئے اور سب کے سب ہلاک ہو گئے۔ یہ ذلت کا عذاب ان کے اعمال بد کا انجام تھا۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) {وَ نَجَّيْنَا الَّذِيْنَ اٰمَنُوْا …:} یہ اللہ تعالیٰ کی عجیب و غریب قدرت ہے کہ اتنے شدید عذاب، زلزلے، خوف ناک چیخ اور بجلیاں چمکنے اور گرنے کے باوجود کسی مسلمان کا بال تک بیکا نہیں ہوا، وہ سب اللہ کے فضل سے صحیح و سلامت رہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { وَ يَوْمَ يُحْشَرُ اَعْدَآءُ اللّٰهِ اِلَى النَّارِ:} لفظ {’’ يَوْمَ ‘‘ ’’اُذْكُرْ‘‘} کا مفعول ہے جو یہاں مقدر ہے۔ یہاں ایک سوال ہے کہ واؤ کا عطف کس پر ہے؟ جواب اس کا یہ ہے کہ اس سے پہلے انبیاء کو جھٹلانے والے منکرین پر دنیا میں آنے والے عذابوں کا ذکر فرمایا تھا، اب آخرت میں ان کے ہونے والے حال کا ذکر فرمایا۔ چنانچہ آخرت کا حال یاد دلانے والے اس جملے کا عطف اس مقدر جملے پر ہے جس میں ان پر دنیا میں آنے والے عذاب یاد دلائے گئے ہیں۔ گویا اصل عبارت یہ تھی: {’’ اُذْكُرْ أَيَّامَ أَعْدَاءِ اللّٰهِ فِي الدُّنْيَا فِيْ إِنْزَالِ الْعَذَابِ لَهُمْ وَاذْكُرْ يَوْمَ يُحْشَرُوْنَ إِلَي النَّارِ۔‘‘} یعنی ’’اانھیں اللہ کے دشمنوں پر دنیا میں آنے والے عذابوں کی یاد دہانی کروا اور انھیں وہ دن یاد دلا جب وہ آگ کی طرف اکٹھے کیے جائیں گے۔‘‘ آیات کی ابتدا میں آنے والی واؤ عاطفہ کی مناسبت ہر جگہ{’’ نَظْمُ الدُّرَرِ فِيْ تَنَاسُبِ الْآيَاتِ وَالسُّوَرِ ‘‘} کے مصنف نے نہایت عمدہ بیان فرمائی ہے۔ میں نے اختصار کے پیش نظر صرف چند ایک مقامات پر اس کا ذکر کیا ہے، اصحاب ذوق اصل کتاب سے فائدہ اٹھا سکتے ہیں۔ ¤ ➋ { فَهُمْ يُوْزَعُوْنَ: ’’ وَزَعَ يَزَعُ ‘‘} کا اصل معنی روکنا، ترتیب دینا ہے۔ مطلب یہ ہے کہ قیامت کے دن اللہ کے دشمنوں کو آگ کی طرف اکٹھا کرکے لے جایا جائے گا اور انھیں اس طرح اکٹھا کیا جائے گا کہ آگے والوں کو آگے جانے سے اور پیچھے والوں کو پیچھے جانے سے روک کر اکٹھا کر لیا جائے گا، پھر ان کی الگ الگ ترتیب لگائی جائے گی، ان کے جرائم کے مطابق ان کی ٹولیاں بنائی جائیں گی اور انھیں دھکیل کر جہنم کی طرف لے جایا جائے گا۔ دیکھیے سورۂ حم السجدہ(۱۹) اور سورۂ صافات (۲۲ تا ۲۶)۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {حَتّٰۤى اِذَا مَا جَآءُوْهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ …:} زمخشری نے فرمایا : {’’ اِذَا ‘‘} کے بعد لفظ{’’ مَا ‘‘} اس کی تاکید کے لیے ہے، تاکید کا مطلب یہ ہے کہ آگ کے پاس پہنچنے کا وقت ہی ان پر شہادت کا وقت ہو گا، یہ نہیں کہ کچھ وقت شہادت سے خالی ہو۔‘‘ (کشاف) اس لیے میں نے {’’ اِذَا مَا ‘‘} کا ترجمہ ’’جونہی‘‘ کیا ہے۔ یعنی آگ کے پاس پہنچنے پر جب وہ اپنے جرائم سے انکار کریں گے تو فوراً ہی ان کے کان، آنکھیں اور چمڑے ان کے خلاف شہادت دیں گے۔ اس کی تفصیل سورۂ یس کی آیت (۶۵) : « اَلْيَوْمَ نَخْتِمُ عَلٰۤى اَفْوَاهِهِمْ » میں گزر چکی ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ {وَ قَالُوْا لِجُلُوْدِهِمْ لِمَ شَهِدْتُّمْ عَلَيْنَا:} اپنے چمڑوں سے یہ بات وہ پوچھنے کے لیے نہیں بلکہ تعجب کے اظہار اور ملامت کے لیے کہیں گے کہ تمھی کو بچانے کے لیے تو ہم اللہ تعالیٰ سے جھوٹ بول رہے تھے اور تمھی ہمارے خلاف شہادت دے رہے ہو۔ ¤ ➋ { قَالُوْۤا اَنْطَقَنَا اللّٰهُ الَّذِيْۤ اَنْطَقَ كُلَّ شَيْءٍ:} اعضا ان کے تعجب اور ملامت دونوں کا جواب دیں گے۔ تعجب کا جواب تو یہ دیں گے کہ ہمارا بولنا کوئی تعجب کی بات نہیں، زبان بولتی تھی تو اللہ کے حکم سے اور اس کے گویائی عطا کرنے سے بولتی تھی، اسی طرح ہر بولنے والی چیز اسی کے حکم سے بولتی ہے، تو اب اس نے ہمیں بلوا دیا تو اس میں تعجب کی کون سی بات ہے؟ ¤ ➌ { وَ هُوَ خَلَقَكُمْ اَوَّلَ مَرَّةٍ وَّ اِلَيْهِ تُرْجَعُوْنَ:} یہ چمڑوں کا کلام بھی ہو سکتا ہے اور آخرت کے منکروں سے اللہ تعالیٰ کا خطاب بھی ہو سکتا ہے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ { وَ مَا كُنْتُمْ تَسْتَتِرُوْنَ اَنْ يَّشْهَدَ عَلَيْكُمْ … :} یہ ان کی ملامت کا جواب ہے کہ تم گناہ کا کام کرتے ہوئے لوگوں سے چھپنے اور پردہ کرنے کا تو پورا اہتمام کرتے تھے، مگر تمھیں اس بات کا خوف نہ تھا کہ تمھارے کان، آنکھیں اور چمڑے ہی تمھارے خلاف تمھارے اعمالِ بد کی شہادت دیں گے۔ اگر تمھیں اس بات کا خوف ہوتا تو تم برے اعمال کر ہی نہیں سکتے تھے، کیونکہ انھی اعضا کے ساتھ ہی تو تم نے اللہ کی نافرمانی کرنا تھی۔ ¤ ➋ { وَ لٰكِنْ ظَنَنْتُمْ اَنَّ اللّٰهَ لَا يَعْلَمُ …:} یعنی بات صرف اتنی نہ تھی کہ تمھیں یقین نہ تھا کہ قیامت قائم ہو سکتی ہے اور تمھارے اعضا تمھارے خلاف گواہی دے سکتے ہیں، بلکہ اصل بات یہ تھی کہ تم اللہ تعالیٰ کے علم کے بھی منکر تھے، تم نے سمجھا کہ اللہ تعالیٰ تمھارے بہت سے اعمال کو جانتا ہی نہیں۔ ورنہ اگر تمھیں یقین ہوتا کہ تم جو کچھ کر رہے ہو اللہ تعالیٰ اسے دیکھ رہا ہے، تمھاری ہر بات سن رہا ہے اور تمھارے ہر حال کا علم رکھتا ہے تو تم گناہ پر اتنے دلیر نہ ہوتے۔ مشرکینِ قریش کی اس نادانی کا ذکر عبد اللہ بن مسعود رضی اللہ عنہ نے فرمایا ہے، وہ فرماتے ہیں : [ اِجْتَمَعَ عِنْدَ الْبَيْتِ قُرَشِيَّانِ وَثَقَفِيٌّ، أَوْ ثَقَفِيَّانِ وَ قُرَشِيٌّ، كَثِيْرَةٌ شَحْمُ بُطُوْنِهِمْ، قَلِيْلَةٌ فِقْهُ قُلُوْبِهِمْ، فَقَالَ أَحَدُهُمْ أَتُرَوْنَ أَنَّ اللّٰهَ يَسْمَعُ مَا نَقُوْلُ؟ قَالَ الْآخَرُ يَسْمَعُ إِنْ جَهَرْنَا وَلاَ يَسْمَعُ إِنْ أَخْفَيْنَا، وَ قَالَ الْآخَرُ إِنْ كَانَ يَسْمَعُ إِذَا جَهَرْنَا فَإِنَّهُ يَسْمَعُ إِذَا أَخْفَيْنَا، فَأَنْزَلَ اللّٰهُ عَزَّ وَ جَلَّ : « وَ مَا كُنْتُمْ تَسْتَتِرُوْنَ اَنْ يَّشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَ لَاۤ اَبْصَارُكُمْ وَ لَا جُلُوْدُكُمْ وَ لٰكِنْ ظَنَنْتُمْ اَنَّ اللّٰهَ لَا يَعْلَمُ كَثِيْرًا مِّمَّا تَعْممَلُوْنَ » ] [ بخاري، التفسیر، سورۃ حٰمٓ السجدۃ، باب : { وذٰلکم ظنکم الذی… } : ۴۸۱۷ ] ’’بیت اللہ کے پاس دو قریشی اور ایک ثقفی یا دو ثقفی اور ایک قریشی جمع ہوئے، جن کے پیٹ کی چربی بہت تھی، (مگر) دلوں کی سمجھ بہت کم تھی۔ تو ان میں سے ایک نے کہا : ’’کیا تمھارا خیال ہے کہ ہم جو کچھ کہہ رہے ہیں اسے اللہ تعالیٰ سن رہا ہے؟‘‘ دوسرے نے کہا : ’’اگر ہم اونچی آواز سے کہیں تو وہ سنتا ہے اور اگر آہستہ کہیں تو نہیں سنتا۔‘‘ ایک اور بولا: ’’اگر وہ اس وقت سنتا ہے جب ہم اونچی آواز سے بات کریں تو یقینا وہ اس وقت بھی سنتا ہے جب ہم آہستہ بات کریں۔‘‘ تو اللہ تعالیٰ نے یہ آیت اتار دی : ’’ اور تم اس سے پردہ نہیں کرتے تھے کہ تمھارے خلاف تمھارے کان گواہی دیں گے اور نہ تمھاری آنکھیں اور نہ تمھارے چمڑے اور لیکن تم نے گمان کیا کہ بے شک اللہ بہت سے کام، جو تم کرتے ہو، نہیں جانتا۔‘‘ ¤ یاد رہے کہ اس بات کا مطلب کہ یہ آیت فلاں موقع پر اتری، یہ ہوتا ہے کہ یہ واقعہ بھی انھی دنوں میں ہوا، یا رسول اللہ صلی اللہ علیہ وسلم نے فلاں موقع پر یہ آیت پڑھی، یا یہ کہ وہ آیت اس واقعہ پر بھی منطبق ہوتی ہے، جیسا کہ اصولِ تفسیر میں واضح کیا گیا ہے۔ ورنہ ظاہر ہے کہ آیات کا سیاق تو قیامت کے دن کے متعلق ہے۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) {وَ ذٰلِكُمْ ظَنُّكُمُ الَّذِيْ ظَنَنْتُمْ بِرَبِّكُمْ …:’’ ذٰلِكُمْ ‘‘} کی خبر{’’ ظَنُّكُمْ ‘‘} معرفہ ہونے کی وجہ سے ترجمہ ’’یہی تمھارا گمان تھا‘‘ کیا گیا ہے۔ {’’أَرْدٰي يُرْدِيْ‘‘} (افعال) ہلاک کرنا۔ یعنی تمھارے اسی باطل گمان اور غلط عقیدے نے کہ اللہ تعالیٰ کو تمھارے بہت سے اعمال کا علم نہیں ہوتا، تمھیں ہلاک کر دیا، کیونکہ اس سے تم اس کی نافرمانی پر دلیر ہو گئے اور خسارا پانے والوں میں سے ہو گئے۔ ¤ یاد رہے کہ گمراہی کے اسباب میں سے بہت بڑا سبب صحیح غور و فکر نہ کرنا اور محض گمان کے پیچھے چلتے رہنا ہے۔ مشرکین کی اصل گمراہی بھی یہی تھی، جیسا کہ فرمایا : « اِنْ يَّتَّبِعُوْنَ اِلَّا الظَّنَّ» [ الأنعام : ۱۱۶ ] ’’وہ تو گمان کے سوا کسی چیز کی پیروی نہیں کرتے۔‘‘ اور فرمایا : « يَظُنُّوْنَ بِاللّٰهِ غَيْرَ الْحَقِّ ظَنَّ الْجَاهِلِيَّةِ » [ آل عمران : ۱۵۴ ] ’’وہ اللہ کے بارے میں ناحق جاہلیت کا گمان کر رہے تھے۔‘‘"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) { فَاِنْ يَّصْبِرُوْا فَالنَّارُ مَثْوًى لَّهُمْ … :} یعنی دنیا میں کئی مصیبتیں صبر کرنے سے ٹل جاتی ہیں یا آسان ہو جاتی ہیں اور بعض مصیبتیں منتیں کرنے سے ٹل جاتی ہیں، لیکن وہاں کافر صبر کریں یا نہ کریں ان کے لیے جہنم ٹھکانا طے ہو چکا اور منتیں جتنی چاہیں کریں کوئی قبول نہیں ہو گی۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ {وَ قَيَّضْنَا لَهُمْ قُرَنَآءَ …:’’ قُرَنَآءَ ‘‘ ’’قَرِيْنٌ‘‘} کی جمع ہے، ساتھ رہہنے والا۔ {’’اَلْقَيْضُ‘‘} انڈے کے چھلکے کو کہتے ہیں۔ یعنی جس طرح چھلکا انڈے کے ساتھ پیوست ہوتا ہے اسی طرح ہم نے ایسے برے لوگ ان مشرکین کے ساتھ لگا دیے جو ان کے ساتھ اس طرح چمٹے رہتے ہیں جس طرح انڈے کا چھلکا چمٹا رہتا ہے۔ یہ اللہ تعالیٰ کی سنت ہے کہ اگر انسان برا ہو تو اسے ساتھی بھی برے میسر آتے ہیں، جو اسے سبز باغ دکھاتے رہتے ہیں۔ نتیجہ یہ ہوتا ہے کہ وہ انسان برائیوں میں مگن ہو جاتا ہے اور آخر کار خود کو اپنے ساتھیوں سمیت لے ڈوبتا ہے۔ مزید دیکھیے سورۂ زخرف (۳۶) اور سورۂ ق (۲۳ تا ۲۹)۔ ¤ ➋ { فَزَيَّنُوْا لَهُمْ مَّا بَيْنَ اَيْدِيْهِمْ … : ’’ مَا بَيْنَ اَيْدِيْهِمْ ‘‘} سے مراد وہ اعمال ہیں جو وہ دنیا میں کر رہے تھے اور {’’ وَ مَا خَلْفَهُمْ ‘‘} سے مراد وہ اعمالِ بد ہیں جو اس سے پہلے کر چکے تھے۔ یعنی وہ برے ساتھی ان کے لیے ان کے موجودہ اور گزشتہ تمام برے اعمال کو خوش نما بنا کر پیش کرتے رہتے ہیں، جس کے نتیجے میں وہ انھی پر جمے رہتے ہیں اور ان لوگوں میں شامل ہو جاتے ہیں جن کے اعمالِ بد کی وجہ سے ان پر اللہ تعالیٰ کا یہ فرمان صادق آتا ہے : « لَاَمْلَـَٔنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَ النَّاسِ اَجْمَعِيْنَ » [ ہود : ۱۱۹ ] ’’میں جہنم کو جنوں اور انسانوں سب سے ضرور ہی بھروں گا۔‘‘ ¤ بعض مفسرین نے {’’ مَا بَيْنَ اَيْدِيْهِمْ ‘‘} سے مراد دنیا اور {’’ وَ مَا خَلْفَهُمْ ‘‘} سے مراد آخرت لی ہے۔ یعنی ان کے برے ساتھی آخرت کے متعلق بھی انھیں خوش گمانی میں مبتلا رکھتے ہیں کہ اوّل تو وہ ہو گی ہی نہیں اور اگر ہوئی بھی تو جس طرح اللہ تعالیٰ نے تمھیں دنیا میں نعمتوں سے نوازا ہے وہاں بھی نوازے گا۔ مزید دیکھیے سورۂ مریم (۷۷)۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ { وَ قَالَ الَّذِيْنَ كَفَرُوْا لَا تَسْمَعُوْا … :} کفار قرآن کی تاثیر سے واقف تھے کہ جو شخص عناد سے خالی ہو کر اسے سن لے وہ یقینا اس سے متاثر ہوتا ہے۔ چنانچہ انھوں نے فیصلہ کیا کہ نہ خود قرآن سنو، نہ کسی کو سننے دو۔ یہ ان کا واضح اعترافِ شکست تھا، وہ اس جیسی ایک سورت بھی بنا کر نہ لا سکے تو حق یہ تھا کہ اس پر ایمان لے آتے، مگر وہ اس کی مخالفت پر ڈٹ گئے اور ہر طریقے سے لوگوں کو اس سے روکنے کی کوشش کرنے لگے۔ ¤ ➋ { لِهٰذَا الْقُرْاٰنِ:} یعنی پہلی کتابیں پڑھنے سننے پر کوئی پابندی نہیں، کیونکہ اس سے ہمیں کوئی فرق نہیں پڑتا۔ یہ قرآن جو محمد ( صلی اللہ علیہ وسلم ) لے کر آئے ہیں، یہ مت سنو، کیونکہ یہ دلوں کو کھینچتا ہے۔ ¤ ➌ { وَ الْغَوْا فِيْهِ: ’’ الْغَوْا ‘‘ ’’لَغِيَ يَلْغٰي‘‘} (س، ف) بغیر سوچے سمجھے بولنا، شور مچانا۔ یعنی اگر کبھی سننے کا اتفاق ہو تو اس میں شور ڈال دو، تاکہ تم غالب رہو۔ اس سے ظاہر ہے کہ وہ مان رہے تھے کہ اگر نبی صلی اللہ علیہ وسلم یا مسلمان قرآن سنانے میں کامیاب ہو گئے تو وہی غالب رہیں گے۔ عربی مقولہ ہے : {’’ وَالْفَضْلُ مَا شَهِدَتْ بِهِ الْأَعْدَاءُ ‘‘} ’’اصل برتری وہ ہے جس کی شہادت دشمن دیں۔‘‘ دوسری جگہ اللہ تعالیٰ نے کفار کی اس بات کے برعکس فرمایا : « وَ اِذَا قُرِئَ الْقُرْاٰنُ فَاسْتَمِعُوْا لَهٗ وَ اَنْصِتُوْا لَعَلَّكُمْ تُرْحَمُوْنَ » [ الأعراف : ۲۰۴ ] ’’اور جب قرآن پڑھا جائے تو اسے کان لگا کر سنو اور چپ رہو، تاکہ تم پر رحم کیا جائے۔‘‘ یعنی جعلی غلبے کے بجائے حقیقی رحمت کے طلب گار بنو۔ ¤ ➍ کفار کی یہ بدتمیزی صرف اس وقت نہیں تھی جب رسول اللہ صلی اللہ علیہ وسلم انھیں قرآن سنانے کی کوشش کرتے، بلکہ جب آپ صلی اللہ علیہ وسلم اپنے ساتھیوں کو قرآن سنا رہے ہوتے، یا انھیں نماز پڑھاتے ہوئے بلند آواز سے قراء ت کرتے تو وہ اس وقت بھی بدزبانی اور گالی گلوچ شروع کر دیتے، جس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی : « وَ لَا تَجْهَرْ بِصَلَاتِكَ وَ لَا تُخَافِتْ بِهَا وَ ابْتَغِ بَيْنَ ذٰلِكَ سَبِيْلًا» [ بني إسرائیل : ۱۱۰ ] ’’اور اپنی نماز نہ بلند آواز سے پڑھ اور نہ اسے پست کر اور اس کے درمیان کوئی راستہ اختیار کر۔‘‘ تفصیل کے لیے دیکھیے سورۂ بنی اسرائیل کی اسی آیت کی تفسیر۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ {فَلَنُذِيْقَنَّ الَّذِيْنَ كَفَرُوْا عَذَابًا شَدِيْدًا:} چونکہ یہ ان کا صریح ظلم اور عناد تھا اور ان کی ہدایت کی امید ہی نہ تھی، اس لیے عبرت ناک سزا اور عذاب کے سوا ان کی کوئی جزا نہ تھی۔ {’’ فَلَنُذِيْقَنَّ ‘‘} کی فاء تعلیل کے لیے ہے، یعنی ان کے قرآن سننے سے روکنے کی وجہ سے ہم انھیں شدید عذاب چکھائیں گے۔ ¤ ➋ { ’’فَلَنُعَذِّبَنَّ‘‘} (ہم انھیں ضرور عذاب دیں گے) کے بجائے {’’ فَلَنُذِيْقَنَّ ‘‘} (ہم انھیں ضرور چکھائیں گے) کا لفظ استعمال فرمایا، کیونکہ جو چیز چکھی جاتی ہے وہ معمولی سی زبان پر لگتی ہے، تو جس کا معمولی سا لگنا اتنا سخت ہو گا وہ پورا عذاب کس قدر سخت ہو گا۔ ¤ ➌ { وَ لَنَجْزِيَنَّهُمْ اَسْوَاَ الَّذِيْ كَانُوْا يَعْمَلُوْنَ:} کفار نے اگرچہ بے شمار گناہ کیے ہوں گے، مثلاً چوری، زنا وغیرہ، مگر ان کے سب سے برے اعمال کفر و شرک اور دوسروں کو ایمان سے روکنا تھے۔ چنانچہ انھیں ملنے والی سزا کفر و شرک اور ایمان سے روکنے کے پیمانے کے مطابق ہو گی، جس کے مقابلے میں دوسرے گناہوں کی سزا کی کچھ حقیقت نہیں ہو گی۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { ذٰلِكَ جَزَآءُ اَعْدَآءِ اللّٰهِ النَّارُ … :} اللہ کے دشمنوں کی یہی جزا، یعنی اآگ ہے، جنھوں نے کفر و شرک کیا، زبان اور ہاتھ کو ہر طرح سے اس کی کتاب سننے سے روکا، اس کے نبی اور ایمان والوں کا مقابلہ کیا، ان سے جنگ کی اور دشمنی میں کوئی کسر اٹھا نہ رکھی۔ ¤ ➋ { بِاٰيٰتِنَا يَجْحَدُوْنَ:} یعنی اس جزا کی وجہ یہ ہے کہ وہ جانتے تھے کہ ہماری آیات حق ہیں، پھر جان بوجھ کر ضد اور عناد کی وجہ سے ان کا انکار کرتے تھے، پھر اللہ ایسے دشمنوں کو سزا دینے میں کیوں کمی کرے گا؟ {’’جُحُوْدٌ‘‘} کا معنی جانتے ہوئے انکار کرنا ہے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { وَ قَالَ الَّذِيْنَ كَفَرُوْا رَبَّنَاۤ اَرِنَا …:} اس سے پہلے آیت (۲۵) : « وَ قَيَّضْنَا لَهُمْ قُرَنَآءَ …» میں کفار کے اعمالِ بد کی وجہ سے ان پر جن و انس کے وہ قرین مسلط کرنے کا ذکر ہے جو ان کے لیے ان کے برے اعمال خوش نما بنا کر پیش کرتے رہے، حتیٰ کہ ان پر جہنمی ہونے کا ٹھپا پکا ہو گیا۔ اب جہنم میں کفار کی اپنے ان دوستوں کے متعلق خواہش اور اللہ تعالیٰ سے درخواست کا ذکر ہے۔ ¤ ➋ کفار یہ بات جہنم میں جانے کے بعد کہیں گے، مگر اللہ تعالیٰ نے اس کے لیے ماضی کا صیغہ {’’ قَالَ ‘‘} استعمال فرمایا، کیونکہ اللہ تعالیٰ کی بات اتنی یقینی ہے کہ سمجھو یہ کام ہو چکا۔ ¤ ➌ قیامت کے دن جہنمی اپنے گمراہ کرنے والے جن و انس میں سے شیاطین دوستوں پر سخت ناراض ہوں گے اور ان کی خواہش ہو گی کہ انھیں زیادہ سے زیادہ عذاب ہو۔ {’’ اَرِنَا ‘‘} کا لفظی معنی اگرچہ ’’ہمیں دکھا‘‘ ہے، مگر مراد یہ ہے کہ پروردگارا! تو انھیں ہمارے حوالے کر، تاکہ ہم انھیں اپنے قدموں کے نیچے روندیں، تاکہ وہ سب سے نیچے لوگوں میں شامل ہوں۔ ہر کافر خود گمراہ ہونے کے ساتھ دوسروں کو گمراہ کرنے کا مجرم بھی ہے۔ کفار کی یہ خواہش پوری ہو گی یا نہیں، اس کے لیے دیکھیے سورۂ اعراف (۳۸، ۳۹) اور سورۂ ص (۵۵ تا ۶۱)۔ ¤ ➍ اس سے معلوم ہوا کہ قیامت کے دن صرف ایمان والوں کی دوستی باقی رہے گی، دوسرے سب ایک دوسرے میں سے دشمن ہو جائیں گے۔ مزید دیکھیے سورۂ بقرہ (۱۶۶، ۱۶۷) اور سورۂ زخرف (۶۸)۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { اِنَّ الَّذِيْنَ قَالُوْا …:} کفار کے برے عقیدہ و عمل کی وجہ سے ان پر جن و انس کے شیاطین مسلط کرنے اور ان کے برے انجام کے ذکر کے بعد ایمان اور اس پر استقامت اختیار کرنے والوں کی تائید و نصرت کے لیے فرشتے نازل کرنے کا اور ان کے حسن انجام کا ذکر فرمایا۔ ¤ ➋ { رَبُّنَا اللّٰهُ:} ’’ہمارا رب صرف اللہ ہے‘‘ہے‘‘ یہ مختصر سا جملہ معانی کا سمندر ہے۔ مبتدا کے بعد خبر معرفہ ہو تو کلام میں حصر پیدا ہو جاتا ہے، کتبِ بلاغت میں اس کی مشہور مثال {’’صَدِيْقِيْ زَيْدٌ‘‘} ہے، یعنی ’’میرا دوست صرف زید ہے۔‘‘ اس لیے {’’ رَبُّنَا اللّٰهُ ‘‘} کا معنی ہے ’’ہمارا رب صرف اللہ ہے۔‘‘ یہ بات دل سے کہہ لینے کے بعد آدمی کسی اور کو داتا، دستگیر، گنج بخش، غریب نواز، بگڑی بنانے والا اور ڈوبتوں کو پار لگانے والا نہیں مان سکتا۔ پھر اس کی قولی، بدنی اور مالی عبادت، بلکہ پوری زندگی اور موت صرف اللہ کے لیے ہوتی ہے، وہ صرف اسی سے مانگتا اور اسی کے حکم پر چلتا ہے۔ جو وہ کہے کرتا ہے، جس سے روک دے رک جاتا ہے۔ عمل میں کوتاہی ہو سکتی ہے اور گناہ کا ارتکاب بھی ہو سکتا ہے، مگر وہ اسی کے دروازے پر رہتا اور اسی سے معافی مانگتا ہے۔ اللہ تعالیٰ کا فرمان ہے : «قُلْ اِنَّنِيْ هَدٰىنِيْ رَبِّيْۤ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ دِيْنًا قِيَممًا مِّلَّةَ اِبْرٰهِيْمَ حَنِيْفًا وَ مَا كَانَ مِنَ الْمُشْرِكِيْنَ (161) قُلْ اِنَّ صَلَاتِيْ وَ نُسُكِيْ وَ مَحْيَايَ وَ مَمَاتِيْ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ (162) لَا شَرِيْكَ لَهٗ وَ بِذٰلِكَ اُمِرْتُ وَ اَنَا اَوَّلُ الْمُسْلِمِيْنَ (163) قُلْ اَغَيْرَ اللّٰهِ اَبْغِيْ رَبًّا وَّ هُوَ رَبُّ كُلِّ شَيْءٍ » [ الأنعام : ۱۶۱ تا ۱۶۴ ] ’’کہہ دے بے شک مجھے تو میرے رب نے سیدھے راستے کی طرف رہنمائی کر دی ہے، جو مضبوط دین ہے، ابراہیم کی ملت، جو ایک ہی طرف کا تھا اور مشرکوں سے نہ تھا۔ کہہ دے بے شک میری نماز اور میری قربانی اور میری زندگی اور میری موت اللہ کے لیے ہے، جو جہانوں کا رب ہے۔ اس کا کوئی شریک نہیں اور مجھے اسی کا حکم دیا گیا ہے اور میں حکم ماننے والوں میں سب سے پہلا ہوں۔ کہہ دے کیا میں اللہ کے سوا کوئی اور رب تلاش کروں، حالانکہ وہ ہر چیز کا رب ہے۔‘‘ ¤ {’’ رَبُّنَا اللّٰهُ ‘‘} کہنے کے بعد کسی اور کی عبادت، اس کا دین یا اس کا بتایا ہوا زندگی گزارنے کا طریقہ اختیار کرنے کی گنجائش ختم ہو جاتی ہے۔ اقبال نے اسی لیے کہا ہے: ¤ چوں می گویم مسلمانم بلرزم ¤ کہ دانم مشکلاتِ لا الٰہ را ¤ ’’جب میں کہتا ہوں کہ میں مسلمان ہوں تو لرز جاتا ہوں، کیونکہ میں {’’لا الٰه ‘‘} کی مشکلات کو جانتا ہوں۔‘‘ ¤ ➌ { ثُمَّ اسْتَقَامُوْا:} اس میں سین اور تاء مبالغے کے لیے ہے، یعنی پھر اس پر خوب قائم رہے اور موت تک ڈٹے رہے، کوئی خوف یا لالچ انھیں اس عقیدے اور عمل سے نہ پھیر سکا، جیسا کہ فرمایا : « وَ اعْبُدْ رَبَّكَ حَتّٰى يَاْتِيَكَ الْيَقِيْنُ» [الحجر : ۹۹ ] ’’اور اپنے رب کی عبادت کر، یہاں تک کہ تیرے پاس یقین آ جائے۔‘‘ ¤ طبری نے اسود بن ہلال سے روایت کی ہے کہ ابوبکر صدیق رضی اللہ عنہ نے یہ آیت پڑھی : « اِنَّ الَّذِيْنَ قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْتَقَامُوْا » اور فرمایا : ’’اس آیت کے متعلق تم کیا کہتے ہو؟‘‘ لوگوں نے کہا : [ قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْتَقَامُوْا مِنْ ذَنْبٍ ] ’’انھوں نے {’’ رَبُّنَا اللّٰهُ ‘‘} کہا، پھر گناہ سے بچنے پر ڈٹے رہے۔‘‘ تو انھوں نے فرمایا : [ لَقَدْ حَمَلْتُمُوْهُ عَلٰی غَيْرِ الْمَحْمَلِ، قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْتَقَاامُوْا ثُمَّ لَمْ يَلْتَفِتُوْا إِلٰی إِلٰهٍ غَيْرِهِ ] [ طبري : ۳۰۷۷۰ ]’’تم نے اسے اس کے اصل محمل کے غیر پر محمول کیا ہے، مقصد {’’ قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْتَقَامُوْا ‘‘} کا یہ ہے کہ پھر انھوں نے اس کے سوا کسی اور معبود کی طرف جھانک کر نہیں دیکھا۔‘‘ حاکم نے بھی اسے اسود بن ہلال کے طریق سے روایت کیا ہے اور اسے صحیح کہا ہے۔ ذہبی نے ان کی موافقت کی ہے۔ دیکھیے مستدرک حاکم میں ’’سورۂ حم السجدہ‘‘ کی تفسیر۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل کیا ہے، فرماتے ہیں : {’’قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْتَقَامُوْا عَلٰی أَدَاءِ فَرَائِضِهِ ‘‘} یعنی {’’ ثُمَّ اسْتَقَامُوْا ‘‘} کا مطلب یہ ہے کہ وہ اس کے فرائض کی ادائیگی پر خوب قائم رہے۔ خلاصہ یہ ہے کہ {’’ ثُمَّ اسْتَقَامُوْا ‘‘} کا مطلب یہ ہے کہ وہ موت تک توحید پر خوب قائم رہ کر رسول اللہ صلی اللہ علیہ وسلم کے بتائے ہوئے سیدھے راستے پر چلتے رہے اور فرائض ادا کرتے رہے، اگر کوئی کوتاہی یا گناہ ہوا بھی ہو تو انھوں نے توحید و سنت کا دامن ہاتھ سے نہیں چھوڑا۔ ¤ ➍ سفیان بن عبد اللہ ثقفی رضی اللہ عنہ کہتے ہیں کہ میں نے کہا : [ يَا رَسُوْلَ اللّٰهِ! حَدِّثْنِيْ بِأَمْرٍ أَعْتَصِمُ بِهِ، قَالَ قُلْ رَبِّيَ اللّٰهُ، ثُمَّ اسْتَقِمْ، قَالَ قُلْتُ يَا رَسُوْلَ اللّٰهِ! مَا أَخْوَفُ مَا تَخَافُ عَلَيَّ؟ قَالَ فَأَخَذَ بِلِسَانِ نَفْسِهِ، ثُمَّ قَالَ هٰذَا  ] [مسند أحمد : 413/3، ح : ۱۵۴۲۵ ] ’’یا رسول اللہ! آپ مجھے ایسا کام بتائیں جسے میں مضبوطی سے پکڑ لوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو کہہ، میرا رب صرف اللہ ہے، پھر اس پر خوب قائم رہ۔‘‘ میں نے کہا : ’’یا رسول اللہ! سب سے خوف ناک چیز جس سے آپ میرے بارے میں ڈرتے ہوں، کیا ہے؟‘‘ تو آپ صلی اللہ علیہ وسلم نے اپنی زبان مبارک پکڑ کر فرمایا : ’’یہ (زبان)۔‘‘ مسند احمد کے محقق حضرات نے اسے صحیح کہا ہے۔ صحیح مسلم میں ہے، سفیان بن عبد اللہ ثقفی رضی اللہ عنہ کہتے ہیں کہ میں نے کہا : [ يَا رَسُوْلَ اللّٰهِ! قُلْ لِّيْ فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا بَعْدَكَ، وَ فِيْ حَدِيْثِ أَبِيْ أُسَامَةَ غَيْرَكَ، قَالَ قُلْ آمَنْتُ بِاللّٰهِ ثُمَّ اسْتَقِمْ ] [ مسلم، الإیمان، باب جامع أوصاف الإسلام : ۳۸ ] ’’یا رسول اللہ! آپ مجھے اسلام میں ایسی بات بتا دیں کہ میں اس کے متعلق آپ کے بعد کسی سے نہ پوچھوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو کہہ، میں اللہ پر ایمان لایا، پھر اس پر خوب قائم رہ۔‘‘ اس سے معلوم ہوا کہ {’’ رَبِّيَ اللّٰهُ ‘‘} اور {’’ آمَنْتُ بِاللّٰهِ‘‘} کا مفہوم ایک ہے اور یہ جامع کلمہ ہے، جس میں اسلام کے تمام ارکان آ گئے ہیں، جیسا کہ امام نووی رحمہ اللہ کے صحیح مسلم پر باب کے الفاظ سے ظاہر ہے۔ ¤ ➎ {تَتَنَزَّلُ عَلَيْهِمُ الْمَلٰٓىِٕكَةُ …:} ان پر فرشتے نازل ہوتے ہیں کہ نہ ڈرو اور نہ غم کرو۔ بہت سے مفسرین نے فرمایا کہ {’’ رَبُّنَا اللّٰهُ ‘‘} کہہ کر استقامت اختیار کرنے والوں پر فرشتوں کا نزول موت کے وقت ہوتا ہے، پھر قبر میں اور آخر میں حشر کے دن ہو گا، حالانکہ آیت کے الفاظ عام ہیں۔ ان حضرات کی اس تفسیر کی وجہ یہ ہے کہ دنیا میں ایمان والوں پر فرشتوں کا نزول نظر نہیں آتا، وہ موت کے وقت نظر آنا شروع ہوتے ہیں۔ مگر حقیقت یہ ہے کہ اگرچہ وہ نظر نہیں آتے، مگر یقینا دنیا میں بھی اہلِ استقامت پر فرشتوں کا نزول ہوتا ہے، جس سے ان کے دلوں میں سکون و اطمینان پیدا ہوتا ہے، ایمان اور میدان میں انھیں استقامت اور ثابت قدمی حاصل ہوتی ہے اور وہ ان کے دلوں میں نیکی کی رغبت، برائی سے نفرت اور بہترین خیالات پیدا ہونے کا باعث بنتے ہیں، جیسا کہ بدر میں فرشتے نازل ہوئے، فرمایا : « اِذْ تَسْتَغِيْثُوْنَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ اَنِّيْ مُمِدُّكُمْ بِاَلْفٍ مِّنَ الْمَلٰٓىِٕكَةِ مُرْدِفِيْنَ (9) وَ مَا جَعَلَهُ اللّٰهُ اِلَّا بُشْرٰى وَ لِتَطْمَىِٕنَّ بِهٖ قُلُوْبُكُمْ وَ مَا النَّصْرُ اِلَّا مِنْ عِنْدِ اللّٰهِ اِنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ » [ الأنفال : ۹، ۱۰ ] ’’جب تم اپنے رب سے مدد مانگ رہے تھے تو اس نے تمھاری دعا قبول کر لی کہ بے شک میں ایک ہزار فرشتوں کے ساتھ تمھاری مدد کرنے والا ہوں، جو ایک دوسرے کے پیچھے آنے والے ہیں۔ اور اللہ نے اسے نہیں بنایا مگر ایک خوش خبری اور تاکہ اس کے ساتھ تمھارے دل مطمئن ہوں اور مدد نہیں ہے مگر اللہ کے پاس سے۔ بے شک اللہ سب پر غالب، کمال حکمت والا ہے۔‘‘ اور فرمایا : « اِذْ يُوْحِيْ رَبُّكَ اِلَى الْمَلٰٓىِٕكَةِ اَنِّيْ مَعَكُمْ فَثَبِّتتُوا الَّذِيْنَ اٰمَنُوْا سَاُلْقِيْ فِيْ قُلُوْبِ الَّذِييْنَ كَفَرُوا الرُّعْبَ فَاضْرِبُوْا فَوْقَ الْاَعْنَاقِ وَ اضْرِبُوْا مِنْهُمْ كُلَّ بَنَانٍ» [ الأنفال : ۱۲ ] ’’جب تیرا رب فرشتوں کی طرف وحی کر رہا تھا کہ میں تمھارے ساتھ ہوں، پس تم ان لوگوں کو جمائے رکھو جو ایمان لائے ہیں، عنقریب میں ان لوگوں کے دلوں میں جنھوں نے کفر کیا، رعب ڈال دوں گا۔ پس ان کی گردنوں کے اوپر ضرب لگاؤ اور ان کے ہر ہر پور پر ضرب لگاؤ۔‘‘ ¤ فرشتے ایمان والوں پر اترتے ہیں مگر ایک آدھ استثنائی صورت کے علاوہ رسول کے سوا کسی کو نظر نہیں آتے اور جب تک یہ مادی زندگی ختم نہیں ہو جاتی اور مادیت کے پردے چاک نہیں ہو جاتے تب تک فرشتوں کا نزول اسی صورت میں ہوتا ہے۔ البتہ مرنے کے ساتھ ہی جب یہ پردے اور حجاب اٹھ جائیں گے تو فرشتے موت کے وقت، پھر قبر میں، پھر قیامت میں ہر جگہ یقینا انسانوں کو نظر آئیں گے اور ایمان والوں کو ان الفاظ میں تسلی دیں گے جن کا ان آیات میں ذکر ہے۔ دنیا میں اگر فرشتے نظر آنا شروع ہو جائیں تو امتحان کا مقصد فوت ہو جاتا ہے، اس لیے یہاں وہ اسی وقت عام لوگوں کو نظر آتے ہیں جب وہ عذاب لے کر آتے ہیں اور امتحان کا سلسلہ ختم ہو جاتا ہے۔ دیکھیے سورۂ حجر کی آیت (۸) کی تفسیر۔ ¤ فرشتوں کا ایمان والوں پر اترنا ایسے ہی ہے جیسے کفار اور خبیث لوگوں پر شیاطین کا نزول ہے کہ وہ ان کے دلوں میں گندے خیالات اور فاسد عقائد ڈالتے اور برائی پر ابھارتے ہیں۔ اللہ تعالیٰ نے فرمایا :  : «هَلْ اُنَبِّئُكُمْ عَلٰى مَنْ تَنَزَّلُ الشَّيٰطِيْنُ (221) تَنَزَّلُ عَلٰى كُلِّ اَفَّاكٍ اَثِيْمٍ (222) يُّلْقُوْنَ السَّمْعَ وَ اَكْثَرُهُمْ كٰذِبُوْنَ » [ الشعراء : ۲۲۱ تا ۲۲۳ ] ’’کیا میں تمھیں بتاؤں شیاطین کس پر اترتے ہیں۔ وہ ہر زبردست جھوٹے، سخت گناہ گار پر اترتے ہیں۔ وہ سنی ہوئی بات لا ڈالتے ہیں اور ان کے اکثر جھوٹے ہیں۔‘‘ اور فرمایا : « وَ اِنَّ الشَّيٰطِيْنَ لَيُوْحُوْنَ اِلٰۤى اَوْلِيٰٓـِٕهِمْ۠ لِيُجَادِلُوْكُمْ » [ الأنعام : ۱۲۱ ] ’’اور بے شک شیطان اپنے دوستوں کے دلوں میں ضرور باتیں ڈالتے ہیں، تاکہ وہ تم سے جھگڑا کریں۔‘‘ اور فرمایا : « وَ اِذْ زَيَّنَ لَهُمُ الشَّيْطٰنُ اَعْمَالَهُمْ وَ قَالَ لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ وَ اِنِّيْ جَارٌ لَّكُمْ» [ الأنفال : ۴۸ ] ’’ اور جب شیطان نے ان کے لیے ان کے اعمال خوش نما بنا دیے اور کہا آج تم پر لوگوں میں سے کوئی غالب آنے والا نہیں اور یقینا میں تمھارا حمایتی ہوں۔‘‘ ¤ ➏ { اَلَّا تَخَافُوْا وَ لَا تَحْزَنُوْا:} مفسر عبد الرحمن کیلانی لکھتے ہیں : ’’یعنی جب فرشتے ڈٹ جانے والوں پر نازل ہوتے ہیں تو انھیں یہ تلقین کرتے ہیں یا ان کے دل میں یہ بات ڈالتے ہیں کہ باطل کی طاقتیں خواہ کتنی ہی چیرہ دست ہوں ان سے خوف زدہ ہونے کی قطعاً کوئی ضرورت نہیں اور حق پرستی کی وجہ سے جو مظالم تم پر ڈھائے جا رہے ہیں ان پر رنج نہ کرو، کیونکہ اللہ نے تمھارے لیے ایسی جنت تیار کر رکھی ہے جس کے مقابلے میں دنیا کی سب نعمتیں ہیچ ہیں۔ اور موت کے وقت بھی فرشتے ہر مومن سے یہی کلمات کہتے ہیں، اس وقت وہ فرشتوں کو دیکھتا بھی ہے اور ان کی بات سمجھتا بھی ہے، تو اس وقت ان کا مطلب یہ ہوتا ہے کہ آگے جس منزل کی طرف تم جا رہے ہو اس سے خوف زدہ ہونے کی کوئی وجہ نہیں، کیونکہ جنت تمھاری منتظر ہے اور دنیا میں جنھیں تم چھوڑ کر جا رہے ہو ان کے لیے بھی رنجیدہ ہونے کی ضرورت نہیں، کیونکہ ہم تمھارے ولی اور رفیق ہیں۔‘‘ ( تیسیر القرآن) ¤ ➐ دنیا میں انسانوں کے ساتھ کئی طرح کے فرشتے مقرر ہیں، جن میں کراماً کاتبین بھی ہیں (دیکھیے انفطار : ۱۰ تا ۱۲) اور آفات و مصائب سے حفاظت کرنے والے فرشتے بھی۔ (دیکھیے رعد : ۱۱) یہ فرشتے مومن و کافر سب کے ساتھ ہیں، مگر جن فرشتوں کا ان آیات میں ذکر ہے یہ صرف اہلِ ایمان و استقامت کے ساتھ خاص ہیں، انھی پر اترتے ہیں اور انھی کو حوصلہ دیتے، نیکیوں کی رغبت دلاتے اور خیر کا الہام کرتے ہیں۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ {نَحْنُ اَوْلِيٰٓؤُكُمْ فِي الْحَيٰوةِ الدُّنْيَا وَ فِي الْاٰخِرَةِ:} دنیا میں دوستی یہ کہ ہم تمھارے لیے دعائیں کرتے ہیں (دیکھیے مومن : ۷)، تمھیں نیکی کا الہام کرتے ہیں اور دشمنوں کے مقابلے میں تمھاری مدد کرتے ہیں اور آخرت میں یہ کہ جب متقی لوگوں کے سوا سب ایک دوسرے کے دشمن بن جائیں گے، تو ہماری دوستی تمھارے ساتھ قائم رہے گی، ہم آنے والے ہر مرحلے میں تمھارے ساتھی اور مددگار رہیں گے اور تمھیں حفاظت سے جنت میں پہنچائیں گے۔ فرشتے ہر مومن کو اس کی موت کے وقت یہ بشارت دیتے ہیں۔ ¤ ➋ {وَ لَكُمْ فِيْهَا مَا تَشْتَهِيْۤ اَنْفُسُكُمْ وَ لَكُمْ فِيْهَا مَا تَدَّعُوْنَ: ’’ مَا تَدَّعُوْننَ ‘‘ ’’دَعَا يَدْعُوْ‘‘} سے باب افتعال ہے، جو تم طلب کرو گے، مانگو گے۔ جنت کی نعمتوں کے لیے دیکھیے سورۂ سجدہ کی آیت (۱۷) کی تفسیر۔ « مَا تَشْتَهِيْۤ اَنْفُسُكُمْ » (جو تمھارے دل چاہیں گے) سے مراد وہ چیزیں ہیں جو ان کی ذاتی خواہش ہوں گی اور {’’ مَا تَدَّعُوْنَ ‘‘} (جو تم مانگو گے) کا لفظ عام ہے، اس میں ذاتی خواہش کی اشیا بھی شامل ہیں اور وہ بھی جو ان کی ذاتی خواہش نہیں بلکہ مثال کے طور پر کسی اور کی خاطر طلب کریں گے۔ (ابو السعود)"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) {نُزُلًا مِّنْ غَفُوْرٍ رَّحِيْمٍ:} اس آیت کی تفسیر کے لیے دیکھیے سورۂ سجدہ کی آیت (۱۹) کی تفسیر۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ { وَ مَنْ اَحْسَنُ قَوْلًا مِّمَّنْ دَعَاۤ اِلَى اللّٰهِ … :} پچھلی آیات میں ایمان لا کر اس پر استقامت اختیار کرنے والوں کو فرشتوں کے نزول، دنیا و آخرت میں ان کی دوستی، جنت میں داخلے اور غفور و رحیم کی مہمانی کی بشارت دے کر ان کے قلبی سکون و اطمینان اور دلی راحت کا سامان فرمایا، اب ایک ایسے کام کا ذکر فرمایا جو {’’ رَبُّنَا اللّٰهُ ‘‘} کہنے کا فطری تقاضا ہے کہ وہ اس نعمت کو اپنے تک محدود نہیں رکھتے، بلکہ ان کی کوشش اسے دنیا کے تمام لوگوں تک پہنچانے کی ہوتی ہے۔ ان کی خواہش ہوتی ہے کہ جو نعمت انھیں عطا ہوئی ہے وہ ہر شخص کو عطا ہو جائے۔ یہ کام سرانجام دیتے ہوئے جب وہ تین باتوں کا اہتمام کریں تو بات میں ان سے بہتر اور درجے میں ان سے بلند کوئی نہیں ہو سکتا۔ پہلی بات {’’ دَعَاۤ اِلَى اللّٰهِ ‘‘} یعنی وہ صرف اللہ کی طرف بلائیں۔ نہ اپنی ذات کی طرف، نہ کسی شخصیت کی طرف اور نہ کسی قبیلے، جماعت، نسل یا وطن کی طرف، بلکہ ان کی دعوت صرف اللہ تعالیٰ کی طرف ہو کہ سب اسی کے بندے اور فرماں بردار بن جاؤ، جیسا کہ فرمایا : « قُلْ هٰذِهٖ سَبِيْلِيْۤ اَدْعُوْۤا اِلَى اللّٰهِ عَلٰى بَصِيْرَةٍ اَنَا وَ مَنِ اتَّبَعَنِيْ وَ سُبْححٰنَ اللّٰهِ وَ مَاۤ اَنَا مِنَ الْمُشْرِكِيْنَ» [ یوسف : ۱۰۸ ] ’’کہہ دے یہی میرا راستہ ہے، میں اللہ کی طرف بلاتا ہوں، پوری بصیرت پر، میں اور وہ بھی جنھوں نے میری پیروی کی ہے اور اللہ پاک ہے اور میں شریک بنانے والوں سے نہیں ہوں۔‘‘ یہ پیغمبروں کا اور ان کے جانشینوں کا کام ہے اور اتنا عظیم کام ہے کہ ان کی دعوت سے جو لوگ راہ ہدایت اختیار کریں گے ان کا اجر ان کے علاوہ انھیں بھی ملے گا۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ دَعَا إِلٰی هُدًی كَانَ لَهُ مِنَ الْأَجْرِ مِثْلُ أُجُوْرِ مَنْ تَبِعَهُ، لَا  يَنْقُصُ ذٰلِكَ مِنْ أُجُوْرِهِمْ شَيْئًا، وَمَنْ دَعَا إِللٰی ضَلَالَةٍ، كَانَ عَلَيْهِ مِنَ الْإِثْمِ مِثْلُ آثَامِ مَنْ تَبِعَهُ، لَا يَنْقُصُ ذٰلِكَ مِنْ آثَامِهِمْ شَيْئًا ] [ مسلم، العلم، باب من سن سنۃ حسنۃ أو سیئۃ… : ۲۶۷۴ ] ’’جو شخص ہدایت کی کسی بات کی طرف دعوت دے اس کے لیے ان لوگوں کے اجروں جیسا اجر ہو گا جو اس کی پیروی کریں گے، یہ ان کے اجروں میں کوئی کمی نہیں کرے گا اور جو شخص گمراہی کی کسی بات کی طرف دعوت دے اس پر ان لوگوں کے گناہوں جیسا گناہ ہو گا جو اس کی پیروی کریں گے، یہ ان کے گناہوں میں کوئی کمی نہیں کرے گا۔‘‘ ¤ یہی وجہ ہے کہ پوری امت مل کر بھی رسول کریم صلی اللہ علیہ وسلم کے درجے کو نہیں پا سکتی، نہ ہی صحابہ کرام رضی اللہ عنھم کے بعد آنے والے ان کے درجے تک پہنچ سکتے ہیں، یہی حال بعد میں دعوت الی اللہ دینے والوں کا ہے۔ پھر بات میں ان سے بہتر کون ہو سکتا ہے جسے ان اعمال کا اجر بھی مل رہا ہو جو اس نے نہیں کیے۔ کوئی شخص خود کتنا بھی عمل کر لے یہ مقام کیسے حاصل کر سکتا ہے؟ ¤ ➋ اللہ تعالیٰ کی طرف دعوت زبان کے ساتھ بھی ہے اور ہاتھ کے ساتھ بھی۔ ہمارے نبی صلی اللہ علیہ وسلم کو قرآن کے ساتھ تلوار دے کر بھیجا گیا، آپ کے اصحاب نے آپ کا ساتھ دیا، پھر زبانی دعوت اور جہاد فی سبیل اللہ کے ساتھ اسلام مشرق سے مغرب تک پھیل گیا۔ یہی مناسبت ہے : « هُوَ الَّذِيْۤ اَرْسَلَ رَسُوْلَهٗ بِالْهُدٰى وَ دِيْنِ الْحَقِّ لِيُظْهِرَهٗ عَلَى الدِّيْنِ كُلِّهٖ وَ كَفٰى بِاللّٰهِ شَهِيْدًا » [ الفتح : ۲۸ ] کے بعد : « مُحَمَّدٌ رَّسُوْلُ اللّٰهِ وَ الَّذِيْنَ مَعَهٗۤ اَشِدَّآءُ عَلَى الْكُفَّارِ رُحَمَآءُ بَيْنَهُمْ …» [الفتح : ۲۹ ] میں۔ مزید دیکھیے سورۂ آل عمران (۱۰۴، ۱۱۰)۔ ¤ ➌ قول میں سب سے بہتر ہونے کے لیے دوسری ضروری بات {’’ وَ عَمِلَ صَالِحًا ‘‘} ہے، یعنی اللہ کی طرف دعوت دینے کے ساتھ وہ خود بھی عمل صالح کریں۔ صالح عمل کا مطلب یہ ہے کہ وہ خالص اللہ کے لیے ہو اور رسول اللہ صلی اللہ علیہ وسلم کے بتائے ہوئے طریقے کے مطابق ہو۔ (دیکھیے سورۂ کہف کی آخری آیت) جو شخص دوسروں کو دعوت دے مگر خود اس کے خلاف عمل کرے اس کے لیے شدید وعید آئی ہے۔ دیکھیے سورۂ بقرہ (۴۴)۔ ¤ ➍ تیسری بات {’’ وَ قَالَ اِنَّنِيْ مِنَ الْمُسْلِمِيْنَ ‘‘} یعنی وہ ڈنکے کی چوٹ یہودی، نصرانی، ہندو، سکھ، کمیونسٹ، ڈیموکریٹ اور لبرل وغیرہ ہونے کے بجائے اپنے مسلم ہونے کا اعلان کرے، اس پر فخر کرے اور کسی ملامت کرنے والے کی ملامت کی پروا نہ کرے۔ {’’ مِنَ الْمُسْلِمِيْنَ ‘‘} یعنی مسلمانوں کی جماعت کا فرد ہونے پر اسے خوشی ہو اور کسی دین، مذہب، ملت یا معاشرے کو اسلام اور مسلمانوں سے بہتر نہ سمجھے۔ آج کل کے بعض ملحدوں کی طرح نہیں جو مسلمانوں میں پیدا ہو گئے، مگر وہ کفار سے اس قدر مرعوب ہیں کہ بعض اوقات یہاں تک کہہ دیتے ہیں کہ ہم بدقسمتی سے مسلمانوں میں پیدا ہو گئے۔ ایک شاعر نے کیا خوب کہا ہے : ¤ نہ بہ نظم شاعرِ خوش غزل، نہ بہ نثرِ ناثرِ بے بدل ¤ بہ غلامیٔ شہِ عزوجل و بعاشقیٔ نبی خوشم ¤ ’’نہ کسی خوب صورت غزل والے شاعر کی نظم پر اور نہ کسی بے مثال نثر لکھنے والے کی نثر پر، بلکہ میں کائنات کے بادشاہ عز و جل کی غلامی پر اور نبی صلی اللہ علیہ وسلم کی محبت پر خوش ہوں۔‘‘ ¤ عباس بن عبد المطلب رضی اللہ عنہ بیان کرتے ہیں کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : [ ذَاقَ طَعْمَ الْإِيْمَانِ مَنْ رَضِيَ بِاللّٰهِ رَبًّا وَ بِالإِْسْلاَمِ دِيْنًا وَبِمُحَمَّدٍ رَسُوْلًا ] [ مسلم، الإیمان، باب الدلیل علٰی أن من رضي باللہ ربا… : ۳۴۔ ترمذي : ۲۶۲۳ ] ’’اس شخص نے ایمان کا ذائقہ چکھ لیا جو اللہ کے رب ہونے پر، اسلام کے دین ہونے پر اور محمد صلی اللہ علیہ وسلم کے رسول ہونے پر راضی ہو گیا۔‘‘"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ {وَ لَا تَسْتَوِي الْحَسَنَةُ … :} اس آیت میں دعوت کے مخاطب لوگوں کی زیادتی اور برائی کا جواب دینے کا طریقہ سکھایا گیا ہے۔ عام طور پر {’’ وَ لَا السَّيِّئَةُ ‘‘} کے{’’ لَا ‘‘} کو زائد کہہ کر ترجمہ کیا جاتا ہے کہ ’’نیکی اور برائی برابر نہیں۔‘‘ بعض حضرات اسے زائد برائے تاکید کہہ دیتے ہیں، حالانکہ قرآن مجید کے کسی لفظ بلکہ حرف کو زائد کہنے کے بجائے وہ فائدہ سمجھنے کی کوشش ضروری ہے جس کے لیے وہ لفظ لایا گیا ہے، جو بظاہر زائد ہے۔ کیونکہ یہ اللہ کا کلام ہے اور اللہ تعالیٰ بہت بلند ہے اس بات سے کہ بلا ضرورت کوئی لفظ لائے۔ اصل میں یہاں بات بیان ہو رہی ہے کہ نیکی برابر نہیں، نہ اپنی جنس کے افراد کے لحاظ سے، کیونکہ نیکیوں کے بے شمار درجے ہیں، کوئی کمتر درجے کی نیکی، کوئی اس سے برتر اور کوئی سب سے برتر، جیسا کہ حدیث میں ہے : [ فَأَدْنَاهَا إِمَاطَةُ الْأَذٰی عَنِ الطَّرِيْقِ وَأَرْفَعُهَا قَوْلُ لاَ إِلٰهَ إِلاَّ اللّٰهُ ] [ ترمذي، الإیمان، باب في استکمال الإیمان… : ۲۶۱۴ ] ’’سب سے کمتر نیکی راستے سے تکلیف دہ چیز ہٹانا اور سب سے اونچی لا الٰہ الا اللہ کہنا۔‘‘ اور نہ ہی ایک نیکی اپنے درجات کے اعتبار سے برابر ہے، مثلاً کسی کے ساتھ حسن سلوک کے کئی درجے ہیں۔ اسی طرح ایک ہی نیکی اپنے کرنے والوں کے مختلف ہونے کے لحاظ سے بھی برابر نہیں، کوئی اسے خالص نیت سے کرتا ہے اور کوئی ریا سے، کوئی پوری کوشش سے کرتا ہے، کوئی درمیانی کوشش سے اور کوئی بے دلی سے۔ غرض کوئی بھی نیکی نہ دوسری نیکیوں کے ساتھ برابر ہے، نہ اپنی ذات میں برابر ہے اور نہ کرنے والوں کے لحاظ سے برابر ہے۔ ¤ ➋ { وَ لَا السَّيِّئَةُ:} برائی کا بھی یہی حال ہے کہ وہ برابر نہیں۔ زبانی دشمنی اور تیر تلوار کے ساتھ دشمنی میں فرق ہے، ابوطالب اور ابوجہل کے کفر میں فرق ہے۔ اس لیے آیت کا ترجمہ یہ ہے کہ ’’اور نہ نیکی برابر ہوتی ہے اور نہ برائی۔‘‘ شاہ عبد القادر اور شاہ رفیع الدین دونوں کے ترجمہ میں یہ بات ملحوظ رکھی گئی ہے۔ ¤ ➌ { اِدْفَعْ بِالَّتِيْ هِيَ اَحْسَنُ:} یعنی برائی کا جواب صرف یہ نہیں کہ نیکی کے ساتھ دو، بلکہ اس طریقے سے دو جو سب سے اچھا ہے اور نیکی کا سب سے اونچا درجہ ہے۔ یہ سب سے اچھا طریقہ بعض اوقات اچھی بات اور اچھا لہجہ ہوتا ہے، جیسا کہ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل فرمایا ہے : [ أَمَرَ اللّٰهُ الْمُؤْمِنِيْنَ بِالصَّبْرِ عِنْدَ الْغَضَبِ، وَ الْحِلْمِ وَالْعَفْوِ عِنْدَ الْإِسَائَةِ، فَإِذَا فَعَلُوْا ذٰلِكَ عَصَمَهُمُ اللّٰهُ مِنَ الشَّيْطَانِ، وَخَضَعَ لَهُمْ عَدُوُّهُمْ، كَأَنَّهُ وَلِيٌّ حَمِيْمٌ ] [ طبري : ۳۰۷۹۴۔ السنن الکبرٰی للبیہقي : 45/7، ح : ۱۳۶۸۰ ] ’’اللہ تعالیٰ نے ایمان والوں کو غصے کے وقت صبر کا اور بدسلوکی کے وقت حلم اور عفو کا حکم دیا، تو جب وہ ایسا کریں گے اللہ تعالیٰ انھیں شیطان سے بچائے گا اور ان کا دشمن ان کے لیے زیر ہو جائے گا، گویا کہ وہ دلی دوست ہے۔‘‘ اور بعض اوقات سب سے اچھا طریقہ خوش اخلاقی اور بہترین بات کے ساتھ ساتھ جہاد بالید ہوتا ہے، جس کی وجہ سے اللہ تعالیٰ نے امتِ مسلمہ کو سب سے بہتر امت قرار دیا (دیکھیے آل عمران : ۱۱۰) اور جس کی وجہ سے بڑے بڑے دشمن دلی دوست بن جاتے ہیں، جیسے ثمامہ بن اثال، ابوسفیان، صفوان بن امیہ، حارث بن ہشام رضی اللہ عنھم اور بے شمار کفار جو جہاد کی برکت سے جگری دوست بن گئے۔ آج بھی جب تک کافر ملکوں کے فرماں رواؤں کی گردنوں کے سریے کاٹ کر انھیں ثمامہ بن اثال رضی اللہ عنہ کی طرح مسجد نبوی کے ستون سے باندھ کر اسلام کی تعلیمات کا آنکھوں سے مشاہدہ نہ کروایا جائے ان کا مسلمان ہونا یا دلی دوست بننا مشکل ہے۔ (مزید دیکھیے رعد : ۲۲) مومن نرم دم گفتگو، گرم دم جستجو ہوتا ہے۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ {وَ مَا يُلَقّٰىهَاۤ اِلَّا الَّذِيْنَ صَبَرُوْا:} یعنی برائی کا جواب سب سے اچھے طریقے کے ساتھ دینے کی توفیق انھی لوگوں کو عطا کی جاتی ہے جنھوں نے اس سے پہلے بھی صبر کی عادت اپنائی ہوتی ہے۔ {’’ صَبَرُوْا ‘‘} ماضی کا صیغہ ہے۔ ¤ ➋ {وَ مَا يُلَقّٰىهَاۤ اِلَّا ذُوْ حَظٍّ عَظِيْمٍ:} یعنی یہ خوبی کہ برائی کا جواب سب سے اچھے طریقے کے ساتھ دیں، صرف انھی لوگوں کو عطا کی جاتی ہے جو بہت بڑے نصیب والے ہوں۔ معلوم ہوا یہ حوصلہ انسان کے بس کی بات نہیں، محض اللہ تعالیٰ کی عطا ہے، اس لیے اپنی کوشش کے ساتھ ساتھ اسی سے صبر اور حوصلے کی دعا کرنا لازم ہے۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {وَ اِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ … : ’’ نَزْغٌ ‘‘} کا لفظی معنی ’’کسی سوئی یا نوک دار چیز کے ساتھ چوکا مارنا‘‘ ہے، مراد شیطان کا غصہ دلا کر برانگیختہ کر دینا ہے۔ اس آیت کی تفسیر سورۂ اعراف (۲۰۰) اور سورۂ مومنون (۹۶ تا ۹۸) میں گزر چکی ہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ {وَ مِنْ اٰيٰتِهِ الَّيْلُ وَ النَّهَارُ … :} اس سے پہلی آیات میں اللہ تعالیٰ کی طرف دعوت کو سب سے اچھی بات قرار دیا، اب اللہ تعالیٰ کی طرف دعوت کے لیے چند اور چیزیں بطور دلیل ذکر فرمائیں، جن میں سے بعض آسمان سے تعلق رکھتی ہیں اور بعض زمین سے اور واضح فرمایا کہ یہ سب اللہ تعالیٰ کی توحید اور اس کی قدرت کی نشانیاں ہیں۔ ¤ ➋ انسان کو نظر آنے والی اشیا میں سے سب سے عظیم اور سب سے روشن چیزیں سورج اور چاند ہیں، اس لیے بہت سے لوگ انھی کو رب تعالیٰ سمجھ بیٹھے۔ بعض نے انھیں اللہ تعالیٰ کا مظہر سمجھا کہ اللہ تعالیٰ ان کی صورت میں ظاہر ہوا ہے اور ان کی پرستش اور انھیں سجدہ کرنے لگے، جیسے صابی اور پارسی لوگ ہیں۔ ابراہیم علیہ السلام کی قوم شرک کی متعدد صورتوں میں مبتلا تھی، وہ دیگر چیزوں کے ساتھ ساتھ سورج، چاند اور ستاروں کی بھی پرستش کرتی تھی۔ ابراہیم علیہ السلام نے نہایت حکمت کے ساتھ ان کا بے اختیار ہونا اور رب نہ ہونا واضح فرمایا۔ ( دیکھیے سورۂ انعام : ۷۶ تا ۸۲) زیر تفسیر آیات سے ان مشرکین کا رد مقصود ہے۔ چنانچہ بتایا کہ رات دن اور سورج چاند اللہ تعالیٰ کے وجود اور اس کی قدرت کی نشانیوں اور دلیلوں میں سے ہیں۔ سورج اور چاند سے پہلے رات اور دن کا ذکر اس لیے فرمایا کہ رات کو سورج کا چھپنا اور چاند کا نکل آنا اور دن کو چاند کا چھپنا اور سورج کا نمودار ہو جانا صاف دلالت کر رہا ہے کہ ان دونوں میں سے کوئی بھی رب یا رب تعالیٰ کا مظہر نہیں کہ اس کی صورت میں وہ خود ظاہر ہو رہا ہے، بلکہ یہ دونوں مجبور اور لاچار پیدا کیے گئے ہیں، جو رب تعالیٰ کے فرمان کے تحت مسخر ہیں اور اپنی گردش اور طلوع و غروب میں اس کے حکم کے پابند ہیں۔ اگر یہ خود رب ہوتے تو دن کے وقت کا سورج رات اور چاند کو نہ آنے دیتا، اسی طرح رات دن کے مقابلے میں ڈٹ جاتی اور اسے قدم نہ رکھنے دیتی، مگر ان سب کا بے اختیار ہو کر گردش کرتے چلے جانا اور ان میں کبھی کسی حادثے کا رونما نہ ہونا اکیلے رب تعالیٰ کے وجود کی دلیل ہے، جو ہر چیز کو اپنی حکمت کے تحت چلا رہا ہے۔ ¤ ➌ رات دن کے اللہ تعالیٰ کی نشانیاں ہونے اور ان آیات کے حوالے کے لیے جن میں اس کی تفصیل ہے، دیکھیے سورۂ بنی اسرائیل کی آیت (۱۲) کی تفسیر۔ ¤ ➍ { لَا تَسْجُدُوْا لِلشَّمْسِ وَ لَا لِلْقَمَرِ … :} اس سے معلوم ہوا کہ مخلوق کو سجدہ کرنا حرام ہے، سجدہ صرف اللہ کے لیے ہے جس نے یہ سب کچھ پیدا فرمایا۔ ¤ ➎ { اِنْ كُنْتُمْ اِيَّاهُ تَعْبُدُوْنَ:} کچھ لوگ عقلی ڈھکوسلے گھڑتے ہوئے کہتے ہیں کہ ہم ان چیزوں کو سجدہ نہیں کرتے بلکہ ان کے واسطے سے اللہ ہی کو سجدہ کرتے ہیں، جیسا کہ مشرکین کہتے تھے : « مَا نَعْبُدُهُمْ اِلَّا لِيُقَرِّبُوْنَاۤ اِلَى اللّٰهِ زُلْفٰى » [ الزمر : ۳ ] ’’ہم ان کی عبادت نہیں کرتے مگر اس لیے کہ یہ ہمیں اللہ سے قریب کر دیں۔‘‘ اس کا جواب دیتے ہوئے فرمایا، اگر تم واقعی اللہ ہی کی عبادت کرتے ہو تو ان واسطوں کی کیا ضرورت ہے، سیدھے اسی کو سجدہ کیوں نہیں کرتے؟ ¤ ➏ سجدۂ عبادت اور سجدۂ تعظیم میں فرق اور سجدۂ تعظیم کی حرمت کے لیے دیکھیے سورۂ بقرہ (۳۴) اور سورۂ یوسف (۱۰۰)۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ {فَاِنِ اسْتَكْبَرُوْا:} ’’پھر اگر وہ تکبر کریں‘‘ یعنی یہ سب کچھ سن کر بھی اگر وہ اپنی بات چھوڑنے کو ذلت سمجھیں، سورج، چاند اور مخلوق کو سجدہ کرنے پر اڑے رہیں اور اپنی جھوٹی عزت اور بڑائی کی وجہ سے جہالت اور شرک پر اصرار کرتے چلے جائیں۔ ¤ ➋ یعنی اگر مشرکین اس قدر مغرور اور متکبر ہو گئے ہیں کہ اکیلے اللہ کو سجدہ کرنا اپنی شان کے خلاف سمجھتے ہیں تو سمجھتے رہیں، اللہ تعالیٰ ان کا محتاج نہیں۔ اس کی عظمت کا تو یہ عالم ہے کہ وہ مقرب ترین فرشتے جو اس کے پاس ہیں، اس کا عرش اٹھائے ہوئے ہیں، یا عرش کے اردگرد یا اس کے نیچے عاجزی سے کھڑے ہیں۔ (دیکھیے مومن : ۷) جن کے ذریعے سے ساری کائنات کے معاملات کی تدبیر ہو رہی ہے۔ وہ سب دن رات اس کی تسبیح کر رہے ہیں، یعنی اس بات کی شہادت دے رہے ہیں اور اس بات کا اعلان کر رہے ہیں کہ ان کا مالک اس سے پاک ہے کہ اس کے رب ہونے میں یا اس کے معبود برحق ہونے میں کوئی اس کا شریک ہو۔ مزید دیکھیے سورۂ انبیاء (۱۹، ۲۰) اور سورۂ اعراف (۲۰۶)۔ اب اگر چند احمق سمجھانے پر نہیں سمجھتے اور ساری کائنات کی شہادت کو رد کرکے اپنی عزت اور بڑائی کے جھوٹے گمان پر اڑے ہوئے ہیں تو وہ اپنا ہی نقصان کریں گے، اللہ تعالیٰ کا کچھ نہیں بگاڑیں گے۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے تسلی بھی ہے۔ ¤ ➌ جو لوگ عرشِ الٰہی کے منکر ہیں اور اللہ تعالیٰ کی ذات کو کائنات سے الگ سب سے بلندی پر نہیں مانتے اور کہتے ہیں کہ اللہ تعالیٰ نہ اوپر ہے نہ نیچے، نہ کائنات کے اندر ہے نہ اس سے باہر، وہ لفظ {’’ فَالَّذِيْنَ عِنْدَ رَبِّكَ ‘‘} (وہ فرشتے جو تیرے رب کے پاس ہیں) کی عجیب و غریب تاویلیں کرتے ہیں۔ کبھی کہتے ہیں، اس کا مطلب یہ ہے کہ وہ رب تعالیٰ کے ہاں بڑا مقام و مرتبہ رکھتے ہیں، کبھی کچھ کہتے ہیں کبھی کچھ، مگر رحمن کے عرش کو فرشتوں کے اٹھائے ہونے کے صریح الفاظ ان کی ایسی تمام تاویلوں کا تار و پود بکھیر دیتے ہیں۔ تفصیل کے لیے دیکھیے سورۂ مومن (۷) اور سورۂ حاقہ (۱۷)۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) {وَ مِنْ اٰيٰتِهٖۤ اَنَّكَ تَرَى الْاَرْضَ خَاشِعَةً … :} اس آیت کی تفسیر کے لیے دیکھیے سورۂ نحل (۶۵) اور سورۂ حج (۵ تا ۷)۔ یہاں بنجر زمین کے لیے {’’ خَاشِعَةً ‘‘} (دبی ہوئی، عاجز) کا لفظ استعمال ہوا ہے، کیونکہ بات ایک اللہ کو سجدے کی ہو رہی ہے، یعنی خشوع کی ہو رہی ہے، جب کہ سورۂ حج میں اسی بنجر زمین کے لیے {’’ هَامِدَةً ‘‘‘} (مردہ) کا لفظ استعمال ہوا ہے، کیونکہ وہاں مرنے کے بعد زندگی کی بات ہو رہی ہے۔ (طنطاوی)"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ {اِنَّ الَّذِيْنَ يُلْحِدُوْنَ فِيْۤ اٰيٰتِنَا: ’’ يُلْحِدُوْنَ ‘‘} کا مادہ {’’لَحْدٌ‘‘} ہے۔ لحد اس قبر کو کہتے ہیں جو نیچے سیدھی کھودنے کے بجائے کچھ نیچے جا کر ایک طرف کھود کر بنائی جاتی ہے۔ {’’ إِلْحَادٌ ‘‘} کا معنی ہے سیدھے راستے سے انحراف، یعنی ایک طرف کو ہٹ جانا، کج روی اور ٹیڑھا چلنا، یعنی جو لوگ حق سے ہٹ کر ٹیڑھی راہ اختیار کرتے ہیں۔ اللہ تعالیٰ کی آیات میں الحاد (ٹیڑھا چلنا) یہ ہے کہ ان کا انکار کر دے، یا ان کا سیدھا سادا اور واضح مطلب لینے کے بجائے غیر متعلق بحثیں کرے اور انھیں غلط مطلب پہنانے کی کوشش کرے۔ جو لوگ مسلمان ہو کر باطل نظریات مثلاً مشرکانہ عقائد، بدعت، انکارِ حدیث، اشتراکیت، سرمایہ داری اور دہریت وغیرہ کے حامی بن جاتے ہیں وہ یہی طرز اختیار کرتے ہیں، خود بھی گمراہ ہوتے ہیں اور دوسروں کو بھی گمراہ کرتے ہیں۔ یہاں آیاتِ الٰہی میں کج روی اختیار کرنے والوں کے لیے وعید آئی ہے اور سورۂ اعراف کی آیت (۱۸۰) میں اسمائے الٰہی میں کج روی اختیار کرنے والوں سے علیحدگی کا حکم اور ایسے لوگوں کا انجام بیان فرمایا ہے۔ ¤ ➋ {لَا يَخْفَوْنَ عَلَيْنَا:} یہ پہلی شدید وعید ہے جو یہاں آیاتِ الٰہی میں ٹیڑھا چلنے والوں کے لیے آئی ہے کہ یہ لوگ ہم پر مخفی نہیں ہیں، بلکہ ہر لمحے ہماری نگاہ میں ہیں اور ہماری گرفت سے بچ کر کہیں نہیں جا سکتے۔ ہم اگر ان کے عذاب میں تاخیر کر رہے ہیں اور انھیں مہلت دے رہے ہیں تو اس لیے کہ جلدی تو وہ کرے جسے خطرہ ہو کہ مجرم رو پوش ہو جائے گا اور قابو سے نکل جائے گا۔ مطلب یہ کہ ہم انھیں اس الحاد کی سزا ضرور دیں گے۔ ¤ ➌ { اَفَمَنْ يُّلْقٰى فِي النَّارِ خَيْرٌ اَمْ مَّنْ يَّاْتِيْۤ اٰمِنًا يَّوْمَ الْقِيٰمَةِ:} یہیہ دوسری دھمکی ہے کہ آیاتِ الٰہی کا مطلب توڑنے مروڑنے والے اور ان کے بارے میں ٹیڑھے چلنے والے آگ میں پھینکے جائیں گے اور آیاتِ الٰہی میں الحاد سے اجتناب کرنے والے قیامت کے دن امن کی حالت میں آئیں گے۔ تو بتاؤ، جو آگ میں پھینکا جائے گا وہ بہتر ہے یا وہ جو قیامت کے دن امن کی حالت میں آئے گا؟ ¤ ➍ {اِعْمَلُوْا مَا شِئْتُمْ …:} یہ تیسری دھمکی ہے، ’’کرو جو چاہو‘‘ کا مطلب اپنی مرضی کرنے کی اجازت دینا نہیں بلکہ ڈانٹ ہے کہ اس مہلت میں تم جو چاہو کر لو، پھر اس کی سزا کے لیے ہم جو چاہیں گے کریں گے۔ تمھارے ہر عمل کو ہم خوب دیکھ رہے ہیں، یہ خیال نہ کرنا کہ تم اپنے کسی عملِ بد کی سزا سے اس لیے بچ جاؤ گے کہ وہ ہماری نگاہ سے اوجھل ہے۔ یہ ایسے ہی ہے جیسے کوئی عظیم فرماں روا اپنے کچھ غلاموں پر ناراض ہو کر شدید غصے سے کہے، جو چاہو کرو۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ {اِنَّ الَّذِيْنَ كَفَرُوْا بِالذِّكْرِ لَمَّا جَآءَهُمْ:} زمخشری نے فرمایا : ’’یہ جملہ {’’ اِنَّ الَّذِيْنَ يُلْحِدُوْنَ فِيْۤ اٰيٰتِنَا ‘‘} سے بدل ہے۔‘‘ (کشاف) اس لیے اس کی خبر وہی ہے جو پہلے جملے کی خبر ہے اور وہ ہے {’’ لَا يَخْفَوْنَ عَلَيْنَا ‘‘} اس صورت میں محذوف خبر نکالنے کی ضرورت نہیں، گویا عبارت اس طرح ہوئی کہ ’’یقینا وہ لوگ جو ہماری آیات کے بارے میں ٹیڑھے چلتے ہیں، جنھوں نے اس نصیحت کا اسی وقت انکار کر دیا جب وہ ان کے پاس آئی، وہ ہم پر مخفی نہیں ہیں۔‘‘ بعض مفسرین نے فرمایا {’’ اِنَّ الَّذِيْنَ كَفَرُوْا بِالذِّكْرِ لَمَّا جَآءَهُمْ ‘‘} کی خبر محذوف ہے، جیسا کہ قرآن مجید میں اس کی متعدد مثالیں موجود ہیں، مقام کی مناسبت سے محذوف خبر {’’ يُجْزَوْنَ عَلٰي كُفْرِهِمْ‘‘} یا اس سے ملتی جلتی ہو گی۔ یعنی وہ لوگ جنھوں نے اس نصیحت کے ساتھ کفر کیا جب وہ ان کے پاس آئی انھیں ان کے کفر کی جزا دی جائے گی۔ ¤ ➋ {’’ بِالذِّكْرِ ‘‘} سے مراد قرآن کریم ہے، جیسا کہ آگے اس کی صفات بیان ہو رہی ہیں۔ ¤ ➌ { لَمَّا جَآءَهُمْ:} یعنی انھوں نے قرآن مجید کی آیات کا نزول ہوتے ہی ان کا انکار کر دیا، غور سے سننے اور سوچنے سمجھنے کی زحمت ہی نہیں کی۔ ¤ ➍ {وَ اِنَّهٗ لَكِتٰبٌ عَزِيْزٌ: ’’ عَزِيْزٌ ‘‘} کے دو معنی ہیں، ایک یہ کہ یہ سب پر غالب ہے، زبان و بیان میں، دلیل و برہان میں، علم و حکمت میں، صدق و حقانیت میں، غرض ہر لحاظ سے یہ دوسری ہر کتاب پر غالب اور زبردست ہے، دوسری سب کتب اس کے مقابلے میں زیر ہیں۔ {’’ عَزِيْزٌ ‘‘} کا دوسرا معنی ہے عدیم النظیر، بے مثال، کیونکہ پوری کائنات اس کی ایک سورت کی مثال لانے سے عاجز ہے۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ { لَّا يَاْتِيْهِ الْبَاطِلُ مِنْۢ بَيْنِ يَدَيْهِ وَ لَا مِنْ خَلْفِهٖ:} اس کے پاس نہ آنے کا مطلب یہ ہے کہ باطل آ کر اس پر غلبہ نہیں پا سکتا، یعنی باطل کی مجال نہیں کہ کسی پہلو سے آ کر اس پر غلبہ پا سکے، نہ کھلم کھلا سامنے آ کر اور نہ چوری چھپے پیچھے سے۔ یہ مطلب بھی ہے کہ پہلے کی کوئی کتاب یا تحقیق اس قرآن کی کسی بات کو غلط یا باطل ثابت نہیں کر سکتی اور نہ ہی بعد کی کوئی کتاب یا تحقیق اس کی کسی بات کو غلط ثابت کر سکے گی، اور یہ مطلب بھی ہے کہ اس میں باطل کی آمیزش نہ کوئی کھلم کھلا کر سکتا ہے نہ چوری چھپے، جیسا پہلی کتابوں کے ساتھ ہوا، بلکہ اس کی حفاظت کا ذمہ اللہ تعالیٰ نے لیا ہے، فرمایا : « اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَ اِنَّا لَهٗ لَحٰفِظُوْنَ» [ الحجر : ۹ ] ’’بے شک ہم نے ہی یہ نصیحت نازل کی ہے اور بے شک ہم اس کی ضرور حفاظت کرنے والے ہیں۔‘‘ ¤ ➋ { تَنْزِيْلٌ مِّنْ حَكِيْمٍ حَمِيْدٍ:} قرآن مجید کی کوئی بات غلط نہیں ہو سکتی، اس میں کسی باطل کی آمیزش نہیں ہو سکتی اور نہ ہی دلیل میں باطل کسی طرح اس پر غالب آ سکتا ہے، کیونکہ یہ حکیم و حمید کی طرف سے تنزیل ہے۔ {’’ تَنْزِيْلٌ ‘‘} کے مفہوم کے لیے دیکھیے سورۂ بنی اسرائیل کی آیت (۱۰۶)۔ یعنی یہ کتاب اس نے تھوڑی تھوڑی کر کے نازل فرمائی ہے جو کمال حکمت والا ہے، ہر تعریف کا مستحق اور ہر خوبی کا مالک ہے۔ {’’ حَكِيْمٍ ‘‘} وہ جس کی کسی تدبیر میں خطا نہ ہو اور{ ’’ حَمِيْدٍ ‘‘} وہ جس کے کسی فعل کی مذمت نہ ہو سکے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ { مَا يُقَالُ لَكَ اِلَّا مَا قَدْ قِيْلَ لِلرُّسُلِ …:} اس میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے کہ اگر کفار مکہ آپ کو جادوگر، شاعر، کاہن، دیوانہ، کذاب، متکبر یا اس قسم کے دوسرے ناموں سے یاد کرکے آپ کو ایذا دیتے ہیں تو آپ اطمینان رکھیں، ان کے رکھے ہوئے ناموں میں سے کوئی ایسی چیز نہیں جس کا طعنہ آپ سے پہلے رسولوں کو نہ مل چکا ہو، نہ آپ پہلے رسول ہیں جسے جھٹلایا گیا ہو اور نہ پہلے شخص ہیں جسے اللہ تعالیٰ کی خاطر تکلیف اٹھانا پڑی ہو۔ سورۂ ذاریات میں فرمایا : « كَذٰلِكَ مَاۤ اَتَى الَّذِيْنَ مِنْ قَبْلِهِمْ مِّنْ رَّسُوْلٍ  اِلَّا قَالُوْا سَاحِرٌ اَوْ مَجْنُوْنٌ (52) اَتَوَاصَوْا بِهٖ بَلْ هُمْ قَوْمٌ طَاغُوْنَ» [الذاریات : ۵۲، ۵۳ ] ’’اسی طرح ان لوگوں کے پاس جو ان سے پہلے تھے، کوئی رسول نہیں آیا مگر انھوں نے کہا یہ جادوگر ہے، یا دیوانہ۔ کیا انھوں نے ایک دوسرے کو اس (بات) کی وصیت کی ہے؟ (نہیں) بلکہ یہ (خود ہی) سرکش لوگ ہیں۔‘‘ کفار کی ایسی تمام باتوں پر رسولوں نے صبر کیا اور پوری ہمت سے اللہ تعالیٰ کا پیغام پہنچاتے رہے، یہی فریضہ آپ کا ہے، فرمایا : « فَاصْبِرْ كَمَا صَبَرَ اُولُوا الْعَزْمِ مِنَ الرُّسُلِ وَ لَا تَسْتَعْجِلْ لَّهُمْ » [ الأحقاف : ۳۵ ] ’’پس صبر کر جس طرح پختہ ارادے والے رسولوں نے صبر کیا اور ان کے لیے جلدی کا مطالبہ نہ کر۔‘‘ ¤ ➋ { اِنَّ رَبَّكَ لَذُوْ مَغْفِرَةٍ وَّ ذُوْ عِقَابٍ اَلِيْمٍ: } یعنی اتنی ایذا اور بدزبانی کے باوجود اگر یہ لوگ توبہ کرکے ایمان لے آئیں تو تیرا رب بڑی مغفرت والا ہے ({مَغْفِرَةٍ } کی تنوین تعظیم کے لیے ہے) اور اگر اپنے کفر پر اصرار کریں تو وہ نہایت دردناک عذاب والا بھی ہے۔ یہ مطلب بھی ہو سکتا ہے کہ انھیں ان کی اس بد زبانی کا بدلا دینا آپ کا کام نہیں ہے، یہ ہمارا اختیار اور ہماری مرضی ہے کہ ہم انھیں ایمان کی توفیق سے نواز کر بخش دیں یا انھیں کفر پر رہنے دیں اور عذابِ الیم چکھائیں، جیسا کہ فرمایا : « لَيْسَ لَكَ مِنَ الْاَمْرِ شَيْءٌ اَوْ يَتُوْبَ عَلَيْهِمْ اَوْ يُعَذِّبَهُمْ فَاِنَّهُمْ ظٰلِمُوْنَ » [ آل عمران  : ۱۲۸ ] ’’تیرے اختیار میں اس معاملے سے کچھ بھی نہیں، یا وہ ان پر مہربانی فرمائے یا انھیں عذاب دے، کیوں کہ بلاشبہ وہ ظالم ہیں۔‘‘"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ { وَ لَوْ جَعَلْنٰهُ قُرْاٰنًا اَعْجَمِيًّا … :} سورت کے شروع میں ذکر فرمایا کہ ’’رحمان و رحیم کی طرف سے یہ ایسی کتاب نازل کی گئی ہے جس کی آیات کھول کر بیان کی گئی ہیں، جو عربی قرآن ہے، ان لوگوں کے لیے جو جانتے ہیں۔‘‘ مشرکینِ مکہ جو عرب تھے ان کا حق تھا کہ اپنی زبان میں اترنے والی کتاب کو سنتے اور اس پر غور و فکر کرتے، تو اس کے نتیجے میں انھیں ایمان کی دولت بھی نصیب ہو جاتی، مگر انھوں نے اپنی زبان میں ہونے کے باوجود اپنے کانوں، آنکھوں اور دلوں کے دریچے اس کے لیے بند کر دیے اور کہنے لگے : « قُلُوْبُنَا فِيْۤ اَكِنَّةٍ مِّمَّا تَدْعُوْنَاۤ اِلَيْهِ وَ فِيْۤ اٰذَانِنَا وَقْرٌ وَّ مِنْۢ بَيْنِنَا وَ بَيْنِكَ حِجَابٌ » [ حٰمٓ السجدۃ : ۵ ] ’’ہمارے دل اس بات سے پردوں میں ہیں جس کی طرف تو ہمیں دعوت دیتا ہے اور ہمارے کانوں میں بھاری بوجھ ہے اور ہمارے درمیان اور تیرے درمیان بھاری پردہ ہے۔‘‘ بلکہ انھوں نے عملاً طے کر لیا کہ یہ عربی قرآن نہ خود سنیں گے اور نہ کسی کو سننے دیں گے، جیسا کہ اسی سورت میں ہے : « وَ قَالَ الَّذِيْنَ كَفَرُوْا لَا تَسْمَعُوْا لِهٰذَا الْقُرْاٰنِ وَ الْغَوْا فِيْهِ لَعَلَّكُمْ تَغْلِبُوْنَ» [حٰمٓ السجدۃ : ۲۶ ] ’’ اور ان لوگوں نے کہا جنھوں نے کفر کیا، اس قرآن کو مت سنو اور اس میں شور کرو، تاکہ تم غالب رہو۔‘‘ اب انھیں قائل کرنے کے لیے ایک صورت رہ جاتی تھی کہ قرآن عربی زبان کے بجائے کسی اور زبان میں اتارا جاتا، جس سے انھیں یقین ہو جائے کہ یہ عربی رسول جو عجمی زبان جانتا ہی نہیں، عجمی قرآن لے کر آیا ہے، تو یہ اللہ کی طرف سے معجزہ ہے۔ اس آیت میں اللہ تعالیٰ نے فرمایا کہ اگر ایسا ہوتا، پھر بھی یہ لوگ ایمان نہ لاتے، بلکہ نہ ماننے کے لیے ایک اور بہانہ پیش کر دیتے، کیونکہ جو طے کر چکا ہو کہ میں نے ماننا ہی نہیں اسے منوانے کی کوئی صورت نہیں۔ ¤ ہمارے شیخ محمد عبدہ رحمہ اللہ اس آیت کی تفسیر میں لکھتے ہیں : ’’یہ کفارِ مکہ بھی عجیب شے ہیں، اگر ان کے پاس انھی میں سے ایک آدمی عربی میں قرآن لے کر آیا ہے تو کہتے ہیں کہ ایک عرب کا عربی قرآن پیش کرنا کوئی کمال نہیں، کمال تو اس وقت ہوتا جب یہ شخص کسی عجمی زبان فارسی، رومی یا ترکی میں قرآن پیش کرتا۔ حالانکہ اگر ہم ان کا مطالبہ مان لیتے اور آپ صلی اللہ علیہ وسلم پر کسی عجمی زبان میں قرآن نازل کر دیتے تو یہی لوگ اس وقت اعتراض کرتے کہ یہ عجیب معاملہ ہے کہ پیغمبر تو عربوں کو دعوت دینے کے لیے بھیجا گیا ہے، لیکن قرآن ایسی زبان میں لے کر آیا ہے جسے عرب سمجھ بھی نہیں سکتے۔‘‘ (اشرف الحواشی) ¤ ➋ {قُلْ هُوَ لِلَّذِيْنَ اٰمَنُوْا هُدًى وَّ شِفَآءٌ:} اس کی تفسیر گزر چکی ہے، دیکھیے سورۂ یونس (۵۷) اور سورۂ بنی اسرائیل (۸۲)۔ ¤ ➌ { وَ الَّذِيْنَ لَا يُؤْمِنُوْنَ فِيْۤ اٰذَانِهِمْ وَقْرٌ … :} یعنی قرآن اگرچہ رشد و ہدایت کا سرچشمہ ہے، لیکن وہ ان کافروں کے حق میں کانوں کا بوجھ اور آنکھوں کا پردہ ہے۔ اس کی وجہ ان کی اپنی ہٹ دھرمی اور تعصب ہے، اس میں قرآن کا کوئی قصور نہیں ہے، بالکل اسی طرح جیسے سورج روشنی دینے والی چیز ہے، لیکن اس کے طلوع ہوتے ہی چمگادڑ کی آنکھیں چندھیا جاتی ہیں۔ ¤ ➍ {اُولٰٓىِٕكَ يُنَادَوْنَ مِنْ مَّكَانٍۭ بَعِيْدٍ:} یہ ایک محاورہ ہے اور اس شخص کے حق میں استعمال ہوتا ہے جو کوئی بات نہ سمجھتا ہو۔ (قرطبی) یعنی یہ لوگ قرآن کو دل سے سننے کی کوشش نہیں کرتے، صرف اوپرے دل سے سنتے ہیں، اس لیے اس سے کوئی ہدایت نہیں پاتے۔ بالکل اسی طرح جیسے کسی شخص کو دور سے پکارا جائے اور وہ آواز تو محسوس کرے مگر مطلب مراد کچھ نہ سمجھے۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ { وَ لَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ فَاخْتُلِفَ فِيْهِ:} اس سے بھی مقصود رسول اللہ صلی اللہ علیہ وسلم کو تسلی دینا ہے، یعنی اس سے پہلے موسیٰ علیہ السلام پر تورات نازل کی گئی، مگر لوگوں نے اس کے ماننے اور نہ ماننے میں اختلاف کیا، اسی طرح اگر یہ کفارِ مکہ قرآن کی مخالفت کر رہے ہیں تو آپ کیوں پریشان ہوتے ہیں؟ (قرطبی) ¤ ➋ { وَ لَوْ لَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ لَقُضِيَ بَيْنَهُمْ:} یعنی اگر پہلے یہ طے نہ ہو چکا ہوتا کہ کفار کےے اعمالِ بد پر فوری گرفت کے بجائے دنیا میں ایک وقت تک انھیں مہلت دی جائے گی اور اصل فیصلہ آخرت میں ہو گا، تو ان کا فیصلہ ہو چکا ہوتا۔ دیکھیے سورۂ ابراہیم (۴۲)، نحل (۶۱) اور فاطر (۴۵)۔ ¤ {’’ وَ لَوْ لَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ ‘‘} میں یہ بات بھی شامل ہے کہ اگر اللہ تعالیٰ نے یہ طے نہ کر دیا ہوتا کہ ان کفار سے پیدا ہونے والی نسلیں مسلمان ہوں گی، جو اسلام کا علم بلند کریں گی تو ان کا قصہ تمام کر دیا گیا ہوتا، جیساکہ طائف میں ہونے والی بدسلوکی پر اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کی دل جوئی کے لیے ملک الجبال (پہاڑوں کے فرشتے) کو بھیجا اور اس نے آ کر رسول اللہ صلی اللہ علیہ وسلم کو پیش کش کی کہ اگر آپ کہیں تو میں ان کفار پر اخشبین (دو پہاڑوں) کو ملا دوں۔ (یہ مکہ کے دو پہاڑ ہیں، ایک ابوقبیس ہے اور دوسرا اس کے بالمقابل قُعیقعان ہے) تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ بَلْ أَرْجُوْ أَنْ يُّخْرِجَ اللّٰهُ مِنْ أَصْلاَبِهِمْ مَنْ يَّعْبُدُ اللّٰهَ وَحْدَهُ لاَ يُشْرِكُ بِهِ شَيْئًا] [ بخاري، بدء الخلق، باب إذا قال أحدکم آمین… : ۳۲۳۱، عن عائشۃ رضی اللہ عنھا ] ’’بلکہ میں امید رکھتا ہوں کہ اللہ تعالیٰ ان کی پشتوں سے ان لوگوں کو نکالے گا جو اکیلے اللہ عزو جل کی عبادت کریں گے، اس کے ساتھ کسی چیز کو شریک نہیں بنائیں گے۔‘‘ ¤ {’’ وَ لَوْ لَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ ‘‘} میں یہ بات بھی شامل ہے کہ فرعون کے غرق ہونے کے بعد طے کر دیا گیا کہ اب پہلی اقوام پر آنے والے عذابوں کے بجائے دنیا میں کفار کو جہاد کے ذریعے سے مسلمانوں کے ہاتھوں سزا دی جائے گی اور آخری فیصلہ قیامت کے دن ہو گا۔یہ پوری آیت اور اس کی تفسیر سورۂ ہود کی آیت (۱۱۰) میں گزر چکی ہے، وہاں ملاحظہ فرمائیں۔ ¤ ➌ { وَ اِنَّهُمْ لَفِيْ شَكٍّ مِّنْهُ مُرِيْبٍ: ’’ شَكٍّ ‘‘} اور {’’ مُرِيْبٍ ‘‘} کی لغوی تفسیر کے لیے دیکھیے سورۂ ہود (۶۲)۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهٖ … :} اس میں رسول اللہ صلی اللہ علیہ وسلم اور اہلِ ایمان کے لیے تسلی ہے کہ اگر یہ لوگ ایمان نہیں لاتے تو آپ پر اس کا کوئی وبال نہیں۔ جو صالح عمل کرے گا اس کا فائدہ اسی کو ہے اور جو برائی کرے گا اس کا وبال اسی پر ہے۔ ¤ ➋ { وَ مَا رَبُّكَ بِظَلَّامٍ لِّلْعَبِيْدِ:} اور اللہ بندوں پر کچھ بھی ظلم کرنے والا نہیں کہ کسی کو اس کی نیکی کا بدلا نہ دے، یا ایک کی بدی دوسرے پر ڈال دے۔ ¤ ➌ یہاں لفظ {’’ بِظَلَّامٍ ‘‘} پر ایک مشہور سوال ہے، اس سوال اور اس کے جواب کے لیے دیکھیے سورۂ آلِ عمران (۱۸۲)، انفال (۵۱) اور سورۂ حج (۱۰) کی تفسیر۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {اِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ:} پچھلی آیت کے ضمن میں ہر نیک و بد عمل کی جزا کا ذکر ہے۔ ہم دیکھتے ہیں کہ دنیا میں اکثر لوگ جزا کے بغیر فوت ہو جاتے ہیں، اس لیے اللہ تعالیٰ نے قیامت کے دن کا وعدہ فرما رکھا ہے۔ اس کا نام ہی ’’یوم الدین‘‘ (جزا کا دن) ہے، کیونکہ اگر وہ نیک و بد کو جزا نہ دے تو یہ ظلم ہے، جب کہ وہ اپنے بندوں پر ذرہ برابر ظلم کرنے والا نہیں۔ کفار چونکہ قیامت قائم ہونے اور اس پر اللہ تعالیٰ کے پوری طرح قادر ہونے کی بات کو دلیل کے ساتھ نہیں جھٹلا سکتے تھے، اس لیے انھوں نے جھٹلانے کا یہ طریقہ اختیار کیا کہ بار بار پوچھتے، قیامت کب ہو گی؟ گویا ان کی فرمائش پر وہ فوراً قائم نہ ہوئی تو کہہ سکیں گے کہ قیامت ہوتی تو آ جاتی۔ اللہ تعالیٰ نے ان کے سوال کے جواب میں فرمایا کہ قیامت کا علم اسی کی طرف لوٹایا جاتا ہے۔ یعنی انسان، جن اور فرشتے، غرض جس کسی سے قیامت کے متعلق پوچھو وہ بے خبر ہو گا۔ کسی دوسرے سے پوچھنے کو کہے گا تو وہ بھی بے خبر ہو گا۔ پوچھتے پوچھتے سبھی جس کی طرف لوٹائیں گے کہ وہی بتا سکتا ہے وہ صرف اور صرف اللہ تعالیٰ ہے، باقی سب بے خبر ہیں۔ مزید دیکھیے سورۂ نازعات (۴۲ تا ۴۴)، انعام (۵۹) اور سورۂ اعراف (۱۸۷) جبریل علیہ السلام نے انسانی شکل میں آ کر نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ قیامت کب ہو گی؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَا الْمَسْئُوْلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ] [بخاري، الإیمان، باب سؤال جبریل النبي صلی اللہ  علیہ وسلم … : ۵۰ ] ’’جس سے اس کے متعلق پوچھا گیا ہے وہ پوچھنے والے سے زیادہ نہیں جانتا۔‘‘ مطلب یہ ہے کہ تم جس بات کے پیچھے پڑے ہو تمھیں اس سے کچھ حاصل نہیں، کیونکہ وہ اللہ تعالیٰ کے سوا کسی کو معلوم ہی نہیں، اس لیے تم یہ فکر کرو کہ اس دن تمھارا بنے گا کیا اور تم نے اس کے لیے تیاری کیا کی ہے؟ ¤ ➋ { وَ مَا تَخْرُجُ مِنْ ثَمَرٰتٍ مِّنْ اَكْمَامِهَا: ’’أَكْمَامٌ‘‘ ’’كِمٌّ‘‘} (کاف کے کسرہ کے ساتھ) کی جمع ہے، وہ غلاف یا پردہ جس کے اندر شروع میں پھل چھپا ہوتا ہے۔ {’’ ثَمَرٰتٍ ‘‘} جمع ہے اور نکرہ ہے، اس پر {’’ مِنْ ‘‘} آنے سے عموم میں اضافہ ہو گیا ہے۔ ان سب باتوں کو ملحوظ رکھ کر ترجمہ کیا گیا ہے ’’کسی قسم کے پھل اپنے غلافوں سے نہیں نکلتے۔‘‘ مطلب یہ ہے کہ صرف قیامت کا علم ہی نہیں، غیب کے متعلق جتنے بھی امور ہیں ان سب کا علم صرف اللہ تعالیٰ کو ہے، کسی نبی، ولی یا فرشتے کو غیب کے معاملات کا علم اسی حد تک ہو سکتا ہے جس حد تک اللہ تعالیٰ نے اسے خبر دی ہوتی ہے۔ مزید دیکھیے سورۂ انعام (۵۹) اور سورۂ اعراف (۱۸۷)۔ ¤ ➌{ وَ مَا تَحْمِلُ مِنْ اُنْثٰى وَ لَا تَضَعُ اِلَّا بِعِلْمِهٖ:} دیکھیے سورۂ رعد (۸) اور سورۂ فاطر (۱۱)۔ یعنی قیامت کے علاوہ کسی پھل کے اپنے غلاف سے نکلنے یا کسی مادہ کے حاملہ ہونے یا بچہ جننے کے وقت کا علم بھی اللہ تعالیٰ کے سوا کسی کو نہیں، تو کیا آج تک تم نے اس وجہ سے کسی پھل کے اپنے غلاف سے نکلنے یا کسی مادہ کے حاملہ ہونے یا بچہ جننے سے اور دوسری بے شمار چیزوں کے واقع ہونے سے اس لیے انکار کیا ہے کہ اس کا متعین وقت تمھیں نہیں بتایا گیا، تو قیامت کا انکار صرف اس لیے کیوں کہ تمھیں اس کے برپا ہونے کا وقت نہیں بتایا گیا!؟ ¤ ➍ {وَ يَوْمَ يُنَادِيْهِمْ اَيْنَ شُرَكَآءِيْ: ’’ يَوْمَ ‘‘} فعل محذوف {’’اُذْكُرْ‘‘} کا مفعول ہونے کی وجہ سے منصوب ہے۔ قیامت کا ذکر کرتے ہوئے فرمایا کہ وہ دن یاد کرو جب اللہ تعالیٰ مشرکین کو پکار کر کہے گا کہاں ہیں میرے شریک؟ {’’ شُرَكَآءِيْ ‘‘} (میرے شریک) سے مراد وہ ہیں جو انھوں نے بنا رکھے تھے، ورنہ اللہ تعالیٰ کا شریک کون ہو سکتا ہے!؟ اللہ تعالیٰ کا انھیں یہ کہنا صرف انھیں ذلیل کرنے کے لیے ہو گا، کیونکہ وہ خوب جانتا ہے کہ اس کا کوئی شریک نہیں جسے وہ لے آئیں گے۔ ¤ ➎ { قَالُوْۤا اٰذَنّٰكَ مَا مِنَّا مِنْ شَهِيْدٍ:} یعنی وہ اپنے مشرک ہونے کا انکار کر دیں گے اور کہیں گے کہ ہم نے تجھے صاف بتا دیا ہے کہ ہم میں سے کوئی اس کی شہادت دینے والا نہیں کہ تیرا کوئی شریک ہے، یعنی ہم نے تیرے ساتھ کبھی شرک کیا ہی نہیں۔ (دیکھیے انعام : ۲۲ تا ۲۴) حقیقت یہ ہے کہ قیامت کے دن وہ کبھی اپنے مشرک ہونے سے انکار کریں گے، کبھی بے اختیار اس کا اقرار کریں گے، پھر انکار کریں گے۔ (دیکھیے مومن : ۷۳، ۷۴) پھر شہادتیں پیش ہونے پر اقرار کے سوا کچھ چارہ نہ ہو گا۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ { وَ ضَلَّ عَنْهُمْ مَّا كَانُوْا يَدْعُوْنَ مِنْ قَبْلُ:} یعنی پریشانی کے عالم میں وہ چاروں طرف نظر دوڑائیں گے کہ عمر بھر جنھیں پکارتے رہے، شاید ان میں سے کوئی مدد کو آ جائے، انھیں عذاب سے چھڑا لے، یا اس میں کچھ کمی ہی کروا دے، مگر کوئی مددگار نظر نہیں آئے گا۔ ¤ ➋ {وَ ظَنُّوْا مَا لَهُمْ مِّنْ مَّحِيْصٍ: ’’حَاصَ يَحِيْصُ حَيْصًا ‘‘} (ض) بھاگنا۔ {’’ مَحِيْصٍ ‘‘} مصدر میمی ہے یا ظرف۔ مصدر کا معنی ہو گا بھاگنے کی کوئی صورت اور ظرف کا معنی ہے بھاگنے کی کوئی جگہ۔ ’’ظن‘‘ کا لفظ گمان کے علاوہ یقین کے معنی میں بھی آتا ہے۔ (دیکھیے بقرہ : ۴۶) یہاں بھی {’’ ظَنُّوْا ‘‘} یقین کے معنی میں ہے، کیونکہ قیامت کے دن تمام حقیقتیں کھل کر سامنے آ جائیں گی اور کسی کو کوئی شک باقی نہیں رہے گا، حتی کہ کفار خود کو یقین ہو جانے کا اقرار کریں گے، فرمایا : «رَبَّنَاۤ اَبْصَرْنَا وَ سَمِعْنَا فَارْجِعْنَا نَعْمَلْ صَالِحًا اِنَّا مُوْقِنُوْنَ » [ السجدۃ : ۱۲ ] ’’اے ہمارے رب! ہم نے دیکھ لیا اور ہم نے سن لیا، پس ہمیں واپس بھیج کہ ہم نیک عمل کریں، بے شک ہم یقین کرنے والے ہیں۔‘‘ اور دیکھیے سورۂ مریم (۳۸)، سورۂ ق (۲۲) اور سورۂ انعام (۳۰)۔ مطلب یہ ہے کہ کفار کے حاجت رواؤں اور مشکل کشاؤں میں سے کوئی انھیں نظر نہیں آئے گا اور انھیں یقین ہو جائے گا کہ ان کے پاس اللہ تعالیٰ کے عذاب سے بھاگ نکلنے کی کوئی جگہ ہے نہ اس کی کوئی صورت۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { لَا يَسْـَٔمُ الْاِنْسَانُ …:} یہاں سے انسانی طبیعت پر کفر و شرک اور قیامت کے انکار کا ایک بہت برا اثر ذکر فرمایا۔ {’’ الْاِنْسَانُ ‘‘} سے مراد عام انسان ہے جو ایمان و یقین کی دولت سے خالی ہو، اس میں طبعی طور پر یہ کمزوری رکھی گئی ہے۔ توحید و رسالت اور آخرت پر ایمان کے بعد اس کی اس کمزوری کا علاج ہو جاتا ہے اور ایمان جس قدر قوی ہوتا ہے اتنا ہی وہ اس کمزوری سے پاک ہوتا جاتا ہے، جیسا کہ فرمایا : «اِنَّ الْاِنْسَانَ خُلِقَ هَلُوْعًا (19) اِذَا مَسَّهُ الشَّرُّ جَزُوْعًا (20) وَّ اِذَا مَسَّهُ الْخَيْرُ مَنُوْعًا (21) اِلَّا الْمُصَلِّيْنَ (22) الَّذِيْنَ هُمْ عَلٰى صَلَاتِهِمْ دَآىِٕمُوْنَ ...... اُولٰٓىِٕكَ فِيْ جَنّٰتٍ مُّكْرَمُوْنَ » [ المعارج : ۱۹ تا ۳۵ ] ’’بلاشبہ انسان تھڑدلا بنایا گیا ہے۔ جب اسے تکلیف پہنچتی ہے تو بہت گھبرا جانے والا ہے۔ اور جب اسے بھلائی ملتی ہے تو بہت روکنے والا ہے۔ سوائے نماز ادا کرنے والوں کے۔ وہ جو اپنی نماز پر ہمیشگی کرنے والے ہیں...... یہی لوگ جنتوں میں عزت دیے جانے والے ہیں۔‘‘ مزید دیکھیے سورۂ ہود (۹ تا ۱۱) کی تفسیر۔ ¤ ➋ { مِنْ دُعَآءِ الْخَيْرِ: ’’ الْخَيْرِ ‘‘} سے مراد دنیوی بھلائی ہے جس میں مال، اولاد، عزت، صحت اور قوت سبھی کچھ شامل ہے۔ {’’ دُعَآءِ ‘‘} سے مراد خیر کی طلب ہے، یعنی انسان دنیوی بھلائی کی طلب سے نہ اکتاتا ہے اور نہ تھکتا ہے، خواہ اسے اس کی ضرورت ہو یا نہ ہو۔ ابن عباس رضی اللہ عنھما فرماتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرما رہے تھے : [ لَوْ كَانَ لاِبْنِ آدَمَ وَادِيَانِ مِنْ مَّالٍ لاَبْتَغٰی ثَالِثًا، وَ لاَ يَمْلَأُ جَوْفَ ابْنِ آدَمَ إِللاَّ التُّرَابُ، وَ يَتُوْبُ اللّٰهُ عَلٰی مَنْ تَابَ ] [بخاري، الرقاق، باب ما یتقی من فتنۃ المال : ۶۴۳۶ ] ’’اگر ابنِ آدم کے پاس مال کی دو وادیاں ہوں تو وہ کوئی تیسری تلاش کرے گا اور ابن آدم کے پیٹ کو مٹی کے سوا کوئی چیز نہیں بھرتی اور اللہ اس پر پھر مہربان ہو جاتا ہے جو واپس پلٹ آئے۔‘‘ ¤ ➌ {وَ اِنْ مَّسَّهُ الشَّرُّ فَيَـُٔوْسٌ قَنُوْطٌ: ’’مَسَّ يَمَسُّ‘‘} (س) چھونا۔ {’’ فَيَـُٔوْسٌ ‘‘ ’’يَئِسَ يَيْئَسُ يَأْسًا ‘‘} (س، ح) سے مبالغے کا صیغہ ہے، بہت ناامید۔ {’’ قَنُوْطٌ ‘‘ ’’قَنِطَ  يَقْنَطُ قَنُوْطًا‘‘} (س، ن) سے مبالغے کا صیغہ ہے، بہت ناامید۔ بعض مفسرین نے فرمایا {’’ فَيَـُٔوْسٌ ‘‘} اور {’’ قَنُوْطٌ ‘‘} دونوں کا معنی ایک ہے، تاکید کے لیے {’’ فَيَـُٔوْسٌ ‘‘} کے بعد {’’ قَنُوْطٌ ‘‘} لایا گیا ہے اور بعض نے فرمایا، دونوں کے معنعنی میں فرق ہے۔ ابوحیان نے فرمایا : {’’يَأْسٌ‘‘} دل کی حالت ہے کہ آدمی کا دل خیر کی امید سے خالی ہو جائے اور {’’قَنُوْطٌ‘‘} یہ ہے کہ ناامیدی کے آثار اس کے چہرے اور بدن پر بھی ظاہر ہو جائیں۔‘‘ ظاہر ہے یہ فرق اس وقت ہے جب یہ دونوں لفظ اکٹھے آئیں، ورنہ یاس اور قنوط دونوں میں قلبی اور بدنی ہر طرح کی ناامیدی مراد ہوتی ہے، جیسا کہ ایمان و اسلام کا معاملہ ہے۔ {’’مَسٌّ‘‘} (چھونے) کے لفظ سے معلوم ہوا کہ کافر اتنا بے حوصلہ ہوتا ہے کہ برائی چھو جانے ہی سے آخری حد تک امید توڑ بیٹھتا ہے۔ مومن ایسا نہیں ہوتا، یہ صرف کافر کا حال ہے، جیسا کہ فرمایا : « اِنَّهٗ لَا يَايْـَٔسُ مِنْ رَّوْحِ اللّٰهِ اِلَّا الْقَوْمُ الْكٰفِرُوْنَ » [یوسف : ۸۷ ] ’’بے شک حقیقت یہ ہے کہ اللہ کی رحمت سے نا امید نہیں ہوتے مگر وہی لوگ جو کافر ہیں۔ ‘‘"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ { وَ لَىِٕنْ اَذَقْنٰهُ رَحْمَةً مِّنَّا … :} یعنی ایک طرف وہ ناامیدی کہ شر کے چھو جانے ہی سے آخری حد تک ناامید ہوتا ہے، دوسری طرف یہ احسان فراموشی کہ مصیبت کے بعد کسی رحمت کا ذائقہ چکھتے ہی پھول جاتا ہے اور اللہ تعالیٰ سے لاتعلق ہو جاتا ہے، حالانکہ نہ وہ شر اور مصیبت دائمی تھی نہ اس دنیوی نعمت کو دوام ہے۔ پھر یہ نعمت اس کی محنت کا نتیجہ نہیں کہ اس پر پھول جائے، بلکہ یہ محض ہماری عطا ہے۔ {’’ رَحْمَةً مِّنَّا ‘‘} کی تفصیل کے لیے دیکھیے سورۂ ہود (۹، ۱۰) کی تفسیر۔ ¤ ➋ { لَيَقُوْلَنَّ هٰذَا لِيْ:} یعنی کافر آدمی دنیوی نعمت کا ذائقہ چکھتے ہی تین کفریہ باتیں کہے گا، اس کے دل میں یہی باتیں ہوں گی اور زبان سے بھی یہی کہے گا۔ پہلی بات یہ کہ یہ نعمت میری جدوجہد کا نتیجہ اور میرا حق ہے، جیسا کہ فرعون کے لوگ کہتے تھے (دیکھیے اعراف : ۱۳۰، ۱۳۱) اور جیسا کہ قارون نے کہا تھا (دیکھیے قصص : ۷۸) حالانکہ یہ اللہ تعالیٰ کی صریح ناشکری اور احسان فراموشی ہے۔ ¤ ➌ { وَ مَاۤ اَظُنُّ السَّاعَةَ قَآىِٕمَةً وَّ لَىِٕنْ رُّجِعْتُ اِلٰى رَبِّيْۤ اِنَّ لِيْ عِنْدَهٗ لَلْحُسْنٰى:} ان دونوں باتوں کی تفصیل سورۂ کہف کی آیت (۳۶) کی تفسیر میں گزر چکی ہے۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) {وَ اِذَاۤ اَنْعَمْنَا عَلَى الْاِنْسَانِ اَعْرَضَ وَ نَاٰ بِجَانِبِهٖ: ’’نَأٰي يَنْأٰي نَأْيًا‘‘} (ف) دور ہونا۔ یہ فعل لازم ہے، {’’ بِجَانِبِهٖ  ‘‘} پر آنے والی ’’باء‘‘ کے ساتھ متعدی ہو گیا، اس لیے {’’ نَاٰ بِجَانِبِهٖ ‘‘} کا معنی ہے اپنا پہلو دور کر لیتا ہے۔ پچھلی آیت میں کافر انسان کا قول بیان ہوا ہے، اس آیت میں اس کا حال بیان ہوا ہے۔ اس آیت کی تفسیر کے لیے دیکھیے سورۂ یونس (۱۲)۔ ہود(11،10) اور سورۂ زمر (۴۹)۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) { قُلْ اَرَءَيْتُمْ اِنْ كَانَ مِنْ عِنْدِ اللّٰهِ ثُمَّ كَفَرْتُمْ بِهٖ … :} یہ پوری سورت قرآن کریم، توحید و رسالت اور قیامت کے حق ہونے کے دلائل سے بھری ہوئی ہے، جنھیں کفار نہ صرف یہ کہ مانتے نہیں تھے بلکہ سننے پر بھی تیار نہیں تھے، جیسا کہ آیت (۵) میں گزرا : « وَ قَالُوْا قُلُوْبُنَا فِيْۤ اَكِنَّةٍ » ’’اور انھوں نے کہا ہمارے دل اس بات سے پردوں میں ہیں۔‘‘ اور آیت (۲۶) میں ہے : « وَ قَالَ الَّذِيْنَ كَفَرُوْا لَا تَسْمَعُوْا لِهٰذَا الْقُرْاٰنِ» ’’ اور ان لوگوں نے کہا جنھوں نے کفر کیا، اس قرآن کو مت سنو۔‘‘ تو سورت کے آخر میں نبی صلی اللہ علیہ وسلم کو حکم ہوا کہ ان سے کہیں کہ تم جو قرآن کو سننے تک کے لیے تیار نہیں اسے باطل یا جھوٹ کیسے کہہ سکتے ہو؟ کیونکہ اسے غلط تو تب کہہ سکتے ہو کہ اسے سنو، پھر حق ہو تو قبول کرو، ورنہ دلیل سے اسے باطل قرار دو، اتنا تم میں حوصلہ نہیں۔ اس سے صاف ظاہر ہے کہ تمھیں اس کے باطل ہونے کا یقین نہیں، ورنہ ایسی چیز جس کا غلط ہونا بالکل واضح ہو، اس کے سننے پر اتنی شدید پابندی کی ضرورت نہیں ہوتی۔ اس سے ظاہر ہے کہ تمھارے ذہن میں بھی اس کے حق ہونے کا امکان موجود ہے۔ اس لیے یہ بتاؤ کہ یہ قرآن جسے تم سننے ہی کے روادار نہیں، اگر واقعی اللہ کی طرف سے حق ہوا، پھر سنے سمجھے بغیر تم نے اسے جھٹلا دیا اور اسی حالت میں تمھاری موت آ گئی، پھر حشر برپا ہوا تو اس وقت تو تم اتنی دور کی مخالفت میں پڑ چکے ہو گے جو بہت دور کی مخالفت ہے، جس سے واپسی تم چاہو گے بھی تو ممکن نہیں۔ پھر جو خواہ مخواہ کی ایسی غلط مخالفت پر ڈٹ جائے، جس سے واپسی ممکن نہ ہو، اس سے زیادہ گمراہ کون ہو سکتا ہے؟ آیت کا مقصد کفار کو سننے اور سوچنے پر آمادگی کی ترغیب اور اس وقت سے ڈرانا ہے جب ان کی مخالفت کے نقصان کا مداوا نہیں ہو سکے گا۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ { سَنُرِيْهِمْ اٰيٰتِنَا فِي الْاٰفَاقِ وَ فِيْۤ اَنْفُسِهِمْ … : ’’ الْاٰفَاقِ ‘‘ ’’أُفُقٌ‘‘} کی جمع ہے، کنارے۔ دور وہ جگہ جہاں آسمان و زمین ملتے ہوئے نظر آتے ہیں، افق کہلاتی ہے۔ مفسرین نے اس آیت کی تفسیر دو طرح سے کی ہے، ایک یہ کہ {’’ اَنَّهُ ‘‘} کی ضمیر سے مراد قرآن اور نبی کریم صلی اللہ علیہ وسلم ہیں۔ یعنی ہم انھیں دنیا بھر میں اور خود ان میں اپنی ایسی نشانیاں دکھا دیں گے جن سے ثابت ہو جائے گا کہ آپ صلی اللہ علیہ وسلم کی نبوت اور قرآن حق ہے۔ نشانیوں سے مراد ظاہری اسباب کی قلت کے باوجود اسلام کی فتوحات ہیں۔ {’’ الْاٰفَاقِ ‘‘} سے مراد مکہ کے گرد و پیش میں اسلام کا غلبہ ہے جو بدر، احد، خندق اور دوسرے معرکوں کے ساتھ جزیرۂ عرب پر اور آخر کار پوری زمین کے مشرقی اور مغربی کناروں تک پھیل گیا اور {’’ اَنْفُسِهِمْ ‘‘} سے مراد مکہ کی فتح ہے جو بجائے خود اسلام کے حق ہونے کی بہت بڑی دلیل تھی، جس کے بعد لوگ فوج در فوج اسلام میں داخل ہو گئے۔ مطلب یہ کہ عنقریب جب گرد و پیش کے ممالک اور خود ان (قریش) پر فتوحات حاصل ہوں گی جو آپ صلی اللہ علیہ وسلم اور خلفائے اسلام کے عہد میں حاصل ہوئیں، تب انھیں یقین حاصل ہو گا کہ قرآن اور پیغمبر حق تھے اور یہ ناحق انھیں جھٹلاتے رہے۔ ¤ دوسری تفسیر یہ کہ {’’ اَنَّهُ ‘‘} کی ضمیر سے مراد اللہ تعالیٰ ہے، مطلب یہ کہ اگر اللہ تعالیٰ کے وجود اور اس کی وحدانیت کے دلائل پر غور کریں گے، جو تمام آفاق یعنی زمین و آسمان میں پائے جاتے ہیں، مثلاً سورج چاند، نباتات و جمادات و حیوانات وغیرہ اور جو خود ان کی ذات میں پائے جاتے ہیں، مثلاً نطفے سے لے کر پیدائش تک، پھر بچپن سے لے کر موت تک، پھر ان کے وجود کی حیرت انگیز بناوٹ پر، جن کے عجائبات کے متعلق ہر روز نئے سے نئے انکشافات ہوتے رہیں گے، تو انھیں یقین ہو جائے گا کہ اللہ تعالیٰ ہی حق ہے۔ پہلے مطلب کو ابن جریر طبری نے ترجیح دی ہے، جبکہ دوسرا مطلب بعض تابعین نے اختیار فرمایا ہے۔ دونوں مطلب بیک وقت بھی مراد ہو سکتے ہیں۔ ¤ ➋ {اَوَ لَمْ يَكْفِ بِرَبِّكَ … :} یعنی مسلمانوں کی کمزوری کو دیکھتے ہوئے اگر کوئی کہے کہ اسلام اور مسلمانوں کا غلبہ کفارِ قریش پر اور کل عالم پر کیسے ممکن ہے تو اسے کہو، کیا تمھارا رب یہ کام کرنے کے لیے اکیلا کافی نہیں؟ اس لیے کہ وہ اکیلا ہر چیز اور ہر کام کا نگران اور اس پر شاہد ہے، اسے کسی کی مدد یا مشورے کی کوئی حاجت نہیں۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ { اَلَاۤ اِنَّهُمْ فِيْ مِرْيَةٍ مِّنْ لِّقَآءِ رَبِّهِمْ:} یعنی یہ لوگ قرآن اور اللہ کے رسول کو اس لیے جھٹلا رہے ہیں کہ انھیں قیامت کا یقین نہیں، بلکہ وہ اپنے رب کی ملاقات کے بارے میں شک میں مبتلا ہیں۔ ¤ ➋ { اَلَاۤ اِنَّهٗ بِكُلِّ شَيْءٍ مُّحِيْطٌ:} یعنی وہ یاد رکھیں کہ اللہ تعالیٰ ہر چیز کا احاطہ کرنے والا ہے، کوئی چیز اس کے علم اور ققدرت سے باہر نہیں، اس لیے وہ اس کی گرفت سے کسی طرح نہیں بچ سکتے۔"
    }
  ]
}