{
  "surah": "Ash-Shura",
  "surah_number": 42,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 2،1) {حٰمٓ (1) عٓسٓقٓ:} یہ حروف مقطعات ہیں، ان کی تفصیل کے لیے دیکھیے سورۂ بقرہ کی پہلی آیت کی تفسیر۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2،1) {حٰمٓ (1) عٓسٓقٓ:} یہ حروف مقطعات ہیں، ان کی تفصیل کے لیے دیکھیے سورۂ بقرہ کی پہلی آیت کی تفسیر۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { كَذٰلِكَ يُوْحِيْۤ اِلَيْكَ: ’’ كَذٰلِكَ ‘‘} (اسی طرح) سے مراد ایک تو وہ مضامین و معانی ہیں جو اس قرآن یا اس سورت میں ہیں، یعنی آپ کی طرف توحید، آخرت، نبوت اور دوسرے عقائد و اعمال اور واقعات پر مشتمل جو وحی کی گئی ہے یہ کوئی نرالی نہیں کہ کفار کو اس پر تعجب ہو رہا ہے، بلکہ ایسے ہی مضامین کی وحی اللہ تعالیٰ آپ کی طرف اور آپ سے پہلے پیغمبروں کی طرف کرتا چلا آیا ہے۔ بعض وقتی احکام میں فرق ہو سکتا ہے، مگر اصل دعوت جس کے لیے آپ کو اور پہلے تمام پیغمبروں کو مبعوث کیا گیا ایک ہی ہے، جیسا کہ فرمایا : « وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ » [الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔ ‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْأَنْبِيَاءُ إِخْوَةٌ لِعَلَّاتٍ، أُمَّهَاتُهُمْ شَتّٰی وَ دِيْنُهُمْ وَاحِدٌ ] [بخاري، أحادیث الأنبیاء، باب قول اللّٰہ تعالٰی : « واذکر في الکتاب مریم…» : ۳۴۴۳ ] ’’انبیاء علاتی (مختلف ماؤں سے پیدا ہونے والے) بھائی ہیں، ان کی مائیں الگ الگ ہیں اور ان کا دین ایک ہے۔‘‘ اور {’’ كَذٰلِكَ ‘‘} (اسی طرح) سے مراد وحی کرنے کا طریقہ بھی ہے، یعنی جس طرح یہ سورت یا یہ کتاب آپ کی طرف وحی کی جا رہی ہے، اللہ تعالیٰ اسی طرح آپ سے پہلے پیغمبروں کی طرف بھی وحی کرتا چلا آیا ہے۔ وہ جسے چاہتا ہے اپنی رسالت کے لیے چن لیتا ہے، پھر اس کے ساتھ وحی کی ان صورتوں میں سے کسی صورت کے ساتھ کلام کرتا ہے جو اس نے اس سورت کے آخر میں کسی بھی بشر کے ساتھ کلام کرنے کی بیان فرمائی ہیں۔ (دیکھیے شوریٰ : ۵۱،۵۲) کوئی یہ نہیں کہہ سکتا کہ اللہ تعالیٰ نے مجھ پر وحی کیوں نازل نہیں کی، یا مجھ سے کلام کیوں نہیں فرمایا۔ ¤ عائشہ رضی اللہ عنھا بیان کرتی ہیں کہ حارث بن ہشام رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا : ’’یا رسول اللہ! آپ کے پاس وحی کس طرح آتی ہے؟‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَحْيَانًا يَأْتِيْنِيْ مِثْلَ صَلْصَلَةِ الْجَرَسِ وَهُوَ أَشَدُّهُ عَلَيَّ فَيُفْصَمُ عَنِّيْ وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ، وَأَحْيَانًا يَتَمَثَّلُ لِيَ الْمَلَكُ رَجُلاً فَيُكَلِّمُنِيْ فَأَعِييْ مَا يَقُوْلُ قَالَتْ عَائِشَةُ رَضِيَ اللّٰهُ عَنْهَا وَلَقَدْ ررَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْيُ فِي الْيَوْمِ الشَّدِيْدِ الْبَرْدِ، فَيَفْصِمُ عَنْهُ وَ إِنَّ جَبِيْنَهُ لَيَتَفَصَّدُ عَرَقًا ] [ بخاري، بدء الوحي إلی الرسول صلی اللہ علیہ وسلم ، باب : ۲ ]’’میرے پاس وحی کبھی تو گھنٹی کی مسلسل آواز کی طرح آتی ہے جو مجھ پر وحی کی سب سے زیادہ سخت صورت ہے، پھر وہ مجھ سے اس حال میں ختم ہوتی ہے کہ جو کچھ مجھے کہا ہے وہ میں یاد کر چکا ہوتا ہوں اور کبھی فرشتہ ایک آدمی کی شکل میں میرے پاس آتا ہے اور مجھ سے کلام کرتا ہے، تو جو کچھ وہ کہتا ہے میں یاد کر لیتا ہوں۔‘‘ عائشہ رضی اللہ عنھا نے فرمایا : ’’میں نے آپ کو سخت سردی والے دن میں آپ پر وحی اترنے کی حالت میں دیکھا کہ وہ کیفیت آپ سے ختم ہوتی تو آپ کی پیشانی پسینے سے ٹپک رہی ہوتی تھی۔‘‘ ¤ ➋ { وَ اِلَى الَّذِيْنَ مِنْ قَبْلِكَ:} اس کی تفسیر کے لیے دیکھیے سورۂ نساء کی آیات (۱۶۳ تا ۱۶۵)۔ ¤ ➌ {اللّٰهُ الْعَزِيْزُ الْحَكِيْمُ:} سورہ نساء کی آیات، جن کا حوالہ اوپر دیا گیا ہے، ان میں پیغمبروں کی طرف وحی کا ذکر فرما کر بات کا خاتمہ اپنے ہمیشہ سے عزیز و حکیم ہونے کے ساتھ کیا، چنانچہ فرمایا : « وَ كَانَ اللّٰهُ عَزِيْزًا حَكِيْمًا» [ النساء : ۱۶۵ ] ’’اور اللہ ہمیشہ سے سب پر غالب، کمال حکمت والا ہے۔‘‘ قرآن مجید میں جہاں جہاں وحی نازل کرنے کا ذکر ہے اس کے بعد مقام کی مناسبت سے اللہ تعالیٰ کے بعض اسماء و صفات کا ذکر بھی ہے۔ کتاب اللہ نازل کرنے کے ساتھ عزیز و حکیم کے ذکر کی مناسبت کے لیے دیکھیے سورۂ زمر کی پہلی آیت کی تفسیر، ساتھ سورۂ مومن کی پہلی آیت کی تفسیر بھی ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { لَهٗ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ:} یہ اس سوال کا جواب ہے کہ اگر محمد(  صلی اللہ علیہ وسلم ) پر یہ کتاب پہلے پیغمبروں کی طرح نازل ہوئی ہے تو ہوتی رہے، ہم پر کیوں لازم ہے کہ ہم اس کے احکام کی پابندی کریں اور اپنی مرضی پر عمل نہ کریں؟ فرمایا، اس لیے کہ آسمانوں میں اور زمین میں جو کچھ ہے سب کا مالک اللہ تعالیٰ ہے، خود تم بھی اس کی ملکیت ہو۔ بھلا وہ مالک برداشت کر سکتا ہے کہ اس کی ملکیت میں کسی اور کی خدائی چلے اور اس کا مملوک ہو کر کوئی اپنی مرضی کرتا پھرے اور اس کے بھیجے ہوئے احکام پر عمل نہ کرے۔ مزید دیکھیے آیت الکرسی یعنی سورۂ بقرہ کی آیت (۲۵۵) میں اس جملے کی تفسیر۔ ¤ ➋ { وَ هُوَ الْعَلِيُّ الْعَظِيْمُ:} بے حد بلندی اور بے انتہا عظمت والا صرف وہی ہے ({الْعَلِيُّ الْعَظِيْمُ} خبر پر الف لام آنے سے قصر پیدا ہو گیا کہ وہی علیّ و عظیم ہے) تو وہ کیسے گوارا کر سکتا ہے کہ اس کی بنائی ہوئی مخلوق اس کے مقابلے میں بے حد پست اور بے انتہا حقیر ہو کر اس کے احکام نہ مانے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { تَكَادُ السَّمٰوٰتُ يَتَفَطَّرْنَ مِنْ فَوْقِهِنَّ: ’’ وَ هُوَ الْعَلِيُّ الْعَظِيْمُ ‘‘} کے بعد یہ فرمانے کا ایک مطلب یہ ہے کہ آسمان قریب ہیں کہ اپنے اوپر سے پھٹ پڑیں، یعنی اللہ تعالیٰ کے علیّ و عظیم ہونے کی وجہ سے اس کے رعب اور جلال کا یہ عالم ہے کہ آسمان اس کی ہیبت و قوت برداشت نہ کرتے ہوئے پھٹ جائیں۔ اللہ تعالیٰ کی عظمت و ہیبت کا آسمانوں پر جو اثر ہے اس کا کچھ اندازہ اس حدیث سے ہوتا ہے جو ابو ذر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنِّيْ أَرٰی مَا لاَ تَرَوْنَ وَأَسْمَعُ مَا لاَ تَسْمَعُوْنَ أَطَّتِ السَّمَاءُ وَحُقَّ لَهَا أَنْ تَئِطَّ مَا فِيْهَا مَوْضِعُ أَرْبَعِ أَصَابِعَ إِلاَّ وَ مَلَكٌ وَاضِعٌ جَبْهَتَهُ سَاجِدًا لِلّٰهِ، وَاللّٰهِ! لَوْ تَعْلَمُوْنَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيْلاً وَلَبَكَيْتُمْ كَثِيْرًا وَمَا تَلَذَّذْتُمْ بِالنِّسَااء عَلَی الْفُرُشِ وَلَخَرَجْتُمْ إِلَی الصُّعُدَاتِ تَجْأَرُوْنَ إِلَی اللّٰهِ ] [ترمذي، الزھد، باب في قول النبي صلی اللہ علیہ وسلم لو تعلمون … : ۲۳۱۲، و حسنہ الترمذي، و قال الألباني حسن ]’’میں وہ کچھ دیکھتا ہوں جو تم نہیں دیکھتے اور وہ سنتا ہوں جو تم نہیں سنتے۔ آسمان چرچرا رہا ہے اور اس کا حق ہے کہ چر چرائے، اس میں چار انگلیوں کی جگہ نہیں مگر کوئی نہ کوئی فرشتہ اپنی پیشانی رکھ کر اللہ کے لیے سجدے میں ہے۔ اللہ کی قسم! اگر تم وہ جان لو جو میں جانتا ہوں تو بہت کم ہنسو اور بہت زیادہ روؤ اور تم بستروں پر عورتوں سے لذت حاصل نہ کرو اور تم اللہ کی طرف گڑ گڑاتے ہوئے بیابانوں کی طرف نکل جاؤ۔‘‘ اور ایک مطلب یہ ہے کہ اس عزیز و حکیم اور علیّ و عظیم مالک کی نازل کردہ کتاب پر ایمان لانے اور اس اکیلے کی عبادت کے بجائے کسی مخلوق کو، جس کے اختیار میں کچھ بھی نہیں مشکل کشا، حاجت روا، داتا، دستگیر، غریب نواز، بگڑی بنانے والا اور ڈوبتے ہوئے کو پار لگانے والا مان لینا، یا اسے اللہ تعالیٰ کی بیوی یا بیٹا یا اس کے ذاتی نور کا ٹکڑا قرار دے کر اس کی عبادت اور اس سے مانگنا شروع کر دینا کوئی معمولی بات نہیں، بلکہ اتنی خوفناک بات ہے کہ قریب ہے یہ بات کہنے پر آسمان اپنے اوپر سے گر پڑیں، زمین شق ہو جائے اور پہاڑ ڈھے کر گر پڑیں۔ سورۂ مریم کی آیات (۸۸ تا ۹۵) میں یہ بات تفصیل سے بیان ہوئی ہے، وہ آیات مع تفسیر ملاحظہ فرما لیں۔ ¤ ➋ {مِنْ فَوْقِهِنَّ:} آسمانوں کے اپنے اوپر سے پھٹنے کا مطلب یہ ہے کہ قریب ہے کہ یہ آسمان اپنے اوپر کی جانب سے پھٹ جائیں۔ چنانچہ سب سے اوپر والا آسمان پھٹ کر نیچے والے آسمان پر گرے، وہ اس سے نچلے پر گرے، اس طرح تمام آسمان پھٹیں اور نیچے والوں کے اوپر گر جائیں۔ آسمانوں کے اپنے اوپر سے پھٹنے کی وجہ وہاں بے شمار فرشتوں کا سجدہ ریز ہونا اور عرش الٰہی کے قریب ہونے کی وجہ سے اللہ تعالیٰ کے جلال اور اس کی ہیبت کے آثار کا بہت زیادہ ہونا ہے۔ ¤ ➌ {وَ الْمَلٰٓىِٕكَةُ يُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ:} تسبیح سے مراد اللہ تعالیٰ کو ہر عیب اور ہر کمی سے پاک قرار دینا اور حمد سے مراد اسے ہر خوبی کا مالک قرار دینا ہے۔ اس کی سب سے بڑی خوبی توحید ہے اور اس کی طرف منسوب کیے جانے والے تمام عیوب میں سب سے بڑا عیب یہ ہے کہ کوئی اس کا شریک ہے یا اس کی اولاد یا بیوی ہے۔ سب سے بڑا عیب اس لیے کہ یہ مان لینے کی صورت میں اس کا محتاج اور عاجز ہونا ثابت ہوتا ہے، اللہ تعالیٰ نے اسے اپنے لیے گالی قرار دیا۔ فرشتے ہر وقت اللہ تعالیٰ کی صفاتِ جمال و جلال اور صفاتِ کمال کا ذکر کرتے رہتے ہیں۔ ¤ ➍ { وَ يَسْتَغْفِرُوْنَ لِمَنْ فِي الْاَرْضِ:} اکثر مفسرین فرماتے ہیں کہ {’’ لِمَنْ فِي الْاَرْضِ ‘‘} سے مراد مومن ہیں اور فرشتے زمین والوں میں سے صرف ایمان والوں کے لیے استغفار کرتے ہیں، کیونکہ دوسری جگہ فرمایا : « اَلَّذِيْنَ يَحْمِلُوْنَ الْعَرْشَ وَ مَنْ حَوْلَهٗ يُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ وَ يُؤْمِنُوْنَ بِهٖ وَ يَسْتَغْفِرُوْنَ لِلَّذِيْنَ اٰمَنُوْا رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَّ عِلْمًا فَاغْفِرْ لِلَّذِيْنَ تَابُوْا وَ اتَّبَعُوْا سَبِيْلَكَ وَ قِهِمْ عَذَابَ الْجَحِيْمِ » [ المؤمن : ۷ ] ’’وہ(فرشتے) جو عرش کواٹھائے ہوئے ہیں اور وہ جو اس کے ارد گرد ہیں اپنے رب کی حمد کے ساتھ تسبیح کرتے ہیں اور اس پر ایمان رکھتے ہیں اور ان لوگوں کے لیے بخشش کی دعا کرتے ہیں جو ایمان لائے، اے ہمارے رب! تو نے ہر چیز کو رحمت اور علم سے گھیر رکھا ہے، تو ان لوگوں کو بخش دے جنھوں نے توبہ کی اور تیرے راستے پر چلے اور انھیں بھڑکتی ہوئی آگ کے عذاب سے بچا۔ ‘‘ مگر بعض مفسرین نے فرمایا : ’’آیت کے الفاظ یہ ہیں کہ (فرشتے ان لوگوں کے لیے استغفار کرتے ہیں جو زمین میں ہیں) اس میں مومن و کافر دونوں شامل ہیں اور فرشتوں کے مسلم و کافر سب کے لیے استغفار کا مطلب یہ ہے کہ وہ تمام زمین والوں کے لیے دعا کرتے رہتے ہیں، خواہ مومن ہوں یا کافر کہ اے اللہ! ان کے لیے ایسے اسباب مہیا فرما جن کی بدولت ان سے عذاب ٹلے، کافر ہیں تو ایمان لائیں، فاسق ہیں تو توبہ کریں، تاکہ ان کی بخشش ہو جائے۔‘‘ قرطبی نے اس بات کو راجح قرار دیا ہے۔ اس تفسیر پر ایک سوال ہے کہ اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم اور ایمان والوں کو مشرکین کے لیے استغفار سے منع فرمایا ہے، آپ استغفار کا کوئی بھی معنی کرلیں فرشتوں کا کفار و مشرکین کے لیے استغفار ممکن ہی نہیں، کیونکہ وہ اپنے رب کے کسی حکم کی نافرمانی کرتے ہی نہیں، جیسا کہ فرمایا : « لَا يَعْصُوْنَ اللّٰهَ مَاۤ اَمَرَهُمْ وَ يَفْعَلُوْنَ مَا يُؤْمَرُوْنَ» [ التحریم : ۶ ] ’’وہ اللہ کی نافرمانی نہیں کرتے جو وہ انھیں حکم دے اور وہ کرتے ہیں جو حکم دیے جاتے ہیں۔‘‘ اس سوال کا جواب اسی آیت میں موجود ہے جس میں مشرکین کے لیے استغفار سے منع کیا گیا ہے، چنانچہ اللہ تعالیٰ نے فرمایا : «مَا كَانَ لِلنَّبِيِّ وَ الَّذِيْنَ اٰمَنُوْۤا اَنْ يَّسْتَغْفِرُوْا لِلْمُشْرِكِيْنَ وَ لَوْ كَانُوْۤا اُولِيْ قُرْبٰى مِنْۢ بَعْدِ مَا تَبَيَّنَ لَهُمْ اَنَّهُمْ اَصْحٰبُ الْجَحِيْمِ » [ التوبۃ : ۱۱۳ ] ’’اس نبی اور ان لوگوں کے لیے جو ایمان لائے، کبھی جائز نہیں کہ وہ مشرکوں کے لیے بخشش کی دعا کریں، خواہ وہ قرابت دار ہوں، اس کے بعد کہ ان کے لیے صاف ظاہر ہوگیا کہ یقینا وہ جہنمی ہیں۔ ‘‘ معلوم ہوا مشرکین کے لیے استغفار اس وقت منع ہے جب ان کا جہنمی ہونا واضح اور یقینی ہو جائے اور ظاہر ہے کسی کے جہنمی ہونے کا یقین اس کے کفر پر مرنے کے بعد ہی ہو سکتا ہے۔ جب تک کوئی زندہ ہے کسی وقت بھی اسے ایمان کی توفیق عطا ہو سکتی ہے اور یہ علم کہ کس نے کفر پر مرنا ہے کسی انسان، جن یا فرشتے کو نہیں، اس لیے کفار کے لیے ہدایت کی دعا کرنا، جس سے ان کی بخشش ہو جائے، جائز بلکہ سنت ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ طفیل بن عمرو دوسی رضی اللہ عنہ اور ان کے ساتھی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہنے لگے : ’’یا رسول اللہ! دوس قبیلے نے نافرمانی کی ہے اور ایمان لانے سے انکار کر دیا ہے، آپ ان پر بد دعا کریں۔‘‘ لوگوں نے کہا : ’’دوس قبیلہ ہلاک ہو گیا۔‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَللّٰهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ ] [ بخاري، الجہاد، باب الدعاء للمشرکین بالھدٰی لیتألّفہم : ۲۹۳۷ ] ’’اے اللہ! دوس قبیلے کو ہدایت دے اور انھیں لے آ۔‘‘ ¤ ➎ اس آیت سے فرشتوں کی صاف دلی اور زمین والوں کے لیے خیر خواہی کا اندازہ ہوتا ہے۔ انھی انسانوں کے باپ کو سجدے کے حکم سے انکار پر ابلیس ملعون ٹھہرا تھا، جب کہ اللہ کے حکم سے فرشتوں نے سجدہ بھی کیا اور ان کے حق میں دعائیں بھی کرتے چلے جا رہے ہیں۔ وہ متکبر تھا ملعون ٹھہرا، یہ متواضع تھے مقرب ٹھہرے۔ اللہ تعالیٰ ہمیں بھی ایسی ہی صاف دلی عطا فرمائے اور ہماری طرف سے فرشتوں کو بہترین بدلا عطا فرمائے۔ (آمین) ¤ ➏ { اَلَاۤ اِنَّ اللّٰهَ هُوَ الْغَفُوْرُ الرَّحِيْمُ:} خبر{’’ الْغَفُوْرُ الرَّحِيْمُ ‘‘} پر الف لام اور ضمیرر فصل {’’ هُوَ ‘‘} سے قصر کا مفہوم پیدا ہو رہا ہے، اس لیے ترجمہ کیا گیا ہے : ’’سن لو! بے شک اللہ تعالیٰ ہی بے حد بخشنے والا، نہایت رحم والا ہے۔‘‘ یعنی کسی اور میں یہ صفات نہیں ہیں۔ اس میں مشرکین کو تنبیہ ہے کہ بخشنے والا اور رحم کرنے والا اللہ تعالیٰ ہی ہے، اگر یہ بات فرشتوں کے اختیار میں ہوتی تو وہ اللہ تعالیٰ سے اس کی درخواست کیوں کرتے؟"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { وَ الَّذِيْنَ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اَوْلِيَآءَ اللّٰهُ …:} اس جملے میں مشرکین کے لیے بہت شدید ڈانٹ اور دھمکی ہے کہ اوپر آیات میں جس اللہ کا ذکر ہوا، جو عزیز و حکیم اور علیّ و عظیم ہے، جس کی ہیبت سے آسمان پھٹنے کے قریب رہتے ہیں اور جس کی تسبیح و حمد تمام فرشتے کرتے ہیں، جن لوگوں نے اس اللہ کے سوا کسی قسم کے کارساز بنائے، جو ان کے خیال میں فوق الفطرت طریقے سے ان کی حاجتیں و مرادیں بر لاتے اور ان کی دستگیری و فریاد رسی کرتے ہیں، ان کے ایک ایک عمل کو اللہ تعالیٰ دیکھ رہا ہے، وہ سب اس کے پاس محفوظ ہیں اور بہت جلد وہ انھیں ان کا بدلا دے گا۔ ¤ ➋ { وَ مَاۤ اَنْتَ عَلَيْهِمْ بِوَكِيْلٍ: ’’ مَا‘‘} نافیہ کی تاکید {’’ بِوَكِيْلٍ ‘‘} کی بااء کے ساتھ ہو رہی ہے اور {’’ بِوَكِيْلٍ ‘‘} کی تنوین تنکیر کے لیے ہے، اس لیے ترجمہ ’’تو ہر گز ان کا کوئی ذمہ دار نہیں‘‘ کیا گیا ہے۔ {’’ وَكَلَ يَكِلُ‘‘} (ض) سپرد کرنا۔ {’’وَكِيْلٌ‘‘} جس کے سپرد کوئی کام کر دیا جائے، ذمہ دار، یعنی ان کفار و مشرکین کی نگرانی اور ان کے اعمال کی جزا اللہ تعالیٰ کا کام ہے، آپ انھیں ہدایت دینے کے ذمہ دار نہیں ہیں۔ اس لیے آپ کو زیادہ پریشان یا غمزدہ ہونے کی ضرورت نہیں، جیسا کہ فرمایا : « اِنَّمَاۤ اَنْتَ نَذِيْرٌ وَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ وَّكِيْلٌ » [ ھود : ۱۲ ] ’’تو تو صرف ڈرانے والا ہے اور اللہ ہر چیز پر نگران ہے۔ ‘‘ مزید دیکھیے سورۂ یونس (۹۹، ۱۰۰) اور سورۂ انعام (۳۵)۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { وَ كَذٰلِكَ اَوْحَيْنَاۤ اِلَيْكَ قُرْاٰنًا عَرَبِيًّا:} قرآن عربی زبان میں نازل کرنے کی چند حکمتوں کے جاننے کے لیے دیکھیے سورۂ یوسف کی آیت(۲) کی تفسیر۔ ¤ ➋ { لِتُنْذِرَ اُمَّ الْقُرٰى وَ مَنْ حَوْلَهَا: ’’ اُمَّ الْقُرٰى ‘‘} کا معنی بستیوں کی ماں یا بستیوں کی جڑ یا اصل ہے، یعنی بستیوں کا مرکز۔ مراد مکہ معظمہ ہے، کیونکہ زمین پر اللہ تعالیٰ کی عبادت کے لیے سب سے پہلا گھر یہیں تعمیر ہوا، جسے تمام دنیا کی ہدایت کا مرکز قرار دیا گیا، جیسا کہ فرمایا : « اِنَّ اَوَّلَ بَيْتٍ وُّضِعَ لِلنَّاسِ لَلَّذِيْ بِبَكَّةَ مُبٰرَكًا وَّ هُدًى لِّلْعٰلَمِيْنَ» [ آل عمران : ۹۶ ]’’بے شک پہلا گھر جو لوگوں کے لیے مقرر کیا گیا، یقینا وہی ہے جو بکہ میں ہے، بہت با برکت اور جہانوں کے لیے ہدایت ہے۔‘‘ تمام دنیا کے لوگوں کے لیے اس شہر میں موجود بیت اللہ کا حج صاحبِ استطاعت لوگوں پر فرض کیا گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے اسے تمام روئے زمین سے بہتر قرار دیا۔ عبد اللہ بن عدی رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو {’’حَزْوَرَةٌ ‘‘} (شہر مکہ کی ایک جگہ) پر کھڑے دیکھا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ وَاللَّهِ ! إِنَّكِ لَخَيْرُ أَرْضِ اللّٰهِ وَأَحَبُّ أَرْضِ اللّٰهِ إِلَی اللّٰهِ وَلَوْلاَ أَنِّيْ أُخْرِجْتُ مِنْكِ مَا خَرَجْتُ ] [ ترمذي، المناقب، باب فيي فضل مکۃ : ۳۹۲۵، و قال الألباني صحیح ] ’’اللہ کی قسم! یقینا تو اللہ کی زمین میں سب سے بہتر اور اللہ کی زمین میں اللہ کو سب سے زیادہ محبوب ہے اور اگر مجھے اس سے نکالا نہ جاتا تو میں نہ نکلتا۔‘‘ آپ صلی اللہ علیہ وسلم پر وحی کی ابتدا یہاں سے ہوئی اور آپ کی دعوت کا آغاز یہیں سے ہوا۔ ¤ ➌ یہاں ایک سوال ہے کہ رسول اللہ صلی اللہ علیہ وسلم تو کل عالم اور تمام روئے زمین کے لیے ڈرانے والے تھے، پھر یہاں آپ کے بھیجنے کا مقصد صرف مکہ اور اس کے اردگرد کو کیوں بتایا گیا؟ جواب اس کا یہ ہے کہ اوّل تو {’’ مَنْ حَوْلَهَا ‘‘} میں پوری زمین شامل ہے، مکہ پوری زمین کا مرکز ہے، سب اس کی طرف منہ کرکے نماز پڑھتے ہیں اور اس کے حج کے لیے جاتے ہیں۔ اگر {’’ مَنْ حَوْلَهَا ‘‘} سے قریب قریب ارد گرد کی بستیاں مراد لی جائیں تب بھی آپ کو مکہ اور اس کے ارد گرد ڈرانے کے لیے بھیجنے کی بات کا مقصد یہ نہیں کہ آپ دوسری اقوام کی طرف مبعوث نہیں، جیسا کہ فرمایا : « وَ اَنْذِرْ عَشِيْرَتَكَ الْاَقْرَبِيْنَ» [الشعراء : ۲۱۴ ] ’’اور اپنے سب سے قریب رشتہ داروں کو ڈرا۔‘‘ سب جانتے اور مانتے ہیں کہ اس کا مقصد یہ نہیں کہ آپ صرف قریبی رشتہ داروں کے لیے مبعوث ہوئے تھے، ورنہ اہلِ مکہ و مدینہ کو دعوت دینے کی کیا ضرورت تھی؟ اسی طرح نبی صلی اللہ علیہ وسلم کو ام القریٰ اور اس کے ارد گرد لوگوں کو ڈرانے کے لیے بھیجنے کا مقصد آپ صلی اللہ علیہ وسلم کی دعوت کو یہاں تک محدود کرنا نہیں۔ اس بات کا ذکر کہ آپ صلی اللہ علیہ وسلم کی بعثت تمام جن و انس کے لیے اور قیامت تک کے لیے ہے قرآن مجید میں متعدد مقامات پر آیا ہے۔ دیکھیے سورۂ انعام (۱۹)، اعراف (۱۵۸)، فرقان (۱)، احقاف (۲۹ تا ۳۲) اور سورۂ سبا (۲۸)۔ ¤ ➍ {وَ تُنْذِرَ يَوْمَ الْجَمْعِ: ’’ أَنْذَرَ يُنْذِرُ ‘‘} (ڈرانا) کے دو مفعول ہوتے ہیں، کیونکہ ڈرانے میں دو چیزیں ملحوظ ہوتی ہیں، ایک یہ کہ کسے ڈرایا جا رہا ہے اور دوسری یہ کہ اسے کس چیز سے ڈرایا جا رہا ہے۔ اس آیت میں {’’ لِتُنْذِرَ اُمَّ الْقُرٰى وَ مَنْ حَوْلَهَا ‘‘} اور {’’ وَ تُنْذِرَ يَوْمَ الْجَمْعِ ‘‘} دو جملے ہیں، دونوں میں {’’ تُنْذِرَ ‘‘} کے دو دو مفعول ہیں۔ پہلے جملے میں پہلا مفعول ذکر فرمایا اور دوسرا حذف کر دیا، جو آیت کے الفاظ سے ظاہر ہو رہا ہے : {’’أَيْ لِتُنْذِرَ أُمَّ الْقُرٰي وَ مَنْ حَوْلَهَا الْعَذَابَ‘‘} ’’یعنی تاکہ تو امّ القریٰ اور اس کے اردگرد کے لوگوں کو عذاب سے ڈرا دے۔‘‘ دوسرے جملہ میں پہلا مفعول حذف کر دیا اور دوسرا ذکر فرمایا : {’’ أَيْ لِتُنْذِرَ أُمَّ الْقُرٰي وَمَنْ حَوْلَهَا يَوْمَ الْجَمْعِ‘‘} ’’یعنی تاکہ تو امّ القریٰ اور اس کے ارد گرد کی بستیوں کو یوم الجمع سے ڈرا دے۔‘‘ ¤ مطلب یہ ہے کہ اسی طرح ہم نے تیری طرف عربی قرآن وحی کیا، تاکہ تو بستیوں کے مرکز اور اس کے اردگرد کے لوگوں کو گزشتہ اقوام پر آنے والے عذاب سے ڈرائے اور تاکہ تو ام القریٰ اور اس کے اردگرد کی بستیوں کو گزشتہ اقوام جیسے عذاب کے ساتھ ساتھ یوم الجمع سے بھی ڈرائے۔ اتنی لمبی بات کو ان مختصر الفاظ میں سمیٹ دیا : « لِتُنْذِرَ اُمَّ الْقُرٰى وَ مَنْ حَوْلَهَا وَ تُنْذِرَ يَوْمَ الْجَمْعِ» اسے احتباک کہتے ہیں اور اس سے کلام میں اختصار، جامعیت اور حسن پیدا ہوتا ہے۔ ¤ ➎ {’’ يَوْمَ الْجَمْعِ ‘‘} قیامت کے دن کو کہتے ہیں، کیونکہ اس دن سب پہلے پچھلے جمع ہوں گے، جیسا کہ فرمایا : « يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ذٰلِكَ يَوْمُ التَّغَابُنِ» [ التغابن : ۹ ] ’’جس دن وہ تمھیں جمع کرنے کے دن کے لیے جمع کرے گا، وہی ہار جیت کا دن ہے۔‘‘ ¤ ➏ { لَا رَيْبَ فِيْهِ:} ’’جس میں کوئی شک نہیں‘‘ کیونکہ یہ بات فطرت میں رکھ دی گئی ہے کہ مالک اپنے غلاموں کو کسی کام پر مقرر کرے، پھر وہ ایک دوسرے پر ظلم و زیادتی کریں تو ضروری ہے کہ وہ کسی دن انھیں اکٹھا کر کے مظلوم کو ظالم سے انصاف دلائے، اگر ایسا نہیں کرے گا تو بے انصاف شمار ہو گا۔ تو احکم الحاکمین کے سب کو جمع کرنے کے دن میں کیا شک ہو سکتا ہے؟ رہی یہ بات کہ کچھ لوگ اس میں شک کرتے ہیں، تو ان کے شک کو کالعدم قرار دیا کہ اس کا کچھ اعتبار نہیں۔ ¤ ➐ { فَرِيْقٌ فِي الْجَنَّةِ وَ فَرِيْقٌ فِي السَّعِيْرِ:} یہ {’’ يَوْمَ الْجَمْعِ ‘‘} کا انجام ہے کہ ایک گروہ جنت میں جائے گا اور ایک گروہ بھڑکتی ہوئی آگ میں جائے گا۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {وَ لَوْ شَآءَ اللّٰهُ لَجَعَلَهُمْ اُمَّةً وَّاحِدَةً:} یہ اس سوال کا جواب ہے کہ اللہ تعالیٰ نے ایک فریق جنتی اور ایک جہنمی کیوں بنایا، سبھی کو ایک جیسا کیوں نہیں بنا دیا۔ یعنی اللہ تعالیٰ چاہتا تو جس طرح اس نے کائنات کی تمام چیزوں کو بے اختیار بنایا ہے وہ جن و انس کو بھی کسی قسم کا اختیار نہ دیتا۔ اگر وہ ایسا کرتا تو وہ سب دین حق پر ہوتے، مگر اس نے انھیں اختیار اور ارادہ میں آزادی دے کر پیدا فرمایا، تاکہ ان کا امتحان ہو اور اس کی صفات رحمت، غضب اور عدل کا ظہور ہو۔ یہ اس کی مشیت ہے، جس میں بے شمار حکمتیں ہیں، جنھیں پوری طرح وہی جانتا ہے، انسان چاہے بھی تو ان کی تہ تک نہیں پہنچ سکتا، وہ اتنا ہی جان سکتا ہے جتنا پروردگار چاہے۔ ¤ ➋ {وَ لٰكِنْ يُّدْخِلُ مَنْ يَّشَآءُ فِيْ رَحْمَتِهٖ:} نیکی و بدی کی تمیز اور ان میں سے کسی ایک کو اختیار کرنے کی آزادی دینے کے بعد وہ جسے چاہتا ہے اپنی رحمت میں داخل کر لیتا ہے، مگر اس کی یہ مشیت اندھی نہیں کہ اس کا کوئی قاعدہ نہ ہو، بلکہ اس سے اگلے جملے سے ظاہر ہو رہا ہے کہ وہ کون لوگ ہیں جو اللہ کی رحمت کے حق دار بنتے ہیں اور وہ کون ہیں جو اس سے محروم رہتے ہیں۔ ¤ ➌ {وَ الظّٰلِمُوْنَ مَا لَهُمْ مِّنْ وَّلِيٍّ وَّ لَا نَصِيْرٍ:} قرآن مجید کی اصطلاح میں ’’ظلم‘‘ اور ’’ظالمين‘‘ کا لفظ شرک اور مشرکین کے لیے استعمال ہوتا ہے (دیکھیے انعام : ۸۲) اور ’’قسط‘‘ اور ’’عدل‘‘ کا لفظ توحید کے لیے آیا ہے، کیونکہ سب سے بڑا ظلم شرک ہے اور سب سے بڑا عدل توحید ہے، جیسا کہ فرمایا : « شَهِدَ اللّٰهُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا هُوَ وَ الْمَلٰٓىِٕكَةُ وَ اُولُوا الْعِلْممِ قَآىِٕمًۢا بِالْقِسْطِ» [آل عمران : ۱۸ ] ’’اللہ نے گواہی دی کہ حقیقت یہ ہے کہ اس کے سوا کوئی معبود نہیں اور فرشتوں نے اور علم والوں نے بھی، اس حال میں کہ وہ انصاف پر قائم ہے۔‘‘ ارادہ و عمل کا اختیار ملنے کے بعد جن لوگوں نے اپنی جان پر ظلم کیا، اپنے خالق و مالک اور رازق کو اکیلا معبود بنانے اور اسی کی عبادت پر قائم رہنے کے بجائے غیروں کو معبود بنایا، جن کے اختیار میں کچھ بھی نہیں، تو ان کا نہ کوئی دوست ہے اور نہ کوئی مددگار۔ معلوم ہوا ایسے لوگ اللہ کی رحمت میں داخل نہیں ہوں گے، کیونکہ انھیں اپنی رحمت میں داخل کرنا اللہ تعالیٰ کے عدل اور مشیت کے خلاف ہے اور وہ خود بھی اللہ کی رحمت سے ناامید ہیں، ورنہ کبھی غیروں کی طرف نہ جاتے، جیسا کہ فرمایا : « اُولٰٓىِٕكَ يَىِٕسُوْا مِنْ رَّحْمَتِيْ » [ العنکبوت : ۲۳ ] ’’وہ میری رحمت سے ناامید ہو چکے ہیں۔‘‘یہی بات نہایت وضاحت کے ساتھ سورۂ دہر (۲۹، ۳۰) میں بیان فرمائی گئی ہے۔ہاں، جو لوگ ایمان لائے اور اس میں ظلم عظیم یعنی شرک کی آمیزش نہیں کی وہی اللہ تعالیٰ کی رحمت میں داخل ہوں گے اور وہی اس کی امید رکھ سکتے ہیں، جیسا کہ فرمایا : « اُولٰٓىِٕكَ يَرْجُوْنَ رَحْمَتَ اللّٰهِ» [ البقرۃ : ۲۱۸ ] ’’وہی اللہ کی رحمت کی امید رکھتے ہیں۔‘‘ ¤ ➍ اس آیت میں رسول اللہ صلی اللہ علیہ وسلم اور مسلمانوں کو تسلی بھی دی گئی ہے کہ اگر کچھ لوگ حق واضح ہونے کے بعد بھی ایمان نہیں لاتے اور کفر و شرک پر اڑے رہتے ہیں تو آپ کو فکر مند ہونے کی ضرورت نہیں، اللہ تعالیٰ چاہتا تو سب لوگوں کو ہدایت دے دیتا، مگر یہ جبر ہوتا جو اللہ تعالیٰ کی مشیت نہیں۔ اس نے اپنی حکمت اور مشیت کے تحت انسان کو اختیار دے رکھا ہے، جو چاہے ایمان لائے جو چاہے کفر کرے، اس لیے لوگوں میں یہ اختلاف ہمیشہ رہے گا۔ یہ مضمون متعدد آیات میں بیان ہوا ہے، دیکھیے سورۂ یونس (۹۹، ۱۰۰)، ہود (۱۱۸، ۱۱۹) اور سورۂ سجدہ (۱۳)۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { اَمِ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اَوْلِيَآءَ … :} پچھلی آیت میں جو فرمایا کہ ظالموں کے لیے نہ ولی (دوست) ہے نہ کوئی مددگار، یہ اس کی تفصیل ہے کہ آیا انھوں نے اللہ کو چھوڑ کر کوئی اولیاء، کارساز اور دوست بنا رکھے ہیں۔ سو اصل دوست جو فی الواقع کارسازی اور مدد کر سکتا ہے وہ تو صرف اللہ ہے۔ ساتھ ہی اس کی دو زبردست دلیلیں بیان فرمائیں کہ وہی مردوں کو زندگی بخشتا ہے اور بخشے گا اور وہی ہر چیز پر پوری طرح قادر ہے، کیونکہ اس کا حق وہی رکھتا ہے جس میں یہ صفات ہوں۔ پھر اس سے بڑا ظلم کیا ہو گا کہ ایسی ہستیوں کو اولیاء اور کارساز بنا لیا جائے جو کسی کو زندگی بخشنا تو درکنار خود مرنے والے ہیں، فرمایا : « اَمْوَاتٌ غَيْرُ اَحْيَآءٍ وَ مَا يَشْعُرُوْنَ اَيَّانَ يُبْعَثُوْنَ » [ النحل : ۲۱ ] ’’مردے ہیں، زندہ نہیں ہیں اور وہ نہیں جانتے کب اٹھائے جائیں گے۔ ‘‘ ہر چیز پر قدرت تو بہت دور، ایک ذرّے کے بھی مالک نہیں ہیں۔ دیکھیے سورۂ سبا (۲۲)۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {وَ مَا اخْتَلَفْتُمْ فِيْهِ مِنْ شَيْءٍ … :} یہ آیت اگرچہ اللہ تعالیٰ کا کلام ہے مگر یہ بات رسول اللہ صلی اللہ علیہ وسلم کی زبان سے کہلوائی گئی ہے، جیسا کہ سورۂ فاتحہ بندوں کی زبانی کہلوائی گئی ہے۔ ¤ ➋ اس سے پہلی آیات میں اللہ تعالیٰ کی جو صفات بیان ہوئی ہیں کہ وہ زمین و آسمان کی ہر چیز کا مالک اور ولی و کارساز ہے، موت و حیات اس کے ہاتھ میں ہے اور وہ ہر چیز پر پوری طرح قادر ہے، ان صفات سے خود بخود وہ بات ثابت ہو رہی ہے جو اس آیت میں فرمائی ہے کہ جب مالک وہ ہے تو حاکم بھی وہی ہے اور انسانوں کے درمیان پیدا ہونے والے اختلافات کا فیصلہ بھی اسی کا کام ہے۔ وہ اختلاف عقیدہ میں ہو یا عمل میں، عبادات میں ہو یا معاملات میں، نیکی و بدی قرار دینے میں ہو یا حلال و حرام ٹھہرانے میں، غرض ہر بات میں فیصلہ اسی کا چلے گا۔ کسی اور کو یہ حق دینا کہ وہ شریعت سازی کرے یا حلال و حرام کا فیصلہ کرے درحقیقت اس کی عبادت اور اسے اللہ تعالیٰ کا شریک بنانا ہے، فرمایا : « اِنِ الْحُكْمُ اِلَّا لِلّٰهِ اَمَرَ اَلَّا تَعْبُدُوْۤا اِلَّاۤ اِيَّاهُ » [ یوسف : ۴۰ ] ’’حکم اللہ کے سوا کسی کا نہیں، اس نے حکم دیا ہے کہ اس کے سوا اور کسی کی عبادت مت کرو۔‘‘ مزید دیکھیے سورۂ یوسف (۶۷)، انعام (۵۷)، مائدہ (۴۴)، کہف (۲۶) اور سورۂ قصص (۷۰، ۸۸)۔ ¤ رسول اللہ صلی اللہ علیہ وسلم ہر فیصلہ اللہ تعالیٰ کی وحی کے ذریعے سے اور اس کے حکم کے تحت کرتے، اس لیے آپ صلی اللہ علیہ وسلم کا فیصلہ اللہ تعالیٰ کا فیصلہ ہے اور اللہ تعالیٰ نے ہر تنازع کا فیصلہ اللہ اور اس کے رسول کے سپرد کرنے کو ایمان کی شرط قرار دیا ہے، جیسا کہ فرمایا : « فَاِنْ تَنَازَعْتُمْ فِيْ شَيْءٍ فَرُدُّوْهُ اِلَى اللّٰهِ وَ الرَّسُوْلِ اِنْ كُنْتُمْ تُؤْمِنُوْنَ بِاللّٰهِ وَ الْيَوْمِ الْاٰخِرِ » [النساء : ۵۹ ] ’’پھر اگر تم کسی چیز میں جھگڑ پڑو تو اسے اللہ اور رسول کی طرف لوٹاؤ، اگر تم اللہ اور یومِ آخر پر ایمان رکھتے ہو۔‘‘ اور فرمایا : « فَلَا وَ رَبِّكَ لَا يُؤْمِنُوْنَ حَتّٰى يُحَكِّمُوْكَ فِيْمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوْا فِيْۤ اَنْفُسِهِمْ حَرَجًا مِّمَّا قَضَيْتَ وَ يُسَلِّمُوْا تَسْلِيْمًا » [ النساء : ۶۵ ] ’’پس نہیں! تیرے رب کی قسم ہے! وہ مومن نہیں ہوں گے، یہاں تک کہ تجھے اس میں فیصلہ کرنے والا مان لیں جو ان کے درمیان جھگڑا پڑ جائے، پھر اپنے دلوں میں اس سے کوئی تنگی محسوس نہ کریں جو تو فیصلہ کرے اور تسلیم کرلیں، پوری طرح تسلیم کرنا۔ ‘‘ ¤ ➌ یہود و نصاریٰ نے اپنے احبار و رہبان کو حلال و حرام کے فیصلے کا اختیار دیا تو اللہ تعالیٰ نے فرمایا کہ انھوں نے اپنے احبار و رہبان کو {’’ اَرْبَابًا مِّنْ دُوْنِ اللّٰهِ ‘‘} بنا لیا۔ دیکھیے سورۂ توبہ (۳۱) کی تفسیر۔ ¤ ➍ یہود و نصاریٰ نے ایک مدت تک حلال و حرام قرار دینے کا اختیار آسمانی شریعت کے بجائے اپنے احبار و رہبان کو دیے رکھا، آخر کار انھوں نے یہ تکلف بھی برطرف کیا اور اپنی آسمانی کتاب یا احبار و رہبان کے بجائے جمہوریت کے نام پر یہ اختیار خود سنبھال لیا کہ عوام کی اکثریت جو فیصلہ کرے وہ حق ہے، ان کے منتخب نمائندے اپنی اکثریت کے ساتھ جسے حلال کہہ دیں وہ حلال اور جسے حرام کہہ دیں وہ حرام ہے۔ آج اگر اکثریت کسی چیز کو حلال کہہ رہی ہے تو وہ حلال ہے، کچھ دن بعد اکثریت اگر حرام کہہ دے تو وہ حرام ہے۔ اب تورات کی ہر قید جو طبیعتوں پر گراں تھی توڑ دی گئی، باہمی رضا سے زنا جائز قرار دیا گیا، رجم کو کالعدم کر دیا گیا، قومِ لوط کا عمل جائز قرار دیا گیا، قتل اور قطع اعضا میں قصاص ختم کر دیا گیا اور سود حلال ٹھہرا۔ غرض جمہوریت کے نام پر ایک نئی شریعت ایجاد کی گئی جس کا رب، رسول اور شریعت سب کچھ انسان قرار پائے، اس طرح بندوں کو مالک کی گدی پر بٹھا دیا گیا۔ ¤ ➎ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : [ لَتَتْبَعُنَّ سَنَنَ مَنْ كَانَ قَبْلَكُمْ شِبْرًا شِبْرًا وَذِرَاعًا ذِرَاعًا، حَتّٰی لَوْ دَخَلُوْا جُحْرَ ضَبٍّ تَبِعْتُمُوْهُممْ، قُلْنَا يَا رَسُوْلَ اللّٰهِ! الْيَهُوْدُ وَالنَّصَارٰی؟ قَالَ فَمَنْ؟ ] [ بخاري، الاعتصام بالکتاب والسنۃ، باب قول النبي صلی اللہ علیہ وسلم : ’’ لتتبعن سنن من کان قبلکم‘‘: ۷۳۲۰، عن أبي سعید الخدري رضی اللہ عنہ ] ’’تم ہر صورت اپنے سے پہلے لوگوں کے طریقوں پر چل پڑو گے، جیسے بالشت بالشت کے ساتھ اور ہاتھ ہاتھ کے ساتھ برابر ہوتا ہے، حتیٰ کہ اگر وہ گوہ کے بل میں داخل ہوئے تو تم ان کی پیروی کرو گے۔‘‘ ہم نے کہا : ’’یا رسول اللہ! یہود و نصاریٰ کے طریقوں پر؟‘‘ آپ نے فرمایا : ’’تو اور کون؟‘‘ ¤ مسلمان خیر القرون میں اور اس کے کچھ عرصہ بعد تک صرف اور صرف قرآن و سنت پر کار بند رہے، یہ اسلام کی ترقی و عروج کا دور ہے، پھر بعض ائمہ کی تقلید شروع ہوئی اور ان کے نام پر ایسی گروہ بندی اور فرقہ سازی ہوئی کہ بعض لوگ یہ جانتے ہوئے بھی کہ ان کے امام کا قول اللہ اور اس کے رسول کے صریح خلاف ہے، اپنے امام کے قول پر اڑ گئے۔ احبار و رہبان کو ارباب بنانے کا نقشہ اہلِ کتاب کی طرح اہلِ اسلام میں بھی نظر آنے لگا، حتیٰ کہ یہ دین حق کئی مذہبوں میں تقسیم ہو گیا۔ ہر کسی کی مساجد الگ، عدالتیں اور قاضی الگ ہو گئے، امت کی وحدت جو صرف کتاب و سنت کو حاکم ماننے سے حاصل ہوتی تھی پارہ پارہ ہو گئی، مسلمانوں کی توانائیاں کفار کے ساتھ جہاد اور اس کی تیاری کے بجائے ایک دوسرے کے خلاف صرف ہونے لگیں۔ یہی لوگ حاکم تھے یہی قاضی، اصلاح کی آوازیں اٹھتی رہیں، مگر بے سود۔ چنانچہ کچھ مدت تک تو کتاب و سنت سے انحراف کے باوجود الگ الگ سلطنتوں کی شکل میں مسلمانوں کی حکمرانی کا سلسلہ چلتا رہا، پھر باہمی فساد اور ترکِ جہاد کا نتیجہ یہ ہوا کہ دو چار ملکوں کے سوا تمام مسلم ممالک نصرانی یا کمیونسٹ کفار کے قبضے میں چلے گئے، جنھوں نے جبراً ان ممالک میں اپنے کفریہ احکام نافذ کر دیے، پھر نہ کتاب و سنت کے احکام باقی رہے نہ ائمہ کے مذاہب۔ ہر جگہ کفار کا حکم چلنے لگا اور بنی اسرائیل کی طرح مسلمانوں پر بھی اللہ کے عذاب کا کوڑا کفار کی غلامی کی صورت میں برسنے لگا۔ مسلمان آزادی حاصل کرنے کے لیے مسلسل جد و جہد اور دعائیں کرتے رہے، حتیٰ کہ اللہ تعالیٰ نے ان پر رحم فرمایا اور ان کی آزادی کے لیے جد و جہد اور کفار کی باہمی جنگ عظیم کے نتیجے میں بہت سے مسلم ممالک کو آزادی ملی۔ اس کے بعد جہاد کے نتیجے میں بہت سے ممالک کمیونسٹوں کے تسلط سے بھی آزاد ہوئے، مگر تمام ممالک میں برسر اقتدار طبقے نے کفر کا وہی نظامِ حکومت برقرار رکھا جو کفار کے زمانے میں تھا، جس میں فیصلہ اللہ اوراس کے رسول کے احکام کے مطابق نہیں بلکہ انسانوں کے بنائے ہوئے قوانین کے مطابق ہوتا ہے۔ اس طرح مسلمانوں کے اہلِ کتاب کے نقش قدم پر چلنے کی پیش گوئی پوری ہو گئی۔ اللہ تعالیٰ کا دین صرف نماز روزے وغیرہ کے لیے باقی رہ گیا، گھروں، بازاروں، عدالتوں اور حکومت کے ایوانوں سے اللہ تعالیٰ کے حکم کو جلاوطن کرکے اس کی جگہ جمہوریت کے بت کی پرستش شروع کر دی گئی۔ البتہ بعض ملکوں میں یہ تکلف کیا گیا کہ اس کا نام اسلامی جمہوریت رکھ دیا گیا، حالانکہ اسلام میں حکم اللہ کا ہوتا ہے اور جمہوریت میں بندوں کا، دونوں ایک دوسرے کی ضد ہیں، کبھی جمع نہیں ہو سکتے۔ یہ ایسے ہی ہے جیسے شراب کو اسلامی شراب اور سود کو اسلامی سود کہہ کر حلال کر لیا جائے، جیسا کہ یہ ظلم بھی اس سے پہلے مسلمان اپنی جانوں پر کر چکے ہیں۔ ان کے بہت سے برسراقتدار طبقوں نے ان علماء کے اقوال کو اپنی مملکتوں میں نافذ کیا جنھوں نے صرف انگور اور کھجور کی شراب کو حرام قرار دے کر دوسرے تمام نشہ آور مشروبات پینے پر حد ختم کر دی، خواہ ان سے نشہ بھی آ جائے۔ جس کے نتیجے میں مسلمانوں کی عظیم سلطنتیں شراب کے سمندر میں غرق ہو گئیں کہ حکمران بھی پیتے تھے اور رعایا بھی اور جائز سمجھ کر پیتے تھے۔ اسی طرح سود کی بہت سی قسموں کو جائز قرار دے کر اسلامی سود رائج ہونے کے نتیجے میں طمع و ہوس کے طوفان نے ہمدردی و ایثار کا سلسلہ ختم کر دیا اور حرام ہوسِ زرّ نے مسلمانوں کو آخرت سے غافل کر دیا۔ ¤ حقیقت یہ ہے کہ اب بھی دنیا اور آخرت دونوں میں مسلمانوں کی نجات اسی میں ہے کہ وہ دوبارہ اللہ اور اس کے رسول کے فیصلے کی طرف واپس پلٹیں اور اپنی پوری زندگی میں اس کی اطاعت اختیار کریں۔ ان شاء اللہ وہ وقت آنے والا ہے جب دوبارہ خلافت علیٰ منہاج النبوۃ قائم ہو گی، جس میں اللہ کی زمین پر صرف اللہ کا حکم چلے گا۔ یہ رسول صادق صلی اللہ علیہ و وسلم کی پیش گوئی ہے اور ہر صورت پوری ہو گی۔ ہمارا کام جد و جہد ہے، اللہ چاہے گا تو ہم اپنی آنکھوں سے وہ مبارک دن دیکھیں گے، ورنہ ہمارے بعد آنے والے اسے ضرور دیکھیں گے۔ اللہ تعالیٰ سے دعا ہے کہ وہ ہمیں اپنے ان بندوں میں شامل فرمائے جو قیامت تک دین حق قائم رکھنے کے لیے لڑتے رہیں گے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَنْ يَّبْرَحَ هٰذَا الدِّيْنُ قَائِمًا يُقَاتِلُ عَلَيْهِ عِصَابَةٌ مِنَ الْمُسْلِمِيْنَ حَتّٰی تَقُوْمَ السَّاعَةُ ] [ مسلم، الإمارۃ، باب قولہ صلی اللہ علیہ وسلم : ’’لا تزال طائفۃ من أمتي ظاھرین علی الحق…‘‘ : ۱۹۲۲، عن جابر بن سمرۃ رضی اللہ عنہ ] ’’یہ دین ہمیشہ قائم رہے گا، مسلمانوں کی ایک جماعت اس پر لڑتی رہے گی، یہاں تک کہ قیامت قائم ہو۔‘‘ ¤ ➏ { فَحُكْمُهٗۤ اِلَى اللّٰهِ:} ہر جھگڑے کا فیصلہ اللہ تعالیٰ کے سپرد ہونے میں شرعی احکام کا فیصلہ بھی شامل ہے، جیسا کہ اوپر گزرا اور یہ بھی کہ دنیا میں لوگوں کے درمیان جتنے جھگڑے ہیں ان کا واضح فیصلہ قیامت کے دن اللہ تعالیٰ ہی فرمائے گا۔ دنیا میں کفار اپنے آپ کو حق پر کہتے رہیں، مگر وہاں انبیاء اور ان کے متبعین کا حق پر ہونا اور کفار کا باطل پر ہونا سب کے سامنے واضح ہو کر آ جائے گا، جیسا کہ اللہ تعالیٰ نے فرمایا : « قُلِ اللّٰهُمَّ فَاطِرَ السَّمٰوٰتِ وَ الْاَرْضِ عٰلِمَ الْغَيْبِ وَ الشَّهَادَةِ اَنْتَ تَحْكحْكُمُ بَيْنَ عِبَادِكَ فِيْ مَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ» [ الزمر : ۴۶ ]’’تو کہہ اے اللہ! آسمانوں اور زمین کو پیدا کرنے والے! ہر چھپی اور کھلی کو جاننے والے! تو ہی اپنے بندوں کے درمیان اس چیز کا فیصلہ کرے گا جس میں وہ اختلاف کیا کرتے تھے۔‘‘ ¤ ➐ { ذٰلِكُمُ اللّٰهُ رَبِّيْ:} یعنی وہی اللہ جس کی چند صفات اوپر کی آیات میں بیان ہوئیں، جنھیں تم بھی مانتے ہو، جو مختصراً یہ ہیں کہ وہ عزیز و حکیم ہے، علیّ و عظیم ہے، غفور و رحیم ہے، حقیقی ولی ہے، مردوں کو زندہ کرنے والا اور ہر چیز پر پوری طرح قادر ہے، تمام اختلافات کا فیصلہ کرنے والا ہے، وہی اللہ میرا رب ہے، ان میں سے ایک بھی صفت جب کسی اور میں پائی ہی نہیں جاتی تو میں کسی اور کو اپنا رب کیسے مان لوں؟ ¤ ➑ { ’’ عَلَيْهِ تَوَكَّلْتُ ‘‘} (اسی پر میں نے بھروسا کیا) فعل ماضی ہے اور {’’ وَ اِلَيْهِ اُنِيْبُ ‘‘} (اور اسی کی طرف میں رجوع کرتا ہوں) فعل مضارع ہے، جس میں استمرار اور ہمیشگی پائی جاتی ہے۔ {’’ عَلَيْهِ ‘‘} اور {’’ اِلَيْهِ ‘‘} پہلے آنے سے قصر کا معنی پیدا ہوا، اس لیے ترجمہ ’’اسی پر‘‘ اور ’’اسی کی طرف‘‘ کیا گیا ہے۔ یعنی میں شروع سے اسی پر بھروسا کر چکا اور اب ہر بات میں اسی کی طرف رجوع کرتا ہوں، ہر مسئلے کا حکم اسی سے لیتا ہوں، ہر جھگڑے کا فیصلہ اسی سے کرواتا ہوں اور ہر گناہ پر اسی سے معافی مانگتا ہوں اور اسی کو حق سمجھتا ہوں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ { فَاطِرُ السَّمٰوٰتِ وَ الْاَرْضِ … :} یہ اللہ ہی کو رب ماننے، اسی پر توکل اور اسی کی طرف رجوع کی مزید دلیلیں ہیں۔ ایک یہ کہ وہی کسی نمونے اور مادے کے بغیر آسمانوں کو اور زمین کو پیدا کرنے والا ہے، جب کہ تمھارے بنائے ہوئے معبودوں نے نہ ایک ذرہ پیدا کیا نہ کر سکتے ہیں۔ مزید دیکھیے سورہ حج ( ۷۳)۔ ¤ ➋ { جَعَلَ لَكُمْ مِّنْ اَنْفُسِكُمْ اَزْوَاجًا … :} آسمان و زمین کو پیدا کرنے کے بعد اس نے تمھارے لیے خود تمھی میں سے تمھارے جوڑے بنائے، تاکہ تمھاری نسل جاری ہو اور مسلسل چلتی رہے۔ اپنی جنس سے جوڑے بنانے سے جو باہمی انس حاصل ہوتا ہے وہ کسی اور جنس سے جوڑا بنانے سے حاصل نہیں ہو سکتا۔ ابن عاشور نے فرمایا کہ عربوں میں جننیوں وغیرہ سے نکاح کی جتنی داستانیں مشہور ہیں سب جھوٹی اور خود ساختہ ہیں، کچھ لوگوں کے تخیل نے انھیں ایسا دکھایا، ورنہ حقیقت میں ان کا کوئی وجود نہیں۔ اور تمھاری ضروریات کے لیے چوپاؤں کے جوڑے بنائے، تاکہ وہ بڑھتے پھیلتے رہیں اور تم ان سے اپنی ضروریات پوری کرتے رہو۔ ¤ ➌ { يَذْرَؤُكُمْ فِيْهِ:} یعنی جوڑے اس لیے بنائے تاکہ توالد و تناسل کا سلسلہ قائم رہے اور تمھاری نسل پھلتی پھولتی اور پھیلتی رہے۔ ¤ ➍ { لَيْسَ كَمِثْلِهٖ شَيْءٌ:} انسانوں کے درمیان اگرچہ رنگوں اور زبانوں کا اختلاف پایا جاتا ہے اور ہر انسان دوسرے سے الگ تشخص رکھتا ہے، اس کے باوجود وہ بہت سی چیزوں میں ایک دوسرے کے مشابہ اور ایک دوسرے کے مثل ہیں۔ چوپاؤں اور دوسرے حیوانات کا بھی یہی حال ہے۔ صرف اللہ تعالیٰ کا امتیاز ہے کہ کوئی چیز اس کی ذات یا صفات کی مثل کسی طرح بھی نہیں۔ ¤ ➎ { لَيْسَ كَمِثْلِهٖ شَيْءٌ:} اپنے سلسلۂ ازدواج اور سلسلۂ توالد و تناسل کو دیکھ کر یہ نہ سمجھ بیٹھنا کہ اللہ تعالیٰ بھی تمھاری طرح ہے۔ نہیں، خالق و مخلوق ایک جیسے نہیں ہو سکتے۔ اس جیسی کوئی چیز نہیں، نہ ذات میں، نہ صفات میں اور نہ افعال و حقوق میں۔ اس کا کوئی جوڑا نہیں اور وہ نہ کسی کی اولاد ہے، نہ کوئی اس کی اولاد ہے اور نہ کوئی اس کا شریک و ہمسر ہے ۔ مزید دیکھیے سورہ اخلاص۔ ¤ ➏ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} پر ایک مشہور سوال ہے کہ جب کہنا یہ مقصود ہے کہ اللہ کی مثل کوئی چیز نہیں تو {’’لَيْسَ مِثْلَهُ شَيْءٌ ‘‘} کافی تھا، ’’کاف‘‘ لانے کی کیا ضرورت تھی؟ ’’کاف‘‘ لانے سے تو بظاہر ایسا معنی پیدا ہو رہا ہے جو محال ہے، کیونکہ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کا ترجمہ ہو گا ’’اس کی مثل جیسی کوئی چیز نہیں‘‘ جب کہ اس ترجمے سے دو محال باتیں لازم آتی ہیں، پہلی یہ کہ اللہ کی مثل کوئی ہے جب کہ یہ محال ہے۔ دوسری یہ کہ اس کی مثل جیسی کوئی چیز نہیں، حالانکہ جب وہ اللہ کی مثل ہے تو ظاہر ہے اللہ تعالیٰ اس جیسا ہے، تبھی وہ اس کی مثل ہے۔ اس سوال کا حل اہل علم نے مختلف طریقوں سے کیا ہے، ایک یہ ہے کہ اس میں ’’کاف‘‘ زائد ہے۔ زائد کا یہ مقصد نہیں کہ بے فائدہ ہے، بلکہ وہ {’’مِثْلٌ‘‘} کی تاکید اور اس میں مبالغہ کے لیے لایا گیا ہے۔ گویا یہ بات کہ’’ اللہ تعالیٰ جیسی کوئی چیز نہیں‘‘ دو دفعہ کہی گئی ہے، ایک ’’کاف‘‘ کے ساتھ اور ایک {’’مِثْلٌ‘‘} کے ساتھ، مگر مثلیث کے معنی میں یہ مبالغہ محلِ نظر ہے۔ ¤ دوسرا حل یہ ہے کہ عرب کلام میں زور پیدا کرنے کے لیے {’’مِثْلٌ‘‘} کا لفظ کسی جیسے کے لیے نہیں بلکہ اس کی ذات اور شخصیت کے لیے استعمال کرتے ہیں، مثلاً {’’مِثْلِيْ لَا يَكْذِبُ‘‘} سے مراد یہ نہیں کہ میرے جیسا شخص جھوٹ نہیں بولتا، بلکہ یہ ہے کہ ’’میں جھوٹ نہیں بولتا۔‘‘ اسی طرح {’’مِثْلُهُ لَا يُعْبَؤُ بِهٖ‘‘} کا معنی یہ نہیں کہ اس جیسے شخص کی پروا نہیں کی جاتی، بلکہ مراد یہ ہے کہ’’ اس کی کوئی پروا نہیں کی جاتی۔‘‘ اسی طرح {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کا معنی یہ نہیں کہ اللہ تعالیٰ کی مثل جیسی کوئی چیز نہیں، بلکہ یہ ہے کہ ’’اللہ تعالیٰ کی ذات جیسی کوئی چیز نہیں۔‘‘ یہاں ’’کاف‘‘ کا اضافہ اس لیے کیا گیا ہے کہ اگر ’’کاف‘‘ نہ لایا جاتا تو عرب محاورہ ذہن میں آنے سے خیال ایک غلط مفہوم کی طرف جا سکتا تھا، جیسے {’’مِثْلُهُ لَا يُعْبَؤُ بِهٖ‘‘} کا معنی ہے کہ فلاں شخص کی کوئی پروا نہیں کی جاتی۔ اسی طرح ’’کاف‘‘ کے بغیر {’’لَيْسَ مِثْلَهُ شَيْءٌ‘‘} کا معنی یہ ہو سکتا تھا کہ (معاذ اللہ) اس کی ذات کوئی شے نہیں، یااس کی کچھ حیثیت نہیں۔ اب {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کہنے سے یہ اندیشہ دور ہو گیا اور بات صاف ہو گئی کہ اس کی ذات جیسی کوئی چیز نہیں۔ طبری، بقاعی، ابن ہشام اور بہت سے ائمہ نے یہاں {’’مِثْلٌ‘‘} کو شخص، ذات یا نفس کا ہم معنی قرار دے کر اس کے شواہد پیش فرمائے ہیں۔ یہ حل معنوی طور پر بہت مضبوط ہے۔ ¤ تیسرا حل یہ ہے کہ قرآن مجید میں متعدد مقامات پر {’’ مَثَلُ ‘‘} کا لفظ صفتِ شان کے معنی میں آیا ہے، جیسے یہ آیت : « مَثَلُ الْجَنَّةِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَ فِيْهَاۤ اَنْهٰرٌ مِّنْ مَّآءٍ غَيْرِ اٰسِنٍ» [ محمد : ۱۵ ] ’’اس جنت کی صفت جس کا متقی لوگوں سے وعدہ کیا گیا ہے، یہ ہے کہ اس میں کئی نہریں ایسے پانی کی ہیں جو بگڑنے والا نہیں۔‘‘ اسی طرح یہ آیت : « وَ لَهُ الْمَثَلُ الْاَعْلٰى فِي السَّمٰوٰتِ وَ الْاَرْضِ» [ الروم : ۲۷ ] ’’اور آسمانوں اور زمین میں سب سے اونچی صفت (شان) اسی کی ہے۔‘‘ اس لیے {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کا معنی یہ ہے کہ ’’اللہ کی صفت جیسی کوئی چیز نہیں۔‘‘ یہ حل سمجھنے میں سب سے آسان ہے، معنوی طور پر بالکل درست ہے اور ائمۂ تفسیر سے منقول ہے۔ سیاق کے لحاظ سے بھی بہت مناسب ہے، کیونکہ اس سے پہلے اللہ تعالیٰ کی بہت سی صفات بیان فرمائی گئی ہیں، پھر فرمایا کہ اس کی صفت جیسی کوئی چیز نہیں۔ ¤ ➐ {وَ هُوَ السَّمِيْعُ الْبَصِيْرُ: ’’ السَّمِيْعُ الْبَصِيْرُ ‘‘ ’’ هُوَ ‘‘} مبتدا کی خبر ہے۔ خبر پر الف لام لانے سے قصر کا مفہوم پیدا ہو گیا، اس لیے ترجمہ کیا گیا ہے ’’اور وہی سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔‘‘ یہ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} (اس کی ذات و صفات جیسی کوئی چیز نہیں) سے پیدا ہونے والے ایک سوال کا جواب ہے کہ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کے باوجود یہ کیا بات ہے کہ اللہ تعالیٰ سمیع و بصیر ہے اور انسان بھی سمیع و بصیر ہے، جیسا کہ فرمایا : «فَجَعَلْنٰهُ سَمِيْعًۢا بَصِيْرًا» [ الدھر : ۲] ’’سو ہم نے اسے خوب سننے والا، خوب دیکھنے والا بنا دیا۔‘‘ بلکہ سمع و بصر انسان کے علاوہ جانوروں میں بھی موجود ہیں اور حنانہ کے واقعہ سے معلوم ہوتا ہے کہ جمادات بھی سمع و بصر سے بے بہرہ نہیں ہیں، تو اللہ تعالیٰ بے مثل کیسے ہوا؟ اس کے جواب میں اللہ تعالیٰ نے فرمایا، کامل اور اصل سمیع و بصیر صرف اللہ تعالیٰ ہے، کسی اور میں پائی جانے والی یہ صفات اللہ تعالیٰ کی صفات سے کچھ مشابہت نہیں رکھتیں اور نہ ان کے مقابلے میں کوئی حقیقت رکھتی ہیں۔ ¤ اللہ تعالیٰ کی صفات کے متعلق بہت سے لوگوں کو ایسے اشکالات پیدا ہوئے کہ بے شمار مخلوق گمراہ ہو گئی، انھوں نے دیکھا کہ وہی الفاظ اللہ تعالیٰ کے متعلق آ رہے ہیں اور وہی مخلوق کے متعلق، مثلاً اللہ تعالیٰ کے متعلق آیا ہے : « ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ» [ الأعراف : ۵۴ ] (پھر وہ عرش پر بلند ہوا) اور مخلوق کے متعلق الفاظ ہیں : « لِتَسْتَوٗا عَلٰى ظُهُوْرِهٖ » [ الزخرف : ۱۳ ] ( تاکہ تم ان کی پیٹھوں پر جم کر بیٹھو) اور یہ الفاظ : « فَاِذَا اسْتَوَيْتَ اَنْتَ وَ مَنْ مَّعَكَ عَلَى الْفُلْكِ » [ المؤمنون : ۲۸ ] (پھر جب تو اور جو تیرے ساتھ ہیں، کشتی پر چڑھ جاؤ)۔ اللہ تعالیٰ کے فرمان : « يَدُ اللّٰهِ فَوْقَ اَيْدِيْهِمْ » [ الفتح : ۱۰ ] (اللہ کا ہاتھ ان کے ہاتھوں کے اوپر ہے) میں لفظ ’’ید‘‘ اللہ تعالیٰ اور بندوں دونوں کے لیے آیا ہے، یہی حال سمیع و بصیر کا ہے۔ اب کچھ لوگ اس وجہ سے گمراہ ہو گئے کہ انھوں نے اللہ تعالیٰ کی صفات کو مخلوق کی صفات کے مشابہ قرار دیا۔ اس کے استواء، اس کے ید، اس کے سمع و بصر اور اس کی دوسری صفات کو مخلوق کے استواء، اس کے ید، اس کے سمع و بصر اور اس کی دوسری صفات کی طرح سمجھ بیٹھے، ان لوگوں کو {’’مشبهه‘‘} کہتے ہیں اور کچھ اس وجہ سے گمراہ ہو گئے کہ انھوں نے یہ کہہ کر کہ اللہ کی مثل کوئی چیز نہیں، اس کی اُن صفات کا بھی انکار کر دیا جو اس نے خود اپنی بیان فرمائی ہیں۔ انھوں نے کہا، اللہ تعالیٰ نہ عرش پر مستوی ہے، نہ اس کا ہاتھ ہے، نہ اس کا سمع و بصر ہے، نہ وہ کلام کرتا ہے، کیونکہ اگر ہم اس کے لیے یہ چیزیں تسلیم کریں تو وہ مخلوق جیسا ٹھہرتا ہے۔ ان منکرینِ صفات کو {’’معطّله‘‘} کہتے ہیں۔ حقیقت یہ ہے کہ اللہ تعالیٰ تشبیہ و تعطیل دونوں سے بلند و برتر ہے۔ ¤ اللہ تبارک و تعالیٰ نے اپنی صفات کا مسئلہ انتہائی وضاحت کے ساتھ بیان فرما دیا ہے، اس میں کوئی پیچیدگی یا اشکال باقی نہیں رہنے دیا۔ خلاصہ اس کا یہ ہے کہ اللہ تعالیٰ نے بیان فرمایا کہ آیاتِ صفات میں حق دو چیزوں سے مرکب ہے، ایک یہ کہ اللہ تعالیٰ کو مخلوق کی صفات کی مشابہت سے پاک سمجھا جائے۔ دوسری یہ کہ اللہ تعالیٰ نے اپنی کتاب میں اپنی جو بھی صفت بیان فرمائی ہے، یا اس کے رسول صلی اللہ علیہ وسلم نے اس کی جو بھی صفت بیان فرمائی ہے اس پر مکمل ایمان رکھا جائے، کیونکہ اللہ تعالیٰ کی صفت اس سے بڑھ کر کوئی نہیں جانتا، جیسا کہ فرمایا : « قُلْ ءَاَنْتُمْ اَعْلَمُ اَمِ اللّٰهُ » [ البقرۃ : ۱۴۰ ] ’’کیا تم زیادہ جاننے والے ہو یا اللہ؟‘‘ اور اللہ تعالیٰ کے بعد رسول اللہ صلی اللہ علیہ وسلم سے زیادہ اللہ تعالیٰ کی صفات کا علم رکھنے والا کوئی نہیں۔ آپ صلی اللہ علیہ وسلم کے متعلق خود اللہ تعالیٰ نے فرماایا : « وَ مَا يَنْطِقُ عَنِ الْهَوٰى (3) اِنْ هُوَ اِلَّا وَحْيٌ يُّوْحٰى » [ النجم : 4،3 ] ’’ اور نہ وہ اپنی خواہش سے بولتا ہے۔ وہ تو صرف وحی ہے جو نازل کی جاتی ہے۔‘‘ اب جو شخص کسی ایسی صفت کی نفی کرے جو خود اللہ تعالیٰ نے اپنی کتاب میں اپنے لیے بیان فرمائی ہے، یا اس کے رسول صلی اللہ علیہ وسلم نے بیان فرمائی ہے، یہ کہہ کر کہ یہ صفت اللہ تعالیٰ کے لائق نہیں، تو وہ اپنے آپ کو اللہ اور اس کے رسول سے بھی زیادہ علم رکھنے والا سمجھتا ہے کہ اللہ کی شان کے لائق کون سی بات ہے اور کون سی نہیں۔ اور جو شخص یہ سمجھتا ہے کہ اللہ تعالیٰ کی صفات مخلوق کی صفات کے مشابہ ہیں وہ بھی ملحد اور گمراہ ہے، کیونکہ اللہ تعالیٰ نے فرمایا، اس کی مثل کوئی چیز نہیں اور یہ اللہ کی صفات کو مخلوق کی صفات کے مشابہ سمجھتا ہے۔ ہاں، جو شخص اللہ تعالیٰ کے لیے ان تمام صفات کو مانتا ہے جو اللہ تعالیٰ نے خود اپنے لیے بیان کی ہیں، یا اس کے رسول نے اس کے لیے بیان کی ہیں اور ساتھ ہی اللہ عز و جل اور اس کی صفات کو مخلوق کی مشابہت سے پاک قرار دیتا ہے، یہ صحیح مومن ہے جو اللہ تعالیٰ کی صفاتِ کمال پر بھی ایمان رکھتا ہے اور اس کی مخلوق کی مشابہت سے پاک ہونے پر بھی ایمان رکھتا ہے۔ زیرِ تفسیر آیت : « لَيْسَ كَمِثْلِهٖ شَيْءٌ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ » نے اس حقیقت کو خوب واضح فرما دیا ہے کہ اللہ تعالیٰ سمع و بصر کی صفات بھی رکھتا ہے اور کوئی چیز اس کی مثل اور مشابہ بھی نہیں۔ ¤ اللہ تعالیٰ نے اس آیت میں {’’ وَهُوَ الْعَلِيُّ الْعَظِيْمُ ‘‘} کے بجائے {’’ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ ‘‘} اس لیے فرمایا کہ سمع و بصر کی دونوں صفات تمام حیوانات میں بھی پائی جاتی ہیں، تو اللہ تعالیٰ نے بیان فرمایا کہ اللہ تعالیٰ یہ دونوں صفات رکھتا ہے، لیکن اس کی ان صفات کی بنیاد اس بات پر ہے کہ اللہ تعالیٰ کی صفات اور مخلوق کی صفات میں کوئی مماثلت نہیں، اس لیے {’’ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ ‘‘} کا لفظ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کہنے کے بعد ارشاد فرمایا۔ جن لوگوں نے اللہ تعالیٰ کی صفات کا اس لیے انکار کیا ہے کہ صفات کے لیے وہی الفاظ مخلوق پر بھی آئے ہیں، انھیں لازم ہے کہ وہ اللہ تعالیٰ کی ذات، اس کے وجود اور اس کی حیات کا بھی انکار کر دیں، کیونکہ مخلوق کی بھی ذات ہے، وہ بھی وجود رکھتی ہے اور اس میں بھی حیات پائی جاتی ہے، مگر جس طرح خالق اور مخلوق میں کوئی مماثلت نہیں اور دونوں کی ذات، وجود اور حیات میں کوئی مماثلت نہیں، اسی طرح خالق و مخلوق کی کسی صفت میں بھی کوئی مماثلت نہیں۔ اللہ تعالیٰ کی صفات کامل اور حقیقی ہیں۔ مخلوق کی صفات اگرچہ ان کے حسبِ حال موجود ہیں مگر اللہ تعالیٰ کی صفات کے مقابلے میں کالعدم ہیں، جیسا کہ فرمایا : « وَ هُوَ السَّمِيْعُ الْبَصِيْرُ» وہی سمیع و بصیر ہے اور کوئی نہیں، حالانکہ اللہ تعالیٰ نے خود ہی انسان کو سمیع و بصیر بتایا ہے۔ ¤ اس کی تھوڑی سی تفصیل سنیے، متکلمین اللہ تعالیٰ کی بے شمار صفات میں سے سات صفات کو صفاتِ معانی کہتے ہیں، وہ ہیں حیات، قدرت، ارادہ، علم، سمع، بصر اور کلام۔ اللہ تعالیٰ نے اپنی صفتِ حیات خود بیان فرمائی، فرمایا : « هُوَ الْحَيُّ لَاۤ اِلٰهَ اِلَّا هُوَ» [المؤمن : ۶۵ ] ’’وہی زندہ ہے، اس کے سوا کوئی معبود نہیں۔‘‘ اور فرمایا : « وَ تَوَكَّلْ عَلَى الْحَيِّ الَّذِيْ لَا يَمُوْتُ»  [الفرقان : ۵۸ ] ’’اور اس زندہ پر بھروسا کر جو نہیں مرے گا۔‘‘ اور دوسری بہت سی آیات۔ مخلوق کی صفت بھی حیات بیان فرمائی، فرمایا : « وَ سَلٰمٌ عَلَيْهِ يَوْمَ وُلِدَ وَ يَوْمَ يَمُوْتُ وَ يَوْمَ يُبْعَثُ حَيًّا» [ مریم : ۱۵ ] ’’اور سلام اس پر جس دن وہ پیدا ہوا اور جس دن فوت ہوگا اور جس دن زندہ ہو کر اٹھایا جائے گا۔ ‘‘ اور فرمایا : « وَ جَعَلْنَا مِنَ الْمَآءِ كُلَّ شَيْءٍ حَيٍّ» [ الأنبیاء : ۳۰ ] ’’اور ہم نے پانی سے ہر زندہ چیز بنائی۔‘‘ اور فرمایا : « يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَ يُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ» [ الروم : ۱۹ ] ’’وہ زندہ کو مردہ سے نکالتا ہے اور مردہ کو زندہ سے نکالتا ہے۔‘‘ یہاں دیکھیے {’’ هُوَ الْحَيِّ ‘‘} (صرف وہ زندہ ہے) کہنے کے باوجود مخلوق کی حیات کا بھی ذکر فرمایا۔ اس کی وجہ یہ ہے کہ حقیقی اور کامل حیات صرف اللہ تعالیٰ کی صفت ہے، مخلوق کو بھی اس کے حسبِ حال ایک طرح کی حیات حاصل ہے، مگر خالق و مخلوق کی حیات میں اتنی ہی منافات ہے جتنی دونوں کی ذات میں ہے، خالق والی حیات کا ایک شمّہ بھی مخلوق کو حاصل نہیں۔ ¤ دوسری صفت قدرت ہے۔ اللہ تعالیٰ نے اپنی یہ صفت خود بیان فرمائی ہے، فرمایا : « وَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ » [البقرۃ : ۲۸۴ ] ’’اور اللہ ہر چیز پر پوری طرح قادر ہے۔ ‘‘ مخلوق کے متعلق بھی یہ لفظ استعمال فرمایا : « اِلَّا الَّذِيْنَ تَابُوْا مِنْ قَبْلِ اَنْ تَقْدِرُوْا عَلَيْهِمْ » [ المائدۃ : ۳۴ ] ’’مگر جو لوگ اس سے پہلے توبہ کر لیں کہ تم ان پر قابو پاؤ۔ ‘‘ اللہ تعالیٰ کی قدرت حقیقی، کامل اور اس کی شان کے لائق ہے، جبکہ مخلوق کی قدرت صرف اس کے حسبِ حال ہے۔ اللہ تعالیٰ کی قدرت اور مخلوق کی قدرت میں اتنی منافات ہے جتنی دونوں کی ذات میں ہے۔ ¤ تیسری صفت ارادہ ہے، اللہ تعالیٰ نے اپنے متعلق فرمایا : « فَعَّالٌ لِّمَا يُرِيْدُ » [ ھود : ۱۰۷ ] ’’کر گزرنے والا ہے جو چاہتا ہے۔ ‘‘ اور فرمایا : « اِنَّمَااَمْرُهٗۤ اِذَاۤ اَرَادَ شَيْـًٔا اَنْ يَّقُوْلَ لَهٗ كُنْ فَيَكُوْنُ » [ یٰسٓ : ۸۲ ] ’’اس کا حکم تو، جب وہ کسی چیز کا ارادہ کرتا ہے، اس کے سوا نہیں ہوتا کہ اسے کہتا ہے ’’ہو جا‘‘ تو وہ ہو جاتی ہے۔‘‘ اور فرمایا : « يُرِيْدُ اللّٰهُ بِكُمُ الْيُسْرَ وَ لَا يُرِيْدُ بِكُمُ الْعُسْرَ » [البقرۃ : ۱۸۵ ] ’’اللہ تمھارے ساتھ آسانی کا ارادہ رکھتا ہے اورتمھارے ساتھ تنگی کا ارادہ نہیں رکھتا۔‘‘ اور دوسری آیات۔ مخلوق کے ارادے کا بھی ذکر کیا، فرمایا : «تُرِيْدُوْنَ عَرَضَ الدُّنْيَا » [ الأنفال : ۶۷ ] ’’تم دنیا کا سامان چاہتے ہو۔‘‘ اور فرمایا : «اِنْ يُّرِيْدُوْنَ اِلَّا فِرَارًا » [ الاحزاب : ۱۳ ] ’’وہ بھاگنے کے سوا کچھ چاہتے ہی نہیں۔ ‘‘ اور فرمایا : « يُرِيْدُوْنَ لِيُطْفِـُٔوْا نُوْرَ اللّٰهِ» [ الصف : ۸ ] ’’وہ چاہتے ہیں کہ اللہ کے نور کو بجھا دیں۔ ‘‘ اور دوسری آیات۔ یہاں اللہ تعالیٰ کا ارادہ حقیقی، کامل اور اس کی ذات کے لائق ہے، جبکہ مخلوق کا ارادہ اس کے حسبِ حال ہے۔ دونوں کے ارادوں میں اتنا ہی فرق ہے جتنا دونوں کی ذات میں ہے۔ ¤ چوتھی صفت علم ہے، اللہ تعالیٰ نے اپنے متعلق فرمایا : « وَ اللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ» [ البقرۃ : ۲۸۲ ] ’’اور اللہ ہر چیز کو خوب جاننے والاہے۔‘‘ اور فرمایا : « لٰكِنِ اللّٰهُ يَشْهَدُ بِمَاۤ اَنْزَلَ اِلَيْكَ اَنْزَلَهٗ بِعِللْمِهٖ » [ النساء : ۱۶۶ ] ’’لیکن اللہ شہادت دیتا ہے اس کے متعلق جو اس نے تیری طرف نازل کیا ہے کہ اس نے اسے اپنے علم سے نازل کیا ہے۔‘‘ اور مخلوق کے متعلق فرمایا : « وَ اِنَّهٗ لَذُوْ عِلْمٍ لِّمَا عَلَّمْنٰهُ» [ یوسف : ۶۸ ] ’’اور بلاشبہ وہ یقینا بڑے علم والا تھا، اس وجہ سے کہ ہم نے اسے سکھایا تھا۔‘‘ اور اس جیسی آیات۔ تو اللہ تعالیٰ کا علم کامل، حقیقی اور اس کے کمال و جلال کے لائق ہے، جب کہ مخلوق کا علم اس کے حال کے مناسب ہے۔ خالق و مخلوق کے علم میں اتنی ہی منافات ہے جتنی خالق و مخلوق کی ذات میں ہے۔ ¤ پانچویں اور چھٹی صفت سمع و بصر ہے۔ اللہ تعالیٰ نے اپنے متعلق فرمایا : «لَيْسَ كَمِثْلِهٖ شَيْءٌ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ » [ الشورٰی : ۱۱ ] ’’اس کی مثل کوئی چیز نہیں اور وہی سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔‘‘ اور فرمایا : « وَ اَنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ » [ الحج : ۶۱ ]’’اور اللہ سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔ ‘‘ اور مخلوق کے متعلق فرمایا : « اِنَّا خَلَقْنَا الْاِنْسَانَ مِنْ نُّطْفَةٍ اَمْشَاجٍ نَّبْتَلِيْهِ فَجَعَلْنٰهُ سَمِيْعًۢا بَصِيْرًا» [ الدھر : ۲ ] ’’بلاشبہ ہم نے انسان کو ایک ملے جلے قطرے سے پیدا کیا، ہم اسے آزماتے ہیں، سو ہم نے اسے خوب سننے والا، خوب دیکھنے والا بنا دیا۔‘‘ اور فرمایا : « اَسْمِعْ بِهِمْ وَ اَبْصِرْ يَوْمَ يَاْتُوْنَنَا » [ مریم : ۳۸ ] ’’کس قدر سننے والے ہوں گے وہ اور کس قدر دیکھنے والے، جس دن وہ ہمارے پاس آئیں گے۔‘‘ اور اس جیسی آیات۔ تو اللہ عز و جل کے سمع و بصر حقیقی، کامل اور اس کی شان کے لائق ہیں اور مخلوق کے سمع و بصر ان کے حال کے مناسب ہیں۔ جس طرح خالق و مخلوق کی ذات میں کوئی مماثلت نہیں، ان کے سمع و بصر میں بھی کوئی مماثلت نہیں۔ ¤ ساتویں صفت کلام ہے، اللہ تعالیٰ نے اپنے متعلق فرمایا : « وَ كَلَّمَ اللّٰهُ مُوْسٰى تَكْلِيْمًا» [ النساء : ۱۶۴ ] ’’اور اللہ نے موسیٰ سے کلام کیا، خود کلام کرنا۔ ‘‘ اور فرمایا : «اِنِّي اصْطَفَيْتُكَ عَلَى النَّاسِ بِرِسٰلٰتِيْ وَ بِكَلَامِيْ » [الأعراف : ۱۴۴ ] ’’بے شک میں نے تجھے اپنے پیغامات اور اپنے کلام کے ساتھ لوگوں پر چن لیا ہے۔‘‘ اور فرمایا : « فَاَجِرْهُ حَتّٰى يَسْمَعَ كَلٰمَ اللّٰهِ» [ التوبۃ : ۶ ] ’’تو اسے پناہ دے دے، یہاں تک کہ وہ اللہ کا کلام سنے۔‘‘ اور مخلوق کے متعلق فرمایا : « فَلَمَّا كَلَّمَهٗ قَالَ اِنَّكَ الْيَوْمَ لَدَيْنَا مَكِيْنٌ اَمِيْنٌ » [یوسف : ۵۴ ] ’’پھر جب اس نے اس سے بات کی تو کہا بلاشبہ تو آج ہمارے ہاں صاحبِ اقتدار، امانت دار ہے۔ ‘‘ اور فرمایا : «اَلْيَوْمَ نَخْتِمُ عَلٰۤى اَفْوَاهِهِمْ وَ تُكَلِّمُنَاۤ اَيْدِيْهِمْ» [ یٰسٓ : ۶۵ ] ’’آج ہم ان کے مونہوں پر مہر لگا دیں گے اور ان کے ہاتھ ہم سے باتیں کریں گے۔‘‘ اور فرمایا : «قَالُوْا كَيْفَ نُكَلِّمُ مَنْ كَانَ فِي الْمَهْدِ صَبِيًّا » [ مریم : ۲۹ ] ’’انھوں نے کہا ہم اس سے کیسے بات کریں جو ابھی تک گود میں بچہ ہے۔ ‘‘ تو اللہ تعالیٰ کا کلام حقیقی، کامل اور اس کی شان کے لائق ہے اور مخلوق کی صفت بھی کلام ہے جو اس کے حسبِ حال ہے اور خالق و مخلوق کے کلام میں اتنی ہی منافات ہے جتنی ان دونوں کی ذات میں ہے۔ اہلِ علم یہ بحث تفصیل سے پڑھنا چاہیں تو مفسر شنقیطی کی{’’ أَضْوَاءُ الْبَيَانِ ‘‘} میں سورہ اعراف کی آیت (۵۴) : « ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ» کی تفسیر ملاحظہ فرمائیں۔ ¤ تعجب ہوتا ہے کہ اتنی واضح بات بڑے بڑے مفسر اور مصنف نہیں سمجھ سکے۔ وہ جہاں {’’استوى على الْعرش‘‘} کا لفظ آئے گا اس کا انکار کرتے ہوئے کہیں گے اس سے مراد حکومت کرنا ہے، سمع و بصر آئے گا تو کہیں گے اس سے مراد علم ہے۔ اسی طرح اللہ تعالیٰ کی محبت، رضا، غضب، انتقام، اس کے نزول اور دوسری صفات کا مطلب کچھ اور ہی بیان کرتے ہوئے اصل صفات کا انکار کر دیں گے۔ حقیقت یہ ہے کہ ہدایت محض اللہ تعالیٰ کی عطا ہے، وہ جسے چاہتا ہے عطا کرتا ہے۔ سلف صالحین اور محدثین ہی اس مقام پر سلامت رہے ہیں، ان کی ترجمانی امام مالک رحمہ اللہ نے فرمائی، جب ان سے اللہ تعالیٰ کے عرش پر استواء کے متعلق پوچھا گیا تو انھوں نے فرمایا : {’’ اَلْإِسْتِوَاءُ مَعْلُوْمٌ وَالْكَيْفُ مَجْهُوْلٌ وَالسُّؤَالُ عَنْهُ  بِدْعَةٌ ‘‘} ’’اللہ تعالیٰ کا عرش پر مستوی ہونا معلوم ہے اور یہ بات کہ کیسے مستوی ہے، کسی کو معلوم نہیں اور یہ پوچھنا کہ کیسے مستوی ہے بدعت ہے۔‘‘ بالکل اسی طرح ہمارا ایمان ہے کہ اللہ تعالیٰ سمیع ہے، بصیر ہے، اس کے ہاتھ ہیں، آنکھیں ہیں، چہرہ ہے، وہ محبت کرتا ہے، ناراض ہوتا ہے، کلام کرتا ہے، ہنستا ہے، اترتا ہے اور قیامت کے دن زمین پر آئے گا، مگر ہمیں ان صفات کی کیفیت معلوم نہیں، نہ ہم عاجز مخلوق اس بے نہایت خالق کی ذات یا صفات کی حقیقت یا کیفیت کو سمجھ سکتے ہیں۔ ہم اس کی ان تمام صفات کو انھی الفاظ و معانی میں مانتے ہیں جو خود اس نے یا اس کے نبی مکرم صلی اللہ علیہ وسلم نے بیان فرمائی ہیں اور ان تمام لوگوں کی باتوں سے بری ہونے کا اعلان کرتے ہیں جو کہتے ہیں کہ اللہ تعالیٰ کی یہ صفات نہیں ہیں، یا کہتے ہیں کہ مخلوق جیسی ہیں، یا کہتے ہیں کہ ہمیں ان صفات کے معنی ہی کا علم نہیں۔ اللہ تعالیٰ ہمیں حق پر استقامت عطا فرمائے۔ (آمین)"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { لَهٗ مَقَالِيْدُ السَّمٰوٰتِ وَ الْاَرْضِ :} اس کی تفسیر کے لیے دیکھیے سورۂ زمر (۶۳)۔ ¤ ➋ { يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَآءُ وَ يَقْدِرُ:} اس کی تفسیر کے لیے دیکھیے سورۂ عنکبوت (۶۲)۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ { شَرَعَ لَكُمْ مِّنَ الدِّيْنِ مَا وَصّٰى بِهٖ نُوْحًا:} سورت کے شروع میں جو بات فرمائی : « كَذٰلِكَ يُوْحِيْۤ اِلَيْكَ وَ اِلَى الَّذِيْنَ مِنْ قَبْلِكَ اللّٰهُ الْعَزِيْزُ الْحَكِيْمُ » (اسی طرح وحی کرتا ہے تیری طرف اور ان لوگوں کی طرف جو تجھ سے پہلے تھے، وہ اللہ جو سب پر غالب، کمال حکمت والا ہے) یہاں سے وہی بات مزید تفصیل کے ساتھ بیان ہو رہی ہے۔ {’’ لَكُمْ ‘‘} سے خطاب ہماری امت کو ہے، یعنی اللہ تعالیٰ نے تمھارے لیے کوئی اجنبی یا انوکھا دین مقرر نہیں فرمایا، یہ وہی دین ہے جو اس نے پہلے اور پچھلے تمام انبیاء کے لیے مقرر فرمایا ہے۔ اس سے معلوم ہوا کہ تمام انبیاء کا دین ایک ہے اور وہ ہے اسلام، جیسا کہ فرمایا : « اِنَّ الدِّيْنَ عِنْدَ اللّٰهِ الْاِسْلَامُ » [ آل عمران : ۱۹ ] ’’بے شک دین اللہ کے نزدیک اسلام ہی ہے۔‘‘ جس کا معنی مکمل طور پر اللہ تعالیٰ کے تابع فرمان ہو جانا ہے۔ اس دین کا عنوان {’’لَا إِلٰهَ إِلاَّ اللّٰهُ‘‘} یعنی اللہ واحد کی عبادت و اطاعت ہے۔ تمام انبیاء و رسل کی طرف اسی ایک دین کی وحی کی گئی ہے، فرمایا : « وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ»  [ الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔‘‘ سورۂ انعام میں توحید کی تاکید اور شرک کا رد کرنے کے بعد نوح اور ابراہیم علیھما السلام سمیت اٹھارہ پیغمبروں کا ذکر ان کا نام لے کر فرمایا، پھر ان کے آباء، اولاد اور بھائیوں کا ذکر کرکے فرمایا کہ اگر یہ لوگ شرک کرتے تو ان کا وہ سب کچھ ضائع ہو جاتا جو وہ کرتے رہے تھے۔ اس کے بعد آپ صلی اللہ علیہ وسلم کو ان کے طریقے پر چلنے کا حکم دیا اور فرمایا : « اُولٰٓىِٕكَ الَّذِيْنَ هَدَى اللّٰهُ فَبِهُدٰىهُمُ اقْتَدِهْ » [الأنعام : ۹۰ ] ’’یہی وہ لوگ ہیں جنھیں اللہ نے ہدایت دی، سو تو ان کی ہدایت کی پیروی کر۔‘‘ ¤ ➋ دین کن چیزوں کا نام ہے؟ اللہ تعالیٰ نے فرمایا : « وَ مَاۤ اُمِرُوْۤا اِلَّا لِيَعْبُدُوا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ حُنَفَآءَ وَ يُقِيْمُوا الصَّلٰوةَ وَ يُؤْتُوا الزَّكٰوةَ وَ ذٰلِكَ دِيْنُ الْقَيِّمَةِ » [ البینۃ : ۵ ] ’’اور انھیں اس کے سوا حکم نہیں دیا گیا کہ وہ اللہ کی عبادت کریں، اس حال میں کہ اس کے لیے دین کو خالص کرنے والے، ایک طرف ہونے والے ہوں اور نماز قائم کریں اور زکوٰۃ دیں اور یہی مضبوط ملت کا دین ہے۔‘‘ اس سے معلوم ہوا کہ اخلاص کے ساتھ اللہ واحد کی عبادت کرنا، نماز قائم کرنا اور زکوٰۃ دینا دین ہے، جس کا پہلی امتوں کو بھی حکم تھا۔ صحیح بخاری اور صحیح مسلم میں مروی مشہور حدیثِ جبریل میں رسول اللہ صلی اللہ علیہ وسلم نے اسلام، ایمان اور احسان کی تفصیل فرمائی، پھر قیامت اور اس کی چند علامات کا ذکر فرمایا، جب جبریل علیہ السلام چلے گئے تو آپ صلی اللہ علیہ وسلم نے ے فرمایا : [ فَإِنَّهُ جِبْرِيْلُ أَتَاكُمْ يُعَلِّمُكُمْ دِيْنَكُمْ ] [ مسلم، الإیمان، باب بیان الإیمان و الإسلام… : ۸۔ بخاري : ۵۰ ] ’’وہ جبریل( علیہ السلام ) تھے، تمھارے پاس آئے تھے، تمھیں تمھارا دین سکھا رہے تھے۔‘‘ اس سے معلوم ہوا کہ اسلام کے پانچوں ارکانن دین ہیں، اللہ تعالیٰ، اس کے فرشتوں، اس کے رسولوں، اس کی کتابوں، یوم آخرت اور تقدیر پر ایمان دین ہے، عمل میں اخلاص اور احسان دین ہے، قیامت کے معاملات کی فکر دین ہے۔ پھر جب ایمان دین ہے تو ایمان میں شامل وہ تمام چیزیں بھی دین ہیں جنھیں قرآن مجید یا حدیث میں ایمان یا ایمان کی شاخ قرار دیا گیا ہے۔ امام بخاری رحمہ اللہ نے {’’بَابُ أُمُوْرِ الْإِيْمَانِ‘‘} میں قرآن مجید کی دو آیات نقل فرمائی ہیں، ایک سورۂ بقرہ کی آیت : « لَيْسَ الْبِرَّ اَنْ تُوَلُّوْا وُجُوْهَكُمْ قِبَلَ الْمَشْرِقِ وَ الْمَغْرِبِ وَ لٰكِنَّ الْبِرَّ مَنْ اٰمَنَ بِاللّٰهِ وَ الْيَوْمِ الْاٰخِرِ وَ الْمَلٰٓىِٕكَةِ وَ الْكِتٰبِ وَ النَّبِيّٖنَ وَ اٰتتَى الْمَالَ عَلٰى حُبِّهٖ ذَوِي الْقُرْبٰى وَ الْيَتٰمٰى وَ الْمَسٰكِيْنَ وَ ابْنَ السَّبِيْلِ وَ السَّآىِٕلِيْنَ وَ فِي الرِّقَابِ وَ اَقَامَ الصَّلٰوةَ وَ اٰتَى الزَّكٰوةَ وَ الْمُوْفُوْنَ بِعَههْدِهِمْ اِذَا عٰهَدُوْا وَ الصّٰبِرِيْنَ فِي الْبَاْسَآءِ وَ الضَّرَّآءِ وَ حِيْنَ الْبَاْسِ اُولٰٓىِٕكَ الَّذِيْنَ صَدَقُوْا وَ اُولٰٓىِٕكَ هُمُ الْمُتَّقُوْنَ» [ البقرۃ : ۱۷۷ ] ’’نیکی یہ نہیں کہ تم اپنے منہ مشرق اور مغرب کی طرف پھیرو اور لیکن اصل نیکی اس کی ہے جو اللہ اور یوم آخرت اور فرشتوں اور کتاب اور نبیوں پر ایمان لائے اور مال دے اس کی محبت کے باوجود قرابت والوں اور یتیموں اور مسکینوں اور مسافر اور مانگنے والوں کو اور گردنیں چھڑانے میں۔ اور نماز قائم کرے اور زکوٰۃ دے اور جو اپنا عہد پورا کرنے والے ہیں جب عہد کریں اور خصوصاً جو تنگی اور تکلیف میں اور لڑائی کے وقت صبر کرنے والے ہیں، یہی لوگ ہیں جنھوں نے سچ کہا اور یہی بچنے والے ہیں۔ ‘‘ اور سورۂ مومنون کی ابتدائی آیات : «قَدْ اَفْلَحَ الْمُؤْمِنُوْنَ (1) الَّذِيْنَ هُمْ فِيْ صَلَاتِهِمْ خٰشِعُوْنَ (2) وَ الَّذِيْنَ هُمْ عَنِ اللَّغْوِ مُعْرِضُوْنَ (3) وَ الَّذِيْنَ هُمْ لِلزَّكٰوةِ فٰعِلُوْنَ (4) وَ الَّذِيْنَ هُمْ لِفُرُوْجِهِمْ حٰفِظُوْنَ (5) اِلَّا عَلٰۤى اَزْوَاجِهِمْ اَوْ مَا مَلَكَتْ اَيْمَانُهُمْ فَاِنَّهُمْ غَيْرُ مَلُوْمِيْنَ (6) فَمَنِ ابْتَغٰى وَرَآءَ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْعٰدُوْنَ (7) وَ الَّذِيْنَ هُمْ لِاَمٰنٰتِهِمْ وَ عَهْدِهِمْ رٰعُوْنَ (8) وَ الَّذِيْنَ هُمْ عَلٰى صَلَوٰتِهِمْ يُحَافِظُوْنَ (9) اُولٰٓىِٕكَ هُمُ الْوٰرِثُوْنَ (10) الَّذِيْنَ يَرِثُوْنَ الْفِرْدَوْسَ هُمْ فِيْهَا خٰلِدُوْنَ » [ المؤمنون : ۱تا۱۱ ] ’’یقینا کامیاب ہوگئے مومن۔ وہی جو اپنی نماز میں عاجزی کرنے والے ہیں۔ اور وہی جو لغو کاموں سے منہ موڑنے والے ہیں۔ اور وہی لوگ جو (ہر عمل) پاک ہونے ہی کے لیے کرنے والے ہیں۔اور وہی جو اپنی شرم گاہوں کی حفاظت کرنے والے ہیں۔ مگر اپنی بیویوں، یا ان (عورتوں) پر جن کے مالک ان کے دائیں ہاتھ بنے ہیں تو بلاشبہ وہ ملامت کیے ہوئے نہیں ہیں۔ پھر جو اس کے سوا تلاش کرے تو وہی لوگ حد سے بڑھنے والے ہیں۔ اور وہی جو اپنی امانتوں اور اپنے عہد کا لحاظ رکھنے والے ہیں۔ اور وہی جو اپنی نمازوں کی خوب حفاظت کرتے ہیں۔ یہی لوگ ہیں جو وارث ہیں۔ جو فردوس کے وارث ہوں گے، وہ اس میں ہمیشہ رہنے والے ہیں۔‘‘ اس کے بعد یہ حدیث بیان فرمائی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْإِيْمَانُ بِضْعٌ وَسِتُّوْنَ شُعْبَةً، وَالْحَيَاءُ شُعْبَةٌ مِنَ الْإِيْمَانِ ] [ بخاري، الإیمان، باب أمور الإیمان : ۹۔ مسلم : ۳۵ ] ’’ایمان کی ساٹھ(۶۰) سے کچھ زیادہ شاخیں ہیں اور حیا بھی ایمان کا جزو ہے۔‘‘ اس کے بعد مختلف ابواب میں امورِ دین کا بیان فرمایا ہے۔ ¤ خلاصہ یہ کہ تمام انبیاء کا اصل دین ایک ہے، البتہ کسی عمل کی ادائیگی کی کیفیت میں فرق ہو سکتا ہے۔ مثلاً نماز ہر امت پر فرض تھی، اس کے اوقات اور رکعات کی تعداد وغیرہ میں فرق ہو سکتا ہے۔ روزہ سب پر فرض تھا، مگر اس کی کیفیت میں اختلاف معلوم ہے۔ زکوٰۃ ہر امت پر فرض تھی، مگر اس کے نصاب اور مقدار وغیرہ میں فرق ہو سکتا ہے۔ اسی طرح مختلف اقوام اور اوقات کے لحاظ سے بعض اشیاء کی تحلیل و تحریم میں اللہ تعالیٰ کی وحی کے مطابق نسخ ہو سکتا ہے، تبدیلی ہو سکتی ہے اور ہوتی ہے۔ بعض امتوں میں کئی معاملات میں تخفیف اور بعض میں سختی ہو سکتی ہے، مگر اصل دین ایک ہے۔ یہی مطلب ہے اس حدیث کا جو اس سورت کی تیسری آیت کی تفسیر میں گزر چکی ہے : [اَلْأَنْبِيَاءُ إِخْوَةٌ لِعَلاَّتٍ ] [ بخاري : ۳۴۴۳ ] ’’انبیاء علاتی (مختلف ماؤں سے پیدا ہونے والے) بھائی ہیں۔‘‘یہاں تک کہ خاتم النّبیین صلی اللہ علیہ وسلم پر اللہ تعالیٰ نے اپنا دین مکمل فرما دیا، فرمایا : « اَلْيَوْمَ اَكْمَلْتُ لَكُمْ دِيْنَكُمْ وَ اَتْمَمْتُ عَلَيْكُمْ نِعْمَتِيْ وَ رَضِيْتُ لَكُمُ الْاِسْلَامَ دِيْنًا » [ المائدۃ : ۳ ] ’’آج میں نے تمھارے لیے تمھارا دین کامل کردیا اور تم پر اپنی نعمت پوری کر دی اور تمھارے لیے اسلام کو دین کی حیثیت سے پسند کر لیا۔‘‘ ¤ ➌ {وَ الَّذِيْۤ اَوْحَيْنَاۤ اِلَيْكَ وَ مَا وَصَّيْنَا بِهٖۤ … :} اگرچہ تمام انبیاء کا دین ایک تھا، مگر یہاں صرف پانچ پیغمبروں کا ذکر فرمایا اور ان کی ترتیب بھی ان کے زمانے کے حساب سے نہیں رکھی۔ مفسرین فرماتے ہیں تمام انبیاء کا نام لینا تو ممکن نہ تھا اور نہ ہی اس کی ضرورت تھی (دیکھیے مومن : ۷۸) اس لیے ہر مقام پر اس کے مناسب انبیاء کا ذکر فرمایا۔ یہاں پہلے دو رسولوں کا ذکر فرمایا جن میں سے نوح علیہ السلام زمین والوں کی طرف سب سے پہلے رسول تھے، جیسا کہ حدیث شفاعت میں ہے۔ [ دیکھیے بخاري : ۳۳۴۰ ] اس سے پہلے آدم علیہ السلام بے شک نبی تھے، مگر انھیں کسی امت کی طرف مبعوث نہیں کیا گیا تھا۔ سب سے پہلے رسول کے ساتھ ہی سب سے آخری نبی صلی اللہ علیہ وسلم کا ذکر کیا گیا، مطلب یہ ہے کہ اللہ تعالیٰ کا مقرر کردہ دین پہلے رسول سے آخری رسول تک ایک ہی ہے۔ اس کے بعد تین جلیل القدر رسولوں کا ذکر فرمایا، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کی تشریف آوری کے وقت آسمانی مذاہب میں سے انھی تینوں کے پیروکار ہونے کے مدعی تمام دنیا میں پائے جاتے تھے۔ عرب کے مشرکین ابراہیمی ہونے کے دعوے دار تھے، یہودی موسیٰ علیہ السلام اور نصرانی عیسیٰ علیہ السلام کے امتی کہلاتے تھے۔ ان کے علاوہ کسی پیغمبر کی طرف منسوب کوئی قابل ذکر قوم نہ تھی۔ اس لیے فرمایا کہ ان سب کا دین ایک ہے، جو محمد صلی اللہ علیہ وسلم لے کر آئے ہیں۔ سورۂ احزاب میں بھی ان پانچ انبیاء کا ذکر ایک آیت میں آیا ہے۔ دیکھیے سورۂ احزاب (۷)۔ ¤ ➍ { اَنْ اَقِيْمُوا الدِّيْنَ:} یعنی اللہ تعالیٰ نے ان تمام پیغمبروں کو حکم دیا کہ دین قائم کرو۔ دین قائم کرنے میں خود اس پر عمل کرنا بھی شامل ہے، اس کی دعوت و تبلیغ بھی اور عملاً اسے نافذ کرنا بھی۔ دعوت کے ساتھ ساتھ حسبِ استطاعت کفار سے جنگ کا بھی حکم دیا، اس وقت تک کہ وہ کلمہ پڑھیں، نماز قائم کریں اور زکوٰۃ ادا کریں۔ سورۂ توبہ میں مشرکین کے متعلق حکم دیا کہ انھیں چار ماہ تک مکہ میں آنے جانے کی اجازت ہے، فرمایا : « فَاِذَا انْسَلَخَ الْاَشْهُرُ الْحُرُمُ فَاقْتُلُوا الْمُشْرِكِيْنَ حَيْثُ وَجَدْتُّمُوْهُمْ وَ خُذُوْهُمْ وَ احْصُرُوْهُمْ وَ اقْعُدُوْا لَهُمْ كُلَّ مَرْصَدٍ فَاِنْ تَابُوْا وَ اَقَامُوا الصَّلٰوةَ وَ اٰتَوُا الزَّكٰوةَ فَخَلُّوْا سَبِيْلَهُمْ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ » [ التوبۃ : ۵ ] ’’پس جب حرمت والے مہینے نکل جائیں تو ان مشرکوں کو جہاں پاؤ قتل کرو اور انھیں پکڑو اور انھیں گھیرو اور ان کے لیے ہر گھات کی جگہ بیٹھو، پھر اگر وہ توبہ کر لیں اور نماز قائم کریں اور زکوٰۃ ادا کریں تو ان کا راستہ چھوڑ دو۔ بے شک اللہ بے حد بخشنے والا، نہایت رحم والا ہے۔‘‘ ابن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتّٰی يَشْهَدُوْا أَنْ لاَ إِلٰهَ إِلاَّ اللّٰهُ وَأأَنَّ مُحَمَّدًا رَسُوْلُ اللّٰهِ، وَ يُقِيْمُوا الصَّلاَةَ، وَ يُؤْتُوا الزَّكَاةَ ، فَإِذَا فَعَلُوْا ذٰلِكَ عَصَمُوْا مِنِّيْ دِمَاءَهُمْ وَ أَمْوَالَهُمْ إِلاَّ بِحَقِّ الْإِسْلاَمِ ، وَحِسَابُهُمْ عَلَی اللّٰهِ ] [ بخاري، الإیمان، باب : « فإن تابوا و أقاموا الصلاۃ… » : ۲۵ ] ’’مجھے حکم دیا گیا ہے کہ میں لوگوں سے لڑوں، یہاں تک کہ وہ شہادت دیں کہ اللہ کے سوا کوئی عبادت کے لائق نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں اور نماز قائم کریں اور زکوٰۃ دیں، تو جب وہ ایسا کریں تو انھوں نے مجھ سے اپنے خون اور اموال محفوظ کر لیے، مگر اسلام کے حق کے ساتھ اور ان کا حساب اللہ پر ہے۔‘‘ ¤ اہلِ کتاب میں سے جو لوگ دینِ حق قبول نہیں کرتے ان سے جزیہ وصول کرنے تک لڑتے رہنے کا حکم دیا، فرمایا : « قَاتِلُوا الَّذِيْنَ لَا يُؤْمِنُوْنَ بِاللّٰهِ وَ لَا بِالْيَوْمِ الْاٰخِرِ وَ لَا يُحَرِّممُوْنَ مَا حَرَّمَ اللّٰهُ وَ رَسُوْلُهٗ وَ لَا يَدِيْنُوْنَ دِيْنَ الْحَقِّ مِنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ حَتّٰى يُعْطُوا الْجِزْيَةَ عَنْ يَّدٍ وَّ هُمْ صٰغِرُوْنَ » [ التوبۃ : ۲۹ ] ’’لڑو ان لوگوں سے جو نہ اللہ پر ایمان رکھتے ہیں اور نہ یومِ آخر پر اور نہ ان چیزوں کو حرام سمجھتے ہیں جو اللہ اور اس کے رسول نے حرام کی ہیں اور نہ دین حق کو اختیار کرتے ہیں، ان لوگوں میں سے جنھیں کتاب دی گئی ہے، یہاں تک کہ وہ ہاتھ سے جزیہ دیں اور وہ حقیر ہوں۔ ‘‘ ظاہر ہے دین کا قیام اور اس پر پوری طرح عمل اسی وقت ہو سکتا ہے جب وہ دوسرے تمام ادیان پر غالب ہو، جیسا کہ فرمایا : « هُوَ الَّذِيْۤ اَرْسَلَ رَسُوْلَهٗ بِالْهُدٰى وَ دِيْنِ الْحَقِّ لِيُظْهِرَهٗ عَلَى الدِّييْنِ كُلِّهٖ وَ كَفٰى بِاللّٰهِ شَهِيْدًا» [ الفتح : ۲۸ ] ’’وہی ہے جس نے اپنا رسول ہدایت اور دین حق کے ساتھ بھیجا، تاکہ اسے ہر دین پر غالب کر دے اور اللہ گواہ کے طور پر کافی ہے۔ ‘‘ ¤ دین اسلام میں نماز پڑھنا اور اپنی زکوٰۃ دے دینا کافی نہیں، اللہ کی زمین پر اس کا نظام قائم کرنا بھی ضروری ہے کہ ہر شخص مسجد میں آ کر نماز پڑھے اور زکوٰۃ ادا کرے، فرمایا : «وَ لَيَنْصُرَنَّ اللّٰهُ مَنْ يَّنْصُرُهٗ اِنَّ اللّٰهَ لَقَوِيٌّ عَزِيْزٌ (40) اَلَّذِيْنَ اِنْ مَّكَّنّٰهُمْ فِي الْاَرْضِ اَقَامُوا الصَّلٰوةَ وَ اٰتَوُا الزَّككٰوةَ وَ اَمَرُوْا بِالْمَعْرُوْفِ وَ نَهَوْا عَنِ الْمُنْكَرِ وَ لِلّٰهِ عَاقِبَةُ الْاُمُوْرِ » [ الحج : ۴۰، ۴۱ ] ’’اور یقینا اللہ ضرور اس کی مدد کرے گا جو اس کی مدد کرے گا، بے شک اللہ یقینا بہت قوت والا، سب پر غالب ہے۔ وہ لوگ کہ اگر ہم انھیں زمین میں اقتدار بخشیں تو وہ نماز قائم کریں گے اور زکوٰۃ دیں گے اور اچھے کام کا حکم دیں گے اور برے کام سے روکیں گے، اور تمام کاموں کا انجام اللہ ہی کے قبضہ میں ہے۔ ‘‘ اسلام کا بہت بڑا حصہ وہ ہے جس پر عمل اسی صورت میں ہو سکتا ہے جب حکومت کی باگ ڈور ایمان والوں کے ہاتھ میں ہو، اللہ تعالیٰ نے اپنی کتاب نازل کرنے کا مقصد بیان فرمایا : « اِنَّاۤ اَنْزَلْنَاۤ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَاۤ اَرٰىكَ اللّٰهُ » [ النساء : ۱۰۵ ] ’’بے شک ہم نے تیری طرف یہ کتاب حق کے ساتھ نازل کی، تاکہ تو لوگوں کے درمیان اس کے مطابق فیصلہ کرے جو اللہ نے تجھے دکھایا ہے۔ ‘‘ ظاہر ہے لوگوں کے درمیان اللہ کے حکم کے مطابق فیصلہ تبھی ہو سکے گا جب اس کے مطابق فیصلہ کرنے والوں کی حکومت ہو گی، کفار کی سلطنت میں نماز کا وہ نظام جس میں ہر مسلم حتیٰ کہ منافقین بھی مسجد میں آ کر نماز پڑھتے ہیں، خواہ سست کھڑے ہو کر پڑھیں یا دکھاوے کے لیے پڑھیں، قائم ہو ہی نہیں سکتا۔ (دیکھیے نساء : ۱۴۳) زکوٰۃ کی تحصیل (توبہ : ۱۰۳) اور اس کی اللہ کے حکم کے مطابق تقسیم (توبہ : ۶۰) مسلمانوں کی اپنی حکومت کے علاوہ ممکن نہیں۔ سود کو بند کرنے کا حکم اور سود خوری جاری رکھنے والوں کے خلاف اعلان جنگ اسی وقت عمل میں آ سکتا ہے کہ ملک کی حکومت اور معیشت ایمان والوں کے ہاتھ میں ہو۔ کتاب اللہ میں قتل اور جراحات کے قصاص کا حکم (بقرہ : ۱۷۸۔ مائدہ : ۴۵)، چوری پر ہاتھ کاٹنے کا حکم (مائدہ : ۳۸) اور زنا اور قذف پر حد جاری کرنے کا حکم (نور : ۲تا ۴) مسلم حکام کو دیا گیا ہے، کفار کی عدالت اور ان کی پولیس کو نہیں دیا گیا اور نہ ہی وہ کبھی اسے نافذ کریں گے۔ اس کتاب میں مسلمانوں پر کفار سے قتال اس لیے فرض نہیں کیا گیا (بقرہ : ۱۹۰، ۲۱۶) کہ وہ کفار کی حکومت میں رہ کر ان کی فوج میں بھرتی ہو کر کفر کی خاطر لڑیں گے اور کفار سے جزیہ لینے کا حکم (توبہ : ۲۹) اس مفروضے کے ساتھ نہیں دیا گیا کہ مسلمان کفار کے محکوم رہ کر ان سے جزیہ وصول کریں گے۔ اسلامی احکام کا یہ نقشہ صرف مدینہ میں جا کر ہی پیش نہیں ہوا، مکی سورتوں میں بھی یہی بات سمجھائی گئی ہے۔ دیکھیے سورۂ بنی اسرائیل (۸۰، ۸۱)، قصص (۸۵)، روم (۱ تا ۷)، صافات (۱۷۱ تا ۱۷۳)، ص (۱۱)، قمر (۴۳ تا ۴۵) اور سورۂ مزمل (۲۰)۔ ¤ رسول اللہ صلی اللہ علیہ وسلم کی زندگی اقامتِ دین کا بہترین نمونہ ہے۔ آپ صلی اللہ علیہ وسلم نے دین قائم کرنے کے لیے دعوت و تبلیغ اور تلوار دونوں سے پورے عرب کو حلقۂ بگوش اسلام کیا اور ایسی حکومت قائم کر دی جو اللہ تعالیٰ کے پورے دین پر عمل کی ضامن تھی۔ آپ صلی اللہ علیہ وسلم کے بعد خلفائے اسلام نے اس فریضہ کی تکمیل کی، حتیٰ کہ اللہ کا دین زمین کے مشرق و مغرب میں قائم ہو گیا۔ پھر مسلمان اپنی نااہلی اور کتاب اللہ کے تقاضوں کو نہ سمجھنے یا جان بوجھ کر اسے پس پشت پھینک کر جہاد ترک کر دینے کے نتیجے میں کفار کے محکوم ہو گئے۔ اب ان میں سے کسی کے ہاتھ میں اسلام کی دو چار چیزیں ہیں اور کسی کے ہاتھ میں پانچ دس یا کم و بیش۔ ان کی باقی ساری زندگی کفر کے نظام کی پابند ہے اور افسوس یہ کہ وہ اس پر قانع ہیں اور کفر کے نظام کے پرزے بن چکے ہیں اور ان کے بہت سے لوگ دین اسلام کے غلبے سے مایوس ہو کر جمہوریت اور کفر کے دوسرے نظاموں کو توڑنے کی کوشش کے بجائے انھیں اسلام ثابت کرنے کی جدوجہد میں لگ گئے ہیں۔ ہاں! رسول اللہ صلی اللہ علیہ وسلم کی بشارت کے مطابق ایک مجاہدین کی جماعت ’’طائفہ منصورہ‘‘ باقی ہے اور ہمیشہ رہے گی، جو کبھی کفر کی بالادستی قبول نہیں کرے گی اور دین کے غلبہ کے لیے زبانی کلامی فلسفوں کے بجائے دعوت کے ساتھ ساتھ قتال کا فریضہ بھی سر انجام دیتی رہے گی اور ہمیشہ اللہ تعالیٰ کی نصرت سے بہرہ یاب رہے گی۔ اللہ تعالیٰ ہمیں بھی اس مبارک طائفہ میں شامل فرما دے۔ (آمین) ¤ ➎ { وَ لَا تَتَفَرَّقُوْا فِيْهِ:} دین میں جدا جدا ہونے کی کئی صورتیں ہیں، جن میں سے ایک یہ ہے کہ اہلِ کتاب کی طرح بعض باتوں میں کتاب اللہ پر عمل کیا جائے اور بعض میں کتاب اللہ کے بجائے اپنی مرضی پر عمل کیا جائے، جیسا کہ اہلِ کتاب کے متعلق فرمایا : « اَفَتُؤْمِنُوْنَ بِبَعْضِ الْكِتٰبِ وَ تَكْفُرُوْنَ بِبَعْضٍ » [ البقرۃ : ۸۵ ] ’’پھر کیا تم کتاب کے بعض پر ایمان لاتے ہو اور بعض کے ساتھ کفر کرتے ہو؟‘‘ ایک صورت یہ ہے کہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم سے جو بات ثابت نہیں اسے دین بنا لیا جائے۔ اسے بدعت کہتے ہیں۔ سنت ہمیشہ ایک ہو گی، کیونکہ جس کی سنت ہے وہ ایک ہے، جبکہ بدعات کا شمار نہیں ہو گا، کیونکہ انھیں ایجاد کرنے والوں کا شمار نہیں ہو سکتا۔ پھر جب آدمی اصل سنت سے بہکتا ہے تو ایک بدعت پر نہیں رہتا بلکہ بدعات اس کے رگ و ریشہ میں سرایت کر جاتی ہیں اور اس کے ساتھ ہی وہ اپنا الگ فرقہ بنا لیتا ہے۔ اسے معلوم ہو بھی جائے کہ اس کی یا اس کے فرقے یا پیشوا کی فلاں بات کتاب اللہ یا حدیثِ رسول صلی اللہ علیہ وسلم کے خلاف ہے پھر بھی وہ اپنے دھڑے کی غلط بات پر اڑا رہے گا، حق کی طرف رجوع نہیں کرے گا اور اپنی یا اپنے امام کی بات کو کتاب اللہ اور سنت رسول صلی اللہ علیہ وسلم کے تابع کرنے کے بجائے آیات و احادیث کے معانی میں تحریف کرکے انھیں اپنے مطابق ثابت کرے گا۔ نام اس کا تاویل رکھے گا اور کہے گا کہ ہر وہ آیت یا حدیث جو ہمارے فرقے کے بزرگوں کے خلاف ہے اس کی تاویل ہو گی یا وہ منسوخ ہے۔ حالانکہ وہ آیت یا حدیث اس کے بزرگوں کے خلاف نہیں، کیونکہ وہ تو ان بزرگوں سے بہت پہلے نازل ہو چکی ہیں، بلکہ اس کے بزرگوں کی بات آیت یا حدیث کے خلاف ہے کہ انھیں اس کا علم نہیں ہو سکا، یا ان کے ذہن میں نہیں رہی۔ معاویہ بن ابو سفیان رضی اللہ عنھما نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم ہم میں کھڑے ہوئے اور فرمایا : [ أَلاَ إِنَّ مَنْ قَبْلَكُمْ مِنْ أَهْلِ الْكِتَابِ افْتَرَقُوْا عَلٰی ثِنْتَيْنِ وَسَبْعِيْنَ مِلَّةً وَ إِنَّ هٰذِهِ الْمِلَّةَ سَتَفْتَرِقُ عَلٰی ثَلاَثٍ وَسَبْعِيْنَ، ثِنْتَانِ وَ سَبْعُوْنَ فِي  النَّارِ وَ وَاحِدَةٌ فِي الْجَنَّةِ وَهِيَ الْجَمَاعَةُ، وَإِنَّهُ سَيَخْرُجُ مِنْ أُمَّتِيْ أَقْوَامٌ تَجَارٰی بِهِمْ تِلْكَ الْأَهْوَاءُ كَمَا يَتَجَارَی الْكَلَبُ لِصَاحِبِهِ لاَ يَبْقٰی مِنْهُ عِرْقٌ وَلاَ مَفْصِلٌ إِلاَّ دَخَلَهُ ] [أبوداوٗد، السنۃ، باب شرح السنۃ : ۴۵۹۷ ] ’’سنو! تم سے پہلے اہل کتاب کے لوگ بہتر (۷۲) ملتوں میں جدا جدا ہو گئے اور یہ ملت تہتر (۷۳) ملتوںمیں جدا جدا ہو جائے گی، بہتر (۷۲) آگ میں اور ایک جنت میں ہو گی اور وہی ’’الجماعة ‘‘ ہے اور حقیقت یہ ہے کہ میری امت میں کئی اقوام نکلیں گی جن میں یہ خواہشات (بدعات) اس طرح سرایت کر جائیں گی جیسے کتے کے ہلکاؤ کی بیماری اس کے مریض میں سرایت کر جاتی ہے، نہ اس کی کوئی رگ باقی رہتی ہے اور نہ کوئی جوڑ مگر وہ اس میں داخل ہو جاتی ہے۔‘‘ مزید دیکھیے سورہ انعام کی آیت (۱۵۹) : «اِنَّ الَّذِيْنَ فَرَّقُوْا دِيْنَهُمْ وَ كَانُوْا شِيَعًا» کی تفسیر ۔ ¤ ➏ { كَبُرَ عَلَى الْمُشْرِكِيْنَ مَا تَدْعُوْهُمْ اِلَيْهِ:} وہ بات جس کی دعوت آپ مشرکین کو دیتے ہیں وہ ان پر بہت بھاری ہے، مراد اس سے ایک اللہ کی عبادت کی دعوت ہے۔ کفار پر یہ دعوت اس قدر بھاری ہے کہ اس کا ماننا تو درکنار وہ اس کا سننا بھی برداشت نہیں کرتے، فرمایا : « وَ اِذَا ذُكِرَ اللّٰهُ وَحْدَهُ اشْمَاَزَّتْ قُلُوْبُ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ وَ اِذَا ذُكِرَ الَّذِيْنَ مِنْ دُوْنِهٖۤ اِذَاهُمْ يَسْتَبْشِرُوْنَ » [ الزمر : ۴۵ ] ’’ اور جب اس اکیلے اللہ کا ذکر کیا جاتا ہے تو ان لوگوں کے دل تنگ پڑجاتے ہیں جو آخرت پر یقین نہیں رکھتے اور جب ان کا ذکر ہوتا ہے جو اس کے سوا ہیں تو اچانک وہ بہت خوش ہو جاتے ہیں۔ ‘‘ وہ اس مجلس سے اٹھ جاتے ہیں جس میں ایک معبود کی بات ہو، فرمایا : « اَجَعَلَ الْاٰلِهَةَ اِلٰهًا وَّاحِدًا اِنَّ هٰذَا لَشَيْءٌ عُجَابٌ (5) وَ انْطَلَقَ الْمَلَاُ مِنْهُمْ اَنِ امْشُوْا وَ اصْبِرُوْا عَلٰۤى اٰلِهَتِكُمْ اِنَّ هٰذَا لَشَيْءٌ  يُّرَادُ » [ صٓ : ۵، ۶ ]"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { وَ مَا تَفَرَّقُوْۤا اِلَّا مِنْۢ بَعْدِ مَا جَآءَهُمُ الْعِلْمُ:} یعنی ان کے فرقوں میں بٹ جانے کا باعث یہ نہیں تھا کہ انھیں اللہ اور اس کے رسول کے احکام کا علم نہیں تھا اور لاعلمی کی وجہ سے انھوں نے اپنے اپنے الگ مذاہب اور مکاتب فکر بنا لیے، بلکہ یہ تفرقہ اللہ تعالیٰ کی طرف سے علم آ جانے کے بعد پیدا ہوا۔ ¤ ➋ { بَغْيًۢا بَيْنَهُمْ:} یعنی الگ الگ گروہ اور فرقے بنانے کا باعث ان کا باہمی حسد، ضد اور عناد تھا، جس کی وجہ سے اللہ کے حکم کے سامنے سر جھکانے کے بجائے انھوں نے اپنے اپنے قیاس و آراء کی بنیاد پر الگ الگ فرقے بنا ئے اور کتاب اللہ میں تحریف تک سے گریز نہ کیا، حتیٰ کہ نوبت باہمی اختلاف سے بڑھ کر ایک دوسرے کی مخالفت اور پھر جنگ و جدل تک پہنچ گئی۔ مزید دیکھیے سورۂ بقرہ (۲۱۳) کی تفسیر۔ ¤ ➌ { وَ لَوْ لَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ … :} اس کی تفسیر کے لیے دیکھیے سورۂ حم سجدہ (۴۵) کی تفسیر۔ ¤ ➍ { وَ اِنَّ الَّذِيْنَ اُوْرِثُوا الْكِتٰبَ مِنْۢ بَعْدِهِمْ … :} یعنی شروع میں فرقے بنانے والوں نے علم ہونے کے باوجود حق سے انحراف کیا اور اللہ کی کتاب میں ایسی لفظی و معنوی تحریفیں کیں کہ بعد میں آنے والے لوگ، جو اس کتاب کے وارث بننے کے قابل تو نہ تھے مگر انھیں اس کا وارث بنا دیا گیا، وہ اس کتاب میں کی گئی لفظی اور معنوی تحریفات کی وجہ سے اس کی حقانیت کے متعلق ایسے شک میں مبتلا ہو گئے جو انھیں شدید مضطرب اور بے چین رکھتا تھا۔ انھیں اپنی کتابوں کے الہامی ہونے کا یقین باقی نہ رہا، بلکہ وہ کسی دلیل و برہان کے بغیر محض آنکھیں بند کرکے آبا و اکابر کی تقلید کرتے چلے گئے۔ ¤ ➎ مفسر عبدالرحمن کیلانی لکھتے ہیں : ’’ان وارثوں کے اپنی الہامی کتابوں کے بارے میں شک میں پڑنے کی کئی وجوہ تھیں، جن میں سب سے بڑی وجہ یہ ہے کہ ان کتابوں کی اصل زبان اور اصل عبارت کو محفوظ رکھ کر آنے والی نسلوں تک نہ پہنچایا گیا، صرف تراجم سے کام لیا جانے لگا اور ان تراجم کو ہی الہامی کتاب سمجھا جانے لگا۔ دوسری وجہ یہ تھی کہ بزرگوں کے اقوال اور الحاقی مضامین ان میں شامل کر دیے گئے، حتیٰ کہ ان دونوں قسم کی عبارتوں میں تمیز کرنا مشکل ہو گیا اور تیسری وجہ یہ تھی کہ ان کی تاریخی سند بھی ضائع کر دی گئی (بلکہ سند رکھی ہی نہیں گئی)۔ ان سب باتوں کا اثر یہ ہوا کہ بعد میں آنے والے علماء خود اس کتاب سے شک میں پڑ گئے کہ کون سا حصہ درست اور الہامی ہے اور کون سی عبارت بزرگوں کے اقوال وغیرہ ہیں اور کسی بات کا صحیح فیصلہ کرنے میں یہی شک و شبہ انھیں اضطراب میں ڈالے رکھتا تھا۔‘‘ (تیسیر القرآن)"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { فَلِذٰلِكَ فَادْعُ:} مفسر ابن کثیر رحمہ اللہ نے فرمایا : ’’یہ آیت کریمہ دس جملوں پر مشتمل ہے، جن میں سے ہر جملہ اپنی جگہ مستقل مضمون ہے۔ آیت الکرسی کے سوا کوئی اور آیت ایسی نہیں۔‘‘ (ابن کثیر) {’’ فَلِذٰلِكَ ‘‘} جار مجرور {’’ فَلِذٰلِكَ فَادْعُ ‘‘} کے متعلق ہے، پہلے لانے سے اس میں اختصاص پیدا ہو گیا، یعنی لوگوں کو کسی اور نہیں بلکہ دین کے اسی طریقے کی دعوت دیں جو اس نے وحی کے ذریعے سے تمام انبیاء کے لیے مقرر فرمایا ہے اور وہ ہے ایک اللہ کی عبادت۔ اس کے دین کو قائم کرنا اور اس میں جدا جدا نہ ہو جانا، بلکہ اکٹھے ہو کر اللہ کی رسی کو مضبوطی سے تھام لینا۔ ¤ ➋ { وَ اسْتَقِمْ كَمَاۤ اُمِرْتَ:} دوسروں کو دعوت کے لیے خود اس پر عمل اور استقامت ضروری ہے، اس لیے اس پر مضبوطی سے قائم رہنے کا حکم دیا۔ {’’ وَ اسْتَقِمْ ‘‘} اور {’’ كَمَاۤ اُمِرْتَ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ ہود (۱۱۲)۔ ¤ ➌ { وَ لَا تَتَّبِعْ اَهْوَآءَهُمْ:} یعنی آپ اس کی پیروی کریں جس کا اللہ کی طرف سے آپ کو حکم دیا گیا ہے، اس کے سوا جو کچھ ہے محض خواہشات ہیں۔ اس لیے ان لوگوں کو خوش کرنے کے لیے یا ان سے صلح کی خاطر ان کی خواہشات کی پیروی مت کریں اور نہ دین میں کسی قسم کی مداہنت سے کام لیں۔ مزید دیکھیے سورۂ بقرہ (۱۴۵) اور سورۂ مائدہ (۴۹)۔ ¤ ➍ { وَ قُلْ اٰمَنْتُ بِمَاۤ اَنْزَلَ اللّٰهُ مِنْ كِتٰبٍ:} اہلِ کتاب چونکہ کسی آسمانی کتاب کو مانتے اور کسی کو نہیں مانتے تھے، اسی طرح اپنی کتاب کے بھی بعض حصوں کو مانتے تھے اور بعض کو نہیں مانتے تھے۔ (دیکھیے بقرہ : ۸۵) حالانکہ اللہ تعالیٰ کی طرف سے آنے والی ہر کتاب اور اس کی ہر بات پر ایمان لانا ضروری ہے۔ اس لیے فرمایا، ان سے کہہ دیں کہ میں فرقہ پرستوں کی طرح نہیں جو مرضی کی بات مانتے ہیں دوسری نہیں، بلکہ میں اللہ تعالیٰ کی طرف سے نازل شدہ ہر کتاب پر ایمان رکھتا ہوں، وہ خواہ کوئی ہو۔ میں پہلے انبیاء کی تکذیب کے لیے نہیں بلکہ ان کی تصدیق کے لیے آیا ہوں۔ تم پر بھی لازم ہے کہ تمھاری کتابوں میں میری اور قرآن کی جو تصدیق موجود ہے اس پر بھی ایمان لاؤ، تاکہ تمھارا ایمان بھی اللہ تعالیٰ کی نازل کردہ ہر کتاب پر ہو۔ مزید دیکھیے سورۂ بقرہ کی آیت (۱۳۶) : «لَا نُفَرِّقُ بَيْنَ اَحَدٍ مِّنْهُمْ » کی تفسیر۔ ¤ ➎ { وَ اُمِرْتُ لِاَعْدِلَ بَيْنَكُمْ:} عدل کا معنی انصاف اور برابری ہے، اس کے مقابلے میں ظلم ہے۔ یعنی مجھے حکم دیا گیا ہے کہ تمھارے درمیان عدل کروں، تمام لوگوں کو انصاف مہیا کروں، دنیا میں جو ظلم و زیادتی ہو رہی ہے اس کا خاتمہ کروں اور فیصلہ کرتے ہوئے اپنے پرائے میں فرق نہ کروں، بلکہ سب کو برابر رکھوں۔ اسی طرح چھوٹے و بڑے، کمزور و طاقتور اور امیر و غریب کے درمیان فرق نہ کروں۔ اس جملے میں اس غلبہ و اقتدار کی طرف بھی اشارہ ہے جو مدینہ جا کر حاصل ہونے والا تھا، کیونکہ بے اختیار شخص کیا عدل کرے گا اور اس کے پاس عدل طلب کرنے کے لیے کون جائے گا۔ ¤ ➏ { اَللّٰهُ رَبُّنَا وَ رَبُّكُمْ:} تمام بندوں میں عدل کا حکم اس لیے ہے کہ اللہ ہی ہمارا رب ہے اور وہی تمھارا رب ہے، ہم تم سب اس کے بندے ہیں۔ سو عدل کا حکم بھی سب کے لیے ہے، خواہ اپنا ہو یا پرایا، ضعیف ہو یا شریف، حکمران ہو یا رعایا۔ ¤ ➐ {لَنَاۤ اَعْمَالُنَا وَ لَكُمْ اَعْمَالُكُمْ:} اس کے دو مطلب ہو سکتے ہیں، ایک اظہارِ براء ت، جیسے فرمایا : « لَكُمْ دِيْنُكُمْ وَ لِيَ دِيْنِ » [الکافرون : ۶ ] ’’تمھارے لیے تمھارا دین اور میرے لیے میرا دین ہے۔‘‘ اور جیسا کہ سورۂ انعام (۱۳۵)، ہود (۹۳، ۱۲۱) اور سورۂ زمر (۳۹)میں اظہارِ براء ت فرمایا ہے۔ دوسرا مطلب یہ کہ ہمارے اچھے یا برے اعمال ہمارے لیے ہیں اور تمھارے اعمال تمھارے لیے ہیں، نہ ہمارے اچھے اعمال تمھیں دیے جائیں گے اور نہ تمھارے اچھے اعمال ہمیں دیے جائیں گے۔ اسی طرح نہ تم ہمارے بد اعمال میں پکڑے جاؤ گے اور نہ ہم تمھارے بد اعمال میں پکڑے جائیں گے، جیسا کہ فرمایا : « فَاِنَّمَا عَلَيْهِ مَا حُمِّلَ وَ عَلَيْكُمْ مَّا حُمِّلْتُمْ » [ النور : ۵۴ ] ’’ تو اس کے ذمے صرف وہ ہے جو اس پر بوجھ ڈالا گیا ہے اور تمھارے ذمے وہ جو تم پر بوجھ ڈالا گیا۔‘‘ مزید دیکھیے سورۂ بقرہ (۱۳۹)، یونس (۴۱)، ہود (۳۵) اور قصص (۵۵)۔ ¤ ➑ {لَا حُجَّةَ بَيْنَنَا وَ بَيْنَكُمْ:} یعنی جھگڑا کرنے کی ضرورت نہیں، جو بات حق تھی وہ ہم نے دلائلل کے ساتھ واضح کر دی، ہمیں تمھارے باطل پر اور اپنے حق پر ہونے کا پورا یقین ہے۔ تم اپنی بات پر اڑے ہوئے ہو، اس لیے جھگڑے کا کوئی فائدہ نہیں، تم جھگڑو بھی تو ہم جھگڑنے کے لیے تیار نہیں، اب تلوار کے ساتھ فیصلہ باقی رہ جاتاہے، وہ اپنے وقت پر ہو جائے گا۔ ¤ ➒ { اَللّٰهُ يَجْمَعُ بَيْنَنَا:} باطل پر جمے رہنے اور اس پر ناحق جھگڑا کرنے سے ڈراتے ہوئے فرمایا کہ اللہ تعالیٰ ہمیں اور تمھیں جمع کرے گا، کیا تمھیں اس بات سے خوف نہیں آتا کہ ناحق جھگڑے کا وہاں کیا جواب دو گے؟ ¤ ➓ { وَ اِلَيْهِ الْمَصِيْرُ:} اسی کی طرف سب کو لوٹ کر جانا ہے، وہاں پورا انصاف ہو جائے گا۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {وَ الَّذِيْنَ يُحَآجُّوْنَ فِي اللّٰهِ مِنْۢ بَعْدِ …: ’’ دَاحِضَةٌ ‘‘ ’’دَحَضَ يَدْحَضُ دَحْضًا و دُحُوْضًا ‘‘} (ف) {’’دَحَضَتِ الْحُجَّةُ‘‘} دلیل باطل ہونا اور {’’دَحَضَتِ الرِّجْلُ‘‘} پاؤں کا پھسل جانا۔ {’’حُجَّةٌ‘‘} کا معنی  جھگڑا بھی ہے اور دلیل بھی۔ پچھلی آیت میں فرمایا : « لَا حُجَّةَ بَيْنَنَا وَ بَيْنَكُمْ » کہ ’’ہمارے درمیان اور تمھارے درمیان کوئی جھگڑا نہیں‘‘ کیونکہ جو بات حق تھی وہ ہم نے تمھیں پہنچا دی، اب جھگڑے کا کوئی فائدہ نہیں، اس آیت میں فرمایا کہ جب اللہ تعالیٰ کی بات قبول کر لی گئی، اس کا حق ہونا واضح ہو گیا، حتیٰ کہ بہت سے سمجھ دار لوگ اسے قبول کر چکے اور بہت سے دل میں تسلیم کر چکے ہیں تو لوگ اب بھی اللہ تعالیٰ کے بارے میں خواہ مخواہ جھگڑ رہے ہیں اور اپنے خیال میں بڑی مضبوط دلیلیں لا رہے ہیں، کبھی اس کی توحید میں بحث کرتے ہیں، جیسا کہ فرمایا : « اَجَعَلَ الْاٰلِهَةَ اِلٰهًا وَّاحِدًا » [ صٓ : ۵ ] ’’کیا اس نے تمام معبودوں کو ایک ہی معبود بنا ڈالا؟‘‘ کبھی اس کی دوبارہ زندہ کرنے کی قدرت کے بارے میں جھگڑتے ہیں،جیسا کہ فرمایا : «مَنْ يُّحْيِ الْعِظَامَ وَ هِيَ رَمِيْمٌ » [ یٰسٓ : ۷۸ ] ’’کون ہڈیوں کو زندہ کرے گا، جب کہ وہ بوسیدہ ہوں گی؟ ‘‘ کبھی اس کے انسان کو رسول بنا کر بھیجنے کے بارے میں جھگڑتے ہیں، فرمایا : « وَ قَالُوْا مَالِ هٰذَا الرَّسُوْلِ يَاْكُلُ الطَّعَامَ وَ يَمْشِيْ فِي الْاَسْوَاقِ » [الفرقان : ۷ ] ’’اور انھوں نے کہا اس رسول کو کیا ہے کہ کھانا کھاتا ہے اور بازاروں میں چلتا پھرتا ہے۔‘‘ کبھی اس کے شرکاء بنانے کے جواز میں اپنے معبودوں کو اللہ کے ہاں سفارشی اور اس کے قریب کرنے والے قرار دیتے ہیں، فرمایا : « هٰۤؤُلَآءِ شُفَعَآؤُنَا عِنْدَ اللّٰهِ» [ یونس : ۱۸ ] ’’یہ لوگ اللہ کے ہاں ہمارے سفارشی ہیں۔‘‘ اور فرمایا : « مَا نَعْبُدُهُمْ اِلَّا لِيُقَرِّبُوْنَاۤ اِلَى اللّٰهِ زُلْفٰى» [ الزمر : ۳ ] ’’ہم ان کی عبادت نہیں کرتے مگر اس لیے کہ یہ ہمیں اللہ سے قریب کر دیں۔‘‘ ان کی مزعومہ یہ اور اس جیسی سب دلیلیں اللہ تعالیٰ کے ہاں باطل اور بے کار ہیں، انھیں اس جھگڑے سے کچھ حاصل نہیں ہو گا۔ ¤ ➋ { وَ عَلَيْهِمْ غَضَبٌ: ’’ غَضَبٌ ‘‘} پر تنوین تعظیم کی ہے، یعنی ان پر بھاری غضب ہے۔ ¤ ➌ { وَ لَهُمْ عَذَابٌ شَدِيْدٌ:} جس کا دنیا میں مظاہرہ اہلِ مکہ پر مسلط خوف، قحط، جنگِ بدر اور دوسرے معرکوں میں ہوا اور جس کی شدت قیامت کے دن نعمان بن بشیر رضی اللہ عنھما نے رسول اللہ صلی اللہ علیہ وسلم سے نقل فرمائی، آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ لَرَجُلٌ تُوْضَعُ فِيْ أَخْمَصِ قَدَمَيْهِ جَمْرَةٌ يَغْلِيْ مِنْهَا دِمَاغُهُ ] [ بخاري، الرقاق، باب صفۃ الجنۃ والنار : ۶۵۶۱ ] ’’قیامت کے دن آگ والوں میں سب سے ہلکے عذاب والا شخص وہ ہو گا جس کے دونوں پاؤں کے تلوؤں میں ایک انگارا رکھا جائے گا، جس سے اس کا دماغ کھول رہا ہو گا۔‘‘"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {اَللّٰهُ الَّذِيْۤ اَنْزَلَ الْكِتٰبَ بِالْحَقِّ وَ الْمِيْزَانَ:’’ الْكِتٰبَ ‘‘ } میں الف لام جنس کا ہو تو مراد تمام روحانی کتابیں ہیں اور اگرعہد کا ہو تو مراد یہ کتاب یعنی قرآن مجید ہے۔ یعنی کیا جانتے بھی ہو کہ جس اللہ کے بارے میں تم جھگڑ رہے ہو وہ کون ہے اور اس کی صفات اور اس کے احکام کیسے معلوم ہو سکتے ہیں؟ فرمایا اللہ وہی ہے جس نے یہ کتاب یعنی قرآن مجید حق کے ساتھ نازل فرمایا ہے، اس کی ہر بات حق ہے، اس میں باطل کی آمیزش ہو ہی نہیں سکتی، جیسا کہ فرمایا : «لَا يَاْتِيْهِ الْبَاطِلُ مِنْۢ بَيْنِ يَدَيْهِ وَ لَا مِنْ خَلْفِهٖ » [ حٰمٓ السجدۃ : ۴۲ ] ’’اس کے پاس باطل نہ اس کے آگے سے آتا ہے اور نہ اس کے پیچھے سے۔‘‘ اور اسی نے میزان اتارا ہے جس کے ساتھ لوگ اپنے تمام معاملات میں انصاف کے ساتھ فیصلہ کر سکیں۔ {’’ الْمِيْزَانَ ‘‘} سے مراد اکثر مفسرین نے عدل و انصاف لیا ہے، بعض نے اس سے مراد دین حق اور بعض نے جزا و سزا کا قانون لیا ہے۔ ان میں سے جو بھی مراد لیں بات ایک ہی ہے اور اس میزان سے مراد اللہ کے دین اور اس کی شریعت پر مشتمل یہ کتاب ہی ہے جو خالق و مخلوق کے درمیان معاملات اور مخلوق کے باہمی معاملات اور تمام تنازعات کے لیے میزان ہے، جو ہر بات ترازو کی طرح تول کر صحیح یا غلط اور حق یا باطل کا فیصلہ کر دیتی ہے۔ اوپر فرمایا تھا : « وَ اُمِرْتُ لِاَعْدِلَ بَيْنَكُمْ » [الشورٰی : ۱۵ ] (اور مجھے حکم دیا گیا ہے کہ میں تمھارے درمیان انصاف کروں) اور اس آیت میں بتا دیا کہ اس کتاب پاک کی صورت میں میزان آ گئی ہے، جس کے ساتھ وہ عدل قائم کیا جائے گا۔ یہ کتاب دوسرے معاملات کی طرح پہلی کتابوں کے لیے بھی میزان اور ان کی نگران ہے کہ ان میں کون سی باتیں اللہ تعالیٰ کی طرف سے ہیں اور کون سی ملا دی گئی ہیں، جیسا کہ فرمایا : « وَ اَنْزَلْنَاۤ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ الْكِتٰبِ وَ مُهَيْمِنًا عَلَيْهِ » [ المائدۃ : ۴۸ ] ’’اور ہم نے تیری طرف یہ کتاب حق کے ساتھ بھیجی، اس حال میں کہ اس کی تصدیق کرنے والی ہے جو کتابوں میں سے اس سے پہلے ہے اور اس پر محافظ ہے۔‘‘ ¤ ➋ یہاں ایک سوال ہے کہ آیت میں {’’ الْكِتٰبَ ‘‘} اور {’’ الْمِيْزَانَ ‘‘} کے درمیان واؤ عطف ہے جو مغایرت کے لیے ہوتی ہے، جس سے ظاہر ہے کہ کتاب اور میزان الگ الگ چیزیں ہیں، اب اگر میزان سے مراد کتاب ہی ہو تو مغایرت ختم ہو جاتی ہے، اسی طرح اگر میزان سے مراد عدل و انصاف لیں تب بھی کتاب اور میزان کے درمیان مغایرت نہیں رہتی، کیونکہ اللہ تعالیٰ کی تمام کتابیں عین عدل و انصاف ہیں؟ جواب اس کا یہ ہے کہ ایک ہی چیز کا ذکر جب اس کی مختلف صفات کے ساتھ کیا جائے تو اس کا عطف خود اس پر ہو سکتا ہے، کیونکہ صفات کے تغایر کو ذوات کے تغایر کی طرح قرار دے لیا جاتا ہے۔ قرآن مجید میں اس کی مثالوں میں سے ایک مثال یہ ہے : «سَبِّحِ اسْمَ رَبِّكَ الْاَعْلَى (1) الَّذِيْ خَلَقَ فَسَوّٰى (2) وَ الَّذِيْ قَدَّرَ فَهَدٰى (3) وَ الَّذِيْۤ اَخْرَجَ الْمَرْعٰى» [ الأعلٰی : ۱ تا ۴ ] ان آیات میں {’’ الَّذِيْ ‘‘} (وہ ذات) کو عطف کے ساتھ الگ الگ بیان کیا گیا ہے، حالانکہ وہ ایک ہی ہے۔ وجہ یہ ہے کہ ہر جملے میں وہ الگ الگ صفت کے ساتھ مذکور ہے۔ کلامِ عرب میں سے اس کی مثال یہ شعر ہے : ¤ {إِلَي الْمَلِكِ الْقَرْمِ وَابْنِ الْهُمَامِ ¤ وَ لَيْثِ الْكَتِيْبَةِ فِي الْمُزْدَحَمِ} ¤ [ أضواء البیان ] ¤ ➌ {وَ مَا يُدْرِيْكَ لَعَلَّ السَّاعَةَ قَرِيْبٌ:} اور تجھے کیا چیز آگاہ کرتی ہے شاید کہ وہ قیامت بالکل نزدیک ہو اور جو سانس تم لے رہے ہو یہی آخری ہو، اس لیے اس فکر میں مت پڑو کہ وہ کب ہے، بلکہ یہ فکر کرو کہ تم نے اس کے لیے کیا تیاری کی ہے۔ انس رضی اللہ عنہ بیان کرتے ہیں کہ بادیہ والوںمیں سے ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : [ يَا رَسُوْلَ اللّٰهِ ! مَتَی السَّاعَةُ قَائِمَةٌ؟ قَالَ وَيْلَكَ وَمَا أَعْدَدْتَ لَهَا؟ قَالَ مَا أَعْدَدْتُ لَهَا إِلاَّ أَنِّيْ أُحِبُّ اللّٰهَ  وَ رَسُوْلَهُ، قَالَ إِنَّكَ مَعَ مَنْ أَحْبَبْتَ فَقُلْنَا وَ نَحْنُ كَذٰلِكَ ؟ قَالَ نَعَمْ، فَفَرِحْنَا يَوْمَئِذٍ فَرَحًا شَدِيْدًا، فَمَرَّ غُلاَمٌ لِلْمُغِيْرَةِ وَكَانَ مِنْ أَقْرَانِييْ فَقَالَ إِنْ أُخِّرَ هٰذَا فَلَنْ يُدْرِكَهُ الْهَرَمُ حَتّٰی تَقُوْمَ السَّاعَةُ ] [ بخاري، الأدب، باب ما جاء في قول الرجل ویلک : ۶۱۶۷ ] ’’یا رسول اللہ! قیامت کب قائم ہونے والی ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’افسوس تم پر! تم نے اس کے لیے تیاری کیا کی ہے؟‘‘ اس نے کہا : ’’میں نے اس کے لیے اس کے سوا کوئی تیاری نہیں کی کہ میں اللہ اور اس کے رسول سے محبت کرتا ہوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تم یقینا اس کے ساتھ ہوگے جس سے تمھیں محبت ہو گی۔‘‘ تو ہم نے کہا : ’’اور ہمارے ساتھ بھی یہی معاملہ ہو گا؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہاں!‘‘ تو ہم اس دن بہت زیادہ خوش ہوئے۔ مغیرہ کا ایک غلام وہاں سے گزرا، وہ میرا ہم عمر تھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اگر اس کی عمر دراز ہوئی تو اسے سخت بڑھاپا آنے سے پہلے پہلے قیامت قائم ہو جائے گی۔‘‘ مراد اس وقت موجود لوگوں کی قیامت ہے۔ حدیث میں قابل توجہ بات یہ ہے کہ آپ صلی اللہ علیہ وسلم نے ہر آدمی کی موت کو اس کے لیے قیامت قرار دیا، کیونکہ اس کے ساتھ اس کے لیے عمل کی مہلت ختم ہو جاتی ہے۔ ¤ ➍ یہاں ایک مشہور سوال ہے کہ {’’ السَّاعَةَ ‘‘} مؤنث ہے، اس کی خبر {’’ قَرِيْبٌ ‘‘} مذکر ہے، حالانکہ دونوں میں مطابقت ہونی چاہیے ؟ جواب کے لیے دیکھیے سورۂ اعراف کی آیت (۵۶) : «اِنَّ رَحْمَتَ اللّٰهِ قَرِيْبٌ مِّنَ الْمُحْسِنِيْنَ » کی تفسیر۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { يَسْتَعْجِلُ بِهَا الَّذِيْنَ لَا يُؤْمِنُوْنَ بِهَا: ’’اِسْتِعْجَالٌ‘‘} کا معنی ہے کسی چیز کے وقت سے پہلے اس کےلانے کا مطالبہ۔ رسول اللہ صلی اللہ علیہ وسلم قیامت سے اور اس کے قریب ہونے سے ڈراتے تو کفار اسے جلد از جلد لانے کا مطالبہ کرتے۔ مقصد ان کا صرف قیامت کا انکار اور اس کا مذاق اڑانا ہوتا تھا کہ جب وہ ان کے مطالبے پر فوراً برپا نہیں ہو گی تو وہ اسے جھٹلائیں گے اور اس کا مذاق اڑائیں گے کہ اگر قیامت ہوتی تو ہمارے مطالبے پر آ جاتی، حالانکہ وہ ان کی فرمائش پر نہیں بلکہ اللہ تعالیٰ کے مقرر کردہ وقت پر آئے گی جس کا اس کے سوا کسی کو علم نہیں۔ اس آیت میں ان کی اس جرأت کی وجہ بیان فرمائی کہ ان کے اس مطالبے کی وجہ صرف یہ ہے کہ وہ قیامت کے دن پر یقین نہیں رکھتے جس میں اعمال کی باز پرس ہو گی۔ اگر انھیں اس بات کا یقین ہوتا تو وہ کبھی اس کے لیے جلدی نہ مچاتے، بلکہ اس کی تیاری کی فکر کرتے۔ ¤ ➋ { وَ الَّذِيْنَ اٰمَنُوْا مُشْفِقُوْنَ مِنْهَا …:} یعنی منکرین قیامت کے برعکس جو لوگ اس پر یقین و ایمان رکھتے ہیں وہ ہر وقت اس بات سے سخت ڈرتے رہتے ہیں کہ کب موت آ کر عمل کی مہلت ختم کر دے، پھر قیامت کبریٰ برپا ہونے پر حساب کے وقت ان کا کیا حال ہو۔ (دیکھیے انبیاء : ۴۹۔ نور : ۳۷۔ دہر : ۷) کیونکہ انھیں یقین ہے کہ وہ ہو کر رہنے والی ہے۔ ¤ ➌ { اَلَاۤ اِنَّ الَّذِيْنَ يُمَارُوْنَ فِي السَّاعَةِ لَفِيْ ضَلٰلٍۭ بَعِيْدٍ: ’’ يُمَارُوْنَ ‘‘} کا معنی ’’شک کرتے ہیں‘‘ بھی ہے اور ’’جھگڑتے ہیں‘‘ بھی۔ یعنی قیامت کا یقین ہو تو انسان اللہ تعالیٰ سے ڈرتا ہے اور حق واضح ہونے پر اسے قبول بھی کر لیتا ہے، مگر جسے اس کے آنے ہی میں شک ہو اور وہ اس کے متعلق جھگڑا کرتا رہتا ہو وہ ایمان لانے اور نیک اعمال اختیار کرنے کو بے کار سمجھے گا اور محاسبے کا خوف نہ ہونے کی وجہ سے ہر گناہ پر دلیر ہو گا اور بڑے سے بڑے ظلم سے بھی گریز نہیں کرے گا، ایسے لوگ راہِ حق سے بہت دور جا چکے ہیں، جہاں سے ان کی واپسی ممکن نہیں۔ {’’ ضَلٰلٍۭ بَعِيْدٍ ‘‘} میں یہ بھی شامل ہے کہ وہ سیدھے راستے سے اتنے دور جا چکے ہیں کہ ان کی آنکھیں قیامت کے دن ہی کھلیں گی، جب واپس پلٹنا ممکن نہیں ہو گا۔ دیکھیے سورۂ سبا (۵۱ تا ۵۴)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { اَللّٰهُ لَطِيْفٌۢ بِعِبَادِهٖ: ’’ لَطِيْفٌ‘‘} ایسی چیز جوگرفت میں نہ آ سکے۔ اللہ تعالیٰ کی صفت ’’لطيف‘‘ اس لحاظ سے ہے کہ وہ باریک سے باریک چیز کی خبر رکھنے والا ہے اور اس لحاظ سے بھی کہ اس کی تدبیر نہایت باریک ہوتی ہے جو نظر نہیں آتی۔ اس لحاظ سے اس کا معنی لطف و کرم کرنے والا بھی ہے کہ وہ ایسے باریک طریقے سے مہربانی فرماتا ہے کہ نظر ہی نہیں آتا کہ یہ کیسے ہو گئی۔ (مفردات) گویا {’’ لَطِيْفٌ‘‘} میں دو صفتیں جمع ہیں، ایک نہایت باریک بین اور دوسری نہایت مہربانی والا۔ ان کے ضمن میں کمال علم بھی ہے جس کے بغیر باریک بینی کا سوال ہی پیدا نہیں ہوتا۔ بندوں پر لطیف ہونے کا مطلب یہ ہے کہ اس سے ان کی کوئی چھوٹی سے چھوٹی مادی یا روحانی ضرورت پوشیدہ نہیں اور وہ اپنی کمال مہربانی اور باریک طریقوں سے ایسے انتظام فرماتا ہے کہ ہر بندے کی بلکہ ہر مخلوق کی ضرورت جو اس کے حسبِ حال ہو، پوری ہو اور اسے خبر بھی نہ ہو کہ وہ کیسے پوری ہو گئی۔ بعض اہلِ علم نے فرمایا کہ {’’ بِعِبَادِهٖ ‘‘} کا لفظ اگرچہ عام ہے مگر اس سے مراد یہاں اللہ کے مومن بندے ہیں اور بعض نے فرمایا کہ{’’ بِعِبَادِهٖ ‘‘} میں مومن و کافر دونوں شامل ہیں، دنیا میں دونوں اس کے لطفِ عام سے فائدہ اٹھا رہے ہیں، البتہ آخرت میں اس کا لطف و کرم مومنوں کے لیے خاص ہو گا۔ ¤ ➋ { يَرْزُقُ مَنْ يَّشَآءُ:} اسی لیے ان میں سے بے شمار لوگوں کو جھٹلانے اور مذاق اڑانے کے باوجود بھوکا نہیں مارتا، بلکہ ان کی تمام ضرورتیں اپنے لطف و کرم سے پوری کرتا ہے۔ مگر جسے چاہتا ہے اور جتنا چاہتا ہے رزق دیتا ہے اور جس کی روزی کا دفتر بند کرنا چاہتا ہے کر دیتا ہے۔ یہ بات یہاں ذکر کرنے کی مناسبت یہ ہے کہ اکثر لوگ رزق کے پیچھے رزاق کو بھول جاتے ہیں۔ ¤ ➌ { وَ هُوَ الْقَوِيُّ:} یعنی وہ جو کرنا چاہے، جسے جتنا رزق دینا چاہے اس کی پوری قوت رکھتا ہے، کسی کام میں کسی کا محتاج نہیں۔ ¤ ➍ {الْعَزِيْزُ:} یعنی دوسرے تمام معاملات کی طرح رزق کے معاملے میں بھی کسی کا اس پر زورر نہیں کہ وہ دینا چاہے تو کوئی اسے روک سکے، یا نہ دینا چاہے تو کوئی اس سے لے سکے۔ خبر {’’ الْقَوِيُّ الْعَزِيْزُ ‘‘} پر الف لام سے قصر پیدا ہو گیا ہے ، یعنی دونوں صفتیں صرف اس میں ہیں، کسی اور میں نہیں، جیساکہ فرمایا: [ اَللّٰهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ ] [ بخاري، القدر، باب لا مانع لما أعطی اللّٰہ : ۶۶۱۵ ] ’’اے اللہ! تو جو دے اسے کوئی روکنے والا نہیں اور جو تو روک دے وہ کوئی دینے والا نہیں۔‘‘"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { مَنْ كَانَ يُرِيْدُ حَرْثَ الْاٰخِرَةِ … :} اللہ تعالیٰ نے دنیا کو آدمی کے لیے کھیت بنایا ہے، وہ اس میں جو بوئے گا وہی کاٹے گا اور جس چیز کا ارادہ کرے گا وہی ملے گی۔ اسی طرح اس نے دنیا کو تجارت کی جگہ بنایا ہے، اگر خیر کا سودا کرے گا تو نفع میں خیر ملے گی، اگر شر کا سودا کرے گا تو نتیجہ میں شر پائے گا۔ اسی طرح دنیا کو آخرت کا راستہ بنایا ہے، اگر خیر کے راستے پر چلے گا تو منزل مراد پا لے گا اور ہمیشہ کی جنت میں پہنچ جائے گا، اگر شر کے راستے پر چلے گا تو ہمیشہ کے عذاب اور دائمی غم میں جا پڑے گا۔ اس تجارت کے نفع و نقصان کا کئی آیات میں ذکر فرمایا ہے، فرمایا : «اِنَّ اللّٰهَ اشْتَرٰى مِنَ الْمُؤْمِنِيْنَ اَنْفُسَهُمْ وَ اَمْوَالَهُمْ بِاَنَّ لَهُمُ الْجَنَّةَ » [ التوبۃ : ۱۱۱ ] ’’بے شک اللہ نے مومنوں سے ان کی جانیں اور ان کے اموال خرید لیے ہیں، اس کے بدلے کہ ان کے لیے جنت ہے۔‘‘ اور فرمایا : «وَ مِنَ النَّاسِ مَنْ يَّشْرِيْ نَفْسَهُ ابْتِغَآءَ مَرْضَاتِ اللّٰهِ » [ البقرۃ : ۲۰۷ ] ’’اور لوگوں میں سے بعض وہ ہے جو اللہ کی رضا مندی تلاش کرنے کے لیے اپنی جان بیچ دیتا ہے۔‘‘ اور فرمایا : « اُولٰٓىِٕكَ الَّذِيْنَ اشْتَرَوُا الْحَيٰوةَ الدُّنْيَا بِالْاٰخِرَةِ » [ البقرۃ : ۸۶ ] ’’یہی لوگ ہیں جنھوں نے دنیا کی زندگی آخرت کے بدلے خریدی۔‘‘ ¤ ➋ پچھلی آیات میں اللہ تعالیٰ نے رزق کا قانون بیان فرمایا کہ وہ سب کے لیے یکساں نہیں، وہ جسے چاہتا ہے اور جتنا چاہتا ہے دیتا ہے اور اس میں اس کی بے شمار حکمتیں ہیں۔ (دیکھیے زخرف : ۳۲) اس آیت میں فرمایا کہ آدمی کی کوشش اور نیت کے مختلف ہونے کے لحاظ سے بھی اسے ملنے والا رزق مختلف ہے۔ ¤ ➌ آخرت کی کھیتی کا ارادہ رکھنے والے کے متعلق یہ نہیں فرمایا کہ اسے دنیا میں کچھ نہیں ملے گا۔ دنیا تو نیک ہو یا بد ہر ایک کو تھوڑی یا زیادہ ملنی ہی ملنی ہے، آخرت کے متعلق بشارت دی کہ ہم اس کے لیے اس کی کھیتی میں اضافہ کریں گے، کیونکہ اس کی نیت اور کوشش اسی کی ہے۔ اضافہ یہ ہے کہ دنیا میں اسے مزید نیکیوں کی توفیق دیں گے اور آخرت میں ایک نیکی کو دس گنا سے ہزاروں لاکھوں تک بلکہ شمار سے بھی زیادہ بڑھائیں گے اور دائمی نعمتیں عطا کریں گے، جیسا کہ فرمایا : « وَ مَنْ اَرَادَ الْاٰخِرَةَ وَ سَعٰى لَهَا سَعْيَهَا وَ هُوَ مُؤْمِنٌ فَاُولٰٓىِٕكَ كَانَ سَعْيُهُمْ مَّشْكُوْرًا » [ بني إسرائیل : ۱۹ ] ’’اور جس نے آخرت کا ارادہ کیا اور اس کے لیے کوشش کی جو اس کے لائق کوشش ہے، جب کہ وہ مومن ہو تو یہی لوگ ہیں جن کی کوشش ہمیشہ سے قدر کی ہوئی ہے۔‘‘ ¤ ➍ { وَ مَنْ كَانَ يُرِيْدُ حَرْثَ الدُّنْيَا نُؤْتِهٖ مِنْهَا …:’’ مِنْهَا ‘‘} میں {’’مِنْ‘‘} تبعیض کے لیے ہے۔ یعنی جو شخص دنیا کی کھیتی کا ارادہ کرے گا اور دنیا ہی کے لیے کوشش اور محنت کرے گا، ایک تو یہ کہ اسے وہ نہیں ملے گا جو وہ چاہتا ہے بلکہ ہم اسے اس میں سے کچھ حصہ ہی دیں گے، دوسرا یہ کہ وہ حصہ بھی ہم دنیا ہی میں دے دیں گے، آخرت میں اس کے لیے کوئی حصہ نہیں، کیونکہ آخرت کی نیت سے اس نے کچھ کیا ہی نہیں۔ یہی بات ایک اور آیت میں یوں بیان فرمائی : « مَنْ كَانَ يُرِيْدُ الْعَاجِلَةَ عَجَّلْنَا لَهٗ فِيْهَا مَا نَشَآءُ لِمَنْ نُّرِيْدُ ثُمَّ جَعَلْنَا لَهٗ جَهَنَّمَ يَصْلٰىهَا مَذْمُوْمًا مَّدْحُوْرًا» [بني إسراائیل : ۱۸ ] ’’جو شخص اس جلدی والی (دنیا) کا ارادہ رکھتا ہو ہم اس کو اس میں جلدی دے دیں گے جو چاہیں گے، جس کے لیے چاہیں گے، پھر ہم نے اس کے لیے جہنم بنا رکھی ہے، اس میں داخل ہوگا، مذمت کیا ہوا، دھتکارا ہوا۔ ‘‘ اور فرمایا : « فَمِنَ النَّاسِ مَنْ يَّقُوْلُ رَبَّنَاۤ اٰتِنَا فِي الدُّنْيَا وَ مَا لَهٗ فِي الْاٰخِرَةِ مِنْ خَلَاقٍ»  [ البقرۃ : ۲۰۰ ] ’’پھر لوگوں میں سے کوئی تو وہ ہے جو کہتا ہے اے ہمارے رب! ہمیں دنیا میں دے دے اور آخرت میں اس کا کوئی حصہ نہیں۔ ‘‘"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { اَمْ لَهُمْ شُرَكٰٓؤُا شَرَعُوْا لَهُمْ … :} ظاہر ہے اس آیت میں {’’ شُرَكٰٓؤُا ‘‘} سے مراد وہ شریک نہیں ہیں جن سے لوگ دعائیں مانگتے یا جن کی نذر و نیاز چڑھاتے اور پوجا پاٹ کرتے ہیں، کیونکہ وہ دین کا کوئی طریقہ مقرر کر سکتے ہیں نہ حلال و حرام قرار دینے میں ان کا کوئی دخل ہے اور نہ وہ کوئی قانون یا ضابطہ مقرر کر سکتے ہیں۔ لا محالہ اس سے مراد کوئی انسان یاانسانوں کی کوئی جماعت ہی ہے جنھوں نے اللہ کی شریعت کے مقابلے میں اپنی شریعت چلا رکھی ہو، حرام و حلال قرار دینے کے اختیارات اپنے ہاتھ میں لے رکھے ہوں اور لوگوں کے لیے ایسے نظام اور قانون مقرر کرتے ہوں جو اللہ تعالیٰ کی شریعت کے خلاف ہوں، پھر انھیں لوگوں میں رائج اور نافذ بھی کرتے ہوں۔ ایسے لوگ پارلیمنٹ یا ایوانوں کے ممبر بھی ہو سکتے ہیں، خود سر حکمران بھی، آستانوں اور مزاروں کے مجاور اور متولی بھی اور گمراہ قسم کے فلسفی اور مصنف بھی۔ علاوہ ازیں یہ شرکاء ایسے صالح اور متقی ائمہ بھی ہو سکتے ہیں جو اللہ کے مقابلے میں قانون سازی کا سوچ بھی نہ سکتے ہوں مگر لوگوں نے ان کے نام پر قرآن و سنت کے بالمقابل شریعت سازی کر کے انھیں اللہ کا شریک بنا رکھا ہو۔ شرک کسی بھی طرح کا ہو ظلم عظیم ہے، خواہ شرک فی العبادۃ ہو یا شرک فی الحکم۔ جس طرح وہ شخص مشرک ہے جو اللہ کے سوا کسی کی پوجا کرتا ہے، اس کی نذر و نیاز دیتا ہے، مصیبت کے وقت اسے پکارتا ہے، اسے حاجت روا یا مشکل کشا سمجھتا ہے، خواہ کسی زندہ کی پوجا کرے یا مردہ کی، جن کی کرے یا انسان یا فرشتے کی، قبر کی پوجا کرے یا بت کی، اسی طرح جو شخص اللہ تعالیٰ کے سوا کسی آدمی کو اللہ تعالیٰ کے مقابلے میں زندگی کا نظام بنانے کا یا قانون بنانے کا یا حلال و حرام قرار دینے کا اختیار دیتا ہے وہ بھی مشرک ہے۔ اللہ تعالیٰ نے ان میں سے کسی قسم کا بھی شریک بنانے کی اجازت نہیں دی۔ ¤ ➋ {وَ لَوْ لَا كَلِمَةُ الْفَصْلِ لَقُضِيَ بَيْنَهُمْ:} یعنی یہ شرک اللہ کے غضب کو دعوت دینے والی ایسی جسارت ہے کہ اگر لوگوں کو مہلت دینے کا فیصلہ نہ ہوتا اور یہ طے نہ کر دیا گیا ہوتا کہ فیصلے قیامت کے دن ہوں گے تو دنیا ہی میں ان لوگوں پر عذاب آ جاتا جو اللہ کے دین کے مقابلے میں اپنی شریعت اور قانون بناتے ہیں، یا ایسی شریعت کو قبول کرکے شرک کا ارتکاب کرتے ہیں۔ ¤ ➌ { وَ اِنَّ الظّٰلِمِيْنَ لَهُمْ عَذَابٌ اَلِيْمٌ: ’’ الظّٰلِمِيْنَ ‘‘} میں الف لام عہد کا ہے، یعنی ان ظالموں کے لیے عذاب الیم ہے جو شرک کے ظلمِ عظیم کا ارتکاب کرتے ہیں اور وہ عذابِ الیم جہنم ہے جس میں ہمیشہ رہیں گے اور جنت ان پر ہمیشہ کے لیے حرام ہے، جیسا کہ فرمایا : « اِنَّهٗ مَنْ يُّشْرِكْ بِاللّٰهِ فَقَدْ حَرَّمَ اللّٰهُ عَلَيْهِ الْجَنَّةَ وَ مَاْوٰىهُ النَّارُ وَ مَا لِلظّٰلِممِيْنَ مِنْ اَنْصَارٍ» [ المائدۃ : ۷۲ ] ’’بے شک حقیقت یہ ہے کہ جو بھی اللہ کے ساتھ شریک بنائے سو یقینا اس پر اللہ نے جنت حرام کر دی اور اس کا ٹھکانا آگ ہے اور ظالموں کے لیے کوئی مدد کرنے والے نہیں۔ ‘‘"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {تَرَى الظّٰلِمِيْنَ مُشْفِقِيْنَ مِمَّا كَسَبُوْا … : ’’ الظّٰلِمِيْنَ ‘‘} سے یہاں  بھی وہی ظالم یعنی کافر و مشرک مراد ہیں جن کا اوپر ذکر ہوا ہے، کیونکہ کوئی اسم معرف باللّام ہو کر دوبارہ آئے تو اس سے پہلا ہی مراد ہوتا ہے اور اس لیے کہ ان کے مقابلے میں ایمان اور عمل صالح والے لوگوں کا ذکر آ رہا ہے، یعنی {’’ وَ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ …۔‘‘} اس آیت میں قیامت کے دن ان مشرکین کی حالت کا نقشہ کھینچا ہے۔ عذاب سے پہلے اس کا شدید خوف بجائے خود ایک بڑا عذاب ہے، پھر ہر حال میں ان کے کفر و شرک کا وبال ان پر آ کر رہنے والا ہے، خواہ ڈریں یا نہ ڈریں۔ دنیا میں کفار قیامت سے بے خوف تھے اور اس کا مذاق اڑاتے تھے، جیسا کہ پیچھے گزرا ہے : «يَسْتَعْجِلُ بِهَا الَّذِيْنَ لَا يُؤْمِنُوْنَ بِهَا » [الشورٰی : ۱۸ ] ’’اسے وہ لوگ جلدی مانگتے ہیں جو اس پر ایمان نہیں رکھتے۔‘‘ قیامت کے دن وہی کافر سخت خوف زدہ ہوں گے۔ ان کے برعکس ایمان والے دنیا میں قیامت سے سخت خوف زدہ رہتے تھے، جیسا کہ پہلے گزرا ہے : « وَ الَّذِيْنَ اٰمَنُوْا مُشْفِقُوْنَ مِنْهَا» [ الشورٰی : ۱۷ ] ’’اور وہ لوگ جو ایمان لائے، وہ اس (قیامت) سے ڈرنے والے ہیں۔‘‘ سو اب وہ جنتوں کے باغوں میں بے خوف ہوں گے۔ ¤ ➋ {وَ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ فِيْ رَوْضٰتِ الْجَنّٰتِ …:’’رَوْضَةٌ‘‘} کا معنی ہے {’’الْمَوْضِعُ النَّزِهُ الْكَثِيْرُ الْخُضْرَةِ‘‘} کہ نہایت صاف ستھری اور بہت سرسبز جگہ۔ {’’ رَوْضٰتِ الْجَنّٰتِ ‘‘} سے ظاہر ہے کہ جنتیں بھی بہت سی ہیں اور روضات بھی بہت سے ہیں، یعنی (مومن کسی درجے کے بھی ہوں جنت میں ہوں گے، مگر) ایمان اور عمل صالح والے جنت کے بھی پاکیزہ ترین اور سب سے سرسبز مقامات میں ہوں گے۔ جن میں سب سے عالی مقام رسول کریم صلی اللہ علیہ وسلم کا ہو گا، جیسا کہ سمرہ بن جندب رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم سے ایک طویل خواب روایت کیا ہے، جس میں ہے کہ دو فرشتوں نے پہلے آپ صلی اللہ علیہ وسلم کو مختلف گناہوں کے عذاب کا منظر دکھایا، اس کے بعد ان دونوں نے آپ صلی اللہ علیہ وسلم کو آگے چلنے کے لیے کہا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ فَانْطَلَقْنَا حَتَّی انْتَهَيْنَا إِلٰی رَوْضضَةٍ خَضْرَاءَ، فِيْهَا شَجَرَةٌ عَظِيْمَةٌ، وَ فِيْ أَصْلِهَا شَيْخٌ وَصِبْيَانٌ، وَإِذَا رَجُلٌ قَرِيْبٌ مِنَ الشَّجَرَةِ بَيْنَ يَدَيْهِ نَارٌ يُوْقِدُهَا، فَصَعِدَا بِيْ فِي الشَّجَرَةِ، وَ أَدْخَلاَنِيْ دَارًا لَمْ أَرَ قَطُّ أَحْسَنَ مِنْهَا، فِيْهَا رِجَالٌ شُيُوْخٌ وَشَبَابٌ، وَ نِسَاءٌ وَصِبْيَانٌ، ثُمَّ أَخْرَجَانِيْ مِنْهَا فَصَعِدَا بِي الشَّجَرَةَ فَأَدْخَلاَنِيْ دَارًا هِييَ أَحْسَنُ وَ أَفْضَلُ، فِيْهَا شُيُوْخٌ وَ شَبَابٌ، فَقُلْتُ طَوَّفْتُمَانِي اللَّيْلَةَ، فَأَخْبِرَانِيْ عَمَّا رَأَيْتُ ؟ قَالاَ نَعَمْ، فَذَكَرَ الْحَدِيْثَ حَتّٰی قَالَ وَوَالشَّيْخُ فِيْ أَصْلِ الشَّجَرَةِ إِبْرَاهِيْمُ عَلَيْهِ السَّلاَمُ وَالصِّبْيَانُ حَوْلَهُ فَأَوْلاَدُ النَّاسِ، وَالَّذِيْ يُوْقِدُ النَّارَ مَالِكٌ خَازِنُ النَّارِ، وَالدَّارُ الْأُوْلَی الَّتِيْ دَخَلْتَ، دَارُ عَامَّةِ الْمُؤْمِنِيْنَ، وَأَمَّا هٰذِهِ الدَّارُ، فَدَارُ الشُّهَدَاءِ، وَ أَنَا جِبْرِيْلُ، وَ هٰذَا مِيْكَاءِيْلُ، فَارْفَعْ رَأْسَكَ، فَرَفَعْتُ رَأْسِيْ، ففَإِذَا فَوْقِيْ مِثْلُ السَّحَابِ، قَالاَ ذَاكَ مَنْزِلُكَ، قُلْتُ دَعَانِيْ أَدْخُلْ مَنْزِلِيْ، قَالاَ إِنَّهُ بَقِيَ لَكَ عُمُرٌ لَمْ تَسْتَكْمِلْهُ، فَلَوِ اسْتَكْمَلْتَ أَتَيْتَ مَننْزِلَكَ ] [بخاري، الجنائز، باب ما قیل في أولاد المشرکین : ۱۳۸۶ ] ’’پھر ہم چل پڑے یہاں تک کہ ہم ایک سر سبز روضہ (باغ) میں پہنچے جس میں ایک بہت بڑا درخت تھا، اس کی جڑ (تنے) کے پاس ایک بزرگ اور کچھ بچے تھے اور اس درخت کے قریب ایک آدمی تھا جس کے سامنے آگ تھی، جسے وہ بھڑکا رہا تھا، پھر وہ دونوں مجھے لے کر درخت پر چڑھ گئے اور مجھے ایک ایسے گھر کے اندر لے گئے جس سے خوبصورت گھر میں نے نہیں دیکھا، اس میں کچھ بزرگ اور جوان آدمی اور عورتیں اور بچے تھے، پھر انھوں نے مجھے اس گھر سے نکالا اور مجھے لے کر اس درخت کے اور اوپر چڑھے اور ایک گھر کے اندر لے گئے جو پہلے سے زیادہ خوبصورت اور برتر تھا، اس میں کچھ بزرگ تھے اور کچھ جوان۔ میں نے کہا : ’’تم دونوں نے آج رات مجھے خوب گھمایا ہے، اب جو کچھ میں نے دیکھا ہے مجھے اس کی حقیقت بتاؤ؟‘‘ تو انھوں نے کہا : ’’ہاں، ٹھیک ہے (پھر انھوں نے عذاب والے مناظر کی حقیقت بتانے کے بعد کہا) اور درخت کی جڑ کے پاس جو بزرگ تھے وہ ابراہیم علیہ السلام تھے اور ان کے اردگرد بچے لوگوں کی اولاد تھے اور جو آگ بھڑکا رہا تھا وہ آگ کا خازن مالک تھا اور پہلا گھر جس میں آپ داخل ہوئے عام ایمان والوں کا گھر تھا۔ رہا یہ گھر تو یہ شہداء کا گھر ہے اور میں جبریل ہوں اور یہ میکائیل ہے، اب سر اٹھاؤ!‘‘ میں نے سر اٹھایا تو اچانک میرے اوپر بادل کی طرح کی چیز تھی۔ دونوں نے کہا : ’’وہ تمھارا گھر ہے۔‘‘ میں نے کہا : ’’مجھے چھوڑو میں اپنے گھر جاؤں۔‘‘ انھوں نے کہا : ’’آپ کی کچھ عمر باقی ہے جو آپ نے پوری نہیں کی، اگر پوری کر لو گے تو اپنے گھر میں آ جاؤ گے۔‘‘ اس حدیث سے {’’ رَوْضٰتِ الْجَنّٰتِ ‘‘} کا مفہوم بھی اچھی طرح سمجھ میں آ جاتا ہے اور یہ بھی کہ {’’ رَوْضٰتِ الْجَنّٰتِ ‘‘} میں سب سے اعلیٰ {’’رَوْضَةُ الْجَنَّةِ‘‘} ہمارے نبی کریم صلی اللہ علیہ وسلم کے لیے خاص ہے۔ ¤ ➌ ان آیات میں متعدد وجہوں سے مومنوں کو ملنے والے ثواب کی عظمت بیان کی گئی ہے، ایک یہ کہ وہ {’’ رَوْضٰتِ الْجَنّٰتِ ‘‘} میں ہوں گے، دوسری یہ کہ {’’ لَهُمْ مَّا يَشَآءُوْنَ ‘‘} یعنی انھیں وہاں جو چاہیں گے ملے گا۔ اس سے معلوم ہوا کہ انھیں حاصل ہونے والی نعمتوں کی انتہا نہیں ہو گی، کیونکہ آدمی ہر نعمت کے بعد اس سے اعلیٰ نعمت کا خواہش مند ہوتا ہے۔ تیسری {’’ عِنْدَ رَبِّهِمْ ‘‘} کہ ان کی رہائش گاہیں ان کے رب کے پڑوس میں ہوں گی۔ یہ وہ چیز ہے جس کی دعا فرعون کی بیوی نے کی تھی : « رَبِّ ابْنِ لِيْ عِنْدَكَ بَيْتًا فِي الْجَنَّةِ » [ التحریم : ۱۱ ] ’’اے میرے رب! میرے لیے اپنے پاس جنت میں ایک گھر بنا۔‘‘ چوتھی یہ کہ انھیں عطا ہونے والی نعمتوں کو اللہ تعالیٰ نے فضل کبیر قرار دیا ہے، فرمایا : «ذٰلِكَ هُوَ الْفَضْلُ الْكَبِيْرُ » پھر جسے اللہ تعالیٰ اکبر اور کبیر قرار دے اس کی عظمت کا کیا ٹھکانا ہو گا۔ پانچویں وجہ سے انھیں ملنے والے ثواب کی عظمت کا بیان اگلی آیت میں ہے۔ ¤ ➍ { ذٰلِكَ هُوَ الْفَضْلُ الْكَبِيْرُ:} اس سے معلوم ہوا کہ جنت محض اللہ تعالیٰ کا فضل ہے، اس پر کسی کا حق واجب نہیں۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ { ذٰلِكَ الَّذِيْ يُبَشِّرُ اللّٰهُ عِبَادَهُ … :} یہ پانچویں وجہ ہے۔ {’’ ذٰلِكَ ‘‘} اسم اشارہ بعید اس ثواب کی عظمت کے بیان کے لیے ہے۔ جنتوں کے باغوں اور ان کی نعمتوں کی طرف اشارہ کرکے ان کی طرف دوبارہ توجہ دلانے سے مقصود ان کی عظمت کا اظہار ہے اور ساتھ ہی ایمان اور عملِ صالح کا ذکر اس لیے ہے کہ اتنی بڑی نعمتوں کے حصول کے لیے ایمان اور عمل صالح ضروری ہے۔ ¤ ➋ { قُلْ لَّاۤ اَسْـَٔلُكُمْ عَلَيْهِ اَجْرًا اِلَّا الْمَوَدَّةَ فِي الْقُرْبٰى:’’ قَرِبَ يَقْرَبُ قُرْبًا وَ قُرْبَانًا وَ قِرْبَانًا‘‘} (س، ک) قریب ہونا۔ {’’ قُرْبٰي‘‘} اور {’’قَرَابَةً ‘‘} بھی مصدر ہیں، جیسے {’’ بُشْرٰي‘‘} اور {’’ رُجْعٰي‘‘} ہیں۔ ان کا معنی رشتہ داری اور قرابت ہے۔ رشتہ دار اور قرابت دار کے لیے ’’ذوالقربیٰ‘‘ (قرابت والا) کا لفظ استعمال ہوتا ہے، جیسا کہ فرمایا : « وَ اٰتِ ذَا الْقُرْبٰى حَقَّهٗ » [ بنی إسرائیل : ۲۶ ] ’’اور رشتہ دار کو اس کا حق دے۔‘‘ {’’ فِي الْقُرْبٰى ‘‘} میں {’’ فِيْ‘‘} تعلیل کے لیے ہے : {’’أَيْ مِنْ أَجْلِ الْقُرْبٰي‘‘} یعنی رشتہ داری کی وجہ سے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ عُذِّبَتِ امْرَأَةٌ فِيْ هِرَّةٍ حَبَسَتْهَا، حَتّٰی مَاتَتْ جُوْعًا، فَدَخَلَتْ فِيْهَا النَّارَ ] [ بخاري، المساقاۃ، باب فضل سقي الماء : ۲۳۶۵ ] ’’ایک عورت کو ایک بلی کی وجہ سے عذاب دیا گیا۔ اس نے اسے باندھ کر رکھا، یہاں تک کہ وہ بھوک سے مر گئی، تو اس کی وجہ سے وہ آگ میں داخل ہو گئی۔‘‘ یعنی آپ کہہ دیں کہ میں اس تبلیغِ دین پر تم سے کوئی مزدوری نہیں مانگتا، سوائے رشتہ داری کی وجہ سے دوستی کے کہ کچھ نہ سہی، کم از کم میرے اور تمھارے درمیان جو قرابت اور رشتہ داری ہے اس کی وجہ سے میرا حق ہے کہ مجھ سے دوستی رکھو، اس حق کا مطالبہ میں تم سے ضرور کرتا ہوں۔ چاہیے تو یہ تھا کہ تم میری بات مان لیتے، اگر نہیں مانتے تو سارے عرب میں سب سے بڑھ کر دشمنی تو نہ کرو۔ کم از کم اس قرابت کا تو خیال رکھو جو میرے اور تمھارے درمیان ہے۔ جیسا کہ ابوطالب اگرچہ ایمان نہیں لایا مگر وہ قرابت کی وجہ سے رسول اللہ صلی اللہ علیہ وسلم کی حمایت اور آپ صلی اللہ علیہ وسلم کا دفاع کرتا رہا۔ ¤ آیت کا یہی مطلب ترجمان القرآن ابن عباس رضی اللہ عنھما نے بیان فرمایا ہے۔ چنانچہ طاؤس فرماتے ہیں کہ ابن عباس رضی اللہ عنھما سے {’’ اِلَّا الْمَوَدَّةَ فِي الْقُرْبٰى ‘‘} کے متعلق سوال کیا گیا تو سعید بن جبیر کہنے لگے کہ اس سے مراد {’’ قُرْبٰي آلِ مُحَمَّدٍ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ‘‘} (آل محمد صلی اللہ علیہ وسلم کی قرابت) ہے، تو ابن عباس رضی اللہ عنھما نے فرمایا : [ عَجِلْتَ، إِنَّ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ بَطْنٌ مِنْ قُرَيْشٍ إِلاَّ كَانَ لَهُ فِيْههِمْ قَرَابَةٌ فَقَالَ إِلاَّ أَنْ تَصِلُوْا مَا بَيْنِيْ وَ بَيْنَكُمْ مِنَ الْقَرَابَةِ ] [ بخاري، التفسیر، باب قولہ : «إلا المودۃ فی القربٰی» : ۴۸۱۸ ] ’’تم نے جلدی کی، قریش کا کوئی خاندان ایسا نہ تھا جس میں نبی صلی اللہ علیہ وسلم کی قرابت اور رشتہ داری نہ ہو، تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’(میں تم سے اس پر کسی مزدوری کا سوال نہیں کرتا) مگر یہ کہ تم اس رشتہ داری کو ملاؤ جو میرے اور تمھارے درمیان ہے۔‘‘ ¤ ➌ بعض لوگ خصوصاً شیعہ اس آیت کا یہ مطلب بیان کرتے ہیں کہ آپ کہہ دیں کہ میں تم سے اس پر کسی مزدوری کا سوال نہیں کرتا مگر قرابت والوں سے دوستی کا، یعنی میں تم سے اس پر اس کے سوا کچھ نہیں مانگتا کہ تم میرے قرابت داروں سے دوستی رکھو۔ نبی کریم صلی اللہ علیہ وسلم کے مومن قرابت داروں سے دوستی اپنی جگہ مسلمہ ہے، جو دوسرے دلائل سے ثابت ہے، مگر اس آیت کا وہ مطلب ہر گز نہیں جو ان لوگوں نے بیان کیا ہے، کیونکہ {’’ الْقُرْبٰى ‘‘} کا معنی رشتہ داری ہے، رشتہ دار نہیں۔ رشتہ داروں کے لیے {’’ذَوِي الْقُرْبٰي‘‘} کا لفظ آتا ہے۔ اگر {’’ الْقُرْبٰى ‘‘} کا معنی رشتہ دار ہو بھی تو آیت کے الفاظ یہ ہونے چاہییں : {’’ إِلاَّ مَوَدَّةَ الْقُرْبٰي‘‘} ’’مگر رشتہ داروں کی دوستی کا۔‘‘ جب کہ الفاظ ہیں : « اِلَّا الْمَوَدَّةَ فِي الْقُرْبٰى » ان الفاظ کا وہ معنی ہو ہی نہیں سکتا جو یہ حضرات بیان کرتے ہیں۔ پھر دیکھیں کہ آپ صلی اللہ علیہ وسلم یہ سوال کن لوگوں سے کر رہے ہیں، ظاہر ہے کفار سے کر رہے ہیں جو آپ کے شدید مخالف تھے، جو آپ سے بھی دوستی کے روا دار نہیں تھے، آیا ممکن بھی ہے کہ آپ ان سے کہیں کہ میرے رشتہ داروں سے دوستی کرو۔ اگر مان بھی لیں کہ آپ ان سے اپنے رشتہ داروں کے ساتھ دوستی کا سوال کر رہے ہیں تو وہ رشتے دار کون سے ہیں؟ کیا آپ صلی اللہ علیہ وسلم اپنے پورے قبیلۂ قریش کے ساتھ دوستی کا سوال کر رہے ہیں یا اپنے قریب ترین خاندان بنو عبد المطلب کے ساتھ؟ دونوں میں مخلص مسلمانوں کے علاوہ ابوجہل اور ابو لہب جیسے آپ کے بدترین دشمن بھی موجود تھے، جن کے ساتھ دوستی کا سوال ہی پیدا نہیں ہوتا۔ اور اگر اس سے مراد علی و فاطمہ اور حسن و حسین رضی اللہ عنھم ہیں، جیسا کہ شیعہ حضرات کہتے ہیں تو یہ سورت مکی ہے اور مکہ میں فاطمہ اور علی رضی اللہ عنھما کا نکاح تک نہیں ہوا تھا اور نہ ہی حسن و حسین رضی اللہ عنھما پیدا ہوئے تھے، لہٰذا اس سے یہ لوگ مراد ہو ہی نہیں سکتے۔ ¤ ➍ بعض مفسرین نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم کا یہ کہنا کہ میں تم سے صرف رشتہ داری کی وجہ سے دوستی کا سوال کرتا ہوں، یہ دین کی تبلیغ کی اجرت یا مزدوری نہیں جو آپ ان سے مانگ رہے ہیں، بلکہ آپ اپنے اس حق کا مطالبہ کر رہے ہیں جو تمام دنیا کے ہاں مسلم ہے، خواہ آپ تبلیغ کریں یا نہ کریں۔ غرض اس آیت میں بھی وہی بات بیان ہوئی ہے جو تمام انبیاء نے اپنی اپنی قوم سے کہی کہ میں تم سے اس تبلیغ دین پر کسی قسم کی مزدوری کا سوال نہیں کرتا، کیونکہ میری مزدوری صرف اللہ تعالیٰ کے ذمے ہے، جیسا کہ سورۂ شعراء میں ہے : « وَ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ اِنْ اَجْرِيَ اِلَّا عَلٰى رَبِّ الْعٰلَمِيْنَ » [ الشعراء : ۱۰۹ ] ’’اور میں اس پر تم سے کسی اجرت کا سوال نہیں کرتا، میری اجرت تو رب العالمین ہی کے ذمے ہے۔ ‘‘ قواعدِ نحو میں یہ بات ان الفاظ میں بیان کی جائے گی کہ یہاں استثنا متصل نہیں منقطع ہے، یعنی صلہ رحمی کے سوال کا تبلیغِ دین پر اجرت سے کوئی تعلق نہیں۔ ¤ ➎ { وَ مَنْ يَّقْتَرِفْ حَسَنَةً نَّزِدْ لَهٗ فِيْهَا حُسْنًا: ’’ حَسَنَةً ‘‘} میں تنوین تنکیر کے لیے ہے۔ جو شخص کوئی بھلائی کرے گا، خواہ کتنی معمولی ہو، ہم اس کے لیے اس کے حسن و خوبی میں اضافہ کر دیں گے۔ یہ اضافہ کئی طرح سے ہے، ایک تو وہ جتنی نیکی کرے گا اللہ تعالیٰ اسے اس سے زیادہ نیکی کی توفیق دے گا۔ دوسرا جو لوگ اسے دیکھ کر وہ نیکی کریں گے ان سب کے اجر اسے بھی ملیں گے جس سے اس کی نیکی میں اضافہ ہو گا۔ تیسرا اللہ تعالیٰ ہر نیکی کو دس گنا سے سات سو گنا بلکہ شمار سے زیادہ تک بڑھا دیتا ہے، جیسا کہ فرمایا : « وَ اِنْ تَكُ حَسَنَةً يُّضٰعِفْهَا وَ يُؤْتِ مِنْ لَّدُنْهُ اَجْرًا عَظِيْمًا » [ النساء : ۴۰ ] ’’اگر ایک نیکی ہوگی تو وہ اسے کئی گنا کر دے گا اور اپنے پاس سے بہت بڑا اجر عطا کرے گا۔ ‘‘ چوتھا یہ کہ نیکیوں کے ساتھ گناہ معاف ہوتے ہیں، فرمایا : « اِنَّ الْحَسَنٰتِ يُذْهِبْنَ السَّيِّاٰتِ » [ ھود : ۱۱۴ ] ’’بے شک نیکیاں برائیوں کو لے جاتی ہیں۔‘‘ ¤ ➏ {اِنَّ اللّٰهَ غَفُوْرٌ شَكُوْرٌ: ’’ اِنَّ ‘‘} تعلیل کے لیے آتا ہے، یعنی نیکی کرنے والے کی نیکی میں ہم اضافہ اس لیے کرتے ہیں کہ اللہ تعالیٰ گناہوں پر بہت پردہ ڈالنے والا اور نیک عمل کی بے حد قدر کرنے والا ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { اَمْ يَقُوْلُوْنَ افْتَرٰى عَلَى اللّٰهِ كَذِبًا: ’’ اَمْ‘‘} کے لفظ سے پہلے ایک جملہ ظاہر یا مقدر ہوتا ہے جو ہمزہ استفہام سے شروع ہوتا ہے۔ یہاں یہ بات واضح کرنے کے بعد کہ تمھیں دین کی دعوت دینے سے مقصود سراسر تمھارا فائدہ اور تمھاری نجات ہے، اس میں تم سے میری کوئی ذاتی غرض نہیں، نہ ہی میں اس پر تم سے کسی مزدوری کا سوال کرتا ہوں۔ ہاں یہ ضرور کہتا ہوں کہ کم از کم رشتہ داری کی وجہ سے میرا دوستی کا حق تو ادا کرو۔ اس سے آگے اس مفہوم کی عبارت مقدر مانی جائے گی کہ آیا وہ یہ دعوت قبول کرتے ہوئے آپ پر ایمان لاتے ہیں {’’ اَمْ يَقُوْلُوْنَ افْتَرٰى ‘‘} یا ضد اور عناد پر قائم رہ کر یہی بات کہے جاتے ہیں کہ اس نے اللہ تعالیٰ پر جھوٹ باندھا ہے۔ ¤ ➋ { فَاِنْ يَّشَاِ اللّٰهُ يَخْتِمْ عَلٰى قَلْبِكَ:} مفسرین نے اس کی تفسیر کئی طرح سے کی ہے، زیادہ واضح دو تفسیریں یہاں درج کی جاتی ہیں۔ ابن کثیر رحمہ اللہ نے فرمایا : ’’اگر تو نے اللہ پر جھوٹ باندھا ہو، جیسا کہ یہ جاہل کہہ رہے ہیں تو اگر وہ چاہے تو {’’ يَخْتِمْ عَلٰى قَلْبِكَ ‘‘} وہ تیرے دل پر مہر لگا دے اور جتنا قرآن تجھے عطا کیا ہے وہ تجھ سے سلب کر لے، جیسا کہ اس کا ارشاد ہے : « وَ لَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْاَقَاوِيْل (44) لَاَخَذْنَا مِنْهُ بِالْيَمِيْنِ (45) ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِيْنَ (46) فَمَا مِنْكُمْ مِّنْ اَحَدٍ عَنْهُ حٰجِزِيْنَ » [ الحاقۃ : ۴۴ تا ۴۷ ] ’’اور اگر وہ ہم پر کوئی بات بنا کر لگا دیتا۔ تو یقینا ہم اس کو دائیں ہاتھ سے پکڑتے۔ پھر یقینا ہم اس کی جان کی رگ کاٹ دیتے۔ پھر تم میں سے کوئی بھی( ہمیں) اس سے روکنے والا نہ ہوتا۔ ‘‘ یعنی ہم اس سے شدید ترین انتقام لیں اور کوئی شخص اسے بچا نہ سکے۔ (ابن کثیر) مزید تفصیل سورۂ حاقہ کی تفسیر میں ملاحظہ فرمائیں۔ مفسر قاسمی نے فرمایا : ’’یہ قرآنی آیات کی تفسیر قرآن کی آیات کے ساتھ ہے، جہاں ممکن ہو یہ تفسیر سب سے بہتر ہوتی ہے، کیونکہ قرآنی آیات ایک دوسری کی تفسیر کرتی ہیں۔ اس مفہوم کے مطابق آیت کا مآل جیسا کہ ابو السعود نے وضاحت فرمائی کفار کی بات کی تردید ہے، یعنی اگر آپ صلی اللہ علیہ وسلم اللہ تعالیٰ پر جھوٹ گھڑ تے تو اللہ آپ کو ہر حال میں اس سے روک دیتا اور آپ کے دل پر ایسی مہر لگاتا کہ نہ آپ کی زبان پر وحی کا کوئی لفظ آتا اور نہ آپ کے دل میں اس کا کوئی مفہوم آتا، جب ایسا نہیں ہوا بلکہ وحی تواتر کے ساتھ جاری رہی تو ثابت ہو گیا کہ وہ اللہ ہی کی طرف سے ہے۔‘‘ ¤ دوسری تفسیر مفسر شہاب کے الفاظ میں یہ ہے : ’’اس کا مطلب یہ ہے کہ اگر اللہ چاہے تو تیرے دل پر مہر لگا دے، جیسے اس نے ان (بہتان لگانے والے کافروں) کے دلوں پر مہر لگا دی ہے۔ اس میں آپ صلی اللہ علیہ وسلم کو تسلی دلائی ہے اور آپ پر اپنا احسان و اکرام یاد دلایا ہے (کہ اس نے آپ کے دل پر مہر نہیں لگائی) تاکہ آپ اس کی وجہ سے شکر ادا کریں اور ان لوگوں کے حال پر ترس کھائیں جن کے دل پر اللہ تعالیٰ نے مہر لگا دی اور وہ اپنے رب کے غضب کے حق دار بن گئے۔ اگر ایسا نہ ہوتا تو وہ کبھی یہ جرأت نہ کرتے کہ آپ پر یہ بہتان باندھیں کہ آپ نے اللہ تعالیٰ پر جھوٹ گھڑا ہے۔ خلاصہ یہ کہ اگر ان پر گمراہی کی مہر نہ لگ گئی ہوتی تو وہ یہ محال بات کہنے کی جرأت نہ کرتے۔‘‘ (منقول از قاسمی) ¤ ➌ {وَ يَمْحُ اللّٰهُ الْبَاطِلَ … : ’’ يَمْحُ ‘‘} اصل میں {’’ يَمْحُوْ ‘‘} ہے۔ اس کا عطف {’’ يَخْتِمْ ‘‘} پر نہیں اور نہ ہی حالت جزم میں ہونے کی وجہ سے اس کی ’’واؤ‘‘ گری ہے، بلکہ یہ نیا جملہ ہے اور رفعی حالت میں ہونے کی وجہ سے ’’واؤ‘‘ اپنی جگہ قائم ہے۔ صحابہ کرام رضی اللہ عنھم کے رسم الخط میں یہاں ’’واؤ‘‘ نہیں لکھی گئی، کیونکہ بعض مقامات پر پڑھنے میں جو حروف نہیں آتے تھے انھوں نے وہ لکھنے میں بھی حذف کر دیے ہیں، جیسا کہ سورۂ بنی اسرائیل کی آیت (۱۱) : « وَ يَدْعُ الْاِنْسَانُ بِالشَّرِّ دُعَآءَهٗ بِالْخَيْرِ » اور سورۂ علق کی آیت (۱۸) : «سَنَدْعُ الزَّبَانِيَةَ » میں ’’واؤ‘‘ نہیں لکھی گئی۔ مسلمانوں نے بعد میں قرآن مجید کے لیے اسی رسم الخط کو محفوظ رکھا۔ بعض اہلِ علم نے {’’ يَمْحُ ‘‘} کی واؤ حذف کرنے میں یہ نکتہ نکالا ہے کہ باطل کو مٹانے اور محو کرنے میں مبالغے کے اظہار کے لیے {’’ يَمْحُوْ ‘‘} کی ’’واؤ‘‘ کو بھی محو کر دیا ہے۔ ¤ ➍ یعنی اللہ تعالیٰ کا دستور ہے کہ وہ باطل کو مٹاتا ہے اور حق کو اپنے کلمات کے ساتھ ثابت کر دیتا ہے، تو یہ کیسے ہو سکتا ہے کہ آپ اللہ پر جھوٹ گھڑیں اور اللہ تعالیٰ اسے نہ مٹائے، بلکہ آپ کو ہر قدم پر اپنی فتح و نصرت کے ساتھ نوازتا جائے۔ یہ دلیل ہے کہ آپ حق لے کر آئے ہیں اور وہ شخص بدترین بہتان باز ہے جو کہتا ہے کہ آپ نے اللہ پر جھوٹ گھڑا ہے۔ ¤ ➎ { اِنَّهٗ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ:} یعنی اسے سینوں میں چھپی ہوئی نیتوں اور ارادوں کا خوب علم ہے، وہ اپنی رسالت کے ساتھ کبھی بھی بدطینت و جھوٹ گھڑنے والوں کو نہیں نوازتا، جیسا کہ فرمایا : « اَللّٰهُ اَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهٗ » [ الأنعام : ۱۲۴ ]’’اللہ زیادہ جاننے والا ہے جہاں وہ اپنی رسالت رکھتا ہے۔‘‘ اس نے اپنے کامل علم ہی کی بنا پر آپ کو اس منصب کے لیے منتخب فرمایا ہے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ { وَ هُوَ الَّذِيْ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهٖ:} پچھلی آیت میں ان لوگوں کا ذکر فرمایا جو رسول اللہ صلی اللہ علیہ وسلم کو جھٹلاتے تھے اور کہتے تھے کہ آپ صلی اللہ علیہ وسلم نے اللہ تعالیٰ پر جھوٹ باندھا ہے، اب اپنی توبہ قبول کرنے کی صفت فرمائی کہ توبہ قبول کرنا اور گناہوں سے درگزر کرنا صرف اللہ تعالیٰ کی شان ہے (دیکھیے توبہ : ۱۰۴) اور یہ اللہ تعالیٰ کا بہت بڑا احسان ہے، کیونکہ اگر وہ چاہے تو مجرم کے معافی مانگنے پر بھی اسے معاف نہ کرے۔ مقصود انھیں توبہ کی ترغیب دلانا اور کفر پر اصرار کے انجامِ بد سے ڈرانا ہے۔ کفر سے توبہ اسلام قبول کرنے سے ہوتی ہے اور گناہ سے توبہ میں تین چیزیں شامل ہیں، ایک پچھلے گناہ پر ندامت، دوسرا اسے ترک کر دینا، تیسرا آئندہ وہ گناہ نہ کرنے کا عزم اور اگر گناہ کا تعلق بندوں کے حق سے ہے تو حسبِ استطاعت اسے ادا کر دینا اور اللہ تعالیٰ سے معافی مانگنا۔ اگر آئندہ وہ گناہ نہ کرنے کا عزم نہ ہو تو توبہ کا کچھ مطلب نہیں۔ ایک فارسی شاعر نے کہا ہے: ¤ سجہ در كف، توبہ بر لب، دل پُر از ذوقِ گناہ ¤ معصيت را خندہ مے آيدز استغفارِ ما ¤ ’’ہاتھ میں تسبیح ہے، زبان پر توبہ اور دل گناہ کی لذت سے بھرا ہوا ہے، گناہ کو ہمارے استغفار پر ہنسی آتی ہے۔‘‘ ¤ ➋ { عَنْ عِبَادِهٖ:} اس میں توبہ قبول کرنے کی ایک وجہ بیان فرمائی ہے کہ گناہ کرکے توبہ کرنے والے اس کے اپنے بندے ہیں اور وہ اپنے بندوں پر بہت مہربان ہے۔ دیکھیے سورۂ بقرہ (۳۷)، آل عمران (۱۳۵) اور سورۂ نساء (۱۱۰)۔ ¤ ➌ { وَ يَعْفُوْا عَنِ السَّيِّاٰتِ:} توبہ مستقبل کے لیے قبول ہوتی ہے اور برائیاں گزشتہ معاف کر دی جاتی ہیں۔ اللہ تعالیٰ ایسا کریم ہے کہ توبہ پر گزشتہ تمام گناہ معاف فرما دیتا ہے، بلکہ سورۂ فرقان کی آیت (۷۰) کے مطابق توبہ کرنے والوں کے گناہوں کو نیکیوں میں بدل دیتا ہے۔ بندے کی توبہ پر اللہ تعالیٰ کس قدر خوش ہوتا ہے، اس کی تفصیل انس رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان فرمائی، آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَلّٰهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ حِيْنَ يَتُوْبُ إِلَيْهِ، مِنْ أَحَدِكُمْ كَانَ عَلٰی رَاححِلَتِهِ بِأَرْضِ فَلَاةٍ، فَانْفَلَتَتْ مِنْهُ، وَعَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَأَيِسَ مِنْهَا، فَأَتٰی شَجَرَةً فَاضْطَجَعَ فِيْ ظِلِّهَا، قَدْ أَيِسَ مِنْ رَاحِلَتتِهِ، فَبَيْنَا هُوَ كَذٰلِكَ إِذَا هُوَ بِهَا قَائِمَةً عِنْدَهُ، فَأَخَذَ بِخِطَامِهَا ثُمَّ قَالَ مِنْ شِدَّةِ الْفَرَحِ اَللّٰهُمَّ أَنْتَ عَبْدِيْ وَ أَنَا رَبُّكَ، أَخْطَأَ مِنْ شِدَّةِ الْفَرَحِ ] [مسلم، التوبۃ، باب في الحض علی التوبۃ والفرح بھا : ۲۷۴۷ ] ’’یقینا اللہ تعالیٰ اپنے بندے کی توبہ پر، جب وہ اس کی طرف توبہ کرتا ہے، اس سے بھی زیادہ خوش ہوتا ہے جتنا تم میں سے کوئی شخص خوش ہوتا ہے، جو کسی بیابان میں اپنی اونٹنی پر سوار تھا تو وہ اس سے چھوٹ کر نکل گئی، اس کا کھانا اور پانی بھی اسی پر تھا۔ تو وہ اس سے ناامید ہو گیا اور ایک درخت کے پاس جا کر اس کے سائے میں لیٹ گیا۔ حال اس کا یہ تھا کہ وہ اپنی اونٹنی سے مایوس ہو چکا تھا، وہ اسی حال میں تھا کہ اچانک اس نے اسے دیکھا کہ وہ اونٹنی اس کے پاس کھڑی تھی، چنانچہ اس نے اس کی مہار پکڑ لی، پھر شدید خوشی میں کہنے لگا : ’’اے اللہ! تو میرا بندہ اور میں تیرا رب۔‘‘ خوشی کی شدت سے غلطی کر بیٹھا۔‘‘ ¤ ➍ اللہ تعالیٰ اتنا مہربان ہے کہ بعض اوقات توبہ کے بغیر بھی گناہ معاف فرما دیتا ہے، جیسا کہ ہجرت کے بعد پہلے گناہ معاف ہو جاتے ہیں، حجِ مبرور کے بعد پہلے تمام گناہ معاف ہو جاتے ہیں، شہادت فی سبیل اللہ سے تمام گناہ معاف ہو جاتے ہیں اور نیکیوں کی کثرت سے گناہ مٹ جاتے ہیں، جیسا کہ فرمایا : « اِنَّ الْحَسَنٰتِ يُذْهِبْنَ السَّيِّاٰتِ » [ ھود : ۱۱۴ ] ’’بے شک نیکیاں برائیوں کو لے جاتی ہیں۔‘‘ اور کبیرہ گناہوں کے اجتناب سے صغیرہ گناہ خود بخود معاف ہو جاتے ہیں۔ اس سے معلوم ہوا کہ جو لوگ کبیرہ گناہ کے مرتکب مومن کو، اگر وہ توبہ نہ کرے تو کافر یا ابدی جہنمی قرار دیتے ہیں، ان کی بات درست نہیں۔ ¤ ➎ { وَ يَعْلَمُ مَا تَفْعَلُوْنَ:} اس جملے میں بشارت بھی ہے اور نذارت بھی۔ عمل کا دارو مدار دل کی حالت پر ہے، اگر اللہ تعالیٰ کو راضی کرنے کے لیے اخلاص سے توبہ کی گئی ہے تو اللہ تعالیٰ اسے جانتا ہے اور اسے قبولیت سے نوازے گا اور اگر توبہ اپنے کسی دنیوی مقصد کے لیے کی گئی ہو، مثلاً ریا کے طور پر یا آئندہ توڑ ڈالنے کے ارادے سے، یا کسی دنیوی فائدے کے لیے، مثلاً صحت و قوت کے لیے زنا، سگریٹ یا شراب کو ترک کیا گیا ہے تو وہ اسے بھی جانتا ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ { وَ يَسْتَجِيْبُ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ:} اجابت کا معنی قبول  کرنا ہے اور استجابت میں ’’سین‘‘ مبالغے کے لیے ہے۔ یہ لفظ کسی حکم پر بہت جلد عمل کرنے یا کسی دعوت پر بہت جلدی لبیک کہنے یا کسی دعا کو بہت جلدی قبول کرنے کے لیے آتا ہے۔ (ابن عاشور) یعنی اللہ تعالیٰ ان لوگوں کی دعا بہت جلد اور خوشی سے قبول فرماتا ہے جو ایمان اور عمل صالح سے متصف ہوتے ہیں۔ (دیکھیے بقرہ : ۱۸۶،۲۱۸) ان معنوں میں کفار کی دعا قبول ہوتی ہی نہیں، جیسا کہ فرمایا : «وَ مَا دُعَآءُ الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ » [ الرعد : ۱۴ ] ’’اور نہیں ہے کافروں کا پکارنا مگر سراسر بے سود۔‘‘ ہاں رسی دراز کرنے کے لیے اور حجت تمام کرنے کے لیے کفار کی بھی دعائیں قبول ہوتی ہیں، مگر وہ استجابت نہیں استدراج ہے اور ناراضی کی علامت ہے، جیسا کہ ابلیس نے آدم علیہ السلام اور ان کی اولاد کو گمراہ کرنے کے لیے مہلت مانگی تو اسے دے دی گئی۔ ¤ ➋ { وَ يَزِيْدُهُمْ مِّنْ فَضْلِهٖ:} اس میں دو چیزیں شامل ہیں، ایک یہ کہ صالح اعمال والے مومن اپنی دعا اور عملِ صالح سے جو امید رکھتے ہیں اللہ تعالیٰ انھیں وہ بھی دیتا ہے اور ان کی امید سے کہیں زیادہ بھی عطا فرماتا ہے۔ اسی طرح ان کا ہر عمل قبول بھی کرتا ہے اور اسے دس گنا سے سات سو گنا تک یا بلاحساب تک بڑھا بھی دیتا ہے۔ دوسری یہ کہ انھیں اپنے فضل سے مزید وہ کچھ بھی عطا کرتا ہے جس کی درخواست انھوں نے نہیں کی ہوتی، کیونکہ وہ اپنے بندوں پر بہت مہربان ہے اور ان کی ضروریات سے پوری طرح آگاہ ہے۔ ¤ ➌ { وَ الْكٰفِرُوْنَ لَهُمْ عَذَابٌ شَدِيْدٌ:} یہ قرآن مجید کا عام طریقہ ہے کہ ترغیب کےے ساتھ ترہیب بھی ہوتی ہے۔ یعنی جو لوگ توبہ کے بجائے کفر پر اصرار کرتے اور اسی حالت میں مر جاتے ہیں ان کے لیے شدید عذاب ہے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { وَ لَوْ بَسَطَ اللّٰهُ الرِّزْقَ لِعِبَادِهٖ لَبَغَوْا فِي الْاَرْضِ:} یہ ایک سوال کل کا جواب ہے جو یہاں ذہن میں پیدا ہو سکتا ہے کہ جب اللہ تعالیٰ ایمان اور عملِ صالح والوں کی دعا بہت جلدی قبول فرماتا ہے تو یہ لوگ تو رزق کی فراخی کی دعا بھی کرتے ہیں، اس کے باوجود ان پر رزق کی تنگی کیوں ہے؟ ابتدائے اسلام میں ایمان والوں پر رزق کی بہت تنگی آئی، خصوصاً جب کفار نے ان کے ساتھ میل جول اور خرید و فروخت غرض تمام چیزوں کا بائیکاٹ کر دیا۔ جواب یہ دیا گیا کہ ایسا نہیں ہے کہ وہ جتنا رزق مانگیں انھیں اتنا ہی دے دیا جائے، بلکہ اللہ تعالیٰ ان کا رزق ان کی مصلحت کے مطابق ایک اندازے کے ساتھ جتنا چاہتا ہے نازل فرماتا ہے۔ اگر وہ ان کے تقاضے کے مطابق ان کے لیے رزق فراخ کر دیتا تو یقینا وہ زمین میں سرکش ہو جاتے، کیونکہ عام طور پر آدمی جب غنی ہوتا ہے تو اللہ تعالیٰ کو بھول جاتا ہے، جیسا کہ فرمایا : « كَلَّاۤ اِنَّ الْاِنْسَانَ لَيَطْغٰۤى (6) اَنْ رَّاٰهُ اسْتَغْنٰى» [ العلق : 7،6 ] ’’ہرگز نہیں، بے شک انسان یقینا حد سے نکل جاتا ہے۔ اس لیے کہ وہ اپنے آپ کو دیکھتا ہے کہ غنی ہوگیا ہے۔‘‘ اور مال و دولت کی کثرت اسے لوگوں پر زیادتی پر ابھارتی ہے۔ قارون اور فرعون کا حال دیکھ لو! اگر ان کے پاس اتنی دولت نہ ہوتی تو اس طرح برباد نہ ہوتے۔ اس لیے مومنوں کے حق میں خیر یہی ہے کہ ان کا رزق زیادہ فراخ نہ کیا جائے، اگرچہ اس کے خیر ہونے کا پورا ادراک انھیں دیر سے یعنی قیامت کے دن ہو گا۔ اس کے علاوہ مال کی کمی کا مومن کو ایک اور فائدہ بھی ہے کہ اسے عملِ صالح کے لیے فراغت حاصل رہتی ہے اور وہ زیادہ سے زیادہ دنیا کمانے میں مشغول رہ کر آخرت کی تیاری سے غافل نہیں ہوتا، جیسا کہ حدیث میں ہے کہ ابوعبیدہ رضی اللہ عنہ بحرین سے جزیے کا مال لے کر آئے تو انصار صبح کی نماز میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ شامل ہوئے اور بعد میں آپ کے سامنے آ بیٹھے ، آپ صلی اللہ علیہ وسلم انھیں دیکھ کر مسکرائے اور فرمایا : [ أَظُنُّكُمْ قَدْ سَمِعْتُمْ أَنَّ أَبَا عُبَيْدَةَ قَدْ جَاءَ بِشَيْءٍ؟ قَالُوْا أَجَلْ يَا رَسُوْلَ اللّٰهِ ! قَالَ فَأَبْشِرُوْا وَأَمِّلُوْا مَا يَسُرُّكُمْ، فَوَاللّٰهِ ! لاَ الْفَقْرَ أَخْشٰی عَلَيْكُمْ، وَلٰكِنْ أَخْشٰی عَلَيْكُمْ أَنْ تُبْسَطَ عَلَيْكُمُ الدُّنْيَا كَمَا بُسِطَتْ عَلٰی مَنْ كَانَ قَبْلَكُمْ ، فَتَنَافَسُوْهَا كَمَا تَنَافَسُوْهَا وَتُهْلِكَكُمْ كَمَا أَهْلَكَتْهُمْ ] [بخاري، الجزیۃ والموادعۃ، باب الجزیۃ والموادعۃ مع أھل الذمۃ والحرب : ۳۱۵۸ ] ’’میرا خیال ہے تم نے سنا ہے کہ ابوعبیدہ کچھ لے کر آئے ہیں؟‘‘ انھوں نے کہا : ’’جی ہاں، یا رسول اللہ!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو خوش ہو جاؤ اور خوش کرنے والی چیزوں کی امید رکھو، پس اللہ کی قسم! میں تم پر فقیری سے تو ڈرتا ہی نہیں، بلکہ تم پر اس بات سے ڈرتا ہوں کہ تم پر دنیا فراخ کر دی جائے، جیسا کہ تم سے پہلے لوگوں پر فراخ کر دی گئی، تو تم ایک دوسرے سے زیادہ اس میں رغبت کرنے لگو، جیسا کہ انھوں نے ایک دوسرے سے بڑھ کر اس میں رغبت کی اور وہ تمھیں اسی طرح ہلاک کر دے جس طرح اس نے انھیں ہلاک کر دیا۔ ‘‘ ¤ ➋ {’’ وَ لَوْ بَسَطَ اللّٰهُ الرِّزْقَ لِعِبَادِهٖ لَبَغَوْا فِي الْاَرْضِ ‘‘} میں اللہ تعالیٰ نے مسلمانوں پر اپنا احسان بھی جتلایا ہے کہ اگر وہ چاہتا تو یہ جانتے ہوئے بھی کہ یہ لوگ زمین میں سرکشی کریں گے ان کا رزق فراخ کر دیتا، جیسا کہ اس نے فرعون کا رزق یہ جاننے کے باوجود فراخ کر دیا۔ چنانچہ اگر اسے ملک مصر نہ ملتا تو وہ کبھی خدائی کا دعویٰ نہ کرتا۔ لہٰذا رزق کی تنگی بھی اہلِ ایمان کے لیے ایک انعام ہے جس کا شکر ان پر واجب ہے۔ ¤ ➌ آیت کے الفاظ {’’ وَ لَوْ بَسَطَ اللّٰهُ الرِّزْقَ لِعِبَادِهٖ ‘‘} مومن و کافر دونوں کے لیے عام ہیں۔ اس میں اللہ تعالیٰ نے اپنی تکوینی تدبیر کا بھی ذکر فرمایا ہے کہ دنیا میں اللہ تعالیٰ نے مومن ہوں یا کافر سب کا رزق برابر نہیں رکھا، کسی کا زیادہ ہے کسی کا کم، تاکہ لوگ ایک دوسرے کے محتاج رہیں اور ایک دوسرے سے کام لے سکیں۔ (دیکھیے زخرف : ۳۲) اسی طرح اس نے کسی کو ایک حد سے زیادہ رزق نہیں دیا، ورنہ لوگ زیادہ روزی پا کر زمین میں سرکشی اور فساد کرتے۔ رہے وہ لوگ جو رزق کی فراخی کی وجہ سے زمین میں فساد کرتے ہیں ان کا فساد اس فساد کے مقابلے میں کچھ حیثیت نہیں رکھتا جو وہ اپنی مرضی کے مطابق مال ملنے کی صورت میں برپا کرتے۔ اب اگر کوئی فساد فی الارض کرتا ہے تو وہ ایک حد سے نہیں بڑھ سکتا۔ کوئی کتنا بھی بڑا باغی ہو سب اپنی حد میں رہنے پر مجبور ہیں۔ ¤ ➍ { وَ لٰكِنْ يُّنَزِّلُ بِقَدَرٍ مَّا يَشَآءُ:} اس کی تفصیل کے لیے دیکھیے سورۂ حجر (۲۱) اور رعد (۸) اور سورۂ قمر (۴۹)کی تفسیر۔ ¤ ➎ { اِنَّهٗ بِعِبَادِهٖ خَبِيْرٌۢ بَصِيْرٌ:} اس کی تفصیل کے لیے دیکھیے سورۂ بنی اسرائیل کی آیت (۳۰) کی تفسیر۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { وَ هُوَ الَّذِيْ يُنَزِّلُ الْغَيْثَ مِنْۢ بَعْدِ مَا قَنَطُوْا: ’’ الْغَيْثَ ‘‘}  وہ بارش جو خشک سالی کے بعد آئے، کیونکہ اس کے ذریعے سے لاچار اور بے بس انسانوں اور جانوروں کی مدد ہوتی ہے، جیسا کہ فرمایا : « ثُمَّ يَاْتِيْ مِنْۢ بَعْدِ ذٰلِكَ عَامٌ فِيْهِ يُغَاثُ النَّاسُ» [ یوسف : ۴۹ ] ’’پھر اس کے بعد ایک سال آئے گا جس میں لوگوں پر بارش ہوگی۔‘‘ یہ بیان کرنے کے بعد کہ اللہ تعالیٰ بندوں کو ان کی ضرورت سے زیادہ نہیں دیتا، کیونکہ اسے معلوم ہے کہ ان کے تقاضے کے مطابق رزق میں اضافہ ان کی سرکشی اور نظامِ عالم کی خرابی کا باعث ہے، یہ ذکر فرمایا کہ اگر انھیں بارش کی ضرورت ہو، جس پر تمام جانداروں کی زندگی کا دارو مدار ہے، خواہ انسان ہوں یا حیوان، چرند پرند ہوں یا درندے یا حشرات الارض ہوں تو وہ انھیں اپنی رحمت سے ضرور نوازتا ہے۔ چنانچہ فرمایا، اور وہی ہے جو بارش برساتا ہے۔ ¤ ➋ { مِنْۢ بَعْدِ مَا قَنَطُوْا: ’’ قُنُوْطٌ‘‘} کی تفسیر کے لیے دیکھیے سورۂ حم السجدہ کی آیت (۴۹) کی تفسیر۔ اس کے بعد کہ وہ ناامید ہو چکے ہوتے ہیں اور اس ناامیدی کے آثار ان کے چہروں پر ظاہر ہو چکے ہوتے ہیں، یعنی وہ ایک مدت کی قحط سالی کی وجہ سے بارش برسنے سے ناامید ہو چکے ہوتے ہیں۔ اس آیت میں مادہ پرستوں کا رد بھی ہے جن کا کہنا ہے کہ دنیا میں اسباب کے مطابق سب کچھ خود بخود ہو رہا ہے، نہ اس کائنات کا کوئی پیدا کرنے والا ہے اور نہ کوئی اسے اپنی مرضی کے مطابق چلانے والا ہے۔ رد اس طرح ہے کہ ان لوگوں کے کہنے کے مطابق طبعی طور پر سورج کی تپش کے ساتھ سمندر سے بخارات اٹھتے ہیں جو بادلوں کی صورت اختیار کرتے اور زمین پر برستے ہیں۔ سوال یہ ہے کہ پھر ایک زمین، ایک سمندر، ایک سورج اور تمام اسباب یکساں ہونے کے باوجود ہر جگہ ہمیشہ ایک جیسی بارش کیوں نہیں ہوتی؟ یقینا یہ سب کچھ ان تمام چیزوں کے مالک کے اختیار میں ہے، وہ جہاں چاہتا ہے سالہا سال تک قحط اور خشک سالی مسلط کر دیتا ہے، پھر جب چاہتا ہے دوبارہ بارش کا سلسلہ شروع فرما دیتا ہے۔ ¤ ➌ { وَ يَنْشُرُ رَحْمَتَهٗ:} یعنی بارش کی صورت میں اپنی رحمت میدانوں، پہاڑوں، جنگلوں اور سمندروں میں ہر جگہ پھیلا دیتا ہے، ہوا کے کاندھے پر سوار اتنے وزنی بادلوں سے زمین کو بھر دینے والی بارش برساتا ہے، جنھیں پوری مخلوق بھی اٹھانا چاہے تو نہ اٹھا سکے اور سب مل کر اس زمین پر چھڑکاؤ ہی کرنا چاہیں تو نہ کر سکیں۔ پھر ہر طرف ندی نالے، تالاب، سبزہ، پودے، درخت، کھیت، مینڈک، جھینگر، حشرات الارض اور دوسرے جاندار پھیل جاتے ہیں۔ اس بارش کے ساتھ اتنی سخت زمین سے، جو کدالوں کے ساتھ کھودنی مشکل ہوتی ہے، ریشم سے نرم کونپلیں نکال دیتا ہے اور اس بارش کے ساتھ درختوں کے سخت تنوں سے، جنھیں تراشنے والے اوزار مشکل سے تراش سکیں، پرندوں کی زبانوں سے بھی نازک شگوفے نکال دیتا ہے، پھر کس قدر جاہل اور فریب خوردہ ہیں وہ لوگ جو مردوں کے قبروں سے زندہ ہونے کو نہیں مانتے۔ (بقاعی) ¤ ➍ {وَ هُوَ الْوَلِيُّ الْحَمِيْدُ:} یعنی کائنات کے تمام معاملات کا متولی اور ذمہ دار وہی ہے اور ہر خوبی کا مالک بھی وہی ہے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { مِنْ اٰيٰتِهٖ خَلْقُ السَّمٰوٰتِ وَ الْاَرْضِ:} اس کی تفسیر متعدد مقامات پر گزر چکی ہے۔ ¤ ➋ {وَ مَا بَثَّ فِيْهِمَا مِنْ دَآبَّةٍ: ’’ دَآبَّةٍ ‘‘ ’’دَبَّ يَدِبُّ دَبًّا وَ دَبِيْبًا‘‘} (ض) سے اسم فاعل ہے۔ یہ لفظ {’’دَابٌّ‘‘} کا مؤنث ہے، مگر مذکر و مؤنث دونوں کے لیے استعمال ہوتا ہے۔ جمع {’’دَوَابُّ‘‘} ہے، کیونکہ اس میں تاء وحدت کے لیے ہے، یعنی چلنے والا جانور خواہ سانپ کی طرح پیٹ کے بل چلے یا دو یا چار ٹانگوں پر چلے، اللہ تعالیٰ نے فرمایا : «وَ اللّٰهُ خَلَقَ كُلَّ دَآبَّةٍ مِّنْ مَّآءٍ فَمِنْهُمْ مَّنْ يَّمْشِيْ عَلٰى بَطْنِهٖ وَ مِنْهُمْ مَّنْ يَّمْشِيْ عَلٰى رِجْلَيْنِ وَ مِنْهُمْ مَّنْ يَّمْشِيْ عَلٰۤى اَرْبَعٍ يَخْلُقُ اللّٰهُ مَا يَشَآءُ اِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ » [ النور : ۴۵ ] ’’اور اللہ نے ہر چلنے والا (جاندار) ایک قسم کے پانی سے پیدا کیا، پھر ان میں سے کوئی وہ ہے جو اپنے پیٹ پر چلتا ہے اور ان میں سے کوئی وہ ہے جو دو پاؤں پر چلتا ہے اور ان میں سے کوئی وہ ہے جو چار پر چلتا ہے، اللہ پیدا کرتا ہے جو چاہتا ہے، یقینا اللہ ہر چیز پر خوب قادر ہے۔ ‘‘ یہ آیت دلیل ہے کہ {’’ دَآبَّةٍ ‘‘} سے مراد جانور ہیں فرشتے نہیں۔ ¤ زمین میں پھیلائے ہوئے مختلف جانوروں کا مشاہدہ تو ہر آدمی کرتا رہتا ہے، اس آیت میں زمین و آسمان دونوں میں پھیلائے ہوئے جانوروں کا ذکر فرمایا۔ اس لیے بعض مفسرین نے یہ خیال فرما کر کہ آسمانوں میں جانوروں کے وجود کا صراحت کے ساتھ قرآن و حدیث میں ذکر نہیں اس کی مختلف تاویلیں فرمائی ہیں۔ چنانچہ بعض نے فرمایا، اس سے مراد زمین کے جانور ہی ہیں، کیونکہ وہ زمین و آسمان کے اندر ہی ہیں۔ بعض نے فرمایا، اس سے مراد آسمانوں کے فرشتے ہیں، کیونکہ وہ اڑنے کے ساتھ ساتھ چل بھی سکتے ہیں، مگر ان تاویلوں کی ضرورت تب ہے جب آسمانوں میں جانوروں کا وجود ناممکن ہو۔ جب اللہ تعالیٰ فرما رہے ہیں کہ اللہ تعالیٰ کی نشانیوں میں سے وہ جانور بھی ہیں جو اس نے زمین و آسمان میں پھیلا دیے ہیں تو ہمیں یہ بات ماننے میں کوئی تامل نہیں ہونا چاہیے کہ آسمانوں میں بھی جانور موجود ہیں، خصوصاً جنت میں جہاں ہر نعمت موجود ہے، اللہ تعالیٰ ہی بہتر جانتا ہے کہ وہاں کتنی قسم کے خوبصورت سے خوبصورت جانور موجود ہیں۔ ¤ ➌ { وَ هُوَ عَلٰى جَمْعِهِمْ اِذَا يَشَآءُ قَدِيْرٌ:} جس طرح زمین و آسمان کے جانوروں کو پیدا کرنا اور پھیلانا اللہ تعالیٰ کی نشانی ہے اسی طرح انھیں جمع کرنے پر قدرت بھی بہت بڑی نشانی ہے۔ انسان کا حال تو یہ ہے کہ وہ پرندوں کے ایک جھنڈ کے بکھرنے والے پرندوں کو جمع نہیں کر سکتا، نہ شہد کے کسی چھتے سے بکھرنے والی مکھیوں کو جمع کر سکتا ہے، حتیٰ کہ اپنے ہم سبق ساتھیوں کو اکٹھا نہیں کر سکتا، خواہ وہ زندہ ہی ہوں۔ یہ رب تعالیٰ ہی ہے جو تمام جانوروں کو، زندہ ہوں یا مردہ، جمع کرنے پر پوری طرح قادر ہے۔ چنانچہ قیامت کے دن وہ انسانوں کے ساتھ جانوروں کو بھی دوبارہ زندہ فرمائے گا، فرمایا : « يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ذٰلِكَ يَوْمُ التَّغَابُنِ» [ التغابن : ۹ ]’’جس دن وہ تمھیں جمع کرنے کے دن کے لیے جمع کرے گا، وہی ہار جیت کا دن ہے۔‘‘"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ { وَ مَاۤ اَصَابَكُمْ مِّنْ مُّصِيْبَةٍ فَبِمَا كَسَبَتْ اَيْدِيْكُمْ:} اللہ تعالیٰ کی نعمتوں اور نشانیوں کا تذکرہ ہو رہا ہے، اس سلسلے میں لوگوں کے بارش سے ناامید ہونے کے بعد بارش برسانے کا ذکر ہوا ہے۔ اس پر سوال ہو سکتا تھا کہ اللہ تعالیٰ اس قدر مہربان ہے تو وہ بارش روک کیوں دیتا ہے؟ فرمایا، تم پر جو مصیبت بھی آتی ہے وہ تمھاری کمائی کا نتیجہ ہے۔ وہ گناہ بھی ہو سکتے ہیں اور اونچی شان والے حضرات پر اللہ تعالیٰ کے جس قدر انعامات ہیں ان کا حق ادا کرنے میں کسی طرح کی کمی بھی۔ اس لیے پیغمبر بھی اللہ تعالیٰ سے استغفار کرتے ہیں۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَاللّٰهِ ! إِنِّيْ لَأَسْتَغْفِرُ اللّٰهَ وَ أَتُوْبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِيْنَ مَرَّةً ] [ بخاري، الدعوات، باب استغفار النبي صلی اللہ علیہ وسلم في الیوم واللیلۃ : ۶۳۰۷ ] ’’اللہ کی قسم! میں دن میں ستر(۷۰) بار سے زیادہ اللہ سے استغفار اور اس کی طرف توبہ کرتا ہوں۔‘‘ انسان پر آنے والی ان مصیبتوں کا انجام مومن و کافر کے حق میں ایک جیسا نہیں ہوتا، بلکہ وہ کافر کے لیے عذاب ہوتی ہیں، جیسا کہ فرمایا : «وَ لَنُذِيْقَنَّهُمْ مِّنَ الْعَذَابِ الْاَدْنٰى دُوْنَ الْعَذَابِ الْاَكْبَرِ لَعَلَّهُمْ يَرْجِعُوْنَ » [ السجدۃ : ۲۱ ] ’’اور یقینا ہم انھیں قریب ترین عذاب کا کچھ حصہ سب سے بڑے عذاب سے پہلے ضرور چکھائیں گے، تاکہ وہ پلٹ آئیں۔ ‘‘ اور مومن کے لیے گناہوں کی معافی، اجر اور درجات کی بلندی کا باعث بنتی ہیں۔ ابوسعید خدری اور ابوہریرہ رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ  علیہ وسلم نے فرمایا : [ مَا يُصِيْبُ الْمُسْلِمَ مِنْ نَصَبٍ، وَلاَ وَصَبٍ، وَلاَ هَمٍّ ، وَلاَ حُزْنٍ، وَلاَ أَذًی، وَلاَ غَمٍّ، حَتَّی الشَّوْكَةِ يُشَاكُهَا، إِلاَّ ك كَفَّرَ اللّٰهُ بِهَا مِنْ خَطَايَاهُ ] [ بخاري، المرضٰی، باب ما جاء في کفارۃ المرض : ۵۶۴۱، ۵۶۴۲ ] ’’مومن کو جو بھی دکھ یا چوٹ یا فکر یا حزن یا تکلیف یا غم پہنچتا ہے، حتیٰ کہ کانٹا بھی جو اسے لگتا ہے، تو اللہ تعالیٰ اس کے ذریعے سے اس کے کچھ گناہ دور فرما دیتا ہے۔‘‘ یہاں ایک مشہور سوال ہے کہ بچے اور دیوانے پر آنے والی مصیبتیں بھی کیا ان کے اعمال کا نتیجہ ہیں؟ جواب یہ ہے کہ آیت میں خطاب ان لوگوں سے ہے جو مکلف ہیں، بچے اور دیوانے مکلف ہی نہیں، نہ ان پر آنے والی مصیبتیں ان کے گناہوں کی وجہ سے آتی ہیں، بلکہ وہ اللہ تعالیٰ کی حکمت کے تحت آتی ہیں، جسے وہی بہتر جانتا ہے۔ ¤ بیماری اور مصیبت کے اجر اور درجات کی بلندی کا باعث بننے کی دلیل قرآن مجید کی آیات، مثلاً سورۂ توبہ کی آیت (۱۲۰) کے علاوہ بہت سی احادیث بھی ہیں۔ عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں، میں رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا، آپ صلی اللہ علیہ وسلم بخار میں تپ رہے تھے۔ میں نے کہا : ’’یا رسول اللہ! آپ کو بہت سخت بخار ہوتا ہے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَجَلْ، إِنِّيْ أُوْعَكُ كَمَا يُوْعَكُ رَجُلاَنِ مِنْكُمْ، قُلْتُ ذٰلِكَ بِأَنَّ لَكَ أَجْرَيْنِ ؟ قَالَ أَجَلْ ذٰلِكَ كَذٰلِكَ، مَا مِنْ مُسْلِمٍ يُصِيْبُهُ أَذًی، شَوْكَةٌ فَمَا فَوْقَهَا إِلاَّ كَفَّرَ اللّٰهُ بِهَا سَيِّئَاتِهِ، كَمَا تَحُطُّ  الشَّجَرَةُ وَرَقَهَا ] [ بخاري، المرضٰی، باب أشد الناس بلاء الأنبیاء ثم الأمثل فالأمثل : ۵۶۴۸ ] ’’ہاں، مجھے اتنا بخار ہوتا ہے جتنا تم میں سے دو آدمیوں کو ہوتا ہے۔‘‘ میں نے کہا : ’’یہ اس لیے کہ آپ کو دو اجر ملتے ہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہاں! یہی بات ہے، جس مسلم کو بھی کوئی تکلیف پہنچے، کانٹاہو یا اس سے اوپر، اللہ تعالیٰ اس کے ساتھ اس کی برائیاں گرا دیتا ہے جیسے درخت اپنے پتے گرا دیتا ہے۔‘‘ ¤ ➋ { وَ يَعْفُوْا عَنْ كَثِيْرٍ:} اس کی تفسیر کے لیے دیکھیے سورۂ نحل (۶۱) اور سورۂ فاطر (۴۵) کی تفسیر۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) { وَ مَاۤ اَنْتُمْ بِمُعْجِزِيْنَ فِي الْاَرْضِ …:} اس کی تفسیر کے لیے دیکھیے سورۂ نور (۵۷) اور سورۂ عنکبوت (۲۲) کی تفسیر۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) {وَ مِنْ اٰيٰتِهِ الْجَوَارِ فِي الْبَحْرِ كَالْاَعْلَامِ:’’ الْجَوَارِ ‘‘ ’’ جَارِيَةٌ ‘‘} (چلنے والی)کی جمع ہے، یعنی کشتی یا بحری جہاز، جیسا کہ فرمایا : « اِنَّا لَمَّا طَغَا الْمَآءُ حَمَلْنٰكُمْ فِي الْجَارِيَةِ » [ الحاقۃ : ۱۱ ] ’’بے شک ہم نے ہی جب پانی حد سے تجاوز کر گیا تمھیں کشتی میں سوار کیا۔‘‘ {’’اَلْأَعْلَامُ ‘‘ ’’عَلَمٌ‘‘} کی جمع ہے، پہاڑ۔ اصل میں کوئی نشان جس سے کسی چیز کا علم ہو، مثلاً جھنڈا وغیرہ۔ یعنی اللہ تعالیٰ کی توحید اور اس کی قدرت کی نشانیوں میں سے سمندر میں چلنے والے بحری جہاز بھی ہیں جو پہاڑوں کی طرح بلند ہیں اور دور سے نظر آتے ہیں۔ پانی میں مخصوص حجم اور وزن والی چیز کو اٹھائے رکھنے کی خاصیت اللہ واحد کی پیدا کردہ ہے، جس کی وجہ سے وہ ہزاروں لاکھوں ٹن کے بحری جہازوں کو اپنے سینے پر اٹھائے رکھتا ہے، جن سے تم بے شمار منافع حاصل کرتے ہو۔ یہاں جہازوں کے لیے {’’اَلْفُلْكُ‘‘} کے بجائے {’’ الْجَوَارِ ‘‘} کے لفظ کے ساتھ اس نعمت کی طرف بھی توجہ دلائی ہے کہ ان جہازوں کو پانی میں ڈوبنے سے بچائے رکھنے کے ساتھ انھیں پانی میں چلانے کی نعمت پر بھی غور کرو، اگر یہ نعمت نہ ہوتی تو جس طرح خشک زمین پر کھڑی عمارتیں اگرچہ زمین میں نہیں دھنستیں، مگر جتنی بھی تیز ہوا آ جائے ایک انچ بھی ادھر سے ادھر نہیں ہوتیں، اسی طرح یہ جہاز بھی پانی پر کھڑے رہتے۔ تو کوئی اور ہے تو لاؤ جو کہے کہ میں نے سمندر کو پیدا کیا، یا پانی میں یہ تاثیر رکھی۔ اللہ تعالیٰ نے اپنی توحید و قدرت کی اس نشانی اور عظیم نعمت کا متعدد مقامات پر ذکر فرمایا ہے۔ دیکھیے سورۂ یٰس (۴۱ تا ۴۴)، بقرہ (۱۶۴)، نحل (۱۴) اور سورۂ فاطر (۱۲)۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 34،33) ➊ { اِنْ يَّشَاْ يُسْكِنِ الرِّيْحَ … : ’’ رَوَاكِدَ ‘‘ ’’رَكَدَ يَرْكُدُ رُكُوْدًا‘‘} (ن) سے اسم فاعل {’’رَاكِدَةٌ‘‘} کی جمع ہے۔ نزول قرآن کے وقت سمندر میں بادبانی کشتیاں اور جہاز چلتے تھے، جن کے چلنے نہ چلنے کا اور سست یا تیز رفتار سے چلنے کا دارو مدار ہوا پر ہوتا تھا۔ یہاں اللہ تعالیٰ نے سمندروں میں جہازوں کو چلانے والی ہواؤں کی تین حالتیں بیان فرمائی ہیں، ایک یہ کہ اللہ تعالیٰ ہوا کو ساکن کر دے اور جہاز جہاں کھڑے ہیں وہیں کھڑے رہ جائیں، پھر اللہ تعالیٰ کے سوا کون ہے جو اس ہوا کو چلا دے ؟ ¤ ➋ { اَوْ يُوْبِقْهُنَّ بِمَا كَسَبُوْا:} اس کا عطف {’’ يُسْكِنِ الرِّيْحَ ‘‘} پر ہے، گویا عبارت اس طرح ہے : {’’إِنْ يَّشَأْ يُسْكِنِ الرِّيْحَ أَوْ إِنْ يَّشَأْ يُوْبِقْهُنَّ بِمَا كَسَبُوْا ‘‘} یعنی ’’اگر وہ چاہے تو ہوا کو ساکن کر دے یا اگر وہ چاہے تو ان کے اعمالِ بد کی وجہ سے تند و تیز طوفانی ہوا کے ساتھ انھیں ہلاک کر دے۔‘‘ یہ ہوا کی دوسری حالت ہے، تفصیل کے ساتھ اس کا ذکر ایک اور آیت میں ہے، فرمایا : « حَتّٰۤى اِذَا كُنْتُمْ فِي الْفُلْكِ وَ جَرَيْنَ بِهِمْ بِرِيْحٍ طَيِّبَةٍ وَّ فَرِحُوْا بِهَا جَآءَتْهَا رِيْحٌ عَاصِفٌ » [ یونس:۲۲] ’’یہاں تک کہ جب تم کشتیوں میں ہوتے ہو اور وہ انھیں لے کر عمدہ ہوا کے ساتھ چل پڑتی ہیں اور وہ اس پر خوش ہوتے ہیں تو ان (کشتیوں) پر سخت تیز ہوا آجاتی ہے۔‘‘ ¤ ➌ {وَ يَعْفُوْا عَنْ كَثِيْرٍ:} اس کا عطف بھی {’’ يُسْكِنِ الرِّيْحَ ‘‘} پر ہے : {’’ أَيْ وَ إِنْ يَّشَأْ يَعْفُ عَنْ كَثِيْرٍ فَلَا يُعَاقِبُهُمْ بِإِسْكَانِ الرِّيْحِ أَوْ بِإِرْسَالِهَا عَاصِفَةً‘‘} یہ تیسری حالت ہے، یعنی اگر وہ چاہے تو بہت سے لوگوں سے درگزر کر دے، پھر نہ ہوا روک کر انھیں سزا دے اور نہ ہی تند و تیز طوفان کے ساتھ انھیں ہلاک کرے، بلکہ انھیں سلامتی کے ساتھ منزلِ مقصود پر پہنچا دے۔ {’’ يُسْكِنِ ‘‘، ’’ يُوْبِقْهُنَّ ‘‘} اور {’’ يَعْفُ ‘‘} تینوں {’’ اِنْ يَّشَاْ ‘‘} شرط کی جزا ہونے کی وجہ سے مجزوم ہیں۔ ¤ ➍ ان آیات میں جہاں مشرکین کے لیے اللہ تعالیٰ کی توحید کے دلائل بیان ہوئے ہیں وہیں مادہ پرست کمیونسٹوں اور دہریوں کا رد بھی ہے، کیونکہ ان آیات سے معلوم ہوا کہ ہوا نہ اپنی مرضی سے چلتی ہے اور نہ ٹھہرتی ہے، نہ اپنی مرضی سے بادِ موافق ہو کر چلتی ہے اور نہ ہی تند و تیز آندھی کی شکل اختیار کرتی ہے، بلکہ یہ سب کچھ اللہ تعالیٰ کے حکم سے ہوتا ہے۔ اگر ہوا کا چلنا اس کا طبعی فعل ہوتا تو جس طرح آگ جلاتی ہے اور برف ٹھنڈی ہوتی ہے ہوا بھی یا ساکن رہتی اور کبھی نہ چلتی یا چلتی رہتی اور ہمیشہ تند و تیز آندھی کی صورت اختیار کیے رکھتی۔ معلوم ہوا کہ ہوا کا چلنا خود اس کا فعل نہیں بلکہ یہ اس مالک و مختار کے ہاتھ میں ہے جس نے اسے پیدا فرمایا ہے۔ ¤ ➎ { اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ:} یہ اس سوال کا جواب ہے کہ اتنی واضح اور عظیم نشانیوں کے باوجود مشرک اور دہریے ان سے فائدہ کیوں نہیں اٹھاتے؟ جواب کی تفصیل کے لیے دیکھیے سورۂ لقمان کی آیت (۳۱) کی تفسیر۔ ¤ ➏ یہاں یہ سوال پیدا ہو گا کہ آج کل جہاز ہوا سے نہیں چلتے بلکہ انجنوں کی طاقت سے چلتے ہیں، پھر ہوا کے رکنے سے ان پر کیا اثر ہوا؟ اس کا جواب یہ ہے کہ انجن بھی عقب میں ہوا کے ساتھ پانی کو پیچھے دھکیلتے ہوئے جہازوں کو آگے بڑھاتے ہیں۔ {’’الرِّيْحَ ‘‘} کا لفظ اس ریح کو بھی شامل ہے اور اگر اللہ تعالیٰ چاہے تو ان انجنوں میں ایسی خرابی پیدا کر دے کہ وہ ایک ہی جگہ کھڑے رہ جائیں۔ (تفسیر ثنائی بتصرف)"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34،33) ➊ { اِنْ يَّشَاْ يُسْكِنِ الرِّيْحَ … : ’’ رَوَاكِدَ ‘‘ ’’رَكَدَ يَرْكُدُ رُكُوْدًا‘‘} (ن) سے اسم فاعل {’’رَاكِدَةٌ‘‘} کی جمع ہے۔ نزول قرآن کے وقت سمندر میں بادبانی کشتیاں اور جہاز چلتے تھے، جن کے چلنے نہ چلنے کا اور سست یا تیز رفتار سے چلنے کا دارو مدار ہوا پر ہوتا تھا۔ یہاں اللہ تعالیٰ نے سمندروں میں جہازوں کو چلانے والی ہواؤں کی تین حالتیں بیان فرمائی ہیں، ایک یہ کہ اللہ تعالیٰ ہوا کو ساکن کر دے اور جہاز جہاں کھڑے ہیں وہیں کھڑے رہ جائیں، پھر اللہ تعالیٰ کے سوا کون ہے جو اس ہوا کو چلا دے ؟ ¤ ➋ { اَوْ يُوْبِقْهُنَّ بِمَا كَسَبُوْا:} اس کا عطف {’’ يُسْكِنِ الرِّيْحَ ‘‘} پر ہے، گویا عبارت اس طرح ہے : {’’إِنْ يَّشَأْ يُسْكِنِ الرِّيْحَ أَوْ إِنْ يَّشَأْ يُوْبِقْهُنَّ بِمَا كَسَبُوْا ‘‘} یعنی ’’اگر وہ چاہے تو ہوا کو ساکن کر دے یا اگر وہ چاہے تو ان کے اعمالِ بد کی وجہ سے تند و تیز طوفانی ہوا کے ساتھ انھیں ہلاک کر دے۔‘‘ یہ ہوا کی دوسری حالت ہے، تفصیل کے ساتھ اس کا ذکر ایک اور آیت میں ہے، فرمایا : « حَتّٰۤى اِذَا كُنْتُمْ فِي الْفُلْكِ وَ جَرَيْنَ بِهِمْ بِرِيْحٍ طَيِّبَةٍ وَّ فَرِحُوْا بِهَا جَآءَتْهَا رِيْحٌ عَاصِفٌ » [ یونس:۲۲] ’’یہاں تک کہ جب تم کشتیوں میں ہوتے ہو اور وہ انھیں لے کر عمدہ ہوا کے ساتھ چل پڑتی ہیں اور وہ اس پر خوش ہوتے ہیں تو ان (کشتیوں) پر سخت تیز ہوا آجاتی ہے۔‘‘ ¤ ➌ {وَ يَعْفُوْا عَنْ كَثِيْرٍ:} اس کا عطف بھی {’’ يُسْكِنِ الرِّيْحَ ‘‘} پر ہے : {’’ أَيْ وَ إِنْ يَّشَأْ يَعْفُ عَنْ كَثِيْرٍ فَلَا يُعَاقِبُهُمْ بِإِسْكَانِ الرِّيْحِ أَوْ بِإِرْسَالِهَا عَاصِفَةً‘‘} یہ تیسری حالت ہے، یعنی اگر وہ چاہے تو بہت سے لوگوں سے درگزر کر دے، پھر نہ ہوا روک کر انھیں سزا دے اور نہ ہی تند و تیز طوفان کے ساتھ انھیں ہلاک کرے، بلکہ انھیں سلامتی کے ساتھ منزلِ مقصود پر پہنچا دے۔ {’’ يُسْكِنِ ‘‘، ’’ يُوْبِقْهُنَّ ‘‘} اور {’’ يَعْفُ ‘‘} تینوں {’’ اِنْ يَّشَاْ ‘‘} شرط کی جزا ہونے کی وجہ سے مجزوم ہیں۔ ¤ ➍ ان آیات میں جہاں مشرکین کے لیے اللہ تعالیٰ کی توحید کے دلائل بیان ہوئے ہیں وہیں مادہ پرست کمیونسٹوں اور دہریوں کا رد بھی ہے، کیونکہ ان آیات سے معلوم ہوا کہ ہوا نہ اپنی مرضی سے چلتی ہے اور نہ ٹھہرتی ہے، نہ اپنی مرضی سے بادِ موافق ہو کر چلتی ہے اور نہ ہی تند و تیز آندھی کی شکل اختیار کرتی ہے، بلکہ یہ سب کچھ اللہ تعالیٰ کے حکم سے ہوتا ہے۔ اگر ہوا کا چلنا اس کا طبعی فعل ہوتا تو جس طرح آگ جلاتی ہے اور برف ٹھنڈی ہوتی ہے ہوا بھی یا ساکن رہتی اور کبھی نہ چلتی یا چلتی رہتی اور ہمیشہ تند و تیز آندھی کی صورت اختیار کیے رکھتی۔ معلوم ہوا کہ ہوا کا چلنا خود اس کا فعل نہیں بلکہ یہ اس مالک و مختار کے ہاتھ میں ہے جس نے اسے پیدا فرمایا ہے۔ ¤ ➎ { اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّكُلِّ صَبَّارٍ شَكُوْرٍ:} یہ اس سوال کا جواب ہے کہ اتنی واضح اور عظیم نشانیوں کے باوجود مشرک اور دہریے ان سے فائدہ کیوں نہیں اٹھاتے؟ جواب کی تفصیل کے لیے دیکھیے سورۂ لقمان کی آیت (۳۱) کی تفسیر۔ ¤ ➏ یہاں یہ سوال پیدا ہو گا کہ آج کل جہاز ہوا سے نہیں چلتے بلکہ انجنوں کی طاقت سے چلتے ہیں، پھر ہوا کے رکنے سے ان پر کیا اثر ہوا؟ اس کا جواب یہ ہے کہ انجن بھی عقب میں ہوا کے ساتھ پانی کو پیچھے دھکیلتے ہوئے جہازوں کو آگے بڑھاتے ہیں۔ {’’الرِّيْحَ ‘‘} کا لفظ اس ریح کو بھی شامل ہے اور اگر اللہ تعالیٰ چاہے تو ان انجنوں میں ایسی خرابی پیدا کر دے کہ وہ ایک ہی جگہ کھڑے رہ جائیں۔ (تفسیر ثنائی بتصرف)"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) {وَ يَعْلَمَ الَّذِيْنَ يُجَادِلُوْنَ فِيْۤ اٰيٰتِنَا … :} یہاں سوال ہے کہ {’’ يَعْلَمَ ‘‘} پر نصب کیوں ہے اور ’’واؤ‘‘ کے ساتھ عطف کس پر ڈالا گیا ہے؟ جواب اس کا یہ ہے کہ اس جملے کا عطف ایک محذوف جملے پر ہے، جس میں اس بات کی علت بیان کی گئی ہے کہ ہوائیں جہازوں کے لیے کبھی موافق، کبھی شدید ترین مخالف اور کبھی ساکن کیوں ہوتی ہیں اور {’’ يَعْلَمَ ‘‘} پر نصب {’’لَامِ كَيْ‘‘} کی وجہ سے آیا ہے جس کے بعد {’’أَنْ‘‘} ناصبہ مقدر ہوتا ہے۔ گویا پوری عبارت اس طرح ہے : {’’ اَللّٰهُ فَعَلَ ذٰلِكَ لِيَعْتَبِرَ الْمُؤْمِنُوْنَ وَ لِيَعْلَمَ الَّذِيْنَ يُجَادِلُوْنَ فِيْ آيَاتِنَا ‘‘} یعنی اللہ تعالیٰ نے کشتیوںں اور ہواؤں کا یہ معاملہ اس لیے ذکر فرمایا ہے تاکہ مومن اس سے عبرت حاصل کریں اور جو لوگ ہماری آیات کو جھٹلانے کے لیے جھگڑا کرتے ہیں وہ جان لیں کہ ان کے لیے اللہ تعالیٰ سے بھاگ کر جانے کی کوئی جگہ نہیں۔ ہو سکتا ہے یہ جاننے کے بعد وہ اللہ کی آیات پر ایمان لے آئیں۔ بعض مفسرین نے محذوف جملے کے لیے اس سے مختلف الفاظ بھی ذکر فرمائے ہیں، مقصد سب کا یہی ہے کہ {’’ وَ يَعْلَمَ الَّذِيْنَ يُجَادِلُوْنَ فِيْۤ اٰيٰتِنَا ‘‘} میں گزشتہ چیزوں کی علت بیان ہوئی ہے۔ علت والے جملے کے حذف کی قرآن مجید میں کئی مثالیں ملتی ہیں، جیسے فرمایا : «وَ لِنَجْعَلَهٗۤ اٰيَةً لِّلنَّاسِ » [ مریم : ۲۱ ] ’’اور تاکہ ہم اسے لوگوں کے لیے بہت بڑی نشانی بنائیں۔‘‘ اور جیسے فرمایا : «وَ خَلَقَ اللّٰهُ السَّمٰوٰتِ وَ الْاَرْضَ بِالْحَقِّ وَ لِتُجْزٰى كُلُّ نَفْسٍۭ بِمَا كَسَبَتْ » [ الجاثیۃ : ۲۲ ] ’’اور اللہ نے آسمانوں اور زمین کو حق کے ساتھ پیدا کیا اور تاکہ ہر شخص کو اس کا بدلا دیا جائے جو اس نے کمایا۔‘‘"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) ➊ {فَمَاۤ اُوْتِيْتُمْ مِّنْ شَيْءٍ فَمَتَاعُ الْحَيٰوةِ الدُّنْيَا: ’’مَتَاعٌ‘‘} وہ چیز جس سے فائدہ اٹھایا جائے، برتنے کی چیز جو جلدی ختم ہو جائے۔ اللہ تعالیٰ نے اپنی توحید اور قدرت و سلطنت کے دلائل مثلاً بندوں کے لیے بارش برسانے، انھیں حسبِ حکمت رزق عطا فرمانے، آسمان و زمین کو پیدا کرنے، ان میں بے شمار جانداروں کو پھیلانے، سمندروں میں پہاڑوں جیسے بلند جہازوں کے چلنے اور انھیں پیش آنے والے احوال ذکر کرنے کے بعد دنیا کی زندگی کے سازو سامان کے بے وقعت اور عارضی ہونے کا ذکر فرمایا، کیونکہ دنیا کی زیب و زینت ہی انسان کو دلائل پر غور و فکر کرنے میں رکاوٹ بنتی ہے۔ جب وہ اس کی حقیقت سے آگاہ ہو گا اور وہ اس کی نگاہ میں حقیر ہو گی تو اسے آخرت کی طرف توجہ کا موقع ملے گا اور وہ دلائل پر غور بھی کرے گا۔ ¤ ➋ دنیا میں انسان کو جو چیز بھی دی گئی ہے، وہ خواہ کتنی زیادہ ہو یا کتنی قیمتی ہو، اس میں سے کوئی بھی ایسی نہیں جس پر انسان پھول جائے اور آخرت سے بے پروا ہو جائے، کیونکہ ایک تو وہ بہت تھوڑی مدت کے لیے اس کے استعمال میں آتی ہے، پھر وہ سب کچھ چھوڑ کر خالی ہاتھ یہاں سے رخصت ہو جاتا ہے۔ اس کے علاوہ اس کی ملکیت میں خواہ کتنی لمبی چوڑی جائداد یا دولت ہو عملاً اس کے استعمال میں اس کا معمولی سا حصہ ہی آتا ہے۔ اے انسان ! تیرے لیے اس لمبی چوڑی جائداد میں سے وہی ہے: [ مَا أَكَلْتَ فَأَفْنَيْتَ أَوْ لَبِسْتَ فَأَبْلَيْتَ ] [ مسلم، الزھد و الرقائق، باب : ۲۹۵۸ ] ’’جو تو نے کھا لیا اور فنا کر دیا، یا جو پہن لیا اور پرانا کر دیا۔‘‘ ایسی ناپائیدار چیز کے پیچھے اپنی عمر عزیز وہ شخص کبھی برباد نہیں کر سکتا جو اس کی حقیقت سے آگاہ ہو۔ مزید دیکھیے سورۂ رعد (۲۶)۔ ¤ ➌ {وَ مَا عِنْدَ اللّٰهِ خَيْرٌ وَّ اَبْقٰى:} جو دولت و نعمت اللہ کے پاس ہے وہ ہر لحاظ سے دنیا کے ساز و سامان سے بہتر بھی ہے اور پائیدار اور لازوال بھی۔ ¤ ➍ { لِلَّذِيْنَ اٰمَنُوْا وَ عَلٰى رَبِّهِمْ يَتَوَكَّلُوْنَ:} یہاں سے ان لوگوں کی صفات بیان فرمائیں جو اللہ تعالیٰ کے ہاں آخرت میں ملنے والی نعمتوں کے حق دار ہوں گے۔ ان میں سب سے پہلی صفت {’’ اٰمَنُوْا ‘‘} ماضی کے صیغے کے ساتھ ہے اور {’’ يَتَوَكَّلُوْنَ ‘‘} مضارع کے صیغے کے ساتھ کا مطلب یہ ہے کہ وہ خوب سوچ سمجھ کر ایمان لا چکے اور ان کے دلوں میں اللہ تعالیٰ، اس کے فرشتوں، اس کے رسولوں، اس کی کتابوں، اس کی تقدیر اور اس کے روز جزا پر پورا یقین آ چکا، اب ان کا یہ حال ہے کہ وہ اپنے ہر کام میں ہمیشہ صرف اپنے رب پر بھروسا کرتے ہیں، کسی اور سے انھیں نہ نفع کی امید ہے نہ کسی نقصان کا خوف۔ {’’ يَتَوَكَّلُوْنَ ‘‘} مضارع کا صیغہ ہمیشگی پر دلالت کرتا ہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { وَ الَّذِيْنَ يَجْتَنِبُوْنَ كَبٰٓىِٕرَ الْاِثْمِ وَ الْفَوَاحِشَ:} ایمان و توکل کے بعد پہلے ان چیزوں کا ذکر فرمایا جن سے اجتناب ضروری ہے، وہ ہیں کبائر و فواحش اور غضب۔ ’’كبائر‘‘ کی تعریف کے لیے دیکھیے سورۂ نساء کی آیت (۳۱)۔ {’’ الْفَوَاحِشَ ‘‘ ’’ فَاحِشَةٌ ‘‘} کی جمع ہے، کوئی بھی قول یا فعل جس کی قباحت حد سے بڑھی ہوئی ہو، مثلاً زنا، قوم لوط کا عمل اور شدید بخل وغیرہ۔ (دیکھیے سورۂ بقرہ : ۲۶۸) آیت میں ’’كبائر‘‘ کا لفظ عام ہے، جس میں فواحش بھی آ جاتے ہیں، مگر ’’فواحش‘‘ کا ذکر ان سے نفرت دلانے کے لیے خاص طور پر الگ بھی فرمایا۔ شیخ عبد الرحمان السعدی نے فرمایا کہ فواحش ان بڑے گناہوں کو کہتے ہیں جن کی رغبت انسانی طبیعت میں پائی جاتی ہو۔ مزید دیکھیے سورۂ بنی اسرائیل (۳۲)۔ ¤ ➋ { وَ اِذَا مَا غَضِبُوْا هُمْ يَغْفِرُوْنَ:} غصے کی حالت میں معاف کر دینے کا ذکر خاص طور پر فرمایا، کیونکہ یہ کام وہی لوگ کر سکتے ہیں جو نہایت مضبوط ارادے کے مالک ہوں، کیونکہ عموماً غصے میں آدمی عقل و ہوش سے عاری ہو جاتا ہے۔ اس حال میں اپنے آپ پر قابو رکھنا آدمی کی کمالِ عقل اور ضبطِ نفس کی دلیل ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [لَيْسَ الشَّدِيْدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيْدُ الَّذِيْ يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ ] [ بخاري، الأدب، باب الحذر من الغضب: ۶۱۱۴ ] ’’پہلوان وہ نہیں جو دوسروں کو پچھاڑ دے، پہلوان صرف وہ ہے جو غصے کے وقت اپنے آپ پر قابو رکھے۔‘‘ نبی کریم صلی اللہ علیہ وسلم میں عفو و درگزر کی خوبی بدرجہ اتم پائی جاتی تھی۔ (دیکھیے آل عمران : ۱۵۹) عائشہ رضی اللہ عنھا فرماتی ہیں : [ مَا انْتَقَمَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ لِنَفْسِهِ فِيْ شَيْءٍ يُؤْتٰی إِلَيْهِ حَتّٰی يُنْتَهَكَ مِنْ حُرُمَاتِ اللّٰهِ فَيَنْتَقِمُ لِلّٰهِ ] [بخاري، الحدود، باب کم التتعزیر و الأدب ؟ : ۶۸۵۳ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے اپنی ذات کے لیے کسی معاملے کا انتقام نہیں لیا جو آپ سے کیا گیا۔ ہاں! اللہ تعالیٰ کی حرمتوں میں سے کسی کو توڑا جاتا تو آپ اللہ کی خاطر انتقام لیتے۔‘‘ مزید دیکھیے سورۂ آل عمران (۱۳۳، ۱۳۴) خلفائے راشدین میں بھی یہ وصف بدرجہ کمال موجود تھا، جیسا کہ ان کی سیرت سے ظاہر ہے۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ { وَ الَّذِيْنَ اسْتَجَابُوْا لِرَبِّهِمْ:} واجب الاجتناب چیزوں کے بعد ان اوصاف کا ذکر فرمایا جن سے آراستہ ہونا ضروری ہے۔ وہ چار ہیں، جن پر عمل اتحادِ امت کا اور دنیا و آخرت میں کامیابی کا ضامن ہے۔ اجابت اور استجابت دونوں کا معنی ’’قبول کرنا ‘‘ہے، مگر استجابت میں حروف زائد ہونے کی وجہ سے معنی میں مبالغہ پیدا ہو گیا ہے۔ مطلب یہ ہے کہ ان کا رب انھیں جس کام کے لیے بلاتا ہے وہ فوراً اس کی طرف دوڑ پڑتے ہیں، نہ دیر کرتے ہیں نہ ٹال مٹول سے کام لیتے ہیں اور ان کے رب کا ان سے تقاضا بھی یہی ہے۔ دیکھیے سورۂ انفال (۲۴)۔ ¤ ➋ { وَ اَقَامُوا الصَّلٰوةَ:} ان چار اوصاف میں سے سب سے پہلے نماز قائم کرنے کا ذکر فرمایا، کیونکہ اسلام قبول کرنے کے بعد سب سے پہلا اور سب سے اہم فریضہ یہی نماز قائم کرنا ہے جو سب کے سامنے مسلم و کافر کے درمیان خط امتیاز کھینچ دیتا ہے۔ دیکھیے سورۂ توبہ (۵، ۱۱)۔ ¤ ➌ { وَ اَمْرُهُمْ شُوْرٰى بَيْنَهُمْ:’’ شَارَ يَشُوْرُ شَوْرًا ‘‘} (ن) {’’ وَاشْتَارَ الْعَسَلَ‘‘} چھتے سے شہد نکالنا۔ مشورے کو مشورہ اور شوریٰ اسی لیے کہتے ہیں کہ وہ بہت سے لوگوں کی رائے حاصل کرنے کا نام ہے۔ یہ دوسرا وصف ہے۔ وہ کام جن میں اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کے واضح احکام موجود ہیں ان میں مشورے کی ضرورت ہے نہ اجازت کی، ان میں استجابت کے علاوہ کوئی راستہ نہیں۔ ان کے علاوہ مسلمانوں کے ایک دوسرے سے تعلق رکھنے والے تمام معاملات باہمی مشورے سے طے پاتے ہیں، جس کی وجہ سے وہ تمام لوگوں کی بہتر سے بہتر رائے سے آگاہ ہو کر بہترین بات تک پہنچ جاتے ہیں۔ ان میں سے کوئی بھی شخص اپنے آپ کو عقلِ کل نہیں سمجھتا کہ اپنی رائے کو حرف آخر قرار دے کر اس پر اصرار کرے اور فرعون کی طرح کہے : « مَاۤ اُرِيْكُمْ اِلَّا مَاۤ اَرٰى وَ مَاۤ اَهْدِيْكُمْ اِلَّا سَبِيْلَ الرَّشَادِ» [ المؤمن : ۲۹ ] ’’میں تو تمھیں وہی رائے دے رہا ہوں جو خود رائے رکھتا ہوں اور میں تمھیں بھلائی کا راستہ ہی بتا رہا ہوں۔ ‘‘ کیونکہ یہ رویہ کوئی متکبر شخص ہی اختیار کرتا ہے، جو دوسروں کو اور ان کی رائے کو کوئی وزن نہ دے، مومن کا معاملہ اس کے برعکس ہوتا ہے، جیسا کہ فرمایا : « تِلْكَ الدَّارُ الْاٰخِرَةُ نَجْعَلُهَا لِلَّذِيْنَ لَا يُرِيْدُوْنَ عُلُوًّا فِي الْاَرْضِ وَ لَا فَسَادًا » [ القصص : ۸۳ ] ’’یہ آخری گھر، ہم اسے ان لوگوں کے لیے بناتے ہیں جو نہ زمین میں کسی طرح اونچا ہونے کا ارادہ کرتے ہیں اور نہ کسی فساد کا۔‘‘ مومن ہمیشہ خائف رہتا ہے کہ اس سے فہم کی غلطی ہو جائے یا لاعلمی کی وجہ سے یا شیطان یا نفس کے دخل سے غلط فیصلہ کر بیٹھے، اس لیے وہ زیادہ سے زیادہ لوگوں سے مشورہ کرتا ہے۔ اللہ تعالیٰ نے اپنے نبی مکرم صلی اللہ علیہ وسلم کو بھی اپنے صحابہ سے مشورے کا حکم دیا اور آپ صلی اللہ علیہ وسلم نے ہمیشہ ان امور میں صحابہ کرام رضی اللہ عنھم سے مشورہ کیا جن میں اللہ تعالیٰ کی طرف سے صریح حکم نہیں تھا۔ ¤ ➍ آج کل بہت سے لوگ ’’شوريٰ ‘‘ سے مراد جمہوریت اور ووٹ لیتے ہیں، حالانکہ مشورہ تو خلیفہ بھی کرتا ہے، بادشاہ بھی، جیسے ملکہ سبا نے کیا اور چھوٹے سے چھوٹے کنبے کا سربراہ بھی، کیونکہ اس کے بغیر کوئی کام درست طریقے سے چل ہی نہیں سکتا۔ اگر نہ کرنا چاہے تو جمہوری وزیر اعظم بھی مشورے کے بجائے اپنی پارٹی کے ارکان کو اپنی استبدادی رائے پر مجبور کر سکتا ہے، جیسا کہ ہم اپنے ملک میں مشاہدہ کر رہے ہیں۔ مشورے اور جمہوریت کے فرق کی تفصیل کے لیے دیکھیے سورۂ آلِ عمران کی آیت (۱۵۹) : «وَ شَاوِرْهُمْ فِي الْاَمْرِ » کی تفسیر۔ سورۂ نمل کی آیت (۳۲) کی تفسیر پر بھی نظر ڈال لیں۔ ¤ ➎ { وَ مِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ:} یہ تیسرا وصف ہے۔ تفصیل کے لیے دیکھیے سورۂ بقرہ کی آیت (۳) کی تفسیر۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) {وَ الَّذِيْنَ اِذَاۤ اَصَابَهُمُ الْبَغْيُ … :} یہ چوتھا وصف ہے۔ یہاں ایک سوال ہے کہ اس سے پہلے ان کا وصف غصے کے وقت معاف کر دینا ذکر فرمایا ہے اور یہاں انتقام کو ان کی خوبی قرار دیا ہے، تطبیق کیا ہے؟ اس کا بہترین جواب مشہور تابعی ابراہیم نخعی نے دیا ہے، انھوں نے صحابہ کرام رضی اللہ عنھم کا طرزِ عمل بیان کرتے ہوئے فرمایا : {’’ كَانَ الْمُؤْمِنُوْنَ يَكْرَهُوْنَ أَنْ يَّسْتَذِلُّوْا وَ كَانُوْا إِذَا قَدَرُوْا  عَفَوْا۔‘‘} [ ابن کثیر بحوالہ ابن أبي حاتم : ۱۸۴۸۶، وقال حکمت بن بشیر سندہ صحیح ] ’’مومن یہ بات ناپسند کرتے تھے کہ ذلت قبول کریں، مگر جب قدرت پاتے تو معاف کر دیتے تھے۔‘‘ خلاصہ یہ ہے کہ اگر معاف کرنا مجرم کے جرم سے باز آنے کا باعث ہو تو عفو افضل ہے، لیکن اگگر معاف کرنے سے اس کی سرکشی میں اور جرم پر جرأت میں اضافہ ہو تو انتقام لینا چاہیے۔ دلیل اس کی لفظ {’’ الْبَغْيُ ‘‘} (سرکشی) ہے۔ ایک شاعر نے کہا ہے: ¤ {إِذَا أَنْتَ أَكْرَمْتَ الْكَرِيْمَ مَلَكْتَهُ ¤ وَ إِنْ أَنْتَ أَكْرَمْتَ اللَّئِيْمَ تَمَرَّدَا} ¤ ’’جب تم کسی معزز آدمی کی عزت کرو گے تو اس کے مالک بن جاؤ گے اور اگر تم کمینے کی عزت کرو گے تو وہ سرکش ہو جائے گا۔‘‘ ¤ ابن کثیر نے فرمایا، یعنی ان میں اس شخص سے انتقام لینے کی قوت ہوتی ہے جو ان پر ظلم اور زیادتی کرے، نہ وہ عاجز ہوتے ہیں نہ ذلیل، بلکہ جو سرکشی کرے اس سے انتقام کی قدرت رکھتے ہیں، اس کے باوجود جب قابو پا لیتے ہیں تو معاف کر دیتے ہیں، جیسا کہ یوسف علیہ السلام نے اپنے بھائیوں سے کہا : « لَا تَثْرِيْبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللّٰهُ لَكُمْ » [ یوسف : ۹۲ ] ’’آج تم پر کوئی ملامت نہیں، اللہ تمھیں بخشے۔‘‘ حالانکہ وہ ان کے مؤاخذے پر اور اس سلوک کا بدلا لینے پر پوری قدرت رکھتے تھے جو انھوں نے ان کے ساتھ کیا تھا اور جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے موقع پر ان لوگوں سے فرمایا جنھوں نے آپ سے دشمنی کی انتہا کر دی تھی اور جن کی گردنیں آپ کے ایک اشارے سے تن سے جدا ہو سکتی تھیں : [ لَا تَثْرِيْبَ عَلَيْكُمُ الْيَوْمَ ] [ السنن الکبرٰی للنسائي : ۱۱۲۹۸ ] اور جیسا کہ آپ صلی اللہ علیہ وسلم نے ان اسی (۸۰) آدمیوں کو معاف کر دیا جو کوہِ تنعیم سے آپ پر حملہ آور ہونے کے لیے اترے تھے۔ جب آپ صلی اللہ علیہ وسلم نے ان پر قابو پا لیا تو قدرت کے باوجود ان پر احسان فرما دیا۔ اسی طرح آپ صلی اللہ علیہ وسلم نے غورث بن حارث کو معاف کر دیا، جس نے آپ کو اچانک قتل کرنے کا ارادہ کیا، جب آپ صلی اللہ علیہ وسلم سوئے ہوئے تھے تو اس نے آپ کی تلوار میان سے نکال لی، آپ بیدار ہوئے تو وہ ننگی اس کے ہاتھ میں تھی، آپ صلی اللہ علیہ وسلم نے اسے جھڑکا تو اس نے نیچے رکھ دی، رسول اللہ صلی اللہ علیہ وسلم نے اپنے اصحاب کو بلا کر ساری بات بتائی اور اسے معاف کر دیا۔ (دیکھیے بخاری : ۴۱۳۶) اسی طرح لبید بن اعصم کو معاف کر دیا جس نے آپ پر جادو کیا تھا، اس سے باز پرس بھی نہیں فرمائی۔ (دیکھیے بخاری : ۵۷۶۵) اسی طرح اس یہودی عورت زینب کو معاف فرما دیا جو خیبر کے یہودی مرحب کی بہن تھی، جسے محمد بن مسلمہ رضی اللہ عنہ نے قتل کیا تھا، جس نے خیبر کے موقع پر بکری کے بازو میں زہر ملا دیا تھا، بکری کے اس بازو نے آپ کو اس کی اطلاع دے دی، آپ صلی اللہ علیہ وسلم نے اس عورت کو بلایا تو اس نے اعتراف کر لیا۔ آپ نے اس سے کہا کہ تمھیں اس کام پر کس چیز نے آمادہ کیا؟ اس نے کہا، میرا ارادہ یہ تھا کہ اگر آپ نبی ہوئے تو یہ آپ کو نقصان نہیں دے گی اور اگر نبی نہ ہوئے تو ہماری جان چھوٹ جائے گی۔ آپ صلی اللہ علیہ وسلم نے اسے چھوڑ دیا، مگر جب اس زہر کی وجہ سے بشر بن براء رضی اللہ عنہ فوت ہو گئے تو آپ صلی اللہ علیہ وسلم نے ان کے قصاص میں اسے قتل کر دیا۔ (دیکھیے بخاری : ۳۱۶۹۔ ابو داود : ۴۵۰۹، ۴۵۱۱) ایسی احادیث اور بھی بہت ہیں۔ (و للہ الحمد) یہ تمام واقعات بخاری و مسلم دونوں میں یا ان میں سے ایک میں موجود ہیں۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) ➊ { وَ جَزٰٓؤُا سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا:} سرکشی کرنے والوں سے انتقام کا ذکر مدح کے انداز میں کرنے پر خطرہ تھا کہ انتقام میں حد سے تجاوز نہ ہو جائے، اس لیے اس آیت میں کئی طرح سے زیادتی سے باز رکھنے کا اہتمام فرمایا۔ سب سے پہلے تو یہ کہہ کر کہ {’’ جَزٰٓؤُا سَيِّئَةٍ سَيِّئَةٌ ‘‘} (برائی کا بدلا برائی ہے) حالانکہ بدلا تو برائی نہیں، مگر دونوں کی صورت ایک ہونے کی وجہ سے بدلے پر بھی {’’ سَيِّئَةٌ ‘‘} کا لفظ بولا۔ پھر یہ پابندی لگائی کہ انتقام زیادتی کے عین برابر ہو، اس سے زیادہ نہ ہو، جیسا کہ فرمایا : « فَمَنِ اعْتَدٰى عَلَيْكُمْ فَاعْتَدُوْا عَلَيْهِ بِمِثْلِ مَا اعْتَدٰى عَلَيْكُمْ » [ البقرۃ : ۱۹۴ ] ’’پس جو تم پر زیادتی کرے سو تم اس پر زیادتی کرو، اس کی مثل جو اس نے تم پر زیادتی کی ہے۔‘‘ اور فرمایا : « وَ اِنْ عَاقَبْتُمْ فَعَاقِبُوْا بِمِثْلِ مَا عُوْقِبْتُمْ بِهٖ » [ النحل : ۱۲۶ ] ’’اور اگر تم بدلا لو تو اتنا ہی بدلا لو جتنی تمھیں تکلیف دی گئی ہے۔‘‘ ¤ ➋ { ’’ وَ جَزٰٓؤُا سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا ‘‘} سے جو احکام حاصل ہوتے ہیں ان میں سے چند کے لیے دیکھیے سورۂ نحل کی آیت (۲۶) کی تفسیر۔ ¤ ➌ { فَمَنْ عَفَا وَ اَصْلَحَ فَاَجْرُهٗ عَلَى اللّٰهِ:} ظاہر ہے انتقام  لیتے ہوئے اس زیادتی سے ذرّہ برابر اضافہ نہ ہونے دینا جو کی گئی ہے محال نہیں تو بہت مشکل ضرور ہے، اس لیے آخر میں پھر عفو و اصلاح کی طرف توجہ دلاتے ہوئے اس کا اجر اپنے ذمے لیا۔ {’’ فَاَجْرُهٗ عَلَى اللّٰهِ ‘‘} (تو اس کا اجر اللہ پر  ہے) اس جملے میں اجر کی جو عظمت بیان ہوئی ہے وہ کسی بھی تفصیل سے اس طرح بیان نہیں ہو سکتی۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ وَ مَا زَادَ اللّٰهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا، وَمَا تَوَاضَعَضَعَ أَحَدٌ لِلّٰهِ إِلَّا رَفَعَهُ اللّٰهُ ] [ مسلم، البر والصلۃ، باب استحباب العفو و التواضع:۲۵۸۸] ’’صدقہ کسی مال میں کمی نہیں کرتا اور اللہ تعالیٰ معاف کر دینے کی وجہ سے بندے کی عزت ہی میں اضافہ کرتا ہے اور جو بھی اللہ تعالیٰ کی خاطر نیچا ہوتا ہے اللہ تعالیٰ اسے اونچا کر دیتا ہے۔‘‘ ¤ حافظ ابن کثیر رحمہ اللہ نے یہاں فضیل بن عیاض رحمہ اللہ کا بہت عمدہ کلام نقل فرمایا ہے، جس میں انھوں نے دو آیات کے حوالے سے اور طبعی وعقلی حوالے سے عفو کی فضیلت بیان کی ہے۔ انھوں نے فرمایا : ’’جب کوئی شخص تمھارے پاس کسی شخص کی شکایت لے کر آئے تو اسے کہو، میرے بھائی! اسے معاف کر دو، کیونکہ عفو تقویٰ کے زیادہ قریب ہے، جیسا کہ فرمایا : «وَ اَنْ تَعْفُوْۤا اَقْرَبُ لِلتَّقْوٰى » [ البقرۃ : ۲۳۷ ] ’’اور یہ (بات) کہ تم معاف کر دو تقویٰ کے زیادہ قریب ہے۔‘‘ اگر وہ کہے میرا دل معاف کرنے کو برداشت نہیں کرتا، میں تو انتقام لوں گا، جیسے مجھے اللہ تعالیٰ نے حکم دیا ہے تو اسے کہو، اگر تم اچھے طریقے سے انتقام لے سکتے ہو تو ٹھیک ہے ورنہ عفو کی طرف پلٹ آؤ، یہ بہت وسعت والا دروازہ ہے، کیونکہ جو معاف کر دے اور اصلاح کرے اس کا اجر اللہ کے ذمے ہے، فرمایا : « فَمَنْ عَفَا وَ اَصْلَحَ فَاَجْرُهٗ عَلَى اللّٰهِ » [ الشورٰی : ۴۰ ] ’’پھر جو معاف کر دے اور اصلاح کر لے تو اس کا اجر اللہ کے ذمے ہے۔‘‘ اور معاف کر دینے والا رات سکون سے بستر پر سو جاتا ہے، جبکہ انتقام لینے والا مختلف معاملات کی وجہ سے پہلو بدلتا رہتا ہے۔‘‘ [ ابن أبي حاتم : ۱۰/ ۳۲۸۰، ح : ۱۸۴۸۸، قال المحقق سندہ صحیح ] ¤ ➍ { اِنَّهٗ لَا يُحِبُّ الظّٰلِمِيْنَ:} سب سے پہلے تو ظالم وہ ہے جو ظلم کرنے میں پہل کرتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْمُسْتَبَّانِ مَا قَالَا فَعَلَی الْبَادِئِ مَا لَمْ يَعْتَدِ الْمَظْلُوْمُ ] [ مسلم، البر و الصلۃ، باب النھي عن السباب : ۲۵۸۷ ] ’’دو گالی گلوچ کرنے والے جو کچھ بھی کہیں وہ پہل کرنے والے پر ہے، جب تک مظلوم زیادتی نہ کرے۔‘‘ پھر مظلوم اگر انتقام میں حد سے بڑھ جائے تو ظالم شمار ہو گا اور اللہ تعالیٰ کی محبت سے محروم ہو گا۔ ¤ ➎ اللہ تعالیٰ نے اس آیت میں بدلے کے تین مراتب بیان فرمائے ہیں، عدل، فضل اور ظلم۔ عدل کا مرتبہ{’’ جَزٰٓؤُا سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا ‘‘} میں بیان ہوا ہے کہ بدلے میں نہ زیادتی ہو نہ کمی، جان کے بدلے جان، ہر عضو کے بدلے اس کے برابر عضو، اسی طرح مال پر زیادتی کا معاملہ ہے۔ فضل کا مرتبہ زیادتی کرنے والے سے عفو اور اس کی اصلاح ہے۔ {’’ فَمَنْ عَفَا وَ اَصْلَحَ فَاَجْرُهٗ عَلَى اللّٰهِ ‘‘} اس جملے میں عفو کی ترغیب ہے کہ جس طرح تم اللہ تعالیٰ سے معافی کے خواہش مند اور امید وار ہو اسی طرح تم بھی عفو و درگزر سے کام لو، فرمایا : «وَ لْيَعْفُوْا وَ لْيَصْفَحُوْا اَلَا تُحِبُّوْنَ اَنْ يَّغْفِرَ اللّٰهُ لَكُمْ » [ النور : ۲۲ ] ’’اور لازم ہے کہ معاف کر دیں اور درگزر کریں، کیا تم پسند نہیں کرتے کہ اللہ تمھیں بخشے۔ ‘‘ اگر عفو سے مجرم کی اصلاح نہیں ہوتی بلکہ اس کی سرکشی میں اضافہ ہوتا ہے تو مصلحت عفو نہیں انتقام ہے۔ اور ظلم کا مرتبہ یہ ہے کہ اس پر جتنی زیادتی کی گئی تھی اس سے بڑھ کر زیادتی کرے۔ پہلے مظلوم تھا اب ظالم بن جائے گا اور اللہ کی محبت سے محروم ہو جائے گا۔ (سعدی)"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) {وَ لَمَنِ انْتَصَرَ بَعْدَ ظُلْمِهٖ …:} یعنی مظلوم ظالم سے بدلا لے لے تو اس پر کوئی مؤاخذہ یا ملامت نہیں، کیونکہ اس نے اپنا حق لیا ہے، کوئی زیادتی نہیں کی، بشرطیکہ اتنا ہی بدلا لے جتنا اس پر ظلم ہوا ہے۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) { اِنَّمَا السَّبِيْلُ عَلَى الَّذِيْنَ يَظْلِمُوْنَ النَّاسَ … :} یعنی مؤاخذہ اور ملامت ان لوگوں پر ہے جو ظلم کی ابتدا کرتے ہیں، لوگوں کی جان و مال اور عزت و آبرو پر دست درازی کرتے ہیں اور اگر بدلا لیں تو بدلا لینے میں حد سے بڑھ جاتے ہیں۔ اس طرح زمین میں سرکشی اور تکبر سے فساد پھیلاتے ہیں، جس کا انھیں کوئی حق نہیں۔ ان لوگوں کے لیے سخت درد پہنچانے والا عذاب ہے۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) { وَ لَمَنْ صَبَرَ وَ غَفَرَ اِنَّ ذٰلِكَ لَمِنْ عَزْمِ الْاُمُوْرِ: ’’ عَزْمِ ‘‘} کا معنی ہے کسی کام کا پختہ ارادہ کر لینا، اسے اپنے آپ پر واجب کر لینا کہ میں یہ کام ضرور کروں گا۔ {’’ عَزْمِ ‘‘} مصدر بمعنی اسم مفعول ہے جو اپنے موصوف کی طرف مضاف ہے : {’’ أَيْ اَلْأُمُوْرُ الْمَعْزُوْمَةُ ‘‘} یعنی یہ کام ان امور میں سے ہے جن کا بڑی ہمت سے عزم کیا جاتا ہے۔ یقینا جو شخص صبر کرے اور معاف کر دے، جب کہ معاف کرنے میں ظلم اور سرکشی کی حوصلہ افزائی نہ ہو تو یہ بڑی ہمت کا کام ہے، جو ہر عقل مند کو اپنے آپ پر واجب کر لینا چاہیے۔ مزید دیکھیے سورۂ لقمان (۱۷)۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ { وَ مَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ وَّلِيٍّ مِّنْۢ بَعْدِهٖ:} یعنی جس شخص ککی ضد اور ہٹ دھرمی کا یہ حال ہو کہ نہ وہ عفو و درگزر کا اعلیٰ درجہ اختیار کرنے کا حوصلہ رکھتا ہو اور نہ کم از کم عدل و انصاف سے کام لینے پر تیار ہو تو ظاہر ہے کہ وہ خیر سے محروم اور محض شر ہے، ایسے شخص کو اللہ تعالیٰ بھی خیر کی توفیق نہیں دیتا، بلکہ گمراہی میں دھکیل دیتا ہے اور جسے اللہ تعالیٰ گمراہ کر دے پھر اس کا کوئی مددگار نہیں جو اسے ہدایت پر لے آئے۔ مزید دیکھیے سورۂ اعراف (۱۷۸، ۱۸۶) اور سورۂ کہف (۱۷)۔ ¤ ➋ { وَ تَرَى الظّٰلِمِيْنَ:} اور تو ان ظالموں کو دیکھے گا جو عذاب دیکھنے سے پہلے ظلم و فساد اور زمین میں سرکشی سے باز آنے پر کسی طرح تیار نہیں تھے، اس لیے یہ ظالم نہ اپنے مالک کی گرفت سے ڈرتے تھے اور نہ انھیں حساب کتاب کا کوئی خوف تھا۔ {’’ الظّٰلِمِيْنَ ‘‘} سے مراد یہاں کفار و مشرکین ہیں، کیونکہ قرآن کی اصطلاح میں انھی کے لیے یہ لفظ آتا ہے۔ یہاں اس کی دلیل ایک تو یہ ہے کہ آگے ان کے متعلق فرمایا : « اَلَاۤ اِنَّ الظّٰلِمِيْنَ فِيْ عَذَابٍ مُّقِيْمٍ » [ الشورٰی : ۴۵ ] ’’سن لو! بے شک ظالم لوگ ہمیشہ رہنے والے عذاب میں ہوں گے۔‘‘ اور یہ بات طے شدہ ہے کہ دائمی عذاب کفار و مشرکین ہی کو ہو گا۔ دوسری دلیل یہ کہ ان کے قول کے مقابلے میں مومنون کا قول ذکر فرمایا : « وَ قَالَ الَّذِيْنَ اٰمَنُوْۤا اِنَّ الْخٰسِرِيْنَ الَّذِيْنَ خَسِرُوْۤا اَنْفُسَهُمْ وَ اَهْلِيْهِمْ يَوْمَ الْقِيٰمَةِ» [ الشورٰی : ۴۵ ] ’’اور وہ لوگ جو ایمان لائے، کہیں گے اصل خسارے والے تو وہ ہیں جنھوں نے قیامت کے دن اپنی جانوں اور اپنے گھر والوں کو خسارے میں گنوا دیا۔‘‘ ¤ ➌ { لَمَّا رَاَوُا الْعَذَابَ يَقُوْلُوْنَ … :} وہی متکبر اور ظالم لوگ جو پہلے نہ رب تعالیٰ سے ڈرتے تھے اور نہ اس کے عذاب یا حساب کتاب سے ڈرتے تھے، جب عذاب دیکھیں گے تو ان کی ساری اکڑ ختم ہو جائے گی اور کہیں گے، کیا واپس جانے کا کوئی راستہ ہے کہ ہم دنیا میں جا کر اپنی کوتاہی کی تلافی کر لیں؟ مزید دیکھیے سورۂ انعام (۲۷، ۲۸) اور سورۂ اعراف (۵۳)۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ { وَ تَرٰىهُمْ يُعْرَضُوْنَ عَلَيْهَا خٰشِعِيْنَ مِنَ الذُّلِّ يَنْظُرُوْنَ …:} آگ پر حاضری کے وقت ان کی حالت کا نقشہ کھینچا ہے کہ وہ ذلت سے سر جھکائے ہوئے چھپی آنکھ سے دیکھ رہے ہوں گے، جیسے کسی کے ہاتھ پاؤں باندھ کر تلوار سے مارنے لگیں تو وہ ڈر کے مارے آنکھیں بند کر لیتا ہے، پھر کبھی کبھی تھوڑی سی آنکھ کھول کر دیکھتا ہے کہ تلوار کب اس پر گرتی ہے۔ خوف کے مارے پوری طرح آنکھیں کھول کر دیکھنے کی ہمت نہیں پڑتی۔ ¤ ➋ {وَ قَالَ الَّذِيْنَ اٰمَنُوْۤا اِنَّ الْخٰسِرِيْنَ … :} اس کی تفسیر کے لیے دیکھیے سورۂ زمر کی آیت (۱۵) کی تفسیر۔ ¤ ➌ { اَلَاۤ اِنَّ الظّٰلِمِيْنَ فِيْ عَذَابٍ مُّقِيْمٍ:} یہ ایمان والوں کے کلام کا آخری حصہ بھی ہو سکتا ہے اور اللہ تعالیٰ کا فرمان بھی۔ دائمی عذاب میں رہنے والے ظالم کافر و مشرک ہی ہیں، فرمایا : « اِنَّهٗ مَنْ يُّشْرِكْ بِاللّٰهِ فَقَدْ حَرَّمَ اللّٰهُ  عَلَيْهِ الْجَنَّةَ وَ مَاْوٰىهُ النَّارُ وَ مَا لِللِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ » [ المائدۃ : ۷۲ ] ’’بے شک حقیقت یہ ہے کہ جو بھی اللہ کے ساتھ شریک بنائے سو یقینا اس پر اللہ نے جنت حرام کر دی اور اس کا ٹھکانا آگ ہے اور ظالموں کے لیے کوئی مدد کرنے والے نہیں۔‘‘"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ { وَ مَا كَانَ لَهُمْ مِّنْ اَوْلِيَآءَ … :} اس آیت میں مشرکوں کا رد ہے جو اپنے بنائے ہوئے داتاؤں اور مشکل کشاؤں کے بارے میں عقیدہ رکھتے ہیں کہ وہ ان کے حمایتی اور مددگار ہیں، سختی اور مصیبت کے وقت ان کے کام آئیں گے اور انھیں اللہ کے عذاب سے بچا لیں گے۔ اس امید پر یہ ان کی عبادت کرتے اور انھیں پکارتے ہیں، حالانکہ یہ اعتقاد سراسر گمراہی ہے اور جسے اللہ گمراہ کر دے پھر اس کے لیے کوئی بھی راستہ نہیں۔ ¤ ➋ { وَ مَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ سَبِيْلٍ:} اور جسے اللہ گمراہ کر دے پھر اس کے لیے کوئی بھی راستہ نہیں، نہ دنیا میں ہدایت پ پانے کا اور نہ آخرت میں عذاب سے نجات کا۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {اِسْتَجِيْبُوْا لِرَبِّكُمْ مِّنْ قَبْلِ … : ’’ مَرَدَّ ‘‘ ’’رَدَّ يَرُدُّ رَدًّا‘‘ } (ن) سے مصدر میمی بھی ہو سکتا ہے، ظرف زمان بھی اور ظرف مکان بھی، ہٹانے یا ٹالنے کی کوئی صورت یا کوئی وقت یا کوئی جگہ۔ اس جملے میں اللہ تعالیٰ کی دعوت کو جلد از جلد قبول کرنے کی تاکید کئی طرح سے فرمائی ہے۔ سب سے پہلے {’’ أَجِيْبُوْا ‘‘} کے بجائے {’’ اِسْتَجِيْبُوْا ‘‘} کے لفظ کے ساتھ۔ تفصیل کے لیے دیکھیے اسی سورت کی آیت (۳۸) کی تفسیر۔ پھر اپنی ربوبیت کے احسان کی یاد دہانی کے ساتھ اور آخر میں اس دن سے ڈرانے کے ساتھ جس کے آنے کے بعد نہ اس کے ٹالے جانے کی کوئی صورت ہے، نہ وہ کسی وقت ٹالا جا سکے گا اور نہ کسی مقام پر ٹلے گا۔ ¤ ➋ { لَا مَرَدَّ لَهٗ مِنَ اللّٰهِ:} اس کے دو مطلب ہیں، ایک یہ کہ اس کے آنے کے بعد اللہ کی طرف سے اسے ہٹانے کی کوئی صورت نہیں، یعنی اللہ تعالیٰ اسے کسی صورت نہیں ہٹائے گا۔ دوسرا یہ کہ اللہ تعالیٰ کی طرف سے اس کے آنے کے بعد کوئی ایسی ہستی نہیں جو اسے ہٹا سکے۔ ¤ ➌ {وَ مَا لَكُمْ مِّنْ نَّكِيْرٍ: ’’ نَكِيْرٍ ‘‘} مصدر ہو تو اس کا معنی انکار بھی ہے اور نکرہ (اجنبی اور بے پہچان) ہونا بھی اور اگر {’’فَعِيْلٌ‘‘} بمعنی اسم فاعل ہو یعنی {’’ مُنْكِرٌ ‘‘} تو معنی ’’بدلنے والا‘‘ ہو گا۔ یعنی قیامت کے دن تم اپنے جرائم کا کسی طرح انکار نہیں کر سکو گے، بلکہ نامۂ اعمال اور فرشتوں کی شہادتوں حتیٰ کہ اپنے اعضا کی گواہی کی وجہ سے تمھارے پاس انکار کی کوئی گنجائش نہیں ہو گی۔ {’’ مَا لَكُمْ مِّنْ نَّكِيْرٍ ‘‘} کا ایک مفہوم یہ بھی ہے کہ تمھیں جو سزا دی جائے گی تم اس پر کوئی احتجاج نہیں کر سکو گے، نہ کوئی انکار کہ ہم یہ سزا قبول نہیں کرتے، نہ ہی تم یا کوئی اور اس حالت کو بدلنے والا ہو گا جس میں تم مبتلا ہو گے اور یہ بھی نہیں ہو گا کہ تمھاری پہچان نہ ہو سکے اور تم اجنبی اور غیر معروف بن کر چھوٹ جاؤ یا بھیس بدل کر چھپ جاؤ۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ { فَاِنْ اَعْرَضُوْا فَمَاۤ اَرْسَلْنٰكَ عَلَيْهِمْ حَفِيْظًا:} پچھلی آیت میں کفار کو مخاطب کرکے فرمایا تھا کہ قیامت کے دن سے پہلے جلد از جلد اپنے رب کی دعوت قبول کر لو، اب ان کے کفر پر اصرار کی صورت میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دینے کے لیے آپ صلی اللہ علیہ وسلم کو مخاطب کرکے فرمایا کہ اگر یہ آپ کی دعوت سے منہ موڑیں تو ہم نے آپ کو ان کا نگران اور ذمہ دار نہیں بنایا کہ ہر حال میں انھیں منوا کر چھوڑیں اور نہ آپ سے اس بات کی باز پرس ہو گی کہ یہ لوگ ایمان کیوں نہیں لائے۔ ¤ ➋ { اِنْ عَلَيْكَ اِلَّا الْبَلٰغُ:} آپ کا کام صرف پہنچا دینا ہے (جو آپ سرانجام دے چکے ہیں)۔ ان الفاظ میں نبی صلی اللہ علیہ وسلم کے لیے سند موجود ہے کہ آپ نے پیغام واقعی پہنچا دیا ہے اور آپ اپنی ذمہ داری سے عہدہ بر آ ہو چکے ہیں۔ ¤ ➌ {وَ اِنَّاۤ اِذَاۤ اَذَقْنَا الْاِنْسَانَ مِنَّا رَحْمَةً فَرِحَ بِهَا:} اس آیت میں آپ کو تسلی دلائی ہے کہ ان کفار کا صرف آپ کے ساتھ یہ سلوک نہیں بلکہ ان کا ہمارے ساتھ بھی ایسا ہی معاملہ ہے۔ یاد رہے کہ دنیا کی تمام نعمتیں خواہ کتنی بڑی ہوں آخرت کے مقابلے میں چکھنے سے زیادہ کچھ حیثیت نہیں رکھتیں۔ پھر {’’ رَحْمَةً ‘‘} میں تنوین بھی تنکیر اور تقلیل کے لیے ہے۔ فرمایا، انسان ایسا کم ظرف ہے کہ جب ہم اسے تھوڑی سی رحمت چکھا بھی دیتے ہیں تو یہ پھول جاتا ہے اور آپے سے باہر ہو جاتا ہے، ہمیں بھول کر اپنے آپ ہی کو سب کچھ سمجھ لیتا ہے۔ یہاں نعمت چکھانے کی نسبت اللہ تعالیٰ نے اپنی طرف فرمائی ہے، کیونکہ نعمت صرف اللہ تعالیٰ کی عطا ہے، کسی کے استحقاق کی وجہ سے اسے نہیں ملتی اور لفظ {’’ اِذَاۤ ‘‘} (جب) استعمال فرمایا، کیونکہ دنیا میں رحمت ہر انسان کو ملتی ہے۔ ¤ ➍ {وَ اِنْ تُصِبْهُمْ سَيِّئَةٌۢ بِمَا قَدَّمَتْ اَيْدِيْهِمْ … :} اور اگر انھیں ان کے اپنے اعمال کے نتیجے میں کوئی برائی یا مصیبت آ پہنچے تو یقینا انسان بہت ناشکرا ہے، پھر اسے ہماری کوئی نعمت یاد نہیں رہتی، بلکہ اس ایک مصیبت کی وجہ سے ہماری تمام نعمتوں کا صاف انکار کر دیتا ہے۔ جس طرح خاوند ساری عمر بیوی پر احسان کرے، پھر اس سے اس کے مزاج کے خلاف کوئی بات ہو جائے تو کہتی ہے : [ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ ] [ بخاري، الإیمان، باب کفران العشیر و کفر دون کفر : ۲۹ ] ’’میں نے تم سے کبھی کوئی خیر نہیں دیکھی۔‘‘ یہاں برائی کی نسبت اللہ کی طرف نہیں فرمائی، حالانکہ سبھی کچھ اللہ کی طرف سے ہے، کیونکہ اس کا باعث ان کے اعمالِ بد بنتے ہیں اور {’’ اِنْ ‘‘} (اگر) کا لفظ استعمال فرمایا ہے جس میں مصیبت پہنچنے یا نہ پہنچنے دونوں کا امکان ہے، کیونکہ رحمت کے مقابلے میں انسان پر آنے والی مصیبتیں بہت کم ہیں۔ ¤ ➎ اس آیت میں رسول اللہ صلی اللہ علیہ وسلم کو کفار کے آپ کی دعوت سے اعراض سے بھی بڑی بات کے ارتکاب کا ذکر کرکے تسلی دلائی ہے کہ جن کا مالک کے ساتھ یہ حال ہے وہ آپ سے کیا کچھ نہیں کریں گے، جیسا کہ دوسرے مقام پر یہود کے موسیٰ علیہ السلام کے ساتھ سلوک کا ذکر کرکے آپ صلی اللہ علیہ وسلم کو تسلی دلائی ہے۔ دیکھیے سورۂ نساء (۱۵۳)۔ ¤ ➏ یہاں {’’ الْاِنْسَانَ ‘‘} سے بعض مفسرین نے کافر انسان مراد لیا ہے، کیونکہ مومن ایسا نہیں ہوتا اور بعض نے فرمایا، مطلب یہ ہے کہ انسان پیدائشی طور پر ایسا ہی ہے، مگر ایمان اور عملِ صالح میں جیسے جیسے ترقی ہوتی ہے آدمی اس خصلت سے چھٹکارا حاصل کرتا جاتا ہے، ایمان کے کمال کے ساتھ وہ پوری طرح اس سے پاک ہو جاتا ہے اور مصیبت پر صبر اور نعمت پر شکر اس کی طبیعت بن جاتے ہیں، جو دونوں اس کے حق میں خیر ہی ہوتے ہیں، مگر کافر کا حال وہی رہتا ہے۔ اسی طرح کمزور ایمان کی حالت میں بھی اس بدخصلت کا اثر باقی رہتا ہے، جیسا کہ فرمایا : « اِنَّ الْاِنْسَانَ خُلِقَ هَلُوْعًا (19) اِذَا مَسَّهُ الشَّرُّ جَزُوْعًا (20) وَّ اِذَا مَسَّهُ الْخَيْرُ مَنُوْعًا (21) اِلَّا الْمُصَلِّيْنَ … اُولٰٓىِٕكَ فِيْ جَنّٰتٍ مُّكْرَمُوْنَ» [ المعارج : ۱۹ تا ۳۵ ] ’’بے شک انسان تھڑدلا پیدا کیا گیا ہے۔ جب اسے تکلیف پہنچتی ہے تو بہت گھبرا جانے والا ہے۔ اور جب اسے خیر پہنچتی ہے تو بہت روکنے والا ہے۔ سوائے نماز ادا کرنے والوں کے...... یہی لوگ جنتوں میں عزت دیے جانے والے ہیں۔‘‘ یہ دوسرا قول بہتر معلوم ہوتا ہے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 50،49) ➊ { لِلّٰهِ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ يَخْلُقُ مَا يَشَآءُ:} اس سے پہلی آیت میں انسان کا ذکر فرمایا کہ اگر اسے اس کے اپنے اعمالِ بد کے نتیجے میں کوئی مصیبت پہنچتی ہے تو انسان بہت ناشکرا ہے، وہ فوراً اللہ تعالیٰ کا شکوہ شروع کر دیتا ہے کہ اس نے مجھ سے نعمت چھین لی اور مجھ پر ظلم کیا، حالانکہ اللہ تعالیٰ کسی پر ذرّہ برابر ظلم نہیں کرتا۔ اس کی طرف ظلم کی نسبت سے بڑا ظلم کوئی نہیں، کیونکہ ایک تو انسان کو پہنچنے والی مصیبت اس کے اپنے اعمال کا نتیجہ ہے، دوسرے اللہ تعالیٰ آسمان و زمین یعنی پوری کائنات اور اس میں موجود ہر نعمت کا بادشاہ اور مالک ہے۔ جو چاہتا ہے پیدا کرتا ہے، اپنی جو نعمت جسے چاہے دیتا ہے، جسے چاہے نہیں دیتا یا چھین لیتا ہے۔ بندے پر اس کے اعمال کے نتیجے میں جو مصیبت آئی ہے زیادہ سے زیادہ یہ ہے کہ اللہ تعالیٰ نے اسے اپنی کوئی نعمت نہیں دی، یا آئندہ کے لیے روک لی ہے، مثلاً صحت، دولت یا ایمان وغیرہ۔ ظلم تو تب ہوتا جب وہ اس کی ملکیت والی کوئی چیز اسے نہ دیتا یا اس سے لے لیتا۔ جب ہر چیز اس کی ملکیت ہے تو اس کی مرضی، جسے چاہے دے جسے چاہے نہ دے، کسی کے پاس شکوے اور ناشکری کا کیا موقع ہے۔ ایمان کی نعمت سے نوازنا بھی اس کی مرضی پر موقوف ہے، وہ چاہتا تو سب کو یہ نعمت دے دیتا مگر یہ نعمت بھی وہ اسی کو دیتا ہے جسے چاہتا ہے۔ اس حقیقت کو سمجھ لینے سے تقدیر کے بہت سے مسئلے حل ہو جاتے ہیں اور آدمی اللہ تعالیٰ کے شکوے، اس کی ناشکری اور اسے ظالم کہنے سے بچ جاتا ہے، جیسا کہ فرمایا : « وَ لَوْ شَآءَ اللّٰهُ لَجَعَلَهُمْ اُمَّةً وَّاحِدَةً وَّ لٰكِنْ يُّدْخِلُ مَنْ يَّشَآءُ فِيْ رَحْمَتِهٖ وَ الظّٰلِمُوْنَ مَا لَهُمْ مِّنْ وَّلِيٍّ وَّ لَا نَصِيْرٍ » [ الشورٰی : ۸ ] ’’اور اگر اللہ چاہتا تو انھیں ایک ہی امت بنا دیتا اور لیکن وہ اپنی رحمت میں داخل کرتا ہے جسے چاہتا ہے اور جو ظالم ہیں ان کے لیے نہ کوئی دوست ہے اور نہ کوئی مددگار۔‘‘ ¤ ➋ {يَهَبُ لِمَنْ يَّشَآءُ اِنَاثًا … :} یہ اس بات کی مثال ہے کہ اللہ تعالیٰ جسے چاہے دیتا ہے اور جو چاہے دیتا ہے، چنانچہ وہ جسے چاہتا ہے لڑکیاں دیتا ہے اور جسے چاہتا ہے لڑکے دیتا ہے، یا لڑکے لڑکیاں دونوں عطا کر دیتا ہے اور جسے چاہے مرد ہو یا عورت عقیم (بانجھ) بنا دیتا ہے، کسی کو اس پر اعتراض یا شکوے کا کوئی حق نہیں۔ ¤ ➌ { اِنَّهٗ عَلِيْمٌ قَدِيْرٌ:} مخلوق کو نعمت عطا کرنے میں یہ تفاوت اندھی تقسیم نہیں بلکہ اس لیے ہے کہ وہ ہر چیز کا علم اور پوری قدرت رکھنے والا ہے، اس کا ہر فعل اس کے علم و قدرت کے تحت ہے اور اسی علم و قدرت کے ساتھ اس نے بعض کو اولاد سے محروم رکھا، کسی کو ہدایت سے اور کسی کو لڑکی یا لڑکے یا دونوں کی نعمت سے نواز دیا، کسی کو ہدایت کے تمام مرتبوں سے اونچے مرتبے نبوت سے نواز دیا، جس کا ذکر اگلی آیت میں ہے اور یہ سب کچھ اس کی مشیت کے تحت ہے، فرمایا : «اَللّٰهُ يَجْتَبِيْۤ اِلَيْهِ مَنْ يَّشَآءُ وَ يَهْدِيْۤ اِلَيْهِ مَنْ يُّنِيْبُ » [ الشورٰی : ۱۳ ] ’’اللہ اپنی طرف چن لیتا ہے جسے چاہتا ہے اور اپنی طرف راستہ اسے دیتا ہے جو رجوع کرے۔‘‘ ¤ ➍ اس آیت میں یہ حقیقت واشگاف الفاظ میں بیان کر دی گئی ہے کہ زمین و آسمان کی بادشاہی دنیا کے نام نہاد بادشاہوں، جباروں اور سرداروں کے حوالے نہیں کر دی گئی اور نہ ہی اس میں کسی نبی یا ولی، داتا، دستگیر یا دیوی دیوتا کا کوئی حصہ ہے، اس کا مالک اکیلا اللہ تعالیٰ ہے۔ کتنے جابر بادشاہ اور سپہ سالار، کتنے انبیاء و اولیاء اور کتنے ماہر ڈاکٹر اور حکیم اولاد سے محروم رہے، کتنے لڑکے کو ترستے رہے اور کتنے لڑکی کی خواہش دل میں لیے دنیا سے رخصت ہو گئے۔ اگر مشرکین اس حقیقت کو سمجھ لیں تو کبھی شرک کی حماقت نہ کریں۔ ¤ ➎ {’’ يَهَبُ لِمَنْ يَّشَآءُ اِنَاثًا ‘‘} میں لڑکیوں کو اللہ تعالیٰ کا عطیہ قرار دیا ہے۔ جو لوگ لڑکیوں کو نحوست یا عار کا باعث سمجھتے ہیں انھیں ان الفاظ پر غور کرنا چاہیے اور کسی ایسے جوڑے کے احساسات معلوم کرنے چاہییں جنھیں لڑکی بھی عطا نہیں ہوئی۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50،49) ➊ { لِلّٰهِ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ يَخْلُقُ مَا يَشَآءُ:} اس سے پہلی آیت میں انسان کا ذکر فرمایا کہ اگر اسے اس کے اپنے اعمالِ بد کے نتیجے میں کوئی مصیبت پہنچتی ہے تو انسان بہت ناشکرا ہے، وہ فوراً اللہ تعالیٰ کا شکوہ شروع کر دیتا ہے کہ اس نے مجھ سے نعمت چھین لی اور مجھ پر ظلم کیا، حالانکہ اللہ تعالیٰ کسی پر ذرّہ برابر ظلم نہیں کرتا۔ اس کی طرف ظلم کی نسبت سے بڑا ظلم کوئی نہیں، کیونکہ ایک تو انسان کو پہنچنے والی مصیبت اس کے اپنے اعمال کا نتیجہ ہے، دوسرے اللہ تعالیٰ آسمان و زمین یعنی پوری کائنات اور اس میں موجود ہر نعمت کا بادشاہ اور مالک ہے۔ جو چاہتا ہے پیدا کرتا ہے، اپنی جو نعمت جسے چاہے دیتا ہے، جسے چاہے نہیں دیتا یا چھین لیتا ہے۔ بندے پر اس کے اعمال کے نتیجے میں جو مصیبت آئی ہے زیادہ سے زیادہ یہ ہے کہ اللہ تعالیٰ نے اسے اپنی کوئی نعمت نہیں دی، یا آئندہ کے لیے روک لی ہے، مثلاً صحت، دولت یا ایمان وغیرہ۔ ظلم تو تب ہوتا جب وہ اس کی ملکیت والی کوئی چیز اسے نہ دیتا یا اس سے لے لیتا۔ جب ہر چیز اس کی ملکیت ہے تو اس کی مرضی، جسے چاہے دے جسے چاہے نہ دے، کسی کے پاس شکوے اور ناشکری کا کیا موقع ہے۔ ایمان کی نعمت سے نوازنا بھی اس کی مرضی پر موقوف ہے، وہ چاہتا تو سب کو یہ نعمت دے دیتا مگر یہ نعمت بھی وہ اسی کو دیتا ہے جسے چاہتا ہے۔ اس حقیقت کو سمجھ لینے سے تقدیر کے بہت سے مسئلے حل ہو جاتے ہیں اور آدمی اللہ تعالیٰ کے شکوے، اس کی ناشکری اور اسے ظالم کہنے سے بچ جاتا ہے، جیسا کہ فرمایا : « وَ لَوْ شَآءَ اللّٰهُ لَجَعَلَهُمْ اُمَّةً وَّاحِدَةً وَّ لٰكِنْ يُّدْخِلُ مَنْ يَّشَآءُ فِيْ رَحْمَتِهٖ وَ الظّٰلِمُوْنَ مَا لَهُمْ مِّنْ وَّلِيٍّ وَّ لَا نَصِيْرٍ » [ الشورٰی : ۸ ] ’’اور اگر اللہ چاہتا تو انھیں ایک ہی امت بنا دیتا اور لیکن وہ اپنی رحمت میں داخل کرتا ہے جسے چاہتا ہے اور جو ظالم ہیں ان کے لیے نہ کوئی دوست ہے اور نہ کوئی مددگار۔‘‘ ¤ ➋ {يَهَبُ لِمَنْ يَّشَآءُ اِنَاثًا … :} یہ اس بات کی مثال ہے کہ اللہ تعالیٰ جسے چاہے دیتا ہے اور جو چاہے دیتا ہے، چنانچہ وہ جسے چاہتا ہے لڑکیاں دیتا ہے اور جسے چاہتا ہے لڑکے دیتا ہے، یا لڑکے لڑکیاں دونوں عطا کر دیتا ہے اور جسے چاہے مرد ہو یا عورت عقیم (بانجھ) بنا دیتا ہے، کسی کو اس پر اعتراض یا شکوے کا کوئی حق نہیں۔ ¤ ➌ { اِنَّهٗ عَلِيْمٌ قَدِيْرٌ:} مخلوق کو نعمت عطا کرنے میں یہ تفاوت اندھی تقسیم نہیں بلکہ اس لیے ہے کہ وہ ہر چیز کا علم اور پوری قدرت رکھنے والا ہے، اس کا ہر فعل اس کے علم و قدرت کے تحت ہے اور اسی علم و قدرت کے ساتھ اس نے بعض کو اولاد سے محروم رکھا، کسی کو ہدایت سے اور کسی کو لڑکی یا لڑکے یا دونوں کی نعمت سے نواز دیا، کسی کو ہدایت کے تمام مرتبوں سے اونچے مرتبے نبوت سے نواز دیا، جس کا ذکر اگلی آیت میں ہے اور یہ سب کچھ اس کی مشیت کے تحت ہے، فرمایا : «اَللّٰهُ يَجْتَبِيْۤ اِلَيْهِ مَنْ يَّشَآءُ وَ يَهْدِيْۤ اِلَيْهِ مَنْ يُّنِيْبُ » [ الشورٰی : ۱۳ ] ’’اللہ اپنی طرف چن لیتا ہے جسے چاہتا ہے اور اپنی طرف راستہ اسے دیتا ہے جو رجوع کرے۔‘‘ ¤ ➍ اس آیت میں یہ حقیقت واشگاف الفاظ میں بیان کر دی گئی ہے کہ زمین و آسمان کی بادشاہی دنیا کے نام نہاد بادشاہوں، جباروں اور سرداروں کے حوالے نہیں کر دی گئی اور نہ ہی اس میں کسی نبی یا ولی، داتا، دستگیر یا دیوی دیوتا کا کوئی حصہ ہے، اس کا مالک اکیلا اللہ تعالیٰ ہے۔ کتنے جابر بادشاہ اور سپہ سالار، کتنے انبیاء و اولیاء اور کتنے ماہر ڈاکٹر اور حکیم اولاد سے محروم رہے، کتنے لڑکے کو ترستے رہے اور کتنے لڑکی کی خواہش دل میں لیے دنیا سے رخصت ہو گئے۔ اگر مشرکین اس حقیقت کو سمجھ لیں تو کبھی شرک کی حماقت نہ کریں۔ ¤ ➎ {’’ يَهَبُ لِمَنْ يَّشَآءُ اِنَاثًا ‘‘} میں لڑکیوں کو اللہ تعالیٰ کا عطیہ قرار دیا ہے۔ جو لوگ لڑکیوں کو نحوست یا عار کا باعث سمجھتے ہیں انھیں ان الفاظ پر غور کرنا چاہیے اور کسی ایسے جوڑے کے احساسات معلوم کرنے چاہییں جنھیں لڑکی بھی عطا نہیں ہوئی۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ {وَ مَا كَانَ لِبَشَرٍ اَنْ يُّكَلِّمَهُ اللّٰهُ:} کفار کا کہنا تھا : « لَوْ لَا يُكَلِّمُنَا اللّٰهُ » [ البقرۃ : ۱۱۸ ] ’’اللہ ہم سے (خود) کلام کیوں نہیں کرتا؟‘‘ بلکہ ان کی خواہش تھی کہ جس طرح نبی صلی اللہ علیہ وسلم کو کتاب عطا ہوئی ہم میں سے ہر ایک کو اسی طرح کتاب ملے، جیسا کہ فرمایا : « بَلْ يُرِيْدُ كُلُّ امْرِئٍ مِّنْهُمْ اَنْ يُّؤْتٰى صُحُفًا مُّنَشَّرَةً» [ المدثر : ۵۲ ] ’’بلکہ ان میں سے ہر آدمی یہ چاہتا ہے کہ اسے کھلے ہوئے صحیفے دیے جائیں۔ ‘‘ اللہ تعالیٰ نے اس کا جواب دیا کہ اللہ تعالیٰ ہر ایک سے کلام نہیں کرتا، بلکہ وہ اس کے لیے فرشتوں اور انسانوں میں سے انتخاب کرتا ہے، فرمایا : « اَللّٰهُ يَصْطَفِيْ مِنَ الْمَلٰٓىِٕكَةِ رُسُلًا وَّ مِنَ النَّاسِ » [ الحج : ۷۵ ] ’’اللہ فرشتوں میں سے پیغام پہنچانے والے چنتا ہے اور لوگوں سے بھی۔‘‘ اس نعمت سے بھی وہ جسے چاہتا ہے نوازتا ہے، کوئی یہ نہیں کہہ سکتا کہ مجھے یہ نعمت کیوں نہیں ملی۔ اس آیت میں فرمایا کہ وہ اپنے ان چنے ہوئے بندوں کے ساتھ بھی آمنے سامنے کلام نہیں کرتا اور نہ ہی یہ بات دنیا میں کسی بشر کے لیے ممکن ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ حِجَابُهُ النُّوْرُ وَ فِيْ رِوَايَةِ أَبِيْ بَكْرٍ النَّارُ، لَوْ كَشَفَهُ لَأَحْرَقَقَتْ سُبُحَاتُ وَجْهِهِ مَا انْتَهٰي إِلَيْهِ بَصَرُهُ مِنْ خَلْقِهِ ] [ مسلم، الإیمان، باب في قولہ صلی اللہ علیہ وسلم ’’إن اللّٰہ لا ینام‘‘… : ۱۷۹ ] ’’اللہ تعالیٰ کا حجاب ’’نور‘‘ ہے۔‘‘ ابوبکر کی روایت میں ہے کہ ’’نار‘‘ ہے ’’اگر وہ اسے ہٹا دے تو اس کے چہرے کی شعائیں جہاں تک اس کی نگاہ پہنچتی ہے اس کی مخلوق کو جلا دیں۔‘‘ ہاں آخرت میں ایمان والوں کو اللہ تعالیٰ کا دیدار ہو گا۔ تفصیل کے لیے دیکھیے سورۂ قیامہ (۲۲، ۲۳)۔ ¤ ➋ { اِلَّا وَحْيًا:} فرمایا اللہ تعالیٰ انسانوں سے ان تین طریقوں کے علاوہ کلام نہیں کرتا، ایک وحی کے ذریعے سے، یعنی یہ کہ وہ اپنے بندے کے دل میں کسی واسطے کے بغیر کوئی بات ڈال دے جس سے اسے یقین ہو جائے کہ یہ اللہ کی طرف سے ہے، خواہ بیداری کی حالت میں ہو یا نیند میں، کیونکہ انبیاء کے خواب بھی وحی ہوتے ہیں۔ دیکھیے سورہ صافات ( ۱۰۲)۔ ¤ ➌ { اَوْ مِنْ وَّرَآء حِجَابٍ:} یا یہ کہ وہ پردے کے پیچھے سے کلام کرے، جیسے اس نے موسیٰ علیہ السلام سے کلام کیا، مگر جب انھوں نے دیکھنے کی درخواست کی تو وہ قبول نہیں ہوئی۔ ¤ ➍ { اَوْ يُرْسِلَ رَسُوْلًا:} یا اللہ تعالیٰ کوئی فرشتہ بھیج کر جو بات پہنچانا چاہے پہنچا دے، جیسے جبریل علیہ السلام یا دوسرے فرشتوں کے ذریعے سے آپ کے پاس وحی آتی تھی۔ ¤ ➎ { اِنَّهٗ عَلِيٌّ حَكِيْمٌ:} یعنی وہ اس سے بہت بلند ہے کہ کسی بشر سے رُو در رُو کلام کرے، یا ہر ایک اس کے کلام کا شرف حاصل کر سکے اور وہ کمال حکمت والا ہے، جس کے تحت وہ ہر بشر سے کلام نہیں کرتا۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ {وَ كَذٰلِكَ اَوْحَيْنَاۤ اِلَيْكَ رُوْحًا مِّنْ اَمْرِنَا: ’’ رُوْحًا ‘‘} سے مراد وحی ہے، خواہ قرآن کی صورت میں ہو یا سنت کی صورت میں، کیونکہ وہ دونوں وحی ہیں، جیسا کہ فرمایا : « وَ مَا يَنْطِقُ عَنِ الْهَوٰى (3) اِنْ هُوَ اِلَّا وَحْيٌ يُّوْحٰى » [ النجم : 4،3 ] ’’اور وہ اپنی خواہش سے نہیں بولتا۔ وہ تو صرف وحی ہے جو نازل کی جاتی ہے۔‘‘ اسے ’’روح‘‘ اس لیے کہا گیا ہے کہ حقیقی زندگی اسی کے ذریعے سے حاصل ہوتی ہے، دل کی زندگی بھی اور آخرت کی زندگی بھی، جیسے فرمایا : « يُنَزِّلُ الْمَلٰٓىِٕكَةَ بِالرُّوْحِ مِنْ اَمْرِهٖ عَلٰى مَنْ يَّشَآءُ مِنْ عِبَادِهٖۤ » [ النحل : ۲ ] ’’وہ فرشتوں کو وحی کے ساتھ اپنے حکم سے بندوں میں سے جس پر چاہتا ہے نازل کرتا ہے۔‘‘ ¤ ➋ { مَا كُنْتَ تَدْرِيْ مَا الْكِتٰبُ وَ لَا الْاِيْمَانُ:} اس فرمان میں ایک تو نعمت کی یاد دہانی ہے کہ اللہ تعالیٰ نے آپ کو وہ علم عطا فرمایا جو آپ پہلے نہیں جانتے تھے۔ دوسرا یہ آپ کے نبی برحق ہونے کی دلیل ہے کہ اُمی ہونے اور کتاب و ایمان کا علم نہ رکھنے کے باوجود آپ کا قرآن کریم جیسی عظیم کتاب لانا محض اللہ تعالیٰ کی عنایت اور اس کی وحی ہی کے ذریعے سے ہو سکتا ہے۔ ¤ ➌ یہاں ایک سوال ہے کہ اس بات میں تو کوئی اشکال نہیں کہ آپ صلی اللہ علیہ وسلم کو اس سے پہلے کتاب کا علم نہ تھا، مگر یہ بات قابل غور ہے کہ آپ کو ایمان کا علم بھی نہیں تھا، کیونکہ انبیاء علیھم السلام کا نبوت ملنے سے پہلے کم از کم اللہ تعالیٰ اور اس کی وحدانیت پر ایمان تو ہوتا ہے، جیسا کہ صحیح بخاری وغیرہ میں آپ صلی اللہ علیہ وسلم کے غارِ حرا میں جا کر عبادت کرنے کا ذکر موجود ہے۔ جواب اس کا یہ ہے کہ آپ ہی نہیں سارے عرب اُمی ہونے کے باوجود اللہ تعالیٰ پر ایمان رکھتے تھے اور یہ بھی مانتے تھے کہ وہی زمین و آسمان کا خالق ہے اور پوری کائنات کی تدبیر کرنے والا ہے، مگر وہ شرک کی بیماری میں مبتلا تھے۔ انبیاء کی فطرت نہایت سلیم ہوتی ہے اور ہمارے نبی صلی اللہ علیہ وسلم کا بھی اللہ پر ایمان تھا۔ نبوت سے پہلے بھی آپ صلی اللہ علیہ وسلم سے شرک یا کبائر کا ارتکاب نہیں ہوا، مگر یہ ایمان اجمالی تھا۔ تفصیل کے ساتھ ایمان جو حدیث جبریل کے مطابق اللہ تعالیٰ، اس کے فرشتوں، اس کی کتابوں، اس کے رسولوں، یومِ آخرت اور تقدیر پر ایمان کا نام ہے، اس کی تفصیلات آپ کو وحی کے بعد ہی معلوم ہوئیں۔ اس کے علاوہ جب لفظ ایمان اکیلا بولا جائے تو اس میں تصدیق، قول اور عمل تینوں چیزیں شامل ہوتی ہیں، جیسا کہ وفد عبد القیس کی مشہور حدیث میں ہے اور جیسا کہ اللہ تعالیٰ نے سورۂ بقرہ کی آیت (۱۴۳) : « وَ مَا كَانَ اللّٰهُ لِيُضِيْعَ اِيْمَانَكُمْ» میں نماز کو ایمان قرار دیا اور جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلإِْيْمَانُ بِضْعٌ وَ سَبْعُوْنَ أَوْ بِضْعٌ  وَ سِتُّوْنَ شُعْبَةً فَأَفْضَلُهَا قَوْلُ لَا إِلٰهَ إِلَّا اللّٰهُ وَ أَدْنَاهَا إِمَاطَةُ الْأَذٰی عَنِ الطَّرِيْقِ ] [ مسلم، الإیمان، باب بیان عدد شعب الإیمان… : ۳۵ ] ’’ایمان کی ستر(۷۰) یا (فرمایا) ساٹھ (۶۰) سے زیادہ شاخیں ہیں، ان میں سب سے افضل ’’لا الٰہ الا اللہ‘‘ کہنا ہے اور سب سے کم راستے سے تکلیف دہ چیز دور کرنا ہے۔‘‘ ظاہر ہے کہ رسول اللہ صلی اللہ علیہ وسلم نماز، زکوٰۃ، حج اور دوسری ایمانیات کی تفصیلات وحیٔ الٰہی سے پہلے نہیں جانتے تھے۔ ¤ ➍ یہاں جو فرمایا کہ آپ صلی اللہ علیہ وسلم ان معاملات کو نہیں جانتے تھے، حتیٰ کہ اللہ تعالیٰ نے آپ کی طرف وحی فرمائی اور کتاب اللہ کے ذریعے سے آپ کو ہدایت کا نور عظیم عطا فرمایا، یہ بات اللہ تعالیٰ نے متعدد مقامات پر بیان فرمائی ہے، جیسے فرمایا : «وَ اَنْزَلَ اللّٰهُ عَلَيْكَ الْكِتٰبَ وَ الْحِكْمَةَ وَ عَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ » [ النساء : ۱۱۳ ] ’’اور اللہ نے تجھ پر کتاب اور حکمت نازل فرمائی اور تجھے وہ کچھ سکھایا جو تو نہیں جانتا تھا۔ ‘‘ اور فرمایا : « وَ اِنْ كُنْتَ مِنْ قَبْلِهٖ لَمِنَ الْغٰفِلِيْنَ» [ یوسف : ۳ ] ’’اور بے شک تو اس سے پہلے یقینا بے خبروں سے تھا۔‘‘ اور فرمایا : «وَ مَا كُنْتَ تَتْلُوْا مِنْ قَبْلِهٖ مِنْ كِتٰبٍ وَّ لَا تَخُطُّهٗ بِيَمِيْنِكَ اِذًا لَّارْتَابَ الْمُبْطِلُوْنَ » [ العنکببوت : ۴۸ ] ’’اور تو اس سے پہلے نہ کوئی کتاب پڑھتا تھا اور نہ اسے اپنے دائیں ہاتھ سے لکھتا تھا، اس وقت باطل والے لوگ ضرور شک کرتے۔ ‘‘ اور فرمایا : « وَ مَا كُنْتَ تَرْجُوْۤا اَنْ يُّلْقٰۤى اِلَيْكَ الْكِتٰبُ اِلَّا رَحْمَةً مِّنْ رَّبِّكَ » [ القصص : ۸۶ ]’’اور تو امید نہ رکھتا تھا کہ تیری طرف کتاب نازل کی جائے گی مگرتیرے رب کی طرف سے رحمت کی وجہ سے (یہ نازل ہوئی)۔ ‘‘ اور فرمایا : «تِلْكَ مِنْ اَنْۢبَآءِ الْغَيْبِ نُوْحِيْهَاۤ اِلَيْكَ مَا كُنْتَ تَعْلَمُهَاۤ اَنْتَ وَ لَا قَوْمُكَ مِنْ قَبْلِ هٰذَا » [ ھود : ۴۹ ] ’’یہ غیب کی خبروں سے ہے جنھیں ہم تیری طرف وحی کرتے ہیں، اس سے پہلے نہ تو انھیں جانتا تھا اور نہ تیری قوم۔‘‘ ان آیات کی تفسیر پر بھی ایک نظر ڈال لیں۔ ¤ ➎ {وَ لٰكِنْ جَعَلْنٰهُ نُوْرًا:’’ نُوْرًا ‘‘} میں تنوین تعظیم کے لیے ہے اور {’’ جَعَلْنٰهُ ‘‘} میں {’’ هُ ‘‘} ضمیر وحیٔ الٰہی کی طرف جا رہی ہے، جس کا ذکر {’’ رُوْحًا مِّنْ اَمْرِنَا ‘‘} میں ہے۔ یعنی ہم نے اس وحی کو جو قرآن اور سنت کی صورت میں ہے، عظیم نور بنا دیا۔ نور اس لیے فرمایا کہ اس کے ساتھ حق روشن ہوتا ہے اور جہالت، شک اور شرک کے اندھیرے دور ہوتے ہیں۔ ¤ ➏ { نَهْدِيْ بِهٖ مَنْ نَّشَآءُ مِنْ عِبَادِنَا :} یعنی ہم نے اس وحی کو ایسا نور بنایا جس کے ساتھ ہم اپنے بندوں میں سے جسے چاہتے ہیں ہدایت دیتے ہیں۔ اللہ تعالیٰ نے قرآن کریم کو متعدد مقامات پر نورِ ہدایت قرار دیا ہے۔ دیکھیے سورۂ نساء (۱۷۴)، اعراف (۱۵۷)، مائدہ (۱۵، ۱۶) اور سورۂ تغابن(۸)۔ ¤ ➐ { وَ اِنَّكَ لَتَهْدِيْۤ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ:} ہدایت اور صراطِ مستقیم کی تفسیر کے لیے سورۂ فاتحہ کا مطالعہ فرمائیں۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) ➊ {صِرَاطِ اللّٰهِ الَّذِيْ لَهٗ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ:} یعنی سیدھا راستہ وہ ہے جس پر چل کر انسان زمین و آسمان کے مالک اللہ تعالیٰ تک پہنچ جاتا ہے اور وہ صرف وحیٔ الٰہی کے ذریعے سے معلوم ہوتا ہے۔ اس کے سوا جتنے راستے ہیں سب شیطان کے راستے ہیں، جو اللہ تعالیٰ سے ہٹے ہوئے ہیں۔ دیکھیے سورۂ نحل (۹)۔ ¤ ➋ { اَلَاۤ اِلَى اللّٰهِ تَصِيْرُ الْاُمُوْرُ:} یعنی دنیا اور آخرت کے تمام امور کی تدبیر اللہ ہی کی طرف لوٹتی ہے، بظاہر کسی کام کی تدبیر کوئی کر رہا ہو، ظاہر میں لوگ اسے کسی کا کارنامہ سمجھیں، مگر حقیقت میں تمام امور کی تدبیر اللہ ہی کا کام ہے۔ دیکھیے سورہ یونس (۳، ۳۱)، رعد(۲) اور سجدہ (۵)۔ ’’تمام امور اللہ ہی کی طرف لوٹتے ہیں‘‘ میں یہ بھی شامل ہے کہکہ قیامت کے دن بندوں کے نیک و بد تمام کام اللہ تعالیٰ کے حضور پیش ہوں گے، وہی ان کا فیصلہ فرمائے گا اور نیکوں کو ثواب اور بدوں کو عذاب دے گا۔ [ اَللّٰھُمَّ احْشُرْنَا فِيْ زُمْرَۃِ الصَّالِحِیْنَ ]"
    }
  ]
}