{
  "surah": "Az-Zukhruf",
  "surah_number": 43,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) { حٰمٓ:} حروف مقطعات کی بحث کے لیے دیکھیے سورۂ بقرہ کی آیت(۱) کی تفسیر۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) { وَ الْكِتٰبِ الْمُبِيْنِ:} قسم اس بات کا یقین دلانے کے لیے اٹھائی جاتی ہے جو اس کے جواب میں کہی جاتی ہے، پھر بعض اوقات کسی چیز کی قسم اس کی عظمت کے پیشِ نظر کھائی جاتی ہے، تاکہ مخاطب کو بات کا یقین آ جائے، مثلاً اللہ تعالیٰ کی قسم اور بعض اوقات قسم جواب قسم کی دلیل ہوتی ہے۔ قرآن مجید کی اکثر قسمیں ایسی ہی ہیں۔ {’’ الْكِتٰبِ ‘‘} پر الف لام عہد کے لیے ہے، اس لیے ترجمہ ’’ اس کتاب کی قسم‘‘ کیا گیا ہے۔ یہاں قرآن مجید کی صفت {’’ الْمُبِيْنِ ‘‘} کو اس بات کی دلیل کے طور پر پیش کیا گیا ہے کہ اسے عربی قرآن بنا کر نازل کرنے والے ہم ہیں۔ اس کا ہر بات کو اتنے عمدہ طریقے سے کھول کر بیان کرنا شاہد ہے کہ یہ کسی انسان یا دوسری مخلوق کا کلام نہیں بلکہ رب العالمین کا نازل کردہ ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) { اِنَّا جَعَلْنٰهُ قُرْءٰنًا عَرَبِيًّا … :} اس آیت میں یہ یقین دلانے کے ساتھ کہ اس کتتاب کو ہم نے ہی نازل کیا ہے، اسے عربی قرآن بنا کر نازل کرنے کی حکمت بیان فرمائی ہے۔ تفصیل کے لیے دیکھیے سورۂ یوسف کی آیت (۲) کی تفسیر۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { لَهٗ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ:} یہ اس سوال کا جواب ہے کہ اگر محمد(  صلی اللہ علیہ وسلم ) پر یہ کتاب پہلے پیغمبروں کی طرح نازل ہوئی ہے تو ہوتی رہے، ہم پر کیوں لازم ہے کہ ہم اس کے احکام کی پابندی کریں اور اپنی مرضی پر عمل نہ کریں؟ فرمایا، اس لیے کہ آسمانوں میں اور زمین میں جو کچھ ہے سب کا مالک اللہ تعالیٰ ہے، خود تم بھی اس کی ملکیت ہو۔ بھلا وہ مالک برداشت کر سکتا ہے کہ اس کی ملکیت میں کسی اور کی خدائی چلے اور اس کا مملوک ہو کر کوئی اپنی مرضی کرتا پھرے اور اس کے بھیجے ہوئے احکام پر عمل نہ کرے۔ مزید دیکھیے آیت الکرسی یعنی سورۂ بقرہ کی آیت (۲۵۵) میں اس جملے کی تفسیر۔ ¤ ➋ { وَ هُوَ الْعَلِيُّ الْعَظِيْمُ:} بے حد بلندی اور بے انتہا عظمت والا صرف وہی ہے ({الْعَلِيُّ الْعَظِيْمُ} خبر پر الف لام آنے سے قصر پیدا ہو گیا کہ وہی علیّ و عظیم ہے) تو وہ کیسے گوارا کر سکتا ہے کہ اس کی بنائی ہوئی مخلوق اس کے مقابلے میں بے حد پست اور بے انتہا حقیر ہو کر اس کے احکام نہ مانے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { تَكَادُ السَّمٰوٰتُ يَتَفَطَّرْنَ مِنْ فَوْقِهِنَّ: ’’ وَ هُوَ الْعَلِيُّ الْعَظِيْمُ ‘‘} کے بعد یہ فرمانے کا ایک مطلب یہ ہے کہ آسمان قریب ہیں کہ اپنے اوپر سے پھٹ پڑیں، یعنی اللہ تعالیٰ کے علیّ و عظیم ہونے کی وجہ سے اس کے رعب اور جلال کا یہ عالم ہے کہ آسمان اس کی ہیبت و قوت برداشت نہ کرتے ہوئے پھٹ جائیں۔ اللہ تعالیٰ کی عظمت و ہیبت کا آسمانوں پر جو اثر ہے اس کا کچھ اندازہ اس حدیث سے ہوتا ہے جو ابو ذر رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنِّيْ أَرٰی مَا لاَ تَرَوْنَ وَأَسْمَعُ مَا لاَ تَسْمَعُوْنَ أَطَّتِ السَّمَاءُ وَحُقَّ لَهَا أَنْ تَئِطَّ مَا فِيْهَا مَوْضِعُ أَرْبَعِ أَصَابِعَ إِلاَّ وَ مَلَكٌ وَاضِعٌ جَبْهَتَهُ سَاجِدًا لِلّٰهِ، وَاللّٰهِ! لَوْ تَعْلَمُوْنَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيْلاً وَلَبَكَيْتُمْ كَثِيْرًا وَمَا تَلَذَّذْتُمْ بِالنِّسَااء عَلَی الْفُرُشِ وَلَخَرَجْتُمْ إِلَی الصُّعُدَاتِ تَجْأَرُوْنَ إِلَی اللّٰهِ ] [ترمذي، الزھد، باب في قول النبي صلی اللہ علیہ وسلم لو تعلمون … : ۲۳۱۲، و حسنہ الترمذي، و قال الألباني حسن ]’’میں وہ کچھ دیکھتا ہوں جو تم نہیں دیکھتے اور وہ سنتا ہوں جو تم نہیں سنتے۔ آسمان چرچرا رہا ہے اور اس کا حق ہے کہ چر چرائے، اس میں چار انگلیوں کی جگہ نہیں مگر کوئی نہ کوئی فرشتہ اپنی پیشانی رکھ کر اللہ کے لیے سجدے میں ہے۔ اللہ کی قسم! اگر تم وہ جان لو جو میں جانتا ہوں تو بہت کم ہنسو اور بہت زیادہ روؤ اور تم بستروں پر عورتوں سے لذت حاصل نہ کرو اور تم اللہ کی طرف گڑ گڑاتے ہوئے بیابانوں کی طرف نکل جاؤ۔‘‘ اور ایک مطلب یہ ہے کہ اس عزیز و حکیم اور علیّ و عظیم مالک کی نازل کردہ کتاب پر ایمان لانے اور اس اکیلے کی عبادت کے بجائے کسی مخلوق کو، جس کے اختیار میں کچھ بھی نہیں مشکل کشا، حاجت روا، داتا، دستگیر، غریب نواز، بگڑی بنانے والا اور ڈوبتے ہوئے کو پار لگانے والا مان لینا، یا اسے اللہ تعالیٰ کی بیوی یا بیٹا یا اس کے ذاتی نور کا ٹکڑا قرار دے کر اس کی عبادت اور اس سے مانگنا شروع کر دینا کوئی معمولی بات نہیں، بلکہ اتنی خوفناک بات ہے کہ قریب ہے یہ بات کہنے پر آسمان اپنے اوپر سے گر پڑیں، زمین شق ہو جائے اور پہاڑ ڈھے کر گر پڑیں۔ سورۂ مریم کی آیات (۸۸ تا ۹۵) میں یہ بات تفصیل سے بیان ہوئی ہے، وہ آیات مع تفسیر ملاحظہ فرما لیں۔ ¤ ➋ {مِنْ فَوْقِهِنَّ:} آسمانوں کے اپنے اوپر سے پھٹنے کا مطلب یہ ہے کہ قریب ہے کہ یہ آسمان اپنے اوپر کی جانب سے پھٹ جائیں۔ چنانچہ سب سے اوپر والا آسمان پھٹ کر نیچے والے آسمان پر گرے، وہ اس سے نچلے پر گرے، اس طرح تمام آسمان پھٹیں اور نیچے والوں کے اوپر گر جائیں۔ آسمانوں کے اپنے اوپر سے پھٹنے کی وجہ وہاں بے شمار فرشتوں کا سجدہ ریز ہونا اور عرش الٰہی کے قریب ہونے کی وجہ سے اللہ تعالیٰ کے جلال اور اس کی ہیبت کے آثار کا بہت زیادہ ہونا ہے۔ ¤ ➌ {وَ الْمَلٰٓىِٕكَةُ يُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ:} تسبیح سے مراد اللہ تعالیٰ کو ہر عیب اور ہر کمی سے پاک قرار دینا اور حمد سے مراد اسے ہر خوبی کا مالک قرار دینا ہے۔ اس کی سب سے بڑی خوبی توحید ہے اور اس کی طرف منسوب کیے جانے والے تمام عیوب میں سب سے بڑا عیب یہ ہے کہ کوئی اس کا شریک ہے یا اس کی اولاد یا بیوی ہے۔ سب سے بڑا عیب اس لیے کہ یہ مان لینے کی صورت میں اس کا محتاج اور عاجز ہونا ثابت ہوتا ہے، اللہ تعالیٰ نے اسے اپنے لیے گالی قرار دیا۔ فرشتے ہر وقت اللہ تعالیٰ کی صفاتِ جمال و جلال اور صفاتِ کمال کا ذکر کرتے رہتے ہیں۔ ¤ ➍ { وَ يَسْتَغْفِرُوْنَ لِمَنْ فِي الْاَرْضِ:} اکثر مفسرین فرماتے ہیں کہ {’’ لِمَنْ فِي الْاَرْضِ ‘‘} سے مراد مومن ہیں اور فرشتے زمین والوں میں سے صرف ایمان والوں کے لیے استغفار کرتے ہیں، کیونکہ دوسری جگہ فرمایا : « اَلَّذِيْنَ يَحْمِلُوْنَ الْعَرْشَ وَ مَنْ حَوْلَهٗ يُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْ وَ يُؤْمِنُوْنَ بِهٖ وَ يَسْتَغْفِرُوْنَ لِلَّذِيْنَ اٰمَنُوْا رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَّ عِلْمًا فَاغْفِرْ لِلَّذِيْنَ تَابُوْا وَ اتَّبَعُوْا سَبِيْلَكَ وَ قِهِمْ عَذَابَ الْجَحِيْمِ » [ المؤمن : ۷ ] ’’وہ(فرشتے) جو عرش کواٹھائے ہوئے ہیں اور وہ جو اس کے ارد گرد ہیں اپنے رب کی حمد کے ساتھ تسبیح کرتے ہیں اور اس پر ایمان رکھتے ہیں اور ان لوگوں کے لیے بخشش کی دعا کرتے ہیں جو ایمان لائے، اے ہمارے رب! تو نے ہر چیز کو رحمت اور علم سے گھیر رکھا ہے، تو ان لوگوں کو بخش دے جنھوں نے توبہ کی اور تیرے راستے پر چلے اور انھیں بھڑکتی ہوئی آگ کے عذاب سے بچا۔ ‘‘ مگر بعض مفسرین نے فرمایا : ’’آیت کے الفاظ یہ ہیں کہ (فرشتے ان لوگوں کے لیے استغفار کرتے ہیں جو زمین میں ہیں) اس میں مومن و کافر دونوں شامل ہیں اور فرشتوں کے مسلم و کافر سب کے لیے استغفار کا مطلب یہ ہے کہ وہ تمام زمین والوں کے لیے دعا کرتے رہتے ہیں، خواہ مومن ہوں یا کافر کہ اے اللہ! ان کے لیے ایسے اسباب مہیا فرما جن کی بدولت ان سے عذاب ٹلے، کافر ہیں تو ایمان لائیں، فاسق ہیں تو توبہ کریں، تاکہ ان کی بخشش ہو جائے۔‘‘ قرطبی نے اس بات کو راجح قرار دیا ہے۔ اس تفسیر پر ایک سوال ہے کہ اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم اور ایمان والوں کو مشرکین کے لیے استغفار سے منع فرمایا ہے، آپ استغفار کا کوئی بھی معنی کرلیں فرشتوں کا کفار و مشرکین کے لیے استغفار ممکن ہی نہیں، کیونکہ وہ اپنے رب کے کسی حکم کی نافرمانی کرتے ہی نہیں، جیسا کہ فرمایا : « لَا يَعْصُوْنَ اللّٰهَ مَاۤ اَمَرَهُمْ وَ يَفْعَلُوْنَ مَا يُؤْمَرُوْنَ» [ التحریم : ۶ ] ’’وہ اللہ کی نافرمانی نہیں کرتے جو وہ انھیں حکم دے اور وہ کرتے ہیں جو حکم دیے جاتے ہیں۔‘‘ اس سوال کا جواب اسی آیت میں موجود ہے جس میں مشرکین کے لیے استغفار سے منع کیا گیا ہے، چنانچہ اللہ تعالیٰ نے فرمایا : «مَا كَانَ لِلنَّبِيِّ وَ الَّذِيْنَ اٰمَنُوْۤا اَنْ يَّسْتَغْفِرُوْا لِلْمُشْرِكِيْنَ وَ لَوْ كَانُوْۤا اُولِيْ قُرْبٰى مِنْۢ بَعْدِ مَا تَبَيَّنَ لَهُمْ اَنَّهُمْ اَصْحٰبُ الْجَحِيْمِ » [ التوبۃ : ۱۱۳ ] ’’اس نبی اور ان لوگوں کے لیے جو ایمان لائے، کبھی جائز نہیں کہ وہ مشرکوں کے لیے بخشش کی دعا کریں، خواہ وہ قرابت دار ہوں، اس کے بعد کہ ان کے لیے صاف ظاہر ہوگیا کہ یقینا وہ جہنمی ہیں۔ ‘‘ معلوم ہوا مشرکین کے لیے استغفار اس وقت منع ہے جب ان کا جہنمی ہونا واضح اور یقینی ہو جائے اور ظاہر ہے کسی کے جہنمی ہونے کا یقین اس کے کفر پر مرنے کے بعد ہی ہو سکتا ہے۔ جب تک کوئی زندہ ہے کسی وقت بھی اسے ایمان کی توفیق عطا ہو سکتی ہے اور یہ علم کہ کس نے کفر پر مرنا ہے کسی انسان، جن یا فرشتے کو نہیں، اس لیے کفار کے لیے ہدایت کی دعا کرنا، جس سے ان کی بخشش ہو جائے، جائز بلکہ سنت ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ طفیل بن عمرو دوسی رضی اللہ عنہ اور ان کے ساتھی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہنے لگے : ’’یا رسول اللہ! دوس قبیلے نے نافرمانی کی ہے اور ایمان لانے سے انکار کر دیا ہے، آپ ان پر بد دعا کریں۔‘‘ لوگوں نے کہا : ’’دوس قبیلہ ہلاک ہو گیا۔‘‘ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَللّٰهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ ] [ بخاري، الجہاد، باب الدعاء للمشرکین بالھدٰی لیتألّفہم : ۲۹۳۷ ] ’’اے اللہ! دوس قبیلے کو ہدایت دے اور انھیں لے آ۔‘‘ ¤ ➎ اس آیت سے فرشتوں کی صاف دلی اور زمین والوں کے لیے خیر خواہی کا اندازہ ہوتا ہے۔ انھی انسانوں کے باپ کو سجدے کے حکم سے انکار پر ابلیس ملعون ٹھہرا تھا، جب کہ اللہ کے حکم سے فرشتوں نے سجدہ بھی کیا اور ان کے حق میں دعائیں بھی کرتے چلے جا رہے ہیں۔ وہ متکبر تھا ملعون ٹھہرا، یہ متواضع تھے مقرب ٹھہرے۔ اللہ تعالیٰ ہمیں بھی ایسی ہی صاف دلی عطا فرمائے اور ہماری طرف سے فرشتوں کو بہترین بدلا عطا فرمائے۔ (آمین) ¤ ➏ { اَلَاۤ اِنَّ اللّٰهَ هُوَ الْغَفُوْرُ الرَّحِيْمُ:} خبر{’’ الْغَفُوْرُ الرَّحِيْمُ ‘‘} پر الف لام اور ضمیرر فصل {’’ هُوَ ‘‘} سے قصر کا مفہوم پیدا ہو رہا ہے، اس لیے ترجمہ کیا گیا ہے : ’’سن لو! بے شک اللہ تعالیٰ ہی بے حد بخشنے والا، نہایت رحم والا ہے۔‘‘ یعنی کسی اور میں یہ صفات نہیں ہیں۔ اس میں مشرکین کو تنبیہ ہے کہ بخشنے والا اور رحم کرنے والا اللہ تعالیٰ ہی ہے، اگر یہ بات فرشتوں کے اختیار میں ہوتی تو وہ اللہ تعالیٰ سے اس کی درخواست کیوں کرتے؟"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { وَ الَّذِيْنَ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اَوْلِيَآءَ اللّٰهُ …:} اس جملے میں مشرکین کے لیے بہت شدید ڈانٹ اور دھمکی ہے کہ اوپر آیات میں جس اللہ کا ذکر ہوا، جو عزیز و حکیم اور علیّ و عظیم ہے، جس کی ہیبت سے آسمان پھٹنے کے قریب رہتے ہیں اور جس کی تسبیح و حمد تمام فرشتے کرتے ہیں، جن لوگوں نے اس اللہ کے سوا کسی قسم کے کارساز بنائے، جو ان کے خیال میں فوق الفطرت طریقے سے ان کی حاجتیں و مرادیں بر لاتے اور ان کی دستگیری و فریاد رسی کرتے ہیں، ان کے ایک ایک عمل کو اللہ تعالیٰ دیکھ رہا ہے، وہ سب اس کے پاس محفوظ ہیں اور بہت جلد وہ انھیں ان کا بدلا دے گا۔ ¤ ➋ { وَ مَاۤ اَنْتَ عَلَيْهِمْ بِوَكِيْلٍ: ’’ مَا‘‘} نافیہ کی تاکید {’’ بِوَكِيْلٍ ‘‘} کی بااء کے ساتھ ہو رہی ہے اور {’’ بِوَكِيْلٍ ‘‘} کی تنوین تنکیر کے لیے ہے، اس لیے ترجمہ ’’تو ہر گز ان کا کوئی ذمہ دار نہیں‘‘ کیا گیا ہے۔ {’’ وَكَلَ يَكِلُ‘‘} (ض) سپرد کرنا۔ {’’وَكِيْلٌ‘‘} جس کے سپرد کوئی کام کر دیا جائے، ذمہ دار، یعنی ان کفار و مشرکین کی نگرانی اور ان کے اعمال کی جزا اللہ تعالیٰ کا کام ہے، آپ انھیں ہدایت دینے کے ذمہ دار نہیں ہیں۔ اس لیے آپ کو زیادہ پریشان یا غمزدہ ہونے کی ضرورت نہیں، جیسا کہ فرمایا : « اِنَّمَاۤ اَنْتَ نَذِيْرٌ وَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ وَّكِيْلٌ » [ ھود : ۱۲ ] ’’تو تو صرف ڈرانے والا ہے اور اللہ ہر چیز پر نگران ہے۔ ‘‘ مزید دیکھیے سورۂ یونس (۹۹، ۱۰۰) اور سورۂ انعام (۳۵)۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { وَ كَذٰلِكَ اَوْحَيْنَاۤ اِلَيْكَ قُرْاٰنًا عَرَبِيًّا:} قرآن عربی زبان میں نازل کرنے کی چند حکمتوں کے جاننے کے لیے دیکھیے سورۂ یوسف کی آیت(۲) کی تفسیر۔ ¤ ➋ { لِتُنْذِرَ اُمَّ الْقُرٰى وَ مَنْ حَوْلَهَا: ’’ اُمَّ الْقُرٰى ‘‘} کا معنی بستیوں کی ماں یا بستیوں کی جڑ یا اصل ہے، یعنی بستیوں کا مرکز۔ مراد مکہ معظمہ ہے، کیونکہ زمین پر اللہ تعالیٰ کی عبادت کے لیے سب سے پہلا گھر یہیں تعمیر ہوا، جسے تمام دنیا کی ہدایت کا مرکز قرار دیا گیا، جیسا کہ فرمایا : « اِنَّ اَوَّلَ بَيْتٍ وُّضِعَ لِلنَّاسِ لَلَّذِيْ بِبَكَّةَ مُبٰرَكًا وَّ هُدًى لِّلْعٰلَمِيْنَ» [ آل عمران : ۹۶ ]’’بے شک پہلا گھر جو لوگوں کے لیے مقرر کیا گیا، یقینا وہی ہے جو بکہ میں ہے، بہت با برکت اور جہانوں کے لیے ہدایت ہے۔‘‘ تمام دنیا کے لوگوں کے لیے اس شہر میں موجود بیت اللہ کا حج صاحبِ استطاعت لوگوں پر فرض کیا گیا۔ رسول اللہ صلی اللہ علیہ وسلم نے اسے تمام روئے زمین سے بہتر قرار دیا۔ عبد اللہ بن عدی رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو {’’حَزْوَرَةٌ ‘‘} (شہر مکہ کی ایک جگہ) پر کھڑے دیکھا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ وَاللَّهِ ! إِنَّكِ لَخَيْرُ أَرْضِ اللّٰهِ وَأَحَبُّ أَرْضِ اللّٰهِ إِلَی اللّٰهِ وَلَوْلاَ أَنِّيْ أُخْرِجْتُ مِنْكِ مَا خَرَجْتُ ] [ ترمذي، المناقب، باب فيي فضل مکۃ : ۳۹۲۵، و قال الألباني صحیح ] ’’اللہ کی قسم! یقینا تو اللہ کی زمین میں سب سے بہتر اور اللہ کی زمین میں اللہ کو سب سے زیادہ محبوب ہے اور اگر مجھے اس سے نکالا نہ جاتا تو میں نہ نکلتا۔‘‘ آپ صلی اللہ علیہ وسلم پر وحی کی ابتدا یہاں سے ہوئی اور آپ کی دعوت کا آغاز یہیں سے ہوا۔ ¤ ➌ یہاں ایک سوال ہے کہ رسول اللہ صلی اللہ علیہ وسلم تو کل عالم اور تمام روئے زمین کے لیے ڈرانے والے تھے، پھر یہاں آپ کے بھیجنے کا مقصد صرف مکہ اور اس کے اردگرد کو کیوں بتایا گیا؟ جواب اس کا یہ ہے کہ اوّل تو {’’ مَنْ حَوْلَهَا ‘‘} میں پوری زمین شامل ہے، مکہ پوری زمین کا مرکز ہے، سب اس کی طرف منہ کرکے نماز پڑھتے ہیں اور اس کے حج کے لیے جاتے ہیں۔ اگر {’’ مَنْ حَوْلَهَا ‘‘} سے قریب قریب ارد گرد کی بستیاں مراد لی جائیں تب بھی آپ کو مکہ اور اس کے ارد گرد ڈرانے کے لیے بھیجنے کی بات کا مقصد یہ نہیں کہ آپ دوسری اقوام کی طرف مبعوث نہیں، جیسا کہ فرمایا : « وَ اَنْذِرْ عَشِيْرَتَكَ الْاَقْرَبِيْنَ» [الشعراء : ۲۱۴ ] ’’اور اپنے سب سے قریب رشتہ داروں کو ڈرا۔‘‘ سب جانتے اور مانتے ہیں کہ اس کا مقصد یہ نہیں کہ آپ صرف قریبی رشتہ داروں کے لیے مبعوث ہوئے تھے، ورنہ اہلِ مکہ و مدینہ کو دعوت دینے کی کیا ضرورت تھی؟ اسی طرح نبی صلی اللہ علیہ وسلم کو ام القریٰ اور اس کے ارد گرد لوگوں کو ڈرانے کے لیے بھیجنے کا مقصد آپ صلی اللہ علیہ وسلم کی دعوت کو یہاں تک محدود کرنا نہیں۔ اس بات کا ذکر کہ آپ صلی اللہ علیہ وسلم کی بعثت تمام جن و انس کے لیے اور قیامت تک کے لیے ہے قرآن مجید میں متعدد مقامات پر آیا ہے۔ دیکھیے سورۂ انعام (۱۹)، اعراف (۱۵۸)، فرقان (۱)، احقاف (۲۹ تا ۳۲) اور سورۂ سبا (۲۸)۔ ¤ ➍ {وَ تُنْذِرَ يَوْمَ الْجَمْعِ: ’’ أَنْذَرَ يُنْذِرُ ‘‘} (ڈرانا) کے دو مفعول ہوتے ہیں، کیونکہ ڈرانے میں دو چیزیں ملحوظ ہوتی ہیں، ایک یہ کہ کسے ڈرایا جا رہا ہے اور دوسری یہ کہ اسے کس چیز سے ڈرایا جا رہا ہے۔ اس آیت میں {’’ لِتُنْذِرَ اُمَّ الْقُرٰى وَ مَنْ حَوْلَهَا ‘‘} اور {’’ وَ تُنْذِرَ يَوْمَ الْجَمْعِ ‘‘} دو جملے ہیں، دونوں میں {’’ تُنْذِرَ ‘‘} کے دو دو مفعول ہیں۔ پہلے جملے میں پہلا مفعول ذکر فرمایا اور دوسرا حذف کر دیا، جو آیت کے الفاظ سے ظاہر ہو رہا ہے : {’’أَيْ لِتُنْذِرَ أُمَّ الْقُرٰي وَ مَنْ حَوْلَهَا الْعَذَابَ‘‘} ’’یعنی تاکہ تو امّ القریٰ اور اس کے اردگرد کے لوگوں کو عذاب سے ڈرا دے۔‘‘ دوسرے جملہ میں پہلا مفعول حذف کر دیا اور دوسرا ذکر فرمایا : {’’ أَيْ لِتُنْذِرَ أُمَّ الْقُرٰي وَمَنْ حَوْلَهَا يَوْمَ الْجَمْعِ‘‘} ’’یعنی تاکہ تو امّ القریٰ اور اس کے ارد گرد کی بستیوں کو یوم الجمع سے ڈرا دے۔‘‘ ¤ مطلب یہ ہے کہ اسی طرح ہم نے تیری طرف عربی قرآن وحی کیا، تاکہ تو بستیوں کے مرکز اور اس کے اردگرد کے لوگوں کو گزشتہ اقوام پر آنے والے عذاب سے ڈرائے اور تاکہ تو ام القریٰ اور اس کے اردگرد کی بستیوں کو گزشتہ اقوام جیسے عذاب کے ساتھ ساتھ یوم الجمع سے بھی ڈرائے۔ اتنی لمبی بات کو ان مختصر الفاظ میں سمیٹ دیا : « لِتُنْذِرَ اُمَّ الْقُرٰى وَ مَنْ حَوْلَهَا وَ تُنْذِرَ يَوْمَ الْجَمْعِ» اسے احتباک کہتے ہیں اور اس سے کلام میں اختصار، جامعیت اور حسن پیدا ہوتا ہے۔ ¤ ➎ {’’ يَوْمَ الْجَمْعِ ‘‘} قیامت کے دن کو کہتے ہیں، کیونکہ اس دن سب پہلے پچھلے جمع ہوں گے، جیسا کہ فرمایا : « يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ذٰلِكَ يَوْمُ التَّغَابُنِ» [ التغابن : ۹ ] ’’جس دن وہ تمھیں جمع کرنے کے دن کے لیے جمع کرے گا، وہی ہار جیت کا دن ہے۔‘‘ ¤ ➏ { لَا رَيْبَ فِيْهِ:} ’’جس میں کوئی شک نہیں‘‘ کیونکہ یہ بات فطرت میں رکھ دی گئی ہے کہ مالک اپنے غلاموں کو کسی کام پر مقرر کرے، پھر وہ ایک دوسرے پر ظلم و زیادتی کریں تو ضروری ہے کہ وہ کسی دن انھیں اکٹھا کر کے مظلوم کو ظالم سے انصاف دلائے، اگر ایسا نہیں کرے گا تو بے انصاف شمار ہو گا۔ تو احکم الحاکمین کے سب کو جمع کرنے کے دن میں کیا شک ہو سکتا ہے؟ رہی یہ بات کہ کچھ لوگ اس میں شک کرتے ہیں، تو ان کے شک کو کالعدم قرار دیا کہ اس کا کچھ اعتبار نہیں۔ ¤ ➐ { فَرِيْقٌ فِي الْجَنَّةِ وَ فَرِيْقٌ فِي السَّعِيْرِ:} یہ {’’ يَوْمَ الْجَمْعِ ‘‘} کا انجام ہے کہ ایک گروہ جنت میں جائے گا اور ایک گروہ بھڑکتی ہوئی آگ میں جائے گا۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {وَ لَوْ شَآءَ اللّٰهُ لَجَعَلَهُمْ اُمَّةً وَّاحِدَةً:} یہ اس سوال کا جواب ہے کہ اللہ تعالیٰ نے ایک فریق جنتی اور ایک جہنمی کیوں بنایا، سبھی کو ایک جیسا کیوں نہیں بنا دیا۔ یعنی اللہ تعالیٰ چاہتا تو جس طرح اس نے کائنات کی تمام چیزوں کو بے اختیار بنایا ہے وہ جن و انس کو بھی کسی قسم کا اختیار نہ دیتا۔ اگر وہ ایسا کرتا تو وہ سب دین حق پر ہوتے، مگر اس نے انھیں اختیار اور ارادہ میں آزادی دے کر پیدا فرمایا، تاکہ ان کا امتحان ہو اور اس کی صفات رحمت، غضب اور عدل کا ظہور ہو۔ یہ اس کی مشیت ہے، جس میں بے شمار حکمتیں ہیں، جنھیں پوری طرح وہی جانتا ہے، انسان چاہے بھی تو ان کی تہ تک نہیں پہنچ سکتا، وہ اتنا ہی جان سکتا ہے جتنا پروردگار چاہے۔ ¤ ➋ {وَ لٰكِنْ يُّدْخِلُ مَنْ يَّشَآءُ فِيْ رَحْمَتِهٖ:} نیکی و بدی کی تمیز اور ان میں سے کسی ایک کو اختیار کرنے کی آزادی دینے کے بعد وہ جسے چاہتا ہے اپنی رحمت میں داخل کر لیتا ہے، مگر اس کی یہ مشیت اندھی نہیں کہ اس کا کوئی قاعدہ نہ ہو، بلکہ اس سے اگلے جملے سے ظاہر ہو رہا ہے کہ وہ کون لوگ ہیں جو اللہ کی رحمت کے حق دار بنتے ہیں اور وہ کون ہیں جو اس سے محروم رہتے ہیں۔ ¤ ➌ {وَ الظّٰلِمُوْنَ مَا لَهُمْ مِّنْ وَّلِيٍّ وَّ لَا نَصِيْرٍ:} قرآن مجید کی اصطلاح میں ’’ظلم‘‘ اور ’’ظالمين‘‘ کا لفظ شرک اور مشرکین کے لیے استعمال ہوتا ہے (دیکھیے انعام : ۸۲) اور ’’قسط‘‘ اور ’’عدل‘‘ کا لفظ توحید کے لیے آیا ہے، کیونکہ سب سے بڑا ظلم شرک ہے اور سب سے بڑا عدل توحید ہے، جیسا کہ فرمایا : « شَهِدَ اللّٰهُ اَنَّهٗ لَاۤ اِلٰهَ اِلَّا هُوَ وَ الْمَلٰٓىِٕكَةُ وَ اُولُوا الْعِلْممِ قَآىِٕمًۢا بِالْقِسْطِ» [آل عمران : ۱۸ ] ’’اللہ نے گواہی دی کہ حقیقت یہ ہے کہ اس کے سوا کوئی معبود نہیں اور فرشتوں نے اور علم والوں نے بھی، اس حال میں کہ وہ انصاف پر قائم ہے۔‘‘ ارادہ و عمل کا اختیار ملنے کے بعد جن لوگوں نے اپنی جان پر ظلم کیا، اپنے خالق و مالک اور رازق کو اکیلا معبود بنانے اور اسی کی عبادت پر قائم رہنے کے بجائے غیروں کو معبود بنایا، جن کے اختیار میں کچھ بھی نہیں، تو ان کا نہ کوئی دوست ہے اور نہ کوئی مددگار۔ معلوم ہوا ایسے لوگ اللہ کی رحمت میں داخل نہیں ہوں گے، کیونکہ انھیں اپنی رحمت میں داخل کرنا اللہ تعالیٰ کے عدل اور مشیت کے خلاف ہے اور وہ خود بھی اللہ کی رحمت سے ناامید ہیں، ورنہ کبھی غیروں کی طرف نہ جاتے، جیسا کہ فرمایا : « اُولٰٓىِٕكَ يَىِٕسُوْا مِنْ رَّحْمَتِيْ » [ العنکبوت : ۲۳ ] ’’وہ میری رحمت سے ناامید ہو چکے ہیں۔‘‘یہی بات نہایت وضاحت کے ساتھ سورۂ دہر (۲۹، ۳۰) میں بیان فرمائی گئی ہے۔ہاں، جو لوگ ایمان لائے اور اس میں ظلم عظیم یعنی شرک کی آمیزش نہیں کی وہی اللہ تعالیٰ کی رحمت میں داخل ہوں گے اور وہی اس کی امید رکھ سکتے ہیں، جیسا کہ فرمایا : « اُولٰٓىِٕكَ يَرْجُوْنَ رَحْمَتَ اللّٰهِ» [ البقرۃ : ۲۱۸ ] ’’وہی اللہ کی رحمت کی امید رکھتے ہیں۔‘‘ ¤ ➍ اس آیت میں رسول اللہ صلی اللہ علیہ وسلم اور مسلمانوں کو تسلی بھی دی گئی ہے کہ اگر کچھ لوگ حق واضح ہونے کے بعد بھی ایمان نہیں لاتے اور کفر و شرک پر اڑے رہتے ہیں تو آپ کو فکر مند ہونے کی ضرورت نہیں، اللہ تعالیٰ چاہتا تو سب لوگوں کو ہدایت دے دیتا، مگر یہ جبر ہوتا جو اللہ تعالیٰ کی مشیت نہیں۔ اس نے اپنی حکمت اور مشیت کے تحت انسان کو اختیار دے رکھا ہے، جو چاہے ایمان لائے جو چاہے کفر کرے، اس لیے لوگوں میں یہ اختلاف ہمیشہ رہے گا۔ یہ مضمون متعدد آیات میں بیان ہوا ہے، دیکھیے سورۂ یونس (۹۹، ۱۰۰)، ہود (۱۱۸، ۱۱۹) اور سورۂ سجدہ (۱۳)۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { اَمِ اتَّخَذُوْا مِنْ دُوْنِهٖۤ اَوْلِيَآءَ … :} پچھلی آیت میں جو فرمایا کہ ظالموں کے لیے نہ ولی (دوست) ہے نہ کوئی مددگار، یہ اس کی تفصیل ہے کہ آیا انھوں نے اللہ کو چھوڑ کر کوئی اولیاء، کارساز اور دوست بنا رکھے ہیں۔ سو اصل دوست جو فی الواقع کارسازی اور مدد کر سکتا ہے وہ تو صرف اللہ ہے۔ ساتھ ہی اس کی دو زبردست دلیلیں بیان فرمائیں کہ وہی مردوں کو زندگی بخشتا ہے اور بخشے گا اور وہی ہر چیز پر پوری طرح قادر ہے، کیونکہ اس کا حق وہی رکھتا ہے جس میں یہ صفات ہوں۔ پھر اس سے بڑا ظلم کیا ہو گا کہ ایسی ہستیوں کو اولیاء اور کارساز بنا لیا جائے جو کسی کو زندگی بخشنا تو درکنار خود مرنے والے ہیں، فرمایا : « اَمْوَاتٌ غَيْرُ اَحْيَآءٍ وَ مَا يَشْعُرُوْنَ اَيَّانَ يُبْعَثُوْنَ » [ النحل : ۲۱ ] ’’مردے ہیں، زندہ نہیں ہیں اور وہ نہیں جانتے کب اٹھائے جائیں گے۔ ‘‘ ہر چیز پر قدرت تو بہت دور، ایک ذرّے کے بھی مالک نہیں ہیں۔ دیکھیے سورۂ سبا (۲۲)۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {وَ مَا اخْتَلَفْتُمْ فِيْهِ مِنْ شَيْءٍ … :} یہ آیت اگرچہ اللہ تعالیٰ کا کلام ہے مگر یہ بات رسول اللہ صلی اللہ علیہ وسلم کی زبان سے کہلوائی گئی ہے، جیسا کہ سورۂ فاتحہ بندوں کی زبانی کہلوائی گئی ہے۔ ¤ ➋ اس سے پہلی آیات میں اللہ تعالیٰ کی جو صفات بیان ہوئی ہیں کہ وہ زمین و آسمان کی ہر چیز کا مالک اور ولی و کارساز ہے، موت و حیات اس کے ہاتھ میں ہے اور وہ ہر چیز پر پوری طرح قادر ہے، ان صفات سے خود بخود وہ بات ثابت ہو رہی ہے جو اس آیت میں فرمائی ہے کہ جب مالک وہ ہے تو حاکم بھی وہی ہے اور انسانوں کے درمیان پیدا ہونے والے اختلافات کا فیصلہ بھی اسی کا کام ہے۔ وہ اختلاف عقیدہ میں ہو یا عمل میں، عبادات میں ہو یا معاملات میں، نیکی و بدی قرار دینے میں ہو یا حلال و حرام ٹھہرانے میں، غرض ہر بات میں فیصلہ اسی کا چلے گا۔ کسی اور کو یہ حق دینا کہ وہ شریعت سازی کرے یا حلال و حرام کا فیصلہ کرے درحقیقت اس کی عبادت اور اسے اللہ تعالیٰ کا شریک بنانا ہے، فرمایا : « اِنِ الْحُكْمُ اِلَّا لِلّٰهِ اَمَرَ اَلَّا تَعْبُدُوْۤا اِلَّاۤ اِيَّاهُ » [ یوسف : ۴۰ ] ’’حکم اللہ کے سوا کسی کا نہیں، اس نے حکم دیا ہے کہ اس کے سوا اور کسی کی عبادت مت کرو۔‘‘ مزید دیکھیے سورۂ یوسف (۶۷)، انعام (۵۷)، مائدہ (۴۴)، کہف (۲۶) اور سورۂ قصص (۷۰، ۸۸)۔ ¤ رسول اللہ صلی اللہ علیہ وسلم ہر فیصلہ اللہ تعالیٰ کی وحی کے ذریعے سے اور اس کے حکم کے تحت کرتے، اس لیے آپ صلی اللہ علیہ وسلم کا فیصلہ اللہ تعالیٰ کا فیصلہ ہے اور اللہ تعالیٰ نے ہر تنازع کا فیصلہ اللہ اور اس کے رسول کے سپرد کرنے کو ایمان کی شرط قرار دیا ہے، جیسا کہ فرمایا : « فَاِنْ تَنَازَعْتُمْ فِيْ شَيْءٍ فَرُدُّوْهُ اِلَى اللّٰهِ وَ الرَّسُوْلِ اِنْ كُنْتُمْ تُؤْمِنُوْنَ بِاللّٰهِ وَ الْيَوْمِ الْاٰخِرِ » [النساء : ۵۹ ] ’’پھر اگر تم کسی چیز میں جھگڑ پڑو تو اسے اللہ اور رسول کی طرف لوٹاؤ، اگر تم اللہ اور یومِ آخر پر ایمان رکھتے ہو۔‘‘ اور فرمایا : « فَلَا وَ رَبِّكَ لَا يُؤْمِنُوْنَ حَتّٰى يُحَكِّمُوْكَ فِيْمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوْا فِيْۤ اَنْفُسِهِمْ حَرَجًا مِّمَّا قَضَيْتَ وَ يُسَلِّمُوْا تَسْلِيْمًا » [ النساء : ۶۵ ] ’’پس نہیں! تیرے رب کی قسم ہے! وہ مومن نہیں ہوں گے، یہاں تک کہ تجھے اس میں فیصلہ کرنے والا مان لیں جو ان کے درمیان جھگڑا پڑ جائے، پھر اپنے دلوں میں اس سے کوئی تنگی محسوس نہ کریں جو تو فیصلہ کرے اور تسلیم کرلیں، پوری طرح تسلیم کرنا۔ ‘‘ ¤ ➌ یہود و نصاریٰ نے اپنے احبار و رہبان کو حلال و حرام کے فیصلے کا اختیار دیا تو اللہ تعالیٰ نے فرمایا کہ انھوں نے اپنے احبار و رہبان کو {’’ اَرْبَابًا مِّنْ دُوْنِ اللّٰهِ ‘‘} بنا لیا۔ دیکھیے سورۂ توبہ (۳۱) کی تفسیر۔ ¤ ➍ یہود و نصاریٰ نے ایک مدت تک حلال و حرام قرار دینے کا اختیار آسمانی شریعت کے بجائے اپنے احبار و رہبان کو دیے رکھا، آخر کار انھوں نے یہ تکلف بھی برطرف کیا اور اپنی آسمانی کتاب یا احبار و رہبان کے بجائے جمہوریت کے نام پر یہ اختیار خود سنبھال لیا کہ عوام کی اکثریت جو فیصلہ کرے وہ حق ہے، ان کے منتخب نمائندے اپنی اکثریت کے ساتھ جسے حلال کہہ دیں وہ حلال اور جسے حرام کہہ دیں وہ حرام ہے۔ آج اگر اکثریت کسی چیز کو حلال کہہ رہی ہے تو وہ حلال ہے، کچھ دن بعد اکثریت اگر حرام کہہ دے تو وہ حرام ہے۔ اب تورات کی ہر قید جو طبیعتوں پر گراں تھی توڑ دی گئی، باہمی رضا سے زنا جائز قرار دیا گیا، رجم کو کالعدم کر دیا گیا، قومِ لوط کا عمل جائز قرار دیا گیا، قتل اور قطع اعضا میں قصاص ختم کر دیا گیا اور سود حلال ٹھہرا۔ غرض جمہوریت کے نام پر ایک نئی شریعت ایجاد کی گئی جس کا رب، رسول اور شریعت سب کچھ انسان قرار پائے، اس طرح بندوں کو مالک کی گدی پر بٹھا دیا گیا۔ ¤ ➎ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : [ لَتَتْبَعُنَّ سَنَنَ مَنْ كَانَ قَبْلَكُمْ شِبْرًا شِبْرًا وَذِرَاعًا ذِرَاعًا، حَتّٰی لَوْ دَخَلُوْا جُحْرَ ضَبٍّ تَبِعْتُمُوْهُممْ، قُلْنَا يَا رَسُوْلَ اللّٰهِ! الْيَهُوْدُ وَالنَّصَارٰی؟ قَالَ فَمَنْ؟ ] [ بخاري، الاعتصام بالکتاب والسنۃ، باب قول النبي صلی اللہ علیہ وسلم : ’’ لتتبعن سنن من کان قبلکم‘‘: ۷۳۲۰، عن أبي سعید الخدري رضی اللہ عنہ ] ’’تم ہر صورت اپنے سے پہلے لوگوں کے طریقوں پر چل پڑو گے، جیسے بالشت بالشت کے ساتھ اور ہاتھ ہاتھ کے ساتھ برابر ہوتا ہے، حتیٰ کہ اگر وہ گوہ کے بل میں داخل ہوئے تو تم ان کی پیروی کرو گے۔‘‘ ہم نے کہا : ’’یا رسول اللہ! یہود و نصاریٰ کے طریقوں پر؟‘‘ آپ نے فرمایا : ’’تو اور کون؟‘‘ ¤ مسلمان خیر القرون میں اور اس کے کچھ عرصہ بعد تک صرف اور صرف قرآن و سنت پر کار بند رہے، یہ اسلام کی ترقی و عروج کا دور ہے، پھر بعض ائمہ کی تقلید شروع ہوئی اور ان کے نام پر ایسی گروہ بندی اور فرقہ سازی ہوئی کہ بعض لوگ یہ جانتے ہوئے بھی کہ ان کے امام کا قول اللہ اور اس کے رسول کے صریح خلاف ہے، اپنے امام کے قول پر اڑ گئے۔ احبار و رہبان کو ارباب بنانے کا نقشہ اہلِ کتاب کی طرح اہلِ اسلام میں بھی نظر آنے لگا، حتیٰ کہ یہ دین حق کئی مذہبوں میں تقسیم ہو گیا۔ ہر کسی کی مساجد الگ، عدالتیں اور قاضی الگ ہو گئے، امت کی وحدت جو صرف کتاب و سنت کو حاکم ماننے سے حاصل ہوتی تھی پارہ پارہ ہو گئی، مسلمانوں کی توانائیاں کفار کے ساتھ جہاد اور اس کی تیاری کے بجائے ایک دوسرے کے خلاف صرف ہونے لگیں۔ یہی لوگ حاکم تھے یہی قاضی، اصلاح کی آوازیں اٹھتی رہیں، مگر بے سود۔ چنانچہ کچھ مدت تک تو کتاب و سنت سے انحراف کے باوجود الگ الگ سلطنتوں کی شکل میں مسلمانوں کی حکمرانی کا سلسلہ چلتا رہا، پھر باہمی فساد اور ترکِ جہاد کا نتیجہ یہ ہوا کہ دو چار ملکوں کے سوا تمام مسلم ممالک نصرانی یا کمیونسٹ کفار کے قبضے میں چلے گئے، جنھوں نے جبراً ان ممالک میں اپنے کفریہ احکام نافذ کر دیے، پھر نہ کتاب و سنت کے احکام باقی رہے نہ ائمہ کے مذاہب۔ ہر جگہ کفار کا حکم چلنے لگا اور بنی اسرائیل کی طرح مسلمانوں پر بھی اللہ کے عذاب کا کوڑا کفار کی غلامی کی صورت میں برسنے لگا۔ مسلمان آزادی حاصل کرنے کے لیے مسلسل جد و جہد اور دعائیں کرتے رہے، حتیٰ کہ اللہ تعالیٰ نے ان پر رحم فرمایا اور ان کی آزادی کے لیے جد و جہد اور کفار کی باہمی جنگ عظیم کے نتیجے میں بہت سے مسلم ممالک کو آزادی ملی۔ اس کے بعد جہاد کے نتیجے میں بہت سے ممالک کمیونسٹوں کے تسلط سے بھی آزاد ہوئے، مگر تمام ممالک میں برسر اقتدار طبقے نے کفر کا وہی نظامِ حکومت برقرار رکھا جو کفار کے زمانے میں تھا، جس میں فیصلہ اللہ اوراس کے رسول کے احکام کے مطابق نہیں بلکہ انسانوں کے بنائے ہوئے قوانین کے مطابق ہوتا ہے۔ اس طرح مسلمانوں کے اہلِ کتاب کے نقش قدم پر چلنے کی پیش گوئی پوری ہو گئی۔ اللہ تعالیٰ کا دین صرف نماز روزے وغیرہ کے لیے باقی رہ گیا، گھروں، بازاروں، عدالتوں اور حکومت کے ایوانوں سے اللہ تعالیٰ کے حکم کو جلاوطن کرکے اس کی جگہ جمہوریت کے بت کی پرستش شروع کر دی گئی۔ البتہ بعض ملکوں میں یہ تکلف کیا گیا کہ اس کا نام اسلامی جمہوریت رکھ دیا گیا، حالانکہ اسلام میں حکم اللہ کا ہوتا ہے اور جمہوریت میں بندوں کا، دونوں ایک دوسرے کی ضد ہیں، کبھی جمع نہیں ہو سکتے۔ یہ ایسے ہی ہے جیسے شراب کو اسلامی شراب اور سود کو اسلامی سود کہہ کر حلال کر لیا جائے، جیسا کہ یہ ظلم بھی اس سے پہلے مسلمان اپنی جانوں پر کر چکے ہیں۔ ان کے بہت سے برسراقتدار طبقوں نے ان علماء کے اقوال کو اپنی مملکتوں میں نافذ کیا جنھوں نے صرف انگور اور کھجور کی شراب کو حرام قرار دے کر دوسرے تمام نشہ آور مشروبات پینے پر حد ختم کر دی، خواہ ان سے نشہ بھی آ جائے۔ جس کے نتیجے میں مسلمانوں کی عظیم سلطنتیں شراب کے سمندر میں غرق ہو گئیں کہ حکمران بھی پیتے تھے اور رعایا بھی اور جائز سمجھ کر پیتے تھے۔ اسی طرح سود کی بہت سی قسموں کو جائز قرار دے کر اسلامی سود رائج ہونے کے نتیجے میں طمع و ہوس کے طوفان نے ہمدردی و ایثار کا سلسلہ ختم کر دیا اور حرام ہوسِ زرّ نے مسلمانوں کو آخرت سے غافل کر دیا۔ ¤ حقیقت یہ ہے کہ اب بھی دنیا اور آخرت دونوں میں مسلمانوں کی نجات اسی میں ہے کہ وہ دوبارہ اللہ اور اس کے رسول کے فیصلے کی طرف واپس پلٹیں اور اپنی پوری زندگی میں اس کی اطاعت اختیار کریں۔ ان شاء اللہ وہ وقت آنے والا ہے جب دوبارہ خلافت علیٰ منہاج النبوۃ قائم ہو گی، جس میں اللہ کی زمین پر صرف اللہ کا حکم چلے گا۔ یہ رسول صادق صلی اللہ علیہ و وسلم کی پیش گوئی ہے اور ہر صورت پوری ہو گی۔ ہمارا کام جد و جہد ہے، اللہ چاہے گا تو ہم اپنی آنکھوں سے وہ مبارک دن دیکھیں گے، ورنہ ہمارے بعد آنے والے اسے ضرور دیکھیں گے۔ اللہ تعالیٰ سے دعا ہے کہ وہ ہمیں اپنے ان بندوں میں شامل فرمائے جو قیامت تک دین حق قائم رکھنے کے لیے لڑتے رہیں گے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَنْ يَّبْرَحَ هٰذَا الدِّيْنُ قَائِمًا يُقَاتِلُ عَلَيْهِ عِصَابَةٌ مِنَ الْمُسْلِمِيْنَ حَتّٰی تَقُوْمَ السَّاعَةُ ] [ مسلم، الإمارۃ، باب قولہ صلی اللہ علیہ وسلم : ’’لا تزال طائفۃ من أمتي ظاھرین علی الحق…‘‘ : ۱۹۲۲، عن جابر بن سمرۃ رضی اللہ عنہ ] ’’یہ دین ہمیشہ قائم رہے گا، مسلمانوں کی ایک جماعت اس پر لڑتی رہے گی، یہاں تک کہ قیامت قائم ہو۔‘‘ ¤ ➏ { فَحُكْمُهٗۤ اِلَى اللّٰهِ:} ہر جھگڑے کا فیصلہ اللہ تعالیٰ کے سپرد ہونے میں شرعی احکام کا فیصلہ بھی شامل ہے، جیسا کہ اوپر گزرا اور یہ بھی کہ دنیا میں لوگوں کے درمیان جتنے جھگڑے ہیں ان کا واضح فیصلہ قیامت کے دن اللہ تعالیٰ ہی فرمائے گا۔ دنیا میں کفار اپنے آپ کو حق پر کہتے رہیں، مگر وہاں انبیاء اور ان کے متبعین کا حق پر ہونا اور کفار کا باطل پر ہونا سب کے سامنے واضح ہو کر آ جائے گا، جیسا کہ اللہ تعالیٰ نے فرمایا : « قُلِ اللّٰهُمَّ فَاطِرَ السَّمٰوٰتِ وَ الْاَرْضِ عٰلِمَ الْغَيْبِ وَ الشَّهَادَةِ اَنْتَ تَحْكحْكُمُ بَيْنَ عِبَادِكَ فِيْ مَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ» [ الزمر : ۴۶ ]’’تو کہہ اے اللہ! آسمانوں اور زمین کو پیدا کرنے والے! ہر چھپی اور کھلی کو جاننے والے! تو ہی اپنے بندوں کے درمیان اس چیز کا فیصلہ کرے گا جس میں وہ اختلاف کیا کرتے تھے۔‘‘ ¤ ➐ { ذٰلِكُمُ اللّٰهُ رَبِّيْ:} یعنی وہی اللہ جس کی چند صفات اوپر کی آیات میں بیان ہوئیں، جنھیں تم بھی مانتے ہو، جو مختصراً یہ ہیں کہ وہ عزیز و حکیم ہے، علیّ و عظیم ہے، غفور و رحیم ہے، حقیقی ولی ہے، مردوں کو زندہ کرنے والا اور ہر چیز پر پوری طرح قادر ہے، تمام اختلافات کا فیصلہ کرنے والا ہے، وہی اللہ میرا رب ہے، ان میں سے ایک بھی صفت جب کسی اور میں پائی ہی نہیں جاتی تو میں کسی اور کو اپنا رب کیسے مان لوں؟ ¤ ➑ { ’’ عَلَيْهِ تَوَكَّلْتُ ‘‘} (اسی پر میں نے بھروسا کیا) فعل ماضی ہے اور {’’ وَ اِلَيْهِ اُنِيْبُ ‘‘} (اور اسی کی طرف میں رجوع کرتا ہوں) فعل مضارع ہے، جس میں استمرار اور ہمیشگی پائی جاتی ہے۔ {’’ عَلَيْهِ ‘‘} اور {’’ اِلَيْهِ ‘‘} پہلے آنے سے قصر کا معنی پیدا ہوا، اس لیے ترجمہ ’’اسی پر‘‘ اور ’’اسی کی طرف‘‘ کیا گیا ہے۔ یعنی میں شروع سے اسی پر بھروسا کر چکا اور اب ہر بات میں اسی کی طرف رجوع کرتا ہوں، ہر مسئلے کا حکم اسی سے لیتا ہوں، ہر جھگڑے کا فیصلہ اسی سے کرواتا ہوں اور ہر گناہ پر اسی سے معافی مانگتا ہوں اور اسی کو حق سمجھتا ہوں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ { فَاطِرُ السَّمٰوٰتِ وَ الْاَرْضِ … :} یہ اللہ ہی کو رب ماننے، اسی پر توکل اور اسی کی طرف رجوع کی مزید دلیلیں ہیں۔ ایک یہ کہ وہی کسی نمونے اور مادے کے بغیر آسمانوں کو اور زمین کو پیدا کرنے والا ہے، جب کہ تمھارے بنائے ہوئے معبودوں نے نہ ایک ذرہ پیدا کیا نہ کر سکتے ہیں۔ مزید دیکھیے سورہ حج ( ۷۳)۔ ¤ ➋ { جَعَلَ لَكُمْ مِّنْ اَنْفُسِكُمْ اَزْوَاجًا … :} آسمان و زمین کو پیدا کرنے کے بعد اس نے تمھارے لیے خود تمھی میں سے تمھارے جوڑے بنائے، تاکہ تمھاری نسل جاری ہو اور مسلسل چلتی رہے۔ اپنی جنس سے جوڑے بنانے سے جو باہمی انس حاصل ہوتا ہے وہ کسی اور جنس سے جوڑا بنانے سے حاصل نہیں ہو سکتا۔ ابن عاشور نے فرمایا کہ عربوں میں جننیوں وغیرہ سے نکاح کی جتنی داستانیں مشہور ہیں سب جھوٹی اور خود ساختہ ہیں، کچھ لوگوں کے تخیل نے انھیں ایسا دکھایا، ورنہ حقیقت میں ان کا کوئی وجود نہیں۔ اور تمھاری ضروریات کے لیے چوپاؤں کے جوڑے بنائے، تاکہ وہ بڑھتے پھیلتے رہیں اور تم ان سے اپنی ضروریات پوری کرتے رہو۔ ¤ ➌ { يَذْرَؤُكُمْ فِيْهِ:} یعنی جوڑے اس لیے بنائے تاکہ توالد و تناسل کا سلسلہ قائم رہے اور تمھاری نسل پھلتی پھولتی اور پھیلتی رہے۔ ¤ ➍ { لَيْسَ كَمِثْلِهٖ شَيْءٌ:} انسانوں کے درمیان اگرچہ رنگوں اور زبانوں کا اختلاف پایا جاتا ہے اور ہر انسان دوسرے سے الگ تشخص رکھتا ہے، اس کے باوجود وہ بہت سی چیزوں میں ایک دوسرے کے مشابہ اور ایک دوسرے کے مثل ہیں۔ چوپاؤں اور دوسرے حیوانات کا بھی یہی حال ہے۔ صرف اللہ تعالیٰ کا امتیاز ہے کہ کوئی چیز اس کی ذات یا صفات کی مثل کسی طرح بھی نہیں۔ ¤ ➎ { لَيْسَ كَمِثْلِهٖ شَيْءٌ:} اپنے سلسلۂ ازدواج اور سلسلۂ توالد و تناسل کو دیکھ کر یہ نہ سمجھ بیٹھنا کہ اللہ تعالیٰ بھی تمھاری طرح ہے۔ نہیں، خالق و مخلوق ایک جیسے نہیں ہو سکتے۔ اس جیسی کوئی چیز نہیں، نہ ذات میں، نہ صفات میں اور نہ افعال و حقوق میں۔ اس کا کوئی جوڑا نہیں اور وہ نہ کسی کی اولاد ہے، نہ کوئی اس کی اولاد ہے اور نہ کوئی اس کا شریک و ہمسر ہے ۔ مزید دیکھیے سورہ اخلاص۔ ¤ ➏ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} پر ایک مشہور سوال ہے کہ جب کہنا یہ مقصود ہے کہ اللہ کی مثل کوئی چیز نہیں تو {’’لَيْسَ مِثْلَهُ شَيْءٌ ‘‘} کافی تھا، ’’کاف‘‘ لانے کی کیا ضرورت تھی؟ ’’کاف‘‘ لانے سے تو بظاہر ایسا معنی پیدا ہو رہا ہے جو محال ہے، کیونکہ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کا ترجمہ ہو گا ’’اس کی مثل جیسی کوئی چیز نہیں‘‘ جب کہ اس ترجمے سے دو محال باتیں لازم آتی ہیں، پہلی یہ کہ اللہ کی مثل کوئی ہے جب کہ یہ محال ہے۔ دوسری یہ کہ اس کی مثل جیسی کوئی چیز نہیں، حالانکہ جب وہ اللہ کی مثل ہے تو ظاہر ہے اللہ تعالیٰ اس جیسا ہے، تبھی وہ اس کی مثل ہے۔ اس سوال کا حل اہل علم نے مختلف طریقوں سے کیا ہے، ایک یہ ہے کہ اس میں ’’کاف‘‘ زائد ہے۔ زائد کا یہ مقصد نہیں کہ بے فائدہ ہے، بلکہ وہ {’’مِثْلٌ‘‘} کی تاکید اور اس میں مبالغہ کے لیے لایا گیا ہے۔ گویا یہ بات کہ’’ اللہ تعالیٰ جیسی کوئی چیز نہیں‘‘ دو دفعہ کہی گئی ہے، ایک ’’کاف‘‘ کے ساتھ اور ایک {’’مِثْلٌ‘‘} کے ساتھ، مگر مثلیث کے معنی میں یہ مبالغہ محلِ نظر ہے۔ ¤ دوسرا حل یہ ہے کہ عرب کلام میں زور پیدا کرنے کے لیے {’’مِثْلٌ‘‘} کا لفظ کسی جیسے کے لیے نہیں بلکہ اس کی ذات اور شخصیت کے لیے استعمال کرتے ہیں، مثلاً {’’مِثْلِيْ لَا يَكْذِبُ‘‘} سے مراد یہ نہیں کہ میرے جیسا شخص جھوٹ نہیں بولتا، بلکہ یہ ہے کہ ’’میں جھوٹ نہیں بولتا۔‘‘ اسی طرح {’’مِثْلُهُ لَا يُعْبَؤُ بِهٖ‘‘} کا معنی یہ نہیں کہ اس جیسے شخص کی پروا نہیں کی جاتی، بلکہ مراد یہ ہے کہ’’ اس کی کوئی پروا نہیں کی جاتی۔‘‘ اسی طرح {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کا معنی یہ نہیں کہ اللہ تعالیٰ کی مثل جیسی کوئی چیز نہیں، بلکہ یہ ہے کہ ’’اللہ تعالیٰ کی ذات جیسی کوئی چیز نہیں۔‘‘ یہاں ’’کاف‘‘ کا اضافہ اس لیے کیا گیا ہے کہ اگر ’’کاف‘‘ نہ لایا جاتا تو عرب محاورہ ذہن میں آنے سے خیال ایک غلط مفہوم کی طرف جا سکتا تھا، جیسے {’’مِثْلُهُ لَا يُعْبَؤُ بِهٖ‘‘} کا معنی ہے کہ فلاں شخص کی کوئی پروا نہیں کی جاتی۔ اسی طرح ’’کاف‘‘ کے بغیر {’’لَيْسَ مِثْلَهُ شَيْءٌ‘‘} کا معنی یہ ہو سکتا تھا کہ (معاذ اللہ) اس کی ذات کوئی شے نہیں، یااس کی کچھ حیثیت نہیں۔ اب {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کہنے سے یہ اندیشہ دور ہو گیا اور بات صاف ہو گئی کہ اس کی ذات جیسی کوئی چیز نہیں۔ طبری، بقاعی، ابن ہشام اور بہت سے ائمہ نے یہاں {’’مِثْلٌ‘‘} کو شخص، ذات یا نفس کا ہم معنی قرار دے کر اس کے شواہد پیش فرمائے ہیں۔ یہ حل معنوی طور پر بہت مضبوط ہے۔ ¤ تیسرا حل یہ ہے کہ قرآن مجید میں متعدد مقامات پر {’’ مَثَلُ ‘‘} کا لفظ صفتِ شان کے معنی میں آیا ہے، جیسے یہ آیت : « مَثَلُ الْجَنَّةِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَ فِيْهَاۤ اَنْهٰرٌ مِّنْ مَّآءٍ غَيْرِ اٰسِنٍ» [ محمد : ۱۵ ] ’’اس جنت کی صفت جس کا متقی لوگوں سے وعدہ کیا گیا ہے، یہ ہے کہ اس میں کئی نہریں ایسے پانی کی ہیں جو بگڑنے والا نہیں۔‘‘ اسی طرح یہ آیت : « وَ لَهُ الْمَثَلُ الْاَعْلٰى فِي السَّمٰوٰتِ وَ الْاَرْضِ» [ الروم : ۲۷ ] ’’اور آسمانوں اور زمین میں سب سے اونچی صفت (شان) اسی کی ہے۔‘‘ اس لیے {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کا معنی یہ ہے کہ ’’اللہ کی صفت جیسی کوئی چیز نہیں۔‘‘ یہ حل سمجھنے میں سب سے آسان ہے، معنوی طور پر بالکل درست ہے اور ائمۂ تفسیر سے منقول ہے۔ سیاق کے لحاظ سے بھی بہت مناسب ہے، کیونکہ اس سے پہلے اللہ تعالیٰ کی بہت سی صفات بیان فرمائی گئی ہیں، پھر فرمایا کہ اس کی صفت جیسی کوئی چیز نہیں۔ ¤ ➐ {وَ هُوَ السَّمِيْعُ الْبَصِيْرُ: ’’ السَّمِيْعُ الْبَصِيْرُ ‘‘ ’’ هُوَ ‘‘} مبتدا کی خبر ہے۔ خبر پر الف لام لانے سے قصر کا مفہوم پیدا ہو گیا، اس لیے ترجمہ کیا گیا ہے ’’اور وہی سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔‘‘ یہ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} (اس کی ذات و صفات جیسی کوئی چیز نہیں) سے پیدا ہونے والے ایک سوال کا جواب ہے کہ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کے باوجود یہ کیا بات ہے کہ اللہ تعالیٰ سمیع و بصیر ہے اور انسان بھی سمیع و بصیر ہے، جیسا کہ فرمایا : «فَجَعَلْنٰهُ سَمِيْعًۢا بَصِيْرًا» [ الدھر : ۲] ’’سو ہم نے اسے خوب سننے والا، خوب دیکھنے والا بنا دیا۔‘‘ بلکہ سمع و بصر انسان کے علاوہ جانوروں میں بھی موجود ہیں اور حنانہ کے واقعہ سے معلوم ہوتا ہے کہ جمادات بھی سمع و بصر سے بے بہرہ نہیں ہیں، تو اللہ تعالیٰ بے مثل کیسے ہوا؟ اس کے جواب میں اللہ تعالیٰ نے فرمایا، کامل اور اصل سمیع و بصیر صرف اللہ تعالیٰ ہے، کسی اور میں پائی جانے والی یہ صفات اللہ تعالیٰ کی صفات سے کچھ مشابہت نہیں رکھتیں اور نہ ان کے مقابلے میں کوئی حقیقت رکھتی ہیں۔ ¤ اللہ تعالیٰ کی صفات کے متعلق بہت سے لوگوں کو ایسے اشکالات پیدا ہوئے کہ بے شمار مخلوق گمراہ ہو گئی، انھوں نے دیکھا کہ وہی الفاظ اللہ تعالیٰ کے متعلق آ رہے ہیں اور وہی مخلوق کے متعلق، مثلاً اللہ تعالیٰ کے متعلق آیا ہے : « ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ» [ الأعراف : ۵۴ ] (پھر وہ عرش پر بلند ہوا) اور مخلوق کے متعلق الفاظ ہیں : « لِتَسْتَوٗا عَلٰى ظُهُوْرِهٖ » [ الزخرف : ۱۳ ] ( تاکہ تم ان کی پیٹھوں پر جم کر بیٹھو) اور یہ الفاظ : « فَاِذَا اسْتَوَيْتَ اَنْتَ وَ مَنْ مَّعَكَ عَلَى الْفُلْكِ » [ المؤمنون : ۲۸ ] (پھر جب تو اور جو تیرے ساتھ ہیں، کشتی پر چڑھ جاؤ)۔ اللہ تعالیٰ کے فرمان : « يَدُ اللّٰهِ فَوْقَ اَيْدِيْهِمْ » [ الفتح : ۱۰ ] (اللہ کا ہاتھ ان کے ہاتھوں کے اوپر ہے) میں لفظ ’’ید‘‘ اللہ تعالیٰ اور بندوں دونوں کے لیے آیا ہے، یہی حال سمیع و بصیر کا ہے۔ اب کچھ لوگ اس وجہ سے گمراہ ہو گئے کہ انھوں نے اللہ تعالیٰ کی صفات کو مخلوق کی صفات کے مشابہ قرار دیا۔ اس کے استواء، اس کے ید، اس کے سمع و بصر اور اس کی دوسری صفات کو مخلوق کے استواء، اس کے ید، اس کے سمع و بصر اور اس کی دوسری صفات کی طرح سمجھ بیٹھے، ان لوگوں کو {’’مشبهه‘‘} کہتے ہیں اور کچھ اس وجہ سے گمراہ ہو گئے کہ انھوں نے یہ کہہ کر کہ اللہ کی مثل کوئی چیز نہیں، اس کی اُن صفات کا بھی انکار کر دیا جو اس نے خود اپنی بیان فرمائی ہیں۔ انھوں نے کہا، اللہ تعالیٰ نہ عرش پر مستوی ہے، نہ اس کا ہاتھ ہے، نہ اس کا سمع و بصر ہے، نہ وہ کلام کرتا ہے، کیونکہ اگر ہم اس کے لیے یہ چیزیں تسلیم کریں تو وہ مخلوق جیسا ٹھہرتا ہے۔ ان منکرینِ صفات کو {’’معطّله‘‘} کہتے ہیں۔ حقیقت یہ ہے کہ اللہ تعالیٰ تشبیہ و تعطیل دونوں سے بلند و برتر ہے۔ ¤ اللہ تبارک و تعالیٰ نے اپنی صفات کا مسئلہ انتہائی وضاحت کے ساتھ بیان فرما دیا ہے، اس میں کوئی پیچیدگی یا اشکال باقی نہیں رہنے دیا۔ خلاصہ اس کا یہ ہے کہ اللہ تعالیٰ نے بیان فرمایا کہ آیاتِ صفات میں حق دو چیزوں سے مرکب ہے، ایک یہ کہ اللہ تعالیٰ کو مخلوق کی صفات کی مشابہت سے پاک سمجھا جائے۔ دوسری یہ کہ اللہ تعالیٰ نے اپنی کتاب میں اپنی جو بھی صفت بیان فرمائی ہے، یا اس کے رسول صلی اللہ علیہ وسلم نے اس کی جو بھی صفت بیان فرمائی ہے اس پر مکمل ایمان رکھا جائے، کیونکہ اللہ تعالیٰ کی صفت اس سے بڑھ کر کوئی نہیں جانتا، جیسا کہ فرمایا : « قُلْ ءَاَنْتُمْ اَعْلَمُ اَمِ اللّٰهُ » [ البقرۃ : ۱۴۰ ] ’’کیا تم زیادہ جاننے والے ہو یا اللہ؟‘‘ اور اللہ تعالیٰ کے بعد رسول اللہ صلی اللہ علیہ وسلم سے زیادہ اللہ تعالیٰ کی صفات کا علم رکھنے والا کوئی نہیں۔ آپ صلی اللہ علیہ وسلم کے متعلق خود اللہ تعالیٰ نے فرماایا : « وَ مَا يَنْطِقُ عَنِ الْهَوٰى (3) اِنْ هُوَ اِلَّا وَحْيٌ يُّوْحٰى » [ النجم : 4،3 ] ’’ اور نہ وہ اپنی خواہش سے بولتا ہے۔ وہ تو صرف وحی ہے جو نازل کی جاتی ہے۔‘‘ اب جو شخص کسی ایسی صفت کی نفی کرے جو خود اللہ تعالیٰ نے اپنی کتاب میں اپنے لیے بیان فرمائی ہے، یا اس کے رسول صلی اللہ علیہ وسلم نے بیان فرمائی ہے، یہ کہہ کر کہ یہ صفت اللہ تعالیٰ کے لائق نہیں، تو وہ اپنے آپ کو اللہ اور اس کے رسول سے بھی زیادہ علم رکھنے والا سمجھتا ہے کہ اللہ کی شان کے لائق کون سی بات ہے اور کون سی نہیں۔ اور جو شخص یہ سمجھتا ہے کہ اللہ تعالیٰ کی صفات مخلوق کی صفات کے مشابہ ہیں وہ بھی ملحد اور گمراہ ہے، کیونکہ اللہ تعالیٰ نے فرمایا، اس کی مثل کوئی چیز نہیں اور یہ اللہ کی صفات کو مخلوق کی صفات کے مشابہ سمجھتا ہے۔ ہاں، جو شخص اللہ تعالیٰ کے لیے ان تمام صفات کو مانتا ہے جو اللہ تعالیٰ نے خود اپنے لیے بیان کی ہیں، یا اس کے رسول نے اس کے لیے بیان کی ہیں اور ساتھ ہی اللہ عز و جل اور اس کی صفات کو مخلوق کی مشابہت سے پاک قرار دیتا ہے، یہ صحیح مومن ہے جو اللہ تعالیٰ کی صفاتِ کمال پر بھی ایمان رکھتا ہے اور اس کی مخلوق کی مشابہت سے پاک ہونے پر بھی ایمان رکھتا ہے۔ زیرِ تفسیر آیت : « لَيْسَ كَمِثْلِهٖ شَيْءٌ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ » نے اس حقیقت کو خوب واضح فرما دیا ہے کہ اللہ تعالیٰ سمع و بصر کی صفات بھی رکھتا ہے اور کوئی چیز اس کی مثل اور مشابہ بھی نہیں۔ ¤ اللہ تعالیٰ نے اس آیت میں {’’ وَهُوَ الْعَلِيُّ الْعَظِيْمُ ‘‘} کے بجائے {’’ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ ‘‘} اس لیے فرمایا کہ سمع و بصر کی دونوں صفات تمام حیوانات میں بھی پائی جاتی ہیں، تو اللہ تعالیٰ نے بیان فرمایا کہ اللہ تعالیٰ یہ دونوں صفات رکھتا ہے، لیکن اس کی ان صفات کی بنیاد اس بات پر ہے کہ اللہ تعالیٰ کی صفات اور مخلوق کی صفات میں کوئی مماثلت نہیں، اس لیے {’’ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ ‘‘} کا لفظ {’’ لَيْسَ كَمِثْلِهٖ شَيْءٌ ‘‘} کہنے کے بعد ارشاد فرمایا۔ جن لوگوں نے اللہ تعالیٰ کی صفات کا اس لیے انکار کیا ہے کہ صفات کے لیے وہی الفاظ مخلوق پر بھی آئے ہیں، انھیں لازم ہے کہ وہ اللہ تعالیٰ کی ذات، اس کے وجود اور اس کی حیات کا بھی انکار کر دیں، کیونکہ مخلوق کی بھی ذات ہے، وہ بھی وجود رکھتی ہے اور اس میں بھی حیات پائی جاتی ہے، مگر جس طرح خالق اور مخلوق میں کوئی مماثلت نہیں اور دونوں کی ذات، وجود اور حیات میں کوئی مماثلت نہیں، اسی طرح خالق و مخلوق کی کسی صفت میں بھی کوئی مماثلت نہیں۔ اللہ تعالیٰ کی صفات کامل اور حقیقی ہیں۔ مخلوق کی صفات اگرچہ ان کے حسبِ حال موجود ہیں مگر اللہ تعالیٰ کی صفات کے مقابلے میں کالعدم ہیں، جیسا کہ فرمایا : « وَ هُوَ السَّمِيْعُ الْبَصِيْرُ» وہی سمیع و بصیر ہے اور کوئی نہیں، حالانکہ اللہ تعالیٰ نے خود ہی انسان کو سمیع و بصیر بتایا ہے۔ ¤ اس کی تھوڑی سی تفصیل سنیے، متکلمین اللہ تعالیٰ کی بے شمار صفات میں سے سات صفات کو صفاتِ معانی کہتے ہیں، وہ ہیں حیات، قدرت، ارادہ، علم، سمع، بصر اور کلام۔ اللہ تعالیٰ نے اپنی صفتِ حیات خود بیان فرمائی، فرمایا : « هُوَ الْحَيُّ لَاۤ اِلٰهَ اِلَّا هُوَ» [المؤمن : ۶۵ ] ’’وہی زندہ ہے، اس کے سوا کوئی معبود نہیں۔‘‘ اور فرمایا : « وَ تَوَكَّلْ عَلَى الْحَيِّ الَّذِيْ لَا يَمُوْتُ»  [الفرقان : ۵۸ ] ’’اور اس زندہ پر بھروسا کر جو نہیں مرے گا۔‘‘ اور دوسری بہت سی آیات۔ مخلوق کی صفت بھی حیات بیان فرمائی، فرمایا : « وَ سَلٰمٌ عَلَيْهِ يَوْمَ وُلِدَ وَ يَوْمَ يَمُوْتُ وَ يَوْمَ يُبْعَثُ حَيًّا» [ مریم : ۱۵ ] ’’اور سلام اس پر جس دن وہ پیدا ہوا اور جس دن فوت ہوگا اور جس دن زندہ ہو کر اٹھایا جائے گا۔ ‘‘ اور فرمایا : « وَ جَعَلْنَا مِنَ الْمَآءِ كُلَّ شَيْءٍ حَيٍّ» [ الأنبیاء : ۳۰ ] ’’اور ہم نے پانی سے ہر زندہ چیز بنائی۔‘‘ اور فرمایا : « يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَ يُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ» [ الروم : ۱۹ ] ’’وہ زندہ کو مردہ سے نکالتا ہے اور مردہ کو زندہ سے نکالتا ہے۔‘‘ یہاں دیکھیے {’’ هُوَ الْحَيِّ ‘‘} (صرف وہ زندہ ہے) کہنے کے باوجود مخلوق کی حیات کا بھی ذکر فرمایا۔ اس کی وجہ یہ ہے کہ حقیقی اور کامل حیات صرف اللہ تعالیٰ کی صفت ہے، مخلوق کو بھی اس کے حسبِ حال ایک طرح کی حیات حاصل ہے، مگر خالق و مخلوق کی حیات میں اتنی ہی منافات ہے جتنی دونوں کی ذات میں ہے، خالق والی حیات کا ایک شمّہ بھی مخلوق کو حاصل نہیں۔ ¤ دوسری صفت قدرت ہے۔ اللہ تعالیٰ نے اپنی یہ صفت خود بیان فرمائی ہے، فرمایا : « وَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ » [البقرۃ : ۲۸۴ ] ’’اور اللہ ہر چیز پر پوری طرح قادر ہے۔ ‘‘ مخلوق کے متعلق بھی یہ لفظ استعمال فرمایا : « اِلَّا الَّذِيْنَ تَابُوْا مِنْ قَبْلِ اَنْ تَقْدِرُوْا عَلَيْهِمْ » [ المائدۃ : ۳۴ ] ’’مگر جو لوگ اس سے پہلے توبہ کر لیں کہ تم ان پر قابو پاؤ۔ ‘‘ اللہ تعالیٰ کی قدرت حقیقی، کامل اور اس کی شان کے لائق ہے، جبکہ مخلوق کی قدرت صرف اس کے حسبِ حال ہے۔ اللہ تعالیٰ کی قدرت اور مخلوق کی قدرت میں اتنی منافات ہے جتنی دونوں کی ذات میں ہے۔ ¤ تیسری صفت ارادہ ہے، اللہ تعالیٰ نے اپنے متعلق فرمایا : « فَعَّالٌ لِّمَا يُرِيْدُ » [ ھود : ۱۰۷ ] ’’کر گزرنے والا ہے جو چاہتا ہے۔ ‘‘ اور فرمایا : « اِنَّمَااَمْرُهٗۤ اِذَاۤ اَرَادَ شَيْـًٔا اَنْ يَّقُوْلَ لَهٗ كُنْ فَيَكُوْنُ » [ یٰسٓ : ۸۲ ] ’’اس کا حکم تو، جب وہ کسی چیز کا ارادہ کرتا ہے، اس کے سوا نہیں ہوتا کہ اسے کہتا ہے ’’ہو جا‘‘ تو وہ ہو جاتی ہے۔‘‘ اور فرمایا : « يُرِيْدُ اللّٰهُ بِكُمُ الْيُسْرَ وَ لَا يُرِيْدُ بِكُمُ الْعُسْرَ » [البقرۃ : ۱۸۵ ] ’’اللہ تمھارے ساتھ آسانی کا ارادہ رکھتا ہے اورتمھارے ساتھ تنگی کا ارادہ نہیں رکھتا۔‘‘ اور دوسری آیات۔ مخلوق کے ارادے کا بھی ذکر کیا، فرمایا : «تُرِيْدُوْنَ عَرَضَ الدُّنْيَا » [ الأنفال : ۶۷ ] ’’تم دنیا کا سامان چاہتے ہو۔‘‘ اور فرمایا : «اِنْ يُّرِيْدُوْنَ اِلَّا فِرَارًا » [ الاحزاب : ۱۳ ] ’’وہ بھاگنے کے سوا کچھ چاہتے ہی نہیں۔ ‘‘ اور فرمایا : « يُرِيْدُوْنَ لِيُطْفِـُٔوْا نُوْرَ اللّٰهِ» [ الصف : ۸ ] ’’وہ چاہتے ہیں کہ اللہ کے نور کو بجھا دیں۔ ‘‘ اور دوسری آیات۔ یہاں اللہ تعالیٰ کا ارادہ حقیقی، کامل اور اس کی ذات کے لائق ہے، جبکہ مخلوق کا ارادہ اس کے حسبِ حال ہے۔ دونوں کے ارادوں میں اتنا ہی فرق ہے جتنا دونوں کی ذات میں ہے۔ ¤ چوتھی صفت علم ہے، اللہ تعالیٰ نے اپنے متعلق فرمایا : « وَ اللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ» [ البقرۃ : ۲۸۲ ] ’’اور اللہ ہر چیز کو خوب جاننے والاہے۔‘‘ اور فرمایا : « لٰكِنِ اللّٰهُ يَشْهَدُ بِمَاۤ اَنْزَلَ اِلَيْكَ اَنْزَلَهٗ بِعِللْمِهٖ » [ النساء : ۱۶۶ ] ’’لیکن اللہ شہادت دیتا ہے اس کے متعلق جو اس نے تیری طرف نازل کیا ہے کہ اس نے اسے اپنے علم سے نازل کیا ہے۔‘‘ اور مخلوق کے متعلق فرمایا : « وَ اِنَّهٗ لَذُوْ عِلْمٍ لِّمَا عَلَّمْنٰهُ» [ یوسف : ۶۸ ] ’’اور بلاشبہ وہ یقینا بڑے علم والا تھا، اس وجہ سے کہ ہم نے اسے سکھایا تھا۔‘‘ اور اس جیسی آیات۔ تو اللہ تعالیٰ کا علم کامل، حقیقی اور اس کے کمال و جلال کے لائق ہے، جب کہ مخلوق کا علم اس کے حال کے مناسب ہے۔ خالق و مخلوق کے علم میں اتنی ہی منافات ہے جتنی خالق و مخلوق کی ذات میں ہے۔ ¤ پانچویں اور چھٹی صفت سمع و بصر ہے۔ اللہ تعالیٰ نے اپنے متعلق فرمایا : «لَيْسَ كَمِثْلِهٖ شَيْءٌ وَ هُوَ السَّمِيْعُ الْبَصِيْرُ » [ الشورٰی : ۱۱ ] ’’اس کی مثل کوئی چیز نہیں اور وہی سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔‘‘ اور فرمایا : « وَ اَنَّ اللّٰهَ سَمِيْعٌۢ بَصِيْرٌ » [ الحج : ۶۱ ]’’اور اللہ سب کچھ سننے والا، سب کچھ دیکھنے والا ہے۔ ‘‘ اور مخلوق کے متعلق فرمایا : « اِنَّا خَلَقْنَا الْاِنْسَانَ مِنْ نُّطْفَةٍ اَمْشَاجٍ نَّبْتَلِيْهِ فَجَعَلْنٰهُ سَمِيْعًۢا بَصِيْرًا» [ الدھر : ۲ ] ’’بلاشبہ ہم نے انسان کو ایک ملے جلے قطرے سے پیدا کیا، ہم اسے آزماتے ہیں، سو ہم نے اسے خوب سننے والا، خوب دیکھنے والا بنا دیا۔‘‘ اور فرمایا : « اَسْمِعْ بِهِمْ وَ اَبْصِرْ يَوْمَ يَاْتُوْنَنَا » [ مریم : ۳۸ ] ’’کس قدر سننے والے ہوں گے وہ اور کس قدر دیکھنے والے، جس دن وہ ہمارے پاس آئیں گے۔‘‘ اور اس جیسی آیات۔ تو اللہ عز و جل کے سمع و بصر حقیقی، کامل اور اس کی شان کے لائق ہیں اور مخلوق کے سمع و بصر ان کے حال کے مناسب ہیں۔ جس طرح خالق و مخلوق کی ذات میں کوئی مماثلت نہیں، ان کے سمع و بصر میں بھی کوئی مماثلت نہیں۔ ¤ ساتویں صفت کلام ہے، اللہ تعالیٰ نے اپنے متعلق فرمایا : « وَ كَلَّمَ اللّٰهُ مُوْسٰى تَكْلِيْمًا» [ النساء : ۱۶۴ ] ’’اور اللہ نے موسیٰ سے کلام کیا، خود کلام کرنا۔ ‘‘ اور فرمایا : «اِنِّي اصْطَفَيْتُكَ عَلَى النَّاسِ بِرِسٰلٰتِيْ وَ بِكَلَامِيْ » [الأعراف : ۱۴۴ ] ’’بے شک میں نے تجھے اپنے پیغامات اور اپنے کلام کے ساتھ لوگوں پر چن لیا ہے۔‘‘ اور فرمایا : « فَاَجِرْهُ حَتّٰى يَسْمَعَ كَلٰمَ اللّٰهِ» [ التوبۃ : ۶ ] ’’تو اسے پناہ دے دے، یہاں تک کہ وہ اللہ کا کلام سنے۔‘‘ اور مخلوق کے متعلق فرمایا : « فَلَمَّا كَلَّمَهٗ قَالَ اِنَّكَ الْيَوْمَ لَدَيْنَا مَكِيْنٌ اَمِيْنٌ » [یوسف : ۵۴ ] ’’پھر جب اس نے اس سے بات کی تو کہا بلاشبہ تو آج ہمارے ہاں صاحبِ اقتدار، امانت دار ہے۔ ‘‘ اور فرمایا : «اَلْيَوْمَ نَخْتِمُ عَلٰۤى اَفْوَاهِهِمْ وَ تُكَلِّمُنَاۤ اَيْدِيْهِمْ» [ یٰسٓ : ۶۵ ] ’’آج ہم ان کے مونہوں پر مہر لگا دیں گے اور ان کے ہاتھ ہم سے باتیں کریں گے۔‘‘ اور فرمایا : «قَالُوْا كَيْفَ نُكَلِّمُ مَنْ كَانَ فِي الْمَهْدِ صَبِيًّا » [ مریم : ۲۹ ] ’’انھوں نے کہا ہم اس سے کیسے بات کریں جو ابھی تک گود میں بچہ ہے۔ ‘‘ تو اللہ تعالیٰ کا کلام حقیقی، کامل اور اس کی شان کے لائق ہے اور مخلوق کی صفت بھی کلام ہے جو اس کے حسبِ حال ہے اور خالق و مخلوق کے کلام میں اتنی ہی منافات ہے جتنی ان دونوں کی ذات میں ہے۔ اہلِ علم یہ بحث تفصیل سے پڑھنا چاہیں تو مفسر شنقیطی کی{’’ أَضْوَاءُ الْبَيَانِ ‘‘} میں سورہ اعراف کی آیت (۵۴) : « ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ» کی تفسیر ملاحظہ فرمائیں۔ ¤ تعجب ہوتا ہے کہ اتنی واضح بات بڑے بڑے مفسر اور مصنف نہیں سمجھ سکے۔ وہ جہاں {’’استوى على الْعرش‘‘} کا لفظ آئے گا اس کا انکار کرتے ہوئے کہیں گے اس سے مراد حکومت کرنا ہے، سمع و بصر آئے گا تو کہیں گے اس سے مراد علم ہے۔ اسی طرح اللہ تعالیٰ کی محبت، رضا، غضب، انتقام، اس کے نزول اور دوسری صفات کا مطلب کچھ اور ہی بیان کرتے ہوئے اصل صفات کا انکار کر دیں گے۔ حقیقت یہ ہے کہ ہدایت محض اللہ تعالیٰ کی عطا ہے، وہ جسے چاہتا ہے عطا کرتا ہے۔ سلف صالحین اور محدثین ہی اس مقام پر سلامت رہے ہیں، ان کی ترجمانی امام مالک رحمہ اللہ نے فرمائی، جب ان سے اللہ تعالیٰ کے عرش پر استواء کے متعلق پوچھا گیا تو انھوں نے فرمایا : {’’ اَلْإِسْتِوَاءُ مَعْلُوْمٌ وَالْكَيْفُ مَجْهُوْلٌ وَالسُّؤَالُ عَنْهُ  بِدْعَةٌ ‘‘} ’’اللہ تعالیٰ کا عرش پر مستوی ہونا معلوم ہے اور یہ بات کہ کیسے مستوی ہے، کسی کو معلوم نہیں اور یہ پوچھنا کہ کیسے مستوی ہے بدعت ہے۔‘‘ بالکل اسی طرح ہمارا ایمان ہے کہ اللہ تعالیٰ سمیع ہے، بصیر ہے، اس کے ہاتھ ہیں، آنکھیں ہیں، چہرہ ہے، وہ محبت کرتا ہے، ناراض ہوتا ہے، کلام کرتا ہے، ہنستا ہے، اترتا ہے اور قیامت کے دن زمین پر آئے گا، مگر ہمیں ان صفات کی کیفیت معلوم نہیں، نہ ہم عاجز مخلوق اس بے نہایت خالق کی ذات یا صفات کی حقیقت یا کیفیت کو سمجھ سکتے ہیں۔ ہم اس کی ان تمام صفات کو انھی الفاظ و معانی میں مانتے ہیں جو خود اس نے یا اس کے نبی مکرم صلی اللہ علیہ وسلم نے بیان فرمائی ہیں اور ان تمام لوگوں کی باتوں سے بری ہونے کا اعلان کرتے ہیں جو کہتے ہیں کہ اللہ تعالیٰ کی یہ صفات نہیں ہیں، یا کہتے ہیں کہ مخلوق جیسی ہیں، یا کہتے ہیں کہ ہمیں ان صفات کے معنی ہی کا علم نہیں۔ اللہ تعالیٰ ہمیں حق پر استقامت عطا فرمائے۔ (آمین)"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { لَهٗ مَقَالِيْدُ السَّمٰوٰتِ وَ الْاَرْضِ :} اس کی تفسیر کے لیے دیکھیے سورۂ زمر (۶۳)۔ ¤ ➋ { يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَآءُ وَ يَقْدِرُ:} اس کی تفسیر کے لیے دیکھیے سورۂ عنکبوت (۶۲)۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ { شَرَعَ لَكُمْ مِّنَ الدِّيْنِ مَا وَصّٰى بِهٖ نُوْحًا:} سورت کے شروع میں جو بات فرمائی : « كَذٰلِكَ يُوْحِيْۤ اِلَيْكَ وَ اِلَى الَّذِيْنَ مِنْ قَبْلِكَ اللّٰهُ الْعَزِيْزُ الْحَكِيْمُ » (اسی طرح وحی کرتا ہے تیری طرف اور ان لوگوں کی طرف جو تجھ سے پہلے تھے، وہ اللہ جو سب پر غالب، کمال حکمت والا ہے) یہاں سے وہی بات مزید تفصیل کے ساتھ بیان ہو رہی ہے۔ {’’ لَكُمْ ‘‘} سے خطاب ہماری امت کو ہے، یعنی اللہ تعالیٰ نے تمھارے لیے کوئی اجنبی یا انوکھا دین مقرر نہیں فرمایا، یہ وہی دین ہے جو اس نے پہلے اور پچھلے تمام انبیاء کے لیے مقرر فرمایا ہے۔ اس سے معلوم ہوا کہ تمام انبیاء کا دین ایک ہے اور وہ ہے اسلام، جیسا کہ فرمایا : « اِنَّ الدِّيْنَ عِنْدَ اللّٰهِ الْاِسْلَامُ » [ آل عمران : ۱۹ ] ’’بے شک دین اللہ کے نزدیک اسلام ہی ہے۔‘‘ جس کا معنی مکمل طور پر اللہ تعالیٰ کے تابع فرمان ہو جانا ہے۔ اس دین کا عنوان {’’لَا إِلٰهَ إِلاَّ اللّٰهُ‘‘} یعنی اللہ واحد کی عبادت و اطاعت ہے۔ تمام انبیاء و رسل کی طرف اسی ایک دین کی وحی کی گئی ہے، فرمایا : « وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ»  [ الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔‘‘ سورۂ انعام میں توحید کی تاکید اور شرک کا رد کرنے کے بعد نوح اور ابراہیم علیھما السلام سمیت اٹھارہ پیغمبروں کا ذکر ان کا نام لے کر فرمایا، پھر ان کے آباء، اولاد اور بھائیوں کا ذکر کرکے فرمایا کہ اگر یہ لوگ شرک کرتے تو ان کا وہ سب کچھ ضائع ہو جاتا جو وہ کرتے رہے تھے۔ اس کے بعد آپ صلی اللہ علیہ وسلم کو ان کے طریقے پر چلنے کا حکم دیا اور فرمایا : « اُولٰٓىِٕكَ الَّذِيْنَ هَدَى اللّٰهُ فَبِهُدٰىهُمُ اقْتَدِهْ » [الأنعام : ۹۰ ] ’’یہی وہ لوگ ہیں جنھیں اللہ نے ہدایت دی، سو تو ان کی ہدایت کی پیروی کر۔‘‘ ¤ ➋ دین کن چیزوں کا نام ہے؟ اللہ تعالیٰ نے فرمایا : « وَ مَاۤ اُمِرُوْۤا اِلَّا لِيَعْبُدُوا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ حُنَفَآءَ وَ يُقِيْمُوا الصَّلٰوةَ وَ يُؤْتُوا الزَّكٰوةَ وَ ذٰلِكَ دِيْنُ الْقَيِّمَةِ » [ البینۃ : ۵ ] ’’اور انھیں اس کے سوا حکم نہیں دیا گیا کہ وہ اللہ کی عبادت کریں، اس حال میں کہ اس کے لیے دین کو خالص کرنے والے، ایک طرف ہونے والے ہوں اور نماز قائم کریں اور زکوٰۃ دیں اور یہی مضبوط ملت کا دین ہے۔‘‘ اس سے معلوم ہوا کہ اخلاص کے ساتھ اللہ واحد کی عبادت کرنا، نماز قائم کرنا اور زکوٰۃ دینا دین ہے، جس کا پہلی امتوں کو بھی حکم تھا۔ صحیح بخاری اور صحیح مسلم میں مروی مشہور حدیثِ جبریل میں رسول اللہ صلی اللہ علیہ وسلم نے اسلام، ایمان اور احسان کی تفصیل فرمائی، پھر قیامت اور اس کی چند علامات کا ذکر فرمایا، جب جبریل علیہ السلام چلے گئے تو آپ صلی اللہ علیہ وسلم نے ے فرمایا : [ فَإِنَّهُ جِبْرِيْلُ أَتَاكُمْ يُعَلِّمُكُمْ دِيْنَكُمْ ] [ مسلم، الإیمان، باب بیان الإیمان و الإسلام… : ۸۔ بخاري : ۵۰ ] ’’وہ جبریل( علیہ السلام ) تھے، تمھارے پاس آئے تھے، تمھیں تمھارا دین سکھا رہے تھے۔‘‘ اس سے معلوم ہوا کہ اسلام کے پانچوں ارکانن دین ہیں، اللہ تعالیٰ، اس کے فرشتوں، اس کے رسولوں، اس کی کتابوں، یوم آخرت اور تقدیر پر ایمان دین ہے، عمل میں اخلاص اور احسان دین ہے، قیامت کے معاملات کی فکر دین ہے۔ پھر جب ایمان دین ہے تو ایمان میں شامل وہ تمام چیزیں بھی دین ہیں جنھیں قرآن مجید یا حدیث میں ایمان یا ایمان کی شاخ قرار دیا گیا ہے۔ امام بخاری رحمہ اللہ نے {’’بَابُ أُمُوْرِ الْإِيْمَانِ‘‘} میں قرآن مجید کی دو آیات نقل فرمائی ہیں، ایک سورۂ بقرہ کی آیت : « لَيْسَ الْبِرَّ اَنْ تُوَلُّوْا وُجُوْهَكُمْ قِبَلَ الْمَشْرِقِ وَ الْمَغْرِبِ وَ لٰكِنَّ الْبِرَّ مَنْ اٰمَنَ بِاللّٰهِ وَ الْيَوْمِ الْاٰخِرِ وَ الْمَلٰٓىِٕكَةِ وَ الْكِتٰبِ وَ النَّبِيّٖنَ وَ اٰتتَى الْمَالَ عَلٰى حُبِّهٖ ذَوِي الْقُرْبٰى وَ الْيَتٰمٰى وَ الْمَسٰكِيْنَ وَ ابْنَ السَّبِيْلِ وَ السَّآىِٕلِيْنَ وَ فِي الرِّقَابِ وَ اَقَامَ الصَّلٰوةَ وَ اٰتَى الزَّكٰوةَ وَ الْمُوْفُوْنَ بِعَههْدِهِمْ اِذَا عٰهَدُوْا وَ الصّٰبِرِيْنَ فِي الْبَاْسَآءِ وَ الضَّرَّآءِ وَ حِيْنَ الْبَاْسِ اُولٰٓىِٕكَ الَّذِيْنَ صَدَقُوْا وَ اُولٰٓىِٕكَ هُمُ الْمُتَّقُوْنَ» [ البقرۃ : ۱۷۷ ] ’’نیکی یہ نہیں کہ تم اپنے منہ مشرق اور مغرب کی طرف پھیرو اور لیکن اصل نیکی اس کی ہے جو اللہ اور یوم آخرت اور فرشتوں اور کتاب اور نبیوں پر ایمان لائے اور مال دے اس کی محبت کے باوجود قرابت والوں اور یتیموں اور مسکینوں اور مسافر اور مانگنے والوں کو اور گردنیں چھڑانے میں۔ اور نماز قائم کرے اور زکوٰۃ دے اور جو اپنا عہد پورا کرنے والے ہیں جب عہد کریں اور خصوصاً جو تنگی اور تکلیف میں اور لڑائی کے وقت صبر کرنے والے ہیں، یہی لوگ ہیں جنھوں نے سچ کہا اور یہی بچنے والے ہیں۔ ‘‘ اور سورۂ مومنون کی ابتدائی آیات : «قَدْ اَفْلَحَ الْمُؤْمِنُوْنَ (1) الَّذِيْنَ هُمْ فِيْ صَلَاتِهِمْ خٰشِعُوْنَ (2) وَ الَّذِيْنَ هُمْ عَنِ اللَّغْوِ مُعْرِضُوْنَ (3) وَ الَّذِيْنَ هُمْ لِلزَّكٰوةِ فٰعِلُوْنَ (4) وَ الَّذِيْنَ هُمْ لِفُرُوْجِهِمْ حٰفِظُوْنَ (5) اِلَّا عَلٰۤى اَزْوَاجِهِمْ اَوْ مَا مَلَكَتْ اَيْمَانُهُمْ فَاِنَّهُمْ غَيْرُ مَلُوْمِيْنَ (6) فَمَنِ ابْتَغٰى وَرَآءَ ذٰلِكَ فَاُولٰٓىِٕكَ هُمُ الْعٰدُوْنَ (7) وَ الَّذِيْنَ هُمْ لِاَمٰنٰتِهِمْ وَ عَهْدِهِمْ رٰعُوْنَ (8) وَ الَّذِيْنَ هُمْ عَلٰى صَلَوٰتِهِمْ يُحَافِظُوْنَ (9) اُولٰٓىِٕكَ هُمُ الْوٰرِثُوْنَ (10) الَّذِيْنَ يَرِثُوْنَ الْفِرْدَوْسَ هُمْ فِيْهَا خٰلِدُوْنَ » [ المؤمنون : ۱تا۱۱ ] ’’یقینا کامیاب ہوگئے مومن۔ وہی جو اپنی نماز میں عاجزی کرنے والے ہیں۔ اور وہی جو لغو کاموں سے منہ موڑنے والے ہیں۔ اور وہی لوگ جو (ہر عمل) پاک ہونے ہی کے لیے کرنے والے ہیں۔اور وہی جو اپنی شرم گاہوں کی حفاظت کرنے والے ہیں۔ مگر اپنی بیویوں، یا ان (عورتوں) پر جن کے مالک ان کے دائیں ہاتھ بنے ہیں تو بلاشبہ وہ ملامت کیے ہوئے نہیں ہیں۔ پھر جو اس کے سوا تلاش کرے تو وہی لوگ حد سے بڑھنے والے ہیں۔ اور وہی جو اپنی امانتوں اور اپنے عہد کا لحاظ رکھنے والے ہیں۔ اور وہی جو اپنی نمازوں کی خوب حفاظت کرتے ہیں۔ یہی لوگ ہیں جو وارث ہیں۔ جو فردوس کے وارث ہوں گے، وہ اس میں ہمیشہ رہنے والے ہیں۔‘‘ اس کے بعد یہ حدیث بیان فرمائی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْإِيْمَانُ بِضْعٌ وَسِتُّوْنَ شُعْبَةً، وَالْحَيَاءُ شُعْبَةٌ مِنَ الْإِيْمَانِ ] [ بخاري، الإیمان، باب أمور الإیمان : ۹۔ مسلم : ۳۵ ] ’’ایمان کی ساٹھ(۶۰) سے کچھ زیادہ شاخیں ہیں اور حیا بھی ایمان کا جزو ہے۔‘‘ اس کے بعد مختلف ابواب میں امورِ دین کا بیان فرمایا ہے۔ ¤ خلاصہ یہ کہ تمام انبیاء کا اصل دین ایک ہے، البتہ کسی عمل کی ادائیگی کی کیفیت میں فرق ہو سکتا ہے۔ مثلاً نماز ہر امت پر فرض تھی، اس کے اوقات اور رکعات کی تعداد وغیرہ میں فرق ہو سکتا ہے۔ روزہ سب پر فرض تھا، مگر اس کی کیفیت میں اختلاف معلوم ہے۔ زکوٰۃ ہر امت پر فرض تھی، مگر اس کے نصاب اور مقدار وغیرہ میں فرق ہو سکتا ہے۔ اسی طرح مختلف اقوام اور اوقات کے لحاظ سے بعض اشیاء کی تحلیل و تحریم میں اللہ تعالیٰ کی وحی کے مطابق نسخ ہو سکتا ہے، تبدیلی ہو سکتی ہے اور ہوتی ہے۔ بعض امتوں میں کئی معاملات میں تخفیف اور بعض میں سختی ہو سکتی ہے، مگر اصل دین ایک ہے۔ یہی مطلب ہے اس حدیث کا جو اس سورت کی تیسری آیت کی تفسیر میں گزر چکی ہے : [اَلْأَنْبِيَاءُ إِخْوَةٌ لِعَلاَّتٍ ] [ بخاري : ۳۴۴۳ ] ’’انبیاء علاتی (مختلف ماؤں سے پیدا ہونے والے) بھائی ہیں۔‘‘یہاں تک کہ خاتم النّبیین صلی اللہ علیہ وسلم پر اللہ تعالیٰ نے اپنا دین مکمل فرما دیا، فرمایا : « اَلْيَوْمَ اَكْمَلْتُ لَكُمْ دِيْنَكُمْ وَ اَتْمَمْتُ عَلَيْكُمْ نِعْمَتِيْ وَ رَضِيْتُ لَكُمُ الْاِسْلَامَ دِيْنًا » [ المائدۃ : ۳ ] ’’آج میں نے تمھارے لیے تمھارا دین کامل کردیا اور تم پر اپنی نعمت پوری کر دی اور تمھارے لیے اسلام کو دین کی حیثیت سے پسند کر لیا۔‘‘ ¤ ➌ {وَ الَّذِيْۤ اَوْحَيْنَاۤ اِلَيْكَ وَ مَا وَصَّيْنَا بِهٖۤ … :} اگرچہ تمام انبیاء کا دین ایک تھا، مگر یہاں صرف پانچ پیغمبروں کا ذکر فرمایا اور ان کی ترتیب بھی ان کے زمانے کے حساب سے نہیں رکھی۔ مفسرین فرماتے ہیں تمام انبیاء کا نام لینا تو ممکن نہ تھا اور نہ ہی اس کی ضرورت تھی (دیکھیے مومن : ۷۸) اس لیے ہر مقام پر اس کے مناسب انبیاء کا ذکر فرمایا۔ یہاں پہلے دو رسولوں کا ذکر فرمایا جن میں سے نوح علیہ السلام زمین والوں کی طرف سب سے پہلے رسول تھے، جیسا کہ حدیث شفاعت میں ہے۔ [ دیکھیے بخاري : ۳۳۴۰ ] اس سے پہلے آدم علیہ السلام بے شک نبی تھے، مگر انھیں کسی امت کی طرف مبعوث نہیں کیا گیا تھا۔ سب سے پہلے رسول کے ساتھ ہی سب سے آخری نبی صلی اللہ علیہ وسلم کا ذکر کیا گیا، مطلب یہ ہے کہ اللہ تعالیٰ کا مقرر کردہ دین پہلے رسول سے آخری رسول تک ایک ہی ہے۔ اس کے بعد تین جلیل القدر رسولوں کا ذکر فرمایا، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کی تشریف آوری کے وقت آسمانی مذاہب میں سے انھی تینوں کے پیروکار ہونے کے مدعی تمام دنیا میں پائے جاتے تھے۔ عرب کے مشرکین ابراہیمی ہونے کے دعوے دار تھے، یہودی موسیٰ علیہ السلام اور نصرانی عیسیٰ علیہ السلام کے امتی کہلاتے تھے۔ ان کے علاوہ کسی پیغمبر کی طرف منسوب کوئی قابل ذکر قوم نہ تھی۔ اس لیے فرمایا کہ ان سب کا دین ایک ہے، جو محمد صلی اللہ علیہ وسلم لے کر آئے ہیں۔ سورۂ احزاب میں بھی ان پانچ انبیاء کا ذکر ایک آیت میں آیا ہے۔ دیکھیے سورۂ احزاب (۷)۔ ¤ ➍ { اَنْ اَقِيْمُوا الدِّيْنَ:} یعنی اللہ تعالیٰ نے ان تمام پیغمبروں کو حکم دیا کہ دین قائم کرو۔ دین قائم کرنے میں خود اس پر عمل کرنا بھی شامل ہے، اس کی دعوت و تبلیغ بھی اور عملاً اسے نافذ کرنا بھی۔ دعوت کے ساتھ ساتھ حسبِ استطاعت کفار سے جنگ کا بھی حکم دیا، اس وقت تک کہ وہ کلمہ پڑھیں، نماز قائم کریں اور زکوٰۃ ادا کریں۔ سورۂ توبہ میں مشرکین کے متعلق حکم دیا کہ انھیں چار ماہ تک مکہ میں آنے جانے کی اجازت ہے، فرمایا : « فَاِذَا انْسَلَخَ الْاَشْهُرُ الْحُرُمُ فَاقْتُلُوا الْمُشْرِكِيْنَ حَيْثُ وَجَدْتُّمُوْهُمْ وَ خُذُوْهُمْ وَ احْصُرُوْهُمْ وَ اقْعُدُوْا لَهُمْ كُلَّ مَرْصَدٍ فَاِنْ تَابُوْا وَ اَقَامُوا الصَّلٰوةَ وَ اٰتَوُا الزَّكٰوةَ فَخَلُّوْا سَبِيْلَهُمْ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ » [ التوبۃ : ۵ ] ’’پس جب حرمت والے مہینے نکل جائیں تو ان مشرکوں کو جہاں پاؤ قتل کرو اور انھیں پکڑو اور انھیں گھیرو اور ان کے لیے ہر گھات کی جگہ بیٹھو، پھر اگر وہ توبہ کر لیں اور نماز قائم کریں اور زکوٰۃ ادا کریں تو ان کا راستہ چھوڑ دو۔ بے شک اللہ بے حد بخشنے والا، نہایت رحم والا ہے۔‘‘ ابن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتّٰی يَشْهَدُوْا أَنْ لاَ إِلٰهَ إِلاَّ اللّٰهُ وَأأَنَّ مُحَمَّدًا رَسُوْلُ اللّٰهِ، وَ يُقِيْمُوا الصَّلاَةَ، وَ يُؤْتُوا الزَّكَاةَ ، فَإِذَا فَعَلُوْا ذٰلِكَ عَصَمُوْا مِنِّيْ دِمَاءَهُمْ وَ أَمْوَالَهُمْ إِلاَّ بِحَقِّ الْإِسْلاَمِ ، وَحِسَابُهُمْ عَلَی اللّٰهِ ] [ بخاري، الإیمان، باب : « فإن تابوا و أقاموا الصلاۃ… » : ۲۵ ] ’’مجھے حکم دیا گیا ہے کہ میں لوگوں سے لڑوں، یہاں تک کہ وہ شہادت دیں کہ اللہ کے سوا کوئی عبادت کے لائق نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں اور نماز قائم کریں اور زکوٰۃ دیں، تو جب وہ ایسا کریں تو انھوں نے مجھ سے اپنے خون اور اموال محفوظ کر لیے، مگر اسلام کے حق کے ساتھ اور ان کا حساب اللہ پر ہے۔‘‘ ¤ اہلِ کتاب میں سے جو لوگ دینِ حق قبول نہیں کرتے ان سے جزیہ وصول کرنے تک لڑتے رہنے کا حکم دیا، فرمایا : « قَاتِلُوا الَّذِيْنَ لَا يُؤْمِنُوْنَ بِاللّٰهِ وَ لَا بِالْيَوْمِ الْاٰخِرِ وَ لَا يُحَرِّممُوْنَ مَا حَرَّمَ اللّٰهُ وَ رَسُوْلُهٗ وَ لَا يَدِيْنُوْنَ دِيْنَ الْحَقِّ مِنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ حَتّٰى يُعْطُوا الْجِزْيَةَ عَنْ يَّدٍ وَّ هُمْ صٰغِرُوْنَ » [ التوبۃ : ۲۹ ] ’’لڑو ان لوگوں سے جو نہ اللہ پر ایمان رکھتے ہیں اور نہ یومِ آخر پر اور نہ ان چیزوں کو حرام سمجھتے ہیں جو اللہ اور اس کے رسول نے حرام کی ہیں اور نہ دین حق کو اختیار کرتے ہیں، ان لوگوں میں سے جنھیں کتاب دی گئی ہے، یہاں تک کہ وہ ہاتھ سے جزیہ دیں اور وہ حقیر ہوں۔ ‘‘ ظاہر ہے دین کا قیام اور اس پر پوری طرح عمل اسی وقت ہو سکتا ہے جب وہ دوسرے تمام ادیان پر غالب ہو، جیسا کہ فرمایا : « هُوَ الَّذِيْۤ اَرْسَلَ رَسُوْلَهٗ بِالْهُدٰى وَ دِيْنِ الْحَقِّ لِيُظْهِرَهٗ عَلَى الدِّييْنِ كُلِّهٖ وَ كَفٰى بِاللّٰهِ شَهِيْدًا» [ الفتح : ۲۸ ] ’’وہی ہے جس نے اپنا رسول ہدایت اور دین حق کے ساتھ بھیجا، تاکہ اسے ہر دین پر غالب کر دے اور اللہ گواہ کے طور پر کافی ہے۔ ‘‘ ¤ دین اسلام میں نماز پڑھنا اور اپنی زکوٰۃ دے دینا کافی نہیں، اللہ کی زمین پر اس کا نظام قائم کرنا بھی ضروری ہے کہ ہر شخص مسجد میں آ کر نماز پڑھے اور زکوٰۃ ادا کرے، فرمایا : «وَ لَيَنْصُرَنَّ اللّٰهُ مَنْ يَّنْصُرُهٗ اِنَّ اللّٰهَ لَقَوِيٌّ عَزِيْزٌ (40) اَلَّذِيْنَ اِنْ مَّكَّنّٰهُمْ فِي الْاَرْضِ اَقَامُوا الصَّلٰوةَ وَ اٰتَوُا الزَّككٰوةَ وَ اَمَرُوْا بِالْمَعْرُوْفِ وَ نَهَوْا عَنِ الْمُنْكَرِ وَ لِلّٰهِ عَاقِبَةُ الْاُمُوْرِ » [ الحج : ۴۰، ۴۱ ] ’’اور یقینا اللہ ضرور اس کی مدد کرے گا جو اس کی مدد کرے گا، بے شک اللہ یقینا بہت قوت والا، سب پر غالب ہے۔ وہ لوگ کہ اگر ہم انھیں زمین میں اقتدار بخشیں تو وہ نماز قائم کریں گے اور زکوٰۃ دیں گے اور اچھے کام کا حکم دیں گے اور برے کام سے روکیں گے، اور تمام کاموں کا انجام اللہ ہی کے قبضہ میں ہے۔ ‘‘ اسلام کا بہت بڑا حصہ وہ ہے جس پر عمل اسی صورت میں ہو سکتا ہے جب حکومت کی باگ ڈور ایمان والوں کے ہاتھ میں ہو، اللہ تعالیٰ نے اپنی کتاب نازل کرنے کا مقصد بیان فرمایا : « اِنَّاۤ اَنْزَلْنَاۤ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَاۤ اَرٰىكَ اللّٰهُ » [ النساء : ۱۰۵ ] ’’بے شک ہم نے تیری طرف یہ کتاب حق کے ساتھ نازل کی، تاکہ تو لوگوں کے درمیان اس کے مطابق فیصلہ کرے جو اللہ نے تجھے دکھایا ہے۔ ‘‘ ظاہر ہے لوگوں کے درمیان اللہ کے حکم کے مطابق فیصلہ تبھی ہو سکے گا جب اس کے مطابق فیصلہ کرنے والوں کی حکومت ہو گی، کفار کی سلطنت میں نماز کا وہ نظام جس میں ہر مسلم حتیٰ کہ منافقین بھی مسجد میں آ کر نماز پڑھتے ہیں، خواہ سست کھڑے ہو کر پڑھیں یا دکھاوے کے لیے پڑھیں، قائم ہو ہی نہیں سکتا۔ (دیکھیے نساء : ۱۴۳) زکوٰۃ کی تحصیل (توبہ : ۱۰۳) اور اس کی اللہ کے حکم کے مطابق تقسیم (توبہ : ۶۰) مسلمانوں کی اپنی حکومت کے علاوہ ممکن نہیں۔ سود کو بند کرنے کا حکم اور سود خوری جاری رکھنے والوں کے خلاف اعلان جنگ اسی وقت عمل میں آ سکتا ہے کہ ملک کی حکومت اور معیشت ایمان والوں کے ہاتھ میں ہو۔ کتاب اللہ میں قتل اور جراحات کے قصاص کا حکم (بقرہ : ۱۷۸۔ مائدہ : ۴۵)، چوری پر ہاتھ کاٹنے کا حکم (مائدہ : ۳۸) اور زنا اور قذف پر حد جاری کرنے کا حکم (نور : ۲تا ۴) مسلم حکام کو دیا گیا ہے، کفار کی عدالت اور ان کی پولیس کو نہیں دیا گیا اور نہ ہی وہ کبھی اسے نافذ کریں گے۔ اس کتاب میں مسلمانوں پر کفار سے قتال اس لیے فرض نہیں کیا گیا (بقرہ : ۱۹۰، ۲۱۶) کہ وہ کفار کی حکومت میں رہ کر ان کی فوج میں بھرتی ہو کر کفر کی خاطر لڑیں گے اور کفار سے جزیہ لینے کا حکم (توبہ : ۲۹) اس مفروضے کے ساتھ نہیں دیا گیا کہ مسلمان کفار کے محکوم رہ کر ان سے جزیہ وصول کریں گے۔ اسلامی احکام کا یہ نقشہ صرف مدینہ میں جا کر ہی پیش نہیں ہوا، مکی سورتوں میں بھی یہی بات سمجھائی گئی ہے۔ دیکھیے سورۂ بنی اسرائیل (۸۰، ۸۱)، قصص (۸۵)، روم (۱ تا ۷)، صافات (۱۷۱ تا ۱۷۳)، ص (۱۱)، قمر (۴۳ تا ۴۵) اور سورۂ مزمل (۲۰)۔ ¤ رسول اللہ صلی اللہ علیہ وسلم کی زندگی اقامتِ دین کا بہترین نمونہ ہے۔ آپ صلی اللہ علیہ وسلم نے دین قائم کرنے کے لیے دعوت و تبلیغ اور تلوار دونوں سے پورے عرب کو حلقۂ بگوش اسلام کیا اور ایسی حکومت قائم کر دی جو اللہ تعالیٰ کے پورے دین پر عمل کی ضامن تھی۔ آپ صلی اللہ علیہ وسلم کے بعد خلفائے اسلام نے اس فریضہ کی تکمیل کی، حتیٰ کہ اللہ کا دین زمین کے مشرق و مغرب میں قائم ہو گیا۔ پھر مسلمان اپنی نااہلی اور کتاب اللہ کے تقاضوں کو نہ سمجھنے یا جان بوجھ کر اسے پس پشت پھینک کر جہاد ترک کر دینے کے نتیجے میں کفار کے محکوم ہو گئے۔ اب ان میں سے کسی کے ہاتھ میں اسلام کی دو چار چیزیں ہیں اور کسی کے ہاتھ میں پانچ دس یا کم و بیش۔ ان کی باقی ساری زندگی کفر کے نظام کی پابند ہے اور افسوس یہ کہ وہ اس پر قانع ہیں اور کفر کے نظام کے پرزے بن چکے ہیں اور ان کے بہت سے لوگ دین اسلام کے غلبے سے مایوس ہو کر جمہوریت اور کفر کے دوسرے نظاموں کو توڑنے کی کوشش کے بجائے انھیں اسلام ثابت کرنے کی جدوجہد میں لگ گئے ہیں۔ ہاں! رسول اللہ صلی اللہ علیہ وسلم کی بشارت کے مطابق ایک مجاہدین کی جماعت ’’طائفہ منصورہ‘‘ باقی ہے اور ہمیشہ رہے گی، جو کبھی کفر کی بالادستی قبول نہیں کرے گی اور دین کے غلبہ کے لیے زبانی کلامی فلسفوں کے بجائے دعوت کے ساتھ ساتھ قتال کا فریضہ بھی سر انجام دیتی رہے گی اور ہمیشہ اللہ تعالیٰ کی نصرت سے بہرہ یاب رہے گی۔ اللہ تعالیٰ ہمیں بھی اس مبارک طائفہ میں شامل فرما دے۔ (آمین) ¤ ➎ { وَ لَا تَتَفَرَّقُوْا فِيْهِ:} دین میں جدا جدا ہونے کی کئی صورتیں ہیں، جن میں سے ایک یہ ہے کہ اہلِ کتاب کی طرح بعض باتوں میں کتاب اللہ پر عمل کیا جائے اور بعض میں کتاب اللہ کے بجائے اپنی مرضی پر عمل کیا جائے، جیسا کہ اہلِ کتاب کے متعلق فرمایا : « اَفَتُؤْمِنُوْنَ بِبَعْضِ الْكِتٰبِ وَ تَكْفُرُوْنَ بِبَعْضٍ » [ البقرۃ : ۸۵ ] ’’پھر کیا تم کتاب کے بعض پر ایمان لاتے ہو اور بعض کے ساتھ کفر کرتے ہو؟‘‘ ایک صورت یہ ہے کہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم سے جو بات ثابت نہیں اسے دین بنا لیا جائے۔ اسے بدعت کہتے ہیں۔ سنت ہمیشہ ایک ہو گی، کیونکہ جس کی سنت ہے وہ ایک ہے، جبکہ بدعات کا شمار نہیں ہو گا، کیونکہ انھیں ایجاد کرنے والوں کا شمار نہیں ہو سکتا۔ پھر جب آدمی اصل سنت سے بہکتا ہے تو ایک بدعت پر نہیں رہتا بلکہ بدعات اس کے رگ و ریشہ میں سرایت کر جاتی ہیں اور اس کے ساتھ ہی وہ اپنا الگ فرقہ بنا لیتا ہے۔ اسے معلوم ہو بھی جائے کہ اس کی یا اس کے فرقے یا پیشوا کی فلاں بات کتاب اللہ یا حدیثِ رسول صلی اللہ علیہ وسلم کے خلاف ہے پھر بھی وہ اپنے دھڑے کی غلط بات پر اڑا رہے گا، حق کی طرف رجوع نہیں کرے گا اور اپنی یا اپنے امام کی بات کو کتاب اللہ اور سنت رسول صلی اللہ علیہ وسلم کے تابع کرنے کے بجائے آیات و احادیث کے معانی میں تحریف کرکے انھیں اپنے مطابق ثابت کرے گا۔ نام اس کا تاویل رکھے گا اور کہے گا کہ ہر وہ آیت یا حدیث جو ہمارے فرقے کے بزرگوں کے خلاف ہے اس کی تاویل ہو گی یا وہ منسوخ ہے۔ حالانکہ وہ آیت یا حدیث اس کے بزرگوں کے خلاف نہیں، کیونکہ وہ تو ان بزرگوں سے بہت پہلے نازل ہو چکی ہیں، بلکہ اس کے بزرگوں کی بات آیت یا حدیث کے خلاف ہے کہ انھیں اس کا علم نہیں ہو سکا، یا ان کے ذہن میں نہیں رہی۔ معاویہ بن ابو سفیان رضی اللہ عنھما نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم ہم میں کھڑے ہوئے اور فرمایا : [ أَلاَ إِنَّ مَنْ قَبْلَكُمْ مِنْ أَهْلِ الْكِتَابِ افْتَرَقُوْا عَلٰی ثِنْتَيْنِ وَسَبْعِيْنَ مِلَّةً وَ إِنَّ هٰذِهِ الْمِلَّةَ سَتَفْتَرِقُ عَلٰی ثَلاَثٍ وَسَبْعِيْنَ، ثِنْتَانِ وَ سَبْعُوْنَ فِي  النَّارِ وَ وَاحِدَةٌ فِي الْجَنَّةِ وَهِيَ الْجَمَاعَةُ، وَإِنَّهُ سَيَخْرُجُ مِنْ أُمَّتِيْ أَقْوَامٌ تَجَارٰی بِهِمْ تِلْكَ الْأَهْوَاءُ كَمَا يَتَجَارَی الْكَلَبُ لِصَاحِبِهِ لاَ يَبْقٰی مِنْهُ عِرْقٌ وَلاَ مَفْصِلٌ إِلاَّ دَخَلَهُ ] [أبوداوٗد، السنۃ، باب شرح السنۃ : ۴۵۹۷ ] ’’سنو! تم سے پہلے اہل کتاب کے لوگ بہتر (۷۲) ملتوں میں جدا جدا ہو گئے اور یہ ملت تہتر (۷۳) ملتوںمیں جدا جدا ہو جائے گی، بہتر (۷۲) آگ میں اور ایک جنت میں ہو گی اور وہی ’’الجماعة ‘‘ ہے اور حقیقت یہ ہے کہ میری امت میں کئی اقوام نکلیں گی جن میں یہ خواہشات (بدعات) اس طرح سرایت کر جائیں گی جیسے کتے کے ہلکاؤ کی بیماری اس کے مریض میں سرایت کر جاتی ہے، نہ اس کی کوئی رگ باقی رہتی ہے اور نہ کوئی جوڑ مگر وہ اس میں داخل ہو جاتی ہے۔‘‘ مزید دیکھیے سورہ انعام کی آیت (۱۵۹) : «اِنَّ الَّذِيْنَ فَرَّقُوْا دِيْنَهُمْ وَ كَانُوْا شِيَعًا» کی تفسیر ۔ ¤ ➏ { كَبُرَ عَلَى الْمُشْرِكِيْنَ مَا تَدْعُوْهُمْ اِلَيْهِ:} وہ بات جس کی دعوت آپ مشرکین کو دیتے ہیں وہ ان پر بہت بھاری ہے، مراد اس سے ایک اللہ کی عبادت کی دعوت ہے۔ کفار پر یہ دعوت اس قدر بھاری ہے کہ اس کا ماننا تو درکنار وہ اس کا سننا بھی برداشت نہیں کرتے، فرمایا : « وَ اِذَا ذُكِرَ اللّٰهُ وَحْدَهُ اشْمَاَزَّتْ قُلُوْبُ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ وَ اِذَا ذُكِرَ الَّذِيْنَ مِنْ دُوْنِهٖۤ اِذَاهُمْ يَسْتَبْشِرُوْنَ » [ الزمر : ۴۵ ] ’’ اور جب اس اکیلے اللہ کا ذکر کیا جاتا ہے تو ان لوگوں کے دل تنگ پڑجاتے ہیں جو آخرت پر یقین نہیں رکھتے اور جب ان کا ذکر ہوتا ہے جو اس کے سوا ہیں تو اچانک وہ بہت خوش ہو جاتے ہیں۔ ‘‘ وہ اس مجلس سے اٹھ جاتے ہیں جس میں ایک معبود کی بات ہو، فرمایا : « اَجَعَلَ الْاٰلِهَةَ اِلٰهًا وَّاحِدًا اِنَّ هٰذَا لَشَيْءٌ عُجَابٌ (5) وَ انْطَلَقَ الْمَلَاُ مِنْهُمْ اَنِ امْشُوْا وَ اصْبِرُوْا عَلٰۤى اٰلِهَتِكُمْ اِنَّ هٰذَا لَشَيْءٌ  يُّرَادُ » [ صٓ : ۵، ۶ ]"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { وَ مَا تَفَرَّقُوْۤا اِلَّا مِنْۢ بَعْدِ مَا جَآءَهُمُ الْعِلْمُ:} یعنی ان کے فرقوں میں بٹ جانے کا باعث یہ نہیں تھا کہ انھیں اللہ اور اس کے رسول کے احکام کا علم نہیں تھا اور لاعلمی کی وجہ سے انھوں نے اپنے اپنے الگ مذاہب اور مکاتب فکر بنا لیے، بلکہ یہ تفرقہ اللہ تعالیٰ کی طرف سے علم آ جانے کے بعد پیدا ہوا۔ ¤ ➋ { بَغْيًۢا بَيْنَهُمْ:} یعنی الگ الگ گروہ اور فرقے بنانے کا باعث ان کا باہمی حسد، ضد اور عناد تھا، جس کی وجہ سے اللہ کے حکم کے سامنے سر جھکانے کے بجائے انھوں نے اپنے اپنے قیاس و آراء کی بنیاد پر الگ الگ فرقے بنا ئے اور کتاب اللہ میں تحریف تک سے گریز نہ کیا، حتیٰ کہ نوبت باہمی اختلاف سے بڑھ کر ایک دوسرے کی مخالفت اور پھر جنگ و جدل تک پہنچ گئی۔ مزید دیکھیے سورۂ بقرہ (۲۱۳) کی تفسیر۔ ¤ ➌ { وَ لَوْ لَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ … :} اس کی تفسیر کے لیے دیکھیے سورۂ حم سجدہ (۴۵) کی تفسیر۔ ¤ ➍ { وَ اِنَّ الَّذِيْنَ اُوْرِثُوا الْكِتٰبَ مِنْۢ بَعْدِهِمْ … :} یعنی شروع میں فرقے بنانے والوں نے علم ہونے کے باوجود حق سے انحراف کیا اور اللہ کی کتاب میں ایسی لفظی و معنوی تحریفیں کیں کہ بعد میں آنے والے لوگ، جو اس کتاب کے وارث بننے کے قابل تو نہ تھے مگر انھیں اس کا وارث بنا دیا گیا، وہ اس کتاب میں کی گئی لفظی اور معنوی تحریفات کی وجہ سے اس کی حقانیت کے متعلق ایسے شک میں مبتلا ہو گئے جو انھیں شدید مضطرب اور بے چین رکھتا تھا۔ انھیں اپنی کتابوں کے الہامی ہونے کا یقین باقی نہ رہا، بلکہ وہ کسی دلیل و برہان کے بغیر محض آنکھیں بند کرکے آبا و اکابر کی تقلید کرتے چلے گئے۔ ¤ ➎ مفسر عبدالرحمن کیلانی لکھتے ہیں : ’’ان وارثوں کے اپنی الہامی کتابوں کے بارے میں شک میں پڑنے کی کئی وجوہ تھیں، جن میں سب سے بڑی وجہ یہ ہے کہ ان کتابوں کی اصل زبان اور اصل عبارت کو محفوظ رکھ کر آنے والی نسلوں تک نہ پہنچایا گیا، صرف تراجم سے کام لیا جانے لگا اور ان تراجم کو ہی الہامی کتاب سمجھا جانے لگا۔ دوسری وجہ یہ تھی کہ بزرگوں کے اقوال اور الحاقی مضامین ان میں شامل کر دیے گئے، حتیٰ کہ ان دونوں قسم کی عبارتوں میں تمیز کرنا مشکل ہو گیا اور تیسری وجہ یہ تھی کہ ان کی تاریخی سند بھی ضائع کر دی گئی (بلکہ سند رکھی ہی نہیں گئی)۔ ان سب باتوں کا اثر یہ ہوا کہ بعد میں آنے والے علماء خود اس کتاب سے شک میں پڑ گئے کہ کون سا حصہ درست اور الہامی ہے اور کون سی عبارت بزرگوں کے اقوال وغیرہ ہیں اور کسی بات کا صحیح فیصلہ کرنے میں یہی شک و شبہ انھیں اضطراب میں ڈالے رکھتا تھا۔‘‘ (تیسیر القرآن)"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { فَلِذٰلِكَ فَادْعُ:} مفسر ابن کثیر رحمہ اللہ نے فرمایا : ’’یہ آیت کریمہ دس جملوں پر مشتمل ہے، جن میں سے ہر جملہ اپنی جگہ مستقل مضمون ہے۔ آیت الکرسی کے سوا کوئی اور آیت ایسی نہیں۔‘‘ (ابن کثیر) {’’ فَلِذٰلِكَ ‘‘} جار مجرور {’’ فَلِذٰلِكَ فَادْعُ ‘‘} کے متعلق ہے، پہلے لانے سے اس میں اختصاص پیدا ہو گیا، یعنی لوگوں کو کسی اور نہیں بلکہ دین کے اسی طریقے کی دعوت دیں جو اس نے وحی کے ذریعے سے تمام انبیاء کے لیے مقرر فرمایا ہے اور وہ ہے ایک اللہ کی عبادت۔ اس کے دین کو قائم کرنا اور اس میں جدا جدا نہ ہو جانا، بلکہ اکٹھے ہو کر اللہ کی رسی کو مضبوطی سے تھام لینا۔ ¤ ➋ { وَ اسْتَقِمْ كَمَاۤ اُمِرْتَ:} دوسروں کو دعوت کے لیے خود اس پر عمل اور استقامت ضروری ہے، اس لیے اس پر مضبوطی سے قائم رہنے کا حکم دیا۔ {’’ وَ اسْتَقِمْ ‘‘} اور {’’ كَمَاۤ اُمِرْتَ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ ہود (۱۱۲)۔ ¤ ➌ { وَ لَا تَتَّبِعْ اَهْوَآءَهُمْ:} یعنی آپ اس کی پیروی کریں جس کا اللہ کی طرف سے آپ کو حکم دیا گیا ہے، اس کے سوا جو کچھ ہے محض خواہشات ہیں۔ اس لیے ان لوگوں کو خوش کرنے کے لیے یا ان سے صلح کی خاطر ان کی خواہشات کی پیروی مت کریں اور نہ دین میں کسی قسم کی مداہنت سے کام لیں۔ مزید دیکھیے سورۂ بقرہ (۱۴۵) اور سورۂ مائدہ (۴۹)۔ ¤ ➍ { وَ قُلْ اٰمَنْتُ بِمَاۤ اَنْزَلَ اللّٰهُ مِنْ كِتٰبٍ:} اہلِ کتاب چونکہ کسی آسمانی کتاب کو مانتے اور کسی کو نہیں مانتے تھے، اسی طرح اپنی کتاب کے بھی بعض حصوں کو مانتے تھے اور بعض کو نہیں مانتے تھے۔ (دیکھیے بقرہ : ۸۵) حالانکہ اللہ تعالیٰ کی طرف سے آنے والی ہر کتاب اور اس کی ہر بات پر ایمان لانا ضروری ہے۔ اس لیے فرمایا، ان سے کہہ دیں کہ میں فرقہ پرستوں کی طرح نہیں جو مرضی کی بات مانتے ہیں دوسری نہیں، بلکہ میں اللہ تعالیٰ کی طرف سے نازل شدہ ہر کتاب پر ایمان رکھتا ہوں، وہ خواہ کوئی ہو۔ میں پہلے انبیاء کی تکذیب کے لیے نہیں بلکہ ان کی تصدیق کے لیے آیا ہوں۔ تم پر بھی لازم ہے کہ تمھاری کتابوں میں میری اور قرآن کی جو تصدیق موجود ہے اس پر بھی ایمان لاؤ، تاکہ تمھارا ایمان بھی اللہ تعالیٰ کی نازل کردہ ہر کتاب پر ہو۔ مزید دیکھیے سورۂ بقرہ کی آیت (۱۳۶) : «لَا نُفَرِّقُ بَيْنَ اَحَدٍ مِّنْهُمْ » کی تفسیر۔ ¤ ➎ { وَ اُمِرْتُ لِاَعْدِلَ بَيْنَكُمْ:} عدل کا معنی انصاف اور برابری ہے، اس کے مقابلے میں ظلم ہے۔ یعنی مجھے حکم دیا گیا ہے کہ تمھارے درمیان عدل کروں، تمام لوگوں کو انصاف مہیا کروں، دنیا میں جو ظلم و زیادتی ہو رہی ہے اس کا خاتمہ کروں اور فیصلہ کرتے ہوئے اپنے پرائے میں فرق نہ کروں، بلکہ سب کو برابر رکھوں۔ اسی طرح چھوٹے و بڑے، کمزور و طاقتور اور امیر و غریب کے درمیان فرق نہ کروں۔ اس جملے میں اس غلبہ و اقتدار کی طرف بھی اشارہ ہے جو مدینہ جا کر حاصل ہونے والا تھا، کیونکہ بے اختیار شخص کیا عدل کرے گا اور اس کے پاس عدل طلب کرنے کے لیے کون جائے گا۔ ¤ ➏ { اَللّٰهُ رَبُّنَا وَ رَبُّكُمْ:} تمام بندوں میں عدل کا حکم اس لیے ہے کہ اللہ ہی ہمارا رب ہے اور وہی تمھارا رب ہے، ہم تم سب اس کے بندے ہیں۔ سو عدل کا حکم بھی سب کے لیے ہے، خواہ اپنا ہو یا پرایا، ضعیف ہو یا شریف، حکمران ہو یا رعایا۔ ¤ ➐ {لَنَاۤ اَعْمَالُنَا وَ لَكُمْ اَعْمَالُكُمْ:} اس کے دو مطلب ہو سکتے ہیں، ایک اظہارِ براء ت، جیسے فرمایا : « لَكُمْ دِيْنُكُمْ وَ لِيَ دِيْنِ » [الکافرون : ۶ ] ’’تمھارے لیے تمھارا دین اور میرے لیے میرا دین ہے۔‘‘ اور جیسا کہ سورۂ انعام (۱۳۵)، ہود (۹۳، ۱۲۱) اور سورۂ زمر (۳۹)میں اظہارِ براء ت فرمایا ہے۔ دوسرا مطلب یہ کہ ہمارے اچھے یا برے اعمال ہمارے لیے ہیں اور تمھارے اعمال تمھارے لیے ہیں، نہ ہمارے اچھے اعمال تمھیں دیے جائیں گے اور نہ تمھارے اچھے اعمال ہمیں دیے جائیں گے۔ اسی طرح نہ تم ہمارے بد اعمال میں پکڑے جاؤ گے اور نہ ہم تمھارے بد اعمال میں پکڑے جائیں گے، جیسا کہ فرمایا : « فَاِنَّمَا عَلَيْهِ مَا حُمِّلَ وَ عَلَيْكُمْ مَّا حُمِّلْتُمْ » [ النور : ۵۴ ] ’’ تو اس کے ذمے صرف وہ ہے جو اس پر بوجھ ڈالا گیا ہے اور تمھارے ذمے وہ جو تم پر بوجھ ڈالا گیا۔‘‘ مزید دیکھیے سورۂ بقرہ (۱۳۹)، یونس (۴۱)، ہود (۳۵) اور قصص (۵۵)۔ ¤ ➑ {لَا حُجَّةَ بَيْنَنَا وَ بَيْنَكُمْ:} یعنی جھگڑا کرنے کی ضرورت نہیں، جو بات حق تھی وہ ہم نے دلائلل کے ساتھ واضح کر دی، ہمیں تمھارے باطل پر اور اپنے حق پر ہونے کا پورا یقین ہے۔ تم اپنی بات پر اڑے ہوئے ہو، اس لیے جھگڑے کا کوئی فائدہ نہیں، تم جھگڑو بھی تو ہم جھگڑنے کے لیے تیار نہیں، اب تلوار کے ساتھ فیصلہ باقی رہ جاتاہے، وہ اپنے وقت پر ہو جائے گا۔ ¤ ➒ { اَللّٰهُ يَجْمَعُ بَيْنَنَا:} باطل پر جمے رہنے اور اس پر ناحق جھگڑا کرنے سے ڈراتے ہوئے فرمایا کہ اللہ تعالیٰ ہمیں اور تمھیں جمع کرے گا، کیا تمھیں اس بات سے خوف نہیں آتا کہ ناحق جھگڑے کا وہاں کیا جواب دو گے؟ ¤ ➓ { وَ اِلَيْهِ الْمَصِيْرُ:} اسی کی طرف سب کو لوٹ کر جانا ہے، وہاں پورا انصاف ہو جائے گا۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {وَ الَّذِيْنَ يُحَآجُّوْنَ فِي اللّٰهِ مِنْۢ بَعْدِ …: ’’ دَاحِضَةٌ ‘‘ ’’دَحَضَ يَدْحَضُ دَحْضًا و دُحُوْضًا ‘‘} (ف) {’’دَحَضَتِ الْحُجَّةُ‘‘} دلیل باطل ہونا اور {’’دَحَضَتِ الرِّجْلُ‘‘} پاؤں کا پھسل جانا۔ {’’حُجَّةٌ‘‘} کا معنی  جھگڑا بھی ہے اور دلیل بھی۔ پچھلی آیت میں فرمایا : « لَا حُجَّةَ بَيْنَنَا وَ بَيْنَكُمْ » کہ ’’ہمارے درمیان اور تمھارے درمیان کوئی جھگڑا نہیں‘‘ کیونکہ جو بات حق تھی وہ ہم نے تمھیں پہنچا دی، اب جھگڑے کا کوئی فائدہ نہیں، اس آیت میں فرمایا کہ جب اللہ تعالیٰ کی بات قبول کر لی گئی، اس کا حق ہونا واضح ہو گیا، حتیٰ کہ بہت سے سمجھ دار لوگ اسے قبول کر چکے اور بہت سے دل میں تسلیم کر چکے ہیں تو لوگ اب بھی اللہ تعالیٰ کے بارے میں خواہ مخواہ جھگڑ رہے ہیں اور اپنے خیال میں بڑی مضبوط دلیلیں لا رہے ہیں، کبھی اس کی توحید میں بحث کرتے ہیں، جیسا کہ فرمایا : « اَجَعَلَ الْاٰلِهَةَ اِلٰهًا وَّاحِدًا » [ صٓ : ۵ ] ’’کیا اس نے تمام معبودوں کو ایک ہی معبود بنا ڈالا؟‘‘ کبھی اس کی دوبارہ زندہ کرنے کی قدرت کے بارے میں جھگڑتے ہیں،جیسا کہ فرمایا : «مَنْ يُّحْيِ الْعِظَامَ وَ هِيَ رَمِيْمٌ » [ یٰسٓ : ۷۸ ] ’’کون ہڈیوں کو زندہ کرے گا، جب کہ وہ بوسیدہ ہوں گی؟ ‘‘ کبھی اس کے انسان کو رسول بنا کر بھیجنے کے بارے میں جھگڑتے ہیں، فرمایا : « وَ قَالُوْا مَالِ هٰذَا الرَّسُوْلِ يَاْكُلُ الطَّعَامَ وَ يَمْشِيْ فِي الْاَسْوَاقِ » [الفرقان : ۷ ] ’’اور انھوں نے کہا اس رسول کو کیا ہے کہ کھانا کھاتا ہے اور بازاروں میں چلتا پھرتا ہے۔‘‘ کبھی اس کے شرکاء بنانے کے جواز میں اپنے معبودوں کو اللہ کے ہاں سفارشی اور اس کے قریب کرنے والے قرار دیتے ہیں، فرمایا : « هٰۤؤُلَآءِ شُفَعَآؤُنَا عِنْدَ اللّٰهِ» [ یونس : ۱۸ ] ’’یہ لوگ اللہ کے ہاں ہمارے سفارشی ہیں۔‘‘ اور فرمایا : « مَا نَعْبُدُهُمْ اِلَّا لِيُقَرِّبُوْنَاۤ اِلَى اللّٰهِ زُلْفٰى» [ الزمر : ۳ ] ’’ہم ان کی عبادت نہیں کرتے مگر اس لیے کہ یہ ہمیں اللہ سے قریب کر دیں۔‘‘ ان کی مزعومہ یہ اور اس جیسی سب دلیلیں اللہ تعالیٰ کے ہاں باطل اور بے کار ہیں، انھیں اس جھگڑے سے کچھ حاصل نہیں ہو گا۔ ¤ ➋ { وَ عَلَيْهِمْ غَضَبٌ: ’’ غَضَبٌ ‘‘} پر تنوین تعظیم کی ہے، یعنی ان پر بھاری غضب ہے۔ ¤ ➌ { وَ لَهُمْ عَذَابٌ شَدِيْدٌ:} جس کا دنیا میں مظاہرہ اہلِ مکہ پر مسلط خوف، قحط، جنگِ بدر اور دوسرے معرکوں میں ہوا اور جس کی شدت قیامت کے دن نعمان بن بشیر رضی اللہ عنھما نے رسول اللہ صلی اللہ علیہ وسلم سے نقل فرمائی، آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ لَرَجُلٌ تُوْضَعُ فِيْ أَخْمَصِ قَدَمَيْهِ جَمْرَةٌ يَغْلِيْ مِنْهَا دِمَاغُهُ ] [ بخاري، الرقاق، باب صفۃ الجنۃ والنار : ۶۵۶۱ ] ’’قیامت کے دن آگ والوں میں سب سے ہلکے عذاب والا شخص وہ ہو گا جس کے دونوں پاؤں کے تلوؤں میں ایک انگارا رکھا جائے گا، جس سے اس کا دماغ کھول رہا ہو گا۔‘‘"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {اَللّٰهُ الَّذِيْۤ اَنْزَلَ الْكِتٰبَ بِالْحَقِّ وَ الْمِيْزَانَ:’’ الْكِتٰبَ ‘‘ } میں الف لام جنس کا ہو تو مراد تمام روحانی کتابیں ہیں اور اگرعہد کا ہو تو مراد یہ کتاب یعنی قرآن مجید ہے۔ یعنی کیا جانتے بھی ہو کہ جس اللہ کے بارے میں تم جھگڑ رہے ہو وہ کون ہے اور اس کی صفات اور اس کے احکام کیسے معلوم ہو سکتے ہیں؟ فرمایا اللہ وہی ہے جس نے یہ کتاب یعنی قرآن مجید حق کے ساتھ نازل فرمایا ہے، اس کی ہر بات حق ہے، اس میں باطل کی آمیزش ہو ہی نہیں سکتی، جیسا کہ فرمایا : «لَا يَاْتِيْهِ الْبَاطِلُ مِنْۢ بَيْنِ يَدَيْهِ وَ لَا مِنْ خَلْفِهٖ » [ حٰمٓ السجدۃ : ۴۲ ] ’’اس کے پاس باطل نہ اس کے آگے سے آتا ہے اور نہ اس کے پیچھے سے۔‘‘ اور اسی نے میزان اتارا ہے جس کے ساتھ لوگ اپنے تمام معاملات میں انصاف کے ساتھ فیصلہ کر سکیں۔ {’’ الْمِيْزَانَ ‘‘} سے مراد اکثر مفسرین نے عدل و انصاف لیا ہے، بعض نے اس سے مراد دین حق اور بعض نے جزا و سزا کا قانون لیا ہے۔ ان میں سے جو بھی مراد لیں بات ایک ہی ہے اور اس میزان سے مراد اللہ کے دین اور اس کی شریعت پر مشتمل یہ کتاب ہی ہے جو خالق و مخلوق کے درمیان معاملات اور مخلوق کے باہمی معاملات اور تمام تنازعات کے لیے میزان ہے، جو ہر بات ترازو کی طرح تول کر صحیح یا غلط اور حق یا باطل کا فیصلہ کر دیتی ہے۔ اوپر فرمایا تھا : « وَ اُمِرْتُ لِاَعْدِلَ بَيْنَكُمْ » [الشورٰی : ۱۵ ] (اور مجھے حکم دیا گیا ہے کہ میں تمھارے درمیان انصاف کروں) اور اس آیت میں بتا دیا کہ اس کتاب پاک کی صورت میں میزان آ گئی ہے، جس کے ساتھ وہ عدل قائم کیا جائے گا۔ یہ کتاب دوسرے معاملات کی طرح پہلی کتابوں کے لیے بھی میزان اور ان کی نگران ہے کہ ان میں کون سی باتیں اللہ تعالیٰ کی طرف سے ہیں اور کون سی ملا دی گئی ہیں، جیسا کہ فرمایا : « وَ اَنْزَلْنَاۤ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ الْكِتٰبِ وَ مُهَيْمِنًا عَلَيْهِ » [ المائدۃ : ۴۸ ] ’’اور ہم نے تیری طرف یہ کتاب حق کے ساتھ بھیجی، اس حال میں کہ اس کی تصدیق کرنے والی ہے جو کتابوں میں سے اس سے پہلے ہے اور اس پر محافظ ہے۔‘‘ ¤ ➋ یہاں ایک سوال ہے کہ آیت میں {’’ الْكِتٰبَ ‘‘} اور {’’ الْمِيْزَانَ ‘‘} کے درمیان واؤ عطف ہے جو مغایرت کے لیے ہوتی ہے، جس سے ظاہر ہے کہ کتاب اور میزان الگ الگ چیزیں ہیں، اب اگر میزان سے مراد کتاب ہی ہو تو مغایرت ختم ہو جاتی ہے، اسی طرح اگر میزان سے مراد عدل و انصاف لیں تب بھی کتاب اور میزان کے درمیان مغایرت نہیں رہتی، کیونکہ اللہ تعالیٰ کی تمام کتابیں عین عدل و انصاف ہیں؟ جواب اس کا یہ ہے کہ ایک ہی چیز کا ذکر جب اس کی مختلف صفات کے ساتھ کیا جائے تو اس کا عطف خود اس پر ہو سکتا ہے، کیونکہ صفات کے تغایر کو ذوات کے تغایر کی طرح قرار دے لیا جاتا ہے۔ قرآن مجید میں اس کی مثالوں میں سے ایک مثال یہ ہے : «سَبِّحِ اسْمَ رَبِّكَ الْاَعْلَى (1) الَّذِيْ خَلَقَ فَسَوّٰى (2) وَ الَّذِيْ قَدَّرَ فَهَدٰى (3) وَ الَّذِيْۤ اَخْرَجَ الْمَرْعٰى» [ الأعلٰی : ۱ تا ۴ ] ان آیات میں {’’ الَّذِيْ ‘‘} (وہ ذات) کو عطف کے ساتھ الگ الگ بیان کیا گیا ہے، حالانکہ وہ ایک ہی ہے۔ وجہ یہ ہے کہ ہر جملے میں وہ الگ الگ صفت کے ساتھ مذکور ہے۔ کلامِ عرب میں سے اس کی مثال یہ شعر ہے : ¤ {إِلَي الْمَلِكِ الْقَرْمِ وَابْنِ الْهُمَامِ ¤ وَ لَيْثِ الْكَتِيْبَةِ فِي الْمُزْدَحَمِ} ¤ [ أضواء البیان ] ¤ ➌ {وَ مَا يُدْرِيْكَ لَعَلَّ السَّاعَةَ قَرِيْبٌ:} اور تجھے کیا چیز آگاہ کرتی ہے شاید کہ وہ قیامت بالکل نزدیک ہو اور جو سانس تم لے رہے ہو یہی آخری ہو، اس لیے اس فکر میں مت پڑو کہ وہ کب ہے، بلکہ یہ فکر کرو کہ تم نے اس کے لیے کیا تیاری کی ہے۔ انس رضی اللہ عنہ بیان کرتے ہیں کہ بادیہ والوںمیں سے ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : [ يَا رَسُوْلَ اللّٰهِ ! مَتَی السَّاعَةُ قَائِمَةٌ؟ قَالَ وَيْلَكَ وَمَا أَعْدَدْتَ لَهَا؟ قَالَ مَا أَعْدَدْتُ لَهَا إِلاَّ أَنِّيْ أُحِبُّ اللّٰهَ  وَ رَسُوْلَهُ، قَالَ إِنَّكَ مَعَ مَنْ أَحْبَبْتَ فَقُلْنَا وَ نَحْنُ كَذٰلِكَ ؟ قَالَ نَعَمْ، فَفَرِحْنَا يَوْمَئِذٍ فَرَحًا شَدِيْدًا، فَمَرَّ غُلاَمٌ لِلْمُغِيْرَةِ وَكَانَ مِنْ أَقْرَانِييْ فَقَالَ إِنْ أُخِّرَ هٰذَا فَلَنْ يُدْرِكَهُ الْهَرَمُ حَتّٰی تَقُوْمَ السَّاعَةُ ] [ بخاري، الأدب، باب ما جاء في قول الرجل ویلک : ۶۱۶۷ ] ’’یا رسول اللہ! قیامت کب قائم ہونے والی ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’افسوس تم پر! تم نے اس کے لیے تیاری کیا کی ہے؟‘‘ اس نے کہا : ’’میں نے اس کے لیے اس کے سوا کوئی تیاری نہیں کی کہ میں اللہ اور اس کے رسول سے محبت کرتا ہوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تم یقینا اس کے ساتھ ہوگے جس سے تمھیں محبت ہو گی۔‘‘ تو ہم نے کہا : ’’اور ہمارے ساتھ بھی یہی معاملہ ہو گا؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہاں!‘‘ تو ہم اس دن بہت زیادہ خوش ہوئے۔ مغیرہ کا ایک غلام وہاں سے گزرا، وہ میرا ہم عمر تھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اگر اس کی عمر دراز ہوئی تو اسے سخت بڑھاپا آنے سے پہلے پہلے قیامت قائم ہو جائے گی۔‘‘ مراد اس وقت موجود لوگوں کی قیامت ہے۔ حدیث میں قابل توجہ بات یہ ہے کہ آپ صلی اللہ علیہ وسلم نے ہر آدمی کی موت کو اس کے لیے قیامت قرار دیا، کیونکہ اس کے ساتھ اس کے لیے عمل کی مہلت ختم ہو جاتی ہے۔ ¤ ➍ یہاں ایک مشہور سوال ہے کہ {’’ السَّاعَةَ ‘‘} مؤنث ہے، اس کی خبر {’’ قَرِيْبٌ ‘‘} مذکر ہے، حالانکہ دونوں میں مطابقت ہونی چاہیے ؟ جواب کے لیے دیکھیے سورۂ اعراف کی آیت (۵۶) : «اِنَّ رَحْمَتَ اللّٰهِ قَرِيْبٌ مِّنَ الْمُحْسِنِيْنَ » کی تفسیر۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { يَسْتَعْجِلُ بِهَا الَّذِيْنَ لَا يُؤْمِنُوْنَ بِهَا: ’’اِسْتِعْجَالٌ‘‘} کا معنی ہے کسی چیز کے وقت سے پہلے اس کےلانے کا مطالبہ۔ رسول اللہ صلی اللہ علیہ وسلم قیامت سے اور اس کے قریب ہونے سے ڈراتے تو کفار اسے جلد از جلد لانے کا مطالبہ کرتے۔ مقصد ان کا صرف قیامت کا انکار اور اس کا مذاق اڑانا ہوتا تھا کہ جب وہ ان کے مطالبے پر فوراً برپا نہیں ہو گی تو وہ اسے جھٹلائیں گے اور اس کا مذاق اڑائیں گے کہ اگر قیامت ہوتی تو ہمارے مطالبے پر آ جاتی، حالانکہ وہ ان کی فرمائش پر نہیں بلکہ اللہ تعالیٰ کے مقرر کردہ وقت پر آئے گی جس کا اس کے سوا کسی کو علم نہیں۔ اس آیت میں ان کی اس جرأت کی وجہ بیان فرمائی کہ ان کے اس مطالبے کی وجہ صرف یہ ہے کہ وہ قیامت کے دن پر یقین نہیں رکھتے جس میں اعمال کی باز پرس ہو گی۔ اگر انھیں اس بات کا یقین ہوتا تو وہ کبھی اس کے لیے جلدی نہ مچاتے، بلکہ اس کی تیاری کی فکر کرتے۔ ¤ ➋ { وَ الَّذِيْنَ اٰمَنُوْا مُشْفِقُوْنَ مِنْهَا …:} یعنی منکرین قیامت کے برعکس جو لوگ اس پر یقین و ایمان رکھتے ہیں وہ ہر وقت اس بات سے سخت ڈرتے رہتے ہیں کہ کب موت آ کر عمل کی مہلت ختم کر دے، پھر قیامت کبریٰ برپا ہونے پر حساب کے وقت ان کا کیا حال ہو۔ (دیکھیے انبیاء : ۴۹۔ نور : ۳۷۔ دہر : ۷) کیونکہ انھیں یقین ہے کہ وہ ہو کر رہنے والی ہے۔ ¤ ➌ { اَلَاۤ اِنَّ الَّذِيْنَ يُمَارُوْنَ فِي السَّاعَةِ لَفِيْ ضَلٰلٍۭ بَعِيْدٍ: ’’ يُمَارُوْنَ ‘‘} کا معنی ’’شک کرتے ہیں‘‘ بھی ہے اور ’’جھگڑتے ہیں‘‘ بھی۔ یعنی قیامت کا یقین ہو تو انسان اللہ تعالیٰ سے ڈرتا ہے اور حق واضح ہونے پر اسے قبول بھی کر لیتا ہے، مگر جسے اس کے آنے ہی میں شک ہو اور وہ اس کے متعلق جھگڑا کرتا رہتا ہو وہ ایمان لانے اور نیک اعمال اختیار کرنے کو بے کار سمجھے گا اور محاسبے کا خوف نہ ہونے کی وجہ سے ہر گناہ پر دلیر ہو گا اور بڑے سے بڑے ظلم سے بھی گریز نہیں کرے گا، ایسے لوگ راہِ حق سے بہت دور جا چکے ہیں، جہاں سے ان کی واپسی ممکن نہیں۔ {’’ ضَلٰلٍۭ بَعِيْدٍ ‘‘} میں یہ بھی شامل ہے کہ وہ سیدھے راستے سے اتنے دور جا چکے ہیں کہ ان کی آنکھیں قیامت کے دن ہی کھلیں گی، جب واپس پلٹنا ممکن نہیں ہو گا۔ دیکھیے سورۂ سبا (۵۱ تا ۵۴)۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { اَللّٰهُ لَطِيْفٌۢ بِعِبَادِهٖ: ’’ لَطِيْفٌ‘‘} ایسی چیز جوگرفت میں نہ آ سکے۔ اللہ تعالیٰ کی صفت ’’لطيف‘‘ اس لحاظ سے ہے کہ وہ باریک سے باریک چیز کی خبر رکھنے والا ہے اور اس لحاظ سے بھی کہ اس کی تدبیر نہایت باریک ہوتی ہے جو نظر نہیں آتی۔ اس لحاظ سے اس کا معنی لطف و کرم کرنے والا بھی ہے کہ وہ ایسے باریک طریقے سے مہربانی فرماتا ہے کہ نظر ہی نہیں آتا کہ یہ کیسے ہو گئی۔ (مفردات) گویا {’’ لَطِيْفٌ‘‘} میں دو صفتیں جمع ہیں، ایک نہایت باریک بین اور دوسری نہایت مہربانی والا۔ ان کے ضمن میں کمال علم بھی ہے جس کے بغیر باریک بینی کا سوال ہی پیدا نہیں ہوتا۔ بندوں پر لطیف ہونے کا مطلب یہ ہے کہ اس سے ان کی کوئی چھوٹی سے چھوٹی مادی یا روحانی ضرورت پوشیدہ نہیں اور وہ اپنی کمال مہربانی اور باریک طریقوں سے ایسے انتظام فرماتا ہے کہ ہر بندے کی بلکہ ہر مخلوق کی ضرورت جو اس کے حسبِ حال ہو، پوری ہو اور اسے خبر بھی نہ ہو کہ وہ کیسے پوری ہو گئی۔ بعض اہلِ علم نے فرمایا کہ {’’ بِعِبَادِهٖ ‘‘} کا لفظ اگرچہ عام ہے مگر اس سے مراد یہاں اللہ کے مومن بندے ہیں اور بعض نے فرمایا کہ{’’ بِعِبَادِهٖ ‘‘} میں مومن و کافر دونوں شامل ہیں، دنیا میں دونوں اس کے لطفِ عام سے فائدہ اٹھا رہے ہیں، البتہ آخرت میں اس کا لطف و کرم مومنوں کے لیے خاص ہو گا۔ ¤ ➋ { يَرْزُقُ مَنْ يَّشَآءُ:} اسی لیے ان میں سے بے شمار لوگوں کو جھٹلانے اور مذاق اڑانے کے باوجود بھوکا نہیں مارتا، بلکہ ان کی تمام ضرورتیں اپنے لطف و کرم سے پوری کرتا ہے۔ مگر جسے چاہتا ہے اور جتنا چاہتا ہے رزق دیتا ہے اور جس کی روزی کا دفتر بند کرنا چاہتا ہے کر دیتا ہے۔ یہ بات یہاں ذکر کرنے کی مناسبت یہ ہے کہ اکثر لوگ رزق کے پیچھے رزاق کو بھول جاتے ہیں۔ ¤ ➌ { وَ هُوَ الْقَوِيُّ:} یعنی وہ جو کرنا چاہے، جسے جتنا رزق دینا چاہے اس کی پوری قوت رکھتا ہے، کسی کام میں کسی کا محتاج نہیں۔ ¤ ➍ {الْعَزِيْزُ:} یعنی دوسرے تمام معاملات کی طرح رزق کے معاملے میں بھی کسی کا اس پر زورر نہیں کہ وہ دینا چاہے تو کوئی اسے روک سکے، یا نہ دینا چاہے تو کوئی اس سے لے سکے۔ خبر {’’ الْقَوِيُّ الْعَزِيْزُ ‘‘} پر الف لام سے قصر پیدا ہو گیا ہے ، یعنی دونوں صفتیں صرف اس میں ہیں، کسی اور میں نہیں، جیساکہ فرمایا: [ اَللّٰهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ ] [ بخاري، القدر، باب لا مانع لما أعطی اللّٰہ : ۶۶۱۵ ] ’’اے اللہ! تو جو دے اسے کوئی روکنے والا نہیں اور جو تو روک دے وہ کوئی دینے والا نہیں۔‘‘"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { مَنْ كَانَ يُرِيْدُ حَرْثَ الْاٰخِرَةِ … :} اللہ تعالیٰ نے دنیا کو آدمی کے لیے کھیت بنایا ہے، وہ اس میں جو بوئے گا وہی کاٹے گا اور جس چیز کا ارادہ کرے گا وہی ملے گی۔ اسی طرح اس نے دنیا کو تجارت کی جگہ بنایا ہے، اگر خیر کا سودا کرے گا تو نفع میں خیر ملے گی، اگر شر کا سودا کرے گا تو نتیجہ میں شر پائے گا۔ اسی طرح دنیا کو آخرت کا راستہ بنایا ہے، اگر خیر کے راستے پر چلے گا تو منزل مراد پا لے گا اور ہمیشہ کی جنت میں پہنچ جائے گا، اگر شر کے راستے پر چلے گا تو ہمیشہ کے عذاب اور دائمی غم میں جا پڑے گا۔ اس تجارت کے نفع و نقصان کا کئی آیات میں ذکر فرمایا ہے، فرمایا : «اِنَّ اللّٰهَ اشْتَرٰى مِنَ الْمُؤْمِنِيْنَ اَنْفُسَهُمْ وَ اَمْوَالَهُمْ بِاَنَّ لَهُمُ الْجَنَّةَ » [ التوبۃ : ۱۱۱ ] ’’بے شک اللہ نے مومنوں سے ان کی جانیں اور ان کے اموال خرید لیے ہیں، اس کے بدلے کہ ان کے لیے جنت ہے۔‘‘ اور فرمایا : «وَ مِنَ النَّاسِ مَنْ يَّشْرِيْ نَفْسَهُ ابْتِغَآءَ مَرْضَاتِ اللّٰهِ » [ البقرۃ : ۲۰۷ ] ’’اور لوگوں میں سے بعض وہ ہے جو اللہ کی رضا مندی تلاش کرنے کے لیے اپنی جان بیچ دیتا ہے۔‘‘ اور فرمایا : « اُولٰٓىِٕكَ الَّذِيْنَ اشْتَرَوُا الْحَيٰوةَ الدُّنْيَا بِالْاٰخِرَةِ » [ البقرۃ : ۸۶ ] ’’یہی لوگ ہیں جنھوں نے دنیا کی زندگی آخرت کے بدلے خریدی۔‘‘ ¤ ➋ پچھلی آیات میں اللہ تعالیٰ نے رزق کا قانون بیان فرمایا کہ وہ سب کے لیے یکساں نہیں، وہ جسے چاہتا ہے اور جتنا چاہتا ہے دیتا ہے اور اس میں اس کی بے شمار حکمتیں ہیں۔ (دیکھیے زخرف : ۳۲) اس آیت میں فرمایا کہ آدمی کی کوشش اور نیت کے مختلف ہونے کے لحاظ سے بھی اسے ملنے والا رزق مختلف ہے۔ ¤ ➌ آخرت کی کھیتی کا ارادہ رکھنے والے کے متعلق یہ نہیں فرمایا کہ اسے دنیا میں کچھ نہیں ملے گا۔ دنیا تو نیک ہو یا بد ہر ایک کو تھوڑی یا زیادہ ملنی ہی ملنی ہے، آخرت کے متعلق بشارت دی کہ ہم اس کے لیے اس کی کھیتی میں اضافہ کریں گے، کیونکہ اس کی نیت اور کوشش اسی کی ہے۔ اضافہ یہ ہے کہ دنیا میں اسے مزید نیکیوں کی توفیق دیں گے اور آخرت میں ایک نیکی کو دس گنا سے ہزاروں لاکھوں تک بلکہ شمار سے بھی زیادہ بڑھائیں گے اور دائمی نعمتیں عطا کریں گے، جیسا کہ فرمایا : « وَ مَنْ اَرَادَ الْاٰخِرَةَ وَ سَعٰى لَهَا سَعْيَهَا وَ هُوَ مُؤْمِنٌ فَاُولٰٓىِٕكَ كَانَ سَعْيُهُمْ مَّشْكُوْرًا » [ بني إسرائیل : ۱۹ ] ’’اور جس نے آخرت کا ارادہ کیا اور اس کے لیے کوشش کی جو اس کے لائق کوشش ہے، جب کہ وہ مومن ہو تو یہی لوگ ہیں جن کی کوشش ہمیشہ سے قدر کی ہوئی ہے۔‘‘ ¤ ➍ { وَ مَنْ كَانَ يُرِيْدُ حَرْثَ الدُّنْيَا نُؤْتِهٖ مِنْهَا …:’’ مِنْهَا ‘‘} میں {’’مِنْ‘‘} تبعیض کے لیے ہے۔ یعنی جو شخص دنیا کی کھیتی کا ارادہ کرے گا اور دنیا ہی کے لیے کوشش اور محنت کرے گا، ایک تو یہ کہ اسے وہ نہیں ملے گا جو وہ چاہتا ہے بلکہ ہم اسے اس میں سے کچھ حصہ ہی دیں گے، دوسرا یہ کہ وہ حصہ بھی ہم دنیا ہی میں دے دیں گے، آخرت میں اس کے لیے کوئی حصہ نہیں، کیونکہ آخرت کی نیت سے اس نے کچھ کیا ہی نہیں۔ یہی بات ایک اور آیت میں یوں بیان فرمائی : « مَنْ كَانَ يُرِيْدُ الْعَاجِلَةَ عَجَّلْنَا لَهٗ فِيْهَا مَا نَشَآءُ لِمَنْ نُّرِيْدُ ثُمَّ جَعَلْنَا لَهٗ جَهَنَّمَ يَصْلٰىهَا مَذْمُوْمًا مَّدْحُوْرًا» [بني إسراائیل : ۱۸ ] ’’جو شخص اس جلدی والی (دنیا) کا ارادہ رکھتا ہو ہم اس کو اس میں جلدی دے دیں گے جو چاہیں گے، جس کے لیے چاہیں گے، پھر ہم نے اس کے لیے جہنم بنا رکھی ہے، اس میں داخل ہوگا، مذمت کیا ہوا، دھتکارا ہوا۔ ‘‘ اور فرمایا : « فَمِنَ النَّاسِ مَنْ يَّقُوْلُ رَبَّنَاۤ اٰتِنَا فِي الدُّنْيَا وَ مَا لَهٗ فِي الْاٰخِرَةِ مِنْ خَلَاقٍ»  [ البقرۃ : ۲۰۰ ] ’’پھر لوگوں میں سے کوئی تو وہ ہے جو کہتا ہے اے ہمارے رب! ہمیں دنیا میں دے دے اور آخرت میں اس کا کوئی حصہ نہیں۔ ‘‘"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ { اَمْ لَهُمْ شُرَكٰٓؤُا شَرَعُوْا لَهُمْ … :} ظاہر ہے اس آیت میں {’’ شُرَكٰٓؤُا ‘‘} سے مراد وہ شریک نہیں ہیں جن سے لوگ دعائیں مانگتے یا جن کی نذر و نیاز چڑھاتے اور پوجا پاٹ کرتے ہیں، کیونکہ وہ دین کا کوئی طریقہ مقرر کر سکتے ہیں نہ حلال و حرام قرار دینے میں ان کا کوئی دخل ہے اور نہ وہ کوئی قانون یا ضابطہ مقرر کر سکتے ہیں۔ لا محالہ اس سے مراد کوئی انسان یاانسانوں کی کوئی جماعت ہی ہے جنھوں نے اللہ کی شریعت کے مقابلے میں اپنی شریعت چلا رکھی ہو، حرام و حلال قرار دینے کے اختیارات اپنے ہاتھ میں لے رکھے ہوں اور لوگوں کے لیے ایسے نظام اور قانون مقرر کرتے ہوں جو اللہ تعالیٰ کی شریعت کے خلاف ہوں، پھر انھیں لوگوں میں رائج اور نافذ بھی کرتے ہوں۔ ایسے لوگ پارلیمنٹ یا ایوانوں کے ممبر بھی ہو سکتے ہیں، خود سر حکمران بھی، آستانوں اور مزاروں کے مجاور اور متولی بھی اور گمراہ قسم کے فلسفی اور مصنف بھی۔ علاوہ ازیں یہ شرکاء ایسے صالح اور متقی ائمہ بھی ہو سکتے ہیں جو اللہ کے مقابلے میں قانون سازی کا سوچ بھی نہ سکتے ہوں مگر لوگوں نے ان کے نام پر قرآن و سنت کے بالمقابل شریعت سازی کر کے انھیں اللہ کا شریک بنا رکھا ہو۔ شرک کسی بھی طرح کا ہو ظلم عظیم ہے، خواہ شرک فی العبادۃ ہو یا شرک فی الحکم۔ جس طرح وہ شخص مشرک ہے جو اللہ کے سوا کسی کی پوجا کرتا ہے، اس کی نذر و نیاز دیتا ہے، مصیبت کے وقت اسے پکارتا ہے، اسے حاجت روا یا مشکل کشا سمجھتا ہے، خواہ کسی زندہ کی پوجا کرے یا مردہ کی، جن کی کرے یا انسان یا فرشتے کی، قبر کی پوجا کرے یا بت کی، اسی طرح جو شخص اللہ تعالیٰ کے سوا کسی آدمی کو اللہ تعالیٰ کے مقابلے میں زندگی کا نظام بنانے کا یا قانون بنانے کا یا حلال و حرام قرار دینے کا اختیار دیتا ہے وہ بھی مشرک ہے۔ اللہ تعالیٰ نے ان میں سے کسی قسم کا بھی شریک بنانے کی اجازت نہیں دی۔ ¤ ➋ {وَ لَوْ لَا كَلِمَةُ الْفَصْلِ لَقُضِيَ بَيْنَهُمْ:} یعنی یہ شرک اللہ کے غضب کو دعوت دینے والی ایسی جسارت ہے کہ اگر لوگوں کو مہلت دینے کا فیصلہ نہ ہوتا اور یہ طے نہ کر دیا گیا ہوتا کہ فیصلے قیامت کے دن ہوں گے تو دنیا ہی میں ان لوگوں پر عذاب آ جاتا جو اللہ کے دین کے مقابلے میں اپنی شریعت اور قانون بناتے ہیں، یا ایسی شریعت کو قبول کرکے شرک کا ارتکاب کرتے ہیں۔ ¤ ➌ { وَ اِنَّ الظّٰلِمِيْنَ لَهُمْ عَذَابٌ اَلِيْمٌ: ’’ الظّٰلِمِيْنَ ‘‘} میں الف لام عہد کا ہے، یعنی ان ظالموں کے لیے عذاب الیم ہے جو شرک کے ظلمِ عظیم کا ارتکاب کرتے ہیں اور وہ عذابِ الیم جہنم ہے جس میں ہمیشہ رہیں گے اور جنت ان پر ہمیشہ کے لیے حرام ہے، جیسا کہ فرمایا : « اِنَّهٗ مَنْ يُّشْرِكْ بِاللّٰهِ فَقَدْ حَرَّمَ اللّٰهُ عَلَيْهِ الْجَنَّةَ وَ مَاْوٰىهُ النَّارُ وَ مَا لِلظّٰلِممِيْنَ مِنْ اَنْصَارٍ» [ المائدۃ : ۷۲ ] ’’بے شک حقیقت یہ ہے کہ جو بھی اللہ کے ساتھ شریک بنائے سو یقینا اس پر اللہ نے جنت حرام کر دی اور اس کا ٹھکانا آگ ہے اور ظالموں کے لیے کوئی مدد کرنے والے نہیں۔ ‘‘"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {تَرَى الظّٰلِمِيْنَ مُشْفِقِيْنَ مِمَّا كَسَبُوْا … : ’’ الظّٰلِمِيْنَ ‘‘} سے یہاں  بھی وہی ظالم یعنی کافر و مشرک مراد ہیں جن کا اوپر ذکر ہوا ہے، کیونکہ کوئی اسم معرف باللّام ہو کر دوبارہ آئے تو اس سے پہلا ہی مراد ہوتا ہے اور اس لیے کہ ان کے مقابلے میں ایمان اور عمل صالح والے لوگوں کا ذکر آ رہا ہے، یعنی {’’ وَ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ …۔‘‘} اس آیت میں قیامت کے دن ان مشرکین کی حالت کا نقشہ کھینچا ہے۔ عذاب سے پہلے اس کا شدید خوف بجائے خود ایک بڑا عذاب ہے، پھر ہر حال میں ان کے کفر و شرک کا وبال ان پر آ کر رہنے والا ہے، خواہ ڈریں یا نہ ڈریں۔ دنیا میں کفار قیامت سے بے خوف تھے اور اس کا مذاق اڑاتے تھے، جیسا کہ پیچھے گزرا ہے : «يَسْتَعْجِلُ بِهَا الَّذِيْنَ لَا يُؤْمِنُوْنَ بِهَا » [الشورٰی : ۱۸ ] ’’اسے وہ لوگ جلدی مانگتے ہیں جو اس پر ایمان نہیں رکھتے۔‘‘ قیامت کے دن وہی کافر سخت خوف زدہ ہوں گے۔ ان کے برعکس ایمان والے دنیا میں قیامت سے سخت خوف زدہ رہتے تھے، جیسا کہ پہلے گزرا ہے : « وَ الَّذِيْنَ اٰمَنُوْا مُشْفِقُوْنَ مِنْهَا» [ الشورٰی : ۱۷ ] ’’اور وہ لوگ جو ایمان لائے، وہ اس (قیامت) سے ڈرنے والے ہیں۔‘‘ سو اب وہ جنتوں کے باغوں میں بے خوف ہوں گے۔ ¤ ➋ {وَ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ فِيْ رَوْضٰتِ الْجَنّٰتِ …:’’رَوْضَةٌ‘‘} کا معنی ہے {’’الْمَوْضِعُ النَّزِهُ الْكَثِيْرُ الْخُضْرَةِ‘‘} کہ نہایت صاف ستھری اور بہت سرسبز جگہ۔ {’’ رَوْضٰتِ الْجَنّٰتِ ‘‘} سے ظاہر ہے کہ جنتیں بھی بہت سی ہیں اور روضات بھی بہت سے ہیں، یعنی (مومن کسی درجے کے بھی ہوں جنت میں ہوں گے، مگر) ایمان اور عمل صالح والے جنت کے بھی پاکیزہ ترین اور سب سے سرسبز مقامات میں ہوں گے۔ جن میں سب سے عالی مقام رسول کریم صلی اللہ علیہ وسلم کا ہو گا، جیسا کہ سمرہ بن جندب رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم سے ایک طویل خواب روایت کیا ہے، جس میں ہے کہ دو فرشتوں نے پہلے آپ صلی اللہ علیہ وسلم کو مختلف گناہوں کے عذاب کا منظر دکھایا، اس کے بعد ان دونوں نے آپ صلی اللہ علیہ وسلم کو آگے چلنے کے لیے کہا، آپ صلی اللہ علیہ وسلم نے فرمایا : [ فَانْطَلَقْنَا حَتَّی انْتَهَيْنَا إِلٰی رَوْضضَةٍ خَضْرَاءَ، فِيْهَا شَجَرَةٌ عَظِيْمَةٌ، وَ فِيْ أَصْلِهَا شَيْخٌ وَصِبْيَانٌ، وَإِذَا رَجُلٌ قَرِيْبٌ مِنَ الشَّجَرَةِ بَيْنَ يَدَيْهِ نَارٌ يُوْقِدُهَا، فَصَعِدَا بِيْ فِي الشَّجَرَةِ، وَ أَدْخَلاَنِيْ دَارًا لَمْ أَرَ قَطُّ أَحْسَنَ مِنْهَا، فِيْهَا رِجَالٌ شُيُوْخٌ وَشَبَابٌ، وَ نِسَاءٌ وَصِبْيَانٌ، ثُمَّ أَخْرَجَانِيْ مِنْهَا فَصَعِدَا بِي الشَّجَرَةَ فَأَدْخَلاَنِيْ دَارًا هِييَ أَحْسَنُ وَ أَفْضَلُ، فِيْهَا شُيُوْخٌ وَ شَبَابٌ، فَقُلْتُ طَوَّفْتُمَانِي اللَّيْلَةَ، فَأَخْبِرَانِيْ عَمَّا رَأَيْتُ ؟ قَالاَ نَعَمْ، فَذَكَرَ الْحَدِيْثَ حَتّٰی قَالَ وَوَالشَّيْخُ فِيْ أَصْلِ الشَّجَرَةِ إِبْرَاهِيْمُ عَلَيْهِ السَّلاَمُ وَالصِّبْيَانُ حَوْلَهُ فَأَوْلاَدُ النَّاسِ، وَالَّذِيْ يُوْقِدُ النَّارَ مَالِكٌ خَازِنُ النَّارِ، وَالدَّارُ الْأُوْلَی الَّتِيْ دَخَلْتَ، دَارُ عَامَّةِ الْمُؤْمِنِيْنَ، وَأَمَّا هٰذِهِ الدَّارُ، فَدَارُ الشُّهَدَاءِ، وَ أَنَا جِبْرِيْلُ، وَ هٰذَا مِيْكَاءِيْلُ، فَارْفَعْ رَأْسَكَ، فَرَفَعْتُ رَأْسِيْ، ففَإِذَا فَوْقِيْ مِثْلُ السَّحَابِ، قَالاَ ذَاكَ مَنْزِلُكَ، قُلْتُ دَعَانِيْ أَدْخُلْ مَنْزِلِيْ، قَالاَ إِنَّهُ بَقِيَ لَكَ عُمُرٌ لَمْ تَسْتَكْمِلْهُ، فَلَوِ اسْتَكْمَلْتَ أَتَيْتَ مَننْزِلَكَ ] [بخاري، الجنائز، باب ما قیل في أولاد المشرکین : ۱۳۸۶ ] ’’پھر ہم چل پڑے یہاں تک کہ ہم ایک سر سبز روضہ (باغ) میں پہنچے جس میں ایک بہت بڑا درخت تھا، اس کی جڑ (تنے) کے پاس ایک بزرگ اور کچھ بچے تھے اور اس درخت کے قریب ایک آدمی تھا جس کے سامنے آگ تھی، جسے وہ بھڑکا رہا تھا، پھر وہ دونوں مجھے لے کر درخت پر چڑھ گئے اور مجھے ایک ایسے گھر کے اندر لے گئے جس سے خوبصورت گھر میں نے نہیں دیکھا، اس میں کچھ بزرگ اور جوان آدمی اور عورتیں اور بچے تھے، پھر انھوں نے مجھے اس گھر سے نکالا اور مجھے لے کر اس درخت کے اور اوپر چڑھے اور ایک گھر کے اندر لے گئے جو پہلے سے زیادہ خوبصورت اور برتر تھا، اس میں کچھ بزرگ تھے اور کچھ جوان۔ میں نے کہا : ’’تم دونوں نے آج رات مجھے خوب گھمایا ہے، اب جو کچھ میں نے دیکھا ہے مجھے اس کی حقیقت بتاؤ؟‘‘ تو انھوں نے کہا : ’’ہاں، ٹھیک ہے (پھر انھوں نے عذاب والے مناظر کی حقیقت بتانے کے بعد کہا) اور درخت کی جڑ کے پاس جو بزرگ تھے وہ ابراہیم علیہ السلام تھے اور ان کے اردگرد بچے لوگوں کی اولاد تھے اور جو آگ بھڑکا رہا تھا وہ آگ کا خازن مالک تھا اور پہلا گھر جس میں آپ داخل ہوئے عام ایمان والوں کا گھر تھا۔ رہا یہ گھر تو یہ شہداء کا گھر ہے اور میں جبریل ہوں اور یہ میکائیل ہے، اب سر اٹھاؤ!‘‘ میں نے سر اٹھایا تو اچانک میرے اوپر بادل کی طرح کی چیز تھی۔ دونوں نے کہا : ’’وہ تمھارا گھر ہے۔‘‘ میں نے کہا : ’’مجھے چھوڑو میں اپنے گھر جاؤں۔‘‘ انھوں نے کہا : ’’آپ کی کچھ عمر باقی ہے جو آپ نے پوری نہیں کی، اگر پوری کر لو گے تو اپنے گھر میں آ جاؤ گے۔‘‘ اس حدیث سے {’’ رَوْضٰتِ الْجَنّٰتِ ‘‘} کا مفہوم بھی اچھی طرح سمجھ میں آ جاتا ہے اور یہ بھی کہ {’’ رَوْضٰتِ الْجَنّٰتِ ‘‘} میں سب سے اعلیٰ {’’رَوْضَةُ الْجَنَّةِ‘‘} ہمارے نبی کریم صلی اللہ علیہ وسلم کے لیے خاص ہے۔ ¤ ➌ ان آیات میں متعدد وجہوں سے مومنوں کو ملنے والے ثواب کی عظمت بیان کی گئی ہے، ایک یہ کہ وہ {’’ رَوْضٰتِ الْجَنّٰتِ ‘‘} میں ہوں گے، دوسری یہ کہ {’’ لَهُمْ مَّا يَشَآءُوْنَ ‘‘} یعنی انھیں وہاں جو چاہیں گے ملے گا۔ اس سے معلوم ہوا کہ انھیں حاصل ہونے والی نعمتوں کی انتہا نہیں ہو گی، کیونکہ آدمی ہر نعمت کے بعد اس سے اعلیٰ نعمت کا خواہش مند ہوتا ہے۔ تیسری {’’ عِنْدَ رَبِّهِمْ ‘‘} کہ ان کی رہائش گاہیں ان کے رب کے پڑوس میں ہوں گی۔ یہ وہ چیز ہے جس کی دعا فرعون کی بیوی نے کی تھی : « رَبِّ ابْنِ لِيْ عِنْدَكَ بَيْتًا فِي الْجَنَّةِ » [ التحریم : ۱۱ ] ’’اے میرے رب! میرے لیے اپنے پاس جنت میں ایک گھر بنا۔‘‘ چوتھی یہ کہ انھیں عطا ہونے والی نعمتوں کو اللہ تعالیٰ نے فضل کبیر قرار دیا ہے، فرمایا : «ذٰلِكَ هُوَ الْفَضْلُ الْكَبِيْرُ » پھر جسے اللہ تعالیٰ اکبر اور کبیر قرار دے اس کی عظمت کا کیا ٹھکانا ہو گا۔ پانچویں وجہ سے انھیں ملنے والے ثواب کی عظمت کا بیان اگلی آیت میں ہے۔ ¤ ➍ { ذٰلِكَ هُوَ الْفَضْلُ الْكَبِيْرُ:} اس سے معلوم ہوا کہ جنت محض اللہ تعالیٰ کا فضل ہے، اس پر کسی کا حق واجب نہیں۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ { ذٰلِكَ الَّذِيْ يُبَشِّرُ اللّٰهُ عِبَادَهُ … :} یہ پانچویں وجہ ہے۔ {’’ ذٰلِكَ ‘‘} اسم اشارہ بعید اس ثواب کی عظمت کے بیان کے لیے ہے۔ جنتوں کے باغوں اور ان کی نعمتوں کی طرف اشارہ کرکے ان کی طرف دوبارہ توجہ دلانے سے مقصود ان کی عظمت کا اظہار ہے اور ساتھ ہی ایمان اور عملِ صالح کا ذکر اس لیے ہے کہ اتنی بڑی نعمتوں کے حصول کے لیے ایمان اور عمل صالح ضروری ہے۔ ¤ ➋ { قُلْ لَّاۤ اَسْـَٔلُكُمْ عَلَيْهِ اَجْرًا اِلَّا الْمَوَدَّةَ فِي الْقُرْبٰى:’’ قَرِبَ يَقْرَبُ قُرْبًا وَ قُرْبَانًا وَ قِرْبَانًا‘‘} (س، ک) قریب ہونا۔ {’’ قُرْبٰي‘‘} اور {’’قَرَابَةً ‘‘} بھی مصدر ہیں، جیسے {’’ بُشْرٰي‘‘} اور {’’ رُجْعٰي‘‘} ہیں۔ ان کا معنی رشتہ داری اور قرابت ہے۔ رشتہ دار اور قرابت دار کے لیے ’’ذوالقربیٰ‘‘ (قرابت والا) کا لفظ استعمال ہوتا ہے، جیسا کہ فرمایا : « وَ اٰتِ ذَا الْقُرْبٰى حَقَّهٗ » [ بنی إسرائیل : ۲۶ ] ’’اور رشتہ دار کو اس کا حق دے۔‘‘ {’’ فِي الْقُرْبٰى ‘‘} میں {’’ فِيْ‘‘} تعلیل کے لیے ہے : {’’أَيْ مِنْ أَجْلِ الْقُرْبٰي‘‘} یعنی رشتہ داری کی وجہ سے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ عُذِّبَتِ امْرَأَةٌ فِيْ هِرَّةٍ حَبَسَتْهَا، حَتّٰی مَاتَتْ جُوْعًا، فَدَخَلَتْ فِيْهَا النَّارَ ] [ بخاري، المساقاۃ، باب فضل سقي الماء : ۲۳۶۵ ] ’’ایک عورت کو ایک بلی کی وجہ سے عذاب دیا گیا۔ اس نے اسے باندھ کر رکھا، یہاں تک کہ وہ بھوک سے مر گئی، تو اس کی وجہ سے وہ آگ میں داخل ہو گئی۔‘‘ یعنی آپ کہہ دیں کہ میں اس تبلیغِ دین پر تم سے کوئی مزدوری نہیں مانگتا، سوائے رشتہ داری کی وجہ سے دوستی کے کہ کچھ نہ سہی، کم از کم میرے اور تمھارے درمیان جو قرابت اور رشتہ داری ہے اس کی وجہ سے میرا حق ہے کہ مجھ سے دوستی رکھو، اس حق کا مطالبہ میں تم سے ضرور کرتا ہوں۔ چاہیے تو یہ تھا کہ تم میری بات مان لیتے، اگر نہیں مانتے تو سارے عرب میں سب سے بڑھ کر دشمنی تو نہ کرو۔ کم از کم اس قرابت کا تو خیال رکھو جو میرے اور تمھارے درمیان ہے۔ جیسا کہ ابوطالب اگرچہ ایمان نہیں لایا مگر وہ قرابت کی وجہ سے رسول اللہ صلی اللہ علیہ وسلم کی حمایت اور آپ صلی اللہ علیہ وسلم کا دفاع کرتا رہا۔ ¤ آیت کا یہی مطلب ترجمان القرآن ابن عباس رضی اللہ عنھما نے بیان فرمایا ہے۔ چنانچہ طاؤس فرماتے ہیں کہ ابن عباس رضی اللہ عنھما سے {’’ اِلَّا الْمَوَدَّةَ فِي الْقُرْبٰى ‘‘} کے متعلق سوال کیا گیا تو سعید بن جبیر کہنے لگے کہ اس سے مراد {’’ قُرْبٰي آلِ مُحَمَّدٍ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ‘‘} (آل محمد صلی اللہ علیہ وسلم کی قرابت) ہے، تو ابن عباس رضی اللہ عنھما نے فرمایا : [ عَجِلْتَ، إِنَّ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ بَطْنٌ مِنْ قُرَيْشٍ إِلاَّ كَانَ لَهُ فِيْههِمْ قَرَابَةٌ فَقَالَ إِلاَّ أَنْ تَصِلُوْا مَا بَيْنِيْ وَ بَيْنَكُمْ مِنَ الْقَرَابَةِ ] [ بخاري، التفسیر، باب قولہ : «إلا المودۃ فی القربٰی» : ۴۸۱۸ ] ’’تم نے جلدی کی، قریش کا کوئی خاندان ایسا نہ تھا جس میں نبی صلی اللہ علیہ وسلم کی قرابت اور رشتہ داری نہ ہو، تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’(میں تم سے اس پر کسی مزدوری کا سوال نہیں کرتا) مگر یہ کہ تم اس رشتہ داری کو ملاؤ جو میرے اور تمھارے درمیان ہے۔‘‘ ¤ ➌ بعض لوگ خصوصاً شیعہ اس آیت کا یہ مطلب بیان کرتے ہیں کہ آپ کہہ دیں کہ میں تم سے اس پر کسی مزدوری کا سوال نہیں کرتا مگر قرابت والوں سے دوستی کا، یعنی میں تم سے اس پر اس کے سوا کچھ نہیں مانگتا کہ تم میرے قرابت داروں سے دوستی رکھو۔ نبی کریم صلی اللہ علیہ وسلم کے مومن قرابت داروں سے دوستی اپنی جگہ مسلمہ ہے، جو دوسرے دلائل سے ثابت ہے، مگر اس آیت کا وہ مطلب ہر گز نہیں جو ان لوگوں نے بیان کیا ہے، کیونکہ {’’ الْقُرْبٰى ‘‘} کا معنی رشتہ داری ہے، رشتہ دار نہیں۔ رشتہ داروں کے لیے {’’ذَوِي الْقُرْبٰي‘‘} کا لفظ آتا ہے۔ اگر {’’ الْقُرْبٰى ‘‘} کا معنی رشتہ دار ہو بھی تو آیت کے الفاظ یہ ہونے چاہییں : {’’ إِلاَّ مَوَدَّةَ الْقُرْبٰي‘‘} ’’مگر رشتہ داروں کی دوستی کا۔‘‘ جب کہ الفاظ ہیں : « اِلَّا الْمَوَدَّةَ فِي الْقُرْبٰى » ان الفاظ کا وہ معنی ہو ہی نہیں سکتا جو یہ حضرات بیان کرتے ہیں۔ پھر دیکھیں کہ آپ صلی اللہ علیہ وسلم یہ سوال کن لوگوں سے کر رہے ہیں، ظاہر ہے کفار سے کر رہے ہیں جو آپ کے شدید مخالف تھے، جو آپ سے بھی دوستی کے روا دار نہیں تھے، آیا ممکن بھی ہے کہ آپ ان سے کہیں کہ میرے رشتہ داروں سے دوستی کرو۔ اگر مان بھی لیں کہ آپ ان سے اپنے رشتہ داروں کے ساتھ دوستی کا سوال کر رہے ہیں تو وہ رشتے دار کون سے ہیں؟ کیا آپ صلی اللہ علیہ وسلم اپنے پورے قبیلۂ قریش کے ساتھ دوستی کا سوال کر رہے ہیں یا اپنے قریب ترین خاندان بنو عبد المطلب کے ساتھ؟ دونوں میں مخلص مسلمانوں کے علاوہ ابوجہل اور ابو لہب جیسے آپ کے بدترین دشمن بھی موجود تھے، جن کے ساتھ دوستی کا سوال ہی پیدا نہیں ہوتا۔ اور اگر اس سے مراد علی و فاطمہ اور حسن و حسین رضی اللہ عنھم ہیں، جیسا کہ شیعہ حضرات کہتے ہیں تو یہ سورت مکی ہے اور مکہ میں فاطمہ اور علی رضی اللہ عنھما کا نکاح تک نہیں ہوا تھا اور نہ ہی حسن و حسین رضی اللہ عنھما پیدا ہوئے تھے، لہٰذا اس سے یہ لوگ مراد ہو ہی نہیں سکتے۔ ¤ ➍ بعض مفسرین نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم کا یہ کہنا کہ میں تم سے صرف رشتہ داری کی وجہ سے دوستی کا سوال کرتا ہوں، یہ دین کی تبلیغ کی اجرت یا مزدوری نہیں جو آپ ان سے مانگ رہے ہیں، بلکہ آپ اپنے اس حق کا مطالبہ کر رہے ہیں جو تمام دنیا کے ہاں مسلم ہے، خواہ آپ تبلیغ کریں یا نہ کریں۔ غرض اس آیت میں بھی وہی بات بیان ہوئی ہے جو تمام انبیاء نے اپنی اپنی قوم سے کہی کہ میں تم سے اس تبلیغ دین پر کسی قسم کی مزدوری کا سوال نہیں کرتا، کیونکہ میری مزدوری صرف اللہ تعالیٰ کے ذمے ہے، جیسا کہ سورۂ شعراء میں ہے : « وَ مَاۤ اَسْـَٔلُكُمْ عَلَيْهِ مِنْ اَجْرٍ اِنْ اَجْرِيَ اِلَّا عَلٰى رَبِّ الْعٰلَمِيْنَ » [ الشعراء : ۱۰۹ ] ’’اور میں اس پر تم سے کسی اجرت کا سوال نہیں کرتا، میری اجرت تو رب العالمین ہی کے ذمے ہے۔ ‘‘ قواعدِ نحو میں یہ بات ان الفاظ میں بیان کی جائے گی کہ یہاں استثنا متصل نہیں منقطع ہے، یعنی صلہ رحمی کے سوال کا تبلیغِ دین پر اجرت سے کوئی تعلق نہیں۔ ¤ ➎ { وَ مَنْ يَّقْتَرِفْ حَسَنَةً نَّزِدْ لَهٗ فِيْهَا حُسْنًا: ’’ حَسَنَةً ‘‘} میں تنوین تنکیر کے لیے ہے۔ جو شخص کوئی بھلائی کرے گا، خواہ کتنی معمولی ہو، ہم اس کے لیے اس کے حسن و خوبی میں اضافہ کر دیں گے۔ یہ اضافہ کئی طرح سے ہے، ایک تو وہ جتنی نیکی کرے گا اللہ تعالیٰ اسے اس سے زیادہ نیکی کی توفیق دے گا۔ دوسرا جو لوگ اسے دیکھ کر وہ نیکی کریں گے ان سب کے اجر اسے بھی ملیں گے جس سے اس کی نیکی میں اضافہ ہو گا۔ تیسرا اللہ تعالیٰ ہر نیکی کو دس گنا سے سات سو گنا بلکہ شمار سے زیادہ تک بڑھا دیتا ہے، جیسا کہ فرمایا : « وَ اِنْ تَكُ حَسَنَةً يُّضٰعِفْهَا وَ يُؤْتِ مِنْ لَّدُنْهُ اَجْرًا عَظِيْمًا » [ النساء : ۴۰ ] ’’اگر ایک نیکی ہوگی تو وہ اسے کئی گنا کر دے گا اور اپنے پاس سے بہت بڑا اجر عطا کرے گا۔ ‘‘ چوتھا یہ کہ نیکیوں کے ساتھ گناہ معاف ہوتے ہیں، فرمایا : « اِنَّ الْحَسَنٰتِ يُذْهِبْنَ السَّيِّاٰتِ » [ ھود : ۱۱۴ ] ’’بے شک نیکیاں برائیوں کو لے جاتی ہیں۔‘‘ ¤ ➏ {اِنَّ اللّٰهَ غَفُوْرٌ شَكُوْرٌ: ’’ اِنَّ ‘‘} تعلیل کے لیے آتا ہے، یعنی نیکی کرنے والے کی نیکی میں ہم اضافہ اس لیے کرتے ہیں کہ اللہ تعالیٰ گناہوں پر بہت پردہ ڈالنے والا اور نیک عمل کی بے حد قدر کرنے والا ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { اَمْ يَقُوْلُوْنَ افْتَرٰى عَلَى اللّٰهِ كَذِبًا: ’’ اَمْ‘‘} کے لفظ سے پہلے ایک جملہ ظاہر یا مقدر ہوتا ہے جو ہمزہ استفہام سے شروع ہوتا ہے۔ یہاں یہ بات واضح کرنے کے بعد کہ تمھیں دین کی دعوت دینے سے مقصود سراسر تمھارا فائدہ اور تمھاری نجات ہے، اس میں تم سے میری کوئی ذاتی غرض نہیں، نہ ہی میں اس پر تم سے کسی مزدوری کا سوال کرتا ہوں۔ ہاں یہ ضرور کہتا ہوں کہ کم از کم رشتہ داری کی وجہ سے میرا دوستی کا حق تو ادا کرو۔ اس سے آگے اس مفہوم کی عبارت مقدر مانی جائے گی کہ آیا وہ یہ دعوت قبول کرتے ہوئے آپ پر ایمان لاتے ہیں {’’ اَمْ يَقُوْلُوْنَ افْتَرٰى ‘‘} یا ضد اور عناد پر قائم رہ کر یہی بات کہے جاتے ہیں کہ اس نے اللہ تعالیٰ پر جھوٹ باندھا ہے۔ ¤ ➋ { فَاِنْ يَّشَاِ اللّٰهُ يَخْتِمْ عَلٰى قَلْبِكَ:} مفسرین نے اس کی تفسیر کئی طرح سے کی ہے، زیادہ واضح دو تفسیریں یہاں درج کی جاتی ہیں۔ ابن کثیر رحمہ اللہ نے فرمایا : ’’اگر تو نے اللہ پر جھوٹ باندھا ہو، جیسا کہ یہ جاہل کہہ رہے ہیں تو اگر وہ چاہے تو {’’ يَخْتِمْ عَلٰى قَلْبِكَ ‘‘} وہ تیرے دل پر مہر لگا دے اور جتنا قرآن تجھے عطا کیا ہے وہ تجھ سے سلب کر لے، جیسا کہ اس کا ارشاد ہے : « وَ لَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْاَقَاوِيْل (44) لَاَخَذْنَا مِنْهُ بِالْيَمِيْنِ (45) ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِيْنَ (46) فَمَا مِنْكُمْ مِّنْ اَحَدٍ عَنْهُ حٰجِزِيْنَ » [ الحاقۃ : ۴۴ تا ۴۷ ] ’’اور اگر وہ ہم پر کوئی بات بنا کر لگا دیتا۔ تو یقینا ہم اس کو دائیں ہاتھ سے پکڑتے۔ پھر یقینا ہم اس کی جان کی رگ کاٹ دیتے۔ پھر تم میں سے کوئی بھی( ہمیں) اس سے روکنے والا نہ ہوتا۔ ‘‘ یعنی ہم اس سے شدید ترین انتقام لیں اور کوئی شخص اسے بچا نہ سکے۔ (ابن کثیر) مزید تفصیل سورۂ حاقہ کی تفسیر میں ملاحظہ فرمائیں۔ مفسر قاسمی نے فرمایا : ’’یہ قرآنی آیات کی تفسیر قرآن کی آیات کے ساتھ ہے، جہاں ممکن ہو یہ تفسیر سب سے بہتر ہوتی ہے، کیونکہ قرآنی آیات ایک دوسری کی تفسیر کرتی ہیں۔ اس مفہوم کے مطابق آیت کا مآل جیسا کہ ابو السعود نے وضاحت فرمائی کفار کی بات کی تردید ہے، یعنی اگر آپ صلی اللہ علیہ وسلم اللہ تعالیٰ پر جھوٹ گھڑ تے تو اللہ آپ کو ہر حال میں اس سے روک دیتا اور آپ کے دل پر ایسی مہر لگاتا کہ نہ آپ کی زبان پر وحی کا کوئی لفظ آتا اور نہ آپ کے دل میں اس کا کوئی مفہوم آتا، جب ایسا نہیں ہوا بلکہ وحی تواتر کے ساتھ جاری رہی تو ثابت ہو گیا کہ وہ اللہ ہی کی طرف سے ہے۔‘‘ ¤ دوسری تفسیر مفسر شہاب کے الفاظ میں یہ ہے : ’’اس کا مطلب یہ ہے کہ اگر اللہ چاہے تو تیرے دل پر مہر لگا دے، جیسے اس نے ان (بہتان لگانے والے کافروں) کے دلوں پر مہر لگا دی ہے۔ اس میں آپ صلی اللہ علیہ وسلم کو تسلی دلائی ہے اور آپ پر اپنا احسان و اکرام یاد دلایا ہے (کہ اس نے آپ کے دل پر مہر نہیں لگائی) تاکہ آپ اس کی وجہ سے شکر ادا کریں اور ان لوگوں کے حال پر ترس کھائیں جن کے دل پر اللہ تعالیٰ نے مہر لگا دی اور وہ اپنے رب کے غضب کے حق دار بن گئے۔ اگر ایسا نہ ہوتا تو وہ کبھی یہ جرأت نہ کرتے کہ آپ پر یہ بہتان باندھیں کہ آپ نے اللہ تعالیٰ پر جھوٹ گھڑا ہے۔ خلاصہ یہ کہ اگر ان پر گمراہی کی مہر نہ لگ گئی ہوتی تو وہ یہ محال بات کہنے کی جرأت نہ کرتے۔‘‘ (منقول از قاسمی) ¤ ➌ {وَ يَمْحُ اللّٰهُ الْبَاطِلَ … : ’’ يَمْحُ ‘‘} اصل میں {’’ يَمْحُوْ ‘‘} ہے۔ اس کا عطف {’’ يَخْتِمْ ‘‘} پر نہیں اور نہ ہی حالت جزم میں ہونے کی وجہ سے اس کی ’’واؤ‘‘ گری ہے، بلکہ یہ نیا جملہ ہے اور رفعی حالت میں ہونے کی وجہ سے ’’واؤ‘‘ اپنی جگہ قائم ہے۔ صحابہ کرام رضی اللہ عنھم کے رسم الخط میں یہاں ’’واؤ‘‘ نہیں لکھی گئی، کیونکہ بعض مقامات پر پڑھنے میں جو حروف نہیں آتے تھے انھوں نے وہ لکھنے میں بھی حذف کر دیے ہیں، جیسا کہ سورۂ بنی اسرائیل کی آیت (۱۱) : « وَ يَدْعُ الْاِنْسَانُ بِالشَّرِّ دُعَآءَهٗ بِالْخَيْرِ » اور سورۂ علق کی آیت (۱۸) : «سَنَدْعُ الزَّبَانِيَةَ » میں ’’واؤ‘‘ نہیں لکھی گئی۔ مسلمانوں نے بعد میں قرآن مجید کے لیے اسی رسم الخط کو محفوظ رکھا۔ بعض اہلِ علم نے {’’ يَمْحُ ‘‘} کی واؤ حذف کرنے میں یہ نکتہ نکالا ہے کہ باطل کو مٹانے اور محو کرنے میں مبالغے کے اظہار کے لیے {’’ يَمْحُوْ ‘‘} کی ’’واؤ‘‘ کو بھی محو کر دیا ہے۔ ¤ ➍ یعنی اللہ تعالیٰ کا دستور ہے کہ وہ باطل کو مٹاتا ہے اور حق کو اپنے کلمات کے ساتھ ثابت کر دیتا ہے، تو یہ کیسے ہو سکتا ہے کہ آپ اللہ پر جھوٹ گھڑیں اور اللہ تعالیٰ اسے نہ مٹائے، بلکہ آپ کو ہر قدم پر اپنی فتح و نصرت کے ساتھ نوازتا جائے۔ یہ دلیل ہے کہ آپ حق لے کر آئے ہیں اور وہ شخص بدترین بہتان باز ہے جو کہتا ہے کہ آپ نے اللہ پر جھوٹ گھڑا ہے۔ ¤ ➎ { اِنَّهٗ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ:} یعنی اسے سینوں میں چھپی ہوئی نیتوں اور ارادوں کا خوب علم ہے، وہ اپنی رسالت کے ساتھ کبھی بھی بدطینت و جھوٹ گھڑنے والوں کو نہیں نوازتا، جیسا کہ فرمایا : « اَللّٰهُ اَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهٗ » [ الأنعام : ۱۲۴ ]’’اللہ زیادہ جاننے والا ہے جہاں وہ اپنی رسالت رکھتا ہے۔‘‘ اس نے اپنے کامل علم ہی کی بنا پر آپ کو اس منصب کے لیے منتخب فرمایا ہے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {فَانْتَقَمْنَا مِنْهُمْ فَانْظُرْ كَيْفَ … :} یعنی جب وہ ضد اور عناد میں اس حد تک پہنچ گئے کہ رسولوں کی بات حق بھی ہے تو ہم ماننے والے نہیں، تو ہم نے ان سے انتقام لیا، پھر دیکھو ان جھٹلانے والوں کا انجام کیسا ہوا۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 27،26) ➊ {وَ اِذْ قَالَ اِبْرٰهِيْمُ لِاَبِيْهِ وَ قَوْمِهٖۤ … :} یہاں ابراہیم علیہ السلام کے قصے کی مناسبت یہ ہے کہ قریش اور قومِ عرب سے کہا جا رہا ہے کہ تمھارے پیشوا اور جد امجد نے باپ کی راہ غلط دیکھ کر چھوڑ دی تھی، تم بھی ایسا ہی کرو۔ ¤ ➋ {اِنَّنِيْ بَرَآءٌ مِّمَّا تَعْبُدُوْنَ … : ’’ بَرَآءٌ ‘‘} مصدر ہے، واحد، تثنیہ، جمع اور مذکر و مؤنث کے لیے یہی لفظ استعمال ہوتا ہے، جو {’’ بَرِيْءٌ‘‘} کے معنی میں ہے، مگر اس میں مبالغہ ہے، جیسے {’’ زَيْدٌ عَادِلٌ ‘‘} میں وہ زور نہیں جو {’’ زَيْدٌ عَدْلٌ ‘‘} (زید اتنا عادل ہے کہ سراپا عدل ہے) میں ہے۔ مطلب یہ ہے کہ ابراہیم علیہ السلام نے اپنے باپ اور اپنی قوم سے کہا کہ میں تمھارے تمام معبودوں سے سراپا براء ت ہوں، دل، زبان اور عمل کے ساتھ۔ غرض ہر طرح سے ان سے براء ت کا اعلان کرتا ہوں، سوائے اس معبود کے جس نے مجھے پیدا کیا ۔ ¤ ➌ {اِلَّا الَّذِيْ فَطَرَنِيْ:} اپنے اس کلام میں ابراہیم علیہ السلام نے صرف اللہ واحد کی عبادت کی دلیل بھی بیان فرمائی ہے۔ وہ ہے : « اِلَّا الَّذِيْ فَطَرَنِيْ» ’’جس نے مجھے پیدا کیا۔‘‘ یعنی عبادت اسی کا حق ہے جو پیدا کرنے والا ہے۔ یہاں ابراہیم علیہ السلام کے اللہ کے سوا تمام معبودوں سے اعلانِ براء ت کا ذکر ہے، دوسرے مقامات پر براء ت کے علاوہ ان سے عداوت کا بھی اعلان ہے اور تقریباً ہر جگہ اللہ تعالیٰ کے خالق ہونے کی صفت کا خاص طور پر ذکر فرمایا ہے۔ (دیکھیے شععراء : ۷۵ تا ۷۸۔ انعام : ۷۸، ۷۹) سورۂ ممتحنہ (۴) میں باطل معبودوں کے ساتھ ان کے پجاریوں سے بھی براء ت و انکار کے علاوہ کھلم کھلا بغض و عداوت کا اعلان ہے، جب تک وہ اکیلے اللہ پر ایمان نہ لائیں۔ ¤ ➍ { فَاِنَّهٗ سَيَهْدِيْنِ:} سورۂ شعراء میں ابراہیم علیہ السلام کا قول ہے : « الَّذِيْ خَلَقَنِيْ فَهُوَ يَهْدِيْنِ» [ الشعراء : ۷۸ ] ’’وہ جس نے مجھے پیدا کیا، پھر وہی مجھے راستہ دکھاتا (اور اس پر چلاتا) ہے۔‘‘ یہاں فرمایا : «فَاِنَّهٗ سَيَهْدِيْنِ » یعنی جس نے مجھے پیدا کیا آئندہ بھی وہی مجھے سیدھی راہ پر چلاتے ہوئے منزل مقصود تک پہنچائے گا۔ یعنی ہدایت بھی اسی کے ہاتھ میں ہے جس کے ہاتھ میں خلق ہے۔ مزید دیکھیے سورۂ انعام (۷۷)، شعراء (۷۸) اور صافات (۹۹)۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27،26) ➊ {وَ اِذْ قَالَ اِبْرٰهِيْمُ لِاَبِيْهِ وَ قَوْمِهٖۤ … :} یہاں ابراہیم علیہ السلام کے قصے کی مناسبت یہ ہے کہ قریش اور قومِ عرب سے کہا جا رہا ہے کہ تمھارے پیشوا اور جد امجد نے باپ کی راہ غلط دیکھ کر چھوڑ دی تھی، تم بھی ایسا ہی کرو۔ ¤ ➋ {اِنَّنِيْ بَرَآءٌ مِّمَّا تَعْبُدُوْنَ … : ’’ بَرَآءٌ ‘‘} مصدر ہے، واحد، تثنیہ، جمع اور مذکر و مؤنث کے لیے یہی لفظ استعمال ہوتا ہے، جو {’’ بَرِيْءٌ‘‘} کے معنی میں ہے، مگر اس میں مبالغہ ہے، جیسے {’’ زَيْدٌ عَادِلٌ ‘‘} میں وہ زور نہیں جو {’’ زَيْدٌ عَدْلٌ ‘‘} (زید اتنا عادل ہے کہ سراپا عدل ہے) میں ہے۔ مطلب یہ ہے کہ ابراہیم علیہ السلام نے اپنے باپ اور اپنی قوم سے کہا کہ میں تمھارے تمام معبودوں سے سراپا براء ت ہوں، دل، زبان اور عمل کے ساتھ۔ غرض ہر طرح سے ان سے براء ت کا اعلان کرتا ہوں، سوائے اس معبود کے جس نے مجھے پیدا کیا ۔ ¤ ➌ {اِلَّا الَّذِيْ فَطَرَنِيْ:} اپنے اس کلام میں ابراہیم علیہ السلام نے صرف اللہ واحد کی عبادت کی دلیل بھی بیان فرمائی ہے۔ وہ ہے : « اِلَّا الَّذِيْ فَطَرَنِيْ» ’’جس نے مجھے پیدا کیا۔‘‘ یعنی عبادت اسی کا حق ہے جو پیدا کرنے والا ہے۔ یہاں ابراہیم علیہ السلام کے اللہ کے سوا تمام معبودوں سے اعلانِ براء ت کا ذکر ہے، دوسرے مقامات پر براء ت کے علاوہ ان سے عداوت کا بھی اعلان ہے اور تقریباً ہر جگہ اللہ تعالیٰ کے خالق ہونے کی صفت کا خاص طور پر ذکر فرمایا ہے۔ (دیکھیے شععراء : ۷۵ تا ۷۸۔ انعام : ۷۸، ۷۹) سورۂ ممتحنہ (۴) میں باطل معبودوں کے ساتھ ان کے پجاریوں سے بھی براء ت و انکار کے علاوہ کھلم کھلا بغض و عداوت کا اعلان ہے، جب تک وہ اکیلے اللہ پر ایمان نہ لائیں۔ ¤ ➍ { فَاِنَّهٗ سَيَهْدِيْنِ:} سورۂ شعراء میں ابراہیم علیہ السلام کا قول ہے : « الَّذِيْ خَلَقَنِيْ فَهُوَ يَهْدِيْنِ» [ الشعراء : ۷۸ ] ’’وہ جس نے مجھے پیدا کیا، پھر وہی مجھے راستہ دکھاتا (اور اس پر چلاتا) ہے۔‘‘ یہاں فرمایا : «فَاِنَّهٗ سَيَهْدِيْنِ » یعنی جس نے مجھے پیدا کیا آئندہ بھی وہی مجھے سیدھی راہ پر چلاتے ہوئے منزل مقصود تک پہنچائے گا۔ یعنی ہدایت بھی اسی کے ہاتھ میں ہے جس کے ہاتھ میں خلق ہے۔ مزید دیکھیے سورۂ انعام (۷۷)، شعراء (۷۸) اور صافات (۹۹)۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ {وَ جَعَلَهَا كَلِمَةً: ’’ جَعَلَهَا ‘‘} میں ضمیر {’’هَا‘‘} سے مراد کلمۂ توحید {’’ لَا إِلٰهَ إِلَّا اللّٰهُ ‘‘} ہے، کیونکہ {’’ اِنَّنِيْ بَرَآءٌ مِّمَّا تَعْبُدُوْنَ ‘‘} کا خلاصہ {’’ لَا إِلٰهَ ‘‘} ہے اور {’’ اِلَّا الَّذِيْ فَطَرَنِيْ ‘‘} کا خلاصہ {’’ إِلَّا اللّٰهُ ‘‘} ہے۔ ¤ ➋ { بَاقِيَةً فِيْ عَقِبِهٖ: ’’ جَعَلَهَا ‘‘} میں ضمیر فاعل سے مراد ابراہیم علیہ السلام بھی ہو سکتے ہیں اور اللہ تعالیٰ بھی۔ پہلی صورت میں مطلب یہ ہے کہ ابراہیم علیہ السلام نے اس کلمہ کو اپنی اولاد میں باقی رہنے والا بنا دیا۔ دو طرح سے، ایک تو انھوں نے اپنی اولاد کو اور ان کی اولاد نے اپنی اولاد کو اس کی وصیت کی، جیسا کہ فرمایا : « وَ وَصّٰى بِهَاۤ اِبْرٰهٖمُ بَنِيْهِ وَ يَعْقُوْبُ يٰبَنِيَّ اِنَّ اللّٰهَ اصْطَفٰى لَكُمُ الدِّيْنَ فَلَا تَمُوْتُنَّ اِلَّا وَ اَنْتُمْ مُّسْلِمُوْنَ» [ البقرۃ : ۱۳۲ ] ’’اور اسی کی وصیت ابراہیم نے اپنے بیٹوں کو کی اور یعقوب نے بھی کہ اے میرے بیٹو! بے شک اللہ نے تمھارے لیے یہ دین چن لیا ہے، تو تم ہرگز فوت نہ ہونا مگر اس حال میں کہ تم فرماں بردار ہو۔‘‘ دوسرے انھوں نے اللہ تعالیٰ سے اس بات کی دعا کی کہ یہ کلمہ ان کی اولاد میں باقی رہے، ان کی اولاد میں سے ایک امت مسلم یعنی اللہ کی فرماں بردار رہے، وہ بت پرستی سےے بچے رہیں، ایمان اور عمل صالح پر قائم رہیں اور ان میں انبیاء و رسل اور اس کلمے کی دعوت دینے والے موجود رہیں، جیسا کہ اللہ تعالیٰ نے فرمایا : « وَ اِذِ ابْتَلٰۤى اِبْرٰهٖمَ رَبُّهٗ بِكَلِمٰتٍ فَاَتَمَّهُنَّ قَاالَ اِنِّيْ جَاعِلُكَ لِلنَّاسِ اِمَامًا قَالَ وَ مِنْ ذُرِّييَّتِيْ قَالَ لَا يَنَالُ عَهْدِي الظّٰلِمِيْنَ» [ البقرۃ : ۱۲۴ ] ’’اور جب ابراہیم کو اس کے رب نے چند باتوں کے ساتھ آزمایا تو اس نے انھیں پورا کر دیا۔ فرمایا بے شک میں تجھے لوگوں کا امام بنانے والا ہوں۔ کہا اور میری اولاد میں سے بھی؟ فرمایا میرا عہد ظالموں کو نہیں پہنچتا۔‘‘ اور ابراہیم علیہ السلام نے دعا کی : «وَ اجْنُبْنِيْ وَ بَنِيَّ اَنْ نَّعْبُدَ الْاَصْنَامَ » [ إبراہیم : ۳۵ ] ’’اور مجھے اور میرے بیٹوں کو بچا کہ ہم بتوں کی عبادت کریں۔‘‘ اور دعا کی : « رَبِّ اجْعَلْنِيْ مُقِيْمَ الصَّلٰوةِ وَ مِنْ ذُرِّيَّتِيْ» [ إبراھیم : ۴۰ ] ’’اے میرے رب! مجھے نماز قائم کرنے والا بنا اور میری اولاد میں سے بھی۔‘‘ اور ابراہیم اور اسماعیل علیھما السلام نے دعا کی : «رَبَّنَا وَ اجْعَلْنَا مُسْلِمَيْنِ لَكَ وَ مِنْ ذُرِّيَّتِنَاۤ اُمَّةً  مُّسْلِمَةً لَّكَ » [ البقرۃ : ۱۲۸ ] ’’اے ہمارے رب! اور ہمیں اپنے لیے فرماں بردار بنا اور ہماری اولاد میں سے بھی ایک امت اپنے لیے فرماں بردار بنا۔‘‘ اور یہ دعا بھی کی : « رَبَّنَا وَ ابْعَثْ فِيْهِمْ رَسُوْلًا مِّنْهُمْ يَتْلُوْا عَلَيْهِمْ اٰيٰتِكَ وَ يُعَلِّمُهُمُ االْكِتٰبَ وَ الْحِكْمَةَ وَ يُزَكِّيْهِمْ » [ البقرۃ : ۱۲۹ ] ’’اے ہمارے رب! اور ان میں انھی میں سے ایک رسول بھیج جو ان پر تیری آیتیں پڑھے اور انھیں کتاب و حکمت سکھائے اور انھیں پاک کرے۔‘‘ ¤ اور اگر {’’ جَعَلَهَا ‘‘} میں ضمیر فاعل سے مراد اللہ تعالیٰ ہو تو مطلب یہ ہے کہ اللہ تعالیٰ نے اس کلمے کو ابراہیم علیہ السلام کی اولاد میں باقی رہنے والا بنا دیا اور ان میں ہمیشہ اس کلمے پر ایمان رکھنے والے اور اس کی دعوت دینے والے موجود رہے اور رہیں گے۔ چنانچہ ابراہیم علیہ السلام اور اسماعیل علیہ السلام کی دعا قبول فرما کر مکہ میں محمد صلی اللہ علیہ وسلم کو مبعوث فرمایا، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَنَا دَعْوَةُ أَبِيْ إِبْرَاهِيْمَ ] [ سلسلۃ الأحادیث الصحیحۃ، ح : ۱۵۴۶ ] ’’میں اپنے باپ ابراہیم کی دعا ہوں۔‘‘ اسی طرح ان کی اولاد میں اسحاق، یعقوب اور بہت سے انبیاء علیھم السلام مبعوث فرمائے، فرمایا : « وَ وَهَبْنَا لَهٗۤ اِسْحٰقَ وَ يَعْقُوْبَ وَ جَعَلْنَا فِيْ ذُرِّيَّتِهِ النُّبُوَّةَ وَ الْكِتٰبَ » [ العنکبوت : ۲۷ ] ’’اور ہم نے اسے اسحاق اور یعقوب عطا کیے اور اس کی اولاد میں نبوت اور کتاب رکھ دی۔‘‘ ¤ ➌ { لَعَلَّهُمْ يَرْجِعُوْنَ:} یعنی اگر ان میں سے کچھ لوگ گمراہ ہو کر شرک کرنے لگیں تو توحید پرستوں کی دعوت پر اللہ تعالیٰ کی طرف پلٹ آئیں۔ اس میں مکہ والوں کو تنبیہ ہے کہ نبی کریم صلی اللہ علیہ وسلم وہی کلمہ لے کر آئے ہیں جو ابراہیم علیہ السلام نے اپنی اولاد میں باقی چھوڑا تھا، اس لیے تم ان کی دعوت قبول کر لو اور شرک سے باز آ جاؤ۔ قرآن مجید نے بتایا ہے کہ ابراہیم علیہ السلام کی ساری اولاد ایمان والی نہیں ہوئی بلکہ ان میں نیک و بد ہر قسم کے لوگ رہے ہیں۔ دیکھیے سورۂ بقرہ (۱۲۴)، صافات (۱۱۳)، نساء (55،54) اور سورۂ حدید (۲۶) اگلی آیت میں یہی بات بیان ہوئی ہے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) {بَلْ مَتَّعْتُ هٰۤؤُلَآءِ وَ اٰبَآءَهُمْ … :} یہ اس سوال کا جواب ہے کہ ابراہیم علیہ السلام نے اپنی اولاد میں جو کلمہ اس لیے چھوڑا تھا کہ شرک میں گرفتار واپس پلٹ آئیں تو کیا وہ واپس پلٹے؟ فرمایا نہیں، وہ سب لوگ واپس نہیں پلٹے، بلکہ ان لوگوں یعنی قریش اور ان کے آباء کو ان کے کفر و شرک پر فوراً پکڑنے کے بجائے میں نے واپس پلٹنے کے لیے مہلت دی اور دنیا کا سازو سامان اور مال و متاع کچھ وقت تک رہنے اور فائدہ اٹھانے کے لیے دیا، مگر وہ ان دنیوی لذتوں ہی کو اپنا مقصد سمجھ بیٹھے اور ان میں ایسے بد مست ہوئے کہ ابراہیم علیہ السلام کی راہ کو بھول گئے، حتیٰ کہ ان کے پاس یہ حق اور رسول مبین آ گیا۔ {’’ الْحَقُّ ‘‘} سے مراد قرآن ہے اور {’’ رَسُوْلٌ مُّبِيْنٌ ‘‘} کا معنی کھول کر بیان کرنے والا رسول بھی ہے اور واضح رسول بھی، یعنی جس کا رسول برحق ہونا بالکل واضح ہے۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {وَ لَمَّا جَآءَهُمُ الْحَقُّ قَالُوْا هٰذَا سِحْرٌ … :} جب ان کے پاس حق یعنی قرآن آیا تو کہنے لگے، یہ جادو ہے اور ہم اسے نہیں مانتے۔ قرآن مجید کی دلوں پر زبردست تاثیر کا جب وہ کوئی توڑ نہ کر سکے، جس کی وجہ سے اس پر ایمان لانے والا اپنے رشتہ داروں کو تو چھوڑ سکتا تھا مگر ایمان سے کبھی پیچھے نہ ہٹتا تھا اور نہ ہی وہ اس پر ایمان لانے والوں کو روک سکے، تو بجائے اس کے کہ اس پر ایمان لے آتے اسے جادو کہہ کر جھٹلا دیا کہ یہ سب اثر جادو کا ہے۔ حالانکہ ظالم جانتے تھے کہ کہاں جادو جیسی پلید چیز اور جادوگروں جیسے خبیث لوگ اور کہاں اللہ کا پاکیزہ کلام اور رسول اللہ صلی اللہ علیہ وسلم جیسا پاکیزہ اور بلند اخلاق والا شخص۔ محض عناد اور ضد کی وجہ سے انھوں نے یہ بات کہی۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) {وَ قَالُوْا لَوْ لَا نُزِّلَ هٰذَا الْقُرْاٰنُ … :} پچھلی آیت میں ان کے قرآن پر طعن کا ذکر تھا تو اس آیت میں قرآن لانے والے پر اعتراض کا ذکر ہے۔ کفار پہلے تو کسی بشر کا رسول ہونا ہی ماننے کے لیے تیار نہ تھے، ان کا مطالبہ تھا کہ رسول فرشتہ ہونا چاہیے۔ جب ناقابل تردید دلائل سے انھیں بتایا گیا کہ اللہ تعالیٰ نے تمام رسول بشر ہی بھیجے ہیں، تمھارے جد امجد ابراہیم و اسماعیل علیھما السلام اور دوسرے پیغمبر، مثلاً موسیٰ علیہ السلام ، سب بشر ہی تھے، تو فرشتہ رسول کا مطالبہ چھوڑ کر یہ مطالبہ داغ دیا کہ یہ قرآن دو بستیوںمیں سے کسی عظیم آدمی پر کیوں نازل نہیں کیا گیا۔ دو بستیوں سے مراد مکہ اور طائف ہیں، کیونکہ ان کی مرکزی بستیاں یہ دو ہی تھیں۔ {’’ عَظِيْمٍ ‘‘} سے مراد دنیاوی مال و دولت اور جاہ و مرتبہ کے لحاظ سے عظیم ہے۔ مفسرین مکہ کے ان عظیم آدمیوں میں سے ولید بن مغیرہ یا عتبہ بن ربیعہ کا اور طائف کے عظماء میں سے عروہ بن مسعود، حبیب بن عمرو یا کنانہ بن عبد یا لیل یا اس قبیل کے دوسرے لوگوں کا ذکر کرتے ہیں۔ کفار کے خیال میں مال کی کثرت اور قوم کے سردار ہونے کی وجہ سے یہ لوگ نبوت کے حق دار تھے۔ محمد صلی اللہ علیہ وسلم مال و جاہ کی کمی کی وجہ سے اس کے اہل نہیں تھے، کیونکہ آپ کے پاس دولت کی کثرت تھی نہ کسی قبیلے کی سرداری۔ یہ کفار کی جہالت اور سخت نادانی تھی کہ انھوں نے نبوت کے منصب کے لیے مال و جاہ کو شرط قرار دیا۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ {اَهُمْ يَقْسِمُوْنَ رَحْمَتَ رَبِّكَ:} یہ ان کے اعتراض کا جواب ہے۔ {’’ رَحْمَتَ ‘‘}} کا لفظ اگرچہ عام ہے، جس میں ہر رحمت شامل ہے، مگر یہاں اس سے مراد نبوت و رسالت ہے، کیوں کہ ان کا اعتراض اسی پر تھا۔ {’’ رَحْمَتَ رَبِّكَ ‘‘} (تیرے رب کی رحمت) کے الفاظ میں رسول اللہ صلی اللہ علیہ وسلم کو مخاطب کرنے میں آپ صلی اللاللہ علیہ وسلم کی شان کی بلندی کا اظہار ہو رہا ہے۔ یعنی کیا تیرے رب کی رحمت نبوت و رسالت کی تقسیم ان کے ہاتھوں میں ہے کہ جسے چاہیں دیں اور جسے چاہیں نہ دیں؟ نہیں، یہ اختیار اللہ ہی کے پاس ہے اور وہی جانتا ہے کہ یہ رحمت کسے عطا کرنی ہے۔ یہ جاہل اپنی حیثیت کو بھول کر اس قدر دھوکے میں پڑے ہوئے ہیں کہ ان کا ہر شخص چاہتا ہے کہ اللہ کی کتاب اسی کو دی جائے، فرمایا : « بَلْ يُرِيْدُ كُلُّ امْرِئٍ مِّنْهُمْ اَنْ يُّؤْتٰى صُحُفًا مُّنَشَّرَةً » [ المدثر : ۵۲ ] ’’بلکہ ان میں سے ہر آدمی یہ چاہتا ہے کہ اسے کھلے ہوئے صحیفے دیے جائیں۔‘‘ حتیٰ کہ انھوں نے ایمان لانے کی شرط ہی نبوت دیا جانا ٹھہرائی، فرمایا : « وَ اِذَا جَآءَتْهُمْ اٰيَةٌ قَالُوْا لَنْ نُّؤْمِنَ حَتّٰى نُؤْتٰى مِثْلَ مَاۤ اُوْتِيَ رُسُلُ اللّٰهِ اَللّٰهُ اَعْعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهٗ سَيُصِيْبُ الَّذِيْنَ اَجْرَمُوْا صَغَارٌ عِنْدَ اللّٰهِ وَ عَذَابٌ شَدِيْدٌۢ بِمَا كَانُوْا يَمْكُرُوْنَ » [ الأنعام : ۱۲۴ ] ’’اور جب ان کے پاس کوئی نشانی آتی ہے تو کہتے ہیں ہم ہر گز ایمان نہیں لائیں گے، یہاں تک کہ ہمیں اس جیسا دیا جائے جو اللہ کے رسولوں کو دیا گیا۔ اللہ زیادہ جاننے والا ہے جہاں وہ اپنی رسالت رکھتا ہے۔ عنقریب ان لوگوں کو جنھوں نے جرم کیے، اللہ کے ہاں بڑی ذلت پہنچے گی اور بہت سخت عذاب، اس وجہ سے کہ وہ فریب کیا کرتے تھے۔‘‘ ¤ خلاصہ یہ کہ تیرے رب کی رحمت کی تقسیم اسی کے پاس ہے اور وہی جانتا ہے کہ کون اس کے قابل ہے۔ یہ کافر دنیا کے مال و جاہ کی وجہ سے ان لوگوں کو رسالت کے قابل سمجھ رہے ہیں جو اللہ کے ہاں ایک تنکے کا وزن نہیں رکھتے اور مال نہ ہونے کی وجہ سے اس شخص کو نبوت کے لیے نااہل قرار دے رہے ہیں جو سب سے زیادہ پاکیزہ قلب و نفس والا، خاندانی شرافت میں سب سے بلند اور انسانی خوبیوں میں سب سے ممتاز ہے۔ ¤ ➋ { نَحْنُ قَسَمْنَا بَيْنَهُمْ مَّعِيْشَتَهُمْ فِي الْحَيٰوةِ الدُّنْيَا:} یعنی نبوت و رسالت تو بہت ہی بلند چیز ہے، ہم نے تو دنیا میں ان کی روزی کی تقسیم کا اختیار بھی ان کو یا کسی دوسرے کو نہیں دیا، بلکہ اسے خود تقسیم کیا ہے، حالانکہ وہ ہمارے نزدیک مچھر کے پر کے برابر بھی نہیں، تو قرآن نازل کرنے کا اختیار انھیں کیسے دے سکتے ہیں!؟ ¤ ➌ { وَ رَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجٰتٍ:} اس مختصر سے جملے میں اللہ تعالیٰ نے کئی حقیقتیں بیان فرما دی ہیں۔ پہلی یہ کہ اللہ تعالیٰ نے صلاحیتوں اور روزیوں کی تقسیم میں برابری نہیں رکھی، بلکہ ان میں درجات رکھے ہیں۔ کسی کو غنی بنا دیا کسی کو فقیر، کوئی ذہین ہے کوئی کند ذہن، کوئی بے وقوف ہے کوئی عقل مند اور کوئی اس سے بڑھ کر عقل مند، کوئی طاقتور ہے کوئی کمزور، کوئی خادم ہے کوئی مخدوم، کوئی مالک ہے کوئی مملوک، کوئی اندھا ہے کوئی بینا، کوئی باعزت ہے کوئی ذلیل اور کوئی حاکم کوئی محکوم۔ کمیونسٹوں کا نعرہ کہ ہم تمام لوگوں میں دولت کی مساوات پیدا کریں گے، سخت دھوکا تھا۔ یہ اللہ کے فیصلے کے خلاف ہے، نہ ایسا ہو سکتا ہے نہ کمیونسٹوں سے ہو سکا۔ رزق اور اللہ تعالیٰ کی دوسری عنایتوں کی عطا میں یکسانیت کے بجائے درجات کی کمی بیشی ناقابل تردید حقیقت ہے۔ دنیا میں اس کا مقصد آزمائش ہے۔ (دیکھیے انعام : ۱۶۵) درجات کا یہ فرق آخرت میں اس سے بھی زیادہ ہو گا۔ دیکھیے سورۂ نحل (۷۱)، بنی اسرائیل (۲۱) اور سورۂ روم (۲۸)۔ ¤ دوسری حقیقت یہ کہ یہ کمی بیشی اللہ تعالیٰ نے رکھی ہے، کسی دوسرے کا اس میں کوئی دخل نہیں اور اللہ تعالیٰ نے جسے جس درجے میں رکھا ہے اس پر قناعت کے سوا اس کے پاس کوئی راستہ نہیں۔ کسی کو خوبصورت بنایا یا بدصورت، قوی بنایا یا ضعیف، عقل مند بنایا یا بے وقوف، آنکھیں عطا کر دیں یا نابینا کر دیا، ہر ایک کو اسی طرح رہنا پڑے گا جس طرح خلاّقِ عالم نے اس کے لیے طے کر دیا ہے۔ ¤ ➍ { لِيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا: ’’اِتَّخَذَ فُلَانٌ فُلَانًا سُخْرِيًّا‘‘} یعنی فلاں نے فلاں کو اپنا تابع بنا لیا، یا اپنے کام یا خدمت میں لگا لیا۔ یہ تیسری حقیقت ہے، کسی مال دار کا مال یا دنیوی عز و جاہ اس بات کی دلیل نہیں کہ اللہ تعالیٰ اس پر خوش ہے اور نہ ہی کسی فقیر کا فقر اس بات کی دلیل ہے کہ اللہ تعالیٰ اس پر ناراض ہے، بلکہ درجات کا یہ تفاوت اللہ تعالیٰ نے اس لیے رکھا ہے کہ لوگوں کو ایک دوسرے کی ضرورت رہے اور وہ ایک دوسرے سے کام لے سکیں، کیونکہ اگر ایسا نہ ہو تو دنیا کا نظام معطل ہو جائے۔ یہ اللہ تعالیٰ کی حکمت ہے کہ اس نے ایک شخص کو مال نہیں دیا، مگر اسے کسی کام کی صلاحیت اور قوت بخش دی، دوسرے کو کمزور بنا دیا جو خود نہ کام کر سکتا ہے نہ محنت، مگر اسے دولت بخش دی جس کے ساتھ وہ ان لوگوں کو مزدور رکھ سکتا ہے جن کے پاس مال نہیں۔ اسی طرح کسی کے پاس ایک ہنر ہے دوسرے کے پاس دوسرا، دونوں ایک دوسرے سے کام لیتے ہیں۔ اس میں ضروری نہیں کہ کام لینے والا مرتبے میں بھی اس سے اونچا ہو جس سے کام لے رہا ہے۔ کتنے ہی ڈاکٹر، انجینئر اور دوسرے کمالات کے مالک ان لوگوں کے پاس ملازمت کر رہے ہیں جو مطلق جاہل ہیں۔ یہاں کوئی بڑے سے بڑا ایسا نہیں جو چھوٹے سے چھوٹے کا محتاج نہ ہو، حتیٰ کہ بادشاہ بھی حجام، باورچی اور دوسرے خدمت گاروں کا محتاج ہے اور خدمت گار اس کے محتاج ہیں، اسی سے نظامِ عالم چل رہا ہے۔ اگر سب برابر ہو جائیں تو وہ ایک قدم نہیں چل سکتا۔ ¤ ➎ { وَ رَحْمَتُ رَبِّكَ خَيْرٌ مِّمَّا يَجْمَعُوْنَ: ’’ رَحْمَتُ رَبِّكَ ‘‘} کے متعلق دو قول ہیں، ایک یہ کہ اس سے مراد نبوت ہے، یعنی نبوت و رسالت کا شرف تو دنیوی مال و جاہ اور ساز و سامان سے کہیں اعلیٰ ہے۔ جب دنیا کی دولت اس نے ان کی تقسیم پر نہیں رکھی تو رسالت ان کی تجویز پر کیسے دے گا!؟ دوسرا یہ کہ اس سے مراد آخرت کی وہ نعمتیں ہیں جو اس نے اپنے بندوں کے لیے تیار کر رکھی ہیں، یعنی یہ لوگ دنیا کے جس فانی مال و متاع اور عز و جاہ کو سمیٹنے کی تگ و دو میں دن رات لگے ہوئے ہیں، تیرے رب کی رحمت یعنی آخرت کی دائمی نعمتیں ان سے بدرجہا بہتر ہیں۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33تا35) ➊ {وَ لَوْ لَاۤ اَنْ يَّكُوْنَ النَّاسُ اُمَّةً وَّاحِدَةً …: ’’ سُقُفًا ‘‘ ’’سَقْفٌ‘‘} کی جمع ہے، چھتیں۔ {’’ مَعَارِجَ ‘‘} (سیڑھیاں) {’’مِعْرَجٌ‘‘} یا {’’مِعْرَاجٌ‘‘} کی جمع ہے، جیسے {’’مَفَاتِحُ‘‘} اور {’’مَفَاتِيْحُ‘‘ ’’مِفْتَاحٌ‘‘} کی جمع ہیں۔ {’’ سُرُرًا ‘‘ ’’سَرِيْرٌ‘‘} کی جمع ہے، چارپائیاں، تخت۔ {’’ زُخْرُفًا ‘‘} کا معنی سونا ہے، جیسا کہ کفارر نے نبی صلی اللہ علیہ وسلم سے کہا تھا : « اَوْ يَكُوْنَ لَكَ بَيْتٌ مِّنْ زُخْرُفٍ» [ بني إسرائیل : ۹۳ ] ’’یا تیرے لیے سونے کا ایک گھر ہو۔‘‘ اس کا معنی زینت و آرائش بھی ہے، جیسا کہ فرمایا : «حَتّٰۤى اِذَاۤ اَخَذَتِ الْاَرْضُ زُخْرُفَهَا وَ ازَّيَّنَتْ » [ یونس : ۲۴ ] ’’یہاں تک کہ جب زمین نے اپنی آرائش حاصل کر لی اور خوب مزین ہو گئی۔‘‘ {’’ زُخْرُفًا ‘‘} منصوب ہونے کی دو وجہیں ہو سکتی ہیں، ایک یہ کہ یہ اصل میں {’’سُقُفًا مِنْ فِضَّةٍ وَ مِنْ زُخْرُفٍ‘‘} ہے، حرف جار حذف ہونے کی  وجہ سے منصوب ہو گیا، یعنی ’’ہم ان کے گھروں کی چھتیں چاندی کی بنا دیتے اور سونے کی۔‘‘ دوسری وجہ یہ کہ یہ {’’ لَجَعَلْنَا ‘‘} کے مفعول {’’ سُقُفًا ‘‘} پر عطف ہے، یعنی {’’لَجَعَلْنَا لِبُيُوْتِهِمْ سُقُفًا مِنْ فِضَّةٍ وَ لَجَعَلْنَا لَهُمْ زُخْرُفًا‘‘} کہ ’’ہم ان کے گھروں کی چھتیں چاندی کی بنا دیتے اور ہم ان کے لیے سونا مہیا کر دیتے۔‘‘ {’’ وَ اِنْ كُلُّ ذٰلِكَ لَمَّا مَتَاعُ الْحَيٰوةِ الدُّنْيَا ‘‘} میں {’’ اِنْ ‘‘} نافیہ ہے اور {’’ لَمَّا ‘‘} بمعنی {’’إِلَّا‘‘} ہے، جیسے فرمایا : « اِنْ كُلُّ نَفْسٍ لَّمَّا عَلَيْهَا حَافِظٌ» [ الطارق : ۴ ] ’’نہیں کوئی جان مگر اس کے اوپر ایک حفاظت کرنے والا ہے۔‘‘ ¤ ➋ آیات کا مطلب یہ ہے کہ اللہ تعالیٰ نے جب {’’ وَ رَحْمَتُ رَبِّكَ خَيْرٌ مِّمَّا يَجْمَعُوْنَ ‘‘} (اورتیرے رب کی رحمت اس سے بہتر ہے جو وہ جمع کر رہے ہیں) میں آخرت کی عظمت و شان اور دنیا کی حقارت بیان فرمائی تو ساتھ ہی بیان فرمایا کہ اس کے نزدیک دنیا بالکل ہی حقیر اور بے قدر و قیمت ہے، اس کے ہاں کوئی قیمت ہے تو صرف آخرت کی، اس لیے اس نے آخرت کی نعمتیں صرف مسلمانوں کے لیے خاص کر رکھی ہیں، کفار کا ان میں کوئی حصہ نہیں۔ دنیا کی نعمتوں میں اس نے مومن و کافر سب کو شریک رکھا ہے اور دونوں کو ان نعمتوں میں شریک رکھنے کی حکمت بیان فرمائی کہ اگر ہمیں یہ بات ناپسند نہ ہوتی کہ تمام لوگ ایک ہی امت یعنی سبھی کافر ہو جائیں گے تو ہم دنیا کی زیب و زینت کی تمام اشیاء کفار کو دے دیتے، لیکن چونکہ ہمیں معلوم ہے کہ لوگوں کے دلوں میں دنیوی زیب و زینت کی شدید رغبت اور محبت موجود ہے، اگر ہم نے یہ سبھی کچھ کفار کو دے دیا تو دنیا کی رغبت کے نتیجے میں سبھی لوگ کافر ہو جائیں گے، (جب کہ یہ بات ہماری رحمت کو منظور نہیں) اس لیے ہم نے کافر و مومن دونوں میں غنی بھی رکھے ہیں، فقیر بھی اور دنیا کی زندگی کے سازو سامان میں دونوں کو شریک رکھا ہے۔ آیت کے آخری جملوں : «وَ اِنْ كُلُّ ذٰلِكَ لَمَّا مَتَاعُ الْحَيٰوةِ الدُّنْيَا وَ الْاٰخِرَةُ عِنْدَ رَبِّكَ لِلْمُتَّقِيْنَ » (اور یہ سب کچھ دنیا کی زندگی کے سامان کے سوا کچھ نہیں اور آخرت تیرے رب کے ہاں متقی لوگوں کے لیے ہے) میں بیان فرمایا کہ آخرت صرف ایمان والوں کے لیے ہے۔ یہی مضمون سورۂ اعراف (۳۲) میں بیان ہوا ہے۔ سہل بن سعد رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَوْ كَانَتِ الدُّنْيَا تَعْدِلُ عِنْدَ اللّٰهِ جَنَاحَ بَعُوْضَةٍ مَاا سَقٰی كَافِرًا مِنْهَا شَرْبَةَ مَاءٍ] [ ترمذي، الزھد، باب ما جاء في ھوان الدنیا علی اللّٰہ عز و جل : ۲۳۲۰ ] ’’اگر دنیا اللہ کے ہاں مچھر کے ایک پر کے برابر ہوتی تو وہ اس میں سے کسی کافر کو پانی کا ایک گھونٹ پینے کو نہ دیتا۔‘‘"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 33تا35) ➊ {وَ لَوْ لَاۤ اَنْ يَّكُوْنَ النَّاسُ اُمَّةً وَّاحِدَةً …: ’’ سُقُفًا ‘‘ ’’سَقْفٌ‘‘} کی جمع ہے، چھتیں۔ {’’ مَعَارِجَ ‘‘} (سیڑھیاں) {’’مِعْرَجٌ‘‘} یا {’’مِعْرَاجٌ‘‘} کی جمع ہے، جیسے {’’مَفَاتِحُ‘‘} اور {’’مَفَاتِيْحُ‘‘ ’’مِفْتَاحٌ‘‘} کی جمع ہیں۔ {’’ سُرُرًا ‘‘ ’’سَرِيْرٌ‘‘} کی جمع ہے، چارپائیاں، تخت۔ {’’ زُخْرُفًا ‘‘} کا معنی سونا ہے، جیسا کہ کفارر نے نبی صلی اللہ علیہ وسلم سے کہا تھا : « اَوْ يَكُوْنَ لَكَ بَيْتٌ مِّنْ زُخْرُفٍ» [ بني إسرائیل : ۹۳ ] ’’یا تیرے لیے سونے کا ایک گھر ہو۔‘‘ اس کا معنی زینت و آرائش بھی ہے، جیسا کہ فرمایا : «حَتّٰۤى اِذَاۤ اَخَذَتِ الْاَرْضُ زُخْرُفَهَا وَ ازَّيَّنَتْ » [ یونس : ۲۴ ] ’’یہاں تک کہ جب زمین نے اپنی آرائش حاصل کر لی اور خوب مزین ہو گئی۔‘‘ {’’ زُخْرُفًا ‘‘} منصوب ہونے کی دو وجہیں ہو سکتی ہیں، ایک یہ کہ یہ اصل میں {’’سُقُفًا مِنْ فِضَّةٍ وَ مِنْ زُخْرُفٍ‘‘} ہے، حرف جار حذف ہونے کی  وجہ سے منصوب ہو گیا، یعنی ’’ہم ان کے گھروں کی چھتیں چاندی کی بنا دیتے اور سونے کی۔‘‘ دوسری وجہ یہ کہ یہ {’’ لَجَعَلْنَا ‘‘} کے مفعول {’’ سُقُفًا ‘‘} پر عطف ہے، یعنی {’’لَجَعَلْنَا لِبُيُوْتِهِمْ سُقُفًا مِنْ فِضَّةٍ وَ لَجَعَلْنَا لَهُمْ زُخْرُفًا‘‘} کہ ’’ہم ان کے گھروں کی چھتیں چاندی کی بنا دیتے اور ہم ان کے لیے سونا مہیا کر دیتے۔‘‘ {’’ وَ اِنْ كُلُّ ذٰلِكَ لَمَّا مَتَاعُ الْحَيٰوةِ الدُّنْيَا ‘‘} میں {’’ اِنْ ‘‘} نافیہ ہے اور {’’ لَمَّا ‘‘} بمعنی {’’إِلَّا‘‘} ہے، جیسے فرمایا : « اِنْ كُلُّ نَفْسٍ لَّمَّا عَلَيْهَا حَافِظٌ» [ الطارق : ۴ ] ’’نہیں کوئی جان مگر اس کے اوپر ایک حفاظت کرنے والا ہے۔‘‘ ¤ ➋ آیات کا مطلب یہ ہے کہ اللہ تعالیٰ نے جب {’’ وَ رَحْمَتُ رَبِّكَ خَيْرٌ مِّمَّا يَجْمَعُوْنَ ‘‘} (اورتیرے رب کی رحمت اس سے بہتر ہے جو وہ جمع کر رہے ہیں) میں آخرت کی عظمت و شان اور دنیا کی حقارت بیان فرمائی تو ساتھ ہی بیان فرمایا کہ اس کے نزدیک دنیا بالکل ہی حقیر اور بے قدر و قیمت ہے، اس کے ہاں کوئی قیمت ہے تو صرف آخرت کی، اس لیے اس نے آخرت کی نعمتیں صرف مسلمانوں کے لیے خاص کر رکھی ہیں، کفار کا ان میں کوئی حصہ نہیں۔ دنیا کی نعمتوں میں اس نے مومن و کافر سب کو شریک رکھا ہے اور دونوں کو ان نعمتوں میں شریک رکھنے کی حکمت بیان فرمائی کہ اگر ہمیں یہ بات ناپسند نہ ہوتی کہ تمام لوگ ایک ہی امت یعنی سبھی کافر ہو جائیں گے تو ہم دنیا کی زیب و زینت کی تمام اشیاء کفار کو دے دیتے، لیکن چونکہ ہمیں معلوم ہے کہ لوگوں کے دلوں میں دنیوی زیب و زینت کی شدید رغبت اور محبت موجود ہے، اگر ہم نے یہ سبھی کچھ کفار کو دے دیا تو دنیا کی رغبت کے نتیجے میں سبھی لوگ کافر ہو جائیں گے، (جب کہ یہ بات ہماری رحمت کو منظور نہیں) اس لیے ہم نے کافر و مومن دونوں میں غنی بھی رکھے ہیں، فقیر بھی اور دنیا کی زندگی کے سازو سامان میں دونوں کو شریک رکھا ہے۔ آیت کے آخری جملوں : «وَ اِنْ كُلُّ ذٰلِكَ لَمَّا مَتَاعُ الْحَيٰوةِ الدُّنْيَا وَ الْاٰخِرَةُ عِنْدَ رَبِّكَ لِلْمُتَّقِيْنَ » (اور یہ سب کچھ دنیا کی زندگی کے سامان کے سوا کچھ نہیں اور آخرت تیرے رب کے ہاں متقی لوگوں کے لیے ہے) میں بیان فرمایا کہ آخرت صرف ایمان والوں کے لیے ہے۔ یہی مضمون سورۂ اعراف (۳۲) میں بیان ہوا ہے۔ سہل بن سعد رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَوْ كَانَتِ الدُّنْيَا تَعْدِلُ عِنْدَ اللّٰهِ جَنَاحَ بَعُوْضَةٍ مَاا سَقٰی كَافِرًا مِنْهَا شَرْبَةَ مَاءٍ] [ ترمذي، الزھد، باب ما جاء في ھوان الدنیا علی اللّٰہ عز و جل : ۲۳۲۰ ] ’’اگر دنیا اللہ کے ہاں مچھر کے ایک پر کے برابر ہوتی تو وہ اس میں سے کسی کافر کو پانی کا ایک گھونٹ پینے کو نہ دیتا۔‘‘"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 33تا35) ➊ {وَ لَوْ لَاۤ اَنْ يَّكُوْنَ النَّاسُ اُمَّةً وَّاحِدَةً …: ’’ سُقُفًا ‘‘ ’’سَقْفٌ‘‘} کی جمع ہے، چھتیں۔ {’’ مَعَارِجَ ‘‘} (سیڑھیاں) {’’مِعْرَجٌ‘‘} یا {’’مِعْرَاجٌ‘‘} کی جمع ہے، جیسے {’’مَفَاتِحُ‘‘} اور {’’مَفَاتِيْحُ‘‘ ’’مِفْتَاحٌ‘‘} کی جمع ہیں۔ {’’ سُرُرًا ‘‘ ’’سَرِيْرٌ‘‘} کی جمع ہے، چارپائیاں، تخت۔ {’’ زُخْرُفًا ‘‘} کا معنی سونا ہے، جیسا کہ کفارر نے نبی صلی اللہ علیہ وسلم سے کہا تھا : « اَوْ يَكُوْنَ لَكَ بَيْتٌ مِّنْ زُخْرُفٍ» [ بني إسرائیل : ۹۳ ] ’’یا تیرے لیے سونے کا ایک گھر ہو۔‘‘ اس کا معنی زینت و آرائش بھی ہے، جیسا کہ فرمایا : «حَتّٰۤى اِذَاۤ اَخَذَتِ الْاَرْضُ زُخْرُفَهَا وَ ازَّيَّنَتْ » [ یونس : ۲۴ ] ’’یہاں تک کہ جب زمین نے اپنی آرائش حاصل کر لی اور خوب مزین ہو گئی۔‘‘ {’’ زُخْرُفًا ‘‘} منصوب ہونے کی دو وجہیں ہو سکتی ہیں، ایک یہ کہ یہ اصل میں {’’سُقُفًا مِنْ فِضَّةٍ وَ مِنْ زُخْرُفٍ‘‘} ہے، حرف جار حذف ہونے کی  وجہ سے منصوب ہو گیا، یعنی ’’ہم ان کے گھروں کی چھتیں چاندی کی بنا دیتے اور سونے کی۔‘‘ دوسری وجہ یہ کہ یہ {’’ لَجَعَلْنَا ‘‘} کے مفعول {’’ سُقُفًا ‘‘} پر عطف ہے، یعنی {’’لَجَعَلْنَا لِبُيُوْتِهِمْ سُقُفًا مِنْ فِضَّةٍ وَ لَجَعَلْنَا لَهُمْ زُخْرُفًا‘‘} کہ ’’ہم ان کے گھروں کی چھتیں چاندی کی بنا دیتے اور ہم ان کے لیے سونا مہیا کر دیتے۔‘‘ {’’ وَ اِنْ كُلُّ ذٰلِكَ لَمَّا مَتَاعُ الْحَيٰوةِ الدُّنْيَا ‘‘} میں {’’ اِنْ ‘‘} نافیہ ہے اور {’’ لَمَّا ‘‘} بمعنی {’’إِلَّا‘‘} ہے، جیسے فرمایا : « اِنْ كُلُّ نَفْسٍ لَّمَّا عَلَيْهَا حَافِظٌ» [ الطارق : ۴ ] ’’نہیں کوئی جان مگر اس کے اوپر ایک حفاظت کرنے والا ہے۔‘‘ ¤ ➋ آیات کا مطلب یہ ہے کہ اللہ تعالیٰ نے جب {’’ وَ رَحْمَتُ رَبِّكَ خَيْرٌ مِّمَّا يَجْمَعُوْنَ ‘‘} (اورتیرے رب کی رحمت اس سے بہتر ہے جو وہ جمع کر رہے ہیں) میں آخرت کی عظمت و شان اور دنیا کی حقارت بیان فرمائی تو ساتھ ہی بیان فرمایا کہ اس کے نزدیک دنیا بالکل ہی حقیر اور بے قدر و قیمت ہے، اس کے ہاں کوئی قیمت ہے تو صرف آخرت کی، اس لیے اس نے آخرت کی نعمتیں صرف مسلمانوں کے لیے خاص کر رکھی ہیں، کفار کا ان میں کوئی حصہ نہیں۔ دنیا کی نعمتوں میں اس نے مومن و کافر سب کو شریک رکھا ہے اور دونوں کو ان نعمتوں میں شریک رکھنے کی حکمت بیان فرمائی کہ اگر ہمیں یہ بات ناپسند نہ ہوتی کہ تمام لوگ ایک ہی امت یعنی سبھی کافر ہو جائیں گے تو ہم دنیا کی زیب و زینت کی تمام اشیاء کفار کو دے دیتے، لیکن چونکہ ہمیں معلوم ہے کہ لوگوں کے دلوں میں دنیوی زیب و زینت کی شدید رغبت اور محبت موجود ہے، اگر ہم نے یہ سبھی کچھ کفار کو دے دیا تو دنیا کی رغبت کے نتیجے میں سبھی لوگ کافر ہو جائیں گے، (جب کہ یہ بات ہماری رحمت کو منظور نہیں) اس لیے ہم نے کافر و مومن دونوں میں غنی بھی رکھے ہیں، فقیر بھی اور دنیا کی زندگی کے سازو سامان میں دونوں کو شریک رکھا ہے۔ آیت کے آخری جملوں : «وَ اِنْ كُلُّ ذٰلِكَ لَمَّا مَتَاعُ الْحَيٰوةِ الدُّنْيَا وَ الْاٰخِرَةُ عِنْدَ رَبِّكَ لِلْمُتَّقِيْنَ » (اور یہ سب کچھ دنیا کی زندگی کے سامان کے سوا کچھ نہیں اور آخرت تیرے رب کے ہاں متقی لوگوں کے لیے ہے) میں بیان فرمایا کہ آخرت صرف ایمان والوں کے لیے ہے۔ یہی مضمون سورۂ اعراف (۳۲) میں بیان ہوا ہے۔ سہل بن سعد رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَوْ كَانَتِ الدُّنْيَا تَعْدِلُ عِنْدَ اللّٰهِ جَنَاحَ بَعُوْضَةٍ مَاا سَقٰی كَافِرًا مِنْهَا شَرْبَةَ مَاءٍ] [ ترمذي، الزھد، باب ما جاء في ھوان الدنیا علی اللّٰہ عز و جل : ۲۳۲۰ ] ’’اگر دنیا اللہ کے ہاں مچھر کے ایک پر کے برابر ہوتی تو وہ اس میں سے کسی کافر کو پانی کا ایک گھونٹ پینے کو نہ دیتا۔‘‘"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) ➊ {وَ مَنْ يَّعْشُ عَنْ ذِكْرِ الرَّحْمٰنِ:} زمخشری نے فرمایا، {’’عَشِيَ يَعْشٰي‘‘} (ع) جب نظر میں خرابی آ جائے اور {’’عَشَا يَعْشُوْ‘‘ } (ن) جب اس شخص کی طرح دیکھے جس کی نظر خراب ہے، حالانکہ اس میں کوئی خرابی نہ ہو۔ دونوں میں وہی فرق ہے جو {’’عَمِيَ‘‘} (اندھا ہو گیا) اور {’’تَعَامٰي‘‘} (اندھا بن گیا) میں ہے۔ {’’ ذِكْرِ الرَّحْمٰنِ ‘‘} کا معنی رحمان کی یاد بھی ہے، اس کی طرف سے آئی ہوئی نصیحت بھی اور یہ قرآن بھی۔ دنیا کی زیب و زینت میں ہمہ تن مشغول ہونے کا نتیجہ یہ ہوتا ہے کہ آدمی اللہ کے ذکر سے غافل ہو جاتا ہے، جس کی وجہ سے فرشتے اس سے نفرت کرتے ہیں اور شیطان اس سے چمٹ جاتے ہیں، جو اسے ہر برائی میں مبتلا کرنے کی سر توڑ کوشش کرتے ہیں۔ اللہ تعالیٰ نے فرمایا : «يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تُلْهِكُمْ اَمْوَالُكُمْ وَ لَاۤ اَوْلَادُكُمْ عَنْ ذِكْرِ اللّٰهِ وَ مَنْ يَّفْعَلْ ذٰلِكَ فَاُولٰٓىِٕككَ هُمُ الْخٰسِرُوْنَ » [ المنافقون : ۹ ] ’’اے لوگو جو ایمان لائے ہو! تمھارے مال اور تمھاری اولاد تمھیں اللہ کی یاد سے غافل نہ کر دیں اور جو ایسا کرے تو وہی لوگ خسارہ اٹھانے والے ہیں۔‘‘ اور جو شخص خواہشِ نفس پر قابو رکھ کر دنیا کے فتنوں سے بچے اور اللہ کے ذکر پر دوام کرے تو شیطان اس سے دور ہو جاتا ہے اور اللہ تعالیٰ اس کے ساتھ فرشتہ مقرر کر دیتے ہیں جو اس کی مدد کرتا ہے۔ اللہ تعالیٰ نے اپنے ذکر سے جان بوجھ کر غفلت کے لیے اندھا بننے کا لفظ استعمال فرمایا اور لفظ {’’ الرَّحْمٰنِ ‘‘} اس لیے ذکر فرمایا کہ انسان کے لائق نہیں کہ اس بے حد رحم والے کے ذکر سے غفلت کرے۔ ¤ ➋ { نُقَيِّضْ لَهٗ شَيْطٰنًا فَهُوَ لَهٗ قَرِيْنٌ:} اس کی تفسیر کے لیے دیکھیے سورۂ حم السجدہ (۲۵)۔ {’’ شَيْطٰنًا ‘‘} نکرہ ہے، کوئی نہ کوئی شیطان، وہ انسانوں میں سے ہو یا ابلیس کی اولاد میں سے۔ شیطان مقرر کرنے کی نسبت اللہ تعالیٰ نے اپنی طرف فرمائی، حالانکہ یہ انسان کے اللہ کے ذکر سے غافل ہونے کا نتیجہ ہوتا ہے، کیونکہ ہر کام کا خالق اللہ تعالیٰ ہے اور تمام امور اسی کی طرف لوٹتے ہیں، جیسا کہ فرمایا : «وَ اِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ» [ البقرۃ : ۲۱۰ ] ’’اور سب کام اللہ ہی کی طرف لوٹائے جاتے ہیں۔‘‘"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ {وَ اِنَّهُمْ لَيَصُدُّوْنَهُمْ عَنِ السَّبِيْلِ: ’’ اِنَّهُمْ ‘‘} میں ضمیر شیاطین کی طرف اور {’’ لَيَصُدُّوْنَهُمْ ‘‘} میں ضمیر {’’هُمْ‘‘} رحمان کے ذکر سے غفلت کرنے والوں کی طرف جا رہی ہے، حالانکہ پچھلی آیت میں دونوں کا ذکر واحد کی ضمیر کے ساتھ آیا ہے، لیکن وہاں بھی لفظ {’’ مَنْ ‘‘} واحد ہونے کے باوجود معنی کے لحاظ سے جمع ہے۔ یعنی اس کی یاد سے جان بوجھ کر غفلت کرنے والوں کو کوئی نہ کوئی شیطان چمٹ جاتے ہیں، خواہ انسانی شیطان ہوں یا ابلیس کی اولاد، وہ ان کے لیے گناہوں کو خوبصورت کرکے دکھاتے ہیں، ان کی نفسانی خواہشات کو ابھارتے اور انھیں اللہ کی نافرمانی میں مشغول کر دیتے ہیں، حتیٰ کہ انھیں صراطِ مستقیم سے بالکل روک دیتے ہیں اور جہنم میں پہنچا کر چھوڑتے ہیں۔ ¤ ➋ { وَ يَحْسَبُوْنَ اَنَّهُمْ مُّهْتَدُوْنَ:} یعنی راہِ راست سے رک جانے والے وہ غافل سراسر گمراہ ہونے کے باوجود اپنے بارے میں سمجھتے ہیں کہ وہ سیدھے راستے پر ہیں۔ یہ معنی بھی ہو سکتا ہے کہ وہ اپنے گمراہ کرنے والے شیاطین کے متعلق سمجھتے ہیں کہ وہ سیدھے راستے پر ہیں، اس لیے آنکھیں بند کرکے ان کے پیچھے چلتے چلے جاتے ہیں۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) ➊ { حَتّٰۤى اِذَا جَآءَنَا قَالَ … :} دنیا میں ہر وقت شیطان کے ساتھ رہنے کے بعد قیامت کے دن اللہ کے ذکر سے اندھا بننے والا انسان جب اپنے قرین کے ہمراہ اللہ تعالیٰ کے پاس حاضر ہو گا تو حسرت و افسوس کے ساتھ اس سے کہے گا، کاش! میرے اور تیرے درمیان دو مشرقوں کی دوری ہوتی۔ دو مشرقوں سے مراد مشرق و مغرب ہیں۔ دونوں کو ’’مشرقین ‘‘ کہہ دیا ہے، جیسے ابوبکر و عمر( رضی اللہ عنھما ) کو ’’عمرین ‘‘کہہ دیتے ہیں اور کھجور اور پانی کو ’’اسودین ‘‘کہہ دیتے ہیں۔ دو مشرق بھی مراد ہو سکتے ہیں، کیونکہ سردیوں میں سورج طلوع ہونے کی جگہ اور گرمیوں میں طلوع ہونے کی جگہ کے درمیان بہت فاصلہ ہے، جیسا کہ فرمایا : « رَبُّ الْمَشْرِقَيْنِ وَ رَبُّ الْمَغْرِبَيْنِ » [ الرحمان : ۱۷ ] ’’(وہ) دونوں مشرقوں کا رب ہے اور دونوں مغربوں کا رب۔‘‘ ¤ ➋ { فَبِئْسَ الْقَرِيْنُ: ’’أَيْ بِئْسَ الْقَرِيْنُ أَنْتَ‘‘} یعنی تو برا ساتھی ہے، جس نے دوست بن کر مجھے خراب و برباد کیا اور ہمیشہ کے عذاب میں پھنسا دیا۔ بعض مفسرین نے اسے اللہ تعالیٰ کا کلام قرار دے کر معنی کیا ہے : {’’ فَبِئْسَ الْقَرِيْنُ هُوَ ‘‘} یعنی پس وہ برا ساتھی ہے۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) { وَ لَنْ يَّنْفَعَكُمُ الْيَوْمَ … :} دنیا میں اگر کوئی شخص کسی مصیبت میں گرفتار ہو تو اسے اس بات سے کچھ تسلی ہوتی ہے کہ وہ اکیلا نہیں بلکہ اس کے ساتھ اور لوگ بھی اس مصیبت میں گرفتار ہیں۔ اس کے علاوہ دوستوں کی صحبت کے احساس سے بھی تکلیف میں کچھ کمی ہو جاتی ہے، کیونکہ وہ مصیبت میں ایک دوسرے کی مدد کرتے اور حوصلہ دلاتے ہیں۔ عام مقولہ ہے : ’’ہمہ یاراں دوزخ، ہمہ یاراں بہشت‘‘ کہ دوزخ میں گئے تو سب دوست اکٹھے جائیں گے اور بہشت میں گئے تو بھی اکٹھے جائیں گے۔ ¤ قرین کی مناسبت سے فرمایا کہ اگر تم اس بات سے کچھ تسلی حاصل کرنا چاہو کہ میں عذاب میں ہوں تو میرا قرین بھی تو عذاب میں ہے تو تمھارا یہ خیال غلط ہے، جب تم دنیا میں ظلم کرتے رہے تو آج تمھیں اس بات سے ہر گز کوئی فائدہ نہیں ہو گا کہ تم عذاب میں ایک دوسرے کے ساتھ شریک ہو، کیونکہ وہ عذاب ہی اتنا سخت ہے کہ کسی کو کسی کی ہوش نہیں ہو گی، بلکہ مجرم اپنے تمام خویش و اقارب فدیے میں دے کر اس عذاب سے نجات پانے کی خواہش کرے گا۔ (دیکھیے معارج : ۱۱ تا ۱۴) شاہ عبد القادر لکھتے ہیں : ’’یعنی کافر کہیں گے خوب ہوا کہ انھوں نے ہمیں عذاب میں ڈلوایا، یہ بھی نہ بچے، لیکن اس کا کیا فائدہ اگر دوسرا پکڑا گیا۔‘‘ (موضح)"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) { اَفَاَنْتَ تُسْمِعُ الصُّمَّ … : } رحمن کے ذکر سے دانستہ آنکھیں بند کرنے کی سزا شیطان کو ایسے لوگوں کا ساتھی بنانے کی صورت میں دی جاتی ہے جو انھیں راہِ حق سے اس طرح روکتے ہیں کہ وہ حق سننے سے بہرے اور اس کی نشانیاں دیکھنے سے اندھے ہو جاتے ہیں۔ اس آیت سے مقصود نبی صلی اللہ علیہ وسلم کو تسلی دینا ہے کہ ان کافروں کے ایمان نہ لانے پر آپ غمزدہ نہ ہوں، کیونکہ ایسے لوگوں کو راہِ راست پر لے آنا آپ کے بس میں نہیں، آپ ان تک اللہ کا پیغام پہنچاتے رہیں اور ہدایت کا معاملہ اللہ پر چھوڑ دیں۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 42،41) {فَاِمَّا نَذْهَبَنَّ بِكَ فَاِنَّا مِنْهُمْ … :} یہ بھی رسول اللہ صلی اللہ علیہ وسلم کو ایک اور طرح سے تسلی دلائی ہے کہ یہ کفار جو آپ کی موت کے منتظر ہیں اور ہر وقت آپ کو کسی نہ کسی طرح قتل کرنے کی کوشش اور مشورہ کرتے رہتے ہیں، ان کا خیال ہے کہ آپ کی موت سے ان کی مشکل ختم ہو جائے گی اور سب کچھ ان کے حق میں ہو جائے گا۔ فرمایا ان کا یہ خیال غلط ہے، کیونکہ اگر ہم آپ کو اپنے پاس لے جائیں تو پھر بھی یہ لوگ سزا سے بچ نہیں سکیں گے، بلکہ ہم ہر حال میں ان سے انتقام لینے والے ہیں، یا آپ کی زندگی میں آپ کو اس سزا کا کچھ حصہ دکھا دیں جس کا ہم نے ان سے وعدہ کیا ہے تو یہ بھی کچھ بعید نہیں، کیونکہ ہم ان پر پوری قدرت رکھنے والے ہیں۔ چنانچہ ایسا ہی ہوا، اللہ تعالیٰ نے بدر اور دوسرے معرکوں میں کفار کو ملنے والی سزا آپ صلی اللہ علیہ وسلم کو آنکھوں سے دکھا دی۔ مزید دیکھیے سورۂ مومن (۷۷)۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42،41) {فَاِمَّا نَذْهَبَنَّ بِكَ فَاِنَّا مِنْهُمْ … :} یہ بھی رسول اللہ صلی اللہ علیہ وسلم کو ایک اور طرح سے تسلی دلائی ہے کہ یہ کفار جو آپ کی موت کے منتظر ہیں اور ہر وقت آپ کو کسی نہ کسی طرح قتل کرنے کی کوشش اور مشورہ کرتے رہتے ہیں، ان کا خیال ہے کہ آپ کی موت سے ان کی مشکل ختم ہو جائے گی اور سب کچھ ان کے حق میں ہو جائے گا۔ فرمایا ان کا یہ خیال غلط ہے، کیونکہ اگر ہم آپ کو اپنے پاس لے جائیں تو پھر بھی یہ لوگ سزا سے بچ نہیں سکیں گے، بلکہ ہم ہر حال میں ان سے انتقام لینے والے ہیں، یا آپ کی زندگی میں آپ کو اس سزا کا کچھ حصہ دکھا دیں جس کا ہم نے ان سے وعدہ کیا ہے تو یہ بھی کچھ بعید نہیں، کیونکہ ہم ان پر پوری قدرت رکھنے والے ہیں۔ چنانچہ ایسا ہی ہوا، اللہ تعالیٰ نے بدر اور دوسرے معرکوں میں کفار کو ملنے والی سزا آپ صلی اللہ علیہ وسلم کو آنکھوں سے دکھا دی۔ مزید دیکھیے سورۂ مومن (۷۷)۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) {فَاسْتَمْسِكْ بِالَّذِيْۤ اُوْحِيَ اِلَيْكَ … :} یعنی آپ کو ان کافروں کی مخالفت سے دل برداشتہ نہیں ہونا چاہیے، آپ کے لیے یہ اطمینان کافی ہے کہ آپ راہِ حق پر ہیں، اس لیے نتائج سے بے فکر ہو کر دعوت کا کام جاری رکھیں اور خود اس پر پوری طرح کاربند رہیں۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) ➊ {وَ اِنَّهٗ لَذِكْرٌ لَّكَ وَ لِقَوْمِكَ:} ذکر کا معنی نصیحت و یاد دہانی بھی ہے اور عز و شرف اور شہرت و ناموری بھی، یہاں دونوں مراد ہیں۔ یعنی یہ قرآن آپ کے لیے اور آپ کی قوم کے لیے نصیحت اور یاد دہانی ہے اور آپ کے لیے اور آپ کی قوم قریش اور عرب کے لیے عز و شرف کا باعث بھی ہے۔ یہ عربی زبان میں نازل ہوا اور اس کے اوّلین مخاطب اور سب سے پہلے عمل کرنے والے قریش اور عرب ہیں۔ جو عجمی قومیں اس پر ایمان لائیں گی ان کو قرآن کی تعلیم حاصل کرنے کے لیے عربی زبان سیکھنا پڑے گی اور عربوں کا شاگرد بننا پڑے گا۔ قریش اور عربوں کے لیے یہ عز و شرف کیا کم ہے کہ بعد میں آنے والے تمام لوگ ان کے ہاتھ پر مسلمان ہوئے۔ زمین کے مشرق و مغرب ان کے جہاد کے ساتھ فتح اور حلقہ بگوش اسلام ہوئے اور اللہ تعالیٰ نے مسلمانوں کی خلافت ان میں رکھی جب تک انھوں نے دین کو قائم رکھا، کیونکہ قرآن شرف کا باعث اسی کے لیے ہے جو اس پر عمل کرے، اس کے لیے محض عرب یا قریشی ہونا کافی نہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ ] [مسلم، الطھارۃ، باب فضل الوضوء : ۲۲۳، عن أبي مالک الأشعري رضی اللہ عنہ ] ’’قرآن تیرے حق میں حجت ہے یا تیرے خلاف حجت ہے۔‘‘ ¤ آیت سے یہ بات بھی نکلتی ہے کہ نیک نامی کی خواہش اچھی چیز ہے، ورنہ اللہ تعالیٰ اس کا ذکر اپنے نبی محمد صلی اللہ علیہ وسلم پر احسان کے طور پر نہ فرماتے اور ابراہیم علیہ السلام اللہ تعالیٰ سے یہ دعا نہ کرتے : « وَ اجْعَلْ لِّيْ لِسَانَ صِدْقٍ فِي الْاٰخِرِيْنَ» [الشعراء : ۸۴ ] ’’اور پیچھے آنے والوں میں میرے لیے سچی ناموری رکھ۔‘‘ ¤ ➋ { وَ سَوْفَ تُسْـَٔلُوْنَ:} یعنی قیامت کے دن تم سے سوال کیا جائے گا کہ تم نے اپنے عز و شرف کا باعث بننے والی نصیحت کی اس کتاب کی کیا قدر کی، اس پر کہاں تک عمل کیا اور اسے تمام اقوامِ عالم تک پہنچانے کی ذمہ داری کہاں تک ادا کی؟"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) ➊ { وَ سْـَٔلْ مَنْ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رُّسُلِنَاۤ … :} یہاں ایک سوال ہے کہ پہلے رسول تو فوت ہو چکے، ان سے کس طرح پوچھا جا سکتا ہے؟ جواب اس کا یہ ہے کہ رسولوں سے پوچھنے سے مراد ان کی کتابوں سے معلوم کرنا ہے، جیسا کہ اللہ کے فرمان : « فَاِنْ تَنَازَعْتُمْ فِيْ شَيْءٍ فَرُدُّوْهُ اِلَى اللّٰهِ وَ الرَّسُوْلِ» [ النساء : ۵۹ ] (پھر اگر تم کسی چیز میں جھگڑ پڑو تو اسے اللہ اور رسول کی طرف لوٹاؤ) کا مطلب اب یہ نہیں کہ اگر تمھارا کسی معاملے میں تنازع ہو جائے تو اسے اللہ اور رسول کے پاس لے جاؤ، بلکہ یہ ہے کہ کتاب اللہ اور سنتِ رسول کی طرف رجوع کرو۔ اسی طرح اس آیت کا مطلب یہ ہے کہ پہلے تمام رسولوں کی تعلیمات کا مطالعہ کرکے دیکھ لو، کیا کسی میں یہ بات ملتی ہے کہ اللہ تعالیٰ نے رحمان کے سوا بھی کوئی ہستیاں مقرر کی ہیں کہ ان کی عبادت کی جائے اور کیا کسی بھی پیغمبر نے شرک کی اجازت دی ہے؟ ظاہر ہے اس کا جواب نفی میں ہے۔ شرک کے حق میں نہ کوئی عقلی دلیل موجود ہے نہ نقلی۔ (دیکھیے احقاف : ۴) آیت سے مقصود قریش کو باور کروانا ہے کہ تمام انبیاء اللہ واحد کی عبادت کے داعی تھے، شرک کسی بھی شریعت میں جائز نہیں رہا، جیسا کہ فرمایا : « وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ» [ الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔‘‘ اور جیسا کہ فرمایا : « وَ لَقَدْ بَعَثْنَا فِيْ كُلِّ اُمَّةٍ رَّسُوْلًا اَنِ اعْبُدُوا اللّٰهَ و وَ اجْتَنِبُوا الطَّاغُوْتَ » [ النحل : ۳۶ ] ’’اور بلاشبہ یقینا ہم نے ہر امت میں ایک رسول بھیجا کہ اللہ کی عبادت کرو اور طاغوت سے بچو۔‘‘ ¤ ➋ بعض مفسرین نے اس کا مطلب یہ بیان کیا ہے کہ جب آپ کی انبیاء سے ملاقات ہو، جیسے معراج کی رات ہوئی تو آپ ان سے یہ سوال کریں۔ مگر قرآن یا حدیث میں کہیں ذکر نہیں کہ آپ صلی اللہ علیہ وسلم نے شبِ معراج یا کسی اور موقع پر کسی پیغمبر سے یہ سوال کیا ہو۔ اگر آیت کا یہ مطلب ہوتا تو آپ صلی اللہ علیہ وسلم ان سے ضرور سوال کرتے۔ کسی ضعیف روایت میں اگر آپ صلی اللہ علیہ وسلم کے پیغمبروں سے اس سوال کا ذکر مل بھی جائے تو اس کا کوئی اعتبار نہیں۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) ➊ {وَ لَقَدْ اَرْسَلْنَا مُوْسٰى بِاٰيٰتِنَاۤ اِلٰى فِرْعَوْنَ وَمَلَئِهِ :} یہاں موسیٰ علیہ السلام کے ذکر کی مناسبت کئی طرح سے ہے، جن میں سے ایک یہ ہے کہ جب اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو اپنے سے پہلے رسولوں سے سوال کا حکم دیا کہ کیا اس نے اپنے سوا کوئی معبود مقرر کیے ہیں جن کی عبادت کی جائے، تو جن رسولوں کی کتابوں یا پیروکاروں سے یہ معلومات حاصل کی جا سکتی تھیں ان میں سب سے پہلے موسیٰ علیہ السلام تھے، کیونکہ ان کی کتاب موجود تھی اور ان کی امت کے لوگ بھی موجود تھے۔ دوسری مناسبت یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی مخالفت کرنے والے قوم کے سردار تھے، جو حق واضح ہونے کے باوجود اپنے مال و جاہ کی وجہ سے آپ کو حقیر کہہ کر آپ صلی اللہ علیہ وسلم کو رسالت کا اہل ماننے کے لیے تیار نہ تھے۔ اللہ تعالیٰ نے آپ کو تسلی دلانے کے لیے یہ واقعہ ذکر فرمایا کہ یہی معاملہ موسیٰ علیہ السلام کے ساتھ فرعون اور اس کے سرداروں کا تھا۔ فرعون نے بھی معجزات دیکھنے اور موسیٰ علیہ السلام کی نبوت دل سے ماننے کے باوجود ملک مصر کا مالک ہونے پر فخر کیا اور موسیٰ علیہ السلام کو ذلیل و حقیر قرار دے کر ان پر ایمان لانے سے انکار کر دیا۔ جس کے نتیجے میں وہ اللہ کے غضب کا نشانہ بنا اور اپنے لشکروں سمیت سمندر میں غرق کر دیا گیا۔ مقصد قریش اور عربوں کو فرعون جیسے برے انجام سے ڈرانا ہے۔ ¤ ➋ { ’’ بِاٰيٰتِنَاۤ ‘‘} میں آیات سے مراد عصا اور یدِ بیضا ہیں، کیونکہ سب سے پہلے موسیٰ علیہ السلام فرعون کے پاس گئے تو ان کے پاس یہی نشانیاں تھیں۔ ¤ ➌ { فَقَالَ اِنِّيْ رَسُوْلُ رَبِّ الْعٰلَمِيْنَ:} موسیٰ علیہ السلام نے وہ نشانیاں پیش کرکے فرعون کو رب ہونے کے دعوے سے منع کیا، اسے تمام پیغمبروں کی طرح توحید کی دعوت دی اور اکیلے رب العالمین پر ایمان لانے کا حکم دیا۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) {فَلَمَّا جَآءَهُمْ بِاٰيٰتِنَاۤ اِذَا هُمْ مِّنْهَا يَضْحَكُوْنَ: ’’ اِذَا ‘‘} اچانک کے معنی میں ہے۔ یہاں کچھ عبارت محذوف ہے جو خود سمجھ میں آ رہی ہے کہ جب موسیٰ علیہ السلام نے فرعون اور اس کے سرداروں کو رب العالمین کی توحید اور اپنی رسالت پر ایمان لانے کی دعوت دی تو انھوں نے کوئی نشانی پیش کرنے کا مطالبہ کیا۔ جب انھوں نے ان کے سامنے ہماری عطا کردہ نشانیاں عصا اور ید بیضا پیش کیں تو بجائے اس کے کہ وہ ان پر غور و فکر کرتے اور ایمان لے آتے، فوراً ہی ان پر ہنسنے اور ان کا مذاق اڑانے لگے۔ اس میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دی ہے، کیونکہ قریش کے سردار بھی آپ کی پیش کردہ نشانیاں دیکھ کر مذاق اڑاتے تھے، جیسا کہ فرمایا : « بَلْ عَجِبْتَ وَ يَسْخَرُوْنَ (12) وَ اِذَا ذُكِّرُوْا لَا يَذْكُرُوْنَ (13) وَ اِذَا رَاَوْا اٰيَةً يَّسْتَسْخِرُوْنَ » [الصافات : ۱۲ تا ۱۴ ] ’’بلکہ تو نے تعجب کیا اور وہ مذاق اڑاتے ہیں۔ اور جب انھیں نصیحت کی جائے وہ قبول نہیں کرتے۔ اور جب کوئی نشانی دیکھتے ہیں تو خوب مذاق اڑاتے ہیں۔‘‘"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) {وَ مَا نُرِيْهِمْ مِّنْ اٰيَةٍ اِلَّا هِيَ اَكْبَرُ مِنْ اُخْتِهَا … :} فرعون اور اس کے سرداروں نے جب موسیٰ علیہ السلام کو جادوگر کہا اور ان کے معجزوں کو جادو قرار دے کر اپنے تمام ماہر جادوگر جمع کرکے ان کا مقابلہ کیا اور صاف شکست کے باوجود اپنے کفر پر اڑے رہے تو اللہ تعالیٰ نے ان پر قحط مسلط کر دیا۔ اس پر انھوں نے موسیٰ علیہ السلام سے عذاب ہٹانے کی دعا کی درخواست کی اور قحط دور ہونے پر ایمان لانے کا اور بنی اسرائیل کو آزادی دینے کا وعدہ کیا۔ جب قحط دور ہوا تو وعدے سے مکر گئے، اس پر اللہ تعالیٰ نے ان پر یکے بعد دیگرے کئی عذاب بھیجے، جنن میں سے ہر ایک پہلے سے بڑی نشانی تھا اور ان عذابوں کا مقصد یہ تھا کہ وہ کفر و تکبر سے پلٹ آئیں اور ایمان قبول کر لیں۔ تفصیل اس کی سورۂ اعراف (۱۳۳) میں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { وَ قَالُوْا يٰۤاَيُّهَ السّٰحِرُ ادْعُ لَنَا رَبَّكَ … :} یہاں یہ بات اختصار کے ساتھ ذکر ہوئی ہے، سورۂ اعراف میں تفصیل کے ساتھ ہے، فرمایا : « وَ لَمَّا وَقَعَ عَلَيْهِمُ الرِّجْزُ قَالُوْا يٰمُوْسَى ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَ لَىِٕنْ كَشَفْتَ عَنَّا الررِّجْزَ لَنُؤْمِنَنَّ لَكَ وَ لَنُرْسِلَنَّ مَعَكَ بَنِيْۤ اِسْرَآءِيْلَ » [ الأعراف : ۱۳۴ ] ’’اور جب ان پر عذاب آتا تو کہتے اے موسیٰ! اپنے رب سے ہمارے لیے اس عہد کے واسطے سے دعا کر جو اس نے تیرے ہاں دے رکھا ہے، یقینا اگر تو ہم سے یہ عذاب دور کر دے تو ہم ضرور ہی تجھ پر ایمان لے آئیں گے اور تیرے ساتھ بنی اسرائیل کو ضرور ہی بھیج دیں گے۔‘‘ ¤ ➋ یہاں ایک سوال ہے کہ اتنی مشکل گھڑی میں جب وہ عذاب میں گرفتار تھے اور موسیٰ علیہ السلام سے دعا کی درخواست کر رہے تھے اس وقت بھی وہ موسیٰ علیہ السلام کو {’’ يٰۤاَيُّهَ السّٰحِرُ ‘‘} (اے جادوگر!) کے ساتھ مخاطب کر رہے ہیں، حالانکہ اس وقت تو انھیں کسی اچھے لفظ سے مخاطب کرنا چاہیے تھا۔ پھر موسیٰ علیہ السلام یہ صریح بہتان سن کر بھی انھیں کچھ نہیں کہتے، بلکہ ان کے لیے دعا کرکے انھیں عذاب سے نجات دلواتے ہیں۔ مفسرین نے اس کے کئی جواب دیے ہیں، یہاں ان میں سے دو جواب ذکر کیے جاتے ہیں۔ ابن کثیر نے فرمایا : ’’ساحر سے مراد عالم ہے، یہی ابن جریر نے فرمایا ہے۔ ان کے زمانے کے علماء جادوگر ہی تھے اور ان کے ہاں جادو بری چیز نہ تھا، اس لیے انھوں نے یہ الفاظ تنقیص کے لیے نہیں کہے، کیونکہ ان کی مجبوری کی حالت اس سے مناسبت نہیں رکھتی، بلکہ ان کے گمان کے مطابق یہ تعظیم کا لفظ تھا۔‘‘ (ابن کثیر) ¤ دوسرا جواب یہ ہے کہ انھوں نے خطاب {’’ يَا مُوْسٰي ‘‘} کے الفاظ کے ساتھ ہی کیا تھا، جیسا کہ سورۂ اعراف کی آیت (۱۳۴) میں ہے، مگر وہ دل سے انھیں جادوگر سمجھتے تھے اور وہ جادو اور جادوگروں کو مذموم ہی سمجھتے تھے، جیسا کہ اس سے پہلے فرعون اور اس کے درباریوں نے صاف الفاظ میں کہا تھا : « فَقَالُوْا سٰحِرٌ كَذَّابٌ » [ المؤمن : ۲۴ ] ’’تو انھوں نے کہا جادو گر ہے، بہت جھوٹا ہے۔‘‘ اب ان کا حال دیکھیے کہ وہی شخص جسے وہ جادوگر سمجھتے تھے نہایت عاجزی کے ساتھ اسی سے دعا کی درخواست کر رہے ہیں۔ اللہ تعالیٰ نے ان کی درخواست کا ذکر فرماتے ہوئے ان کے دل کی حالت کا ذکر اپنے الفاظ میں فرمایا ہے۔ مقصود ان پر طعن ہے کہ جب جادوگر سمجھتے ہو اور ہمیشہ اسے اسی لفظ سے یاد کرتے ہو تو اس سے دعا کی درخواست کیسی؟ اور اگر مستجاب الدعاء کہتے ہو تو جادوگر کیوں سمجھتے ہو؟ یہ ایسے ہی ہے کہ قریش جو رسول اللہ صلی اللہ علیہ وسلم کو جادوگر کہتے تھے اور آپ صلی اللہ علیہ وسلم کا مذاق اڑاتے تھے، مشکل وقت میں وہ رسول اللہ صلی اللہ علیہ وسلم سے دعا کی درخواست بھی کیا کرتے تھے، جیسا کہ عبداللہ بن مسعود رضی اللہ عنہ نے ان کا حال بیان کیا ہے، فرماتے ہیں : [ وَ إِنَّ قُرَيْشًا أَبْطَئُوْا عَنِ الْإِسْلاَمِ فَدَعَا عَلَيْهِمُ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اللّٰهُمَّ أَعِنِّيْ عَلَيْهِمْ بِس بِسَبْعٍ كَسَبْعِ يُوْسُفَ، فَأَخَذَتْهُمْ سَنَةٌ حَتّٰی هَلَكُوْا فِيْهَا، وَأَكَلُوا الْمَيْتَةَ وَالْعِظَامَ وَ يَرَی الرَّجُلُ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ كَهَيْئَةِ الدُّخَانِ، فَجَاءَهُ أَبُوْ  سُفْيَانَ فَقَالَ يَا مُحَمَّدُ ! جِئْتَ تَأْمُرُنَا بِصِلَةِ الرَّحِمِ، وَ إِنَّ قَوْمَكَ قَدْ هَلَكُوْا فَادْعُ اللّٰهَ ] [ بخاري، التفسیر، سورۃ الروم : ۴۷۷۴ ]’’قریش نے اسلام قبول کرنے میں دیر کی تو رسول اللہ صلی اللہ علیہ وسلم نے ان پر بددعا کی : ’’اے اللہ! ان کے خلاف یوسف( علیہ السلام ) کے قحط والے سات سالوں جیسے سات سالوں کے ساتھ میری مدد فرما۔‘‘ تو انھیں قحط نے آ لیا، یہاں تک کہ وہ اس میں برباد ہو گئے اور مردار اور ہڈیاں کھا گئے اور آدمی کو آسمان و زمین کے درمیان دھواں سا نظر آتا تھا۔ تو آپ صلی اللہ علیہ وسلم کے پاس ابوسفیان آیا اور کہنے لگا : ’’اے محمد! آپ ہمیں صلہ رحمی کا حکم دیتے ہیں اور حال یہ ہے کہ آپ کی قوم برباد ہو گئی ہے، اس لیے اللہ سے دعا کیجیے۔‘‘ اس حدیث میں ہے کہ جب آپ صلی اللہ علیہ وسلم کی دعا سے قحط دور ہوا تو پھر منکر ہو گئے۔ مجھے یہ دوسرا جواب بہتر معلوم ہوتا ہے۔ (واللہ اعلم)"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) {فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ اِذَا هُمْ يَنْكُثُوْنَ: ’’ اِذَا ‘‘} مفاجاتیہ ہے، جس کا معنی ’’اچانک‘‘ ہے، یعنی عذاب ہٹتے ہی فوراً عہد توڑ دیتے۔ نہ سوچنے کی زحمت کرتے، نہ عہد توڑنے میں انھیں کوئی حیا مانع ہوتی تھی۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) ➊ {وَ نَادٰى فِرْعَوْنُ فِيْ قَوْمِهٖ:} فرعون اور اس کے سرداروں نے موسیٰ علیہ السلام کے معجزات اپنی آنکھوں سے دیکھے، جن سے انھیں ان کی نبوت کا یقین ہو گیا، اس کے باوجود وہ ایمان نہ لائے، بلکہ مقابلے میں جادوگروں کو لے آئے۔ اس میں منہ کی کھائی پھر بھی ایمان نہ لائے، پھر بطور نشانی کتنے عذاب ان پر آئے جو اس وعدے کے ساتھ موسیٰ علیہ السلام سے دعا کروانے پر دور ہوئے کہ ہم عذاب دور ہونے پر ایمان لے آئیں گے اور تمھارے ساتھ بنی اسرائیل کو بھیج دیں گے، مگر وہ کسی صورت موسیٰ علیہ السلام کو رسول ماننے پر تیار نہ تھے۔ ادھر انھیں خطرہ تھا کہ عوام ان معجزات کے نتیجے میں ان کی طرف مائل ہو جائیں گے، اس لیے فرعون نے موسیٰ علیہ السلام کے رسالت کے اہل نہ ہونے کے اپنے خیال میں کئی دلائل گھڑے اور ابلاغ کے جتنے وسائل ہو سکتے تھے ان کے ساتھ پوری قوم میں ان کی منادی کروائی، جیسا کہ اس نے عصائے موسیٰ علیہ السلام کے مقابلے کے لیے تمام شہروں میں آدمی بھیج کر جادوگر اکٹھے کیے تھے، فرمایا : « فَاَرْسَلَ فِرْعَوْنُ فِي الْمَدَآىِٕنِ حٰشِرِيْنَ» [ الشعراء : ۵۳ ]’’ تو فرعون نے شہروں میں اکٹھا کرنے والے بھیج دیے۔‘‘ {’’ فِيْ قَوْمِهٖ ‘‘} کے الفاظ اس منادی کی وسعت پر دلالت کر رہے ہیں۔ ہمارے نبی کریم صلی اللہ علیہ وسلم کو یہ قصہ سنانے کا مقصد یہ ہے کہ آپ صلی اللہ علیہ وسلم کی رسالت کو تسلیم نہ کرنے کے لیے کفار نے جو دلائل تصنیف کیے ہیں وہ سبھی اس سے پہلے فرعون بھی پیش کر چکا ہے۔ وہ دلائل نہ اسے عذاب سے بچا سکے اور نہ ان لوگوں کو کفر پر اصرار کی صورت میں بچا سکیں گے۔ ¤ ➋ {قَالَ يٰقَوْمِ اَلَيْسَ لِيْ ممُلْكُ مِصْرَ وَ هٰذِهِ الْاَنْهٰرُ تَجْرِيْ مِنْ تَحْتِيْ:} یعنی برتری اور افضلیت کا پیمانہ دنیاوی مال و دولت اور حکومت و اقتدار ہے، جو موسیٰ کے پاس نہیں میرے پاس ہے۔ کیا میں مصر کے اقتدار کا مالک نہیں ہوں؟ دریائے نیل سے نکالی ہوئی نہروں کے ذریعے سے آب پاشی کا نظام میرے احکام کے تحت چل رہا ہے۔ یہی بات کفارِ مکہ نے کہی تھی : « وَ قَالُوْا لَوْ لَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيْمٍ » [ الزخرف : ۳۱ ] کہ قرآن ان دو بستیوں میں سے کسی عظیم آدمی پر اترنا چاہیے تھا۔ ¤ ➌ { اَفَلَا تُبْصِرُوْنَ:} مصر کے لوگ جو موسیٰ علیہ السلام کے کمالات اور معجزات دیکھ کر متاثر ہو رہے تھے، فرعون انھیں اپنی مادی اور دنیوی شان و شوکت کی طرف متوجہ کر رہا ہے۔ حقیقت میں یہ اس کی شکست خوردگی کی دلیل ہے، کیونکہ یہ سب کچھ تو وہ مدت سے دیکھتے چلے آ رہے تھے۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) ➊ {اَمْ اَنَا خَيْرٌ مِّنْ هٰذَا الَّذِيْ هُوَ مَهِيْنٌ: ’’ مَهُنَ يَمْهُنُ مَهَانَةً ‘‘} (ک) کے معنی ہیں {’’حَقُرَ وَضَعُفَ۔‘‘ ’’ مَهِيْنٌ ‘‘} بروزن {’’فَعِيْلٌ‘‘} حقیر، ضعیف۔ {’’ اَمْ ‘‘} سے پہلے ایک جملہ ہمزہ استفہام پر مشتمل ہوتا ہے، جو یہاں اس مفہوم کا ہو گا کہ ’’کیا یہ شخص یعنی موسیٰ( علیہ السلام ) بہتر ہے یا میں بہتر ہوں…؟‘‘ {’’ اَمْ ‘‘ ’’ بَلْ‘‘} کے معنی میں بھی آتا ہے، اس صورت میں معنی یہ ہو گا : ’’بلکہ میں بہتر ہوں…۔‘‘ ¤ ➋ فرعون موسیٰ علیہ السلام کی تحقیر کے لیے زیادہ سے زیادہ جو الفاظ استعمال کر سکتا تھا اس نے وہ کیے۔ ان میں سے لفظ {’’ هٰذَا ‘‘} بھی حقارت کے اظہار کے لیے ہے، یعنی ’’اس شخص سے جو حقیر ہے۔‘‘ وہ موسیٰ علیہ السلام کو اس لیے حقیر کہہ رہا تھا کہ ان کے پاس اس جیسی نہ دولت تھی نہ قوت و سلطنت، بلکہ وہ اس کی غلام قوم کے ایک فرد تھے اور غلام تو حقیر ہی سمجھا جاتا ہے۔ مگر یہ عجیب حقیر شخص تھا جس سے فرعون بھی شدید خوف زدہ تھا، ہر عذاب پر اس کے سامنے دعا کے لیے منت و سماجت کرتا تھا، اپنی ساری شان و شوکت، قوت و اقتدار اور افواجِ قاہرہ کے باوجود اسے اپنے دربار میں داخل ہونے سے نہیں روک سکتا تھا، جب کہ اس کے پاس نہ فوج تھی نہ اسلحہ، صرف ایک عصا ہاتھ میں لیے جب چاہتا اس کے سر پر پہنچ جاتا۔ اور یہ عجیب حقیر شخص تھا جس کے متعلق وہ اپنے سرداروں سے کہتا تھا : ’’مجھے چھوڑ دو کہ میں موسیٰ کو قتل کر دوں۔‘‘ (دیکھیے مومن : ۲۶) حالانکہ کسی نے اسے قتل کرنے سے نہیں روکا تھا اور فرعون میں یہ جرأت نہیں تھی کہ انھیں ہاتھ بھی لگا سکے۔حقیقت یہ ہے کہ دنیا کا مال یا اقتدار حقارت یا عظمت کا پیمانہ ہے ہی نہیں اور نہ ہی موسیٰ علیہ السلام حقیر تھے، بلکہ وہ ظالم خود ہی حقیر و ذلیل تھا جو دنیا کے عارضی متاع پر مغرور ہو کر حق سے انکار پر اڑا ہوا تھا۔ رسول اللہ صلی اللہ علیہ وسلم کے زمانے کے کفار بھی دنیا کی دولت نہ ہونے کی وجہ سے رسول اللہ صلی اللہ علیہ وسلم کو نبوت عطا ہونا قبول کرنے کے لیے تیار نہیں تھے۔ ¤ ➌ {وَ لَا يَكَادُ يُبِيْنُ:} بعض مفسرین نے لکھا ہے کہ اس کا اشارہ اس لکنت کی طرف تھا جو موسیٰ علیہ السلام کی زبان میں پائی جاتی تھی، مگر یہ بات درست نہیں۔ موسیٰ علیہ السلام کی دعا کے بعد وہ لکنت دور ہو گئی تھی، جیسا کہ اللہ تعالیٰ نے فرمایا کہ موسیٰ! تمھاری دعا قبول کر لی گئی ہے۔ (دیکھیے طٰہٰ : ۳۶) قرآن مجید میں فرعون کے ساتھ موسیٰ علیہ السلام کے کئی مناظرے مذکور ہیں، جن میں انھوں نے نہایت فصیح و بلیغ الفاظ میں اپنا مدعا بیان فرمایا اور ہر موقع پر فرعون کو لاجواب کیا۔ اگرچہ انھوں نے اپنی مدد کے لیے ہارون علیہ السلام کو زیادہ فصیح اللسان ہونے کی وجہ سے مانگ کر لیا تھا، مگر کہیں بھی انھیں اظہار مقصد کے لیے ہارون علیہ السلام کی ضرورت نہیں پڑی۔ رہا فرعون کا ان کے متعلق کہنا کہ ’’قریب نہیں کہ وہ اپنی بات واضح کر سکے‘‘ تو اس کی وجہ یہ تھی کہ کفار و مشرکین کی سمجھ میں پیغمبروں کی بات آتی ہی نہیں، جیسا کہ شعیب علیہ السلام جیسے زبردست خطیب کو ان کی قوم نے کہا : « يٰشُعَيْبُ مَا نَفْقَهُ كَثِيْرًا مِّمَّا تَقُوْلُ وَ اِنَّا لَنَرٰىكَ فِيْنَا ضَعِيْفًا» [ ھود : ۹۱ ] ’’اے شعیب! ہم اس میں سے بہت سی باتیں نہیں سمجھتے جو تو کہتا ہے اور بے شک ہم تو تجھے اپنے درمیان بہت کمزور دیکھتے ہیں۔‘‘ فرعون موسیٰ علیہ السلام پر وہی دو طعن کر رہا تھا جو اس سے پہلے شعیب علیہ السلام پر ان کی قوم نے کیے تھے کہ بات سمجھ میں نہ آنا اور ان کی نگاہ میں ان کا حقیر اور ضعیف ہونا۔ ہمارے نبی صلی اللہ علیہ وسلم کی بات بھی مشرکین کی سمجھ میں نہیں آتی تھی، نہ ہی وہ اپنے جیسے دولت مندوں کی موجودگی میں آپ صلی اللہ علیہ وسلم کو نبی ماننے کے لیے تیار تھے، فرمایا : « وَ عَجِبُوْۤا اَنْ جَآءَهُمْ مُّنْذِرٌ مِّنْهُمْ وَ قَالَ الْكٰفِرُوْنَ هٰذَا سٰحِرٌ كَذَّابٌ (4) اَجَعَلَ الْاٰلِهَةَ اِلٰهًا وَّاحِدًا اِنَّ هٰذَا لَشَيْءٌ عُجَابٌ (5) وَ انْطَلَقَ الْمَلَاُ مِنْهُمْ اَنِ امْشُوْا وَ اصْبِرُوْا عَلٰۤى اٰلِهَتِكُمْ اِنَّ هٰذَا لَشَيْءٌ يُّرَادُ (6) مَا سَمِعْنَا بِهٰذَا فِي الْمِلَّةِ الْاٰخِرَةِ اِنْ هٰذَاۤ اِلَّا اخْتِلَاقٌ (7) ءَاُنْزِلَ عَلَيْهِ الذِّكْرُ مِنْۢ بَيْنِنَا بَلْ هُمْ فِيْ شَكٍّ مِّنْ ذِكْرِيْ بَلْ لَّمَّا يَذُوْقُوْا عَذَابِ (8) اَمْ عِنْدَهُمْ خَزَآىِٕنُ رَحْمَةِ رَبِّكَ الْعَزِيْزِ الْوَهَّابِ» [ صٓ : ۴ تا ۹ ] ’’اور انھوں نے اس پر تعجب کیا کہ ان کے پاس انھی میں سے ایک ڈرانے والا آیا اور کافروں نے کہا یہ ایک سخت جھوٹا جادوگر ہے۔ کیا اس نے تمام معبودوں کو ایک ہی معبود بنا ڈالا؟ بلاشبہ یہ یقینا بہت عجیب بات ہے۔ اور ان کے سرکردہ لوگ چل کھڑے ہوئے کہ چلو اور اپنے معبودوں پر ڈٹے رہو، یقینا یہ تو ایسی بات ہے جس کا ارادہ کیا جاتا ہے۔ ہم نے یہ بات آخری ملت میں نہیں سنی، یہ تو محض بنائی ہوئی بات ہے۔ کیا ہمارے درمیان میں سے اسی پر نصیحت نازل کی گئی ہے؟ بلکہ وہ میری نصیحت سے شک میں ہیں، بلکہ انھوں نے ابھی تک میرا عذاب نہیں چکھا۔ کیا انھی کے پاس تیرے رب کی رحمت کے خزانے ہیں، جو سب پر غالب ہے، بہت عطا کر نے والا ہے۔‘‘"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) { فَلَوْ لَاۤ اُلْقِيَ عَلَيْهِ اَسْوِرَةٌ مِّنْ ذَهَبٍ … : ’’ اَسْوِرَةٌ ‘‘ ’’سِوَارٌ‘‘} کی جمع ہے، کنگن۔ مقصد اس کا یہ تھا کہ نہ موسیٰ علیہ السلام سونے کے کنگن پہنیں گے، نہ ان کے ساتھ فرشتے آئیں گے اور نہ ہمیں ان پر ایمان لانا پڑے گا۔ ہمارے نبی کریم صلی اللہ علیہ وسلم پر ایمان لانے کے لیے بھی کفار نے دوسری بہت سی چیزوں کے ساتھ سونے کے مکان اور اللہ تعالیٰ اور فرشتوں کو سامنے لانے کی شرط عائد کی تھی، فرمایا : « وَ قَالُوْا لَنْ نُّؤْمِنَ لَكَ حَتّٰى تَفْجُرَ لَنَا مِنَ الْاَرْضِ يَنْۢبُوْعًا (90) اَوْ تَكُوْنَ لَكَ جَنَّةٌ مِّنْ نَّخِيْلٍ وَّ عِنَبٍ فَتُفَجِّرَ الْاَنْهٰرَ خِلٰلَهَا تَفْجِيْرًا (91) اَوْ تُسْقِطَ السَّمَآءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا اَوْ تَاْتِيَ بِاللّٰهِ وَ الْمَلٰٓىِٕكَةِ قَبِيْلًا (92) اَوْ يَكُوْنَ لَكَ بَيْتٌ مِّنْ زُخْرُفٍ اَوْ تَرْقٰى فِي السَّمَآءِ » [ بني إسرائیل : ۹۰ تا ۹۳ ] ’’اور انھوں نے کہا ہم ہرگز تجھ پر ایمان نہ لائیں گے، یہاں تک کہ تو ہمارے لیے زمین سے کوئی چشمہ جاری کرے۔ یا تیرے لیے کھجوروں اور انگور کا ایک باغ ہو، پس تو اس کے درمیان نہریں جاری کردے، خوب جاری کرنا۔ یا آسمان کو ٹکڑے کر کے ہم پر گرا دے، جیسا کہ تو نے دعویٰ کیا ہے، یا تو اللہ اور فرشتوں کو سامنے لے آئے۔ یا تیرے لیے سونے کا ایک گھر ہو، یا تو آسمان میں چڑھ جائے۔‘‘ حقیقت یہ ہے کہ تمام انبیاء علیھم السلام کی دعوت ایک تھی اور سبھی کو دعوت کے سلسلے میں ایک جیسے مراحل سے گزرنا پڑا، اس لیے اللہ تعالیٰ نے پہلے پیغمبروں خصوصاً موسیٰ علیہ السلام کے واقعات بار بار بیان فرمائے ہیں، تاکہ آپ صلی اللہ علیہ وسلم کو تسلی ہو اور آپ صبر و استقامت سے کام لیں اور آپ کے زمانے کے کفار کو پہلی کافر اقوام کے انجام سے عبرت ہو اور وہ کفر سے باز آ جائیں۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ { فَاسْتَخَفَّ قَوْمَهٗ فَاَطَاعُوْهُ:} لفظی معنی ہے ’’اس نے اپنی قوم کو ہلکا (بے وزن) کر دیا۔‘‘ یعنی اس نے اپنی قوم کے لوگوں کی رائے کو کوئی وزن نہ دیا اور نہ ہی انھیں اپنی عقل سے سوچنے سمجھنے کا موقع دیا، بلکہ انھیں مجبور کیا کہ وہ اس کی ہاں میں ہاں ملا لیں۔ (دیکھیے مومن : ۲۹) چنانچہ وہ انھیں پھسلانے اور اُلُّو بنانے میں کامیاب ہو گیا اور وہ سب اس کے پیچھے لگ گئے۔ ¤ ➋ {اِنَّهُمْ كَانُوْا قَوْمًا فٰسِقِيْنَ:’’إِنَّ‘‘} تعلیل کے لیے ہوتا ہے، یعنی انھوں نے اس کی اطاعت اس لیے اختیار کی کہ فسق و فجور ان کی سرشت بن چکا تھا۔ وہ گمراہی کے راستے پر ہی چل سکتے تھے، سیدھی راہ پر چلنا ان کے بس کی بات ہی نہ تھی، جیسا کہ فرمایا: « سَاَصْرِفُ عَنْ اٰيٰتِيَ الَّذِيْنَ يَتَكَبَّرُوْنَ فِي الْاَرْضِ بِغَيْرِ الْحَقِّ وَ اِنْ يَّرَوْا كُلَّ اٰيَةٍ لَّا يُؤْمِنُوْا بِهَا وَ اِنْ يَّرَوْا سَبِيْلَ الرُّشْدِ لَا يَتَّخِذُوْهُ سَبِيْلًا وَ اِنْ يَّرَوْا سَبِيْلَ الْغَيِّ يَتَّخِذُوْهُ سَبِيْلًا ذٰلِكَ بِاَنَّهُمْ كَذَّبُوْا بِاٰيٰتِنَا وَ كَانُوْا عَنْهَا غٰفِلِيْنَ » [ الأعراف : ۱۴۶ ] ’’عنقریب میں اپنی آیات سے ان لوگوں کو پھیر دوں گا جو زمین میں حق کے بغیر بڑے بنتے ہیں اور اگر ہر نشانی دیکھ لیں تو بھی اس پر ایمان نہیں لاتے اور اگر بھلائی کا راستہ دیکھ لیں تو اسے راستہ نہیں بناتے اور اگر گمراہی کا راستہ دیکھیں تو اسے راستہ بنا لیتے ہیں، یہ اس لیے کہ انھوں نے ہماری آیات کو جھٹلایا اور وہ ان سے غافل تھے۔‘‘"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) {فَلَمَّاۤ اٰسَفُوْنَا انْتَقَمْنَا مِنْهُمْ …:} اس آیت سے ظاہر ہے کہ غصے ہونا اور انتقام لینا بھی اللہ تعالیٰ کی صفات ہیں، جیسا کہ راضی ہونا اور انعام دینا اس کی صفات ہیں۔ اللہ تعالیٰ کسی اور عذاب کے ساتھ بھی انھیں ہلاک کر سکتا تھا، مگر فرعون نے نہروں کے اپنے تحت چلنے پر فخر کیا تھا، تو اللہ تعالیٰ نے اسے پانی ہی میں غرق کرکے انتقام لیا۔ عموماً انسان جس چیز پر فخر کرتا ہے اللہ کی طرف سے وہی چیز اس کی ہلاکت کا سامان بن جاتی ہے۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) {فَجَعَلْنٰهُمْ سَلَفًا وَّ مَثَلًا لِّلْاٰخِرِيْنَ:’’ سَلَفًا ‘‘ ’’ سَالِفٌ ‘‘} کی جمع ہے، جیسے {’’خَادِمٌ‘‘} اور {’’حَارِسٌ‘‘} کی جمع {’’خَدَمٌ‘‘} اور {’’حَرَسٌ‘‘ } ہے۔ {’’سالف‘‘} اسے کہتے ہیں جو وجود میں یا کسی عمل یا کسی جگہ میں دوسرے سے پہلے ہو۔ چونکہ یہاں ذکر انتقام کا آیا ہے، اس لیے {’’ سَلَفًا ‘‘} سے مراد وہ ہیں جو انتقام میں پہلے ہیں، یعنی ان کے بعد والوں کو بھی ان جیسے انتقام کا سامنا کرنا پڑے گا۔ {’’ مَثَلًا ‘‘} کا معنی مشابہ چیز ہے، مراد عبرت ہے جو اپنے جیسے لوگوں کو دیکھ کر لی جاتی ہے کہ اگر ہم نے ان جیسے عمل جاری رکھے تو ہمارا انجام بھی وہی ہو گا۔ {’’ لِلْاٰخِرِيْنَ ‘‘} وہ لوگ جو اس کلام میں مذکور آلِ فرعون کے ساتھ آخری مشابہ ہیں۔ مراد رسول اللہ صلی اللہ علیہ وسلم کو جھٹلانے والے مشرکین ہیں، کیونکہ بت پرستی اور رسول کو جھٹلانے میں ان کے آخری مشابہ وہی ہیں۔ مطلب یہ کہ ہم نے انھیں ان آخری مشرکوں کے لیے عبرت بنا دیا، اس لیے ان پر لازم ہے کہ ان کے انجام سے نصیحت حاصل کریں۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) {وَ لَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا … :} رسول اللہ صلی اللہ علیہ وسلم جس طرح تمام پیغمبروں کا ذکر عزت و اکرام کے ساتھ کرتے تھے، عیسیٰ علیہ السلام کا ذکر بھی ہمیشہ عزت و تکریم کے ساتھ کرتے اور ان کی مثال آدم علیہ السلام کے ساتھ دیا کرتے تھے کہ جس طرح ماں باپ کے بغیر آدم علیہ السلام کی پیدائش اللہ تعالیٰ کی قدرت کا عجیب و غریب کرشمہ ہے اسی طرح باپ کے بغیر عیسیٰ علیہ السلام کی پیدائش بھی اس کی قدرت کا عجیب کرشمہ ہے۔ مدینہ جانے کے بعد وفد نجران کی آمد پر سورۂ آل عمران میں اللہ تعالیٰ نے فرمایا : « اِنَّ مَثَلَ عِيْسٰى عِنْدَ اللّٰهِ كَمَثَلِ اٰدَمَ خَلَقَهٗ مِننْ تُرَابٍ ثُمَّ قَالَ لَهٗ كُنْ فَيَكُوْنُ» [آل عمران : ۵۹ ] ’’بے شک عیسیٰ کی مثال اللہ کے نزدیک آدم کی مثال کی طرح ہے کہ اسے تھوڑی سی مٹی سے بنایا، پھر اسے فرمایا ہو جا، سو وہ ہو جاتا ہے۔‘‘ ¤ پچھلی آیات میں مشرکین مکہ کے فرشتوں کی عبادت پر ردّ کے بعد فرمایا تھا : « وَ سْـَٔلْ مَنْ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رُّسُلِنَاۤ اَجَعَلْنَا مِنْ دُوْنِ الرَّحْمٰنِ اٰلِهَةً يُّعْبَدُوْنَ » [ الزخرف : ۴۵ ] ’’اور ان سے پوچھ جنھیں ہم نے تجھ سے پہلے اپنے رسولوں میں سے بھیجا، کیا ہم نے رحمان کے سوا کوئی معبود بنائے ہیں جن کی عبادت کی جائے؟‘‘ اس پر مشرکین میں سے کسی نے عیسیٰ ابن مریم علیھما السلام کے معبود ہونے کا اعتراض جڑ دیا۔ ساتھ ہی دوسرے مشرکین نے شور مچانا شروع کر دیا کہ مسیح( علیہ السلام ) کو دیکھو! نصرانی ان کی عبادت کرتے ہیں، پھر بھی مسلمان ان کا نام عزت سے لیتے ہیں۔ ہمارے بت اور دیوی دیوتا فرشتے ہیں، کیا ہمارے معبود فرشتے بہتر ہیں یا نصرانیوں کے معبود عیسیٰ علیہ السلام بہتر ہیں؟ پھر ان کا نام عزت کے ساتھ کیوں لیا جاتا ہے اور ہمارے بتوں کو بُرا کیوں کہا جاتا ہے؟ میں نے بہت غور و فکر اور متعدد تفاسیر کے مطالعہ کے بعد آیات کے الفاظ اور سیاق و سباق کو ملحوظ رکھ کر جو تفسیر سمجھی ہے ذکر کر دی ہے۔ (واللہ اعلم) ابن عاشور نے فرمایا : ’’یہ مقام قرآن مجید کے مشکل ترین مقامات میں سے ہے۔‘‘ شاہ عبد القادر لکھتے ہیں : ’’یعنی قرآن میں ان کا ذکر آوے تو اعتراض کرتے ہیں کہ ان کو بھی خلق پوجتے ہیں، انھیں کیوں خوبی سے یاد کرتے ہو اور ہمارے پوجوں (معبودوں، بتوں) کو برا کہتے ہو۔‘‘ (موضح)"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) ➊ {وَ قَالُوْۤا ءَاٰلِهَتُنَا خَيْرٌ اَمْ هُوَ:} اس جملے کی وضاحت اوپر کی تفسیر میں بیان ہو چکی ہے۔ ¤ ➋ {مَا ضَرَبُوْهُ لَكَ اِلَّا جَدَلًا بَلْ هُمْ قَوْمٌ خَصِمُوْنَ:} یعنی ان مشرکین نے مسیح علیہ السلام کا ذکر محض جھگگڑے کے لیے کیا ہے، ورنہ وہ خوب جانتے ہیں کہ مسلمان ان کا عزت و تکریم سے ذکر معبود ہونے کے لحاظ سے نہیں کرتے، بلکہ اللہ تعالیٰ کا برگزیدہ بندہ ہونے کے لحاظ سے کرتے ہیں۔ حقیقت یہ ہے کہ یہ لوگ ہیں ہی سخت جھگڑالو کہ متکلم کی مراد اپنے پاس سے گھڑ کر جھگڑنا اور شور مچانا شروع کر دیتے ہیں۔ ¤ ➌ اکثر مفسرین نے ان آیات کی شانِ نزول یہ بیان فرمائی ہے کہ جب یہ آیت نازل ہوئی : « اِنَّكُمْ وَ مَا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ حَصَبُ جَهَنَّمَ »» [ الأنبیاء : ۹۸ ] (بے شک تم اور جنھیں تم اللہ کے سوا پوجتے ہو، جہنم کا ایندھن ہیں) تو عبد اللہ بن زِبَعریٰ کہنے لگا کہ اللہ کے سوا تو عیسیٰ ابن مریم کی پوجا بھی کی جاتی ہے، اگر وہ جہنم میں گئے تو ہمیں اپنے معبودوں کا جہنم میں جانا بھی منظور ہے۔ یہ سنتے ہی مشرکین نے بہت شور مچایا کہ محمد( صلی اللہ علیہ وسلم ) لاجواب ہو گئے۔ اس پر یہ آیت نازل ہوئی : « الَّذِيْنَ سَبَقَتْ لَهُمْ مِّنَّا الْحُسْنٰۤى اُولٰٓىِٕكَ عَنْهَا مُبْعَدُوْنَ » [ الأنبیاء : ۱۰۱ ] ’’بے شک وہ لوگ جن کے لیے ہماری طرف سے پہلے بھلائی طے ہو چکی وہ اس سے دور رکھے گئے ہوں گے۔‘‘ اور اس سورت کی آیت (۵۷) نازل ہوئی : « وَ لَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا اِذَا قَوْمُكَ مِنْهُ يَصِدُّوْنَ » ’’اور جب ابن مریم کو بطورِ مثال بیان کیا گیا، اچانک تیری قوم کے لوگ اس پر شور مچا رہے تھے۔‘‘ ( {’’زِبَعْرٰي‘‘} زاء کے کسرہ، باء کے فتحہ اور عین کے سکون کے ساتھ ہے، راء کے بعد الف مقصورہ ہے، یہ عبد اللہ بن زبعری بعد میں مسلمان ہوگئے تھے۔ {رَضِيَ اللّٰهُ عَنْهُ } ) ¤ یہ تفسیر عبد اللہ بن عباس رضی اللہ عنھما سے حسن سند کے ساتھ مروی ہے۔ [ دیکھیے مشکل الآثار، باب بیان مشکل ما روي عن رسول اللّٰہ صلی اللہ علیہ وسلم في المراد بقول اللّٰہ عزوجل : «إنکم و ما تعبدون من دون اللّٰہ حصب جھنم » ، ح : ۹۸۶ ] مسند احمد میں یہ روایت ابن عباس رضی اللہ عنھما سے ان الفاظ میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے قریش سے کہا : [ يَا مَعْشَرَ قُرَيْشٍ! إِنَّهُ لَيْسَ أَحَدٌ يُعْبَدُ مِنْ دُوْنِ اللّٰهِ فِيْهِ خَيْرٌ ] ’’اے جماعتِ قریش! حقیقت یہ ہے کہ اللہ کے سوا کسی کی عبادت نہیں کی جاتی جس میں کوئی خیر ہو۔‘‘ انھوں نے کہا : ’’اے محمد! کیا تم یہ نہیں کہتے کہ عیسیٰ نبی تھا اور اللہ کے بندوں میں سے نیک بندہ تھا، تو اگر تم سچے ہو تو مسیح اور ان کے معبود ایک جیسے ہو گئے۔‘‘ (یہ کہہ کر انھوں نے شور مچانا شروع کر دیا) تو اللہ تعالیٰ نے یہ آیت نازل فرمائی : «وَ لَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا اِذَا قَوْمُكَ مِنْهُ يَصِدُّوْنَ » [ الزخرف : ۵۷ ] ’’جب ابن مریم کو بطور مثال بیان کیا گیا، اچانک تیری قوم کے لوگ اس پر شور مچا رہے تھے۔‘‘ [ مسند أحمد : 318/1، ح : ۲۹۲۴ ] مسند کے محققین نے اس کی سند کو حسن کہا ہے۔ ¤ واضح رہے کہ ابن عباس رضی اللہ عنھما سے مروی یہ تفسیر اس تفسیر کے خلاف نہیں جو آیات کے سیاق کے لحاظ سے اوپر کی گئی ہے، کیونکہ اصولِ تفسیر میں یہ بات مسلّم ہے کہ صحابہ کرام رضی اللہ عنھم {’’نَزَلَتْ فِيْ كَذَا‘‘} (یہ آیت فلاں کے بارے میں نازل ہوئی) ان واقعات کے متعلق بھی فرما دیتے ہیں جن پر کوئی آیت منطبق ہوتی ہو۔ رسول اللہ صلی اللہ علیہ وسلم بھی ایسے مواقع پر پہلے اتری ہوئی کوئی آیت پڑھ دیتے تھے۔ ظاہر ہے مشرکین جن کی عادت ہی جھگڑنا اور کج بحثی کرنا تھا، جھگڑنے کا کوئی موقع کم ہی ہاتھ سے جانے دیتے تھے۔ ان مواقع میں سے ایک موقع : « اِنَّكُمْ وَ مَا تَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ حَصَبُ جَهَنَّمَ » [ الأنبیاء : ۹۸ ] کا نزول بھی تھا، اس پر کفار نے جو شور مچایا، آیت : « وَ لَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا اِذَا قَوْمُكَ مِنْهُ يَصِدُّوْنَ» اس پر پوری طرح منطبق ہوتی ہے، جیسا کہ ابن عباس رضی اللہ عنھما نے فرمایا۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) ➊ { اِنْ هُوَ اِلَّا عَبْدٌ …:} یعنی مسیح علیہ السلام کا اکرام ان کے معبود ہونے کی وجہ سے نہیں، کیونکہ نہ وہ رب تھے نہ رب کے بیٹے، بلکہ صرف عبد بمعنی اللہ کا غلام اور اس کی بندگی کرنے والا ہونے کی وجہ سے ہے۔ یہ قصر قلب ہے، یعنی مسیح وہ کچھ نہیں جو نصاریٰ یا دوسرے مشرک کہہ رہے ہیں، بلکہ وہ صرف بندہ ہے جس پر ہم نے انعام کیا ہے۔ ¤ ➋ { اَنْعَمْنَا عَلَيْهِ:} ان انعامات میں سے چند انعامات کا ذکر اللہ تعالیٰ نے سورۂ مائدہ کی آیات (۱۱۰ تا ۱۱۵) میں اور سورۂ آلِ عمران کی آیات (۴۵، ۴۶) میں اور دوسری آیات میں فرمایا ہے۔ ¤ ➌ {وَ جَعَلْنٰهُ مَثَلًا لِّبَنِيْۤ اِسْرَآءِيْلَ:} بنی اسرائیل کے لیے مثال بنانے سے مراد ان کے لیے نمونۂ قدرت بنانا ہے کہ انھیں باپ کے بغیر پیدا کیا اور انھیں ایسے معجزات عطا فرمائے جو ان کے زمانے میں کسی کو نہیں ملے، جنھیں دیکھ کر لوگوں کو ان کی نبوت کا یقین ہوتا تھا۔"
    },
    {
      "ayah": 60,
      "tafsir": "(آیت 60) {وَ لَوْ نَشَآءُ لَجَعَلْنَا مِنْكُمْ … :} یعنی اس زمین پر انسان باپ اور ماں سے پیدا ہوتے ہیں، عیسیٰ علیہ السلام باپ کے بغیر پیدا ہوئے تو اس سے وہ معبود نہیں بن گئے، بلکہ وہ دوسرے انسانوں کی طرح مخلوق ہیں، جیسا کہ فرشتے ماں باپ کے بغیر پیدا ہونے اور آسمانوں پر رہنے کے باوجود مخلوق ہیں، معبود نہیں بن گئے۔ بلکہ اگر ہم چاہیں تو تمھاری جگہ ان کو زمین پر لا کر تمھارے جانشین بنا دیں، نہ تم انکار کر سکتے ہو نہ انھیں انکار کی مجال ہے، تو وہ معبود کیسے بن گئے۔ اس آیت کی ایک تفسیر یہ بھی کی گئی ہے کہ اگر ہم چاہیں تو تمھیں ہلاک کر دیں اور تمھاری جگہ فرشتوں کو لے آئیں جو زمین کو آباد کریں اور ہماری عبادت کریں۔"
    },
    {
      "ayah": 61,
      "tafsir": "(آیت 61) ➊ { وَ اِنَّهٗ لَعِلْمٌ لِّلسَّاعَةِ: ’’عِلْمٌ‘‘} سے مراد علم کا ذریعہ اور نشانی ہے، یعنی عیسیٰ علیہ السلام کی پیدائش اور پہلی مرتبہ دنیا میں آنا تو خاص بنی اسرائیل کے لیے ایک نشان تھا، دوبارہ آنا قیامت کا نشان ہو گا۔ ان کے نزول سے لوگ معلوم کریں گے کہ اب قیامت بالکل قریب آ لگی ہے۔ ابن کثیر رحمہ اللہ نے فرمایا : ’’اس سے مراد قیامت سے پہلے ان کا نزول ہے، جیسا کہ اللہ تبارک و تعالیٰ نے فرمایا : «وَ اِنْ مِّنْ اَهْلِ الْكِتٰبِ اِلَّا لَيُؤْمِنَنَّ بِهٖ قَبْلَ مَوْتِهٖ وَ يَوْمَ الْقِيٰمَةِ يَكُوْنُ عَلَيْهِمْ شَهِيْدًا» [ النساء : ۱۵۹ ] ’’اور اہلِ کتاب میں سے کوئی نہیں مگر اس کی موت سے پہلے اس پر ضرور ایمان لائے گا اور وہ قیامت کے دن ان پر گواہ ہو گا۔‘‘ اس معنی کی تائید دوسری قراء ت {’’وَ إِنَّهُ لَعَلَمٌ لِلسَّاعَةِ ‘‘} سے بھی ہوتی ہے، یعنی وہ قیامت واقع ہونے کا ایک نشان اور دلیل ہے۔ مجاہد رحمہ اللہ نے فرمایا، {’’ وَ اِنَّهٗ لَعِلْمٌ لِّلسَّاعَةِ ‘‘} یعنی قیامت کی ایک نشانی عیسیٰ ابن مریم علیھما السلام کا قیامت سے پہلے نکلنا ہے۔ ایسے ہی ابوہریرہ رضی اللہ عنہ ، ابن عباس رضی اللہ عنھما ، ابوالعالیہ، ابو مالک، عکرمہ، حسن، قتادہ اور ضحاک رحمھم اللہ وغیرہ سے مروی ہے اور رسول اللہ صلی اللہ علیہ وسلم سے متواتر احادیث آئی ہیں کہ آپ صلی اللہ علیہ وسلم نے قیامت سے پہلے عیسیٰ ابن مریم علیھما السلام کے عادل و منصف امام بن کر نازل ہونے کی خبر دی۔‘‘ (ابن کثیر) ¤ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَالَّذِيْ نَفْسِيْ بِيَدِهِ، لَيُوْشِكَنَّ أَنْ  يَّنْزِلَ فِيْكُمُ ابْنُ مَرْيَمَ حَكَمًا عَدْلاً، فَييَكْسِرَ الصَّلِيْبَ، وَيَقْتُلَ الْخِنْزِيْرَ، وَيَضَعَ الْجِزْيَةَ، وَ يَفِيْضَ الْمَالُ حَتّٰی لَا يَقْبَلَهُ أَحَدٌ، حَتّٰی تَكُوْنَ السَّجْدَةُ الْوَاحِدَةُ خَيْرًاا مِّنَ الدُّنْيَا وَمَا فِيْهَا، ثُمَّ يَقُوْلُ أَبُوْ هُرَيْرَةَ وَاقْرَءُوْا إِنْ شِئْتُمْ : « وَ اِنْ مِّنْ اَهْلِ الْكِتٰبِ اِلَّا لَيُؤْمِنَنَّ بِهٖ قَبْلَ مَوْتِهٖ وَ يَوْمَ الْقِيٰمَةِ يَكُوْنُ عَلَيْهِمْ شَهِيْدًا » ( النساء:۱۵۹ )] [ بخاري، أحادیث الأنبیاء، باب نزول عیسی ابن مریم علیہما السلام : ۳۴۴۸ ] ’’اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! یقینا قریب ہے کہ تم میں ابن مریم( علیھما السلام ) انصاف کرنے والا حاکم بن کر نازل ہو، پھر وہ صلیب توڑ دے گا اور خنزیر کو قتل کرے گا اور جزیہ ختم کرے گا اور مال عام ہو جائے گا، حتیٰ کہ اسے کوئی قبول نہیں کرے گا، حتیٰ کہ ایک سجدہ دنیا و ما فیہا سے بہتر ہو گا۔‘‘ پھر ابوہریرہ رضی اللہ عنہ فرماتے ہیں : ’’اور اگر تم چاہو تو یہ آیت پڑھ لو : ’’اور اہلِ کتاب میں کوئی نہیں مگر وہ اس کی موت سے پہلے اس پر ضرور ایمان لائے گا اور وہ قیامت کے دن ان پر گواہ ہوگا۔‘‘ سورۂ نساء کی آیت (۱۵۸، ۱۵۹) کی تفسیر پر بھی نگاہ ڈال لیں۔ ¤ ➋ {’’ وَ اِنَّهٗ لَعِلْمٌ لِّلسَّاعَةِ ‘‘} کا مطلب یہ بھی ہے کہ عیسیٰ علیہ السلام کا وجود قیامت قائم ہونے کی نشانی اور دلیل ہے، کیونکہ وہ عام دستور کے خلاف باپ کے بغیر پیدا ہوئے، پھر وہ اللہ کے اذن سے مُردوں کو زندہ کرتے تھے۔ یہ دونوں باتیں اللہ تعالیٰ کی زبردست قدرت کا نشان ہیں کہ وہ قیامت برپا کرنے پر بھی یقینا قادر ہے۔ ¤ ➌ بعض مفسرین نے {’’ هٗ ‘‘} ضمیر سے مراد قرآن لیا ہے۔ ابن عاشور نے فرمایا : {’’ وَ اِنَّهٗ لَعِلْمٌ لِّلسَّاعَةِ ‘‘} کا عطف {’’ وَ اِنَّهٗ لَذِكْرٌ لَّكَ وَ لِقَوْمِكَ ‘‘} پر ہے، یعنی یہ قرآن تمھارے لیے قیامت کا علم حاصل ہونے کا ذریعہ ہے، جس سے تمھیں اس کے قیام اور اس میں پیش آنے والے معاملات سے آگاہی حاصل ہوتی ہے۔‘‘ ابن کثیر نے قتادہ، حسن بصری اور سعید بن جبیر رحمھم اللہ کا یہی قول بیان کیا ہے کہ {’’ هٗ ‘‘} ضمیر سے مراد قرآن ہے۔ ¤ ➍ {فَلَا تَمْتَرُنَّ بِهَا …:} یعنی قرآن تمھیں قیامت کے وقوع سے آگاہ کرتا ہے، اس لیے تم اس میں ہر گز شک نہ کرو اور میری پیروی کرو، یہ صراط مستقیم ہے جس کی میں تمھیں دعوت دیتا ہوں۔"
    },
    {
      "ayah": 62,
      "tafsir": "(آیت 62) {وَ لَا يَصُدَّنَّكُمُ الشَّيْطٰنُ …:} یعنی دیکھنا شیطان اپنے ہتھکنڈوں کے ساتھ تمھیں قیامت پر ایمان سے روک نہ دے، کیونکہ وہ تمھارا کھلا دشمن ہے۔ اس نے کبھی اپنی عداوت کو چھپایا نہیں، بلکہ ڈنکے کی چوٹ آدم( علیہ السلام ) اور اس کی اولاد کو گمراہ کرتے رہنے کا اعلان کیا، اس لیے تم بھی اسے دشمن سمجھو اور اس سے خبردار رہو۔ (دیکھیے فاطر : ۶۔ کہف : ۵۰) معلوم ہوا جو شخص قیامت کے بارے میں شک کرتا ہے وہ شیطان کے ہتھے چڑھ چکا ہے۔ شیطان کی بہت بڑی دشمنی اور گمراہ کرنا یہ ہے کہ وہ کسی شخص کو قیامت پر یقین سے محروم کر دے۔ شیطان سے بچنے کا طریقہ یہ ہے کہ آدمی اللہ تعالیٰ کی دی ہوئی ہدایات پر سیدھا چلتا جائے، ادھر ادھر بالکل توجہ نہ دے۔ موسیٰ علیہ السلام کی طرف پہلی وحی میں اللہ تعالیٰ نے انھیں قیامت کے آنے سے آگاہ کرنے کے ساتھ ہی تاکید فرمائی کہ دیکھنا، وہ لوگ جو اس پر ایمان نہیں رکھتے تمھیں اس پر ایمان سے روک نہ دیں، ورنہ انجام ہلاکت ہو گا۔ دیکھیے سورۂ طٰہٰ (۱۵، ۱۶)۔"
    },
    {
      "ayah": 63,
      "tafsir": "(آیت 63) ➊ { وَ لَمَّا جَآءَ عِيْسٰى بِالْبَيِّنٰتِ: ’’اَلْبَيِّنَاتُ‘‘ ’’بَيِّنَةٌ‘‘} کی جمع ہے، واضح، روشن چیز۔ یہ محذوف موصوف کی صفت ہے جو معجزات بھی ہیں، دلائل بھی اور آیات بھی۔ یعنی جب عیسیٰ علیہ السلام واضح اور روشن معجزات، توحیدِ الٰہی اور اپنی رسالت کے واضح دلائل اور اللہ تعالیٰ کی واضح اور روشن آیات لے کر آئے۔ ¤ ➋ { قَالَ قَدْ جِئْتُكُمْ بِالْحِكْمَةِ: ’’اَلْحِكْمَةُ‘‘} محکم اور پکی بات، دانائی کی بات جو صحیح عقل کے عین مطابق ہو۔ ¤ ➌ { وَ لِاُبَيِّنَ لَكُمْ بَعْضَ الَّذِيْ تَخْتَلِفُوْنَ فِيْهِ …:} یعنی جب عیسیٰ علیہ السلام بینات لے کر بنی اسرائیل کے پاس آئے تو انھیں بتایا کہ میں تمھارے پاس اللہ کی شریعت لے کر آیا ہوں، جو نہایت محکم اور مضبوط ہے اور سراسر دانائی پر مشتمل ہے، تاکہ وہ تمھیں سکھاؤں اور تاکہ بعض باتیں جن میں تمھارے درمیان اختلاف پیدا ہو گیا ہے ان میں محکم اور پختہ بات کے ساتھ حق واضح کر دوں۔ بعض اس لیے فرمایا کہ پیغمبر کا کام دینی احکام کی رہنمائی ہے، دنیوی معاملات مثلاً تجارت، زراعت اور صنعت وغیرہ کو لوگوں کے تجربہ و عقل پر رہنے دیا گیا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَنْتُمْ أَعْلَمُ بِأَمْرِ دُنْيَاكُمْ ] [ مسلم، الفضائل، باب وجوب امتثال ما قالہ شرعا… : ۲۳۶۳ ] ’’اپنا دنیاوی معاملہ تم بہتر جانتے ہو۔‘‘ یا بعض اس لیے فرمایا کہ بعض کا فیصلہ آخری پیغمبر کے آنے پر چھوڑ دیا گیا۔ ¤ واضح رہے کہ بنی اسرائیل میں توحید، قیامت اور مختلف اشیاء کی حلت و حرمت کے بارے میں کئی طرح کا اختلاف پیدا ہو گیا تھا، مثلاً ان میں سے کچھ حق پر قائم تھے تو بعض عزیر علیہ السلام کو اللہ کا بیٹا کہنے لگ گئے تھے۔ قیامت کے متعلق انھوں نے ایسے عقائد گھڑ لیے تھے جن سے اللہ تعالیٰ کے ہاں جواب دہی کا معاملہ ہی ختم ہو جاتا تھا۔ مثلاً ان کا کہنا : «نَحْنُ اَبْنٰٓؤُا اللّٰهِ وَ اَحِبَّآؤُهٗ » [ المائدۃ : ۱۸ ] ’’ہم اللہ کے بیٹے اور اس کے پیارے ہیں۔‘‘ یعنی ہم بنی اسرائیل اللہ کے بیٹے اور اس کے چہیتے ہیں ( جس طرح مسلمانوں میں کئی سید بادشاہ اپنے بارے میں باور کرواتے ہیں) اور یہ کہ جنت ہمارا حق ہے، اگر جہنم میں گئے بھی تو چند روز کے لیے جائیں گے۔ کچھ چیزیں ان کی سرکشی اور نافرمانی کی وجہ سے ان پر حرام کی گئی تھیں، کچھ ان کے احبار و رہبان نے حرام کر دی تھیں۔ عیسیٰ علیہ السلام نے فرمایا کہ میں تمھارے ان اختلافات میں حق واضح کرنے کے لیے آیا ہوں، اس لیے تم اللہ سے ڈرو اور میری اطاعت کرو۔"
    },
    {
      "ayah": 64,
      "tafsir": "(آیت 64) ➊ {اِنَّ اللّٰهَ هُوَ رَبِّيْ وَ رَبُّكُمْ:} یہ ہے وہ حکمت جس کے لیے تمام انبیاء مبعوث ہوئے۔ {’’ رَبِّيْ وَ رَبُّكُمْ ‘‘} خبر معرفہ ہونے کی وجہ سے حصر پیدا ہو رہا ہے اور ضمیر فصل {’’ هُوَ ‘‘} لانے سے تاکید مزید ہو گئی ہے کہ میرا رب اور تمھارا رب صرف اللہ ہے، کوئی فرشتہ یا پیغمبر یا کوئی اور رب نہیں۔ ¤ ➋ { فَاعْبُدُوْهُ:} فاء تعلیل کے لیے ہے، یعنی جب ’’رب‘‘ (پرورش کرنے والا) صرف اللہ تعالیٰ ہے تو عبادت بھی اسی کی کرو، یہ سیدھا راستہ ہے۔ عیسیٰ علیہ السلام کا یہ کلام نقل کرنے کا مقصد یہ ہے کہ انھوں نے کبھی نہیں کہا کہ میں خود اللہ ہوں یا اللہ تعالیٰ کا بیٹا ہوں، اس لیے تم میری عبادت کرو، بلکہ ان کی دعوت وہی تھی جو تمام انبیاء( علیھم السلام ) کی تھی اور جس کی طرف محمد( صلی اللہ علیہ وسلم ) تمھیں بلا رہے ہیں۔"
    },
    {
      "ayah": 65,
      "tafsir": "(آیت 65) ➊ { فَاخْتَلَفَ الْاَحْزَابُ مِنْۢ بَيْنِهِمْ:} عیسیٰ علیہ السلام کے اس ارشاد کے باوجود بنی اسرائیل اختلاف سے باز نہیں آئے، بلکہ وہ عیسیٰ علیہ السلام کی ذات کے بارے میں مزید گروہوں میں بٹ گئے۔ بعض نے انھیں سچا رسول تسلیم کر لیا اور بعض نے انھیں جھوٹا اور مکار قرار دیا۔ پھر انکار کرنے والے کئی اس حد تک جا پہنچے کہ ان کی والدہ پر تہمت لگا کر انھیں ولد الزنا قرار دیا اور اس قدر مخالفت کی کہ اپنے گمان میں صلیب پر چڑھا کر دم لیا۔ اور ایمان لانے والے اگر کچھ راہِ راست پر رہے تو بعض نے انھیں اللہ تعالیٰ کا بیٹا، بعض نے تین خداؤں میں سے ایک اور بعض نے اللہ ہی قرار دے لیا اور ہر فرقے نے ایسی ہٹ دھرمی سے کام لیا کہ بے شمار فرقے وجود میں آ کر ایک دوسرے سے جھگڑنے لگے۔ {’’ مِنْۢ بَيْنِهِمْ ‘‘} کا مطلب یہ ہے کہ اختلاف کا باعث بیرونی نہیں تھا بلکہ وہ خود ہیی تھے۔ ¤ ➋ { فَوَيْلٌ لِّلَّذِيْنَ ظَلَمُوْا مِنْ عَذَابِ يَوْمٍ اَلِيْمٍ:} ظلم کرنے والوں سے مراد وہ گروہ ہیں جنھوں نے انھیں جھوٹا قرار دیا اور وہ بھی جنھوں نے ان کی عقیدت میں غلو اختیار کرتے ہوئے انھیں اللہ کا بیٹا یا خود اللہ قرار دے کر شرک کا ارتکاب کیا۔ {’’ يَوْمٍ اَلِيْمٍ ‘‘} سے مراد قیامت کا دن ہے۔"
    },
    {
      "ayah": 66,
      "tafsir": "(آیت 66) ➊ {هَلْ يَنْظُرُوْنَ اِلَّا السَّاعَةَ اَنْ تَاْتِيَهُمْ بَغْتَةً:} یہ اس سوال کا جواب ہے جو پچھلی آیت کے آخری جملے سے پیدا ہو سکتا ہے کہ ظالموں کے لیے ’’ويل‘‘ (ہلاکت) کا وہ دن کب ہو گا اور اس عذابِ الیم کی کیفیت کیا ہو گی؟ جواب یہ ہے کہ اس کا آنا یقینی ہے، جلدی آئے یا دیر سے، اس لیے اس کی تیاری کرو، اس بحث میں مت پڑو کہ وہ کب آئے گی۔ {’’ بَغْتَةً ‘‘} (اچانک) کا مطلب ہی یہ ہے کہ تمھیں اس کے آنے کا وقت معلوم نہیں ہو سکتا، کیونکہ جس کے آنے کا وقت معلوم ہو جائے وہ اچانک نہیں ہوتی۔ دیکھیے سورۂ اعراف (۱۸۷) اور سورۂ یس (۴۹، ۵۰)۔ ¤ ➋ { وَ هُمْ لَا يَشْعُرُوْنَ:} یہاں ایک سوال ہے کہ {’’ بَغْتَةً ‘‘} (اچانک) کے لفظ کے بعد {’’ وَ هُمْ لَا يَشْعُرُوْنَ ‘‘} کی کیا ضرورت ہے ؟ جواب یہ ہے کہ بعض اوقات ایسی چیزیں بھی اچانک آ جاتی ہیں جن کے متعلق انسان سوچ رہا ہوتا ہے اور ایک جواب یہ ہے کہ یہ {’’ بَغْتَةً ‘‘} کی تاکید ہے۔"
    },
    {
      "ayah": 67,
      "tafsir": "(آیت 67) ➊ {اَلْاَخِلَّآءُ يَوْمَىِٕذٍۭ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ:} یہ اس دن کے عذابِ الیم کی ہولناکی کا کچھ بیان ہے۔ اس دن متقین کے سوا تمام دلی دوستوں کے ایک دوسرے کے دشمن ہو جانے کا خاص طور پر ذکر کرنے کی مناسبت یہ ہے کہ مشرکین نے دنیا میں ایک دوسرے کی دوستی ہی کی وجہ سے رسول اللہ صلی اللہ علیہ وسلم کی دشمنی میں ایکا کیا ہوا تھا اور باہمی گٹھ جوڑ ہی کی وجہ سے شرک پر جمے ہوئے تھے۔ یہی دوستی قیامت کے دن دشمنی میں بدل جائے گی اور ہر شخص دوسرے کو اپنی بربادی کا باعث قرار دے گا اور کہے گا : « يٰوَيْلَتٰى لَيْتَنِيْ لَمْ اَتَّخِذْ فُلَانًا خَلِيْلًا » [ الفرقان : ۲۸ ] ’’ہائے میری بربادی! کاش کہ میں فلاں کو دلی دوست نہ بناتا۔‘‘ جیسا کہ اللہ تعالیٰ نے ابراہیم علیہ السلام کا اپنی قوم سے خطاب نقل فرمایا : «وَ قَالَ اِنَّمَا اتَّخَذْتُمْ مِّنْ دُوْنِ اللّٰهِ اَوْثَانًا مَّوَدَّةَ بَيْنِكُمْ فِي الْحَيٰوةِ الدُّنْيَا ثُمَّ يَوْمَ الْقِيٰمَةِ يَكْفُررُ بَعْضُكُمْ بِبَعْضٍ وَّ يَلْعَنُ بَعْضُكُمْ بَعْضًا وَّ مَاْوٰىكُمُ النَّارُ وَ مَا لَكُمْ مِّنْ نّٰصِرِيْنَ » [ العنکبوت : ۲۵ ] ’’اور اس نے کہا بات یہی ہے کہ تم نے اللہ کے سوا بت بنائے ہیں، دنیا کی زندگی میں آپس کی دوستی کی وجہ سے، پھر قیامت کے دن تم میں سے بعض بعض کا انکار کرے گا اور تم میں سے بعض بعض پر لعنت کرے گا اور تمھارا ٹھکانا آگ ہی ہے اور تمھارے لیے کوئی مدد کرنے والے نہیں۔‘‘ ¤ ➋ { اِلَّا الْمُتَّقِيْنَ:} متقین کی دوستی اس دن بھی قائم رہے گی، کیونکہ اس کا باعث اللہ کی رضا کا حصول ہوتا ہے جو ہمیشہ باقی رہنے والی چیز ہے۔ دوسرے تمام دوستوں کی دوستی کا باعث کوئی نہ کوئی دنیوی مفاد ہوتا ہے جس کے ختم ہونے کے ساتھ دوستی بھی ختم ہو جائے گی بلکہ دشمنی میں بدل جائے گی، کیونکہ وہ دوستی ہی اس دن کے عذاب کا باعث بنی۔"
    },
    {
      "ayah": 68,
      "tafsir": "(آیت 68) {يٰعِبَادِ لَا خَوْفٌ عَلَيْكُمُ الْيَوْمَ … :} قیامت کے دن باہمی محبت کرنے والے متقین کو ملنے والی نعمتوں کا ذکر ہے، جن میں سے سب سے پہلی اللہ تعالیٰ کا ’’اے میرے بندو!‘‘ کہہ کر محبت سے خطاب ہے، پھر خوف اور غم سے مکمل نجات ہے۔ دیکھیے سورۂ یونس (۶۲)۔"
    },
    {
      "ayah": 69,
      "tafsir": "(آیت 69) { اَلَّذِيْنَ اٰمَنُوْا بِاٰيٰتِنَا … :} اس میں ان لوگوں کی چند صفات بیان فرمائیں جو قیامت کے دن خوف اور غم سے آزاد ہوں گے۔ آیت کے الفاظ سے یہاں ایمان اور اسلام کا الگ الگ ہونا ظاہر ہے۔ (دیکھیے حجرات : ۱۴) البتہ جب کہیں اکیلے ایمان یا اسلام کا ذکر آئے تو دونوں ایک ہوتے ہیں۔ مطلب یہ ہے کہ وہ لوگ ہماری آیات پر یقین کے ساتھ ساتھ عملی طور پر بھی پوری طرح تابع فرمان تھے۔"
    },
    {
      "ayah": 70,
      "tafsir": "(آیت 70) ➊ { اُدْخُلُوا الْجَنَّةَ اَنْتُمْ وَ اَزْوَاجُكُمْ: ’’ اَزْوَاجُكُمْ ‘‘} کی تفسیر میں دو وجہیں ہیں، ایک یہ کہ اس سے مراد ایسے لوگ ہیں جو دنیا میں ان کے ہم مشرب اور ساتھی رہے۔ دوسری یہ کہ مراد ان کی بیویاں ہیں جنھوں نے نیک اعمال میں ان کا ساتھ دیا تھا۔ دونوں بیک وقت بھی مراد ہو سکتے ہیں، مگر بیویاں مراد لینا زیادہ قریب ہے، کیونکہ قرآن مجید میں ان کا بار بار ذکر ہے اور ان کے ساتھ مل کر جانے میں جو لذت اور خوشی ہے وہ دوسرے ہم مشرب ساتھیوں کے ساتھ نہیں۔ دیکھیے سورۂ یس (۵۵، ۵۶)، دخان (۵۴)، واقعہ (۲۲، ۲۳)، رحمان (۷۰ تا ۷۲)، صافات (۴۸) اور سورۂ ص (۵۲)۔ ¤ ➋ { تُحْبَرُوْنَ:} اس کی تفسیر کے لیے دیکھیے سورۂ روم کی آیت (۱۵) کی تفسیر۔"
    },
    {
      "ayah": 71,
      "tafsir": "(آیت 71) ➊ { يُطَافُ عَلَيْهِمْ بِصِحَافٍ مِّنْ ذَهَبٍ وَّ اَكْوَابٍ: ’’صِحَافٌ‘‘ ’’صَحْفَةٌ‘‘} کی جمع ہے، تھال جو بہت بڑا نہ ہو، رکابیاں۔ {’’ اَكْوَابٍ ‘‘ ’’كُوْبٌ‘‘} کی جمع ہے، پینے کا برتن جس کی دستی نہ ہو، ایسے برتن دستی نہ ہونے کی وجہ سے زیادہ صاف ہوتے ہیں۔ تھالوں میں طرح طرح کے کھانے اور میوے ہوں گے اور پیالوں میں طرح طرح کی پینے کی چیزیں۔ بعض مفسرین نے فرمایا : {’’صِحَافٌ‘‘} جمع کثرت ہے اور {’’ اَكْوَابٍ ‘‘} جمع قلت، کیونکہ کھانے کے برتن پینے کے برتنوں سے زیادہ ہوتے ہیں۔ ¤ ➋ { وَ فِيْهَا مَا تَشْتَهِيْهِ الْاَنْفُسُ:} اس کی تفسیر کے لیے دیکھیے سورۂ حم سجدہ (۳۱) اور سورۂ سجدہ (۱۷)۔ ¤ ➌ { وَ تَلَذُّ الْاَعْيُنُ:} آنکھوں کی لذت میں اللہ تعالیٰ کا دیدار جنت کی تمام نعمتوں سے بڑی نعمت ہے۔"
    },
    {
      "ayah": 72,
      "tafsir": "(آیت 72) {وَ تِلْكَ الْجَنَّةُ الَّتِيْۤ اُوْرِثْتُمُوْهَا … :} اس آیت کی وضاحت کے لیے دیکھیے سورۂ اعراف (۴۳)، مومنون (۱۰، ۱۱) اور سورۂ مریم (۶۳)۔"
    },
    {
      "ayah": 73,
      "tafsir": "(آیت 73) { لَكُمْ فِيْهَا فَاكِهَةٌ كَثِيْرَةٌ مِّنْهَا تَاْكُلُوْنَ :} انسان کی مطلوبہ چیزوں یعنی کھانے پینے، نکاح اور آرام و آسائش وغیرہ میں سب سے عام ضرورت اور طلب کھانے کی چیزوں کی ہوتی ہے، جن میں پھلوں کو خاص مقام حاصل ہے، کیونکہ لذت میں انھیں بہت برتری حاصل ہے۔ {’’ فَاكِهَةٌ ‘‘} کے لفظ ہی میں لذت کا مفہوم شامل ہے۔ دنیا میں فواکہ جتنے بھی ہوں کم ہیں، جبکہ آخرت میں مسلمانوں کے لیے فواکہ کثیر تعداد میں ہوں گے، جو اتنے وافر ہوں گے کہ وہ ان میں سے کچھ ہی کھا سکیں گے، یعنی {’’ مِنْهَا تَاْكُلُوْنَ ‘‘} اور وہ کبھی ختم نہیں ہوں گے، فرمایا : « لَا مَقْطُوْعَةٍ وَّ لَا مَمْنُوْعَةٍ » [ الواقعۃ : ۳۳ ] ’’جو نہ کبھی ختم ہوں گے اور نہ ان سے کوئی روک ٹوک ہو گی۔‘‘"
    },
    {
      "ayah": 74,
      "tafsir": "(آیت 74) { اِنَّ الْمُجْرِمِيْنَ فِيْ عَذَابِ جَهَنَّمَ خٰلِدُوْنَ:} ایمان والوں کا حسنِ انجام بیان کرنے کے بعد کفار کا انجام بد بیان فرمایا۔ یہاں {’’ الْمُجْرِمِيْنَ ‘‘} سے مراد کفار ہیں، کیونکہ ان کا ذکر {’’ مُسْلِمِيْنَ ‘‘} کے مقابلے میں آیا ہے اور جہنم میں ہمیشہ رہنے والے کفار ہی ہیں۔ سورۂ مطففین میں بھی کفار کے لیے {’’ الَّذِيْنَ اَجْرَمُوْا ‘‘} کا لفظ استعمال ہوا ہے، فرمایا : « اِنَّ الَّذِيْنَ اَجْرَمُوْا كَانُوْا مِنَ الَّذِيْنَ اٰمَنُوْا يَضْحَكُوْنَ » [ المطففین : ۲۹ ] ’’بے شک وہ لوگ جنھوں نے جرم کیے، ان لوگوں پر جو ایمان لائے، ہنسا کرتے تھے۔‘‘"
    },
    {
      "ayah": 75,
      "tafsir": "(آیت 75) ➊ { لَا يُفَتَّرُ عَنْهُمْ: ’’فُتُوْرٌ‘‘} کسی چیز میں وقفہ یا ٹھہراؤ آنا، یا اس کی قوت یا رفتار میں آہستہ آہستہ کمی آتے جانا، جیسے کہا جاتا ہے : {’’فَتَرَتِ الْحُمّٰي‘‘} ’’بخار میں کمی یا وقفہ ا ٓ گیا۔‘‘ {’’ لَا يُفَتَّرُ ‘‘} (باب تفعیل) کا مطلب یہ ہے کہ ان کے عذاب میں کسی قسم کا وقفہ یا کمی نہیں آنے دی جائے گی۔ ¤ ➋ { وَ هُمْ فِيْهِ مُبْلِسُوْنَ:} مصیبت سے نجات کی امید بھی کچھ نہ کچھ راحت کا باعث ہوتی ہے، یہ کہہ کر امید کی بھی نفی فرما دی کہ وہ اسی جہنم میں مایوس اور ناامید ہو کر رہنے والے ہیں۔"
    },
    {
      "ayah": 76,
      "tafsir": "(آیت 76) {وَ مَا ظَلَمْنٰهُمْ وَ لٰكِنْ كَانُوْا …:} یہاں خیال ہو سکتا تھا کہ اتنی بڑی اور دائمی سزا تو ظلم ہے، اس لیے فرمایا کہ ہم نے ان پر کسی طرح کا ظلم نہیں کیا، کیونکہ یہ محال ہے کہ اللہ تعالیٰ کسی پر ظلم کرے، بلکہ وہ خود ہی ظلم کرنے والے تھے، حتیٰ کہ ظالم ہونا ان کی صفت اور پہچان بن گیا، کیونکہ ظلم ان کا دائمی عمل اور ان کی عادت اور جبلت بن چکا تھا، ان کی نیت اور ارادہ یہی تھا کہ جب تک رہیں گے اسی پر قائم رہیں گے، اگر ان کے بس میں ہوتا تو وہ کبھی نہ مرتے اور ہمیشہ ظلم و شرک پر جمے رہتے۔ چونکہ اعمال کا دار و مدار نیتوں پر ہے، اس لیے انھیں ہمیشہ ظلم کی نیت پر ہمیشہ کا عذاب دیا گیا اور ہم نے ان پر ظلم نہیں کیا بلکہ وہ خود ظالم تھے۔"
    },
    {
      "ayah": 77,
      "tafsir": "(آیت 77) {وَ نَادَوْا يٰمٰلِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ … : ’’ قَضٰي عَلَيْهِ ‘‘} کا معنی کام تمام کرنا، یعنی موت دے دینا ہے، جیسا کہ فرمایا : «فَوَكَزَهٗ مُوْسٰى فَقَضٰى عَلَيْهِ» [ القصص : ۱۵ ] ’’تو موسیٰ نے اسے گھونسا مارا تو اس کا کام تمام کر دیا۔‘‘ {’’مالك‘‘} جہنم کے خازن (دربان) فرشتے کا نام ہے۔ سمرہ بن جندب رضی اللہ عنہ سے مروی طویل حدیث میں ہے کہ خواب میں جبریل اور میکائیل علیھما السلام نے نبی صلی اللہ علیہ وسلم کو بہت سی چیزوں کا مشاہدہ کروایا اور بعد میں ان کی حقیقت بیان کی۔ اس میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فَانْطَلَقْنَا فَأَتَيْنَا عَلٰی رَجُلٍ كَرِيْهِ الْمَرْآةِ كَأَكْرَهِ مَا أَنْتَ رَاءٍ رَجُلاً مَرْآةً، فَإِذَا عِنْدَهُ نَارٌ يَحُشُّهَا وَيَسْعٰي حَوْلَهَا،ا، قَالَ قُلْتُ لَهُمَا مَا هٰذَا؟ ] ’’پھر ہم آگے بڑھے تو ایک اآدمی کے پاس پہنچے جو دیکھنے میں بہت بد صورت تھا، اتنا جتنا کہ کوئی دیکھنے میں زیادہ سے زیادہ بدصورت ہو سکتا ہے۔ اس کے پاس آگ ہے، وہ اسے بھڑکا رہا ہے اور اس کے اردگرد دوڑ رہا ہے۔‘‘ نبی صلی اللہ علیہ وسلم نے فرمایا کہ میں نے ان دونوں سے پوچھا : ’’یہ کون ہے؟‘‘ حدیث کے آخر میں جب فرشتے نے سب چیزوں کے متعلق بتایا تو کہا : [ وَأَمَّا الرَّجُلُ الْكَرِيْهُ الْمَرْآةِ الَّذِيْ عِنْدَ النَّارِ يَحُشُّهَا وَيَسْعٰی حَوْلَهَا فَإِنَّهُ مَالِكٌ خَازِنُ جَهَنَّمَ ] [ بخاري، التعبیر، باب تعبیر الرؤیا بعد صلاۃ الصبح : ۷۰۴۷ ] ’’آگ کے پاس دیکھنے میں جو بدصورت آدمی تم نے دیکھا جو اسے بھڑکا رہا تھا اور اس کے گرد دوڑ رہا تھا وہ جہنم کا خازن مالک ہے۔‘‘ کفار جہنم کے فرشتوں کو اللہ سے ان کے عذاب میں کچھ نہ کچھ تخفیف کرنے کی دعا کے لیے کہیں گے۔ جب اس سے ناامید ہوں گے تو جہنم کے خازن مالک کو آواز دیں گے کہ اپنے رب سے دعا کر کہ ہمیں موت دے دے۔ وہ کہے گا، تم یہیں رہنے والے ہو۔ غرض وہ اس عذاب سے کسی طرح نجات نہیں پائیں گے۔ دوسری جگہ فرمایا : « وَ الَّذِيْنَ كَفَرُوْا لَهُمْ نَارُ جَهَنَّمَ لَا يُقْضٰى عَلَيْهِمْ فَيَمُوْتُوْا وَ لَا يُخَفَّفُ عَنْهُمْ مِّنْ  عَذَابِهَا كَذٰلِكَ نَجْزِيْ كُلَّ كَفُوْرٍ» [ فاطر : ۳۶ ] ’’اور وہ لوگ جنھوں نے کفر کیا ان کے لیے جہنم کی آگ ہے، نہ ان کا کام تمام کیا جائے گا کہ وہ مر جائیں اور نہ ان سے اس کا کچھ عذاب ہی ہلکا کیا جائے گا۔ ہم ایسے ہی ہر ناشکرے کو بدلا دیا کرتے ہیں۔‘‘"
    },
    {
      "ayah": 78,
      "tafsir": "(آیت 78) {لَقَدْ جِئْنٰكُمْ بِالْحَقِّ وَ لٰكِنَّ اَكْثَرَكُمْ … :} اس آیت میں اللہ تعالیٰ کا خطاب اہلِ جہنم سے بھی مراد ہو سکتا ہے اور دنیا میں قریش اور دوسرے کفار سے بھی۔ پہلی صورت میں جو فرمایا کہ تم میں سے اکثر حق کو ناپسند کرنے والے تھے تو اس لیے کہ ان کے قلیل لوگ حق کو ناپسند کرنے والے نہیں تھے، وہ تو اپنے اکابر و سادات کی اندھا دھند پیروی کرنے کی وجہ سے کفر پر قائم رہنے والے تھے۔ اکثر وہی تھے جو حق کو پہچانتے تھے مگر اپنے مفادات اور خواہشات سے متصادم ہونے کی وجہ سے اس سے نفرت کرتے تھے۔ دوسری صورت میں دنیا میں کفار کا حال بیان فرمایا کہ ان کے اکثر حق آنے کے بعد اپنی خواہشات کے خلاف ہونے کی وجہ سے اسے ناپسند کرنے والے ہوتے ہیں۔ رہے کم لوگ تو وہ پسند یا ناپسند کی وجہ سے نہیں بلکہ تقلید کی وجہ سے کفر پر جمے رہتے ہیں۔"
    },
    {
      "ayah": 79,
      "tafsir": "(آیت 79) { اَمْ اَبْرَمُوْۤا اَمْرًا فَاِنَّا مُبْرِمُوْنَ: ’’إِبْرَامٌ‘‘} کا معنی کسی چیز کو پختہ اور مضبوط کرنا ہے۔ اصل میں یہ رسی کو مضبوطی کے ساتھ بٹنے کے لیے استعمال ہوتا ہے۔ کہا جاتا ہے : {’’أَبْرَمَ فُلَانٌ الْحَبْلَ‘‘} ’’فلاں نے رسی کو خوب مضبوط کیا۔‘‘ یعنی یا انھوں نے کسی کام کی پختہ تدبیر اور اس کا پکا فیصلہ کر لیا ہے۔ اس سے مراد کفار کی خفیہ مجلسوں میں ان کے طے کردہ فیصلے ہیں جو وہ اسلام اور مسلمانوں کے خلاف کرتے تھے، حتیٰ کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو قید یا قتل کرنے یا مکہ سے نکالنے کا پکا فیصلہ کر لیا۔ (دیکھیے انفال : ۳۰) فرمایا، انھوں نے ایسے کسی کام کا پختہ ارادہ کر لیا ہے تو ہم بھی پکی تدیبر کرنے والے ہیں۔ پھر سب نے دیکھا کہ وہ کس طرح ناکام و نامراد ہوئے اور اللہ کا دین کس طرح غالب رہا۔"
    },
    {
      "ayah": 80,
      "tafsir": "(آیت 80) ➊ { اَمْ يَحْسَبُوْنَ اَنَّا لَا نَسْمَعُ سِرَّهُمْ وَ نَجْوٰىهُمْ:} یہاں {’’ سِرَّهُمْ ‘‘} سے مراد وہ باتیں ہیں جو وہ راز کے طور پر ایک دوسرے کے ساتھ خفیہ طور پر آہستہ آواز میں کرتے ہیں، کیونکہ اگر {’’سِرٌّ‘‘} سے دل میں موجود  بات مراد ہو تو وہ سنی نہیں جاتی، بلکہ اس کا علم ہوتا ہے اور {’’ نَجْوٰىهُمْ ‘‘} سے مراد ان کی مجلس مشاورت کی باتیں ہیں۔ ¤ ➋ {بَلٰى وَ رُسُلُنَا لَدَيْهِمْ يَكْتُبُوْنَ:} یعنی صرف یہی نہیں کہ ہم سنتے ہیں، بلکہ ہمارے فرشتے ثبوت کے طور پر لکھ بھی لیتے ہیں۔ (دیکھیے ق : ۱۷، ۱۸) یعنی ان کی خفیہ تدبیریں تو ہم سن رہے ہوتے ہیں، پھر وہ ان کی کامیابی کی کیا توقع رکھ سکتے ہیں۔"
    },
    {
      "ayah": 81,
      "tafsir": "(آیت 81) {قُلْ اِنْ كَانَ لِلرَّحْمٰنِ وَلَدٌ … :} کفار فرشتوں کو اللہ تعالیٰ کی بیٹیاں قرار دیتے تھے، پچھلی آیات میں اللہ تعالیٰ نے اس کا ردّ فرمایا۔ اب رسول اللہ صلی اللہ علیہ وسلم کو حکم دیا کہ ان سے کہہ دیں کہ اگر رحمان کی کوئی اولاد ہو تو میں سب سے پہلے اس کی عبادت کرنے والا ہوں۔ مطلب یہ کہ میرا اللہ تعالیٰ کی اولاد نہ ماننا اور جنھیں تم اللہ کی اولاد قرار دیتے ہو ان کی عبادت سے انکار کسی ضد یا ہٹ دھرمی کی بنا پر نہیں، بلکہ اس وجہ سے ہے کہ ممکن ہی نہیں کہ اس ذات پاک کی اولاد ہو جس کا نام رحمان ہے۔ تفصیل کے لیے سورۂ مریم کی آیات (۸۸ تا ۹۸) کی تفسیر ملاحظہ فرمائیں۔ مطلب یہ ہے کہ اگر رحمان کی کوئی اولاد ہو، جیسا کہ کفار کہتے ہیں، تو سب سے پہلے اس اولاد کی عبادت کرنے والا میں ہوں، کیونکہ میرا اس کے ساتھ بندگی کا تعلق سب سے زیادہ ہے، جیسا کہ بادشاہ کے نوکر چاکر بادشاہ کی اولاد کی تعظیم ان کے والد کی تعظیم کی وجہ سے کرتے ہیں، لیکن رحمان کی اولاد ہے ہی نہیں، اس لیے میں اللہ واحد کے سوا کسی کی عبادت کرنے والا نہیں۔ ¤ یاد رہے کہ یہ جملہ شرطیہ ہے، اس میں شرط کا وجود بلکہ اس کا امکان بھی ضروری نہیں ہوتا۔ بعض اوقات ناممکن چیز کو بھی بفرض محال شرط کے طور پر ذکر کر دیا جاتا ہے، جیسا کہ فرمایا : « لَوْ اَرَادَ اللّٰهُ اَنْ يَّتَّخِذَ وَلَدًا لَّاصْطَفٰى مِمَّا يَخْلُقُ مَا يَششَآءُ سُبْحٰنَهٗ هُوَ اللّٰهُ الْوَاحِدُ الْقَهَّارُ» [ الزمر : ۴ ] ’’اگر اللہ چاہتا کہ (کسی کو) اولاد بنائے تو ان میں سے جنھیں وہ پیدا کرتا ہے جسے چاہتا ضرور چن لیتا، وہ پاک ہے۔ وہ تو اللہ ہے، جو اکیلا ہے، بہت غلبے والا ہے۔‘‘ اور فرمایا : «لَوْ كَانَ فِيْهِمَاۤ اٰلِهَةٌ اِلَّا اللّٰهُ لَفَسَدَتَا » [ الأنبیاء : ۲۲ ] ’’اگر ان دونوں میں اللہ کے سوا کوئی اور معبود ہوتے تو وہ دونوں ضرور بگڑ جاتے۔‘‘"
    },
    {
      "ayah": 82,
      "tafsir": "(آیت 82) {سُبْحٰنَ رَبِّ السَّمٰوٰتِ وَ الْاَرْضِ رَبِّ الْعَرْشِ عَمَّا يَصِفُوْنَ:} یعنی اولالاد ہونا کمزوری، محتاجی اور عجز کی دلیل ہے۔ (دیکھیے بنی اسرائیل : ۱۱۱) جب کہ اللہ تعالیٰ عجز اور احتیاج سے پاک ہے۔ وہ آسمانوں کا، زمین کا اور عرش کا مالک اور پروردگار اولاد سے اور ان تمام کمزوریوں اور عیبوں سے پاک ہے جو مشرک لوگ اس کے لیے بیان کرتے ہیں۔"
    },
    {
      "ayah": 83,
      "tafsir": "(آیت 83) {فَذَرْهُمْ يَخُوْضُوْا وَ يَلْعَبُوْا …:} یعنی اگر یہ ہدایت کا راستہ اختیار نہیں کرتے تو انھیں ان کی فضول بحث اور کھیل کود میں لگا رہنے دیں، یہاں تک کہ وہ اپنے اس دن کو جا ملیں جس کا ان سے وعدہ کیا جاتا ہے۔ اس وقت ان پر سب حقیقت کھل جائے گی۔ اس دن سے مراد قیامت کا دن ہے یا موت کا دن یا دنیا میں عذاب کا دن۔"
    },
    {
      "ayah": 84,
      "tafsir": "(آیت 84) ➊ {وَ هُوَ الَّذِيْ فِي السَّمَآءِ اِلٰهٌ …:} مشرکوں نے کچھ معبود آسمان میں بنا رکھے تھے، مثلاً فرشتے، سورج، چاند اور بعض ستارے اور کچھ زمین میں، جیسے انبیاء، اولیاء، ان کی قبریں اور بت، درخت اور پتھر وغیرہ۔ فرمایا، زمین اور آسمان میں الگ الگ معبود نہیں بلکہ اللہ تعالیٰ ہی دونوں کا بلاشرکت غیرے مالک ہے۔ دونوں جگہ اسی کی عبادت ہوتی ہے اور دونوں جگہ عبادت اسی کا حق ہے۔ ¤ ➋ { وَ هُوَ الْحَكِيْمُ الْعَلِيْمُ: ’’ الْحَكِيْمُ ‘‘} کمال حکمت والا، جس نے ہر چیز محکم و مضبوط اور حکمت و دانائی کے ساتھ بنائی ہے اور ہر چیز کا علم رکھنے والا ہے۔ یہ معبود واحد ہونے کی دلیل ہے کہ کوئی دوسرا نہ حکیم ہے نہ علیم، تو پھر اس کی عبادت کیوں ہو؟"
    },
    {
      "ayah": 85,
      "tafsir": "(آیت 85) {وَ تَبٰرَكَ الَّذِيْ لَهٗ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ … :} یہ بھی اللہ تعالیٰ کے اکیلا معبود ہونے کی دلیل ہے کہ بے شمار خیر و خوبی کا مالک ہے وہ کہ آسمانوں میں اور زمین میں ہر جگہ اسی کی بادشاہی ہے۔ قیامت کا علم بھی اسی کے پاس ہے اور تم اسی کی طرف لوٹائے جاؤ گے، نہ کہ کسی اور کی طرف۔ لہٰذا وہی ہے جو تمھیں تمھارے نیک یا بد اعمال کا بدلا دے گا۔"
    },
    {
      "ayah": 86,
      "tafsir": "(آیت 86) ➊ { وَ لَا يَمْلِكُ الَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِهِ الشَّفَاعَةَ … :} پچھلی آیت میں ’’من دون الله‘‘ کے پاس آسمانوں اور زمین کی اور ان کے درمیان کی کسی بھی چیز کی ملک ہونے کی نفی تھی، اس آیت میں ان سے شفاعت کی ملکیت کی بھی نفی فرما دی۔ ¤ ➋ اس آیت کی دو تفسیریں ہیں، دونوں مراد ہو سکتی ہیں اور یہ قرآن کا اعجاز ہے۔ پہلی یہ کہ مشرکین جن ہستیوں کو یہ سمجھ کر پکارتے ہیں کہ وہ ان کی شفاعت کریں گی ان کے پاس شفاعت کا کوئی اختیار نہیں، مگر وہ لوگ جنھوں نے کلمۂ حق یعنی ’’لا الٰہ الا الله‘‘ کی شہادت دی اور صرف زبانی نہیں بلکہ وہ اس کا یقین رکھتے تھے، مثلاً فرشتے، عیسیٰ علیہ السلام اور اللہ کے دوسرے مقرب بندے۔ وہ چونکہ حق (توحید) کا یقین رکھ کر اس کی گواہی دیتے تھے اور انھوں نے کبھی لوگوں کو اپنی عبادت کا حکم نہیں دیا، اس لیے وہ اللہ کے اذن سے سفارش کر سکیں گے۔ رہے بت اور دوسرے جھوٹے مشکل کشا اور حاجت روا، جن کی مشرکین پوجا کرتے ہیں، وہ تو اپنے آپ کو نہیں بچا سکیں گے بلکہ دوزخ کا ایندھن بنیں گے، کسی کی سفارش کیا کریں گے؟ دوسری تفسیر یہ ہے کہ {’’ مَنْ شَهِدَ بِالْحَقِّ ‘‘} سے پہلے لام جارہ محذوف ہے : {’’أَيْ إِلَّا لِمَنْ شَهِدَ بِالْحَقِّ‘‘} یعنی سفارش کرنے والوں کو صرف ان لوگوں کے حق میں سفارش کا اختیار دیا جائے گا جنھوں نے حق یعنی کلمہ ’’لا الٰہ الا الله‘‘ کی شہادت دی اور صرف زبانی نہیں بلکہ اس کا علم اور یقین بھی رکھتے تھے۔ رہے کفار یا منافقین، تو ان کے حق میں کوئی شفاعت نہیں کرے گا۔ شفاعت کی مزید تفصیل کے لیے دیکھیے آیت الکرسی، سورۂ مریم (۸۷)، انبیاء (۲۸)، سبا (۲۳)، نجم (۲۶) اور سورۂ نبا (۳۸)۔ ¤ ➌ اس آیت سے یہ بھی معلوم ہوا کہ شہادت وہی معتبر ہے جو علم کے ساتھ دی جائے۔ دنیا میں اگرچہ ہر اس شخص کو مسلمان تصور کر لیا جاتا ہے جو زبانی کلمہ ’’لا الٰہ الا الله‘‘ کی شہادت دے، مگر قیامت کے دن اسی کی شہادت معتبر ہو گی جس نے دل کے یقین کے ساتھ یہ شہادت دی ہو گی۔"
    },
    {
      "ayah": 87,
      "tafsir": "(آیت 87) ➊ { وَ لَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَهُمْ … :} اس آیت میں مشرکین کے قول و فعل کا تضاد واضح فرمایا ہے، یعنی جب مانتے ہیں کہ انھیں اللہ تعالیٰ نے پیدا کیا ہے تو پیدا کرنے والے کو چھوڑ کر دوسروں کی پوجا کیوں کر کرتے ہیں؟ مالک کو چھوڑ کر ان کو مشکل کشا اور حاجت روا کیسے مان بیٹھے ہیں جنھوں نے کچھ پیدا ہی نہیں کیا؟ ¤ ➋ { فَاَنّٰى يُؤْفَكُوْنَ:} یعنی پھر بہکانے والے انھیں بہکا کر کہاں لے جا رہے ہیں؟ ایک معنی {’’ فَاَنّٰى يُؤْفَكُوْنَ ‘‘} کا یہ بھی ہے : {’’ مِنْ أَيْنَ يُؤْفَكُوْنَ ‘‘} کہ پھر وہ کہاں سے بہکائے جاتے ہیں، کون سی دلیل یا کیا سبب ہے جس کی وجہ سے یہ بہکائے جاتے ہیں۔ اس سے معلوم ہوا کہ انسان اصل میں توحید پر ہوتا ہے، پھر شیاطین انسان ہوں یا جن اسے توحید سے بہکا کر شرک میں مبتلا کر دیتے ہیں۔ اس لیے ایسے لوگوں سے بہت ہوشیار اور خبردار رہنا چاہیے، جیسا کہ عیاض بن حمار المجاشعی رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک دن اپنے خطبہ میں فرمایا : [ أَلَا! إِنَّ رَبِّيْ أَمَرَنِيْ أَنْ أُعَلِّمَكُمْ مَا جَهِلْتُمْ مِمَّا عَلَّمَنِيْ يَوْمِيْ هٰذَا، كُلُّ مَالٍ نَحَلْتُهُ عَبْدًا حَلَالٌ وَ إِنِّيْ خَلَقْتُ عِبَاادِيْ حُنَفَاءَ كُلَّهُمْ وَإِنَّهُمْ أَتَتْهُمُ الشَّيَاطِيْنُ فَاجْتَالَتْهُمْ عَنْ دِيْنِهِمْ وَ حَرَّمَتْ عَلَيْهِمْ مَا أَحْلَلْتُ  لَهُمْ وَأَمَرَتْهُمْ أَنْ يُشْرِكُوْا بِيْ مَا لَمْ أُنْزِلْ بِههِ سُلْطَانًا ] [ مسلم، الجنۃ و صفۃ نعیمھا و أہلہا، باب الصفات التي یعرف بہا في الدنیا أھل الجنۃ و أھل النار : ۲۸۶۵ ] ’’سنو! میرے رب نے مجھے حکم دیا ہے کہ میں تمھیں وہ باتیں سکھاؤں جن سے تم ناواقف ہو، ان باتوں میں سے جو اس نے مجھے آج سکھائی ہیں۔ ( وہ فرماتا ہے کہ ) ہر وہ مال جو میں نے کسی بندے کو عطا کیا (وہ اس کے لیے) حلال ہے اورمیں نے اپنے تمام بندوں کو حُنفاء (ایک اللہ کی طرف ہو جانے والے) پیدا کیا، لیکن ان کے پاس شیاطین آئے تو انھوں نے انھیں ان کے دین سے بہکا دیا اور ان پر وہ چیزیں حرام کر دیں جو میں نے ان کے لیے حلال کی تھیں اور انھیں حکم دیا کہ میرے ساتھ ان چیزوں کو شریک بنائیں جن کی میں نے کوئی دلیل نہیں اتاری۔‘‘"
    },
    {
      "ayah": 88,
      "tafsir": "(آیت 88) {وَ قِيْلِهٖ يٰرَبِّ اِنَّ هٰۤؤُلَآءِ …: ’’ قِيْلٌ، قَالٌ‘‘} اور {’’ قَوْلٌ‘‘} تینوں {’’ قَالَ يَقُوْلُ‘‘} کے مصدر ہیں، معنی ہے کہنا۔ {’’ قِيْلِهٖ ‘‘} میں ضمیر {’’هٖ‘‘ } رسول اللہ صلی اللہ علیہ وسلم کی طرف لوٹ رہی ہے۔ اس آیت کی متعدد تفسیریں کی گئی ہیں، ان میں سب سے واضح تین ہیں۔ پہلی یہ کہ {’’ وَ قِيْلِهٖ يٰرَبِّ ‘‘} قسم ہے : {’’أَيْ أُقْسِمُ بِقَوْلِهِ يَا رَبِّ‘‘} اور {’’ اِنَّ هٰۤؤُلَآءِ قَوْمٌ لَّا يُؤْمِنُوْنَ ‘‘} جواب قسم ہے۔ یہ تفسیر زمخشری نے کی ہے اور ترجمہ اسی کے مطابق کیا گیا ہے۔ یعنی اللہ تعالیٰ فرماتے ہیں کہ میں رسول کے {’’يَا رَبِّ يَا رَبِّ ‘‘} کہنے کی قسم کھاتا ہوں کہ یقینانا یہ ایسے لوگ ہیں جو ایمان نہیں لائیں گے۔ اگلی آیت میں فرمایا : « فَاصْفَحْ عَنْهُمْ وَ قُلْ سَلٰمٌ » اس لیے ان سے درگزر کر اور کہہ سلام ہے، پس عنقریب وہ جان لیں گے۔ ¤ دوسری تفسیر یہ ہے کہ یہ ساری آیت قسم ہے، جواب اس کا محذوف ہے جو قرینے سے معلوم ہو رہا ہے۔ قرینے کے پیشِ نظر قسم کا جواب حذف کرنا کلامِ عرب میں عام ہے۔ یعنی میں رسول کے ’’اے میرے رب! یہ تو ایسے لوگ ہیں جو ایمان لاتے ہی نہیں‘‘ کہنے کی قسم کھاتا ہوں کہ میں ضرور کافروں کے اس رویے کے خلاف اس کی مدد کروں گا۔ قرینہ اگلی آیت ہے کہ پس تو ان سے درگزر کر اور کہہ سلام ہے، کیونکہ وہ بہت جلد جان لیں گے کہ رسول کی مدد کیسے ہوتی ہے اور ان لوگوں سے انتقام کیسے لیا جاتا ہے۔ تیسری تفسیر یہ ہے کہ واؤ بمعنی {’’رُبَّ‘‘} ہے جو حرف جار ہے، {’’ قِيْلِهٖ ‘‘} اس کے ساتھ مجرور ہے۔ یعنی کئی دفعہ رسول کا حسرت و افسوس کے ساتھ کہنا یہ ہوتا ہے کہ اے میرے رب! یہ تو ایسے لوگ ہیں جو ایمان لاتے ہی نہیں۔ ایک تفسیر یہ بھی کی گئی ہے کہ {’’ وَ قِيْلِهٖ ‘‘} میں {’’قِيْلٌ‘‘} کا عطف اوپر گزری ہوئی آیت {’’ وَ عِنْدَهٗ عِلْمُ السَّاعَةِ ‘‘} میں لفظ {’’ السَّاعَةِ ‘‘} پر ہے، یعنی {’’ وَ عِنْدَهُ عِلْمُ السَّاعَةِ وَ عِلْمُ قِيْلِهِ يَا رَبِّ هٰؤُلَاء قَوْمٌ لَا يُؤْمِنُوْنَ‘‘} یعنی ’’اسی کے پاس قیامت کا علم ہے اور رسول کے اس قول کا بھی کہ اے میرے رب! یہ تو ایسے لوگ ہیں جو ایمان نہیں لاتے۔‘‘ مگر معطوف علیہ اور معطوف کے درمیان اتنا لمبا فاصلہ بعید بات ہے۔"
    },
    {
      "ayah": 89,
      "tafsir": "(آیت 89) {فَاصْفَحْ عَنْهُمْ وَ قُلْ سَلٰمٌ … :} یعنی آپ کی فریاد ہم نے سن لی، اب ہم جانیں اور وہ، آپ ان سے درگزر کریں اور ان سے براء ت اور قطع تعلق کے اظہار کے لیے کہہ دیں کہ سلام ہے۔ چنانچہ وہ بہت جلد جان لیں گے کہ ان کے ایمان نہ لانے کا انجام کیا ہوتا ہے۔"
    }
  ]
}