{
  "surah": "Ad-Dukhaan",
  "surah_number": 44,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1تا3) ➊ {حٰمٓ (1) وَ الْكِتٰبِ الْمُبِيْنِ (2) اِنَّاۤ اَنْزَلْنٰهُ:} اللہ تعالیٰ نے اس کتابِ مبین کی قسم کھا کر فرمایا کہ یقینا ہم نے ہی اسے نازل فرمایا ہے۔ یعنی یہ کتابِ مبین خود اس بات کی شاہد ہے کہ یہ محمد صلی اللہ علیہ وسلم یا کسی اور کی تصنیف نہیں، بلکہ اسے ہم نے ہی نازل کیا ہے۔ اگر کوئی اسے مخلوق کی تصنیف کہتا ہے تو وہ اس کی ایک سورت کی مثل ہی تصنیف کرکے لے آئے۔ ¤ ➋ { فِيْ لَيْلَةٍ مُّبٰرَكَةٍ:} کتاب کی عظمت بیان کرتے ہوئے فرمایا ککہ وہ رات بڑی خیر و برکت والی ہے جس میں ہم نے اسے نازل فرمایا۔ دوسری جگہ اللہ تعالیٰ نے خود بیان فرما دیا کہ وہ مبارک رات لیلۃ القدر ہے، جیسا کہ سورۂ قدر میں ہے : « اِنَّاۤ اَنْزَلْنٰهُ فِيْ لَيْلَةِ الْقَدْرِ» [ القدر : ۱ ] ’’بلاشبہ ہم نے اسے قدر کی رات میں اتارا۔‘‘ اور وہ ماہِ رمضان میں ہے، جیسا کہ فرمایا : «شَهْرُ رَمَضَانَ الَّذِيْۤ اُنْزِلَ فِيْهِ الْقُرْاٰنُ » [ البقرۃ : ۱۸۵ ] ’’ رمضان کا مہینا وہ ہے جس میں قرآن اتارا گیا۔‘‘ کتاب اتارنے سے مراد اتارنے کی ابتدا ہے جو غارِ حرا میں ماہ رمضان کی اس مبارک رات میں ہوئی۔ کچھ لوگ کہتے ہیں کہ وہ رات نصف شعبان کی رات ہے، مگر یہ بات سراسر غلط ہے، کیونکہ یہ قرآن مجید کے صریح خلاف ہے۔ قاضی ابوبکر بن العربی نے ’’احکام القرآن‘‘ میں لکھا ہے کہ نصف شعبان کی رات سے متعلق کوئی روایت قابل اعتماد نہیں، نہ اس کی فضیلت کے بارے میں اور نہ اس بارے میں کہ اس رات قسمتوں کے فیصلے ہوتے ہیں۔ مفسر شنقیطی نے فرمایا : ’’ابن العربی کے علاوہ دوسرے محققین کا بھی یہی فیصلہ ہے کہ ایسی روایات کی کوئی بنیاد نہیں، نہ ان میں سے کسی کی سند صحیح ہے۔‘‘ ¤ ➌ {’’ لَيْلَةٍ مُّبٰرَكَةٍ ‘‘} کی برکات کی تفصیل سورۂ قدر میں ملاحظہ فرمائیں۔ ¤ ➍ {اِنَّا كُنَّا مُنْذِرِيْنَ:} یعنی ہم نے یہ کتاب اس لیے نازل کی کہ بندوں کو اچھے اور برے کاموں سے آگاہ کر دیا جائے اور نافرمانی کی صورت میں انھیں ان کے انجامِ بد سے ڈرا دیا جائے، تاکہ ان کے پاس یہ عذر باقی نہ رہے کہ ہمیں خبردار نہیں کیا گیا۔ یہاں صرف ڈرانے کا ذکر فرمایا بشارت کا نہیں، کیونکہ اکثر لوگوں کے حسبِ حال یہی ہوتا ہے۔ ویسے ڈرانے کے ضمن میں بشارت بھی ہوتی ہے، اس شخص کے لیے جو ڈر جائے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 1تا3) ➊ {حٰمٓ (1) وَ الْكِتٰبِ الْمُبِيْنِ (2) اِنَّاۤ اَنْزَلْنٰهُ:} اللہ تعالیٰ نے اس کتابِ مبین کی قسم کھا کر فرمایا کہ یقینا ہم نے ہی اسے نازل فرمایا ہے۔ یعنی یہ کتابِ مبین خود اس بات کی شاہد ہے کہ یہ محمد صلی اللہ علیہ وسلم یا کسی اور کی تصنیف نہیں، بلکہ اسے ہم نے ہی نازل کیا ہے۔ اگر کوئی اسے مخلوق کی تصنیف کہتا ہے تو وہ اس کی ایک سورت کی مثل ہی تصنیف کرکے لے آئے۔ ¤ ➋ { فِيْ لَيْلَةٍ مُّبٰرَكَةٍ:} کتاب کی عظمت بیان کرتے ہوئے فرمایا ککہ وہ رات بڑی خیر و برکت والی ہے جس میں ہم نے اسے نازل فرمایا۔ دوسری جگہ اللہ تعالیٰ نے خود بیان فرما دیا کہ وہ مبارک رات لیلۃ القدر ہے، جیسا کہ سورۂ قدر میں ہے : « اِنَّاۤ اَنْزَلْنٰهُ فِيْ لَيْلَةِ الْقَدْرِ» [ القدر : ۱ ] ’’بلاشبہ ہم نے اسے قدر کی رات میں اتارا۔‘‘ اور وہ ماہِ رمضان میں ہے، جیسا کہ فرمایا : «شَهْرُ رَمَضَانَ الَّذِيْۤ اُنْزِلَ فِيْهِ الْقُرْاٰنُ » [ البقرۃ : ۱۸۵ ] ’’ رمضان کا مہینا وہ ہے جس میں قرآن اتارا گیا۔‘‘ کتاب اتارنے سے مراد اتارنے کی ابتدا ہے جو غارِ حرا میں ماہ رمضان کی اس مبارک رات میں ہوئی۔ کچھ لوگ کہتے ہیں کہ وہ رات نصف شعبان کی رات ہے، مگر یہ بات سراسر غلط ہے، کیونکہ یہ قرآن مجید کے صریح خلاف ہے۔ قاضی ابوبکر بن العربی نے ’’احکام القرآن‘‘ میں لکھا ہے کہ نصف شعبان کی رات سے متعلق کوئی روایت قابل اعتماد نہیں، نہ اس کی فضیلت کے بارے میں اور نہ اس بارے میں کہ اس رات قسمتوں کے فیصلے ہوتے ہیں۔ مفسر شنقیطی نے فرمایا : ’’ابن العربی کے علاوہ دوسرے محققین کا بھی یہی فیصلہ ہے کہ ایسی روایات کی کوئی بنیاد نہیں، نہ ان میں سے کسی کی سند صحیح ہے۔‘‘ ¤ ➌ {’’ لَيْلَةٍ مُّبٰرَكَةٍ ‘‘} کی برکات کی تفصیل سورۂ قدر میں ملاحظہ فرمائیں۔ ¤ ➍ {اِنَّا كُنَّا مُنْذِرِيْنَ:} یعنی ہم نے یہ کتاب اس لیے نازل کی کہ بندوں کو اچھے اور برے کاموں سے آگاہ کر دیا جائے اور نافرمانی کی صورت میں انھیں ان کے انجامِ بد سے ڈرا دیا جائے، تاکہ ان کے پاس یہ عذر باقی نہ رہے کہ ہمیں خبردار نہیں کیا گیا۔ یہاں صرف ڈرانے کا ذکر فرمایا بشارت کا نہیں، کیونکہ اکثر لوگوں کے حسبِ حال یہی ہوتا ہے۔ ویسے ڈرانے کے ضمن میں بشارت بھی ہوتی ہے، اس شخص کے لیے جو ڈر جائے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 1تا3) ➊ {حٰمٓ (1) وَ الْكِتٰبِ الْمُبِيْنِ (2) اِنَّاۤ اَنْزَلْنٰهُ:} اللہ تعالیٰ نے اس کتابِ مبین کی قسم کھا کر فرمایا کہ یقینا ہم نے ہی اسے نازل فرمایا ہے۔ یعنی یہ کتابِ مبین خود اس بات کی شاہد ہے کہ یہ محمد صلی اللہ علیہ وسلم یا کسی اور کی تصنیف نہیں، بلکہ اسے ہم نے ہی نازل کیا ہے۔ اگر کوئی اسے مخلوق کی تصنیف کہتا ہے تو وہ اس کی ایک سورت کی مثل ہی تصنیف کرکے لے آئے۔ ¤ ➋ { فِيْ لَيْلَةٍ مُّبٰرَكَةٍ:} کتاب کی عظمت بیان کرتے ہوئے فرمایا ککہ وہ رات بڑی خیر و برکت والی ہے جس میں ہم نے اسے نازل فرمایا۔ دوسری جگہ اللہ تعالیٰ نے خود بیان فرما دیا کہ وہ مبارک رات لیلۃ القدر ہے، جیسا کہ سورۂ قدر میں ہے : « اِنَّاۤ اَنْزَلْنٰهُ فِيْ لَيْلَةِ الْقَدْرِ» [ القدر : ۱ ] ’’بلاشبہ ہم نے اسے قدر کی رات میں اتارا۔‘‘ اور وہ ماہِ رمضان میں ہے، جیسا کہ فرمایا : «شَهْرُ رَمَضَانَ الَّذِيْۤ اُنْزِلَ فِيْهِ الْقُرْاٰنُ » [ البقرۃ : ۱۸۵ ] ’’ رمضان کا مہینا وہ ہے جس میں قرآن اتارا گیا۔‘‘ کتاب اتارنے سے مراد اتارنے کی ابتدا ہے جو غارِ حرا میں ماہ رمضان کی اس مبارک رات میں ہوئی۔ کچھ لوگ کہتے ہیں کہ وہ رات نصف شعبان کی رات ہے، مگر یہ بات سراسر غلط ہے، کیونکہ یہ قرآن مجید کے صریح خلاف ہے۔ قاضی ابوبکر بن العربی نے ’’احکام القرآن‘‘ میں لکھا ہے کہ نصف شعبان کی رات سے متعلق کوئی روایت قابل اعتماد نہیں، نہ اس کی فضیلت کے بارے میں اور نہ اس بارے میں کہ اس رات قسمتوں کے فیصلے ہوتے ہیں۔ مفسر شنقیطی نے فرمایا : ’’ابن العربی کے علاوہ دوسرے محققین کا بھی یہی فیصلہ ہے کہ ایسی روایات کی کوئی بنیاد نہیں، نہ ان میں سے کسی کی سند صحیح ہے۔‘‘ ¤ ➌ {’’ لَيْلَةٍ مُّبٰرَكَةٍ ‘‘} کی برکات کی تفصیل سورۂ قدر میں ملاحظہ فرمائیں۔ ¤ ➍ {اِنَّا كُنَّا مُنْذِرِيْنَ:} یعنی ہم نے یہ کتاب اس لیے نازل کی کہ بندوں کو اچھے اور برے کاموں سے آگاہ کر دیا جائے اور نافرمانی کی صورت میں انھیں ان کے انجامِ بد سے ڈرا دیا جائے، تاکہ ان کے پاس یہ عذر باقی نہ رہے کہ ہمیں خبردار نہیں کیا گیا۔ یہاں صرف ڈرانے کا ذکر فرمایا بشارت کا نہیں، کیونکہ اکثر لوگوں کے حسبِ حال یہی ہوتا ہے۔ ویسے ڈرانے کے ضمن میں بشارت بھی ہوتی ہے، اس شخص کے لیے جو ڈر جائے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {فِيْهَا يُفْرَقُ كُلُّ اَمْرٍ حَكِيْمٍ: ’’فَرْقٌ‘‘} کا معنی فیصلہ ہے، اسی لیے قرآن کو {’’فرقان‘‘} کہا جاتا ہے۔ {’’ حَكِيْمٍ ‘‘} کے مفہوم میں دو باتیں شامل ہیں، ایک یہ کہ وہ حکم حکمت اور دانائی پر مبنی ہوتا ہے، اس میں کسی غلطی یا خامی کا امکان نہیں ہوتا۔ دوسری یہ کہ وہ حکم محکم اور پختہ ہوتا ہے جسے کوئی بدل نہیں سکتا۔ یعنی ہم نے اسے خاص طور پر اس بابرکت رات میں اس لیے نازل کیا کہ یہ قرآن ایک امرِ حکیم ہے اور اسی رات میں ہر امرِ حکیم کا فیصلہ کیا جاتا ہے۔ سورۂ قدر میں یہی مضمون ان الفاظ میں بیان ہوا ہے : «تَنَزَّلُ الْمَلٰٓىِٕكَةُ وَ الرُّوْحُ فِيْهَا بِاِذْنِ رَبِّهِمْ مِنْ كُللِّ اَمْرٍ» [ القدر : ۴ ] ’’اس میں فرشتے اور روح (جبریل امین) اپنے رب کے حکم سے ہر امر کے متعلق اترتے ہیں۔‘‘ اس سے معلوم ہوا کہ وہ ایسی رات ہے جس میں اللہ تعالیٰ آئندہ سال سے متعلق افراد و اقوام کی قسمتوں کے تمام فیصلے فرشتوں کے حوالے کر دیتے ہیں، مثلاً زندگی، موت، بیماری، رزق، عروج و زوال اور ہدایت و گمراہی وغیرہ، پھر وہ ان پر عمل درآمد کرتے رہتے ہیں۔ ابن عباس رضی اللہ عنھما نے فرمایا : [ إِنَّكَ لَتَرَی الرَّجُلَ يَمْشِيْ فِي الْأَسْوَاقِ، وَقَدْ وَقَعَ اسْمُهُ فِي الْمَوْتٰی، ثُمَّ قَرَأَ : «اِنَّاۤ اَنْزَلْنٰهُ فِيْ لَيْلَةٍ مُّبٰرَكَةٍ اِنَّا كُنَّا مُنْذِرِيْنَ (3) فِيْهَا يُفْرَقُ كُلُّ اَمْرٍ حَكِيْمٍ» [الدخان : ۳، ۴] يَعْنِيْ لَيْلَةَ الْقَدْرِ فَفِيْ تِلْكَ اللَّيْلَةِ يُفْرَقُ أَمْرُ الدُّنْيَا إِلٰی مِثْلِهَا مِنْ قَابِلٍ ] [ مسستدرک حاکم، تفسیر سورۃ الدخان : 448/2، ح : ۳۶۷۸ ] ’’تم آدمی کو بازاروں میں چلتا پھرتا دیکھتے ہو، حالانکہ اس کا نام مُردوں میں درج ہو چکا ہوتا ہے۔ پھر یہ آیت پڑھی : « اِنَّاۤ اَنْزَلْنٰهُ فِيْ لَيْلَةٍ مُّبٰرَكَةٍ اِنَّا كُنَّا مُنْذِرِيْنَ (3) فِيْهَا يُفْرَقُ كُلُّ اَمْرٍ حَكِيْمٍ » کہ اس سے مراد لیلۃ القدر ہے، اس رات میں دنیا کے معاملات کا آئندہ سال کی اسی رات تک فیصلہ کر دیا جاتا ہے۔‘‘ حاکم اور ذہبی نے اسے صحیح کہا اور بیہقی نے ’’شعب الایمان‘‘ میں اسے حاکم سے روایت کیا ہے اور اس کے محقق نے کہا کہ اس کی سند کے راوی ثقہ ہیں۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { اَمْرًا مِّنْ عِنْدِنَا:} یعنی یہ سارے فیصلے ہمارے حکم سے ہوتے ہیں۔ مراد ان فیصلوں کی اہمیت اور عظمت پر متنبہ کرنا ہے کہ وہ فیصلے کسی معمولی ہستی کے نہیں ہوتے، بلکہ کائنات کے مالک کی طرف سے صادر ہوتے ہیں۔ ¤ ➋ { اِنَّا كُنَّا مُرْسِلِيْنَ:} یعنی ہم یہ کتاب نازل کرتے وقت رسول کو بھیجنے والے تھے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {رَحْمَةً مِّنْ رَّبِّكَ:} یہ{’’ مُرْسِلِيْنَ ‘‘} کا مفعول لہ ہے۔ یعنی ہم تیرے رب کی رحمت کی وجہ سے رسول کو بھیجنے والے اور کتاب کو نازل کرنے والے تھے۔ ’’اپنی رحمت‘‘ کے بجائے ’’تیرے رب کی رحمت‘‘ کا لفظ رسول اللہ صلی اللہ علیہ وسلم کے شرف کے اظہار کے لیے ہے، ورنہ اللہ تعالیٰ صرف آپ صلی اللہ علیہ وسلم ہی کا نہیں بلکہ کل کائنات کا رب ہے، جیسا کہ آگے یہ بات آ بھی رہی ہے : « رَبِّ السَّمٰوٰتِ وَ الْاَرْضِ وَ مَا بَيْنَهُمَا اِنْ كُنْتُمْ مُّوْقِنِيْنَ » ’’آسمانوں اور زمین اور ان چیزوں کا رب جو ان دونوں کے درمیان ہیں، اگر تم یقین کرنے والے ہو۔‘‘ {’’ رَحْمَةً مِّنْ رَّبِّكَ ‘‘} میں لفظ {’’رَبٌّ‘‘} کا مطلب یہ ہے کہ بندوں پر یہ رحمت ہمارے رب ہونے کا تقاضا ہے، کیونکہ {’’رَبٌّ‘‘} کا یہ مطلب نہیں کہ ان کے جسم کی پرورش کا انتظام کیا جائے اور ان کی روحانی پرورش کا انتظام نہ کیا جائے، بلکہ انھیں گمراہی میں بھٹکتا چھوڑ دیا جائے۔ ¤ ➋ { اِنَّهٗ هُوَ السَّمِيْعُ الْعَلِيْمُ: ’’إِنَّ‘‘} پہلے جملے کی علت بیان کرنے کے لیے ہوتا ہے، یعنی ہم نے رسول اس لیے بھیجا کہ تیرا رب خوب سننے اور جاننے والا تھا کہ کس طرح مشرکین بتوں اور باطل معبودوں کی پرستش کر رہے ہیں، کفر کے امام لوگوں کو گمراہ کر رہے ہیں اور طاقتور کمزوروں پر ظلم کر رہے ہیں۔ اس کے علاوہ وہ لوگوں کے تمام اقوال و افعال اور نیتوں کو جانتا تھا اور سن رہا تھا، اس لیے اس نے ان کی اصلاح کے لیے رسولوں کو بھیجا۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) { رَبِّ السَّمٰوٰتِ وَ الْاَرْضِ وَ مَا بَيْنَهُمَا … :} پچھلی آیت میں رسول اللہ صلی اللہ علیہ وسلم سے خطاب تھا۔ کفارِ مکہ یہ اقرار کرتے تھے کہ زمین و آسمان اور ساری کائنات کا رب اللہ تعالیٰ ہے، اس لیے اب ان سے دوبارہ خطاب کرتے ہوئے فرمایا کہ اگر تمھیں اس بات کا یقین ہے کہ کائنات میں موجود ساری مخلوق کی ربوبیت اور پرورش کی ذمہ دار صرف اللہ تعالیٰ کی ذات ہے تو پھر تمھیں یہ بھی یقین کر لینا چاہیے کہ یہ رسول فی الواقع اللہ تعالیٰ ہی نے تمھاری ہدایت کے لیے بھیجا ہے، کیونکہ وہ صرف تمھاری جسمانی پرورش ہی کا ذمہ دار نہیں بلکہ تمھاری روحانی پرورش اور تمھیں سیدھا راستہ بتانا بھی اسی کے ذمے ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {لَاۤ اِلٰهَ اِلَّا هُوَ:} یہ پچھلی آیت کا نتیجہ ہے کہ جب آسمان و زمین اور ساری کائنات کا مالک اور رب اللہ تعالیٰ ہے تو پھر معبود بھی وہی ہے۔ ¤ ➋ { يُحْيٖ وَ يُمِيْتُ رَبُّكُمْ وَ رَبُّ اٰبَآىِٕكُمُ الْاَوَّلِيْنَ:} یہ دونوں جملے اللہ تعالیٰ کے معبود واحد ہونے کی مزید تاکید کے لیے بیان فرمائے کہ معبود اسی کو مانو جو زندگی بخشتا اور موت دیتا ہے اور جو تمھارا اور تمھارے پہلے آباء کا رب ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {بَلْ هُمْ فِيْ شَكٍّ يَّلْعَبُوْنَ:} اس مختصر سے فقرے میں ایک بڑی حقیقت کی طرف اشارہ کیا گیا ہے۔ دہریے ہوں یا مشرکین، ان سب پر وقتاً فوقتاً ایسی ساعتیں آتی رہتی ہیں جب ان کا دل اندر سے کہتا ہے کہ جو کچھ تم سمجھے بیٹھے ہو اس میں کہیں نہ کہیں جھول موجود ہے۔ دہریہ اپنے انکارِ خدا میں بظاہر کتنا ہی سخت ہو، کسی نہ کسی وقت اس کا دل یہ شہادت دے گزرتا ہے کہ خاک کے ایک ذرے سے لے کر کہکشاؤں تک اور گھاس کی ایک پتی سے لے کر انسان کی تخلیق تک، یہ حیرت انگیز اور حکمت سے لبریز نظام کسی صانع حکیم کے بغیر وجود میں نہیں آ سکتا۔ اسی طرح ایک مشرک انسان اپنے شرک میں خواہ کتنا ہی گہرا ڈوبا ہوا ہو، کبھی نہ کبھی اس کا دل بھی پکار اٹھتا ہے کہ جنھیں میں معبود بنائے بیٹھا ہوں یہ خدا نہیں ہو سکتے۔ لیکن اس قلبی شہادت کا نتیجہ نہ تو یہ ہوتا ہے کہ انھیں خدا کے وجود اور اس کی توحید کا یقین حاصل ہو جائے اور نہ یہی ہوتا ہے کہ انھیں اپنے شرک اور اپنی دہریت میں کامل یقین اور اطمینان حاصل رہے۔ اس کے بجائے اس کا دین درحقیقت شک پر قائم ہوتا ہے، خواہ اس میں یقین کی کتنی ہی شدت وہ دکھا رہے ہوں۔ اب رہا یہ سوال کہ پھر وہ سنجیدگی کے ساتھ حقیقت کی جستجو کیوں نہیں کرتے کہ شک کی بے چینی سے نکل کر یقین و اطمینان کے سکون سے بہرہ ور ہو سکیں؟ اس کا جواب یہ ہے کہ دین کے معاملے میں سنجیدگی ہی سے تو وہ محروم ہوتے ہیں۔ ان کی نگاہ میں اصل اہمیت صرف دنیا کی کمائی اور اس کے عیش کی ہوتی ہے، جس کی فکر میں وہ اپنے دل و دماغ اور جسم کی ساری طاقتیں خرچ کر ڈالتے ہیں۔ رہے دین کے مسائل، تو وہ حقیقت میں ان کے لیے ایک کھیل، ایک تفریح اور ایک ذہنی عیاشی کے سوا کچھ نہیں ہوتے، جن پر وہ سنجیدگی کے ساتھ چند لمحے بھی صرف نہیں کر سکتے۔ مذہبی مراسم ہیں تو تفریح کے طور پر ادا کیے جا رہے ہیں، انکار و دہریت کی بحثیں ہیں تو تفریح کے طور پر کی جا رہی ہیں۔ دنیا کے مشاغل سے اتنی فرصت کسے ہے کہ بیٹھ کر یہ سوچے کہ کہیں ہم حق سے منحرف تو نہیں ہیں اور اگر حق سے منحرف ہیں تو اس کا انجام کیا ہے۔ (تفہیم القرآن بادنیٰ تصرف)"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 11،10) {فَارْتَقِبْ يَوْمَ تَاْتِي السَّمَآءُ بِدُخَانٍ مُّبِيْنٍ … :} اس میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دلائی ہے کہ اگر یہ لوگ ایمان نہیں لاتے تو آپ پریشان نہ ہوں، بلکہ اس دن کا انتظار کریں جس میں آسمان کی جانب سے ایک واضح دھواں ان لوگوں کو ڈھانپ لے گا جو نہایت تکلیف دہ عذاب ہو گا۔ واضح ہونے اور ڈھانپ لینے کا مطلب یہ ہے کہ وہ خیالی دھواں نہیں ہو گا بلکہ حقیقی ہو گا اور سب لوگوں کو اپنی لپیٹ میں لے لے گا۔ {’’ يَوْمَ ‘‘} سے مراد وہ وقت ہے جس میں دھواں رہا، کیونکہ وہ دھواں ایک دن تو نہیں رہا، بلکہ کئی دن اور مہینے رہا۔ اس دھویں سے کیا مراد ہے؟ ظاہر ہے اس سے قیامت کے دن کا دھواں مراد نہیں ہو سکتا، کیونکہ ان آیات میں کفار کو اسے دور کرنے کی دعا کے بعد اسے کچھ دور کرنے اور ان کے دوبارہ کفر کی طرف لوٹنے کا ذکر ہے، جب کہ قیامت کے دن کا عذاب کسی صورت دور ہونے والا نہیں۔ اس لیے اس سے مراد ایسا دھواں ہے جو جلد ہی دنیا میں انھیں ڈھانپنے والا ہے۔ اس دھویں کے متعلق دو قول ہیں، عبد اللہ بن مسعود رضی اللہ عنہ نہایت جزم کے ساتھ اسے اس قحط کے نتیجے میں پھیلنے والا دھواں قرار دیتے ہیں جو ہجرت کے بعد رسول اللہ صلی اللہ علیہ وسلم کی بددعا سے مکہ میں واقع ہوا۔ چنانچہ وہ فرماتے ہیں : [ إِنَّمَا كَانَ هٰذَا لِأَنَّ قُرَيْشًا لَمَّا اسْتَعْصَوْا عَلَی النَّبِيِّ صَلَّی اللّٰهُ ع عَلَيْهِ وَ سَلَّمَ دَعَا عَلَيْهِمْ بِسِنِيْنَ كَسِنِيْ يُوْسُففَ، فَأَصَابَهُمْ قَحْطٌ وَجَهْدٌ حَتّٰی أَكَلُوا الْعِظَامَ، فَجَعَلَ الرَّجُلُ يَنْظُرُ إِلَی السَّمَاءِ فَيَرٰی مَا بَيْنَهُ وَبَيْنَهَا كَهَيْئَةِ الدُّخَانِ مِنَ الْجَهْددِ، فَأَنْزَلَ اللّٰهُ تَعَالٰی: «فَارْتَقِبْ يَوْمَ تَاْتِي السَّمَآءُ بِدُخَانٍ مُّبِيْنٍ (10) يَّغْشَى النَّاسَ هٰذَا عَذَابٌ اَلِيْمٌ » قَالَ فَأُتِيَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ فَقِيْلَ يَا رَسُوْلَ اللّٰهِ! اسْتَسْقِ اللّٰهَ لِمُضَرَ، فَإِنَّهَا قَدْ هَلَكَتْ، قَالَ لِمُضَرَ؟ إِنَّكَ لَجَرِيْءٌ، فَاسْتَسْقٰیقٰی فَسُقُوْا فَنَزَلَتْ: «اِنَّكُمْ عَآىِٕدُوْنَ » فَلَمَّا  أَصَابَتْهُمُ الرَّفَاهِيَةُ عَادُوْا إِلٰی حَالِهِمْ، حِيْنَ أَصَابَتْهُمُ الرَّفَاهِيَةُ، فَأَنْزَلَ اللّٰهُ عَزَّ وَجَلَّ : « يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرٰى اِنَّا مُنْتَقِمُوْنَ » قَالَ يَعْنِيْ يَوْمَ بَدْرٍ ] [ بخاري، التفسیر، سورۃ الدخان : ۴۸۲۱ ] ’’اس کی وجہ یہ تھی کہ قریش نے جب رسول اللہ صلی اللہ علیہ وسلم کے خلاف سخت سرکشی کی تو آپ صلی اللہ علیہ وسلم نے ان پر قحط سالیوں کی بددعا کی، جیسے یوسف علیہ السلام کے قحط کے سال تھے۔ تو انھیں قحط اور بھوک نے آ لیا، حتیٰ کہ وہ ہڈیاں کھا گئے۔ آدمی آسمان کی طرف دیکھنے لگتا تو بھوک کی وجہ سے اسے اپنے اور آسمان کے درمیان دھواں سا نظر آتا، تو اللہ تعالیٰ نے یہ آیت اتاری : « فَارْتَقِبْ يَوْمَ تَاْتِي السَّمَآءُ بِدُخَانٍ مُّبِيْنٍ (10) يَّغْشَى النَّاسَ هٰذَا عَذَابٌ اَلِيْمٌ» [ الدخان : ۱۰،۱۱ ] ’’سو انتظار کر جس دن آسمان ظاہر دھواں لائے گا۔ جو لوگوں کو ڈھانپ لے گا۔ یہ دردناک عذاب ہے۔‘‘ تو ایک وفد رسول اللہ صلی اللہ علیہ وسلم کے پاسپاس آیا اور آپ سے کہا : ’’یا رسول اللہ! مضر (قبیلے) کے لیے بارش کی دعا کریں، کیونکہ وہ تو ہلاک ہو گئے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’مضر کے لیے (وہ تو سخت کافر و مشرک ہیں)؟ تو بڑا جرأت والا ہے۔‘‘ خیر، آپ صلی اللہ علیہ وسلم نے بارش کے لیے دعا کر دی اور ان پر بارش ہو گئی تو یہ آیت اتری : « اِنَّكُمْ عَآىِٕدُوْنَ » [ الدخان : ۱۵ ] ’’بے شک تم دوبارہ وہی کچھ کرنے والے ہو۔‘‘ پھر جب انھیں خوش حالی ملی تو وہ اپنی پہلی حالت کی طرف پلٹ گئے، تو اللہ تعالیٰ نے یہ آیت نازل فرمائی : «يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرٰى اِنَّا مُنْتَقِمُوْنَ » [ الدخان : ۱۶ ] ’’جس دن ہم بڑی پکڑ پکڑیں گے، بے شک ہم انتقام لینے والے ہیں۔‘‘ ابن مسعود رضی اللہ عنہ نے فرمایا : ’’اس سے مراد یومِ بدر ہے۔‘‘ ابن مسعود رضی اللہ عنہ کی تفسیر کو امام طبری اور بہت سے مفسرین نے راجح قرار دیا ہے۔ اس کے مطابق یہ عذاب گزر چکا ہے۔ ¤ دوسرا قول یہ ہے کہ اس سے مراد وہ دھواں ہے جو قیامت کے قریب نکلے گا۔ حذیفہ بن اسید غفاری رضی اللہ عنہ بیان کرتے ہیں کہ ہم لوگ آپس میں کسی بات کا ذکر کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم آ گئے۔ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَا تَذَاكَرُوْنَ؟ قَالُوْا نَذْكُرُ السَّاعَةَ، قَالَ إِنَّهَا لَنْ تَقُوْمَ حَتّٰی تَرَوْنَ قَبْلَهَا عَشْرَ آيَاتٍ فَذَكَرَ اللدُّخَانَ وَالدَّجَّالَ وَالدَّابَّةَ وَطُلُوْعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَ نُزُوْلَ عِيْسَی ابْنِ مَرْيَمَ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَ يَأْجُوْجَ وَ مَأْجُوْجَ وَ ثَلَاثَةَ ةَ خُسُوْفٍ، خَسْفٌ بِالْمَشْرِقِ وَخَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ بِجَزِيْرَةِ الْعَرَبِ وَآخِرُ ذٰلِكَ نَارٌ تَخْرُجُ مِنَ الْيَمَنِ تَطْرُدُ النَّاسَ إِلٰی مَحْشَرِهِمْ ] [مسلم،، الفتن و أشراط الساعۃ، باب في الآیات التي تکون قبل الساعۃ : ۲۹۰۱ ] ’’تم کس بات کا ذکر کر رہے ہو؟‘‘ ہم نے کہا : ’’ہم قیامت کا ذکر کر رہے ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ اس وقت تک قائم نہیں ہو گی کہ تم اس سے پہلے دس نشانیاں دیکھ لو۔‘‘ تو آپ صلی اللہ علیہ وسلم نے ان نشانیوں کا ذکر فرمایا، (جو یہ ہیں) دھواں، دجال، دابہ، سورج کا مغرب سے طلوع ہونا، عیسیٰ ابن مریم صلی اللہ علیہ وسلم کا نزول، یاجوج و ماجوج، تین خسف (زمین میں دھنس جانا) ایک خسف مشرق میں، ایک خسف مغرب میں اور ایک خسف جزیرۂ عرب میں اور ان سب کے آخر میں ایک آگ ہو گی جو یمن سے نکلے گی اور لوگوں کو ان کے حشر کے مقام کی طرف ہانک کر لے جائے گی۔‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ بَادِرُوْا بِالْأَعْمَالِ سِتًّا، طُلُوْعَ الشَّمْسِ مِنْ مَغْرِبِهَا أَوِ الدُّخَانَ أَوِ الدَّجَّالَ أَوِ الدَّابَّةَ أَوْ خَاصَّةَ أَحَدِكُمْ أَوْ أَمْرَ الْعَامَّةِ ] [ مسلم، الفتن و أشراط الساعۃ، باب في بقیۃ من أحادیث الدجال : ۲۹۴۷ ] ’’چھ چیزیں ظاہر ہونے سے پہلے اعمال میں جلدی کر لو، سورج کا مغرب سے طلوع ہونا یا دھواں یا دجال یا دابہ یا تم میں سے کسی پر انفرادی عذاب یا سب پر اجتماعی عذاب۔‘‘ ¤ ابن کثیر رحمہ اللہ نے اس دوسرے قول کو ترجیح دی ہے کہ اس دخان سے مراد قیامت کے قریب نمودار ہونے والا دھواں ہے، جس کا ابھی انتظار ہے، مگر ابن مسعود رضی اللہ عنہ کی بات ہی صحیح ہے، کیونکہ آیات میں اُس دھوئیں کا ذکر ہے جو تھوڑا سا دور کیا جائے گا اور اس میں کفار کے لیے ایمان لانے کا موقع ہو گا، جب کہ قیامت کے قریب والی نشانیوں کے بعد ایمان لانے کا کوئی فائدہ نہیں ہو گا، جیسا کہ فرمایا : « يَوْمَ يَاْتِيْ بَعْضُ اٰيٰتِ رَبِّكَ لَا يَنْفَعُ نَفْسًا اِيْمَانُهَا لَمْ تَكُنْ اٰمَنَتْ مِنْ قَبْلُ اَوْ كَسَبَتْ فِيْۤ اِيْمَانِهَا خَيْرًا» [  الأنعام : ۱۵۸ ] ’’جس دن تیرے رب کی کوئی نشانی آئے گی کسی شخص کو اس کا ایمان فائدہ نہ دے گا، جو اس سے پہلے ایمان نہ لایا تھا، یا اپنے ایمان میں کوئی نیکی نہ کمائی تھی۔‘‘ عبد اللہ بن مسعود رضی اللہ عنہ نے یہ بات بھی بطورِ دلیل پیش فرمائی کہ بھلا قیامت کا عذاب بھی دور ہو سکتا ہے!؟"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11،10) {فَارْتَقِبْ يَوْمَ تَاْتِي السَّمَآءُ بِدُخَانٍ مُّبِيْنٍ … :} اس میں رسول اللہ صلی اللہ علیہ وسلم کو تسلی دلائی ہے کہ اگر یہ لوگ ایمان نہیں لاتے تو آپ پریشان نہ ہوں، بلکہ اس دن کا انتظار کریں جس میں آسمان کی جانب سے ایک واضح دھواں ان لوگوں کو ڈھانپ لے گا جو نہایت تکلیف دہ عذاب ہو گا۔ واضح ہونے اور ڈھانپ لینے کا مطلب یہ ہے کہ وہ خیالی دھواں نہیں ہو گا بلکہ حقیقی ہو گا اور سب لوگوں کو اپنی لپیٹ میں لے لے گا۔ {’’ يَوْمَ ‘‘} سے مراد وہ وقت ہے جس میں دھواں رہا، کیونکہ وہ دھواں ایک دن تو نہیں رہا، بلکہ کئی دن اور مہینے رہا۔ اس دھویں سے کیا مراد ہے؟ ظاہر ہے اس سے قیامت کے دن کا دھواں مراد نہیں ہو سکتا، کیونکہ ان آیات میں کفار کو اسے دور کرنے کی دعا کے بعد اسے کچھ دور کرنے اور ان کے دوبارہ کفر کی طرف لوٹنے کا ذکر ہے، جب کہ قیامت کے دن کا عذاب کسی صورت دور ہونے والا نہیں۔ اس لیے اس سے مراد ایسا دھواں ہے جو جلد ہی دنیا میں انھیں ڈھانپنے والا ہے۔ اس دھویں کے متعلق دو قول ہیں، عبد اللہ بن مسعود رضی اللہ عنہ نہایت جزم کے ساتھ اسے اس قحط کے نتیجے میں پھیلنے والا دھواں قرار دیتے ہیں جو ہجرت کے بعد رسول اللہ صلی اللہ علیہ وسلم کی بددعا سے مکہ میں واقع ہوا۔ چنانچہ وہ فرماتے ہیں : [ إِنَّمَا كَانَ هٰذَا لِأَنَّ قُرَيْشًا لَمَّا اسْتَعْصَوْا عَلَی النَّبِيِّ صَلَّی اللّٰهُ ع عَلَيْهِ وَ سَلَّمَ دَعَا عَلَيْهِمْ بِسِنِيْنَ كَسِنِيْ يُوْسُففَ، فَأَصَابَهُمْ قَحْطٌ وَجَهْدٌ حَتّٰی أَكَلُوا الْعِظَامَ، فَجَعَلَ الرَّجُلُ يَنْظُرُ إِلَی السَّمَاءِ فَيَرٰی مَا بَيْنَهُ وَبَيْنَهَا كَهَيْئَةِ الدُّخَانِ مِنَ الْجَهْددِ، فَأَنْزَلَ اللّٰهُ تَعَالٰی: «فَارْتَقِبْ يَوْمَ تَاْتِي السَّمَآءُ بِدُخَانٍ مُّبِيْنٍ (10) يَّغْشَى النَّاسَ هٰذَا عَذَابٌ اَلِيْمٌ » قَالَ فَأُتِيَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ فَقِيْلَ يَا رَسُوْلَ اللّٰهِ! اسْتَسْقِ اللّٰهَ لِمُضَرَ، فَإِنَّهَا قَدْ هَلَكَتْ، قَالَ لِمُضَرَ؟ إِنَّكَ لَجَرِيْءٌ، فَاسْتَسْقٰیقٰی فَسُقُوْا فَنَزَلَتْ: «اِنَّكُمْ عَآىِٕدُوْنَ » فَلَمَّا  أَصَابَتْهُمُ الرَّفَاهِيَةُ عَادُوْا إِلٰی حَالِهِمْ، حِيْنَ أَصَابَتْهُمُ الرَّفَاهِيَةُ، فَأَنْزَلَ اللّٰهُ عَزَّ وَجَلَّ : « يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرٰى اِنَّا مُنْتَقِمُوْنَ » قَالَ يَعْنِيْ يَوْمَ بَدْرٍ ] [ بخاري، التفسیر، سورۃ الدخان : ۴۸۲۱ ] ’’اس کی وجہ یہ تھی کہ قریش نے جب رسول اللہ صلی اللہ علیہ وسلم کے خلاف سخت سرکشی کی تو آپ صلی اللہ علیہ وسلم نے ان پر قحط سالیوں کی بددعا کی، جیسے یوسف علیہ السلام کے قحط کے سال تھے۔ تو انھیں قحط اور بھوک نے آ لیا، حتیٰ کہ وہ ہڈیاں کھا گئے۔ آدمی آسمان کی طرف دیکھنے لگتا تو بھوک کی وجہ سے اسے اپنے اور آسمان کے درمیان دھواں سا نظر آتا، تو اللہ تعالیٰ نے یہ آیت اتاری : « فَارْتَقِبْ يَوْمَ تَاْتِي السَّمَآءُ بِدُخَانٍ مُّبِيْنٍ (10) يَّغْشَى النَّاسَ هٰذَا عَذَابٌ اَلِيْمٌ» [ الدخان : ۱۰،۱۱ ] ’’سو انتظار کر جس دن آسمان ظاہر دھواں لائے گا۔ جو لوگوں کو ڈھانپ لے گا۔ یہ دردناک عذاب ہے۔‘‘ تو ایک وفد رسول اللہ صلی اللہ علیہ وسلم کے پاسپاس آیا اور آپ سے کہا : ’’یا رسول اللہ! مضر (قبیلے) کے لیے بارش کی دعا کریں، کیونکہ وہ تو ہلاک ہو گئے۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’مضر کے لیے (وہ تو سخت کافر و مشرک ہیں)؟ تو بڑا جرأت والا ہے۔‘‘ خیر، آپ صلی اللہ علیہ وسلم نے بارش کے لیے دعا کر دی اور ان پر بارش ہو گئی تو یہ آیت اتری : « اِنَّكُمْ عَآىِٕدُوْنَ » [ الدخان : ۱۵ ] ’’بے شک تم دوبارہ وہی کچھ کرنے والے ہو۔‘‘ پھر جب انھیں خوش حالی ملی تو وہ اپنی پہلی حالت کی طرف پلٹ گئے، تو اللہ تعالیٰ نے یہ آیت نازل فرمائی : «يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرٰى اِنَّا مُنْتَقِمُوْنَ » [ الدخان : ۱۶ ] ’’جس دن ہم بڑی پکڑ پکڑیں گے، بے شک ہم انتقام لینے والے ہیں۔‘‘ ابن مسعود رضی اللہ عنہ نے فرمایا : ’’اس سے مراد یومِ بدر ہے۔‘‘ ابن مسعود رضی اللہ عنہ کی تفسیر کو امام طبری اور بہت سے مفسرین نے راجح قرار دیا ہے۔ اس کے مطابق یہ عذاب گزر چکا ہے۔ ¤ دوسرا قول یہ ہے کہ اس سے مراد وہ دھواں ہے جو قیامت کے قریب نکلے گا۔ حذیفہ بن اسید غفاری رضی اللہ عنہ بیان کرتے ہیں کہ ہم لوگ آپس میں کسی بات کا ذکر کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم آ گئے۔ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَا تَذَاكَرُوْنَ؟ قَالُوْا نَذْكُرُ السَّاعَةَ، قَالَ إِنَّهَا لَنْ تَقُوْمَ حَتّٰی تَرَوْنَ قَبْلَهَا عَشْرَ آيَاتٍ فَذَكَرَ اللدُّخَانَ وَالدَّجَّالَ وَالدَّابَّةَ وَطُلُوْعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَ نُزُوْلَ عِيْسَی ابْنِ مَرْيَمَ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَ يَأْجُوْجَ وَ مَأْجُوْجَ وَ ثَلَاثَةَ ةَ خُسُوْفٍ، خَسْفٌ بِالْمَشْرِقِ وَخَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ بِجَزِيْرَةِ الْعَرَبِ وَآخِرُ ذٰلِكَ نَارٌ تَخْرُجُ مِنَ الْيَمَنِ تَطْرُدُ النَّاسَ إِلٰی مَحْشَرِهِمْ ] [مسلم،، الفتن و أشراط الساعۃ، باب في الآیات التي تکون قبل الساعۃ : ۲۹۰۱ ] ’’تم کس بات کا ذکر کر رہے ہو؟‘‘ ہم نے کہا : ’’ہم قیامت کا ذکر کر رہے ہیں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’وہ اس وقت تک قائم نہیں ہو گی کہ تم اس سے پہلے دس نشانیاں دیکھ لو۔‘‘ تو آپ صلی اللہ علیہ وسلم نے ان نشانیوں کا ذکر فرمایا، (جو یہ ہیں) دھواں، دجال، دابہ، سورج کا مغرب سے طلوع ہونا، عیسیٰ ابن مریم صلی اللہ علیہ وسلم کا نزول، یاجوج و ماجوج، تین خسف (زمین میں دھنس جانا) ایک خسف مشرق میں، ایک خسف مغرب میں اور ایک خسف جزیرۂ عرب میں اور ان سب کے آخر میں ایک آگ ہو گی جو یمن سے نکلے گی اور لوگوں کو ان کے حشر کے مقام کی طرف ہانک کر لے جائے گی۔‘‘ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ بَادِرُوْا بِالْأَعْمَالِ سِتًّا، طُلُوْعَ الشَّمْسِ مِنْ مَغْرِبِهَا أَوِ الدُّخَانَ أَوِ الدَّجَّالَ أَوِ الدَّابَّةَ أَوْ خَاصَّةَ أَحَدِكُمْ أَوْ أَمْرَ الْعَامَّةِ ] [ مسلم، الفتن و أشراط الساعۃ، باب في بقیۃ من أحادیث الدجال : ۲۹۴۷ ] ’’چھ چیزیں ظاہر ہونے سے پہلے اعمال میں جلدی کر لو، سورج کا مغرب سے طلوع ہونا یا دھواں یا دجال یا دابہ یا تم میں سے کسی پر انفرادی عذاب یا سب پر اجتماعی عذاب۔‘‘ ¤ ابن کثیر رحمہ اللہ نے اس دوسرے قول کو ترجیح دی ہے کہ اس دخان سے مراد قیامت کے قریب نمودار ہونے والا دھواں ہے، جس کا ابھی انتظار ہے، مگر ابن مسعود رضی اللہ عنہ کی بات ہی صحیح ہے، کیونکہ آیات میں اُس دھوئیں کا ذکر ہے جو تھوڑا سا دور کیا جائے گا اور اس میں کفار کے لیے ایمان لانے کا موقع ہو گا، جب کہ قیامت کے قریب والی نشانیوں کے بعد ایمان لانے کا کوئی فائدہ نہیں ہو گا، جیسا کہ فرمایا : « يَوْمَ يَاْتِيْ بَعْضُ اٰيٰتِ رَبِّكَ لَا يَنْفَعُ نَفْسًا اِيْمَانُهَا لَمْ تَكُنْ اٰمَنَتْ مِنْ قَبْلُ اَوْ كَسَبَتْ فِيْۤ اِيْمَانِهَا خَيْرًا» [  الأنعام : ۱۵۸ ] ’’جس دن تیرے رب کی کوئی نشانی آئے گی کسی شخص کو اس کا ایمان فائدہ نہ دے گا، جو اس سے پہلے ایمان نہ لایا تھا، یا اپنے ایمان میں کوئی نیکی نہ کمائی تھی۔‘‘ عبد اللہ بن مسعود رضی اللہ عنہ نے یہ بات بھی بطورِ دلیل پیش فرمائی کہ بھلا قیامت کا عذاب بھی دور ہو سکتا ہے!؟"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) { رَبَّنَا اكْشِفْ عَنَّا الْعَذَابَ اِنَّا مُؤْمِنُوْنَ:} یعنی کفار عذاب دیکھ کر یہ بات کہیں گے، جیسا کہ فرعون کی قوم ہر عذاب آنے پر یہی وعدہ کرتی رہی۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 14،13) { اَنّٰى لَهُمُ الذِّكْرٰى وَ قَدْ جَآءَهُمْ رَسُوْلٌ مُّبِيْنٌ … :} یعنی انھیں دھوئیں کے عذاب کی دلیل سے نصیحت کیسے ہو گی جب کہ ان کے پاس اس سے بہت ہی بڑی دلیل پہلے آ چکی اور وہ ہے رسول مبین، جس کا رسول ہونا بالکل واضح ہے اور جس نے ہر بات کھول کر بیان کر دی ہے۔ اس کے باوجود انھوں نے منہ موڑ لیا اور کہنے لگے کہ یہ کسی کا سکھایا ہوا ہے، دیوانہ ہے۔{ ’’ ثُمَّ ‘‘ } (پھر) کا لفظ ان کے حال پر تعجب کے اظہار کے لیے ہے کہ رسول مبین کا آنا اس قدر واضح اور روشن نشانی تھی کہ اسے نہ ماننے کی گنجائش ہی نہ تھی، پھر بھی انھوں نے اس پر معلَّم اور مجنون کا بہتان لگا کر ایمان لانے سے انکار کر دیا۔ یہاں اللہ تعالیٰ نے کلام مختصر کر دیا ہے، ورنہ یہ ایک شخص یا ایک مجلس کی بات نہیں بلکہ کسی شخص نے معلَّم کہا اور کسی نے مجنون، کسی مجلس میں ایک تہمت جڑی گئی تو کسی میں دوسری۔ کفار رسول اللہ صلی اللہ علیہ وسلم پر یہ تہمت لگاتے تھے کہ کوئی آدمی آپ کو یہ قرآن سکھا جاتا ہے، اللہ تعالیٰ نے اس کا ردّ فرمایا۔ (دیکھیے نحل : ۱۰۳۔ فرقان : ۴ تا ۶) انھیں اس شخص کو دیوانہ کہتے ہوئے حیا نہیں آتی تھی جو اس سے پہلے چالیس برس ان میں رہا اور وہ اسے صادق اور امین کہتے رہے۔ پھر وہ ایسی کتاب لے کر آیا جس کی چھوٹی سے چھوٹی سورت کا جواب لانے سے بھی وہ عاجز رہے اور رہیں گے۔ بھلا دیوانے ایسے ہوتے ہیں!؟"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14،13) { اَنّٰى لَهُمُ الذِّكْرٰى وَ قَدْ جَآءَهُمْ رَسُوْلٌ مُّبِيْنٌ … :} یعنی انھیں دھوئیں کے عذاب کی دلیل سے نصیحت کیسے ہو گی جب کہ ان کے پاس اس سے بہت ہی بڑی دلیل پہلے آ چکی اور وہ ہے رسول مبین، جس کا رسول ہونا بالکل واضح ہے اور جس نے ہر بات کھول کر بیان کر دی ہے۔ اس کے باوجود انھوں نے منہ موڑ لیا اور کہنے لگے کہ یہ کسی کا سکھایا ہوا ہے، دیوانہ ہے۔{ ’’ ثُمَّ ‘‘ } (پھر) کا لفظ ان کے حال پر تعجب کے اظہار کے لیے ہے کہ رسول مبین کا آنا اس قدر واضح اور روشن نشانی تھی کہ اسے نہ ماننے کی گنجائش ہی نہ تھی، پھر بھی انھوں نے اس پر معلَّم اور مجنون کا بہتان لگا کر ایمان لانے سے انکار کر دیا۔ یہاں اللہ تعالیٰ نے کلام مختصر کر دیا ہے، ورنہ یہ ایک شخص یا ایک مجلس کی بات نہیں بلکہ کسی شخص نے معلَّم کہا اور کسی نے مجنون، کسی مجلس میں ایک تہمت جڑی گئی تو کسی میں دوسری۔ کفار رسول اللہ صلی اللہ علیہ وسلم پر یہ تہمت لگاتے تھے کہ کوئی آدمی آپ کو یہ قرآن سکھا جاتا ہے، اللہ تعالیٰ نے اس کا ردّ فرمایا۔ (دیکھیے نحل : ۱۰۳۔ فرقان : ۴ تا ۶) انھیں اس شخص کو دیوانہ کہتے ہوئے حیا نہیں آتی تھی جو اس سے پہلے چالیس برس ان میں رہا اور وہ اسے صادق اور امین کہتے رہے۔ پھر وہ ایسی کتاب لے کر آیا جس کی چھوٹی سے چھوٹی سورت کا جواب لانے سے بھی وہ عاجز رہے اور رہیں گے۔ بھلا دیوانے ایسے ہوتے ہیں!؟"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) {اِنَّا كَاشِفُوا الْعَذَابِ قَلِيْلًا … :} یعنی ہم تمھارے رسول کی دعا سے عذاب کو تھوڑی مدت کے لیے ہٹانے والے ہیں، تاکہ تمھارے ایمان لانے کے وعدے کی حقیقت سامنے آ جائے اور تم پر حجت پوری ہو جائے، اگرچہ ہم جانتے ہیں کہ عذاب ہٹنے پر تم دوبارہ وہی کچھ کرو گے جو پہلے کرتے تھے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرٰى اِنَّا مُنْتَقِمُوْنَ: ’’إِنَّ‘‘} علت بیان کرنے کے لیے ہے۔ یعنی یہ قحط کا عذاب تو ہم نے ہٹا لیا مگر قیامت کے دن جب ہم تمھیں بڑی گرفت میں پکڑیں گے تو وہ کسی صورت دور نہیں ہو گی، کیونکہ ہم انتقام لے رہے ہوں گے۔ دنیا کی گرفت تمھیں کفر سے واپس لانے کے لیے تھی، اس لیے اس کے بعد تمھیں رجوع کا موقع ملتا تھا، جیسا کہ فرمایا : « وَ لَنُذِيْقَنَّهُمْ مِّنَ الْعَذَابِ الْاَدْنٰى دُوْنَ الْعَذَابِ الْاَكْبَرِ لَعَلَّهُمْ يَرْجِعُوْنَ» [ السجدۃ : ۲۱ ] ’’اور یقینا ہم انھیں قریب ترین عذاب کا کچھ حصہ سب سے بڑے عذاب سے پہلے ضرور چکھائیں گے، تاکہ وہ پلٹ آئیں۔‘‘ لیکن قیامت کے دن کی بڑی گرفت انتقام کے لیے ہو گی، اس کے بعد تمھیں مہلت نہیں ملے گی۔ طبری نے اپنی سند کے ساتھ ذکر کیا ہے کہ ابن عباس رضی اللہ عنھما نے فرمایا : [ قَالَ ابْنُ مَسْعُوْدٍ ’’ الْبَطْشَةَ الْكُبْرٰى‘‘ يَوْمُ بَدْرٍ، وَ أَنَا أَقُوْلُ هِيَ يَوْممُ الْقِيَامَةِ ] [ الطبري : ۲۱ /۲۷، ح : ۳۱۳۳۸ ] ’’ابن مسعود رضی اللہ عنہ کہتے ہیں کہ {’’ الْبَطْشَةَ الْكُبْرٰى‘‘} (بڑی پکڑ) یومِ بدر ہے اور میں کہتا ہوں کہ وہ قیامت کا دن ہے۔‘‘ ابن کثیر رحمہ اللہ نے اس قول کی سند کو صحیح کہا ہے۔ ان کی تفسیر کے محقق دکتور حکمت بن بشیر نے بھی اس قول کی سند کو صحیح کہا ہے۔ حقیقت یہ ہے کہ یہاں ابن عباس رضی اللہ عنھما کی بات قوی ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { وَ لَقَدْ فَتَنَّا قَبْلَهُمْ قَوْمَ فِرْعَوْنَ:} یعنی ان کفارِ مکہ سے پہلے ہم نے  فرعون کی قوم کو آزمایا، کبھی وسعت اور فراخی دے کر اور کبھی کوئی عذاب بھیج کر۔ ان کا بھی یہی حال تھا کہ جب ان پر خوش حالی آتی تو کہتے، یہ ہمارے ہنر کا کمال ہے اور جب ان پر عذاب آتا تو اسے موسیٰ علیہ السلام کی نحوست قرار دیتے، مگر پھر انھی سے درخواست کرتے کہ اپنے رب سے دعا کر، اگر اس نے یہ عذاب ہم سے ہٹا دیا تو ہم تجھ پر ایمان لے آئیں گے اور تیرے ساتھ بنی اسرائیل کو بھیج دیں گے۔ مگر جب ان کی دعا سے وہ عذاب دور ہوتا تو فوراً عہد توڑ ڈالتے۔ آخر انجام ان کا یہ ہوا کہ موسیٰ علیہ السلام کی بددعا سے ہم نے انھیں سمندر میں غرق کر دیا۔ (دیکھیے اعراف : ۱۳۰ تا ۱۳۶) مقصود ان آیات سے رسول اللہ صلی اللہ علیہ وسلم کو تسلی اور کفار کو عبرت دلانا ہے۔ ¤ ➋ {وَ جَآءَهُمْ رَسُوْلٌ كَرِيْمٌ: ’’ كَرِيْمٌ ‘‘} کا لفظ کسی بھی چیز میں سے اعلیٰ درجے کی چیز پر بولا جاتا ہے۔ موسیٰ علیہ السلام کو کریم اس لیے فرمایا کہ وہ حسب نسب میں ان سب سے اونچے اور اخلاق و صفات میں نہایت بلند تھے اور اللہ کے ہاں اتنے عالی مرتبے والے تھے کہ اللہ تعالیٰ نے خود ان سے کلام فرمایا۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { اَنْ اَدُّوْۤا اِلَيَّ عِبَادَ اللّٰهِ … :} یہاں یہ بات ذہن میں رہنی چاہیے کہ موسیٰ علیہ السلام کے جو اقوال یہاں نقل ہوئے ہیں وہ ایک وقت کے نہیں بلکہ کئی سالوں میں مختلف مواقع پر انھوں نے فرعون اور اس کے درباریوں سے جو کچھ کہا اس کا خلاصہ چند فقروں میں بیان کیا گیا ہے۔ ¤ ➋ { اَنْ اَدُّوْۤا اِلَيَّ عِبَادَ اللّٰهِ:} اس جملے کی تفسیر دو طرح سے ہو سکتی ہے، ایک یہ کہ {’’ عِبَادَ اللّٰهِ ‘‘} کا لفظ {’’ اَدُّوْۤا اِلَيَّ ‘‘} کا مفعول بہ ہے، یعنی موسیٰ علیہ السلام نے ان سے کہا کہ اللہ کے بندوں کو میرے حوالے کر دو۔ {’’ عِبَادَ اللّٰهِ ‘‘} (اللہ کے بندوں) سے مراد بنی اسرائیل ہیں، جنھیں فرعون نے غلام بنا رکھا تھا۔ موسیٰ علیہ السلام کی بعثت کا مقصد فرعون اور اس کی قوم کو اسلام کی دعوت کے ساتھ ساتھ بنی اسرائیل کو اس کی غلامی سے نجات دلانا بھی تھا۔ اس تفسیر کی تائید اس آیت سے ہوتی ہے : « فَاْتِيٰهُ فَقُوْلَاۤ اِنَّا رَسُوْلَا رَبِّكَ فَاَرْسِلْ مَعَنَا بَنِيْۤ اِسْرَآءِيْلَ وَ لَا تُعَذِّبْهُمْ » [ طٰہٰ : ۴۷ ] ’’تو اس کے پاس جاؤ اور کہو بے شک ہم تیرے رب کے بھیجے ہوئے ہیں، پس تو بنی اسرائیل کو ہمارے ساتھ بھیج دے اور انھیں عذاب نہ دے۔‘‘ یہاں بنی اسرائیل کو {’’ عِبَادَ اللّٰهِ ‘‘} کہنے کا مطلب یہ ہے کہ وہ اللہ کے بندے اور غلام ہیں، تمھیں کوئی حق نہیں کہ انھیں غلام بنا کر رکھو۔ یہی بات جنگ قادسیہ کے موقع پر ربعی بن عامر رضی اللہ عنہ نے ایرانیوں کے سردار رستم سے کہی تھی، جب اس نے ان سے پوچھا : [ مَا جَاءَ بِكُمْ؟ ] ’’تمھیں کیا چیز لے کر آئی ہے؟‘‘ تو انھوں نے جواب میں جو تقریر کی اس کے چند جملے یہ ہیں : [ اَللّٰهُ ابْتَعَثَنَا لِنُخْرِجَ مَنْ شَاءَ مِنْ عِبَادَةِ الْعِبَادِ إِلٰی عِبَادَةِ اللّٰهِ وَ مِنْ ضِيْقِ الدُّنْيَا إِلٰی سَعَتِهَا وَمِنْ جَوْرِ الْأَدْيَانِ إِلٰی عَدْلِ الْإِسْلَامِ ] [ البدایۃ والنہایۃ : 47/7، سن ۱۴ ہجري کے واقعات ] ’’اللہ تعالیٰ نے ہمیں بھیجا ہے تاکہ ہم جسے وہ چاہے اسے بندوں کی غلامی سے نکال کر اللہ کی غلامی کی طرف اور دنیا کی تنگی سے نکال کر اس کی وسعت کی طرف اور تمام دینوں کے ظلم و جور سے نکال کر اسلام کے عدل کی طرف لے آئیں۔‘‘ ¤ دوسری تفسیر یہ ہے کہ {’’ عِبَادَ اللّٰهِ ‘‘} سے پہلے حرفِ ندا {’’يَا‘‘} محذوف ہے اور وہ منادیٰ مضاف ہونے کی وجہ سے منصوب ہے اور {’’ اَدُّوْۤا اِلَيَّ ‘‘} کا مفعول محذوف ہے : {’’ أَيْ أَدُّوْا إِلَيَّ مَا وَجَبَ عَلَيْكُمْ يَا عِبَادَ اللّٰهِ! ‘‘} ’’یعنی اے اللہ کے بندو! جو حقوق تم پر واجب ہیں وہ مجھے ادا کرو۔‘‘ یعنی مجھ پر ایمان لاؤ اور میری اطاعت کرو۔ اس تفسیر کے مطابق {’’ عِبَادَ اللّٰهِ ‘‘} سے مراد قبطی ہیں۔ یہ تفسیر بھی درست ہے، بعد کا جملہ {’’ اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌ ‘‘} اس تفسیر سے زیادہ مناسبت رکھتا ہے۔ حرف ندا کا حذف کلامِ عرب میں عام ہے، جیسا کہ عزیزِ مصر نے کہا تھا : « يُوْسُفُ اَعْرِضْ عَنْ هٰذَا » [ یوسف : ۲۹ ] {’’ أَيْ يَا يُوْسُفُ! أَعْرِضْ عَنْ هٰذَا ‘‘} یعنی اے یوسف! اس معاملے سے درگزر کر۔ ¤ ➌ { اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌ:} یہ پہلے جملے کی علت ہے، یعنی میرے حقوق جو تم پر واجب ہیں ادا کرو، کیونکہ میں تمھارے لیے ایک امانت دار رسول ہوں، تمھیں اللہ کا پیغام ٹھیک ٹھیک کسی کمی یا زیادتی کے بغیر پہنچاتا ہوں۔ یہ الفاظ اس وقت کے ہیں جب موسیٰ علیہ السلام نے شروع میں اپنی دعوت پیش فرمائی۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { وَ اَنْ لَّا تَعْلُوْا عَلَى اللّٰهِ:} اور اللہ کے سامنے اونچے مت بنو، اس کے مقابلے میں سرکشی مت کرو۔ یعنی تمھارا مجھ پر ایمان نہ لانا دراصل اللہ تعالیٰ کے مقابلے میں سرکشی ہے، کیونکہ مجھے بھیجنے والا وہ ہے اور جو کچھ میں نے تمھیں کہا ہے وہ میری بات نہیں بلکہ اللہ کی بات ہے جو میں پوری امانت کے ساتھ تمھیں پہنچا رہا ہوں۔ دوسری بات یہ کہ کسی دوسرے کے غلام کو اپنا غلام بنا لینا بہت بڑی سرکشی ہے جو تم نے اللہ کے بندوں کو اپنا غلام بنا کر اس کے مقابلے میں اختیار کر رکھی ہے، اس لیے یہ سرکشی چھوڑ کر انھیں آزاد کر دو۔ ¤ ➋ { اِنِّيْۤ اٰتِيْكُمْ بِسُلْطٰنٍ مُّبِيْنٍ:} یعنی اگر تمھیں شک ہے کہ مجھے اللہ تعالیٰ نے نہیں بھیجا تو میں اللہ کی طرف سے اپنے رسول ہونے کی واضح دلیل پیش کرنے والا ہوں جس سے تمھیں میری رسالت میں کوئی شبہ باقی نہیں رہے گا۔ {’’ بِسُلْطٰنٍ مُّبِيْنٍ ‘‘} اگرچہ نکرہ ہے مگر اسم جنس ہونے کی وجہ سے اس سے مراد صرف ایک دلیل نہیں بلکہ عصائے موسیٰ سے لے کر وہ تمام معجزے ہیں جو موسیٰ علیہ السلام پہلی مرتبہ فرعون کے پاس آنے سے لے کر مصر میں قیام کے آخری وقت تک دکھاتے رہے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {وَ اِنِّيْ عُذْتُ بِرَبِّيْ وَ رَبِّكُمْ اَنْ تَرْجُمُوْنِ:} یہ اس وقت کی بات ہے جب موسیٰ علیہ السلام کی دعوت اندر ہی اندر دور تک پھیل گئی، حتیٰ کہ فرعون کی قوم کے کئی آدمی بھی پوشیدہ طور پر ان پر ایمان لے آئے، اس وقت فرعون نے موسیٰ علیہ السلام کو قتل کرنے کا ارادہ کر لیا۔ جب موسیٰ علیہ السلام کو معلوم ہوا کہ فرعونیوں کا ارادہ انھیں سنگسار کرکے بدترین طریقے سے قتل کرنے کا ہے، تو اس وقت موسیٰ علیہ السلام نے کہا کہ میں اس بات سے اپنے اور تمھارے رب کی پناہ پکڑتا ہوں کہ تم مجھے سنگسار کرو، کیونکہ وہ میرا ہی نہیں تمھارا بھی مالک ہے، تم اس سے زبردست ہو کر مجھے رجم نہیں کر سکتے۔ سورۂ مومن (۲۶، ۲۷) میں فرعون کے قتل کے اعلان اور موسیٰ علیہ السلام کی دعا اور اللہ کی پناہ میں جانے کا مفصل ذکر ہے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {وَ اِنْ لَّمْ تُؤْمِنُوْا لِيْ فَاعْتَزِلُوْنِ:} یعنی اگر تم مجھ پر ایمان نہیں لاتے تو مجھے میرے حال پر چھوڑ دو، مجھے ایذا نہ پہنچاؤ اور بنی اسرائیل کو میرے ہمراہ جانے سے نہ روکو۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) { فَدَعَا رَبَّهٗۤ اَنَّ هٰۤؤُلَآءِ قَوْمٌ مُّجْرِمُوْنَ:} یہاں ایک لمبا قصہ حذف کر دیا گیا ہے جو کئی سال تک موسیٰ علیہ السلام کی دعوت، ہر طرح کی آزمائشوں کے باوجود فرعون کی سرکشی، بنی اسرائیل پر بے پناہ مظالم اور ان کے بے مثال صبر پر مشتمل ہے۔ {’’ فَدَعَا رَبَّهٗۤ ‘‘} کے ساتھ اس قصے کا انجام بیان کیا گیا ہے کہ جب انھوں نے تمام معجزے دیکھنے، ہر بار ایمان لانے کا عہد کرنے اور اسے توڑ دینے کے بعد صاف لفظوں میں کہہ دیا : «مَهْمَا تَاْتِنَا بِهٖ مِنْ اٰيَةٍ لِّتَسْحَرَنَا بِهَا فَمَا نَحْنُ لَكَ بِمُؤْمِنِيْنَ» [الأعراف : ۱۳۲ ] ’’تو ہمارے پاس جو نشانی بھی لے آئے، تاکہ ہم پر اس کے ساتھ جادو کرے تو ہم تیری بات ہرگز ماننے والے نہیں۔‘‘ تو ان کے ایمان لانے سے پوری طرح مایوس ہونے کے بعد نوح علیہ السلام کی طرح موسیٰ علیہ السلام نے بھی ان کے خلاف اپنے رب سے دعا کی کہ یہ لوگ مجرم ہیں، کسی طرح ماننے والے نہیں۔ سورۂ یونس میں ہے : « وَ قَالَ مُوْسٰى رَبَّنَاۤ اِنَّكَ اٰتَيْتَ فِرْعَوْنَ وَ مَلَاَهٗ زِيْنَةً وَّ اَمْوَالًا فِي الْحَيٰوةِ الدُّننْيَا رَبَّنَا لِيُضِلُّوْا عَنْ سَبِيْلِكَ رَبَّنَا اطْمِسْ عَلٰۤى اَمْوَالِهِمْ وَ اشْدُدْ عَلٰى قُلُوْبِهِمْ فَلَا يُؤْمِنُوْا حَتّٰى يَرَوُا الْعَذَابَ الْاَلِيْمَ » [ یونس  : ۸۸ ] ’’اور موسیٰ نے کہا اے ہمارے رب! بے شک تو نے فرعون اور اس کے سرداروں کو دنیا کی زندگی میں بہت سی زینت اور اموال عطا کیے ہیں، اے ہمارے رب! تاکہ وہ تیرے راستے سے گمراہ کریں، اے ہمارے رب! ان کے مالوں کو مٹا دے اور ان کے دلوں پر سخت گرہ لگا دے، پس وہ ایمان نہ لائیں، یہاں تک کہ دردناک عذاب دیکھ لیں۔‘‘"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ {فَاَسْرِ بِعِبَادِيْ لَيْلًا … :} موسیٰ علیہ السلام کی دعا قبول ہوئی اور حکم ہوا کہ میرے بندوں کو راتوں رات لے کر نکل جاؤ، تاکہ فرعون کو فوری خبر نہ ہو سکے اور یاد رکھو! تمھارا تعاقب کیا جائے گا، اس لیے تمھیں ہجرت کا یہ سفر پوری احتیاط کے ساتھ ہوشیار رہ کر کرنا ہو گا۔ ¤ ➋ {’’ بِعِبَادِيْ ‘‘} (میرے بندوں) سے مراد بنی اسرائیل ہیں اور ان کے ساتھ قبطیوں کے وہ لوگ بھی جو ایمان لا چکے تھے۔ اس واقعہ کی تفصیل کے لیے دیکھیے سورۂ شعراء (۵۲ تا ۶۸)، یونس (۸۸ تا ۹۲) اور سورۂ طٰہٰ (۷۷)۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) {وَ اتْرُكِ الْبَحْرَ رَهْوًا … : ’’رَهَا، يَرْهُوْ رَهْوًا‘‘} (ن) {’’ الْبَحْرُ ‘‘} سمندر کا ساکن ہونا۔ {’’رَهَا الرَّجُلُ رَهْوًا‘‘} جب آدمی دونوں ٹانگیں کھول لے اور انھیں الگ الگ کر لے۔ یہاں اس قصے کا وہ حصہ حذف کر دیا ہے جس میں ذکر ہے کہ بنی اسرائیل سمندر پر پہنچے تو پیچھے سے فرعون بھی پہنچ گیا، بنی اسرائیل سخت خوف زدہ ہو گئے کہ اب دوبارہ پکڑے جائیں گے، تو اللہ تعالیٰ نے موسیٰ علیہ السلام کو وحی کی کہ اپنی لاٹھی سمندر پر مار۔ار۔ انھوں نے ایسا کیا تو سمندر پھٹ گیا اور پانی کا ہر حصہ اپنی جگہ ایک بڑے پہاڑ کی شکل میں کھڑا ہو گیا۔ موسیٰ علیہ السلام اور بنی اسرائیل خیریت سے گزر گئے تو موسیٰ علیہ السلام کو حکم ہوا : «وَ اتْرُكِ الْبَحْرَ رَهْوًا » ’’اور سمندر کو اپنے حال پر ٹھہرا ہوا چھوڑ دے۔‘‘ دیکھیے سورۂ شعراء (۵۲ تا ۶۸) سمندر سے پار ہونے پر موسیٰ علیہ السلام کو حکم ہوا کہ سمندر کو اسی حالت میں ٹھہرا ہوا چھوڑ دیں کہ اس میں الگ الگ راستے کھلے ہوں، تعاقب کی فکر مت کریں، اس لشکر کو اسی سمندرمیں غرق کیا جانا ہے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25تا28) {كَمْ تَرَكُوْا مِنْ جَنّٰتٍ وَّ عُيُوْنٍ …:} ان آیات کی تفصیل کے لیے دیکھیے سورۂ شعراء کی آیات کی (۵۵ تا ۵۹) کی تفسیر۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 25تا28) {كَمْ تَرَكُوْا مِنْ جَنّٰتٍ وَّ عُيُوْنٍ …:} ان آیات کی تفصیل کے لیے دیکھیے سورۂ شعراء کی آیات کی (۵۵ تا ۵۹) کی تفسیر۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 25تا28) {كَمْ تَرَكُوْا مِنْ جَنّٰتٍ وَّ عُيُوْنٍ …:} ان آیات کی تفصیل کے لیے دیکھیے سورۂ شعراء کی آیات کی (۵۵ تا ۵۹) کی تفسیر۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 25تا28) {كَمْ تَرَكُوْا مِنْ جَنّٰتٍ وَّ عُيُوْنٍ …:} ان آیات کی تفصیل کے لیے دیکھیے سورۂ شعراء کی آیات کی (۵۵ تا ۵۹) کی تفسیر۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ {فَمَا بَكَتْ عَلَيْهِمُ السَّمَآءُ وَ الْاَرْضُ :} اس آیت کی تفسیر میں تین قول ہیں، تینوں میں سے جو بھی مراد لے لیں درست ہے۔ ایک یہ کہ {’’ السَّمَآءُ ‘‘} سے پہلے لفظ {’’أَهْلٌ‘‘} محذوف ہے، جیسے یوسف علیہ السلام کے بھائیوں نے والد کو جا کر بتایا کہ آپ کے بیٹے نے چوری کی ہے، جس کی وجہ سے عزیز مصر نے اسے اپنے پاس روک لیا ہے۔ پھر یقین دلانے کے لیے کہا : « وَ سْـَٔلِ الْقَرْيَةَ الَّتِيْ كُنَّا فِيْهَا وَ الْعِيْرَ الَّتِيْۤ اَقْبَلْنَا فِيْهَا» [ یوسف : ۸۲ ] ’’اور آپ اس بستی سے پوچھ لیں جس میں ہم تھے اور اس قافلے سے بھی جس میں ہم آئے ہیں۔‘‘ مطلب یہ ہے کہ اس بستی والوں سے پوچھ لیں۔ اسی طرح یہاں مطلب یہ ہے کہ نہ ان پر آسمان والے روئے اور نہ زمین والے، بلکہ ہر ایک نے اطمینان کا سانس لیا اور ہر ظالم حکمران ٹولے کا یہی حشر ہوتا ہے۔ ¤ دوسرا قول یہ کہ اس سے مراد ان کی تحقیر اور ان کا مذاق اڑانا ہے۔ عرب کے ہاں جب کوئی بڑا آدمی فوت ہوتا تو وہ اس کی موت کو بہت بڑا حادثہ بتانے کے لیے کہتے کہ اس پر آسمان رویا، زمین روئی اور پہاڑ لرز اٹھے۔ مطلب یہ کہ اتنی شان و شوکت والے اور خدائی کا ڈنکا بجانے والے مرے تو ان لوگوں کی طرح جن کی نہ کوئی حیثیت ہوتی ہے اور نہ کسی کو ان کے مرنے کی پروا ہوتی ہے۔ تیسرا قول یہ کہ آیت کے ظاہر الفاظ کے مطابق آسمان و زمین نیک لوگوں کے مرنے پر روتے ہیں، مگر ان کے مرنے پر نہ آسمان رویا نہ زمین۔ یہ معنی بھی کچھ بعید نہیں، جس طرح اللہ تعالیٰ نے اپنے ڈر سے پتھروں سے نہریں پھوٹنے، ان کے پھٹ جانے اور اللہ کے خوف سے گر پڑنے کا ذکر فرمایا ہے (دیکھیے بقرہ : ۷۴) اور جس طرح کھجور کے درخت کا تنا (حنانہ) رسول اللہ صلی اللہ علیہ وسلم کے اسے چھوڑ کر منبر پر خطبہ دینے کے وقت رویا تھا۔ ¤ ➋ { وَ مَا كَانُوْا مُنْظَرِيْنَ:} اور نہ وہ مہلت پانے والے ہوئے کہ توبہ کر لیتے، بلکہ آن کی آن میں ڈبو دیے گئے۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {وَ لَقَدْ نَجَّيْنَا بَنِيْۤ اِسْرَآءِيْلَ مِنَ الْعَذَابِ الْمُهِيْنِ:} موسیٰ علیہ السلام کے واقعہ میں فرعون اور آل فرعون کو غرق کرنے کا ذکر کرنے کے بعد بنی اسرائیل پر اپنے انعامات کا ذکر فرمایا۔ اس میں قریش کے جباروں کو فرعون اور آلِ فرعون کے انجام سے ڈرایا گیا ہے اور رسول اللہ صلی اللہ علیہ وسلم اور مسلمانوں کو تسلی دی گئی ہے کہ نہ کفر کے یہ سردار فرعون جیسی قوت و شوکت کے مالک ہیں نہ مسلمان بنی اسرائیل جتنے مظلوم اور بے بس۔ تو جب فرعون کی قوت و شوکت کا یہ حال ہوا تو یہ بے چارے کیا حیثیت رکھتے ہیں اور جب بنی اسرائیل جیسے بے بس اور مظلوم ظلم سے نجات پا سکتے ہیں تو مسلمانوں کو بھی اس کی امید رکھنی چاہیے۔ ¤ ’’لام‘‘ اور {’’قَدْ‘‘} تاکید کے لیے قسم کا مفہوم رکھتے ہیں۔ یقین دلانے کے لیے قسم کی ضرورت اس وقت ہوتی ہے جب کوئی کسی بات کا منکر ہو، یہاں یہ بات اتنی تاکید کے ساتھ اس لیے فرمائی کہ ماننے میں نہیں آتا کہ ظلم میں اس قدر جکڑی ہوئی قوم، جن کے لڑکے ذبح کیے جا رہے ہوں، لڑکیوں کو زندہ رکھ کر ان سے ہر خدمت لی جا رہی ہو اور وہ اف تک نہ کر سکتے ہوں اور دنیا میں کہیں سے انھیں مدد مل سکتی ہو نہ کوئی ان کے حق میں آواز اٹھانے والا ہو، انھیں بھی اتنی ذلت سے نجات مل سکتی ہے؟ فرمایا، ہاں، ہاں! ایسا ہوا ہے اور یقینا ہوا ہے کہ ہم نے بنی اسرائیل کو ذلیل کرنے والے عذاب سے نجات دی۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ {مِنْ فِرْعَوْنَ:} وہ عذاب کیا تھا؟ وہ فرعون تھا، اس کی ذات ہی بنی اسرائیل کے لیے مجسمۂ عذاب تھی۔ ¤ ➋ {اِنَّهٗ كَانَ عَالِيًا مِّنَ الْمُسْرِفِيْنَ:} اس کی سرکشی اور زیادتی کے لیے دیکھیے سورۂ قصص کی آیت (۴) کی تفسیر۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ { وَ لَقَدِ اخْتَرْنٰهُمْ:’’اِخْتَرْنَا‘‘ ’’اِخْتَارَ يَخْتَارُ اِخْتِيَارًا‘‘} (افتعال) سے جمع متکلم ماضی معلوم ہے۔ یہاں بھی {’’ لَقَدْ ‘‘} لانے کا مقصد یہی ہے کہ اتنی پسی ہوئی قوم کو یکایک تمام دنیا پر برتری کیسے مل سکتی ہے؟ فرمایا قسم ہے کہ ہم نے انھیں تمام جہانوں پر چن لیا، پھر ہمارے چنے ہوؤں کو برتری کیوں حاصل نہ ہو گی۔ ¤ ➋ { عَلٰى عِلْمٍ:} یعنی ہم نے بلاوجہ ان کا انتخاب نہیں کیا، بلکہ ہمیں ان کی خوبیوں اور صلاحیتوں کا علم تھا اور ہم ان کی خامیوں اور کمزوریوں سے بھی واقف تھے۔ اس علم ہی کی بنا پر ہم نے ان کے زمانے کی تمام قوموں میں سے ان کا انتخاب کیا۔ ¤ ➌ {عَلَى الْعٰلَمِيْنَ: ’’ الْعٰلَمِيْنَ ‘‘} سے مراد ان کے زمانے کے جہان ہیں، کل جہان نہیں، کیونکہ اللہ تعالیٰ نے امت محمد صلی اللہ علیہ وسلم کو : «كُنْتُمْ خَيْرَ اُمَّةٍ » [ آل عمران : ۱۱۰ ]کہہ کر تمام امتوں سے بہتر قرار دیا ہے، کیونکہ {’’ كَانَ ‘‘} استمرار پر دلالت کر رہا ہے۔ ہاں بعض جزوی فضائل بنی اسرائیل میں ایسے ہیں جو انھی کی خصوصیت ہیں، مثلاً اتنے انبیاء کا ان میں معبوث ہونا، مگر مجموعی اور کلی لحاظ سے امتِ محمد صلی اللہ علیہ وسلم افضل ہے۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) {وَ اٰتَيْنٰهُمْ مِّنَ الْاٰيٰتِ … : ’’ بَلٰٓؤٌا ‘‘} کا معنی آزمائش ہے، یہ لفظ مصیبت اور انعام دونوں معنوں میں آتا ہے، کیونکہ آزمائش دونوں کے ساتھ ہوتی ہے۔ یہاں مراد ان پر کیے جانے والے احسانات ہیں، جن میں آزادی، صحرا میں کھانے پینے اور دھوپ سے بچنے کی تمام ضرورتوں کا انتظام اور پھر ارضِ مقدس کی تولیت کا شرف سب چیزیں شامل ہیں۔ مزید دیکھیے سورۂ بقرہ (۴۹)۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) {اِنَّ هٰۤؤُلَآءِ لَيَقُوْلُوْنَ:} یہاں موسیٰ علیہ السلام کا قصہ ختم ہوا جو جملہ معترضہ کے طور پر درمیان میں آ گیا تھا اور دوبارہ سلسلۂ کلام کفارِ قریش کے ساتھ جوڑ دیا گیا، جو پہلے سے چلا آ رہا تھا اور کفار سے فرمایا تھا : « لَاۤ اِلٰهَ اِلَّا هُوَ يُحْيٖ وَ يُمِيْتُ رَبُّكُمْ وَ رَبُّ اٰبَآىِٕكُمُ الْاَوَّلِيْنَ (8) بَلْ هُمْ فِيْ شَكٍّ يَّلْعَبُوْنَ » [ الدخان : ۸، ۹ ] ’’ اس کے سوا کوئی معبود نہیں، وہ زندگی بخشتا اور موت دیتا ہے، تمھارا رب ہے اور تمھارے پہلے باپ دادا کا رب ہے۔ بلکہ وہ ایک شک میں کھیل رہے ہیں۔‘‘ ان آیات میں اللہ تعالیٰ نے اپنے زندگی بخشنے اور موت دینے کو قیامت کی دلیل کے طور پر پیش فرمایا ہے اور بتایا ہے کہ کفار شک ہی میں پڑے ہوئے ہیں۔ فرعون کی سرکشی اور غرقابی کے ذکر کے بعد کفارِ قریش کا ذکر {’’ هٰۤؤُلَآءِ ‘‘} (یہ لوگ) کہہ کر حقارت کے ساتھ فرمایا کہ فرعون جیسے قوت و شوکت اور رعب و دبدبے والے منکروں کا انجام سن چکے، اب ان لوگوں کی بات سنو جو اس کے مقابلے میں کچھ قوت نہیں رکھتے، یہ بھی ہمارے دوبارہ زندہ کرنے کی قدرت کو ماننے کے لیے تیار نہیں بلکہ کہتے ہیں۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) {اِنْ هِيَ اِلَّا مَوْتَتُنَا الْاُوْلٰى وَ مَا نَحْنُ بِمُنْشَرِيْنَ:} کہتے یہ ہیں کہ پہلی دفعہ ہم مریں گے تو قصہ ختم، پھر کوئی زندگی نہیں اور نہ ہمیں اٹھایا جائے گا۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) { فَاْتُوْا بِاٰبَآىِٕنَاۤ اِنْ كُنْتُمْ صٰدِقِيْنَ:} یعنی ہم نے آج تک کسی فوت شدہ کو زندہ ہوتے نہیں دیکھا، اگر تمھارا دعویٰ ہے کہ دوسری زندگی ہے تو ہمارے آبا و اجداد کو قبروں سے اٹھا لاؤ، اگر تم سچے ہو، ورنہ ہم تمھیں جھوٹا سمجھیں گے۔ وہ اپنی اس دلیل کو بہت مضبوط سمجھتے تھے! حالانکہ یہ کئی وجہوں سے بالکل فضول ہے، کیونکہ انھیں یہ کس نے کہا کہ وہ اسی دنیا میں آئے گی؟ وہ تو ایک نئی دنیا ہو گی جس میں تمام مردے بیک وقت اٹھ کھڑے ہوں گے۔ پھر انھیں یہ کس نے کہا ہے کہ مردوں کا زندہ کرنا پیغمبر کے اختیار میں ہے؟ اس کا کام تو صرف پیغام پہنچانا ہے، مردے زندہ کرنا یا معجزوں کے مطالبے پورے کرنا نہیں اور تیسری وجہ یہ ہے کہ قیامت کا ایک وقت مقرر ہے جسے صرف اللہ تعالیٰ جانتا ہے، وہ اسی وقت آئے گی جو اللہ تعالیٰ نے مقرر فرمایا ہے۔ اب قیامت سے پہلے قیامت کا مطالبہ کون سی دانش مندی ہے؟ اگر کسی کو آئندہ ہونے والے کسی کام کی اطلاع دی جائے تو کیا یہ کہہ کر اسے جھٹلایا جا سکتا ہے کہ یہ کام فوراً کرکے دکھاؤ، اگر ابھی نہیں ہوتا توکبھی بھی نہیں ہو گا۔ ظاہر ہے یہ نہایت بے عقلی کی بات ہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ { اَهُمْ خَيْرٌ اَمْ قَوْمُ تُبَّعٍ:} تبع یمن کے قبیلہ حمیر کے بادشاہوں کا لقب تھا، جیسے کسریٰ ایران کے بادشاہوں کا، قیصر روم کے بادشاہوں کا، فرعون مصر کے بادشاہوں کا اور نجاشی حبشہ کے بادشاہوں کا لقب ہوتا تھا۔ یہ حمیر کا بادشاہ تبع مومن تھا اور اس کی قوم کافر تھی، اس لیے اس کی قوم کی مذمت کی ہے، اس کی نہیں۔ ¤ ➋ {وَ الَّذِيْنَ مِنْ قَبْلِهِمْ:} پہلے لوگوں سے مراد عاد و ثمود، قومِ ابراہیم، قومِ لوط، اصحابِ مدین اور قومِ فرعون وغیرہ ہیں۔ ¤ ➌ { اَهْلَكْنٰهُمْ اِنَّهُمْ كَانُوْا مُجْرِمِيْنَ:} یہ کفار کے اعتراض کا تاریخ سے جواب ہے کہ جو شخص یا قوم آخرت کا انکار کرے گی اسے کوئی چیز مجرم بننے سے روک نہیں سکتی، کیونکہ اسے بازپرس کی فکر ہی نہیں ہوتی، وہ اپنی خواہشات کے پیچھے بے لگام دوڑے چلے جاتے ہیں۔ پھر ان کی سرکشی، ظلم و زیادتی اور حد سے بڑھنے کا نتیجہ یہ ہوتا ہے کہ انھیں حرف غلط کی طرح مٹا دیا جاتا ہے۔ رہی یہ بات کہ ’’یہ لوگ بہتر ہیں یا قومِ تبع اور اس سے پہلے کے لوگ‘‘ تو اس کا مطلب یہ ہے کہ یہ کفارِ مکہ تو اس خوش حالی اور قوت و شوکت کو پہنچ ہی نہیں سکے جو تبع کی قوم اور اس سے پہلے کی اقوام کو حاصل رہی ہے، جب ان کی خوش حالی انھیں اس زوال سے نہیں بچا سکی جو قیامت کے انکار کی وجہ سے ان پر آیا تو ان بے چاروں کی کیا حیثیت ہے۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 39،38) {وَ مَا خَلَقْنَا السَّمٰوٰتِ وَ الْاَرْضَ … :} یہ منکرین قیامت کے اعتراض کا عقلی جواب ہے کہ اگر سب لوگوں کو زندہ کرکے ان سے باز پرس کا اور نیک و بد کی جزا و سزا کا کوئی دن نہیں تو اس کا مطلب ہے کہ اللہ تعالیٰ نے اتنی عظیم کائنات محض کھیلنے کے لیے بنائی ہے، اس کا کوئی مقصد نہیں، اس کے ہاں نیک و بد اور ظالم و مظلوم برابر ہیں، نہ اس کے ہاں عدل ہے نہ حکمت۔ فرمایا ایسا نہیں ہے، ہم نے آسمان و زمین کو حق ہی کے ساتھ پیدا کیا ہے اور قیامت قائم کرنا ہماری حکمت اور عدل کا تقاضا ہے، مگر اکثر لوگ نہیں جانتے، اس لیے آخرت کی تیاری سے غافل ہیں۔ یہ مضمون قرآن مجید میں متعدد مقامات پر بیان ہوا ہے، دیکھیے سورۂ انبیاء (۱۶ تا ۱۸)، مومنون (۱۱۵، ۱۱۶) اور قیامہ (۳۶ تا ۴۰)۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39،38) {وَ مَا خَلَقْنَا السَّمٰوٰتِ وَ الْاَرْضَ … :} یہ منکرین قیامت کے اعتراض کا عقلی جواب ہے کہ اگر سب لوگوں کو زندہ کرکے ان سے باز پرس کا اور نیک و بد کی جزا و سزا کا کوئی دن نہیں تو اس کا مطلب ہے کہ اللہ تعالیٰ نے اتنی عظیم کائنات محض کھیلنے کے لیے بنائی ہے، اس کا کوئی مقصد نہیں، اس کے ہاں نیک و بد اور ظالم و مظلوم برابر ہیں، نہ اس کے ہاں عدل ہے نہ حکمت۔ فرمایا ایسا نہیں ہے، ہم نے آسمان و زمین کو حق ہی کے ساتھ پیدا کیا ہے اور قیامت قائم کرنا ہماری حکمت اور عدل کا تقاضا ہے، مگر اکثر لوگ نہیں جانتے، اس لیے آخرت کی تیاری سے غافل ہیں۔ یہ مضمون قرآن مجید میں متعدد مقامات پر بیان ہوا ہے، دیکھیے سورۂ انبیاء (۱۶ تا ۱۸)، مومنون (۱۱۵، ۱۱۶) اور قیامہ (۳۶ تا ۴۰)۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) { اِنَّ يَوْمَ الْفَصْلِ مِيْقَاتُهُمْ اَجْمَعِيْنَ:} یہ ان کے اس مطالبے کا جواب ہے کہ ’’ہمارے باپ دادا کو لے آؤ اگر تم سچے ہو۔‘‘ فرمایا، موت کے بعد زندگی کوئی کھیل نہیں کہ جب کوئی اس کا مطالبہ کرے اسے کوئی مردہ زندہ کرکے دکھا دیا جائے۔ اس کے لیے اللہ تعالیٰ نے ایک وقت مقرر فرما رکھا ہے جس میں وہ سب کو جمع کرکے ان کے درمیان فیصلہ فرمائے گا۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) ➊ { يَوْمَ لَا يُغْنِيْ مَوْلًى عَنْ مَّوْلًى شَيْـًٔا: ’’ مَوْلًى ‘‘} کا معنی دوست بھی ہے، قریبی رشتہ دار بھی، غلام بھی اور غلام کا مالک بھی۔ یعنی قیامت کے دن کوئی شخص کسی ایسے شخص کے کام نہیں آ سکے گا جس سے اس کی دوستی یا رشتہ داری یا اس کی حمایت حاصل کرنے کا کوئی تعلق ہو۔ دیکھیے سورۂ مومنون (۱۰۱) اور سورۂ معارج (۱۰، ۱۱)۔ ¤ ➋ { وَ لَا هُمْ يُنْصَرُوْنَ:} اور نہ کسی اور طرف سے مدد مل سکے گی۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) ➊ { اِلَّا مَنْ رَّحِمَ اللّٰهُ:} یعنی جس پر اللہ نے رحم فرما دیا وہی بچے گا، جیسا کہ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَنْ يُنَجِّيَ أَحَدًا مِّنْكُمْ عَمَلُهُ، قَالُوْا وَلَا أَنْتَ يَا رَسُوْلَ اللّٰهِ!؟ قَالَ وَ لَا ا أَنَا، إِلَّا أَنْ يَّتَغَمَّدَنِيَ اللّٰهُ بِرَحْمَةٍ ] [ بخاري، الرقاق، باب القصد والمداومۃ علی العمل : ۶۴۶۳ ] ’’تم میں کسی کو اس کا عمل نجات نہیں دلائے گا۔‘‘ صحابہ نے کہا : ’’یا رسول اللہ! کیا آپ کو بھی نہیں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’مجھے بھی نہیں، الا یہ کہ اللہ مجھے اپنی رحمت کے ساتھ ڈھانپ لے۔‘‘ ¤ ➋ {اِنَّهٗ هُوَ الْعَزِيْزُ الرَّحِيْمُ:} یہ اس بات کا جواب ہے کہ کوئی کسی کی مدد کیوں نہیں کر سکے گا؟ فرمایا اس لیے کہ اللہ تعالیٰ ہی سب پر غالب ہے، وہ جو فیصلہ کر دے گا وہ نافذ ہو کر رہے گا۔ کسی میں اسے رد کرنے یا بدلنے کی یا اس کی مرضی کے بغیر سفارش کرنے کی جرأت نہیں ہو گی۔ {’’ الرَّحِيْمُ ‘‘} کا مطلب یہ ہے کہ وہ سب پر غالب ہونے کے باوجود بے حد مہربان ہے، کسی پر ظلم نہیں کرتا۔ وہ چاہے تو قصور وار کی سزا معاف کر دے یا اس میں کمی کر دے یا کسی کو اس عمل سے بہت زیادہ جزا دے دے، مگر وہ جرم کے بغیر کسی کو سزا نہیں دیتا۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) { اِنَّ شَجَرَتَ الزَّقُّوْمِ: ’’ الزَّقُّوْمِ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ صافات (۶۲ تا۶۵)۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) { طَعَامُ الْاَثِيْمِ: ’’ الْاَثِيْمِ ‘‘} سے مراد یہاں کافر و مشرک اور قیامت کا منکر ہے، کیونکہ پیچھے انھی کا ذکر آ رہا ہے اور آگے آیت (۵۰) : « اِنَّ هٰذَا مَا كُنْتُمْ بِهٖ تَمْتَرُوْنَ » (یہ ہے جس میں تم شک کیا کرتے تھے) سے بھی ظاہر ہے کہ یہ لوگ مومن نہیں ہوں گے، کیونکہ ایمان تو یقین کا نام ہے۔ سورۂ قلم میں بھی {’’اثيم‘‘} کا لفظ کافر کے متعلق آیا ہے، فرمایا : «مَنَّاعٍ لِّلْخَيْرِ مُعْتَدٍ اَثِيْمٍ » [ القلم : ۱۲ ] ’’ خیر کو بہت روکنے والا، حد سے بڑھنے والا، سخت گناہ گار ہے۔‘‘ سورۂ جاثیہ میں فرمایا : « وَيْلٌ لِّكُلِّ اَفَّاكٍ اَثِيْمٍ» [ الجاثیۃ : ۷ ] ’’بڑی ہلاکت ہے ہر سخت جھوٹے، گناہ گار کے لیے۔‘‘"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) {كَالْمُهْلِ يَغْلِيْ فِي الْبُطُوْنِ: ’’اَلْمُهْلُ‘‘} کے کئی معنی ہیں، پگھلا ہوا تانبا، لوہا یا کوئی دھات، گرم تیل کی تلچھٹ، پیپ اور لہو۔ مزید دیکھیے سورۂ کہف (۲۹)۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) {كَغَلْيِ الْحَمِيْمِ: ’’ الْحَمِيْمِ ‘‘} نہایت گرم پانی۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) {خُذُوْهُ فَاعْتِلُوْهُ اِلٰى سَوَآءِ الْجَحِيْمِ: ’’عَتَلَ يَعْتِلُ‘‘} (ض، ن) سختی سے گھسیٹ کر لے جانا۔ {’’ سَوَآءِ ‘‘} کا معنی درمیان ہے، کیونکہ درمیان کی چیز ہر طرف سے برابر ہوتی ہے۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) {ثُمَّ صُبُّوْا فَوْقَ رَاْسِهٖ مِنْ عَذَابِ الْحَمِيْمِ:} اس آیت کی تفسیر کے لیے دیکھیے سورۂ حج کی آیت (۱۹، ۲۰) کی تفسیر۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) {ذُقْ اِنَّكَ اَنْتَ الْعَزِيْزُ الْكَرِيْمُ: ’’ ذُقْ ‘‘ ’’ذَاقَ يَذُوْقُ ذَوْقًا‘‘} (ن) سے امر ہے، چکھو۔ یہ بات ان سے طنز اور مذاق کے طور پر کہی جائے گی، کیونکہ وہ دنیا میں اپنے آپ کو ایسا ہی سمجھتے اور باور کرواتے تھے۔ جملے کی خبر {’’ الْعَزِيْزُ الْكَرِيْمُ ‘‘} پر الف لام اور ضمیرِ فصل {’’ اَنْتَ ‘‘} سے حصر کا مفہوم پیدا ہو رہا ہے کہ تو ہی وہ شخص ہے جو عزیز و کریم ہے۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) {اِنَّ هٰذَا مَا كُنْتُمْ بِهٖ تَمْتَرُوْنَ:} یعنی یہ ہے وہ جہنم جس کا تمھیں یقین نہیں تھا۔ فرشتے انھیں جہنم کی مار دے دے کر جتلائیں گے کہ یہ وہ آگ ہے جس میں تم شک کرتے تھے اور جسے تم جھٹلایا کرتے تھے۔ دیکھیے سورۂ طور (۱۳ تا ۱۵)۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) {اِنَّ الْمُتَّقِيْنَ فِيْ مَقَامٍ اَمِيْنٍ:} کفار کے برے انجام کے ذکر کے بعد متقین کے حسنِ انجام کا ذکر فرمایا۔ {’’ مَقَامٍ اَمِيْنٍ ‘‘} (امن والی جگہ) سے مراد وہ جگہ جہاں نہ موت کا کھٹکا ہے نہ نکالے جانے کی فکر، نہ کوئی غم نہ پریشانی اور نہ محنت نہ مشقت۔ ابوسعید خدری اور ابوہریرہ رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُنَادِيْ مُنَادٍ إِنَّ لَكُمْ أَنْ تَصِحُّوْا فَلَا تَسْقَمُوْا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَحْيَوْا فَلَا تَمُوْتُوْا أَبَدًا وَإِنَّ لَكُمْ أَنْ  تَشِبُّوْا فَلَا تَهْرَمُوْا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَنْعَمُوْا فَلَا تَبْأَسُوْا أَبَدًا ] [ مسلم، الجنۃ و صفۃ نعیمھا، باب في دوام نعیم أھل الجنۃ… : ۲۸۳۷ ]’’(اہلِ جنت کو) ایک آواز دینے والا آواز دے گا کہ تمھیں یہ نعمت حاصل ہے کہ تم تندرست رہو گے کبھی بیمار نہ ہو گے اور تمھیں یہ نعمت حاصل ہے کہ زندہ رہو گے کبھی نہیں مرو گے اور تمھیں یہ نعمت حاصل ہے کہ جوان رہو گے کبھی بوڑھے نہیں ہو گے اور تمھیں یہ نعمت حاصل ہے کہ خوش حال رہو گے کبھی خستہ حال نہیں ہو گے۔‘‘"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 52) {فِيْ جَنّٰتٍ وَّ عُيُوْنٍ:} یہ امن والی جگہ کا بیان ہے۔ تفسیر کے لیے دیکھیے سورۂ حجر (۴۵)۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53) { يَّلْبَسُوْنَ مِنْ سُنْدُسٍ وَّ اِسْتَبْرَقٍ مُّتَقٰبِلِيْنَ:’’ سُنْدُسٍ ‘‘} باریک ریشمی کپڑا۔ {’’ اِسْتَبْرَقٍ ‘‘} گاڑھے دبیز ریشم کا کپڑا۔ {’’ مُتَقٰبِلِيْنَ ‘‘} آمنے سامنے، کسی کی پشت دوسرے کی طرف نہیں ہو گی۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) ➊ {كَذٰلِكَ: ’’أَيْ اَلْأَمْرُ كَذٰلِكَ‘‘} یا {’’ يَكُوْنُ كَذٰلِكَ‘‘} یعنی ایسے ہی ہو گا، نہ ہونے کا سوال ہی پیدا نہیں ہوتا۔ ¤ ➋ { وَ زَوَّجْنٰهُمْ بِحُوْرٍ عِيْنٍ:’’ حُوْرٌ ‘‘ ’’حَوْرَاءُ‘‘} کی جمع ہے، نہایت گوری عورت جس کی آنکھوں کی سیاہی بہت سیاہ اور سفیدی بہت سفید ہو، جسے دیکھتے ہی بندہ حیران رہ جائے۔ بعض نے معنی کیا، سیاہ آنکھ والی عورت جس کی آنکھ میں سفیدی کا حصہ بہت کم ہو۔ {’’ عِيْنٍ ‘‘ ’’عَيْنَاءُ‘‘} کی جمع ہے، بڑی آنکھوں والی عورت۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) {يَدْعُوْنَ فِيْهَا بِكُلِّ فَاكِهَةٍ اٰمِنِيْنَ:} بے خوف ہو کر منگوانے کا مطلب یہ ہے کہ نہ انھیں یہ فکر ہو گا کہ وہ چیز موجود نہ ہو، نہ یہ کہ قیمت کہاں سے ادا کریں گے، نہ یہ کہ ختم ہو جائے گی، نہ یہ کہ کھانے سے بدہضمی نہ ہو جائے، پھر نہ قبض کا خوف نہ اسہال کا۔ غرض جو چاہیں گے بے فکر ہو کر جنت کے خادموں کو لانے کا حکم دیں گے۔"
    },
    {
      "ayah": 56,
      "tafsir": "(آیت 56) ➊ { لَا يَذُوْقُوْنَ فِيْهَا الْمَوْتَ اِلَّا الْمَوْتَةَ الْاُوْلٰى:} ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُؤْتٰی بِالْمَوْتِ كَهَيْئَةِ كَبْشٍ أَمْلَحَ فَيُنَادِيْ مُنَادٍ يَا أَهْلَ الْجَنَّةِ! فَيَشْرَئِبُّوْنََ وَ يَنْظُرُوْنَ فَييَقُوْلُ هَلْ تَعْرِفُوْنَ هٰذَا ؟ فَيَقُوْلُوْنَ نَعَمْ، هٰذَا الْمَوْتُ وَكُلُّهُمْ قَدْ رَاٰهُ، ثُمَّ يُنَادِيْ يَا أَهْلَ  النَّارِ ! فَيَشْرَئِبُّوْنَ وَ يَنْظُرُوْنَ فَيَقُوْلُ هَلْ تَعْررِفُوْنَ هٰذَا ؟ فَيَقُوْلُوْنَ نَعَمْ، هٰذَا الْمَوْتُ وَ كُلُّهُمْ قَدْ رَاٰهُ، فَيُذْبَحُ ثُمَّ يَقُوْلُ يَا أَهْلَ الْجَنَّةِ ! خُلُوْدٌ فَلَا مَوْتَ وَ يَا أَهْلَ النَّارِ! خُلُوْدٌ فَلاَ مَوْتَ، ثُمَّ  قَرَأَ : « وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ» وَهٰؤُلَاء فِيْ غَفْلَةٍ أَهْلُ الدُّنْيَا « وَ هُمْ لَا يُؤْمِنُوْنَ » ] [ بخاري، التفسیر، باب قولہ عز وجل: « و أنذرھم یوم الحسرۃ» : ۴۷۳۰ ] ’’موت کو ایک چتکبرے مینڈھے کی شکل میں لایا جائے گا، پھر ایک آواز دینے والا آواز دے گا : ’’اے جنت والو!‘‘ تو وہ سر اٹھائیں گے اور دیکھیں گے۔ وہ کہے گا : ’’کیا تم اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں! یہ موت ہے۔‘‘ اور وہ سب اسے دیکھ چکے ہوں گے، پھر وہ آواز دے گا : ’’اے آگ والو!‘‘ تو وہ سر اٹھائیں گے اور دیکھیں گے، وہ کہے گا : ’’کیا تم اسے پہچانتے ہو؟‘‘ وہ کہیں گے : ’’ہاں! یہ موت ہے۔‘‘ اور وہ سب اسے دیکھ چکے ہوں گے، تو اسے ذبح کر دیا جائے گا۔ پھر وہ کہے گا : ’’اے جنت والو! (اب) ہمیشگی ہے، کوئی موت نہیں اور اے آگ والو! (اب) ہمیشگی ہے، کوئی موت نہیں۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : «وَ اَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُ وَ هُمْ فِيْ غَفْلَةٍ » [ مریم : ۳۹ ] ’’اور انھیں پچھتاوے کے دن سے ڈرا جب فیصلہ کر دیا جائے گا اور وہ سراسر غفلت میں ہیں۔‘‘ یعنی وہ سراسر دنیا کی غفلت میں ہیں اور وہ ایمان نہیں لاتے۔‘‘ مزید دیکھیے سورۂ مریم (۳۹)۔ ¤ ➋ { وَ وَقٰىهُمْ عَذَابَ الْجَحِيْمِ:} یہاں ایک سوال ہے کہ جو شخص جنت میں داخل ہو گیا اس کا جہنم سے بچنا تو خود بخود ظاہر ہے، پھر یہ کہنے کی کیا ضرورت ہے کہ وہ انھیں بھڑکتی آگ سے بچا لے گا۔ جواب اس کا یہ ہے کہ جنت کی قدر پوری طرح اس وقت معلوم ہوتی ہے جب اس کے پیشِ نظر یہ بات بھی ہو کہ اگر میں جہنم میں ہوتا تو میرا کیا حال ہوتا۔"
    },
    {
      "ayah": 57,
      "tafsir": "(آیت 57) {فَضْلًا مِّنْ رَّبِّكَ ذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُ:} یعنی جنت میں داخلہ کسی کےے استحقاق یا اعمال کی وجہ سے نہیں ہو گا بلکہ محض اللہ کے فضل سے ہو گا، کیونکہ آدمی جتنے اعمال بھی کرے وہ اللہ تعالیٰ کی ایک نعمت کا بدل نہیں ہو سکتے۔ اس سے پہلے آیت (۴۲) کی تفسیر میں رسول اللہ صلی اللہ علیہ وسلم کی حدیث گزر چکی ہے کہ کسی بھی شخص کو اس کا عمل جنت میں داخل نہیں کرے گا، وہاں ملاحظہ فرمائیں۔"
    },
    {
      "ayah": 58,
      "tafsir": "(آیت 58) { فَاِنَّمَا يَسَّرْنٰهُ بِلِسَانِكَ لَعَلَّهُمْ يَتَذَكَّرُوْنَ:} سورت کی ابتدا قرآن کریم کی عظمت و اہمیت کے بیان سے ہوئی تھی، آخر میں پھر اسی کی طرف توجہ دلائی کہ ہم نے یہ قرآن آپ کی زبان عربی میں آسان کر دیا ہے، تاکہ عرب لوگ اسے اپنی زبان میں ہونے کی وجہ سے آسانی کے ساتھ سمجھ لیں اور غیر عرب لوگوں کو سمجھائیں۔ مزید دیکھیے سورۂ مریم کی آیت (۹۷) کی تفسیر۔"
    },
    {
      "ayah": 59,
      "tafsir": "(آیت 59) {فَارْتَقِبْ اِنَّهُمْ مُّرْتَقِبُوْنَ:} یعنی اگر قرآن آسان ہونے کے باوجود یہ لوگ نصیحت حاصل نہیں کرتے تو آپ انتظار کیجیے کہ کب اللہ کی پکڑ ان پر آتی ہے۔ یہ لوگ بھی انتظار کر رہے ہیں کہ آپ کب زمانے کی کسی گردش میں آتے ہیں اور کب ان کی جان چھوٹتی ہے، جیسا کہ فرمایا : « اَمْ يَقُوْلُوْنَ شَاعِرٌ نَّتَرَبَّصُ بِهٖ  رَيْبَ الْمَنُوْنِ (30) قُلْ تَرَبَّصُوْا فَاِنِّيْ مَعَكُمْ مِّنَ الْمُتَرَبِّصِيْنَ » [ الطور : ۳۰، ۳۱ ] ’’یا وہ کہتے ہیں کہ یہ ایک شاعر ہے جس پر ہم زمانے کے حوادث کا انتظار کرتے ہیں؟ کہہ دے انتظار کرو، پس بے شک میں (بھی) تمھارے ساتھ انتظار کرنے والوں سے ہوں۔‘‘"
    }
  ]
}