{
  "surah": "Al-Ahqaf",
  "surah_number": 46,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) {حٰمٓ:} حروف مقطعات کی تفصیل کے لیے دیکھیے سورۂ بقرہ کی پہلی آیت کی تفسیر۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) { تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ … :} اس آیت کی وضاحت کے لیے دیکھیے سورۂ زمر، سورۂ مومن اور سورۂ جاثیہ کی ابتدائی آیات کی تفسیر۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {مَا خَلَقْنَا السَّمٰوٰتِ وَ الْاَرْضَ وَ مَا بَيْنَهُمَاۤ اِلَّا بِالْحَقِّ:} قرآن مجید کے بنیادی مضامین میں سب سے اہم مضمون توحید اور آخرت ہیں۔ ان دونوں کو دلائل کے ساتھ ثابت کرنے کے لیے {’’ تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِ ‘‘} کو بطور تمہید ذکر فرمایا۔ اس کے بعد ایک متفق علیہ بات کا ذکر فرمایا کہ یہ سب مانتے ہیں کہ آسمان و زمین اور ان کے درمیان کی تمام چیزوں کو پیدا کرنے والا اللہ تعالیٰ ہے۔ یہ تسلیم کر لینے کے بعد اس کائنات کے متعلق کوئی بھی بات اسی کی معتبر ہو گی جس نے اسے بنایا ہے۔ چنانچہ اس کا فرمان ہے کہ ہم نے آسمان و زمین اور ان کے درمیان کی چیزوں کو حق ہی کے ساتھ پیدا فرمایا ہے۔ ان میں سے کوئی چیز باطل نہیں کہ اس میں کوئی خامی یا غلطی ہو یا وہ بے مقصد ہو یا محض کھیل کے لیے بنائی گئی ہو، بلکہ ان کے پیدا کرنے میں بہت سی حکمتیں ہیں۔ قرآن مجید نے آسمان و زمین کی پیدائش میں ملحوظ بہت سی حکمتیں بیان فرمائی ہیں، جن میں سب سے بڑی اللہ تعالیٰ کے وجود اور اس کی توحید پر دلالت ہے، جیسا کہ فرمایا : « وَ اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ لَاۤ اِلٰهَ اِلَّا هُوَ الرَّحْمٰمٰنُ الرَّحِيْمُ (163) اِنَّ فِيْ خَلْقِ السَّمٰوٰتِ وَ الْاَرْضِ وَ اخْتِلَافِ الَّيْلِ وَ النَّهَارِ وَ الْفُلْكِ الَّتِيْ تَجْرِيْ فِي الْبَحْرِ بِمَا يَنْفَعُ النَّاسَ وَ مَاۤ اَنْزَلَ اللّٰهُ مِنَ السَّمَآءِ مِنْ مَّآءٍ فَاَحْيَا بِهِ الْاَرْضَ بَعْدَ مَوْتِهَا وَ بَثَّ فِيْهَا مِنْ كُلِّ دَآبَّةٍ وَّ تَصْرِيْفِ الرِّيٰحِ وَ السَّحَابِ الْمُسَخَّرِ بَيْنَ السَّمَآءِ وَ الْاَرْضِ لَاٰيٰتٍ لِّقَوْمٍ يَّعْقِلُوْننَ » [ البقرۃ : ۱۶۳، ۱۶۴ ] ’’اور تمھارا معبود ایک ہی معبود ہے، اس کے سوا کوئی معبود نہیں، بے حد رحم والا، نہایت مہربان ہے۔ بے شک آسمانوں اور زمین کے پیدا کرنے اور رات اور دن کے بدلنے میں اور ان کشتیوں میں جو سمندر میں وہ چیزیں لے کر چلتی ہیں جو لوگوں کو نفع دیتی ہیں اور اس پانی میں جو اللہ نے آسمان سے اتارا، پھر اس کے ساتھ زمین کو اس کی موت کے بعد زندہ کر دیا اور اس میں ہر قسم کے جانور پھیلا دیے اور ہواؤں کے بدلنے میں اور اس بادل میں جو آسمان و زمین کے درمیان مسخر کیا ہوا ہے، ان لوگوں کے لیے یقینا بہت سی نشانیاں ہیں جو سمجھتے ہیں۔‘‘ یعنی یہ حقیقت کہ معبود برحق اکیلا اللہ تعالیٰ ہی ہے، عقل والوں کو زمین و آسمان کی پیدائش اور ان دونوں میں پائی جانے والی مذکورہ اشیاء پر غور کرنے سے معلوم ہو جاتی ہے۔ قرآن مجید نے یہ حقیقت بار بار دہرائی ہے کہ عبادت کا حق دار ہونے یا نہ ہونے کا فیصلہ اس بات پر ہوتا ہے کہ پیدا کرنے والا کون ہے؟ جو پیدا کرنے والا ہے سچا معبود وہی ہے، جو کچھ پیدا ہی نہیں کر سکتا وہ معبود بھی نہیں ہو سکتا۔ خالق ہونے کی وجہ سے اللہ تعالیٰ کے اکیلے مستحق عبادت ہونے کی متعدد آیات میں سے چند آیات ملاحظہ فرمائیں، سورۂ بقرہ (۲۱، ۲۲)، اعراف (۱۹۱)، ہود (۷)، رعد (۱۶)، سورۂ نحل (۳ تا ۲۰) (ان آیات میں ’’خلق‘‘ کے بار بار دہرانے کو ملحوظ رکھیں)، سورۂ حج (۷۳)، فرقان (۲، ۳) اور سورۂ اعلیٰ (۱، ۲)۔ ¤ زمین و آسمان کی پیدائش میں ایک حکمت ان کی اللہ تعالیٰ کے علم اور اس کی قدرت کے کمال پر دلالت ہے، جیسا کہ فرمایا: «اَللّٰهُ الَّذِيْ خَلَقَ سَبْعَ سَمٰوٰتٍ وَّ مِنَ الْاَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْاَممْرُ بَيْنَهُنَّ لِتَعْلَمُوْۤا اَنَّ اللّٰهَ عَلٰى كُلِّ شَيْءيْءٍ قَدِيْرٌ وَّ اَنَّ اللّٰهَ قَدْ اَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا » [ الطلاق : ۱۲ ] ’’اللہ ہی ہے جس نے سات آسمان پیدا کیے اور زمین سے بھی ان کی مانند ۔ ان کے درمیان حکم نازل ہوتا ہے، تاکہ تم جان لو کہ اللہ ہر چیز پر خوب قدرت رکھنے والا ہے اور یہ کہ اللہ نے یقینا ہر چیز کو علم سے گھیر رکھا ہے۔‘‘ سورۂ طلاق کی اس آیت میں {’’ لِتَعْلَمُوْۤا ‘‘} (تاکہ تم جان لو) کا ’’لام‘‘ {’’ خَلَقَ سَبْعَ سَمٰوٰتٍ ‘‘} کے متعلق ہے۔ ¤ آسمان و زمین کو حق کے ساتھ پیدا کرنے میں ایک حکمت مخلوق کی آزمائش ہے کہ ان میں سے عمل کے لحاظ سے بہتر کون ہے، جیسا کہ فرمایا : « وَ هُوَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ فِيْ سِتَّةِ اَيَّامٍ وَّ كَانَ عَرْشُهٗ عَلَى الْمَآءِ لِيَبْلُوَكُمْ اَيُّكُمْ اَحْسَنُ عَمَلًا» [ ھود : ۷ ] ’’اور وہی ہے جس نے آسمانوں اور زمین کو چھ دنوں میں پیدا کیا اور اس کا عرش پانی پر تھا، تاکہ وہ تمھیں آزمائے کہ تم میں سے کون عمل میں زیادہ اچھا ہے۔‘‘ یہی بات سورۂ کہف (۷) اور سورۂ ملک (۲،۳) میں فرمائی۔ اسی کی وضاحت سورۂ ذاریات میں فرمائی : « وَ مَا خَلَقْتُ الْجِنَّ وَ الْاِنْسَ اِلَّا لِيَعْبُدُوْنِ (56) مَاۤ اُرِيْدُ مِنْهُمْ مِّنْ رِّزْقٍ وَّ مَاۤ اُرِيْدُ اَنْ يُّطْعِمُوْنِ» [الذاریات : ۵۶،۵۷ ] ’’اور میں نے جنوں اور انسانوں کو پیدا نہیں کیا مگر اس لیے کہ وہ میری عبادت کریں۔ نہ میں ان سے کوئی رزق چاہتا ہوں اور نہ یہ چاہتا ہوں کہ وہ مجھے کھلائیں۔‘‘ ¤ حق کے ساتھ پیدا کرنے میں ایک حکمت ان کی اس بات پر دلالت ہے کہ ہر شخص کو اس کے عمل کی جزا ملے گی، جیسا کہ فرمایا : « وَ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ لِيَجْزِيَ الَّذِيْنَ اَسَآءُوْا بِمَا عَمِلُوْا وَ يَجْزِيَ الَّذِيْنَ اَحْسَنُوْا بِالْحُسْنٰى» [ النجم : ۳۱ ] ’’اور جو کچھ آسمانوں میں اور جو کچھ زمین میں ہے اللہ ہی کا ہے، تاکہ وہ ان لوگوں کو جنھوں نے برائی کی اس کا بدلا دے جو انھوں نے کیا اور ان لوگوں کو جنھوں نے بھلائی کی بھلائی کے ساتھ بدلا دے۔‘‘ اس کی وضاحت سورۂ یونس کی آیت (۴) سے بھی ہوتی ہے۔ کفار چونکہ سمجھتے تھے کہ آسمان و زمین کی پیدائش کا کوئی مقصد نہیں، نہ اللہ کی طرف سے ان پر کوئی ذمہ داری عائد ہوئی ہے، نہ حساب ہو گا اور نہ جزا و سزا کا کوئی معاملہ ہے۔ ان کے مطابق تو زمین و آسمان کا یہ سب سلسلہ باطل اور بے مقصد ہوا، اس لیے اللہ تعالیٰ نے کفار کی اس بات کی سخت تردید فرمائی، فرمایا : «وَ مَا خَلَقْنَا السَّمَآءَ وَ الْاَرْضَ وَ مَا بَيْنَهُمَا بَاطِلًا ذٰلِكَ ظَنُّ الَّذِيْنَ كَفَرُوْا فَوَيْلٌ لِّلَّذِيْنَ كَفَرُوْا مِنَ النَّارِ » [ صٓ : ۲۷ ] ’’اور ہم نے آسمان و زمین کو اور ان دونوں کے درمیان کی چیزوں کو بے کارپیدا نہیں کیا۔ یہ ان لوگوں کا گمان ہے جنھوں نے کفر کیا، سو ان لوگوں کے لیے جنھوں نے کفر کیا آگ کی صورت میں بڑی ہلاکت ہے ۔‘‘ یہی بات سورۂ مومنون (۱۱۵، ۱۱۶)، آل عمران (۱۹۰، ۱۹۱) اور سورۂ دخان (۳۸، ۳۹) میں بیان ہوئی ہے۔ ¤ ➋ { وَ اَجَلٍ مُّسَمًّى:} یعنی ہم نے کائنات کا یہ نظام دائمی اور ابدی نہیں بنایا، بلکہ اس کا ایک وقت مقرر ہے، جس کے بعد ہر شخص کو اس کے عمل کا بدلا ملے گا۔ ¤ ➌ { وَ الَّذِيْنَ كَفَرُوْا عَمَّاۤ اُنْذِرُوْا مُعْرِضُوْنَ:} ’’انذار‘‘ کا معنی آگاہ کرنا ہے جس کے ساتھ ڈرانا بھی ہو۔ یعنی اگرچہ کفار کو آگاہ کر دیا گیا کہ زمین و آسمان کی پیدائش بے مقصد نہیں، نہ یہ سلسلہ دائمی ہے بلکہ یہ تمھاری آزمائش کے لیے ہے اور ایک مقرر وقت پر تم سب اللہ تعالیٰ کے حضور پیش کیے جاؤ گے، اس کے باوجود جس آخرت اور جس اخروی عذاب سے انھیں ڈرایا گیا وہ اس سے منہ پھیرنے والے ہیں، نہ اس پر ایمان لاتے ہیں اور نہ اس سے بچنے کی تیاری کرتے ہیں۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ { قُلْ اَرَءَيْتُمْ مَّا تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ …:} جیسا کہ پچھلی آیت کی تفسیر میں تفصیل سے بیان ہوا ہے کہ اللہ تعالیٰ کے اکیلے معبود ہونے کی اور اس کے سوا تمام معبودوں کے باطل ہونے کی سب سے بڑی اور واضح دلیل اس کا کائنات کو پیدا کرنا ہے۔ یہ عقلی دلیل ہے جسے کوئی صاحبِ عقل ردّ نہیں کر سکتا، کفار کی اس کے جواب سے بے بسی واضح کرنے کے لیے اسے مناظرانہ انداز میں پیش کرنے کا حکم دیا کہ آپ ان سے کہیں کہ مجھے بتاؤ کہ اللہ کے سوا جن ہستیوں کو تم پکارتے ہو، ذرا مجھے دکھاؤ زمین کی وہ کون سی چیز ہے جو انھوں نے پیدا کی ہے، یا آسمانوں میں ان کا کوئی حصہ ہے تو وہ دکھاؤ؟ ظاہر ہے وہ ایسی کوئی چیز دکھا ہی نہیں سکتے، تو پھر کسی اور معبود کی عبادت کیوں کرتے ہیں۔ یہاں ایک لمبی بات کو مختصر کر دیا ہے، اصل یہ تھا کہ مجھے دکھاؤ کہ زمین و آسمان کی کون سی چیز ہے جو پوری کی پوری انھوں نے پیدا کی ہو، یا زمین و آسمان کی کوئی چیز دکھاؤ جو پوری نہ سہی اس کے بنانے یا چلانے میں ان کا حصہ ہی ہو۔ پہلے جملے میں سے صرف زمین کا ذکر فرمایا آسمان کو حذف کر دیا، دوسرے جملے میں آسمانوں کا ذکر فرمایا زمین کو حذف کر دیا۔ یہ بات خود بخود سمجھ میں آ رہی ہے کہ دونوں جملوں میں دونوں مراد ہیں، اسے بلاغت کی اصطلاح میں احتباک کہتے ہیں۔ ¤ بعض مفسرین نے یہاں لکھا ہے کہ آیت میں زمین کی کسی چیز کو پیدا کرنے کی نفی اور آسمانوں کی چیز میں شرکت کی نفی اس لیے فرمائی ہے کہ بظاہر زمین کی بعض اشیاء میں ان کی شرکت ہے جو آسمانوں میں بظاہر بھی نہیں۔ مگر یہ درست نہیں، کیونکہ دوسری جگہ اللہ تعالیٰ نے صاف الفاظ میں زمین و آسمان دونوں کی کسی چیز میں ان کی شرکت کی نفی فرمائی ہے۔ اس لیے وہی تفسیر درست ہے جو اوپر کی گئی ہے۔ دیکھیے، اللہ تعالیٰ فرماتے ہیں : « قُلِ ادْعُوا الَّذِيْنَ زَعَمْتُمْ مِّننْ دُوْنِ اللّٰهِ لَا يَمْلِكُوْنَ مِثْقَالَ ذ ذَرَّةٍ فِي السَّمٰوٰتِ وَ لَا فِي الْاَرْضِ وَ مَا لَهُمْ فِيْهِمَا مِنْ شِرْكٍ وَّ مَا لَهٗ مِنْهُمْ مِّنْ ظَهِيْرٍ» [ سبا :۲۲] ’’کہہ دے پکارو ان کو جنھیں تم نے اللہ کے سوا گمان کر رکھا ہے، وہ نہ آسمانوں میں ذرہ برابر کے مالک ہیں اور نہ زمین میں اور نہ ان کا ان دونوں میں کوئی حصہ ہے اور نہ ان میں سے کوئی اس کا مدد گار ہے۔‘‘ ¤ ➋ {اِيْتُوْنِيْ بِكِتٰبٍ مِّنْ قَبْلِ هٰذَاۤ اَوْ اَثٰرَةٍ مِّنْ عِلْمٍ ……: ’’ اَثٰرَةٍ ‘‘ ’’أَثَرَ يَأْثِرُ أَثَرًا وَ أَثَارَةً وَ أَثْرَةً‘‘} (ض، ن) {الْحَدِيْثَ‘‘} باات کو نقل کرنا۔ {’’مَأْثُوْرٌ‘‘} بمعنی ’’منقول‘‘ {’’ اَثٰرَةٍ مِّنْ عِلْمٍ ‘‘} نقل شدہ یا پہلے لوگوں کا باقی ماندہ علم۔ یہ شرک کی تردید کی نقلی دلیل ہے، یعنی شرک کی عقلی دلیل پیش نہیں کر سکتے تو کوئی معتبر نقلی دلیل ہی لے آؤ۔ قرآن سے پہلے کی کسی آسمانی کتاب مثلاً تورات یا انجیل وغیرہ سے شرک کا ثبوت لے آؤ، وہ دلیل جو کسی قابلِ اعتماد طریقے سے ہم تک پہنچی ہو، کیونکہ اس کے بغیر اس کا آسمانی کتاب ہونا ثابت ہی نہیں ہوتا۔ یا پہلے انبیاء کی احادیث میں سے منقول کوئی حدیث لے آؤ، جو محض ظن و تخمین سے منقول نہ ہو بلکہ اس سے علم و یقین حاصل ہوتا ہو۔ اس طرح کہ وہ صحیح سند یا تواتر کے ساتھ نقل ہوئی ہو، کیونکہ وہم و گمان پر مبنی چیز کو علم نہیں کہا جاتا، جیسا کہ فرمایا : « وَ مَا لَهُمْ بِهٖ مِنْ عِلْمٍ اِنْ يَّتَّبِعُوْنَ اِلَّا الظَّنَّ وَ اِننَّ الظَّنَّ لَا يُغْنِيْ مِنَ الْحَقِّ شَيْـًٔا» [النجم : ۲۸ ] ’’حالانکہ انھیں اس کے متعلق کوئی علم نہیں، وہ صرف گمان کے پیچھے چل رہے ہیں اور بے شک گمان حق کے مقابلے میں کسی کام نہیں آتا۔ ‘‘ مگر تمھیں ایسی کوئی معتبر قدیم آسمانی کتاب یا کسی نبی کی حدیث نہیں ملے گی جس میں شرک کا شائبہ تک موجود ہو، کیونکہ ہر رسول نے توحید ہی کی تعلیم دی، فرمایا : « وَ لَقَدْ بَعَثْنَا فِيْ كُلِّ اُمَّةٍ رَّسُوْلًا اَنِ اعْبُدُوا اللّٰهَ وَ اجْتَنِبُوا الطَّاغُوْتَ» [ النحل : ۳۶ ] ’’اور بلاشبہ یقینا ہم نے ہر امت میں ایک رسول بھیجا کہ اللہ کی عبادت کرو اور طاغوت سے بچو۔‘‘ اور فرمایا : « وَ مَاۤ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْۤ اِلَيْهِ اَنَّهٗ لَاۤ اِلٰهَ اِلَّاۤ اَنَا فَاعْبُدُوْنِ» [ الأنبیاء : ۲۵ ] ’’اور ہم نے تجھ سے پہلے کوئی رسول نہیں بھیجا مگر اس کی طرف یہ وحی کرتے تھے کہ حقیقت یہ ہے کہ میرے سوا کوئی معبود نہیں، سو میری عبادت کرو۔‘‘ بعض اہلِ علم نے فرمایا کہ ’’اگر یہاں کتاب سے مراد کتابِ الٰہی اور بقیہ علم سے مراد انبیاء و صلحاء کا چھوڑا ہوا علم نہ بھی لیا جائے تو دنیا کی کسی علمی کتاب اور دینی یا دنیوی علوم کے کسی ماہر کی تحقیقات میں بھی آج تک اس امر کی نشاندہی نہیں کی گئی ہے کہ زمین یا آسمان کی فلاں چیز کو خدا کے سوا فلاں بزرگ یا دیوتا نے پیدا کیا ہے، یا انسان جن نعمتوں سے اس کائنات میں متمتع ہو رہا ہے ان میں سے فلاں نعمت خدا کے بجائے فلاں معبود کی آفریدہ ہے۔‘‘ مگر یہ بات کلی طور پر درست نہیں، کیونکہ کئی دہریہ سائنسدان اپنی تحقیق کے ذریعے سے یہ ثابت کرنے کی کوشش کرتے ہیں کہ کائنات خود بخود پیدا ہوئی اور خود بخود ہی چل رہی ہے۔ زمانے کو خالق و مالک قرار دینے والے لوگ اپنی اس جہالت کو تحقیق ہی کہتے ہیں۔ اس لیے کتاب سے مراد آسمانی کتاب ہی لینا چاہیے، کیونکہ دوسری آیت سے صاف ظاہر ہے کہ کتاب سے مراد اللہ تعالیٰ کی نازل کردہ کتاب ہے، جیسا کہ فرمایا : «قُلْ اَرَءَيْتُمْ شُرَكَآءَكُمُ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ اَرُوْنِيْ مَا ذَا خَلَقُوْا مِنَ الْاَرْضِ اَمْ لَهُمْ شِرْكٌ فِي السَّمٰوٰتِ اَمْ اٰتَيْنٰهُمْ كِتٰبًا فَهُمْ عَلٰى بَيِّنَتٍ مِّنْهُ بَلْ اِنْ يَّعِدُ الظّٰلِمُوْنَ بَعْضُهُمْ بَعْضًا اِلَّا غُرُوْرًا » [ فاطر: ۴۰ ] ’’کہہ دے کیا تم نے اپنے شریکوں کو دیکھا، جنھیں تم اللہ کے سوا پکارتے ہو؟ مجھے دکھاؤ زمین میں سے انھوں نے کون سی چیز پیدا کی ہے، یاآسمانوں میں ان کا کوئی حصہ ہے، یا ہم نے انھیں کوئی کتاب دی ہے کہ وہ اس کی کسی دلیل پر قائم ہیں؟ بلکہ ظالم لوگ، ان کے بعض بعض کو دھوکے کے سوا کچھ وعدہ نہیں دیتے۔‘‘ ان آیات سے معلوم ہوا کہ دین میں دلیل کے طور پر آسمانی کتاب پیش کی جا سکتی ہے یا آسمانی وحی پر مشتمل احادیث، ان کے علاوہ کسی کی تصنیف کو یا اس کے اقوال کو بطور دلیل پیش نہیں کیا جا سکتا۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {وَ مَنْ اَضَلُّ مِمَّنْ يَّدْعُوْا مِنْ دُوْنِ اللّٰهِ … :} یہ استفہام انکار کے لیے ہے، یعنی اس سے بڑھ کر کوئی گمراہ نہیں جو اللہ کو چھوڑ کر ایسی ہستیوں کو پکارے جو قیامت کے دن تک ان کی دعا قبول نہیں کر سکتے، کیونکہ ان کے پاس یہ اختیار ہی نہیں، بلکہ انھیں ان کے پکارنے کی خبر ہی نہیں۔ عام طور پر ان سے مراد پتھر اور بت لیے جاتے ہیں، مگر لفظ {’’مَنْ‘‘} ذوی العقول کے لیے آتا ہے، اس لیے اس سے مراد وہ سب ہستیاں ہیں جنھیں لوگ اللہ کے سوا پکارتے ہیں، جن میں انسان، جن، فرشتے، نبی، ولی، نیک، بد، زندہ، مردہ سب شامل ہیں۔ رہے پتھر، بت اور قبریں وغیرہ تو انھیں پکارتے اور پوجتے وقت بھی مشرکین دراصل ان بتوں یا قبروں کے بجائے ان ہستیوں ہی کو پکار رہے ہوتے ہیں جن کے وہ بت یا قبریں ہیں، ورنہ انھیں بت بنانے کی ضرورت کیا تھی، کسی بھی پتھر کی پوجا کر لیتے۔ چنانچہ مشرکینِ عرب نے عین کعبہ کے اندر ابراہیم اور اسماعیل علیھما السلام کی صورتیں بنا کر رکھی ہوئی تھیں، جنھیں فتح مکہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے حکم سے کعبہ سے نکالا گیا۔ (دیکھیے بخاری : ۴۲۸۸) ¤ اس آیت سے معلوم ہوا کہ اللہ تعالیٰ کے سوا کوئی بھی کسی کی پکار نہ سنتا ہے نہ اس کی مدد کو پہنچ سکتا ہے۔ قرآن مجید نے یہ بات بار بار دہرائی ہے، فرمایا : « وَ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِهٖ مَا يَمْلِكُوْنَ مِنْ قِطْمِيْرٍ (13) اِنْ تَدْعُوْهُمْ لَا يَسْمَعُوْا دُعَآءَكُمْ وَ لَوْ سَمِعُوْا مَا اسْتَجَابُوْا لَكُمْ وَ يَوْمَ الْقِيٰمَةِ يَكْفُرُوْنَ بِشِرْكِكُمْ وَ لَا يُنَبِّئُكَ مِثْلُ خَبِيْرٍ» [ فاطر : ۱۳، ۱۴ ] ’’اور جن کو تم اس کے سوا پکارتے ہو وہ کھجور کی گٹھلی کے ایک چھلکے کے مالک نہیں۔ اگر تم انھیں پکارو تو وہ تمھاری پکار نہیں سنیں گے اور اگر وہ سن لیں تو تمھاری درخواست قبول نہیں کریں گے اور قیامت کے دن تمھارے شرک کا انکا ر کر دیں گے اور تجھے ایک پوری خبر رکھنے والے کی طرح کوئی خبر نہیں دے گا۔‘‘ اور فرمایا : « اِنَّ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ عِبَادٌ اَمْثَالُكُمْ فَادْعُوْهُمْ فَلْيَسْتَجِيْبُوْا لَكُمْ اِنْ كُنْتُمْ صٰدِقِيْنَ » [ الأعراف : ۱۹۴ ] ’’بے شک جنھیں تم اللہ کے سوا پکارتے ہو وہ تمھارے جیسے بندے ہیں، پس انھیں پکارو تو لازم ہے کہ وہ تمھاری دعا قبول کریں، اگر تم سچے ہو۔‘‘ اور فرمایا : «لَهٗ دَعْوَةُ الْحَقِّ وَ الَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِهٖ لَا يَسْتَجِيْبُوْنَ۠ لَهُمْ بِشَيْءٍ اِلَّا كَبَاسِطِ كَفَّيْهِ اِلَى الْمَآءِ لِيَببْلُغَ فَاهُ وَ مَا هُوَ بِبَالِغِهٖ وَ مَا دُعَآءُ الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ » [الرعد : ۱۴ ] ’’برحق پکارنا صرف اسی کے لیے ہے اور جن کو وہ اس کے سوا پکارتے ہیں وہ ان کی دعا کچھ بھی قبول نہیں کرتے، مگراس شخص کی طرح جو اپنی دونوں ہتھیلیاں پانی کی طرف پھیلانے والا ہے، تاکہ وہ اس کے منہ تک پہنچ جائے، حالانکہ وہ اس تک ہرگز پہنچنے والا نہیں اور نہیں ہے کافروں کا پکارنا مگر سراسر بے سود۔‘‘ قارئین {’’ لَا يَسْتَجِيْبُ ‘‘} کا مفہوم سمجھنے کے لیے تھوڑی زحمت کرکے ان مذکورہ بالا مقامات کی تفسیر پر بھی نظر ڈال لیں۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {وَ اِذَا حُشِرَ النَّاسُ كَانُوْا لَهُمْ اَعْدَآءً … :} یعنی قیامت کے دن جب انھیں بتایا جائے گا کہ یہ لوگ تمھیں پکارتے رہے اور تم سے فریاد کرتے رہے تو وہ صاف کہہ دیں گے کہ ہمیں اس بات کی کوئی خبر نہیں کہ یہ ہمیں پکارتے رہے، جیسا کہ فرمایا : « وَ يَوْمَ نَحْشُرُهُمْ جَمِيْعًا ثُمَّ نَقُوْلُ لِلَّذِيْنَ اَشْرَكُوْا مَكَانَكُمْ اَنْتُمْ وَ شُرَكَآؤُكُمْ فَزَيَّلْنَا بَيْنَهُمْ وَ قَالَ شُرَكَآؤُهُمْ مَّا كُنْتُمْ اِيَّانَا تَعْبُدُوْنَ (28) فَكَفٰى بِاللّٰهِ شَهِيْدًۢا بَيْنَنَا وَ بَيْنَكُمْ اِنْ كُنَّا عَنْ عِبَادَتِكُمْ لَغٰفِلِيْنَ» [ یونس : ۲۸، ۲۹ ] ’’اور جس دن ہم ان سب کو اکٹھا کریں گے، پھر ہم ان لوگوں سے جنھوں نے شریک بنائے تھے، کہیں گے اپنی جگہ ٹھہرے رہو، تم اور تمھارے شریک بھی، پھر ہم ان کے درمیان علیحدگی کر دیں گے اور ان کے شریک کہیں گے تم ہماری تو عبادت نہیں کیا کرتے تھے۔ سو اللہ ہمارے درمیان اور تمھارے درمیان کافی گواہ ہے کہ بے شک ہم تمھاری عبادت سے یقینا بے خبر تھے۔‘‘ اور دیکھیے سورۂ قصص (۶۳) اور سورۂ نحل (۸۶) مسیح علیہ السلام بھی اپنی عبادت کرنے والوں سے اپنے بے خبر ہونے کی صراحت فرما دیں گے (دیکھیے مائدہ : ۱۱۶، ۱۱۷) اور فرشتے بھی۔ (دیکھیے فرقان : ۱۷، ۸ا۔ سبا : ۴۰، ۴۱) بلکہ اللہ تعالیٰ کے سوا جن کی بھی پوجا کی گئی وہ پوجا کرنے اور پکارنے والوں کے شدید مخالف اور دشمن بن جائیں گے۔ دیکھیے سورۂ مریم (۸۱، ۸۲)۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {وَ اِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ … :} قرآن پر ایمان نہ لانے کے لیے وہ جو بہانے کرتے تھے ان کا ذکر ہو رہا ہے۔ اختصار کا تقاضا یہ تھا کہ کہا جاتا : {’’ وَ إِذَا تُتْلٰي عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالُوْا هٰذَا سِحْرٌ مُّبِيْنٌ ‘‘} (جب ان کے سامنے ہماری واضح آیات پڑھی جاتی ہیں تو کہتے ہیں یہ کھلا جادو ہے) مگر اللہ تعالیٰ نے فرمایا : « وَ اِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ قَالَ الَّذِيْنَ كَفَرُوْا لِلْحَقِّ لَمَّا جَآءَهُمْ هٰذَا سِحْرٌ مُّبِيْنٌ» ’’اور جب ان کے سامنے ہماری واضح آیات پڑھی جاتی ہیں تو وہ لوگ جنھوں نے کفر کیا حق کے بارے میں، جب وہ ان کے پاس آیا، کہتے ہیں یہ کھلا جادو ہے۔‘‘ اس آیت میں اللہ تعالیٰ نے اختصار کے بجائے تین باتوں {’’ قَالَ الَّذِيْنَ كَفَرُوْا ‘‘، ’’ لِلْحَقِّ ‘‘} اور {’’ لَمَّا جَآءَهُمْ ‘‘} کی صراحت فرمائی۔ {’’ قَالَ الَّذِيْنَ كَفَرُوْا ‘‘} کا مقصد یہ ہے کہ ان کے جھٹلانے کا اصل باعث ان کا کفر و انکار ہے، جب کوئی طے کر لے کہ ماننا ہی نہیں تو بڑی سے بڑی دلیل بھی اس کے لیے بے کار ہے، جیسا کہ فرمایا : « اِنَّ الَّذِيْنَ كَفَرُوْا سَوَآءٌ عَلَيْهِمْ ءَاَنْذَرْتَهُمْ اَمْ للَمْ تُنْذِرْهُمْ لَا يُؤْمِنُوْنَ » [ البقرۃ : ۶ ] ’’بے شک جن لوگوں نے کفر کیا ان پر برابر ہے، خواہ تو نے انھیں ڈرایا ہو یا انھیں نہ ڈرایا ہو، ایمان نہیں لائیں گے۔‘‘ {’’ لِلْحَقِّ ‘‘} کہہ کر آیات بینات کی عظمت و اہمیت اور کفار کی بدنصیبی نمایاں فرمائی کہ دیکھو وہ اس چیز کو جادو کہہ رہے ہیں جو حق ہے، جب کہ جادو سراسر باطل ہوتا ہے اور {’’ لَمَّا جَآءَهُمْ ‘‘} کا مطلب یہ ہے کہ اگر ان کے پاس حق نہ آتا تو انھیں معذور سمجھا جاتا، حق آنے کے بعد اسے جادو کہہنا بہت بڑی جرأت ہے۔ {’’ وَ اِذَا تُتْلٰى عَلَيْهِمْ ‘‘} اور {’’ لَمَّا جَآءَهُمْ ‘‘} سے یہ بات بھی واضح ہو رہی ہے کہ وہ لوگ اللہ تعالیٰ کی آیات پر غور و فکر کی زحمت ہی نہیں کرتے، بلکہ سنتے ہی انھیں جھٹلا دیتے ہیں اور جب جھٹلانے کے لیے کوئی معقول وجہ نہیں پاتے تو اس کی شدتِ تاثیر کی وجہ سے اسے جادو کہہ کر جان چھڑا لیتے ہیں، حالانکہ کہاں جادو اور کہاں یہ پاکیزہ اور عظیم الشان کلام، جس کی ایک سورت کی مثال وہ نہ لا سکے نہ لا سکتے ہیں اور کہاں نجس اور پلید جادوگر اور کہاں محمد رسول اللہ صلی اللہ علیہ وسلم جیسا پاک باز اور صادق و امین انسان، جس کی پاک بازی اور صدق و امانت کا انھیں نبوت سے چالیس برس پہلے کا بھی تجربہ تھا۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { اَمْ يَقُوْلُوْنَ افْتَرٰىهُ:} یہ ایمان نہ لانے کا ایک اور بہانہ ہے۔ ’’واؤ‘‘ کے ساتھ عطف کے بجائے حرف {’’ اَمْ ‘‘} لایا گیا ہے، یعنی ان کی یہ بات کہ یہ جادو ہے ایک طرف رہی، اس سے بھی عجیب بات سنو، وہ کہتے ہیں کہ اس نے قرآن خود تصنیف کیا ہے اور جھوٹ باندھتے ہوئے کہہ دیا ہے کہ یہ اللہ کا کلام ہے۔ حالانکہ اس میں وہ اپنی ہی بات کی نفی کر رہے ہیں، کیونکہ اگر یہ جادو ہے تو آپ صلی اللہ علیہ وسلم کا اپنا کلام نہیں اور اگر آپ صلی اللہ علیہ وسلم کا کلام ہے تو جادو نہیں۔ ¤ ➋ {قُلْ اِنِ افْتَرَيْتُهٗ فَلَا تَمْلِكُوْنَ لِيْ مِنَ اللّٰهِ شَيْـًٔا: ’’ اِنِ افْتَرَيْتُهٗ ‘‘} کا جواب محذوف ہے جو {’’ فَلَا تَمْلِكُوْنَ لِيْ ‘‘} سے سمجھ میں آ رہا ہے : {’’أَيْ إِنِ افْتَرَيْتُهُ عَاقَبَنِيَ اللّٰهُ عَلَي الْإِفْتِرَاءِ فَلَا تَمْلِكُوْنَ لِيْ مِنَ اللّ اللّٰهِ شَيْئًا ‘‘} ’’یعنی آپ ان سے کہہ دیں کہ اگر میں نے جھوٹ گھڑنے کا جرم کیا ہے تو یقینا اللہ تعالیٰ مجھے جھوٹ گھڑنے کی سزا دے گا، پھر تم اللہ تعالیٰ سے چھڑانے کے لیے میرے کسی کام نہ آؤ گے۔‘‘ ایک اور مقام پر اللہ تعالیٰ نے فرمایا : « وَ لَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْاَقَاوِيْلِ (44) لَاَخَذْنَا مِنْهُ بِالْيَمِيْنِ (45) ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِيْنَ (46) فَمَا مِنْكُمْ مِّنْ اَحَدٍ عَنْهُ ححٰجِزِيْنَ» [ الحاقۃ : ۴۴ تا ۴۷ ] ’’اور اگر وہ ہم پر کوئی بات بنا کر لگا دیتا۔ تو یقینا ہم اس کو دائیں ہاتھ سے پکڑتے۔ پھر یقینا ہم اس کی جان کی رگ کاٹ دیتے۔ پھر تم میں سے کوئی بھی( ہمیں) اس سے روکنے والا نہ ہوتا۔‘‘ ¤ ➌ {هُوَ اَعْلَمُ بِمَا تُفِيْضُوْنَ فِيْهِ … :} یعنی جب تم اس حد تک آ گئے کہ اس کلام کو افترا اور انسانی کلام کہنے لگے جس کی چھوٹی سے چھوٹی سورت کی مثال لانے سے بھی تم قاصر رہے اور سب کے سامنے واضح ہو گیا کہ وہ انسان کا کلام نہیں اور نہ کوئی انسان ایسا کلام کر سکتا ہے تو اب تم سے بحث کا کوئی فائدہ نہیں، میں اپنا معاملہ اللہ کے سپرد کرتا ہوں، وہ ان باتوں کو خوب جانتا ہے جو تم بناتے رہتے ہو۔ کبھی اسے جادو کہتے ہو، کبھی کہانت، کبھی شعر اور کبھی خود تصنیف کرکے اللہ تعالیٰ پر باندھا ہوا طوفان۔ وہی میرے اور تمھارے درمیان فیصلہ کرنے کے لیے کافی ہے، کیونکہ وہ ہم دونوں کی ہر بات سے واقف اور ہر موقع کا گواہ ہے۔ ¤ ➍ { وَ هُوَ الْغَفُوْرُ الرَّحِيْمُ:} اس جملے کی مناسبت اس مقام پر دو طرح سے ہے، ایک یہ کہ تمھارا قرآن کو افترا اور نبی کو مفتری کہنا اتنا بڑا جرم ہے کہ اگر اللہ تعالیٰ غفور و رحیم نہ ہوتا، بلکہ کوئی بے رحم اور سخت گیر مالک ہوتا تو تمھیں ایک سانس کی مہلت بھی نہ ملتی۔ یہ اس کی مغفرت اور رحمت ہی ہے کہ ایسی گستاخیوں کے باوجود وہ تمھیں فوراً نہیں پکڑتا، بلکہ مہلت دیتا ہے کہ تم کسی وقت ہی پلٹ آؤ۔ دوسری مناسبت یہ ترغیب ہے کہ اب بھی اس ہٹ دھرمی سے باز آ جاؤ تو اللہ تعالیٰ کی مغفرت و رحمت تمھارا انتظار کر رہی ہیں، کیونکہ وہ غفور بھی ہے اور رحیم بھی۔ نہ اس کی مغفرت کی کوئی انتہا ہے نہ رحمت کی، تم نے جو کچھ کیا وہ اب بھی معاف کر دے گا۔ {’’ الْغَفُوْرُ الرَّحِيْمُ ‘‘} ضمیر {’’ هُوَ ‘‘} کی خبر ہے، جس پر الف لام آنے سے کلام میں حصر پیدا ہو گیا ہے، یعنی غفور و رحیم بس وہی ہے اور کوئی ہے ہی نہیں جو تمھارے گناہوں پر پردہ ڈال دے اور تم پر بے حد رحم کرنے والا ہو، پھر اس سے بھاگ کر کہاں جاؤ گے؟"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {قُلْ مَا كُنْتُ بِدْعًا مِّنَ الرُّسُلِ:’’ بَدَعَ يَبْدَعُ بَدْعًا ‘‘} (ف) {’’اَلشَّيْءَ‘‘} کسی چیز کو ایجاد کرنا، کسی پہلی مثال کے بغیر بنانا۔ سورۂ بقرہ (۱۱۷) اور سورۂ انعام (۱۰۱) میں {’’ بَدِيْعُ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} اسی سے ہے۔ {’’بَدُعَ يَبْدُعُ بَدْعًا وَ بَدَاعَةً وَ بُدُوْعَةً‘‘} (ک) نیا ہونا، جس کی پہلے کوئی مثال نہ ہو۔ {’’ بِدْعًا ‘‘} صفت مشبّہ فعل لازم سے بمعنی اسم فاعل ہے، جیسے {’’خِفٌّ‘‘} بمعنی خفیف ہے، یا فعل متعدی سے بمعنی اسم مفعول ہے، جیسے {’’حِبٌّ‘‘} بمعنی محبوب ہے۔ {’’ بِدْعًا مِّنَ الرُّسُلِ ‘‘} نیا یا انوکھا رسول۔ کفار ایمان نہ لانے کے لیے جو بہانے اور اعتراراض کرتے تھے ان میں سے چند کا ذکر اور ان کا جواب پچھلی دو آیات میں گزرا۔ اس آیت میں ان کے بہت سے اعتراضات کا صرف جواب ذکر کیا گیا ہے، اعتراضات کا ذکر نہیں کیا گیا، کیونکہ وہ خود بخود جواب سے سمجھ میں آ رہے ہیں۔ قرآن مجید میں دوسرے مقامات پر ان کا ذکر صراحت کے ساتھ بھی موجود ہے، جن میں سے ایک یہ تھا کہ ہمارے جیسا ایک بشر رسول کیسے بن گیا، جو ہماری طرح کھاتا پیتا، بازاروں میں چلتا پھرتا اور بیوی بچے رکھتا ہے۔ ایک اعتراض یہ کرتے کہ توحید کی جو تعلیم یہ نبی پیش کرتا ہے ہم نے اپنے آبا و اجداد میں نہیں سنی۔ (دیکھیے ص : ۴ تا ۸۔ فرقان : ۷) ایک یہ کہ اگر یہ رسول ہے تو ہمارے مطالبے کے مطابق معجزے کیوں پیش نہیں کرتا، مثلاً پہاڑہٹا دے، دریا بہا دے، سونے کا مکان بنا لے، آسمان پر چڑھ جائے اور وہاں سے کتاب لا کر دکھائے وغیرہ۔ (دیکھیے بنی اسرائیل : ۹۰ تا ۹۳) اور ایک یہ کہ غیب کی خبریں ہمارے مطالبے کے مطابق کیوں نہیں بتاتا، کم از کم یہ ہی بتا دے کہ قیامت کب ہو گی۔ (دیکھیے اعراف : ۱۸۷) اللہ تعالیٰ نے ان سب کے جواب میں یہ کہنے کا حکم دیا کہ میں کوئی پہلا رسول نہیں جو بشر ہو، مجھ سے پہلے تمام رسول بشر ہی تھے، وہ کھاتے پیتے، بازاروں میں چلتے پھرتے اور بیوی بچوں والے تھے۔ ان پر انسانی عوارض آتے تھے، سب کی تعلیم توحید تھی، وہ خدائی اختیارات نہیں رکھتے تھے اور نہ ہی وہ اپنی مرضی سے معجزے پیش کر سکتے تھے۔ پھر اگر وہ سب، جن میں تمھارے جد امجد ابراہیم اور اسماعیل علیھما السلام اور بنی اسرائیل کے بہت سے انبیاء شامل ہیں، رسول اور نبی ہو سکتے ہیں اور تم انھیں نبی مانتے ہو تو میرا رسول ہونا کون سی انوکھی بات ہے؟ ¤ ➋ {وَ مَاۤ اَدْرِيْ مَا يُفْعَلُ بِيْ وَ لَا بِكُمْ:} یہ ان کے اس مطالبے کا جواب ہے کہ یہ ہمیں ہمارے مطالبے کے مطابق غیب کی خبریں کیوں نہیں دیتا۔ فرمایا ان سے کہہ دو کہ میں خود کچھ بھی نہیں جانتا، نہ یہ جانتا ہوں کہ میرے ساتھ کیا کیا جائے گا اور نہ یہ کہ تمھارے ساتھ کیا کیا جائے گا، تو میں تمھیں اپنے پاس سے تمھاری طلب کردہ باتیں کیسے بتا سکتا ہوں؟ {’’ مَا يُفْعَلُ ‘‘} فعل مجہول اس لیے لایا گیا تاکہ فاعل عام رہے، یعنی اللہ تعالیٰ ہمارے ساتھ کیا کرے گا اور لوگ کیا کریں گے۔ پھر یہ ذکر نہیں کیا گیا کہ کس وقت کیا کیا جائے گا، تاکہ عام رہے کہ ہمارے ساتھ دنیا میں کیا کیا جائے گا اور آخرت میں کیا کیا جائے گا۔ ¤ یہاں ایک مشہور سوال ہے کہ رسول اللہ صلی اللہ علیہ وسلم یقینا جانتے تھے کہ دنیا اور آخرت میں آپ کے ساتھ کیا کیا جائے گا اور آپ پر ایمان لانے والوں یا نہ لانے والوں کے ساتھ کیا کیا جائے گا، جیسا کہ قرآن مجید میں ہے کہ آپ کے پہلے اور پچھلے تمام گناہ معاف کر دیے گئے اور صحابہ کرام کے تمام گناہ معاف کرکے انھیں جنت میں داخل کیا جائے گا اور کفار و منافقین کو جہنم کا عذاب دیا جائے گا۔ (دیکھیے فتح : ۱ تا ۶) دنیا میں بھی آپ کو اور ایمان والوں کو عزت و غلبہ اور کفار کو ذلت و رسوائی ملے گی اور آپ کا دین تمام دینوں پر غالب آئے گا۔ دیکھیے سورۂ مجادلہ (۲۱)، فتح (۲۸)، صف (۸، ۹) اور دوسری متعدد آیات۔ پھر یہ کہنے کا حکم کیوں دیا کہ میں نہیں جانتا کہ میرے ساتھ کیا کیا جائے گا اور نہ یہ جانتا ہوں کہ تمھارے ساتھ کیا کیا جائے گا؟ اہلِ علم نے اس سوال کے مختلف جواب دیے ہیں، جن میں سے ایک یہ ہے کہ آپ اجمالی طور پر تو یہ جانتے تھے مگر تفصیلی طور پر آپ کو معلوم نہ تھا کہ آپ کے ساتھ یا آپ کے مخاطبین کے ساتھ دنیا یا آخرت میں کیا ہو گا۔ ایک جواب یہ دیا گیا ہے کہ پہلے آپ کو یہ معلوم نہ تھا بعد میں معلوم ہو گیا، مگر حقیقت یہ ہے کہ اس سوال کا جواب اس آیت کے جملہ {’’ وَ مَاۤ اَدْرِيْ مَا يُفْعَلُ بِيْ وَ لَا بِكُمْ ‘‘} میں اور اگلے جملے {’’ اِنْ اَتَّبِعُ اِلَّا مَا يُوْحٰۤى اِلَيَّ ‘‘} میں موجود ہے۔ ¤ ➌ { اِنْ اَتَّبِعُ اِلَّا مَا يُوْحٰۤى اِلَيَّ:} یعنی میں خود آئندہ کی کوئی بات نہیں جانتا، نہ یہ کہ میرے ساتھ کیا ہو گا اور نہ یہ کہ تمھارے ساتھ کیا ہو گا، میں تو بس اسی کی پیروی کرتا ہوں جو میری طرف وحی کی جاتی ہے۔ یعنی میں صرف اتنا بتا سکتا ہوں جو مجھے اللہ تعالیٰ کی طرف سے وحی کی جاتی ہے اور واقعی اللہ تعالیٰ نے دنیا میں آئندہ ہونے والی جو بات رسول اللہ صلی اللہ علیہ وسلم کو بتائی وہ آپ جان گئے اور جو نہیں بتائی وہ آپ کو معلوم نہیں ہوئی۔ اس کی دلیل سیکڑوں واقعات ہیں، مثلاً واقعۂ افک، بئرِ معونہ کے شہداء اور آپ صلی اللہ علیہ وسلم کا چند کفار کا نام لے کر ایک ماہ تک قنوت میں ان پر لعنت کرنا، مگر اس پر اللہ تعالیٰ کا یہ کہنا کہ یہ آپ کے اختیار میں نہیں اور پھر ان سب کا مسلمان ہو جانا وغیرہ۔ تفصیل کے لیے دیکھیے سورۂ نمل کی آیت (۶۵) : «قُلْ لَّا يَعْلَمُ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ الْغَيْبَ اِلَّا اللّٰهُ » کی تفسیر۔ سورۂ اعراف میں فرمایا : « قُلْ لَّاۤ اَمْلِكُ لِنَفْسِيْ نَفْعًا وَّ لَا ضَرًّا اِلَّا مَاا شَآءَ اللّٰهُ وَ لَوْ كُنْتُ اَعْلَمُ الْغَيْبَ لَا سْتَكْثَرْتُ مِنَ الْخَيْرِ وَ مَا مَسَّنِيَ السُّوْٓءُ اِنْ اَنَنَا اِلَّا نَذِيْرٌ وَّ بَشِيْرٌ لِّقَوْمٍ يُّؤْمِنُوْنَ» [الاعراف : ۱۸۸ ] ’’کہہ دے میں اپنی جان کے لیے نہ کسی نفع کا مالک ہوں اور نہ کسی نقصان کا، مگر جو اللہ چاہے اور اگر میں غیب جانتا ہوتا تو ضرور بھلائیوں میں سے بہت زیادہ حاصل کر لیتا اور مجھے کوئی تکلیف نہ پہنچتی، میں نہیں ہوں مگر ایک ڈرانے والا اور خوش خبری دینے والا ان لوگوں کے لیے جو ایمان رکھتے ہیں۔‘‘ اسی طرح آخرت کے متعلق جو بات بتائی وہ آپ جان گئے جو نہیں بتائی وہ نہیں جانتے تھے، جیسا کہ حدیثِ شفاعت میں ہے کہ میں عرش کے نیچے سجدے میں گر جاؤں گا اور اللہ تعالیٰ مجھے وہ تعریفیں الہام کرے گا جو اب مجھے یاد نہیں۔ [ دیکھیے بخاري، التوحید، باب کلام الرب عز و جل یوم القیامۃ مع الأنبیاء وغیرہم : ۷۵۱۰ ] ¤ الغرض، رسول اللہ صلی اللہ علیہ وسلم اور پہلے تمام انبیاء علیھم السلام کو آئندہ کی کسی بات کا نہ اجمالی علم تھا اور نہ تفصیلی، صرف ان باتوں کا علم تھا جو اللہ تعالیٰ نے انھیں بتائیں، خواہ اجمالاً بتائیں یا تفصیلاً۔ یوسف اور یعقوب علیھما السلام کا واقعہ اس کی بہترین مثال ہے۔ دیکھیے سورۂ یوسف کی آیت (۹۴) کی تفسیر۔ اسی طرح ابراہیم علیہ السلام کی زندگی کے تمام واقعات اس بات کی دلیل ہیں کہ پیغمبر کو آنے والے واقعات کا صرف اتنا علم ہوتا ہے جتنا اسے بتا دیا جائے۔ اگر کہا جائے کہ وہ سب کچھ جانتے ہوتے ہیں تو ابراہیم علیہ السلام کے آگ میں پھینکے جانے، بیٹے کو ذبح کرنے کے حکم، ہجرت میں بیوی کی عزت خطرے میں پڑنے، بیوی بچے کو بے آب و گیاہ وادی میں چھوڑنے، غرض کسی بھی امتحان میں سرخرو ہونے کی کوئی قدر و قیمت باقی نہیں رہتی۔ ¤ خلاصہ یہ کہ آیت کے الفاظ صاف بتا رہے ہیں کہ اے نبی! کہہ دے نہ میں رسولوں میں سے کوئی انوکھا ہوں اور نہ میں یہ جانتا ہوں کہ میرے ساتھ کیا کیا جائے گا اور نہ یہ کہ تمھارے ساتھ کیا کیا جائے گا، مجھے تو صرف اس بات کا پتا چلتا ہے اور میں اسی کی پیروی کرتا ہوں جس کی میری طرف وحی کی جاتی ہے، اس کے سوا میں اپنے یا تمھارے متعلق آئندہ کی کوئی بات نہیں جانتا۔ اس لیے مجھ سے قیامت کے وقت یا آئندہ کی دوسری کسی بات کے متعلق بتانے کا مطالبہ مت کرو، کیونکہ یہ میرے دائرۂ اختیار میں نہیں ہیں۔ ¤ ➍ { وَ مَاۤ اَنَا اِلَّا نَذِيْرٌ مُّبِيْنٌ:} یعنی میرا کام یہ نہیں کہ میں تمھیں بتاؤں کہ قیامت کب آئے گی، یا اپنے پاس سے تمھیں آئندہ کی خبریں بتاؤں۔ میرا کام صرف یہ ہے کہ میں اللہ کا عذاب آنے سے پہلے تمھیں اس سے واضح طور پر ڈرا دوں۔ ¤ ➎ مفسر علی بن احمد مہائمی نے اپنی تفسیر{ ’’ تبصير الرحمان ‘‘} میں اس آیت کی تفسیر کرتے ہوئے نہایت عمدہ الفاظ میں بحث کا خلاصہ بیان فرما دیا ہے، وہ لکھتے ہیں : [« قُلْ مَا كُنْتُ بِدْعًا مِّنَ الرُّسُلِ» آتِيْكُمْ بِالْمُؤَاخَذَةِ الْأُخْرَوِيَّةِ « وَ» مِنْ أَيْنَ لِيْ تَعْيِيْنُ وَقْتِهَا هَا مَعَ أَنِّيْ « مَاۤ اَدْرِيْ مَا يُفْعَلُ بِيْ وَ لَا بِكُمْ » فِيْمَا لَمْ يُوْحَ إِلَيَّ وَالْوَحْيُ بِبَعْضِ الْأُمُوْرِ لَا يَسْتَلْزِمُ الْعِلْمَ بِالْبَاقِيْ وَلَمْ يَكُنْ لِيْ  أَنْ أَضُمَّ إِلَی الْوَحْيِ كَذِبًا مِنْ عِنْدِيْ « اِنْ اَتَّبِعُ » فِيْ تَقْرِيْرِ الْأُمُوْرِ الْغَيْبِيَّةِ « اِلَّا مَا يُوْحٰۤى اِلَيَّ وَ » مَعَ ذٰلِكَ لَا يُفَوَّضُ إِلَيَّ شَيْءٌ مِمَّا يُوْحٰی إِلَيَّ مِنْ تَعْذِيْبِ مَنْ لَا يُؤْمِنُ بِيْ بَلْ « مَاۤ اَنَا اِلَّا نَذِيْرٌ » عَنْهُ « مُبِيْنٌ » لَهُ بِالدَّلَائِلِ الْقَطْعِيَّةِ۔] ’’(کہہ دے میں رسولوں میں سے کوئی انوکھا نہیں) کہ تم پر آخرت کا عذاب لے آؤں (اور) میں اس کے وقت کی تعیین کیسے کر سکتا ہوں جب کہ (میں جانتا ہی نہیں کہ میرے ساتھ کیا کیا جائے گا اور نہ یہ کہ تمھارے ساتھ کیا کیا جائے گا) ان معاملات میں جن کی میری طرف وحی نہیں کی گئی اور بعض معاملات کے وحی کیے جانے سے لازم نہیں آتا کہ مجھے تمام معاملات کا بھی علم ہو گیا اور یہ مجھ سے ہو نہیں سکتا کہ باقی معاملات میں وحی کے ساتھ اپنے پاس سے جھوٹ ملا دوں۔ (میں پیروی نہیں کرتا) غیبی معاملات بیان کرنے میں (مگر اسی کی جو میری طرف وحی کی جاتی ہے اور) اس کے ساتھ یہ کہ مجھے جو وحی کی جاتی ہے اس میں مجھ پر ایمان نہ لانے والوں کو عذاب دینے میں کسی چیز کا معاملہ میرے سپرد نہیں کیا جاتا، بلکہ (میں نہیں ہوں مگر ڈرانے والا) اس کی طرف سے (بالکل واضح) جو اپنے ڈرانے کو قطعی دلائل کے ساتھ واضح کرکے بیان کرنے والا ہوں۔‘‘"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {قُلْ اَرَءَيْتُمْ اِنْ كَانَ مِنْ عِنْدِ اللّٰهِ …:’’ اَرَءَيْتُمْ ‘‘} کا لفظی معنی ہے ’’کیا تم نے دیکھا۔‘‘ اہلِ عرب اسے {’’ أَخْبِرُوْنِيْ‘‘} (مجھے بتاؤ) کے معنی میں استعمال کرتے ہیں۔ یعنی کیا تم نے دیکھا؟ اگر دیکھا ہے تو مجھے بتاؤ۔ {’’ وَ شَهِدَ شَاهِدٌ مِّنْۢ بَنِيْۤ اِسْرَآءِيْلَ عَلٰى مِثْلِهٖ ‘‘} میں ’’اس جیسے کی شہادت‘‘ سے مراد یہ ہے کہ اگر بنی اسرائیل میں سے ایک شہادت دینے والے نے اس کی شہادت دی ہو۔ کیونکہ بعض اوقات کسی چیز کی مثل سے مراد خود وہ چیز ہوتی ہے، جیسے کہتے ہیں : {’’مِثْلُكَ لَا يَفْعَلُ هٰذَا‘‘} ’’تیرے جیسا یہ کام نہیں کرتا‘‘ یعنی تو یہ کام نہیں کرتا۔ اس لیے آگے {’’ فَاٰمَنَ وَ اسْتَكْبَرْتُمْ ‘‘} کا مطلب یہ نہیں کہ وہ اس جیسے پر ایمان لایا، بلکہ اس کا مطلب ہے ’’پھر وہ اس پر ایمان لے آیا اور تم نے تکبر کیا۔‘‘ لفظ {’’مِثْلٌ‘‘} کو خود کسی کی ذات کے لیے استعمال کرنے کی ایک مثال ایک تفسیر کے مطابق اللہ تعالیٰ کا یہ فرمان ہے : «اَوَ مَنْ كَانَ مَيْتًا فَاَحْيَيْنٰهُ وَ جَعَلْنَا لَهٗ نُوْرًا يَّمْشِيْ بِهٖ فِي النَّاسِ كَمَنْ مَّثَلُهٗ فِي الظُّلُمٰتِ لَيْسَ بِخَارِجٍ مِّنْهَا» [ الأنعام : ۱۲۲ ] {’’ أَيْ كَمَنْ هُوَ ({نَفْسُهُ}) فِي الظُّلُمَاتِ ‘‘} یہاں ’’اس شخص کی طرح ہے جس کی مثل اندھیروں میں ہے‘‘ سے مراد ہے ’’اس شخص کی طرح ہے جو (خود) اندھیروں میں ہے۔‘‘ اسی طرح : « فَاِنْ اٰمَنُوْا بِمِثْلِ مَاۤ اٰمَنْتُمْ بِهٖ فَقَدِ اهْتَدَوْا » [ البقرۃ : ۱۳۷ ] (پس اگر وہ اس جیسی چیز پر ایمان لائیں جس پر تم ایمان لائے ہو تو یقینا وہ ہدایت پا گئے) سے مراد یہ ہے کہ ’’اگر وہ اس چیز پر ایمان لے آئیں جس پر تم ایمان لائے ہو…۔‘‘ (اضواء البیان) مزید تفصیل کے لیے دیکھیے سورۂ شوریٰ کی آیت (۱۱) : «لَيْسَ كَمِثْلِهٖ شَيْءٌ » کی تفسیر۔ ¤ اس آیت میں {’’ اِنْ كَانَ مِنْ عِنْدِ اللّٰهِ ‘‘} سے لے کر {’’ وَ اسْتَكْبَرْتُمْ ‘‘} تک شرط ہے، جس کی جزا محذوف ہے اور وہ بعد والے جملے {’’ اِنَّ اللّٰهَ لَا يَهْدِي الْقَوْمَ الظّٰلِمِيْنَ ‘‘} سے ظاہر ہو رہی ہے : {’’أَيْ فَمَنْ أَظْلَمُ مِنْكُمْ‘‘} ’’تو تم سے بڑھ کر ظالم کون ہے۔‘‘ اس کی تائید سورۂ حم السجدۃ (۵۲) سے بھی ہوتی ہے۔ ¤ قرآن کو جھٹلانے کے لیے کفار کے مختلف اعتراضات اور ان کے جوابات ذکر کرنے کے بعد اب انھیں اس پر ایمان نہ لانے کے انجامِ بد سے ڈرایا جا رہا ہے کہ یہ بتاؤ کہ اگر یہ کتاب اللہ تعالیٰ کی طرف سے ہو اور تم اس کا انکار کرو، حالانکہ بنی اسرائیل میں سے ایک شہادت دینے والا بھی اس کے حق ہونے کی شہادت دے چکا ہو، پھر وہ خود بھی اس پر ایمان لے آیا ہو مگر (تم یہ جان لینے کے باوجود کہ یہ حق ہے) محض تکبر اور جھوٹی بڑائی قائم رکھنے کے لیے اسے ماننے سے انکار کر دو (تو یقینا تم ظالم ہو گے اور اللہ تعالیٰ تمھیں ہدایت کی توفیق نہیں دے گا) کیونکہ جو لوگ تکبر کرتے ہوئے حق سے انکار کر دیں ایسے ظالموں کو اللہ تعالیٰ بھی سیدھے راستے پر چلنے کی توفیق نہیں دیتا۔ ¤ ➋ اس آیت میں {’’ شَهِدَ شَاهِدٌ مِّنْۢ بَنِيْۤ اِسْرَآءِيْلَ ‘‘} سے کون مراد ہے؟ مفسرین کے اس کے متعلق مختلف اقوال ہیں۔ سب سے مشہور قول یہ ہے کہ اس سے مراد عبد اللہ بن سلام رضی اللہ عنہ ہیں۔ اس کی دلیل سعد بن ابی وقاص رضی اللہ عنہ کی حدیث ہے، وہ فرماتے ہیں : [ مَا سَمِعْتُ النَّبِيَّ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ يَقُوْلُ لِأَحَدٍ يَمدٍ يَمْشِيْ عَلَی الْأَرْضِ إِنَّهُ مِنْ أَهْلِ الْجَنَّةِ إِلَّا لِعَبْدِ اللّٰهِ بْنِ سَلَامٍ قَالَ وَ فِيْهِ نَزَلَتْ هٰذِهِ الْآيَةُ : « وَ شَهِدَ شَاهِدٌ مِّنْۢ بَنِيْۤ اِسْرَآءِيْلَ عَلٰى مِثْلِهٖ» ] [ بخاري، مناقب الأنصار، مناقب عبد اللّٰہ بن سلام رضی اللہ عنہ : ۳۸۱۲ ] ’’میں نے نبی صلی اللہ علیہ وسلم کو عبد اللہ بن سلام رضی اللہ عنہ کے سوا کسی ایسے شخص کے بارے میں جو زمین پر چل پھر رہا ہو یہ کہتے ہوئے نہیں سنا کہ وہ جنتیوں میں سے ہے۔‘‘ سعد رضی اللہ عنہ نے فرمایا کہ انھی کے بارے میں یہ آیت اتری : « وَ شَهِدَ شَاهِدٌ مِّنْۢ بَنِيْۤ اِسْرَآءِيْلَ عَلٰى مِثْلِهٖ» [ الأحقاف : ۱۱ ] ’’اور بنی اسرائیل میں سے ایک شہادت دینے والے نے اس جیسے (قرآن) کی شہادت دی۔‘‘ مگر اس میں یہ اشکال ہے کہ یہ سورت مکی ہے جب کہ عبد اللہ بن سلام رضی اللہ عنہ مدینہ میں مسلمان ہوئے۔ جو حضرات اس ’’شاہد‘‘ سے مراد عبد اللہ بن سلام رضی اللہ عنہ لیتے ہیں وہ اس کا حل یہ بتاتے ہیں کہ بے شک سورت مکی ہے مگر یہ آیت مدنی ہو سکتی ہے، یا ہو سکتا ہے کہ مکہ میں پہلے ہی بنی اسرائیل میں سے عبد اللہ بن سلام رضی اللہ عنہ کے ایمان لانے کا پیش گوئی کے طور پر ذکر کر دیا گیا ہو۔ مگر زیادہ قرین قیاس بات یہ معلوم ہوتی ہے کہ سعد رضی اللہ عنہ کے قول کا مطلب یہ ہے کہ عبد اللہ بن سلام رضی اللہ عنہ بھی ان لوگوں میں شامل ہیں جنھوں نے بنی اسرائیل میں سے رسول اللہ صلی اللہ علیہ وسلم کے حق ہونے کی شہادت دی اور آپ پر ایمان لائے۔ کیونکہ اصولِ تفسیر میں یہ بات طے ہے کہ بعض اوقات صحابہ کرام رضی اللہ عنھم یہ فرماتے ہیں کہ یہ آیت فلاں مسئلے یا فلاں شخص کے بارے میں اتری، حالانکہ ان کا مقصد یہ ہوتا ہے کہ وہ آیت اس شخص یا اس مسئلے پر منطبق ہوتی اور صادق آتی ہے۔ ¤ دوسرا اور تیسرا قول یہ ہے کہ اس سے مراد موسیٰ علیہ السلام یا بقول بعض عیسیٰ علیہ السلام ہیں، کیونکہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے حق ہونے کی شہادت تورات اور انجیل میں دی۔ خصوصاً عیسیٰ علیہ السلام نے آپ صلی اللہ علیہ وسلم کا نام لے کر آپ کی آمد کی بشارت دی اور آپ پر ایمان لانے سے مراد یہ ہے کہ انھوں نے آپ کی تصدیق کی، فرمایا : « وَ اِذْ قَالَ عِيْسَى ابْنُ مَرْيَمَ يٰبَنِيْۤ اِسْرَآءِيْلَ اِنِّيْ رَسُوْلُ اللّٰهِ اِلَيْكُمْ  مُّصَدِّقًا لِّمَا بَيْنَ يَدَيَّ مِنَ التَّوْرٰىةِ وَ مُبَشِّرًۢا بِرَسُوْلٍ يَّاْتِيْ مِنْۢ بَعْدِي اسْمُهٗۤ اَحْمَدُ » [الصف : ۶ ] ’’اور جب عیسیٰ ابن مریم نے کہا اے بنی اسرائیل! بلاشبہ میں تمھاری طرف اللہ کا رسول ہوں، اس کی تصدیق کرنے والا ہوں جو مجھ سے پہلے تورات کی صورت میں ہے اور ایک رسول کی بشارت دینے والا ہوں،جو میرے بعد آئے گا،اس کا نام احمد ہے۔‘‘ تورات و انجیل میں تحریف کے باوجود اب بھی ان میں ایسی آیات موجود ہیں جن میں رسول اللہ صلی اللہ علیہ وسلم کی آمد کی بشارت دی گئی ہے اور آپ کی تصدیق کی گئی ہے۔ مزید دیکھیے سورۂ صف (۶) اور سورۂ اعراف (۱۵۷) کی تفسیر۔ ¤ چوتھا قول جو زیادہ قوی معلوم ہوتا ہے، یہ ہے کہ مشرکینِ مکہ کا تجارت کے سلسلے میں مدینہ، خیبر اور شام میں آنا جانا عام تھا جس کا اللہ تعالیٰ نے سورۂ قریش میں بھی ذکر فرمایا ہے۔ ان سفروں میں ان کی ملاقات اہلِ کتاب یہود و نصاریٰ سے بھی ہوتی تھی اور وہ ان سے نبی صلی اللہ علیہ وسلم کے متعلق پوچھتے تھے اور ان میں سے منصف لوگ حق بات کی شہادت سے گریز نہیں کرتے تھے۔ اس لیے اللہ تعالیٰ نے قرآن مجید میں متعدد مقامات پر مکی سورتوں میں بھی اس بات کا ذکر فرمایا ہے کہ اہلِ کتاب کے اہلِ علم بھی اس پیغمبر صلی اللہ علیہ وسلم اور اس کتاب کی تصدیق کرتے اور اس پر ایمان لاتے ہیں، اس لیے {’’ وَ شَهِدَ شَاهِدٌ مِّنْۢ بَنِيْۤ اِسْرَآءِيْلَ ‘‘} میں لفظ {’’ شَاهِدٌ ‘‘} جیسا کہ حافظ ابن کثیر رحمہ اللہ نے فرمایا اسم جنس ہے اور اس سے مراد ان تمام لوگوں میں سے کوئی بھی شخص ہو سکتا ہے جس نے آپ صلی اللہ علیہ وسلم کے مکہ میں موجود ہونے کے وقت آپ کے سچا نبی ہونے کی شہادت دی، جیسا کہ نجاشی رضی اللہ عنہ کا آپ پر ایمان لانا اور آپ کے حق ہونے کی شہادت دینا سب کو معلوم ہے، اگرچہ مدینہ میں ایمان لانے والے اسرائیلی صحابہ بھی اس سے باہر نہیں ہیں۔ اب مکی سورتوں کی وہ آیات ملاحظہ فرمائیں جن میں اہلِ کتاب کی شہادت کو بطور تائید ذکر کیا گیا ہے : « قُلْ كَفٰى بِاللّٰهِ شَهِيْدًۢا بَيْنِيْ وَ بَيْنَكُمْ وَ مَنْ عِنْدَهٗ عِلْمُ الْكِتٰبِ» [ الرعد : ۴۳ ] ’’کہہ دے میرے درمیان اور تمھارے درمیان اللہ کافی گواہ ہے اور وہ شخص بھی جس کے پاس کتاب کا علم ہے۔‘‘ اور فرمایا : «اِنَّ الَّذِيْنَ اُوْتُوا الْعِلْمَ مِنْ قَبْلِهٖۤ اِذَا يُتْلٰى عَلَيْهِمْ يَخِرُّوْنَ لِلْاَذْقَانِ سُجَّدًا (107) وَّ يَقُوْلُوْنَ سُبْحٰنَ رَبِّنَاۤ اِنْ كَانَ وَعْدُ رَبِّنَا لَمَفْعُوْلًا » [ بني إسرائیل : ۱۰۷، ۱۰۸ ] ’’بے شک جن لوگوں کو اس سے پہلے علم دیا گیا، جب ان کے سامنے اسے پڑھا جاتا ہے وہ ٹھوڑیوں کے بل سجدہ کرتے ہوئے گر جاتے ہیں۔ اور کہتے ہیں ہمارا رب پاک ہے، بے شک ہمارے رب کا وعدہ یقینا ہمیشہ پورا کیا ہوا ہے۔‘‘ اور فرمایا : « وَ اِذَا يُتْلٰى عَلَيْهِمْ قَالُوْۤا اٰمَنَّا بِهٖۤ اِنَّهُ الْحَقُّ مِنْ رَّبِّنَاۤ اِنَّا كُنَّا مِنْ قَبْلِهٖ مُسْلِمِيْنَ » [ القصص : ۵۳ ] ’’اور جب ان کے سامنے اس کی تلاوت کی جاتی ہے تو کہتے ہیں ہم اس پر ایمان لائے، یقینا یہی ہمارے رب کی طرف سے حق ہے، بے شک ہم اس سے پہلے فرماں بردار تھے۔‘‘ اور فرمایا : « اَوَ لَمْ يَكُنْ لَّهُمْ اٰيَةً اَنْ يَّعْلَمَهٗ عُلَمٰٓؤُا بَنِيْۤ اِسْرَآءِيْلَ» [ الشعراء : ۱۹۷ ] ’’اور کیا ان کے لیے یہ ایک نشانی نہ تھی کہ اسے بنی اسرائیل کے علماء جانتے ہیں۔‘‘"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {وَ قَالَ الَّذِيْنَ كَفَرُوْا لِلَّذِيْنَ اٰمَنُوْا لَوْ كَانَ خَيْرًا … : ’’ لِلَّذِذِيْنَ اٰمَنُوْا ‘‘} میں ’’لام‘‘ کا مطلب یہ نہیں کہ ان سے مخاطب ہو کر کہا، بلکہ یہ ہے کہ ان کے بارے میں کہا۔ پچھلی آیت میں مشرکین کے ایمان نہ لانے کا باعث ان کا تکبر ذکر فرمایا تھا، اب ان کے تکبر اور خود پسندی کی ایک مثال ذکر فرمائی جس کی بنا پر وہ ایمان کی نعمت سے محروم رہے کہ وہ اللہ تعالیٰ کی دی ہوئی دنیا کی نعمتوں پر اس قدر مغرور ہیں کہ اس کی ہر نعمت کا مستحق صرف اپنے آپ ہی کو سمجھتے ہیں۔ بلال، عمار، عبد اللہ بن مسعود، سمیہ اور زنیرہ رضی اللہ عنھم جیسے مسکین اور ضعیف مسلمانوں کو وہ اللہ تعالیٰ کے کسی انعام کے قابل ہی نہیں سمجھتے تھے، اس لیے انھوں نے اسلام کے ہر خیر سے خالی ہونے کی دلیل یہ تصنیف کی کہ اگر اسلام میں کوئی خوبی ہوتی تو یہ لوگ ہم سے پہلے اس کی طرف نہ آتے۔ رسول اللہ صلی اللہ علیہ وسلم نے تکبر کی تعریف ان الفاظ میں فرمائی : [ اَلْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ ] [ مسلم، الإیمان، باب تحریم الکبر و بیانہ : ۹۱ ]’’تکبر حق کے انکار اور لوگوں کو حقیر جاننے کا نام ہے۔‘‘ مشرکین مسلمانوں کو کس قدر حقیر جانتے تھے، اس کا اندازہ اس آیت سے بھی ہوتا ہے : « وَ كَذٰلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِّيَقُوْلُوْۤا اَهٰۤؤُلَآءِ مَنَّ اللّٰهُ عَلَيْهِمْ مِّنْۢ بَيْيْنِنَا» [ الأنعام : ۵۳ ] ’’اور اسی طرح ہم نے ان میں سے بعض کی بعض کے ساتھ آزمائش کی ہے، تاکہ وہ کہیں کیا یہی لوگ ہیں جن پر اللہ نے ہمارے درمیان میں سے احسان فرمایا ہے؟‘‘ نوح علیہ السلام کی قوم کے سرداروں کا اندازِ تحقیر ملاحظہ فرمائیں، انھوں نے نوح علیہ السلام سے کہا : « مَا نَرٰىكَ اِلَّا بَشَرًا مِّثْلَنَا وَ مَا نَرٰىكَ اتَّبَعَكَ اِلَّا الَّذِيْنَ هُمْ اَرَاذِلُنَا بَادِيَ الرَّاْيِ وَ مَا نَرٰى لَكُمْ عَلَيْنَا مِنْ فَضْلٍۭ بَلْ نَظُنُّكُمْ كٰذِبِيْنَ» [ ھود : ۲۷ ] ’’ہم تجھے نہیں دیکھتے مگر اپنے جیسا ایک بشر اور ہم تجھے نہیں دیکھتے کہ ان لوگوں کے سوا کسی نے تیری پیروی کی ہو جو ہمارے سب سے رذیل ہیں، سطحی رائے کے ساتھ اور ہم تمھارے لیے اپنے آپ پر کوئی برتری نہیں دیکھتے، بلکہ ہم تمھیں جھوٹے گمان کرتے ہیں۔‘‘ ¤ ➋ { وَ اِذْ لَمْ يَهْتَدُوْا بِهٖ فَسَيَقُوْلُوْنَ…:} کفار کے جن اقوال کا یہاں ذکر ہوا ان سب کا مقصد رسول اللہ صلی اللہ علیہ وسلم اور قرآن کو جھٹلانا تھا، مثلاً یہ کہنا کہ یہ سحر ہے، افترا ہے، اس میں کوئی خیر نہیں وغیرہ۔ فرمایا جب وہ اس قرآنن کے ذریعے سے سیدھا راستہ حاصل نہ کر سکے تو وہ یہی کہتے رہیں گے کہ یہ قدیم جھوٹ ہے۔ یعنی اگر وہ ضد اور عناد پر اڑے رہے تو کسی صورت ایمان نہیں لائیں گے اور نہ کوئی عقلی یا نقلی دلیل تسلیم کریں گے، بلکہ ان کے سامنے پہلے انبیاء اور اہلِ علم کی شہادت پیش کی گئی تو وہ تمام پیغمبروں اور کتابوں کو بھی یہ کہہ کر رد کر دیں گے کہ یہ قدیم جھوٹ ہے جو پہلے سے چلا آ رہا ہے۔ ان کے اس رویے کا باعث صرف ان کا کفر اور تکبر ہے، جب تک وہ اس پر قائم رہیں گے یہی بات کہتے رہیں گے، جیسا کہ فرمایا : «وَ قَالَ الَّذِيْنَ كَفَرُوْۤا اِنْ هٰذَاۤ اِلَّاۤ اِفْكٌ افْتَرٰىهُ وَ اَعَانَهٗ عَلَيْهِ قَوْمٌ اٰخَرُوْنَ فَقَدْ جَآءُوْ ظُلْمًا وَّ زُوْرًا (4) وَ قَالُوْۤا اَسَاطِيْرُ الْاَوَّلِيْنَ اكْتَتَبَهَا فَهِيَ تُمْلٰى عَلَيْهِ بُكْرَةً وَّ اَصِيْلًا» [ الفرقان : ۴، ۵ ] ’’اور ان لوگوں نے کہا جنھوں نے کفر کیا، یہ نہیں ہے مگر ایک جھوٹ، جو اس نے گھڑ لیا اور کچھ دوسرے لوگوں نے اس پر اس کی مدد کی، سو بلاشبہ وہ بھاری ظلم اور سخت جھوٹ پر اتر آئے ہیں۔ اور انھوں نے کہا یہ پہلے لوگوں کی کہانیاں ہیں، جو اس نے لکھوا لی ہیں، تو وہ پہلے اور پچھلے پہر اس پر پڑھی جاتی ہیں۔‘‘"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {وَ مِنْ قَبْلِهٖ كِتٰبُ مُوْسٰۤى اِمَامًا وَّ رَحْمَةً: ’’ كِتٰبُ مُوْسٰۤى ‘‘} کا عطف {’’ شَاهِدٌ ‘‘} پر ہے اور {’’ قَبْلِهٖ ‘‘} کی ضمیر اس {’’ شَاهِدٌ ‘‘} کی طرف جا رہی ہے : {’’أَيْ شَهِدَ شَاهِدٌ مِنْ بَنِيْ إِسْرَائِيْلَ عَلٰي مِثْلِهِ وَ شَهِدَ مِنْ قَبْلِهِ كِتَابُ مُوْسٰي عَلٰي مِثْلِهِ‘‘} یعنی بنی اسرائیل کے ایک شہادت دینے والے نے اس کی شہادت دی اور اس سے پہلے موسیٰ علیہ السلام کی کتاب نے بھی اس کے حق ہونے کی شہادت دی جو لوگوں کی پیشوائی کرنے والی تھی۔ لوگ اس کی پیروی اور اس کے احکام پر عمل کرتے تھے (دیکھیے مائدہ : ۴۴) اور وہ لوگوں کے لیے سراسر رحمت تھی۔ ¤ ➋ اکثر مفسرین نے {’’ قَبْلِهٖ ‘‘} کی ضمیر کا مرجع قرآن کو قرار دیا ہے، یعنی اس قرآن سے پہلے موسیٰ علیہ السلام کی کتاب پیشوا اور رحمت تھی، لیکن مجھے وہ ترکیب بہتر معلوم ہوتی ہے جو اوپر ذکر ہوئی۔ ¤ ➌ { وَ هٰذَا كِتٰبٌ مُّصَدِّقٌ لِّسَانًا عَرَبِيًّا:} اور یہ کتاب یعنی قرآن موسیٰ علیہ السلام کی کتاب کی تصدیق کرتی ہے، یعنی یہ عین ان پیش گوئیوں کے مطابق ہے جو تورات میں کی گئی تھیں، جس سے اس کی تصدیق ہوتی ہے اور دونوں کی بنیادی تعلیم بھی ایک ہے۔ حالانکہ وہ عبرانی زبان میں تھی اور یہ عربی زبان میں ہے اور ایسے شخص پر نازل ہوئی جو عبرانی جانتا ہی نہیں بلکہ اُمی ہے، عربی بھی نہیں پڑھ سکتا۔ یہ دلیل ہے کہ دونوں اللہ تعالیٰ کی نازل کردہ ہیں جو تمام زبانیں پیدا کرنے والا اور ہر چیز کا علم رکھنے والا ہے۔ ¤ ➍ {لِّيُنْذِرَ الَّذِيْنَ ظَلَمُوْا …:} تاکہ یہ ان لوگوں کو ان کے برے انجام سے ڈرائے جنھوں نے کفر و شرک کا ارتکاب کرکے اپنی جانوں پر ظلم ڈھایا ہے اور نیک عمل کرنے والوں کے لیے عظیم خوش خبری ہو۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 14،13) { اِنَّ الَّذِيْنَ قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْتَقَامُوْا …:} ان آیات کی تفسیر کے لیے دیکھیے سورۂ حم سجدہ (۳۰ ، ۳۱) کی تفسیر۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14،13) { اِنَّ الَّذِيْنَ قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْتَقَامُوْا …:} ان آیات کی تفسیر کے لیے دیکھیے سورۂ حم سجدہ (۳۰ ، ۳۱) کی تفسیر۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { وَ وَصَّيْنَا الْاِنْسَانَ بِوَالِدَيْهِ اِحْسٰنًا:} سورت کے شروع سے یہاں تک اللہ تعالیٰ کی توحید، اس کی نازل کردہ کتاب کے حق ہونے اور اس کی عبادت پر استقامت کا بیان فرمایا، اب ماں باپ کے ساتھ حسنِ سلوک کی تاکید کا بیان ہے۔ قرآن مجید میں متعدد مقامات پر اللہ تعالیٰ کے حق توحید اور اخلاصِ عبادت کے ساتھ ماں باپ کے حق کا ذکر فرمایا ہے۔ اس جملے کی تفسیر کے لیے دیکھیے سورۂ بقرہ (۸۳)، بنی اسرائیل (۲۳، ۲۴)، عنکبوت (۸) اور سورۂ لقمان (۱۴، ۱۵)۔ ¤ ➋ { حَمَلَتْهُ اُمُّهٗ كُرْهًا وَّ وَضَعَتْهُ كُرْهًا: ’’كَرِهَ يَكْرَهُ كَرْهًا وَ كُرْهًا وَ كَرَاهَةً وَ كَرَاهِيَةً‘‘} (ع) {’’ اَلشَّيْءَ‘‘ } یہ {’’أَحَبَّ الشَّيْءَ‘‘} کی ضد ہے، ناپسند کرنا۔ {’’اَلْكَرْهُ ‘‘} اور {’’اَلْكُرْهُ ‘‘} کا معنی انکار اور مشقت بھی ہے۔ {’’ كُرْهًا ‘‘} حال ہے : {’’أَيْ حَمَلَتْهُ أُمُّهُ ذَاتَ كُرْهٍ‘‘} یعنی اس کی ماں نے اسے اس حالت میں اٹھائے  رکھا کہ وہ ناگواری یا مشقت والی تھی۔ یا اس سے پہلے حرف جار باء محذوف ہے، جس کے حذف کرنے سے اس پر نصب آیا ہے : {’’أَيْ حَمَلَتْهُ أُمُّهُ بِكُرْهٍ‘‘} یعنی اس کی ماں نے اسے ناگواری یا مشقت کے ساتھ اٹھایا، {’’ وَ وَضَعَتْهُ كُرْهًا ‘‘} اور اسے ناگواری اور مشقت کے ساتھ جنا۔ ¤ ➌ آیت میں اگرچہ ماں اور باپ دونوں کے ساتھ احسان کی تاکید کی گئی ہے، مگر ماں کی تین قربانیوں کا ذکر خاص طور پر کیا گیا ہے۔ پہلی یہ کہ وہ حمل کی پوری مدت اسے اپنے پیٹ میں اٹھائے پھرتی ہے، اس دوران اس پر کئی ناگوار حالتیں گزرتی ہیں، مثلاً متلی، بے چینی، تھکاوٹ، بیماری کی سی حالت، دن بدن بڑھتی ہوئی کمزوری، جس کے متعلق اللہ تعالیٰ نے دوسری جگہ فرمایا : «حَمَلَتْهُ اُمُّهٗ وَهْنًا عَلٰى وَهْنٍ » [ لقمان : ۱۴ ] ’’اس کی ماں نے اسے کمزوری پر کمزوری کی حالت میں اٹھائے رکھا۔‘‘ خصوصاً حمل کے آخری ایام میں تو یہ بوجھ اس کی جان کا روگ بنا ہوتا ہے۔ حقیقت ہے کہ کوئی شخص اگر اپنی ماں کا حق ادا کرنے کے لیے اسے کمزوری کی حالت میں اٹھا کر لیے پھرے تب بھی وہ اس کا حق ادا نہیں کر سکتا۔ کہاں پوری مدتِ حمل مسلسل اپنے شکم میں اٹھائے پھرنا اور کہاں کسی وقت کچھ دیر کے لیے اٹھا لینا۔ پھر ماں ان سب ناگوار کیفیتوں کو آنے والے فرزند کی امید پر خوشی سے برداشت کرتی ہے، جب کہ اولاد اسے بوجھ سمجھ کر یا صرف اللہ کا حکم سمجھ کر اٹھاتی ہے، دونوں میں کوئی نسبت ہی نہیں۔ دوسری قربانی وضع حمل کا نہایت تکلیف دہ مرحلہ ہے جس میں اس کی جان داؤ پر لگی ہوتی ہے، کتنی مائیں اس مرحلے میں جان سے گزر جاتی ہیں، وہ اپنے فرزند کی امید پر اس ناگوار مرحلے کو بھی برداشت کرتی ہے۔ تیسری قربانی دو سال تک اس کی پرورش، اپنے آرام کی قربانی دے کر اس کے لیے ہر آسائش مہیا کرنا اور اپنا خون دودھ کی صورت میں دو سال تک پلاتے جانا ہے۔ ان تین قربانیوں کی وجہ سے اللہ تعالیٰ نے ماں کا حق باپ سے تین گنا زیادہ رکھا ہے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، کہنے لگا : [ يَا رَسُوْلَ اللّٰهِ! مَنْ أَحَقُّ النَّاسِ بِحُسْنِ صَحَابَتِيْ؟ قَالَ أُمُّكَ، قَالَ ثُمَّ مَنْ؟ قَالَ ثُمَّ أُمُّكَ، قَالَ ثُمَّ مَنْ؟ قَالَ ثُمَّ أُمُّكَ، قَالَ ثُمَّ مَنْ؟ قَالَ ثُمَّ أَبُوْكَ ] [ بخاري، الأدب، باب من أحق الناس بحسن الصحبۃ : ۵۹۷۱ ] ’’یا رسول اللہ! لوگوں میں سے میرے حسن محبت کا زیادہ حق دار کون ہے ؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تمھاری ماں۔‘‘ اس نے کہا : ’’پھر کون؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’پھر تمھاری ماں۔‘‘ اس نے کہا : ’’ پھر کون؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’پھر تمھاری ماں۔‘‘ اس نے کہا : ’’پھر کون؟‘‘ آپ صلی اللہ علیہ وسلم نے (چوتھی مرتبہ) فرمایا : ’’ پھر تمھارا باپ۔‘‘ ¤ ➍ {وَ حَمْلُهٗ وَ فِصٰلُهٗ ثَلٰثُوْنَ شَهْرًا:} اس آیت کو اور سورۂ لقمان کی آیت (۱۴) : « وَ فِصٰلُهٗ فِيْ عَامَيْنِ» (اور اس کا دودھ چھڑانا دو سال میں ہے) اور سورۂ بقرہ کی آیت (۲۳۳) : « وَ الْوَالِدٰتُ يُرْضِعْنَ اَوْلَادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ لِمَنْ اَرَادَ اَنْ يُّتِممَّ الرَّضَاعَةَ » (اور مائیں اپنے بچوں کو پورے دو سال دودھ پلائیں، اس کے لیے جو چاہے کہ دودھ کی مدت پوری کرے) ان تینوں آیتوں کو ملانے سے ثابت ہوتا ہے کہ حمل کی کم از کم مدت چھ ماہ ہے، کیونکہ تیس ماہ میں سے دودھ پلانے کی مدت دو سال نکالی جائے تو باقی چھ ماہ بچتے ہیں۔ ابن کثیر نے سورۂ زخرف کی آیت (۸۱) : « قُلْ اِنْ كَانَ لِلرَّحْمٰنِ وَلَدٌ فَاَنَا اَوَّلُ الْعٰبِدِيْنَ» کی تفسیر میں ابن جریر طبری سے نقل فرمایا ہے : [عَنْ بَعْجَةَ  بْنِ زَيْدٍ الْجُهَنِيِّ، أَنَّ امْرَأَةً مِّنْهُمْ دَخَلَتْ عَلٰی زَوْجِهَا، وَ هُوَ رَجُلٌ مِّنْهُمْ أَيْضًا، فَوَلَدَتْ لَهُ فِيْ سِتَّةِ أَشْهُرٍ، فَذَكَرَ ذٰلِكَ زَوْجُهَا لِعُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللّٰهُ عَنْههُ فَأَمَرَ بِهَا أَنْ تُرْجَمَ، فَدَخَلَ عَلَيْهِ عَلِيُّ بْنُ أَبِيْ طَالِبٍ رَضِيَ اللّٰهُ عَنْهُ فَقَالَ إِنَّ اللّٰهَ تَبَارَكَ وَتَعَالٰی يَقُوْلُ فِيْ كِتَابِهِ : «وَ حَمْلُهٗ وَ ف فِصٰلُهٗ ثَلٰثُوْنَ شَهْرًا » وَ قَالَ : « وَ فِصٰلُهٗ فِيْ عَامَيْنِ » قَالَ فَوَاللّٰهِ! مَا عَبِدَ عُثْمَانُ أَنْ بَعَثَ إِلَيْهَا تُرَدَّ ] [الطبري : ۲۰ /۶۵۷، ح : ۳۱۲۷۰ ] ’’بعجہ بن یزید جہنی کہتے ہیں کہ ان کے قبیلے کی ایک عورت اپنے خاوند کے پاس آئی، وہ آدمی بھی اسی قبیلے کا تھا، تو اس عورت نے چھ مہینے میں بچے کو جنم دیا۔ اس کے خاوند نے عثمان بن عفان رضی اللہ عنہ سے اس بات کا ذکر کیا تو انھوں نے اسے رجم کرنے کا حکم دیا۔ اس پر علی بن ابی طالب رضی اللہ عنہ ان کے پاس آئے اور کہا : ’’اللہ تعالیٰ اپنی کتاب میں فرماتے ہیں : « وَ حَمْلُهٗ وَ فِصٰلُهٗ ثَلٰثُوْنَ شَهْرًا » (کہ اس کے حمل اور اس کے دودھ چھڑانے کی مدت تیس ماہ ہے) اور اللہ تعالیٰ فرماتے ہیں : « وَ فِصٰلُهٗ فِيْ عَامَيْنِ » (اور اس کا دودھ چھڑانا دو سال میں ہے)۔‘‘ بعجہ بن یزید کہتے ہیں : ’’تو اللہ کی قسم! عثمان رضی اللہ عنہ نے ان کی بات کا کوئی انکار نہیں کیا اور فوراً آدمی بھیجا کہ اسے واپس لایا جائے۔‘‘ ¤ ابن کثیر کے محقق حکمت بن بشیر نے فرمایا، اس کی سند صحیح ہے۔ یہ استدلال نہایت مضبوط ہے، علی اور عثمان رضی اللہ عنھما کے علاوہ صحابہ کی ایک جماعت نے ان کی موافقت کی ہے۔ (ابن کثیر) ابن عباس رضی اللہ عنھما نے فرمایا : ’’عورت جب نو (۹) ماہ میں بچہ جنے تو اسے اکیس (۲۱) ماہ دودھ پلانا کافی ہے، جب سات (۷) ماہ میں جنے تو اسے تیئیس (۲۳) ماہ دودھ پلانا کافی ہے اور جب چھ (۶) ماہ میں جنے تو پورے دو سال دودھ پلائے، کیونکہ اللہ تعالیٰ نے فرمایا ہے : « وَ حَمْلُهٗ وَ فِصٰلُهٗ ثَلٰثُوْنَ شَهْرًا » ’’اس کے حمل اور دودھ چھڑانے کی مدت تیس ماہ ہے۔‘‘ [ ابن أبي حاتم : ۱۸۵۶۷۔ ابن کثیر وقال المحقق سندہ حسن ] ¤ ➎ { حَتّٰۤى اِذَا بَلَغَ اَشُدَّهٗ وَ بَلَغَ اَرْبَعِيْنَ سَنَةً … :} یہاں سے اللہ تعالیٰ نے والدین کا حق پہچاننے کے اعتبار سے دو قسم کے آدمیوں کا ذکر فرمایا ہے۔ اس آیت میں اس آدمی کا ذکر ہے جو اپنی جوانی کو پہنچتا ہے تو اپنے والدین کا حق پہچانتا ہے اور یہ پہچان اسے اپنے اصل مالک اور مربی کی پہچان اور اس کا شکر ادا کرنے تک پہنچا دیتی ہے۔ {’’ بَلَغَ اَشُدَّهٗ ‘‘} کی تشریح کے لیے دیکھیے سورۂ یوسف (۲۲) کی تفسیر۔ اس سلسلے میں چالیس سال کی عمر کا ذکر بلوغت کی آخری حد کے طور پر فرمایا ہے، کیونکہ اس عمر میں آدمی کی قوتیں اپنے کمال کو پہنچ جاتی ہیں۔ اس کے بعد انحطاط کا عمل شروع ہو جاتا ہے۔ اس آیت میں ہر جوان کو عموماً اور چالیس برس والے آدمی کو خصوصاً خبردار کیا گیا ہے کہ اسے چاہیے کہ اپنی پرورش کرنے والے والدین کا اور اپنے اور اپنے والدین کے اصل مربی اور مالک کا حق پہچانے اور اپنے اور اپنے والدین پر اپنے رب کی نعمتوں کا شکر ادا کرنے کے لیے اس سے توفیق مانگتا رہے، کیونکہ اس کی توفیق کے بغیر کوئی نیکی نہیں ہو سکتی اور ساتھ ہی اپنی اولاد کی اصلاح کی دعا بھی کرتا رہے۔ اس طرح والدین کے حقوق کی پہچان اور ان کی ادائیگی اس کے لیے اپنے رب کے حقوق کی پہچان، اس کی توحید پر استقامت، اس کی عبادت میں اخلاص اور اس کی نعمتوں پر شکر کا ذریعہ بن جائے گی، جو انسان کی زندگی کا اصل مقصود ہے۔ ¤ ➏ { وَ اَنْ اَعْمَلَ صَالِحًا تَرْضٰىهُ:} عمل اگرچہ وہی صالح ہوتا ہے جو اللہ تعالیٰ کو پسند ہو اور اخلاص کے ساتھ ہو، مگر اخلاصِ نیت اور ریا سے پاک ہونے کی اہمیت ظاہر کرنے کے لیے اس کا الگ بھی ذکر فرمایا۔ یعنی مجھے ایسے عمل کی توفیق دے جو ظاہر میں درست یعنی تیری کتاب اور تیرے نبی صلی اللہ علیہ وسلم کی سنت کے مطابق ہو اور حقیقت میں بھی تیری رضا کے مطابق اور تیری جناب میں قبول ہونے کے لائق ہو، یعنی اخلاصِ نیت پر مبنی اور ریا سے پاک ہو۔ ¤ ➐ { وَ اَصْلِحْ لِيْ فِيْ ذُرِّيَّتِيْ:} اس دعا میں دو الفاظ قابل غور ہیں، ایک {’’ لِيْ ‘‘} اور دوسرا{ ’’ فِيْ ‘‘۔ ’’ اَصْلِحْ لِيْ ‘‘} (میرے لیے اصلاح فرما دے) کا مطلب یہ ہے کہ ان کی ایسی اصلاح فرما جس کا فائدہ مجھے بھی حاصل ہو۔ {’’ فِيْ ذُرِّيَّتِيْ ‘‘} یہاں بظاہر {’’أَصْلِحْ لِيْ ذُرِّيَّتِيْ‘‘} (میرے لیے میری اولاد کی اصلاح فرما دے) کافی تھا، جیسا کہ فرمایا : «وَ اَصْلَحْنَا لَهٗ زَوْجَهٗ » [ الأنبیاء : ۹۰ ] ’’اور ہم نے اس کے لیے اس کی بیوی کی اصلاح فرما دی۔‘‘ مگر {’’ فِيْ ‘‘} لانے کا مطلب یہ ہے کہ میری اولاد میں اصلاح کا عمل جاری و ساری فرما دے جو آگے تک چلتا رہے، جیسا کہ ابراہیم علیہ السلام کے متعلق فرمایا : « وَ جَعَلَهَا كَلِمَةًۢ بَاقِيَةً فِيْ عَقِبِهٖ» [ الزخرف : ۲۸ ] ’’اور اس نے اس (توحید کی بات) کو اپنے پچھلوں میں باقی رہنے والی بات بنا دیا۔‘‘ ¤ ➑ { اِنِّيْ تُبْتُ اِلَيْكَ وَ اِنِّيْ مِنَ الْمُسْلِمِيْنَ:} یعنی میں اپنی جوانی کی سرکشی اور جہالت سے اور تیری ہر قسم کی نافرمانی سے باز آ یا اور میں تیرے مکمل فرماں برداروں سے ہوں۔ اس سے معلوم ہوا کہ خصوصی اہتمام کے ساتھ چالیس (۴۰) برس کی عمر میں اور اس کے بعد توبہ کی تجدید کرتے رہنا چاہیے۔ ¤ ➒ یہ دعا اولاد کی اصلاح کے لیے اکسیر ہے۔ اللہ تعالیٰ نے خود اس کی تعلیم دی ہے اور یہ مقبول دعاؤں میں سے ہے، کیونکہ اگلی آیت میں اللہ تعالیٰ نے اس کے قبول ہونے کی بشارت دی ہے، فرمایا : « نَتَقَبَّلُ عَنْهُمْ » ’’ہم ان سے قبول کرتے ہیں۔‘‘ جیسا کہ سورۂ فاتحہ ہے اور سورۂ بقرہ کی آخری آیات والی دعائیں ہیں۔ اس لیے کسی صاحبِ اولاد کو، خصوصاً جو چالیس سال یا اس سے اوپر ہو اسے اس دعا سے غافل نہیں رہنا چاہیے۔ تفسیر قرطبی میں ہے کہ مالک بن مغول نے طلحہ بن مصرف کے پاس اپنے بیٹے کی شکایت کی تو انھوں نے فرمایا : ’’اس کے لیے اس دعا سے مدد حاصل کرو۔‘‘ [ قرطبي : ۱۶ /۱۹۵ ]"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {اُولٰٓىِٕكَ الَّذِيْنَ نَتَقَبَّلُ عَنْهُمْ اَحْسَنَ مَا عَمِلُوْا … :} آیت کے ضمن میں یہ مفہوم موجود ہے کہ ماں باپ کے ساتھ احسان، ان کے لیے دعا، اللہ تعالیٰ سے شکر اور عملِ صالح کی توفیق مانگنا اور اولاد کے لیے اصلاح کی دعا انسان کے سب سے اچھے اعمال میں سے ہے اور اللہ تعالیٰ کا وعدہ ہے کہ جو لوگ یہ عمل کرتے ہیں اللہ تعالیٰ ان کے اس بہترین عمل کو قبول فرمائے گا اور ان کی برائیوں سے درگزر فرمائے گا۔ ¤ ➋ {فِيْۤ اَصْحٰبِ الْجَنَّةِ:} يہ {’’ اُولٰٓىِٕكَ ‘‘} سے حال کی جگہ میں ہے : {’’أَيْ كَائِنِيْنَ فِيْ أَصْحَابِ الْجَنَّةِ‘‘} بہترین اعمال کی قبولیت اور گناہوں سے درگزر کے ساتھ یہ تیسرا انعام ہے کہ انھیں اصحاب الجنہ میں شامل کیا جائے گا جو بہترین ساتھی ہیں۔ کیونکہ ان میں شامل ہونا بجائے خود بہت بڑا اعزاز ہے، جس کی دعا انبیاء علیھم السلام کرتے رہے ہیں، جیسا کہ سلیمان علیہ السلام کی دعا ہے : « وَ اَدْخِلْنِيْ بِرَحْمَتِكَ فِيْ عِبَادِكَ الصّٰلِحِيْنَ» [ النمل : ۱۹ ] ’’اور اپنی رحمت سے مجھے اپنے نیک بندوں میں داخل فرما۔‘‘ یوسف علیہ السلام کی دعا ہے : «تَوَفَّنِيْ مُسْلِمًا وَّ اَلْحِقْنِيْ بِالصّٰلِحِيْنَ » [ یوسف : ۱۰۱ ] ’’مجھے مسلم ہونے کی حالت میں فوت کر اور مجھے نیک لوگوں کے ساتھ ملا دے۔‘‘ اور ہمارے نبی کریم صلی اللہ علیہ وسلم کے آخری وقت کے الفاظ ہیں : [ فِي الرَّفِيْقِ الْأَعْلٰی ] [ بخاري، المغازي، باب مرض النبي صلی اللہ علیہ وسلم و وفاتہ : ۴۴۳۶ ] ’’مجھے بلند ترین ساتھیوں میں شامل فرما۔‘‘ [ اَللّٰھُمَّ اجْعَلْنَا مِنْھُمْ بِفَضْلِکَ وَ رَحْمَتِکَ ] ¤ ➌ { وَعْدَ الصِّدْقِ الَّذِيْ كَانُوْا يُوْعَدُوْنَ:} یعنی اس سچے وعدے کے مطابق جو قرآن و حدیث میں والدین سے احسان کرنے والوں کے ساتھ کیا جاتا تھا اور اللہ تعالیٰ کبھی وعدہ خلافی نہیں کرتا۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {وَ الَّذِيْ قَالَ لِوَالِدَيْهِ اُفٍّ لَّكُمَاۤ: ’’ اُفٍّ ‘‘} کا لفظ اکتاہٹ اور تنگ پڑ جانے کے موقع پر بولا جاتا ہے۔ ¤ پچھلی آیت میں ماں باپ کے ساتھ حسن سلوک کرنے والی سعادت مند مومن اولاد کا اور ان کے حسن انجام کا ذکر تھا، اس آیت میں ان کے مقابلے میں اس بدبخت اور نافرمان اولاد کا اور ان کے برے انجام کا ذکر ہے جس کے والدین مومن ہیں اور وہ اس کوشش میں ہیں کہ ان کی اولاد ایمان لے آئے، مگر ان کی اولاد اس دعوت پر شدید اکتاہٹ کا اظہار کرتے ہوئے انھیں کہتی ہے، تم دونوں کے لیے {’’اُف‘‘} ہے، تم نے مجھے تنگ کر دیا۔ مکہ میں ایسے بہت سے خاندان تھے جن میں والدین ایمان لے آئے تھے مگر اولاد مشرک اور قیامت کی منکر تھی، یا اولاد ایمان لے آئی تھی اور والدین مشرک تھے۔ ¤ ➋ { اَتَعِدٰنِنِيْۤ اَنْ اُخْرَجَ وَ قَدْ خَلَتِ الْقُرُوْنُ مِنْ قَبْلِيْ:} کیا تم مجھے ڈراتے ہو کہ مجھے دوبارہ قبر سے زندہ کرکے نکالا جائے گا جب میں مٹی اور ہڈیوں کی صورت ہو چکا ہوں گا؟ حالانکہ مجھ سے پہلے صدیاں گزر چکیں، آج تک کوئی واپس نہیں آیا۔ یہاں اس بدبخت کی اس بات کا جواب ذکر نہیں فرمایا، کیونکہ قرآن مجید میں بہت سے مقامات پر اس کا جواب آ چکا ہے۔ ¤ ➌ {وَ هُمَا يَسْتَغِيْثٰنِ اللّٰهَ:} اور وہ دونوں اس کی اتنی گستاخانہ اور کفریہ بات کے شر سے پناہ مانگنے کے لیے فریاد کرتے ہیں کہ یا اللہ! ہمیں اس کے شر سے بچا اور اسے ہدایت دے۔ ¤ ➍ { وَيْلَكَ اٰمِنْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ:’’ وَيْلَكَ ‘‘} کا لفظ اگرچہ بددعا ہے، مگر بعض دفعہ اسے نہایت محبت و شفقت اور دردمندی کے اظہار کے لیے بولا جاتا ہے، جیسے {’’ ثَكِلَتْكَ الثَّوَاكِلُ‘‘} (تجھے گم کرنے والیاں گم پائیں)۔ یعنی ماں باپ اسے سمجھاتے ہوئے کہتے ہیں، تیرا ستیا ناس ہو، ایمان لے آ اور آخرت کا انکار نہ کر، کیونکہ اللہ کا وعدہ سچا ہے، مگر وہ نہایت نفرت کے ساتھ انھیں جھڑک دیتا ہے۔ ¤ ➎ { فَيَقُوْلُ مَا هٰذَاۤ اِلَّاۤ اَسَاطِيْرُ الْاَوَّلِيْنَ:} اس کی تفصیل کے  لیے دیکھیے سورۂ انفال (۳۱)، مومنون (۸۳) اور نمل (۶۸)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { اُولٰٓىِٕكَ الَّذِيْنَ حَقَّ عَلَيْهِمُ الْقَوْلُ:} یعنی والدین کے گستاخ اور آخرت کے منکر ہی وہ لوگ ہیں جن پر اللہ تعالیٰ کی بات ثابت ہو چکی، جو اس نے پہلے فرما دی تھی : « لَاَمْلَـَٔنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَ النَّاسِ اَجْمَعِيْنَ » [ ھود:۱۱۹] ’’کہ میں جہنم کو جنوں اور انسانوں سب سے ضرور ہی بھروں گا۔‘‘ مزید دیکھیے سورۂ اعراف (۱۸)۔ ¤ ➋ { فِيْۤ اُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِّنَ الْجِنِّ وَ الْاِنْسِ:} یعنی جنوں اور انسانوں کے ان گروہوں میں شامل ہو کر جو اہلِ جہنم میں سے ان سے پہلے گزرے۔ ان بدترین لوگوں کا ساتھ خود بدترین سزا ہے۔ ¤ ➌ { اِنَّهُمْ كَانُوْا خٰسِرِيْنَ: ’’إِنَّ‘‘} تعلیل کے لیے ہے، یعنی ان کا یہ انجام اس لیے ہوا کہ انھیں جو سرمایۂ حیات دنیا میں آخرت کی تیاری کے لیے دیا گیا تھا انھوں نے اس سے نفع حاصل کرنے کے بجائے اصل راس المال بھی گنوا دیا اور یہی حقیقی خسارہ ہے جو انھوں نے اٹھایا۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) {وَ لِكُلٍّ دَرَجٰتٌ مِّمَّا عَمِلُوْا … :} اس آیت سے پہلے مضمون کی تاکید مقصود ہے، یعنی ہر ایک کو، وہ مومن ہو یا کافر، اس کے اعمال کے مطابق جزا یا سزا ملے گی۔ یہ نہیں ہو گا کہ بروں پر ایسے گناہ لاد دیے جائیں جو انھوں نے نہ کیے ہوں، یا نیکوں کو ان کی نیکی سے محروم کر دیا جائے۔ واضح رہے یہاں مومن و کافر سب کے لیے {’’ دَرَجٰتٌ ‘‘} کا لفظ تغلیباً استعمال ہوا ہے، ورنہ تو اصل میں منازلِ جنت کو ’’درجات‘‘ اور منازلِ جہنم کو ’’درکات‘‘ کہا جاتا ہے، جس طرح منافقوں کے بارے میں {’’ فِي الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِ ‘‘} آیا ہے۔ (روح المعانی)"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ {وَ يَوْمَ يُعْرَضُ الَّذِيْنَ كَفَرُوْا عَلَى النَّارِ:} پچھلی آیات سے اس کا ربط دو طرح سے ہے، ایک یہ کہ والدین سے بدسلوکی کرنے والے قیامت کے منکر کے انجام کے ذکر کے بعد تمام کفار کا انجام بیان فرمایا۔ دوسرا یہ کہ پچھلی آیت میں ذکر ہوا کہ مومن ہوں یا کافر سب کو ان کے اعمال کے مطابق جزا ملے گی اور کسی پر ظلم نہیں کیا جائے گا، تو اب اس سوال کا جواب دیا کہ کفار دنیا میں جو نیکیاں کرتے رہے ان کا کیا بنے گا؟ کم از کم ان کا بدلا تو ضرور ملنا چاہیے، اگر انھیں ان کی جزا نہ دی گئی تو یہ ظلم ہے۔ فرمایا اس وقت کو یاد کرو جب وہ لوگ جنھوں نے حق قبول کرنے سے انکار کیا، آگ پر پیش کیے جائیں گے۔ ¤ ➋ { اَذْهَبْتُمْ طَيِّبٰتِكُمْ فِيْ حَيَاتِكُمُ الدُّنْيَا وَ اسْتَمْتَعْتُمْ بِهَا:} کفار چونکہ اپنے تکبر اور فسق کی وجہ سے ایمان قبول کرنے اور اپنے آپ کو مکمل طور پر اللہ اور اس کے رسول کی اطاعت کا پابند کرنے کے لیے تیار نہیں ہوتے اور نہ ہی آخرت ان کا مقصود ہوتی ہے، اس لیے انھیں ان کے نیک اعمال کا بدلا دنیا ہی میں دے دیا جاتا ہے۔ ان میں سے جو اعمال انھوں نے دنیا کے کسی مفاد مثلاً شہرت وغیرہ کے لیے کیے تھے ان کا تو آخرت سے کوئی تعلق ہی نہیں، البتہ جو اعمال انھوں نے اللہ کے لیے کیے ہوتے ہیں ان کا بدلا بھی انھیں یہیں دنیا میں دے دیا جاتا ہے، جو اور کچھ نہ ہو تو اتنا ہی بہت زیادہ ہے کہ ان کے کفر و شرک پر فوری گرفت نہیں ہوتی، بلکہ انھیں مہلت دی جاتی ہے اور اس کے ساتھ یہ کہ انھیں دنیا کی کئی نعمتیں بھی دی جاتی ہیں۔ (دیکھیے ہود : ۱۵، ۱۶) انس رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ لَا يَظْلِمُ مُؤْمِنًا حَسَنَةً، يُعْطٰی بِهَا فِي الدُّنْيَا وَيُجْزٰی بِهَا فِی الْآخِرَةِ، وَأَمَّا الْكَافِرُ فَيُطْعَمُ بِحَسَنَاتِ مَا عَمِلَ بِهَا لِلّٰهِ فِي الدُّنْيَا حَتّٰی إِذَا أَفْضٰی إِلَی الْآخِررَةِ لَمْ تَكُنْ لَهُ حَسَنَةٌ يُّجْزٰی بِهَا ] [مسلم، صفات المنافقین، باب جزاء المؤمن بحسناتہ في الدنیا والآخرۃ… : ۲۸۰۸ ] ’’اللہ تعالیٰ کسی مومن کی کسی ایک نیکی میں بھی کمی نہیں کرے گا، اسے اس کے عوض دنیا میں بھی دیا جائے گا اور آخرت میں بھی اس کی جزا دی جائے گی۔ رہا کافر تو اسے ان نیکیوں کے عوض جو اس نے اللہ کے لیے کی ہوتی ہیں دنیا میں کھلایا جاتا ہے، یہاں تک کہ جب وہ آخرت میں پہنچے گا تو اس کے پاس کوئی نیکی نہیں ہو گی جس کی اسے جزا دی جائے۔‘‘ ¤ ➌ { فَالْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُوْنِ بِمَا كُنْتُمْ تَسْتَكْبِرُوْنَ … :} اللہ تعالیٰ کے ہاں ہر نیکی کی جزا اور ہر بدی کی سزا اس نیکی یا بدی کی مناسبت سے دی جائے گی، جیسا کہ روزہ داروں کے لیے ’’باب الریان‘‘ سے داخلہ ہو گا۔ تو کفار کو ذلیل کرنے والا عذاب اس تکبر کی مناسبت سے ہو گا جو انھوں نے کیا، وہ اپنے آپ کو بڑی چیز سمجھتے تھے، ان کی عزت انھیں اللہ اور اس کے رسول کی اطاعت کرنے کی اجازت نہیں دیتی تھی، لا محالہ انھیں ایسا عذاب دیا جائے گا جو ان کے تکبر کا بدلا ہو۔ قیامت کے بعض مواقع میں ان کی ذلت کا نقشہ اس حدیث میں بیان ہوا جو عبد اللہ بن عمرو رضی اللہ عنھما نے بیان کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يُحْشَرُ الْمُتَكَبِّرُوْنَ يَوْمَ الْقِيَامَةِ أَمْثَالَ الذَّرِّ فِيْ صُوَرِ الرِّجَالِ يَغْشَاهُمُ الذُّلُّ مِنْ كُلِّ مَكَانٍ فَيُسَاقُوْنَ إِلٰی سِجْنٍ فِيْ جَهَنَّمَ يُسَمّٰیی بُوْلَسَ تَعْلُوْهُمْ نَارُ الْأَنْيَارِ يُسْقَوْنَ مِنْ عُصَصَارَةِ أَهْلِ النَّارِ طِيْنَةِ الْخَبَالِ ] [ ترمذي، صفۃ القیامۃ، باب ما جاء في شدۃ الوعید للمتکبرین : ۲۴۹۲، قال الألباني حسن ] ’’متکبر لوگ قیامت کے دن آدمیوں کی شکل میں چیونٹیوں کی طرح اٹھائے جائیں گے، ہر جگہ سے ذلت انھیں ڈھانپ رہی ہو گی۔ پھر انھیں ہانک کر جہنم کے ایک قید خانے کی طرف لے جایا جائے گا جس کا نام ’’بولس‘‘ ہے۔ ان پر آگوں کی آگ چڑھ رہی ہو گی، انھیں جہنمیوں کا نچوڑ پلایا جائے گا، جو تباہ کن کیچڑ ہو گا۔‘‘ رہی یہ بات کہ تکبر کیا ہے؟ تو اس کی تفصیل عبد اللہ بن مسعود رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے بیان کی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا : [ لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِيْ قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ، قَالَ رَجُلٌ إِنَّ ا الرَّجُلَ يُحِبُّ أَنْ يَكُوْنَ ثَوْبُهُ حَسَنًا وَنَعْلُهُ حَحَسَنَةً، قَالَ إِنَّ اللّٰهَ جَمِيْلٌ يُحِبُّ الْجَمَالَ، الْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ ] [ مسلم، الإیمان، باب تحریم الکبر و بیانہ : ۹۱ ] ’’وہ شخص جنت میں داخل نہیں ہو گا جس کے دل میں ذرّہ برابر تکبر ہو گا۔‘‘ ایک آدمی نے کہا : ’’آدمی پسند کرتا ہے کہ اس کے کپڑے اچھے ہوں اور اس کا جوتا اچھا ہو (تو کیا یہ تکبر ہے)؟‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’بے شک اللہ جمیل ہے، جمال کو پسند کرتا ہے، تکبر تو حق کو ٹھکرا دینے اور لوگوں کو حقیر سمجھنے کا نام ہے۔‘‘ ¤ ➍ { تَسْتَكْبِرُوْنَ فِي الْاَرْضِ:} ’’تم زمین میں بڑے بنتے تھے‘‘ اگرچہ بڑائی اللہ تعالیٰ کے سوا کسی کا حق نہیں خواہ وہ زمین میں ہو یا آسمانوں میں، مگر زمین کے رہنے والوں کو تو بدرجہ اولیٰ اپنی حیثیت مدنظر رکھنی چاہیے۔ پستی کے مکین کو بلندی کی ہوس کسی طرح بھی زیب نہیں دیتی، فرمایا : « وَ لَا تَمْشِ فِي الْاَرْضِ مَرَحًا اِنَّكَ لَنْ تَخْرِقَ الْاَرْضَ وَ لَنْ تَبْلُغَ الْجِبَالَ طُوْلًا» [ بني إسرائیل : ۳۷ ] ’’اور زمین میں اکڑ کر نہ چل، بے شک تو نہ کبھی زمین کو پھاڑے گا اور نہ کبھی لمبائی میں پہاڑوں تک پہنچے گا۔‘‘ ¤ ➎ { بِغَيْرِ الْحَقِّ:} اس کے دو مطلب ہیں، ایک یہ کہ اس کی صراحت اس لیے فرمائی کہ تکبر اللہ کے سوا کسی کا حق ہے ہی نہیں، جو بھی تکبر کرتا ہے ناحق کرتا ہے۔ دوسرا یہ کہ ناحق تکبر حرام ہے، جس کا ذکر اوپر گزرا، البتہ جہاد فی سبیل اللہ کرتے ہوئے کفار کے مقابلے میں تکبر حق ہے اور اللہ تعالیٰ کو پسند ہے۔ ¤ ➏ { وَ بِمَا كُنْتُمْ تَفْسُقُوْنَ:} استکبار سے مراد ایمان سے انکار اور فسق سے مراد دوسرے گناہ ہیں۔ مطلب یہ ہے کہ ذلت کے عذاب کے دو سبب ہوں گے، ایک زمین میں ناحق تکبر، یعنی ایمان لانے سے انکار اور دوسرا فسق، یعنی معاصی اور نافرمانیاں اور یہ دونوں کفار کا شیوہ ہیں، مسلمانوں کو اس سے پناہ مانگنی چاہیے۔ ¤ ➐ واضح رہے کہ اس آیت کی تفسیر میں مفسرین نے لکھا ہے کہ اس سے معلوم ہوتا ہے کہ مسلمان کو دنیا کی نعمتیں کم از کم استعمال کرنی چاہییں، تاکہ اس کی آخرت کی نعمتوں میں کمی نہ ہو اور یہاں عمر بن خطاب رضی اللہ عنہ اور دوسرے صحابہ کے زہد اور سادہ زندگی اور دنیا کی لذتوں سے اجتناب کے واقعات لکھے ہیں۔ مگر حق یہ ہے کہ یہ آیت مسلمانوں کے بارے میں ہے ہی نہیں، اس کا تعلق کفار سے ہے۔ کفار کے لیے صرف دنیا کی نعمتیں ہیں جبکہ ایمان والوں کے لیے دنیا اور آخرت دونوں کی نعمتیں ہیں، جیسا کہ فرمایا : « قُلْ مَنْ حَرَّمَ زِيْنَةَ اللّٰهِ الَّتِيْۤ اَخْرَجَ لِعِبَادِهٖ وَ الطَّيِّبٰتِ مِنَ الرِّزْقِ قُلْ هِيَ لِلَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا خَالِصَةً يَّوْمَ الْقِيٰمَةِ» [ الأعراف : ۳۲ ] ’’تو کہہ کس نے حرام کی اللہ کی زینت جو اس نے اپنے بندوں کے لیے پیدا کی اور کھانے پینے کی پاکیزہ چیزیں؟ کہہ دے یہ چیزیں ان لوگوں کے لیے جو ایمان لائے دنیا کی زندگی میں (بھی) ہیں، جبکہ قیامت کے دن (ان کے لیے) خالص ہوں گی۔‘‘ مومن کو اس کی نیکیوں کا بدلا دنیا اور آخرت دونوں جگہ ملتا ہے، جیسا کہ اس آیت کے فائدہ (۲) میں حدیث گزری ہے۔ رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنھم کا دنیا کی لذتوں سے اجتناب اس آیت کی بنا پر نہ تھا، کیونکہ یہ کفار کے لیے ہے، ان کا اجتناب اس لیے تھا کہ وہ دنیا کی لذتوں میں منہمک ہو کر آخرت سے غافل نہ ہو جائیں اور اس صبر و زہد پر انھیں زیادہ ثواب حاصل ہو۔ (خلاصہ اضواء البیان)"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ {وَ اذْكُرْ اَخَا عَادٍ: ’’ اذْكُرْ ‘‘ ’’ذِكْرٌ‘‘} سے ہو تو مطلب یہ ہے کہ اپنی قوم کے سامنے اس کا ذکر کرو، تاکہ انھیں نصیحت ہو اور اگر {’’ذُكْرٌ‘‘} سے ہو تو مطلب یہ ہے کہ اسے یاد کرو، تاکہ تمھیں اس سے تسلی حاصل ہو۔ دونوں باتیں بیک وقت بھی مراد ہو سکتی ہیں، کیونکہ {’’ اذْكُرْ ‘‘} دونوں سے فعلِ امر ہے۔ قیامت کے دن تکبر کرنے والوں کا حال بیان کرنے کے بعد دنیا میں چند متکبر اقوام کا ذکر فرمایا، جن میں سے عاد کا ذکر کچھ تفصیل کے ساتھ اور دوسری اقوام کا حال آیت (۲۷) : « وَ لَقَدْ اَهْلَكْنَا مَا حَوْلَكُمْ مِّنَ الْقُرٰى» میں اجمال کے ساتھ بیان فرمایا۔ عاد کے بھائی سے مراد ہود علیہ السلام ہیں، جیسا کہ فرمایا : «وَ اِلٰى عَادٍ اَخَاهُمْ هُوْدًا » [ الأعراف : ۶۵ ] ’’اور عاد کی طرف ان کے بھائی ہود کو (بھیجا)۔‘‘ تفصیل کے لیے دیکھیے سورۂ اعراف (۶۵) کی تفسیر۔ ہود علیہ السلام کو قومِ عاد کا بھائی اس لیے فرمایا کہ وہ ان کے ایک فرد تھے۔ عاد کا تفصیلی ذکر اس لیے فرمایا کہ عرب اقوام میں سے یہ پہلی قوم ہے جس کے پاس نوح علیہ السلام کی عام رسالت کے بعد کوئی رسول آیا۔ ہود اور صالح علیھما السلام کا زمانہ ابراہیم علیہ السلام سے پہلے کا ہے۔ سرداران قریش جو اپنی بڑائی کا زعم رکھتے تھے، انھیں قومِ عاد کا قصہ سنایا جو ان کی سرزمین کی سب سے طاقتور قوم تھی۔ ¤ ➋ {اِذْ اَنْذَرَ قَوْمَهٗ بِالْاَحْقَافِ: ’’اَلْأَحْقَافُ‘‘ ’’حِقْفٌ‘‘} کی جمع ہے، ریت کے بلند اور مستطیل ٹیلے کو {’’حِقْفٌ‘‘} کہتے ہیں، جو کچھ ٹیڑھا ہو۔ {’’اِحْقَوْقَفَ الشَّيْءُ‘‘} جب کوئی چیز ٹیڑھی ہو۔ یہاں ’’احقاف ‘‘ سے مراد یمن کے مشرق میں حضر موت کا وہ علاقہ ہے جو عرب کے صحرائے اعظم (ربع خالی) کا حصہ ہے۔ ہود علیہ السلام کی قوم وہاں آباد تھی اور اس زمانے میں وہ نہایت زرخیز اور ترقی یافتہ علاقہ تھا، جس میں چشمے، باغات اور مال مویشی کثرت کے ساتھ موجود تھے، جیسا کہ سورۂ شعراء (۱۳۲ تا ۱۳۴) میں مذکور ہے۔ اللہ تعالیٰ کے عذاب کے بعد وہ علاقہ ایسا برباد ہوا کہ اب تک وہاں آبادی کا نام و نشان نہیں، ہر طرف ریگستان ہے اور ریت کے لمبے چوڑے ٹیلے۔ معلوم ہوتا ہے کہ اس علاقے کو ’’احقاف‘‘ اس کی موجودہ حالت کے اعتبار سے کہا گیا ہے۔ تفہیم القرآن میں ہے : ’’احقاف کی موجودہ حالت دیکھ کر کوئی شخص یہ گمان بھی نہیں کر سکتا کہ کبھی یہاں ایک شاندار تمدن رکھنے والی ایک طاقتور قوم آباد ہو گی۔ اغلب یہ ہے کہ ہزاروں برس پہلے یہ ایک شاداب علاقہ ہو گا اور بعد میں آب و ہوا کی تبدیلی نے اسے ریگزار بنا دیا ہو گا۔ آج اس کی یہ حالت ہے کہ وہ ایک لق و دق ریگستان ہے، جس کے اندرونی حصوں میں جانے کی بھی کوئی ہمت نہیں رکھتا۔ ۱۸۴۳ء میں بویریا کا ایک فوجی آدمی اس کے جنوبی کنارے پر پہنچ گیا تھا، وہ کہتا ہے کہ حضر موت کی شمالی سطح مرتفع پر سے کھڑا ہو کر دیکھا جائے تو یہ صحرا ایک ہزار فٹ نشیب میں نظر آتا ہے، اس میں جگہ جگہ ایسے سفید خطے ہیں جن میں اگر کوئی چیز گر جائے تو ریت میں غرق ہوتی چلی جاتی ہے اور بالکل بوسیدہ ہو جاتی ہے۔ عرب کے بدو اس علاقے سے بہت ڈرتے ہیں اور کسی قیمت پر وہاں جانے پر راضی نہیں ہوتے۔ ایک موقع پر جب بدو اسے وہاں لے جانے پر راضی نہ ہوئے تو وہ اکیلا وہاں گیا۔ اس کا بیان ہے کہ یہاں کی ریت بالکل باریک سفوف کی طرح ہے، میں نے دور سے ایک شاقول اس میں پھینکا تو وہ پانچ منٹ کے اندر اس میں غرق ہو گیا اور اس رسی کا سرا گل گیا جس کے ساتھ وہ بندھا ہوا تھا۔ مفصل معلومات کے لیے ملاحظہ ہو : ¤ Arabia and the Isles by Harold Ingrams, London 1946 ¤ The Unveiling of Arabia. By Reginald Hugh kiernan, London 1937 ¤ \".The Empty Quarter By st john philby. London 1933 ¤ ➌ {وَ قَدْ خَلَتِ النُّذُرُ مِنْۢ بَيْنِ يَدَيْهِ وَ مِنْ خَلْفِهٖۤ …:} اللہ تعالیٰ فرما رہے ہیں کہ ہود علیہ السلام سے پہلے بھی کئی ڈرانے والے گزرے اور ان کے بعد بھی اپنی اپنی قوم کو ڈرانے والے کئی پیغمبر گزر چکے، سب کی تعلیم یہی تھی کہ اللہ کے سوا کسی کی عبادت نہ کرو۔ ڈرانے والوں کا ذکر اس لیے فرمایا کہ بشارت ماننے والوں کو دی جاتی ہے۔ اس سورت کی ابتدا بھی اسی بات سے ہوئی ہے ، فرمایا : «وَ الَّذِيْنَ كَفَرُوْا عَمَّاۤ اُنْذِرُوْا مُعْرِضُوْنَ » [ الأحقاف : ۳ ] ’’اور وہ لوگ جنھوں نے کفر کیا اس چیز سے جس سے وہ ڈرائے گئے، منہ پھیرنے والے ہیں۔‘‘ ¤ ➍ { اِنِّيْۤ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيْمٍ: ’’ عَظِيْمٍ ‘‘ ’’ يَوْمٍ ‘‘} کی صفت ہے۔ اس عظیم دن سے مراد آخرت کا دن بھی ہو سکتا ہے اور دنیا میں آنے والے تباہ کن عذاب کا دن بھی، جو قومِ عاد پر آندھی کی صورت میں آیا۔ یوم (دن) کو ان عظیم واقعات کی وجہ سے عظیم ککہا ہے جو اس میں واقع ہوں گے۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) {قَالُوْۤا اَجِئْتَنَا لِتَاْفِكَنَا عَنْ اٰلِهَتِنَا … :} اس آیت کی وضاحت کے لیے دیکھیے سورۂ ہود (۳۲) کی تفسیر۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ { قَالَ اِنَّمَا الْعِلْمُ عِنْدَ اللّٰهِ:} ہود علیہ السلام نے ان کے اس گستاخانہ مطالبے پر کسی تلخی کے اظہار کے بجائے انھیں مزید سمجھانے کی کوشش فرمائی۔ چنانچہ فرمایا، عذاب کا علم تو صرف اللہ تعالیٰ کے پاس ہے، اس کا اختیار بھی وہی رکھتا ہے، وہی جانتا ہے کہ تم پر دنیا میں عذاب آئے گا یا آخرت میں اور یہ بھی وہی جانتا ہے کہ تمھیں کب تک مہلت دی جائے گی۔ میرے پاس نہ اس کا اختیار ہے کہ جب چاہوں تم پر عذاب لے آؤں اور نہ ہی مجھے اس کے وقت کا علم ہے۔ ¤ ➋ { وَ اُبَلِّغُكُمْ مَّاۤ اُرْسِلْتُ بِهٖ:} میرا کام وہ پیغام تم تک پہنچا دینا ہے جو دے کر مجھے بھیجا گیا ہے، جیسا کہ فرمایا : « فَاِنْ اَعْرَضُوْا فَمَاۤ اَرْسَلْنٰكَ عَلَيْهِمْ حَفِيْظًا اِنْ عَلَيْكَ اِلَّا الْبَلٰغُ » [ الشورٰی : ۴۸ ] ’’پھر اگر وہ منہ پھیر لیں تو ہم نے تجھے ان پر کوئی نگران بنا کر نہیں بھیجا، تیرے ذمے پہنچا دینے کے سوا کچھ نہیں۔‘‘ ¤ ➌ { وَ لٰكِنِّيْۤ اَرٰىكُمْ قَوْمًا تَجْهَلُوْنَ:} ’’جہل‘‘ اکھڑ پن کو بھی کہتے ہیں اور لاعلمی کو بھی۔ اگر پہلا معنی ہو تو جہالت برتنے کا مطلب یہ ہو گا کہ ایک تم کفر پر اصرار کر رہے ہو، اچھی بات قبول کرنے کے بجائے عذاب مانگ رہے ہو اور دوسرے مجھ سے ایسی چیز کا مطالبہ کر رہے ہو جو میرے اختیار میں نہیں ہے، اور اگر یہ جہل علم کے مقابلے میں ہو تو مطلب یہ ہے کہ تمھیں علم ہی نہیں کہ اللہ تعالیٰ کا عذاب کیا ہوتا ہے اور وہ تمھارے کس قدر قریب آ چکا ہے اور نہ یہ علم ہے کہ رسول پیغام پہنچانے کے لیے آتے ہیں، عذاب لانا ان کے اختیار میں نہیں ہوتا۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ {فَلَمَّا رَاَوْهُ عَارِضًا … : ’’ رَاَوْهُ ‘‘} کی ضمیر عذاب کی طرف لوٹ رہی ہے جس کا وہ مطالبہ کرتے آتے تھے۔ {’’عَرَضَ يَعْرِضُ‘‘} سامنے آنا۔ {’’ عَارِضٌ‘‘} عظیم بادل جو پہاڑوں کی طرح افق پر سامنے آیا ہوا ہو۔ قوم کے ہود علیہ السلام کو جھٹلانے اور ان پر عذاب کے درمیان کا لمبا قصہ مختصر کرکے نتیجہ بیان فرمایا ہے۔ اس آیت میں ان کے الفاظ {’’ هٰذَا عَارِضٌ مُّمْطِرُنَا ‘‘} (یہ بادل ہے جو ہم پر مینہ برسانے والا ہے) سے ظاہر ہے کہ اس عذاب سے پہلے مدت تک بارش بند رہی۔ ہود علیہ السلام نے کفر و شرک سے توبہ اور اللہ تعالیٰ سے استغفار پر انھیں بارش کی بشارت بھی دی۔ چنانچہ فرمایا : « وَ يٰقَوْمِ اسْتَغْفِرُوْا رَبَّكُمْ ثُمَّ تُوْبُوْۤا اِلَيْهِ يُرْسِلِ السَّمَآءَ عَلَيْكُمْ مِّدْرَارًا وَّ يَزِدْكُمْ قُوَّةً اِلٰى قُوَّتِكُمْ وَ لَا تَتَوَلَّوْا مُجْرِمِيْنَ » [ ھود : ۵۲ ] ’’اور اے میری قوم! اپنے رب سے بخشش مانگو، پھر اس کی طرف پلٹ آؤ، وہ تم پر بادل بھیجے گا، جو خوب برسنے والا ہوگا اور تمھیں تمھاری قوت کے ساتھ اور قوت زیادہ دے گا اور مجرم بنتے ہوئے منہ نہ موڑو۔‘‘ اس سے ظاہر ہے کہ انھیں بارش کی شدید ضرورت تھی، لیکن اس کے باوجود وہ اپنے کفر پر جمے رہے اور یہ کہہ کر عذاب لانے کا مطالبہ کرتے رہے کہ اگر سچے ہو تو عذاب لے آؤ، یعنی اگر فوراً عذاب نہیں لاتے تو تم جھوٹے ہو۔ ہود علیہ السلام کا جواب پیچھے گزر چکا ہے۔ آخر عذاب کا وقت آ پہنچا اور اس نے بادل کی صورت میں ان کی وادیوں کی طرف بڑھنا شروع کیا، جب انھوں نے اس عذاب کو بادل کی صورت میں اپنی وادیوں کی طرف آتے ہوئے دیکھا تو بہت خوش ہوئے کہ یہ بادل ہم پر بارش برسائے گا۔ ¤ ➋ { بَلْ هُوَ مَا اسْتَعْجَلْتُمْ بِهٖ:} ممکن ہے کہ انھیں یہ جواب ہود علیہ السلام نے دیا ہو یا صورتِ حال انھیں پکار کر کہہ رہی ہو۔ ¤ ➌ {رِيْحٌ فِيْهَا عَذَابٌ اَلِيْمٌ: ’’ رِيْحٌ ‘‘} میں تنوین تہویل کے لیے ہے، بلکہ یہ وہ ہے جسے تم نے جلدی طلب کیا ہے، یہ خوفناک آندھی ہے جس میں عذابِ الیم ہے۔ اس کی کیفیت سورۂ قمر (۱۹، ۲۰) اور سورۂ حاقہ (۶ تا ۸) میں تفصیل سے بیان ہوئی ہے۔ قومِ عاد آندھی والے بادلوں کو بارش برسانے والے سمجھتے رہے، حالانکہ وہ ان پر آنے والا عذاب تھا۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم جب بادل اٹھتے یا ہوا تیز چلتی تو پریشان ہو جاتے تھے۔ عائشہ رضی اللہ عنھا نے فرمایا : [ مَا رَأَيْتُ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَ سَلَّمَ ضَاحِكًا حَتّٰی أَرٰی مِنْهُ لَهَوَاتِهِ، إِنَّمَا كَانَ يَتَبَسَّمُ، قَالَتْ وَكَانَ إِذَا رَأٰی غَيْمًا أَوْ رِيْحًا عُرِففَ فِيْ وَجْهِهِ، قَالَتْ يَا رَسُوْلَ اللّٰهِ! إِنَّ النَّاسَ إِذَا رَأَوُا الْغَيْمَ فَرِحُوْا، رَجَاءَ أَنْ يَكُوْنَ فِيْهِ الْمَطَرُ، وَ أَرَاكَ إِذَا رَأَيْتَهُ عُرِفَ فِيْ وَجْهِكَ الْكَرَاهِيَةُ، فَقَالَ يَا عَائِشَةُ! مَا يُؤْمِنِّيْ أَنْ يَكُوْنَ فِيْهِ عَذَابٌ، عُذِّبَ قَوْمٌ بِالرِّيْحِ، وَقَدْ رَأٰی قَوْمٌ الْعَذَابَ فَقَالُوْا : «هٰذَا عَارِضٌ مُّمْطِرُنَا » ] [بخاري، التفسیر، تفسیر سورۃ الأحقاف : ۴۸۲۸، ۴۸۲۹ ] ’’میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس طرح ہنستے ہوئے نہیں دیکھا کہ مجھے آپ کا تالو میں لٹکا ہوا گوشت کا ٹکڑا نظر آ جائے، آپ صرف مسکراتے تھے۔‘‘ فرماتی ہیں : ’’اور آپ صلی اللہ علیہ وسلم جب بادل یا ہوا دیکھتے تو وہ آپ کے چہرے میں پہچانی جاتی۔‘‘ انھوں نے کہا : ’’یا رسول اللہ! لوگ جب بادل دیکھتے ہیں تو خوش ہو جاتے ہیں، اس امید پر کہ اس میں بارش ہو گی اور میں آپ کو دیکھتی ہوں کہ آپ جب اسے دیکھتے ہیں تو آپ کے چہرے میں ناگواری پہچانی جاتی ہے؟‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اے عائشہ ! مجھے اس سے کیا چیز بے خوف کرتی ہے کہ اس میں کوئی عذاب ہو؟ ایک قوم کو آندھی کے ساتھ عذاب دیا گیا اور ایک قوم نے عذاب دیکھا تو کہنے لگے : ’’یہ بادل ہم پر بارش برسانے والا ہے۔‘‘ عائشہ رضی اللہ عنھا ہی بیان کرتی ہیں : [ كَانَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ الرِّيْحِ وَالْغَيْمِ عُرِفَ ذٰلِكَ فِيْ وَجْهِهِ وَأَقْبَلَ وَأَدْبَرَ، فَإِذَا مَطَرَتْ سُرَّ بِهِ وَذَهَبَ عَنْهُ ذٰلِكَ، قَالَتْ عَائِشَةُ فَسَأَلْتُهُ فَقَالَ إِنِّيْ خَشِيْتُ أَنْ يَكُوْنَ عَذَابًا سُلِّطَ عَلٰی أُمَّتِيْ، وَيَقُوْلُ إِذَا رَأَی الْمَطَرَ، رَحْمَةً ] [ مسلم، صلاۃ الاستسقاء، باب التعوذ عند رؤیۃ الریح… : ۸۹۹ ] ’’جب ہوا اور بادل والا دن ہوتا تو وہ رسول اللہ صلی اللہ علیہ وسلم کے چہرے میں پہچانا جاتا اور آپ (بے چینی کے عالم میں) کبھی اندر آتے کبھی باہر جاتے، جب بارش برسنے لگتی تو خوش ہو جاتے اور آپ کی وہ کیفیت ختم ہو جاتی۔‘‘ عائشہ رضی اللہ عنھا نے فرمایا، میں نے آپ سے اس بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’میں ڈرتا ہوں کہیں وہ عذاب نہ ہو جو میری امت پر مسلط کیا گیا ہو۔‘‘ اور جب آپ صلی اللہ علیہ وسلم بارش کو دیکھتے تو کہتے : ’’(یا اللہ! اسے) رحمت( بنا)۔‘‘"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ { تُدَمِّرُ كُلَّ شَيْءٍۭ بِاَمْرِ رَبِّهَا:} یہاں ایک مشہور سوال ہے کہ اللہ تعالیٰ نے فرمایا ’’وہ ہر چیز کو اپنے رب کے حکم سے برباد کر دے گی‘‘ حالانکہ کئی چیزیں اس کے بعد بھی موجود رہیں، جیسا کہ خود اللہ تعالیٰ نے سورۂ ہود (۵۸) میں فرمایا ہے کہ ہود علیہ السلام اور ان پر ایمان لانے والے اس عذاب سے محفوظ رہے۔ اہلِ علم نے اس کا جواب یہ دیا ہے کہ لفظ {’’ كُلٌّ‘‘} سے کائنات کی ہر چیز مراد نہیں ہوتی، بلکہ ہر مقام پر اس کی مناسبت سے کل چیزیں مراد ہوتی ہیں، جیسا کہ ہُد ہُد نے ملکہ سبا کے متعلق کہا تھا : « وَ اُوْتِيَتْ مِنْ كُلِّ شَيْءٍ » [ النمل : ۲۳ ] ’’اور اسے ہر چیز میں سے حصہ دیا گیا ہے۔‘‘ ظاہر ہے اس سے مراد وہ تمام چیزیں ہیں جن کی حکومت کے لیے ضرورت ہوتی ہے، ورنہ ہر چیز میں سے تو اسے حصہ نہیں دیا گیا تھا۔ اسی طرح یہاں ہر چیز کو برباد کرنے سے مراد ہر اس چیز کو برباد کرنا ہے جسے برباد کرنے کا اسے حکم دیا گیا تھا، جیسا کہ {’’ بِاَمْرِ رَبِّهَا ‘‘} (اپنے رب کے حکم کے ساتھ) کے الفاظ سے ظاہر ہے۔ چنانچہ ہود علیہ السلام اور ان پر ایمان لانے والوں کو اس آندھی نے کوئی نقصان نہیں پہنچایا، کیونکہ اسے یہی حکم تھا، جیسا کہ سورۂ ہود (۵۸) میں ہے۔ ¤ ➋ { فَاَصْبَحُوْا لَا يُرٰۤى اِلَّا مَسٰكِنُهُمْ …: ’’ فَاَصْبَحُوْا ‘‘} سے مراد یہاں ’’انھوں نے صبح کی‘‘ نہیں، بلکہ یہاں {’’أَصْبَحَ‘‘ ’’صَارَ‘‘} کے معنی میں ہے، یعنی ’’وہ اس طرح ہو گئے‘‘ کیونکہ وہ ہوا صرف ایک رات نہیں چلی کہ صبح ان کی یہ حالت ہوئی ہو، بلکہ سات راتیں اور آٹھ دن چلتی رہی اور ایسی تند و تیز اور غضب ناک ہو کر چلی کہ اللہ تعالیٰ نے فرمایا : « مَا تَذَرُ مِنْ شَيْءٍ اَتَتْ عَلَيْهِ اِلَّا جَعَلَتْهُ كَالرَّمِيْمِ » [ الذاریات : ۴۲ ] ’’جو کسی چیز کو نہ چھوڑتی تھی جس پر سے گزرتی مگر اسے بوسیدہ ہڈی کی طرح کر دیتی تھی۔‘‘ درخت، آدمی، جانور، مکان غرض ہر چیز ہوا نے اکھاڑ پھینکی۔ آخر مکانوں کے کھنڈروں یا گری ہوئی کھوکھلی کھجوروں کے تنوں جیسے لاشوں کے سو اکچھ نظر نہ آتا تھا، جو نشانِ عبرت بنے ہوئے تھے کہ اللہ کے مجرموں کا یہ حال ہوتا ہے۔ مراد کفار مکہ کو سمجھانا ہے کہ کفر پر اصرار کے نتیجے میں تمھارا بھی یہ حال ہو سکتا ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ {وَ لَقَدْ مَكَّنّٰهُمْ فِيْمَاۤ اِنْ مَّكَّنّٰكُمْ فِيْهِ: ’’مَكَّنَ يُمَكِّنُ تَمْكِيْنًا‘‘} کسی چیز پر قدرت دینا۔ {’’ اِنْ مَّكَّنّٰكُمْ ‘‘} میں{ ’’ اِنْ ‘‘} شرطیہ نہیں بلکہ نافیہ ہے، یعنی ’’اگر‘‘ کے بجائے ’’نہیں‘‘ کے معنی میں ہے ۔ قریش مکہ کو یہ بات کہی جا رہی ہے کہ جسمانی ڈیل ڈول، مال، اولاد، قوت، سلطنت، غرض وہ دنیوی اسباب جن پر ہم نے قومِ عاد کو قدرت عطا کی تھی تمھیں ان پر قدرت عطا نہیں کی، جب اللہ کے عذاب کے سامنے ان کی تمام تر قوت و شوکت تنکوں کی طرح اڑ گئی تو تمھاری کیا بساط ہے؟ یہ بات اللہ تعالیٰ نے متعدد مقامات پر فرمائی ہے، دیکھیے سورۂ روم (۹) اور سورۂ مومن (۲۱)۔ ¤ ➋ { وَ جَعَلْنَا لَهُمْ سَمْعًا وَّ اَبْصَارًا وَّ اَفْـِٕدَةً … :} دوسری جگہ ان کے متعلق فرمایا : « وَ كَانُوْا مُسْتَبْصِرِيْنَ» [ العنکبوت : ۳۸] ’’حالانکہ وہ بہت سمجھ دار تھے۔‘‘ یعنی ہم نے انھیں سننے کے لیے کان، دیکھنے کے لیے آنکھیں اور سوچ بچار کے لیے دل دیے تھے، مگر انھوں نے اللہ تعالیٰ کی آیات کو سننے، اس کی نشانیوں کو عبرت کے لیے دیکھنے اور آخرت کی زندگی کے متعلق غور و فکر کے بجائے ان سے اتنا ہی کام لیا جو دنیا کے مال و متاع کے حصول کے لیے مفید ہو۔ دنیا کے کام میں عقل مند تھے، لیکن وہ عقل نہ آئی جس سے آخرت درست ہو، آیاتِ الٰہی سنتے وقت ان کے کان بہرے ہو جاتے تھے اور آیاتِ الٰہی دیکھنے کے لیے ان کی آنکھیں بند ہی رہتی تھیں۔ پھر جب ان پر اللہ کا عذاب آیا تو ان کی عقل مندی ان کے کسی کام نہ آ سکی، کیونکہ وہ اللہ کی آیات تسلیم کرنے سے صاف انکار کیا کرتے تھے۔ ¤ ➌ { وَ حَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ:} یعنی وہ عذاب جس کا وہ مذاق اڑایا کرتے تھے اور کہہا کرتے تھے کہ جس عذاب سے ہمیں ڈراتے ہو وہ کب آ رہا ہے، اسی عذاب نے انھیں گھیر لیا اور ایسا گھیرا کہ پھر اس سے نکل نہ سکے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { وَ لَقَدْ اَهْلَكْنَا مَا حَوْلَكُمْ مِّنَ الْقُرٰى:} انسان کی فطرت ہے کہ وہ دوسروں کو دیکھ کر عبرت حاصل کرتا ہے، اس لیے اللہ تعالیٰ نے اہلِ مکہ کو مخاطب کرکے فرمایا کہ تم اپنے اردگرد کی بستیوں پر نظر ڈالو اور دیکھو کس قدر قومیں نیست و نابود کر دی گئیں اور کس طرح انھوں نے اپنے کرتوتوں کے بدلے پائے ہیں۔ اردگرد سے مراد احقاف ہے جو یمن کے حضر موت کے علاقے میں ہے، وہاں کے بسنے والے عادیوں کے انجام پر نظر ڈالو۔ تمھارے اور شام کے درمیان مقامِ حجر میں ثمود کا جو حشر ہوا اسے دیکھو، یمن کی قوم سبا کے انجام پر غور کرو، مدین جو تمھارے اور غزہ کے درمیان ہے، تم وہاں آتے جاتے رہتے ہو اور قومِ لوط کی بستیاں بھی تمھارے راستے میں پڑتی ہیں، ان سب کے واقعات عرب میں مشہور و معروف تھے۔ (ابن کثیر) ¤ ➋ { وَ صَرَّفْنَا الْاٰيٰتِ لَعَلَّهُمْ يَرْجِعُوْنَ:} اس کی تفسیر دو طرح سے ہو سکتی ہے، ایک یہ کہ ہم نے ان بستیوں کے رہنے والوں کے لیے آیات کو پھیر پھیر کر اور کئی طرح سے کھول کر بیان کیا، تاکہ وہ پلٹ آئیں۔ دوسرا یہ کہ اللہ تعالیٰ کفارِ مکہ کے متعلق فرما رہے ہیں کہ ہم نے ان کے لیے آیات کو پھیر پھیر کر بیان کیا، تاکہ وہ کفر و شرک سے پلٹ آئیں۔ اس صورت میں کلام میں التفات ہے کہ پچھلے جملے {’’ وَ لَقَدْ اَهْلَكْنَا مَا حَوْلَكُمْ مِّنَ الْقُرٰى ‘‘} میں کفارِ مکہ کو مخاطب فرمایا، پھر{’’ وَ صَرَّفْنَا الْاٰيٰتِ لَعَلَّهُمْ يَرْجِعُوْنَ ‘‘} میں نارراضی کے اظہار کے لیے ان کا ذکر غائب کے صیغے کے ساتھ فرمایا۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ {فَلَوْ لَا نَصَرَهُمُ الَّذِيْنَ اتَّخَذُوْا … : ’’ قُرْبَانًا ‘‘} حال ہے یا مفعول لہ ہے، ترجمہ مفعول لہ کے مطابق کیا گیا ہے۔ اہل مکہ اور ان کے اردگرد کی قوموں کا سب سے بڑا اور مشترکہ جرم یہ تھا کہ انھوں نے اللہ تعالیٰ کے سوا کئی ایسے الٰہ بنا رکھے تھے جن کے متعلق وہ سمجھتے تھے کہ وہ مصیبت کے وقت ان کے کام آتے ہیں، اللہ تعالیٰ کے ہاں ان کی سفارش کرتے ہیں، اس کے پاس ان کی فریادیں پہنچاتے ہیں اور انھیں اللہ تعالیٰ کے قریب کرنے کا ذریعہ بنتے ہیں۔ سورۂ زمر میں گزر چکا ہے کہ مشرکینِ مکہ بھی اپنے پیش رو لوگوں کی طرح کہا کرتے تھے : « مَا نَعْبُدُهُمْ اِلَّا لِيُقَرِّبُوْنَاۤ اِلَى اللّٰهِ زُلْفٰى » [ الزمر : ۳ ] ’’ہم ان کی عبادت صرف اس لیے کرتے ہیں کہ وہ ہمیں اللہ سے قریب کر دیں۔‘‘ اور سورۂ یونس میں ہے : « هٰۤؤُلَآءِ شُفَعَآؤُنَا عِنْدَ اللّٰهِ » [ یونس : ۱۸ ] ’’یہ اللہ کے ہاں ہمارے سفارشی ہیں۔‘‘ پھر چاہیے تو یہ تھا کہ جب اس جرم کی پاداش میں ان پر عذاب آیا تو وہ ان کی مدد کو پہنچتے، مگر کوئی ان کی مدد کو نہ پہنچا۔ اس لیے اللہ تعالیٰ نے فرمایا کہ پھر ان کے ان داتاؤں، حاجت رواؤں اور مشکل کشاؤں نے ان کی مدد کیوں نہ کی جنھیں ان لوگوں نے قرب حاصل کرنے کے لیے اللہ کے سوا معبود بنایا ہوا تھا؟ ¤ ➋ { بَلْ ضَلُّوْا عَنْهُمْ:} یعنی جب وہ وقت آیا جس کے لیے ان کی پوجا کی جاتی تھی اور ان کے سامنے نذرانے پیش کیے جاتے تھے، تو وہ معبود یوں غائب ہو گئے کہ کہیں ان کا سراغ نہ ملا۔ ¤ ➌ { وَ ذٰلِكَ اِفْكُهُمْ وَ مَا كَانُوْا يَفْتَرُوْنَ:} معلوم ہوا کہ انن کی وہ باتیں جو انھوں نے اپنے معبودوں کی دھاک بٹھانے کے لیے گھڑ رکھی تھیں سب جھوٹ تھیں اور وہ سراسر بہتان تھیں جو وہ باندھتے رہتے تھے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ {وَ اِذْ صَرَفْنَاۤ اِلَيْكَ نَفَرًا مِّنَ الْجِنِّ …:’’ اِذْ ‘‘} سے پہلے {’’اُذْكُرْ‘‘} محذوف ہے جس کا عطف اس سے پہلے مذکور آیت {’’ وَ اذْكُرْ اَخَا عَادٍ ‘‘} پر ہے۔ یعنی کفارِ مکہ کے لیے ہود علیہ السلام اور ان کی قوم عاد کا ذکر کیجیے جو ان سے کہیں زیادہ قوت و شوکت والے تھے کہ اپنے رسول کو جھٹلانے پر ان کا کیا حال ہوا، اسی طرح اہلِ مکہ کے اردگرد کی بستیوں کے کفر پر اصرار کا انجام کیا ہوا، تاکہ اہلِ مکہ کو ان کے انجام سے عبرت ہو اور وہ کفر و شرک سے باز آ جائیں۔ {’’ وَ اِذْ صَرَفْنَاۤ اِلَيْكَ نَفَرًا مِّنَ الْجِنِّ يَسْتَمِعُوْنَ الْقُرْاٰنَ ‘‘} اور ان کفار کے لیے اس وقت کا ذکر کیجیے جب ہم نے جنوں کے ایک گروہ کا رخ آپ کی طرف پھیرا اور انھوں نے آپ سے قرآن سنا۔ مقصد کفارِ مکہ کو شرم دلانا ہے کہ اپنی جنس انسان، اپنی نسل عرب، اپنی قوم قریش اور اپنے شہر مکہ میں مبعوث رسول کی زبان سے ان پر نازل شدہ قرآن جیسی فصیح و بلیغ اور معجز کتاب مدت سے سننے کے باوجود نہ تم پر قرآن کا کچھ اثر ہوا، نہ تم رسول پر ایمان لائے اور نہ شرک کی نجاست سے پاک ہو سکے، ذرا جنوں کے اس گروہ کو بھی دیکھو جو اچانک اس موقع پر پہنچا جب رسول اللہ صلی اللہ علیہ وسلم قرآن پڑھ رہے تھے، وہ رسول اللہ صلی اللہ علیہ وسلم کی جنس یا قوم کے فرد نہیں تھے بلکہ ایک الگ جنس سے تھے، شہر بھی ان کا کوئی اور تھا، راستے میں انھیں قرآن سننے کا اتفاق ہوا۔ رسول اللہ صلی اللہ علیہ وسلم کو علم بھی نہ تھا کہ جنوں کا کوئی گروہ میرا قرآن سن رہا ہے، اس کے باوجود ان کے طرزِ عمل اور اپنے طرزِ عمل کا موازنہ کر لو۔ ¤ ➋ {فَلَمَّا حَضَرُوْهُ قَالُوْۤا اَنْصِتُوْا:} جب وہ اس موقع پر حاضر ہوئے تو ایک دوسرے سے کہنے لگے کہ خاموش ہو جاؤ، تاکہ ہم غور سے قرآن سن سکیں۔ ان جنوں کو دیکھو کہ وہ اللہ تعالیٰ کی عطا کردہ توفیق سے خود ہی اس حکم پر عمل کر رہے ہیں جو سورۂ اعراف میں ہے : « وَ اِذَا قُرِئَ الْقُرْاٰنُ فَاسْتَمِعُوْا لَهٗ وَ اَنْصِتُوْا لَعَلَّكُمْ تُرْحَمُوْنَ » [ الأعراف : ۲۰۴ ] ’’اور جب قرآن پڑھا جائے تو اسے کان لگا کر سنو اور چپ رہو، تاکہ تم پر رحم کیا جائے۔‘‘ اور اپنے آپ کو دیکھو، تمھاری روش وہ ہے جس کا ذکر اللہ تعالیٰ نے حم السجدہ میں فرمایا ہے : « وَ قَالَ الَّذِيْنَ كَفَرُوْا لَا تَسْمَعُوْا لِهٰذَا الْقُرْاٰنِ وَ الْغَوْا فِيْهِ لَعَلَّكُمْ تَغْلِبُوْنَ» [ حٰمٓ السجدۃ : ۲۶ ] ’’ اور ان لوگوں نے کہا جنھوں نے کفر کیا، اس قرآن کو مت سنو اور اس میں شور کرو، تاکہ تم غالب رہو۔‘‘ وہ ایک دوسرے کو خاموش رہ کر سننے کی تلقین کر رہے ہیں اور تم ایک دوسرے کو سننے سے روک رہے ہو۔ کم از کم سن تو لو، تاکہ ان کی طرح رحم کا دروازہ تمھارے لیے بھی کھل سکے، صرف تکبر اور غلبے کی ہوس میں نہ پڑے رہو، ایسا نہ ہو کہ یہ ہوس قومِ عاد کی طرح تمھیں بھی برباد کر دے۔ ¤ ➌ { فَلَمَّا قُضِيَ وَ لَّوْا اِلٰى قَوْمِهِمْ مُّنْذِرِيْنَ:} جب قرآن کی قراء ت پوری ہو چکی تو وہ نہ صرف یہ کہ خود ایمان لے آئے بلکہ اپنی قوم کو بھی کفر کے انجام سے خبردار کرنے کے لیے ان کی طرف واپس پلٹ گئے، کیونکہ ایمان کی تکمیل اسی سے ہوتی ہے۔ ابوہریرہ رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم نے چند نصیحتیں فرمائیں، ان میں سے ایک یہ تھی : [ وَ أَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ، تَكُنْ مُؤْمِنًا ] [ ابن ماجہ، الزھد، باب الورع والتقوٰی : ۴۲۱۷ ] ’’لوگوں کے لیے وہی پسند کرو جو اپنے لیے پسند کرتے ہو، مومن بن جاؤ گے۔‘‘ ¤ ➍ طبری نے ابن عباس رضی اللہ عنھما سے روایت کی ہے کہ انھوں نے {’’ وَ اِذْ صَرَفْنَاۤ اِلَيْكَ نَفَرًا مِّنَ الْجِنِّ ‘‘} کے بارے میں فرمایا : ’’یہ اہل نصیبین میں سے سات (مرد جن) تھے، رسول اللہ صلی اللہ علیہ وسلم نے انھیں اپنی قوم کی طرف پیغام پہنچانے والا بنا کر بھیجا۔‘‘ [ الطبري : ۳۱۵۷۴ ] ابن کثیر کے محقق نے اس کی سند کو حسن کہا ہے۔ ¤ ➎ جنوں کا یہ گروہ کس موقع پر آیا؟ اس کی تفصیل کے لیے دیکھیے سورۂ جن کی شانِ نزول اور اس کی ابتدائی آیات کی تفسیر۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) ➊ {قَالُوْا يٰقَوْمَنَاۤ اِنَّا سَمِعْنَا كِتٰبًا اُنْزِلَ مِنْۢ بَعْدِ مُوْسٰى:} جنوں نے نازل کردہ کتابوں میں سے آخری کتاب انجیل کا نام لینے کے بجائے تورات کا نام لیا۔ بعض مفسرین کے مطابق اس کی وجہ یا تو یہ ہے کہ وہ یہود کے دین پر تھے، یا انھیں انجیل کے نزول کا علم نہیں تھا، مگر زیادہ صحیح بات یہ ہے کہ قرآن سے پہلے آخری کتاب جو شریعت کے احکام پر مشتمل تھی وہ تورات تھی۔ داؤد علیہ السلام کی زبور اور عیسیٰ علیہ السلام کی انجیل اس کی تکمیل یا تفسیر و تبیین کرنے والی کتابیں تھیں۔ موسیٰ علیہ السلام کے بعد آنے والے تمام انبیاء حتیٰ کہ عیسیٰ علیہ السلام بھی تورات ہی پر عمل کے پابند تھے۔ (دیکھیے مائدہ : ۴۴) اسی سورۂ احقاف میں بھی قرآن سے پہلے موسیٰ علیہ السلام کی کتاب کا ذکر ہے، فرمایا : « وَ مِنْ قَبْلِهٖ كِتٰبُ مُوْسٰۤى اِمَامًا وَّ رَحْمَةً» [الأحقاف : ۱۲ ] ’’اور اس سے پہلے موسیٰ کی کتاب پیشوا اور رحمت تھی۔‘‘ رسول اللہ صلی اللہ علیہ وسلم پر غارِ حرا میں پہلی وحی کے نزول پر جب ام المومنین خدیجہ رضی اللہ عنھا آپ صلی اللہ علیہ وسلم کو لے کر ورقہ بن نوفل کے پاس گئیں تو انھوں نے آپ صلی اللہ علیہ وسلم سے سارا معاملہ سن کر کہا تھا : [ هٰذَا النَّامُوْسُ الَّذِيْ أُنْزِلَ عَلٰی مُوْسٰی] [ بخاري، التعبیر، باب أوّل ما بدء بہ رسول اللہ صلی اللہ علیہ وسلم … : ۶۹۸۲ ] ’’یہ وہی صاحب راز فرشتہ ہے جو موسیٰ علیہ السلام پر نازل کیا گیا۔‘‘ حالانکہ ورقہ بن نوفل اس سے پہلے عیسیٰ علیہ السلام کا دین قبول کر چکے تھے اور انجیل کے عالم تھے۔ ¤ ➋ { مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ:} یعنی یہ کتاب اس سے پہلی تمام آسمانی کتابوں کو سچا ثابت کرنے والی ہے کہ اس کتاب کے ذریعے سے وہ تمام باتیں اور پیش گوئیاں سچ ثابت ہوئیں جو ان کتابوں میں کی گئی ہیں، جن میں نبی کریم صلی اللہ علیہ وسلم کی آمد کی پیش گوئی بھی شامل ہے۔ ¤ ➌ { يَهْدِيْۤ اِلَى الْحَقِّ وَ اِلٰى طَرِيْقٍ مُّسْتَقِيْمٍ:} ابن کثیر رحمہ اللہ نے فرمایا : ’’یعنی عقائد و اخبار میں حق اور اعمال میں سیدھے راستے کی طرف راہ نمائی کرتی ہے، کیونکہ قرآن خبر اور طلب دو چیزوں پر مشتمل ہے۔ اس کی خبر صدق اور طلب عدل ہے، جیسا کہ فرمایا : «وَ تَمَّتْ كَلِمَتُ رَبِّكَ صِدْقًا وَّ عَدْلًا » [ الأنعام : ۱۱۵ ] ’’اور تیرے رب کی کتاب صدق اور عدل کے اعتبار سے پوری ہو گئی۔‘‘ اور اللہ تعالیٰ نے فرمایا : «هُوَ الَّذِيْۤ اَرْسَلَ رَسُوْلَهٗ بِالْهُدٰى وَ دِيْنِ الْحَقِّ » [ التوبۃ : ۳۳ ] ’’وہی ہے جس نے اپنا رسول ہدایت اور دین حق دے کر بھیجا۔‘‘ چنانچہ ہدایت علم نافع ہے اور دینِ حق عمل صالح ہے اور جنوں نے بھی یہی بات کہی کہ {’’ يَهْدِيْۤ اِلَى الْحَقِّ ‘‘} (اعتقادات میں حق کی راہنمائی کرتی ہے) {’’ وَ اِلٰى طَرِيْقٍ مُّسْتَقِيْمٍ ‘‘} (اور عملیات میں سیدھے راستے کی)۔‘‘"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { يٰقَوْمَنَاۤ … : ’’ يٰقَوْمَنَاۤ ‘‘} کے ساتھ دوبارہ مخاطب کرنے کا مقصد اس بات کے اہم ہونے کی طرف متوجہ کرنا ہے جو اس آیت میں بیان کی گئی ہے۔ جس طرح خطیب کسی اہم بات کی طرف متوجہ کرنے کے لیے اثنائے کلام میں {’’أَيُّهَا النَّاسُ‘‘} کہتا ہے۔ (ابن عاشور) ¤ ➋ { اَجِيْبُوْا دَاعِيَ اللّٰهِ: ’’ دَاعِيَ اللّٰهِ ‘‘} سے مراد رسول اللہ صلی اللہ علیہ وسلم ہیں، کیونکہ آپ صلی اللہ علیہ وسلم کی دعوت اپنی ذات یا کسی بھی مخلوق کے بجائے صرف اللہ تعالیٰ کی عبادت اور اسی کی اطاعت کی طرف تھی، جیسا کہ فرمایا : « قُلْ هٰذِهٖ سَبِيْلِيْۤ اَدْعُوْۤا اِلَى اللّٰهِ  عَلٰى بَصِيْرَةٍ اَنَا وَ مَنِ اتَّبَعَنِيْ وَ  وَ سُبْحٰنَ اللّٰهِ وَ مَاۤ اَنَا مِنَ الْمُشْرِكِيْنَ » [ یوسف : ۱۰۸ ] ’’کہہ دے یہی میرا راستہ ہے، میں اللہ کی طرف بلاتا ہوں، پوری بصیرت پر، میں اور وہ بھی جنھوں نے میری پیروی کی ہے اور اللہ پاک ہے اور میں شریک بنانے والوں سے نہیں ہوں۔‘‘ یہاں ایک سوال ہے کہ جنوں نے نبی صلی اللہ علیہ وسلم کی صبح کی نماز کے دوران قرآن مجید کی جو تلاوت سنی آپ نے اس میں کون سی آیات پڑھیں، جن میں وہ باتیں موجود تھیں جن کی تلقین جنوں نے اپنی قوم کو کی؟ جواب اس کا یہ ہے کہ اگر ہمیں اور کوئی آیات معلوم نہ ہو سکیں تو سورۂ فاتحہ کی قراء ت تو یقینی ہے جو قرآن مجید کے تمام مضامین کو اپنے دامن میں سمیٹے ہوئے ہے۔ ¤ ➌ { يَغْفِرْ لَكُمْ مِّنْ ذُنُوْبِكُمْ وَ يُجِرْكُمْ مِّنْ عَذَابٍ اَلِيْمٍ: ’’ يَغْفِرْ ‘‘} اور {’’ يُجِرْ‘‘ ’’ اَجِيْبُوْا ‘‘} اور {’’ اٰمِنُوْا ‘‘} (فعل امر) کا جواب ہونے کی وجہ سے مجزوم ہیں۔ {’’ يُجِرْ ‘‘} اصل میں {’’يُجِيْرُ‘‘} ہے، جو باب افعال کا مضارع معلوم ہے۔ راء پر جزم آنے کی وجہ سے یاء اور راء دو ساکن جمع ہونے پر یاء کو حذف کر دیا گیا تو {’’ يُجِرْ ‘‘} ہو گیا۔ ¤ ➍ {’’ يَغْفِرْ لَكُمْ مِّنْ ذُنُوْبِكُمْ ‘‘} میں {’’ مِنْ ‘‘} لانے کا کیا فائدہ ہے؟ اس کے لیے دیکھیے سورۂ نوح (۴) کی تفسیر۔ ¤ ➎ اللہ کے داعی کی دعوت قبول کرنے اور اس پر ایمان لانے پر دو بشارتیں دیں، ایک اس فائدے کے حصول کی بشارت جو تمھیں ایمان لانے سے حاصل ہو گا کہ وہ تمھارے گناہ بخش دے گا اور دوسری ناقابلِ تلافی نقصان سے بچنے کی بشارت کہ وہ تمھیں عذابِ الیم سے پناہ دے گا۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) ➊ {وَ مَنْ لَّا يُجِبْ دَاعِيَ اللّٰهِ … :} بشارت کے بعد یہ نذارت ہے، جس میں اس کتاب پر ایمان نہ لانے والوں کو ڈرایا گیا ہے۔ یہ وہی بات ہے جو سورۂ جن میں ان الفاظ کے ساتھ بیان ہوئی ہے : « وَ اَنَّا ظَنَنَّاۤ اَنْ لَّنْ نُّعْجِزَ اللّٰهَ فِي الْاَرْضِ وَ لَنْ نُّعْجِزَهٗ هَرَبًا » [ الجن : ۱۲ ] ’’اور یہ کہ ہم نے یقین کر لیا کہ بے شک ہم کبھی اللہ کو ززمین میں عاجز نہیں کر سکیں گے اور نہ ہی بھاگ کر کبھی اسے عاجز کر سکیں گے۔‘‘ ¤ ➋ { وَ لَيْسَ لَهٗ مِنْ دُوْنِهٖۤ اَوْلِيَآءُ:} یعنی اللہ تعالیٰ کی دعوت قبول نہ کرنے والا نہ خود دنیا یا آخرت میں اللہ تعالیٰ کی گرفت سے بھاگ کر کہیں جا سکتا ہے اور نہ ہی کسی طرح کے مددگار اس کی مدد کو پہنچ سکتے ہیں۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) ➊ {اَوَ لَمْ يَرَوْا اَنَّ اللّٰهَ الَّذِيْ … : ’’ اَوَ لَمْ يَرَوْا ‘‘} سے مراد {’’أَوَ لَمْ يَعْلَمُوْا‘‘} ہے، یعنی ’’کیا انھیں معلوم نہیں؟‘‘ کیونکہ انھوں نے اللہ تعالیٰ کو آسمان و زمین کو پیدا کرتے ہوئے دیکھا نہیں تھا، بلکہ یہ بات وہ جانتے تھے۔ یہ اس لیے فرمایا کہ یہ بات ان کے ہاں مسلم تھی کہ آسمان و زمین کو پیدا کرنے والا اللہ تعالیٰ ہے۔ سورت کے شروع میں اللہ تعالیٰ کی توحید کے ساتھ قیامت کا ذکر بھی یہ کہہ کر فرمایا : « مَا خَلَقْنَا السَّمٰوٰتِ وَ الْاَررْضَ وَ مَا بَيْنَهُمَاۤ اِلَّا بِالْحَقِّ وَ ا اَجَلٍ مُّسَمًّى وَ الَّذِيْنَ كَفَرُوْا عَمَّاۤ اُنْذِرُوْا مُعْرِضُوْنَ » [ الأحقاف : ۳ ] ’’ہم نے آسمانوں اور زمین کو اور جو ان دونوں کے درمیان ہے حق اور مقررہ میعاد ہی کے ساتھ پیداکیا ہے اور وہ لوگ جنھوں نے کفر کیا اس چیز سے جس سے وہ ڈرائے گئے، منہ پھیرنے والے ہیں۔‘‘ سورت کے درمیان میں بھی یہ مضمون ذکر فرمایا : «وَ الَّذِيْ قَالَ لِوَالِدَيْهِ اُفٍّ لَّكُمَاۤ اَتَعِدٰنِنِيْۤ اَنْ اُخْرَجَ وَ قَدْ خَلَتِ الْقُرُوْنُ مِنْ قَبْلِيْ وَ هُمَا يَسْتَغِيْثٰنِ اللّٰهَ وَيْلَكَ اٰمِنْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ فَيَقُوْلُ مَا هٰذَاۤ اۤ اِلَّاۤ اَسَاطِيْرُ الْاَوَّلِيْنَ» [ الأحقاف : ۱۷ ] ’’اور وہ جس نے اپنے ماں باپ سے کہا اف ہے تم دونوں کے لیے! کیا تم مجھے دھمکی دیتے ہو کہ مجھے( قبر سے) نکالا جائے گا، حالانکہ مجھ سے پہلے بہت سی قومیں گزر چکیں۔ جب کہ وہ دونوں اللہ سے فریاد کرتے (ہوئے کہتے) ہیں تجھے ہلاکت ہو! ایمان لے آ، بے شک اللہ کا وعدہ حق ہے۔ تو وہ کہتا ہے یہ پہلے لوگوں کی فرضی کہانیوں کے سوا کچھ نہیں۔‘‘ توحید کے ساتھ رسالت کے دلائل، منکرین پر اللہ تعالیٰ کے عذاب کے نزول اور جنوں کے ایمان لانے کے ذکر کے بعد آخر میں پھر قیامت کے حق ہونے کا اور اس کی ایک زبردست دلیل کا ذکر فرمایا۔ یعنی یہ کفار جو انسان کے دوبارہ زندہ ہونے کو محال سمجھ رہے ہیں، کیا انھیں معلوم نہیں کہ اللہ تعالیٰ جس نے آسمان و زمین پیدا فرمائے وہ مردوں کو زندہ کرنے پر بھی قادر ہے؟ اللہ تعالیٰ نے آسمان و زمین کی پیدائش کو انسان کے دوبارہ پیدا کرنے کی دلیل کے طور پر متعدد مقامات پر ذکر فرمایا ہے، چنانچہ فرمایا : « ءَاَنْتُمْ اَشَدُّ خَلْقًا اَمِ السَّمَآءُ بَنٰىهَا (27) رَفَعَ سَمْكَهَا فَسَوّٰىهَا (28) وَ اَغْطَشَ لَيْلَهَا وَ اَخْرَجَ ضُحٰىهَا (29) وَ الْاَرْضَ بَعْدَ ذٰلِكَ دَحٰىهَا (30) اَخْرَجَ مِنْهَا مَآءَهَا وَ مَرْعٰىهَا (31) وَ الْجِبَالَ اَرْسٰىهَا (32) مَتَاعًا لَّكُمْ وَ لِاَنْعَامِكُمْ» [ النازعات : ۲۷ تا ۳۳ ] ’’کیا پیدا کرنے میں تم زیادہ مشکل ہو یا آسمان؟ اس نے اسے بنایا۔ اس کی چھت کو بلند کیا، پھر اسے برابر کیا۔ اور اس کی رات کو تاریک کر دیا اور اس کے دن کی روشنی کو ظاہر کر دیا۔ اور زمین، اس کے بعد اسے بچھا دیا۔ اس سے اس کا پانی اور اس کا چارا نکالا۔ اور پہاڑ، اس نے انھیں گاڑ دیا۔ تمھاری اور تمھارے چوپاؤں کی زندگی کے سامان کے لیے۔‘‘ اور فرمایا : «لَخَلْقُ السَّمٰوٰتِ وَ الْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ وَ لٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ » [ المؤمن : ۵۷ ] ’’یقینا آسمانوں اور زمین کا پیدا کرنا لوگوں کے پیدا کرنے سے زیادہ بڑا (کام) ہے اور لیکن اکثر لوگ نہیں جانتے۔‘‘ ¤ ➋ { وَ لَمْ يَعْيَ بِخَلْقِهِنَّ:} یہود و نصاریٰ کی الہامی کتاب تورات کی دوسری کتاب ’’خروج‘‘ میں مذکور ہے : ’’چھ دن میں خداوند نے آسمان اور زمین کو پیدا کیا اور ساتویں دن آرام کیا اور تازہ دم ہوا۔‘‘ [ خروج، باب : ۳۱، فقرہ : ۱۷ ] تازہ دم وہ ہوتا ہے جو تھکے اور تھکنا نقصانِ قدرت پر مبنی ہے۔ چونکہ اللہ تعالیٰ میں کسی قسم کا نقصان نہیں، اس لیے تورات کی اس عبارت کی اصلاح اور یہودیوں عیسائیوں کے عقیدے کی غلطی کا اظہار کرنے کو قرآن مجید کی اس آیت میں فرمایا : «وَ لَمْ يَعْيَ بِخَلْقِهِنَّ» اللہ آسمان و زمین کو پیدا کر کے تھکا نہیں، یہ تمھارا خیال غلط ہے۔ (تفسیر ثنائی) دوسری جگہ فرمایا : «وَ لَقَدْ خَلَقْنَا السَّمٰوٰتِ وَ الْاَرْضَ وَ مَا بَيْنَهُمَا فِيْ سِتَّةِ اَيَّامٍ وَّ مَا مَسَّنَا مِنْ لُّغُوْبٍ » [ قٓ : ۳۸ ] ’’اور بلاشبہ یقینا ہم نے آسمانوں اور زمین کواور جو کچھ ان دونوں کے درمیان ہے چھ دنوں میں پیدا کیا اور ہمیں کسی قسم کی تھکاوٹ نے نہیں چھوا۔‘‘ ¤ ➌ {’’ بِقٰدِرٍ ‘‘} میں ’’باء‘‘ لانے کی توجیہ ابن ہشام نے بہت عمدہ فرمائی ہے، وہ فرماتے ہیں : ’’بعض اوقات کسی چیز کو اس کے معنی یا لفظ میں یا دونوں میں مشابہ چیز کا حکم دے دیا جاتا ہے۔ پہلی کی کئی صورتیں ہیں، جن میں سے ایک اللہ تعالیٰ کے فرمان {’’ اَوَ لَمْ يَرَوْا اَنَّ اللّٰهَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ وَ لَمْ يَعْيَ بِخَلْقِهِنَّ بِقٰدِرٍ ‘‘} میں {’’ اَنَّ ‘‘} کی خبر {’’قَادِرٌ‘‘} پر باء کا داخل ہونا ہے، کیونکہ یہ {’’ أَوَ لَيْسَ اللّٰهُ بِقَادِرٍ‘‘} کے معنی میں ہے۔ یہ ’’باء ‘‘ اس لیے آئی ہے کہ {’’ اَنَّ ‘‘} کے اسم اور خبر میں بہت فاصلہ ہے۔ اسی لیے دوسری آیت : « اَوَ لَمْ يَرَوْا اَنَّ اللّٰهَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ قَادِرٌ عَلٰۤى اَنْ يَّخْلُقَ مِثْلَهُمْ » [ بني إسرائیل : ۹۹ ] میں {’’ قَادِرٌ ‘‘} پر باء نہیں آئی۔ اسی کی ایک مثال {’’ وَ كَفٰى بِاللّٰهِ شَهِيْدًا ‘‘} ہے، کیونکہ اس میں {’’ اِكْتَفِ بِاللّٰهِ شَهِيْدًا ‘‘} کا معنی پایا جا رہا ہے۔‘‘ (اعراب القرآن از درویش) ¤ {’’ اَوَ لَمْ يَرَوْا اَنَّ اللّٰهَ …‘‘} کے جواب میں {’’ بَلٰۤى ‘‘} آنے کی وجہ بھی یہی ہے کہ یہ {’’أَوَ لَيْسَ اللّٰهُ بِقَادِرٍ‘‘} کے معنی میں ہے، کیونکہ {’’ بَلٰۤى ‘‘} سابقہ نفی کی تردید کے لیے لایا جاتا ہے، جب کہ {’’نَعَمْ‘‘} پہلی نفی کی تاکید کے لیے لایا جاتا ہے۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ {وَ يَوْمَ يُعْرَضُ الَّذِيْنَ كَفَرُوْا عَلَى النَّارِ … :} قیامت کے حق ہونے کو دلیل کے ساتھ ذکر کرنے کے بعد اس دن کا ایک منظر پیش فرمایا، یعنی وہ دن یاد کرو جب ان لوگوں کو جو قیامت اور جہنم کا انکار کرتے تھے آگ پر پیش کیا جائے گا (اور کہا جائے گا) کیا یہ حق نہیں؟ سوال کا مقصد پوچھنا نہیں ہو گا بلکہ انھیں ذلیل کرنا اور وہ دنیا میں جہنم اور قیامت کا جو مذاق اڑاتے رہے اس کے بدلے میں ان کا مذاق اڑانا ہو گا۔ جہنم کے عذاب کے ساتھ ملامت، ڈانٹ ڈپٹ اور طنز و تہکّم کا یہ عذاب بجائے خود بہت بڑی سزا ہو گی، دوسری جگہ فرمایا : «يَوْمَ يُدَعُّوْنَ اِلٰى نَارِ جَهَنَّمَ دَعًّا (13) هٰذِهِ النَّارُ الَّتِيْ كُنْتُمْ بِهَا تُكَذِّبُوْنَ (14) اَفَسِحْرٌ هٰذَاۤ اَمْ اَنْتُمْ لَا تُبْصِرُوْنَ » [ الطور : ۱۳ تا ۱۵ ] ’’جس دن انھیں جہنم کی آگ کی طرف دھکیلا جائے گا، سخت دھکیلا جانا۔ یہی ہے وہ آگ جسے تم جھٹلاتے تھے۔ تو کیا یہ جادو ہے، یا تم نہیں دیکھ رہے؟‘‘ ¤ ➋ { قَالُوْا بَلٰى وَ رَبِّنَا:} دنیا میں جس جہنم کا انکار کرتے تھے اور اس کا مذاق اڑاتے تھے اب اس کا اقرار ہی نہیں کریں گے بلکہ اس کے حق ہونے پر قسم کھائیں گے، کیونکہ اس کے سوا ان کے پاس کوئی چارہ ہی نہیں ہو گا۔ ¤ ➌ { فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُوْنَ:} مگر اس وقت کا اقرار و اعتراف انھیں کچھ فائدہ نہیں دے گا، بلکہ ان سے کہا جائے گا کہ اگر یہ حق ہے تو پھر اس حق کو نہ ماننے کی وجہ سے اس کی سزا کا مزہ چکھو۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) ➊ { فَاصْبِرْ كَمَا صَبَرَ اُولُوا الْعَزْمِ مِنَ الرُّسُلِ:} توحید و رسالت اور قیامت کو دلائل سے ثابت کرنے اور کفار کے شہادت کا جواب دینے کے بعد رسول اللہ صلی اللہ علیہ وسلم کو صبر و استقامت کی نصیحت فرمائی، کیونکہ آپ کو دعوت الی اللہ کے جواب میں کفار کی بدزبانی، استہزا اور اذیت رسانی سے شدید قلق اور سخت تکلیف ہوتی تھی، اس لیے فرمایا کہ اے نبی! جس طرح پختہ ارادے اور مضبوط عزم و ہمت والے رسولوں نے صبر کیا، آپ بھی صبر کریں۔ رہی یہ بات کہ ان اولوا العزم رسولوں سے مراد کون ہیں؟ تو عموماً پانچ رسولوں کو اولوا العزم کہا جاتا ہے جن میں نوح، ابراہیم، موسیٰ اور عیسیٰ علیھم السلام کے ساتھ پانچویں خود رسول اللہ صلی اللہ علیہ وسلم ہیں، کیونکہ ان کا اکٹھا ذکر قرآن مجید میں دو مقامات پر آیا ہے، ایک سورۂ احزاب میں ہے، فرمایا : « وَ اِذْ اَخَذْنَا مِنَ النَّبِيّٖنَ مِيْثَاقَهُمْ وَ مِنْكَ وَ مِنْ نُّوْحٍ وَّ اِبْرٰهِيْمَ وَ مُوْسٰى وَ عِيْسَى ابْنِ مَرْيَمَ وَ اَخَذْنَا مِنْهُمْ مِّيْثَاقًا غَلِيْظًا» [ الأحزاب : ۷ ] ’’اور جب ہم نے تمام نبیوں سے ان کا پختہ عہد لیا اور تجھ سے اور نوح اور ابراہیم اور موسیٰ اور عیسیٰ ابن مریم سے بھی اور ہم نے ان سے بہت پختہ عہد لیا۔‘‘ اور دوسری آیت سورۂ شوریٰ کی ہے، فرمایا : «شَرَعَ لَكُمْ مِّنَ الدِّيْنِ مَا وَصّٰى بِهٖ نُوْحًا وَّ الَّذِيْۤ اَوْحَيْنَاۤ اِلَيْكَ وَ مَا وَصَّيْنَا بِهٖۤ اِبْرٰهِيْمَ وَ مُوْسٰى وَ عِيْسٰۤى اَنْ اَقِيْمُوا الدِّيْنَ وَ لَا تَتَفَرَّقُوْا فِيْهِ » [ الشورٰی : ۱۳ ] ’’اس نے تمھارے لیے دین کا وہی طریقہ مقرر کیا جس کا تاکیدی حکم اس نے نوح کو دیا اور جس کی وحی ہم نے تیری طرف کی اور جس کا تاکیدی حکم ہم نے ابراہیم اور موسیٰ اور عیسیٰ کو دیا، یہ کہ اس دین کو قائم رکھو اور اس میں جدا جدا نہ ہو جاؤ۔‘‘ مگر ان آیات میں نہ ان پیغمبروں کے اولوا العزم ہونے کا ذکر ہے اور نہ دوسرے پیغمبروں کے اولوا العزم نہ ہونے کا، اس لیے اسے عام رکھا جائے اور {’’ مِنْ ‘‘} کو بیانیہ قرار دیا جائے تو بہتر ہے۔ معنی یہ ہو گا کہ اس طرح صبر کر جس طرح پختہ ارادے والوں نے کیا، جو رسول تھے، جیسا کہ فرمایا : « فَاجْتَنِبُوا الرِّجْسَ مِنَ الْاَوْثَانِ » [ الحج : ۳۰ ] ’’پس گندگی سے بچو، جو بت ہیں۔‘‘ مطلب یہ ہے کہ آپ سے پہلے پیغمبر اپنی قوم کی بے رخی، مخالفت اور ایذا رسانیوں کا جس طرح عزم و ہمت اور صبر و استقامت کے ساتھ مقابلہ کرتے رہے اسی طرح آپ بھی کریں۔ ¤ بعض مفسرین نے فرمایا کہ اولوا العزم سے تمام رسول مراد لینا درست نہیں، کیونکہ بعض رسولوں کے متعلق عزم کی نفی آئی ہے، جیسا کہ آدم علیہ السلام کے متعلق فرمایا : «فَنَسِيَ وَ لَمْ نَجِدْ لَهٗ عَزْمًا » [ طٰہٰ : ۱۱۵ ] ’’پھر وہ بھول گیا اور ہم نے اس میں ارادے کی کچھ پختگی نہ پائی۔‘‘ اور یونس علیہ السلام کے متعلق فرمایا : « وَ لَا تَكُنْ كَصَاحِبِ الْحُوْتِ » [ القلم : ۴۸ ] ’’اور تو مچھلی والے کی طرح نہ ہو۔‘‘ اس لیے اولوا العزم سے اونچے درجے کے صاحبِ عزم رسول مراد ہیں، اگرچہ ان کی تعیین مشکل ہے۔ مگر ان مفسرین کی یہ بات اس لیے درست نہیں کہ اگرچہ آدم علیہ السلام سے یہ فعل سر زد ہو گیا مگر بعد میں ان کا درجہ پہلے سے بھی اونچا ہو گیا، جیسا کہ فرمایا : «ثُمَّ اجْتَبٰهُ رَبُّهٗ فَتَابَ عَلَيْهِ وَ هَدٰى » [ طٰہٰ : ۱۲۲ ] ’’پھر اس کے رب نے اسے چن لیا، تو اس پر مہربانی فرمائی اور ہدایت دی۔‘‘ اور یونس علیہ السلام کے متعلق فرمایا : « فَاجْتَبٰىهُ رَبُّهٗ فَجَعَلَهٗ مِنَ الصّٰلِحِيْنَ» [ القلم : ۵۰ ] ’’پھر اس کے رب نے اسے چن لیا، پس اسے نیکوں میں شامل کر دیا۔‘‘ اس لیے توبہ کے بعد ان دونوں پیغمبروں کے بھی اولوا العزم ہونے میں کوئی شبہ نہیں۔ ¤ ➋ { وَ لَا تَسْتَعْجِلْ لَّهُمْ:} صبر کے حکم کے ساتھ ہی جلد بازی سے منع فرمایا، یعنی ان کے لیے جلدی کا مطالبہ نہ کریں کہ یہ لوگ جلدی ایمان کیوں نہیں لاتے، یا ایمان نہ لانے کی وجہ سے ان پر جلدی عذاب کیوں نہیں آ جاتا۔ ¤ ➌ { كَاَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوْعَدُوْنَ … :} یعنی جب وہ اللہ کا عذاب دیکھیں گے جس کا ان سے وعدہ کیا جاتا ہے تو انھیں ایسا معلوم ہو گا کہ وہ دنیا میں ایک ساعت سے زیادہ نہیں رہے، کیونکہ عذاب کی شدت انھیں سال و ماہ کی وہ مدت فراموش کروا دے گی جو انھوں نے دنیا میں بسر کی، جیسا کہ فرمایا : « قٰلَ كَمْ لَبِثْتُمْ فِي الْاَرْضِ عَدَدَ سِنِيْنَ (112) قَالُوْا لَبِثْنَا يَوْمًا اَوْ بَعْضَ يَوْمٍ فَسْـَٔلِ الْعَآدِّيْنَ (113) قٰلَ اِنْ لَّبِثْتُمْ اِلَّا قَلِيْلًا لَّوْ اَنَّكُمْ كُنْتُمْ تَعْلَمُوْنَ » [ المؤمنون : ۱۱۲ تا ۱۱۴ ] ’’فرمائے گا تم زمین میں سالوں کی گنتی میں کتنی مدت رہے ؟ وہ کہیں گے ہم ایک دن یا دن کا کچھ حصہ رہے، سو شمار کرنے والوں سے پوچھ لے۔ فرمائے گا تم نہیں رہے مگر تھوڑا ہی، کاش کہ واقعی تم جانتے ہوتے۔‘‘ کبھی انھیں وہ مدت ایک پہر معلوم ہو گی (دیکھیے نازعات : ۴۶) اور کبھی وہ قسمیں کھا کر کہیں گے کہ وہ دنیا میں صرف ایک گھڑی رہے ہیں۔ دیکھیے سورۂ روم (۵۵)۔ ¤ ➍ { بَلٰغٌ :} یہ {’’هٰذَا‘‘} کی خبر ہے، یعنی یہ قرآن تو پیغام کا پہنچا دینا ہے، جیسا کہ فرمایا : « هٰذَا بَلٰغٌ لِّلنَّاسِ وَ لِيُنْذَرُوْا بِهٖ » [ إبراھیم : ۵۲ ] ’’یہ لوگوں کے لیے ایک پیغام ہے اور تاکہ انھیں اس کے ساتھ ڈرایا جائے۔‘‘ ¤ ➎ { فَهَلْ يُهْلَكُ اِلَّا الْقَوْمُ الْفٰسِقُوْنَ:} یعنی قرآن کے پہنچ جانے کے بعد حجت تمام ہو گئی، اب بھی اگر کوئی فسق اور نافرمانی میں پڑا رہتا ہے تو وہ اپنی شامت کو خود دعوت دے رہا ہے۔ اللہ تعالیٰ کی طرف سے کسی کو بے قصور نہیں پکڑا جاتا، وہاں وہی لوگ ہلاک کیے جاتے ہیں جو فاسق اور نافرمان ہوں۔"
    }
  ]
}