{
  "surah": "At-Tur",
  "surah_number": 52,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { وَ الطُّوْرِ:} اللہ تعالیٰ نے یہاں اپنی پانچ عظیم الشان مخلوقات کی قسم کھائی ہے، اس بات کا یقین دلانے کے لیے کہ اس کا عذاب قیامت کے دن اس کے دشمنوں پر واقع ہو کر رہنے والا ہے، اسے کوئی ہٹانے والا نہیں۔ یہ پانچوں مخلوقات اللہ تعالیٰ کی عظیم اور لامحدود قوت و قدرت کی شاہد ہیں اور اس بات کی دلیل ہیں کہ ان عظیم مخلوقات کے خالق کے لیے قیامت برپا کرنا اور اپنے منکروں کو عذاب دینا معمولی بات ہے۔ ¤ ➋ { ’’ الطُّوْرِ ‘‘} کا معنی وہ پہاڑ جس پر پودے اگتے ہوں۔ ایک خاص پہاڑ کا نام بھی ’’طور‘‘ ہے جس کے دامن میں اللہ تعالیٰ نے موسیٰ علیہ السلام سے کلام کیا اور اگر اس پر ’’الف لام‘‘ جنس کا ہو تو تمام پہاڑ مراد ہیں۔ اللہ تعالیٰ نے اپنی عظمت کی طرف توجہ دلانے کے لیے متعدد مقامات پر پہاڑوں کا ذکر فرمایا ہے۔ ان کا زمین میں گڑا ہوا ہونا، آسمان کی طرف بلند ہونا، سمندر سے ہزاروں فٹ بلند ہونے کے باوجود ان پر چشموں، پودوں اور درختوں کا اور اتنی بلندی پر گلیشیروں کی صورت میں پانی کے بے حساب ذخیروں کا موجود ہونا، ان کے اندر چھپے ہوئے معدنیات کے بے شمار خزانے، اتنے بلند اور ٹھوس ہونے کے باوجود ان میں راستوں کا موجود ہونا، غرض پہاڑوں میں اللہ تعالیٰ کی قدرت و عظمت کی بے شمار نشانیاں ہیں۔ مزید دیکھیے سورئہ رعد(۳)، حجر(۱۹)، نحل(81،15)، لقمان( ۱۰)، فاطر( ۲۷)، مرسلات (۲۷)، نبا(۷)، نازعات(۳۲) اور غاشیہ(۱۹)۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 3،2) {وَ كِتٰبٍ مَّسْطُوْرٍ (2) فِيْ رَقٍّ مَّنْشُوْرٍ:’’ مَسْطُوْرٍ ‘‘} ترتیب اور خوب صورتی کے ساتھ سطر میں لکھی ہوئی کتاب۔ {’’ رَقٍّ ‘‘} کا مادہ رقت اور باریکی کے لیے استعمال ہوتا ہے، مراد باریک چمڑا یا جھلی ہے جو مضبوط اور دیرپا ہونے کی وجہ سے لکھنے کے لیے استعمال ہوتے تھے۔ کاغذ یا کسی طرح کا باریک ورق بھی {’’ رَقٍّ ‘‘} ہے۔ {’’ مَنْشُوْرٍ ‘‘} کھلا ہوا، جسے کھول کر پڑھا جا سکے۔ اس ’’کتاب مسطور‘‘ کے متعلق مفسرین کے متعدد اقوال ہیں، لوح محفوظ، اعمال نامے، تورات، آسمانی کتابیں اور قرآن مجید وغیرہ۔ لفظ عام ہونے کی وجہ سے ’’کتاب مسطور‘‘ میں یہ تمام کتابیں اور انسان، جن یا فرشتے جو کچھ لکھتے ہیں وہ سب کچھ شامل ہے۔ حقیقت یہ ہے کہ لکھنا اللہ تعالیٰ کی نشانیوں میں سے بہت بڑی نشانی ہے، خواہ اس نے خود لکھا ہو، جیسے لوح محفوظ ہے، یا اس کے فرشتوں نے لکھا ہو، جیسے نامہ ہائے اعمال ہیں، یا اس کے سکھانے سے انسانوں نے لکھا ہو۔ اس لیے اللہ تعالیٰ نے اپنے ’’اکرم‘‘ ہونے کا ذکر لکھنے کی تعلیم دینے کے حوالے سے فرمایا : « اِقْرَاْ وَ رَبُّكَ الْاَكْرَمُ (3) الَّذِيْ عَلَّمَ بِالْقَلَمِ» [ العلق : ۳،۴ ] ’’پڑھ اور تیرا رب ہی سب سے زیادہ کرم والا ہے۔ وہ جس نے قلم کے ساتھ سکھایا۔‘‘ اور سورۂ قلم میں تمام لکھنے والوں کی لکھی ہوئی تحریروں کو شاہد کے طور پر پیش کرنے کے لیے ان کی قسم کھائی، جیسا کہ فرمایا : « نٓ وَ الْقَلَمِ وَ مَا يَسْطُرُوْنَ » [ القلم : ۱ ] ’’{نٓ} ۔قسم ہے قلم کی! اور اس کی جو وہ لکھتے ہیں!‘‘ یہاں قیامت کے قیام اور اس میں عذاب واقع ہونے کا ایک شاہد ’’کتاب مسطور‘‘ کو قرار دیا ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3،2) {وَ كِتٰبٍ مَّسْطُوْرٍ (2) فِيْ رَقٍّ مَّنْشُوْرٍ:’’ مَسْطُوْرٍ ‘‘} ترتیب اور خوب صورتی کے ساتھ سطر میں لکھی ہوئی کتاب۔ {’’ رَقٍّ ‘‘} کا مادہ رقت اور باریکی کے لیے استعمال ہوتا ہے، مراد باریک چمڑا یا جھلی ہے جو مضبوط اور دیرپا ہونے کی وجہ سے لکھنے کے لیے استعمال ہوتے تھے۔ کاغذ یا کسی طرح کا باریک ورق بھی {’’ رَقٍّ ‘‘} ہے۔ {’’ مَنْشُوْرٍ ‘‘} کھلا ہوا، جسے کھول کر پڑھا جا سکے۔ اس ’’کتاب مسطور‘‘ کے متعلق مفسرین کے متعدد اقوال ہیں، لوح محفوظ، اعمال نامے، تورات، آسمانی کتابیں اور قرآن مجید وغیرہ۔ لفظ عام ہونے کی وجہ سے ’’کتاب مسطور‘‘ میں یہ تمام کتابیں اور انسان، جن یا فرشتے جو کچھ لکھتے ہیں وہ سب کچھ شامل ہے۔ حقیقت یہ ہے کہ لکھنا اللہ تعالیٰ کی نشانیوں میں سے بہت بڑی نشانی ہے، خواہ اس نے خود لکھا ہو، جیسے لوح محفوظ ہے، یا اس کے فرشتوں نے لکھا ہو، جیسے نامہ ہائے اعمال ہیں، یا اس کے سکھانے سے انسانوں نے لکھا ہو۔ اس لیے اللہ تعالیٰ نے اپنے ’’اکرم‘‘ ہونے کا ذکر لکھنے کی تعلیم دینے کے حوالے سے فرمایا : « اِقْرَاْ وَ رَبُّكَ الْاَكْرَمُ (3) الَّذِيْ عَلَّمَ بِالْقَلَمِ» [ العلق : ۳،۴ ] ’’پڑھ اور تیرا رب ہی سب سے زیادہ کرم والا ہے۔ وہ جس نے قلم کے ساتھ سکھایا۔‘‘ اور سورۂ قلم میں تمام لکھنے والوں کی لکھی ہوئی تحریروں کو شاہد کے طور پر پیش کرنے کے لیے ان کی قسم کھائی، جیسا کہ فرمایا : « نٓ وَ الْقَلَمِ وَ مَا يَسْطُرُوْنَ » [ القلم : ۱ ] ’’{نٓ} ۔قسم ہے قلم کی! اور اس کی جو وہ لکھتے ہیں!‘‘ یہاں قیامت کے قیام اور اس میں عذاب واقع ہونے کا ایک شاہد ’’کتاب مسطور‘‘ کو قرار دیا ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) { وَ الْبَيْتِ الْمَعْمُوْرِ:} آباد گھر۔ اس کے متعلق بھی مفسرین کے مختلف اقوال ہیں، بعض نے فرمایا، اس سے مراد حدیث میں مذکور ساتویں آسمان پر موجود ایک مکان ہے۔ انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے معراج کا ذکر کرتے ہوئے فرمایا : [ ثُمَّ عَرَجَ بِنَا إِلَی السَّمَاءِ السَّابِعَةِ فَاسْتَفْتَحَ جِبْرِيْلُ فَقِيْلَ مَنْ هٰذَا؟ قَالَ جِبْرِيْلُ، قِيْلَ وَمَنْ مَعَكَ؟ قَالَ مُحَمَّدٌ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ، قِيْلَ وَقَدْ بُعِثَ إِلَيْهِ؟ قَالَ قَدْ بُعِثَ إِلَيْهِ، فَفُتِحَ لَنَا فَإِذَا أَنَا بِإِبْرَاهِيْمَ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ مُسْنِدًا ظَهْرَهُ إِلَی الْبَيْتِ الْمَعْمُوْرِ وَإِذَا هُوَ يَدْخُلُهُ كُلَّ يَوْمٍ سَبْعُوْنَ أَلْفَ مَلَكٍ لَا يَعُوْدُوْنَ إِلَيْهِ ] [مسلم، الإیمان، باب الإسراء برسول اللّٰہ صلی اللہ علیہ وسلم إلی السمٰوات… : ۱۶۲ ] ’’پھر ہمارے ساتھ ساتویں آسمان کی طرف چڑھے تو جبریل نے دروازہ کھولنے کے لیے کہا، کہا گیا : ’’کون ہے؟‘‘ کہا : ’’جبریل ہوں۔‘‘ کہا گیا : ’’اور آپ کے ساتھ کون ہے؟‘‘ کہا : ’’محمد صلی اللہ علیہ وسلم ہیں۔‘‘ کہا گیا : ’’کیا ان کی طرف پیغام بھیجا گیا ہے؟‘‘ کہا : ’’ہاں، پیغام بھیجا گیا ہے۔‘‘ تو ہمارے لیے دروازہ کھول دیا گیا تو میں نے ابراہیم صلی اللہ علیہ وسلم کو دیکھا کہ وہ اپنی پیٹھ کی ٹیک بیت المعمور (آباد گھر) کے ساتھ لگا کر بیٹھے ہوئے تھے اور اس گھر میں ہر روز ستر ہزار فرشتے داخل ہوتے ہیں، (اور جو ایک دفعہ داخل ہو جاتے ہیں وہ) پھر دوبارہ کبھی اس میں داخل نہیں ہوتے۔ ‘‘ ¤ بعض مفسرین نے فرمایا اس سے مراد کعبہ ہے جو ہر وقت عمرہ، حج، قیام اور طواف کرنے والوں کے ساتھ آباد رہتا ہے۔ حقیقت یہ ہے کہ {’’ الْبَيْتِ الْمَعْمُوْرِ ‘‘} کے لفظ میں ان دونوں عظیم الشان گھروں کے علاوہ ہر آباد گھر بھی شامل ہے اور یہ اللہ تعالیٰ کی زبردست قدرت کا کھلا نشان ہے کہ اس نے زمین کے ہر حصے کو آباد کر دیا ہے۔ شہروں، بستیوں، میدانوں، صحراؤں، پہاڑوں، سمندروں غرض زمین کے جس حصے کو دیکھو وہیں آبادی نظر آئے گی۔ حتیٰ کہ قطب شمالی، جہاں ہر طرف برف ہی برف ہے، وہاں بھی آبادی ملے گی۔ یعنی یہ آباد گھر (زمین) شاہد ہے کہ جس نے ابتداءً اتنی آبادی پھیلا دی ہے جب کچھ بھی نہیں تھا، تو وہ انھیں دوبارہ زندہ کر کے مجرموں کو عذاب دے سکتا ہے اور یقینا دے گا، کیونکہ اگر وہ ایسا نہ کرے تو انسان کو پیدا کرنا بے مقصد ٹھہرتا ہے، جبکہ ایسا نہیں، فرمایا : « اَيَحْسَبُ الْاِنْسَانُ اَنْ يُّتْرَكَ سُدًى» [ القیامۃ : ۳۶ ] ’’کیا انسان گمان کرتا ہے کہ اسے بغیر پوچھے ہی چھوڑ دیا جائے گا؟‘‘"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {وَ السَّقْفِ الْمَرْفُوْعِ:} اس سے مراد آسمان ہے جو زمین کے لیے چھت کی طرح ہے، جیسا کہ فرمایا : « وَ جَعَلْنَا السَّمَآءَ سَقْفًا مَّحْفُوْظًا وَّ هُمْ عَنْ اٰيٰتِهَا مُعْرِضُوْنَ » [ الأنبیاء : ۳۲ ] ’’اور ہم نے آسمان کو محفوظ چھت بنایا اور وہ اس کی نشانیوں سے منہ پھیرنے والے ہیں۔ ‘‘ جسے اللہ تعالیٰ نے اتنی بلندی پر کسی ستون کے بغیر محض اپنے حکم کے ساتھ تھام کر رکھا ہوا ہے، فرمایا : « اَللّٰهُ الَّذِيْ رَفَعَ السَّمٰوٰتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا » [ الرعد : ۲ ] ’’اللہ وہ ہے جس نے آسمانوں کو بلند کیا بغیر ستونوں کے، جنھیں تم دیکھتے ہو۔‘‘ اور فرمایا : « وَ يُمْسِكُ السَّمَآءَ اَنْ تَقَعَ عَلَى الْاَرْضِ اِلَّا بِاِذْنِهٖ» [ الحج : ۶۵] ’’اور وہ آسمان کو تھام کر رکھتا ہے اس سے کہ زمین پر گر پڑے مگر اس کے اذن سے۔‘‘ پھر اس بلند چھت کو سورج، چاند اور ستاروں کے ساتھ سجا رکھا ہے، فرمایا : «وَ لَقَدْ زَيَّنَّا السَّمَآءَ الدُّنْيَا بِمَصَابِيْحَ » [ الملک : ۵ ] ’’اور بلاشبہ یقینا ہم نے قریب کے آسمان کو چراغوں کے ساتھ زینت بخشی۔‘‘ اللہ تعالیٰ نے متعدد مقامات پر آسمان کے پیدا کرنے کو انسان کی دوبارہ پیدائش کی دلیل کے طور پر ذکر فرمایا ہے، فرمایا : «ءَاَنْتُمْ اَشَدُّ خَلْقًا اَمِ السَّمَآءُ بَنٰىهَا (27) رَفَعَ سَمْكَهَا فَسَوّٰىهَا (28) وَ اَغْطَشَ لَيْلَهَا وَ اَخْرَجَ ضُحٰىهَا » [ النازعات : ۲۷ تا ۲۹ ] ’’کیا پیدا کرنے میں تم زیادہ مشکل ہو یا آسمان؟ اس نے اسے بنایا۔ اس کی چھت کو بلند کیا، پھر اسے برابر کیا۔ اور اس کی رات کو تاریک کر دیا اور اس کے دن کی روشنی کو ظاہر کر دیا۔‘‘"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {وَ الْبَحْرِ الْمَسْجُوْرِ: ’’سَجَرَ يَسْجُرُ‘‘} (ن) کئی معنوں میں آتا ہے۔ {’’سَجَرَ التَّنُّوْرَ‘‘} ’’اس نے تنور ایندھن سے بھر کر بھڑکا دیا۔‘‘ {’’سَجَرَ الْمَاءُ النَّهْرَ‘‘} ’’پانی نے نہر کو بھر دیا۔‘‘ {’’سَجَرَ الْكَلْبَ ({شَدَّهُ بِالسَّاجُوْرِ})‘‘} ’’اس نے کتے کو پٹے کے ساتھ باندھ دیا۔‘‘ اس آیت میں زمین کی سطح پر پائی جانے والی سب سے عظیم مخلوق سمندر کی قسم کھا کر اسے قیامت کے دن عذاب دینے پر قادر ہونے کی دلیل کے طور پر پیش فرمایا ہے۔ لفظ {’’ الْمَسْجُوْرِ ‘‘} لغت کے لحاظ سے جن کیفیتوں کا اظہار کرتا ہے وہ تینوں یہاں مراد لی جا سکتی ہیں۔ ایک یہ کہ وہ لبالب بھرا ہوا ہے، مدتیں گزرنے کے باوجود اس کی لبریزی میں کوئی کمی نہیں آئی۔ قتادہ نے فرمایا : {’’ اَلْمُمْتَلِيْ‘‘} [ طبري : ۳۲۵۹۴، بسند صحیح ] ’’بھرا ہوا۔‘‘ پھر وہ ساکن نہیں بلکہ اس میں ہر وقت ابلنے اور جوش مارنے کی سی کیفیت جاری رہتی ہے۔ مجاہد نے فرمایا : {’’اَلْمُوْقَدُ ‘‘} [ طبري : ۳۲۵۹۲، بسند حسن ] ’’بھڑکایا ہوا۔ ‘‘ مزید دیکھیے سورۂ تکویر کی آیت (۶) : «وَ اِذَا الْبِحَارُ سُجِّرَتْ » کی تفسیر۔ پھر اللہ تعالیٰ نے اسے خشکی پر چڑھ دوڑنے سے باندھ کر رکھا ہوا ہے۔ اگر کبھی اسے طوفان کی صورت میں نکلنے کی تھوڑی سی اجازت ملتی ہے تو شہروں کے شہر صفحۂ ہستی سے ناپید ہو جاتے ہیں۔ طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما کا قول نقل کیا ہے : [ {’’ الْبَحْرِ الْمَسْجُوْرِ ‘‘} اَلْمَحْبُوْسُ ] [ طبري : ۳۲۵۹۶ ]"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) { اِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌ:} یہ جواب قسم ہے، جس کا یقین دلانے کے لیے پانچوں قسمیں کھائی گئی ہیں۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { مَا لَهٗ مِنْ دَافِعٍ:} اس کی تفصیل کے لیے دیکھیے سورئہ روم (۴۳) اور سورۂ معارج( 2،1) کی تفسیر۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) {يَوْمَ تَمُوْرُ السَّمَآءُ مَوْرًا: ’’مَارَ يَمُوْرُ مَوْرًا‘‘} (ن) کسی چیز کا تیزی سے حرکت کرنا اور آگے پیچھے اور دائیں بائیں زور سے ہلنا، الٹ پلٹ ہونا، چکر کھانا۔ {’’ مَوْرًا ‘‘} مصدر تاکید کے لیے ہے، اس لیے ترجمہ ’’سخت لرزنا‘‘ کیا گیا ہے۔ {’’ يَوْمَ ‘‘ ’’ لَوَاقِعٌ ‘‘} کا ظرف ہے، یعنی تیرے رب کا عذاب اس دن واقع ہونے والا ہے جب آسمان میں سخت لرزہ پیدا ہو گا اور وہ نہایت تیزی سے چکر کھائے گا اور آخر کار پھٹ جائے گا۔ قیامت کے دن آسمان پر گزرنے والے احوال کے لیے دیکھیے سورۂ فرقان(۲۵)، رحمن(۳۷)، حاقہ(۱۶)، معارج(۸)، مزمل(۱۸)، مرسلات(۹)، نبا(۱۹)، تکویر(۱۱)، انفطار(۱)، انشقاق(۱)، ابراہیم(۴۸)، انبیاء( ۱۰۴) اور سورۂ زمر(۶۷)۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) { وَ تَسِيْرُ الْجِبَالُ سَيْرًا:} قیامت کے دن پہاڑوں پر گزرنے والے احوال کے لیے دیکھیے سورۂ نبا (۲۰) کی تفسیر۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 12،11) {فَوَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ (11) الَّذِيْنَ هُمْ فِيْ خَوْضٍ يَّلْعَبُوْنَ: ’’خَاضَ يَخُوْضُ خَوْضًا‘‘} (ن) اصل میں پانی کے اندر داخل ہونے کو کہتے ہیں، پھر یہ لفظ فضول اور بے ہودہ اقوال و اعمال میں مشغولیت کے معنی میں استعمال ہونے لگا کہ جس طرح پانی میں جانے والے کو معلوم نہیں ہوتا کہ اس کا پاؤں کہاں پڑے گا، فضول کام یا بات کرنے والا بھی اس سے بے خبر ہوتا ہے کہ اس کا پاؤں کہاں پڑ رہا ہے۔ مزید دیکھیے سورۂ مدثر (۴۵) کی تفسیر۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12،11) {فَوَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ (11) الَّذِيْنَ هُمْ فِيْ خَوْضٍ يَّلْعَبُوْنَ: ’’خَاضَ يَخُوْضُ خَوْضًا‘‘} (ن) اصل میں پانی کے اندر داخل ہونے کو کہتے ہیں، پھر یہ لفظ فضول اور بے ہودہ اقوال و اعمال میں مشغولیت کے معنی میں استعمال ہونے لگا کہ جس طرح پانی میں جانے والے کو معلوم نہیں ہوتا کہ اس کا پاؤں کہاں پڑے گا، فضول کام یا بات کرنے والا بھی اس سے بے خبر ہوتا ہے کہ اس کا پاؤں کہاں پڑ رہا ہے۔ مزید دیکھیے سورۂ مدثر (۴۵) کی تفسیر۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {يَوْمَ يُدَعُّوْنَ اِلٰى نَارِ جَهَنَّمَ دَعًّا: ’’دَعَّ يَدُعُّ‘‘} سختی کے ساتھ دھکیلنا۔ {’’ دَعًّا ‘‘} مصدر مجہول برائے تاکید ہے، بری طرح دھکیلا جانا۔ یعنی فرشتے انھیں نہایت سختی کے ساتھ بری طرح دھکیلتے ہوئے جہنم کی آگ کی طرف لے جائیں گے۔ مزید دیکھیے سورۂ دخان (۴۷)، رحمان (۴۱) ، قمر(۴۸) اور سورۂ مومن( ۷۰ تا ۷۲)۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) { هٰذِهِ النَّارُ الَّتِيْ كُنْتُمْ بِهَا تُكَذِّبُوْنَ:} یعنی فرشتے انھیں ذلیل کرنے کے لیے کہیں گے، یہی وہ جہنم ہے جسے تم دنیا میں مسلسل جھٹلاتے رہے۔ {’’ كَانَ ‘‘} استمرار کے لیے ہے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) { اَفَسِحْرٌ هٰذَاۤ اَمْ اَنْتُمْ لَا تُبْصِرُوْنَ:} یعنی جس طرح تم دنیا میں ہر معجزے کو جادو کہہ کر جھٹلا دیتے تھے، اب اس آگ کو بھی جادو کہہ کر جھٹلا دو، تو بتاؤ کیا یہ جادو ہے؟ یا جس طرح تم دنیا میں کہتے تھے : « وَ مِنْۢ بَيْنِنَا وَ بَيْنِكَ حِجَابٌ » [حٰمٓ السجدۃ : ۵ ] کہ ہمارے اور تمھارے درمیان ایک پردہ ہے، جو کچھ تم بتاتے ہو ہمیں دکھائی نہیں دیتا، تو بتاؤ کیا اب بھی تم نہیں دیکھ رہے؟ یہ ساری بات کفار کو دنیا میں ان کی جھٹلانے کے لیے کہی ہوئی باتیں یاد کروا کر ذلیل کرنے کے لیے کہی جائے گی۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ { اِصْلَوْهَا:} ظاہر ہے وہ یہی کہیں گے کہ پروردگارا ! نہ یہ جادو ہے اور نہ اسے دیکھنے سے ہم اندھے ہیں، بس ایک دفعہ ہمیں واپس جانے دے، ہم کبھی انکار نہیں کریں گے۔ (دیکھیے انعام : ۲۷تا۳۰) مگر حکم ہو گا اب اس میں داخلے کے بغیر چارہ نہیں، اسی میں جھلستے رہو۔ ¤ ➋ { فَاصْبِرُوْۤا اَوْ لَا تَصْبِرُوْا سَوَآءٌ عَلَيْكُمْ:} یعنی تمھارے لیے صبر کرنا یا نہ کرنا دونوں برابر ہیں، کیونکہ نہ صبر سے تمھارے عذاب میں تخفیف ہوگی اور نہ جزع فزع اور واویلا کرنے سے، کیونکہ اب نہ عذاب میں کمی ہو گی، نہ اس میں وقفہ ہو گا اور نہ اس سے نکل سکو گے۔ مزید دیکھیے سورۂ بقرہ (۱۶۲)، زخرف (۷۵) اور سورۂ ابراہیم (۲۱)۔ ¤ ➌ { اِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُوْنَ:} یعنی جس طرح تم نے طے کر رکھا تھا کہ کسی صورت ایمان نہیں لائیں گے، اب اس کی جزا یہی ہے کہ کسی صورت آگ سے نکل نہیں سکو گے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) { اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّ نَعِيْمٍ:} مکذبین کے برے انجام کے ذکر کے بعد متقین کے حسنِ انجام کا ذکر فرمایا۔ مزید دیکھیے سورۂ حجر (۴۵)۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ { ’’ فٰكِهِيْنَ ‘‘ ’’ فَكِهَ يَفْكَهُ فَكَهًا وَ فُكَاهَةً ‘‘} (ع) سے اسم فاعل ہے، خوش ہونا، لطف اٹھانا، لذت لینا، ظریف الطبع ہونا۔ ¤ ➋ { بِمَاۤ اٰتٰىهُمْ رَبُّهُمْ:} اس کی وضاحت کے لیے دیکھیے سورۂ ذاریات(۱۶) کی تفسیر۔ ¤ ➌ { وَ وَقٰىهُمْ رَبُّهُمْ عَذَابَ الْجَحِيْمِ:} اس کی تفصیل کے لیے دیکھیے سورۂ دخان (۵۶) کی تفسیر۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) {كُلُوْا وَ اشْرَبُوْا هَنِيْٓـًٔا … : ’’هَنَأَ يَهْنِئُ وَ يَهْنَأُ وَيَهْنُؤُ الطَّعَامُ‘‘} کا مفہوم صرف مزیدار ہونے کے لفظ سے پورا ادا نہیں ہوتا، بلکہ لغت میں {’’هَنِيْئٌ‘‘} سے مراد وہ چیز ہے جو کسی مشقت کے بغیر آسانی سے حاصل ہو جائے، کھانے میں لذیذ ہو اور گلے سے آسانی سے اتر جائے، اس سے بدہضمی یا بیماری کا کوئی اندیشہ نہ ہو اور اس کے ساتھ کوئی غم یا فکر نہ ہو۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ { مُتَّكِـِٕيْنَ عَلٰى سُرُرٍ مَّصْفُوْفَةٍ:} ابن کثیر رحمہ اللہ نے فرمایا کہ وہ تخت قطار در قطار آمنے سامنے بچھے ہوں گے، جیسا کہ فرمایا : «عَلٰى سُرُرٍ مُّتَقٰبِلِيْنَ» [الصافات : ۴۴] ’’تختوں پر آمنے سامنے بیٹھے ہوں گے۔‘‘ ¤ ➋ { وَ زَوَّجْنٰهُمْ بِحُوْرٍ عِيْنٍ:} اس کے لیے دیکھیے سورۂ دخان (۵۴) کی تفسیر۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ {وَ الَّذِيْنَ اٰمَنُوْا وَ اتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِاِيْمَانٍ: ’’ بِاِيْمَانٍ ‘‘} پر تنوین تنکیر و تقلیل کے لیے ہے، اس لیے ترجمہ ’’اور ان کی اولاد کسی بھی درجے کے ایمان کے ساتھ ان کے پیچھے چلی‘‘ کیا گیا ہے۔ ¤ ➋ { اَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ:} طبری نے علی بن ابی طلحہ کی معتبر سند کے ساتھ ابن عباس رضی اللہ عنھما سے اس کی تفسیر نقل فرمائی ہے : [ إِنَّ اللّٰهَ تَبَارَكَ وَتَعَالٰی يَرْفَعُ لِلْمُؤْمِنِ ذُرِّيَّتَهُ، وَإِنْ كَانُوْا دُوْنَهُ فِي الْعَمَلِ، لِيُقِرَّ اللّٰهُ بِهِمْ عَيْنَهُ ] [ طبري : ۳۲۶۲۲ ] ’’اللہ تعالیٰ مومن کی خاطر اس کی اولاد کو اُونچا لے جائے گا، خواہ وہ عمل میں اس سے کم ہوں گے، تاکہ اللہ تعالیٰ ان کے ذریعے سے اس کی آنکھ ٹھنڈی کرے۔‘‘ اس سے پہلے سورۂ رعد (۲۳) میں بیان فرمایا کہ اہلِ جنت کے آباء اور بیوی بچوں میں سے جو بھی صالح ہوں گے وہ ان کے ساتھ جنت میں جائیں گے اور سورۂ مومن(۸) میں فرمایا کہ فرشتے اللہ تعالیٰ سے ایمان والوں کے حق میں دعا کرتے ہیں کہ وہ انھیں اور ان کے آباء، بیویوں اور اولادوں کو جنت میں داخل کر دے۔ ¤ زیرِ تفسیر آیت میں جنت کے داخلے کے ساتھ ایک اور بڑی خوش خبری دی ہے کہ اگر اولاد کسی نہ کسی درجے کا ایمان لا کر اپنے صالح آباء کے نقشِ قدم پر چلتی رہی ہو تو خواہ وہ ایمان یا عمل کے لحاظ سے اس بلند درجے کے مستحق نہ بھی ہوئے جو ان کے آباء کو حاصل ہو گا، پھر بھی اللہ تعالیٰ انھیں ان کے آباء کے ساتھ ملا دے گا۔ ¤ ➌ { وَ مَاۤ اَلَتْنٰهُمْ مِّنْ عَمَلِهِمْ مِّنْ شَيْءٍ: ’’أَلَتَ يَأْلِتُ أَلْتًا‘‘ (ض) ’’ اَلشَّيْءُ ‘‘} کسی چیزکا کم ہونا۔ {’’أَلَتَ الرَّجُلَ حَقَّهُ‘‘} ’’کسی آدمی کے حق میں کمی کرنا، پورا نہ دینا۔‘‘ یعنی یہ نہیں ہو گا کہ ہم آباء کو ان کے اعلیٰ درجے سے نیچے لا کر ان کی اولاد کے ساتھ ملا دیں، کیونکہ اس سے لازم آتا ہے کہ ان کے عمل کا اجر کم کر دیا جائے۔ اس لیے ہم ان کے عمل میں کسی طرح کمی نہیں کریں گے، بلکہ محض اپنے فضل سے اولاد کا درجہ بڑھا کر آباء کے اعلیٰ درجے میں پہنچا دیں گے۔ ¤ ➍ جس طرح آباء کے عمل کی برکت سے اولاد کے درجات میں اضافہ ہو گا اسی طرح اولاد کی دعا کی بدولت اللہ تعالیٰ آباء پر بھی فضل فرمائے گا۔ ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ اللّٰهَ عَزَّ وَجَلَّ لَيَرْفَعُ الدَّرَجَةَ لِلْعَبْدِ الصَّالِحِ فِي الْجَنَّةِ، فَيَقُوْلُ يَا رَبِّ! أَنّٰی لِيْ هٰذِهِ ؟ فَيَقُوْلُ بِاسْتِغْفَارِ وَلَدِكَ لَكَ ] [ مسند أحمد : 509/2، ح : ۱۰۶۱۰، مسند احمد کے محققین نے اس کی سند کو حسن اور ابن کثیر نے صحیح قرار دیا ہے ] ’’اللہ عز و جل جنت میں صالح بندے کا درجہ بلند فرمائے گا تو وہ کہے گا : ’’اے میرے رب! مجھے یہ درجہ کیسے مل گیا؟‘‘ اللہ تعالیٰ فرمائے گا : ’’تیری اولاد کے تیرے لیے استغفار کی وجہ سے۔‘‘ اس کی تائید اس مشہور حدیث سے ہوتی ہے جو ابو ہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کی، آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ إِلَّا مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُوْ لَهُ ] [مسلم، الوصیۃ، باب ما یلحق الإنسان من الثواب بعد وفاتہ : ۱۶۳۱ ] ’’جب انسان فوت ہو جاتا ہے تو اس کا عمل اس سے کٹ جاتا ہے، سوائے تین اعمال کے، صدقہ جاریہ یا وہ علم جس سے نفع حاصل کیا جاتا رہے یا صالح اولاد جو اس کے لیے دعا کرے ۔‘‘ ¤ ➎ {كُلُّ امْرِئٍۭ بِمَا كَسَبَ رَهِيْنٌ: ’’رَهَنَ يَرْهَنُ رَهْنًا‘‘} (ف) گروی رکھنا۔ {’’ رَهِيْنٌ ‘‘} گروی رکھا ہوا۔ اگر کوئی شخص کسی سے کچھ قرض لے اور قرض دینے والا اپنے حق کی وصولی کے لیے ضمانت کے طور پر اس کی کوئی چیز اپنے پاس رہن (گروی) رکھ لے تو جب تک وہ قرض ادا نہ کرے اس کی گروی رکھی ہوئی چیز چھوڑی نہیں جاتی اور اگر ادا کر ہی نہ سکے تو ضبط کر لی جاتی ہے۔ یہاں اللہ تعالیٰ نے پہلے اپنا فضل بیان فرمایا کہ صالح اولاد کے اعمال ان کے آباء کے درجے کے لائق نہ بھی ہوئے تو انھیں ان کے آباء کے ساتھ ملا دیا جائے گا۔ اب اپنے عدل کا بیان فرمایا کہ کسی شخص کو دوسرے کے گناہ میں نہیں پکڑا جائے گا، بلکہ ہر آدمی اپنے کمائے ہوئے عمل کے بدلے ہی گرفتار ہو گا، خواہ وہ باپ ہو یا بیٹا۔ پھر یا تو آدمی وہ عمل پیش کر کے چھوٹ جائے گا جس کی ادائیگی اس کے ذمے تھی یا پیش نہ کر سکنے کی وجہ سے گرفتار رہے گا۔ مزید دیکھیے سورۂ انعام (۱۶۴)، فاطر (۱۸) اور سورۂ مدثر (۳۸)۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) {وَ اَمْدَدْنٰهُمْ بِفَاكِهَةٍ … :} اس کی تفصیل کے لیے دیکھیے سورۂ صافات (۴۲) کی تفسیر۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ {يَتَنَازَعُوْنَ فِيْهَا كَاْسًا: ’’ كَاْسًا ‘‘} کی وضاحت کے لیے دیکھیے سورۂ صافات (۴۵) کی تفسیر۔ اہلِ جنت ایک دوسرے سے شراب کے پیالے اس لیے نہیں چھینیں جھپٹیں گے کہ وہاں کسی کمی کا یا ختم ہونے کا اندیشہ ہو گا، بلکہ محض خوش طبعی کے طور پر ایسا کریں گے، کیونکہ چھیننے جھپٹنے کا الگ مزا ہے۔ ¤ ➋ { لَا لَغْوٌ فِيْهَا وَ لَا تَاْثِيْمٌ:} دنیا کی شراب میں کئی قباحتیں ہیں، جن میں سب سے بڑی قباحت یہ ہے کہ آدمی کی عقل پر پردہ پڑ جاتا ہے، حالانکہ عقل ہی اسے جانوروں سے امتیاز اور ان پر برتری عطا کرتی ہے۔ پھر وہ نشہ کی حالت میں بکواس کرنے لگتا ہے، گناہ کے کام کر بیٹھتا ہے، حتیٰ کہ بعض اوقات اپنی محرم عورتوں تک کی عزت برباد کر بیٹھتا ہے۔ جنت کی شراب میں دنیا کی شراب والی کوئی قباحت نہیں ہو گی، مگر اس میں وہ تمام خوبیاں بدرجہ اتم موجود ہوں گی جن کی وجہ سے یہ لوگ اس کی تلخی، بدبو اور بعد کے برے اثرات کے باوجود اسے پیتے ہیں۔ مزید دیکھیے سورۂ صافات (۴۷)۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ { وَ يَطُوْفُ عَلَيْهِمْ غِلْمَانٌ لَّهُمْ:} اس کی وضاحت کے لیے دیکھیے سورۂ دہر (۱۹) اور سورۂ واقعہ (18،17) کی تفسیر۔ ¤ ➋ { كَاَنَّهُمْ لُؤْلُؤٌ مَّكْنُوْنٌ:} یعنی ان کی خوب صورتی، سفیدی اور پاکیزگی کا یہ عالم ہو گا جیسے موتی ابھی اپنی سیپ ہی میں محفوظ ہوں، یا جواہرات والی ڈبیا میں اس طرح چھپا کر رکھے ہوئے ہوں کہ نہ ان پر گرد و غبار کا کوئی ذرہ پڑا ہو اور نہ وہ ہاتھ لگنے سے میلے ہوئے ہوں۔ دوسرے لفظوں میں وہ اتنے خوب صورت اور صاف ستھرے ہوں گے کہ چھونے سے میلے ہوتے ہوں گے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {وَ اَقْبَلَ بَعْضُهُمْ عَلٰى بَعْضٍ يَّتَسَآءَلُوْنَ:} یعنی اہلِ جنت ان نعمتوں سے جن کا ذکر اوپر گزرا شاد کام ہوتے ہوئے ایک دوسرے سے سوال کریں گے۔ ان میں سے ہر ایک پوچھنے والا بھی ہو گا اور دوسرے کو جواب دینے والا بھی کہ سناؤ دنیا میں تم پر کیا کچھ گزرا؟ پھر اس کی مصیبتوں اور فتنوں سے بچتے بچاتے یہاں جنت میں کیسے پہنچے؟ اس سے معلوم ہوا کہ انھیں گزشتہ تمام واقعات یاد ہوں گے، چنانچہ وہ اپنی حالت کا ذکر کرتے ہوئے کہیں گے۔ ایک دوسرے سے اس سوال و جواب میں ان کے آباء اور ان کی اولاد کی گفتگو بھی شامل ہے جو ایک درجے میں اکٹھے ہوں گے۔ تو خوشی سے ایک دوسرے سے گزرے ہوئے احوال کے متعلق سوال کریں گے اور موجودہ حالت کے بارے میں بھی کہ اللہ تعالیٰ نے ہم جیسے گناہ گاروں پر اتنا بڑا انعام کیسے کر دیا کہ ہمیں جنت میں داخل فرمایا اور پھر ہم میں سے بعض کے عمل کی کوتاہی کے باوجود سب کو یکجا کر دیا۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) {قَالُوْۤا اِنَّا كُنَّا قَبْلُ فِيْۤ اَهْلِنَا مُشْفِقِيْنَ:} یعنی وہ کہیں گے کہ ہم اس سے پہلے دنیا میں اپنے گھر والوں میں رہتے ہوئے ہر قسم کی آسائشوں کے باوجود ڈرتے رہتے تھے کہ کہیں ہم سے اللہ کی نافرمانی نہ ہو جائے، ہماری نیکیاں نامقبول نہ ہو جائیں اور ہمارے اعمال کی شامت سے ہمارا خاتمہ خراب نہ ہو جائے۔ {’’ فِيْۤ اَهْلِنَا ‘‘} (اپنے گھر والوں میں) کے مفہوم میں یہ بھی شامل ہے کہ ہم اپنے گھر والوں کے بارے میں ڈرتے رہتے تھے کہ وہ اللہ کے نافرمان نہ بن جائیں اور نافرمانی کے نتیجے میں جہنم کا ایندھن نہ بن جائیں، اور یہ بھی کہ ان کی وجہ سے کہیں ہم راہِ راست سے نہ بہک جائیں، ان کی خاطر کمائی کرتے کرتے حرام کاموں کا ارتکاب نہ کر بیٹھیں، انھیں نمازی اور رب تعالیٰ کا فرماں بردار بنانے کی کوشش میں کوتاہی نہ کر بیٹھیں اور ان کی محبت اللہ کی اطاعت پر غالب نہ آ جائے۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) {فَمَنَّ اللّٰهُ عَلَيْنَا وَ وَقٰىنَا عَذَابَ السَّمُوْمِ: ’’ السَّمُوْمِ ‘‘ ’’سَمٌّ‘‘} (زہر) سے مشتق ہے، زہریلی لو۔ اس کی جمع {’’سَمَائِمُ‘‘} آتی ہے۔ بعض کہتے ہیں یہ {’’ مَسَامُّ ‘‘} سے ہے جو جسم کے ہر مسام میں داخل ہو جائے۔ یعنی ہم تو شدید خائف تھے کہ اپنی کوتاہیوں اور نافرمانیوں کی وجہ سے جہنم میں نہ پھینک دیے جائیں، مگر اللہ تعالیٰ نے ہم پر احسان فرمایا اور ہماری خطائیں معاف فرما کر ہمیں جہنم کی زہریلی لو سے بچا لیا۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { اِنَّا كُنَّا مِنْ قَبْلُ نَدْعُوْهُ:} یعنی ہم اس سے پہلے دنیا میں ڈرتے تھے، مگر ڈرنے کے باوجود اس کی رحمت سے کبھی مایوس نہیں ہوئے، بلکہ اپنی امیدیں اسی سے وابستہ رکھیں۔ اس لیے اسی کو پکارتے رہے، اسی سے دعا کرتے رہے اور اسی سے جنت میں داخلے اور جہنم سے پناہ کی درخواست کرتے رہے۔ ¤ ➋ { اِنَّهٗ هُوَ الْبَرُّ الرَّحِيْمُ: ’’إِنَّ‘‘} تعلیل کے لیے آتا ہے، یعنی اس نے ہماری خطائیں معاف فرمائیں، ہمیں جہنم کی زہریلی لو سے بچایا، ہمیں جنت کی نعمتیں عطا کیں اور ہمارے پیاروں کو ہمارے ساتھ یکجا کر دیا، اس لیے کہ وہی ہے جو بے حد احسان کرنے والا اور نہایت رحم والا ہے، ہمیں جو کچھ عطا ہوا وہ محض اسی کے احسان اور رحم کا نتیجہ ہے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ {فَذَكِّرْ فَمَاۤ اَنْتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَّ لَا مَجْنُوْنٍ:} ’’كاہن‘‘ وہ شخص جو شیاطین سے تعلق رکھتا ہے اور ان سے سن کر غیب کی خبریں دیتا ہے، جن میں ایک آدھ وہ سچی خبر بھی ہوتی ہے جو انھوں نے آسمان کے نیچے فرشتوں کی باہمی گفتگو سے چُرائی ہوتی ہے، پھر اس کے ساتھ سو باتیں جھوٹی ملا کر اپنے دوستوں کو بتاتے ہیں۔ ¤ ➋ سورت کے شروع سے قیامت، جزا و سزا اور جنت و جہنم کی تفصیل اور دلائل ذکر کرنے کے بعد فرمایا : {’’ فَذَكِّرْ ‘‘} (پس نصیحت کر) یعنی جب ہم نے یہ سب کچھ آپ کو وحی کے ذریعے سے بتا دیا تو اب آپ کی ذمہ داری ہے کہ اس کے ساتھ تمام لوگوں کو نصیحت کریں اور کفار و مشرکین کی بے ہودہ باتوں اور تہمتوں کی پروا نہ کریں۔ وہ آپ کو کاہن کہیں یا مجنون، آپ اللہ کے فضل سے کسی طرح بھی نہ کاہن ہیں نہ مجنون۔ کہانت یا دیوانگی کی کوئی بھی بات آپ میں ہرگز نہیں پائی جاتی۔ {’’ فَمَاۤ اَنْتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ ‘‘} میں {’’مَا ‘‘} نافیہ کے بعد ’’باء‘‘ نفی کی تاکید کے لیے ہے اور {’’ بِكَاهِنٍ ‘‘} پر تنوین تنکیر کے لیے ہے، اس لیے ترجمہ کیا گیا ہے ’’تو اپنے رب کی مہربانی سے ہرگز نہ کسی طرح کاہن ہے اور نہ کوئی دیوانہ۔‘‘ ¤ ➌ اللہ تعالیٰ نے اور مقامات پر بھی رسول اللہ صلی اللہ علیہ وسلم سے کہانت اور جنون کی نفی فرمائی ہے۔ دیکھیے سورۂ حاقہ (۴۱، ۴۲)، قلم (۲) اور سورۂ تکویر (۲۲)۔ سورۂ شعراء میں یہ بات کہ آپ صلی اللہ علیہ وسلم کاہن نہیں اور یہ کہ کاہن کس طرح کے لوگ ہوتے ہیں، تفصیل سے گزر چکی ہے، دیکھیے سورۂ شعراء کی آیات ( ۲۱۰ تا ۲۲۳) اور ان کی تفسیر۔"
    },
    {
      "ayah": 30,
      "tafsir": "(آیت 30) {اَمْ يَقُوْلُوْنَ شَاعِرٌ نَّتَرَبَّصُ بِهٖ رَيْبَ الْمَنُوْنِ: ’’تَرَبَّصَ يَتَرَبَّصُ‘‘} (تفعّل) ’’آنے والے کسی شر یا خیر کا انتظار کرنا۔‘‘ {’’ الْمَنُوْنِ ‘‘ ’’مَنَّ يَمُنُّ مَنًّا‘‘} (ن) کا معنی ’’قطع کرنا‘‘ ہے۔ {’’ الْمَنُوْنِ ‘‘} بروزن {’’فَعُوْلٌ‘‘} (کاٹنے والا) موت کو کہتے ہیں، کیونکہ وہ زندگی کی رسی کو کاٹ دیتی ہے، اور زمانے کو بھی، کیونکہ وہ بھی زندگی کے ایام کو کاٹتا چلا جاتا ہے۔ {’’ رَيْبَ ‘‘} کا اصل معنی شک اور بے چینی ہے، لیکن جب اس کا استعمال زمانے کے ساتھ ہو تو مراد زمانے کے حوادث ہوتے ہیں، کیونکہ وہ آدمی کو بے چین رکھتے ہیں۔ ¤ یہاں سے اللہ تعالیٰ نے انکار اور تعجب کے انداز میں ان مشرکین کی جہالت کی باتوں کا پندرہ (۱۵) دفعہ لفظ {’’ اَمْ ‘‘} کے ساتھ ذکر فرمایا ہے اور ہر {’’ اَمْ ‘‘} کے بعد سوال کرتے ہوئے ان پر الزام قائم کیا ہے، جس کا جواب ان میں سے کسی کے پاس نہیں۔ چنانچہ اس آیت میں فرمایا : «اَمْ يَقُوْلُوْنَ شَاعِرٌ » ’’یا وہ کہتے ہیں کہ یہ شاعر ہے۔‘‘ کفار کا یہ قول نقل فرما کر تردید کی ضرورت نہیں سمجھی، کیونکہ قرآن مجید کا وجود ہی اس کی تردید کے لیے کافی ہے۔ البتہ ان کی اس بات کا جواب دیا ہے کہ ہم اس پر زمانے کے حوادث کا انتظار کرتے ہیں کہ اس پر کوئی آفت آ جائے، یا اس کی موت کا وقت آ جائے، جس کے ساتھ اس کی دعوت کا سلسلہ ختم ہو جائے۔"
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) {قُلْ تَرَبَّصُوْا فَاِنِّيْ مَعَكُمْ مِّنَ الْمُتَرَبِّصِيْنَ:} اس کا یہ مطلب نہیں کہ انتظار کر کے دیکھ لو، تم ہی مرو گے میں نہیں مروں گا، بلکہ مطلب یہ ہے کہ تم میرا انجام دیکھو میں تمھارا انجام دیکھتا ہوں۔ تمھارا انجام ناکامی اور ہلاکت ہے، میرا انجام کامیابی اور نجات ہے۔"
    },
    {
      "ayah": 32,
      "tafsir": "(آیت 32) {اَمْ تَاْمُرُهُمْ اَحْلَامُهُمْ بِهٰذَاۤ … : ’’ أَحْلَامٌ ‘‘ ’’حِلْمٌ‘‘} کی جمع ہے، جو دراصل غصہ بھڑکنے کے وقت ضبطِ نفس کو کہتے ہیں۔ عقل کو {’’حلم‘‘} اس لیے کہتے ہیں کہ ایسے وقت میں وہی طبیعت پر ضبط کا باعث ہوتی ہے۔ مشرکین اپنے آپ کو بڑا عقل مند باور کرواتے تھے، اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم کے متعلق ان کی تین باتیں ذکر فرمائیں، کاہن، مجنون اور شاعر، پھر ان کی عقلوں پر چوٹ فرمائی کہ کیا کوئی عاقل ایسی بات کہہ سکتا ہے؟ اوّل تو رسول اللہ صلی اللہ علیہ وسلم کی پوری زندگی اور آپ کا لایا ہوا قرآن سب کے سامنے ہے، کوئی شخص جس کی عقل قائم ہو وہ آپ کے متعلق یا قرآن کے متعلق ان میں سے کوئی بات بھی نہیں کہہ سکتا، کیونکہ قرآن کریم کا اور رسولِ کریم صلی اللہ علیہ وسلم کا کہانت، جنون یا شعر کے ساتھ کوئی تعلق ہی نہیں۔ دوسری بات یہ ہے کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے متعلق جو باتیں کہہ رہے ہیں وہ آپس میں اتنی متضاد ہیں کہ ایک شخص میں جمع ہو ہی نہیں سکتیں۔ یہ کیسے ہو سکتا ہے کہ کوئی شخص شاعر بھی ہو، کاہن بھی اور پھر پاگل بھی اور اس کا پیش کیا ہوا کلام شعر بھی ہو، کہانت بھی اور دیوانگی بھی؟ پھر یہ کون سی عقل مندی ہے کہ کسی شاعر یا کاہن یا دیوانے سے اتنے شدید خوف زدہ ہو جاؤ کہ کسی کو اس کی بات نہ سننے دو؟ بھلا آج تک کسی شاعر، کاہن یا دیوانے کی اتنی شدید مخالفت کی گئی ہے جتنی یہ لوگ آپ صلی اللہ علیہ وسلم کی کر رہے ہیں۔ فرمایا، کیا ان کی عقلیں انھیں اس کا حکم دیتی ہیں؟ جواب ذکر نہیں فرمایا، کیونکہ وہ خود بخود ظاہر ہے کہ یہ جو کچھ کہہ رہے ہیں وہ ان کی عقلوں کا فیصلہ نہیں بلکہ بات کچھ اور ہے اور وہ یہ ہے کہ دراصل یہ سرکش لوگ ہیں اور ان کی سرکشی انھیں حق قبول نہیں کرنے دیتی۔"
    },
    {
      "ayah": 33,
      "tafsir": "(آیت 33) {اَمْ يَقُوْلُوْنَ تَقَوَّلَهٗ بَلْ لَّا يُؤْمِنُوْنَ: ’’تَقَوَّلَ يَتَقَوَّلُ تَقَوُّلًا‘‘} (تفعّل) تکلف سے بات بنانا اور گھڑنا۔ {’’فُلَانٌ تَقَوَّلَ عَلٰي فُلَانٍ‘‘} ’’فلاں نے فلاں پر جھوٹ گھڑ دیا۔‘‘ یعنی یا وہ قرآن کے متعلق کہتے ہیں کہ نبی نے یہ کلام اپنے پاس سے بنا کر اللہ کے ذمے لگا دیا ہے۔ اللہ تعالیٰ نے اس پر یہ نہیں فرمایا کہ نہیں یہ نبی کا بنایا ہوا نہیں بلکہ اللہ کا کلام ہے، کیونکہ خود ان کا دل جانتا ہے کہ یہ آپ صلی اللہ علیہ وسلم کا اپنا کلام نہیں ہو سکتا۔ جو لوگ اہلِ زبان ہیں وہ اسے سن کر سمجھ لیتے ہیں کہ یہ انسان کا کلام نہیں ہو سکتا۔ پھر جو شخص رسول اللہ صلی اللہ علیہ وسلم کو جانتا ہے وہ سوچ بھی نہیں سکتا کہ نبوت سے پہلے چالیس برس تک کسی انسان پر بھی جھوٹ نہ باندھنے والا شخص اللہ پر جھوٹ باندھ سکتا ہے۔ اس لیے فرمایا : « بَلْ لَّا يُؤْمِنُوْنَ» یعنی ان کی مخالفت کی وجہ یہ نہیں کہ آپ صلی اللہ علیہ وسلم نے یہ قرآن خود گھڑ لیا ہے، بلکہ اصل بات یہ ہے کہ یہ لوگ مانتے ہی نہیں، انھوں نے فیصلہ کر رکھا ہے کہ ہم کسی صورت ایمان نہیں لائیں گے۔"
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) {فَلْيَاْتُوْا بِحَدِيْثٍ مِّثْلِهٖۤ اِنْ كَانُوْا صٰدِقِيْنَ:} یعنی اگر یہ اسے رسول کا اپنے پاس سے گھڑا ہوا انسانی کلام سمجھتے ہیں تو وہ بھی اس جیسی ایک بات ہی بنا کر لے آئیں، اگر سچے ہیں۔ آخر وہ بھی اہلِ زبان ہیں، انھیں اپنی فصاحت و بلاغت پر ناز ہے، پھر انھیں یہ بھی پیش کش ہے کہ اللہ تعالیٰ کے علاوہ ساری کائنات کو ساتھ ملا کر اس جیسی ایک بات بنا کر لے آئیں۔ قرآن مجید کے ان مقامات پر بھی نظر ڈال لیں، سورۂ بقرہ (۲۳)، یونس (۳۸)، ہود (۱۳) اور بنی اسرائیل (۸۸)۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 36،35) ➊ {اَمْ خُلِقُوْا مِنْ غَيْرِ شَيْءٍ ٔ… :} اس سے پہلے تین سوال یہ ثابت کرنے کے لیے تھے کہ محمد صلی اللہ علیہ وسلم اللہ کے سچے رسول اور قرآن اللہ کی سچی کتاب ہے، اب یہاں سے اللہ تعالیٰ کے وجود، اس کی وحدانیت اور قدرتِ کاملہ کو ثابت کرنے کی بات کا آغاز فرمایا۔ یعنی محمد صلی اللہ علیہ وسلم نے ان کے سامنے جو دعوت پیش کی ہے وہ یہی ہے کہ اللہ تعالیٰ تمھارا خالق ہے، اس لیے تمھیں اسی کی عبادت کرنی چاہیے، اس کے ساتھ کسی اور کو شریک نہیں کرنا چاہیے۔ آخر اس پر ان کے بگڑنے کی کیا کوئی معقول وجہ ہے؟ اگر یہ رب تعالیٰ کو خالق نہیں مانتے تو بتائیں کہ کیا وہ کسی بنانے والے کے بغیر ہی بن گئے ہیں؟ ظاہر ہے یہ ہو ہی نہیں سکتا، کیونکہ سب جانتے ہیں کہ ہر بنی ہوئی چیز کا کوئی بنانے والا ضرور ہوتا ہے۔ یا پھر انھوں نے اپنے آپ کو خود بنا لیا ہے؟ یہ پہلی بات سے بھی زیادہ ناممکن بات ہے، کیونکہ یہ نہیں ہو سکتا کہ ایک ہی چیز خالق بھی ہو اور مخلوق بھی۔ یا پھر یہ بتائیں کہ یہ آسمان و زمین انھوں نے بنائے ہیں؟ ظاہر ہے ایسا بھی نہیں، کیونکہ یہ کائنات اس وقت کی بنی ہوئی ہے جب ان لوگوں کا نام و نشان بھی نہیں تھا۔ ¤ ان دونوں آیتوں میں اللہ تعالیٰ نے تین سوال کیے ہیں جن کا جواب ذکر نہیں فرمایا، کیونکہ وہ بالکل ظاہر ہے کہ نہ یہ لوگ کسی بنانے والے کے بغیر بنے ہیں، نہ یہ اپنے آپ کو خود بنانے والے ہیں اور نہ کائنات ان کی بنائی ہوئی ہے، بلکہ انھیں اور ساری کائنات کو بنانے والا کوئی اور ہے اور وہ اللہ تعالیٰ ہے۔ اس حقیقت کو وہ بھی مانتے تھے، جیسا کہ فرمایا : « وَ لَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَهُمْ لَيَقُوْلُنَّ اللّٰهُ فَاَنّٰى يُؤْفَكُوْنَ» [ الزخرف : ۸۷ ] ’’اور یقینا اگر تو ان سے پوچھے کہ انھیں کس نے پیدا کیا تو بلاشبہ ضرور کہیں گے کہ اللہ نے ،پھر کہاں بہکائے جاتے ہیں۔ ‘‘ اور فرمایا : «وَ لَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ لَيَقُوْلُنَّ اللّٰهُ » [ لقمان : ۲۵ ] ’’اوربلاشبہ اگر تو ان سے پوچھے کہ آسمانوں کو اور زمین کو کس نے پیدا کیا تو ضرور ہی کہیں گے کہ اللہ نے۔‘‘ ¤ ➋ { بَلْ لَّا يُوْقِنُوْنَ:} یعنی بات یہ نہیں کہ یہ لوگ اللہ تعالیٰ کو اپنا خالق نہیں مانتے اور اس کا اقرار نہیں کرتے، بلکہ اصل یہ ہے کہ اقرار کے باوجود انھیں اس بات کا یقین نہیں ہے، کیونکہ اگر انھیں واقعی یقین ہوتا کہ ہمارا خالق اللہ تعالیٰ ہے تو اسی کی عبادت کرتے، نہ اس کے ساتھ کسی کو شریک بناتے اور نہ اس کی طرف دعوت دینے والے کی اس طرح مخالفت کرتے۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36،35) ➊ {اَمْ خُلِقُوْا مِنْ غَيْرِ شَيْءٍ ٔ… :} اس سے پہلے تین سوال یہ ثابت کرنے کے لیے تھے کہ محمد صلی اللہ علیہ وسلم اللہ کے سچے رسول اور قرآن اللہ کی سچی کتاب ہے، اب یہاں سے اللہ تعالیٰ کے وجود، اس کی وحدانیت اور قدرتِ کاملہ کو ثابت کرنے کی بات کا آغاز فرمایا۔ یعنی محمد صلی اللہ علیہ وسلم نے ان کے سامنے جو دعوت پیش کی ہے وہ یہی ہے کہ اللہ تعالیٰ تمھارا خالق ہے، اس لیے تمھیں اسی کی عبادت کرنی چاہیے، اس کے ساتھ کسی اور کو شریک نہیں کرنا چاہیے۔ آخر اس پر ان کے بگڑنے کی کیا کوئی معقول وجہ ہے؟ اگر یہ رب تعالیٰ کو خالق نہیں مانتے تو بتائیں کہ کیا وہ کسی بنانے والے کے بغیر ہی بن گئے ہیں؟ ظاہر ہے یہ ہو ہی نہیں سکتا، کیونکہ سب جانتے ہیں کہ ہر بنی ہوئی چیز کا کوئی بنانے والا ضرور ہوتا ہے۔ یا پھر انھوں نے اپنے آپ کو خود بنا لیا ہے؟ یہ پہلی بات سے بھی زیادہ ناممکن بات ہے، کیونکہ یہ نہیں ہو سکتا کہ ایک ہی چیز خالق بھی ہو اور مخلوق بھی۔ یا پھر یہ بتائیں کہ یہ آسمان و زمین انھوں نے بنائے ہیں؟ ظاہر ہے ایسا بھی نہیں، کیونکہ یہ کائنات اس وقت کی بنی ہوئی ہے جب ان لوگوں کا نام و نشان بھی نہیں تھا۔ ¤ ان دونوں آیتوں میں اللہ تعالیٰ نے تین سوال کیے ہیں جن کا جواب ذکر نہیں فرمایا، کیونکہ وہ بالکل ظاہر ہے کہ نہ یہ لوگ کسی بنانے والے کے بغیر بنے ہیں، نہ یہ اپنے آپ کو خود بنانے والے ہیں اور نہ کائنات ان کی بنائی ہوئی ہے، بلکہ انھیں اور ساری کائنات کو بنانے والا کوئی اور ہے اور وہ اللہ تعالیٰ ہے۔ اس حقیقت کو وہ بھی مانتے تھے، جیسا کہ فرمایا : « وَ لَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَهُمْ لَيَقُوْلُنَّ اللّٰهُ فَاَنّٰى يُؤْفَكُوْنَ» [ الزخرف : ۸۷ ] ’’اور یقینا اگر تو ان سے پوچھے کہ انھیں کس نے پیدا کیا تو بلاشبہ ضرور کہیں گے کہ اللہ نے ،پھر کہاں بہکائے جاتے ہیں۔ ‘‘ اور فرمایا : «وَ لَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ لَيَقُوْلُنَّ اللّٰهُ » [ لقمان : ۲۵ ] ’’اوربلاشبہ اگر تو ان سے پوچھے کہ آسمانوں کو اور زمین کو کس نے پیدا کیا تو ضرور ہی کہیں گے کہ اللہ نے۔‘‘ ¤ ➋ { بَلْ لَّا يُوْقِنُوْنَ:} یعنی بات یہ نہیں کہ یہ لوگ اللہ تعالیٰ کو اپنا خالق نہیں مانتے اور اس کا اقرار نہیں کرتے، بلکہ اصل یہ ہے کہ اقرار کے باوجود انھیں اس بات کا یقین نہیں ہے، کیونکہ اگر انھیں واقعی یقین ہوتا کہ ہمارا خالق اللہ تعالیٰ ہے تو اسی کی عبادت کرتے، نہ اس کے ساتھ کسی کو شریک بناتے اور نہ اس کی طرف دعوت دینے والے کی اس طرح مخالفت کرتے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) ➊ {اَمْ عِنْدَهُمْ خَزَآىِٕنُ رَبِّكَ … :} یہ کفار کے اس اعتراض کا جواب ہے کہ آپ صلی اللہ علیہ وسلم ہی کو کیوں رسول بنایا گیا، مکہ اور طائف کے سرداروں میں سے کسی کو رسالت کے لیے کیوں نہ چنا گیا؟ فرمایا، یہ فیصلہ کرنا کہ کس کو رسول بنا کر بھیجا جائے مالک کا کام ہے۔ اب یہ لوگ اگر اللہ تعالیٰ کے بنائے ہوئے رسول کا انکار کرتے ہیں تو اس کا مطلب یہ ہے کہ یا تو تیرے رب کے خزانوں کے مالک یہ ہیں، جسے چاہیں دیں جسے چاہیں نہ دیں، یا یہ کہ مالک تو اللہ تعالیٰ ہی ہے مگر اس پر حکم انھی کا چلتا ہے۔اب یہ خود ہی بتائیں کہ ان دونوں میں سے ان کا دعویٰ کیا ہے؟ مزید دیکھیے سورۂ ص(۸ تا ۱۰) اور سورۂ زخرف(۳۱،۳۲)۔ خلاصہ یہ کہ کفار کے پاس رسول اللہ صلی اللہ علیہ وسلم کی رسالت سے انکار کی کوئی عقلی دلیل نہیں۔ ¤ ➋ آیت کی تفسیر اس طرح بھی ہو سکتی ہے کہ یا یہ لوگ اس لیے اکیلے رب کی عبادت نہیں کرتے اور محمد صلی اللہ علیہ وسلم کو رسول نہیں مانتے کہ تیرے رب کے خزانوں کے مالک وہی ہیں، یا ان پر انھی کا حکم چلتا ہے، اس لیے وہ اپنی مرضی کے مالک ہیں، جو چاہیں کرتے پھریں؟ ظاہر ہے ایسا بھی ہرگز نہیں۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) {اَمْ لَهُمْ سُلَّمٌ يَّسْتَمِعُوْنَ فِيْهِ … :} یا ان کے پاس کوئی سیڑھی ہے جس پر چڑھ کر وہ عالمِ بالا کی طرف کان لگائے رکھتے ہیں اور وہاں سے سن آئے ہیں کہ جو کچھ وہ کہہ رہے ہیں وہی حق ہے اور یہ بھی سن آئے ہیں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول نہیں اور نہ اس نے انھیں بھیجا ہے، بلکہ انھوں نے قرآن خود ہی تصنیف کر کے اللہ تعالیٰ کے ذمہ لگا دیا ہے۔ اگر کسی کا یہ دعویٰ ہے تو وہ اس کی واضح دلیل پیش کرے، جس سے معلوم ہو کہ وہ واقعی آسمان تک گیا تھا اور وہاں اس نے واقعی اللہ تعالیٰ کی اور فرشتوں کی باتیں سنی ہیں۔ دیکھیے سورۂ احقاف (۴)اور سورۂ فاطر (۴۰) اس آیت کا خلاصہ یہ ہے کہ کفار کے پاس رسول اللہ صلی اللہ علیہ وسلم پر ایمان نہ لانے کے لیے کوئی نقلی دلیل بھی نہیں۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 39) {اَمْ لَهُ الْبَنٰتُ وَ لَكُمُ الْبَنُوْنَ:} پھر جب انھیں عالمِ بالا تک رسائی نہیں تو انھیں کیسے معلوم ہو گیا کہ اللہ تعالیٰ کو کائنات کا نظام چلانے کے لیے اولاد کی ضرورت ہے اور انھوں نے یہ کیسے طے کر دیا کہ اولاد بناتے وقت اس نے اپنے لیے بیٹوں کے بجائے بیٹیوں کا چناؤ کیا ہے اور انھیں بیٹوں کے لیے منتخب کیا ہے؟ حالانکہ یہ لوگ اپنے لیے کبھی بیٹیاں پسند نہیں کرتے۔ دیکھیے سورۂ نحل (۵۷ تا ۶۰) اور سورۂ زخرف (۱۶ تا ۱۸)۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40) { اَمْ تَسْـَٔلُهُمْ اَجْرًا … : ’’ اَلْغُرْمُ وَ الْغَرَامَةُ وَ الْمَغْرَمُ‘‘} تاوان، چٹی، جو مال آدمی کو نہ چاہنے کے باوجود دینا پڑ جائے۔ {’’ اَجْرًا ‘‘} پر تنوین تنکیر کے لیے ہے، کسی بھی طرح کی اجرت۔ رسول اللہ صلی اللہ علیہ وسلم کی دعوت قبول نہ کرنے کی ایک وجہ یہ ہو سکتی تھی کہ آپ ان سے کسی طرح کی اجرت کا مطالبہ کرتے ہوں اور وہ تاوان سمجھ کر بوجھ برداشت کرنے کے لیے تیار نہ ہوں۔ جب آپ ان سے کسی طرح کی اجرت یا معاوضے کا مطالبہ نہیں کرتے بلکہ اپنی مزدوری صرف اللہ تعالیٰ کے ذمے سمجھتے ہیں اور اپنی کمائی یا کاروبار کی بھی پروا نہ کرتے ہوئے ہر وقت ان کی خیرخواہی کے لیے ان کے پیچھے پھرتے ہیں تو پھر وہ آپ سے دور کیوں بھاگتے ہیں؟ مزید دیکھیے سورۂ مومنون (۷۲)۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) {اَمْ عِنْدَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُوْنَ: ’’ عِنْدَهُمْ‘‘} پہلے لانے سے حصر پیدا ہو گیا ہے، اس لیے ترجمہ ’’یا انھی کے پاس غیب ہے‘‘ کیا گیا ہے۔ یعنی یا پھر انھیں آپ کے اتباع کی ضرورت اس لیے نہیں کہ سارا غیب انھی کے پاس ہے اور وہ اپنے معاملات کے فیصلے خود ہی وہاں سے لکھ لیتے ہیں، اس لیے انھیں اس کتاب کی ضرورت ہی نہیں جو آپ صلی اللہ علیہ وسلم اللہ تعالیٰ کی طرف سے لے کر آئے ہیں۔ یہاں بھی سوال ہی پر اکتفا فرمایا ہے، کیونکہ اس کا جواب ظاہر ہے کہ سارے غیب کا بلاشرکت غیرے مالک ہونا تو بہت ہی دور ہے، یہ تو غیب کے ایک ذرے سے بھی آگاہ نہیں۔ پھر یہ اللہ کی کتاب اور اس کے رسول سے کس طرح مستغنی ہو سکتے ہیں۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) { اَمْ يُرِيْدُوْنَ كَيْدًا فَالَّذِيْنَ كَفَرُوْا … : ’’ الْمَكِيْدُوْنَ ‘‘ ’’كَادَ يَكِيْدُ كَيْدًا‘‘} سے اسم مفعول ہے، جو کسی کی چال میں آ چکے ہوں۔ یعنی یا وہ آپ کے خلاف کوئی چال چلنا چاہتے ہیں تو سن لیں کہ وہ لوگ جو حق کا انکار کر رہے ہیں، یا اس کے خلاف سازشیں کر رہے ہیں اور کئی طرح کی چالیں چل رہے ہیں وہ خود ہی چال میں آنے والے ہیں۔ چنانچہ کفار نے آپ صلی اللہ علیہ وسلم کی ہجرت کے وقت یا کسی بھی موقع پر آپ صلی اللہ علیہ وسلم کے خلاف جو بھی سازش کی وہ ناکام ہوئی اور ان کی ہر چال انھی پر الٹی پڑی اور کفر پر اڑنے والے بدر اور دوسرے مواقع پر بری طرح قتل ہوئے۔ سعید روحوں نے اسلام قبول کر لیا اور پورا جزیرۂ عرب اسلام کے زیر نگیں آ گیا۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ { اَمْ لَهُمْ اِلٰهٌ غَيْرُ اللّٰهِ :} یا پھر اللہ تعالیٰ کے سوا ان کا کوئی اور معبود ہے جو عبادت کا مستحق ہے اور نفع و نقصان کا اختیار رکھتا ہے۔ ¤ ➋ { سُبْحٰنَ اللّٰهِ عَمَّا يُشْرِكُوْنَ: ’’مَا‘‘} موصولہ بھی ہو سکتا ہے اور مصدریہ بھی۔ موصولہ ہو تو معنی ہے ’’پاک ہے اللہ اس سے جو وہ شریک بناتے ہیں۔‘‘ مصدریہ ہو تو معنی ہے ’’پاک ہے اللہ ان کے شریک بنانے سے۔‘‘ یعنی اللہ تعالیٰ ان کے شرک سے اور بنائے ہوئے شریکوں سے پاک ہے، اس کا کوئی شریک نہیں۔ ان لوگوں کے بنائے ہوئے معبودوں کا حقیقت میں کوئی وجود نہیں، یہ محض اپنے وہم و گمان کی پوجا کر رہے ہیں۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) {وَ اِنْ يَّرَوْا كِسْفًا مِّنَ السَّمَآءِ سَاقِطًا … : ’’ كِسْفًا ‘‘} سین کی جزم کے ساتھ واحد ہے، ٹکڑا۔ بعض کہتے ہیں جمع ہے، جیسا کہ {’’سِدْرَةٌ ‘‘} کی جمع {’’سِدْرٌ‘‘} ہے، ٹکڑے۔ (اعراب القرآن از درویش) یعنی ان لوگوں نے ہر قیمت پر انکار کا تہیہ کر رکھا ہے اور ایمان لانے کی شرط کے طور پر جن معجزات کا مطالبہ کرتے ہیں وہ صرف لاجواب کرنے کے لیے کرتے ہیں۔ اگر ان کے تمام طلب کردہ معجزات بھی دکھا دیے جائیں پھر بھی یہ ایمان نہیں لائیں گے۔ (دیکھیے انعام : ۱۱۔ یونس : 97،96) پھر یا تو اسے آنکھوں پر جادو کہہ کر ردّ کر دیں گے (دیکھیے حجر : ۱۵) یا کوئی اور بہانہ بنا کر ایمان لانے سے انکار کر دیں گے۔ مثلاً ان کا مطالبہ ہے کہ ہم پر آسمان کو ٹکڑے کر کے گرا دے (دیکھیے بنی اسرائیل : ۹۲) اگر ہم ان کا یہ مطالبہ بھی پورا کر دیں اور آسمان کا کوئی ٹکڑا گرا دیں تو اسے تہ بہ تہ بادل کہہ کر ایمان لانے سے انکار کر دیں گے، حالانکہ وہ دیکھ رہے ہوں گے اور انھیں یقین ہو گا کہ وہ تہ بہ تہ بادل نہیں ہے۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 46،45) {فَذَرْهُمْ حَتّٰى يُلٰقُوْا يَوْمَهُمُ الَّذِيْ فِيْهِ يُصْعَقُوْنَ … :} اس دن سے مراد قیامت کا دن ہے جب صور میں پھونک کے ساتھ سب لوگ بے ہوش ہو کر مر جائیں گے۔ (دیکھیے سورۂ زمر : ۶۸) مزید دیکھیے سورۂ زخرف (۸۳) اور سورۂ معارج (۴۲،۴۳)۔\n(1) «وان للذین ظلموا عذاباً دون ذلک» : یعنی کفار کے لئے قیامت سے پہلے بھی ایک عذاب ہے ۔ اس سے مراد دنیا میں آنے والے عذاب ہیں۔ دیکھیے سورة توبہ [١٢٦] اور سورة سجدہ [٢١] کی تفسیر۔ ¤ ¤ (2) « ولکن اکثرھم لایعلمون» : یعنی دنیا میں ان پر مختلف مصیبتیں اور عذب آتے ہیں، جن کا مقصد یہ ہوتا ہے کہ وہ پلٹ آئیں اور توبہ کر لیں، مگر ان میں سے زیادہ تر لوگ نہیں جانتے کہ ہم پر یہ مصیبتیں کیوں آئیں۔ اس لئے جیسے ہی گرفت ڈھیلی ہوتی ہے پہلے کی طرح بلکہ اس سے بھی زیادہ نافرمان بن جاتے ہیں اور عذاب کو نہ عذاب سمجھتے ہیں نہ تنبیہ، بلکہ وہ عذاب کا کوئی سائنسی سبب اور نافرمانی پر جمے رہنے کا کوئی نہ کوئی بہانہ ڈھونڈ لیتے ہیں۔ بعض اہل علم نے یہاں «ون ذلک» ”قیامت سے پہلے“ کے الفاظ میں دنیا کے عذابوں کے علاوہ موت کے فرشتوں کی مار کو اور عذاب قبر کو بھی شامل فرمایا ہے۔"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46،45) {فَذَرْهُمْ حَتّٰى يُلٰقُوْا يَوْمَهُمُ الَّذِيْ فِيْهِ يُصْعَقُوْنَ … :} اس دن سے مراد قیامت کا دن ہے جب صور میں پھونک کے ساتھ سب لوگ بے ہوش ہو کر مر جائیں گے۔ (دیکھیے سورۂ زمر : ۶۸) مزید دیکھیے سورۂ زخرف (۸۳) اور سورۂ معارج (۴۲،۴۳)۔\n(1) «وان للذین ظلموا عذاباً دون ذلک» : یعنی کفار کے لئے قیامت سے پہلے بھی ایک عذاب ہے ۔ اس سے مراد دنیا میں آنے والے عذاب ہیں۔ دیکھیے سورة توبہ [١٢٦] اور سورة سجدہ [٢١] کی تفسیر۔ ¤ ¤ (2) « ولکن اکثرھم لایعلمون» : یعنی دنیا میں ان پر مختلف مصیبتیں اور عذب آتے ہیں، جن کا مقصد یہ ہوتا ہے کہ وہ پلٹ آئیں اور توبہ کر لیں، مگر ان میں سے زیادہ تر لوگ نہیں جانتے کہ ہم پر یہ مصیبتیں کیوں آئیں۔ اس لئے جیسے ہی گرفت ڈھیلی ہوتی ہے پہلے کی طرح بلکہ اس سے بھی زیادہ نافرمان بن جاتے ہیں اور عذاب کو نہ عذاب سمجھتے ہیں نہ تنبیہ، بلکہ وہ عذاب کا کوئی سائنسی سبب اور نافرمانی پر جمے رہنے کا کوئی نہ کوئی بہانہ ڈھونڈ لیتے ہیں۔ بعض اہل علم نے یہاں «ون ذلک» ”قیامت سے پہلے“ کے الفاظ میں دنیا کے عذابوں کے علاوہ موت کے فرشتوں کی مار کو اور عذاب قبر کو بھی شامل فرمایا ہے۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) ➊ {وَ اِنَّ لِلَّذِيْنَ ظَلَمُوْا عَذَابًا دُوْنَ ذٰلِكَ :} یعنی کفار کے لیے قیامت سے پہلے بھی ایک عذاب ہے۔ اس سے مراد دنیا میں آنے والے عذاب ہیں۔ دیکھیے سورۂ توبہ (۱۲۶) اور سورۂ سجدہ (۲۱) کی تفسیر۔ ¤ ➋ { وَ لٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ:} یعنی دنیا میں ان پر مختلف مصیبتیں اور عذاب آتے ہیں، جن کا مقصد یہ ہوتا ہے کہ وہ پلٹ آئیں اور توبہ کر لیں، مگر ان میں سے زیادہ تر لوگ نہیں جانتے کہ ہم پر یہ مصیبتیں کیوں آئیں۔ اس لیے جیسے ہی گرفت ڈھیلی ہوتی ہے پہلے کی طرح بلکہ اس سے بھی زیادہ نافرمان بن جاتے ہیں اور عذاب کو نہ عذاب سمجھتے ہیں نہ تنبیہ، بلکہ وہ عذاب کا کوئی سائنسی سبب اور نافرمانی پر جمے رہنے کا کوئی نہ کوئی بہانہ ڈھونڈ لیتے ہیں۔ بعض اہلِ علم نے یہاں {’’ دُوْنَ ذٰلِكَ ‘‘} (قیامت سے پہلے) کے الفاظ میں دنیا کے عذابوں کے علاوہ موت کے فرشتوں کی مار کو اور عذابِ قبر کو بھی شامل فرمایا ہے۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) ➊ {وَ اصْبِرْ لِحُكْمِ رَبِّكَ:} یہاں ’’لام‘‘ {’’عَلٰي‘‘} کے معنی میں ہو تو مطلب یہ ہے کہ اپنے رب کے حکم پر عمل کرنے میں صبر و استقامت اختیار کرو اور دعوت کا کام جاری رکھو، جیسے فرمایا : « وَ اصْبِرْ عَلٰى مَا يَقُوْلُوْنَ » [ المزمل : ۱۰ ] ’’اور اس پر صبر کر جو وہ کہتے ہیں۔‘‘ اور اگر {’’إِلٰي‘‘} کے معنی میں ہو تو مطلب یہ ہے کہ ان ظالموں کے بارے میں اللہ تعالیٰ کا فیصلہ آنے تک صبر کرو، جیسا کہ فرمایا : « وَ اصْبِرْ حَتّٰى يَحْكُمَ اللّٰهُ» [یونس : ۱۰۹] ’’اور صبر کر یہاں تک کہ اللہ فیصلہ کر دے۔‘‘ اس مقام پر حرف ’’لام‘‘ لانے سے ایسا جامع مفہوم پیدا ہو رہا ہے جو کوئی اور حرف لانے سے پیدا نہیں ہوتا۔ {’’وَاصْبِرْ لِحُكْمِنَا ‘‘} (اور ہمارے حکم پر صبر کر) کے بجائے فرمایا : «وَ اصْبِرْ لِحُكْمِ رَبِّكَ » (اور اپنے رب کے حکم پر صبر کر) مطلب یہ ہے کہ اس کے رب ہونے کا تقاضا ہے کہ وہ تیری نگہداشت اور حفاظت کرے۔ ¤ ➋ { فَاِنَّكَ بِاَعْيُنِنَا:} کیونکہ تو ہماری آنکھوں کے سامنے ہے، ہم ہر وقت تجھے دیکھ رہے ہیں اور تیری نگرانی اور حفاظت کر رہے ہیں، کسی کی مجال نہیں کہ تجھے نقصان پہنچا سکے۔ مزید دیکھیے سورۂ ہود (۳۷)۔ ¤ ➌ { وَ سَبِّحْ بِحَمْدِ رَبِّكَ:} صبر کے ساتھ تسبیح و تحمید یعنی نماز کی تاکید فرمائی، کیونکہ ان دونوں کے ساتھ آدمی کو اللہ تعالیٰ کی طرف سے مدد حاصل ہوتی ہے، جیسا کہ فرمایا : « وَ اسْتَعِيْنُوْا بِالصَّبْرِ وَ الصَّلٰوةِ» [ البقرۃ : ۴۵ ] ’’اور صبر اور نماز کے ساتھ مدد طلب کرو۔‘‘ ¤ ➍ {’’ سَبِّحْ بِحَمْدِ رَبِّكَ ‘‘ } کا لفظی معنی اگرچہ یہ ہے کہ ’’اپنے رب کی حمد کے ساتھ تسبیح کر‘‘ مگر اس سے مراد نماز ہے۔ دلیل اور تفصیل کے لیے دیکھیے سورۂ طٰہٰ (۱۳۰) کی تفسیر۔ ¤ ➎ {حِيْنَ تَقُوْمُ:} اکثر مفسرین نے {’’ سَبِّحْ بِحَمْدِ رَبِّكَ ‘‘} سے ’’سبحان الله‘‘ اور ’’الحمد لله‘‘ کہنا مراد لیا ہے اور {’’ حِيْنَ تَقُوْمُ ‘‘} سے مراد بعض نے یہ لیا ہے کہ نیند کے بعد بستر سے اٹھتے وقت {’’سُبْحَانَ اللّٰهِ،اَلْحَمْدُ لِلّٰهِ‘‘ } کہو۔ بعض نے اس سے مجلس سے اٹھتے وقت کفارۂ مجلس کی دعا {’’ سُبْحَانَكَ اللّٰهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلٰهَ إِلاَّ أَنْتَ أَسْتَغْفِرُكَ وَ أَتُوْبُ إِلَيْكَ ‘‘} مراد لی ہے اور بعض نے فرمایا کہ اس سے مراد نماز شروع کرتے وقت {’’سُبْحَانَكَ اللّٰهُمَّ وَبِحَمْدِكَ‘‘ } (دعائے استفتاح) ہے۔ بعض نے کہا کہ ہر خطاب کے لیے کھڑے ہوتے وقت تسبیح و تحمید کرنا مراد ہے۔ مگر انھی مفسرین نے اگلی آیت {’’ وَ مِنَ الَّيْلِ فَسَبِّحْهُ ‘‘} میں تسبیح سے مراد نمازِ تہجد اور {’’ وَ اِدْبَارَ النُّجُوْمِ ‘‘} سے مراد نمازِ فجر لی ہے۔ حق یہ ہے کہ {’’سَبَّحَ‘‘} کا جو معنی {’’ مِنَ الَّيْلِ ‘‘} اور {’’ اِدْبَارَ النُّجُوْمِ ‘‘} کے ساتھ کیا گیا ہے وہی معنی {’’ حِيْنَ تَقُوْمُ ‘‘} کے ساتھ ہونا چاہیے۔ طبری نے یہاں پہلے دو قول ذکر فرمائے ہیں، ایک یہ کہ نیند سے اٹھ کر تسبیح و تحمید کرے، دوسرا یہ کہ جب فرض نماز کے لیے کھڑا ہو تو {’’سُبْحَانَكَ اللّٰهُمَّ وَبِحَمْدِك…‘‘} دعا پڑھے۔ پھر فرمایا : ’’صواب کے سب سے زیادہ قریب ان کا قول ہے جو کہتے ہیں کہ {’’ سَبِّحْ بِحَمْدِ رَبِّكَ ‘‘} کا معنی ہے {’’صَلِّ بِحَمْدِ رَبِّكَ حِيْنَ تَقُوْمُ مِنْ مَنَامِكَ وَ ذٰلِكَ نَوْمُ الْقَائِلَةِ، وَ إِنَّمَا عَنٰي صَلَاةَ الظُّهْرِ‘‘} یعنی اپنے رب کی حمد کے ساتھ نماز پڑھ جب تو اپنی نیند سے اٹھے۔ نیند سے مراد دوپہر کی نیند ہے اور نماز سے مراد ظہر کی نماز ہے۔‘‘ فرماتے ہیں : ’’ہم نے اس قول کو اس لیے ترجیح دی ہے کہ نماز شروع کرتے وقت {’’سُبْحَانَكَ اللّٰهُمَّ‘‘} پڑھنا کسی کے نزدیک بھی فرض نہیں اور ہم نے دوپہر کی نیند سے اٹھنا اس لیے مراد لیا ہے کہ لوگوں کا معروف نیند سے اٹھنا یا تو رات کی نیند کے بعد ہوتا ہے اور وہ نمازِ فجر کا وقت ہے یا دوپہر کی نیند کے بعد ہوتا ہے اور وہ نمازِ ظہر کا وقت ہے۔ تو جب {’’ سَبِّحْ بِحَمْدِ رَبِّكَ حِيْنَ تَقُوْمُ ‘‘} کے بعد {’’ اِدْبَارَ النُّجُوْمِ ‘‘} کے وقت تسبیح کا حکم دیا جو رات کی نیند سے اٹھ کر نمازِ فجر کی دو رکعتیں ہیں، تو معلوم ہوا کہ {’’ حِيْنَ تَقُوْمُ ‘‘} سے مراد وہ نماز ہے جو رات کی نیند سے اٹھنے کے علاوہ ہے اور وہ نمازِ ظہر ہے۔ ‘‘ (طبری) بعض حضرات نے لکھا ہے کہ طبری نے اس قول کو ترجیح دی ہے کہ {’’ حِيْنَ تَقُوْمُ ‘‘} سے مراد نیند سے اٹھ کر تسبیح و تحمید ہے، لیکن اوپر کی تفصیل سے معلوم ہوا کہ طبری کی ترجیح یہ نہیں ہے۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { وَ مِنَ الَّيْلِ فَسَبِّحْهُ:} اس سے مراد مغرب اور عشاء ہے۔ ¤ ➋ {وَ اِدْبَارَ النُّجُوْمِ:} اس سے مراد فجر کی فرض نماز ہے۔ بعض حضرات نے اس سے مراد فجر کی نماز سے پہلے کی دو رکعتیں لی ہیں، مگر امام طبری فرماتے ہیں کہ یہاں {’’ فَسَبِّحْهُ ‘‘} امر کا صیغہ ہے جو فرض کے لیے ہے، اس لیے اس سے مراد فرض رکعتیں ہیں۔ ¤ خلاصہ یہ ہے کہ ان آیات میں پانچوں نمازوں کا حکم ہے، اس طرح کہ {’’ حِيْنَ تَقُوْمُ ‘‘} میں ظہر و عصر کا، {’’ مِنَ الَّيْلِ ‘‘} میں مغرب و عشاء کا اور {’’ اِدْبَارَ النُّجُوْمِ ‘‘} میں فجر کی نماز کا ذکر ہے۔ (واللہ اعلم)"
    }
  ]
}