{
  "surah": "Al-Qamar",
  "surah_number": 54,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "عبید اللہ بن عبداللہ بیان کرتے ہیں کہ عمر بن خطاب رضی اللہ عنہ نے ابو واقد لیثی رضی اللہ عنہ سے پوچھا : ’’ رسول اللہ صلی اللہ علیہ وسلم عید الاضحیٰ اور عید الفطر میں کیا قراء ت فرماتے تھے؟ ‘‘انھوں نے کہا : ’’آپ صلی اللہ علیہ وسلم ان دونوں میں {’’ قٓ وَ الْقُرْاٰنِ الْمَجِيْدِ ‘‘} اور {’’ اِقْتَرَبَتِ السَّاعَةُ وَ انْشَقَّ الْقَمَرُ ‘‘} کی قراءت فرمایا کرتے تھے۔‘‘ [ مسلم، صلاۃ العیدین، باب ما یقرأ بہ في صلاۃ العیدین : ۸۹۱ ] ¤ (آیت 1) ➊ { اِقْتَرَبَتِ السَّاعَةُ: ’’ اِقْتَرَبَتْ ‘‘ ’’قَرُبَ يَقْرُبُ‘‘} (ک،ع) میں سے باب افتعال کا ماضی معلوم ہے۔ حروف میں اضافے سے معنی میں مبالغہ پیدا ہوتا ہے، جیسے {’’قَدَرَ‘‘} اور {’’اِقْتَدَرَ‘‘} ہے، اس لیے ترجمہ کیا گیا ہے ’’قیامت بہت قریب آ گئی ہے۔‘‘ ویسے تو ہر آنے والی چیز قریب ہی ہے، مگر قیامت کو بہت قریب اس لیے فرمایا کہ دنیا پر گزرے ہوئے وقت کے مقابلے میں باقی رہنے والا وقت بہت کم رہ گیا ہے۔ اب اس کے فنا اور قیامت کے قیام کا وقت بہت ہی قریب ہے۔ رسول اللہ صلی اللہ علیہ وسلم آخری نبی ہیں، آپ کے بعد کوئی اور نبی نہیں، بلکہ قیامت ہی آئے گی۔ سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ میں نے نبی صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے انگوٹھے کے ساتھ والی انگلی اور درمیانی انگلی کی طرف اشارہ کرتے ہوئے فرمایا : [بُعِثْتُ أَنَا وَالسَّاعَةُ كَهَاتَيْنِ ] [ مسلم، الفتن، باب قرب الساعۃ : ۲۹۵۰۔ بخاري، : ۶۵۰۳ ] ’’ مجھے اور قیامت کو ان دو (انگلیوں) کی طرح بھیجا گیا ہے۔‘‘ ¤ ➋ { وَ انْشَقَّ الْقَمَرُ:} یعنی چاند کا پھٹنا اس بات کی علامت ہے کہ قیامت، جس کی تمھیں خبر دی جاتی رہی ہے، بہت قریب آ گئی ہے، کیونکہ جب چاند جیسا عظیم کرہ پھٹ سکتا ہے توزمین و آسمان، سورج اور ستارے بھی پھٹ کر دوسری صورت اختیار کر سکتے ہیں، جیسا کہ فرمایا: « يَوْمَ تُبَدَّلُ الْاَرْضُ غَيْرَ الْاَرْضِ وَ السَّمٰوٰتُ وَ بَرَزُوْا لِلّٰهِ الْوَاحِدِ الْقَهَّارِ » [ إبراہیم : ۴۸ ] ’’جس دن یہ زمین اور زمین سے بدل دی جائے گی اور سب آسمان بھی اور لوگ اللہ کے سامنے پیش ہوں گے، جو اکیلا ہے، بڑا زبردست ہے۔‘‘ ¤ ➌ قرآن مجید میں ماضی کے صیغے مستقبل کے معنی میں بھی آتے ہیں۔ مقصدیہ بتانا ہوتا ہے کہ ان کا واقع ہونا یقینی ہے، جیسا کہ فرمایا : « وَ قَالَ الشَّيْطٰنُ لَمَّا قُضِيَ الْاَمْرُ اِنَّ اللّٰهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَ وَعَدْتُّكُمْ فَاَخْلَفْتُكُمْ» [إبراہیم : ۲۲ ] ’’اور شیطان کہے گا، جب سارے کام کا فیصلہ کر دیا جائے گا کہ بے شک اللہ نے تم سے وعدہ کیا، سچا وعدہ اور میں نے تم سے وعدہ کیا تو میں نے تم سے خلاف ورزی کی۔‘‘ اس مقام پر بھی بعض حضرات کا کہنا ہے کہ اس کا مطلب یہ ہے کہ چاند پھٹ جائے گا، مگر حقیقت یہ ہے کہ قرآن و حدیث دونوں سے ثابت ہے کہ یہاں ماضی کا معنی ہی مراد ہے اور آیت کا مطلب یہی ہے کہ چاند پھٹ گیا۔ ایک ہی آیت میں ایک فعل ماضی کا ترجمہ ماضی اور دوسرے فعل ماضی کا ترجمہ مستقبل کرنا ویسے ہی بے جوڑ لگتا ہے کہ کہا جائے ’’قیامت بہت قریب آ گئی اور چاند پھٹ جائے گا۔‘‘ پھر اگر مراد مستقبل میں چاند کا پھٹنا ہوتا تو الفاظ یہ ہونے چاہییں تھے : {’’أَتَي السَّاعَةُ وَ انْشَقَّ الْقَمَرُ‘‘} ’’قیامت آ گئی اور چاند پھٹ گیا۔‘‘ پھر دونوں جگہ ماضی کا معنی مستقبل کرنا درست ہوتا۔ اس آیت سے بعد والی آیات سے بھی ظاہر ہے کہ یہ واقعہ ہو چکا ہے، تفصیل آگے آئے گی۔ ¤ صحیح احادیث سے بھی چاند کا پھٹنا ثابت ہے اور یہ واقعہ اتنی کثیر سندوں کے ساتھ بیان ہوا ہے کہ اکثر محدثین و مفسرین اسے متواتر قرار دیتے ہیں۔ ابن کثیر رحمہ اللہ نے فرمایا: ’’ چاند پھٹنے کے واقعہ پر علماء کا اتفاق ہے کہ یہ نبی صلی اللہ علیہ وسلم کے زمانے میں ہو چکا ہے اور یہ آپ صلی اللہ علیہ وسلم کے حیران کن معجزات میں سے ایک تھا۔‘‘ ابن کثیر رحمہ اللہ نے اس مقام پر بہت سی احادیث نقل فرمائی ہیں، یہاں چند احادیث نقل کی جاتی ہیں: (1) عبد اللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں : [ اِنْشَقَّ الْقَمَرُ عَلٰي عَهْدِ رَسُوْلِ اللّٰهِ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ فِرْقَتَيْنِ، فِرْقَةً فَوْقَ الْجَبَلِ وَفِرْقَةً دُوْنَهُ فَقَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ اشْهَدُوْا ] [ بخاري، التفسیر، باب: «وانشق القمر…» : ۴۸۶۴ ] ’’رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں چاند دو ٹکڑوں میں پھٹ گیا، ایک ٹکڑا پہاڑ کے اوپر تھا اور ایک ٹکڑا اس کی دوسری جانب۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’گواہ ہو جاؤ۔‘‘ (2) ابن عباس رضی اللہ عنھما نے فرمایا : [ اِنْشَقَّ الْقَمَرُ فِيْ زَمَانِ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ ] [ بخاري، التفسیر، باب : « وانشق القمر…» : ۴۸۶۶ ] ’’رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں چاند پھٹ گیا۔‘‘ (3) انس رضی اللہ عنہ فرماتے ہیں : [ سَأَلَ أَهْلُ مَكَّةَ أَنْ يُرِيَهُمْ آيَةً فَأَرَاهُمُ انْشِقَاقَ الْقَمَرِ ] [ بخاري، التفسیر، باب: «وانشق القمر…» : ۴۸۶۷ ] ’’اہلِ مکہ نے آپ صلی اللہ علیہ وسلم سے کوئی معجزہ دکھانے کا سوال کیا تو آپ صلی اللہ علیہ وسلم نے انھیں چاند کا پھٹنا دکھایا۔ ‘‘ (4) عبد اللہ بن مسعود رضی اللہ عنہ فرماتے ہیں : [ اِنْشَقَّ الْقَمَرُ بِمَكَّةَ حَتّٰی صَارَ فِرْقَتَيْنِ، فَقَالَ كُفَّارُ قُرَيْشٍ أَهْلُ مَكَّةَ هٰذَا سِحْرٌ، يَسْحَرُكُمْ بِهِ ابْنُ أَبِيْ كَبْشَةَ، انْظُرُوا السُّفَّارَ، فَإِنْ كَانُوْا رَأَوْا مَا رَأَيْتُمْ فَقَدْ صَدَقَ وَ إِنْ كَانُوْا لَمْ يَرَوْا مِثْلَ مَا رَأَيْتُمْ فَهُوَ سِحْرٌ سَحَرَكُمْ بِهِ۔ قَالَ فَسُئِلَ السُّفَّارُ قَالَ وَ قَدِمُوْا مِنْ كُلِّ وَجْهٍ فَقَالُوْا رَأَيْنَاهُ ] [ دلائل النبوۃ للبیہقي : ۲ /۲۶۶،۲۶۷، و سندہ صحیح ] ’’مکہ میں چاند پھٹ گیا، یہاں تک کہ دو ٹکڑے ہو گیا تو مکہ والے کفارِ قریش کہنے لگے: ’’ یہ جادو ہے جو ابن ابی کبشہ نے تم پر کر دیا ہے، جو لوگ سفر میں گئے ہوئے ہیں ان کا انتظار کرو، اگر انھوں نے وہ دیکھا ہے جو تم نے دیکھا ہے تو اس نے واقعی سچ کہا ہے اور اگر انھوں نے وہ نہیں دیکھا جو تم نے دیکھا ہے تو یہ جادو ہے جو اس نے تم پر کر دیا ہے۔‘‘ فرمایا: ’’ تو سفر سے آنے والوں سے پوچھا گیا جو ہر جانب سے آ رہے تھے تو انھوں نے بتایا کہ ہم نے اسے دیکھا ہے۔‘‘ تفسیر ابنِ کثیر کے محقق حکمت بن بشیر نے اس پر لکھا ہے کہ ابن کثیر نے فرمایا : ’’اسے ابن جریر نے بھی روایت کیا ہے اور یہ الفاظ زائد بیان کیے ہیں : [ فَأَنْزَلَ اللّٰهُ عَزَّ وَ جَلَّ : «اِقْتَرَبَتِ السَّاعَةُ وَ انْشَقَّ الْقَمَرُ» ] ’’یعنی اس پر اللہ تعالیٰ نے یہ آیات نازل فرمائیں۔‘‘ ¤ ➍ بعض واعظ حضرات بیان کرتے ہیں کہ چاند رسول اللہ صلی اللہ علیہ وسلم کی انگلی کے اشارے سے دو ٹکڑے ہوا، انگلی کے اشارے کا کوئی ثبوت نہیں۔ اسی طرح بعض کا کہنا ہے کہ چاند کا ایک ٹکڑا آپ کے گریبان سے ہو کر نکل گیا، بالکل ہی لغو بات ہے۔ ¤ ➎ انشقاقِ قمر پر کیے جانے والے شبہات اور اعتراضات کے متعلق مفسر عبدالرحمن کیلانی کا کلام بہت عمدہ ہے، وہ یہاں نقل کیا جاتا ہے : ’’آیت سے یہ بھی معلوم ہوتا ہے کہ قیامت اور انشقاقِ قمر کا باہمی تعلق یہ ہے کہ انشقاقِ قمر قربِ قیامت کی ایک نشانی ہے جو واقع ہو چکی ہے، لہٰذا اسے بس اب قریب ہی سمجھو۔ جب کفار نے اپنی آنکھوں سے یہ معجزہ دیکھ لیا تو کہنے لگے کہ یا تو چاند پر جادو کر دیا گیا ہے یا ہماری نظروں پر جو ہمیں ایسا نظر آنے لگا ہے۔ اس حیرانی میں ایک شخص نے کہا کہ اگر ہماری نظر بند کر دی گئی ہے تو آس پاس کے لوگوں سے پوچھ لو۔ چنانچہ آس پاس کے لوگوں نے اس کی تصدیق کر دی، مگر یہ کافر اپنی ہٹ دھرمی سے باز نہ آئے۔ اس آیت پر منکرین معجزات کئی طرح کے اعتراضات کرتے ہیں۔ پہلا اعتراض معنی کی تاویل سے تعلق رکھتا ہے۔ وہ کہتے ہیں کہ اس آیت میں صیغۂ ماضی کا معنی استقبال میں لیا جائے گا اور معنی یہ ہو گا کہ ’’جب قیامت قریب آ جائے گی اور چاند پھٹ جائے گا۔‘‘ جیساکہ {’’ اِذَا الشَّمْسُ كُوِّرَتْ ‘‘} اور اس جیسی دوسری آیات کا ترجمہ کیا جاتا ہے۔ ہمارے نزدیک یہ تاویل اور دلیل اس لیے غلط ہے کہ جہاں قیامت کے حوادث کا ذکر آیا ہے، مثلاً آسمان پھٹ جائے گا، ستارے بے نور ہو جائیں گے اور جھڑنے لگیں گے، زمین پر سخت زلزلے آئیں گے، پہاڑ اڑتے پھریں گے وغیرہ، وہاں ان باتوں کو کفار کے سحر کہنے کا کوئی تعلق نہیں اور نہ قرآن میں ایسی آیات کے ساتھ سحر کا ذکر آیا ہے۔ کافروں کا چاند کے پھٹنے کو جادو کہنا اور اس پر کفار کی تکرار ہی اس بات کی واضح دلیل ہے کہ یہ ایک حِسّی معجزہ تھا جو وقوع پذیر ہو چکا ہے۔ ¤ دوسرا اعتراض یہ ہے کہ اگر یہ واقعہ فی الواقع ظہور میں آ چکا ہے تو لوگوں کی ایک کثیر تعداد کو اس کا علم ہونا چاہیے تھا۔ اس کا جواب یہ ہے کہ یہ واقعہ رات کا ہے، دن کا نہیں، جب اکثر لوگ سوئے ہوئے ہوتے ہیں۔ پھر اس وقت آدھی دنیا میں تو ویسے ہی سورج نکلا ہوا تھا جہاں یہ واقعہ نظر نہیں آ سکتا تھا اور باقی آدھی دنیا میں سے بھی صرف ان مقامات پر نظر آ سکتا تھا جو منیٰ کے مشرق میں واقع تھے۔ پھر اس واقعہ کا کوئی اعلان بھی نہیں ہوا تھا، جیسے آج کل جنتریوں اور اخباروں سے معلوم ہو جاتا ہے، یا رصد گاہوں کی طرف سے اعلان کیا جاتا ہے، لہٰذا لوگ کوئی اس بات کے منتظر بھی نہیں بیٹھے تھے کہ چاند پھٹے تو ہم اسے اپنی آنکھوں سے دیکھ لیں۔ علاوہ ازیں ہم دیکھتے ہیں کہ چاند گرہن کئی گھنٹوں تک لگا رہتا ہے، لوگوں کو پہلے خبر بھی دی جا چکی ہوتی ہے لیکن لوگوں کی اکثریت چاند گرہن لگنے سے غافل ہوتی ہے اور یہ انشقاقِ قمر تو صرف ایک لمحہ کے لیے واقع ہوا تھا، اسے کون دیکھتا؟ اور آس پاس کے لوگوں نے شہادت دے ہی دی تھی۔ ¤ تیسرا اعتراض یہ ہے کہ ایسے اہم واقعہ کا تاریخ میں بھی ذکر ہونا چاہیے تھا۔ اس اعتراض کے کئی جواب ہیں، پہلا یہ کہ سب سے زیادہ مستند تاریخ حدیث کی کتابوں سے ہی دستیاب ہو سکتی ہے اور ان میں یہ واقعہ موجود ہے۔ دوسرا یہ کہ اس دور میں جیسی اور جتنی توجہ تاریخ نویسی پر دی جاتی تھی وہ سب کو معلوم ہے۔ تیسرا یہ کہ جب دنیا کے لوگوں کی اکثریت اور ایسے ہی تاریخ نویسوں نے اسے دیکھا ہی نہ ہو تو لکھیں کیا؟ اور چوتھا یہ کہ تاریخ بھی اس واقعہ کے اندارج سے یکسر خالی نہیں۔ تاریخ فرشتہ میں مذکور ہے، مالی بار کے مہاراجہ نے یہ واقعہ اپنی آنکھوں سے دیکھا تھا اور بالآخر یہ واقعہ اس کے اسلام لانے کا سبب بنا تھا۔ ¤ چوتھا اعتراض یہ ہے کہ ہیئت دانوں اور منجمین نے بھی اس واقعہ کا کہیں ذکر نہیں کیا۔ اس کا جواب یہ ہے کہ اگر چاند پھٹنے سے اس کی رفتار میں فرق آتا یا وہ اپنا مدار بدل لیتا یا مدار سے ہٹ کر چلنے لگتا تو یہ باتیں اس قابل تھیں کہ ہیئت دان اس کا ذکر کرتے، لیکن جب ان میں سے کوئی چیز بھی واقع نہ ہوئی تو وہ کیا ذکر کریں؟ ¤ اور پانچواں اعتراض یہ ہے کہ یہ واقعہ خرقِ عادت ہے اور ان کا دراصل سب سے اہم یہی اعتراض ہے جو انھیں تسلیم کرنے سے روکتا ہے اور وہ ادھر اُدھر ہاتھ مارتے اور مختلف قسم کے اعتراض اور شکوک پیدا کرتے ہیں اور حقیقتاً ان کا یہ انکار اللہ کی قدرتِ کاملہ کا انکار ہے۔ بہرحال یہ بات بھی آج بعید از عقل نہیں رہی۔ ہر سیارے کے پیٹ میں آتشیں مادے یا پگھلتی اور کھولتی ہوئی دھاتیں موجود ہیں جن کا درجہ حرارت ہزار ہا درجہ سنٹی گریڈ ہوتا ہے۔ یہ مہیب لاوے ان عظیم الجثہ کروں کو کسی وقت بھی دو لخت کر سکتے ہیں۔ پھر ان کی مرکزی مقناطیسی قوت، جسے آج کی زبان میں قوتِ ثقل کہتے ہیں وہ ان جدا شدہ ٹکڑوں کو ملا کر جوڑ بھی دیتی ہے اور ایسا عمل فضائے بسیط میں ہوتا رہتا ہے۔ یہ کہکشائیں اسی طرح وجود میں آئی ہیں اور آج بھی یہ عمل بند نہیں ہوابلکہ بدستور جاری ہے۔ علاوہ ازیں شہابِ ثاقب کسی سیارے کے اس طرح سے جدا شدہ ٹکڑے کا نام ہے جو کبھی علیحدہ ہو کر پھر جڑ جاتا ہے، کبھی فضا میں ہی گر کر گم ہو جاتا ہے اور کبھی کبھار زمین پر بھی آ گرتا ہے۔ فضائے بسیط میں جو کچھ ہو رہا ہے اگر انسان کو اس کا صحیح طور پر علم ہو جائے تو وہ انشقاقِ قمر کے واقعہ پر کبھی تعجب نہ کرے۔ انسان کو کیا معلوم کہ اللہ کی قدرتوں کا دائرہ کتنا وسیع ہے اور وہ کس قدر حکمتِ بالغہ سے اس نظامِ کائنات کو چلا رہا ہے۔ ‘‘ ( تیسیر القرآن) ¤ ➏ ایک اہم سوال یہاں یہ ہے کہ کفارِ مکہ جب اپنے سوال کے جواب میں اتنا بڑا معجزہ دیکھ کر ایمان نہیں لائے تو ان پر پہلی قوموں کی طرح عذاب آ جانا چاہیے تھا جو نبیوں کے معجزے دیکھ کر ایمان نہیں لائی تھیں۔ اس کا ایک جواب یہ ہے کہ پہلی امتوں کو دکھائے جانے والے معجزات ان کے ایمان لانے کی شرط کے ساتھ مشروط مطالبے پر دکھائے گئے تھے، جبکہ ہماری امت میں ایمان لانے کی شرط کے ساتھ بطورِ عناد جس معجزے کا بھی مطالبہ کیا گیا ان میں سے ایک بھی پورا نہیں کیا گیا، بلکہ یہی کہنے کا حکم ہوا : «قُلْ سُبْحَانَ رَبِّيْ هَلْ كُنْتُ اِلَّا بَشَرًا رَّسُوْلًا » [ بني إسرائیل : ۹۳ ] ’’تو کہہ میرا رب پاک ہے، میں تو ایک بشر کے سوا کچھ نہیں جو رسول ہے۔‘‘ مزید دیکھیے سورۂ بنی اسرائیل (۹۰تا۹۳) کی تفسیر۔ اس مقصد کے لیے آپ کو ایک ہی معجزہ پیش کرنے کا حکم تھا اور وہ ہے قرآن مجید کہ ہمت ہے تو اس جیسی ایک سورت ہی بنا کر لے آؤ۔ اور یہ اس امت پر اللہ تعالیٰ کی رحمت ہے کہ اس معجزے یا کسی بھی معجزے پر ایمان نہ لانے والوں پر عذابِ استیصال یعنی ایسا عذاب نہیں آیا اور نہ آئے گا جو ان کا نام و نشان ہی مٹا دے۔ تفصیل کے لیے دیکھیے سورۂ عنکبوت (51،50) کی تفسیر۔ البتہ اس شرط کے بغیر لوگوں کی درخواست پر بہت سے معجزے صادر ہوئے ہیں، مثلاً سورۂ بنی اسرائیل( ۹۰ تا۹۳) میں جن معجزوں کا کفار نے بطورِ شرط مطالبہ کیا اور ان کا مطالبہ پورا نہیں کیا گیا، ان میں سے ایک یہ تھا کہ آپ ہمارے لیے زمین سے کوئی چشمہ جاری کر دیں، لیکن ایسی شرط کے بغیر یہ معجزہ متعدد بار واقع ہوا ہے جن میں سے آپ صلی اللہ علیہ وسلم کی انگلیوں سے پانی جاری ہونے اور حدیبیہ کے موقع پر کنویں میں تیر ڈالنے سے پانی جاری ہونے کے واقعات جو سب جانتے ہیں۔ عبد اللہ بن مسعود رضی اللہ عنہ نے فرمایا : [ إِنَّكُمْ تَعُدُّوْنَ الْآيَاتِ عَذَابًا وَ إِنَّا كُنَّا نَعُدُّهَا عَلٰی عَهْدِ رَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ بَرَكَةً لَقَدْ كُنَّا نَأْكُلُ الطَّعَامَ مَعَ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَسْمَعُ تَسْبِيْحَ الطَّعَامِ قَالَ وَ أُتِيَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ بِإِنَاءٍ فَوَضَعَ يَدَهُ فِيْهِ فَجَعَلَ الْمَاءُ يَنْبُعُ مِنْ بَيْنِ أَصَابِعِهِ فَقَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ حَيَّ عَلَی الْوَضُوْءِ الْمُبَارَكِ وَالْبَرَكَةُ مِنَ السَّمَاءِ حَتّٰی تَوَضَّأْنَا كُلُّنَا ] [ترمذي، المناقب، باب فی قول علي في استقبال کل جبل و شجر النبی صلی اللہ علیہ وسلم بالتسلیم: ۳۶۳۳، و قال حسن صحیح و قال الألباني صحیح ] ’’تم نشانیوں کو عذاب شمار کرتے ہو جبکہ ہم انھیں رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں برکت شمار کرتے تھے۔ چنانچہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کھانا کھاتے تھے اور ہم کھانے کی تسبیح سن رہے ہوتے تھے۔‘‘ عبد اللہ بن مسعود رضی اللہ عنہ نے فرمایا : ’’اور نبی صلی اللہ علیہ وسلم کے پاس ایک برتن لایا گیا، آپ صلی اللہ علیہ وسلم نے اپنا ہاتھ اس میں رکھا تو پانی آپ صلی اللہ علیہ وسلم کی انگلیوں سے پھوٹنے لگا، تو نبی صلی اللہ علیہ وسلم نے فرمایا : ’’اس بابرکت وضو کے پانی پر آ جاؤ اور برکت آسمان سے ہے۔‘‘ یہاں تک کہ ہم سب نے وضو کر لیا۔‘‘ انشقاقِ قمر کامعجزہ بے شک اہلِ مکہ کے اس سوال کے جواب میں صادر ہوا کہ ہمیں کوئی نشانی دکھائیں، مگر یہ ان کے اس مطالبے کے جواب میں نہیں ہوا کہ آپ ہمیں چاند کو دو ٹکڑے کر کے دکھائیں (جن روایتوں میں یہ بات ذکر ہوئی ہے وہ سب ضعیف ہیں) بلکہ انھیں ایک نشانی کے طور پر دکھایا گیا جسے انھوں نے جادو کہہ کر ماننے سے انکار کر دیا، فرمایا : «وَ اِنْ يَّرَوْا اٰيَةً يُّعْرِضُوْا وَ يَقُوْلُوْا سِحْرٌ مُّسْتَمِرٌّ » [ القمر : ۲ ] ’’اور اگر وہ کوئی نشانی دیکھتے ہیں تو منہ پھیر لیتے ہیں اور کہتے ہیں کہ (یہ) ایک جادو ہے جو گزر جانے والا ہے۔‘‘ ¤ دوسرا جواب اس کا یہ ہے کہ اس امت میں بھی معجزات دیکھ کر ایمان نہ لانے والوں پر عذاب آیا، مگر اس کا طریقہ تبدیل کر دیا گیا اور وہ یہ کہ اللہ تعالیٰ نے اب ایسے لوگوں کو مسلمانوں کے ہاتھوں عذاب دینے کا فیصلہ فرمایا اور فی الواقع ایسے تمام منکروں کو بدر اور دوسرے مقامات پر ذلت آمیز عذاب سے دوچار ہونا پڑا۔ اللہ تعالیٰ نے فرمایا : « قَاتِلُوْهُمْ يُعَذِّبْهُمُ اللّٰهُ بِاَيْدِيْكُمْ وَ يُخْزِهِمْ وَ يَنْصُرْكُمْ عَلَيْهِمْ وَ يَشْفِ صُدُوْرَ قَوْمٍ مُؤْمِنِيْنَ (14) وَ يُذْهِبْ غَيْظَ قُلُوْبِهِمْ وَ يَتُوْبُ اللّٰهُ عَلٰى مَنْ يَّشَآءُ وَ اللّٰهُ عَلِيْمٌ حَكِيْمٌ » [ التوبۃ : ۱۴، ۱۵ ] ’’ان سے لڑو، اللہ انھیں تمھارے ہاتھوں سے عذاب دے گا اور انھیں رسوا کرے گا اور ان کے خلاف تمھاری مدد کرے گا اور مومن لوگوں کے سینوں کو شفا دے گا۔ اور ان کے دلوں کا غصہ دور کرے گا اور اللہ توبہ کی توفیق دیتا ہے جسے چاہتا ہے اور اللہ سب کچھ جاننے والا، کمال حکمت والا ہے۔ ‘‘"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {وَ اِنْ يَّرَوْا اٰيَةً يُّعْرِضُوْا … : ’’مَرَّ ‘‘} اور {’’ اِسْتَمَرَّ ‘‘} گزرنا۔ {’’ مُسْتَمِرٌّ ‘‘} گزر جانے والا۔ یعنی کفار کوئی معجزہ دیکھتے ہیں تو ایمان لانے کے بجائے منہ پھیر لیتے ہیں اور کہتے ہیں کہ یہ ایک جادو ہے، جس طرح اور جادوگزر گئے ہیں یہ بھی گزر جانے والا ہے، یہ چاند بھی ہمیشہ پھٹا ہوا نہیں رہے گا۔ چنانچہ انھوں نے چاند پھٹنے کے عظیم الشان واقعہ کو بھی رسول اللہ صلی اللہ علیہ وسلم کا جادو قرار دے کر ایمان لانے سے اعراض اختیار کیا۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {وَ كَذَّبُوْا وَ اتَّبَعُوْۤا اَهْوَآءَهُمْ:’’ اَهْوَآءَ‘‘ ’’هَوًي‘‘} کی جمع ہے، خواہشات۔ یعنی کفار کے رسول اللہ صلی اللہ علیہ وسلم کو اور آپ کے معجزات کو جھٹلانے کا باعث کوئی معقول بات نہ تھی، بلکہ صرف اپنی خواہشات کی پیروی تھی۔ لفظ {’’هَوًي‘‘} (خواہش) اسمِ جنس ہے جو واحد پر صادق آتا ہے اور جمع پر بھی، مگر یہاں {’’ اَهْوَآءَ ‘‘} (جمع) اس لیے ذکر فرمایا ہے کہ کفار کے رسول اللہ صلی اللہ علیہ وسلم کو جھٹلانے کا باعث ان کی ایک خواہش نہ تھی بلکہ بہت سی خواہشیں تھیں جو انھیں آپ کے تابع فرمان ہونے سے روکتی تھیں۔ مثلاً سرداری کی خواہش، حسد، آباء کی پیروی کی خواہش، اپنے داتاؤں پر جمے رہنے کی خواہش، شتر بے مہار رہنے اور کسی کے تابع فرمان نہ ہونے کی خواہش وغیرہ۔ ¤ ➋ { وَ كُلُّ اَمْرٍ مُّسْتَقِرٌّ: ’’قَرَّ يَقِرُّ‘‘} (ض) قرار پکڑنا۔ {’’اِسْتَقَرَّ‘‘} میں مبالغہ ہے، یعنی جس طرح ہر چلنے والا آخر کار کہیں نہ کہیں جا کر ٹھہر جاتا ہے اور ہر کام کا، خواہ وہ اچھا ہو یا برا، کوئی نہ کوئی انجام ہوتا ہے، اسی طرح یہ مت سمجھو کہ رسول اللہ صلی اللہ علیہ وسلم تمھیں حق کی طرف بلاتے رہیں گے اور تم انھیں جھٹلاتے رہو گے اور آپ کا حق پر ہونا اور تمھارا باطل پر ہونا کبھی ثابت نہیں ہو گا، بلکہ ایک وقت آئے گا جب ہر چیز کی حقیقت کھل کر سامنے آ جائے گی اور ثابت ہو جائے گا کہ آپ صلی اللہ علیہ وسلم اللہ کے سچے رسول تھے اور آپ صلی اللہ علیہ وسلم کو جھٹلانا اور جادوگر قرار دینا غلط تھا۔ مزید دیکھیے سورۂ انعام کی آیت (۶۷) : «لِكُلِّ نَبَاٍ مُّسْتَقَرٌّ وَّ سَوْفَ تَعْلَمُوْنَ » کی تفسیر۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {وَ لَقَدْ جَآءَهُمْ مِّنَ الْاَنْۢبَآءِ … : ’’نَبَأٌ‘‘} کسی اہم خبر کو کہتے ہیں، {’’ الْاَنْۢبَآءِ ‘‘} اس کی جمع ہے۔ {’’ مُزْدَجَرٌ ‘‘ ’’زَجَرَ يَزْجُرُ زَجْرًا‘‘} (ن) (روکنا، منع کرنا، ڈانٹنا) سے بات افتعال کا مصدر میمی ہے، جس کا معنی ’’باز آنا‘‘ ہے۔ کہا جاتا ہے : {’’زَجَرْتُهُ فَازْدَجَرَ‘‘} ’’میں نے اسے منع کیا تو وہ باز آ گیا۔‘‘ یہ اصل میں {’’مُزْتَجَرٌ‘‘} (بروزن {مُفْتَعَلٌ}) تھا، ’’زاء‘‘ کی وجہ سے باب افتعال کی ’’تاء‘‘ کو دال سے بدل دیا تو {’’ مُزْدَجَرٌ ‘‘} ہو گیا۔ تنوین اس میں تعظیم کے لیے ہے۔ یعنی قرآن کی صورت میں ان کے پاس رسولوں کو جھٹلانے والی اقوام کی خبروں میں سے ایسی اہم خبریں یقینا پہنچی ہیں جن میں آدمی کے لیے ہوائے نفس کی پیروی اور رسولوں کی تکذیب سے باز آنے کا مکمل سامان موجود ہے۔ اگلی آیات میں ان میں سے چند خبروں کا ذکر فرمایا ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) { حِكْمَةٌۢ بَالِغَةٌ فَمَا تُغْنِ النُّذُرُ: ’’ بَالِغَةٌ ‘‘} کا لفظی معنی پہنچنے والی ہے، مراد انتہا اور کمال کو پہنچی ہوئی حکمت ہے۔ {’’ النُّذُرُ ‘‘ ’’نَذِيْرٌ‘‘} کی جمع ہے، ڈرانے والی چیزیں۔ {’’نَذِيْرٌ‘‘} مصدر بھی ہو سکتا ہے، جس طرح {’’نَكِيْرٌ‘‘} ہے، یعنی تنبیہات، ڈراوے۔ {’’ حِكْمَةٌ ‘‘} پچھلی آیت میں مذکور {’’ مَا فِيْهِ مُزْدَجَرٌ ‘‘} سے بدل ہے۔ یعنی پچھلی امتوں کے واقعات میں سے وہ واقعات جن میں کفر و تکذیب سے باز آنے کا سامان موجود ہے، کامل حکمت اور دانائی کی باتیں ہیں، مگر یہ ڈرانے اور خبردار کرنے والی چیزیں نہ ماننے والوں کو کچھ فائدہ نہیں دیتیں۔ دیکھیے سورۂ یونس ( ۱۰۱)۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { فَتَوَلَّ عَنْهُمْ:} یعنی جب ان لوگوں کو کسی تنبیہ یا ڈرانے کا کچھ فائدہ ہی نہیں ہوتا تو آپ بھی ان سے منہ پھیر لیں اور انھیں ان کے حال پر رہنے دیں۔ آپ کے ذمے پہنچانا تھا، وہ آپ نے پہنچا دیا۔ ¤ ➋ {يَوْمَ يَدْعُ الدَّاعِ اِلٰى شَيْءٍ نُّكُرٍ: ’’ يَوْمَ ‘‘} منصوب بنزع الخافض ہے، یعنی اس سے پہلے حرفِ جار {’’إِلٰي‘‘} ہے جسے حذف کرنے کی وجہ سے یہ منصوب ہے۔ (بغوی) آلوسی نے کہا : {’’ هٰذَا قَوْلُ الْحَسَنِ ‘‘} کہ یہ حسن کا قول ہے یعنی {’’ فَتَوَلَّ عَنْهُمْ إِلٰی يَوْمٍ يَدْعُ الدَّاعِ فِيْهِ إِلٰی شَيْءٍ نُّكُرٍ ‘‘} ’’سو ان سے منہ پھیر لے، اس دن تک جس میں پکارنے والا ایک ناگوار چیز کی طرف بلائے گا۔‘‘ یا {’’ يَوْمَ ‘‘} فعل محذوف {’’اُنْظُرْ‘‘} کے ساتھ منصوب ہے، یعنی ’’ان سے منہ پھیر لے اور اس دن کا انتظار کر جب…۔‘‘ پکارنے والے سے مراد اسرافیل علیہ السلام ہیں، جن کے نفخہ سے تمام لوگ قبروں سے نکل کھڑے ہوں گے۔ {’’ يَدْعُ ‘‘} اصل میں {’’يَدْعُوْ‘‘} ہے، واؤ چونکہ یہاں پڑھنے میں نہیں آتی اس لیے مصحفِ عثمان میں لکھی نہیں گئی۔ {’’ الدَّاعِ ‘‘} اصل میں {’’الدَّاعِيُ‘‘} ہے، ’’یاء‘‘ تخفیف کے لیے حذف کی گئی ہے اور {’’ شَيْءٍ نُّكُرٍ ‘‘} سے مراد حساب کتاب ہے {’’ نُكُرٍ ‘‘} بمعنی {’’ مُنْكِرٌ ‘‘} ہے، ناگوار، اجنبی، انوکھی چیز جو کبھی دیکھی نہ ہو گی۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {خُشَّعًا اَبْصَارُهُمْ يَخْرُجُوْنَ مِنَ الْاَجْدَاثِ …: ’’ خُشَّعًا ‘‘ ’’خَاشِعٌ‘‘} کی جمع ہے، جیسے {’’رَاكِعٌ‘‘} کی جمع {’’رُكَّعٌ‘‘} ہے۔ یعنی ذلت کی وجہ سے ان کی نگاہیں جھکی ہوئی ہوں گی۔ (دیکھیے شوریٰ : ۴۵) {’’الْاَجْدَاثِ ‘‘ ’’جَدَثٌ‘‘} (دال کے فتحہ کے ساتھ) کی جمع ہے، قبریں۔ {’’ جَرَادٌ ‘‘} اسم جمع ہے، اس کا واحد {’’جَرَادَةٌ‘‘} ہے، ٹڈیاں جو بے شمار تعداد میں زمین سے نکلتی ہیں اور ہر طرف پھیل جاتی ہیں۔ {’’ مُنْتَشِرٌ ‘‘} پھیلی ہوئی۔ قبروں سے نکلنے والوں کی حالت کو یہاں پھیلی ہوئی ٹڈیوں کے ساتھ اور سورۂ قارعہ میں{’’ كَالْفَرَاشِ الْمَبْثُوْثِ ‘‘} بکھرے ہوئے پروانوں کے ساتھ تشبیہ دی ہے کہ دونوں ہی جب نکلتے ہیں تو بے شمار تعداد میں ایک دوسرے کے گرد اڑتے، گھومتے اور آپس میں ٹکراتے ہوئے تیزی سے بڑھتے چلے جاتے ہیں، پروانے آگ کی طرف اور ٹڈیاں اس طرف جدھر ان کا رخ ہو جائے۔ اسی طرح قبروں سے نکلنے والے تیزی کے ساتھ صُور کی آواز کی طرف بے شمار پھیلی ہوئی ٹڈیوں کی طرح گرتے پڑتے، چکر کھاتے، ایک دوسرے سے ٹکراتے ہوئے بے اختیار دوڑتے چلے جا رہے ہوں گے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {مُهْطِعِيْنَ اِلَى الدَّاعِ …: ’’أَهْطَعَ يُهْطِعُ‘‘} (افعال) کسی چیز کی طرف ٹکٹکی باندھے یا گردن اٹھائے ہوئے تیزی سے دوڑنا۔ (دیکھیے ابراہیم : ۴۳) {’’ عَسِرٌ ‘‘ ’’عُسْرٌ‘‘} سے صفت مشبّہ ہے، بہت مشکل۔ ¤ ➋ مفسر ابن عاشور نے فرمایا : {’’ يَوْمَ يَدْعُ الدَّاعِ‘‘} سے {’’ يَوْمٌ عَسِرٌ ‘‘} تک اس دن کی ہولناکی سات طرح سے ظاہر ہو رہی ہے: (1) {’’ يَدْعُ الدَّاعِ ‘‘} اسرافیل علیہ السلام کا بلانا ہی اتنا ہولناک ہے جو بیان میں نہیں آ سکتا۔ (2) {’’ اِلٰى شَيْءٍ ‘‘} میں{’’ شَيْءٍ ‘‘} پر تنوینِ تنکیر سے پیدا ہونے والی تعظیم اور ابہام اس ہول میں اضافہ کر رہے ہیں۔ (3) {’’ نُكُرٍ ‘‘} (4) {’’ خُشَّعًا اَبْصَارُهُمْ ‘‘} (5) {’’ جَرَادٌ مُّنْتَشِرٌ ‘‘} کے ساتھ تشبیہ۔ (6) {’’ مُهْطِعِيْنَ اِلَى الدَّاعِ ‘‘} (7) اور ان کا کہنا {’’ هٰذَا يَوْمٌ عَسِرٌ ‘‘} ’’کہ یہ بڑا مشکل دن ہے۔‘‘"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ … :} اس سے پہلے جو فرمایا تھا : « وَ لَقَدْ جَآءَهُمْ مِّنَ الْاَنْۢبَآءِ مَا فِيْهِ مُزْدَجَرٌ» تو یہاں سے ان واقعات کا ذکر شروع ہوتا ہے۔ ان واقعات میں جھٹلانے والوں کے لیے عبرتیں ہیں جنھیں دیکھ کر اور سن کر وہ تکذیب سے باز آ سکتے ہیں اور رسول اللہ صلی اللہ علیہ وسلم اور اہلِ ایمان کے لیے تسلی اور حوصلے کا سامان ہے۔ یعنی ان اہلِ مکہ سے پہلے نوح علیہ السلام کی قوم نے انھیں جھٹلایا۔ ¤ ➋ { وَ قَالُوْا مَجْنُوْنٌ: ’’ مَجْنُوْنٌ ‘‘} جسے جنون ہو، پاگل، دیوانہ۔ تفصیل کے لیے دیکھیے سورۂ مومنون (۲۵) کی تفسیر۔ ¤ ➌ { وَ ازْدُجِرَ:}يہ { ’’زَجْرٌ‘‘} (جھڑکنا) سے باب افتعال کا ماضی مجہول ہے، اصل میں {’’اُزْتُجِرَ‘‘} تھا، جس میں تائے افتعال مبالغہ کے لیے ہے، یعنی اسے سخت جھڑکا گیا۔ اس کے دو مطلب ہو سکتے ہیں، ایک یہ کہ اللہ تعالیٰ فرما رہے ہیں کہ نوح علیہ السلام کو سخت جھڑکا گیا، سب و شتم کی بوچھاڑ کی گئی، ان کا مذاق اڑایا گیا اور انھیں دھمکیاں دی گئیں۔ (دیکھیے اعراف : ۶۶۔ ہود : ۳۸۔ شعراء : ۱۱۶) دوسرا مطلب یہ ہے کہ نوح علیہ السلام کی قوم نے کہا کہ یہ مجنون ہے اور اسے ہمارے معبودوں کی جھڑک پڑی ہوئی ہے، جس سے اس کی عقل ٹھکانے نہیں رہی، جیسا کہ ہود علیہ السلام کی قوم نے کہا تھا : « اِنْ نَّقُوْلُ اِلَّا اعْتَرٰىكَ بَعْضُ اٰلِهَتِنَا بِسُوْٓءٍ » [ ھود : ۵۴ ] ’’ ہم اس کے سوا کچھ نہیں کہتے کہ ہمارے معبودوں میں سے کسی نے تجھے کوئی آفت پہنچا دی ہے۔‘‘"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {فَدَعَا رَبَّهٗۤ اَنِّيْ مَغْلُوْبٌ فَانْتَصِرْ:} نوح علیہ السلام نے یہ دعا اس وقت کی جب اللہ تعالیٰ نے انھیں اطلاع دی کہ اب تیری قوم میں سے کوئی ایمان نہیں لائے گا۔ مزید دیکھیے سورۂ نوح (27،26) کی تفسیر۔ {’’اِنْتَصَرَ يَنْتَصِرُ‘‘} انتقام لینا۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {فَفَتَحْنَاۤ اَبْوَابَ السَّمَآءِ بِمَآءٍ مُّنْهَمِرٍ:’’ مُنْهَمِرٍ ‘‘ ’’اِنْهَمَرَ يَنْهَمِرُ‘‘} (انفعال) سے اسم فاعل ہے، شدت اور کثرت کے ساتھ گرنے والا پانی۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {وَ فَجَّرْنَا الْاَرْضَ عُيُوْنًا:} یعنی ہم نے زمین کو پانی کے ساتھ اس طرح پھاڑا کہ وہ ساری کی ساری چشمے بن گئی۔ ¤ ➋ { فَالْتَقَى الْمَآءُ عَلٰۤى اَمْرٍ قَدْ قُدِرَ:} یعنی زمین اور آسمان کا پانی مل کر ایک ہو گیا، اس کام کے لیے جو طے کر دیا گیا تھا۔ مراد قومِ نوح کی ہلاکت ہے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) {وَ حَمَلْنٰهُ عَلٰى ذَاتِ اَلْوَاحٍ وَّ دُسُرٍ:’’ اَلْوَاحٍ ‘‘ ’’لَوْحٌ‘‘} کی جمع ہے، لکڑی وغیرہ کے تختے۔ {’’ دُسُرٍ ‘‘ ’’دِسَارٌ‘‘} کی جمع ہے، جیسے {’’كِتَابٌ‘‘} کی جمع {’’كُتُبٌ‘‘} ہے، کیل یا میخیں خواہ لکڑی کی ہوں یا لوہے وغیرہ کی، جن کے ساتھ تختے جوڑے جاتے ہیں۔ مراد کشتی ہے جو نوح علیہ السلام نے اللہ تعالیٰ کے حکم کے مطابق طوفان آنے سے پہلے تیار کر لی تھی۔ مزید دیکھیے سورۂ ہود (۳۷ تا ۴۱)کی تفسیر۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { تَجْرِيْ بِاَعْيُنِنَا:} جب آسمان کے دروازے پانی کے ساتھ کھلنے اور زمین کے چشموں کے ساتھ پھٹ جانے سے زمین و آسمان کا پانی ایک ہو گیا تو اس پانی کی بلندی کا اندازہ کون کر سکتا ہے۔ اس کشتی میں بیٹھے ہوئے نوح علیہ السلام اور ان کے ساتھیوں کو کچھ معلوم نہیں کہ کدھر جانا ہے اور اسے موجوں سے کس طرح بچانا ہے، نہ کشتی پر یا پانی پر ان کا کوئی اختیار ہے۔ اللہ تعالیٰ فرماتے ہیں اس وقت وہ کشتی ہماری آنکھوں کے سامنے چل رہی تھی، اس کے نگران و محافظ ہم تھے، پھر اسے کوئی گزند کیسے پہنچ سکتا تھا۔ ¤ ➋ { جَزَآءً لِّمَنْ كَانَ كُفِرَ:} اس کے دو مطلب ہیں، ایک یہ کہ یہ سب کچھ اس شخص کا بدلا لینے کی خاطر کیا گیا جس کا انکار کیا گیا اور اسے نبی تسلیم نہیں کیا گیا۔ {’’ كُفِرَ ‘‘} کا دوسرا معنی ناشکری اور ناقدر شناسی ہے، یعنی نوح علیہ السلام اس قوم کے لیے اللہ تعالیٰ کی عظیم نعمت تھے اور انھوں نے اس کی قدر نہیں کی۔ یعنی اس شخص کا انتقام لینے کی خاطر جو ایک عظیم نعمت تھا مگر اس کی قدر نہیں پہچانی گئی۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) ➊ { وَ لَقَدْ تَّرَكْنٰهَاۤ اٰيَةً:} اس کی تفسیر کے لیے دیکھیے سورۂ ہود (۴۴) اور سورۂ عنکبوت (۱۵) کی تفسیر۔ ¤ ➋ { فَهَلْ مِنْ مُّدَّكِرٍ: ’’ مُدَّكِرٍ ‘‘ ’’ ذَكَرَ يَذْكُرُ ‘‘} میں سے باب افتعال کا اسم فاعل ہے، جو اصل میں {’’مُذْتَكِرٌ‘‘} ہے، تائے افتعال کو دال سے بدل دیا گیا، اسی طرح ذال کو بھی دال سے بدل کر اس میں ادغام کر دیا گیا، جیسا کہ سورۂ یوسف میں گزرا ہے : «وَ قَالَ الَّذِيْ نَجَا مِنْهُمَا وَ ادَّكَرَ بَعْدَ اُمَّةٍ » [ یوسف : ۴۵ ] ’’اور ان دونوں میں سے جو رہا ہوا تھا اور اسے ایک مدت کے بعد یاد آیا، اس نے کہا۔‘‘"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) {فَكَيْفَ كَانَ عَذَابِيْ وَ نُذُرِ: ’’ نُذُرِ ‘‘} فراء نے فرمایا : {’’إِنْذَارٌ‘‘} اور {’’نُذُرٌ‘‘} مصدر ہیں۔‘‘(فتح القدیر) یہاں {’’ نُذُرِ ‘‘} اصل میں {’’ نُذُرِيْ‘‘} (میرا ڈرانا) تھا، آیات کے فواصل کی مطابقت کے لیے ’’یاء‘‘ حذف ہو گئی، اس کی دلیل کے طورپر ’’راء‘‘ پر کسرہ باقی رہا۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ { وَ لَقَدْ يَسَّرْنَا الْقُرْاٰنَ لِلذِّكْرِ …:} یعنی ہم نے قرآن کو نصیحت کے لیے آسان کر دیا ہے، اس کے الفاظ آسان ہیں، معنی بھی آسان ہے، نہ پڑھنے میں دقت ہے نہ سمجھنے میں، تو کیا کوئی ہے جو اس سے نصیحت حاصل کرے اور نافرمانی سے باز آ جائے؟ اس میں قرآن مجید پڑھنے، پڑھانے، سمجھنے، سمجھانے اور اس سے نصیحت حاصل کرنے کی ترغیب ہے۔ اس کے باوجود مسلمانوں میں بہت سے لوگ وہ ہیں جن کا کہنا ہے کہ قرآن و حدیث کو سمجھنا ہر شخص کا کام نہیں، یہ بڑے بڑے عالم و فاضل لوگوں کا کام ہے، جو چودہ یا اکیس علوم پڑھے ہوئے ہوں۔ نتیجہ یہ ہوتا ہے کہ وہ ساری عمر متعدد مشکل سے مشکل علوم و فنون پڑھتے رہتے ہیں، مگر قرآن کے قریب نہیں جاتے، اپنے چودہ یا اکیس علوم پورے کرتے کرتے ہی دنیا سے گزر جاتے ہیں۔ کئی تو ایسے ظالم ہیں، جو کہتے ہیں کہ عام آدمی کے لیے قرآن کا ترجمہ پڑھنا ممنوع ہے، کیونکہ اس سے گمراہی کا خطرہ ہے۔ حالانکہ قرآن مجید عربی مبین میں اترا اور لوگوں کی ہدایت کے لیے اترا، ہر عام و خاص اور عالم و جاہل عرب نے اسے سنا، سمجھا، اس پر عمل کیا اور آگے پہنچایا۔ ہماری زبان اردو میں قرآن مجید کے تقریباً ستر(۷۰) فیصد الفاظ موجود ہیں، تھوڑی سی توجہ کے ساتھ ہر آدمی قرآن کا ترجمہ سمجھ سکتا ہے۔ مگر جن لوگوں نے قرآن و حدیث کے مقابلے میں نیا دین بنا لیا اور توحید کے مقابلے میں شرک اور سنت کے مقابلے میں بدعت کو اختیار کر لیا ہے، ان کی پوری کوشش ہے کہ لوگ اصل قرآن مجید اور حدیث سے آگاہ نہ ہو جائیں، ورنہ وہ ان کے پنجے سے نکل جائیں گے۔ اللہ تعالیٰ ہدایت دے اور مسلمانوں کو قرآن و سنت کی طرف پلٹنے کی توفیق عطا فرمائے۔ ¤ ➋ قرآن مجید کو اللہ تعالیٰ کی طرف سے آسان کیے جانے کا ایک کرشمہ اور معجزہ یہ ہے کہ یہ سہولت کے ساتھ حفظ ہو جاتا ہے۔ دنیا میں کوئی کتاب نہیں جس کے ہزاروں لاکھوں حافظ ہر زمانے میں پائے گئے ہوں اور یہ بھی اللہ تعالیٰ کا غیبی تصرف ہے کہ اس نے اپنی کتاب کی حفاظت کے لیے مسلمانوں کے دلوں میں اس کے حفظ کا شوق رکھ دیا ہے، گناہ گار سے گناہ گار مسلمان کی بھی خواہش ہوتی ہے کہ اس کا بچہ قرآن کا حافظ بنے۔ کمیونسٹوں نے اپنے زیر تسلط ملکوں میں قرآن کو مٹانے کی کوشش جتنی کر سکتے تھے کی، مگر مسلمانوں نے اپنے گھروں کے تہ خانوں میں کمیونسٹ جاسوسوں سے چھپ کر حفظِ قرآن کا سلسلہ جاری رکھا، جس کی برکت یہ ہوئی کہ کمیونسٹ قرآن کو مٹانے میں بری طرح ناکام ہوئے۔ اس وقت بھی دنیا میں قرآن کے حافظ لاکھوں کی تعداد میں موجود ہیں۔ (والحمدللہ) مزید دیکھیے سورۂ عنکبوت (۴۹) کی تفسیر۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 19،18) { كَذَّبَتْ عَادٌ فَكَيْفَ كَانَ عَذَابِيْ وَ نُذُرِ …:} ان آیات کی تفسیر کے لیے دیکھیے سورئہ حم السجدہ (۱۵، ۱۶) کی تفسیر۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19،18) { كَذَّبَتْ عَادٌ فَكَيْفَ كَانَ عَذَابِيْ وَ نُذُرِ …:} ان آیات کی تفسیر کے لیے دیکھیے سورئہ حم السجدہ (۱۵، ۱۶) کی تفسیر۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {تَنْزِعُ النَّاسَ كَاَنَّهُمْ اَعْجَازُ نَخْلٍ مُّنْقَعِرٍ: ’’نَزِعَ يَنْزَعُ نَزْعًا‘‘} (ع) {’’اَلشَّيْءَ مِنْ مَّكَانِهٖ‘‘} کسی چیز کو اس کی جگہ سے اکھاڑ پھینکنا۔ {’’ مُنْقَعِرٍ ‘‘ ’’ قَعْرٌ ‘‘} (گہرائی) سے ہے، اکھڑا ہوا۔ مزید دیکھیے سورۂ حاقہ(۷) کی تفسیر۔"
    },
    {
      "ayah": 21,
      "tafsir": ""
    },
    {
      "ayah": 22,
      "tafsir": ""
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 24،23) ➊ {كَذَّبَتْ ثَمُوْدُ بِالنُّذُرِ … :} صالح علیہ السلام کی قوم ثمود نے اپنے رسول کو نہ ماننے کی تین وجہیں بیان کیں، ایک یہ کہ یہ بشر ہے (دیکھیے بنی اسرائیل : ۹۴)، دوسری یہ کہ بشر بھی ہم جیسا عام بشر، کوئی سردار یا سرمایہ دار نہیں (دیکھیے ص : ۸) اور تیسری یہ کہ یہ اکیلا آدمی ہے، اس کے ساتھ کوئی جتھا یا پارٹی نہیں ہے۔ ¤ ➋ { اِنَّاۤ اِذًا لَّفِيْ ضَلٰلٍ وَّ سُعُرٍ: ’’ سُعُرٍ ‘‘} جنون، دیوانگی۔ {’’ ضَلٰلٍ ‘‘} اور {’’ سُعُرٍ ‘‘} پر تنوین تعظیم کی ہے اس لیے ترجمہ ’’بڑی گمراہی اور بڑی دیوانگی‘‘ کیا گیا ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24،23) ➊ {كَذَّبَتْ ثَمُوْدُ بِالنُّذُرِ … :} صالح علیہ السلام کی قوم ثمود نے اپنے رسول کو نہ ماننے کی تین وجہیں بیان کیں، ایک یہ کہ یہ بشر ہے (دیکھیے بنی اسرائیل : ۹۴)، دوسری یہ کہ بشر بھی ہم جیسا عام بشر، کوئی سردار یا سرمایہ دار نہیں (دیکھیے ص : ۸) اور تیسری یہ کہ یہ اکیلا آدمی ہے، اس کے ساتھ کوئی جتھا یا پارٹی نہیں ہے۔ ¤ ➋ { اِنَّاۤ اِذًا لَّفِيْ ضَلٰلٍ وَّ سُعُرٍ: ’’ سُعُرٍ ‘‘} جنون، دیوانگی۔ {’’ ضَلٰلٍ ‘‘} اور {’’ سُعُرٍ ‘‘} پر تنوین تعظیم کی ہے اس لیے ترجمہ ’’بڑی گمراہی اور بڑی دیوانگی‘‘ کیا گیا ہے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 26،25) ➊ {ءَاُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْۢ بَيْنِنَا … :} اس کی تفصیل کے لیے دیکھیے سورۂ ص (۸) کی تفسیر۔ ¤ ➋ { بَلْ هُوَ كَذَّابٌ اَشِرٌ: ’’ اَشِرٌ ‘‘ ’’أَشَرَ يَأْشِرُ أَشْرًا‘‘} (ض) سے اسم فاعل ہے، متکبر، اکڑنے والا۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26،25) ➊ {ءَاُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْۢ بَيْنِنَا … :} اس کی تفصیل کے لیے دیکھیے سورۂ ص (۸) کی تفسیر۔ ¤ ➋ { بَلْ هُوَ كَذَّابٌ اَشِرٌ: ’’ اَشِرٌ ‘‘ ’’أَشَرَ يَأْشِرُ أَشْرًا‘‘} (ض) سے اسم فاعل ہے، متکبر، اکڑنے والا۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) { اِنَّا مُرْسِلُوا النَّاقَةِ فِتْنَةً لَّهُمْ … :} اس کی تفصیل کے لیے دیکھیے سورۂ ہود (۶۴) اور سورۂ شعراء (۱۵۵) کی تفسیر۔ {’’ فَارْتَقِبْهُمْ ‘‘ ’’رَقَبَ يَرْقُبُ‘‘} (ن) سے باب افتعال ہے۔ {’’ وَ اصْطَبِرْ ‘‘ ’’صَبَرَ يَصْبِرُ صَبْرًا‘‘} (ض) سے باب افتعال ہے، ’’تاء‘‘ کو ’’طاء‘‘ سے بدل دیا۔ حروف کے اضافے سے معنی میں مبالغہ پیدا ہو گیا ہے، ان کا حوصلے سے انتظار کر اور اچھی طرح صبر کر۔ یعنی اس آزمائش میں یہ لوگ کیا طرزِ عمل اختیار کرتے ہیں حوصلے کے ساتھ اس کا انتظار کر اور بہت اچھے طریقے سے صبر کر۔ آزمائش اس لیے تھی کہ ان کا امتحان مقصود تھا کہ اس نشانی کو دیکھ کر وہ پیغمبر پر ایمان لاتے ہیں یا اسے نقصان پہنچا کر عذاب کے مستحق بنتے ہیں۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) { وَ نَبِّئْهُمْ اَنَّ الْمَآءَ قِسْمَةٌۢ بَيْنَهُمْ … :} اس کی وضاحت کے لیے دیکھیے سورئہ شعراء (۱۵۵) کی تفسیر۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) {فَنَادَوْا صَاحِبَهُمْ فَتَعَاطٰى فَعَقَرَ: ’’ فَتَعَاطٰى ‘‘ ’’عَطَا يَعْطُوْ عَطْوًا‘‘ (ن) ’’اَلشَّيْءَ‘‘} کسی چیز کو پکڑنا۔ {’’تَعَاطَي الشَّيْءَ‘‘} کسی چیز کو پکڑنا اور {’’ تَعَاطَي الْأَمْرَ ‘‘} کسی کام کا ذمہ اٹھانا۔ ایک مدت تک یہ ایک دن کی باری کا سلسلہ جاری رہا۔ صالح علیہ السلام نے انھیں تنبیہ کی تھی کہ اسے کسی قسم کا نقصان نہ پہنچانا، ورنہ تم پر عذاب آ جائے گا۔ ایمان نہ لانے کے باوجود دل سے وہ انھیں سچا جانتے تھے، اس لیے وہ اونٹنی کو نقصان پہنچانے سے خائف تھے، لیکن آخرکار صبر نہ کر سکے اور انھوں نے اس کا قصہ تمام کرنے کا فیصلہ کر لیا۔ اس کے لیے انھوں نے اپنے ایک سردار کو ابھارا جسے اللہ تعالیٰ نے اس قوم کا سب سے شقی آدمی قرار دیا ہے، فرمایا : « اِذِ انْۢبَعَثَ اَشْقٰىهَا» [ الشمس : ۱۲ ] ’’جب اس کا سب سے بڑا بدبخت اٹھا۔‘‘ چنانچہ سب نے مل کر اسے مدد کے لیے پکارا کہ تو بڑا بہادر اور جری ہے۔ اس نے اس کام کا بیڑا اٹھایا اور اس اونٹنی کی کونچیں کاٹ کر اسے مار ڈالا۔ مزید دیکھیے سورۂ شمس (۱۱،۱۲) کی تفسیر۔ {’’ فَتَعَاطٰى ‘‘} کا مفعول محذوف ہے : {’’ أَيْ تَعَاطَي السَّيْفَ‘‘} (اس نے تلوار پکڑی) {’’ أَوْ تَعَاطَي الْأَمْرَ‘‘} (یا اس نے اس کام کا ذمہ اٹھایا)۔"
    },
    {
      "ayah": 30,
      "tafsir": ""
    },
    {
      "ayah": 31,
      "tafsir": "(آیت 31) ➊ { اِنَّاۤ اَرْسَلْنَا عَلَيْهِمْ صَيْحَةً وَّاحِدَةً:} اس کی تفسیر کے لیے دیکھیے اعراف (۷۸) کی تفسیر۔ ¤ ➋ { فَكَانُوْا كَهَشِيْمِ الْمُحْتَظِرِ: ’’هَشَمَ يَهْشِمُ هَشْمًا‘‘ (ض) ’’اَلشَّيءَ‘‘} کسی چیز کو توڑ کر اور کچل کر ریزہ ریزہ کر دینا۔ {’’هَشِيْمٌ‘‘} روندی، کچلی ہوئی۔ {’’حَظِيْرَةٌ‘‘} باڑ کو کہتے ہیں جو جانوروں کے ارد گرد ٹہنیوں وغیرہ کے ساتھ بنائی جاتی ہے۔ اور{’’ الْمُحْتَظِرِ ‘‘} باڑ بنانے والا۔باڑ کے پتے اور ٹہنیاں جو خشک ہو کر ٹوٹتی اور نیچے گرتی ہیں اور جانوروں کے پاؤں کے نیچے آکر کچلی اور روندی جاتی ہیں اور چورا بن جاتی ہیں انھیں {’’هَشِيْمٌ‘‘} کہا جاتا ہے۔ قومِ ثمود کا عذاب کے ساتھ جو حال ہوا اسے ان پتوں اور ٹہنیوں کے ساتھ تشبیہ دی ہے جو باڑ سے گر کر جانوروں کے پاؤں میں آ کر چورا بن جاتے ہیں۔"
    },
    {
      "ayah": 32,
      "tafsir": ""
    },
    {
      "ayah": 33,
      "tafsir": ""
    },
    {
      "ayah": 34,
      "tafsir": "(آیت 34) ➊ {اِنَّاۤ اَرْسَلْنَا عَلَيْهِمْ حَاصِبًا:} قومِ لوط کی بستیاں الٹانے کے بعد ان پر پتھروں کی جو بارش ہوئی وہ مراد ہے۔ مزید دیکھیے سورۂ ہود (۸۳)۔ ¤ ➋ { اِلَّاۤ اٰلَ لُوْطٍ:} لوط علیہ السلام پر ان کی قوم میں سے ایک آدمی بھی ایمان نہیں لایا، حتیٰ کہ ان کی بیوی بھی کافر ہی رہی۔ (دیکھیے ذاریات : ۳۶۔ ہود : ۸۱) اس لیے یہاں ’’ آلِ لوط ‘‘ سے مراد صرف ان کی اولاد ہے، جن کے ساتھ وہ خود بھی تھے۔ اللہ تعالیٰ نے کافر کو پیغمبر کی آل اور اہل تسلیم نہیں کیاخواہ بیوی ہو، جیسے لوط علیہ السلام کی بیوی، یا بیٹا ہو جیسے نوح علیہ السلام کا بیٹا،اس کے بارے میں فرمایا : « اِنَّهٗ لَيْسَ مِنْ اَهْلِكَ » [ ھود : ۴۶ ] ’’بے شک وہ تیرے گھر والوں سے نہیں۔‘‘ ¤ ➌ { نَجَّيْنٰهُمْ بِسَحَرٍ:} اس کی تفسیر کے لیے دیکھیے سورۂ ہود (۸۱) کی تفسیر۔"
    },
    {
      "ayah": 35,
      "tafsir": "(آیت 35) {نِعْمَةً مِّنْ عِنْدِنَا......:} اس میں اپنی نعمت کی عظمت کی طرف توجہ دلانا مقصود ہے۔ لوط علیہ السلام اور ان کے گھر والوں کو اس عذاب سے بچانا ہماری خاص نعمت تھی ۔ اس سے اگلے جملے { ”كَذٰلِكَ نَجْزِيْ مَنْ شَكَرَ“ } سے ان کی اس نعمت کا اہل بننے کی وجہ بھی معلوم ہو رہی ہے کہ وہ اللہ تعالیٰ کی نعمتوں کا شکر ادا کرنے والے تھے: اس لیے ہم نے انہیں اس عظیم نعمت سے نوازا ، جیسا کہ فرمایا «لَئِنْ شَکَرْتُمْ لَاَزِیْدَنَّکُمْ» [ابراہیم: ٧] ”بے شک اگر تم شکر کر و گے تو میں ضرور ہی تمہیں زیادہ دوں گا“ ۔ اور صرف انہی کو نہیں بلکہ جو بھی ہماری نعمتوں کی قدر کرے ہم اسے ایسے ہی جزا دیتے ہیں۔"
    },
    {
      "ayah": 36,
      "tafsir": "(آیت 36) {وَ لَقَدْ اَنْذَرَهُمْ بَطْشَتَنَا فَتَمَارَوْا بِالنُّذُرِ: ’’تَمَارٰي يَتَمَارٰي تَمَارِيًا‘‘} (تفاعل) شک کرنا، جھگڑنا۔ ’’لام‘‘ اور {’’قَدْ‘‘} کے ساتھ تاکید قسم کے مفہوم کی قوت رکھتی ہے، یعنی قسم ہے کہ لوط علیہ السلام نے انھیں ہماری گرفت سے ڈرایا تھا، مگر انھوں نے اس ڈرانے پر یقین نہیں کیا، بلکہ شک میں پڑے رہے اور اس کے متعلق بحث اور جھگڑا ہی کرتے رہے۔"
    },
    {
      "ayah": 37,
      "tafsir": "(آیت 37) {وَ لَقَدْ رَاوَدُوْهُ عَنْ ضَيْفِهٖ …: ’’ رَاوَدُوْهُ ‘‘} باب مفاعلہ سے ہے۔ {’’مُرَاوَدَةٌ‘‘} نرمی اور ملائمت سے باربار مطالبہ کرنا، پھسلانا، بہکانا، فریب سے غلط کام پر آمادہ کرنا۔ یہاں باب مفاعلہ مشارکت کے لیے نہیں مبالغہ کے لیے ہے۔ {’’ ضَيْفِهٖ ‘‘} سے مراد فرشتے ہیں جو خوبصورت لڑکوں کی شکل میں مہمان بن کر آئے تھے۔ قوم کو ان کے آنے کا علم ہوا تو انھوں نے لوط علیہ السلام سے مطالبہ کیا کہ انھیں ان کے حوالے کر دیں۔ {’’ رَاوَدُوْهُ ‘‘} کے لفظ سے ظاہر ہے کہ انھوں نے لوط علیہ السلام پر دھوکے، فریب، بہکانے، پھسلانے، دھونس اور دھاندلی کا ہر طریقہ آزمایا کہ کسی طرح ہی وہ دھوکے میں آ کر انھیں ان کے حوالے کر دیں۔ وہ لوگ جو اس مقصد کے لیے آئے تھے جب حد سے بڑھ گئے اور ان لڑکوں کو زبردستی چھیننے کے لیے گھر میں داخل ہونے لگے اور لوط علیہ السلام سخت گھبرا گئے تو فرشتوں نے بتایا کہ ہم آپ کے رب کی طرف سے بھیجے ہوئے ہیں، یہ لوگ آپ تک کسی صورت نہیں پہنچ سکیں گے۔ (دیکھیے ہود : 81،80) اس وقت اللہ تعالیٰ نے ان کی آنکھیں مٹا دیں، انھیں اندھا کر دیا کہ بڑا عذاب آنے سے پہلے میرے اس عذاب اور میری تنبیہ کا مزا چکھو۔"
    },
    {
      "ayah": 38,
      "tafsir": "(آیت 38) { وَ لَقَدْ صَبَّحَهُمْ بُكْرَةً عَذَابٌ مُّسْتَقِرٌّ:} اس کی تفصیل کے لیے دیکھیے سورۂ ہود (۸۲، ۸۳) کی تفسیر۔"
    },
    {
      "ayah": 39,
      "tafsir": "(آیت 40،39) {فَذُوْقُوْا عَذَابِيْ وَ نُذُرِ …:} یہاں قوم نوح، عاد، ثمود اور قومِ لوط چاروں کے تذکرے میں یہ دونوں باتیں بار بار دہرائی ہیں، تاکہ متعدد مرتبہ ذکر کے دوران کسی بار ہی ان کی طرف توجہ ہو جائے۔سورۂ رحمن میں {’’ فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ ‘‘} اور سورۂ مرسلات میں {’’ وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ‘‘} کو بار بار دہرانے میں بھی یہی حکمت ملحوظ ہے۔"
    },
    {
      "ayah": 40,
      "tafsir": "(آیت 40،39) {فَذُوْقُوْا عَذَابِيْ وَ نُذُرِ …:} یہاں قوم نوح، عاد، ثمود اور قومِ لوط چاروں کے تذکرے میں یہ دونوں باتیں بار بار دہرائی ہیں، تاکہ متعدد مرتبہ ذکر کے دوران کسی بار ہی ان کی طرف توجہ ہو جائے۔سورۂ رحمن میں {’’ فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ ‘‘} اور سورۂ مرسلات میں {’’ وَيْلٌ يَّوْمَىِٕذٍ لِّلْمُكَذِّبِيْنَ ‘‘} کو بار بار دہرانے میں بھی یہی حکمت ملحوظ ہے۔"
    },
    {
      "ayah": 41,
      "tafsir": "(آیت 41) {وَ لَقَدْ جَآءَ اٰلَ فِرْعَوْنَ النُّذُرُ:} آلِ فرعون کو ڈرانے اور خبردار کرنے والوں سے مراد ان کے پاس آنے والے پیغمبر موسیٰ اور ہارون علیھما السلام بھی ہیں اور ان کو دیے جانے والے نو (۹) معجزات بھی، جنھیں اللہ تعالیٰ نے {’’ تِسْعَ اٰيٰتٍۭ بَيِّنٰتٍ ‘‘} قرار دیا ہے۔ تفصیل کے لیے دیکھیے سورۂ بنی اسرائیل (۱۰۱) کی تفسیر۔"
    },
    {
      "ayah": 42,
      "tafsir": "(آیت 42) {كَذَّبُوْا بِاٰيٰتِنَا كُلِّهَا فَاَخَذْنٰهُمْ … : ’’ عَزِيْزٍ ‘‘} سب پر غالب، جو کرنا چاہے اسے کوئی روک نہیں سکتا۔ {’’ مُقْتَدِرٍ ‘‘’’قَدَرَ يَقْدِرُ‘‘} (ض) سے باب افتعال ہے، حروف زیادہ ہونے کی وجہ سے {’’ مُقْتَدِرٍ ‘‘} میں {’’ قَادِرٌ ‘‘} اور{’’ قَدِيْرٌ ‘‘} کی بہ نسبت قدرت کا معنی زیادہ ہے، یعنی جو کرنا چاہے اس کی پوری قدرت رکھتا ہے، کسی طرح عاجز نہیں۔ آلِ فرعون پر آنے والی گرفت کی شدت اور ہولناکی کا بیان مقصود ہے۔ مزید دیکھیے سورۂ ہود (۱۰۲)۔"
    },
    {
      "ayah": 43,
      "tafsir": "(آیت 43) ➊ { اَكُفَّارُكُمْ خَيْرٌ مِّنْ اُولٰٓىِٕكُمْ:} یہ خطاب قریش کے لوگوں سے ہے کہ ان اقوام پر کفر و تکذیب کے نتیجے میں یہ عذاب آئے، اگر تم کفر اختیار کرو گے تو کیا تم میں سے کفر کرنے والے کسی بھی لحاظ سے ان سے بہتر ہیں کہ ان پر عذاب نہیں آئے گا؟ استفہام انکاری ہے، یعنی ایسا نہیں ہے۔ قریش کے علاوہ قیامت تک کے تمام لوگ بھی اس کے مخاطب ہیں، کیونکہ وہ سب رسول اللہ صلی اللہ علیہ وسلم کی امتِ دعوت ہیں۔ ¤ ➋ {اَمْ لَكُمْ بَرَآءَةٌ فِي الزُّبُرِ:} یا پہلی آسمانی کتابوں میں تمھارے متعلق لکھا ہوا ہے کہ تم جو چاہو کرو، تم پر پہلی قوموں کی طرح عذاب نہیں آئیں گے؟ ظاہر ہے ایسا بھی نہیں۔"
    },
    {
      "ayah": 44,
      "tafsir": "(آیت 44) {اَمْ يَقُوْلُوْنَ نَحْنُ جَمِيْعٌ مُّنْتَصِرٌ:} یہاں{’’ جَمِيْعٌ ‘‘ ’’كُلٌّ‘‘} (تمام)کے معنی میں نہیں بلکہ ’’یاء‘‘ کے اضافے کے ساتھ {’’جَمْعٌ‘‘} کے معنی میں ہے، مضبوط جماعت۔ {’’اِنْتَصَرَ يَنْتَصِرُ اِنْتِصَارًا‘‘} ظالم سے بچاؤ کرنا، دشمن سے انتقام لینا، مدِ مقابل پر غالب آنا۔ یا پھر ان کا کہنا یہ ہے کہ نہ ہم پہلوں سے بہتر ہیں اور نہ کسی کتاب میں ہمارے عذاب سے محفوظ رہنے کی کوئی بات موجود ہے، مگر ہم ایک مضبوط جماعت ہیں جو اپنا بچاؤ کر سکتے ہیں، بدلا بھی لے سکتے ہیں اور مدِ مقابل پر غالب بھی آ سکتے ہیں، اس لیے ہمیں کوئی خوف نہیں۔ آیت میں التفات ہے، یعنی پچھلی آیت {’’ اَكُفَّارُكُمْ خَيْرٌ ‘‘} میں خطاب کا صیغہ ہے اور یہاں غائب کے صیغے کے ساتھ ان کا ذکر ہے، مراد ان کی تحقیر ہے کہ ایسی ڈینگیں مارنے والے خطاب کے قابل نہیں۔"
    },
    {
      "ayah": 45,
      "tafsir": "(آیت 45) {سَيُهْزَمُ الْجَمْعُ وَ يُوَلُّوْنَ الدُّبُرَ: ’’ الْجَمْعُ ‘‘} پر الف لام عہد خارجی کا ہے، یعنی وہ جماعت جس کاپچھلی آیت کے لفظ {’’ جَمِيْعٌ ‘‘} میں ذکر ہے۔ اس لیے ترجمہ ’’یہ جماعت‘‘ کیا گیا ہے۔ یعنی اگر ان کا یہ کہنا ہے تو یاد رکھیں کہ یہ جماعت اپنے خیال میں جتنی بھی زبردست ہو بہت جلد شکست کھائے گی اور یہ لوگ پیٹھ پھیر کر بھاگ جائیں گے۔ {’’ الدُّبُرَ ‘‘} کا لفظ واحد ہے، مراد جنس ہے : {’’أَيْ يُوَلِّيْ كُلُّ وَاحِدٍ مِّنْهُمْ دُبُرَهُ‘‘} ’’یعنی ان میں سے ہر ایک پیٹھ پھیر کر بھاگے گا۔‘‘ یہ آیات کے آخری حروف کی موافقت کے لیے ہے۔ یہ آیات مکہ میں نازل ہوئیں، جب مسلمان مظلوم و مقہور تھے، کوئی سوچ بھی نہیں سکتا تھا کہ قریشِ مکہ جیسے قوت و شوکت والے لوگ بھی کسی وقت ان کمزور اور بے بس مسلمانوں سے شکست کھائیں گے اور پیٹھ پھیر کر بھاگیں گے۔ جن مسلمانوں میں سے کچھ جان بچا کر حبش میں پناہ لے چکے تھے، کچھ شعبِ ابی طالب میں محصور تھے اور قریش کے مقاطع اور محاصرے کی وجہ سے بھوکوں مر رہے تھے۔ مگر اللہ تعالیٰ کے وعدے کے مطابق وہ وقت آیا اور فی الواقع تھوڑے ہی عرصے میں بدر و احزاب اور دوسری جنگوں کے موقع پر یہ پیش گوئی پوری ہوئی۔ بدر کے موقع پر معرکہ برپا ہونے سے پہلے رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت پڑھی، تب صحابہ کو معلوم ہوا کہ یہ وہ ہزیمت تھی جس کی وعید اللہ تعالیٰ نے کفارِ مکہ کو سنائی تھی۔ عبداللہ بن عباس رضی اللہ عنھما بیان کرتے ہیں کہ بدر کے دن رسول اللہ صلی اللہ علیہ وسلم اپنے خیمے میں تھے، اس وقت آپ صلی اللہ علیہ وسلم نے فرمایا : [ اَللّٰهُمَّ إِنِّيْ أَنْشُدُكَ عَهْدَكَ وَوَعْدَكَ، اَللّٰهُمَّ إِنْ تَشَأْ لاَ تُعْبَدْ بَعْدَ الْيَوْمِ ] ’’اے اللہ! میں تجھے تیرے عہد اور تیرے وعدے کا واسطہ دیتا ہوں۔ اے اللہ! اگر تو چاہتا ہے کہ آج کے بعد تیری عبادت نہ کی جائے (تو اس تھوڑی سی جمعیت کو مٹ جانے کے لیے بے یارومددگار چھوڑ دے، ورنہ اس کی ضرور مدد فرما)۔‘‘ تو ابوبکر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کا ہاتھ پکڑا اور کہنے لگے : ’’اے اللہ کے رسول! بس کیجیے، آپ نے اپنے رب سے نہایت اصرار کے ساتھ دعا کی ہے۔‘‘ تو آپ صلی اللہ علیہ وسلم زرہ پہنے ہوئے اچھلتے ہوئے نکلے اور آپ یہ آیت پڑھ رہے تھے : « سَيُهْزَمُ الْجَمْعُ وَ يُوَلُّوْنَ الدُّبُرَ » ’’ عنقریب یہ جماعت شکست کھائے گی اور یہ لوگ پیٹھ پھیر کر بھاگیں گے ۔‘‘ [ بخاري، التفسیر، باب قولہ: {سیھزم الجمع } : ۴۸۷۵ ]"
    },
    {
      "ayah": 46,
      "tafsir": "(آیت 46) { بَلِ السَّاعَةُ مَوْعِدُهُمْ … : ’’دَاهِيَةٌ‘‘} بڑی مصیبت کو کہتے ہیں اور {’’ اَدْهٰى ‘‘} زیادہ بڑی مصیبت۔ {’’مُرٌّ‘‘} (میم کے ضمہ کے ساتھ) تلخ، کڑوا۔ {’’مَرَّ يَمُرُّ مَرَارَةً‘‘} (ن) کڑوا ہونا۔ {’’اَمَرُّ‘‘} اس سے اسم تفضیل ہے، زیادہ تلخ۔ یعنی دنیا میں ہونے والی شکست بھی اگرچہ بڑی مصیبت اور بہت تلخ ہے کہ اس میں قتل، گرفتاری، غلامی، ذلت و رسوائی اور کئی طرح کی سزائیں ہیں، مگر اصل سزا کا وعدہ تو قیامت کے دن ہے اور قیامت دنیا کی مصیبتوں سے کہیں زیادہ بڑی مصیبت اور بہت زیادہ تلخ ہے، کیونکہ دنیا کی مصیبت اور تلخی آخر کار ختم ہونے والی ہے، مگر آخرت کی سزا کبھی ختم ہونے والی نہیں، پھر وہاں کی آگ دنیا کی آگ سے ستر(۷۰) گنا زیادہ سخت ہے۔"
    },
    {
      "ayah": 47,
      "tafsir": "(آیت 47) { اِنَّ الْمُجْرِمِيْنَ فِيْ ضَلٰلٍ وَّ سُعُرٍ:} مجرمین سے مراد مشرکین ہیں، جیسا کہ فرمایا : « اِنَّ الَّذِيْنَ اَجْرَمُوْا كَانُوْا مِنَ الَّذِيْنَ اٰمَنُوْا يَضْحَكُوْنَ» [ المطففین : ۲۹ ] ’’بے شک وہ لوگ جنھوں نے جرم کیے،ان لوگوں پر جو ایمان لائے، ہنسا کرتے تھے۔‘‘ اور فرمایا : « هٰذِهٖ جَهَنَّمُ الَّتِيْ يُكَذِّبُ بِهَا الْمُجْرِمُوْنَ» [ الرحمٰن : ۴۳ ] ’’یہی ہے وہ جہنم جسے مجرم لوگ جھٹلاتے تھے۔ ‘‘ یعنی مشرکین اپنی دانست میں بڑے دانا اور صحیح راستے پر چلنے والے ہیں، مگر حقیقت یہ ہے کہ وہ بہت بڑی گمراہی اور دیوانگی میں مبتلا ہیں۔"
    },
    {
      "ayah": 48,
      "tafsir": "(آیت 48) {يَوْمَ يُسْحَبُوْنَ فِي النَّارِ عَلٰى وُجُوْهِهِمْ … : ’’ سَقَرَ ‘‘} جہنم کا علم(نام) ہے اور مؤنث سماعی ہے، اس لیے غیر منصرف ہے اور اس پر تنوین نہیں آتی۔ اشتقاق اس کا {’’سَقَرَتْهُ النَّارُ‘‘} (آگ نے اسے جھلس دیا) سے ہے، یعنی ان پر ان کی ضلالت اور دیوانگی اس دن واضح ہو گی جب انھیں ان کے چہروں کے بل آگ میں گھسیٹا جائے گا اور کہا جائے گا کہ جہنم کے چھونے کا مزہ چکھو۔ مزید دیکھیے سورۂ فرقان (۳۴)۔"
    },
    {
      "ayah": 49,
      "tafsir": "(آیت 49) ➊ { اِنَّا كُلَّ شَيْءٍ خَلَقْنٰهُ بِقَدَرٍ:’’ بِقَدَرٍ ‘‘} پر تنوین تعظیم کی ہے۔ یعنی اگر انھیں شبہ ہے کہ قیامت ابھی واقع کیوں نہیں ہوتی تو اس کی وجہ یہ ہے کہ ہم نے ہر چیز کو اپنے عظیم مستحکم اندازے کے ساتھ پیدا کیا ہے جو کبھی غلط نہیں ہو سکتا، کیونکہ ہمیں گزشتہ کی طرح آئندہ کا بھی پورا علم ہے کہ کوئی بھی چیز کس طرح ہو گی، کتنی ہو گی اور کب ہو گی؟ غرض ہم نے اس کی شکل و صورت، زمان و مکاں، قوت و ضعف وغیرہ ہر چیز کا اندازہ طے کر دیا ہے، مثلاً جس کے قد کا اندازہ چھ فٹ طے کیا ہے وہ چھ فٹ ہی ہو گا، جسے سعید طے کر دیا ہے وہ سعید ہو گا اور جسے شقی طے کر دیا ہے وہ شقی ہو گا، جس کا جتنا وقت مقرر کیا ہے اس سے ایک لمحہ آگے پیچھے نہیں ہو گا۔ چنانچہ ہم نے قیامت کا بھی ایک وقت مقرر کر رکھا ہے، نہ وہ اس سے پہلے آسکتی ہے نہ اس سے ایک لمحہ کی تاخیر ہو گی۔ تمھارے مطالبے کے مطابق اگر وہ ابھی واقع نہیں ہوتی تو یہ مت سمجھو کہ وہ واقع ہو گی ہی نہیں۔ اس آیت سے ملتی جلتی یہ آیت ہے : «وَ كُلُّ شَيْءٍ عِنْدَهٗ بِمِقْدَارٍ» [ الرعد : ۸ ] ’’اور ہر چیز اس کے ہاں ایک اندازے سے ہے۔ ‘‘ اور سورۂ مرسلات کی یہ آیت : « فَقَدَرْنَا فَنِعْمَ الْقٰدِرُوْنَ » [ المرسلات : ۲۳] ’’پس ہم نے اندازہ کیا تو ہم اچھے اندازہ کرنے والے ہیں۔‘‘ ¤ ➋ { ’’قَدَرٌ‘‘} سے مراد تقدیر ہے جو ان چھ چیزوں میں شامل ہے جن پر ایمان کا دارومدار ہے۔ حدیثِ جبریل میں ہے کہ جبریل علیہ السلام نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا کہ مجھے ایمان کے متعلق بتائیے؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَنْ تُؤْمِنَ بِاللّٰهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ ] [ مسلم، الإیمان، باب بیان الإیمان و الإسلام والإحسان … : ۸ ] ’’یہ کہ تو اللہ تعالیٰ پر اور اس کے فرشتوں اور اس کی کتابوں اور اس کے رسولوں اور یومِ آخرت پر ایمان لائے اور تقدیر اچھی یا بری، اس پر ایمان لائے۔‘‘ یعنی اچھی تقدیر کا خالق بھی اللہ تعالیٰ ہے اور بری کا بھی، مجوس کی طرح نہیں جو دو خالق مانتے ہیں، ایک خالقِ خیر اور ایک خالقِ شر۔ عبداللہ بن عمرو رضی اللہ عنھما بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم فرماتے تھے : [ كَتَبَ اللّٰهُ مَقَادِيْرَ الْخَلاَئِقِ قَبْلَ أَنْ يَّخْلُقَ السَّمَاوَاتِ وَالْأَرْضَ بِخَمْسِيْنَ أَلْفَ سَنَةٍ قَالَ وَعَرْشُهُ عَلَی الْمَاءِ] [ مسلم، القدر، باب حجاج آدم و موسٰی صلی اللہ علیہما وسلم: ۲۶۵۳ ] ’’اللہ تعالیٰ نے تمام مخلوقات کی تقدیریں آسمان و زمین پیدا کرنے سے پچاس ہزار سال پہلے لکھ دیں۔‘‘ فرمایا : ’’اور ( اس وقت)اس کا عرش پانی پر تھا۔‘‘ عبداللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كُلُّ شَيْءٍ بِقَدَرٍ حَتَّی الْعَجْزِ وَالْكَيْسِ ] [مسلم، القدر، باب کل شيء بقدر : ۲۶۵۵ ] ’’ہر چیز تقدیر سے ہے، حتیٰ کہ عاجزی اور ہو شیاری بھی۔‘‘ یعنی بعض لوگ جو بے کار اور نکھٹو ہوتے ہیں اور بعض عقل مند اور ہو شیار، تو یہ بھی تقدیر میں لکھا جا چکا ہے۔"
    },
    {
      "ayah": 50,
      "tafsir": "(آیت 50) ➊ {وَ مَاۤ اَمْرُنَاۤ اِلَّا وَاحِدَةٌ كَلَمْحٍۭ بِالْبَصَرِ:} یعنی بے شک قیامت بہت بڑی چیز ہے، جس کی ہیبت سے آسمان و زمین لرزتے ہیں، جیساکہ فرمایا : «ثَقُلَتْ فِي السَّمٰوٰتِ وَ الْاَرْضِ » [ الأعراف : ۱۸۷ ] ’’وہ آسمانوں اور زمین میں بھاری واقع ہوئی ہے۔‘‘ مگر یہ مت سمجھو کہ ہمارے لیے اس کا قائم کرناکچھ دشوار ہے، یا ہم لانا چاہیں تو اس کے آنے میں دیر ہو جائے گی، ہمارا تو صرف ایک حکم ہوتا ہے اور آنکھ جھپکنے میں کام ہو جاتا ہے، جیسا کہ فرمایا : « اِنَّمَااَمْرُهٗۤ اِذَاۤ اَرَادَ شَيْـًٔا اَنْ يَّقُوْلَ لَهٗ كُنْ فَيَكُوْنُ» [ یٰس : ۸۲ ] ’’اس کا حکم تو، جب وہ کسی چیز کا ارادہ کرتا ہے، اس کے سوا نہیں ہوتا کہ اسے کہتا ہے ’’ہو جا‘‘ تو وہ ہو جاتی ہے۔ ‘‘ مزید دیکھیے سورۂ نحل (۷۷)۔ ¤ ➋ یہاں ایک سوال ہے کہ {’’ وَ مَاۤ اَمْرُنَاۤ ‘‘} کے بعد {’’إِلَّا وَاحِدٌ‘‘} ہونا چاہیے تھا، {’’ وَاحِدَةٌ ‘‘} کیوں فرمایا؟ جواب اس کا یہ ہے کہ اس سے مراد {’’كَلِمَةٌ وَاحِدَةٌ‘‘} ہے، یعنی ہمارا حکم صرف ایک کلمۂ {’’ كُنْ ‘‘} ہوتا ہے۔"
    },
    {
      "ayah": 51,
      "tafsir": "(آیت 51) {وَ لَقَدْ اَهْلَكْنَاۤ اَشْيَاعَكُمْ … :} قیامت پر قادر ہونے کا ایک نمونہ پیش کرتے ہوئے فرمایا کہ قسم ہے کہ ہم نے تمھارے جیسی کئی جماعتوں مثلاً عاد و ثمود وغیرہ کو ہلاک کر ڈالا۔ وہ بھی یہ بات ماننے کے لیے تیار نہیں تھے کہ ان پر عذاب آ سکتا ہے، مگر جب عذاب آیا تو اچانک آیا۔ ایسے ہی قیامت بھی اچانک آئے گی، تو کیا ہے کوئی جو اپنے جیسے ان گروہوں سے عبرت حاصل کرے اور قیامت کی تیاری کرے؟ یہاں پھر التفات ہے، یعنی مشرکین کو مخاطب فرما لیا ہے، کیونکہ مقصود ڈانٹنا ہے۔ {’’أَشْيَاعٌ‘‘ ’’شِيْعَةٌ‘‘} کی جمع ہے، ایک جیسا عقیدہ رکھنے والی جماعت کے لوگ جو ایک دوسرے کا ساتھ دیتے ہوں۔ یہاں {’’ اَشْيَاعَكُمْ ‘‘} کا مطلب یہ ہے کہ وہ لوگ بھی کفر و شرک میں تمھارے جیسے تھے۔"
    },
    {
      "ayah": 52,
      "tafsir": "(آیت 53،52) {وَ كُلُّ شَيْءٍ فَعَلُوْهُ فِي الزُّبُرِ … : ’’ مُسْتَطَرٌ ‘‘ ’’ مَسْطُوْرٌ ‘‘} کے معنی میں ہے۔ افتعال کی تاء کی وجہ سے معنی میں مبالغہ مقصود ہے کہ ہر چھوٹی بڑی بات بہت اچھی طرح لکھی ہوئی ہے، مراد اعمال نامے ہیں۔ یعنی ان مجرموں نے جو کچھ کیا ہے سب دفتروں میں درج ہے۔ مزید دیکھیے سورۂ کہف (۴۹) اور سورۂ انفطار (۱۰ تا۱۲)۔"
    },
    {
      "ayah": 53,
      "tafsir": "(آیت 53،52) {وَ كُلُّ شَيْءٍ فَعَلُوْهُ فِي الزُّبُرِ … : ’’ مُسْتَطَرٌ ‘‘ ’’ مَسْطُوْرٌ ‘‘} کے معنی میں ہے۔ افتعال کی تاء کی وجہ سے معنی میں مبالغہ مقصود ہے کہ ہر چھوٹی بڑی بات بہت اچھی طرح لکھی ہوئی ہے، مراد اعمال نامے ہیں۔ یعنی ان مجرموں نے جو کچھ کیا ہے سب دفتروں میں درج ہے۔ مزید دیکھیے سورۂ کہف (۴۹) اور سورۂ انفطار (۱۰ تا۱۲)۔"
    },
    {
      "ayah": 54,
      "tafsir": "(آیت 54) { اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّ نَهَرٍ:} کفار کے بعد متقی لوگوں کا انجام ذکر فرمایا کہ وہ باغوں اور نہروں میں ہوں گے۔ (دیکھیے طور : ۱۷) آیات کے آخری حروف کی موافقت کے لیے {’’ نَهَرٍ ‘‘} کا لفظ مفرد لایا گیا، مراد جنس ہے، جس میں ہر قسم کی نہریں شامل ہیں۔ جنت کی نہروں کے لیے دیکھیے سورۂ محمد کی آیت (۱۵) کی تفسیر۔"
    },
    {
      "ayah": 55,
      "tafsir": "(آیت 55) ➊ { فِيْ مَقْعَدِ صِدْقٍ عِنْدَ مَلِيْكٍ مُّقْتَدِرٍ:} یہاں {’’ مُقْتَدِرٍ ‘‘} بمعنی {’’صَادِقٌ‘‘} برائے مبالغہ ہے، جیسے {’’عَدْلٌ‘‘} بمعنی {’’عَادِلٌ‘‘} برائے مبالغہ ہے اور {’’ مَقْعَدِ ‘‘ } موصوف اپنی صفت {’’ صِدْقٍ ‘‘} (بمعنی {صَادِقٌ}) کی طرف مضاف ہے، جیسے کہا جاتا ہے : {’’مَسْجِدُ الْجَامِعِ۔‘‘ ’’ صِدْقٍ ‘‘} کا اصل معنی خبر کا واقع کے مطابق ہونا ہے۔’’ فلاں شخص صادق ہے ‘‘ کا مطلب یہ ہے کہ وہ جو بات کہتا ہے وہ واقع میں اسی طرح ہوتی ہے جیسے اس نے کہا۔ پھر یہ لفظ کسی بھی چیز کی تعریف کے لیے اور اس کے اپنے اوصاف میں کامل ہونے کے لیے بولا جانے لگا۔ {’’ فُلَانٌ رَجُلُ صِدْقٍ‘‘} یعنی وہ رجولیت میں کامل ہے۔ اردو میں کہا جاتا ہے ’’ فلاں سچ مچ مرد ہے۔‘‘ اللہ تعالیٰ نے فرمایا : « وَ لَقَدْ بَوَّاْنَا بَنِيْۤ اِسْرَآءِيْلَ مُبَوَّاَ صِدْقٍ » [یونس : ۹۳ ] ’’اور ہم نے بنی اسرائیل کو ٹھکانا دیا جو ٹھکانا ہونے میں کامل تھا، سچ مچ کا باعزت ٹھکانا تھا۔ ‘‘ اور فرمایا : « وَ اجْعَلْ لِّيْ لِسَانَ صِدْقٍ فِي الْاٰخِرِيْنَ» [ الشعراء : ۸۴ ] ’’اور پیچھے آنے والوں میں میرے لیے سچی ناموری رکھ۔‘‘ اور فرمایا : «وَ قُلْ رَّبِّ اَدْخِلْنِيْ مُدْخَلَ صِدْقٍ » [ بني إسرائیل : ۸۰ ] ’’اور کہہ اے میرے رب! داخل کر مجھے سچا داخل کرنا۔‘‘ {’’ فِيْ مَقْعَدِ صِدْقٍ ‘‘} کا مطلب یہ ہے کہ وہ ایسی مجلس میں ہوں گے جو مجلس ہونے کے لحاظ سے ہر طرح کامل ہو گی، مجلس کے تمام لوازمات و مناسبات سے آراستہ ہو گی، سچ مچ کی مجلس ہو گی۔ ¤ ➋ یاد رہے کہ یہاں {’’ مَقْعَدِ ‘‘} کا ترجمہ جو ’’مجلس‘‘ کیا گیا ہے وہ اس کا پورا مفہوم ادا نہیں کرتا، کیونکہ {’’ قَعْدٌ‘‘} اور {’’جَلَسٌ‘‘ } دونوں کا معنی اگرچہ ’’بیٹھنا‘‘ ہے، مگر {’’ مَقْعَدِ ‘‘} میں ٹھہرنے کا مفہوم پایا جاتا ہے جو’’ مجلس‘‘ میں نہیں پایا جاتا، مثلاً سورۂ توبہ کی آیت (۸۱) : « فَرِحَ الْمُخَلَّفُوْنَ بِمَقْعَدِهِمْ خِلٰفَ رَسُوْلِ اللّٰهِ» میں {’’ بِمَقْعَدِهِمْ ‘‘} کا معنی صرف بیٹھنا نہیں بلکہ ’’بیٹھ رہنا‘‘ ہے اور سورۂ نساء کی آیت (۹۵) : «لَا يَسْتَوِي الْقٰعِدُوْنَ مِنَ الْمُؤْمِنِيْنَ» میں {’’ الْقٰعِدُوْنَ ‘‘} کا معنی ’’بیٹھ رہنے والے مومن‘‘ ہے۔ اسی طرح سورۂ نور کی آیت (۶۰) : « وَ الْقَوَاعِدُ مِنَ النِّسَآءِ » میں {’’ الْقَوَاعِدُ ‘‘} کا معنی ’’بیٹھ رہنے والیاں‘‘ ہے۔ یہاں {’’ الْقَوَاعِدُ ‘‘} کے بجائے {’’اَلْجَوَالِسُ‘‘} کا لفظ استعمال نہیں ہو سکتا۔ سورۂ ق کی آیت (۱۷) : « عَنِ الْيَمِيْنِ وَ عَنِ الشِّمَالِ قَعِيْدٌ » میں فرشتوں کے مسلسل ساتھ بیٹھے ہونے کا جو مفہوم ادا ہو رہا ہے وہ{ ’’جَلِيْسٌ‘‘ } میں نہیں۔ اب اس کے مقابلے میں سورۂ مجادلہ کی آیت(۱۱) دیکھیے، فرمایا : «اِذَا قِيْلَ لَكُمْ تَفَسَّحُوْا فِي الْمَجٰلِسِ فَافْسَحُوْا يَفْسَحِ اللّٰهُ لَكُمْ وَ اِذَا قِيْلَ انْشُزُوْا فَانْشُزُوْا » ’’جب تمھیں کہا جائے کہ مجلسوں میں کھل جاؤ تو کھل جاؤ، اللہ تعالیٰ تمھارے لیے فراخی کر دے گا اور جب کہا جائے اٹھ کھڑے ہو تو اٹھ کھڑے ہو جاؤ۔‘‘ یہاں {’’ تَفَسَّحُوْا ‘‘} (کھل جاؤ) سے مجلس میں حرکت کا ثبوت ملتا ہے اور {’’ انْشُزُوْا ‘‘} (اٹھ کھڑے ہو) سے ظاہر ہے کہ مجلس میں جلوس ترک بھی ہو سکتا ہے، لیکن {’’قُعُوْدٌ‘‘} کا معاملہ یہ نہیں۔ اس ساری بحث کا خلاصہ یہ ہے کہ متقی لوگ ’’ مقعد صدق ‘‘ میں ہوں گے جو پائیدار ہو گی۔ ’’مجلس صدق ‘‘ کے لفظ سے یہ مفہوم ادا نہیں ہوتا۔ مفسر رازی نے یہ بات بہت مفصل اور مدلل لکھی ہے۔ ¤ ➌ { عِنْدَ مَلِيْكٍ مُّقْتَدِرٍ:’’ مَلِيْكٍ ‘‘ ’’مُلْكٌ‘‘} میں سے {’’فَعِيْلٌ‘‘} کا وزن ہے، ملک والا۔ اس میں {’’مَلِكٌ‘‘} سے زیادہ مبالغہ ہے، اس لیے ترجمہ ’’عظیم بادشاہ‘‘ کیا گیا ہے۔ {’’ مُقْتَدِرٍ ‘‘} میں {’’ قَادِرٌ‘‘} یا {’’ قَدِيْرٌ‘‘} سے زیادہ مبالغہ ہے، جیسا کہ پیچھے {’’ اَخْذَ عَزِيْزٍ مُّقْتَدِرٍ ‘‘} کے تحت گزرا ہے، اس لیے ترجمہ ’’بے حد قدرت والا‘‘ کیا گیا ہے۔ کسی بھی گھر یا مکان کے مرتبے کا تعین اس جگہ سے ہوتا ہے جہاں وہ واقع ہو، فرعون کی بیوی آسیہ علیھا السلام نے دنیا کی تمام سہولتیں چھن جانے پر اللہ تعالیٰ سے اپنے پاس گھر بنا کر دینے کی دعا کی تھی : «رَبِّ ابْنِ لِيْ عِنْدَكَ بَيْتًا فِي الْجَنَّةِ » [ التحریم : ۱۱ ] ’’اے میرے رب! میرے لیے اپنے پاس جنت میں ایک گھر بنا دے۔‘‘ یہاں اللہ تعالیٰ نے اپنی صفات میں سے {’’ مَلِيْكٍ مُّقْتَدِرٍ ‘‘} کا ذکر فرمایا ہے، کیونکہ لوگ بادشاہوں کی مجلس میں اور ان کے پڑوس میں رہنے کے خواہش مند ہوتے ہیں اور جتنا زیادہ اقتدار والا بادشاہ ہو اتنی ہی اس کے قرب کی خواہش زیادہ ہوتی ہے۔ اللہ تعالیٰ نے متقین کو بشارت سنائی کہ ان کی رہائش بادشاہوں کے بادشاہ کے پاس ہو گی جو سارے اقتدار کا مالک ہے۔ پھر ان کی عزت و شوکت کا کون اندازہ کر سکتا ہے۔ [ اَللّٰھُمَّ اجْعَلْنَا مِنْھُمْ ]"
    }
  ]
}