{
  "surah": "Al-Hadid",
  "surah_number": 57,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ {سَبَّحَ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ الْاَرْضِ:} یعنی زمین و آسمان کی ہر چیز نے اس بات کی شہادت دی ہے کہ اس کا خالق و مالک اللہ عزوجل ہر عیب اور کمی سے پاک ہے، اس کی ذات و صفات، افعال و احکام غرض ہر چیز کسی بھی طرح کے عیب اور نقص سے پاک ہے۔ اس سورت میں اور سورۂ صف اور سورۂ حشر کے شروع میں {’’ سَبَّحَ ‘‘} (ماضی) آیا ہے، سورۂ جمعہ اور سورۂ تغابن میں {’’ يُسَبِّحُ ‘‘} (مضارع) آیا ہے، جس میں حال واستقبال دونوں شامل ہیں اور سورۂ بنی اسرائیل میں {’’ سُبْحٰنَ ‘‘} (مصدر) آیا ہے، جس میں دوام پایا جاتا ہے۔ یعنی کائنات کا ذرّہ ذرّہ ہمیشہ سے اللہ تعالیٰ کا ہر عیب سے پاک ہونا بیان کرتا چلا آیا ہے، اب بھی کر رہا ہے اور آئندہ بھی کرتا رہے گا۔ سورۂ اعلیٰ میں {’’ سَبِّحْ ‘‘} امر کے ساتھ بھی آیا ہے۔ ¤ ➋ اس میں مشرکین پر چوٹ ہے کہ کائنات کی ہر چیز اللہ تعالیٰ کے ہر عیب سے پاک ہونے کا اعلان کر رہی ہے اور تم ہو کہ اس کے لیے شریک اور اس کے لیے اولاد بنا کر اس پر اتنا بڑا عیب لگا رہے ہو جس سے بڑا عیب اور جس سے بڑی گالی اس کے لیے ہو ہی نہیں سکتی۔ تمھیں پیدا اس نے کیا، تمھاری پرورش وہ کر رہا ہے اور تمھاری ہر ضرورت پوری وہ کرتا ہے، تمھاری موت و حیات اس کے ہاتھ میں ہے، مگر تم اس کے بے بس بندوں میں سے کسی کو داتا کہتے ہو، کسی کو دستگیر، کسی کو مشکل کشا اور کسی کو گنج بخش، کسی کو تم نے اولاد دینے والا بنا رکھا ہے توکسی کو حکومت دینے والا، کسی کو خزانے بخشنے والا تو کسی کو شفا دینے والا، کسی کے متعلق کہتے ہو کہ وہ اللہ کی تقدیر کا رخ پھیر دیتا ہے اور کسی کے بارے میں کہتے ہو کہ وہ کمان سے نکلا ہوا تیر راستے سے واپس لے آتا ہے۔ اب آسمان و زمین کی ہر چیز کی گواہی کو دیکھو اور اپنے طرز عمل کو دیکھو۔ عبداللہ بن عباس رضی اللہ عنھما نبی صلی اللہ علیہ وسلم سے بیان کرتے ہیں : [ قَالَ اللّٰهُ كَذَّبَنِيَ ابْنُ آدَمَ وَ لَمْ يَكُنْ لَهُ ذٰلِكَ وَشَتَمَنِيْ وَلَمْ يَكُنْ لَهُ ذٰلِكَ، فَأَمَّا تَكْذِيْبُهُ إِيَّايَ فَزَعَمَ أَنِّيْ لاَ أَقْدِرُ أَنْ أُعِيْدَهُ كَمَا كَانَ وَ أَمَّا شَتْمُهُ إِيَّايَ فَقَوْلُهُ لِيْ وَلَدٌ، فَسُبْحَانِيْ أَنْ أَتَّخِذَ صَاحِبَةً أَوْ وَلَدًا ] [ بخاري، التفسیر، سورۃ البقرۃ، باب: « وقالوا اتخذ اللہ ولدا سبحانہ» : ۴۴۸۲ ]’’اللہ تعالیٰ نے فرمایا ، ابنِ آدم نے مجھے جھٹلا دیا، حالانکہ یہ اس کا حق نہیں تھا اور اس نے مجھے گالی دی، حالانکہ یہ اس کا حق نہیں تھا۔ اس کا مجھے جھٹلانا تو یہ ہے کہ وہ سمجھتا ہے کہ میں اسے دوبارہ بنانے پر قادر نہیں ہوں اور اس کا مجھے گالی دینا اس کا یہ کہنا ہے کہ میری کوئی اولاد ہے، حالانکہ میں اس سے پاک ہوں کہ میں کوئی بیوی یا اولاد بناؤں۔‘‘ اس سورت میں اور مذکورہ بالا دوسری سورتوں کی آیات میں ’’ تسبیح‘‘ کے لفظ اور اس حدیث میں {’’سُبْحَانِيْ‘‘} کے لفظ پر غور فرمائیں تو تسبیح کا مفہوم کافی حد تک واضح ہو جائے گا۔ یہی وجہ ہے کہ اس سورت میں اللہ تعالیٰ نے اپنی تسبیح کے ذکر کے بعد اپنی دس سے زیادہ صفات بیان فرمائیں اور سب کے بعد کفر و شرک چھوڑ کر ایمان لانے کی دعوت دی، فرمایا : «اٰمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ وَ اَنْفِقُوْا مِمَّا جَعَلَكُمْ مُّسْتَخْلَفِيْنَ فِيْهِ » [ الحدید : ۷ ] ’’اللہ اور اس کے رسول پر ایمان لاؤ اور ان چیزوں میں سے خرچ کرو جن میں اس نے تمھیں (پہلوں کا) جا نشین بنایا ہے۔‘‘ ¤ ➌ تسبیح کا لغوی معنی کیا ہے، قرآنی آیات میں اس کا مفہوم کیا ہے، یہ تسبیح زبان حال سے ہے یا قول کے ساتھ؟ ان سب باتوں کے لیے دیکھیے سورۂ بنی اسرائیل (44،43) کی تفسیر۔ ¤ ➍ {وَ هُوَ الْعَزِيْزُ الْحَكِيْمُ: ’’ الْعَزِيْزُ ‘‘ ’’عَزَّ يَعِزُّ ‘‘} (ض) سے مبالغے کا صیغہ ہے، سب پر غالب، کوئی کام ایسا نہیں جو وہ کرنا چاہے اور نہ کر سکے اور کوئی ہستی ایسی نہیں جو اسے کسی کام سے روک سکے۔ {’’ الْحَكِيْمُ ‘‘} کمال حکمت والا۔ اس کا ہر کام محکم ہے اور دانائی پر مشتمل ہے، اس لیے کہ وہ ماضی، حال اور مستقبل کا کامل علم رکھتا ہے۔ اس کے کسی کام میں کوئی غلطی نہیں، وہ عزیز ہے تو حکیم بھی ہے، اس کا غلبہ اندھے کی لاٹھی نہیں، بلکہ اس کے ساتھ کمال حکمت بھی شامل ہے۔ {’’ الْعَزِيْزُ الْحَكِيْمُ ‘‘} خبر پر الف لام سے کلام میں حصر پیدا ہو گیا کہ عزیز و حکیم صرف وہ ہے، کوئی اور نہیں۔۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { لَهٗ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ:’’ لَهٗ ‘‘} خبر کو پہلے لانے سے حصر پیدا ہو گیا، یعنی آسمانوں اور زمین کی بادشاہی اسی کی ہے، کسی اور کی نہیں۔ دوسرے کسی کے پاس بادشاہی اگر ہے تو سارے آسمانوں اور زمین کی نہیں بلکہ زمین کے کسی چھوٹے سے قطعے کی تھوڑے سے وقت کے لیے اور وہ بھی اسی کی عطا کردہ اور ہر لمحے دوسروں کی محتاج۔ مزید دیکھیے سورۂ ملک کی پہلی آیت کی تفسیر۔ پھر کائنات کے سارے اختیارات کے مالک کے مقابلے میں کسی اور کی عبادت کا کیا جواز ہے؟ ¤ ➋ { يُحْيٖ وَ يُمِيْتُ:} اگرچہ یہ دونوں صفات {’’ لَهٗ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} کے مضمون میں شامل ہیں، مگر انھیں خاص طور پر الگ اس لیے ذکر فرمایا کہ یہ دونوں کام زمین و آسمان میں اللہ تعالیٰ کے ان تصرفات میں سے ہیں جن کی حقیقت اس کے سوا کوئی نہیں جانتا اور مخلوق میں سے کوئی دعویٰ بھی نہیں کر سکتا کہ ان میں اس کا کوئی دخل ہے اور اس میں قیامت کے امکان کی بھی دلیل ہے جس کا مشرک انکار کرتے ہیں اور ان کے بنائے ہوئے خداؤں کے باطل ہونے کی طرف اشارہ بھی ہے، یعنی {’’ لَا يَمْلِكُوْنَ مَوْتًا وَّ لَا حَيٰوةً وَّ لَا نُشُوْرًا ‘‘} کہ باطل معبود تو نہ کسی موت کے مالک ہیں اور نہ زندگی کے اور نہ اٹھائے جانے کے۔ دیکھیے سورۂ فرقان (۳)۔ ¤ ➌ {وَ هُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ:} اس کی وضاحت کے لیے دیکھیے سورۂ ملک کی پہلی آیت کی تفسیر۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {هُوَ الْاَوَّلُ وَ الْاٰخِرُ وَ الظَّاهِرُ وَ الْبَاطِنُ … : ’’ظَهَرَ يَظْهَرُ‘‘} (ف) کا معنی پوشیدہ کے مقابلے میں ظاہر ہونا بھی ہے اور بلند اور غالب ہونا بھی، جیسا کہ فرمایا : « لِيُظْهِرَهٗ عَلَى الدِّيْنِ كُلِّهٖ » [ التوبۃ : ۳۳ ] ’’تاکہ وہ اسے ہر دین پر غالب کر دے۔‘‘ یہاں بھی {’’ هُوَ ‘‘} مبتدا کی چاروں خبروں {’’ الْاَوَّلُ وَ الْاٰخِرُ وَ الظَّاهِرُ وَ الْبَاطِنُ ‘‘} پر الف لام کی وجہ سے حصر پیدا ہو رہا ہے، یعنی وہی ہے جو سب سے پہلے ہے، اس کی کوئی ابتدا نہیں اور وہی سب سے آخر ہے، اس کے بعد کوئی نہیں، اس کی انتہا بھی کوئی نہیں، اس کے سوا سب فنا ہونے والے ہیں، اس پر فنا نہیں۔ وہی ہے جس کا وجود ظاہر ہے، جو کائنات کی ہر چیز سے ظاہر ہو رہا ہے کہ اسے بنانے والا موجود ہے، جو ہر چیز پر غالب ہے کہ اس نے جو چاہا بنا دیا اور جو چاہتا ہے بنا دیتا ہے، کوئی اس سے اوپر نہیں جو اسے روک سکے اور وہی ہے جس کی ذات پوشیدہ ہے جس کا آنکھیں ادراک نہیں کر سکتیں۔ اس کے سوا کسی میں ان چاروں صفات میں سے ایک صفت بھی نہیں پائی جاتی۔ اس آیت کی بہترین تفسیر خود رسول اللہ صلی اللہ علیہ وسلم سے آئی ہے، ابو ہریرہ  رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں حکم دیتے تھے کہ جب ہم اپنے بستر پر لیٹیں تو یہ کہیں : [ الَلّٰهُمَّ رَبَّ السَّمَاوَاتِ وَ رَبَّ الْأَرْضِ وَ رَبَّ الْعَرْشِ الْعَظِيْمِ، رَبَّنَا وَ رَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوٰی، وَ مُنْزِلَ التَّوْرَاةِ وَالإِْنْجِيْلِ وَالْفُرْقَانِ، أَعُوْذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهٖ، الَلّٰهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ وَ أَنْتَ الْآخِرُ فَللَيْسَ بَعْدَكَ شَيْءٌ وَ أَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ وَ أَنْتَ الْبَاطِنُ فَلَيْسَ دُوْنَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ ] [مسلم، الذکر والدعاء، باب ما یقول عند النوم وأخذ المضجع : ۲۷۱۳ ] ’’اے اللہ! اے آسمانوں کے رب اور زمین کے رب اور عرش عظیم کے رب! ہمارے رب اور ہر چیز کے رب! دانے اور گٹھلیوں کو پھاڑ نکالنے والے اور تورات و انجیل اور فرقان کو نازل کرنے والے! میں ہر اس چیز کے شر سے تیری پناہ مانگتا ہوں جس کی پیشانی کے بالوں کو تو پکڑے ہوئے ہے۔ اے اللہ! تو ہی اوّل ہے، سو تجھ سے پہلے کوئی چیز نہیں اور توہی آخر ہے، سو تیرے بعد کوئی چیز نہیں اور تو ہی ظاہر ہے، سو تجھ سے اوپر کوئی چیز نہیں اور تو ہی باطن ہے، سو تجھ سے ’’دُون ‘‘ (بعد) کوئی چیز نہیں۔ تو ہم سے قرض ادا کر دے اور ہمیں فقر سے غنی کر دے۔‘‘ ¤ ➋ { ’’ الْبَاطِنُ ‘‘} کی ایک تفسیر وہ ہے جو عام طور پر کی جاتی ہے، یعنی پوشیدہ۔ اس کے مطابق {’’لَيْسَ دُوْنَكَ شَيْءٌ‘‘} کا مطلب یہ ہے کہ تو ہی پوشیدہ ہے، سو تجھ سے زیادہ پوشیدہ کوئی چیز نہیں۔ یہ مفہوم {’’ لَا تُدْرِكُهُ الْاَبْصَارُ ‘‘} میں بیان ہوا ہے، دیکھیے سورۂ انعام (۱۰۳) کی تفسیر اور ابو موسیٰ اشعری رضی اللہ عنہ سے مروی حدیث میں بھی یہی بات بیان ہوئی ہے، انھوں نے فرمایا : [ قَامَ فِيْنَا رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ بِخَمْسِ كَلِمَاتٍ فَقَالَ إِنَّ اللّٰهَ عَزَّ وَجَلَّ لَا يَنَامُ وَلَا يَنْبَغِيْ لَهُ أَنْ يَّنَامَ، يَخْفِضُ الْقِسْطَ وَ يَرْفَعُهُ، يُرْفَعُ إِلَيْهِ عَمَلُ اللَّيْلِ قَبْلَ عَمَلِ النَّهَارِ وَ عَمَلُ النَّهَارِ قَبْلَ عَمَلِ اللَّيْلِ، حِجَابُهُ النُّوْرُ وَفِيْ رِوَايَةِ أَبِيْ بَكْرٍ النَّارُ لَوْ كَشَفَهُ لَأَحْرَقَتْ سُبُحَاتُ وَجْهِهِ  مَا انْتَهٰی إِلَيْهِ بَصَرُهُ مِنْ خَلْقِهٖ ] [ مسلم، الإیمان، باب في قولہ علیہ السلام : ’’ إن اللہ لا ینام… ‘‘ : ۱۷۹ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے ہم میں کھڑے ہو کر پانچ باتیں بیان فرمائیں، چنانچہ آپ نے فرمایا : ’’اللہ عزوجل سوتا نہیں اور اس کے لائق نہیں کہ وہ سوئے، وہ ترازو کو جھکاتا ہے اور اسے اٹھاتا ہے، رات کا عمل دن کے عمل سے پہلے اور دن کا عمل رات کے عمل سے پہلے اس کی طرف اوپر لے جایا جاتا ہے۔ اس کا حجاب نور ہے (اور ابوبکر کی روایت میں ہے کہ نار ہے) اگر وہ اسے ہٹا دے تو اس کے چہرے کی کرنیں اس کی مخلوق میں سے ان تمام چیزوں کو جلا دیں جن تک اس کی نگاہ پہنچتی ہے۔‘‘ ¤ ➌ اور{’’ الْبَاطِنُ ‘‘} کی ایک تفسیر وہ ہے جو مفسر طبری نے بیان فرمائی ہے، ان کے الفاظ یہ ہیں: {’’ وَ الظَّاهِرُ ‘‘ يَقُوْلُ وَهُوَ الظَّاهِرُ عَلٰی كُلِّ شَيْءٍ دُوْنَهُ، وَهُوَ الْعَالِيْ فَوْقَ كُلِّ شَيْءٍ، فَلاَ شَيْءَ أَعْلٰی مِنْهُ، ’’ وَ الْبَاطِنُ ‘‘ يَقُوْلُ وَهُوَ الْبَاطِنُ جَمِيْعَ الْأَشْيَاءِ، فَلاَ شَيْءَ أَقْرَبُ إِلٰی شَيْءٍ مِنْهُ، كَمَا قَالَ :} « وَ نَحْنُ اَقْرَبُ اِلَيْهِ مِنْ حَبْلِ الْوَرِيْدِ » [ قٓ : ۱۶] ’’یعنی {’’ وَ الظَّاهِرُ ‘‘} کا مطلب یہ ہے کہ وہی اپنے سوا ہر چیز پر ظاہر ہے اور وہی ہر چیز کے اوپر بلند ہے، کوئی چیز اس سے بلند نہیں اور {’’ وَ الْبَاطِنُ ‘‘} کا مطلب یہ ہے کہ وہ تمام اشیاء سے باطن ہے، چنانچہ کوئی چیز کسی چیز سے اس سے زیادہ قریب نہیں، جیسا کہ فرمایا : « وَ نَحْنُ اَقْرَبُ اِلَيْهِ مِنْ حَبْلِ الْوَرِيْدِ» [ قٓ : ۱۶] ’’اور ہم اس کی رگِ جاں سے بھی زیادہ اس کے قریب ہیں۔‘‘ خلاصہ یہ کہ ہر چیز سے زیادہ بلند بھی وہی ہے اور ہر چیز کے زیادہ سے زیادہ قریب بھی وہی ہے۔ بہت سے اہلِ علم نے اس قرب سے مراد علم کے لحاظ سے قریب ہونا اور {’’ الْبَاطِنُ ‘‘} کا معنی علم کے لحاظ سے ہر چیز کے قریب کیا ہے۔ یہ بحث آگے آیت (۴) {’’ وَ هُوَ مَعَكُمْ ‘‘} میں کچھ تفصیل سے آ رہی ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {هُوَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ فِيْ سِتَّةِ اَيَّامٍ :} اس کی تفصیل کے لیے دیکھیے سورۂ اعراف (۵۴) کی تفسیر۔ ¤ ➋ { ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ:} اس کی تفسیر کے لیے دیکھیے سورۂ اعراف (۵۴) اور سورۂ طٰہٰ (۵) کی تفسیر۔ اس آیت میں مذکور تمام جملے لانے کا مقصد بھی یہ ہے کہ جب یہ سب کچھ اللہ واحد نے کیا ہے تو پھر اس پر ایمان کیوں نہیں لاتے اور اس کے ساتھ شریک کیوں ٹھہراتے ہو، جیسا کہ یہ بات آگے آیت (۷) {’’ اٰمِنُوْا بِاللّٰهِ ‘‘} میں صراحت کے ساتھ آرہی ہے۔ ¤ ➌ { يَعْلَمُ مَا يَلِجُ فِي الْاَرْضِ وَ مَا يَخْرُجُ مِنْهَا …:} اللہ تعالیٰ نے اپنے علم سے تعلق رکھنے والی چیزوں میں سے ان چیزوں کے بجائے جو زمین پر موجود ہیں ان چیزوں کا ذکر فرمایا جو اس میں داخل ہوتی ہیں یا اس سے نکلتی ہیں۔ اسی طرح آسمان میں موجود چیزوں کے ذکرکے بجائے ان کا ذکر فرمایا جو اس سے اترتی ہیں یا اس کی طرف چڑھتی ہیں۔ کیونکہ جو زمین میں داخل ہونے والی اور اس سے نکلنے والی چیزوں کو جانتا ہے وہ اس کے اوپر موجود چیزوں کو بالاولیٰ جانتا ہے اور جو آسمان سے اترنے والی اور اس میں چڑھنے والی چیزوں کو جانتا ہے وہ فضا اور خلا میں موجود نظر آنے والی اور نظر نہ آنے والی چیزوں کو اور ستاروں کی گردش اور ان کے نظام کو بالاولیٰ جانتا ہے۔ ¤ زمین میں داخل ہونے والی چیزوں میں سے بارش کا پانی ہے جو زمین کی گہرائیوں میں داخل ہوتا ہے، نباتات کے بیج ہیں اور زمین میں دفن ہونے والے اجسام وغیرہ ہیں اور اس سے نکلنے والی چیزوں میں سے نباتات، معدنیات،گیسیں اور وہ جانور ہیں جو اپنی غاروں اور ٹھکانوں سے نکلتے ہیں۔ آسمان سے اترنے والی چیزوں میں سے بارش، برف، ہوائیں، اللہ تعالیٰ کے احکام، اس کے فرشتے اور اس کی رحمت وغیرہ ہیں اور اس میں چڑھنے والی چیزوں میں سے وہ چیزیں ہیں جو فضا کے طبقات میں بلند ہوتی ہیں۔ مثلاً سمندر وغیرہ سے اٹھنے والے آبی بخارات، مٹی اور ریت وغیرہ کی آندھیاں اور بگولے، فضا میں اڑنے والے پرندے، جسموں سے جدا ہو کر اوپر جانے والی ارواح اور عالم بالا سے معلومات چرانے کے لیے اوپر جانے والے شیاطین، بندوں کے اعمال اور فرشتے جو اترتے اور چڑھتے ہیں۔ [ التحریر والتنویر في سورۃ سبا ] ¤ ➍ { وَ هُوَ مَعَكُمْ اَيْنَ مَا كُننْتُمْ:} ’’اور وہ تمھارے ساتھ ہے جہاں بھی تم ہو‘‘ اس جملے سے پہلے اسی آیت میں یہ جملہ گزر چکا ہے : « هُوَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَ الْاَرْضَ فِيْ سِتَّةِ اَيَّامٍ ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ » ’’وہی ہے جس نے آسمانوں اور زمین کو چھ دنوں میں پیدا کیا، پھر وہ عرش پر بلند ہوا۔‘‘ تو یہ آیت دلیل ہے کہ اللہ تعالیٰ کی ذات پاک عرش پر ہے اور وہ ہمارے ساتھ بھی ہے۔ سوال یہ ہے کہ یہ دونوں باتیں بیک وقت کیسے درست ہو سکتی ہیں؟ اس معاملے میں بعض لوگوں نے ان دونوں کا انکار کر دیا اور یہ کہہ دیا کہ اللہ تعالیٰ نہ عرش پر ہے اور نہ کسی اور جگہ ، بلکہ وہ لامکان ہے اور جو شخص یہ پوچھ بھی لے کہ اللہ تعالیٰ کہاں ہے وہ کافر ہوگیا، کیونکہ اس کے لیے مکان (جگہ) تسلیم کرنے سے اس کا اس جگہ کا محتاج ہونا لازم آتا ہے۔ ان نادانوں نے یہ بھی نہیں سوچا کہ ان کا فتویٰ کس کس پر لگ رہا ہے اور نہ یہ خیال کیا کہ اللہ تعالیٰ خود فرما رہے ہیں : « ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ» کہ پھر وہ عرش پر بلند ہوا۔ پھر قیامت کے دن آٹھ فرشتوں کے عرش الٰہی کو اٹھائے ہونے کا ذکر سورۂ حاقہ میں موجود ہے، فرمایا : «وَ يَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَىِٕذٍ ثَمٰنِيَةٌ » [ الحاقۃ : ۱۷] ’’اور تیرے رب کا عرش اس دن آٹھ فرشتے اپنے اوپر اٹھائے ہوئے ہوں گے۔‘‘ اور قیامت کے دن فرشتوں کے عرش کے گرد گھیرا ڈالے ہوئے ہونے کا ذکر سورۂ زمر میں موجود ہے، فرمایا : «وَ تَرَى الْمَلٰٓىِٕكَةَ حَآفِّيْنَ مِنْ حَوْلِ الْعَرْشِ » [ الزمر : ۷۵ ] ’’اور تو فرشتوں کو دیکھے گا عرش کے گرد گھیرا ڈالے ہوئے۔‘‘ اور یہ سوال کرنا کہ اللہ کہاں ہے، خود رسول اللہ صلی اللہ علیہ وسلم سے ثابت ہے۔ چنانچہ معاویہ بن حکم السُّلمی رضی اللہ عنہ بیان کرتے ہیں: ’’میری ایک لونڈی اُحد اور جوانیہ کی طرف میری بکریاں چراتی تھی، ایک دن میں نے دیکھا تو بھیڑیا اس کی بکریوں سے ایک بکری لے جا چکا تھا، میں بھی بنی آدم سے ہوں، مجھے اسی طرح غصہ آ جاتا ہے جیسے انھیں غصہ آتا ہے، تو میں نے اسے ایک تھپڑ مار دیا۔ پھر میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو آپ نے اسے مجھ پر بہت بڑا (گناہ) قرار دیا، میں نے کہا : ’’یا رسول اللہ! کیا میں اسے آزاد نہ کر دوں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ اِئْتِنِيْ بِهَا ] : ’’اسے میرے پاس لاؤ۔‘‘ میں اسے لے کر آپ صلی اللہ علیہ وسلم کے پاس آیا تو آپ صلی اللہ علیہ وسلم نے اس سے کہا : [ أَيْنَ اللّٰهُ ؟ ] ’’اللہ کہاں ہے؟‘‘ اس نے کہا : [ فِي السَّمَاءِ ] ’’آسمان میں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ أَنَا؟ ] ’’میں کون ہوں؟‘‘ اس نے کہا : [ أَنْتَ رَسُوْلُ اللّٰهِ ] ’’آپ اللہ کے رسول ہیں۔‘‘ تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ أَعْتِقْهَا فَإِنَّهَا مُؤْمِنَةٌ ] ’’اسے آزاد کر دو، کیونکہ یہ مومنہ ہے۔‘‘ [ مسلم، المساجد ومواضع الصلاۃ، باب تحریم الکلام في الصلاۃ…: ۵۳۷ ] ¤ خلاصہ یہ ہے کہ یہ کہنا کہ اللہ تعالیٰ لامکان ہے، قرآن و حدیث کا صریح انکار ہے اور یہ عقیدہ رکھنا ہر مسلمان کے لیے ضروری ہے کہ اللہ تعالیٰ کی ذات پاک عرش پر ہے اور وہ ہمارے ساتھ بھی ہے، مگر اس طرح سے جسے وہی جانتا ہے اور جس طرح اس کی شان کے لائق ہے۔ اللہ تعالیٰ کی ذات کے عرش پر مستوی ہونے کے انکار کی ایک انتہا یہ تھی کہ وہ کسی جگہ بھی نہیں، جو درحقیقت اللہ تعالیٰ کی ہستی ہی کا انکار ہے۔ دوسری انتہا ان لوگوں نے اختیار کی جنھوں نے کہا کہ اللہ تعالیٰ کی ذات ہر جگہ موجود ہے اور ہم جہاں بھی ہوں وہ ہمارے ساتھ اس طرح ہے جس طرح ہم ایک دوسرے کے ساتھ ہوتے ہیں، مگر یہ بات بھی غلط ہے، کیونکہ اسی آیت میں {’’ وَ هُوَ مَعَكُمْ اَيْنَ مَا كُنْتُمْ ‘‘} (وہ تمھارے ساتھ ہے تم جہاں بھی ہو) سے پہلے{’’ ثُمَّ اسْتَوٰى عَلَى الْعَرْشِ ‘‘} میں اللہ تعالیٰ کے عرش پر مستوی ہونے کا ذکر بھی موجود ہے۔ اب اگر {’’ وَ هُوَ مَعَكُمْ اَيْنَ مَا كُنْتُمْ ‘‘} کا مطلب یہ لیا جائے کہ اللہ تعالیٰ کی ذات ہر جگہ اس طرح ہمارے ساتھ ہے جس طرح ہم ایک دوسرے کے ساتھ ہیں تو ایک ہی آیت کے دو جملے ایک دوسرے سے ٹکراتے اور متعارض ٹھہرتے ہیں، اس لیے {’’ وَ هُوَ مَعَكُمْ اَيْنَ مَا كُنْتُمْ ‘‘} کا وہی مطلب درست ہو گا جو {’’ اَلرَّحْمٰنُ عَلَى الْعَرْشِ اسْتَوٰى ‘‘} کے خلاف نہ ہو اور کلام عرب کے بھی خلاف نہ ہو، کیونکہ جس طرح {’’ اَلرَّحْمٰنُ عَلَى الْعَرْشِ اسْتَوٰى ‘‘} پر ایمان لازم ہے اسی طرح {’’ وَ هُوَ مَعَكُمْ ‘‘} پر ایمان بھی لازم ہے۔ ¤ حقیقت یہ ہے کہ کلام عرب میں معیت (ساتھ ہونے) کا معنی اگرچہ اس طرح ساتھ ہونا بھی ہے جس طرح ہم ایک دوسرے کے ساتھ ہوتے ہیں، مگر یہ لفظ مختلف مواقع کے لحاظ سے اس کے علاوہ معانی کے لیے بھی آتا ہے۔ چنانچہ معیت کا ایک معنی وہ ہے جو سورۂ بقرہ کی آیت (۱۵۳) : « اِنَّ اللّٰهَ مَعَ الصّٰبِرِيْنَ» (بے شک اللہ صبر کرنے والوں کے ساتھ ہے) اور سورۂ توبہ کی آیت (۴۰) : « لَا تَحْزَنْ اِنَّ اللّٰهَ مَعَنَا » (غم نہ کر، یقینا اللہ ہمارے ساتھ ہے) میں ہے۔ ظاہر ہے ان آیات کے مطابق اللہ تعال تعالیٰ صبر کرنے والوں کے ساتھ ہے بے صبروں کے ساتھ نہیں، اسی طرح وہ ہجرت کے وقت غارِ ثور میں اور سارے سفر میں رسول اللہ صلی اللہ علیہ وسلم اور ابو بکر رضی اللہ عنہ کے ساتھ تھا مشرکین کے ساتھ نہیں تھا۔ {’’ وَ هُوَ مَعَكُمْ اَيْنَ مَا كُنْتُمْ ‘‘} میں یہ معنی بھی مراد نہیں، کیونکہ اس معنی میں معیت صرف اللہ کے مخلص بندوں کا نصیب ہے۔ ¤ معیت کا ایک معنی یہ بھی ہے کہ ایک چیز دور ہونے کے باوجود ان چیزوں کے ساتھ بھی ہو جن سے وہ دور ہے۔ چنانچہ {’’ وَ هُوَ مَعَكُمْ ‘‘} میں معیت سے یہی معنی مراد ہے کہ اللہ تعالیٰ کی ذات عرش پر ہے، اس کے باوجود اللہ تعالیٰ ہمارے ساتھ بھی ہے۔ رہی یہ بات کہ کس طرح ہے؟ تو اس کی اصل اور پوری کیفیت وہی جانتا ہے۔ اگر مخلوق میں ایسا ہونا ممکن نہ بھی ہو تو اللہ تعالیٰ کو مخلوق پر قیاس نہیں کیا جا سکتا، کیونکہ اس نے خود فرمایا ہے : «لَيْسَ كَمِثْلِهٖ شَيْءٌ» [ الشورٰی : ۱۱ ] ’’اس کی مثل کوئی چیز نہیں۔‘‘ مگر مخلوق میں بھی اس کی مثالیں ملتی ہیں کہ ایک چیز کسی ایک جگہ ہونے کے باوجود دوسری جگہ موجود لوگوں کے ساتھ ہو۔ اس کی ادنیٰ سی مثال سورج اور چاند ہیں کہ بلندی پر ہونے کے باوجود ہم جہاں جاتے ہیں وہ ہمارے ساتھ ہوتے ہیں، حالانکہ وہ زمین پر ہمارے اندر موجود نہیں ہوتے، مگر سب کہتے ہیں کہ رات میں سفر کرتا رہا اور چاند سارے سفر میں میرے ساتھ رہا۔ معیت کا یہ معنی معروف ہے اور اپنے مقام پر حقیقی معنی ہے۔ جب سورج اور چاند کا یہ معاملہ ہے تو اللہ تعالیٰ کی صفت تو ان کی صفت سے کہیں بلند ہے، چنانچہ وہ عرش پر ہونے کے باوجود ہمارے ساتھ ہے، خواہ ہم کہیں بھی ہوں، اگرچہ اپنی صفت {’’ الْبَاطِنُ ‘‘} کی وجہ سے اور حجاب میں ہونے کی وجہ سے ہمیں نظر نہیں آتا۔ قیامت کے دن جب وہ اہلِ جنت کو اپنے دیدار کی نعمت سے سرفراز فرمانے کا ارادہ کرے گا اور اپنا حجاب کھولے گا تو تمام جنتی اپنے اپنے گھروں میں بیٹھے کسی تکلیف کے بغیر اور کسی قسم کے ہجوم یا بھیڑ کے بغیر اسے دیکھیں گے اور یہ مثال خود رسول اللہ صلی اللہ علیہ وسلم سے ثابت ہے۔ ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ لوگوں نے کہا : [ يَا رَسُوْلَ اللّٰهِ ! هَلْ نَرٰی رَبَّنَا يَوْمَ الْقِيَامَةِ؟ فَقَالَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ هَلْ تُضَارُّوْنَ فِي الْقَمَرِ لَيْلَةَ الْبَدْرِ؟ قَالُوْا لاَ يَا رَسُوْلَ اللّٰهِ  ! قَالَ فَهَلْ تُضَارُّوْنَ فِي الشَّمْسِ لَيْسَ دُوْنَهَا سَحَا سَحَابٌ ؟ قَالُوْا لاَ يَا رَسُوْلَ اللّٰهِ ! قَالَ فَإِنَّكُمْ تَرَوْنَهُ كَذٰلِكَ ] [بخاري، التوحید، باب قول اللہ تعالٰی : « وجوہ یومئذ…» : ۷۴۳۷ ] ’’یا رسول اللہ! کیا ہم قیامت کے دن اپنے رب کو دیکھیں گے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’کیا تم چودھویں کی رات کو چاند دیکھنے میں کوئی تکلیف محسوس کرتے ہو؟‘‘ انھوں نے کہا : ’’نہیں اے اللہ کے رسول!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو کیا تم سورج کو دیکھنے میں کوئی تکلیف محسوس کرتے ہو جس کے سامنے کوئی بادل نہ ہو؟‘‘ لوگوں نے کہا : ’’نہیں یا رسول اللہ!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تو تم اسے اسی طرح دیکھو گے۔‘‘ ¤ یہاں شیخ محمد بن صالح بن عثیمین رحمہ اللہ کی تالیف {’’القواعد المثلٰي في صفات اللّٰه وأسماء ه الحسنٰي‘‘} «اَلْمِثَالُ الْخَامِسُ وَالسَّادِسُ» سے ان کی ایک تحریر کا ترجمہ لکھا جاتا ہے، وہ لکھتے ہیں : ’’دوسری وجہ یہ ہے کہ ’’معیت‘‘ کے معنی کی حقیقت ’’عُلُوّ‘‘ کے مناقض اور خلاف نہیں، کیونکہ دونوں کا جمع ہونا مخلوق کے حق میں ممکن ہے (کہ ایک چیز بلندی پر بھی ہو اور ساتھ بھی ہو) کیونکہ کہا جاتا ہے کہ ہم چلتے رہے اور چاند بھی ہمارے ساتھ تھااور اسے تناقض نہیں سمجھا جاتا اور نہ کوئی اس سے یہ سمجھتا ہے کہ چاند زمین پر اتر آیا ہے۔ تو جب یہ مخلوق کے حق میں ممکن ہے تو خالق کے حق میں تو بالاولیٰ ممکن ہے، جو اپنے علو کے ساتھ ہر چیز کو محیط بھی ہے، کیونکہ معیت کی حقیقت کے لیے ضروری نہیں کہ دونوں ایک جگہ اکٹھے ہوں۔ اور شیخ الاسلام ابن تیمیہ نے ’’ {الفتوي الحموية } (ص ۱۰۳ )‘‘ (دیکھیے ابن القاسم کے مرتب کردہ ’’مجموع الفتاویٰ ‘‘کی جلد پنجم) میں اسی وجہ کی طرف اشارہ کیا ہے، چنانچہ انھوں نے لکھا ہے : ’’یہ اس لیے کہ لغت میں جب لفظ {’’مَعَ‘‘} کسی قید کے بغیر بولا جاتا ہے تو اس کا معنی لغت میں مطلق ساتھ ہونے کے علاوہ کچھ نہیں ہوتا، پھر جب اسے کسی خاص معنی کے ساتھ مقید کیا جائے تو اس معنی میں ساتھ ہونے پر دلالت کرتا ہے۔ چنانچہ کہا جاتا ہے کہ ہم چلتے رہے اور چاند یا ستارہ ہمارے ساتھ تھا اور کہا جاتا ہے کہ فلاں سامان میرے ساتھ ہے، کیونکہ وہ تمھارے پاس ہوتا ہے، خواہ وہ تمھارے سر کے اوپر ہو۔ سو اللہ تعالیٰ حقیقت میں اپنی مخلوق کے ساتھ ہے اور حقیقت میں اپنے عرش پر بھی ہے۔‘‘ ¤ ➎ سلف صالحین میں سے بہت سے اہلِ علم نے {’’ وَ هُوَ مَعَكُمْ ‘‘} کا مطلب یہ بیان فرمایا ہے کہ اللہ تعالیٰ کی ذات عرش پر ہے اور وہ اپنے علم، رؤیت اور قدرت کے ساتھ ہمارے ساتھ ہے اور اس کی دلیل یہ دی ہے کہ زیر تفسیر آیت میں {’’ وَ هُوَ مَعَكُمْ ‘‘} سے پہلے ہر چیز کے علم کا ذکر ہے اور بعد میں ہر چیز کو دیکھنے کا۔ اس میں شک نہیں کہ اللہ تعالیٰ کی ذات عرش پر ہے اور وہ ہمارے ساتھ بھی ہے ہم جہاں بھی ہوں، مگر وہ زمین پر اپنی مخلوق کے ساتھ اس طرح نہیں جس طرح ہم ایک دوسرے کے ساتھ ہیں اور اس میں بھی شک نہیں کہ اللہ تعالیٰ ہر چیز کا علم رکھنے والا، اسے دیکھنے والا اور اس پر پوری قدرت اور تصرف رکھنے والا ہے۔ یہ تمام صفات حسنیٰ اس کے لیے ثابت ہیں، مگر معیت کا معنی علم یا قدرت نہیں بلکہ یہ بذات خود ایک صفت ہے جس کی اصل کیفیت اللہ تعالیٰ ہی بہتر جانتا ہے۔ اس لیے اس بات پر ایمان رکھنا لازم ہے کہ اللہ تعالیٰ کی ذات عرش پر ہے اور وہ ہمارے ساتھ ہے ہم جہاں بھی ہوں۔ رہی یہ بات کہ کس طرح ہے؟ تو اس کی اصل کیفیت وہی جانتا ہے، چاند یا سورج کی مثالیں صرف سمجھانے کے لیے ہیں کہ باوجود اس کے کہ اللہ تعالیٰ کی ذات عرش کے اوپر ہے، وہ مخلوق کے ساتھ ہو سکتا ہے اور ہے۔ موجودہ زمانے میں اس کی ایک اور ادنیٰ سی مثال بجلی ہے کہ وہ اپنے اصل ٹھکانے میں ہونے کے باوجود ہزاروں میل دور تک موجود ہوتی ہے اور اس کا وجود سب محسوس کرتے ہیں۔ اللہ تعالیٰ کی معیت اور مخلوق پر مؤثر ہونے کے لیے یہ مثال بھی نہایت ادنیٰ مثال ہے، جبکہ اللہ کی صفات بہت اعلیٰ ہیں، چنانچہ فرمایا : «وَ لِلّٰهِ الْمَثَلُ الْاَعْلٰى » [ النحل : ۶۰ ] ’’اور اللہ کی سب سے اونچی صفت ہے۔‘‘ اس کے لیے عرش پر رہ کر ہر ایک کے ساتھ ہونا بالکل معمولی بات ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { لَهٗ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ:} یہ جملہ آیت (۲) میں گزرا ہے، دوبارہ تاکید کے لیے لایا گیا ہے۔ ¤ ➋ { وَ اِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ: ’’ اِلَى اللّٰهِ ‘‘} پہلے لانے کا مطلب یہ ہے کہ تمام معاملات اللہ  ہی کی طرف لوٹائے جاتے ہیں، کسی اور کی طرف نہیں، لہٰذا وہی تمام اعمال کا فیصلہ فرمائے گا اور ان کی جزا یا سزا دے گا۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {يُوْلِجُ الَّيْلَ فِي النَّهَارِ … :} اس آیت کی تفسیر کے لیے دیکھیے سورۂ آل عمران (۲۷)، حج (۶۱)، لقمان (۲۹)، ہود (۵) اور سورۂ رعد (۱۰)۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ { اٰمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ:} سورت کے شروع سے یہاں تک اس حقیقت کے اعلان کے بعد کہ آسمانوں اور زمین کی ہر چیز نے اللہ کا (ہر عیب اور کمی سے) پاک ہونا بیان کیا ہے، اللہ تعالیٰ کی دس سے زیادہ صفات بیان ہوئی ہیں جو یہ ہیں : {’’ الْعَزِيْزُ ، الْحَكِيْمُ ، لَهٗ مُلْكُ السَّمٰوٰتِ وَ الْاَرْضِ، يُحْيٖ وَ يُمِيْتُ، وَ هُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ، هُوَ الْاَوَّلُ وَ الْاٰخِرُ وَ الظَّاهِرُ وَ الْبَاطِنُ ، وَ هُوَ بِكُلِّ شَيْءٍ عَلِيْمٌ ، يُوْلِجُ الَّيْلَ فِي النَّهَارِ وَ يُوْلِجُ النَّهَارَ فِي الَّيْلِ ‘‘} ان صفات کے بیان کے بعد اس باات کی دعوت دی ہے کہ ان صفات کے مالک اللہ تعالیٰ پر اور اس کا پیغام لے کر آنے والے پر ایمان لاؤ۔ اس کے مخاطب اگرچہ کفار بھی ہیں، مگر بعد میں پورے سلسلۂ کلام سے ظاہر ہے کہ یہاں سے خطاب ان مسلمانوں کو ہے جو ایمان لا چکے تھے، مگر ایمان کے تقاضے پورے کرنے میں کوتاہی کر رہے تھے اور جہاد فی سبیل اللہ میں جان و مال کی قربانی سے گریز کر رہے تھے۔ یہ وہی بات ہے جو سورۂ نساء کی آیت (۱۳۶) : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اٰمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ »» (اے لوگو جو ایمان لائے ہو! ایمان لاؤ اللہ پر اور اس کے رسول پر)میں بیان ہوئی ہے۔ مطلب یہ ہے کہ اپنے ایمان میں پختگی پیدا کرو اور اس کے تقاضوں پر عمل کرو، جن میں سے ایک بہت بڑا تقاضا اس کی راہ میں خرچ کرنا ہے۔ ¤ ➋ { وَ اَنْفِقُوْا:} یہاں خرچ کرنے سے مراد عام بھلائی کے کاموں میں خرچ کرنا نہیں بلکہ جہاد فی سبیل اللہ اور مجاہدین و مہاجرین کی ضروریات کے لیے خرچ کرنا ہے۔ دلیل اس کی آگے آنے والی آیت (۱۰) ہے : «وَ مَا لَكُمْ اَلَّا تُنْفِقُوْا فِيْ سَبِيْلِ اللّٰهِ » ’’اور تمھیں کیا ہے تم اللہ کی راہ میں خرچ نہیں کرتے۔‘‘ اور {’’ فِيْ سَبِيْلِ اللّٰهِ ‘‘} کا خاص اطلاق جہاد پر ہوتا ہے۔ دیکھیے سورۂ توبہ کی آیت (۶۰) کی تفسیر۔ ¤ ➌ {مِمَّا جَعَلَكُمْ مُّسْتَخْلَفِيْنَ فِيْهِ:} اس میں کئی طرح سے خرچ کرنے کی ترغیب ہے، ایک یہ کہ یہ مال تمھارا نہیں بلکہ اللہ تعالیٰ کا ہے جو اس نے تم سے پہلے لوگوں کو دیا تھا، اب اس نے تمھیں اس میں پہلوں کا جانشین بنا دیا ہے اور دیکھنا چاہتا ہے کہ تم اس کی مرضی کے مطابق خرچ کرتے ہو یا نہیں۔ (دیکھیے انعام : ۱۶۵) غلام کا یہ کام نہیں کہ مالک کے مال کو وہاں خرچ نہ کرے جہاں وہ اسے خرچ کرنے کے لیے کہتا ہے، بلکہ اپنی مرضی سے خرچ کرتا پھرے یا جمع کرنے لگ جائے۔ دوسرا یہ کہ پہلے لوگوں کی طرح یہ تمھارے پاس بھی نہیں رہے گا۔ اگر تم نے اسے اللہ کی راہ میں خرچ کر لیا تو یہ آخرت کے لیے تمھارا ذخیرہ بن جائے گا اور اگر تم نے خرچ نہ کیا تو کچھ اور لوگ اس میں تمھارے جانشین بن جائیں گے۔ پھر اگر انھوں نے اسے نیکی میں خرچ کیا تو وہ تم سے بہتر رہے کہ وہ مال جو تم نیکی میں خرچ نہ کر سکے انھوں نے کر دیا، تم محروم رہے اور اگر انھوں نے بدی میں خرچ کیا تو تمھاری دولت بھی ان کی بدی میں معاون ٹھہری۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَقُوْلُ الْعَبْدُ مَالِيْ مَالِيْ، إِنَّمَا لَهُ مِنْ مَّالِهِ ثَلَاثٌ، مَا أَكَلَ فَأَفْنٰی أَوْ لَبِسَ فَأَبْلٰی أَوْ أَعْطٰی فَاقْتَنٰی، وَمَا سِوَی ذٰلِكَ فَهُوَ ذَاهِبٌ وَتَارِكُهُ لِلنَّاسِ ] [مسلم، کتاب الزھد والرقائق، باب الدنیا سجن للمؤمن وجنۃ للکافر : ۲۹۵۹ ] ’’بندہ کہتا ہے میرا مال میرا مال، اس کے مال میں سے اس کی اپنی تو صرف تین چیزیں ہیں، جو اس نے کھایا اور فنا کر دیا، یا پہنا اور بوسیدہ کر دیا، یا دے دیا اور ذخیرہ بنا لیا اور جو اس کے علاوہ ہے تو یہ جانے والا ہے اور اسے لوگوں کے لیے چھوڑ جانے والا ہے۔‘‘ ¤ ➍ {فَالَّذِيْنَ اٰمَنُوْا مِنْكُمْ وَ اَنْفَقُوْا:} یہ لوگ جو ایمان لائے اور انھوں نے خرچ کیا ان میں سب سے پہلے ابوبکر رضی اللہ عنہ ہیں جو رسول اللہ صلی اللہ علیہ وسلم پر سب سے پہلے ایمان لائے اور تبوک کے موقع پر صدقہ کے اعلان پر سارا مال لے آئے، ان میں عمر رضی اللہ عنہ بھی ہیں جو آدھا مال لے آئے اور عثمان رضی اللہ عنہ بھی اور وہ تمام صحابہ کرام رضی اللہ عنھم بھی جنھوں نے خوش حالی میں بھی خرچ کیا اور تنگ دستی کے باوجود محنت مشقت کر کے بھی صدقہ کیا۔ مزید تفصیل کے لیے دیکھیے سورۂ توبہ (۷۹) کی تفسیر۔ ¤ ➎ {لَهُمْ اَجْرٌ كَبِيْرٌ:} ’’فی سبيل الله‘‘ خرچ کرنے والوں کی فضیلت کے لیے دیکھیے سورۂ بقرہ (۲۷۴) اور سورۂ انفال (۶۰)۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { وَ مَا لَكُمْ لَا تُؤْمِنُوْنَ بِاللّٰهِ … :} یہ خطاب بھی مسلمانوں ہی سے ہے، اس کیی دلیل آیت کا آخری جملہ {’’ وَ قَدْ اَخَذَ مِيْثَاقَكُمْ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ ‘‘} (اور یقینا وہ تم سے پختہ عہد لے چکا ہے اگر تم مومن ہو) ہے۔ اسی طرح بعد والی آیت (۱۰): « لَا يَسْتَوِيْ مِنْكُمْ مَّنْ اَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَ قٰتَلَ » بھی اس کی دلیل ہے۔ جس طرح پچھلی آیت میں ایمان والوں کو ایمان لانے اور خرچ کرنے کا حکم ہے، اسی طرح اس آیت میں بھی انھیں جھنجھوڑا جا رہا ہے کہ آخر وجہ کیا ہے کہ تم اللہ پر ایمان نہیں لاتے؟ یعنی اس پر ایمان کے تقاضوں پر عمل کرتے ہوئے اس کے راستے میں خرچ نہیں کرتے، حالانکہ رسول خود تمھارے درمیان موجود ہے اور بہ نفس نفیس تمھیں اس بات کی دعوت دے رہا ہے کہ اپنے رب پر ایمان لاؤ اور اس پر یقین رکھتے ہوئے اس کی راہ میں خرچ کرو۔ ¤ ➋ {وَ قَدْ اَخَذَ مِيْثَاقَكُمْ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ: ’’ اَخَذَ ‘‘} کا فاعل {’’ الرَّسُوْلُ ‘‘} کی ضمیر بھی ہو سکتی ہے اور لفظ {’’ اللّٰهِ‘‘} کی ضمیر بھی، یعنی جب تم نے ایمان قبول کیا تھا اس وقت اللہ نے تم سے اطاعت کا پختہ عہد لیا تھا، اسی طرح کلمۂ اسلام کے ساتھ تم رسول کو بھی اپنی اطاعت کا پختہ عہد دے چکے ہو، تو اب اطاعت سے گریز اور جہاد فی سبیل اللہ میں خرچ کرنے سے دریغ کیوں کر رہے ہو ؟ اللہ تعالیٰ کے عہد لینے کا ذکر اس آیت میں ہے : «وَ اذْكُرُوْا نِعْمَةَ اللّٰهِ عَلَيْكُمْ وَ مِيْثَاقَهُ الَّذِيْ وَاثَقَكُمْ بِهٖۤ اِذْ قُلْتُمْ سَمِعْنَا وَ اَطَعْنَا وَ اتَّقُوا اللّٰهَ اِنَّ اللّٰهَ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ » [ المائدۃ : ۷ ] ’’اور اپنے اوپر اللہ کی نعمت یاد کرو اور اس کا عہد جو اس نے تم سے مضبوط باندھا، جب تم نے کہا ہم نے سنا اور ہم نے مان لیا اور اللہ سے ڈرو، بے شک اللہ سینوں کی بات کو خوب جاننے والا ہے۔‘‘ اور رسول اللہ صلی اللہ علیہ وسلم کو عہد دینے کا ذکر اس حدیث میں ہے جو عبادہ بن صامت رضی اللہ عنہ سے مروی ہے، انھوں نے فرمایا : [ بَايَعْنَا رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ عَلَی السَّمْعِ وَالطَّاعَةِ فِي الْمَنْشَطِ وَالْمَكْرَهِ وَ أَنْ لاَ نُنَازِعَ الْأَمْرَ أَهْلَهُ، وَ أَنْ نَقُوْمَ أَوْ نَقُوْلَ بِالْحَقِّ حَيْثُمَا كُنَّا، لاَ نَخَافُ فِي اللّٰهِ لَوْمَةَ لاَئِمٍ ] [بخاري، الأحکام، باب کیف یبایع الإمام الناس؟ : ۷۱۹۹،۷۲۰۰ ] ’’ہم نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی کہ نشاط اور ناگواری دونوں حالتوں میں سمع و طاعت کریں گے اور صاحب امر سے امارت میں جھگڑا نہیں کریں گے اور جہاں بھی ہوں گے حق کہیں گے، اللہ کے بارے میں کسی ملامت کرنے والے کی ملامت سے نہیں ڈریں گے۔‘‘ ¤ ➌ بعض مفسرین نے {’’ وَ قَدْ اَخَذَ مِيْثَاقَكُمْ ‘‘} سے {’’ اَلَسْتُ بِرَبِّكُمْ ‘‘} والا عہد مراد لیا ہے، جس کا ذکر سورۂ اعراف (۱۷۲) میں ہے، مگر یہاں آیات کا سیاق اس کی موافقت نہیں کرتا، اس لیے پہلی تفسیر ہی درست ہے۔ ابن کثیر رحمہ اللہ نے بھی اسی کو ترجیح دی ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ {هُوَ الَّذِيْ يُنَزِّلُ عَلٰى عَبْدِهٖۤ اٰيٰتٍۭ بَيِّنٰتٍ … :} اس آیت کی تفصیل کے لیے دیکھیے سورۂ مائدہ (۱۵،۱۶) کی تفسیر۔ ¤ ➋ { لَرَءُوْفٌ رَّحِيْمٌ:} اس کی تفسیر کے لیے دیکھیے سورۂ حج (۶۵)۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {وَ مَا لَكُمْ اَلَّا تُنْفِقُوْا فِيْ سَبِيْلِ اللّٰهِ وَ لِلّٰهِ مِيْرَاثُ السَّمٰووٰتِ وَ الْاَرْضِ:} ’’ميراث‘‘ اصل میں اس ملکیت کو کہتے ہیں جو پچھلے مالک کے انتقال پر اس کے زندہ رہنے والے وارثوں کو ملتی ہے۔ یہ ملکیت جبری ہوتی ہے، مرنے والا چاہے یا نہ چاہے، جو وارث ہوتا ہے اس کی طرف منتقل ہو جاتی ہے۔ {’’ لِلّٰهِ مِيْرَاثُ السَّمٰوٰتِ وَ الْاَرْضِ ‘‘} میں خبر {’’ لِلّٰهِ ‘‘} کو پہلے لانے سے حصر پیدا ہو گیا کہ زمین و آسمان کی وراثت صرف اللہ کے لیے ہے، کیونکہ آخر کار سب نے فنا ہونا ہے اور جن چیزوں کے مالک تم سمجھے جاتے ہو سب اسی کی طرف لوٹ جانے والی ہیں۔ تو جب یہ مال تمھارے پاس رہنے والا ہی نہیں بلکہ اس نے تمھارے ہاتھ سے نکلنا ہی نکلنا ہے اور اگر تم خرچ نہیں کرو گے تو جبراً تم سے لے لیا جائے گا، تو پھر کیا وجہ ہے کہ تم اسے اللہ کی راہ میں خوشی سے خود ہی خرچ نہ کرو کہ اس صورت میں مالک بھی راضی ہو جائے گا اور جو کچھ تم دو گے اللہ کے ذمے قرض ہو جائے گا، جو بے حساب اضافے کے ساتھ تمھارے لیے محفوظ رکھے گا، جیسا کہ اگلی آیت میں آ رہا ہے۔ آدمی کے مال کی طرح اس کی جان کا بھی یہی حال ہے۔ ایک فارسی شاعر نے کیا خوب کہا ہے : ¤ جاں بجاناں دہ، وگرنہ از تو بستاند اجل ¤ خود تو منصف باش اے دل ایں نِکو یاآن نِکو ¤ ’’جان محبوب کو دے دے، ورنہ موت تجھ سے لے لے گی۔ اے دل! تو خود ہی انصاف کر کہ یہ بہتر ہے یا وہ بہتر ہے؟‘‘ ¤ ➋ {لَا يَسْتَوِيْ مِنْكُمْ مَّنْ اَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَ قٰتَلَ :} یہاں کچھ عبارت محذوف ہے جو بعد میں آنے والے جملے {’’ اُولٰٓىِٕكَ اَعْظَمُ دَرَجَةً مِّنَ الَّذِيْنَ اَنْفَقُوْا مِنْۢ بَعْدُ وَ قٰتَلُوْا ‘‘} سے واضح ہو رہی ہے۔ گویا پوری عبارت اس طرح ہے: {’’ لاَ يَسْتَوِيْ مِنْكُمْ مَنْ أَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقَاتَلَ وَمَنْ أَنْفَقَ مِنْ بَعْدِ الْفَتْحِ وَقَاتَلَ‘‘} یعنی ’’تم میں سے وہ شخص جس نے فتح سے پہلے خرچ کیا اور جنگ کی اور وہ شخص جس نے فتح کے بعد خرچ کیا اور جنگ کی برابر نہیں ہیں۔‘‘ {’’ الْفَتْحِ ‘‘} سے مراد فتح مکہ ہے، جس کے متعلق اللہ تعالیٰ نے فرمایا : « اِذَا جَآءَ نَصْرُ اللّٰهِ وَ الْفَتْحُ » [ النصر : ۱ ] ’’جب اللہ کی مدد اور فتح آجائے۔‘‘ یا صلح حدیبیہ ہے، جس کے متعلق اللہ تعالیٰ نے فرمایا : « اِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنًا » [ الفتح : ۱ ] ’’بے شک ہم نے تجھے فتح دی، ایک کھلی فتح۔‘‘ اور دونوں بھی مراد ہو سکتی ہیں۔ اس طرح صحابہ کے تین درجے ہوں گے، پہلے درجے میں صلح حدیبیہ سے پہلے ایمان لا کر خرچ اور قتال کرنے والے سابقین اوّلین اور مہاجرین و انصار، دوسرے درجے میں صلح حدیبیہ کے بعد اورفتح مکہ سے پہلے ہجرت و نصرت کا شرف حاصل کرنے والے صحابہ کرام اور تیسرے درجے میں فتح مکہ کے بعد مسلمان ہونے والے صحابہ کرام ہوں گے، جو ہجرت یا نصرت کا شرف حاصل نہیں کر سکے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ هِجْرَةَ بَعْدَ الْفَتْحِ ] [ بخاري، الجہاد والسیر، باب فضل الجہاد والسیر : ۲۷۸۳ ] ’’فتح مکہ کے بعد (اب) ہجرت نہیں رہی۔‘‘ ¤ اس بات کی دلیل کہ صلح حدیبیہ سے پہلے خرچ اور قتال کرنے والے ان لوگوں سے درجے میں بلند ہیں جو فتح مکہ سے پہلے اور صلح حدیبیہ کے بعد ایمان لائے، وہ حدیث ہے جو انس رضی اللہ عنہ سے مروی ہے، انھوں نے فرمایا : [ كَانَ بَيْنَ خَالِدِ بْنِ الْوَلِيْدِ، وَ بَيْنَ عَبْدِ الرَّحْمٰنِ بْنِ عَوْفٍ كَلاَمٌ، فَقَالَ خَالِدٌ لِعَبْدِ الرَّحْمٰنِ تَسْتَطِيْلُوْنَ عَلَيْنَا بِأَيَّامٍ سَبَقْتُمُوْنَا بِهَا، فَبَلَغَنَا أَنَّ ذٰلِكَ ذُكِررَ لِلنَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ دَعُوْا لِيْ أَصْحَابِيْ ، فَوَالَّذِيْ نَفْسِيْ بِيَدِهِ ! لَوْ أَنْفَقْتُمْ مِثْلَ أُححُدٍ، أَوْ مِثْلَ الْجِبَالِ ذَهَبًا مَا بَلَغْتُمْ أَعْمَالَهُمْ ] [مسند أحمد: 266/3، ح : ۱۳۸۱۲۔ مسند احمد کے محقق نے اسے صحیح کہا ہے ] ’’ خالد بن ولید رضی اللہ عنہ اور عبدالرحمن بن عوف رضی اللہ عنہ کے درمیان کچھ بات ہو گئی تو خالد رضی اللہ عنہ نے عبدالرحمن رضی اللہ عنہ سے کہا : ’’تم ہم پر ان چند دنوں کی وجہ سے بڑھ کر باتیں بنا رہے ہو جن میں تم ہم سے پہلے اسلام لے آئے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم کے پاس اس بات کا ذکر ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’میرے ساتھیوں کو میری خاطر چھوڑ دو، قسم اس کی جس کے ہاتھ میں میری جان ہے! اگر تم احد کے برابر یا پہاڑوں کے برابر سونا خرچ کرو، تب بھی تم ان کے اعمال کو نہیں پہنچ سکتے۔‘‘ ¤ ➌ فتح سے پہلے خرچ اور قتال کرنے والوں کا درجہ اس لیے بڑا ہے کہ فتح سے پہلے مسلمان تعداد میں کم اور قوت میں کمزور تھے، ان کی مالی حالت بھی بہت کمزور تھی، ان حالات میں اللہ کی راہ میں خرچ کرنا اور جہاد میں حصہ لینا دونوں نہایت مشکل اور دل گردے کے کام تھے، جب کہ فتح کے بعد یہ صورت حال بدل گئی، مسلمان قوت و تعداد میں بڑھتے چلے گئے اور ان کی مالی حالت بھی پہلے سے بہت بہتر ہوگئی اور پورا جزیرۂ عرب فوج در فوج اسلام میں داخل ہونے لگا۔ اس لیے فرمایا کہ پہلے مشکل کے دور اور بعد کے دور میں مسلمان ہونے والے اور جہاد میں خرچ کرنے والے اور لڑنے والے برابر نہیں ہو سکتے، بلکہ پہلوں کا درجہ بڑا ہے۔ ¤ ➍ ابو بکر صدیق رضی اللہ عنہ شرف اور فضیلت میں امت کے تمام افراد سے بڑھ کر ہیں، کیونکہ ایمان لانے میں اور اللہ کی راہ میں خرچ کرنے اور لڑنے میں وہ تمام صحابہ سے پہلے ہیں، اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے انھیں اپنی زندگی میں نماز کے لیے آگے کیا اور اسی بنا پر مسلمانوں نے انھیں خلافت کے منصب کے لیے مقدم رکھا۔ ¤ ➎ { وَ كُلًّا وَّعَدَ اللّٰهُ الْحُسْنٰى:} اس میں یہ صراحت فرما دی کہ صحابہ کرام رضی اللہ عنھم کے درمیان اگرچہ درجے اور فضیلت میں تفاوت ہے، مگر اس کا یہ مطلب نہیں کہ بعد میں مسلمان ہونے والے صحابہ کرام کو کوئی فضیلت حاصل نہیں، بلکہ اللہ تعالیٰ نے تمام صحابہ سے اچھی جزا یعنی جنت کا وعدہ کیا ہے اور تمام اصحاب رسول صلی اللہ علیہ وسلم جنتی ہیں۔ حقیقت یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی صحبت اور زیارت میں تاثیر ہی ایسی تھی کہ جس شخص نے بھی ایمان کی حالت میں رسول اللہ صلی اللہ علیہ وسلم کی زیارت کی اور ایمان پر فوت ہوا، بعد کا کوئی آدمی اس کے درجے کے برابر نہیں ہو سکتا۔ دیکھیے سورۂ فتح کی آخری آیت کی تفسیر میں مذکور حدیث، جس میں رسول اللہ صلی اللہ علیہ وسلم کو دیکھنے والے آدمی کی برکت و فضیلت کا ذکر ہے۔ بڑے بد نصیب ہیں وہ لوگ جنھیں رسول اللہ صلی اللہ علیہ وسلم کی صحبت و رفاقت کا شرف رکھنے والی مبارک ہستیوں سے بغض اور عداوت ہے اور وہ ان کے جہاد اور انفاق فی سبیل اللہ سے آنکھیں بند کر کے ان کی معمولی لغزشوں کی وجہ سے ان پر تبرے بازی اور دشنام طرازی کرتے ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لاَ تَسُبُّوْا أَصْحَابِيْ، فَلَوْ أَنَّ أَحَدَكُمْ أَنْفَقَ مِثْلَ أُحُدٍ ذَهَبًا مَا بَلَغَ مُدَّ أَحَدِهِمْ وَلاَ نَصِيْفَهُ ] [ بخاري، فضائل الصحابۃ، باب قول النبي صلی اللہ علیہ وسلم : « لو کنت متخذا خلیلا» : ۳۶۷۳ ] ’’میرے ساتھیوں کو برا بھلا مت کہو، کیونکہ قسم ہے اس کی جس کے ہاتھ میں میری جان ہے! اگر تم میں سے کوئی شخص اُحد کے برابر سونا بھی خرچ کرے تو ان کے کسی شخص کے ایک مُد (آدھ کلو اناج) کے برابر نہیں ہو سکتا اور نہ ہی اس کے نصف کے برابر ہو سکتا ہے۔‘‘ ¤ ➏ {وَ اللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ:} ایمان، انفاق اور قتال فی سبیل اللہ کی ترغیب کے آخر میں فرمایا کہ جو کچھ تم کر رہے ہو اللہ تعالیٰ اس سے پوری طرح باخبر ہے، وہ ہر ایک کے عمل کو خوب جانتا ہے کہ کس درجے کا ہے اور اس میں کتنا اخلاص ہے اور وہ اس کے مطابق ہی اسے جزا دے گا۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {مَنْ ذَا الَّذِيْ يُقْرِضُ اللّٰهَ قَرْضًا حَسَنًا …:} اس کی تفسیر کے لیے دیکھیے سورۂ بقرہ (245،244) اور {’’ اَجْرٌ كَرِيْمٌ ‘‘} کے لیے دیکھیے سورۂ انفال (۷۴) اور سورۂ حج (۵۰)۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) {يَوْمَ تَرَى الْمُؤْمِنِيْنَ وَ الْمُؤْمِنٰتِ …:} یعنی قیامت کے دن جب سورج لپیٹ دیا جائے گا (دیکھیے تکویر : ۱) اور چاند بے نور ہو جائے گا (دیکھیے قیامہ : ۸) اور ستارے بکھر کر گر جائیں گے (دیکھیے انفطار : ۲) تواس وقت سب لوگ سخت اندھیرے میں ہوں گے، جہنم کے اوپر صراط (پل) رکھا جائے گا جس پر سے ہر ایک کو گزرنا ہو گا، جیسا کہ فرمایا : « وَ اِنْ مِّنْكُمْ اِلَّا وَارِدُهَا كَانَ عَلٰى رَبِّكَ حَتْمًا مَّقْضِيًّا» [ مریم : ۷۱ ] ’’اور تم میں سے جو بھی ہے اس پر وارد ہونے والا ہے۔ یہ ہمیشہ سے تیرے رب کے ذمے قطعی بات ہے، جس کا فیصلہ کیا ہوا ہے۔‘‘ وہاں روشنی صرف ایمان اور عمل صالح کی ہوگی، جتنا ایمان کامل ہوگا اتنی ہی روشنی تیز ہوگی۔ کافر اور منافق دنیا میں گمراہی کے اندھیرے میں رہے تو وہاں بھی وہ اندھیرے میں ہوں گے۔ مومن مردوں اور عورتوں کی روشنی ان کے ایمان و عمل کے مراتب کے مطابق ان کے آگے اور دائیں جانب دوڑ رہی ہوگی اور وہاں انھیں یہ کہہ کر جنت کی بشارت دی جائے گی : « بُشْرٰىكُمُ الْيَوْمَ جَنّٰتٌ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا ذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُ» [ الحدید : ۱۲ ] ’’آج تمھیں ایسے باغوں کی خوش خبری ہے جن کے تلے نہریں چلتی ہیں، ہمیشہ ان میں رہنے والے ہو، یہی تو بہت بڑی کامیابی ہے۔‘‘"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ { يَوْمَ يَقُوْلُ الْمُنٰفِقُوْنَ وَ الْمُنٰفِقٰتُ … :} دنیا میں مسلمانوں کے ساتھ رہنے کی طرح منافقین وہاں بھی شروع میں ایمان والوں کے ساتھ ہوں گے، مگر جب وہ اپنے ایمان کی روشنی میں جنت کی جانب روانہ ہوں گے کہ تو منافق مرد اور عورتیں ان سے کہیں گے ہمارے پاس روشنی نہیں، تم ہمیں اندھیرے میں چھوڑ کر اتنی تیزی سے نہ جاؤ، بلکہ تھوڑا انتظار کر لو اور ہمیں موقع دو کہ ہم بھی تمھاری روشنی میں جنت کی طرف چلتے جائیں۔ ¤ ➋ {قِيْلَ ارْجِعُوْا وَرَآءَكُمْ فَالْتَمِسُوْا نُوْرًا:} اس کے دو مطلب ہو سکتے ہیں، ایک یہ کہ ان سے کہا جائے گا کہ میدان حشر جہاں جنت یا جہنم میں بھیجے جانے کا فیصلہ ہوا ہے اور جہاں سے روشنی ملتی ہے، تم وہیں واپس جاؤ اور وہاں روشنی تلاش کرو۔ دوسرا مطلب یہ ہے کہ یہ ایمان و عمل کی روشنی ہے جو یہاں حاصل نہیں ہو سکتی، اسے حاصل کرنے کی جگہ دنیا ہے، وہاں جاؤ اور وہاں سے یہ روشنی لے کر آؤ۔ ¤ ➌ { فَضُرِبَ بَيْنَهُمْ بِسُوْرٍ لَّهٗ بَابٌ …:} مومن و منافق یہ باتیں کر ہی رہے ہوں گے کہ ان کے درمیان ایک عظیم دیوار حائل کر دی جائے گی ({بِسُوْرٍ} میں تنوین تعظیم کی ہے) جس سے انھیں دور سے دکھائی دینے والی مومنوں کی روشنی بھی نظر آنا ختم ہو جائے گی۔ اس دیوار کی اندرونی جانب رحمت ہوگی اور بیرونی جانب جدھر منافق ہوں گے، عذاب ہو گا۔ اس دیوار میں ایک عظیم دروازہ ہو گا، جس سے مومن اس کی اندرونی جانب چلے جائیں گے، پھر دروازہ بند کر دیا جائے گا اور منافق اس سے باہر عذاب میں رہ جائیں گے۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) ➊ { يُنَادُوْنَهُمْ اَلَمْ نَكُنْ مَّعَكُمْ:} منافق انھیں پکار پکار کر کہیں گے کہ کیا ہم تمھارے ساتھ نہ تھے، کیا ہم کلمہ نہیں پڑھتے تھے، کیا ہم تمھارے ساتھ نمازیں نہیں پڑھتے تھے، زکوٰۃ اور حج ادا نہیں کرتے تھے اور ہر کام میں تمھارے ساتھ نہیں ہوتے تھے ؟ اب تم ہمیں ساتھ کیوں نہیں لے جاتے؟ ¤ ➋ { قَالُوْا بَلٰى وَ لٰكِنَّكُمْ فَتَنْتُمْ اَنْفُسَكُمْ:} یعنی تم مسلمان ہو کر بھی نہ دل سے مسلمان ہوئے اور نہ پوری طرح ایک طرف ہو کر مسلمانوں کے ساتھی بنے، بلکہ تم نے اپنے آپ کو نفاق کے فتنے ہی میں مبتلا رکھا۔ ¤ ➌ {وَ تَرَبَّصْتُمْ:} اور تم انتظار میں رہے کہ کب مسلمانوں پر کوئی آفت آتی ہے۔ ¤ ➍ { وَ ارْتَبْتُمْ:} یہ {’’رَيْبٌ‘‘} سے باب افتعال {’’ اِرْتَابَ يَرْتَابُ اِرْتِيَابًا‘‘} کے ماضی معلوم کا صیغہ ہے، یعنی اللہ اور اس کے رسول پر ایمان و یقین کے بجائے تم شک اور تذبذب میں رہے۔ ¤ ➎ { وَ غَرَّتْكُمُ الْاَمَانِيُّ: ’’ الْاَمَانِيُّ ‘‘ ’’ أُمْنِيَّةٌ ‘‘} کی جمع ہے، یعنی تمھیں ان آرزوؤں نے دھوکے میں رکھا کہ بس چند دن میں مسلمان تباہ ہو جائیں گے اور اسلام کا نام و نشان مٹ جائے گا۔ ¤ ➏ {حَتّٰى جَآءَ اَمْرُ اللّٰهِ:} حتیٰ کہ تمھیں موت آگئی اور توبہ اور اخلاصِ عمل کا موقع ہاتھ سے نکل گیا۔ ¤ ➐ { وَ غَرَّكُمْ بِاللّٰهِ الْغَرُوْرُ: ’’ الْغَرُوْرُ ‘‘} سے مراد شیطان ہے۔ مزید دیکھیے سورۂ فاطر ( 6،5)۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15) { فَالْيَوْمَ لَا يُؤْخَذُ مِنْكُمْ فِدْيَةٌ …:} اس سے معلوم ہوا کہ قیامت کے دن کفار و منافقین کا ٹھکانا ایک ہی ہوگا، جو آگ ہے۔ وہاں وہ مال نہ منافقین کے کام آئے گا جس کی وجہ سے وہ نفاق کا شکار رہے، نہ کفار کے کہ اس کے ساتھ فدیہ دے کر عذاب سے چھوٹ جائیں اور نہ ہی آگ کے سوا ان کا کوئی یار و مدد گار ہو گا اور وہ بہت برا ٹھکانا ہے۔ مزید دیکھیے سورۂ آل عمران ( ۹۱)۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) ➊ {اَلَمْ يَاْنِ لِلَّذِيْنَ اٰمَنُوْۤا …:’’ اَلَمْ يَاْنِ ‘‘ ’’أَنٰي يَأْنِيْ أَنْيًا وَ إِنًي‘‘} (ض) ناقص یائی سے جحد معلوم ہے، کسی چیز کے وقت کا آ جانا، جیسا کہ فرمایا : « غَيْرَ نٰظِرِيْنَ اِنٰىهُ » [ الأحزاب : ۵۳ ] ’’اس (کھانے) کے (پکنے کے) وقت کا انتظار نہ کرنے والے۔‘‘ پچھلی آیت میں قیامت کے دن مومن مردوں اور عورتوں اور منافق مردوں اور عورتوں کا حال ذکر فرمایا، جسے سن کر دل لرز اٹھتے ہیں اور خوف زدہ ہو کر عاجزی سے اپنے رب کے سامنے جھک جاتے ہیں۔ اس کے باوجود ان سے کماحقہ اثر قبول نہ کرنے پر ایمان والوں کو متنبہ فرمایا کہ کیا ابھی وہ وقت نہیں آیا کہ ان کے دل اللہ تعالیٰ کی یاد اور اس کی نصیحت کی وجہ سے اور اس کی طرف سے نازل ہونے والے حق کی وجہ سے اللہ تعالیٰ کے سامنے عاجز ہو کر جھک جائیں؟ ایمان والوں سے مراد وہ تمام ایمان والے ہیں جنھیں اس سے پہلے ایمان لانے، اللہ کی راہ میں خرچ کرنے اور لڑنے کا حکم دیا گیا ہے اور اس میں سستی اور کوتاہی پر عتاب کیا گیا ہے۔ مقصد یہ ہے کہ اللہ تعالیٰ کی آیات میں اتنا عتاب سن کر اور قیامت کے دن منافقین کا انجامِ بد سن کر بھی کیا ایمان والوں کے لیے اللہ کے سامنے جھکنے اور اس کے احکام پر تن دَہی سے عمل کرنے کا وقت نہیں آیا؟ جب کہ ایمان کا تقاضا تو یہ ہے کہ اللہ کی آیات سن کر دل نرم ہو جائے اور اللہ کو یاد کرتے ہوئے فوراً نصیحت کا اثر قبول کرے، کیونکہ ایمان والوں کی یہی شان ہوتی ہے، جیسا کہ فرمایا : « اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اِذَا ذُكِرَ اللّٰهُ وَ جِلَتْ قُلُوْبُهُمْ وَ اِذَا تُلِيَتْ عَلَيْهِمْ اٰيٰتُهٗ زَادَتْهُمْ اِيْمَانًا وَّ عَلٰى رَبِّهِمْ يَتَوَكَّلُوْنَ» [ الأنفال : ۲ ] ’’(اصل) مومن تو وہی ہیں کہ جب اللہ کا ذکر کیا جائے تو ان کے دل ڈر جاتے ہیں اور جب ان پر اس کی آیات پڑھی جائیں تو انھیں ایمان میں بڑھا دیتی ہیں اور وہ اپنے رب ہی پر بھروسا رکھتے ہیں۔‘‘ اور فرمایا : «اَللّٰهُ نَزَّلَ اَحْسَنَ الْحَدِيْثِ كِتٰبًا مُّتَشَابِهًا مَّثَانِيَ تَقْشَعِرُّ مِنْهُ جُلُوْدُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِيْنُ جُلُوْدُهُمْ وَ قُلُوْبُهُمْ اِلٰى ذِكْرِ اللّٰهِ » [ الزمر : ۲۳ ] ’’اللہ نے سب سے اچھی بات نازل فرمائی، ایسی کتاب جو آپس میں ملتی جلتی ہے، (ایسی آیات )جو باربار دہرائی جانے والی ہیں، اس سے ان لوگوں کی کھالوں کے رونگٹے کھڑے ہو جاتے ہیں جو اپنے رب سے ڈرتے ہیں، پھر ان کی کھالیں اور ان کے دل اللہ کے ذکر کی طرف نرم ہو جاتے ہیں۔‘‘ ¤ ➋ {وَ لَا يَكُوْنُوْا كَالَّذِيْنَ اُوْتُوا الْكِتٰبَ … : ’’قَسَتْ‘‘} اصل میں {’’قَسَوَتْ‘‘} ہے، باب اس کا {’’ قَسَا يَقْسُوْ قَسْوَةً وَقَسَاوَةً ‘‘} آتا ہے، سخت ہو جانا۔ یعنی کیا ایمان والوں کے لیے وقت نہیں آیا کہ…اور وہ ان لوگوں کی طرح نہ ہو جائیں جنھیں اس سے پہلے کتاب یعنی تورات اور اس کے بعد انجیل دی گئی کہ شروع میں ان کا یہ حال تھا کہ اللہ کی آیات سن کر ان کے دل نرم ہو جاتے اور وہ ڈر جاتے تھے اور اپنی خواہشات کے پیچھے چلنے کے بجائے اللہ تعالیٰ کے احکام پر عمل کرتے تھے، پھر جیسے جیسے انبیاء کے زمانے سے دوری ہوتی گئی وہ خواہشات اور دنیا کی لذتوں کے پیچھے پڑتے گئے اور اللہ کے احکام جاننے کے باوجود ان پر عمل چھوڑ بیٹھے، جس سے ان کے دل سخت ہو گئے اور انھوں نے دانستہ اللہ کی حرام کردہ چیزوں کو حلال کر لیا۔ شرک، زنا، قتلِ ناحق، چوری، سود خوری اور دوسرے گناہ عام ہوگئے۔ اللہ کی آیات سن کر دل نرم ہونے اور ان کے سامنے جھک جانے کے بجائے انھوں نے ان میں تحریف شروع کر دی، جس کے نتیجے میں وہ راہِ راست سے بہت دور چلے گئے اور باہمی ضد اور عناد میں بہت سے فرقوں میں بٹ گئے۔ ¤ ➌ { وَ كَثِيْرٌ مِّنْهُمْ فٰسِقُوْنَ:} یعنی اب بھی ان کا یہی حال ہے کہ ان میں سے بہت زیادہ لوگ فاسق ہیں۔ {’’ فَقَسَتْ قُلُوْبُهُمْ ‘‘} میں ان کی قلبی حالت کا بیان ہے اور {’’ فٰسِقُوْنَ ‘‘} میں ان کی عملی حالت کا بیان ہے۔ دوسری جگہ اس قسوتِ قلب کا سبب اور اس کا نتیجہ کچھ تفصیل سے بیان فرمایا ہے، وہاں ان کے دوسرے عہد توڑنے کے ساتھ قرضِ حسن دینے کا عہد توڑنے کا بھی ذکر فرمایا ہے۔تفصیل کے لیے دیکھیے سورۂ مائدہ کی آیت (13،12) کی تفسیر۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) ➊ {اِعْلَمُوْۤا: } ’’جان لو‘‘ اس کا یہ مطلب نہیں کہ وہ یہ بات نہیں جانتے تھے کہ اللہ تتعالیٰ زمین کو مرنے کے بعد زندہ کر دیتا ہے، بلکہ یہ ایسے ہی ہے جیسے فرمایا : «وَ اعْلَمُوْۤا اَنَّ اللّٰهَ يَعْلَمُ مَا فِيْۤ اَنْفُسِكُمْ فَاحْذَرُوْهُ» [ البقرۃ : ۲۳۵ ] ’’ اور جان لو کہ اللہ جانتا ہے جو تمھارے دلوں میں ہے، پس اس سے ڈرو۔‘‘ مقصد یہ ہے کہ یہ بات پوری توجہ سے سنو، اس پر غور کرو اور ہر وقت اسے پیشِ نظر رکھو۔ ¤ ➋ {اَنَّ اللّٰهَ يُحْيِ الْاَرْضَ بَعْدَ مَوْتِهَا …:} اس میں اللہ کی طرف رجوع کی اور گزشتہ کوتاہیوں کی تلافی کی ترغیب اور اپنی رحمت و مغفرت کی امید دلائی ہے، یعنی اگر تمھاری کوتاہیوں کی وجہ سے دلوں میں سختی پیدا ہو چکی ہے اور ان میں آیاتِ الٰہی سننے سے نرمی پیدا نہیں ہوتی تو اب بھی موقع ہے کہ اس کی تلافی کر لو، پھر جب تم پلٹ آؤ گے تو وہ اللہ جو زمین کو اس کی موت کے بعد زندہ کر دیتا ہے، وہ تمھارے مردہ دلوں کو بھی زندگی بخش دے گا۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) ➊ {اِنَّ الْمُصَّدِّقِيْنَ وَ الْمُصَّدِّقٰتِ: ’’ الْمُصَّدِّقِيْنَ ‘‘} اصل میں باب تفعّل سے {’’ اَلْمُتَصَدِّقِيْنَ ‘‘} ہے، تاء کو صاد سے بدل کر صاد میں ادغام کر دیا۔ صاد کی تشدید سے صدقے میں مبالغے اور کثرت کا اظہار مقصود ہے، یعنی بہت صدقہ کرنے والے مرد اور بہت صدقہ کرنے والی عورتیں۔ {’’ الْمُزَّمِّلُ ‘‘} اور{’’ الْمُدَّثِّرُ ‘‘} میں بھی ایسے ہی ہے۔ ¤ ➋ {وَ اَقْرَضُوا اللّٰهَ قَرْضًا حَسَنًا …:} یہاں ایک سوال ہے کہ {’’ اَقْرَضُوا اللّٰهَ ‘‘} فعل کا {’’ الْمُصَّدِّقِيْنَ ‘‘} اسم فاعل پر عطف کس طرح ڈالا گیا ہے؟ اس کے جوابات میں سے ایک جواب یہ ہے کہ {’’ الْمُصَّدِّقِيْنَ ‘‘} دراصل {’’اَلَّذِيْنَ تَصَدَّقُوْا‘‘} کے معنی میں ہے، اس لیے {’’ اَقْرَضُوا ‘‘} کا عطف {’’تَصَدَّقُوْا‘‘} پر ہے جو {’’مُتَصَدِّقِيْنَ‘‘} کے ضمن میں موجود ہے۔ {’’مُتَصَدِّقِيْنَ‘‘} کو اسم فاعل کی صورت میں دوام کے اظہار کے لیے لایا گیا ہے۔ اس آیت کی تفسیر کے لیے اسی سورت کی آیت (۱۱)کی تفسیر دیکھیے۔ البتہ یہاں {’’ الْمُصَّدِّقِيْنَ ‘‘} کے لفظ میں صدقے کی کثرت اور اس پر دوام کی بات اس سے زائد ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) ➊ { وَ الَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَ رُسُلِهٖۤ اُولٰٓىِٕكَ هُمُ الصِّدِّيْقُوْنَ …:’’ الصِّدِّيْقُوْنَ‘‘} اور {’’ الشُّهَدَآءُ ‘‘} کی تفسیر کے لیے دیکھیے سورۂ نساء کی آیت (۶۹) کی تفسیر۔ اس آیت پر بھی ایک سوال ہے کہ صدیقین اور شہداء تو ایمان کے بلند درجے پر فائز لوگ ہوتے ہیں، جب کہ اس آیت میں اللہ تعالیٰ اور اس کے رسولوں پر ایمان لانے والے سب لوگوں کو صدیقین و شہداء کہا گیا ہے؟ اس کا جواب یہ ہے کہ اللہ اور اس کے تمام رسولوں پر ایمان لانے والوں سے مراد یہاں اس ایمان میں کامل لوگ ہیں۔ اس کا قرینہ یہ ہے کہ آیت ( ۷) : « اٰمِنُوْا بِاللّٰهِ وَ رَسُوْلِهٖ » میں ایمان والوں کو ایمانِ کامل لانے کا حکم ہے، یعنی اللہ اور اس کے رسولوں پر کامل ایمان رکھنے والے ہی صدیقین اور شہداء ہیں۔ {’’ اُولٰٓىِٕكَ هُمُ الصِّدِّيْقُوْنَ‘‘} میں حصر کا مفہوم ہے، مطلب یہ ہے کہ اللہ تعالیٰ کے ہاں صدیقین اور شہداء کے لیے جو درجے ہیں وہ ہر مدعی ٔ ایمان کو حاصل نہیں ہو جائیں گے، بلکہ یہ صرف ان لوگوں کے لیے خاص ہیں جو اللہ اور اس کے رسولوں پر سچا اور پکا ایمان لائیں گے۔ البتہ اس میں شک نہیں کہ کمال ایمان کے کئی مراتب ہیں، جیسا کہ صدیقیت و شہادت کے کئی مراتب ہیں، اگرچہ سب پر صدیق یا شہید کا لفظ استعمال ہوتا ہے۔ جابر بن عتیک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلشَّهَادَةُ سَبْعٌ سِوَی الْقَتْلِ فِيْ سَبِيْلِ اللّٰهٗ الْمَطْعُوْنُ شَهِيْدٌ، وَالْغَرِيْقُ شَهِيْدٌ، وَ، وَصَاحِبُ ذَاتِ الْجَنْبِ شَهِيْدٌ ، وَالْمَبْطُوْنُ شَهِيْدٌ، وَصَاحِبُ الْحَرِيْقِ شَهِيْدٌ، وَالَّذِيْ يَمُوْتُ تَحْتَ الْهَدْمِ شَهِيْدٌ، وَالْمَرْأَةُ تَمُوْتُ بِجُمْعٍ شَهِيْدَةٌ ] [مستدرک حاکم: 352/1، ح : ۱۳۰۰، وصححہ الألباني في صحیح الجامع : ۳۷۳۹ ] ’’اللہ کی راہ میں قتل ہونے کے علاوہ شہادت کی سات قسمیں ہیں، طاعون سے مرنے والا شہید ہے اور غرق ہونے والا شہید ہے اور ذات الجنب والا شہید ہے اور پیٹ کی تکلیف سے مرنے والا شہید ہے اور آگ سے مرنے والا شہید ہے اور گرنے والی دیوار وغیرہ کے نیچے آ کر مرنے والا شہید ہے اور ولادت کے وقت مرنے والی عورت شہید ہے۔‘‘ ظاہر ہے کہ حدیث میں مذکور سب لوگ شہید ہیں، مگر اللہ کی راہ میں قتل ہونے والے کا درجہ سب سے بلند ہے۔ ¤ ➋ {لَهُمْ اَجْرُهُمْ وَ نُوْرُهُمْ:} یعنی صدیقیت یا شہادت کے مراتب کے مطابق اجر اور نور اہل ایمان ہی کا حصہ ہے، کفار یا منافقین کا نہیں۔ ¤ ➌ {وَ الَّذِيْنَ كَفَرُوْا وَ كَذَّبُوْا بِاٰيٰتِنَاۤ … :} اس سے معلوم ہوا کہ جہنم میں ہمیشہ وہی لوگ رہیں گے جنھوں نے اللہ اور اس کے رسولوں کے ساتھ کفر کیا اور ان کی تکذیب کی، کیونکہ{’’ اَصْحٰبُ الْجَحِيْمِ ‘‘} (بھڑکتی آگ کے ساتھی اور اس میں رہنے والے) وہی ہیں، گناہ گار مومن جہنم میں گئے بھی تو ہمیشہ اس میں نہیں رہیں گے، اس لیے وہ {’’ اَصْحٰبُ الْجَحِيْمِ ‘‘} نہیں ہیں۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) ➊ {اِعْلَمُوْۤا:} پچھلی آیات سے اس آیت کی مناسبت یہ ہے کہ نفاق کا سبب اور اللہ کی راہ میں جہاد سے گریز اور مال خرچ کرنے سے دریغ کا باعث دنیا کی زندگی کی محبت ہے، اس لیے اللہ تعالیٰ نے دنیا کی زندگی کی حقیقت بیان فرمائی۔ ¤ ➋ { اَنَّمَا الْحَيٰوةُ الدُّنْيَا: ’’ الْحَيٰوةُ الدُّنْيَا ‘‘} سے مراد انسان کے وہ کام ہیں جو وہ اس زندگی میں صرف دنیا میں حاصل ہونے والے فوائد کے لیے کرتا ہے، ورنہ اس زندگی میں وہ آخرت کے لیے اعمال صالحہ کے ذریعے سے ہمیشہ کی سعادت بھی حاصل کر سکتا ہے، جیساکہ فرمایا: « مَنْ عَمِلَ صَالِحًا مِّنْ ذَكَرٍ اَوْ اُنْثٰى وَ هُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهٗ حَيٰوةً طَيِّبَةً وَ لَنَجْزِيَنَّهُمْ اَجْرَهُمْ بِاَحْسَنِ مَا كَانُوْا يَعْمَلُوْنَ » [ النحل : ۹۷ ] ’’ جو بھی نیک عمل کرے، مرد ہو یا عورت اور وہ مومن ہو تو یقینا ہم اسے ضرور زندگی بخشیں گے، پاکیزہ زندگی اور یقینا ہم انھیں ان کا اجر ضرور بدلے میں دیں گے، ان بہترین اعمال کے مطابق جو وہ کیا کرتے تھے۔ ‘‘ ¤ ➌ { لَعِبٌ وَّ لَهْوٌ:} اس کی وضاحت کے لیے دیکھیے سورۂ عنکبوت ( ۶۴ )کی تفسیر۔ ¤ ➍ { وَ زِيْنَةٌ وَّ تَفَاخُرٌۢ بَيْنَكُمْ وَ تَكَاثُرٌ فِي الْاَمْوَالِ وَ الْاَوْلَادِ:} یہ سچے اور مخلص اہل ایمان یعنی صدیقین و شہداء کے مقابلے میں ایمان سے محروم دنیا دار لوگوں کا حال ہے، اللہ تعالیٰ نے ان کی تمام خواہشوں اور دلچسپیوں کا ذکر ان پانچ باتوں میں فرما دیا ہے۔ شاہ عبدالقادر رحمہ اللہ لکھتے ہیں: ’’ آدمی کو اوّل عمر میں کھیل چاہیے، پھر تماشا، پھر بناؤ سنگار، پھر ساکھ بڑھانا اور نام و نمود حاصل کرنا اور جب مرنا قریب ہو تو مال اور اولاد کی فکر کرنا کہ میرے بعد میرا گھر بنا رہے اور اولاد آسودگی سے زندگی بسر کرے۔ یہ سب دھوکے کا سامان ہے، آگے کچھ اور کام آئے گا (ایمان اور عملِ صالح) یہ کچھ کام نہ آئے گا۔‘‘ (موضح بتصرف) ¤ ➎ {كَمَثَلِ غَيْثٍ اَعْجَبَ الْكُفَّارَ نَبَاتُهٗ …:’’ غَيْثٍ ‘‘} بارش، جیساکہ فرمایا: « وَ هُوَ الَّذِيْ يُنَزِّلُ الْغَيْثَ مِنْۢ بَعْدِ مَا قَنَطُوْا » [ الشورٰی : ۲۸ ] ’’ اور وہی ہے جو بارش برساتا ہے، اس کے بعد کہ وہ نا امید ہو چکے ہوتے ہیں۔‘‘ {’’ الْكُفَّارَ ‘‘} سے مراد یہاں کاشت کار ہیں، جیسا کہ دوسری جگہ فرمایا : « يُعْجِبُ الزُّرَّاعَ » [ الفتح : ۲۹ ] ’’کاشت کرنے والوں کو خوش کرتی ہے۔‘‘ کیونکہ کفر کا معنی چھپانا ہے اور کاشت کار بیج کو زمین میں چھپا دیتا ہے۔ آیت کے دوسرے الفاظ اور تمثیل کی تشریح کے لیے دیکھیے سورۂ یونس (۲۴)، زمر( ۲۱) اور سورۂ کہف( ۴۵) کی تفسیر۔ اس کے علاوہ دیکھیے سورۂ آل عمران ( 15،14) کی تفسیر۔ بعض مفسرین نے {’’ الْكُفَّارَ ‘‘} سے مراد حقیقی کافر لیے ہیں، ان کے مطابق اگرچہ بارش سے اگنے والی کھیتی مومن و کافر سبھی کو خوش کرتی ہے، مگر کفار کا ذکر خصوصاً اس لیے فرمایا کہ وہ اس پر زیادہ خوش ہوتے ہیں، کیونکہ ان کی خوشی کا تمام سرمایۂ حیات دنیا ہے۔ ¤ ➏ {وَ فِي الْاٰخِرَةِ عَذَابٌ شَدِيْدٌ وَّ مَغْفِرَةٌ مِّنَ اللّٰهِ وَ رِضْوَانٌ:} یعنی بات صرف اتنی نہیں کہ دنیا کی زندگی ختم ہو اور جان چھوٹ جائے، بلکہ اصل معاملہ اس کے بعد آخرت کا اور اس کی ہمیشہ کی زندگی کا ہے کہ وہاں دو میں سے ایک بات سے ہر حال میں واسطہ پڑنے والا ہے، ایک طرف شدید عذاب ہو گا اور دوسری طرف اللہ کی بخشش اور اس کی زبردست رضا ہوگی۔ {’’ رِضْوَانٌ ‘‘} مصدر میں مبالغے کا مفہوم ہے۔ ¤ ➐ { وَ مَا الْحَيٰوةُ الدُّنْيَاۤ اِلَّا مَتَاعُ الْغُرُوْرِ:} یعنی جس نے ساری جدوجہد دنیا کی زندگی بنانے کے لیے کی وہ دھوکے میں پڑ گیا، کیونکہ اس نے جو کچھ کمایا دنیا کی زندگی ختم ہونے کے ساتھ ختم ہو گیا اور آخرت میں اس کے لیے کچھ باقی نہ رہا۔ البتہ ایسے لوگوں کے لیے دنیا کی زندگی دھوکا نہیں جنھوں نے اسے آخرت کے حصول کا ذریعہ بنایا، کیونکہ ان کے اعمال دنیا کے فنا ہونے کے باوجود باقی رہنے والے ہیں، جیسا کہ فرمایا : « اَلْمَالُ وَ الْبَنُوْنَ زِيْنَةُ الْحَيٰوةِ الدُّنْيَا وَ الْبٰقِيٰتُ الصّٰلِحٰتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَّ خَيْرٌ اَمَلًا» [ الکھف : ۴۶ ] ’’ مال اور بیٹے دنیا کی زندگی کی زینت ہیں اور باقی رہنے والی نیکیاں تیرے رب کے ہاں ثواب میں بہتر اور امید کی رو سے زیادہ اچھی ہیں۔ ‘‘"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) ➊ {سَابِقُوْۤا اِلٰى مَغْفِرَةٍ مِّنْ رَّبِّكُمْ: ’’ سَابِقُوْۤا ‘‘ ’’سَبَقَ يَسْبِقُ سَبْقًا‘‘} (ض،ن) سے باب مفاعلہ کا امر حاضر ہے۔ اس میں مقابلے کا مفہوم پایا جاتا ہے، یعنی ایک دوسرے کے مقابلے میں ایسے اعمال کی طرف آگے بڑھو جن سے تم مغفرت اور جنت کے مستحق بن سکو۔ مثلاً میدان قتال کی پہلی صف میں ہونا، امام کے ساتھ تکبیر تحریمہ میں شامل ہونا اور اللہ کی راہ میں دوسروں سے بڑھ چڑھ کر خرچ کرنا وغیرہ۔ یہ آیت سورۂ آل عمران کی آیت (۱۳۳) سے ملتی جلتی ہے، اس کی تفسیر پر بھی نظر ڈال لیں۔ ¤ ➋ { وَ جَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَآءِ وَ الْاَرْضِ: ’’’ السَّمَآءِ ‘‘} کا لفظ یہاں بطور جنس استعمال ہوا ہے، مراد تمام آسمان ہیں۔ دلیل اس کی سورۂ آل عمران کی یہ آیت ہے : « وَ سَارِعُوْۤا اِلٰى مَغْفِرَةٍ مِّنْ رَّبِّكُمْ وَ جَنَّةٍ عَرْضُهَا السَّمٰوٰتُ وَ الْاَرْضُ » [آل عمران : ۱۳۳] ’’اور ایک دوسرے سے بڑھ کر دوڑو اپنے رب کی جانب سے بخشش کی طرف اور اس جنت کی طرف جس کی چوڑائی آسمانوں اور زمین (کے برابر)ہے۔ ‘‘ ¤ ➌ { اُعِدَّتْ لِلَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَ رُسُلِهٖ:} یہاں اتنا ہی ذکر ہے کہ جنت ایمان والوں کے لیے تیار کی گئی ہے، جبکہ سورۂ آل عمران ( ۱۳۳ تا ۱۳۵ )میں ان ایما ن والوں کے چند اعمال کا بھی ذکر ہے جن کی وجہ سے وہ اللہ کے فضل کے حق دار ٹھہرتے ہیں۔ ان میں پہلا عمل خوشی اور تکلیف میں خرچ کرنا ہے، جس کا ذکر یہاں {’’ اَنْفَقُوْا ‘‘} میں گزر چکا ہے۔ ¤ ➍ { ذٰلِكَ فَضْلُ اللّٰهِ يُؤْتِيْهِ مَنْ يَّشَآءُ …:} اس سے معلوم ہوا کہ جنت میں داخلہ محض اللہ کے فضل کے ساتھ ہوگا، کیونکہ اللہ تعالیٰ پر کسی کا کوئی حق واجب نہیں اور انسان جتنے بھی عمل کر لے وہ دنیا میں اللہ تعالیٰ کی عطا کردہ ایک نعمت کا بھی بدل نہیں ہو سکتے۔ ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرما رہے تھے: [ لَنْ يُّدْخِلَ أَحَدًا عَمَلُهُ الْجَنَّةَ، قَالُوْا وَلاَ أَنْتَ يَا رَسُوْلَ اللّٰهِ !؟ قَالَ لاَ، وَلاَ أَنَا إِلاَّ أَنْ يَّتَغَمَّدَنِيَ اللّٰهُ  بِفَضْلٍ وَ رَحْمَةٍ ] [ بخاري، المرضٰی، باب تمنی المریض الموت : ۵۶۷۳] ’’ کسی بھی شخص کو اس کا عمل جنت میں ہرگز داخل نہیں کرے گا۔ ‘‘ لوگوں نے کہا : ’’یا رسول اللہ! آپ کو بھی نہیں؟‘‘ فرمایا : ’’نہیں، مجھے بھی نہیں، الا یہ کہ اللہ مجھے فضل اور رحمت سے ڈھانپ لے۔‘‘ البتہ اعمال صالحہ اللہ تعالیٰ کے فضل و رحمت کے حصول کا سبب بنتے ہیں، دیکھیے سورۂ اعراف(۴۳) کی تفسیر۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) ➊ {مَاۤ اَصَابَ مِنْ مُّصِيْبَةٍ …:’’ اَصَابَ ‘‘} کا مفعول بہ محذوف ہے : {’’ أَيْ مَا أَصَابَكُمْ أَوْ مَا أَصَابَ أَحَدًا مِنْ مُّصِيْبَةٍ …‘‘} ’’یعنی تمھیں یا کسی کو جو بھی مصیبت پہنچتی ہے خواہ زمین میں ہو یا تمھاری جانوں میں …۔‘‘ سورت کی ابتدا سے جہاد میں مال و جان خرچ کرنے کی تاکید آرہی ہے، چونکہ اس راہ میں کئی طرح کی جسمانی و ذہنی اور مالی و جانی مصیبتیں پیش آتی ہیں، مثلاً بھوک، پیاس، فقر، خوف، غم، تھکاوٹ، بیماری، زخم، چوٹ، گرفتاری اور قتل وغیرہ، اس لیے آدمی جہاد پر جانے سے گریز کرتا ہے اور اپنے آپ کو ان مصیبتوں سے بچانے کی کوشش کرتا ہے اور اگر جہاد کے لیے چلا جائے تو ان مصائب کے پیش آنے پر پریشان ہوتا ہے۔ اللہ تعالیٰ نے فرمایا کہ جو مالی یا جانی مصیبت تمھیں پیش آنی ہے وہ ہر حال میں آکر رہے گی، تم اس سے بچنے کی جتنی بھی کوشش کر لو اس سے بھاگ نہیں سکتے۔ ہر آنے والی مصیبت یا راحت اللہ تعالیٰ نے اس کے پیدا کرنے اور تمھاری جانوں کو پیدا کرنے، بلکہ زمین کو پیدا کرنے سے بھی پہلے ایک کتاب میں لکھ دی ہے، کسی کی طاقت نہیں کہ اس لکھے ہوئے کو مٹا دے یا بدل دے۔مزید دیکھیے سورۂ قمر (۴۹) اور سورۂ توبہ (۵۱) کی تفسیر۔ ¤ ➋ {فِي الْاَرْضِ:} اس سے زمین پر آنے والی عام مصیبتیں مراد ہیں، مثلاً قحط، طوفان، سیلاب، زلزلے اور وبائیں وغیرہ، جن سے انسان متاثر ہوتا ہے۔ ¤ ➌ {وَ لَا فِيْۤ اَنْفُسِكُمْ:} اس سے وہ مصیبتیں مراد ہیں جو انسان کی ذات پر آتی ہیں، مثلاً بیماری، زخم، بھوک، پیاس، گرفتاری، فقر، خوف، غم، پیاروں کی موت اور اپنی موت وغیرہ۔ {’’ وَ لَا فِيْۤ اَنْفُسِكُمْ ‘‘} میں {’’ لَا ‘‘} کو دوبارہ ان مصیبتوں کی اہمیت کی وجہ سے ذکر فرمایا، کیونکہ آدمی اپنی جان پر آنے والی مصیبتوں سے زیادہ متاثر ہوتا ہے، دوسروں پر آنے والی مصیبتوں سے وہ ذہنی طور پر متاثر ہوتا ہے، حسی طور پر نہیں۔ ¤ ➍ { مِنْ قَبْلِ اَنْ نَّبْرَاَهَا: ’’ بَرَأَ يَبْرَأُ بَرْأً وَ بُرُوْأً ‘‘} (ف) پیدا کرنا۔ {’’ هَا ‘‘} ضمیر {’’ مُصِيْبَةٍ ‘‘} کی طرف بھی جا سکتی ہے، {’’ الْاَرْضِ ‘‘} کی طرف بھی اور {’’ اَنْفُسِكُمْ ‘‘} کی طرف بھی۔ یہ کلام الٰہی کی بلاغت ہے کہ تینوں مراد ہیں کہ اللہ تعالیٰ نے ہر مصیبت کو اس مصیبت کے پیدا کرنے سے پہلے، انسان کے پیدا کرنے سے پہلے اور زمین کے پیدا کرنے سے بھی پہلے لکھ دیا ہے۔ ¤ ➎ { اِنَّ ذٰلِكَ عَلَى اللّٰهِ يَسِيْرٌ:} یعنی انسان کو چونکہ آئندہ کا کچھ علم نہیں، اس لیے اس کے لیے یہ بات ناممکن ہے کہ وہ آئندہ کی بات پہلے لکھ دے، مگر اللہ تعالیٰ کے لیے یہ بالکل ہی معمولی بات ہے، کیونکہ وہ گزشتہ اور موجودہ کی طرح آئندہ کی ہر بات کو بھی جانتا ہے۔ مزید دیکھیے سورۂ قمر (۴۹) کی تفسیر۔"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) ➊ { لِكَيْلَا تَاْسَوْا عَلٰى مَا فَاتَكُمْ …: ’’لَا تَأْسَوْا‘‘ ’’أَسِيَ يَأْسٰي أَسًي‘‘} ({خَشِيَ يَخْشٰي}) (غمگین ہونا) سے نفی مضارع معلوم ہے، جیسا کہ اللہ تعالیٰ نے موسیٰ علیہ السلام سے فرمایا : «فَلَا تَاْسَ عَلَى الْقَوْمِ الْفٰسِقِيْنَ » [ المائدۃ : ۲۶ ] ’’پس تو ان نافرمان لوگوں پر غم نہ کر۔‘‘ اور شعیب علیہ السلام نے اپنی قوم کے ہلاک ہونے پر فرمایا : « فَكَيْفَ اٰسٰى عَلٰى قَوْمٍ كٰفِرِيْنَ» [ الأعراف : ۹۳ ] ’’تو میں نہ ماننے والے لوگوں پر کیسے غم کروں۔‘‘ {’’ اٰتٰىكُمْ ‘‘ ’’أَتٰي يَأْتِيْ إِتْيَانًا‘‘}  (ض) آنا اور {’’آتٰي يُؤْتِيْ إِيْتَاءً‘‘} (افعال) دینا۔ یعنی ہم نے تمھیں یہ بات بتا دی ہے، تاکہ جو چیز تمھارے ہاتھ سے نکل جائے، خواہ ملنے کے بعد چلی جائے یا مل ہی نہ سکے، اس پر تم غم نہ کرو اور اللہ تعالیٰ تمھیں جو کچھ دے اس پر پھول نہ جاؤ، کیونکہ جب تم جان لو گے کہ ہر چیز اللہ کی تقدیر میں لکھی ہوئی ہے تو ہاتھ سے نکلنے والی چیز پر تم زیادہ غمگین نہیں ہوگے اور ملنے والی چیز پر اتراؤ گے نہیں، کیونکہ جسے معلوم ہو کہ جانے والی چیز نے جانا ہی تھا تو وہ اس کے جانے پر زیادہ جزع فزع نہیں کرتا، اس لیے کہ وہ ہر وقت اپنے آپ کو اس کے لیے تیار رکھتا ہے۔ اسی طرح جب اسے معلوم ہو کہ جو فائدہ اسے حاصل ہونا ہے وہ ہونا ہی ہونا ہے، ممکن ہی نہیں کہ حاصل نہ ہو تو وہ اس کے حاصل ہونے پر اترائے گا نہیں، کیونکہ وہ جانتا ہے کہ یہ میری بہادری سے حاصل نہیں ہوا۔ نتیجہ یہ ہوگا کہ آدمی اللہ کی تقدیر سمجھ کر نقصان پر صبر کرے گا اور فائدے پر اپنی خوبی سمجھنے کے بجائے اللہ کا شکر کرے گا۔ ¤ ➋ اس آیت کا مطلب یہ نہیں کہ کسی چیز کے حاصل کرنے کے لیے آدمی کو کوشش بھی نہیں کرنی چاہیے، بلکہ مطلب یہ ہے کہ کوشش کے بعد اگر ناکامی ہو تو غم نہیں بلکہ صبر کرنا چاہیے اور کامیابی کی صورت میں فخر و غرور نہیں بلکہ شکر بجا لانا چاہیے۔ اللہ تعالیٰ نے اسی کو تقدیر پر ایمان کا فائدہ قرار دیا ہے اور اسی عقیدہ پر کاربند رہ کر زندگی میں اعتدال رہتا ہے اور آدمی افراط و تفریط سے محفوظ رہتا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اََلْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَ أَحَبُّ إِلَی اللّٰهِ مِنَ الْمُؤْمِنِ الضَّعِيْفِ وَ فِيْ كُلٍّ خَيْرٌ، احْرِصْ عَلٰی مَا يَنْفَعُكَ وَاسْتَعِنْ بِاللّٰهِ وَلَا تَعْجَزْ وَ إِنْ أَصَابَكَ شَيْءٌ فَلاَ تَقُلْ لَوْ أَنِّيْ فَعَلْتُ كَانَ كَذَا وَكَذَا وَلٰكِنْ قُلْ قَدَرُ اللّٰهِ وَمَا شَاءَ فَعَلَ فَإِنَّ لَوْ تَفْتَحُ عَمَلَ الشَّيْطَانِ ] [ ] [مسلم، القدر، باب في الأمر بالقوۃ وترک العجز … : ۲۶۶۴، عن أبي ھریرۃ رضی اللہ عنہ ] ’’طاقتور مومن کمزور مومن سے بہتر اور اللہ تعالیٰ کو زیادہ محبوب ہے اور ہر ایک میں بھلائی موجود ہے۔ جو چیز تجھے نفع دے اس کی حرص کر اور اللہ سے مدد مانگ اور عاجز نہ ہو اور اگر تجھے کوئی (نقصان دہ) چیز پہنچے تو یہ مت کہہ کہ اگر میں اس طرح کرتا تو اس طرح اور اس طرح ہو جاتا، بلکہ یوں کہہ کہ اللہ نے قسمت میں (اسی طرح) لکھا تھا اور جو اس نے چاہا کر دیا، کیونکہ {’’لَوْ‘‘} (اگر) کا لفظ شیطان کا کام کھول دیتا ہے۔‘‘ ¤ ➌ یہاں ایک سوال ہے کہ مصیبت پر غم اور راحت پر خوشی انسانی فطرت ہے، پھر ہاتھ سے نکلنے والی چیز پر غم سے اور عطا ہونے والی چیز پر خوش ہونے سے کیوں منع فرمایا، جب کہ ان پر ہمارا اختیار ہی نہیں؟ جواب اس کا یہ ہے کہ منع اس غم سے کیا گیا ہے جو اس حد تک پہنچ جائے کہ آدمی جزع فزع اور اللہ تعالیٰ کا شکوہ کرنے لگے۔ اگر اللہ کی رضا پر راضی رہے تو غم پر کوئی مؤاخذہ نہیں، بلکہ اس پر صبر کا اجر بھی ملتا ہے۔ اگر غم ہی نہ ہو تو صبر کس بات پر ہوگا؟ جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : [ إِنَّ الْعَيْنَ تَدْمَعُ وَالْقَلْبَ يَحْزَنُ، وَلاَ نَقُوْلُ إِلاَّ مَا يَرْضٰی رَبُّنَا وَ إِنَّا بِفِرَاقِكَ يَا إِبْرَاهِيْمُ! لَمَحْزُوْنُوْنَ ] [ بخاري، الجنائز، باب قول النبي صلی اللہ علیہ وسلم : ’’ إنا بک لمحزونون ‘‘ : ۱۳۰۳ ] ’’آنکھ آنسو بہاتی ہے اور دل غمگین ہوتا ہے اور ہم اس کے سوا جو ہمارا رب پسند فرمائے کچھ نہیں کہتے اور یقینا تیری جدائی سے اے ابراہیم! ہم غمزدہ ہیں۔‘‘ اسی طرح منع اس خوش ہونے سے کیا گیا ہے جو آدمی کو شکر کے بجائے فخر و غرور تک پہنچا دے۔ دلیل اس کی آیت کے آخری الفاظ {’’ وَ اللّٰهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُوْرٍ ‘‘} ہیں۔ ہر خوشی سے منع نہیں کیا گیا، کیونکہ اگر خوشی ہی نہ ہو تو شکر کس بات پر کرے گا؟ ¤ ➍ {وَ اللّٰهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُوْرٍ: ’’ مُخْتَالٍ ‘‘} ’’خ ی ل‘‘ سے باب افتعال کا اسم فاعل ہے، جو اپنے خیال میں بڑا بننے والا ہو، متکبر۔ {’’ فَخُوْرٍ ‘‘ ’’ فَخْرٌ ‘‘} میں سے مبالغے کا صیغہ ہے، جو دوسروں کے سامنے بہت فخر کرنے والا ہو۔ تقدیر کو مد نظر نہ رکھنے کا نتیجہ ہر کامیابی کو اپنی بہادری اور کارکردگی سمجھنا ہے، جس سے آدمی میں تکبر اور فخر پیدا ہوتا ہے، حالانکہ اگر آدمی کی اپنی کارکردگی بھی ہو تو وہ، بلکہ اس کا اپنا وجود سب اللہ تعالیٰ کی عطا ہے اور اس نے یہ سب کچھ پہلے لکھ دیا ہے، پھر جو شخص اس پر شکر کے بجائے تکبر و فخر کرتا ہے اس سے اللہ تعالیٰ محبت کیسے کر سکتا ہے ؟ ¤ ➎ بعض اہلِ علم نے فرمایا کہ اس سے پہلے اللہ تعالیٰ نے دو چیزیں بیان فرمائی ہیں، ایک {’’ اِعْلَمُوْۤا اَنَّمَا الْحَيٰوةُ الدُّنْيَا لَعِبٌ وَّ لَهْوٌ … ‘‘} اور دوسری {’’ مَاۤ اَصَابَ مِنْ مُّصِيْبَةٍ فِي الْاَرْضِ وَ لَا فِيْۤ اَنْفُسِكُمْ … ‘‘} پھر فرمایا : « لِكَيْلَا تَاْسَوْا عَلٰى مَا فَاتَكُمْ وَ لَا تَفْرَحُوْاا بِمَاۤ اٰتٰىكُمْ » مطلب یہ ہے کہ ہم نے تمھیں دنیا کی زندگی اور اس کی زیب و زینت کا فانی ہونا مثال دے کر اس لیے سمجھایا ہے کہ اللہ تعالیٰ تمھیں جو کچھ دے اس پر پھول نہ جاؤ، بلکہ یاد رکھو کہ یہ عارضی اور فانی ہے اور ہم نے یہ بات کہ ہر مصیبت پہلے سے لکھی ہوئی ہے، اس لیے بتائی ہے کہ تم اس کے آنے پر زیادہ غم نہ کرو۔ گویا یہ لف نشر غیر مرتب ہے۔ یہ تفسیر بھی پر لطف ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) ➊ {الَّذِيْنَ يَبْخَلُوْنَ وَ يَاْمُرُوْنَ النَّاسَ بِالْبُخْلِ:} مراد اس سے منافقین ہیں جو کلمہ پڑھ کر مسلمان ہو چکے تھے، مگر جب جہاد کا موقع آتا تو جنگ میں شرکت سے گریز کرتے اور خرچ کرنے سے بخل کرتے، بلکہ اپنے ہم نواؤں کو بھی خرچ کرنے سے منع کرتے تھے، جیسا کہ دوسری جگہ فرمایا : « هُمُ الَّذِيْنَ يَقُوْلُوْنَ لَا تُنْفِقُوْا عَلٰى مَنْ عِنْدَ رَسُوْلِ اللّٰهِ حَتّٰى يَنْفَضُّوْا وَ لِلّٰهِ خَزَآىِٕنُ السَّمٰوٰتِ وَ الْاَرْضِ وَ لٰكِنَّ الْمُنٰفِقِيْنَ لَا يَفْقَهُوْنَ » [ المنافقون : ۷ ] ’’یہ وہی ہیں جو کہتے ہیں کہ ان لوگوں پر خرچ نہ کرو جو اللہ کے رسول کے پاس ہیں ، یہاں تک کہ وہ منتشر ہو جائیں، حالانکہ آسمانوں کے اور زمین کے خزانے اللہ ہی کے ہیں اور لیکن منافق نہیں سمجھتے ۔‘‘ ¤ ➋ {وَ مَنْ يَّتَوَلَّ فَاِنَّ اللّٰهَ هُوَ الْغَنِيُّ الْحَمِيْدُ:} ضمیر فصل {’’ هُوَ ‘‘} لانے سے اور خبر {’’ الْغَنِيُّ الْحَمِيْدُ ‘‘} پر الف لام لانے سے حصر پیدا ہو رہا ہے کہ اللہ ہی غنی و حمید ہے، کوئی اور نہیں۔ یعنی جو شخص اتنی نصیحت سن کر بھی جہاد میں خرچ کرنے سے منہ موڑے اور سمجھے کہ اس کے خرچ نہ کرنے سے اسلام اور مسلمانوں کا کوئی نقصان ہو جائے گا تو اس کا یہ خیال باطل ہے، کیونکہ آسمان و زمین کے تمام خزانوں کا مالک تو صرف اللہ تعالیٰ ہے (جیسا کہ پچھلے فائدے میں گزرا) اور غنی وہ اکیلا ہی ہے، دوسرے سب اس کے محتاج ہیں، جو کوئی بھی خرچ کرتا ہے اس کے دیے میں سے خرچ کرتا ہے اور اپنے فائدے کے لیے خرچ کرتا ہے، اللہ تعالیٰ اس کے خرچ کرنے سے بے نیاز ہے۔ غنی کے ساتھ حمید کی صفت بیان فرمائی، کیونکہ بہت سے اغنیاء عارضی غنی کے مالک ہونے کے باوجود اپنی غنی کو مذموم کاموں میں استعمال کرتے ہیں مگر اللہ ایسا غنی ہے کہ وہ ہر مذموم صفت اور فعل سے پاک ہے اور تمام کمالات اور خوبیوں کا مالک ہے۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) ➊ {لَقَدْ اَرْسَلْنَا رُسُلَنَا بِالْبَيِّنٰتِ …:} اوپر کی آیات میں جس خرچ کی تاکید کی گئی ہے اس کا تعلق جہاد سے ہے۔ کفار اور اہلِ کتاب کو جب بدر اور دوسرے مقامات پر شکستوں پر شکستیں ہوئیں تو انھوں نے پروپیگنڈا شروع کر دیا جو آج تک جاری ہے کہ محمد( صلی اللہ علیہ وسلم ) اللہ کے رسول اور اسلام اللہ کا دین کیسے ہو سکتے ہیں؟ ان کے نزدیک تو سب سے بڑی نیکی جنگ اور خون ریزی ہے، بھلا اللہ کے رسولوں اور اس کے نیک بندوں کا خون ریزی سے کیا تعلق؟ وہ تو امن و سلامتی والے ہوتے ہیں اور دنیا کے دھندوں سے الگ تھلگ رہبانیت کی زندگی بسر کرتے ہیں۔ یہاں اللہ تعالیٰ نے اس کے جواب میں تین باتیں واضح فرمائیں، ایک یہ کہ اللہ تعالیٰ نے جتنے رسول بھیجے انھیں واضح دلائل دے کر بھیجا اور ان کے ساتھ کتاب اور میزان نازل فرمائی، تاکہ لوگ راہِ راست پر چل سکیں اور باہمی معاملات میں عدل و انصاف پر قائم رہیں۔ دوسری یہ کہ عدل و انصاف کا تقاضا ہے کہ ظلم و جور کا خاتمہ کیا جائے، جو قوت و سلطنت کے بغیر ممکن نہیں۔ اس مقصد کے لیے اللہ تعالیٰ نے کتاب و میزان کے ساتھ لوہا اتارا، جس میں دوسرے بے شمار فائدوں کے ساتھ یہ فائدہ بھی ہے کہ اس کے ذریعے سے جہاد ہوتا ہے، جس کے ساتھ عدل و انصاف قائم ہوتا ہے اور ایمان والوں کا امتحان ہوتا ہے کہ اللہ کے دین کی مدد کرنے والے مومن کون ہیں اور اس سے جان چھڑانے والے منافق کون ہیں۔ تیسری بات یہ فرمائی کہ نوح اور ابراہیم علیھما السلام اور ان کی اولاد میں جتنے رسول آئے سب کا مقصد حق اور عدل کا قیام ہی تھا۔ عیسیٰ علیہ السلام بھی انھی کے طریقے پر تھے، یہود کی سنگ دلی کے مقابلے میں ان کے پیروکاروں کے دلوں میں اللہ تعالیٰ نے خاص طور پر رافت و رحمت رکھی تھی۔ اس نرمی کا بہانہ بنا کر ان کے بعض نام لیواؤں نے رہبانیت اختیار کی اور جہاد چھوڑ دیا، حالانکہ یہ ان کی اپنی ایجاد کردہ بدعت تھی، اللہ کا حکم ہرگز نہ تھا۔ مسلمانوں میں ترکِ جہاد کا باعث بھی نصرانیوں کی تقلید میں یہی رہبانیت بنی۔ ¤ ➋ { وَ اَنْزَلْنَا مَعَهُمُ الْكِتٰبَ وَ الْمِيْزَانَ …:} اس کی تفسیر کے لیے دیکھیے سورۂ شوریٰ کی آیت (۱۷) کی تفسیر۔ ¤ ➌ { وَ اَنْزَلْنَا الْحَدِيْدَ:} لوہا اگرچہ زمین سے نکلتا ہے مگر اس نعمت کی عظمت کا احساس دلانے کے لیے{’’ اَنْزَلْنَا ‘‘} کا لفظ استعمال فرمایا ہے، جیسا کہ چوپاؤں کے متعلق فرمایا : « وَ اَنْزَلَ لَكُمْ مِّنَ الْاَنْعَامِ ثَمٰنِيَةَ اَزْوَاجٍ» [ الزمر : ۶ ] ’’اور اس نے تمھارے لیے چوپاؤں میں سے آٹھ قسمیں (نر و مادہ) اتاریں۔‘‘ اس میں اس حقیقت کی طرف بھی اشارہ ہے کہ ہر نعمت کا اصل سرچشمہ آسمان ہی ہے، جہاں سے اللہ کا حکم صادر ہوتا ہے تو ہر چیز وجود میں آتی ہے اور اس تعلیم کی طرف بھی اشارہ ہے جو اللہ تعالیٰ بندوں کے دلوں میں لوہے کو حاصل کرنے اور اس کے استعمال کے طریقوں کا القا فرماتا ہے۔ ¤ ➍ { فِيْهِ بَاْسٌ شَدِيْدٌ وَّ مَنَافِعُ لِلنَّاسِ:} اس میں یہ بات قابل توجہ ہے کہ لوہے کے دوسرے ’’منافع‘‘ کو بعد میں ذکر فرمایا ہے اور سخت لڑائی کا ذکر پہلے فرمایا ہے۔ اس سے جہاد اور اسلحہ کی اہمیت کا اندازہ ہوتا ہے۔ منافع سے مراد وہ بے شمار مشینیں، آلات اور سواریاں ہیں جو ایجاد ہو چکی ہیں اور آئندہ ہوں گی۔ ¤ ➎ { وَ لِيَعْلَمَ اللّٰهُ مَنْ يَّنْصُرُهٗ وَ رُسُلَهٗ بِالْغَيْبِ:} جہاد کی حکمتوں میں سے ایک حکمت یہ ہے کہ اللہ تعالیٰ چاہے تو ایک لمحے میں کفار کو نیست و نابود کر سکتا ہے، مگر وہ جہاد کے ذریعے سے اپنے بندوں کا امتحان کرتا ہے کہ اسے دیکھے بغیر کون اس کی خاطر لڑتا اور اس کے دین کی مدد کرتا ہے اور کون پیچھے رہتا ہے۔ {’’ وَ لِيَعْلَمَ اللّٰهُ ‘‘} کے لیے دیکھیے سورۂ آل عمران (۱۴۰ تا ۱۴۲) اور سورۂ عنکبوت (۳) کی تفسیر۔ ¤ ➏ {اِنَّ اللّٰهَ قَوِيٌّ عَزِيْزٌ:} یعنی اللہ تعالیٰ نے بندوں کو جہاد کا حکم اپنی کسی کمزوری کی وجہ سے نہیں دیا، بلکہ انھی کے فائدے کے لیے اور امتحان کے لیے دیا ہے، کیونکہ وہ تو بڑی قوت والا اور سب پر غالب ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) ➊ {وَ لَقَدْ اَرْسَلْنَا نُوْحًا وَّ اِبْرٰهِيْمَ …:} اس آیت میں پہلے نوح اور ابراہیم علیھما السلام کی بہت بڑی فضیلت بیان ہوئی ہے کہ دوسرے تمام انبیاء علیھم السلام انھی کی اولاد سے تھے، اس کے بعد اس میں بینات اور کتاب و میزان لے کر آنے والے تمام انبیاء کا ذکر ہے اور یہ کہ ان کی امتوں نے اپنے رسولوں کے ساتھ کیا سلوک کیا اور ان میں بگاڑ کا باعث کیا تھا۔ ¤ ➋ {فَمِنْهُمْ مُّهْتَدٍ وَ كَثِيْرٌ مِّنْهُمْ فٰسِقُوْنَ: ’’مِنْ‘‘} تبعیض کے لیے ہے، یعنی ان میں سے بعض راہِ راست پر چلنے والے ہیں اور ان کے زیادہ لوگ نافرمان ہیں۔ یعنی ان کے بگاڑ کا اصل باعث یہ تھا کہ وہ اپنی خواہش کے خلاف کسی کا حکم ماننے کے لیے تیار نہیں تھے۔ ایمان اور عمل صالح والے لوگ کم اور نافرمان لوگ ہمیشہ زیادہ رہے ہیں۔ مزید دیکھیے سورۂ ص (۲۴) کی تفسیر۔"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) ➊ { ثُمَّ قَفَّيْنَا عَلٰۤى اٰثَارِهِمْ بِرُسُلِنَا: ’’ قَفَّيْنَا ‘‘ ’’ قَفًا‘‘} سے مشتق ہے، جس کا معنی گدی (گردن کا پچھلا حصہ) ہے۔ {’’ اٰثَارِ‘‘ ’’أَثَرٌ‘‘} کی جمع ہے، نشانِ قدم۔ مراد یہ ہے کہ پہلے رسولوں کے بعد دوسرے رسول اس طرح بھیجے جس طرح ایک کی گردن کے پیچھے دوسرا اس کے نشانِ قدم پر چلتا ہوا آرہا ہو۔ سب کی تعلیم ایک تھی اور سب ایک ہی راستے کے مسافر تھے۔ ¤ ➋ { وَ قَفَّيْنَا بِعِيْسَى ابْنِ مَرْيَمَ وَ اٰتَيْنٰهُ الْاِنْجِيْلَ:} عیسیٰ علیہ السلام کا الگ خاص طور پر ذکر فرمایا، کیونکہ نبی کریم صلی اللہ علیہ وسلم سے پہلے سب سے آخر میں وہی تشریف لائے۔ اللہ تعالیٰ نے انھیں انجیل عطا فرمائی، جس میں تورات پر عمل کی تاکید تھی اور اس کے بعض سخت احکام میں نرمی کا اعلان تھا، جیسا کہ فرمایا : « وَ لِاُحِلَّ لَكُمْ بَعْضَ الَّذِيْ حُرِّمَ عَلَيْكُمْ » [ آل عمران : ۵۰ ] ’’اور تاکہ میں تمھارے لیے بعض وہ چیزیں حلال کر دوں جو تم پر حرام کی گئی تھیں۔‘‘ البتہ وہ بھی اسی راستے پر چلنے والے تھے جس پر پہلے رسول چلتے تھے، جس میں جہاد کی تعلیم بھی تھی۔ ¤ ➌{ وَ جَعَلْنَا فِيْ قُلُوْبِ الَّذِيْنَ اتَّبَعُوْهُ رَاْفَةً وَّ رَحْمَةً: ’’ رَاْفَةً ‘‘} وہ رحمت جو کسی سے تکلیف یا نقصان دور کرنے سے تعلق رکھتی ہو، جیسا کہ فرمایا : « وَ لَا تَاْخُذْكُمْ بِهِمَا رَاْفَةٌ فِيْ دِيْنِ اللّٰهِ اِنْ كُنْتُمْ تُؤْمِنُوْنَ بِاللّٰهِ  وَ الْيَوْمِ الْاٰخِرِ » [ النور : ۲ ] ’’اور تمھیں ان کے متعلق اللہ کے دین میں کوئی نرمی نہ پکڑے، اگر تم اللہ اور یوم آخرت پر ایمان رکھتے ہو۔‘‘ جبکہ {’’ رَحْمَةً ‘‘} کا لفظ عام ہے، جس میں ہر طرح کا رحم شامل ہے، خصوصاً جس میں نفع پہنچانے کا مفہوم پایا جاتا ہے۔ دیکھیے سورۂ حج کی آیت (۶۵) : « اِنَّ اللّٰهَ بِالنَّاسِ لَرَءُوْفٌ رَّحِيْمٌ» کی تفسیر۔ عیسیٰ علیہ السلام کی پیروی کرنے والوں کے دلوں میں رافت و رحمت رکھنے کا مطلب یہ ہے کہ اللہ تعالیٰ نے عیسیٰ علیہ السلام کو جو کتاب انجیل عطا فرمائی تھی وہ بنیادی طور پر احکام کی نہیں بلکہ وعظ و تذکیر کی کتاب تھی، جس میں انھیں خاص طور پر نرمی اور رحم کے اخلاق اختیار کرنے پر زور دیا گیا تھا۔ چنانچہ انھوں نے اس پر عمل کیا، پھر عیسیٰ علیہ السلام کی سیرت پر عمل نے ان میں یہ صفت مزید پختہ کردی، چونکہ یہ سب کچھ اللہ تعالیٰ کی عنایت اور اس کے فضل سے ہوا، اس لیے فرمایا کہ ہم نے اس کی پیروی کرنے والوں کے دلوں میں رافت و رحمت رکھ دی۔ ¤ انجیل میں رافت و رحمت پر زور دینے کی وجہ یہ تھی کہ عیسیٰ علیہ السلام کو بنی اسرائیل کے نفوس کی اصلاح کے لیے اور ان کے دلوں سے اس سختی کو دور کرنے کے لیے مبعوث کیا گیا تھا جو طویل مدتیں گزرنے کی وجہ سے ان کے دلوں میں پیدا ہو چکی تھی، جیسا کہ فرمایا : « ثُمَّ قَسَتْ قُلُوْبُكُمْ مِّنْۢ بَعْدِ ذٰلِكَ فَهِيَ كَالْحِجَارَةِ اَوْ اَشَدُّ قَسْوَةً » [ البقرۃ : ۷۴ ] ’’پھر اس کے بعد تمھارے دل سخت ہوگئے تو وہ پتھروں جیسے ہیں، یا سختی میں (ان سے بھی) بڑھ کر ہیں۔‘‘ عیسیٰ علیہ السلام کے اصحاب یہود کے برعکس آپس میں نہایت نرم اور مہربان تھے، ہمارے رسول صلی اللہ علیہ وسلم کے اصحاب میں بھی یہ وصف بہت نمایاں تھا، جیسا کہ فرمایا : «وَ الَّذِيْنَ مَعَهٗۤ اَشِدَّآءُ عَلَى الْكُفَّارِ رُحَمَآءُ بَيْنَهُمْ » [ الفتح : ۲۹ ] ’’ اور وہ لوگ جو اس کے ساتھ ہیں کافروں پر بہت سخت ہیں، آپس میں نہایت رحم دل ہیں۔‘‘ ¤ ➍ { وَ رَهْبَانِيَّةً ابْتَدَعُوْهَا:’’رَهَبَ يَرْهَبُ رَهْبًا ‘‘} (ف) ڈرنا۔ {’’رَاهِبٌ‘‘} ڈرنے والا۔ {’’ رَهْبَانٌ ‘‘} (بروزن {فَعْلاَنٌ}) بہت ڈرنے والا۔ {’’ رَهْبَانِيَّةَ ‘‘} اس {’’رَهْبَانٌ‘‘} کی طرف نسبت ہے، یعنی رہبان کا طریقہ اختیار کرنا، جو شدت خوف سے شادی نہیں کرتا کہ بیوی بچے اس کی عبادت میں رکاوٹ نہ بنیں، لوگوں سے علیحدگی اختیار کرتا ہے کہ اسے عبادت سے غافل نہ کریں۔ کھانے پینے کی لذیذ اشیاء سے اجتناب کرتا ہے کہ دنیا کی حرص اور نفس کی خواہشوں سے بچ سکے، اس لیے وہ آبادی سے الگ جنگل بیابان میں کٹیا بنا کر عبادت میں مصروف ہو جاتا ہے۔ یہ طریقہ انبیاء کا طریقہ نہیں، نہ انھوں نے اس کی تعلیم دی ہے اور نہ ہی اللہ تعالیٰ نے اس کا حکم دیا ہے۔ ان کا طریقہ تو اللہ کی توحید اور اس کے دین کی طرف دعوت دینا اور لوہے کے استعمال کے ساتھ اس کی راہ میں رکاوٹ بننے والوں کا قلع قمع کرنا ہے۔ سو جن لوگوں نے ترکِ دنیا کا راستہ اختیار کر کے دعوت و جہاد کا کام چھوڑ دیا، یہ طریقہ ان کی اپنی ایجاد تھی، اللہ تعالیٰ نے انھیں ایسا کرنے کا حکم نہیں دیا تھا۔ سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں : [ لَمَّا كَانَ مِنْ أَمْرِ عُثْمَانَ بْنِ مَظْعُوْنٍ الَّذِيْ كَانَ مِنْ تَرْكِ النِّسَاءِ بَعَثَ إِلَيْهِ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا عُثْمَانُ! إِنِّيْ لَمْ أُوْمَرْ بِالرَّهْبَانِيَّةِ أَرَغِبْتَ عَنْ سُنَّتِيْ ؟ قَالَ لاَ يَا رَسُوْللَ اللّٰهِ! قَالَ إِنَّ مِنْ سُنَّتِيْ أَنْ أُصَلِّيَ وَأَنَامَ، وَأَصُوْمَ وَأَطْعَمَ، وَ أَنْكِحَ وَ أُطَلِّقَ، فَمَنْ رَغِبَ عَنْ سُنَّتِيْ فَلَيْسَ مِنِّيْ ] [ سنن دارمي : 179/2، ح : ۲۱۶۹، قال المحقق حسین سلیم أسد الداراني إسنادہ صحیح و الحدیث متفق علیہ ] ’’جب عثمان بن مظعون رضی اللہ عنہ کے عورتوں کو ترک کرنے والا معاملہ ہوا تو رسول اللہ صلی اللہ علیہ وسلم نے ان کی طرف پیغام بھیجا اور فرمایا : ’’اے عثمان! مجھے رہبانیت کا حکم نہیں دیا گیا، کیا تم نے میرے طریقے سے بے رغبتی اختیار کر لی ہے؟‘‘ انھوں نے کہا : ’’نہیں یا رسول اللہ!‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’میرے طریقے میں سے یہ ہے کہ میں نماز پڑھتا ہوں اور سوتا (بھی) ہوں اور روزہ رکھتا ہوں اور کھاتا (بھی) ہوں اور میں نکاح بھی کرتاہوں، طلاق بھی دیتا ہوں تو جو شخص میرے طریقے سے بے رغبتی کرے وہ مجھ سے نہیں۔‘‘ ¤ انس بن مالک رضی اللہ عنہ کہتے ہیں کہ تین آدمی رسول اللہ صلی اللہ علیہ وسلم کی بیویوں کے گھروں کی طرف آئے، وہ نبی صلی اللہ علیہ وسلم کی عبادت کے متعلق پوچھ رہے تھے۔ جب انھیں (اس کے بارے) بتایا گیا تو گویا انھوں نے اسے کم سمجھا اور کہنے لگے : ’’کہاں ہم اور کہاں نبی صلی اللہ علیہ وسلم ! اللہ تعالیٰ نے آپ کے تو پہلے پچھلے سب گناہ معاف فرما دیے ہیں۔‘‘ تو ان میں سے ایک نے کہا : ’’میں تو ہمیشہ رات بھر نماز پڑھا کروں گا۔‘‘ دوسرے نے کہا : ’’میں ہمیشہ روزہ رکھوں گا، کبھی روزے کے بغیر نہیں رہوں گا۔‘‘ تیسرے نے کہا : ’’میں عورتوں سے الگ رہوں گا، کبھی نکاح نہیں کروں گا۔‘‘ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو آپ نے فرمایا : [ أَنْتُمُ الَّذِيْنَ قُلْتُمْ كَذَا وَ كَذَا ؟ أَمَا وَاللّٰهِ ! إِنِّيْ لَأَخْشَاكُمْ لِلّٰهِ وَأَتْقَاكُمْ لَهُ، لٰكِكِنِّيْ أَصُوْمُ وَ أُفْطِرُ، وَ أُصَلِّيْ وَ أَرْقُدُ وَأَتَزَوَّجُ النِّسَاءَ، فَمَنْ رَغِبَ عَنْ سُنَّتِيْ فَلَيْسَ مِنِّيْ ] [ بخاري، النکاح، باب الترغیب في النکاح … : ۵۰۶۳ ] ’’تمھی لوگوں نے یہ یہ باتیں کہی ہیں؟ سن لو! اللہ کی قسم! میں تم سب سے زیادہ اللہ تعالیٰ سے ڈرنے والا ہوں اور اس کے تقویٰ والا ہوں، لیکن میں روزہ رکھتا ہوں اور نہیں بھی رکھتا، نماز پڑھتا ہوں اور سوتا بھی ہوں اور میں عورتوں سے نکاح بھی کرتا ہوں، تو جو میرے طریقے سے بے رغبتی کرے وہ مجھ سے نہیں۔‘‘ ¤ ➎ { مَا كَتَبْنٰهَا عَلَيْهِمْ:} یعنی ہم نے انھیں رہبانیت کا حکم نہیں دیا تھا، بلکہ انھوں نے اسے خود ہی ایجاد کر لیا تھا۔ ¤ ➏ { اِلَّا ابْتِغَآءَ رِضْوَانِ اللّٰهِ:} یہ استثنا منقطع ہے اور{’’ اِلَّا ‘‘ ’’لٰكِنْ‘‘} کے معنی میں ہے: {’’أَيْ مَا كَتَبْنَا هَا عَلَيْهِمْ لٰكِنْ فَعَلُوْهَا ابْتِغَاءَ رِضْوَانِ اللّٰهِ‘‘}  ’’یعنی ہم نے انھیں اس کا حکم نہیں دیا، مگر انھوں نے (ترکِ دنیا کا) یہ کام اللہ کی رضا حاصل کرنے کے لیے کیا۔‘‘ یہ معنی بھی ہو سکتا ہے : {’’ لٰكِنْ كَتَبْنَا عَلَيْهِمُ ابْتِغَاءَ رِضْوَانِ اللّٰهِ‘‘} یعنی ہم نے انھیں رہبانیت کا حکم تو نہیں دیا، لیکن ہم نے انھیں اللہ کی رضا حاصل کرنے کا حکم دیا۔ ¤ ➐ { فَمَا رَعَوْهَا حَقَّ رِعَايَتِهَا:} رہبانیت اختیار کرنے والوں کی دو طرح سے مذمت فرمائی، ایک یہ کہ انھوں نے دین میں وہ بات ایجاد کی جس کا انھیں اللہ تعالیٰ نے حکم نہیں دیا تھا۔ دوسرا یہ کہ انھوں نے رہبانیت ایجاد کر کے اپنے آپ پر ترک دنیا کی جو پابندیاں عائد کی تھیں انھیں اس طرح نہ نبھا سکے جس طرح نبھانے کا حق تھا۔ ہمارے شیخ محمد عبدہ لکھتے ہیں : ’’یعنی انھوں نے دو جرم کیے، ایک رہبانیت (درویشی) کو دین کا جزو لاینفک قرار دے لیا اور پھر اس درویشی کے حقوق و آداب کی بھی نگہداشت نہ کر سکے۔ چنانچہ انھوں نے ابتدا میں توحید اور درویشی کو ایک ساتھ نبھانے کی کوشش کی، لیکن مسیح علیہ السلام کے تیسری صدی بعد سے اپنے بادشاہوں کے بہکانے میں آگئے اور تثلیث کے چکر میں پھنس کر توحید کو چھوڑ دیا، پھر درویشی تو درکنار اصل ایمان سے بھی ہاتھ دھو بیٹھے۔ درویشی کو جاہ و ریاست طلبی کا ذریعہ بنا لیا اور باطل طریقوں سے لوگوں کا مال کھانے لگے۔ الغرض جہاد کے فریضہ کو چھوڑ کر تصوف کی رسوم اختیار کرنا ہی رہبانیت ہے، جس کی قرآن نے مذمت کی ہے اور پھر درویشی یا دینی پیشوائی کو (اللہ کی رضا کے بجائے) جاہ و ریاست اور دنیا طلبی کا ذریعہ بنانا تو ناقابل عفو گناہ ہے، جو یہود و نصاریٰ میں عام وبا کی شکل اختیار کر گیا تھا۔‘‘ (اشرف الحواشی)شاہ عبدالقادر فرماتے ہیں : ’’یہ فقیری اور تارکِ دنیا بننا نصاریٰ نے رسم نکالی، جنگل میں تکیہ لگا کر بیٹھتے، نہ بیوی رکھتے نہ اولاد، نہ کماتے نہ جوڑتے، محض عبادت میں رہتے، خلق سے نہ ملتے۔ اللہ نے بندوں پر یہ حکم نہیں رکھا، مگر جب اپنے اوپر نام رکھا ترک دنیا کا، پھر اس پردے میں دنیا چاہنی بڑا وبال ہے۔‘‘ (موضح) آج کل روزانہ اخبارات میں نصرانی چرچوں میں پادریوں اور راہبوں کے زنا اور قومِ لوط کے عمل کی خبریں اسی {’’ فَمَا رَعَوْهَا حَقَّ رِعَايَتِهَا ‘‘} کی عملی تفسیر ہیں۔ ¤ ➑ رسول اللہ صلی اللہ علیہ وسلم کے فرمان {’’ لَتَتَّبِعُنَّ سُنَنَ مَنْ قَبْلَكُمْ ‘‘} کے مطابق امت مسلمہ میں بھی رہبانیت تصوف کی صورت میں رائج ہوگئی۔ [ دیکھیے بخاري : ۳۴۵۶ ] دنیا میں اسلام کو غالب کرنے اور جہاد کے بجائے ترکِ دنیا کمال ٹھہرا، تو توحید کے بجائے پیر پرستی اور قبر پرستی پھیل گئی۔ احسان کی منزل یہ تھی کہ آدمی اللہ تعالیٰ کی عبادت اس طرح کرے گویا اسے دیکھ رہا ہے، سو اگر یہ اسے نہیں دیکھتا تو وہ اسے یقینا دیکھ رہا ہے۔ تصوف میں اس کے بجائے کمال یہ ٹھہرا کہ شیخ کا تصور اس طرح رکھو کہ ایک لمحہ بھی دل و دماغ اور آنکھوں سے جدا نہ ہو۔ رسول اللہ صلی اللہ علیہ وسلم نے اللہ کا قرب حاصل کرنے کا کوئی طریقہ نہیں چھوڑا جو نہ بتایا ہو، یہاں ان طریقوں کو چھوڑ کر نصرانی راہبوں اور ہندو جوگیوں کے طریقے اللہ تعالیٰ کے قرب کا ذریعہ ٹھہرے۔ مثلاً روزے رکھنے کے بجائے ترک حیوانات جمالی و جلالی کیا گیا، یعنی کوئی حیوان یا اس سے نکلنے والی چیز مثلاً گوشت یا دودھ یا گھی نہ کھایا جائے۔ قرآن مجید کی تلاوت اور مسنون اذکار کے بجائے سانس بند کر کے خود ساختہ وظیفوں کو، جن کے ساتھ تصور شیخ کا شرک ہو، ولایت کے حصول کا مستند طریقہ قرار دیا گیا۔ محنت اور کمائی کے بجائے لوگوں کے نذرانوں یا گدائی کے ٹکڑوں پر گزر کرنا فقر کی منزل قرار پایا۔ قرآن کی دعوت کے ساتھ جہاد کی تلوار لے کر دنیا پر اسلام کو غالب کرنے کی جدو جہد کے بجائے جنگلوں بیابانوں یا مقبروں اور خانقاہوں میں ’’ ہُو حق ‘‘ کی ضربیں مقصد حیات قرار پائیں۔ ¤ مسجدیں ویران ہوئیں اور مقبرے آباد ہوئے اور یہ کام کرنے والوں کی پارسائی اور روحانی اقتدار کے اتنے جھوٹے قصے مشہور کیے گئے کہ نصرانی راہبوں اور ہندو جوگیوں کی ولایت کے افسانے ان کے مقابلے میں ہیچ ہوگئے۔ احبار و رہبان کے باطل طریقوں کے ساتھ لوگوں کے مال کھانے اور اللہ کی راہ سے روکنے کا کوئی طریقہ باقی نہ رہا جو یہاں اختیار نہ کیا گیا ہو۔ جو لوگ دنیاوی مصروفیت کی وجہ سے یہ کام نہ کر سکے انھوں نے بھی کتاب و سنت پر عمل کے بجائے ان خدا رسیدہ ہستیوں کی خدمت کو نجات کے لیے کافی سمجھا اور انھیں قیامت کے دن اپنا کار ساز سمجھ کر عمل سے فارغ ہوگئے۔ نتیجہ کفار کے غلبے اور مسلمانوں کی ذلت اور غلامی کی صورت میں سب کے سامنے ہے۔ اس کا علاج اب بھی وہی ہے جو اس مبارک سورت میں بتایا گیا ہے کہ رہبانیت کے بجائے پوری زندگی اللہ اور اس کے رسول کے احکام کے مطابق بسر کی جائے، لوگوں کے بنائے ہوئے طریقوں کے بجائے کتاب و سنت سے ثابت اعمال کی پابندی کی جائے اور اللہ کے دین کو غالب کرنے کے لیے اس کی راہ میں جہاد کیا جائے اور جان و مال کی قربانی سے کسی قسم کا دریغ نہ کیا جائے۔ کیونکہ جس طرح تورات و انجیل کی تعلیم رہبانیت کے بجائے قتال فی سبیل اللہ تھی اسی طرح قرآن مجید کی تعلیم بھی یہی ہے، دلیل اس کی یہ آیت ہے: «إِنَّ اللّٰهَ اشْتَرٰى مِنَ الْمُؤْمِنِيْنَ اَنْفُسَهُمْ وَ اَمْوَالَهُمْ بِاَنَّ لَهُمُ الْجَنَّةَ يُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ فَيَقْتُلُوْنَ وَ يُقْتَلُوْننَ وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرٰىةِ وَ الْاِنْجِيْلِ وَ الْقُرْاٰنِ » [ التوبۃ : ۱۱۱ ] ’’بے شک اللہ نے مومنوں سے ان کی جانیں اور ان کے اموال خرید لیے ہیں، اس کے بدلے کہ ان کے لیے جنت ہے، وہ اللہ کے راستے میں لڑتے ہیں، پس قتل کرتے ہیں اور قتل کیے جاتے ہیں، یہ تورات اور انجیل اور قرآن میں اس کے ذمے پکا وعدہ ہے۔‘‘ ¤ ➒ { فَاٰتَيْنَا الَّذِيْنَ اٰمَنُوْا مِنْهُمْ اَجْرَهُمْ:} ان میں دو قسم کے لوگ شامل ہیں، ایک وہ جو رہبانیت اور اس کے خود ساختہ عقائد و اعمال مثلاً تثلیث، قبر پرستی اور ترک دنیا کے بجائے صحیح ایمان و عمل پر قائم رہے، جو تورات و انجیل سے ثابت تھے، تو اللہ تعالیٰ نے انھیں ان کا اجر عطا فرما دیا اور دوسرے وہ لوگ جنھوں نے رسول اللہ صلی اللہ علیہ وسلم کا زمانہ پایا اور آپ پر ایمان لے آئے تو اللہ تعالیٰ نے انھیں بھی ان کا اجر عطا فرما دیا۔ ¤ ➓ {وَ كَثِيْرٌ مِّنْهُمْ فٰسِقُوْنَ :} یعنی ان میں سے بہت سے لوگ وہ تھے جو اپنی خواہش کے خلاف اللہ اور اس کے رسول کا حکم ماننے کے لیے تیار نہیں تھے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَ اٰمِنُوْا بِرَسُوْلِهٖ …:} مفسرین نے اس آیت کی تفسیر دو طرح سے کی ہے، ایک یہ کہ {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا ‘‘} کے الفاظ کے مخاطب اہلِ کتاب ہیں جو اس سے پہلے اپنے نبی پر ایمان کا دعویٰ رکھتے تھے، انھیں حکم دیا جا رہا ہے کہ اللہ سے ڈر جاؤ اور اس کے رسول محمد صلی اللہ علیہ وسلم پر ایمان لے آؤ، تو اللہ تعالیٰ تمھیں اپنی رحمت سے دوہرا حصہ عطا فرمائے گا۔ اس کی تائید سورۂ قصص کی آیات (۵۲ تا ۵۴) سے ہوتی ہے اور اس حدیث سے بھی جو ابو موسیٰ اشعری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ ثَلاَثَةٌ لَهُمْ أَجْرَانِ رَجُلٌ مِّنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ، وَآمَنَ بِمُحَمَّدٍ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَالْعَبْدُ الْمَمْلُوْكُ إِذَا أَدّٰی حَقَّ اللّٰهِ وَحَقَّ مَوَالِيْهِ، وَ رَجُلٌ كَانَتْ عِنْدَهُ أَمَةٌ يَطَؤُهَا فَأَدَّبَهَا، فَأَحْسَنَ تَأْدِيْبَهَا وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيْمَهَا ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا فَلَهُ أَجْرَانِ ] [ بخاري، العلم، باب تعلیم الرجل أمتہ وأہلہ : ۹۷ ] ’’تین آدمی ایسے ہیں کہ ان کے لیے دو اجر ہیں، ایک اہلِ کتاب میں سے کوئی آدمی جو اپنے نبی پر ایمان لایا اور محمد صلی اللہ علیہ وسلم پر ایمان لایا اور ایک وہ غلام جو کسی کی ملکیت میں ہو، جب وہ اللہ کا حق ادا کرے اور اپنے مالکوں کا حق ادا کرے اور ایک وہ آدمی جس کے پاس ایک لونڈی تھی، وہ اس سے صحبت کرتا تھا، تو اس نے اسے ادب سکھایا اور اچھی طرح ادب سکھایا اور اسے تعلیم دی اور اچھی طرح تعلیم دی، پھر اسے آزاد کر دیا اور اس سے نکاح کر لیا، تو اس کے لیے بھی دو اجر ہیں۔‘‘ ¤ اس تفسیر میں جو بات بیان ہوئی ہے وہ اپنی جگہ درست ہے، مگر یہاں {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا ‘‘} سے اہلِ کتاب میں سے مسلمان ہونے والے مراد لینا سیاق کے خلاف ہے، کیونکہ شروع سے آخر تک خطاب ان لوگوں سے ہے جو رسول اللہ صلی اللہ علیہ وسلم پر ایمان لائے، انھی کو اپنے ایمان میں اخلاص پیدا کرنے اور اللہ کی راہ میں قتال اور خرچ کا حکم آرہا ہے۔ اس آیت میں بھی انھیں اللہ سے ڈرنے اور اس کے رسول پر کما حقہ ایمان لانے کا حکم اور اس کی جزا کے طور پر اپنی نعمت کا دوہرا حصہ اور نور عظیم عطا کرنے کی بشارت کا ذکر ہے۔ اس لیے صحیح تفسیر ان حضرات کی ہے جو یہ کہتے ہیں کہ {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا ‘‘} کے ساتھ خطاب ان لوگوں سے ہے جو محمد صلی اللہ علیہ وسلم پر ایمان لائے، خواہ وہ اہلِ کتاب میں سے اسلام لائے ہوں یا مشرکین میں سے، یا پیدا ہی اسلام میں ہوئے ہوں، ان سب سے کہا جا رہا ہے کہ صرف زبان سے ایمان کے اقرار اور دعویٰ پر اکتفا نہ کرو، بلکہ سچے دل کے ساتھ ایمان لاؤ، اس کا حق ادا کرو اور اس کے تقاضے پورے کرو، تو اللہ تعالیٰ تمھیں اپنی رحمت کا دوہرا حصہ عطا کرے گا۔ ¤ اس دوہرے حصے سے مراد ہماری اس امت کی خصوصیت ہے کہ اللہ تعالیٰ نے ان کے لیے محض اپنے فضل سے پہلی امتوں کی بہ نسبت دوہرے اجر کا وعدہ فرمایا ہے۔ نبی صلی اللہ علیہ وسلم نے یہ بات ایک مثال کے ساتھ واضح فرمائی، آپ صلی اللہ علیہ وسلم نے فرمایا : [ مَثَلُكُمْ وَمَثَلُ أَهْلِ الْكِتَابَيْنِ كَمَثَلِ رَجُلٍ اسْتَأْجَرَ أُجَرَاءَ، فَقَالَ مَنْ يَّعْمَلُ لِيْ مِنْ غُدْوَةَ إِلٰی نِصْفِ النَّهَارِ عَلٰی قِيْرَاطٍطٍ؟ فَعَمِلَتِ الْيَهُوْدُ، ثُمَّ قَالَ مَنْ يَعْمَلُ لِيْ مِنْ نِصْفِ النَّهَارِ إِلٰی صَلاَةِ الْعَصْرِ عَلٰی قِيْرَاطٍ؟ فَعَمِلَتِ النَّصَارٰی، ثُمَّ قَالَ مَنْ يَّعْمَلُ لِيْ مِنَ الْعَصْرِ إِلَی أَنْ تَغِيْبَ الشَّمْسُ عَلٰی قِيْرَاطَيْنِ؟ فَأَنْتُمْ هُمْ، فَغَضِبَتِ الْيَهُوْدُ وَالنَّصَارٰی، فَقَالُوْا مَا لَنَا أَكْثَرَ عَمَلاً، وَأَقَلَّ عَطَاءً؟ قَالَ هَلْ نَقَصْتُكُمْ مِنْ حَقِّكُمْ؟ قَالُوْا لاَ قَالَ فَذٰلِكَ فَضْلِيْ أُوْتِيْهِ مَنْ أَشَاءُ ] [بخاري، الإجارۃ، باب الإجارۃ إلٰی نصف النہار : ۲۲۶۸، ۳۴۵۹، عن ابن عمر رضی اللہ عنھما ] ’’تمھاری مثال اور دونوں کتابوں (تورات و انجیل) والوں کی مثال اس آدمی کی مثال کی طرح ہے جس نے کئی مزدوروں کو اجرت پر رکھا اور کہا : ’’کون ہے جو میرے لیے صبح سے نصف النہار تک ایک قیراط پر کام کرے گا؟‘‘ تو یہود نے کام کیا۔ پھر اس نے کہا : ’’کون ہے جو میرے لیے نصف النہار سے عصر تک ایک قیراط پر کام کرے گا؟‘‘ تو نصاریٰ نے کام کیا۔ پھر اس نے کہا : ’’کون ہے جو میرے لیے عصر سے سورج غروب ہونے تک دو قیراط پر کام کرے گا۔‘‘ تو تم وہ لوگ ہو۔ اس پر یہود و نصاریٰ ناراض ہو گئے اور کہنے لگے : ’’ہمیں کیا ہے کہ ہم نے کام زیادہ کیا اور اجرت کم ملی؟‘‘ اس نے کہا : ’’کیا میں نے تمھارے حق میں کوئی کمی کی ہے؟‘‘ انھوں نے کہا : ’’نہیں!‘‘ اس نے کہا : ’’پھر یہ میرا فضل ہے، جسے چاہتا ہوں دیتا ہوں۔‘‘ ¤ ➋ { وَ يَجْعَلْ لَّكُمْ نُوْرًا تَمْشُوْنَ بِهٖ …:} یعنی اللہ تعالیٰ سے ڈرنے اور رسول اللہ صلی اللہ علیہ وسلم پر ایمان لانے کی بدولت اللہ تعالیٰ تمھیں کتاب و سنت کی صورت میں وحیٔ الٰہی کا ایسا عظیم نور عطا کرے گا جس کے ذریعے سے تم دنیا و آخرت میں ہر جگہ آسانی کے ساتھ چلتے رہو گے، کسی مسئلے میں تمھیں کوئی الجھن یا اندھیرا پیش نہیں آئے گا، جیسا کہ فرمایا : « اَللّٰهُ وَلِيُّ الَّذِيْنَ اٰمَنُوْا يُخْرِجُهُمْ مِّنَ الظُّلُمٰتِ اِلَى النُّوْرِ» [ البقرۃ : ۲۵۷ ] ’’اللہ ان لوگوں کا دوست ہے جو ایمان لائے، وہ انھیں اندھیروں سے نکال کر روشنی کی طرف لاتا ہے۔‘‘ اور قیامت کے دن کے اندھیروں میں وہ نور عطا کرے گا جس میں چلتے ہوئے تم جنت تک پہنچ جاؤ گے، جس کا ذکر اس سے پہلے {’’ يَوْمَ تَرَى الْمُؤْمِنِيْنَ وَ الْمُؤْمِنٰتِ يَسْعٰىى نُوْرُهُمْ بَيْنَ اَيْدِيْهِمْ ‘‘} میں گزرچکا ہے اور تمھیں بخش دے گا اور اللہ غفور و رحیم ہے۔"
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) ➊ { لِئَلَّا يَعْلَمَ اَهْلُ الْكِتٰبِ اَلَّا يَقْدِرُوْنَ عَلٰى شَيْءٍ مِّنْ فَضْلِ اللّٰهِ:} یعنی اے ایمان والو! اللہ تعالیٰ نے تمھیں اپنی رحمت میں سے دو حصے اور عظیم نور دینے کی بشارت اس لیے دی ہے تاکہ اہلِ کتاب تمھارے متعلق یہ نہ جانیں کہ یہ مسلمان اللہ کے فضل میں سے کچھ بھی حاصل نہیں کر سکتے۔ ¤ ➋ { وَ اَنَّ الْفَضْلَ بِيَدِ اللّٰهِ …:} سیاق کلام سے ظاہر ہے کہ اس سے پہلے {’’وَلِيَعْلَمُوْا‘‘} (اور تاکہ وہ جان لیں) محذوف ہے، یعنی اور تاکہ وہ جان لیں کہ فضل اہلِ کتاب یا کسی اور کے ہاتھ میں نہیں بلکہ اللہ کے ہاتھ میں ہے، وہ جسے چاہتا ہے دیتا ہے۔ چنانچہ اس نے اپنی مشیت سے اس آخری نبی پر اخلاص کے ساتھ ایمان لانے والوں کو اپنے خاص فضل کے لیے منتخب فرمایا ہے اور اللہ بہت بڑے فضل والا ہے۔ ¤ ➌ ابن جریر اور دوسرے کئی مفسرین نے فرمایا کہ{’’ لِئَلَّا يَعْلَمَ اَهْلُ الْكِتٰبِ ‘‘‘} کا معنی {’’ لِيَعْلَمَ أَهْلُ الْكِتَابِ‘‘} ہے۔ اس صورت میں مطلب یہ ہے کہ اللہ تعالیٰ نے تمھیں اپنی رحمت میں سے دو حصے اور نورِ عظیم کی بشارت اس لیے دی ہے تاکہ اہل کتاب (جو اپنے سوا کسی کو اللہ تعالیٰ کا فضل عطا ہونے کے قائل ہی نہیں) جان لیں کہ وہ اللہ کے فضل میں سے کسی چیز پر قدرت نہیں رکھتے اور یہ کہ فضل سارے کا سارا اللہ کے ہاتھ میں ہے، وہ جسے چاہتا ہے دیتا ہے اور اللہ بہت بڑے فضل والا ہے۔ ¤ اس تفسیر پر یہ اعتراض ہے کہ اس میں {’’لَا‘‘} کو زائد مانا گیا ہے، حالانکہ اللہ کے کلام میں کوئی لفظ زائد کیسے ہو سکتا ہے ؟ جواب اس کا یہ ہے کہ یہاں {’’لَا‘‘} زائد ہونے کا یہ مطلب نہیں کہ وہ بے کار ہے، بلکہ اسے بعد میں آنے والے {’’ اَلَّا يَقْدِرُوْنَ ‘‘} میں موجود نفی کی  تاکید کے لیے لایا گیا ہے، جیسا کہ ایک جگہ فرمایا : « مَا مَنَعَكَ اَنْ تَسْجُدَ» [ صٓ : ۷۵ ] ’’تجھے کس چیز نے روکا کہ تو سجدہ کرے؟‘‘ اور دوسری جگہ فرمایا : « مَا مَنَعَكَ اَلَّا تَسْجُدَ» [ الأعراف : ۱۲ ] ’’تجھے کس چیز نے روکا کہ تو سجدہ نہیں کرتا؟‘‘ یہاں {’’ اَلَّا تَسْجُدَ ‘‘} میں {’’لاَ‘‘} اس نفی کی تاکید کے لیے ہے جو {’’ مَنَعَكَ ‘‘} کے ضمن میں موجود ہے۔ {’’ لِئَلَّا يَعْلَمَ اَهْلُ الْكِتٰبِ ‘‘} کی یہ تفسیر بھی درست ہے اور بہت عمدہ ہے۔"
    }
  ]
}