{
  "surah": "Al-Mumtahana",
  "surah_number": 60,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "سورۂ حشر میں منافقین کی کفار اہل کتاب کے ساتھ دوستی اور اس کے برے انجام کا بیان تھا، اس سورت میں مشرکین کے ساتھ دوستی سے منع فرمایا، خصوصاً ان مہاجرین کو جن کے بیوی بچے یا عزیز مکہ میں رہ گئے تھے اور وہ اس خیال سے مشرکین سے تعلق قائم رکھنا چاہتے تھے کہ مشرکین اس وجہ سے ان کے بیوی بچوں اور عزیزوں کا خیال رکھیں گے۔ ¤ ۶ ہجری میں حدیبیہ کے مقام پر رسول اللہ صلی اللہ علیہ وسلم اور کفارِ قریش کے درمیان دس سال کے لیے صلح کا جو معاہدہ ہوا اس کی ایک شق یہ تھی کہ جو قبائل چاہیں رسول اللہ صلی اللہ علیہ وسلم کے حلیف بن جائیں اور جو چاہیں کفارِ قریش کے حلیف بن جائیں اور کوئی فریق دوسرے فریق کے حلیف پر نہ حملہ کرے اور نہ حملہ کرنے والوں کی مدد کرے۔ چنانچہ مکہ کے قریب رہنے والے قبائل میں سے بنو بکر قریش کے حلیف بن گئے اور بنو خزاعہ رسول اللہ صلی اللہ علیہ وسلم کے حلیف بن گئے۔ ابھی معاہدے کو تقریباً ڈیڑھ سال ہی گزرا تھا کہ بنو بکر نے مسلمانوں کے حلیف بنو خزاعہ پر حملہ کر دیا۔ قریش نے آدمیوں اور اسلحہ سے ان کی مدد کی، وہ بھاگ کر حرم میں آئے تو انھوں نے وہاں بھی انھیں نہیں چھوڑا بلکہ قتل کر دیا۔ بنو خزاعہ کا ایک وفد فریاد لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس مدینہ پہنچا۔ یہ قریش کی صریح عہد شکنی تھی۔ رسول اللہ صلی اللہ علیہ وسلم نے انھیں سزا دینے اور مکہ پر حملہ کرنے کا پختہ ارادہ کر لیا اور اس کے لیے خفیہ طور پر تیاری شروع کر دی۔ مقصد یہ تھا کہ اچانک حملے میں کفار مزاحمت نہیں کر سکیں گے اور کشت و خون کی نوبت نہیں آئے گی۔ مسلمانوں کی قیمتی جانیں بھی محفوظ رہیں گی اور کفار میں سے جن کی قسمت میں سعادت لکھی ہو گی مسلمان ہو سکیں گے اور آگے چل کر اسلام کی سربلندی میں حصہ لے سکیں گے۔ حاطب بن ابی بلتعہ رضی اللہ عنہ ایک مہاجر صحابی تھے اور بدری تھے، مکہ میں ان کی اولاد اور مال اسباب تھا۔ وہ اصلاً قریش میں سے نہیں تھے، بلکہ ان کے حلیف تھے۔ انھوں نے قریش کو رسول اللہ صلی اللہ علیہ وسلم کے ارادے کی اطلاع دینے کے لیے ان کی طرف ایک خط لکھا اور ایک عورت کے ہاتھ بھیج دیا۔ ¤ صحیح بخاری میں اس کی تفصیل آئی ہے، چنانچہ علی رضی اللہ عنہ بیان کرتے ہیں کہ مجھے، زبیر اور مقداد کو رسول اللہ صلی اللہ علیہ وسلم نے بھیجا کہ تم چلتے جاؤ یہاں تک روضۂ خاخ (خاخ نامی باغ) تک جا پہنچو، وہاں اونٹنی پر سوار ایک عورت ہوگی، اس سے خط لے آؤ۔ چنانچہ ہم گھوڑے دوڑاتے ہوئے روانہ ہو گئے، یہاں تک کہ ہم اس باغ کے پاس جا پہنچے۔ دیکھا تو اونٹنی پر سوار وہ عورت وہاں تھی، ہم نے اس سے کہا : ’’خط نکال۔‘‘ اس نے کہا : ’’میرے پاس کوئی خط نہیں۔‘‘ ہم نے کہا : ’’تم ہر صورت خط نکالو گی یا ہم تمھارے کپڑے اتاریں گے۔‘‘ چنانچہ اس نے وہ خط اپنی چوٹی سے نکال کے دے دیا۔ ہم اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے۔ دیکھا ت تو اس میں لکھا تھا کہ یہ خط حاطب بن ابی بلتعہ کی طرف سے مکہ کے کچھ لوگوں کے نام ہے، جو مشرکین میں سے تھے۔ اس میں انھوں نے انھیں رسول اللہ صلی اللہ علیہ وسلم کے بعض امور کی خبر دی تھی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ يَا حَاطِبُ! مَا هٰذَا ؟ ] ’’حاطب! یہ کیا ہے؟‘‘ انھوں نے کہا : ’’یا رسول اللہ! مجھ پر جلدی نہ کریں، میں ایسا آدمی تھا جو قریش کے ساتھ جڑا ہوا تھا، ان کا حلیف تھا، اصلاً ان میں سے نہیں تھا اور آپ کے ساتھ جو مہاجرین ہیں ان کی وہاں کئی قرابتیں ہیں، جن کے ذریعے سے وہ اپنے اہل و عیال اور اموال کی حفاظت رکھتے ہیں۔ تو میں نے چاہا کہ جب میرا ان سے کوئی نسبی رشتہ نہیں تو میں ان پر ایک احسان کردوں جس کی وجہ سے وہ میرے گھر والوں کی حفاظت رکھیں۔ میں نے یہ کام نہ اپنے دین سے مرتد ہونے کی وجہ سے کیا ہے اور نہ ہی اسلام لانے کے بعد کففر کو پسند کرنے کی وجہ سے کیا ہے۔‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ أَمَا إِنَّهُ قَدْ صَدَقَكُمْ ] ’’سن لو! اس نے یقینا تم سے سچ کہا ہے۔‘‘ عمر رضی اللہ عنہ نے کہا : ’’اے اللہ کے رسول! مجھے اجازت دیں، میں اس منافق کی گردن اڑا دوں۔‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّهُ قَدْ شَهِدَ بَدْرًا وَمَا يُدْرِيْكَ لَعَلَّ اللّٰهَ اطَّلَعَ عَلٰی مَنْ شَهِدَ بَدْرًا قَالَ اعْمَلُوْا مَا ا مَا شِئْتُمْ فَقَدْ غَفَرْتُ لَكُمْ ] ’’یہ تو بدر میں شریک ہوا ہے اور تجھے کیا معلوم شاید اللہ نے بدر میں شریک ہونے والوں کو جھانک کر کہا ہو کہ تم جو چاہو کرو، کیونکہ میں نے تمھیں بخش دیا ہے۔‘‘ تو اللہ تعالیٰ نے یہ سورت نازل فرما دی : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوْا عَدُوِّيْ وَ عَدُوَّكُمْ اَوْلِيَآءَ ........ فَقَدْ ضَلَّ سَوَآءَ السَّبِيْلِ » ’’اے لوگو جو ایمان لائے ہو! میرے دشمنوں اور اپنے دشمنوں کو دوست مت بناؤ........ تو یقینا وہ سیدھے راستے سے بھٹک گیا۔‘‘ [ بخاري، المغازي، باب غزوۃ الفتح : ۴۲۷۴ ] ¤ (آیت 1) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوْا عَدُوِّيْ وَ عَدُوَّكُمْ اَوْلِيَآءَ: ’’ عَدُوٌّ ‘‘ ’’عَدَا يَعْدُوْ عَدْوًا وَعَدَاوَةً‘‘} سے{ ’’ فَعُوْلٌ ‘‘} بمعنی {’’فَاعِلٌ‘‘ } کے وزن پر ہے، دشمن۔ {’’فَعِيْلٌ‘‘} اور {’’ فَعُوْلٌ ‘‘} دونوں صیغے واحد، تثنیہ، جمع اور مذکر و مؤنث کے لیے ایک ہی لفظ کے ساتھ آ جاتے ہیں، اس لیے ترجمہ ’’میرے دشمنوں‘‘ کیا گیا ہے۔ اللہ تعالیٰ نے یہ کہنے کے بجائے کہ کفار اور مشرکین کو دوست نہ بناؤ، یہ فرمایا کہ میرے دشمنوں اور اپنے دشمنوں کو دوست نہ بناؤ۔ پھر {’’ عَدُوِّيْ ‘‘} (میرے دشمنوں ) کا ذکر پہلے کیا اور {’’ عَدُوَّكُمْ ‘‘} (اپنے دشمنوں) کا ذکر بعد میں کیا۔ اس سے معلوم ہوا کہ کافر و مشرک کبھی مسلمانوں کے دوست نہیں ہو سکتے، کیونکہ ان کی دشمنی کی بنیاد نہ وطن ہے نہ نسب اور نہ مال، بلکہ انھوں نے مسلمانوں کی دشمنی صرف اللہ تعالیٰ کی دشمنی کی وجہ سے اختیار کر رکھی ہے۔ اللہ کی دشمنی کا مطلب یہ ہے کہ وہ اللہ کی توحید، اس کے دین اور اس کے رسول کو نہیں مانتے، اس لیے انھوں نے ان کی شدید مخالفت اور دشمنی اختیار کر رکھی ہے۔ {’’ عَدُوِّيْ ‘‘} کو {’’ عَدُوَّكُمْ ‘‘} سے پہلے لانے کی مناسبت یہی معلوم ہوتی ہے کہ وہ اللہ کے دین کے دشمن پہلے ہیں، پھر اس کی وجہ سے وہ مسلمانوں کے دشمن ہیں۔ آیت میں کفار و مشرکین کی عداوت کا حوالہ دے کر مسلمانوں کو ان کی دوستی سے منع فرمایا گیا ہے۔ قرآن مجید میں کئی مقامات پر کفار کی دوستی سے منع کیا گیا ہے اور ساتھ ہی دوستی سے ممانعت کی کوئی نہ کوئی وجہ بیان کی گئی ہے۔ دیکھیے سورۂ آل عمران (۲۸)، نساء (۱۴۴)، مائدہ (57،51) اور سورۂ توبہ (24،23) ان تمام وجوہات میں بنیادی بات یہی ہے کہ وہ تمھارے اور تمھارے دین کے دشمن ہیں، جب تک تم کافر نہ ہو جاؤ وہ کبھی تمھارے دوست نہیں ہو سکتے۔ دیکھیے سورۂ بقرہ (۱۲۰) اور سورۂ نساء (۸۹)۔ ¤ ➋ { تُلْقُوْنَ اِلَيْهِمْ بِالْمَوَدَّةِ:} اس کے دو معنی ہو سکتے ہیں، ایک یہ کہ {’’اَلْمَوَدَّةُ ‘‘ ’’ تُلْقُوْنَ ‘‘} کا مفعول بہ ہے اور اس پر ’’باء‘‘ تاکید کے لیے آئی ہے، اس صورت میں معنی یہ ہے کہ تم ان کی طرف دوستی کا پیغام بھیجتے ہو۔ دوسرا معنی یہ کہ {’’ تُلْقُوْنَ ‘‘} کا مفعول بہ محذوف ہے : {’’أَيْ تُلْقُوْنَ إِلَيْهِمُ الْأَخْبَارَ بِالْمَوَدَّةِ‘‘} ’’یعنی تم دوستی کی وجہ سے ان کی طرف خبریں پہنچاتے ہو (جن کا اللہ کے دشمنوں اور تمھارے دشمنوں کو کسی صورت علم نہیں ہونا چاہیے)۔‘‘ ¤ ➌ { وَ قَدْ كَفَرُوْا بِمَا جَآءَكُمْ مِّنَ الْحَقِّ:} یعنی انھوں نے تو وہ حق ماننے ہی سے انکار کر دیا ہے جو تمھارے پاس آیا ہے اور تم ہو کہ ان کی طرف دوستی کے پیغام بھیجتے ہو۔ ¤ ➍ {يُخْرِجُوْنَ الرَّسُوْلَ وَ اِيَّاكُمْ اَنْ تُؤْمِنُوْا بِاللّٰهِ رَبِّكُمْ: ’’ اَنْ تُؤْمِنُوْا بِاللّٰهِ رَبِّكُمْ ‘‘} سے پہلے لام محذوف ہے، یعنی انھوں نے صرف کفر اور معمولی دشمنی ہی پر اکتفا نہیں کیا بلکہ رشتہ داری اور محبت کے تمام سلسلے قطع کر کے رسول کو اور تمھیں اتنی ایذا دی کہ تم سب کو مکہ سے نکلنے پر مجبور کر دیا، صرف اس وجہ سے کہ تم اپنے رب پر ایمان رکھتے ہو۔ اس جملے کی ہم معنی آیات کے لیے دیکھیے سورۂ بروج (۸) اور سورۂ حج (۴۰) {’’ يُخْرِجُوْنَ ‘‘} مضارع کا صیغہ لانے کا مطلب یہ ہے کہ نہ صرف یہ کہ انھوں نے تمھیں نکالا ہے بلکہ وہ تمھیں نکالنے پر ابھی تک قائم ہیں اور اب بھی تمھیں تمھارے گھروں میں واپس نہیں آنے دے رہے۔ اس میں مسلمانوں کو کفار کی دشمنی کے لیے ابھارا گیا ہے کہ کس قدر تعجب کی بات ہے کہ وہ تمھارے رسول کو اور تمھیں نکال رہے ہیں اور تم ان کی طرف دوستی کا ہاتھ بڑھا رہے ہو۔ ¤ ➎ { اِنْ كُنْتُمْ خَرَجْتُمْ جِهَادًا فِيْ سَبِيْلِيْ … : ’’ جِهَادًا ‘‘} اور {’’ ابْتِغَآءَ مَرْضَاتِيْ ‘‘} دونوں {’’ خَرَجْتُمْ ‘‘} کے مفعول لہ ہیں اور {’’ اِنْ كُنْتُمْ ‘‘} شرط کی جزا محذوف ہے جو آیت کے پہلے جملے {’’ لَا تَتَّخِذُوْا عَدُوِّيْ وَ عَدُوَّكُمْ اَوْلِيَآءَ ‘‘} سے معلوم ہو رہی ہے، یعنی اگر تم میرے راستے میں جہاد کے لیے اور میری رضا تلاش کرنے کے لیے نکلے ہو تو میرے دشمنوں اور اپنے دشمنوں کو دوست مت بناؤ۔ ¤ ➏ { تُسِرُّوْنَ اِلَيْهِمْ بِالْمَوَدَّةِ … :} یعنی تم پر تعجب ہے کہ تم چھپ کر ان کی طرف دوستی کے پیغام بھیجتے ہو، حالانکہ میں ان باتوں کو جو تم نے چھپائیں اور جو ظاہر کیں تم سے اور ہر ایک سے بڑھ کر جاننے والا ہوں۔ سو تمھیں یہ سوچ کر بھی ایسی حرکت سے اجتناب کرنا چاہیے کہ تمھارا مالک تمھارے ہر کام سے پوری طرح آگاہ ہے اور تم اپنی کوئی حرکت اس سے کسی طرح بھی نہیں چھپا سکتے۔ ¤ ➐ {وَ مَنْ يَّفْعَلْهُ مِنْكُمْ فَقَدْ ضَلَّ سَوَآءَ السَّبِيْلِ:} یعنی یہ صرف حاطب رضی اللہ عنہ یا کسی مہاجر کی مشرکینِ مکہ کے ساتھ دوستی کا معاملہ نہیں، بلکہ قیامت تک آنے والے مسلمانوں میں سے جو بھی یہ کام کرے گا وہ یقینا سیدھے راستے سے بھٹک گیا۔ ¤ ➑ اس آیت سے مخلصین پر اللہ تعالیٰ کی بے پایاں رحمت کا اظہار بھی ہو رہا ہے کہ اتنی بڑی غلطی کرنے والوں کو {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا ‘‘} کے ساتھ خطاب ہو رہا ہے۔ اس سے معلوم ہوا کہ کسی معصیت اور گناہ کی وجہ سے آدمی کافر نہیں ہوتا، اس لیے رسول اللہ صلی اللہ علیہ وسلم نے حاطب رضی اللہ عنہ کی غلطی سے درگزر فرمایا۔ یہ بھی معلوم ہوا کہ کسی آدمی کے معاملات میں اس کی سابقہ زندگی کو بھی مدِ نظر رکھا جائے گا۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { اِنْ يَّثْقَفُوْكُمْ يَكُوْنُوْا لَكُمْ اَعْدَآءً …:} اس میں پچھلی آیت کے آخری جملے کی وجہ بیان فرمائی ہے، یعنی تم میں سے جو شخص اس توقع پر کفار و مشرکین سے دوستی رکھے اور ان کی طرف خفیہ پیغام بھیجے کہ وہ مشکل وقت میں اس کے کام آئیں گے یا اس کے اہل و عیال کا خیال رکھیں گے، تو وہ سیدھے راستے سے بھٹک کر غلط راستے پر چل پڑا ہے، کیونکہ ان کافروں کے دلوں میں تمھارے لیے اس قدر بغض و عناد ہے کہ وہ تمھیں زندہ دیکھنا بھی پسند نہیں کرتے، کسر صرف اتنی ہے کہ ان کا بس نہیں چل رہا اور تم ان کے قابو میں نہیں آ رہے۔ اگر کسی وقت ان کا بس چل جائے اور تم ان کے قابو میں آجاؤ تو وہ پہلے کی طرح تمھارے دشمن ہی ہوں گے اور اپنے ہاتھ اور اپنی زبانیں برائی کے ساتھ تمھاری طرف بڑھائیں گے، تم پر دست درازی اور زبان درازی میں کوئی کسر نہیں چھوڑیں گے، جیسا کہ فرمایا : « كَيْفَ وَ اِنْ يَّظْهَرُوْا عَلَيْكُمْ لَا يَرْقُبُوْا فِيْكُمْ اِلًّا وَّ لَا ذِمَّةً » [ التوبۃ : ۸ ] ’’(مشرکین کے کسی عہد کا اعتبار) کیسے ہو سکتا ہے جبکہ وہ اگر تم پر غالب آ جائیں تو تمھارے بارے میں نہ کسی قرابت کا لحاظ کریں گے اور نہ کسی عہد کا۔‘‘ ¤ ➋ { وَدُّوْا لَوْ تَكْفُرُوْنَ: ’’ لَوْ ‘‘} مصدریہ ہے : {’’أَيْ وَدُّوْا كُفْرَكُمْ‘‘} یعنی ان کی خواہش یہی ہوگی کہ تم کافر ہو جاؤ، اس کے بغیر وہ تم سے کسی طرح بھی راضی نہیں ہوں گے۔ مزید دیکھیے سورۂ بقرہ (120،109) اور سورۂ نساء (۸۹)۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ { لَنْ تَنْفَعَكُمْ اَرْحَامُكُمْ وَ لَاۤ اَوْلَادُكُمْ يَوْمَ الْقِيٰمَةِ: ’’أَرْحَامٌ‘‘ ’’رَحْمٌ‘‘} کی جمع ہے، رشتہ داری۔ مراد {’’ذُوُوا الْأَرْحَامِ‘‘} ہے، رشتہ دار۔ یعنی وہ رشتہ دار اور اولاد جن کی خاطر تم اتنے بڑے گناہ کا ارتکاب کر رہے ہو قیامت کے دن وہ تمھیں ہرگز کوئی فائدہ نہیں دیں گے کہ تمھیں اس گناہ کی سزا سے یہ کہہ کر بچا لیں کہ انھوں نے ہماری خاطر یہ غلطی کی تھی۔ ¤ ➋ {يَفْصِلُ بَيْنَكُمْ:} اس کے دو مطلب ہو سکتے ہیں، ایک یہ کہ اللہ تعالیٰ تمھارے درمیان فیصلہ کرے گا۔ دوسرا یہ کہ وہ قیامت کے دن تمھارے درمیان اور تمھارے ارحام و اولاد کے درمیان جدائی ڈال دے گا، کسی کو کسی کا ہوش نہ ہوگا، جیسا کہ فرمایا : « يَوْمَ يَفِرُّ الْمَرْءُ مِنْ اَخِيْهِ (34) وَ اُمِّهٖ وَ اَبِيْهِ (35) وَ صَاحِبَتِهٖ وَ بَنِيْهِ (36) لِكُلِّ امْرِئٍ مِّنْهُمْ يَوْمَىِٕذٍ شَاْنٌ يُّغْنِيْهِ» [ عبس : ۳۴ تا ۳۷ ] ’’جس دن آدمی اپنے بھائی سے بھاگے گا۔ اور اپنی ماں اور اپنے باپ(سے)۔ اور اپنی بیوی اور اپنے بیٹوں سے۔ اس دن ان میں سے ہر شخص کی ایک ایسی حالت ہوگی جو اسے ( دوسروں سے) بے پروا بنا دے گی۔‘‘ پچھلی آیت میں ان لوگوں کا حال بتایا جن سے دوستی کی جا رہی ہے اور اس آیت میں ان لوگوں کا حال بیان کیا جن کی خاطر کفار سے دوستی کی جا رہی ہے۔ ¤ ➌ {وَ اللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ:} اس میں فرماں برداروں کے لیے وعدہ اور نافرمانوں کے لیے وعید ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {قَدْ كَانَتْ لَكُمْ اُسْوَةٌ حَسَنَةٌ فِيْۤ اِبْرٰهِيْمَ وَ الَّذِيْنَ مَعَهٗ: ’’ اُسْوَةٌ ‘‘} اور {’’قُدْوَةٌ‘‘} کے معنی ہیں جس کی پیروی کی جائے، نمونہ (اچھا ہو یا برا)، اس لیے ابراہیم علیہ السلام اور ان کے ساتھیوں کو اسوۂ حسنہ فرمایا۔ یعنی اللہ کے دشمن کفار و مشرکین کے ساتھ دوستی کے سلسلے میں تمھارے لیے ابراہیم علیہ السلام اور ان کے ساتھیوں میں پہلے سے ایک اچھا نمونہ موجود تھا جو تمھارے پیش نظر رہنا چاہیے تھا۔ {’’ وَ الَّذِيْنَ مَعَهٗ ‘‘} سے مراد ان پر ایمان لانے والے ساتھی ہیں۔ ¤ ➋ { اِذْ قَالُوْا لِقَوْمِهِمْ اِنَّا بُرَءٰٓؤُا مِنْكُمْ …:’’ بُرَءٰٓؤُا ‘‘ ’’ بَرِيْءٌ ‘‘} کی جمع ہے، جیسے {’’كَرِيْمٌ‘‘} کی جمع {’’كُرَمَاءُ‘‘} ہے۔ یعنی ابراہیم علیہ السلام اور ان کے ساتھی تمھارے لیے اس بات میں نمونہ ہیں کہ انھوں نے اپنی مشرک قوم سے، ان کے شرک سے اور ان کے معبودوں سے بری اور لاتعلق ہونے کا اعلان کر دیا۔ {’’ وَ مِمَّا تَعْبُدُوْنَ ‘‘} میں {’’مَا ‘‘} مصدریہ بھی ہو سکتا ہے اور موصولہ بھی۔ ¤ ➌ {كَفَرْنَا بِكُمْ:} ہم تمھیں نہیں مانتے، نہ تمھارے دین کو، نہ تمھارے خداؤں کو اور نہ ان کی عبادت کو۔ ¤ ➍ { وَ بَدَا بَيْنَنَا وَ بَيْنَكُمُ الْعَدَاوَةُ وَ الْبَغْضَآءُ اَبَدًا … :} یعنی ہمارے اللہ پر ایمان لانے اور تمھارے کفر پر قائم رہنے کے بعد ہمارے اور تمھارے درمیان کھلی دشمنی اور دلی بغض ہمیشہ کے لیے ظاہر ہوگیا ہے، یہاں تک کہ تم اکیلے اللہ پر ایمان لے آؤ۔ ¤ ➎ { اِلَّا قَوْلَ اِبْرٰهِيْمَ لِاَبِيْهِ لَاَسْتَغْفِرَنَّ لَكَ:} یعنی ابراہیم علیہ السلام کی پوری زندگی تمھارے لیے بہترین نمونہ ہے، سوائے اس بات کے جو ابراہیم علیہ السلام نے اپنے باپ سے کہی کہ میں تمھارے لیے بخشش کی دعا ضرور کروں گا۔ اس بات میں وہ تمھارے لیے نمونہ نہیں ہیں اور نہ ہی اس میں ان کی پیروی جائز ہے۔ مشرکین کے لیے استغفار کی ممانعت اور ابراہیم علیہ السلام کے استغفار کی تفصیل کے لیے دیکھیے سورۂ توبہ کی آیات (114،113) کی تفسیر۔ ¤ ➏ { وَ مَاۤ اَمْلِكُ لَكَ مِنَ اللّٰهِ مِنْ شَيْءٍ:} یعنی میں تمھارے لیے استغفار ضرور کروں گا، مگر میں تمھارے لیے اللہ تعالیٰ سے کسی چیز کے دلوانے کا مالک نہیں، وہ چاہے گا تو تمھیں بخش دے گا چاہے تو عذاب دے گا۔ معلوم ہوا کہ یہ اختیار پیغمبروں کے پاس بھی نہیں کہ وہ جسے چاہیں بخشوا لیں، خواہ وہ ابراہیم علیہ السلام کے والد ہوں یا نوح علیہ السلام کا بیٹا یا ہمارے نبی صلی اللہ علیہ وسلم کے چچا ابو طالب ہوں۔ ¤ ➐ { رَبَّنَا عَلَيْكَ تَوَكَّلْنَا:} یہ ابراہیم علیہ السلام اور ان کے ساتھیوں کا کلام ہے جو {’’ اِلَّا قَوْلَ اِبْرٰهِيْمَ لِاَبِيْهِ …‘‘} سے پہلے کلام کے ساتھ ملا ہوا ہے اور ان چیزوں میں شامل ہے جن میں ابراہیم علیہ السلام اور ان کے ساتھیوں کی پیروی کا حکم ہے۔ گویا ابراہیم علیہ السلام اور ان کے ساتھیوں نے اپنی قوم سے یہ کہا : « اِنَّا بُرَءٰٓؤُا مِنْكُمْ ...... حَتّٰى تُؤْمِنُوْا بِاللّٰهِ وَحْدَهٗۤ » اور اپنے رب سے یہ کہا : « رَبَّنَا عَلَيْكَ تَوَكَّلْنَا ...... اِنَّكَ اَنْتَ الْعَزِيْزُ الْحَكِيْمُ » یہ دونوں باتیں کہنے میں وہ ہمارے لیے نمونہ ہیں اور ہمیں ان کی پیروی کا حکم ہے۔ ¤ ➑ {وَ اِلَيْكَ اَنَبْنَا وَ اِلَيْكَ الْمَصِيْرُ: ’’ اَنَبْنَا ‘‘ ’’أَنَابَ يُنِيْبُ إِنَابَةً ‘‘} (افعال) سے جمع متکلم ماضی معلوم کا صیغہ ہے۔ {’’ الْمَصِيْرُ ‘‘ ’’ صَارَ يَصِيْرُ ‘‘} سے مصدر میمی ہے۔ {’’ عَلَيْكَ ‘‘} اور {’’ اِلَيْكَ ‘‘} پہلے آنے سے قصر کا مفہوم حاصل ہو رہا ہے کہ اے ہمارے رب! ہم نے تجھی پر بھروسا کیا، کسی اور پر نہیں اور تیری ہی طرف رجوع کیا، کسی اور کی طرف نہیں، (تو نے ہی سب کو پیدا کیا) اور (آخر کار) تیری ہی طرف واپس آنا ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِيْنَ كَفَرُوْا:} اس کی تفصیل کے لیے دیکھیے سورۂ یونس (۸۵) کی تفسیر۔ ¤ ➋ { وَ اغْفِرْ لَنَا رَبَّنَا … :} پہلی تمام دعائیں حرفِ عطف کے بغیر ہیں اور یہ واؤ عطف کے ساتھ ہے، کیونکہ پہلی تمام دعاؤں میں دنیوی زندگی میں اپنے دین کی اصلاح اور اس پر استقامت مانگی گئی ہے اور اس میں اخروی زندگی کی اصلاح کی درخواست ہے۔ دونوں کے درمیان مغایرت کی وجہ سے درمیان میں واؤ عطف لائی گئی ہے۔ (ابن عاشور)"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { لَقَدْ كَانَ لَكُمْ فِيْهِمْ اُسْوَةٌ حَسَنَةٌ …:} اس سے پہلے {’’ قَدْ كَانَتْ لَكُمْ اُسْوَةٌ حَسَنَةٌ فِيْۤ اِبْرٰهِيْمَ ‘‘} میں یہی بات ذکر ہوئی ہے، لامِ قسم کے ساتھ اسے دوبارہ لانے سے ایک تو اس حکم کی تاکید مقصود ہے اور ایک اس کے بعد {’’ لِمَنْ كَانَ يَرْجُوا اللّٰهَ وَ الْيَوْمَ الْاٰخِرَ ‘‘} لا کر یہ بتانا مقصود ہے کہ ابراہیم علیہ السلام اور ان کے ساتھی ان لوگوں کے لیے نمونہ نہیں جن کی ساری جد و جہد دنیا کے لیے ہے، بلکہ وہ صرف ان لوگوں کے لیے نمونہ ہیں جو اللہ اور یوم آخرت کی امید رکھتے ہیں۔ ¤ ➋ { لِمَنْ كَانَ يَرْجُوا اللّٰهَ وَ الْيَوْمَ الْاٰخِرَ:} اس کی تفصیل کے لیے دیکھیے سورۂ احزاب (۲۱) کی تفسیر۔ ¤ ➌ { وَ مَنْ يَّتَوَلَّ فَاِنَّ اللّٰهَ هُوَ الْغَنِيُّ الْحَمِيْدُ:} یعنی جو اللہ تعالیٰ اور یومِ آخرت کی امید سے منہ موڑتا ہے تو اللہ تعالیٰ کو بھی اس کی کوئی پروا نہیں، کیونکہ وہ تو غنی و حمید ہے اور غنی و حمید بھی ایسا کہ اس کے سوا کوئی غنی و حمید ہے ہی نہیں۔ مزید دیکھیے سورۂ فاطر (۱۵)، حج (۶۴) اور حدید (۲۴) کی تفسیر۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {عَسَى اللّٰهُ اَنْ يَّجْعَلَ بَيْنَكُمْ وَ بَيْنَ الَّذِيْنَ عَادَيْتُمْ مِّنْهُمْ ممَّوَدَّةً:} اللہ تعالیٰ نے مسلمانوں کو ان کے مشرک رشتہ داروں سے قطع تعلق کا جو حکم دیا اس کے مطابق اپنے عزیزوں سے ناتا توڑنا اگرچہ نہایت مشکل کام تھا مگر انھوں نے اللہ تعالیٰ کے حکم کی تعمیل کی اور کسی قرابت کی پروا نہیں کی، اللہ تعالیٰ نے ان کے صدق و اخلاص کو دیکھ کر اس آیت کے ساتھ ان کی دلجوئی فرمائی اور انھیں بشارت دی کہ قریب ہے کہ اللہ تعالیٰ تمھارے درمیان اور ان لوگوں کے درمیان جن کے ساتھ دین کی وجہ سے تمھاری دشمنی ہے دوستی پیدا کر دے، تمھارے یہ عزیز مسلمان ہو جائیں اور دشمنی پھر محبت میں بدل جائے۔ ¤ ➋ { وَ اللّٰهُ قَدِيْرٌ:} بظاہر یہ ممکن نظر نہیں آتا تھا کہ جن لوگوں نے مسلمانوں کو مکہ سے نکالا، مدینہ میں بھی چین نہ لینے دیا، بدر و احد، خندق اور دوسرے معرکے برپا کیے وہ دوبارہ دوست بن جائیں گے، اس لیے اللہ تعالیٰ نے فرمایا کہ اللہ تعالیٰ ہر چیز پر قادر ہے، اس کے لیے دلوں کو پھیر دینا کچھ مشکل نہیں۔ چنانچہ ان آیات کے نزول کے بعد تھوڑی مدت ہی گزری تھی کہ مکہ فتح ہو گیا، قریش اور دوسرے قبائل فوج در فوج اسلام میں داخل ہونے لگے اور سوائے ان کفار کے جو قتل ہوگئے تھے، آخر کار سب مسلمان ہو گئے، حتیٰ کہ جزیرۂ عرب میں کوئی مشرک باقی نہ رہا۔ ابو سفیان اور دوسرے قریشی سردار جو مسلمانوں کے خلاف لڑتے آئے تھے، اب اسلام کی سربلندی کے لیے سربکف ہو کر لڑنے لگے۔ ¤ ➌ {وَ اللّٰهُ غَفُوْرٌ رَّحِيْمٌ:} یعنی مشرکین نے اب تک اہلِ ایمان سے جو عداوت رکھی اللہ تعالیٰ اپنی مغفرت و رحمت کی وجہ سے اس سے درگزر فرما کر انھیں ایمان لانے اور مسلمانوں کے دوست بن جانے کی توفیق عطا فرمانے والا ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) {لَا يَنْهٰىكُمُ اللّٰهُ عَنِ الَّذِيْنَ لَمْ يُقَاتِلُوْكُمْ … :} اس آیت میں اور اس کے بعد والی آیت میں اللہ تعالیٰ نے کفار کو دو گروہوں میں تقسیم فرمایا ہے۔ ایک محارب جو مسلمانوں سے ضد اور عناد رکھتے تھے، انھیں ایذا دینے، ان کے گھروں سے نکالنے اور ان سے لڑنے میں سرگرم تھے، یا ایسے لوگوں کی پشت پناہی اور مدد کرتے تھے۔ دوسرے مُسالم جو کافر تو تھے مگر روادار تھے، غیر جانبدار بن کر رہے، مسلمانوں کو نہ کوئی دکھ پہنچایا اور نہ ان کے خلاف کسی کارروائی میں حصہ لیا۔ ان میں مکہ کے اردگرد رہنے والے کئی قبائل تھے، جیسے بنو خزاعہ اور بنو حارث وغیرہ جو مسلمانوں کے حلیف تھے یا کفار قریش کے مقابلے میں مسلمانوں سے ہمدردی رکھتے تھے۔ اہلِ مکہ میں بھی اس طرح کے کئی لوگ تھے، خصوصاً بنو ہاشم اور بنو مطلب کے اکثر لوگوں کی ہمدردیاں مسلمانوں کے ساتھ تھیں۔ مہاجرین کی بہت سی رشتہ دار عورتیں اور بچے جو مکہ میں تھے اور ابھی تک مسلمان نہیں ہوئے تھے مگر ان سے انس اور تعلق رکھتے تھے۔ مسلمانوں کی دلی خواہش ایسے لوگوں سے تعلق رکھنے کی تھی، اللہ تعالیٰ نے اس کی اجازت دے دی اور فرمایا کہ اللہ تعالیٰ تمھیں ایسے لوگوں سے نیک سلوک اور ان کے حق میں انصاف کرنے سے منع نہیں کرتا۔ ¤ اسماء بنت ابی بکر رضی اللہ عنھما بیان کرتی ہیں کہ میری ماں نبی صلی اللہ علیہ وسلم کے زمانے میں (معاہدۂ صلح کے دوران حسنِ سلوک کی) امید رکھتے ہوئے میرے پاس آئی، میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا : ’’کیا میں اس سے حسن سلوک کروں؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’ہاں!‘‘ ابن عیینہ نے فرمایا : ’’اللہ تعالیٰ نے اس کے بارے میں یہ آیت نازل فرمائی : « لَا يَنْهٰىكُمُ اللّٰهُ عَنِ الَّذِيْنَ لَمْ يُقَاتِلُوْكُمْ فِي الدِّيْنِ» ’’اللہ تمھیں ان لوگوں سے منع نہیں کرتا جنھوں نے تم سے دین کے بارے میں جنگ نہیں کی۔‘‘ [بخاري، الأدب، باب صلۃ الوالد المشرک : ۵۹۷۸ ] اسی طرح ایک دفعہ رسول اللہ صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ کو ایک ریشمی حلہ عطا فرمایا، انھوں نے وہ اپنے ایک مشرک بھائی کو دے دیا جو مکہ میں رہتا تھا۔ [ بخاري، الأدب، باب صلۃ الأخ المشرک : ۵۹۸۱ ]"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { اِنَّمَا يَنْهٰىكُمُ اللّٰهُ عَنِ الَّذِيْنَ قٰتَلُوْكُمْ فِي الدِّيْنِ … :} ان لوگوںں سے مراد وہ کفار ہیں جن کا تذکرہ شروع سورت سے آ رہا ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِذَا جَآءَكُمُ الْمُؤْمِنٰتُ مُهٰجِرٰتٍ … :} ان آیات میں مشرکین سے قطع تعلق کی وجہ سے پیش آنے والے کئی معاملات کا حکم بیان فرمایا، مثلاً کفار کی بیویاں جو مسلمان ہو کر ہجرت کر کے مسلمانوں کے پاس آ جائیں، انھیں واپس کیا جائے گا یا نہیں اور میاں بیوی میں سے کسی ایک کے مسلمان ہو جانے سے ان کا باہمی نکاح باقی رہتا ہے یا نہیں وغیرہ۔ ¤ ➋ حدیبیہ کے موقع پر کفار کے نمائندے سہیل بن عمرو نے صلح کی جو شرائط طے کی تھیں ان میں سے ایک شرط جو مسلمانوں کو منظور نہ تھی مگر سہیل نے اس کے بغیر صلح کرنے سے انکار کر دیا، یہ تھی : [ لاَ يَأْتِيْكَ مِنَّا أَحَدٌ وَ إِنْ كَانَ عَلٰی دِيْنِكَ إِلاَّ رَدَدْتَهُ إِلَيْنَا وَخَلَّيْتَ بَيْنَنَا وَبَيْنَهُ ] [ بخاري، المغازي، باب غزوۃ الحدیبیۃ : ۴۱۸۰،۴۱۸۱ ] ’’ہم میں سے جو بھی آپ کے پاس آئے گا خواہ وہ آپ کے دین پر ہو، آپ اسے ہماری طرف واپس کریں گے اور ہمارے اور اس کے درمیان کوئی دخل نہیں دیں گے۔‘‘ اللہ تعالیٰ کا عجیب تصرف دیکھیے کہ سہیل اس میں یہ صراحت نہ لکھوا سکا کہ اس میں عورتیں بھی شامل ہیں۔ صحیح بخاری کی ایک روایت میں ہے : [ فَقَالَ سُهَيْلٌ وَ عَلٰی أَنَّهُ لاَ يَأْتِيْكَ مِنَّا رَجُلٌ وَ إِنْ كَانَ عَلٰی دِيْنِكَ إِلاَّ رَدَدْتَهُ إِلَيْنَا ] [بخاري، الشروط، باب الشروط في الجہاد و المصالحۃ … : ۲۷۳۱، ۲۷۳۲ ] ’’سہیل نے کہا، یہ شرط بھی کہ ہماری طرف سے جو آدمی بھی آپ کے پاس جائے گا، چاہے وہ آپ کے دین ہی پر کیوں نہ ہو، آپ اسے ہمیں واپس کر دیں گے۔‘‘ اب اس کے بعد کفار یہ کہہ ہی نہیں سکتے تھے کہ آپ مسلمان ہونے والی عورتوں کو واپس کیوں نہیں کرتے۔ جب معاہدہ طے ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے تمام صحابہ کو قربانی کرنے اور سر منڈوانے کے ساتھ احرام کھولنے کا حکم دے دیا۔ اس موقع پر سہیل کا بیٹا ابو جندل رضی اللہ عنہ مسلمان ہو کر آیا تو رسول اللہ صلی اللہ علیہ وسلم نے اس کے باپ کے مطالبے پر اسے واپس کر دیا، اس کے علاوہ بھی صلح کی اس مدت میں آپ کے پاس مکہ سے جو مرد آیا آپ نے اسے واپس کر دیا خواہ وہ مسلمان ہی تھا۔ اب کئی عورتیں جو ایمان لے آئی تھیں ہجرت کر کے مدینہ پہنچیں، ان میں ام کلثوم بنت عقبہ بن ابی معیط بھی تھیں۔ اس وقت وہ جوان تھیں، ان کے گھر والے رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور انھیں واپس کر دینے کا مطالبہ کیا تو اللہ تعالیٰ نے ہدایات نازل فرمائیں۔ [ بخاري، المغازي، باب غزوۃ الحدیبیۃ : ۴۱۸۰،۴۱۸۱ ] ¤ ➌ { فَامْتَحِنُوْهُنَّ اَللّٰهُ اَعْلَمُ بِاِيْمَانِهِنَّ … :} ایمان والوں کو مخاطب کر کے فرمایا کہ جب مومن عورتیں ہجرت کر کے تمھارے پاس آئیں تو ان کی جانچ پڑتال کرو کہ وہ ایمان ہی کی وجہ سے ہجرت کر کے آئی ہیں یا کوئی اور وجہ ہے۔ اس جانچ پڑتال میں تم اس بات کے مکلف نہیں کہ ان کے دل میں چھپی ہوئی بات معلوم کرو، یہ اللہ تعالیٰ کا کام ہے، تمھارا کام یہ ہے کہ ہ اگر وہ ان باتوں کا عہد کریں جو اگلی آیت (۱۲) میں آ رہی ہیں تو انھیں کفار کی طرف واپس مت کرو۔ یہاں یہ بات قابل ذکر ہے کہ اللہ تعالیٰ نے ہجرت کر کے آنے والے کسی مرد کے امتحان کا حکم نہیں دیا، کیونکہ ان کے امتحان کے لیے ہجرت اور جہاد کافی ہے۔ اللہ تعالیٰ نے تمام مہاجرین کے صادق الایمان ہونے کی شہادت دی ہے۔ (دیکھیے حشر : ۸) جب کہ عورتوں پر جہاد فرض نہیں جس سے کھرے کھوٹے کی تمیز ہوتی ہے۔ (شنقیطی) ¤ ➍ { لَا هُنَّ حِلٌّ لَّهُمْ وَ لَا هُمْ يَحِلُّوْنَ لَهُنَّ:} اس میں انھیں واپس نہ کرنے کی علت بیان فرمائی ہے کہ نہ مومن عورتیں کفار کے لیے حلال ہیں اور نہ ہی کافر مرد مومن عورتوں کے لیے حلال ہیں، اس لیے اگر کوئی عورت مسلمان ہو جائے تو اسے اس کے کافر خاوند سے جدا کر لیا جائے گا۔ پھر اگر وہ اپنے خاوند کے مسلمان ہونے کا انتظار کرے اور خاوند مسلمان ہو جائے تو نکاح برقرار رہے گا، خواہ عورت پہلے ہجرت کر کے آئی ہو اور خاوند بعد میں ہجرت کرے، جیسا کہ ابن عباس رضی اللہ عنھما سے مروی ہے، انھوں نے فرمایا : [ رَدَّ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّم ابْنَتَهُ زَيْنَبَ عَلٰی أَبِي الْعَاصِ بْنِ الرَّبِيْعِ، بَعْدَ سِتِّ سِنِيْنَ بِالنِّكَاحِ الْأَوَّلِ وَلَمْ يُحْدِثْ نِكَاحًا ] [ترمذي، النکاح، باب ما جاء في الزوجین المشرکین یسلم أحدھما : ۱۱۴۳، وقال الألباني صحیح ] ’’رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیٹی زینب رضی اللہ عنھا کو ابو العاص بن ربیع رضی اللہ عنہ کے ساتھ چھ سال کے بعد پہلے نکاح ہی میں واپس بھیج دیا اور نیا نکاح نہیں کیا۔‘‘ اور اگر عورت اپنے خاوند کے مسلمان ہونے کا انتظار نہ کرے تو اسے اجازت ہے کہ کسی مسلمان کے ساتھ نکاح کر لے، جیسا کہ آگے آ رہا ہے۔ ¤ ➎ { وَ اٰتُوْهُمْ مَّاۤ اَنْفَقُوْا:} یعنی ہجرت کر کے آنے والی مسلم عورتوں کے مشرک خاوندوں نے ان کے نکاح پر جو خرچ کیا ہے وہ انھیں واپس کر دو۔ یاد رہے کہ یہ احکام ان مشرکین کی عورتوں کے بارے میں ہیں جن کی مسلمانوں کے ساتھ صلح ہو۔ ¤ ➏ {وَ لَا جُنَاحَ عَلَيْكُمْ اَنْ تَنْكِحُوْهُنَّ اِذَاۤ اٰتَيْتُمُوْهُنَّ اُجُوْرَهُنَّ:} یعنی اگر وہ اپنے خاوندوں کے مسلمان ہو کر آنے کا انتظار نہ کریں اور نکاح کرنا چاہیں تو مسلمانوں کو ان سے نکاح کرنے کی اجازت ہے، جب ان شرطوں کو ملحوظ رکھا جائے جو نکاح کے لیے ضروری ہیں، مثلاً ولی کی اجازت، عدت پوری ہونا، مہر کی ادائیگی وغیرہ۔ ¤ ➐ {وَ لَا تُمْسِكُوْا بِعِصَمِ الْكَوَافِرِ: ’’عِصَمٌ‘‘ ’’عِصْمَةٌ‘‘} کی جمع ہے، مراد نکاح ہے اور {’’ الْكَوَافِرِ ‘‘ ’’كَافِرَةٌ‘‘} کی جمع ہے، جیسے {’’ضَارِبَةٌ‘‘} کی جمع {’’ضَوَارِبُ‘‘} ہے، کافر عورتیں۔ یعنی جو مرد مسلمان ہو جائیں اور ان کی بیویاں کفر پر قائم رہیں ان کے لیے انھیں اپنے نکاح میں باقی رکھنا جائز نہیں، بلکہ طلاق دے دینا لازم ہے۔ چنانچہ مسور اور مروان بن حکم سے مروی ہے کہ جب رسول اللہ صلی اللہ علیہ وسلم نے حدیبیہ کے دن کفار قریش سے معاہدہ کیا تو آپ کے پاس کچھ مومن عورتیں آئیں تو اللہ تعالیٰ نے یہ آیات نازل فرمائیں : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِذَا جَآءَكُمُ الْمُؤْمِنٰتُ مُهٰجِرٰتٍ … وَ لَا تُمْسِكُوْا بِعِصَمِ الْكَوَافِرِ » [ الممتحنۃ : ۱۰ ] ’’اے لوگو جو ایمان لائے ہو! جب تمھارے پاس مومن عورتیں ہجرت کر کے آئیں…اور کافر عورتوں کی عصمتیں روک کر نہ رکھو۔‘‘ تو عمر بن خطاب رضی اللہ عنہ نے اس دن اپنی دو (مشرک) عورتوں کو طلاق دے دی، جن میں سے ایک کے ساتھ معاویہ بن ابو سفیان نے اور دوسری کے ساتھ صفوان بن امیہ نے نکاح کر لیا (جو اس وقت مشرک تھے)۔ [ بخاري، الشروط، باب الشروط في الجہاد… : ۲۷۳۱،۲۷۳۲ ] ابن عباس رضی اللہ عنھما نے فرمایا کہ قریبہ بنت ابی امیہ عمر بن خطاب رضی اللہ عنہ کے نکاح میں تھی، انھوں نے اسے طلاق دے دی تو اس سے معاویہ بن ابو سفیان نے نکاح کر لیا اور ام حکم بنت ابو سفیان عیاض بن غنم فہری کے نکاح میں تھی، انھوں نے اسے طلاق دے دی تو اس سے عبداللہ بن عثمان ثقفی نے نکاح کر لیا۔ [ بخاري، الطلاق، باب نکاح من أسلم من المشرکات و عدتہن : ۵۲۸۷ ] ¤ ➑ {وَ سْـَٔلُوْا مَاۤ اَنْفَقْتُمْ وَ لْيَسْـَٔلُوْا مَاۤ اَنْفَقُوْا … :} اس کا عطف {’’ وَ اٰتُوْهُمْ مَّاۤ اَنْفَقُوْا ‘‘} پر ہے۔ ہجرت کر کے آنے والی عورتیں یا تو ان مشرکین میں سے ہوتی تھیں جن کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی جنگ تھی، ان کے متعلق عبداللہ بن عباس رضی اللہ عنھما نے فرمایا : ’’مشرکین کا تعلق رسول اللہ صلی اللہ علیہ وسلم اور مومنوں سے دو طرح کا تھا، ایک اہلِ حرب (لڑائی والے) مشرک، آپ صلی اللہ علیہ وسلم ان سے لڑتے اور وہ آپ صلی اللہ علیہ وسلم سے لڑتے تھے اور ایک اہل عہد (معاہدے والے) مشرک۔ اہل حرب مشرکین میں سے کوئی عورت جب ہجرت کر کے آتی تو اسے اس وقت تک نکاح کا پیغام نہیں دیا جاتا تھا جب تک وہ حیض آنے کے بعد پاک نہیں ہوتی تھی۔ جب پاک ہو جاتی تو اس کے لیے نکاح حلال ہو جاتا، پھر اگر اس کا خاوند اس کے نکاح کرنے سے پہلے ہجرت کر کے آ جاتا تو وہ اسے واپس کر دی جاتی اور اگر ان کا کوئی غلام یا لونڈی ہجرت کر کے آتے تو دونوں آزاد ہو جاتے اور انھیں وہ حقوق حاصل ہو جاتے جو دوسرے مہاجرین کو حاصل تھے۔ (پھر معاہدے والوں کے متعلق مجاہد کی حدیث کی طرح ذکر کیا) اور اگر معاہدے والے مشرکین کا کوئی غلام یا لونڈی ہجرت کر کے آتے تو انھیں واپس نہیں کیا جاتا تھا اور ان کی قیمتیں دے دی جاتی تھیں۔‘‘ [ بخاري، الطلاق، باب نکاح من أسلم من المشرکات وعدتھن : ۵۲۸۶ ] ¤ ہجرت کر کے آنے والی مسلمان عورتوں کی دوسری قسم ان مشرکین کی بیویاں تھیں جن کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کا معاہدۂ صلح تھا۔ اس آیت میں ان کا حکم بیان ہوا ہے کہ انھیں مشرکین کی طرف واپس مت کرو، بلکہ انھوں نے ان کے نکاح پر جو کچھ خرچ کیا ہے وہ انھیں دے دو اور کافر عورتوں کو بھی روک کر مت رکھو، بلکہ انھیں طلاق دے دو اور چونکہ تمھاری آپس میں صلح ہے اس لیے جن مشرک عورتوں کو تم نے چھوڑا ہے ان پر کیا ہوا خرچ تم مشرکین سے مانگ لو اور وہ ان عورتوں پر کیا ہوا خرچ تم سے مانگ لیں جو ہجرت کر کے تمھارے پاس آئی ہیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {وَ اِنْ فَاتَكُمْ شَيْءٌ مِّنْ اَزْوَاجِكُمْ اِلَى الْكُفَّارِ …:} یعنی اگر کافر ان عورتوں کا مہر مسلمانوں کو واپس نہ کریں جو کافر ہو کر یا کافر رہ کر دارالاسلام سے کفار کے ہاں چلی جائیں تو مسلمانوں کو چاہیے کہ کافروں کا جو مال لوٹیں اس میں سے ان مسلمان شوہروں کا خرچ ادا کریں جن کی بیویاں دارالکفر کو بھاگ جائیں، یا دار الکفر سے جو عورتیں مسلمان ہو کر دارالاسلام میں آ جائیں ان کے مہر کافروں کو واپس کرنے کے بجائے ان مسلمان شوہروں کو ادا کریں جن کی بیویاں دار الکفر کو بھاگ جائیں۔ {’’ فَعَاقَبْتُمْ ‘‘} (پھر تم بدلا حاصل کرو ) کے مفہوم میں دونوں چیزیں شامل ہیں، یعنی لڑائی میں مال غنیمت حاصل کرنا یا مقابلہ میں ان کی عورتوں کا مہر ادا کرنا۔ ابن کثیر لکھتے ہیں، اس {’’ فَعَاقَبْتُمْ ‘‘} کے مفہوم میں وسعت ہے، اگر کفار کا مہر ادا کرنا باقی ہو تو مسلمانوں کو وہ دے دیا جائے، ورنہ مال غنیمت سے اس کے نقصان کی تلافی کر دی جائے۔ ابنِ جریر نے اسی کو ترجیح دی ہے۔ (اشرف الحواشی)"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ {يٰۤاَيُّهَا النَّبِيُّ اِذَا جَآءَكَ الْمُؤْمِنٰتُ يُبَايِعْنَكَ … :} عائشہ رضی اللہ عنھا نے بیان کیا کہ جو مومن عورتیں آپ صلی اللہ علیہ وسلم کی طرف ہجرت کر کے آتیں آپ ان کا امتحان اللہ تعالیٰ کے اس فرمان کے ساتھ لیتے تھے : « يٰۤاَيُّهَا النَّبِيُّ اِذَا جَآءَكَ الْمُؤْمِنٰتُ يُبَايِعْنَكَ … غَفُوْرٌ رَّحِيْمٌ » تو ان مومن عورتوں میںں سے جو اس شرط کا اقرار کر لیتی رسول اللہ صلی اللہ علیہ وسلم اسے فرماتے : [ قَدْ بَايَعْتُكِ ] ’’میں نے تم سے بیعت لے لی۔‘‘ صرف کلام کے ساتھ اور اللہ کی قسم! آپ صلی اللہ علیہ وسلم کے ہاتھ نے بیعت لیتے وقت کسی عورت کے ہاتھ کو نہیں چھوا، آپ ان سے صرف ان الفاظ کے ساتھ بیعت لیتے تھے : [ قَدْ بَايَعْتُكِ عَلٰی ذٰلِكَ ] [ بخاري، التفسیر، سورۃ الممتحنۃ، باب : «إذا جاء کم المؤمنات مھاجرات» : ۴۸۹۱ ] ’’میں نے ان باتوں پر تم سے بیعت لے لی۔‘‘ امیمہ بنت رقیقہ رضی اللہ عنھا بیان کرتی ہیں کہ میں چند عورتوں کے ہمراہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آپ سے بیعت کرنے کے لیے آئی، تو آپ صلی اللہ علیہ وسلم نے ہم سے قرآن کی اس آیت کے مطابق بیعت لی : « عَلٰۤى اَنْ لَّا يُشْرِكْنَ بِاللّٰهِ شَيْـًٔا …» اور فرمایا: [ فِيْمَا اسْتَطَعْتُنَّ وَأَطَقْتُنَّ ] ’’جتنی تم استطاعت اور طاقت رکھو۔‘‘ ہم نے کہا : ’’اللہ اور اس کا رسول ہم سے زیادہ ہم پر رحم کرنے والے ہیں۔‘‘ ہم نے کہا : ’’یا رسول اللہ! کیا آپ ہم سے مصافحہ نہیں کرتے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : [ إِنِّيْ لاَ أُصَافِحُ النِّسَاءَ إِنَّمَا قَوْلِيْ لاِمْرَأَةٍ وَاحِدَةٍ كَقَوْلِيْ لِمِائَةِ امْرَأَةٍ ] [ مسند أحمد : 357/6، ح : ۲۷۰۰۹۔ ترمذي، السیر، باب ما جاء في بیعۃ النساء : ۱۵۹۷، وصححہ الترمذي والألباني ] ’’میں عورتوں سے مصافحہ نہیں کرتا، میری بات ایک عورت سے اسی طرح ہے جیسے ایک سو عورتوں سے ہو۔‘‘ ¤ ➋ جب رسول اللہ صلی اللہ علیہ وسلم نے بیعت جیسے اہم موقع پر کسی عورت سے مصافحہ نہیں کیا تو کسی اور کے لیے غیر محرم عورت سے مصافحہ کیسے جائز ہو سکتا ہے؟ کفار کی تقلید میں غیر محرم عورتوں سے مصافحے کا رواج اور تقدس کے پردے میں پیروں کا اجنبی عورتوں سے مصافحہ دونوں حرام ہیں، کیونکہ نیت کے خلل کے ساتھ وہ زنا کا پیش خیمہ ہو سکتے ہیں اور سد ذرائع (گناہ کے ذریعوں سے روکنا) شریعت کا مسلّم اصول ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فَالْعَيْنَانِ زِنَاهُمَا النَّظَرُ وَالْأُذُنَانِ زِنَاهُمَا الْاِسْتِمَاعُ وَاللِّسَانُ زِ زِنَاهُ الْكَلَامُ وَالْيَدُ زِنَاهَا الْبَطْشُ وَالرِّجْلُ زِنَاهَا الْخُطَا وَالْقَلْبُ يَهْوٰی وَيَتَمَنّٰی وَيُصَدِّقُ ذٰلِكَ الْفَرْجُ وَيُكَذِّبُهُ ] [ مسلم، القدر، باب قدر علی ابن آدم حظہ من الزنی وغیرہ : ۲۱ /۲۶۵۷ ] ’’پس آنکھیں، ان کا زنا دیکھنا ہے اور کان، ان کا زنا توجہ سے سننا ہے اور زبان، اس کا زنا کلام ہے اور ہاتھ، اس کا زنا پکڑنا ہے اور پاؤں، اس کا زنا چلنا ہے اور دل خواہش کرتا ہے اور تمنا کرتا ہے اور شرم گاہ اس کی تصدیق کر دیتی ہے یا اس کی تکذیب کر دیتی ہے۔‘‘ ¤ ➌ جاہلی معاشرے میں اللہ کے ساتھ شرک، چوری، زنا، قتل اولاد اور بہتان کا رواج عام تھا، اس لیے ان کا خاص طور پر ذکر کر کے ان سے منع فرمایا، جیسا کہ وفد عبدالقیس کو خاص طور پر ان برتنوں کے استعمال سے بھی منع فرما دیا جن میں شراب بنائی جاتی تھی، کیونکہ وہ مسلمان ہو چکے تھے مگر ابھی تک ان میں شراب نوشی کا رواج باقی تھا۔ رہی دوسری منع کردہ چیزیں یا وہ چیزیں جن پر عمل کا حکم دیا ہے، تو وہ سب {’’ وَ لَا يَعْصِيْنَكَ فِيْ مَعْرُوْفٍ ‘‘} میں آگئی ہیں۔ یہاں چونکہ عورتوں کی آمد کا ذکر ہے اس لیے ان کا نام لیا، ورنہ رسول اللہ صلی اللہ علیہ وسلم مردوں سے بھی انھی باتوں پر بیعت لیتے تھے۔ عبادہ بن صامت رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اس موقع پر جب آپ کے گرد آپ کے اصحاب کی ایک جماعت موجود تھی فرمایا : [ بَايِعُوْنِيْ عَلٰی أَنْ لاَ تُشْرِكُوْا بِاللّٰهِ  شَيْئًا، وَلاَ تَسْرِقُوْا، وَلاَ تَزْنُوْا، وَلاَ تَقْتُلُوْا أَوْلاَدَكُمْ، وَلاَ تَأْتُوْا بِبُهْتَانٍ تَفْتَرُوْنَهُ بَيْنَ أَيْدِيْكُمْ وَأَرْجُلِكُمْ، وَلاَ تَعْصُوْا فِيْ مَعْرُوْفٍ، فَمَنْ وَفٰی مِنْكُمْ فَأَجْرُهُ عَلَی اللّٰهِ، وَمَنْ أَصَابَ مِنْ ذٰلِكَ شَيْئًا فَعُوْقِبَ فِي الدُّنْيَا فَهُوَ كَفَّارَةٌ لَهُ، وَمَنْ أَصَابَ مِنْ ذٰلِكَ شَيْئًا ثُمَّ سَتَرَهُ اللّٰهُ فَهُوَ إِلَی اللّٰهِ، إِننْ شَاءَ عَفَا عَنْهُ وَ إِنْ شَاءَ عَاقَبَهُ، فَبَايَعْنَاهُ عَلٰی ذٰلِكَ ] [بخاري، الإیمان، باب علامۃ الإیمان حب الأنصار : ۱۸ ] ’’مجھ سے اس پر بیعت کرو کہ تم اللہ کے ساتھ کسی چیز کو شریک نہیں کرو گے اور چوری نہیں کرو گے اور زنا نہیں کرو گے اور اپنی اولاد کو قتل نہیں کرو گے اور کوئی بہتان نہیں لاؤ گے جسے تم اپنے ہاتھوں اور پاؤں کے درمیان گھڑ کر لا رہے ہو گے اور کسی نیک کام میں نافرمانی نہیں کرو گے۔ پھر تم میں سے جس نے اس عہد کو پورا کیا اس کا اجر اللہ پر ہے اور جس نے ان میں سے کوئی کام کر لیا، پھر اسے دنیا میں اس کی سزا مل گئی تو وہ اس کے لیے گناہ دور کرنے کا باعث ہے اور جس نے ان میں سے کوئی کام کیا، پھر اللہ نے اس پر پردہ ڈال دیا تو وہ اللہ کے سپرد ہے، اگر چاہے تو اسے معاف کر دے اور اگر چاہے تو اسے سزا دے۔‘‘ تو ہم نے اس پر آپ صلی اللہ علیہ وسلم سے بیعت کر لی۔‘‘ ¤ حدیبیہ اور فتح مکہ کے موقع پر ہجرت کر کے آنے والی عورتوں کے علاوہ بھی آپ صلی اللہ علیہ وسلم نے عورتوں سے ان باتوں پر بیعت لی ہے۔ چنانچہ ابن عباس رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم عید الفطر کے موقع پر مردوں کو خطبہ دینے کے بعد عورتوں کی طرف آئے اور فرمایا : « يٰۤاَيُّهَا النَّبِيُّ اِذَا جَآءَكَ الْمُؤْمِمِنٰتُ يُبَايِعْنَكَ …» پھر جب آپ آیت کی تلاوت سے فارغ ہوئے تو عورتوں کو مخاطب کر کے فرمایا : [ آنْتُنَّ عَلٰی ذٰلِكَ؟ ] ’’کیا تم اس پر قائم ہو؟‘‘ ان میں سے ایک عورت نے کہا، جس کے سوا کسی نے جواب نہیں دیا : [ نَعَمْ ] ’’جی ہاں!‘‘ [ بخاري، العیدین، باب موعظۃ الإمام النساء یوم العید : ۹۷۹] ¤ ➍ { وَ لَا يَقْتُلْنَ اَوْلَادَهُنَّ:} اس میں حمل گرانا بھی شامل ہے، خواہ جائز ہو یا ناجائز۔ ¤ ➎ { وَ لَا يَاْتِيْنَ بِبُهْتَانٍ يَّفْتَرِيْنَهٗ بَيْنَ اَيْدِيْهِنَّ وَ اَرْجُلِهِنَّ: ’’بُهْتَانٌ‘‘} کسی کے ذمے گھڑ کر لگایا ہوا جھوٹ جسے سن کر وہ مبہوت اور ششدر رہ جائے۔ اکثر مفسرین نے اس کی تفسیر یہ کی ہے کہ کوئی عورت کسی دوسری عورت کا بچہ لا کر خاوند اور دوسرے لوگوں کے سامنے یہ ظاہر کرے کہ اس کی ولادت اس کے شکم سے ہوئی ہے، خواہ وہ کوئی گرا ہوا بچہ اٹھا کر لے آئی ہو یا کسی اور طرح سے لے آئی ہو۔ ظاہر ہے یہ اسی وقت ہو سکتا ہے جب خاوند مدت تک غائب رہا ہو، یا خاوند کے بجائے کسی اور سے بچے کو جنم دے کر اسے خاوند کا بچہ ظاہر کرے۔ {’’ بَيْنَ اَيْدِيْهِنَّ وَ اَرْجُلِهِنَّ ‘‘} (ہاتھوں اور پاؤں کے درمیان) کا لفظ اس لیے استعمال فرمایا کہ بچہ پیدا ہوتا ہے تو اس کی ولادت عورت کے ہاتھوں اور پاؤں کے درمیان ہوتی ہے۔ مگر ’’بہتان‘‘ کو انھی صورتوں کے ساتھ خاص کرنا مشکل ہے، کیونکہ ایک تو بہتان کا لفظ عام ہے، پھر رسول اللہ صلی اللہ علیہ وسلم نے مردوں سے بیعت لی تو ان کے لیے بھی یہ الفاظ استعمال فرمائے : [ وَلاَ تَأْتُوْا بِبُهْتَانٍ تَفْتَرُوْنَهُ بَيْنَ أَيْدِيْكُمْ وَأَرْجُلِكُمْ ] [ بخاري : ۱۸ ] ’’اور نہ تم کوئی بہتان لاؤ گے جو اپنے ہاتھوں اور اپنے پاؤں کے درمیان گھڑ رہے ہوں۔‘‘ جیسا کہ پچھلے فائدے میں یہ حدیث گزری ہے۔ ظاہر ہے بہتان کی یہ صورتیں مردوں سے متعلق تصور نہیں کی جا سکتیں۔ عربی زبان میں {’’بَيْنَ أَيْدِيْهِمْ‘‘} کا معنی ’’سامنے‘‘ ہوتا ہے، جیسا کہ فرمایا : «يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ » [ البقرۃ : ۲۵۵ ] ’’وہ جانتا ہے جو کچھ ان کے سامنے ہے۔‘‘ {’’ وَأَرْجُلِهِمْ‘‘} کا لفظ اس کی تاکید کے لیے ہے، اس لیے اس کا سادہ مفہوم یہ معلوم ہوتا ہے کہ جس بات کا وجود ہی نہیں اسے گھڑ کر پوری ڈھٹائی کے ساتھ اپنے سامنے لا کر پیش نہ کر دیا کریں۔ اور یہ بھی مراد ہو سکتا ہے کہ اس بات کی پروا نہ کرتے ہوئے کہ قیامت کے دن ان کے ہاتھ اور پاؤں ان کے خلاف شہادت دیں گے، وہ اپنے ہاتھوں اور پاؤں کے سامنے کسی پر بہتان نہ لگا دیا کریں، بلکہ انھیں چاہیے کہ اس بات کا خیال رکھیں کہ وہ چار گواہوں کی موجودگی میں بہتان لگا رہی ہیں۔ اس مطلب کی تائید دوسری جگہ بہتان باندھنے والوں کے ملعون ہونے کے سلسلے میں ہاتھوں اور پاؤں کی شہادت کے ذکر سے ہوتی ہے، جیسا کہ فرمایا: « اِنَّ الَّذِيْنَ يَرْمُوْنَ الْمُحْصَنٰتِ الْغٰفِلٰتِ الْمُؤْمِنٰتِ لُعِنُوْا فِي الدُّنْيَا وَ الْاٰخِرَةِ وَ لَهُمْ عَذَابٌ عَظِيْمٌ (23) يَّوْمَ تَشْهَدُ عَلَيْهِمْ اَلْسِنَتُهُمْ وَ اَيْدِيْهِمْ وَ اَرْجُلُهُمْ بِمَا كَانُوْا يَعْمَلُوْنَ (24) يَوْمَىِٕذٍ يُّوَفِّيْهِمُ اللّٰهُ دِيْنَهُمُ الْحَقَّ وَ يَعْلَمُوْنَ اَنَّ اللّٰهَ هُوَ الْحَقُّ الْمُبِيْنُ » [ النور : ۲۳ تا ۲۵ ] ’’بے شک وہ لوگ جو پاک دامن، بے خبر مومن عورتوں پر تہمت لگاتے ہیں وہ دنیا اور آخرت میں لعنت کیے گئے اور ان کے لیے بہت بڑا عذاب ہے۔ جس دن ان کی زبانیں اور ان کے ہاتھ اور ان کے پاؤں ان کے خلاف اس کی شہادت دیں گے جو وہ کیا کرتے تھے۔ اس دن اللہ انھیں ان کا صحیح بدلا پورا پورا دے گا اور وہ جان لیں گے کہ اللہ تعالیٰ ہی حق ہے، جو ظاہر کرنے والا ہے۔‘‘ الغرض آیت میں بہتان کی ایک صورت نہیں بلکہ ہر قسم کے بہتان سے اجتناب کا عہد لیا گیا ہے۔ ¤ ➏ { وَ لَا يَعْصِيْنَكَ فِيْ مَعْرُوْفٍ:} اس جملے میں پوری شریعت پر عمل کا اقرار آگیا۔ اس اقرار میں {’’ فِيْ مَعْرُوْفٍ ‘‘} کی شرط لگانے کی کئی توجیہیں ہیں، ایک یہ کہ اس سے اس بات کی صراحت مقصود ہے کہ رسول حکم ہی معروف کا دیتا ہے، پھر اس کی معصیت کی کیا گنجائش ہو سکتی ہے۔ دوسری یہ کہ اگرچہ یہ بات ظاہر ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا حکم معروف کے سوا ہو ہی نہیں سکتا، مگر اس کے ساتھ {’’ مَعْرُوْفٍ ‘‘} (نیک) ہونے کی قید اس لیے لگائی تاکہ سب کو معلوم ہو جائے کہ مخلوق کی اطاعت اللہ تعالیٰ کی نافرمانی کے کام میں جائز نہیں، یہاں تک کہ رسول کی اطاعت بھی اس شرط کے ساتھ مشروط ہے۔ تیسری یہ کہ یہاں معاملہ عورتوں کا ہے، ان کو مطلق اطاعت کے حکم سے کہ وہ آپ کے کسی حکم کی نافرمانی نہیں کریں گی، شیطان کسی کے دل میں گمراہی کا وسوسہ پیدا کر سکتا تھا، اس کا راستہ روکنے کے لیے یہ قید لگا دی۔ ¤ ➐ رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی کئی صورتیں مروی ہیں، جن میں سے ایک اسلام کی بیعت ہے، ایک جہاد کی، ایک بعض باتوں کی پابندی کی، مثلاً یہ کہ وہ کسی سے سوال نہیں کریں گے اور ایک کبائر سے توبہ اور اطاعت کے عہد کی۔ آپ صلی اللہ علیہ وسلم کے بعد صحابہ کرام سے یہ تو ثابت ہے کہ انھوں نے لوگوں سے اسلام لانے کی بیعت لی اور امراء سے اطاعت کی بیعت کی، مگر خلیفہ یا امیر کے علاوہ کسی اور شخص کا لوگوں سے اپنا مرید بنانے کی بیعت لینا، جیسا کہ صوفیہ کا طریقہ ہے، صحابہ کرام کے دور بلکہ پورے خیر القرون میں ثابت نہیں، کیونکہ اس سے مسلمانوں میں فرقے اور گروہ پیدا ہوتے ہیں۔ پھر یہ معاملہ نقشبندی، سہروردی، چشتی اور قادری تک محدود نہیں رہتا، بلکہ ہر ایک اپنی الگ گدی اور الگ حلقہ قائم کر لیتا ہے جو صرف اس کے حکم کا پابند ہوتا ہے اور ہر پیر و مرشد کا تقاضا ہوتا ہے کہ مرید کا علم چونکہ ناقص ہے اس لیے اگر اس کا مرشد اسے شریعت کے صریح خلاف حکم دے تو وہ بھی اس کے لیے ماننا ضروری ہے، کیونکہ اس میں بھی کوئی نہ کوئی حکمت پوشیدہ ہوتی ہے۔ ان حضرات نے {’’ فِيْ مَعْرُوْفٍ ‘‘} کی قید بھی اڑا دی، چنانچہ ان کے لسان الغیب حافظ شیرازی کہہ گئے ہیں: ¤ بمے سجادہ رنگین کن گرت پیر مغاں گوید ¤ کہ سالک بے خبر نبود زراہ و رسم منزلہا ¤ ’’اگر پیر مغاں تمھیں حکم دیتا ہے تو مصلے کو شراب سے رنگ لو، کیونکہ سالک منزلوں کے راہ و رسم سے بے خبر نہیں ہوتا۔‘‘ حقیقت یہ ہے کہ پیری مریدی کا یہ سلسلہ امت کے کتاب و سنت سے دوری اور اس کے باہمی افتراق کا خوف ناک باعث ہے۔ آپ لاکھ قرآن و سنت سنائیں، پیر کے ہاتھ میں ہاتھ دینے والا یہی کہے گا کہ کیا ہمارے پیر کو یہ معلوم نہیں۔ رہی یہ بات کہ ہم بطور استاذ اور ہادی پیر کی بیعت کرتے ہیں، تو ایک تو اس کے لیے بیعت کی ضرورت نہیں، پھر اپنے آپ کو ایک ہی استاذ اور ہادی کے حکم کا پابند بنانا کہاں سے ثابت ہوا؟ آپ متعدد اساتذہ اور رہنماؤں سے تعلیم اور رہنمائی حاصل کر سکتے ہیں اور کرنی چاہیے۔ ہاں، رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی ہر صورت ہی درست تھی، کیونکہ وہ نبی تھے، ان کے ہوتے کسی اور کی بیعت نہ تھی اور نہ ہی اس سے افتراق یا انتشار پیدا ہونے کا خدشہ تھا۔ پھر خلیفہ اور امیر کی بیعت درست ہے، کیونکہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم نے اس کا حکم دیا ہے اور ایک خلیفہ کے ہوتے ہوئے کسی اور کی بیعت جائز نہیں۔ ¤ ➑ { فَبَايِعْهُنَّ وَ اسْتَغْفِرْ لَهُنَّ اللّٰهَ اِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ:} یعنی اگر وہ ان باتوں کا عہد کریں تو آپ ان کی بیعت قبول کر لیں اور اس سے پہلے ان سے جو لغزشیں ہوئیں یا آئندہ بشری کمزوری کی بنا پر ہوں گی ان کے لیے اللہ تعالیٰ سے استغفار کریں، کیونکہ اللہ تعالیٰ غفور و رحیم ہے۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَوَلَّوْا قَوْمًا غَضِبَ اللّٰهُ عَلَيْهِمْ:} سورت کے شروع میں {’’ لَا تَتَّخِذُوْا عَدُوِّيْ وَ عَدُوَّكُمْ اَوْلِيَآءَ ‘‘} میں مشرکین کی دوستی سے منع فرمایا تھا، آخر میں یہود کی دوستی سے منع فرمایا۔ قرآن مجید میں {’’مغضوب عليهم‘‘} عموماً یہود کو کہا گیا ہے۔ دیکھیے سورۂ فاتحہ میں {’’ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ ‘‘} کی تفسیر۔ ¤ ➋ {قَدْ يَىِٕسُوْا مِنَ الْاٰخِرَةِ كَمَا يَىِٕسَ الْكُفَّارُ مِنْ اَصْحٰبِ الْقُبُوْرِ:} اس آیت کی تفسیر دو طرح سے کی گئی ہے، ایک یہ کہ {’’ مِنْ ‘‘} بیانیہ ہے اور {’’ اَصْحٰبِ الْقُبُوْرِ ‘‘ ’’ الْكُفَّارُ ‘‘} کا بیان ہے۔ یعنی ان لوگوں کو دوست مت بناؤ جن پر اللہ تعالیٰ غصے ہو گیا، (کیونکہ انھوں نے حق کو جانتے ہوئے اور یہ پہچانتے ہوئے کہ آپ صلی اللہ علیہ وسلم سچے نبی ہیں، آپ پر ایمان لانے سے انکار کر دیا، اس لیے) وہ آخرت (کی ہر خیر) سے نا امید ہو چکے، جس طرح وہ کافر آخرت (کی ہر خیر) سے ناامید ہو چکے جو قبروں والوں میں سے ہیں، یعنی وہ کافر جو فوت ہو چکے اور اپنی آنکھوں سے اپنے عذاب کو دیکھ کر ہر خیر سے مایوس ہو چکے، ان کی طرح یہ یہودی بھی جان بوجھ کر حق کو جھٹلانے کی وجہ سے آخرت (کی ہر بھلائی) سے مایوس ہیں، سو انھیں دوست مت بناؤ۔ متن میں ترجمہ اسی مفہوم کے مطابق کیا گیا ہے اور طبری نے اسی معنی کو ترجیح دی ہے۔ دوسری تفسیر یہ ہے کہ {’’ مِنْ ‘‘} ابتدائیہ ہے اور مطلب یہ ہے کہ ان لوگوں کو دوست مت بناؤ جن پر اللہ تعالیٰ غصے ہوا، جو آخرت کے واقع ہونے سے اسی طرح ناامید ہیں جس طرح کفار قبروں والوں کے واپس آنے سے ناامید ہو چکے ہیں۔ یہ دونوں تفسیریں درست ہیں۔ ¤ ➌ بعض اہلِ علم نے {’’مغضوب عليهم‘‘} کو عام رکھا ہے اور فرمایا ہے کہ جس طرح {’’ عَدُوِّيْ وَ عَدُوَّكُمْ ‘‘} کے الفاظ عام ہیں، اسی طرح {’’مغضوب عليهم‘‘} کے الفاظ بھی عام ہیں، ان میں یہود و نصاریٰ اور مشرکین و منافقین سبھی شامل ہیں اور اللہ تعالیٰ نے سبھی کی دوستی سے منع فرمایا ہے اور ان سب پر اللہ کا غضب بھی ہے۔ سبھی آخرت میں کسی بھی خیر کی توقع سے محروم ہیں اور سب کافر اس بات سے بھی ناامید ہو چکے ہیں کہ مرنے والے ان کے پاس دوبارہ آئیں گے۔ قرآن مجید میں یہود کے علاوہ دوسرے کفار کے لیے بھی ’’غضب‘‘ کا لفظ آیا ہے۔ دیکھیے سورۂ اعراف (۷۱)، نحل (۱۰۶)، شوریٰ (۱۶) اور سورۂ فتح (۶)۔"
    }
  ]
}