{
  "surah": "Al-Jumu'a",
  "surah_number": 62,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کی نماز میں سورۂ جمعہ اور سورۂ منافقون پڑھا کرتے تھے۔ [ مسلم، الجمعۃ، باب ما یقرأ في صلاۃ الجمعۃ : ۸۷۷ ] ¤ (آیت 1) ➊ {يُسَبِّحُ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ … : } اس آیت کے معانی سورۂ حدید(۱) اور سورۂ حشر (۱، ۲۴) میں گزر چکے ہیں۔ اس سے پہلے تمام سورتوں کی ابتدا میں {’’ سَبَّحَ ‘‘} ماضی کے صیغے کے ساتھ آ یا ہے، یہاںمضارع کا صیغہ استعمال ہوا ہے جو حال اور استقبال کے لیے ہے، جس میں تجدد اور استمرار پایا جاتا ہے۔ مقصد یہ ہے کہ کائنات کی ہر چیز ہر عیب اور کمی سے اللہ تعالیٰ کے ہمیشہ پاک ہونے کی شہادت دے رہی ہے اور ہمیشہ دیتی رہے گی۔ ¤ ➋ اس آیت میں بیان کردہ اللہ تعالیٰ کی صفات کا آئندہ آیت کے ساتھ تعلق اسی کی تفسیر میں آ رہا ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { هُوَ الَّذِيْ بَعَثَ فِي الْاُمِّيّٖنَ رَسُوْلًا مِّنْهُمْ:} اس آیت کو دلیل بنا کر بعض اہل کتاب کہتے ہیں کہ محمد( صلی اللہ علیہ وسلم ) صرف عربوں کے لیے رسول تھے، کیونکہ {’’ الْاُمِّيّٖنَ ‘‘} عرب قوم کو کہتے ہیں، لہٰذا آپ غیر عرب لوگوں اور یہود و نصاریٰ کے لیے رسول نہیں تھے۔ لیکن ان کی یہ بات درست نہیں، کیونکہ قرآن مجید میں{’’ الْاُمِّيّٖنَ ‘‘} کا لفظ ایک معنی میں نہیں بلکہ مختلف مواقع پر مختلف معانی کے لیے آیا ہے۔ کہیں وہ اہلِ کتاب کے مقابلے میں ان لوگوں کے لیے استعمال کیا گیا ہے جن کے پاس کوئی آسمانی کتاب نہیں ہے، جیسا کہ فرمایا : «وَ قُلْ لِّلَّذِيْنَ اُوْتُوا الْكِتٰبَ وَ الْاُمِّيّٖنَ ءَاَسْلَمْتُمْ» [ آل عمران : ۲۰ ] ’’اور ان لوگوں سے جنھیں کتاب دی گئی ہے اور اُمیوں (ان پڑھ لوگوں) سے کہہ دے کیا تم تابع ہو گئے؟ ‘‘ یہاں اُمیوں سے مراد مشرکینِ عرب ہیں، انھیں اہل کتاب (یہودو نصاریٰ) سے الگ گروہ قرار دیا گیاہے۔کہیں یہ لفظ خود اہلِ کتاب کے ان پڑھ لوگوں کے لیے استعمال ہوا ہے، جیسے فرمایا : «وَ مِنْهُمْ اُمِّيُّوْنَ لَا يَعْلَمُوْنَ الْكِتٰبَ اِلَّاۤ اَمَانِيَّ » [ البقرۃ : ۷۸ ] ’’اور ان میں سے کچھ اُمی (ان پڑھ) ہیں، جو کتاب کا علم نہیں رکھتے سوائے چند آرزوؤں کے۔‘‘ اور کسی جگہ یہ لفظ خالص یہودی اصطلاح کے طور پر استعمال ہوا ہے، جس کے مطابق اس سے مراد وہ سب لوگ ہیں جو یہودی نہیں ہیں، جیسا کہ فرمایا : « ذٰلِكَ بِاَنَّهُمْ قَالُوْا لَيْسَ عَلَيْنَا فِي الْاُمِّيّٖنَ سَبِيْلٌ» [ آل عمران : ۷۵ ] ’’یہ اس لیے کہ انھوں نے کہا ہم پر اَن پڑھوں کے بارے میں (گرفت کا) کوئی راستہ نہیں۔‘‘ یعنی ان کے اندر غیر یہود کا مال مار کھانے کی بد دیانتی پیدا ہونے کاسبب یہ ہے کہ انھوں نے کہا کہ اُمیوں کے بار ے میں ہم پر گرفت کا کوئی راستہ نہیں۔ یہود کی اس اصطلاح کا پس منظر یہ ہے کہ وہ اپنے سوا کسی کے متعلق تسلیم کرنے کے لیے تیار ہی نہ تھے کہ ان میں کوئی نبی مبعوث ہو سکتا ہے، یا انھیں آسمانی کتاب مل سکتی ہے۔ (دیکھیے آل عمران : ۷۳) وہ اپنے سوا تمام اقوام کو ناشائستہ، بد مذہب اور حقیر و ذلیل سمجھتے تھے۔ ¤ زیر تفسیر آیات میں {’’ الْاُمِّيّٖنَ ‘‘} سے مراد صرف عرب نہیں، یہودی اصطلاح کے مطابق وہ سب لوگ ہیں جو یہودی نہیں، کیونکہ یہاں {’’ الْاُمِّيّٖنَ ‘‘} کے تحت دو قسم کے لوگوں کا ذکر ہے، یعنی {’’ هُوَ الَّذِيْ بَعَثَ فِي الْاُمِّيّٖنَ رَسُوْلًا مِّنْهُمْ ‘‘} میں عرب ’’امیین‘‘ کا ذکر ہے، جنھیں یہ شرف حاصل ہے کہ رسول اللہ صلی اللہ علیہ وسلم نسباً ان میں سے تھے اور اس سے اگلی آیت میں غیر عرب امیین کا ذکر ہے جو بعد میں اسلام لانے والے تھے، اس میں فرمایا : « وَ اٰخَرِيْنَ مِنْهُمْ لَمَّا يَلْحَقُوْا بِهِمْ وَ هُوَ الْعَزِيْزُ الْحَكِيْمُ» ’’اور ان (امیین) میں سے کچھ اور لوگوں میں بھی (اس رسول کو بھیجا) جو ابھی تک ان سے نہیں ملے اور وہی سب پر غالب، کمال حکمت والا ہے۔‘‘ اس کی دلیل کہ ان امیین سے مراد غیر عرب ہیں، ابو ہریرہ رضی اللہ عنہ کی حدیث ہے، وہ فرماتے ہیں : [ كُنَّا جُلُوْسًا عِنْدَ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَأُنْزِلَتْ عَلَيْهِ سُوْرَةُ الْجُمُعَةِ : « وَ اٰخَرِيْنَ مِنْهُمْ لَمَّا يَلْحَقُوْاا بِهِمْ» قَالَ قُلْتُ مَنْ هُمْ يَا رَسُوْلَ اللَّهِ!؟ فَلَمْ يُرَاجِعْهُ حَتّٰی سَأَلَ ثَلاَثًا، وَفِيْنَا سَلْمَانُ الْفَارِسِيُّ، وَضَعَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يَدَهُهُ عَلٰی سَلْمَانَ ثُمَّ قَالَ لَوْ كَانَ الْإِيْمَانُ عِنْدَ الثُّرَيَّا لَنَالَهُ رِجَالٌ أَوْ رَجُلٌ مِنْ هٰؤُلاَءِ ] [بخاري، التفسیر، سورۃ الجمعۃ : ۴۸۹۷ ] ’’ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے تھے توآپ پر سورۂ جمعہ نازل ہوئی : « وَ اٰخَرِيْنَ مِنْهُمْ لَمَّا يَلْحَقُوْا بِهِمْ » میں نے پوچھا : ’’یا رسول اللہ! یہ کون لوگ ہیں؟‘‘ آپ نے جواب نہ دیا، یہاں تک کہ میں نے تین مرتبہ سوال کیا۔ ہم میں سلمان فارسی رضی اللہ عنہ بھی موجود تھے، رسول اللہ صلی اللہ علیہ وسلم نے اپنا ہاتھ سلمان پر رکھا، پھر فرمایا :’’اگر ای ایمان ثریا کے پاس بھی ہوتا تو ان لوگوں میں سے کچھ آدمی یا (فرمایا) ایک آدمی اسے ضرور حاصل کر لیتا۔‘‘ دراصل اس سورت میں یہود پر چوٹ ہے کہ وہ لوگ جنھیں تم اُمی کہتے ہو اور اپنے مقابلے میں ذلیل اور حقیر سمجھتے ہو انھی میں اس اللہ نے ایک رسول مبعوث کیا ہے جو {’’ الْمَلِكِ الْقُدُّوْسِ ‘‘} اور {’’ الْعَزِيْزِ الْحَكِيْمِ ‘‘} ہے اور یہ اللہ کا فضل ہے، جسے وہ چاہتا ہے عطا کر دیتا ہے۔ تم یہ بتاؤ کہ تمھیں اس کا ٹھیکیدار کس نے اور کب بنایاہے کہ جسے تم چاہو اسی کو یہ فضل عطا ہو، دوسرے کو عطا نہ ہو؟ ¤ رہی یہ بات کہ اگرمان بھی لیں کہ رسول اللہ صلی اللہ علیہ وسلم کو عرب و عجم کے امیین کی طرف مبعوث کیا گیا ہے، تو اس سے آپ کا یہود و نصاریٰ کی طرف مبعوث ہونا ثابت نہیں ہوتا۔ اس کا جواب یہ ہے کہ آیت کے الفاظ سے یہ ظاہر ہے کہ آپ یہود کے سوا سب لوگوں کی طرف رسول ہیں، مگر اس میں یہ صراحت نہیں کہ آپ یہود و نصاریٰ کی طرف رسول نہیں۔ یہ مطلب اس آیت کا مفہوم مخالف ہے جو حجت نہیں ہوتا، مثلاً اللہ تعالیٰ نے فرمایا : « وَ مَا كُنْتَ تَتْلُوْا مِنْ قَبْلِهٖ مِنْ كِتٰبٍ وَّ لَا تَخُطُّهٗ بِيَمِيْنِككَ » [ العنکبوت : ۴۸ ] ’’اور تو اس سے پہلے نہ کوئی کتاب پڑھتا تھا اور نہ اسے اپنے دائیں ہاتھ سے لکھتا تھا۔‘‘ اب اس کا مطلب یہ لیا جائے کہ آپ صلی اللہ علیہ وسلم دائیں ہاتھ سے نہیں لکھتے بلکہ بائیں ہاتھ سے لکھتے تھے تو یہ غلط ہے۔ خصوصاً یہاں تو مفہوم مخالف مراد لیا ہی نہیں جا سکتا، کیونکہ خود اللہ تعالیٰ نے قرآن مجید کے متعدد مقامات پر اس بات کی صراحت فرما دی ہے کہ آپ کو تمام لوگوں کے لیے رسول بنا کر بھیجا گیا ہے، جیسا کہ فرمایا : « وَ مَاۤ اَرْسَلْنٰكَ اِلَّا كَآفَّةً لِّلنَّاسِ بَشِيْرًا وَّ نَذِيْرًا وَّ لٰكِنَّ اَكْثثَرَ النَّاسِ لَا يَعْلَمُوْنَ » [ سبا : ۲۸ ] ’’اور ہم نے تجھے نہیں بھیجا مگر تمام لوگوں کے لیے اس حال میں کہ خوش خبری دینے والا اور ڈرانے والا ہے اور لیکن اکثر لوگ نہیں جانتے۔ ‘‘ اور فرمایا : « قُلْ يٰۤاَيُّهَا النَّاسُ اِنِّيْ رَسُوْلُ اللّٰهِ اِلَيْكُمْ جَمِيْعًا» [ الأعراف : ۱۵۸ ] ’’کہہ دے اے لوگو! بے شک میں تم سب کی طرف اللہ کا رسول ہوں۔‘‘ ان دونوں آیات کی تفسیر میں مزید دلائل ملاحظہ فرمائیں۔ ¤ ➋ سورت کی پہلی آیت {’’ يُسَبِّحُ لِلّٰهِ مَا فِي السَّمٰوٰتِ وَ مَا فِي الْاَرْضِ ‘‘} میں مذکور اللہ تعالیٰ کی صفات کی اس آیت میں مذکور رسول اللہ صلی اللہ علیہ وسلم کی صفات کے ساتھ مناسبت یہ ہے کہ کائنات کی ہر چیز اس اللہ کی تسبیح کر رہی ہے اور اس کے ہر عیب اور کمی سے پاک ہونے کی شہادت دے رہی ہے جو {’’ الْمَلِكِ ‘‘} (بادشاہ) ہے۔ ( دیکھیے حشر : ۲۳) اپنی سلطنت کا انتظام کرنے والا، اس میں اپنے احکام بھیجنے والاہے اور اپنے احکام پہنچانے کے لیے جسے چاہتا ہے منتخب فرماتا ہے۔ اس نے اپنے شہنشاہی اختیار کے تحت ان لوگوں میں سے رسول بھیجنے کے بجائے جو اپنے آپ کو اہلِ کتا ب، پڑھے لکھے اور مہذب سمجھتے تھے اور دوسروں کو حقیر جانتے تھے، اُمی لوگوں میں ایک رسول انھی میں سے بھیج دیا۔ {’’ يَتْلُوْا عَلَيْهِمْ اٰيٰتِهٖ ‘‘} جو اس کے احکام پر مشتمل آیات انھیں مسلسل پڑھ کر سناتا ہے۔ {’’ الْقُدُّوْسِ ‘‘} وہ بادشاہ قدوس ہے (دیکھیے حشر : ۲۳) اس نے ان میں ایسا رسول بھیجا جو انھیں ہر قسم کے کفر و شرک اور تمام قباحتوں اور آلودگیوں سے پاک کرتا ہے۔ {’’ الْعَزِيْزِ ‘‘} (سب پر غالب) ہے، اس کا رسول انھیں اس کی کتاب کی تعلیم دیتا ہے جو اس کے کامل غلبے کی دلیل اور ترجمان ہے۔ {’’ الْحَكِيْمِ ‘‘} (کمال حکمت والا) ہے، اس کا رسول انھیں اس کی عطا کردہ حکمت کی تعلیم دیتا ہے۔ ¤ ➌ قرآن مجید میں رسول اللہ صلی اللہ علیہ وسلم کی یہ صفات چار مقامات پر آئی ہیں، سورۂ بقرہ کی آیت (۱۲۹) میں اہلِ عرب کو اپنا احسان یاد دلاتے ہوئے فرمایا کہ ان صفات والا پیغمبر وہ ہے جس کے لیے ابراہیم اور اسماعیل علیھما السلام اللہ تعالیٰ سے دعائیں کرتے رہے کہ وہ اسے ان کی اولاد میں مبعوث فرمائے، سوتمھیں اس کی قدر کرنی چاہیے۔ سورۂ بقرہ ہی کی آیت (۱۵۱) میں فرمایا کہ ان اوصاف والا پیغمبر عطا کرنے پر میری نعمت کو پہچانو، مجھے یاد رکھو، میرا شکر ادا کرو اور میری ناشکری مت کرو۔ سورۂ آلِ عمران(۱۶۴) میں یہ احسان یاد دلایا کہ اتنی اعلیٰ صفات کا رسول اس نے خود ان میں مبعوث فرمایا، جس پر وہ سب احوال گزرتے ہیں جو بطورِ انسان ان سب پر گزرتے ہیں۔ اُحد اور دوسرے مقامات پر دوسروں کی طرح اسے بھی زخم کھانا پڑتے ہیں، سو وہ ان کے لیے ایک کامل نمونہ ہے۔ چوتھا مقام یہ آیت ہے جس میں یہود کے زعم کو باطل کرنا مقصود ہے، اس لیے بعد میں {’’ مَثَلُ الَّذِيْنَ حُمِّلُوا التَّوْرٰىةَ ‘‘} سے ان کی نالائقیوں کا تذکرہ فرمایا ہے۔ ¤ ➍ اگرچہ رسول اللہ صلی اللہ علیہ وسلم کی بعثت تمام انسانوں کے لیے ہے، مگر آپ صلی اللہ علیہ وسلم کو عرب امیین میں پیدا کرنے اور انھیں اسلام کی دعوت کے اوّلین مخاطب بنانے میں اللہ تعالیٰ کی حکمت کاملہ کار فرما تھی۔ تفسیر قاسمی میں یہ بات نہایت خوبصورت اور جامع الفاظ میں بیان کی گئی ہے، وہ لکھتے ہیں : {’’ وَ إِنَّمَا أُوْثِرَتْ بِعْثَتُهُ صَلَوَاتُ اللّٰهِ عَلَيْهِ فِي الْأُمِّيِّيْنَ، لِأَنَّهُمْ أَحَدُّ النَّاسِ أَذْهَانًا، وَأَقْوَاهُمْ جَنَانًا، وَ أَصْفَاهُمْ فِطْرَةً، وَاأَفْصَحُهُمْ بَيَانًا، لَمْ تَفْسُدْ فِطْرَتُهُمْ بِغَوَاشِي الْمُتَحَضِّرِيْنَ وَلَا بِأَفَانِيْنِ تَلَاعُبِ اُولٰئِكَ الْمُتَمَدِّنِيْنَ، وَلِذَا اِنْقَلَبُوْا إِلٰي النَّاسِ بَعْدَ الإِْسْلَامِ بِعِلْمٍ عَظِيْمٍ وَحِكْمَةٍ بَاهِرَةٍ، وَسِيَاسَةٍ عَادِلَةٍ، قَادُوْا بِهَا مُعَظَّمَ الْاُمَمِ وَدَوَّخُوْا بِهَا أَعْظَمَ الْمَمَالِكِ ‘‘} ’’اُمی لوگوں میں آپ صلی اللہ علیہ وسلم کی بعثت کو اس لیے ترجیح دی گئی کہ وہ ذہن کے لحاظ سے سب لوگوں سے تیز، دل کے لحاظ سے سب سے قوی، فطرت کے لحاظ سے سب سے صاف اور بیان میں سب سے زیادہ فصیح تھے۔ ان کی فطرت شہری لوگوں کی آلودگیوں سے بگڑی نہیں تھی اور نہ ہی ان نام نہاد تمدن و تہذیب والوں کے مختلف کھیل تماشوں سے فاسد ہوئی تھی۔ اسی لیے اسلام لانے کے بعد وہ لوگوں کے پاس ایسا عظیم علم، حیران کن حکمت و دانائی اور عدل پر مبنی سیاست لے کر آئے جس کے ساتھ انھوں نے دنیا کی بڑی بڑی اقوام کی قیادت کی اور عظیم ترین ممالک کو اپنا زیر ِفرمان بنا کر چھوڑا۔‘‘ ¤ ➍ { وَ اِنْ كَانُوْا مِنْ قَبْلُ لَفِيْ ضَلٰلٍ مُّبِيْنٍ:’’ اِنْ ‘‘} اصل میں {’’إِنَّهُمْ‘‘} ہے، تخفیف کے لیے {’’إِنَّ‘‘} کو {’’إِنْ‘‘} کر دیا اور اس کے اسم {’’هُمْ‘‘} ضمیر کو حذف کر دیا اور اس بات کی دلیل کہ یہ {’’ اِنْ ‘‘} نافیہ یا شرطیہ نہیں وہ ’’ لام‘‘ ہے جو {’’ لَفِيْ ضَلٰلٍ مُّبِيْنٍ ‘‘} پر آیا ہے۔ رسول اللہ صلی اللہ علیہ وسلم کی بعثت سے پہلے اُمی لوگ کس طرح کی کھلی گمراہی میں تھے اس کا حال رسول اللہ صلی اللہ علیہ وسلم کے چچا زاد جعفر بن ابی طالب رضی اللہ عنہ نے نجاشی کے دربار میں بیان کیا، جب اس بادشاہ نے کفار قریش کے وفد کی شکایت پر انھیں ساتھیوں سمیت بلا کر حقیقت حال دریافت کی۔ انھوں نے فرمایا : [ أَيُّهَا الْمَلِكُ ! كُنَّا قَوْمًا أَهْلَ جَاهِلِيَّةٍ نَعْبُدُ الْأَصْنَامَ، وَنَأْكُلُ الْمَيْتَةَ وَنَأْتِي الْفَوَاحِشَ، وَنَقْطَعُ الأَرْحَامَ، وَنُسِيْءُ الْجِوَارَ، يَأْكُلُ الْقَوِيُّ مِنَّا الضَّعِيْفَ، فَكُنَّا عَلٰی ذٰلِكَ حَتّٰی بَعَثَ اللّٰهُ إِلَيْنَا رَسُوْلاً مِّنَّا نَعْرِفُ نَسَبَهُ، وَصِدْقَهُ ، وَأَمَانَتَهُ ، وَعَفَافَهُ، فَدَعَانَا إِلَی اللّٰهِ لِنُوَحِّدَهُ، وَنَعْبُدَهُ، وَنَخْلَعَ مَا كُنَّا نَعْبُدُ نَحْنُ وَآبَاؤُنَا مِنْ دُوْنِهِ مِنَ الْحِجَارَةِ وَالْأَوْثَانِ ] [مسند أحمد : 202/1، ح : ۱۷۴۰، قال المحقق إسنادہ حسن ] ’’اے بادشاہ! ہم جاہلیت والے لوگ تھے، بتوں کی عبادت کرتے تھے، مردار کھاتے تھے، فواحش کا ارتکاب کرتے تھے، قطع رحمی کرتے تھے، پڑوسیوں سے بدسلوکی کرتے تھے اور ہم میں سے قوت والا کمزور کو کھا جاتا تھا۔ ہم اسی حال میں تھے کہ اللہ تعالیٰ نے ہم میں ایک رسول بھیجا جس کے نسب، صدق، امانت اور پاک دامنی کو ہم جانتے تھے۔ اس نے ہمیں اللہ کی طرف دعوت دی کہ ہم اسے ایک مانیں، اس کی عبادت کریں اور ان پتھروں اور تھانوں سے یکسر علیحدگی اختیار کریں جن کی عبادت اللہ کو چھوڑ کر ہمارے آباواجداد کرتے تھے (اس کے بعد جعفر رضی اللہ عنہ نے انھیں اسلام کے احکام بیان فرمائے)۔‘‘"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {وَ اٰخَرِيْنَ مِنْهُمْ لَمَّا يَلْحَقُوْا بِهِمْ … : ’’ اٰخَرِيْنَ ‘‘} کا عطف {’’ فِي الْاُمِّيّٖنَ ‘‘} پر ہے، یعنی اللہ تعالیٰ نے اس رسول کو عرب اُمیوں میں بھیجا جن کی وہ نسل میں سے ہے اور اسے غیر عرب اُمیوں میں بھی بھیجا جو ابھی مسلمان ہو کر عربوں کے ساتھ نہیں ملے، مگر آئندہ مسلمان ہو کر ان کے ساتھ ملنے والے ہیں۔ تفصیل کے لیے اسی سورت کی آیت(۲) کی تفسیر کا پہلا فائدہ ملاحظہ فرمائیں۔ شاہ عبد القادر لکھتے ہیں :’’ یعنی یہی رسول دوسرے اَن پڑھوں کے واسطے بھی ہے، وہ فارس کے لوگ (ہیں)، وہ بھی نبی کی کتاب نہ رکھتے تھے۔ حق تعالیٰ نے اوّل عرب پیدا کیے اس دین کو تھامنے والے، پیچھے عجم میں ایسے کامل لوگ اٹھے۔‘‘(موضح)"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) { ذٰلِكَ فَضْلُ اللّٰهِ يُؤْتِيْهِ مَنْ يَّشَآءُ … :} یعنی اُمیوں میں نبی مبعوث کرنا اور اسے بعد میں قیامت تک آنے والے تمام لوگوں کے لیے رسول بنانا اللہ کا فضل ہے، وہ جسے چاہتا ہے دیتا ہے، وہ یہود یا کسی اور کی خواہش کا پابند نہیں کہ اسی کو اپنے فضل سے نوازے جسے وہ چاہیں اور نہ ہی یہ کسی کی محنت و کوشش پر موقوف ہے کہ کوئی ریاضت اور محنت کے ساتھ نبوت کا منصب حاصل کر لے، بلکہ یہ سراسر اللہ کے انتخاب اور اس کی مرضی پر موقوف ہے۔ اللہ تعالیٰ کا فرمان ہے : « اَللّٰهُ يَصْطَفِيْ مِنَ الْمَلٰٓىِٕكَةِ رُسُلًا وَّ مِنَ النَّاسِ » [ الحج : ۷۵ ] ’’اللہ فرشتوں میں سے پیغام پہنچانے والے چنتا ہے اور لوگوں سے بھی۔‘‘ اور فرمایا : « اَللّٰهُ اَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهٗ » [ الأنعام : ۱۲۴ ] ’’اللہ زیادہ جاننے والا ہے جہاں وہ اپنی رسالت رکھتا ہے۔‘‘ اور فرمایا : « وَ اللّٰهُ يَخْتَصُّ بِرَحْمَتِهٖ مَنْ يَّشَآءُ وَ اللّٰهُ ذُو الْفَضْلِ الْعَظِيْمِ » [ البقرۃ : ۱۰۵ ] ’’اور اللہ اپنی رحمت کے ساتھ جسے چاہتا ہے خاص کر لیتا ہے اور اللہ بہت بڑے فضل والا ہے۔‘‘"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {مَثَلُ الَّذِيْنَ حُمِّلُوا التَّوْرٰىةَ ثُمَّ لَمْ يَحْمِلُوْهَا …:’’ اَسْفَارًا ‘‘ ’’سِفْرٌ‘‘} کی جمع ہے، بڑی کتاب۔ {’’سَفَرَ يَسْفُرُ‘‘ (ن) ’’اَلْكِتَابَ‘‘} لکھنا۔ {’’اَلسَّافِرُ أَيْ اَلْكَاتِبُ‘‘} جمع اس کی {’’سَفَرَةٌ‘‘} ہے، جیسا کہ فرمایا : « بِاَيْدِيْ سَفَرَةٍ (15) كِرَامٍۭ بَرَرَةٍ » [ عبس : ۱۵،۱۶ ] ’’ایسے لکھنے والوں کے ہاتھوں میں ہیں۔جو معزز ہیں، نیک ہیں۔‘‘ ¤ ➋ بعض اہلِ علم نے فرمایا، اللہ تعالیٰ نے تین باتوں میں یہود کا ردّ فرمایا، انھوں نے فخر کیا کہ وہ اہلِ کتاب ہیں جب کہ عرب اُمی ہیں، تو اس کی تردید کرتے ہوئے انھیں اس گدھے کے ساتھ تشبیہ دی جو بڑی بڑی کتابیں اٹھائے ہوئے ہو۔ انھوں نے فخر کیا کہ وہ اللہ کے دوست اور محبوب ہیں، اللہ تعالیٰ نے فرمایا : « فَتَمَنَّوُا الْمَوْتَ» [ الجمعۃ : ۶ ] ’’( اگر ایسا ہے) تو موت کی تمنا کرو۔ ‘‘ تیسرا یہ کہ ان کے ہاں ’’سبت‘‘ (ہفتے کا دن)ہے جو مسلمانوں کے پاس نہیں، تو اللہ تعالیٰ نے یوم جمعہ کی صورت میں مسلمانوں پر اپنے احسان کا ذکر فرمایا، جس سے یہود اپنی نادانی کی وجہسے محروم رہ گئے۔ (الکشاف) ¤ ➌ تورات کا بوجھ رکھا جانے کا مطلب یہ ہے کہ اس پر عمل کی ذمہ داری ڈالی گئی، جیساکہ فرمایا : « اِنَّا عَرَضْنَا الْاَمَانَةَ عَلَى السَّمٰوٰتِ وَ الْاَرْضِ وَ الْجِبَالِ فَاَبَيْنَ اَنْ يَّحْمِلْنَهَا وَ اَشْفَقْنَ مِنْهَا وَ حَمَلَهَا الْاِنْسَانُ» [ الأحزاب:۷۲ ] ’’بے شک ہم نے امانت کو آسمانوں اور زمین اور پہاڑوں کے سامنے پیش کیا تو انھوں نے اس کا بوجھ اٹھانے سے انکار کر دیا اور اس سے ڈر گئے اور انسان نے اسے اٹھا لیا۔‘‘ {’’ ثُمَّ لَمْ يَحْمِلُوْهَا ‘‘} پھر انھوں نے اس پر عمل نہیں کیا،یعنی جس طرح گدھے پر کتابیں لدی ہوں اور وہ نہیں جانتا کہ اس کی پیٹھ پر کیا ہے، اسی طرح وہ لوگ ہیں جن پر تورات کا بوجھ ڈالا گیا کہ اس پر عمل کریں، مگر انھوں نے پروا ہی نہیں کی کہ اس میں کیا ہے اور وہ ان سے کیا چاہتی ہے۔ ¤ ➍ {بِئْسَ مَثَلُ الْقَوْمِ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِ اللّٰهِ :} اللہ کی آیات کو جھٹلانے سے مراد ان بشارتوں کو جھٹلانا ہے جو اللہ تعالیٰ نے تورات میں رسول اللہ صلی اللہ علیہ وسلم کے متعلق نازل فرمائیں۔ (دیکھیے اعراف : ۱۵۷) {’’ بِئْسَ ‘‘} فعل ذم ہے، {’’ مَثَلُ الْقَوْمِ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِ اللّٰهِ ‘‘} اس کا فاعل ہے اور اس کا مخصوص بالذم محذوف ہے، یعنی {’’هٰذَا الْمَثَلُ ۔‘‘} یعنی ان لوگوں کی یہ مثال جنھوں نے اللہ کی آیات کو جھٹلایا بری مثال ہے، جس کا مصداق ایمان والوں کو نہیں بننا چاہیے۔ جیسا کہ کسی مسلمان کو کتے کی مثال کا مصداق بھی نہیں بننا چاہیے کہ اس پر کتے کی مثال صادق آئے۔ ابنِ عباس رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ لَنَا مَثَلُ السَّوْءِ، الَّذِيْ يَعُوْدُ فِيْ هِبَتِهِ كَالْكَلْبِ يَرْجِعُ فِيْ  قَيْهٖ ] [ بخاري، الھبۃ و فضلھا، باب لا یحل لأحد أن یرجع في ھبتہ وصدقتہ : ۲۶۲۲ ] ’’یہ بری مثال ہمارے لیے نہیں ہے، وہ شخص جو اپنے ہبہ میں لوٹتا ہے اس کتے کی ما نند ہے جو اپنی قے میں لوٹتا ہے۔‘‘ ¤ ➎ استاد محمد عبدہ رحمہ اللہ لکھتے ہیں : ’’کیا وجہ ہے کہ ان علماء کا حال اس سے مختلف ہو جو قرآن و حدیث کا علم رکھتے ہیں لیکن اس پرعمل نہیں کرتے، یا یہودیوں کی طرح ان کی من مانی تاویلیں کرتے ہیں۔‘‘ شاہ عبدالقادر رحمہ اللہ لکھتے ہیں : ’’یہود کے عالم ایسے تھے کتاب پڑھی اور دل میں کچھ اثر نہ ہوا ، اللہ ہم کو پناہ دے۔ ‘‘( موضح) ¤ ➏ {وَ اللّٰهُ لَا يَهْدِي الْقَوْمَ الظّٰلِمِيْنَ :} یعنی جاننے کے باوجود نہ ماننا صریح ظلم ہے اور ایسے ظالموں کو اللہ بھی راہِ راست پر چلنے کی توفیق نہیں دیتا، کیونکہ نہ چاہنے والوں کو زبر دستی راہِ راست پر چلانا اس کا دستور نہیں۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6تا8) {قُلْ يٰۤاَيُّهَا الَّذِيْنَ هَادُوْۤا اِنْ زَعَمْتُمْ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ بقرہ( ۹۴ تا ۹۶ ) کی تفسیر۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 6تا8) {قُلْ يٰۤاَيُّهَا الَّذِيْنَ هَادُوْۤا اِنْ زَعَمْتُمْ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ بقرہ( ۹۴ تا ۹۶ ) کی تفسیر۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 6تا8) {قُلْ يٰۤاَيُّهَا الَّذِيْنَ هَادُوْۤا اِنْ زَعَمْتُمْ … :} ان آیات کی تفسیر کے لیے دیکھیے سورۂ بقرہ( ۹۴ تا ۹۶ ) کی تفسیر۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا اِذَا نُوْدِيَ لِلصَّلٰوةِ … :} اہلِ کتاب کی شقاوت اور امیین کی سعادت میں سے ایک یہ بھی ہے کہ یہود و نصاریٰ پر جمعہ کا دن فرض کیا گیا تو انھوں نے اسے قبول کرنے میں اختلاف کیا۔ یہود نے اپنے لیے ہفتے کا د ن اور نصاریٰ نے اتوار کا دن عبادت کے لیے مقرر کر لیا، جبکہ اللہ تعالیٰ نے امتِ مسلمہ کو جمعہ کے دن کی ہدایت عطا فرما دی، جس سے انھیں یہودو نصاریٰ دونوں پر سبقت حاصل ہو گئی۔ تفصیل کے لیے دیکھیے سورۂ نحل کی آیت ( ۱۲۴) : « اِنَّمَا جُعِلَ السَّبْتُ عَلَى الَّذِيْنَ اخْتَلَفُوْا فِيْهِ » کی تفسیر۔ ¤ ➋ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْۤا … :} یہ آیت واضح دلیل ہے کہ جمعہ ان تمام لوگوں پر فرض ہے جو ایمان لا چکے ہیں، خواہ وہ شہر میں رہتے ہوں یا کسی بستی یا بادیہ میں۔ امام بخاری رحمہ اللہ نے اپنی صحیح میں باب قائم کیا ہے : {’’بَابُ الْجُمُعَةِ فِي الْقُرٰي وَالْمُدُنِ ‘‘} ( بستیوں اور شہروں میں جمعہ کا باب) اور اس میں ابن عباس رضی اللہ عنھما کی حدیث لائے ہیں، انھوں نے فرمایا : [ إِنَّ أَوَّلَ جُمُعَةٍ جُمِّعَتْ بَعْدَ جُمُعَةٍ فِيْ مَسْجِدِ رَسُوْلِ اللّٰهِ صَلّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فِيْ مَسْجِدِ عَبْدِ الْقَييْسِ بِجُوَاثٰٰی مِنَ الْبَحْرَيْنِ ] [ بخاري، الجمعۃ، باب الجمععۃ في القری والمدن : ۸۹۲ ] ’’پہلا جمعہ جو رسول اللہ صلی اللہ علیہ وسلم کی مسجد میں جمعہ کے بعد ادا کیا گیا عبد القیس قبیلے کی مسجد میں ہوا جو بحرین کے جواثی ٰمقام پر تھی۔‘‘ ابو داؤد میں ابن عباس رضی اللہ عنھما کی اس روایت میں یہ الفاظ بھی ہیں : [ بِجُوَاثَاءَ قَرْيَةٍ مِّنْ قُرَی الْبَحْرَيْنِ ] [ أبو داوٗد، الصلاۃ، باب الجمعۃ فی القرٰی : ۱۰۶۸ ] ’’جواثا بحرین کی بستیوں میں سے ایک بستی ہے۔‘‘ آیت میں جمعہ کے دن صلاۃ کی ندا پر اللہ کے ذکر کی طرف سعی کا حکم ہے اور باجماعت صلاۃ ادا کرنا صرف شہر میں نہیں بلکہ ہر بستی اور بادیہ میں فرض ہے۔ ¤ ابو درداء رضی اللہ عنہ فرماتے ہیں میں نے رسول اللہ صلی اللہ علیہ وسلم کو سنا، آپ فرما رہے تھے : [ مَا مِنْ ثَلاَثَةٍ فِيْ قَرْيَةٍ وَلاَ بَدْوٍ لاَ تُقَامُ فِيْهِمُ الصَّلاَةُ إِلاَّ قَدِ اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطَانُ فَعَلَيْكَ بِالْجَمَاعَةِ فَإِنَّمَا يَأْكُلُ الذِّئْبُ الْقَاصِيَةَ ] [ أبوداوٗد، الصلاۃ، باب في التشدید في ترک الجماعۃ : ۵۴۷ ] ’’کوئی تین آدمی نہیں جو کسی بستی یا بادیہ میں ہوں، جن میں نماز قائم نہ کی جاتی ہو مگر ان پر شیطان غالب آچکا ہوتا ہے۔ سو جماعت کو لازم پکڑو، کیونکہ بھیڑیا صرف اس بکری کو کھاتا ہے جو ریوڑ سے دور ہو۔‘‘ ابوہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ لوگوں نے عمر(بن خطاب رضی اللہ عنہ ) کو خط لکھ کر جمعہ کے متعلق سوال کیا، انھوں نے لکھا : [ جَمِّعُوْا حَيْثُمَا كُنْتُمْ ] [ مصنف ابن أبي شیبۃ : 101/2، ح : ۵۱۰۸ ] ’’تم جہا ں بھی ہو جمعہ ادا کرو۔ ‘‘ اس کی سند بخاری و مسلم کی شرط پر ہے۔ جن لوگوں نے جمعہ کے لیے شہر یا حاکم وغیرہ کی شرط لگائی ہے ان کے پاس قرآن و سنت کی کوئی دلیل نہیں اور مشہور روایت {’’ لَاجُمُعَةَ وَلَا تَشْرِيْقَ إِلَّا فِيْ مِصْرٍ جَامِعٍ‘‘} (جمعہ اور عید جامع شہر کے سوا نہیں) رسول اللہ صلی اللہ علیہ وسلم سے ثابت نہیں۔ یہ علی رضی اللہ عنہ کا قول مشہور ہے، جو عمر رضی اللہ عنہ کے صحیح سند کے ساتھ مروی قول کے خلاف ہے، جب صحابہ میں اختلاف ہو تو اصل کتاب و سنت کی طرف رجوع واجب ہے (دیکھیے نساء : ۵۹) اور کتاب و سنت کے مطابق تمام مسلمانوں پر ہر جگہ جمعہ فرض ہے، جیسا کہ اوپر گزر چکا ہے، البتہ چند لوگ اس سے مستثنیٰ ہیں۔ طارق بن شہاب رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلْجُمُعَةُ حَقٌّ وَاجِبٌ عَلٰی كُلِّ مُسْلِمٍ فِيْ جَمَاعَةٍ إِلاَّ أَرْبَعَةً عَبْدٌ مَمْلُوْكٌ أَوِ امْرَأَةٌ أَوْ صَبِيٌّ أَوْ مَرِيْضٌ ] [أبوداوٗد، الصلاۃ، باب الجمعۃ للمملوک والمرأۃ : ۱۰۶۷، قال الألباني صحیح ] ’’جمعہ ہر مسلم پر جماعت کے ساتھ ادا کرنا واجب حق ہے سوائے چار کے، غلام جو کسی کی ملکیت میں ہو یا عورت یا بچہ یا مریض۔ ‘‘ اور عبد اللہ بن عمر رضی اللہ عنھما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَيْسَ عَلٰی مُسَافِرٍ جُمُعَةٌ ] [ المعجم الأوسط للطبراني : 249/1، ح : ۸۱۸، وقال الألباني صحیح۔ دیکھیے الجامع الصغیر : ۵۴۰۵ ] ’’مسافر پر جمعہ نہیں ہے۔‘‘ ¤ جن لوگوں پر جمعہ فرض نہیں اگر وہ جمعہ کے لیے آئیں تو اجر کا باعث ہے۔ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں عورتیں بھی جمعہ کے لیے آتی تھیں، اس سے اجر کے علاوہ قرآن کی آیات سن کر انھیں یاد کرنے کا موقع ملتا ، قرآن و سنت سن کر علم میں اضافہ ہو تا اور نصیحت سن کر اصلاح ہوتی تھی۔ام ہشام بنت حارثہ بن نعمان رضی اللہ عنھا فرماتی ہیں : [ مَا أَخَذْتُ « قٓ وَ الْقُرْاٰنِ الْمَجِيْدِ » إِلَّا عَنْ لِسَانِ رَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤؤُهَا كُلَّ يَوْمِ جُمُعَةٍ عَلَی الْمِنْبَرِ إِذَا خَطَبَ النَّاسَ ] [ مسلم، الجمعۃ، باب تخفیف الصلاۃ و الخطبۃ : ۵۲ /۸۷۳ ] ’’میں نے سورۂ « قٓ وَ الْقُرْاٰنِ الْمَجِيْدِ» رسول اللہ صلی اللہ علیہ وسلم کی زبان سے سن کر یاد کی، آپ اسے ہر جمعہ کے دن خطبہ دیتے ہوئے منبر پر پڑھا کرتے تھے۔‘‘ صحیح مسلم کے اسی باب کی ایک روایت (۸۷۳) میں ام ہشام رضی اللہ عنھا ہی کے الفاظ ہیں : [ مَا حَفِظْتُ « قٓ » إِلَّا مِنْ فِيْ رَسُوْلِ اللّٰهِ صَلَّي اللّٰهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ بِهَا كُلَّ جُمُعَةٍ ] مطلب اوپر گزر چکا ہے۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے مردوں کو منع فرمایا کہ وہ عورتوں کو اس بات سے روکیں کہ وہ مسجد میں آکر اجر اور قرآن و سنت کے علم سے اپنا حصہ حاصل کریں۔ عبد اللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ لَا تَمْنَعُوا النِّسَاءَ حُظُوَظَهُنَّ مِنَ الْمَسَاجِدِ إِذَا اسْتَأْذَنُوْكُمْ ] [ مسلم، الصلاۃ، باب خروج النساء إلی المساجد … : ۱۴۰ /۴۴۲ ] ’’عورتوں کو مساجد میں سے ان کے حصے میں آنے والی چیزوں سے مت روکو، جب وہ تم سے اجازت مانگیں۔‘‘ ¤ جمعہ کے دن کی بدعات میں سے ایک بدعت ظہر احتیاطی ہے۔ کچھ لوگ جن کا خیال ہے کہ اسلامی حاکم کے بغیر جمعہ نہیں ہوتا اور دیہات میں بھی جمعہ نہیں ہوتا، شہروں اور گاؤں میں جمعہ کی دو رکعتیں پڑھانے کے بعد احتیاطاً ظہر کی چار رکعتیں بھی پڑھتے ہیں، یہ بد ترین بدعت ہے، کیونکہ اس کی بنیاد شک پر ہے جو کفار کا معمول ہے، جیسا کہ فرمایا : « بَلْ هُمْ فِيْ شَكٍّ يَّلْعَبُوْنَ» [ الدخان : ۹ ] ’’بلکہ وہ ایک شک میں کھیل رہے ہیں۔‘‘ ¤ ➌ { اِذَا نُوْدِيَ لِلصَّلٰوةِ مِنْ يَّوْمِ الْجُمُعَةِ : ’’ اَلصَّلاَةُ ‘‘} پر ’’الف لام‘‘ عہد کا ہے، مراد وہ نماز ہے جو جمعہ کے دن کے ساتھ خاص ہے اور سب جانتے ہیں کہ وہ نماز جمعہ ہے جو اس دن ظہر کی جگہ ادا کی جاتی ہے اور نداسے مراد اذان ہے۔ دیکھیے سورۂ مائدہ کی آیت (۵۸) کی تفسیر۔ آج کل عام طور پر جمعہ کے دن خطبے سے پہلے دو اذانیں کہی جاتی ہیں، رسول اللہ صلی اللہ علیہ وسلم ، ابوبکر اور عمر رضی اللہ عنھما کے زمانے میں یہ دو اذانیں نہیں بلکہ ایک ہی اذان تھی۔ سائب بن یزید رضی اللہ عنہ سے روایت ہے، فرماتے ہیں : [ كَانَ النِّدَاءُ يَوْمَ الْجُمُعَةِ أَوَّلُهُ إِذَا جَلَسَ الإِْمَامُ عَلَی الْمِنْبَرِ عَلٰی عَهْدِ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَ أَبِيْ بَكْرٍ وَعُمَرَ رَضِيَ اللّٰهُ عَنْهُمَا فَلَمَّا كَانَ عُثْمَانُ رَضِيَ اللّٰهُ عَنْهُ وَكَثُرَ النَّاسُ زَادَ النِّدَاءَ الثَّالِثَ عَلَی الزَّوْرَاءِ ] [ بخاري، الجمعۃ، باب الأذان یوم الجمعۃ : ۹۱۲ ] ’’جمعہ کے دن پہلی اذان اس وقت ہوتی تھی جب امام منبر پر بیٹھتا تھا۔ نبی صلی اللہ علیہ وسلم ، ابوبکر اور عمر رضی اللہ عنھما کے عہد میں یہی معمول تھا۔ پھر جب عثمان رضی اللہ عنہ خلیفہ ہوئے اور لوگ زیادہ ہو گئے تو انھوں نے ( بازار میں ایک مقام) زَوراء پر تیسری اذان کا اضافہ کر دیا۔‘‘ یاد رہے کہ اس تیسری اذان سے مراد وہ اذان ہے جو آج کل خطبے سے پندرہ منٹ یا آدھ گھنٹہ پہلے کہی جاتی ہے، اس کے بعد کی دو اذانوں سے مراد اذان اور اقامت ہیں۔ یہ تیسری اذان رسول اللہ صلی اللہ علیہ وسلم ، ابو بکر اور عمر رضی اللہ عنھما کے دور میں نہیں کہی جاتی تھی، عثمان رضی اللہ عنہ نے لوگوں کی کثرت کے پیشِ نظر اس کا اضافہ کیا، مگر ان کے زمانے میں یہ اذان مسجد میں نہیں کہی جاتی تھی بلکہ بازار میں کہی جاتی تھی، تاکہ لوگوں کو اطلاع ہو جائے۔ آج کل نہ اس اذان کا اہتمام مسجد سے الگ بازار میں کیا جاتا ہے، نہ لاؤڈ سپیکر کی وجہ سے اس کی ضرورت باقی ہے اور نہ ہی مسجد میں خطبے سے پہلے دو اذانیں عثمان رضی اللہ عنہ کا طریقہ ہے۔ اس لیے خطبے سے پہلے مسجد میں ایک ہی اذان کہی جانی چاہیے جو رسول اللہ صلی اللہ علیہ وسلم اور ابو بکر و عمر رضی اللہ عنھما کا طریقہ ہے اور عثمان رضی اللہ عنہ کا عمل بھی یہی ہے۔ ¤ ➍ { فَاسْعَوْا اِلٰى ذِكْرِ اللّٰهِ : ’’سَعٰي يَسْعٰي سَعْيًا‘‘} (ف) کا معنی دوڑنا بھی ہے اور کوشش کرنا بھی، جیسا کہ فرمایا : « وَ اَنْ لَّيْسَ لِلْاِنْسَانِ اِلَّا مَا سَعٰى » [ النجم :۳۹ ] ’’اور یہ کہ انسان کے لیے صرف وہی ہے جس کی اس نے کوشش کی۔‘‘ یہاں دوسرا معنی مراد ہے، یعنی نہایت کوشش اور اہتمام کے ساتھ آؤ، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے نماز کے لیے دوڑ کر آنے سے منع فرمفرمایا ہے۔ ¤ ➎ { وَ ذَرُوا الْبَيْعَ :} اگرچہ جمعہ کے لیے پہلے آنا بہت فضیلت کا باعث ہے اور اس کے متعلق احادیث مشہور و معروف ہیں، مگر آخری حد جس کے بعد جمعہ کی طرف روانگی یا اس کے لیے درکار کام کے سوا ہر کام حرام ہو جاتاہے وہ جمعہ کی اذان ہے۔ یہاں {’’ الْبَيْعَ ‘‘} کا ذکر اس خاص واقعہ کے پیش نظر آیا ہے جو اگلی آیت میں آ رہا ہے، ورنہ اللہ کے ذکر کی طرف سعی جس طرح بیع ترک کرنے کے سوا نہیں ہو سکتی دوسرے تمام کام ترک کرنے کے بغیر بھی نہیں ہو سکتی اور ظاہر ہے کہ جب سعی فرض ہے تو ہر وہ کام حرام ہے جو اس سے روکنے والا ہے۔ ¤ ➏ {ذٰلِكُمْ خَيْرٌ لَّكُمْ اِنْ كُنْتُمْ تَعْلَمُوْنَ :} ظاہر ہے آخرت کے ثواب کے مقابلے میں دنیا کے فائدوں کی کوئی حیثیت نہیں۔ ¤ ➐ جمعہ کے دن غسل کرنا، اچھے کپڑے پہننا، خوشبو لگانا، پہلے آنا، خاموشی کے ساتھ خطبہ سننا اور دوسرے متعلقہ احکام و فضائل کتب احادیث میں تفصیل سے مذکور ہیں۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ { فَاِذَا قُضِيَتِ الصَّلٰوةُ فَانْتَشِرُوْا فِي الْاَرْضِ …:} یہاں ایک سوال ہے کہ آیت میں حکم دیا گیا ہے کہ جمعہ کی نماز سے فارغ ہونے کے بعد زمین میں پھیل جاؤ اور اللہ کا فضل تلاش کرو، تو کیا نماز کے بعد مسجد سےے نکلنا ضروری ہے اور کیا کاروبار بھی ضروری ہے یا گھر میں آرام بھی کیا جا سکتا ہے؟ جواب اس کا یہ ہے کہ اگرچہ اصل یہی ہے کہ جس کام کا حکم دیا جائے وہ فرض ہوتا ہے، مگر قرینہ موجود ہو تو امر استحباب کے لیے بھی ہو تا ہے اور بیانِ جواز کے لیے بھی۔ یہاں اذان کے بعد بیع سے منع فرمایا تھا، اب اس ممانعت کی حد بیان فرما دی کہ یہ ممانعت نماز پوری ہونے تک ہے، اس کے بعدبیع کی اجازت ہے اور تمھیں اختیار ہے کہ مسجد سے نکل کر کاروبار میں مصروف ہو جاؤ، لیکن اگر کوئی مسجد میں رہے یا گھر چلا جائے، کاروبار نہ کرے تو مضائقہ نہیں۔ یہ ایسے ہی ہے کہ اللہ نے احرام کی حالت میں شکار سے منع فرمایا، جیسا کہ فرمایا : « لَا تَقْتُلُوا الصَّيْدَ وَ اَنْتُمْ حُرُمٌ » [ المائدۃ : ۹۵ ] ’’شکار کو مت قتل کرو، اس حال میں کہ تم احرام والے ہو۔‘‘ پھر فرمایا : « وَ اِذَا حَلَلْتُمْ فَاصْطَادُوْا » [ المائدۃ : ۲ ] ’’اور جب تم احرام کھول دو تو شکار کرو۔‘‘یہاں شکار کا حکم دینے کا یہ مطلب نہیں کہ احرام کھولنے والے شخص پر شکار کرنا فرض ہے، بلکہ مطلب یہ ہے کہ احرام کھولنے کے بعد شکار کی اجازت ہے۔ ¤ ➋ { وَ ابْتَغُوْا مِنْ فَضْلِ اللّٰهِ :} اللہ کے فضل سے مراد یہاں روزی تلاش کرنا ہے ، یعنی جس طرح یہود کے لیے یوم السبت (ہفتہ) کو سارا دن شکار منع تھا تم پر ایسی کوئی پابندی نہیں، صرف اذان سے لے کر نماز سے فراغت تک خطبہ اور نماز میں حاضری کے سوا ہر کام منع ہے، اس کے بعد جس حلال طریقے سے روزی کما سکتے ہو کماؤ۔ ¤ ➌ {وَ اذْكُرُوا اللّٰهَ كَثِيْرًا لَّعَلَّكُمْ تُفْلِحُوْنَ :} یعنی روزی کی تلاش میں مصروفیت کے دوران بھی اللہ کی یاد سے غافل نہ ہو جاؤ، بلکہ اسے بہت زیادہ یاد کرتے رہو۔ اللہ کی یاد دل سے بھی ہوتی ہے، زبان سے بھی اور ہر کام اللہ تعالیٰ کو یاد رکھتے ہوئے اس کے حکم کے مطابق ادا کرنے کے ساتھ بھی۔ مزید دیکھیے سورۂ احزاب (۴۱ ، ۴۲) کی تفسیر۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {وَ اِذَا رَاَوْا تِجَارَةً اَوْ لَهْوًا انْفَضُّوا اِلَيْهَا … :} اس سے پہلے عام تراجم کے مطابق اس آیت کا ترجمہ ’’ اور جب وہ کوئی تجارت یا تماشا دیکھتے ہیں تو اٹھ کر اس کی طرف چلے جاتے ہیں اور تجھے کھڑا چھوڑ جاتے ہیں‘‘ کیا گیا تھا۔ اس ترجمہ کی وجہ یہ ہے کہ لفظ {’’إِذَا ‘‘} عموماً مستقبل کے لیے آتا ہے، حالانکہ اس مقام پر یہ لفظ مستقبل نہیں بلکہ ماضی کے معنی میں استعمال ہوا ہے، لہٰذا آیت کا مذکورہ بالا ترجمہ درست نہیں، بلکہ درست ترجمہ یہ ہے : ’’اور جب انھوں نے کوئی تجارت دیکھی یا تماشا تو اٹھ کر اس کی طرف چلے گئے اور انھوں نے تجھے کھڑا چھوڑ دیا۔‘‘ قرینہ اس کا یہ ہے کہ یہ فعل صحابہ کرام رضی اللہ عنھم سے صرف ایک دفعہ سر زد ہوا ہے، اس کے بعد انھوں نے کبھی ایسا نہیں کیا، اس لیے یہ کہنا کہ وہ جب بھی کوئی تجارت یا تماشا دیکھتے تھے تو اٹھ کر چلے جاتے تھے اور رسول اللہ صلی اللہ علیہ وسلم کو کھڑا چھوڑ جاتے تھے، ہر گز درست نہیں، بلکہ یہاں ماضی میں ہونے والے معاملے کا ذکر ہے جو صرف ایک دفعہ واقع ہوا ہے۔ ¤ مفسر ابراہیم میر سیالکوٹی نے ’’شہادۃ القرآن‘‘ (جلد دوم) میں اس کے متعلق بہت عمدہ بحث لکھی ہے، وہ فرماتے ہیں : {’’ إِذْ ‘‘} اور {’’إِذَا ‘‘} دو کلمے ظروف زمانیہ میں سے ہیں۔ {’’ إِذْ ‘‘} ماضی کے لیے آتاہے اور کبھی بمعنی مستقبل بھی ہوتا ہے، جیسا کہ {’’ إِذَا ‘‘} مستقبل کے لیے اور کبھی ماضی کے لیے بھی آتا ہے، چنانچہ مغنی (مغنی اللبیب) میں {’’ إِذَا ‘‘} کی بحث میں لکھا ہے : {’’ أَحَدُهُمَا أَنْ تَجِيْءَ لِلْمَاضِيْ كَمَا تَجِيْءُ إِذْ لِلْمُسْتَقْبَلِ۔ ‘‘ ’’ إِذَا ‘‘} بمعنی {’’ إِذْ ‘‘} کی مثال یہ آیت ہے : «وَ اِذَا رَاَوْا تِجَارَةً اَوْ لَهْوًا انْفَضُّوْۤا اِلَيْهَا وَ تَرَكُوْكَ قَآىِٕمًا» [ الجمعۃ : ۱۱ ] ’’اور جس وقت انھوں نے تجارت یا کھیل کا سامان دیکھا تو اس کی طرف اٹھ گئے اور تجھے کھڑا چھوڑ دیا۔ ‘‘ اور یہ آیت : «حَتّٰۤى اِذَا ضَاقَتْ عَلَيْهِمُ الْاَرْضُ بِمَا رَحُبَتْ وَ ضَاقَتْ عَلَيْهِمْ اَنْفُسُهُمْ» [ التوبۃ : ۱۱۸ ] ’’یہاں تک کہ جس وقت زمین ان پر باوجود فراخ ہونے کے تنگ ہو گئی اور ان کی جانیں بھی ان کو گراں معلوم ہوئیں۔‘‘ اور {’’إِذْ ‘‘} بمعنی {’’ إِذَا ‘‘} یعنی مستقبل کی مثال یہ آیت ہے : «فَسَوْفَ يَعْلَمُوْنَ (70) اِذِ الْاَغْلٰلُ فِيْۤ اَعْنَاقِهِمْ» [ المؤمن : ۷۰، ۷۱ ]’’پس یہ لوگ اس وقت ضرور جان لیں گے، جب ان کی گردنوں میں طوق پڑیں گے۔‘‘ کیونکہ {’’ سَوْفَ ‘‘} جو خاص استقبال کے لیے موضوع ہے، قرینہ موجود ہے۔‘‘ اس کے بعد مولانا میر سیالکوٹی نے اشعار عرب سے اس کی مثالیں ذکر فرمائی ہیں۔ ¤ ➋ {وَ اِذَا رَاَوْا تِجَارَةً اَوْ لَهْوًا انْفَضُّوْۤا اِلَيْهَا … : ’’ فَضَّ يَفُضُّ فَضًّا ‘‘ (ن) ’’اَلشَّيْءَ‘‘} کسی چیز کو توڑکر ریزہ ریزہ کر دینا۔ {’’ اِنْفَضَّ ‘‘} (انفعال) بکھر جانا، منتشر ہو جانا۔ مدینہ میں ایک تجارتی قافلے کی آمد پر صحابہ کے اٹھ کر چلے جانے پر ناراضی کا اظہار ہو رہا ہے۔ جابر بن عبد اللہ رضی اللہ عنھما نے بیان کیا کہ جمعہ کے دن ایک قافلہ آیا جب کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے، تو بارہ آدمیوں کے سوا سب اس کی طرف اٹھ کر چلے گئے۔ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی : « وَ اِذَا رَاَوْا تِجَارَةً اَوْ لَهْوًا انْفَضُّوْۤا اِلَيْهَا » [  بخاري، التفسیر، باب : {و إذا رأوا تجارأو لھوا} : ۴۸۹۹ ] جابر بن عبداللہ رضی اللہ عنھما ہی سے روایت ہے کہ جمعہ کے دن رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے، اس دوران مدینہ میں ایک قافلہ آیا تو رسول اللہ صلی اللہ علیہ وسلم کے اصحاب جلدی سے اٹھ کر چلے گئے، حتیٰ کہ آپ کے پاس صرف بارہ آدمی رہ گئے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَالَّذِيْ نَفْسِيْ بِيَدِهِ! لَوْ تَتَابَعْتُمْ حَتّٰی لاَ يَبْقٰی مِنْكُممْ أَحَدٌ لَسَالَ بِكُمُ الْوَادِی النَّارَ، فَنَزَلَتْ هٰذِهِ الْآيَةُ : « وَ اِذَا رَاَوْا تِجَارَةً اَوْ لَهْوًا انْفَضُّوْۤا اِلَيْهَا » وَ قَالَ فِي الاِْثْنَيْ عَشَرَ الَّذِيْنَ ثَبَتُوْا مَعَ رَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّممَ أَبُوْ بَكْرٍ وَعُمَرُ ] [ مسند أبي یعلٰی : ۳؍۴۶۸، ح : ۱۹۷۹، قال المحقق حسین سلیم أسد إسنادہ صحیح ] ’’اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اگر تم سب ایک دوسرے کے پیچھے چلے جاتے، حتیٰ کہ تم میں سے ایک بھی باقی نہ رہتا تو یہ وادی تمھیں آگ کے ساتھ بہا کر لے جاتی۔‘‘ اس پر یہ آیت اتری : « وَ اِذَا رَاَوْا تِجَارَةً اَوْ لَهْوًا انْفَضُّوْۤا اِلَيْهَا وَ تَرَكُوْكَ قَآىِٕمًا» جابر رضیی اللہ عنہ نے فرمایا: ’’ان باقی رہنے والے بارہ آدمیوں میں ابو بکر اور عمر رضی اللہ عنھما بھی تھے۔‘‘ ¤ ➌ اس آیت سے معلوم ہوا کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہو کر خطبہ دیتے تھے، اس لیے عذر کے بغیر بیٹھ کر خطبہ نہیں دینا چاہیے۔ عبد اللہ بن عمر رضی اللہ عنھما نے فرمایا : ’’رسول اللہ صلی اللہ علیہ وسلم جمعہ کے دن کھڑے ہوکر خطبہ دیتے، پھر بیٹھ جاتے، پھر کھڑے ہو جاتے، جیسا کہ آج کل کرتے ہیں۔‘‘ [ مسلم، الجمعۃ، باب ذکر الخطبتین قبل الصلاۃ و ما فیھما من الجلسۃ : ۸۶۱ ] ¤ ➍ جابر بن سمرہ رضی اللہ عنہ نے فرمایا : [ كَانَتْ لِلنَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ خُطْبَتَانِ تَانِ يَجْلِسُ بَيْنَهُمَا يَقْرَأُ الْقُرْآنَ وَ يُذَكِّرُ النَّاسَ ] [ مسلم، الجمعۃ، باب ذکر الخطبتین قبل الصلاۃ و ما فیھما من الجلسۃ : ۸۶۲ ] ’’نبی صلی اللہ علیہ وسلم دو خطبے دیا کرتے تھے، ان دونوں کے درمیان بیٹھتے تھے، آپ قرآن پڑھتے اور لوگوں کو نصیحت کرتے۔‘‘ اس حدیث سے کئی باتیں ثابت ہوئیں، ایک یہ کہ جمعہ کے دو خطبے ہیں، جو کھڑے ہو کر دیے جاتے ہیں اور ان کے درمیان بیٹھا جاتا ہے۔ دوسری یہ کہ جمعہ کے خطبے میں یہ دوچیزیں ہوں تو وہ رسول اللہ صلی اللہ علیہ وسلم والا خطبہ ہے ورنہ نہیں، ایک یہ کہ اس میں قرآن مجید ضرور پڑھا جائے خواہ ایک آیت ہی ہو اور دوسری یہ کہ اس میں نصیحت کی جائے، اگر کسی خطبے میں تذکیر (نصیحت) نہیں تو وہ رسول اللہ صلی اللہ علیہ وسلم والا خطبہ نہیں۔ ظاہر ہے کہ نصیحت کا مقصد یہی ہے کہ لوگ اسے سمجھیں اور اس پر عمل کریں اور یہ مقصد تبھی حاصل ہو سکتا ہے جب لوگوں کو ان کی زبان میں سمجھایا جائے۔ ¤ حقیقت یہ ہے کہ جمعہ مسلمانوں کی ہفتہ وار عید ہے جس میں اللہ تعالیٰ کے ذکر، اس کی حمدو ثنا، قرآن و سنت کی تعلیم اور امر بالمعروف و نہی عن المنکرکا اہتمام ہوتا ہے اور وہ آئندہ سات دنوں کے لیے نئے سرے سے مصروف عمل ہو جاتے ہیں۔ چو نکہ یہ مذہبی شعار ہے اس لیے کوئی حکومت بھی اس اجتماع کو ختم نہیں کر سکتی۔ مسلمانوں کو عمل کے اندر کوتاہی یا دینِ حق سے انحراف یا کفار سے جہاد میں غفلت کی صورت میں ان کے علماء انھیں ان کا فریضہ یاد دلاتے ہیں، مگر جس طرح دوسرے کئی شعار کا حال خراب ہوا جمعہ کے متعلق بھی بعض لوگوں نے اپنے پاس سے ایسی کئی پابندیاں لگا دیں جن کی وجہ سے مسلمان عملاً اس کے فوائد سے محروم ہو گئے۔ ہر جمعہ کو تمام مسلمان قرآن و سنت کا جو علم حاصل کرتے تھے اور اللہ تعالیٰ کے احکام سے آگاہ ہوتے تھے، اب اپنے مسائل کے لیے ان علماء کے محتاج ہو گئے جو قرآن و حدیث سے مسائل لینے کے بجائے کسی ایک فقہی مکتب کے مقلد تھے، ان علماء کے مطابق قرآن مجید کا ترجمہ عام آدمی کے لیے پڑھنا ہی درست نہ تھا۔ مدت تک برصغیر میں قرآن مجید کے فارسی یا اردو ترجمے کی کسی کو جرأت ہی نہیں ہوئی۔ ان کے مطابق عام مسلمان کا کام یہ ہے کہ وہ خود قرآن یا حدیث دیکھنے کے بجائے عالم سے مسئلہ پوچھے اور اس عالم کا کام یہ ہے کہ قرآن یا حدیث میں سے مسئلہ بتانے کے بجائے اپنے امام کا قول بیان کرے۔ اس جمعہ میں قرآن یا حدیث کے بیان کا جو امکان تھا وہ انھوں نے اس طرح ختم کیا کہ اس کے لیے شہر اور حاکم کی شرط لگا دی، تو چند مقامات کے سوا باقی ہر جگہ جمعہ ویسے ہی بند ہو گیا، جبکہ عورتوں کے لیے مسجد میں آنا سرے سے ممنوع قرار دیا۔ پھر یہ شرط لگائی کہ جمعہ کا خطبہ صرف عربی میں ہو گا، تاکہ کوئی شخص قرآن و سنت سے واقف نہ ہو سکے، حالانکہ جس امام کے وہ مقلد ہیں ان کے نزدیک نماز میں بھی قرآن کی تلاوت فارسی یا کسی اور زبان میں کی جا سکتی ہے۔ بر صغیر پاک و ہند میں مدتوں یہی سلسلہ جاری رہا،آخر کار جب عمل بالحدیث کا غلغلہ بلند ہوا اور تقلید کی پابندیوں سے آزاد علماء نے اردو میں خطبہ شروع کیا اور لوگوں کو اصل قرآن و سنت سننے کا موقع ملا تو بجائے اس کے کہ وہ حضرات بھی اردو خطبہ دیتے، انھوں نے اذان کے بعد والے دو خطبے عربی میں ضروری قرار دینے پر اصرار جاری رکھا، مگر اس کے ساتھ اپنے مذہب کے دفاع کے لیے اردو میں ایک خطبے کا اضافہ کر دیا اور اس کا نام تقریر رکھ دیا، حالانکہ خطبہ ہو یا خطاب یا تقریر، ایک ہی چیزہے۔ ان حضرات نے یہ خیال نہیں فرمایا کہ اس طرح انھوں نے اردو میں خطبہ دے کر ایک تو وہی کام کیاجس سے وہ دوسروں کو روکتے تھے اور ایک یہ کہ انھوں نے دو خطبوں کے بجائے تیسرے خطبے کی بدعت ایجاد کر لی۔ یاد رکھیں کہ اگر ہم رسول اللہ صلی اللہ علیہ وسلم والا خطبہ جمعہ دینا چاہتے ہیں تو اس میں تذکیر (نصیحت) ضروری جز ہے، بلکہ یہ خطبے کا اصل مقصود ہے اور وہ لوگوں کو ان کی زبان میں سمجھائے بغیر ممکن نہیں۔ اس لیے خطبے صرف دو ہونے چاہییں اور عربی کے ساتھ ساتھ اسے مخاطب لوگوں کی زبان میں بھی سمجھانے کا اہتمام ہونا چاہیے۔ ¤ ➎ {قُلْ مَا عِنْدَ اللّٰهِ خَيْرٌ مِّنَ اللَّهْوِ وَ مِنَ التِّجَارَةِ … :} یعنی اللہ کی خاطر تم جس لہو (کھیل تماشے) اور تجارت کو چھوڑو گے اللہ کے پاس اس سے کہیں بہتر بدلا دنیا اور آخرت دونوں میں موجود ہے۔ ¤ ➏ صحابہ کرام رضی اللہ عنھم سے نادانی میں یہ عمل ہوا اور اللہ تعالیٰ نے اس پر تنبیہ فرمائی، اس کے بعد صحابہ کرام رضی اللہ عنھم نے جس طرح اللہ کے ذکر اور نماز کو تجارت وغیرہ پر ترجیح دی اس کا ذکر اللہ تعالیٰ نے سورۂ نور ( ۳۶ ، ۳۷) میں فرمایا ہے۔"
    }
  ]
}