{
  "surah": "At-Talaaq",
  "surah_number": 65,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ {يٰۤاَيُّهَا النَّبِيُّ اِذَا طَلَّقْتُمُ النِّسَآءَ … :} یہاںں ایک سوال ہے کہ پہلے {’’ يٰۤاَيُّهَا النَّبِيُّ ‘‘} کے ساتھ صرف نبی صلی اللہ علیہ وسلم کو خطاب کیا، پھر {’’ اِذَا طَلَّقْتُمْ‘‘} میں جمع کے صیغے کے ساتھ خطاب کیوں کیا گیا ہے؟ جواب اس کا یہ ہے کہ چونکہ طلاق کے احکام میں آپ صلی اللہ علیہ وسلم اور آپ کی امت دونوں مشترک ہیں، اس لیے آپ کو اور آپ کی امت دونوں کو مخاطب کرتے ہوئے {’’ اِذَا طَلَّقْتُمْ‘‘} فرمایا، مگر پہلے خاص طور پر آپ کو خطاب آپ کی تعظیم کے لیے ہے، جیسے کسی قوم کے سردار سے کہا جاتا ہے، اے فلاں! تم ایسا کرو، یعنی تم اور تمھاری قوم ایسا کرو۔ گویا یوں فرمایا کہ اے نبی! جب تم لوگ طلاق دو، یعنی آپ اور آپ کی امت طلاق دے۔ ¤ ➋ {’’ اِذَا طَلَّقْتُمْ‘‘} (جب تم طلاق دو) سے مراد یہ ہے کہ جب تم طلاق کا ارادہ کرو، جیسا کہ سورۂ مائدہ کی آیت (۶) {’’ اِذَا قُمْتُمْ اِلَى الصَّلٰوةِ فَاغْسِلُوْا وُجُوْهَكُمْ وَ اَيْدِيَكُمْ ‘‘} میں ہے۔ ¤ ➌ {’’ النِّسَآءَ ‘‘} سے مراد صرف وہ عورتیں ہیں جن کے ساتھ نکاح کے بعد دخول ہو چکا ہو، کیونکہ جن عورتوں کو دخول سے پہلے طلاق دے دی جائے ان کی کوئی عدت نہیں۔ (دیکھیے سورۂ احزاب : ۴۹)۔ ¤ ➍ {فَطَلِّقُوْهُنَّ لِعِدَّتِهِنَّ : } جب تم عورتوں کو طلاق دینا  چاہو تو یہ نہیں کہ جب چاہو طلاق دے دو، بلکہ ان کی عدت کے وقت طلاق دو، یعنی جب عورت حیض سے پاک ہو تو طہر کی حالت میں جماع کے بغیر طلاق دو، تاکہ اس کی عدت کسی کمی یا زیادتی کے بغیر پوری ہو، کیونکہ اگر تم حالت حیض میں طلاق دوگے تو اگر اس حیض کو عدت میں شمار کرو تو عدت تین حیض سے کم رہ جائے گی اور اگر شمار نہ کرو تو تین حیض سے زیادہ ہو جائے گی، کیونکہ بعد میں آنے والے تین حیضوں کے ساتھ اس حیض کے وہ ایام بھی شامل ہوں گے جو طلاق کے بعد باقی ہوں گے۔ اسی طرح اگر تم انھیں ایسے طہر میں طلاق دو گے جس میں ان کے ساتھ جماع کیا ہے تو ممکن ہے کہ حمل قرار پا جائے، اس صورت میں معلوم نہیں ہو سکے گا کہ اس کی عدت کے لیے تین حیض کا اعتبار ہو گا یا وضع حمل کا۔ عبداللہ بن عمر رضی اللہ عنھما بیان کرتے ہیں کہ انھوں نے اپنی بیوی کو طلاق دی جب وہ حیض کی حالت میں تھی، عمر رضی اللہ عنہ نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ مُرْهُ فَلْيُرَاجِعْهَا، ثُمَّ لِيُمْسِكْهَا حَتّٰی تَطْهُرَ ثُمَّ تَحِيْضَ، ثُمَّ تَطْههُرَ، ثُمَّ إِنْ شَاءَ أَمْسَكَ بَعْدُ وَ إِنْ شَاءَ طَلَّقَ قَبْلَ أَنْ يَمَسَّ، فَتِلْكَ الْعِدَّةُ الَّتِيْ أَمَرَ اللّٰهُ أَنْ تُطَلَّقَ لَهَا النِّسَاءُ ] [ بخاري، الطلاق، باب قول اللّٰہ تعالٰی : «یا أیھا النبي…» : ۵۲۵۱ ] ’’اسے حکم دو کہ وہ اس سے رجوع کرے، پھر اسے اپنے پاس رکھے یہاں تک کہ وہ پاک ہو، پھر اسے حیض آئے، پھر پاک ہو، پھر اگر چاہے تو اپنے پاس رکھے اور اگر چاہے تو چھونے سے پہلے طلاق دے دے، کیونکہ یہ ہے وہ عدت جس کے وقت اللہ تعالیٰ نے عورتوں کو طلاق دینے کا حکم دیا ہے۔‘‘ اگر عورت حاملہ ہو تو اسے کسی بھی وقت طلاق دی جا سکتی ہے، کیونکہ اس کی عدت وضع حمل معلوم اور واضح ہے، جیسا کہ آگے {’’ وَ اُولَاتُ الْاَحْمَالِ اَجَلُهُنَّ اَنْ يَّضَعْنَ حَمْلَهُنَّ ‘‘} میں آرہا ہے۔ ¤ ➎ اللہ تعالیٰ نے طلاق کے لیے یہ وقت اس لیے مقرر فرمایا ہے کہ جہاں تک ہو سکے میاں بیوی کا تعلق قائم رہے، اگر کبھی آدمی کو غصہ آئے تو فوراً طلاق نہ دے بلکہ اس وقت کا انتظار کرے جس کا اللہ تعالیٰ نے حکم دیا ہے۔ اتنی دیر میں غصہ ٹھنڈا ہو جائے گا اور حیض سے فراغت کے بعد خاوند کو بیوی کی طرف جو رغبت ہوتی ہے وہ طلاق سے باز رکھنے کا باعث ہوگی۔ اسی طرح حمل کی حالت خاوند کو طلاق سے روکنے کا باعث ہے، کیونکہ آنے والے مہمان کی امید اسے اس اقدام سے باز رکھنے والی ہے۔ ان دونوں وقتوں میں طلاق دینے کا مطلب یہ ہے کہ وہ طلاق کسی وقتی اشتعال کی وجہ سے نہیں بلکہ خوب سوچ سمجھ کر دی جا رہی ہے، اس کے بعد عدت کی صورت میں ایک خاصی مدت تک دونوں کو ایک گھر میں رہنے کا حکم دیا گیا، ہو سکتا ہے کہ ان کا تعلق باقی رہنے کی کوئی صورت نکل آئے۔ افسوس! مسلمانوں نے اللہ تعالیٰ کے اس حکم کی پروا ہی نہیں کی، (الاّما شاء اللہ ) حالانکہ اگر وہ طلاق کے لیے اس وقت کا انتظار کرتے جو اللہ تعالیٰ نے مقرر فرمایا ہے تو طلاق کی نوبت ہی بہت کم آتی، پھر عدت کی برکت سے دوبارہ رجوع کی بھی بہت امید تھی۔ ¤ ➏ ایک وقت میں صرف ایک طلاق دینا ہی جائز ہے، اس سے زیادہ دینا حرام ہے۔ اگر کوئی شخص ایک وقت میں ایک سے زیادہ طلاقیں دے دے تو صرف ایک طلاق ہوگی۔ تفصیل کے لیے دیکھیے سورۂ بقرہ (230،229)کی تفسیر۔ ¤ ➐ { وَ اَحْصُوا الْعِدَّةَ : ’’أَحْصٰي يُحْصِيْ‘‘} اچھی طرح شمار کرنا، گننا۔ یہ {’’حَصًي‘‘} (کنکریاں) سے مشتق ہے۔ عرب اُمی تھے، جب انھیں ایسی چیز گننا ہوتی جو تعداد میں زیادہ ہوتی تو ہر ایک کے لیے ایک کنکری رکھتے جاتے، آخر میں کنکریوں کو گن لیتے۔ {’’ الْعِدَّةَ ‘‘} (بروزن {فِعْلَةٌ}) بمعنی {’’مَعْدُوْدٌ‘‘} ہے، گنے ہوئے دن، جیسے {’’طِحْنٌ‘‘} بمعنی {’’مَطْحُوْنٌ‘‘} (پسا ہوا آٹا) ہے۔ یعنی وہ دن جن کے گزر جانے کے بعد کسی اور شخص سے نکاح حلال ہو جاتا ہے۔ اس پر ’’الف لام‘‘ عہد کا ہے، یعنی وہ عدت جو دوسری آیات میں بتائی گئی ہے۔ (دیکھیے بقرہ : ۲۲۸۔ طلاق : ۴) عدت کو اچھی طرح گننے کا حکم اس لیے دیا کہ ایسا نہ ہو کہ عدت گزرنے کے بعد بھی تم رجوع کر لو یا عدت گزرنے سے پہلے عورت کسی اور مرد سے نکاح کر لے، جب کہ یہ دونوں کام ناجائز ہیں۔ ¤ ➑ { وَ اتَّقُوا اللّٰهَ رَبَّكُمْ :} ذاتی نام {’’ اللّٰهَ ‘‘} اور وصفی نام {’’رَبٌّ‘‘} کا ذکر کر کے اللہ تعالیٰ سے، جو ہر لمحے انسان کی پرورش کر رہا ہے، ڈرنے کا حکم دیا، یعنی ان ایام میں طلاق دینے سے اللہ سے ڈرتے رہو جن میں طلاق دینا ممنوع ہے، کیونکہ اس میں اللہ کی نافرمانی بھی ہے اور عورت کو اذیت رسانی بھی۔ اسی طرح عدت کے ایام میں عورتوں کو گھروں سے نکالنے سے بھی ڈرو۔ ¤ ➒ { لَا تُخْرِجُوْهُنَّ مِنْۢ بُيُوْتِهِنَّ وَ لَا يَخْرُجْنَ : ’’ بُيُوْتِهِنَّ ‘‘} سے مراد خاوندوں کے گھر ہیں جن میں عورتیں رہ رہی ہیں، ان میں رہنے کی وجہ سے انھیں ان کے گھر فرمایا ہے۔ یعنی عورت کے لیے عدت کے ایام خاوند کے گھر میں گزارنا ضروری ہے، نہ خاوندوں کو انھیں ان کے گھروں سے نکالنے کی اجازت ہے نہ انھیں خود ان سے نکل جانے کی۔ اس کی حکمت آگے {’’ لَعَلَّ اللّٰهَ يُحْدِثُ بَعْدَ ذٰلِكَ اَمْرًا ‘‘} میں بیان فرمائی کہ اتنی مدت ایک گھر میں اکٹھے رہنے سے امید ہے کہ اللہ تعالیٰ ان کی باہمی صلح اور رجوع کی کوئی صورت پیدا فرما دے گا۔ اگر وہ دونوں ایک دوسرے سے اسی وقت الگ ہو گئے اور ملاقات کا موقع ہی نہ رہا تو رجوع کا معاملہ بہت مشکل ہے۔ اللہ تعالیٰ نے اپنا خوف دلا کر نہایت تاکید کے ساتھ یہ حکم دیا ہے، مگر مسلمانوں نے کم ہی اس کی پروا کی ہے، شاید ہی کوئی ایسا مرد ہو جو طلاق کے بعد عورت کو اپنے گھر میں رہنے دے یا کوئی ایسی عورت ہو جو وہاں رہے۔ ¤ ➓ { اِلَّاۤ اَنْ يَّاْتِيْنَ بِفَاحِشَةٍ مُّبَيِّنَةٍ : ’’ فَاحِشَةٌ ‘‘} کوئی بھی قول یا فعل جس میں بہت بڑی قباحت ہو۔ {’’ مُبَيِّنَةٍ ‘‘} کھلی اور واضح۔ {’’ بِفَاحِشَةٍ مُّبَيِّنَةٍ ‘‘} میں زنا، چوری وغیرہ کے علاوہ عورت کا خاوند سے یا اس کے اہلِ خانہ سے بدزبانی اور گالی گلوچ کرنا بھی شامل ہے۔ طبری نے محمد بن ابراہیم کی حسن سند کے ساتھ ابن عباس رضی اللہ عنھما سے نقل فرمایا ہے، انھوں نے فرمایا : [ اَلْفَاحِشَةُ أَنْ تَبْذُؤَ عَلٰی أَهْلِهَا ] ’’فاحشہ یہ ہے کہ گھر والوں پر زبان درازی کرے۔‘‘ ¤ ⓫ {وَ تِلْكَ حُدُوْدُ اللّٰهِ وَ مَنْ يَّتَعَدَّ حُدُوْدَ اللّٰهِ فَقَدْ ظَلَمَ نَفْسَهٗ :} یعنی وہ مرد جو عورت کو اس وقت طلاق دیتا ہے جب طلاق دینے کا وقت نہیں، یا عدت میں عورت کو گھر سے نکال دیتا ہے، یا وہ عورت جو خود ہی نکل جاتی ہے، یہ نہ سمجھیں کہ وہ معمولی خطا کر رہے ہیں، بلکہ وہ اللہ کی مقرر کردہ حدیں پھلانگ رہے ہیں اور جو اللہ کی حدیں پھلانگتا ہے یقینا وہ اپنی جان پر ظلم کر رہا ہے۔ ¤ ⓬ {لَا تَدْرِيْ لَعَلَّ اللّٰهَ يُحْدِثُ بَعْدَ ذٰلِكَ اَمْرًا :} یعنی طلاق کے بعد عورت کو عدت کے دوران خاوند کے گھر میں رہنے کا حکم اس لیے ہے کہ شاید اللہ تعالیٰ اس کے بعد ان کی باہمی موافقت کی کوئی صورت پیدا فرما دے اور خاوند اس سے رجوع کر لے۔ اس سے معلوم ہوا کہ خاوند کے گھر میں رہ کر عدت گزارنے کا حکم اس طلاق میں ہے جس سے رجوع ہو سکتا ہو اور وہ صرف پہلی اور دوسری طلاق ہے، ان دونوں کو رجعی طلاق کہتے ہیں، ان کی عدت کے دوران عورت کی رہائش اور نفقہ خاوند کے ذمے ہے۔ رہی تیسری طلاق کی عدت، تو اگرچہ عورت اس کے دوران آگے نکاح نہیں کر سکتی مگر خاوند رجوع بھی نہیں کر سکتا، اس لیے اس کے دوران اس کی رہائش نہ صرف یہ کہ خاوند کے ذمے نہیں بلکہ اس کا خاوند کے ساتھ اس کے گھر میں رہنا ہی ٹھیک نہیں، کیونکہ اس میں سابقہ بے تکلفی کی وجہ سے ان کے حد سے تجاوز کا خطرہ ہے جب کہ وہ عورت اس کے لیے حلال نہیں، جیسا کہ فرمایا : «فَاِنْ طَلَّقَهَا فَلَا تَحِلُّ لَهٗ مِنْۢ بَعْدُ حَتّٰى تَنْكِحَ زَوْجًا غَيْرَهٗ» [ البقرۃ : ۲۳۰ ] ’’پھر اگر وہ اسے (تیسری) طلاق دے دے تو اس کے بعد وہ اس کے لیے حلال نہیں ہوگی، یہاں تک کہ اس کے علاوہ کسی اور خاوند سے نکاح کرے۔‘‘ اگرچہ بہت سے ائمہ نے اس کی رہائش خاوند کے ذمے قرار دی ہے، مگر اس آیت کے مطابق اور رسول اللہ صلی اللہ علیہ وسلم کی صحیح حدیث کے مطابق تیسری طلاق کے بعد اس کی رہائش خاوند کے ذمے نہیں ہے۔ فاطمہ بنت قیس رضی اللہ عنھا فرماتی ہیں : [ أَنَّهُ طَلَّقَهَا زَوْجُهَا فِيْ عَهْدِ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ وَ كَانَ أَنْفَقَ عَلَيْهَا نَفَقَةَ دُوْنٍ، فَلَمَّا رَأَتْ ذٰلِكَ قَالَتْ وَاللّٰهِ ! لَأُعْلِمَنَّ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ ع عَلَيْهِ وَسَلَّمَ فَإِنْ كَانَ لِيْ نَفَقَةٌ أَخَذْتُ الَّذِيْ يُصْلِحُنِيْ وَإِنْ لَمْ تَكُنْ لِيْ نَفَقَةٌ لَمْ آخُذْ مِنْهُ شَيْئًا، قَالَتْ فَذَكَرْتُ ذٰلِكَ لِرَسُوْلِ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا نَفَقَةَ لَكِ وَلَا سُكْنٰي ] [مسلم، الطلاق، باب المطلقۃ البائن لا نفقۃ لہا : ۳۷ /۱۴۸۰ ] ’’نبی صلی اللہ علیہ وسلم کے زمانے میں ان کے خاوند نے انھیں طلاق دے دی اور انھیں معمولی خرچہ دیا۔ جب انھوں نے یہ دیکھا تو کہا : ’’اللہ کی قسم! میں یہ بات رسول اللہ صلی اللہ علیہ وسلم کے علم میں لاؤں گی، پھر اگر میرے لیے خرچہ ہوا تو اتنا لوں گی جو میری حالت درست رکھ سکے اور اگر میرے لیے خرچہ نہ ہوا تو میں اس سے کچھ بھی نہیں لوں گی۔‘‘ فرماتی ہیں، میں نے یہ بات رسول اللہ صلی اللہ علیہ وسلم سے ذکر کی تو آپ صلی اللہ علیہ وسلم نے فرمایا : ’’تیرے لیے نہ خرچہ ہے نہ رہائش۔‘‘ یاد رہے کہ صحیح مسلم کے اسی باب کی ایک روایت میں صراحت ہے کہ ان کے خاوند نے انھیں تیسری طلاق دے دی تھی۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ { فَاِذَا بَلَغْنَ اَجَلَهُنَّ :} یعنی جب ان کی عدت ختم ہونے کے قریب پہنچ جائے، کیونکہ عدت ختم ہونے کے بعد تو رجوع ہو نہیں سکتا۔ ¤ ➋ {فَاَمْسِكُوْهُنَّ بِمَعْرُوْفٍ اَوْ فَارِقُوْهُنَّ بِمَعْرُوْفٍ … :} یعنی جب عورتوں کی عدت ختم ہونے کے قریب ہو، صرف اتنی باقی ہو جس میں ان سے رجوع ہو سکتا ہو تو انھیں معروف (اچھے طریقے) کے ساتھ روک لو یا معروف کے ساتھ ان سے جدا ہو جاؤ۔ معروف کے ساتھ روکنے کا مطلب یہ ہے کہ آئندہ اچھے طریقے سے ان کے ساتھ رہنے کی نیت سے ان سے رجوع کر کے حسب سابق بیوی بنا کر رکھ لو اور اس رجوع پر گواہ بناؤ اور معروف طریقے سے جدا ہونے کا مطلب یہ ہے کہ ان سے رجوع نہ کرو بلکہ انھیں ان کے حال پر رہنے دو، تاکہ عدت ختم ہو جائے اور وہ خود بخود تم سے جدا ہو جائیں، پھر کسی لڑائی جھگڑے یا برا بھلا کہنے کے بغیر انھیں رخصت کر دو۔ اس میں اچھائی یہ ہے کہ اگرچہ عدت گزرنے کی وجہ سے وہ آزاد ہیں کہ جس مرد سے چاہیں شادی کر لیں، مگر انھیں پہلے خاوندوں سے شادی کا بھی اختیار ہے۔ ¤ ➌ سورۂ بقرہ میں اور یہاں پہلی یا دوسری طلاق کے بعد دو ہی صورتیں بیان فرمائی ہیں، ایک یہ کہ عدت ختم ہونے سے پہلے رجوع کر لو، دوسری یہ کہ اچھے طریقے سے چھوڑ دو، یعنی رجوع نہ کرو بلکہ عدت ختم ہونے دو اور اچھے طریقے سے جدا ہو جاؤ، عدت ختم ہونے سے پہلے دوسری یا تیسری طلاق دینے کا حکم نہیں دیا۔ جس عورت کو حیض آتا ہو اس کے لیے طلاقِ سنت یہی ہے۔ بعض حضرات طلاق کا سنت طریقہ یہ بیان کرتے ہیں کہ جب عورت حیض سے پاک ہو تو جماع کے بغیر اسے ایک طلاق دو، اگلے طہر میں دوسری طلاق دو اور تیسرے طہر میں تیسری طلاق دو، حالانکہ یہ ہرگز طلاقِ سنت نہیں ہے۔ یہ طلاقِ سنت کیسے ہو سکتی ہے جب کہ ابھی پہلی طلاق کی عدت جاری ہے، نہ وہ آخر کو پہنچی ہے نہ اس سے رجوع ہوا ہے، تو دوسری اور تیسری طلاق کا کیا مطلب؟ پھر اس میں بلا ضرورت عورت کو ہمیشہ کے لیے حرام کرنے کی تلقین کی گئی ہے جو شریعت کے مقصد ہی کے خلاف ہے۔ طلاق سنت صرف دو ہی ہیں، ایک وہ جو آیت میں مذکور ہے اور عبداللہ بن عمر رضی اللہ عنھما نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ہے کہ عورت حیض سے پاک ہو تو جماع کے بغیر اسے طلاق دی جائے، پھر اگر اسے بسانے کی نیت ہو تو عدت ختم ہونے سے پہلے رجوع کر لے، یا عدت ختم ہو جانے دے، جس سے وہ خود بخود جدا ہو جائے گی۔ طلاقِ سنت کی دوسری صورت یہ ہے کہ حمل کی حالت میں طلاق دے، پھر وضع حمل سے پہلے یا تو رجوع کرلے یا عدت ختم ہونے پر علیحدگی اختیار کرلے۔ ¤ ہر طہر میں طلاق کو سنت قرار دینے والے دلیل میں عبداللہ بن مسعود رضی اللہ عنہ کا قول بیان کرتے ہیں، سنن نسائی میں ہے : [ أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَی بْنِ أَيُّوْبَ قَالَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ قَالَ حَدَّثَنَا الْأَعْمَشُ، عَنْ أَبِيْ إِسْحَاقَ، عَنْ أَبِي الْأَحْوَصِ، عَنْ عَببْدِ اللّٰهِ أَنَّهُ قَالَ طَلاَقُ السُّنَّةِ تَطْلِيْقَةٌ وَهِيَ طَاهِرٌ فِيْ غَيْرِ جِمَاعٍ فَإِذَا حَاضَتْ وَطَهُرَتْ طَلَّقَهَا أُخْرٰی فَإِذَا حَاضَتْ وَطَهُرَتْ طَلَّقَهَا أُخْرٰیی ثُمَّ تَعْتَدُّ بَعْدَ ذٰلِكَ بِحَيْضَةٍ ] [ نسائي، الطلاق، باب طلاق السنۃ : ۳۴۲۳ ] ’’عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا : ’’طلاق سنت یہ ہے کہ عورت کو طہر کی حالت میں جماع کے بغیر ایک طلاق دے، پھر جب اسے حیض آئے اور وہ پاک ہو تو اسے دوسری طلاق دے، پھر جب اسے حیض آئے اور وہ پاک ہو تو اسے تیسری طلاق دے، پھر اس کے بعد ایک حیض عدت گزارے۔‘‘ مگر اس روایت میں طلاقِ سنت کی جو تفصیل آئی ہے درست نہیں، کیونکہ یہ قرآن کی آیت کے خلاف ہے اور خود عبداللہ بن مسعود رضی اللہ عنہ سے طلاق کا طریقہ آیت کے مطابق اس سند سے بہتر سند کے ساتھ ثابت ہے۔ ابن ابی شیبہ رحمہ اللہ فرماتے ہیں : [ حَدَّثَنَا وَكِيْعٌ، عَنْ إِسْرَائِيْلَ، عَنْ أَبِيْ إِسْحَاقَ، عَنْ أَبِي الْأَحْوَصِ، عَنْ عَبْدِ اللّٰهِ قَالَ مَنْ أَرَادَ الطَّلاَقَ الَّذِيْ هُوَ الطَّلاَقُ فَلْيُطَلِّقْهَا تَطْلِيْقَةً، ثُمَّ يَدَعُهَا حَتّٰی تَحِيْضَ ثَلاَثَ حِيَضٍ ] [مصنف ابن أبي شیبۃ، الطلاق، باب ما یستحب من طلاق السنۃ : 4/5، ح : ۱۸۰۳۶ ] ’’عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا : ’’جو شخص طلاق دینا چاہے، جو اصل طلاق ہے، وہ عورت کو ایک طلاق دے، پھر اسے اس کے حال پر چھوڑ دے یہاں تک کہ اسے تین حیض آ جائیں۔‘‘ ¤ واضح رہے کہ عبد اللہ بن مسعود رضی اللہ عنہ سے مروی دونوں روایتوں کی سند ابو اسحاق سے عبداللہ بن مسعود رضی اللہ عنہ تک ایک ہی ہے، پھر نسائی کی روایت میں ابو اسحاق سے بیان کرنے والے اعمش ہیں جو مشہور مدلس ہیں، جب کہ ابن ابی شیبہ کی سند میں ابو اسحاق سے بیان کرنے والے ان کے پوتے اسرائیل بن یونس بن اسحاق ہیں جن کے متعلق ابو حاتم نے فرمایا : {’’هُوَ مِنْ أَتْقَنِ أَصْحَابِ أَبِيْ إِسْحَاقَ‘‘} ’’وہ ابو اسحاق کے سب سے پختہ شاگردوں میں سے ہیں۔‘‘ یاد رہے کہ اسرائیل پر تدلیس کی تہمت بھی نہیں، اس لیے انھی کی روایت معتبر ہوگی۔ نسائی میں ابن مسعود رضی اللہ عنہ سے طلاقِ سنت کی جو تعریف اعمش نے روایت کی ہے وہ صحیح نہیں۔ ¤ ➍ { وَ اَشْهِدُوْا ذَوَيْ عَدْلٍ مِّنْكُمْ :} یعنی جب رجوع کا ارادہ کرو تو دو صاحب عدل آدمی گواہ بنا لو، تاکہ بعد میں کسی قسم کے جھگڑے کا یا گناہ میں مبتلا ہونے کا خطرہ باقی نہ رہے۔ مثلاً اگر خاوند نے رجوع کر لیا ہو مگر گواہ نہ بنائے ہوں اور فوت ہو جائے تو اس کے وارث اس کی بیوی کو اس کی میراث سے یہ کہہ کر محروم کر سکتے ہیں کہ تمھیں تو طلاق ہو چکی تھی اور رجوع کا کوئی گواہ نہیں، اس لیے تم نہ اس کی بیوی رہی ہو اور نہ میراث میں تمھارا حق ہے۔ اسی طرح اگر خاوند گواہوں کے بغیر رجوع کر لے اور عورت اللہ سے نہ ڈرتی ہو اور کہیں اور نکاح کرنا چاہتی ہو تو عدت ختم ہونے پر کہہ سکتی ہے کہ خاوند نے مجھ سے رجوع نہیں کیا، اب میں آزاد ہوں اور جہاں چاہوں نکاح کروں۔ اسی طرح اگر گواہی کی شرط نہ ہو تو عدت ختم ہونے کے بعد بھی خاوند دعویٰ کر سکتا ہے کہ میں نے عدت ختم ہونے سے پہلے رجوع کر لیا تھا۔ رجوع کی طرح عدت کے خاتمے پر ایک دوسرے سے علیحدگی کی صورت میں بھی گواہ بنانے کا حکم ہے، تاکہ اس طرح کی قباحتوں میں سے کوئی قباحت پیدا نہ ہو جن کا اوپر ذکر ہوا۔ ¤ واضح رہے کہ سنت یہی ہے کہ طلاق اور رجوع دونوں پر گواہ بنائے جائیں، مطرف بن عبداللہ کہتے ہیں : [ أَنَّ عِمْرَانَ بْنَ حُصَيْنٍ سُئِلَ عَنِ الرَّجُلِ يُطَلِّقُ امْرَأَتَهُ ثُمَّ يَقَعُ بِهَا وَلَمْ يُشْهِدْ عَلٰی طَلاَقِهَا وَلاَ عَلٰی رَجْعَتِهَا فَقَالَ طَلَّقْتَ لِغَيْرِ سُنَّةٍ وَرَاجَعْتَ لِغَيْرِ سُنَّةٍ أَشْهِدْ عَلٰی طَلاَقِهَا وَعَلٰی رَجْعَتِهَا وَلاَ تَعُدْ ] [أبو داوٗد، الطلاق، باب الرجل یراجع ولایشھد : ۲۱۸۶ ] ’’عمران بن حصین رضی اللہ عنہ سے اس آدمی کے بارے میں سوال کیا گیا جو اپنی بیوی کو طلاق دے دیتا ہے پھر اس سے جماع کر لیتا ہے، لیکن نہ اس نے اس کی طلاق پر کوئی گواہ بنایا ہے اور نہ اس کے رجوع پر؟ تو انھوں نے فرمایا : ’’تم نے سنت کے خلاف طلاق دی اور سنت کے خلاف ہی رجوع کیا۔ اس کی طلاق پر گواہ بناؤ اور اس کے رجوع پر بھی گواہ بناؤ اور دوبارہ ایسا نہ کرنا۔‘‘ ¤ ➎ { وَ اَقِيْمُوا الشَّهَادَةَ لِلّٰهِ :} یہ گواہوں کو حکم ہے کہ اللہ کی رضا کے لیے شہادت دو۔ یہ حکم اس لیے دیا کہ گواہی دینے میں آدمی کو کئی مشکلات درپیش ہوتی ہیں، اسے اپنے نہایت اہم کام ترک کرنا پڑتے ہیں، حاکم کے پاس حاضری دینا پڑتی ہے اور بعض اوقات دور دراز سے آنا پڑتا ہے۔ اس کے علاوہ کئی لوگوں کی ناراضی کا خطرہ مول لینا پڑتا ہے اور کئی اور موانع بھی ہوتے ہیں، صرف اللہ کی رضا ایسی چیز ہے جس کی خاطر آدمی ہر مشقت برداشت کرتے ہوئے شہادت دیتا ہے اور سچی شہادت دیتا ہے۔ ¤ ➏ { ذٰلِكُمْ يُوْعَظُ بِهٖ … :} بعض حضرات نے یہاں یہ نکتہ بیان فرمایا ہے کہ اوپر طلاق کا وقت مقرر کرنے یا اس کا شمار کرنے، عدت کے دوران گھر سے نہ نکالنے، عدت ختم ہونے سے پہلے رجوع کر لینے یا علیحدگی اختیار کرنے اور گواہ بنانے کے جو احکام دیے گئے ہیں ان کی حیثیت وعظ و نصیحت کی ہے، قانون کی نہیں۔ ان حضرات کی یہ بات درست نہیں، حقیقت یہ ہے کہ یہ احکام بھی قانون کی حیثیت رکھتے ہیں، طلاق یا رجوع یا جو بھی عمل ان کے خلاف ہوگا اس کا کچھ اعتبار نہیں، مثلاً کوئی شخص عدت کا شمار ہی نہیں کرتا تو اس کا رجوع یا فراق کیسے معتبر ہو سکتا ہے؟ ہاں اگر کسی دوسری دلیل سے ثابت ہو جائے کہ ان میں سے فلاں حکم استحباب کے لیے ہے تو الگ بات ہے۔ قرآن مجید کی اصطلاح میں وعظ کا لفظ نہایت تاکید والے احکام کے لیے آتا ہے، جن کے قانون ہونے میں کسی کا اختلاف نہیں۔ دیکھیے سورۂ مجادلہ (۳)، بقرہ (۲۳۱)، نحل (۹۰) اور نور (۱۷)۔ ¤ ➐ { وَ مَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مَخْرَجًا :} میاں بیوی کے باہمی معاملات کو ان کے سوا یا اللہ تعالیٰ کے سوا کوئی نہیں جانتا، اگر ان میں سے کوئی ظلم، زیادتی یا خیانت کے بعد غلط بیانی پر اتر آئے تو دنیا میں اسے کوئی جھٹلا نہیں سکتا، صرف اللہ تعالیٰ کا ڈر ہی ایسی چیز ہے جو انھیں ہر قسم کے گناہ سے باز رکھ سکتا ہے، اس لیے اللہ تعالیٰ نے ہر معاملے کی طرح نکاح و طلاق کے معاملے میں بھی اپنے تقویٰ کی تاکید فرمائی ہے۔ رسول اللہ صلی اللہ علیہ و وسلم نکاح کے موقع پر جو تین آیات پڑھتے تھے ان تینوں میں تقویٰ کی تاکید فرمائی ہے۔ یہاں اس بات کی طرف توجہ دلائی کہ گھریلو جھگڑوں میں آدمی اپنے آپ کو حق پر ثابت کرنے کے لیے غلط کام یا غلط بات کرتا ہے اور سمجھتا ہے کہ اس طرح میرے مسائل حل ہو جائیں گے اور اگر میں اللہ سے ڈر کر صحیح کام کروں گا یا صحیح بات کروں گا تو پھنس جاؤں گا۔ اللہ تعالیٰ نے فرمایا کہ آسان یا مشکل ہر موقع پر تم اللہ سے ڈرتے رہو اور وہی کام کرو جو اس کے تقویٰ کا تقاضا ہے۔ پھنسنے سے مت گھبراؤ، جو بھی اللہ سے ڈرے گا اللہ تعالیٰ اس کے لیے نکلنے کا راستہ بنا دے گا اور تقویٰ اختیار کرنے میں اگر کوئی نقصان ہوتا ہے، بیوی ساتھ نہیں رہتی یا مال کا نقصان ہوتا ہے تو اللہ تعالیٰ اس کی تلافی کے لیے اس سے بھی بہتر چیز وہاں سے دے گا جہاں سے اس کا گمان بھی نہیں ہوگا۔ دوسری جگہ اللہ تعالیٰ نے بگڑے ہوئے معاملات کو درست کرنے کے لیے چالاکی اختیار کرنے اور جھوٹ فریب سے اپنے آپ کو حق پر ثابت کرنے کے بجائے اللہ سے ڈرنے اور سیدھی اور صاف بات کہنے کا حکم دیا اور اس پر تمام بگڑے ہوئے معاملات کو درست کر دینے اور گزشتہ غلطیوں پر پردہ ڈال دینے کا وعدہ کیا، فرمایا : « يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَ قُوْلُوْا قَوْلًا سَدِيْدًا (70) يُّصْلِحْ لَكُمْ اَعْمَالَكُمْ وَ يَغْفِرْ لَكُمْ ذُنُوْبَكُمْ وَ مَنْ يُّطِعِ اللّٰهَ وَ رَسُوْلَهٗ فَقَدْ فَازَ فَوْزًا عَظِيْمًا » [ الأحزاب : 71،10 ] ’’اے لوگو جو ایمان لائے ہو ! اللہ سے ڈرو اور بالکل سیدھی بات کہو۔ وہ تمھارے لیے تمھارے اعمال درست کر دے گا اور تمھارے لیے تمھارے گناہ بخش دے گا اور جو اللہ اور اس کے رسول کی فرماں برداری کرے تو یقینا اس نے کامیابی حاصل کرلی، بہت بڑی کامیابی۔‘‘ ¤ ➑ {’’ وَ مَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مَخْرَجًا (2) وَّ يَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ‘‘} کی جو تفسیر اوپر کی گئی ہے وہ اس مقام کی مناسبت سے ہے، ورنہ آیت کے الفاظ عام ہیں۔ اس لیے صرف نکاح و طلاق ہی نہیں، کسی مسئلے میں بھی جو شخص اللہ سے ڈرے گا اور مشکل سے مشکل حالات میں بھی اس کی نافرمانی سے بچے گا اللہ تعالیٰ جلدی یا دیر سے اس کے لیے نکلنے کا راستہ ضرور نکال دے گا اور اسے وہاں سے رزق دے گا جہاں سے اسے گمان بھی نہیں ہوگا۔ اسی طرح جو اللہ سے ڈرتا رہے گا اللہ تعالیٰ اس کے لیے دنیا کے غم، آخرت کی فکر اور موت اور قیامت کی سختیوں سے نکلنے کا راستہ بھی بنا دے گا۔ ¤ ➒ ابن کثیر نے ابن ابی حاتم کے حوالے سے عبداللہ بن مسعود رضی اللہ عنہ کا قول ذکر کیا ہے کہ انھوں نے فرمایا : [ إِنَّ أَجْمَعَ آيَةٍ فِي الْقُرْآنِ : « اِنَّ اللّٰهَ يَاْمُرُ بِالْعَدْلِ وَ الْاِحْسَانِ» [النحل : ۹۰ ] وَإِنَّ أَكْبَرَ آيَةٍ فِي الْقُرْآنِ فَرَجًا : « وَ مَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مَخْرَجًا » [الطلاق : ۲ ] ] ’’قرآن کی سب سے جامع آیت {’’ اِنَّ اللّٰهَ يَاْمُرُ بِالْعَدْلِ وَ الْاِحْسَانِ ‘‘} ہے اور قرآن کی مشکل سے نکلنے کی سب سے بڑی آیت {’’ وَ مَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مَخْرَجًا ‘‘} ہے۔‘‘ ابن کثیر کے محقق حکمت بن بشیر نے فرمایا کہ اس کی سند جید ہے۔ ¤ ➓ واضح رہے کہ اس مقام پر ابن کثیر نے مالک بن اشجعی رضی اللہ عنہ کے بیٹے عوف بن مالک رضی اللہ عنہ کا واقعہ ذکر کیا ہے جو دشمن کے ہاتھوں گرفتار ہو گیا اور انھوں نے اسے باندھ رکھا تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی طرف پیغام بھیجو کہ وہ {’’لاَحَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللّٰهِ‘‘} کثرت سے پڑھے، جس کے نتیجے میں اس کی ہتھکڑیاں گر گئیں اور وہ دشمن کے اونٹ سمیٹ کر خیریت سے واپس آگیا۔ اس پر یہ آیت اتری : « وَ مَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مَخْرَجًا (2) وَّ يَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ » اللہ تعالیٰ کی رحمت اور قدرت کے لحاظ سے ایسا ہونا کچھ مشکل نہیں، مگر تفسیر ابن کثیر کے محقق حکمت بن بشیر نے لکھا ہے کہ اس کی سب سندیں مرسل یا منقطع ہونے کی وجہ سے ضعیف ہیں۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) ➊ {وَ يَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ :} مفسر عبدالرحمن کیلانی لکھتے ہیں : ’’اس مقام پر رزق کا ذکر اس لیے کیا گیا کہ انسان دوران عدت مطلقہ عورت پر خرچ کرنے اور اس کو بھلے طریقے سے رخصت کرنے میں بخل سے کام نہ لے، بلکہ اس سے جتنا بہتر سلوک کر سکتا ہے کرے۔ نیز بعض دفعہ صورت حال یہ ہوتی ہے کہ میاں بیوی کی آپس میں ٹھنی رہتی ہے، مگر عورت صاحب جائداد ہوتی ہے یا اچھا کما سکتی ہے تو خاوند اس کو چھوڑنے ہی پر آمادہ نہیں ہوتا، مگر اس سے اچھا سلوک کرنے میں بھی ناکام ثابت ہوتا ہے، لہٰذا وہ عورت کو اپنے ہاں لٹکائے رکھتا ہے۔ ایسی سب صورتوں میں اللہ سے ڈرتے ہوئے وہی کام کرنا چاہیے جو اللہ کا حکم ہو، تنگ دستی سے نہیں ڈرنا چاہیے، کیونکہ اللہ کا وعدہ ہے کہ جو شخص اللہ پر بھروسا کرتے ہوئے اس سے ڈر کر اسی کے حکم کے مطابق چلے گا تو اس کی تنگدستی کو دور کرنا اللہ کے ذمے ہے، وہ اس کو ایسی جگہ سے رزق پہنچانے کا انتظام فرما دے گا جو پہلے اس کے وہم و گمان میں بھی نہ تھی۔‘‘ (تیسیر القرآن) ¤ ➋ { وَ مَنْ يَّتَوَكَّلْ عَلَى اللّٰهِ فَهُوَ حَسْبُهٗ … :} یعنی جو شخص غلط کام سے بچتے ہوئے حق پر قائم رہے اور اپنا معاملہ اور نفع و نقصان اللہ کے سپرد کر دے تو اللہ تعالیٰ اسے کافی ہو جائے گا، کیونکہ ہر قسم کے ظاہری اور باطنی اسباب اللہ تعالیٰ کے ہاتھ میں ہیں، جب کہ انسان کی نظر صرف چند ظاہری اسباب تک محدود ہوتی ہے۔ اللہ تعالیٰ جس طرح چاہے اپنے ڈرنے والے کے لیے پریشانیوں سے نجات کی راہ پیدا کر سکتا ہے اور وہ پریشانی اور تنگدستی دور کرنے کے لیے نئے اسباب بھی پیدا فرما سکتا ہے اور اسباب کے بغیر بھی جو چاہے کر سکتا ہے، کیونکہ اس کی قدرت اسباب کی پابند نہیں بلکہ اسباب اس کی مشیت کے تابع ہیں۔ وہ ظاہری اسباب سے بھی ایسے نتائج ظاہر کر سکتا ہے جو انسانی عقل کے برعکس ہوں، وہ نہ چاہے تو مجرب دوا بھی شفا کے بجائے بیماری کا باعث بن جاتی ہے اور چاہے تو مضر صحت چیز شفا کا ذریعہ بن جاتی ہے۔ ¤ ➌ { قَدْ جَعَلَ اللّٰهُ لِكُلِّ شَيْءٍ قَدْرًا :} یعنی اگر کسی شخص کو اللہ تعالیٰ سے ڈرنے کے باوجود نکلنے کی راہ نہیں ملی اور نہ ہی اللہ پر توکل کے باوجود اس کی پریشانی دور ہوئی ہے تو اسے گھبرانا نہیں چاہیے بلکہ صبر اور حوصلے کے ساتھ اللہ تعالیٰ کی رحمت اور کشادگی کا منتظر رہنا چاہیے، کیونکہ اللہ تعالیٰ نے جو فرمایا اسے ہر حال میں پورا کرنے والا ہے، مگر اللہ تعالیٰ نے ہر چیز کا ایک اندازہ اور وقت اپنے کامل علم کے ساتھ شروع سے مقرر فرمایا ہے، اس مقرر وقت پر اس کا توکل کرنے والوں کے لیے کافی ہو جانے کا وعدہ ضرور پورا ہوگا۔ حقیقت یہ ہے کہ تقدیر پر ایمان ہی انسان کو مشکلات میں صبر اور حوصلہ دلاتا ہے، فرمایا : «قُلْ لَّنْ يُّصِيْبَنَاۤ اِلَّا مَا كَتَبَ اللّٰهُ لَنَا هُوَ مَوْلٰىنَا وَ عَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ » [ التوبۃ : ۵۱ ] ’’کہہ دے ہمیں ہرگز نہیں پہنچے گا مگر وہی جو اللہ نے ہمارے لیے لکھ دیا، وہی ہمارا مالک ہے اور اللہ ہی پر پس لازم ہے کہ ایمان والے بھروسا کریں۔‘‘ مزید دیکھیے سورۂ قمر (۴۹)، فرقان (۲)، رعد (۸) اور سورۂ حجر (۲۱)۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {وَ الّٰٓـِٔيْ يَىِٕسْنَ مِنَ الْمَحِيْضِ مِنْ نِّسَآىِٕكُمْ … : ’’ الّٰٓـِٔيْ ‘‘ ’’اَللَّاتِيْ‘‘} کی طرح {’’اَلَّتِيْ‘‘} کی جمع ہے، وہ عورتیں۔ {’’ ارْتَبْتُمْ ‘‘ ’’رَيْبٌ‘‘} (شک) میں سے باب افتعال ماضی مطلق معروف جمع مذکر حاضر کا صیغہ ہے، اصل میں {’’اِرْتَيَبْتُمْ‘‘} تھا۔ یعنی وہ عورتیں جو حیض سے ناامید ہو چکی ہیں اور وہ عورتیں جنھیں حیض آیا ہی نہیں، اگر انھیں دخول کے بعد طلاق ہو تو ان کی عدت تین قمری مہینے ہے، جب کہ دخول کے بغیر طلاق ہو تو ان پر کوئی عدت نہیں۔ دیکھیے سورۂ احزاب (۴۹)۔ ¤ ➋ {’’ اِنِ ارْتَبْتُمْ ‘‘} (اگر تمھیں شک ہو) کے تین مطلب ہو سکتے ہیں، ایک یہ کہ اگر تمھیں شک ہو کہ عدت تو حیض سے شمار ہوتی ہے اور ان عورتوں کا حیض بند ہے یا آیا ہی نہیں تو ان کی عدت کا کیا کیا جائے، تو ہم تمھیں بتاتے ہیں کہ ان کی عدت تین قمری مہینے ہے۔ ابن کثیر نے فرمایا کہ یہ سعید بن جبیر سے مروی ہے اور ابن جریر نے یہی معنی پسند فرمایا ہے اور معنی کے لحاظ سے زیادہ ظاہر یہی ہے۔ ابن جریر نے اس پر اُبی بن کعب رضی اللہ عنہ کی روایت بطور دلیل ذکر فرمائی ہے کہ انھوں نے عرض کیا : ’’یا رسول اللہ! کئی طرح کی عورتوں کی عدت کا ذکر قرآن میں نہیں آیا، یعنی چھوٹی عمر کی عورتیں، عمر رسیدہ عورتیں اور حاملہ عورتیں۔ تو اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی : « وَ الّٰٓـِٔيْ يَىِٕسْنَ مِنَ الْمَحِيْضِ مِنْ نِّسَآىِٕكُمْ » ’’اور وہ عورتیں جو تمھاری عورتوں میں سے حیض سے ناامید ہو چکی ہیں۔‘‘ ابن کثیر نے اس کے علاوہ ابن ابی حاتم کی سند کے ساتھ اسی مفہوم کی مفصل روایت ذکر کی ہے، مگر تفسیر ابن کثیر کے محقق حکمت بن بشیر نے فرمایا کہ ان دونوں کی سند میں عمرو بن سالم (ابو عثمان انصاری) راوی ہے جسے تقریب میں مقبول کہا گیا ہے، یعنی اس کی متابعت ہو تو اس کی روایت قبول ہے ورنہ کمزور ہے اور یہاں اس کی متابعت نہیں کی گئی، لہٰذا اس کی سند ضعیف ہے۔ اس تفسیر کے مطابق {’’ اِنِ ارْتَبْتُمْ ‘‘} کے الفاظ کا کوئی خاص فائدہ نظر نہیں آتا۔ ¤ دوسرا مطلب یہ ہے کہ اگر ایسی عورتوں کو جو حیض سے مایوس ہو چکی ہیں، بیماری کا خون (استحاضہ) شروع ہو جائے اور تم فیصلہ نہ کر سکو کہ یہ حیض ہے یا استحاضہ تو ان کی عدت تین قمری مہینے ہے۔ یہ مجاہد اور زہری کا قول ہے۔ [ طبري : 69/23، ح : ۳۴۶۱۷، ۳۴۶۱۸، بسند صحیح ] اس سے ظاہر ہے کہ جب شک کی صورت میں ان کی عدت تین ماہ ہے تو اگر انھیں کسی قسم کا خون آتا ہی نہیں اور ان کے حیض سے مایوس ہونے میں کوئی شک ہی نہیں تو ان کی عدت بالاولیٰ تین ماہ ہے۔ تیسرا مطلب یہ ہے کہ اگرچہ عام قاعدہ یہی ہے کہ جن عورتوں کا حیض بند ہو گیا ہو یا شروع ہی نہ ہوا ہو انھیں حمل نہیں ہوتا، مگر شاذ و نادر ایسی عورتوں کو بھی حمل ہو جاتا ہے اور یہاں مسئلہ ان عورتوں کا بیان ہو رہا ہے جنھیں دخول کے بعد طلاق دی گئی ہے، اس میں حمل کا امکان بہر حال رہتا ہے۔ سو اگر تمھیں آثار سے ان کے حاملہ ہونے کا شک پڑ جائے تو ان کی عدت تین ماہ ہے، اتنی مدت میں ان کا حاملہ ہونا یا نہ ہونا واضح ہو جائے گا۔ اگر حاملہ نہ ہوں تو عدت تین ماہ ہی ہے اور اگر حمل ظاہر ہو جائے تو ان کی عدت وضع حمل ہے، جیسا کہ فرمایا : « وَ اُولَاتُ الْاَحْمَالِ اَجَلُهُنَّ اَنْ يَّضَعْنَ حَمْلَهُنَّ» کہ حمل والی عورتوں کی عدت وضع حمل ہے۔ اس سے ظاہر ہے کہ اگر حیض سے مایوس عمر رسیدہ عورت یا ایسی عورت جسے حیض آیا ہی نہیں اور ان کے متعلق حمل کا کوئی شک بھی نہ ہو تو ان کی عدت بالاولیٰ تین ماہ ہے۔ ¤ ➌ { وَ الّٰٓـِٔيْ يَىِٕسْنَ :} یعنی وہ عورتیں جنھیں حیض آیا ہی نہیں ان کی عدت بھی تین ماہ ہے۔ اس میں چھوٹی عمر کی عورتیں بھی شامل ہیں جنھیں ابھی حیض نہ آیا ہو اور بڑی عمر کی عورتیں بھی جنھیں کسی وجہ سے حیض شروع ہی نہیں ہو سکا۔ اس آیت سے معلوم ہوا کہ چھوٹی عمر کی لڑکی سے نکاح ہو سکتا ہے اور اس کا خاوند اس سے جماع بھی کر سکتا ہے۔ کفار کے کہنے پر چھوٹی عمر کی شادی پر پابندی لگانا یا بالغ ہو جانے والی لڑکیوں کی شادی پر اٹھارہ سال کی یا کسی مخصوص عمر کی پابندی لگانا اللہ تعالیٰ کے احکام کی صریح مخالفت ہے۔ ¤ ➍ { وَ اُولَاتُ الْاَحْمَالِ اَجَلُهُنَّ اَنْ يَّضَعْنَ حَمْلَهُنَّ : ’’ اُولَاتُ ‘‘ ’’ذَاتٌ‘‘} کی جمع ہے جیسا کہ {’’أُوْلُوْ‘‘ ’’ذُوْ‘‘} کی جمع ہے۔ {’’ اُولَاتُ الْاَحْمَالِ ‘‘} حمل والیاں۔ آیت کے الفاظ عام ہیں، اس لیے حاملہ عورت کی عدت وضع حمل ہی ہے، خواہ اس کے خاوند نے اسے طلاق دی ہو یا اس کا خاوند فوت ہو جائے۔ صحیح احادیث سے بھی یہی بات ثابت ہے کہ حاملہ عورت کا خاوند فوت ہو جائے تو بچہ پیدا ہونے کے ساتھ اس کی عدت ختم ہو جائے گی، خواہ خاوند فوت ہونے کے فوراً بعد بچہ پیدا ہو جائے یا کئی ماہ کے بعد پیدا ہو۔ ام سلمہ رضی اللہ عنھا بیان کرتی ہیں کہ سبیعہ اسلمیہ کے ہاں ان کے خاوند کے قتل ہونے کے چالیس دن بعد بچہ پیدا ہوگیا تو رسول اللہ صلی اللہ علیہ وسلم نے انھیں نکاح کرنے کی اجازت دے دی۔ [ بخاري، التفسیر، باب : «و أولات الأحمال أجلہن…» : ۴۹۰۹ ] رہی وہ عورتیں جو حاملہ نہ ہوں اور ان کے خاوند فوت ہو جائیں تو ان کی عدت چار ماہ دس دن ہے۔ دیکھیے سورۂ بقرہ (۲۳۴)۔ ¤ ➎ { وَ مَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مِنْ اَمْرِهٖ يُسْرًا :} اس سورت میں بار بار اللہ تعالیٰ سے ڈرتے رہنے کی تاکید کی گئی ہے، وجہ یہ ہے کہ میاں بیوی کے مسائل بھی کچھ ایسے ہوتے ہیں کہ جب تک آدمی ہر وقت اللہ سے ڈرتا نہ رہے وہ اپنی بیوی کے معاملہ میں بے راہ رو ہو جاتا ہے، اس لیے کتاب و سنت میں اپنی بیویوں سے حسن سلوک کی بار بار تاکید آئی ہے۔ (کیلانی) اس مقام کی مناسبت سے اس کے کام میں آسانی پیدا کرنے کا مطلب یہ ہے کہ جو اللہ سے ڈرے گا اوّل تو طلاق کے وقت کے انتظار کی وجہ سے طلاق کی نوبت ہی نہیں آئے گی اور اگر اللہ کے مقرر کردہ طریقے کے مطابق طلاق دے گا تو عدت کے اندر اسے رجوع کا حق حاصل رہے گا اور اگر عدت ختم ہو جائے تو دوبارہ نکاح کا موقع باقی رہے گا۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {ذٰلِكَ اَمْرُ اللّٰهِ اَنْزَلَهٗۤ اِلَيْكُمْ :} اس میں طلاق اور عدت کے احکام کی اہمیت بیان کرنا مقصود ہے۔ ¤ ➋ { وَ مَنْ يَّتَّقِ اللّٰهَ يُكَفِّرْ عَنْهُ سَيِّاٰتِهٖ …:} اس سورت میں اللہ تعالیٰ نے تقویٰ کے پانچ فائدے بیان فرمائے ہیں، سب سے پہلا فائدہ یہ کہ اللہ تعالیٰ اس کے لیے مشکلات سے نکلنے کا راستہ بنا دے گا، دوسرا یہ کہ اسے وہاں سے رزق دے گا جہاں سے اسے گمان نہیں ہوگا، تیسرا یہ کہ اس کے لیے اس کے معاملات میں آسانی پیدا فرما دے گا، چوتھا یہ کہ اس کے گناہ معاف فرما دے گا اور پانچواں یہ کہ اسے اجر عظیم عطا فرمائے گا۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ { اَسْكِنُوْهُنَّ مِنْ حَيْثُ سَكَنْتُمْ مِّنْ وُّجْدِكُمْ :} اس میں ان عورتوں کا حکم بیان فرمایا ہے جنھیں پہلی یا دوسری طلاق دی گئی ہو۔ پہلے ان کے متعلق فرمایا تھا کہ عدت پوری ہونے تک انھیں ان کے گھروں سے نہ نکالو اور نہ ہی وہ خود نکلیں، اب اسی کی تفصیل ہے۔ {’’ مِنْ حَيْثُ سَكَنْتُمْ ‘‘} میں {’’ مِنْ ‘‘} تبعیض کے لیے ہے، یعنی جہاں تم رہتے ہو اس کے کسی حصے میں انھیں بھی رہنے کے لیے جگہ دو۔ {’’ مِنْ وُّجْدِكُمْ ‘‘} اپنی وسعت کے مطابق، یعنی مکان ذاتی ہے یا کرائے کا یاخیمہ وغیرہ ہے، جہاں رہتے ہو وہیں انھیں رکھو۔ اس کا مقصد اللہ تعالیٰ نے اس سے پہلے بیان فرمایا ہے کہ اتنی مدت ایک جگہ رہنے کی وجہ سے ہو سکتا ہے اللہ تعالیٰ دوبارہ موافقت کی صورت پیدا فرما دے اور رجوع ہو جائے، اس دوران ان کا نفقہ بھی خاوند کے ذمے ہے۔ تیسری طلاق کے بعد چونکہ رجوع کی گنجائش نہیں، اس لیے خاوند کے ساتھ رہائش کا حکم بھی نہیں اور نہ ہی ان کا خرچ خاوند کے ذمے ہے، جیسا کہ پہلی آیت کے فائدہ (۱۲) میں فاطمہ بنت قیس رضی اللہ عنھا کی صحیح حدیث میں گزر چکا ہے۔ ¤ ➋ { وَ لَا تُضَآرُّوْهُنَّ لِتُضَيِّقُوْا عَلَيْهِنَّ :} یعنی انھیں نفقہ میں کمی یا نامناسب رہائش یا بدزبانی یا مار پیٹ کے ساتھ تکلیف پہنچا کر تنگ نہ کرو کہ وہاں رہیں تو تنگی میں مبتلا رہیں یا پھر مکان چھوڑ کر چلی جائیں یا مہر چھوڑ دیں۔ ¤ ➌ { وَ اِنْ كُنَّ اُولَاتِ حَمْلٍ فَاَنْفِقُوْا عَلَيْهِنَّ …:} مطلقہ عورت اگر حاملہ نہیں تو رجعی طلاق کی صورت میں اس کا نفقہ اور رہائش خاوند کے ذمے ہے، تیسری طلاق کی صورت میں اس کا نفقہ یا رہائش خاوند کے ذمے نہیں، جیسا کہ پہلے گزر چکا ہے۔ البتہ اگر وہ حاملہ ہے تو رجعی طلاق کی صورت میں بچہ پیدا ہونے تک اس کا نفقہ اور رہائش دونوں خاوند کے ذمے ہیں اور اگر تیسری طلاق ہے تو وضع حمل تک صرف اس کا خرچہ خاوند کے ذمے ہے۔ ¤ ➍ { فَاِنْ اَرْضَعْنَ لَكُمْ فَاٰتُوْهُنَّ اُجُوْرَهُنَّ::} اس جملے سے معلوم ہوا کہ اللہ تعالیٰ کے حکم کے مطابق بچہ باپ کا ہوتا ہے ماں کا نہیں، کیونکہ ماں اس بچے کے باپ کے لیے دودھ پلا رہی ہے اور اجرت لے رہی ہے، اگر بچہ ماں کا ہو تو اجرت لینے کا سوال پیدا نہیں ہوتا۔ دوسرا یہ کہ عورت اپنے دودھ کی خود مالک ہے، وہ طلاق دینے والے خاوند سے بھی اسی طرح اجرت لے سکتی ہے جیسے دوسروں سے۔ ¤ ➎ {وَ اْتَمِرُوْا بَيْنَكُمْ بِمَعْرُوْفٍ : ’’ وَ اْتَمِرُوْا ‘‘ ’’اِئْتَمَرَ يَأْتَمِرُ اِئْتِمَارًا‘‘} (افتعال) مشورہ کرنا، جیسا کہ سورۂ قصص میں فرمایا : «يٰمُوْسٰۤى اِنَّ الْمَلَاَ يَاْتَمِرُوْنَ بِكَ لِيَقْتُلُوْكَ» [ القصص : ۲۰ ] ’’اے موسیٰ! بے شک سردار تیرے بارے میں مشورہ کر رہے ہیں کہ تجھے قتل کر دیں۔‘‘ طلاق کے بعد عموماً میاں بیوی کی باہمی ناچاقی اور ناراضی کی وجہ سے کشیدگی پیدا ہو چکی ہوتی ہے، ایسی صورت میں میاں بیوی دونوں کو اور ان کے تعلق والوں کو حکم دیا کہ بچے کو دودھ پلانے، اس کے علاج و تربیت اور اس کی بہتری کے لیے آپس میں اچھے طریقے سے مشورہ کرتے رہو، ایسا نہ ہو کہ تمھاری کشیدگی بچے کو نقصان پہنچانے کا باعث بن جائے۔ ¤ ➏ { وَ اِنْ تَعَاسَرْتُمْ فَسَتُرْضِعُ لَهٗۤ اُخْرٰى :} یعنی اگر ماں کسی بیماری یا کمزوری کی وجہ سے دودھ پلانے سے انکار کر دے، یا اجرت اتنی زیادہ مانگے جو خاوند کی استطاعت یا معروف رواج سے زیادہ ہو، یا خاوند اس کی طلب کردہ اجرت دینے پر تیار نہ ہو، یا کسی اور وجہ سے آپس میں ضد پیدا ہو جائے اور ماں دودھ نہ پلائے تو ضروری نہیں کہ ہر حال میں ماں ہی دودھ پلائے، بلکہ کوئی اور عورت اسے دودھ پلا دے گی۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) ➊ {لِيُنْفِقْ ذُوْ سَعَةٍ مِّنْ سَعَتِهٖ … :} اس سے معلوم ہوا کہ نفقہ میں بیوی کی حالت کا اعتبار نہیں کیا جائے گا، بلکہ خاوند کی حالت کے مطابق نفقہ واجب ہوگا۔ اگر خاوند وسعت والا اور مال دار ہے تو اس کے مطابق خرچ کرے گا اور اگر وہ تنگدست ہے تو اللہ نے اسے جو کچھ دیا ہے اس میں سے اپنی طاقت کے مطابق خرچ کرے۔ ¤ ➋ { سَيَجْعَلُ اللّٰهُ بَعْدَ عُسْرٍ يُّسْرًا :} اس میں اللہ تعالیٰ کا وعدہ ہے کہ جو خاوند حسب مقدور وہ خرچے پورے کرتے ہیں جں جو ان کے ذمے ہیں اور ان میں بخل نہیں کرتے، تو اللہ تعالیٰ ان کے لیے تنگی کے بعد آسانی کی کوئی نہ کوئی صورت ضرور پیدا فرما دے گا۔ {’’ سَيَجْعَلُ ‘‘} میں ’’سین‘‘ استقبال کے علاوہ تاکید کا مفہوم بھی رکھتا ہے۔ {’’ عُسْرٍ ‘‘} اور {’’ يُسْرًا ‘‘} دونوں میں تنوین تنکیر کے لیے ہے، یعنی اللہ تعالیٰ کے پاس آسانی پیدا کرنے کی بے شمار صورتیں ہیں، تنگی خواہ کسی قسم کی ہو اللہ تعالیٰ اس میں آسانی کی کوئی نہ کوئی صورت پیدا فرما سکتا ہے۔ آدمی کو چاہیے کہ تنگی میں اپنی طاقت کے مطابق دریغ نہ کرے، اللہ تعالیٰ نے جو کچھ دیا ہے اس میں سے خرچ کرتا رہے، تو اللہ تعالیٰ تنگی کے بعد خواہ کوئی ہو ضرور ہی آسانی کی کوئی نہ کوئی صورت پیدا فرما دے گا، جیسا کہ فرمایا : « فَاِنَّ مَعَ الْعُسْرِ يُسْرًا (5) اِنَّ مَعَ الْعُسْرِ يُسْرًا » [ الانشراح : 6،5 ] ’’پس بے شک ہر مشکل کے ساتھ ایک آسانی ہے۔ بے شک اسی مشکل کے ساتھ ایک اور آسانی ہے۔‘‘"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 9،8) {وَ كَاَيِّنْ مِّنْ قَرْيَةٍ عَتَتْ عَنْ اَمْرِ رَبِّهَا وَ رُسُلِهٖ … : ’’ عَتَتْ ‘‘ ’’عَتَا يَعْتُوْ عُتُوًّا‘‘} (ن) سے ماضی معلوم ہے، اصل میں {’’عَتَوَتْ‘‘ } ہے۔ {’’ نُكْرًا ‘‘} اجنبی، نہ پہچانا ہوا، جو نہ دیکھا ہو نہ سنا۔ اب تک اللہ تعالیٰ نے طلاق وغیرہ کے متعلق اپنے احکام کا ذکر فرمایا تھا، یہاں سے بتایا جا رہا ہے کہ پچھلی جن بستیوں نے اللہ اور اس کے رسولوں کے احکام سے سرکشی اختیار کی ان کا انجام کیا ہوا۔ مقصد مسلمانوں کو ان احکام کی اہمیت بتانا اور ان کی پابندی کی تلقین کرنا ہے۔ حقیقت یہ ہے کہ پہلی اقوام کی بربادی میں شرک و کفر کے ساتھ ساتھ اللہ اور اس کے رسولوں کے ان تفصیلی احکام کی مخالفت بھی تھی جو زندگی کے ہر شعبے میں انھوں نے دیے، جس کی وجہ سے ان کے اندر حد سے بڑھی ہوئی سرکشی اور فساد پیدا ہوا۔ مثلاً جب انھوں نے شرک و کفر پر اصرار کے ساتھ نکاح و طلاق کے ضابطوں کی پابندی سے سرکشی اختیار کی تو زنا اور قوم لوط کا عمل عام ہوا، جس کی وجہ سے قتل و غارت کا بازار گرم ہوا۔ نتیجہ یہ ہوا کہ اللہ تعالیٰ نے ان کا بہت سخت محاسبہ کیا اور انھیں ایسی سزا دی جو کسی نے نہ دیکھی تھی نہ سنی تھی۔ آج کے دور میں کفار نے شرک و کفر پر اصرار کے ساتھ ساتھ ان ضابطوں کی بھی شدید مخالفت اختیار کر رکھی ہے، جس کے نتیجے میں ان کا معاشرہ بے پناہ بداخلاقی، بدامنی اور قتل و غارت کا شکار ہو چکا ہے اور بری طرح  ٹوٹ پھوٹ چکا ہے۔ اب ان کی کوشش یہ ہے کہ مسلمان بھی ان احکام سے آزاد ہو جائیں اور ان میں بھی زنا، قوم لوط کا عمل اور قتل و غارت پھیل جائے۔ اللہ تعالیٰ نے پہلی امتوں کے عذاب کا حوالہ دے کر مسلمانوں کو ان کے انجام سے ڈرایا ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9،8) {وَ كَاَيِّنْ مِّنْ قَرْيَةٍ عَتَتْ عَنْ اَمْرِ رَبِّهَا وَ رُسُلِهٖ … : ’’ عَتَتْ ‘‘ ’’عَتَا يَعْتُوْ عُتُوًّا‘‘} (ن) سے ماضی معلوم ہے، اصل میں {’’عَتَوَتْ‘‘ } ہے۔ {’’ نُكْرًا ‘‘} اجنبی، نہ پہچانا ہوا، جو نہ دیکھا ہو نہ سنا۔ اب تک اللہ تعالیٰ نے طلاق وغیرہ کے متعلق اپنے احکام کا ذکر فرمایا تھا، یہاں سے بتایا جا رہا ہے کہ پچھلی جن بستیوں نے اللہ اور اس کے رسولوں کے احکام سے سرکشی اختیار کی ان کا انجام کیا ہوا۔ مقصد مسلمانوں کو ان احکام کی اہمیت بتانا اور ان کی پابندی کی تلقین کرنا ہے۔ حقیقت یہ ہے کہ پہلی اقوام کی بربادی میں شرک و کفر کے ساتھ ساتھ اللہ اور اس کے رسولوں کے ان تفصیلی احکام کی مخالفت بھی تھی جو زندگی کے ہر شعبے میں انھوں نے دیے، جس کی وجہ سے ان کے اندر حد سے بڑھی ہوئی سرکشی اور فساد پیدا ہوا۔ مثلاً جب انھوں نے شرک و کفر پر اصرار کے ساتھ نکاح و طلاق کے ضابطوں کی پابندی سے سرکشی اختیار کی تو زنا اور قوم لوط کا عمل عام ہوا، جس کی وجہ سے قتل و غارت کا بازار گرم ہوا۔ نتیجہ یہ ہوا کہ اللہ تعالیٰ نے ان کا بہت سخت محاسبہ کیا اور انھیں ایسی سزا دی جو کسی نے نہ دیکھی تھی نہ سنی تھی۔ آج کے دور میں کفار نے شرک و کفر پر اصرار کے ساتھ ساتھ ان ضابطوں کی بھی شدید مخالفت اختیار کر رکھی ہے، جس کے نتیجے میں ان کا معاشرہ بے پناہ بداخلاقی، بدامنی اور قتل و غارت کا شکار ہو چکا ہے اور بری طرح  ٹوٹ پھوٹ چکا ہے۔ اب ان کی کوشش یہ ہے کہ مسلمان بھی ان احکام سے آزاد ہو جائیں اور ان میں بھی زنا، قوم لوط کا عمل اور قتل و غارت پھیل جائے۔ اللہ تعالیٰ نے پہلی امتوں کے عذاب کا حوالہ دے کر مسلمانوں کو ان کے انجام سے ڈرایا ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ {اَعَدَّ اللّٰهُ لَهُمْ عَذَابًا شَدِيْدًا:} پچھلی آیات میں دنیا کے عذاب کا ذکر تھا، اس میں آخرت کے عذاب کا ذکر ہے۔ ¤ ➋ {فَاتَّقُوا اللّٰهَ يٰۤاُولِي الْاَلْبَابِ الَّذِيْنَ اٰمَنُوْا:} یہ ’’فاء‘‘ فصیحہ ہے جو محذوف شرط کا اظہار کر رہی ہے، یعنی جب تم ان بستیوں کا حال سن چکے جنھوں نے اللہ اور اس کے رسولوں کے احکام سے سرکشی اختیار کی تو اے عقلوں والو جو ایمان لا چکے ہو! تم اللہ اور اس کے رسول کے احکام کی نافرمانی سے بچ جاؤ۔ ¤ ➌ {قَدْ اَنْزَلَ اللّٰهُ اِلَيْكُمْ ذِكْرًا : ’’ ذِكْرًا ‘‘} پر تنوین تعظیم کی ہے، عظیم نصیحت۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {رَسُوْلًا يَّتْلُوْا عَلَيْكُمْ اٰيٰتِ اللّٰهِ مُبَيِّنٰتٍ:’’ رَسُوْلًا ‘‘} پچھلی آیت میں مذکور{’’ ذِكْرًا ‘‘} سے بدل ہے، یعنی یقینا اللہ تعالیٰ نے تمھاری طرف عظیم ذکر نازل کیا ہے جو رسول ہے، یعنی رسول صلی اللہ علیہ وسلم کا وجود سراپا نصیحت ہے کہ اس کا قول، فعل، حال اور تقریر سب نصیحت ہے۔ اس سے یہ بھی معلوم ہوا کہ سورۂ حجر (۹) میں اللہ تعالیٰ نے جو فرمایا ہے : « اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَ اِنَّا لَهٗ لَحٰفِظُوْنَ » (بے شک ہم نے ہی یہ نصیحت نازل کی ہے اور بے شک ہم اس کی ضرور حفاظت کرنے والے ہیں) اس میں {’’ الذِّكْرَ ‘‘} سے مراد صرف قرآن مجید نہیں بلکہ رسول اللہ صلی اللہ علیہ وسلم پر نازل شدہ ساری وحی ہے۔ اللہ تعالیٰ نے قرآن مجید کی بھی حفاظت فرمائی ہے اور رسول اللہ صلی اللہ علیہ وسلم کے اقوال و افعال اور احوال و تقریرات کی بھی حفاظت فرمائی ہے۔ ¤ ➋ { لِيُخْرِجَ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ مِنَ الظُّلُمٰتِ اِلَى النُّوْرِ … :} اس کی وضاحت کے لیے دیکھیے سورۂ بقرہ (۲۵۷) کی تفسیر۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) ➊ { اَللّٰهُ الَّذِيْ خَلَقَ سَبْعَ سَمٰوٰتٍ … :} سورت کے آخر میں اس کے اندر مذکور احکام کی عظمت کی طرف توجہ دلانے کے لیے آسمان و زمین کی پیدائش، ان میں اپنے اوامر کے نزول اور اپنے علم و قدرت کا ذکر فرمایا، تاکہ یہ بات مد نظر رہے کہ یہ احکام دینے والا کون ہے۔ بارہ (۱۲) آیات پر مشتمل اس سورت میں اللہ تعالیٰ کا ذکر اس کے تقویٰ کے ساتھ شروع ہوا ہے جو اس کے نام، اس کی ضمیر اور اس کی طرف نسبت کی صورت میں تقریباً تیس (۳۰) مرتبہ آیا ہے اور آخر میں پھر اس عظیم ہستی کا تعارف ان صفات کے ساتھ دہرایا ہے۔ (ابن عاشور) ¤ ➋ {خَلَقَ سَبْعَ سَمٰوٰتٍ :} سات آسمانوں کی کیفیت تو اللہ تعالیٰ نے خود بیان فرمائی ہے کہ وہ ایک دوسرے کے اوپر تہ بہ تہ ہیں، جیساکہ فرمایا : « اَلَمْ تَرَوْا كَيْفَ خَلَقَ اللّٰهُ سَبْعَ سَمٰوٰتٍ طِبَاقًا » [ نوح : ۱۵ ] ’’کیا تم نے نہیں دیکھا کہ کس طرح اللہ نے سات آسمانوں کو اوپر تلے پیدا کیا۔‘‘ ¤ ➌ { وَ مِنَ الْاَرْضِ مِثْلَهُنَّ :} قرآن مجید میں آسمان کا ذکر واحد کے صیغے {’’ السَّمَاۤءُ ‘‘} کے ساتھ بھی آیا ہے اور جمع کے صیغے {’’ سَمٰوٰتٍ ‘‘ } کے ساتھ بھی، مگر زمین کا ذکر واحد کے صیغے کے ساتھ ہی آیا ہے، آسمانوں کی طرح اوپر تلے سات زمینیں ہونے کا ذکر نہیں فرمایا۔ یہاں فرمایا اللہ وہ ہے جس نے سات آسمان پیدا کیے اور زمین سے بھی ان کی مثل یعنی مانند۔ مانند ہونے کا ایک مطلب تو یہ ہو سکتا ہے کہ زمین بھی اپنی عظمت، برکت، آبادی اور کُرویت (گول ہونے) میں آسمانوں کی طرح ہے۔ دوسرا مطلب جو اکثر مفسرین نے مراد لیا ہے، یہ ہے کہ سات آسمانوں کی طرح زمینیں بھی اوپر تلے سات ہیں۔ اس کی دلیل میں وہ صحیح حدیث پیش کی ہے جو عبداللہ بن عمر رضی اللہ عنھما نے بیان فرمائی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مَنْ أَخَذَ مِنَ الْأَرْضِ شَيْئًا بِغَيْرِ حَقِّهِ خُسِفَ بِهِ يَوْمَ الْقِيَامَةِ إِلٰي سَبْعِ أَرَضِيْنَ ] [ بخاري، المظالم، باب إثم من ظلم شیئا من الأرض : ۲۴۵۴ ] ’’جو شخص زمین میں سے کچھ بھی اس کے حق کے بغیر لے گا اسے قیامت کے دن سات زمینوں تک دھنسایا جائے گا۔‘‘ حدیث میں مذکور سات زمینوں سے مراد تو ظاہر ہے کہ اسی زمین کے سات طبقات ہیں جس پر ہم رہتے ہیں، لیکن کیا آیت میں مذکور سات زمینوں سے بھی یہی طبقات مراد ہیں یا ہماری زمین جیسی اور چھ زمینیں ہیں، یہ بات اللہ تعالیٰ ہی جانتا ہے۔ کائنات کی بے پناہ وسعتوں کو دیکھیں تو کچھ بعید نہیں کہ ہماری زمین جیسی اور زمینیں بھی ہوں جو ہماری زمین ہی کی طرح آباد ہوں، جیسا کہ فرمایا : «وَ مَا یَعْلَمُ جُنُوْدَ رَبِّکَ اِلَّا ھُوَ » [ المدثر : ۳۱ ] ’’اور تیرے رب کے لشکروں کو اس کے سوا کوئی نہیں جانتا۔‘‘ اور اللہ تعالیٰ نے اکیلے ہی آسمان و زمین کو پیدا فرمایا، کوئی اس وقت موجود نہ تھا کہ ان کے اسرار سے پوری طرح واقف ہو، جیسا کہ فرمایا : « مَاۤ اَشْهَدْتُّهُمْ خَلْقَ السَّمٰوٰتِ وَ الْاَرْضِ» [ الکھف : ۵۱ ] ’’میں نے انھیں آسمانوں اور زمین کے پیدا کرنے میں حاضر نہیں کیا۔‘‘ اللہ تعالیٰ نے انسان کو ایجاد کا جو سلیقہ عطا فرمایا ہے جس سے بڑی بڑی طاقتور دوربینیں ایجاد ہوئی ہیں، ہیئت دان ان کے ساتھ کائنات کا مشاہدہ کرتے ہیں تو ہر دن نئے سے نیا انکشاف ہوتا ہے ۔ ہمارے لیے اتنی بات ہی کافی ہے کہ اللہ تعالیٰ نے سات آسمانوں کی طرح زمینیں بھی سات پیدا فرمائی ہیں۔ رہی ان کی کیفیت اور متعین مراد، تو وہ اللہ تعالیٰ ہی جانتا ہے۔ اس نے اسے مجمل رکھا ہے تو اس میں ہماری بہتری ہے، کیونکہ اگر اس کی واقعی کیفیت بیان ہوتی تو اپنی ذہنی نارسائی کی وجہ سے ممکن تھا کہ کئی لوگ انکار ہی کر دیتے۔ ¤ ➍ {يَتَنَزَّلُ الْاَمْرُ بَيْنَهُنَّ :} اللہ تعالیٰ کا امر دو قسم کا ہے، ایک امر کونی ہے، یعنی وہ جس چیز کا ارادہ کرتا ہے اسے {’’ كُنْ‘‘} (ہو جا) کہتا ہے تو وہ ہوجاتی ہے اور ایک امر شرعی ہے ، یعنی اللہ تعالیٰ فرشتوں کے ذریعے سے اپنے احکام نازل فرماتا رہتا ہے، یعنی آسمانوں اور زمینوں کے درمیان اللہ تعالیٰ کے اوامر کونی اور اوامر شرعی اترتے رہتے ہیں۔ اس میں بھی اس سورت میں مذکور احکام کی اہمیت کا اظہار ہو رہا ہے کہ وہ ان عظیم الشان آسمانوں اور زمینوں کے خالق و مالک کے احکام ہیں۔ ¤ ➎ { لِتَعْلَمُوْۤا اَنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ وَّ اَنَّ اللّٰهَ قَدْ اَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا :} یعنی زمین و آسمان کی پیدائش کی یہ بات تمھیں اس لیے بتائی ہے کہ تم اللہ تعالیٰ کی ہر چیز پر پوری قدرت کو اور اس کے ہر چیز پر علم کے ساتھ احاطے کو جان لو۔ پھر جب تم اس کی قدرت اور علم سے واقف ہو جاؤ گے تو اس کے احکام کی نافرمانی کی جرأت نہیں کرو گے۔"
    }
  ]
}