{
  "surah": "At-Tahrim",
  "surah_number": 66,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ { يٰۤاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ لَكَ :} وہ چیز کیا تھی جو رسول اللہ صلی اللہ علیہ وسلم نے اپنے آپ پر حرام کی اور یہ آیات نازل ہوئیں ؟ اس کے متعلق ایک تو وہ مشہور واقعہ ہے جو صحیح بخاری و صحیح مسلم وغیرہ میں نقل ہوا ہے، عائشہ رضی اللہ عنھا بیان کرتی ہیں : [ كَانَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ عَسَلاً عِنْدَ زَيْنَبَ ابْنَةِ جَحْشٍ وَ يَمْكُثُ عِنْدَهَا فَوَاطَأْتُ أَنَا وَحَفْصَةُ عَنْ أَيَّتُنَا دَخَلَ عَلَيْهَا فَلْتَقُلْ لَّهُ أَكَلْتَ مَغَافِيْرَ، إِنِّيْ أَجِدُ مِنْكَ رِيْحَ مَغَافِيْرَ، قَالَ لاَ وَلٰكِنِّيْ كُنْتُ أَشْرَبُ عَسَلاً عِنْدَ زَيْنَبَ ابْنَةِ جَحْشٍ فَلَنْ أَعُوْدَ لَهُ وَ قَدْ حَلَفْتُ لاَ تُخْبِرِيْ بِذٰلِكَ أَحَدًا ] [ بخاري، التفسیر، باب : «یا أیھا النبي لم تحرم…» : ۴۹۱۲۔ مسلم : ۱۴۷۴ ] ’’رسول اللہ صلی اللہ علیہ وسلم زینب بنت جحش رضی اللہ عنھا کے پاس شہد پیا کرتے تھے اور ان کے پاس ٹھہر جاتے تھے، تو میں نے اور حفصہ نے آپس میں اس بات پر اتفاق کر لیا کہ آپ صلی اللہ علیہ وسلم ہم میں سے جس کے پاس بھی آئیں وہ آپ سے یہ کہے کہ آپ نے مغافیر کھائی ہے، کیونکہ مجھے آپ سے مغافیر کی بو آرہی ہے۔ (جب آپ صلی اللہ علیہ وسلم کے آنے پر یہ بات کہی گئی تو) آپ صلی اللہ علیہ وسلم نے فرمایا : ’’نہیں، لیکن میں زینب بنت جحش کے پاس شہد پیا کرتا تھا، دوبارہ کبھی نہیں پیوں گا اور میں نے (اس بات کی) قسم کھا لی ہے، تم یہ بات کسی کو نہ بتانا۔‘‘ امام بخاری رحمہ اللہ نے {’’كِتَابُ الطَّلاَقِ‘‘} میں بھی یہ حدیث نقل فرمائی ہے، اس میں یہ الفاظ بھی ہیں : [ فَنَزَلَتْ : « يٰۤاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ لَكَ » ] [ بخاري، الطلاق، باب : «لم تحرم ما أحل اللّٰہ لک » : ۵۲۶۷ ] ’’یعنی اس واقعہ پر یہ آیت اتری : « يٰۤاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ لَكَ » ’’اے نبی! تو کیوں حرام کرتا ہے جو اللہ نے تیرے لیے حلال کیا ہے؟‘‘ واضح رہے کہ مغافیر ایک بدبو دار میٹھی گوند ہوتی ہے جو عرفط نامی پودے پر پیدا ہوتی ہے۔ عائشہ اور حفصہ رضی اللہ عنھما کا مطلب یہ تھا کہ آپ کو بدبو سے بہت نفرت ہے، آپ یہ سوچ کر شہد پینا چھوڑ دیں گے کہ مغافیر کی بو شہد ہی سے آ رہی ہوگی، کیونکہ ممکن ہے شہد کی مکھیوں نے اس کے پودے عرفط کا رس چوس کر شہد بنایا ہو۔ ¤ دوسرا وہ واقعہ ہے جو امام نسائی نے انس رضی اللہ عنہ سے بیان کیا ہے : [ أَنَّ رَسُوْلَ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ كَانَتْ لَهُ أَمَةٌ يَطَؤُهَا فَلَمْ تَزَلْ بِهِ عَائِشَةُ وَحَفْصَةُ حَتّٰی حَرَّمَهَا عَلٰی نَفْسِهِ فَأَنْزَلَ اللّٰهُ عَزَّ وَجَلَّ : « يٰۤاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ لَكَ » إِلٰی آخِرِ الْآيَةِ ] [ نسائي، عشرۃ النساء، باب الغیرۃ : ۳۴۱۱ ] ’’رسول اللہ صلی اللہ علیہ وسلم کی ایک لونڈی تھی جس سے آپ صحبت کیا کرتے تھے، تو عائشہ اور حفصہ رضی اللہ عنھما مسلسل آپ سے اصرار کرتی رہیں، حتیٰ کہ آپ نے اسے اپنے آپ پر حرام کر لیا، تو اللہ عزوجل نے یہ مکمل آیت نازل فرمائی : « يٰۤاَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ لَكَ » ’’اے نبی! تو کیوں حرام کرتا ہے جو اللہ نے تیرے لیے حلال کیا ہے؟‘‘ علامہ البانی نے فرمایا : {’’إِسْنَادُهُ صَحِيْحٌ‘‘} اور حافظ ابن حجر نے {’’كِتَابُ الطَّلاَقِ، بَابُ : « لِمَ تُحَرِّمُ مَاۤ اَحَلَّ اللّٰهُ » ‘‘} کی شرح کرتے ہوئے اس حدیث کی سند کو صحیح کہا ہے۔ یہ لونڈی ماریہ قبطیہ رضی اللہ عنھا تھیں، جو آپ صلی اللہ علیہ وسلم کے بیٹے ابراہیم کی ماں تھیں۔ ضیاء مقدسی نے {’’ اَلْأَحَادِيْثُ الْمُخْتَارَةُ ‘‘} میں روایت کی ہے کہ عمر رضی اللہ عنہ نے بیان کیا : [ قَالَ النَّبِيُّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ لِحَفْصَةَ لاَ تُحَدِّثِيْ أَحَدًا وَّ إِنَّ أُمَّ إِبْرَاهِيْمَ عَلَيَّ حَرَامٌ فَقَالَتْ أَتُحَرِّمُ مَا أَحَلَّ اللّٰهُ لَكَ ؟ قَالَ فَوَ اللّٰهِ ! لاَ أَقْرَبُهَا، قَالَ فَلَمْ يَقْرَبْهَا، حَتّٰی أَخْبَرَتْ عَائِشَةَ فَأَنْزَلَ اللّٰهُ عَزَّوَجَلَّ : « قَدْ فَرَضَ اللّٰهُ لَكُمْ تَحِلَّةَ اَيْمَانِكُمْ » ] ] [الأحادیث المختارۃ : ۱۸۹] ’’نبی صلی اللہ علیہ وسلم نے حفصہ رضی اللہ عنھا سے کہا کہ تم کسی کو نہ بتانا یہ کہ ام ابراہیم مجھ پر حرام ہے۔‘‘ انھوں نے کہا : ’’کیا آپ وہ چیز حرام کر رہے ہیں جو اللہ نے آپ کے لیے حلال کی ہے؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’اللہ کی قسم! میں اس کے قریب نہیں جاؤں گا۔‘‘ تو آپ اس کے قریب نہیں گئے، حتیٰ کہ اس (حفصہ رضی اللہ عنھا ) نے یہ بات عائشہ( رضی اللہ عنھا ) کو بتا دی تو اللہ عزوجل نے یہ آیت نازل فرما دی : « قَدْ فَرَضَ اللّٰهُ لَكُمْ تَحِلَّةَ اَيْمَانِكُمْ » ’’بے شک اللہ نے تمھارے لیے تمھاری قسموں کا کفارہ مقرر کر دیا ہے۔‘‘ ضیاء مقدسی نے حدیث کے آخر میں فرمایا : {’’إِسْنَادُهُ صَحِيْحٌ‘‘} اور ابن کثیر نے اپنی تفسیر میں ہیثم بن کلیب کی مسند کے حوالے سے اسے نقل کر کے فرمایا، یہ اسناد صحیح ہے اور کتب ستہ میں سے کسی نے اسے روایت نہیں کیا اور ضیاء مقدسی نے اپنی {’’ اَلْمُسْتَخْرَجُ ‘‘} میں اس کا انتخاب کیا ہے۔ ¤ اس سلسلے میں کچھ اور واقعات بھی بیان کیے گئے ہیں مگر ان میں سے کسی کی سند صحیح نہیں۔ ان دونوں واقعات میں سے شہد والے واقعہ کی سند زیادہ صحیح ہے، کیونکہ وہ صحیحین میں ہے، اس لیے بعض مفسرین نے صرف اسی کو ان آیات کا سبب نزول قرار دیا ہے۔ چنانچہ قرطبی کے بیان کا خلاصہ یہ ہے کہ ان تمام اقوال میں سب سے صحیح پہلا ہے اور صحیح یہ ہے کہ آپ نے حرام شہد کو کیا تھا جو آپ زینب رضی اللہ عنھا کے ہاں پیا کرتے تھے اور ابن کثیر نے اس کے متعلق بہت سی روایات نقل کرنے کے بعد فرمایا : ’’صحیح یہ ہے کہ یہ معاملہ آپ صلی اللہ علیہ وسلم کے شہد کو حرام کرنے کی وجہ سے ہوا تھا۔‘‘ اور آلوسی نے فرمایا : ’’نووی نے مسلم کی شرح میں کہا ہے کہ صحیح یہ ہے کہ یہ آیت شہد کے واقعہ کے بارے میں ہے نہ کہ ماریہ قبطیہ رضی اللہ عنھا کے واقعہ کے بارے میں، جو صحیحین کے علاوہ کتابوں میں آیا ہے اور ماریہ قبطیہ رضی اللہ عنھا کا واقعہ کسی صحیح سند کے ساتھ نہیں آیا۔‘‘ مگر جیسا کہ اوپر گزرا کہ ماریہ قبطیہ رضی اللہ عنھا کے قصے کی سند کو ضیاء مقدسی، ابن کثیر، ابن حجر اور البانی رحمھم اللہ نے صحیح کہا ہے، شہد والے واقعہ سے اس کا کوئی تعارض بھی نہیں اور ایک آیت کا سبب نزول کئی واقعات بھی ہو سکتے ہیں، اس لیے صحیح بات یہی ہے کہ یہ دونوں واقعات ان آیات کا سبب نزول ہیں، شوکانی نے بھی یہی فیصلہ فرمایا ہے۔ ¤ ➋ احادیث سے ظاہر ہے کہ آپ صلی اللہ علیہ وسلم نے شہد کو امت کے لیے حرام قرار نہیں دیا تھا، بلکہ صرف خود اسے نہ پینے کی قسم کھائی تھی۔ اسی طرح امت کے لیے ان کی لونڈیوں کو حرام قرار نہیں دیا، بلکہ صرف اپنی ایک لونڈی کو اپنے آپ پر حرام قرار دیا تھا مگر اللہ تعالیٰ نے اس پر بھی ناراضی کا اظہار فرمایا، کیونکہ آپ کے ایسا کرنے سے آپ کا ان نعمتوں سے محروم ہونا لازم آتا تھا جو اللہ تعالیٰ نے آپ کے لیے حلال کی تھیں۔ اس کے علاوہ اندیشہ تھا کہ آپ کو دیکھ کر امت کے لوگ، جن کے لیے نبی صلی اللہ علیہ وسلم اسوۂ حسنہ و کاملہ ہیں، شہد کے قریب نہیں جائیں گے اور یہ دونوں باتیں اللہ تعالیٰ کو گوارا نہیں تھیں۔ ¤ ➌ اس سے معلوم ہوا کہ صوفی حضرات جو ترک حیوانات جلالی و جمالی کرتے ہیں، یعنی اپنے چلوں اور وظیفوں کے درمیان کوئی جاندار چیز یا اس سے نکلنے والی چیز مثلاً گوشت، مچھلی، انڈا، دودھ، گھی اور شہد وغیرہ نہیں کھاتے، ان کا یہ عمل اللہ تعالیٰ کی اس تنبیہ کے خلاف ہے۔ حقیقت میں یہ عمل ہندو جوگیوں یا نصرانی راہبوں سے لیا گیا ہے، اسلام میں اس کی کوئی گنجائش نہیں۔ ¤ ➍ {’’ يٰۤاَيُّهَا النَّبِيُّ ‘‘} کے الفاظ کے ساتھ خطاب کا مقصد یہ ہے کہ آپ کا کام وحی الٰہی پر چلنا اور اسے آگے پہنچانا ہے، آپ کو اپنی مرضی سے کچھ بھی کرنے کی اجازت نہیں ہے۔ ¤ ➎ اس آیت سے معلوم ہوا کہ رسول اللہ صلی اللہ علیہ وسلم کے ہر قول، فعل اور تقریر پر وحی الٰہی کی مہر ہے اور وہ سب کا سب دین ہے، کیونکہ اگر آپ کا کوئی اجتہاد درست نہیں ہوتا تھا تو اللہ تعالیٰ فوراً اس کی اصلاح فرما دیتا تھا۔ آپ صلی اللہ علیہ وسلم کے معصوم ہونے کا یہی مطلب ہے، انبیاء کے علاوہ کسی کو یہ چیز حاصل نہیں کہ وحی کے ذریعے سے ان کی خطا کی اصلاح ہوتی ہو۔ اس لیے کسی صحابی یا امام یا پیر فقیر کی بات امت کے لیے حجت نہیں، کیونکہ وہ درست بھی ہو سکتی ہے اور غلط بھی۔ ¤ ➏ { تَبْتَغِيْ مَرْضَاتَ اَزْوَاجِكَ:} اس میں نبی صلی اللہ علیہ ووسلم اور امت کو تعلیم ہے کہ بیویوں کو خوش رکھنا اگرچہ اچھی بات ہے، مگر اس وقت تک جب وہ اللہ تعالیٰ کے احکام پر قائم رہ کر ہو، رب تعالیٰ کو ناراض کر کے انھیں راضی کرنے کی کوشش نہیں کرنی چاہیے۔ ¤ ➐ { وَ اللّٰهُ غَفُوْرٌ رَّحِيْمٌ:} یہ اللہ تعالیٰ کا اپنے نبی کریم صلی اللہ علیہ وسلم پر خاص انعام و فضل ہے کہ عتاب کرتے ہوئے ساتھ ہی معافی اور مغفرت و رحمت کی خوش خبری بھی سنا دی، جیسا کہ فرمایا : « عَفَا اللّٰهُ عَنْكَ لِمَ اَذِنْتَ لَهُمْ» [ التوبۃ : ۴۳ ] ’’اللہ نے تجھے معاف کر دیا، تو نے ان (منافقین) کو پیچھے رہنے کی اجازت کیوں دی؟‘‘"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) ➊ {قَدْ فَرَضَ اللّٰهُ لَكُمْ تَحِلَّةَ اَيْمَانِكُمْ : ’’ تَحِلَّةَ ‘‘ ’’حَلَّلَ‘‘} (تفعیل) کا مصدر {’’ تَحْلِيْلٌ ‘‘} اور {’’ تَحِلَّةٌ ‘‘} دونوں آتے ہیں، جیسے {’’ كَرَّمَ ‘‘} کا مصدر {’’تَكْرِيْمٌ‘‘} اور {’’تَكْرِمَةٌ ‘‘} دونوں آتے ہیں۔ معنی ہے حلال کرنا، مراد قسم کا کفارہ ہے جس کے ادا کرنے کے بعد وہ چیز حلال ہو جاتی ہے جو قسم کھا کر حرام کی تھی، یعنی آپ نے قسم کھا کر جو شہد اور ماریہ کو حرام کیا ہے اس قسم کا کفارہ دے دیں۔ قسم کا کفارہ اللہ تعالیٰ نے سورۂ مائدہ (۸۹) میں بیان فرما دیا ہے۔ ابو موسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ وَ إِنِّيْ وَاللّٰهِ! إِنْ شَاءَ اللّٰهُ لاَ أَحْلِفُ عَلٰی يَمِيْنٍ فَأَرٰی غَيْرَهَا خَيْرًا مِّنْهَا إِلاَّ كَفَّرْتُ عَنْ يَمِييْنِيْ ، وَأَتَيْتُ الَّذِيْ هُوَ خَيْرٌ ] [بخاري، الأیمان والننذور، باب قول اللّٰہ تعالٰی : « لایؤاخذکم اللّٰہ …» : ۶۶۲۳ ] ’’اور اللہ کی قسم! میں، اگر اللہ نے چاہا تو کسی بھی بات پر قسم کھاؤں گا، پھر اس کے خلاف کو اس سے بہتر دیکھوں گا تو اپنی قسم کا کفارہ دوں گا اور وہ کام کروں گا جو بہتر ہے۔‘‘ ناجائز کام کی قسم کھالے تو اسے توڑنا اور اس کا کفارہ دینا ضروری ہے۔ ¤ ➋ { وَ اللّٰهُ مَوْلٰىكُمْ وَ هُوَ الْعَلِيْمُ الْحَكِيْمُ : ’’مَوْلٰي‘‘} کا معنی ہے مالک، دوست، مددگار۔ یعنی اللہ تعالیٰ تمھارا مالک، تمھارا مددگار اور تم پر بے حد مہربان ہے، اسی لیے اس نے تمھیں ایسی چیزوں سے منع فرمایا ہے جو تمھیں مشکل میں مبتلا کر دیں اور اگر قسم کھا کر ایسی کسی مشکل میں پڑ جاؤ تو اس سے نکلنے کا طریقہ بھی بتا دیا ہے، کیونکہ : «يُرِيْدُ اللّٰهُ بِكُمُ الْيُسْرَ وَ لَا يُرِيْدُ بِكُمُ الْعُسْرَ » [ البقرۃ  : ۱۸۵ ] ’’اللہ تمھارے ساتھ آسانی کا ارادہ رکھتا ہے اور تمھارے ساتھ تنگی کا ارادہ نہیں رکھتا۔‘‘ اور وہی ہے جو سب کچھ جاننے والا اور کمال حکمت والا ہے، اس لیے اس کے کسی حکم میں کوئی خطا نہیں، کیونکہ اس کے تمام احکام کامل علم و حکمت پر مبنی ہیں۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3 ) ➊ { وَ اِذْ اَسَرَّ النَّبِيُّ اِلٰى بَعْضِ اَزْوَاجِهٖ حَدِيْثًا :} اس بیوی سے مراد حفصہ رضی اللہ عنھا ہیں، جیسا کہ اس سے پہلے شہد اور ماریہ قبطیہ رضی اللہ عنھا والے واقعات میں گزر چکا ہے کہ آپ نے ان سے کہا تھا کہ یہ بات کسی کو نہ بتانا۔ یہ بھی ہو سکتا ہے کہ اس کے علاوہ بھی کوئی بات فرمائی ہو جس کا اللہ تعالیٰ نے ذکر نہیں فرمایا۔ ¤ ➋ {فَلَمَّا نَبَّاَتْ بِهٖ وَ اَظْهَرَهُ اللّٰهُ عَلَيْهِ :} پھر جب حفصہ رضی اللہ عنھا نے وہ بات جس کے راز رکھنے کی انھیں رسول اللہ صلی اللہ علیہ وسلم نے تاکید فرمائی تھی، عائشہ رضی اللہ عنھا کو بتا دی اور اللہ تعالیٰ نے نبی صلی اللہ علیہ وسلم کو اس بات کی اطلاع دے دی۔ ¤ ➌ { عَرَّفَ بَعْضَهٗ وَ اَعْرَضَ عَنْۢ بَعْضٍ :} تو آپ صلی اللہ علیہ وسلم نے حفصہ رضی اللہ عنھا کو اس میں سے کچھ بات جتلائی کہ تم نے یہ بات آگے بتا دی ہے اور کچھ سے اعراض کیا۔ آپ نے انھیں کیا جتلایا اور کیا نہیں جتلایا اللہ تعالیٰ نے اس کا ذکر نہیں فرمایا، اس لیے سلامتی اسی میں ہے کہ اسے اسی طرح مبہم رہنے دیا جائے۔ ¤ ➍ اس سے رسول اللہ صلی اللہ علیہ وسلم کا کمال حسن خلق اور حلم و کرم ظاہر ہے کہ ناراضی کا اظہار کرتے وقت ایک ایک بات کا ذکر کر کے طعن و تشنیع نہیں فرمائی، بلکہ کچھ بات کا ذکر کیا اور کچھ سے اعراض فرمایا۔ ¤ ➎ {قَالَتْ مَنْ اَنْۢبَاَكَ هٰذَا قَالَ نَبَّاَنِيَ الْعَلِيْمُ الْخَبِيْرُ:} حفصہ رضی اللہ عنھا نے خیال کیا کہ آپ کو یہ بات عائشہ رضی اللہ عنھا نے بتائی ہوگی، اس لیے پوچھ لیا کہ آپ کو یہ بات کس نے بتائی ہے؟ آپ نے فرمایا، مجھے اس نے بتائی ہے جو سب کچھ جاننے والا اور ہر چیز سے باخبر ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {اِنْ تَتُوْبَاۤ اِلَى اللّٰهِ …:} اس آیت میں خطاب عائشہ اور حفصہ( رضی اللہ عنھما ) سے ہے۔ عبداللہ بن عباس رضی اللہ عنھما نے فرمایا : [ لَمْ أَزَلْ حَرِيْصًا أَنْ أَسْأَلَ عُمَرَ عَنِ الْمَرْأَتَيْنِ مِنْ أَزْوَاجِ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّممَ اللَّتَيْنِ قَالَ اللّٰهُ تَعَالٰی: « اِنْ تَتُوْبَاۤ اِلَى اللّٰهِ فَقَدْ صَغَتْ قُلُوْبُكُمَا» حَتّٰی حَجَّ عُمَرُ وَحَجَجْتُ مَعَهُ، فَلَمَّا كُنَّا بِبَعْضِ الطَّرِيْقِ عَدَلَ عُمَرُ ووَعَدَلْتُ مَعَهُ بِالْإِدَاوَةِ فَتَبَرَّزَ ثُمَّ أَتَانِيْ فَسَكَبْتُ عَلٰی يَدَيْهِ فَتَوَضَّأَ فَقُلْتُ يَا أَممِيْرَ الْمُؤْمِنِيْنَ! مَنِ الْمَرْأَتَانِ مِنْ أَزْوَاجِ النَّبِييِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ اللَّتَانِ قَالَ اللّٰهُ عَزَّ وَجَلَّ لَهُمَا : « اِنْ تَتُوْبَاۤ اِلَى اللّٰهِ فَقَدْ صَغَتْ قُلُوْبُكُمَا » ؟ قَالَ عُمَرُ وَاعَجَبًا لَكَ يَا ابْنَ عَبَّاسٍ ! هِيَ حَفْصَةُ  وَ عَائِشَةُ ] [ مسلم، الطلاق، باب في الإیلاء … : ۳۴ /۱۴۷۹ ] ’’مجھے ہمیشہ خواہش رہی کہ میں عمر بن خطاب رضی اللہ عنہ سے نبی صلی اللہ علیہ وسلم کی بیویوں میں سے ان دو عورتوں کے بارے میں پوچھوں جن کے بارے میں اللہ تعالیٰ نے فرمایا ہے : « اِنْ تَتُوْبَاۤ اِلَى اللّٰهِ فَقَدْ صَغَتْ قُلُوْبُكُمَا» یہاں تک کہ انھوں نے حج کیا اور میں نے بھی ان کے ساتھ حج کیا، ایک جگہ وہ راستے سے ہٹ کر (قضائے حاجت کے لیے) ایک طرف کو گئے تو میں بھی پانی کا لوٹا لے کر ان کے ساتھ اس طرف کو چلا گیا۔ پھر وہ فارغ ہو کر آئے تو میں نے ان کے ہاتھوں پر پانی ڈالا، انھوں نے وضو کیا تو میں نے کہا : ’’اے امیر المومنین! نبی صلی اللہ علیہ وسلم کی بیویوں میں سے وہ دو عورتیں کون ہیں جن کے متعلق اللہ تعالیٰ نے فرمایا ہے : « اِنْ تَتُوْبَاۤ اِلَى اللّٰهِ فَقَدْ صَغَتْ قُلُوْبُكُمَا » ؟‘‘ انھوں نے فرمایا : ’’ابن عباس! تم پر تعجب ہے، وہ دونوں عائشہ اور حفصہ( رضی اللہ عنھما ) ہیں۔‘‘ ¤ ➋ {فَقَدْ صَغَتْ قُلُوْبُكُمَا : ’’صَغَا يَصْغُوْ صَغْوًا‘‘} (ن) اور {’’صَغِيَ يَصْغٰي صَغْيًا‘‘} (س) مائل ہونا، ایک طرف جھک جانا۔ اس سے پہلے رسول اللہ صلی اللہ علیہ وسلم کی ان دو بیویوں کا ذکر غائب کے صیغے کے ساتھ تھا، جن کی وجہ سے آپ صلی اللہ علیہ وسلم نے شہد اور ماریہ رضی اللہ عنھا سے اجتناب کی قسم کھائی تھی، اب انھیں مخاطب کر کے توبہ کی تلقین فرمائی ہے۔ اس آیت کی تفسیر تقریباً تمام قدیم مفسرین نے یہ کی ہے کہ اگر تم دونوں اللہ کی طرف توبہ کرو تو یہ تمھارے لیے بہتر ہے اور تمھیں توبہ کرنی ہی چاہیے، کیونکہ تمھارے دل درست بات سے دوسری طرف مائل ہو گئے ہیں اور تم نے رسول اللہ صلی اللہ علیہ وسلم کو ان کی پسندیدہ چیزوں شہد اور ماریہ رضی اللہ عنھا سے اجتناب کی قسم تک پہنچا کر درست کام نہیں کیا۔ لفظوں کے تھوڑے بہہت اختلاف کے ساتھ آیت کا یہی مفہوم طبری، قرطبی، رازی، ابن جُزَیّ، ابن عطیہ، ابو السعود، بغوی، ابن جوزی، سمر قندی اور دوسرے جلیل القدر مفسرین نے بیان فرمایا ہے اور ظاہر بھی یہی ہے، کیونکہ ان ازواج مطہرات کی دلی خواہش کہ رسول اللہ صلی اللہ علیہ وسلم زینب رضی اللہ عنھا کے ہاں شہد نہ پییں اور اپنی ام ولد ماریہ رضی اللہ عنھا کے پاس نہ جائیں، کسی طرح بھی درست قرار نہیں دی جاسکتی۔ خود اللہ تعالیٰ نے ان کی خواہش کو پورا کرنے کی وجہ سے نبی صلی اللہ علیہ وسلم پر محبت آمیز عتاب فرمایا۔ ¤ موجودہ دور کے بعض حضرات نے اس معنی کو ان ازواج مطہراترات کی توہین قرار دے کر اس کا انکار کر دیا، ان کے خیال میں اس سے ثابت ہوتا ہے کہ ان ازواج مطہرات کے دل حق سے ہٹے ہوئے تھے، حالانکہ کسی ایک بات میں کسی شخص کے دل کا میلان نا درست بات کی طرف ہو جائے تو اسے پورے راہ صواب سے ہٹا ہوا نہیں کہہ سکتے اور نہ ہی کسی مفسر کے کسی حاشیۂ خیال میں امہات المومنین کے متعلق کوئی ایسی بات ہے اور یہاں تو امہات المومنین نے اللہ تعالیٰ کے حکم پر سر تسلیم خم کیا اور سچے دل سے توبہ کی تھی۔ اللہ تعالیٰ نے دنیا اور آخرت میں ان کے لیے ازواج رسول ہونے کا شرف برقرار رکھا، پھر ان کے متعلق کون کہہ سکتا ہے کہ ان کے دل راہِ صواب سے ہٹے ہوئے تھے!؟ ¤ ایک مطلب آیت کا یہ ہے اور بعض حضرات نے اسی کو درست اور دوسرے ہر مطلب کو غلط قرار دیا ہے کہ ’’اگر تم اللہ کی طرف توبہ کرو تو تم سے کچھ بعید نہیں، کیونکہ تمھارے دل پہلے ہی توبہ کی طرف مائل ہوچکے ہیں۔‘‘ مفسر قرطبی نے پہلے معنی کے علاوہ اس معنی کا ذکر بھی کیا ہے۔ مگر اسی کو درست اور دوسرے معنی کو غلط اور لغت عرب سے ناواقفیت قرار دینا اہل علم کا شیوہ نہیں۔ اہلِ علم کا شیوہ وہ ہے جو قرطبی نے اختیار فرمایا ہے کہ دونوں معنی ذکر فرما دیے، جو راجح تھا اسے پہلے ذکر فرمایا مگر دوسرے کا انکار نہیں کیا۔ یہ بات تسلیم کہ {’’صَغَا يَصْغُوْ‘‘} اور {’’صَغِيَ يَصْغٰي‘‘} کے الفاظ کسی چیز کی طرف مائل ہونے کے لیے آتے ہیں، مگر اس سے یہ کیسے ثابت ہوا کہ یہ حق ہی کی طرف مائل ہونے کے لیے آتے ہیں، ناحق کی طرف مائل ہونے کے لیے نہیں آتے۔ ناحق کی طرف مائل ہونے کا مفہوم حق سے ہٹنے کے سوا کیا ہو سکتا ہے؟ سورۂ انعام کی آیت (۱۱۳) : «وَ لِتَصْغٰۤى اِلَيْهِ اَفْـِٕدَةُ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ » میں جن لوگوں کا ذکر ہوا ہے اس میں ان کے دل حق کی طرف مائل ہونے کا نہیں بلکہ ناحق ہی کی طرف مائل ہونے کا ذکر ہے۔ اس لیے شاہ ولی اللہ، شاہ عبدالقادر، شاہ رفیع الدین، احمد علی لاہوری، فتح محمد جالندھری اور دوسرے مترجمین نے پہلے مفہوم والا ترجمہ ہی کیا ہے، حتیٰ کہ ایک مترجم صاحب جو رسول اللہ صلی اللہ علیہ وسلم کی محبت کا بہت بلند بانگ دعویٰ رکھتے ہیں اور اہلِ توحید کو گستاخ اور بے ادب قرار دیتے نہیں تھکتے، انھوں نے بھی یہ ترجمہ کیا ہے : ’’نبی کی دونوں بیویو! اگر اللہ کی طرف تم رجوع کرو تو ضرور تمھارے دل راہ حق سے کچھ ہٹ گئے ہیں۔‘‘ تو کیا یہ کہا جاسکتا ہے کہ ان کے نزدیک ازواج مطہرات کے دل راہ حق سے کچھ ہٹے ہوئے تھے؟ ¤ ➌ {وَ اِنْ تَظٰهَرَا عَلَيْهِ : ’’ تَظٰهَرَا ‘‘} باب تفاعل سے فعل مضارع ہے جو اصل میں {’’تَتَظَاهَرَانِ‘‘} تھا، ایک تاء تخفیف کے لیے حذف کر دی گئی اور حرف شرط {’’ اِنْ ‘‘ } کی وجہ سے نون اعرابی گر گیا۔ اس کا مادہ {’’ظَهْرٌ‘‘} (پشت) ہے۔ باب تفاعل میں تشارک کا معنی ہوتا ہے، ایک دوسرے کی پشت پناہی کرنا، ایک دوسرے کی مدد کرنا۔ {’’ تَظٰهَرَا ‘‘} کے بعد {’’ عَلَيْهِ ‘‘} کا معنی ہے، اس کے خلاف ایک دوسرے کی مدد کرو۔ ¤ ➍ { فَاِنَّ اللّٰهَ هُوَ مَوْلٰىهُ : ’’ مَوْلٰي‘‘} کا معنی مالک بھی ہے اور مددگار بھی۔ اگر مالک معنی کریں تو یہ جملہ {’’ مَوْلٰىهُ ‘‘} پر مکمل ہو گیا اور {’’ جِبْرِيْلُ ‘‘} سے {’’ ظَهِيْرٌ ‘‘} تک الگ جملہ ہے، کیونکہ مالک صرف اللہ ہے اور کوئی مالک نہیں، جب کہ مدد اللہ کی طرف سے بھی ہوتی ہے اور بندوں کی طرف سے بھی، جیسا کہ فرمایا : « هُوَ الَّذِيْۤ اَيَّدَكَ بِنَصْرِهٖ وَ بِالْمُؤْمِنِيْنَ » [ الأنفال : ۶۲ ] ’’وہی ہے جس نے تجھے اپنی مدد کے ساتھ اور مومنوں کے ساتھ قوت بخشی۔‘‘ اور فرمایا : « اِلَّا تَنْصُرُوْهُ فَقَدْ نَصَرَهُ اللّٰهُ» [ التوبۃ : ۴۰ ] ’’اگر تم اس کی مدد نہ کرو تو بلاشبہ اللہ نے اس کی مدد کی۔‘‘ اور فرمایا : « وَ يَنْصُرُوْنَ اللّٰهَ وَ رَسُوْلَهٗ» [ الحشر : ۸ ] ’’اور وہ اللہ اور اس کے رسول کی مدد کرتے ہیں۔‘‘ اور فرمایا : « مَنْ اَنْصَارِيْۤ اِلَى اللّٰهِ » [ آل عمران : ۵۲ ] ’’کون ہیں جو اللہ کی طرف میرے مدد گار ہیں؟‘‘ یعنی اگر تم دونوں اللہ کی طرف توبہ کرو تو بہتر ہے اور اگر تم دونوں رسول اللہ صلی اللہ علیہ وسلم کے خلاف ایک دوسری کی مدد کرو تو ہمارے رسول کو تمھاری کچھ پروا نہیں، کیونکہ اللہ اس کا مالک ہے اور جبریل اور صالح مومنین اور اس کے بعد تمام فرشتے اس کے مددگار اور پشت پناہ ہیں۔ اور اگر {’’مَوْلٰي‘‘} کا معنی مددگار کریں تو پہلا جملہ {’’ صَالِحُ الْمُؤْمِنِيْنَ ‘‘} پر پورا ہوگا اور دوسرا جملہ {’’ وَ الْمَلٰٓىِٕكَةُ ‘‘} (مبتدا) سے شروع ہو کر {’’ ظَهِيْرٌ ‘‘} پر ختم ہوگا، یعنی اگر تم دونوں اس کے خلاف ایک دوسری کی مدد کرو تو یقینا اللہ اور جبریل اور صالح مومنین اس کے مددگار ہیں اور اس کے بعد تمام فرشتے اس کے پشت پناہ اور مددگار ہیں۔ یہ دوسرا معنی راجح ہے، کیونکہ اللہ تعالیٰ مالک تو ہر ایک کا ہے، صرف نبی صلی اللہ علیہ وسلم کا نہیں، ہاں! خاص نصرت اس کی اپنے رسولوں اور ایمان والوں کے ساتھ ہے، کفار کے ساتھ نہیں، جیسا کہ فرمایا : «اِنَّا لَنَنْصُرُ رُسُلَنَا وَ الَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَ يَوْمَ يَقُوْمُ الْاَشْهَادُ» [ المؤمن : ۵۱ ] ’’بے شک ہم اپنے رسولوں کی اور ان لوگوں کی جو ایمان لائے ضرور مدد کرتے ہیں دنیا کی زندگی میں اور اس دن بھی جب گواہ کھڑے ہوں گے۔ ‘‘ ¤ ➎ {صَالِحُ الْمُؤْمِنِيْنَ : ’’ صَالِحُ ‘‘} اسم جنس ہے جو واحد و جمع سب پر بولا جاتا ہے، اس لیے جمع کا لفظ {’’صَالِحُوا الْمُؤْمِنِيْنَ‘‘} بولنے کی ضرورت محسوس نہیں کی گئی۔ ¤ ➏ { وَ الْمَلٰٓىِٕكَةُ بَعْدَ ذٰلِكَ ظَهِيْرٌ:} یہاں ایک مشہور سوال ہے کہ مبتدا {’’ الْمَلٰٓىِٕكَةُ ‘‘} جمع کی خبر {’’ ظَهِيْرٌ ‘‘} واحد کیوں ہے؟ جواب اس کا یہ ہے کہ {’’فَعِيْلٌ‘‘} کا وزن واحد، تثنیہ، جمع اور مذکر و مؤنث سب کے لیے یکساں استعمال ہوتا ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ { عَسٰى رَبُّهٗۤ اِنْ طَلَّقَكُنَّ اَنْ يُّبْدِلَهٗۤ اَزْوَاجًا خَيْرًا مِّنْكُنَّ … :} اس آیت میں عائشہ اور حفصہ رضی اللہ عنھما کے ساتھ دوسری بیویوں کو بھی خطاب میں شامل فرما لیا ہے، کیونکہ بعض باتوں خصوصاً خرچے میں اضافے کے مطالبے کے ساتھ انھوں نے بھی رسول اللہ صلی اللہ علیہ وسلم کو اتنا پریشان کیا کہ آپ نے ایک ماہ کے لیے ان کے پاس نہ جانے کی قسم کھالی، جس کے مکمل ہونے پر اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو حکم دیا کہ اپنی بیویوں کو اختیار دیں۔ تفصیل کے لیے دیکھیے سورۂ احزاب (29،28) کی تفسیر۔ انس رضی اللہ عنہ بیان کرتے ہیں کہ عمر رضی اللہ عنہ نے فرمایا : [ اِجْتَمَعَ نِسَاءَ النَّبِيِّ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ فِي الْغَيْرَةِ عَلَيْهِ فَقُلْتُ لَهُنَّ عَسٰی رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبَدِّلَهُ أَزْوَاجًا خَيْرًا مِّنْكُنَّ فَنَزَلَتْ هٰذِهِ الْآيَةُ ] [ بخاري، التفسیر، باب : «عسی ربہ إن طلقکن…» : ۴۹۱۶ ] ’’نبی صلی اللہ علیہ وسلم کی بیویاں غیرت (رشک و رقابت) میں آپ کے خلاف اکٹھی ہوگئیں تو میں نے ان سے کہا کہ اگر آپ صلی اللہ علیہ وسلم تمھیں طلاق دے دیں تو آپ کا رب قریب ہے کہ آپ صلی اللہ علیہ وسلم کو تم سے بہتر بیویاں دے دے، تو اس پر یہ آیت نازل ہوئی۔‘‘ ¤ عبداللہ بن عباس رضی اللہ عنھما نے بیان کیا کہ مجھے عمر بن خطاب رضی اللہ عنہ نے بیان کیا : ’’جب رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں سے علیحدگی اختیار کی تو میں مسجد میں داخل ہوا، دیکھا کہ لوگ (متفکر بیٹھے ہوئے) کنکریوں کے ساتھ زمین پر نکتے بنا رہے ہیں اور کہہ رہے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی عورتوں کو طلاق دے دی ہے اور یہ حجاب کا حکم نازل ہونے سے پہلے کی بات ہے۔ تو میں نے کہا، میں آج یہ بات ضرور معلوم کر کے رہوں گا۔‘‘ خیر عمر رضی اللہ عنہ نے اپنے عائشہ اور حفصہ رضی اللہ عنھما کے پاس جانے اور انھیں نصیحت کا ذکر فرمایا۔ اس کے بعد فرمایا : ’’میں داخل ہوا تو دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کا غلام رباح( رضی اللہ عنہ ) بالاخانے کی دہلیز پر موجود ہے، (جس بالا خانے میں آپ نے ایک ماہ بیویوں سے علیحدہ رہ کر گزارا) میں نے اسے آواز دی اور کہا اے رباح! میرے لیے رسول اللہ صلی اللہ علیہ وسلم سے آپ کے پاس جانے کی اجازت مانگو۔‘‘ مختصر یہ کہ عمر رضی اللہ عنہ اجازت ملنے پر اندر گئے اور آپ کو مانوس کرنے کے لیے کچھ باتیں کہیں۔ فرماتے ہیں : ’’میں نے کہا، یا رسول اللہ! آپ پر عورتوں کے معاملے میں کیا مشکل پیش آئے گی؟ سو اگر آپ نے انھیں طلاق دے دی ہے تو اللہ آپ کے ساتھ ہے اور اس کے فرشتے اور جبریل اور میں اور ابو بکر اور تمام مومن آپ کے ساتھ ہیں۔ اور میں نے کم ہی کبھی کوئی بات کی اور میں اللہ کی حمد بیان کرتا ہوں، مگر یہ امید رکھی کہ اللہ تعالیٰ میری بات کو سچا کر دے گا، تو یہ آیت یعنی آیت تخییر اتری : « عَسٰى رَبُّهٗۤ اِنْ طَلَّقَكُنَّ اَنْ يُّبْدِلَهٗۤ اَزْوَاجًا خَيْرًا  مِّنْكُنَّ» [ التحریم : ۵ ] ’’اس کا رب قریب ہے، اگر وہ تمھیں طلاق دے دے کہ تمھارے بدلے اسے تم سے بہتر بیویاں دے دے۔‘‘ اور یہ آیت اتری : «وَ اِنْ تَظٰهَرَا عَلَيْهِ فَاِنَّ اللّٰهَ هُوَ مَوْلٰىهُ وَ جِبْرِيْلُ وَ صَالِحُ الْمُؤْمِنِيْنَ وَ الْمَلٰٓىِٕكَةُ بَعْدَ ذٰلِكَ  ظَهِيْرٌ» [ التحریم : ۴ ] ’’اور اگر تم اس کے خلاف ایک دوسرے کی مدد کرو تو یقینا اللہ خود اس کا مدد گار ہے اور جبریل اور صالح مومن اور اس کے بعد تمام فرشتے مددگار ہیں۔‘‘ [ مسلم، الطلاق، باب في الإیلاء و اعتزال النساء وتخییرھن… : ۱۴۷۹ ] ¤ اس حدیث سے معلوم ہوا کہ {’’ صَالِحُ الْمُؤْمِنِيْنَ ‘‘} سے مراد سب سے پہلے ابو بکر و عمر رضی اللہ ع عنھما ہیں، پھر ان کے ساتھ تمام مومن شامل ہیں اور یہ آیت بھی موافقات عمر رضی اللہ عنہ میں سے ہے، یعنی وہ آیات جو ان باتوں کے موافق اتریں جو عمر رضی اللہ عنہ نے کہی تھیں۔ ان میں بدر کے قیدیوں کا معاملہ، حجاب کا معاملہ، مقام ابراہیم کو جائے نماز بنانے کا معاملہ اور دوسری کئی باتیں شامل ہیں۔ ¤ ➋ اس آیت میں نبی صلی اللہ علیہ وسلم کی بیویوں کو تنبیہ ہے کہ تم اس خیال میں نہ رہنا کہ نبی صلی اللہ علیہ وسلم کو تم سے بہتر بیویاں نہیں مل سکتیں، اس لیے تم جس طرح چاہو نبی صلی اللہ علیہ وسلم پر دباؤ ڈالتی رہو، بلکہ اگر آپ نے تمھیں طلاق دے دی تو آپ کا رب قریب ہے کہ آپ کو تم سے کہیں بہتر بیویاں عطا فرما دے۔ ¤ ➌ { مُسْلِمٰتٍ مُّؤْمِنٰتٍ قٰنِتٰتٍ :} ان صفات کی تفسیر پہلے گزر چکی ہے۔ (دیکھیے احزاب : ۳۵) {’’ تٰٓىِٕبٰتٍ عٰبِدٰتٍ سٰٓىِٕحٰتٍ ‘‘ } کے لیے دیکھیے سورۂ توبہ (۱۱۲)۔ ¤ ➍ {ثَيِّبٰتٍ وَّ اَبْكَارًا : ’’ ثَيِّبٰتٍ ‘‘ ’’ ثَيِّبٌ ‘‘} کی جمع ہے، طلاق یافتہ یا بیوہ عورت۔ یہ {’’ثَابَ يَثُوْبُ ثَوْبًا‘‘} (ن) سے مشتق ہے، اسے ’’ثيب‘‘ اس لیے کہا جاتا ہے کہ وہ خاوند سے واپس لوٹ آتی ہے اور پھر اسی طرح خاوند کے بغیر رہ جاتی ہے جیسے پہلے تھی۔ {’’ اَبْكَارًا ‘‘ ’’بِكْرٌ‘‘} کی جمع ہے، کنواری۔ اسے ’’بکر‘‘ اس لیے کہتے ہیں کہ یہ ابھی اپنی اسی پہلی حالت پر ہوتی ہے جس پر پیدا ہوئی تھی اور ہر جنس میں سب سے پہلی چیز کو بکر کہتے ہیں۔ پہلی صفات کے درمیان واؤ عطف نہیں لائی گئی، کیونکہ وہ سب ایک وقت میں جمع ہو سکتی ہیں، مگر کسی عورت میں ان دونوں میں سے ایک وقت میں ایک ہی صفت ہو سکتی ہے، اس لیے واؤ عطف لائی گئی۔ بے شک رسول اللہ صلی اللہ علیہ وسلم نے کنواری عورتوں کے ساتھ نکاح کی ترغیب دلائی مگر بعض اوقات ثیبات میں علم و عقل اور تجربے وغیرہ کی ایسی صفات ہوتی ہیں جو انھیں ابکار پر ترجیح دینے کا باعث ہوتی ہیں، اس لیے اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو دونوں طرح کی بیویاں عطا فرمائیں۔ ¤ ➎ اس آیت میں رسول اللہ صلی اللہ علیہ وسلم کو آپ کی ازواج سے بہتر ازواج عطا کرنے کی امید اس شرط پر دلائی تھی کہ آپ موجودہ بیویوں کو طلاق دے دیں، مگر نہ آپ صلی اللہ علیہ وسلم نے انھیں طلاق دی اور نہ اللہ تعالیٰ نے ان سے بہتر بیویاں آپ کو دیں، بلکہ انھی کو بہتر ہونے کا اور دنیا اور آخرت میں آپ صلی اللہ علیہ وسلم کی ازواج رہنے کا شرف عطا فرمایا۔ ¤ ➏ اس آیت سے معلوم ہوا کہ آدمی کو بیوی کے انتخاب کے وقت ان صفات کی حامل عورت کو ترجیح دینی چاہیے جو اس آیت میں مذکور ہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ تُنْكَحُ الْمَرْأَةُ لِأَرْبَعٍ : لِمَالِهَا وَ لِحَسَبِهَا وَجَمَالِهَا وَ لِدِيْنِهَا، فَاظْفَرْ بِذَاتِ الدِّيْنِ تَرِبَتْ يَدَاكَ ] [ بخاري، النکاح، باب الأکفاء في الدیین : ۵۰۹۰، عن أبي ہریرۃ رضی اللہ عنہ ] ’’عورت سے چار چیزوں کی وجہ سے نکاح کیا جاتا ہے، اس کے مال کی وجہ سے، اس کے حسب اور اس کے جمال کی وجہ سے اور اس کے دین کی وجہ سے، سو تو دین والی عورت کے ساتھ نکاح میں کامیابی حاصل کر، تیرے ہاتھ خاک آلود ہوں۔‘‘ ¤ ➐ اس مقام پر بعض مفسرین نے لکھا ہے کہ ’’ثیب‘‘ سے مراد آسیہ زوجۂ فرعون ہیں اور ’’بکر‘‘ سے مراد مریم بنت عمران ہیں، ان دونوں کا نکاح جنت میں نبی صلی اللہ علیہ وسلم سے کیا جائے گا، مگر ایک تو اس بات کا اس آیت سے کوئی تعلق نہیں، کیونکہ اس میں پہلی بیویوں کو طلاق دینے کی صورت میں ان کے بدلے میں ان سے بہتر ثیبات و ابکار بیویاں عطا کرنے کا ذکر ہے اور جب آپ نے پہلی بیویوں کو طلاق ہی نہیں دی تو ان کے بدلے میں اور بیویوں کا سوال ہی پیدا نہیں ہوتا۔ دوسرے یہ کہ اللہ تعالیٰ جنت میں ان دونوں عظیم خواتین کا نکاح رسول اللہ صلی اللہ علیہ وسلم سے کر دے تو یہ ناممکن نہیں، مگر یہ ثابت ہونا تو ضروری ہے، جب کہ کسی صحیح دلیل سے یہ بات ثابت نہیں۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) ➊ {يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا قُوْۤا اَنْفُسَكُمْ وَ اَهْلِيْكُمْ نَارًا :} پچھلی آیات میں امہات المومنین کی تربیت اور ان کے اعمال و اخلاق کی اصلاح کا بیان تھا، اب تمام ایمان والوں کو اس کا حکم دیا جا رہا ہے۔ {’’ نَارًا ‘‘} میں تنوین تعظیم کے لیے ہے، یعنی اس عظیم آگ سے بچ جاؤ۔ {’’ قُوْا‘‘} (بچاؤ) {’’وَقٰي يَقِيْ وَقْيًا وَ وِقَايَةً‘‘} (ض) سے امر حاضر جمع مذکر ہے۔ اس میں ایمان والوں کو ایک نہایت اہم ذمہ داری کی طرف توجہ دلائی ہے کہ وہ اپنے آپ کو جہنم کی آگ سے بچائیں اور اس کے ساتھ اپنے گھر والوں کی تعلیم و تربیت اور ان کے اعمال و اخلاق کی اصلاح کا اہتمام کر کے انھیں بھی جہنم کی آگ سے بچائیں۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْؤلٌ عَنْ رَعِيَّتِهٖ ] [ بخاري، الجمعۃ، باب الجمعۃ في القرٰی والمدن : ۸۹۳ ] ’’تم میں سے ہر ایک راعی (نگہبان) ہے اور تم میں سے ہر ایک سے اس کی رعیت کے بارے میں سوال کیا جانے والا ہے۔‘‘ قرآن مجید میں اللہ تعالیٰ نے نبی مکرم صلی اللہ علیہ وسلم اور امت کے ہر فرد کو اپنے گھر والوں کو نماز کا حکم دینے اور اس پر پابند رہنے کا حکم دیا، فرمایا : «وَ اْمُرْ اَهْلَكَ بِالصَّلٰوةِ وَ اصْطَبِرْ عَلَيْهَا » [ طٰہٰ : ۱۳۲ ] ’’اور اپنے گھر والوں کو نماز کا حکم دے اور اس پر خوب پابند رہ۔‘‘ اس مقصد کے لیے بچپن ہی سے انھیں نماز روزے اور اسلام کے دوسرے احکام پر عمل کی عادت ڈالنی چاہیے اور سمجھ دار ہونے پر اس کے لیے سختی کی ضرورت ہو تو وہ بھی کرنی چاہیے، خواہ ابھی بالغ نہ ہوئے ہوں اور سن تمیز شروع ہونے کے ساتھ ہی انھیں جنسی بے راہ روی سے محفوظ رکھنے کی کوشش کرنی چاہیے۔ عبداللہ بن عمرو رضی اللہ عنھما فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ مُرُوْا أَوْلاَدَكُمْ بِالصَّلاَةِ وَهُمْ أَبْنَاءُ سَبْعِ سِنِيْنَ وَاضْرِبُوْهُمْ عَلَيْهَا وَهُمْ أَبْنَاءُ عَشْرِ سِنِيْنَ وَفَرِّقُوْا بَيْنَهُمْ فِي الْمَضَاجِعِ ] [ أبو داوٗد، الصلاۃ، باب متٰی یؤمر الغلام بالصلاۃ : ۴۹۵، و قال الألباني حسن صحیح ] ’’اپنے بچوں کو نماز کاحکم دو جب وہ سات برس کے ہوں اور اس پر انھیں مارو جب وہ دس برس کے ہوں اور بستروں میں انھیں ایک دوسرے سے الگ کر دو۔‘‘ ¤ ➋ { وَ قُوْدُهَا النَّاسُ وَ الْحِجَارَةُ :} اس کی تفصیل کے لیے دیکھیے سورۂ بقرہ (۲۴) کی تفسیر۔ ¤ ➌ {عَلَيْهَا مَلٰٓىِٕكَةٌ غِلَاظٌ شِدَادٌ … : ’’ غِلَاظٌ ‘‘ ’’غَللِيْظٌ‘‘} کی جمع ہے، سخت دل والے، بے رحم اور {’’ شِدَادٌ ‘‘ ’’شَدِيْدٌ‘‘} کی جمع ہے، سخت قوت والے، نہایت مضبوط۔ یہاں جہنم پر مقرر فرشتوں کے چار اوصاف بیان ہوئے ہیں : (1) وہ نہایت سخت دل ہیں، انھیں کسی پر رحم نہیں آئے گا۔ (2) سخت قوت والے ہیں، کوئی ان کی گرفت سے نکل نہیں سکے گا۔ (3) اللہ تعالیٰ انھیں جو حکم بھی دے اس کی نافرمانی نہیں کرتے۔ (4) اور وہ کوئی کام اپنی مرضی سے نہیں کرتے، بلکہ وہی کرتے ہیں جس کا انھیں حکم دیا جاتا ہے۔ مزید دیکھیے سورۂ انبیاء (۲۷)۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) { يٰۤاَيُّهَا الَّذِيْنَ كَفَرُوْا لَا تَعْتَذِرُوا الْيَوْمَ … :} یعنی جب وہ سخت دل اور سخت قوت والے فرشتے جہنمیوں کو جہنم میں ڈالیں گے تو وہ مختلف عذر کریں گے اور بہانے بنائیں گے، اللہ تعالیٰ نے ان کے مختلف بہانے قرآن مجید میں ذکر فرمائے ہیں۔ (دیکھیے اعراف : ۳۸۔ انعام : 27،24،23) مگر انھیں کہا جائے گا کہ آج کوئی عذر بہانہ نہ کرو، کیونکہ تمھیں اس سے کچھ فائدہ نہیں ہوگا، تمھیں انھی اعمال کی جزا دی جا رہی ہے جو تم کرتے رہے ہو۔ مزید دیکھیے سورۂ روم (۵۷) اور سورۂ مومن (۵۲)۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ { يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا تُوْبُوْۤا اِلَى اللّٰهِ تَوْبَةً نَّصُوْحًا : ’’ تَوْبَةً ‘‘ ’’ تَابَ يَتُوْبُ تَوْبَةً ‘‘} (ن) پلٹ آنا۔ {’’ نَصُوْحًا ‘‘ ’’نَصَحَ يَنْصَحُ نُصْحًا‘‘} (ف) سے {’’فَعُوْلٌ‘‘} کے وزن پر مبالغے کا صیغہ ہے، بہت خالص۔ یہ وزن مذکر و مؤنث اور واحد، جمع و تثنیہ سب کے لیے اسی طرح استعمال ہوتا ہے، اس لیے {’’ تَوْبَةً ‘‘} مذکر ہونے کے باوجود {’’ نَصُوْحًا ‘‘} (مؤنث) کی صفت ہے۔ {’’نَصَحَ الشَّيْءُ‘‘} اس وقت کہتے ہیں جب کوئی چیز خالص ہو، اس میں کھوٹ نہ ہو۔ شہد یا کوئی اور چیز جب خالص ہو تو اسے {’’اَلنُّصْحُ‘‘} کہتے ہیں۔ {’’اَلنُّصْحُ‘‘} (خالص ہونا) {’’اَلْغَشُّ‘‘} (کھوٹا ہونے) کا متضاد ہے۔ اس آیت میں جہنم سے بچنے کا طریقہ بتلایا ہے، فرمایا اے ایمان والو! اللہ کی طرف پلٹ آؤ، خالص اور سچا پلٹنا۔ یعنی اگر نافرمانی کر کے اللہ تعالیٰ سے دور ہوگئے ہو تو اسے ترک کرکے واپس اس کی طرف پلٹ آؤ۔ توبۂ نصوح کی پہلی شرط یہ ہے کہ محض اللہ کے خوف کی وجہ سے آدمی گناہ پر نادم ہو، کسی دنیاوی نقصان کی وجہ سے ندامت توبہ نہیں۔ عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلنَّدَمُ تَوْبَةٌ ] [ ابن ماجہ، الزھد، باب ذکر التوبۃ : ۴۲۵۲، وقال الألباني صحیح ] ’’ندامت توبہ ہے۔‘‘ دوسری شرط یہ ہے کہ گناہ چھوڑ دے اور فوراً چھوڑ دے۔ (دیکھیے نساء : ۱۷۔ اعراف : ۲۰۱) تیسری شرط یہ کہ آئندہ نہ کرنے کا پختہ ارادہ کرے، گناہ پر قائم نہ رہے۔ (دیکھیے آل عمران : ۱۳۵) اور چوتھی شرط یہ ہے کہ اگر اس کا تعلق بندوں کے حقوق سے ہے تو جہاں تک ممکن ہو انھیں ادا کرے یا معافی مانگ لے۔ ¤ ➋ { عَسٰى رَبُّكُمْ اَنْ يُّكَفِّرَ عَنْكُمْ سَيِّاٰتِكُمْ … :} اس میں توبۂ نصوح پر گناہوں کی معافی اور جنتوں میں داخلے کی خوش خبری سنائی ہے۔ ¤ ➌ {يَوْمَ لَا يُخْزِي اللّٰهُ النَّبِيَّ وَ الَّذِيْنَ اٰمَنُوْا مَعَهٗ : ’’ يَوْمَ ‘‘} کا لفظ {’’ يُدْخِلَكُمْ ‘‘} کا ظرف ہے، یعنی گناہوں کی معافی اور جنت میں داخلہ اس دن ہوگا جس دن اللہ تعالیٰ نبی کو اور اس کے ساتھ ایمان لانے والوں کو رسوا نہیں کرے گا۔ اس کے ساتھ ایمان لانے والوں میں  صحابہ کرام، تابعین، تبع تابعین اور ان کے بعد قیامت تک آنے والے تمام مسلمان شامل ہیں۔ تفصیل کے لیے دیکھیے سورۂ فتح کی آخری آیت کی تفسیر۔ ان میں ازواج مطہرات بالاولیٰ شامل ہیں، کیونکہ وہ رسول اللہ صلی اللہ علیہ وسلم پر ایمان لائیں، اللہ تعالیٰ نے انھیں اپنے نبی صلی اللہ علیہ وسلم کی زوجیت کا شرف بخشا اور جب انھیں اللہ، اس کے رسول اور آخرت اور دنیا میں سے کسی ایک چیز کو قبول کرنے کا اختیار دیا گیا تو انھوں نے اللہ، اس کے رسول اور آخرت کو قبول کیا۔ (دیکھیے احزاب : ۲۸ تا ۳۴) اور ان کے ایثار اور صبر کی وجہ سے ان کے بعد اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو مزید عورتوں کے ساتھ یا ان کو بدل کر دوسری عورتوں کے ساتھ نکاح سے منع فرما دیا۔ دیکھیے سورۂ احزاب (۵۲)۔ ¤ اس دن کی رسوائی سے دنیا میں بھی انبیاء اور مومن بندے پناہ مانگتے رہے تھے۔ (دیکھیے آل عمران : ۱۹۴۔ شعراء : ۸۷) سو اللہ تعالیٰ انھیں اس رسوائی سے بچا لے گا۔ ¤ ➍ { نُوْرُهُمْ يَسْعٰى بَيْنَ اَيْدِيْهِمْ وَ بِاَيْمَانِهِمْ :} اس کے لیے دیکھیے سورۂ حدید کی آیت (۱۲) کی تفسیر۔ ¤ ➎ { يَقُوْلُوْنَ رَبَّنَاۤ اَتْمِمْ لَنَا نُوْررَنَا :} حشر کے میدان میں جب ایمان والوں اور منافقین کے درمیان دیوار حائل ہونے پر منافقین اندھیرے میں کھڑے رہ جائیں گے تو ایمان والے اس خوف سے کہ منافقین کی طرح ہماری روشنی بھی نہ بجھ جائے اللہ تعالیٰ سے اپنے نور کو پورا کرنے اور پورا رکھنے کی دعا کریں گے، تاکہ اس روشنی میں وہ جنت تک پہنچ جائیں۔ مزید دیکھیے سورۂ حدید (۱۳ تا ۱۵)۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { يٰۤاَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَ الْمُنٰفِقِيْنَ … :} پچھلی آیات میں ایمان والوں کا ٹھکانا بتایا تھا، اب دنیا اور آخرت میں کفار کے معاملے کا ذکر فرمایا کہ دنیا میں ان کے ساتھ جہاد کرنا ہے اور ان پر سختی کرنی ہے، کسی قسم کی مداہنت یا چشم پوشی سے کام نہیں لینا، تاکہ اسلام کا کلمہ سربلند رہے اور یہ لوگ اس کے سامنے سر جھکا کر زندگی بسر کریں اور آخرت میں ان کا ٹھکانا جہنم ہے اور وہ بہت برا ٹھکانا ہے۔ منافقین کے ساتھ جہاد سے کیا مراد ہے، اس کے لیے دیکھیے سورۂ توبہ (۷۳) کی تفسیر۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) ➊ { ضَرَبَ اللّٰهُ مَثَلًا لِّلَّذِيْنَ كَفَرُوا امْرَاَتَ نُوْحٍ وَّ امْرَاَتَ لُوْطٍ …:} کفار اور منافقین کے ساتھ جہاد کے حکم کے بعد کفر کی نحوست اور ایمان کی برکت بیان فرمائی کہ قیامت کے دن کافر کو کسی مسلمان کے ساتھ کسی طرح کی قرابت کام نہیں آئے گی، حتیٰ کہ اگر پیغمبر کی بیوی کافر ہے تو وہ پیغمبر اسے بھی جہنم میں جانے سے نہیں بچا سکے گا۔ اس سے پہلے قرآن مجید میں نوح علیہ السلام کے بیٹے اور ابراہیم علیہ السلام کے والد کی صورت میں نسبی قرابت کی مثالیں گزر چکی ہیں۔ یہاں نوح علیہ السلام کی بیوی اور لوط علیہ السلام کی بیوی کو کافر لوگوں کی مثال کے طور پر ذکر فرمایا۔ بعض لوگوں نے کہا کہ یہ قصہ ازواج مطہرات کو سنایا گیا ہے، مگر یہ بات غلط اور بے دلیل ہے، کیونکہ اس آیت میں کافر عورتوں کا ذکر ہے جن کے کفر کی وجہ سے ان کے خاوند ان کے کچھ کام نہ آ سکے اور انھیں آگ میں داخل کر دیا گیا۔ امہات المومنین کو ان پر کیسے قیاس کیا جا سکتا ہے جن کے ایمان، تقویٰ اور پاکیزگی کی شہادت قرآن مجید نے دی ہے!؟ حقیقت یہ ہے کہ ازواج مطہرات کا قصہ اوپر ختم ہو چکا ہے اور اس آیت کے مضمون کا تعلق {’’ يٰۤاَيُّهَا الَّذِيْنَ اٰمَنُوْا قُوْۤا اَنْفُسَكُمْ ‘‘} کے ساتھ ہے، کیونکہ ایمان والوں کا اپنے ایمان والے قرابت داروں کو فائدہ پہنچانا قرآن مجید (طور : ۲۱) اور احادیثِ شفاعت میں ثابت ہے۔ ¤ ➋ کتب تفاسیر میں نوح اور لوط علیھما السلام کی ان بیویوں کے نام مختلف آئے ہیں، مگر صحیح سند سے کوئی بھی ثابت نہیں۔ ¤ ➌ { فَخَانَتٰهُمَا :} اللہ تعالیٰ نے یہ نہیں بتایا کہ وہ خیانت کیا تھی اور نہ ہی کسی صحیح طریق سے اس خیانت کا ذکر آیا ہے۔ اگر اس کی ضرورت ہوتی تو اللہ تعالیٰ اسے ضرور ذکر فرما دیتے، اسے مبہم رکھنے میں یہ حکمت معلوم ہوتی ہے کہ بندہ ہر قسم کی خیانت سے ڈرتا رہے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) ➊ {وَ ضَرَبَ اللّٰهُ مَثَلًا لِّلَّذِيْنَ اٰمَنُوا امْرَاَتَ فِرْعَوْنَ:} یہ ایمان کی برکت کی مثال ہے کہ ’’ربِ اعلیٰ‘‘ ہونے کا دعویٰ کرنے والے ’’کافرِ اعظم‘‘ کی بیوی جب ایمان لے آئی تو خاوند کی فرعونیت نہ اسے ایمان لانے سے روک سکی اور نہ ہی آخرت کے معاملے میں اس کا کوئی نقصان کر سکی۔ اس عظیم خاتون کا نام آسیہ ہے، وہ موسیٰ علیہ السلام پر ایمان لے آئی تو فرعون نے ایک طرف اسے عالی شان محلات اور ہر قسم کی دنیوی آسائشوں کا لالچ دیا اور دوسری طرف ایمان سے باز نہ آنے پر سب کچھ چھین لیا اور اسے بے پناہ اذیتیں دینے کا سلسلہ شروع کر دیا۔ اس پر اس نے اللہ تعالیٰ سے فرعون کے محلات اور آسائشوں کے بدلے میں اپنے پڑوس میں جنت کے اندر گھر عطا کرنے اور فرعون اور اس کے مشرکانہ اور ظالمانہ کاموں سے اور اس کی ظالم قوم سے نجات عطا کرنے کی دعا کی۔ اللہ تعالیٰ نے اس کی دعا قبول فرما کر اس کی روح قبض کر لی اور اس نے جو مانگا تھا عطا فرما دیا۔ ابن جُزَیّ صاحب التسہیل لکھتے ہیں : {’’ وَرُوِيَ فِيْ قَصَصِهَا غَيْرُ هٰذَا مِمَّا يَطُوْلُ وَهُوَ غَيْرُ صَحِيْحٍ‘‘} ’’اس کے قصے میں اس کے علاوہ کئی طویل چیزیں ذکر کی گئی ہیں مگر وہ ثابت نہیں ہیں۔ ‘‘ ¤ ➋ { اِذْ قَالَتْ رَبِّ ابْنِ لِيْ عِنْدَكَ بَيْتًا فِي الْجَنَّةِ :} اہلِ علم فرماتے ہیں کہ آسیہ رضی اللہ عنھا نے جنت میں گھر بنانے کی دعا سے پہلے سب سے بہتر ہمسائیگی ملنے کی دعا کی۔ اس سے معلوم ہوا کہ اچھی جگہ اچھے مکان کی دعا سے پہلے اچھی ہمسائیگی کی دعا کرنی چاہیے اور آخرت میں وہ جنت الفردوس ہے۔ ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ فَإِذَا سَأَلْتُمُ اللّٰهَ فَاسْأَلُوْهُ الْفِرْدَوْسَ، فَإِنَّهُ أَوْسَطُ الْجَنَّةِ وَ أَعْلَی الْجَنَّةِ، أُرَاهُ قَالَ فَوْقَهُ عَرْشُ الرَّحْمٰنِ، وَمِنْهُ تَفَجَّرُ أَنْهَارُ الْجَنَّةِ ] [ بخاري، الجہاد، باب درجات المجاہدین في سبیل اللّٰہ : ۲۷۹۰ ] ’’جب تم اللہ تعالیٰ سے سوال کرو تو اس سے فردوس کا سوال کرو، کیونکہ وہ جنت کا سب سے افضل اور سب سے بلند حصہ ہے اور اس کے اوپر رحمان کا عرش ہے اور اسی سے جنت کی نہریں نکلتی ہیں۔‘‘ ¤ ➌ ابو موسیٰ اشعری رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ كَمَلَ مِنَ الرِّجَالِ كَثِيْرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ آسِيَةُ امْرَأَةُ فِرْعَوْنَ، وَمَرْيَمُ بِنْتُ عِمْرَانَ، وَ إِنَّ فَضْلَ عَائِشَةَ عَلَی النِّسَاءِككَفَضْلِ الثَّرِيْدِ عَلٰی سَائِرِ الطَّعَامِ ] [ بخاري، أحادیث الأنبیاء، باب قول اللّٰہ تعالٰی : « وضرب اللّٰہ مثلا…» : ۳۴۱۱ ] ’’مردوں میں بہت سے کامل ہوئے ہیں، مگر عورتوں میں سے آسیہ زوجۂ فرعون اور مریم بنت عمران کے سوا کوئی کامل نہیں ہوئی اور عائشہ کی فضیلت عورتوں پر ایسے ہے جیسے ثرید کی فضیلت تمام کھانوں پر ہے۔‘‘"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) { وَ مَرْيَمَ ابْنَتَ عِمْرٰنَ الَّتِيْۤ اَحْصَنَتْ فَرْجَهَا … :} یعنی اللہ تعالیٰ نے ایمان والوں کے لیے مثال کے طور پر فرعون کی بیوی آسیہ اور مریم بنت عمران کا بیان فرمایا ہے کہ دونوں اعلیٰ درجے کے ایمان والی تھیں۔ قررآن مجید میں مریم بنت عمران کا نام صرف اس مقام پر نہیں بلکہ کئی جگہ آیا ہے اور یہ واحد خاتون ہیں جن کا اللہ تعالیٰ نے قرآن میں نام لیا ہے۔ آیت کے اکثر الفاظ کی تشریح سورۂ انبیاء (۹۱) میں اور دوسرے الفاط کی تشریح مختلف آیات کی تفسیر میں گزر چکی ہے۔"
    }
  ]
}