{
  "surah": "Al-Jinn",
  "surah_number": 72,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 2،1) ➊ {قُلْ اُوْحِيَ اِلَيَّ اَنَّهُ اسْتَمَعَ … :} اس آیت سے معلوم ہوا کہ جنوں کا قرآن سن کر ایمان لانا اور ان کی آپس کی ساری گفتگو رسول اللہ صلی اللہ علیہ وسلم کو وحی کے ذریعے سے معلوم ہوئی۔ ابن عباس رضی اللہ عنھما فرماتے ہیں : [ مَا قَرَأَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ عَلَی الْجِنِّ وَ مَا رَآهُمْ ] [ مسلم، الصلاۃ، باب الجھر بالقراءۃ في الصبح… : ۴۴۹ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے نہ جنوں کے سامنے قرآن پڑھا اور نہ انھیں دیکھا (وہ تو آپ کے پاس اس وقت آئے جب آپ نخلہ میں تھے اور انھوں نے اس موقع پر قرآن سنا)۔‘‘ ہاں، اس کے بعد کئی دفعہ آپ صلی اللہ علیہ وسلم کی جنوں سے ملاقات ہوئی اور آپ نے انھیں قرآن سنایا اور پڑھایا، جیسا کہ صحیح مسلم میں عبد اللہ بن مسعود رضی اللہ عنہ سے روایت ہے، جس کا خلاصہ یہ ہے کہ ایک رات رسول اللہ صلی اللہ علیہ وسلم صحابہ سے غائب رہے، صحابہ نے وہ رات سخت پریشانی میں گزاری، تلاش کرتے کرتے وہ آپ سے اس وقت ملے جب آپ حرا کی طرف سے آرہے تھے۔ پوچھنے پر آپ صلی اللہ علیہ وسلم نے بتایا : [ أَتَانِيْ دَاعِي الْجِنِّ فَذَهَبْتُ مَعَهُ فَقَرَأْتُ عَلَيْهِمُ الْقُرْآنَ ]] ’’میرے پاس جنوں کا دعوت دینے والا آیا تھا، چنانچہ میں اس کے ساتھ گیا اور انھیں قرآن پڑھ کر سنایا۔‘‘ ابن مسعود رضی اللہ عنہ فرماتے ہیں : ’’پھر آپ ہمیں لے گئے اور ہمیں ان کے نشان اور ان کی آگوں کے نشان دکھائے۔‘‘ [ مسلم، الصلاۃ، باب الجہر بالقراءۃ في الصبح… : ۴۵۰ ] اسی طرح ایک دفعہ آپ نے جنوں کے سامنے سورۃ رحمان پڑھی اور وہ : « فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ » (تو تم دونوں اپنے رب کی کون کون سی نعمتوں کو جھٹٹلاؤ گے) پرجواب دیتے رہے : [ لاَ بِشَيْءٍ مِنْ نِعَمِكَ رَبَّنَا نُكَذِّبُ فَلَكَ الْحَمْدُ ] [ ترمذي، التفسیر، باب ومن سورۃ الرحمٰن : ۳۲۹۱، وقال الألباني صحیح ] ’’ہم تیری کسی بھی نعمت کو نہیں جھٹلاتے اے ہمارے رب! اور تیرے ہی لیے سب تعریف ہے۔‘‘ ¤ ➋ ان آیات میں کفار قریش کو شرم دلائی گئی ہے کہ دیکھو اتنی مدت تک سننے کے باوجود تم پر قرآن کا کچھ اثر نہیں ہوا، نہ تم شرک کی نجاست سے پاک ہو سکے، جب کہ یہ اتنی اعلیٰ، مؤثر اور عجیب کتاب ہے کہ جنوں کی اس جماعت نے اسے سنتے ہی ایمان قبول کر لیا اور ہمیشہ کے لیے شرک چھوڑنے کا اعلان کر دیا، حالانکہ جنوں کی سرکشی مشہور و معروف ہے۔ ¤ ➌ یہ بھی معلوم ہوا کہ جن وہ زبانیں جانتے ہیں جو انسانوں میں بولی جاتی ہیں، کم از کم وہ جن تو عربی زبان کی فصاحت و بلاغت کی باریکیوں تک کو اتناسمجھتے تھے کہ انھوں نے قرآن کو عجیب قرار دیا اور فوراً اس پر ایمان لے آئے۔ ¤ ➍ جن بھی انسانوں کی طرح شریعت کے مخاطب ہیں اور ان کے رسول بھی وہی ہیں جو انسانوں کے ہیں۔ قرآن مجید یا حدیث میں جنوں میں سے کسی پیغمبر کا ذکرنہیں آیا، اس کے برعکس زیر تفسیر سورت میں صاف ذکر ہے کہ جن قرآن پر ایمان لائے اور سورۂ احقاف میں ہے کہ انھوں نے کہا، ہم نے ایک ایسی کتاب سنی جو موسیٰ علیہ السلام کے بعد نازل کی گئی ہے۔ (دیکھیے احقاف : ۳۰) اس سے معلوم ہوتا ہے کہ وہ لوگ موسیٰ علیہ السلام کو اپنا ررسول مانتے تھے۔ سورۂ رحمان کی تمام آیات، رسول اللہ صلی اللہ علیہ وسلم کا جنوں کے سامنے انھیں پڑھنا اور ان کا جواب دینا بھی اس بات کی دلیل ہے ۔ سورۂ انبیاء (8،7) سے بھی یہی معلوم ہوتا ہے۔ ¤ ➎ جنوں میں شرک کرنے والے بھی موجود ہیں، جیسا کہ یہ جن مشرک تھے اور انھوں نے قرآن مجید سننے کے بعد شرک چھوڑا۔ معلوم ہوتا ہے کہ اس وقت رسول اللہ صلی اللہ علیہ وسلم ایسی آیات پڑھ رہے تھے جس سے انھیں شرک کی خرابی معلوم ہوئی۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2،1) ➊ {قُلْ اُوْحِيَ اِلَيَّ اَنَّهُ اسْتَمَعَ … :} اس آیت سے معلوم ہوا کہ جنوں کا قرآن سن کر ایمان لانا اور ان کی آپس کی ساری گفتگو رسول اللہ صلی اللہ علیہ وسلم کو وحی کے ذریعے سے معلوم ہوئی۔ ابن عباس رضی اللہ عنھما فرماتے ہیں : [ مَا قَرَأَ رَسُوْلُ اللّٰهِ صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ عَلَی الْجِنِّ وَ مَا رَآهُمْ ] [ مسلم، الصلاۃ، باب الجھر بالقراءۃ في الصبح… : ۴۴۹ ] ’’رسول اللہ صلی اللہ علیہ وسلم نے نہ جنوں کے سامنے قرآن پڑھا اور نہ انھیں دیکھا (وہ تو آپ کے پاس اس وقت آئے جب آپ نخلہ میں تھے اور انھوں نے اس موقع پر قرآن سنا)۔‘‘ ہاں، اس کے بعد کئی دفعہ آپ صلی اللہ علیہ وسلم کی جنوں سے ملاقات ہوئی اور آپ نے انھیں قرآن سنایا اور پڑھایا، جیسا کہ صحیح مسلم میں عبد اللہ بن مسعود رضی اللہ عنہ سے روایت ہے، جس کا خلاصہ یہ ہے کہ ایک رات رسول اللہ صلی اللہ علیہ وسلم صحابہ سے غائب رہے، صحابہ نے وہ رات سخت پریشانی میں گزاری، تلاش کرتے کرتے وہ آپ سے اس وقت ملے جب آپ حرا کی طرف سے آرہے تھے۔ پوچھنے پر آپ صلی اللہ علیہ وسلم نے بتایا : [ أَتَانِيْ دَاعِي الْجِنِّ فَذَهَبْتُ مَعَهُ فَقَرَأْتُ عَلَيْهِمُ الْقُرْآنَ ]] ’’میرے پاس جنوں کا دعوت دینے والا آیا تھا، چنانچہ میں اس کے ساتھ گیا اور انھیں قرآن پڑھ کر سنایا۔‘‘ ابن مسعود رضی اللہ عنہ فرماتے ہیں : ’’پھر آپ ہمیں لے گئے اور ہمیں ان کے نشان اور ان کی آگوں کے نشان دکھائے۔‘‘ [ مسلم، الصلاۃ، باب الجہر بالقراءۃ في الصبح… : ۴۵۰ ] اسی طرح ایک دفعہ آپ نے جنوں کے سامنے سورۃ رحمان پڑھی اور وہ : « فَبِاَيِّ اٰلَآءِ رَبِّكُمَا تُكَذِّبٰنِ » (تو تم دونوں اپنے رب کی کون کون سی نعمتوں کو جھٹٹلاؤ گے) پرجواب دیتے رہے : [ لاَ بِشَيْءٍ مِنْ نِعَمِكَ رَبَّنَا نُكَذِّبُ فَلَكَ الْحَمْدُ ] [ ترمذي، التفسیر، باب ومن سورۃ الرحمٰن : ۳۲۹۱، وقال الألباني صحیح ] ’’ہم تیری کسی بھی نعمت کو نہیں جھٹلاتے اے ہمارے رب! اور تیرے ہی لیے سب تعریف ہے۔‘‘ ¤ ➋ ان آیات میں کفار قریش کو شرم دلائی گئی ہے کہ دیکھو اتنی مدت تک سننے کے باوجود تم پر قرآن کا کچھ اثر نہیں ہوا، نہ تم شرک کی نجاست سے پاک ہو سکے، جب کہ یہ اتنی اعلیٰ، مؤثر اور عجیب کتاب ہے کہ جنوں کی اس جماعت نے اسے سنتے ہی ایمان قبول کر لیا اور ہمیشہ کے لیے شرک چھوڑنے کا اعلان کر دیا، حالانکہ جنوں کی سرکشی مشہور و معروف ہے۔ ¤ ➌ یہ بھی معلوم ہوا کہ جن وہ زبانیں جانتے ہیں جو انسانوں میں بولی جاتی ہیں، کم از کم وہ جن تو عربی زبان کی فصاحت و بلاغت کی باریکیوں تک کو اتناسمجھتے تھے کہ انھوں نے قرآن کو عجیب قرار دیا اور فوراً اس پر ایمان لے آئے۔ ¤ ➍ جن بھی انسانوں کی طرح شریعت کے مخاطب ہیں اور ان کے رسول بھی وہی ہیں جو انسانوں کے ہیں۔ قرآن مجید یا حدیث میں جنوں میں سے کسی پیغمبر کا ذکرنہیں آیا، اس کے برعکس زیر تفسیر سورت میں صاف ذکر ہے کہ جن قرآن پر ایمان لائے اور سورۂ احقاف میں ہے کہ انھوں نے کہا، ہم نے ایک ایسی کتاب سنی جو موسیٰ علیہ السلام کے بعد نازل کی گئی ہے۔ (دیکھیے احقاف : ۳۰) اس سے معلوم ہوتا ہے کہ وہ لوگ موسیٰ علیہ السلام کو اپنا ررسول مانتے تھے۔ سورۂ رحمان کی تمام آیات، رسول اللہ صلی اللہ علیہ وسلم کا جنوں کے سامنے انھیں پڑھنا اور ان کا جواب دینا بھی اس بات کی دلیل ہے ۔ سورۂ انبیاء (8،7) سے بھی یہی معلوم ہوتا ہے۔ ¤ ➎ جنوں میں شرک کرنے والے بھی موجود ہیں، جیسا کہ یہ جن مشرک تھے اور انھوں نے قرآن مجید سننے کے بعد شرک چھوڑا۔ معلوم ہوتا ہے کہ اس وقت رسول اللہ صلی اللہ علیہ وسلم ایسی آیات پڑھ رہے تھے جس سے انھیں شرک کی خرابی معلوم ہوئی۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {وَ اَنَّهٗ تَعٰلٰى جَدُّ رَبِّنَا …:} ’’اور یہ کہ ہمارے رب کی شان بہت بلند ہے‘‘ یعنی ہم اس پر بھی ایمان لے آئے کہ ہمارے رب کی شان بہت بلند ہے۔یہ جن تثلیث کو ماننے والے نصرانی تھے یا کسی ایسے مذہب کو ماننے والے تھے جس میں اللہ تعالیٰ کی بیوی اور اولاد مانی جاتی ہے۔ اب انھیں معلوم ہوا کہ اللہ تعالیٰ کی شان تو اس سے بہت بلند ہے کہ اس کی بیوی ہو یا اولاد ہو ۔ بیوی ماننے سے وہ بلند شان والا نہیں بلکہ محتاج ٹھہرتا ہے، کیونکہ خاوند شہوت کے ہاتھوں اس کا محتاج ہوتا ہے اور اولاد بھی اسی شہوت کا نتیجہ ہے جو اسے بیوی کے پاس جانے پر مجبور کرتی ہے، تو پھر شان کیا بلند رہی۔ (طبری)"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {وَ اَنَّهٗ كَانَ يَقُوْلُ سَفِيْهُنَا … : ’’ سَفِيْهُنَا ‘‘} ( ہمارا بے وقوف) سے مراد د ایک فرد بھی ہو سکتا ہے اور ایک گروہ بھی۔ فرد ہو تو ابلیس یا ان جنوں کا سردار مراد ہے۔ گروہ ہو تو مطلب یہ ہے کہ ہم میں سے کئی بے وقوف اور احمق لوگ اللہ تعالیٰ پر ایسی زیادتی کی باتیں تھوپا کرتے تھے کہ اس کا کوئی شریک ہے یا اس کی اولاد اور بیوی ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {وَ اَنَّا ظَنَنَّاۤ اَنْ لَّنْ تَقُوْلَ الْاِنْسُ وَ الْجِنُّ … :} یعنی ہم یہی سمجھتے تھے کہ انسان اور جن کم از کم اللہ پر تو ہر گز جھوٹ نہیں باندھ سکتے، اس لیے ہم نے ان سے سن کر مان لیا کہ اللہ کے کچھ شریک ہیں اور اس کی اولاد اور بیوی بھی ہے۔ اب معلوم ہوا کہ یہ ظالم جھوٹے تھے۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {وَ اَنَّهٗ كَانَ رِجَالٌ مِّنَ الْاِنْسِ … :} عرب کے بعض مشرک جب کسی خوفناک جگہ یعنی جنگل وغیرہ میں جاتے تو کہتے کہ ہم اس علاقے میں جو جنوں کا سردار ہے، اس کی پناہ میں آتے ہیں۔ اس سے جنوں کی سرکشی اور بڑھ گئی، کیونکہ وہ جان گئے کہ انسان ہم سے ڈرتے ہیں، اس لیے انھوں نے اپنے ماننے والوں کو اور زیادہ ڈرانا شروع کر دیا۔ معلوم ہوا آدمی کو نہ جنوں سے ڈرنا چاہیے، نہ ان کی پناہ مانگنی چاہیے اور نہ کسی غیر اللہ کی دہائی دینی چاہیے، کیونکہ یہ شرک ہے، بلکہ صرف اور صرف اللہ کی پناہ مانگنی چاہیے۔ کسی بھی چیز کے شر سے پناہ مانگنے کے لیے قرآن مجید کی آخری دو سورتوں جیسی کوئی چیز نہیں۔ مزید وضاحت کے لیے ان دو سورتوں کی تفسیر دیکھیں۔ ¤ خولہ بنت حکیم رضی اللہ عنھا نے فرمایا کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ فرما رہے تھے : [ إِذَا نَزَلَ أَحَدُكُمْ مَنْزِلًا فَلْيَقُلْ أَعُوْذُ بِكَلِمَاتِ اللّٰهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ، فَإِنَّهُ لَا يَضُرُّهُ شَيْءٌ حَتّٰی يَرْتَحِلَ مِنْهُ ] [ ممسلم، الذکر و الدعاء، باب في التعوذ من سوء القضاء… : ۵۵ /۲۷۰۸ ] ’’جب تم میں سے کوئی شخص کسی منزل میں اترے تو اسے یہ کلمات کہنے چاہییں، تو اسے وہاں سے کوچ کرنے تک کوئی چیز نقصان نہیں پہنچائے گی : [ أَعُوْذُ بِكَلِمَاتِ اللّٰهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ] ’’میں اللہ کے کامل کلمات کی پناہ پکڑتا ہوں ہر اس چیز کے شر سے جو اس نے پیداا کی۔‘‘"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) { وَ اَنَّهُمْ ظَنُّوْا كَمَا ظَنَنْتُمْ … :} جن اپنی قوم کے لوگوں کو کافر انسانوں کے متعلق بتا رہے ہیں کہ شرک کے علاوہ ان انسانوں کا عقیدہ تمھاری طرح یہ بھی تھا کہ اللہ تعالیٰ کسی کو قیامت کے دن دوبارہ نہیں اٹھائے گا۔ یہ معنی بھی ہو سکتا ہے کہ ان کا عقیدہ یہ بھی تھا کہ اللہ تعالیٰ کسی کو ( نبی بنا کر) نہیں بھیجے گا۔ کفار میں ہمیشہ، خواہ وہ انسان ہوں یا جن، توحید، آخرت اور رسالت تینوں کا انکار پایا جاتا رہا ہے۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 9،8) ➊ { وَ اَنَّا لَمَسْنَا السَّمَآءَ فَوَجَدْنٰهَا مُلِئَتْ …:} اللہ تعالیٰ نے ستاروں کو آسمان کی زینت کے علاوہ ان شیاطین سے حفاظت کا ذریعہ بھی بنایا ہے جو آسمان کے قریب جا کر فرشتوں کی باتیں سننے کی کوشش کرتے ہیں۔ ان کو ہٹانے کے لیے ہر طرف سے ان پر شہابوں(انگاروں) کی بارش ہوتی ہے۔ (دیکھیے صافات : ۶ تا ۱۰) عائشہ رضی اللہ عنھا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ الْمَلاَئِكَةَ تَنْزِلُ فِي الْعَنَانِ وَهُوَ السَّحَابُ فَتَذْكُرُ الْأَمْرَ ققُضِيَ فِي السَّمَاءِ، فَتَسْتَرِقُ الشَّيَاطِيْنُ السَّمْعَ، فَتَسْمَعُهُ فَتُوْحِيْهِ إِلَی الْكُهَّانِ،، فَيَكْذِبُوْنَ مَعَهَا مِائَةَ كَذْبَةٍ مِّنْ عِنْدِ أَنْفُسِهِمْ ] [ بخاري، بدء الخلق، باب ذکر الملائکۃ صلوات اللّٰہ علیھم : ۳۲۱۰ ] ’’فرشتے عنان یعنی بادل میں اترتے ہیں اور (آپس میں) اس بات کا ذکر کرتے ہیں جس کا آسمان میں فیصلہ کیا گیا ہوتا ہے، تو شیطان چوری سے وہ بات سننے کی کوشش کرتے ہیں اور اسے سن لیتے ہیں، پھر وہ یہ بات کاہنوں کو چپکے سے پہنچا دیتے ہیں، پھر کاہن اس میں اپنی طرف سے سو جھوٹ ملا دیتے ہیں۔‘‘ ¤ ➋ {مُلِئَتْ حَرَسًا شَدِيْدًا وَّ شُهُبًا :} رسول اللہ صلی اللہ علیہ وسلم کی بعثت سے پہلے بھی عالم بالا کی حفاظت کا انتظام تھا، مگر جن کوئی نہ کوئی بات سن لیتے تھے اور انھیں بالائی فضا میں چھپ کر بیٹھنے کی بھی کوئی نہ کوئی جگہ مل جاتی تھی، اب ( آپ صلی اللہ علیہ وسلم کی بعثت کے بعد) جب وہ سننے کے لیے اوپر گئے تو ساری بالائی فضا سخت پہرے اور مسلسل شہابوں کی بارش سے بھری ہوئی تھی۔ {’’ مُلِئَتْ ‘‘} سے معلوم ہو رہا ہے کہ اب پہرے کا نظام پہلے سے بہت سخت ہو گیا تھا۔ اس سے انھیں پریشانی ہوئی اور وہ تلاش میں نکلے کہ اس بندوبست کا باعث کیا ہے؟ جیسا کہ اس سورت کی شان نزول میں گزر چکا ہے۔ ¤ ➌ قرآن مجید کی بہت سی آیات سے معلوم ہوتا ہے کہ جن انسانوں سے الگ مخلوق ہیں جو مٹی سے نہیں بلکہ آگ سے پیدا کیے گئے ہیں اور جو انسان کی پیدائش سے پہلے موجود تھے۔ جن آسمان کے قریب جا سکتے ہیں اور بعض اوقات عالم بالا کی ایک آدھ بات چرا سکتے ہیں، انھیں انسانوں ہی میں سے سرکش قوم یا چھپے ہوئے جراثیم قرار دے کر ان کا انکار کر دینا قرآن و حدیث کا انکار ہے۔ کسی چیز کے انکار کی یہ بنیاد کہ اگر وہ موجود ہوتی تو نظر آتی، بے حد کمزور بنیاد ہے۔ مزید دیکھیے سورۂ اعراف (38،27)، ہود (۱۱۹)، حم سجدہ (۲۵، ۲۹) اور سورۂ احقاف (۱۸، ۲۹، ۳۲)۔ آدم اور ابلیس کا قصہ جو قرآن مجید میں سات مقامات پر بیان ہوا ہے اور سورۂ رحمان پوری اس بات کی شاہد ہے کہ جن اور انسان الگ الگ مخلوق ہیں۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9،8) ➊ { وَ اَنَّا لَمَسْنَا السَّمَآءَ فَوَجَدْنٰهَا مُلِئَتْ …:} اللہ تعالیٰ نے ستاروں کو آسمان کی زینت کے علاوہ ان شیاطین سے حفاظت کا ذریعہ بھی بنایا ہے جو آسمان کے قریب جا کر فرشتوں کی باتیں سننے کی کوشش کرتے ہیں۔ ان کو ہٹانے کے لیے ہر طرف سے ان پر شہابوں(انگاروں) کی بارش ہوتی ہے۔ (دیکھیے صافات : ۶ تا ۱۰) عائشہ رضی اللہ عنھا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ إِنَّ الْمَلاَئِكَةَ تَنْزِلُ فِي الْعَنَانِ وَهُوَ السَّحَابُ فَتَذْكُرُ الْأَمْرَ ققُضِيَ فِي السَّمَاءِ، فَتَسْتَرِقُ الشَّيَاطِيْنُ السَّمْعَ، فَتَسْمَعُهُ فَتُوْحِيْهِ إِلَی الْكُهَّانِ،، فَيَكْذِبُوْنَ مَعَهَا مِائَةَ كَذْبَةٍ مِّنْ عِنْدِ أَنْفُسِهِمْ ] [ بخاري، بدء الخلق، باب ذکر الملائکۃ صلوات اللّٰہ علیھم : ۳۲۱۰ ] ’’فرشتے عنان یعنی بادل میں اترتے ہیں اور (آپس میں) اس بات کا ذکر کرتے ہیں جس کا آسمان میں فیصلہ کیا گیا ہوتا ہے، تو شیطان چوری سے وہ بات سننے کی کوشش کرتے ہیں اور اسے سن لیتے ہیں، پھر وہ یہ بات کاہنوں کو چپکے سے پہنچا دیتے ہیں، پھر کاہن اس میں اپنی طرف سے سو جھوٹ ملا دیتے ہیں۔‘‘ ¤ ➋ {مُلِئَتْ حَرَسًا شَدِيْدًا وَّ شُهُبًا :} رسول اللہ صلی اللہ علیہ وسلم کی بعثت سے پہلے بھی عالم بالا کی حفاظت کا انتظام تھا، مگر جن کوئی نہ کوئی بات سن لیتے تھے اور انھیں بالائی فضا میں چھپ کر بیٹھنے کی بھی کوئی نہ کوئی جگہ مل جاتی تھی، اب ( آپ صلی اللہ علیہ وسلم کی بعثت کے بعد) جب وہ سننے کے لیے اوپر گئے تو ساری بالائی فضا سخت پہرے اور مسلسل شہابوں کی بارش سے بھری ہوئی تھی۔ {’’ مُلِئَتْ ‘‘} سے معلوم ہو رہا ہے کہ اب پہرے کا نظام پہلے سے بہت سخت ہو گیا تھا۔ اس سے انھیں پریشانی ہوئی اور وہ تلاش میں نکلے کہ اس بندوبست کا باعث کیا ہے؟ جیسا کہ اس سورت کی شان نزول میں گزر چکا ہے۔ ¤ ➌ قرآن مجید کی بہت سی آیات سے معلوم ہوتا ہے کہ جن انسانوں سے الگ مخلوق ہیں جو مٹی سے نہیں بلکہ آگ سے پیدا کیے گئے ہیں اور جو انسان کی پیدائش سے پہلے موجود تھے۔ جن آسمان کے قریب جا سکتے ہیں اور بعض اوقات عالم بالا کی ایک آدھ بات چرا سکتے ہیں، انھیں انسانوں ہی میں سے سرکش قوم یا چھپے ہوئے جراثیم قرار دے کر ان کا انکار کر دینا قرآن و حدیث کا انکار ہے۔ کسی چیز کے انکار کی یہ بنیاد کہ اگر وہ موجود ہوتی تو نظر آتی، بے حد کمزور بنیاد ہے۔ مزید دیکھیے سورۂ اعراف (38،27)، ہود (۱۱۹)، حم سجدہ (۲۵، ۲۹) اور سورۂ احقاف (۱۸، ۲۹، ۳۲)۔ آدم اور ابلیس کا قصہ جو قرآن مجید میں سات مقامات پر بیان ہوا ہے اور سورۂ رحمان پوری اس بات کی شاہد ہے کہ جن اور انسان الگ الگ مخلوق ہیں۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {وَ اَنَّا لَا نَدْرِيْۤ اَشَرٌّ اُرِيْدَ … :} اتنے سخت پہرے دیکھ کر جنوں نے سمجھ لیا کہ دو باتوں میں سے ایک ضرور ہے، یا تو اہل زمین کے ساتھ شر کا ارادہ کیا گیا ہے، یعنی کسی قوم پر اچانک عذاب آنے کا فیصلہ ہو چکا ہے اور خبروں پر پہرا لگ گیا ہے، تاکہ اس قوم کو وقت سے پہلے اطلاع نہ ہوجائے، یا اللہ تعالیٰ نے ان کی بھلائی اور ہدایت کا ارادہ کیا ہے، یعنی کوئی رسول مبعوث ہوا ہے جس کی طرف بھیجی جانے والی وحی کی حفاظت کے لیے یہ انتظام کیا گیا ہے، تاکہ شیطان نہ اس میں کوئی دخل دے سکیں اور نہ پہلے معلوم کرسکیں کہ پیغمبر کی طرف کیا وحی کی جا رہی ہے۔ جب وہ اس جستجو کے لیے نکلے کہ ان دو باتوں میں سے کون سی بات حق ہے تو انھیں رسول اللہ صلی اللہ علیہ وسلم کو قرآن پڑھتے ہوئے سن کر معلوم ہو گیا کہ یہ بندوبست اسی رسول کی وجہ سے ہے۔ اس آیت میں جنوں کے اس گروہ کا حسنِ ادب ملاحظہ ہو کہ ارادۂ رشد کی نسبت اللہ تعالیٰ کی طرف کی ہے اور ارادۂ شر کی نسبت اس کی طرف نہیں کی۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) { وَ اَنَّا مِنَّا الصّٰلِحُوْنَ وَ مِنَّا دُوْنَ ذٰلِكَ …:’’ طَرَآىِٕقَ ‘‘ ’’ طَرِيْقَةٌ ‘‘} کی جمع اور {’’ قِدَدًا ‘‘ ’’ قِدَّةٌ ‘‘} بروزن {’’قِطْعَةٌ‘‘} کی جمع ہے، ٹکڑے۔ اس آیت سے معلوم ہوا کہ جنوں میں صالح اور غیر صالح ہر قسم کے لوگ پائے جاتے ہیں۔ ان میں اچھے عقائد، اچھے اعمال اور اچھے اخلاق کے لوگ بھی ہیں اور اس کے برعکس بھی، ان میں موحد بھی ہیں اور مشرک بھی، متبع سنت بھی ہیں اور بدعتی بھی، خوش اخلاق بھی ہیں اور بد اخلاق بھی، وہ بھی ہیں جو آسمان سے کوئی خبر سن کر اس میں سو جھوٹ ملاتے ہیں اور وہ بھی ہیں جو ایسا نہیں کرتے۔ مومن جنوں کا اپنی قوم کے لوگوں کو یہ بات کہنے کا مقصد یہ ہے کہ ہم سب کے سب راہِ راست پر نہیں بلکہ ہم میں بھی غیر صالح لوگ موجود ہیں، جنھیں حق بات سمجھانا اور ان کا اسے قبول کرنا ضروری ہے۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 13،12) {وَ اَنَّا ظَنَنَّاۤ اَنْ لَّنْ نُّعْجِزَ اللّٰهَ … :} مشرک قومیں جنوں کو خدائی اختیارات کا مالک سمجھتی ہیں اور انھیں غیب دان جانتی ہیں مگر جن خود اقرار کر رہے ہیں کہ ہم نے سمجھ لیا کہ اگر اللہ تعالیٰ ہمیں پکڑنا چاہے تو نہ ہم زمین میں کہیں چھپ کر اسے عاجز کرسکتے ہیں کہ وہ ہمیں پکڑ نہ سکے اور نہ کہیں بھاگ کر، غرض پھر کسی صورت ہم اس سے بچ نہیں سکتے۔ اللہ تعالیٰ کے سامنے بالکل بے بس ہونے کے اسی عقیدے کا نتیجہ ہے کہ جونہی ہم نے ہدایت کی بات سنی تو فوراً ایمان لے آئے۔ {’’ بَخْسًا وَّ لَا رَهَقًا ‘‘} نقصان یہ کہ جو نیکیاں کی ہیں ان میں کمی کر دی جائے اور زیادتی یہ کہ جو گناہ نہیں کیے وہ تھوپ دیے جائیں۔ ان آیات میں بھی مومن جن اپنے بھائیوں کو نصیحت کر رہے ہیں کہ جس ذات عالی سے نہ بھاگ سکتے ہو اور نہ چھپ سکتے ہو اس پر ایمان لے آؤ، اسی میں تمھاری خیریت ہے، پھر وہ ایسا مہربان ہے کہ جو اس پر ایمان لے آئے اسے نہ نقصان کا خوف ہے نہ زیادتی کا۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13،12) {وَ اَنَّا ظَنَنَّاۤ اَنْ لَّنْ نُّعْجِزَ اللّٰهَ … :} مشرک قومیں جنوں کو خدائی اختیارات کا مالک سمجھتی ہیں اور انھیں غیب دان جانتی ہیں مگر جن خود اقرار کر رہے ہیں کہ ہم نے سمجھ لیا کہ اگر اللہ تعالیٰ ہمیں پکڑنا چاہے تو نہ ہم زمین میں کہیں چھپ کر اسے عاجز کرسکتے ہیں کہ وہ ہمیں پکڑ نہ سکے اور نہ کہیں بھاگ کر، غرض پھر کسی صورت ہم اس سے بچ نہیں سکتے۔ اللہ تعالیٰ کے سامنے بالکل بے بس ہونے کے اسی عقیدے کا نتیجہ ہے کہ جونہی ہم نے ہدایت کی بات سنی تو فوراً ایمان لے آئے۔ {’’ بَخْسًا وَّ لَا رَهَقًا ‘‘} نقصان یہ کہ جو نیکیاں کی ہیں ان میں کمی کر دی جائے اور زیادتی یہ کہ جو گناہ نہیں کیے وہ تھوپ دیے جائیں۔ ان آیات میں بھی مومن جن اپنے بھائیوں کو نصیحت کر رہے ہیں کہ جس ذات عالی سے نہ بھاگ سکتے ہو اور نہ چھپ سکتے ہو اس پر ایمان لے آؤ، اسی میں تمھاری خیریت ہے، پھر وہ ایسا مہربان ہے کہ جو اس پر ایمان لے آئے اسے نہ نقصان کا خوف ہے نہ زیادتی کا۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 15،14) ➊ {وَ اَنَّا مِنَّا الْمُسْلِمُوْنَ وَ مِنَّا الْقٰسِطُوْنَ … : ’’ الْقٰسِطُوْنَ ‘‘} ظلم کرنے والے، راہِ حق سے ہٹنے والے۔ {’’قَسَطَ يَقْسِطُ‘‘} (ض) {’’قَسْطًا‘‘} ( قاف کے فتحہ کے ساتھ) ظلم کرنا، سیدھی راہ سے ہٹنا۔{’’ اَلْقِسْطُ‘‘} (قاف کے کسرہ کے ساتھ) انصاف۔ {’’أَقْسَطَ يُقْسِطُ‘‘} (افعال) انصاف کرنا۔ یعنی ہدایت سننے کے بعد ہم میں سے کچھ وہ ہیں جو تابع فرمان ہو گئے۔ یہ وہ ہیں جن کا ارادہ ہے کہ پوری کوشش کے ساتھ سیدھی راہ پر چلیں۔ {’’تَحَرّٰي يَتَحَرّٰي تَحَرِّيًا‘‘} قصد کرنا، کوشش کے ساتھ ظن سے یقین تک پہنچنا۔ اور جو راہ حق سے ہٹے ہوئے ہیں وہ جہنم کا ایندھن بنیں گے۔ ¤ ➋ یہاں سوال پیدا ہوتا ہے کہ جن آگ سے پیدا کیے گئے ہیں، وہ جہنم کا ایندھن کیسے بنیں گے؟ جواب یہ ہے کہ جس طرح انسان مٹی سے بنا ہے مگر مٹی کا ڈھیلا مارا جائے تو اسے تکلیف ہوتی ہے اور ہر زندہ چیز پانی سے پیدا ہوئی ہے، جیسے اللہ تعالیٰ نے فرمایا: « وَ جَعَلْنَا مِنَ الْمَآءِ كُلَّ شَيْءٍ حَيٍّ » [ الأنبیاء : ۳۰ ] (اور ہم نے پانی سے ہر زندہ چیز بنائی) مگر یہی پانی اسے غرق کر دیتا ہے۔ پانی آگ کو بجھا دیتا ہے، مگر یہی پانی جنوں کے لیے جو آگ سے بنے ہیں نعمت ہے، جیساکہ سورۂ رحمن کی آیات(۵۰، ۶۶) میں ہے اور اسی سورۂ جن کی آیت (۱۶) میں آرہا ہے۔ اصل یہ ہے کہ آگ سے پیدا کیے جانے کے باوجود جنوں کی ایک الگ شکل و صورت ہے جو آگ سے متاثر ہوتی ہے، جس طرح گوشت پوست کا انسان مٹی سے پیدا ہونے کے باوجود مٹی سے الگ شکل و صورت رکھتا ہے۔ یہاں سے جنوں کی تقریر جو اللہ تعالیٰ نے نقل فرمائی ہے ختم ہوئی، آئندہ آیات میں دوبارہ اللہ تعالیٰ کا خطاب شروع ہوتا ہے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 15،14) ➊ {وَ اَنَّا مِنَّا الْمُسْلِمُوْنَ وَ مِنَّا الْقٰسِطُوْنَ … : ’’ الْقٰسِطُوْنَ ‘‘} ظلم کرنے والے، راہِ حق سے ہٹنے والے۔ {’’قَسَطَ يَقْسِطُ‘‘} (ض) {’’قَسْطًا‘‘} ( قاف کے فتحہ کے ساتھ) ظلم کرنا، سیدھی راہ سے ہٹنا۔{’’ اَلْقِسْطُ‘‘} (قاف کے کسرہ کے ساتھ) انصاف۔ {’’أَقْسَطَ يُقْسِطُ‘‘} (افعال) انصاف کرنا۔ یعنی ہدایت سننے کے بعد ہم میں سے کچھ وہ ہیں جو تابع فرمان ہو گئے۔ یہ وہ ہیں جن کا ارادہ ہے کہ پوری کوشش کے ساتھ سیدھی راہ پر چلیں۔ {’’تَحَرّٰي يَتَحَرّٰي تَحَرِّيًا‘‘} قصد کرنا، کوشش کے ساتھ ظن سے یقین تک پہنچنا۔ اور جو راہ حق سے ہٹے ہوئے ہیں وہ جہنم کا ایندھن بنیں گے۔ ¤ ➋ یہاں سوال پیدا ہوتا ہے کہ جن آگ سے پیدا کیے گئے ہیں، وہ جہنم کا ایندھن کیسے بنیں گے؟ جواب یہ ہے کہ جس طرح انسان مٹی سے بنا ہے مگر مٹی کا ڈھیلا مارا جائے تو اسے تکلیف ہوتی ہے اور ہر زندہ چیز پانی سے پیدا ہوئی ہے، جیسے اللہ تعالیٰ نے فرمایا: « وَ جَعَلْنَا مِنَ الْمَآءِ كُلَّ شَيْءٍ حَيٍّ » [ الأنبیاء : ۳۰ ] (اور ہم نے پانی سے ہر زندہ چیز بنائی) مگر یہی پانی اسے غرق کر دیتا ہے۔ پانی آگ کو بجھا دیتا ہے، مگر یہی پانی جنوں کے لیے جو آگ سے بنے ہیں نعمت ہے، جیساکہ سورۂ رحمن کی آیات(۵۰، ۶۶) میں ہے اور اسی سورۂ جن کی آیت (۱۶) میں آرہا ہے۔ اصل یہ ہے کہ آگ سے پیدا کیے جانے کے باوجود جنوں کی ایک الگ شکل و صورت ہے جو آگ سے متاثر ہوتی ہے، جس طرح گوشت پوست کا انسان مٹی سے پیدا ہونے کے باوجود مٹی سے الگ شکل و صورت رکھتا ہے۔ یہاں سے جنوں کی تقریر جو اللہ تعالیٰ نے نقل فرمائی ہے ختم ہوئی، آئندہ آیات میں دوبارہ اللہ تعالیٰ کا خطاب شروع ہوتا ہے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16) { وَ اَنْ لَّوِ اسْتَقَامُوْا عَلَى الطَّرِيْقَةِ … :} اس کا عطف {’’ اَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ …‘‘} پر ہے اور {’’ وَ اَنْ لَّوِ  اسْتَقَامُوْا ‘‘} کا اصل {’’وَ أَنَّهُمْ لَوِاسْتَقَامُوْا‘‘} ہے، یعنی کہہ دے میری طرف وحی کی گئی ہے کہ جنوں کی ایک جماعت نے قرآن سنا… اور میری طرف یہ وحی کی گئی ہے کہ اگر یہ لوگ (یعنی قریش مکہ یا تمام بنی آدم اور جن) اصل راستے پر سیدھے چلتے رہتے تو ہم انھیں وافر پانی پلاتے۔ {’’ غَدَقًا ‘‘} کا معنی کثیر ہے۔ وافرپانی سے مراد وافر رزق ہے، کیونکہ زمین سے حاصل ہونے والی تمام برکات بارش ہی سے حاصل ہوتی ہیں۔ یہ وہی بات ہے جو اللہ تعالیٰ نے ایک اور مقام پر بیان فرمائی ہے : « وَ لَوْ اَنَّ اَهْلَ الْقُرٰۤى اٰمَنُوْا وَ اتَّقَوْا لَفَتَحْنَا عَلَيْهِمْ بَرَكٰتٍ مِّنَ السَّمَآءِ وَ الْاَرْضِ» [ الأعراف : ۹۶ ] ’’اور اگر ان بستیوں والے ایمان لے آتے اور تقویٰ اختیار کرتے تو ہم ان پر آسمان اور زمین سے برکات کھول دیتے۔‘‘ سورۂ نوح (۱۰ تا ۱۲) اور سورۂ مائدہ (۶۶) میں بھی یہی بات بیا ن ہوئی ہے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 17) {لِنَفْتِنَهُمْ فِيْهِ وَ مَنْ يُّعْرِضْ … :} یعنی پانی کی کثرت اور رزق کی فراوانی کا مقصد بھی ان کی آزمائش ہے کہ وہ خوش حال میں اللہ کا شکر ادا کرتے اور اس کی توحید و اطاعت پر قائم رہتے ہیں یا بد مست ہو کر سرکشی پر اتر آتے ہیں۔ معلوم ہوا مصیبت کی طرح نعمت بھی اللہ کی طرف سے آزمائش ہے۔سورۂ انبیاء (۳۵)، اعراف (۱۶۸) اور سورۂ قلم (۱۷تا ۲۰) میں بھی یہ مضمون بیان ہوا ہے۔ {’’ صَعَدًا ‘‘ ’’صَعِدَ يَصْعَدُ‘‘} (ع) کا مصدر ہے۔ لفظی معنی چڑھائی ہے، مراد ایسا سخت عذاب ہے جو دم بدم بڑھتا ہی جائے گا۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18) {وَ اَنَّ الْمَسٰجِدَ لِلّٰهِ … : ’’ الْمَسٰجِدَ ‘‘ ’’مَسْجِدٌ‘‘} کی جمع ہے، اس کا معنی سجدے بھی ہے (مصدر میمی) اور وہ جگہیں بھی جہاں سجدے کیے جاتے ہیں، یعنی مسجدیں اور وہ جگہیں یعنی اعضا بھی جن پر سجدہ ہوتا ہے، یعنی پیشانی، ہاتھ پاؤں اور گھٹنے ( ان دونوں معنوں کی صورت میں یہ ظرف ہے)۔ مطلب یہ ہے کہ سب سجدے بھی اللہ کے لیے ہیں، مسجدیں بھی اور اعضائے سجدہ بھی، تو پھر پکارنا بھی صرف اسی کا حق ہے، اس کے ساتھ کسی دوسرے کو مت پکارو۔ {’’ الْمَسٰجِدَ ‘‘} کا لفظ اتنا عام ہے کہ اس سے مراد صرف وہی جگہیں نہیں جو عبادت کے لیے تعمیر کی گئی ہیں بلکہ اس میں زمین کا ہر قطعہ شامل ہے، کیونکہ اس امت کے لیے ساری زمین ہی مسجد ہے۔ ¤ اس آیت سے معلوم ہوا کہ اللہ کے علاوہ کسی دوسرے کو پکارنا منع ہے۔ بعض لوگ جو مصیبت یا بیماری میں ’’یا اللہ‘‘ کے ساتھ ’’یا رسول اللہ‘‘، ’’یا علی‘‘، ’’یا حسین‘‘ اور ’’یا شیخ عبدالقادر‘‘ وغیرہ کہتے اور ان کو مدد کے لیے پکارتے ہیں ان کا یہ فعل درست نہیں۔ غیر اللہ کو پکارنے کی ممانعت کے لیے ملاحظہ فرمائیں سورۂ یونس ( ۱۰۶)، رعد( ۱۴)، نحل (21،20)، حج (۶۲، ۷۳، ۷۴)، مومنون (۱۱۷)، شعراء ( ۲۱۳) ، قصص (۸۸)، سبا ( ۲۲)، فاطر (۱۳، ۱۴) اور سورۂ احقاف ( ۵)۔ اس کی وجہ یہ ہے کہ پکارنا ہی اصل عبادت ہے اور اللہ کے علاوہ کسی کی عبادت جائز نہیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلدُّعَاءُ هُوَ الْعِبَادَةُ ] ’’پکارنا ہی عبادت ہے۔‘‘ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی : « وَ قَالَ رَبُّكُمُ ادْعُوْنِيْۤ اَسْتَجِبْ لَكُمْ اِنَّ الَّذِيْنَ يَسْتَكْبِرُوْنَ۠ عَنْ عِبَادَتِيْ سَيَدْخُلُوْنَ جَهَنَّمَ دٰخِرِيْنَ » [ المؤمن : ۶۰ ] ’’اور تمھارے رب نے فرمایا مجھے پکارو، میں تمھاری دعا قبول کروں گا۔ بے شک وہ لوگ جو میری عبادت سے تکبر کرتے ہیں عنقریب ذلیل ہو کر جہنم میں داخل ہوں گے۔‘‘ [ ترمذي، تفسیر القرآن، باب ومن سورۃ المؤمن : ۳۲۴۷، وصححہ في أبواب الدعوات، باب ما جاء في فضل الدعاء ]"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) {وَ اَنَّهٗ لَمَّا قَامَ عَبْدُ اللّٰهِ … :} مشرکین نہ صرف یہ کہ غیر اللہ کی عبادت کرتے تھے بلکہ ان کے لیے اکیلے اللہ تعالیٰ کی عبادت کرنا اس قدر باعث تعجب اور تکلیف دہ تھا کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز کے لیے یا توحید کی دعوت کے لیے کھڑے ہوتے اور صرف ایک اللہ ہی کو پکارتے تو مشرکین اظہار تعجب کے لیے اور آپ کو پریشان کرنے کے لیے گروہ در گروہ آپ کے ارد گرد جمع ہو جاتے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {قُلْ اِنَّمَاۤ اَدْعُوْا رَبِّيْ … :} یعنی تمھیں جتنا بھی ناگوار ہو اور تم روکنے کے لیے جتنے بھی جمع ہو جاؤ، میں تو صرف اپنے رب ہی کو پکاروں گا، اس کے ساتھ کسی کو شریک نہیں کروں گا ۔ندائے غیر اللہ کی حرمت کی آیات کے لیے دیکھیں گزشتہ آیت (۱۸) کی تفسیر۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) { قُلْ اِنِّيْ لَاۤ اَمْلِكُ لَكُمْ … :} اس آیت میں اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو صاف اعلان کرنے کا حکم دیا کہ آپ صلی اللہ علیہ وسلم دوسروں کے لیے نہ نفع کے مالک ہیں نہ نقصان کے اور نہ ہی ہدایت اور گمراہی کا اختیار رکھتے ہیں۔ {’’ ضَرًّا ‘‘} کے مقابلے میں {’’نَفْعًا‘‘} اور {’’ رَشَدًا ‘‘} کے مقابلے میں {’’غَيًّا‘‘} حذف کر دیا ہے، کیونکہ وہ الفاظ خود بخود معلوم ہو رہے ہیں۔ ¤ ایک اور مقام پر یہ اعلان کرنے کا حکم دیا کہ آپ صلی اللہ علیہ وسلم خود اپنے نفع یا نقصان کا بھی اختیار نہیں رکھتے۔ (دیکھیے اعراف : ۱۸۸) اور کئی مقامات پر واضح فرمایا کہ اللہ کے علاوہ جن لوگوں کو بھی پکارا جاتا ہے وہ ذرہ برابر چیز کا بھی اختیار نہیں رکھتے۔ (مثلاً دیکھیے سبا :۲۲۔ فاطر :۱۳) اتنی صراحت کے بعد بھی کوئی شخص اللہ تعالیٰ کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کو یا دوسرے انبیاء و اولیاء کو اپنے نفع و نقصان کا مالک سمجھے تو اسے خود ہی سوچنا چاہیے کہ اس نے اللہ تعالیٰ کی اور اس کے فرمان کی کیا قدر کی۔"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22) { قُلْ اِنِّيْ لَنْ يُّجِيْرَنِيْ مِنَ اللّٰهِ اَحَدٌ … :} یعنی آپ انھیں کہہ دیں کہ اگر میں اللہ کے ساتھ کسی اور کو پکاروں یا اس کی نافرمانی کروں تو اللہ کی گرفت سے مجھے کوئی نہیں بچا سکے گا اور نہ مجھے اس کے علاوہ کوئی جائے پناہ مل سکے گی، تو تم اس کی گرفت سے کیسے بچ سکو گے اور کس کی پناہ میں جاؤ گے؟"
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) { اِلَّا بَلٰغًا مِّنَ اللّٰهِ وَ رِسٰلٰتِهٖ … :} یہ {’’ لَاۤ اَمْلِكُ لَكُمْ ضَرًّا وَّ لَا رَشَدًا ‘‘} سے استثنا ہے اور درمیان والی آیت پہلی آیت ہی کی مزید وضاحت ہے، یعنی میں تو صرف اللہ کے احکام پہنچانے کا اور اس کے پیغامات کا اختیار رکھتا ہوں، میرا کام بس اتنا ہی ہے، پیغام پہنچ جانے کے بعد جو اللہ اور اس کے رسول کی نافرمانی کرے گا اس کے لیے جہنم کی آگ ہے جس میں وہ ہمیشہ رہے گا ۔ نافرمانی سے مراد اس جگہ اللہ تعالیٰ کی توحید پر ایمان نہ لانا ہے، کیونکہ پچھلی آیات میں یہی مضمون آرہا ہے۔ ابدی جہنمی صرف کفار ہیں، یہ مطلب نہیں کہ ہر گناہ اور نافرمانی کی سزا ہمیشہ کے لیے جہنم میں رہنا ہے۔"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) {حَتّٰۤى اِذَا رَاَوْا مَا يُوْعَدُوْنَ … :} یعنی کفار اپنی تعداد کی کثرت اور اپنے مددگاروں کی قوت پر فخر اور مسلمانوں کی قلت تعداد اور کمزوری پر طعن کرتے ہیں تو کرتے رہیں، یہ سب کچھ تھوڑے وقت کے لیے ہے، یہاں تک کہ جب یہ لوگ وہ چیز ( اپنی آنکھوں سے ) دیکھ لیں گے جس کا ان سے وعدہ کیا جاتا ہے تو اس وقت انھیں معلوم ہو گا کہ مدد گاروں کے لحاظ سے کمزور اور تعداد میں کم کون ہے؟ وہ چیز جس کا ان سے وعدہ کیا جاتا ہے اس سے مراد اسلام کا غلبہ اور کفار کی شکست بھی ہے، جیسا کہ بدر، خندق، فتح مکہ اور حنین میں انھوں نے اپنی آنکھوں سے دیکھ لیا، کفار پر خوف اور قحط کا مسلط ہونا بھی ہے اور مرتے وقت فرشتوں کا ان کے مونہوں اور پیٹھوں پر مارنا بھی، قبر کا عذاب بھی ہے، قیامت کی ہولناکی اور جہنم کی آگ بھی۔ درجہ بدرجہ یہ سب کچھ دیکھتے جانے کے ساتھ ہی ان پر اپنی تعداد کی کثرت اور حمایتیوں کی قوت کی حقیقت کھلتی جائے گی۔"
    },
    {
      "ayah": 25,
      "tafsir": "(آیت 25) {قُلْ اِنْ اَدْرِيْۤ اَقَرِيْبٌ … :} یعنی یہ لو گ جو جلدی مچاتے اور پوچھتے ہیں کہ اسلام کا وہ غلبہ،کفار پر عذاب اور قیامت کا معاملہ کب ہوگا؟ تو آپ ان سے کہہ دیں کہ میرا کام تمھیں آگاہ کرنا ہے، وقت بتانا میرا کام نہیں اور نہ ہی مجھے معلوم ہے کہ وہ وقت بالکل قریب آچکا ہے یا میرا رب اس کے لیے کوئی اور مدت مقرر کرتا ہے۔"
    },
    {
      "ayah": 26,
      "tafsir": "(آیت 26) {عٰلِمُ الْغَيْبِ فَلَا يُظْهِرُ …:} یعنی یہ جاننا کہ کل کیا ہوگا اور قیامت کب آئے گی غیب میں شامل ہے اور غیب جاننے والا صرف اور صرف میرا رب ہے، چنانچہ دوسری جگہ فرمایا : « اِنَّ اللّٰهَ عِنْدَهٗ عِلْمُ السَّاعَةِ وَ يُنَزِّلُ الْغَيْثَ وَ يَعْلَمُ مَا فِي الْاَرْحَامِ وَ مَا تَدْرِيْ نَفْسٌ مَّا ذَا تَكْسِبُ غَدًا وَ مَا تَدْرِيْ نَفْسٌۢ بِاَيِّ اَرْضٍ تَمُوْتُ اِنَّ اللّٰهَ عَلِيْمٌ خَبِيْرٌ » [ لقمان : ۳۴ ] ’’بے شک اللہ ہی ہے جس کے پاس قیامت کا علم ہے اور وہی بارش برساتا ہے اور وہی جانتا ہے جو کچھ ماؤں کے پیٹوں میں ہے اور کوئی شخص نہیں جانتا کہ وہ کل کیا کمائی کرے گا اور کوئی شخص نہیں جانتا کہ کس زمین میں مرے گا، بے شک اللہ سب کچھ جاننے والا، پوری خبر رکھنے والا ہے۔‘‘"
    },
    {
      "ayah": 27,
      "tafsir": "(آیت 27) {اِلَّا مَنِ ارْتَضٰى مِنْ رَّسُوْلٍ …:} ’’اپنے غیب پر کسی کو مطلع نہیں کرتا‘‘ لیکن اگر وہ اپنے غیب کی کوئی بات بتانا چاہے تو ہر ایک کو نہیں بتاتا بلکہ صرف اسی کو بتاتا ہے جسے وہ رسول کے طور پر پسند کرلے۔ {’’ رَسُوْلٍ ‘‘} کا معنی ہے وہ شخص جسے پیغام پہنچانے کے لیے بھیجا گیاہو، یعنی وہ غیب کی بات کسی کو عالم الغیب بنانے کے لیے نہیں بلکہ اسے لوگوں تک پہنچانے کے لیے بتاتا ہے۔ اللہ تعالیٰ اس چنے ہوئے رسول کو بھی جب غیب کی کسی بات کی اطلاع دیتا ہے تو اس کے چاروں طرف شہاب ثاقب اور فرشتوں کا زبردست پہرا لگا دیتا ہے، تاکہ شیطان اس وحی میں نہ اپنی کوئی بات داخل کر سکیں اور نہ وقت سے پہلے معلوم کرکے کاہنوں کو اطلاع دے سکیں، بلکہ کلام الٰہی محفوظ طریقے سے رسول تک اور رسول کے ذریعے سے لوگوں تک پہنچے۔"
    },
    {
      "ayah": 28,
      "tafsir": "(آیت 28) ➊ {لِيَعْلَمَ اَنْ قَدْ اَبْلَغُوْا …:} اس سارے انتظام کا مقصد یہ ہے کہ اللہ تعالیٰ جان لے کہ رسولوں نے اپنے رب کے پیغام پہنچا دیے ہیں اور اللہ تعالیٰ نے ہر اس چھوٹی اور بڑی چیز کا احاطہ کر رکھا ہے جو ان کے پاس ہے اور ہر ہر چیز کو گن کر شمار کر رکھا ہے۔ رسولوں کی مجال نہیں(خواہ وہ فرشتے ہوں جیسے جبریل علیہ السلام یا انسان ہوں جیسے تمام رسول علیھم السلام ) کہ اللہ کے پیغامات میں ایک لفظ کی بھی کمی بیشی کر سکیں۔ یہاں ایک سوال ہے کہ اللہ تعالیٰ تو پہلے ہی ہر چیز کا علم رکھتا ہے، پھر{’’ لِيَعْلَمَ ‘‘} (تاکہ وہ جان لے) فرمانے کا کیا مطلب ہے؟ اس کا جواب یہ ہے کہ بے شک وہ پہلے ہی سب کچھ جانتا ہے کہ اس طرح ہو گا، مگر اللہ تعالیٰ نے یہ سب انتظام اس لیے کیا ہے تاکہ رسول اپنے رب کے پیغامات پہنچا دیں اور اللہ تعالیٰ جان لے کہ انھوں نے اپنے رب کے پیغامات پہنچا دیے ہیں۔ ¤ ➋ بعض لوگ ان آیات سے استدلال کرتے ہیں کہ رسول بھی عالم الغیب ہیں، کیونکہ اللہ تعالیٰ انھیں غیب پر مطلع کرتا ہے، فرق صرف یہ ہے کہ اللہ تعالیٰ کا علم غیب ذاتی ہے اور انبیاء کا علم غیب عطائی یعنی اللہ تعالیٰ کا عطا کردہ ہے، مگر یہ بات درست نہیں، کیونکہ اللہ تعالیٰ نے صاف فرمایا ہے : « قُلْ لَّا يَعْلَمُ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ الْغَيْبَ اِلَّا اللّٰهُ» [ النمل : ۶۵ ] ’’کہہ دیجیے کہ آسمانوں میں اور زمین میں جو بھی ہے اللہ کے علاوہ غیب نہیں جانتا۔‘‘ یعنی عالم الغیب صرف اللہ تعالیٰ ہے۔ اگر وہ کسی رسول کو کوئی بات بتا دے تو اس سے وہ عالم الغیب نہیں بن جاتا، کیونکہ ایک ت تو رسولوں کو صرف اتنی بات معلوم ہوتی ہے جتنی بتائی جاتی ہے، وہ ہر بات نہیں جانتے اور یہ عالم الغیب کی شان کے خلاف ہے کہ اسے کچھ خبریں معلوم ہوں اور کچھ معلوم نہ ہوں۔ دوسرے جب کسی کو غیب کی کوئی بات بتانے سے معلوم ہو تو وہ عالم الغیب نہیں ہوتا، ورنہ ہم سب عالم الغیب ہو جائیں گے، کیونکہ اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو غیب کی جو باتیں بتائیں وہ لوگوں کو پہنچانے کے لیے بتائیں، قیامت، جنت، دوزخ اور حوض کوثر وغیرہ یہ سب غیب کی باتیں ہیں جو رسول اللہ صلی اللہ علیہ وسلم کے بتانے سے ہمیں معلوم ہیں، تو کیا ہم بھی عالم الغیب ہیں؟ ظاہر ہے ایسا نہیں، سو حق یہی ہے کہ عالم الغیب صرف اللہ تعالیٰ ہے، دوسرا کوئی عالم الغیب نہیں، نہ ذاتی نہ عطائی۔"
    }
  ]
}