{
  "surah": "At-Takwir",
  "surah_number": 81,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) {اِذَا الشَّمْسُ كُوِّرَتْ: ’’كَوْرُ الْعِمَامَةِ وَ تَكْوِيْرُهَا‘‘} پگڑی لپیٹنا۔ {’’تَكْوِيْرُ الْمَتَاعِ‘‘} سامان جمع کرکے باندھ دینا۔ (خلاصہ قاموس) {’’ كُوِّرَتْ ‘‘} یعنی اتنی وسعت والے سورج، اس کی شعاعوں اور روشنی کو لپیٹ دیا جائے گا اور وہ بالکل بے نور ہو جائے گا۔ چاند کا بھی یہی حال ہوگا، چنانچہ ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [ اَلشَّمْسُ وَالْقَمَرُ مُكَوَّرَانِ يَوْمَ الْقِيَامَةِ ] [ بخاري، بدء الخلق، باب صفۃ الشمس والقمر : ۳۲۰۰ ] ’’سورج اور چاند قیامت کے دن لپیٹ دیے جائیں گے۔‘‘"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {وَ اِذَا النُّجُوْمُ انْكَدَرَتْ : ’’ انْكَدَرَتْ ‘‘} طبری نے اس کے دو معانی نقل فرمائے ہیں، پہلا {’’تَنَاثَرَتْ‘‘} یعنی بکھر کر گر جائیں گے اور دوسرا {’’ تَغَيَّرَتْ‘‘} یعنی متغیر ہو جائیں گے۔ کدورت صفائی کی ضد ہے۔ دونوں معانی ملحوظ رکھے جائیں تو مطلب یہ ہوگا کہ ستارے بکھر کر گر جائیں گے، ان کی روشنی اور صفائی ختم ہو جائے گی اور وہ بے نور ہو جائیں گے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {وَ اِذَا الْجِبَالُ سُيِّرَتْ :} اللہ تعالیٰ نے پہاڑوں کو زمین کے اندر گاڑ رکھا ہے اور زمین میں وہ کشش رکھی ہے جو انھیں باندھ کر رکھے ہوئے ہے۔ اللہ کے حکم سے قیامت کے دن وہ کشش ختم ہو جائے گی اور یہ جامد پہاڑ دھنی ہوئی اُون کی طرح ذرّہ ذرّہ ہو کر بادلوں کی طرح چل پڑیں گے، حتیٰ کہ سراب کی طرح ہو جائیں گے، جیساکہ فرمایا : « وَ سُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا» [ النبا : ۲۰ ] ’’اور پہاڑ چلائے جائیں گے تو وہ سراب بن جائیں گے۔‘‘ مزید تفصیل کے لیے سورۂ نبا کی اسی آیت کی تفسیر دیکھیے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) {وَ اِذَا الْعِشَارُ عُطِّلَتْ:’’ الْعِشَارُ ‘‘ ’’عُشَرَاءُ‘‘} کی جمع ہے، دس ماہ کی حاملہ اونٹنیاں جو عربوں کے ہاں نہایت عزیز ہوتی تھیں۔صور پھونکے جانے کی ابتدا میں جو گھبراہٹ پیدا ہوگی اس میں اتنی نفیس اور عزیز چیزوں کو بھی کوئی نہیں سنبھالے گا، ہر ایک کو اپنی پڑی ہوگی۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {وَ اِذَا الْوُحُوْشُ حُشِرَتْ :} جنگلی جانور جو ایک دوسرے سے بھاگتے ہیں، اس گھبراہٹ میں جمع ہو جائیں گے، کوئی کسی کو کچھ نہ کہے گا۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) { وَ اِذَا الْبِحَارُ سُجِّرَتْ : ’’سَجَرَ التَّنُّوْرَ‘‘} اس نے تنور جلایا۔ {’’سَجَّرَ‘‘} میں مبالغہ ہے، خوب بھڑکایا۔ سمندروں کے بھڑکائے جانے کی ایک صورت یہ ہو سکتی ہے کہ زمین کے نیچے جو بے پناہ حرارت اور آگ ہے، جو آتش فشاں پہاڑوں کے بیدار ہونے کی صورت میں کبھی کبھی ظاہر ہوتی رہتی ہے، وہ اللہ کے حکم سے سمندروں کو بھڑکا کر انھیں بھاپ بنا کر اڑا دے گی۔ پھر پہاڑوں کی بلندی اور سمندروں کی گہرائی ختم ہوکر زمین ایک چٹیل میدان بن جائے گی۔ ایک صورت یہ بھی ہوسکتی ہے کہ پانی آکسیجن اور ہائیڈروجن دو گیسوں کا مرکب ہے، جن میں سے ایک جلانے والی اور دوسری جلنے والی ہے اور یہ اللہ تعالیٰ ہی کی عجیب قدرت ہے کہ ان دونوں کو ملا کر آگ بجھانے والا پانی بنا دیا ہے۔ قیامت کے وقت اللہ کے حکم سے ان دونوں کا ملاپ ختم ہو جائے گا اور وہ اپنے اصل کی طرف لوٹ کر بھڑکانے اور بھڑکنے لگیں گی، جس سے سمندروں کا یہ بے حساب پانی چشم زدن میں اڑ جائے گا۔ بہرحال اللہ کا حکم ہو گا تو سمندر آگ سے بھڑکنے لگیں گے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) { وَ اِذَا النُّفُوْسُ زُوِّجَتْ :} ’’اور جب جانیں ملائی جائیں گی‘‘ اس کی دو تفسیریں ہیں، پہلی یہ کہ جانیں جسموں کے ساتھ ملائی جائیں گی۔ یہاں سے دوسرے نفخہ کے بعد کے حالات ہیں، تو سب دوبارہ زندہ ہو جائیں گے۔ دوسری یہ کہ جانوں کی قسمیں بنا دی جائیں گی، نیکوں کو نیکوں کے ساتھ اور گناہ گاروں کو گناہ گاروں کے ساتھ ملا دیا جائے گا، جیسے اللہ تعالیٰ نے فرمایا: «اُحْشُرُوا الَّذِيْنَ ظَلَمُوْا وَ اَزْوَاجَهُمْ وَ مَا كَانُوْا يَعْبُدُوْنَ » [ الصافات : ۲۲ ] ’’جمع کرو ان لوگوں کو جنھوں نے ظلم کیا اور ان کے ہم شکلوں کو اور ان کو جن کی وہ عبادت کیا کرتے تھے۔‘‘ دوسری تفسیر عمر رضی اللہ عنہ نے فرمائی ہے۔ [ دیکھیے بخاري، التفسیر، باب : «إذا الشمس کورت» ، بعد ح : ۴۹۳۷ ]"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 9،8) { وَ اِذَا الْمَوْءٗدَةُ سُىِٕلَتْ … : ’’ الْمَوْءٗدَةُ ‘‘} وہ لڑکی جسے زندہ دفن کر دیا گیا ہو۔ جاہلیت میں بعض عرب عار سے بچنے کے لیے لڑکیاں زندہ دفن کر دیتے تھے کہ دشمن کے ہاتھ نہ لگ جائیں یا کوئی ان کا داماد نہ بنے۔ بعض فقر کی وجہ سے ایسا کرتے تھے اور بعض تو فقر کی وجہ سے لڑکوں اور لڑکیوں دونوں کو قتل کر دیتے تھے۔ ہندوستان کے راجپوتوں اور بعض دوسری قوموں میں بھی یہ رواج رہا ہے، آج کل برتھ کنٹرول کے نام سے حکومتیں منظم طریقے سے یہ کام کر رہی ہیں۔ چین میں شہروں میں ایک بچے اور دیہاتوں میں صرف دو بچوں کی اجازت ہے۔ چونکہ اکثر لوگوں کو لڑکے مرغوب ہوتے ہیں، اس لیے لڑکی پیدا ہونے کی صورت میں کئی مائیں دودھ ہی نہیں پلاتیں اور اس طرح قتل کا ارتکاب کرتی ہیں۔ مسلمان ملکوں کے بعض حکمران بھی کفار کی ترغیب سے رزق کے وسائل کی کمی (املاق) کا بہانہ بنا کر تحدید نسل بلکہ مسلمانوں کی نسل کشی کی پوری کوشش کر رہے ہیں اور اس کے لیے ایسے طریقے پھیلا رہے ہیں جن سے بچہ پیدا ہونے کا امکان ہی ختم ہو جاتا ہے۔ مثلاً جرثومے اور بیضے کی رگ ہی کاٹ دینا اور دوسرے ناقابل بیان طریقے اور یہ کام اس رسول صلی اللہ علیہ وسلم کی امت کے لوگ کر رہے ہیں جس نے عزل (جماع کرتے ہوئے انزال کے وقت بیوی سے علیحدہ ہو جانے) کو بھی ناپسند فرمایا، حالانکہ عزل کی صورت میں حمل کا امکان رہتا ہے، کیونکہ منی کے جرثومے انزال سے پہلے بھی مذی کے ذریعے سے رحم میں داخل ہو سکتے ہیں اور خود رسول اللہ صلی اللہ علیہ وسلم نے اس حقیقت کا اظہار فرمایا کہ عزل کرو یا نہ کرو، جو بچہ پیدا ہونا ہے ہو کر رہے گا۔ اس کے باوجود ایک مرتبہ جب لوگوں نے آپ سے عزل کے متعلق سوال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ ذٰلِکَ الْوَأْدُ الْخَفِيُّ وَھِيَ : «وَ اِذَا الْمَوْءٗدَةُ سُىِٕلَتْ » [التکویر: ۸] ] [مسلم، النکاح، باب جواز الغیلۃ… : ۱۴۱ /۱۴۴۲ ] ’’یہ پوشیدہ طریقے کا زندہ دفن کرنا ہے اور یہ فعل اللہ تعالیٰ کے اس قول کی وعید کے تحت آتا ہے کہ جب زندہ دفن کی ہوئی لڑکی سے سوال کیا جائے گا۔‘‘ مقصد یہ ہے کہ عزل میں امکان حمل کے باوجود اس کے تسلسل کا نتیجہ نسل انسانی کی ہلاکت ہے۔ اس حدیث سے منع حمل کے دوسرے ظالمانہ طریقوں کی وعید خود بخود سمجھ میں آرہی ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9،8) { وَ اِذَا الْمَوْءٗدَةُ سُىِٕلَتْ … : ’’ الْمَوْءٗدَةُ ‘‘} وہ لڑکی جسے زندہ دفن کر دیا گیا ہو۔ جاہلیت میں بعض عرب عار سے بچنے کے لیے لڑکیاں زندہ دفن کر دیتے تھے کہ دشمن کے ہاتھ نہ لگ جائیں یا کوئی ان کا داماد نہ بنے۔ بعض فقر کی وجہ سے ایسا کرتے تھے اور بعض تو فقر کی وجہ سے لڑکوں اور لڑکیوں دونوں کو قتل کر دیتے تھے۔ ہندوستان کے راجپوتوں اور بعض دوسری قوموں میں بھی یہ رواج رہا ہے، آج کل برتھ کنٹرول کے نام سے حکومتیں منظم طریقے سے یہ کام کر رہی ہیں۔ چین میں شہروں میں ایک بچے اور دیہاتوں میں صرف دو بچوں کی اجازت ہے۔ چونکہ اکثر لوگوں کو لڑکے مرغوب ہوتے ہیں، اس لیے لڑکی پیدا ہونے کی صورت میں کئی مائیں دودھ ہی نہیں پلاتیں اور اس طرح قتل کا ارتکاب کرتی ہیں۔ مسلمان ملکوں کے بعض حکمران بھی کفار کی ترغیب سے رزق کے وسائل کی کمی (املاق) کا بہانہ بنا کر تحدید نسل بلکہ مسلمانوں کی نسل کشی کی پوری کوشش کر رہے ہیں اور اس کے لیے ایسے طریقے پھیلا رہے ہیں جن سے بچہ پیدا ہونے کا امکان ہی ختم ہو جاتا ہے۔ مثلاً جرثومے اور بیضے کی رگ ہی کاٹ دینا اور دوسرے ناقابل بیان طریقے اور یہ کام اس رسول صلی اللہ علیہ وسلم کی امت کے لوگ کر رہے ہیں جس نے عزل (جماع کرتے ہوئے انزال کے وقت بیوی سے علیحدہ ہو جانے) کو بھی ناپسند فرمایا، حالانکہ عزل کی صورت میں حمل کا امکان رہتا ہے، کیونکہ منی کے جرثومے انزال سے پہلے بھی مذی کے ذریعے سے رحم میں داخل ہو سکتے ہیں اور خود رسول اللہ صلی اللہ علیہ وسلم نے اس حقیقت کا اظہار فرمایا کہ عزل کرو یا نہ کرو، جو بچہ پیدا ہونا ہے ہو کر رہے گا۔ اس کے باوجود ایک مرتبہ جب لوگوں نے آپ سے عزل کے متعلق سوال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : [ ذٰلِکَ الْوَأْدُ الْخَفِيُّ وَھِيَ : «وَ اِذَا الْمَوْءٗدَةُ سُىِٕلَتْ » [التکویر: ۸] ] [مسلم، النکاح، باب جواز الغیلۃ… : ۱۴۱ /۱۴۴۲ ] ’’یہ پوشیدہ طریقے کا زندہ دفن کرنا ہے اور یہ فعل اللہ تعالیٰ کے اس قول کی وعید کے تحت آتا ہے کہ جب زندہ دفن کی ہوئی لڑکی سے سوال کیا جائے گا۔‘‘ مقصد یہ ہے کہ عزل میں امکان حمل کے باوجود اس کے تسلسل کا نتیجہ نسل انسانی کی ہلاکت ہے۔ اس حدیث سے منع حمل کے دوسرے ظالمانہ طریقوں کی وعید خود بخود سمجھ میں آرہی ہے۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) { وَ اِذَا الصُّحُفُ نُشِرَتْ :} اعمال نامے جو بند تھے، پھیلا کر سامنے کر دیے جائیں گے، تاکہ ہر عمل کرنے والا اپنے عمل خود پڑھ لے۔ دوسرا معنی یہ ہے کہ لوگوں میں ان کے اعمال نامے دائیں یا بائیں ہاتھوں میں پھیلا دیے جائیں گے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) {وَ اِذَا السَّمَآءُ كُشِطَتْ : ’’كَشَطَ‘‘ (ض) ’’اَلشَّيْءَ‘‘} کسی چیز سے وہ چیز اتاار دینا جس نے اسے ڈھانپ رکھا ہو۔ {’’كَشَطَ الْبَعِيْرَ‘‘} اونٹ کی کھال اتارنا۔ عالم بالا پر آسمان کا پردہ جو کھال کی طرح چڑھا ہوا ہے اسے اتار کر تہ کر دیا جائے گا۔ (طبری) جیساکہ اللہ تعالیٰ کا فرمان ہے: «يَوْمَ نَطْوِي السَّمَآءَ كَطَيِّ السِّجِللِّ لِلْكُتُبِ» [ الأنبیاء : ۱۰۴] ’’جس دن ہم آسمان کو یوں لپیٹ دیں گے جیسے طومار میں اوراق لپیٹ دیے جاتے ہیں۔‘‘ کھال اتار دیے جانے کے بعد عالم بالا سب کے سامنے آشکار ہو جائے گا۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 13،12) { وَ اِذَا الْجَحِيْمُ سُعِّرَتْ … :} یہ دونوں چیزیں میدان محشر میں ہوں گی۔ تفصیل کے لیے دیکھیے سورۂ فجر (۲۳) اور سورۂ شعراء (91،90) کی تفسیر۔"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13،12) { وَ اِذَا الْجَحِيْمُ سُعِّرَتْ … :} یہ دونوں چیزیں میدان محشر میں ہوں گی۔ تفصیل کے لیے دیکھیے سورۂ فجر (۲۳) اور سورۂ شعراء (91،90) کی تفسیر۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) {عَلِمَتْ نَفْسٌ مَّاۤ اَحْضَرَتْ :} شروع سورت سے یہاں تک کل بارہ چیزوں کا ذکر ہوا ہے، جب یہ بارہ چیزیں ہو جائیں گی تو کیا ہوگا؟ اس کا جواب ہے : « عَلِمَتْ نَفْسٌ مَّاۤ اَحْضَرَتْ» کہ ہر جان جو کچھ لے کر آئی ہے اسے جان لے گی۔ {’’ نَفْسٌ ‘‘} کی تنکیر عموم کے لیے ہے، اس لیے ترجمہ ’’ ہر جان‘‘ کیا گیا ہے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 16،15) {فَلَاۤ اُقْسِمُ بِالْخُنَّسِ … : ’’اَلْخُنَّسُ‘‘ ’’خَنَسَ‘‘} (ض) (پیچھے ہٹنا) سے {’’خَانِسٌ‘‘} کی جمع بروزن {’’رُكَّعٌ‘‘} ہے۔ {’’خَنَّاسٌ‘‘} بھی اسی سے ہے۔ اسی طرح {’’ الْكُنَّسِ ‘‘ ’’كَانِسٌ‘‘} کی جمع ہے۔ {’’كِنَاسٌ‘‘} ہرن وغیرہ کی درختوں میں بنائی ہوئی جگہ، جہاں وہ چھپ جاتے ہیں۔ {’’كَنَسَ‘‘} ( ض) چھپنے کی جگہ میں داخل ہو گیا، چھپ گیا۔ {’’ الْجَوَارِ ‘‘ ’’جَرٰي يَجْرِيْ‘‘} سے {’’جَارِيَةٌ‘‘} کی جمع ہے۔ مراد سورج، چاند اور ستارے ہیں۔ انھیں {’’اَلْخُنَّسُ‘‘} (پیچھے ہٹنے والے) اس لیے کہا گیا ہے کہ یہ سب مغرب میں غروب ہونے کے بعد پھر پیچھے یعنی مشرق کی طرف آنا شروع ہو جاتے ہیں، یہاں تک کہ مشرق سے دوبارہ نمودار ہو جاتے ہیں۔ {’’ الْجَوَارِ ‘‘} چلنے والے، یعنی ان کا کام ہی چلتے رہنا ہے، مغرب سے واپس مشرق کی طرف اور وہاں سے دوبارہ مغرب کی طرف۔ {’’ الْكُنَّسِ ‘‘} چھپنے والے، یعنی مغرب سے مشرق کی طرف چلتے ہوئے نظر نہیں آتے۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16،15) {فَلَاۤ اُقْسِمُ بِالْخُنَّسِ … : ’’اَلْخُنَّسُ‘‘ ’’خَنَسَ‘‘} (ض) (پیچھے ہٹنا) سے {’’خَانِسٌ‘‘} کی جمع بروزن {’’رُكَّعٌ‘‘} ہے۔ {’’خَنَّاسٌ‘‘} بھی اسی سے ہے۔ اسی طرح {’’ الْكُنَّسِ ‘‘ ’’كَانِسٌ‘‘} کی جمع ہے۔ {’’كِنَاسٌ‘‘} ہرن وغیرہ کی درختوں میں بنائی ہوئی جگہ، جہاں وہ چھپ جاتے ہیں۔ {’’كَنَسَ‘‘} ( ض) چھپنے کی جگہ میں داخل ہو گیا، چھپ گیا۔ {’’ الْجَوَارِ ‘‘ ’’جَرٰي يَجْرِيْ‘‘} سے {’’جَارِيَةٌ‘‘} کی جمع ہے۔ مراد سورج، چاند اور ستارے ہیں۔ انھیں {’’اَلْخُنَّسُ‘‘} (پیچھے ہٹنے والے) اس لیے کہا گیا ہے کہ یہ سب مغرب میں غروب ہونے کے بعد پھر پیچھے یعنی مشرق کی طرف آنا شروع ہو جاتے ہیں، یہاں تک کہ مشرق سے دوبارہ نمودار ہو جاتے ہیں۔ {’’ الْجَوَارِ ‘‘} چلنے والے، یعنی ان کا کام ہی چلتے رہنا ہے، مغرب سے واپس مشرق کی طرف اور وہاں سے دوبارہ مغرب کی طرف۔ {’’ الْكُنَّسِ ‘‘} چھپنے والے، یعنی مغرب سے مشرق کی طرف چلتے ہوئے نظر نہیں آتے۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 18،17) { وَ الَّيْلِ اِذَا عَسْعَسَ … : ’’ عَسْعَسَ ‘‘} آنے اور جانے دونوں معنوں میں استعممال ہوتا ہے، یہاں دوسرا معنی زیادہ مناسب ہے۔ {’’ تَنَفَّسَ ‘‘} سانس لیتے ہوئے چھاتی پھیلتی ہے، صبح کی روشنی پھیلنے کی کیفیت کی نقشہ کشی انسان کے سانس لینے کی کیفیت کے ساتھ کی ہے۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18،17) { وَ الَّيْلِ اِذَا عَسْعَسَ … : ’’ عَسْعَسَ ‘‘} آنے اور جانے دونوں معنوں میں استعممال ہوتا ہے، یہاں دوسرا معنی زیادہ مناسب ہے۔ {’’ تَنَفَّسَ ‘‘} سانس لیتے ہوئے چھاتی پھیلتی ہے، صبح کی روشنی پھیلنے کی کیفیت کی نقشہ کشی انسان کے سانس لینے کی کیفیت کے ساتھ کی ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 19) { اِنَّهٗ لَقَوْلُ رَسُوْلٍ كَرِيْمٍ :} یہ ان قسموں کا جواب ہے، یعنی امر الٰہی کے پابند یہ سیارے، روزانہ جاتی ہوئی رات اور پھیلتی ہوئی صبح کا یہ مستحکم نظام زبردست شہادت ہے کہ یہ وحی رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک نہایت معزز اور ان عظیم صفات والا فرشتہ (جبریل علیہ السلام ) ہی لے کر آیا ہے۔ دن رات ، سورج چاند اور ستاروں کے نظام کی طرح یہاں بھی کسی شیطان کا دخل نہیں ہو سکتا۔ ¤ اس آیت میں {’’ رَسُوْلٍ ‘‘} سے مراد جبریل علیہ السلام ہیں، کیونکہ مشرکین مکہ کبھی کہتے : « اِنَّمَا يُعَلِّمُهٗ بَشَرٌ » [ النحل : ۱۰۳ ] ’’اسے کوئی بشر ہی سکھاتا ہے۔‘‘ کبھی کہتے : « اَفْتَرٰى عَلَى اللّٰهِ كَذِبًا اَمْ بِهٖ جِنَّةٌ » [ سبا : ۸ ] ’’کیا اس نے اللہ پر جھوٹ باندھا یا یہ دیوانہ ہے؟‘‘ تو اللہ تعالیٰ نے ان مشرکین کے قول کے جھٹلانے کو یہ آیات نازل فرمائیں اور فرمایا کہ نہ اللہ کے رسول مجنون اور دیوانے ہیں، نہ انھوں نے اپنی طرف سے اس قرآن کو بنایا ہے اور نہ کسی انسان نے انھیں یہ قرآن سکھایا ہے۔ یہ ایسا کلام نہیں ہے جس طرح شیاطین چوری سے آسمان کی کچھ باتیں سن کر کاہنوں سے کہہ دیتے ہیں، بلکہ پیغام کے طور پر اللہ کی طرف سے ایک صاحب قوت ، معتبر اور امانت دار فرشتے نے یہ قرآن اللہ کے نبی کو پہنچایا ہے ۔ (احسن التفاسیر)"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20) {ذِيْ قُوَّةٍ عِنْدَ ذِي الْعَرْشِ مَكِيْنٍ : ’’ ذِيْ قُوَّةٍ ‘‘} کی تنوین تعظیم کے لیے ہے، بڑی قوت والا۔ سورۂ نجم میں بھی جبریل علیہ السلام کا یہ وصف بیان ہوا ہے، فرمایا : « ذِيْ عَلَّمَهٗ شَدِيْدُ الْقُوٰى (5) ذُوْ مِرَّةٍ » [ النجم : 6،5 ] ’’اسے نہایت مضبوط قوتوں والے (فرشتے) نے سکھایا۔ جو بڑی طاقت والا ہے۔‘‘ جبریل علیہ السلام کی قوت کا ذکر یہاں اس لیے فرمایا ہے کہ ان کی قوت کے سبب سے شیطان ان سے بھاگتا ہے، جیسا کہ بدر میں انھیں دیکھ کر بھاگا تھا۔ (دیکھیے انفال : ۴۸) مطلب یہ ہے کہ جبریل علیہ السلام کی قوت کی وجہ سے ان کی پیغام رسانی میں نہ شیطان کا کچھ دخل ہے اور نہ ان کی امانت داری کے سبب اس پیغام رسانی میں کسی خیانت کا دخل ہے، اس لیے کسی شک و شبہ کے بغیر یہ اللہ تعالیٰ کا کلام ہے۔ (خلاصہ احسن التفاسیر)"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 21) {مُطَاعٍ ثَمَّ اَمِيْنٍ :} وہاں اس کی بات مانی ہوئی ہے، یعنی اللہ تعالیٰ کے مقرب فرشتوں میں سے ہے، جیسا کہ حدیث معراج میں ہے کہ جبریل علیہ السلام کے کہنے پر آسمان کے دروازے کھلے۔"
    },
    {
      "ayah": 22,
      "tafsir": ""
    },
    {
      "ayah": 23,
      "tafsir": "(آیت 23) {وَ لَقَدْ رَاٰهُ بِالْاُفُقِ الْمُبِيْنِ:} روشن کنارے سے مراد آسمان کا مشرقی کنارا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے جبریل علیہ السلام کو ان کی اصل صورت میں دو مرتبہ دیکھا ہے، ایک دفعہ زمین پر اور دوسری دفعہ آسمان پر۔ (دیکھیے نجم :۱ تا ۱۸) یہاں پہلی مرتبہ کا ذکر ہوا ہے، آپ صلی اللہ علیہ وسلم نے جبریل علیہ السلام کو ان کی اصل صورت میں دیکھا، ان کے چھ سو پر تھے اور پورا افق ان سے بھرا ہوا تھا۔ [ دیکھیے بخاري، بدء الخلق، باب إذا قال أحدکم أمین… : ۳۲۳۲ تا ۳۲۳۵ ]"
    },
    {
      "ayah": 24,
      "tafsir": "(آیت 24) {وَ مَا هُوَ عَلَى الْغَيْبِ بِضَنِيْنٍ:’’ضَنِيْنٌ‘‘} بخیل، یعنی اللہ تعالیٰ انھیں غییب کی جو بات بتاتے ہیں وہ اسے اپنے پاس ہی نہیں رکھ لیتے بلکہ امت تک پہنچا دیتے ہیں۔ عائشہ رضی اللہ عنھا فرماتی ہیں : [ مَنْ حَدَّثَكَ أَنَّ مُحَمَّدًا صَلَّی اللّٰهُ عَلَيْهِ وَسَلَّمَ كَتَمَ شَيْئًا مِّمَّا أُنْزِلَ عَلَيْهِ، فَقَدْ كَذَبَ، وَاللّٰهُ يَقُوْلُ: « ي يٰۤاَيُّهَا الرَّسُوْلُ بَلِّغْ مَاۤ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ » ] [ بخاري، التفسیر، باب : «یا أیھا الرسول بلغ…» : ۴۶۱۲ ] ’’جو شخص تمھیں بتائے کہ محمد صلی اللہ علیہ وسلم نے آپ پر نازل ہونے والی کوئی بات چھپائی ہے، تو اس نے یقینا جھوٹ بولا، کیونکہ اللہ تعالیٰ نے فرمایا : « يٰۤاَيُّهَا الرَّسُوْلُ بَلِّغْ مَاۤ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ » [ المائدۃ : ۶۷ ] ’’اے رسول ! پہنچا دے جو کچھ تیری طرف تیرے رب کی جانب سے نازل کیا گیا ہے۔‘‘ ¤ بعض لوگوں نے اس آیت سے یہ مطلب نکالا ہے کہ رسول اللہ صلی اللہ علیہ وسلم غیب جانتے تھے، کیونکہ بخل وہی کر سکتا ہے جس کے پاس کوئی چیز موجود ہو۔ حالانکہ اللہ تعالیٰ نے صاف فرمایا ہے : « قُلْ لَّا يَعْلَمُ مَنْ فِي السَّمٰوٰتِ وَ الْاَرْضِ الْغَيْبَ اِلَّا اللّٰهُ » [ النمل : ۶۵ ] ’’(اے نبی !) کہہ دے، اللہ کے سوا آسمانوں اور زمین میں جو بھی ہے غیب نہیں جانتا۔‘‘ اس سے صاف ظاہر ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو غیب کی جو باتیں بتائی گئی ہیں وہ لوگوں کو بتانے میں آپ بخل نہیں کرتے۔ حقیقت یہ ہے کہ اگر کسی شخص کو غیب کی کچھ باتیں بتا دی جائیں تو وہ اس سے عالم الغیب نہیں بن جاتا، کیونکہ وہ صرف اتنی بات جانتا ہے زیادہ نہیں۔ ورنہ اگر اس وجہ سے رسول اللہ صلی اللہ علیہ وسلم کو عالم الغیب مانا جائے کہ اللہ تعالیٰ نے آپ کو غیب کی کئی باتیں بتائی ہیں تو امت کو بھی عالم الغیب ماننا پڑے گا، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کو جو کچھ بتایا گیا تھا آپ نے اللہ کے حکم کے مطابق وہ سب کچھ امت کو بتا دیا۔"
    },
    {
      "ayah": 25,
      "tafsir": ""
    },
    {
      "ayah": 26,
      "tafsir": ""
    },
    {
      "ayah": 27,
      "tafsir": ""
    },
    {
      "ayah": 28,
      "tafsir": ""
    },
    {
      "ayah": 29,
      "tafsir": "(آیت 29) { وَ مَا تَشَآءُوْنَ اِلَّاۤ اَنْ يَّشَآءَ اللّٰهُ رَبُّ الْعٰلَمِيْنَ :} یعنی تمھارا چاہنا بھی اللہ کے چاہنے اور توفیق دینے پر موقوف ہے۔ مزید دیکھیے سورۂ یونس (۱۰۰)، انعام (۱۱۲) ، قصص (۵۶) اور دہر (۳۰)۔"
    }
  ]
}