{
  "surah": "Al-Burooj",
  "surah_number": 85,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) {وَ السَّمَآءِ ذَاتِ الْبُرُوْجِ:’’ الْبُرُوْجِ ‘‘ ’’بُرْجٌ ‘‘} کی جمع ہے، اس کا اصل معنی ہے ’’نمایاں اور ظاہر ہونے والی چیز۔‘‘ {’’ تَبَرَّجَ ‘‘} کا معنی بے پردہ ہونا، ظاہر ہونا ہے۔ اس لیے بلند محل کو بُرج کہتے ہیں، شہر کی فصیل کے بلند حصوں کو بھی برج کہتے ہیں اور آسمان پر ستاروں کے اجتماع سے جو صورتیں نظر آتی ہیں انھیں بروج کہتے ہیں۔ وہ آسمانی ٹھکانے بھی بروج کہلاتے ہیں جن میں شیطانوں سے آسمان کی حفاظت کے لیے فرشتے پہرا دیتے ہیں۔ سورج اور چاند کی منزلوں کو بھی بروج کہا جاتا ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {وَ الْيَوْمِ الْمَوْعُوْدِ:} قیامت کا دن، جس کا جزا و سزا کے لیے وعدہ کیا گیا ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {وَ شَاهِدٍ وَّ مَشْهُوْدٍ: ’’ شَاهِدٍ ‘‘} حاضر ہونے والا۔ {’’ مَشْهُوْدٍ ‘‘} جس کے پاس حاضر ہوا جائے۔ لفظوں کے لحاظ سے اس میں وہ سب لوگ شامل ہیں جو کہیں حاضر ہو سکتے ہیں اور مشاہدہ کر سکتے ہیں۔ اسی طرح وہ تمام چیزیں بھی شامل ہیں جن کا مشاہدہ ہو سکتا ہے یا جن کے پاس کوئی حاضر ہو سکتا ہے۔ اہلِ علم نے {’’ شَاهِدٍ ‘‘} اور {’’ مَشْهُوْدٍ ‘‘} کی تفسیر کرتے ہوئے جس چیز کو زیادہ اہم یا معروف یا مناسب سمجھا اس کے ساتھ تفسیر کردی۔ چنانچہ بہت سے صحابہ و تابعین نے {’’ شَاهِدٍ ‘‘} سے مراد یوم جمعہ اور {’’ مَشْهُوْدٍ ‘‘} سے مراد یوم عرفہ لیا ہے۔ الفاظ کے عموم سے معلوم ہوتا ہے کہ اس سے مراد ہر وہ فرد ہے جو کہیں حاضر ہوتاہے اور حاضری کا ہر وہ موقع ہے جس میں کوئی فرد حاضر ہوتا ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {قُتِلَ اَصْحٰبُ الْاُخْدُوْدِ: ’’خَدَّ يَخُدُّ خَدًّا ‘‘ (ن) ’’ اَلْأَرْضَ وَ فِي الْأَرْضِ‘‘} زمین میں لمبا گڑھا کھودنا۔ {’’ الْاُخْدُوْدِ ‘‘} لمبا گڑھا۔ خندق، کھائی۔ اس کی جمع {’’أَخَادِيْدُ‘‘} ہے۔ یعنی عظیم الشان برجوں والا آسمان، قیامت کا دن، کسی بھی مقام پر حاضر ہونے والے لوگ اور کوئی بھی موقع جس میں لوگ حاضر ہوتے ہیں، یہ سب چیزیں اگر اپنا وجود رکھتی ہیں اور یقینا ان کے وجود میں کوئی شبہ نہیں تو یہ بات بھی یقینی سمجھو کہ جن لوگوں نے بڑی بڑی خندقیں کھدوا کر انھیں آگ سے بھرا، پھر جو اہلِ ایمان اپنے ایمان پر ڈٹے رہے اور مرتد نہ ہوئے انھیں اس آگ میں پھینک کر ان کے جلنے کا تماشا دیکھتے رہے، وہ مارے گئے، کیونکہ وہ زبردست ہستی جو ان برجوں والے آسمان کو تھامے ہوئے ہے، جس نے انصاف کے لیے قیامت کا دن مقرر کر رکھا ہے اور جس کی نگاہ سے نہ کسی جگہ کوئی حاضر ہونے والا غائب ہے اور نہ حاضری کا کوئی موقع، وہ ان سنگ دل ظالموں کو ان کے ظلم کی سزا ضرور دے گا اور وہ نہ اس کی نگاہ سے غائب ہو سکیں گے اور نہ عذاب سے بچ سکیں گے۔ ¤ ➋ دنیا میں ایسے کئی واقعات ہوئے جن میں اہلِ ایمان کو خندق کھود کر آگ میں جلا دیا گیا، سند کے لحاظ سے سب سے صحیح ایک کافر بادشاہ کا وہ طویل واقعہ ہے جو صحیح مسلم میں صہیب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کیا ہے۔ حدیث لمبی ہے، اس کے آخر میں ہے کہ اس کافر بادشاہ کی رعایا کے لوگ مسلمان ہوگئے تو اس نے گلیوں کے کناروں پر گڑھے کھدوا کر ان میں آگ بھڑکائی اور حکم دیا کہ جو شخص اسلام نہ چھوڑے اسے آگ میں پھینک دو، چنانچہ اہلِ ایمان کو ان گڑھوں میں پھینک دیا گیا۔ مفصل واقعہ کے لیے دیکھیے صحیح مسلم میں {’’بَابُ قِصَّةِ أَصْحَابِ الْأُخْدُوْدِ (۳۰۰۵)۔‘‘} تفسیر ابن کثیر میں مومنوں کو آگ میں جلائے جانے کے مزید واقعات بھی موجود ہیں۔"
    },
    {
      "ayah": 5,
      "tafsir": ""
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 7،6) { اِذْ هُمْ عَلَيْهَا قُعُوْدٌ …:} یعنی کنارے پر بیٹھ کر ان کے جلنے کا تماشا دیکھ رہے تھے، انھیں جلتے ہوئے دیکھ کر بھی ان کے دلوں میں کوئی نرمی پیدا نہیں ہوئی۔ اس طرح کے واقعات کافر قوتوں کے زیر سایہ آج بھی ہو رہے ہیں، مثلاً انڈیا، برما اور افریقہ وغیرہ میں مسلمانوں کو زندہ جلانے کی خبریں تواتر سے آرہی ہیں، ان کا انجام بھی اصحاب الاخدود کی طرح ہوگا۔ (ان شاء اللہ) مگر ان مظلوم مسلمانوں کو کفار کے ظلم و ستم سے بچانا دنیا کے تمام مسلمانوں پر فرض ہے، جس کی ادائیگی میں کوتاہی اور جہاد ترک کرنے ہی کی وجہ سے کفار کو یہ جرأت ہو رہی ہے۔اللہ تعالیٰ کا فرمان ہے: « وَ مَا لَكُمْ لَا تُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ وَ الْمُسْتَضْععَفِيْنَ مِنَ الرِّجَالِ وَ النِّسَآءِ وَ الْوِلْدَانِ الَّذِيْنَ يَقُوْلُوْنَ رَبَّنَاۤ اَخْرِجْنَا مِنْ هٰذِهِ الْقَرْيَةِ الظَّالِمِ اَهْلُهَا وَ اجْعَلْ لَّنَا مِنْ لَّدُنْكَ وَلِيًّا وَّ اجْعَلْ لَّنَا مِنْ لَّدُنْكَ نَصِيْرًا » [ النساء : ۷۵ ] ’’اور تمھیں کیا ہے کہ تم اللہ کے راستے میں اور ان بے بس مردوں اور عورتوں اور بچوں کی خاطر نہیں لڑتے جو کہتے ہیں کہ اے ہمارے رب! ہمیں اس بستی سے نکال لے جس کے رہنے والے ظالم ہیں اور ہمارے لیے اپنے پاس سے کوئی حمایتی بنا دے اور ہمارے لیے اپنے پاس سے کوئی مدد گار بنا۔‘‘"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7،6) { اِذْ هُمْ عَلَيْهَا قُعُوْدٌ …:} یعنی کنارے پر بیٹھ کر ان کے جلنے کا تماشا دیکھ رہے تھے، انھیں جلتے ہوئے دیکھ کر بھی ان کے دلوں میں کوئی نرمی پیدا نہیں ہوئی۔ اس طرح کے واقعات کافر قوتوں کے زیر سایہ آج بھی ہو رہے ہیں، مثلاً انڈیا، برما اور افریقہ وغیرہ میں مسلمانوں کو زندہ جلانے کی خبریں تواتر سے آرہی ہیں، ان کا انجام بھی اصحاب الاخدود کی طرح ہوگا۔ (ان شاء اللہ) مگر ان مظلوم مسلمانوں کو کفار کے ظلم و ستم سے بچانا دنیا کے تمام مسلمانوں پر فرض ہے، جس کی ادائیگی میں کوتاہی اور جہاد ترک کرنے ہی کی وجہ سے کفار کو یہ جرأت ہو رہی ہے۔اللہ تعالیٰ کا فرمان ہے: « وَ مَا لَكُمْ لَا تُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ وَ الْمُسْتَضْععَفِيْنَ مِنَ الرِّجَالِ وَ النِّسَآءِ وَ الْوِلْدَانِ الَّذِيْنَ يَقُوْلُوْنَ رَبَّنَاۤ اَخْرِجْنَا مِنْ هٰذِهِ الْقَرْيَةِ الظَّالِمِ اَهْلُهَا وَ اجْعَلْ لَّنَا مِنْ لَّدُنْكَ وَلِيًّا وَّ اجْعَلْ لَّنَا مِنْ لَّدُنْكَ نَصِيْرًا » [ النساء : ۷۵ ] ’’اور تمھیں کیا ہے کہ تم اللہ کے راستے میں اور ان بے بس مردوں اور عورتوں اور بچوں کی خاطر نہیں لڑتے جو کہتے ہیں کہ اے ہمارے رب! ہمیں اس بستی سے نکال لے جس کے رہنے والے ظالم ہیں اور ہمارے لیے اپنے پاس سے کوئی حمایتی بنا دے اور ہمارے لیے اپنے پاس سے کوئی مدد گار بنا۔‘‘"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) ➊ {وَ مَا نَقَمُوْا مِنْهُمْ …:} ان اہلِ ایمان نے ان ظالموں پر یا کسی دوسرے پر کوئی زیادتی نہیں کی تھی جس کا وہ بدلا لے رہے ہوں، ان کا جرم صرف اللہ پر ایمان لا کر اس پر قائم رہنا تھا۔ آیت میں {’’ اِلَّاۤ اَنْ يُّؤْمِنُوْا ‘‘} فرمایا ہے جو حال و استقبال پر دلالت کرتا ہے، {’’إِلَّا أَنْ آمَنُوْا‘‘} نہیں فرمایا جوماضی کا صیغہ ہے، یعنی ان کا جرم یہی نہ تھا کہ وہ ایمان لے آئے تھے، بلکہ یہ تھا کہ وہ اب بھی ایمان پر قائم تھے۔ ¤ ➋ { بِاللّٰهِ الْعَزِيْزِ الْحَمِيْدِ:} یعنی ان کا اللہ تعالیٰ پر ایمان رکھنا کوئی جرم یا غلط کام نہ تھا، بلکہ وہ اس اللہ پر ایمان رکھتے تھے جو عزیز و حمید ہے اور آئندہ آیت میں مذکور صفات کا مالک ہے اور ان صفات کی وجہ سے اس کا حق ہے کہ اس پر ایمان رکھا جائے۔ یہ قرآن مجید کاخاص اسلوب ہے کہ واقعات بیان کرتے ہوئے بھی وہ عقائد کی درستی اور احکام کی وضاحت کا اہتمام جاری رکھتا ہے، اس کی ایک مثال یہ آیت ہے۔"
    },
    {
      "ayah": 9,
      "tafsir": ""
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10 ) { اِنَّ الَّذِيْنَ فَتَنُوا الْمُؤْمِنِيْنَ …: ’’فِتْنَةٌ ‘‘} کا معنی ہے، کھرے کھوٹے کی آزمائش کے لیے سونے کو آگ میں ڈالنا۔ پھر یہ لفظ جلانے، ستانے ، عذاب دینے اور حق سے برگشتہ کرنے کی کوشش کرنے کے معنی میں بھی استعمال ہونے لگا۔ {’’ اِنَّ الَّذِيْنَ فَتَنُوْا ‘‘} سے مراد اصحاب الاخدود بھی ہیں، جنھوں نے اہلِ ایمان کو آگ کی خندقوں میں ڈالا اور کفارِ قریش اور بعد میں آنے والے وہ تمام ظالم بھی جو انواع وا قسام کے عذاب دے دے کر اہل ایمان کو ایمان سے ہٹانے کی کوشش کرتے رہے۔ {’’ فَلَهُمْ عَذَابُ جَهَنَّمَ وَ لَهُمْ عَذَابُ الْحَرِيْقِ ‘‘} جہنم میں کئی طرح کا عذاب ہے، سب سے سخت عذاب جلنے کا ہے، اس لیے اس کا ذکر خاص طور پر فرمایا، اس کے علاوہ اہلِ ایمان کو جلانے والوں کے حسب حال جلنے ہی کا عذاب ہے۔ {’’ ثُمَّ لَمْ يَتُوْبُوْا ‘‘} ( پھر توبہ نہیں کی ) اللہ کی شان کریمی دیکھیے کہ اہلِ ایمان کو جلانے والوں کو بھی جہنم کی سزا تب سنائی جب وہ توبہ کے بغیر مریں، کیونکہ توبہ کرنے سے گزشتہ تمام گناہ معاف ہو جاتے ہیں۔ اس سے توبہ کی ترغیب بھی نکل رہی ہے۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) { اِنَّ الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ … :} یہاں ایمان و عمل صالح والے لوگوں کے لیے جنت کی بشارت کے ذکر کی دو مناسبتیں ہیں، ایک تو یہ کہ اگر مسلمانوں کو ستانے والے لوگ بھی ایمان لا کر صالح عمل والے بن جائیں تو ان کے لیے بھی وہ باغات ہیں جن کے تلے نہریں بہتی ہیں۔ دوسری یہ کہ ایمان اور عمل صالح کے حامل جن مسلمانوں کو آزمائش کی بھٹیوں میں جھونکا جارہا ہے وہ غم نہ کریں، یہ وقت گزر جانے والا ہے، آخرت میں ان کے لیے وہ عظیم الشان باغات تیار ہیں جن کے تلے نہریں بہ رہی ہیں اور سب سے بڑی کامیابی یہی ہے۔ حقیقت یہ ہے کہ ایمان والوں کو آزمائشوں اور مصیبتوں میں ثابت قدم رکھنے والی چیز اللہ تعالیٰ کا وعدہ ہے کہ وہ انھیں جنت دے گا۔ کس قدر ظالم ہیں وہ لوگ جو روحانیت کا لبادہ اوڑھ کر جنت کا مذاق اڑاتے اور اسے بے وقعت قرار دینے کی کوشش کرتے ہیں۔ تفصیل کے لیے دیکھیے سورۂ سجدہ کی آیت (۱۶) کی تفسیر۔"
    },
    {
      "ayah": 12,
      "tafsir": "(آیت 12) { اِنَّ بَطْشَ رَبِّكَ لَشَدِيْدٌ: ’’ بَطْشَ ‘‘} وہ پکڑ جس میں تیزی اور سختی پائی جائے۔ رب تعالیٰ کی بطش جسے وہ خود شدید بتا رہا ہے، کس قدر سخت ہوگی؟ اہل ایمان کو ایذا پہنچانے والوں کو ڈرایا جا رہا ہے کہ رب تعالیٰ کی پکڑ بہت سخت ہے، اس سے بچ جاؤ۔ دوسری جگہ فرمایا : « وَ كَذٰلِكَ اَخْذُ رَبِّكَ اِذَاۤ اَخَذَ الْقُرٰى وَ هِيَ ظَالِمَةٌ اِنَّ اَخْذَهٗۤ اَلِيْمٌ شَدِيْددٌ» [ھود : ۱۰۲ ] ’’اور تیرے رب کی پکڑ ایسی ہی ہوتی ہے، جب وہ بستیوں کو اس حال میں پکڑتا ہے کہ وہ ظلم کرنے والی ہوتی ہیں، یقینا اس کی پکڑ بڑی دردناک ہے، بہت سخت ہے۔‘‘"
    },
    {
      "ayah": 13,
      "tafsir": "(آیت 13) { اِنَّهٗ هُوَ يُبْدِئُ وَ يُعِيْدُ:} یہ نہ سمجھنا کہ دنیا میں تمھارے ظلم و ستم پر باز پرس نہیں ہوئی تو مرنے کے بعد بھی نہیں ہوگی، جس نے تمھیں پہلے پیدا کیا وہی دوبارہ زندہ کرکے تمھیں تمھارے اعمال کی جزا دے گا۔"
    },
    {
      "ayah": 14,
      "tafsir": "(آیت 14) { وَ هُوَ الْغَفُوْرُ الْوَدُوْدُ:} اللہ تعالیٰ کے قہر و جلال کے ذکر کے ساتھ ہی اس کی صفات رحمت کا تذکرہ ہے کہ اگر تم توبہ کر لو تو وہ بے حد بخشنے والا ہے۔ {’’ الْوَدُوْدُ ‘‘ ’’وَدَّ يَوَدُّ وُدًّا‘‘} (س) سے {’’فَعُوْلٌ‘‘} کے وزن پر مبالغے کا صیغہ ہے، بہت محبت کرنے والا، یعنی وہ بندوں کا دشمن نہیں بلکہ ان سے بہت محبت کرنے والا ہے، سزا صرف اس کو دیتا ہے جو سرکشی پر اتر آئے۔"
    },
    {
      "ayah": 15,
      "tafsir": "(آیت 16،15) {ذُو الْعَرْشِ الْمَجِيْدُ … :} وہ تمھاری طرح معمولی اور عارضی اقتدار والا نہیں، بلکہ اس عرش عظیم کا مالک ہے جو زمین و آسمان اور ان کے مابین سے بھی بڑا ہے، نہ وہ تمھاری طرح کم ظرف ہے کہ معمولی سی قدرت ملے تو ظلم پہ اتر آئے، بلکہ وہ بڑی شان والا ہے اور نہ وہ تمھاری طرح بے بس ہے کہ مجبور ہو کر اسے اپنے ارادے ترک کرنا پڑیں، بلکہ وہ جو چاہے کر گزرنے والا ہے۔ ایسے زبردست قوت والے پروردگار سے تمھیں ہر وقت ڈرتے رہنا چاہیے اور اس کی رحمت کا طلب گار رہنا چاہیے۔ یاد رہے کہ یہاں {’’ ذُو الْعَرْشِ ‘‘ } کے بعد{’’ الْمَجِيْدُ ‘‘} بھی اللہ تعالیٰ کی صفت ہے، اس لیے اس پر رفع ہے، یہ {’’ الْعَرْشِ ‘‘} کی صفت نہیں، ورنہ یہ مجرور ہوتا۔"
    },
    {
      "ayah": 16,
      "tafsir": "(آیت 16،15) {ذُو الْعَرْشِ الْمَجِيْدُ … :} وہ تمھاری طرح معمولی اور عارضی اقتدار والا نہیں، بلکہ اس عرش عظیم کا مالک ہے جو زمین و آسمان اور ان کے مابین سے بھی بڑا ہے، نہ وہ تمھاری طرح کم ظرف ہے کہ معمولی سی قدرت ملے تو ظلم پہ اتر آئے، بلکہ وہ بڑی شان والا ہے اور نہ وہ تمھاری طرح بے بس ہے کہ مجبور ہو کر اسے اپنے ارادے ترک کرنا پڑیں، بلکہ وہ جو چاہے کر گزرنے والا ہے۔ ایسے زبردست قوت والے پروردگار سے تمھیں ہر وقت ڈرتے رہنا چاہیے اور اس کی رحمت کا طلب گار رہنا چاہیے۔ یاد رہے کہ یہاں {’’ ذُو الْعَرْشِ ‘‘ } کے بعد{’’ الْمَجِيْدُ ‘‘} بھی اللہ تعالیٰ کی صفت ہے، اس لیے اس پر رفع ہے، یہ {’’ الْعَرْشِ ‘‘} کی صفت نہیں، ورنہ یہ مجرور ہوتا۔"
    },
    {
      "ayah": 17,
      "tafsir": "(آیت 18،17) { هَلْ اَتٰىكَ حَدِيْثُ الْجُنُوْدِ … :} یہ جو فرمایا تھا کہ اللہ کی پکڑ بڑی سخت ہے، اسے دلوں میں جما دینے کے لیے ثمود و فرعون کے دو قصے جو عرب میں زیادہ مشہور تھے، وہ اہلِ مکہ کو یاد دلائے، تاکہ وہ ان قصوں سے عبرت پکڑیں۔ (احسن التفاسیر) اس کے علاوہ نبی صلی اللہ علیہ وسلم اور مسلمانوں کو تسلی دلانا بھی مقصود ہے۔"
    },
    {
      "ayah": 18,
      "tafsir": "(آیت 18،17) { هَلْ اَتٰىكَ حَدِيْثُ الْجُنُوْدِ … :} یہ جو فرمایا تھا کہ اللہ کی پکڑ بڑی سخت ہے، اسے دلوں میں جما دینے کے لیے ثمود و فرعون کے دو قصے جو عرب میں زیادہ مشہور تھے، وہ اہلِ مکہ کو یاد دلائے، تاکہ وہ ان قصوں سے عبرت پکڑیں۔ (احسن التفاسیر) اس کے علاوہ نبی صلی اللہ علیہ وسلم اور مسلمانوں کو تسلی دلانا بھی مقصود ہے۔"
    },
    {
      "ayah": 19,
      "tafsir": "(آیت 20،19) {بَلِ الَّذِيْنَ كَفَرُوْا … :} حق تو یہ تھا کہ پہلے سرکشوں کا انجام دیکھ کر یہ لوگ ایمان لے آتے، مگر یہ الٹا خواہ مخواہ جھٹلانے میں لگے ہوئے ہیں، حالانکہ انھیں یاد رکھنا چاہیے کہ اللہ تعالیٰ انھیں چاروں طرف سے گھیرے ہوئے ہے، وہ جب چاہے پکڑلے۔"
    },
    {
      "ayah": 20,
      "tafsir": "(آیت 20،19) {بَلِ الَّذِيْنَ كَفَرُوْا … :} حق تو یہ تھا کہ پہلے سرکشوں کا انجام دیکھ کر یہ لوگ ایمان لے آتے، مگر یہ الٹا خواہ مخواہ جھٹلانے میں لگے ہوئے ہیں، حالانکہ انھیں یاد رکھنا چاہیے کہ اللہ تعالیٰ انھیں چاروں طرف سے گھیرے ہوئے ہے، وہ جب چاہے پکڑلے۔"
    },
    {
      "ayah": 21,
      "tafsir": "(آیت 22،21) {بَلْ هُوَ قُرْاٰنٌ مَّجِيْدٌ … :} اور اگر ان کا جھٹلانا اس خیال سے ہے کہ یہ کلامِ الٰہی نہیں یا اس میں شیطان کا کچھ دخل ہے تو ان کی یہ بات بھی غلط ہے، بلکہ یہ بڑی شان والا قرآن ہے، اس لوح میں سے اتارا گیا ہے جس کی فرشتوں کے ذریعے سے حفاظت کی جاتی ہے، کسی شیطان کا اس میں دخل نہیں ہو سکتا۔ اس کے کلام الٰہی ہونے میں کوئی شبہ نہیں، اگر انھیں شبہ ہے تو وہ بھی اس جیسی کوئی سورت بنا کر لے آئیں، جب یہ نہیں کرسکتے تو اس کے کلامِ الٰہی ہونے میں کیا شبہ رہ گیا؟ (ماخوذ از احسن التفاسیر)"
    },
    {
      "ayah": 22,
      "tafsir": "(آیت 22،21) {بَلْ هُوَ قُرْاٰنٌ مَّجِيْدٌ … :} اور اگر ان کا جھٹلانا اس خیال سے ہے کہ یہ کلامِ الٰہی نہیں یا اس میں شیطان کا کچھ دخل ہے تو ان کی یہ بات بھی غلط ہے، بلکہ یہ بڑی شان والا قرآن ہے، اس لوح میں سے اتارا گیا ہے جس کی فرشتوں کے ذریعے سے حفاظت کی جاتی ہے، کسی شیطان کا اس میں دخل نہیں ہو سکتا۔ اس کے کلام الٰہی ہونے میں کوئی شبہ نہیں، اگر انھیں شبہ ہے تو وہ بھی اس جیسی کوئی سورت بنا کر لے آئیں، جب یہ نہیں کرسکتے تو اس کے کلامِ الٰہی ہونے میں کیا شبہ رہ گیا؟ (ماخوذ از احسن التفاسیر)"
    }
  ]
}