{
  "surah": "Ad-Dhuhaa",
  "surah_number": 93,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1تا3) ➊ {وَ الضُّحٰى (1) وَ الَّيْلِ اِذَا سَجٰى …:’’ الضُّحٰى ‘‘} سورج طلوع ہونے کے بعد جب پوری طرح روشن ہو جاتا ہے۔ {’’ سَجٰى ‘‘ ’’سَجَا يَسْجُوْ سَجْوًا‘‘} (ن) پُر سکون ہونا۔ {’’ وَدَّعَكَ ‘‘ ’’وَدَعَ يَدَعُ‘‘} (چھوڑنا) سے باب تفعیل ہے جو چھوڑنے میں مبالغے کا معنی رکھتا ہے۔ {’’ قَلٰى ‘‘ ’’ قَلٰي يَقْلِيْ قِلًي وَ قَلاَءً ‘‘} (ض،س) {’’ اَلرَّجُلَ أَبْغَضَهٗ ‘‘} کسی سے بغض رکھنا۔ ¤ ➋ جندب بن سفیان رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم بیمار ہو گئے تو دو یا تین راتیں (تہجد کے لیے) نہ اٹھے۔ ایک عورت آئی اور کہنے لگی : ’’اے محمد! مجھے امید ہے کہ تمھارا شیطان تمھیں چھوڑ گیا ہے، دو تین راتوں سے میں نے اسے تمھارے پاس آتے نہیں دیکھا۔‘‘ اس پر اللہ تعالیٰ نے یہ سورت نازل فرمائی۔ [ بخاري، التفسیر، باب قولہ : «ما ودعک ربک وما قلٰی» : ۴۹۵۰ ] جندب رضی اللہ عنہ ہی سے مروی دوسری روایت میں ہے کہ ایک دفعہ جبریل علیہ السلام نے آنے میں دیر کر دی، یہاں تک کہ مشرکین کہنے لگے کہ محمد( صلی اللہ علیہ وسلم ) کو اس کے رب نے چھوڑ دیا ہے، تو اللہ تعالیٰ نے یہ سورت نازل فرمائی۔ [ طبری : ۲۴ /۴۸۷، ح : ۳۷۸۵۷ ] قسم اور جواب قسم میں مناسبت یہ ہے کہ دوپہر کو سورج خوب روشن ہوتا ہے، اس کے بعد سیاہ رات چھا جاتی ہے تو کوئی بھی نہیں سمجھتا کہ یہ اللہ تعالیٰ کے ناراض ہونے کی وجہ سے ہے، تو وحی کی روشنی کے بعد کچھ دیر اگر وقفہ ہوگیا تو کیوں سمجھا گیا کہ اللہ تعالیٰ نے تمھیں چھوڑ دیا ہے؟ ایسا ہرگز نہیں ہے! بلکہ حقیقت یہ ہے کہ جس طرح دن بھر آفتاب کی روشنی و گرمی کے بعد انسانی جسم کو آرام اور سکون کے لیے رات کی ضرورت ہے، اسی طرح وحی کے بارگراں کے بعد طبیعت کو سکون اور مزید وحی کے تحمل کے لیے وقفہ کی ضرورت ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 1تا3) ➊ {وَ الضُّحٰى (1) وَ الَّيْلِ اِذَا سَجٰى …:’’ الضُّحٰى ‘‘} سورج طلوع ہونے کے بعد جب پوری طرح روشن ہو جاتا ہے۔ {’’ سَجٰى ‘‘ ’’سَجَا يَسْجُوْ سَجْوًا‘‘} (ن) پُر سکون ہونا۔ {’’ وَدَّعَكَ ‘‘ ’’وَدَعَ يَدَعُ‘‘} (چھوڑنا) سے باب تفعیل ہے جو چھوڑنے میں مبالغے کا معنی رکھتا ہے۔ {’’ قَلٰى ‘‘ ’’ قَلٰي يَقْلِيْ قِلًي وَ قَلاَءً ‘‘} (ض،س) {’’ اَلرَّجُلَ أَبْغَضَهٗ ‘‘} کسی سے بغض رکھنا۔ ¤ ➋ جندب بن سفیان رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم بیمار ہو گئے تو دو یا تین راتیں (تہجد کے لیے) نہ اٹھے۔ ایک عورت آئی اور کہنے لگی : ’’اے محمد! مجھے امید ہے کہ تمھارا شیطان تمھیں چھوڑ گیا ہے، دو تین راتوں سے میں نے اسے تمھارے پاس آتے نہیں دیکھا۔‘‘ اس پر اللہ تعالیٰ نے یہ سورت نازل فرمائی۔ [ بخاري، التفسیر، باب قولہ : «ما ودعک ربک وما قلٰی» : ۴۹۵۰ ] جندب رضی اللہ عنہ ہی سے مروی دوسری روایت میں ہے کہ ایک دفعہ جبریل علیہ السلام نے آنے میں دیر کر دی، یہاں تک کہ مشرکین کہنے لگے کہ محمد( صلی اللہ علیہ وسلم ) کو اس کے رب نے چھوڑ دیا ہے، تو اللہ تعالیٰ نے یہ سورت نازل فرمائی۔ [ طبری : ۲۴ /۴۸۷، ح : ۳۷۸۵۷ ] قسم اور جواب قسم میں مناسبت یہ ہے کہ دوپہر کو سورج خوب روشن ہوتا ہے، اس کے بعد سیاہ رات چھا جاتی ہے تو کوئی بھی نہیں سمجھتا کہ یہ اللہ تعالیٰ کے ناراض ہونے کی وجہ سے ہے، تو وحی کی روشنی کے بعد کچھ دیر اگر وقفہ ہوگیا تو کیوں سمجھا گیا کہ اللہ تعالیٰ نے تمھیں چھوڑ دیا ہے؟ ایسا ہرگز نہیں ہے! بلکہ حقیقت یہ ہے کہ جس طرح دن بھر آفتاب کی روشنی و گرمی کے بعد انسانی جسم کو آرام اور سکون کے لیے رات کی ضرورت ہے، اسی طرح وحی کے بارگراں کے بعد طبیعت کو سکون اور مزید وحی کے تحمل کے لیے وقفہ کی ضرورت ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 1تا3) ➊ {وَ الضُّحٰى (1) وَ الَّيْلِ اِذَا سَجٰى …:’’ الضُّحٰى ‘‘} سورج طلوع ہونے کے بعد جب پوری طرح روشن ہو جاتا ہے۔ {’’ سَجٰى ‘‘ ’’سَجَا يَسْجُوْ سَجْوًا‘‘} (ن) پُر سکون ہونا۔ {’’ وَدَّعَكَ ‘‘ ’’وَدَعَ يَدَعُ‘‘} (چھوڑنا) سے باب تفعیل ہے جو چھوڑنے میں مبالغے کا معنی رکھتا ہے۔ {’’ قَلٰى ‘‘ ’’ قَلٰي يَقْلِيْ قِلًي وَ قَلاَءً ‘‘} (ض،س) {’’ اَلرَّجُلَ أَبْغَضَهٗ ‘‘} کسی سے بغض رکھنا۔ ¤ ➋ جندب بن سفیان رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم بیمار ہو گئے تو دو یا تین راتیں (تہجد کے لیے) نہ اٹھے۔ ایک عورت آئی اور کہنے لگی : ’’اے محمد! مجھے امید ہے کہ تمھارا شیطان تمھیں چھوڑ گیا ہے، دو تین راتوں سے میں نے اسے تمھارے پاس آتے نہیں دیکھا۔‘‘ اس پر اللہ تعالیٰ نے یہ سورت نازل فرمائی۔ [ بخاري، التفسیر، باب قولہ : «ما ودعک ربک وما قلٰی» : ۴۹۵۰ ] جندب رضی اللہ عنہ ہی سے مروی دوسری روایت میں ہے کہ ایک دفعہ جبریل علیہ السلام نے آنے میں دیر کر دی، یہاں تک کہ مشرکین کہنے لگے کہ محمد( صلی اللہ علیہ وسلم ) کو اس کے رب نے چھوڑ دیا ہے، تو اللہ تعالیٰ نے یہ سورت نازل فرمائی۔ [ طبری : ۲۴ /۴۸۷، ح : ۳۷۸۵۷ ] قسم اور جواب قسم میں مناسبت یہ ہے کہ دوپہر کو سورج خوب روشن ہوتا ہے، اس کے بعد سیاہ رات چھا جاتی ہے تو کوئی بھی نہیں سمجھتا کہ یہ اللہ تعالیٰ کے ناراض ہونے کی وجہ سے ہے، تو وحی کی روشنی کے بعد کچھ دیر اگر وقفہ ہوگیا تو کیوں سمجھا گیا کہ اللہ تعالیٰ نے تمھیں چھوڑ دیا ہے؟ ایسا ہرگز نہیں ہے! بلکہ حقیقت یہ ہے کہ جس طرح دن بھر آفتاب کی روشنی و گرمی کے بعد انسانی جسم کو آرام اور سکون کے لیے رات کی ضرورت ہے، اسی طرح وحی کے بارگراں کے بعد طبیعت کو سکون اور مزید وحی کے تحمل کے لیے وقفہ کی ضرورت ہے۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) { وَ لَلْاٰخِرَةُ خَيْرٌ لَّكَ مِنَ الْاُوْلٰى:} اس میں آپ کو تسلی دلائی کہ ہر آنے والا  لمحہ آپ کے لیے پہلے لمحہ سے بہتر آیا ہے۔ اسی طرح آئندہ بھی بعد کی ہرحالت آپ کے لیے پہلی سے بہتر ہوگی۔ نبوت کے بعد کی زندگی آپ کے لیے پہلے سے بہتر اور آخرت کی زندگی دنیا سے بہتر ہو گی۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) { وَ لَسَوْفَ يُعْطِيْكَ رَبُّكَ فَتَرْضٰى:} یہ مزید تسلی ہے، اس میں اللہ کی فتح و نصرتت ، لوگوں کا فوج در فوج اسلام میں داخل ہونا، زمین کے مشارق و مغارب کاآپ کی امت کے قبضے میں آنا، قیامت کو آپ کے ہاتھ میں {’’لِوَاءُ الْحَمْدِ‘‘} ہونا، مقام محمود ملنا، شفاعت کبریٰ، امت کی مغفرت، غرض وہ سب کچھ شامل ہے جو اللہ تعالیٰ نے آپ کو دیا اور دے گا۔"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) {اَلَمْ يَجِدْكَ يَتِيْمًا فَاٰوٰى: ’’آوَي يُؤْوِيْ إِيْوَاءً‘‘} (افعال) جگہ دینا۔ اس میں آپ کے ابتدائی حالات کا بیان ہے، آپ ماں کے پیٹ میں تھے کہ والد فوت ہوگئے۔ والدہ نے آپ کو پالا۔ چھ برس کے تھے کہ والدہ فوت ہو گئیں، پھر دادا نے پرورش کی۔ آٹھ برس کے تھے کہ وہ بھی فوت ہوگئے، پھر چچا ابوطالب نے بیٹوں سے بڑھ کر پالا۔ یہ سب اسباب اللہ تعالیٰ ہی نے اپنے فضل سے مہیا کیے۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {وَ وَجَدَكَ ضَآلًّا فَهَدٰى:} نبوت سے پہلے اللہ تعالیٰ نے ہر قسم کی برائی سے آپ کی حفاظت فرمائی، حتیٰ کہ فرمایا : « فَقَدْ لَبِثْتُ فِيْكُمْ عُمُرًا مِّنْ قَبْلِهٖ اَفَلَا تَعْقِلُوْنَ » [ یونس : ۱۶ ] ’’(انھیں کہہ دو کہ) یقینا میں نے نبوت سے پہلے ایک عمر تم میں گزاری ہے، کیا تم عقل نہیں کرتے؟‘‘ مگر اللہ تعالیٰ کی عبادت کا صحیح طریقہ کیا ہے، یہ آپ کو معلوم نہ تھا، یہ اس وقت معلوم ہوا جب اللہ تعالیٰ نے آپ کو نبوت عطا فرمائی، چنانچہ اللہ تعالیٰ فرماتے ہیں : « وَ كَذٰلِكَ اَوْحَيْنَاۤ اِلَيْكَ رُوْحًا مِّنْ اَمْرِنَا مَا كُنْتَ تَدْرِيْ مَا الْكِتٰبُ وَ لَا الْاِيْمَانُ » [الشورٰی : ۵۲ ] ’’اور اسی طرح ہم نے تیری طرف اپنے حکم سے ایک روح کی وحی کی، تو نہیں جانتا تھا کہ کتاب کیا ہے اور نہ یہ کہ ایمان کیا ہے۔‘‘ اس آیت میں اس احسان کا ذکر ہے کہ تم راستے سے ناواقف تھے، تو وہ تمھیں ہم نے بتایا۔ اس کے علاوہ دیکھیے سورۂ ہود (۴۹)، عنکبوت (۴۸) اور سورۂ قصص (۸۶)۔"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) {وَ وَجَدَكَ عَآىِٕلًا فَاَغْنٰى: ’’عَالَ يَعِيْلُ عَيْلاً وَعَيْلَةً‘‘} (ض) فقیر ہونا۔ {’’ عَآىِٕلًا ‘‘} فقیر۔ سورۂ توبہ میں فرمایا: « وَ اِنْ خِفْتُمْ عَيْلَةً فَسَوْفَ يُغْنِيْكُمُ اللّٰهُ مِنْ فَضْلِهٖ » [التوبۃ : ۲۸ ] ’’اور اگر تم کسی قسم کے فقر سے ڈرتے ہو تو اللہ جلد ہی تمھیں اپنے فضل سے غنی کر دے گا۔‘‘ رسول اللہ صلی اللہ علیہ وسلم کے والد آپ کی پیدائش سے پہلے ہی فوت ہوگئے، انھوں نے اپنی میراث میں ایک لونڈی ام ایمن کے علاوہ کوئی زیادہ مال نہیں چھوڑا۔ بچپن میں اپنے فقر کا حال رسول اللہ صلی اللہ علیہ وسلم نے خود بیان فرمایا، ابو ہریرہ رضی اللہ عنہ روایت کرتے ہیں کہ نبی صلی اللہ علیہ وسلم نے فرمایا : [ مَا بَعَثَ اللّٰهُ نَبِيًّا إِلَّا رَعَی الْغَنَمَ، فَقَالَ أَصْحَابُهُ وَأَنْتَ؟ فَقَالَ نَعَمْ، كُنْتُ أَرْعَاهَا عَلٰی قَرَارِيْطَ لِأَهْلِ مَكَّةةَ ] [ بخاري، الإجارۃ، باب رعی الغنم علی قراریط : ۲۲۶۲] ’’اللہ تعالیٰ نے کوئی نبی نہیں بھیجا جس نے بھیڑ بکریاں نہ چرائی ہوں۔‘‘ آپ کے صحابہ نے کہا : ’’اور آپ نے بھی (چرائی ہیں)؟‘‘ آپ صلی اللہ علیہ وسلم نے فرمایا : ’’میں انھیں مکہ والوں کے لیے چند قیراطوں پر چرایا کرتا تھا۔‘‘ ظاہر ہے اگر آپ صلی اللہ علیہ وسلم کے پاس اپنی یا ابو طالب کی بھیڑ بکریاں ہی ہوتیں تو آپ کو اہلِ مکہ کی بھیڑ بکریاں اجرت پر چرانے کی کیا ضرورت تھی۔ اتنے افلاس کے بعد اللہ تعالیٰ نے آپ کو اس طرح غنی کر دیا کہ مکہ کی سب سے مال دار خاتون خدیجہ رضی اللہ عنھا نے پہلے آپ کو تجارت میں شریک کیا، پھر آپ صلی اللہ علیہ وسلم سے نکاح کر لیا اور اپنا تمام مال آپ کے حوالے کر دیا۔ پھر وہ وقت بھی آیا کہ آپ کے پاس بنو نضیر، بنو قریظہ اور خیبر، بحرین اور یمن وغیرہ کی غنیمتوں اور خراج کے ڈھیر لگ گئے۔ یہ مالی غنا تھا، اس کے ساتھ ساتھ اللہ تعالیٰ نے آپ کو ایسا قلبی غنا بھی عطا فرمایا تھا کہ آپ اس طرح بے دریغ خرچ کرتے تھے جیسے آپ کو فقر کا کوئی خوف ہی نہ ہو۔"
    },
    {
      "ayah": 9,
      "tafsir": "(آیت 9) { فَاَمَّا الْيَتِيْمَ فَلَا تَقْهَرْ:} آپ نے یتیمی اور اس کی تلخی اور بے چارگی دیکھی ہ ہے اور یہ بھی دیکھا ہے کہ اللہ تعالیٰ نے کس طرح آپ کو جگہ دی اور آپ پر بے پناہ مہربانیاں فرمائیں، اب دونوں چیزوں کا تقاضا ہے کہ یتیم پر سختی نہ کرو بلکہ زیادہ سے زیادہ حسن سلوک کرو۔"
    },
    {
      "ayah": 10,
      "tafsir": "(آیت 10) {وَ اَمَّا السَّآىِٕلَ فَلَا تَنْهَرْ:} اسی طرح آپ نے تنگ دستی دیکھی ہے اور اللہ تعالیٰ کا غنی کرنا بھی، ان دونوں کا تقاضا ہے کہ سائل کی ضرورت پوری کرو۔ اگر نہیں کر سکتے تو لطف و کرم سے پیش آؤ ، جھڑکی نہ دو اور آپ نے کتاب اور ایمان سے ناواقفی کا زمانہ دیکھا ہے، پھر اللہ نے آپ کو یہ نعمتیں دیں، اب اگر کوئی علم کے متعلق سوال کرے یا کسی چیز کا سوال کرے تو اسے ڈانٹنا ہرگز نہیں! بلکہ کوئی علم کا طالب ہو یا مال کا، اس سے حسن خلق کے ساتھ پیش آئیں، اس کی حاجت پوری کریں یا اچھے طریقے سے عذر پیش کر دیں۔"
    },
    {
      "ayah": 11,
      "tafsir": "(آیت 11) { وَ اَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ:} اور شکر ادا کرنے کے لیے اپنے رب کی نعمتوں کا تذکرہ کرتے رہو۔"
    }
  ]
}