{
  "surah": "At-Tin",
  "surah_number": 95,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) {وَ التِّيْنِ وَ الزَّيْتُوْنِ:} انجیر اور زیتون دو ایسے پھل ہیں جو اپنی جامعیت اور فوائد کی کثرت میں انسان کے جامع الفضائل ہونے کے ساتھ مشابہت رکھتے ہیں، اس لیے انھیں انسان کے احسن تقویم میں پیدا کیے جانے کے شاہد کے طور پر پیش کیا گیا ہے۔ اکثر مفسرین نے انجیر اور زیتون سے مراد سر زمین شام لی ہے جہاں یہ کثرت سے اُگتے ہیں اور جہاں عیسیٰ علیہ السلام اور اللہ کے بہت سے پیغمبر پیدا ہوئے ہیں اور یہی بات راجح ہے، کیونکہ اس کے بعد طور سینا اور بلد امین کا ذکر ہے۔"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {وَ طُوْرِ سِيْنِيْنَ:} طور سینا جہاں اللہ تعالیٰ موسیٰ علیہ السلام سے ہم کلام ہوئے۔ مزید دیکھیے سورۂ مومنون (۲۰)۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) {وَ هٰذَا الْبَلَدِ الْاَمِيْنِ:} شہر مکہ جو ابراہیم اور اسماعیل علیھما السلام نے آباد کیا اور جہاں رسول اللہ صلی اللہ علیہ وسلم پیدا ہوئے۔ اسے بلد امین اس لیے فرمایا ہے کہ ابراہیم علیہ السلام نے اس کے لیے دعا کی تھی : « رَبِّ اجْعَلْ هٰذَا بَلَدًا اٰمِنًا » [ البقرۃ : ۱۲۶ ] ’’اے میرے رب! اس (جگہ) کو ایک امن والا شہر بنا دے۔‘‘"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) { لَقَدْ خَلَقْنَا الْاِنْسَانَ … :} قسم اور جواب قسم میں مناسبت یہ ہے کہ سر زمین شام ممیں پیدا ہونے والے جلیل القدر پیغمبروں اور طور سینا اور شہر مکہ کی شہرت کا باعث بننے والے پیغمبروں کی زندگی اس بات کی شاہد ہے کہ اللہ تعالیٰ نے انسان کو بہترین بناوٹ میں پیدا کیا ہے۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) {ثُمَّ رَدَدْنٰهُ اَسْفَلَ سٰفِلِيْنَ:} اس بہترین بناوٹ میں اس کی شکل و صورت کا حسن، اس کی عقل، اس کی فطرت پر پیدائش اور وہ سب کچھ شامل ہے جو کسی حیوان کو حاصل نہیں۔ پھر اگر وہ اس عقل اور فطرت کے تقاضوں پر عمل نہ کرے بلکہ انسانیت سے اتر کر حیوانیت میں جاگرے اور شہوت و غضب اور دوسری حیوانی صفات سے مغلوب ہوجائے، تو اس سے زیادہ نیچا اور ذلیل کوئی نہیں، کیونکہ پھر وہ اس حد تک گر جاتا ہے کہ کوئی حیوان بھی نہیں گرتا، حتیٰ کہ وہ اپنے مالک و خالق کو بھی بھول جاتا ہے، اس کے ساتھ شریک بنانے لگتا ہے اور زمین میں ایسا فساد برپا کرتا ہے جو کوئی حیوان بھی نہیں کر سکتا۔ ظاہر ہے کہ اس کا نتیجہ آگ ہے اور اس میں گرنے والوں سے نیچا اور ذلیل کوئی اور نہیں ہوسکتا۔ انھی کے متعلق اللہ تعالیٰ نے فرمایا: « اُولٰٓىِٕكَ كَالْاَنْعَامِ بَلْ هُمْ اَضَلُّ » [ الأعراف : ۱۷۹ ] ’’یہ لوگ جانوروں کی طرح ہیں بلکہ ان سے بھی گئے گزرے ہیں۔‘‘"
    },
    {
      "ayah": 6,
      "tafsir": "(آیت 6) { اِلَّا الَّذِيْنَ اٰمَنُوْا وَ عَمِلُوا الصّٰلِحٰتِ … :} اور اگر یہ احسن تقویم کے مطابق ایمان لا کر عمل صالح کرے تو اس کو ایسا اجر ملے گا جو کبھی منقطع نہیں ہوگا۔"
    },
    {
      "ayah": 7,
      "tafsir": "(آیت 7) {فَمَا يُكَذِّبُكَ بَعْدُ بِالدِّيْنِ:} اللہ تعالیٰ نے انسان کو بہترین ساخت میں پیدا ککیا، پھر بعض نے تو اس ساخت کے تقاضوں کے مطابق ایمان اور عمل صالح اختیار کیا اور بعض نافرمانی کی وجہ سے ’’اسفل السافلین‘‘ ٹھہرے۔ ان دونوں کے عمل کا لازمی نتیجہ ہے کہ ایک دن ایسا ہو جس میں ہر ایک کو نیکی اور بدی کی جزا و سزا دی جائے۔ اتنی واضح دلیل کے بعد اے انسان! تجھے کون سی چیز آمادہ کر رہی ہے کہ تو جزا کو جھٹلا دے ؟ اس کا دوسرا ترجمہ یہ ہے : ’’اے نبی ! اس کے بعد کون ہے جو تجھے جزا کے بارے میں جھٹلائے؟‘‘"
    },
    {
      "ayah": 8,
      "tafsir": "(آیت 8) { اَلَيْسَ اللّٰهُ بِاَحْكَمِ الْحٰكِمِيْنَ:} کوئی معمولی سا انصاف کرنے والا ہو وہ بھی اپنے اختیار میں جزا و سزا کا اہتمام کیے بغیر نہیں رہے گا، تو اللہ جو سب حاکموں سے بڑا حاکم ہے، وہ اس کا اہتمام کیوں نہیں کرے گا؟ ¤ ترمذی وغیرہ میں ابوہریرہ رضی اللہ عنہ سے ایک روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ’’جب تم میں سے کوئی سورت {’’ وَ التِّيْنِ وَ الزَّيْتُوْنِ ‘‘} پڑھے اور {’’ اَلَيْسَ اللّٰهُ بِاَحْكَمِ الْحٰكِمِيْنَ ‘‘} پر پہنچے تو کہے : [ بَلٰی وَ أَنَا عَلٰی ذٰلِكَ مِنَ الشَّاهِدِيْنَ ] [ترمذي، تفسیر القرآن، باب و من سورۃ والتین : ۳۳۴۷ ] ’’کیوں نہیں! اور میں اس پر شہادت دینے والوں میں سے ہوں۔‘‘ مگر یہ روایت صحیح نہیں، کیونکہ ترمذی رحمہ اللہ نے فرمایا کہ ابوہریرہ رضی اللہ عنہ سے ایک اعرابی نے یہ روایت بیان کی ہے جس کا نام ہی معلوم نہیں۔"
    }
  ]
}