{
  "surah": "Al-Qadr",
  "surah_number": 97,
  "tafsir": [
    {
      "ayah": 1,
      "tafsir": "(آیت 1) ➊ {اِنَّاۤ اَنْزَلْنٰهُ فِيْ لَيْلَةِ الْقَدْرِ:} ’’ہم نے اسے قدر کی رات میں نازل کیا‘‘ یعنی قرآن مجید کو۔ جب کوئی چیز اتنی مشہور ہو کہ خود بخود ذہن میں آجاتی ہو تو اس کی عظمت واضح کرنے کے لیے نام لینے کے بجائے اس کی ضمیر پر اکتفا کیا جاتا ہے۔ ¤ ➋ {’’ الْقَدْرِ ‘‘} کا معنی تقدیر ہے، یعنی تقدیر کی رات۔ اس معنی کی تائید اس آیت سے ہوتی ہے: « فِيْهَا يُفْرَقُ كُلُّ اَمْرٍ حَكِيْمٍ » [ الدخان : ۴ ] ’’اس رات میں ہر محکم کام کا فیصلہ کیا جاتا ہے۔‘‘ یعنی سال بھر میں جو کام ہونا ہوتا ہے اس رات میں لوح محفوظ سے نقل کرکے ان فرشتوں کے حوالے کر دیا جاتا ہے جو اسے سرانجام دیتے ہیں۔ {’’ الْقَدْرِ ‘‘} کا دوسرا معنی عظمت ہے، یعنی عظمت والی رات۔ اس کے بعد اس کی عظمت پر دلالت کرنے والی چیزیں بیان کی ہیں، یعنی اس کا ہزار مہینے سے بہتر ہونا، اس میں ملائکہ اور جبریل علیہ السلام کا اترنا اور اس کا سرا سر سلامتی والی ہونا۔ لیلۃ القدر کے مفہوم میں یہ معنی بھی شامل ہے۔ ¤ ➌ لیلۃ القدر میں قرآن مجید اتارنے کا مطلب عبداللہ بن عباس رضی اللہ عنھما نے یہ بیان فرمایا ہے کہ لیلۃالقدر میں پورا قرآن ایک ہی دفعہ آسمان دنیا پر نازل کیا گیا، پھر وہاں سے تھوڑا تھوڑا کرکے کئی سالوں میں رسول اللہ صلی اللہ علیہ وسلم پر نازل ہوا۔ تفسیر ابن کثیر کے محقق حکمت بن بشیر نے سورۂ بنی اسرائیل کی آیت (۱۰۶) : « وَ قُرْاٰنًا فَرَقْنٰهُ لِتَقْرَاَهٗ عَلَى النَّاسِ عَلٰى مُكْثٍ» کی تفسیر کی تحقیق میں ابن عباس رضی اللہ عنھما کے اس قول کے متعلق فرمایا ہے کہ اسے طبری، نسائی (سنن کبریٰ، تفسیر سورۃ فرقان)، حاکم (مستدرک : ۲ ؍ ۳۶۸) اور بیہقی (دلائل النبوۃ : ۷؍ ۱۳۱ ) نے روایت کیا ہے اور سب نے اسے{’’دَاوٗدُ بْنُ أَبِيْ هِنْدٍ عَنْ عِكْرَمَةَ عَنِ ابْنِ عَبَّاسٍ‘‘} کی سند سے بیان کیا ہے۔ حاکم نے اسے صحیح کہا اور ذہبی نے ان کی موافقت کی ہے اور حافظ ابن حجر نے بھی فتح الباری (۹؍۴) میں ان کی موافقت کی ہے ۔ ¤ دوسرا مطلب یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم پر قرآن مجید کے نزول کی ابتدا لیلۃ القدر میں ہوئی۔ یہ معنی شعبی رحمہ اللہ نے کیا ہے۔ ( طبری) اور زمین پر قرآن مجید کے لیلۃ القدر میں اترنے کا معنی اس کے سوا ہو بھی نہیں سکتا۔ ¤ ➍ اس رات کے رمضان میں ہونے کی تصریح خود قرآن میں ہے، فرمایا : « شَهْرُ رَمَضَانَ الَّذِيْۤ اُنْزِلَ فِيْهِ الْقُرْاٰنُ» [ البقرۃ  : ۱۸۵ ] ’’رمضان کا مہینا وہ ہے جس میں قرآن اتارا گیا۔‘‘ اور صحیح احادیث میں ہے کہ وہ رمضان کے آخری عشرے کی کوئی ایک طاق رات (۲۱، ۲۳، ۲۵، ۲۷، ۲۹) ہے۔ متعین نہ کرنے میں یہ حکمت ہے کہ مسلمان ان راتوں میں زیادہ سے زیادہ عبادت کرلیں۔ رسول اللہ صلی اللہ علیہ وسلم پورے آخری عشرے ہی میں شب بیداری، اعتکاف اور گھروالوں کو جگانے کا اہتمام کرتے تھے۔ [ دیکھیے بخاري، فضل لیلۃ القدر ، باب العمل في العشرالأواخر من رمضان : ۲۰۲۴ ]"
    },
    {
      "ayah": 2,
      "tafsir": "(آیت 2) {وَ مَاۤ اَدْرٰىكَ مَا لَيْلَةُ الْقَدْرِ:} یہ سوال اس رات کی عظمت کے بیان کے لیے ہے، یعنی مخلوق میں سے کوئی ایسا ہے ہی نہیں جو اس رات کی عظمت جان سکے اور بتا سکے، یہ جاننا اور بتانا اللہ ہی کا کام ہے۔"
    },
    {
      "ayah": 3,
      "tafsir": "(آیت 3) { لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ اَلْفِ شَهْرٍ:} یعنی لیلۃ القدر اپنی برکتوں اور عبادت کے اجرو ثواب کے لحاظ سے ہزار مہینوں سے بہتر ہے، جن میں یہ رات نہ ہو۔ پھر ہزار ماہ سے یا تو یہ عدد مراد ہے یا عربوں کے عام دستور کے مطابق کثرت مراد ہے جو اس عدد سے بھی زیاہ ہو سکتی ہے۔ یہاں بعض مفسرین نے بنو امیہ کے ایام حکومت ( جو ایک ہزار ماہ تھے) کی مذمت میں ایک روایت لکھی ہے، حالانکہ ترمذی رحمہ اللہ نے اسے روایت کرکے خود ہی ضعیف قرار دیا ہے۔ [ دیکھیے ترمذي، تفسیر القرآن، باب ومن سورۃ لیلۃ القدر : ۳۳۵۰ ] اس کے برعکس حقیقت یہ ہے کہ بنو امیہ کا عہد اگرچہ خلفائے راشدین کے عہد کا مقابلہ نہیں کر سکتا، مگر وہ بھی اسلام کے عروج کا عہد ہے جس میں اسلام کا پھریرا مشرق سے مغرب تک لہرایا۔ انھی کے عہد تک پورا عالم اسلام ایک خلیفہ کے تحت رہا اور اسلام غالب، سر بلند اور محفوظ رہا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : [لَا يَزَالُ هٰذَا الدِّيْنُ عَزِيْزًا مَنِيْعًا إِلَی اثْنَيْ عَشَرَ خَلِيْفَةً، كُلُّهُمْ مِّنْ  قُرَيْشٍ ] [ مسلم، الإمارۃ، باب الناس تبع لقریش… : 1821/9، عن جابر بن سمرۃ رضی اللہ عنہ ] ’’یہ دین بارہ خلفاء تک غالب و محفوظ رہے گا،جو سب قریش سے ہوں گے۔‘‘ ابو داؤد میں انھی جابر بن سمرہ رضی اللہ عنہ سے مروی الفاظ یہ ہیں : [ لاَ يَزَالُ هٰذَا الدِّيْنُ قَائِمًا حَتّٰی يَكُوْنَ عَلَيْكُمُ اثْنَا عَشَرَ خَلِيْفَةً، كُلُّهُمْ تَجْتَمِعُ عَلَيْهِ الْأُمَّةُ، كُلُّهُمْ مِّنْ قُرَيْشٍ ] [ أببو داوٗد، کتاب المھدي : ۴۲۷۹، وقال الألباني صحیح ] ’’یہ دین قائم رہے گا حتیٰ کہ بارہ خلفاء ہوں، جن سب پر امت جمع ہو گی، سب کے سب قریش سے ہوں گے۔‘‘ روافض اور ان سے متاثر لوگ اسلام کے اس سنہرے دور کے متعلق فضول باتیں کرتے رہتے ہیں، حالانکہ اس کے بعد نہ امت مسلمہ کو ایک خلیفہ پر جمع ہونے کی سعادت حاصل ہوسکی اور نہ اسلام اس طرح غالب رہا جس طرح ان کے عہد میں غالب تھا۔"
    },
    {
      "ayah": 4,
      "tafsir": "(آیت 4) ➊ {تَنَزَّلُ الْمَلٰٓىِٕكَةُ وَ الرُّوْحُ فِيْهَا …:’’ الرُّوْحُ ‘‘} سے مراد جبریل علیہ السلام ہیں۔ اللہ تعالیٰ نے فرمایا: « نَزَلَ بِهِ الرُّوْحُ الْاَمِيْنُ » [الشعراء : ۱۹۳] ’’یہ قرآن روح الامین لے کر اترے ہیں۔‘‘ ملائکہ میں شامل ہونے کے باوجود ان کے شرف کی وجہ سے ان کا الگ ذکر فرمایا، جس طرح سورۂ بقرہ کی اس آیت میں فرشتوں کے ذکر کے بعد ان کے شرف کی وجہ سے ان کا خاص طور پر الگ ذکر فرمایا: « مَنْ كَانَ عَدُوًّا لِّلّٰهِ وَ مَلٰٓىِٕكَتِهٖ وَ رُسُلِهٖ وَ جِبْرِيْلَ وَ مِيْكٰىلَ فَاِنَّ اللّٰهَ عَددُوٌّ لِّلْكٰفِرِيْنَ» [البقرۃ : ۹۸] ’’جو کوئی اللہ اور اس کے فرشتوں اور اس کے رسولوں اور جبریل اور میکال کا دشمن ہو تو بے شک اللہ سب کافروں کا دشمن ہے۔‘‘ ¤ ➋ یعنی ملائکہ اور جبریل علیہ السلام اللہ تعالیٰ کے حکم سے ہر امر کے متعلق آئندہ سال میں جو کچھ ہونے کا فیصلہ ہو چکا ہوتا ہے وہ لے کر زمین پر اترتے ہیں۔"
    },
    {
      "ayah": 5,
      "tafsir": "(آیت 5) ➊ {سَلٰمٌ هِيَ حَتّٰى مَطْلَعِ الْفَجْرِ: ’’ سَلٰمٌ ‘‘} خبر مقدم اور {’’ هِيَ ‘‘} مبتدا مؤخر ہے، یعنی وہ رات طلوع فجر تک سراسر سلامتی ہے۔ مغرب سے فجر تک رات بھر اس میں اہلِ ایمان شیطان کے شر اور ہر قسم کے فتنے سے سلامت رہتے ہیں اور اپنے دلوں میں عجیب اطمینان و سکون اور سلامتی محسوس کرتے ہیں۔ ¤ ➋ لیلۃ القدر، اس کی تلاش اور اعتکاف کے مسائل و فضائل کے لیے کتب احادیث کا مطالعہ فرمائیں۔"
    }
  ]
}